{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7371,
			"arabicnumber": 7371,
			"text": "Telah menceritakan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Zakariya bin Ishaq] dari [Yahya bin Muhammad bin Abdullah bin Shaifi] dari [Abu Ma'bad] dari [Ibn Abbas] radliyallahu'anhuma, bahwa Nabi shallallahu 'alaihi wasallam pernah mengutus Mu'adz ke negeri Yaman",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7372,
			"arabicnumber": 7372,
			"text": "Telah menceritakan kepadaku [Abdullah bin Abu Al Aswad] telah menceritakan kepada kami [Al Fadll bin Al 'Ala] telah menceritakan kepada kami [Ismail bin Umayyah] dari [Yahya bin Muhmmad bin Abdullah bin Shaifi] ia mendengar [Abu Ma'bad] mantan budak Ibn Abbas, berkata, aku mendengar [Ibn Abbas] berkata, \"Dikala Nabi shallallahu 'alaihi wasallam mengutus Mu'adz ke negeri Yaman, Nabi berpesan: \"Wahai Mu'adz, engkau mendatangi kaum ahli kitab, maka jadikanlah materi dakwah pertama-tama yang engkau sampaikan adalah agar mereka mentauhidkan Allah ta'ala. Jika mereka telah sadar terhadap hal ini, beritahulah mereka bahwa Allah mewajibkan lima shalat kepada mereka dalam sehari semalam. Jika mereka telah shalat, beritahulah mereka bahwa Allah mewajibkan zakat harta mereka, yang diambil dari yang kaya, dan diberikan kepada yang miskin, dan jika mereka telah mengikrarkan yang demikian, ambilah harta mereka dan jagalah harta mereka yang kesemuanya harus dijaga kehormatannya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7373,
			"arabicnumber": 7373,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Abu Hushain] dan [Al Asy'ats bin Sulaim] keduanya mendengar [Al Aswad bin Hilal] dari [Mu'adz bin Jabal] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Mu'adz, tahukah kamu hak Allah atas hamba?\" \"Allah dan rasul-Nya yang lebih tahu, \" Jawab Mu'adz. Nabi bersabda lagi: \"Yaitu agar mereka beribadah kepada-Nya dengan tidak menyekutukan-Nya dengan sesuatu apapun. Tahukah engkau apa hak mereka atas Allah?\" tanya Nabi selanjutnya.\"Allah dan Rasul-Nya yang lebih lebih tahu.\" Jawab Mu'adz. Nabi bersabda: \"Yaitu agar Dia tidak menyiksa mereka",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7374,
			"arabicnumber": 7374,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Abdurrahman bin Abdullah bin Abdurrahman bin Abu Sha'sha'ah] dari [Ayahnya] dari [Abu Sa'id Al Khudzri], bahwa ada seorang laki-laki mendengar seseorang yang membaca QULHUWALLAHU AHAD (QS.Surat al-ikhlas), ia mengulang-ulanginya. Pagi harinya, ia menemui Nabi shallallahu 'alaihi wasallam dan mengutarakan kisahnya yang seolah-olah si laki-laki tadi menganggap terlalu remeh (sedikit) bacaannya. Spontan Rasulullah Shallallahu'alaihiwasallam bersabda: \"Sungguh surat tadi menyamai sepertiga alquran.\" Dan [Ismail bin Ja'far] menambahkan dari [Malik] dari [Abdurrahman] dari [Ayahnya] dari [Abu Sa'id] telah mengabariku saudaraku [Qatadah bin Nu'man] dari nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7375,
			"arabicnumber": 7375,
			"text": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibn Wahb] telah menceritakan kepada kami [Amru] dari [Ibnu Abu Hilal] bahwa [Abu Rijal Muhammad bin Abdurrahman] menceritakan kepadanya dari Ibunya [Amrah binti Abdurrahman] yang dahulu dalam asuhan Aisyah isteri Nabi shallallahu 'alaihi wasallam, dari ['Aisyah], bahwa Nabi shallallahu 'alaihi wasallam pernah mengutus seorang laki-laki dalam sebuah eskpedisi militer, lantas laki-laki tersebut membaca untuk sahabatnya dalam shalatnya dengan QULHUWALLAHU AHAD (Surat al Ikhlash) dan menutupnya juga dengan surat itu. Dikala mereka pulang, mereka menceritakan hal ini kepada Nabi shallallahu 'alaihi wasallam, lantas Nabi shallallahu 'alaihi wasallam bersabda: 'Tolong tanyailah dia, mengapa dia berbuat sedemikian? ' Mereka pun menanyainya, dan sahabat tadi menjawab, 'Sebab surat itu adalah menggambarkan sifat Arrahman, dan aku sedemikian menyukai membacanya.' Spontan Nabi shallallahu 'alaihi wasallam bersabda: 'Beritahukanlah kepadanya bahwa Allah menyukainya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7376,
			"arabicnumber": 7376,
			"text": "Telah menceritakan kepada kami [Muhammad bin Salam] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Zaid bin Wahb] dan [Abu dlabyan] dari [Jarir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah tak bakalan menyayangi siapa saja yang tidak menyayangi manusia",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7377,
			"arabicnumber": 7377,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ashim Al ahwal] dari [Abu Utsman an Nahdi] dari [Usamah bin Zaid] berkata, \"Kami di sisi Nabi shallallahu 'alaihi wasallam, lantas utusan salah seorang di antara kedua puteri beliau memanggilnya karena anak laki-lakinya diambang kematian. Lantas Nabi bersabda kepada sang utusan: \"Pulanglah engkau ke rumah anak puteriku, dan beritahukanlah kepadanya bahwa segala milik Allah-lah yang diambil-Nya dan apa yang diberikan-Nya, dan segala sesuatu di sisi-Nya telah ada ketentuan yang ditetapkan. Suruhlah dia untuk bersabar dan mengharap-harap pahala.\" Anak puteri beliau kembali mengutus utusannya disertai sumpah yang isinya, 'Anda harus mendatanginya.' Kontan Nabi shallallahu 'alaihi wasallam berdiri bersama Sa'd bin Ubadah dan Muadz bin Jabal, lalu anak kecil dari puteri beliau diserahkan beliau sedang nyawanya sudah tersengal-sengal seolah-olah sudah di penghujung (sisa-sia) hayatnya. Kedua mata Nabi terus berlinang, maka Sa'd bertanya, 'Wahai Rasulullah, mengapa mata anda menangis? ' Nabi menjawab: \"Inilah rahmat yang Allah letakkan dalam hati hamba-Nya, hanyasanya Allah menyayangi hamba-Nya yang penyayang",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7378,
			"arabicnumber": 7378,
			"text": "Telah menceritakan kepada kami ['Abdan] dari [Abu Hamzah] dari [Al A'masy] dari [Sa'id bin Jubair] dari [Abu 'Abdurrahman assulami] dari [Abu Musa Al asy'ari] berkata, \"Nabi shallallahu 'alaihi wasallam Shallallahu'alaihiwasallam bersabda: \"Tidak ada seorang pun yang lebih bersabar atas gangguan yang didengarnya daripada Allah, ada manusia mengaku Allah mempunyai anak (yaitu orang nashrani), namun Allah masih juga memberi mereka kesehatan dan rejeki",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7379,
			"arabicnumber": 7379,
			"text": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Sulaiman bin Bilal] telah menceritakan kepadaku [Abdullah bin Dinar] dari [Ibn Umar] radliyallahu'anhuma dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kunci keghaiban ada lima; tidak mengetahuinya selain Allah, tidak ada yang mengetahui kandungan yang mengempes (gugur, berkurang) selain Allah, tidak ada yang mengetahui apa yang terjadi esok hari selain Allah, tidak ada yang mengetahui kapan hujan datang selain Allah, dan tidak ada siapapun manusia yang tahu di bumi mana berada akan meninggal selain Allah, dan tidak ada yang mengetahui kapan kiamat terjadi selain Allah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7380,
			"arabicnumber": 7380,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ismail] dari [Asy Sya'bi] dari [Masruq] dari ['Aisyah] radliyallahu'anhuma, ia berkata, \"Barangsiapa menceritakan kepadamu bahwa Muhammad Shallallahu'alaihiwasallam melihat Tuhannya berarti ia telah dusta, karena Allah berfirman: '(Ia tidak bisa dimengetahui oleh pandangan) ' (Qs. Al An'am: 103), dan barangsiapa menceritakan kepadamu bahwa ia tahu yang ghaib, berarti ia telah dusta, sebab Muhammad bersabda: 'Tidak ada yang tahu yang ghaib selain Allah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7381,
			"arabicnumber": 7381,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Mughirah] telah menceritakan kepada kami [Syaqiq bin Maslamah] berkata, [Abdullah] berkata, 'Pernah kami shalat di belakang Nabi shallallahu 'alaihi wasallam dan kami mengucapkan, 'ASSALAMU ALALLAHI (Semoga keselamatan atas Allah) ', maka beliau berkata: 'Sesungguhnya Allah adalah Assalaam', namun katakanlah olehmu sekalian: 'ATTAHIYAATULILLAH WA ASH SHALAWATU WATH THAYYIBAT ASSALAAMU ALAIKA AYYUHANNABIYU WA RAHMATULLAHI WA BARAKAATUHU ASSALAAMU 'ALAINA WA 'ALA 'IBAADILLAHISH SHAALIHIINA ASYHADU AN LAA ILAAHA ILLAALLAHU WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Segala pujian milik Allah', dan kesejahteraan serta segala kebaikan, semoga kesejahteraan atasmu wahai nabi shallallahu 'alaihi wasallam, juga rahmat Allah dan barakah-Nya. Dan semoga kesejahteraan terlimpahkan kepada kita, dan hamba-hamba Allah yang shalih, saya bersaksi bahwa tiada sesembahan yang hak selain Allah semata dan saya bersaksi bahwa Muhammad adalah hamba-Nya dan Rasul-Nya)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7382,
			"arabicnumber": 7382,
			"text": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibn Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibn Syihab] dari [Sa'id] -yaitu Ibnul Musayyab- dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat Allah menggenggam bumi dan melipat langit dengan tangan kanan-Nya serta berkata 'Akulah sang raja, mana raja-raja bumi?\" Dan [Syu'aib] dan [Azzubaidi] dan [Ibn Musafir] dan [Ishaq bin Yahya] juga berkata dari [Az Zuhri] dan [Abu Salmah] semisalnya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7383,
			"arabicnumber": 7383,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami ['Abdul Warits] telah menceritakan kepada kami [Husain Al Mu'aliim] telah menceritakan kepadaku [Abdullah bin Buraidah] dari [Yahya bin Ya'mar] dari [Ibn Abbas] bahwa Nabi shallallahu 'alaihi wasallam pernah memanjatkan doa: 'AUUDZU BI'IZZATILLAHILLLADZII LAA ILAAHA ILLAA ANTAL LADZII LAA YAMUUTU WAL JINNU WAL INSU YAMUUTUUTUUNA (Saya berlindung dengan kekuasaan Allah yang tiada sesembahan yang hak selain Dia, yang tidak pernah mati sedang jin dan manusia akan mati)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7384,
			"arabicnumber": 7384,
			"text": "Telah menceritakan kepada kami [Ibn Abu Al Aswad] telah menceritakan kepada kami [Harami] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Terus saja -penghuninya- dimasukkan ke dalam Neraka.\" (dalam jalur lain disebutkan) Dan telah berkata kepadaku [Khalifah] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] dan dari [Mu'tamir] aku mendengar [bapakku] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Terus saja -penghuninya- dimasukkan ke dalam Neraka '(sehingga ia berkata 'Masih adakah tambahan?\" (Qs. Qaaf: 30), hingga Allah Rabbul 'alamin meletakkan telapak kaki-Nya sehingga satu sama lain saling berdesak-desakan, hingga neraka berkata, 'Cukup-cukup' demi kemuliaan dan kehormatan-Mu. Sedangkan surga masih saja terlalu longgar sehingga Allah menciptakan makhluk baru dan meletakkan mereka ke dalam surga yang masih senggang",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7385,
			"arabicnumber": 7385,
			"text": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Ibn Juraij] dari [Sulaiman] dari [Thawus] dari [Ibn Abbas] radliyallahu'anhuma, ia berkata, \"Nabi shallallahu 'alaihi wasallam berdoa diwaktu malam: 'ALLAAHUMMA LAKAL HAMDU ANTA RABBUS SAMAAWAATI WAL ARDLI LAKAL HAMD, ANTA QAYYIMUS SAMAAWAATI WAL ARDL WAMAN FIIHINNA, LAKAL HAMDU ANTA NUURUS SAMAAWAATI WAL ARDLI, QOULUKAL HAQQ, WAWA'DUKAL HAQQ, WALIQAA'UKA HAQQ, WAL JANNATU HAQQ WAN NAARU HAQQ, WASSAA'ATU HAQQ, ALLAAHUMMA LAKA ASLAMTU WABIKA AAMANTU WA'ALAIKA TAWAKKALTU, WAILAIKA ANABTU WABIKA KHAASHAMTU, WAILAIKA HAAKAMTU, FAGHFIR LII MAA QADDAMTU WAMAAA AKHKHARTU WA ASRARTU WAMAA A'LANTU ANTA ILAAHII LAA-ILAAHA LII GHAIRUKA '(Ya Allah, bagi-Mu segala puji, Engkau Tuhan langit dan bumi, bagi-Mu segala puji, Engkau pengurus langit dan bumi dan semua penghuninya, bagi-Mu segala puji, Engkau adalah cahaya langit dan bumi, firman-Mu benar, janji-Mu benar, perjumpaan terhadap-Mu adalah benar, surga adalah benar, neraka adalah benar, hari kiamat benar, ya Allah, kepada-Mu aku berserah diri, kepada-Mu aku beriman, kepada-Mu aku bertawakkal, kepada-Mu aku bersandar, karena-Mu aku memusuhi (musuh), kepada-Mu aku berhakim, maka ampunilah bagiku apa yang pernah aku lakukan dan apa yang belum aku lakukan, apa yang aku lakukan secara sembunyi-sembunyi dan apa yang aku lakukan secara terang-terangan, Engkau adalah Tuhanku, tiada sesembahan yang hak bagiku selain Engkau) '.\" Dan telah menceritakan kepada kami [Tsabit bin Muhammad] telah menceritakan kepada kami [Sufyan] dengan hadis ini, dan ia menyebutkan dengan redaksi, 'Engkau adalah benar dan firman-Mu benar",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7386,
			"arabicnumber": 7386,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Usman] dari [Abu Musa] berkata, \"Pernah kami bersama Nabi shallallahu 'alaihi wasallam dalam sebuah safar, jika kami menaiki tempat yang tinggi maka kami bertakbir, dan beliau bersabda: 'Sederhanakanlah kalian dalam berdoa, sebab kalian tidak menyeru Dzat yang tuli dan tidak pula yang ghaib, sesungguhnya kalian menyeru Tuhan yang Maha mendengar lagi Maha melihat dan Maha dekat.\" Kemudian beliau mendatangiku sedang aku berkata dalam hati: 'Laa haula walaa quwwata illaa billaah (Tiada daya dan kekuatan kecuali dengan pertolongan Allah) ', maka beliau berkata: \"Wahai Abdullah bin Qais, ucapkanlah laa haula walaa quwwata illaa billaah, sebab bacaan itu adalah perbendaharaan surga, atau beliau berkata dengan redaksi, 'Maukah aku tunjukkan ucapan itu?",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7388,
			"arabicnumber": 7388,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7389,
			"arabicnumber": 7389,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Ibn Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibn Syihab] telah menceritakan kepadaku ['Urwah] bahwa [Aisyah] radliyallahu'anhuma menceritakan kepadanya, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jibril memanggilku dan berkata: 'Sesungguhnya Allah mendengar ucapan kaummu namun mereka tidak bisa mencelakaimu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7390,
			"arabicnumber": 7390,
			"text": "Telah menceritakan kepadaku [Ibrahim bin Al Mundzir] telah menceritakan kepada kami [Ma'an bin Isa] telah menceritakan kepadaku [Abdurrahman bin Abul Mawali] berkata, aku mendengar [Muhammad bin Al Munkadir] menceritakan Abdullah bin Al Hasan, dia berkata, telah mengabarkan kepadaku [Jabir bin Abdullah assalmi] berkata, \"Rasulullah Shallallahu'alaihiwasallam mengajari sahabat-sahabatnya untuk istikharah (meminta pilihan) dalam semua doanya sebagaimana beliau mengajarkan surat alquran kepada mereka, beliau sabdakan: \"Jika salah seorang dari kalian punya satu keinginan maka hendaklah ia kerjakan shalat dua rakaat (bukan shalat wajib) kemudian mengucapkan: 'ALLAAHUMMA INNII ASTAKHIIRUKA BI'ILMIKA, WA ASTAQDIRUKA BIQUDRATIKA WA AS'ALUKA MIN FADLLIKA, FAINNAKA TAQDIRU WALAA AQDIRU WATA'LAMU WALAA A'LAMU WA ANTA 'ALLAAMUL GHUYUUB, ALLAAHUMMA FAIN KUNTA TA'LAMU HAADZAL AMRA KHAIRAN LII FII 'AAJILI AMRII WA AAJILIHI -Qaala-- AW FII DIINII WAMA'AASYII WA'AAQIBATU AMRII FAQDURHU LII WAYASSIRHU LII TSUMMA BAARIK LII FIIHI, ALLAAHUMMA WAIN KUNTA TA'LAMU ANNAHU YARRUN LII FII DIINIII WAMA'AASYII WA'AAQIBATI -Aw qaala-FII 'AAJILI AMRII WA AAJILIHI FASHRIFNII 'ANHU WQDIRLIL KHIARA HAITSU KAANA TSUMMA ARDLINII BIHI (Ya Allah, Saya meminta pilihan kepada-Mu dengan ilmu-Mu, dan saya meminta keputusan dengan keputusan-Mu, dan saya meminta-Mu dengan kurnia-Mu, sesungguhnya Engkau memutuskan dan saya tidak bisa memutuskan, dan Engkau Maha tahu sedang aku tidak mengetahui, dan Engkau Maha mengetahui yang ghaib, Ya Allah, jikalah Engkau tahu bahwa urusan ini (Si Pemohon menyebut nama urusannya) adalah baik bagiku baik untuk masa yang dekat maupun masa yang akan datang -atau sepertinya ia berkata-dalam urusan agamaku dan duniaku, serta kesudahan urusanku, maka tetapkanlah untukku dan mudahkanlah bagiku, kemudian berilah aku barakah padanya. Ya Allah, sebaliknya jika Engkau tahu bahwa urusan ini adalah buruk bagiku dalam urusan agamaku dan kehidupanku, serta kesudahan urusanku- atau sepertinya ia berkata-dalam kesudahan yang dekat maupun yang akan datang, maka palingkanlah aku daripadanya dan tetapkanlah kebaikan bagiku darimana saja berada kemudian jadikanlah aku ridla terhadapnya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7391,
			"arabicnumber": 7391,
			"text": "Telah menceritakan kepadaku [Said bin Sulaiman] dari [Ibnul Mubarak] dari [Musa bin Uqbah] dari [Salim] dari [Abdullah] berkata, \"Sumpah yang paling sering dipergunakan oleh Nabi ShallAllahu 'alaihi wa Salam adalah \"Tidak! Ya Muqallibal quluub (Wahai Dzat yang membolak-balikkan hati)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7392,
			"arabicnumber": 7392,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] telah menceritakan kepada kami [Abuz Zinad] dari [Al A'raj] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah mempunyai sembilan puluh sembilan nama, seratus kurang satu, siapa yang meng-ihsha'nya, maka ia masuk surga.\" Dan makna meng-ihsha' adalah menjaga sebagaimana firman Allah: 'Ahshainaa (Kami menjaganya) ' (Qs. Yasin: 12)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7393,
			"arabicnumber": 7393,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepadaku [Malik] dari [Abu Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang diantara kalian mendatangi kasurnya (tidur), hendaklah ia mengibaskannya dengan ujung kainnya sebanyak tiga kali, dan hendaklah memanjatkan doa BISMIKA RABBII WADLA'TU JANBII WABIKA ARFA'UHU, IN AMSAKTA NAFSII FAGHFIR LAHAA, WAIN ARSALTAHAA FAHFAHZH-HAA BIMAA TAHFAZHU BIHI 'IBAADAKASHSHAALIHIINA (Dengan menyebut nama-Mu Wahai Tuhanku, aku baringkan pinggangku dan atas nama-Mu aku mengangkatnya, dan jika Engkau menahan diriku, maka berilah ampunan terhadapnya, dan jika Engkau melepaskannya, maka jagalah sebagaimana Engkau menjaga hamba-Mu yang shalih) '.\" Hadis ini diperkuat oleh [Yahya] dan [Bisyr bin Mufadldlal] dari ['Ubaidullah] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, sedang [Zuhair] dan [Abu Dlamrah] dan [Ismail bin Zakariya] menambahkan dari [Ubaidullah] dari [Sa'id] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, dan juga diriwayatkan oleh [Ibnu 'Ajlan] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7394,
			"arabicnumber": 7394,
			"text": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik] dari [Rib'i] dari [Hudzaifah] berkata, \"Nabi shallallahu 'alaihi wasallam jika mendatangi kasurnya, beliau memanjatkan doa: ALLAAHUMMA BISMIKA AHYAA WA AMUUTU (Ya Allah, dengan nama-Mu aku hidup dan dengan nama-Mu aku meningga) ', sebaliknya jika beliau bangun di pagi hari, beliau membaca: ALHAMDU LILLAHIL LADZII AHYAANAA BA'DA MAA AMAATANAA WAILAIHIN NUSYUUR (Segala puji bagi Allah Yang telah menghidupkan kami setelah mematikan kami dan kepada-Nya kita kembali)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7395,
			"arabicnumber": 7395,
			"text": "Telah menceritakan kepada kami [Sa'd bin Hafsh] telah menceritakan kepada kami [Syaiban] dari [Manshur] dari [Rib'I bin Khirasy] dari [Kharasyah bin Alhurr] dari [Abu Dzar] berkata, \"Nabi shallallahu 'alaihi wasallam jika mendatangi tempat tidurnya (tidur) di malam hari, maka beliau memanjatkan doa: 'BISMIKA NAMUUTU WA NAHYAA (Dengan nama-Mu kami mati dan hidup), dan apabila bangun beliau membaca doa: ALHAMDULILLAAHILLDAZII AHYAANAA BA'DA MAA AMAATANAA WAILAIHINNUSYUUR (Segala puji bagi Allah yang telah menghidupkan kami setelah Dia mematikan kami dan kepada-Nya kita dibangkitkan)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7396,
			"arabicnumber": 7396,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Salim] dari [Kuraib] dari [Ibn Abbas] radliyallahu'anhuma berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya salah seorang diantara kalian ingin mendatangi isterinya, maka panjatkanlah doa: 'BISMIKALLAAHUMMA JANNIBNASY WAJANNIBISYSYAITHAANA MAA RAZAQTANAA (Dengan nama Allah, jauhkanlah kami dari setan dan jauhkanlah setan yang Engkau anugerahkan kepada kami) ', jika ditakdirkan memperoleh anak dari keduanya, maka setan tak bakalan membahayakannya selama-lamanya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7397,
			"arabicnumber": 7397,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Fudlail] dari [Manshur] dari [Ibrahim] dari [Hammam] dari [Adi bin Hatim] berkata, \"Aku pernah bertanya Nabi shallallahu 'alaihi wasallam, aku katakan, 'Saya biasa melepas anjingku yang terlatih! Nabi menjawab: \"Jika kau lepas anjingmu yang terlatih dengan kau sebut nama Allah, lantas anjingmu menerkam mangsanya, maka makanlah dari yang diterkamnya, dan jika kamu melempar dengan batang panah namun batang panah itu melukai (melukai kulit, atau mengalirkan darah,) maka makanlah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7398,
			"arabicnumber": 7398,
			"text": "Telah menceritakan kepada kami [Yusuf bin Musa] telah menceritakan kepada kami [Abu Khalid Al Ahmar] berkata, aku mendengar [Hisyam bin Urwah] menceritakan dari [Ayahnya] dari ['Aisyah] berkata, \"Wahai Rasulullah, di sini ada beberapa kaum yang baru saja meninggalkan kesyirikan (KeIslamannya baru-baru saja), mereka biasa membawakan daging untuk kami yang kami tidak tahu dengan menyebut nama Allah ataukah tidak (lantas bagaimana)? ' Nabi menjawab: \"Sebutlah oleh kalian nama Allah, dan makanlah.\" Hadis ini diperkuat oleh [Muhammad bin Abdurrahman] dan [Darawardi] dan [Usamah bin Hafsh]",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7399,
			"arabicnumber": 7399,
			"text": "Telah menceritakan kepada kami [Hafs bin Umar] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] berkata, \"Nabi shallallahu 'alaihi wasallam pernah berkurban dengan dua kambing, beliau sebut nama Allah dan beliau bertakbir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7400,
			"arabicnumber": 7400,
			"text": "Telah menceritakan kepada kami [Hafs bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Al Aswad bin Qais] dari [Jundab] ia pernah menyaksikan Nabi shallallahu 'alaihi wasallam di hari raya kurban (idul adla) mendirikan shalat, kemudian berkhutbah dan bersabda: \"Barangsiapa menyembelih sebelum shalat, hendaklah ia menyembelih kembali dengan sembelihan lain sebagai gantinya, dan barangsiapa belum menyembelih, hendaklah menyembelih dengan menyebut nama Allah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7401,
			"arabicnumber": 7401,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Warqa'] dari ['Abdullah bin Dinar] dari [Ibn Umar] radliyallahu'anhuma mengatakan, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan kalian bersumpah dengan nama bapak-bapak kalian, dan barangsiapa bersumpah, hendaklah bersumpah dengan nama Allah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7402,
			"arabicnumber": 7402,
			"text": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Azzuhri] telah mengabarkan kepadaku ['Amru bin Abu Sufyan bin Usaid bin Jariyah Atstsaqafi] sekutu bani Zuhrah yang merupakan salah seorang sahabat Abu Hurairah, bahwa [Abu Hurairah] berkata, \"Pernah Rasulullah Shallallahu'alaihiwasallam mengutus sepuluh orang sahabatnya yang di antaranya ialah Khubaib Al anshari, lantas [Ubaidullah bin Iyadl] memberitakan kepadaku bahwa [anak perempuan Al Harits] mengabarkan kepadanya, tatkala mereka (Banu Harits bin Amir bin Naufal) berkumpul, Khubaib bin 'Adi meminjam sebuah pisau kepada anak perempuan itu untuk membersihkan rambut-rambut tubuhnya. Tatkala mereka keluarkan Khubaib dari tanah haram untuk mereka bunuh, Khubaib Al anshari berkata, \"Aku tak peduli ketika aku terbunuh sebagai seorang muslim # Di bagian tubuh manapun aku terbunuh karena Allah # Asalkan itu semua demi Dzat Allah # Kalaulah Allah berkenan Ia memberi barakah di semua sambungan daging yang tercabik-cabik.\" Khubaib kemudian dibunuh oleh anak laki-laki Al Harits, dan nabi shallallahu 'alaihi wasallam kabarkan berita kematian Khubaib dan teman-temannya kepada sahabat-sahabatnya ketika mereka memperoleh musibah yang menimpanya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7403,
			"arabicnumber": 7403,
			"text": "Telah menceritakan kepada kami ['Umar bin Hafs bin Ghiyats] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tak ada seorangpun yang lebih cemburu daripada Allah, yang karena sifat cemburu-Nya Allah mengharamkan segala bentuk kejahatan, dan tak seorang pun yang lebih senang dipuji daripada Allah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7404,
			"arabicnumber": 7404,
			"text": "Telah menceritakan kepada kami ['Abdan] dari [Abu hamzah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Dikala Allah mencipta manusia, Dia menulis dalam kitab-Nya yang Dia sendirilah yang menulis terhadap diri-Nya, dan itu diletakkan-Nya di sisiNya di atas 'arsy, 'Sesungguhnya rahmat-Ku lebih mendominasi kemurkaan-Ku",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7405,
			"arabicnumber": 7405,
			"text": "Telah menceritakan kepada kami ['Amru bin Hafs] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] aku mendengar [Abu Shalih] dari [Abu Hurairah] radliyallahu'anhu berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Aku berada dalam prasangka hamba-Ku, dan Aku selalu bersamanya jika ia mengingat-Ku, jika ia mengingat-Ku dalam dirinya, maka Aku mengingatnya dalam diri-Ku, dan jika ia mengingat-Ku dalam perkumpulan, maka Aku mengingatnya dalam perkumpulan yang lebih baik daripada mereka, jika ia mendekatkan diri kepada-Ku sejengkal, maka Aku mendekatkan diri kepadanya sehasta, dan jika ia mendekatkan diri kepada-Ku sehasta, Aku mendekatkan diri kepadanya sedepa, jika ia mendatangi-Ku dalam keadaan berjalan, maka Aku mendatanginya dalam keadaan berlari",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7406,
			"arabicnumber": 7406,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amru] dari [Jabir bin Abdullah] berkata, \"Tatkala ayat berikut diturunkan: '(Katakanlah Hai Muhammad, Dia-lah yang Maha berkuasa mengirimkan siksaan untuk kalian dari atas kalian) ' (QS. Al An'am 65), Nabi shallallahu 'alaihi wasallam memanjatkan doa: 'Saya berlindung dengan wajah-Mu, ' lantas Allah berfirman: '(Atau dari bawah kakimu) ' (QS. Al An'am 65), maka nabi memanjatkan doa: 'Saya berlindung dengan wajah-Mu', dan Allah berfirman: '(Atau menjadikan kalian berkelompok-kelompok) ' (QS. Al An'am 65), maka Nabi berkomentar 'Ini lebih sepele",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7407,
			"arabicnumber": 7407,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami [Juwairiyah] dari [Nafi'] dari ['Abdullah] berkata, \"Dajjal disebut-sebut di sisi Nabi shallallahu 'alaihi wasallam, lantas beliau berkomentar\" 'Allah tidak samar bagi kalian, Allah tidak buta sebelah -sambil beliau mendemontrasikan dengan tangannya ke matanya- 'dan bahwasanya al masih addajjal buta sebelah kanan, seolah-olah matanya anggur yang menjorok",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7408,
			"arabicnumber": 7408,
			"text": "Telah menceritakan kepada kami [Hafs bin Umar] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepada kami [Qatadah] berkata, aku mendengar [Anas] radliyallahu'anhu dari Nabi shallallahu 'alaihi wasallam: \"Tidaklah Allah mengutus seorang nabi pun melainkan telah mengingatkan kaumnya terhadap si buta sebelah dan si pendusta, ingatlah bahwa dajjal adalah buta sebelah, sedang Rabb kalian tidak buta sebelah, tertulis diantara kedua matanya KAFIR",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7409,
			"arabicnumber": 7409,
			"text": "Telah menceritakan kepada kami [Ishaq] telah menceritakan kepada kami [Affan] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Musa] -yaitu Ibn Uqbah- telah menceritakan kepadaku [Muhammad bin Yahya bin Hibban] dari [Ibn Muhairiz] dari [Abu Sa'id Al Khudzri] saat perang bani Musthaliq, bahwa para sahabat mendapatkan para tawanan wanita, dan mereka ingin menikmatinya (jimak) namun tidak menginginkan para tawanan wanita itu hamil. Maka mereka bertanya kepada nabi tentang 'azl (mengeluarkan sperma di luar kenaluan wanita), maka Nabi bertanya: 'Bukan sebaiknyakah kalian tidak melakukannya, sebab Allah telah menetapkan siapa saja yang hidup hingga hari kiamat tiba? ' Sedang [Mujahid] berkata dari [Qaza'ah] aku mendengar [Abu Sa'id] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: 'Tidaklah manusia yang dicipta melainkan Allah lah yang menciptanya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7410,
			"arabicnumber": 7410,
			"text": "Telah menceritakan kepadaku [Mu'adz bin Fadlalah] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] bahwa nabi shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat Allah mengumpulkan orang-orang mukmin, lalu mereka berkata, 'Tidak sebaiknyakah kita meminta syafaat kepada Rabb kita sehingga Dia bisa menjadikan kita merasa aman dari tempat kita sekarang ini? ' akhirnya mereka datangi Adam dan mereka sampaikan, 'Wahai Adam, bukankah engkau tahu bahwa Allah menciptamu dengan tangan-Nya dan Ia jadikan para malaikat tunduk sujud kepadamu, dan mengajarimu nama-nama segala sesuatu, maka mintailah syafaat Tuhan kami untuk kami sehingga Dia bisa memberi kenyamanan kami dari tempat kami sekarang ini! ' Adam hanya menjawab, 'Aku tidak berhak di sini.' Dan Adam menceritakan kesalahan yang pernah dilakukannya kepada mereka seraya berkata, 'Coba kalian datangi Nuh sebab ia adalah rasul pertama-tama yang Allah utus ke penduduk bumi.' Mereka pun mendatangi Nuh, namun Nuh menjawab, 'Saya tak berhak menolong kalian di sini', sambil Nuh menceritakan kesalahan yang pernah dilakukannya, 'namun coba datangilah Ibrahim yang ia adalah khalilurrahman (kekasih Allah Arrahman).' Lantas mereka pun mendatangi Ibrahim. Hanya Ibrahim menjawab, 'Maaf, di sini saya tak berhak menolong kalian.' Lantas Ibrahim menyebutkan kesalahan yang pernah dilakukannya seraya ia katakan, 'Coba datangilah Musa, seorang hamba yang Allah telah memberinya Taurat dan Dia mengajaknya bicara.' Mereka pun mendatangi Musa, hanya Musa berkata, 'Maaf, di sini saya tak berhak menolong kalian, ' lalu ia menceritakan kesalahan yang pernah dilakukannya, 'namun datangilah Isa, hamba Allah dan rasul-Nya, kalimah-Nya dan ruh-Nya.' Lantas mereka mendatangi Isa.' Hanya Isa menjawab, 'Maaf, di sini saya tak berhak menolong kalian, namun cobalah kalian datangi Muhammad Shallallahu'alaihiwasallam, seorang hamba yang telah diampuni dosanya baik yang terdahulu maupun yang akan datang.' Lantas orang-orang pun mendatangiku. Aku berusaha mendatangi dan meminta ijin Tuhanku sehingga aku diijinkan. Dan jika kulihat Tuhanku, aku tersungkur sujud. Lantas Allah membiarkanku sekehendak Allah membiarkanku. Tiba-tiba ada suara memanggil-manggil, 'Angkatlah kepalamu hai Muhammad, katakanlah, perkataanmu didengar, mintalah, engkau diberi, ajukanlah syafaat engkau akan diberi! Aku pun memuji Tuhanku dengan pujian yang diajarkan Tuhanku kepadaku tentangnya, kemudian aku memberi syafaat. Aku pun memberi syafaat, lantas Dia memberiku batasan yang aku kemudian memasukkan mereka ke dalam surga. Aku kemudian kembali, dan jika kulihat Tuhanku, aku tersungkur sujud dan Allah membiarkanku sekehendak-Nya. Lantas ada suara, 'Angkatlah kepalamu hai Muhammad, katakanlah, engkau didengar, mintalah, engkau pasti diberi, mintalah syafaat, engkau musti diberi syafaat.' Maka aku memuji Tuhanku dengan pujian yang telah diajarkan Tuhanku kepadaku tentangnya. Lantas aku memberi syafaat. Dan Dia memberiku batasan yang aku kemudian memasukkan mereka ke dalam surga. Aku kembali dan kuutarakan kepada Tuhanku, 'Ya Tuhanku, tidak tersisa dalam neraka selain yang ditahan oleh Alquran dan wajib kekal di dalamnya'.\" Nabi shallallahu 'alaihi wasallam kemudian bersabda: \"Akan dikeluarkan dari neraka siapa saja yang mengucapkan laa-ilaaha-illallah dan dalam hatinya mempunyai kebaikan seberat sebiji gandum, kemudian akan keluar dari neraka siapa saja yang mengucapkan laa-ilaaha-illallah dan dalam hatinya terdapat kebaikan seberat biji tepung, dan akan keluar dari neraka siapa saja yang mengucapkan laa-ilaaha illallah sedang dalam hatinya terdapat kebaikan seberat biji atom",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7411,
			"arabicnumber": 7411,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] telah menceritakan kepada kami [Abuz Zinad] dari [Al A'raj] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tangan Allah selalu penuh, tidak kurang karena memberi nafkah, dan selalu dermawan baik siang maupun malam.\" Beliau bersabda lagi: \"Bukankah kalian telah melihat apa yang dibelanjakan-Nya semenjak Dia mencipta langit dan bumi, dan tidak berkurang sedikit pun apa yang di tangan-Nya?\" Beliau bersabda lagi: \"Arsy-Nya di atas air, dan tangan-Nya yang lain memegang timbangan, yang terkadang Ia rendahkan atau Ia tinggikan",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7413,
			"arabicnumber": 7413,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7414,
			"arabicnumber": 7414,
			"text": "Telah menceritakan kepada kami [Musaddad] ia mendengar [Yahya bin Sa'id] dari [Sufyan] telah menceritakan kepadaku [Manshur] dan [Sulaiman] dari [Ibrahim] dari ['Abidah] dari [Abdullah], bahwa seorang Yahudi menemui nabi shallallahu 'alaihi wasallam dan berkata 'Hai Muhammad, Allah memegang langit di atas satu jari, dan seluruh bumi dengan satu jari, dan seluruh gunung dengan satu jari, dan semua pohon hanya dengan satu jari, dan seluruh makhluk yang ada hanya dengan satu jari, lantas berkata 'Akulah Sang raja.' Maka Rasulullah Shallallahu'alaihiwasallam pun tertawa hingga kelihatan gigi serinya, kemudian beliau membaca ayat: '(Dan mereka tidak menghormati Allah dengan penghormatan yang semestinya) ' (QS.Azzumar 67). [Yahya bin Sa'id] berkata, \"Dan [Fudlail bin Ziyad] di dalam hadis tersebut menambahkan, dari [Manshur] dari [Ibrahim] dari [Abidah] dari [Abdullah] lantas Rasulullah Shallallahu'alaihiwasallam terkagum-kagum seraya membenarkannya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7415,
			"arabicnumber": 7415,
			"text": "Telah menceritakan kepada kami [Umar bin Hafs bin Ghiyats] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] aku mendengar [Ibrahim] berkata, Aku mendengar [Alqamah] berkata, [Abdullah] berkata, \"Seorang laki-laki ahli kitab menemui nabi shallallahu 'alaihi wasallam dan berkata, 'Wahai Abul qasim, Allah memegang langit hanya dengan satu jari, semua pohon hanya dengan satu jari, semua bintang hanya dengan satu jari, seluruh makhluk hanya dengan satu jari, lalu Allah berfirman: 'Akulah sang raja, akulah sang raja'. Dan kulihat Nabi shallallahu 'alaihi wasallam tertawa hingga kelihatan gigi serinya, lantas beliau membaca ayat: '(Dan mereka tidak menghormati Allah dengan penghormatan yang semestinya) ' (QS.Azzumar 67)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7416,
			"arabicnumber": 7416,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail At Tabudzaki] telah menceritakan kepada kami [Abu 'Awanah] telah menceritakan kepada kami [Abdul Malik] dari [Warrad] juru tulis Mughira, dari [Mughirah] berkata, \"Sa'd bin Ubadah berkata, \"Kalaulah kulihat seorang laki-laki bersama isteriku, niscaya aku penggal dia dengan pedang di bagian mata pedangnya, bukan dengan pinggirnya.\" Berita ini kemudian terdengar oleh Rasulullah Shallallahu'alaihiwasallam, sehingga beliau bersabda: \"Adakah kalian merasa heran dengan kecemburuan Sa'd? Demi Allah, sungguh aku lebih cemburu daripada dia, dan Allah lebih cemburu daripada aku, dan karena kecemburuan Allah itulah Allah mengharamkan segala kejahatan baik yang nampak maupun yang tersembunyi, dan tidak ada seorangpun yang lebih suka terhadap argumentasi daripada Allah, karena itulah Allah mengutus para rasul sebagai pembawa berita gembira dan pemberi peringatan, dan tak ada seorang pun yang lebih menyukai pujian daripada Allah, karena itulah Allah menjanjikan surga",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7417,
			"arabicnumber": 7417,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Abu Hazim] dari [Sahal bin Sa'd] berkata, \"Nabi shallallahu 'alaihi wasallam pernah bertanya kepada seseorang: 'Apakah engkau mempunyai hapalan alquran? ' Ia menjawab, 'Ada, yaitu surat sedemikian sedemikian, ' yang ia sebut namanya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7418,
			"arabicnumber": 7418,
			"text": "Telah menceritakan kepada kami [Abdan] berkata, Telah mengabarkan kepada kami [Abu Hamzah] dari [Al A'masy] dari [Jami' bin Syidad] dari [Shafwan bin Muhriz] dari ['Imran bin Hushain] berkata, \"Pernah aku di sisi Nabi shallallahu 'alaihi wasallam. Tiba-tiba ada sekelompok kaum dari bani Tamim mendatanginya dan berkata, 'Terimalah berita gembira wahai bani Tamim! Mereka menjawab, 'Engkau telah memberi kami kabar gembira, maka berikanlah! Lantas beberapa orang penduduk Yaman datang dan beliau katakan: 'Terimalah kabar gembira wahai penduduk Yaman, sebab bani Tamim belum menemerimanya! ' Mereka jawab, 'kami menerimanya, kami datang untuk belajar agama dan bertanya kepadamu awal-awal kejadian alam ini! Nabi menjawab: 'Allah telah ada dan tidak ada sesuatu pun terjadi sebelum-Nya, arsy-Nya berada di atas air, kemudian Allah mencipta langit dan bumi dan Allah menetapkan segala sesuatu dalam alquran'. Lantas seorang laki-laki mendatangiku dan berujar 'Wahai Imran, carilah untamu, sebab untamu pergi! Aku bergegas mencarinya, tidak tahunya fatamorgana (padang pasir) menghilangkan pandangannya. Demi Allah, sungguh aku mengimpikan sekiranya untaku biarlah hilang sedang aku tidak usah berdiri",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7419,
			"arabicnumber": 7419,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Hammam] telah menceritakan kepada kami [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tangan kanan Allah selalu penuh dan sama sekali tidak pernah kurang karena berderma (infak), Dia sangat dermawan baik malam maupun siang, tidakkah kalian tahu apa yang telah diinfakan-Nya semenjak Ia mencipta langit dan bumi dan itu semua tidak mengurangi apa yang berada di tangan kanan-Nya? Dan arsy-Nya berada diatas air, dan ditangan-Nya yang lain urusan menjulurkan atau menahan, karenanya Dia meninggikan atau merendahkan",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7420,
			"arabicnumber": 7420,
			"text": "Telah menceritakan kepada kami [Ahmad] telah menceritakan kepada kami [Muhammad bin Abu Bakar Al Muqaddami] telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas] berkata, \"Zaid bin Haritsah datang melaporkan keluh kesahnya, lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Bertakwalah engkau kepada Allah, dan tahanlah isterimu.\" Anas berkata, \"Kalaulah Rasulullah sudah merahasiakan sesuatu, beliau sungguh merahasiakannya.\" Ketika itu Zainab binti Jahsyin membanggakan diri kepada isteri-isteri beliau lainnya seraya berkata, 'Kalian dikawinkan oleh keluarga kalian, sebaliknya aku dikawinkan sendiri oleh Allah ta'ala dari atas langit berlapis tujuh.' Dan masih dari Tsabit mengenai ayat: '(Dan kamu merahasiakan urusanmu yang Allah membeberkannya, dan kamu takut kepada manusia) ' (Qs. Al Ahzab: 37), ayat ini diturunkan tentang percekcokan rumah tangga Zainab dan Zaid bin Haritsah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7421,
			"arabicnumber": 7421,
			"text": "Telah menceritakan kepada kami [Khallad bin Yahya] telah menceritakan kepada kami [Isa bin Tahman] berkata, aku mendengar [Anas bin Malik] radliyallahu'anhu mengatakan, \"Ayat hijab diturunkan tentang Zainab binti Jahsyin, yang ketika itu beliau Shallallahu'alaihiwasallam memberinya makan berupa roti dan daging, dan Zainab membanggakan diri kepada isteri-isteri Nabi shallallahu 'alaihi wasallam lainnya dengan berkata, 'Allah lah yang menikahkanku di langit",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7422,
			"arabicnumber": 7422,
			"text": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] telah menceritakan kepada kami [Abuz zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Ketika Allah menetapkan penciptaan, Dia tulis di sisi-Nya di atas arsy-Nya 'Rahmat-Ku lebih mendominasi kemurkaan-Ku",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7423,
			"arabicnumber": 7423,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] telah menceritakan kepadaku [Muhammad bin Fulaih] berkata, telah menceritakan kepadaku [Ayahku] telah menceritakan kepadaku [Hilal] dari ['Atha bin Yasar] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa beriman kepada Allah dan rasul-Nya, mendirikan shalat, dan berpuasa pada bulan Ramadlan, maka Allah berkewajiban memasukkannya kedalam surga, baik ia berhijrah fi sabilillah atau duduk di tempat tinggalnya tempat ia dilahirkannya.\" Para sahabat berkata, \"Wahai Rasulullah, tidak sebaiknyakah kami mengabarkan orang-orang tentang hal ini?\" Nabi malahan menjawab: \"Dalam surga terdapat seratus derajat yang Allah persiapkan bagi para mujahidin di jalan-Nya, yang jarak antara setiap dua tingkatan bagaikan antara langit dan bumi, maka jika kalian meminta Allah, mintalah surga firdaus, sebab firdaus adalah surga yang paling tengah dan paling tinggi, di atasnya ada singgasana Arrahman, dan daripadanya sungai surga memancar",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7424,
			"arabicnumber": 7424,
			"text": "Telah menceritakan kepada kami [Yahya bin Ja'far] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] -yaitu At Taimi- dari [Ayahnya] dari [Abu Dzar] berkata, \"Aku masuk masjid sedang Rasulullah Shallallahu'alaihiwasallam duduk. Ketika matahari terbenam, beliau bertanya: 'Wahai Abu Dzar, tahukah engkau ke manakah matahari ini pergi?\" Aku menjawab, 'Allah dan rasul-Nya lah yang lebih tahu! ' Nabi menjawab: \"Sesungguhnya matahari ini pergi meminta ijin untuk sujud sehingga diijinkan, seolah-olah dikatakan kepada 'Kembalilah engkau dari tempat engkau datang', maka ia muncul di sebelah baratnya, \" kemudian beliau membaca: '(Itulah tempat tinggalnya) ', menurut bacaan Abdullah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7425,
			"arabicnumber": 7425,
			"text": "Telah menceritakan kepada kami [Musa] dari [Ibrahim] telah menceritakan kepada kami [Ibn Syihab] dari ['Ubaid bin Sibaq] bahwa [Zaid bin Tsabit], sedang [Al Laits] berkata, telah menceritakan kepadaku [Abdurrahman bin Khalid] dari [Ibn Syihab] dari [Ibn Sibaq Zaid bin Tsabit] menceritakannya dengan berkata, \"Abu Bakar mengutus seseorang kepadaku dan Abu Khuzaimah Al Anshari, sehingga aku telusuri alquran dan hingga aku temukan akhir surat At Taubah, yang aku tidak menemukannya dengan seorang pun selain bersamanya, yaitu ayat: '(Telah datang kepada kalian seorang rasul dari kalian sendiri) ' (QS. Attaubah 128), hingga penghabisan surat al Bara'ah (surat At Taubah).\" Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Yunus] dengan hadis ini, dan beliau berkata; telah menceritakan kepada kami Yahya bin Bukair telah menceritakan kepada kami Al Laits dari Yunus dengan hadis ini, dan ia menyebutkan, 'Bersama Abu Khuzaimah Al anshari",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7426,
			"arabicnumber": 7426,
			"text": "Telah menceritakan kepada kami [Mu'alla bin Asad] telah menceritakan kepada kami [Wuhaib] dari [Sa'id] dari [Qatadah] dari [Abul 'Aliyah] dari [Ibn Abbas] radliyallahu'anhuma berkata, \"Jika susah, Nabi shallallahu 'alaihi wasallam memanjatkan doa: 'LAA-ILAAHA ILLALLAHUL 'ALIIMUL HALIIM, LAA-ILAAHA ILLALLAH RABBUL'ARSYIL 'AZHIIMI LAA-ILAAHA ILLALLAH RABBUS SAMAAWAATI WARABBUL ARDLI RABBUL'ASYIL KARIIMI (Tiada sesembahan yang hak selain Allah Yang Maha Mengetahui lagi Maha Bijaksana, tiada sesembahan yang hak selain Allah, Tuhan pemelihara arsy Yang Maha Agung, tiada sesembahan yang hak selain Allah Yang memelihara langit dan bumi, Tuhan pemelihara arsy yang mulia)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7428,
			"arabicnumber": 7428,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7429,
			"arabicnumber": 7429,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7430,
			"arabicnumber": 7430,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] radliyallahu'anhu, Rasulullah Shallallahu'alaihiwasallam bersabda: \"Di tengah-tengah kalian ada malaikat yang silih berganti bertugas mengiringi kalian diwaktu malam dan siang, mereka berkumpul ketika shalat 'ashr dan shalat subuh. Malaikat yang mengawasi amal kalian di malam hari naik ke langit lantas Allah bertanya mereka -dan Allah lebih tahu keadaan kalian- bagaimana kalian tinggalkan hamba-hamba-Ku? Para malaikat menjawab, 'Kami tinggalkan mereka sedang mereka tengah mendirikan shalat, dan kami datangi mereka sedang mereka mendirikan shalat'.\" Sedang Khalid bin Makhlad berkata, telah menceritakan kepada kami Sulaiman telah menceritakan kepadaku Abdullah bin Dinar dari Abu Shalih dari Abu Hurairah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersedekah dengan separuh biji kurma dari penghasilan yang baik, dan tidak ada yang naik kepada Allah kecuali amal yang baik, maka Allah menerimanya dengan tangan kanan-Nya, kemudian mengembangkannya untuk pelakunya sebagaimana salah seorang diantara kalian merawat kuda piaraannya hingga sebesar gunung.\" Dan hadis ini diriwayatkan oleh Warqa' dari 'Abdullah bin Dinar dari Sa'id bin Yasar dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam dengan redaksi, 'Dan tidak ada yang naik kepada Allah kecuali kebaikan",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7431,
			"arabicnumber": 7431,
			"text": "Telah menceritakan kepada kami [Abdul A'la bin Hammad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Abul 'Aliyah] dari [Ibn Abbas] bahwa nabi shallallahu 'alaihi wasallam membaca kalimat-kalimat berikut ketika susah: 'LAA ILAAHA ILLALLAHUL 'AZHIIM, LAA-ILAAHA ILLALLAH RABBUL'ARSYIL 'AZHIIMU, LAA-ILAAHA ILLALLAAH RABBUSSAMAAWAATI WARABBUL'ARSYIL KARIIM (Tiada sesembahan yang hak selain Allah Yang Maha agung, tiada sesembahan yang hak selain Allah pemilik arsy yang Agung, tiada sesembahan yang hak selain Allah pemilik langit dan pemilik arsy yang mulia)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7432,
			"arabicnumber": 7432,
			"text": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Ayahnya] dari [Ibn Abu Nu'm] -atau Abu Nu'm, Qabishah masih ragu antara keduanya- dari [Abu Sa'id Al Khudzri] berkata, \"Beberapa potongan emas didatangkan kepada nabi shallallahu 'alaihi wasallam, lantas beliau membaginya di antara empat orang.\" Dan telah menceritakan kepadaku [Ishaq bin Nashr] telah menceritakan kepada kami ['Abdurrazaq] telah mengabarkan kepada kami [Sufyan] dari [Ayahnya] dari [Ibn Abu Nu'm] dari [Abu Sa'id Al Khudzri] berkata, \"Ali, yang ketika itu di Yaman mengirimkan beberapa potongan emas yang masih dengan tanahnya kepada nabi shallallahu 'alaihi wasallam, lantas beliau membagi-bagikannya antara Al aqra' bin Habis Al Hanzhali, lalu salah seorang Bani Majasyi', lalu 'Uyainah bin Badar Al Fazari, Alqamah bin 'Al Atsah Al 'Amiri, kemudian seorang Bani Kilab dan Zaid Al Khail Ath Thai, kemudian salah seorang Bani Nabhan. Maka beberapa orang qurasy dan Anshar pun marah, mereka berkata, 'Nabi berikan emas itu kepada pemuka-pemuka penduduk Nejed dan ia meninggalkan kita-kita'. Nabi terus berkata: 'Hanyasanya aku beri mereka untuk menjinakkan hati mereka.' Kemudian datanglah seseorang yang kedua matanya menjorok ke dalam, dahinya menjorok keluar, jenggotnya lebat, dua keningnya menjorok keluar dan berkepala gundul, orang itu kemudian berkata, 'Hai Muhammad, bertakwalah kepada Allah (maksudnya bertindaklah hati-hati dan adil)! ' Spontan Nabi shallallahu 'alaihi wasallam menjawab: \"Siapa lagi yang menaati Allah jika aku membangkang-Nya, sesungguhnya Allah telah memberiku kepercayaan untuk memimpin penduduk bumi sedang kalian tidak percaya kepadaku.\" Lantas ada seorang sahabat yang meminta beliau untuk membunuh orang itu, dan seingatku orang sahabat itu adalah Khalid bin Al Walid, namun nabi mencegahnya. Tatkala orang itu pergi nabi shallallahu 'alaihi wasallam bersabda: \"Diantara keturunan orang ini ada suatu kaum yang membaca al quran yang tidak melebihi tenggorokan mereka (membaca alquran tidak meresap dalam hati), mereka keluar dari Islam sebagaimana anak panah keluar dari busurnya, mereka membantai pemeluk Islam dan membiarkan pemuja patung-patung, kalaulah aku temui mereka, niscaya aku bunuh mereka sebagaimana pembunuhan terhadap kaum 'Ad",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7433,
			"arabicnumber": 7433,
			"text": "Telah menceritakan kepada kami ['Ayyasy bin Al Walid] telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Ibrahim At Taimi] dari [Ayahnya] dari [Abu Dzar] berkata, \"Aku bertanya nabi shallallahu 'alaihi wasallam mengenai kutipan ayat: '(dan matahari berjalan di persinggahannya) ' (Qs. Yasin: 38), beliau berkomentar: \"Persingghannya adalah di bawah 'Arsy",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7434,
			"arabicnumber": 7434,
			"text": "Telah menceritakan kepada kami ['Amru bin Aun] telah menceritakan kepada kami [Khalid] dan [Husyaim] dari [Ismail] dari [Qais] dari [Jarir] berkata, \"Pernah kami duduk-duduk di sisi Nabi shallallahu 'alaihi wasallam. Tiba-tiba beliau melihat bulan yang ketika itu malam purnama, lantas beliau bersabda: \"Sungguh kalian akan melihat Tuhan kalian sebagaimana kalian melihat bulan ini, kalian tidak bakalan kesulitan melihatnya, maka jika kalian mampu untuk tidak kewalahan melakukan shalat sebelum matahari terbit dan matahari terbenam, maka lakukanlah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7435,
			"arabicnumber": 7435,
			"text": "Telah menceritakan kepada kami [Yusuf bin Musa] telah menceritakan kepada kami ['Ashim bin Yusuf Al Yarbu'i] telah menceritakan kepada kami [Abu Syihab] dari [Ismail bin Abu Khalid] dari [Qais bin Abu Hazim] dari [Jarir bin Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Kalian akan melihat Rabb kalian dengan mata telanjang",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7436,
			"arabicnumber": 7436,
			"text": "Telah menceritakan kepada kami ['Abdah bin Abdullah] telah menceritakan kepada kami [Husain Al Ju'fi] dari [Zaidah] telah menceritakan kepada kami [Bayan bin Bisyr] dari [Qais bin Abu Hazim] telah menceritakan kepada kami [Jarir], bahwa Rasulullah Shallallahu'alaihiwasallam menemui kami di malam purnama, lantas beliau bersabda: \"Kalian akan melihat Tuhan kalian pada hari kiamat sebagaimana kalian melihat bulan ini dengan tidak kesulitan melihatnya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7438,
			"arabicnumber": 7438,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7439,
			"arabicnumber": 7439,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7440,
			"arabicnumber": 7440,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Allaits bin Sa'd] dari [Khalid bin Yazid] dari [Sa'id bin Abu Hilal] dari [Zaid] dari ['Atha' bin Yasar] dari [Abu Sa'id Al Khudzri] berkata, \"Kami bertanya, \"Ya Rasulullah, apakah kita akan melihat Tuhan kita pada hari kiamat?\" Nabi balik bertanya: \"Apakah kalian merasa kesulitan melihat matahari dan bulan ketika terang benderang?\" kami menjawab, \"Tidak.\" Nabi meneruskan: \"Begitulah kalian tidak kesulitan melihat melihat Tuhan kalian ketika itu, selain sebagaimana kesulitan kalian melihat keduanya.\" Kemudian beliau berkata: \"Lantas ada seorang penyeru memanggil-manggil, \"Hendaklah setiap kaum pergi menemui yang disembahnya!\" Maka pemuja salib pergi bersama salib mereka, dan pemuja patung menemui patung-patung mereka, dan setiap pemuja Tuhan bersama tuhan-tuhan mereka hingga tinggal orang-orang yang menyembah Allah, entah baik atau durhaka dan ahli kitab terdahulu. Kemudian jahannam didatangkan dan dipasang, ia seolah-olah fatamorgana, lantas orang-orang yahudi ditanya, \"Apa yang dahulu kalian sembah?\" Mereka menjawab, \"Kami dahulu menyembah Uzair anak Allah.\" Lalu ada suara, \"Kalian dusta! Allah sama sekali tidak mempunyai isteri dan tidak pula anak.\" Lalu apa yang kalian inginkan?\" Mereka menjawab, \"Kami ingin jika Engkau memberi kami minuman!\" Lantas ada suara, \"Minumlah kalian!\" Lalu mereka berjatuhan di neraka jahannam. Lantas orang-orang Nashara diseru, \"Apa yang kalian dahulu sembah?\" Mereka menjawab, \"Kami dahulu menyembah Isa al Masih, anak Anak Allah.\" Mereka dijawab, \"Kamu semua bohong! Allah sama sekali tidak mempunyai isteri atau bahkan anak, dan apa yang kalian inginkan?\" Mereka menjawab, \"Kami ingin agar Engkau memberi kami minuman!\" Lalu dijawab, \"Minumlah kalian!\" Dan langsung mereka berjatuhan di neraka jahannam hingga tersisa manusia yang menyembah Allah, entah yang baik atau berbuat durhaka. Mereka ditanya, \"Apa yang menyebabkan kalian tertahan padahal manusia lainnya sudah pergi?\" Mereka menjawab, \"Kami memisahkan diri dari mereka dan kami adalah manusia yang paling membutuhkan-Nya, kami dengar ada seorang juru seru menyerukan diri, \"Hendaklah setiap kaum menemui yang mereka sembah! Hanyasanya kami menunggu-nunggu Tuhan kami.\" Beliau melanjutkan, \"Lantas Allah (Al jabbar) mendatangi mereka dengan bentuk yang belum pernah mereka lihat pertama kali, lalu Allah firmankan: 'Akulah Tuhan kalian.' Mereka menjawab, 'Engkau adalah rabb kami, dan tidak ada yang berani mengajak-Nya bicara selain para nabi shallallahu 'alaihi wasallam, lantas para nabi berkata, 'Bukankah di antara kalian dan Allah ada tanda yang kalian mengenalnya? ' Mereka menjawab, 'Ya, yaitu betis, ' maka Allah pun menyingkap betis-Nya sehingga setiap mukmin bersujud kepada-Nya. Lalu tersisalah orang-orang yang sujud kepada Allah karena riya dan sum'ah sehingga ia pergi sujud dan punggungnya kembali menjadi satu bagian, kemudian titian (jembatan) jahannam didatangkan dan dipasang antara dua tepi jahannam, kami bertanya, 'Wahai Rasulullah, memang jembatan jahannam tersebut misterinya apa? ' Nabi menjawab: 'Jembatan itu bisa menggelincirkan, menjatuhkan, ada pengait-pengait besi, ada duri-duri yang lebar dan tajam, durinya besok yang terbuat dari kayu berduri namanya Sa'dan (kayu berduri tajam). Orang mukmin yang melewatinya sedemikian cepat, ada yang bagaikan kedipan mata, ada yang bagaikan kilat, ada yang bagaikan angin, dan ada yang bagaikan kuda pilihan. Ada yang bagaikan kuda tunggangan, ada yang selamat dengan betul-betul terselamatkan, namun ada juga yang selamat setelah tercabik-cabik oleh besi-besi pengait itu, atau terlempar karenanya di neraka jahannam, hingga manusia terakhir kali melewati dengan diseret seret, dan kalian tidak bisa sedemikian gigihnya menyumpahiku terhadap kebenaran yang jelas bagi kalian daripada terhadap seorang mukmin ketika itu kepada Allah Al Jabbar. Jika mereka melihat bahwasanya mereka telah selamat di kalangan teman-teman mereka, mereka berkata, 'Ya Tuhan kami, sesungguhnya kawan-kawan kami mendirikn shalat bersama kami dan berpuasa bersama kami, dan beramal bersama kami! ' Allah Ta'ala berfirman, 'Pergilah kalian, siapa diantara kalian dapatkan dalam hatinya masih ada seberat dinar keimanan, maka keluarkanlah dia', dan Allah mengharamkan bentuk mereka dalam neraka. Maka mereka datangi kawan-kawan mereka sedang sebagian mereka telah terendam dalam neraka ada yang sampai telapak kakinya, setengah betisnya, sehingga mereka keluarkan siapa saja yang mereka, kemudian mereka kembali dan Allah berkata, 'Pergilah kalian sekali lagi, dan siapa yang kalian temukan dalam hatinya seberat atom keimanan, maka keluarkanlah dia.' Maka mereka keluarkan siapa saja yang mereka kenal.\" Rasulullah berkata: 'Jika kalian tidak mempercayaiku, maka bacalah: '(Allah tidak menzhalimi seberat biji sawi pun, jika ada kebaikan, maka Allah melipatgandakan balasannya) ' (Qs. An nisaa': 40), maka para nabi shallallahu 'alaihi wasallam, malaikat dan orang-orang yang beriman, kesemuanya memberi syafaat. Kemudian Allah Al Jabbar berkata, syafaat-Ku masih ada. Lantas Allah menggenggam segenggam dari neraka dan mengentaskan beberapa kaum yang mereka telah terbakar, lantas mereka dilempar ke sebuah sungai di pintu surga yang namanya 'Sungai kehidupan' sehingga mereka tumbuh dalam kedua tepinya sebagaimana biji-bijian tumbuh dalam genangan sungai yang kalian sering melihatnya di samping batu karang dan samping pohon, apa yang diantaranya condong kepada matahari, maka berwarna hijau, dan apa yang diantaranya condong kepada bayangan, maka berwarna putih, lantas mereka muncul seolah-olah mutiara dan dalam tengkuk mereka terdapat cincin-cincin. Mereka kemudian masuk surga hingga penghuni surga berkata, 'Mereka adalah 'utaqa' Ar Rahman (orang-orang yang dibebaskan Arrahman), Allah memasukkan mereka bukan karena amal yang mereka lakukan, dan bukan pula karena kebaikan yang mereka persembahkan sehingga mereka memperoleh jawaban 'Bagimu yang kau lihat dan semisalnya'.\" [Hajjaj bin Minhal] berkata; telah menceritakan kepada kami [Hammam bin Yahya] telah menceritakan kepada kami [Qatadah] dari [Anas] radliyallahu'anhu, bahwa Nabi shallallahu 'alaihi wasallam bersabda: 'Pada hari kiamat nanti orang-orang mukmin ditahan hingga yang demikian menjadikan mereka sedih. Mereka katakan, 'Duh, sekiranya kita meminta syafaat kepada Tuhan kami sehingga Dia menjadikan kita merasa nyaman dari tempat kita ini.' Mereka pun mendatangi Adam dan berkata, 'Engkau hai Adam, Engkau adalah nenek moyang seluruh manusia, Allah menciptamu dengan tangan-Nya, menjadikan surga sebagai tempat hunianmu dan menjadikan malaikat bertunduk sujud kepadamu, Allah juga mengajarimu nama-nama segala sesuatu agar engkau bisa memberi syafaat kepada kami disisi Tuhanmu sehingga engkau bisa memberi kenyamanan di tempat kami ini. Namun Adam hanya menjawab, 'Disini saya tak berhak memberi syafaat untuk kalian'.\" Rasulullah melanjutkan: \"Lantas Adam mengingatkan kesalahan yang pernah dilakukannya, yaitu memakan pohon larangan padahal telah dilarang, dan ia katakan 'Coba kalian datangi Nuh, sebab ia adalah nabi shallallahu 'alaihi wasallam pertama-tama yang Allah utus kepada penduduk bumi.' Mereka pun mendatangi Nuh, namun Nuh juga menjawab, 'Maaf, disini saya tak berhak memberi syafaat untuk kalian', dan Nuh menyebutkan kesalahan yang pernah dilakukannya, yaitu bertanya kepada Rabbnya dengan tanpa ilmu sambil ia katakan, 'Cobalah kalian datangi Ibrahim, sebab ia adalah Khalilurrahman (kekasih Arrahman).\" Rasulullah melanjutkan lagi kisahnya: \"Mereka pun mendatangi Ibrahim, hanya Ibrahim juga menjawab, 'Maaf, disini saya tak berhak memberi syafaat untuk kalian', Ibrahim lantas menyebutkan kesalahannya, yaitu tiga kebohongan yang pernah dilakukannya sambil berkata, 'Cobalah kalian datangi Musa, seorang hamba yang Allah memberinya taurat, mengajaknya bicara dan mendekatkannya kepada-Nya sedekat-dekatnya'.\" Rasulullah lanjutkan: \"Mereka pun mendatangi Musa, hanya Musa juga menjawab, 'Maaf, disini saya tak berhak memberi syafaat untuk kalian', sambil Musa mengingatkan kesalahan yang pernah dilakukannya, yaitu membunuh jiwa tanpa alasan yang dibenarkan, sambil ia katakan, 'Coba kalian datangi Isa, seorang hamba Allah dan rasul-Nya, ruh Allah dan kalimah-Nya. Merekapun mendatangi Isa, namun 'Isa juga menjawab, 'Maaf, disini saya tak berhak memberi syafaat untuk kalian', sambil ia katakan 'Cobalah kalian datangi Muhammad Shallallahu'alaihiwasallam, seorang hamba yang Allah telah mengampuni dosanya yang terdahulu dan yang akan datang.' Lantas mereka mendatangi aku (Muhammad) dan aku meminta ijin Tuhanku di rumah-Nya dan aku diijinkan menemui-Nya, jika aku melihat-Nya, maka aku tersungkur sujud, Allah lalu membiarkan aku sekehendak Dia membiarkaku. Allah lantas berkata, 'Angkat kepalamu hai Muhammad, katakanlah, engkau didengar, mintailah syafaat, engkau diberi syafaat, mintalah, engkau diberi.' Aku lalu angkat kepalaku dan aku memuji Tuhanku dengan pujian yang Ia ajarkannya kepadaku, kemudian aku memberi syafaat dan Dia memberiku batasan. Kemudian aku keluar dan memasukkan mereka ke dalam surga.\" Qatadah berkata, \"Dan aku juga mendengarnya menyebutkan, \"Aku lalu keluar, kemudian aku keluarkan mereka dari neraka dan kumasukkan ke dalam surga. Setelah itu aku kembali untuk kali kedua dan aku meminta ijin Tuhanku di rumah-Nya dan aku diijinkan untuk menemui-Nya, jika aku melihat-Nya, maka aku tersungkur sujud. Allah lantas membiarkanku sekehendak Allah membiarkan, kemudian Allah berkata, 'Angkatlah kepalamu hai Muhammad dan katakanlah engkau akan didengar, dan berilah syafaat engkau akan diberi syafaat, dan mintalah engkau akan diberi.' Aku lalu angkat kepalaku dan memanjatkan pujian dan pujaan terhadap tuhanku sebagaimana yang diajakrkan-Nya kepadaku. Kemudian aku memberi syafaat, dan Ia memberiku batasan sehingga aku keluar dan aku masukkan mereka ke dalam surga.\" Qatadah berkata, \"Dan aku mendengarnya menyebutkan, \"Dan aku berangkat sehingga aku keluarkan mereka dari neraka, lalu mereka aku masukkan ke dalam surga.\" Qatadah berkata, \"Dan aku mendengarnya menyebutkan, 'Maka aku berangkat dan aku keluarkan mereka dari neraka, untuk kemudian aku masukkan mereka ke dalam surga, hingga tidak tersisa dalam neraka selain yang digi ditahan oleh alquran, atau maksudnya ia wajib abadi, kemudian beliau membaca ayat ini '(semoga Tuhanmu membangkitkankmu di tempat yang terpuji) ' (Qs. Al Isra': 79). Nabi mengatakan, \"Inilah maqam terpuji yang dijanjikan untuk nabi shallallahu 'alaihi wasallam kalian",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7441,
			"arabicnumber": 7441,
			"text": "Telah menceritakan kepada kami [Ubaidullah bin Sa'd bin Ibrahim] telah menceritakan kepadaku [Pamanku] telah menceritakan kepada kami [Ayahku] dari [Shalih] dari [Ibn Syihab] berkata, telah menceritakan kepadaku [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengutus seorang utusan ke Anshar dan mengumpulkan mereka dalam sebuah kubah (rumah bundar terbuat dari tanah liat) dan berkata, 'Bersabarlah kalian hingga kalian bertemu Allah dan rasul-Nya, sebab aku nanti berada di telaga",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7442,
			"arabicnumber": 7442,
			"text": "Telah menceritakan kepadaku [Tsabit bin Muhammad] telah menceritakan kepada kami [Sufyan] dari [Ibn Juraij] dari [Sulaiman Al Ahwal] dari [Thawus] dari [Ibn Abbas] radliyallahu'anhuma berkata, \"Jika Nabi shallallahu 'alaihi wasallam tahajjud di malam hari, beliau memanjatkan doa: 'ALLAAHUMA RABBANA LAKAL HAMDU ANTA QAYYIMUS SAMAAWAATI WAL ARDLI, WALAKAL HAMDU ANTA RABBUS SAMAAWAATI WAL ARDLI WAMAN FIIHINNA, WALAKAL HAMDU ANTA NUURUS SAMAAWAATI WAL ARDLI WAMAN FIIHINNA, ANTAL HAQQ, WAQULUKAL HAQQ, WAWA'DUKAL HAQQ, WALIQAA'UKA HAQQ, WAL JANNATU HAQQ, WANNAARU HAQQ, WASSAA'ATU HAQ, ALLAAHUMMA LAKA ASLAMTU, WABIKA AMANTU WA'ALAIKA TAWAKKALTU, WAILAIKA KHAASHAMTU WABIKA HAKAMTU FAGHFIRLII MAA QADDAMTU WAMAA AKHKHARTU WA ASRARTU WA A'LANTU, WAMAA ANTA A'LAMU BIHI MINNII, LAA-ILAAHA ILLAA ANTA (Ya Allah Tuhan kami, bagi-Mu segala puji, Engkau adalah pengurus langit dan bumi, bagi-Mu segala puji, Engkau adalah pemelihara langit dan bumi dan semua penghuninya, bagi-Mu segala puji, Engkau adalah cahaya langit dan bumi dan semua penghuninya, Engkau adalah benar, firman-Mu benar, janji-Mu benar dan perjumpaan kepada-Mu benar, surga benar, neraka benar, kiamat benar, Ya Allah, kepada-Mu aku berserah, kepada-Mu aku beriman, kepada-Mu aku bertawakkal, karena-Mu aku memusuhi (musuh), kepada-Mu aku berhukum, maka ampunilah bagiku apa yang telah aku lakukan dan yang belum aku lakukan, apa yang kulakukan secara sembunyi-sembunyi dan apa yang kulakukan secara terang-terangan, dan apa yang Engkau lebih tahu terhadapnya daripadaku, tiada sesembahan yang hak selain Engkau) '. Abu Abdullah berkata, [Qais bin Sa'd] dan [Abu Zubair] berkata dari [Thawus] dengan redaksi 'Qayyaam' bukan qayyum, sedang Mujahid berkata, 'Alqayyum (dengan definitif al) yang maknanya mengurus segala sesuatu, sedang Umar juga berkata Alqayyaam, dan keduanya sama-sama pujian",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7443,
			"arabicnumber": 7443,
			"text": "Telah menceritakan kepada kami [Yusuf bin Musa] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepadaku [Al A'masy] dari [Khaitsumah] dari ['Adi bin Hatim] berkata, 'Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah salah seorang diantara kalian kecuali ia akan diajak bicara oleh Rabbnya, antara dia dan Allah tidak ada seorang penerjemah, dan tidak pula hijab yang menghalanginya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7444,
			"arabicnumber": 7444,
			"text": "Telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Abdul Aziz bin Abd shamad] dari [Abu Imran] dari [Abu Bakar bin Abdullah bin Qais] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ada dua surga dari perak, baik bejananya maupun isinya, dan ada dua surga terbuat dari emas, baik bejananya maupun isinya, dan tidak ada yang menghalangi sebuah kaum untuk melihat Rabb mereka selain selendang kesombongan di wajahnya di surga Adn",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7445,
			"arabicnumber": 7445,
			"text": "Telah menceritakan kepada kami [Al Humaidi] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Abdul Malik bin A'yan] dan [Jami' bin Abu Rasyid] dari [Abu Wail] dari [Abdullah] radliyallahu'anhu berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berambisi memperoleh harta seorang muslim dengan sumpah palsu, ia berjumpa Allah sedang Allah dalam keadaan murka kepadanya.\" Abdullah berkata, \"Kemudian Rasulullah Shallallahu'alaihiwasallam membacakan pembenarannya dari kitabullah: '(Sesungguhnya orang-orang yang membeli janji Allah dan sumpah mereka dengan harga yang sedikit, mereka itulah orang-orang yang tidak memperoleh bagian di akherat, dan Allah tidak mengajak mereka bicara) ' (QS.Ali Imran: 77)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7446,
			"arabicnumber": 7446,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7447,
			"arabicnumber": 7447,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7448,
			"arabicnumber": 7448,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami ['Abdul Wahid] telah menceritakan kepada kami ['Ashim] dari [Abu Usman] dari [Usamah] berkata, \"Anak laki-laki dari anak perempuan Nabi shallallahu 'alaihi wasallam sakit, lantas puteri Nabi mengutus seorang utusan yang inti pesannya agar beliau mendatanginya. Hanya nabi berhalangan dan menyampaikan pesan: 'INNAA LILLAAHI MAA AKHDZA WALAHU MAA A'THAA WAKULLUN ILAA AJALIN MUSAMMAA FAL TASHBIR WAL TAHTASHIB' (Milik Allah sajalah segala yang diambil dan yang diberikan, dan segala sesuatu mempunyai batasan waktu tertentu, hendaklah engkau bersabar dan mengharap-harap ganjaran) '. Lantas puteri nabi untuk kali kedua mengutus utusannya seraya menyatakan sumpah agar beliau mendatangi. Maka Rasulullah Shallallahu'alaihiwasallam pun berangkat dan aku bersamanya, juga Mu'adz bin Jabal, Ubbay bin Ka'b, dan Ubadah bin Shamit. Ketika kami masuk, Rasulullah Shallallahu'alaihiwasallam membopong cucunya sedang napasnya sudah tersengal-sengal di dadanya -seingatku Usamah mengatakan seperti geriba kuno-, maka Rasulullah Shallallahu'alaihiwasallam pun menangis sehingga Sa'd bin 'Ubadah berkata, 'Mengapa baginda menangis? ' Nabi menjawab: 'Hanyasanya Allah menyayangi hamba-Nya yang penyayang",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7449,
			"arabicnumber": 7449,
			"text": "Telah menceritakan kepada kami [Ubaidullah bin Sa'd bin Ibrahim] telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [Ayahku] dari [Shalih bin Kisan] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Surga dan neraka saling berselisih kepada Tuhan keduanya, surga berkata, 'Wahai Tuhan, mengapa aku tak dimasuki selain orang-orang lemah dan rakyat jelata? ' Sedang neraka berkata, 'Mengapa aku dikhususkan untuk orang-orang yang sombong? ' Allah ta'ala menjawab surga: \"Engkau adalah rahmat-Ku\", dan Allah berfirman kepada neraka, 'Engkau adalah Siksa-Ku, yang Aku timpakan kepada siapa saja yang Aku kehendaki, dan masing-masing diantara kalian berdua harus dipenuhi.' Nabi bersabda: \"Adapun surga sesungguhnya Allah tidak menzhalimi satupun dari makhluk-Na, dan Allah akan memenuhi neraka dengan siapa saja yang dikehendaki-Nya, lantas mereka dilempar ke dalamnya '(neraka berkata, 'Masihkah ada tambahan) ' (QS. Qaaf ayat: 30) -beliau mengulanginya tiga kali-, kemudian Allah meletakkan telapak kakinya sehingga neraka menjadi penuh, sebagian satu dengan sebagian yang lain saling berhimpitan, neraka pun berkata, 'cukup, cukup, sukup",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7450,
			"arabicnumber": 7450,
			"text": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] radliyallahu'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan ada beberapa kaum memperoleh kehitaman-hitaman dari neraka, karena dosa-dosa yang pernah mereka lakukan sebagai hukuman atas mereka, kemudian Allah memasukkan mereka ke dalam surga dengan kurnia rahmat-Nya, mereka itulah yang dinamakan jahannamiyun (mantan penghuni neraka jahannam).\" Sedang [Hamam] berkata; telah menceritakan kepada kami [Qatadah] telah menceritakan kepada kami [Anas] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7451,
			"arabicnumber": 7451,
			"text": "Telah menceritakan kepada kami [Musa] telah menceritakan kepada kami [Abu 'Awanah] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] berkata, \"Seorang biarawan yahudi menemui Rasulullah Shallallahu'alaihiwasallam dan berkata: \"Wahai Muhammad, sesungguhnya Allah meletakkan langit diatas satu jari, seluruh bumi diatas satu jari, semua gunung diatas satu jari, pohon dan sungai diatas satu jari, dan semua makhluk diatas satu jari, kemudian Allah berfirman seraya menunjukan jarinya, 'Akulah Sang raja'.\" Maka Rasulullah Shallallahu'alaihiwasallam tertawa dan membacakan kutipan ayat: '(Dan mereka tidak menghormati Allah dengan penghormatan yang semestinya) ' (QS. Azzumar: 67)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7452,
			"arabicnumber": 7452,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] telah mengabarkan kepada kami [Muhammad bin Ja'far] telah mengabarkan kepadaku [Syarik bin Abdullah bin Abu Namir] dari [Kuraib] dari [Ibn Abbas] mengatakan, \"Suatu malam aku bermalam di rumah maimunah sedang Nabi shallallahu 'alaihi wasallam Shallallahu'alaihiwasallam di sisinya, itu kulakukan dengan niat agar aku bisa melihat Shalat Rasulullah Shallallahu'alaihiwasallam ketika malam. Rasulullah Shallallahu'alaihiwasallam berbincang-bincang bersama isterinya beberapa saat, kemudian tidur, ketika sepertiga malam terakhir tiba, atau sebagiannya, beliau duduk dan menatap langit lantas membaca ayat: '(Sesungguhnya dalam penciptaan langit dan bumi hingga ayat terdapat tanda-tanda bagi orang yang berakal) ' (QS. Ali'Imran: 190). Kemudian beliau berdiri dan berwudlu', beliau membersihkan gigi-giginya kemudian shalat sebelas rakaat. Kemudian setelah Bilal mengumandangkan adzan (subuh), beliau shalat dua rakaat, kemudian keluar untuk mengimami orang-orang shalat subuh",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7453,
			"arabicnumber": 7453,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] radliyallahu'anhu, \"Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tatkala Allah menetapkan penciptaan, Dia menulis di sisi-Nya di atas arsy-Nya 'Sesungguhnya rahmat-Ku lebih mendominasi kemurkaan-Ku",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7454,
			"arabicnumber": 7454,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Al A'masy] aku mendengar [Zaid bin Wahb] aku mendengar ['Abdullah bin Mas'ud] radliyallahu'anhu, telah menceritakan kepada kami Rasulullah Shallallahu'alaihiwasallam yang beliau adalah seorang yang jujur menyampaikan, dan berita yang disampaikan kepadanya adalah benar, bahwa penciptaan salah seorang diantara kalian dihimpun dalam perut ibunya selama empat puluh hari, atau empat puluh malam, kemudian menjadi segumpal darah dalam empat puluh hari berikutnya, kemudian menjadi segumpal daging dalam empat puluh hari berikutnya, kemudian Allah mengutus malaikat kepadanya dan memerintahkan untuk menetapkan empat kalimat (empat hal); tentang rejekinya, ajalnya, amalnya, sengsara ataukah bahagia. Kemudian Allah meniupkan ruh padanya, sungguh ada salah seorang diantara kalian yang melakukan amalan-amalan penghuni surga hingga tak ada jarak antara dia dan surga selain sehasta, namun kemudian takdir telah mendahului dia, lantas ia pun melakukan amalan penghuni neraka dan akhirnya masuk neraka. Dan sungguh ada salah seorang diantara kalian yang melakukan amalan penghuni neraka, hingga tak ada jarak antara dia dan neraka selain sehasta, namun kemudian takdir mendahuluinya, lantas ia pun mengamalkan amalan penghuni surga sehingga ia memasukinya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7455,
			"arabicnumber": 7455,
			"text": "Telah menceritakan kepada kami [Khallad bin Yahya] telah menceritakan kepada kami [Umar bin Dzar] aku mendengar [Ayahku] menceritakan dari [Said bin Jubair] dari [Ibn Abbas] Radliyallahu'anhuma, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Jibril, apa yang menghalangimu untuk mengunjungi kami lebih sering daripada apa yang telah engkau lakukan?\" Maka turunlah ayat: '(Dan tidaklah Kami menurunkan ayat melainkan dengan perintah Tuhanmu, milik Dialah apa yang didepan kami dan di belakang kami) ', hingga akhir ayat (Qs. Maryam: 64). Dan jawaban ini adalah untuk Muhammad shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7456,
			"arabicnumber": 7456,
			"text": "Telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] berkata, \"Pernah aku berjalan bersama Rasulullah shallallahu 'alaihi wasallam di sebuah kebun di Madinah, saat beliau bertelekan di atas tongkat. Kemudian beliau melewati sekelompok orang Yahudi, sebagian diantara mereka bertanya kepada sebagian lainnya 'Coba tanyailah dia tentang nyawa', sedang sebagian lain berkata 'Jangan tanyai dia tentang nyawa'. Kemudian beliau berdiri bertelekan di atas tongkatnya sedang saya berada di belakangnya, aku taksir beliau sedang menerima wahyu, lantas beliau membacakan kepada mereka: '(Dan mereka bertanya kepadamu tentang nyawa, katakanlah bahwa nyawa itu adalah urusan tuhanku, dan tidaklah kamu diberi ilmu melainkan sedikit) ' (Qs. Al Isra': 85). Maka sebagian di antara mereka berkata kepada sebagian lainnya, 'Kan telah kami katakan kepada kalian, jangan kalian tanya tentangnya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7457,
			"arabicnumber": 7457,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menjamin bagi siapa yang berjihad di jalan-Nya, yang tidaklah ia berangkat selain benar-benar untuk berjihad di jalan-Nya dan membenarkan kalimat-Nya, bahwa Dia akan memasukkannya dalam surga atau Ia akan mengembalikannya ke tempat tinggalnya yang ia tinggalkan beserta yang diperolehnya berupa pahala dan ghanimah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7458,
			"arabicnumber": 7458,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Abu Wail] dari [Abu Musa] berkata, \"Satang seseorang kepada Nabi Shallalahu'alaihiwasallam dan berujar, 'Ada seseorang yang berperang karena dorongan fanatisme, atau berperang karena ingin memperlihatkan keberanian, dan ada yang berperang karena ingin dilihat orang, siapakah yang disebut fi sabilillah? ' Nabi menjawab: \"Siapa yang berperang agar kalimatullah menjadi tinggi, ia berada fii sabilillah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7459,
			"arabicnumber": 7459,
			"text": "Telah menceritakan kepada kami [Syihab bin Ibad] telah menceritakan kepada kami [Ibrahim bin Humaid] dari [Ismail] dari [Qais] dari [Mughirah bin Syu'bah] berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Akan senantiasa ada dari umatku sekelompok orang (kaum) yang menang mengalahkan manusia, hingga keputusan Allah mendatangi mereka",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7460,
			"arabicnumber": 7460,
			"text": "Telah menceritakan kepada kami [Humaidi] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Ibnu Jabir] telah menceritakan kepadaku [Umair bin Hani'] ia mendengar [Mu'awiyah] mengatakan, \"Pernah aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Akan senantiasa ada dari umatku sebuah umat yang menegakkan perintah Allah, tidak membahayakan mereka orang yang mendustakan mereka, tidak pula yang menyelisihi mereka hingga keputusan Allah datang kepada mereka sedang mereka masih dalam keadaan seperti itu.\" [Malik bin Yukhamir] berkata, \"Aku mendengar [Mu'adz] berkata, \"Dan mereka berada di Syam.\" Mu'awiyah juga mengatakan, \"Malik beranggapan bahwa ia mendengar Mu'adz berkata, \"Dan mereka berada di Syam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7461,
			"arabicnumber": 7461,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Abdullah bin Abu Husain] telah menceritakan kepada kami [Nafi' bin Jubair] dari [Ibn Abbas] berkata, \"Pernah nabi shallallahu 'alaihi wasallam berdiri pada Musailamah di sekelompok kawan-kawannya, lantas beliau berkata \"Kalaulah engkau meminta sebidang tanah ini, niscaya aku tidak akan memberikannya kepadamu selama-lamanya, dan kamu sekali-kali tidak bisa melampaui urusan Allah yang ada padamu, dan kalaulah engkau berbalik ke belakang, Allah akan membunuhmu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7462,
			"arabicnumber": 7462,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail] dari [Abdul Wahid] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Ibnu Mas'ud] berkata, \"Pernah aku berjalan bersama nabi shallallahu 'alaihi wasallam di sebagian kebun Madinah, sedang ketika itu beliau bersandar di atas sebuah dahan pohon kurma, saat kami melewati beberapa orang Yahudi, sebagian mereka berkata kepada sebagian lainnya, 'Tolong tanyailah dia (Muhammad) tentang nyawa', sementara sebagian mereka berkata, 'Jangan engkau bertanya kepadanya suatu hal yang kalian sendiri ketakutan terhadapnya'. Namun sebagian mereka ngotot berkata, 'Sungguh kami akan bertanya kepadanya! ' Lalu sebagian di antara mereka datang menemui beliau dan berkata, \"Wahai abu Qasim, apa nyawa itu?\" Nabi shallallhu'lihiwasallam terdiam, maka aku pun tahu bahwa beliau sedang menerima wahyu. Lantas beliau membacakan ayat: '(Dan mereka bertanya kepadamu tentang nyawa, katakanlah 'Bahwasanya nyawa itu urusan Tuhanku, dan tidaklah kalian diberi ilmu kecuali sedikit saja) ' (Qs. Al Isra': 85)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7463,
			"arabicnumber": 7463,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menjamin siapa saja yang berjihad di jalan-Nya, tidak ada dorongan baginya untuk berjihad di jalan-Nya selain jihad di jalan-Nya dan membenarkan kalimat-Nya, untuk masukkan ke dalam surga, atau Allah mengembalikannya ke tempat tinggalnya dengan ganjaran atau ghanimah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7464,
			"arabicnumber": 7464,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami ['Abdul Warits] dari ['Abdul 'Aziz] dari [Anas] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian berdoa kepada Allah, maka seriuslah dalam berdoa dan jangan salah seorang di antara kalian berkata 'Jika Engkau berkehendak maka berilah aku', sebab Allah sama sekali tidak ada yang bisa memaksa",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7465,
			"arabicnumber": 7465,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Azzuhri]. (dalam jalur lain disebutkan) telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku saudaraku [Abdul Hamid] dari [Sulaiman] dari [Muhammad bin 'Atiq] dari [Ibn Syihab] dari [Ali bin Husain], bahwa [Husain bin Ali] 'alaihimassalam mengabarkan kepadanya, bahwa [Ali bin Abu Thalib] mengabarkan kepadanya, bahwa Rasulullah Shallallahu'alihiwasallam mendatangi Ali dan Fatimah di malam hari, lantas beliau berkata: \"Tidakkah kalian mendirikan shalat?\" Namun Ali menjawab, \"Wahai Rasulullah, sesungguhnya nyawa kita berada di tangan Allah, jika Dia berkenan, maka Dia akan membangunkan kita.\" Secara spontan Rasulullah Shallhu'laihiwasallam pergi begitu aku menjawab yang demikian, dan beliau sama sekali tidak kembali, kemudian aku mendengar ketika beliau berbalik ke belakang bersabda sambil menepuk pahanya: \"Sungguh manusia itu adalah makhluk yang suka sekali membantah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7466,
			"arabicnumber": 7466,
			"text": "Telah menceritakan kepada kami [Muhammad bin Sinan] telah menceritakan kepada kami [Fulaih] telah menceritakan kepada kami [Hilal bin Ali] dari ['Atha' bin Yasar] dari [Abu Hurairah] radliyallahu'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan orang mukmin adalah bagai dahan tumbuhan yang daunnya miring sesuai tempat datangnya angin, namun jika telah tenang, dahan itu bisa kembali lurus. Demikian pula seorang mukmin, terkadang dalam keadaan miring karena ujian. Sebaliknya perumpamaan orang kafir bagaikan pohon padi yang lurus dan keras, sehingga Allah (dengan mudah) mematahkannya kapan saja sekehendak-Nya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7467,
			"arabicnumber": 7467,
			"text": "Telah menceritakan kepada kami [Al Hakam bin Nafi'] Telah mengabarkan kepada kami [Syu'aib] dari [Azzuhri] telah mengabarkan kepadaku [Salim bin Abdullah], bahwa [Abdullah bin Umar] berkata, \"Aku mendengar Rasulullah Shalllhu'alaihiwasallam di atas minbar berkata: \"Keberadaan kalian dibandingkan umat-umat sebelum kalian adalah bagaikan antara shalat ashar hingga matahari terbenam. Ahli taurat diberi taurat, lantas mereka mengamalkannya hingga pertengahan siang, kemudian mereka tak mampu bekerja lagi sehingga mereka diberi satu qirath. Lantas ahlu injil diberi injil dan mengamalkannya hingga shalat ashar, kemudian mereka tak mampu lagi melaksanakannya, sehingga diberi satu qirath. Kemudian kalian diberi al Quran, lantas kalian mengamalkannya hingga matahari terbenam, lantas kalian diberi dua qirath, maka ahli taurat dan injil menyampaikan protes 'Bagaimana ini, mereka (umat Islam) lebih sedikit bekerja, namun pahalanya lebih banyak? ' Maka Allah menjawab, 'Namun apakah aku menzhalimi pahala kalian? ' Mereka menjawab, 'Engkau tidak menzhalimi! ' Maka Allah berkata, 'Itulah keutamaan-Ku yang Aku berikan kepada siapa saja yang Aku kehendaki",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7468,
			"arabicnumber": 7468,
			"text": "Telah menceritakan kepada kami [Abdullah almusnadi] telah menceritakan kepada kami [Hisyam] Telah mengabarkan kepada kami [Ma'mar] dari [Azzuhri] dari [Abu Idris] dari ['Ubadah bin shamit] berkata, \"Pernah aku berbaiat kepada Rasulullah shallallhu'alaihiwasallam bersama serombongan orang. Lantas Nabi bersabda: \"Saya membaiat kalian agar kalian tidak menyekutukan Allah dengan sesuatu apapun, tidak mencuri, tidak berzina, tidak membunuh anak-anak kalian, dan tidak mengada-adakan kebohongan yang kalian ada-adakan antara tangan dan kaki kalian, dan tidak membangkangku dalam perkara ma'ruf. Maka barangsiapa diantara kalian memenuhi baiatnya, ganjarannya berada di sisi Allah. Barangsiapa melanggar janjinya, lantas Allah menghukumnya di dunia, maka yang demikian sebagai kaffarat dosanya. Dan barangsiapa yang Allah menutupinya (membiarkannya), maka yang demikian terserah Allah, jika berkehendak Dia akan menyiksanya, dan jika berkehendak Dia akan mengampuninya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7469,
			"arabicnumber": 7469,
			"text": "Telah menceritakan kepada kami [Mu'alla bin Asad] Telah menceritakan kepada kami [Wuhaib] dari [Ayyub] dari [Muhammad] dari [Abu Hurairah], bahwa Nabiyullah Sulaiman 'alaihimassalam mempunyai enam puluh isteri dan berkata, \"Sungguh, malam ini aku akan menggilir isteri-isteriku sehingga masing-masing isteriku hamil dan melahirkan seorang penunggang kuda yang berperang fi sabilillah.' Lantas Sulaiman menggilir isteri-isterinya, namun sama sekali tidak ada yang hamil selain satu orang isteri yang melahirkan separoh orang. Maka Nabi Shallallahu'alaihjiwasallam bersabda: \"Kalaulah Sulaiman mengucapkan 'insya allah', niscaya setiap isterinya hamil dan melahirkan seorang anak yang berperang fi sabilillah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7470,
			"arabicnumber": 7470,
			"text": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami ['Abdul Wahhab Ats Tsaqafi] telah menceritakan kepada kami [Khalid Al Hadzdza'] dari ['Ikrimah] dari [Ibn Abbas] radliyallahu'anhuma, bahwa Rasulullah shallallahu 'alaihi wasallam pernah menjenguk seorang arab badui yang sedang sakit. Beliau katakan: \"Tidak apa-apa kamu, insya Allah nggak masalah.\" Lantas si arab badui menjawab, \"Apa, nggak apa-apa? Bahkan itu adalah demam yang menggelegak atas orang yang sudah tua renta yang menghantarkannya kepada kuburan.\" Maka Nabi shallallahu 'alaihi wasallam berkata: \"Semoga iya, kalau begitu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7471,
			"arabicnumber": 7471,
			"text": "Telah menceritakan kepada kami [Ibn Salam] Telah mengabarkan kepada kami [Husyaim] dari [Hushain] dari [Abdullah bin Abu Qatadah] dari [ayahnya], bahwa ketika para sahabat ketiduran dari waktu shalat, Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah menggenggam roh kalian sekehendak-Nya, dan Dia mengembalikannya sekehendak-Nya.\" Para sahabat kemudian menuntaskan kebutuhan mereka, dan berwudlu hingga matahari terbit dan putih, dan beliau kemudian berdiri dan shalat",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 7472,
			"arabicnumber": 7472,
			"text": "Telah menceritakan kepada kami [Yahya bin Qaza'ah] telah menceritakan kepada kami [Ibrahim] dari [Ibn Syihab] dari [Abu Salamah] dan [Al a'raj]. (dalam jalur lain disebutkan) telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Saudaraku] dari [Sulaiman] dari [Muhammad bin Abu 'Atiq] dari [Ibn Syihab] dari [Abu Salmah bin Abdurrahman] dan [Sa'id bin Musayyab] bahwa [Abu Hurairah] berkata, \"Seorang laki-laki muslimin dan seorang laki-laki Yahudi saling memaki (mencela). Si Muslim berkata, 'Demi Dzat yang mengistimewakan Muhammad di atas semua manusia', dan ia mengucapkannya disertai sumpah. Sedang si Yahudi berkata, 'Demi Dzat yang telah mengistimewakan Musa di atas semua manusia'. Lantas si muslim mengangkat tangannya dan menempeleng si Yahudi. Maka si Yahudi melaporkan kasusnya kepada Rasulullah Shallalahu'alaihiwasallam dan mengutarakan segala kasus yang terjadi antara dirinya dan si Muslim, maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Janganlah kalian mengistimewakanku di atas Musa, sebab manusia di hari kiamat nanti akan pingsan sehingga akulah manusia pertama-tama yang bisa siuman. Tiba-tiba Musa telah berdiri di samping 'arsy, sehingga aku tidak tahu apakah dia termasuk yang pingsan ataukah dia telah siuman sebelumku, atau dia diantara manusia yang Allah kecualikan (tidak pingsan)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 7473,
			"arabicnumber": 7473,
			"text": "Telah menceritakan kepada kami [Ishaq bin Abu 'Isa] telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] dari [Anas bin Malik] radliyallahu'anhu berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Madinah akan didatangi oleh dajjal dan ia temukan kota tersebut dijaga oleh para malaikat, sehingga dajjal tidak bisa mendekatinya, dan tidak pula penyakit tha'un, insya allah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 7474,
			"arabicnumber": 7474,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 7475,
			"arabicnumber": 7475,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 7476,
			"arabicnumber": 7476,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 7477,
			"arabicnumber": 7477,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 7478,
			"arabicnumber": 7478,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 7479,
			"arabicnumber": 7479,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 7480,
			"arabicnumber": 7480,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 7481,
			"arabicnumber": 7481,
			"text": "Telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari ['Amru] dari ['Ikrimah] dari [Abu Hurairah] yang Nabi shallallahu 'alaihi wasallam menyampaikan kepadanya, beliau bersabda: \"Jika Allah memutuskan suatu keputusan di langit, maka malaikat akan mengepak-ngepakkan sayapnya karena tunduk kepada titah-Nya, seolah-olah kepakan sayapnya seperti rantai di atas batu licin.\" Ali berkata, \"Sedang lainnya berkata, 'Seperti batu licin yang menembus mereka.' Allah berfirman: '(Apabila ketakutan telah hilang dari hati mereka, mereka bertanya 'Apa yang difirmankan Rabb kalian? Mereka menjawab 'Kebenaran, dan Dia Maha Tinggi lagi Maha Besar) ' (Qs. Saba': 34). Ali berkata; telah menceritakan kepada kami Sufyan telah menceritakan kepada kami 'Amru dari 'Ikrimah dari Abu Hurairah dengan redaksi ini.\" Sedang Sufyan berkata, Amru berkata, aku mendengar Ikrimah telah menceritakan kepada kami Abu Hurairah, [Ali] berkata, saya bertanya [Sufyan] ia menjawab, 'Aku mendengar [Ikrimah] berkata, aku mendengar [Abu Hurairah] berkata, 'Ya.' Saya bertanya kepada Sufyan, 'Beberapa orang meriwayatkan dari 'Amru dari 'Ikrimah dari Abu Hurairah yang beliau memarfu'kannya, hanya ia membaca 'furrigha (jika telah selesai) '. Sufyan berkata, 'Beginilah 'Amru membaca, maka aku tidak tahu, apakah ia mendengarnya seperti ini atau.' Sufyan berkata, 'Dan begitulah bacaan kami",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 7482,
			"arabicnumber": 7482,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibn Syihab] telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] dari [Abu Hurairah], bahwa ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah tidak pernah mengijinkan sesuatu sebagaimana ijin-Nya kepada Nabi shallallahu 'alaihi wasallam untuk melagukan Al Qur'an, \" sedang salah seorang sahabatnya berkata 'maksud melagukan yaitu membaca dengan keras",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 7483,
			"arabicnumber": 7483,
			"text": "Telah menceritakan kepada kami [Umar bin Hafs bin Ghiyats] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Abu Shalih] dari [Abu Said Al Khudzri] radliyallahu'anhu berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Allah berfirman, 'Wahai Adam! ' Adam menjawab, 'Aku penuhi panggilan-Mu! ' lantas Adam dipanggil dengan suatu suara, 'Sesungguhnya Allah Tabaraka wa Ta'ala menyuruhmu untuk mengeluarkan utusan-utusan dari anak cucumu ke neraka",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 7484,
			"arabicnumber": 7484,
			"text": "Telah menceritakan kepada kami [Ubaid bin Ismail] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin Urwah] dari [Ayahnya] dari ['Aisyah] radliyallahu'anhuma berkata, \"Belum pernah aku sedemikian cemburu kepada seorang wanita sebagaimana kecemburuanku terhadap Khadijah, sebab Tuhan Muhammad telah menyuruhnya agar memberinya kabar gembira dengan surga",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 7485,
			"arabicnumber": 7485,
			"text": "Telah menceritakan kepadaku [Ishaq] telah menceritakan kepada kami [Abdushshamad] telah menceritakan kepada kami ['Abdurrahman] -yaitu Ibnu Abdullah bin Dinar- dari [Ayahnya] dari [Abu Shalih] dari [Abu Hurairah] radliyallahu'anhu berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Tabaraka wa Ta'ala jika mencintai seseorang, Ia memanggil Jibril 'Sesungguhnya Allah mencintai si fulan maka cintailah dia, sehingga Jibril pun mencintainya. Kemudian Jibril memanggil seluruh penghuni langit seraya berseru, 'Sesungguhnya Allah mencintai si fulan maka cintailah dia, maka penghuni langit pun mencintainya, sehingga orang tersebut diterima oleh penduduk bumi",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 7486,
			"arabicnumber": 7486,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Malaikat malam dan malaikat siang secara bergantian menjaga kalian, dan mereka berkumpul pada waktu shalat 'ashar dan shalat subuh, kemudian malaikat yang menjaga kalian di malam hari naik ke langit dan Allah menanyai mereka -sekalipun Dia paling tahu terhadap keadaan mereka- bagaimana kalian tinggalkan para hamba-Ku? ' Para malaikat menjawab, 'Kami tinggalkan saat mereka sedang melaksanakan shalat, dan kami datangi mereka juga saat melaksanakan shalat",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 7487,
			"arabicnumber": 7487,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Washil] dari [Al Ma'rur] berkata, \"Aku mendengar [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jibril menemuiku dan memberiku kabar gembira, bahwasanya siapa saja yang meninggal dengan tidak menyekutukan Allah dengan sesuatu apapun, maka dia masuk surga.\" Maka saya bertanya, 'Meskipun dia mencuri dan berzina? ' Nabi menjawab: 'Meskipun dia mencuri dan juga berzina",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 7488,
			"arabicnumber": 7488,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abul Ahwash] telah menceritakan kepada kami [Abu Ishaq Al Hamdani] dari [Barra' bin Azib] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hai fulan, jika engkau mendatangi kasurmu, maka panjatkanlah doa: \"ALLAAHUMMA ASLAMTU NAFSII ILAIKA, WAWAJJAHTU WAJHII ILAIKA, WAFAWWADLTU AMRII ILAIKA, WA ALJA\"TU ZHAHRII ILAIKA, RUGHBTAN WA RUHBATAN ILAIKA, LAA MALJA'A WA LAA MANJAA MINKA ILLAA ILAIKA, AAMANTU BIKITAABIKAL LADZII ANZALTA WABINABIYYIKAL LADZII ARSALTA '(Ya Allah, aku pasrahkan jiwaku kepada-Mu, dan kuhadapkan wajahku kepada-Mu, dan aku serahkan urusanku kepada-Mu, dan aku sandarkan punggungku kepada-Mu, dengan berharap-harap cemas kepada-Mu, sesungguhnya tidak ada tempat bersandar dan tempat keselamatan selain kepada-Mu, saya beriman kepada kitab-Mu yang Engkau turunkan dan nabi-Mu yang Engkau utus) '. Maka sekiranya engkau meninggal di malammu, engkau meninggal di atas fitrah, dan jika engkau meninggal pagi harinya, engkau peroleh pahala",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 7489,
			"arabicnumber": 7489,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari [Ismail bin Abu Khalid] dari [Abdullah bin Abu Aufa] berkata, \"Dalam perang Ahzab, Rasulullah Shallallhu'alaihiwasallam berdoa: \"ALLAAHUMMA MUNZILAL KITAAB, SARII'AL HISAAB, AHZIMIL AHZAAB, WAZALZIL BIHIM (Ya Allah yang menurunkan kitab, yang cepat perhitungan-Nya, hancur leburkanlah pasukan ahzab, guncangkanlah mereka) '. Sedang [Humaidi] menambahkan; telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Ibnu Abu Khalid] aku mendengar ['Abdullah] aku mendengar nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 7490,
			"arabicnumber": 7490,
			"text": "Telah menceritakan kepada kami [Musaddad] dari [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibn Abbas] mengenai ayat: '(Dan janganlah engkau mengeraskan bacaan shalatmu dan jangan pula engkau merendahkan bacaannya) ' (Qs. Al Isra': 110), ayat ini diturunkan kepada Rasulullah shallallahu 'alaihi wasallam secara berturut-turut di Makkah. Ketika itu, jika beliau mengencangkan bacaannya, maka kaum musyrikin mendengarnya hingga mereka mencela Al Qur'an secara habis-habisan, juga mencela yang menurunkannya dan yang membawanya. Maka Allah menurunkan: '(Jangan kamu mengeraskan bacaan shalatmu dan jangan pula merendahkannya) ' (Qs. Al Isra': 110). Jangan kamu mengeraskan bacaanmu maksudnya hingga terdengar oleh orang-orang musyrik, dan jangan pula kamu merendahkannya, maksudnya sehingga tidak terdengar oleh kawan-kawanmu. Dan carilah jalan tengah di antara keduanya, maksudnya bacalah sehingga terdengar oleh kawanmu namun jangan pula kamu membaca terlalu keras hingga musuh mencela Al Qur'an akibat bacaanmu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 7491,
			"arabicnumber": 7491,
			"text": "Telah menceritakan kepada kami [Al Humaidi] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Azzuhri] dari [Sa'id bin Musayyab] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala berfirman: 'Anak adam menyakiti-Ku dan mencela masa, padahal Aku adalah masa, di tangan-Ku lah segala urusan, Akulah yang membolak-balikkan siang dan malam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 7492,
			"arabicnumber": 7492,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Al A'masy] dari [Abu shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Allah Azza wa Jalla berfirman: 'Puasa adalah milik-Ku, dan Aku sendirilah yang mengganjarinya, orang yang berpuasa itu meninggalkan syahwatnya, makan dan minumnya karena Aku. Puasa adalah perisai, dan bagi orang yang berpuasa mendapat dua kegembiraan, kegembiraan ketika ia berjumpa dengan rabbnya. Dan sungguh, bau mulut orang yang berpuasa jauh lebih wangi di sisi Allah daripada bau minyak kesturi",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 7493,
			"arabicnumber": 7493,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami ['Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Hammam] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Dikala Ayyub mandi dalam keadaan telanjang, tiba-tiba kaki belalang yang terbuat dari emas jatuh kepadanya, kemudian Ayyub membungkus dengan kainnya. Maka Tuhannya memanggilnya, 'Wahai Ayyub, bukankah Aku telah mengayakanmu daripada sekedar apa yang engkau lihat? ' Ayyub menjawab, 'Benar wahai Rabbku, namun saya belum berkecukupan dari barakah-Mu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 7494,
			"arabicnumber": 7494,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Ibn Syihab] dari [Abu Abdullah Al Aghar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb kita Tabaraka wa Ta'ala setiap malam turun ke langit dunia ketika sepertiga malam, lantas Ia berkata, 'Siapa yang berdoa kepada-Ku maka aku beri, siapa yang meminta ampun kepada-Ku maka Aku ampuni?",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 7496,
			"arabicnumber": 7496,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 7497,
			"arabicnumber": 7497,
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Ibn fudlail] dari ['Umarah] dari [Abu Zur'ah] dari [Abu Hurairah] berkata, \"Inilah Khadijah datang kepadamu dengan bejana berisi makanan dan bejana berisi minuman, dan sampaikanlah salam kepadanya dari tuhannya, dan berilah dia kabar gembira dengan rumah yang terbuat dari mutiara, yang tiada keributan dan kegaduhan di sana",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 7498,
			"arabicnumber": 7498,
			"text": "Telah menceritakan kepada kami [Mu'adz bin Asad] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] radliyallahu'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Allah berfirman, 'Aku persiapkan bagi hamba-Ku yang shalih (ganjaran) yang tidak terlihat oleh mata, belum terdengar oleh telinga dan belum pernah terdetik oleh hati manusia",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 7499,
			"arabicnumber": 7499,
			"text": "Telah menceritakan kepada kami [Mahmud] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibn Juraij] telah mengabarkan kepadaku [Sulaiman Al Ahwal] bahwa [Thawus] radliyallahu'anhu mengabarkan kepadanya, ia mendengar [Ibn Abbas] berkata, \"Jika Nabi Shallalahu'alaihi wasallam tahajjud malam hari beliau membaca: 'ALLAAHUMA LAKAL HAMDU, ANTA NUURUSSAMAWAATI WAL ARDLI, WALAKAL HAMDU ANTA QOYYIMUSSAWAATI WAL ARDLI, WALAKAL HAMDU ANTA RABBUSSAMAAWAATI WAL ARDLI WAMAN FIIHINNA, ANTAL HAQQU, WAWA'DUKAL HAQQ, WAQOULUKL HAQQ, WALIQOO'UKAL HAQQ, WALJANNATU HAQQ, WANNAARU HAQQ, WANNABIYUUN HAQQ, WASSAA'ATU HAQQ, ALLOOHUMMA LAKA ASLAMTU WABIKA AAMANTU WAILAIKA TAWAKKALTU, WAILAIKA ANABTU, WABIKA KHAASHAMTU, WAILAIKA HAAKAMTU, FAHGHFIRLII MA QADDAMMTU WAMAA AKHKHARTU, WAMA ASRARTU WAMAA A'LANTU, ANTA ILAAHII, LAA-ILAAHA ILLAA ANTA (Ya Allah, bagi-Mu lah segala puji, Engkau cahaya langit dan bumi, bagi-Mu segala puji, Engkau adalah pemelihara langit dan bumi, dan bagi-Mu segala puji, Engkau adalah Pemilik langit dan bumi dan siapa saja yang menghuninya, Engkau adalah Benar, dan janji-Mu benar, firman-Mu benar, pertemuan dengan-Mu benar, surga-Mu benar, neraka-Mu benar, para nabi benar, dan kiamat benar. Ya Allah, kepada-Mu aku berserah, kepada-Mu aku beriman, kepada-Mu aku bertawakkal, kepada-Mu aku menyandarkan diri, karena-Mu aku memusuhi, dan kepada-Mu aku meminta penghakiman, maka ampunilah bagiku apa yang telah aku perbuat dan apa yang belum aku lakukan, apa yang aku lakukan secara sembunyi-sembunyi dan apa yang aku lakukan secara terang-terangan, Engkau adalah Tuhanku, tiada sesembahan yang hak selain Engkau)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 7500,
			"arabicnumber": 7500,
			"text": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Abdullah bin Umar An Numairi] telah menceritakan kepada kami [Yunus bin Yazid Al Aili] mengatakan, aku mendengar [Azzuhri] berkata, Aku mendengar ['Urwah bin Zubair] dan [Sa'id bin Musayyab] dan ['Alqamah bin Waqqash] dan [Ubaidullah bin Abdullah] dari hadis [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ketika penyebar-penyebar kebohongan menyebarluaskan kebohongan terhadapnya. Kemudian Allah menyucikannya dari kebohongan yang mereka katakan, dan kesemuanya menceritakan kepadaku sekumpulan hadis yang masing-masing mereka riwayatkan dari Aisyah, Aisyah berkata, \"Akan tetapi demi Allah, aku sama sekali tak punya perkiraan Allah akan menurunkan wahyu terhadap berita kesucianku, sungguh urusanku terhadap diriku lebih remeh daripada Allah berbicara tentangku dengan wahyu yang dibacakan, yang kuharap ketika itu hanyalah sekiranya Rasulullah shallallahu 'alaihi wasallam bermimpi dalam tidurnya, yang menceritakan berita kesucianku dari ghosip yang disebarkan orang-orang. Lantas Allah menurunkan ayat: '(sesungguhnya orang-orang yang datang dengan membawa berita bohong) ', (Qs. An Nuur: 11), dan seterusnya hingga sepuluh ayat",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 7501,
			"arabicnumber": 7501,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 7502,
			"arabicnumber": 7502,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 7503,
			"arabicnumber": 7503,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 7504,
			"arabicnumber": 7504,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 7505,
			"arabicnumber": 7505,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 7506,
			"arabicnumber": 7506,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 7507,
			"arabicnumber": 7507,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 7508,
			"arabicnumber": 7508,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 7509,
			"arabicnumber": 7509,
			"text": "Telah menceritakan kepada kami [Yusuf bin Rasyid] telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Bakar bin 'Iyyasy] dari [Humaid] berkata, \"Aku mendengar [Anas] radliyallahu'anhu berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Jika hari kiamat tiba, maka aku diberi syafaat, lantas aku berkata: 'Wahai rabb, tolong masukkanlah ke dalam surga siapa saja yang dalam hatinya masih ada sebiji sawi iman.' Lantas mereka pun masuk, kemudian aku berkata: 'Masukkanlah dalam surga siapa saja yang dalam hatinya ada iman sekalipun dalam tingkatan paling rendah.\" Anas berkata, \"Seakan aku melihat jari-jari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 7510,
			"arabicnumber": 7510,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ma'bad bin Hilal Al 'Anazi] berkata, \"Kami, orang-orang penduduk Bashrah, berkumpul dan pergi menemui [Anas bin Malik], lalu kami pergi bersama Tsabit Al Bunani dengan tujuan bertanya tentang hadis Syafaat. Tidak tahunya Anas bin mlik dalam berada istananya, lalu kami temui beliau tepat ketika ia sedang shalat dluha. Kemudian kami meminta ijin dan ia pun memberi ijin yang ketika itu ia tengah duduk di atas kasurnya. Maka kami berkata kepada Tsabit, 'Jangan kamu bertanya kepadanya tentang sesuatu sebelum hadis syafaat.' Lantas Tsabit bertanya, 'Wahai Abu Hamzah, kawan-kawanmu dari penduduk Bashrah datang kepadamu untuk bertanya tentang hadis syafaat.' Lantas Anas berkata, \"Muhammad shallallahu 'alaihi wasallam telah menceritakan kepada kami, beliau bersabda: \"Jika hari kiamat tiba, maka manusia satu sama lain saling bertumpukan. Mereka kemudian mendatangi Adam dan berkata, 'Tolonglah kami agar mendapat syafaat Tuhanmu.' Namun Adam hanya menjawab, 'Aku tak berhak untuk itu, namun datangilah Ibrahim sebab dia adalah khalilurrahman (Kekasih Arrahman).' Lantas mereka mendatangi Ibrahim, namun sayang Ibrahim berkata, 'Aku tak berhak untuk itu, coba datangilah Musa, sebab dia adalah nabi yang diajak bicara oleh Allah (kaliimullah).' Mereka pun mendatangi Musa, namun Musa berkata, 'Saya tidak berhak untuk itu, coba mintalah kepada Isa, sebab ia adalah roh Allah dan kalimah-Nya.' Maka mereka pun mendatang Isa. Namun Isa juga berkata, 'Maaf, aku tak berhak untuk itu, namun cobalah kalian temui Muhammad shallallahu 'alaihi wasallam.' Mereka pun mendatangiku sehingga aku pun berkata: \"Aku kemudian meminta ijin Tuhanku dan aku diijinkan, Allah mengilhamiku dengan puji-pujian yang aku pergunakan untuk memanjatkan pujian terhadap-Nya, yang jika puji-pujian itu menghadiriku sekarang, aku tidak melafadkan puji-pujian itu. Aku lalu tersungkur sujud kepada-Nya, lantas Allah berfirman 'Wahai Muhammad, angkatlah kepalamu, katakanlah engkau akan didengar, mintalah engkau akan diberi, mintalah keringanan engkau akan diberi keringanan.' Maka aku menghiba 'Wahai tuhanku, umatku-umatku.' Allah menjawab, 'Berangkat dan keluarkanlah dari neraka siapa saja yang dalam hatinya masih terdapat sebiji gandum keimanan.' Maka aku mendatangi mereka hingga aku pun memberinya syafaat. Kemudian aku kembali menemui tuhanku dan aku memanjatkan puji-pujian tersebut, kemudian aku tersungkur sujud kepada-Nya, lantas ada suara 'Hai Muhammad, angkatlah kepalamu dan katakanlah engkau akan didengar, dan mintalah engkau akan diberi, dan mintalah syafaat engkau akan diberi syafaat.' Maka aku berkata, 'Umatku, umatku, ' maka Allah berkata, 'Pergi dan keluarkanlah siapa saja yang dalam hatinya masih ada sebiji sawi keimanan, ' maka aku pun pergi dan mengeluarkannya. Kemudian aku kembali memanjatkan puji-pujian itu dan tersungkur sujud kepada-Nya, lantas Allah kembali berkata, 'Hai Muhammad, angkatlah kepalamu, katakanlah engkau akan didengar, mintalah engkau akan diberi, dan mintalah syafaat engkau akan diberi syafaat.' Maka aku berkata, 'Wahai tuhanku, umatku, umatku.' Maka Allah berfirman: 'Berangkat dan keluarkanlah siapa saja yang dalam hatinya masih ada iman meskipun jauh lebih kecil daripada sebiji sawi, ' maka aku pun berangkat dan mengeluarkan mereka dari neraka.\" Tatkala kami pulang tempat dari Anas, aku katakan kepada sebagian sahabat kami, 'Duhai, sekiranya saja kita melewati Al Hasan -yang dia menyepi di rumah Abu khalifah-'. Lantas kami menceritakan kepada Al Hasan dengan apa yang telah diceritakan Anas bin Malik kepada kami. Selanjutnya kami pun menemuinya dan kami ucapkan salam, ia mengijinkan kami dan kami katakan, 'Wahai Abu Sa'id, kami datang menemuimu setelah kami kembali dari saudaramu, Anas bin Malik. Belum pernah kami lihat sebagaimana yang ia ceritakan kepada kami tentang syafaat.' Lantas ia berkata, 'Heiih.' Maka hadits tersebut kemudian kami ceritakan kepadanya (Al Hasan), dan berhenti sampai sini. Namun ia berkata, 'Hei! Hanya sampai situ? ' Kami jawab, 'Dia tidak menambah kami daripada sekedar ini saja.' Lantas ia berkata, 'Sungguh, dia pernah menceritakan kepadaku itu -secara sempurna- kepadaku sejak dua puluh tahun yang lalu, aku tidak tahu apakah dia lupa ataukah tidak suka jika kalian kemudian pasrah.' Kami lalu berkata, 'Wahai Abu Sa'id, tolong ceritakanlah kepada kami! ' Al Hasan kemudian tertawa seraya berkata, 'Sesungguhnya manusia dicipta dalam keadaan tergesa-gesa. Saya tidak menyebutnya selain saya akan menceritakannya kepada kalian. Anas telah menceritakan kepadaku sebagaimana dia ceritakan kepada kalian. Nabi berkata: \"Kemudian aku kembali untuk keempat kalinya, dan aku memanjatkan dengan puji-pujian itu kemudian aku tersungkur sujud dan diserukan, 'Wahai Muhammad, angkatlah kepalamu, ucapkanlah engkau didengar, mintalah engkau diberi, dan mintalah syafaat engkau akan diberi syafaat, ' maka aku berkata, 'Wahai Tuhanku, ijinkanlah bagiku untuk orang-orang yang mengucapkan La-Ilaaha-Illallah! ' Maka Allah menjawab, 'Demi kemuliaan, keagungan dan kebesaran-Ku, sungguh akan Aku keluarkan siapa saja yang mengucapkan Laa-Ilaaha-Illallah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 7511,
			"arabicnumber": 7511,
			"text": "Telah menceritakan kepada kami [Muhammad bin Khalid] telah menceritakan kepada kami ['Ubaidullah bin Musa] dari [Israil] dari [Manshur] dari [Ibrahim] dari ['Abidah] dari ['Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia yang terakhir kali masuk surga dan terakhir kali keluar dari neraka adalah seseorang yang keluar dengan merangkak, lantas tuhannya berkata, 'Masuklah kamu dalam surga.' Orang tersebut kemudian berkata, 'Wahai Tuhanku, surga sudah sesak! ' Allah mengulangi firman-Nya hingga tiga kali, namun si hamba terus menjawabnya dengan mengatakan 'Surga sudah penuh'. Maka Allah berfirman: 'Sesungguhnya surga bagimu seperti dunia dikalikan sepuluhnya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 7512,
			"arabicnumber": 7512,
			"text": "Telah menceritakan kepada kami ['Ali bin Hujr] telah memberitakan kepada kami ['Isa bin Yunus] dari [Al A'masy] dari [Khaitsamah] dari ['Adi bin Hatim] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah salah seorang di antara kalian melainkan akan diajak bicara oleh tuhannya dengan tanpa juru penerjemah, saat ia melihat sebelah kanannya maka ia tidak melihat selain amalnya yang pernah dilakukan, saat ia melihat sebelah kirinya maka ia tidak melihat kecuali apa yang telah ia lakukan sebelumnya, dan saat ia lihat depannya maka melihat selain neraka di depan mukanya. Maka jagalah kalian dari neraka walau hanya dengan separoh biji kurma.\" [Al A'masy] mengatakan, \"Dan telah menceritakan kepadaku ['Amru bin Murrah] dari [Khaitsamah] semisalnya, dan ia tambahi dengan redaksi, 'Walaupun hanya dengan kata-kata yang baik",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 7513,
			"arabicnumber": 7513,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari ['Abidah] dari ['Abdullah] radliyallahu'anhu berkata, \"Seorang biarawan Yahudi datang dan berkata, 'Jika hari kiamat terjadi, maka Allah meletakkan langit di atas jari-Nya, dan tujuh lapisan bumi juga diletakkan di atas jarinya dan air, bintang juga di atas jari, dan seluruh makhluk yang ada juga di atas satu jarinya, kemudian Allah menggetarkan mereka seraya berkata: 'Aku adalah Sang raja, akulah sang raja! ' Dan kulihat Nabi shallallahu 'alaihi wasallam tertawa hingga kelihatan gigi gerahamnya sebagai pertanda takjub dan membenarkan ucapannya. Kemudian Nabi Shallallahu'alaihiwasalam membacakan firman Allah: '(Dan mereka (orang-orang Yahudi) tidak menghormati Allah dengan penghormatan yang sebenarnya) hingga ayat '(dari apa yang mereka persekutukan) ' (Qs. Azzumar: ayat 67)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 7514,
			"arabicnumber": 7514,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Shafwan bin Mukhraz], bahwa ada seorang laki-laki bertanya [Ibnu Umar], \"Bagaimana engkau mendengar Rasulullah shallallahu 'alaihi wasallam bersabda tentang bisikan?\" Ibnu Umar menjawab, 'Salah seorang di antara kalian mendekati tuhannya hingga Allah meletakkan dekapannya kepadanya dan berujar, 'Bukankah engkau telah melakukan demikian? ' Maka si hamba tadi berkata, 'Benar.' Allah lantas berkata lagi, 'Bukankah engkau melakukan yang demikian-demikian? ' Si hamba tadi menjawab, 'Benar, ' dan dia mengakuinya. Kemudian Allah berkata, 'Sesungguhnya aku telah menutup dosa-dosa itu bagimu di dunia, dan hari ini aku mengampuninya bagimu'.\" Sedang [Adam] berkata, telah menceritakan kepada kami [Syaiban] telah menceritakan kepada kami [Qatadah] telah menceritakan kepada kami [Shafwan] dari [Ibn 'Umar] berkata, 'Aku mendengar Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 7515,
			"arabicnumber": 7515,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] telah menceritakan kepada kami [Uqail] dari [Ibn Syihab] telah menceritakan kepada kami [Humaid bin Abdurrahman] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Adam dan Musa berbantah-bantahan pada hari kiamat, Musa berkata kepada Adam, 'Engkaulah penyebab yang mengeluarkan anak cucumu dari surga! ' Sedang Adam berkata, 'Engkau Musa, yang Allah telah memilihmu dengan risalah-Nya dan kalam-Nya, engkau mencelaku atas sesuatu yang telah ditakdirkan bagiku sebelum aku dicipta! ' Maka Adam lah yang mengalahkan Musa",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 7516,
			"arabicnumber": 7516,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] telah menceritakan kepada kami [Qatadah] dari [Anas] radliyallahu'anhu berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang mukmin dikumpulkan pada hari kiamat dan berkata, 'Duh sekiranya kita bisa meminta syafaat untuk kami kepada tuhan kami, sehingga Allah bisa memberi kenyamanan bagi kami dari tempat kami ini.' Lantas mereka mendatangi Adam seraya berkata, 'Hai Adam, engkau adalah nenek moyang seluruh manusia, Allah telah menciptamu dengan tangan-Nya, Allah telah menyuruh para malaikat untuk sujud kepadamu, dan Dia mengajarimu nama-nama segala sesuatu, maka mintalah syafaat untuk kami kepada Tuhan kami sehingga Allah bisa memberi kenyamanan bagi kami.' Maka Adam berkata, 'Aku tidak berhak melakukan itu untuk kalian, ' lantas Adam menceritakan kesalahan yang pernah dilakukannya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 7517,
			"arabicnumber": 7517,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepadaku [Sulaiman] dari [Syarik bin Abdullah] berkata, \"Aku mendengar [Anas bin Malik] berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam diisra'kan dari masjid Ka'bah, beliau didatangi oleh tiga orang -yang ketika itu beliau belum menerima wahyu- ketika di masjidil haram. Laki-laki pertama berkata, 'Mana orangnya? ' Laki-laki kedua berkata, 'Itu, orang terbaik di antara mereka! ' Lantas laki-laki ketiga berkata, 'Ambillah orang terbaik mereka', pada malam itu beliau tidak bisa melihat mereka bertiga. Hingga pada malam berikutnya mereka mendatangi beliau lagi, yang ketika itu hati (beliau) melihat, mata beliau tidur namun tidak untuk hatinya. Demikian pula para nabi, mata mereka tertidur namun hati mereka tidak tidur. Para malaikat itu tidak mengajak bicara beliau hingga mereka membawa dan meletakkan beliau di sisi sumur zamzam, Jibril lantas memimpin mereka untuk menyucikan nabi. Jibril kemudian membelah antara tenggorokan beliau hingga pangkal lehernya, sampai dadanya dan perutnya. Jibril kemudian memandikan beliau dengan air zamzam dengan tangannya hingga sampai pada bagian perut, setelah itu didatangkanlah bejana besar dari emas yang di dalamnya ada bejana yang terbuat dari tanah liat dari emas yang diisi dengan keimanan dan hikmah. Dengannya, Jibril mengisi dada dan urat-urat kerongkongannya lalu menjahitnya kembali. Kemudian Jibril membawanya ke langit dunia dan ia ketuk salah satu pintunya sehingga penghuni langit bertanya, 'Siapakah ini? ' Jibril berkata, 'Para malaikat bertanya, 'Siapa yang bersamamu? ' Jibril menjawab, 'Bersamaku Muhammad.' Penghuni langit bertanya, 'Dia telah diutus? ' Jibril menjawab, 'Benar.' Penghuni langit lalu berkata, 'Selamat datang, selamat atas kunjungannya.' Maka penghuni langit sedemikian bergembira, mereka tidak tahu apa yang Allah inginkan terhadap diri Muhammad di muka bumi, hingga Allah memberitahu mereka. Lantas di langit dunia nabi bertemu Adam, Jibril memperkenalkan kepada beliau, 'Ini adalah ayahmu, Adam. Ucapkanlah salam kepadanya. Dia (Muhammad) lalu mengucapkan salam yang kemudian dijawab oleh Adam seraya, 'Selamat datang, selamat berkunjung wahai anakku, sungguh engkau anak yang terbaik.' Ternyata di langit dunia ada dua sungai yang mengalir, Nabi Muhammad bertanya, 'Dua sungai apa ini wahai Jibril? ' Jibril menjawab, 'Ini adalah Nil dan Eufrat.' Kemudian Jibril terus membawa Nabi ke langit, tiba-tiba ada sungai lain yang di atasnya ada istana dari mutiara dan intan, Nabi memukulnya dengan tangannya, tiba-tiba baunya seperti minyak wangi adlfar. Nabi bertanya, 'Ini apa wahai Jibril? ' Jibril menjawab, 'Ini adalah telaga al Kautsar yang sengaja disimpan oleh Tuhanmu untukmu.' Kemudian Jibril membawanya naik ke langit kedua, dan malaikat bertanya kepadanya seperti yang ditanyakan malaikat pada langit pertama. Mereka bertanya, 'Siapa ini? ' Jibril menjawab, 'Ini Jibril.' Mereka bertanya lagi, 'Dan siapa ini yang bersamamu? ' Jibril menjawab, 'Muhammad shallallahu 'alaihi wasallam.' Mereka bertanya, 'Apakah dia telah diutus? ' Jibril menjawab, 'Benar.' Malaikat (langit tersebut) lalu berkata, 'Selamat datang, selamat atas kunjungannya.' Jibril kemudian membawanya naik ke langit ketiga dan para malaikat bertanya kepadanya sebagaimana yang ditanyakan malaikat di langit pertama dan kedua, kemudian Jibril membawanya naik ke langit keempat, dan mereka bertanya seperti halnya pertanyaan malaikat sebelumnya, setiap langit berisikan para nabi yang Jibril sebutkan nama-namanya. Dan seingatku di antara mereka ada Idris di langit kedua, Harun di langit keempat, dan lain di langit ke lima yang aku tak hapal namanya, Ibrahim di langit keenam, dan Musa di langit ketujuh karena diberi kelebihan bisa berbicara langsung dengan Allah. Lantas Musa berkata, 'Wahai Rabb, setahuku tak ada orang yang lebih ditinggikan daripada aku, ' kemudian Jibril membawanya naik di atas kesemuanya yang tidak satupun yang tahu selain Allah hingga tiba di Sidratul Muntaha. Kemudian Jibril mendekati Allah, Al Jabbar, Rabb pemilik kemuliaan, Nabi terus mendekat hingga jarak antara keduanya sebatas dua busur panah atau lebih dekat lagi, dan Allah memberinya wahyu, yang di antara wahyunya, Allah mewajibkan lima puluh kali shalat untuk umatmu (Muhammad) siang-malam. Kemudian Nabi turun hingga bertemu Musa, Musa menahannya dan berkata, 'Hai Muhammad, apa yang diikrarkan Tuhanmu kepadamu? ' Nabi menjawab, 'Allah mewajibkan aku untuk mendirikan lima puluh kali shalat sehari semalam.' Musa berkata, 'Umatmu tak bakalan kuat melakukan sedemikian itu, kembalilah kamu agar Tuhanmu memberi keringanan untkmu dan umatmu.' Maka Nabi menoleh ke Jibril seolah-olah meminta saran tentang saran Musa, dan Jibril memberi isyarat, 'Silahkan, kalau kau berkenan.' Maka Jibril kembali menaikannya ke Allah Yang Maha Jabbar yang ketika itu masih berada di singgahsana-Nya, Nabi katakan, 'Wahai Rabb, berilah kami keringanan, sebab umatku tak bakalan mampu melakukan shalat lima puluh kali dalam sehari! ' Lantas Allah mengurangi sepuluh kali, dan Nabi kembali bertemu Musa dan Musa menahannya, Musa terus-menerus membujuknya agar Nabi menegoisasi ulang kepada Rabbnya, sehingga Allah hanya mewajibkan lima kali shalat sehari-semalam. Musa kemudian menahannya ketika kewajiban shalat tinggal lima, Musa mengatakan, 'Hai Muhammad, pernah aku membujuk Bani Israil, kaumku, untuk suatu yang lebih rendah daripada ini namun mereka meninggalkannya, padahal umatmu lebih lemah fisiknya, badannya, hatinya, pandangan dan pendengarannya, maka temuilah kembali Rabbmu agar Dia memberi keringanan.' Dan atas semua instruksi itu, Nabi menoleh kepada Jibril untuk memberi saran, namun Jibril tidak membenci atas itu semua. Lantas Jibril kembali membawanya naik untuk kali kelima, lalu Nabi berkata, 'Ya Rabb, umatku adalah orang-orang lemah fisiknya, hatinya, pendengarannya, pandangannya, dan badannya, maka berilah kami keringanan.' Allah Yang Maha Jabbar menjawab, 'Hai Muhammad! ' Nabi menjawab, 'Aku penuhi panggilan-Mu.' Allah meneruskan firman-Nya, 'Sesungguhnya tidak ada lagi pergantian titah-Ku sebagaimana Aku wajibkan atasmu dalam ummul kitab.' Allah meneruskan titah-Nya, setiap satu kebaikan dibalas sepuluh kali lipatnya, maka lima kali shalat itu tercatat lima puluh kali dalam ummul kitab, sekalipun hanya dilaksanakan lima kali olehmu.' Maka Nabi kembali menemui Musa dan Musa bertanya, 'Apa yang telah kamu lakukan? ' Nabi menjawab, 'Allah betul-betul telah memberi kami keringanan, karena setiap kebaikan dibalas sepuluh kali lipatnya.' Musa berkata, 'Demi Allah, aku pernah membujuk bani israil untuk yang lebih remeh daripada itu namun mereka meninggalkannya, maka kembalilah kau temui Tuhanmu agar Dia memberi keringanan terhadapmu.' Rasulullah shallallahu 'alaihi wasallam menjawab, 'Hai Musa, demi Allah, aku telah malu kepada Tuhanku terhadap protes yang kulakukan terhadap-Nya.' Musa pun berkata, 'Baik kalau begitu, silahkan engkau turun dengan nama Allah.' Maka Nabi bangun (tidur) yang ketika itu beliau di Masjidil Haram",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 7518,
			"arabicnumber": 7518,
			"text": "Telah menceritakan kepada kami [Yahya bin Sulaiman] telah menceritakan kepadaku [Ibn Wahb] berkata, telah menceritakan kepadaku [Malik] dari [Zaid bin Aslam] dari ['Atha' bin Yasar] dari [Abu Sa'id Al Khudzri] radliyallahu'anhu berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Allah memanggil penduduk surga, 'Hai penduduk surga! ' Mereka menjawab, 'Baik, kami penuhi panggilan-Mu, dan seluruh kebaikan berada di tangan-Mu! Allah meneruskan, 'Apakah kalian telah puas! ' Mereka menjawab, 'Bagaimanakah kami tidak puas wahai Rabb, sedang telah Engkau beri kami sesuatu yang belum pernah Engkau berikan kepada satu pun dari makhluk-Mu! Allah kembali berkata, 'Maukah Aku beri kalian suatu yang lebih utama daripada itu semua? ' Mereka balik bertanya, 'Ya Rabb, apalagi yang lebih utama daripada itu semua? ' Allah menjawab, 'Sekarang Aku halalkan untuk kalian keredlaan-Ku, sehingga Aku tidak marah terhadap kalian selama-lamanya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 7519,
			"arabicnumber": 7519,
			"text": "Telah menceritakan kepada kami [Muhammad bin Sinan] telah menceritakan kepada kami [Fulaih] telah menceritakan kepada kami [Hilal] dari ['Atha' bin Yasar] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam suatu hari menyampaikan hadis sedang di sisinya ada seorang arab badui: \"Ada seorang penduduk surga meminta ijin Tuhannya untuk menanam. Allah berujar, 'Bukankah engkau diperkenankan sekehendakmu! ' Orang tersebut menjawab, 'Memang, namun aku ingin menanam! ' Orang itu kemudian bergegas menabur benih, dan ujung-ujung tanamannya sedemikian cepat tumbuh, juga perkembangbiakannya, sehingga ia juga cepat memanen, yang himpunan panenannya sebesar gunung. Kemudian Allah berfirman, 'Silahkan kau ambil hai Anak adam, sungguh tak ada sesuatu yang menjadikanmu puas! ' Maka si arab badui berkata, 'Wahai Rasulullah, (jika demikian) tidak akan engkau temukan seperti orang ini selain dari Quraisy atau orang anshar, sebab mereka hobi bercocok tanam, adapun kami, tidak suka bercocok tanam! Rasulullah pun menjadi tertawa",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 7520,
			"arabicnumber": 7520,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wail] dari ['Amru bin Syurahbil] dari ['Abdullah] berkata, \"Pernah aku bertanya Nabi Shallahu'alaijiwasallam, dosa apa yang paling besar di sisi Allah?\" Nabi menjawab, \"Engkau menjadikan tandingan untuk Allah, padahal Dialah yang menciptamu.\" Aku lalu berkata, \"Jika demikian berarti itu memang perkara besar!\" kemudian aku bertanya lagi, 'Lalu apa lagi? ' Nabi menjawab: \"Engkau membunuh anakmu karena kamu khawatir akan makan bersamamu.\" Kemudian saya bertanya, \"Lantas apa lagi?\" Nabi menjawab: \"Engkau berzina dengan isteri tetanggamu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 7521,
			"arabicnumber": 7521,
			"text": "Telah menceritakan kepada kami [Humaidi] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Manshur] dari [Mujahid] dari [Abu Ma'mar] dari [Abdullah] radliyallahu'anhu berkata, \"Ada dua orang kabilah Tsaqif dan seorang qurays, atau dua orang qurasy. Salah seorang dari kabilah Tsaqif lemak perutnya terlihat banyak sekali, sementara kefakihan hati mereka sangat minim. Lalu salah seorang dari mereka berkata, 'Apa menurutmu Allah akan mendengar apa yang kita ucapkan? ' Sedang lainnya berkata, 'Allah mendengar jika kita mengucapkan dengan lantang, dan Dia tidak mendengar jika kita mengucapkan dengan lirih (rahasia).' Lantas lainnya berkata, 'Apabila Dia mendengar jika kita mengucapkan secara lantang, tentu Dia juga mendengar jika kita mengucapkan secara lirih! Lantas Allah menurunkan ayat: '(Dan apa saja yang kalian sembunyikan, akan bersaksi atas kalian, pendengaran kalian, tidak pula penglihatan kalian dan tidak pula kulit kalian) ', (Qs. Fushshilat: ayat 22)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 7522,
			"arabicnumber": 7522,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Hatim bin Wardan] telah menceritakan kepada kami [Ayyub] dari ['Ikrimah] dari [Ibn Abbas] radliyallahu'anhuma, ia berkata, \"Bagaimana kalian bertanya ahli kitab tentang kitab mereka padahal kalian mempunyai Kitabullah, kitab yang paling dekat janjinya kepada Allah, yang kalian membacanya dengan tidak dicampuri hal-hal lainnya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 7523,
			"arabicnumber": 7523,
			"text": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Azzuhri] telah mengabarkan kepadaku ['Ubaidullah bin Abdullah] bahwa [Abdullah bin Abbas] berkata, \"Wahai segenap muslimin, bagaimana kalian bertanya ahli kitab tentang sesuatu, sedang kitab kalian yang Allah turunkan kepada nabi kalian shallallahu 'alaihi wasallam adalah berita paling baru tentang Allah yang tidak dicampuri oleh sesutu apapun, dan Allah telah menceritakan kepada kalian bahwa ahli kitab mengubah-ubah kitab Allah dan merubah-rubahnya. Setelah itu mereka tulis kitab-kitab Allah dengan tangannya, dan mereka katakan, 'Ini dari Allah', yang demikian untuk mereka beli dengan harga yang sedikit, tidakkah ilmu yang datang kepada kalian melarang kalian bertanya kepada mereka? Tidak, demi Allah, tidak akan kami lihat salah seorang di antara mereka bertanya kalian tentang yang diturunkan kepada kalian",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 7524,
			"arabicnumber": 7524,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu 'Awanah] dari [Musa bin Abu 'Aisyah] dari [Sa'id bin Jubair] dari [Ibn Abbas] tentang firman Allah: '(Jangan kamu gerakkan lisanmu) ' (Qs. Al Qiyamah: 16), Ibnu Abbas katakan, \"Nabi shallallahu 'alaihi wasallam merasa sangat kepayahan mengikuti wahyu yang diturunkan sehingga beliau gerak-gerakkan kedua bibirnya.\" Ibnu Abbas lantas berkata kepadaku, \"Maka aku gerakkan keduanya bagimu sebagaimana Rasulullah shallallahu 'alaihi wasallam menggerakkan keduanya.\" Sa'id berkata, \"Dan aku menggerakkan keduanya sebagaimana Ibnu Abbas menggerakkan keduanya, \" maka ia gerakkan kedua bibirnya sehingga Allah menurunkan ayat: '(Jangan engkau gerakkan lisanmu untuk membacanya agar kamu tergesa-gesa, sebab Kewajiban Kamilah yang mengumpulkannya dan membacakannya) ' (Qs. Al Qiyamah: 16-17). Ibn Abbas berkata, 'Mengumpulkan yang dimaksud adalah, mengumpulkan di dadamu, lantas kamu membacanya: '(Maka jika kami telah membacanya, maka ikutilah bacaannya) ' (Qs. Al Qiyamah: 18). Ibn 'Abbas berkata, 'Maka dengar dia baik-baik dan diamlah, kemudian Kami berkewajiban agar kamu mampu membacanya.\" Ibn Abbas berkata, \"Jika Jibril menemui Rasulullah shallallahu 'alaihi wasallam, maka beliau mendengarnya baik-baik, dan jika Jibril telah pulang, maka beliau membacanya sebagaimana Jibril membacakannya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 7525,
			"arabicnumber": 7525,
			"text": "Telah menceritakan kepadaku ['Amru bin Zurarah] dari [Husyaim] telah mengabarkan kepada kami [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibn Abbas] radliyallahu'anhuma tentang firman Allah Ta'ala: '(Jangan kamu membacanya secara lantang dalam shalatmu, dan jangan pula secara lirih) ' (Qs. Al Isra': ayat 110), Ibn Abbas berkata, \"Ayat ini diturunkan saat Rasulullah shallallahu 'alaihi wasallam masih sembunyi-sembunyi di Makkah, jika shalat bersama sahabat-sahabatnya, beliau mengeraskan bacaan Al Qur'annya, sehingga jika kaum musyrikin mendengarnya, mereka mencaci Al Qur'an, Dzat yang menurunkannya dan malaikat yang membawanya. Maka Allah menegur nabi-Nya shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam dengan ayat: '(Jangan kamu membacanya secara lantang dalam shalatmu) ' (Qs. Al Isra': ayat 110), yakni dengan bacaanmu, sehingga saat orang-orang Musyrik mendengar mereka akan mencela Al Qur'an, '(dan jangan pula secara lirih), yaitu kepada para sahabatmu, sehingga engkau tidak bisa menjadikan mereka mendengar, (Carilah jalan tengah antara keduanya) ', (Qs. Al Isra: ayat 110)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 7526,
			"arabicnumber": 7526,
			"text": "Telah menceritakan kepada kami [Ubaid bin Ismail] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [Ayahnya] dari [Aisyah] radliyallahu'anha, ia berkata, \"Ayat ini: '(Janganlah kamu menyaringkan bacaanmu ketika shalatmu dan jangan pula membacanya terlalu lirih) ', (Qs. Al Isra`: Ayat 110), diturunkan berkenaan dengan doa",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 7527,
			"arabicnumber": 7527,
			"text": "Telah menceritakan kepada kami [Ishaq] telah menceritakan kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Ibn Juraij] Telah mengabarkan kepada kami [Ibn Syihab] dari [Abu Salamah] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk golongan kami orang yang tidak melagukan Al Qur'an, \" sementara yang lain menambahkan, 'dan mengeraskannya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 7528,
			"arabicnumber": 7528,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh iri kecuali dalam dua hal; seseorang yang Allah beri Al Qur'an, kemudian ia membacanya sepanjang siang dan malam. Lalu orang yang iri itu berkata 'Kalaulah aku diberi kepandaian seperti orang itu, niscaya kulakukan sepertinya.' Dan seseorang yang diberi harta, lantas dia membelanjakannya dalam haknya. Lalu orang yang iri itu berkata, 'Kalulah aku diberi harta si fulan, niscaya kulakukan seperti yang dilakukannya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 7529,
			"arabicnumber": 7529,
			"text": "Telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] [Azzuhri] berkata dari [Salim] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak boleh iri kecuali dalam dua hal; seorang laki-laki yang Allah beri Al Qur'an, lantas ia membacanya di sepanjang malam dan sepanjang siang. Dan seorang laki-laki yang Allah beri harta, lantas ia membelanjakannya sepanjang malam dan sepanjang siang.\" Ali bin Abdullah berkata, \"Aku mendengar Sufyan berkali-kali, namun aku tidak mendengar ia menyebutkan hadits (dengan lafad akhbartu (aku mengabarkan), tetapi dengan lafad 'An (dari). Dan ini adalah hadits yang paling shahih dari yang ia punya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 7530,
			"arabicnumber": 7530,
			"text": "Telah menceritakan kepada kami [Al Fadll bin Ya'qub] telah menceritakan kepada kami ['Abdullah bin Ja'far Ar Raqqi] telah menceritakan kepada kami [Al Mu'tamir bin Sulaiman] telah menceritakan kepada kami [Sa'id bin Ubaidullah Ats Tsaqafi] telah menceritakan kepada kami [Bakar bin Abdullah Al Muzani], dan [Ziyad bin Jubair bin Hayyah] dari [Jubair bin Hayyah], [Mughirah] berkata, \"Nabi shallallahu 'alaihi wasallam telah mengabarkan kepada kami dari risalah Rabb kami, bahwa siapa saja dari kami yang terbunuh, maka ia akan menuju surga",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 7531,
			"arabicnumber": 7531,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ismail] dari [Asy Sya'bi] dari [Masruq] dari [Aisyah] radliyallahu'anhuma, ia berkata, \"Siapa saja yang menceritakan kepadamu bahwa Muhammad shallallahu 'alaihi wasallam menyembunyikan sesuatusedang [Muhammad] berkata, telah menceritakan kepada kami [Abu Amir Al 'Aqadi] telah menceritakan kepada kami [Syu'bah] dari [Ismail bin Abu Khalid] dari [Asy Sya'bi] dari [Masruq] dari ['Aisyah] berkata, \"Siapa saja yang menceritakan kepadamu bahwa Nabi shallallahu 'alaihi wasallam menyembunyikan sesuatu dari wahyu, maka janganlah kamu mempercayainya, sebab Allah Ta'ala berfirman: '(Wahai rasul, sampaikan yang diturunkan kepadamu dari Tuhanmu, jika kamu tidak mengerjakan lantas tidak kau sampaikan risalah.) ' (Qs. Al Maidah: 67)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 7532,
			"arabicnumber": 7532,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Wail] dari ['Amru bin Syurahbil] berkata, [Abdullah] berkata, \"Seorang laki-laki berkata, 'Wahai Rasulullah, dosa apakah yang terbesar di sisi Allah? ' Nabi menjawab: 'Engkau menjadikan tandingan bagi Allah, padahal Dialah yang menciptamu.' Laki-laki tersebut bertanya lagi, 'Lantas apa lagi? ' Nabi menjawab: 'Engkau bunuh anakmu karena khawatir makan bersamamu.' Laki-laki itu bertanya lagi, 'Lantas apa? ' Nabi menjawab: 'Engkau berzina dengan wanita tetanggamu.' Lantas Allah menurunkan ayat yang membenarkannya: '(Dan orang-orang yang tidak menyeru Tuhan lain disamping menyeru Allah, dan tidak membunuh jiwa yang Allah haramkan selain dengan alasan yang benar, dan tidak berzina, dan barangsiapa melakukan yang demikian ia akan memperoleh dosa dan akan dilipat gandakan siksa baginya) '. (Qs. Al Furqan: 68-69)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 7533,
			"arabicnumber": 7533,
			"text": "Telah menceritakan kepada kami ['Abdan] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus] dari [Azzuhri] telah mengabarkan kepadaku [Salim] dari [Ibn Umar] radliyallahu'anhuma, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Keberadaan kalian di antara umat-umat terdahulu seperti permisalan antara antara shalat 'ashar hingga matahari terbenam. Pemeluk taurat diberi taurat dan mereka mengamalkannya hingga pertengahan siang, kemudian mereka tidak bisa lagi mengamalknnya sehingga diberi satu qirath. Kemudian pemeluk injil diberi injil dan mereka mengamalkannya hingga shalat 'ashar didirikan lantas mereka tidak bisa lagi mengamalkannya, dan mereka diberi satu qirath. Kemudian kalian diberi Al Qur'an dan kalian mengamalkannya hingga matahari terbenam, lantas kalian diberi dua qirath dua qirath. Orang-orang ahli kitab pun protes, 'Mereka (kaum muslimin) lebih sedikit bekerja daripada kami namun mengapa mereka lebih banyak pahalanya? ' Allah menjawab, 'Namun apakah berarti Aku menzhalimi hak kalian? ' Mereka menjawab, 'Tidak.' Allah kemudian firman-Nya: \"Itulah keutamaan-Ku yang Aku berikan kepada siapa yang Aku kehendaki",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 7534,
			"arabicnumber": 7534,
			"text": "Telah menceritakan kepadaku [Sulaiman] telah menceritakan kepada kami [Syu'bah] dari [Al Walid] (dalam jalur lain disebutkan) telah menceritakan kepadaku [Abbad bin Ya'qub Al Asadi] telah mengabarkan kepada kami [Abbad bin Al 'Awwam] dari [Asy Syaibani] dari [Al Walid bin 'Aizar] dari [Abu 'Amru dan Asy Syaibani] dari [Ibn Mas'ud] radliallahu 'anhu, bahwa seorang laki-laki pernah bertanya Nabi shallallahu 'alaihi wasallam, amalan apa yang paling utama? ' Nabi menjawab: \"Shalat tepat pada waktunya, berbakti kepada kedua orang tua, dan jihad fi sabilillah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 7535,
			"arabicnumber": 7535,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Jarir bin Hazim] dari [Al Hasan] telah menceritakan kepada kami ['Amru bin Taghlib] berkata, \"Nabi shallallahu 'alaihi wasallam diberi sebuah harta, lantas beliau berikan kepada sebagian sahabatnya dan tidak beliau berikan kepada sahabat yang lain. Kemudian sampailah berita kepada beliau bahwa orang-orang mencela sikap beliau, maka antas beliau pun bersabda: \"Sungguh, ada orang yang kuberi dan ada yang tidak kuberi, namun yang tidak aku beri lebih aku sukai daripada yang aku beri, beberapa orang aku beri karena hati mereka masih ada keluh kesah dan ketakutan, dan beberapa orang aku percayakan kepada kecukupan dan kebaikan yang telah Allah jadikan pada hati mereka, diantara mereka ialah Amru bin Taghlib.\" Lantas 'Amru berkata, 'Aku tak ingin lagi unta-unta merah setelah mengetahui kalimat Rasulullah shallallahu 'alaihi wasallam itu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 7536,
			"arabicnumber": 7536,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 7537,
			"arabicnumber": 7537,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 7538,
			"arabicnumber": 7538,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Muhammad bin Ziyad] berkata, aku mendengar [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, yang beliau riwayatkan dari Rabb kalian: \"Setiap amalan adalah kaffarat dosa, sedang puasa adalah bagi-Ku dan Aku lah yang akan memberinya pahala. Sungguh, bau mulut orang yang berpuasa jauh lebih wangi di sisi Allah daripada minyak kesturi",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 7539,
			"arabicnumber": 7539,
			"text": "Telah menceritakan kepada kami [Hafs bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Qatadah]. (dalam jalur lain disebutkan) [Khalifah] berkata kepada kami; telah menceritakan kepada kami [Yazid bin Zurai'] dari [Sa'id] dari [Qatadah] dari [Abu 'Aliyah] dari [Ibn 'Abbas] radliyallahu'anhuma, dari Nabi shallallahu 'alaihi wasallam yang beliau riwayatkan dari Rabbnya, Allah berfirman: \"Tak pantas seorang hamba berkata bahwa dirinya lebih baik daripada Yunus bin Mata dan ia nisbatkan dirinya kepada ayahnya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 7540,
			"arabicnumber": 7540,
			"text": "Telah menceritakan kepada kami [Ahmad bin Abu Suraij] telah mengabarkan kepada kami [Syababah] telah menceritakan kepada kami [Syu'bah] dari [Mu'awiyah bin Qurrah] dari ['Abdullah bin Mughaffal Al Muzanni] berkata, \"Pernah aku melihat Rasulullah shallallahu 'alaihi wasallam pada hari pembebasan Makkah di atas untanya membaca surat al Fath, atau sebagian dari surat al Fath.\" Abdullah bin Mughaffal berkata, \"Lantas beliau mengulang-ulang suaranya dan mengeraskannya.\" Kemudian Mu'awiyah membaca dengan menirukan bacaan Abdullah bin Mughaffal seraya berkata, \"Kalaulah manusia tidak berkumpul kepada kalian, niscaya aku mengulang-ulang bacaan dan mengeraskannya sebagaimana Ibnu Mughaffal mengulang-ulang dan mengeraskan bacaan ketika menirukan nabi shallallahu 'alaihi wasallam.\" Maka aku katakana kepada Mu'awiyah, \"Bagaimana beliau mengulang-ulang dan mengeraskan bacaannya?\" Mu'awiyah menjawab, \"Dengan mengucapkan AAA (dengan bacaan panjang enam harakat), AAA (dengan bacaan panjang enam harakat), AAA (dengan bacaan panjang enam harakat), beliau ucapkan tiga kali",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 7541,
			"arabicnumber": 7541,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Ali bin Mubarak] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] berkata, \"Ahli kitab membaca Taurat dengan bahasa Ibrani, dan mereka menafsirkannya dengan bahasa arab untuk pemeluk Islam.\" Spontan Rasulullah Sallallahu'alaihiwasallam bersabda: \"Jangan kalian membenarkan ahli kitab dan jangan pula mendustakan mereka, katakan saja: 'Kami beriman kepada Allah dan apa yang diturunkan",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 7542,
			"arabicnumber": 7542,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 7543,
			"arabicnumber": 7543,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Ismail] dari [Ayyub] dari [Nafi'] dari [Ibn Umar] radliyallahu'anhuma berkata, \"Seorang laki-laki dan wanita Yahudi yang berzina didatangkan kepada nabi shallallahu 'alaihi wasallam, Nabi lalu bertanya kepada si Yahudi: 'Hukuman apa biasa kalian lakukan terhadap keduanya? ' Mereka menjawab, 'Kami biasanya menghukum mereka dengan menghitami wajah keduanya dan menghinakannya.' Lantas nabi bersabda (dengan mengutip ayat): '(Maka datangkanlah Taurat dan bacalah, jika kalian orang-orang yang benar) ', (Qs. Ali 'Imran: 93), lantas mereka datang dan mereka katakan kepada seseorang yang mereka percayai, 'Hai A'war bacalah! Lantas A'war membaca hingga sampai ayat (yang berkenaan hukum perzinaan), dengan terburu-buru ia menutupi dengan tangannya, maka Nabi menegur: 'Hai, angkatlah tanganmu! ' Maka ia angkat tangannya. Dan ternyata yang ia tutupi adalah ayat rajam, lantas A'war berkata, 'Hai Muhammad, kedua orang itu wajib dirajam, hanya kami merahasiakannya di antara kami.' Maka Nabi perintahkan agar keduanya dirajam, dan kemudian keduanya pun dirajam. Sungguh, aku lihat yang laki-laki membungkukkan badannya ke arah wanita untuk mencegahnya agar tidak terkena batu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 7544,
			"arabicnumber": 7544,
			"text": "Telah menceritakan kepadaku [Ibrahim bin Hamzah] telah menceritakan kepadaku [Ibn Abu Hazim] dari [Yazid] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Abu Hurairah], bahwa ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Allah tidak pernah mengijinkan sesuatu sebagaimana ijin-Nya terhadap nabi-Nya untuk memperindah suara Al Qur'an dan menyaringkannya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 7545,
			"arabicnumber": 7545,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Yunus] dari [Ibn Syihab] telah mengabarkan kepadaku ['Urwah bin Zubair] dan [Sa'id bin Musayyab] dan [Alqamah bin waqqash] dan ['Ubaidullah bin Abdullah] dari hadis ['Aisyah] ketika penyebar berita bohong mengisukan ia selingkuh, dan masing-masing menceritakan kepadaku sejumlah hadis. 'Aisyah berkata, \"Aku berbaring di atas kasurku, dan ketika itu aku tahu bahwa aku bersih (dari tuduhan selingkuh), Allah telah membersihkan tuduhan tersebut. Namun demi Allah, aku tak punya prasangka jika Allah hingga menurunkan wahyu yang selalu dibaca tentang masalahku, padahal masalahku terhadap diriku lebih remeh daripada Allah berfirman tentangku dengan ayat yang selalu dibaca. Allah lalu menurunkan ayat: '(Sesungguhnya orang-orang yang membawa berita bohong adalah dari kalian sendiri) ', (Qs. An Nuur: 11-21)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 7546,
			"arabicnumber": 7546,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Mis'ar] dari ['Adi bin Tsabit] seingatku Ia berkata, \"Pernah aku mendengar [Al Bara'] berkata; saya pernah mendengar Nabi shallallahu 'alaihi wasallam saat shalat Isya membaca 'WATTIINI WAZZAITUUNA (surat At Tiin) '. Dan belum pernah kudengar seorang pun yang lebih indah suaranya, atau bacaannya daripada beliau",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 7547,
			"arabicnumber": 7547,
			"text": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibn 'Abbas] radliyallahu'anhuma, ia berkata, \"Nabi Shallalahu'alaihiwasllam sembunyi-sembunyi di Makkah, namun beliau mengeraskan suara bacaan, saat orang-orang musyrik mendengar (suara bacaan beliau), mereka mencaci Al Qur'an dan orang yang membawanya. Maka Allah Azza wa Jalla pun menurunkan ayat kepada nabi-Nya: '(Dan janganlah engkau menyaringkan bacaan shalatmu dan jangan pula melirihkannya) ', (Qs. Al Isra': 110)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 7548,
			"arabicnumber": 7548,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari ['Abdurrahman bin Abdullah bin Abdurrahman bin Abu Sha'sha'ah] dari [ayahnya] bahwa ia mengabarkan kepadanya, bahwa [Abu Sa'id Al Khudzri] radliyallahu'anhu berkata kepadanya, \"Aku lihat kamu hobi menggembala kambing dan alam pedusunan, jika engkau berada di tengah-tengah kambing gembalaanmu, lalu engkau mengumandangkan adzan (shalat), maka keraskanlah suaramu. Sebab tidaklah jin, manusia, atau sesuatu yang mendengar suara mu`adzin kecuali mereka akan menjadi saksi baginya pada hari kiamat.\" Abu Sa'id berkata, \"Aku mendengarnya dari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 7549,
			"arabicnumber": 7549,
			"text": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Ibunya] dari ['Aisyah] berkata, \"Pernah Nabi shallallahu 'alaihi wasallam membaca Al Qur'an sedang kepalanya di pahaku, padahal aku sedang dalam keadaan haid",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 7550,
			"arabicnumber": 7550,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibn Syihab] telah menceritakan kepadaku ['Urwah] bahwa [Miswar bin Makhramah] dan [Abdurrahman bin Abdul Qari] keduanya menceritakan kepadanya, bahwa ia mendengar [Umar bin Khattab] berkata, \"Aku mendengar Hisyam bin Hakim membaca surat al Furqaan semasa Rasulullah shallallahu 'alaihi wasallam masih hidup, dan aku menikmati bacaannya. Ternyata dia membaca dengan dialek yang berbeda-beda yang Rasulullah shallallahu 'alaihi wasallam belum pernah membacakannya kepadaku sehingga hampir saja aku menarik kepalanya ketika shalat. Namun aku berusaha menahan kesabaranku hingga ia mengucapkan salam, lantas aku mengikatnya dengan pakaiannya dan aku tanyakan, 'Siapa yang mula-mula membacakan surat Al Qur'an kepadamu yang aku dengar engkau membacanya? ' Ia menjawab, 'Rasulullah shallallahu 'alaihi wasallam yang membacakannya kepadaku! Aku lalu berkata, 'Engkau dusta, sebab rasul membacakan kepadaku tidak seperti yang engkau baca.' Maka aku bawa Hisyam bin hakim kepada Rasulullah shallallahu 'alaihi wasallam dan aku laporkan, 'Aku telah mendengar orang ini membaca surat Al Qur'an tidak dengan dialek seperti yang engkau bacakan kepadaku.' Kemudian Rasulullah berkata: 'Lepaskan dia, bacalah ya Hisyam! ' Lantas Hisyam membaca bacaan yang sebelumnya aku mendengarnya, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: 'Begitulah surat itu diturunkan! ' Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: 'Bacalah wahai Umar! ' Aku pun membaca sebagaimana yang beliau bacakan kepadaku, dan beliau juga berkomentar 'Begitulah surat Al Qur'an diturunkan, sesungguhnya surat Al Qur'an ini diturunkan dengan tujuh dialek, maka bacalah apa yang mudah bagimu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 7551,
			"arabicnumber": 7551,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits], [Yazid] berkata; telah menceritakan kepadaku [Mutharrif bin Abdullah] dari [Imran] ia berkata, \"Aku bertanya, 'Lalu untuk apa orang-orang beramal? ' Beliau menjawab: 'Setiap orang akan dimudahkan (menuju jalan) penciptaannya",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 7552,
			"arabicnumber": 7552,
			"text": "Telah menceritakan kepadaku [Muhammad bin Basyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dan [Al A'masy] keduanya mendengar [Sa'd bin Ubaidah] dari [Abu Abdurrahman] dari [Ali] radliyallahu'anhu, dari Nabi shallallahu 'alaihi wasallam, bahwa suatu kali beliau menghadiri jenazah, kemudian beliau ambil dahan dan beliau pukulkan ke tanah secara ringan sambil beliau sabdakan: 'Tidaklah salah seorang di antara kalian melainkan telah ditetapkan tempat tinggalnya di neraka atau di surga.' Para sahabat bertanya, 'Kalau begitu, tidak sebaiknyakah kita bertawakkal saja? ' Nabi menjawab: 'Beramallah kalian, sebab masing-masing telah dimudahkan, dan beliau mengutip ayat: '(Adapun orang yang memberi hartanya dan bertakwa) ', (Qs. Al Lail: 5)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 7553,
			"arabicnumber": 7553,
			"text": "[Khalifah bin Khayyath] berkata kepadaku, telah menceritakan kepada kami [Mu'tamir] aku mendengar [Ayahku] dari [Qatadah] dari [Abu Rafi'] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Dikala Allah menetapkan penciptaan, Dia menulis catatan di sisi-Nya 'Rahmat-Ku lebih mendominasi, atau beliau mengatakan, 'lebih mendahului kemurkaan-Ku, dan itu terjadi di atas 'arsy",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 7554,
			"arabicnumber": 7554,
			"text": "Telah menceritakan kepadaku [Muhammad bin Abu Ghalib] telah menceritakan kepada kami [Muhammad bin Ismail] telah menceritakan kepada kami [Mu'tamir] aku mendengar [ayahku] berkata, telah menceritakan kepada kami [Qatadah] bahwa [Abu Rafi'] menceritakan kepadanya, ia mendengar [Abu Hurairah] radliyallahu'anhu berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menetapkan satu ketetapan sebelum mencipta penciptaan 'rahmat-Ku lebih mendahului kemurkaan-Ku, dan itu tercatat di sisi-Nya di atas 'arsy",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 7555,
			"arabicnumber": 7555,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abdul Wahhab] telah menceritakan kepada kami ['Abdul Wahhab] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah], dan [Al Qasim At Tamimi] dari [Zahdam] ia berkata, \"Antara penduduk Jurum dan orang-orang Asy'ari terdapat kecintaan dan persaudaraan. Ketika itu kami berada bersama [Abu Musa] Al Asy'ari, lantas seporsi hidangan didekatkan kepadanya yang di antaranya ada daging ayam. Sementara di sisi Abu Musa ada seorang laki-laki dari bani Taimullah - seorang mawali (bangsa non arab) -. Abu Musa pun mengundangnya.\" Zahdam berkata, \"Kulihat laki-laki dari bani Taimullah itu menyantap makanan yang kuanggap jijik sehingga saya bersumpah untuk tidak memakannya. Maka Abu Musa berkata, 'Hei, datanglah kemari, saya akan sampaikan kepada kalian sebuah hadits kepadamu! Sungguh akan saya ceritakan kepadamu tentang sumpahmu itu. Dahulu aku menemui nabi shallallahu 'alaihi wasallam bersama beberapa orang Asy'ari dengan harapan beliau bisa mengangkut kami dengan kendaraan, namun beliau bersumpah: 'Demi Allah, saya tidak akan mengangkut kalian, dan memang saya tidak punya kendaraan untuk mengangkut kalian.' Ternyata nabi kemudian memperoleh rampasan unta dan menanyakan kami dengan berujar: 'Mana orang-orang Asy'ari tadi? ' Beliau perintahkan agar kami diberi sekitar lima dzaud (satu dzaud antara tiga hingga sepuluh) unta yang putih punggungnya, kemudian kami pun berangkat. Dalam keberangkatan, kami berkata, 'Heihapa yang kita perbuat ini? Kita telah tahu bahwa Rasulullah shallallahu 'alaihi wasallam telah bersumpah untuk tidak mengangkut kita yang ketika itu beliau tidak mempunyai kendaraan untuk mengangkut kita, namun sekarang beliau menyediakan kendaraan untuk kita. Rupanya Rasulullah shallallahu 'alaihi wasallam lalai terhadap sumpahnya atas kita, demi Allah, kalau demikian, kita tak bakalan aman! Kami pun pulang dan kami temui beliau dan kami utarakan uneg-uneg kami. Beliau lalu bersabda: 'Bukan saya yang menyediakan kendaraan untuk kalian, namun Allah sematalah yang menyediakan kendaraan untuk mengangkut kalian. Demi Allah, tidaklah saya bersumpah kemudian aku melihat yang lebih baik dari sumpah tersebut, kecuali aku akan melakukan yang lebih baik dan kubayar kaffarat sumpahku",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 7556,
			"arabicnumber": 7556,
			"text": "Telah menceritakan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Qurrah bin Khalid] telah menceritakan kepada kami [Abu Jamrah Adl Dluba'i] saya mengajukan suatu pertanyaan kepada [Ibn Abbas] lalu ia berkata, \"Pernah serombongan utusan Abdul Qais menemui Rasulullah shallallahu 'alaihi wasallam dan berujar, 'Antara kami dan engkau ada orang-orang musyrik dari Mudlar, dan kami tidak bisa menjalin hubungan denganmu selain di bulan-bulan haram, maka perintahkanlah kami dengan hal-hal yang penting saja yang sekiranya kami lakukan maka kami masuk surga, dan kami bisa mengajak generasi kami kepadanya.\" Nabi menjawab: \"Aku perintahkan kalian empat hal dan aku larang kalian empat hal. Aku perintahkan kalian untuk beriman kepada Allah, tahukah kalian keimanan kepada Allah? Yaitu persaksian bahwa tiada sesembahan yang hak selain Allah, mendirikan shalat, membayar zakat, dan kalian berikan seperlima bagian ghanimah. Dan aku larang kalian empat hal, agar kalian tidak meminum dalam ad-Dubba', an-Naqir, azh-Zhuruf al-Muzaffat, dan al-Hantamah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 7557,
			"arabicnumber": 7557,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Al Qasim bin Muhammad] dari ['Aisyah] radliyallahu'anhuma, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Para pembuat gambar disiksa dihari kiamat dan dikatakan, 'Cobalah hidupkan semua yang kalian cipta",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 7558,
			"arabicnumber": 7558,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibn Umar] radliyallahu'anhuma, ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Para pembuat gambar ini disiksa pada hari kiamat, lalu dikatakan, 'Cobalah hidupkan semua yang kalian cipta",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 7559,
			"arabicnumber": 7559,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala'] telah menceritakan kepada kami [Ibn Fudlail] dari ['Umarah] dari [Abu Zur'ah] ia mendengar [Abu Hurairah] radliyallahu'anhu berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla berfirman, 'Siapa yang lebih zhalim daripada orang yang mencipta seperti ciptaan-Ku, hendaklah ia cipta biji sawi, atau biji tepung, atau biji gandum",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 7560,
			"arabicnumber": 7560,
			"text": "Telah menceritakan kepada kami [Hudbah bin Khalid] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] telah menceritakan kepada kami [Anas] dari [Abu Musa] radliyallahu'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Perumpamaan orang mukmin yang membaca Al Qur'an seperti utrujah, rasanya enak dan baunya wangi, dan perumpamaan orang mukmin yang tidak membaca Al Qur'an seperti kurma, rasanya enak namun tidak berbau, dan perumpaman orang durhaka yang membaca Al Qur'an seperti buah raihana, baunya wangi namun rasanya pahit, dan perumpamaan orang durhaka yang tidak membaca Al Qur'an seperti buah hanzhalah, rasanya pahit dan tidak berbau",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 7561,
			"arabicnumber": 7561,
			"text": "Telah menceritakan kepada kami [Ali] telah menceritakan kepada kami [Hisyam] Telah mengabarkan kepada kami [Ma'mar] dari [Azzuhri]. (dalam jalur lain disebutkan) telah menceritakan kepadaku [Ahmad bin Shalih] telah menceritakan kepada kami ['Anbasah] telah menceritakan kepada kami [Yunus] dari [Ibn Syihab] telah mengabarkan kepadaku [Yahya bin Urwah bin Zubair] bahwa dia mendengar [Urwah bin Az Zubair], [Aisyah] radliyallahu'anhuma berkata, \"Beberapa orang bertanya Nabi shallallahu 'alaihi wasallam tentang dukun, beliau menjawab: \"Mereka tidak ada apa-apanya.\" Para sahabat berkata lagi, \"Wahai Rasulullah, namun terkadang mereka berbicara sesuatu dan menjadi benar.\" Nabi shallallahu 'alaihi wasallam kemudian berkata: \"Ucapan yang benar itu adalah hasil curian jin, lalu oleh jin diperdengarkan ke telinga wali-walinya sebagaimana ayam betina bersuara, lantas mereka tambahai dengan seratus kebohongan",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 7562,
			"arabicnumber": 7562,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Mahdi bin maimun] aku mendengar [Muhammad bin Sirin] menceritakan dari [Ma'bad bin Sirin] dari [Abu Sa'id Al Khudzri] radliyallahu'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan muncul beberapa orang dari arah timur, mereka membaca Al Qur'an namun tidak lebih dari kerongkongan mereka (tidak meresap dalam hati), mereka keluar dari agama sebagaimana anak panah keluar dari busur, dan mereka tidak akan kembali hingga anak panah kembali ke tali busur.\" Lalu ditanya, \"Apa tanda mereka?\" Beliau menjawab: \"Ciri mereka adalah gundul.\" Atau, beliau mengatakan: \"Rambutnya dipangkas habis",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 7563,
			"arabicnumber": 7563,
			"text": "Telah menceritakan kepadaku [Ahmad bin Isykab] telah menceritakan kepada kami [Muhammad bin Fudlail] dari ['Umarah bin Alqa'qa'] dari [Abu Zur'ah] dari [Abu Hurairah] radliyallahu'anhu, ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Ada dua kalimat yang disukai Ar Rahman, ringan di lisan dan berat di timbangan, yaitu SUBHANALLAH WABIHAMDIHI dan SUBHAANALLAAHIL'AZHIIM",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 188
			}
		}
	]
}