{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"20": "The Chapters on Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2533,
			"arabicnumber": 2533,
			"text": "ابوامامہ بن سہل بن حنیف رضی اللہ عنہ سے روایت ہے کہ عثمان بن عفان رضی اللہ عنہ نے ان ( بلوائیوں ) کو جھانک کر دیکھا، اور انہیں اپنے قتل کی باتیں کرتے سنا تو فرمایا: یہ لوگ مجھے قتل کی دھمکی دے رہے ہیں، آخر یہ میرا قتل کیوں کریں گے؟ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: کسی مسلمان کا قتل تین باتوں میں سے کسی ایک کے بغیر حلال نہیں: ایک ایسا شخص جو شادی شدہ ہو اور زنا کا ارتکاب کرے، تو اسے رجم کیا جائے گا، دوسرا وہ شخص جو کسی مسلمان کو ناحق قتل کر دے، تیسرا وہ شخص جو اسلام قبول کرنے کے بعد اس سے پھر جائے ( مرتد ہو جائے ) ، اللہ کی قسم میں نے نہ کبھی جاہلیت میں زنا کیا، اور نہ اسلام میں، نہ میں نے کسی مسلمان کو قتل کیا، اور نہ ہی اسلام لانے کے بعد ارتداد کا شکار ہوا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2534,
			"arabicnumber": 2534,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کسی مسلمان کا جو صرف اللہ کے معبود برحق ہونے، اور میرے اللہ کا رسول ہونے کی گواہی دیتا ہو، خون کرنا حلال نہیں، البتہ تین باتوں میں سے کوئی ایک بات ہو تو حلال ہے: اگر اس نے کسی کی جان ناحق لی ہو، یا شادی شدہ ہونے کے باوجود زنا کا مرتکب ہوا ہو، یا اپنے دین ( اسلام ) کو چھوڑ کر مسلمانوں کی جماعت سے الگ ہو گیا ہو ( یعنی مرتد ہو گیا ہو ) ، ( تو ان تین صورتوں میں اس کا خون حلال ہے ) ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2535,
			"arabicnumber": 2535,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اپنے دین ( اسلام ) کو بدل ڈالے اسے قتل کر دو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2536,
			"arabicnumber": 2536,
			"text": "معاویہ بن حیدۃ قشیری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کسی ایسے مشرک کا کوئی عمل قبول نہیں کرے گا جو اسلام لانے کے بعد شرک کرے، الا یہ کہ وہ پھر مشرکین کو چھوڑ کر مسلمانوں سے مل جائے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2537,
			"arabicnumber": 2537,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کی حدود میں سے کسی ایک حد کا نافذ کرنا اللہ تعالیٰ کی زمین پر چالیس رات بارش ہونے سے بہتر ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2538,
			"arabicnumber": 2538,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کوئی ایک حد جو دنیا میں نافذ ہو، اہل زمین کے لیے یہ اس سے کہیں بہتر ہے کہ چالیس دن تک بارش ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2539,
			"arabicnumber": 2539,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو قرآن کی کسی آیت کا انکار کرے، اس کی گردن مارنا حلال ہے، اور جو یہ کہے کہ اللہ کے سوا کوئی معبود برحق نہیں، وہ تنہا ہے اس کا کوئی شریک نہیں، اور محمد اس کے بندے اور رسول ہیں، اس پر زیادتی کرنے کا اب کوئی راستہ باقی نہیں، مگر جب وہ کوئی ایسا کام کر گزرے جس پر حد ہو تو اس پر حد جاری کی جائے گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2540,
			"arabicnumber": 2540,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کی حدود کو نافذ کرو، خواہ کوئی قریبی ہو یا دور کا، اور اللہ تعالیٰ کے معاملے میں کسی ملامت کرنے والے کی ملامت کی پروا نہ کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2541,
			"arabicnumber": 2541,
			"text": "عطیہ قرظی رضی اللہ عنہ کہتے ہیں کہ ہم لوگ غزوہ قریظہ کے دن ( جب بنی قریظہ کے تمام یہودی قتل کر دیئے گئے ) رسول اللہ صلی اللہ علیہ وسلم کے سامنے پیش کئے گئے تو جس کے زیر ناف بال اگ آئے تھے اسے قتل کر دیا گیا، اور جس کے نہیں اگے تھے اسے ( نابالغ سمجھ کر ) چھوڑ دیا گیا، میں ان لوگوں میں تھا جن کے بال نہیں اگے تھے تو مجھے چھوڑ دیا گیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2542,
			"arabicnumber": 2542,
			"text": "عبدالملک بن عمیر کہتے ہیں کہ میں نے عطیہ قرظی رضی اللہ عنہ کو یہ بھی کہتے سنا: تو اب میں تمہارے درمیان ہوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2543,
			"arabicnumber": 2543,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم کے سامنے غزوہ احد کے دن پیش کیا گیا، اس وقت میری عمر چودہ سال کی تھی، آپ صلی اللہ علیہ وسلم نے مجھے ( غزوہ میں شریک ہونے کی ) اجازت نہیں دی، لیکن جب مجھے آپ کے سامنے غزوہ خندق کے دن پیش کیا گیا، تو آپ صلی اللہ علیہ وسلم نے اجازت دے دی، اس وقت میری عمر پندرہ سال تھی۔ نافع کہتے ہیں کہ یہ حدیث میں نے عمر بن عبدالعزیز سے ان کے عہد خلافت میں بیان کی تو انہوں نے کہا: یہی نابالغ اور بالغ کی حد ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2544,
			"arabicnumber": 2544,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص کسی مسلمان کی پردہ پوشی کرے گا، اللہ تعالیٰ دنیا اور آخرت دونوں میں اس کی پردہ پوشی فرمائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2545,
			"arabicnumber": 2545,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم حدود کو دفع کرو، جہاں تک دفع کرنے کی گنجائش پاؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2546,
			"arabicnumber": 2546,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو اپنے مسلمان بھائی کی پردہ پوشی کرے گا، قیامت کے روز اللہ تعالیٰ اس کی پردہ پوشی فرمائے گا، اور جو اپنے مسلمان بھائی کا کوئی عیب فاش کرے گا، اللہ تعالیٰ اس کا عیب فاش کرے گا، یہاں تک کہ وہ اسے اس کے گھر میں بھی ذلیل کرے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2547,
			"arabicnumber": 2547,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ قبیلہ مخزوم کی ایک عورت کے معاملے میں جس نے چوری کی تھی، قریش کافی فکرمند ہوئے اور کہا: اس کے سلسلے میں رسول اللہ صلی اللہ علیہ وسلم سے کون گفتگو کرے گا؟ لوگوں نے جواب دیا: رسول اللہ صلی اللہ علیہ وسلم کے چہیتے اسامہ بن زید رضی اللہ عنہما کے علاوہ کون اس کی جرات کر سکتا ہے؟ چنانچہ اسامہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے گفتگو کی تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تم اللہ تعالیٰ کی حدود میں سے ایک حد کے بارے میں سفارش کر رہے ہو ؟ پھر آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور خطبہ دیتے ہوئے فرمایا: لوگو! تم سے پہلے کے لوگ اپنی اس روش کی بناء پر ہلاک ہوئے کہ جب کوئی اعلیٰ خاندان کا شخص چوری کرتا تو اسے چھوڑ دیتے اور جب کمزور حال شخص چوری کرتا تو اس پر حد جاری کرتے۔ اللہ کی قسم! اگر محمد کی بیٹی فاطمہ چوری کرتی تو میں اس کا ( بھی ) ہاتھ کاٹ دیتا ۔ محمد بن رمح ( راوی حدیث ) کہتے ہیں کہ میں نے لیث بن سعد کو کہتے سنا: اللہ تعالیٰ نے فاطمہ رضی اللہ عنہا کو چوری کرنے سے محفوظ رکھا اور ہر مسلمان کو ایسا ہی کہنا چاہیئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2548,
			"arabicnumber": 2548,
			"text": "مسعود بن اسود رضی اللہ عنہ کہتے ہیں کہ جب اس عورت ( فاطمہ بنت اسود ) نے رسول اللہ صلی اللہ علیہ وسلم کے گھر سے چادر چرائی تو ہمیں اس کی بڑی فکر ہوئی، وہ قریشی عورت تھی، چنانچہ ہم گفتگو کرنے کے لیے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور ہم نے عرض کیا: ہم اس کے فدیہ میں چالیس اوقیہ ادا کرتے ہیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس عورت کا پاک کر دیا جانا اس کے حق میں بہتر ہے ، جب ہم نے رسول اللہ صلی اللہ علیہ وسلم کی نرم گفتگو سنی تو ( امیدیں لگائے ) اسامہ رضی اللہ عنہ کے پاس آئے اور ان سے کہا: رسول اللہ صلی اللہ علیہ وسلم سے ( اس کے سلسلے میں ) گفتگو کرو، جب رسول اللہ صلی اللہ علیہ وسلم نے یہ دیکھا ( کہ اسامہ سفارش کر رہے ہیں ) تو کھڑے ہو کر خطبہ دیا، اور فرمایا: کیا بات ہے تم باربار مجھ سے اللہ کی حدود میں سے ایک حد کے بارے میں سفارش کر رہے ہو؟ جو اللہ کی ایک باندی پر ثابت ہے، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے، اگر یہ چیز اللہ کے رسول کی بیٹی فاطمہ کے ساتھ پیش آتی، جو اس کے ساتھ پیش آئی ہے تو محمد اس کا بھی ہاتھ کاٹ دیتے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "ابوہریرہ، زید بن خالد اور شبل رضی اللہ عنہم کہتے ہیں کہ ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے تھے کہ ایک شخص آپ کے پاس آیا، اور بولا: میں آپ کو اللہ کی قسم دیتا ہوں، اللہ کی کتاب کے مطابق آپ ہمارا فیصلہ کر دیجئیے، اس کا فریق ( مقابل ) جو اس سے زیادہ سمجھ دار تھا، بولا: آپ ہمارا فیصلہ اللہ کی کتاب کے مطابق فرمائیے لیکن مجھے کچھ کہنے کی اجازت دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: کہو اس نے بیان کیا کہ میرا بیٹا اس آدمی کے یہاں مزدور تھا، اس نے اس کی بیوی سے زنا کر لیا، میں نے اس کی جانب سے سو بکریاں اور ایک نوکر فدیہ میں دے دیا ہے، پھر میں نے اہل علم میں سے کچھ لوگوں سے پوچھا، تو مجھے معلوم ہوا کہ میرے بیٹے کے لیے سو کوڑے اور ایک سال کی جلا وطنی کی سزا ہے، اور اس کی بیوی کے لیے رجم یعنی سنگساری کی سزا ہے، رسول اللہ صلی اللہ علیہ وسلم نے یہ سن کر فرمایا: قسم اس ذات کی جس کے ہاتھ میں میری جان ہے، میں تم دونوں کے درمیان اللہ کی کتاب ( قرآن ) کے مطابق فیصلہ کروں گا، سو بکریاں اور خادم تم واپس لے لو، اور تمہارے بیٹے کے لیے سو کوڑوں اور ایک سال کی جلا وطنی کی سزا ہے، اور اے انیس! کل صبح تم اس کی عورت کے پاس جاؤ اور اگر وہ اقبال جرم کر لے تو اسے رجم کر دو ۱؎۔ حدیث کے راوی ہشام کہتے ہیں: انیس صبح کو اس کے ہاں پہنچے، اس نے اقبال جرم کیا، تو انہوں نے اسے رجم کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2550,
			"arabicnumber": 2550,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( دین کے احکام ) مجھ سے سیکھ لو، اللہ تعالیٰ نے ان کے لیے ( جنہیں زنا کے جرم میں گھروں میں قید رکھنے کا حکم دیا گیا تھا، اور اللہ کے حکم کا انتظار کرنے کے لیے کہا گیا تھا ) راہ نکال دی ہے: کنوارا کنواری کے ساتھ زنا کا مرتکب ہو تو سو کوڑوں اور ایک سال کی جلا وطنی کی سزا ہے، اور شادی شدہ مرد شادی شدہ عورت کے ساتھ زنا کرے ہو تو سو کوڑوں اور رجم کی سزا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2551,
			"arabicnumber": 2551,
			"text": "حبیب بن سالم کہتے ہیں کہ نعمان بن بشیر رضی اللہ عنہ کے پاس ایک ایسا شخص لایا گیا جس نے اپنی بیوی کی لونڈی سے صحبت کر لی تھی، تو نعمان رضی اللہ عنہ نے کہا: میں اس سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کے فیصلے کے مطابق ہی فیصلہ کروں گا، پھر کہا: اگر اس کی عورت نے اسے اس لونڈی کے ساتھ صحبت کرنے کی اجازت دی ہے تو میں اس شخص کو سو کوڑے لگاؤں گا، اور اگر اس نے اجازت نہیں دی ہے تو میں اسے رجم کروں گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2552,
			"arabicnumber": 2552,
			"text": "سلمہ بن محبق رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص لایا گیا اس نے اپنی بیوی کی لونڈی سے صحبت کی تھی، آپ صلی اللہ علیہ وسلم نے اس پر حد نافذ نہیں کی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2553,
			"arabicnumber": 2553,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ عمر بن خطاب رضی اللہ عنہ نے کہا: مجھے اندیشہ ہے کہ جب زمانہ زیادہ گزر جائے گا تو کہنے والا یہ کہے گا کہ میں کتاب اللہ میں رجم ( کا حکم ) نہیں پاتا، اور اس طرح لوگ اللہ تعالیٰ کے ایک فریضے کو ترک کر کے گمراہ ہو جائیں، واضح رہے کہ رجم حق ہے، جب کہ آدمی شادی شدہ ہو گواہی قائم ہو، یا حمل ٹھہر جائے، یا زنا کا اعتراف کر لے، اور میں نے رجم کی یہ آیت پڑھی ہے: «الشيخ والشيخة إذا زنيا فارجموهما البتة» جب بوڑھا مرد اور بوڑھی عورت زنا کریں تو ان دونوں کو ضرور رجم کرو … ۱؎، رسول اللہ صلی اللہ علیہ وسلم نے رجم کیا، اور آپ کے بعد ہم نے بھی رجم کیا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2554,
			"arabicnumber": 2554,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ماعز بن مالک رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، اور کہا: میں نے زنا کیا ہے، آپ صلی اللہ علیہ وسلم نے ان کی طرف سے منہ پھیر لیا، انہوں نے پھر کہا: میں نے زنا کیا ہے، آپ صلی اللہ علیہ وسلم نے پھر منہ پھیر لیا، انہوں نے پھر کہا: میں نے زنا کیا ہے، آپ صلی اللہ علیہ وسلم نے پھر منہ پھیر لیا، انہوں نے پھر کہا: میں نے زنا کیا ہے، آپ صلی اللہ علیہ وسلم نے پھر منہ پھیر لیا یہاں تک کہ چار بار زنا کا اقرار کیا، تو رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ انہیں رجم کر دیا جائے، چنانچہ جب ان پر پتھر پڑے تو وہ پیٹھ پھیر کر بھاگنے لگے، ایک شخص نے انہیں پا لیا، اس کے ہاتھ میں اونٹ کے جبڑے کی ہڈی تھی، اس نے ماعز کو مار کر گرا دیا، پتھر پڑتے وقت ان کے بھاگنے کا تذکرہ جب نبی اکرم صلی اللہ علیہ وسلم سے کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: آخر تم نے انہیں چھوڑ کیوں نہ دیا ؟۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2555,
			"arabicnumber": 2555,
			"text": "عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ ایک عورت نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر زنا کا اعتراف کیا، آپ صلی اللہ علیہ وسلم نے حکم دیا تو اس کے کپڑے باندھ دئیے گئے، پھر اس کو رجم کیا، اس کے بعد اس کی نماز جنازہ پڑھی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2556,
			"arabicnumber": 2556,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک یہودی جوڑے کو رجم کیا، میں بھی اس کو رجم کرنے والوں میں شامل تھا، میں نے دیکھا کہ یہودی مرد یہودیہ کو پتھروں سے بچانے کے لیے آڑے آ جاتا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک یہودی اور ایک یہودیہ کو رجم کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2558,
			"arabicnumber": 2558,
			"text": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کا گزر ایک یہودی کے پاس سے ہوا جس کا منہ کالا کیا گیا تھا اور جس کو کوڑے لگائے گئے تھے، آپ صلی اللہ علیہ وسلم نے ان یہودیوں کو بلایا اور پوچھا: کیا تم لوگ اپنی کتاب توریت میں زانی کی یہی حد پاتے ہو ؟ لوگوں نے عرض کیا: ہاں، پھر آپ صلی اللہ علیہ وسلم نے ان کے عالموں میں سے ایک شخص کو بلایا، اور اس سے پوچھا: میں تمہیں اس اللہ کا واسطہ دے کر کہتا ہوں جس نے موسیٰ پر توراۃ نازل فرمائی: کیا تم اپنی کتاب میں زانی کی حد یہی پاتے ہو ؟ اس نے جواب دیا: نہیں، اور اگر آپ نے مجھے اللہ کی قسم نہ دی ہوتی تو میں آپ کو کبھی نہ بتاتا، ہماری کتاب میں زانی کی حد رجم ہے، لیکن ہمارے معزز لوگوں میں کثرت سے رجم کے واقعات پیش آئے، تو جب ہم کسی معزز آدمی کو زنا کے جرم میں پکڑتے تو اسے چھوڑ دیتے اور اگر پکڑا جانے والا معمولی آدمی ہوتا تو ہم اس پر حد جاری کرتے، پھر ہم نے لوگوں سے کہا کہ آؤ ایسی حد پر اتفاق کریں کہ جو معزز اور معمولی دونوں قسم کے آدمیوں پر ہم یکساں طور پر قائم کر سکیں، چنانچہ ہم نے رجم کی جگہ منہ کالا کرنے اور کوڑے مارنے کی سزا پر اتفاق کر لیا، یہ سن کر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: «اللهم إني أول من أحيا أمرك إذ أماتوه» یعنی اے اللہ! میں پہلا وہ شخص ہوں جس نے تیرے اس حکم کو زندہ کیا ہے جسے ان لوگوں نے مردہ کر دیا تھا ، آپ صلی اللہ علیہ وسلم نے حکم دیا اور وہ یہودی رجم کر دیا گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2559,
			"arabicnumber": 2559,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر میں گواہوں کے بغیر کسی کو رجم کرتا تو فلاں عورت کو کرتا، اس لیے کہ اس کی بات چیت سے اس کی شکل و صورت سے اور جو لوگ اس کے پاس آتے ہیں اس سے اس کا فاحشہ ہونا ظاہر ہو چکا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2560,
			"arabicnumber": 2560,
			"text": "قاسم بن محمد کہتے ہیں کہ ابن عباس رضی اللہ عنہما نے دو لعان کرنے والوں کا تذکرہ کیا، تو ان سے ابن شداد نے پوچھا: کیا یہ وہی عورت تھی جس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا: اگر میں گواہوں کے بغیر کسی کو رجم کرتا تو اس عورت کو کرتا؟ ابن عباس رضی اللہ عنہما نے کہا: وہ تو ایسی عورت تھی جو علانیہ بدکار تھی",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2561,
			"arabicnumber": 2561,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس کو تم پاؤ کہ وہ قوم لوط کا عمل ( اغلام بازی ) کر رہا ہے، تو فاعل اور مفعول دونوں کو قتل کر دو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2562,
			"arabicnumber": 2562,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے قوم لوط کے عمل یعنی اغلام بازی کرنے والوں کے بارے میں فرمایا: اوپر والا ہو کہ نیچے والا، دونوں کو رجم کر دو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2563,
			"arabicnumber": 2563,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مجھے اپنی امت کے بارے میں سب سے زیادہ جس چیز کا خوف ہے وہ قوم لوط کے عمل یعنی اغلام بازی کا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2564,
			"arabicnumber": 2564,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کسی محرم سے جماع کرے اسے قتل کر دو، اور جو کسی جانور سے جماع کرے تو اسے بھی قتل کر دو، اور اس جانور کو بھی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2565,
			"arabicnumber": 2565,
			"text": "ابوہریرہ، زید بن خالد اور شبل رضی اللہ عنہم کہتے ہیں کہ ہم لوگ نبی اکرم صلی اللہ علیہ وسلم کے پاس تھے کہ ایک شخص نے آپ سے اس لونڈی کے بارے میں سوال کیا جس نے شادی شدہ ہونے سے پہلے زنا کیا ہو؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اسے کوڑے مارو، اگر پھر زنا کرے تو پھر کوڑے مارو ، پھر آپ صلی اللہ علیہ وسلم نے تیسری یا چوتھی مرتبہ میں کہا: اسے بیچ دو خواہ وہ بالوں کی ایک رسی کے عوض بکے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2566,
			"arabicnumber": 2566,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب لونڈی زنا کرے تو اسے کوڑے مارو، پھر زنا کرے تو پھر کوڑے مارو، اگر اب بھی زنا کرے تو پھر کوڑے مارو، اس کے بعد اگر زنا کرے تو اسے بیچ دو خواہ ایک «ضفیر» ہی کے بدلے ہو، اور «ضفیر» رسی کو کہتے ہیں",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2567,
			"arabicnumber": 2567,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ جب میری براءت نازل ہوئی تو رسول اللہ صلی اللہ علیہ وسلم منبر پر کھڑے ہوئے اور اس کا تذکرہ کر کے قرآنی آیات کی تلاوت کی، اور جب منبر سے اتر آئے، تو دو مردوں اور ایک عورت کے بارے میں حکم دیا چنانچہ ان کو حد لگائی گئی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2568,
			"arabicnumber": 2568,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اگر کوئی آدمی کسی کو کہے: اے مخنث! تو اسے بیس کوڑے لگاؤ، اور اگر کوئی کسی کو کہے: اے لوطی! تو اسے بیس کوڑے لگاؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2569,
			"arabicnumber": 2569,
			"text": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ جس پر میں حد جاری کروں ( اگر وہ مر جائے ) تو میں اس کی دیت ادا نہیں کروں گا، سوائے شرابی کے، اس لیے کہ رسول اللہ صلی اللہ علیہ وسلم نے اس کی کوئی حد نہیں مقرر فرمائی، بلکہ یہ تو ہماری اپنی مقرر کی ہوئی حد ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2570,
			"arabicnumber": 2570,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم شراب کے جرم میں جوتوں اور چھڑیوں سے مارنے کی سزا دیتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2571,
			"arabicnumber": 2571,
			"text": "حضین بن منذر رقاشی کہتے ہیں کہ جب ولید بن عقبہ کو عثمان رضی اللہ عنہ کے پاس لایا گیا اور لوگوں نے ان کے خلاف گواہی دی، تو عثمان رضی اللہ عنہ نے علی رضی اللہ عنہ سے کہا: اٹھئیے اور اپنے چچا زاد بھائی پر حد جاری کیجئے، چنانچہ علی رضی اللہ عنہ نے ان کو کوڑے مارے اور کہا: رسول اللہ صلی اللہ علیہ وسلم نے چالیس کوڑے لگائے، اور ابوبکر رضی اللہ عنہ نے چالیس کوڑے لگائے، اور عمر رضی اللہ عنہ نے اسی کوڑے لگائے، اور ان میں سے ہر ایک سنت ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2572,
			"arabicnumber": 2572,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب کوئی نشے میں آ جائے تو اسے کوڑے لگاؤ، اور اگر پھر ایسا کرے تو پھر کوڑے مارو، اور پھر بھی ایسا کرے تو پھر کوڑے مارو ، پھر چوتھی بار کے لیے فرمایا: اس کے بعد بھی ایسا کرے تو اس کی گردن اڑا دو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "معاویہ بن ابی سفیان رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب لوگ شراب پئیں تو انہیں کوڑے لگاؤ، پھر پئیں تو کوڑے لگاؤ، اس کے بعد بھی پئیں تب بھی کوڑے لگاؤ، اس کے بعد پئیں تو انہیں قتل کر دو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "سعید بن سعد بن عبادہ کہتے ہیں کہ ہمارے گھروں میں ایک ناقص الخلقت ( لولا لنگڑا ) اور ضعیف و ناتواں شخص تھا، اس سے کسی شر کا اندیشہ نہیں تھا، البتہ ( ایک بار ) وہ گھر کی لونڈیوں میں سے ایک لونڈی کے ساتھ زنا کر رہا تھا، سعد رضی اللہ عنہ اس کے معاملے کو رسول اللہ صلی اللہ علیہ وسلم کے پاس لے کر پہنچے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اسے سو کوڑے مارو ، لوگوں نے عرض کیا: اللہ کے نبی! وہ اس سے کہیں زیادہ کمزور ہے، اگر ہم اسے سو کوڑے ماریں گے تو مر جائے گا، آپ صلی اللہ علیہ وسلم نے فرمایا: اچھا کھجور کا ایک خوشہ لو جس میں سو شاخیں ہوں، اور اس سے ایک بار مار دو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو ہم مسلمانوں پر ہتھیار اٹھائے وہ ہم میں سے نہیں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ الْبَرَّادِ بْنِ يُوسُفَ بْنِ بُرَيْدِ بْنِ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الْأَشْعَرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو ہمارے اوپر ہتھیار اٹھائے وہ ہم میں سے نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو ہم پر ہتھیار اٹھائے وہ ہم میں سے نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ قبیلہ عرینہ کے چند لوگ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں آئے، انہیں مدینہ کی آب و ہوا راس نہ آئی تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا: اگر تم ہمارے اونٹوں کے ریوڑ میں جاؤ، اور ان کا دودھ اور پیشاب پیو تو صحت مند ہو جاؤ گے ۱؎ ان لوگوں نے ایسا ہی کیا، پھر وہ اسلام سے پھر گئے ( مرتد ہو گئے ) اور رسول اللہ صلی اللہ علیہ وسلم کے چرواہے کو قتل کر کے آپ کے اونٹوں کو ہانک لے گئے، یہ دیکھ کر رسول اللہ صلی اللہ علیہ وسلم نے انہیں گرفتار کرنے کے لیے لوگوں کو بھیجا، چنانچہ وہ گرفتار کر کے لائے گئے، تو آپ نے ان کے ہاتھ پیر کاٹ دئیے، ان کی آنکھوں میں لوہے کی گرم سلائی پھیر دی، ۲؎ اور انہیں حرہ ۳؎ میں چھوڑ دیا یہاں تک کہ وہ مر گئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے اونٹوں پر حملہ کر دیا، چنانچہ آپ صلی اللہ علیہ وسلم نے ان کے ہاتھ پیر کاٹ دئیے اور ان کی آنکھیں پھوڑ دیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو اپنا مال بچانے میں مارا جائے تو وہ شہید ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس سے اس کا مال چھینا جائے اور لڑا جائے پھر وہ بھی لڑے اور قتل ہو جائے، تو وہ شہید ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس سے اس کا مال ناجائز طریقے سے لینے کا ارادہ کیا جائے، اور وہ اس کے بچانے میں قتل کر دیا جائے، تو وہ شہید ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: چور پر اللہ تعالیٰ کی لعنت ہو، وہ ایک انڈا چراتا ہے تو اس کا ہاتھ کاٹ دیا جاتا ہے، اور رسی چراتا ہے تو بھی اس کا ہاتھ کاٹ دیا جاتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک ڈھال کی چوری پر ہاتھ کاٹا، اس کی قیمت تین درہم تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "ام المؤمینین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہاتھ اسی وقت کاٹا جائے گا جب ( چرائی گئی چیز کی قیمت ) چوتھائی دینار یا اس سے زیادہ ہو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "سعد رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ڈھال کی قیمت کے برابر میں چور کا ہاتھ کاٹا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "ابن محیریز کہتے ہیں کہ میں نے فضالہ بن عبید سے سوال کیا: ہاتھ کاٹ کر گردن میں ٹکانا کیسا ہے؟ انہوں نے کہا: سنت ہے، رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کا ہاتھ کاٹا، پھر اسے اس کی گردن میں لٹکا دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "ثعلبہ انصاری رضی اللہ عنہ سے روایت ہے کہ عمرو بن سمرہ بن حبیب بن عبدشمس رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، اور کہا: اللہ کے رسول! میں نے بنی فلاں کا اونٹ چرایا ہے، لہٰذا مجھے اس جرم سے پاک کر دیجئیے، نبی اکرم صلی اللہ علیہ وسلم نے ان لوگوں کے پاس کسی کو بھیجا، انہوں نے بتایا کہ ہمارا ایک اونٹ غائب ہو گیا ہے، چنانچہ نبی اکرم صلی اللہ علیہ وسلم نے حکم دیا، اور اس کا ہاتھ کاٹ دیا گیا۔ ثعلبہ رضی اللہ عنہ کہتے ہیں: میں دیکھ رہا تھا جب اس کا ہاتھ کٹ کر گرا تو وہ کہہ رہا تھا: اللہ کا شکر ہے جس نے مجھے تجھ سے پاک کیا، تو چاہتا تھا کہ میرے جسم کو جہنم میں داخل کرے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر غلام چوری کرے تو اسے بیچ دو، خواہ وہ نصف اوقیہ ( بیس درہم ) میں بک سکے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ بیت المال کے لیے مال غنیمت کے پانچویں حصے میں جو غلام ملے تھے ان میں سے ایک غلام نے خمس ( پانچویں حصہ ) میں سے کچھ چرا لیا، یہ معاملہ نبی اکرم صلی اللہ علیہ وسلم کے پاس پیش کیا گیا، آپ صلی اللہ علیہ وسلم نے اس کا ہاتھ نہیں کاٹا اور فرمایا: ( خمس ) اللہ کا مال ہے، ایک نے دوسرے کو چرایا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2591,
			"arabicnumber": 2591,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: خائن، لٹیرے اور چھین کر بھاگنے والے کا ہاتھ نہیں کاٹا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "عبدالرحمٰن بن عوف رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: چھین کر بھاگنے والے کی سزا ہاتھ کاٹنا نہیں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"text": "رافع بن خدیج رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نہ پھل چرانے سے ہاتھ کاٹا جائے گا اور نہ کھجور کا گابھا چرانے سے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلیاللہ علیہ وسلم نے فرمایا: پھل اور کھجور کا گابھا چرانے سے ہاتھ نہیں کاٹا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "صفوان رضی اللہ عنہ سے روایت ہے کہ وہ مسجد میں سو گئے، اور اپنی چادر کو تکیہ بنا لیا، کسی نے ان کے سر کے نیچے سے اسے نکال لیا، وہ چور کو لے کر نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، چنانچہ نبی اکرم صلی اللہ علیہ وسلم نے ہاتھ کاٹے جانے کا حکم دیا، صفوان رضی اللہ عنہ نے کہا: اللہ کے رسول! میرا مقصد یہ نہ تھا، میری چادر اس کے لیے صدقہ ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم نے آخر میرے پاس اسے لانے سے پہلے ایسا کیوں نہیں کیا ؟ ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت ہے کہ قبیلہ مزینہ کے ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم سے پھلوں کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: جو شخص پھل خوشے میں سے توڑ کر چرائے تو اسے اس کی دوگنی قیمت دینی ہو گی، اور اگر پھل کھلیان میں ہو تو ہاتھ کاٹا جائے گا، بشرطیکہ وہ ڈھال کی قیمت کے برابر ہو، اور اگر اس نے صرف کھایا ہو لیا نہ ہو تو اس پر کچھ نہیں ، اس شخص نے پوچھا: اگر کوئی چراگاہ میں سے بکریاں چرا لے جائے ( تو کیا ہو گا ) ؟ اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: اس کی دوگنی قیمت ادا کرنی ہو گی، اور سزا بھی ملے گی، اور اگر وہ اپنے باڑے میں ہو تو اس میں ( چوری کرنے پر ) ہاتھ کاٹا جائے بشرطیکہ چرائی گئی چیز کی قیمت ڈھال کی قیمت کے برابر ہو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "ابوامیہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک چور لایا گیا، اس نے اقبال جرم تو کیا لیکن اس کے پاس سامان نہیں ملا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میرا خیال ہے کہ تم نے چوری نہیں کی ہے ، اس نے کہا: کیوں نہیں؟ آپ صلی اللہ علیہ وسلم نے پھر فرمایا: میرے خیال میں تم نے چوری نہیں کی ، اس نے کہا: کیوں نہیں؟ پھر آپ صلی اللہ علیہ وسلم نے حکم دیا، تو اس کا ہاتھ کاٹ دیا گیا، اس کے بعد نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کہو«أستغفر الله وأتوب إليه» میں اللہ سے مغفرت طلب کرتا ہوں اور اس سے توبہ کرتا ہوں ، تو اس نے کہا: «أستغفر الله وأتوب إليه» تب آپ صلی اللہ علیہ وسلم نے دو مرتبہ فرمایا: «اللهم تب عليه» اے اللہ تو اس کی توبہ قبول فرما ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک عورت کے ساتھ جبراً بدکاری کی گئی، آپ صلی اللہ علیہ وسلم نے اس عورت پر حد نہیں لگائی بلکہ اس شخص پر حد جاری کی جس نے اس کے ساتھ جبراً بدکاری کی تھی، اس روایت میں اس کا تذکرہ نہیں ہے کہ آپ صلی اللہ علیہ وسلم نے اسے مہر بھی دلایا ہو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مساجد میں حدود نہ جاری کی جائیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مساجد میں حد کے نفاذ سے منع فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "ابوبردہ بن نیار انصاری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے: دس کوڑے سے زیادہ کسی کو نہ لگائے جائیں سوائے اس کے کہ اللہ تعالیٰ کی حدود میں سے کوئی حد جاری کرنا ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تعزیراً دس کوڑوں سے زیادہ کی سزا نہ دو",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے اگر کوئی ایسا کام کرے جس سے حد لازم آئے، اور اسے اس کی سزا مل جائے، تو یہی اس کا کفارہ ہے، ورنہ اس کا معاملہ اللہ کے حوالے ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے دنیا میں کوئی گناہ کیا، اور اسے اس کی سزا مل گئی، تو اللہ تعالیٰ اس بات سے زیادہ انصاف پسند ہے کہ بندے کو دوبارہ سزا دے، اور جو دنیا میں کوئی گناہ کرے، اور اللہ تعالیٰ اس کے گناہ پر پردہ ڈال دے، تو اللہ تعالیٰ کا کرم اس سے کہیں بڑھ کر ہے کہ وہ بندے سے اس بات پر دوبارہ مواخذہ کرے جسے وہ پہلے معاف کر چکا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ سعد بن عبادہ رضی اللہ عنہ نے پوچھا: اللہ کے رسول! آدمی اگر اپنی بیوی کے ساتھ کسی شخص کو پائے تو کیا اسے قتل کر دے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نہیں سعد رضی اللہ عنہ نے کہا: کیوں نہیں، قسم ہے اس ذات کی جس نے آپ کو حق کا اعزاز بخشا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگو! سنو تمہارا سردار کیا کہہ رہا ہے ؟ ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2606,
			"arabicnumber": 2606,
			"text": "سلمہ بن محبق رضی اللہ عنہ کہتے ہیں کہ جب حدود کی آیت نازل ہوئی تو سعد بن عبادہ رضی اللہ عنہ سے جو ایک غیرت مند شخص تھے، پوچھا گیا: اگر آپ اپنی بیوی کے ساتھ کسی مرد کو پائیں تو اس وقت آپ کیا کریں گے؟ جواب دیا: میں تلوار سے ان دونوں کی گردن اڑا دوں گا، کیا میں چار گواہ ملنے کا انتظار کروں گا؟ اس وقت تک تو وہ اپنی ضرورت پوری کر کے چلا جائے گا، اور پھر میں لوگوں سے کہتا پھروں کہ فلاں شخص کو میں نے ایسا اور ایسا کرتے دیکھا ہے، اور وہ مجھے حد قذف لگا دیں، اور میری گواہی قبول نہ کریں، پھر سعد رضی اللہ عنہ کی اس بات کا تذکرہ نبی اکرم صلی اللہ علیہ وسلم سے کیا گیا، تو آپ نے فرمایا: ( غلط حالت میں ) تلوار سے دونوں کو قتل کر دینا ہی سب سے بڑی گواہی ہے ، پھر فرمایا: نہیں میں اس کی اجازت نہیں دیتا، مجھے اندیشہ ہے کہ اس طرح غیرت مندوں کے ساتھ متوالے بھی ایسا کرنے لگیں گے۔ ابن ماجہ کہتے ہیں کہ میں نے ابوزرعہ کو کہتے سنا ہے کہ یہ علی بن محمد طنافسی کی حدیث ہے، اور مجھے اس میں کا کچھ حصہ یاد نہیں رہا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2607,
			"arabicnumber": 2607,
			"text": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ میرے ماموں کا گزر میرے پاس سے ہوا ( راوی حدیث ہشیم نے ان کے ماموں کا نام حارث بن عمرو بتایا ) نبی اکرم صلی اللہ علیہ وسلم نے ان کو ایک جھنڈا باندھ دیا تھا، میں نے ان سے پوچھا: کہاں کا قصد ہے؟ انہوں نے عرض کیا: مجھے رسول اللہ صلی اللہ علیہ وسلم نے ایسے شخص کے پاس روانہ کیا ہے جس نے اپنے باپ کے مرنے کے بعد اس کی بیوی ( یعنی اپنی سوتیلی ماں ) سے شادی کر لی ہے، اور آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا ہے کہ میں اس کی گردن اڑا دوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2608,
			"arabicnumber": 2608,
			"text": "قرہ بن ایاس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے ایسے شخص کے پاس بھیجا جس نے اپنے باپ کی بیوی سے شادی کر لی تھی، تاکہ میں اس کی گردن اڑا دوں اور اس کا سارا مال لے لوں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2609,
			"arabicnumber": 2609,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اپنے کو اپنے والد کے علاوہ کسی اور کی طرف منسوب کرے، یا ( کوئی غلام یا لونڈی ) اپنے مالک کے بجائے کسی اور کو مالک بنائے تو اللہ تعالیٰ کی، فرشتوں کی اور تمام لوگوں کی اس پر لعنت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2610,
			"arabicnumber": 2610,
			"text": "سعد اور ابوبکرہ رضی اللہ عنہما کہتے ہیں کہ میرے کانوں نے سنا، اور میرے دل نے یاد رکھا کہ محمد صلی اللہ علیہ وسلم نے فرمایا: جو شخص اپنے آپ کو اپنے والد کے علاوہ کی طرف منسوب کرے، جب کہ وہ جانتا ہو کہ وہ اس کا والد نہیں ہے، تو ایسے شخص پر جنت حرام ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2611,
			"arabicnumber": 2611,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اپنا والد کسی اور کو بتائے، وہ جنت کی خوشبو نہیں سونگھ سکے گا، حالانکہ اس کی خوشبو پانچ سو سال کی مسافت سے محسوس ہوتی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sanad Malool"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "اشعث بن قیس رضی اللہ عنہ کہتے ہیں کہ میں قبیلہ کندہ کے وفد میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، وہ لوگ مجھے سب سے بہتر سمجھتے تھے، میں نے عرض کیا: اللہ کے رسول! کیا آپ لوگ ہم میں سے نہیں ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہم نضر بن کنانہ کی اولاد ہیں، نہ ہم اپنی ماں پر تہمت لگاتے ہیں، اور نہ اپنے والد سے علیحدہ ہوتے ہیں ۔ راوی کہتے ہیں: اشعث بن قیس رضی اللہ عنہ کہا کرتے تھے کہ میرے پاس اگر کوئی ایسا شخص آئے جو کسی قریشی کے نضر بن کنانہ کی اولاد میں سے ہونے کا انکار کرے، تو میں اسے حد قذف لگاؤں گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2613,
			"arabicnumber": 2613,
			"text": "صفوان بن امیہ رضی اللہ عنہ کہتے ہیں کہ ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے کہ عمرو بن مرہ نے آ کر کہا: اللہ کے رسول! اللہ نے میرے مقدر میں بدنصیبی لکھ دی ہے، اور میرے لیے سوائے اپنی ہتھیلی سے دف بجا کر روزی کمانے کا کوئی اور راستہ نہیں، لہٰذا آپ مجھے ایسا گانا گانے کی اجازت دیجئیے جس میں فحش اور بےحیائی کی باتیں نہ ہوں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نہ تو تمہیں اس کی اجازت دوں گا، نہ تمہاری عزت کروں گا، اور نہ تمہاری آنکھ ہی ٹھنڈی کروں گا، اے اللہ کے دشمن! تم نے جھوٹ کہا، اللہ تعالیٰ نے تمہیں پاکیزہ حلال روزی عطا کی تھی، لیکن تم نے اللہ تعالیٰ کی حلال کی ہوئی روزی کو چھوڑ کر اس کی حرام کی ہوئی روزی کو منتخب کیا، اگر میں نے تم کو اس سے پہلے منع کیا ہوتا تو ( آج اجازت طلب کرنے پر ) تجھے سزا دیتا، اور ضرور دیتا، میرے پاس سے اٹھو، اور اللہ تعالیٰ سے توبہ کرو، سنو! اگر تم نے اب منع کرنے کے بعد ایسا کیا تو میں تمہاری سخت پٹائی کروں گا، تمہارے سر کو مثلہ کر کے منڈوا دوں گا، تمہیں تمہارے اہل و عیال سے الگ کر دوں گا، اور اہل مدینہ کے نوجوانوں کے لیے تمہارے مال و اسباب کو لوٹنا حلال کر دوں گا ۔ یہ سن کر عمرو اٹھا، اس کی ایسی ذلت و رسوائی ہوئی کہ اللہ تعالیٰ ہی اسے جانتا ہے، جب وہ چلا گیا تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: یہ لوگ گنہگار ہیں، ان میں سے جو بلا توبہ کیے مر گیا، اللہ اسے قیامت کے روز اسی حالت میں اٹھائے گا جس حالت میں وہ دنیا میں مخنث اور عریاں تھا، اور وہ کپڑے کے کنارے سے بھی اپنا ستر نہیں چھپا سکے گا، جب جب کھڑا ہو گا گر پڑے گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2614,
			"arabicnumber": 2614,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ان کے پاس آئے، تو ایک مخنث کو عبداللہ بن ابی امیہ سے یہ کہتے سنا کہ اگر اللہ تعالیٰ کل طائف فتح کرا دے، تو میں تمہیں ایسی عورت کے بار ے میں بتاؤں گا جو آگے کی طرف مڑتی ہے تو چار سلوٹیں پڑ جاتی ہیں، اور پیچھے کی جانب مڑتی ہے تو آٹھ سلوٹیں ہو جاتی ہیں، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ان ( مخنثوں ) کو اپنے گھروں سے نکال دو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 82
			}
		}
	]
}