{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2615,
			"arabicnumber": 2615,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت کے دن سب سے پہلے خون کا فیصلہ کیا جائے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2616,
			"arabicnumber": 2616,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب بھی کوئی شخص ناحق قتل کیا جاتا ہے، تو آدم علیہ السلام کے پہلے بیٹے ( قابیل ) پر بھی اس کے گناہ کا ایک حصہ ہوتا ہے، اس لیے کہ اس نے سب سے پہلے قتل کی رسم نکالی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2617,
			"arabicnumber": 2617,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت کے دن سب سے پہلے لوگوں کے درمیان خون کا فیصلہ کیا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2618,
			"arabicnumber": 2618,
			"text": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اللہ تعالیٰ سے اس حال میں ملے کہ وہ نہ تو شرک کرتا ہو اور نہ ہی اس نے خون ناحق کیا ہو تو وہ جنت میں جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2619,
			"arabicnumber": 2619,
			"text": "براء بن عازب رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے نزدیک کسی مومن کا ناحق قتل ساری دنیا کے زوال اور تباہی سے کہیں بڑھ کر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2620,
			"arabicnumber": 2620,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص کسی مومن کے قتل میں آدھی بات کہہ کر بھی مددگار ہوا ہو، تو وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ اس کی پیشانی پر «آيس من رحمة الله» اللہ کی رحمت سے مایوس بندہ لکھا ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2621,
			"arabicnumber": 2621,
			"text": "سالم بن ابی الجعد کہتے ہیں کہ ابن عباس رضی اللہ عنہما سے اس شخص کے بارے میں سوال کیا گیا جس نے کسی مومن کو جان بوجھ کر قتل کر دیا، پھر توبہ کر لی، ایمان لے آیا، اور نیک عمل کیا، پھر ہدایت پائی؟ تو آپ نے جواب دیا: افسوس وہ کیسے ہدایت پا سکتا ہے؟ میں نے تمہارے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے: قیامت کے دن قاتل اور مقتول اس حال میں آئیں گے کہ مقتول قاتل کے سر سے لٹکا ہو گا، اور کہہ رہا ہو گا ، اے میرے رب! اس سے پوچھ کہ اس نے مجھے کیوں قتل کیا؟ اللہ کی قسم! اس نے تمہارے نبی پر اس ( قتل ناحق کی آیت ) کو نازل کرنے کے بعد منسوخ نہیں کیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2622,
			"arabicnumber": 2622,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کیا میں تمہیں وہ بات نہ بتاؤں جو میں نے رسول اللہ صلی اللہ علیہ وسلم کی زبان مبارک سے سنی ہے، وہ بات میرے کان نے سنی، اور میرے دل نے اسے یاد رکھا کہ ایک آدمی تھا جس نے ننانوے خون ( ناحق ) کئے تھے، پھر اسے توبہ کا خیال آیا، اس نے روئے زمین پر سب سے بڑے عالم کے بارے میں سوال کیا، تو اسے ایک آدمی کے بارے میں بتایا گیا، وہ اس کے پاس آیا، اور کہا: میں ننانوے آدمیوں کو ( ناحق ) قتل کر چکا ہوں، کیا اب میری توبہ قبول ہو سکتی ہے؟ اس شخص نے جواب دیا: ( واہ ) ننانوے آدمیوں کے ( قتل کے ) بعد بھی ( توبہ کی امید رکھتا ہے ) ؟ اس شخص نے تلوار کھینچی اور اسے بھی قتل کر دیا، اور سو پورے کر دئیے، پھر اسے توبہ کا خیال آیا، اور روئے زمین پر سب سے بڑے عالم کے بارے میں سوال کیا، اسے جب ایک شخص کے بارے میں بتایا گیا تو وہ وہاں گیا، اور اس سے کہا: میں سو خون ( ناحق ) کر چکا ہوں، کیا میری توبہ قبول ہو سکتی ہے؟ اس نے جواب دیا: تم پر افسوس ہے! بھلا تمہیں توبہ سے کون روک سکتا ہے؟ تم اس ناپاک اور خراب بستی سے ( جہاں تم نے اتنے بھاری گناہ کئے ) نکل جاؤ ۱؎، اور فلاں نیک اور اچھی بستی میں جاؤ، وہاں اپنے رب کی عبادت کرنا، وہ جب نیک بستی میں جانے کے ارادے سے نکلا، تو اسے راستے ہی میں موت آ گئی، پھر رحمت و عذاب کے فرشتے اس کے بارے میں جھگڑنے لگے، ابلیس نے کہا کہ میں اس کا زیادہ حقدار ہوں، اس نے ایک پل بھی میری نافرمانی نہیں کی، تو رحمت کے فرشتوں نے کہا: وہ توبہ کر کے نکلا تھا ( لہٰذا وہ رحمت کا مستحق ہوا ) ۔ راوی حدیث ہمام کہتے ہیں کہ مجھ سے حمید طویل نے حدیث بیان کی، وہ بکر بن عبداللہ سے اور وہ ابورافع رضی اللہ عنہ سے روایت کرتے ہیں وہ کہتے ہیں: ( جب فرشتوں میں جھگڑا ہونے لگا تو ) اللہ تعالیٰ نے ایک فرشتہ ( ان کے فیصلے کے لیے ) بھیجا، دونوں قسم کے فرشتے اس کے پاس فیصلہ کے لیے آئے، تو اس نے کہا: دیکھو دونوں بستیوں میں سے وہ کس سے زیادہ قریب ہے؟ ( فاصلہ ناپ لو ) جس سے زیادہ قریب ہو وہیں کے لوگوں میں اسے شامل کر دو۔ راوی حدیث قتادہ کہتے ہیں کہ ہم سے حسن بصری نے حدیث بیان کی، اس میں انہوں نے کہا: جب اس کی موت کا وقت قریب ہوا تو وہ گھسٹ کر نیک بستی سے قریب اور ناپاک بستی سے دور ہو گیا، آخر فرشتوں نے اسے نیک بستی والوں میں شامل کر دیا ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2623,
			"arabicnumber": 2623,
			"text": "ابوشریح خزاعی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص کا خون کر دیا جائے، یا اس کو زخمی کر دیا جائے، اسے ( یا اس کے وارث کو ) تین باتوں میں سے ایک کا اختیار ہے، اگر وہ چوتھی بات کرنا چاہے تو اس کا ہاتھ پکڑ لو، تین باتیں یہ ہیں: یا تو قاتل کو قصاص میں قتل کرے، یا معاف کر دے، یا خون بہا ( دیت ) لے لے، پھر ان تین باتوں میں سے کسی ایک کو کرنے کے بعد اگر بدلہ لینے کی بات کرے، تو اس کے لیے جہنم کی آگ ہے، وہ اس میں ہمیشہ ہمیش رہے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2624,
			"arabicnumber": 2624,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس کا کوئی شخص قتل کر دیا جائے تو اسے دو باتوں میں سے ایک کا اختیار ہے، یا تو وہ قاتل کو قصاص میں قتل کر دے، یا فدیہ لے لے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2625,
			"arabicnumber": 2625,
			"text": "زید بن ضمیرہ کہتے ہیں کہ میرے والد اور چچا دونوں جنگ حنین میں رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ تھے، ان دونوں کا بیان ہے کہ آپ صلی اللہ علیہ وسلم نے ظہر پڑھی پھر ایک درخت کے نیچے بیٹھ گئے، تو قبیلہ خندف کے سردار اقرع بن حابس رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کے پاس گئے، وہ محکلم بن جثامہ سے قصاص لینے کو روک رہے تھے، عیینہ بن حصن رضی اللہ عنہ اٹھے، وہ عامر بن اضبط اشجعی کے قصاص کا مطالبہ کر رہے تھے ۱؎، بالآخر رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: کیا تم دیت ( خون بہا ) قبول کرتے ہو ؟ انہوں نے انکار کیا، پھر بنی لیث کا مکیتل نامی شخص کھڑا ہوا، اور کہنے لگا: اللہ کے رسول! قسم اللہ کی! اسلام کے شروع زمانے میں یہ قتل میں ان بکریوں کے مشابہ سمجھتا تھا جو پانی پینے آتی ہیں، پھر جب آگے والی بکریوں کو تیر مارا جاتا ہے تو پیچھے والی اپنے آپ بھاگ جاتی ہیں، ۲؎آپ صلی اللہ علیہ وسلم نے فرمایا: تم پچاس اونٹ ( دیت کے ) ابھی لے لو، اور بقیہ پچاس مدینہ لوٹنے پر لے لینا، لہٰذا انہوں نے دیت قبول کر لی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2626,
			"arabicnumber": 2626,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے قصداً کسی کو قتل کر دیا، تو قاتل کو مقتول کے وارثوں کے حوالہ کر دیا جائے گا، وہ چاہیں تو اسے قتل کر دیں، اور چاہیں تو دیت لے لیں، دیت ( خوں بہا ) میں تیس حقہ، تیس جذعہ اور چالیس حاملہ اونٹنیاں ہیں، قتل عمد کی دیت یہی ہے، اور باہمی صلح سے جو بھی طے پائے وہ مقتول کے ورثاء کو ملے گا، اور سخت دیت یہی ہے۔ ۱؎",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2627,
			"arabicnumber": 2627,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: عمداً و قصداً قتل کے مشابہ یعنی غلطی سے قتل کیا جانے والا وہ ہے جو کوڑے یا ڈنڈے سے مر جائے، اس میں سو اونٹ دیت ( خون بہا ) کے ہیں جن میں چالیس حاملہ اونٹنیاں ہوں گی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2628,
			"arabicnumber": 2628,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم کعبہ کی سیڑھیوں پر کھڑے ہوئے، اللہ کی تعریف کی، اس کی حمد و ثنا بیان کی، پھر فرمایا: اللہ تعالیٰ کا شکر ہے جس نے اپنا وعدہ سچا کر دکھایا، اپنے بندے کی مدد کی، اور کفار کے گروہوں کو اس نے اکیلے ہی شکست دے دی، آگاہ رہو! غلطی سے قتل ہونے والا وہ ہے جو کوڑے اور لاٹھی سے مارا جائے، اس میں ( دیت کے ) سو اونٹ لازم ہیں، جن میں چالیس حاملہ اونٹنیاں ہوں ان کے پیٹ میں بچے ہوں، خبردار! زمانہ جاہلیت کی ہر رسم اور اس میں جو بھی خون ہوا ہو سب میرے ان پیروں کے تلے ہیں ۱؎ سوائے بیت اللہ کی خدمت اور حاجیوں کو پانی پلانے کے، سن لو! میں نے ان دونوں چیزوں کو انہیں کے پاس رہنے دیا ہے جن کے پاس وہ پہلے تھے ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2629,
			"arabicnumber": 2629,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے دیت کے بارہ ہزار درہم مقرر کئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2630,
			"arabicnumber": 2630,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص غلطی سے مارا جائے اس کا خون بہا تیس اونٹنیاں ہیں، جو ایک سال پورے کر کے دوسرے میں لگ گئی ہوں، اور تیس اونٹنیاں جو دو سال پورے کر کے تیسرے میں لگ گئی ہوں، اور تیس اونٹنیاں وہ جو تین سال پورے کر کے چوتھے سال میں لگ گئی ہوں، اور دو دو سال کے دس اونٹ ہیں جو تیسرے سال میں داخل ہو گئے ہوں ، اور آپ صلی اللہ علیہ وسلم نے گاؤں والوں پر دیت ( خون بہا ) کی قیمت چار سو دینار لگائی یا اتنی ہی قیمت کی چاندی، یہ قیمت وقت کے حساب سے بدلتی رہتی، اونٹ مہنگے ہوتے تو دیت بھی زیادہ ہوتی اور جب سستے ہوتے تو دیت بھی کم ہو جاتی، لہٰذا رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں دیت کی قیمت چار سو دینار سے آٹھ سو دینار تک پہنچ گئی، اور چاندی کے حساب سے آٹھ ہزار درہم ہوتے تھے، آپ صلی اللہ علیہ وسلم نے یہ بھی فیصلہ فرمایا: گائے والوں سے دو سو گائیں اور بکری والوں سے دو ہزار بکریاں ( دیت میں ) لی جائیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2631,
			"arabicnumber": 2631,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قتل ( غلطی سے قتل ) کی دیت بیس اونٹنیاں تین تین سال کی جو چوتھے میں لگی ہوں، بیس اونٹنیاں چار چار سال کی جو پانچویں میں لگ گئی ہوں، بیس اونٹنیاں ایک ایک سال کی جو دوسرے سال میں لگ گئی ہوں، بیس اونٹنیاں دو دو سال کی جو تیسرے سال میں لگ گئی ہوں، اور بیس اونٹ ہیں جو ایک ایک سال کے ہوں اور دوسرے سال میں لگ گئے ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2632,
			"arabicnumber": 2632,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے دیت بارہ ہزار درہم مقرر فرمائی، اور فرمان الٰہی «وما نقموا إلا أن أغناهم الله ورسوله من فضله» ( سورۃ التوبہ: ۷۴ ) کفار اسی بات سے غصہ ہوئے کہ اللہ اور اس کے رسول نے اپنی مہربانی سے انہیں مالدار کر دیا کا یہی مطلب ہے کہ دیت لینے سے ان ( مسلمانوں ) کو مالدار کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2633,
			"arabicnumber": 2633,
			"text": "مغیرہ بن شعبہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا: دیت عاقلہ ( قاتل اور اس کے خاندان والوں ) کے ذمہ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2634,
			"arabicnumber": 2634,
			"text": "مقدام شامی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس کا کوئی وارث نہ ہو اس کا وارث میں ہوں، اس کی طرف سے دیت بھی ادا کروں گا اور اس کا ترکہ بھی لوں گا، اور ماموں اس کا وارث ہے جس کا کوئی وارث نہ ہو، وہ اس کی دیت بھی ادا کرے گا، اور ترکہ بھی پائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2635,
			"arabicnumber": 2635,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اندھا دھند فساد ( بلوہ ) میں یا تعصب کی وجہ سے پتھر، کوڑے یا ڈنڈے سے مار دیا جائے، تو قاتل پر قتل خطا کی دیت لازم ہو گی، اور اگر قصداً مارا جائے، تو اس میں قصاص ہے، جو شخص قصاص یا دیت میں حائل ہو تو اس پر لعنت اللہ کی ہے، اس کے فرشتوں کی، اور سب لوگوں کی، اس کا نہ فرض قبول ہو گا نہ نفل ۱؎۔",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Batil"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2636,
			"arabicnumber": 2636,
			"text": "جاریہ رضی اللہ عنہ سے روایت ہے کہ ایک شخص نے دوسرے کی کلائی پر تلوار ماری جس سے وہ کٹ گئی، لیکن جوڑ پر سے نہیں، پھر زخمی شخص نے رسول اللہ صلی اللہ علیہ وسلم سے فریاد کی، تو آپ صلی اللہ علیہ وسلم نے اس کے لیے دیت ( خون بہا ) دینے کا حکم فرمایا، وہ بولا: اللہ کے رسول! میں قصاص لینا چاہتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: دیت لے لو، اللہ تعالیٰ تمہارے لیے اس میں برکت دے، اور اس کے لیے قصاص کا فیصلہ نہیں فرمایا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2637,
			"arabicnumber": 2637,
			"text": "عباس بن عبدالمطلب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو زخم دماغ یا پیٹ تک پہنچ جائے، یا ہڈی ٹوٹ کر اپنی جگہ سے ہٹ جائے، تو اس میں قصاص نہ ہو گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوجہم بن حذیفہ رضی اللہ عنہ کو مصدق ( عامل صدقہ ) بنا کر بھیجا، زکاۃ کے سلسلے میں ان کا ایک شخص سے جھگڑا ہو گیا، ابوجہم رضی اللہ عنہ نے اسے مارا تو اس کا سر پھٹ گیا، وہ لوگ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، اور قصاص کا مطالبہ کرنے لگے تو آپ صلی اللہ علیہ وسلم نے فرمایا: اچھا تم اتنا اتنا مال لے لو ، وہ راضی نہیں ہوئے، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اچھا اتنا اتنا مال ( اور ) لے لو ، تو وہ راضی ہو گئے، آپ صلی اللہ علیہ وسلم نے فرمایا: میں لوگوں کے سامنے خطبہ دوں، اور تم لوگوں کی رضا مندی کی خبر سناؤں؟ کہنے لگے: ٹھیک ہے، پھر نبی اکرم صلی اللہ علیہ وسلم نے خطبہ دیا اور فرمایا: یہ لیث کے لوگ میرے پاس آئے اور قصاص لینا چاہتے تھے، میں نے ان سے اتنا اتنا مال لینے کی پیشکش کی اور پوچھا: کیا وہ اس پر راضی ہیں ؟ کہنے لگے: نہیں، ( ان کے اس رویہ پر ) مہاجرین نے ان کو مارنے پیٹنے کا ارادہ کیا، آپ صلی اللہعلیہ وسلم نے انہیں باز رہنے کو کہا، تو وہ رک گئے، پھر آپ صلی اللہ علیہ وسلم نے ان کو بلایا اور کچھ اضافہ کر دیا، اور پوچھا: کیا اب راضی ہیں ؟ انہوں نے اقرار کیا، آپ صلی اللہ علیہ وسلم نے پھر فرمایا: کیا میں خطبہ دوں اور لوگوں کو تمہاری رضا مندی کی اطلاع دے دوں ؟ جواب دیا: ٹھیک ہے، آپ صلی اللہ علیہ وسلم نے خطبہ دیا، اور پھر کہا: تم راضی ہو ؟ جواب دیا: جی ہاں ۱؎۔ ابن ماجہ کہتے ہیں: میں نے محمد بن یحییٰ کو کہتے سنا کہ معمر اس حدیث کو روایت کرنے میں منفرد ہیں، میں نہیں جانتا کہ ان کے علاوہ کسی اور نے بھی یہ حدیث روایت کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2639,
			"arabicnumber": 2639,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے جنین ( پیٹ کے بچے کی دیت ) میں ایک غلام یا ایک لونڈی کا فیصلہ فرمایا، تو جس کے خلاف فیصلہ ہوا وہ بولا: کیا ہم اس کی دیت دیں جس نے نہ پیا ہو نہ کھایا ہو، نہ چیخا ہو نہ چلایا ہو، ایسے کی دیت کو تو لغو مانا جائے گا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ تو شاعروں جیسی بات کرتا ہے؟ پیٹ کے بچہ میں ایک غلام یا لونڈی ( دیت ) ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2640,
			"arabicnumber": 2640,
			"text": "مسور بن مخرمہ رضی اللہ عنہما کہتے ہیں کہ عمر رضی اللہ عنہ نے لوگوں سے پیٹ سے گر جانے والے بچے کے بارے میں مشورہ لیا، تو مغیرہ بن شعبہ رضی اللہ عنہ نے کہا: میں رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھا، آپ صلی اللہ علیہ وسلم نے اس میں ایک غلام یا لونڈی دینے کا فیصلہ فرمایا تو عمر رضی اللہ عنہ نے کہا: اپنی اس بات کے لیے گواہ لاؤ، تو محمد بن مسلمہ رضی اللہ عنہ نے ان کے ساتھ گواہی دی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2641,
			"arabicnumber": 2641,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ عمر رضی اللہ عنہ نے جنین ( پیٹ کے بچے ) کے بارے میں رسول اللہ صلی اللہ علیہ وسلم کا فرمان تلاش کیا، تو حمل بن مالک رضی اللہ عنہ نے کھڑے ہو کر کہا: میری دو بیویاں تھیں، ان میں سے ایک نے دوسری کو خیمے کی لکڑی سے مارا جس سے وہ اور اس کے پیٹ میں جو بچہ تھا دونوں مر گئے، پھر آپ صلی اللہ علیہ وسلم نے جنین ( پیٹ کے بچہ ) میں ایک غلام یا ایک لونڈی دینے کا، اور عورت کو عورت کے قصاص میں قتل کا فیصلہ فرمایا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2642,
			"arabicnumber": 2642,
			"text": "سعید بن المسیب سے روایت ہے کہ عمر رضی اللہ عنہ کہتے تھے کہ دیت ( خون بہا ) قاتل کے خاندان والوں کے ذمہ ہے، اور عورت کو اپنے شوہر کی دیت میں سے کچھ نہیں ملے گا، یہاں تک کہ ضحاک بن سفیان نے ان کو لکھا کہ رسول اللہ صلی اللہ علیہ وسلم نے اشیم ضبابی رضی اللہ عنہ کی بیوی کو اس کے شوہر کی دیت میں سے ترکہ دلایا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2643,
			"arabicnumber": 2643,
			"text": "عبادہ بن صامت رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے حمل بن مالک ہذلی لحیانی رضی اللہ عنہ کو ان کی بیوی کی دیت میں سے میراث دلائی جس کو ان کی دوسری بیوی نے قتل کر دیا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2644,
			"arabicnumber": 2644,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا: دونوں اہل کتاب کی دیت مسلمان کی دیت کے مقابلہ میں آدھی ہے، اور دونوں اہل کتاب سے مراد یہود و نصاریٰ ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2645,
			"arabicnumber": 2645,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قاتل وارث نہیں ہو گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2646,
			"arabicnumber": 2646,
			"text": "عمرو بن شعیب کہتے ہیں کہ قبیلہ بنی مدلج کے ابوقتادہ نامی شخص نے اپنے بیٹے کو مار ڈالا جس پر عمر رضی اللہ عنہ نے اس سے دیت کے سو اونٹ لیے: تیس حقے، تیس جذعے، اور چالیس حاملہ اونٹنیاں، پھر فرمایا: مقتول کا بھائی کہاں ہے؟ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: قاتل کے لیے کوئی میراث نہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2647,
			"arabicnumber": 2647,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عورت پر واجب دیت کو اس کے عصبہ ( باپ کے رشتہ دار ) ادا کریں گے، لیکن اس عورت کی میراث سے انہیں وہی حصہ ملے گا جو ورثاء سے بچ جائے گا، اگر عورت قتل کر دی جائے، تو اس کی دیت اس کے ورثاء کے درمیان تقسیم ہو گی، اور وہی اس کے قاتل کو قتل کریں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2648,
			"arabicnumber": 2648,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مقتولہ کی دیت قاتلہ کے عصبہ ( باپ کے رشتہ داروں ) پر ٹھہرائی تو مقتولہ کے عصبہ نے کہا: اس کی میراث کے حقدار ہم ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: میراث اس کے شوہر اور اس کے لڑکے کو ملے گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2649,
			"arabicnumber": 2649,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ ان کی پھوپھی ربیع بنت نضر رضی اللہ عنہا نے ایک لڑکی کے سامنے کا دانت توڑ ڈالا، تو ربیع کے لوگوں نے معافی مانگی، لیکن لڑکی کی جانب کے لوگ معافی پر راضی نہیں ہوئے، پھر انہوں نے دیت کی پیش کش کی، تو انہوں نے دیت لینے سے بھی انکار کر دیا، اور نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، آپ صلی اللہ علیہ وسلم نے قصاص کا حکم دیا، تو انس بن نضر رضی اللہ عنہ نے کہا: اللہ کے رسول! کیا ربیع کا دانت توڑا جائے گا؟ اس ذات کی قسم جس نے آپ کو حق کے ساتھ بھیجا ہے، ایسا نہیں ہو گا، آپ صلی اللہ علیہ وسلم نے فرمایا: اے انس! اللہ کی کتاب قصاص کا حکم دیتی ہے ، پھر لوگ معافی پر راضی ہو گئے، اور اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے بعض بندے ایسے بھی ہیں کہ اگر وہ اللہ کی قسم کھا لیں تو اللہ تعالیٰ ان کی قسم پوری کر دیتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2650,
			"arabicnumber": 2650,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( دیت کے معاملہ میں ) سب دانت برابر ہیں، سامنے کے دانت اور داڑھ برابر ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2651,
			"arabicnumber": 2651,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے دانت کی دیت میں پانچ اونٹ کا فیصلہ فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2652,
			"arabicnumber": 2652,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( دیت میں ) یہ اور یہ یعنی چھنگلیا ( سب سے چھوٹی انگلی ) اور انگوٹھا سب برابر ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2653,
			"arabicnumber": 2653,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہعلیہ وسلم نے فرمایا: ( دیت میں ) انگلیاں سب برابر ہیں، ہر ایک میں دس دس اونٹ دینے ہوں گے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2654,
			"arabicnumber": 2654,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ( دیت کے معاملہ میں ) سب انگلیاں برابر ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2655,
			"arabicnumber": 2655,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ہڈی ظاہر کر دینے والے زخم میں دیت پانچ پانچ اونٹ ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2656,
			"arabicnumber": 2656,
			"text": "یعلیٰ بن امیہ اور سلمہ بن امیہ رضی اللہ عنہما کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ غزوہ تبوک میں نکلے، ہمارے ساتھ ہمارا ایک ساتھی تھا، وہ اور ایک دوسرا شخص دونوں آپس میں لڑ پڑے، جب کہ ہم لوگ راستے میں تھے، ان میں سے ایک نے دوسرے کا ہاتھ کاٹ لیا اور جب اس نے اپنا ہاتھ اس کے منہ سے کھینچا تو اس کے سامنے کے دانت گر گئے، وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور اپنے دانت کی دیت مانگنے لگا، آپ صلیاللہ علیہ وسلم نے فرمایا: ( عجیب ماجرا ہے ) تم میں سے کوئی ایک اپنے ساتھی کے ہاتھ کو اونٹ کی طرح چبانا چاہتا ہے اور پھر دیت مانگتا ہے، اس کی کوئی دیت نہیں، پھر آپ صلی اللہ علیہ وسلم نے اس کو باطل قرار دیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2657,
			"arabicnumber": 2657,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ ایک شخص نے دوسرے کے بازو کو کاٹا، اس نے اپنا ہاتھ کھینچا تو اس کا سامنے کا دانت گر گیا، مقدمہ نبی اکرم صلی اللہ علیہ وسلم کے پاس لایا گیا، تو آپ صلی اللہ علیہ وسلم نے اس کو باطل قرار دیا، اور فرمایا: تم میں سے ایک ( دوسرے کے ہاتھ کو ) ایسے چباتا ہے جیسے اونٹ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2658,
			"arabicnumber": 2658,
			"text": "ابوجحیفہ رضی اللہ عنہ کہتے ہیں کہ میں نے علی رضی اللہ عنہ سے عرض کیا تمہارے پاس کوئی ایسا علم ہے جو دیگر لوگوں کے پاس نہ ہو؟ وہ بولے: نہیں، اللہ کی قسم! ہمارے پاس وہی ہے جو لوگوں کے پاس ہے، ہاں مگر قرآن کی سمجھ جس کی اللہ تعالیٰ کسی کو توفیق بخشتا ہے یا وہ جو اس صحیفے میں ہے اس ( صحیفے ) میں ان دیتوں کا بیان ہے جو رسول اللہ صلی اللہ علیہ وسلم سے مروی ہیں، اور آپ کا یہ فرمان بھی ہے کہ مسلمان کو کافر کے بدلے قتل نہیں کیا جائے گا۔ ۱؎",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2659,
			"arabicnumber": 2659,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان کو کافر کے بدلے میں قتل نہیں کیا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2660,
			"arabicnumber": 2660,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مومن کافر کے بدلے قتل نہیں کیا جائے گا ۱؎، اور نہ وہ ( کافر ) جس کی حفاظت کا ذمہ لیا گیا ہو ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2661,
			"arabicnumber": 2661,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: باپ بیٹے کے بدلے قتل نہیں کیا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2662,
			"arabicnumber": 2662,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: باپ کو بیٹے کے بدلے قتل نہیں کیا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2663,
			"arabicnumber": 2663,
			"text": "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے اپنے غلام کو قتل کیا ہم اسے قتل کریں گے، اور جس نے اس کی ناک کاٹی ہم اس کی ناک کاٹیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2664,
			"arabicnumber": 2664,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ ایک شخص نے اپنے غلام کو جان بوجھ کر قتل کر دیا، تو رسول اللہ صلی اللہ علیہ وسلم نے اس کو سو کوڑے مارے، ایک سال کے لیے جلا وطن کیا، اور مسلمانوں کے حصوں میں سے اس کا حصہ ختم کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2665,
			"arabicnumber": 2665,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک یہودی نے ایک عورت کا سر دو پتھروں کے درمیان رکھ کر کچل ڈالا، تو رسول اللہ صلیاللہ علیہ وسلم نے بھی اس کے ساتھ وہی سلوک کیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2666,
			"arabicnumber": 2666,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک یہودی نے ایک لڑکی کو اس کے زیورات کی خاطر مار ڈالا تو آپ صلی اللہ علیہ وسلم نے لڑکی سے ( اس کی موت سے پہلے ) پوچھا: کیا تجھے فلاں نے مارا ہے؟ لڑکی نے سر کے اشارہ سے کہا: نہیں، پھر آپ صلی اللہ علیہ وسلم نے دوسرے کے متعلق پوچھا: ( کیا فلاں نے مارا ہے؟ ) دوبارہ بھی اس نے سر کے اشارے سے کہا: نہیں، پھر آپ صلی اللہ علیہ وسلم نے تیسرے کے متعلق پوچھا: تو اس نے سر کے اشارے سے کہا: ہاں، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے اس یہودی کو دو پتھروں کے درمیان رکھ کر قتل کر دیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2667,
			"arabicnumber": 2667,
			"text": "نعمان بن بشیر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قصاص صرف تلوار سے ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2668,
			"arabicnumber": 2668,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قصاص صرف تلوار سے ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2669,
			"arabicnumber": 2669,
			"text": "عمرو بن احوص رضی اللہ عنہ کہتے ہیں کہ میں نے حجۃ الوداع کے موقعہ پر رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: خبردار! مجرم اپنے جرم پر خود پکڑا جائے گا، ( یعنی جو قصور کرے گا وہ اپنی ذات ہی پر کرے گا اور اس کا مواخذہ اسی سے ہو گا ) باپ کے جرم میں بیٹا نہ پکڑا جائے گا، اور نہ بیٹے کے جرم میں باپ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2670,
			"arabicnumber": 2670,
			"text": "طارق محاربی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اپنے دونوں ہاتھ اٹھائے ہوئے دیکھا، یہاں تک کہ میں نے آپ صلی اللہ علیہ وسلم کی بغلوں کی سفیدی دیکھی، آپ صلی اللہ علیہ وسلم فرما رہے تھے خبردار! کوئی ماں اپنے بچے کے جرم میں نہیں پکڑی جائے گی، خبردار! کوئی ماں اپنے بچے کے جرم میں نہیں پکڑی جائے گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2671,
			"arabicnumber": 2671,
			"text": "خشخاش عنبری رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، میرے ساتھ میرا بیٹا بھی تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: تیری اس کے جرم پر اور اس کی تیرے جرم پر گرفت نہیں ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2672,
			"arabicnumber": 2672,
			"text": "اسامہ بن شریک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کوئی شخص کسی دوسرے شخص کے جرم کا ذمہ دار نہ ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2673,
			"arabicnumber": 2673,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بےزبان ( جانور ) کا زخم بے قیمت اور بیکار ہے، کان اور کنویں میں گر کر مر جائے تو وہ بھی بیکار ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2674,
			"arabicnumber": 2674,
			"text": "عمرو بن عوف رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: بےزبان ( جانور ) کا زخم بیکار ہے، اور کان میں گر کر مر جائے تو وہ بھی بیکار ہے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2675,
			"arabicnumber": 2675,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا: کان بیکار ہے اور کنواں بیکار و رائیگاں ہے، اور «عجماء» چوپائے وغیرہ حیوانات کو کہتے ہیں، اور «جبار» ایسے نقصان کو کہتے ہیں جس میں جرمانہ اور تاوان نہیں ہوتا، کنواں بیکار و رائیگاں ہے، اور بےزبان ( جانور ) کا زخم بیکار و رائیگاں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2676,
			"arabicnumber": 2676,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: آگ بیکار ہے، اور کنواں بیکار ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2677,
			"arabicnumber": 2677,
			"text": "سہل بن ابی حثمہ رضی اللہ عنہ اپنی قوم کے بزرگوں سے روایت کرتے ہیں کہ عبداللہ بن سہل اور محیصہ رضی اللہ عنہما دونوں محتاجی کی وجہ سے جو ان کو لاحق تھی ( روزگار کی تلاش میں ) اس یہودی بستی خیبر کی طرف نکلے، محیصہ رضی اللہ عنہ کو خبر ملی کہ عبداللہ بن سہل رضی اللہ عنہ قتل کر دئیے گئے ہیں، اور انہیں خیبر کے ایک گڑھے یا چشمے میں ڈال دیا گیا ہے، وہ یہودیوں کے پاس گئے، اور کہا: اللہ کی قسم، تم لوگوں نے ہی ان ( عبداللہ بن سہل ) کو قتل کیا ہے، وہ قسم کھا کر کہنے لگے کہ ہم نے ان کا قتل نہیں کیا ہے، اس کے بعد محیصہ رضی اللہ عنہ خیبر سے واپس اپنی قوم کے پاس پہنچے، اور ان سے اس کا ذکر کیا، پھر وہ، ان کے بڑے بھائی حویصہ، اور عبدالرحمٰن بن سہل رضی اللہ عنہما رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، اور محیصہ رضی اللہ عنہ جو کہ خیبر میں تھے بات کرنے بڑھے تو آپ صلی اللہ علیہ وسلم نے محیصہ رضی اللہ عنہ سے فرمایا: بڑے کا لحاظ کرو آپ صلی اللہ علیہ وسلم کی مراد عمر میں بڑے سے تھی چنانچہ حویصہ رضی اللہ عنہ نے گفتگو کی، اور اس کے بعد محیصہ رضی اللہ عنہ نے، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا: یا تو یہود تمہارے آدمی کی دیت ادا کریں ورنہ اس کو اعلان جنگ سمجھیں اور یہود کو یہ بات لکھ کر بھیج دی، انہوں نے بھی جواب لکھ بھیجا کہ اللہ کی قسم، ہم نے ان کو قتل نہیں کیا ہے، تو آپ صلی اللہ علیہ وسلم نے حویصہ، محیصہ اور عبدالرحمٰن رضی اللہ عنہم سے کہا: تم قسم کھا کر اپنے ساتھی کی دیت کے مستحق ہو سکتے ہو ، انہوں نے انکار کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: پھر یہود قسم کھا کر بری ہو جائیں گے وہ کہنے لگے: وہ تو مسلمان نہیں ہیں، ( کیا ان کی قسم کا اعتبار کیا جائے گا ) آخر کار رسول اللہ صلی اللہ علیہ وسلم نے اپنے پاس سے عبداللہ بن سہل رضی اللہ عنہ کی دیت ادا کی، اور ان کے لیے سو اونٹنیاں بھیجیں جنہیں ان کے گھر میں داخل کر دیا گیا۔ سہل رضی اللہ عنہ کا کہنا ہے کہ ان میں سے ایک لال اونٹنی نے مجھے لات ماری۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2678,
			"arabicnumber": 2678,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ مسعود کے دونوں بیٹے حویصہ و محیصہ رضی اللہ عنہما اور سہل کے دونوں بیٹے عبداللہ و عبدالرحمٰن رضی اللہ عنہما خیبر کی جانب تلاش رزق میں نکلے، عبداللہ پر ظلم ہوا، اور انہیں قتل کر دیا گیا، اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم کے سامنے کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: قسم کھاؤ اور ( دیت کے ) مستحق ہو جاؤ وہ کہنے لگے: اللہ کے رسول! جب ہم وہاں حاضر ہی نہیں تھے تو قسم کیوں کر کھائیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تو یہود ( قسم کھا کر ) تم سے بری ہو جائیں گے وہ کہنے لگے: اللہ کے رسول! تب تو وہ ہمیں مار ہی ڈالیں گے، رسول اللہ صلی اللہ علیہ وسلم نے اپنے پاس سے ان کی دیت ادا کر دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2679,
			"arabicnumber": 2679,
			"text": "سلمہ بن روح بن زنباع رضی اللہ عنہ کہتے ہیں کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، انہوں نے اپنے غلام کو خصی کر دیا تھا، تو نبی اکرم صلی اللہ علیہ وسلم نے غلام کو مثلہ ( ناک کان یا کوئی عضو کاٹ دینا ) کئے جانے کی بناء پر آزاد کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2680,
			"arabicnumber": 2680,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس چیختا ہوا آیا، آپ صلی اللہ علیہ وسلم نے اس سے فرمایا: کیا بات ہے ؟ وہ بولا: میرے مالک نے مجھے اپنی ایک لونڈی کا بوسہ لیتے ہوئے دیکھ لیا، تو میرے اعضاء تناسل ہی کاٹ ڈالے، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس آدمی کو میرے پاس لاؤ جب اسے ڈھونڈا گیا تو وہ نہیں مل سکا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جاؤ تم آزاد ہو، غلام بولا: اللہ کے رسول! میری مدد کون کرے گا؟ یعنی اگر میرا مالک مجھے پھر غلام بنا لے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ایسی صورت میں ہر مومن یا مسلمان پر تمہاری مدد لازم ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2681,
			"arabicnumber": 2681,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلیاللہ علیہ وسلم نے فرمایا: قتل کے مسئلہ میں اہل ایمان سب سے زیادہ پاکیزہ اور بہتر ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2682,
			"arabicnumber": 2682,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قتل کے مسئلہ میں اہل ایمان سب سے پاکیزہ لوگ ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2683,
			"arabicnumber": 2683,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مسلمانوں کے خون برابر ہیں، اور وہ اپنے مخالفوں کے لیے ایک ہاتھ کی طرح ہیں، ان میں سے ادنی شخص بھی کسی کو امان دے سکتا ہے، اور سب کو اس کی امان قبول کرنی ہو گی، اور ( لشکر میں ) سب سے دور والا شخص بھی مال غنیمت کا مستحق ہو گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2684,
			"arabicnumber": 2684,
			"text": "معقل بن یسار رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان اپنے علاوہ ( دوسرے مذہب ) والوں کے مقابلہ میں ایک ہاتھ کی حیثیت رکھتے ہیں اور ان کے خون برابر ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2685,
			"arabicnumber": 2685,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمانوں کا ہاتھ اپنے علاوہ دوسری قوم والوں پر ہے ( یعنی ان سب سے لڑیں، آپس میں نہ لڑیں ) ان کے خون اور ان کے مال برابر ہیں، مسلمانوں کا ادنی شخص کسی کو پناہ دے سکتا ہے اور لشکر میں دور والا شخص بھی مال غنیمت کا مستحق ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2686,
			"arabicnumber": 2686,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے کسی ذمی کو قتل کیا، وہ جنت کی خوشبو بھی نہیں پائے گا، حالانکہ اس کی خوشبو چالیس سال کی مسافت سے محسوس کی جاتی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2687,
			"arabicnumber": 2687,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم فرمایا: جس نے کسی ایسے ذمی کو قتل کر دیا جس کو اللہ تعالیٰ اور اس کے رسول نے پناہ دے رکھی ہو، تو وہ جنت کی خوشبو بھی نہ پائے گا، حالانکہ اس کی خوشبو ستر سال کی مسافت سے محسوس کی جاتی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2688,
			"arabicnumber": 2688,
			"text": "رفاعہ بن شداد قتبانی کہتے ہیں کہ اگر وہ حدیث نہ ہوتی جو میں نے عمرو بن حمق خزاعی رضی اللہ عنہ سے سنی ہے تو میں مختار ثقفی کے سر اور جسم کے درمیان چلتا، میں نے عمرو بن حمق خزاعی رضی اللہ عنہ کو کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے کسی کو جان کی امان دی، پھر اس کو قتل کر دیا تو قیامت کے دن دغا بازی کا جھنڈا اٹھائے ہوئے ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2689,
			"arabicnumber": 2689,
			"text": "رفاعہ کہتے ہیں کہ میں مختار ثقفی کے پاس اس کے محل میں گیا، تو اس نے کہا: جبرائیل ابھی ابھی میرے پاس سے گئے ہیں ۱؎، اس وقت اس کی گردن اڑا دینے سے صرف اس حدیث نے مجھے باز رکھا جو میں نے سلیمان بن صرد رضی اللہ عنہ سے سنی تھی کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب کوئی شخص تم سے جان کی امان میں ہو تو اسے قتل نہ کرو، تو اسی بات نے مجھے اس کو قتل کرنے سے روکا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2690,
			"arabicnumber": 2690,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں قتل کر دیا تو اس کا مقدمہ آآپ کے پاس لایا گیا، چنانچہ آپ صلی اللہ علیہ وسلم نے قاتل کو مقتول کے ولی کے حوالے کر دیا، قاتل نے کہا: اللہ کے رسول! اللہ کی قسم، میرا اس کو قتل کرنے کا قطعاً ارادہ نہیں تھا، آپ صلی اللہ علیہ وسلم نے ولی سے کہا: اگر یہ اپنی بات میں سچا ہے، اور تم نے اس کو قتل کر دیا تو تم جہنم میں جاؤ گے تو مقتول کے ولی نے اس کو چھوڑ دیا، قاتل پٹے سے بندھا ہوا تھا، وہ پٹا گھسیٹتا ہوا نکلا، اور اس کا نام ہی پٹے والا پڑ گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2691,
			"arabicnumber": 2691,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ ایک شخص اپنے ولی کے قاتل کو رسول اللہ صلی اللہ علیہ وسلم کے پاس لایا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اسے معاف کر دو ، اس نے انکار کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: دیت لے لو اس نے انکار کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: جاؤ اسے قتل کر دو اور تم بھی اسی کی طرح ہو جاؤ ۱؎ چنانچہ اس سے مل کر کہا گیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: جاؤ تم اس کو قتل کر دو تم بھی اس کے مثل ہو جاؤ تو اس نے اسے چھوڑ دیا، قاتل کو اپنے گھر والوں کی طرف اپنا پٹا گھسیٹتے ہوئے جاتے دیکھا گیا، گویا کہ مقتول کے وارث نے اسے باندھ رکھا تھا ۱؎۔ ابوعمیر اپنی حدیث میں کہتے ہیں: ابن شوذب نے عبدالرحمٰن بن قاسم سے یہ قول نقل کیا ہے، نبی اکرم صلی اللہ علیہ وسلم کے بعد کسی کے لئے «اقتله فإنك مثله» کہنا درست نہیں۔ ابن ماجہ کہتے ہیں: یہ اہل رملہ کی حدیث ہے، ان کے علاوہ کسی اور نے یہ روایت نہیں کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2692,
			"arabicnumber": 2692,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ جب بھی رسول اللہ صلی اللہ علیہ وسلم کے پاس قصاص کا کوئی مقدمہ آتا تو آپ اس کو معاف کر دینے کا حکم دیتے ( یعنی سفارش کرتے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2693,
			"arabicnumber": 2693,
			"text": "ابو الدرداء رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: کوئی بھی شخص جس کے جسم کو صدمہ پہنچے پھر وہ ثواب کی نیت سے معاف کر دے، تو اللہ تعالیٰ اس کے عوض اس کا ایک درجہ بلند کرتا ہے اور ایک گناہ معاف کر دیتا ہے، یہ میرے کانوں نے سنا اور دل نے یاد رکھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2694,
			"arabicnumber": 2694,
			"text": "معاذ بن جبل، عبیدہ بن جراح، عبادہ بن صامت اور شداد بن اوس رضی اللہ عنہم بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عورت جب جان بوجھ کر قتل کا ارتکاب کرے اور وہ حاملہ ہو، تو اس وقت تک قتل نہیں کی جائے گی جب تک وہ بچہ کو جن نہ دے، اور کسی کو اس کا کفیل نہ بنا دے، اور اگر اس نے زنا کا ارتکاب کیا تو اس وقت تک رجم نہیں کی جائے گی جب تک وہ زچگی ( بچہ کی ولادت ) سے فارغ نہ ہو جائے، اور کسی کو اپنے بچے کا کفیل نہ بنا دے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 80
			}
		}
	]
}