{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"23": "Chapters on Shares of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ابوہریرہ! علم فرائض سیکھو اور سکھاؤ، اس لیے کہ وہ علم کا آدھا حصہ ہے، وہ بھلا دیا جائے گا، اور سب سے پہلے یہی علم میری امت سے اٹھایا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2720,
			"arabicnumber": 2720,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ سعد بن ربیع رضی اللہ عنہ کی بیوی ان کی دونوں بیٹیوں کو لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں، اور عرض کیا: اللہ کے رسول! یہ دونوں سعد کی بیٹیاں ہیں، جو آپ کے ساتھ غزوہ احد میں تھے اور شہید ہو گئے، ان کے چچا نے ان کی ساری میراث پر قبضہ کر لیا ( اب ان بچیوں کی شادی کا معاملہ ہے ) اور عورت سے مال کے بغیر کوئی شادی نہیں کرتا تو آپ صلی اللہ علیہ وسلم خاموش رہے یہاں تک کہ میراث والی آیت نازل ہوئی، اور آپ صلی اللہ علیہ وسلم نے سعد بن ربیع رضی اللہ عنہ کے بھائی کو طلب کیا اور فرمایا: سعد کی دونوں بیٹیوں کو ان کے مال کا دو تہائی حصہ اور ان کی بیوی کو آٹھواں حصہ دے دو، پھر جو بچے وہ تم لے لو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2721,
			"arabicnumber": 2721,
			"text": "ہذیل بن شرحبیل رضی اللہ عنہ کہتے ہیں کہ ایک آدمی ابوموسیٰ اشعری اور سلمان بن ربیعہ باہلی رضی اللہ عنہما کے پاس آیا، اور ان سے اس نے بیٹی، پوتی اور حقیقی بہن کے ( حصہ کے ) بارے میں پوچھا، تو ان دونوں نے کہا: آدھا بیٹی کے لیے ہے، اور جو باقی بچے وہ بہن کے لیے ہے، لیکن تم عبداللہ بن مسعود رضی اللہ عنہ کے پاس جاؤ، اور ان سے بھی معلوم کر لو، وہ بھی ہماری تائید کریں گے، وہ عبداللہ بن مسعود رضی اللہ عنہ کے پاس آیا، اور ان سے بھی مسئلہ معلوم کیا، نیز بتایا کہ ابوموسیٰ اشعری، اور سلمان بن ربیعہ رضی اللہ عنہما نے یہ بات بتائی ہے، تو عبداللہ بن مسعود رضی اللہ عنہ نے کہا: اگر میں ایسا حکم دوں تو گمراہ ہو گیا، اور ہدایت یافتہ لوگوں میں سے نہ رہا، لیکن میں وہ فیصلہ کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا، بیٹی کے لیے آدھا، اور پوتی کے لیے چھٹا حصہ ہے، اس طرح دو تہائی پورے ہو جائیں، اور جو ایک تہائی بچا وہ بہن کے لیے ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2722,
			"arabicnumber": 2722,
			"text": "معقل بن یسار مزنی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ کے پاس ترکے کا ایک ایسا مقدمہ لایا گیا جس میں دادا بھی ( وراثت کا حقدار ) تھا، تو آپ صلی اللہ علیہ وسلم نے اسے ایک تہائی یا چھٹا حصہ دیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2723,
			"arabicnumber": 2723,
			"text": "معقل بن یسار مزنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمارے خاندان کے ایک دادا کے لیے چھٹے حصہ کا فیصلہ فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "قبیصہ بن ذویب رضی اللہ عنہ کہتے ہیں کہ ایک نانی ابوبکر رضی اللہ عنہ کے پاس اپنا حصہ مانگنے آئی، تو آپ نے اس سے کہا: کتاب اللہ ( قرآن ) میں تمہارے حصے کا کوئی ذکر نہیں، اور رسول اللہ صلی اللہ علیہ وسلم کی سنت میں بھی مجھے تمہارا کوئی حصہ معلوم نہیں، تم لوٹ جاؤ یہاں تک کہ میں لوگوں سے اس سلسلے میں معلومات حاصل کر لوں، آپ نے لوگوں سے پوچھا، تو مغیرہ بن شعبہ رضی اللہ عنہ نے کہا: میں رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھا آپ صلی اللہ علیہ وسلم نے اس کو چھٹا حصہ دلایا، ابوبکر رضی اللہ عنہ نے کہا: کیا آپ کے ساتھ کوئی اور بھی تھا؟ تو محمد بن مسلمہ انصاری رضی اللہ عنہ کھڑے ہوئے، اور وہی بات بتائی جو مغیرہ بن شعبہ رضی اللہ عنہ نے بتائی تھی، چنانچہ ابوبکر رضی اللہ عنہ نے اس کو نافذ کر دیا۔ پھر دوسری عورت جو دادی تھی عمر رضی اللہ عنہ کے پاس اپنا حصہ مانگنے آئی، تو آپ نے کہا: کتاب اللہ ( قرآن ) میں تمہارا کوئی حصہ نہیں، اور جو فیصلہ پیشتر ہو چکا ہے وہ تمہارے لیے نہیں، بلکہ نانی کے لیے ہوا، اور میں از خود فرائض میں کچھ بڑھا بھی نہیں سکتا، وہی چھٹا حصہ ہے اگر دادی اور نانی دونوں ہوں تو دونوں اس چھٹے حصے کو آدھا آدھا تقسیم کر لیں، اور دونوں میں سے ایک ہو تو وہ چھٹا حصہ پورا لے لے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2725,
			"arabicnumber": 2725,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے دادی و نانی کو چھٹے حصے کا وارث بنایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2726,
			"arabicnumber": 2726,
			"text": "معدان بن ابی طلحہ یعمری سے روایت ہے کہ عمر بن خطاب رضی اللہ عنہ جمعہ کے دن خطبہ دینے کے لیے کھڑے ہوئے، یا خطبہ دیا، تو اللہ کی حمد و ثنا بیان کی اور کہا: اللہ کی قسم! میں اپنے بعد کلالہ ( ایسا مرنے والا جس کے نہ باپ ہو نہ بیٹا ) کے معاملے سے زیادہ اہم کوئی چیز نہیں چھوڑ رہا ہوں، میں نے رسول اللہ صلی اللہ علیہ وسلم سے بھی پوچھا، تو آپ صلی اللہ علیہ وسلم نے اس قدر سختی سے جواب دیا کہ ویسی سختی آپ نے مجھ سے کبھی نہیں کی یہاں تک کہ اپنی انگلی سے میری پسلی یا سینہ میں ٹھوکا مارا پھر فرمایا: اے عمر! تمہارے لیے آیت صیف «يستفتونك قل الله يفتيكم في الكلالة» آپ سے فتویٰ پوچھتے ہیں: آپ کہہ دیجئیے کہ اللہ تعالیٰ ( خود ) تمہیں کلالہ کے بارے میں فتوی دیتا ہے ( سورۃ النساء: ۱۷۶ ) جو کہ سورۃ نساء کے آخر میں نازل ہوئی، وہی کافی ہے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2727,
			"arabicnumber": 2727,
			"text": "مرہ بن شراحیل کہتے ہیں کہ عمر رضی اللہ عنہ نے کہا: تین باتیں ایسی ہیں کہ اگر رسول اللہ صلی اللہ علیہ وسلم ان کو بیان فرما دیتے تو میرے لیے یہ دنیا و مافیہا سے زیادہ پسندیدہ ہوتا، یعنی کللہ، سود اور خلافت۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2728,
			"arabicnumber": 2728,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ میں بیمار ہوا تو میرے پاس رسول اللہ صلی اللہ علیہ وسلم عیادت کرنے آئے، ابوبکر رضی اللہ عنہ بھی آپ کے ساتھ تھے، دونوں پیدل آئے، مجھ پر بیہوشی طاری تھی، تو رسول اللہ صلی اللہ علیہ وسلم نے وضو فرمایا، اور اپنے وضو کا پانی مجھ پر چھڑکا ( مجھے ہوش آ گیا ) تو میں نے کہا: اللہ کے رسول! میں کیا کروں؟ اپنے مال کے بارے میں کیا فیصلہ کروں؟ یہاں تک کہ سورۃ نساء کے اخیر میں میراث کی یہ آیت نازل ہوئی «وإن كان رجل يورث كلالة» اور جن کی میراث لی جاتی ہے، وہ مرد یا عورت کلالہ ہو یعنی اس کا باپ بیٹا نہ ہو ( سورۃ النساء: 12 ) اور «يستفتونك قل الله يفتيكم في الكلالة» آپ سے فتویٰ پوچھتے ہیں: آپ کہہ دیجئیے کہ اللہ تعالیٰ ( خود ) تمہیں کلالہ کے بارے میں فتوی دیتا ہے ( سورۃ النساء: ۱۷۶ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2729,
			"arabicnumber": 2729,
			"text": "اسامہ بن زید رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مسلمان کافر کا وارث نہیں ہو گا، اور نہ کافر مسلمان کا وارث ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2730,
			"arabicnumber": 2730,
			"text": "اسامہ بن زید رضی اللہ عنہما سے روایت ہے کہ انہوں نے عرض کیا: اللہ کے رسول! کیا آپ مکہ میں اپنے گھر میں ٹھہریں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: عقیل نے ہمارے لیے گھر یا زمین چھوڑی ہی کہاں ہے ؟ عقیل اور طالب دونوں ابوطالب کے وارث بنے اور جعفر اور علی رضی اللہ عنہما کو کچھ بھی ترکہ نہیں ملا اس لیے کہ یہ دونوں مسلمان تھے، اور عقیل و طالب دونوں ( ابوطالب کے انتقال کے وقت ) کافر تھے، اسی بناء پر عمر رضی اللہ عنہ کہا کرتے تھے کہ مومن کافر کا وارث نہیں ہو گا۔ اور اسامہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نہ مسلمان کافر کا وارث ہو گا، اور نہ ہی کافر مسلمان کا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2731,
			"arabicnumber": 2731,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دو مذہب والے ( جیسے کافر اور مسلمان ) ایک دوسرے کے وارث نہیں ہوں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2732,
			"arabicnumber": 2732,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رباب بن حذیفہ بن سعید بن سہم نے ام وائل بنت معمر جمحیہ سے نکاح کیا، اور ان کے تین بچے ہوئے، پھر ان کی ماں کا انتقال ہوا، تو اس کے بیٹے زمین جائیداد اور ان کے غلاموں کی ولاء کے وارث ہوئے، ان سب کو لے کر عمرو بن العاص رضی اللہ عنہ شام گئے، وہ سب طاعون عمواس میں مر گئے تو ان کے وارث عمرو رضی اللہ عنہ ہوئے، جو ان کے عصبہ تھے، اس کے بعد جب عمرو بن العاص رضی اللہ عنہ شام سے لوٹے تو معمر کے بیٹے عمرو بن العاص رضی اللہ عنہ کے خلاف اپنی بہن کے ولاء ( حق میراث ) کا مقدمہ لے کر عمر رضی اللہ عنہ کے پاس پہنچے، عمر رضی اللہ عنہ نے کہا: میں نے جو رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے اسی کے مطابق تمہارا فیصلہ کروں گا، میں نے آپ صلی اللہعلیہ وسلم کو فرماتے سنا: جس ولاء کو لڑکا اور والد حاصل کریں وہ ان کے عصبہ کو ملے گا خواہ وہ کوئی بھی ہو ، اس کے بعد عمر رضی اللہ عنہ نے ہمارے حق میں فیصلہ کر دیا، اور ہمارے لیے ایک دستاویز لکھ دی، جس میں عبدالرحمٰن بن عوف، زید بن ثابت رضی اللہ عنہما اور ایک تیسرے شخص کی گواہی درج تھی، جب عبدالملک بن مروان خلیفہ ہوئے تو ام وائل کا ایک غلام مر گیا، جس نے دو ہزار دینار میراث میں چھوڑے تھے، مجھے پتہ چلا کہ عمر رضی اللہ عنہ کا کیا ہوا فیصلہ بدل دیا گیا ہے، اور اس کا مقدمہ ہشام بن اسماعیل کے پاس گیا ہے، تو ہم نے معاملہ عبدالملک کے سامنے اٹھایا، اور ان کے سامنے عمر رضی اللہ عنہ کی دستاویز پیش کی جس پر عبدالملک نے کہا: میرے خیال سے تو یہ ایسا فیصلہ ہے جس میں کسی کو بھی شک نہیں کرنا چاہیئے، اور میں یہ نہیں سمجھ رہا تھا کہ مدینہ والوں کی یہ حالت ہو گئی ہے کہ وہ اس جیسے ( واضح ) فیصلے میں شک کر رہے ہیں، آخر کار عبدالملک نے ہماری موافقت میں فیصلہ کیا، اور ہم برابر اس میراث پر قابض رہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم کا ایک غلام کھجور کے درخت پر سے گر کر مر گیا، اور کچھ مال چھوڑ گیا، اس نے کوئی اولاد یا رشتہ دار نہیں چھوڑا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس کی میراث اس کے گاؤں میں سے کسی کو دے دو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2734,
			"arabicnumber": 2734,
			"text": "عبداللہ بن شداد کی اخیافی بہن بنت حمزہ کہتی ہیں کہ میرا ایک غلام فوت ہو گیا، اس نے ایک بیٹی چھوڑی، تو رسول اللہ صلی اللہ علیہ وسلم نے اس کا مال میرے اور اس کی بیٹی کے درمیان تقسیم کیا، اور مجھے اور اس کی بیٹی کو آدھا آدھا دیا، ( بیٹی کو بطور فرض اور بہن کو بطور عصبہ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2735,
			"arabicnumber": 2735,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قاتل وارث نہ ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2736,
			"arabicnumber": 2736,
			"text": "عبداللہ بن عمرو رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم فتح مکہ کے دن خطبہ کے لیے کھڑے ہوئے، اور فرمایا: عورت اپنے شوہر کی دیت اور مال دونوں میں وارث ہو گی، اور شوہر بیوی کی دیت اور مال میں وارث ہو گا، جب کہ ان میں سے ایک نے دوسرے کو قتل نہ کیا ہو، لیکن جب ایک نے دوسرے کو جان بوجھ کر قتل کر دیا ہو تو اس دیت اور مال سے کسی بھی چیز کا وارث نہیں ہو گا، اور اگر ان میں سے ایک نے دوسرے کو غلطی سے قتل کر دیا ہو تو اس کے مال سے تو وارث ہو گا، لیکن دیت سے وارث نہ ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "ابوامامہ بن سہل بن حنیف رضی اللہ عنہ سے روایت ہے کہ ایک شخص نے دوسرے شخص کو تیر مارا، جس سے وہ مر گیا، اور اس کا ماموں کے علاوہ کوئی اور وارث نہیں تھا تو ابوعبیدہ بن جراح رضی اللہ عنہ نے عمر رضی اللہ عنہ کو سارا قصہ لکھ بھیجا، جس کے جواب میں عمر رضی اللہ عنہ نے انہیں لکھا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس کا کوئی مولیٰ نہیں اس کا مولیٰ اللہ اور اس کے رسول ہیں، اور جس کا کوئی وارث نہیں اس کا وارث اس کا ماموں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2738,
			"arabicnumber": 2738,
			"text": "مقدام ابوکریمہ رضی اللہ عنہ (جو اہل شام میں سے تھے اور رسول اللہ صلی اللہ علیہ وسلم کے اصحاب میں سے تھے) کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے مال چھوڑا تو وہ اس کے وارثوں کا ہے، اور جو شخص بوجھ ( قرض یا محتاج اہل و عیال ) چھوڑ جائے تو وہ ہمارے ذمہ ہے ، اور کبھی آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ اور اس کے رسول کے ذمہ ہے، جس کا کوئی وارث نہ ہو، اس کا وارث میں ہوں، میں ہی اس کی دیت دوں گا، اور میں ہی میراث لوں گا، اور ماموں اس شخص کا وارث ہے جس کا کوئی وارث نہ ہو، وہی اس کی طرف سے دیت دے گا، اور وہی اس کا وارث بھی ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2739,
			"arabicnumber": 2739,
			"text": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سگے بھائی ایک دوسرے کے وارث ہوں گے، علاتی کے نہیں، آدمی اپنے سگے بھائی کا وارث ہو گا علاتی بھائیوں کا نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2740,
			"arabicnumber": 2740,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مال کو اللہ کی کتاب ( قرآن ) کے مطابق ذوی الفروض ( میراث کے حصہ داروں ) میں تقسیم کرو، پھر جو ان کے حصوں سے بچ رہے وہ اس مرد کا ہو گا جو میت کا زیادہ قریبی ہو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2741,
			"arabicnumber": 2741,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک شخص مر گیا، اور اس نے کوئی وارث نہیں چھوڑا سوائے ایک غلام کے، جس کو اس نے آزاد کر دیا تھا تو آپ نے اس کی میراث اسی غلام کو دلا دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2742,
			"arabicnumber": 2742,
			"text": "واثلہ بن اسقع رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: عورت تین میراث حاصل کرتی ہے، ایک تو اپنے اس غلام یا لونڈی کی میراث جس کو وہ آزاد کرے، دوسرے اس بچے کی میراث جس کو راستہ میں لاوارث پا کر پرورش کرے، تیسرے اس بچے کی میراث جس پر اپنے شوہر سے لعان کرے ۔ محمد بن یزید کہتے ہیں کہ یہ حدیث ہشام کے علاوہ کسی نے روایت نہیں کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2743,
			"arabicnumber": 2743,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ جب لعان کی آیت نازل ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس عورت نے کسی قوم میں ایسے ( بچہ ) کو ملا دیا جو ان میں سے نہیں تھا، تو اس کا اللہ تعالیٰ سے کوئی تعلق نہیں، اور وہ اس کی جنت میں ہرگز داخل نہ ہو گی، اسی طرح جس شخص نے اپنے بچے کو پہچان لینے کے باوجود انکار کر دیا، قیامت کے دن اللہ تعالیٰ اس سے پردہ کرے گا، اور سب کے سامنے اس کو ذلیل و رسوا کرے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2744,
			"arabicnumber": 2744,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہعلیہ وسلم نے فرمایا: کسی شخص کا ایسے نسب کا دعویٰ کرنا جس کو وہ پہچانتا نہیں کفر ہے یا اپنے نسب کا انکار کر دینا گرچہ اس کا سبب باریک ( دقیق ) ہو یہ بھی کفر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2745,
			"arabicnumber": 2745,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے کسی لونڈی یا آزاد عورت سے زنا کیا، پھر اس سے بچہ پیدا ہوا تو وہ ولدالزنا ہے، نہ وہ مرد اس بچے کا وارث ہو گا، نہ وہ بچہ اس مرد کا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2746,
			"arabicnumber": 2746,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس بچے کا نسب اس کے والد کے مرنے کے بعد اس سے ملایا جائے مثلاً اس کے بعد اس کے وارث دعویٰ کریں ( کہ یہ ہمارے مورث کا بچہ ہے ) تو آپ صلی اللہ علیہ وسلم نے اس میں یہ فیصلہ فرمایا: اگر وہ بچہ لونڈی کے پیٹ سے ہو لیکن وہ لونڈی اس کے والد کی ملکیت رہی ہو جس دن اس نے اس سے جماع کیا تھا تو ایسا بچہ یقیناً اپنے والد سے مل جائے گا، لیکن اس کو اس میراث میں سے حصہ نہ ملے گا جو اسلام کے زمانے سے پہلے جاہلیت کے زمانے میں اس کے والد کے دوسرے وارثوں نے تقسیم کر لی ہو، البتہ اگر ایسی میراث ہو جو ابھی تقسیم نہ ہوئی ہو تو اس میں سے وہ بھی حصہ پائے گا، لیکن اگر اس کے والد نے جس سے وہ اب ملایا جاتا ہے، اپنی زندگی میں اس سے انکار کیا ہو یعنی یوں کہا ہو کہ یہ میرا بچہ نہیں ہے، تو وارثوں کے ملانے سے وہ اب اس کا بچہ نہ ہو گا، اگر وہ بچہ ایسی لونڈی سے ہو جو اس مرد کی ملکیت نہ تھی، یا آزاد عورت سے ہو جس سے اس نے زنا کیا تھا تو اس کا نسب کبھی اس مرد سے ثابت نہ ہو گا، گو اس مرد کے وارث اس بچے کو اس مرد سے ملا دیں، اور وہ بچہ اس مرد کا وارث بھی نہ ہو گا، ( اس لیے کہ وہ ولدالزنا ہے ) گو کہ اس مرد نے خود اپنی زندگی میں بھی یہ کہا ہو کہ یہ میرا بچہ ہے، جب بھی وہ ولدالزنا ہی ہو گا، اور عورت کے کنبے والوں کے پاس رہے گا، خواہ وہ آزاد ہو یا لونڈی ۔ محمد بن راشد کہتے ہیں: اس سے مراد وہ میراث ہے جو اسلام سے پہلے جاہلیت میں تقسیم کر دی گئی ہو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2747,
			"arabicnumber": 2747,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حق ولاء ( میراث ) کو بیچنے اور اس کے ہبہ کرنے سے منع فرمایا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2748,
			"arabicnumber": 2748,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حق ولاء ( میراث ) کو بیچنے اور اس کو ہبہ کرنے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2749,
			"arabicnumber": 2749,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو میراث زمانہ جاہلیت میں تقسیم ہو چکی، وہ بدستور اس تقسیم پر رہے گی، اور جو میراث زمانہ اسلام آنے تک تقسیم نہیں ہوئی اسے اسلامی دستور کے مطابق تقسیم کیا جائے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2750,
			"arabicnumber": 2750,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بچہ پیدائش کے وقت رو دے تو اس پر نماز جنازہ پڑھی جائے گی، اور وہ وارث بھی ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2751,
			"arabicnumber": 2751,
			"text": "جابر بن عبداللہ اور مسور بن مخرمہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( ولادت کے وقت ) بچہ وارث نہیں ہو گا جب تک کہ وہ زور سے استہلال نہ کرے ۱؎۔ راوی کہتے ہیں: بچے کے استہلال کا مطلب یہ ہے کہ وہ روے یا چیخے یا چھینکے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2752,
			"arabicnumber": 2752,
			"text": "عبداللہ بن موہب کہتے ہیں کہ میں نے تمیم داری رضی اللہ عنہ کو کہتے سنا کہ میں نے عرض کیا: اللہ کے رسول! اہل کتاب کا کوئی آدمی اگر کسی کے ہاتھ پر مسلمان ہوتا ہے تو اس میں شرعی حکم کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: زندگی اور موت دونوں حالتوں میں وہ اس کا زیادہ قریبی ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		}
	]
}