{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"24": "The Chapters on Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2753,
			"arabicnumber": 2753,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے اس شخص کے لیے جو اس کی راہ میں نکلے، اور اسے اس کی راہ میں صرف جہاد اور اللہ تعالیٰ پر ایمان اور اس کے رسولوں کی تصدیق ہی نے نکالا ہو، ( تو اللہ تعالیٰ فرماتا ہے ) میں اس کے لیے ضمانت لیتا ہوں کہ اسے جنت میں داخل کروں، یا اجر و ثواب اور مال غنیمت کے ساتھ اس منزل تک لوٹا دوں جہاں سے وہ گیا تھا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، اگر مجھے مسلمانوں کے مشقت میں پڑ جانے کا ڈر نہ ہوتا تو میں کسی بھی سریہ ( لشکر ) کا جو اللہ کے راستے میں نکلتا ہے ساتھ نہ چھوڑتا، لیکن میرے پاس اتنی گنجائش نہیں کہ سب کی سواری کا انتظام کر سکوں، نہ لوگوں کے پاس اتنی فراخی ہے کہ وہ ہر جہاد میں میرے ساتھ رہیں، اور نہ ہی انہیں یہ پسند ہے کہ میں چلا جاؤں، اور وہ نہ جا سکیں، پیچھے رہ جائیں، قسم ہے اس ذات کی جس کے ہاتھ میں محمد کی جان ہے، میں چاہتا ہوں کہ اللہ کی راہ میں جہاد کروں، اور قتل کر دیا جاؤں، پھر جہاد کروں، اور قتل کر دیا جاؤں، پھر جہاد کروں، اور قتل کر دیا جاؤں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2754,
			"arabicnumber": 2754,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ کے راستے میں جہاد کرنے والے شخص کا اللہ تعالیٰ ضامن ہے، یا تو اسے اپنی رحمت و مغفرت میں ڈھانپ لے، یا ثواب اور مال غنیمت کے ساتھ اسے ( گھر ) واپس کرے، اللہ کے راستہ میں جہاد کرنے والے کی مثال نہ تھکنے والے صائم تہجد گزار کی ہے یہاں تک کہ وہ مجاہد گھر لوٹ آئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2755,
			"arabicnumber": 2755,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے راستے میں ایک صبح یا ایک شام ( کا وقت گزارنا ) دنیا اور اس کی ساری چیزوں سے بہتر ہے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2756,
			"arabicnumber": 2756,
			"text": "سہل بن سعد ساعدی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے راستے میں ایک صبح یا ایک شام ( کا وقت گزارنا ) دنیا اور اس کی ساری چیزوں سے بہتر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2757,
			"arabicnumber": 2757,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ کے راستے میں ایک صبح یا ایک شام ( کا وقت گزارنا ) دنیا اور اس کی ساری چیزوں سے بہتر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2758,
			"arabicnumber": 2758,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جو شخص اللہ کی راہ کے کسی مجاہد کو ساز و سامان سے لیس کر دے یہاں تک کہ اسے مزید کسی چیز کی ضرورت نہ رہ جائے تو اسے بھی اتنا ہی ثواب ملے گا جتنا مجاہد کو، یہاں تک کہ وہ مر جائے یا اپنے گھر لوٹ آئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2759,
			"arabicnumber": 2759,
			"text": "زید بن خالد جہنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص کسی مجاہد فی سبیل اللہ کو ساز و سامان سے لیس کر دے، اسے بھی اتنا ہی ثواب ملے گا جتنا اس مجاہد کو ملے گا، بغیر اس کے کہ اس کے ثواب میں کچھ کمی کی جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2760,
			"arabicnumber": 2760,
			"text": "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سب سے بہترین دینار جسے آدمی خرچ کرتا ہے وہ دینار ہے جسے اہل و عیال پر خرچ کرتا ہے، اور وہ دینار ہے جسے وہ اپنے جہاد فی سبیل اللہ کے گھوڑے پر خرچ کرتا ہے، نیز وہ دینار ہے جسے وہ اپنے مجاہد ساتھیوں پر خرچ کرتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2761,
			"arabicnumber": 2761,
			"text": "علی بن ابی طالب، ابوالدردا ء، ابوہریرہ، ابوامامہ باہلی، عبداللہ بن عمر، عبداللہ بن عمرو بن العاص، جابر بن عبداللہ اور عمران بن حصین رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص فی سبیل اللہ ( اللہ کی راہ میں ) خرچ بھیجے، اور اپنے گھر بیٹھا رہے تو اس کے لیے ہر درہم کے بدلے سات سو درہم ہیں، اور جو شخص فی سبیل اللہ ( اللہ کے راستے میں ) بذات خود جہاد کرنے نکلے، اور خرچ کرے، تو اسے ہر درہم کے بدلے سات لاکھ درہم کا ثواب ملے گا، پھر آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی: «والله يضاعف لمن يشاء» اور اللہ تعالیٰ جیسے چاہے دو گنا کر دے ( سورۃ البقرہ: ۲۶۱ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2762,
			"arabicnumber": 2762,
			"text": "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص نہ غزوہ کرے، نہ کسی غازی کے لیے سامان جہاد کا انتظام کرے، اور نہ ہی کسی غازی کی غیر موجودگی میں اس کے گھربار کی بھلائی کے ساتھ نگہبانی کرے، تو اللہ تعالیٰ قیامت آنے سے قبل اسے کسی مصیبت میں مبتلا کر دے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2763,
			"arabicnumber": 2763,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اللہ تعالیٰ سے اس حال میں ملے کہ اس پر جہاد فی سبیل اللہ کا کوئی نشان نہ ہو، تو وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ اس میں نقصان ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2764,
			"arabicnumber": 2764,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم غزوہ تبوک سے لوٹے، اور مدینہ کے نزدیک پہنچے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: مدینہ میں کچھ ایسے لوگ ہیں کہ جس راہ پر تم چلے اور جس وادی سے بھی تم گزرے وہ تمہارے ہمراہ رہے ، صحابہ کرام رضی اللہ عنہم نے عرض کیا: مدینہ میں رہ کر بھی وہ ہمارے ساتھ رہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں، مدینہ میں رہ کر بھی، عذر نے انہیں روک رکھا تھا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2765,
			"arabicnumber": 2765,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مدینہ میں کچھ ایسے لوگ ہیں کہ تم جس وادی سے بھی گزرے، یا جس راہ پر چلے ثواب میں ہر جگہ وہ تمہارے شریک رہے، انہیں عذر نے روک رکھا تھا ۔ ابن ماجہ کہتے ہیں: ایسا ہی کچھ احمد بن سنان نے کہا میں نے اسے لفظ بلفظ لکھ لیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2766,
			"arabicnumber": 2766,
			"text": "عبداللہ بن زبیر رضی اللہ عنہما کہتے ہیں کہ عثمان بن عفان رضی اللہ عنہ نے لوگوں میں خطبہ دیا اور فرمایا: لوگو! میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک حدیث سنی ہے جو میں نے تم سے صرف اس لیے نہیں بیان کی کہ میں تمہارا اور تمہارے ساتھ رہنے کا بہت حریص ہوں ۱؎، اب اس پر عمل کرنے اور نہ کرنے کا اختیار ہے، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جس نے اللہ کے راستے میں ایک رات بھی سرحد پر پڑاؤ ڈالا، تو اسے ہزار راتوں کے صیام و قیام کے مثل ثواب ملے گا ۔",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2767,
			"arabicnumber": 2767,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اللہ کے راستے میں «رباط» ( سرحد پر پڑاؤ ڈالے ہوئے ) مر جائے، تو جو وہ نیک عمل کرتا تھا اس کا ثواب اس کے لیے جاری رہے گا، جنت میں سے اس کا رزق مقرر ہو گا، قبر کے فتنہ سے محفوظ رہے گا، اور اللہ تعالیٰ اسے قیامت کے دن ہر ڈر اور گھبراہٹ سے محفوظ اٹھائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2768,
			"arabicnumber": 2768,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ثواب کی نیت سے مسلمانوں کے ناکے پر ( جہاں سے دشمن کے حملہ آور ہونے کا ڈر ہو ) اللہ کی راہ میں سرحد پر ایک دن پڑاؤ کی حفاظت کا ثواب غیر رمضان میں سو سال کے روزوں، اور ان کے قیام اللیل صیام سے بڑھ کر ہے، اور اللہ کے راستے میں مسلمانوں کے ناکے پر ثواب کی نیت سے رمضان میں ایک دن کی سرحد کی نگرانی کا ثواب ہزار سال کے نماز سے بڑھ کر ہے، پھر اگر اللہ تعالیٰ نے اسے صحیح سالم گھر لوٹا دیا تو ایک ہزار سال تک اس کی برائیاں نہیں لکھی جائیں گی، نیکیاں لکھی جائیں گی، اور قیامت تک «رباط» کا ثواب جاری رہے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2769,
			"arabicnumber": 2769,
			"text": "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ لشکر کے پہرہ دار پر رحم فرمائے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2770,
			"arabicnumber": 2770,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہو ے سنا: اللہ کی راہ میں ایک رات پہرہ دینا، کسی آدمی کے اپنے گھر میں رہ کر ایک ہزار سال کے صوم و صلاۃ سے بڑھ کر ہے، سال تین سو ساٹھ دن کا ہوتا ہے، جس کا ہر دن ہزار سال کے برابر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2771,
			"arabicnumber": 2771,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص سے فرمایا: میں تمہیں اللہ سے ڈرتے رہنے، اور ہر اونچی زمین پر اللہ اکبر کہنے کی وصیت کرتا ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2772,
			"arabicnumber": 2772,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کا ذکر کیا تو انہوں نے کہا: آپ سب سے زیادہ خوبصورت، سخی اور بہادر تھے، ایک رات مدینہ والے گھبرا اٹھے، اور سب لوگ آواز کی جانب نکل پڑے تو راستے ہی میں رسول اللہ صلی اللہ علیہ وسلم سے ملاقات ہو گئی، آپ ان سے پہلے اکیلے ہی آواز کی طرف چل پڑے تھے ۱؎، اور ابوطلحہ رضی اللہ عنہ کے ننگی پیٹھ اور بغیر زین والے گھوڑے پر سوار تھے، اور اپنی گردن میں تلوار ٹکائے ہوئے تھے، آپ صلی اللہ علیہ وسلم فرما رہے تھے: لوگو! ڈر کی کوئی بات نہیں ہے ، یہ کہہ کر آپ لوگوں کو واپس لوٹا رہے تھے، پھر آپ صلی اللہ علیہ وسلم نے گھوڑے کے متعلق فرمایا: ہم نے اسے سمندر پایا، یا واقعی یہ تو سمندر ہے ۔ حماد کہتے ہیں: مجھ سے ثابت نے یا کسی اور نے بیان کیا کہ وہ گھوڑا ابوطلحہ رضی اللہ عنہ کا تھا، جو سست رفتار تھا لیکن اس دن کے بعد سے وہ کبھی کسی گھوڑے سے پیچھے نہیں رہا ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2773,
			"arabicnumber": 2773,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تمہیں جہاد کے لیے نکلنے کا حکم دیا جائے تو فوراً نکل کھڑے ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2774,
			"arabicnumber": 2774,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ کی راہ کا غبار، اور جہنم کا دھواں، دونوں کسی مسلمان کے پیٹ میں اکٹھا نہ ہوں گے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2775,
			"arabicnumber": 2775,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہعلیہ وسلم نے فرمایا: جو شخص ایک شام بھی اللہ کی راہ میں چلا، تو جتنا غبار اس پر پڑا قیامت کے دن اس کے لیے اتنی ہی مشک ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2776,
			"arabicnumber": 2776,
			"text": "انس بن مالک رضی اللہ عنہ اپنی خالہ ام حرام بنت ملحان رضی اللہ عنہا سے روایت کرتے ہیں وہ کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک روز میرے قریب سوئے، پھر آپ صلی اللہ علیہ وسلم مسکراتے ہوئے بیدار ہوئے، میں نے پوچھا: اللہ کے رسول! آپ کس بات پر مسکرا رہے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: میری امت کے کچھ لوگ میرے سامنے لائے گئے جو اس سمندر کے اوپر اس طرح سوار ہو رہے ہیں جیسے بادشاہ تختوں پر بیٹھتے ہیں ، ام حرام رضی اللہ عنہا نے کہا: اللہ سے آپ دعا کر دیجئیے کہ وہ مجھے بھی ان ہی لوگوں میں سے کر دے، انس رضی اللہ عنہ کہتے ہیں کہ آپ صلی اللہ علیہ وسلم نے ان کے لیے دعا فرما دی، پھر آپ صلی اللہ علیہ وسلم دوبارہ سو گئے، پھر ویسے ہی ہوا، آپ اٹھے تو ہنستے ہوئے، اور ام حرام رضی اللہ عنہا نے وہی پوچھا جو پہلی بار پوچھا تھا، اور آپ صلی اللہ علیہ وسلم نے انہیں وہی جواب دیا جو پہلی بار دیا تھا، اس بار بھی انہوں نے عرض کیا: آپ اللہ سے دعا کر دیجئیے کہ وہ مجھے بھی انہی لوگوں میں سے کر دے، آپ صلی اللہ علیہ وسلم نے فرمایا: تم پہلے لوگوں میں سے ہو ۔ انس رضی اللہ عنہ بیان کرتے ہیں کہ وہ اپنے شوہر عبادہ بن صامت رضی اللہ عنہ کے ہمراہ جہاد کے لیے نکلیں، یہ پہلا موقع تھا کہ معاویہ بن ابی سفیان رضی اللہ عنہما کے ساتھ مسلمان بحری جہاد پر گئے تھے چنانچہ جب لوگ جہاد سے لوٹ رہے تھے تو شام میں رکے، ام حرام رضی اللہ عنہا کی سواری کے لیے ایک جانور لایا گیا، جس نے انہیں گرا دیا، اور وہ فوت ہو گئیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2777,
			"arabicnumber": 2777,
			"text": "ابو الدرداء رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ایک بحری ( سمندری ) جہاد دس بری جہادوں کے برابر ہے، اور سمندر میں جس کا سر چکرائے وہ اس شخص کی طرح ہے جو اللہ کے راستے میں اپنے خون میں لوٹ رہا ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2778,
			"arabicnumber": 2778,
			"text": "ابواسامہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: سمندر کا شہید خشکی کے دو شہیدوں کے برابر ہے، سمندر میں جس کا سر چکرائے وہ خشکی میں اپنے خون میں لوٹنے والے کی مانند ہے، اور ایک موج سے دوسری موج تک جانے والا اللہ کی اطاعت میں پوری دنیا کا سفر کرنے والے کی طرح ہے، اللہ تعالیٰ نے روح قبض کرنے کے لیے ملک الموت ( عزرائیل ) کو مقرر کیا ہے، لیکن سمندر کے شہید کی جان اللہ تعالیٰ خود قبض کرتا ہے، خشکی میں شہید ہونے والے کے قرض کے علاوہ تمام گناہ معاف ہو جاتے ہیں، لیکن سمندر کے شہید کے قرض سمیت سارے گناہ معاف ہوتے ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2779,
			"arabicnumber": 2779,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر دنیا کی عمر کا صرف ایک دن باقی رہا تو اللہ تعالیٰ اس دن کو اتنا لمبا کر دے گا کہ میرے خاندان کے ایک فرد کی حکومت قائم ہو، اور پھر وہ دیلم پہاڑ اور شہر قسطنطنیہ پر قابض ہو جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2780,
			"arabicnumber": 2780,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب تم ملکوں کو فتح کرو گے اور عنقریب تم ایک ایسا شہر فتح کرو گے جسے قزوین کہا جاتا ہے جو اس میں چالیس دن یا چالیس رات سرحد کی نگرانی کرے گا، اس کے لیے جنت میں سونے کا ایک ستون ہو گا، جس پر سبز زمرد لگا ہو گا، پھر اس ستون پر سرخ یا قوت کا قبہ ہو گا جس کے ستر ہزار سونے کے چوکھٹے ( دروازے ) ہوں گے، اور ہر چوکھٹے پر بڑی بڑی آنکھوں والی حوروں میں سے ایک بیوی ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2781,
			"arabicnumber": 2781,
			"text": "معاویہ بن جاہمہ سلمی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہو کر عرض کیا: میں اللہ کی رضا اور دار آخرت کی بھلائی کے لیے آپ کے ساتھ جہاد کرنا چاہتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: افسوس، کیا تمہاری ماں زندہ ہے؟ میں نے کہا: ہاں، آپ صلی اللہ علیہ وسلم نے فرمایا: واپس جاؤ، اور اپنی ماں کی خدمت کرو پھر میں دوسری جانب سے آیا، اور میں نے عرض کیا: میں اللہ کی رضا جوئی اور دار آخرت کی خاطر آپ کے ساتھ جہاد کا ارادہ رکھتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تیری ماں زندہ ہے ؟ میں نے پھر کہا: ہاں! اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: اس کے پاس واپس چلے جاؤ اور اس کی خدمت کرو ، پھر میں آپ صلی اللہ علیہ وسلم کے سامنے سے آیا اور آپ سے عرض کیا: اللہ کے رسول! میں نے اللہ کی رضا اور دار آخرت کے لیے آپ کے ساتھ جہاد کا ارادہ کیا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: افسوس، کیا تمہاری ماں زندہ ہے؟ میں نے جواب دیا: ہاں! اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: افسوس! اس کے پیر کے پاس رہو، وہیں جنت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2782,
			"arabicnumber": 2782,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص آیا، اور اس نے عرض کیا: میں آپ کے ساتھ جہاد کے ارادے سے آیا ہوں، جس سے میرا مقصد رضائے الٰہی اور آخرت کا ثواب ہے، لیکن میں اپنے والدین کو روتے ہوئے چھوڑ کر آیا ہوں آپ صلی اللہ علیہ وسلم نے فرمایا: ان کے پاس واپس لوٹ جاؤ اور جس طرح تم نے انہیں رلایا ہے اسی طرح انہیں ہنساؤ ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2783,
			"arabicnumber": 2783,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے اس شخص کے بارے میں پوچھا گیا جو بہادری کی شہرت کے لیے لڑتا ہے، اور جو خاندانی عزت کی خاطر لڑتا ہے، اور جس کا مقصد ریا و نمود ہوتا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ کے کلمے کی بلندی کے مقصد سے جو لڑتا ہے وہی مجاہد فی سبیل اللہ ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2784,
			"arabicnumber": 2784,
			"text": "ابوعقبہ رضی اللہ عنہ جو کہ اہل فارس کے غلام تھے کہتے ہیں کہ میں جنگ احد میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ حاضر تھا، میں نے ایک مشرک پر یہ کہتے ہوئے حملہ کیا کہ لے میرا یہ وار، میں فارسی جوان ہوں، اس کی خبر جب نبی اکرم صلی اللہ علیہ وسلم کو پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے یہ کیوں نہیں کہا کہ لے میرا یہ وار اور میں انصاری نوجوان ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2785,
			"arabicnumber": 2785,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہو ے سنا: لشکر کی جو ٹکڑی اللہ کی راہ میں جہاد کرے اور مال غنیمت پا لے، تو سمجھو اس نے ثواب کا دو تہائی حصہ تو دنیا ہی میں حاصل کر لیا، لیکن اگر مال غنیمت نہیں ملتا تو ان کے لیے پورا ثواب ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2786,
			"arabicnumber": 2786,
			"text": "عروہ بارقی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: گھوڑوں کی پیشانی پر قیامت تک خیر و برکت بندھی ہوئی ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2787,
			"arabicnumber": 2787,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: گھوڑوں کی پیشانیوں میں قیامت تک خیر و برکت بندھی ہوئی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: گھوڑوں کی پیشانی میں بھلائی ہے یا فرمایا: گھوڑوں کی پیشانی میں قیامت تک خیر اور بھلائی بندھی ہوئی ہے، گھوڑے تین طرح کے ہوتے ہیں، ایک شخص کے لیے وہ اجر و ثواب ہیں، ایک کے لیے ستر ( پردہ ) ہیں، اور ایک کے واسطے عذاب ہیں، ( پھر آپ نے تفصیل بیان کی ) اس شخص کے لیے تو باعث اجر و ثواب ہیں جو انہیں اللہ کی راہ میں جہاد کی غرض سے رکھے، اور انہیں تیار کرے، چنانچہ ان کے پیٹ میں جو چیز بھی جائے گی وہ اس شخص کے لیے نیکی شمار ہو گی، اگر وہ انہیں گھاس والی زمین میں بھی چرائے گا تو جو وہ کھائیں گے اس کا ثواب اسے ملے گا، اگر وہ انہیں بہتی نہر سے پانی پلائے گا تو پیٹ میں جانے والے ہر قطرے کے بدلے اسے ثواب ملے گا، حتیٰ کہ آپ نے ان کے پیشاب اور لید ( گوبر ) میں بھی ثواب بتایا، اگر وہ ایک یا دو میل دوڑیں تو بھی ہر قدم کے بدلے جسے وہ اٹھائیں گے ثواب ملے گا، اور جس شخص کے لیے گھوڑے ستر ( پردہ ) ہیں وہ ہے جو انہیں عزت اور زینت کی غرض سے رکھتا ہے، لیکن ان کی پیٹھ اور پیٹ کے حق سے تنگی اور آسانی کسی حال میں غافل نہیں رہتا، لیکن جس شخص کے حق میں یہ گھوڑے گناہ ہیں وہ شخص ہے جو غرور، تکبر، فخر اور ریا و نمود کی خاطر انہیں رکھتا ہے، تو یہی وہ گھوڑے ہیں جو اس کے حق میں گناہ ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2789,
			"arabicnumber": 2789,
			"text": "ابوقتادہ انصاری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کالا گھوڑا جس کی پیشانی، ہاتھ، پیر، ناک اور اوپر کا ہونٹ سفید ہوں، اور دایاں ہاتھ باقی جسم کی طرح ہو، سب سے عمدہ ہے، اگر وہ کالا نہ ہو تو انہیں صفات والا سرخ سیاہی مائل گھوڑا عمدہ ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": 2790,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم ایسے گھوڑے کو ناپسند فرماتے تھے جس کے تین پیر سفید اور ایک پیر کا رنگ باقی جسم کا ہو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2791,
			"arabicnumber": 2791,
			"text": "تمیم داری رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جس نے اللہ کے راستے میں جہاد کی غرض سے گھوڑا باندھا، پھر دانہ چارہ اپنے ہاتھ سے کھلایا، تو اس کے لیے ہر دانے کے بدلے ایک نیکی ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2792,
			"arabicnumber": 2792,
			"text": "معاذ بن جبل رضی اللہ عنہ بیان کرتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہو ے سنا: جو مسلمان شخص اللہ کے راستے میں اونٹنی کا دودھ دوھنے کے درمیانی وقفہ کے برابر لڑا، اس کے لیے جنت واجب ہو گئی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2793,
			"arabicnumber": 2793,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں ایک لڑائی میں حاضر ہوا، تو عبداللہ بن رواحہ رضی اللہ عنہ نے کہا: اے میرے نفس! میرا خیال ہے کہ تجھے جنت میں جانا ناپسند ہے، میں اللہ کی قسم کھا کر کہتا ہوں کہ تجھے جنت میں خوشی یا ناخوشی سے جانا ہی پڑے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2794,
			"arabicnumber": 2794,
			"text": "عمرو بن عبسہ رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور میں نے آپ صلی اللہ علیہ وسلم سے پوچھا: اللہ کے رسول! کون سا جہاد افضل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جس میں مجاہد کا خون بہا دیا جائے، اور جس کے گھوڑے کو بھی زخمی کر دیا جائے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے راستے میں زخمی ہونے والا شخص ( اور اللہ تعالیٰ ہی بہتر جانتا ہے کہ اس کے راستے میں کون زخمی ہو رہا ہے ) قیامت کے دن اس حال میں آئے گا کہ اس کا زخم بالکل اسی دن کی طرح تازہ ہو گا جس دن وہ زخمی ہوا تھا، رنگ تو خون ہی کا ہو گا، لیکن خوشبو مشک کی سی ہو گی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2796,
			"arabicnumber": 2796,
			"text": "عبداللہ بن ابی اوفی رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ( کفار کے ) گروہوں پر بد دعا کی، اور یوں فرمایا: اے اللہ! کتاب کے نازل فرمانے والے، جلد حساب لینے والے، گروہوں کو شکست دے، اے اللہ! انہیں شکست دے، اور جھنجوڑ کر رکھ دے ( کہ وہ پریشان و بے قرار ہو کر بھاگ کھڑے ہوں ) ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2797,
			"arabicnumber": 2797,
			"text": "سہل بن حنیف رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو شخص سچے دل سے اللہ تعالیٰ سے شہادت کا طالب ہو، اللہ تعالیٰ اسے شہیدوں کے مرتبے پر پہنچا دے گا، گرچہ وہ اپنے بستر ہی پر فوت ہوا ہو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2798,
			"arabicnumber": 2798,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے سامنے شہیدوں کا ذکر آیا، تو آپ نے فرمایا: زمین شہید کا خون خشک بھی نہیں کر پاتی کہ اس کی دونوں بیویاں ان دائیوں کی طرح اس پر جھپٹتی ہیں، جنہوں نے غیر آباد مقام میں اپنے بچے کھو دئیے ہوں، ہر بیوی کے ہاتھ میں ایسا جوڑا ہوتا ہے جو دنیا اور دنیا کی تمام نعمتوں سے بہتر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2799,
			"arabicnumber": 2799,
			"text": "مقدام بن معد یکرب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ کے یہاں شہید کے لیے چھ بھلائیاں ہیں: ۱- خون کی پہلی ہی پھوار پر اس کی مغفرت ہو جاتی ہے، اور جنت میں اس کو اپنا ٹھکانا نظر آ جاتا ہے ۲- عذاب قبر سے محفوظ رہتا ہے، ۳- حشر کی بڑی گھبراہٹ سے مامون و بےخوف رہے گا، ۴- ایمان کا جوڑا پہنایا جاتا ہے، ۵- حورعین سے نکاح کر دیا جاتا ہے، ۶- اس کے اعزہ و اقرباء میں سے ستر آدمیوں کے بارے میں اس کی سفارش قبول کی جاتی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2800,
			"arabicnumber": 2800,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ جب جنگ احد میں ( ان کے والد ) عبداللہ بن عمرو بن حرام رضی اللہ عنہ قتل کر دئیے گئے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جابر! اللہ تعالیٰ نے تمہارے والد سے جو فرمایا ہے کیا میں تمہیں وہ نہ بتاؤں ؟ میں نے کہا: کیوں نہیں! ضرور بتائیے، آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے جب بھی کسی سے بات کی تو پردہ کے پیچھے سے لیکن تمہارے والد سے آمنے سامنے بات کی، اور کہا: اے میرے بندے! مجھ سے اپنی خواہش کا اظہار کرو، میں تجھے عطا کروں گا، انہوں نے کہا: اے میرے رب! تو مجھے دوبارہ زندہ کر دے کہ میں دوبارہ تیرے راستے میں مارا جاؤں، اللہ تعالیٰ نے فرمایا: اس بات کا پہلے ہی فیصلہ ہو چکا ہے کہ دنیا میں دوبارہ لوٹایا نہیں جائے گا، انہوں نے کہا: اے میرے رب! میرے پسماندگان کو ( میرا حال ) پہنچا دے، تو یہ آیت نازل ہوئی: «ولا تحسبن الذين قتلوا في سبيل الله أمواتا» ( سورۃ آل عمران: ۱۶۹ ) جو لوگ اللہ کی راہ میں مارے گئے انہیں تم مردہ مت سمجھو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2801,
			"arabicnumber": 2801,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ ہم نے اللہ تعالیٰ کے فرمان: «ولا تحسبن الذين قتلوا في سبيل الله أمواتا بل أحياء عند ربهم يرزقون» کے بارے میں ( رسول اللہ صلی اللہ علیہ وسلم سے ) سوال کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: شہداء کی روحیں سبز چڑیوں کی شکل میں جنت میں جہاں چاہیں چلتی پھرتی ہیں، پھر شام کو عرش سے لٹکی ہوئی قندیلوں میں بسیرا کرتی ہیں، ایک بار کیا ہوا کہ روحیں اسی حال میں تھیں کہ اللہ تعالیٰ نے ان کی طرف جھانکا پھر فرمانے لگا: تمہیں جو چاہیئے مانگو، روحوں نے کہا: ہم جنت میں جہاں چاہتی ہیں چلتی پھرتی ہیں، اس سے بڑھ کر کیا مانگیں؟ جب انہوں نے دیکھا کہ بغیر مانگے خلاصی نہیں تو کہنے لگیں: ہمارا سوال یہ ہے کہ تو ہماری روحوں کو دنیاوی جسموں میں لوٹا دے کہ ہم پھر تیرے راستے میں قتل کئے جائیں، اللہ تعالیٰ نے جب دیکھا کہ وہ اس کے علاوہ اور کچھ نہیں مانگ رہی ہیں تو چھوڑ دیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2802,
			"arabicnumber": 2802,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: شہید کو قتل سے اتنی ہی تکلیف ہوتی ہے جتنی کہ تمہیں چیونٹی کاٹنے سے ہوتی ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2803,
			"arabicnumber": 2803,
			"text": "جابر بن عتیک رضی اللہ عنہ سے روایت ہے کہ وہ بیمار ہوئے تو نبی اکرم صلی اللہ علیہ وسلم بیمار پرسی ( عیادت ) کے لیے تشریف لائے، ان کے اہل خانہ میں سے کسی نے کہا: ہمیں تو یہ امید تھی کہ وہ اللہ کے راستے میں شہادت کی موت مریں گے، اس پر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تب تو میری امت کے شہداء کی تعداد بہت کم ہے! ( نہیں ایسی بات نہیں بلکہ ) اللہ کے راستے میں قتل ہونا شہادت ہے، مرض طاعون میں مر جانا شہادت ہے، عورت کا زچگی ( جننے کی حالت ) میں مر جانا شہادت ہے، ڈوب کر یا جل کر مر جانا شہادت ہے، نیز پسلی کے ورم میں مر جانا شہادت ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2804,
			"arabicnumber": 2804,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے پوچھا: تم شہید کسے سمجھتے ہو ؟ لوگوں نے جواب دیا: اللہ کے راستے میں مارا جانا ( شہادت ہے ) فرمایا: تب تو میری امت میں بہت کم شہید ہوں گے ! ( پھر آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں ایسی بات نہیں بلکہ ) جو اللہ کے راستے میں مارا جائے وہ شہید ہے، جو اللہ کے راستے میں مر جائے وہ بھی شہید ہے، پیٹ کی بیماری میں مرنے والا بھی شہید ہے، طاعون کے مرض میں مرنے والا شہید ہے ۔ سہیل کہتے ہیں: مجھے عبیداللہ بن مقسم نے خبر دی وہ ابوصالح سے روایت کرتے ہیں، اس میں یہ لفظ زیادہ ہے: اور ڈوب کر مرنے والا بھی شہید ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2805,
			"arabicnumber": 2805,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم فتح مکہ کے دن اس حال میں مکہ داخل ہوئے کہ آپ کے سر پر خود تھا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2806,
			"arabicnumber": 2806,
			"text": "سائب بن یزید رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے غزوہ احد کے موقعہ پر اوپر نیچے دو زرہیں پہنیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2807,
			"arabicnumber": 2807,
			"text": "سلیمان بن حبیب کہتے ہیں کہ ہم ابوامامہ رضی اللہ عنہ کے پاس گئے، تو وہ ہماری تلواروں میں چاندی کا کچھ زیور دیکھ کر غصہ ہو گئے، اور کہنے لگے: لوگوں ( صحابہ کرام ) نے بہت ساری فتوحات کیں، لیکن ان کی تلواروں کا زیور سونا چاندی نہ تھا، بلکہ سیسہ، لوہا اور علابی تھا۔ ابوالحسن قطان کہتے ہیں: علابی: اونٹ کا پٹھا ( چمڑا ) ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2808,
			"arabicnumber": 2808,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جنگ بدر کے دن اپنی ذوالفقار نامی تلوار ( علی رضی اللہ عنہ کو ) انعام میں دی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2809,
			"arabicnumber": 2809,
			"text": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ مغیرہ بن شعبہ رضی اللہ عنہ جب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جہاد کے لیے جاتے تو اپنے ساتھ برچھا لے جاتے، اور لوٹتے وقت اسے پھینک دیتے، انہیں دینے کے لیے کوئی اسے اٹھا لاتا، اس پر علی رضی اللہ عنہ نے کہا: آپ کی یہ حرکت میں رسول اللہ صلی اللہ علیہ وسلم کو ضرور بتاؤں گا، تو مغیرہ بن شعبہ رضی اللہ عنہ نے کہا: ایسا نہ کریں، کیونکہ اگر آپ نے ایسا کیا تو گمشدہ چیز اٹھائی نہیں جائے گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2810,
			"arabicnumber": 2810,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے مبارک ہاتھوں میں ایک عربی کمان تھی، اور ایک شخص کے ہاتھ میں آپ نے فارسی کمان دیکھی تو فرمایا: یہ کیا ہے؟ اسے پھینک دو، اور اس طرح کی رکھو، اور نیزے رکھو کیونکہ اللہ تعالیٰ تمہارے لیے ان دونوں کے ذریعہ سے دین کو ترقی دے گا، اور تمہیں دوسرے ملکوں کو فتح کرنے پر قادر بنا دے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2811,
			"arabicnumber": 2811,
			"text": "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ایک تیر کے سبب اللہ تعالیٰ تین آدمیوں کو جنت میں داخل کرے گا: ثواب کی نیت سے اس کے بنانے والے کو، چلانے والے کو، اور ترکش سے نکال نکال کر دینے والے کو ، نیز آپ صلی اللہ علیہ وسلم نے فرمایا: تیر اندازی کرو، اور سواری کا فن سیکھو، میرے نزدیک تیر اندازی سیکھنا سواری کا فن سیکھنے سے بہتر ہے، مسلمان آدمی کا ہر کھیل باطل ہے سوائے تیر اندازی، گھوڑے کے سدھانے، اور اپنی بیوی کے ساتھ کھیلنے کے، کیونکہ یہ تینوں کھیل سچے ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2812,
			"arabicnumber": 2812,
			"text": "عمرو بن عبسہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: جو دشمن کو تیر مارے، اور اس کا تیر دشمن تک پہنچے، ٹھیک لگے یا چوک جائے، تو اس کا ثواب ایک غلام آزاد کرنے کے برابر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2813,
			"arabicnumber": 2813,
			"text": "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر آیت کریمہ: «وأعدوا لهم ما استطعتم من قوة» ( سورۃ الانفال: ۶۰ ) دشمن کے لیے طاقت بھر تیاری کرو کو پڑھتے ہوئے سنا: ( اس کے بعد آپ صلی اللہ علیہ وسلم فرما رہے تھے: ) آگاہ رہو! طاقت کا مطلب تیر اندازی ہی ہے یہ جملہ آپ صلی اللہ علیہ وسلم نے تین بار فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2814,
			"arabicnumber": 2814,
			"text": "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: جس نے تیر اندازی سیکھی پھر اسے چھوڑ دیا، تو اس نے میری نافرمانی کی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2815,
			"arabicnumber": 2815,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کچھ لوگوں کے پاس سے گزرے جو تیر اندازی کر رہے تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا: اسماعیل کی اولاد! تیر اندازی کرو، تمہارے والد ( اسماعیل ) بڑے تیر انداز تھے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2816,
			"arabicnumber": 2816,
			"text": "حارث بن حسان رضی اللہ عنہ کہتے ہیں کہ میں مدینہ آیا تو نبی اکرم صلی اللہ علیہ وسلم کو منبر پر کھڑے دیکھا، اور بلال رضی اللہ عنہ آپ کے سامنے گلے میں تلوار ٹکائے ہوئے تھے، پھر اچانک ایک کالا بڑا جھنڈا دکھائی دیا، میں نے کہا: یہ کون ہیں؟ لوگوں نے بتایا کہ یہ عمرو بن العاص رضی اللہ عنہ ہیں جو ایک غزوہ سے واپس آئے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2817,
			"arabicnumber": 2817,
			"text": "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم فتح مکہ کے دن مکہ میں داخل ہوئے تو آپ کا جھنڈا سفید تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2818,
			"arabicnumber": 2818,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا بڑا جھنڈا کالا اور چھوٹا جھنڈا سفید تھا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2819,
			"arabicnumber": 2819,
			"text": "اسماء بنت ابی بکر رضی اللہ عنہما سے روایت ہے کہ انہوں نے ریشم کی گھنڈیاں لگا ہوا جبہ نکالا اور کہنے لگیں: دشمن سے مقابلہ کے وقت نبی اکرم صلی اللہ علیہ وسلم اسے پہنتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2820,
			"arabicnumber": 2820,
			"text": "عمر رضی اللہ عنہ سے روایت ہے کہ وہ حریر اور دیباج ( ریشمی کپڑوں کے استعمال ) سے منع کرتے تھے مگر جو اتنا ہو، پھر انہوں نے اپنی انگلی سے اشارہ کیا، پھر دوسری سے پھر تیسری سے پھر چوتھی سے، اور فرمایا: رسول اللہ صلی اللہ علیہ وسلم اس سے ہمیں منع فرمایا کرتے تھے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2821,
			"arabicnumber": 2821,
			"text": "عمرو بن حریث رضی اللہ عنہ کہتے ہیں: گویا کہ میں رسول اللہ صلی اللہ علیہ وسلم کی طرف دیکھ رہا ہوں آپ کے سر پر سیاہ عمامہ ( کالی پگڑی ) ہے جس کے دونوں کنارے آپ اپنے دونوں کندھوں کے درمیان لٹکائے ہوئے ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2822,
			"arabicnumber": 2822,
			"text": "جابر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم مکہ مکرمہ میں اس حال میں داخل ہوئے کہ آپ کے سر پر کالی پگڑی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2823,
			"arabicnumber": 2823,
			"text": "خارجہ بن زید کہتے ہیں کہ میں نے ایک شخص کو اپنے والد سے اس شخص کے بارے میں سوال کرتے دیکھا، جو جہاد کرنے جائے اور وہاں خرید و فروخت کرے اور تجارت کرے، تو میرے والد نے اسے جواب دیا: ہم جنگ تبوک میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے آپ ہمیں خرید و فروخت کرتے دیکھتے لیکن منع نہ فرماتے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2824,
			"arabicnumber": 2824,
			"text": "معاذ بن انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ کے راستے میں جہاد کرنے والے شخص کو صبح یا شام رخصت کروں، اور اسے سواری پر بٹھاؤں، یہ میرے نزدیک دنیا اور اس کی تمام نعمتوں سے بہتر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2825,
			"arabicnumber": 2825,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے رخصت کیا تو یہ دعا فرمائی: «أستودعك الله الذي لا تضيع ودائعه» میں تمہیں اللہ کے سپرد کرتا ہوں جس کی امانتیں ضائع نہیں ہوتیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2826,
			"arabicnumber": 2826,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب کوئی لشکر روانہ فرماتے تو جانے والے کے لیے اس طرح دعا کرتے، «أستودع الله دينك وأمانتك وخواتيم عملك» میں تیرے دین، تیری امانت، اور تیرے آخری اعمال کو اللہ کے سپرد کرتا ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2827,
			"arabicnumber": 2827,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اکثم بن جون خزاعی رضی اللہ عنہ سے فرمایا: اکثم! اپنی قوم کے علاوہ دوسرے لوگوں کے ہمراہ جہاد کرو، تمہارے اخلاق اچھے ہو جائیں گے، اور تمہارے ساتھیوں میں تمہاری عزت ہو گی، اکثم! چار ساتھی بہتر ہیں، بہترین دستہ چار سو سپاہیوں کا ہے، اور بہترین لشکر چار ہزار کا ہے، نیز بارہ ہزار کا لشکر کبھی کم تعداد کی وجہ سے مغلوب نہیں ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2828,
			"arabicnumber": 2828,
			"text": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ ہم برابر گفتگو کرتے رہتے تھے کہ غزوہ بدر میں صحابہ کی تعداد تین سو دس سے کچھ اوپر تھی، اور یہی تعداد طالوت کے ان ساتھیوں کی بھی تھی جنہوں نے ان کے ساتھ نہر پار کی ( یاد رہے کہ ) ان کے ساتھ صرف اسی شخص نے نہر پار کی تھی جو ایمان والا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2829,
			"arabicnumber": 2829,
			"text": "نبی اکرم صلی اللہ علیہ وسلم کے صحابی ابوالورد رضی اللہ عنہ کہتے ہیں کہ اس فوجی دستے میں شرکت سے بچو جس کی دشمن سے مڈبھیڑ ہو تو وہ بھاگ کھڑا ہو، اور اگر مال غنیمت حاصل ہو تو اس میں خیانت کرے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2830,
			"arabicnumber": 2830,
			"text": "ہلب رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہعلیہ وسلم سے نصاریٰ کے کھانے کے متعلق سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: کسی کھانے سے متعلق تمہارے دل میں وسوسہ نہ آنا چاہیئے، ورنہ یہ نصاریٰ کی مشابہت ہو جائے گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2831,
			"arabicnumber": 2831,
			"text": "ابوثعلبہ خشنی رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوا تو میں نے سوال کیا: اللہ کے رسول! کیا ہم مشرکین کی ہانڈیوں میں کھانا پکا سکتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ان میں نہ پکاؤ میں نے کہا: اگر اس کی ضرورت پیش آ جائے اور ہمارے لیے کوئی چارہ کار ہی نہ ہو؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: تب تم انہیں اچھی طرح دھو لو، پھر پکاؤ اور کھاؤ ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2832,
			"arabicnumber": 2832,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہم کسی مشرک سے مدد نہیں لیتے ۔ علی بن محمد نے اپنی روایت میں عبداللہ بن یزید یا زید کہا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2833,
			"arabicnumber": 2833,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جنگ دھوکہ ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2834,
			"arabicnumber": 2834,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جنگ دھوکہ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2835,
			"arabicnumber": 2835,
			"text": "قیس بن عباد کہتے ہیں کہ میں نے ابوذر رضی اللہ عنہ کو قسم کھا کر کہتے سنا کہ آیت کریمہ: «هذان خصمان اختصموا في ربهم» ( سورۃ الحج: ۱۹ ) یہ دونوں ایک دوسرے کے دشمن ہیں اپنے رب کے بارے میں انہوں نے جھگڑا کیا سے «إن الله يفعل ما يريد» ( سورۃ الحج: ۲۴ ) تک، ان چھ لوگوں کے بارے میں اتری جو بدر کے دن باہم لڑے، حمزہ بن عبدالمطلب، علی بن ابی طالب رضی اللہ عنہما مسلمانوں کی طرف سے، اور عبیدہ بن حارث، عتبہ بن ربیعہ، شیبہ بن ربیعہ اور ولید بن عتبہ کافروں کی طرف سے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2836,
			"arabicnumber": 2836,
			"text": "سلمہ بن الاکوع رضی اللہ عنہ کہتے ہیں کہ میں نے ایک شخص کو مقابلہ کے لیے للکارا، اور اسے قتل کر ڈالا تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے چھینا ہوا سامان بطور انعام مجھے ہی دے دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2837,
			"arabicnumber": 2837,
			"text": "ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جنگ حنین کے موقعہ پر ان کے ہاتھ سے قتل کیے گئے شخص کا سامان انہیں کو دے دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2838,
			"arabicnumber": 2838,
			"text": "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص ( کسی کافر ) کو قتل کرے، تو اس سے چھینا ہوا مال اسی کو ملے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2839,
			"arabicnumber": 2839,
			"text": "صعب بن جثامہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے سوال کیا گیا کہ مشرکین کی آبادی پر شبخون مارتے ( رات میں حملہ کرتے ) وقت عورتیں اور بچے بھی قتل ہو جائیں گے، تو اس کا کیا حکم ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ بھی انہیں میں سے ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2840,
			"arabicnumber": 2840,
			"text": "سلمہ بن الاکوع رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے زمانے میں ہم نے ابوبکر رضی اللہ عنہ کے ہمراہ قبیلہ ہوازن سے جہاد کیا، چنانچہ ہم بنی فزارہ کے چشمہ کے پاس آئے اور ہم نے وہیں پر پڑاؤ ڈالا، جب صبح کا وقت ہوا، تو ہم نے ان پر حملہ کر دیا، پھر ہم چشمہ والوں کے پاس آئے ان پر بھی شبخون مارا، اور ان کے نو یا سات گھروں کے لوگوں کو قتل کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2841,
			"arabicnumber": 2841,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے راستے میں ایک عورت کو دیکھا جسے قتل کر دیا گیا تھا تو آپ صلی اللہ علیہ وسلم نے عورتوں اور بچوں کے قتل سے منع فرما دیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "حنظلہ الکاتب رضی اللہ عنہ کہتے ہیں ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ ( جنگ ) میں شریک تھے، ہمارا گزر ایک مقتول عورت کے پاس سے ہوا، وہاں لوگ اکٹھے ہو گئے تھے، ( آپ کو دیکھ کر ) لوگوں نے آپ کے لیے جگہ خالی کر دی تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ تو لڑنے والوں میں نہ تھی ( پھر اسے کیوں مار ڈالا گیا ) اس کے بعد ایک شخص سے کہا: خالد بن ولید کے پاس جاؤ، اور ان سے کہو کہ رسول اللہ صلی اللہ علیہ وسلم تمہیں حکم دے رہے ہیں کہ عورتوں، بچوں، مزدوروں اور خادموں کو ہرگز قتل نہ کرنا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2843,
			"arabicnumber": 2843,
			"text": "اسامہ بن زید رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے ابنیٰ نامی بستی کی جانب بھیجا اور فرمایا: ابنیٰ میں صبح کے وقت جاؤ، اور اسے آگ لگا دو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2844,
			"arabicnumber": 2844,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ بنو نضیر کے کھجور کا باغ جلا دیا، اور کاٹ ڈالا، اس باغ کا نام بویرہ تھا، چنانچہ اللہ تعالیٰ کا یہ فرمان نازل ہوا: «ما قطعتم من لينة أو تركتموها قائمة» یعنی تم نے کھجوروں کے جو درخت کاٹ ڈالے یا جنہیں تم نے ان کی جڑوں پہ باقی رہنے دیا یہ سب اللہ تعالیٰ کے حکم سے تھا، اور اس لیے بھی کہ فاسقوں کو اللہ تعالیٰ رسوا کرے ( سورۃ الحشر: ۵ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2845,
			"arabicnumber": 2845,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ بنو نضیر کے کھجور کے درخت جلا دئیے اور انہیں کاٹ دیا، اسی سے متعلق ایک شاعر کہتا ہے: «فهان على سراة بني لؤي حريق بالبويرة مستطير» بنی لؤی کے سرداروں کے لیے آسان ہوا، بویرہ میں آگ لگانا جو ہر طرف پھیلتی جا رہی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2846,
			"arabicnumber": 2846,
			"text": "سلمہ بن الاکوع رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ہم نے ابوبکر رضی اللہ عنہ کے ساتھ قبیلہ ہوازن سے جنگ کی، تو ابوبکر رضی اللہ عنہ نے قبیلہ بنی فزارہ سے حاصل کی ہوئی ایک لونڈی مجھے بطور نفل ( انعام ) دی، وہ عرب کے خوبصورت ترین لوگوں میں سے تھی، اور پوستین پہنے ہوئی تھی، میں نے اس کا کپڑا بھی نہیں کھولا تھا کہ مدینہ آیا، بازار میں میری ملاقات نبی اکرم صلی اللہ علیہ وسلم سے ہوئی، آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ کی شان، تمہارا باپ بھی کیا خوب آدمی تھا! یہ لونڈی مجھے دے دو، میں نے وہ آپ کو ہبہ کر دی، چنانچہ آپ صلی اللہ علیہ وسلم نے وہ لونڈی ان مسلمانوں کے عوض فدیہ میں دے دی جو مکہ میں تھے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2847,
			"arabicnumber": 2847,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ ان کا ایک گھوڑا چلا گیا، اور اسے دشمن نے پکڑ لیا، پھر مسلمان ان پر غالب آ گئے، تو رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں وہ انہیں لوٹایا گیا، ان کا ایک غلام بھی بھاگ گیا، اور روم ( کے نصاریٰ ) سے جا ملا، پھر مسلمان ان پر غالب آ گئے، تو خالد بن ولید رضی اللہ عنہ نے اسے رسول اللہ صلی اللہ علیہ وسلم کی وفات کے بعد ان کو واپس کر دیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2848,
			"arabicnumber": 2848,
			"text": "زید بن خالد جہنی رضی اللہ عنہ کہتے ہیں کہ قبیلہ اشبحع کے ایک شخص کا خیبر میں انتقال ہو گیا تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم لوگ اپنے ساتھی کی نماز ( جنازہ ) پڑھ لو، لوگوں کو اس پر تعجب ہوا اور ان کے چہروں کے رنگ اڑ گئے، آپ صلی اللہ علیہ وسلم نے جب یہ صورت حال دیکھی تو فرمایا: تمہارے ساتھی نے اللہ کے راستے میں ( حاصل شدہ مال غنیمت میں ) خیانت کی ہے ۔ زید رضی اللہ عنہ کہتے ہیں: پھر لوگوں نے اس کے سامان کی تلاشی لی تو کیا دیکھتے ہیں کہ یہود کے مونگوں میں سے کچھ مونگے جو کہ دو درہم کے برابر تھے اس کے سامان میں موجود تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2849,
			"arabicnumber": 2849,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے سامان کی نگہبانی پر کرکرہ نامی ایک شخص تھا، اس کا انتقال ہو گیا تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: وہ جہنم میں ہے ، لوگ اس کا سامان دیکھنے لگے تو اس میں ایک کملی یا عباء ملی جو اس نے مال غنیمت میں سے چرا لی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2850,
			"arabicnumber": 2850,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں جنگ حنین کے دن مال غنیمت کے ایک اونٹ کے پہلو میں نماز پڑھائی، نماز کے بعد آپ صلی اللہ علیہ وسلم نے اونٹ میں سے کوئی چیز لی جیسے اونٹ کا بال اور اسے اپنی انگلیوں سے پکڑا پھر فرمایا: لوگو! یہ بھی تمہارے مال غنیمت کا حصہ ہے، لہٰذا دھاگہ سوئی نیز اس سے چھوٹی اور بڑی چیز بھی جمع کر دو کیونکہ مال غنیمت میں خیانت ( چوری ) کرنے والے کے لیے قیامت کے دن باعث عار ( ندامت ) و شنار ( عیب ) اور باعث نار ( عذاب ) ہو گی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2851,
			"arabicnumber": 2851,
			"text": "حبیب بن مسلمہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم مال غنیمت میں سے خمس ( پانچواں حصہ جو اللہ اور اس کے رسول کا حق ہے ) نکال لینے کے بعد مال غنیمت کا ایک تہائی بطور نفل ہبہ اور عطیہ دیتے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2852,
			"arabicnumber": 2852,
			"text": "عبادہ بن صامت رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم شروع لڑائی میں ملنے والے مال غنیمت کا چوتھا حصہ بطور ہبہ دیتے، اور لوٹتے وقت تہائی حصہ دیتے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2853,
			"arabicnumber": 2853,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے بعد مال غنیمت سے ہبہ اور عطیہ کا سلسلہ ختم ہو گیا، اب طاقتور مسلمان کمزور مسلمانوں کو مال لوٹائیں گے ۱؎۔ حبیب بن مسلمہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے شروع لڑائی میں ملنے والے کو مال غنیمت کا چوتھائی حصہ بطور ہبہ اور عطیہ دیا، اور لوٹتے وقت تہائی حصہ دیا ۲؎۔ تو عمرو بن شعیب نے سلیمان بن موسیٰ سے کہا کہ میں تمہیں اپنے والد کے واسطہ سے اپنے دادا ( عبداللہ بن عمرو بن العاص رضی اللہ عنہما ) سے روایت کر رہا ہوں اور تم مجھ سے مکحول کے حوالے سے بیان کر رہے ہو؟",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2854,
			"arabicnumber": 2854,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے جنگ خیبر میں گھوڑ سوار کے لیے تین حصے متعین فرمائے، دو حصے گھوڑے کے، اور ایک حصہ آدمی کا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2855,
			"arabicnumber": 2855,
			"text": "محمد بن زید کہتے ہیں کہ میں نے آبی اللحم ( وکیع کہتے ہیں کہ وہ گوشت نہیں کھاتے تھے ) کے غلام عمیر رضی اللہ عنہما سے سنا: وہ کہتے ہیں کہ میں نے اپنے مالک کے ہمراہ خیبر کے دن جہاد کیا، چونکہ میں غلام تھا لہٰذا مجھے مال غنیمت میں حصہ نہیں ملا، صرف ردی چیزوں میں سے ایک تلوار ملی، جب اسے میں لٹکا کر چلتا تو ( وہ اتنی لمبی تھی ) کہ وہ گھسٹتی رہتی تھی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2856,
			"arabicnumber": 2856,
			"text": "ام عطیہ انصاریہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ سات غزوات میں شرکت کی تھی، مردوں کی غیر موجودگی میں ان کے ڈیروں میں رہتی، ان کے لیے کھانا بناتی، زخمیوں کا علاج کرتی اور بیماروں کی دیکھ بھال کرتی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2857,
			"arabicnumber": 2857,
			"text": "صفوان بن عسال رضی اللہ عنہ کہتے ہیں کہ ہمیں رسول اللہ صلی اللہ علیہ وسلم نے ایک فوجی دستے میں بھیجا تو فرمایا: اللہ کے نام پر، اللہ کے راستے میں جاؤ، جو اللہ تعالیٰ کے ساتھ کفر کرے اس سے لڑو، لیکن مثلہ نہ کرنا، ( ناک کان مت کاٹنا ) عہد شکنی نہ کرنا، مال غنیمت میں چوری نہ کرنا، اور بچے کو قتل نہ کرنا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب کسی فوجی دستے پر کسی شخص کو امیر متعین فرماتے تو اسے ذاتی طور پر اللہ سے ڈرتے رہنے اور اپنے ساتھی مسلمانوں کے ساتھ حسن سلوک کرنے کی وصیت کرتے، اور فرماتے: اللہ کے راستے میں اللہ کا نام لے کر لڑنا، جو اللہ کے ساتھ کفر کرے اس سے لڑنا، اور بدعہدی نہ کرنا، ( مال غنیمت میں ) خیانت نہ کرنا، مثلہ نہ کرنا، اور کسی بچے کو قتل نہ کرنا، جب مشرکوں میں سے اپنے دشمن سے مڈبھیڑ ہو تو انہیں تین باتوں میں سے ایک کی دعوت دینا، ان میں سے جس بات پر وہ راضی ہو جائیں اسے قبول کرنا، اور ان سے جنگ سے رک جانا ( سب سے پہلے ) انہیں اسلام کی دعوت دینا، اگر وہ قبول کر لیں تو ان کا اسلام قبول کرنا، اور ان کے قتل سے باز رہنا، پھر انہیں گھربار چھوڑ کر مہاجرین کے ساتھ رہنے کی دعوت دینا، اور انہیں بتانا کہ اگر وہ ایسا گریں گے تو انہیں مہاجرین جیسے حقوق حاصل ہوں گے، اور جرم و سزا کا جو قانون مہاجرین کے لیے ہے وہی ان کے لیے بھی ہو گا، اگر وہ ہجرت کرنے سے انکار کریں تو انہیں بتانا کہ ان کا حکم اعرابی ( دیہاتی ) مسلمانوں جیسا ہو گا، اللہ تعالیٰ کے جو احکام مسلمانوں پر جاری ہوتے ہیں ان پر بھی جاری ہوں گے، لیکن مال غنیمت میں اور اس مال میں جو کافروں سے جنگ کے بغیر ہاتھ آ جائے، ان کا کوئی حصہ نہ ہو گا، مگر اس صورت میں کہ وہ مسلمانوں کے ساتھ جہاد کریں، اگر وہ اسلام میں داخل ہونے سے انکار کریں، تو ان سے جزیہ دینے کا مطالبہ کرنا، اگر وہ جزیہ دیں تو ان سے قبول کرنا، اور ان سے اپنا ہاتھ روک لینا، اور اگر وہ انکار کریں تو ( کامیابی کے لیے ) اللہ تعالیٰ سے مدد مانگنا، اور ان سے جنگ کرنا، اگر تم کسی قلعہ کا محاصرہ کر لو اور قلعہ والے تم سے اللہ اور نبی کا عہد کرانا چاہیں تو اللہ اور نبی کا عہد مت دینا، بلکہ اپنا، اپنے باپ کا، اور اپنے ساتھیوں کا ذمہ دینا، کیونکہ تم اپنا اور اپنے باپ کا ذمہ اللہ اور رسول کے ذمہ کے مقابلے میں آسانی سے توڑ سکتے ہو، اگر تم نے کسی قلعے کا محاصرہ کر لیا، اور وہ اللہ کے حکم پر اترنا چاہیں تو انہیں اللہ کے حکم پہ مت اتارنا، بلکہ اپنے حکم پہ اتارنا کیونکہ تمہیں کیا معلوم کہ ان کے بارے میں تم اللہ کے حکم پر چل رہے ہو یا نہیں ۱؎۔ علقمہ کہتے ہیں: میں نے یہ حدیث مقاتل بن حیان سے بیان کی، انہوں نے کہا: مجھ سے مسلم بن ہیضم نے بیان کی، مسلم نے نعمان بن مقرن رضی اللہ عنہ سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مثل روایت کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2859,
			"arabicnumber": 2859,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے میری بات مانی اس نے اللہ کی بات مانی، اور جس نے میری نافرمانی کی اس نے اللہ کی نافرمانی کی، ( اسی طرح ) جس نے امام کی بات مانی اس نے میری بات مانی، اور جس نے امام کی نافرمانی کی اس نے میری نا فرمانی کی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2860,
			"arabicnumber": 2860,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سنو اور اطاعت کرو، گرچہ تم پر حبشی غلام ہی امیر ( حاکم ) کیوں نہ بنا دیا جائے، جس کا سر منقی ( کشمش ) کی طرح ہو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "ام الحصین رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: اگر تم پر کوئی نک کٹا حبشی غلام امیر ( حاکم ) بنا دیا جائے تو بھی اس کی بات سنو اور مانو، جب تک کہ وہ اللہ کی کتاب ( قرآن ) کے مطابق تمہاری سربراہی کرتا رہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2862,
			"arabicnumber": 2862,
			"text": "ابوذر رضی اللہ عنہ سے روایت ہے کہ وہ مقام ربذہ میں پہنچے تو نماز کے لیے تکبیر کہی جا چکی تھی، تو کیا دیکھتے ہیں کہ ایک غلام لوگوں کی امامت کر رہا ہے، اس سے کہا گیا: یہ ابوذر رضی اللہ عنہ ہیں، یہ سن کر وہ پیچھے ہٹنے لگا تو ابوذر رضی اللہ عنہ نے فرمایا: میرے خلیل ( جگری دوست ) محمد صلی اللہ علیہ وسلم نے مجھے یہ وصیت کی کہ امام گرچہ اعضاء کٹا حبشی غلام ہی کیوں نہ ہو میں اس کی بات سنوں اور مانوں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے علقمہ بن مجزر رضی اللہ عنہ کو ایک لشکر کا سردار بنا کر بھیجا، میں بھی اس لشکر میں تھا، جب وہ لشکر کے آخری پڑاؤ پر پہنچے یا درمیان راستے ہی میں تھے تو لشکر کی ایک جماعت نے ( آگے جانے کی ) اجازت مانگی، علقمہ رضی اللہ عنہ نے اجازت دے دی، اور عبداللہ بن حذافہ بن قیس سہمی رضی اللہ عنہ کو ان پر امیر مقرر کر دیا، میں بھی ان لوگوں میں تھا جنہوں نے ان کے ساتھ غزوہ کیا، ابھی وہ راستہ ہی میں تھے کہ ان لوگوں نے تاپنے یا کچھ پکانے کے لیے آگ جلائی، تو عبداللہ بن حذافہ رضی اللہ عنہ ( جن کے مزاج میں خوش طبعی پائی جاتی تھی ) نے کہا: کیا تم پر میری بات سننا اور اطاعت کرنا واجب نہیں؟ لوگوں نے جواب دیا: کیوں نہیں؟ کہا: میں کسی کام کے کرنے کا تمہیں حکم دوں تو تم حکم بجا لاؤ گے؟ لوگوں نے جواب دیا: ہاں، کہا: میں لازمی حکم دیتا ہوں کہ تم اس آگ میں چھلانگ لگا دو، کچھ لوگ کھڑے ہو گئے اور کودنے کے لیے کمر کس لی، عبداللہ بن حذافہ رضی اللہ عنہ کو جب یہ گمان ہوا کہ واقعی یہ تو کود ہی جائیں گے، تو بولے: ٹھہرو، میں تم سے یونہی مذاق کر رہا تھا ۱؎۔ جب ہم لوگ واپس مدینہ آئے، لوگوں نے نبی اکرم صلی اللہ علیہ وسلم کو سارا ماجرا سنایا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: حکام میں جو تمہیں اللہ تعالیٰ کی نافرمانی کا حکم دے تو اس کی بات نہ ما نو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2864,
			"arabicnumber": 2864,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان آدمی پر ( امیر اور حاکم کی ) بات ماننا لازم ہے، چاہے وہ اسے پسند ہو یا ناپسند، ہاں اگر اللہ اور رسول کی نافرمانی کا حکم دیا جائے تو اس کو سننا ماننا نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2865,
			"arabicnumber": 2865,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: وہ زمانہ قریب ہے کہ میرے بعد تمہارے معاملات کی باگ ڈور ایسے لوگوں کے ہاتھ میں آئے گی جو سنت کو مٹائیں گے، بدعت پر عمل پیرا ہوں گے، اور نماز کی وقت پر ادائیگی میں تاخیر کریں گے ، میں نے کہا: اللہ کے رسول! اگر میں ان کا زمانہ پاؤں تو کیا کروں؟ فرمایا: اے ام عبد کے بیٹے! مجھ سے پوچھ رہے ہو کہ کیا کروں؟ جو شخص اللہ کی نافرمانی کرے اس کی بات نہیں مانی جائے گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2866,
			"arabicnumber": 2866,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ ہم نے تنگی اور فراخی، خوشی و ناخوشی، اور اپنے اوپر دوسروں کو ترجیح دئیے جانے کی حالت میں بھی رسول اللہ صلی اللہ علیہ وسلم سے سننے اور اطاعت کرنے پر بیعت کی، نیز اس بات پر بیعت کی کہ حکمرانوں سے نہ جھگڑیں، اور جہاں بھی ہوں حق بات کہیں، اور اللہ کے سلسلے میں کسی ملامت کرنے والے کی ملامت سے نہ ڈریں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2867,
			"arabicnumber": 2867,
			"text": "عوف بن مالک اشجعی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ہم سات یا آٹھ یا نو آدمی تھے، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تم لوگ اللہ کے رسول سے بیعت نہیں کرو گے ؟ ہم نے بیعت کے لیے اپنے ہاتھ پھیلا دئیے ( بیعت کرنے کے بعد ) ایک شخص نے کہا: اللہ کے رسول! ہم آپ سے بیعت تو کر چکے لیکن یہ کس بات پر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس بات پر کہ اللہ کی عبادت کرو، اس کے ساتھ کسی کو شریک نہ کرو، پانچ وقت کی نماز کا اہتمام کرو، حکم سنو اور مانو ، پھر ایک بات چپکے سے فرمائی: لوگوں سے کسی چیز کا سوال نہ کرو ، راوی کا بیان ہے کہ ( اس بات کا ان لوگوں پر اتنا اثر ہوا کہ ) میں نے ان میں سے بعض کو دیکھا کہ اس کا کوڑا بھی گر جاتا تو کسی سے یہ نہ کہتا کہ کوڑا اٹھا کر مجھے دو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2868,
			"arabicnumber": 2868,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم سے سننے اور اطاعت کرنے پر بیعت کی، تو آپ نے فرمایا: جہاں تک تم سے ہو سکے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2869,
			"arabicnumber": 2869,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ ایک غلام آیا، اور نبی اکرم صلی اللہ علیہ وسلم سے ہجرت پر بیعت کر لی، اور آپ صلی اللہ علیہ وسلم کو اس کے غلام ہونے کا معلوم ہی نہ ہوا، چنانچہ اس کا مالک جب اسے لینے کے مقصد سے آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ غلام مجھے بیچ دو ، آپ صلی اللہ علیہ وسلم نے اسے دو کالے غلاموں کے عوض خرید لیا، پھر اس کے بعد کسی سے بھی یہ معلوم کئے بغیر بیعت نہیں کرتے کہ وہ غلام تو نہیں ہے؟۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2870,
			"arabicnumber": 2870,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت کے دن اللہ تعالیٰ تین آدمیوں سے نہ بات کرے گا، نہ ان کی طرف دیکھے گا، نہ ہی انہیں پاک کرے گا، اور ان کے لیے درد ناک عذاب ہے: ایک وہ آدمی جس کے پاس چٹیل میدان میں فالتو پانی ہو اور مسافر کو پانی لینے سے منع کرے، دوسرا وہ شخص جس نے عصر کے بعد کسی کے ہاتھ سامان بیچا اور اللہ کی قسم کھا کر کہا کہ اس نے یہ چیز اتنے اتنے میں لی ہے، پھر خریدار نے اس کی بات کا یقین کر لیا، حالانکہ اس نے غلط بیانی سے کام لیا تھا، تیسرا وہ آدمی جس نے کسی امام کے ہاتھ پر بیعت کی، اور مقصد محض دنیاوی فائدہ تھا، چنانچہ اگر اس نے اسے کچھ دیا تو بیعت کو پورا کیا، اور اگر نہیں دیا تو پورا نہیں کیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2871,
			"arabicnumber": 2871,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بنی اسرائیل کی حکومت ان کے انبیاء چلایا کرتے تھے، ایک نبی چلا جاتا تو دوسرا اس کی جگہ لے لیتا، لیکن میرے بعد تم میں کوئی نبی ہونے والا نہیں ، لوگوں نے عرض کیا: اللہ کے رسول! پھر کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: خلیفہ ہوں گے اور بہت ہوں گے ، لوگوں نے کہا: پھر کیسے کریں گے؟ فرمایا: پہلے کی بیعت پوری کرو، پھر اس کے بعد والے کی، اور اپنا حق ادا کرو، اللہ تعالیٰ ان سے ان کے حق کے بارے میں سوال کرے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2872,
			"arabicnumber": 2872,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت کے دن ہر دغا باز کے لیے ایک جھنڈا نصب کیا جائے گا، پھر کہا جائے گا کہ یہ فلاں شخص کی دغا بازی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2873,
			"arabicnumber": 2873,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: خبردار! قیامت کے دن ہر دغا باز کے لیے اس کی دغا بازی کے بقدر ایک جھنڈا نصب کیا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2874,
			"arabicnumber": 2874,
			"text": "امیمہ بنت رقیقہ رضی اللہ عنہا کہتی ہیں کہ میں کچھ عورتوں کے ہمراہ نبی اکرم صلی اللہ علیہ وسلم کے پاس بیعت کرنے آئی، تو آپ نے ہم سے فرمایا: ( امام کی بات سنو اور مانو ) جہاں تک تمہارے اندر طاقت و قوت ہو، میں عورتوں سے ہاتھ نہیں ملاتا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ مومن عورتیں نبی اکرم صلی اللہ علیہ وسلم کے پاس ہجرت کر کے آتیں تو اللہ تعالیٰ کے فرمان: «يا أيها النبي إذا جاءك المؤمنات يبايعنك» ( سورة الممتحنة: 12 ) اے نبی! جب مسلمان عورتیں آپ سے ان باتوں پر بیعت کرنے آئیں کہ اللہ تعالیٰ کے ساتھ کسی کو شریک نہ کریں گی چوری نہ کریں گی، زناکاری نہ کریں گی، اپنی اولاد کو نہ مار ڈالیں گی، اور کوئی ایسا بہتان نہ باندھیں گی، جو خود اپنے ہاتھوں پیروں کے سامنے گھڑ لیں اور کسی نیک کام میں تیری بےحکمی نہ کریں گی، تو آپ ان سے بیعت کر لیا کریں اور ان کے لیے اللہ تعالیٰ سے مغفرت طلب کریں بیشک اللہ تعالیٰ بخشنے اور معاف کرنے والا ہے کی رو سے ان کا امتحان لیا جاتا، عائشہ رضی اللہ عنہا کہتی ہیں کہ مومن عورتوں میں سے جو اس آیت کے مطابق اقرار کرتی وہ امتحان میں پوری اتر جاتی، عورتیں اپنی زبان سے جب اس کا اقرار کر لیتیں تو رسول اللہ صلی اللہ علیہ وسلم فرماتے: جاؤ میں نے تم سے بیعت لے لی ہے اللہ کی قسم، رسول اللہ صلیاللہ علیہ وسلم کا ہاتھ ہرگز کسی عورت کے ہاتھ سے کبھی نہیں لگا، جب آپ صلی اللہ علیہ وسلم ان عورتوں سے بیعت لیتے تو صرف زبان سے اتنا کہتے: میں نے تم سے بیعت لے لی عائشہ رضی اللہ عنہا فرماتی ہیں: اللہ کی قسم رسول اللہ صلی اللہ علیہ وسلم نے عورتوں سے صرف وہی عہد لیا جس کا حکم آپ کو اللہ تعالیٰ نے دیا تھا، رسول اللہ صلی اللہ علیہ وسلم کی مبارک ہتھیلی نے کبھی کسی ( نامحرم ) عورت کی ہتھیلی کو مس نہ کیا، آپ ان سے عہد لیتے وقت یہ فرماتے: میں نے تم سے بیعت لے لی صرف زبانی یہ کہتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2876,
			"arabicnumber": 2876,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے دو گھوڑوں کے مابین ایک گھوڑا داخل کیا، اور اسے جیتنے کا یقین نہیں تو یہ جوا نہیں ہے، لیکن جس شخص نے دو گھوڑوں کے مابین ایک گھوڑا داخل کیا، اور اسے جیتنے کا یقین ہے تو یہ جوا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2877,
			"arabicnumber": 2877,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے گھوڑوں کو پھرتیلا بنایا، آپ پھرتیلے چھریرے بدن والے گھوڑوں کو مقام حفیاء سے ثنیۃ الوداع تک اور غیر پھرتیلے گھوڑوں کو ثنیۃ الوداع سے مسجد بنی زریق تک دوڑاتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2878,
			"arabicnumber": 2878,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسابقت ( آگے بڑھنے ) کی شرط گھوڑے اور اونٹ کے علاوہ کسی میں جائز نہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2879,
			"arabicnumber": 2879,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے دشمن کی سر زمین میں قرآن لے کر جانے کی ممانعت اس خطرے کے پیش نظر فرمائی کہ کہیں اسے دشمن پا نہ لیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2880,
			"arabicnumber": 2880,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم دشمن کی سر زمین میں قرآن لے کر جانے سے منع فرماتے تھے، کیونکہ یہ خطرہ ہے کہ کہیں دشمن اسے پا نہ لیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2881,
			"arabicnumber": 2881,
			"text": "جبیر بن مطعم رضی اللہ عنہ کا بیان ہے کہ وہ اور عثمان بن عفان رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، اور خیبر کے خمس مال میں سے جو حصہ آپ نے بنی ہاشم اور بنی مطلب کو دیا تھا اس کے بارے میں گفتگو کرنے لگے، چنانچہ انہوں نے کہا: آپ نے ہمارے بھائی بنی ہاشم اور بنی مطلب کو تو دے دیا، جب کہ ہماری اور بنی مطلب کی قرابت بنی ہاشم سے یکساں ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں بنی ہاشم اور بنی مطلب کو ایک ہی سمجھتا ہوں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 129
			}
		}
	]
}