{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3927,
			"arabicnumber": 3927,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مجھے حکم دیا گیا ہے کہ میں اس وقت تک لوگوں سے جنگ کروں جب تک وہ «لا إله إلا الله» نہ کہہ دیں، جب وہ «لا إله إلا الله» کا اقرار کر لیں ( اور شرک سے تائب ہو جائیں ) تو انہوں نے اپنے مال اور اپنی جان کو مجھ سے بچا لیا، مگر ان کے حق کے بدلے اور ان کا حساب اللہ تعالیٰ کے سپرد ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3928,
			"arabicnumber": 3928,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مجھے یہ حکم دیا گیا ہے کہ میں اس وقت تک لوگوں سے لڑتا رہوں جب تک وہ «لا إله إلا الله» کا اقرار نہ کر لیں، جب انہوں نے اس کا اقرار کر لیا، تو اپنے مال اور اپنی جان کو مجھ سے بچا لیا، مگر ان کے حق کے بدلے، اور ان کا حساب اللہ تعالیٰ کے سپرد ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "اوس رضی اللہ عنہ کہتے ہیں کہ ہم نبی اکرم صلی اللہ علیہوسلم کے پاس بیٹھے ہوئے تھے، اور آپ حکایات و واقعات سنا کر ہمیں نصیحت فرما رہے تھے، کہ اتنے میں ایک شخص حاضر ہوا، اور اس نے آپ کے کان میں کچھ باتیں کیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اسے لے جا کر قتل کر دو ، جب وہ جانے لگا تو آپ صلی اللہ علیہ وسلم نے اسے پھر واپس بلایا، اور پوچھا: کیا تم «لا إله إلا الله» کہتے ہو ؟ اس نے عرض کیا: جی ہاں، آپ صلی اللہ علیہ وسلم نے فرمایا: تم لوگ جاؤ اسے چھوڑ دو، کیونکہ مجھے لوگوں سے لڑائی کرنے کا حکم دیا گیا ہے یہاں تک کہ وہ «لا إله إلا الله» کہیں، جب انہوں نے «لا إله إلا الله» کہہ دیا تو اب ان کا خون اور مال مجھ پر حرام ہو گیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ نافع بن ازرق اور ان کے اصحاب ( و تلامیذ ) آئے، اور کہنے لگے: عمران! آپ ہلاک و برباد ہو گئے! عمران رضی اللہ عنہ نے کہا: میں ہلاک نہیں ہوا، انہوں نے کہا: کیوں نہیں، آپ ضرور ہلاک ہو گئے، تو انہوں نے کہا: آخر کس چیز نے مجھے ہلاک کیا ہے؟ انہوں نے کہا: اللہ تعالیٰ فرماتا ہے: «وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله» کافروں و مشرکوں سے قتال کرو یہاں تک کہ فتنہ ( یعنی شرک ) باقی نہ رہے، اور دین پورا کا پورا اللہ کا ہو جائے ( سورة الأنفال: 39 ) ، عمران رضی اللہ عنہ نے کہا: ہم نے کفار سے اسی طرح لڑائی کی یہاں تک کہ ہم نے ان کو وطن سے باہر نکال دیا، اور دین پورا کا پورا اللہ کا ہو گیا، اگر تم چاہو تو میں تم سے ایک حدیث بیان کروں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے، ان لوگوں نے کہا: کیا آپ نے اسے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے؟ کہا: ہاں، میں نے خود رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے، میں آپ کے ساتھ موجود تھا، اور آپ نے مسلمانوں کا ایک لشکر مشرکین کے مقابلے کے لیے بھیجا تھا، جب ان کی مڈبھیڑ مشرکوں سے ہوئی، تو انہوں نے ان سے ڈٹ کر جنگ کی، آخر کار مشرکین نے اپنے کندھے ہماری جانب کر دئیے ( یعنی ہار کر بھاگ نکلے ) ، میرے ایک رشتہ دار نے مشرکین کا تعاقب کر کے ایک مشرک پر نیزے سے حملہ کیا، جب اس کو پکڑ لیا، ( اور کافر نے اپنے آپ کو خطرہ میں دیکھا ) تو اس نے «أشهد أن لا إله إلا الله» کہہ کر اپنے آپ کو مسلمان ظاہر کیا، لیکن اس نے اسے برچھی سے مار کر قتل کر دیا، پھر وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا، اور اس نے عرض کیا: اللہ کے رسول! میں ہلاک اور برباد ہو گیا، آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے کیا کیا ؟، ایک بار یا دو بار کہا، اس نے آپ صلی اللہ علیہ وسلم سے اپنا وہ واقعہ بتایا جو اس نے کیا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم نے اس کا پیٹ کیوں نہیں پھاڑا کہ جان لیتے اس کے دل میں کیا ہے ؟، اس نے عرض کیا: اللہ کے رسول! اگر میں اس کا پیٹ پھاڑ دیتا تو کیا میں جان لیتا کہ اس کے دل میں کیا تھا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے نہ تو اس کی بات قبول کی، اور نہ تمہیں اس کی دلی حالت معلوم تھی ۱؎۔ عمران رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اس کے متعلق خاموش رہے، پھر وہ کچھ ہی دن زندہ رہ کر مر گیا، ہم نے اسے دفن کیا، لیکن صبح کو اس کی لاش قبر کے باہر پڑی تھی، لوگوں نے خیال ظاہر کیا کہ کسی دشمن نے اس کی لاش نکال پھینکی ہے، خیر پھر ہم نے اس کو دفن کیا، اس کے بعد ہم نے اپنے غلاموں کو حکم دیا کہ اس کی قبر کی حفاظت کریں، لیکن پھر صبح اس کی لاش قبر سے باہر پڑی تھی، ہم نے سمجھا کہ شاید غلام سو گئے ( اور کسی دشمن نے آ کر پھر اس کی لاش نکال کر باہر پھینک دی ) ، آخر ہم نے اس کو دفن کیا، اور رات بھر خود پہرا دیا لیکن پھر اس کی لاش صبح کے وقت قبر کے باہر تھی، پھر ہم نے اس کی لاش ان گھاٹیوں میں سے ایک گھاٹی میں ڈال دی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حجۃالوداع کے موقع پر فرمایا: آگاہ رہو! تمام دنوں میں سب سے زیادہ حرمت والا تمہارا یہ دن ہے، آگاہ رہو! تمام مہینوں میں سب سے زیادہ حرمت والا تمہارا یہ مہینہ ہے، آگاہ رہو! شہروں میں سب سے زیادہ حرمت والا تمہارا یہ شہر ہے، آگاہ رہو! تمہاری جان، تمہارے مال ایک دوسرے پر اسی طرح حرام ہیں جیسے تمہارا یہ دن تمہارے اس مہینے میں، تمہارے اس شہر میں، آگاہ رہو! کیا میں نے تمہیں اللہ کا پیغام نہیں پہنچا دیا ؟، لوگوں نے عرض کیا: ہاں، آپ نے پہنچا دیا، آپ صلی اللہ علیہ وسلم نے فرمایا: اے اللہ تو گواہ رہ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3932,
			"arabicnumber": 3932,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو خانہ کعبہ کا طواف کرتے دیکھا، اور آپ صلی اللہ علیہ وسلم یہ فرما رہے تھے: تو کتنا عمدہ ہے، تیری خوشبو کتنی اچھی ہے، تو کتنا بڑے رتبہ والا ہے اور تیری حرمت کتنی عظیم ہے، لیکن قسم ہے اس ذات کی جس کے ہاتھ میں محمد کی جان ہے، مومن کی حرمت ( یعنی مومن کے جان و مال کی حرمت ) اللہ تعالیٰ کے نزدیک تجھ سے بھی زیادہ ہے، اس لیے ہمیں مومن کے ساتھ حسن ظن ہی رکھنا چاہیئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3933,
			"arabicnumber": 3933,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہر مسلمان کا خون، مال اور عزت و آبرو دوسرے مسلمان پر حرام ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3934,
			"arabicnumber": 3934,
			"text": "فضالہ بن عبید رضی اللہ عنہ بیان کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مومن وہ ہے جس سے لوگوں کو اپنی جان اور مال کا خوف اور ڈر نہ ہو، اور مہاجر وہ ہے جو برائیوں اور گناہوں کو ترک کر دے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3935,
			"arabicnumber": 3935,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو علی الاعلان اور کھلم کھلا طور پر لوٹ مار کرے وہ ہم میں سے نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب زانی زنا کرتا ہے تو اس وقت وہ مومن نہیں ہوتا، اور جب شرابی شراب پیتا ہے تو اس وقت وہ مومن نہیں ہوتا، اور جب چور چوری کرتا ہے تو وہ اس وقت مومن نہیں ہوتا، جب لوٹ مار کرنے والا لوگوں کی نظروں کے سامنے لوٹ مار کرتا ہے تو اس وقت وہ مومن نہیں ہوتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3937,
			"arabicnumber": 3937,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو لوٹ مار کرے وہ ہم میں سے نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3938,
			"arabicnumber": 3938,
			"text": "ثعلبہ بن حکم رضی اللہ عنہ کہتے ہیں کہ ہمیں دشمن کی کچھ بکریاں ملیں تو ہم نے انہیں لوٹ لیا، اور انہیں ذبح کر کے ہانڈیوں میں چڑھا دیا، پھر نبی اکرم صلی اللہ علیہ وسلم کا گزر ان ہانڈیوں کے پاس ہوا، تو آپ صلی اللہ علیہ وسلم نے حکم دیا کہ وہ الٹ دی جائیں، چنانچہ وہ ہانڈیاں الٹ دی گئیں، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: لوٹ مار حلال نہیں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3939,
			"arabicnumber": 3939,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان کو گالی دینا فسق ہے، اور اس سے لڑنا کفر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": 3940,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مسلمان کو گالی دینا فسق ہے، اور اس سے لڑنا کفر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": 3941,
			"text": "سعد رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان کو گالی دینا فسق، اور اس سے لڑنا کفر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": 3942,
			"text": "جریر بن عبداللہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع میں فرمایا: لوگوں کو خاموش کرو پھر فرمایا: تم لوگ میرے بعد کافر نہ ہو جانا کہ تم میں سے بعض بعض کی گردن مارنے لگے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": 3943,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم پر افسوس ہے! یا ( تمہارے لیے خرابی ہو! ) تم لوگ میرے بعد کافر نہ ہو جانا کہ ان کی طرح تم میں سے بعض بعض کی گردن مارنے لگے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": 3944,
			"text": "صنابح احمسی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سنو! میں حوض کوثر پر تمہارا پیش رو ہوں گا، اور تمہاری کثرت ( تعداد ) کی وجہ سے میں دوسری امتوں پر فخر کروں گا، تو تم میرے بعد آپس میں ایک دوسرے کو قتل مت کرنا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": 3945,
			"text": "ابوبکر صدیق رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے نماز فجر پڑھی وہ اللہ تعالیٰ کے حفظ و امان یعنی پناہ میں ہے، اب تمہیں چاہیئے کہ تم اللہ کے ذمہ و عہد کو نہ توڑو، پھر جو ایسے شخص کو قتل کرے گا، اللہ تعالیٰ اسے بلا کر جہنم میں اوندھا منہ ڈالے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": 3946,
			"text": "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے نماز فجر پڑھی وہ اللہ تعالیٰ کی امان ( پناہ ) میں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": 3947,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مومن اللہ عزوجل کے نزدیک اس کے بعض فرشتوں سے زیادہ معزز و محترم ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": 3948,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص گمراہی کے جھنڈے تلے لڑے، عصبیت کی دعوت دے، اور عصبیت کے سبب غضب ناک ہو، اس کی موت جاہلیت کی موت ہو گی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3949,
			"arabicnumber": 3949,
			"text": "فسیلہ نامی ایک عورت کہتی ہے کہ میں نے اپنے والد کو یہ کہتے سنا کہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا: اے اللہ کے رسول! کیا اپنی قوم سے محبت رکھنا عصبیت ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں، بلکہ ظلم پر قوم کی مدد کرنا عصبیت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3950,
			"arabicnumber": 3950,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: میری امت گمراہی پر کبھی جمع نہ ہو گی، لہٰذا جب تم اختلاف دیکھو تو سواد اعظم ( یعنی بڑی جماعت ) کو لازم پکڑو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3951,
			"arabicnumber": 3951,
			"text": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک دن بہت لمبی نماز پڑھائی، پھر جب آپ نماز سے فارغ ہوئے تو ہم نے ( یا لوگوں نے ) عرض کیا: اللہ کے رسول! آج تو آپ نے نماز بہت لمبی پڑھائی، آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں، آج میں نے رغبت اور خوف والی نماز ادا کی، میں نے اللہ تعالیٰ سے اپنی امت کے لیے تین باتیں طلب کیں جن میں سے اللہ تعالیٰ نے دو عطا فرما دیں اور ایک قبول نہ فرمائی، میں نے اللہ تعالیٰ سے یہ طلب کیا تھا کہ میری امت پر اغیار میں سے کوئی دشمن مسلط نہ ہو، تو اللہ تعالیٰ نے مجھے اسے دیا، دوسری چیز میں نے اللہ تعالیٰ سے یہ طلب کی تھی کہ میری امت کو غرق کر کے ہلاک نہ کیا جائے، اللہ تعالیٰ نے اسے بھی مجھے دیا، تیسری یہ دعا کی تھی کہ میری امت آپس میں جنگ و جدال نہ کرے، تو اللہ تعالیٰ نے میری یہ دعا قبول نہ فرمائی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3952,
			"arabicnumber": 3952,
			"text": "رسول اللہ صلی اللہ علیہ وسلم کے غلام ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میرے لیے زمین سمیٹ دی گئی حتیٰ کہ میں نے اس کے مشرق اور مغرب کو دیکھ لیا، پھر اس کے دونوں خزانے زرد یا سرخ اور سفید ( یعنی سونا اور چاندی بھی ) مجھے دئیے گئے ۱؎ اور مجھ سے کہا گیا کہ تمہاری ( امت کی ) حکومت وہاں تک ہو گی جہاں تک زمین تمہارے لیے سمیٹی گئی ہے، اور میں نے اللہ تعالیٰ سے تین باتوں کا سوال کیا: پہلی یہ کہ میری امت قحط ( سوکھے ) میں مبتلا ہو کر پوری کی پوری ہلاک نہ ہو، دوسری یہ کہ انہیں ٹکڑے ٹکڑے نہ کر، تیسری یہ کہ آپس میں ایک کو دوسرے سے نہ لڑا، تو مجھ سے کہا گیا کہ میں جب کوئی حکم نافذ کر دیتا ہوں تو وہ واپس نہیں ہو سکتا، بیشک میں تمہاری امت کو قحط سے ہلاک نہ کروں گا، اور میں زمین کے تمام کناروں سے سارے مخالفین کو ( ایک وقت میں ) ان پر جمع نہ کروں گا جب تک کہ وہ خود آپس میں اختلاف و لڑائی اور ایک دوسرے کو مٹانے اور قتل نہ کرنے لگیں، لیکن جب میری امت میں تلوار چل پڑے گی تو وہ قیامت تک نہ رکے گی، مجھے اپنی امت پر سب سے زیادہ خوف گمراہ سربراہوں کا ہے، عنقریب میری امت کے بعض قبائل بتوں کی پرستش کریں گے، اور عنقریب میری امت کے بعض قبیلے مشرکوں سے مل جائیں گے، اور قیامت کے قریب تقریباً تیس جھوٹے دجال پیدا ہوں گے جن میں سے ہر ایک کا دعویٰ یہ ہو گا کہ وہ اللہ کا نبی ہے، اور میری امت کا ایک گروہ ہمیشہ حق پر قائم رہے گا، اور ہمیشہ ان کی مدد ہوتی رہے گی، اور جو کوئی ان کا مخالف ہو گا وہ ان کو کوئی ضرور نقصان نہیں پہنچا سکے گا، یہاں تک کہ اللہ تعالیٰ کا حکم آ جائے ۲؎۔ ابوالحسن ابن القطان کہتے ہیں: جب ابوعبداللہ ( یعنی امام ابن ماجہ ) اس حدیث کو بیان کر کے فارغ ہوئے تو فرمایا: یہ حدیث کتنی ہولناک ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3953,
			"arabicnumber": 3953,
			"text": "ام المؤمنین زینب بنت جحش رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نیند سے بیدار ہوئے تو آپ کا مبارک چہرہ سرخ تھا، اور آپ فرما رہے تھے: «لا إله إلا الله» عرب کے لیے تباہی ہے اس فتنے سے جو قریب آ گیا ہے، آج یاجوج و ماجوج کی دیوار میں اتنا سوراخ ہو گیا ہے، آپ صلی اللہ علیہ وسلم نے ہاتھ کی انگلیوں سے دس کی گرہ بنائی ۱؎، زینب رضی اللہ عنہا کہتی ہیں کہ میں نے عرض کیا: اللہ کے رسول! کیا ہم ہلاک ہو جائیں گے؟ حالانکہ ہم میں اچھے لوگ بھی موجود ہیں! آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں، جب معصیت ( برائی ) عام ہو جائے گی ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3954,
			"arabicnumber": 3954,
			"text": "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب کئی فتنے ظاہر ہوں گے، جن میں آدمی صبح کو مومن ہو گا، اور شام کو کافر ہو جائے گا مگر جسے اللہ تعالیٰ علم کے ذریعہ زندہ رکھے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3955,
			"arabicnumber": 3955,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ ہم عمر رضی اللہ عنہ کے پاس بیٹھے ہوئے تھے اتنے میں آپ نے کہا کہ تم میں سے کس کو فتنہ کے باب میں رسول اللہ صلی اللہ علیہ وسلم کی حدیث یاد ہے؟ حذیفہ رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: مجھ کو یاد ہے، عمر رضی اللہ عنہ نے کہا: تم بڑے جری اور نڈر ہو، پھر بولے: وہ ( حدیث ) کیسے ہے؟ تو انہوں نے کہا: میں نے آپ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: آدمی کے لیے جو فتنہ اس کے اہل و عیال، اولاد اور پڑوسی میں ہوتا ہے اسے نماز، روزہ، صدقہ، امر بالمعروف اور نہی عن المنکر مٹا دیتے ہیں، ( یہ سن کر ) عمر رضی اللہ عنہ نے کہا: میری یہ مراد نہیں ہے، بلکہ میری مراد وہ فتنہ ہے جو سمندر کی موج کی طرح امنڈ آئے گا، انہوں نے کہا: امیر المؤمنین! آپ کو اس فتنے سے کیا سروکار، آپ کے اور اس فتنہ کے درمیان تو ایک بند دروازہ ہے، تو انہوں نے پوچھا: کیا وہ دروازہ توڑا جائے گا یا کھولا جائے گا، حذیفہ رضی اللہ عنہ نے کہا: نہیں ؛ بلکہ وہ توڑ دیا جائے گا تو عمر رضی اللہ عنہ نے کہا: تو پھر وہ کبھی بند ہونے کے قابل نہ رہے گا ۱؎۔ ابووائل شقیق بن سلمہ کہتے ہیں کہ ہم نے حذیفہ رضی اللہ عنہ سے کہا: کیا عمر رضی اللہ عنہ جانتے تھے کہ وہ دروازہ کون ہے؟ جواب دیا: ہاں، وہ ایسے ہی جانتے تھے جیسے یہ جانتے ہیں کہ کل سے پہلے رات ہے، میں نے ان سے ایک ایسی حدیث بیان کی تھی جس میں کوئی دھوکا جھوٹ اور مغالطہٰ نہ تھا، پھر ہمیں خوف محسوس ہوا کہ ہم حذیفہ رضی اللہ عنہ سے یہ سوال کریں کہ اس دروازے سے کون شخص مراد ہے؟ پھر ہم نے مسروق سے کہا: تم ان سے پوچھو، انہوں نے پوچھا تو حذیفہ رضی اللہ عنہ نے کہا: وہ دروازہ خود عمر رضی اللہ عنہ ہیں ( جن کی ذات تمام بلاؤں اور فتنوں کی روک تھی ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3956,
			"arabicnumber": 3956,
			"text": "عبدالرحمٰن بن عبدرب الکعبہ کہتے ہیں کہ میں عبداللہ بن عمرو بن العاص رضی اللہ عنہما کے پاس پہنچا، وہ کعبہ کے سائے میں بیٹھے تھے، اور لوگ ان کے پاس جمع تھے، تو میں نے ان کو کہتے سنا: اس دوران کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سفر میں تھے، آپ نے ایک جگہ قیام کیا، تو ہم میں سے کوئی خیمہ لگا رہا تھا، کوئی تیر چلا رہا تھا، اور کوئی اپنے جانور چرانے لے گیا، اتنے میں ایک منادی نے آواز لگائی کہ لوگو! نماز کے لیے جمع ہو جاؤ، تو ہم نماز کے لیے جمع ہو گئے، رسول اللہ صلی اللہ علیہ وسلم نے کھڑے ہو کر ہمیں خطبہ دیا، اور فرمایا: مجھ سے پہلے جتنے بھی نبی گزرے ہیں ان پر ضروری تھا کہ وہ اپنی امت کی ان باتوں کی طرف رہنمائی کریں جن کو وہ ان کے لیے بہتر جانتے ہوں، اور انہیں ان چیزوں سے ڈرائیں جن کو وہ ان کے لیے بری جانتے ہوں، اور تمہاری اس امت کی سلامتی اس کے شروع حصے میں ہے، اور اس کے اخیر حصے کو بلا و مصیبت لاحق ہو گی، اور ایسے امور ہوں گے جن کو تم برا جانو گے، پھر ایسے فتنے آئیں گے کہ ایک کے سامنے دوسرا ہلکا محسوس ہو گا، مومن کہے گا: اس فتنے میں میری تباہی ہے، پھر وہ فتنہ ختم ہو جائے گا، اور دوسرا فتنہ آئے گا، مومن کہے گا: اس میں میری تباہی ہے پھر وہ بھی ختم ہو جائے گا، تو جسے یہ بات پسند ہو کہ وہ جہنم سے بچا لیا جائے اور جنت میں داخل کر دیا جائے تو وہ کوشش کرے کہ اس کی موت اس حالت میں آئے کہ وہ اللہ اور یوم آخرت پر ایمان رکھتا ہو، اور لوگوں کے ساتھ وہ سلوک کرے جو اپنے لیے پسند کرتا ہو کہ لوگ اس کے ساتھ کریں، اور جو شخص کسی امام سے بیعت کرے، اور اس کو اپنی قسم کا ہاتھ دے کر دل سے سچا عہد کرے تو اب جہاں تک ہو سکے اس کی اطاعت کرے، اگر کوئی دوسرا امام آ کر اس سے لڑنے جھگڑنے لگے ( اور اپنے سے بیعت کرنے کو کہے ) تو اس دوسرے امام کی گردن مار دے ۔ عبدالرحمٰن کہتے ہیں کہ میں نے ( یہ سن کر ) اپنا سر لوگوں میں سے نکال کر کہا: میں اللہ کا واسطہ دے کر آپ سے پوچھتا ہوں: کیا آپ نے یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے؟ تو انہوں نے اپنے ہاتھ سے اپنے کانوں کی جانب اشارہ کر کے کہا: میرے کانوں نے اسے سنا اور میرے دل نے اسے یاد رکھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3957,
			"arabicnumber": 3957,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارا اس زمانہ میں کیا حال ہو گا جو عنقریب آنے والا ہے؟ جس میں لوگ چھانے جائیں گے ( اچھے لوگ سب مر جائیں گے ) اور خراب لوگ باقی رہ جائیں گے ( جیسے چھلنی میں آٹا چھاننے سے بھوسی باقی رہ جاتی ہے ) ، ان کے عہد و پیمان اور امانتوں کا معاملہ بگڑ چکا ہو گا، اور لوگ آپس میں الجھ کر اور اختلاف کر کے اس طرح ہو جائیں گے ، پھر آپ صلی اللہ علیہ وسلم نے اپنے ایک ہاتھ کی انگلیوں کو دوسرے ہاتھ کی انگلیوں میں ڈال کر دکھائیں، لوگوں نے عرض کیا: اللہ کے رسول! اس وقت ہم کیا کریں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جو بات تمہیں معروف ( اچھی ) معلوم ہو اسے اپنا لینا، اور جو منکر ( بری ) معلوم ہو اسے چھوڑ دینا، اور تم اپنے خصوصی معاملات و مسائل کی فکر کرنا، اور عام لوگوں کے مائل کی فکر چھوڑ دینا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3958,
			"arabicnumber": 3958,
			"text": "ابوذر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ابوذر! اس وقت تمہاری کیا حالت ہو گی جس وقت لوگوں پر موت کی وبا آئے گی یہاں تک کہ ایک گھر یعنی قبر کی قیمت ایک غلام کے برابر ہو گی ۱؎، میں نے عرض کیا: جو اللہ اور اس کا رسول میرے لیے پسند فرمائیں ( یا یوں کہا: اللہ اور اس کے رسول خوب جانتے ہیں ) آپ صلی اللہ علیہ وسلم نے فرمایا: اس وقت تم صبر سے کام لینا ، پھر فرمایا: اس وقت تم کیا کرو گے جب لوگ قحط اور بھوک کی مصیبت سے دو چار ہوں گے، حتیٰ کہ تم اپنی مسجد میں آؤ گے، پھر تم میں اپنے بستر تک جانے کی قوت نہ ہو گی اور نہ ہی بستر سے اٹھ کر مسجد تک آنے کی قوت ہو گی، میں نے عرض کیا: اللہ اور اس کے رسول زیادہ جانتے ہیں، یا کہا ( اللہ اور اس کا رسول جو میرے لیے پسند کرے ) آپ صلی اللہ علیہ وسلم نے فرمایا: ( اس وقت ) تم اپنے اوپر پاک دامنی کو لازم کر لینا ، پھر فرمایا: تم اس وقت کیا کرو گے جب ( مدینہ میں ) لوگوں کا قتل عام ہو گا، حتیٰ کہ مدینہ میں ایک پتھریلا مقام «حجارة الزيت» ۲؎ خون میں ڈوب جائے گا ، میں نے عرض کیا: اللہ اور اس کے رسول جو میرے لیے پسند فرمائیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم ان لوگوں سے مل جانا جن سے تم ہو ( یعنی اپنے اہل خاندان کے ساتھ ہو جانا ) ابوذر رضی اللہ عنہ کہتے ہیں: میں نے عرض کیا: اللہ کے رسول! کیا میں اپنی تلوار لے کر ان لوگوں کو نہ ماروں جو ایسا کریں؟ ، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم ایسا کرو گے تب تو تم بھی انہیں لوگوں میں شریک ہو جاؤ گے، تمہیں چاہیئے کہ ( چپ چاپ ہو کر ) اپنے گھر ہی میں پڑے رہو ۳؎ میں نے عرض کیا: اللہ کے رسول! اگر وہ میرے گھر میں گھس آئیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تمہیں ڈر ہو کہ تلوار کی چمک تم پر غالب آ جائے گی، تو اپنی چادر کا کنارا منہ پر ڈال لینا، ( قتل ہو جانا ) وہ قتل کرنے والا اپنا اور تمہارا دونوں کا گناہ اپنے سر لے گا، اور وہ جہنمی ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3959,
			"arabicnumber": 3959,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم سے بیان کیا: قیامت سے پہلے «ہرج» ہو گا ، میں نے پوچھا: اللہ کے رسول!«ہرج» کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: قتل ، کچھ مسلمانوں نے عرض کیا: اللہ کے رسول! ہم تو اب بھی سال میں اتنے اتنے مشرکوں کو قتل کرتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: مشرکین کا قتل مراد نہیں بلکہ تم آپس میں ایک دوسرے کو قتل کرو گے، حتیٰ کہ آدمی اپنے پڑوسی، اپنے چچا زاد بھائی اور قرابت داروں کو بھی قتل کرے گا ، تو کچھ لوگوں نے عرض کیا: اللہ کے رسول! کیا اس وقت ہم لوگ عقل و ہوش میں ہوں گے کہ نہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں، بلکہ اس زمانہ کے اکثر لوگوں کی عقلیں سلب کر لی جائیں گی، اور ان کی جگہ ایسے کم تر لوگ لے لیں گے جن کے پاس عقلیں نہیں ہوں گی ۔ پھر ابوموسیٰ اشعری رضی اللہ عنہ نے کہا: قسم اللہ کی! میں سمجھتا ہوں کہ شاید یہ زمانہ مجھے اور تم کو پا لے، اللہ کی قسم! اگر ایسا زمانہ مجھ پر اور تم پر آ گیا تو ہمارے اور تمہارے لیے اس سے نکلنے کا کوئی راستہ نہ ہو گا، جیسا کہ ہمارے نبی اکرم صلی اللہ علیہ وسلم نے ہمیں وصیت کی ہے، سوائے اس کے کہ ہم اس سے ویسے ہی نکلیں جیسے داخل ہوئے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3960,
			"arabicnumber": 3960,
			"text": "عدیسہ بنت اہبان کہتی ہیں کہ جب علی بن ابی طالب رضی اللہ عنہ یہاں بصرہ میں آئے، تو میرے والد ( اہبان بن صیفی غفاری رضی اللہ عنہ ) کے پاس تشریف لائے، اور کہا: ابو مسلم! ان لوگوں ( شامیوں ) کے مقابلہ میں تم میری مدد نہیں کرو گے؟ انہوں نے کہا: کیوں نہیں، ضرور مدد کروں گا، پھر اس کے بعد اپنی باندی کو بلایا، اور اسے تلوار لانے کو کہا: وہ تلوار لے کر آئی، ابو مسلم نے اس کو ایک بالشت برابر ( نیام سے ) نکالا، دیکھا تو وہ تلوار لکڑی کی تھی، پھر ابو مسلم نے کہا: میرے خلیل اور تمہارے چچا زاد بھائی ( محمد صلی اللہ علیہ وسلم ) نے مجھے ایسا ہی حکم دیا ہے کہ جب مسلمانوں میں جنگ اور فتنہ برپا ہو جائے تو میں ایک لکڑی کی تلوار بنا لوں ، اگر آپ چاہیں تو میں آپ کے ہمراہ نکلوں، انہوں نے کہا: مجھے نہ تمہاری ضرورت ہے اور نہ تمہاری تلوار کی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3961,
			"arabicnumber": 3961,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت کے قریب ایسے فتنے ہوں گے جیسے اندھیری رات کے حصے، ان میں آدمی صبح کو مومن ہو گا، تو شام کو کافر ہو گا اور شام کو مومن ہو گا تو صبح کو کافر ہو گا، اس میں بیٹھنے والا کھڑے ہونے والے سے، کھڑا ہونے والا چلنے والے سے، اور چلنے والا دوڑنے والے سے بہتر ہو گا، اور ان فتنوں میں تم اپنی کمانوں کو توڑ ڈالنا، کمان کے تانت کاٹ ڈالنا، اپنی تلواریں پتھر پر مار کر کند کر لینا، اور اگر تم میں سے کسی کے پاس کوئی گھس جائے تو آدم کے دونوں بیٹوں میں سے نیک بیٹے کی طرح ہو جا نا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3962,
			"arabicnumber": 3962,
			"text": "ابوبردہ رضی اللہ عنہ کہتے ہیں کہ میں محمد بن مسلمہ رضی اللہ عنہ کے پاس آیا، تو انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بہت جلد ایک فتنہ ہو گا، فرقہ بندی ہو گی اور اختلاف ہو گا، جب یہ زمانہ آئے تو تم اپنی تلوار لے کر احد پہاڑ پر آنا، اور اس پر اسے مارنا کہ وہ ٹوٹ جائے، اور پھر اپنے گھر بیٹھ جانا یہاں تک کہ کوئی خطاکار ہاتھ تمہیں قتل کر دے، یا موت آ جائے جو تمہارا کام تمام کر دے ۔ محمد بن مسلمہ رضی اللہ عنہ نے کہا: یہ فتنہ آ گیا ہے، اور میں نے وہی کیا جو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3963,
			"arabicnumber": 3963,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب دو مسلمان تلوار لے کر باہم لڑ پڑیں تو قاتل اور مقتول دونوں جہنمی ہوں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3964,
			"arabicnumber": 3964,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب دو مسلمان تلوار لے کر باہم لڑ پڑیں، تو قاتل اور مقتول دونوں جہنمی ہوں گے ، لوگوں نے عرض کیا: اللہ کے رسول! یہ تو قاتل ہے ( قتل کرنے کی وجہ سے جہنم میں جائے گا ) مگر مقتول کا کیا گناہ ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ بھی تو اپنے ساتھی کے قتل کا ارادہ رکھتا تھا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3965,
			"arabicnumber": 3965,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب دو مسلمان ایک دوسرے پر ہتھیار اٹھاتے ہیں تو وہ جہنم کے کنارے پر ہوتے ہیں، پھر جب ان میں سے کوئی ایک دوسرے کو قتل کر دے تو قاتل اور مقتول دونوں ایک ساتھ جہنم میں داخل ہوں گے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3966,
			"arabicnumber": 3966,
			"text": "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت کے دن اللہ کے نزدیک سب سے برباد اور خراب مقام اس شخص کا ہو گا جس نے اپنی آخرت دوسرے کی دنیا کے لیے برباد کی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3967,
			"arabicnumber": 3967,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ایک فتنہ ایسا ہو گا جو سارے عرب کو اپنی لپیٹ میں لے لے گا، اس میں قتل ہونے والے سب جہنمی ہوں گے، اس فتنہ میں زبان تلوار کی کاٹ سے زیادہ موثر ہو گی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3968,
			"arabicnumber": 3968,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم فتنوں سے بچے رہنا کیونکہ اس میں زبان ہلانا تلوار چلانے کے برابر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3969,
			"arabicnumber": 3969,
			"text": "علقمہ بن وقاص رضی اللہ عنہ کہتے ہیں کہ ان کے سامنے سے ایک معزز شخص کا گزر ہوا، تو انہوں نے اس سے عرض کیا: آپ کا مجھ سے ( دہرا رشتہ ہے ) ایک تو قرابت کا، دوسرے مسلمان ہونے کا، میں آپ کو دیکھتا ہوں کہ آپ ان امراء کے پاس آتے جاتے اور ان سے حسب منشا باتیں کرتے ہیں، میں نے صحابی رسول بلال بن حارث مزنی رضی اللہ عنہ کو یہ کہتے سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی ایسی بات بولتا ہے جس سے اللہ خوش ہوتا ہے، اور اس کو یہ معلوم نہیں ہوتا کہ اس بات کا اثر کیا ہو گا، لیکن اس بات کی وجہ سے اللہ تعالیٰ اس کے حق میں قیامت تک کے لیے اپنی خوشنودی اور رضا مندی لکھ دیتا ہے، اور تم میں سے کوئی ایسی بات بولتا ہے جو اللہ تعالیٰ کی ناراضگی کا سبب ہوتی ہے، اور اس کو یہ معلوم نہیں ہوتا کہ اس کا کیا اثر ہو گا، لیکن اللہ تعالیٰ اس کے حق میں اپنی ناراضگی اس دن تک کے لیے لکھ دیتا ہے جس دن وہ اس سے ملے گا ۔ علقمہ رضی اللہ عنہ نے کہا: دیکھو افسوس ہے تم پر! تم کیا کہتے اور کیا بولتے ہو، بلال بن حارث رضی اللہ عنہ کی حدیث نے بعض باتوں کے کہنے سے مجھے روک دیا ہے، خاموش ہو جاتا ہوں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3970,
			"arabicnumber": 3970,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: آدمی اپنی زبان سے اللہ کی ناراضگی کی بات کہتا ہے، اور وہ اس میں کوئی حرج نہیں محسوس کرتا، حالانکہ اس بات کی وجہ سے وہ ستر برس تک جہنم کی آگ میں گرتا چلا جاتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3971,
			"arabicnumber": 3971,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اللہ اور یوم آخرت پر ایمان رکھتا ہو اسے چاہیئے کہ وہ اچھی بات کہے، یا خاموش رہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3972,
			"arabicnumber": 3972,
			"text": "سفیان بن عبداللہ ثقفی رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! آپ مجھے کوئی ایسی بات بتائیے جس کو میں مضبوطی سے تھام لوں، آپ صلی اللہ علیہ وسلم نے فرمایا: کہو: اللہ میرا رب ( معبود برحق ) ہے اور پھر اس پر قائم رہو ، میں نے عرض کیا: اللہ کے رسول! آپ کو ہم پر کس بات کا زیادہ ڈر ہے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے اپنی زبان پکڑی اور فرمایا: اس کا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3973,
			"arabicnumber": 3973,
			"text": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ میں ایک سفر میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ تھا، ایک دن میں صبح کو آپ سے قریب ہوا، اور ہم چل رہے تھے، میں نے عرض کیا: اللہ کے رسول! آپ مجھے کوئی عمل بتائیے جو مجھے جنت میں داخل کر دے، اور جہنم سے دور رکھے، آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے ایک بہت بڑی چیز کا سوال کیا ہے، اور بیشک یہ عمل اس شخص کے لیے آسان ہے جس کے لیے اللہ تعالیٰ آسان کر دے، تم اللہ تعالیٰ کی عبادت کرو، اس کے ساتھ کسی کو شریک مت کرو، نماز قائم کرو، زکاۃ دو، رمضان کے روزے رکھو اور بیت اللہ کا حج کرو ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: کیا میں تمہیں بھلائی کے دروازے نہ بتاؤں؟ روزہ ڈھال ہے، صدقہ گناہوں کو ایسے ہی مٹاتا ہے جیسے پانی آگ کو بجھاتا ہے، اور آدھی رات میں آدمی کا نماز ( تہجد ) ادا کرنا ، پھر آپ صلی اللہ علیہ وسلم نے یہ آیت:«تتجافى جنوبهم عن المضاجع» ( سورة السجدة: 16 ) تلاوت فرمائی یہاں تک کہ «جزاء بما كانوا يعملون» تک پہنچے، پھر فرمایا: کیا میں تمہیں دین کی اصل، اس کا ستون اور اس کی چوٹی نہ بتا دوں؟ وہ اللہ کی راہ میں جہاد ہے ، پھر فرمایا: کیا ان تمام باتوں کا جس چیز پر دارومدار ہے وہ نہ بتا دوں ؟ میں نے عرض کیا: جی ہاں ضرور بتائیے، تو آپ صلی اللہ علیہ وسلم نے اپنی زبان مبارک پکڑی اور فرمایا: اسے اپنے قابو میں رکھو ، میں نے عرض کیا: اللہ کے نبی! کیا ہم جو بولتے ہیں اس پر بھی ہماری پکڑ ہو گی؟، آپ صلی اللہ علیہ وسلم نے فرمایا: معاذ! تیری ماں تجھ پر روئے! لوگ اپنی زبانوں کی کارستانیوں کی وجہ سے ہی اوندھے منہ جہنم میں ڈالے جائیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3974,
			"arabicnumber": 3974,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: انسان کی ہر بات کا اس پر وبال ہو گا، اور کسی بات سے فائدہ نہ ہو گا سوائے امر بالمعروف اور نہی عن المنکر اور ذکر الٰہی کے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3975,
			"arabicnumber": 3975,
			"text": "ابوالشعثاء کہتے ہیں کہ ابن عمر رضی اللہ عنہما سے سوال کیا گیا کہ ہم امراء ( حکمرانوں ) کے پاس جاتے ہیں، تو وہاں کچھ اور باتیں کرتے ہیں اور جب وہاں سے نکلتے ہیں تو کچھ اور باتیں کہتے ہیں؟ انہوں نے کہا: ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں اس کو نفاق سمجھتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3976,
			"arabicnumber": 3976,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کسی شخص کے اسلام کی خوبی یہ ہے کہ جس بات کا تعلق اس سے نہ ہو اسے وہ چھوڑ دے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3977,
			"arabicnumber": 3977,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: لوگوں میں سب سے اچھی زندگی والا وہ ہے جو اللہ تعالیٰ کے راستے میں اپنے گھوڑے کی لگام پکڑے ہوئے اس کی پشت پر اڑ رہا ہو، اور جہاں دشمن کی آواز سنے یا مقابلے کا وقت آئے تو فوراً مقابلہ کے لیے اس جانب رخ کرتا ہو، اور موت یا قتل کی جگہیں تلاش کرتا پھرتا ہو اور وہ آدمی ہے جو اپنی بکریوں کو لے کر تنہا کسی پہاڑ کی چوٹی پر رہتا ہو، یا کسی وادی میں جا بسے، نماز قائم کرتا ہو، زکاۃ دیتا ہو، اور اپنے رب کی عبادت کرتا ہو حتیٰ کہ اس حالت میں اسے موت آ جائے کہ وہ لوگوں کا خیرخواہ ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3978,
			"arabicnumber": 3978,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر عرض کیا: لوگوں میں سب سے بہتر اور اچھا کون ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ آدمی جو اپنی جان و مال سے اللہ کی راہ میں جہاد کرتا ہو ، اس نے پوچھا: پھر کون؟ آپ صلی اللہ علیہ وسلم نے فرمایا: پھر وہ آدمی جو کسی گھاٹی میں تنہا اللہ کی عبادت کرتا ہو، اور لوگوں کو اپنے شر سے محفوظ رکھتا ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3979,
			"arabicnumber": 3979,
			"text": "حذیفہ بن یمان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جہنم کے دروازوں کی طرف بلانے والے پیدا ہوں گے، جو ان کے بلاوے پر ادھر جائے گا وہ انہیں جہنم میں ڈال دیں گے ، میں نے عرض کیا: اللہ کے رسول! ہم سے ان کے کچھ اوصاف بتائیے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ لوگ ہم ہی میں سے ہوں گے، ہماری زبان بولیں گے ، میں نے عرض کیا: اگر یہ وقت آئے تو آپ مجھے کیا حکم فرماتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم مسلمانوں کی جماعت اور امام کو لازم پکڑو، اور اگر اس وقت کوئی جماعت اور امام نہ ہو تو ان تمام فرقوں سے علیحدگی اختیار کرو، اگرچہ تمہیں کسی درخت کی جڑ چبانی پڑے حتیٰ کہ تمہیں اسی حالت میں موت آ جائے ا؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3980,
			"arabicnumber": 3980,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب ایسا زمانہ آئے گا کہ اس وقت مسلمان کا بہترین مال بکریاں ہوں گی جنہیں وہ لے کر پہاڑ کی چوٹیوں یا بارش کے مقامات میں چلا جائے گا، وہ اپنا دین فتنوں سے بچاتا پھر رہا ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3981,
			"arabicnumber": 3981,
			"text": "حذیفہ بن الیمان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کچھ ایسے فتنے پیدا ہوں گے کہ ان کے دروازوں پر جہنم کی طرف بلانے والے ہوں گے، لہٰذا اس وقت تمہارے لیے کسی درخت کی جڑ چبا کر جان دے دینا بہتر ہے، بہ نسبت اس کے کہ تم ان بلانے والوں میں سے کسی کی پیروی کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3982,
			"arabicnumber": 3982,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مومن ایک سوراخ سے دو بار نہیں ڈسا جاتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3983,
			"arabicnumber": 3983,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مومن ایک سوراخ سے دو بار نہیں ڈسا جاتا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3984,
			"arabicnumber": 3984,
			"text": "شعبی کہتے ہیں کہ میں نے نعمان بن بشیر رضی اللہ عنہما کو منبر پر یہ کہتے سنا، اور انہوں نے اپنی دو انگلیوں سے اپنے کانوں کی طرف اشارہ کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: حلال واضح ہے، اور حرام بھی، ان کے درمیان بعض چیزیں مشتبہ ہیں جنہیں بہت سے لوگ نہیں جان پاتے ( کہ حلال ہے یا حرام ) جو ان مشتبہ چیزوں سے بچے، اس نے اپنے دین اور اپنی عزت و آبرو کو بچا لیا، اور جو شبہات میں پڑ گیا، وہ ایک دن حرام میں بھی پڑ جائے گا، جیسا کہ چرا گاہ کے قریب جانور چرانے والا اس بات کے قریب ہوتا ہے کہ اس کا جانور اس چراگاہ میں بھی چرنے لگ جائے، خبردار!، ہر بادشاہ کی ایک مخصوص چراگاہ ہوتی ہے، اور اللہ کی چراگاہ اس کی حرام کردہ چیزیں ہیں، آگاہ رہو! بدن میں ایک گوشت کا ٹکڑا ہے، جب تک وہ صحیح رہتا ہے تو پورا جسم صحیح رہتا ہے، اور جب وہ بگڑ جاتا ہے، تو سارا جسم بگڑ جاتا ہے، آگاہ رہو!، وہ دل ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3985,
			"arabicnumber": 3985,
			"text": "معقل بن یسار رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: فتنوں ( کے ایام ) میں عبادت کرنا ایسے ہی ہے جیسے میری طرف ہجرت کرنا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3986,
			"arabicnumber": 3986,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسلام اجنبی حالت میں شروع ہوا اور عنقریب پھر اجنبی ہو جائے گا، تو ایسے وقت میں اس پر قائم رہنے والے اجنبیوں کے لیے خوشخبری ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3987,
			"arabicnumber": 3987,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسلام اجنبی حالت میں شروع ہوا، اور عنقریب پھر اجنبی بن جائے گا، لہٰذا ایسے وقت میں اس پر قائم رہنے والے اجنبیوں کے لیے خوشخبری ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3988,
			"arabicnumber": 3988,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسلام اجنبی حالت میں شروع ہوا، عنقریب پھر اجنبی بن جائے گا، لہٰذا ایسے وقت میں اس پر قائم رہنے والے اجنبیوں کے لیے خوشخبری ہے، آپ سے سوال کیا گیا: غرباء کون ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ لوگ ہیں جو اپنے قبیلے سے نکال دئیے گئے ہوں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3989,
			"arabicnumber": 3989,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ ایک دن وہ مسجد نبوی کی جانب گئے، تو وہاں معاذ بن جبل رضی اللہ عنہ کو دیکھا کہ نبی اکرم صلی اللہ علیہ وسلم کی قبر کے پاس بیٹھے رو رہے ہیں، انہوں نے معاذ رضی اللہ عنہ سے رونے کا سبب پوچھا، تو معاذ رضی اللہ عنہ نے کہا: مجھے ایک ایسی بات رلا رہی ہے جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی، میں نے آپ صلی اللہ علیہ وسلم کو فرماتے سنا: معمولی ریاکاری بھی شرک ہے، بیشک جس نے اللہ کے کسی دوست سے دشمنی کی، تو اس نے اللہ سے اعلان جنگ کیا، اللہ تعالیٰ ان نیک، گم نام متقی لوگوں کو محبوب رکھتا ہے جو اگر غائب ہو جائیں تو کوئی انہیں تلاش نہیں کرتا، اور اگر وہ حاضر ہو جائیں تو لوگ انہیں کھانے کے لیے نہیں بلاتے، اور نہ انہیں پہچانتے ہیں، ان کے دل ہدایت کے چراغ ہیں، ایسے لوگ ہر گرد آلود تاریک فتنے سے نکل جائیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3990,
			"arabicnumber": 3990,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگوں کی مثال ان سو اونٹوں کے مانند ہے، جن میں سے ایک بھی سواری کے لائق نہیں پاؤ گے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3991,
			"arabicnumber": 3991,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہود اکہتر فرقوں میں بٹ گئے، اور میری امت تہتر فرقوں میں بٹ جائے گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3992,
			"arabicnumber": 3992,
			"text": "عوف بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہود اکہتر ( ۷۱ ) فرقوں میں بٹ گئے جن میں سے ایک جنت میں جائے گا اور ستر ( ۷۰ ) جہنم میں، نصاریٰ کے بہتر فرقے ہوئے جن میں سے اکہتر ( ۷۱ ) جہنم میں اور ایک جنت میں جائے گا، قسم ہے اس ذات کی جس کے ہاتھ میں محمد کی جان ہے! میری امت تہتر ( ۷۳ ) فرقوں میں بٹ جائے گی جن میں سے ایک فرقہ جنت میں جائے گا، اور بہتر ( ۷۲ ) فر قے جہنم میں ، عرض کیا گیا: اللہ کے رسول! وہ کون ہوں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: «الجماعة»۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3993,
			"arabicnumber": 3993,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بنی اسرائیل اکہتر فرقوں میں بٹ گئے، اور میری امت بہتر فرقوں میں بٹ جائے گی، سوائے ایک کے سب جہنمی ہوں گے، اور وہ «الجماعة» ہے، ( وہ جماعت جو میری اور میرے صحابہ کی روش اور طریقے پر ہو ) ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3994,
			"arabicnumber": 3994,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم پہلی امتوں کے نقش قدم پر چلو گے اگر وہ ہاتھ پھیلانے کے مقدار چلے ہوں گے ۱؎، تو تم بھی وہی مقدار چلو گے، اور اگر وہ ایک ہاتھ چلے ہوں گے تو تم بھی ایک ہاتھ چلو گے، اور اگر وہ ایک بالشت چلے ہوں گے تو تم بھی ایک بالشت چلو گے، یہاں تک کہ اگر وہ گوہ کے سوراخ میں داخل ہوئے ہوں گے تو تم بھی اس میں داخل ہو گے ، لوگوں نے عرض کیا: اللہ کے رسول! کیا وہ یہود اور نصاریٰ ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تب اور کون ہو سکتے ہیں ؟ ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3995,
			"arabicnumber": 3995,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور خطبہ دیتے ہوئے لوگوں سے فرمایا: اللہ کی قسم، لوگو! مجھے تمہارے متعلق کسی بات کا خوف نہیں، ہاں صرف اس بات کا ڈر ہے کہ اللہ تعالیٰ تمہیں دنیاوی مال و دولت سے نوازے گا ، ایک شخص نے عرض کیا: اللہ کے رسول! کیا خیر ( مال و دولت ) سے شر پیدا ہوتا ہے؟ یہ سن کر آپ صلی اللہ علیہ وسلم خاموش ہو گئے، پھر قدرے سکوت کے بعد فرمایا: تم نے کیسے کہا تھا ؟ میں نے عرض کیا: کیا خیر ( یعنی مال و دولت کی زیادتی ) سے شر پیدا ہوتا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: خیر سے تو خیر ہی پیدا ہوتا ہے، اور کیا وہ مال خیر ہے؟ ہر وہ سبزہ جسے موسم بہار اگاتا ہے، جانور کا پیٹ پھلا کر بدہضمی سے مار ڈالتا ہے، یا مرنے کے قریب کر دیتا ہے، مگر اس جانور کو جو گھاس کھائے یہاں تک کہ جب پیٹ پھول کر اس کے دونوں پہلو تن جائیں تو دھوپ میں چل پھر کر، پاخانہ پیشاب کرے، اور جگالی کر کے ہضم کر لے، اور واپس آ کر پھر کھائے، تو اسی طرح جو شخص مال کو جائز طریقے سے حاصل کرے گا، تو اس کے مال میں برکت ہو گی، اور جو اسے ناجائز طور پر حاصل کرے گا، تو اس کی مثال ایسی ہے جیسے کوئی کھاتا رہے اور آسودہ نہ ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3996,
			"arabicnumber": 3996,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم پر فارس اور روم کے خزانے کھول دئیے جائیں گے، تو اس وقت تم کون لوگ ہو گے ( تم کیا کہو گے ) ؟ عبدالرحمٰن بن عوف رضی اللہ عنہ نے عرض کیا: ہم وہی کہیں گے ( اور کریں گے ) جو اللہ نے ہمیں حکم دیا ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا اس کے علاوہ کچھ اور نہیں کہو گے؟ تم مال میں ایک دوسرے سے آگے بڑھنے کی خواہش کرو گے، اور ایک دوسرے سے حسد کرو گے، پھر ایک دوسرے سے منہ موڑو گے، اور ایک دوسرے سے بغض و نفرت رکھو گے یا ایسا ہی کچھ آپ صلی اللہ علیہ وسلم نے پھر فرمایا: اس کے بعد مسکین مہاجرین کے پاس جاؤ گے، پھر ان کا بوجھ ان ہی پر رکھو گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3997,
			"arabicnumber": 3997,
			"text": "عمرو بن عوف رضی اللہ عنہ جو بنو عامر بن لوی کے حلیف تھے اور جنگ بدر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شریک تھے کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوعبیدہ بن جراح رضی اللہ عنہ کو بحرین کا جزیہ وصول کرنے کے لیے بھیجا، آپ صلی اللہ علیہ وسلم نے بحرین والوں سے صلح کر لی تھی، اور ان پر علاء بن حضرمی رضی اللہ عنہ کو امیر مقرر کیا تھا، ابوعبیدہ ( ابوعبیدہ بن جراح رضی اللہ عنہ ) بحرین سے مال لے کر آئے، اور جب انصار نے ان کے آنے کی خبر سنی تو سب نماز فجر میں آئے، اور رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز ادا کی، پھر جب آپ نماز پڑھ کر لوٹے، تو راستے میں یہ لوگ آپ کے سامنے آ گئے، آپ انہیں دیکھ کر مسکرائے، پھر فرمایا: میں سمجھتا ہوں کہ تم لوگوں نے یہ سنا کہ ابوعبیدہ بحرین سے کچھ مال لائے ہیں ، انہوں نے عرض کیا: جی ہاں، اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: تو تم لوگ خوش ہو جاؤ، اور امید رکھو اس چیز کی جو تم کو خوش کر دے گی، اللہ کی قسم! میں تم پر فقر اور مفلسی سے نہیں ڈرتا، لیکن میں اس بات سے ڈرتا ہوں کہ کہیں دنیا تم پر اسی طرح کشادہ نہ کر دی جائے جیسے تم سے پہلے کے لوگوں پر کر دی گئی تھی، تو تم بھی اسی طرح سبقت کرنے لگو جیسے ان لوگوں نے کی تھی، پھر تم بھی اسی طرح ہلاک ہو جاؤ جس طرح وہ ہلاک ہو گئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3998,
			"arabicnumber": 3998,
			"text": "اسامہ بن زید رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں اپنے بعد مردوں کے لیے عورتوں سے زیادہ نقصان دہ اور مضر کوئی فتنہ نہیں پاتا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3999,
			"arabicnumber": 3999,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہر صبح دو فرشتے یہ پکارتے ہیں: مردوں کے لیے عورتوں کی وجہ سے بربادی ہے، اور عورتوں کے لیے مردوں کی وجہ سے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4000,
			"arabicnumber": 4000,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم خطبہ دینے کھڑے ہوئے، تو اس خطبہ میں یہ بھی فرمایا: دنیا ہری بھری اور میٹھی ہے، اللہ تعالیٰ تمہیں اس میں خلیفہ بنانے والا ہے، تو وہ دیکھے گا کہ تم کیسے عمل کرتے ہو؟ سنو! تم دنیا سے بھی بچاؤ کرو، اور عورتوں سے بھی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4001,
			"arabicnumber": 4001,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مسجد میں بیٹھے ہوئے تھے، اتنے میں قبیلہ مزینہ کی ایک عورت مسجد میں بنی ٹھنی اتراتی ہوئی داخل ہوئی، تو آپ صلی اللہ علیہ وسلم نے فرمایا: لوگو! اپنی عورتوں کو زیب و زینت کا لباس پہن کر اور ناز و ادا کے ساتھ مسجد میں آنے سے منع کرو، کیونکہ بنی اسرائیل پر اللہ تعالیٰ کی لعنت اس وقت آئی تھی جبکہ ان کی عورتوں نے لباس فاخرہ پہننے شروع کئے، اور مسجدوں میں ناز و ادا کے ساتھ داخل ہونے لگیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4002,
			"arabicnumber": 4002,
			"text": "ابورہم کے عبید نامی غلام کہتے ہیں کہ ابوہریرہ رضی اللہ عنہ کا سامنا ایک ایسی عورت سے ہوا جو خوشبو لگائے مسجد جا رہی تھی، تو انہوں نے کہا: اللہ کی بندی! کہاں جا رہی ہو؟ اس نے جواب دیا: مسجد، ابوہریرہ رضی اللہ عنہ نے کہا: کیا تم نے اسی کے لیے خوشبو لگا رکھی ہے؟ اس نے عرض کیا: جی ہاں، انہوں نے کہا: بیشک میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: جو عورت خوشبو لگا کر مسجد جائے، تو اس کی نماز قبول نہیں ہوتی یہاں تک کہ وہ غسل کر لے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4003,
			"arabicnumber": 4003,
			"text": "عبداللہ بن عمر رضی اللہ عنہا کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عورتوں کی جماعت! تم صدقہ و خیرات کرو، کثرت سے استغفار کیا کرو، کیونکہ میں نے جہنم میں تم عورتوں کو زیادہ دیکھا ہے ، ان میں سے ایک سمجھ دار عورت نے سوال کیا: اللہ کے رسول ہمارے جہنم میں زیادہ ہونے کی کیا وجہ ہے؟، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم لعنت و ملامت زیادہ کرتی ہو، اور شوہر کی ناشکری کرتی ہو، میں نے باوجود اس کے کہ تم ناقص العقل اور ناقص الدین ہو، تم سے زیادہ مرد کی عقل کو مغلوب اور پسپا کر دینے والا کسی کو نہیں دیکھا ، اس عورت نے عرض کیا: اللہ کے رسول! ہماری عقل اور دین کا نقصان کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تمہاری عقل کی کمی ( و نقصان ) تو یہ ہے کہ دو عورتوں کی گواہی ایک مرد کی گواہی کے برابر ہے، اور دین کی کمی یہ ہے کہ تم کئی دن ایسے گزارتی ہو کہ اس میں نہ نماز پڑھ سکتی ہو، اور نہ رمضان کے روزے رکھ سکتی ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4004,
			"arabicnumber": 4004,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: تم بھلی بات کا حکم دو، اور بری بات سے منع کرو، اس سے پہلے کہ تم دعا کرو اور تمہاری دعا قبول نہ کی جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4005,
			"arabicnumber": 4005,
			"text": "قیس بن ابی حازم کہتے ہیں کہ ابوبکر رضی اللہ عنہ نے کھڑے ہو کر اللہ تعالیٰ کی حمد و ثنا بیان کی، اس کے بعد فرمایا: لوگو! تم یہ آیت پڑھتے ہو: «يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم» اے ایمان والو! اپنے آپ کی فکر کرو، اور تمہیں دوسرے شخص کی گمراہی ضرر نہ دے گی، جب تم ہدایت پر ہو ( سورة المائدة: 105 ) ۔ اور بیشک ہم نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: جب لوگ کوئی بری بات دیکھیں اور اس کو دفع نہ کریں تو قریب ہے کہ اللہ تعالیٰ ان پر اپنا عام عذاب نازل کر د ے ۔ ابواسامہ نے دوسری بار کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4006,
			"arabicnumber": 4006,
			"text": "ابوعبیدہ (عامر) کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بنی اسرائیل میں جب خرابیاں پیدا ہوئیں، تو ان کا حال یہ تھا کہ آدمی اپنے بھائی کو گناہ کرتے دیکھتا تو اسے روکتا، لیکن دوسرے دن پھر اس کے ساتھ کھاتا پیتا اور مل جل کر رہتا، تو اللہ تعالیٰ نے ان کے دلوں کو مردہ کر دیا، اور آپس کی محبت ختم کر دی، اور ان ہی لوگوں کے بارے میں قرآن اترا، چنانچہ آپ صلی اللہ علیہ وسلم نے «لعن الذين كفروا من بني إسرائيل على لسان داود وعيسى ابن مريم»کی تلاوت کی یہاں تک کہ آپ «ولو كانوا يؤمنون بالله والنبي وما أنزل إليه ما اتخذوهم أولياء ولكن كثيرا منهم فاسقون» ( سورۃ المائدہ: ۷۸ -۸۱ ) تک پہنچے۔ ( جن لوگوں نے کفر کیا ان پر داود اور عیسیٰ بن مریم ( علیہم السلام ) کی زبانی لعنت کی گئی، کیونکہ وہ نافرمانی اور حد سے تجاوز کرتے تھے، وہ جس برائی کے خود مرتکب ہوتے اس سے لوگوں کو بھی نہیں روکتے تھے، بہت ہی برا کرتے تھے، تو ان میں سے اکثر کو دیکھ رہا ہے کہ وہ کافروں سے دوستی رکھتے ہیں یہ وطیرہ انہوں نے اپنے حق میں بہت ہی برا اختیار کیا ہے، نتیجہ یہ ہے کہ اللہ ان پر سخت ناراض ہے، اور آخرت میں یہ لوگ ہمیشہ ہمیش کے عذاب میں رہیں گے، اور اگر یہ اللہ پر اور نبی پر اور جو اس کی طرف اترا ہے اس پر ایمان لاتے تو ان کافروں کو دوست نہ بناتے، لیکن بہت سے ان میں فاسق ( بدکار اور بے راہ ) ہیں۔ رسول اللہ صلی اللہ علیہ وسلم ٹیک لگائے ہوئے تھے، پھر آپ بیٹھ گئے اور فرمایا: تم اس وقت تک عذاب سے محفوظ نہیں رہ سکتے جب تک کہ تم ظالم کو ظلم کرتے دیکھ کر اس کا ہاتھ پکڑ کر اسے انصاف کرنے پر مجبور نہ کر دو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4007,
			"arabicnumber": 4007,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم خطبہ دینے کے لیے کھڑے ہوئے تو جو باتیں کہیں، ان میں یہ بات بھی تھی: آگاہ رہو! کسی شخص کو لوگوں کا خوف حق بات کہنے سے نہ روکے، جب وہ حق کو جانتا ہو ، یہ حدیث بیان کر کے ابو سعید خدری رضی اللہ عنہ رونے لگے اور فرمایا: اللہ کی قسم! ہم نے بہت سی باتیں ( خلاف شرع ) دیکھیں، لیکن ہم ڈر اور ہیبت کا شکار ہو گئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4008,
			"arabicnumber": 4008,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کوئی شخص اپنے آپ کو حقیر نہ جانے ، لوگوں نے عرض کیا: اللہ کے رسول! ہم میں سے کوئی اپنے آپ کو کیسے حقیر جانتا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی شخص کوئی بات ہوتے دیکھے اور اس کے بارے میں اسے اللہ کا حکم معلوم ہو لیکن نہ کہے، تو اللہ تعالیٰ قیامت کے دن اس سے فرمائے گا: تجھے فلاں بات کہنے سے کس نے منع کیا تھا؟ وہ جواب دے گا: لوگوں کے خوف نے، اللہ تعالیٰ فرمائے گا: تیرے لیے زیادہ درست بات یہ تھی کہ تو مجھ سے ڈرتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4009,
			"arabicnumber": 4009,
			"text": "جریر بن عبداللہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس قوم میں گناہوں کا ارتکاب ہوتا ہے، اور ان میں ایسے زور آور لوگ ہوں جو انہیں روک سکتے ہوں لیکن وہ نہ روکیں، تو اللہ تعالیٰ سب کو اپنے عذاب میں گرفتار کر لیتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4010,
			"arabicnumber": 4010,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ جب سمندر کے مہاجرین ( یعنی مہاجرین حبشہ ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں واپس آئے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم لوگ مجھ سے وہ عجیب باتیں کیوں نہیں بیان کرتے جو تم نے ملک حبشہ میں دیکھی ہیں؟ ، ان میں سے ایک نوجوان نے عرض کیا: کیوں نہیں، اللہ کے رسول! اسی دوران کہ ہم بیٹھے ہوئے تھے، ان راہباؤں میں سے ایک بوڑھی راہبہ ہمارے سامنے سر پر پانی کا مٹکا لیے ہوئے ایک حبشی نوجوان کے قریب سے ہو کر گزری، تو اس حبشی نوجوان نے اپنا ایک ہاتھ اس بڑھیا کے دونوں کندھوں کے درمیان رکھ کر اس کو دھکا دیا جس کے باعث وہ گھٹنوں کے بل زمین پر گر پڑی، اور اس کا مٹکا ٹوٹ گیا، جب وہ اٹھی تو اس حبشی نوجوان کی طرف متوجہ ہو کر کہنے لگی: غدار! ( دھوکا باز ) عنقریب تجھے پتہ چل جائے گا جب اللہ تعالیٰ کرسی رکھے ہو گا، اور اگلے پچھلے سارے لوگوں کو جمع کرے گا، اور ہاتھ پاؤں ہر اس کام کی گواہی دیں گے جو انہوں نے کیے ہیں، تو کل اس کے پاس تجھے اپنا اور میرا فیصلہ معلوم ہو جائے گا۔ رسول اللہ صلی اللہ علیہ وسلم یہ واقعہ سنتے جاتے اور فرماتے جاتے: اس بڑھیا نے سچ کہا، اس بڑھیا نے سچ کہا، اللہ تعالیٰ اس امت کو گناہوں سے کیسے پاک فرمائے گا، جس میں کمزور کا بدلہ طاقتور سے نہ لیا جا سکے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4011,
			"arabicnumber": 4011,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سب سے بہتر جہاد، ظالم حکمران کے سامنے حق و انصاف کی بات کہنی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4012,
			"arabicnumber": 4012,
			"text": "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ جمرہ اولیٰ کے پاس رسول اللہ صلی اللہ علیہ وسلم کے سامنے ایک شخص نے آ کر عرض کیا: اللہ کے رسول! کون سا جہاد سب سے بہتر ہے؟ آپ صلی اللہ علیہ وسلم خاموش رہے، پھر جب آپ صلی اللہ علیہ وسلم نے دوسرے جمرہ کی رمی کی تو اس نے پھر آپ سے یہی سوال کیا، آپ صلی اللہ علیہ وسلم خاموش رہے، پھر جب آپ نے جمرہ عقبہ کی رمی کی، تو سوار ہونے کے لیے آپ نے اپنا پاؤں رکاب میں رکھا اور فرمایا: سوال کرنے والا کہاں ہے ؟، اس نے عرض کیا: میں حاضر ہوں، اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: ( سب سے بہتر جہاد ) ظالم حکمران کے سامنے حق و انصاف کی بات کہنی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4013,
			"arabicnumber": 4013,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ مروان نے عید کے دن منبر نکلوایا اور نماز عید سے پہلے خطبہ شروع کر دیا، تو ایک شخص نے کہا: مروان! آپ نے سنت کے خلاف کیا، ایک تو آپ نے اس دن منبر نکالا حالانکہ اس دن منبر نہیں نکالا جاتا، پھر آپ نے نماز سے پہلے خطبہ شروع کیا، حالانکہ نماز سے پہلے خطبہ نہیں ہوتا، ابو سعید خدری رضی اللہ عنہ نے کہا: اس شخص نے تو اپنا وہ حق جو اس پر تھا ادا کر دیا، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: تم میں سے جو شخص کوئی بات خلاف شرع دیکھے، تو اگر اسے ہاتھ سے روکنے کی طاقت رکھتا ہو تو اسے ہاتھ سے روک دے، اگر اس کی طاقت نہ ہو تو اپنی زبان سے روکے، اور اگر اس کی بھی طاقت نہ ہو تو اس کو دل سے برا جانے، اور یہ ایمان کا سب سے معمولی درجہ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4014,
			"arabicnumber": 4014,
			"text": "ابوامیہ شعبانی کہتے ہیں کہ میں ابوثعلبہ خشنی رضی اللہ عنہ کے پاس آیا، اور میں نے ان سے پوچھا کہ اس آیت کریمہ کے بارے میں آپ کا کیا خیال ہے؟ انہوں نے پوچھا: کون سی آیت؟ میں نے عرض کیا: «يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم» اے ایمان والو! اپنے آپ کی فکر کرو، جب تم ہدایت یاب ہو گے تو دوسروں کی گمراہی تمہیں ضرر نہیں پہنچائے گی ( سورة المائدة: 105 ) انہوں نے کہا: تم نے ایک جان کار شخص سے اس کے متعلق سوال کیا ہے، میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا: تو آپ صلی اللہ علیہ وسلم نے فرمایا: بلکہ تم اچھی باتوں کا حکم دو، اور بری باتوں سے روکو یہاں تک کہ جب تم دیکھو کہ بخیل کی اطاعت کی جاتی ہے، خواہشات کے پیچھے چلا جاتا ہے، اور دنیا کو ترجیح دی جاتی ہے، ہر صاحب رائے اپنی رائے اور عقل پر نازاں ہے اور تمہیں ایسے کام ہوتے نظر آئیں جنہیں روکنے کی تم میں طاقت نہ ہو تو ایسے وقت میں تم خاص اپنے آپ سے کام رکھو۔ تمہارے پیچھے ایسے دن بھی آئیں گے کہ ان میں صبر کرنا مشکل ہو جائے گا، اور اس وقت دین پر صبر کرنا اتنا مشکل ہو جائے گا جتنا کہ انگارے کو ہاتھ میں پکڑنا، اس زمانہ میں عمل کرنے والے کو اتنا ثواب ملے گا، جتنا اس جیسا عمل کرنے والے پچاس لوگوں کو ملے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4015,
			"arabicnumber": 4015,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ عرض کیا گیا: اللہ کے رسول! ہم امر بالمعروف اور نہی عن المنکر کو کس وقت ترک کریں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس وقت جب تم میں وہ باتیں ظاہر ہو جائیں جو گذشتہ امتوں میں ظاہر ہوئی تھیں ، ہم نے عرض کیا: اللہ کے رسول! ہم سے گذشتہ امتوں میں کون سی باتیں ظاہر ہوئی تھیں؟، آپ صلی اللہ علیہ وسلم نے فرمایا: حکومت تمہارے کم عمروں میں چلی جائے گی، اور تمہارے بڑے آدمیوں میں فحش کاری آ جائے گی، اور علم تمہارے ذلیل لوگوں میں چلا جائے ۔ زید کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے اس قول: «والعلم في رذالتكم» کا مطلب یہ ہے کہ علم ( دین ) فاسقوں میں چلا جائے گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4016,
			"arabicnumber": 4016,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مومن کے لیے یہ جائز نہیں کہ وہ اپنے آپ کو رسوا و ذلیل کرے ، لوگوں نے عرض کیا: اپنے آپ کو کیسے رسوا و ذلیل کرے گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ایسی مصیبت کا سامنا کرے گا، جس کی اس میں طاقت نہ ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4017,
			"arabicnumber": 4017,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: اللہ تعالیٰ قیامت کے دن بندے سے سوال کرے گا یہاں تک کہ وہ پو چھے گا کہ تم نے جب خلاف شرع کام ہوتے دیکھا تو اسے منع کیوں نہ کیا؟ تو جب اس سے کوئی جواب نہ بن سکے گا تو اللہ تعالیٰ خود اس کو جواب سکھائے گا اور وہ عرض کرے گا: اے میرے رب! میں نے تیرے رحم کی امید رکھی، اور لوگوں کا خوف کیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4018,
			"arabicnumber": 4018,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ ظالم کو ڈھیل دیتا رہتا ہے، لیکن اسے پکڑتا ہے تو پھر نہیں چھوڑتا، اس کے بعد آپ صلی اللہ علیہ وسلم نے آیت: «وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة» تمہارے رب کی پکڑ ایسی ہی ہے جب وہ کسی ظالم بستی کو پکڑتا ہے ( سورة الهود: 102 ) ، کی تلاوت کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4019,
			"arabicnumber": 4019,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہماری طرف متوجہ ہو کر فرمایا: مہاجرین کی جماعت! پانچ باتیں ہیں جب تم ان میں مبتلا ہو جاؤ گے، اور میں اللہ کی پناہ چاہتا ہوں اس بات سے کہ تم اس میں مبتلا ہو، ( وہ پانچ باتیں یہ ہیں ) پہلی یہ کہ جب کسی قوم میں علانیہ فحش ( فسق و فجور اور زناکاری ) ہونے لگ جائے، تو ان میں طاعون اور ایسی بیماریاں پھوٹ پڑتی ہیں جو ان سے پہلے کے لوگوں میں نہ تھیں، دوسری یہ کہ جب لوگ ناپ تول میں کمی کرنے لگ جاتے ہیں تو وہ قحط، معاشی تنگی اور اپنے حکمرانوں کی زیادتی کا شکار ہو جاتے ہیں، تیسری یہ کہ جب لوگ اپنے مالوں کی زکاۃ ادا نہیں کرتے ہیں تو اللہ تعالیٰ آسمان سے بارش کو روک دیتا ہے، اور اگر زمین پر چوپائے نہ ہوتے تو آسمان سے پانی کا ایک قطرہ بھی نہ گرتا، چوتھی یہ کہ جب لوگ اللہ اور اس کے رسول کے عہد و پیمان کو توڑ دیتے ہیں تو اللہ تعالیٰ ان پر ان کے علاوہ لوگوں میں سے کسی دشمن کو مسلط کر دیتا ہے، وہ جو کچھ ان کے پاس ہوتا ہے چھین لیتا ہے، پانچویں یہ کہ جب ان کے حکمراں اللہ تعالیٰ کی کتاب کے مطابق فیصلے نہیں کرتے، اور اللہ نے جو نازل کیا ہے اس کو اختیار نہیں کرتے، تو اللہ تعالیٰ ان میں پھوٹ اور اختلاف ڈال دیتا ہے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4020,
			"arabicnumber": 4020,
			"text": "ابو مالک اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میری امت میں سے کچھ لوگ شراب پئیں گے، اور اس کا نام کچھ اور رکھیں گے، ان کے سروں پر باجے بجائے جائیں گے، اور گانے والی عورتیں گائیں گی، تو اللہ تعالیٰ انہیں زمین میں دھنسا دے گا، اور ان میں سے بعض کو بندر اور سور بنا دے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4021,
			"arabicnumber": 4021,
			"text": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اس آیت کریمہ: «يلعنهم الله ويلعنهم اللاعنون» یہی وہ لوگ ہیں جن پر اللہ لعنت کرتا ہے اور لعنت کرنے والے لعنت کرتے ہیں ( سورة البقرة: 159 ) ، کی تفسیر میں فرمایا: «اللاعنون» سے زمین کے چوپائے مراد ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4022,
			"arabicnumber": 4022,
			"text": "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نیکی ہی عمر کو بڑھاتی ہے، اور تقدیر کو دعا کے علاوہ کوئی چیز نہیں ٹال سکتی، اور کبھی آدمی اپنے گناہ کی وجہ سے ملنے والے رزق سے محروم ہو جاتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4023,
			"arabicnumber": 4023,
			"text": "سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! لوگوں میں سب سے زیادہ مصیبت اور آزمائش کا شکار کون ہوتا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: انبیاء، پھر جو ان کے بعد مرتبہ میں ہیں، پھر جو ان کے بعد ہیں، بندے کی آزمائش اس کے دین کے مطابق ہوتی ہے، اگر وہ دین میں سخت اور پختہ ہے تو آزمائش بھی سخت ہو گی، اور اگر دین میں نرم اور ڈھیلا ہے تو مصیبت بھی اسی انداز سے نرم ہو گی، مصیبتوں سے بندے کے گناہوں کا کفارہ ہوتا رہتا ہے یہاں تک کہ بندہ روے زمین پر اس حال میں چلتا ہے کہ اس پر کوئی گناہ نہیں ہوتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4024,
			"arabicnumber": 4024,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، آپ کو بخار آ رہا تھا، میں نے اپنا ہاتھ آپ پر رکھا تو آپ کے بخار کی گرمی مجھے اپنے ہاتھوں میں لحاف کے اوپر سے محسوس ہوئی، میں نے عرض کیا: اللہ کے رسول! آپ کو بہت ہی سخت بخار ہے! آپ صلی اللہ علیہ وسلم نے فرمایا: ہمارا یہی حال ہے ہم لوگوں پر مصیبت بھی دگنی ( سخت ) آتی ہے، اور ثواب بھی دگنا ملتا ہے ، میں نے عرض کیا: اللہ کے رسول! کن لوگوں پر زیادہ سخت مصیبت آتی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: انبیاء پر ، میں نے عرض کیا: اللہ کے رسول! پھر کن پر؟ آپ صلی اللہ علیہ وسلم نے فرمایا: پھر نیک لوگوں پر، بعض نیک لوگ ایسی تنگ دستی میں مبتلا کر دئیے جاتے ہیں کہ ان کے پاس ایک چوغہ کے سوا جسے وہ اپنے اوپر لپیٹتے رہتے ہیں کچھ نہیں ہوتا، اور بعض آزمائش سے اس قدر خوش ہوتے ہیں جتنا تم میں سے کوئی مال و دولت ملنے پر خوش ہوتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4025,
			"arabicnumber": 4025,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ گویا میں رسول اللہ صلی اللہ علیہ وسلم کو دیکھ رہا ہوں، آپ صلی اللہ علیہ وسلم انبیاء کرام ( علیہم السلام ) میں سے ایک نبی کی حکایت بیان کر رہے تھے جن کو ان کی قوم نے مارا پیٹا تھا، وہ اپنے چہرے سے خون پونچھتے جاتے تھے، اور یہ کہتے جاتے تھے: اے میرے رب! میری قوم کی مغفرت فرما، کیونکہ وہ لوگ نہیں جانتے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4026,
			"arabicnumber": 4026,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہم ابراہیم علیہ السلام سے زیادہ شک کرنے کے حقدار ہیں ۱؎ جب انہوں نے کہا: اے میرے رب تو مجھ کو دکھا کہ تو مردوں کو کیسے زندہ کرے گا؟ تو اللہ نے فرمایا: کیا تجھے یقین نہیں ہے؟ انہوں نے عرض کیا: کیوں نہیں ( لیکن یہ سوال اس لیے ہے ) کہ میرے دل کو اطمینان حاصل ہو جائے، اور اللہ تعالیٰ لوط علیہ السلام پر رحم کرے، وہ زور آور شخص کی پناہ ڈھونڈھتے تھے، اگر میں اتنے دنوں تک قید میں رہا ہوتا جتنے عرصہ یوسف علیہ السلام رہے، تو جس وقت بلانے والا آیا تھا میں اسی وقت اس کے ساتھ ہو لیتا ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4027,
			"arabicnumber": 4027,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ جنگ احد کے دن جب رسول اللہ صلی اللہعلیہ وسلم کے سامنے کے چار دانتوں میں سے ایک دانت ٹوٹ گیا، اور سر زخمی ہو گیا، تو خون آپ کے چہرہ مبارک پر بہنے لگا، آپ صلی اللہ علیہ وسلم خون کو اپنے چہرہ سے پونچھتے جاتے تھے اور فرماتے جاتے تھے: وہ قوم کیسے کامیاب ہو سکتی ہے جس نے اپنے نبی کے چہرے کو خون سے رنگ دیا ہو، حالانکہ وہ انہیں اللہ کی طرف دعوت دے رہا تھا، تو اس وقت اللہ تعالیٰ نے یہ آیت نازل فرمائی: «ليس لك من الأمر شيء» اے نبی! آپ کو اس معاملے میں کچھ اختیار نہیں ہے ( سورة آل عمران: 128 ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4028,
			"arabicnumber": 4028,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ ایک دن جبرائیل علیہ السلام رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، اس وقت آپ غمگین بیٹھے ہوئے تھے، اور لہولہان تھے، اہل مکہ میں سے کچھ لوگوں نے آپ کو خشت زنی کر کے لہولہان کر دیا تھا، انہوں نے کہا: آپ کو کیا ہو گیا؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ان لوگوں نے میرے ساتھ یہ سلوک کیا ہے ، جبرائیل علیہ السلام نے عرض کیا: آپ چاہتے ہیں کہ میں آپ کو کوئی نشانی دکھاؤں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں دکھائیے ، پھر جبرائیل علیہ السلام نے وادی کے پیچھے ایک درخت کی طرف دیکھا، اور کہا: آپ اس درخت کو بلائیے، تو آپ صلی اللہ علیہ وسلم نے اسے آواز دی، وہ آ کر آپ کے سامنے کھڑا ہو گیا، پھر انہوں نے کہا: آپ اس سے کہیے کہ وہ واپس جائے، آپ صلی اللہ علیہ وسلم نے اسے واپس جانے کو کہا، تو وہ اپنی جگہ چلا گیا، ( یہ دیکھ کر ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میرے لیے یہ نشانی ( معجزہ ) ہی کافی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4029,
			"arabicnumber": 4029,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمام مسلمانوں کی تعداد شمار کر کے مجھے بتاؤ ، ہم نے عرض کیا: اللہ کے رسول! کیا آپ ہم پر ( اب بھی دشمن کی طرف سے ) خطرہ محسوس کرتے ہیں، جب کہ اب ہماری تعداد چھ اور سات سو کے درمیان ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم لوگ نہیں جانتے شاید کہ تم آزمائے جاؤ ۔ حذیفہ رضی اللہ عنہ کہتے ہیں: تو واقعی ہم آزمائے گئے، یہاں تک کہ ہم میں سے اگر کوئی نماز بھی پڑھتا تو چھپ کر پڑھتا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4030,
			"arabicnumber": 4030,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے معراج کی رات ایک خوشبو محسوس کی تو آپ صلی اللہ علیہ وسلم نے فرمایا: جبرائیل! یہ کیسی خوشبو ہے ؟، انہوں نے کہا: یہ اس عورت کی قبر کی خوشبو ہے جو فرعون کی بیٹی کو کنگھی کرتی تھی، اور اس کے دونوں بیٹوں اور شوہر کے قبر کی خوشبو ہے، ( جنہیں ایمان لانے کی وجہ سے فرعون نے قتل کر دیا تھا ) اور ان کے قصے کی ابتداء اس طرح ہے کہ خضر بنی اسرائیل کے شریف لوگوں میں تھے، ان کا گزر ایک ( راہب ) درویش کے عبادت خانے سے ہوتا تو وہ عابد راہب اوپر سے ان کو جھانکتا، اور ان کو اسلام کی تعلیم دیتا، آخر کار جب خضر جوان ہوئے تو ان کے والد نے ایک عورت سے ان کا نکاح کر دیا، خضر نے اس عورت کو اسلام کی تعلیم دی، اور اس سے عہد لے لیا کہ اس بات سے کسی کو باخبر مت کرنا، خضر عورتوں کے قریب نہیں جاتے تھے، آخر انہوں نے اس عورت کو طلاق دے دی، اس کے بعد ان کے والد نے ان کا نکاح دوسری عورت سے کر دیا، خضر نے اس سے بھی نہ بتانے کا عہد لے کر اسے دین کی تعلیم دی، لیکن ان میں سے ایک عورت نے اس راز کو چھپا لیا، اور دوسری نے ظاہر کر دیا ( کہ یہ دین کی تعلیم اسے خضر نے سکھائی ہے، فرعون نے ان کی گرفتاری کا حکم دیا یہ سنتے ہی ) وہ فرار ہو کر سمندر کے ایک جزیرہ میں چھپ گئے، وہاں دو شخص لکڑیاں چننے کے لیے آئے، اور ان دونوں نے خضر کو دیکھا، ان میں سے بھی ایک نے تو ان کا حال پوشیدہ رکھا، اور دوسرے نے ظاہر کر دیا اور کہا: میں نے خضر کو فلاں جزیرے میں دیکھا ہے، لوگوں نے اس سے پوچھا کہ کیا تمہارے ساتھ اور کسی شخص نے دیکھا ہے؟ اس نے کہا: فلاں شخص نے بھی دیکھا ہے، جب اس شخص سے سوال کیا گیا تو اس نے چھپایا، اور ان کا طریقہ یہ تھا کہ جو جھوٹ بولے، اسے قتل کر دیا جائے، الغرض اس شخص نے اس عورت سے نکاح کر لیا، جس نے اپنا دین چھپایا تھا، ( اور خضر کا نام نہیں بتایا تھا ) ، اسی دوران کہ یہ عورت فرعون کی بیٹی کے سر میں کنگھی کر رہی تھی، اتنے میں اس کے ہاتھ سے کنگھی گر پڑی اور اس کی زبان سے بے اختیار نکل گیا کہ فرعون تباہ و برباد ہو ( اپنی بے دینی کی وجہ سے ) بیٹی نے یہ کلمہ اس کی زبان سے سن کر اسے اپنے باپ کو بتا دیا، اور اس عورت کے دو بیٹے تھے، اور ایک شوہر تھا، فرعون نے ان سبھوں کو بلا بھیجا، اور عورت اور اس کے شوہر کو دین اسلام چھوڑ کر اپنے دین میں آنے کے لیے پھسلایا، ان دونوں نے انکار کیا، تو اس نے کہا: میں تم دونوں کو قتل کر دوں گا، ان دونوں نے جواب دیا: اگر تم ہمیں قتل کرنا چاہتے ہو تو ہم پر اتنا احسان کرنا کہ ہمیں ایک ہی قبر میں دفن کر دینا، چنانچہ فرعون نے ایسا ہی کیا، جب نبی اکرم صلی اللہعلیہ وسلم نے اسراء کی رات میں خوشبو محسوس کی، تو آپ صلی اللہ علیہ وسلم نے جبرائیل سے پوچھا تو انہوں نے آپ کو بتلایا کہ یہ انہیں لوگوں کی قبر ہے ( جس سے یہ خوشبو آ رہی ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4031,
			"arabicnumber": 4031,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جتنی بڑی مصیبت ہوتی ہے اتنا ہی بڑا ثواب ہوتا ہے، اور بیشک اللہ تعالیٰ جب کسی قوم سے محبت کرتا ہے تو اسے آزماتا ہے، پھر جو کوئی اس سے راضی و خوش رہے تو وہ اس سے راضی رہتا ہے، اور جو کوئی اس سے خفا ہو تو وہ بھی اس سے خفا ہو جاتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4032,
			"arabicnumber": 4032,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: وہ مومن جو لوگوں سے مل جل کر رہتا ہے، اور ان کی ایذاء پر صبر کرتا ہے، تو اس کا ثواب اس مومن سے زیادہ ہے جو لوگوں سے الگ تھلگ رہتا ہے، اور ان کی ایذاء رسانی پر صبر نہیں کرتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4033,
			"arabicnumber": 4033,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس میں تین باتیں ہوں گی وہ ایمان کا ذائقہ پائے گا، ( بندار کی روایت میں ہے کہ وہ ایمان کی حلاوت ( مٹھاس ) پائے گا ) ایک وہ شخص جو کسی سے صرف اللہ کے لیے محبت کرتا ہو، دوسرے وہ جسے اللہ اور اس کا رسول دنیا کی تمام چیزوں سے زیادہ محبوب ہوں، تیسرے وہ شخص جسے اللہ تعالیٰ نے کفر سے نجات دی، اس کے بعد اسے آگ میں ڈالا جانا تو پسند ہو، لیکن کفر کی طرف پلٹ جانا پسند نہ ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4034,
			"arabicnumber": 4034,
			"text": "ابو الدرداء رضی اللہ عنہ کہتے ہیں کہ میرے خلیل صلی اللہ علیہ وسلم نے مجھ کو وصیت کی ہے کہ تم اللہ تعالیٰ کے ساتھ کسی کو شریک مت کرنا اگرچہ تم ٹکڑے ٹکڑے کر دئیے جاؤ، اور جلا دئیے جاؤ، اور فرض نماز کو جان بوجھ کر مت چھوڑنا، کیونکہ جس نے جان بوجھ کر اسے چھوڑا تو اس پر سے اللہ کی پناہ اٹھ گئی، اور تم شراب مت پینا، کیونکہ شراب تمام برائیوں کی کنجی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4035,
			"arabicnumber": 4035,
			"text": "معاویہ رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: دنیا میں فتنوں اور مصیبتوں کے سوا کچھ باقی نہ رہا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4036,
			"arabicnumber": 4036,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مکر و فریب والے سال آئیں گے، ان میں جھوٹے کو سچا سمجھا جائے گا اور سچے کو جھوٹا، خائن کو امانت دار اور امانت دار کو خائن، اور اس زمانہ میں «رويبضة» بات کرے گا، آپ صلی اللہ علیہ وسلم سے سوال کیا گیا: «رويبضة» کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: حقیر اور کمینہ آدمی، وہ لوگوں کے عام انتظام میں مداخلت کرے گا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4037,
			"arabicnumber": 4037,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، دنیا اس وقت تک ختم نہ ہو گی جب تک آدمی قبر پر جا کر نہ لوٹے، اور یہ تمنا نہ کرے کہ کاش! اس قبر والے کی جگہ میں دفن ہوتا، اس کا سبب دین و ایمان نہیں ہو گا، بلکہ وہ دنیا کی بلا اور فتنے کی وجہ سے یہ تمنا کرے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4038,
			"arabicnumber": 4038,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہعلیہ وسلم نے فرمایا: تم ایسے چن لیے جاؤ گے جیسے عمدہ کھجوریں ردی کھجوروں میں سے چنی جاتی ہیں، تمہارے نیک لوگ گزر جائیں گے، اور برے لوگ باقی رہ جائیں گے، تو اگر تم سے ہو سکے تو تم بھی مر جانا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4039,
			"arabicnumber": 4039,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دن بہ دن معاملہ سخت ہوتا چلا جائے گا، اور دنیا تباہی کی طرف بڑھتی جائے گی، اور لوگ بخیل ہوتے جائیں گے، اور قیامت بدترین لوگوں پر ہی قائم ہو گی، اور مہدی عیسیٰ بن مریم علیہ السلام کے علاوہ کوئی نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4040,
			"arabicnumber": 4040,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں اور قیامت دونوں اس طرح بھیجے گئے ہیں ، آپ نے اپنی دونوں انگلیاں ملا کر بتایا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4041,
			"arabicnumber": 4041,
			"text": "حذیفہ بن اسید رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ہماری طرف اپنے کمرے سے جھانکا، ہم لوگ آپس میں قیامت کا ذکر کر رہے تھے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جب تک دس نشانیاں ظاہر نہ ہو جائیں گی قیامت قائم نہ ہو گی، جن میں سے دجال، دھواں اور سورج کا پچھم سے نکلنا بھی ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4042,
			"arabicnumber": 4042,
			"text": "عوف بن مالک اشجعی رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ غزوہ تبوک میں چمڑے کے ایک خیمے میں ٹھہرے ہوئے تھے، میں خیمے کے صحن میں بیٹھ گیا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عوف! اندر آ جاؤ ، میں نے عرض کیا: پورے طور سے، اللہ کے رسول؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں پورے طور سے ، پھر آپ نے فرمایا: عوف! قیامت سے پہلے چھ نشانیاں ہوں گی، انہیں یاد رکھنا، ان میں سے ایک میری موت ہے ، میں یہ سن کر بہت رنجیدہ ہوا، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: کہو ایک، دوسری بیت المقدس کی فتح ہے، تیسری ایک بیماری ہے جو تم میں ظاہر ہو گی اس کے ذریعہ اللہ تمہیں اور تمہاری اولاد کو شہید کر دے گا، اور اس کے ذریعہ تمہارے اعمال کو پاک کرے گا، چوتھی تم میں مال کی کثرت ہو گی حتیٰ کہ آدمی کو سو دینار ملیں گے تو وہ اس سے بھی راضی نہ ہو گا، پانچویں تمہارے درمیان ایک فتنہ برپا ہو گا جس سے کوئی گھر باقی نہ رہے گا جس میں وہ نہ پہنچا ہو، چھٹی تمہارے اور اہل روم کے درمیان ایک صلح ہو گی، لیکن پھر وہ لوگ تم سے دغا کریں گے، اور تمہارے مقابلہ کے لیے اسی جھنڈوں کے ساتھ فوج لے کر آئیں گے، ہر جھنڈے کے نیچے بارہ ہزار فوج ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4043,
			"arabicnumber": 4043,
			"text": "حذیفہ بن الیمان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت قائم نہ ہو گی یہاں تک کہ تم اپنے امام کو قتل کرو گے، اور اپنی تلواریں لے کر باہم لڑو گے، اور تمہارے بدترین لوگ تمہاری دنیا کے مالک بن جائیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4044,
			"arabicnumber": 4044,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک روز لوگوں کے پاس باہر بیٹھے ہوئے تھے کہ اتنے میں ایک شخص آپ کے پاس آیا، اور اس نے عرض کیا: اللہ کے رسول! قیامت کب قائم ہو گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جس سے سوال کیا گیا ہے وہ سوال کرنے والے سے زیادہ نہیں جانتا، لیکن میں تمہیں قیامت کی نشانیاں بتاتا ہوں، جب لونڈی اپنی مالکہ کو جنے، تو یہ قیامت کی نشانیوں میں سے ہے، اور جب ننگے پاؤں، ننگے بدن لوگ لوگوں کے سردار بن جائیں، تو یہ بھی اس کی نشانیوں میں سے ہے، اور جب بکریاں چرانے والے عالی شان عمارتوں پر فخر کرنے لگ جائیں، تو یہ بھی اس کی نشانیوں میں ہے، اور قیامت کا علم ان پانچ باتوں میں سے ہے جنہیں اللہ کے علاوہ کوئی نہیں جانتا، پھر رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی: «إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام» اللہ ہی کو معلوم ہے کہ قیامت کب ہو گی، وہی بارش نازل کرتا ہے، وہی جانتا ہے کہ ماں کے پیٹ میں کیا ہے ( سورة لقما ن: 34 ) ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4045,
			"arabicnumber": 4045,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ کیا میں تم سے وہ حدیث نہ بیان کروں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے، اور میرے بعد تم سے وہ حدیث کوئی بیان کرنے والا نہیں ہو گا، میں نے اسے آپ ہی سے سنا ہے کہ قیامت کی نشانیاں یہ ہیں کہ علم اٹھ جائے گا، جہالت پھیل جائے گی، زنا عام ہو جائے گا، شراب پی جانے لگے گی، مرد کم ہو جائیں گے، عورتیں زیادہ ہوں گی حتیٰ کہ پچاس عورتوں کا «قيم» ( سر پرست و کفیل ) ایک مرد ہو گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4046,
			"arabicnumber": 4046,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت اس وقت تک قائم نہ ہو گی جب تک دریائے فرات میں سونے کے پہاڑ نہ ظاہر ہو جائیں، اور لوگ اس پر باہم جنگ کرنے لگیں، حتیٰ کہ دس آدمیوں میں سے نو قتل ہو جائیں گے، اور ایک باقی رہ جائے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4047,
			"arabicnumber": 4047,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت اس وقت تک قائم نہ ہو گی، جب تک مال کی خوب فراوانی نہ ہو جائے، اور فتنہ عام نہ ہو جائے «هرج» کثرت سے ہونے لگے، لوگوں نے عرض کیا: اللہ کے رسول! «هرج» کیا ہے؟ آپ صلی اللہ علیہ وسلم نے تین بار فرمایا: قتل، قتل، قتل ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4048,
			"arabicnumber": 4048,
			"text": "زیاد بن لبید رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے کسی بات کا ذکر کیا اور فرمایا: یہ اس وقت ہو گا جب علم اٹھ جائے گا ، میں نے عرض کیا: اللہ کے رسول! علم کیسے اٹھ جائے گا جب کہ ہم قرآن پڑھتے اور اپنی اولاد کو پڑھاتے ہیں اور ہماری اولاد اپنی اولاد کو پڑھائے گی اسی طرح قیامت تک سلسلہ چلتا رہے گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: زیاد! تمہاری ماں تم پر روئے، میں تو تمہیں مدینہ کا سب سے سمجھدار آدمی سمجھتا تھا، کیا یہ یہود و نصاریٰ تورات اور انجیل نہیں پڑھتے؟ لیکن ان میں سے کسی بات پر بھی یہ لوگ عمل نہیں کرتے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4049,
			"arabicnumber": 4049,
			"text": "حذیفہ بن الیمان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسلام ایسا ہی پرانا ہو جائے گا جیسے کپڑے کے نقش و نگار پرانے ہو جاتے ہیں، حتیٰ کہ یہ جاننے والے بھی باقی نہ رہیں گے کہ نماز، روزہ، قربانی اور صدقہ و زکاۃ کیا چیز ہے؟ اور کتاب اللہ ایک رات میں ایسی غائب ہو جائے گی کہ اس کی ایک آیت بھی باقی نہ رہ جائے گی ۱؎، اور لوگوں کے چند گروہ ان میں سے بوڑھے مرد اور بوڑھی عورتیں باقی رہ جائیں گے، کہیں گے کہ ہم نے اپنے باپ دادا کو یہ کلمہ «لا إله إلا الله» کہتے ہوئے پایا، تو ہم بھی اسے کہا کرتے ہیں ۲؎۔ صلہ نے حذیفہ رضی اللہ عنہ سے کہا: جب انہیں یہ نہیں معلوم ہو گا کہ نماز، روزہ، قربانی اور صدقہ و زکاۃ کیا چیز ہے تو انہیں فقط یہ کلمہ «لا إله إلا الله» کیا فائدہ پہنچائے گا؟ تو حذیفہ رضی اللہ عنہ نے ان سے منہ پھیر لیا، پھر انہوں نے تین بار یہ بات ان پر دہرائی لیکن وہ ہر بار ان سے منہ پھیر لیتے، پھر تیسری مرتبہ ان کی طرف متوجہ ہوئے اور فرمایا: اے صلہ! یہ کلمہ ان کو جہنم سے نجات دے گا، اس طرح تین بار کہا ۳؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4050,
			"arabicnumber": 4050,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت کے قریب کچھ دن ایسے ہوں گے جن میں علم اٹھ جائے گا، جہالت بڑھ جائے گی، اور «هرج» زیادہ ہو گا ، «هرج»: قتل کو کہتے ہیں",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4051,
			"arabicnumber": 4051,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارے بعد ایسے دن آئیں گے جن میں جہالت چھا جائے گی، علم اٹھ جائے گا، اور«هرج» زیادہ ہو گا ، لوگوں نے عرض کیا: اللہ کے رسول! «هرج» کیا چیز ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: قتل",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4052,
			"arabicnumber": 4052,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: زمانہ ایک دوسرے سے قریب ہو جائے گا، ۱؎ علم گھٹ جائے گا، ( لوگوں کے دلوں میں ) بخیلی ڈال دی جائے گی، فتنے ظاہر ہوں گے، اور «هرج» زیادہ ہو گا ، لوگوں نے عرض کیا: اللہ کے رسول! «هرج» کیا چیز ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: قتل ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4053,
			"arabicnumber": 4053,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم سے دو حدیثیں بیان کیں، جن میں سے ایک تو میں نے دیکھ لی ۱؎ اور دوسری کا منتظر ہوں، آپ صلی اللہ علیہ وسلم نے ہم سے یہ بیان فرمایا: امانت آدمیوں کے دلوں کی جڑ میں اتری ( پیدا ہوئی ) ، ( طنافسی نے کہا: یعنی آدمیوں کے دلوں کے بیچ میں اتری ) اور قرآن کریم نازل ہوا، تو ہم نے قرآن و سنت کی تعلیم حاصل کی ۲؎، پھر آپ صلی اللہ علیہ وسلم نے امانت کے اٹھ جانے کے متعلق ہم سے بیان کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: آدمی رات کو سوئے گا تو امانت اس کے دل سے اٹھا لی جائے گی، ( اور جب وہ صبح کو اٹھے گا تو ) امانت کا اثر ایک نقطے کی طرح دل میں رہ جائے گا، پھر جب دوسری بار سوئے گا تو امانت اس کے دل سے چھین لی جائے گی، تو اس کا اثر ( اس کے دل میں ) کھال موٹا ۲؎ ہونے کی طرح رہ جائے گا، جیسے تم انگارے کو پاؤں پر لڑھکا دو تو کھال پھول کر آبلے کی طرح دکھائی دے گی، حالانکہ اس کے اندر کچھ نہیں ہوتا ، پھر حذیفہ رضی اللہ عنہ نے مٹھی بھر کنکریاں لیں اور انہیں اپنی پنڈلی پر لڑھکا لیا، اور فرمانے لگے: پھر لوگ صبح کو ایک دوسرے سے خرید و فروخت کریں گے، لیکن ان میں سے کوئی بھی امانت دار نہ ہو گا، یہاں تک کہ کہا جائے گا کہ فلاں قبیلے میں فلاں امانت دار شخص ہے، اور یہاں تک آدمی کو کہا جائے گا کہ کتنا عقلمند، کتنا توانا اور کتنا ذہین و چالاک ہے، حالانکہ اس کے دل میں رائی کے دانے کے برابر بھی ایمان نہ ہو گا، اور مجھ پر ایک زمانہ ایسا گزرا کہ مجھے پروا نہ تھی کہ میں تم میں سے کس سے معاملہ کروں، یعنی مجھے کسی کی ضمانت کی حاجت نہ تھی، اگر وہ مسلمان ہوتا تو اس کا اسلام اسے مجھ پر زیادتی کرنے سے روکتا، اور اگر وہ یہودی یا نصرانی ہوتا تو اس کا گماشتہ بھی انصاف سے کام لیتا ( یعنی ان کے عامل اور عہدہ دار بھی ایماندار اور منصف ہوتے ) اور اب آج کے دن مجھے کوئی بھی ایسا نظر نہیں آتا کہ میں اس سے معاملہ کروں سوائے فلاں فلاں کے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4054,
			"arabicnumber": 4054,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ جب کسی بندے کو ہلاک کرنا چاہتا ہے تو اس سے شرم و حیاء کو نکال لیتا ہے، پھر جب حیاء اٹھ جاتی ہے تو اللہ کے قہر میں گرفتار ہو جاتا ہے، اور اس حالت میں اس کے دل سے امانت بھی چھین لی جاتی ہے، اور جب اس کے دل سے امانت چھین لی جاتی ہے تو وہ چوری اور خیانت شروع کر دیتا ہے، اور جب چوری اور خیانت شروع کر دیتا ہے تو اس کے دل سے رحمت چھین لی جاتی ہے، اور جب اس سے رحمت چھین لی جاتی ہے تو تم اسے ملعون و مردود پاؤ گے، اور جب تم ملعون و مردود دیکھو تو سمجھ لو کہ اسلام کا قلادہ اس کی گردن سے نکل چکا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4055,
			"arabicnumber": 4055,
			"text": "حذیفہ بن اسید ابو سریحہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ( ایک دن ) اپنے کمرے سے جھانکا، اور ہم آپس میں قیامت کا ذکر کر رہے تھے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: قیامت اس وقت تک قائم نہ ہو گی جب تک دس نشانیاں ظاہر نہ ہوں: سورج کا پچھم سے نکلنا، دجال، دھواں، دابۃ الارض ( چوپایا ) ، یاجوج ماجوج، عیسیٰ بن مریم علیہ السلام کا نزول، تین بار زمین کا «خسف» ( دھنسنا ) : ایک مشرق میں، ایک مغرب میں اور ایک جزیرۃ العرب میں، ایک آگ عدن کے، ایک گاؤں «أبین» کے کنویں سے ظاہر ہو گی جو لوگوں کو محشر کی جانب ہانک کر لے جائے گی، جہاں یہ لوگ رات گزاریں گے تو وہیں وہ آگ ان کے ساتھ رات گزارے گی، اور جب یہ قیلولہ کریں گے تو وہ آگ بھی ان کے ساتھ قیلولہ کرے گی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4056,
			"arabicnumber": 4056,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: چھ چیزوں کے ظاہر ہونے سے پہلے تم نیک اعمال میں جلدی کرو: سورج کا مغرب سے نکلنا، دھواں، دابۃ الارض ( چوپایا ) ، دجال، ہر شخص کی خاص آفت ( یعنی موت ) ، عام آفت ( جیسے وبا وغیرہ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4057,
			"arabicnumber": 4057,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( قیامت کی ) نشانیاں دو سو سال کے بعد ظاہر ہوں گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4058,
			"arabicnumber": 4058,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میری امت پا نچ طبقات پر مشتمل ہو گی: چالیس سال نیکو کاروں اور متقیوں کے ہوں گے، پھر ان کے بعد ایک سو سال تک صلہ رحمی کرنے والے اور رشتے ناطے کا خیال رکھنے والے ہوں گے، پھر ان کے بعد ایک سو ساٹھ سال تک وہ لوگ ہوں گے جو رشتہ ناطہٰ توڑیں گے، اور ایک دوسرے کی طرف سے منہ موڑیں گے، پھر اس کے بعد قتل ہی قتل ہو گا، لہٰذا تم ایسے زمانے سے نجات مانگو، نجات مانگو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4059,
			"arabicnumber": 4059,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قیامت سے پہلے مسخ، ( صورتوں کی تبدیلی ہونا ) زمین کا دھنسنا، اور آسمان سے پتھروں کی بارش ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4060,
			"arabicnumber": 4060,
			"text": "سہل بن سعد رضی اللہ عنہ کہتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا: میری امت کے اخیر میں زمین کا دھنسنا، صورتوں کا مسخ ہونا، اور آسمان سے پتھروں کی بارش کا ہونا ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4061,
			"arabicnumber": 4061,
			"text": "نافع سے روایت ہے کہ ابن عمر رضی اللہ عنہما کے پاس ایک شخص نے آ کر کہا: فلاں شخص آپ کو سلام کہتا ہے، انہوں نے کہا: مجھے خبر پہنچی ہے کہ اس نے دین میں بدعت نکالی ہے، اگر اس نے ایسا کیا ہو تو اسے میرا سلام نہ کہنا، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: میری امت میں ( یا اس امت میں ) مسخ ( صورتوں کی تبدیلی ) ، اور زمین کا دھنسنا آسمان سے پتھروں کی بارش کا ہونا ہو گا ، اور یہ قدریہ میں ہو گا جو تقدیر کے منکر ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4062,
			"arabicnumber": 4062,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میری امت میں زمین کا دھنسنا، صورتوں کا مسخ ہونا، اور آسمان سے پتھروں کی بارش کا ہونا ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4063,
			"arabicnumber": 4063,
			"text": "عبداللہ بن صفوان رضی اللہ عنہ کہتے ہیں کہ مجھے ام المؤمنین حفصہ رضی اللہ عنہا نے خبر دی کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ایک لشکر اس بیت اللہ کا قصد کرے گا تاکہ اہل مکہ سے لڑائی کرے، لیکن جب وہ لشکر مقام بیداء میں پہنچے گا تو اس کے درمیانی حصہ کو زمین میں دھنسا دیا جائے گا، اور دھنستے وقت جو لوگ آگے ہوں گے وہ پیچھے والوں کو آواز دیں گے لیکن آواز دیتے دیتے سب دھنس جائیں گے، ایک قاصد کے علاوہ ان میں سے کوئی باقی نہ رہے گا جو لوگوں کو جا کر خبر دے گا ۔ ( عبداللہ بن صفوان رضی اللہ عنہ کہتے ہیں ) جب حجاج ( حجاج بن یوسف ثقفی ) کا لشکر آیا ( اور عبداللہ بن زبیر رضی اللہ عنہما سے لڑنے کے لیے مکہ کی طرف بڑھا ) تو ہم سمجھے شاید وہ یہی لشکر ہو گا، ایک شخص نے ( یہ سن کر ) کہا: میں گواہی دیتا ہوں کہ آپ نے ام المؤمنین حفصہ رضی اللہ عنہا پر جھوٹ نہیں باندھا، اور ام المؤمنین حفصہ رضی اللہ عنہما نے نبی اکرم صلی اللہعلیہ وسلم پر جھوٹ نہیں باندھا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4064,
			"arabicnumber": 4064,
			"text": "ام المؤمنین صفیہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگ اللہ کے اس گھر پر حملہ کرنے سے باز نہ آئیں گے حتیٰ کہ ایک لشکر لڑنے کے لیے آئے گا، جب وہ لوگ مقام بیداء یا بیداء کی سر زمین میں پہنچیں گے، تو اول سے لے کر اخیر تک تمام زمین میں دھنسا دیئے جائیں گے، اور ان کے درمیان والے بھی نہیں بچیں گے ۔ میں نے عرض کیا: اگر ان میں سے کوئی ایسا بھی ہو جسے زبردستی اس لشکر میں شامل کیا گیا ہو؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ قیامت کے دن انہیں اپنی اپنی نیت کے موافق اٹھائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4065,
			"arabicnumber": 4065,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اس لشکر کا ذکر فرمایا جو زمین میں دھنسا دیا جائے گا تو ام المؤمنین ام سلمہ رضی اللہ عنہا نے کہا: اللہ کے رسول! شاید ان میں کوئی ایسا بھی ہو جسے زبردستی لایا گیا ہو ؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ اپنی اپنی نیتوں پر اٹھائے جائیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4066,
			"arabicnumber": 4066,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: زمین سے «دابة» ظاہر ہو گا، اس کے ساتھ سلیمان بن داود علیہما السلام کی انگوٹھی اور موسیٰ بن عمران علیہ السلام کا عصا ہو گا، اس عصا ( چھڑی ) سے وہ مومن کا چہرہ روشن کر دے گا، اور انگوٹھی سے کافر کی ناک پر نشان لگائے گا، حتیٰ کہ جب ایک محلہ کے لوگ جمع ہوں گے تو یہ کہے گا: اے مومن! اور وہ کہے گا: اے کافر! ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4067,
			"arabicnumber": 4067,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مجھے مکہ کے قریب ایک جگہ صحراء میں لے گئے، تو وہ ایک خشک زمین تھی جس کے اردگرد ریت تھی، آپ صلی اللہ علیہ وسلم نے فرمایا: جانور ( «دابۃ الارض» ) یہاں سے نکلے گا، میں نے وہ جگہ دیکھی، وہ ایک بالشت میں سے انگشت شہادت اور انگوٹھے کے درمیان کی دوری کے برابر تھی ۔ ابن بریدہ رضی اللہ عنہ کہتے ہیں کہ میں نے کئی سال کے بعد حج کیا تو بریدہ رضی اللہ عنہ ( یعنی میرے والد ) نے ہمیں «دابۃ الارض» کا عصا دکھایا جو میرے عصا کے بقدر لمبا اور موٹا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4068,
			"arabicnumber": 4068,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: اس وقت تک قیامت قائم نہ ہو گی جب تک سورج پچھم سے نہ نکلے گا، جب سورج کو پچھم سے نکلتے دیکھیں گے تو روئے زمین کے سب لوگ ایمان لے آئیں گے، لیکن یہ ایسا وقت ہو گا کہ اس وقت جو پہلے سے ایمان نہیں رکھتے تھے، ان کا ایمان لانا کچھ فائدہ نہ دے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4069,
			"arabicnumber": 4069,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت کی پہلی نشانی سورج کا پچھم سے نکلنا، اور چاشت کے وقت لوگوں پر «دابہ» ( چوپایہ ) کا ظاہر ہونا ہے ۔ عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ ان دونوں میں سے جو بھی پہلے نکلے، تو دوسرا اس سے قریب ہو گا، میرا یہی خیال ہے کہ پہلے سورج پچھم سے نکلے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4070,
			"arabicnumber": 4070,
			"text": "صفوان بن عسال رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مغرب ( یعنی سورج کے ڈوبنے کی سمت ) میں ایک کھلا دروازہ ہے، اس کی چوڑائی ستر سال کی مسافت ہے، یہ دروازہ توبہ کے لیے ہمیشہ کھلا رہے گا، جب تک سورج ادھر سے نہ نکلے، اور جب سورج ادھر سے نکلے گا تو اس وقت کسی شخص کا جو اس سے پہلے ایمان نہ لایا ہو یا ایمان لا کر کوئی نیکی نہ کما لی ہو، اس کا ایمان لانا کسی کام نہ آئے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4071,
			"arabicnumber": 4071,
			"text": "حذیفہ بن یمان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دجال بائیں آنکھ کا کانا، اور بہت بالوں والا ہو گا، اس کے ساتھ جنت اور جہنم ہو گی، لیکن اس کی جہنم جنت اور اس کی جنت جہنم ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4072,
			"arabicnumber": 4072,
			"text": "ابوبکر صدیق رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم سے یہ حدیث بیان کی: دجال مشرق ( پورب ) کے ایک ملک سے ظاہر ہو گا، جس کو«خراسان» کہا جاتا ہے، اور اس کے ساتھ ایسے لوگ ہوں گے جن کے چہرے گویا تہ بہ تہ ڈھال ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4073,
			"arabicnumber": 4073,
			"text": "مغیرہ بن شعبہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے دجال کے بارے میں جتنے سوالات میں نے کئے ہیں، اتنے کسی اور نے نہیں کئے، ( ابن نمیر کی روایت میں یہ الفاظ ہیں «أشد سؤالا مني» یعنی مجھ سے زیادہ سوال اور کسی نے نہیں کئے ، آخر آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: تم اس کے بارے میں کیا پوچھتے ہو ؟ میں نے عرض کیا: لوگ کہتے ہیں کہ اس کے ساتھ کھانا اور پانی ہو گا، آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ پر وہ اس سے بھی زیادہ آسان ہے ۱؎۔)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4074,
			"arabicnumber": 4074,
			"text": "فاطمہ بنت قیس رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک دن نماز پڑھائی، اور منبر پر تشریف لے گئے، اور اس سے پہلے جمعہ کے علاوہ آپ منبر پر تشریف نہ لے جاتے تھے، لوگوں کو اس سے پریشانی ہوئی، کچھ لوگ آپ کے سامنے کھڑے تھے کچھ بیٹھے تھے، آپ صلی اللہ علیہ وسلم نے ہاتھ سے سب کو بیٹھنے کا اشارہ کیا اور فرمایا: اللہ کی قسم! میں منبر پر اس لیے نہیں چڑھا ہوں کہ کوئی ایسی بات کہوں جو تمہیں کسی رغبت یا دہشت والے کام کا فائدہ دے، بلکہ بات یہ ہے کہ میرے پاس تمیم داری آئے، اور انہوں نے مجھے ایک خبر سنائی ( جس سے مجھے اتنی مسرت ہوئی کہ خوشی کی وجہ سے میں قیلولہ نہ کر سکا، میں نے چاہا کہ تمہارے نبی کی خوشی کو تم پر بھی ظاہر کر دوں ) ، سنو! تمیم داری کے ایک چچا زاد بھائی نے مجھ سے یہ واقعہ بیان کیا کہ ( ایک سمندری سفر میں ) ہوا ان کو ایک جزیرے کی طرف لے گئی جس کو وہ پہچانتے نہ تھے، یہ لوگ چھوٹی چھوٹی کشتیوں پر سوار ہو کر اس جزیرے میں گئے، انہیں وہاں ایک کالے رنگ کی چیز نظر آئی، جس کے جسم پر کثرت سے بال تھے، انہوں نے اس سے پوچھا: تو کون ہے؟ اس نے کہا: میں جساسہ ( دجال کی جاسوس ) ہوں، ان لوگوں نے کہا: تو ہمیں کچھ بتا، اس نے کہا: ( نہ میں تمہیں کچھ بتاؤں گی، نہ کچھ تم سے پوچھوں گی ) ، لیکن تم اس دیر ( راہبوں کے مسکن ) میں جسے تم دیکھ رہے ہو جاؤ، وہاں ایک شخص ہے جو اس بات کا خواہشمند ہے کہ تم اسے خبر بتاؤ اور وہ تمہیں بتائے، کہا: ٹھیک ہے، یہ سن کر وہ لوگ اس کے پاس آئے، اس گھر میں داخل ہوئے تو دیکھا کہ وہاں ایک بوڑھا شخص زنجیروں میں سخت جکڑا ہوا ( رنج و غم کا اظہار کر رہا ہے، اور اپنا دکھ درد سنانے کے لیے بے چین ہے ) تو اس نے ان لوگوں سے پوچھا: تم کہاں سے آئے ہو؟ انہوں نے جواب دیا: شام سے، اس نے پوچھا: عرب کا کیا حال ہے؟ انہوں نے کہا: ہم عرب لوگ ہیں، تم کس کے بارے میں پوچھ رہے ہو؟ اس نے پوچھا: اس شخص کا کیا حال ہے ( یعنی محمد کا ) جو تم لوگوں میں ظاہر ہوا؟ انہوں نے کہا: ٹھیک ہے، اس نے قوم سے دشمنی کی، پھر اللہ نے اسے ان پر غلبہ عطا کیا، تو آج ان میں اجتماعیت ہے، ان کا معبود ایک ہے، ان کا دین ایک ہے، پھر اس نے پوچھا: زغر ( شام میں ایک گاؤں ) کے چشمے کا کیا حال ہے؟ انہوں نے کہا: ٹھیک ہے، لوگ اس سے اپنے کھیتوں کو پانی دیتے ہیں، اور پینے کے لیے بھی اس میں سے پانی لیتے ہیں، پھر اس نے پوچھا: ( عمان اور بیسان ( ملک شام کے دو شہر کے درمیان ) کھجور کے درختوں کا کیا حال ہے؟ انہوں نے کہا: ہر سال وہ اپنا پھل کھلا رہے ہیں، اس نے پوچھا: طبریہ کے نالے کا کیا حال ہے؟ انہوں نے کہا: اس کے دونوں کناروں پر پانی خوب زور و شور سے بہ رہا ہے، یہ سن کر اس شخص نے تین آہیں بھریں ) پھر کہا: اگر میں اس قید سے چھوٹا تو میں اپنے پاؤں سے چل کر زمین کے چپہ چپہ کا گشت لگاؤں گا، کوئی گوشہ مجھ سے باقی نہ رہے گا سوائے طیبہ ( مدینہ ) کے، وہاں میرے جانے کی کوئی سبیل نہ ہو گی، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: یہ سن کر مجھے بےحد خوشی ہوئی، طیبہ یہی شہر ( مدینہ ) ہے، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! مدینہ کے ہر تنگ و کشادہ اور نیچے اونچے راستوں پر ننگی تلوار لیے ایک فرشتہ متعین ہے جو قیامت تک پہرہ دیتا رہے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Matn"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4075,
			"arabicnumber": 4075,
			"text": "نواس بن سمعان کلابی رضی اللہ عنہ کہتے ہیں کہ ( ایک دن ) صبح کے وقت رسول اللہ صلی اللہ علیہ وسلم نے دجال کا ذکر کیا تو اس میں آپ نے کبھی بہت دھیما لہجہ استعمال کیا اور کبھی روز سے کہا، آپ کے اس بیان سے ہم یہ محسوس کرنے لگے کہ جیسے وہ انہی کھجوروں میں چھپا ہوا ہے، پھر جب ہم شام کو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ نے ہمارے چہروں پر خوف کے آثار کو دیکھ کر فرمایا: تم لوگوں کا کیا حال ہے ؟ ہم نے عرض کیا: اللہ کے رسول! آپ نے جو صبح کے وقت دجال کا ذکر فرمایا تھا اور جس میں آپ نے پہلے دھیما پھر تیز لہجہ استعمال کیا تو اس سے ہمیں یہ محسوس ہونے لگا ہے کہ وہ انہی کھجوروں کے درختوں میں چھپا ہوا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: مجھے تم لوگوں پر دجال کے علاوہ اوروں کا زیادہ ڈر ہے، اگر دجال میری زندگی میں ظاہر ہوا تو میں تم سب کی جانب سے اس کا مقابلہ کروں گا، اور اگر میرے بعد ظاہر ہوا تو ہر انسان اس کا مقابلہ خود کرے گا، اللہ تعالیٰ ہر مسلمان پر میرا خلیفہ ہے ( یعنی ہر مسلمان کا میرے بعد ذمہ دار ہے ) دیکھو دجال جوان ہو گا، اس کے بال بہت گھنگریالے ہوں گے، اس کی ایک آنکھ اٹھی ہوئی اونچی ہو گی گویا کہ میں اسے عبدالعزی بن قطن کے مشابہ سمجھتا ہوں، لہٰذا تم میں سے جو کوئی اسے دیکھے اسے چاہیئے کہ اس پر سورۃ الکہف کی ابتدائی آیات پڑھے، دیکھو! دجال کا ظہور عراق اور شام کے درمیانی راستے سے ہو گا، وہ روئے زمین پر دائیں بائیں فساد پھیلاتا پھرے گا، اللہ کے بندو! ایمان پر ثابت قدم رہنا ۔ ہم نے عرض کیا: اللہ کے رسول! وہ کتنے دنوں تک زمین پر رہے گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: چالیس دن تک، ایک دن ایک سال کے برابر، دوسرا دن ایک مہینہ کے اور تیسرا دن ایک ہفتہ کے برابر ہو گا، اور باقی دن تمہارے عام دنوں کی طرح ہوں گے ۔ ہم نے عرض کیا: اللہ کے رسول! کیا اس دن میں جو ایک سال کا ہو گا ہمارے لیے ایک دن کی نماز کافی ہو گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ( نہیں بلکہ ) تم اسی ایک دن کا اندازہ کر کے نماز پڑھ لینا ۔ ہم نے عرض کیا: زمین میں اس کے چلنے کی رفتار آخر کتنی تیز ہو گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس بادل کی طرح جس کے پیچھے ہوا ہو، وہ ایک قوم کے پاس آ کر انہیں اپنی الوہیت کی طرف بلائے گا، تو وہ قبول کر لیں گے، اور اس پر ایمان لے آئیں گے، پھر وہ آسمان کو بارش کا حکم دے گا، تو وہ برسے گا، پھر زمین کو سبزہ اگانے کا حکم دے گا تو زمین سبزہ اگائے گی، اور جب اس قوم کے جانور شام کو چر کر واپس آیا کریں گے تو ان کے کوہان پہلے سے اونچے، تھن زیادہ دودھ والے، اور کوکھیں بھری ہوں گی، پہلو بھرے بھرے ہوں گے، پھر وہ ایک دوسری قوم کے پاس جائے گا، اور ان کو اپنی طرف دعوت دے گا، تو وہ اس کی بات نہ مانیں گے، آخر یہ دجال وہاں سے واپس ہو گا، تو صبح کو وہ قوم قحط میں مبتلا ہو گی، اور ان کے ہاتھ میں کچھ نہیں رہے گا، پھر دجال ایک ویران جگہ سے گزرے گا، اور اس سے کہے گا: تو اپنے خزانے نکال، وہاں کے خزانے نکل کر اس طرح اس کے ساتھ ہو جائیں گے جیسے شہد کی مکھیاں «یعسوب» ( مکھیوں کے بادشاہ ) کے پیچھے چلتی ہیں، پھر وہ ایک ہٹے کٹے نوجوان کو بلائے گا، اور تلوار کے ذریعہ اسے ایک ہی وار میں قتل کر کے اس کے دو ٹکڑے کر دے گا، ان دونوں ٹکڑوں میں اتنی دوری کر دے گا جتنی دوری پر تیر جاتا ہے، پھر اس کو بلائے گا تو وہ شخص زندہ ہو کر روشن چہرہ لیے ہنستا ہوا چلا آئے گا، الغرض دجال اور دنیا والے اسی حال میں ہوں گے کہ اللہ تعالیٰ عیسیٰ بن مریم علیہ الصلاۃ والسلام کو بھیجے گا، وہ دمشق کے سفید مشرقی مینار کے پاس دو زرد ہلکے کپڑے پہنے ہوئے اتریں گے، جو زعفران اور ورس سے رنگے ہوئے ہوں گے، اور اپنے دونوں ہاتھ دو فرشتوں کے بازوؤں پر رکھے ہوئے ہوں گے، جب وہ اپنا سر جھکائیں گے تو سر سے پانی کے قطرے ٹپکیں گے، اور جب سر اٹھائیں گے تو اس سے پانی کے قطرے موتی کی طرح گریں گے، ان کی سانس میں یہ اثر ہو گا کہ جس کافر کو لگ جائے گی وہ مر جائے گا، اور ان کی سانس وہاں تک پہنچے گی جہاں تک ان کی نظر کام کرے گی۔ پھر عیسیٰ علیہ السلام چلیں گے یہاں تک کہ اس ( دجال ) کو باب لد کے پاس پکڑ لیں گے، وہاں اسے قتل کریں گے، پھر دجال کے قتل کے بعد اللہ کے نبی عیسیٰ علیہ السلام ان لوگوں کے پاس آئیں گے جن کو اللہ تعالیٰ نے دجال کے شر سے بچا رکھا ہو گا، ان کے چہرے پر ہاتھ پھیر کر انہیں تسلی دیں گے، اور ان سے جنت میں ان کے درجات بیان کریں گے، یہ لوگ ابھی اسی کیفیت میں ہوں گے کہ اللہ تعالیٰ ان کی طرف وحی نازل کرے گا: اے عیسیٰ! میں نے اپنے کچھ ایسے بندے پیدا کئے ہیں جن سے لڑنے کی طاقت کسی میں نہیں، تو میرے بندوں کو طور پہاڑ پر لے جا، اس کے بعد اللہ تعالیٰ یاجوج و ماجوج کو بھیجے گا، اور وہ لوگ ویسے ہی ہوں گے جیسے اللہ تعالیٰ نے فرمایا: «من كل حدب ينسلون» یہ لوگ ہر ٹیلے پر سے چڑھ دوڑیں گے ( سورة الأنبياء: 96 ) ان میں کے آگے والے طبریہ کے چشمے پر گزریں گے، تو اس کا سارا پانی پی لیں گے، پھر جب ان کے پچھلے لوگ گزریں گے تو وہ کہیں گے: کسی زمانہ میں اس تالاب کے اندر پانی تھا، اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی طور پہاڑ پر حاضر رہیں گے ۱؎، ان مسلمانوں کے لیے اس وقت بیل کا سر تمہارے آج کے سو دینار سے بہتر ہو گا، پھر اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی اللہ تعالیٰ سے دعا کریں گے، چنانچہ اللہ یاجوج و ماجوج کی گردن میں ایک ایسا پھوڑا نکالے گا، جس میں کیڑے ہوں گے، اس کی وجہ سے ( دوسرے دن ) صبح کو سب ایسے مرے ہوئے ہوں گے جیسے ایک آدمی مرتا ہے، اور اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی طور پہاڑ سے نیچے اتریں گے اور ایک بالشت کے برابر جگہ نہ پائیں گے، جو ان کی بدبو، خون اور پیپ سے خالی ہو، عیسیٰ علیہ السلام اور ان کے ساتھی اللہ تعالیٰ سے دعا کریں گے تو اللہ تعالیٰ بختی اونٹ کی گردن کی مانند پرندے بھیجے گا جو ان کی لاشوں کو اٹھا کر جہاں اللہ تعالیٰ کا حکم ہو گا وہاں پھینک دیں گے، پھر اللہ تعالیٰ ( سخت ) بارش نازل کرے گا جس سے کوئی پختہ یا غیر پختہ مکان چھوٹنے نہیں پائے گا، یہ بارش ان سب کو دھو ڈالے گی، اور زمین کو آئینہ کی طرح بالکل صاف کر دے گی، پھر زمین سے کہا جائے گا کہ تو اپنے پھل اگا، اور اپنی برکت ظاہر کر، تو اس وقت ایک انار کو ایک جماعت کھا کر آسودہ ہو گی، اور اس انار کے چھلکوں سے سایہ حاصل کریں گے اور دودھ میں اللہ تعالیٰ اتنی برکت دے گا کہ ایک اونٹنی کا دودھ کئی جماعتوں کو کافی ہو گا، اور ایک دودھ دینے والی گائے ایک قبیلہ کے لوگوں کو کافی ہو گی، اور ایک دودھ دینے والی بکری ایک چھوٹے قبیلے کو کافی ہو گی، لوگ اسی حال میں ہوں گے کہ اللہ تعالیٰ ایک پاکیزہ ہوا بھیجے گا وہ ان کی بغلوں کے تلے اثر کرے گی اور ہر مسلمان کی روح قبض کرے گی، اور ایسے لوگ باقی رہ جائیں گے جو جھگڑالو ہوں گے، اور گدھوں کی طرح لڑتے جھگڑتے یا اعلانیہ جماع کرتے رہیں گے، تو انہی ( شریر ) لوگوں پر قیامت قائم ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4076,
			"arabicnumber": 4076,
			"text": "نواس بن سمعان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قریب ہے کہ مسلمان یاجوج و ماجوج کے تیر، کمان، اور ڈھال کو سات سال تک جلائیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4077,
			"arabicnumber": 4077,
			"text": "ابوامامہ باہلی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خطبہ دیا، آپ کے خطبے کا اکثر حصہ دجال والی وہ حدیث تھی جو آپ نے ہم سے بیان کی، اور ہم کو اس سے ڈرایا، آپ صلی اللہ علیہ وسلم نے جو کچھ فرمایا اس میں یہ بات بھی تھی کہ جب سے اللہ تعالیٰ نے اولاد آدم کو پیدا کیا ہے اس وقت سے دجال کے فتنے سے بڑھ کر کوئی فتنہ نہیں ہے، اور اللہ تعالیٰ نے کوئی نبی ایسا نہیں بھیجا جس نے اپنی امت کو ( فتنہ ) دجال سے نہ ڈرایا ہو، میں چونکہ تمام انبیاء علیہم السلام کے اخیر میں ہوں، اور تم بھی آخری امت ہو اس لیے دجال یقینی طور پر تم ہی لوگوں میں ظاہر ہو گا، اگر وہ میری زندگی میں ظاہر ہو گیا تو میں ہر مسلمان کی جانب سے اس کا مقابلہ کروں گا، اور اگر وہ میرے بعد ظاہر ہوا تو ہر شخص خود اپنا بچاؤ کرے گا، اور اللہ تعالیٰ ہر مسلمان پر میرا خلیفہ ہے، ( یعنی اللہ میرے بعد ہر مسلمان کا محافظ ہو گا ) ، سنو! دجال شام و عراق کے درمیانی راستے سے نکلے گا اور اپنے دائیں بائیں ہر طرف فساد پھیلائے گا، اے اللہ کے بندو! ( اس وقت ) ایمان پر ثابت قدم رہنا، میں تمہیں اس کی ایک ایسی صفت بتاتا ہوں جو مجھ سے پہلے کسی نبی نے نہیں بتائی، پہلے تو وہ نبوت کا دعویٰ کرے گا، اور کہے گا: میں نبی ہوں ، حالانکہ میرے بعد کوئی نبی نہیں ہے، پھر دوسری بار کہے گا کہ میں تمہارا رب ہوں ، حالانکہ تم اپنے رب کو مرنے سے پہلے نہیں دیکھ سکتے، وہ کانا ہو گا، اور تمہارا رب کانا نہیں ہے، وہ ہر عیب سے پاک ہے، اور دجال کی پیشانی پر لفظ کافر لکھا ہو گا، جسے ہر مومن خواہ پڑھا لکھا ہو یا جاہل پڑھ لے گا۔ اور اس کا ایک فتنہ یہ ہو گا کہ اس کے ساتھ جنت اور جہنم ہو گی، لیکن حقیقت میں اس کی جہنم جنت ہو گی، اور جنت جہنم ہو گی، تو جو اس کی جہنم میں ڈالا جائے، اسے چاہیئے کہ وہ اللہ سے فریاد کرے، اور سورۃ الکہف کی ابتدائی آیات پڑھے تو وہ جہنم اس پر ایسی ٹھنڈی اور سلامتی والی ہو جائے گی جیسے ابراہیم علیہ السلام پر آگ ٹھنڈی ہو گئی تھی۔ اور اس دجال کا ایک فتنہ یہ بھی ہو گا کہ وہ ایک گنوار دیہاتی سے کہے گا: اگر میں تیرے والدین کو زندہ کر دوں تو کیا تو مجھے رب تسلیم کرے گا؟ وہ کہے گا: ہاں، پھر دو شیطان اس کے باپ اور اس کی ماں کی شکل میں آئیں گے اور اس سے کہیں گے: اے میرے بیٹے! تو اس کی اطاعت کر، یہ تیرا رب ہے۔ ایک فتنہ اس کا یہ ہو گا کہ وہ ایک شخص پر مسلط کر دیا جائے گا، پھر اسے قتل کر دے گا، اور اسے آرے سے چیر دے گا یہاں تک کہ اس کے دو ٹکڑے کر کے ڈال دے گا، پھر کہے گا: تم میرے اس بندے کو دیکھو، میں اس بندے کو اب زندہ کرتا ہوں، پھر وہ کہے گا: میرے علاوہ اس کا کوئی اور رب ہے، تو اللہ تعالیٰ اسے زندہ کرے گا، اور دجال خبیث اس سے پوچھے گا کہ تیرا رب کون ہے؟ تو وہ کہے گا: میرا رب تو اللہ ہے، اور تو اللہ کا دشمن دجال ہے، اللہ کی قسم! اب تو مجھے تیرے دجال ہونے کا مزید یقین ہو گیا ۔ ابوالحسن طنافسی کہتے ہیں کہ ہم سے محاربی نے بیان کیا، وہ کہتے ہیں کہ ہم سے عبیداللہ بن ولید وصافی نے بیان کیا، انہوں نے عطیہ سے روایت کی، عطیہ نے ابو سعید خدری سے، ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میری امت میں سے اس شخص کا درجہ جنت میں بہت اونچا ہو گا ۔ ابو سعید خدری کہتے ہیں: اللہ کی قسم! ہمارا خیال تھا کہ یہ شخص سوائے عمر بن خطاب رضی اللہ عنہما کے کوئی نہیں ہو سکتا، یہاں تک کہ وہ اپنی راہ گزر گئے۔ محاربی کہتے ہیں کہ اب ہم پھر ابوامامہ رضی اللہ عنہ کی حدیث جو ابورافع نے روایت کی ہے بیان کرتے ہیں کہ دجال کا ایک فتنہ یہ بھی ہو گا کہ وہ آسمان کو پانی برسانے اور زمین کو غلہ اگانے کا حکم دے گا، چنانچہ بارش نازل ہو گی، اور غلہ اگے گا، اور اس کا فتنہ یہ بھی ہو گا کہ وہ ایک قبیلے کے پاس گزرے گا، وہ لوگ اس کو جھوٹا کہیں گے، تو ان کا کوئی چوپایہ باقی نہ رہے گا، بلکہ سب ہلاک ہو جائیں گے۔ اس کا ایک فتنہ یہ بھی ہو گا کہ وہ ایک قبیلے کے پاس گزرے گا، وہ لوگ اس کی تصدیق کریں گے، پھر وہ آسمان کو حکم دے گا تو وہ برسے گا، اور زمین کو غلہ و اناج اگانے کا حکم دے گا تو وہ غلہ اگائے گی، یہاں تک کہ اس دن شام کو چرنے والے ان کے جانور پہلے سے خوب موٹے بھاری ہو کر لوٹیں گے، کوکھیں بھری ہوئی، اور تھن دودھ سے لبریز ہوں گے، مکہ اور مدینہ کو چھوڑ کر زمین کا کوئی خطہٰ ایسا نہ ہو گا جہاں دجال نہ جائے، اور اس پر غالب نہ آئے، مکہ اور مدینہ کا کوئی دروازہ ایسا نہ ہو گا جہاں فرشتے ننگی تلواروں کے ساتھ اس سے نہ ملیں، یہاں تک کہ دجال ایک چھوٹی سرخ پہاڑی کے پاس اترے گا، جہاں کھاری زمین ختم ہوئی ہے، اس وقت مدینہ میں تین مرتبہ زلزلہ آئے گا، جس کی وجہ سے مدینہ میں جتنے مرد اور عورتیں منافق ہوں گے وہ اس کے پاس چلے جائیں گے اور مدینہ میل کو ایسے نکال پھینکے گا جیسے بھٹی لوہے کی میل کو دور کر دیتی ہے، اور اس دن کا نام یوم الخلاص ( چھٹکارے کا دن، یوم نجات ) ہو گا ۔ ام شریک بنت ابی العسکر نے عرض کیا کہ اللہ کے رسول! اس دن عرب کہاں ہوں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس روز عرب بہت کم ہوں گے اور ان میں سے اکثر بیت المقدس میں ایک صالح امام کے ماتحت ہوں گے، ایک روز ان کا امام آگے بڑھ کر لوگوں کو صبح کی نماز پڑھانے کے لیے کھڑا ہو گا، کہ اتنے میں عیسیٰ بن مریم علیہما السلام صبح کے وقت نازل ہوں گے، تو یہ امام ان کو دیکھ کر الٹے پاؤں پیچھے ہٹ آنا چاہے گا تاکہ عیسیٰ علیہ السلام آگے بڑھ کر لوگوں کو نماز پڑھا سکیں، لیکن عیسیٰ علیہ السلام اپنا ہاتھ اس کے دونوں مونڈھوں کے درمیان رکھ کر فرمائیں گے کہ تم ہی آگے بڑھ کر نماز پڑھاؤ اس لیے کہ تمہارے ہی لیے تکبیر کہی گئی ہے، خیر وہ امام لوگوں کو نماز پڑھائے گا، جب وہ نماز سے فارغ ہو گا تو عیسیٰ علیہ السلام ( قلعہ والوں سے ) فرمائیں گے کہ دروازہ کھولو، تو دروازہ کھول دیا جائے گا، اس ( دروازے ) کے پیچھے دجال ہو گا، اس کے ساتھ ستر ہزار یہودی ہوں گے، ہر یہودی کے پاس سونا چاندی سے مرصع و مزین تلوار اور سبز چادر ہو گی، جب یہ دجال عیسیٰ علیہ السلام کو دیکھے گا، تو اس طرح گھلے گا جس طرح پانی میں نمک گھل جاتا ہے، اور وہ انہیں دیکھ کر بھاگ کھڑا ہو گا، عیسیٰ علیہ السلام اس سے کہیں گے: تجھے میرے ہاتھ سے ایک ضرب کھانی ہے تو اس سے بچ نہ سکے گا، آخر کار وہ اسے لد کے مشرقی دروازے کے پاس پکڑ لیں گے، اور اسے قتل کر دیں گے، پھر اللہ تعالیٰ یہودیوں کو شکست دے گا، اور یہودی اللہ تعالیٰ کی مخلوقات میں سے جس چیز کی بھی آڑ میں چھپے گا، خواہ وہ درخت ہو یا پتھر، دیوار ہو یا جانور، اس چیز کو اللہ تعالیٰ بولنے کی طاقت دے گا، اور ہر چیز کہے گی: اے اللہ کے مسلمان بندے! یہ یہودی میرے پیچھے چھپا ہوا ہے، اسے آ کر قتل کر دے، سوائے ایک درخت کے جس کو غرقد کہتے ہیں، یہ یہودیوں کے درختوں میں سے ایک درخت ہے یہ نہیں بولے گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دجال چالیس سال تک رہے گا، جن میں سے ایک سال چھ مہینہ کے برابر ہو گا، اور ایک سال ایک مہینہ کے برابر ہو گا، اور ایک مہینہ جمعہ ( ایک ہفتہ ) کے برابر اور دجال کے باقی دن ایسے گزر جائیں گے جیسے چنگاری اڑ جاتی ہے، اگر تم میں سے کوئی مدینہ کے ایک دروازے پر صبح کے وقت ہو گا، تو اسے دوسرے دروازے پر پہنچتے پہنچتے شام ہو جائے گی ، آپ صلی اللہ علیہ وسلم سے عرض کیا گیا: اللہ کے رسول! اتنے چھوٹے دنوں میں ہم نماز کس طرح پڑھیں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جس طرح تم ان بڑے دنوں میں اندازہ کر کے پڑھتے ہو اسی طرح ان ( چھوٹے ) دنوں میں بھی اندازہ کر کے پڑھ لینا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عیسیٰ علیہ السلام میری امت میں ایک عادل حاکم اور منصف امام ہوں گے، صلیب کو توڑیں گے، سور کو قتل کریں گے، جزیہ اٹھا دیں گے، اور صدقہ و زکاۃ لینا چھوڑ دیں گے، تو یہ بکریوں اور گھوڑوں پر وصول نہیں کیا جائے گا، لوگوں کے دلوں سے کینہ اور بغض اٹھ جائے گا، اور ہر قسم کے زہریلے جانور کا زہر جاتا رہے گا، حتیٰ کہ اگر بچہ سانپ کے منہ میں ہاتھ ڈالے گا تو وہ اسے نقصان نہ پہنچائے گا، اور بچی شیر کو بھگائے گی تو وہ اسے کوئی نقصان نہیں پہنچا سکے گا، بھیڑیا بکریوں میں اس طرح رہے گا جس طرح محافظ کتا بکریوں میں رہتا ہے، زمین صلح اور انصاف سے ایسے بھر جائے گی جیسے برتن پانی سے بھر جاتا ہے، اور ( سب لوگوں کا ) کلمہ ایک ہو جائے گا، اللہ کے سوا کسی کی عبادت نہ کی جائے گی، لڑائی اپنے سامان رکھ دے گی ( یعنی دنیا سے لڑائی اٹھ جائے گی ) قریش کی سلطنت جاتی رہے گی، اور زمین چاندی کی طشتری کی طرح ہو گی، اپنے پھل اور ہریالی ایسے اگائے گی جس طرح آدم کے عہد میں اگایا کرتی تھی، یہاں تک کہ انگور کے ایک خوشے پر ایک جماعت جمع ہو جائے گی تو سب آسودہ ہو جائیں گے، اور ایک انار پر ایک جماعت جمع ہو جائے گی تو سب آسودہ ہو جائیں گے، اور بیل اتنے اتنے داموں میں ہوں گے، اور گھوڑے چند درہموں میں ملیں گے ، لوگوں نے عرض کیا: اللہ کے رسول! گھوڑے کیوں سستے ہوں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: لڑائی کے لیے گھوڑوں پر سواری نہیں ہو گی ، پھر آپ سے عرض کیا گیا: بیل کیوں مہنگا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ساری زمین میں کھیتی ہو گی اور دجال کے ظہور سے پہلے تین سال تک سخت قحط ہو گا، ان تینوں سالوں میں لوگ بھوک سے سخت تکلیف اٹھائیں گے، پہلے سال اللہ تعالیٰ آسمان کو تہائی بارش روکنے اور زمین کو تہائی پیداوار روکنے کا حکم دے گا، پھر دوسرے سال آسمان کو دو تہائی بارش روکنے اور زمین کو دو تہائی پیداوار روکنے کا حکم دے گا، اور تیسرے سال اللہ تعالیٰ آسمان کو یہ حکم دے گا کہ بارش بالکل روک لے پس ایک قطرہ بھی بارش نہ ہو گی، اور زمین کو یہ حکم دے گا کہ وہ اپنے سارے پودے روک لے تو وہ اپنی تمام پیداوار روک لے گی، نہ کوئی گھاس اگے گی، نہ کوئی سبزی، بالآخر کھر والے جانور ( گائے بکری وغیرہ چوپائے ) سب ہلاک ہو جائیں گے، کوئی باقی نہ بچے گا مگر جسے اللہ بچا لے ، عرض کیا گیا: پھر اس وقت لوگ کس طرح زندہ رہیں گے؟ آپ نے فرمایا: تہلیل ( «لا إله إلا الله» ) تکبیر ( «الله أكبر» ) تسبیح ( «سبحان الله» ) اور تحمید ( «الحمد لله» ) کا کہنا، ان کے لیے غذا کا کام دے گا۔ ابوعبداللہ ابن ماجہ کہتے ہیں: میں نے ابوالحسن طنافسی سے سنا وہ کہتے تھے کہ میں نے عبدالرحمٰن محاربی سے سنا وہ کہتے تھے: یہ حدیث تو اس لائق ہے کہ مکتب کے استادوں کو دے دی جائے تاکہ وہ مکتب میں بچوں کو یہ حدیث پڑھائیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4078,
			"arabicnumber": 4078,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قیامت اس وقت تک قائم نہ ہو گی جب تک عیسیٰ بن مریم عادل حاکم اور منصف امام بن کر نازل نہ ہوں، وہ آ کر صلیب کو توڑیں گے، سور کو قتل کریں گے، اور جزیہ کو معاف کر دیں گے، اور مال اس قدر زیادہ ہو گا کہ اسے کوئی قبول کرنے والا نہ ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4079,
			"arabicnumber": 4079,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یاجوج و ماجوج کھول دئیے جائیں گے، پھر وہ باہر آئیں گے جیسا کہ اللہ تعالیٰ نے فرمایا:«وهم من كل حدب ينسلون» یہ لوگ ہر اونچی زمین سے دوڑتے آئیں گے ( سورة الأنبياء: 96 ) پھر ساری زمین میں پھیل جائیں گے، اور مسلمان ان سے علاحدہ رہیں گے، یہاں تک کہ جو مسلمان باقی رہیں گے وہ اپنے شہروں اور قلعوں میں اپنے مویشیوں کو لے کر پناہ گزیں ہو جائیں گے، یہاں تک کہ یاجوج و ماجوج نہر سے گزریں گے، اس کا سارا پانی پی کر ختم کر دیں گے، اس میں کچھ بھی نہ چھوڑیں گے، جب ان کے پیچھے آنے والوں کا وہاں پر گزر ہو گا تو ان میں کا کوئی یہ کہے گا کہ کسی زمانہ میں یہاں پانی تھا، اور وہ زمین پر غالب آ جائیں گے، تو ان میں سے کوئی یہ کہے گا: ان اہل زمین سے تو ہم فارغ ہو گئے، اب ہم آسمان والوں سے لڑیں گے، یہاں تک کہ ان میں سے ایک اپنا نیزہ آسمان کی طرف پھینکے گا، وہ خون میں رنگا ہوا لوٹ کر گرے گا، پس وہ کہیں گے: ہم نے آسمان والوں کو بھی قتل کر دیا، خیر یہ لوگ اسی حال میں ہوں گے کہ اللہ تعالیٰ چند جانور بھیجے گا، جو ٹڈی کے کیڑوں کی طرح ہوں گے، جو ان کی گردنوں میں گھس جائیں گے، یہ سب کے سب ٹڈیوں کی طرح مر جائیں گے، ان میں سے ایک پر ایک پڑا ہو گا، اور جب مسلمان اس دن صبح کو اٹھیں گے، اور ان کی آہٹ نہیں سنیں گے تو کہیں گے: کوئی ایسا ہے جو اپنی جان ہتھیلی پر رکھ کر کے انہیں دیکھ کر آئے کہ یاجوج ماجوج کیا ہوئے؟ چنانچہ مسلمانوں میں سے ایک شخص ( قلعہ سے ) ان کا حال جاننے کے لیے نیچے اترے گا، اور دل میں خیال کرے گا کہ وہ مجھ کو ضرور مار ڈالیں گے، خیر وہ انہیں مردہ پائے گا، تو مسلمانوں کو پکار کر کہے گا: سنو! خوش ہو جاؤ! تمہارا دشمن ہلاک ہو گیا، یہ سن کر لوگ نکلیں گے اور اپنے جانور چرنے کے لیے آزاد چھوڑیں گے، اور ان کے گوشت کے سوا کوئی چیز انہیں کھانے کے لیے نہ ملے گی، اس وجہ سے ان کا گوشت کھا کھا کر خوب موٹے تازے ہوں گے، جس طرح کبھی گھاس کھا کر موٹے ہوئے تھے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4080,
			"arabicnumber": 4080,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یاجوج و ماجوج ہر روز ( اپنی دیوار ) کھودتے ہیں یہاں تک کہ جب قریب ہوتا ہے کہ سورج کی روشنی ان کو دکھائی دے تو جو شخص ان کا سردار ہوتا ہے وہ کہتا ہے: اب لوٹ چلو ( باقی ) کل کھودیں گے، پھر اللہ تعالیٰ اسے ویسی ہی مضبوط کر دیتا ہے جیسی وہ پہلے تھی، یہاں تک کہ جب ان کی مدت پوری ہو جائے گی، اور اللہ تعالیٰ کو ان کا خروج منظور ہو گا، تو وہ ( عادت کے مطابق ) دیوار کھودیں گے جب کھودتے کھودتے قریب ہو گا کہ سورج کی روشنی دیکھیں تو اس وقت ان کا سردار کہے گا کہ اب لوٹ چلو، ان شاءاللہ کل کھودیں گے، اور ان شاءاللہ کا لفظ کہیں گے، چنانچہ ( اس دن ) وہ لوٹ جائیں گے، اور دیوار اسی حال پر رہے گی، جیسے وہ چھوڑ گئے تھے، پھر وہ صبح آ کر اسے کھودیں گے اور اسے کھود کر باہر نکلیں گے، اور سارا پانی پی کر ختم کر دیں گے، اور لوگ ( اس وقت ) بھاگ کر اپنے قلعوں میں محصور ہو جائیں گے، یہ لوگ ( زمین پر پھیل کر ) آسمان کی جانب اپنے تیر ماریں گے، تو ان کے تیر خون میں لت پت ان کے پاس لوٹیں گے، وہ کہیں گے کہ ہم نے زمین والوں کو تو مغلوب کیا، اور آسمان والوں پر بھی غالب ہوئے، پھر اللہ تعالیٰ ان کی گدیوں ( گردنوں ) میں کیڑے پیدا فرمائے گا جو انہیں مار ڈالیں گے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! زمین کے جانور ان کا گوشت اور چربی کھا کر خوب موٹے ہوں گے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4081,
			"arabicnumber": 4081,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ اسراء ( معراج ) کی رات رسول اللہ صلی اللہ علیہ وسلم نے ابراہیم، موسیٰ اور عیسیٰ علیہم السلام سے ملاقات کی، تو سب نے آپس میں قیامت کا ذکر کیا، پھر سب نے پہلے ابراہیم علیہ السلام سے قیامت کے متعلق پوچھا، لیکن انہیں قیامت کے متعلق کچھ علم نہ تھا، پھر سب نے موسیٰ علیہ السلام سے پوچھا، تو انہیں بھی قیامت کے متعلق کچھ علم نہ تھا، پھر سب نے عیسیٰ بن مریم علیہما السلام سے پوچھا تو انہوں نے فرمایا: قیامت کے آ دھمکنے سے کچھ پہلے ( دنیا میں جانے کا ) مجھ سے وعدہ لیا گیا ہے، لیکن قیامت کے آنے کا صحیح علم صرف اللہ ہی کو ہے ( کہ وہ کب قائم ہو گی ) ، پھر عیسیٰ علیہ السلام نے دجال کے ظہور کا تذکرہ کیا، اور فرمایا: میں ( زمین پر ) اتر کر اسے قتل کروں گا، پھر لوگ اپنے اپنے شہروں ( ملکوں ) کو لوٹ جائیں گے، اتنے میں یاجوج و ماجوج ان کے سامنے آئیں گے، اور ہر بلندی سے وہ چڑھ دوڑیں گے، وہ جس پانی سے گزریں گے اسے پی جائیں گے، اور جس چیز کے پاس سے گزریں گے، اسے تباہ و برباد کر دیں گے، پھر لوگ اللہ سے دعا کرنے کی درخواست کریں گے، میں اللہ سے دعا کروں گا کہ انہیں مار ڈالے ( چنانچہ وہ سب مر جائیں گے ) ان کی لاشوں کی بو سے تمام زمین بدبودار ہو جائے گی، لوگ پھر مجھ سے دعا کے لیے کہیں گے تو میں پھر اللہ سے دعا کروں گا، تو اللہ تعالیٰ آسمان سے بارش نازل فرمائے گا جو ان کی لاشیں اٹھا کر سمندر میں بہا لے جائے گی، اس کے بعد پہاڑ ریزہ ریزہ کر دئیے جائیں گے، اور زمین چمڑے کی طرح کھینچ کر دراز کر دی جائے گی، پھر مجھے بتایا گیا ہے کہ جب یہ باتیں ظاہر ہوں تو قیامت لوگوں سے ایسی قریب ہو گی جس طرح حاملہ عورت کے حمل کا زمانہ پورا ہو گیا ہو، اور وہ اس انتظار میں ہو کہ کب ولادت کا وقت آئے گا، اور اس کا صحیح وقت کسی کو معلوم نہ ہو۔ عوام ( عوام بن حوشب ) کہتے ہیں کہ اس واقعہ کی تصدیق اللہ کی کتاب میں موجود ہے: «حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون» یہاں تک کہ جب یاجوج و ماجوج کھول دئیے جائیں گے، تو پھر وہ ہر ایک ٹیلے پر سے چڑھ دوڑیں گے ( سورة الأنبياء: 96 ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4082,
			"arabicnumber": 4082,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے، اتنے میں بنی ہاشم کے چند نوجوان آئے، جب نبی اکرم صلی اللہ علیہ وسلم نے انہیں دیکھا، تو آپ کی آنکھیں بھر آئیں، اور آپ کا رنگ بدل گیا، میں نے عرض کیا: ہم آپ کے چہرے میں ہمیشہ کوئی نہ کوئی ایسی بات ضرور دیکھتے ہیں جسے ہم اچھا نہیں سمجھتے ( یعنی آپ کے رنج سے ہمیشہ صدمہ ہوتا ہے ) ، آپ صلی اللہ علیہ وسلم نے فرمایا: ہم اس گھرانے والے ہیں جن کے لیے اللہ نے دنیا کے مقابلے آخرت پسند کی ہے، میرے بعد بہت جلد ہی میرے اہل بیت مصیبت، سختی، اخراج اور جلا وطنی میں مبتلا ہوں گے، یہاں تک کہ مشرق کی طرف سے کچھ لوگ آئیں گے، جن کے ساتھ سیاہ جھنڈے ہوں گے، وہ خیر ( خزانہ ) طلب کریں گے، لوگ انہیں نہ دیں گے تو وہ لوگوں سے جنگ کریں گے، اور ( اللہ کی طرف سے ) ان کی مدد ہو گی، پھر وہ جو مانگتے تھے وہ انہیں دیا جائے گا، ( یعنی لوگ ان کی حکومت پر راضی ہو جائیں گے اور خزانہ سونپ دیں گے ) ، یہ لوگ اس وقت اپنے لیے حکومت قبول نہ کریں گے یہاں تک کہ میرے اہل بیت میں سے ایک شخص کو یہ خزانہ اور حکومت سونپ دیں گے، وہ شخص زمین کو اس طرح عدل سے بھر دے گا جس طرح لوگوں نے اسے ظلم سے بھر دیا تھا، لہٰذا تم میں سے جو شخص اس زمانہ کو پائے وہ ان لوگوں کے ساتھ ( لشکر میں ) شریک ہو، اگرچہ اسے گھٹنوں کے بل برف پر کیوں نہ چلنا پڑے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4083,
			"arabicnumber": 4083,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: میری امت میں مہدی ہوں گے، اگر وہ دنیا میں کم رہے تو بھی سات برس تک ضرور رہیں گے، ورنہ نو برس رہیں گے، ان کے زمانہ میں میری امت اس قدر خوش حال ہو گی کہ اس سے پہلے کبھی نہ ہوئی ہو گی، زمین کا یہ حال ہو گا کہ وہ اپنا سارا پھل اگا دے گی، اس میں سے کچھ بھی اٹھا نہ رکھے گی، اور ان کے زمانے میں مال کا ڈھیر لگا ہو گا، تو ایک شخص کھڑا ہو گا اور کہے گا: اے مہدی! مجھے کچھ دیں، وہ جواب دیں گے: لے لو ( اس ڈھیر میں سے جتنا جی چاہے ) ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4084,
			"arabicnumber": 4084,
			"text": "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارے ایک خزانے کے پاس تین آدمی باہم لڑائی کریں گے، ان میں سے ہر ایک خلیفہ کا بیٹا ہو گا، لیکن ان میں سے کسی کو بھی وہ خزانہ میسر نہ ہو گا، پھر مشرق کی طرف سے کالے جھنڈے نمودار ہوں گے، اور وہ تم کو ایسا قتل کریں گے کہ اس سے پہلے کسی نے نہ کیا ہو گا، پھر آپ صلی اللہ علیہ وسلم نے کچھ اور بھی بیان فرمایا جسے میں یاد نہ رکھ سکا، اس کے بعد آپ نے فرمایا: لہٰذا جب تم اسے ظاہر ہوتے دیکھو تو جا کر اس سے بیعت کرو اگرچہ گھٹنوں کے بل برف پر گھسٹ کر جانا پڑے کیونکہ وہ اللہ کا خلیفہ مہدی ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4085,
			"arabicnumber": 4085,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مہدی ہم اہل بیت میں سے ہو گا، اور اللہ تعالیٰ ایک ہی رات میں ان کو صالح بنا دے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4086,
			"arabicnumber": 4086,
			"text": "سعید بن مسیب کہتے ہیں کہ ہم ام المؤمنین ام سلمہ رضی اللہ عنہا کے پاس تھے، ہم نے مہدی کا تذکرہ کیا، تو انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ مہدی فاطمہ کی اولاد میں سے ہوں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4087,
			"arabicnumber": 4087,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ہم عبدالمطلب کی اولاد ہیں، اور اہل جنت کے سردار ہیں، یعنی: میں، حمزہ، علی، جعفر، حسن، حسین اور مہدی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4088,
			"arabicnumber": 4088,
			"text": "عبداللہ بن حارث بن جزء زبیدی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کچھ لوگ مشرق ( پورب ) کی جانب سے نکلیں گے جو مہدی کی حکومت کے لیے راستہ ہموار کریں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4089,
			"arabicnumber": 4089,
			"text": "حسان بن عطیہ کہتے ہیں کہ مکحول اور ابن ابی زکریا، خالد بن معدان کی طرف مڑے، اور میں بھی ان کے ساتھ مڑا، خالد نے جبیر بن نفیر کے واسطہ سے بیان کیا کہ جبیر نے مجھ سے کہا کہ تم ہمارے ساتھ ذی مخمر رضی اللہ عنہ کے پاس چلو، جو نبی اکرم صلی اللہ علیہ وسلم کے صحابہ میں سے تھے، چنانچہ میں ان دونوں کے ہمراہ چلا، ان سے صلح کے متعلق سوال کیا تو انہوں نے کہا: میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا ہے: عنقریب ہی روم والے تم سے ایک پر امن صلح کریں گے، اور تمہارے ساتھ مل کر دشمن سے لڑیں گے، پھر تم فتح حاصل کرو گے، اور بہت سا مال غنیمت ہاتھ آئے گا، اور تم لوگ سلامتی کے ساتھ جنگ سے لوٹو گے یہاں تک کہ تم ایک تروتازہ اور سرسبز مقام پر جہاں ٹیلے وغیرہ ہوں گے، اترو گے، وہاں صلیب والوں یعنی رومیوں میں سے ایک شخص صلیب بلند کرے گا، اور کہے گا: صلیب غالب آ گئی، مسلمانوں میں سے ایک شخص غصے میں آئے گا، اور اس کے پاس جا کر صلیب توڑ دے گا، اس وقت رومی عہد توڑ دیں گے، اور سب جنگ کے لیے جمع ہو جائیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4090,
			"arabicnumber": 4090,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب بڑی بڑی جنگیں ہونے لگیں گی، تو اللہ تعالیٰ موالی ( جن کو عربوں نے آزاد کیا ہے ) میں سے ایک لشکر اٹھائے گا، جو عربوں سے زیادہ اچھے سوار ہوں گے اور ان سے بہتر ہتھیار رکھتے ہوں گے، اللہ تعالیٰ اس کے ذریعہ دین کی مدد فرمائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4091,
			"arabicnumber": 4091,
			"text": "جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ نافع بن عتبہ بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم عنقریب جزیرہ عرب والوں سے جنگ کرو گے، اللہ تعالیٰ اس پر فتح دے گا، پھر تم رومیوں سے جنگ کرو گے، ان پر بھی اللہ تعالیٰ فتح عنایت فرمائے گا، پھر تم دجال سے جنگ کرو گے، اللہ تعالیٰ اس پر فتح دے گا ۔ جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ جب تک روم فتح نہ ہو گا، دجال کا ظہور نہ ہو گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4092,
			"arabicnumber": 4092,
			"text": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جنگ عظیم، قسطنطنیہ کی فتح اور دجال کا خروج تینوں چیزیں سات مہینے کے اندر ہوں گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4093,
			"arabicnumber": 4093,
			"text": "عبداللہ بن بسر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جنگ عظیم اور فتح مدینہ ( قسطنطنیہ ) کے درمیان چھ سال کا وقفہ ہے، اور دجال کا ظہور ساتویں سال میں ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4094,
			"arabicnumber": 4094,
			"text": "عمرو بن عوف رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت اس وقت تک قائم نہیں ہو سکتی جب تک مسلمانوں کا نزدیک ترین مورچہ مقام بولاء میں نہ ہو ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اے علی! اے علی! اے علی! انہوں نے عرض کیا: میرے ماں باپ آپ پر قربان ہوں ( فرمائیے ) ، آپ صلی اللہ علیہ وسلم نے فرمایا: تم بہت جلد بنی اصفر ( اہل روم ) سے جنگ کرو گے اور ان سے وہ مسلمان بھی لڑیں گے جو تمہارے بعد پیدا ہوں گے، یہاں تک کہ جو لوگ اسلام کی رونق ہوں گے ( یعنی اہل حجاز ) وہ بھی ان سے جنگ کے لیے نکلیں گے، اور اللہ کے معاملہ میں کسی ملامت کرنے والے کی ملامت کا خوف نہ کریں گے، بلکہ تسبیح و تکبیر کے ذریعہ قسطنطنیہ فتح کر لیں گے، اور انہیں ( وہاں ) اس قدر مال غنیمت حاصل ہو گا کہ اتنا کبھی حاصل نہ ہوا تھا، یہاں تک کہ وہ ڈھا لیں بھربھر کر تقسیم کریں گے، اور ایک آنے والا آ کر کہے گا: مسیح ( دجال ) تمہارے ملک میں ظاہر ہو گیا ہے، سن لو! یہ خبر جھوٹی ہو گی، تو مال لینے والا بھی شرمندہ ہو گا، اور نہ لینے والا بھی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4095,
			"arabicnumber": 4095,
			"text": "عوف بن مالک اشجعی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارے اور بنی اصفر ( رومیوں ) کے درمیان صلح ہو گی، پھر وہ تم سے عہد شکنی کریں گے، اور تمہارے مقابلے کے لیے اسی جھنڈوں کے ساتھ فوج لے کر آئیں گے، اور ہر جھنڈے کے نیچے بارہ ہزار فوج ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4096,
			"arabicnumber": 4096,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قیامت اس وقت تک قائم نہ ہو گی جب تک تم ایک ایسی قوم سے جنگ نہ کرو گے جن کے جوتے بالوں کے ہوں گے، قیامت اس وقت تک قائم نہ ہو گی جب تک تم ایک ایسی قوم سے جنگ نہ کرو گے جن کی آنکھیں چھوٹی ہوں گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4097,
			"arabicnumber": 4097,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت قائم نہ ہو گی یہاں تک کہ تم ایک ایسی قوم سے جنگ کرو گے جن کی آنکھیں چھوٹی اور ناکیں چپٹی ہوں گی اور ان کے چہرے تہ بہ تہ ڈھال کی طرح ہوں گے، اور قیامت قائم نہ ہو گی یہاں تک کہ تم ایسی قوم سے جنگ کرو گے جن کے جوتے بالوں کے ہوں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4098,
			"arabicnumber": 4098,
			"text": "عمرو بن تغلب رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا ہے: قیامت کی نشانیوں میں سے ایک نشانی یہ ہے کہ تم ایک ایسی قوم سے جنگ کرو گے جن کے چہرے چوڑے ہوں گے، گویا وہ چپٹی ڈھال ہیں، اور قیامت کی نشانیوں میں سے یہ ہے کہ تم ایک ایسی قوم سے جنگ کرو گے جو بالوں کے جوتے پہنتے ہوں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4099,
			"arabicnumber": 4099,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت اس وقت تک قائم نہ ہو گی جب تک تم ایک ایسی قوم سے جنگ نہ کرو گے جن کی آنکھیں چھوٹی اور چہرے چوڑے ہوں گے، گویا کہ ان کی آنکھیں ٹڈی کی آنکھیں ہیں، اور ان کے چہرے چپٹی ڈھالیں ہیں، وہ بالوں کے جوتے پہنتے ہوں گے اور چمڑے کی ڈھالیں بنائیں گے اور کھجور کے درختوں کی جڑوں سے اپنے گھوڑے باندھیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 175
			}
		}
	]
}