{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"8": "The Chapters Regarding Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو یمن کی جانب بھیجا، اور فرمایا: تم اہل کتاب ( یہود و نصاریٰ ) کے پاس پہنچو گے، تم انہیں اس بات کی دعوت دینا کہ وہ گواہی دیں کہ اللہ تعالیٰ کے سوا کوئی معبود برحق نہیں، اور میں اس کا رسول ہوں، اگر وہ اسے مان لیں تو انہیں بتانا کہ اللہ تعالیٰ نے ان پر رات و دن میں پانچ نمازیں فرض کی ہیں، اگر وہ اسے مان لیں تو بتانا کہ اللہ تعالیٰ نے ان کے مالوں میں ان پر زکاۃ فرض کی ہے، جو ان کے مالداروں سے لی جائے گی اور انہیں کے محتاجوں میں بانٹ دی جائیگی، اگر وہ اس کو مان لیں تو پھر ان کے عمدہ اور نفیس مال وصول کرنے سے بچے رہنا ۱؎ ( بلکہ زکاۃ میں اوسط مال لینا ) ، اور مظلوم کی بد دعا سے بھی بچنا، اس لیے کہ اس کے اور اللہ تعالیٰ کے درمیان کوئی رکاوٹ نہیں ہے ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی اپنے مال کی زکاۃ ادا نہیں کرتا اس کا مال قیامت کے دن ایک گنجا سانپ بن کر آئے گا، اور اس کے گلے کا طوق بن جائے گا، پھر آپ صلی اللہ علیہ وسلم نے اس کے ثبوت کے لیے قرآن کی یہ آیت پڑھی: «ولا يحسبن الذين يبخلون بما آتاهم الله من فضله» یعنی اور جن لوگوں کو اللہ تعالیٰ نے اپنے فضل سے ( کچھ ) مال دیا ہے، اور وہ اس میں بخیلی کرتے ہیں، ( فرض زکاۃ ادا نہیں کرتے ) تو اس بخیلی کو اپنے حق میں بہتر نہ سمجھیں بلکہ بری ہے، ان کے لیے جس ( مال ) میں انہوں نے بخیلی کی ہے، وہی قیامت کے دن ان ( کے گلے ) کا طوق ہوا چاہتا ہے، اور آسمانوں اور زمین کا وارث ( آخر ) اللہ تعالیٰ ہی ہو گا، اور جو تم کرتے ہو ( سخاوت یا بخیلی ) اللہ تعالیٰ کو اس کی خبر ہے ( سورۃ آل عمران: ۱۸۰ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "ابوذر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی اونٹ، بکری اور گائے والا اپنے مال کی زکاۃ ادا نہیں کرتا، تو اس کے جانور قیامت کے دن اس سے بہت بڑے اور موٹے بن کر آئیں گے جتنے وہ تھے، وہ اسے اپنی سینگوں سے ماریں گے اور کھروں سے روندیں گے، جب اخیر تک سب جا نور ایسا کر چکیں گے تو پھر باربار تمام جانور ایسا ہی کرتے رہیں گے یہاں تک کہ لوگوں کے درمیان فیصلہ کر دیا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جن اونٹوں کی زکاۃ نہیں دی گئی وہ آئیں گے اور اپنے مالک کو اپنے پاؤں سے روندیں گے، اور گائیں اور بکریاں آئیں گی وہ اپنے مالک کو اپنے کھروں سے روندیں گی اور اسے سینگوں سے ماریں گی، اور اس کا خزانہ ایک گنجا سانپ بن کر آئے گا، اور اپنے مالک سے قیامت کے دن ملے گا، اس کا مالک اس سے دور بھاگے گا، پھر وہ اس کے سامنے آئے گا تو وہ بھاگے گا، اور کہے گا: آخر تو میرے پیچھے کیوں پڑا ہے؟ وہ کہے گا: میں تیرا خزانہ ہوں، میں تیرا خزانہ ہوں، آخر مالک اپنے ہاتھ کے ذریعہ اس سے اپنا بچاؤ کرے گا لیکن وہ اس کا ہاتھ ڈس لے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "عمر بن خطاب رضی اللہ عنہ کے غلام خالد بن اسلم کہتے ہیں کہ میں عبداللہ بن عمر رضی اللہ عنہما کے ساتھ جا رہا تھا کہ ان سے ایک اعرابی ( دیہاتی ) ملا، اور آیت کریمہ: «والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله» ( سورة التوبة: 34 ) جو لوگ سونے اور چاندی کو خزانہ بنا کر رکھتے ہیں، اور اسے اللہ کی راہ میں صرف نہیں کرتے کے متعلق ان سے پوچھنے لگا کہ اس سے کون لوگ مراد ہیں؟ تو ابن عمر رضی اللہ عنہما نے کہا: جس نے اسے خزانہ بنا کر رکھا، اور اس کی زکاۃ ادا نہیں کی، تو اس کے لیے ہلاکت ہے، یہ آیت زکاۃ کا حکم اترنے سے پہلے کی ہے، پھر جب زکاۃ کا حکم اترا تو اللہ تعالیٰ نے اسے مالوں کی پاکی کا ذریعہ بنا دیا، پھر وہ دوسری طرف متوجہ ہوئے اور بولے: اگر میرے پاس احد پہاڑ کے برابر سونا ہو جس کی تعداد مجھے معلوم ہو، اور اس کی زکاۃ ادا کرتا رہوں، اور اللہ کے حکم کے مطابق اس کو استعمال کرتا رہوں، تو مجھے کوئی پروا نہیں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم نے اپنے مال کی زکاۃ ادا کر دی، تو تم نے وہ حق ادا کر دیا جو تم پر تھا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "فاطمہ بنت قیس رضی اللہ عنہا سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا: مال میں زکاۃ کے علاوہ کوئی حق نہیں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Munqar"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نے گھوڑوں اور غلاموں کی زکاۃ معاف کر دی ہے، لیکن نقد پیسوں میں سے چالیسواں حصہ دو، ہر چالیس درہم میں ایک درہم کے حساب سے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "عبداللہ بن عمر اور ام المؤمنین عائشہ رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ہر بیس دینار یا اس سے زیادہ میں آدھا دینار لیتے تھے، اور چالیس دینار میں ایک دینار کے حساب سے لیتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: کسی بھی مال پر اس وقت تک زکاۃ نہیں ہے جب تک کہ اس پر سال نہ گزر جائے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا: پانچ وسق سے کم کھجور میں زکاۃ نہیں ہے، اور پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے، اور پانچ اونٹوں سے کم میں زکاۃ نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: پانچ اونٹ سے کم میں زکاۃ نہیں ہے، اور پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے، اور پانچ وسق سے کم اناج یا میوہ میں زکاۃ نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "علی بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ عباس رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے اپنی زکاۃ پیشگی ادا کرنے کے متعلق پوچھا تو آپ نے انہیں اس کی رخصت دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "عبداللہ بن ابی اوفی رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس کوئی اپنے مال کی زکاۃ لاتا تو آپ اس کے لیے دعا فرماتے، میں بھی آپ کے پاس اپنے مال کی زکاۃ لے کر آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: «اللهم صل على آل أبي أوفى» اے اللہ! ابواوفی کی اولاد پر اپنی رحمت نازل فرما ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم زکاۃ دو اس کا ثواب نہ بھول جاؤ، بلکہ یوں کہو: «اللهم اجعلها مغنما ولا تجعلها مغرما» اے اللہ! تو اسے ہمارے لیے مال غنیمت بنا دے، اسے تاوان نہ بنا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا، ابن شہاب زہری کہتے ہیں کہ مجھے سالم نے ایک تحریر پڑھوائی، جو رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ کے بیان میں اپنی وفات سے پہلے لکھوائی تھی، اس تحریر میں میں نے یہ لکھا پایا: پانچ اونٹ میں ایک بکری ہے، اور دس اونٹ میں دو بکریاں ہیں، اور پندرہ اونٹ میں تین بکریاں ہیں، اور بیس اونٹ میں چار بکریاں ہیں، اور پچیس سے پینتیس اونٹوں تک میں ایک بنت مخاض ۱؎ ہے، اگر بنت مخاض نہ ہو تو ابن لبون ۲؎ ہے، اور اگر پینتیس سے ایک بھی زیادہ ہو جائے تو ۴۵ تک بنت لبون ۳؎ ہے، اور اگر ۴۵ سے بھی زیادہ ہو جائے تو ساٹھ تک ایک حقہ ۴؎ ہے، اور اگر ساٹھ سے ایک بھی زیادہ ہو جائے، تو ۷۵ تک ایک جذعہ ۵؎، اور اگر ۷۵ سے ایک بھی زیادہ ہو جائے تو نوے تک دو بنت لبون ہیں، اور اگر نوے سے ایک بھی زیادہ ہو جائے تو ۱۲۰ تک دو حقے ہیں، اور اگر ۱۲۰ سے زیادہ ہوں تو ہر پچاس میں ایک حقہ، اور ہر چالیس میں ایک بنت لبون ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: پانچ اونٹوں سے کم میں زکاۃ نہیں ہے، اور چار میں کچھ نہیں ہے، جب پانچ اونٹ ہو جائیں تو نو تک ایک بکری ہے، جب دس ہو جائیں تو چودہ تک دو بکریاں ہیں، اور جب پندرہ ہو جائیں تو ۱۹ تک تین بکریاں ہیں، اور جب بیس ہو جائیں تو ۲۴ تک چار بکریاں ہیں، اور جب پچیس ہو جائیں تو ۳۵ تک بنت مخاض ( ایک سال کی اونٹنی ) ہے، اور اگر ایک سال کی اونٹنی نہ ہو تو ایک ابن لبون ( دو سال کا ایک اونٹ ) ہے، اور اگر ۳۵ سے ایک اونٹ بھی زیادہ ہو جائے تو ۴۵ تک بنت لبون ( دو سال کی ایک اونٹنی ) ہے، اور اگر ۴۵ سے ایک اونٹ بھی زیادہ ہو جائے تو ساٹھ تک حقہ ( تین سال کی ایک اونٹنی ) ہے، اور اگر ۶۰ سے ایک اونٹ بھی زیادہ ہو جائے تو ۷۵ تک جذعہ ( چار سال کی ایک اونٹنی ) ہے، اور اگر ۷۵ سے ایک اونٹ بھی زیادہ ہو جائے تو ۹۰ تک دو بنت لبون ( دو سال کی دو اونٹنیاں ) ہیں، اور اگر ۹۰ سے ایک اونٹ بھی زیادہ ہو جائے تو ۱۲۰ تک دو حقہ ( تین سال کی دو اونٹنیاں ) ہیں، پھر ہر پچاس میں ایک حقہ ( تین سال کی ایک اونٹنی ) ، اور ہر چالیس میں بنت لبون ( دو سال کی ایک اونٹنی ) ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ ابوبکر صدیق رضی اللہ عنہ نے انہیں لکھا: «بسم الله الرحمن الرحيم» یہ فریضہ زکاۃ کا نصاب ہے جسے رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں پر فرض قرار دیا ہے، اور اللہ تعالیٰ نے اپنے رسول کو اس کا حکم دیا، زکاۃ کے اونٹوں کی مقررہ عمروں میں کمی بیشی کی تلافی اس طرح ہو گی کہ جس کو زکاۃ میں جذعہ ( ۴ چار سال کی اونٹنی ) ادا کرنی ہو جو اس کے پاس نہ ہو بلکہ حقہ ( تین سالہ اونٹنی ) ہو تو وہی لے لی جائے گی، اور کمی کے بدلے دو بکریاں لی جائیں گی، اگر اس کے پاس ہوں، ورنہ بیس درہم لیا جائے گا، اور جس شخص کو حقہ بطور زکاۃ ادا کرنا ہو اور اس کے پاس وہ نہ ہو بلکہ بنت لبون ہو تو اس سے بنت لبون قبول کر لی جائے گی، اور وہ اس کے ساتھ دو بکریاں یا بیس درہم دے گا، اور جس کو زکاۃ میں بنت لبون ادا کرنی ہو اور اس کے پاس بنت لبون نہ ہو بلکہ حقہ ہو تو اس سے حقہ لیا جائے گا، اور زکاۃ وصول کرنے والا اسے بیس درہم یا دو بکریاں دے گا، اور جسے زکاۃ میں بنت لبون ادا کرنی ہو، اس کے پاس بنت لبون نہ ہو بلکہ بنت مخاض ہو تو اس سے بنت مخاض لی جائے گی، اور ساتھ میں زکاۃ دینے والا بیس درہم یا دو بکریاں دے گا، اور جس کو زکاۃ میں بنت مخاض ادا کرنی ہو اور اس کے پاس وہ نہ ہو بلکہ بنت لبون ہو تو اس سے بنت لبون لے لی جائے گی، اور زکاۃ وصول کرنے والا اسے بیس درہم یا دو بکریاں واپس دے گا، اور جس کے پاس بنت مخاض نہ ہو بلکہ ابن لبون ہو تو اس سے وہی لے لیا جائے گا، اور اس کو اس کے ساتھ کچھ اور نہ دینا ہو گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "سوید بن غفلہ رضی اللہ عنہ کہتے ہیں کہ ہمارے پاس نبی اکرم صلی اللہ علیہ وسلم کا عامل صدقہ ( زکاۃ وصول کرنے والا ) آیا تو میں نے اس کا ہاتھ پکڑا، اور اس کے میثاق ( عہد نامہ ) میں پڑھا کہ الگ الگ مالوں کو یکجا نہ کیا جائے، اور نہ مشترک مال کو زکاۃ کے ڈر سے الگ الگ کیا جائے، ایک شخص ان کے پاس ایک بھاری اور موٹی سی اونٹنی لے کر آیا، عامل زکاۃ نے اس کو لینے سے انکار کر دیا، آخر وہ دوسری اونٹنی اس سے کم درجہ کی لایا، تو عامل نے اس کو لے لیا، اور کہا کہ کون سی زمین مجھے جگہ دے گی، اور کون سا آسمان مجھ پر سایہ کرے گا؟ جب میں رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک مسلمان کا بہترین مال لے کے جاؤں گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "جریر بن عبداللہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عامل زکاۃ لوگوں کو خوش رکھ کر ہی واپس جائے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے یمن بھیجا، اور حکم دیا کہ ہر چالیس گائے میں ایک «مسنة» لوں، اور ۳۰ تیس گائے میں ایک «تبیع» یا «تبیعہ» لوں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تیس گائے میں ایک «تبیع» یا ایک «تبیعہ» اور چالیس میں ایک«مسنة» ہے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا، ابن شہاب زہری کہتے ہیں کہ مجھے سالم نے ایک تحریر پڑھائی جو رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ کے سلسلے میں اپنی وفات سے پہلے لکھوائی تھی، اس تحریر میں میں نے لکھا پایا: چالیس سے ایک سو بیس بکریوں تک ایک بکری زکاۃ ہے، اگر ۱۲۰ سے ایک بھی زیادہ ہو جائے تو اس میں دو سو تک دو بکریاں ہیں، اور اگر ۲۰۰ سے ایک بھی زیادہ ہو جائے تو اس میں ۳۰۰ تک تین بکریاں ہیں، اور اگر اس سے بھی زیادہ ہو تو ہر سو میں ایک بکری زکاۃ ہے، اور میں نے اس میں یہ بھی پایا: متفرق مال اکٹھا نہ کیا جائے، اور اکٹھا مال متفرق نہ کیا جائے ، اور اس میں یہ بھی پایا: زکاۃ میں جفتی کے لیے مخصوص بکرا، بوڑھا اور عیب دار جانور نہ لیا جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمانوں کی زکاۃ ان کے پانی پلانے کی جگہوں میں لی جائے گی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: چالیس سے لے کر ایک سو بیس بکریوں تک ایک بکری زکاۃ ہے، اگر ایک سو بیس سے ایک بھی زیادہ ہو جائے تو دو سو تک دو بکریاں ہیں، اور اگر دو سو سے ایک بھی زیادہ ہو جائے تو تین سو تک تین بکریاں ہیں، اور اگر تین سو سے زیادہ ہوں تو ہر سو میں ایک بکری ہے، اور جو جانور اکٹھے ہوں انہیں زکاۃ کے ڈر سے الگ الگ نہ کیا جائے، اور نہ ہی جو الگ الگ ہوں انہیں اکٹھا کیا جائے، اور اگر مال میں دو شخص شریک ہوں تو دونوں اپنے اپنے حصہ کے موافق زکاۃ پوری کریں ۱؎، اور زکاۃ میں عامل زکاۃ کو بوڑھا، عیب دار اور جفتی کا مخصوص بکرا نہ دیا جائے، الا یہ کہ عامل زکاۃ خود ہی لینا چاہے ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: زکاۃ لینے میں زیادتی کرنے والا زکاۃ نہ دینے والے کی طرح ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "رافع بن خدیج رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: حق و انصاف کے ساتھ زکاۃ وصول کرنے والا اللہ کے راستہ میں جہاد کرنے والے کی طرح ہے، جب تک کہ لوٹ کر اپنے گھر واپس نہ آ جائے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "عبداللہ بن انیس رضی اللہ عنہ بیان کرتے ہیں کہ انہوں نے اور عمر بن خطاب رضی اللہ عنہ نے ایک دن زکاۃ کے بارے میں آپس میں بات کی تو عمر رضی اللہ عنہ نے کہا: کیا تم نے رسول اللہ صلی اللہ علیہ وسلم سے جس وقت آپ زکاۃ میں خیانت کا ذکر کر رہے تھے یہ نہیں سنا: جس نے زکاۃ کے مال سے ایک اونٹ یا ایک بکری چرا لی تو وہ قیامت کے دن اسے اٹھائے ہوئے لے کر آئے گا ؟ عبداللہ بن انیس رضی اللہ عنہ نے کہا: کیوں نہیں ( ہاں، میں نے سنا ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "عمران رضی اللہ عنہ کے غلام عطا بیان کرتے ہیں کہ عمران بن حصین رضی اللہ عنہما زکاۃ پہ عامل بنائے گئے، جب لوٹ کر آئے تو ان سے پوچھا گیا: مال کہاں ہے؟ انہوں نے کہا: آپ نے مجھے مال لانے کے لیے بھیجا تھا؟ ہم نے زکاۃ ان لوگوں سے لی جن سے رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں لیا کرتے تھے، اور پھر اس کو ان مقامات میں خرچ ڈالا جہاں ہم خرچ کیا کرتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان پر اس کے گھوڑے اور غلام میں زکاۃ نہیں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: میں نے تم سے گھوڑوں، غلام اور لونڈیوں کی زکاۃ معاف کر دی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "معاذ بن جبل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں یمن بھیجا اور فرمایا: ( زکاۃ میں ) غلہ میں سے غلہ، بکریوں میں سے بکری، اونٹوں میں سے اونٹ، اور گایوں میں سے گائے لو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ان پانچ چیزوں میں زکاۃ مقرر کی ہے: گیہوں، جو، کھجور، انگور اور مکئی میں",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو غلہ بارش یا چشمہ کے پانی سے پیدا ہوتا ہو اس میں دسواں حصہ زکاۃ کا ہے، اور جو غلہ پانی سینچ کر پیدا ہو اس میں بیسواں حصہ زکاۃ ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جو غلہ اور پھل بارش، نہر، چشمہ یا زمین کی تری ( سیرابی ) سے پیدا ہو اس میں دسواں حصہ زکاۃ ہے، اور جسے جانوروں کے ذریعہ سینچا گیا ہو اس میں بیسواں حصہ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے یمن بھیجا، اور حکم دیا کہ جو پیداوار بارش کے پانی سے ہو اور جو زمین کی تری سے ہو اس میں دسواں حصہ زکاۃ لوں، اور جو چرخی کے پانی سے ہو اس میں بیسواں حصہ لوں۔ یحییٰ بن آدم کہتے ہیں: «بعل»، «عثری» اور «عذی» وہ زراعت ( کھیتی ) ہے جو بارش کے پانی سے سیراب کی جائے، اور «عثری» اس زراعت کو کہتے ہیں: جو خاص بارش کے پانی سے ہی بوئی جائے اور دوسرا پانی اسے نہ پہنچے، اور «بعل» وہ انگور ہے جس کی جڑیں زمین کے اندر پانی تک چلی گئی ہوں اور اوپر سے پانچ چھ سال تک پانی دینے کی حاجت نہ ہو، بغیر سینچائی کے کام چل جائے، اور «سیل» کہتے ہیں وادی کے بہتے پانی کو، اور «غیل» کہتے ہیں چھوٹے «سیل» کو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "عتاب بن اسید رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم لوگوں کے پاس ایک شخص کو بھیجتے جو ان کے انگوروں اور پھلوں کا اندازہ لگاتا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے جب خیبر فتح کیا، تو آپ نے ان سے شرط لے لی کہ زمین آپ کی ہو گی، اور ہر صفراء اور بیضاء یعنی سونا و چاندی بھی آپ ہی کا ہو گا، اور آپ سے خیبر والوں نے کہا: ہم یہاں کی زمین کے بارے میں زیادہ بہتر جانتے ہیں، لہٰذا آپ ہمیں یہ دے دیجئیے، ہم اس میں کھیتی کریں گے، اور جو پھل پیدا ہو گا وہ آدھا آدھا کر لیں گے، اسی شرط پر آپ صلی اللہ علیہ وسلم نے خیبر کی زمین ان کے حوالے کر دی، جب کھجور توڑنے کا وقت آیا، تو آپ صلی اللہ علیہ وسلم نے عبداللہ بن رواحہ رضی اللہ عنہ کو ان کے پاس بھیجا، انہوں نے کھجور کا تخمینہ لگایا، جس کو اہل مدینہ «خرص» کہتے ہیں، تو انہوں نے کہا: اس میں اتنا اور اتنا پھل ہے، یہودی یہ سن کر بولے: اے ابن رواحہ! آپ نے تو بہت بڑھا کر بتایا، ابن رواحہ رضی اللہ عنہ نے کہا: ٹھیک ہے میں کھجوریں اتروا کر انہیں جمع کر لیتا ہوں اور جو اندازہ میں نے کیا ہے اس کا آدھا تم کو دے دیتا ہوں، یہودی کہنے لگے: یہی حق ہے، اور اسی کی وجہ سے آسمان و زمین قائم ہیں، ہم آپ کے اندازے کے مطابق حصہ لینے پر راضی ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "عوف بن مالک اشجعی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم گھر سے نکلے، اور ایک شخص نے کھجور کے کچھ خوشے مسجد میں لٹکا دئیے تھے، آپ کے ہاتھ میں چھڑی تھی، آپ صلی اللہ علیہ وسلم اس خوشہ میں اس چھڑی سے کھٹ کھٹ مارتے جاتے، اور فرماتے: اگر یہ زکاۃ دینے والا چاہتا تو اس سے بہتر زکاۃ دیتا، یہ زکاۃ والا قیامت کے دن خراب ہی کھجور کھائے گا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "براء بن عازب رضی اللہ عنہما کہتے ہیں آیت کریمہ: «ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون» ( سورة التوبة: 267 ) انصار کے بارے میں نازل ہوئی، جب باغات سے کھجور توڑنے کا وقت آتا تو وہ اپنے باغات سے کھجور کے چند خوشے ( صدقے کے طور پر ) نکالتے، اور مسجد نبوی میں دونوں ستونوں کے درمیان رسی باندھ کر لٹکا دیتے، پھر فقراء مہاجرین اس میں سے کھاتے، انصار میں سے کوئی یہ کرتا کہ ان خوشوں میں خراب کھجور کا خوشہ شامل کر دیتا، اور یہ سمجھتا کہ بہت سارے خوشوں میں ایک خراب خوشہ رکھ دینا جائز ہے، تو انہیں لوگوں کے سلسلہ میں یہ آیت کریمہ نازل ہوئی: «ولا تيمموا الخبيث منه تنفقون» قصد نہ کرو خراب کا اس میں سے کہ اسے خرچ کرو اور تم اسے خود ہرگز لینے والے نہیں ہو، الا یہ کہ چشم پوشی سے کام لو، اگر تمہیں کوئی ایسے خراب مال سے تحفہ بھیجے تو تم کبھی بھی اس کو قبول نہ کرو گے مگر شرم کی وجہ سے، اور دل میں غصہ ہو کر کہ اس نے تمہارے پاس ایسی چیز بھیجی ہے جو تمہارے کام کی نہیں ہے، اور تم جان لو کہ اللہ تمہارے صدقات سے بے نیاز ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "ابوسیارہ متقی رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! میرے پاس شہد کی مکھیاں ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس کا دسواں حصہ بطور زکاۃ ادا کرو ، میں نے عرض کیا: اللہ کے رسول! یہ جگہ میرے لیے خاص کر دیجئیے، چنانچہ آپ نے وہ جگہ میرے لیے خاص کر دی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے شہد سے دسواں حصہ زکاۃ لی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کھجور اور جو سے ایک ایک صاع صدقہ فطر ادا کرنے کا حکم دیا۔ عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں: پھر لوگوں نے دو مد گیہوں کو ایک صاع کھجور یا ایک صاع جو کے برابر کر لیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے صدقہ فطر میں ایک صاع کھجور یا ایک صاع جو مسلمانوں میں سے ہر ایک پر فرض کیا، خواہ وہ آزاد ہو یا غلام، مرد ہو یا عورت ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے صدقہ فطر روزہ دار کو فحش اور بیہودہ باتوں سے پاک کرنے، اور مسکینوں کی خوراک کے لیے فرض قرار دیا، لہٰذا جس نے اسے نماز عید سے پہلے ادا کر دیا، تو یہ مقبول زکاۃ ہے اور جس نے نماز کے بعد ادا کیا تو وہ عام صدقات میں سے ایک صدقہ ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "قیس بن سعد رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ کا حکم نازل ہونے سے پہلے ہمیں صدقہ فطر ادا کرنے کا حکم دیا، لیکن جب زکاۃ کا حکم نازل ہو گیا تو نہ تو ہمیں صدقہ فطر دینے کا حکم دیا، اور نہ ہی منع کیا، اور ہم اسے دیتے رہے ۱؎۔",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ جب ہم میں رسول اللہ صلی اللہ علیہ وسلم موجود تھے ہم تو صدقہ فطر میں ایک صاع گیہوں، ایک صاع کھجور، ایک صاع جو، ایک صاع پنیر، اور ایک صاع کشمش نکالتے تھے، ہم ایسے ہی برابر نکالتے رہے یہاں تک کہ معاویہ رضی اللہ عنہ ہمارے پاس مدینہ آئے، تو انہوں نے جو باتیں لوگوں سے کیں ان میں یہ بھی تھی کہ میں شام کے گیہوں کا دو مد تمہارے غلوں کی ایک صاع کے برابر پاتا ہوں، تو لوگوں نے اسی پر عمل شروع کر دیا۔ ابو سعید خدری رضی اللہ عنہ نے کہا: میں جب تک زندہ رہوں گا اسی طرح ایک صاع نکالتا رہوں گا جس طرح رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں نکالا کرتا تھا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "مؤذن رسول سعد رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک صاع کھجور، ایک صاع جو اور ایک صاع سلت ( بے چھلکے کا جو ) صدقہ فطر میں دینے کا حکم دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "علاء بن حضرمی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے بحرین ہجر بھیجا، میں ایک باغ میں جاتا جو کئی بھائیوں میں مشترک ہوتا، اور ان میں سے ایک مسلمان ہو چکا ہوتا، تو میں مسلمان سے عشر ( دسواں ) حصہ لیتا، اور کافر سے خراج ( محصول ) لیتا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ایک وسق ساٹھ صاع کا ہوتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ایک وسق ساٹھ صاع کا ہوتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کی بیوی زینب رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ اگر میں اپنے شوہر اور زیر کفالت یتیم بچوں پر خرچ کروں تو کیا زکاۃ ہو جائے گی؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس کو دہرا اجر ملے گا، ایک صدقے کا اجر، دوسرے رشتہ جوڑنے کا اجر ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں صدقہ کا حکم دیا، تو عبداللہ بن مسعود رضی اللہ عنہ کی بیوی زینب رضی اللہ عنہا نے کہا: کیا میری زکاۃ ادا ہو جائے گی اگر میں اپنے شوہر پہ جو محتاج ہیں، اور اپنے بھتیجوں پہ جو یتیم ہیں صدقہ کروں، اور میں ہر حال میں ان پر ایسے اور ایسے خرچ کرتی ہوں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں ۔ راوی کہتے ہیں کہ وہ دست کاری کرتی تھیں ( اور پیسے کماتی تھیں ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "زبیر بن عوام رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر تم میں سے کوئی اپنی رسی لے اور پہاڑ پر جا کر ایک گٹھا لکڑیوں کا اپنی پیٹھ پر لادے، اور اس کو بیچ کر اس کی قیمت پر قناعت کرے، تو یہ اس کے لیے لوگوں کے سامنے مانگنے سے بہتر ہے کہ لوگ دیں یا نہ دیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کون میری ایک بات قبول کرتا ہے؟ اور میں اس کے لیے جنت کا ذمہ لیتا ہوں ، میں نے عرض کیا: میں قبول کرتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: لوگوں سے کوئی چیز مت مانگو ، چنانچہ ثوبان رضی اللہ عنہ جب سواری پر ہوتے اور ان کا کوڑا نیچے گر جاتا تو کسی سے یوں نہ کہتے کہ میرا کوڑا اٹھا دو، بلکہ خود اتر کر اٹھاتے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے لوگوں سے مال بڑھانے کے لیے مانگا، تو وہ جہنم کے انگارے مانگتا ہے، چاہے اب وہ زیادہ مانگے یا کم مانگے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": 1839,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: صدقہ و خیرات کسی مالدار یا ہٹے کٹے صحت مند آدمی کے لیے حلال نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": 1840,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص سوال کرے اور اس کے پاس اتنا مال ہو جو اسے بے نیاز کرتا ہو، تو یہ سوال قیامت کے دن اس کے چہرے پہ زخم کا نشان بن کر آئے گا ، لوگوں نے عرض کیا: اللہ کے رسول! کتنا مال آدمی کو بے نیاز کرتا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: پچاس درہم یا اس کی مالیت کا سونا ۱؎۔ ایک شخص نے سفیان ثوری سے کہا: شعبہ تو حکیم بن جبیر سے روایت نہیں کرتے؟ سفیان ثوری نے کہا کہ یہ حدیث ہم سے زبید نے بھی محمد بن عبدالرحمٰن کے واسطے سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مالدار کے لیے زکاۃ حلال نہیں ہے مگر پانچ آدمیوں کے لیے: زکاۃ وصول کرنے والے کے لیے، اللہ کی راہ میں جہاد کرنے والے کے لیے، یا ایسے مالدار کے لیے جس نے اپنے پیسے سے اسے خرید لیا ہو، یا کوئی فقیر ہو جس پر صدقہ کیا گیا ہو، پھر وہ کسی مالدار کو اسے ہدیہ کر دے، ( تو اس مالدار کے لیے وہ زکاۃ حلال ہے ) یا وہ جو مقروض ہو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: جو شخص حلال مال سے صدقہ دے، اور اللہ تعالیٰ تو حلال ہی قبول کرتا ہے، اس کے صدقہ کو دائیں ہاتھ میں لیتا ہے، گرچہ وہ ایک کھجور ہی کیوں نہ ہو، پھر وہ صدقہ رحمن کی ہتھیلی میں بڑھتا رہتا ہے، یہاں تک کہ پہاڑ سے بھی بڑا ہو جاتا ہے، اور اللہ تعالیٰ اس کو ایسے ہی پالتا ہے جس طرح تم میں سے کوئی اپنے گھوڑے یا اونٹ کے بچے کو پالتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ تم میں سے ہر شخص سے قیامت کے دن کلام کرے گا، اور دونوں کے درمیان کوئی ترجمان نہ ہو گا، وہ اپنے سامنے دیکھے گا تو آگ ہو گی، دائیں جانب دیکھے گا تو اپنے اعمال کے سوا کچھ نہ پائے گا، اور بائیں دیکھے گا تو اپنے اعمال کے سوا ادھر بھی کچھ نہ دیکھے گا، لہٰذا تم میں سے جو جہنم سے بچ سکے تو اپنے بچاؤ کا سامان کرے، اگرچہ کھجور کا ایک ٹکڑا ہی صدقہ کر کے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "سلمان بن عامر ضبی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسکین و فقیر کو صدقہ دینا ( صرف ) صدقہ ہے، اور رشتہ دار کو صدقہ دینا دو چیز ہے، ایک صدقہ اور دوسری صلہ رحمی",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 62
			}
		}
	]
}