{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"11": "Friday Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے خبر دی، کہا کہ ہم سے ابوالزناد نے بیان کیا، ان سے ربیعہ بن حارث کے غلام عبدالرحمٰن بن ہرمز اعرج نے بیان کیا کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا اور آپ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ نے فرمایا کہ ہم دنیا میں تمام امتوں کے بعد ہونے کے باوجود قیامت میں سب سے آگے رہیں گے فرق صرف یہ ہے کہ کتاب انہیں ہم سے پہلے دی گئی تھی۔ یہی ( جمعہ ) ان کا بھی دن تھا جو تم پر فرض ہوا ہے۔ لیکن ان کا اس کے بارے میں اختلاف ہوا اور اللہ تعالیٰ نے ہمیں یہ دن بتا دیا اس لیے لوگ اس میں ہمارے تابع ہوں گے۔ یہود دوسرے دن ہوں گے اور نصاریٰ تیسرے دن۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی اور ان کو عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے جب کوئی شخص جمعہ کی نماز کے لیے آنا چا ہے تو اسے غسل کر لینا چاہیے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا، انہوں نے کہا کہ ہم سے جویریہ بن اسماء نے امام مالک سے بیان کیا، ان سے زہری نے، ان سے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے ان سے ابن عمر رضی اللہ عنہما نے کہ عمر بن خطاب رضی اللہ عنہ جمعہ کے دن کھڑے خطبہ دے رہے تھے کہ اتنے میں نبی کریم صلی اللہ علیہ وسلم کے اگلے صحابہ مہاجرین میں سے ایک بزرگ تشریف لائے ( یعنی عثمان رضی اللہ عنہ ) عمر رضی اللہ عنہ نے ان سے کہا بھلا یہ کون سا وقت ہے انہوں نے فرمایا کہ میں مشغول ہو گیا تھا اور گھر واپس آتے ہی اذان سنی، اس لیے میں وضو سے زیادہ اور کچھ ( غسل ) نہ کر سکا۔ عمر رضی اللہ عنہ نے فرمایا کہ وضو بھی اچھا ہے۔ حالانکہ آپ کو معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم غسل کے لیے فرماتے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "ہم سے عبداللہ بن یوسف نے حدیث بیان کی، انہوں نے کہا کہ ہمیں مالک نے صفوان بن سلیم کے واسطہ سے خبر دی، انہیں عطاء بن یسار نے، انہیں ابو سعید خدری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر بالغ کے لیے غسل ضروری ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"text": "ہم سے علی بن مدینی نے بیان کیا، انہوں نے کہا کہ ہمیں حرمی بن عمارہ نے خبر دی انہوں نے کہا کہ ہم سے شعبہ بن حجاج نے ابوبکر بن منکدر سے بیان کیا، انہوں نے کہا کہ مجھ سے عمرو بن سلیم انصاری نے بیان کیا، انہوں نے کہا کہ میں گواہ ہوں کہ ابو سعید خدری رضی اللہ عنہ نے فرمایا تھا کہ میں گواہ ہوں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر جوان پر غسل، مسواک اور خوشبو لگانا اگر میسر ہو، ضروری ہے۔ عمرو بن سلیم نے کہا کہ غسل کے متعلق تو میں گواہی دیتا ہوں کہ وہ واجب ہے لیکن مسواک اور خوشبو کا علم اللہ تعالیٰ کو زیادہ ہے کہ وہ بھی واجب ہیں یا نہیں۔ لیکن حدیث میں اسی طرح ہے۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے فرمایا کہ ابوبکر بن منکدر محمد بن منکدر کے بھائی تھے اور ان کا نام معلوم نہیں ( ابوبکر ان کی کنیت تھی ) بکیر بن اشج۔ سعید بن ابی ہلال اور بہت سے لوگ ان سے روایت کرتے ہیں۔ اور محمد بن منکدر ان کے بھائی کی کنیت ابوبکر اور ابوعبداللہ بھی تھی۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا کہ ہمیں امام مالک نے ابوبکر بن عبدالرحمٰن کے غلام سمی سے خبر دی، جنہیں ابوصالح سمان نے، انہیں ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص جمعہ کے دن غسل جنابت کر کے نماز پڑھنے جائے تو گویا اس نے ایک اونٹ کی قربانی دی ( اگر اول وقت مسجد میں پہنچا ) اور اگر بعد میں گیا تو گویا ایک گائے کی قربانی دی اور جو تیسرے نمبر پر گیا تو گویا اس نے ایک سینگ والے مینڈھے کی قربانی دی۔ اور جو کوئی چوتھے نمبر پر گیا تو اس نے گویا ایک مرغی کی قربانی دی اور جو کوئی پانچویں نمبر پر گیا اس نے گویا انڈا اللہ کی راہ میں دیا۔ لیکن جب امام خطبہ کے لیے باہر آ جاتا ہے تو فرشتے خطبہ سننے میں مشغول ہو جاتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابی کثیر سے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے کہ عمر بن خطاب رضی اللہ عنہ جمعہ کے دن خطبہ دے رہے تھے کہ ایک بزرگ ( عثمان رضی اللہ عنہ ) داخل ہوئے۔ عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ آپ لوگ نماز کے لیے آنے میں کیوں دیر کرتے ہیں۔ ( اول وقت کیوں نہیں آتے ) آنے والے بزرگ نے فرمایا کہ دیر صرف اتنی ہوئی کہ اذان سنتے ہی میں نے وضو کیا ( اور پھر حاضر ہوا ) آپ نے فرمایا کہ کیا آپ لوگوں نے نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث نہیں سنی ہے کہ جب کوئی جمعہ کے لیے جائے تو غسل کر لینا چاہیے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے ابن ابی ذئب نے سعید مقبری سے بیان کیا، کہا کہ مجھے میرے باپ ابوسعید مقبری نے عبداللہ بن ودیعہ سے خبر دی، ان سے سلمان فارسی رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص جمعہ کے دن غسل کرے اور خوب اچھی طرح سے پاکی حاصل کرے اور تیل استعمال کرے یا گھر میں جو خوشبو میسر ہو استعمال کرے پھر نماز جمعہ کے لیے نکلے اور مسجد میں پہنچ کر دو آدمیوں کے درمیان نہ گھسے، پھر جتنی ہو سکے نفل نماز پڑھے اور جب امام خطبہ شروع کرے تو خاموش سنتا رہے تو اس کے اس جمعہ سے لے کر دوسرے جمعہ تک سارے گناہ معاف کر دیئے جاتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی کہ طاؤس بن کیسان نے بیان کیا کہ میں نے عبداللہ بن عباس رضی اللہ عنہما سے پوچھا کہ لوگ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ جمعہ کے دن اگرچہ جنابت نہ ہو لیکن غسل کرو اور اپنے سر دھویا کرو اور خوشبو لگایا کرو۔ ابن عباس رضی اللہ عنہما نے کہا کہ غسل کا حکم تو ٹھیک ہے لیکن خوشبو کے متعلق مجھے علم نہیں۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، انہوں نے کہا کہ ہمیں ہشام بن یوسف نے خبر دی، کہ انہیں ابن جریج نے خبر دی انہوں نے کہا کہ مجھے ابراہیم بن میسرہ نے طاؤس سے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے، آپ نے جمعہ کے دن غسل کے بارے میں نبی کریم صلی اللہ علیہ وسلم کی حدیث کا ذکر کیا تو میں نے کہا کہ کیا تیل اور خوشبو کا استعمال بھی ضروری ہے؟ آپ نے فرمایا کہ مجھے معلوم نہیں۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ عمر بن خطاب رضی اللہ عنہ نے ( ریشم کا ) دھاری دار جوڑا مسجد نبوی کے دروازے پر بکتا دیکھا تو کہنے لگے یا رسول اللہ! بہتر ہو اگر آپ اسے خرید لیں اور جمعہ کے دن اور وفود جب آپ صلی اللہ علیہ وسلم کے پاس آئیں تو ان کی ملاقات کے لیے آپ اسے پہنا کریں۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے تو وہی پہن سکتا ہے جس کا آخرت میں کوئی حصہ نہ ہو۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس اسی طرح کے کچھ جوڑے آئے تو اس میں سے ایک جوڑا آپ نے عمر بن خطاب رضی اللہ عنہ کو عطا فرمایا۔ انہوں نے عرض کیا: یا رسول اللہ! آپ مجھے یہ جوڑا پہنا رہے ہیں حالانکہ اس سے پہلے عطارد کے جوڑے کے بارے میں آپ نے کچھ ایسا فرمایا تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تمہیں خود پہننے کے لیے نہیں دیا ہے، چنانچہ عمر رضی اللہ عنہ نے اسے اپنے ایک مشرک بھائی کو پہنا دیا جو مکے میں رہتا تھا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا کہ ہمیں امام مالک رحمہ اللہ نے ابوالزناد سے خبر دی، ان سے اعرج نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر مجھے اپنی امت یا لوگوں کی تکلیف کا خیال نہ ہوتا تو میں ہر نماز کے لیے ان کو مسواک کا حکم دے دیتا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "ہم سے ابومعمر عبداللہ نے بیان کیا، کہا کہ ہم سے عبدالوارث نے بیان کیا، کہا کہ ہم سے شعیب بن حبحاب نے بیان کیا، کہا کہ ہم سے انس رضی اللہ عنہ نے بیان کیا، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں تم سے مسواک کے بارے میں بہت کچھ کہہ چکا ہوں۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہ ہمیں سفیان ثوری نے منصور بن معمر اور حصین بن عبدالرحمٰن سے خبر دی، انہیں ابووائل نے، انہیں حذیفہ بن یمان رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم جب رات کو اٹھتے تو منہ کو مسواک سے خوب صاف کرتے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، انہوں نے کہا کہ ہم سے سلیمان بن ہلال نے بیان کیا کہ ہشام بن عروہ نے کہا کہ مجھے میرے باپ عروہ بن زبیر نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے خبر دی، انہوں نے کہا کہ عبدالرحمٰن بن ابی بکر ( ایک مرتبہ ) آئے۔ ان کے ہاتھ میں مسواک تھی جسے وہ استعمال کیا کرتے تھے۔ رسول اللہ صلی اللہ علیہ وسلم نے بیماری کی حالت میں ان سے کہا عبدالرحمٰن یہ مسواک مجھے دیدے۔ انہوں نے دے دی۔ میں نے اس کے سرے کو پہلے توڑا یعنی اتنی لکڑی نکال دی جو عبدالرحمٰن اپنے منہ سے لگایا کرتے تھے، پھر اسے چبا کر رسول اللہ صلی اللہ علیہ وسلم کو دے دیا۔ نبی کریم صلی اللہ علیہ وسلم نے اس سے دانت صاف کئے اور آپ صلی اللہ علیہ وسلم اس وقت میرے سینے پر ٹیک لگائے ہوئے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان ثوری نے سعد بن ابراہیم کے واسطے سے بیان کیا، ان سے عبدالرحمٰن بن ہرمز نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں «الم تنزيل‏» اور «هل أتى على الإنسان‏» پڑھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"text": "ہم سے محمد بن مثنی نے بیان کیا، انہوں نے کہا کہ ہم سے ابوعامر عقدی نے بیان کیا، انہوں نے کہا کہ ہم سے ابراہیم بن طہمان نے بیان کیا، ان سے ابوجمرہ نضر بن عبدالرحمٰن ضبعی نے، ان سے عبداللہ بن عباس رضی اللہ عنہما نے، آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کی مسجد کے بعد سب سے پہلا جمعہ بنو عبدالقیس کی مسجد میں ہوا جو بحرین کے ملک جواثی میں تھی۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"text": "ہم سے بشر بن محمد مروزی نے بیان کیا، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، کہا کہ ہمیں یونس بن یزید نے زہری سے خبر دی، انہیں سالم بن عبداللہ نے ابن عمر سے خبر دی، انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا کہ تم میں سے ہر شخص نگہبان ہے اور لیث نے اس میں یہ زیادتی کی کہ یونس نے بیان کیا کہ رزیق بن حکیم نے ابن شہاب کو لکھا، ان دنوں میں بھی وادی القریٰ میں ابن شہاب کے پاس ہی تھا کہ کیا میں جمعہ پڑھا سکتا ہوں۔ رزیق ( ایلہ کے اطراف میں ) ایک زمین کاشت کروا رہے تھے۔ وہاں حبشہ وغیرہ کے کچھ لوگ موجود تھے۔ اس زمانہ میں رزیق ایلہ میں ( عمر بن عبدالعزیز کی طرف سے ) حاکم تھے۔ ابن شہاب رحمہ اللہ نے انہیں لکھوایا، میں وہیں سن رہا تھا کہ رزیق جمعہ پڑھائیں۔ ابن شہاب رزیق کو یہ خبر دے رہے تھے کہ سالم نے ان سے حدیث بیان کی کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا۔ آپ نے فرمایا کہ تم میں سے ہر ایک نگراں ہے اور اس کے ماتحتوں کے متعلق اس سے سوال ہو گا۔ امام نگراں ہے اور اس سے سوال اس کی رعایا کے بارے میں ہو گا۔ انسان اپنے گھر کا نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ عورت اپنے شوہر کے گھر کی نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ خادم اپنے آقا کے مال کا نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ ابن عمر رضی اللہ عنہما نے فرمایا کہ میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ انسان اپنے باپ کے مال کا نگراں ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا اور تم میں سے ہر شخص نگراں ہے اور سب سے اس کی رعیت کے بارے میں سوال ہو گا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے کہا کہ مجھ سے سالم بن عبداللہ نے بیان کیا، انہوں نے (اپنے والد) عبداللہ بن عمر رضی اللہ عنہما سے سنا وہ فرماتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ تم میں سے جو شخص جمعہ پڑھنے آئے تو غسل کرے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے صفوان بن سلیم نے، ان سے عطاء بن یسار نے، ان سے ابو سعید خدری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہر بالغ کے اوپر جمعہ کے دن غسل واجب ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "اس حدیث کی روایت ابان بن صالح نے مجاہد سے کی ہے، ان سے طاؤس نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کا ہر مسلمان پر حق ہے کہ ہر سات دن میں ایک دن ( جمعہ ) غسل کرے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا کہ ہم سے شبابہ نے بیان کیا، کہا کہ ہم سے ورقاء بن عمرو نے بیان کیا، ان سے عمرو بن دینار نے، ان سے مجاہد نے، ان سے ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا عورتوں کو رات کے وقت مسجدوں میں آنے کی اجازت دے دیا کرو۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "ہم سے یوسف بن موسیٰ نے بیان کیا، کہا کہ ہم سے ابواسامہ نے بیان کیا کہا کہ ہم سے عبیداللہ ابن عمر نے بیان کیا، ان سے نافع نے، ان سے عبداللہ بن عمر رضی اللہ عنہما نے، انہوں نے کہا کہ عمر رضی اللہ عنہ کی ایک بیوی تھیں جو صبح اور عشاء کی نماز جماعت سے پڑھنے کے لیے مسجد میں آیا کرتی تھیں۔ ان سے کہا گیا کہ باوجود اس علم کے کہ عمر رضی اللہ عنہ اس بات کو مکروہ جانتے ہیں اور وہ غیرت محسوس کرتے ہیں پھر آپ مسجد میں کیوں جاتی ہیں۔ اس پر انہوں نے جواب دیا کہ پھر وہ مجھے منع کیوں نہیں کر دیتے۔ لوگوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کی اس حدیث کی وجہ سے کہ اللہ کی بندیوں کو اللہ کی مسجدوں میں آنے سے مت روکو۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا۔ انہوں نے کہا کہ ہم سے اسماعیل بن علیہ بیان کیا، انہوں نے کہا کہ ہمیں صاحب الزیادی عبدالحمید نے خبر دی، کہا کہ ہم سے محمد بن سیرین کے چچازاد بھائی عبداللہ بن حارث نے بیان کیا کہ عبداللہ بن عباس رضی اللہ عنہما نے اپنے مؤذن سے ایک دفعہ بارش کے دن کہا کہ «أشهد أن محمدا رسول الله‏» کے بعد «حى على الصلاة‏» ( نماز کی طرف آؤ ) نہ کہنا بلکہ یہ کہنا کہ «صلوا في بيوتكم‏» ( اپنے گھروں میں نماز پڑھ لو ) لوگوں نے اس بات پر تعجب کیا تو آپ نے فرمایا کہ اسی طرح مجھ سے بہتر انسان ( رسول اللہ صلی اللہ علیہ وسلم ) نے کیا تھا۔ بیشک جمعہ فرض ہے اور میں مکروہ جانتا ہوں کہ تمہیں گھروں سے باہر نکال کر مٹی اور کیچڑ پھسلوان میں چلاؤں۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "ہم سے احمد بن صالح نے بیان کیا، انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا کہ مجھے عمرو بن حارث نے خبر دی، ان سے عبیداللہ بن ابی جعفر نے کہ محمد بن جعفر بن زبیر نے ان سے بیان کیا، ان سے عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ نے، آپ نے کہا کہ لوگ جمعہ کی نماز پڑھنے اپنے گھروں سے اور اطراف مدینہ گاؤں سے ( مسجد نبوی میں ) باری باری آیا کرتے تھے۔ لوگ گردوغبار میں چلے آتے، گرد میں اٹے ہوئے اور پسینہ میں شرابور۔ اس قدر پسینہ ہوتا کہ تھمتا ( رکتا ) نہیں تھا۔ اسی حالت میں ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ اس دن ( جمعہ میں ) غسل کر لیا کرتے تو بہتر ہوتا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "ہم سے عبدان عبداللہ بن عثمان نے بیان کیا، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، کہا کہ ہمیں یحیٰی بن سعید نے خبر دی کہ انہوں نے عمرہ بنت عبدالرحمٰن سے جمعہ کے دن غسل کے بارے میں پوچھا۔ انہوں نے بیان کیا کہ عائشہ رضی اللہ عنہا فرماتی تھیں کہ لوگ اپنے کاموں میں مشغول رہتے اور جمعہ کے لیے اسی حالت ( میل کچیل ) میں چلے آتے، اس لیے ان سے کہا گیا کہ کاش تم لوگ ( کبھی ) غسل کر لیا کرتے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "ہم سے سریج بن نعمان نے بیان کیا، انہوں نے کہا کہ ہم سے فلیح بن سلیمان نے بیان کیا، ان سے عثمان بن عبدالرحمٰن بن عثمان تیمی نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کی نماز اس وقت پڑھتے جب سورج ڈھل جاتا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"text": "ہم سے عبدان نے بیان کیا، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، کہا کہ ہمیں حمید طویل نے انس بن مالک رضی اللہ عنہ سے خبر دی۔ آپ نے فرمایا کہ ہم جمعہ سویرے پڑھ لیا کرتے اور جمعہ کے بعد آرام کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا، انہوں نے کہا کہ ہم سے حرمی بن عمارہ نے بیان کیا، انہوں نے کہا کہ ہم سے ابوخلدہ جن کا نام خالد بن دینار ہے، نے بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا، آپ نے فرمایا کہ اگر سردی زیادہ پڑتی تو نبی کریم صلی اللہ علیہ وسلم نماز سویرے پڑھ لیتے۔ لیکن جب گرمی زیادہ ہوتی تو ٹھنڈے وقت نماز پڑھتے۔ آپ کی مراد جمعہ کی نماز سے تھی۔ یونس بن بکیر نے کہا کہ ہمیں ابوخلدہ نے خبر دی۔ انہوں نے صرف نماز کہا۔ جمعہ کا ذکر نہیں کیا اور بشر بن ثابت نے کہا کہ ہم سے ابوخلدہ نے بیان کیا کہ امیر نے ہمیں جمعہ کی نماز پڑھائی۔ پھر انس رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم ظہر کی نماز کس وقت پڑھتے تھے؟",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا کہ ہم سے ولید بن مسلم نے بیان کیا، کہا کہ ہم سے یزید بن ابی مریم نے بیان کیا، کہا کہ ہم سے عبایہ بن رفاعہ بن رافع بن خدیج نے بیان کیا، انہوں نے بیان کیا کہ میں جمعہ کے لیے جا رہا تھا۔ راستے میں ابوعبس رضی اللہ عنہ سے میری ملاقات ہوئی، انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ جس کے قدم اللہ کی راہ میں غبار آلود ہو گئے اللہ تعالیٰ اسے دوزخ پر حرام کر دے گا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے ابن ابی ذئب نے بیان کیا، کہا کہ ہم سے زہری نے سعید اور ابوسلمہ سے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے (دوسری سند سے بیان کیا) امام بخاری رحمہ اللہ نے کہا اور ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے خبر دی، انہیں زہری نے اور انہیں ابوسلمہ بن عبدالرحمٰن نے خبر دی، وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے تھے کہ آپ نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا کہ جب نماز کے لیے تکبیر کہی جائے تو دوڑتے ہوئے مت آؤ بلکہ ( اپنی معمولی رفتار سے ) آؤ پورے اطمینان کے ساتھ پھر نماز کا جو حصہ ( امام کے ساتھ ) پالو اسے پڑھ لو اور جو رہ جائے تو اسے بعد میں پورا کرو۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "ہم سے عمرو بن علی فلاس نے بیان کیا، کہا کہ ہم سے ابو قتیبہ بن قتیبہ نے بیان کیا، کہا کہ ہم سے علی بن مبارک نے یحییٰ بن ابی کثیر سے بیان کیا، ان سے عبداللہ بن ابی قتادہ نے (امام بخاری رحمہ اللہ کہتے ہیں کہ مجھے یقین ہے کہ) عبداللہ نے اپنے باپ ابوقتادہ سے روایت کی ہے، وہ نبی کریم صلی اللہ علیہ وسلم سے راوی ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا جب تک مجھے دیکھ نہ لو صف بندی کے لیے کھڑے نہ ہوا کرو اور آہستگی سے چلنا لازم کر لو۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "ہم سے عبدان نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی انہوں نے کہا کہ ہمیں ابن ابی ذئب نے خبر دی، انہیں سعید مقبری نے، انہیں ان کے باپ ابوسعید نے، انہیں عبداللہ بن ودیعہ نے، انہیں سلمان فارسی رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے جمعہ کے دن غسل کیا اور خوب پاکی حاصل کی اور تیل یا خوشبو استعمال کی، پھر جمعہ کے لیے چلا اور دو آدمیوں کے بیچ میں نہ گھسا اور جتنی اس کی قسمت میں تھی، نماز پڑھی، پھر جب امام باہر آیا اور خطبہ شروع کیا تو خاموش ہو گیا، اس کے اس جمعہ سے دوسرے جمعہ تک کے تمام گناہ بخش دیئے جائیں گے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "ہم سے محمد بن سلام بیکندی رحمہ اللہ نے بیان کیا، کہا کہ ہمیں مخلد بن یزید نے خبر دی، کہا کہ ہمیں ابن جریج نے خبر دی، کہا کہ میں نے نافع سے سنا، انہوں نے کہا میں نے عبداللہ بن عمر سے سنا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے کہ کوئی شخص اپنے مسلمان بھائی کو اٹھا کر اس کی جگہ خود بیٹھ جائے۔ میں نے نافع سے پوچھا کہ کیا یہ جمعہ کے لیے ہے تو انہوں نے جواب دیا کہ جمعہ اور غیر جمعہ سب کے لیے یہی حکم ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "ہم سے آدم نے بیان کیا، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے زہری کے واسطے سے بیان کیا، ان سے سائب بن یزید نے کہ نبی کریم صلی اللہ علیہ وسلم اور ابوبکر اور عمر رضی اللہ عنہما کے زمانے میں جمعہ کی پہلی اذان اس وقت دی جاتی تھی جب امام منبر پر خطبہ کے لیے بیٹھتے لیکن عثمان رضی اللہ عنہ کے زمانہ میں جب مسلمانوں کی کثرت ہو گئی تو وہ مقام زوراء سے ایک اور اذان دلوانے لگے۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) فرماتے ہیں کہ زوراء مدینہ کے بازار میں ایک جگہ ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے کہا کہ ہم سے عبد العزیز بن ابوسلمہ ماجشون نے بیان کیا، انہوں نے کہا ہم سے زہری نے بیان کیا، ان سے سائب بن یزید نے کہ جمعہ میں تیسری اذان عثمان بن عفان رضی اللہ عنہ نے بڑھائی جبکہ مدینہ میں لوگ زیادہ ہو گئے تھے جب کہ نبی کریم صلی اللہ علیہ وسلم کے ایک ہی مؤذن تھے۔ ( آپ صلی اللہ علیہ وسلم کے دور میں ) جمعہ کی اذان اس وقت دی جاتی جب امام منبر پر بیٹھتا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہمیں ابوبکر بن عثمان بن سہل بن حنیف نے خبر دی، انہیں ابوامامہ بن سہل بن حنیف نے، انہوں نے کہا میں نے معاویہ بن ابی سفیان رضی اللہ عنہما کو دیکھا آپ منبر پر بیٹھے، مؤذن نے اذان دی «الله أكبر الله أكبر‏» معاویہ رضی اللہ عنہ نے جواب دیا «الله أكبر الله أكبر‏» مؤذن نے کہا «أشهد أن لا إله إلا الله‏» معاویہ نے جواب دیا «وأنا‏» اور میں بھی توحید کی گواہی دیتا ہوں مؤذن نے کہا «أشهد أن محمدا رسول الله‏» معاویہ نے جواب دیا «وأنا‏» اور میں بھی محمد صلی اللہ علیہ وسلم کی رسالت کی گواہی دیتا ہوں جب مؤذن اذان کہہ چکا تو آپ نے کہا حاضرین! میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا اسی جگہ یعنی منبر پر آپ بیٹھے تھے مؤذن نے اذان دی تو آپ یہی فرما رہے تھے جو تم نے مجھ کو کہتے سنا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا کہ ہم سے لیث بن سعد نے عقیل کے واسطے سے بیان کیا، ان سے ابن شہاب نے کہ سائب بن یزید نے انہیں خبر دی کہ جمعہ کی دوسری اذان کا حکم عثمان بن عفان رضی اللہ عنہ نے اس وقت دیا جب نمازی بہت زیادہ ہو گئے تھے اور جمعہ کے دن اذان اس وقت ہوتی جب امام منبر پر بیٹھا کرتا تھا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہم کو یونس بن یزید نے زہری سے خبر دی، انہوں نے کہا کہ میں نے سائب بن یزید رضی اللہ عنہ سے یہ سنا تھا کہ جمعہ کی پہلی اذان رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر اور عمر رضی اللہ عنہما کے زمانے میں اس وقت دی جاتی تھی جب امام منبر پر بیٹھتا۔ جب عثمان بن عفان رضی اللہ عنہ کا دور آیا اور نمازیوں کی تعداد بڑھ گئی تو آپ نے جمعہ کے دن ایک تیسری اذان کا حکم دیا، یہ اذان مقام زوراء پر دی گئی اور بعد میں یہی دستور قائم رہا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے یعقوب بن عبدالرحمٰن بن محمد بن عبداللہ بن عبد القاری قرشی اسکندرانی نے بیان کیا، انہوں نے کہا کہ ہم سے ابوحازم بن دینار نے بیان کیا کہ کچھ لوگ سہل بن سعد ساعدی رضی اللہ عنہ کے پاس آئے۔ ان کا آپس میں اس پر اختلاف تھا کہ منبرنبوی علی صاحبہا الصلوۃ والسلام کی لکڑی کس درخت کی تھی۔ اس لیے سعد رضی اللہ عنہ سے اس کے متعلق دریافت کیا گیا آپ نے فرمایا اللہ گواہ ہے میں جانتا ہوں کہ منبرنبوی کس لکڑی کا تھا۔ پہلے دن جب وہ رکھا گیا اور سب سے پہلے جب اس پر رسول اللہ صلی اللہ علیہ وسلم بیٹھے تو میں اس کو بھی جانتا ہوں۔ رسول اللہ صلی اللہ علیہ وسلم نے انصار کی فلاں عورت کے پاس جن کا سعد رضی اللہ عنہ نے نام بھی بتایا تھا۔ آدمی بھیجا کہ وہ اپنے بڑھئی غلام سے میرے لیے لکڑی جوڑ دینے کے لیے کہیں۔ تاکہ جب مجھے لوگوں سے کچھ کہنا ہو تو اس پر بیٹھا کروں چنانچہ انہوں نے اپنے غلام سے کہا اور وہ غابہ کے جھاؤ کی لکڑی سے اسے بنا کر لایا۔ انصاری خاتون نے اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیج دیا۔ نبی کریم صلی اللہ علیہ وسلم نے اسے یہاں رکھوایا میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم نے اسی پر ( کھڑے ہو کر ) نماز پڑھائی۔ اسی پر کھڑے کھڑے تکبیر کہی۔ اسی پر رکوع کیا۔ پھر الٹے پاؤں لوٹے اور منبر کی جڑ میں سجدہ کیا اور پھر دوبارہ اسی طرح کیا جب آپ نماز سے فارغ ہوئے تو لوگوں کو خطاب فرمایا۔ لوگو! میں نے یہ اس لیے کیا کہ تم میری پیروی کرو اور میری طرح نماز پڑھنی سیکھ لو۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا کہ ہم سے محمد بن جعفر بن ابی کثیر نے بیان کیا، کہا کہ مجھے یحییٰ بن سعید نے خبر دی، کہا کہ مجھے حفص بن عبداللہ بن انس نے خبر دی، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا کہ ایک کھجور کا تنا تھا جس پر نبی کریم صلی اللہ علیہ وسلم ٹیک لگا کر کھڑے ہوا کرتے تھے۔ جب آپ صلی اللہ علیہ وسلم کے لیے منبر بن گیا ( آپ صلی اللہ علیہ وسلم نے اس تنے پر ٹیک نہیں لگایا ) تو ہم نے اس سے رونے کی آواز سنی جیسے دس مہینے کی گابھن اونٹنی آواز کرتی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے منبر سے اتر کر اپنا ہاتھ اس پر رکھا ( تب وہ آواز موقوف ہوئی ) اور سلیمان نے یحییٰ سے یوں حدیث بیان کی کہ مجھے حفص بن عبیداللہ بن انس نے خبر دی اور انہوں نے جابر سے سنا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے بیان کیا، ان سے زہری نے، ان سے سالم نے، ان سے ان کے باپ (ابن عمر رضی اللہ عنہما) نے فرمایا کہ میں نے نبی کریم صلی الہ علیہ وسلم سے سنا۔ آپ صلی اللہ علیہ وسلم نے منبر پر خطبہ دیتے ہوئے فرمایا کہ جو جمعہ کے لیے آئے وہ پہلے غسل کر لیا کرے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "ہم سے عبیداللہ بن عمر قواریری نے بیان کیا، انہوں نے کہا کہ ہم سے خالد بن حارث نے بیان کیا، انہوں نے کہا کہ ہم سے عبیداللہ بن عمر نے نافع سے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم کھڑے ہو کر خطبہ دیتے تھے۔ پھر بیٹھ جاتے اور پھر کھڑے ہوتے جیسے تم لوگ بھی آج کل کرتے ہو۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "ہم سے معاذ بن فضالہ نے بیان کیا، کہا کہ ہم سے ہشام دستوائی نے یحیی بن ابی کثیر سے بیان کیا، ان سے ہلال بن ابی میمونہ نے، انہوں نے کہا ہم سے عطاء بن یسار نے بیان کیا، انہوں نے ابو سعید خدری رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم ایک دن منبر پر تشریف فرما ہوئے اور ہم سب آپ صلی اللہ علیہ وسلم کے ارد گرد بیٹھ گئے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "اور محمود بن غیلان (امام بخاری رحمہ اللہ کے استاذ) نے کہا کہ ہم سے ابواسامہ نے بیان کیا کہ ہم سے ہشام بن عروہ نے بیان کیا، کہ مجھے فاطمہ بنت منذر نے خبر دی، ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے، انہوں نے کہا کہ میں عائشہ رضی اللہ عنہا کے پاس گئی۔ لوگ نماز پڑھ رہے تھے۔ میں نے ( اس بے وقت نماز پر تعجب سے پوچھا کہ ) یہ کیا ہے؟ عائشہ رضی اللہ عنہا نے سر سے آسمان کی طرف اشارہ کیا۔ میں نے پوچھا کیا کوئی نشانی ہے؟ انہوں نے سر کے اشارہ سے ہاں کہا ( کیونکہ سورج گہن ہو گیا تھا ) اسماء رضی اللہ عنہا نے کہا کہ نبی کریم صلی اللہ علیہ وسلم دیر تک نماز پڑھتے رہے۔ یہاں تک کہ مجھ کو غشی آنے لگی۔ قریب ہی ایک مشک میں پانی بھرا رکھا تھا۔ میں اسے کھول کر اپنے سر پر پانی ڈالنے لگی۔ پھر جب سورج صاف ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے نماز ختم کر دی۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خطبہ دیا۔ پہلے اللہ تعالیٰ کی اس کی شان کے مناسب تعریف بیان کی۔ اس کے بعد فرمایا «امابعد» ! اتنا فرمانا تھا کہ کچھ انصاری عورتیں شور کرنے لگیں۔ اس لیے میں ان کی طرف بڑھی کہ انہیں چپ کراؤں ( تاکہ رسول اللہ صلی اللہ علیہ وسلم کی بات اچھی طرح سن سکوں مگر میں آپ کا کلام نہ سن سکی ) تو پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے کیا فرمایا؟ انہوں نے بتایا کہ آپ نے فرمایا کہ بہت سی چیزیں جو میں نے اس سے پہلے نہیں دیکھی تھیں، آج اپنی اس جگہ سے میں نے انہیں دیکھ لیا۔ یہاں تک کہ جنت اور دوزخ تک میں نے آج دیکھی۔ مجھے وحی کے ذریعہ یہ بھی بتایا گیا کہ قبروں میں تمہاری ایسی آزمائش ہو گی جیسے کانے دجال کے سامنے یا اس کے قریب قریب۔ تم میں سے ہر ایک کے پاس فرشتہ آئے گا اور پوچھے گا کہ تو اس شخص کے بارے میں کیا اعتقاد رکھتا تھا؟ مومن یا یہ کہا کہ یقین والا ( ہشام کو شک تھا ) کہے گا کہ وہ محمد رسول اللہ صلی اللہ علیہ وسلم ہیں، ہمارے پاس ہدایت اور واضح دلائل لے کر آئے، اس لیے ہم ان پر ایمان لائے، ان کی دعوت قبول کی، ان کی اتباع کی اور ان کی تصدیق کی۔ اب اس سے کہا جائے گا کہ تو تو صالح ہے، آرام سے سو جا۔ ہم پہلے ہی جانتے تھے کہ تیرا ان پر ایمان ہے۔ ہشام نے شک کے اظہار کے ساتھ کہا کہ رہا منافق یا شک کرنے والا تو جب اس سے پوچھا جائے گا کہ تو اس شخص کے بارے میں کیا کہتا ہے تو وہ جواب دے گا کہ مجھے نہیں معلوم میں نے لوگوں کو ایک بات کہتے سنا اسی کے مطابق میں نے بھی کہا۔ ہشام نے بیان کیا کہ فاطمہ بنت منذر نے جو کچھ کہا تھا۔ میں نے وہ سب یاد رکھا۔ لیکن انہوں نے قبر میں منافقوں پر سخت عذاب کے بارے میں جو کچھ کہا وہ مجھے یاد نہیں رہا۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "ہم سے محمد بن معمر نے بیان کیا، کہا کہ ہم سے ابوعاصم نے جریر بن حازم سے بیان کیا، انہوں نے کہا کہ میں نے امام حسن بصری سے سنا، انہوں نے بیان کیا کہ ہم نے عمرو بن تغلب رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ مال آیا یا کوئی چیز آئی۔ آپ نے بعض صحابہ کو اس میں سے عطا کیا اور بعض کو کچھ نہیں دیا۔ پھر آپ کو معلوم ہوا کہ جن لوگوں کو آپ نے نہیں دیا تھا انہیں اس کا رنج ہوا، اس لیے آپ نے اللہ کی حمد و تعریف کی پھر فرمایا «امابعد» ! اللہ کی قسم! میں بعض لوگوں کو دیتا ہوں اور بعض کو نہیں دیتا لیکن میں جس کو نہیں دیتا وہ میرے نزدیک ان سے زیادہ محبوب ہیں جن کو میں دیتا ہوں۔ میں تو ان لوگوں کو دیتا ہوں جن کے دلوں میں بے صبری اور لالچ پاتا ہوں لیکن جن کے دل اللہ تعالیٰ نے خیر اور بےنیاز بنائے ہیں، میں ان پر بھروسہ کرتا ہوں۔ عمرو بن تغلب بھی ان ہی لوگوں میں سے ہیں۔ اللہ کی قسم! میرے لیے رسول اللہ صلی اللہ علیہ وسلم کا یہ ایک کلمہ سرخ اونٹوں سے زیادہ محبوب ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا کہ ہم سے لیث نے عقیل سے بیان کیا، ان سے ابن شہاب نے، انہوں نے کہا کہ مجھے عروہ نے خبر دی کہ عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے رات کے وقت اٹھ کر مسجد میں نماز پڑھی اور چند صحابہ بھی آپ صلی اللہ علیہ وسلم کی اقتداء میں نماز پڑھنے کھڑے ہو گئے۔ صبح کو ان صحابہ ( رضوان اللہ علیہم اجمعین ) نے دوسرے لوگوں سے اس کا ذکر کیا چنانچہ ( دوسرے دن ) اس سے بھی زیادہ جمع ہو گئے اور آپ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی۔ دوسری صبح کو اس کا چرچا اور زیادہ ہوا پھر کیا تھا تیسری رات بڑی تعداد میں لوگ جمع ہو گئے اور جب رسول اللہ صلی اللہ علیہ وسلم اٹھے تو صحابہ رضی اللہ عنہم نے آپ صلی اللہ علیہ وسلم کے پیچھے نماز شروع کر دی۔ چوتھی رات جو آئی تو مسجد میں نمازیوں کی کثرت سے تل رکھنے کی بھی جگہ نہیں تھی۔ لیکن آج رات نبی کریم صلی اللہ علیہ وسلم نے یہ نماز نہ پڑھائی اور فجر کی نماز کے بعد لوگوں سے فرمایا، پہلے آپ نے کلمہ شہادت پڑھا پھر فرمایا۔ «امابعد» ! مجھے تمہاری اس حاضری سے کوئی ڈر نہیں لیکن میں اس بات سے ڈرا کہ کہیں یہ نماز تم پر فرض نہ کر دی جائے، پھر تم سے یہ ادا نہ ہو سکے۔ اس روایت کی متابعت یونس نے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے کہا کہ مجھے عروہ نے ابو حمید ساعدی رضی اللہ عنہ سے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم نماز عشاء کے بعد کھڑے ہوئے۔ پہلے آپ نے کلمہ شہادت پڑھا، پھر اللہ تعالیٰ کے لائق اس کی تعریف کی، پھر فرمایا «امابعد» ! زہری کے ساتھ اس روایت کی متابعت ابومعاویہ اور ابواسامہ نے ہشام سے کی، انہوں نے اپنے والد عروہ سے اس کی روایت کی، انہوں نے ابوحمید سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا «امابعد» ! اور ابوالیمان کے ساتھ اس حدیث کو محمد بن یحییٰ نے بھی سفیان سے روایت کیا۔ اس میں صرف «امابعد» ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی، کہا کہ مجھ سے علی بن حسین نے مسور بن مخرمہ رضی اللہ عنہما سے حدیث بیان کی کہ نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے۔ میں نے سنا کہ کلمہ شہادت کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا «امابعد» ! شعیب کے ساتھ اس روایت کی متابعت محمد بن ولید زبیدی نے زہری سے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 927,
			"arabicnumber": 927,
			"text": "ہم سے اسماعیل بن ابان نے بیان کیا، انہوں نے کہا کہ ہم سے ابن غسیل عبدالرحمٰن بن سلیمان نے بیان کیا، انہوں نے کہا کہ ہم سے عکرمہ نے ابن عباس رضی اللہ عنہما کے واسطے سے بیان کیا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم منبر پر تشریف لائے۔ منبر پر یہ آپ کی آخری بیٹھک تھی۔ آپ دونوں شانوں سے چادر لپیٹے ہوئے تھے اور سر مبارک پر ایک پٹی باندھ رکھی تھی۔ آپ نے حمد و ثنا کے بعد فرمایا لوگو! میری بات سنو۔ چنانچہ لوگ آپ کی طرف کلام مبارک سننے کے لیے متوجہ ہو گئے۔ پھر آپ نے فرمایا «امابعد» ! یہ قبیلہ انصار کے لوگ ( آنے والے دور میں ) تعداد میں بہت کم ہو جائیں گے پس محمد صلی اللہ علیہ وسلم کی امت کا جو شخص بھی حاکم ہو اور اسے نفع و نقصان پہنچانے کی طاقت ہو تو انصار کے نیک لوگوں کی نیکی قبول کرے اور ان کے برے کی برائی سے درگزر کرے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے بشر بن مفضل نے بیان کیا، کہا کہ ہم سے عبیداللہ عمری نے نافع سے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم ( جمعہ میں ) دو خطبے دیتے اور دونوں کے بیچ میں بیٹھتے تھے۔ ( خطبہ جمعہ کے بیچ میں یہ بیٹھنا بھی مسنون طریقہ ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے محمد بن عبدالرحمٰن بن ابی ذئب نے بیان کیا، ان سے زہری نے، ان سے ابوعبداللہ سلیمان اغر نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب جمعہ کا دن آتا ہے تو فرشتے جامع مسجد کے دروازے پر آنے والوں کے نام لکھتے ہیں، سب سے پہلے آنے والا اونٹ کی قربانی دینے والے کی طرح لکھا جاتا ہے۔ اس کے بعد آنے والا گائے کی قربانی دینے والے کی طرح پھر مینڈھے کی قربانی کا ثواب رہتا ہے۔ اس کے بعد مرغی کا، اس کے بعد انڈے کا۔ لیکن جب امام ( خطبہ دینے کے لیے ) باہر آ جاتا ہے تو یہ فرشتے اپنے دفاتر بند کر دیتے ہیں اور خطبہ سننے میں مشغول ہو جاتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے عمرو بن دینار نے، ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ایک شخص آیا نبی کریم صلی اللہ علیہ وسلم جمعہ کا خطبہ دے رہے تھے۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ اے فلاں! کیا تم نے ( تحیۃ المسجد کی ) نماز پڑھ لی۔ اس نے کہا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا اچھا اٹھ اور دو رکعت نماز پڑھ لے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے عمرو سے بیان کیا، انہوں نے جابر رضی اللہ عنہ سے سنا کہ ایک شخص جمعہ کے دن مسجد میں آیا۔ نبی کریم صلی اللہ علیہ وسلم خطبہ پڑھ رہے تھے۔ آپ صلی اللہ علیہ وسلم نے اس سے پوچھا کہ کیا تم نے ( تحیۃ المسجد کی ) نماز پڑھ لی ہے؟ آنے والے نے جواب دیا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اٹھو اور دو رکعت نماز ( تحیۃ المسجد ) پڑھ لو۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے عبد العزیز بن انس نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے (دوسری سند) اور حماد بن یونس سے بھی روایت کی عبدالعزیز اور یونس دونوں نے ثابت سے، انہوں نے انس رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم جمعہ کا خطبہ دے رہے تھے کہ ایک شخص کھڑا ہو گیا اور عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم مویشی اور بکریاں ہلاک ہو گئیں ( بارش نہ ہونے کی وجہ سے ) آپ دعا فرمائیں کہ اللہ تعالیٰ بارش برسائے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے دونوں ہاتھ پھیلائے اور دعا کی۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا کہ ہم سے ولید بن مسلم نے بیان کیا، انہوں نے کہا کہ ہم سے امام ابوعمرو اوزاعی نے بیان کیا، انہوں نے کہا کہ مجھ سے اسحاق بن عبداللہ بن ابی طلحہ رضی اللہ عنہ نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے کہ ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم کے زمانے میں قحط پڑا، آپ صلی اللہ علیہ وسلم خطبہ دے رہے تھے کہ ایک دیہاتی نے کہا یا رسول اللہ! جانور مر گئے اور اہل و عیال دانوں کو ترس گئے۔ آپ ہمارے لیے اللہ تعالیٰ سے دعا فرمائیں۔ آپ صلی اللہ علیہ وسلم نے دونوں ہاتھ اٹھائے، اس وقت بادل کا ایک ٹکڑا بھی آسمان پر نظر نہیں آ رہا تھا۔ اس ذات کی قسم جس کے ہاتھ میری جان ہے ابھی آپ صلی اللہ علیہ وسلم نے ہاتھوں کو نیچے بھی نہیں کیا تھا کہ پہاڑوں کی طرح گھٹا امڈ آئی اور آپ صلی اللہ علیہ وسلم ابھی منبر سے اترے بھی نہیں تھے کہ میں نے دیکھا کہ بارش کا پانی آپ صلی اللہ علیہ وسلم کے ریش مبارک سے ٹپک رہا تھا۔ اس دن اس کے بعد اور متواتر اگلے جمعہ تک بارش ہوتی رہی۔ ( دوسرے جمعہ کو ) یہی دیہاتی پھر کھڑا ہوا یا کہا کہ کوئی دوسرا شخص کھڑا ہوا اور عرض کی کہ یا رسول اللہ! عمارتیں منہدم ہو گئیں اور جانور ڈوب گئے۔ آپ ہمارے لیے اللہ سے دعا کیجئے۔ آپ صلی اللہ علیہ وسلم نے دونوں ہاتھ اٹھائے اور دعا کی کہ اے اللہ! اب دوسری طرف بارش برسا اور ہم سے روک دے۔ آپ ہاتھ سے بادل کے لیے جس طرف بھی اشارہ کرتے، ادھر مطلع صاف ہو جاتا۔ سارا مدینہ تالاب کی طرح بن گیا تھا اور قناۃ کا نالا مہینہ بھر بہتا رہا اور اردگرد سے آنے والے بھی اپنے یہاں بھرپور بارش کی خبر دیتے رہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا کہ ہم سے لیث بن سعد نے عقیل سے بیان کیا، ان سے ابن شہاب نے، انہوں نے کہا کہ مجھے سعید بن مسیب نے خبر دی اور انہیں ابوہریرہ رضی اللہ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب امام جمعہ کا خطبہ دے رہا ہو اور تو اپنے پاس بیٹھے ہوئے آدمی سے کہے کہ ”چپ رہ“ تو تو نے خود ایک لغو حرکت کی۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے امام مالک رحمہ اللہ سے بیان کیا، ان سے ابوالزناد نے، ان سے عبدالرحمٰن اعرج نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے جمعہ کے ذکر میں ایک دفعہ فرمایا کہ اس دن ایک ایسی گھڑی آتی ہے جس میں اگر کوئی مسلمان بندہ کھڑا نماز پڑھ رہا ہو اور کوئی چیز اللہ پاک سے مانگے تو اللہ پاک اسے وہ چیز ضرور دیتا ہے۔ ہاتھ کے اشارے سے آپ نے بتلایا کہ وہ ساعت بہت تھوڑی سی ہے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "ہم سے معاویہ بن عمرو نے بیان کیا، کہا کہ ہم سے زائدہ نے حصین سے بیان کیا، ان سے سالم بن ابی جعد نے، انہوں نے کہا کہ ہم سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھ رہے تھے، اتنے میں غلہ لادے ہوئے ایک تجارتی قافلہ ادھر سے گزرا۔ لوگ خطبہ چھوڑ کر ادھر چل دیئے۔ نبی کریم صلی اللہ علیہ وسلم کے ساتھ کل بارہ آدمی رہ گئے۔ اس وقت سورۃ الجمعہ کی یہ آیت اتری «وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏» ”اور جب یہ لوگ تجارت اور کھیل دیکھتے ہیں تو اس کی طرف دوڑ پڑتے ہیں اور آپ کو کھڑا چھوڑ دیتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے نافع سے خبر دی، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم ظہر سے پہلے دو رکعت، اس کے بعد دو رکعت اور مغرب کے بعد دو رکعت اپنے گھر میں پڑھتے اور عشاء کے بعد دو رکعتیں پڑھتے اور جمعہ کے بعد دو رکعتیں جب گھر واپس ہوتے تب پڑھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا کہ ہم سے ابوغسان محمد بن مطر مدنی نے بیان کیا، انہوں نے کہا کہ مجھ سے ابوحازم سلمہ بن دینار نے سہل بن سعد کے واسطے سے بیان کیا، انہوں نے بیان کیا کہ ہمارے یہاں ایک عورت تھی جو نالوں پر اپنے ایک کھیت میں چقندر بوتی۔ جمعہ کا دن آتا تو وہ چقندر اکھاڑ لاتیں اور اسے ایک ہانڈی میں پکاتیں پھر اوپر سے ایک مٹھی جو کا آٹا چھڑک دیتیں۔ اس طرح یہ چقندر گوشت کی طرح ہو جاتے۔ جمعہ سے واپسی میں ہم انہیں سلام کرنے کے لیے حاضر ہوتے تو یہی پکوان ہمارے آگے کر دیتیں اور ہم اسے چاٹ جاتے۔ ہم لوگ ہر جمعہ کو ان کے اس کھانے کے آرزومند رہا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، کہا کہ ہم سے عبد العزیز بن ابی حازم نے بیان کیا اپنے باپ سے اور ان سے سہل بن سعد نے یہی بیان کیا اور فرمایا کہ دوپہر کا سونا اور دوپہر کا کھانا جمعہ کی نماز کے بعد رکھتے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "ہم سے محمد بن عقبہ شیبانی نے بیان کیا، کہا کہ ہم سے ابواسحاق فزاری ابراہیم بن محمد نے بیان کیا، ان سے حمید طویل نے، انہوں نے انس رضی اللہ عنہ سے سنا۔ آپ فرماتے تھے کہ ہم جمعہ سویرے پڑھتے، اس کے بعد دوپہر کی نیند لیتے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا کہ ہم سے ابوغسان نے بیان کیا، کہا کہ مجھ سے ابوحازم نے سہل بن سعد رضی اللہ عنہ سے بیان کیا، انہوں نے بتلایا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے، پھر دوپہر کی نیند لیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		}
	]
}