{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"13": "The Two Festivals (Eids)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے کہا کہ مجھے سالم بن عبداللہ نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ عمر رضی اللہ عنہ ایک موٹے ریشمی کپڑے کا چغہ لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے جو بازار میں بک رہا تھا کہنے لگے: یا رسول اللہ! آپ اسے خرید لیجئے اور عید اور وفود کی پذیرائی کے لیے اسے پہن کر زینت فرمایا کیجئے۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو وہ پہنے گا جس کا ( آخرت میں ) کوئی حصہ نہیں۔ اس کے بعد جب تک اللہ نے چاہا عمر رہی پھر ایک دن رسول اللہ صلی اللہ علیہ وسلم نے خود ان کے پاس ایک ریشمی چغہ تحفہ میں بھیجا۔ عمر رضی اللہ عنہ اسے لیے ہوئے آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا کہ یا رسول اللہ! آپ نے تو یہ فرمایا کہ اس کو وہ پہنے گا جس کا آخرت میں کوئی حصہ نہیں پھر آپ نے یہ میرے پاس کیوں بھیجا؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تیرے پہننے کو نہیں بھیجا بلکہ اس لیے کہ تم اسے بیچ کر اس کی قیمت اپنے کام میں لاؤ۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 951,
			"arabicnumber": 951,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، انہیں زبید بن حارث نے خبر دی، انہوں نے کہا کہ میں نے شعبی سے سنا، ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے عید کے دن خطبہ دیتے ہوئے فرمایا کہ پہلا کام جو ہم آج کے دن ( عید الاضحیٰ ) میں کرتے ہیں، یہ ہے کہ پہلے ہم نماز پڑھیں پھر واپس آ کر قربانی کریں۔ جس نے اس طرح کیا وہ ہمارے طریق پر چلا۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے باپ (عروہ بن زبیر) نے، ان سے عائشہ رضی اللہ عنہا نے، آپ نے بتلایا کہ ابوبکر رضی اللہ عنہ تشریف لائے تو میرے پاس انصار کی دو لڑکیاں وہ اشعار گا رہی تھیں جو انصار نے بعاث کی جنگ کے موقع پر کہے تھے۔ عائشہ رضی اللہ عنہا نے کہا کہ یہ گانے والیاں نہیں تھیں، ابوبکر رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم کے گھر میں یہ شیطانی باجے اور یہ عید کا دن تھا آخر رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ سے فرمایا اے ابوبکر! ہر قوم کی عید ہوتی ہے اور آج یہ ہماری عید ہے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "ہم سے محمد بن عبدالرحیم نے بیان کیا کہ ہم کو سعید بن سلیمان نے خبر دی کہ ہمیں ہشیم بن بشیر نے خبر دی، کہا کہ ہمیں عبداللہ بن ابی بکر بن انس نے خبر دی اور انہیں انس بن مالک رضی اللہ عنہ نے، آپ نے بتلایا کہ رسول اللہ صلی اللہ علیہ وسلم عیدالفطر کے دن نہ نکلتے جب تک کہ آپ صلی اللہ علیہ وسلم چند کھجوریں نہ کھا لیتے اور مرجی بن رجاء نے کہا کہ مجھ سے عبیداللہ بن ابی بکر نے بیان کیا، کہا کہ مجھ سے انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے، پھر یہی حدیث بیان کی کہ آپ طاق عدد کھجوریں کھاتے تھے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے اسماعیل بن علیہ نے ایوب سختیانی سے، انہوں نے محمد بن سیرین سے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص نماز سے پہلے قربانی کر دے اسے دوبارہ کرنی چاہیے۔ اس پر ایک شخص ( ابوبردہ ) نے کھڑے ہو کر کہا کہ یہ ایسا دن ہے جس میں گوشت کی خواہش زیادہ ہوتی ہے اور اس نے اپنے پڑوسیوں کی تنگی کا حال بیان کیا۔ نبی کریم صلی اللہ علیہ وسلم نے اس کو سچا سمجھا اس شخص نے کہا کہ میرے پاس ایک سال کی پٹھیا ہے جو گوشت کی دو بکریوں سے بھی مجھے زیادہ پیاری ہے۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر اسے اجازت دے دی کہ وہی قربانی کرے۔ اب مجھے معلوم نہیں کہ یہ اجازت دوسروں کے لیے بھی ہے یا نہیں۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا کہ ہم سے جریر نے بیان کیا، ان سے منصور نے، ان سے شعبی نے، ان سے براء بن عازب رضی اللہ عنہما نے، آپ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے عید الاضحی کی نماز کے بعد خطبہ دیتے ہوئے فرمایا کہ جس شخص نے ہماری نماز کی طرح نماز پڑھی اور ہماری قربانی کی طرح قربانی کی اس کی قربانی صحیح ہوئی لیکن جو شخص نماز سے پہلے قربانی کرے وہ نماز سے پہلے ہی گوشت کھاتا ہے مگر وہ قربانی نہیں۔ براء کے ماموں ابو بردہ بن نیار یہ سن کر بولے کہ یا رسول اللہ! میں نے اپنی بکری کی قربانی نماز سے پہلے کر دی میں نے سوچا کہ یہ کھانے پینے کا دن ہے میری بکری اگر گھر کا پہلا ذبیحہ بنے تو بہت اچھا ہو۔ اس خیال سے میں نے بکری ذبح کر دی اور نماز سے پہلے ہی اس کا گوشت بھی کھا لیا۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تمہاری بکری گوشت کی بکری ہوئی۔ ابوبردہ بن نیار نے عرض کیا کہ میرے پاس ایک سال کی پٹھیا ہے اور وہ مجھے گوشت کی دو بکریوں سے بھی عزیز ہے، کیا اس سے میری قربانی ہو جائے گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں لیکن تمہارے بعد کسی کی قربانی اس عمر کے بچے سے کافی نہ ہو گی۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا کہ ہم سے محمد بن جعفر نے بیان کیا، انہوں نے کہا کہ مجھے زید بن اسلم نے خبر دی، انہیں عیاض بن عبداللہ بن ابی سرح نے، انہیں ابو سعید خدری رضی اللہ عنہ نے، آپ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم عیدالفطر اور عید الاضحی کے دن ( مدینہ کے باہر ) عیدگاہ تشریف لے جاتے تو سب سے پہلے آپ صلی اللہ علیہ وسلم نماز پڑھاتے، نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم لوگوں کے سامنے کھڑے ہوتے۔ تمام لوگ اپنی صفوں میں بیٹھے رہتے، آپ صلی اللہ علیہ وسلم انہیں وعظ و نصیحت فرماتے، اچھی باتوں کا حکم دیتے۔ اگر جہاد کے لیے کہیں لشکر بھیجنے کا ارادہ ہوتا تو اس کو الگ کرتے۔ کسی اور بات کا حکم دینا ہوتا تو وہ حکم دیتے۔ اس کے بعد شہر کو واپس تشریف لاتے۔ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ لوگ برابر اسی سنت پر قائم رہے لیکن معاویہ کے زمانہ میں مروان جو مدینہ کا حاکم تھا پھر میں اس کے ساتھ عیدالفطر یا عید الاضحی کی نماز کے لیے نکلا ہم جب عیدگاہ پہنچے تو وہاں میں نے کثیر بن صلت کا بنا ہوا ایک منبر دیکھا۔ جاتے ہی مروان نے چاہا کہ اس پر نماز سے پہلے ( خطبہ دینے کے لیے ) چڑھے اس لیے میں نے ان کا دامن پکڑ کر کھینچا اور لیکن وہ جھٹک کر اوپر چڑھ گیا اور نماز سے پہلے خطبہ دیا۔ میں نے اس سے کہا کہ واللہ تم نے ( نبی کریم صلی اللہ علیہ وسلم کی سنت کو ) بدل دیا۔ مروان نے کہا کہ اے ابوسعید! اب وہ زمانہ گزر گیا جس کو تم جانتے ہو۔ ابوسعید نے کہا کہ بخدا میں جس زمانہ کو جانتا ہوں اس زمانہ سے بہتر ہے جو میں نہیں جانتا۔ مروان نے کہا کہ ہمارے دور میں لوگ نماز کے بعد نہیں بیٹھتے، اس لیے میں نے نماز سے پہلے خطبہ کو کر دیا۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"text": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا، انہوں نے عبیداللہ بن عمر سے بیان کیا، ان سے نافع نے، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم عید الاضحی اور عیدالفطر کی نماز پہلے پڑھتے پھر نماز کے بعد خطبہ دیتے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "ہم سے ابوعاصم نے بیان کیا، انہوں نے کہا کہ ہمیں ابن جریج نے خبر دی، انہوں نے کہا مجھے حسن بن مسلم نے خبر دی، انہیں طاؤس نے، انہیں عبداللہ بن عباس رضی اللہ عنہما نے آپ نے فرمایا کہ میں عید کے دن نبی کریم صلی اللہ علیہ وسلم اور ابوبکر اور عمر اور عثمان رضی اللہ عنہم سب کے ساتھ گیا ہوں یہ لوگ پہلے نماز پڑھتے، پھر خطبہ دیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "ہم سے یعقوب بن ابراہیم نے بیان کیا، انہوں نے کہا کہ ہم سے ابواسامہ حماد بن ابواسامہ نے بیان کیا، انہوں نے کہا کہ ہم سے عبیداللہ نے نافع سے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم ، ابوبکر اور عمر رضی اللہ عنہما عیدین کی نماز خطبہ سے پہلے پڑھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے، انہوں نے عدی بن ثابت سے، انہوں نے سعید بن جبیر سے، انہوں نے ابن عباس رضی اللہ عنہما سے کہ نبی کریم صلی اللہ علیہ وسلم نے عیدالفطر کے دن دو رکعتیں پڑھیں نہ ان سے پہلے کوئی نفل پڑھا نہ ان کے بعد۔ پھر ( خطبہ پڑھ کر ) آپ صلی اللہ علیہ وسلم عورتوں کے پاس آئے اور بلال آپ کے ساتھ تھے۔ آپ صلی اللہ علیہ وسلم نے عورتوں سے فرمایا خیرات کرو۔ وہ خیرات دینے لگیں کوئی اپنی بالی پیش کرنے لگی کوئی اپنا ہار دینے لگی۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا کہ ہم سے شعبہ نے بیان کیا، کہا کہ ہم سے زبید نے بیان کیا، کہا کہ میں نے شعبی سے سنا، ان سے براء بن عازب نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہم اس دن پہلے نماز پڑھیں گے پھر خطبہ کے بعد واپس ہو کر قربانی کریں گے۔ جس نے اس طرح کیا اس نے ہماری سنت کے مطابق عمل کیا اور جس نے نماز سے پہلے قربانی کی تو اس کا ذبیحہ گوشت کا جانور ہے جسے وہ گھر والوں کے لیے لایا ہے، قربانی سے اس کا کوئی بھی تعلق نہیں۔ ایک انصاری رضی اللہ عنہ جن کا نام ابوبردہ بن نیار تھا بولے کہ یا رسول اللہ صلی اللہ علیہ وسلم میں نے تو ( نماز سے پہلے ہی ) قربانی کر دی لیکن میرے پاس ایک سال کی پٹھیا ہے جو دوندی ہوئی بکری سے بھی اچھی ہے۔ آپ نے صلی اللہ علیہ وسلم فرمایا کہ اچھا اسی کو بکری کے بدلہ میں قربانی کر لو اور تمہارے بعد یہ کسی اور کے لیے کافی نہ ہو گی۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "ہم سے زکریا بن یحییٰ ابوالسکین نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالرحمٰن محاربی نے بیان کیا، کہا کہ ہم سے محمد بن سوقہ نے سعید بن جبیر سے بیان کیا، انہوں نے کہا کہ میں ( حج کے دن ) ابن عمر رضی اللہ عنہما کے ساتھ تھا جب نیزے کی انی آپ کے تلوے میں چبھ گئی جس کی وجہ سے آپ کا پاؤں رکاب سے چپک گیا۔ تب میں نے اتر کر اسے نکالا۔ یہ واقعہ منیٰ میں پیش آیا تھا۔ جب حجاج کو معلوم ہوا جو اس زمانہ میں ابن زبیر رضی اللہ عنہما کے قتل کے بعد حجاج کا امیر تھا تو وہ بیمار پرسی کے لیے آیا۔ حجاج نے کہا کہ کاش ہمیں معلوم ہو جاتا کہ کس نے آپ کو زخمی کیا ہے۔ اس پر ابن عمر رضی اللہ عنہما نے فرمایا کہ تو نے ہی تو مجھ کو نیزہ مارا ہے۔ حجاج نے پوچھا کہ وہ کیسے؟ آپ نے فرمایا کہ تم اس دن ہتھیار اپنے ساتھ لائے جس دن پہلے کبھی ہتھیار ساتھ نہیں لایا جاتا تھا ( عیدین کے دن ) تم ہتھیار حرم میں لائے حالانکہ حرم میں ہتھیار نہیں لایا جاتا تھا۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "ہم سے احمد بن یعقوب نے بیان کیا، کہا کہ ہم سے اسحاق بن سعید بن عمرو بن سعید بن عاص نے اپنے باپ سے بیان کیا، انہوں نے کہا کہ حجاج عبداللہ بن عمر رضی اللہ عنہما کے پاس آیا میں بھی آپ کی خدمت میں موجود تھا۔ حجاج نے مزاج پوچھا عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ اچھا ہوں۔ اس نے پوچھا کہ آپ کو یہ برچھا کس نے مارا؟ ابن عمر رضی اللہ عنہما نے فرمایا کہ مجھے اس شخص نے مارا جس نے اس دن ہتھیار ساتھ لے جانے کی اجازت دی جس دن ہتھیار ساتھ نہیں لے جایا جاتا تھا۔ آپ کی مراد حجاج ہی سے تھی۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا کہ ہم سے شعبہ نے زبید سے بیان کیا، ان سے شعبی نے، ان سے براء بن عازب رضی اللہ عنہ نے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے قربانی کے دن خطبہ دیا اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس دن سب سے پہلے ہمیں نماز پڑھنی چاہیے پھر ( خطبہ کے بعد ) واپس آ کر قربانی کرنی چاہیے جس نے اس طرح کیا اس نے ہماری سنت کے مطابق کیا اور جس نے نماز سے پہلے ذبح کر دیا تو یہ ایک ایسا گوشت ہو گا جسے اس نے اپنے گھر والوں کے لیے جلدی سے تیار کر لیا ہے، یہ قربانی قطعاً نہیں۔ اس پر میرے ماموں ابوبردہ بن نیار نے کھڑے ہو کر کہا کہ یا رسول اللہ! میں نے تو نماز کے پڑھنے سے پہلے ہی ذبح کر دیا۔ البتہ میرے پاس ایک سال کی ایک پٹھیا ہے جو دانت نکلی بکری سے بھی زیادہ بہتر ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کے بدلہ میں اسے سمجھ لو یا یہ فرمایا کہ اسے ذبح کر لو اور تمہارے بعد یہ ایک سال کی پٹھیا کسی کے لیے کافی نہیں ہو گی۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "ہم سے محمد بن عرعرہ نے بیان کیا، انہوں نے کہا کہ ہم سے شعبہ نے سلیمان کے واسطے سے بیان کیا، ان سے مسلم بطین نے، ان سے سعید بن جبیر نے، ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ان دنوں کے عمل سے زیادہ کسی دن کے عمل میں فضیلت نہیں۔ لوگوں نے پوچھا اور جہاد میں بھی نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جہاد میں بھی نہیں سوا اس شخص کے جو اپنی جان و مال خطرہ میں ڈال کر نکلا اور واپس آیا تو ساتھ کچھ بھی نہ لایا ( سب کچھ اللہ کی راہ میں قربان کر دیا ) ۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے امام مالک بن انس نے بیان کیا، کہا کہ مجھ سے محمد بن ابی بکر ثقفی نے بیان کیا، کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے تلبیہ کے متعلق دریافت کیا کہ آپ لوگ نبی کریم صلی اللہ علیہ وسلم کے عہد میں اسے کس طرح کہتے تھے۔ اس وقت ہم منیٰ سے عرفات کی طرف جا رہے تھے، انہوں نے فرمایا کہ تلبیہ کہنے والے تلبیہ کہتے اور تکبیر کہنے والے تکبیر۔ اس پر کوئی اعتراض نہ کرتا۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "ہم سے محمد نے بیان کیا، کہا کہ ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا کہ مجھ سے میرے باپ نے عاصم بن سلیمان سے بیان کیا، ان سے حفصہ بنت سیرین نے، ان سے ام عطیہ نے، انہوں نے فرمایا کہ ( نبی کریم صلی اللہ علیہ وسلم کے زمانہ ) میں ہمیں عید کے دن عیدگاہ میں جانے کا حکم تھا۔ کنواری لڑکیاں اور حائضہ عورتیں بھی پردہ میں باہر آتی تھیں۔ یہ سب مردوں کے پیچھے پردہ میں رہتیں۔ جب مرد تکبیر کہتے تو یہ بھی کہتیں اور جب وہ دعا کرتے تو یہ بھی کرتیں۔ اس دن کی برکت اور پاکیزگی حاصل کرنے کی امید رکھتیں۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے عبدالوہاب ثقفی نے بیان کیا، کہا کہ ہم سے عبیداللہ عمری نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم کے سامنے عیدالفطر اور عید الاضحی کی نماز کے لیے برچھی آگے آگے اٹھائی جاتی اور وہ عیدگاہ میں آپ صلی اللہ علیہ وسلم کے سامنے گاڑ دی جاتی آپ صلی اللہ علیہ وسلم اسی کی آڑ میں نماز پڑھتے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا، کہا کہ ہم سے ولید بن مسلم نے بیان کیا، کہا کہ ہم سے ابوعمرو اوزاعی نے بیان کیا، کہا کہ ہم سے نافع نے ابن عمر رضی اللہ عنہما سے بیان کیا۔ انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم عیدگاہ جاتے تو برچھا ( ڈنڈا جس کے نیچے لوہے کا پھل لگا ہوا ہو ) آپ صلی اللہ علیہ وسلم کے آگے آگے لے جایا جاتا تھا پھر یہ عیدگاہ میں آپ صلی اللہ علیہ وسلم کے سامنے گاڑ دیا جاتا اور آپ صلی اللہ علیہ وسلم اس کی آڑ میں نماز پڑھتے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے ایوب سختیانی نے، ان سے محمد نے، ان سے ام عطیہ رضی اللہ عنہا نے، آپ نے فرمایا کہ ہمیں حکم تھا کہ پردہ والی دوشیزاؤں کو عیدگاہ کے لیے نکالیں اور ایوب سختیانی نے حفصہ رضی اللہ عنہا سے بھی اسی طرح روایت کی ہے۔ حفصہ رضی اللہ عنہا کی حدیث میں یہ زیادتی ہے کہ دوشیزائیں اور پردہ والیاں ضرور ( عیدگاہ جائیں ) اور حائضہ نماز کی جگہ سے علیحدہ رہیں۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "ہم سے عمرو بن عباس نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان ثوری نے عبدالرحمٰن بن عابس سے بیان کیا، انہوں نے ابن عباس رضی اللہ عنہما سے سنا، انہوں نے فرمایا کہ میں نے عیدالفطر یا عید الاضحی کے دن نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی۔ آپ صلی اللہ علیہ وسلم نے نماز پڑھنے کے بعد خطبہ دیا پھر عورتوں کی طرف آئے اور انہیں نصیحت فرمائی اور صدقہ کے لیے حکم فرمایا۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا کہ ہم سے محمد بن طلحہ نے بیان کیا، ان سے زبید نے، ان سے شعبی نے، ان سے براء بن عازب رضی اللہ عنہ نے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم عید الاضحی کے دن بقیع کی طرف تشریف لے گئے اور دو رکعت عید کی نماز پڑھائی۔ پھر ہماری طرف چہرہ مبارک کر کے فرمایا کہ سب سے مقدم عبادت ہمارے اس دن کی یہ ہے کہ پہلے ہم نماز پڑھیں پھر ( نماز اور خطبے سے ) لوٹ کر قربانی کریں۔ اس لیے جس نے اس طرح کیا اس نے ہماری سنت کے مطابق کیا اور جس نے نماز سے پہلے ذبح کر دیا تو وہ ایسی چیز ہے جسے اس نے اپنے گھر والوں کے کھلانے کے لیے جلدی سے مہیا کر دیا ہے اور اس کا قربانی سے کوئی تعلق نہیں۔ اس پر ایک شخص نے کھڑے ہو کر عرض کیا کہ یا رسول اللہ! میں نے تو پہلے ہی ذبح کر دیا۔ لیکن میرے پاس ایک سال کی پٹھیا ہے اور وہ دوندی بکری سے زیادہ بہتر ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ خیر تم اسی کو ذبح کر لو لیکن تمہارے بعد کسی کی طرف سے ایسی پٹھیا جائز نہ ہو گی۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے یحییٰ بن سعید قطان نے سفیان ثوری سے بیان کیا، کہا کہ مجھ سے عبدالرحمٰن بن عابس نے بیان کیا، کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا، ان سے دریافت کیا گیا تھا کہ کیا آپ نبی کریم صلی اللہ علیہ وسلم کے ساتھ عیدگاہ گئے تھے؟ انہوں نے فرمایا کہ ہاں اور اگر باوجود کم عمری کے میری قدر و منزلت آپ کے یہاں نہ ہوتی تو میں جا نہیں سکتا تھا۔ آپ اس نشان پر آئے جو کثیر بن صلت کے گھر کے قریب ہے۔ آپ نے وہاں نماز پڑھائی پھر خطبہ دیا۔ اس کے بعد عورتوں کی طرف آئے۔ آپ کے ساتھ بلال رضی اللہ عنہ بھی تھے۔ آپ نے انہیں وعظ اور نصیحت کی اور صدقہ کے لیے کہا۔ چنانچہ میں نے دیکھا کہ عورتیں اپنے ہاتھوں سے بلال رضی اللہ عنہ کے کپڑے میں ڈالے جا رہی تھیں۔ پھر نبی کریم صلی اللہ علیہ وسلم اور بلال رضی اللہ عنہ گھر واپس ہوئے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "ہم سے اسحاق بن ابراہیم بن نصر نے بیان کیا، کہا کہ ہم سے عبدالرزاق نے بیان کیا، کہا کہ ہمیں ابن جریج نے خبر دی، کہا کہ مجھے عطاء نے خبر دی کہ جابر بن عبداللہ رضی اللہ عنہما کو میں نے یہ کہتے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے عیدالفطر کی نماز پڑھی۔ پہلے آپ صلی اللہ علیہ وسلم نے نماز پڑھی اس کے بعد خطبہ دیا۔ جب آپ صلی اللہ علیہ وسلم خطبہ سے فارغ ہو گئے تو اترے ( نبی کریم صلی اللہ علیہ وسلم عیدگاہ میں منبر نہیں لے کر جاتے تھے۔ تو اس اترے سے مراد بلند جگہ سے اترے ) اور عورتوں کی طرف آئے۔ پھر انہیں نصیحت فرمائی۔ آپ اس وقت بلال رضی اللہ عنہ کے ہاتھ کا سہارا لیے ہوئے تھے۔ بلال رضی اللہ عنہ نے اپنا کپڑا پھیلا رکھا تھا جس میں عورتیں صدقہ ڈال رہی تھیں۔ میں نے عطاء سے پوچھا کیا یہ صدقہ فطر دے رہی تھیں۔ انہوں نے فرمایا کہ نہیں بلکہ صدقہ کے طور پر دے رہی تھیں۔ اس وقت عورتیں اپنے چھلے ( وغیرہ ) برابر ڈال رہی تھیں۔ پھر میں نے عطاء سے پوچھا کہ کیا آپ اب بھی امام پر اس کا حق سمجھتے ہیں کہ وہ عورتوں کو نصیحت کرے؟ انہوں نے فرمایا ہاں ان پر یہ حق ہے اور کیا وجہ ہے کہ وہ ایسا نہیں کرتے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "ابن جریج نے کہا کہ حسن بن مسلم نے مجھے خبر دی، انہیں طاؤس نے، انہیں عبداللہ بن عباس رضی اللہ عنہما نے، انہوں نے فرمایا کہ میں نبی کریم صلی اللہ علیہ وسلم اور ابوبکر، عمر اور عثمان رضی اللہ عنہم کے ساتھ عیدالفطر کی نماز پڑھنے گیا ہوں۔ یہ سب حضرات خطبہ سے پہلے نماز پڑھتے اور بعد میں خطبہ دیتے تھے۔ نبی کریم صلی اللہ علیہ وسلم اٹھے، میری نظروں کے سامنے وہ منظر ہے، جب آپ صلی اللہ علیہ وسلم لوگوں کو ہاتھ کے اشارے سے بٹھا رہے تھے۔ پھر آپ صلی اللہ علیہ وسلم صفوں سے گزرتے ہوئے عورتوں کی طرف آئے۔ آپ صلی اللہ علیہ وسلم کے ساتھ بلال تھے۔ آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی ”اے نبی! جب تمہارے پاس مومن عورتیں بیعت کے لیے آئیں“ الآیہ۔ پھر جب خطبہ سے فارغ ہوئے تو فرمایا کہ کیا تم ان باتوں پر قائم ہو؟ ایک عورت نے جواب دیا کہ ہاں۔ ان کے علاوہ کوئی عورت نہ بولی، حسن کو معلوم نہیں کہ بولنے والی خاتون کون تھیں۔ آپ صلی اللہ علیہ وسلم نے خیرات کے لیے حکم فرمایا اور بلال رضی اللہ عنہ نے اپنا کپڑا پھیلا دیا اور کہا کہ لاؤ تم پر میرے ماں باپ فدا ہوں۔ چنانچہ عورتیں چھلے اور انگوٹھیاں بلال رضی اللہ عنہ کے کپڑے میں ڈالنے لگیں۔ عبدالرزاق نے کہا «فتخ» بڑے ( چھلے ) کو کہتے ہیں جس کا جاہلیت کے زمانہ میں استعمال تھا۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "ہم سے ابومعمر نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالوارث نے بیان کیا، انہوں نے کہا کہ ہم سے ایوب سختیانی نے حفصہ بن سیرین کے واسطے سے بیان کیا، انہوں نے کہا کہ ہم اپنی لڑکیوں کو عیدگاہ جانے سے منع کرتے تھے۔ پھر ایک خاتون باہر سے آئی اور قصر بنو خلف میں انہوں نے قیام کیا میں ان سے ملنے کے لیے حاضر ہوئی تو انہوں نے بیان کیا کہ ان کی بہن کے شوہر نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ لڑائیوں میں شریک رہے اور خود ان کی بہن اپنے شوہر کے ساتھ چھ لڑائیوں میں شریک ہوئی تھیں، ان کا بیان تھا کہ ہم مریضوں کی خدمت کیا کرتے تھے اور زخمیوں کی مرہم پٹی کرتے تھے۔ انہوں نے پوچھا کہ یا رسول اللہ! کیا ہم میں سے اگر کسی کے پاس چادر نہ ہو اور اس وجہ سے وہ عید کے دن ( عیدگاہ ) نہ جا سکے تو کوئی حرج ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی سہیلی اپنی چادر کا ایک حصہ اسے اڑھا دے اور پھر وہ خیر اور مسلمانوں کی دعا میں شریک ہوں۔ حفصہ رضی اللہ عنہا نے بیان کیا کہ پھر جب ام عطیہ رضی اللہ عنہا یہاں تشریف لائیں تو میں ان کی خدمت میں بھی حاضر ہوئی اور دریافت کیا کہ آپ نے فلاں فلاں بات سنی ہے۔ انہوں نے فرمایا کہ ہاں میرے باپ آپ پر فدا ہوں۔ ام عطیہ رضی اللہ عنہا جب بھی نبی کریم صلی اللہ علیہ وسلم کا ذکر کرتیں تو یہ ضرور کہتیں کہ میرے باپ آپ پر فدا ہوں، ہاں تو انہوں نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جوان پردہ والی یا جوان اور پردہ والی باہر نکلیں۔ شبہ ایوب کو تھا۔ البتہ حائضہ عورتیں عیدگاہ سے علیحدہ ہو کر بیٹھیں انہیں خیر اور مسلمانوں کی دعا میں ضرور شریک ہونا چاہیے۔ حفصہ نے کہا کہ میں نے ام عطیہ رضی اللہ عنہا سے دریافت کیا کہ حائضہ عورتیں بھی؟ انہوں نے فرمایا کیا حائضہ عورتیں عرفات نہیں جاتیں اور کیا وہ فلاں فلاں جگہوں میں شریک نہیں ہوتیں ( پھر اجتماع عید ہی کی شرکت میں کون سی قباحت ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "ہم سے محمد بن مثنی نے بیان کیا، انہوں نے کہا کہ ہم سے محمد بن ابراہیم ابن ابی عدی نے بیان کیا، ان سے عبداللہ بن عون نے بیان کیا، ان سے محمد بن سیرین نے کہ ام عطیہ رضی اللہ عنہا نے فرمایا کہ ہمیں حکم تھا کہ حائضہ عورتوں، دوشیزاؤں اور پردہ والیوں کو عیدگاہ لے جائیں ابن عون نے کہا کہ یا ( حدیث میں ) پردہ والی دوشیزائیں ہے البتہ حائضہ عورتیں مسلمانوں کی جماعت اور دعاؤں میں شریک ہوں اور ( نماز سے ) الگ رہیں۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا کہ ہم سے لیث نے بیان کیا، کہا کہ مجھ سے کثیر بن فرقد نے نافع سے بیان کیا، ان سے ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم عیدگاہ ہی میں نحر اور ذبح کیا کرتے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے ابوالاحوص سلام بن سلیم نے بیان کیا، کہا کہ ہم سے منصور بن معتمر نے بیان کیا کہ ان سے عامر شعبی نے، ان سے براء بن عازب رضی اللہ عنہ نے، انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے بقر عید کے دن نماز کے بعد خطبہ دیا اور فرمایا کہ جس نے ہماری طرح کی نماز پڑھی اور ہماری طرح کی قربانی کی، اس کی قربانی درست ہوئی۔ لیکن جس نے نماز سے پہلے قربانی کی تو وہ ذبیحہ صرف گوشت کھانے کے لیے ہو گا۔ اس پر ابوبردہ بن نیار نے عرض کیا کہ یا رسول اللہ صلی اللہ علیہ وسلم قسم اللہ کی میں نے تو نماز کے لیے آنے سے پہلے قربانی کر لی میں نے یہ سمجھا کہ آج کا دن کھانے پینے کا دن ہے۔ اسی لیے میں نے جلدی کی اور خود بھی کھایا اور گھر والوں کو اور پڑوسیوں کو بھی کھلایا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ بہرحال یہ گوشت ( کھانے کا ) ہوا ( قربانی نہیں ) انہوں نے عرض کیا کہ میرے پاس ایک بکری کا سال بھر کا بچہ ہے وہ دو بکریوں کے گوشت سے زیادہ بہتر ہے۔ کیا میری ( طرف سے اس کی ) قربانی درست ہو گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں مگر تمہارے بعد کسی کی طرف سے ایسے بچے کی قربانی کافی نہ ہو گی۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "ہم سے حامد بن عمر نے بیان کیا، ان سے حماد بن زید نے، ان سے ایوب سختیانی نے، ان سے محمد نے، ان سے انس بن مالک رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے بقر عید کے دن نماز پڑھ کر خطبہ دیا آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس شخص نے نماز سے پہلے جانور ذبح کر لیا اسے دوبارہ قربانی کرنی ہو گی۔ اس پر انصار میں سے ایک صاحب اٹھے کہ یا رسول اللہ! میرے کچھ غریب بھوکے پڑوسی ہیں یا یوں کہا وہ محتاج ہیں۔ اس لیے میں نے نماز سے پہلے ذبح کر دیا البتہ میرے پاس ایک سال کی ایک پٹھیا ہے جو دو بکریوں کے گوشت سے بھی زیادہ مجھے پسند ہے۔ آپ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے اسود بن قیس نے، ان سے جندب نے، انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے بقر عید کے دن نماز پڑھنے کے بعد خطبہ دیا پھر قربانی کی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے نماز سے پہلے ذبح کر لیا ہو تو اسے دوسرا جانور بدلہ میں قربانی کرنا چاہیے اور جس نے نماز سے پہلے ذبح نہ کیا ہو وہ اللہ کے نام پر ذبح کرے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "ہم سے محمد بن سلام نے بیان کیا، انہوں نے کہا کہ ہمیں ابوتمیلہ یحییٰ بن واضح نے خبر دی، انہیں فلیح بن سلیمان نے، انہیں سعید بن حارث نے، انہیں جابر رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم عید کے دن ایک راستہ سے جاتے پھر دوسرا راستہ بدل کر آتے۔ اس روایت کی متابعت یونس بن محمد نے فلیح سے کی، ان سے سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا لیکن جابر کی روایت زیادہ صحیح ہے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "ہم سے ابوولید نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، کہا کہ مجھے عدی بن ثابت نے خبر دی، انہوں نے کہا کہ میں نے سعید بن جبیر سے سنا، وہ ابن عباس رضی اللہ عنہما سے بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم عیدالفطر کے دن نکلے اور ( عیدگاہ ) میں دو رکعت نماز عید پڑھی۔ آپ صلی اللہ علیہ وسلم نے نہ اس سے پہلے نفل نماز پڑھی اور نہ اس کے بعد۔ آپ صلی اللہ علیہ وسلم کے ساتھ بلال رضی اللہ عنہ بھی تھے۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 37
			}
		}
	]
}