{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"15": "Invoking Allah for Rain (Istisqaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان ثوری نے عبداللہ بن ابی بکر سے بیان کیا، ان سے عباد بن تمیم نے اور ان سے ان کے چچا عبداللہ بن زید نے کہ نبی کریم صلی اللہ علیہ وسلم پانی کی دعا کرنے کے لیے تشریف لے گئے اور اپنی چادر الٹائی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا انہوں نے کہا کہ ہم سے مغیرہ بن عبدالرحمٰن نے بیان کیا، ان سے ابوالزناد نے بیان کیا، ان سے اعرج نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم جب سر مبارک آخری رکعت ( کے رکوع ) سے اٹھاتے تو یوں فرماتے «اللهم أنج عياش بن أبي ربيعة،‏‏‏‏ ‏‏‏‏ اللهم أنج سلمة بن هشام،‏‏‏‏ ‏‏‏‏ اللهم أنج الوليد بن الوليد،‏‏‏‏ ‏‏‏‏ اللهم أنج المستضعفين من المؤمنين،‏‏‏‏ ‏‏‏‏ اللهم اشدد وطأتك على مضر،‏‏‏‏ ‏‏‏‏ اللهم اجعلها سنين كسني يوسف» کہ یا اللہ! عیاش بن ابی ربیعہ کو نجات دے۔ یا اللہ! سلمہ بن ہشام کو نجات دے۔ یا اللہ! ولید بن ولید کو نجات دے۔ یا اللہ! بےبس ناتواں مسلمانوں کو نجات دے۔ یا اللہ! مضر کے کافروں کو سخت پکڑ۔ یا اللہ! ان کے سال یوسف علیہ السلام کے سے سال کر دے۔ اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا غفار کی قوم کو اللہ نے بخش دیا اور اسلم کی قوم کو اللہ نے سلامت رکھا۔ ابن ابی الزناد نے اپنے باپ سے صبح کی نماز میں یہی دعا نقل کی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "ہم سے امام حمیدی نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے بیان کیا، ان سے سلیمان اعمش نے، ان سے ابوالضحی نے، ان سے مسروق نے، ان سے عبداللہ بن مسعود نے (دوسری سند) ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے جریر بن عبدالحمید نے منصور بن مسعود بن معتمر سے بیان کیا، اور ان سے ابوالضحی نے، ان سے مسروق نے، انہوں نے بیان کیا کہ ہم عبداللہ بن مسعود رضی اللہ عنہ کی خدمت میں بیٹھے ہوئے تھے۔ آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے جب کفار قریش کی سرکشی دیکھی تو آپ صلی اللہ علیہ وسلم نے بددعا کی «اللهم سبع كسبع يوسف» کہ اے اللہ! سات برس کا قحط ان پر بھیج جیسے یوسف علیہ السلام کے وقت میں بھیجا تھا چنانچہ ایسا قحط پڑا کہ ہر چیز تباہ ہو گئی اور لوگوں نے چمڑے اور مردار تک کھا لیے۔ بھوک کی شدت کا یہ عالم تھا کہ آسمان کی طرف نظر اٹھائی جاتی تو دھویں کی طرح معلوم ہوتا تھا آخر مجبور ہو کر ابوسفیان حاضر خدمت ہوئے اور عرض کیا کہ اے محمد ( صلی اللہ علیہ وسلم ) ! آپ لوگوں کو اللہ کی اطاعت اور صلہ رحمی کا حکم دیتے ہیں۔ اب تو آپ ہی کی قوم برباد ہو رہی ہے، اس لیے آپ اللہ سے ان کے حق میں دعا کیجئے۔ اللہ تعالیٰ نے فرمایا کہ اس دن کا انتظار کر جب آسمان صاف دھواں نظر آئے گا آیت «انکم عائدون» تک ( نیز ) جب ہم سختی سے ان کی گرفت کریں گے ( کفار کی ) سخت گرفت بدر کی لڑائی میں ہوئی۔ دھویں کا بھی معاملہ گزر چکا ( جب سخت قحط پڑا تھا ) جس میں پکڑ اور قید کا ذکر ہے وہ سب ہو چکے اسی طرح سورۃ الروم کی آیت میں جو ذکر ہے وہ بھی ہو چکا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1009,
			"arabicnumber": 1009,
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1010,
			"arabicnumber": 1010,
			"text": "ہم سے حسن بن محمد بن صباح نے بیان کیا، کہا کہ ہم سے محمد بن عبداللہ بن مثنی انصاری نے بیان کیا، کہا کہ مجھ سے میرے باپ عبداللہ بن مثنی نے بیان کیا، ان سے ثمامہ بن عبداللہ بن انس رضی اللہ عنہ نے، ان سے انس بن مالک رضی اللہ عنہ نے کہ جب کبھی عمر رضی اللہ عنہ کے زمانہ میں قحط پڑتا تو عمر رضی اللہ عنہ عباس بن عبدالمطلب رضی اللہ عنہ کے وسیلہ سے دعا کرتے اور فرماتے کہ اے اللہ! پہلے ہم تیرے پاس اپنے نبی کریم صلی اللہ علیہ وسلم کا وسیلہ لایا کرتے تھے۔ تو، تو پانی برساتا تھا۔ اب ہم اپنے نبی کریم صلی اللہ علیہ وسلم کے چچا کو وسیلہ بناتے ہیں تو، تو ہم پر پانی برسا۔ انس رضی اللہ عنہ نے کہا کہ چنانچہ بارش خوب ہی برسی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1011,
			"arabicnumber": 1011,
			"text": "ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا کہ ہم سے وہب بن جریر نے بیان کیا، انہوں نے کہا ہمیں شعبہ نے خبر دی، انہیں محمد بن ابی بکر نے، انہیں عباد بن تمیم نے، انہیں عبداللہ بن زید رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے دعا استسقاء کی تو اپنی چادر کو بھی الٹا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1012,
			"arabicnumber": 1012,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے عبداللہ بن ابی بکر سے بیان کیا، انہوں نے عباد بن تمیم سے سنا، وہ اپنے باپ سے بیان کرتے تھے کہ ان سے ان کے چچا عبداللہ بن زید رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم عیدگاہ گئے۔ آپ صلی اللہ علیہ وسلم نے وہاں دعائے استسقاء قبلہ رو ہو کر کی اور آپ صلی اللہ علیہ وسلم نے چادر بھی پلٹی اور دو رکعت نماز پڑھی۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) کہتے ہیں کہ ابن عیینہ کہتے تھے کہ ( حدیث کے راوی عبداللہ بن زید ) وہی ہیں جنہوں نے اذان خواب میں دیکھی تھی لیکن یہ ان کی غلطی ہے کیونکہ یہ عبداللہ ابن زید بن عاصم مازنی ہے جو انصار کے قبیلہ مازن سے تھے۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "ہم سے محمد بن مرحوم بیکندی نے بیان کیا، انہوں نے کہا کہ ہم سے ابوضمرہ انس بن عیاض نے بیان کیا، انہوں نے کہا کہ ہم سے شریک بن عبداللہ بن ابی نمر نے بیان کیا کہ انہوں نے انس بن مالک رضی اللہ عنہ سے سنا آپ نے ایک شخص ( کعب بن مرہ یا ابوسفیان ) کا ذکر کیا جو منبر کے سامنے والے دروازے سے جمعہ کے دن مسجد نبوی میں آیا۔ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے خطبہ دے رہے تھے، اس نے بھی کھڑے کھڑے رسول اللہ صلی اللہ علیہ وسلم سے کہا یا رسول اللہ! ( بارش نہ ہونے سے ) جانور مر گئے اور راستے بند ہو گئے آپ اللہ تعالیٰ سے بارش کی دعا فرمائیے انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ کہتے ہی ہاتھ اٹھا دیئے آپ صلی اللہ علیہ وسلم نے دعا کی «اللهم اسقنا،‏‏‏‏ ‏‏‏‏اللهم اسقنا،‏‏‏‏ اللهم اسقنا» کہ اے اللہ! ہمیں سیراب کر۔ اے اللہ! ہمیں سیراب کر۔ اے اللہ! ہمیں سیراب کر۔ انس رضی اللہ عنہ نے کہا بخدا کہیں دور دور تک آسمان پر بادل کا کوئی ٹکڑا نظر نہیں آتا تھا اور نہ کوئی اور چیز ( ہوا وغیرہ جس سے معلوم ہو کہ بارش آئے گی ) اور ہمارے اور سلع پہاڑ کے درمیان کوئی مکان بھی نہ تھا ( کہ ہم بادل ہونے کے باوجود نہ دیکھ سکتے ہوں ) پہاڑ کے پیچھے سے ڈھال کے برابر بادل نمودار ہوا اور بیچ آسمان تک پہنچ کر چاروں طرف پھیل گیا اور بارش شروع ہو گئی، اللہ کی قسم! ہم نے سورج ایک ہفتہ تک نہیں دیکھا۔ پھر ایک شخص دوسرے جمعہ کو اسی دروازے سے آیا۔ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے خطبہ دے رہے تھے، اس شخص نے پھر آپ صلی اللہ علیہ وسلم کو کھڑے کھڑے ہی مخاطب کیا کہ یا رسول اللہ! ( بارش کی کثرت سے ) مال و منال پر تباہی آ گئی اور راستے بند ہو گئے۔ اللہ تعالیٰ سے دعا کیجئے کہ بارش روک دے۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہاتھ اٹھائے اور دعا کی «اللهم حوالينا ولا علينا،‏‏‏‏ ‏‏‏‏ اللهم على الآكام والجبال والآجام والظراب والأودية ومنابت الشجر» کہ یا اللہ اب ہمارے اردگرد بارش برسا ہم سے اسے روک دے۔ ٹیلوں، پہاڑوں، پہاڑیوں، وادیوں اور باغوں کو سیراب کر۔ انہوں نے کہا کہ اس دعا سے بارش ختم ہو گئی اور ہم نکلے تو دھوپ نکل چکی تھی۔ شریک نے کہا کہ میں نے انس رضی اللہ عنہ سے پوچھا کہ یہ وہی پہلا شخص تھا تو انہوں نے فرمایا کہ مجھے معلوم نہیں۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا، ان سے شریک نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے کہ ایک شخص جمعہ کے دن مسجد میں داخل ہوا۔ اب جہاں دار القضاء ہے اسی طرف کے دروازے سے وہ آیا تھا۔ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے خطبہ دے رہے تھے، اس نے بھی کھڑے کھڑے رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کیا کہا کہ یا رسول اللہ! جانور مر گئے اور راستے بند ہو گئے۔ اللہ تعالیٰ سے دعا کیجئے کہ ہم پر پانی برسائے۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے دونوں ہاتھ اٹھا کر دعا فرمائی «اللهم أغثنا،‏‏‏‏ ‏‏‏‏ اللهم أغثنا،‏‏‏‏ ‏‏‏‏ اللهم أغثنا» اے اللہ! ہم پر پانی برسا۔ اے اللہ! ہمیں سیراب کر۔ انس رضی اللہ عنہ نے کہا اللہ کی قسم! آسمان پر بادل کا کہیں نشان بھی نہ تھا اور ہمارے اور سلع پہاڑ کے بیچ میں مکانات بھی نہیں تھے، اتنے میں پہاڑ کے پیچھے سے بادل نمودار ہوا ڈھال کی طرح اور آسمان کے بیچ میں پہنچ کر چاروں طرف پھیل گیا اور برسنے لگا۔ اللہ کی قسم! ہم نے ایک ہفتہ تک سورج نہیں دیکھا۔ پھر دوسرے جمعہ کو ایک شخص اسی دروازے سے داخل ہوا۔ رسول اللہ صلی اللہ علیہ وسلم کھڑے خطبہ دے رہے تھے، اس لیے اس نے کھڑے کھڑے کہا کہ یا رسول اللہ! ( کثرت بارش سے ) جانور تباہ ہو گئے اور راستے بند ہو گئے۔ اللہ تعالیٰ سے دعا کیجئے کہ بارش بند ہو جائے۔ رسول اللہ صلی اللہ علیہ وسلم نے دونوں ہاتھ اٹھا کر دعا کی «اللهم حوالينا ولا علينا،‏‏‏‏ ‏‏‏‏ اللهم على الآكام والظراب وبطون الأودية ومنابت الشجر» اے اللہ! ہمارے اطراف میں بارش برسا ( جہاں ضرورت ہے ) ہم پر نہ برسا۔ اے اللہ! ٹیلوں پہاڑیوں وادیوں اور باغوں کو سیراب کر۔ چنانچہ بارش کا سلسلہ بند ہو گیا اور ہم باہر آئے تو دھوپ نکل چکی تھی۔ شریک نے بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے دریافت کیا کہ کیا یہ پہلا ہی شخص تھا؟ انہوں نے جواب دیا مجھے معلوم نہیں۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1015,
			"arabicnumber": 1015,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، انہوں نے کہا کہ ہم سے ابوعوانہ نے بیان کیا، ان سے قتادہ نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دن خطبہ دے رہے تھے کہ ایک شخص آیا اور عرض کیا کہ یا رسول اللہ! پانی کا قحط پڑ گیا ہے، اللہ سے دعا کیجئے کہ ہمیں سیراب کر دے۔ آپ صلی اللہ علیہ وسلم نے دعا کی اور بارش اس طرح شروع ہوئی کہ گھروں تک پہنچنا مشکل ہو گیا، دوسرے جمعہ تک برابر بارش ہوتی رہی۔ انس رضی اللہ عنہ نے کہا کہ پھر ( دوسرے جمعہ میں ) وہی شخص یا کوئی اور کھڑا ہوا اور عرض کیا کہ یا رسول اللہ! دعا کیجئے کہ اللہ تعالیٰ بارش کا رخ کسی اور طرف موڑ دے۔ رسول اللہ صلی اللہ علیہ وسلم نے دعا فرمائی کہ «اللهم حوالينا ولا علينا» اے اللہ ہمارے اردگرد بارش برسا ہم پر نہ برسا۔ انس رضی اللہ عنہ نے کہا کہ میں نے دیکھا کہ بادل ٹکڑے ٹکڑے ہو کر دائیں بائیں طرف چلے گئے پھر وہاں بارش شروع ہو گئی اور مدینہ میں اس کا سلسلہ بند ہوا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے شریک بن عبداللہ بن ابی نمر نے، ان کو انس رضی اللہ عنہ نے بتلایا کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا کہ جانور ہلاک ہو گئے اور راستے بند ہو گئے۔ آپ صلی اللہ علیہ وسلم نے دعا کی اور ایک ہفتہ تک بارش ہوتی رہی پھر ایک شخص آیا اور عرض کیا کہ ( بارش کی کثرت سے ) گھر گر گئے راستے بند ہو گئے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے پھر کھڑے ہو کر دعا کی «اللهم على الآكام والظراب والأودية ومنابت الشجر» کہ اے اللہ! بارش ٹیلوں، پہاڑوں، وادیوں اور باغوں میں برسا ( دعا کے نتیجہ میں ) بادل مدینہ سے اس طرح پھٹ گئے جیسے کپڑا پھٹ کر ٹکڑے ٹکڑے ہو جاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1017,
			"arabicnumber": 1017,
			"text": "ہم سے اسماعیل بن ابی ایوب نے بیان کیا، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا، انہوں نے شریک بن عبداللہ بن ابی نمر کے واسطے سے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے کہا کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ عرض کی یا رسول اللہ صلی اللہ علیہ وسلم ! مویشی ہلاک ہو گئے اور راستے بند ہو گئے۔ آپ اللہ تعالیٰ سے دعا کیجئے۔ رسول اللہ صلی اللہ علیہ وسلم نے دعا فرمائی تو ایک جمعہ سے دوسرے جمعہ تک بارش ہوتی رہی پھر دوسرے جمعہ کو ایک شخص حاضر خدمت ہوا اور کہا کہ یا رسول اللہ صلی اللہ علیہ وسلم ! ( کثرت باراں سے بہت سے ) مکانات گر گئے، راستے بند ہو گئے اور مویشی ہلاک ہو گئے۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے دعا فرمائی «اللهم على رءوس الجبال والآكام وبطون الأودية ومنابت الشجر» کہ اے اللہ! پہاڑوں ٹیلوں وادیوں اور باغات کی طرف بارش کا رخ کر دے۔ ( جہاں بارش کی کمی ہے ) چنانچہ آپ صلی اللہ علیہ وسلم کی دعا سے بادل کپڑے کی طرح پھٹ گیا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1018,
			"arabicnumber": 1018,
			"text": "ہم سے حسن بن بشر نے بیان کیا، انہوں نے کہا کہ ہم سے معافی بن عمران نے بیان کیا کہ ان سے امام اوزاعی نے، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے ( قحط سے ) مال کی بربادی اور اہل و عیال کی بھوک کی شکایت کی۔ چنانچہ آپ صلی اللہ علیہ وسلم نے دعائے استسقاء کی۔ راوی نے اس موقع پر نہ چادر پلٹنے کا ذکر کیا اور نہ قبلہ کی طرف منہ کرنے کا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1019,
			"arabicnumber": 1019,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے شریک بن عبداللہ بن ابی نمر کے واسطے سے خبر دی اور انہیں انس بن مالک رضی اللہ عنہ نے کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ عرض کیا یا رسول اللہ! ( قحط سے ) جانور ہلاک ہو گئے اور راستے بند، اللہ سے دعا کیجئے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے دعا کی اور ایک جمعہ سے اگلے جمعہ تک ایک ہفتہ بارش ہوتی رہی۔ پھر ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر عرض کیا کہ یا رسول اللہ! ( بارش کی کثرت سے ) راستے بند ہو گئے اور مویشی ہلاک ہو گئے۔ اب رسول اللہ صلی اللہ علیہ وسلم نے یہ دعا کی «اللهم على ظهور الجبال والآكام وبطون الأودية ومنابت الشجر» کہ اے اللہ! بارش کا رخ پہاڑوں، ٹیلوں، وادیوں اور باغات کی طرف موڑ دے، چنانچہ بادل مدینہ سے اس طرح چھٹ گیا جیسے کپڑا پھٹ جایا کرتا ہے۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1020,
			"arabicnumber": 1020,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، ان سے سفیان ثوری نے، انہوں نے بیان کیا کہ ہم سے منصور اور اعمش نے بیان کیا، ان سے ابوالضحی نے، ان سے مسروق نے، آپ نے کہا کہ میں ابن مسعود رضی اللہ عنہ کی خدمت میں حاضر تھا۔ آپ نے فرمایا کہ قریش کا اسلام سے اعراض بڑھتا گیا تو نبی کریم صلی اللہ علیہ وسلم نے ان کے حق میں بددعا کی۔ اس بددعا کے نتیجے میں ایسا قحط پڑا کہ کفار مرنے لگے اور مردار اور ہڈیاں کھانے لگے۔ آخر ابوسفیان آپ کی خدمت میں حاضر ہوا اور عرض کیا اے محمد! ( صلی اللہ علیہ وسلم ) آپ صلہ رحمی کا حکم دیتے ہیں لیکن آپ کی قوم مر رہی ہے۔ اللہ عزوجل سے دعا کیجئے۔ آپ نے اس آیت کی تلاوت کی ( ترجمہ ) اس دن کا انتظار کر جب آسمان پر صاف کھلا ہوا دھواں نمودار ہو گا الآیہ ( خیر آپ نے دعا کی بارش ہوئی قحط جاتا رہا ) لیکن وہ پھر کفر کرنے لگے اس پر اللہ پاک کا یہ فرمان نازل ہوا ( ترجمہ ) جس دن ہم انہیں سختی کے ساتھ پکڑ کریں گے اور یہ پکڑ بدر کی لڑائی میں ہوئی اور اسباط بن محمد نے منصور سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے دعائے استسقاء کی ( مدینہ میں ) جس کے نتیجہ میں خوب بارش ہوئی کہ سات دن تک وہ برابر جاری رہی۔ آخر لوگوں نے بارش کی زیادتی کی شکایت کی تو رسول اللہ صلی اللہ علیہ وسلم نے دعا کی «اللهم حوالينا ولا علينا» کہ اے اللہ! ہمارے اطراف و جوانب میں بارش برسا، مدینہ میں بارش کا سلسلہ ختم کر۔ چنانچہ بادل آسمان سے چھٹ گیا اور مدینہ کے اردگرد خوب بارش ہوئی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1021,
			"arabicnumber": 1021,
			"text": "مجھ سے محمد بن ابی بکر نے بیان کیا، کہا کہ ہم سے معتمر بن سلیمان نے عبیداللہ عمری سے بیان کیا، ان سے ثابت نے، ان سے انس بن مالک رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دن خطبہ دے رہے تھے کہ اتنے میں لوگوں نے کھڑے ہو کر غل مچایا، کہنے لگے کہ یا رسول اللہ! بارش کے نام بوند بھی نہیں درخت سرخ ہو چکے ( یعنی تمام پتے خشک ہو گئے ) اور جانور تباہ ہو رہے ہیں، آپ اللہ تعالیٰ سے دعا کیجئے کہ ہمیں سیراب کرے۔ آپ صلی اللہ علیہ وسلم نے دعا کی «اللهم اسقنا» اے اللہ! ہمیں سیراب کر۔ دو مرتبہ آپ صلی اللہ علیہ وسلم نے اس طرح کہا، قسم اللہ کی اس وقت آسمان پر بادل کہیں دور دور نظر نہیں آتا تھا لیکن دعا کے بعد اچانک ایک بادل آیا اور بارش شروع ہو گئی۔ آپ صلی اللہ علیہ وسلم منبر سے اتر ے اور نماز پڑھائی۔ جب آپ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو بارش ہو رہی تھی اور دوسرے جمعہ تک بارش برابر ہوتی رہی پھر جب نبی کریم صلی اللہ علیہ وسلم دوسرے جمعہ میں خطبہ کے لیے کھڑے ہوئے تو لوگوں نے بتایا کہ مکانات منہدم ہو گئے اور راستے بند ہو گئے، اللہ سے دعا کیجئے کہ بارش بند کر دے۔ اس پر نبی کریم صلی اللہ علیہ وسلم مسکرائے اور دعا کی «االلهم حوالينا ولا علينا» اے اللہ! ہمارے اطراف میں اب بارش برسا، مدینہ میں اس کا سلسلہ بند کر۔ آپ صلی اللہ علیہ وسلم کی دعا سے مدینہ سے بادل چھٹ گئے اور بارش ہمارے ارد گرد ہونے لگی۔ اس شان سے کہ اب مدینہ میں ایک بوند بھی نہ پڑتی تھی میں نے مدینہ کو دیکھا ابر تاج کی طرح گردا گرد تھا اور مدینہ اس کے بیچ میں۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1022,
			"arabicnumber": 1022,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، ان سے زہیر نے، ان سے ابواسحاق نے کہ عبداللہ بن یزید انصاری رضی اللہ عنہ استسقاء کے لیے باہر نکلے۔ ان کے ساتھ براء بن عازب اور زید بن ارقم رضی اللہ عنہما بھی تھے۔ انہوں نے پانی کے لیے دعا کی تو پاؤں پر کھڑے رہے، منبر نہ تھا۔ اسی طرح آپ نے دعا کی پھر دو رکعت نماز پڑھی جس میں قرآت بلند آواز سے کی، نہ اذان کہی اور نہ اقامت ابواسحاق نے کہا عبداللہ بن یزید نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1023,
			"arabicnumber": 1023,
			"text": "ہم سے ابوالیمان حکیم بن نافع نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے خبر دی، انہیں زہری نے، انہوں نے کہا کہ مجھ سے عباد بن تمیم نے بیان کیا کہ ان کے چچا عبداللہ بن زید نے جو صحابی تھے، انہیں خبر دی کہ نبی کریم صلی اللہ علیہ وسلم لوگوں کو ساتھ لے کر استسقاء کے لیے نکلے اور آپ کھڑے ہوئے اور کھڑے ہی کھڑے اللہ تعالیٰ سے دعا کی، پھر قبلہ کی طرف منہ کر کے اپنی چادر پلٹی چنانچہ بارش خوب ہوئی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا کہ ہم سے ابن ابی ذئب نے زہری سے بیان کیا، ان سے عباد بن تمیم نے اور ان سے ان کے چچا (عبداللہ بن زید) نے کہ نبی کریم صلی اللہ علیہ وسلم استسقاء کے لیے باہر نکلے تو قبلہ رو ہو کر دعا کی۔ پھر اپنی چادر پلٹی اور دو رکعت نماز پڑھی۔ نماز میں آپ صلی اللہ علیہ وسلم نے قرآت بلند آواز سے کی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1025,
			"arabicnumber": 1025,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے زہری سے بیان کیا، ان سے عباد بن تمیم نے، ان سے ان کے چچا عبداللہ بن زید نے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو جب آپ صلی اللہ علیہ وسلم استسقاء کے لیے باہر نکلے، دیکھا تھا۔ انہوں نے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے اپنی پیٹھ صحابہ کی طرف کر دی اور قبلہ رخ ہو کر دعا کی۔ پھر چادر پلٹی اور دو رکعت نماز پڑھائی جس کی قرآت قرآن میں آپ صلی اللہ علیہ وسلم نے جہر کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1026,
			"arabicnumber": 1026,
			"text": "مجھ سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے عبداللہ بن ابی بکر سے بیان کیا، ان سے عباد بن تمیم نے، ان سے ان کے چچا عبداللہ بن زید رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے دعائے استسقاء کی تو دو رکعت نماز پڑھی اور چادر پلٹی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے عبداللہ بن ابی بکر سے بیان کیا، انہوں نے عباد بن تمیم سے سنا اور عباد اپنے چچا عبداللہ بن زید رضی اللہ عنہ سے بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم دعائے استسقاء کے لیے عیدگاہ کو نکلے اور قبلہ رخ ہو کر دو رکعت نماز پڑھی پھر چادر پلٹی۔ سفیان ثوری نے کہا مجھے عبدالرحمٰن بن عبداللہ مسعودی نے ابوبکر کے حوالے سے خبر دی کہ آپ صلی اللہ علیہ وسلم نے چادر کا داہنا کونا بائیں کندھے پر ڈالا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1028,
			"arabicnumber": 1028,
			"text": "ہم سے محمد بن سلام بیکندی نے بیان کیا، کہا کہ ہمیں عبدالوہاب ثقفی نے خبر دی، انہوں نے کہا کہ ہمیں یحییٰ بن سعید انصاری نے حدیث بیان کی، کہا کہ مجھے ابوبکر بن محمد بن عمرو بن حزم نے خبر دی کہ عباد بن تمیم نے انہیں خبر دی اور انہیں عبداللہ بن زید انصاری نے بتایا کہ نبی کریم صلی اللہ علیہ وسلم ( استسقاء کے لیے ) عیدگاہ کی طرف نکلے وہاں نماز پڑھنے کو جب آپ صلی اللہ علیہ وسلم دعا کرنے لگے یا راوی نے یہ کہا دعا کا ارادہ کیا تو قبلہ رو ہو کر چادر مبارک پلٹی۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) کہتے ہیں کہ اس حدیث کے راوی عبداللہ بن زید مازنی ہیں اور اس سے پہلے باب «الدعا فی الاستسقاء» میں جن کا ذکر گزرا اور وہ عبداللہ بن یزید ہیں کوفہ کے رہنے والے۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1029,
			"arabicnumber": 1029,
			"text": "ایوب بن سلیمان نے کہا کہ مجھ سے ابوبکر بن ابی اویس نے بیان کیا، انہوں نے سلیمان بن بلال سے بیان کیا کہ یحییٰ بن سعید نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا انہوں نے کہا کہ ایک بدوی ( گاؤں کا رہنے والا ) جمعہ کے دن رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور عرض کیا یا رسول اللہ! بھوک سے مویشی تباہ ہو گئے، اہل و عیال اور تمام لوگ مر رہے ہیں۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے ہاتھ اٹھائے، اور لوگوں نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ اپنے ہاتھ اٹھائے، دعا کرنے لگے، انس رضی اللہ عنہ نے بیان کیا کہ ابھی ہم مسجد سے باہر نکلے بھی نہ تھے کہ بارش شروع ہو گئی اور ایک ہفتہ برابر بارش ہوتی رہی۔ دوسرے جمعہ میں پھر وہی شخص آیا اور عرض کی کہ یا رسول اللہ! ( بارش بہت ہونے سے ) مسافر گھبرا گئے اور راستے بند ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1030,
			"arabicnumber": 1030,
			"text": "عبدالعزیز اویسی نے کہا کہ مجھ سے محمد بن جعفر نے بیان کیا ان سے یحییٰ بن سعید اور شریک نے، انہوں نے کہا کہ ہم نے انس رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم ( نے استسقاء میں دعا کرنے کے لیے ) اس طرح ہاتھ اٹھائے کہ میں نے آپ صلی اللہ علیہ وسلم کی بغلوں کی سفیدی دیکھ لی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1031,
			"arabicnumber": 1031,
			"text": "ہم سے محمد بن بشار نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن سعید قطان اور محمد بن ابراہیم بن عدی بن عروبہ نے بیان کیا، ان سے سعید نے، ان سے قتادہ اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم دعائے استسقاء کے سوا اور کسی دعا کے لیے ہاتھ ( زیادہ ) نہیں اٹھاتے تھے اور استسقاء میں ہاتھ اتنا اٹھاتے کہ بغلوں کی سفیدی نظر آ جاتی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1032,
			"arabicnumber": 1032,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، کہا کہ ہمیں عبیداللہ عمری نے نافع سے خبر دی، انہیں قاسم بن محمد نے، انہیں عائشہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم جب بارش ہوتی دیکھتے تو یہ دعا کرتے «صيبا نافعا» اے اللہ! نفع بخشنے والی بارش برسا۔ اس روایت کی متابعت قاسم بن یحییٰ نے عبیداللہ عمری سے کی ہے اور اس کی روایت اوزاعی اور عقیل نے نافع سے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1033,
			"arabicnumber": 1033,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہمیں امام اوزاعی نے خبر دی، کہا کہ ہم سے اسحاق بن عبداللہ بن ابی طلحہ انصاری نے بیان کیا، انہوں نے کہا مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں لوگوں پر ایک دفعہ قحط پڑا۔ انہی دنوں آپ صلی اللہ علیہ وسلم جمعہ کے دن منبر پر خطبہ دے رہے تھے کہ ایک دیہاتی نے کھڑے ہو کر کہا یا رسول اللہ! جانور مر گئے اور بال بچے فاقے پر فاقے کرر ہے ہیں، اللہ تعالیٰ سے دعا کیجئے کہ پانی برسائے۔ انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ سن کر دعا کے لیے دونوں ہاتھ اٹھا دیئے۔ آسمان پر دور دور تک ابر کا پتہ تک نہیں تھا۔ لیکن ( آپ صلی اللہ علیہ وسلم کی دعا سے ) پہاڑوں کے برابر بادل گرجتے ہوئے آ گئے ابھی نبی کریم صلی اللہ علیہ وسلم منبر سے اترے بھی نہیں تھے کہ میں نے دیکھا کہ بارش کا پانی آپ صلی اللہ علیہ وسلم کی داڑھی سے بہہ رہا ہے۔ انس نے کہا کہ اس روز بارش دن بھر ہوتی رہی۔ دوسرے دن تیسرے دن، بھی اور برابر اسی طرح ہوتی رہی۔ اس طرح دوسرا جمعہ آ گیا۔ پھر یہی بدوی یا کوئی دوسرا شخص کھڑا ہوا اور کہا کہ یا رسول اللہ صلی اللہ علیہ وسلم ! ( کثرت باراں سے ) عمارتیں گر گئیں اور جانور ڈوب گئے، ہمارے لیے اللہ تعالیٰ سے دعا کیجئے۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے پھر دونوں ہاتھ اٹھائے اور دعا کی «اللهم حوالينا ولا علينا» کہ اے اللہ! ہمارے اطراف میں برسا اور ہم پر نہ برسا۔ انس نے کہا کہ نبی کریم صلی اللہ علیہ وسلم اپنے ہاتھوں سے آسمان کی جس طرف بھی اشارہ کر دیتے ابر ادھر سے پھٹ جاتا، اب مدینہ حوض کی طرح بن چکا تھا اور اسی کے بعد وادی قناۃ کا نالہ ایک مہینہ تک بہتا رہا۔ انس نے بیان کیا کہ اس کے بعد مدینہ کے اردگرد سے جو بھی آیا اس نے خوب سیرابی کی خبر لائی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1034,
			"arabicnumber": 1034,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا کہ ہمیں محمد بن جعفر نے خبر دی، انہوں نے کہا مجھے حمید طویل نے خبر دی اور انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ جب تیز ہوا چلتی تو نبی کریم صلی اللہ علیہ وسلم کے چہرہ مبارک پر ڈر محسوس ہوتا تھا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1035,
			"arabicnumber": 1035,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا کہ ہم سے شعبہ نے حکم سے بیان کیا، ان سے مجاہد نے، ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے پروا ہوا کے ذریعہ مدد پہنچائی گئی اور قوم عاد پچھوا کے ذریعہ ہلاک کر دی گئی تھی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1036,
			"arabicnumber": 1036,
			"text": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا، کہا کہ ہمیں شعیب نے خبر دی، کہا کہ ہم سے ابوالزناد (عبداللہ بن ذکوان) نے بیان کیا، ان سے عبدالرحمٰن بن ہرمز اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ قیامت اس وقت تک نہ آئے گی جب تک علم دین نہ اٹھ جائے گا اور زلزلوں کی کثرت نہ ہو جائے گی اور زمانہ جلدی جلدی نہ گزرے گا اور فتنے فساد پھوٹ پڑیں گے اور «هرج» کی کثرت ہو جائے گی اور «هرج» سے مراد قتل ہے۔ قتل اور تمہارے درمیان دولت و مال کی اتنی کثرت ہو گی کہ وہ ابل پڑے گا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1037,
			"arabicnumber": 1037,
			"text": "مجھ سے محمد بن مثنی نے بیان کیا، انہوں نے کہا کہ ہم سے حسین بن حسن نے بیان کیا، انہوں نے کہا کہ ہم سے عبداللہ بن عون نے بیان کیا، ان سے نافع نے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے فرمایا اے اللہ! ہمارے شام اور یمن پر برکت نازل فرما۔ اس پر لوگوں نے کہا اور ہمارے نجد کے لیے بھی برکت کی دعا کیجئے لیکن آپ نے پھر وہی کہا ”اے اللہ! ہمارے شام اور یمن پر برکت نازک فرما“ پھر لوگوں نے کہا اور ہمارے نجد میں؟ تو آپ نے فرمایا کہ وہاں تو زلزلے اور فتنے ہوں گے اور شیطان کا سینگ وہی سے طلوع ہو گا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1038,
			"arabicnumber": 1038,
			"text": "ہم سے اسماعیل بن ایوب نے بیان کیا، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا، انہوں نے صالح بن کیسان سے بیان کیا، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے بیان کیا، ان سے زید بن خالد جہنی رضی اللہ عنہ نے بیان کیاکہ نبی کریم صلی اللہ علیہ وسلم نے حدیبیہ میں ہم کو صبح کی نماز پڑھائی۔ رات کو بارش ہو چکی تھی نماز کے بعد آپ صلی اللہ علیہ وسلم لوگوں کی طرف متوجہ ہوئے اور فرمایا معلوم ہے تمہارے رب نے کیا فیصلہ کیا ہے؟ لوگ بولے کہ اللہ تعالیٰ اور اس کے رسول خوب جانتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پروردگار فرماتا ہے آج میرے دو طرح کے بندوں نے صبح کی۔ ایک مومن ہے ایک کافر۔ جس نے کہا اللہ کے فضل و رحم سے پانی پڑا وہ تو مجھ پر ایمان لایا اور ستاروں کا منکر ہوا اور جس نے کہا فلاں تارے کے فلاں جگہ آنے سے پانی پڑا اس نے میرا کفر کیا، تاروں پر ایمان لایا۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1039,
			"arabicnumber": 1039,
			"text": "ہم سے محمد بن یوسف فریابی نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان ثوری نے بیان کیا، انہوں نے کہا کہ ہم سے عبداللہ بن دینار نے بیان کیا، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ غیب کی پانچ کنجیاں ہیں جنہیں اللہ تعالیٰ کے سوا اور کوئی نہیں جانتا۔ کسی کو نہیں معلوم کہ کل کیا ہونے والا ہے، کوئی نہیں جانتا کہ ماں کے پیٹ میں کیا ہے، کل کیا کرنا ہو گا، اس کا کسی کو علم نہیں۔ نہ کوئی یہ جانتا ہے کہ اسے موت کس جگہ آئے گی اور نہ کسی کو یہ معلوم کہ بارش کب ہو گی۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 34
			}
		}
	]
}