{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1040,
			"arabicnumber": 1040,
			"text": "ہم سے عمرو بن عون نے بیان کیا، انہوں نے کہا کہ ہم سے خالد بن عبداللہ نے یونس سے بیان کیا، ان سے امام حسن بصری نے بیان کیا، ان سے ابوبکرہ نفیع بن حارث رضی اللہ عنہ نے کہ ہم سے عمرو بن عون نے بیان کیا، انہوں نے کہا کہ ہم سے خالد بن عبداللہ نے یونس سے بیان کیا، ان سے امام حسن بصری نے بیان کیا، ان سے ابوبکرہ نفیع بن حارث رضی اللہ عنہ نے کہ",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "ہم سے شہاب بن عباد نے بیان کیا، انہوں نے کہا کہ ہمیں ابراہیم بن حمید نے خبر دی، انہیں اسماعیل بن ابی خالد نے، انہیں قیس بن ابی حازم نے اور انہوں نے کہا کہ میں نے ابومسعود انصاری رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند میں گرہن کسی شخص کی موت سے نہیں لگتا۔ یہ دونوں تو اللہ تعالیٰ کی قدرت کی نشانیاں ہیں۔ اس لیے اسے دیکھتے ہی کھڑے ہو جاؤ اور نماز پڑھو۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1042,
			"arabicnumber": 1042,
			"text": "ہم سے اصبغ بن فرح نے بیان کیا، انہوں نے کہا کہ مجھے عبداللہ بن وہب نے خبر دی، انہوں نے کہا کہ مجھے عمرو بن حارث نے عبدالرحمٰن بن قاسم سے خبر دی، انہیں ان کے باپ قاسم بن محمد نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے خبر دی کہ صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند میں گرہن کسی کی موت و زندگی سے نہیں لگتا بلکہ یہ اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، اس لیے جب تم یہ دیکھو تو نماز پڑھو۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1043,
			"arabicnumber": 1043,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا کہ ہم سے ہاشم بن قاسم نے بیان کیا، انہوں نے کہا کہ ہم سے شیبان ابومعاویہ نے بیان کیا، ان سے زیاد بن علاقہ نے بیان کیا، ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن اس دن لگا جس دن ( آپ صلی اللہ علیہ وسلم کے صاحبزادے ) ابراہیم رضی اللہ عنہ کا انتقال ہوا بعض لوگ کہنے لگے کہ گرہن ابراہیم رضی اللہ عنہ کی وفات کی وجہ سے لگا ہے۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ گرہن کسی کی موت و حیات سے نہیں لگتا۔ البتہ تم جب اسے دیکھو تو نماز پڑھا کرو اور دعا کیا کرو۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1044,
			"arabicnumber": 1044,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے ہشام بن عروہ نے بیان کیا، ان سے ان کے باپ عروہ بن زبیر رضی اللہ عنہ نے بیان کیا، ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن ہوا تو آپ نے لوگوں کو نماز پڑھائی۔ پہلے آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو بڑی دیر تک کھڑے رہے، قیام کے بعد رکوع کیا اور رکوع میں بہت دیر تک رہے۔ پھر رکوع سے اٹھنے کے بعد دیر تک دوبارہ کھڑے رہے لیکن آپ صلی اللہ علیہ وسلم کے پہلے قیام سے کچھ کم، پھر رکوع کیا تو بڑی دیر تک رکوع میں رہے لیکن پہلے سے مختصر، پھر سجدہ میں گئے اور دیر تک سجدہ کی حالت میں رہے۔ دوسری رکعت میں بھی آپ صلی اللہ علیہ وسلم نے اسی طرح کیا، جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو گرہن کھل چکا تھا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خطبہ دیا اللہ تعالیٰ کی حمد و ثنا کے بعد فرمایا کہ سورج اور چاند دونوں اللہ کی نشانیاں ہیں اور کسی کی موت و حیات سے ان میں گرہن نہیں لگتا۔ جب تم گرہن لگا ہوا دیکھو تو اللہ سے دعا کرو تکبیر کہو اور نماز پڑھو اور صدقہ کرو۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا اے محمد کی امت کے لوگو! دیکھو اس بات پر اللہ تعالیٰ سے زیادہ غیرت اور کسی کو نہیں آتی کہ اس کا کوئی بندہ یا بندی زنا کرے، اے امت محمد! واللہ جو کچھ میں جانتا ہوں اگر تمہیں بھی معلوم ہو جائے تو تم ہنستے کم اور روتے زیادہ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1045,
			"arabicnumber": 1045,
			"text": "ہم سے اسحاق بن منصور نے بیان کیا، انہوں نے کہا کہ ہمیں یحییٰ بن صالح نے خبر دی، انہوں نے کہا کہ ہم سے معاویہ بن سلام بن ابی سلام رحمہ اللہ تعالیٰ حبشی دمشقی نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن ابی کثیر نے بیان کیا، انہوں نے کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن بن عوف زہری نے خبر دی، ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ جب رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن لگا تو یہ اعلان کیا گیا کہ نماز ہونے والی ہے۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا کہ مجھ سے لیث بن سعد نے بیان کیا، ان سے عقیل نے بیان کیا، ان سے ابن شہاب نے (دوسری سند) اور مجھ سے احمد بن صالح نے بیان کیا کہ ہم سے عنبسہ بن خالد نے بیان کیا، کہا کہ ہم سے یونس بن یزید نے بیان کیا، ان سے ابن شہاب نے، انہوں نے کہا کہ مجھ سے عروہ نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ صدیقہ رضی اللہ عنہا سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کی زندگی میں سورج گرہن لگا، اسی وقت آپ صلی اللہ علیہ وسلم مسجد میں تشریف لے گئے۔ انہوں نے بیان کیا کہ لوگوں نے نبی کریم صلی اللہ علیہ وسلم کے پیچھے صف باندھی آپ صلی اللہ علیہ وسلم نے تکبیر کہی اور بہت دیر قرآن مجید پڑھتے رہے پھر تکبیر کہی اور بہت لمبا رکوع کیا پھر «سمع الله لمن حمده‏» کہہ کر کھڑے ہو گئے اور سجدہ نہیں کیا ( رکوع سے اٹھنے کے بعد ) پھر بہت دیر تک قرآن مجید پڑھتے رہے۔ لیکن پہلی قرآت سے کم، پھر تکبیر کے ساتھ رکوع میں چلے گئے اور دیر تک رکوع میں رہے، یہ رکوع بھی پہلے رکوع سے کم تھا۔ اب «سمع الله لمن حمده‏» اور «ربنا ولك الحمد‏» کہا پھر سجدہ میں گئے۔ آپ صلی اللہ علیہ وسلم نے دوسری رکعت میں بھی اسی طرح کیا ( ان دونوں رکعتوں میں ) پورے چار رکوع اور چار سجدے کئے۔ نماز سے فارغ ہونے سے پہلے ہی سورج صاف ہو چکا تھا۔ نماز کے بعد آپ صلی اللہ علیہ وسلم نے کھڑے ہو کر خطبہ فرمایا اور پہلے اللہ تعالیٰ کی اس کی شان کے مطابق تعریف کی پھر فرمایا کہ سورج اور چاند اللہ کی دو نشانیاں ہیں ان میں گرہن کسی کی موت و حیات کی وجہ سے نہیں لگتا لیکن جب تم گرہن دیکھا کرو تو فوراً نماز کی طرف لپکو۔ زہری نے کہا کہ کثیر بن عباس اپنے بھائی عبداللہ بن عباس سے روایت کرتے تھے وہ سورج گرہن کا قصہ اس طرح بیان کرتے تھے جیسے عروہ نے عائشہ صدیقہ رضی اللہ عنہا سے نقل کیا۔ زہری نے کہا میں نے عروہ سے کہا تمہارے بھائی عبداللہ بن زبیر نے جس دن مدینہ میں سورج گرہن ہوا صبح کی نماز کی طرح دو رکعت پڑھی اور کچھ زیادہ نہیں کیا۔ انہوں نے کہا ہاں مگر وہ سنت کے طریق سے چوک گئے۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1047,
			"arabicnumber": 1047,
			"text": "ہم سے سعید بن عفیر نے بیان کیا، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا، انہوں نے کہا کہ مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، انہوں نے کہا کہ مجھے عروہ بن زبیر نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ صدیقہ رضی اللہ عنہا نے خبر دی کہ جس دن سورج میں خسوف ( گرہن ) لگا تو نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی۔ آپ صلی اللہ علیہ وسلم کھڑے ہوئے تکبیر کہی پھر دیر تک قرآن مجید پڑھتے رہے۔ لیکن اس کے بعد ایک طویل رکوع کیا۔ رکوع سے سر اٹھایا تو کہا «سمع الله لمن حمده‏» پھر آپ صلی اللہ علیہ وسلم پہلے ہی کی طرح کھڑے ہو گئے اور دیر تک قرآن مجید پڑھتے رہے لیکن اس مرتبہ کی قرآت پہلے سے کچھ کم تھی۔ پھر آپ صلی اللہ علیہ وسلم سجدہ میں گئے اور بہت دیر تک سجدہ میں رہے پھر دوسری رکعت میں بھی آپ صلی اللہ علیہ وسلم نے اسی طرح کیا پھر جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو سورج صاف ہو چکا تھا۔ نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم نے خطبہ دیا اور فرمایا کہ سورج اور چاند کا «كسوف» ( گرہن ) اللہ تعالیٰ کی ایک نشانی ہے اور ان میں «خسوف» ( گرہن ) کسی کی موت و زندگی پر نہیں لگتا۔ لیکن جب تم سے دیکھو تو فوراً نماز کے لیے لپکو۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1048,
			"arabicnumber": 1048,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے یونس بن عبید نے، ان سے امام حسن بصری نے، ان سے ابوبکرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند دونوں اللہ تعالیٰ کی نشانیاں ہیں اور کسی کی موت و حیات سے ان میں گرہن نہیں لگتا بلکہ اللہ تعالیٰ اس کے ذریعہ اپنے بندوں کو ڈراتا ہے۔ عبدالوارث، شعبہ، خالد بن عبداللہ اور حماد بن سلمہ ان سب حافظوں نے یونس سے یہ جملہ کہ ”اللہ تعالیٰ ان کو گرہن کر کے اپنے بندوں کو ڈراتا ہے“ بیان نہیں کیا اور یونس کے ساتھ اس حدیث کو موسیٰ نے مبارک بن فضالہ سے، انہوں نے امام حسن بصری سے روایت کیا۔ اس میں یوں ہے کہ ابوبکرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے سن کر مجھ کو خبر دی کہ اللہ تعالیٰ ان کو گرہن کر کے اپنے بندوں کو ڈراتا ہے اور یونس کے ساتھ اس حدیث کو اشعث بن عبداللہ نے بھی امام حسن بصری سے روایت کیا۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1050,
			"arabicnumber": 1050,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "ہم سے ابونعیم فضل بن دکین کوفی نے بیان کیا، انہوں نے کہا کہ ہم سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابن ابی کثیر سے بیان کیا، ان سے ابوسلمہ بن عبدالرحمٰن بن عوف نے، ان سے عبداللہ بن عمرو رضی اللہ عنہما نے کہ جب نبی کریم صلی اللہ علیہ وسلم کے زمانے میں سورج کو گرہن لگا تو اعلان ہوا کہ نماز ہونے والی ہے ( اس نماز میں ) نبی کریم صلی اللہ علیہ وسلم نے ایک رکعت میں دو رکوع کئے اور پھر دوسری رکعت میں بھی دو رکوع کئے، اس کے بعد آپ صلی اللہ علیہ وسلم بیٹھے رہے ( قعدہ میں ) یہاں تک کہ سورج صاف ہو گیا۔ عبداللہ نے کہا عائشہ رضی اللہ عنہا نے فرمایا کہ میں نے اس سے زیادہ لمبا سجدہ اور کبھی نہیں کیا۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے زید بن اسلم نے بیان کیا، ان سے عطاء بن یسار نے بیان کیا، ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم کے زمانے میں سورج کو گرہن لگا تو آپ صلی اللہ علیہ وسلم نے نماز پڑھی تھی آپ صلی اللہ علیہ وسلم نے اتنا لمبا قیام کیا کہ اتنی دیر میں سورۃ البقرہ پڑھی جا سکتی تھی۔ پھر آپ صلی اللہ علیہ وسلم نے رکوع لمبا کیا اور اس کے بعد کھڑے ہوئے تو اب کی مرتبہ بھی قیام بہت لمبا تھا لیکن پہلے سے کچھ کم پھر ایک دوسرا لمبا رکوع کیا جو پہلے رکوع سے کچھ کم تھا پھر آپ صلی اللہ علیہ وسلم سجدہ میں گئے، سجدہ سے اٹھ کر پھر لمبا قیام کیا لیکن پہلے قیام کے مقابلے میں کم لمبا تھا پھر ایک لمبا رکوع کیا۔ یہ رکوع بھی پہلے رکوع کے مقابلہ میں کم تھا رکوع سے سر اٹھا نے کے بعد پھر آپ صلی اللہ علیہ وسلم بہت دیر تک کھڑے رہے اور یہ قیام بھی پہلے سے مختصر تھا۔ پھر ( چوتھا ) رکوع کیا یہ بھی بہت لمبا تھا لیکن پہلے سے کچھ کم۔ پھر آپ صلی اللہ علیہ وسلم نے سجدہ کیا اور نماز سے فارغ ہوئے تو سورج صاف ہو چکا تھا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خطبہ میں فرمایا کہ سورج اور چاند دونوں اللہ تعالیٰ کی نشانیاں ہیں اور کسی کی موت و زندگی کی وجہ سے ان میں گرہن نہیں لگتا اس لیے جب تم کو معلوم ہو کہ گرہن لگ گیا ہے تو اللہ تعالیٰ کا ذکر کرو۔ صحابہ رضی اللہ عنہم نے عرض کیا یا رسول اللہ! ہم نے دیکھا کہ ( نماز میں ) اپنی جگہ سے آپ کچھ آگے بڑھے اور پھر اس کے بعد پیچھے ہٹ گئے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جنت دیکھی اور اس کا یک خوشہ توڑنا چاہا تھا اگر میں اسے توڑ سکتا تو تم اسے رہتی دنیا تک کھاتے اور مجھے جہنم بھی دکھائی گئی میں نے اس سے زیادہ بھیانک اور خوفناک منظر کبھی نہیں دیکھا۔ میں نے دیکھا اس میں عورتیں زیادہ ہیں۔ کسی نے پوچھا یا رسول اللہ! اس کی کیا وجہ ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے کفر ( انکار ) کی وجہ سے، پوچھا گیا۔ کیا اللہ تعالیٰ کا کفر ( انکار ) کرتی ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ شوہر کا اور احسان کا کفر کرتی ہیں۔ زندگی بھر تم کسی عورت کے ساتھ حسن سلوک کرو لیکن کبھی اگر کوئی خلاف مزاج بات آ گئی تو فوراً یہی کہے گی کہ میں نے تم سے کبھی بھلائی نہیں دیکھی۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی، انہیں ہشام بن عروہ نے، انہیں ان کی بیوی فاطمہ بنت منذر نے، انہیں اسماء بنت ابی بکر رضی اللہ عنہما نے، انہوں نے کہا کہ جب سورج کو گرہن لگا تو میں نبی کریم صلی اللہ علیہ وسلم کی بیوی عائشہ صدیقہ رضی اللہ عنہا کے گھر آئی۔ اچانک لوگ کھڑے ہوئے نماز پڑھ رہے تھے اور عائشہ رضی اللہ عنہا بھی نماز میں شریک تھی میں نے پوچھا کہ لوگوں کو بات کیا پیش آئی؟ اس پر آپ نے آسمان کی طرف اشارہ کر کے سبحان اللہ کہا۔ پھر میں نے پوچھا کیا کوئی نشانی ہے؟ اس کا آپ نے اشارہ سے ہاں میں جواب دیا۔ انہوں نے بیان کیا کہ پھر میں بھی کھڑی ہو گئی۔ لیکن مجھے چکر آ گیا اس لیے میں اپنے سر پر پانی ڈالنے لگی۔ جب رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو اللہ تعالیٰ کی حمد و ثنا کے بعد فرمایا کہ وہ چیزیں جو کہ میں نے پہلے نہیں دیکھی تھیں اب انہیں میں نے اپنی اسی جگہ سے دیکھ لیا۔ جنت اور دوزخ تک میں نے دیکھی اور مجھے وحی کے ذریعہ بتایا گیا ہے کہ تم قبر میں دجال کے فتنہ کی طرح یا ( یہ کہا کہ ) دجال کے فتنہ کے قریب ایک فتنہ میں مبتلا ہو گے۔ مجھے یاد نہیں کہ اسماء رضی اللہ عنہا نے کیا کہا تھا آپ نے فرمایا کہ تمہیں لایا جائے گا اور پوچھا جائے گا کہ اس شخص ( مجھ صلی اللہ علیہ وسلم ) کے بارے میں تم کیا جانتے ہو۔ مومن یا یہ کہا کہ یقین کرنے والا ( مجھے یاد نہیں کہ ان دو باتوں میں سے اسماء رضی اللہ عنہا نے کون سی بات کہی تھی ) تو کہے گا یہ محمد صلی اللہ علیہ وسلم ہیں آپ صلی اللہ علیہ وسلم نے ہمارے سامنے صحیح راستہ اور اس کے دلائل پیش کئے اور ہم آپ صلی اللہ علیہ وسلم پر ایمان لائے تھے اور آپ صلی اللہ علیہ وسلم کی بات قبول کی اور آپ صلی اللہ علیہ وسلم کا اتباع کیا تھا۔ اس پر اس سے کہا جائے گا کہ تو مرد صالح ہے پس آرام سے سو جاؤ ہمیں تو پہلے ہی معلوم تھا کہ تو ایمان و یقین والا ہے۔ منافق یا شک کرنے والا ( مجھے معلوم نہیں کہ اسماء رضی اللہ عنہا نے کیا کہا تھا ) وہ یہ کہے گا کہ مجھے کچھ معلوم نہیں میں نے لوگوں سے ایک بات سنی تھی وہی میں نے بھی کہی ( آگے مجھ کو کچھ حقیقت معلوم نہیں ) ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "ہم سے ربیع بن یحییٰ نے بیان کیا، کہا کہ ہم سے زائدہ نے ہشام سے بیان کیا، ان سے فاطمہ نے، ان سے اسماء رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم نے سورج گرہن میں غلام آزاد کرنے کا حکم فرمایا۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے یحییٰ قطان نے اسماعیل بن ابی خالد سے بیان کیا، کہا کہ مجھ سے قیس نے بیان کیا، ان سے ابومسعود عقبہ بن عامر انصاری صحابی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند میں گرہن کسی کی موت کی وجہ سے نہیں لگتا البتہ یہ دونوں اللہ تعالیٰ کی نشانیاں ہیں، اس لیے جب تم گرہن دیکھو تو نماز پڑھو۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا کہ ہم سے ہشام نے بیان کیا، انہوں نے کہا کہ ہمیں معمر نے خبر دی، انہیں زہری اور ہشام بن عروہ نے، انہیں عروہ بن زبیر نے، انہیں عائشہ صدیقہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ مبارک میں سورج کو گرہن لگا تو آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور لوگوں کے ساتھ نماز میں مشغول ہو گئے۔ آپ صلی اللہ علیہ وسلم نے لمبی قرآت کی۔ پھر رکوع کیا اور یہ بھی بہت لمبا تھا۔ پھر سر اٹھایا اور اس مرتبہ بھی دیر تک قرآت کی مگر پہلی قرآت سے کم۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے ( دوسری مرتبہ ) رکوع کیا بہت لمبا لیکن پہلے کے مقابلہ میں مختصر پھر رکوع سے سر اٹھا کر آپ صلی اللہ علیہ وسلم سجدہ میں چلے گئے اور دو سجدے کئے پھر کھڑے ہوئے اور دوسری رکعت میں بھی اسی طرح کیا جیسے پہلی رکعت میں کر چکے تھے۔ اس کے بعد فرمایا کہ سورج اور چاند میں گرہن کسی کی موت و حیات سے نہیں لگتا۔ البتہ یہ دونوں اللہ تعالیٰ کی نشانیاں ہیں جنہیں اللہ تعالیٰ اپنے بندوں کو دکھاتا ہے، اس لیے جب تم انہیں دیکھو تو فوراً نماز کے لیے دوڑو۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "ہم سے محمد بن علاء نے بیان کیا، کہا کہ ہم سے ابواسامہ نے بیان کیا، ان سے برید بن عبداللہ نے، ان سے ابوبردہ نے، ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ ایک دفعہ سورج گرہن ہوا تو نبی کریم صلی اللہ علیہ وسلم بہت گھبرا کر اٹھے اس ڈر سے کہ کہیں قیامت نہ قائم ہو جائے۔ آپ صلی اللہ علیہ وسلم نے مسجد میں آ کر بہت ہی لمبا قیام، لمبا رکوع اور لمبے سجدوں کے ساتھ نماز پڑھی۔ میں نے کبھی آپ صلی اللہ علیہ وسلم کو اس طرح کرتے نہیں دیکھا تھا۔ آپ صلی اللہ علیہ وسلم نے نماز کے بعد فرمایا کہ یہ نشانیاں ہیں جنہیں اللہ تعالیٰ بھیجتا ہے یہ کسی کی موت و حیات کی وجہ سے نہیں آتیں بلکہ اللہ تعالیٰ ان کے ذریعہ اپنے بندوں کو ڈراتا ہے اس لیے جب تم اس طرح کی کوئی چیز دیکھو تو فوراً اللہ تعالیٰ کے ذکر اور اس سے استغفار کی طرف لپکو۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "ہم سے ابوالولید طیالسی نے بیان کیا، انہوں نے کہا کہ ہم سے زائدہ بن قدامہ نے بیان کیا، انہوں نے کہا کہ ہم سے زیاد بن علاقہ نے بیان کیا، انہوں نے کہا کہ میں نے مغیرہ بن شعبہ رضی اللہ عنہ سے سنا کہ انہوں نے کہا کہ جس دن ابراہیم رضی اللہ عنہ کی موت ہوئی سورج گرہن بھی اسی دن لگا۔ اس پر بعض لوگوں نے کہا کہ گرہن ابراہیم رضی اللہ عنہ ( نبی کریم صلی اللہ علیہ وسلم کے صاحبزادے ) کی وفات کی وجہ سے لگا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشان ہیں۔ ان میں گرہن کسی کی موت و حیات کی وجہ سے نہیں لگتا۔ جب اسے دیکھو تو اللہ پاک سے دعا کرو اور نماز پڑھو تاآنکہ سورج صاف ہو جائے۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "اور ابواسامہ نے بیان کیا کہ ہم سے ہشام بن عروہ نے بیان کیا، انہوں نے کہا کہ مجھے فاطمہ بنت منذر نے خبر دی، ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے فرمایا کہ جب سورج صاف ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے اور آپ صلی اللہ علیہ وسلم نے خطبہ دیا۔ پہلے اللہ تعالیٰ کی شان کے مطابق اس کی تعریف کی اس کے بعد فرمایا «أما بعد» ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "ہم سے محمود بن غیلان نے بیان کیا، کہا کہ ہم سے سعید بن عامر نے بیان کیا، ان سے شعبہ نے، ان سے یونس نے، ان سے امام حسن بصری نے اور ان سے ابوبکرہ رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں سورج کو گرہن لگا تو آپ صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھی تھی۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "ہم سے ابومعمر نے بیان کیا، کہا کہ ہم سے عبدالوارث نے بیان کیا، کہا کہ ہم سے یونس نے بیان کیا، ان سے امام حسن بصری نے، ان سے ابوبکرہ نے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو آپ صلی اللہ علیہ وسلم اپنی چادر گھسیٹتے ہوئے ( بڑی تیزی سے ) مسجد میں پہنچے۔ صحابہ بھی جمع ہو گئے۔ پھر آپ صلی اللہ علیہ وسلم نے انہیں دو رکعت نماز پڑھائی، گرہن بھی ختم ہو گیا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں اور ان میں گرہن کسی کی موت پر نہیں لگتا اس لیے جب گرہن لگے تو اس وقت تک نماز اور دعا میں مشغول رہو جب تک یہ صاف نہ ہو جائے۔ یہ آپ صلی اللہ علیہ وسلم نے اس لیے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے ایک صاحبزادے ابراہیم رضی اللہ عنہ کی وفات ( اسی دن ) ہوئی تھی اور بعض لوگ ان کے متعلق کہنے لگے تھے ( کہ گرہن ان کی موت پر لگا ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "ہم سے محمود بن غیلان نے بیان کیا، انہوں نے کہا کہ ہم سے ابواحمد محمد بن عبداللہ زبیری نے بیان کیا، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا، ان سے یحییٰ بن سعید انصاری نے، ان سے عمرہ نے، ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے سورج گرہن کی دو رکعتوں میں چار رکوع کئے اور پہلی رکعت دوسری رکعت سے لمبی تھی۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		}
	]
}