{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی انہیں ابن شہاب نے، انہیں سلیمان بن یسار نے، اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ فضل بن عباس ( حجۃ الوداع میں ) رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سواری کے پیچھے بیٹھے ہوئے تھے کہ قبیلہ خثعم کی ایک خوبصورت عورت آئی۔ فضل اس کو دیکھنے لگے وہ بھی انہیں دیکھ رہی تھی۔ لیکن رسول اللہ صلی اللہ علیہ وسلم فضل رضی اللہ عنہ کا چہرہ بار بار دوسری طرف موڑ دینا چاہتے تھے۔ اس عورت نے کہا یا رسول اللہ! اللہ کا فریضہ حج میرے والد کے لیے ادا کرنا ضروری ہو گیا ہے۔ لیکن وہ بہت بوڑھے ہیں اونٹنی پر بیٹھ نہیں سکتے۔ کیا میں ان کی طرف سے حج ( بدل ) کر سکتی ہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں۔ یہ حجتہ الوداع کا واقعہ تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "ہم سے احمد بن عیسیٰ نے بیان کیا، کہا کہ ہمیں عبداللہ بن وہب نے خبر دی، انہیں یونس نے، انہیں بن شہاب نے کہ سالم بن عبداللہ بن عمر رضی اللہ عنہما نے انہیں خبر دی، ان سے عبداللہ بن عمر نے فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ذی الحلیفہ میں دیکھا کہ اپنی سواری پر چڑھ رہے ہیں۔ پھر جب وہ سیدھی کھڑی ہوئی تو آپ صلی اللہ علیہ وسلم نے لبیک کہا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا کہ ہمیں ولید بن مسلم نے خبر دی، کہا کہ ہم سے امام اوزاعی نے بیان کیا، انہوں نے عطاء بن ابی رباح سے سنا، وہ جابر بن عبداللہ انصاری رضی اللہ عنہما سے بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ذوالحلیفہ سے احرام باندھا جب سواری آپ صلی اللہ علیہ وسلم کو لے کر سیدھی کھڑی ہو گئی۔ ابراہیم بن موسیٰ کی یہ حدیث ابن عباس اور انس رضی اللہ عنہم سے بھی مروی ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "اور ابان نے کہا ہم سے مالک بن دینار نے بیان کیا، ان سے قاسم بن محمد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے ان کے ساتھ ان کے بھائی عبدالرحمٰن کو بھیجا اور انہوں نے عائشہ رضی اللہ عنہا کو تنعیم سے عمرہ کرایا اور پالان کی پچھلی لکڑی پر ان کو بٹھا لیا۔ عمر رضی اللہ عنہ نے فرمایا کہ حج کے لیے پالانیں باندھو کیونکہ یہ بھی ایک جہاد ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "محمد بن ابی بکر نے بیان کیا کہ ہم سے زید بن زریع نے بیان کیا، کہا کہ ہم سے عزرہ بن ثابت نے بیان کیا، ان سے ثمامہ بن عبداللہ بن انس نے بیان کیا کہ انس رضی اللہ عنہ ایک پالان پر حج کے لیے تشریف لے گئے اور آپ بخیل نہیں تھے۔ آپ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم بھی پالان پر حج کے لیے تشریف لے گئے تھے، اسی پر آپ کا اسباب بھی لدا ہوا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "ہم سے عمرو بن علی فلاس نے بیان کیا، کہا کہ ہم سے ابوعاصم نے بیان کیا، کہا کہ ہم سے ایمن بن نابل نے بیان کیا۔ کہا کہ ہم سے قاسم بن محمد نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ انھوں نے کہا یا رسول اللہ! آپ لوگوں نے تو عمرہ کر لیا لیکن میں نہ کر سکی۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے فرمایا عبدالرحمٰن اپنی بہن کو لے جا اور انہیں تنعیم سے عمرہ کرا لا۔ چنانچہ انہوں نے عائشہ رضی اللہ عنہا کو اپنے اونٹ کے پیچھے بٹھا لیا اور عائشہ رضی اللہ عنہا نے عمرہ ادا کیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1519,
			"arabicnumber": 1519,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، انہوں نے کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا، انہوں نے کہا کہ ہم سے زہری نے بیان کیا، ان سے سعید بن مسیب نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم سے کسی نے پوچھا کہ کون سا کام بہتر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ اور اس کے رسول پر ایمان لانا۔ پوچھا گیا کہ پھر اس کے بعد؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے راستے میں جہاد کرنا۔ پھر پوچھا گیا کہ پھر اس کے بعد؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ حج مبرور۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "ہم سے عبدالرحمٰن بن مبارک نے بیان کیا، انہوں نے کہا کہ ہم سے خالد بن عبداللہ طحان نے بیان کیا، انہوں نے کہا کہ ہمیں حبیب بن ابی عمرہ نے خبر دی، انہیں عائشہ بنت طلحہ نے اور انہیں ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ انہوں نے پوچھا یا رسول اللہ! ہم دیکھتے ہیں کہ جہاد سب نیک کاموں سے بڑھ کر ہے۔ پھر ہم بھی کیوں نہ جہاد کریں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ سب سے افضل جہاد حج ہے جو مبرور ہو۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، کہا کہ ہم سے سیارابوالحکم نے بیان کیا، کہا کہ میں نے ابو حزم سے سنا، انہوں نے بیان کیا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا کہ آپ صلی اللہ علیہ وسلم نے فرمایا جس شخص نے اللہ کے لیے اس شان کے ساتھ حج کیا کہ نہ کوئی فحش بات ہوئی اور نہ کوئی گناہ تو وہ اس دن کی طرح واپس ہو گا جیسے اس کی ماں نے اسے جنا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، انہوں نے کہا کہ ہم سے زہیر نے بیان کیا، انہوں نے کہا کہ مجھ سے زید بن جبیر نے بیان کیا کہ وہ عبداللہ بن عمر رضی اللہ عنہما کی قیام گاہ پر حاضر ہوئے۔ وہاں قنات کے ساتھ شامیانہ لگا ہوا تھا ( زید بن جبیر نے کہا کہ ) میں نے پوچھا کہ کس جگہ سے عمرہ کا احرام باندھنا چاہئے۔ عبداللہ رضی اللہ عنہ نے جواب دیا کہ رسول اللہ صلی اللہ علیہ وسلم نے نجد والوں کے لیے قرن، مدینہ والوں کے لیے ذوالحلیفہ اور شام والوں کے لیے حجفہ مقرر کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "ہم سے یحییٰ بن بشر نے بیان کیا، انہوں نے کہا کہ ہم سے شبابہ بن سوار نے بیان کیا، ان سے ورقاء بن عمرو نے، ان سے عمرو بن دینار نے، ان سے عکرمہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ یمن کے لوگ راستہ کا خرچ ساتھ لائے بغیر حج کے لیے آ جاتے تھے۔ کہتے تو یہ تھے کہ ہم توکل کرتے ہیں لیکن جب مکہ آتے تو لوگوں سے مانگنے لگتے۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی ”اور توشہ لے لیا کرو کہ سب سے بہتر توشہ تو تقویٰ ہی ہے۔“ اس کو ابن عیینہ نے عمرو سے بواسطہ عکرمہ مرسلاً نقل کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے وہیب نے بیان کیا، کہا کہ ہم سے عبداللہ بن طاؤس نے بیان کیا، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے مدینہ والوں کے احرام کے لیے ذوالحلیفہ، شام والوں کے لیے حجفہ، نجد والوں کے قرن منزل، یمن والوں کے یلملم متعین کیا۔ یہاں سے ان مقامات والے بھی احرام باندھیں اور ان کے علاوہ وہ لوگ بھی جو ان راستوں سے آئیں اور حج یا عمرہ کا ارادہ رکھتے ہوں۔ لیکن جن کا قیام میقات اور مکہ کے درمیان ہے تو وہ احرام اسی جگہ سے باندھیں جہاں سے انہیں سفر شروع کرنا ہے۔ یہاں تک کہ مکہ کے لوگ مکہ ہی سے احرام باندھیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مدینہ کے لوگ ذوالحلیفہ سے احرام باندھیں، شام کے لوگ حجفہ سے اور نجد کے لوگ قرن المنازل سے۔ عبداللہ نے کہا کہ مجھے معلوم ہوا ہے۔ کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اور یمن کے لوگ یلملم سے احرام باندھیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے عمرو بن دینار نے بیان کیا، ان سے طاؤس نے بیان کیا، اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مدینہ والوں کے لیے ذوالحلیفہ کو میقات مقرر کیا، شام والوں کے لیے حجفہ، نجد والوں کے لیے قرن المنازل اور یمن والوں کے لیے یلملم۔ یہ میقات ان ملک والوں کے ہیں اور ان لوگوں کے لیے بھی جو ان ملکوں سے گزر کر حرم میں داخل ہوں اور حج یا عمرہ کا ارادہ رکھتے ہوں۔ لیکن جو لوگ میقات کے اندر رہتے ہوں۔ یہاں تک کہ مکہ کے لوگ احرام مکہ ہی سے باندھیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "ہم سے علی بن مدینی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، کہا کہ ہم نے زہری سے یہ حدیث یاد رکھی، ان سے سالم نے کہا اور ان سے ان کے والد نے بیان کیا تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے میقات متعین کر دیئے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": 1528,
			"text": "(دوسری سند) اور امام بخاری رحمہ اللہ نے کہا کہ مجھ سے احمد نے بیان کیا، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھے یونس نے خبر دی، انہیں ابن شہاب نے، انہیں سالم بن عبداللہ نے اور ان سے ان کے والد نے بیان کیاکہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ مدینہ والوں کے لیے احرام باندھنے کی جگہ ذوالحلیفہ اور شام والوں کے لیے مہیعہ یعنی حجفہ اور نجد والوں کے لیے قرن المنازل۔ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ لوگ کہتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یمن والے احرام یلملم سے باندھیں لیکن میں نے اسے آپ صلی اللہ علیہ وسلم سے نہیں سنا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا، انہوں نے کہا کہ ہم سے عمرو بن دینار نے، ان سے طاؤس نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے مدینہ والوں کے لیے ذوالحلیفہ میقات ٹھہرایا اور شام والوں کے لیے حجفہ، یمن والوں کے لیے یلملم اور نجد والوں کے لیے قرن المنازل۔ یہ ان ملکوں کے لوگوں کے لیے ہیں اور دوسرے ان تمام لوگوں کے لیے بھی جو ان ملکوں سے گزریں۔ اور حج اور عمرہ کا ارادہ رکھتے ہوں۔ لیکن جو لوگ میقات کے اندر رہتے ہوں۔ تو وہ اپنے شہروں سے احرام باندھیں، تاآنکہ مکہ کے لوگ مکہ ہی سے احرام باندھیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "ہم سے معلی بن اسد نے بیان کیا، کہا کہ ہم سے وہیب بن خالد نے بیان کیا، ان سے عبداللہ بن طاؤس نے بیان کیا، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے مدینہ والوں کے لیے ذوالحلیفہ کو میقات مقرر کیا، شام والوں کے لیے حجفہ، نجد والوں کے لیے قرن المنازل اور یمن والوں کے لیے یلملم۔ یہ ان ملکوں کے باشندوں کے میقات ہیں اور تمام ان دوسرے مسلمانوں کے بھی جو ان ملکوں سے گزر کر آئیں اور حج اور عمرہ کا ارادہ رکھتے ہوں۔ لیکن جو لوگ میقات کے اندر رہتے ہیں تو ( وہ احرام وہیں سے باندھیں ) جہاں سے سفر شروع کریں تاآنکہ مکہ کے لوگ احرام مکہ ہی سے باندھیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "ہم سے علی بن مسلم نے بیان کیا، کہا کہ ہم سے عبداللہ بن نمیر نے بیان کیا، کہا کہ ہم سے عبیداللہ عمری نے نافع سے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ جب یہ دو شہر ( بصرہ اور کوفہ ) فتح ہوئے تو لوگ عمر رضی اللہ عنہ کے پاس آئے اور کہا کہ یا امیرالمؤمنین رسول اللہ صلی اللہ علیہ وسلم نے نجد کے لوگوں کے لیے احرام باندھنے کی جگہ قرن المنازل قرار دی ہے اور ہمارا راستہ ادھر سے نہیں ہے، اگر ہم قرن کی طرف جائیں تو ہمارے لیے بڑی دشواری ہو گی۔ اس پر عمر رضی اللہ عنہ نے فرمایا کہ پھر تم لوگ اپنے راستے میں اس کے برابر کوئی جگہ تجویز کر لو۔ چنانچہ ان کے لیے ذات عرق کی تعیین کر دی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی، انہیں نافع نے، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے مقام ذوالحلیفہ کے پتھریلے میدان میں اپنی سواری روکی اور پھر وہیں آپ صلی اللہ علیہ وسلم نے نماز پڑھی۔ عبداللہ بن عمر رضی اللہ عنہما بھی ایسا ہی کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا، ان سے عبیداللہ عمری نے بیان کیا، ان سے نافع نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم شجرہ کے راستے سے گزرتے ہوئے ”معرس“ کے راستے سے مدینہ آتے۔ نبی کریم صلی اللہ علیہ وسلم جب مکہ جاتے تو شجرہ کی مسجد میں نماز پڑھتے لیکن واپسی میں ذوالحلیفہ کے نشیب میں نماز پڑھتے۔ آپ صلی اللہ علیہ وسلم رات وہیں گزارتے تاآنکہ صبح ہو جاتی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "ہم سے ابوبکر عبداللہ حمیدی نے بیان کیا، کہا کہ ہم سے ولید اور بشر بن بکر تنیسی نے بیان کیا، انہوں نے کہا کہ ہم سے امام اوزاعی نے بیان کیا، کہا کہ ہم سے یحییٰ بن ابی کثیر نے بیان کیا، ان سے عکرمہ نے بیان کیا، انہوں نے عبداللہ بن عباس رضی اللہ عنہما سے سنا، وہ بیان کرتے تھے کہ میں نے عمر رضی اللہ عنہ سے سنا، ان کا بیان تھا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے وادی عقیق میں سنا۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ رات میرے پاس میرے رب کا ایک فرشتہ آیا اور کہا کہ اس ”مبارک وادی“ میں نماز پڑھ اور اعلان کر کہ عمرہ حج میں شریک ہو گیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا، کہا کہ ہم سے فضیل بن سلیمان نے بیان کیا، کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا، کہا کہ ہم سے سالم بن عبداللہ بن عمر نے بیان کیا اور ان سے ان کے والد نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے کہ معرس کے قریب ذوالحلیفہ کی بطن وادی ( وادی عقیق ) میں آپ صلی اللہ علیہ وسلم کو خواب دکھایا گیا۔ ( جس میں ) آپ صلی اللہ علیہ وسلم سے کہا گیا تھا کہ آپ اس وقت ”بطحاء مبارکہ“ میں ہیں۔ موسیٰ بن عقبہ نے کہا کہ سالم نے ہم کو بھی وہاں ٹھہرایا وہ اس مقام کو ڈھونڈ رہے تھے جہاں عبداللہ اونٹ بٹھایا کرتے تھے یعنی جہاں نبی کریم صلی اللہ علیہ وسلم رات کو اترا کرتے تھے۔ وہ مقام اس مسجد کے نیچے کی طرف میں ہے جو نالے کے نشیب میں ہے۔ اترنے والوں اور راستے کے بیچوں بیچ ( وادی عقیق مدینہ سے چار میل بقیع کی جانب ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "ہم سے محمد نے بیان کیا، کہا کہ ہم سے ابوعاصم، ضحاک بن مخلد نبیل نے بیان کیا، کہا کہ ہمیں ابن جریج نے خبر دی کہا کہ مجھے عطاء بن ابی رباح نے خبر دی، انہیں صفوان بن یعلیٰ نے، کہا کہ ان کے باپ یعلیٰ بن امیہ نے عمر رضی اللہ عنہ سے کہا کہ کبھی آپ مجھے نبی کریم صلی اللہ علیہ وسلم کو اس حال میں دکھایئے جب آپ صلی اللہ علیہ وسلم پر وحی نازل ہو رہی ہو۔ انہوں نے بیان کیا کہ ایک بار رسول اللہ صلی اللہ علیہ وسلم جعرانہ میں اپنے اصحاب کی ایک جماعت کے ساتھ ٹھہرے ہوئے تھے کہ ایک شخص نے آ کر پوچھا یا رسول اللہ! اس شخص کے متعلق آپ کا کیا حکم ہے جس نے عمرہ کا احرام اس طرح باندھا کہ اس کے کپڑے خوشبو میں بسے ہوئے ہوں۔ نبی کریم صلی اللہ علیہ وسلم اس پر تھوڑی دیر کے لیے چپ ہو گئے۔ پھر آپ صلی اللہ علیہ وسلم پر وحی نازل ہوئی تو عمر رضی اللہ عنہ نے یعلیٰ رضی اللہ عنہ کو اشارہ کیا۔ یعلیٰ آئے تو رسول اللہ صلی اللہ علیہ وسلم پر ایک کپڑا تھا جس کے اندر آپ صلی اللہ علیہ وسلم تشریف رکھتے تھے۔ انہوں نے کپڑے کے اندر اپنا سر کیا تو کیا دیکھتے ہیں کہ روئے مبارک سرخ ہے اور آپ صلی اللہ علیہ وسلم خراٹے لے رہے ہیں۔ پھر یہ حالت ختم ہوئی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ شخص کہاں ہے جس نے عمرہ کے متعلق پوچھا تھا۔ شخص مذکور حاضر کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو خوشبو لگا رکھی ہے اسے تین مرتبہ دھو لے اور اپنا جبہ اتار دے۔ عمرہ میں بھی اسی طرح کر جس طرح حج میں کرتے ہو۔ میں نے عطاء سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم کے تین مرتبہ دھونے کے حکم سے پوری طرح صفائی مراد تھی؟ تو انہوں نے کہا کہ ہاں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہمیں امام مالک نے خبر دی، انہیں عبدالرحمٰن بن قاسم نے، انہیں ان کے والد نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے فرمایا کہ جب رسول اللہ صلی اللہ علیہ وسلم احرام باندھتے تو میں آپ صلی اللہ علیہ وسلم کے احرام کے لیے اور اسی طرح بیت اللہ کے طواف زیارت سے پہلے حلال ہونے کے لیے، خوشبو لگایا کرتی تھیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "ہم سے اصبغ بن فرج نے بیان کیا، کہا کہ ہمیں عبداللہ بن وہب نے خبر دی، انہیں یونس نے، انہیں ابن شہاب نے، انہیں سالم نے اور ان سے ان کے والد نے فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے تلبید کی حالت میں لبیک کہتے سنا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، انہوں نے کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا، انہوں نے کہا کہ میں نے سالم بن عبداللہ سے سنا، انہوں نے کہا کہ میں نے ابن عمر رضی اللہ عنہما سے سنا (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے، ان سے موسیٰ بن عقبہ نے، ان سے سالم بن عبداللہ نے، انہوں نے اپنے باپ سے سنا، کہ وہ کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے مسجد ذوالحلیفہ کے قریب ہی پہنچ کر احرام باندھا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ ایک شخص نے پوچھا کہ یا رسول اللہ! محرم کو کس طرح کا کپڑا پہننا چاہئے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا نہ کرتہ پہنے، نہ عمامہ باندھے، نہ پاجامہ پہنے، نہ باران کوٹ، نہ موزے۔ لیکن اگر اس کے پاس جوتی نہ ہو تو وہ موزے اس وقت پہن سکتا ہے جب ٹخنوں کے نیچے سے ان کو کاٹ لیا ہو۔ ( اور احرام میں ) کوئی ایسا کپڑا نہ پہنو جس میں زعفران یا ورس لگا ہوا ہو۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ محرم اپنا سر دھو سکتا ہے لیکن کنگھا نہ کرے۔ بدن بھی نہ کھجلانا چاہئے او جوں سر اور بدن سے نکال کر زمین پر ڈالی جا سکتی ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا، کہا کہ ہم سے فضیل بن سلیمان نے بیان کیا، کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا، کہا کہ مجھے کریب نے خبر دی اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ حجتہ الوداع میں ظہر اور عصر کے درمیان ہفتہ کے دن نبی کریم صلی اللہ علیہ وسلم کنگھا کرنے اور تیل لگانے اور ازار اور رداء پہننے کے بعد اپنے صحابہ کے ساتھ مدینہ سے نکلے۔ آپ صلی اللہ علیہ وسلم نے اس وقت زعفران میں رنگے ہوئے ایسے کپڑے کے سوا جس کا رنگ بدن پر لگتا ہو کسی قسم کی چادر یا تہبند پہننے سے منع نہیں کیا۔ دن میں آپ صلی اللہ علیہ وسلم ذوالحلیفہ پہنچ گئے ( اور رات وہیں گزاری ) پھر آپ صلی اللہ علیہ وسلم سوار ہوئے اور بیداء سے آپ صلی اللہ علیہ وسلم نے اور آپ صلی اللہ علیہ وسلم کے ساتھیوں نے لبیک کہا اور احرام باندھا اور اپنے اونٹوں کو ہار پہنایا۔ ذی قعدہ کے مہینے میں اب پانچ دن رہ گئے تھے پھر جب آپ صلی اللہ علیہ وسلم مکہ پہنچے تو ذی الحجہ کے چار دن گزر چکے تھے۔ آپ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف کیا اور صفا اور مروہ کی سعی کی، آپ صلی اللہ علیہ وسلم ابھی حلال نہیں ہوئے کیونکہ قربانی کے جانور آپ صلی اللہ علیہ وسلم کے ساتھ تھے اور آپ صلی اللہ علیہ وسلم نے ان کی گردن میں ہار ڈال دیا تھا۔ آپ صلی اللہ علیہ وسلم حجون پہاڑ کے نزدیک مکہ کے بالائی حصہ میں اترے۔ حج کا احرام اب بھی باقی تھا۔ بیت اللہ کے طواف کے بعد پھر آپ صلی اللہ علیہ وسلم وہاں اس وقت تک تشریف نہیں لے گئے جب تک میدان عرفات سے واپس نہ ہو لیے۔ آپ صلی اللہ علیہ وسلم نے اپنے ساتھیوں کو حکم دیا تھا کہ وہ بیت اللہ کا طواف کریں اور صفا و مروہ کے درمیان سعی کریں، پھر اپنے سروں کے بال ترشوا کر حلال ہو جائیں۔ یہ فرمان ان لوگوں کے لیے تھا جن کے ساتھ قربانی کے جانور نہیں تھے۔ اگر کسی کے ساتھ اس کی بیوی تھی تو وہ اس سے ہمبستر ہو سکتا تھا۔ اسی طرح خوشبودار اور ( سلے ہوئے ) کپڑے کا استعمال بھی اس کے لیے جائز تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا کہ ہم سے ہشام بن یوسف نے بیان کیا، انہوں نے کہا کہ مجھے ابن جریج نے خبر دی، انہوں نے کہا کہ مجھ سے محمد بن المنکدر نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے مدینہ میں چار رکعتیں پڑھیں لیکن ذوالحلیفہ میں دو رکعت ادا فرمائیں پھر آپ صلی اللہ علیہ وسلم نے رات وہیں گزاری۔ صبح کے وقت جب آپ صلی اللہ علیہ وسلم اپنی سواری پر سوار ہوئے تو آپ صلی اللہ علیہ وسلم نے لبیک پکاری۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے عبدالوہاب نے بیان کیا، کہ ہم سے ایوب سختیانی نے بیان کیا، ان سے ابوقلابہ نے اور ان سے انس بن مالک نے کہ رسول اللہ صلی اللہ علیہ وسلم نے مدینہ میں ظہر چار رکعت پڑھی لیکن ذوالحلیفہ میں عصر دو رکعت۔ انہوں نے کہا کہ میرا خیال ہے کہ رات صبح تک آپ صلی اللہ علیہ وسلم نے ذوالحلیفہ میں ہی گزار دی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے ابوایوب نے، ان سے ابوقلابہ نے اور ان سے انس بن مالک نے کہ نبی کریم صلی اللہ علیہ وسلم نے نماز ظہر مدینہ منورہ میں چار رکعت پڑھی۔ لیکن نماز عصر ذوالحلیفہ میں دو رکعت پڑھی۔ میں نے خود سنا کہ لوگ بلند آواز سے حج اور عمرہ دونوں کے لیے لبیک کہہ رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم کا تلبیہ یہ تھا «لبيك اللهم لبيك،‏‏‏‏ لبيك لا شريك لك لبيك،‏‏‏‏ إن الحمد والنعمة لك والملك،‏‏‏‏ لا شريك لك‏» ”حاضر ہوں اے اللہ! حاضر ہوں میں، تیرا کوئی شریک نہیں۔ حاضر ہوں، تمام حمد تیرے ہی لیے ہے اور تمام نعمتیں تیری ہی طرف سے ہیں، بادشاہت تیری ہی ہے تیرا کوئی شریک نہیں۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "ہم سے محمد بن یوسف فریابی نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے اعمش سے بیان کیا، ان سے عمارہ نے ان سے ابوعطیہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ میں جانتی ہوں کہ کس طرف نبی کریم صلی اللہ علیہ وسلم تلبیہ کہتے تھے۔ آپ صلی اللہ علیہ وسلم تلبیہ یوں کہتے تھے «لبيك اللهم لبيك،‏‏‏‏ لبيك لا شريك لك لبيك،‏‏‏‏ إن الحمد والنعمة لك‏» ( ترجمہ گزر چکا ہے ) اس کی متابعت سفیان ثوری کی طرح ابومعاویہ نے اعمش سے بھی کی ہے۔ اور شعبہ نے کہا کہ مجھ کو سلیمان اعمش نے خبر دی کہ میں نے خیثمہ سے سنا اور انہوں نے ابوعطیہ سے، انہوں نے عائشہ رضی اللہ عنہا سے سنا۔ پھر یہی حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے وہیب بن خالد نے بیان کیا، کہا کہ ہم سے ایوب سختیانی نے بیان کیا ان سے ابوقلابہ نے اور ان سے انس نے کہ رسول اللہ صلی اللہ علیہ وسلم نے، مدینہ میں ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ تھے ظہر کی نماز چار رکعت پڑھی اور ذوالحلیفہ میں عصر کی نماز دو رکعت۔ آپ صلی اللہ علیہ وسلم رات کو وہیں رہے۔ صبح ہوئی تو مقام بیداء سے سواری پر بیٹھتے ہوئے اللہ تعالیٰ کی حمد، اس کی تسبیح اور تکبیر کہی۔ پھر حج اور عمرہ کے لیے ایک ساتھ احرام باندھا اور لوگوں نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ دونوں کا ایک ساتھ احرام باندھا ( یعنی قران کیا ) جب ہم مکہ آئے تو آپ صلی اللہ علیہ وسلم کے حکم سے ( جن لوگوں نے حج تمتع کا احرام باندھا تھا ان ) سب نے احرام کھول دیا۔ پھر آٹھویں تاریخ میں سب نے حج کا احرام باندھا۔ انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے اپنے ہاتھ سے کھڑے ہو کر بہت سے اونٹ نحر کئے۔ نبی کریم صلی اللہ علیہ وسلم نے ( عید الاضحی کے دن ) مدینہ میں بھی دو چتکبرے سینگوں والے مینڈھے ذبح کئے تھے۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ بعض لوگ اس حدیث کو یوں روایت کرتے ہیں ایوب سے، انہوں نے ایک شخص سے، انہوں نے انس سے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "ہم سے ابوعاصم نے بیان کیا، کہا کہ ہمیں ابن جریج نے خبر دی، کہا کہ مجھے صالح بن کیسان نے خبر دی، انہیں نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ جب رسول اللہ صلی اللہ علیہ وسلم کو لے کر آپ صلی اللہ علیہ وسلم کی سواری پوری طرح کھڑی ہو گئی تھی تو آپ صلی اللہ علیہ وسلم نے اس وقت لبیک پکارا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "اور ابومعمر نے کہا کہ ہم سے عبدالوارث نے بیان کیا، انہوں نے کہا کہ ہم سے ایوب سختیانی نے نافع سے بیان کیا، انہوں نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما جب ذوالحلیفہ میں صبح کی نماز پڑھ چکے تو اپنی اونٹنی پر پالان لگانے کا حکم فرمایا، سواری لائی گئی تو آپ اس پر سوار ہوئے اور جب وہ آپ کو لے کر کھڑی ہو گئی تو آپ کھڑے ہو کر قبلہ رو ہو گئے اور پھر لبیک کہنا شروع کیا تاآنکہ حرم میں داخل ہو گئے۔ وہاں پہنچ کر آپ نے لبیک کہنا بند کر دیا۔ پھر ذی طویٰ میں تشریف لا کر رات وہیں گزارتے صبح ہوتی تو نماز پڑھتے اور غسل کرتے ( پھر مکہ میں داخل ہوتے ) آپ یقین کے ساتھ یہ جانتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اسی طرح کیا تھا۔ عبدالوارث کی طرح اس حدیث کو اسماعیل نے بھی ایوب سے روایت کیا۔ اس میں غسل کا ذکر ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "ہم سے ابوالربیع سلیمان بن داود نے بیان کیا، انہوں نے کہا کہ ہم سے فلیح بن سلیمان نے بیان کیا، ان سے نافع نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما جب مکہ جانے کا ارادہ کرتے تھے پہلے خوشبو کے بغیر تیل استعمال کرتے۔ اس کے بعد مسجد ذوالحلیفہ میں تشریف لاتے یہاں صبح کی نماز پڑھتے، پھر سوار ہوتے، جب اونٹنی آپ کو لے کر پوری طرح کھڑی ہو جاتی تو احرام باندھتے۔ پھر فرماتے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس طرح کرتے دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا کہ ہم سے ابن عدی نے بیان کیا، ان سے عبداللہ بن عون نے ان سے مجاہد نے بیان کیا، کہا کہ ہم عبداللہ بن عباس رضی اللہ عنہما کی خدمت میں حاضر تھے۔ لوگوں نے دجال کا ذکر کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہے کہ اس کی دونوں آنکھوں کے درمیان کافر لکھا ہوا ہو گا۔ تو ابن عباس رضی اللہ عنہما نے فرمایا کہ میں نے تو یہ نہیں سنا۔ ہاں آپ صلی اللہ علیہ وسلم نے یہ فرمایا تھا کہ گویا میں موسیٰ علیہ السلام کو دیکھ رہا ہوں کہ جب آپ نالے میں اترے تو لبیک کہہ رہے ہیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، کہا کہ ہمیں امام مالک نے ابن شہاب سے خبر دی، انہیں عروہ بن زبیر نے، ان سے نبی کریم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ ہم حجتہ الوداع میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ روانہ ہوئے۔ پہلے ہم نے عمرہ کا احرام باندھا لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس کے ساتھ قربانی ہو تو اسے عمرہ کے ساتھ حج کا بھی احرام باندھ لینا چاہئے۔ ایسا شخص درمیان میں حلال نہیں ہو سکتا بلکہ حج اور عمرہ دونوں سے ایک ساتھ حلال ہو گا۔ میں بھی مکہ آئی تھی اس وقت میں حائضہ ہو گئی، اس لیے نہ بیت اللہ کا طواف کر سکی اور نہ صفا اور مروہ کی سعی۔ میں نے اس کے متعلق نبی کریم صلی اللہ علیہ وسلم سے شکوہ کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنا سر کھول ڈال، کنگھا کر اور عمرہ چھوڑ کر حج کا احرام باندھ لے۔ چنانچہ میں نے ایسا ہی کیا پھر جب ہم حج سے فارغ ہو گئے تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے میرے بھائی عبدالرحمٰن بن ابی بکر کے ساتھ تنعیم بھیجا۔ میں نے وہاں سے عمرہ کا احرام باندھا ( اور عمرہ ادا کیا ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ تمہارے اس عمرہ کے بدلے میں ہے۔ ( جسے تم نے چھوڑ دیا تھا ) عائشہ رضی اللہ عنہا نے بیان کیا کہ جن لوگوں نے ( حجۃ الوداع میں ) صرف عمرہ کا احرام باندھا تھا، وہ بیت اللہ کا طواف صفا اور مروہ کی سعی کر کے حلال ہو گئے۔ پھر منیٰ سے واپس ہونے پر دوسرا طواف ( یعنی طواف الزیارۃ ) کیا لیکن جن لوگوں نے حج اور عمرہ کا ایک ساتھ احرام باندھا تھا، انہوں نے صرف ایک ہی طواف کیا یعنی طواف الزیارۃ کیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، ان سے ابن جریج نے، ان سے عطاء بن ابی رباح نے بیان کیا کہ کہ جابر رضی اللہ عنہ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ کو حکم دیا تھا کہ وہ اپنے احرام پر قائم رہیں۔ انہوں نے سراقہ کا قول بھی ذکر کیا تھا۔ اور محمد بن ابی بکر نے ابن جریج سے یوں روایت کیا کہ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا علی! تم نے کس چیز کا احرام باندھا ہے؟ انہوں نے عرض کی نبی کریم صلی اللہ علیہ وسلم نے جس کا احرام باندھا ہو ( اسی کا میں نے بھی باندھا ہے ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر قربانی کر اور اپنی اسی حالت پر احرام جاری رکھ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "ہم سے حسن بن علی خلال ہذلی نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالصمد بن عبدالوارث نے بیان کیا، انہوں نے کہا کہ ہم سے سلیم بن حیان نے بیان کیا، انہوں نے کہا کہ میں نے مروان اصفر سے سنا اور ان سے انس بن مالک نے بیان کیا تھا کہ علی رضی اللہ عنہ یمن سے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ کس طرح کا احرام باندھا ہے؟ انہوں نے کہا کہ جس طرح کا نبی کریم صلی اللہ علیہ وسلم نے باندھا ہو۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر میرے ساتھ قربانی نہ ہوتی تو میں حلال ہو جاتا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "ہم سے محمد بن یوسف فریابی نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے بیان کیا، ان سے قیس بن مسلم نے، ان سے طارق بن شہاب نے اور ان سے ابوموسیٰ اشعری نے کہ مجھے نبی کریم صلی اللہ علیہ وسلم نے میری قوم کے پاس یمن بھیجا تھا۔ جب ( حجۃ الوداع کے موقع پر ) میں آیا تو آپ صلی اللہ علیہ وسلم سے بطحاء میں ملاقات ہوئی۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کس کا احرام باندھا ہے؟ میں نے عرض کی کہ نبی کریم صلی اللہ علیہ وسلم نے جس کا باندھا ہو آپ صلی اللہ علیہ وسلم نے پوچھا کیا تمہارے ساتھ قربانی ہے؟ میں نے عرض کی کہ نہیں، اس لیے آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں بیت اللہ کا طواف، صفا اور مروہ کی سعی کروں چنانچہ میں اپنی قوم کی ایک خاتون کے پاس آیا۔ انہوں نے میرے سر کا کنگھا کیا یا میرا سر دھویا۔ پھر عمر رضی اللہ عنہ کا زمانہ آیا تو آپ نے فرمایا کہ اگر ہم اللہ کی کتاب پر عمل کریں تو وہ یہ حکم دیتی ہے کہ حج اور عمرہ پورا کرو۔ اللہ تعالیٰ فرماتا ہے ”اور حج اور عمرہ پورا کرو اللہ کی رضا کے لیے۔“ اور اگر ہم نبی کریم صلی اللہ علیہ وسلم کی سنت کو لیں تو نبی کریم صلی اللہ علیہ وسلم نے اس وقت تک احرام نہیں کھولا جب تک آپ صلی اللہ علیہ وسلم نے قربانی سے فراغت نہیں حاصل فرمائی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے ابوبکر حنفی نے بیان کیا، کہا کہ ہم سے افلح بن حمید نے بیان کیا، کہا کہ میں نے قاسم بن محمد سے سنا، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کے مہینوں میں حج کی راتوں میں اور حج کے دنوں میں نکلے۔ پھر سرف میں جا کر اترے۔ آپ نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے صحابہ کو خطاب فرمایا جس کے ساتھ ہدی نہ ہو اور وہ چاہتا ہو کہ اپنے احرام کو صرف عمرہ کا بنا لے تو اسے ایسا کر لینا چاہئے لیکن جس کے ساتھ قربانی ہے وہ ایسا نہ کرے۔ عائشہ رضی اللہ عنہا نے بیان فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے بعض اصحاب نے اس فرمان پر عمل کیا اور بعض نے نہیں کیا۔ انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اور آپ کے بعض اصحاب جو استطاعت و حوصلہ والے تھے ( کہ وہ احرام کے ممنوعات سے بچ سکتے تھے۔ ) ان کے ساتھ ہدی بھی تھی، اس لیے وہ تنہا عمرہ نہیں کر سکتے تھے ( پس انہوں نے احرام نہیں کھولا ) عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے تو میں رو رہی تھی۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ ( اے بھولی بھالی عورت! تو ) رو کیوں رہی ہے؟ میں نے عرض کی کہ میں نے آپ کے اپنے صحابہ سے ارشاد کو سن لیا، اب تو میں عمرہ نہ کر سکوں گی۔ آپ صلی اللہ علیہ وسلم نے پوچھا کیا بات ہے؟ میں نے کہا میں نماز پڑھنے کے قابل نہ رہی ( یعنی حائضہ ہو گئی ) آپ صلی اللہ علیہ وسلم نے فرمایا کوئی حرج نہیں۔ آخر تم بھی تو آدم کی بیٹیوں کی طرح ایک عورت ہو اور اللہ نے تمہارے لیے بھی وہ مقدر کیا ہے جو تمام عورتوں کے لیے کیا ہے۔ اس لیے ( عمرہ چھوڑ کر ) حج کرتی رہ اللہ تعالیٰ تمہیں جلد ہی عمرہ کی توفیق دیدے گا۔ عائشہ رضی اللہ عنہا نے یہ بیان کیا کہ ہم حج کے لیے نکلے۔ جب ہم ( عرفات سے ) منیٰ پہنچے تو میں پاک ہو گئی۔ پھر منٰی سے جب میں نکلی تو بیت اللہ کا طواف الزیارۃ کیا۔ آپ نے بیان کیا کہ آخر میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ جب واپس ہونے لگی تو آپ صلی اللہ علیہ وسلم وادی محصب میں آن کر اترے۔ ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ ٹھہرے۔ آپ صلی اللہ علیہ وسلم نے عبدالرحمٰن بن ابی بکر کو بلا کر کہا کہ اپنی بہن کو لے کر حرم سے باہر جا اور وہاں سے عمرہ کا احرام باندھ پھر عمرہ سے فارغ ہو کر تم لوگ یہیں واپس آ جاؤ، میں تمہارا انتظار کرتا رہوں گا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ ہم ( نبی کریم صلی اللہ علیہ وسلم کی ہدایت کے مطابق ) چلے اور جب میں اور میرے بھائی طواف سے فارغ ہو لیے تو میں سحری کے وقت آپ صلی اللہ علیہ وسلم کی خدمت میں پہنچی۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ فارغ ہو لیں؟ میں نے کہا ہاں۔ تب آپ صلی اللہ علیہ وسلم نے اپنے ساتھیوں سے سفر شروع کر دینے کے لیے کہا۔ سفر شروع ہو گیا اور آپ صلی اللہ علیہ وسلم مدینہ منورہ واپس ہو رہے تھے۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ جو «لايضيرک» ہے وہ «ضار يضير ضيراا» سے مشتق ہے ضار يضور ضورا» بھی استعمال ہوتا ہے۔ اور جس روایت میں «لايضرک» ہے وہ «ضر يضر ضرا‏» سے نکلا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے جریر نے بیان کیا، ان سے منصور نے، ان سے ابراہیم نخعی نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے کہ ہم حج کے لیے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے۔ ہماری نیت حج کے سوا اور کچھ نہ تھی۔ جب ہم مکہ پہنچے تو ( اور لوگوں نے ) بیت اللہ کا طواف کیا۔ نبی کریم صلی اللہ علیہ وسلم کا حکم تھا کہ جو قربانی اپنے ساتھ نہ لایا ہو وہ حلال ہو جائے۔ چنانچہ جن کے پاس ہدی نہ تھی وہ حلال ہو گئے۔ ( افعال عمرہ کے بعد ) نبی کریم صلی اللہ علیہ وسلم کی ازواج مطہرات ہدی نہیں لے گئی تھیں، اس لیے انہوں نے بھی احرام کھول ڈالے۔ عائشہ رضی اللہ عنہا نے کہا کہ میں حائضہ ہو گئی تھیں اس لیے بیت اللہ کا طواف نہ کر سکی ( یعنی عمرہ چھوٹ گیا اور حج کرتی چلی گئی ) جب محصب کی رات آئی، میں نے کہا یا رسول اللہ! اور لوگ تو حج اور عمرہ دونوں کر کے واپس ہو رہے ہیں لیکن میں صرف حج کر سکی ہوں۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب ہم مکہ آئے تھے تو تم طواف نہ کر سکی تھی؟ میں نے کہا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے بھائی کے ساتھ تنعیم تک چلی جا اور وہاں سے عمرہ کا احرام باندھ ( پھر عمرہ ادا کر ) ہم لوگ تمہارا فلاں جگہ انتظار کریں گے اور صفیہ رضی اللہ عنہا نے کہا کہ معلوم ہوتا ہے میں بھی آپ ( لوگوں ) کو روکنے کا سبب بن جاؤں گی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا «عقرى حلقى» کیا تو نے یوم نحر کا طواف نہیں کیا تھا؟ انہوں نے کہا کیوں نہیں میں تو طواف کر چکی ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا پھر کوئی حرج نہیں چل کوچ کر۔ عائشہ رضی اللہ عنہا نے کہا کہ پھر میری ملاقات نبی کریم صلی اللہ علیہ وسلم سے ہوئی تو آپ صلی اللہ علیہ وسلم مکہ سے جاتے ہوئے اوپر کے حصہ پر چڑھ رہے تھے اور میں نشیب میں اتر رہی تھی یا یہ کہا کہ میں اوپر چڑھ رہی تھی اور نبی کریم صلی اللہ علیہ وسلم اس چڑھاؤ کے بعد اتر رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا کہ ہمیں امام مالک نے خبر دی، انہیں ابوالاسود محمد بن عبدالرحمٰن بن نوفل نے، انہیں عروہ بن زبیر نے اور ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ ہم حجتہ الوداع کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چلے۔ کچھ لوگوں نے عمرہ کا احرام باندھا تھا، کچھ نے حج اور عمرہ دونوں کا اور کچھ نے صرف حج کا۔ رسول اللہ صلی اللہ علیہ وسلم نے ( پہلے ) صرف حج کا احرام باندھا تھا، پھر آپ صلی اللہ علیہ وسلم نے عمرہ بھی شریک کر لیا، پھر جن لوگوں نے حج کا احرام باندھا تھا یا حج اور عمرہ دونوں کا، ان کا احرام دسویں تاریخ تک نہ کھل سکا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "ہم سے محمد بن بشار نے بیان کیا، انہوں نے کہا کہ ہم سے غندر نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے حکم نے، ان سے علی بن حسین (زین العابدین) نے اور ان سے مروان بن حکم نے بیان کیا کہ عثمان اور علی رضی اللہ عنہما کو میں نے دیکھا ہے۔ عثمان رضی اللہ عنہ حج اور عمرہ کو ایک ساتھ ادا کرنے سے روکتے تھے لیکن علی رضی اللہ عنہ نے اس کے باوجود دونوں کا ایک ساتھ احرام باندھا اور کہا «لبيك بعمرة وحجة» آپ نے فرمایا تھا کہ میں کسی ایک شخص کی بات پر رسول اللہ صلی اللہ علیہ وسلم کی حدیث کو نہیں چھوڑ سکتا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے وہیب بن خالد نے بیان کیا، کہا کہ ہم سے عبداللہ بن طاؤس نے بیان کیا، ان سے ان کے باپ اور ان سے ابن عباس رضی اللہ عنہما نے کہ عرب سمجھتے تھے کہ حج کے دنوں میں عمرہ کرنا روئے زمین پر سب سے بڑا گناہ ہے۔ یہ لوگ محرم کو صفر بنا لیتے اور کہتے کہ جب اونٹ کی پیٹھ سستا لے اور اس پر خوب بال اگ جائیں اور صفر کا مہینہ ختم ہو جائے ( یعنی حج کے ایام گزر جائیں ) تو عمرہ حلال ہوتا ہے۔ پھر جب نبی کریم صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ چوتھی کی صبح کو حج کا احرام باندھے ہوئے آئے تو آپ صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ اپنے حج کو عمرہ بنا لیں، یہ حکم ( عرب کے پرانے رواج کی بنا پر ) عام صحابہ پر بڑا بھاری گزرا۔ انہوں نے پوچھا یا رسول اللہ! عمرہ کر کے ہمارے لیے کیا چیز حلال ہو گئی؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمام چیزیں حلال ہو جائیں گی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا کہ ہم سے محمد بن جعفر غندر نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے قیس بن مسلم نے، ان سے طارق بن شہاب نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( حجتہ الوداع کے موقع پر یمن سے ) حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے ( مجھ کو عمرہ کے بعد ) احرام کھول دینے کا حکم دیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا (دوسری سند) اور امام بخاری رحمہ اللہ نے کہا کہ ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی، انہیں نافع نے اور انہیں ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حفصہ رضی اللہ عنہا نے بیان کیا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے دریافت کیا یا رسول اللہ! کیا بات ہے اور لوگ تو عمرہ کر کے حلال ہو گئے لیکن آپ حلال نہیں ہوئے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اپنے سر کی تلبید ( بالوں کو جمانے کے لیے ایک لیس دار چیز کا استعمال کرنا ) کی ہے اور اپنے ساتھ ہدی ( قربانی کا جانور ) لایا ہوں اس لیے میں قربانی کرنے سے پہلے احرام نہیں کھول سکتا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، کہا کہ ہم سے ابوجمرہ نصر بن عمران ضبعی نے بیان کیا، انہوں نے کہا کہ میں نے حج اور عمرہ کا ایک ساتھ احرام باندھا تو کچھ لوگوں نے مجھے منع کیا۔ اس لیے میں نے ابن عباس رضی اللہ عنہما سے اس کے متعلق دریافت کیا۔ آپ نے تمتع کرنے کے لیے کہا۔ پھر میں نے ایک شخص کو دیکھا کہ مجھ سے کہہ رہا ہے ”حج بھی مبرور ہوا اور عمرہ بھی قبول ہوا“ میں نے یہ خواب ابن عباس رضی اللہ عنہما کو سنایا، تو آپ نے فرمایا کہ یہ نبی کریم صلی اللہ علیہ وسلم کی سنت ہے۔ پھر آپ نے فرمایا کہ میرے یہاں قیام کر، میں اپنے پاس سے تمہارے لیے کچھ مقرر کر کے دیا کروں گا۔ شعبہ نے بیان کیا کہ میں نے ( ابوجمرہ سے ) پوچھا کہ ابن عباس رضی اللہ عنہما نے یہ کیوں کیا تھا؟ ( یعنی مال کس بات پر دینے کے لیے کہا ) انہوں نے بیان کیا کہ اسی خواب کی وجہ سے جو میں نے دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "ہم سے ابونعیم نے بیان کیا، ان سے ابوشہاب نے کہا کہ میں تمتع کی نیت سے عمرہ کا احرام باندھ کے یوم ترویہ سے تین دن پہلے مکہ پہنچا۔ اس پر مکہ کے کچھ لوگوں نے کہا اب تمہارا حج مکی ہو گا۔ میں عطاء بن ابی رباح کی خدمت میں حاضر ہوا۔ یہی پوچھنے کے لیے۔ انہوں نے فرمایا کہ مجھ سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ وہ حج کیا تھا جس میں آپ صلی اللہ علیہ وسلم اپنے ساتھ قربانی کے اونٹ لائے تھے ( یعنی حجتہ الوداع ) صحابہ نے صرف مفرد حج کا احرام باندھا تھا۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ ( عمرہ کا احرام باندھ لو اور ) بیت اللہ کے طواف اور صفا مروہ کی سعی کے بعد اپنے احرام کھول ڈالو اور بال ترشوا لو۔ یوم ترویہ تک برابر اسی طرح حلال رہو، پھر یوم ترویہ میں مکہ ہی سے حج کا احرام باندھو اور اس طرح اپنے حج مفرد کو جس کی تم نے پہلے نیت کی تھی، اب اسے تمتع بنا لو۔ صحابہ نے عرض کی کہ ہم اسے تمتع کیسے بنا سکتے ہیں؟ ہم تو حج کا احرام باندھ چکے ہیں۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس طرح میں کہہ رہا ہوں ویسے ہی کرو۔ اگر میرے ساتھ ہدی نہ ہوتی تو خود میں بھی اسی طرح کرتا جس طرح تم سے کہہ رہا ہوں۔ لیکن میں کیا کروں اب میرے لیے کوئی چیز اس وقت تک حلال نہیں ہو سکتی جب تک میرے قربانی کے جانوروں کی قربانی نہ ہو جائے۔ چنانچہ صحابہ نے آپ کے حکم کی تعمیل کی۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ ابوشہاب کی اس حدیث کے سوا اور کوئی مرفوع حدیث مروی نہیں ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے حجاج بن محمد اعور نے بیان کیا، ان سے شعبہ نے، ان سے عمرو بن مرہ نے، ان سے سعید بن مسیب نے کہ عثمان اور علی رضی اللہ عنہما عسفان آئے تو ان میں باہم تمتع کے سلسلے میں اختلاف ہوا تو علی رضی اللہ عنہ نے فرمایا کہ جس کو رسول اللہ صلی اللہ علیہ وسلم نے کیا ہے اس سے آپ کیوں روک رہے ہیں؟ اس پر عثمان رضی اللہ عنہ نے فرمایا کہ مجھے اپنے حال پر رہنے دو۔ یہ دیکھ کر علی رضی اللہ عنہ نے حج اور عمرہ دونوں کا احرام ایک ساتھ باندھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے ایوب سختیانی نے، کہا کہ میں نے مجاہد سے سنا، انہوں نے کہا ہم سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا انہوں نے کہا کہ جب ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آئے تو ہم نے حج کی لبیک پکاری۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا ہم نے اسے عمرہ بنا لیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے ہمام بن یحییٰ نے قتادہ سے بیان کیا کہا کہ مجھ سے مطرف نے عمران بن حصین سے بیان کیا، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ہم نے تمتع کیا تھا اور خود قرآن میں تمتع کا حکم نازل ہوا تھا۔ اب ایک شخص نے اپنی رائے سے جو چاہا کہہ دیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "اور ابو کامل فضیل بن حسین بصریٰ نے کہا کہ ہم سے ابومعشر یوسف بن یزید براء نے بیان کیا، کہا کہ ہم سے عثمان بن غیاث نے بیان کیا، ان سے عکرمہ نے، ان سے ابن عباس رضی اللہ عنہما نے، ابن عباس رضی اللہ عنہما سے حج میں تمتع کے متعلق پوچھا گیا۔ آپ نے فرمایا کہ حجۃ الوداع کے موقع پر مہاجرین انصار نبی کریم صلی اللہ علیہ وسلم کی ازواج اور ہم سب نے احرام باندھا تھا۔ جب ہم مکہ آئے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے احرام کو حج اور عمرہ دونوں کے لیے کر لو لیکن جو لوگ قربانی کا جانور اپنے ساتھ لائے ہیں۔ ( وہ عمرہ کرنے کے بعد حلال نہیں ہوں گے ) چنانچہ ہم نے بیت اللہ کا طواف اور صفا و مروہ کی سعی کر لی تو اپنا احرام کھول ڈالا اور ہم اپنی بیویوں کے پاس گئے اور سلے ہوئے کپڑے پہنے۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جس کے ساتھ قربانی کا جانور ہے وہ اس وقت تک حلال نہیں ہو سکتا جب تک ہدی اپنی جگہ نہ پہنچ لے ( یعنی قربانی نہ ہولے ) ہمیں ( جنہوں نے ہدی ساتھ نہیں لی تھی ) آپ صلی اللہ علیہ وسلم نے آٹھویں تاریخ کی شام کو حکم دیا کہ ہم حج کا احرام باندھ لیں۔ پھر جب ہم مناسک حج سے فارغ ہو گئے تو ہم نے آ کر بیت اللہ کا طواف اور صفا مروہ کی سعی کی، پھر ہمارا حج پورا ہو گیا اور اب قربانی ہم پر لازم ہوئی۔ جیسا کہ اللہ تعالیٰ کا ارشاد ہے ”جسے قربانی کا جانور میسر ہو ( تو وہ قربانی کرے ) اور اگر کسی کو قربانی کی طاقت نہ ہو تو تین روزے حج میں اور سات دن گھر واپس ہونے پر رکھے ( قربانی میں ) بکری بھی کافی ہے۔ تو لوگوں نے حج اور عمرہ دونوں عبادتیں ایک ہی سال میں ایک ساتھ ادا کیں۔ کیونکہ اللہ تعالیٰ نے خود اپنی کتاب میں یہ حکم نازل کیا تھا اور رسول اللہ صلی اللہ علیہ وسلم نے اس پر خود عمل کر کے تمام لوگوں کے لیے جائز قرار دیا تھا۔ البتہ مکہ کے باشندوں کا اس سے استثناء ہے۔ کیونکہ اللہ تعالیٰ کا فرمان ہے ”یہ حکم ان لوگوں کے لیے ہے جن کے گھر والے مسجد الحرام کے پاس رہنے والے نہ ہوں“۔ اور حج کے جن مہینوں کا قرآن میں ذکر ہے وہ شوال، ذیقعدہ اور ذی الحجہ ہیں۔ ان مہینوں میں جو کوئی بھی تمتع کرے وہ یا قربانی دے یا اگر مقدور نہ ہو تو روزے رکھے۔ اور «رفث» کا معنی جماع ( یا فحش باتیں ) اور «فسوق» گناہ اور «جدال» لوگوں سے جھگڑنا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "ہم سے یعقوب بن ابراہیم نے بیان کیا، ان سے اسماعیل بن علیہ نے بیان کیا، انہیں ایوب سختیانی نے خبر دی، انہیں نافع نے، انہوں نے بیان کیا کہ جب عبداللہ بن عمر رضی اللہ عنہما حرم کی سرحد کے قریب پہنچتے تو تلبیہ کہنا بند کر دیتے۔ رات ذی طویٰ میں گزارتے، صبح کی نماز وہیں پڑھتے اور غسل کرتے ( پھر مکہ میں داخل ہوتے ) آپ بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم بھی اسی طرح کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ قطان نے بیان کیا، انہوں نے کہا کہ ہم سے عبیداللہ عمری نے بیان کیا، ان سے نافع نے ابن عمر رضی اللہ عنہما سے بیان کیا، آپ رضی اللہ عنہ نے فرمایا کہ کہ نبی کریم صلی اللہ علیہ وسلم نے ذی طویٰ میں رات گزاری۔ پھر جب صبح ہوئی تو آپ صلی اللہ علیہ وسلم مکہ میں داخل ہوئے۔ ابن عمر رضی اللہ عنہما بھی اسی طرح کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، ان سے معن بن عیسیٰ نے بیان کیا، ان سے امام مالک رحمہ اللہ نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم مکہ میں بلند گھاٹی ( یعنی جنت المعلیٰ ) کی طرف سے داخل ہوتے اور نکلتے ”ثنیہ سفلیٰ“ کی طرف سے یعنی نیچے کی گھاٹی ( باب شبیکہ ) کی طرف سے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "ہم سے مسدد بن مسرہد بصریٰ نے بیان کیا، انہوں نے کہا ہم سے یحییٰ قطان نے بیان کیا، ان سے عبیداللہ عمری نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم «الثنية العليا» یعنی مقام کداء کی طرف سے داخل ہوتے جو بطحاء میں ہے اور «الثنية السفلى‏.» کی طرف سے نکلتے تھے یعنی نیچے والی گھاٹی کی طرف سے۔ امام بخاری رحمہ اللہ نے کہا مسدد اسم بامسمی تھے یعنی مسدد کے معنی عربی زبان میں مضبوط اور درست کے ہیں تو حدیث کی روایت میں مضبوط اور درست تھے اور میں نے یحییٰ بن معین سے سنا وہ کہتے ہیں میں نے یحییٰ قطان سے سنا، وہ کہتے تھے اگر میں مسدد کے گھر جا کر ان کو حدیث سنایا کرتا تو وہ اس کے لائق تھے اور میری کتابیں حدیث کی میرے پاس رہیں یا مسدد کے پاس مجھے کچھ پرواہ نہیں۔ گویا یحییٰ قطان نے مسدد کی بےحد تعریف کی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "ہم سے حمیدی اور محمد بن مثنیٰ نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے، ان سے عائشہ رضی اللہ عنہا نے کہ جب رسول اللہ صلی اللہ علیہ وسلم مکہ میں تشریف لائے تو اوپر کی بلند جانب سے شہر کے اندر داخل ہوئے اور ( مکہ سے ) واپس جب گئے تو نیچے کی طرف سے نکل گئے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "ہم سے محمود بن غیلان مروزی نے بیان کیا، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا، انہوں نے کہا کہ ہم سے ہشام بن عروہ نے بیان کیا۔ ان سے ان کے والد عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے موقع پر شہر میں کداء کی طرف سے داخل ہوئے اور کدیٰ کی طرف سے نکلے جو مکہ کے بلند جانب ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "ہم سے احمد بن عیسیٰ نے بیان کیا، کہا کہ ہم سے عبداللہ ابن وہب نے بیان کیا، کہا کہ ہمیں عمرو بن حارث نے خبر دی اور انہیں ہشام بن عروہ نے، انہیں ان کے والد عروہ بن زبیر نے اور انہیں عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم فتح مکہ موقع پر داخل ہوتے وقت مکہ کے بالائی علاقہ کداء سے داخل ہوئے۔ ہشام نے بیان کیا کہ عروہ اگرچہ کداء اور کدیٰ دونوں طرف سے داخل ہوتے تھے لیکن اکثر کدیٰ سے داخل ہوتے کیونکہ یہ راستہ ان کے گھر سے قریب تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، انہوں نے کہا کہ ہم سے حاتم بن اسماعیل نے ہشام سے بیان کیا، ان سے عروہ نے بیان کیاکہ نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے موقع پر مکہ کے بالائی علاقہ کداء کی طرف سے داخل ہوئے تھے۔ لیکن عروہ اکثر کدیٰ کی طرف سے داخل ہوتے تھے کیونکہ یہ راستہ ان کے گھر سے قریب تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے وہیب بن خالد نے بیان کیا کہا کہ ہم سے ہشام نے اپنے باپ سے بیان کیا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے موقع پر کداء سے داخل ہوئے تھے۔ عروہ خود اگرچہ دونوں طرف سے ( کداء اور کدیٰ ) داخل ہوتے لیکن اکثر آپ کدیٰ کی طرف سے داخل ہوتے تھے کیونکہ یہ راستہ ان کے گھر سے قریب تھا۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ کداء اور کدیٰ دو مقامات کے نام ہیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا کہ ہم سے ابوعاصم نبیل نے بیان کیا، کہا کہ مجھے ابن جریج نے خبر دی، کہا کہ مجھے عمرو بن دینار نے خبر دی، کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ ( زمانہ جاہلیت میں ) جب کعبہ کی تعمیر ہوئی تو نبی کریم صلی اللہ علیہ وسلم اور عباس رضی اللہ عنہ بھی پتھر اٹھا کر لا رہے تھے۔ عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہا کہ اپنا تہبند اتار کر کاندھے پر ڈال لو ( تاکہ پتھر اٹھانے میں تکلیف نہ ہو ) نبی کریم صلی اللہ علیہ وسلم نے ایسا کیا تو ننگے ہوتے ہی بیہوش ہو کر آپ زمین پر گر پڑے اور آپ کی آنکھیں آسمان کی طرف لگ گئیں۔ آپ کہنے لگے مجھے میرا تہبند دے دو۔ پھر آپ صلی اللہ علیہ وسلم نے اسے مضبوط باندھ لیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک رحمہ اللہ نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے سالم بن عبداللہ نے کہ عبداللہ بن محمد بن ابی بکر نے انہیں خبر دی، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی عائشہ صدیقہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تجھے معلوم ہے جب تیری قوم نے کعبہ کی تعمیر کی تو بنیاد ابراہیم کو چھوڑ دیا تھا۔ میں نے عرض کیا یا رسول اللہ! پھر آپ بنیاد ابراہیم پر اس کو کیوں نہیں بنا دیتے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تمہاری قوم کا زمانہ کفر سے بالکل نزدیک نہ ہوتا تو میں بیشک ایسا کر دیتا۔ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ اگر عائشہ صدیقہ رضی اللہ عنہا نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے ( اور یقیناً عائشہ رضی اللہ عنہا سچی ہیں ) تو میں سمجھتا ہوں یہی وجہ تھی جو نبی کریم صلی اللہ علیہ وسلم حطیم سے متصل جو دیواروں کے کونے ہیں ان کو نہیں چومتے تھے۔ کیونکہ خانہ کعبہ ابراہیمی بنیادوں پر پورا نہ ہوا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا کہ ہم سے ابوالاحوص سلام بن سلیم جعفی نے بیان کیا، ان سے اشعت نے بیان کیا، ان سے اسود بن یزید نے اور ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ کیا حطیم بھی بیت اللہ میں داخل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں، پھر میں نے پوچھا کہ پھر لوگوں نے اسے کعبے میں کیوں نہیں شامل کیا؟ آپ صلی اللہ علیہ وسلم نے جواب دیا کہ تمہاری قوم کے پاس خرچ کی کمی پڑ گئی تھی۔ پھر میں نے پوچھا کہ یہ دروازہ کیوں اونچا بنایا؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ بھی تمہاری قوم ہی نے کیا تاکہ جسے چاہیں اندر آنے دیں اور جسے چاہیں روک دیں۔ اگر تمہاری قوم کی جاہلیت کا زمانہ تازہ تازہ نہ ہوتا اور مجھے اس کا خوف نہ ہوتا کہ ان کے دل بگڑ جائیں گے تو اس حطیم کو بھی میں کعبہ میں شامل کر دیتا اور کعبہ کا دروازہ زمین کے برابر کر دیتا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا، ان سے ہشام نے بیان کیا، ان سے ان کے والد نے اور ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا، اگر تمہاری قوم کا زمانہ کفر سے ابھی تازہ نہ ہوتا تو میں خانہ کعبہ کو توڑ کر اسے ابراہیم علیہ السلام کی بنیاد پر بناتا کیونکہ قریش نے اس میں کمی کر دی ہے۔ اس میں ایک دروازہ اور اس دروازے کے مقابل رکھتا۔ ابومعاویہ نے کہا ہم سے ہشام نے بیان کیا۔ حدیث میں «خلف» سے دروازہ مراد ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "ہم سے بیان بن عمرو نے بیان کیا، انہوں نے کہا کہ ہم سے یزید بن ہارون نے بیان کیا، انہوں نے کہا کہ ہم سے جریر بن حازم نے بیان کیا، انہوں نے کہا کہ ہم سے یزید بن رومان نے بیان کیا، ان سے عروہ نے اور ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، عائشہ! اگر تیری قوم کا زمانہ جاہلیت ابھی تازہ نہ ہوتا، تو میں بیت اللہ کو گرانے کا حکم دے دیتا تاکہ ( نئی تعمیر میں ) اس حصہ کو بھی داخل کر دوں جو اس سے باہر رہ گیا ہے اور اس کی کرسی زمین کے برابر کر دوں اور اس کے دو دروازے بنا دوں، ایک مشرق میں اور ایک مغرب میں۔ اس طرح ابراہیم علیہ السلام کی بنیاد پر اس کی تعمیر ہو جاتی۔ عبداللہ بن زبیر رضی اللہ عنہما کا کعبہ کو گرانے سے یہی مقصد تھا۔ یزید نے بیان کیا کہ میں اس وقت موجود تھا جب عبداللہ بن زبیر رضی اللہ عنہما نے اسے گرایا تھا اور اس کی نئی تعمیر کر کے حطیم کو اس کے اندر کر دیا تھا۔ میں نے ابراہیم علیہ السلام کی تعمیر کے پائے بھی دیکھے جو اونٹ کی کوہان کی طرح تھے۔ جریر بن حازم نے کہا کہ میں نے ان سے پوچھا، ان کی جگہ کہاں ہے؟ انہوں نے فرمایا کہ میں ابھی دکھاتا ہوں۔ چنانچہ میں ان کے ساتھ حطیم میں گیا اور آپ نے ایک جگہ کی طرف اشارہ کر کے کہا کہ یہ وہ جگہ ہے۔ جریر نے کہا کہ میں نے اندازہ لگایا کہ وہ جگہ حطیم میں سے چھ ہاتھ ہو گی یا ایسی ہی کچھ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "ہم سے علی بن عبداللہ بن جعفر نے بیان کیا، کہا کہ ہم سے جریر بن عبدالحمید نے منصور سے بیان کیا ان سے مجاہد نے، ان سے طاؤس نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ پر فرمایا تھا کہ اللہ تعالیٰ نے اس شہر ( مکہ ) کو حرمت والا بنایا ہے ( یعنی عزت دی ہے ) پس اس کے ( درختوں کے ) کانٹے تک بھی نہیں کاٹے جا سکتے یہاں کے شکار بھی نہیں ہنکائے جا سکتے۔ اور ان کے علاوہ جو اعلان کر کے ( مالک تک پہنچانے کا ارادہ رکھتے ہوں ) کوئی شخص یہاں کی گری پڑی چیز بھی نہیں اٹھا سکتا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "ہم سے اصبغ بن فرج نے بیان کیا، انہوں نے کہا کہ مجھے عبداللہ بن وہب نے خبر دی، انہیں یونس نے، انہیں ابن شہاب نے، انہیں علی بن حسین نے، انہیں عمرو بن عثمان نے اور انہیں اسامہ بن زید رضی اللہ عنہما نے کہ انہوں نے پوچھا یا رسول اللہ! آپ مکہ میں کیا اپنے گھر میں قیام فرمائیں گے۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ عقیل نے ہمارے لیے محلہ یا مکان چھوڑا ہی کب ہے۔ ( سب بیچ کھوچ کر برابر کر دئیے ) عقیل اور طالب، ابوطالب کے وارث ہوئے تھے۔ جعفر اور علی رضی اللہ عنہما کو وراثت میں کچھ نہیں ملا تھا، کیونکہ یہ دونوں مسلمان ہو گئے تھے اور عقیل رضی اللہ عنہ ( ابتداء میں ) اور طالب اسلام نہیں لائے تھے۔ اسی بنیاد پر عمر بن خطاب رضی اللہ عنہ فرمایا کرتے تھے کہ مسلمان کافر کا وارث نہیں ہوتا۔ ابن شہاب نے کہا کہ لوگ اللہ تعالیٰ کے اس ارشاد سے دلیل لیتے ہیں کہ ”جو لوگ ایمان لائے، ہجرت کی اور اپنے مال اور جان کے ساتھ اللہ کی راہ میں جہاد کیا اور وہ لوگ جنہوں نے پناہ دی اور مدد کی، وہی ایک دوسرے کے وارث ہوں گے۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے خبر دی، انہیں زہری نے کہا کہ مجھ سے ابوسلمہ نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے جب ( منیٰ سے لوٹتے ہوئے حجتہ الوداع کے موقع پر ) مکہ آنے کا ارادہ کیا تو فرمایا کہ کل ان شاءاللہ ہمارا قیام اسی خیف بنی کنانہ ( یعنی محصب ) میں ہو گا جہاں ( قریش نے ) کفر پر اڑے رہنے کی قسم کھائی تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "ہم سے حمیدی نے بیان کیا، انہوں نے کہا کہ ہم سے ولید بن مسلم نے بیان کیا، انہوں نے کہا کہ ہم سے امام اوزاعی نے بیان کیا، انہوں نے کہا کہ مجھ سے زہری نے بیان کیا، ان سے ابوسلمہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ گیارہویں کی صبح کو جب نبی کریم صلی اللہ علیہ وسلم منیٰ میں تھے تو یہ فرمایا تھا کہ کل ہم خیف بنی کنانہ میں قیام کریں گے جہاں قریش نے کفر کی حمایت کی قسم کھائی تھی۔ آپ صلی اللہ علیہ وسلم کی مراد محصب سے تھی کیونکہ یہیں قریش اور کنانہ نے بنو ہاشم اور بنو عبدالمطلب یا ( راوی نے ) بنوالمطلب ( کہا ) کے خلاف حلف اٹھایا تھا کہ جب تک وہ نبی کریم صلی اللہ علیہ وسلم کو ان کے حوالہ نہ کر دیں، ان کے یہاں شادی بیاہ نہ کریں گے اور نہ ان سے خرید و فروخت کریں گے۔ اور سلامہ بن روح نے عقیل اور یحییٰ بن ضحاک سے روایت کیا، ان سے امام اوزاعی نے بیان کیا کہ مجھے ابن شہاب نے خبر دی، انہوں نے ( اپنی روایت میں ) بنو ہاشم اور بنوالمطلب کہا۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ بنوالمطلب زیادہ صحیح ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، انہوں نے کہا ہم سے زیاد بن سعد نے بیان کیا، ان سے زہری نے بیان کیا، ان سے سعید بن مسیب نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ”کعبہ کو دو پتلی پنڈلیوں والا ایک حقیر حبشی تباہ کر دے گا۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا کہ ہم سے لیث نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا (دوسری سند امام بخاری رحمہ اللہ نے کہا) اور مجھ سے محمد بن مقاتل نے بیان کیا، انہوں نے کہا کہ مجھ سے عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہمیں محمد بن ابی حفصہ نے خبر دی، انہیں زہری نے، انہیں عروہ نے اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان فرمایا کہ رمضان ( کے روزے ) فرض ہونے سے پہلے مسلمان عاشوراء کا روزہ رکھتے تھے۔ عاشوراء ہی کے دن ( جاہلیت میں ) کعبہ پر غلاف چڑھایا جاتا تھا۔ پھر جب اللہ تعالیٰ نے رمضان فرض کر دیا تو رسول اللہ صلی اللہ علیہ وسلم نے لوگوں سے فرمایا کہ ”اب جس کا جی چاہے عاشوراء کا روزہ رکھے اور جس کا جی چاہے چھوڑ دے۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "ہم سے احمد بن حفص نے بیان کیا، کہا کہ ہم سے میرے والد نے بیان کیا، کہا کہ ہم سے ابراہیم بن طہمان نے بیان کیا، ان سے حجاج بن حجاج اسلمی نے، ان سے قتادہ نے، ان سے عبداللہ بن ابی عتبہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا بیت اللہ کا حج اور عمرہ یاجوج اور ماجوج کے نکلنے کے بعد بھی ہوتا رہے گا۔ عبداللہ بن ابی عتبہ کے ساتھ اس حدیث کو ابان اور عمران نے قتادہ سے روایت کیا اور عبدالرحمٰن نے شعبہ کے واسطہ سے یوں بیان کیا کہ قیامت اس وقت تک قائم نہیں ہو گی جب تک بیت اللہ کا حج بند نہ ہو جائے۔ امام بخاری رحمہ اللہ نے کہا کہ پہلی روایت زیادہ راویوں نے کی ہے اور قتادہ نے عبداللہ بن عتبہ سے سنا اور عبداللہ نے ابو سعید خدری رضی اللہ عنہ سے سنا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، کہا کہ ہم سے خالد بن حارث نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے بیان کیا، کہا کہ ہم سے واصل احدب نے بیان کیا اور ان سے ابووائل نے بیان کیا کہ میں شیبہ کی خدمت میں حاضر ہوا (دوسری سند) اور ہم سے قبیصہ نے بیان کیا، کہا کہ ہم سے سفیان نے واصل سے بیان کیا اور ان سے ابووائل نے بیان کیا کہ میں شیبہ کے ساتھ کعبہ میں کرسی پر بیٹھا ہوا تھا تو شیبہ نے فرمایا کہ اسی جگہ بیٹھ کر عمر رضی اللہ عنہ نے ( ایک مرتبہ ) فرمایا کہ میرا ارادہ یہ ہوتا ہے کہ کعبہ کے اندر جتنا سونا چاندی ہے اسے نہ چھوڑوں ( جسے زمانہ جاہلیت میں کفار نے جمع کیا تھا ) بلکہ سب کو نکال کر ( مسلمانوں میں ) تقسیم کر دوں۔ میں نے عرض کی کہ آپ کے ساتھیوں ( نبی کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ ) نے تو ایسا نہیں کیا۔ انہوں نے فرمایا کہ میں بھی انہیں کی پیروی کر رہا ہوں ( اسی لیے میں اس کے ہاتھ نہیں لگاتا ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "ہم سے عمرو بن علی فلاس نے بیان کیا، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا، کہا کہ ہم سے عبیداللہ بن اخنس نے بیان کیا، کہا کہ مجھ سے ابن ابی ملیکہ نے بیان کیا، ان سے عبداللہ بن عباس رضی اللہ عنہما نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”گویا میری نظروں کے سامنے وہ پتلی ٹانگوں والا سیاہ آدمی ہے جو خانہ کعبہ کے ایک ایک پتھر کو اکھاڑ پھینکے گا۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا، ان سے یونس نے، ان سے ابن شہاب نے، ان سے سعید بن مسیب نے کہ ابوہریرہ رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کعبہ کو دو پتلی پنڈلیوں والا حبشی خراب کرے گا۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": 1597,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، انہوں نے کہا کہ ہمیں سفیان ثوری نے خبر دی، انہیں اعمش نے، انہیں ابراہیم نے، انہیں عابس بن ربیعہ نے کہ عمر رضی اللہ عنہ حجر اسود کے پاس آئے اور اسے بوسہ دیا اور فرمایا ”میں خوب جانتا ہوں کہ تو صرف ایک پتھر ہے، نہ کسی کو نقصان پہنچا سکتا ہے نہ نفع۔ اگر رسول اللہ صلی اللہ علیہ وسلم کو تجھے بوسہ دیتے ہوئے میں نہ دیکھتا تو میں بھی کبھی تجھے بوسہ نہ دیتا۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے لیث بن سعد نے بیان کیا، ان سے ابن شہاب نے، ان سے سالم نے اور ان سے ان کے باپ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اور اسامہ بن زید اور بلال و عثمان بن ابی طلحہ رضی اللہ عنہم چاروں خانہ کعبہ کے اندر گئے اور اندر سے دروازہ بند کر لیا۔ پھر جب دروازہ کھولا تو میں پہلا شخص تھا جو اندر گیا۔ میری ملاقات بلال رضی اللہ عنہ سے ہوئی۔ میں نے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم نے ( اندر ) نماز پڑھی ہے؟ انہوں نے بتلایا کہ ”ہاں! دونوں یمنی ستونوں کے درمیان آپ صلی اللہ علیہ وسلم نے نماز پڑھی ہے۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "ہم سے احمد بن محمد نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہمیں موسیٰ بن عقبہ نے خبر دی، انہیں نافع نے کہ عبداللہ بن عمر رضی اللہ عنہما جب کعبہ کے اندر داخل ہوتے تو سامنے کی طرف چلتے اور دروازہ پیٹھ کی طرف چھوڑ دیتے۔ آپ اسی طرح چلتے رہتے اور جب سامنے کی دیوار تقریباً تین ہاتھ رہ جاتی تو نماز پڑھتے تھے۔ اس طرح آپ اس جگہ نماز پڑھنے کا اہتمام کرتے تھے جس کے متعلق بلال رضی اللہ عنہ سے معلوم ہوا تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے وہیں نماز پڑھی تھی۔ لیکن اس میں کوئی حرج نہیں کعبہ میں جس جگہ بھی کوئی چاہے نماز پڑھ لے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے خالد بن عبداللہ نے بیان کیا، انہیں اسماعیل بن ابی خالد نے خبر دی، انہیں عبداللہ ابن ابی اوفی نے کہ رسول اللہ صلی اللہ علیہ وسلم نے عمرہ کیا تو آپ صلی اللہ علیہ وسلم نے کعبہ کا طواف کر کے مقام ابراہیم کے پیچھے دو رکعتیں پڑھیں۔ آپ صلی اللہ علیہ وسلم کے ساتھ کچھ لوگ تھے جو آپ صلی اللہ علیہ وسلم کے اور لوگوں کے درمیان آڑ بنے ہوئے تھے۔ ان میں سے ایک صاحب نے ابن ابی اوفی سے پوچھا کیا رسول اللہ صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے تھے تو انہوں نے بتایا کہ ”نہیں۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "ہم سے ابومعمر نے بیان کیا، کہا کہ ہم سے عبدالوارث نے بیان کیا، کہا کہ ہم سے ایوب نے بیان کیا، کہا کہ ہم سے عکرمہ نے ابن عباس رضی اللہ عنہما سے بیان کیا، آپ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم جب ( فتح مکہ کے دن ) تشریف لائے تو آپ صلی اللہ علیہ وسلم نے کعبہ کے اندر جانے سے اس لیے انکار فرمایا کہ اس میں بت رکھے ہوئے تھے۔ پھر آپ صلی اللہ علیہ وسلم نے حکم دیا اور وہ نکالے گئے، لوگوں نے ابراہیم اور اسماعیل علیہما السلام کے بت بھی نکالے۔ ان کے ہاتھوں میں فال نکالنے کے تیر دے رکھے تھے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ ان مشرکوں کو غارت کرے، اللہ کی قسم انہیں اچھی طرح معلوم تھا کہ ان بزرگوں نے تیر سے فال کبھی نہیں نکالی۔ اس کے بعد آپ صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے اور چاروں طرف تکبیر کہی۔ آپ صلی اللہ علیہ وسلم نے اندر نماز نہیں پڑھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے ایوب سختیانی نے، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ ( عمرۃ القضاء 7 ھ میں ) جب رسول اللہ صلی اللہ علیہ وسلم ( مکہ ) تشریف لائے تو مشرکوں نے کہا کہ محمد ( صلی اللہ علیہ وسلم ) آئے ہیں، ان کے ساتھ ایسے لوگ آئے ہیں جنہیں یثرب ( مدینہ منورہ ) کے بخار نے کمزور کر دیا ہے۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ طواف کے پہلے تین چکروں میں رمل ( تیز چلنا جس سے اظہار قوت ہو ) کریں اور دونوں یمانی رکنوں کے درمیان حسب معمول چلیں اور آپ صلی اللہ علیہ وسلم نے یہ حکم نہیں دیا کہ سب پھیروں میں رمل کریں اس لیے کہ ان پر آسانی ہو۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "ہم سے اصبغ بن فرج نے بیان کیا، کہا کہ مجھے عبداللہ بن وہب نے خبر دی، انہیں یونس نے، انہیں زہری نے، انہیں سالم نے اور ان سے ان کے والد نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا۔ جب آپ صلی اللہ علیہ وسلم مکہ تشریف لاتے تو پہلے طواف شروع کرتے وقت حجر اسود کو بوسہ دیتے اور سات چکروں میں سے پہلے تین چکروں میں رمل کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا کہ ہم سے سریج بن نعمان نے بیان کیا، کہا کہ ہم سے فلیح نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے پہلے تین چکروں میں رمل کیا اور بقیہ چار چکروں میں حسب معمول چلے، حج اور عمرہ دونوں میں۔ سریج کے ساتھ اس حدیث کو لیث نے روایت کیا ہے۔ کہا کہ مجھ سے کثیر بن فرقد نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا کہ ہمیں محمد بن جعفر نے خبر دی، کہا کہ مجھے زید بن اسلم نے خبر دی، انہیں ان کے والد نے کہ عمر بن خطاب رضی اللہ عنہ نے حجر اسود کو خطاب کر کے فرمایا ”بخدا مجھے خوب معلوم ہے کہ تو صرف ایک پتھر ہے جو نہ کوئی نفع پہنچا سکتا ہے نہ نقصان اور اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کو تجھے بوسہ دیتے نہ دیکھا ہوتا تو میں کبھی بوسہ نہ دیتا۔“ اس کے بعد آپ نے بوسہ دیا۔ پھر فرمایا ”اور اب ہمیں رمل کی بھی کیا ضرورت ہے۔ ہم نے اس کے ذریعہ مشرکوں کو اپنی قوت دکھائی تھی تو اللہ نے ان کو تباہ کر دیا۔“ پھر فرمایا ”جو عمل رسول اللہ صلی اللہ علیہ وسلم نے کیا ہے اسے اب چھوڑنا بھی ہم پسند نہیں کرتے۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "ہم سے مسدد نے بیان کیا، ان سے یحییٰ قطان نے بیان کیا، ان سے عبیداللہ عمری نے، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا۔ جب سے میں نے رسول اللہ صلی اللہ علیہ وسلم کو ان دونوں رکن یمانی کو چومتے ہوئے دیکھا میں نے بھی اس کے چومنے کو خواہ سخت حالات ہوں یا نرم نہیں چھوڑا۔ میں نے نافع سے پوچھا کیا ابن عمر رضی اللہ عنہما ان دونوں یمنی رکنوں کے درمیان معمول کے مطابق چلتے تھے؟ تو انہوں نے بتایا کہ آپ معمول کے مطابق اس لیے چلتے تھے تاکہ حجر اسود کو چھونے میں آسانی رہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "ہم سے احمد بن صالح اور یحییٰ بن سلیمان نے بیان کیا، انہوں نے بیان کیا کہ ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ ہمیں یونس نے ابن شہاب سے خبر دی، انہیں عبیداللہ بن عبداللہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے حجتہ الوداع کے موقع پر اپنی اونٹنی پر طواف کیا تھا اور آپ صلی اللہ علیہ وسلم حجر اسود کا استلام ایک چھڑی کے ذریعہ کر رہے تھے اور اس چھڑی کو چومتے تھے۔ اور یونس کے ساتھ اس حدیث کو دراوردی نے زہری کے بھتیجے سے روایت کیا اور انہوں نے اپنے چچا ( زہری ) سے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "اور محمد بن بکر نے کہا کہ ہمیں ابن جریج نے خبر دی، انہوں نے کہا مجھ کو عمرو بن دینار نے خبر دی کہ ابوالشعثاء نے کہا بیت اللہ کے کسی بھی حصہ سے بھلا کون پرہیز کر سکتا ہے۔ اور معاویہ رضی اللہ عنہ چاروں رکنوں کا استلام کرتے تھے، اس پر عبداللہ بن عباس رضی اللہ عنہما نے ان سے کہا کہ ہم ان دو ارکان شامی اور عراقی کا استلام نہیں کرتے تو معاویہ رضی اللہ عنہ نے فرمایا کہ بیت اللہ کا کوئی جزء ایسا نہیں جسے چھوڑ دیا جائے اور عبداللہ بن زبیر رضی اللہ عنہما بھی تمام ارکان کا استلام کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "ہم سے ابوالولید طیالسی نے بیان کیا، ان سے لیث بن سعد نے بیان کیا، ان سے ابن شہاب نے، ان سے سالم بن عبداللہ نے، ان سے ان کے والد عبداللہ بن عمر رضی اللہ عنہما نے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو صرف دونوں یمانی ارکان کا استلام کرتے دیکھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "ہم سے احمد بن سنان نے بیان کیا، ان سے یزید بن ہارون نے بیان کیا، انہیں ورقاء نے خبر دی، انہیں زید بن اسلم نے خبر دی، ان سے ان کے والد نے بیان کیا کہ میں نے دیکھا کہ عمر بن خطاب رضی اللہ عنہ نے حجر اسود کو بوسہ دیا اور پھر فرمایا کہ ”اگر میں رسول اللہ صلی اللہ علیہ وسلم کو تجھے بوسہ دیتے نہ دیکھتا تو میں کبھی تجھے بوسہ نہ دیتا۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے زبیر بن عربی نے بیان کیا کہ ایک شخص نے ابن عمر رضی اللہ عنہما سے حجر اسود کے بوسہ دینے کے متعلق پوچھا تو انہوں نے بتلایا کہ ”میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس کو بوسہ دیتے دیکھا ہے۔“ اس پر اس شخص نے کہا اگر ہجوم ہو جائے اور میں عاجز ہو جاؤں تو کیا کروں؟ ابن عمر رضی اللہ عنہما نے فرمایا کہ ”اس اگر وگر کو یمن میں جا کر رکھو میں نے تو رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اس کو بوسہ دیتے تھے۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا کہ ہم سے عبدالوہاب نے بیان کیا، کہا کہ ہم سے خالد حذاء نے عکرمہ سے بیان کیا، ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم ایک اونٹنی پر ( سوار ہو کر کعبہ کا ) طواف کر رہے تھے اور جب بھی آپ صلی اللہ علیہ وسلم حجر اسود کے سامنے پہنچتے تو کسی چیز سے اس کی طرف اشارہ کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے خالد بن عبداللہ نے بیان کیا، کہا کہ ہم سے خالد حذاء نے بیان کیا، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا نبی کریم صلی اللہ علیہ وسلم نے بیت اللہ کا طواف ایک اونٹنی پر سوار رہ کر کیا۔ جب بھی آپ صلی اللہ علیہ وسلم حجر اسود کے سامنے پہنچتے تو کسی چیز سے اس کی طرف اشارہ کرتے اور تکبیر کہتے۔ خالد طحان کے ساتھ اس حدیث کو ابراہیم بن طہمان نے بھی خالد حذاء سے روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا کہ ہم سے ابوضمرہ انس بن عیاض نے بیان کیا، انہوں نے کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا، انہوں نے نافع سے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ( مکہ ) آنے کے بعد سب سے پہلے حج اور عمرہ کا طواف کیا تھا۔ اس کے تین چکروں میں آپ صلی اللہ علیہ وسلم نے سعی ( رمل ) کی اور باقی چار میں حسب معمول چلے۔ پھر طواف کی دو رکعت نماز پڑھی اور صفا مروہ کی سعی کی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا، ان سے عبیداللہ عمری نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم جب بیت اللہ کا پہلا طواف ( یعنی طواف قدوم ) کرتے تو اس کے تین چکروں میں آپ صلی اللہ علیہ وسلم دوڑ کر چلتے اور چار میں معمول کے موافق چلتے پھر جب صفا اور مروہ کی سعی کرتے تو ”بطن مسیل“ ( وادی ) میں دوڑ کر چلتے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "امام بخاری رحمہ اللہ نے کہا کہ مجھ سے عمرو بن علی نے بیان کیا، کہا کہ ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے بیان کیا اور انہیں عطاء نے خبر دی کہ جب ابن ہشام ( جب وہ ہشام بن عبدالملک کی طرف سے مکہ کا حاکم تھا ) نے عورتوں کو مردوں کے ساتھ طواف کرنے سے منع کر دیا تو اس سے انہوں نے کہا کہ تم کس دلیل پر عورتوں کو اس سے منع کر رہے ہو؟ جب کہ رسول اللہ صلی اللہ علیہ وسلم کی پاک بیویوں نے مردوں کے ساتھ طواف کیا تھا۔ ابن جریج نے پوچھا یہ پردہ ( کی آیت نازل ہونے ) کے بعد کا واقعہ ہے یا اس سے پہلے کا؟ انہوں نے کہا میری عمر کی قسم! میں نے انہیں پردہ ( کی آیت نازل ہونے ) کے بعد دیکھا۔ اس پر ابن جریج نے پوچھا کہ پھر مرد عورت مل جل جاتے تھے۔ انہوں نے فرمایا کہ اختلاط نہیں ہوتا تھا، عائشہ رضی اللہ عنہا مردوں سے الگ رہ کر ایک الگ کونے میں طواف کرتی تھیں، ان کے ساتھ مل کر نہیں کرتی تھیں۔ ایک عورت ( وقرہ نامی ) نے ان سے کہا ام المؤمنین! چلئے ( حجر اسود کو ) بوسہ دیں۔ تو آپ نے انکار کر دیا اور کہا تو جا چوم، میں نہیں چومتی اور ازواج مطہرات رات میں پردہ کر کے نکلتی تھیں کہ پہچانی نہ جاتیں اور مردوں کے ساتھ طواف کرتی تھیں۔ البتہ عورتیں جب کعبہ کے اندر جانا چاہتیں تو اندر جانے سے پہلے باہر کھڑی ہو جاتیں اور مرد باہر آ جاتے ( تو وہ اندر جاتیں ) میں اور عبید بن عمیر عائشہ رضی اللہ عنہا کی خدمت میں اس وقت حاضر ہوئے جب آپ ثبیر ( پہاڑ ) پر ٹھہری ہوئی تھیں، ( جو مزدلفہ میں ہے ) ابن جریج نے کہا کہ میں نے عطاء سے پوچھا کہ اس وقت پردہ کس چیز سے تھا؟ عطاء نے بتایا کہ ایک ترکی قبہ میں ٹھہری ہوئی تھیں۔ اس پر پردہ پڑا ہوا تھا۔ ہمارے اور ان کے درمیان اس کے سوا اور کوئی چیز حائل نہ تھی۔ اس وقت میں نے دیکھا کہ ان کے بدن پر ایک گلابی رنگ کا کرتہ تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "ہم سے اسمٰعیل بن ابی اویس نے بیان کیا، انہوں نے کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا، ان سے محمد بن عبدالرحمٰن بن نوفل نے بیان کیا، ان سے عروہ بن زبیر نے بیان کیا، ان سے زینب بنت ابی سلمہ نے، ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے بیان کیا، انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے بیمار ہونے کی شکایت کی ( کہ میں پیدل طواف نہیں کر سکتی ) تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ سواری پر چڑھ کر اور لوگوں سے علیحدہ رہ کر طواف کر لے۔ چنانچہ میں نے عام لوگوں سے الگ رہ کر طواف کیا۔ اس وقت رسول اللہ صلی اللہ علیہ وسلم کعبہ کے پہلو میں نماز پڑھ رہے تھے اور آپ صلی اللہ علیہ وسلم «والطور * وكتاب مسطور‏» قرآت کر رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا کہ ہم سے ہشام نے بیان کیا کہ ابن جریج نے انہیں خبر دی، کہا کہ مجھے سلیمان احول نے خبر دی، انہیں طاؤس نے خبر دی اور انہیں ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم کعبہ کا طواف کرتے ہوئے ایک ایسے شخص کے پاس سے گزرے جس نے اپنا ہاتھ ایک دوسرے شخص کے ہاتھ سے تسمہ یا رسی یا کسی اور چیز سے باندھ رکھا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اسے کاٹ دیا اور پھر فرمایا کہ ”اگر ساتھ ہی چلنا ہے تو ہاتھ پکڑ کے چلو۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے بیان کیا، ان سے سلیمان احول نے، ان سے طاؤس نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے دیکھا کہ ایک شخص کعبہ کا طواف رسی یا کسی اور چیز کے ذریعہ کر رہا ہے تو آپ صلی اللہ علیہ وسلم نے اسے کاٹ دیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "ہم سے يحيىٰ بن بکیر نے بیان کیا، انہوں نے کہا کہ ہم سے لیث نے بیان کیا، انہوں نے کہا کہ ہم سے یونس نے بیان کیا، انہوں نے کہا کہ ہم سے ابن شہاب نے بیان کیا کہ مجھ سے حمید بن عبدالرحمٰن نے بیان کیا اور انہیں ابوہریرہ رضی اللہ عنہ نے خبر دی کہ ابوبکر صدیق رضی اللہ عنہ نے اس حج کے موقع پر جس کا امیر رسول اللہ صلی اللہ علیہ وسلم نے انہیں بنایا تھا۔ انہیں دسویں تاریخ کو ایک مجمع کے سامنے یہ اعلان کرنے کے لیے بھیجا تھا کہ اس سال کے بعد کوئی مشرک حج بیت اللہ نہیں کر سکتا اور نہ کوئی شخص ننگا رہ کر طواف کر سکتا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "ہم سے محمد بن ابی بکر نے بیان کیا، انہوں نے کہا کہ ہم سے فضیل نے بیان کیا، انہوں نے کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا، کہا کہ مجھے کریب نے عبداللہ بن عباس رضی اللہ عنہما سے خبر دی، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم مکہ تشریف لائے اور سات ( چکروں کے ساتھ ) طواف کیا۔ پھر صفا مروہ کی سعی کی۔ اس سعی کے بعد آپ صلی اللہ علیہ وسلم کعبہ اس وقت تک نہیں گئے جب تک عرفات سے واپس نہ لوٹے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی، انہیں محمد بن عبدالرحمٰن نے، انہیں عروہ نے، انہیں زینب نے اور انہیں ام المؤمنین ام سلمہ رضی اللہ عنہا نے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی۔ ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا کہ مجھ سے محمد بن حرب نے بیان کیا، انہوں نے کہا کہ ہم سے ابومروان یحییٰ ابن ابی زکریا غسانی نے بیان کیا، ان سے ہشام نے، ان سے عروہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم جب مکہ میں تھے اور وہاں سے چلنے کا ارادہ ہوا تو ام سلمہ رضی اللہ عنہا نے کعبہ کا طواف نہیں کیا اور وہ بھی روانگی کا ارادہ رکھتی تھیں آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ جب صبح کی نماز کھڑی ہو اور لوگ نماز پڑھنے میں مشغول ہو جائیں تو تم اپنی اونٹنی پر طواف کر لینا۔ چنانچہ ام سلمہ رضی اللہ عنہا نے ایسا ہی کیا اور انہوں نے باہر نکلنے تک طواف کی نماز نہیں پڑھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا انہوں کہا کہ عم سے عمرو بن دینار نے بیان کیا، انہوں نے کہا کہ میں نے ابن عمر رضی اللہ عنہما سے سنا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم ( مکہ میں ) تشریف لائے تو آپ صلی اللہ علیہ وسلم نے خانہ کعبہ کا سات چکروں سے طواف کیا اور مقام ابراہیم کے پیچھے دو رکعت نماز پڑھی پھر صفا کی طرف ( سعی کرنے ) گئے اور اللہ تعالیٰ نے فرمایا ہے کہ تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "ہم سے حسن بن عمر بصریٰ رحمہ اللہ نے بیان کیا، کہا کہ ہم سے یزید بن زریع نے بیان کیا، ان سے حبیب نے، ان سے عطاء نے، ان سے عروہ نے، ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہ کچھ لوگوں نے صبح کی نماز کے بعد کعبہ کا طواف کیا۔ پھر ایک وعظ کرنے والے کے پاس بیٹھ گئے اور جب سورج نکلنے لگا تو وہ لوگ نماز ( طواف کی دو رکعت ) پڑھنے کے لیے کھڑے ہو گئے۔ اس پر عائشہ رضی اللہ عنہا نے ( ناگواری کے ساتھ ) فرمایا جب سے تو یہ لوگ بیٹھے تھے اور جب وہ وقت آیا کہ جس میں نماز مکروہ ہے تو نماز کے لیے کھڑے ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، کہا کہ ہم سے ابوضمرہ نے بیان کیا، کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا، ان سے نافع نے کہ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا، میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے۔ آپ صلی اللہ علیہ وسلم سورج طلوع ہوتے اور غروب ہوتے وقت نماز پڑھنے سے روکتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "ہم سے اسحاق واسطی نے بیان کیا، کہا کہ ہم سے خالد طحان نے خالد حذاء سے بیان کیا، ان سے عکرمہ نے، ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف اونٹ پر سوار ہو کر کیا۔ آپ صلی اللہ علیہ وسلم جب بھی ( طواف کرتے ہوئے ) حجر اسود کے نزدیک آتے تو اپنے ہاتھ کو ایک چیز ( چھڑی ) سے اشارہ کرتے اور تکبیر کہتے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا انہوں نے کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا، ان سے محمد بن عبدالرحمٰن بن نوفل نے، ان سے عروہ نے بیان کیا، ان سے زینب بنت ام سلمہ نے، ان سے ام سلمہ رضی اللہ عنہا نے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی کہ میں بیمار ہو گئی ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا پھر لوگوں کے پیچھے سے سوار ہو کر طواف کر لے۔ چنانچہ میں نے جب طواف کیا تو اس وقت رسول اللہ صلی اللہ علیہ وسلم بیت اللہ کے پہلو میں ( نماز کے اندر ) «والطور وكتاب مسطور‏» کی قرآت کر رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "ہم سے عبداللہ بن محمد بن ابی الاسود نے بیان کیا، انہوں نے کہا کہ ہم سے ابوضمرہ نے بیان کیا، انہوں نے کہا کہ ہم سے عبیداللہ عمری نے بیان کیا، ان سے نافع نے، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ عباس بن عبدالمطلب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے پانی ( زمزم کا حاجیوں کو ) پلانے کے لیے منیٰ کے دنوں میں مکہ ٹھہرنے کی اجازت چاہی تو آپ صلی اللہ علیہ وسلم نے ان کو اجازت دے دی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "ہم سے اسحاق بن شاہین نے بیان کیا، کہا کہ ہم سے خالد طحان نے خالد حذاء سے بیان کیا، ان سے عکرمہ نے، ان سے ابن عباس رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم پانی پلانے کی جگہ ( زمزم کے پاس ) تشریف لائے اور پانی مانگا ( حج کے موقع پر ) عباس رضی اللہ عنہ نے کہا کہ فضل! اپنی ماں کے یہاں جا اور ان کے یہاں سے کھجور کا شربت لا۔ لیکن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ( یہی ) پانی پلاؤ۔ عباس رضی اللہ عنہ نے عرض کیا یا رسول اللہ! ہر شخص اپنا ہاتھ اس میں ڈال دیتا ہے۔ اس کے باوجود رسول اللہ صلی اللہ علیہ وسلم یہی کہتے رہے کہ مجھے ( یہی ) پانی پلاؤ۔ چنانچہ آپ صلی اللہ علیہ وسلم نے پانی پیا پھر زمزم کے قریب آئے۔ لوگ کنویں سے پانی کھینچ رہے تھے اور کام کر رہے تھے۔ آپ صلی اللہ علیہ وسلم نے ( انہیں دیکھ کر ) فرمایا کام کرتے جاؤ کہ ایک اچھے کام پر لگے ہوئے ہو۔ پھر فرمایا ( اگر یہ خیال نہ ہوتا کہ آئندہ لوگ ) تمہیں پریشان کر دیں گے تو میں بھی اترتا اور رسی اپنے اس پر رکھ لیتا۔ مراد آپ صلی اللہ علیہ وسلم کی شانہ سے تھی۔ آپ صلی اللہ علیہ وسلم نے اس کی طرف اشارہ کر کے کہا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "اور عبدان نے کہا کہ مجھ کو عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہمیں یونس نے خبر دی، انہیں زہری نے، انہوں نے کہا کہ ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ ابوذر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب میں مکہ میں تھا تو میری ( گھر کی ) چھت کھلی اور جبرائیل علیہ السلام نازل ہوئے۔ انہوں نے میرا سینہ چاک کیا اور اسے زمزم کے پانی سے دھویا۔ اس کے بعد ایک سونے کا طشت لائے جو حکمت اور ایمان سے بھرا ہوا تھا۔ اسے انہوں نے میرے سینے میں ڈال دیا اور پھر سینہ بند کر دیا۔ اب وہ مجھے ہاتھ سے پکڑ کر آسمان دنیا کی طرف لے چلے۔ آسمان دنیا کے داروغہ سے جبرائیل علیہ السلام نے کہا دروازہ کھولو۔ انہوں نے دریافت کیا کون صاحب ہیں؟ کہا جبرائیل!۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "ہم سے محمد بن سلام بیکندی نے بیان کیا، انہوں نے کہا کہ ہمیں مروان بن معاویہ فزاری نے خبر دی، انہیں عاصم نے اور انہیں شعبی نے کہ عبداللہ بن عباس رضی اللہ عنہما نے ان سے بیان کیا، کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو زمزم کا پانی پلایا تھا۔ آپ صلی اللہ علیہ وسلم نے پانی کھڑے ہو کر پیا تھا۔ عاصم نے بیان کیا کہ عکرمہ نے قسم کھا کر کہا کہ نبی کریم صلی اللہ علیہ وسلم اس دن اونٹ پر سوار تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہمیں امام مالک رحمہ اللہ نے ابن شہاب سے خبر دی، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہا کہ حجتہ الوداع میں ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( مدینہ سے ) نکلے اور ہم نے عمرہ کا احرام باندھا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس کے ساتھ قربانی کا جانور ہو وہ حج اور عمرہ دونوں کا ایک ساتھ احرام باندھے۔ ایسے لوگ دونوں کے احرام سے ایک ساتھ حلال ہوں گے۔ میں بھی مکہ آئی تھی لیکن مجھے حیض آ گیا تھا۔ اس لیے جب ہم نے حج کے کام پورے کر لیے تو نبی کریم صلی اللہ علیہ وسلم نے مجھے عبدالرحمٰن کے ساتھ تنعیم کی طرف بھیجا۔ میں نے وہاں سے عمرہ کا احرام باندھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا یہ تمہارے اس عمرہ کے بدلہ میں ہے ( جسے تم نے حیض کی وجہ سے چھوڑ دیا تھا ) جن لوگوں نے عمرہ کا احرام باندھا تھا انہوں نے سعی کے بعد احرام کھول دیا اور دوسرا طواف منٰی سے واپسی پر کیا لیکن جن لوگوں نے حج اور عمرہ کا احرام ایک ساتھ باندھا تھا انہوں نے صرف ایک طواف کیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا، ان سے ایوب سختیانی نے، ان سے نافع نے کہ ابن عمر رضی اللہ عنہما کے لڑکے عبداللہ بن عبداللہ ان کے یہاں گئے۔ حج کے لیے سواری گھر میں کھڑی ہوئی تھی۔ انہوں نے کہا کہ مجھے خطرہ ہے کہ اس سال مسلمانوں میں آپس میں لڑائی ہو جائے گی اور آپ کو وہ بیت اللہ سے روک دیں گے۔ اس لیے اگر آپ نہ جاتے تو بہتر ہوتا۔ ابن عمر رضی اللہ عنہما نے جواب دیا کہ رسول اللہ صلی اللہ علیہ وسلم بھی تشریف لے گئے تھے ( عمرہ کرنے صلح حدیبیہ کے موقع پر ) اور کفار قریش نے آپ کو بیت اللہ تک پہنچنے سے روک دیا تھا۔ اس لیے اگر مجھے بھی روک دیا گیا تو میں بھی وہی کام کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا اور تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے۔ پھر آپ نے فرمایا کہ میں تمہیں گواہ بناتا ہوں کہ میں نے اپنے عمرہ کے ساتھ حج ( اپنے اوپر ) واجب کر لیا ہے۔ انہوں نے بیان کیا کہ پھر آپ مکہ آئے اور دونوں عمرہ اور حج کے لیے ایک ہی طواف کیا",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے لیث بن سعد نے نافع سے بیان کیا کہ جس سال حجاج عبداللہ بن زبیر رضی اللہ عنہما کے مقابلے میں لڑنے آیا تھا۔ عبداللہ بن عمر رضی اللہ عنہما نے جب اس سال حج کا ارادہ کیا تو آپ سے کہا گیا کہ مسلمانوں میں باہم جنگ ہونے والی ہے اور یہ بھی خطرہ ہے کہ آپ کو حج سے روک دیا جائے۔ آپ نے فرمایا تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے۔ ایسے وقت میں میں بھی وہی کام کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا۔ تمہیں گواہ بناتا ہوں کہ میں نے اپنے اوپر عمرہ واجب کر لیا ہے۔ پھر آپ چلے اور جب بیداء کے میدان میں پہنچے تو آپ نے فرمایا کہ حج اور عمرہ تو ایک ہی طرح کے ہیں۔ میں تمہیں گواہ بناتا ہوں کہ میں نے اپنے عمرہ کے ساتھ حج بھی واجب کر لیا ہے۔ آپ نے ایک قربانی بھی ساتھ لے لی جو مقام قدید سے خریدی تھی۔ اس کے سوا اور کچھ نہیں کیا۔ دسویں تاریخ سے پہلے نہ آپ نے قربانی کی نہ کسی ایسی چیز کو اپنے لیے جائز کیا جس سے ( احرام کی وجہ سے ) آپ رک گئے تھے۔ نہ سر منڈوایا نہ بال ترشوائے دسویں تاریخ میں آپ نے قربانی کی اور بال منڈوائے۔ آپ کا یہی خیال تھا کہ آپ نے ایک طواف سے حج اور عمرہ دونوں کا طواف ادا کر لیا ہے۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اسی طرح کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "اور مجھے میری والدہ نے خبر دی کہ انہوں نے اپنی بہن اور زبیر اور فلاں فلاں ( رضی اللہ عنہم ) کے ساتھ عمرہ کیا ہے یہ سب لوگ حجر اسود کا بوسہ لے لیتے تو عمرہ کا احرام کھول دیتے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی کہ عروہ نے بیان کیا کہ میں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے پوچھا کہ اللہ تعالیٰ کے اس فرمان کے بارے میں آپ کا کیا خیال ہے ( جو سورۃ البقرہ میں ہے کہ ) ”صفا اور مروہ اللہ تعالیٰ کی نشانیوں میں سے ہیں۔ اس لے جو بیت اللہ کا حج یا عمرہ کرے اس کے لیے ان کا طواف کرنے میں کوئی گناہ نہیں“۔ قسم اللہ کی پھر تو کوئی حرج نہ ہونا چاہئیے اگر کوئی صفا اور مروہ کی سعی نہ کرنی چاہے۔ عائشہ رضی اللہ عنہا نے فرمایا بھتیجے! تم نے یہ بری بات کہی۔ اللہ کا مطلب یہ ہوتا تو قرآن میں یوں اترتا“ ان کے طواف نہ کرنے میں کوئی گناہ نہیں“ بات یہ ہے کہ یہ آیت تو انصار کے لیے اتری تھی جو اسلام سے پہلے منات بت کے نام پر جو مشلل میں رکھا ہوا تھا اور جس کی یہ پوجا کیا کرتے تھے۔، احرام باندھتے تھے۔ یہ لوگ جب ( زمانہ جاہلیت میں ) احرام باندھتے تو صفا مروہ کی سعی کو اچھا نہیں خیال کرتے تھے۔ اب جب اسلام لائے تو رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا اور کہا کہ یا رسول اللہ! ہم صفا اور مروہ کی سعی اچھی نہیں سمجھتے تھے۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی کہ صفا اور مروہ دونوں اللہ کی نشانیاں ہیں آخر آیت تک۔ عائشہ صدیقہ رضی اللہ عنہا نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان دو پہاڑوں کے درمیان سعی کی سنت جاری کی ہے۔ اس لیے کسی کے لیے مناسب نہیں ہے کہ اسے ترک کر دے۔ انہوں نے کہا کہ پھر میں نے اس کا ذکر ابوبکر بن عبدالرحمٰن سے کیا تو انہوں نے فرمایا کہ میں نے تو یہ علمی بات اب تک نہیں سنی تھی، بلکہ میں نے بہت سے اصحاب علم سے تو یہ سنا ہے کہ وہ یوں کہتے تھے کہ عرب کے لوگ ان لوگوں کے سوا جن کا عائشہ صدیقہ رضی اللہ عنہا نے ذکر کیا جو مناۃ کے لیے احرام باندھتے تھے سب صفا مروہ کا پھیرا کیا کرتے تھے۔ اور جب اللہ نے قرآن شریف میں بیت اللہ کے طواف کا ذکر فرمایا اور صفا مروہ کا ذکر نہیں کیا تو وہ لوگ کہنے لگے یا رسول اللہ! ہم تو جاہلیت کے زمانہ میں صفا اور مروہ کا پھیرا کیا کرتے تھے اور اب اللہ نے بیت اللہ کے طواف کا ذکر تو فرمایا لیکن صفا مروہ کا ذکر نہیں کیا تو کیا صفا مروہ کی سعی کرنے میں ہم پر کچھ گناہ ہو گا؟ تب اللہ نے یہ آیت اتاری۔ ”صفا مروہ اللہ کی نشانیاں ہیں آخر آیت تک۔“ ابوبکر رضی اللہ عنہ نے کہا میں سنتا ہوں کہ یہ آیت دونوں فرقوں کے باب میں اتری ہے یعنی اس فرقے کے باب میں جو جاہلیت کے زمانے میں صفا مروہ کا طواف برا جانتا تھا اور اس کے باب میں جو جاہلیت کے زمانے میں صفا مروہ کا طواف کیا کرتے تھے۔ پھر مسلمان ہونے کے بعد اس کا کرنا اس وجہ سے کہ اللہ نے بیت اللہ کے طواف کا ذکر کیا اور صفا و مروہ کا نہیں کیا، برا سمجھے۔ یہاں تک کہ اللہ نے بیت اللہ کے طواف کے بعد ان کے طواف کا بھی ذکر فرما دیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "ہم نے محمد بن عبید نے بیان کیا، انہوں نے کہا کہ ہم سے عیسیٰ بن یونس نے بیان کیا، ان سے عبیداللہ بن عمر نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ جب رسول اللہ صلی اللہ علیہ وسلم پہلا طواف کرتے تو اس کے تین چکروں میں رمل کرتے اور بقیہ چار میں معمول کے مطابق چلتے اور جب صفا اور مروہ کی سعی کرتے تو آپ نالے کے نشیب میں دوڑا کرتے تھے۔ عبیداللہ نے کہا میں نے نافع سے پوچھا، ابن عمر رضی اللہ عنہما جب رکن یمانی کے پاس پہنچتے تو کیا حسب معمول چلنے لگتے تھے؟ انہوں نے فرمایا کہ نہیں۔ البتہ اگر رکن یمانی پر ہجوم ہوتا تو حجر اسود کے پاس آ کر آپ آہستہ چلنے لگتے کیونکہ وہ بغیر چومے اس کو نہیں چھوڑتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "ہم نے اس کے متعلق جابر بن عبداللہ رضی اللہ عنہما سے بھی پوچھا تو آپ نے فرمایا کہ صفا اور مروہ کی سعی سے پہلے بیوی کے قریب بھی نہ جائے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، ان سے ابن جریج نے بیان کیا کہ مجھے عمرو بن دینار نے خبر دی، کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، آپ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم جب مکہ تشریف لائے تو آپ نے بیت اللہ کا طواف کیا اور دو رکعت نماز پڑھی پھر صفا اور مروہ کی سعی کی۔ اس کے بعد عبداللہ رضی اللہ عنہ نے یہ آیت تلاوت کی «لقد كان لكم في رسول الله أسوة حسنة‏» ”تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "ہم سے احمد بن محمد مروزی نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہمیں عاصم احول نے خبر دی، انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے پوچھا کہ آپ لوگ صفا اور مروہ کی سعی کو برا سمجھتے تھے؟ انہوں نے فرمایا، ہاں! کیونکہ یہ عہد جاہلیت کا شعار تھا۔ یہاں تک کہ اللہ تعالیٰ نے یہ آیت نازل فرما دی ”صفا اور مروہ اللہ تعالیٰ کی نشانیاں ہیں۔ پس جو کوئی بیت اللہ کا حج یا عمرہ کرے اس پر ان کی سعی کرنے میں کوئی گناہ نہیں ہے۔“",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے، ان سے عطاء بن ابی رباح نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف اور صفا مروہ کی سعی اس طرح کی کہ مشرکین کو آپ اپنی قوت دکھلا سکیں۔ حمیدی نے یہ اضافہ کیا ہے کہ ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے بیان کیا، کہا کہ میں نے عطاء سے سنا اور انہوں نے ابن عباس رضی اللہ عنہما سے یہی حدیث سنی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی، انہیں عبدالرحمٰن بن قاسم نے، انہیں ان کے باپ نے اور انہیں ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے انہوں نے فرمایا کہ میں مکہ آئی تو اس وقت میں حائضہ تھی۔ اس لیے بیت اللہ کا طواف نہ کر سکی اور نہ صفا مروہ کی سعی۔ انہوں نے بیان کیا کہ میں نے اس کی شکایت رسول اللہ صلی اللہ علیہ وسلم سے کی تو آپ نے فرمایا کہ جس طرح دوسرے حاجی کرتے ہیں تم بھی اسی طرح ( ارکان حج ) ادا کر لو ہاں بیت اللہ کا طواف پاک ہونے سے پہلے نہ کرنا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا کہ ہم سے عبدالوہاب ثقفی نے بیان کیا۔ (دوسری سند) اور مجھ سے خلیفہ بن خیاط نے بیان کیا کہ ہم سے عبدالوہاب ثقفی نے بیان کیا، کہا کہ ہم سے حبیب معلم نے بیان کیا، ان سے عطاء بن ابی رباح نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم اور آپ کے اصحاب نے حج کا احرام باندھا۔ نبی کریم صلی اللہ علیہ وسلم اور طلحہ کے سوا اور کسی کے ساتھ قربانی نہیں تھی، علی رضی اللہ عنہ یمن سے آئے تھے اور ان کے ساتھ بھی قربانی تھی۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے حکم دیا کہ ( سب لوگ اپنے حج کے احرام کو ) عمرہ کا کر لیں۔ پھر طواف اور سعی کے بعد بال ترشوا لیں اور احرام کھول ڈالیں لیکن وہ لوگ اس حکم سے مستثنیٰ ہیں جن کے ساتھ قربانی ہو۔ اس پر صحابہ نے کہا کہ ہم منیٰ میں اس طرح جائیں گے کہ ہمارے ذکر سے منی ٹپک رہی ہو۔ یہ بات جب رسول اللہ صلی اللہ علیہ وسلم کو معلوم ہوئی تو آپ نے فرمایا، اگر مجھے پہلے معلوم ہوتا تو میں قربانی کا جانور ساتھ نہ لاتا اور جب قربانی کا جانور ساتھ نہ ہوتا تو میں بھی ( عمرہ اور حج کے درمیان ) احرام کھول ڈالتا اور عائشہ رضی اللہ عنہا ( اس حج میں ) حائضہ ہو گئی تھیں۔ اس لیے انہوں نے بیت اللہ کہ طواف کے سوا اور دوسرے ارکان حج ادا کئے۔ پھر پاک ہو لیں تو طواف بھی کیا۔ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی کہ آپ سب لوگ تو حج اور عمرہ دونوں کر کے جا رہے ہیں لیکن میں نے صرف حج ہی کیا ہے۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے عبدالرحمٰن بن ابی بکر کو حکم دیا کہ انہیں تنعیم لیے جائیں ( اور وہاں سے عمرہ کا احرام باندھیں ) اس طرح عائشہ رضی اللہ عنہا نے حج کے بعد عمرہ کیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "ہم سے مومل بن ہشام نے بیان کیا، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا، ان سے ایوب سختیانی نے اور ان سے حفصہ بنت سیرین نے بیان کیا کہ ہم اپنی کنواری لڑکیوں کو باہر نکلنے سے روکتے تھے۔ پھر ایک خاتون آئیں اور بنی خلف کے محل میں ( جو بصرے میں تھا ) ٹھہریں۔ انہوں نے بیان کیا کہ ان کی بہن ( ام عطیہ رضی اللہ عنہا ) نبی کریم صلی اللہ علیہ وسلم کے ایک صحابی کے گھر میں تھیں۔ ان کے شوہر نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ جہاد کئے تھے اور میری بہن چھ جہادوں میں ان کے ساتھ رہی تھیں۔ وہ بیان کرتی تھیں کہ ہم ( میدان جنگ میں ) زخمیوں کی مرہم پٹی کرتی تھیں اور مریضوں کی تیمارداری کرتی تھی۔ میری بہن نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ اگر ہمارے پاس چادر نہ ہو تو کیا کوئی حرج ہے اگر ہم عیدگاہ جانے کے لیے باہر نہ نکلیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اس کی سہیلی کو اپنی چادر اسے اڑھا دینی چاہئے اور پھر مسلمانوں کی دعا اور نیک کاموں میں شرکت کرنا چاہئے۔ پھر جب امام عطیہ رضی اللہ عنہا خود بصرہ آئیں تو میں نے ان سے بھی یہی پوچھا یا یہ کہا کہ ہم نے ان سے پوچھا انہوں نے بیان کیا ام عطیہ رضی اللہ عنہا جب بھی رسول اللہ صلی اللہ علیہ وسلم کا ذکر کرتیں تو کہتیں میرے باپ آپ پر فدا ہوں۔ ہاں تو میں نے ان سے پوچھا، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے اس طرح سنا ہے؟ انہوں نے فرمایا کہ ہاں میرے باپ آپ پر فدا ہوں۔ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کنواری لڑکیاں اور پردہ والیاں بھی باہر نکلیں یا یہ فرمایا کہ پردہ والی دوشیزائیں اور حائضہ عورتیں سب باہر نکلیں اور مسلمانوں کی دعا اور خیر کے کاموں میں شرکت کریں۔ لیکن حائضہ عورتیں نماز کی جگہ سے الگ رہیں۔ میں نے کہا اور حائضہ بھی نکلیں؟ انہوں نے فرمایا کہ کیا حائضہ عورت عرفات اور فلاں فلاں جگہ نہیں جاتی ہیں؟ ( پھر عیدگاہ ہی جانے میں کیا حرج ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا کہ ہم سے اسحاق ازرق نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے عبدالعزیز بن رفیع کے واسطے سے بیان کیا، کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے ظہر اور عصر کی نماز آٹھویں ذی الحجہ میں کہاں پڑھی تھی؟ اگر آپ کو نبی کریم صلی اللہ علیہ وسلم سے یاد ہے تو مجھے بتائیے۔ انہوں نے جواب دیا کہ منیٰ میں۔ میں نے پوچھا کہ بارہویں تاریخ کو عصر کہاں پڑھی تھی؟ فرمایا کہ محصب میں۔ پھر انہوں نے فرمایا کہ جس طرح تمہارے حکام کرتے ہیں اسی طرح تم بھی کرو۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں نے ابوبکر بن عیاش سے سنا کہ ہم سے عبدالعزیز بن رفیع نے بیان کیا، کہا کہ میں انس رضی اللہ عنہ سے ملا (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور مجھ سے اسماعیل بن ابان نے بیان کیا، کہا کہ ہم سے ابوبکر بن عیاش نے بیان کیا، ان سے عبدالعزیز نے کہا کہ میں آٹھویں تاریخ کو منیٰ گیا تو وہاں انس رضی اللہ عنہ سے ملا۔ وہ گدھی پر سوار ہو کر جا رہے تھے۔ میں نے پوچھا نبی کریم صلی اللہ علیہ وسلم نے اس دن ظہر کی نماز کہاں پڑھی تھی؟ انہوں نے فرمایا دیکھو جہاں تمہارے حاکم لوگ نماز پڑھیں وہیں تم بھی پڑھو۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھے یونس نے ابن شہاب سے خبر دی، کہا کہ مجھے عبیداللہ بن عبداللہ بن عمر رضی اللہ عنہما نے اپنے باپ سے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے منیٰ میں دو رکعات پڑھیں اور ابوبکر اور عمر رضی اللہ عنہما بھی ایسا کرتے رہے اور عثمان رضی اللہ عنہ بھی خلافت کے شروع ایام میں ( دو ) ہی رکعت پڑھتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے شعبہ نے ابواسحاق ہمدانی سے بیان کیا اور ان سے حارثہ بن وہب خزاعی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے منیٰ میں ہمیں دو رکعات پڑھائیں، ہمارا شمار اس وقت سب سے زیادہ تھا اور ہم اتنے بے ڈر کسی وقت میں نہ تھے۔ ( اس کے باوجود ہم کو نماز قصر پڑھائی ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے، ان سے اعمش نے، ان سے ابراہیم نخعی نے، ان سے عبدالرحمٰن بن یزید نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیاکہ میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ منیٰ میں دو رکعت نماز پڑھی اور ابوبکر رضی اللہ عنہ کے ساتھ بھی دو ہی رکعت پڑھی اور عمر رضی اللہ عنہ کے ساتھ بھی دو ہی رکعت، لیکن پھر ان کے بعد تم میں اختلاف ہو گیا تو کاش ان چار رکعتوں کے بدلے مجھ کو دو رکعات ہی نصیب ہوتیں جو ( اللہ کے ہاں ) قبول ہو جائیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے زہری سے بیان کیا اور ان سے سالم ابوالنصر نے بیان کیا، کہا کہ میں نے ام فضل کے غلام عمیر سے سنا، انہوں نے ام فضل رضی اللہ عنہا سے کہ عرفہ کے دن لوگوں کو رسول اللہ صلی اللہ علیہ وسلم کے روزے کے متعلق شک ہوا، اس لیے میں نے آپ کو پینے کے لیے کچھ بھیجا جسے آپ نے پی لیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم کو امام مالک نے محمد بن ابی بکر ثقفی سے خبر دی کہ انہوں نے انس بن مالک رضی اللہ عنہ سے پوچھا۔ جب کہ وہ دونوں صبح کو منیٰ سے عرفات جا رہے تھے۔ کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آپ لوگ آج کے دن کس طرح کرتے تھے؟ انس رضی اللہ عنہ نے بتلایا: کوئی ہم میں سے لبیک پکارتا ہوتا، اس پر کوئی اعتراض نہ کرتا اور کوئی تکبیر کہتا، اس پر کوئی انکار نہ کرتا ( اس حدیث سے معلوم ہوا کہ حاجی کو اختیار ہے لبیک پکارتا رہے یا تکبیر کہتا رہے ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے اور ان سے سالم نے بیان کیا کہ عبدالملک بن مروان نے حجاج بن یوسف کو لکھا کہ حج کے احکام میں عبداللہ بن عمر رضی اللہ عنہما کے خلاف نہ کرے۔ سالم نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما عرفہ کے دن سورج ڈھلتے ہی تشریف لائے میں بھی ان کے ساتھ تھا۔ آپ نے حجاج کے خیمہ کے پاس بلند آواز سے پکارا۔ حجاج باہر نکلا اس کے بدن میں ایک کسم میں رنگی ہوئی چادر تھی۔ اس نے پوچھا ابوعبدالرحمٰن! کیا بات ہے؟ آپ نے فرمایا اگر سنت کے مطابق عمل چاہتے ہو تو جلدی اٹھ کر چل کھڑے ہو جاؤ۔ اس نے کہا کیا اسی وقت؟ عبداللہ نے فرمایا کہ ہاں اسی وقت۔ حجاج نے کہا کہ پھر تھوڑی سی مہلت دیجئیے کہ میں اپنے سر پر پانی ڈال لوں یعنی غسل کر لوں پھر نکلتا ہوں۔ اس کے بعد عبداللہ بن عمر رضی اللہ عنہما ( سواری سے ) اتر گئے اور جب حجاج باہر آیا تو میرے اور والد ( ابن عمر ) کے درمیان چلنے لگا تو میں نے کہا کہ اگر سنت پر عمل کا ارادہ ہے تو خطبہ میں اختصار اور وقوف ( عرفات ) میں جلدی کرنا۔ اس بات پر وہ عبداللہ بن عمر رضی اللہ عنہما کی طرف دیکھنے لگا عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ یہ سچ کہتا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک رحمہ اللہ نے، ان سے ابوالنضر نے، ان سے عبداللہ بن عباس رضی اللہ عنہما کے غلام عمیر نے، ان سے ام فضل بنت حارث رضی اللہ عنہا نے کہا کہ ان کے یہاں لوگوں کا عرفات کے دن رسول اللہ صلی اللہ علیہ وسلم کے روزے سے متعلق کچھ اختلاف ہو گیا، بعض نے کہا کہ آپ صلی اللہ علیہ وسلم ( عرفہ کے دن ) روزے سے ہیں اور بعض کہتے ہیں کہ نہیں، اس لیے انہوں نے آپ کے پاس دودھ کا ایک پیالہ بھیجا، نبی کریم صلی اللہ علیہ وسلم اس وقت اونٹ پر سوا ہو کر عرفات میں وقوف فرما رہے تھے، آپ نے وہ دودھ پی لیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "لیث نے بیان کیا کہ مجھ سے عقیل نے ابن شہاب سے بیان کیا، انہوں نے کہا کہ مجھے سالم نے خبر دی کہ حجاج بن یوسف جس سال عبداللہ بن زبیر رضی اللہ عنہما سے لڑنے کے لیے مکہ میں اترا تو اس موقع پر اس نے عبداللہ بن عمر رضی اللہ عنہما سے پوچھا کہ عرفہ کے دن وقوف میں آپ کیا کرتے تھے؟ اس پر سالم رحمہ اللہ بولے کہ اگر تو سنت پر چلنا چاہتا ہے تو عرفہ کے دن نماز دوپہر ڈھلتے ہی پڑھ لینا۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ سالم نے سچ کہا، صحابہ رضی اللہ عنہم نبی کریم صلی اللہ علیہ وسلم کی سنت کے مطابق ظہر اور عصر ایک ہی ساتھ پڑھتے تھے۔ میں نے سالم سے پوچھا کہ کیا رسول اللہ صلی اللہ علیہ وسلم نے بھی اسی طرح کیا تھا؟ سالم نے فرمایا اور کس کی سنت پر اس مسئلہ میں چلتے ہو۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں سالم بن عبداللہ نے کہ عبدالملک بن مروان (خلیفہ) نے حجاج کو لکھا کہ حج کے کاموں میں عبداللہ بن عمر رضی اللہ عنہما کی اقتداء کرے۔ جب عرفہ کا دن آیا تو عبداللہ بن عمر رضی اللہ عنہما آئے میں بھی آپ کے ساتھ تھا، سورج ڈھل چکا تھا، آپ نے حجاج کے ڈیرے کے پاس آ کر بلند آواز سے کہا حجاج کہاں ہے؟ حجاج باہر نکلا تو ابن عمر رضی اللہ عنہما نے فرمایا چل جلدی کر وقت ہو گیا۔ حجاج نے کہا ابھی سے؟ ابن عمر رضی اللہ عنہما نے فرمایا کہ ہاں۔ حجاج بولا کہ پھر تھوڑی مہلت دے دیجئیے، میں ابھی غسل کر کے آتا ہوں۔ پھر عبداللہ بن عمر رضی اللہ عنہما ( اپنی سواری سے ) اتر گئے۔ حجاج باہر نکلا اور میرے اور میرے والد ( ابن عمر ) کے بیچ میں چلنے لگا، میں نے اس سے کہا کہ آج اگر سنت پر عمل کی خواہش ہے تو خطبہ مختصر پڑھ اور وقوف میں جلدی کر۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ سالم سچ کہتا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے عمرو بن دینار نے بیان کیا، کہا ہم سے محمد بن جبیر بن مطعم نے، ان سے ان کے باپ نے کہ میں اپنا ایک اونٹ تلاش کر رہا تھا (دوسری سند) اور ہم سے مسدد نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمر بن دینار نے، انہوں نے محمد بن جبیر سے سنا کہ ان کے والد جبیر بن مطعم نے بیان کیا کہ میرا ایک اونٹ کھو گیا تھا تو میں عرفات میں اس کو تلاش کرنے گیا، یہ دن عرفات کا تھا، میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم عرفات کے میدان میں کھڑے ہیں۔ میری زبان سے نکلا قسم اللہ کی! یہ تو قریش ہیں پھر یہ یہاں کیوں ہیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "ہم سے فروہ بن ابی المغراء نے بیان کیا، انہوں نے کہا کہ ہم سے علی بن مسہر نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے عروہ بن زبیر رضی اللہ عنہ نے کہا کہ حمس کے سوا بقیہ سب لوگ جاہلیت میں ننگے ہو کر طواف کرتے تھے، حمس قریش اور اس کی آل اولاد کو کہتے تھے، ( اور بنی کنانہ وغیرہ، جیسے خزاعہ ) لوگوں کو ( اللہ کے واسطے ) کپڑے دیا کرتے تھے۔ ( قریش ) کے مرد دوسرے مردوں کو تاکہ انہیں پہن کر طواف کر سکیں اور ( قریش کی ) عورتیں دوسری عورتوں کو تاکہ وہ انہیں پہن کر طواف کر سکیں، اور جن کو قریش کپڑا نہیں دیتے وہ بیت اللہ کا طواف ننگے ہو کر کرتے۔ دوسرے سب لوگ تو عرفات سے واپس ہوتے لیکن قریش مزدلفہ ہی سے ( جو حرم میں تھا ) واپس ہو جاتے۔ ہشام بن عروہ نے کہا کہ میرے باپ عروہ بن زبیر نے مجھے ام المؤمنین عائشہ رضی اللہ عنہا سے خبر دی کہ یہ آیت قریش کے بارے میں نازل ہوئی کہ ”پھر تم بھی ( قریش ) وہیں سے واپس آؤ جہاں سے اور لوگ واپس آتے ہیں“ ( یعنی عرفات سے، سورۃ البقرہ ) انہوں نے بیان کیا کہ قریش مزدلفہ ہی سے لوٹ آتے تھے اس لیے انہیں بھی عرفات سے لوٹنے کا حکم ہوا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، کہا ہم کو امام مالک نے ہشام بن عروہ سے خبر دی، ان سے ان کے والد نے بیان کیا کہ ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، کہا ہم کو امام مالک نے ہشام بن عروہ سے خبر دی، ان سے ان کے والد نے بیان کیا کہ",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے یحییٰ بن سعید نے، ان سے موسیٰ بن عقبہ نے ان سے عبداللہ بن عباس رضی اللہ عنہما کے غلام کریب نے اور ان سے اسامہ بن زید رضی اللہ عنہما نے کہ جب رسول اللہ صلی اللہ علیہ وسلم عرفات سے واپس ہوئے تھے تو آپ صلی اللہ علیہ وسلم ( راہ میں ) ایک گھاٹی کی طرف مڑے اور وہاں قضائے حاجت کی پھر آپ صلی اللہ علیہ وسلم نے وضو کیا تو میں نے پوچھا یا رسول اللہ! کیا ( آپ صلی اللہ علیہ وسلم مغرب کی ) نماز پڑھیں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا نماز آگے چل کر پڑھی جائے گی۔ ( یعنی عرفات سے مزدلفہ آتے ہوئے قضائے حاجت وغیرہ کے لیے راستہ میں رکنے میں کوئی حرج نہیں ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے کہا کہ ہم سے جویریہ نے نافع سے بیان کیا، انہوں نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما مزدلفہ میں آ کر نماز مغرب اور عشاء ملا کر ایک ساتھ پڑھتے، البتہ آپ اس گھاٹی میں بھی مڑتے جہاں رسول اللہ صلی اللہ علیہ وسلم مڑے تھے۔ وہاں آپ قضائے حاجت کرتے پھر وضو کرتے لیکن نماز نہ پڑھتے، نماز آپ مزدلفہ میں آ کر پڑھتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن سوید نے بیان کیا، کہا مجھ سے مطلب کے غلام عمرو بن ابی عمرو نے بیان کیا، انہیں والیہ کوفی کے غلام سعید بن جبیر نے خبر دی، ان سے عبداللہ بن عباس رضی اللہ عنما نے بیان کیا کہ عرفہ کے دن ( میدان عرفات سے ) وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ آ رہے تھے نبی کریم صلی اللہ علیہ وسلم نے پیچھے سخت شور ( اونٹ ہانکنے کا ) اور اونٹوں کی مار دھاڑ کی آواز سنی تو آپ نے ان کی طرف اپنے کوڑے سے اشارہ کیا اور فرمایا کہ لوگو! آہستگی و وقار اپنے اوپر لازم کر لو، ( اونٹوں کو ) تیز دوڑانا کوئی نیکی نہیں ہے۔ امام بخاری رحمہ اللہ فرماتے ہیں کہ ( سورۃ البقرہ میں ) «أوضعوا» کے معنی ریشہ دوانیاں کریں، «خلالكم» کا معنی تمہارے بیچ میں، اسی سے ( سورۃ الکہف ) میں آیا ہے «وفجرنا خلالهما‏» یعنی ان کے بیچ میں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم سے امام مالک نے کہا، انہیں موسیٰ بن عقبہ نے خبر دی، انہیں کریب نے، انہوں نے اسامہ بن زید رضی اللہ عنہما کو یہ کہتے سنا کہ میدان عرفات سے رسول اللہ صلی اللہ علیہ وسلم روانہ ہو کر گھاٹی میں اترے ( جو مزدلفہ کے قریب ہے ) وہاں پیشاب کیا، پھر وضو کیا اور پورا وضو نہیں کیا ( خوب پانی نہیں بہایا ہلکا وضو کیا ) میں نے نماز کے متعلق عرض کی تو فرمایا کہ نماز آگے ہے۔ اب آپ صلی اللہ علیہ وسلم مزدلفہ تشریف لائے وہاں پھر وضو کیا اور پوری طرح کیا پھر نماز کی تکبیر کہی گئی اور آپ صلی اللہ علیہ وسلم نے مغرب کی نماز پڑھی پھر ہر شخص نے اپنے اونٹ ڈیروں پر بٹھا دیئے پھر دوبارہ نماز عشاء کے لیے تکبیر کہی گئی اور آپ صلی اللہ علیہ وسلم نے نماز پڑھی، آپ صلی اللہ علیہ وسلم نے ان دونوں نمازوں کے درمیان کوئی ( سنت یا نفل ) نماز نہیں پڑھی تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "ہم سے آدم بن ابی العلاء نے بیان کیا، کہا ہم سے ابن ابی ذئب نے بیان کیا، ان سے زہری نے ان سے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ ہم سے آدم بن ابی العلاء نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے ان سے سالم بن عبداللہ بن عمر ؓ نے اور ان سے عبداللہ بن عمر ؓ نے بیان کیا کہ مزدلفہ میں نبی کریم ﷺ نے مغرب اور عشاء ایک ساتھ ملا کر پڑھیں تھیں ہر نماز الگ الگ تکبیر کے ساتھ نہ ان دونوں کے درمیان کوئی نفل و سنت پڑھی تھی اور نہ ان کے بعد ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، انہوں نے کہا کہ ہم سے سلیمان بن بلال نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن ابی سعید نے بیان کیا، انہوں نے کہا کہ مجھے عدی بن ثابت نے خبر دی، کہا کہ مجھ سے عبداللہ بن یزید خطمی نے بیان کیا، کہا کہ مجھ سے ابوایوب انصاری رضی اللہ عنہ نے کہا کہ حجۃ الوداع کے موقع پر رسول اللہ صلی اللہ علیہ وسلم نے مزدلفہ میں آ کر مغرب اور عشاء کو ایک ساتھ ملا کر پڑھا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "ہم سے عمرو بن خالد نے بیان کیا، کہا کہ ہم سے زہیر نے بیان کیا، کہا کہ ہم سے ابواسحٰق عمرو بن عبداللہ نے بیان کیا، کہا کہ میں نے عبدالرحمٰن بن یزید سے سنا کہ عبداللہ بن مسعود رضی اللہ عنہ نے حج کیا، آپ کے ساتھ تقریباً عشاء کی اذان کے وقت ہم مزدلفہ میں بھی آئے، آپ نے ایک شخص کو حکم دیا اس نے اذان اور تکبیر کہی اور آپ نے مغرب کی نماز پڑھی، پھر دو رکعت ( سنت ) اور پڑھی اور شام کا کھانا منگوا کر کھایا۔ میرا خیال ہے ( راوی حدیث زہیر کا ) کہ پھر آپ نے حکم دیا اور اس شخص نے اذان دی اور تکبیر کہی عمرو ( راوی حدیث ) نے کہا میں یہی سمجھتا ہوں کہ شک زہیر ( عمرو کے شیخ ) کو تھا، اس کے بعد عشاء کی نماز دو رکعت پڑھی۔ جب صبح صادق ہوئی تو آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم اس نماز ( فجر ) کو اس مقام اور اس دن کے سوا اور کبھی اس وقت ( طلوع فجر ہوتے ہی ) نہیں پڑھتے تھے، عبداللہ بن مسعود رضی اللہ عنہ نے یہ بھی فرمایا کہ یہ صرف دو نمازیں ( آج کے دن ) اپنے معمولی وقت سے ہٹا دی جاتی ہیں۔ جب لوگ مزدلفہ آتے ہیں تو مغرب کی نماز ( عشاء کے ساتھ ملا کر ) پڑھی جاتی ہے اور فجر کی نماز طلوع فجر کے ساتھ ہی۔ انہوں نے فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسی طرح کرتے دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا کہ ہم سے لیث بن یونس نے بیان کیا، اور ان سے ابن شہاب نے بیان کیا کہ سالم نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما اپنے گھر کے کمزوروں کو پہلے ہی بھیج دیا کرتے تھے اور وہ رات ہی میں مزدلفہ میں مشعر حرام کے پاس آ کر ٹھہرتے اور اپنی طاقت کے مطابق اللہ کا ذکر کرتے تھے، پھر امام کے ٹھہرنے اور لوٹنے سے پہلے ہی ( منیٰ ) آ جاتے تھے، بعض تو منیٰ فجر کی نماز کے وقت پہنچتے اور بعض اس کے بعد، جب منیٰ پہنچتے تو کنکریاں مارتے اور عبداللہ بن عمر رضی اللہ عنہما فرمایا کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سب لوگوں کے لیے یہ اجازت دی ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے ایوب سختیانی نے، ان سے عکرمہ نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے مجھے مزدلفہ سے رات ہی میں منیٰ روانہ کر دیا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، کہا کہ مجھے عبیداللہ بن ابی یزید نے خبر دی، انہوں نے ابن عباس رضی اللہ عنہما کو یہ کہتے سنا کہ میں ان لوگوں میں تھا جنہیں نبی کریم صلی اللہ علیہ وسلم نے اپنے گھر کے کمزور لوگوں کے ساتھ مزدلفہ کی رات ہی میں منیٰ بھیج دیا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، ان سے یحییٰ بن سعید بن قطان نے، ان سے ابن جریج نے بیان کیا کہ ان سے اسماء کے غلام عبداللہ نے بیان کیا کہ ان سے اسماء بنت ابوبکر رضی اللہ عنہما نے کہ وہ رات ہی میں مزدلفہ پہنچ گئیں اور کھڑی ہو کر نماز پڑھنے لگیں، کچھ دیر تک نماز پڑھنے کے بعد پوچھا بیٹے! کیا چاند ڈوب گیا؟ میں نے کہا کہ نہیں، اس لیے وہ دوبارہ نماز پڑھنے لگیں کچھ دیر بعد پھر پوچھا کیا چاند ڈوب گیا؟ میں نے کہا ہاں، انہوں نے کہا کہ اب آگے چلو ( منی کو ) چنانچہ ہم ان کے ساتھ آگے چلے، وہ ( منی میں ) رمی جمرہ کرنے کے بعد پھر واپس آ گئیں اور صبح کی نماز اپنے ڈیرے پر پڑھی میں نے کہا جناب! یہ کیا بات ہوئی کہ ہم نے اندھیرے ہی میں نماز پڑھ لی۔ انہوں نے کہا بیٹے! رسول اللہ صلی اللہ علیہ وسلم نے عورتوں کو اس کی اجازت دی ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا کہ ہم کو سفیان ثوری نے خبر دی، کہا کہ ہم سے عبدالرحمٰن بن قاسم نے بیان کیا، ان سے قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے کہ ام المؤمنین سودہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم سے مزدلفہ کی رات عام لوگوں سے پہلے روانہ ہونے کی اجازت چاہی آپ رضی اللہ عنہا بھاری بھر کم بدن کی عورت تھیں تو نبی کریم صلی اللہ علیہ وسلم نے انہیں اس کی اجازت دے دی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "ہم سے ابونعیم نے بیان کیا، انہوں نے کہا کہ ہم سے افلح بن حمید نے، ان سے قاسم بن محمد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ جب ہم نے مزدلفہ میں قیام کیا تو نبی کریم صلی اللہ علیہ وسلم نے سودہ رضی اللہ عنہا کو لوگوں کے اژدہام سے پہلے روانہ ہونے کی اجازت دے دی تھیں، وہ بھاری بھر کم بدن کی خاتون تھیں، اس لیے آپ نے اجازت دے دی چنانچہ وہ اژدہام سے پہلے روانہ ہو گئیں۔ لیکن ہم وہیں ٹھہرے رہے اور صبح کو آپ صلی اللہ علیہ وسلم کے ساتھ گئے اگر میں بھی سودہ رضی اللہ عنہا کی طرح آپ صلی اللہ علیہ وسلم سے اجازت لیتی تو مجھ کو تمام خوشی کی چیزوں میں یہ بہت ہی پسند ہوتا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا، کہا کہ مجھ سے میرے باپ نے بیان کیا، کہا کہ ہم سے اعمش نے بیان کیا، کہا کہ مجھ سے عمارہ نے عبدالرحمٰن بن یزید سے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ دو نمازوں کے سوا میں نے نبی کریم صلی اللہ علیہ وسلم کو اور کوئی نماز بغیر وقت نہیں پڑھتے دیکھا، آپ صلی اللہ علیہ وسلم نے مغرب اور عشاء ایک ساتھ پڑھیں اور فجر کی نماز بھی اس دن ( مزدلفہ میں ) معمول کے وقت سے پہلے ادا کی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "ہم سے عبداللہ بن رجاء نے بیان کیا، کہا کہ ہم سے اسرائیل نے بیان کیا، ان سے ابواسحٰق نے، ان سے عبدالرحمٰن بن یزید نے کہ ہم عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ مکہ کی طرف نکلے ( حج شروع کیا ) پھر جب ہم مزدلفہ آئے تو آپ نے دو نمازیں ( اس طرح ایک ساتھ ) پڑھیں کہ ہر نماز ایک الگ اذان اور ایک الگ اقامت کے ساتھ تھی اور رات کا کھانا دونوں کے درمیان میں کھایا، پھر طلوع صبح کے ساتھ ہی آپ نے نماز فجر پڑھی، کوئی کہتا تھا کہ ابھی صبح صادق نہیں ہوئی اور کچھ لوگ کہہ رہے تھے کہ ہو گئی۔ اس کے بعد عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا یہ دونوں نمازیں اس مقام سے ہٹا دی گئیں ہیں، یعنی مغرب اور عشاء، مزدلفہ میں اس وقت داخل ہوں کہ اندھیرا ہو جائے اور فجر کی نماز اس وقت۔ پھر عبداللہ اجالے تک وہیں مزدلفہ میں ٹھہرے رہے اور کہا کہ اگر امیرالمؤمنین عثمان رضی اللہ عنہ اس وقت چلیں تو یہ سنت کے مطابق ہو گا۔ ( حدیث کے راوی عبدالرحمٰن بن یزید نے کہا ) میں نہیں کہہ سکتا کہ یہ الفاظ ان کی زبان سے پہلے نکلے یا عثمان رضی اللہ عنہ کی روانگی پہلے شروع ہوئی، آپ دسویں تاریخ تک جمرہ عقبہ کی رمی تک برابر لبیک پکارتے رہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا، ان سے ابواسحٰق نے، انہوں نے عمرو بن میمون کو یہ کہتے سنا کہ جب عمر بن خطاب رضی اللہ عنہ نے مزدلفہ میں فجر کی نماز پڑھی تو میں بھی موجود تھا، نماز کے بعد آپ ٹھہرے اور فرمایا کہ مشرکین ( جاہلیت میں یہاں سے ) سورج نکلنے سے پہلے نہیں جاتے تھے کہتے تھے اے ثبیر! تو چمک جا۔ نبی کریم صلی اللہ علیہ وسلم نے مشرکوں کی مخالفت کی اور سورج نکلنے سے پہلے وہاں سے روانہ ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا، انہیں ابن جریج نے خبر دی، انہیں عطاء نے، انہیں ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے ( مزدلفہ سے لوٹتے وقت ) فضل ( بن عباس رضی اللہ عنہما ) کو اپنے پیچھے سوار کرایا تھا۔ فضل رضی اللہ عنہ نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم رمی جمرہ تک برابر لبیک پکارتے رہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "ہم سے اسحاق بن منصور نے بیان کیا، انہیں نضر بن شمیل نے خبر دی، انہیں شعبہ نے خبر دی، ان سے ابوجمرہ نے بیان کیا، کہا کہ میں نے ابن عباس رضی اللہ عنہما سے تمتع کے بارے میں پوچھا تو آپ نے مجھے اس کے کرنے کا حکم دیا، پھر میں نے قربانی کے متعلق پوچھا تو آپ نے فرمایا کہ تمتع میں ایک اونٹ، یا ایک گائے یا ایک بکری ( کی قربانی واجب ہے ) یا کسی قربانی ( اونٹ، یا گائے بھینس کی ) میں شریک ہو جائے، ابوجمرہ نے کہا کہ بعض لوگ تمتع کو ناپسندیدہ قرار دیتے تھے۔ پھر میں سویا تو میں نے خواب میں دیکھا کہ ایک شخص پکار رہا ہے یہ حج مبرور ہے اور یہ مقبول تمتع ہے۔ اب میں ابن عباس رضی اللہ عنہما کی خدمت میں حاضر ہوا اور ان سے خواب کا ذکر کیا تو انہوں نے فرمایا: اللہ اکبر! یہ تو ابوالقاسم صلی اللہ علیہ وسلم کی سنت ہے۔ کہا کہ وہب بن جریر اور غندر نے شعبہ کے حوالہ سے یوں نقل کیا ہے «عمرة متقبلة،‏‏‏‏ وحج مبرور‏» ( اس میں عمرہ کا ذکر پہلے ہے یعنی یہ عمرہ مقبول اور حج مبرور ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم سے امام مالک نے خبر دی، انہیں ابوالزناد نے، انہیں اعرج اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو قربانی کا جانور لے جاتے دیکھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو جا۔ اس شخص نے کہا کہ یہ تو قربانی کا جانور ہے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو جانا۔ اس نے کہا کہ یہ تو قربانی کا جانور ہے تو آپ صلی اللہ علیہ وسلم نے پھر فرمایا افسوس! سوار بھی ہو جاؤ ( «ويلك» آپ صلی اللہ علیہ وسلم نے ) دوسری یا تیسری مرتبہ فرمایا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا کہ ہم سے ہشام اور شعبہ نے بیان کیا، کہا کہ ہم سے قتادہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک شخص کو دیکھا کہ قربانی کا جانور لیے جا رہا ہے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو جا اس نے کہا کہ یہ تو قربانی کا جانور ہے آپ صلی اللہ علیہ وسلم نے فرمایا کہ سوا ر ہو جا اس نے پھر عرض کیا کہ یہ تو قربانی کا جانور ہے، لیکن آپ صلی اللہ علیہ وسلم نے تیسری مرتبہ پھر فرمایا کہ سوار ہو جا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے سالم بن عبداللہ نے کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع میں تمتع کیا یعنی عمرہ کر کے پھر حج کیا اور آپ صلی اللہ علیہ وسلم ذی الحلیفہ سے اپنے ساتھ قربانی لے گئے۔ نبی کریم صلی اللہ علیہ وسلم نے پہلے عمرہ کے لیے احرام باندھا، پھر حج کے لیے لبیک پکارا۔ لوگوں نے بھی نبی کریم صلی اللہ علیہ وسلم کے ساتھ تمتع کیا یعنی عمرہ کر کے حج کیا، لیکن بہت سے لوگ اپنے ساتھ قربانی کا جانور لے گئے تھے اور بہت سے نہیں لے گئے تھے۔ جب نبی کریم صلی اللہ علیہ وسلم مکہ تشریف لائے تو لوگوں سے کہا کہ جو شخص قربانی ساتھ لایا ہو اس کے لیے حج پورا ہونے تک کوئی بھی ایسی چیز حلال نہیں ہو سکتی جسے اس نے اپنے اوپر ( احرام کی وجہ سے ) حرام کر لیا ہے لیکن جن کے ساتھ قربانی نہیں ہے تو وہ بیت اللہ کا طواف کر لیں اور صفا اور مروہ کی سعی کر کے بال ترشوا لیں اور حلال ہو جائیں، پھر حج کے لیے ( از سر نو آٹھویں ذی الحجہ کو احرام باندھیں ) ایسا شخص اگر قربانی نہ پائے تو تین دن کے روزے حج ہی کے دنوں میں اور سات دن کے روزے گھر واپس آ کر رکھے۔ جب نبی کریم صلی اللہ علیہ وسلم مکہ پہنچے تو سب سے پہلے آپ صلی اللہ علیہ وسلم نے طواف کیا پھر حجر اسود کو بوسہ دیا، تین چکروں میں آپ صلی اللہ علیہ وسلم نے رمل کیا اور باقی چار میں معمولی رفتار سے چلے، پھر بیت اللہ کا طواف پورا کر کے مقام ابراہیم کے پاس دو رکعت نماز پڑھی سلام پھیر کر آپ صلی اللہ علیہ وسلم صفا پہاڑی کی طرف آئے اور صفا اور مروہ کی سعی بھی سات چکروں میں پوری کی۔ جن چیزوں کو ( احرام کی وجہ سے اپنے پر ) حرام کر لیا تھا ان سے اس وقت تک آپ صلی اللہ علیہ وسلم حلال نہیں ہوئے جب تک حج بھی پورا نہ کر لیا اور یوم النحر ( دسویں ذی الحجہ ) میں قربانی کا جانور بھی ذبح نہ کر لیا۔ پھر آپ صلی اللہ علیہ وسلم ( مکہ واپس ) آئے اور بیت اللہ کا جب طواف افاضہ کر لیا تو ہر وہ چیز آپ کے لیے حلال ہو گئی جو احرام کی وجہ سے حرام تھی جو لوگ اپنے ساتھ ہدی لے کر گئے تھے انہوں نے بھی اسی طرح کیا جیسے رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "عروہ سے روایت ہے کہ عائشہ رضی اللہ عنہا نے انہیں نبی کریم صلی اللہ علیہ وسلم کے حج اور عمرہ ایک ساتھ کرنے کی خبر دی کہ اور لوگوں نے بھی آپ کے ساتھ حج اور عمرہ ایک ساتھ کیا تھا، بالکل اسی طرح جیسے مجھے سالم نے ابن عمر رضی اللہ عنہما سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے خبر دی تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے حماد نے بیان کیا، ان سے ایوب نے، ان سے نافع نے بیان کیا کہ عبیداللہ بن عبداللہ بن عمر رضی اللہ عنہما نے اپنے والد سے کہا (جب وہ حج کے لیے نکل رہے تھے) کہ آپ نہ جائیے کیوں کہ میرا خیال ہے کہ ( بدامنی کی وجہ سے ) آپ کو بیت اللہ تک پہنچنے سے روک دیا جائے گا۔ انہوں نے فرمایا کہ پھر میں بھی وہی کام کروں گا جو ( ایسے موقعہ پر ) رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا اللہ تعالیٰ نے فرمایا ہے کہ ”تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے“ میں اب تمہیں گواہ بناتا ہوں کہ میں نے اپنے اوپر عمرہ واجب کر لیا ہے، چنانچہ آپ نے عمرہ کا احرام باندھا، انہوں نے بیان کیا کہ پھر آپ نکلے اور جب بیداء پہنچے تو حج اور عمرہ دونوں کا احرام باندھ لیا اور فرمایا کہ حج اور عمرہ دونوں تو ایک ہی ہیں اس کے بعد قدید پہنچ کر ہدی خریدی پھر مکہ آ کر دونوں کے لیے طواف کیا اور درمیان میں نہیں بلکہ دونوں سے ایک ہی ساتھ حلال ہوئے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے افلح نے بیان کیا، ان سے قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے ہار میں نے اپنے ہاتھ سے خود بٹے تھے، پھر آپ صلی اللہ علیہ وسلم نے انہیں ہار پہنایا، اشعار کیا، ان کو مکہ کی طرف روانہ کیا پھر بھی آپ کے لیے جو چیزیں حلال تھیں وہ ( احرام سے پہلے صرف ہدی سے ) حرام نہیں ہوئیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے عبیداللہ نے کہ مجھے نافع نے خبر دی انہیں ابن عمر رضی اللہ عنہما نے کہ حفصہ رضی اللہ عنہا نے بیان کیا، کہا میں نے کہا: یا رسول اللہ! اور لوگ تو حلال ہو گئے لیکن آپ حلال نہیں ہوئے، اس کی کیا وجہ ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اپنے سر کے بالوں کو جما لیا ہے اور اپنی ہدی کو قلادہ پہنا دیا ہے، اس لیے جب تک حج سے بھی حلال نہ ہو جاؤں میں ( درمیان میں ) حلال نہیں ہو سکتا، ( گوند لگا کر سر کے بالوں کا جما لینا اس کو تلبید کہتے ہیں ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث نے بیان کیا، کہا ہم سے ابن شہاب نے بیان کیا، ان سے عروہ اور عمرہ بنت عبدالرحمٰن نے کہ عائشہ رضی اللہ عنہا نے بیان کیا رسول اللہ صلی اللہ علیہ وسلم مدینہ سے ہدی ساتھ لے کر چلتے تھے اور میں ان کے قلادے بٹا کرتی تھی پھر بھی آپ ( احرام باندھنے سے پہلے ) ان چیزوں سے پرہیز نہیں کرتے تھے جن سے ایک محرم پرہیز کرتا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، انہوں نے کہا ہم سے افلح بن حمید نے بیان کیا، ان سے قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کی ہدی کے قلادے خود بٹے تھے، پھر آپ صلی اللہ علیہ وسلم نے انہیں اشعار کیا اور ہار پہنایا، یا میں نے ہار پہنایا، پھر آپ صلی اللہ علیہ وسلم نے بیت اللہ کے لیے انہیں بھیج دیا اور خود مدینہ میں ٹھہر گئے لیکن کوئی بھی ایسی چیز آپ صلی اللہ علیہ وسلم کے لیے حرام نہیں ہوئی جو آپ صلی اللہ علیہ وسلم کے لیے حلال تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی، انہیں عبداللہ بن ابی بکر بن عمرو بن حزم نے خبر دی، انہیں عمرہ بنت عبدالرحمٰن نے خبر دی کہ زیاد بن ابی سفیان نے عائشہ رضی اللہ عنہا کو لکھا کہ عبداللہ بن عباس رضی اللہ عنہما نے فرمایا ہے کہ جس نے ہدی بھیج دی اس پر وہ تمام چیزیں حرام ہو جاتی ہیں جو ایک حاجی پر حرام ہوتی ہیں تاآنکہ اس کی ہدی کی قربانی کر دی جائے، عمرہ نے کہا کہ اس پر عائشہ رضی اللہ عنہا نے فرمایا عبداللہ بن عباس رضی اللہ عنہما نے جو کچھ کہا مسئلہ اس طرح نہیں ہے، میں نے نبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے قلادے اپنے ہاتھوں سے خود بٹے ہیں، پھر نبی کریم صلی اللہ علیہ وسلم نے اپنے ہاتھوں سے ان جانوروں کو قلادہ پہنایا اور میرے والد محترم ( ابوبکر رضی اللہ عنہ ) کے ساتھ انہیں بھیج دیا لیکن اس کے باوجود آپ صلی اللہ علیہ وسلم نے کسی بھی ایسی چیز کو اپنے اوپر حرام نہیں کیا جو اللہ نے آپ صلی اللہ علیہ وسلم کے لیے حلال کی تھی، اور ہدی کی قربانی بھی کر دی گئی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": 1701,
			"text": "ہم سے نعیم نے بیان کیا، ان سے اعمش نے بیان کیا، ان سے ابراہیم نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک مرتبہ رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے لیے ( بیت اللہ ) بکریاں بھیجی تھیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": 1702,
			"text": "ہم سے ابوالنعمان نے بیان کیا، ان سے عبدالواحد نے بیان کیا، ان سے اعمش نے بیان کیا، ان سے ابراہیم نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے کہ میں نبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے قلادہ خود بٹا کرتی تھی، نبی کریم صلی اللہ علیہ وسلم نے بکری کو بھی قلادہ پہنایا تھا اور آپ صلی اللہ علیہ وسلم خود اپنے گھر اس حال میں مقیم تھے کہ آپ صلی اللہ علیہ وسلم حلال تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": 1703,
			"text": "ہم سے ابوالنعمان نے بیان کیا، ان سے حماد نے بیان کیا، ان سے منصور بن معتمر نے (دوسری سند) اور ہم سے محمد بن کثیر نے بیان کیا، انہیں سفیان نے خبر دی، انہیں منصور نے، انہیں ابراہیم نے، انہیں اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی بکریوں کے قلادے خود بٹا کرتی تھی، نبی کریم صلی اللہ علیہ وسلم انہیں ( بیت اللہ کے لیے ) بھیج دیتے اور خود حلال ہی ہونے کی حالت میں اپنے گھر ٹھہر رہتے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے زکریا نے بیان کیا، ان سے عامر نے، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی قربانی کے لیے خود قلادے بٹے ہیں۔ ان کی مراد احرام سے پہلے کے قلادوں سے تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": 1705,
			"text": "ہم سے عمرو بن علی نے بیان کیا، انہوں نے کہا کہ ہم سے معاذ بن معاذ نے بیان کیا، ان سے ابن عون نے بیان کیا، ان سے قاسم نے بیان کیا، ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ میرے پاس جو اون تھی ان کے ہار میں نے قربانی کے جانوروں کے لیے خود بٹے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": 1706,
			"text": "ہم سے محمد نے بیان کیا، کہا ہم کو عبدالاعلیٰ نے خبر دی، انہیں معمر نے، انہیں یحییٰ بن ابی کثیر نے، انہیں عکرمہ نے، انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک آدمی کو دیکھا کہ وہ قربانی کا اونٹ لیے جا رہا ہے آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو جا، اس نے کہا کہ یہ تو قربانی کا ہے تو آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ سوار ہو جا۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ پھر میں نے دیکھا کہ وہ اس پر سوار ہے اور نبی کریم صلی اللہ علیہ وسلم کے ساتھ چل رہا ہے اور جوتے ( کا ہار ) اس اونٹ کے گردن میں ہے۔ اس روایت کی متابعت محمد بن بشار نے کی ہے۔ ہم سے عثمان بن عمر نے بیان کیا، ہم کو علی بن مبارک نے خبر دی، انہیں یحییٰ نے انہیں عکرمہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ( مثل سابق حدیث کے ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": 1707,
			"text": "ہم سے قبیصہ نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا، ان سے ابن ابی نجیح نے، ان سے مجاہد نے، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے ان قربانی کے جانوروں کے جھول اور ان کے چمڑے کو صدقہ کرنے کا حکم دیا تھا جن کی قربانی میں نے کر دی تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": 1708,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، کہا کہ ہم سے ابوضمرہ نے بیان کیا، ان سے موسیٰ بن عقبہ نے بیان کیا، ان سے نافع نے کہ ابن عمر رضی اللہ عنہما نے ابن زبیر رضی اللہ عنہما کے عہد خلافت میں حجۃ الحروریہ کے سال حج کا ارادہ کیا تو ان سے کہا گیا کہ لوگوں میں باہم قتل و خون ہونے والا ہے اور ہم کو خطرہ اس کا ہے کہ آپ کو ( مفسد لوگ حج سے ) روک دیں، آپ نے جواب میں یہ آیت سنائی کہ ”تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے۔“ اس وقت میں بھی وہی کام کروں گا جو نبی کریم صلی اللہ علیہ وسلم نے کیا تھا۔ میں تمہیں گواہ بناتا ہوں کہ میں نے اپنے اوپر عمرہ واجب کر لیا ہے، پھر جب آپ بیداء کے بالائی حصہ تک پہنچے تو فرمایا کہ حج اور عمرہ تو ایک ہی ہے میں تمہیں گواہ بناتا ہوں کہ عمرہ کے ساتھ میں نے حج کو بھی جمع کر لیا ہے، پھر آپ نے ایک ہدی بھی ساتھ لے لی جسے ہار پہنایا گیا تھا۔ آپ نے اسے خرید لیا یہاں تک کہ آپ مکہ آئے تو بیت اللہ کا طواف اور صفا و مروہ کی سعی کی، اس سے زیادہ اور کچھ نہیں کیا جو چیزیں ( احرام کی وجہ سے ان پر ) حرام تھیں ان میں سے کسی سے قربانی کے دن تک وہ حلال نہیں ہوئے، پھر سر منڈوایا اور قربانی کی وجہ یہ سمجھتے تھے کہ اپنا پہلا طواف کر کے انہوں نے حج اور عمرہ دونوں کا طواف پورا کر لیا ہے پھر آپ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے بھی اسی طرح کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": 1709,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں یحییٰ بن سعید نے، ان سے عمرہ بنت عبدالرحمٰن نے بیان کیا کہ میں نے عائشہ رضی اللہ عنہا سے سنا، انہوں نے بتلایا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حج کے لیے ) نکلے تو ذی قعدہ میں سے پانچ دن باقی رہے تھے ہم صرف حج کا ارادہ لے کر نکلے تھے، جب ہم مکہ کے قریب پہنچے تو رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ جن لوگوں کے ساتھ قربانی نہ ہو وہ جب طواف کر لیں اور صفا و مروہ کی سعی بھی کر لیں تو حلال ہو جائیں گے، عائشہ رضی اللہ عنہا نے کہا کہ قربانی کے دن ہمارے گھر گائے کا گوشت لایا گیا تو میں نے کہا کہ یہ کیا ہے؟ ( لانے والے نے بتلایا ) کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے یہ قربانی کی ہے، یحییٰ نے کہا کہ میں نے عمرہ کی یہ حدیث قاسم سے بیان کی انہوں نے کہا عمرہ نے یہ حدیث ٹھیک ٹھیک بیان کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": 1710,
			"text": "ہم سے اسحاق بن ابراہیم بن راہویہ نے بیان کیا، انہوں نے خالد بن حارث سے سنا، کہا ہم سے عبیداللہ بن عمر نے بیان کیا، ان سے نافع نے کہ عبداللہ رضی اللہ عنہ نحر کرنے کی جگہ نحر کرتے تھے، عبیداللہ بن بتایا کہ مراد نبی کریم صلی اللہ علیہ وسلم کے نحر کرنے کی جگہ سے تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، کہا ہم سے انس بن عیاض نے بیان کیا، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا، ان سے نافع نے کہ ابن عمر رضی اللہ عنہما اپنی قربانی کے جانوروں کو مزدلفہ سے آخر رات میں منیٰ بھجوا دیتے، یہ قربانیاں جن میں حاجی لوگ نیز غلام اور آزاد دونوں طرح کے لوگ ہوتے، اس مقام میں لے جاتے جہاں نبی کریم صلی اللہ علیہ وسلم نحر کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "ہم سے سہل بن بکار نے بیان کیا، انہوں نے کہا کہ ہم سے وہیب نے بیان کیا، ان سے ایوب نے، ان سے ابوقلابہ نے، ان سے انس بن مالک رضی اللہ عنہ نے اور انہوں نے مختصر حدیث بیان کی اور یہ بھی بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے سات اونٹ کھڑے کر کے اپنے ہاتھ سے نحر کئے اور مدینہ میں دو چتکبرے سینگ دار مینڈھوں کی قربانی کی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا، ان سے یونس نے، ان سے زیاد بن جبیر نے کہ میں نے دیکھا کہ عبداللہ بن عمر رضی اللہ عنہما ایک شخص کے پاس آئے جو اپنا اونٹ بٹھا کر نحر کر رہا تھا، عبداللہ رضی اللہ عنہ نے فرمایا کہ اسے کھڑا کر اور باندھ دے، پھر نحر کر کہ یہی رسول اللہ صلی اللہ علیہ وسلم کی سنت ہے۔ شعبہ نے یونس سے بیان کیا کہ مجھے زیادہ نے خبر دی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "ہم سے سہل بن بکار نے بیان کیا، کہا کہ ہم سے وہیب نے بیان کیا، ان سے ایوب نے، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ظہر کی نماز مدینہ میں چار رکعت پڑھی اور عصر کی ذو الحلیفہ میں دو رکعات۔ رات آپ صلی اللہ علیہ وسلم نے وہیں گزاری، پھر جب صبح ہوئی تو آپ صلی اللہ علیہ وسلم اپنی اونٹنی پر سوار ہو کر تہلیل و تسبیح کرنے لگے۔ جب بیداء پہنچے تو آپ صلی اللہ علیہ وسلم نے دونوں ( حج و عمرہ ) کے لیے ایک ساتھ تلبیہ کہا، جب مکہ پہنچے ( اور عمرہ ادا کر لیا ) تو صحابہ رضی اللہ عنہم کو حکم دیا کہ حلال ہو جائیں۔ نبی کریم صلی اللہ علیہ وسلم نے خود اپنے ہاتھ سے سات اونٹ کھڑے کر کے نحر کئے اور مدینہ میں دو چتکبرے سینگوں والے مینڈھے ذبح کئے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے اسماعیل بن علیہ نے بیان کیا، ان سے ایوب نے، ان سے ابوقلابہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ظہر کی نماز مدینہ میں چار رکعت اور عصر کی ذو الحلیفہ میں دو رکعات پڑھی تھیں۔ ایوب نے ایک شخص کے واسطہ سے بروایت انس رضی اللہ عنہ کہا پھر آپ صلی اللہ علیہ وسلم نے وہیں رات گزاری۔ صبح ہوئی تو فجر کی نماز پڑھی اور اپنی اونٹنی پر سوار ہو گئے، پھر جب مقام بیداء پہنچے تو عمرہ اور حج دونوں کا نام لے کر لبیک پکارا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، کہا مجھ کو ابن ابی نجیح نے خبر دی، انہیں مجاہد نے، انہیں عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھے ( قربانی کے اونٹوں کی دیکھ بھال کے لیے ) بھیجا۔ اس لیے میں نے ان کی دیکھ بھال کی، پھر آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا تو میں نے ان کے گوشت تقسیم کئے، پھر آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا تو میں نے ان کے جھول اور چمڑے بھی تقسیم کر دئیے۔ سفیان نے کہا کہ مجھ سے عبدالکریم نے بیان کیا، ان سے مجاہد نے، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ مجھے نبی کریم صلی اللہ علیہ وسلم نے حکم دیا تھا کہ میں قربانی کے اونٹوں کی دیکھ بھال کروں اور ان میں سے کوئی چیز قصائی کی مزدوری میں نہ دوں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "ہم سے مسدد نے بیان کیا کہا کہ، ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے ابن جریج نے بیان کیا، کہا کہ مجھے حسن بن مسلم اور عبدالکریم جزری نے خبر دی کہ مجاہد نے ان دونوں کو خبر دی، انہیں عبدالرحمٰن بن ابی لیلیٰ نے خبر دی، انہیں علی رضی اللہ عنہ نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم نے انہیں حکم دیا تھا کہ آپ صلی اللہ علیہ وسلم کی قربانی کے اونٹوں کی نگرانی کریں اور یہ کہ آپ صلی اللہ علیہ وسلم کے قربانی کے جانوروں کی ہر چیز گوشت چمڑے اور جھول خیرات کر دیں اور قصائی کی مزدوری اس میں سے نہ دیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "ہم سے ابونعیم نے بیان کیا، ان سے سیف بن ابی سلیمان نے بیان کیا، کہا میں نے مجاہد سے سنا، انہوں نے کہا کہ مجھ سے ابن ابی لیلیٰ نے بیان کیا اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ( حجۃ الوداع کے موقع پر ) سو اونٹ قربان کئے، میں نے آپ صلی اللہ علیہ وسلم کے حکم کے مطابق ان کے گوشت بانٹ دئیے، پھر آپ صلی اللہ علیہ وسلم نے ان کے جھول بھی تقسیم کرنے کا حکم دیا اور میں نے انہیں بھی تقسیم کیا، پھر چمڑے کے لیے حکم دیا اور میں نے انہیں بھی بانٹ دیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن سعیدقطان نے، ان سے ابن جریج نے، ان سے عطاء نے، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے فرمایا کہ ہم اپنی قربانی کا گوشت منیٰ کے بعد تین دن سے زیادہ نہیں کھاتے تھے، پھر نبی کریم صلی اللہ علیہ وسلم نے ہمیں اجازت دے دی اور فرمایا کہ کھاؤ بھی اور توشہ کے طور پر ساتھ بھی لے جاؤ، چنانچہ ہم نے کھایا اور ساتھ بھی لائے۔ ابن جریج نے کہا کہ میں نے عطاء سے پوچھا کیا جابر رضی اللہ عنہ نے یہ بھی کہا تھا کہ یہاں تک کہ ہم مدینہ پہنچ گئے، انہوں نے کہا نہیں ایسا نہیں فرمایا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، ان سے سلیمان بن ہلال نے بیان کیا، کہا مجھ سے عمرہ نے بیان کیا، کہا میں نے عائشہ رضی اللہ عنہا سے سنا، انہوں نے فرمایا کہ ہم مدینہ سے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے تو ذی قعدہ کے پانچ دن باقی رہ گئے تھے، ہمارا ارادہ صرف حج ہی کا تھا، پھر جب مکہ کے قریب پہنچے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جن کے ساتھ ہدی نہ ہو وہ بیت اللہ کا طواف کر کے حلال ہو جائیں۔ عائشہ رضی اللہ عنہا نے فرمایا کہ پھر ہمارے پاس بقر عید کے دن گائے کا گوشت لایا گیا تو میں نے پوچھا کہ یہ کیا ہے؟ اس وقت معلوم ہوا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے قربانی کی ہے۔ یحییٰ بن سعید نے کہا کہ میں نے اس حدیث کا قاسم بن محمد سے ذکر کیا تو انہوں نے کہا کہ عمرہ نے تم سے ٹھیک ٹھیک حدیث بیان کر دی ہے۔ ( ہر دو احادیث سے مقصد باب ظاہر ہے ) کہ قربانی کا گوشت کھانے اور بطور توشہ رکھنے کی عام اجازت ہے، خود قرآن مجید میں «فكلوا منها» کا صیغہ موجود ہے کہ اسے غرباء مساکین کو بھی تقسیم کرو اور خود بھی کھاؤ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "ہم سے محمد بن عبداللہ بن حوشب نے بیان کیا، ان سے ہشیم بن بشیر نے بیان کیا، انہیں منصور بن ذاذان نے خبر دی، انہیں عطا بن ابی رباح نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم سے اس شخص کے بارے میں پوچھا گیا جو قربانی کا جانور ذبح کرنے سے پہلے ہی سر منڈوا لے، تو آپ صلی اللہ علیہ وسلم نے فرمایا کوئی قباحت نہیں، کوئی قباحت نہیں۔ ( ترجمہ اور باب میں موافقت ظاہر ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم کو ابوبکر بن عیاش نے خبر دی، انہیں عبدالعزیز بن رفیع نے، انہیں عطا بن ابی رباح نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ یا رسول اللہ! رمی سے پہلے میں نے طواف زیارت کر لیا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں، پھر اس نے کہا اور یا رسول اللہ! قربانی کرنے سے پہلے میں نے سر منڈوا لیا، آپ صلی اللہ علیہ وسلم نے فرمایا کوئی حرج نہیں، پھر اس نے کہا اور قربانی کو رمی سے بھی پہلے کر لیا نبی کریم صلی اللہ علیہ وسلم نے پھر بھی یہی فرمایا کہ کوئی حرج نہیں۔ اور عبدالرحیم رازی نے ابن خشیم سے بیان کیا، کہا کہ عطاء نے خبر دی اور انہیں ابن عباس رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے اور قاسم بن یحییٰ نے کہا کہ مجھ سے ابن خشیم نے بیان کیا، ان سے عطاء نے، ان سے ابن عباس رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے۔ عفان بن مسلم صغار نے کہا کہ میرا خیال ہے کہ وہیب بن خالد سے روایت ہے کہ ابن خثیم نے بیان کیا، ان سے سعید بن جبیر نے، ان سے ابن عباس رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے۔ اور حماد نے قیس بن سعد اور عباد بن منصور سے بیان کیا، ان سے عطاء نے اور ان سے جابر رضی اللہ عنہ نے انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے عبدالاعلیٰ نے بیان کیا، کہا ہم سے خالد نے بیان کیا، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سے ایک آدمی نے مسئلہ پوچھا کہ شام ہونے کے بعد میں نے رمی کی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں۔ سائل نے کہا کہ قربانی کرنے سے پہلے میں نے سر منڈا لیا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "ہم سے عبدان نے بیان کیا، کہا کہ مجھے میرے باپ عثمان نے خبر دی، انہیں شعبہ نے، انہیں قیس بن مسلم نے، انہیں طارق بن شہاب نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ بطحاء میں تھے۔ ( جو مکہ کے قریب ایک جگہ ہے ) آپ صلی اللہ علیہ وسلم نے پوچھا کیا تو نے حج کی نیت کی ہے؟ میں نے کہا کہ ہاں، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تو نے احرام کس چیز کا باندھا ہے میں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کے احرام کی طرح باندھا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو نے اچھا کیا اب جا۔ چنانچہ ( مکہ پہنچ کر ) میں نے بیت اللہ کا طواف کیا اور صفا و مروہ کی سعی کی، پھر میں بنو قیس کی ایک خاتون کے پاس آیا اور انہوں نے میرے سر کی جوئیں نکالی۔ اس کے بعد میں نے حج کی لبیک پکاری۔ اس کے بعد میں عمر رضی اللہ عنہ کے عہد خلافت تک اسی کا فتویٰ دیتا رہا پھر جب میں نے عمر رضی اللہ عنہ سے اس کا ذکر کیا تو آپ رضی اللہ عنہ نے فرمایا کہ ہمیں کتاب اللہ پر بھی عمل کرنا چاہئے اور اس میں پورا کرنے کا حکم ہے، پھر رسول اللہ صلی اللہ علیہ وسلم کی سنت پر بھی عمل کرنا چاہئے اور نبی کریم صلی اللہ علیہ وسلم قربانی سے پہلے حلال نہیں ہوئے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم کو امام مالک نے خبر دی، انہیں نافع نے، انہیں ابن عمر رضی اللہ عنہما نے کہ حفصہ رضی اللہ عنہا نے عرض کی یا رسول اللہ صلی اللہ علیہ وسلم کیا وجہ ہوئی کہ اور لوگ تو عمرہ کر کے حلال ہو گئے اور آپ صلی اللہ علیہ وسلم نے عمرہ کر لیا اور حلال نہ ہوئے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اپنے سر کے بال جما لیے تھے اور قربانی کے گلے میں قلادہ پہنا کر میں ( اپنے ساتھ ) لایا ہوں، اس لیے جب تک میں نحر نہ کر لوں گا میں احرام نہیں کھولوں گا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب بن ابی حمزہ نے خبر دی، ان سے نافع نے بیان کیا کہ ابن عمر رضی اللہ عنہما فرمایا کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر اپنا سر منڈایا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں نافع نے، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے دعا کی اے اللہ! سر منڈوانے والوں پر رحم فرما! صحابہ رضی اللہ عنہم نے عرض کی اور کتروانے والوں پر؟ نبی کریم صلی اللہ علیہ وسلم نے اب بھی دعا کی اے اللہ سر منڈوانے والوں پر رحم فرما! صحابہ رضی اللہ عنہم نے پھر عرض کی اور کتروانے والوں پر؟ اب آپ صلی اللہ علیہ وسلم نے فرمایا اور کتروانے والوں پر بھی، لیث نے کہا کہ مجھ سے نافع نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اللہ نے سر منڈوانے والوں پر رحم کیا ایک یا دو مرتبہ، انہوں نے بیان کیا کہ عبیداللہ نے کہا کہ مجھ سے نافع نے بیان کیا کہ چوتھی مرتبہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ کتروانے والوں پر بھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "ہم سے عیاش بن ولید نے بیان کیا، کہا ہم سے محمد بن فضیل نے بیان کیا، ان سے عمارہ بن قعقاع نے بیان کیا، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے دعا فرمائی اے اللہ! سر منڈوانے والوں کی مغفرت فرما! صحابہ رضی اللہ عنہم نے عرض کیا اور کتروانے والوں کے لیے بھی ( یہی دعا فرمائیے ) لیکن نبی کریم صلی اللہ علیہ وسلم نے اس مرتبہ بھی یہی فرمایا اے اللہ! سر منڈوانے والوں کی مغفرت کر۔ پھر صحابہ رضی اللہ عنہم نے عرض کیا اور کتروانے والوں کی بھی! تیسری مرتبہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اور کتروانے والوں کی بھی مغفرت فرما۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا، کہا ہم سے جویریہ بن اسماء نے، ان سے نافع نے کہ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا نبی کریم صلی اللہ علیہ وسلم اور آپ صلی اللہ علیہ وسلم کے بہت سے اصحاب نے سر منڈوایا تھا لیکن بعض نے کتروایا بھی تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے بیان کیا، ان سے حسن بن مسلم نے بیان کیا، ان سے طاؤس نے بیان کیا، ان سے عبداللہ بن عباس رضی اللہ عنہما اور ان سے معاویہ رضی اللہ عنہ نے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے بال قینچی سے کاٹے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "ہم سے محمد بن ابی بکر نے بیان کیا، ان سے فضیل بن سلیمان نے بیان کیا، ان سے موسیٰ بن عقبہ نے، انہیں کریب نے خبر دی، ان سے ابن عباس رضی اللہ عنہما نے کہا کہ جب نبی کریم صلی اللہ علیہ وسلم مکہ میں تشریف لائے تو آپ صلی اللہ علیہ وسلم نے اپنے اصحاب کو یہ حکم دیا کہ بیت اللہ کا طواف اور صفا و مروہ کی سعی کرنے کے بعد احرام کھول دیں پھر سر منڈوا لیں یا بال کتروا لیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "اور ہم سے ابونعیم نے بیان کیا، ان سے سفیان نے بیان کیا، ان سے عبیداللہ نے، ان سے نافع نے کہ ابن عمر رضی اللہ عنہما نے صرف ایک طواف الزیارۃ کیا پھر سویرے سے منیٰ کو آئے، ان کی مراد دسویں تاریخ سے تھی، عبدالرزاق نے اس حدیث کا رفع ( رسول اللہ صلی اللہ علیہ وسلم تک ) بھی کیا ہے۔ انہیں عبیداللہ نے خبر دی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، ان سے لیث نے بیان کیا، ان سے جعفر بن ربیعہ نے، ان سے اعرج نے انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ ہم نے جب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کیا تو دسویں تاریخ کو طواف الزیارۃ کیا لیکن صفیہ رضی اللہ عنہا حائضہ ہو گئیں پھر نبی کریم صلی اللہ علیہ وسلم نے ان سے وہی چاہا جو شوہر اپنی بیوی سے چاہتا ہے، تو میں نے کہا یا رسول اللہ! وہ حائضہ ہیں، آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اس نے تو ہمیں روک دیا پھر جب لوگوں نے کہا کہ یا رسول اللہ! انہوں نے دسویں تاریخ کو طواف الزیارۃ کر لیا تھا، آپ صلی اللہ علیہ وسلم نے فرمایا پھر چلے چلو۔ قاسم، عروہ اور اسود سے بواسطہ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا روایت ہے کہ ام المؤمنین صفیہ رضی اللہ عنہا نے دسویں تاریخ کو طواف الزیارۃ کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، ان سے وہیب نے بیان کیا، ان سے ابن طاؤس نے بیان کیا، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم سے قربانی کرنے، سر منڈانے، رمی جمار کرنے اور ان سے آگے پیچھے کرنے کے بارے میں دریافت کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، ان سے یزید بن زریع نے بیان کیا، ان سے خالد نے بیان کیا، ان سے عکرمہ نے، ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی ‌اللہ ‌علیہ ‌وسلم سے یوم نحر میں منیٰ میں مسائل پوچھے جاتے اور آپ صلی ‌اللہ ‌علیہ ‌وسلم فرماتے جاتے کہ کوئی حرج نہیں ، ایک شخص نے پوچھا تھا کہ میں نے قربانی کرنے سے پہلے سر منڈا لیا ہے تو آپ نے اس کے جواب میں بھی یہی فرمایا کہ جاؤ قربانی کر لو کوئی حرج نہیں اور اس نے یہ بھی پوچھا کہ میں نے کنکریاں شام ہونے کے بعد ہی مار لی ہیں ، تو بھی آپ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا کہ کوئی حرج نہیں ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں عیسیٰ بن طلحہ نے، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم حجۃ الوداع کے موقع پر ( اپنی سواری ) پر بیٹھے ہوئے تھے اور لوگ آپ صلی اللہ علیہ وسلم سے مسائل معلوم کئے جا رہے تھے۔ ایک شخص نے کہا: یا رسول اللہ! مجھ کو معلوم نہ تھا اور میں نے قربانی کرنے سے پہلے ہی سر منڈا لیا، آپ صلی اللہ علیہ وسلم نے فرمایا اب قربانی کر لو کوئی حرج نہیں، دوسرا شخص آیا اور بولا: یا رسول اللہ! مجھے خیال نہ رہا اور رمی جمار سے پہلے ہی میں نے قربانی کر دی، آپ صلی اللہ علیہ وسلم نے فرمایا اب رمی کر لو کوئی حرج نہیں، اس دن آپ صلی اللہ علیہ وسلم سے جس چیز کے آگے پیچھے کرنے کے متعلق سوال ہوا آپ صلی اللہ علیہ وسلم نے یہی فرمایا اب کر لو کوئی حرج نہیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "ہم سے سعید بن یحییٰ بن سعید نے بیان کیا، ان سے ان کے والد نے بیان کیا، ان سے ابن جریج نے بیان کیا، ان سے زہری نے بیان کیا، ان سے عیسیٰ بن طلحہ نے اور ان سے عبداللہ بن عمرو بن العاص رضی اللہ عنہما نے کہ جب رسول اللہ صلی اللہ علیہ وسلم دسویں تاریخ کو منیٰ میں خطبہ دے رہے تھے تو وہ وہاں موجود تھے۔ ایک شخص نے اس وقت کھڑے ہو کر پوچھا کہ میں اس خیال میں تھا کہ فلاں کام فلاں سے پہلے ہے پھر دوسرا کھڑا ہوا اور کہا کہ میرا خیال تھا کہ فلاں کام فلاں سے پہلے ہے، چنانچہ میں نے قربانی سے پہلے سر منڈا لیا، رمی جمار سے پہلے قربانی کر لی، اور مجھے اس میں شک ہوا۔ تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اب کر لو۔ ان سب میں کوئی حرج نہیں۔ اسی طرح کے دوسرے سوالات بھی آپ صلی اللہ علیہ وسلم سے کئے گئے آپ صلی اللہ علیہ وسلم نے ان سب کے جواب میں یہی فرمایا کہ کوئی حرج نہیں اب کر لو۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "ہم سے اسحاق نے بیان کیا، کہا کہ ہمیں یعقوب بن ابراہیم نے خبر دی، ان سے میرے والد نے بیان کیا، ان سے صالح نے، ان سے ابن شہاب نے اور ان سے عیسیٰ بن طلحہ بن عبیداللہ نے بیان کیا، انہوں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے سنا انہوں نے بتلایا کہ رسول اللہ صلی اللہ علیہ وسلم اپنے سواری پر سوا رہو کر ٹھہرے رہے پھر پوری حدیث بیان کی۔ اس کی متابعت معمر نے زہری سے روایت کر کے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا مجھ سے یحییٰ بن سعید نے بیان کیا، ان سے فضل بن غزوان نے بیان کیا، ان سے عکرمہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ دسویں تاریخ کو رسول اللہ صلی اللہ علیہ وسلم نے منیٰ میں خطبہ دیا، خطبہ میں آپ صلی اللہ علیہ وسلم نے پوچھا لوگو! آج کون سا دن ہے؟ لوگ بولے یہ حرمت کا دن ہے، آپ صلی اللہ علیہ وسلم نے پھر پوچھا اور یہ شہر کون سا ہے؟ لوگوں نے کہا یہ حرمت کا شہر ہے، آپ صلی اللہ علیہ وسلم نے پوچھا یہ مہینہ کون سا ہے؟ لوگوں نے کہا یہ حرمت کا مہینہ ہے، پھر آپ صلی اللہ علیہ وسلم نے فرمایا بس تمہارا خون تمہارے مال اور تمہاری عزت ایک دوسرے پر اسی طرح حرام ہے جیسے اس دن کی حرمت، اس شہر اور اس مہینہ کی حرمت ہے، اس کلمہ کو آپ صلی اللہ علیہ وسلم نے کئی بار دہرایا اور پھر آسمان کی طرف سر اٹھا کر کہا اے اللہ! کیا میں نے ( تیرا پیغام ) پہنچا دیا اے اللہ! کیا میں نے پہنچا دیا۔ عبداللہ بن عباس رضی اللہ عنہما نے بتلایا کہ اس ذات کی قسم! جس کے ہاتھ میں میری جان ہے نبی کریم صلی اللہ علیہ وسلم کی یہ وصیت اپنی تمام امت کے لیے ہے، لہٰذا حاضر ( اور جاننے والے ) غائب ( اور ناواقف لوگوں کو اللہ کا پیغام ) پہنچا دیں۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا دیکھو میرے بعد ایک دوسرے کی گردن مار کر کافر نہ بن جانا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "ہم سے حفص بن عمر نے بیان کیا، ہم سے شعبہ نے بیان کیا، کہا کہ مجھے عمرو نے خبر دی، کہا کہ میں نے جابر بن زید سے سنا، انہوں نے کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا، آپ رضی اللہ عنہما نے بتلایا کہ میدان عرفات میں رسول اللہ صلی اللہ علیہ وسلم کا خطبہ میں نے خود سنا تھا۔ اس کی متابعت ابن عیینہ نے عمرو سے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ابوعامر نے بیان کیا، ان سے قرہ نے بیان کیا، ان سے محمد بن سیرین نے کہا کہ مجھے عبدالرحمٰن بن ابی بکرہ نے اور ایک اور شخص نے جو میرے نزدیک عبدالرحمٰن سے بھی افضل ہے یعنی حمید بن عبدالرحمٰن نے خبر دی کہ ابوبکر رضی اللہ عنہ نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے دسویں تاریخ کو منیٰ میں خطبہ سنایا، آپ صلی اللہ علیہ وسلم نے پوچھا لوگو! معلوم ہے آج یہ کون سا دن ہے؟ ہم نے عرض کی اللہ اور اس کا رسول زیادہ جانتے ہیں، آپ صلی اللہ علیہ وسلم اس پر خاموش ہو گئے اور ہم نے سمجھا کہ آپ صلی اللہ علیہ وسلم اس دن کا کوئی اور نام رکھیں گے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا: کیا یہ قربانی کا دن نہیں۔ ہم بولے ہاں ضرور ہے، پھر آپ صلی اللہ علیہ وسلم نے پوچھا یہ مہینہ کون سا ہے؟ ہم نے کہا اللہ اور اس کے رسول زیادہ جانتے لیے۔ آپ اس مرتبہ بھی خاموش ہو گئے اور ہمیں خیال ہوا کہ آپ صلی اللہ علیہ وسلم اس مہینہ کا نام کوئی اور نام رکھیں گے، لیکن آپ نے فرمایا کیا یہ ذی الحجہ کا مہینہ نہیں ہے؟ ہم بولے کیوں نہیں، پھر آپ صلی اللہ علیہ وسلم نے پوچھا یہ شہر کون سا ہے؟ ہم نے عرض کی اللہ اور اس کے رسول بہتر جانتے ہیں، اس مرتبہ بھی آپ صلی اللہ علیہ وسلم اس طرح خاموش ہو گئے کہ ہم نے سمجھا کہ آپ صلی اللہ علیہ وسلم اس کا کوئی اور نام رکھیں گے، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا شہر نہیں ہے؟ ہم نے عرض کی کیوں نہیں ضرور ہے، اس کے بعد آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا بس تمہارا خون اور تمہارے مال تم پر اسی طرح حرام ہیں جیسے اس دن کی حرمت اس مہینہ اور اس شہر میں ہے، تاآنکہ تم اپنے رب سے جا ملو۔ کہو کیا میں نے تم کو اللہ کا پیغام پہنچا دیا؟ لوگوں نے کہا کہ ہاں۔ آپ صلی اللہ علیہ وسلم نے فرمایا اے اللہ! تو گواہ رہنا اور ہاں! یہاں موجود غائب کو پہنچا دیں کیونکہ بہت سے لوگ جن تک یہ پیغام پہنچے گا سننے والوں سے زیادہ ( پیغام کو ) یاد رکھنے والے ثابت ہوں گے اور میرے بعد کافر نہ بن جانا کہ ایک دوسرے کی ( ناحق ) گردنیں مارنے لگو۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "ہم سے محمد بن مثنی نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، کہا ہم کو عاصم بن محمد بن زید نے خبر دی، انہیں ان کے باپ نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے منیٰ میں فرمایا کہ تم کو معلوم ہے! آج کون سا دن ہے؟ لوگوں نے کہا کہ اللہ اور اس کے رسول زیادہ جانتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا دن ہے اور یہ بھی تم کو معلوم ہے کہ یہ کون سا شہر ہے؟ لوگوں نے کہا اللہ اور اس کے رسول زیادہ جانتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا شہر ہے اور تم کو یہ بھی معلوم ہے کہ یہ کون سا مہینہ ہے، لوگوں نے کہا اللہ اور اس کے رسول زیادہ جانتے ہیں، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا مہینہ ہے پھر فرمایا کہ اللہ تعالیٰ نے تمہارا خون! تمہارا مال اور عزت ایک دوسرے پر ( ناحق ) اس طرح حرام کر دی ہیں جیسے اس دن کی حرمت اس مہینہ اور اس شہر میں ہے۔ ہشام بن غاز نے کہا کہ مجھے نافع نے ابن عمر رضی اللہ عنہما کے حوالے سے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم حجۃ الوداع میں دسویں تاریخ کو جمرات کے درمیان کھڑے ہوئے تھے اور فرمایا تھا کہ دیکھو! یہ ( «يوم النحر» ) حج اکبر کا دن ہے، پھر نبی کریم صلی اللہ علیہ وسلم یہ فرمانے لگے کہ اے اللہ! گواہ رہنا، نبی کریم صلی اللہ علیہ وسلم نے اس موقع پر چونکہ لوگوں کو رخصت کیا تھا۔ ( آپ سمجھ گئے کہ وفات کا زمانہ آن پہنچا ) جب سے لوگ اس حج کو حجۃ الوداع کہنے لگے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "ہم سے محمد بن عبید بن میمون نے بیان کیا، انہوں نے کہا کہ ہم سے عیسیٰ بن یونس نے، ان سے عبیداللہ نے، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے اجازت دی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "(دوسری سند) اور ہم سے یحییٰ بن موسیٰ نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، کہا ہم کو ابن جریج نے خبر دی، انہیں عبیداللہ نے، انہیں نافع نے اور انہیں ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے اجازت دی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "اور ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، ان سے ان کے باپ نے بیان کیا، ان سے عبیداللہ نے بیان کیا، کہا کہ مجھ سے نافع نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے کہ عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے منیٰ کی راتوں میں ( حاجیوں ) کو پانی پلانے کے لیے مکہ میں رہنے کی اجازت چاہی تو آپ صلی اللہ علیہ وسلم نے ان کو اجازت دے دی۔ اس روایت کی متابعت محمد بن عبداللہ کے ساتھ ابواسامہ عقبہ بن خالد اور ابوضمرہ نے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "ہم سے ابونعیم نے بیان کیا، انہوں نے کہا ہم سے مسعر نے بیان کیا، ان سے وبرہ نے کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے پوچھا کہ میں کنکریاں کس وقت ماروں؟ تو آپ نے فرمایا کہ جب تمہارا امام مارے تو تم بھی مارو، لیکن دوبارہ میں نے ان سے یہی مسئلہ پوچھا تو انہوں نے فرمایا کہ ہم انتظار کرتے رہتے اور جب سورج ڈھل جاتا تو کنکریاں مارتے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": 1747,
			"text": "محمد بن کثیر نے بیان کیا، کہا کہ ہم کو سفیان ثوری نے خبر دی، انہیں اعمش نے، انہیں ابراہیم نے اور ان سے عبدالرحمٰن بن زید نے بیان کیا کہ عبداللہ رضی اللہ عنہ نے وادی کے نشیب ( بطن وادی ) میں کھڑے ہو کر کنکری ماری تو میں نے کہا، اے ابوعبدالرحمٰن! کچھ لوگ تو وادی کے بالائی علاقہ سے کنکریاں مارتے ہیں، اس کا جواب انہوں نے یہ دیا کہ اس ذات کی قسم! جس کے سوا کوئی معبود نہیں یہی ( بطن وادی ) ان کے کھڑے ہونے کی جگہ ہے ( رمی کرتے وقت ) جن پر سورۃ البقرہ نازل ہوئی تھی صلی اللہ علیہ وسلم ۔ عبداللہ بن ولید نے بیان کیا کہ ان سے سفیان ثوری نے اور ان سے اعمش نے یہی حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": 1748,
			"text": "ہم سے حفص بن عمر نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے حکم بن عتبہ نے، ان سے ابراہیم نحعی نے، ان سے عبدالرحمٰن بن یزید نے کہ عبداللہ بن مسعود رضی اللہ عنہ جمرہ کبریٰ کے پاس پہنچے تو کعبہ کو اپنے بائیں طرف کیا اور منیٰ کو دائیں طرف، پھر سات کنکریوں سے رمی کی اور فرمایا کہ جن پر سورۃ البقرہ نازل ہوئی تھی صلی اللہ علیہ وسلم انہوں نے بھی اسی طرح رمی کی تھی۔ ( یعنی رسول اللہ صلی اللہ علیہ وسلم ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": 1749,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے حکم بن عتبہ نے بیان کیا، ان سے ابراہیم نخعی نے، ان سے عبدالرحمٰن بن یزید نے کہ انہوں نے عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ حج کیا انہوں نے دیکھا جمرہ عقبہ کی سات کنکریوں کے ساتھ رمی کے وقت آپ نے بیت اللہ کو تو اپنی بائیں طرف اور منی کو دائیں طرف کر لیا پھر فرمایا کہ یہی ان کا بھی مقام تھا جن پر سورۃ البقرہ نازل ہوئی تھی یعنی نبی کریم صلی اللہ علیہ وسلم ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": 1750,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے عبدالواحد بن زیاد مصری نے بیان کیا، ان سے سلیمان اعمش نے بیان کیا، کہا کہ میں نے حجاج سے سنا، وہ منبر پر سورتوں کا یوں نام لے رہا تھا وہ سورۃ جس میں بقرہ ( گائے ) کا ذکر آیا ہے، وہ سورۃ جس میں آل عمران کا ذکر آیا ہے، وہ سورۃ جس میں نساء ( عورتوں ) کا ذکر آیا ہے، اعمش نے کہا میں نے اس کا ذکر ابراہیم نخعی رحمہ اللہ سے کیا تو انہوں نے فرمایا کہ مجھ سے عبدالرحمٰن بن یزید نے بیان کیا کہ جب عبداللہ بن مسعود رضی اللہ عنہ نے جمرہ عقبہ کی رمی کی تو وہ ان کے ساتھ تھے، اس وقت وہ وادی کے نشیب میں اتر گئے اور جب درخت کے ( جو اس وقت وہاں پر تھا ) برابر نیچے اس کے سامنے ہو کر سات کنکریوں سے رمی کی ہر کنکری کے ساتھ اللہ اکبر کہتے جاتے تھے۔ پھر فرمایا قسم ہے اس کی کہ جس ذات کے سوا کوئی معبود نہیں یہیں وہ ذات بھی کھڑی ہوئی تھی جس پر سورۃ البقرہ نازل ہوئی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": 1751,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا کہ ہم سے طلحہ بن یحییٰ نے بیان کیا، ان سے یونس نے زہری سے بیان کیا، ان سے سالم نے کہ عبداللہ بن عمر رضی اللہ عنہما پہلے جمرہ کی رمی سات کنکریوں کے ساتھ کرتے اور ہر کنکری پر «الله اكبر» کہتے تھے، پھر آگے بڑھتے اور ایک نرم ہموار زمین پر پہنچ کر قبلہ رخ کھڑے ہو جاتے اسی طرح دیر تک کھڑے دونوں ہاتھ اٹھا کر دعا کرتے، پھر جمرہ وسطیٰ کی رمی کرتے، پھر بائیں طرف بڑھتے اور ایک ہموار زمین پر قبلہ رخ ہو کر کھڑے ہو جاتے، یہاں بھی دیر تک کھڑے کھڑے دونوں ہاتھ اٹھا کر دعائیں کرتے رہتے، اس کے بعد والے نشیب سے جمرہ عقبہ کی رمی کرتے اس کے بعد آپ کھڑے نہ ہوتے بلکہ واپس چلے آتے اور فرماتے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو اسی طرح کرتے دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": 1752,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، انہوں نے کہا کہ مجھ سے میرے بھائی (عبدالحمید) نے بیان کیا، ان سے سلیمان نے بیان کیا، ان سے یونس بن یزید نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے سالم بن عبداللہ نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما پہلے جمرہ کی رمی سات کنکریوں کے ساتھ کرتے اور ہر کنکری پر «الله اكبر» کہتے تھے، اس کے بعد آگے بڑھتے اور ایک نرم ہموار زمین پر قبلہ رخ کھڑے ہو جاتے، دعائیں کرتے رہتے اور دونوں ہاتھوں کو اٹھاتے پھر جمرہ وسطی کی رمی میں بھی اسی طرح کرتے اور بائیں طرف آگے بڑھ کر ایک نرم زمین پر قبلہ رخ کھڑے ہو جاتے، بہت دیر تک اسی طرح کھڑے ہو کر دعائیں کرتے رہتے، پھر جمرہ عقبہ کی رمی بطن وادی سے کرتے لیکن وہاں ٹھہرتے نہیں تھے، آپ فرماتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی اسی طرح کرتے دیکھا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": 1753,
			"text": "اور محمد بن بشار نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا، انہیں یونس نے خبر دی اور انہیں زہری نے کہ رسول اللہ صلی اللہ علیہ وسلم جب اس جمرہ کی رمی کرتے جو منی کی مسجد کے نزدیک ہے تو سات کنکریوں سے رمی کرتے اور ہر کنکری کے ساتھ تکبیر «الله اكبر» کہتے، پھر آگے بڑھتے اور قبلہ رخ کھڑے ہو کر دونوں ہاتھ اٹھا کر دعائیں کرتے تھے، یہاں آپ صلی اللہ علیہ وسلم بہت دیر تک کھڑے رہتے تھے پھر جمرہ ثانیہ ( وسطی ) کے پاس آتے یہاں بھی سات کنکریوں سے رمی کرتے اور ہر کنکری کے ساتھ «الله اكبر» کہتے، پھر بائیں طرف نالے کے قریب اتر جاتے اور وہاں بھی قبلہ رخ کھڑے ہوتے اور ہاتھوں کو اٹھا کر دعا کرتے رہتے، پھر جمرہ عقبہ کے پاس آتے اور یہاں بھی سات کنکریوں سے رمی کرتے اور ہر کنکری کے ساتھ «الله اكبر» کہتے، اس کے بعد واپس ہو جاتے یہاں آپ دعا کے لیے ٹھہرتے نہیں تھے۔ زہری نے کہا کہ میں نے سالم سے سنا وہ بھی اسی طرح اپنے والد ( ابن عمر رضی اللہ عنہما ) سے نبی کریم صلی اللہ علیہ وسلم کی حدیث بیان کرتے تھے اور یہ کہ عبداللہ بن عمر رضی اللہ عنہما خود بھی اسی طرح کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": 1754,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عبدالرحمٰن بن قاسم نے بیان کیا کہ میں نے عائشہ رضی اللہ عنہا سے سنا، وہ فرماتی تھیں کہ میں نے خود اپنے ہاتھوں سے رسول اللہ صلی اللہ علیہ وسلم کے، جب آپ نے احرام باندھنا چاہا، خوشبو لگائی تھی اس طرح کھولتے وقت بھی جب آپ نے طواف الزیارۃ سے پہلے احرام کھولنا چاہا تھا ( آپ نے ہاتھ پھیلا کر خوشبو لگانے کی کیفیت بتائی ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": 1755,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ابن طاؤس نے، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ لوگوں کو اس کا حکم تھا کہ ان کا آخری وقت بیت اللہ کے ساتھ ہو ( یعنی طواف وداع کریں ) البتہ حائضہ سے یہ معاف ہو گیا تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "ہم سے اصبغ بن فرج نے بیان کیا، انہوں نے کہا کہ ہم کو ابن وہب نے خبر دی، انہیں عمرو بن حارث نے، انہیں قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ظہر، عصر، مغرب اور عشاء پڑھی، پھر تھوڑی دیر محصب میں سو رہے، اس کے بعد سوار ہو کر بیت اللہ تشریف لے گئے اور وہاں طواف زیارۃ عمرو بن حارث کے ساتھ کیا، اس روایت کی متابعت لیث نے کی ہے، ان سے خالد نے بیان کیا، ان سے سعید نے، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہمیں امام مالک نے خبر دی، انہیں عبدالرحمٰن بن قاسم نے، انہیں ان کے والد نے اور انہیں عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ صفیہ بنت حی رضی اللہ عنہا ( حجۃ الوداع کے موقع پر ) حائضہ ہو گئیں تو میں نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تو یہ ہمیں روکیں گی، لوگوں نے کہا کہ انہوں نے طواف افاضہ کر لیا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر کوئی فکر نہیں۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا کہ ہم سے ابوعوانہ نے بیان کیا، ان سے منصور نے، ان سے ابراہیم نخعی نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نکلے، ہماری نیت حج کے سوا اور کچھ نہ تھی۔ پھر جب نبی کریم صلی اللہ علیہ وسلم ( مکہ ) پہنچے تو آپ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف اور صفا اور مروہ کی سعی کی، لیکن آپ صلی اللہ علیہ وسلم نے احرام نہیں کھولا کیونکہ آپ کے ساتھ قربانی تھی۔ آپ صلی اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کی بیویوں نے اور دیگر اصحاب نے بھی طواف کیا اور جن کے ساتھ قربانی نہیں تھیں انہوں نے ( اس طواف و سعی کے بعد ) احرام کھول دیا لیکن عائشہ رضی اللہ عنہا حائضہ ہو گئی تھیں، سب نے اپنے حج کے تمام مناسک ادا کر لیے تھے، پھر جب لیلۃ حصبہ یعنی روانگی کی رات آئی تو عائشہ رضی اللہ عنہا نے عرض کی یا رسول اللہ صلی اللہ علیہ وسلم آپ صلی اللہ علیہ وسلم کے تمام ساتھی حج اور عمرہ دونوں کر کے جا رہے ہیں صرف میں عمرہ سے محروم ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا کے اچھا جب ہم آئے تھے تو تم ( حیض کی وجہ سے ) بیت اللہ کا طواف نہیں کر سکی تھیں؟ میں نے کہا کہ نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اپنے بھائی کے ساتھ تنعیم چلی جا اور وہاں سے عمرہ کا احرام باندھ ( اور عمرہ کر ) ہم تمہارا فلاں جگہ انتظار کریں گے، چنانچہ میں اپنے بھائی ( عبدالرحمٰن رضی اللہ عنہ ) کے ساتھ تنعیم گئی اور وہاں سے احرام باندھا۔ اسی طرح صفیہ بنت حی رضی اللہ عنہا بھی حائضہ ہو گئی تھیں نبی کریم صلی اللہ علیہ وسلم نے انہیں ( ازراہ محبت ) فرمایا «عقرى حلقى»،‏‏‏‏ تو، تو ہمیں روک لے گی، کیا تو نے قربانی کے دن طواف زیارت نہیں کیا تھا؟ وہ بولیں کہ کیا تھا، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر کوئی حرج نہیں، چلی چلو۔ میں جب آپ تک پہنچی تو آپ صلی اللہ علیہ وسلم مکہ کے بالائی علاقہ پر چڑھ رہے تھے اور میں اتر رہی تھی یا یہ کہا کہ میں چڑھ رہی تھی اور نبی کریم صلی اللہ علیہ وسلم اتر رہے تھے۔ مسدد کی روایت میں ( رسول اللہ صلی اللہ علیہ وسلم کے کہنے پر ) ہاں کے بجائے نہیں ہے، اس کی متابعت جریر نے منصور کے واسطہ سے ”نہیں“ کے ذکر میں کی ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "ہم سے محمد بن مثنی نے بیان کیا، کہا ہم سے اسحٰق بن یوسف نے بیان کیا، ان سے سفیان ثوری نے بیان کیا، ان سے عبدالعزیز بن رفیع نے بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے پوچھا، مجھے وہ حدیث بتائے جو آپ کو رسول اللہ صلی اللہ علیہ وسلم سے یاد ہو کہ انہوں نے آٹھویں ذی الحجہ کے دن ظہر کی نماز کہاں پڑھی تھی، انہوں نے کہا منیٰ میں، میں نے پوچھا اور روانگی کے دن عصر کہاں پڑھی تھی انہوں نے فرمایا کہ ابطح میں اور تم اسی طرح کرو جس طرح تمہارے حاکم لوگ کرتے ہوں۔ ( تاکہ فتنہ واقع نہ ہو ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "ہم سے عبدالمتعال بن طالب نے بیان کیا، انہوں نے کہا کہ ہم سے ابن وہب نے بیان کیا، انہوں نے کہا کہ مجھے عمرو بن حارث نے خبر دی، ان سے قتادہ نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ ظہر، عصر، مغرب، عشاء نبی کریم صلی اللہ علیہ وسلم نے پڑھی اور تھوڑی دیر کے لیے محصب میں سو رہے، پھر بیت اللہ کی طرف سوار ہو کر گئے اور طواف کیا۔ ( یہاں طواف الزیارۃ مراد ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے سفیان نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم منیٰ سے کوچ کر کے یہاں محصب میں اس لیے اترے تھے تاکہ آسانی کے ساتھ مدینہ کو نکل سکیں۔ آپ صلی اللہ علیہ وسلم کی مراد ابطح میں اترنے سے تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن عطاء بن ابی رباح نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ محصب میں اترنا حج کی کوئی عبادت نہیں ہے، یہ تو صرف رسول اللہ صلی اللہ علیہ وسلم کے قیام کی جگہ تھی۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا کہ ہم سے ابوضمرہ انس بن عیاض نے بیان کیا، ان سے موسیٰ بن عقبہ نے بیان کیا، ان سے نافع نے کہ عبداللہ بن عمر رضی اللہ عنہما مکہ جاتے وقت ذی طویٰ کی دونوں پہاڑیوں کے درمیان رات گزارتے تھے اور پھر اس پہاڑی سے ہو کر گزرتے جو مکہ کے اوپر کی طرف ہے اور جب مکہ میں حج یا عمرہ کا احرام باندھنے آتے تو اپنی اونٹنی مسجد کے دروازہ پر لا کر بٹھاتے پھر حجر اسود کے پاس آتے اور یہیں سے طواف شروع کرتے، طواف سات چکروں میں ختم ہوتا جس کے شروع میں رمل کرتے اور چار میں معمول کے مطابق چلتے، طواف کے بعد دو رکعت نماز پڑھتے پھر ڈیرہ پر واپس ہونے سے پہلے صفا اور مروہ کی دوڑ کرتے۔ جب حج یا عمرہ کر کے مدینہ واپس ہوتے تو ذو الحلیفہ کے میدان میں سواری بٹھاتے، جہاں نبی کریم صلی اللہ علیہ وسلم بھی ( مکہ سے مدینہ واپس ہوتے ہوئے ) اپنی سواری بٹھایا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، انہوں نے کہا کہ ہم سے خالد بن حارث نے بیان کیا، انہوں نے کہا کہ عبیداللہ سے محصب کے بارے میں پوچھا گیا تو انہوں نے نافع سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اور عمر اور ابن عمر رضی اللہ عنہم نے محصب میں قیام فرمایا تھا۔ نافع سے روایت ہے کہ عبداللہ بن عمر رضی اللہ عنہما محصب میں ظہر اور عصر پڑھتے تھے۔ میرا خیال ہے کہ انہوں نے مغرب ( پڑھنے کا بھی ) ذکر کیا، خالد نے بیان کیا کہ عشاء میں مجھے کوئی شک نہیں۔ اس کے پڑھنے کا ذکر ضرور کیا پھر تھوڑی دیر کے لیے وہاں سو رہتے نبی کریم صلی اللہ علیہ وسلم سے بھی ایسا ہی مذکور ہے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "اور محمد بن عیسیٰ نے کہا کہ ہم سے حماد بن سلمہ نے بیان کیا، انہوں نے کہا کہ ہم سے ایوب نے بیان کیا، ان سے نافع نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما جب مدینہ سے مکہ آتے تو ذی طویٰ میں رات گزارتے اور جب صبح صادق ہوتی تو مکہ میں داخل ہوتے۔ اسی طرح مکہ سے واپسی میں بھی ذی طویٰ سے گزرتے اور وہیں رات گزارتے اور فرماتے کہ نبی کریم صلی اللہ علیہ وسلم بھی اسی طرح کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "ہم سے عثمان بن ہیثم نے بیان کیا، انہوں نے کہا کہ ہم کو ابن جریج نے خبر دی، ان سے عمرو بن دینار نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ ذوالمجاز اور عکاظ عہد جاہلیت کے بازار تھے جب اسلام آیا تو گویا لوگوں نے ( جاہلیت کے ان بازاروں میں ) خرید و فروخت کو برا خیال کیا اس پر ( سورۃ البقرہ کی ) یہ آیت نازل ہوئی ”تمہارے لیے کوئی حرج نہیں اگر تم اپنے رب کے فضل کی تلاش کرو، یہ حج کے زمانہ کے لیے تھا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 247
			}
		}
	]
}