{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"30": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1891,
			"arabicnumber": 1891,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے اسماعیل بن جعفر نے بیان کیا، ان سے ابوسہیل نے، ان سے ان کے والد مالک نے اور ان سے طلحہ بن عبیداللہ رضی اللہ عنہ نے کہ ایک اعرابی پریشان حال بال بکھرے ہوئے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اس نے پوچھا: یا رسول اللہ! بتائیے مجھ پر اللہ تعالیٰ نے کتنی نمازیں فرض کی ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پانچ نمازیں، یہ اور بات ہے کہ تم اپنی طرف سے نفل پڑھ لو، پھر اس نے کہا بتائیے اللہ تعالیٰ نے مجھ پر روزے کتنے فرض کئے ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ رمضان کے مہینے کے، یہ اور بات ہے کہ تم خود اپنے طور پر کچھ نفلی روزے اور بھی رکھ لو، پھر اس نے پوچھا اور بتائیے زکوٰۃ کس طرح مجھ پر اللہ تعالیٰ نے فرض کی ہے؟ آپ صلی اللہ علیہ وسلم نے اسے شرع اسلام کی باتیں بتا دیں۔ جب اس اعرابی نے کہا اس ذات کی قسم جس نے آپ صلی اللہ علیہ وسلم کو عزت دی نہ میں اس میں اس سے جو اللہ تعالیٰ نے مجھ پر فرض کر دیا ہے کچھ بڑھاؤں گا اور نہ گھٹاؤں گا، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر اس نے سچ کہا ہے تو یہ مراد کو پہنچایا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ) اگر سچ کہا ہے تو جنت میں جائے گا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1892,
			"arabicnumber": 1892,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے اسماعیل بن علیہ نے بیان کیا ان سے ایوب نے، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے یوم عاشورہ کا روزہ رکھا تھا اور آپ صلی اللہ علیہ وسلم نے اس کے رکھنے کا صحابہ رضی اللہ عنہم کو ابتداء اسلام میں حکم دیا تھا، جب ماہ رمضان کے روزے فرض ہو گئے تو عاشورہ کا روزہ بطور فرض چھوڑ دیا گیا، عبداللہ بن عمر رضی اللہ عنہما عاشورہ کے دن روزہ نہ رکھتے مگر جب ان کے روزے کا دن ہی یوم عاشورہ آن پڑتا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1893,
			"arabicnumber": 1893,
			"text": "ہم سے قتیبہ نے بیان کیا، انہوں نے کہا ہم سے لیث نے بیان کیا، ان سے یزید بن ابی حبیب نے اور ان سے عراک بن مالک نے بیان کیا، انہیں عروہ نے خبر دی کہ ام المؤمنین عائشہ رضی اللہ عنہا نے فرمایا قریش زمانہ جاہلیت میں عاشورہ کا روزہ رکھتے تھے، پھر رسول اللہ صلی اللہ علیہ وسلم نے بھی اس دن روزہ کا حکم دیا یہاں تک کہ رمضان کے روزے فرض ہو گئے، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس کا جی چاہے یوم عاشورہ کا روزہ رکھے اور جس کا جی چاہے نہ رکھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1894,
			"arabicnumber": 1894,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا روزہ دوزخ سے بچنے کے لیے ایک ڈھال ہے اس لیے ( روزہ دار ) نہ فحش باتیں کرے اور نہ جہالت کی باتیں اور اگر کوئی شخص اس سے لڑے یا اسے گالی دے تو اس کا جواب صرف یہ ہونا چاہئے کہ میں روزہ دار ہوں، ( یہ الفاظ ) دو مرتبہ ( کہہ دے ) اس ذات کی قسم! جس کے ہاتھ میں میری جان ہے روزہ دار کے منہ کی بو اللہ کے نزدیک کستوری کی خوشبو سے بھی زیادہ پسندیدہ اور پاکیزہ ہے، ( اللہ تعالیٰ فرماتا ہے ) بندہ اپنا کھانا پینا اور اپنی شہوت میرے لیے چھوڑ دیتا ہے، روزہ میرے لیے ہے اور میں ہی اس کا بدلہ دوں گا اور ( دوسری ) نیکیوں کا ثواب بھی اصل نیکی کے دس گنا ہوتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1895,
			"arabicnumber": 1895,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، ان سے سفیان بن عیینہ نے بیان کیا، ان سے جامع بن راشد نے بیان کیا، ان سے ابووائل نے اور ان سے حذیفہ رضی اللہ عنہ نے کہ عمر رضی اللہ عنہ نے پوچھا فتنہ کے متعلق رسول اللہ صلی اللہ علیہ وسلم کی حدیث کسی کو یاد ہے؟ حذیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے سنا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ انسان کے لیے اس کے بال بچے، اس کا مال اور اس کے پڑوسی فتنہ ( آزمائش و امتحان ) ہیں جس کا کفارہ نماز روزہ اور صدقہ بن جاتا ہے۔ عمر رضی اللہ عنہ نے کہا کہ میں اس کے متعلق نہیں پوچھتا میری مراد تو اس فتنہ سے ہے جو سمندر کی موجوں کی طرح امنڈ آئے گا۔ اس پر حذیفہ رضی اللہ عنہ نے کہا کہ آپ کے اور اس فتنہ کے درمیان ایک بند دروازہ ہے۔ ( یعنی آپ کے دور میں وہ فتنہ شروع نہیں ہو گا ) عمر رضی اللہ عنہ نے پوچھا وہ دروازہ کھل جائے گا یا توڑ دیا جائے گا؟ حذیفہ رضی اللہ عنہ نے بتایا کہ توڑ دیا جائے گا۔ عمر رضی اللہ عنہ نے فرمایا کہ پھر تو قیامت تک کبھی بند نہ ہو پائے گا۔ ہم نے مسروق سے کہا آپ حذیفہ رضی اللہ عنہ سے پوچھئے کہ کیا عمر رضی اللہ عنہ کو معلوم تھا کہ وہ دروازہ کون ہے، چنانچہ مسروق نے پوچھا تو آپ رضی اللہ عنہ نے فرمایا ہاں! بالکل اس طرح ( انہیں علم تھا ) جیسے رات کے بعد دن کے آنے کا علم ہوتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1896,
			"arabicnumber": 1896,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، کہا کہ مجھ سے ابوحازم سلمہ ابن دینار نے بیان کیا اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، جنت کا ایک دروازہ ہے جسے ریان کہتے ہیں قیامت کے دن اس دروازہ سے صرف روزہ دار ہی جنت میں داخل ہوں گے، ان کے سوا اور کوئی اس میں سے نہیں داخل ہو گا، پکارا جائے گا کہ روزہ دار کہاں ہے؟ وہ کھڑے ہو جائیں گے ان کے سوا اس سے اور کوئی نہیں اندر جانے پائے گا اور جب یہ لوگ اندر چلے جائیں گے تو یہ دروازہ بند کر دیا جائے گا پھر اس سے کوئی اندر نہ جا سکے گا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1897,
			"arabicnumber": 1897,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا کہ مجھ سے معین بن عیسیٰ نے بیان کیا، کہا مجھ سے امام مالک نے بیان کیا، ان سے ابن شہاب نے، ان سے حمید بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو اللہ کے راستے میں دو چیزیں خرچ کرے گا اسے فرشتے جنت کے دروازوں سے بلائیں گے کہ اے اللہ کے بندے! یہ دروازہ اچھا ہے پھر جو شخص نمازی ہو گا اسے نماز کے دروازہ سے بلایا جائے گا جو مجاہد ہو گا اسے جہاد کے دروازے سے بلایا جائے جو روزہ دار ہو گا اسے «باب الريان» سے بلایا جائے گا اور جو زکوٰۃ ادا کرنے والا ہو گا اسے زکوٰۃ کے دروازہ سے بلایا جائے گا۔ اس پر ابوبکر رضی اللہ عنہ نے پوچھا میرے ماں باپ آپ صلی اللہ علیہ وسلم پر فدا ہوں یا رسول اللہ صلی اللہ علیہ وسلم ! جو لوگ ان دروازوں ( میں سے کسی ایک دروازہ ) سے بلائے جائیں گے مجھے ان سے بحث نہیں، آپ یہ فرمائیں کہ کیا کوئی ایسا بھی ہو گا جسے ان سب دروازوں سے بلایا جائے گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اور مجھے امید ہے کہ آپ بھی انہیں میں سے ہوں گے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1898,
			"arabicnumber": 1898,
			"text": "ہم سے قتیبہ نے بیان کیا، کہا ہم سے اسماعیل بن جعفر نے بیان کیا، ان سے ابوسہل نافع بن مالک نے، ان سے ان کے والد نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب رمضان آتا ہے تو جنت کے دروازے کھول دیئے جاتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1899,
			"arabicnumber": 1899,
			"text": "مجھ سے یحییٰ بن بکیر نے بیان کیا، کہا کہ مجھ سے لیث بن سعد نے بیان کیا، ان سے عقیل نے ان سے ابن شہاب زہری نے بیان کیا کہ مجھے بنو تمیم کے مولیٰ ابوسہیل بن ابی انس نے خبر دی، ان سے ان کے والد نے بیان کیا، اور انہوں نے ابوہریرہ رضی اللہ عنہ کو کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب رمضان کا مہینہ آتا ہے تو آسمان کے تمام دروازے کھول دیئے جاتے ہیں، جہنم کے دروازے بند کر دیئے جاتے ہیں اور شیاطین کو زنجیروں سے جکڑ دیا جاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1900,
			"arabicnumber": 1900,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے بیان کیا کہ مجھے سالم نے خبر دی کہ ابن عمر رضی اللہ عنہما نے کہا میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب رمضان کا چاند دیکھو تو روزہ شروع کر دو اور جب شوال کا چاند دیکھو تو روزہ افطار کر دو اور اگر ابر ہو تو اندازہ سے کام کرو۔ ( یعنی تیس روزے پورے کر لو ) اور بعض نے لیث سے بیان کیا کہ مجھ سے عقیل اور یونس نے بیان کیا کہ ”رمضان کا چاند“ مراد ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1901,
			"arabicnumber": 1901,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ہشام دستوائی نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے بیان کیا، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو کوئی شب قدر میں ایمان کے ساتھ اور حصول ثواب کی نیت سے عبادت میں کھڑا ہو اس کے تمام پچھلے گناہ بخش دیئے جائیں گے اور جس نے رمضان کے روزے ایمان کے ساتھ اور ثواب کی نیت سے رکھے اس کے اگلے تمام گناہ معاف کر دیئے جائیں گے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1902,
			"arabicnumber": 1902,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا، انہیں ابن شہاب نے خبر دی، انہیں عبیداللہ بن عبداللہ بن عتبہ نے کہ عبداللہ بن عباس رضی اللہ عنہما نے کہا نبی کریم صلی اللہ علیہ وسلم سخاوت اور خیر کے معاملہ میں سب سے زیادہ سخی تھے اور آپ صلی اللہ علیہ وسلم کی سخاوت اس وقت اور زیادہ بڑھ جاتی تھی جب جبرائیل علیہ السلام آپ صلی اللہ علیہ وسلم سے رمضان میں ملتے، جبرائیل علیہ السلام نبی کریم صلی اللہ علیہ وسلم سے رمضان شریف کی ہر رات میں ملتے یہاں تک کہ رمضان گزر جاتا۔ نبی کریم صلی اللہ علیہ وسلم جبرائیل علیہ السلام سے قرآن کا دور کرتے تھے، جب جبرائیل علیہ السلام آپ صلی اللہ علیہ وسلم سے ملنے لگتے تو آپ صلی اللہ علیہ وسلم چلتی ہوا سے بھی زیادہ بھلائی پہنچانے میں سخی ہو جایا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1903,
			"arabicnumber": 1903,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے ابن ابی ذئب نے بیان کیا، ان سے سعید مقبری نے، ان سے ان کے والد کیسان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اگر کوئی شخص جھوٹ بولنا اور دغا بازی کرنا ( روزے رکھ کر بھی ) نہ چھوڑے تو اللہ تعالیٰ کو اس کی کوئی ضرورت نہیں کہ وہ اپنا کھانا پینا چھوڑ دے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1904,
			"arabicnumber": 1904,
			"text": "ہم سے ابراہیم بن موسیٰ بن موسیٰ نے بیان کیا، کہا کہ ہم کو ہشام بن یوسف نے خبر دی، انہیں ابن جریج نے کہا کہ مجھے عطاء نے خبر دی، انہیں ابوصالح (جو روغن زیتون اور گھی بیچتے تھے) نے انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اللہ پاک فرماتا ہے کہ انسان کا ہر نیک عمل خود اسی کے لیے ہے مگر روزہ کہ وہ خاص میرے لیے ہے اور میں ہی اس کا بدلہ دوں گا اور روزہ گناہوں کی ایک ڈھال ہے، اگر کوئی روزے سے ہو تو اسے فحش گوئی نہ کرنی چاہئے اور نہ شور مچائے، اگر کوئی شخص اس کو گالی دے یا لڑنا چاہئے تو اس کا جواب صرف یہ ہو کہ میں ایک روزہ دار آدمی ہوں، اس ذات کی قسم جس کے ہاتھ میں محمد ( صلی اللہ علیہ وسلم ) کی جان ہے! روزہ دار کے منہ کی بو اللہ تعالیٰ کے نزدیک مشک کی خوشبو سے بھی زیادہ بہتر ہے، روزہ دار کو دو خوشیاں حاصل ہوں گی ( ایک تو جب ) وہ افطار کرتا ہے تو خوش ہوتا ہے اور ( دوسرے ) جب وہ اپنے رب سے ملاقات کرے گا تو اپنے روزے کا ثواب پا کر خوش ہو گا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "ہم سے عبدان نے بیان کیا، ان سے ابوحمزہ نے، ان سے اعمش نے، ان سے ابراہیم نے ان سے علقمہ نے بیان کیا کہ میں عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ جا رہا تھا۔ آپ نے کہا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا اگر کوئی صاحب طاقت ہو تو اسے نکاح کر لینا چاہئے کیونکہ نظر کو نیچی رکھنے اور شرمگاہ کو بدفعلی سے محفوظ رکھنے کا یہ ذریعہ ہے اور کسی میں نکاح کرنے کی طاقت نہ ہو تو اسے روزے رکھنے چاہئیں کیونکہ وہ اس کی شہوت کو ختم کر دیتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1906,
			"arabicnumber": 1906,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے رمضان کا ذکر کیا تو فرمایا کہ جب تک چاند نہ دیکھو روزہ شروع نہ کرو، اسی طرح جب تک چاند نہ دیکھ لو روزہ موقوف نہ کرو اور اگر بادل چھا جائے تو تیس دن پورے کر لو۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1907,
			"arabicnumber": 1907,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے مالک نے ان سے عبداللہ بن دینار نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا مہینہ کبھی انتیس راتوں کا بھی ہوتا ہے اس لیے ( انتیس پورے ہو جانے پر ) جب تک چاند نہ دیکھ لو روزہ نہ شروع کرو اور اگر بادل ہو جائے تو تیس دن کا شمار پورا کر لو۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1908,
			"arabicnumber": 1908,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے جبلہ بن سحیم نے بیان کیا، کہ میں نے ابن عمر رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مہینہ اتنے دنوں اور اتنے دنوں کا ہوتا ہے۔ تیسری مرتبہ کہتے ہوئے آپ صلی اللہ علیہ وسلم نے انگھوٹھے کو دبا لیا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1909,
			"arabicnumber": 1909,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے محمد بن زیاد نے بیان کیا، کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا، آپ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، یا یوں کہا کہ ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا چاند ہی دیکھ کر روزے شروع کرو اور چاند ہی دیکھ کر روزہ موقوف کرو اور اگر بادل ہو جائے تو تیس دن پورے کر لو۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1910,
			"arabicnumber": 1910,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے بیان کیا، ان سے یحییٰ بن عبداللہ بن صیفی نے، ان سے عکرمہ بن عبدالرحمٰن نے اور ان سے ام سلمہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم اپنی ازواج سے ایک مہینہ تک جدا رہے پھر انتیس دن پورے ہو گئے تو صبح کے وقت یا شام کے وقت آپ صلی اللہ علیہ وسلم ان کے پاس تشریف لے گئے اس پر کسی نے کہا آپ نے تو عہد کیا تھا کہ آپ صلی اللہ علیہ وسلم ایک مہینہ تک ان کے یہاں تشریف نہیں لے جائیں گے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مہینہ انتیس دن کا بھی ہوتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1911,
			"arabicnumber": 1911,
			"text": "ہم سے عبدالعزیزبن عبداللہ نے بیان کیا، کہا ہم سے سلیمان بن بلال نے، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اپنی بیویوں سے جدا رہے تھے، آپ صلی اللہ علیہ وسلم کے پاؤں میں موچ آ گئی تھی تو آپ صلی اللہ علیہ وسلم نے بالاخانہ میں انتیس دن قیام کیا تھا، پھر وہاں سے اترے۔ لوگوں نے عرض کیا یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے ایک مہینہ کا ایلاء کیا تھا۔ جواب میں آپ نے فرمایا کہ مہینہ انتیس دن کا بھی ہوتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1912,
			"arabicnumber": 1912,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے بیان کیا، کہا کہ میں نے اسحاق سے سنا، انہوں نے عبدالرحمٰن بن ابی بکرہ رضی اللہ عنہ سے، انہوں نے اپنے والد سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور مجھے مسدد نے خبر دی، ان سے معتمر نے بیان کیا، ان سے خالد حذاء نے بیان کیا کہ مجھے عبدالرحمٰن بن ابی بکرہ رضی اللہ عنہ نے خبر دی اور انہیں ان کے والد نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا دونوں مہینے ناقص نہیں رہتے۔ مراد رمضان اور ذی الحجہ کے دونوں مہینے ہیں۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1913,
			"arabicnumber": 1913,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے اسود بن قیس نے بیان کیا، ان سے سعید بن عمرو نے بیان کیا اور انہوں نے ابن عمر رضی اللہ عنہما سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ہم ایک بے پڑھی لکھی قوم ہیں نہ لکھنا جانتے ہیں نہ حساب کرنا۔ مہینہ یوں ہے اور یوں ہے۔ آپ کی مراد ایک مرتبہ انتیس ( دنوں سے ) تھی اور ایک مرتبہ تیس سے۔ ( آپ صلی اللہ علیہ وسلم نے دسوں انگلیوں سے تین بار بتلایا ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1914,
			"arabicnumber": 1914,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے ہشام نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں سے کوئی شخص رمضان سے پہلے ( شعبان کی آخری تاریخوں میں ) ایک یا دو دن کے روزے نہ رکھے البتہ اگر کسی کو ان میں روزے رکھنے کی عادت ہو تو وہ اس دن بھی روزہ رکھ لے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1915,
			"arabicnumber": 1915,
			"text": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، ان سے اسرائیل نے، ان سے ابواسحاق نے اور ان سے براء رضی اللہ عنہ نے بیان کیا کہ ( شروع اسلام میں ) محمد صلی اللہ علیہ وسلم کے صحابہ رضی اللہ عنہم جب روزہ سے ہوتے اور افطار کا وقت آتا تو کوئی روزہ دار اگر افطار سے پہلے بھی سو جاتا تو پھر اس رات میں بھی اور آنے والے دن میں بھی انہیں کھانے پینے کی اجازت نہیں تھی تاآنکہ پھر شام ہو جاتی، پھر ایسا ہوا کہ قیس بن صرمہ انصاری رضی اللہ عنہ بھی روزے سے تھے جب افطار کا وقت ہوا تو وہ اپنی بیوی کے پاس آئے اور ان سے پوچھا کیا تمہارے پاس کچھ کھانا ہے؟ انہوں نے کہا ( اس وقت کچھ ) نہیں ہے لیکن میں جاتی ہوں کہیں سے لاؤں گی، دن بھر انہوں نے کام کیا تھا اس لیے آنکھ لگ گئی جب بیوی واپس ہوئیں اور انہیں ( سوتے ہوئے ) دیکھا تو فرمایا افسوس تم محروم ہی رہے، لیکن دوسرے دن وہ دوپہر کو بیہوش ہو گئے جب اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا گیا تو یہ آیت نازل ہوئی ”حلال کر دیا گیا تمہارے لیے رمضان کی راتوں میں اپنی بیویوں سے صحبت کرنا“ اس پر صحابہ رضی اللہ عنہم بہت خوش ہوئے اور یہ آیت نازل ہوئی ”کھاؤ پیو یہاں تک کہ ممتاز ہو جائے تمہارے لیے صبح کی سفید دھاری ( صبح صادق ) سیاہ دھاری ( صبح کاذب ) سے۔“",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1916,
			"arabicnumber": 1916,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، انہوں نے کہا ہم سے ہشیم نے بیان کیا، کہا کہ مجھے حصین بن عبدالرحمٰن نے خبر دی، اور ان سے شعبی نے، ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ جب یہ آیت نازل ہوئی ”تاآنکہ کھل جائے تمہارے لیے سفید دھاری سیاہ دھاری سے۔“ تو میں نے ایک سیاہ دھاگہ لیا اور ایک سفید اور دنوں کو تکیہ کے نیچے رکھ لیا اور رات میں دیکھتا رہا مجھ پر ان کے رنگ نہ کھلے، جب صبح ہوئی تو میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس سے تو رات کی تاریکی ( صبح کاذب ) اور دن کی سفیدی ( صبح صادق ) مراد ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1917,
			"arabicnumber": 1917,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا ہم سے ابن ابی حازم نے بیان کیا، ان سے ان کے باپ نے اور ان سے سہل بن سعد نے (دوسری سند امام بخاری رحمہ اللہ نے کہا) اور مجھ سے سعید بن ابی مریم نے بیان کیا، ان سے ابوغسان محمد بن مطرف نے بیان کیا، انہوں نے کہا کہ مجھ سے ابوحازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ آیت نازل ہوئی ”کھاؤ پیو یہاں تک کہ تمہارے لیے سفید دھاری، سیاہ دھاری سے کھل جائے“ لیکن «من الفجر» ( صبح کی ) کے الفاظ نازل نہیں ہوئے تھے۔ اس پر کچھ لوگوں نے یہ کہا کہ جب روزے کا ارادہ ہوتا تو سیاہ اور سفید دھاگہ لے کر پاؤں میں باندھ لیتے اور جب تک دونوں دھاگے پوری طرح دکھائی نہ دینے لگتے، کھانا پینا بند نہ کرتے تھے، اس پر اللہ تعالیٰ نے «من الفجر» کے الفاظ نازل فرمائے پھر لوگوں کو معلوم ہوا کہ اس سے مراد رات اور دن ہیں۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1919,
			"arabicnumber": 1919,
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1920,
			"arabicnumber": 1920,
			"text": "ہم سے محمد بن عبیداللہ نے بیان کیا، انہوں نے کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا، ان سے ابوحازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ میں سحری اپنے گھر کھاتا پھر جلدی کرتا تاکہ نماز نبی کریم صلی اللہ علیہ وسلم کے ساتھ مل جائے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1921,
			"arabicnumber": 1921,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ہشام نے بیان کیا، کہا ہم سے قتادہ نے بیان کیا، ان سے انس رضی اللہ عنہ نے اور ان سے زید بن ثابت رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ہم نے سحری کھائی، پھر آپ صلی اللہ علیہ وسلم صبح کی نماز کے لیے کھڑے ہوئے۔ میں نے پوچھا کہ سحری اور اذان میں کتنا فاصلہ ہوتا تھا تو انہوں نے کہا کہ پچاس آیتیں ( پڑھنے ) کے موافق فاصلہ ہوتا تھا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1922,
			"arabicnumber": 1922,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے جویریہ نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے ”صوم وصال“ رکھا تو صحابہ رضی اللہ عنہم نے بھی رکھا لیکن صحابہ رضی اللہ عنہم کے لیے دشواری ہو گئی۔ اس لیے آپ صلی اللہ علیہ وسلم نے اس سے منع فرما دیا، صحابہ رضی اللہ عنہم نے اس پر عرض کی کہ آپ صلی اللہ علیہ وسلم صوم وصال رکھتے ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں تمہاری طرح نہیں ہوں۔ میں تو برابر کھلایا اور پلایا جاتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1923,
			"arabicnumber": 1923,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا، ان سے عبدالعزیز بن صہیب نے بیان کیا، انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، سحری کھاؤ کہ سحری میں برکت ہوتی ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1924,
			"arabicnumber": 1924,
			"text": "ہم سے ابوعاصم نے بیان کیا، کہا کہ ہم سے یزید بن ابی عبید نے بیان کیا، ان سے سلمہ بن اکوع نے کہ نبی کریم صلی اللہ علیہ وسلم نے عاشورہ کے دن ایک شخص کو یہ اعلان کرنے کے لیے بھیجا کہ جس نے کھانا کھا لیا وہ اب ( دن ڈوبنے تک روزہ کی حالت میں ) پورا کرے یا ( یہ فرمایا کہ ) روزہ رکھے اور جس نے نہ کھایا ہو ( تو وہ روزہ رکھے ) کھانا نہ کھائے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1926,
			"arabicnumber": 1926,
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1927,
			"arabicnumber": 1927,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، ان سے شعبہ نے، ان سے حکم نے، ان سے ابراہیم نے ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم روزہ سے ہوتے لیکن ( اپنی ازواج کے ساتھ ) «يقبل» ( بوسہ لینا ) و مباشرت ( اپنے جسم سے لگا لینا ) بھی کر لیتے تھے۔ نبی کریم صلی اللہ علیہ وسلم تم سب سے زیادہ اپنی خواہشات پر قابو رکھنے والے تھے، بیان کیا کہ ابن عباس رضی اللہ عنہما نے کہا کہ ( سورۃ طہٰ میں جو «مآرب‏» کا لفظ ہے وہ ) حاجت و ضرورت کے معنی میں ہے، طاؤس نے کہا کہ لفظ «أولي الإربة‏» ( جو سورۃ النور میں ہے ) اس احمق کو کہیں گے جسے عورتوں کی کوئی ضرورت نہ ہو۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1928,
			"arabicnumber": 1928,
			"text": "ہم سے محمد بن مثنی نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے ہشام نے بیان کیا کہ مجھے میرے والد عروہ نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے (دوسری سند امام بخاری رحمہ اللہ نے کہا کہ) اور ہم سے عبداللہ بن مسلمہ نے بیان کیا، ان سے امام مالک رحمہ اللہ نے، ان سے ہشام بن عروہ نے، ان سے ان کے باپ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اپنی بعض ازواج کا روزہ دار ہونے کے باوجود بوسہ لے لیا کرتے تھے۔ پھر آپ ہنسیں۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1929,
			"arabicnumber": 1929,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن سعیدقطان نے بیان کیا، ان سے ہشام بن ابی عبداللہ نے، ان سے یحییٰ بن ابی کثیر نے، ان سے ابوسلمہ نے، ان سے ام سلمہ رضی اللہ عنہا کی بیٹی زینب نے اور ان سے ان کی والدہ (ام سلمہ رضی اللہ عنہا) نے بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک چادر میں ( لیٹی ہوئی ) تھی کہ مجھے حیض آ گیا۔ اس لیے میں چپکے سے نکل آئی اور اپنا حیض کا کپڑا پہن لیا۔ آپ صلی اللہ علیہ وسلم نے پوچھا کیا بات ہوئی؟ کیا حیض آ گیا ہے؟ میں نے کہا ہاں، پھر میں آپ صلی اللہ علیہ وسلم کے ساتھ اسی چادر میں چلی گئی اور ام سلمہ رضی اللہ عنہا اور رسول اللہ صلی اللہ علیہ وسلم ایک ہی برتن سے غسل ( جنابت ) کیا کرتے تھے اور نبی کریم صلی اللہ علیہ وسلم روزے سے ہونے کے باوجود ان کا بوسہ لیتے تھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1930,
			"arabicnumber": 1930,
			"text": "ہم سے احمد بن صالح نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، ان سے یونس نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ اور ابوبکر نے کہ عائشہ رضی اللہ عنہا نے کہا رمضان میں فجر کے وقت نبی کریم صلی اللہ علیہ وسلم احتلام سے نہیں ( بلکہ اپنی ازواج کے ساتھ صحبت کرنے کی وجہ سے ) غسل کرتے اور روزہ رکھتے تھے۔ ( معلوم ہوا کہ غسل جنابت روزہ دار فجر کے بعد کر سکتا ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1932,
			"arabicnumber": 1932,
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1933,
			"arabicnumber": 1933,
			"text": "ہم سے عبدان نے بیان کیا کہ ہمیں یزید بن زریع نے خبر دی، ان سے ہشام نے بیان کیا، ان سے ابن سیرین نے بیان کیا، کہ ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا کہ کہ آپ صلی اللہ علیہ وسلم نے فرمایا جب کوئی بھول گیا اور کچھ کھا پی لیا تو اسے چاہئے کہ اپنا روزہ پورا کرے۔ کیونکہ اس کو اللہ نے کھلایا اور پلایا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1934,
			"arabicnumber": 1934,
			"text": "ہم سے عبدان نے بیان کیا، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہوں نے کہا ہم کو معمر نے خبر دی، انہوں نے کہا ہم سے زہری نے بیان کیا، ان سے عطاء بن زید نے، ان سے حمران نے انہوں نے عثمان بن عفان رضی اللہ عنہ کو وضو کرتے دیکھا، آپ نے ( پہلے ) اپنے دونوں ہاتھوں پر تین مرتبہ پانی ڈالا پھر کلی کی اور ناک صاف کی، پھر تین مرتبہ چہرہ دھویا، پھر دایاں ہاتھ کہنی تک دھویا، پھر بایاں ہاتھ کہنی تک دھویا تین تین مرتبہ، اس کے بعد اپنے سر کا مسح کیا اور تین مرتبہ داہنا پاؤں دھویا، پھر تین مرتبہ بایاں پاؤں دھویا، آخر میں کہا کہ جس طرح میں نے وضو کیا ہے میں نے رسول اللہ صلی اللہ علیہ وسلم کو بھی اسی طرح وضو کرتے دیکھا ہے، پھر آپ نے فرمایا تھا کہ جس نے میری طرح وضو کیا پھر دو رکعت نماز ( تحیۃ الوضو ) اس طرح پڑھی کہ اس نے دل میں کسی قسم کے خیالات و وساوس گزرنے نہیں دیئے تو اس کے اگلے گناہ معاف کر دیئے جائیں گے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1935,
			"arabicnumber": 1935,
			"text": "ہم سے عبداللہ بن منیر نے بیان کیا، کہا کہ ہم نے یزید بن ہارون سے سنا، ان سے یحییٰ نے (جو سعید کے صاحبزادے ہیں) کہا، انہیں عبدالرحمٰن بن قاسم نے خبر دی، انہیں محمد بن جعفر بن زبیر بن عوام بن خویلد نے اور انہیں عباد بن عبداللہ بن زبیر رضی اللہ عنہما نے خبر دی کہ انہوں نے عائشہ رضی اللہ عنہا سے سنا، آپ نے کہا کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی کہ میں دوزخ میں جل چکا۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا بات ہوئی؟ اس نے کہا کہ رمضان میں میں نے ( روزے کی حالت میں ) اپنی بیوی سے ہمبستری کر لی، تھوڑی دیر میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( کھجور کا ) ایک تھیلہ جس کا نام عرق تھا، پیش کیا گیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ دوزخ میں جلنے والا شخص کہاں ہے؟ اس نے کہا کہ حاضر ہوں، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ لے تو اسے خیرات کر دے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1936,
			"arabicnumber": 1936,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، انہوں نے بیان کیا کہ مجھے حمید بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں تھے کہ ایک شخص نے حاضر ہو کر کہا کہ یا رسول اللہ! میں تو تباہ ہو گیا، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کیا بات ہوئی؟ اس نے کہا کہ میں نے روزہ کی حالت میں اپنی بیوی سے جماع کر لیا ہے، اس پر رسول اللہ صلی اللہ علیہ وسلم نے دریافت فرمایا کیا تمہارے پاس کوئی غلام ہے جسے تم آزاد کر سکو؟ اس نے کہا نہیں، پھر آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کیا پے در پے دو مہینے کے روزے رکھ سکتے ہو؟ اس نے عرض کی نہیں، پھر آپ صلی اللہ علیہ وسلم نے پوچھا کیا تم کو ساٹھ مسکینوں کو کھانا کھلانے کی طاقت ہے؟ اس نے اس کا جواب بھی انکار میں دیا، راوی نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم تھوڑی دیر کے لیے ٹھہر گئے، ہم بھی اپنی اسی حالت میں بیٹھے ہوئے تھے کہ آپ صلی اللہ علیہ وسلم کی خدمت میں ایک بڑا تھیلا ( عرق نامی ) پیش کیا گیا جس میں کھجوریں تھیں۔ عرق تھیلے کو کہتے ہیں ( جسے کھجور کی چھال سے بناتے ہیں ) نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ سائل کہاں ہے؟ اس نے کہا کہ میں حاضر ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا کے اسے لے لو اور صدقہ کر دو، اس شخص نے کہا یا رسول اللہ! کیا میں اپنے سے زیادہ محتاج پر صدقہ کر دوں، بخدا ان دونوں پتھریلے میدانوں کے درمیان کوئی بھی گھرانہ میرے گھر سے زیادہ محتاج نہیں ہے، اس پر نبی کریم صلی اللہ علیہ وسلم اس طرح ہنس پڑے کہ آپ کے آگے کے دانت دیکھے جا سکے۔ پھر آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ اچھا جا اپنے گھر والوں ہی کو کھلا دے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1937,
			"arabicnumber": 1937,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے جریر نے بیان کیا، ان سے منصور نے، ان سے زہری نے، ان سے حمید بن عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی کہ یہ بدنصیب رمضان میں اپنی بیوی سے جماع کر بیٹھا ہے، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس اتنی طاقت نہیں ہے کہ ایک غلام آزاد کر سکو؟ اس نے کہا کہ نہیں، آپ صلی اللہ علیہ وسلم نے پھر دریافت فرمایا کیا تم پے در پے دو مہینے کے روزے رکھ سکتے ہو؟ اس نے کہا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے پھر دریافت فرمایا کہ کیا تمہارے اندر اتنی طاقت ہے کہ ساٹھ مسکینوں کو کھانا کھلا سکو؟ اب بھی اس کا جواب نفی میں تھا۔ راوی نے بیان کیا پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک تھیلا لایا گیا جس میں کھجوریں تھیں «عرق» زنبیل کو کہتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے لے جا اور اپنی طرف سے ( محتاجوں کو ) کھلا دے، اس شخص نے کہا میں اپنے سے بھی زیادہ محتاج کو حالانکہ دو میدانوں کے درمیان کوئی گھرانہ ہم سے زیادہ محتاج نہیں آپ نے فرمایا کہ پھر جا اپنے گھر والوں ہی کو کھلا دے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1938,
			"arabicnumber": 1938,
			"text": "ہم سے معلی بن اسد نے بیان کیا، ان سے وہیب نے، وہ ایوب سے، وہ عکرمہ سے، وہ ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے احرام میں اور روزے کی حالت میں پچھنا لگوایا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1939,
			"arabicnumber": 1939,
			"text": "ہم سے ابومعمر عبداللہ بن عمری نے بیان کیا، کہا ہم سے عبدالوارث بن سعید نے بیان کیا، ان سے ایوب سختیانی نے بیان کیا، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے روزہ کی حالت میں پچھنا لگوایا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1940,
			"arabicnumber": 1940,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، ہم سے شعبہ نے بیان کیا، کہا کہ میں نے ثابت بنانی سے سنا، انہوں نے انس بن مالک رضی اللہ عنہ سے پوچھا تھا کہ کیا آپ لوگ روزہ کی حالت میں پچھنا لگوانے کو مکروہ سمجھا کرتے تھے؟ آپ نے جواب دیا کہ نہیں البتہ کمزوری کے خیال سے ( روزہ میں نہیں لگواتے تھے ) شبابہ نے یہ زیادتی کی ہے کہ ہم سے شعبہ نے بیان کیا کہ ( ایسا ہم ) نبی کریم صلی اللہ علیہ وسلم کے عہد میں ( کرتے تھے ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1941,
			"arabicnumber": 1941,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ابواسحاق شیبانی نے، انہوں نے عبداللہ بن ابی اوفی رضی اللہ عنہ سے سنا کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سفر میں تھے ( روزہ کی حالت میں ) نبی کریم صلی اللہ علیہ وسلم نے ایک صاحب ( بلال رضی اللہ عنہ ) سے فرمایا کہ اتر کر میرے لیے ستو گھول لے، انہوں نے عرض کی یا رسول اللہ! ابھی تو سورج باقی ہے، آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ اتر کر ستو گھول لے، اب کی مرتبہ بھی انہوں نے عرض کی یا رسول اللہ! ابھی سورج باقی ہے لیکن آپ کا حکم اب بھی یہی تھا کہ اتر کر میرے لیے ستو گھول لے، پھر آپ صلی اللہ علیہ وسلم نے ایک طرف اشارہ کر کے فرمایا جب تم دیکھو کہ رات یہاں سے شروع ہو چکی ہے تو روزہ دار کو افطار کر لینا چاہئے۔ اس کی متابعت جریر اور ابوبکر بن عیاش نے شیبانی کے واسطہ سے کی ہے اور ان سے ابواوفی رضی اللہ عنہ نے کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سفر میں تھا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1942,
			"arabicnumber": 1942,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن قطان نے بیان کیا، ان سے ہشام بن عروہ نے بیان کیا کہ مجھ سے میرے باپ عروہ نے بیان کیا، ان سے عائشہ رضی اللہ عنہا نے کہ حمزہ بن عمرو اسلمی رضی اللہ عنہ نے عرض کی یا رسول اللہ! میں سفر میں لگاتار روزہ رکھتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1943,
			"arabicnumber": 1943,
			"text": "(دوسری سند امام بخاری رحمہ اللہ نے کہا کہ) اور ہم سے عبداللہ بن یوسف نے بیان کیا، انہیں امام مالک نے خبر دی، انہیں ہشام بن عروہ نے، انہیں ان کے والد نے اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے کہ حمزہ بن عمرو اسلمی رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے عرض کی میں سفر میں روزہ رکھوں؟ وہ روزے بکثرت رکھا کرتے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر جی چاہے تو روزہ رکھ اور جی چاہے افطار کر۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1944,
			"arabicnumber": 1944,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا کہ ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں عبیداللہ بن عبداللہ بن عتبہ نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم ( فتح مکہ کے موقع پر ) مکہ کی طرف رمضان میں چلے تو آپ صلی اللہ علیہ وسلم روزہ سے تھے لیکن جب کدید پہنچے تو روزہ رکھنا چھوڑ دیا۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ عسفان اور قدید کے درمیان کدید ایک تالاب ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1945,
			"arabicnumber": 1945,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم سے یحییٰ بن حمزہ نے بیان کیا، ان سے ابوعبدالرحمٰن بن یزید بن جابر نے بیان کیا، ان سے اسماعیل بن عبیداللہ نے بیان کیا، اور ان سے ام الدرداء رضی اللہ عنہا نے بیان کیا کہ ابودرداء رضی اللہ عنہ نے کہا ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر کر رہے تھے۔ دن انتہائی گرم تھا۔ گرمی کا یہ عالم تھا کہ گرمی کی سختی سے لوگ اپنے سروں کو پکڑ لیتے تھے، نبی کریم صلی اللہ علیہ وسلم اور ابن رواحہ رضی اللہ عنہ کے سوا کوئی شخص روزہ سے نہیں تھا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1946,
			"arabicnumber": 1946,
			"text": "ہم سے آدم بن ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے محمد بن عبدالرحمٰن انصاری نے بیان کیا، کہا کہ میں نے محمد بن عمرو بن حسن بن علی رضی اللہ عنہ سے سنا اور انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے کہ رسول اللہ صلی اللہ علیہ وسلم ایک سفر ( غزوہ فتح ) میں تھے آپ صلی اللہ علیہ وسلم نے دیکھا کہ ایک شخص پر لوگوں نے سایہ کر رکھا ہے، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا بات ہے؟ لوگوں نے کہا کہ ایک روزہ دار ہے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ سفر میں رو زہ رکھنا اچھا کام نہیں ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1947,
			"arabicnumber": 1947,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے امام مالک نے، ان سے حمید طویل نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( رمضان میں ) سفر کیا کرتے تھے۔ ( سفر میں بہت سے روزے سے ہوتے اور بہت سے بے روزہ ہوتے ) لیکن روزے دار بے روزہ دار پر اور بے روزہ دار روزے دار پر کسی قسم کی عیب جوئی نہیں کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1948,
			"arabicnumber": 1948,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے ابوعوانہ نے، ان سے منصور نے، ان سے مجاہد نے، ان سے طاؤس نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( غزوہ فتح میں ) مدینہ سے مکہ کے لیے سفر شروع کیا تو آپ صلی اللہ علیہ وسلم روزہ سے تھے، جب آپ عسفان پہنچے تو پانی منگوایا اور اسے اپنے ہاتھ سے ( منہ تک ) اٹھایا تاکہ لوگ دیکھ لیں پھر آپ صلی اللہ علیہ وسلم نے روزہ چھوڑ دیا یہاں تک کہ مکہ پہنچے۔ ابن عباس رضی اللہ عنہما کہا کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( سفر میں ) روزہ رکھا بھی اور نہیں بھی رکھا اس لیے جس کا جی چاہے روزہ رکھے اور جس کا جی چاہے نہ رکھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1949,
			"arabicnumber": 1949,
			"text": "ہم سے عیاش نے بیان کیا، ان سے عبدالاعلیٰ نے بیان کیا، ان سے عبیداللہ نے بیان کیا، ان سے نافع نے کہ عبداللہ بن عمر رضی اللہ عنہما نے ( آیت مذکور بالا ) «فديه طعام مسكين» پڑھی اور فرمایا یہ منسوخ ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1950,
			"arabicnumber": 1950,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا کہ ہم سے زہیر نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے بیان کیا، ان سے ابوسلمہ نے بیان کیا کہ میں نے عائشہ رضی اللہ عنہا سے سنا وہ فرماتیں کہ رمضان کا روزہ مجھ سے چھوٹ جاتا۔ شعبان سے پہلے اس کی قضاء کی توفیق نہ ہوتی۔ یحییٰ نے کہا کہ یہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں مشغول رہنے کی وجہ سے تھا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1951,
			"arabicnumber": 1951,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا کہ مجھ سے زید بن اسلم نے بیان کیا، ان سے عیاض نے اور ان سے ابوسعید رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کیا جب عورت حائضہ ہوتی ہے تو نماز اور روزے نہیں چھوڑ دیتی؟ یہی اس کے دین کا نقصان ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1952,
			"arabicnumber": 1952,
			"text": "ہم سے محمد بن خالد نے بیان کیا، کہا ہم سے محمد بن موسیٰ ابن اعین نے بیان کیا، انہوں نے کہا کہ ہم سے ان کے والد نے بیان کیا، ان سے عمرو بن حارث نے، ان سے عبیداللہ بن ابی جعفر نے، ان سے محمد بن جعفر نے کہا، ان سے عروہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر کوئی شخص مر جائے اور اس کے ذمہ روزے واجب ہوں تو اس کا ولی اس کی طرف سے روزے رکھ دے، موسیٰ کے ساتھ اس حدیث کو ابن وہب نے بھی عمرو سے روایت کیا اور یحییٰ بن ایوب سختیانی نے بھی ابن ابی جعفر سے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1953,
			"arabicnumber": 1953,
			"text": "ہم سے محمد بن عبدالرحیم نے بیان کیا، کہا ہم سے معاویہ بن عمرو نے بیان کیا، کہا ہم سے زائدہ نے بیان کیا، ان سے اعمش نے، ان سے مسلم بطین نے، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی یا رسول اللہ! میری ماں کا انتقال ہو گیا اور ان کے ذمے ایک مہینے کے روزے باقی رہ گئے ہیں۔ کیا میں ان کی طرف سے قضاء رکھ سکتا ہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں ضرور، اللہ تعالیٰ کا قرض اس بات کا زیادہ مستحق ہے کہ اسے ادا کر دیا جائے۔ سلیمان اعمش نے بیان کیا کہ حکم اور سلمہ نے کہا جب مسلم بطین نے یہ حدیث بیان کیا تو ہم سب وہیں بیٹھے ہوئے تھے۔ ان دونوں حضرات نے فرمایا کہ ہم نے مجاہد سے بھی سنا تھا کہ وہ یہ حدیث ابن عباس رضی اللہ عنہما سے بیان کرتے تھے۔ ابوخالد سے روایت ہے کہ اعمش نے بیان کیا ان سے حکم، مسلم بطین اور سلمہ بن کہیل نے، ان سے سعید بن جبیر، عطاء اور مجاہد نے ابن عباس رضی اللہ عنہما سے کہ ایک خاتون نے نبی کریم صلی اللہ علیہ وسلم سے عرض کی کہ میری ”بہن“ کا انتقال ہو گیا ہے پھر یہی قصہ بیان کیا، یحییٰ اور سعید اور ابومعاویہ نے کہا، ان سے اعمش نے بیان کیا، ان سے مسلم نے، ان سے سعید نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ ایک خاتون نے نبی کریم صلی اللہ علیہ وسلم سے عرض کی کہ میری ماں کا انتقال ہو گیا ہے اور عبیداللہ نے بیان کیا، ان سے زید ابن ابی انیسہ نے، ان سے حکم نے، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ ایک خاتون نے نبی کریم صلی اللہ علیہ وسلم سے عرض کی کہ میری ماں کا انتقال ہو گیا ہے اور ان پر نذر کا ایک روزہ واجب تھا اور ابوحریز عبداللہ بن حسین نے بیان کیا، کہا ہم سے عکرمہ نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ ایک خاتون نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں عرض کی کہ میری ماں کا انتقال ہو گیا ہے اور ان پر پندرہ دن کے روزے واجب تھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1954,
			"arabicnumber": 1954,
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1955,
			"arabicnumber": 1955,
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1956,
			"arabicnumber": 1956,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے عبدالواحد نے بیان کیا، ان سے سلیمان شیبانی نے بیان کیا، کہا کہ میں نے عبداللہ بن ابی اوفی رضی اللہ عنہ سے سنا، انہوں نے کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سفر میں جا رہے تھے، آپ صلی اللہ علیہ وسلم روزے سے تھے، جب سورج غروب ہوا تو آپ نے ایک شخص سے فرمایا کہ اتر کر ہمارے لیے ستو گھول، انہوں نے کہا یا رسول اللہ! تھوڑی دیر اور ٹھہرئیے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اتر کر ہمارے لیے ستو گھول انہوں نے پھر یہی کہا کہ یا رسول اللہ! ابھی تو دن باقی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اتر کر ستو ہمارے لیے گھول، چنانچہ انہوں نے اتر کر ستو گھولا۔ نبی کریم صلی اللہ علیہ وسلم نے پھر فرمایا کہ جب تم دیکھو کہ رات کی تاریکی ادھر سے آ گئی تو روزہ دار کو روزہ افطار کر لینا چاہئے۔ آپ صلی اللہ علیہ وسلم نے اپنی انگلی سے مشرق کی طرف اشارہ کیا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1957,
			"arabicnumber": 1957,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہمیں امام مالک نے خبر دی، انہیں ابوحازم سلمہ بن دینار نے، انہیں سہل بن سعد رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، میری امت کے لوگوں میں اس وقت تک خیر باقی رہے گی، جب تک وہ افطار میں جلدی کرتے رہیں گے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1958,
			"arabicnumber": 1958,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا کہ ہم سے ابوبکر بن عیاش نے بیان کیا، ان سے سلیمان شیبانی نے اور ان سے ابن ابی اوفی رضی اللہ عنہ نے کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھا۔ آپ صلی اللہ علیہ وسلم روزے سے تھے، جب شام ہوئی تو آپ صلی اللہ علیہ وسلم نے ایک شخص سے فرمایا کہ ( اونٹ سے ) اتر کر میرے لیے ستو گھول، اس نے کہا: یا رسول اللہ! اگر شام ہونے کا کچھ اور انتظار فرمائیں تو بہتر ہو، آپ صلی اللہ علیہ وسلم نے فرمایا، اتر کر میرے لیے ستو گھول ( وقت ہو گیا ہے ) جب تم یہ دیکھ لو کہ رات ادھر مشرق سے آ گئی تو روزہ دار کے روزہ کھولنے کا وقت ہو گیا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1959,
			"arabicnumber": 1959,
			"text": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے ابواسامہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے فاطمہ بنت منذر نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہ نے کہ ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں بادل تھا۔ ہم نے جب افطار کر لیا تو سورج نکل آیا۔ اس پر ہشام ( راوی حدیث ) سے کہا گیا کہ پھر انہیں اس روزے کی قضاء کا حکم ہوا تھا؟ تو انہوں نے بتلایا کہ قضاء کے سوا اور چارہ کار ہی کیا تھا؟ اور معمر نے کہا کہ میں نے ہشام سے یوں سنا ”مجھے معلوم نہیں کہ ان لوگوں نے قضاء کی تھی یا نہیں۔“",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1960,
			"arabicnumber": 1960,
			"text": "ہم سے مسدد نے بیان کیا، ان سے بشر بن مفضل نے بیان کیا، ان سے خالد بن ذکوان نے بیان کیا، ان سے ربیع بنت معوذ رضی اللہ عنہا نے کہا کہ عاشورہ کی صبح نبی کریم صلی اللہ علیہ وسلم نے انصار کے محلوں میں کہلا بھیجا کہ صبح جس نے کھا پی لیا ہو وہ دن کا باقی حصہ ( روزہ دار کی طرح ) پورے کرے اور جس نے کچھ کھایا پیا نہ ہو وہ روزے سے رہے۔ ربیع نے کہا کہ پھر بعد میں بھی ( رمضان کے روزے کی فرضیت کے بعد ) ہم اس دن روزہ رکھتے اور اپنے بچوں سے بھی رکھواتے تھے۔ انہیں ہم اون کا ایک کھلونا دے کر بہلائے رکھتے۔ جب کوئی کھانے کے لیے روتا تو وہی دے دیتے، یہاں تک کہ افطار کا وقت آ جاتا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1961,
			"arabicnumber": 1961,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ مجھ سے یحییٰ قطان نے بیان کیا، ان سے شعبہ نے، کہا کہ مجھ سے قتادہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( بلا سحر و افطار ) پے در پے روزے نہ رکھا کرو۔ صحابہ رضی اللہ عنہم نے عرض کی کہ آپ صلی اللہ علیہ وسلم تو وصال کرتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہاری طرح نہیں ہوں۔ مجھے ( اللہ تعالیٰ کی طرف سے ) کھلایا اور پلایا جاتا ہے یا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ) میں اس طرح رات گزارتا ہوں کہ مجھے کھلایا اور پلایا جاتا رہتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1962,
			"arabicnumber": 1962,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے صوم وصال سے منع فرمایا۔ صحابہ رضی اللہ عنہم نے عرض کی کہ آپ تو وصال کرتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہاری طرح نہیں ہوں، مجھے تو کھلایا اور پلایا جاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1963,
			"arabicnumber": 1963,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، ان سے لیث بن سعد نے بیان کیا، ان سے یزید بن ہاد نے بیان کیا، ان سے عبداللہ بن خباب نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ آپ صلی اللہ علیہ وسلم نے فرمایا مسلسل ( بلاسحری و افطاری ) روزے نہ رکھو، ہاں اگر کوئی ایسا کرنا ہی چاہے تو وہ سحری کے وقت تک ایسا کر سکتا ہے۔ صحابہ رضی اللہ عنہم نے عرض کی یا رسول اللہ! آپ تو ایسا کرتے ہیں۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا میں تمہاری طرح نہیں ہوں۔ میں تو رات اس طرح گزارتا ہوں کہ ایک کھلانے والا مجھے کھلاتا ہے اور ایک پلانے والا مجھے پلاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1964,
			"arabicnumber": 1964,
			"text": "ہم سے عثمان بن ابی شیبہ اور محمد بن سلام نے بیان کیا، کہا کہ ہم کو عبدہ نے خبر دی، انہیں ہشام بن عروہ نے، انہیں ان کے باپ نے اور ان سے عائشہ رضی اللہ عنہا نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے پے در پے روزہ سے منع کیا تھا۔ امت پر رحمت و شفقت کے خیال سے، صحابہ رضی اللہ عنہم نے عرض کی کہ آپ صلی اللہ علیہ وسلم تو وصال کرتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا، میں تمہاری طرح نہیں ہوں مجھے میرا رب کھلاتا اور پلاتا ہے۔ عثمان نے ( اپنی روایت میں ) ”امت پر رحمت و شفقت کے خیال سے“ کے الفاظ ذکر نہیں کئے ہیں۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1965,
			"arabicnumber": 1965,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہم کو شعیب نے خبر دی ان سے زہری نے بیان کیا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے مسلسل ( کئی دن تک سحری و افطاری کے بغیر ) روزہ رکھنے سے منع فرمایا تھا۔ اس پر ایک آدمی نے مسلمانوں میں سے عرض کی، یا رسول اللہ صلی اللہ علیہ وسلم آپ تو وصال کرتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا میری طرح تم میں سے کون ہے؟ مجھے تو رات میں میرا رب کھلاتا ہے، اور وہی مجھے سیراب کرتا ہے۔ لوگ اس پر بھی جب صوم وصال رکھنے سے نہ رکے تو آپ صلی اللہ علیہ وسلم نے ان کے ساتھ دو دن تک وصال کیا۔ پھر عید کا چاند نکل آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر چاند نہ دکھائی دیتا تو میں اور کئی دن وصال کرتا، گویا جب صوم و صال سے وہ لوگ نہ رکے تو آپ نے ان کو سزا دینے کے لیے یہ کہا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1966,
			"arabicnumber": 1966,
			"text": "ہم سے یحییٰ بن موسیٰ نے بیان کیا، ان سے عبدالرزاق نے بیان کیا، ان سے معمر نے، ان سے ہمام نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے دوبار فرمایا، تم لوگ وصال سے بچو! عرض کیا گیا کہ آپ تو وصال کرتے ہیں، اس پر آپ نے فرمایا کہ رات میں مجھے میرا رب کھلاتا اور وہی مجھے سیراب کرتا ہے۔ پس تم اتنی ہی مشقت اٹھاؤ جتنی تم طاقت رکھتے ہو۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1967,
			"arabicnumber": 1967,
			"text": "ہم سے ابراہیم بن حمزہ نے بیان کیا، کہا کہ ہم سے عبدالعزیز ابن ابی حازم نے بیان کیا، ان سے یزید بن ہاد نے، ان سے عبداللہ بن خباب نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ آپ صلی اللہ علیہ وسلم فرما رہے تھے، صوم وصال نہ رکھو۔ اور اگر کسی کا ارادہ ہی وصال کا ہو تو سحری کے وقت تک وصال کر لے۔ صحابہ رضی اللہ عنہم نے عرض کی، یا رسول اللہ! آپ تو وصال کرتے ہیں آپ نے فرمایا کہ میں تمہاری طرح نہیں ہوں۔ رات کے وقت ایک کھلانے والا مجھے کھلاتا ہے اور ایک پلانے والا مجھے پلاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1968,
			"arabicnumber": 1968,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے جعفر بن عون نے بیان کیا، ان سے ابوالعمیس عتبہ بن عبداللہ نے بیان کیا، ان سے عون بن ابی حجیفہ نے اور ان سے ان کے والد (وہب بن عبداللہ رضی اللہ عنہ) نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے سلمان اور ابوالدرداء رضی اللہ عنہ میں ( ہجرت کے بعد ) بھائی چارہ کرایا تھا۔ ایک مرتبہ سلمان رضی اللہ عنہ، ابودرداء رضی اللہ عنہ سے ملاقات کے لیے گئے۔ تو ( ان کی عورت ) ام الدرداء رضی اللہ عنہا کو بہت پراگندہ حال میں دیکھا۔ ان سے پوچھا کہ یہ حالت کیوں بنا رکھی ہے؟ ام الدرداء رضی اللہ عنہا نے جواب دیا کہ تمہارے بھائی ابوالدرداء رضی اللہ عنہ ہیں جن کو دنیا کی کوئی حاجت ہی نہیں ہے پھر ابوالدرداء رضی اللہ عنہ بھی آ گئے اور ان کے سامنے کھانا حاضر کیا اور کہا کہ کھانا کھاؤ، انہوں نے کہا کہ میں تو روزے سے ہوں، اس پر سلمان رضی اللہ عنہ نے فرمایا کہ میں بھی اس وقت تک کھانا نہیں کھاؤں گا جب تک تم خود بھی شریک نہ ہو گے۔ راوی نے بیان کیا کہ پھر وہ کھانے میں شریک ہو گئے ( اور روزہ توڑ دیا ) رات ہوئی تو ابوالدرداء رضی اللہ عنہ عبادت کے لیے اٹھے اور اس مرتبہ بھی سلمان رضی اللہ عنہ نے فرمایا کہ ابھی سو جاؤ۔ پھر جب رات کا آخری حصہ ہوا تو سلمان رضی اللہ عنہ نے فرمایا کہ اچھا اب اٹھ جاؤ۔ چنانچہ دونوں نے نماز پڑھی۔ اس کے بعد سلمان رضی اللہ عنہ نے فرمایا کہ تمہارے رب کا بھی تم پر حق ہے۔ جان کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے، اس لیے ہر حق والے کے حق کو ادا کرنا چاہئے، پھر آپ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے اس کا تذکرہ کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ سلمان نے سچ کہا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1969,
			"arabicnumber": 1969,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبری دی، انہیں ابوالنضر نے، انہیں ابوسلمہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا، کہ رسول اللہ صلی اللہ علیہ وسلم نفل روزہ رکھنے لگتے تو ہم ( آپس میں ) کہتے کہ اب آپ صلی اللہ علیہ وسلم روزہ رکھنا چھوڑیں گے ہی نہیں۔ اور جب روزہ چھوڑ دیتے تو ہم کہتے کہ اب آپ روزہ رکھیں گے ہی نہیں۔ میں نے رمضان کو چھوڑ کر رسول اللہ صلی اللہ علیہ وسلم کو کبھی پورے مہینے کا نفلی روزہ رکھتے نہیں دیکھتا اور جتنے روزے آپ شعبان میں رکھتے میں نے کسی مہینہ میں اس سے زیادہ روزے رکھتے آپ کو نہیں دیکھا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1970,
			"arabicnumber": 1970,
			"text": "ہم سے معاذ بن فضالہ نے بیان کیا، ان سے ہشام نے بیان کیا، ان سے یحییٰ نے، ان سے ابوسلمہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم شعبان سے زیادہ اور کسی مہینہ میں روزے نہیں رکھتے تھے، شعبان کے پورے دنوں میں آپ صلی اللہ علیہ وسلم روزہ سے رہتے۔ آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے کہ عمل وہی اختیار کرو جس کی تم میں طاقت ہو کیونکہ اللہ تعالیٰ ( ثواب دینے سے ) نہیں تھکتا۔ تم خود ہی اکتا جاؤ گے۔ نبی کریم صلی اللہ علیہ وسلم اس نماز کو سب سے زیادہ پسند فرماتے جس پر ہمیشگی اختیار کی جائے خواہ کم ہی کیوں نہ ہو۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم جب کوئی نماز شروع کرتے تو اسے ہمیشہ پڑھتے تھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1971,
			"arabicnumber": 1971,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، ان سے ابوعوانہ نے بیان کیا، ان سے ابوبشر نے، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ رمضان کے سوا نبی کریم صلی اللہ علیہ وسلم نے کبھی پورے مہینے کا روزہ نہیں رکھا۔ آپ صلی اللہ علیہ وسلم نفل روزہ رکھنے لگتے تو دیکھنے والا کہہ اٹھتا کہ بخدا، اب آپ بے روزہ نہیں رہیں گے اور اسی طرح جب نفل روزہ چھوڑ دیتے تو کہنے والا کہتا کہ واللہ! اب آپ صلی اللہ علیہ وسلم روزہ نہیں رکھیں گے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1972,
			"arabicnumber": 1972,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا کہ مجھ سے محمد بن جعفر نے بیان کیا، ان سے حمید طویل نے اور انہوں نے انس رضی اللہ عنہ سے سنا، آپ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کسی مہینہ میں بے روزہ کے رہتے تو ہمیں خیال ہوتا کہ اس مہینہ میں آپ روزہ رکھیں گے ہی نہیں۔ اسی طرح کسی مہینہ میں نفل روزہ رکھنے لگتے تو ہم خیال کرتے کہ اب اس مہینہ کا ایک دن بھی بے روزے کے نہیں گزرے گا۔ جو جب بھی چاہتا نبی کریم صلی اللہ علیہ وسلم کو رات میں نماز پڑھتے دیکھ سکتا تھا اور جب بھی چاہتا سوتا ہوا بھی دیکھ سکتا تھا۔ سلیمان نے حمید طویل سے یوں بیان کیا کہ انہوں نے انس رضی اللہ عنہ سے روزہ کے متعلق پوچھا تھا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1973,
			"arabicnumber": 1973,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا کہ ہم کو ابوخالد احمر نے خبر دی، کہا کہ ہم کو حمید نے خبر دی، کہا کہ میں نے انس رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کے روزوں کے متعلق پوچھا۔ آپ نے فرمایا کہ جب بھی میرا دل چاہتا کہ آپ کو روزے سے دیکھوں تو میں آپ کو روزے سے ہی دیکھتا۔ اور بغیر روزے کے چاہتا تو بغیر روزے سے ہی دیکھتا۔ رات میں کھڑے ( نماز پڑھتے ) دیکھنا چاہتا تو اسی طرح نماز پڑھتے دیکھتا۔ اور سوتے ہوئے دیکھنا چاہتا تو اسی طرح دیکھتا۔ میں نے نبی کریم صلی اللہ علیہ وسلم کے مبارک ہاتھوں سے زیادہ نرم و نازک ریشم کے کپڑوں کو بھی نہیں دیکھا۔ اور نہ مشک و عنبر کو آپ کی خوشبو سے زیادہ خوشبودار پایا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1974,
			"arabicnumber": 1974,
			"text": "ہم سے اسحاق نے بیان کیا، کہا کہ ہم کو ہارون بن اسماعیل نے خبر دی، کہا کہ ہم سے علی نے بیان کیا، ان سے یحییٰ نے بیان کیا، کہا کہ مجھ سے ابوسلمہ نے بیان کیا، کہا کہ مجھ سے عبداللہ بن عمرو بن عاص رضی اللہ عنہما نے بیان کیا، آپ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم میرے یہاں تشریف لائے۔ پھر انہوں نے پوری حدیث بیان کی، یعنی تمہارے ملاقاتیوں کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے۔ اس پر میں نے پوچھا اور داؤد علیہ السلام کا روزہ کیسا تھا؟ تو آپ نے فرمایا کہ ایک دن روزہ رکھنا اور ایک دن بے روزہ رہنا صوم داؤدی ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1975,
			"arabicnumber": 1975,
			"text": "ہم سے ابن مقاتل نے بیان کیا، انہوں نے کہا کہ ہم کو عبداللہ نے خبر دی، انہوں نے کہا کہ ہم کو اوزاعی نے خبر دی، انہوں نے کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا، انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا، انہوں نے کہا کہ مجھ سے عبداللہ بن عمرو بن عاص رضی اللہ عنہما نے بیان کیا، کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، عبداللہ! کیا یہ خبر صحیح ہے کہ تم دن میں تو روزہ رکھتے ہو اور ساری رات نماز پڑھتے ہو؟ میں نے عرض کی صحیح ہے یا رسول اللہ صلی اللہ علیہ وسلم ! آپ نے فرمایا، کہ ایسا نہ کر، روزہ بھی رکھ اور بے روزہ کے بھی رہ۔ نماز بھی پڑھ اور سوؤ بھی۔ کیونکہ تمہارے جسم کا بھی تم پر حق ہے تمہاری آنکھوں کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے اور تم سے ملاقات کرنے والوں کا بھی تم پر حق ہے بس یہی کافی ہے کہ ہر مہینے میں تین دن روزہ رکھ لیا کرو، کیونکہ ہر نیکی کا بدلہ دس گنا ملے گا اور اس طرح یہ ساری عمر کا روزہ ہو جائے گا، لیکن میں نے اپنے پر سختی چاہی تو مجھ پر سختی کر دی گئی۔ میں نے عرض کی، یا رسول اللہ! میں اپنے میں قوت پاتا ہوں۔ اس پر آپ نے فرمایا کہ پھر اللہ کے نبی داؤد علیہ السلام کا روزہ رکھ اور اس سے آگے نہ بڑھ، میں نے پوچھا اللہ کے نبی داؤد علیہ السلام کا روزہ کیا تھا؟ آپ صلی اللہ علیہ وسلم نے فرمایا، ایک دن روزہ رکھتے اور ایک دن بے روزہ رہا کرتے تھے۔ عبداللہ رضی اللہ عنہ بعد میں جب ضعیف ہو گئے تو کہا کرتے تھے کاش! میں رسول اللہ صلی اللہ علیہ وسلم کی دی ہوئی رخصت مان لیتا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1976,
			"arabicnumber": 1976,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہم کو شعیب نے خبر دی، انہیں زہری نے، کہا کہ مجھے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی کہ عبداللہ بن عمرو رضی اللہ عنہما نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم تک میری یہ بات پہنچا گئی کہ ”اللہ کی قسم! زندگی بھر میں دن میں تو روزے رکھوں گا۔ اور ساری رات عبادت کروں گا“ میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی، میرے ماں باپ آپ صلی اللہ علیہ وسلم پر فدا ہوں، ہاں میں نے یہ کہا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا لیکن تیرے اندر اس کی طاقت نہیں، اس لیے روزہ بھی رکھ اور بے روزہ بھی رہ۔ عبادت بھی کر لیکن سوؤ بھی اور مہینے میں تین دن کے روزے رکھا کر۔ نیکیوں کا بدلہ دس گنا ملتا ہے، اس طرح یہ ساری عمر کا روزہ ہو جائے گا، میں نے کہا کہ میں اس سے بھی زیادہ کی طاقت رکھتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر ایک دن روزہ رکھا کر اور دو دن کے لیے روزے چھوڑ دیا کر۔ میں نے پھر کہا کہ میں اس سے بھی زیادہ کی طاقت رکھتا ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا ایک دن روزہ رکھ اور ایک دن بے روزہ کے رہ کہ داؤد علیہ السلام کا روزہ ایسا ہی تھا۔ اور روزہ کا یہ سب سے افضل طریقہ ہے۔ میں نے اب بھی وہی کہا کہ مجھے اس سے بھی زیادہ کی طاقت ہے لیکن اس مرتبہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس سے افضل کوئی روزہ نہیں ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1977,
			"arabicnumber": 1977,
			"text": "ہم سے عمرو بن علی نے بیان کیا، کہا کہ ہم کو ابوعاصم نے خبر دی، انہیں ابن جریج نے، انہوں نے عطاء سے سنا، انہیں ابوعباس شاعر نے خبر دی، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا کہ نبی کریم صلی اللہ علیہ وسلم کو معلوم ہوا کہ میں مسلسل روزے رکھتا ہوں اور ساری رات عبادت کرتا ہوں۔ اب یا نبی کریم صلی اللہ علیہ وسلم نے کسی کو میرے پاس بھیجا یا خود میں نے آپ سے ملاقات کی۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا یہ خبر صحیح ہے کہ تو متواتر روزے رکھتا ہے اور ایک بھی نہیں چھوڑتا اور ( رات بھر ) نماز پڑھتا رہتا ہے؟ روزہ بھی رکھ اور بے روزہ بھی رہ، عبادت بھی کر اور سوؤ بھی کیونکہ تیری آنکھ کا بھی تجھ پر حق ہے، تیری جان کا بھی تجھ پر حق ہے اور تیری بیوی کا بھی تجھ پر حق ہے۔ عبداللہ رضی اللہ عنہ نے کہا کہ مجھ میں اس سے زیادہ کی طاقت ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر داؤد علیہ السلام کی طرح روزہ رکھا کر۔ انہوں نے کہا اور وہ کس طرح؟ فرمایا کہ داؤد علیہ السلام ایک دن روزہ رکھتے تھے اور ایک دن کا روزہ چھوڑ دیا کرتے تھے۔ اور جب دشمن سے مقابلہ ہوتا تو پیٹھ نہیں پھیرتے تھے۔ اس پر عبداللہ رضی اللہ عنہ نے عرض کی، اے اللہ کے نبی! میرے لیے یہ کیسے ممکن ہے کہ میں پیٹھ پھیر جاؤں۔ عطاء نے کہا کہ مجھے یاد نہیں ( اس حدیث میں ) صوم دہر کا کس طرح ذکر ہوا! ( البتہ انہیں اتنا دیا تھا کہ ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا، جو صوم دہر رکھتا ہے اس کا روزہ ہی نہیں، دو مرتبہ ( آپ صلی اللہ علیہ وسلم نے یہی فرمایا ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1978,
			"arabicnumber": 1978,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے غندر نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے مغیرہ نے بیان کیا کہ میں نے مجاہد سے سنا اور انہوں نے عبداللہ بن عمرو رضی اللہ عنہما سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، مہینہ میں صرف تین دن کے روزے رکھا کر۔ انہوں نے کہا کہ مجھ میں اس سے بھی زیادہ کی طاقت ہے۔ اسی طرح وہ برابر کہتے رہے ( کہ مجھ میں اس سے بھی زیادہ کی طاقت ہے ) یہاں تک کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ایک دن روزہ رکھو اور ایک دن کا روزہ چھوڑ دیا کر۔ آپ صلی اللہ علیہ وسلم نے ان سے یہ بھی فرمایا کہ مہینہ میں ایک قرآن مجید ختم کیا کر۔ انہوں نے اس پر بھی کہا کہ میں اس سے زیادہ کی طاقت رکھتا ہوں۔ اور برابر یہی کہتے رہے۔ یہاں تک کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تین دن میں ( ایک قرآن ختم کیا کر ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1979,
			"arabicnumber": 1979,
			"text": "ہم سے آدم نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، کہا کہ ہم سے حبیب بن ابی ثابت نے بیان کیا، کہا کہ میں نے ابوعباس مکی سے سنا، وہ شاعر تھے لیکن روایت حدیث میں ان پر کسی قسم کا اتہام نہیں تھا۔ انہوں نے بیان کیا کہ میں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے سنا، انہوں نے کہا کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، کیا تو متواتر روزے رکھتا ہے اور رات بھر عبادت کرتا ہے؟ میں نے ہاں میں جواب دیا تو آپ صلی اللہ علیہ وسلم نے فرمایا، اگر تو یونہی کرتا رہا تو آنکھیں دھنس جائیں گی، اور تو بےحد کمزور ہو جائے گا یہ کوئی روزہ نہیں کہ کوئی زندگی بھر ( بلاناغہ ہر روز ) روزہ رکھے۔ تین دن کا ( ہر مہینہ میں ) روزہ پوری زندگی کے روزے کے برابر ہے۔ میں نے اس پر کہا کہ مجھے اس سے بھی زیادہ طاقت ہے۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر داؤد علیہ السلام کا روزہ رکھا کر۔ آپ ایک دن روزہ رکھتے تھے اور ایک دن روزہ چھوڑ دیتے تھے اور جب دشمن کا سامنا ہوتا تو پیٹھ نہیں دکھلایا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1980,
			"arabicnumber": 1980,
			"text": "ہم سے اسحٰق واسطی نے بیان کیا، کہا ہم سے خالد نے بیان کیا، ان سے خالد حذاء نے اور ان سے ابوقلابہ نے کہ مجھے ابوملیح نے خبر دی، کہا کہ میں آپ کے والد کے ساتھ عبداللہ بن عمرو رضی اللہ عنہما کی خدمت میں حاضر ہوا۔ انہوں نے ہم سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کو میرے روزے کے متعلق خبر ہو گئی۔ ( کہ میں مسلسل روزے رکھتا ہوں ) آپ صلی اللہ علیہ وسلم میرے یہاں تشریف لائے اور میں نے ایک گدہ آپ صلی اللہ علیہ وسلم کے لیے بچھا دیا۔ جس میں کھجور کی چھال بھری ہوئی تھی لیکن نبی کریم صلی اللہ علیہ وسلم زمین پر بیٹھ گئے۔ اور تکیہ میرے اور آپ صلی اللہ علیہ وسلم کے درمیان ہو گیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا، کیا تمہارے لیے ہر مہینہ میں تین دن کے روزے کافی نہیں ہیں۔ انہوں نے کہا کہ میں نے عرض کی، یا رسول اللہ! ( کچھ اور بڑھا دیجئیے ) آپ نے فرمایا، اچھا پانچ دن کے روزے ( رکھ لے ) میں نے عرض کی، یا رسول اللہ کچھ اور آپ صلی اللہ علیہ وسلم نے فرمایا چلو چھ دن، میں نے عرض کی یا رسول اللہ! ( کچھ اور بڑھائیے، مجھ میں اس سے بھی زیادہ کی طاقت ہے ) آپ صلی اللہ علیہ وسلم نے فرمایا! اچھا نو دن، میں نے عرض کی، یا رسول اللہ! کچھ اور فرمایا، اچھا گیارہ دن۔ آخر آپ نے فرمایا کہ داؤد علیہ السلام کے روزے کے طریقے کے سوا اور کوئی طریقہ ( شریعت میں ) جائز نہیں۔ یعنی زندگی کے آدھے دنوں میں ایک دن کا روزہ رکھ اور ایک دن کا روزہ چھوڑ دیا کر۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1981,
			"arabicnumber": 1981,
			"text": "ہم سے معمر نے بیان کیا، ان سے عبدالوارث نے بیان کیا، ان سے ابوالتیاح نے بیان کیا، کہا کہ مجھ سے ابوعثمان نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ میرے خلیل صلی اللہ علیہ وسلم نے مجھے ہر مہینے کی تین تاریخوں میں روزہ رکھنے کی وصیت فرمائی تھی۔ اسی طرح چاشت کی دو رکعتوں کی بھی وصیت فرمائی تھی اور اس کی بھی کہ سونے سے پہلے ہی میں وتر پڑھ لیا کروں۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1982,
			"arabicnumber": 1982,
			"text": "ہم سے محمد بن مثنی نے بیان کیا، کہا کہ مجھ سے خالد نے (جو حارث کے بیٹے ہیں) بیان کیا، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم ام سلیم رضی اللہ عنہا نامی ایک عورت کے یہاں تشریف لے گئے۔ انہوں نے آپ صلی اللہ علیہ وسلم کی خدمت میں کھجور اور گھی پیش کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا، یہ گھی اس کے برتن میں رکھ دو اور یہ کھجوریں بھی اس کے برتن میں رکھ دو کیونکہ میں تو روزے سے ہوں، پھر آپ نے گھر کے ایک کنارے میں کھڑے ہو کر نفل نماز پڑھی اور ام سلیم رضی اللہ عنہا اور ان کے گھر والوں کے لیے دعا کی، ام سلیم رضی اللہ عنہا نے عرض کی کہ میرا ایک بچہ لاڈلا بھی تو ہے ( اس کے لیے بھی تو دعا فرما دیجئیے ) فرمایا کون ہے انہوں نے کہا آپ کا خادم انس ( رضی اللہ عنہ ) پھر آپ صلی اللہ علیہ وسلم نے دنیا اور آخرت کی کوئی خیر و بھلائی نہ چھوڑی جس کی ان کے لیے دعا نہ کی ہو۔ آپ نے دعا میں یہ بھی فرمایا اے اللہ! اسے مال اور اولاد عطا فرما اور اس کے لیے برکت عطا کر ( انس رضی اللہ عنہ کا بیان تھا کہ ) چنانچہ میں انصار میں سب سے زیادہ مالدار ہوں۔ اور مجھ سے میری بیٹی امینہ نے بیان کیا حجاج کے بصرہ آنے تک میری صلبی اولاد میں سے تقریباً ایک سو بیس دفن ہو چکے تھے۔ ہم سے ابن ابی مریم نے بیان کیا، انہیں یحییٰ نے خبر دی، کہا کہ مجھ سے حمید نے بیان کیا، اور انہوں نے انس رضی اللہ عنہ سے سنا، نبی کریم صلی اللہ علیہ وسلم کے حوالہ کے ساتھ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1983,
			"arabicnumber": 1983,
			"text": "ہم سے صلت بن محمد نے بیان کیا، انہوں نے کہا ہم سے مہدی نے بیان کیا، انہوں نے کہا کہ ہم سے غیلان نے (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور ہم سے ابوالنعمان نے بیان کیا، انہوں نے کہا کہ ہم سے مہدی بن میمون نے، ان سے غیلان بن جریر نے، ان سے مطرف نے، ان سے عمران بن حصین رضی اللہ عنہما نے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سوال کیا یا ( مطرف نے یہ کہا کہ ) سوال تو کسی اور نے کیا تھا لیکن وہ سن رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اے ابوفلاں! کیا تم نے اس مہینے کے آخر کے روزے رکھے؟ ابونعمان نے کہا کہ میرا خیال ہے کہ راوی نے کہا کہ آپ کی مراد رمضان سے تھی۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) کہتے ہیں کہ ثابت نے بیان کیا، ان سے مطرف نے، ان سے عمران رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( رمضان کے آخر کے بجائے ) شعبان کے آخر میں کا لفظ بیان کیا ( یہی صحیح ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1984,
			"arabicnumber": 1984,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے، ان سے عبدالحمید بن جبیر نے اور ان سے محمد بن عباد نے کہ میں نے جابر رضی اللہ عنہ سے پوچھا کیا نبی کریم صلی اللہ علیہ وسلم نے جمعہ کے دن روزہ رکھنے سے منع فرمایا ہے؟ انہوں نے جواب دیا کہ ہاں! ابوعاصم کے علاوہ راویوں نے یہ اضافہ کیا ہے کہ خالی ( ایک جمعہ ہی کے دن ) روزہ رکھنے سے آپ صلی اللہ علیہ وسلم نے منع فرمایا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1985,
			"arabicnumber": 1985,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا مجھ سے میرے باپ نے بیان کیا، ان سے اعمش نے بیان کیا، ان سے ابوصالح نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی بھی شخص جمعہ کے دن اس وقت تک روزہ نہ رکھے جب تک اس سے ایک دن پہلے یا اس کے ایک بعد روزہ نہ رکھتا ہو۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1986,
			"arabicnumber": 1986,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے یحییٰ نے بیان کیا، ان سے شعبہ نے، (دوسری سند) اور امام بخاری رحمہ اللہ نے کہا کہ مجھ سے محمد نے بیان کیا، کہا کہ ہم سے غندر نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے، ان سے ابوایوب نے اور ان سے جویریہ بنت حارث رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم ان کے یہاں جمعہ کے دن تشریف لے گئے، ( اتفاق سے ) وہ روزہ سے تھیں۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر دریافت فرمایا کے کل کے دن بھی تو نے روزہ رکھا تھا؟ انہوں نے جواب دیا کہ نہیں۔ پھر آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کیا آئندہ کل روزہ رکھنے کا ارادہ ہے؟ جواب دیا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر روزہ توڑ دو۔ حماد بن جعد نے بیان کیا کہ انہوں نے قتادہ سے سنا، ان سے ابوایوب نے بیان کیا اور ان سے جویریہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے حکم دیا اور انہوں نے روزہ توڑ دیا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1987,
			"arabicnumber": 1987,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے یحییٰ نے بیان کیا، ان سے سفیان نے، ان سے منصور نے، ان سے ابراہیم نے، ان سے علقمہ نے، انہوں نے عائشہ رضی اللہ عنہا سے پوچھا کہ کیا رسول اللہ صلی اللہ علیہ وسلم نے ( روزہ وغیرہ عبادات کے لیے ) کچھ دن خاص طور پر مقرر کر رکھے تھے؟ انہوں نے کہا نہیں۔ بلکہ آپ کے ہر عمل میں ہمیشگی ہوتی تھی اور دوسرا کون ہے جو رسول اللہ صلی اللہ علیہ وسلم جتنی طاقت رکھتا ہو؟",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1988,
			"arabicnumber": 1988,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے یحییٰ نے بیان کیا، ان سے امام مالک رحمہ اللہ نے بیان کیا کہ مجھ سے سالم نے بیان کیا، کہا کہ مجھ سے ام فضل رضی اللہ عنہا کے مولی عمیر نے بیان کیا اور ان سے ام فضل رضی اللہ عنہا نے بیان کیا۔ (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور ہم سے عبداللہ بن یوسف نے بیان کیا، انہیں امام مالک رحمہ اللہ نے خبر دی، انہیں عمر بن عبداللہ کے غلام ابونضر نے، انہیں عبداللہ بن عباس رضی اللہ عنہما کے غلام عمیر نے اور انہیں ام فضل بنت حارث رضی اللہ عنہا نے کہ ان کے یہاں کچھ لوگ عرفات کے دن نبی کریم صلی اللہ علیہ وسلم کے روزہ کے بارے میں جھگڑ رہے تھے۔ بعض نے کہا کہ آپ صلی اللہ علیہ وسلم روزہ سے ہیں۔ اور بعض نے کہا کہ روزہ سے نہیں ہیں۔ اس پر ام فضل رضی اللہ عنہا نے آپ کی خدمت میں دودھ کا ایک پیالہ بھیجا ( تاکہ حقیقت ظاہر ہو جائے ) آپ اپنے اونٹ پر سوار تھے، آپ نے دودھ پی لیا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1989,
			"arabicnumber": 1989,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، (یا ان کے سامنے حدیث کی قرآت کی گئی) ۔ کہا کہ مجھ کو عمرو نے خبر دی، انہیں بکیر نے، انہیں کریب نے اور انہیں میمونہ رضی اللہ عنہا نے کہ عرفہ کے دن کچھ لوگوں کو نبی کریم صلی اللہ علیہ وسلم کے روزے کے متعلق شک ہوا۔ اس لیے انہوں نے آپ کی خدمت میں دودھ بھیجا۔ آپ اس وقت عرفات میں وقوف فرما تھے۔ آپ نے دودھ پی لیا اور سب لوگ دیکھ رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1990,
			"arabicnumber": 1990,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں ابن شہاب نے، انہوں نے کہا کہ ہم سے ابن ازہر کے غلام ابوعبید نے بیان کیا کہ عید کے دن میں عمر بن خطاب رضی اللہ عنہ کے خدمت میں حاضر تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ دو دن ایسے ہیں جن کے روزوں کی نبی کریم صلی اللہ علیہ وسلم نے ممانعت فرمائی ہے۔ ( رمضان کے ) روزوں کے بعد افطار کا دن ( عیدالفطر ) اور دوسرا وہ دن جس میں تم اپنی قربانی کا گوشت کھاتے ہو ( یعنی عید الاضحی کا دن ) ۔ امام بخاری رحمہ اللہ نے کہا سفیان بن عیینہ نے کہا، جس نے ابوعبداللہ کو ابن ازہر کا غلام کہا اس نے بھی ٹھیک کہا، اور جس نے عبدالرحمٰن بن عوف رضی اللہ عنہ کا غلام کہا اس نے بھی ٹھیک کہا۔ ( اس کی وجہ یہ ہے کہ ابن ازہر اور عبدالرحمٰن بن عوف رضی اللہ عنہ دونوں اس غلام میں شریک تھے ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1992,
			"arabicnumber": 1992,
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1993,
			"arabicnumber": 1993,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا کہ ہم کو ہشام نے خبر دی، ان سے ابن جریج نے بیان کیا کہ مجھے عمرو بن دینار نے خبر دی، انہوں نے عطاء بن میناء سے سنا، وہ ابوہریرہ رضی اللہ عنہ سے یہ حدیث نقل کرتے تھے کہ آپ نے فرمایا، نبی کریم صلی اللہ علیہ وسلم نے دو روزے اور دو قسم کی خرید و فروخت سے منع فرمایا ہے۔ عیدالفطر اور عید الاضحی کے روزے سے۔ اور ملامست اور منابذت کے ساتھ خرید و فروخت کرنے سے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1994,
			"arabicnumber": 1994,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا کہ ہم سے معاذ بن معاذ عنبری نے بیان کیا، کہا کہ ہم کو عبداللہ بن عون نے خبر دی، ان سے زیاد بن جبیر نے بیان کیا کہ ایک شخص ابن عمر رضی اللہ عنہما کی خدمت میں حاضر ہوا اور عرض کی کہ ایک شخص نے ایک دن کے روزے کے نذر مانی۔ پھر کہا کہ میرا خیال ہے کہ وہ پیر کا دن ہے اور اتفاق سے وہی عید کا دن پڑ گیا۔ ابن عمر رضی اللہ عنہما نے کہا کہ اللہ تعالیٰ نے تو نذر پوری کرنے کا حکم دیا ہے اور نبی کریم صلی اللہ علیہ وسلم نے اس دن روزہ رکھنے سے ( اللہ کے حکم سے ) منع فرمایا ہے۔ ( گویا ابن عمر رضی اللہ عنہما نے کوئی قطعی فیصلہ نہیں دیا ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1995,
			"arabicnumber": 1995,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے عبدالملک بن عمیر نے بیان کیا، کہا کہ میں نے قزعہ سے سنا، انہوں نے کہا کہ میں نے ابو سعید خدری رضی اللہ عنہ سے سنا، آپ نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ جہادوں میں شریک رہے تھے۔ انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے چار باتیں سنی ہیں جو مجھے بہت ہی پسند آئیں۔ آپ نے فرمایا کہ کوئی عورت دو دن ( یا اس سے زیادہ ) کے اندازے کا سفر اس وقت تک نہ کرے جب تک اس کے ساتھ اس کا شوہر یا کوئی اور محرم نہ ہو۔ اور عیدالفطر اور عید الاضحی کے دنوں میں روزہ رکھنا جائز نہیں ہے اور صبح کی نماز کے بعد سورج نکلنے تک اور عصر کی نماز کے بعد سورج ڈوبنے تک کوئی نماز جائز نہیں اور چوتھی بات یہ کہ تین مساجد کے سوا اور کسی جگہ کے لیے «شد الرحال» سفر نہ کیا جائے، ”مسجد الحرام، مسجد الاقصیٰ اور میری یہ مسجد ( مسجد نبوی ) ۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1996,
			"arabicnumber": 1996,
			"text": "ابوعبداللہ (امام بخاری رحمہ اللہ) فرماتے ہیں کہ مجھ سے محمد بن مثنیٰ نے بیان کیا، کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا، ان سے ہشام نے بیان کیا کہ مجھے میرے باپ عروہ نے خبر دی کہ عائشہ رضی اللہ عنہا ایام منی ( ایام تشریق ) کے روزے رکھتی تھیں اور ہشام کے باپ ( عروہ ) بھی ان دنوں میں روزہ رکھتے تھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1998,
			"arabicnumber": 1998,
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1999,
			"arabicnumber": 1999,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں ابن شہاب نے، انہیں سالم بن عبداللہ بن عمر رضی اللہ عنہما نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ جو حاجی حج اور عمرہ کے درمیان تمتع کرے اسی کو یوم عرفہ تک روزہ رکھنے کی اجازت ہے، لیکن اگر قربانی کا مقدور نہ ہو اور نہ اس نے روزہ رکھا تو ایام منی ( ایام تشریق ) میں بھی روزہ رکھے۔ اور ابن شہاب نے عروہ سے اور انہوں نے عائشہ رضی اللہ عنہا سے اسی طرح روایت کی ہے۔ امام مالک رحمہ اللہ کے ساتھ اس حدیث کو ابراہیم بن سعد نے بھی ابن شہاب سے روایت کیا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2000,
			"arabicnumber": 2000,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے عمر بن محمد نے، ان سے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے، اور ان سے ان کے والد نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا عاشورہ کے دن اگر کوئی چاہے تو روزہ رکھ لے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2001,
			"arabicnumber": 2001,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا کہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ( شروع اسلام میں ) رسول اللہ صلی اللہ علیہ وسلم نے عاشوراء کے دن کا روزہ رکھنے کا حکم دیا تھا۔ پھر جب رمضان کے روزے فرض ہو گئے تو جس کا دل چاہتا اس دن روزہ رکھتا اور جو نہ چاہتا نہیں رکھا کرتا تھا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2002,
			"arabicnumber": 2002,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا، ان سے ہشام بن عروہ نے اور ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ عاشوراء کے دن زمانہ جاہلیت میں قریش روزہ رکھا کرتے تھے اور رسول اللہ صلی اللہ علیہ وسلم بھی رکھتے۔ پھر جب آپ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ صلی اللہ علیہ وسلم نے یہاں بھی عاشورہ کے دن روزہ رکھا اور اس کا لوگوں کو بھی حکم دیا۔ لیکن رمضان کی فرضیت کے بعد آپ نے اس کو چھوڑ دیا اور فرمایا کہ اب جس کا جی چاہے اس دن روزہ رکھے اور جس کا چاہے نہ رکھے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2003,
			"arabicnumber": 2003,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، انہوں نے کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے حمید بن عبدالرحمٰن نے بیان کیا کہ انہوں نے معاویہ بن ابی سفیان رضی اللہ عنہما سے عاشوراء کے دن منبر پر سنا، انہوں نے کہا کہ اے اہل مدینہ! تمہارے علماء کدھر گئے، میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا کہ یہ عاشوراء کا دن ہے۔ اس کا روزہ تم پر فرض نہیں ہے لیکن میں روزہ سے ہوں اور اب جس کا جی چاہے روزہ سے رہے ( اور میری سنت پر عمل کرے ) اور جس کا جی چاہے نہ رہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2004,
			"arabicnumber": 2004,
			"text": "ہم سے ابومعمر نے بیان کیا، کہا کہ ہم سے عبدالوارث نے بیان کیا، کہا کہ ہم سے ایوب نے بیان کیا، کہا کہ ہم سے عبداللہ بن سعید بن جبیر نے بیان کیا، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم مدینہ میں تشریف لائے۔ ( دوسرے سال ) آپ صلی اللہ علیہ وسلم نے یہودیوں کو دیکھا کہ وہ عاشوراء کے دن روزہ رکھتے ہیں۔ آپ صلی اللہ علیہ وسلم نے ان سے اس کا سبب معلوم فرمایا تو انہوں نے بتایا کہ یہ ایک اچھا دن ہے۔ اسی دن اللہ تعالیٰ نے بنی اسرائیل کو ان کے دشمن ( فرعون ) سے نجات دلائی تھی۔ اس لیے موسیٰ علیہ السلام نے اس دن کا روزہ رکھا تھا۔ آپ نے فرمایا پھر موسیٰ علیہ السلام کے ( شریک مسرت ہونے میں ) ہم تم سے زیادہ مستحق ہیں۔ چنانچہ آپ صلی اللہ علیہ وسلم نے اس دن روزہ رکھا اور صحابہ رضی اللہ عنہم کو بھی اس کا حکم دیا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2005,
			"arabicnumber": 2005,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا کہ ہم سے ابواسامہ نے بیان کیا، ان سے ابوعمیس نے، ان سے قیس بن مسلم نے، ان سے طارق نے، ان سے ابن شہاب نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ عاشوراء کے دن کو یہودی عید کا دن سمجھتے تھے اس لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم بھی اس دن روزہ رکھا کرو۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2006,
			"arabicnumber": 2006,
			"text": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے، ان سے عبیداللہ بن ابی یزید نے، اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو سوا عاشوراء کے دن کے اور اس رمضان کے مہینے کے اور کسی دن کو دوسرے دنوں سے افضل جان کر خاص طور سے قصد کر کے روزہ رکھتے نہیں دیکھا۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2007,
			"arabicnumber": 2007,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، کہا کہ ہم سے یزید بن ابی عبید نے بیان کیا، ان سے سلمہ بن اکوع رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے بنو اسلم کے ایک شخص کو لوگوں میں اس بات کے اعلان کا حکم دیا تھا کہ جو کھا چکا ہو وہ دن کے باقی حصے میں بھی کھانے پینے سے رکا رہے اور جس نے نہ کھایا ہو اسے روزہ رکھ لینا چاہئے کیونکہ یہ عاشوراء کا دن ہے۔",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 112
			}
		}
	]
}