{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"37": "Hiring"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2260,
			"arabicnumber": 2260,
			"text": "ہم سے محمد بن یوسف نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے بیان کیا، ان سے ابوبردہ یزید بن عبداللہ نے کہا کہ میرے دادا، ابوبردہ عامر نے مجھے خبر دی اور انہیں ان کے باپ ابوموسیٰ اشعری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، امانت دار خزانچی جو اس کو حکم دیا جائے، اس کے مطابق دل کی فراخی کے ساتھ ( صدقہ ادا کر دے ) وہ بھی ایک صدقہ کرنے والوں ہی میں سے ہے۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2261,
			"arabicnumber": 2261,
			"text": "ہم سے مسدد نے بیان کیا کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے قرۃ بن خالد نے کہا کہ مجھ سے حمید بن ہلال نے بیان کیا، ان سے ابوبردہ نے بیان کیا اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا۔ میرے ساتھ ( میرے قبیلہ ) اشعر کے دو مرد اور بھی تھے۔ میں نے کہا کہ مجھے نہیں معلوم کہ یہ دونوں صاحبان حاکم بننے کے طلب گار ہیں۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص حاکم بننے کا خود خواہشمند ہو، اسے ہم ہرگز حاکم نہیں بنائیں گے۔ ( یہاں راوی کو شک ہے کہ ) نبی کریم صلی اللہ علیہ وسلم نے لفظ «لن» یا لفظ «لا» استعمال فرمایا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2262,
			"arabicnumber": 2262,
			"text": "ہم سے احمد بن محمد مکی نے بیان کیا، کہا کہ ہم سے عمرو بن یحییٰ نے بیان کیا، ان سے ان کے دادا سعید بن عمرو نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے کوئی ایسا نبی نہیں بھیجا جس نے بکریاں نہ چرائی ہوں۔ اس پر آپ صلی اللہ علیہ وسلم کے صحابہ رضوان اللہ علیہم نے پوچھا کیا آپ نے بھی بکریاں چرائی ہیں؟ فرمایا کہ ہاں! کبھی میں بھی مکہ والوں کی بکریاں چند قیراط کی تنخواہ پر چرایا کرتا تھا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2263,
			"arabicnumber": 2263,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا کہ ہم کو ہشام بن عروہ نے خبر دی، انہیں معمر نے، انہیں زہری نے، انہیں عروہ بن زبیر نے اور انہیں عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے ( ہجرت کرتے وقت ) بنو دیل کے ایک مرد کو نوکر رکھا جو بنو عبد بن عدی کے خاندان سے تھا۔ اور اسے بطور ماہر راہبر مزدوری پر رکھا تھا ( حدیث کے لفظ ) «خريت» کے معنی راہبری میں ماہر کے ہیں۔ اس نے اپنا ہاتھ پانی وغیرہ میں ڈبو کر عاص بن وائل کے خاندان سے عہد کیا تھا اور وہ کفار قریش ہی کے دین پر تھا۔ لیکن نبی کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کو اس پر بھروسہ تھا۔ اسی لیے اپنی سواریاں انہوں نے اسے دے دیں اور غار ثور پر تین رات کے بعد اس سے ملنے کی تاکید کی تھی۔ وہ شخص تین راتوں کے گزرتے ہی صبح کو دونوں حضرات کی سواریاں لے کر وہاں حاضر ہو گیا۔ اس کے بعد یہ حضرات وہاں سے عامر بن فہیرہ اور اس دیلی راہبر کو ساتھ لے کر چلے۔ یہ شخص ساحل کے کنارے سے آپ کو لے کر چلا تھا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2264,
			"arabicnumber": 2264,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا کہ ہم سے لیث نے بیان کیا، انہوں نے کہا کہ ہم سے عقیل نے کہ ابن شہاب نے بیان کیا کہ مجھے عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی بیوی عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے بنو دیل کے ایک ماہر راہبر سے مزدوری طے کر لی تھی۔ وہ شخص کفار قریش کے دین پر تھا۔ ان دونوں حضرات نے اپنی دونوں اونٹنیاں اس کے حوالے کر دی تھیں اور کہہ دیا تھا کہ تین راتوں کے بعد صبح سویرے ہی سواروں کے ساتھ غار ثور پر آ جائے۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2266,
			"arabicnumber": 2266,
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2267,
			"arabicnumber": 2267,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا کہ ہم کو ہشام بن یوسف نے خبر دی، کہا کہ مجھے یعلیٰ بن مسلم اور عمرو بن دینار نے سعید سے خبر دی۔ یہ دونوں حضرات (سعید بن جبیر سے اپنی روایتوں میں) ایک دوسرے سے کچھ زیادہ روایت کرتے ہیں۔ ابن جریج نے کہا میں نے یہ حدیث اوروں سے بھی سنی ہے۔ وہ بھی سعید بن جبیر سے نقل کرتے تھے کہ مجھ سے ابن عباس رضی اللہ عنہما نے کہا، اور ان سے ابی بن کعب رضی اللہ عنہ نے کہا، انہوں نے کہا کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ پھر وہ دونوں ( موسیٰ اور خضر علیہما السلام ) چلے۔ تو انہیں ایک گاؤں میں ایک دیوار ملی جو گرنے ہی والی تھی۔ سعید نے کہا خضر علیہ السلام نے اپنے ہاتھ سے اس طرح اشارہ کیا اور ہاتھ اٹھایا، وہ دیوار سیدھی ہو گئی۔ یعلیٰ نے کہا میرا خیال ہے کہ سعید نے کہا، خضر علیہ السلام نے دیوار کو اپنے ہاتھ سے چھوا، اور وہ سیدھی ہو گئی، تب موسیٰ علیہ السلام بولے کہ اگر آپ چاہتے تو اس کام کی مزدوری لے سکتے تھے۔ سعید نے کہا کہ ( موسیٰ علیہ السلام کی مراد یہ تھی کہ ) کوئی ایسی چیز مزدوری میں ( آپ کو لینی چاہئیے تھی ) جسے ہم کھا سکتے ( کیونکہ بستی والوں نے ان کو کھانا نہیں کھلایا تھا ) ۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2268,
			"arabicnumber": 2268,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، ان سے حماد بن زید نے بیان کیا، ان سے ایوب سختیانی نے، ان سے نافع نے، ان سے ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، تمہاری اور یہود و نصاریٰ کی مثال ایسی ہے کہ کسی شخص نے کئی مزدور کام پر لگائے اور کہا کہ میرا کام ایک قیراط پر صبح سے دوپہر تک کون کرے گا؟ اس پر یہودیوں نے ( صبح سے دوپہر تک ) اس کا کام کیا۔ پھر اس نے کہا کہ آدھے دن سے عصر تک ایک قیراط پر میرا کام کون کرے گا؟ چنانچہ یہ کام پھر نصاریٰ نے کیا، پھر اس شخص نے کہا کہ عصر کے وقت سے سورج ڈوبنے تک میرا کام دو قیراط پر کون کرے گا؟ اور تم ( امت محمدیہ ) ہی وہ لوگ ہو ( جن کو یہ درجہ حاصل ہوا ) اس پر یہود و نصاریٰ نے برا مانا، وہ کہنے لگے کہ کام تو ہم زیادہ کریں اور مزدوری ہمیں کم ملے، پھر اس شخص نے کہا کہ اچھا یہ بتاؤ کیا تمہارا حق تمہیں پورا نہیں ملا؟ سب نے کہا کہ ہمیں تو ہمارا پورا حق مل گیا۔ اس شخص نے کہا کہ پھر یہ میرا فضل ہے میں جسے چاہوں زیادہ دوں۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2269,
			"arabicnumber": 2269,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما کے غلام عبداللہ بن دینار نے بیان کیا، اور ان سے عبداللہ بن عمر بن خطاب رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تمہاری اور یہود و نصاریٰ کی مثال ایسی ہے کہ ایک شخص نے چند مزدور کام پر لگائے اور کہا کہ ایک ایک قیراط پر آدھے دن تک میری مزدوری کون کرے گا؟ پس یہود نے ایک قیراط پر یہ مزدوری کی۔ پھر نصاریٰ نے بھی ایک قیراط پر کام کیا۔ پھر تم لوگوں نے عصر سے مغرب تک دو دو قیراط پر کام کیا۔ اس پر یہود و نصاریٰ غصہ ہو گئے کہ ہم نے تو زیادہ کام کیا اور مزدوری ہم کو کم ملی۔ اس پر اس شخص نے کہا کہ کیا میں نے تمہارا حق ذرہ برابر بھی مارا ہے؟ تو انہوں نے کہا کہ نہیں۔ پھر اس شخص نے کہا کہ یہ میرا فضل ہے جسے چاہوں زیادہ دیتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2270,
			"arabicnumber": 2270,
			"text": "ہم سے یوسف بن محمد نے بیان کیا، کہا کہ مجھ سے یحییٰ بن سلیم نے بیان کیا، ان سے اسماعیل بن امیہ نے، ان سے سعید بن ابی سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے بتلایا کہ اللہ تعالیٰ کا فرمان ہے کہ تین قسم کے لوگ ایسے ہیں کہ جن کا قیامت میں میں خود مدعی بنوں گا۔ ایک تو وہ شخص جس نے میرے نام پہ عہد کیا، اور پھر وعدہ خلافی کی۔ دوسرا وہ جس نے کسی آزاد آدمی کو بیچ کر اس کی قیمت کھائی اور تیسرا وہ شخص جس نے کسی کو مزدور کیا، پھر کام تو اس سے پورا لیا، لیکن اس کی مزدوری نہ دی۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2271,
			"arabicnumber": 2271,
			"text": "ہم سے محمد بن علاء نے بیان کیا، کہا کہ ہم سے ابواسامہ نے بیان کیا، ان سے یزید بن عبداللہ نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، مسلمانوں کی اور یہود و نصاریٰ کی مثال ایسی ہے کہ ایک شخص نے چند آدمیوں کو مزدور کیا کہ یہ سب اس کا ایک کام صبح سے رات تک مقررہ اجرت پر کریں۔ چنانچہ کچھ لوگوں نے یہ کام دوپہر تک کیا۔ پھر کہنے لگے کہ ہمیں تمہاری اس مزدوری کی ضرورت نہیں ہے جو تم نے ہم سے طے کی ہے بلکہ جو کام ہم نے کر دیا وہ بھی غلط رہا۔ اس پر اس شخص نے کہا کہ ایسا نہ کرو۔ اپنا کام پورا کر لو اور اپنی پوری مزدوری لے جاؤ، لیکن انہوں نے انکار کر دیا اور کام چھوڑ کر چلے گئے۔ آخر اس نے دوسرے مزدور لگائے اور ان سے کہا کہ باقی دن پورا کر لو تو میں تمہیں وہی مزدوری دوں گا جو پہلے مزدوروں سے طے کی تھی۔ چنانچہ انہوں نے کام شروع کیا، لیکن عصر کی نماز کا وقت آیا تو انہوں نے بھی یہی کیا کہ ہم نے جو تمہارا کام کر دیا ہے وہ بالکل بیکار رہا۔ وہ مزدوری بھی تم اپنے ہی پاس رکھو جو تم نے ہم سے طے کی تھی۔ اس شخص نے ان کو سمجھایا کہ اپنا باقی کام پورا کر لو۔ دن بھی اب تھوڑا ہی باقی رہ گیا ہے، لیکن وہ نہ مانے، آخر اس شخص نے دوسرے مزدور لگائے کہ یہ دن کا جو حصہ باقی رہ گیا ہے اس میں یہ کام کر دیں۔ چنانچہ ان لوگوں نے سورج غروب ہونے تک دن کے بقیہ حصہ میں کام پورا کیا اور پہلے اور دوسرے مزدوروں کی مزدوری بھی سب ان ہی کو ملی۔ تو مسلمانوں کی اور اس نور کی جس کو انہوں نے قبول کیا، یہی مثال ہے۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2272,
			"arabicnumber": 2272,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہم کو شعیب نے خبر دی، انہیں زہری نے خبر دی، ان سے سالم بن عبداللہ نے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پہلی امت کے تین آدمی کہیں سفر میں جا رہے تھے۔ رات ہونے پر رات گزارنے کے لیے انہوں نے ایک پہاڑ کے غار میں پناہ لی، اور اس میں اندر داخل ہو گئے۔ اتنے میں پہاڑ سے ایک چٹان لڑھکی اور اس نے غار کا منہ بند کر دیا۔ سب نے کہا کہ اب اس غار سے تمہیں کوئی چیز نکالنے والی نہیں، سوا اس کے کہ تم سب، اپنے سب سے زیادہ اچھے عمل کو یاد کر کے اللہ تعالیٰ سے دعا کرو۔ اس پر ان میں سے ایک شخص نے اپنی دعا شروع کی کہ اے اللہ! میرے ماں باپ بہت بوڑھے تھے اور میں روزانہ ان سے پہلے گھر میں کسی کو بھی دودھ نہیں پلاتا تھا، نہ اپنے بال بچوں کو، اور نہ اپنے غلام وغیرہ کو۔ ایک دن مجھے ایک چیز کی تلاش میں رات ہو گئی اور جب میں گھر واپس ہوا تو وہ ( میرے ماں باپ ) سو چکے تھے۔ پھر میں نے ان کے لیے شام کا دودھ نکالا۔ جب ان کے پاس لایا تو وہ سوئے ہوئے تھے۔ مجھے یہ بات ہرگز اچھی معلوم نہیں ہوئی کہ ان سے پہلے اپنے بال بچوں یا اپنے کسی غلام کو دودھ پلاؤں، اس لیے میں ان کے سرہانے کھڑا رہا۔ دودھ کا پیالہ میرے ہاتھ میں تھا اور میں ان کے جاگنے کا انتظار کر رہا تھا۔ یہاں تک کہ صبح ہو گئی۔ اب میرے ماں باپ جاگے اور انہوں نے اپنا شام کا دودھ اس وقت پیا، اے اللہ! اگر میں نے یہ کام محض تیری رضا حاصل کرنے کے لیے کیا تھا تو اس چٹان کی آفت کو ہم سے ہٹا دے۔ اس دعا کے نتیجہ میں وہ غار تھوڑا سا کھل گیا۔ مگر نکلنا اب بھی ممکن نہ تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ پھر دوسرے نے دعا کی، اے اللہ! میرے چچا کی ایک لڑکی تھی۔ جو سب سے زیادہ مجھے محبوب تھی، میں نے اس کے ساتھ برا کام کرنا چاہا، لیکن اس نے نہ مانا۔ اسی زمانہ میں ایک سال قحط پڑا۔ تو وہ میرے پاس آئی میں نے اسے ایک سو بیس دینار اس شرط پر دیئے کہ وہ خلوت میں مجھے سے برا کام کرائے۔ چنانچہ وہ راضی ہو گئی۔ اب میں اس پر قابو پا چکا تھا۔ لیکن اس نے کہا کہ تمہارے لیے میں جائز نہیں کرتی کہ اس مہر کو تم حق کے بغیر توڑو۔ یہ سن کر میں اپنے برے ارادے سے باز آ گیا اور وہاں سے چلا آیا۔ حالانکہ وہ مجھے سب سے بڑھ کر محبوب تھی اور میں نے اپنا دیا ہوا سونا بھی واپس نہیں لیا۔ اے اللہ! اگر یہ کام میں نے صرف تیری رضا کے لیے کیا تھا تو ہماری اس مصیبت کو دور کر دے۔ چنانچہ چٹان ذرا سی اور کھسکی، لیکن اب بھی اس سے باہر نہیں نکلا جا سکتا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اور تیسرے شخص نے دعا کی۔ اے اللہ! میں نے چند مزدور کئے تھے۔ پھر سب کو ان کی مزدوری پوری دے دی، مگر ایک مزدور ایسا نکلا کہ وہ اپنی مزدوری ہی چھوڑ گیا۔ میں نے اس کی مزدوری کو کاروبار میں لگا دیا اور بہت کچھ نفع حاصل ہو گیا پھر کچھ دنوں کے بعد وہی مزدور میرے پاس آیا اور کہنے لگا اللہ کے بندے! مجھے میری مزدوری دیدے، میں نے کہا یہ جو کچھ تو دیکھ رہا ہے۔ اونٹ، گائے، بکری اور غلام یہ سب تمہاری مزدوری ہی ہے۔ وہ کہنے لگا اللہ کے بندے! مجھ سے مذاق نہ کر۔ میں نے کہا میں مذاق نہیں کرتا، چنانچہ اس شخص نے سب کچھ لیا اور اپنے ساتھ لے گیا۔ ایک چیز بھی اس میں سے باقی نہیں چھوڑی۔ تو اے اللہ! اگر میں نے یہ سب کچھ تیری رضا مندی حاصل کرنے کے لیے کیا تھا تو تو ہماری اس مصیبت کو دور کر دے۔ چنانچہ وہ چٹان ہٹ گئی اور وہ سب باہر نکل کر چلے گئے۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2273,
			"arabicnumber": 2273,
			"text": "ہم سے سعید بن یحییٰ بن سعید نے بیان کیا، کہا کہ مجھ سے میرے باپ (یحییٰ بن سعید قریش) نے بیان کیا، ان سے اعمش نے بیان کیا، ان سے شفیق نے اور ان سے ابومسعود انصاری رضی اللہ عنہ نے کہ ہم سے سعید بن یحییٰ بن سعید نے بیان کیا، کہا کہ مجھ سے میرے باپ ( یحییٰ بن سعید قریش ) نے بیان کیا، ان سے اعمش نے بیان کیا، ان سے شفیق نے اور ان سے ابومسعود انصاری رضی اللہ عنہ نے کہ",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2274,
			"arabicnumber": 2274,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا، ان سے معمر نے بیان کیا، ان سے ابن طاؤس نے، ان سے ان کے باپ نے، اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے ( تجارتی ) قافلوں سے ( منڈی سے آگے جا کر ) ملاقات کرنے سے منع فرمایا تھا۔ اور یہ کہ شہری دیہاتی کا مال نہ بیچیں، میں نے پوچھا، اے ابن عباس رضی اللہ عنہما! ”شہری دیہاتی کا مال نہ بیچیں“ کا کیا مطلب ہے؟ انہوں نے فرمایا کہ مراد یہ ہے کہ ان کے دلال نہ بنیں۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2275,
			"arabicnumber": 2275,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا کہ مجھ سے میرے باپ نے بیان کیا، ان سے اعمش نے بیان کیا، ان سے مسلم بن صبیح نے، ان سے مسروق نے، ان سے خباب بن ارت رضی اللہ عنہ نے بیان کیا، انہوں نے کہا کہ میں لوہار تھا، میں نے عاص بن وائل ( مشرک ) کا کام کیا۔ جب میری بہت سی مزدوری اس کے سر چڑھ گئی تو میں اس کے پاس تقاضا کرنے آیا، وہ کہنے لگا کہ اللہ کی قسم! میں تمہاری مزدوری اس وقت تک نہیں دوں گا جب تک تم محمد صلی اللہ علیہ وسلم سے نہ پھر جاؤ۔ میں نے کہا، اللہ کی قسم! یہ تو اس وقت بھی نہ ہو گا جب تو مر کے دوبارہ زندہ ہو گا۔ اس نے کہا، کیا میں مرنے کے بعد پھر دوبارہ زندہ کیا جاؤں گا؟ میں نے کہا کہ ہاں! اس پر وہ بولا پھر کیا ہے۔ وہیں میرے پاس مال اور اولاد ہو گی اور وہیں میں تمہارا قرض ادا کر دوں گا۔ اس پر قرآن مجید کی یہ آیت نازل ہوئی «أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏» ”اے پیغمبر! کیا تو نے اس شخص کو دیکھا جس نے ہماری آیتوں کا انکار کیا، اور کہا کہ مجھے ضرور وہاں مال و اولاد دی جائے گی۔“",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2276,
			"arabicnumber": 2276,
			"text": "ہم سے ابوالنعمان نے بیان کیا، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا، ان سے ابوبشر نے بیان کیا، ان سے ابوالمتوکل نے بیان کیا، اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے کچھ صحابہ رضی اللہ عنہم سفر میں تھے۔ دوران سفر میں وہ عرب کے ایک قبیلہ پر اترے۔ صحابہ نے چاہا کہ قبیلہ والے انہیں اپنا مہمان بنا لیں، لیکن انہوں نے مہمانی نہیں کی، بلکہ صاف انکار کر دیا۔ اتفاق سے اسی قبیلہ کے سردار کو سانپ نے ڈس لیا، قبیلہ والوں نے ہر طرح کی کوشش کر ڈالی، لیکن ان کا سردار اچھا نہ ہوا۔ ان کے کسی آدمی نے کہا کہ چلو ان لوگوں سے بھی پوچھیں جو یہاں آ کر اترے ہیں۔ ممکن ہے کوئی دم جھاڑنے کی چیز ان کے پاس ہو۔ چنانچہ قبیلہ والے ان کے پاس آئے اور کہا کہ بھائیو! ہمارے سردار کو سانپ نے ڈس لیا ہے۔ اس کے لیے ہم نے ہر قسم کی کوشش کر ڈالی لیکن کچھ فائدہ نہ ہوا۔ کیا تمہارے پاس کوئی چیز دم کرنے کی ہے؟ ایک صحابی نے کہا کہ قسم اللہ کی میں اسے جھاڑ دوں گا لیکن ہم نے تم سے میزبانی کے لیے کہا تھا اور تم نے اس سے انکار کر دیا۔ اس لیے اب میں بھی اجرت کے بغیر نہیں جھاڑ سکتا، آخر بکریوں کے ایک گلے پر ان کا معاملہ طے ہوا۔ وہ صحابی وہاں گئے اور «الحمد لله رب العالمين» پڑھ پڑھ کر دم کیا۔ ایسا معلوم ہوا جیسے کسی کی رسی کھول دی گئی ہو۔ وہ سردار اٹھ کر چلنے لگا، تکلیف و درد کا نام و نشان بھی باقی نہیں تھا۔ بیان کیا کہ پھر انہوں نے طے شدہ اجرت صحابہ کو ادا کر دی۔ کسی نے کہا کہ اسے تقسیم کر لو، لیکن جنہوں نے جھاڑا تھا، وہ بولے کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر پہلے ہم آپ صلی اللہ علیہ وسلم سے اس کا ذکر کر لیں۔ اس کے بعد دیکھیں گے کہ آپ صلی اللہ علیہ وسلم کیا حکم دیتے ہیں۔ چنانچہ سب حضرات رسول اللہ صلی اللہ علیہ وسلم خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ تم کو کیسے معلوم ہوا کہ سورۃ فاتحہ بھی ایک رقیہ ہے؟ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم نے ٹھیک کیا۔ اسے تقسیم کر لو اور ایک میرا حصہ بھی لگاؤ۔ یہ فرما کر رسول اللہ صلی اللہ علیہ وسلم ہنس پڑے۔ شعبہ نے کہا کہ ابوالبشر نے ہم سے بیان کیا، انہوں نے ابوالمتوکل سے ایسا ہی سنا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2277,
			"arabicnumber": 2277,
			"text": "ہم سے محمد بن یوسف بیکندی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، ان سے حمید طویل نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ ابوطیبہ حجام نے نبی کریم صلی اللہ علیہ وسلم کے پچھنا لگایا، تو آپ صلی اللہ علیہ وسلم نے انہیں اجرت میں ایک صاع یا دو صاع غلہ دینے کا حکم دیا اور ان کے مالکوں سے سفارش کی کہ جو محصول اس پر مقرر ہے اس میں کچھ کمی کر دیں۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2278,
			"arabicnumber": 2278,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے وہیب نے بیان کیا، کہا کہ ہم سے ابن طاؤس نے بیان کیا، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا اور پچھنا لگانے والے کو اجرت بھی دی۔ اگر پچھنا لگوانا ناجائز ہوتا تو آپ صلی اللہ علیہ وسلم نہ پچھنا لگواتے نہ اجرت دیتے۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2279,
			"arabicnumber": 2279,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے یزید بن زریع نے بیان کیا، ان سے خالد نے، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا اور پچھنا لگانے والے کو اجرت بھی دی، اگر اس میں کوئی کراہت ہوتی تو آپ صلی اللہ علیہ وسلم کا ہے کو دیتے۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2280,
			"arabicnumber": 2280,
			"text": "ہم سے ابونعیم نے بیان کیا، انہوں نے کہا کہ ہم سے مسعر نے بیان کیا، ان سے عمرو بن عامر نے بیان کیا کہ میں نے انس رضی اللہ عنہ سے سنا، وہ بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا، اور آپ صلی اللہ علیہ وسلم کسی کی مزدوری کے معاملے میں کسی پر ظلم نہیں کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2281,
			"arabicnumber": 2281,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے حمید طویل نے بیان کیا، اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک پچھنا لگانے والے غلام ( ابوطیبہ ) کو بلایا، انہوں نے آپ صلی اللہ علیہ وسلم کے پچھنا لگایا۔ اور آپ صلی اللہ علیہ وسلم نے انہیں ایک یا دو صاع، یا ایک یا دو مد ( راوی حدیث شعبہ کو شک تھا ) اجرت دینے کے لیے حکم فرمایا۔ آپ صلی اللہ علیہ وسلم نے ( ان کے مالکوں سے بھی ) ان کے بارے میں سفارش فرمائی تو ان کا خراج کم کر دیا گیا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2282,
			"arabicnumber": 2282,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے امام مالک نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے ابوبکر بن عبدالرحمٰن بن حارث بن ہشام نے بیان کیا، ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کتے کی قیمت، زانیہ ( کے زنا ) کی خرچی اور کاہن کی مزدوری سے منع فرمایا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2283,
			"arabicnumber": 2283,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے محمد بن حجادہ نے بیان کیا، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے باندیوں کی زنا کی کمائی سے منع فرمایا تھا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2284,
			"arabicnumber": 2284,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے عبدالوارث اور اسماعیل بن ابراہیم نے بیان کیا، ان سے علی بن حکم نے، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے نرکدانے کی اجرت لینے سے منع فرمایا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2286,
			"arabicnumber": 2286,
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		}
	]
}