{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"40": "Representation, Authorization, Business by Proxy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2299,
			"arabicnumber": 2299,
			"text": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے بیان کیا، ان سے ابن ابی نجیح نے بیان کی، ان سے مجاہد نے، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھے حکم دیا تھا کہ ان قربانی کے جانوروں کے جھول اور ان کے چمڑے کو میں خیرات کر دوں جنہیں قربان کیا گیا تھا۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2300,
			"arabicnumber": 2300,
			"text": "ہم سے عمرو بن خالد نے بیان کیا، ان سے لیث نے بیان کیا، ان سے یزید نے، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے کچھ بکریاں ان کے حوالہ کی تھیں تاکہ صحابہ رضی اللہ عنہم میں ان کو تقسیم کر دیں۔ ایک بکری کا بچہ باقی رہ گیا۔ جب اس کا ذکر انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی تو قربانی کر لے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2301,
			"arabicnumber": 2301,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا کہ مجھ سے یوسف بن ماجشون نے بیان کیا، ان سے صالح بن ابراہیم بن عبدالرحمٰن بن عوف نے، ان سے ان کے باپ نے، اور ان سے صالح کے دادا عبدالرحمٰن بن عوف رضی اللہ عنہ نے بیان کیا کہ میں نے امیہ بن خلف سے یہ معاہدہ اپنے اور اس کے درمیان لکھوایا کہ وہ میرے بال بچوں یا میری جائیداد کی جو مکہ میں ہے، حفاظت کرے اور میں اس کی جائیداد کی جو مدینہ میں ہے حفاظت کروں۔ جب میں نے اپنا نام لکھتے وقت رحمان کا ذکر کیا تو اس نے کہا کہ میں رحمن کو کیا جانوں۔ تم اپنا وہی نام لکھواؤ جو زمانہ جاہلیت میں تھا۔ چنانچہ میں نے عبد عمرو لکھوایا۔ بدر کی لڑائی کے موقع پر میں ایک پہاڑ کی طرف گیا تاکہ لوگوں سے آنکھ بچا کر اس کی حفاظت کر سکوں، لیکن بلال رضی اللہ عنہ نے دیکھ لیا اور فوراً ہی انصار کی ایک مجلس میں آئے۔ انہوں نے مجلس والوں سے کہا کہ یہ دیکھو امیہ بن خلف ( کافر دشمن اسلام ) ادھر موجود ہے۔ اگر امیہ کافر بچ نکلا تو میری ناکامی ہو گی۔ چنانچہ ان کے ساتھ انصار کی ایک جماعت ہمارے پیچھے ہو لی۔ جب مجھے خوف ہوا کہ اب یہ لوگ ہمیں آ لیں گے تو میں نے اس کے لڑکے کو آگے کر دیا تاکہ اس کے ساتھ ( آنے والی جماعت ) مشغول رہے، لیکن لوگوں نے اسے قتل کر دیا اور پھر بھی وہ ہماری ہی طرف بڑھنے لگے۔ امیہ بہت بھاری جسم کا تھا۔ آخر جب جماعت انصار نے ہمیں آ لیا ا تو میں نے اس سے کہا کہ زمین پر لیٹ جا۔ جب وہ زمین پر لیٹ گیا تو میں نے اپنا جسم اس کے اوپر ڈال دیا۔ تاکہ لوگوں کو روک سکوں، لیکن لوگوں نے میرے جسم کے نیچے سے اس کے جسم پر تلوار کی ضربات لگائیں اور اسے قتل کر کے ہی چھوڑا۔ ایک صحابی نے اپنی تلوار سے میرے پاؤں کو بھی زخمی کر دیا تھا۔ عبدالرحمٰن بن عوف رضی اللہ عنہ اس کا نشان اپنے قدم کے اوپر ہمیں دکھایا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2303,
			"arabicnumber": 2303,
			"text": "",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2304,
			"arabicnumber": 2304,
			"text": "ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے معتمر سے سنا، انہوں نے کہا کہ ہم کو عبیداللہ نے خبر دی، انہیں نافع نے، انہوں نے ابن کعب بن مالک رضی اللہ عنہ سے سنا، وہ اپنے والد سے بیان کرتے تھے کہ ان کے پاس بکریوں کا ایک ریوڑ تھا۔ جو سلع پہاڑی پر چرنے جاتا تھا ( انہوں نے بیان کیا کہ ) ہماری ایک باندی نے ہمارے ہی ریوڑ کی ایک بکری کو ( جب کہ وہ چر رہی تھی ) دیکھا کہ مرنے کے قریب ہے۔ اس نے ایک پتھر توڑ کر اس سے اس بکری کو ذبح کر دیا۔ انہوں نے اپنے گھر والوں سے کہا کہ جب تک میں نبی کریم صلی اللہ علیہ وسلم سے اس کے بارے میں میں پوچھ نہ لوں اس کا گوشت نہ کھانا۔ یا ( یوں کہا کہ ) جب تک میں کسی کو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اس کے بارے میں پوچھنے کے لیے نہ بھیجوں، چنانچہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا، یا کسی کو ( پوچھنے کے لیے ) بھیجا، اور نبی کریم صلی اللہ علیہ وسلم نے اس کا گوشت کھانے کے لیے حکم فرمایا۔ عبیداللہ نے کہا کہ مجھے یہ بات عجیب معلوم ہوئی کہ باندی ( عورت ) ہونے کے باوجود اس نے ذبح کر دیا۔ اس روایت کی متابعت عبدہ نے عبیداللہ کے واسطہ سے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2305,
			"arabicnumber": 2305,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے بیان کیا، ان سے سلمہ بن کہیل نے بیان کیا، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم پر ایک شخص کا ایک خاص عمر کا اونٹ قرض تھا۔ وہ شخص تقاضا کرنے آیا تو آپ صلی اللہ علیہ وسلم نے ( اپنے صحابہ سے ) فرمایا کہ ادا کر دو۔ صحابہ رضی اللہ عنہم نے اس عمر کا اونٹ تلاش کیا لیکن نہیں ملا۔ البتہ اس سے زیادہ عمر کا ( مل سکا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہی انہیں دے دو۔ اس پر اس شخص نے کہا کہ آپ نے مجھے پورا پورا حق دے دیا۔ اللہ تعالیٰ آپ کو بھی پورا بدلہ دے۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سب سے بہتر وہ لوگ ہیں جو قرض وغیرہ کو پوری طرح ادا کر دیتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2306,
			"arabicnumber": 2306,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے سلمہ بن کہیل نے بیان کیا، انہوں نے ابوسلمہ بن عبدالرحمٰن سے سنا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ ایک شخص نبی کریم صلی اللہ علیہ وسلم سے ( اپنے قرض کا ) تقاضا کرنے آیا، اور سخت گفتگو کرنے لگا۔ صحابہ کرام رضی اللہ عنہم غصہ ہو کر اس کی طرف بڑھے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو۔ کیونکہ جس کا کسی پر حق ہو تو وہ ( بات ) کہنے کا بھی حق رکھتا ہے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے قرض والے جانور کی عمر کا ایک جانور اسے دے دو۔ صحابہ رضی اللہ عنہم نے عرض کیا یا رسول اللہ! اس سے زیادہ عمر کا جانور تو موجود ہے۔ ( لیکن اس عمر کا نہیں ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے وہی دے دو۔ کیونکہ سب سے اچھا آدمی وہ ہے جو دوسروں کا حق پوری طرح ادا کر دے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2308,
			"arabicnumber": 2308,
			"text": "",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2309,
			"arabicnumber": 2309,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، کہا کہ ہم سے ابن جریج نے بیان کیا، ان سے عطاء بن ابی رباح اور کئی لوگوں نے ایک دوسرے کی روایت میں زیادتی کے ساتھ۔ سب راویوں نے اس حدیث کو جابر رضی اللہ عنہ تک نہیں پہنچایا بلکہ ایک راوی نے ان میں سے مرسلاً روایت کیا ہے۔ وہ جابر بن عبداللہ رضی اللہ عنہما سے روایت کرتے ہیں کہ انہوں نے بیان کیا، میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھا اور میں ایک سست اونٹ پر سوار تھا اور وہ سب سے آخر میں رہتا تھا۔ اتفاق سے نبی کریم صلی اللہ علیہ وسلم کا گزر میری طرف سے ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا یہ کون صاحب ہیں؟ میں نے عرض کیا جابر بن عبداللہ، آپ صلی اللہ علیہ وسلم نے فرمایا کیا بات ہوئی ( کہ اتنے پیچھے رہ گئے ہو ) میں بولا کہ ایک نہایت سست رفتار اونٹ پر سوار ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا، تمہارے پاس کوئی چھڑی بھی ہے؟ میں نے کہا کہ جی ہاں ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ مجھے دیدے۔ میں نے آپ کی خدمت میں وہ پیش کر دی۔ آپ نے اس چھڑی سے اونٹ کو جو مارا اور ڈانٹا تو اس کے بعد وہ سب سے آگے رہنے لگا۔ نبی کریم صلی اللہ علیہ وسلم نے پھر فرمایا کہ یہ اونٹ مجھے فروخت کر دے۔ میں نے عرض کیا کہ یا رسول اللہ! یہ تو آپ صلی اللہ علیہ وسلم کا ہی ہے، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے مجھے فروخت کر دے۔ یہ بھی فرمایا کہ چار دینار میں اسے میں خریدتا ہوں ویسے تم مدینہ تک اسی پر سوار ہو کر چل سکتے ہو۔ پھر جب مدینہ کے قریب ہم پہنچے تو میں ( دوسری طرف ) جانے لگا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کہاں جا رہے ہو؟ میں نے عرض کیا کہ میں نے ایک بیوہ عورت سے شادی کر لی ہے آپ صلی اللہ علیہ وسلم نے فرمایا کہ کسی باکرہ سے کیوں نہ کی کہ تم بھی اس کے ساتھ کھیلتے اور وہ بھی تمہارے ساتھ کھیلتی۔ میں نے عرض کیا کہ والد شہادت پا چکے ہیں۔ اور گھر میں کئی بہنیں ہیں۔ اس لیے میں نے سوچا کہ کسی ایسی خاتون سے شادی کروں جو بیوہ اور تجربہ کار ہو۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تو ٹھیک ہے، پھر مدینہ پہنچنے کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ بلال! ان کی قیمت ادا کر دو اور کچھ بڑھا کر دے دو۔ چنانچہ انہوں نے چار دینار بھی دئیے۔ اور فالتو ایک قیراط بھی دیا۔ جابر رضی اللہ عنہ کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم کا یہ انعام میں اپنے سے کبھی جدا نہیں کرتا، چنانچہ نبی کریم صلی اللہ علیہ وسلم کا وہ قیراط جابر رضی اللہ عنہ ہمیشہ اپنی تھیلی میں محفوظ رکھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2310,
			"arabicnumber": 2310,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں ابوحازم نے، انہیں سہل بن سعد رضی اللہ عنہ نے، انہوں نے بیان کیا کہ ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کیا کہ یا رسول اللہ! میں نے خود کو آپ کو بخش دیا۔ اس پر ایک صحابی نے کہا کہ آپ میرا ان سے نکاح کر دیجئیے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تمہارا نکاح ان سے اس مہر کے ساتھ کیا جو تمہیں قرآن یاد ہے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "اور عثمان بن ہیثم ابوعمرو نے بیان کیا کہ ہم سے عوف نے بیان کیا، ان سے محمد بن سیرین نے، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے رمضان کی زکوٰۃ کی حفاظت پر مقرر فرمایا۔ ( رات میں ) ایک شخص اچانک میرے پاس آیا اور غلہ میں سے لپ بھربھر کر اٹھانے لگا میں نے اسے پکڑ لیا اور کہا کہ قسم اللہ کی! میں تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے چلوں گا۔ اس پر اس نے کہا کہ اللہ کی قسم! میں بہت محتاج ہوں۔ میرے بال بچے ہیں اور میں سخت ضرورت مند ہوں۔ ابوہریرہ رضی اللہ عنہ نے کہا ( اس کے اظہار معذرت پر ) میں نے اسے چھوڑ دیا۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا، اے ابوہریرہ! گذشتہ رات تمہارے قیدی نے کیا کیا تھا؟ میں نے کہا یا رسول اللہ! اس نے سخت ضرورت اور بال بچوں کا رونا رویا، اس لیے مجھے اس پر رحم آ گیا۔ اور میں نے اسے چھوڑ دیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ تم سے جھوٹ بول کر گیا ہے۔ اور وہ پھر آئے گا۔ رسول اللہ صلی اللہ علیہ وسلم کے اس فرمانے کی وجہ سے مجھ کو یقین تھا کہ وہ پھر ضرور آئے گا۔ اس لیے میں اس کی تاک میں لگا رہا۔ اور جب وہ دوسری رات آ کے پھر غلہ اٹھانے لگا تو میں نے اسے پھر پکڑا اور کہا کہ تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر کروں گا، لیکن اب بھی اس کی وہی التجا تھی کہ مجھے چھوڑ دے، میں محتاج ہوں۔ بال بچوں کا بوجھ میرے سر پر ہے۔ اب میں کبھی نہ آؤں گا۔ مجھے رحم آ گیا اور میں نے اسے پھر چھوڑ دیا۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اے ابوہریرہ! تمہارے قیدی نے کیا کیا؟ میں نے کہا یا رسول اللہ! اس نے پھر اسی سخت ضرورت اور بال بچوں کا رونا رویا۔ جس پر مجھے رحم آ گیا۔ اس لیے میں نے اسے چھوڑ دیا۔ آپ صلی اللہ علیہ وسلم نے اس مرتبہ بھی یہی فرمایا کہ وہ تم سے جھوٹ بول کر گیا ہے اور وہ پھر آئے گا۔ تیسری مرتبہ میں پھر اس کے انتظار میں تھا کہ اس نے پھر تیسری رات آ کر غلہ اٹھانا شروع کیا، تو میں نے اسے پکڑ لیا، اور کہا کہ تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پہنچانا اب ضروری ہو گیا ہے۔ یہ تیسرا موقع ہے۔ ہر مرتبہ تم یقین دلاتے رہے کہ پھر نہیں آؤ گے۔ لیکن تم باز نہیں آئے۔ اس نے کہا کہ اس مرتبہ مجھے چھوڑ دے تو میں تمہیں ایسے چند کلمات سکھا دوں گا جس سے اللہ تعالیٰ تمہیں فائدہ پہنچائے گا۔ میں نے پوچھا وہ کلمات کیا ہیں؟ اس نے کہا، جب تم اپنے بستر پر لیٹنے لگو تو آیت الکرسی «الله لا إله إلا هو الحي القيوم» پوری پڑھ لیا کرو۔ ایک نگراں فرشتہ اللہ تعالیٰ کی طرف سے برابر تمہاری حفاظت کرتا رہے گا۔ اور صبح تک شیطان تمہارے پاس کبھی نہیں آ سکے گا۔ اس مرتبہ بھی پھر میں نے اسے چھوڑ دیا۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے دریافت فرمایا، گذشتہ رات تمہارے قیدی نے تم سے کیا معاملہ کیا؟ میں نے عرض کیا یا رسول اللہ! اس نے مجھے چند کلمات سکھائے اور یقین دلایا کہ اللہ تعالیٰ مجھے اس سے فائدہ پہنچائے گا۔ اس لیے میں نے اسے چھوڑ دیا۔ آپ نے دریافت کیا کہ وہ کلمات کیا ہیں؟ میں نے عرض کیا کہ اس نے بتایا تھا کہ جب بستر پر لیٹو تو آیت الکرسی پڑھ لو، شروع «الله لا إله إلا هو الحي القيوم» سے آخر تک۔ اس نے مجھ سے یہ بھی کہا کہ اللہ تعالیٰ کی طرف سے تم پر ( اس کے پڑھنے سے ) ایک نگراں فرشتہ مقرر رہے گا۔ اور صبح تک شیطان تمہارے قریب بھی نہیں آ سکے گا۔ صحابہ خیر کو سب سے آگے بڑھ کر لینے والے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے ( ان کی یہ بات سن کر ) فرمایا کہ اگرچہ وہ جھوٹا تھا۔ لیکن تم سے یہ بات سچ کہہ گیا ہے۔ اے ابوہریرہ! تم کو یہ بھی معلوم ہے کہ تین راتوں سے تمہارا معاملہ کس سے تھا؟ انہوں نے کہا نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ شیطان تھا۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2312,
			"arabicnumber": 2312,
			"text": "ہم سے اسحاق بن راہویہ نے بیان کیا، ان سے یحییٰ بن صالح نے بیان کیا، ان سے معاویہ بن سلام نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے بیان کیا، کہ میں نے عقبہ بن عبدالغافر سے سنا اور انہوں نے ابو سعید خدری رضی اللہ عنہ سے، انہوں نے بیان کیا کہ بلال رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں برنی کھجور ( کھجور کی ایک عمدہ قسم ) لے کر آئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا یہ کہاں سے لائے ہو؟ انہوں نے کہا ہمارے پاس خراب کھجور تھی، اس کے دو صاع اس کے ایک صاع کے بدلے میں دے کر ہم اسے لائے ہیں۔ تاکہ ہم یہ آپ کو کھلائیں آپ صلی اللہ علیہ وسلم نے فرمایا توبہ توبہ یہ تو سود ہے بالکل سود۔ ایسا نہ کیا کر البتہ ( اچھی کھجور ) خریدنے کا ارادہ ہو تو ( خراب ) کھجور بیچ کر ( اس کی قیمت سے ) عمدہ خریدا کر۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2313,
			"arabicnumber": 2313,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے، انہوں نے کہا کہ عمر رضی اللہ عنہ نے صدقہ کے باب میں جو کتاب لکھوائی تھی اس میں یوں ہے کہ صدقے کا متولی اس میں سے کھا سکتا ہے اور دوست کو کھلا سکتا ہے لیکن روپیہ نہ جمع کرے اور عبداللہ بن عمر رضی اللہ عنہما اپنے والد عمر رضی اللہ عنہ کے صدقے کے متولی تھے۔ وہ مکہ والوں کو اس میں سے تحفہ بھیجتے تھے جہاں آپ قیام فرمایا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2315,
			"arabicnumber": 2315,
			"text": "",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2316,
			"arabicnumber": 2316,
			"text": "ہم سے ابن سلام نے بیان کیا، کہا کہ ہم کو عبدالوہاب ثقفی نے خبر دی، انہیں ایوب نے، انہیں ابن ابی ملکیہ نے اور ان سے عقبہ بن حارث رضی اللہ عنہ نے بیان کیا کہ نعیمان یا ابن نعیمان کو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر کیا گیا۔ انہوں نے شراب پی لی تھی۔ جو لوگ اس وقت گھر میں موجود تھے رسول اللہ صلی اللہ علیہ وسلم نے انہیں کو اسے مارنے کا حکم دیا۔ انہوں نے بیان کیا میں بھی مارنے والوں سے تھا۔ ہم نے جوتوں اور چھڑیوں سے انہیں مارا تھا۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2317,
			"arabicnumber": 2317,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے عبداللہ بن ابی بکر بن حزم نے، انہیں عمرہ بنت عبدالرحمٰن نے خبر دی کہ عائشہ رضی اللہ عنہا نے بیان کیا، میں نے اپنے ہاتھوں سے نبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے قلادے بٹے تھے۔ پھر نبی کریم صلی اللہ علیہ وسلم نے ان جانوروں کو یہ قلادے اپنے ہاتھ سے پہنائے تھے۔ آپ صلی اللہ علیہ وسلم نے وہ جانور میرے والد کے ساتھ ( مکہ میں قربانی کے لیے ) بھیجے۔ ان کی قربانی کی گئی۔ لیکن ( اس بھیجنے کی وجہ سے ) آپ صلی اللہ علیہ وسلم پر کوئی ایسی چیز حرام نہیں ہوئی جسے اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کے لیے حلال کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2318,
			"arabicnumber": 2318,
			"text": "مجھ سے یحییٰ بن یحییٰ نے بیان کیا، کہا کہ میں نے امام مالک کے سامنے قرآت کی بواسطہ اسحاق بن عبداللہ کے کہ انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، وہ بیان کرتے تھے کہ ابوطلحہ رضی اللہ عنہ مدینہ میں انصار کے سب سے مالدار لوگوں میں سے تھے۔ بیرحاء ( ایک باغ ) ان کا سب سے زیادہ محبوب مال تھا۔ جو مسجد نبوی کے بالکل سامنے تھا۔ رسول اللہ صلی اللہ علیہ وسلم بھی وہاں تشریف لے جاتے اور اس کا نہایت میٹھا عمدہ پانی پیتے تھے۔ پھر جب قرآن کی آیت «لن تنالوا البر حتى تنفقوا مما تحبون‏» اتری ”تم نیکی ہرگز نہیں حاصل کر سکتے جب تک نہ خرچ کرو اللہ کی راہ میں وہ چیز جو تمہیں زیادہ پسند ہو“ تو ابوطلحہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے اور عرض کیا، یا رسول اللہ! اللہ تعالیٰ نے اپنی کتاب میں فرمایا ہے «لن تنالوا البر حتى تنفقوا مما تحبون‏» اور مجھے اپنے مال میں سب سے زیادہ پسند میرا یہی باغ بیرحاء ہے۔ یہ اللہ کی راہ میں صدقہ ہے۔ اس کی نیکی اور ذخیرہ ثواب کی امید میں صرف اللہ تعالیٰ سے رکھتا ہوں۔ پس آپ جہاں مناسب سمجھیں اسے خرچ فرما دیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا، واہ واہ! یہ بڑا ہی نفع والا مال ہے۔ بہت ہی مفید ہے۔ اس کے بارے میں تم نے جو کچھ کہا وہ میں نے سن لیا۔ اب میں تو یہی مناسب سمجھتا ہوں کہ اسے تو اپنے رشتہ داروں ہی میں تقسیم کر دے۔ ابوطلحہ رضی اللہ عنہ نے کہا کہ یا رسول اللہ! میں ایسا ہی کروں گا۔ چنانچہ یہ کنواں انہوں نے اپنے رشتہ داروں اور چچا کی اولاد میں تقسیم کر دیا۔ اس روایت کی متابعت اسماعیل نے مالک سے کی ہے۔ اور روح نے مالک سے ( لفظ «رائح‏.‏» کے بجائے ) «رابح‏.‏» نقل کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2319,
			"arabicnumber": 2319,
			"text": "ہم سے محمد بن علاء نے بیان کیا، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا، انہوں نے کہا کہ ہم سے برید بن عبداللہ نے، انہوں نے کہا کہ ہم سے ابوبردہ نے بیان کیا اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، امانت دار خزانچی جو خرچ کرتا ہے۔ بعض دفعہ یہ فرمایا کہ جو دیتا ہے حکم کے مطابق کامل اور پوری طرح جس چیز ( کے دینے ) کا اسے حکم ہو اور اسے دیتے وقت اس کا دل بھی خوش ہو، تو وہ بھی صدقہ کرنے والوں میں سے ایک ہے۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 18
			}
		}
	]
}