{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"43": "Loans, Payment of Loans, Freezing of Property, Bankruptcy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2385,
			"arabicnumber": 2385,
			"text": "ہم سے محمد بن یوسف بیکندی نے بیان کیا، کہا کہ ہم کو جریر نے خبر دی، انہیں مغیرہ نے، انہیں شعبی نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں شریک تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا، اپنے اونٹ کے بارے میں تمہاری کیا رائے ہے۔ کیا تم اسے بیچو گے؟ میں نے کہا ہاں، چنانچہ اونٹ میں نے آپ صلی اللہ علیہ وسلم کو بیچ دیا۔ اور جب آپ صلی اللہ علیہ وسلم مدینہ پہنچے۔ تو صبح اونٹ کو لے کر میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو گیا۔ آپ صلی اللہ علیہ وسلم نے مجھے اس کی قیمت ادا کر دی۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2386,
			"arabicnumber": 2386,
			"text": "ہم سے معلی بن اسد نے بیان کیا، ان سے عبدالواحد نے بیان کیا، ان سے اعمش نے بیان کیا، انہوں نے بیان کیا کہ ابراہیم کی خدمت میں ہم نے بیع سلم میں رہن کا ذکر کیا، تو انہوں نے بیان کیا کہ مجھ سے اسود نے بیان کیا اور ان سے عائشہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک یہودی سے غلہ ایک خاص مدت ( کے قرض پر ) خریدا، اور اپنی لوہے کی زرہ اس کے پاس رہن رکھ دی۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2387,
			"arabicnumber": 2387,
			"text": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا، ان سے سلیمان بن بلال نے بیان کیا، ان سے ثور بن زید نے، ان سے ابوغیث نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو کوئی لوگوں کا مال قرض کے طور پر ادا کرنے کی نیت سے لیتا ہے تو اللہ تعالیٰ بھی اس کی طرف سے ادا کرے گا اور جو کوئی نہ دینے کے لیے لے، تو اللہ تعالیٰ بھی اس کو تباہ کر دے گا۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2388,
			"arabicnumber": 2388,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا کہ ہم سے ابوشہاب نے بیان کیا، ان سے اعمش نے، ان سے زید بن وہب نے اور ان سے ابوذر رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھا۔ آپ صلی اللہ علیہ وسلم نے جب دیکھا، آپ کی مراد احد پہاڑ ( کو دیکھنے ) سے تھی۔ تو فرمایا کہ میں یہ بھی پسند نہیں کروں گا کہ احد پہاڑ سونے کا ہو جائے تو اس میں سے میرے پاس ایک دینار کے برابر بھی تین دن سے زیادہ باقی رہے۔ سوا اس دینار کے جو میں کسی کا قرض ادا کرنے کے لیے رکھ لوں۔ پھر فرمایا، ( دنیا میں ) دیکھو جو زیادہ ( مال ) والے ہیں وہی محتاج ہیں۔ سوا ان کے جو اپنے مال و دولت کو یوں اور یوں خرچ کریں۔ ابوشہاب راوی نے اپنے سامنے اور دائیں طرف اور بائیں طرف اشارہ کیا، لیکن ایسے لوگوں کی تعداد کم ہوتی ہے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا یہیں ٹھہرے رہو اور آپ صلی اللہ علیہ وسلم تھوڑی دور آگے کی طرف بڑھے۔ میں نے کچھ آواز سنی ( جیسے آپ صلی اللہ علیہ وسلم کسی سے باتیں کر رہے ہوں ) میں نے چاہا کہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو جاؤں۔ لیکن آپ صلی اللہ علیہ وسلم کا یہ فرمان یاد آیا کہ ”یہیں اس وقت تک ٹھہرے رہنا جب تک میں نہ آ جاؤں“ اس کے بعد جب آپ صلی اللہ علیہ وسلم تشریف لائے تو میں نے پوچھا یا رسول اللہ! ابھی میں نے کچھ سنا تھا۔ یا ( راوی نے یہ کہا کہ ) میں نے کوئی آواز سنی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا، تم نے بھی سنا! میں نے عرض کیا کہ ہاں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس جبرائیل علیہ السلام آئے تھے اور کہہ گئے ہیں کہ تمہاری امت کا جو شخص بھی اس حالت میں مرے کہ وہ اللہ کے ساتھ کسی کو شریک نہ ٹھہراتا ہو، تو وہ جنت میں داخل ہو گا۔ میں نے پوچھا کہ اگرچہ وہ اس طرح ( کے گناہ ) کرتا رہا ہو۔ تو آپ صلی اللہ علیہ وسلم نے کہا کہ ہاں۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2389,
			"arabicnumber": 2389,
			"text": "ہم سے احمد بن شبیب بن سعید نے بیان کیا، کہا کہ ہم سے ہمارے والد نے بیان کیا، ان سے یونس نے کہ ابن شہاب نے بیان کیا، ان سے عبیداللہ بن عبداللہ بن عتبہ نے بیان کیا، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اگر میرے پاس احد پہاڑ کے برابر بھی سونا ہو تب بھی مجھے یہ پسند نہیں کہ تین دن گزر جائیں اور اس ( سونے ) کا کوئی حصہ میرے پاس رہ جائے۔ سوا اس کے جو میں کسی قرض کے دینے کے لیے رکھ چھوڑوں۔ اس کی روایت صالح اور عقیل نے زہری سے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2390,
			"arabicnumber": 2390,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، انہیں سلمہ بن کہیل نے خبر دی، کہا کہ میں نے ابوسلمہ سے سنا، وہ ہمارے گھر میں ابوہریرہ رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے قرض کا تقاضا کیا اور سخت سست کہا۔ صحابہ رضی اللہ عنہم نے اس کو سزا دینی چاہی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے کہنے دو۔ صاحب حق کے لیے کہنے کا حق ہوتا ہے اور اسے ایک اونٹ خرید کر دے دو۔ لوگوں نے عرض کیا کہ اس کے اونٹ سے ( جو اس نے آپ کو قرض دیا تھا ) اچھی عمر ہی کا اونٹ مل رہا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہی خرید کے اسے دے دو۔ کیونکہ تم میں اچھا وہی ہے جو قرض ادا کرنے میں سب سے اچھا ہو۔ ( حدیث اور باب کی مطابقت ظاہر ہے)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2391,
			"arabicnumber": 2391,
			"text": "ہم سے مسلم نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، ان سے عبدالملک نے، ان سے ربعی بن حراش نے اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص کا انتقال ہوا ( قبر میں ) اس سے سوال ہوا، تمہارے پاس کوئی نیکی ہے؟ اس نے کہا کہ میں لوگوں سے خرید و فروخت کرتا تھا۔ ( اور جب کسی پر میرا قرض ہوتا ) تو میں مالداروں کو مہلت دیا کرتا تھا اور تنگ دستوں کے قرض کو معاف کر دیا کرتا تھا اس پر اس کی بخشش ہو گئی۔ ابومسعود رضی اللہ عنہ نے بیان کیا کہ میں نے یہی نبی کریم صلی اللہ علیہ وسلم سے سنا ہے۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2392,
			"arabicnumber": 2392,
			"text": "ہم سے مسدد نے بیان کیا، ان سے یحییٰ قطان نے، ان سے سفیان ثوری نے کہ مجھ سے سلمہ بن کہیل نے بیان کیا، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ ایک شخص نبی کریم صلی اللہ علیہ وسلم سے اپنا قرض کا اونٹ مانگنے آیا۔ تو آپ صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ اسے اس کا اونٹ دے دو۔ صحابہ نے عرض کیا کہ قرض خواہ کے اونٹ سے اچھی عمر کا ہی اونٹ مل رہا ہے۔ اس پر اس شخص ( قرض خواہ ) نے کہا مجھے تم نے میرا پورا حق دیا۔ تمہیں اللہ تمہارا حق پورا پورا دے! رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اسے وہی اونٹ دے دو کیونکہ بہترین شخص وہ ہے جو سب سے زیادہ بہتر طریقہ پر اپنا قرض ادا کرتا ہو۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2393,
			"arabicnumber": 2393,
			"text": "ہم سے ابونعیم نے بیان کیا، ان سے سفیان بن عیینہ نے بیان کیا، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم پر ایک شخص کا ایک خاص عمر کا اونٹ قرض تھا۔ وہ شخص آپ صلی اللہ علیہ وسلم سے تقاضا کرنے آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے اونٹ دے دو۔ صحابہ نے تلاش کیا لیکن ایسا ہی اونٹ مل سکا جو قرض خواہ کے اونٹ سے اچھی عمر کا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہی دے دو۔ اس پر اس شخص نے کہا کہ آپ نے مجھے میرا حق پوری طرح دیا اللہ آپ کو بھی اس کا بدلہ پورا پورا دے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں بہتر آدمی وہ ہے جو قرض ادا کرنے میں بھی سب سے بہتر ہو۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2394,
			"arabicnumber": 2394,
			"text": "ہم سے خلاد نے بیان کیا، ان سے مسعر نے بیان کیا، ان سے محارب بن دثار نے بیان کیا، اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم مسجد نبوی میں تشریف رکھتے تھے۔ مسعر نے بیان کیا کہ میرا خیال ہے کہ انہوں نے چاشت کے وقت کا ذکر کیا۔ ( کہ اس وقت خدمت نبوی میں حاضر ہوا ) پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ دو رکعت نماز پڑھ لو۔ میرا آپ صلی اللہ علیہ وسلم پر قرض تھا۔ آپ صلی اللہ علیہ وسلم نے اسے ادا کیا، بلکہ زیادہ بھی دے دیا۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2395,
			"arabicnumber": 2395,
			"text": "ہم سے عبدان نے بیان کیا، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے خبر دی، انہیں زہری نے بیان کیا، ان سے کعب بن مالک نے بیان کیا، اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ ان کے والد ( عبداللہ رضی اللہ عنہ ) احد کے دن شہید کر دیئے گئے تھے۔ ان پر قرض چلا آ رہا تھا۔ قرض خواہوں نے اپنے حق کے مطالبے میں سختی اختیار کی تو میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ آپ صلی اللہ علیہ وسلم نے ان سے دریافت فرما لیا کہ وہ میرے باغ کی کھجور لے لیں۔ اور میرے والد کو معاف کر دیں۔ لیکن قرض خواہوں نے اس سے انکار کیا تو نبی کریم صلی اللہ علیہ وسلم نے انہیں میرے باغ کا میوہ نہیں دیا۔ اور فرمایا کہ ہم صبح کو تمہارے باغ میں آئیں گے۔ چنانچہ جب صبح ہوئی تو آپ صلی اللہ علیہ وسلم ہمارے باغ میں تشریف لائے۔ آپ صلی اللہ علیہ وسلم درختوں میں پھرتے رہے۔ اور اس کے میوے میں برکت کی دعا فرماتے رہے۔ پھر میں نے کھجور توڑی اور ان کا تمام قرض ادا کرنے کے بعد بھی کھجور باقی بچ گئی۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2396,
			"arabicnumber": 2396,
			"text": "ہم سے ابراہیم بن المنذر نے کہا کہ ہم سے انس نے بیان کیا، ان سے ہشام نے، ان سے وہب بن کیسان نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ جب ان کے والد شہید ہوئے تو ایک یہودی کا تیس وسق قرض اپنے اوپر چھوڑ گئے۔ جابر رضی اللہ عنہ نے اس سے مہلت مانگی، لیکن وہ نہیں مانا۔ پھر جابر رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تاکہ آپ صلی اللہ علیہ وسلم اس یہودی ( ابوشحم ) سے ( مہلت دینے کی ) سفارش کریں۔ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور یہودی سے یہ فرمایا کہ جابر رضی اللہ عنہ کے باغ کے پھل ( جو بھی ہوں ) اس قرض کے بدلے میں لے لے۔ جو ان کے والد کے اوپر اس کا ہے، اس نے اس سے بھی انکار کیا۔ اب رسول اللہ صلی اللہ علیہ وسلم باغ میں داخل ہوئے اور اس میں چلتے رہے پھر جابر رضی اللہ عنہ سے آپ صلی اللہ علیہ وسلم نے فرمایا کہ باغ کا پھل توڑ کے اس کا قرض ادا کرو۔ جب رسول اللہ صلی اللہ علیہ وسلم واپس تشریف لائے تو انہوں نے باغ کی کھجوریں توڑیں اور یہودی کا تیس وسق ادا کر دیا۔ سترہ وسق اس میں سے بچ بھی رہا۔ جابر رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تاکہ آپ کو بھی یہ اطلاع دیں۔ آپ صلی اللہ علیہ وسلم اس وقت عصر کی نماز پڑھ رہے تھے۔ جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو انہوں نے آپ صلی اللہ علیہ وسلم کو اطلاع دی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی خبر ابن خطاب کو بھی کر دو۔ چنانچہ جابر رضی اللہ عنہ عمر رضی اللہ عنہ کے یہاں گئے۔ عمر رضی اللہ عنہ نے فرمایا، میں تو اسی وقت سمجھ گیا تھا جب رسول اللہ صلی اللہ علیہ وسلم باغ میں چل رہے تھے کہ اس میں ضرور برکت ہو گئی۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2397,
			"arabicnumber": 2397,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے خبر دی، وہ زہری سے روایت کرتے ہیں (دوسری سند) ہم سے اسماعیل نے بیان کیا، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا، ان سے سلیمان نے، ان سے محمد بن ابی عتیق نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے عروہ نے بیان کیا، اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نماز میں دعا کرتے تو یہ بھی کہتے ”اے اللہ! میں گناہ اور قرض سے تیری پناہ مانگتا ہوں۔“ کسی نے عرض کیا یا رسول اللہ! آپ قرض سے اتنی پناہ مانگتے ہیں؟ آپ صلی اللہ علیہ وسلم نے جواب دیا کہ جب آدمی مقروض ہوتا ہے تو جھوٹ بولتا ہے اور وعدہ کر کے اس کی خلاف ورزی کرتا ہے۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2398,
			"arabicnumber": 2398,
			"text": "ہم سے ابوالولید نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے عدی بن ثابت نے، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص ( اپنے انتقال کے وقت ) مال چھوڑے تو وہ اس کے وارثوں کا ہے اور جو قرض چھوڑے تو وہ ہمارے ذمہ ہے۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2399,
			"arabicnumber": 2399,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، انہوں نے کہا کہ ہم سے ابوعامر نے بیان کیا، ان سے فلیح نے بیان کیا، ان سے ہلال بن علی نے، ان سے عبدالرحمٰن بن ابی عمرہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ہر مومن کا میں دنیا و آخرت میں سب سے زیادہ قریب ہوں۔ اگر تم چاہو تو یہ آیت پڑھ لو «النبي أولى بالمؤمنين من أنفسهم‏» ”نبی ( صلی اللہ علیہ وسلم ) مومنوں سے ان کی جان سے بھی زیادہ قریب ہیں۔“ اس لیے جو مومن بھی انتقال کر جائے اور مال چھوڑ جائے تو چاہئے کہ ورثاء اس کے مالک ہوں۔ وہ جو بھی ہوں اور جو شخص قرض چھوڑ جائے یا اولاد چھوڑ جائے تو وہ میرے پاس آ جائیں کہ ان کا ولی میں ہوں۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2400,
			"arabicnumber": 2400,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے عبدالاعلیٰ نے بیان کیا، ان سے معمر نے، ان سے ہمام بن منبہ، وہب بن منبہ کے بھائی نے، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، مالدار کی طرف سے ( قرض کی ادائیگی میں ) ٹال مٹول کرنا ظلم ہے۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2401,
			"arabicnumber": 2401,
			"text": "ہم سے مسدد نے بیان کیا، ان سے یحییٰ نے بیان کیا، ان سے شعبہ نے، ان سے سلمہ نے، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک شخص قرض مانگنے اور سخت تقاضا کرنے لگا۔ صحابہ رضی اللہ عنہم نے اس کی گوشمالی کرنی چاہی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو، حقدار ایسی باتیں کہہ سکتا ہے۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2402,
			"arabicnumber": 2402,
			"text": "ہم سے احمد بن یونس نے بیان کیا، ان سے زہیر نے بیان کیا، انہوں نے کہا ان سے یحییٰ بن سعید نے بیان کیا، کہا کہ مجھے ابوبکر بن محمد بن عمرو بن حزم نے خبر دی۔ انہیں عمر بن عبدالعزیز نے خبر دی، انہیں ابوبکر بن عبدالرحمٰن بن حارث بن ہشام نے خبر دی، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا، آپ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یا یہ بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا، جو شخص ہو بہو اپنا مال کسی شخص کے پاس پا لے جب کہ وہ شخص دیوالیہ قرار دیا جا چکا ہو تو صاحب مال ہی اس کا دوسروں کے مقابلے میں زیادہ مستحق ہے۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2403,
			"arabicnumber": 2403,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے یزید بن زریع نے بیان کیا، ان سے حسین معلم نے بیان کیا، ان سے عطاء بن ابی رباح نے بیان کیا، اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ایک شخص نے اپنا ایک غلام اپنی موت کے ساتھ آزاد کرنے کے لیے کہا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس غلام کو مجھ سے کون خریدتا ہے؟ نعیم بن عبداللہ نے اسے خرید لیا اور آپ صلی اللہ علیہ وسلم نے اس کی قیمت ( آٹھ سو درہم ) وصول کر کے اس کے مالک کو دے دی۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2404,
			"arabicnumber": 2404,
			"text": "لیث نے بیان کیا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا، ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے کسی اسرائیلی شخص کا تذکرہ فرمایا جس نے دوسرے اسرائیلی شخص سے قرض مانگا تھا اور اس نے ایک مقررہ مدت کے لیے اسے قرض دے دیا۔ ( جس کا ذکر پہلے گزر چکا ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2406,
			"arabicnumber": 2406,
			"text": "",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2407,
			"arabicnumber": 2407,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عبداللہ بن دینار نے بیان کیا، انہوں نے عمر رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سے ایک شخص نے عرض کیا کہ خرید و فروخت میں مجھے دھوکا دے دیا جاتا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب خرید و فروخت کیا کرو، تو کہہ دیا کر کہ کوئی دھوکا نہ ہو۔ چنانچہ پھر وہ شخص اسی طرح کہا کرتا تھا۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2408,
			"arabicnumber": 2408,
			"text": "ہم سے عثمان بن ابی شبیہ نے بیان کیا، ان سے جریر نے بیان کیا، ان سے منصور نے، ان سے شعبی نے، ان سے مغیرہ بن شعبہ کے غلام وراد نے اور ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اللہ تعالیٰ نے تم پر ماں ( اور باپ ) کی نافرمانی لڑکیوں کو زندہ دفن کرنا، ( واجب حقوق کی ) ادائیگی نہ کرنا اور ( دوسروں کا مال ناجائز طریقہ پر ) دبا لینا حرام قرار دیا ہے۔ اور فضول بکواس کرنے اور کثرت سے سوال کرنے اور مال ضائع کرنے کو مکروہ قرار دیا ہے۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2409,
			"arabicnumber": 2409,
			"text": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا، کہا کہ ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا انہیں سالم بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا، تم میں سے ہر فرد ایک طرح کا حاکم ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا۔ پس بادشاہ حاکم ہی ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا۔ ہر انسان اپنے گھر کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ عورت اپنے شوہر کے گھر کی حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ خادم اپنے آقا کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ انہوں نے بیان کیا کہ یہ سب میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا۔ اور میں سمجھتا ہوں کہ نبی کریم صلی اللہ علیہ وسلم نے یہ بھی فرمایا تھا کہ مرد اپنے والد کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ پس ہر شخص حاکم ہے اور ہر شخص سے اس کی رعیت کے بارے میں سوال ہو گا۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 24
			}
		}
	]
}