{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"47": "Partnership"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2483,
			"arabicnumber": 2483,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں وہب بن کیسان نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( رجب 7 ھ میں ) ساحل بحر کی طرف ایک لشکر بھیجا۔ اور اس کا امیر ابوعبیدہ بن جراح رضی اللہ عنہ کو بنایا۔ فوجیوں کی تعداد تین سو تھی اور میں بھی ان میں شریک تھا۔ ہم نکلے اور ابھی راستے ہی میں تھے کہ توشہ ختم ہو گیا۔ ابوعبیدہ رضی اللہ عنہ نے حکم دیا کہ تمام فوجی اپنے توشے ( جو کچھ بھی باقی رہ گئے ہوں ) ایک جگہ جمع کر دیں۔ سب کچھ جمع کرنے کے بعد کھجوروں کے کل دو تھیلے ہو سکے اور روزانہ ہمیں اسی میں سے تھوڑی تھوڑی کھجور کھانے کے لیے ملنے لگی۔ جب اس کا بھی اکثر حصہ ختم ہو گیا تو ہمیں صرف ایک ایک کھجور ملتی رہی۔ میں ( وہب بن کیسان ) نے جابر رضی اللہ عنہ سے کہا بھلا ایک کھجور سے کیا ہوتا ہو گا؟ انہوں نے بتلایا کہ اس کی قدر ہمیں اس وقت معلوم ہوئی جب وہ بھی ختم ہو گئی تھی۔ انہوں نے بیان کیا کہ آخر ہم سمندر تک پہنچ گئے۔ اتفاق سے سمندر میں ہمیں ایک ایسی مچھلی مل گئی جو ( اپنے جسم میں ) پہاڑ کی طرح معلوم ہوتی تھی۔ سارا لشکر اس مچھلی کو اٹھارہ راتوں تک کھاتا رہا۔ پھر ابوعبیدہ رضی اللہ عنہ نے اس کی دونوں پسلیوں کو کھڑا کرنے کا حکم دیا۔ اس کے بعد اونٹوں کو ان کے تلے سے چلنے کا حکم دیا۔ اور وہ ان پسلیوں کے نیچے سے ہو کر گزرے، لیکن اونٹ نے ان کو چھوا تک نہیں۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2484,
			"arabicnumber": 2484,
			"text": "ہم سے بشر بن مرحوم نے بیان کیا، کہا کہ ہم سے حاتم بن اسماعیل نے بیان کیا، ان سے یزید بن ابی عبیدہ نے اور ان سے سلمہ رضی اللہ عنہ نے بیان کیا کہ ( غزوہ ہوازن میں ) لوگوں کے توشے ختم ہو گئے اور فقر و محتاجی آ گئی، تو لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ اپنے اونٹوں کو ذبح کرنے کی اجازت لینے ( تاکہ انہیں کے گوشت سے پیٹ بھر سکیں ) آپ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی۔ راستے میں عمر رضی اللہ عنہ کی ملاقات ان سے ہو گئی تو انہیں بھی ان لوگوں نے اطلاع دی۔ عمر رضی اللہ عنہ نے کہا اونٹوں کو کاٹ ڈالو گے تو پھر تم کیسے زندہ رہو گے۔ چنانچہ آپ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا، یا رسول اللہ! اگر انہوں نے اونٹ بھی ذبح کر لیے تو پھر یہ لوگ کیسے زندہ رہیں گے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا، تمام لوگوں میں اعلان کر دو کہ ان کے پاس جو کچھ توشے بچ رہے ہیں وہ لے کر یہاں آ جائیں۔ اس کے لیے ایک چمڑے کا دستر خوان بچھا دیا گیا۔ اور لوگوں نے توشے اسی دستر خوان پر لا کر رکھ دئیے۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم اٹھے اور اس میں برکت کی دعا فرمائی۔ اب آپ صلی اللہ علیہ وسلم نے پھر سب لوگوں کو اپنے اپنے برتنوں کے ساتھ بلایا اور سب نے دونوں ہاتھوں سے توشے اپنے برتنوں میں بھر لیے۔ جب سب لوگ بھر چکے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ میں اللہ کا سچا رسول ہوں۔“",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2485,
			"arabicnumber": 2485,
			"text": "ہم سے محمد بن یوسف نے بیان کیا، انہوں نے کہا کہ ہم سے اوزاعی نے بیان کیا، انہوں نے کہا کہ ہم سے ابوالنجاشی نے بیان کیا کہا کہ میں نے رافع بن خدیج رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ عصر کی نماز پڑھ کر اونٹ ذبح کرتے تو انہیں دس حصوں میں تقسیم کرتے اور پھر سورج غروب ہونے سے پہلے ہی ہم اس کا پکا ہوا گوشت بھی کھا لیتے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2486,
			"arabicnumber": 2486,
			"text": "ہم سے محمد بن علاء نے بیان کیا، کہا ہم سے حماد بن اسامہ نے بیان کیا، ان سے برید نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، قبیلہ اشعر کے لوگوں کا جب جہاد کے موقع پر توشہ کم ہو جاتا یا مدینہ ( کے قیام ) میں ان کے بال بچوں کے لیے کھانے کی کمی ہو جاتی تو جو کچھ بھی ان کے پاس توشہ ہوتا تو وہ ایک کپڑے میں جمع کر لیتے ہیں۔ پھر آپس میں ایک برتن سے برابر تقسیم کر لیتے ہیں۔ پس وہ میرے ہیں اور میں ان کا ہوں۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2487,
			"arabicnumber": 2487,
			"text": "ہم سے محمد بن عبداللہ بن مثنیٰ نے بیان کیا، انہوں نے کہا کہ مجھ سے میرے والد نے بیان نے بیان کیا، انہوں نے کہا کہ مجھ سے ثمامہ بن عبداللہ بن انس نے بیان کیا، ان سے انس رضی اللہ عنہ نے بیان کیا کہ ابوبکر رضی اللہ عنہ نے ان کے لیے فرض زکوٰۃ کا بیان تحریر کیا تھا جو رسول اللہ صلی اللہ علیہ وسلم نے مقرر کی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب کسی مال میں دو آدمی ساجھی ہوں تو وہ زکوٰۃ میں ایک دوسرے سے برابر برابر مجرا کر لیں ( یعنی زکوٰۃ کی رقم آپس میں برابر تقسیم کر لیں ) ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2488,
			"arabicnumber": 2488,
			"text": "ہم سے علی بن حکم انصاری نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے سعید بن مسروق نے، ان سے عبایہ بن رفاعہ بن رافع بن خدیج رضی اللہ عنہ نے اور ان سے ان کے دادا (رافع بن خدیج رضی اللہ عنہ) نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مقام ذوالحلیفہ میں ٹھہرے ہوئے تھے۔ لوگوں کو بھوک لگی۔ ادھر ( غنیمت میں ) اونٹ اور بکریاں ملی تھیں۔ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم لشکر کے پیچھے کے لوگوں میں تھے۔ لوگوں نے جلدی کی اور ( تقسیم سے پہلے ہی ) ذبح کر کے ہانڈیاں چڑھا دیں۔ لیکن بعد میں نبی کریم صلی اللہ علیہ وسلم نے حکم دیا اور وہ ہانڈیاں اوندھا دی گئیں۔ پھر آپ صلی اللہ علیہ وسلم نے ان کو تقسیم کیا اور دس بکریوں کو ایک اونٹ کے برابر رکھا۔ ایک اونٹ اس میں سے بھاگ گیا تو لوگ اسے پکڑنے کی کوشش کرنے لگے۔ لیکن اس نے سب کو تھکا دیا۔ قوم کے پاس گھوڑے کم تھے۔ ایک صحابی تیر لے کر اونٹ کی طرف جھپٹے۔ اللہ نے اس کو ٹھہرا دیا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان جانوروں میں بھی جنگلی جانوروں کی طرح سرکشی ہوتی ہے۔ اس لیے ان جانوروں میں سے بھی اگر کوئی تمہیں عاجز کر دے تو اس کے ساتھ تم ایسا ہی معاملہ کیا کرو۔ پھر میرے دادا نے عرض کیا کہ کل دشمن کے حملہ کا خوف ہے، ہمارے پاس چھریاں نہیں ہیں ( تلواروں سے ذبح کریں تو ان کے خراب ہونے کا ڈر ہے جب کہ جنگ سامنے ہے ) کیا ہم بانس کے کھپچی سے ذبح کر سکتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا، جو چیز بھی خون بہا دے اور ذبیحہ پر اللہ تعالیٰ کا نام لیا گیا ہو، تو اس کے کھانے میں کوئی حرج نہیں۔ سوائے دانت اور ناخن کے۔ اس کی وجہ میں تمہیں بتاتا ہوں۔ دانت تو ہڈی ہے اور ناخن حبشیوں کی چھری ہے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2489,
			"arabicnumber": 2489,
			"text": "ہم سے خلاد بن یحییٰ نے بیان کیا، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا، کہا ہم سے جبلہ بن سحیم نے بیان کیا، انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا۔ انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا تھا کہ کوئی شخص اپنے ساتھیوں کی اجازت کے بغیر ( دستر خوان پر ) دو دو کھجور ایک ساتھ ملا کر کھائے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2490,
			"arabicnumber": 2490,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے جبلہ نے بیان کیا کہ ہمارا قیام مدینہ میں تھا اور ہم پر قحط کا دور دورہ ہوا۔ عبداللہ بن زبیر رضی اللہ عنہما ہمیں کھجور کھانے کے لیے دیتے تھے اور عبداللہ بن عمر رضی اللہ عنہما گزرتے ہوئے یہ کہہ کر جایا کرتے تھے کہ دو دو کھجور ایک ساتھ ملا کر نہ کھانا کیونکہ نبی کریم صلی اللہ علیہ وسلم نے اپنے دوسرے ساتھی کی اجازت کے بغیر ایسا کرنے سے منع فرمایا ہے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2491,
			"arabicnumber": 2491,
			"text": "ہم سے عمران بن میسرہ ابوالحسن بصری نے بیان کیا، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا، کہا ہم سے ایوب سختیانی نے، کہا ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص مشترک ( ساجھے ) کے غلام میں اپنا حصہ آزاد کر دے اور اس کے پاس سارے غلام کی قیمت کے موافق مال ہو تو وہ پورا آزاد ہو جائے گا۔ اگر اتنا مال نہ ہو تو بس جتنا حصہ اس کا تھا اتنا ہی آزاد ہوا۔ ایوب نے کہا کہ یہ مجھے معلوم نہیں کہ روایت کا یہ آخری حصہ ”غلام کا وہی حصہ آزاد ہو گا جو اس نے آزاد کیا ہے“ یہ نافع کا اپنا قول ہے یا نبی کریم صلی اللہ علیہ وسلم کی حدیث میں داخل ہے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2492,
			"arabicnumber": 2492,
			"text": "ہم سے بشیر بن محمد نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو سعید بن ابی عروبہ نے خبر دی، انہیں قتادہ نے، انہیں نضر بن انس نے، انہیں بشیر بن نہیک نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص مشترک غلام میں سے اپنا حصہ آزاد کر دے تو اس کے لیے ضروری ہے کہ اپنے مال سے غلام کو پوری آزادی دلا دے۔ لیکن اگر اس کے پاس اتنا مال نہیں ہے تو انصاف کے ساتھ غلام کی قیمت لگائی جائے۔ پھر غلام سے کہا جائے کہ ( اپنی آزادی کی ) کوشش میں وہ باقی حصہ کی قیمت خود کما کر ادا کر لے۔ لیکن غلام پر اس کے لیے کوئی دباو نہ ڈالا جائے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2493,
			"arabicnumber": 2493,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا کہ ہم سے زکریا نے، کہا میں نے عامر بن شعبہ سے سنا، انہوں نے بیان کیا کہ میں نے نعمان بن بشیر رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ کی حدود پر قائم رہنے والے اور اس میں گھس جانے والے ( یعنی خلاف کرنے والے ) کی مثال ایسے لوگوں کی سی ہے جنہوں نے ایک کشتی کے سلسلے میں قرعہ ڈالا۔ جس کے نتیجہ میں بعض لوگوں کو کشتی کے اوپر کا حصہ اور بعض کو نیچے کا۔ پس جو لوگ نیچے والے تھے، انہیں ( دریا سے ) پانی لینے کے لیے اوپر والوں کے پاس سے گزرنا پڑتا۔ انہوں نے سوچا کہ کیوں نہ ہم اپنے ہی حصہ میں ایک سوراخ کر لیں تاکہ اوپر والوں کو ہم کوئی تکلیف نہ دیں۔ اب اگر اوپر والے بھی نیچے والوں کو من مانی کرنے دیں گے تو کشتی والے تمام ہلاک ہو جائیں گے اور اگر اوپر والے نیچے والوں کا ہاتھ پکڑ لیں تو یہ خود بھی بچیں گے اور ساری کشتی بھی بچ جائے گی۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "ہم سے عبدالعزیز بن عبداللہ عامری اویسی نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا، انہوں نے کہا ہم سے صالح نے، ان سے ابن شہاب نے بیان کیا، کہ مجھے عروہ بن زبیر نے خبر دی اور انہوں نے سیدہ عائشہ رضی اللہ عنہا سے پوچھا تھا (دوسری سند) اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا، ان سے ابن شہاب نے، انہیں عروہ بن زبیر نے خبر دی کہ انہوں نے عائشہ رضی اللہ عنہا سے ( سورۃ نساء میں ) اس آیت کے بارے میں پوچھا «وإن خفتم‏» سے «ورباع‏» ”اگر تم کو یتیموں میں انصاف نہ کرنے کا ڈر ہو تو جو عورتیں پسند آئیں دو دو تین تین چار چار نکاح میں لاؤ“ انہوں نے کہا میرے بھانجے یہ آیت اس یتیم لڑکی کے بارے میں ہے جو اپنے ولی ( محافظ رشتہ دار جیسے چچیرا بھائی، پھوپھی زاد یا ماموں زاد بھائی ) کی پرورش میں ہو اور ترکے کے مال میں اس کی ساجھی ہو اور وہ اس کی مالداری اور خوبصورتی پر فریفتہ ہو کر اس سے نکاح کر لینا چاہے لیکن پورا مہر انصاف سے جتنا اس کو اور جگہ ملتا وہ نہ دے، تو اسے اس سے منع کر دیا گیا کہ ایسی یتیم لڑکیوں سے نکاح کرے۔ البتہ اگر ان کے ساتھ ان کے ولی انصاف کر سکیں اور ان کی حسب حیثیت بہتر سے بہتر طرز عمل مہر کے بارے میں اختیار کریں ( تو اس صورت میں نکاح کرنے کی اجازت ہے ) اور ان سے یہ بھی کہہ دیا گیا کہ ان کے سوا جو بھی عورت انہیں پسند ہو ان سے وہ نکاح کر سکتے ہیں۔ عروہ بن زبیر نے کہا کہ عائشہ رضی اللہ عنہا نے بتلایا، پھر لوگوں نے اس آیت کے نازل ہونے کے بعد ( ایسی لڑکیوں سے نکاح کی اجازت کے بارے میں ) مسئلہ پوچھا تو اللہ تعالیٰ نے یہ آیت نازل کی «ويستفتونك في النساء‏» ”اور آپ سے عورتوں کے بارے میں یہ لوگ سوال کرتے ہیں“۔ آگے فرمایا اور تم ان سے نکاح کرنا چاہتے ہو۔ یہ جو اس آیت میں ہے اور جو قرآن میں تم پر پڑھا جاتا ہے اس سے مراد پہلی آیت ہے یعنی ”اگر تم کو یتیموں میں انصاف نہ ہو سکنے کا ڈر ہو تو دوسری عورتیں جو بھلی لگیں ان سے نکاح کر لو“۔ سیدہ عائشہ رضی اللہ عنہا نے کہا یہ جو اللہ نے دوسری آیت میں فرمایا اور تم ان سے نکاح کرنا چاہتے ہو اس سے یہ غرض ہے کہ جو یتیم لڑکی تمہاری پرورش میں ہو اور مال اور جمال کم رکھتی ہو اس سے تو تم نفرت کرتے ہو، اس لیے جس یتیم لڑکی کے مال اور جمال میں تم کو رغبت ہو اس سے بھی نکاح نہ کرو مگر اس صورت میں جب انصاف کے ساتھ ان کا پورا مہر ادا کرو۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2495,
			"arabicnumber": 2495,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم سے ہشام بن یوسف نے بیان کیا، کہا ہم کو معمر نے خبر دی، انہیں زبیری نے، انہیں ابوسلمہ نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے شفعہ کا حق ایسے اموال ( زمین جائیداد وغیرہ ) میں دیا تھا جن کی تقسیم نہ ہوئی ہو۔ لیکن جب اس کی حد بندی ہو جائے اور راستے بھی بدل دیے جائیں تو پھر شفعہ کا کوئی حق باقی نہیں رہے گا۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2496,
			"arabicnumber": 2496,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے عبدالواحد نے بیان کیا، انہوں نے کہا ہم سے معمر نے بیان کیا، ان سے زہری نے بیان کیا، ان سے ابوسلمہ نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے ہر اس جائیداد میں شفعہ کا حق دیا تھا جس کی شرکاء میں ابھی تقسیم نہ ہوئی ہو۔ لیکن اگر حد بندی ہو جائے اور راستے الگ ہو جائیں تو پھر شفعہ کا حق باقی نہیں رہتا۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2498,
			"arabicnumber": 2498,
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2499,
			"arabicnumber": 2499,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے جویریہ بن اسماء نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کی زمین یہودیوں کو اس شرط پر دے دی تھی کہ وہ اس میں محنت کریں اور بوئیں جوتیں۔ پیداوار کا آدھا حصہ انہیں ملا کرے گا۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2500,
			"arabicnumber": 2500,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے یزید بن ابی حبیب نے، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں بکریاں دی تھیں کہ قربانی کے لیے ان کو صحابہ میں تقسیم کر دیں۔ پھر ایک سال کا بکری کا بچہ بچ گیا تو انہوں نے آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے عقبہ سے فرمایا تو اس کی قربانی کر لے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2502,
			"arabicnumber": 2502,
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": 2503,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے جویریہ بن اسماء نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے کسی ساجھے کے غلام کا اپنا حصہ آزاد کر دیا تو اس کے لیے ضروری ہے کہ اگر غلام کی انصاف کے موافق قیمت کے برابر اس کے پاس مال ہو تو وہ سارا غلام آزاد کرا دے۔ اس طرح دوسرے ساجھیوں کو ان کے حصے کی قیمت ادا کر دی جائے اور اس آزاد کیے ہوئے غلام کا پیچھا چھوڑ دیا جائے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": 2504,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے جریر بن حازم نے بیان کیا، ان سے قتادہ نے، ان سے نضر بن انس نے، ان سے بشیر بن نہیک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے کسی ( ساجھے کے ) غلام کا اپنا حصہ آزاد کر دیا تو اگر اس کے پاس مال ہے تو پورا غلام آزاد ہو جائے گا۔ ورنہ باقی حصوں کو آزاد کرانے کے لیے اس سے محنت مزدوری کرائی جائے۔ لیکن اس سلسلے میں اس پر کوئی دباو نہ ڈالا جائے۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": 2506,
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا کہ ہم کو وکیع نے خبر دی، انہیں سفیان ثوری نے، انہیں ان کے والد سعید بن مسروق نے، انہیں عبایہ بن رفاعہ نے اور ان سے ان کے دادا رافع بن خدیج رضی اللہ عنہ نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تہامہ کے مقام ذوالحلیفہ میں تھے ( غنیمت میں ) ہمیں بکریاں اور اونٹ ملے تھے۔ بعض لوگوں نے جلدی کی اور ( جانور ذبح کر کے ) گوشت کو ہانڈیوں میں چڑھا دیا۔ پھر رسول اللہ صلی اللہ علیہ وسلم تشریف لائے۔ آپ صلی اللہ علیہ وسلم کے حکم سے گوشت کی ہانڈیوں کو الٹ دیا گیا۔ پھر ( آپ صلی اللہ علیہ وسلم نے تقسیم میں ) دس بکریوں کا ایک اونٹ کے برابر حصہ رکھا۔ ایک اونٹ بھاگ کھڑا ہوا۔ قوم کے پاس گھوڑوں کی کمی تھی۔ ایک شخص نے اونٹ کو تیر مار کر روک لیا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ان جانوروں میں بھی جنگی جانوروں کی طرح وحشت ہوتی ہے۔ اس لیے جب تک ان کو نہ پکڑ سکو تو تم ان کے ساتھ ہی ایسا سلوک کیا کرو۔ عبایہ نے بیان کیا کہ میرے دادا نے عرض کیا، یا رسول اللہ! ہمیں امید ہے یا خطرہ ہے کہ کہیں کل دشمن سے مڈبھیڑ نہ ہو جائے اور چھری ہمارے ساتھ نہیں ہے۔ کیا دھار دار لکڑی سے ہم ذبح کر سکتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا، لیکن ذبح کرنے میں جلدی کرو۔ جو چیز خون بہا دے ( اسی سے کاٹ ڈالو ) اگر اس پر اللہ کا نام لیا جائے تو اس کو کھاؤ اور ناخن اور دانت سے ذبح نہ کرو۔ اس کی وجہ میں بتلاتا ہوں دانت تو ہڈی ہے اور ناخن حبشیوں کی چھریاں ہیں۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 22
			}
		}
	]
}