{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"52": "Witnesses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2637,
			"arabicnumber": 2637,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے عبداللہ بن عمر نمیری نے بیان کیا، کہا ہم سے ثوبان نے بیان کیا اور لیث بن سعد نے بیان کیا کہ مجھ سے یونس نے بیان کیا، ان سے ابن شہاب نے، انہیں عروہ، ابن مسیب، علقمہ بن وقاص اور عبیداللہ نے عائشہ رضی اللہ عنہا کی حدیث کے متعلق خبر دی اور ان کی باہم ایک کی بات دوسرے کی بات کی تصدیق کرتی ہے کہ جب ان پر تہمت لگانے والوں نے تہمت لگائی تو رسول اللہ صلی اللہ علیہ وسلم نے علی اور اسامہ رضی اللہ عنہما کو اپنی بیوی ( عائشہ رضی اللہ عنہا ) کو اپنے سے جدا کرنے کے متعلق مشورہ کرنے کے لیے بلایا، کیونکہ آپ صلی اللہ علیہ وسلم پر اب تک ( اس سلسلے میں ) وحی نہیں آئی تھی۔ اسامہ رضی اللہ عنہ نے تو یہ کہا کہ آپ کی زوجہ مطہرہ ( عائشہ رضی اللہ عنہا ) میں ہم سوائے خیر کے اور کچھ نہیں جانتے۔ اور بریرہ رضی اللہ عنہا ( ان کی خادمہ ) نے کہا کہ میں کوئی ایسی چیز نہیں جانتی جس سے ان پر عیب لگایا جا سکے۔ اتنی بات ضرور ہے کہ وہ نوعمر لڑکی ہیں کہ آٹا گوندھتی اور پھر جا کے سو رہتی ہے اور بکری آ کر اسے کھا لیتی ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے ( تہمت کے جھوٹ ثابت ہونے کے بعد ) فرمایا کہ ایسے شخص کی طرف سے کون عذر خواہی کرے گا جو میری بیوی کے بارے میں بھی مجھے اذیت پہنچاتا ہے۔ قسم اللہ کی! میں نے اپنے گھر میں خیر کے سوا اور کچھ نہیں دیکھا اور لوگ ایسے شخص کا نام لیتے ہیں جس کے متعلق بھی مجھے خیر کے سوا اور کچھ معلوم نہیں۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی زہری سے کہ سالم نے بیان کیا، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، آپ کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم ابی بن کعب انصاری رضی اللہ عنہ کو ساتھ لے کر کھجور کے اس باغ کی طرف تشریف لے گئے جس میں ابن صیاد تھا۔ جب رسول اللہ صلی اللہ علیہ وسلم باغ میں داخل ہوئے تو آپ صلی اللہ علیہ وسلم درختوں کی آڑ میں چھپ کر چلنے لگے۔ آپ صلی اللہ علیہ وسلم چاہتے تھے کہ ابن صیاد آپ کو دیکھنے نہ پائے اور اس سے پہلے آپ اس کی باتیں سن سکیں۔ ابن صیاد ایک روئیں دار چادر میں زمین پر لیٹا ہوا تھا اور کچھ گنگنا رہا تھا۔ ابن صیاد کی ماں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھ لیا کہ آپ صلی اللہ علیہ وسلم درخت کی آڑ لیے چلے آ رہے ہیں تو وہ کہنے لگی اے صاف! یہ محمد ( صلی اللہ علیہ وسلم ) آ رہے ہیں۔ ابن صیاد ہوشیار ہو گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اگر اسے اپنے حال پر رہنے دیتی تو بات ظاہر ہو جاتی۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2639,
			"arabicnumber": 2639,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے سفیان نے بیان کیا زہری سے اور ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ رفاعہ قرظی رضی اللہ عنہ کی بیوی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا کہ میں رفاعہ کی نکاح میں تھی۔ پھر مجھے انہوں نے طلاق دے دی اور قطعی طلاق دے دی۔ پھر میں نے عبدالرحمٰن بن زبیر رضی اللہ عنہ سے شادی کر لی۔ لیکن ان کے پاس تو ( شرمگاہ ) اس کپڑے کی گانٹھ کی طرح ہے۔ آپ صلی اللہ علیہ وسلم نے دریافت کیا ”کیا تو رفاعہ کے پاس دوبارہ جانا چاہتی ہے لیکن تو اس وقت تک ان سے اب شادی نہیں کر سکتی جب تک تو عبدالرحمٰن بن زبیر کا مزا نہ چکھ لے اور وہ تمہارا مزا نہ چکھ لیں۔“ اس وقت ابوبکر رضی اللہ عنہ خدمت نبوی میں موجود تھے اور خالد بن سعید بن عاص رضی اللہ عنہ دروازے پر اپنے لیے ( اندر آنے کی ) اجازت کا انتظار کر رہے تھے۔ انہوں نے کہا، ابوبکر! کیا اس عورت کو نہیں دیکھتے نبی کریم صلی اللہ علیہ وسلم کے سامنے کس طرح کی باتیں زور زور سے کہہ رہی ہے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2640,
			"arabicnumber": 2640,
			"text": "ہم سے حبان نے بیان کیا، کہا کہ ہم کو عبداللہ نے خبر دی، کہا ہم کو عمر بن سعید بن ابی حسین نے خبر دی، کہا کہ مجھے عبداللہ بن ابی ملیکہ نے خبر دی اور انہیں عقبہ بن حارث رضی اللہ عنہ نے کہ انہوں نے ابواہاب بن عزیز کی لڑکی سے شادی کی تھی۔ ایک خاتون آئیں اور کہنے لگیں کہ عقبہ کو بھی میں نے دودھ پلایا ہے اور اسے بھی جس سے اس نے شادی کی ہے۔ عقبہ رضی اللہ عنہ نے کہا کہ مجھے تو معلوم نہیں کہ آپ نے مجھے دودھ پلایا ہے اور آپ نے مجھے پہلے اس سلسلے میں کچھ بتایا بھی نہیں تھا۔ پھر انہوں نے آل ابواہاب کے یہاں آدمی بھیجا کہ ان سے اس کے متعلق پوچھے۔ انہوں نے بھی یہی جواب دیا کہ ہمیں معلوم نہیں کہ انہوں نے دودھ پلایا ہے۔ عقبہ رضی اللہ عنہ اب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں مدینہ حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے مسئلہ پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا، اب کیا ہو سکتا ہے جب کہ کہا جا چکا۔ چنانچہ آپ صلی اللہ علیہ وسلم نے دونوں میں جدائی کرا دی اور اس کا نکاح دوسرے شخص سے کرا دیا۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2641,
			"arabicnumber": 2641,
			"text": "ہم سے حکم بن نافع نے بیان کیا، کہا ہم کو شعیب نے خبر دی زہری سے، کہا کہ مجھ سے حمید بن عبدالرحمٰن بن عوف نے بیان کیا، ان سے عبداللہ بن عتبہ نے اور انہوں نے عمر بن خطاب رضی اللہ عنہ سے سنا۔ آپ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں لوگوں کا وحی کے ذریعہ مواخذہ ہو جاتا تھا۔ لیکن اب وحی کا سلسلہ ختم ہو گیا اور ہم صرف انہیں امور میں مواخذہ کریں گے جو تمہارے عمل سے ہمارے سامنے ظاہر ہوں گے۔ اس لیے جو کوئی ظاہر میں ہمارے سامنے خیر کرے گا، ہم اسے امن دیں گے اور اپنے قریب رکھیں گے۔ اس کے باطن سے ہمیں کوئی سروکار نہ ہو گا۔ اس کا حساب تو اللہ تعالیٰ کرے گا اور جو کوئی ہمارے سامنے ظاہر میں برائی کرے گا تو ہم بھی اسے امن نہیں دیں گے اور نہ ہم اس کی تصدیق کریں گے خواہ وہ یہی کہتا رہے کہ اس کا باطن اچھا ہے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2642,
			"arabicnumber": 2642,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا ثابت سے اور ان سے انس رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس سے ایک جنازہ گزرا تو لوگوں نے اس میت کی تعریف کی، آپ صلی اللہ علیہ وسلم نے فرمایا ”واجب ہو گئی“ پھر دوسرا جنازہ گزرا تو لوگوں نے اس کی برائی کی، یا اس کے سوا اور الفاظ ( اسی مفہوم کو ادا کرنے کے لیے ) کہے ( راوی کو شبہ ہے ) آپ صلی اللہ علیہ وسلم نے اس پر بھی فرمایا ”واجب ہو گئی“ عرض کیا گیا۔ یا رسول اللہ! آپ نے اس جنازہ کے متعلق بھی فرمایا کہ واجب ہو گئی اور پہلے جنازہ پر بھی یہی فرمایا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”ایمان والی قوم کی گواہی ( بارگاہ الٰہی میں مقبول ہے ) یہ لوگ زمین پر اللہ کے گواہ ہیں۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2643,
			"arabicnumber": 2643,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے داؤد بن ابی فرات نے بیان کیا، کہا ہم سے عبداللہ بن بریدہ نے بیان کیا ابی الاسود سے کہ میں مدینہ آیا تو یہاں وبا پھیلی ہوئی تھی، لوگ بڑی تیزی سے مر رہے تھے۔ میں عمر رضی اللہ عنہ کی خدمت میں تھا کہ ایک جنازہ گزرا۔ لوگوں نے اس میت کی تعریف کی تو عمر رضی اللہ عنہ نے کہا کہ واجب ہو گئی۔ پھر دوسرا گزار لوگوں نے اس کی بھی تعریف کی عمر رضی اللہ عنہ نے کہا واجب ہو گئی۔ پھر تیسرا گزرا تو لوگوں نے اس کی برائی کی، عمر رضی اللہ عنہ نے اس کے لیے یہی کہا کہ واجب ہو گئی۔ میں نے پوچھا امیرالمؤمنین! کیا واجب ہو گئی۔ انہوں نے کہا کہ میں نے اسی طرح کہا ہے جس طرح نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ جس مسلمان کے لیے چار آدمی اچھائی کی گواہی دے دیں اسے اللہ تعالیٰ جنت میں داخل کرتا ہے۔ ہم نے آپ صلی اللہ علیہ وسلم سے پوچھا اور اگر تین دیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تین پر بھی۔ ہم نے پوچھا اور اگر دو آدمی گواہی دیں؟ فرمایا دو پر بھی۔ پھر ہم نے ایک کے متعلق آپ صلی اللہ علیہ وسلم سے نہیں پوچھا۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2644,
			"arabicnumber": 2644,
			"text": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم کو حکم نے خبر دی، انہیں عراک بن مالک نے، انہیں عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ( پردہ کا حکم نازل ہونے کے بعد ) افلح رضی اللہ عنہ نے مجھ سے ( گھر میں آنے کی ) اجازت چاہی تو میں نے ان کو اجازت نہیں دی۔ وہ بولے کہ آپ مجھ سے پردہ کرتی ہیں حالانکہ میں آپ کا ( دودھ ) کا چچا ہوں۔ میں نے کہا کہ یہ کیسے؟ تو انہوں نے بتایا کہ میرے بھائی ( وائل ) کی عورت نے آپ کو میرے بھائی کا ہی دودھ پلایا تھا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر میں نے اس کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ افلح نے سچ کہا ہے۔ انہیں ( اندر آنے کی ) اجازت دے دیا کرو ( ان سے پردہ نہیں ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2645,
			"arabicnumber": 2645,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ہمام نے بیان کیا، کہا ہم سے قتادہ نے بیان کیا جابر بن زید سے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے حمزہ رضی اللہ عنہ کی صاحبزادی کے متعلق فرمایا ”یہ میرے لیے حلال نہیں ہو سکتیں، جو رشتے نسب کی وجہ سے حرام ہو جاتے ہیں، وہی دودھ کی وجہ سے بھی حرام ہو جاتے ہیں۔ یہ تو میرے رضاعی بھائی کی لڑکی ہے۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2646,
			"arabicnumber": 2646,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک نے خبر دی عبداللہ بن ابی بکر سے، وہ عمرہ بنت عبدالرحمٰن سے اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم ان کے یہاں تشریف فرما تھے۔ عائشہ صدیقہ رضی اللہ عنہا نے ایک صحابی کی آواز سنی جو ( ام المؤمنین ) حفصہ رضی اللہ عنہا کے گھر میں آنے کی اجازت چاہتا تھا۔ عائشہ رضی اللہ عنہا نے کہا کہ میں نے کہا، یا رسول اللہ! میرا خیال ہے یہ حفصہ رضی اللہ عنہا کے رضاعی چچا ہیں۔ انہوں نے عرض کیا، یا رسول اللہ! یہ صحابی آپ کے گھر میں ( جس میں حفصہ رضی اللہ عنہا رہتی ہیں ) آنے کی اجازت مانگ رہے ہیں۔ انہوں نے بیان کیا کہ آپ نے فرمایا، میرا خیال ہے یہ فلاں صاحب، حفصہ کے رضاعی چچا ہیں۔ پھر عائشہ رضی اللہ عنہا نے بھی اپنے ایک رضاعی چچا کے متعلق پوچھا کہ اگر فلاں زندہ ہوتے تو کیا وہ بے حجاب میرے پاس آ سکتے تھے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”ہاں! دودھ سے بھی وہ تمام رشتے حرام ہو جاتے ہیں جو نسب کی وجہ سے حرام ہوتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2647,
			"arabicnumber": 2647,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان نے خبر دی، انہیں اشعث بن ابوشعثاء نے، انہیں ان کے والد نے، انہیں مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ( گھر میں ) تشریف لائے تو میرے یہاں ایک صاحب ( ان کے رضاعی بھائی ) بیٹھے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا، عائشہ! یہ کون ہے؟ میں نے عرض کیا کہ یہ میرا رضاعی بھائی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا عائشہ! ذرا دیکھ بھال کر لو، کون تمہارا رضاعی بھائی ہے۔ کیونکہ رضاعت وہی معتبر ہے جو کم سنی میں ہو۔ محمد بن کثیر کے ساتھ اس حدیث کو عبدالرحمٰن بن مہدی نے سفیان ثوری سے روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2648,
			"arabicnumber": 2648,
			"text": "ہم سے اسماعیل نے بیان کیا، کہا مجھ سے عبداللہ بن وہب نے بیان کیا اور ان سے یونس نے اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا اور ان سے ابن شہاب نے، انہیں عروہ بن زبیر نے خبر دی کہ ایک عورت نے فتح مکہ پر چوری کر لی تھی۔ پھر اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر کیا گیا اور آپ صلی اللہ علیہ وسلم کے حکم کے مطابق اس کا ہاتھ کاٹ دیا گیا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر انہوں نے اچھی طرح توبہ کر لی اور شادی کر لی۔ اس کے بعد وہ آتی تھیں تو میں ان کی ضرورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پیش کر دیا کرتی تھی۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2649,
			"arabicnumber": 2649,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا عقیل سے، وہ ابن شہاب سے، ان سے عبیداللہ بن عبداللہ نے اور ان سے زید بن خالد رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان لوگوں کے لیے جو شادی شدہ نہ ہوں اور زنا کریں۔ یہ حکم دیا تھا کہ انہیں سو کوڑے لگائے جائیں اور ایک سال کے لیے جلا وطن کر دیا جائے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2650,
			"arabicnumber": 2650,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو ابوحیان تیمی (یحییٰ بن سعید) نے، انہیں شعبی نے، اور ان سے نعمان بن بشیر رضی اللہ عنہما نے بیان کیا کہ میری ماں نے میرے باپ سے مجھے ایک چیز ہبہ دینے کے لیے کہا ( پہلے تو انہوں نے انکار کیا کیونکہ دوسری بیوی کے بھی اولاد تھی ) پھر راضی ہو گئے اور مجھے وہ چیز ہبہ کر دی۔ لیکن ماں نے کہا کہ جب تک آپ نبی کریم صلی اللہ علیہ وسلم کو اس معاملہ میں گواہ نہ بنائیں میں اس پر راضی نہ ہوں گی۔ چنانچہ والد میرا ہاتھ پکڑ کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ میں ابھی نوعمر تھا۔ انہوں نے عرض کیا کہ اس لڑکے کی ماں عمرہ بنت رواحہ رضی اللہ عنہا مجھ سے ایک چیز اسے ہبہ کرنے کے لیے کہہ رہی ہیں۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا اس کے علاوہ اور بھی تمہارے لڑکے ہیں؟ انہوں نے کہا ہاں، ہیں۔ نعمان رضی اللہ عنہ! نے بیان کیا، میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا ”تو مجھ کو ظلم کی بات پر گواہ نہ بنا۔“ اور ابوحریز نے شعبی سے یہ نقل کیا کہ آپ صلی اللہ علیہ وسلم نے فرمایا ”میں ظلم کی بات پر گواہ نہیں بنتا۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2651,
			"arabicnumber": 2651,
			"text": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے ابوحمزہ نے بیان کیا کہ میں نے زہدم بن مضرب رضی اللہ عنہ سے سنا کہ میں نے عمران بن حصین رضی اللہ عنہما سے سنا اور انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سب سے بہتر میرے زمانہ کے لوگ ( صحابہ ) ہیں۔ پھر وہ لوگ جو ان کے بعد آئیں گے ( تابعین ) پھر وہ لوگ جو اس کے بھی بعد آئیں گے۔ ( تبع تابعین ) عمران نے بیان کیا کہ میں نہیں جانتا آپ صلی اللہ علیہ وسلم نے دو زمانوں کا ( اپنے بعد ) ذکر فرمایا یا تین کا پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے بعد ایسے لوگ پیدا ہوں گے جو چور ہوں گے، جن میں دیانت کا نام نہ ہو گا۔ ان سے گواہی دینے کے لیے نہیں کہا جائے گا۔ لیکن وہ گواہیاں دیتے پھریں گے۔ نذریں مانیں گے لیکن پوری نہیں کریں گے۔ مٹاپا ان میں عام ہو گا۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2652,
			"arabicnumber": 2652,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان نے خبر دی منصور سے، انہوں نے ابراہیم نخعی سے، انہیں عبیدہ نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”سب سے بہتر میرے زمانہ کے لوگ ہیں، پھر وہ لوگ جو اس کے بعد ہوں گے، پھر وہ لوگ جو اس کے بعد ہوں گے اور اس کے بعد ایسے لوگوں کا زمانہ آئے گا جو قسم سے پہلے گواہی دیں گے اور گواہی سے پہلے قسم کھائیں گے۔“ ابراہیم نخعی رحمہ اللہ نے بیان کیا کہ ہمارے بڑے بزرگ شہادت اور عہد کا لفظ زبان سے نکالنے پر ہمیں مارتے تھے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2653,
			"arabicnumber": 2653,
			"text": "ہم سے عبداللہ بن منیر نے بیان کیا، کہا ہم نے وہب بن جریر اور عبدالملک بن ابراہیم سے سنا، انہوں نے بیان کیا کہ ہم سے شعبہ نے بیان کیا، ان سے عبداللہ بن ابی بکر بن انس نے اور ن سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم سے کبیرہ گناہوں کے متعلق پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا ”اللہ کے ساتھ کسی کو شریک ٹھہرانا، ماں باپ کی نافرمانی کرنا، کسی کی جان لینا اور جھوٹی گواہی دینا۔“ اس روایت کی متابعت غندر، ابوعامر، بہز اور عبدالصمد نے شعبہ سے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2654,
			"arabicnumber": 2654,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے بشر بن مفضل نے بیان کیا، کہا ہم سے جریر نے بیان کیا ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے باپ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں تم لوگوں کو سب سے بڑے گناہ نہ بتاؤں؟ تین بار آپ صلی اللہ علیہ وسلم نے اسی طرح فرمایا۔ صحابہ نے عرض کیا، ہاں یا رسول! آپ صلی اللہ علیہ وسلم نے فرمایا، اللہ کا کسی کو شریک ٹھہرانا، ماں باپ کی نافرمانی کرنا، آپ صلی اللہ علیہ وسلم اس وقت تک ٹیک لگائے ہوئے تھے لیکن اب آپ صلی اللہ علیہ وسلم سیدھے بیٹھ گئے اور فرمایا، ہاں اور جھوٹی گواہی بھی۔ انہوں نے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے اس جملے کو اتنی مرتبہ دہرایا کہ ہم کہنے لگے کاش! آپ صلی اللہ علیہ وسلم خاموش ہو جاتے۔ اسماعیل بن ابراہیم نے بیان کیا، ان سے جریری نے بیان کیا، اور ان سے عبدالرحمٰن نے بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2655,
			"arabicnumber": 2655,
			"text": "ہم سے محمد بن عبید بن میمون نے بیان کیا، کہا ہم کو عیسیٰ بن یونس نے خبر دی، انہیں ہشام نے، انہیں ان کے باپ نے، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک شخص کو مسجد میں قرآن پڑھتے سنا تو فرمایا کہ ان پر اللہ تعالیٰ رحم فرمائے مجھے انہوں نے اس وقت فلاں اور فلاں آیتیں یاد دلا دیں جنہیں میں فلاں فلاں سورتوں میں سے بھول گیا تھا۔ عباد بن عبداللہ رضی اللہ عنہما نے اپنی روایت میں عائشہ رضی اللہ عنہا سے یہ الفاظ زیادہ بیان کیے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے میرے گھر میں تہجد کی نماز پڑھی۔ اس وقت آپ صلی اللہ علیہ وسلم نے عباد رضی اللہ عنہ کی آواز سنی کہ وہ مسجد میں نماز پڑھ رہے ہیں۔ آپ نے پوچھا عائشہ! کیا یہ عباد کی آواز ہے؟ میں نے کہا جی ہاں! آپ نے فرمایا، اے اللہ! عباد پر رحم فرما۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2656,
			"arabicnumber": 2656,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا، کہا ہم کو ابن شہاب نے خبر دی سالم بن عبداللہ سے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”بلال رضی اللہ عنہ رات میں اذان دیتے ہیں۔ اس لیے تم لوگ سحری کھا پی سکتے ہو یہاں تک کہ ( فجر کے لیے ) دوسری اذان پکاری جائے۔“ یا ( یہ فرمایا ) یہاں تک کہ ”عبداللہ ابن ام مکتوم رضی اللہ عنہ کی اذان سن لو۔“ عبداللہ ابن ام مکتوم رضی اللہ عنہ نابینا تھے اور جب تک ان سے کہا نہ جاتا صبح ہو گئی ہے، وہ اذان نہیں دیتے تھے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2657,
			"arabicnumber": 2657,
			"text": "ہم سے زیاد بن یحییٰ نے بیان کیا، کہا ہم سے حاتم بن وردان نے بیان کیا، کہا ہم سے ایوب نے بیان کیا، عبداللہ بن ابی ملیکہ سے اور ان سے مسور بن مخرمہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے ہاں چند قبائیں آئیں تو مجھ سے میرے باپ مخرمہ رضی اللہ عنہ نے کہا کہ میرے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں چلو۔ ممکن ہے آپ صلی اللہ علیہ وسلم ان میں سے کوئی مجھے بھی عنایت فرمائیں۔ میرے والد ( نبی کریم صلی اللہ علیہ وسلم کے گھر پہنچ کر ) دروازے پر کھڑے ہو گئے اور باتیں کرنے لگے۔ آپ صلی اللہ علیہ وسلم نے ان کی آواز پہچان لی اور باہر تشریف لائے، آپ صلی اللہ علیہ وسلم کے پاس ایک قباء بھی تھی، آپ صلی اللہ علیہ وسلم اس کی خوبیاں بیان کرنے لگے، اور فرمایا ”میں نے یہ تمہارے ہی لیے الگ کر رکھی تھی، میں نے یہ تمہارے ہی لیے الگ کر رکھی تھی۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2658,
			"arabicnumber": 2658,
			"text": "ہم سے ابن ابی مریم نے بیان کیا، انہوں نے کہا ہم کو محمد بن جعفر نے خبر دی، انہوں نے کہا کہ مجھے زید نے خبر دی، انہیں عیاض بن عبداللہ نے اور انہیں ابو سعید خدری رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کیا عورت کی گواہی مرد کی گواہی کے آدھے کے برابر نہیں ہے؟“ ہم نے عرض کیا کیوں نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”یہی تو ان کی عقل کا نقصان ہے۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2659,
			"arabicnumber": 2659,
			"text": "ہم سے ابوعاصم نے بیان کیا، کہا ہم سے ابن جریج نے، وہ ابن بی ملیکہ سے، ان سے عقبہ بن حارث رضی اللہ عنہ نے (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے ابن جریج نے بیان کیا کہ میں نے ابن ابی ملیکہ سے سنا، کہا کہ مجھ سے عقبہ بن حارث رضی اللہ عنہ نے بیان کیا، یا (یہ کہا کہ) میں نے یہ حدیث ان سے سنی کہ انہوں نے ام یحیی بنت ابی اہاب سے شادی کی تھی۔ انہوں نے بیان کیا کہ پھر ایک سیاہ رنگ والی باندی آئی اور کہنے لگی کہ میں نے تم دونوں کو دودھ پلایا ہے۔ میں نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا، تو آپ صلی اللہ علیہ وسلم نے میری طرف سے منہ پھیر لیا پس میں جدا ہو گیا۔ میں نے پھر آپ صلی اللہ علیہ وسلم کے سامنے جا کر اس کا ذکر کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا، اب ( نکاح ) کیسے ( باقی رہ سکتا ہے ) جبکہ تمہیں اس عورت نے بتا دیا ہے کہ اس نے تم دونوں کو دودھ پلایا تھا۔ چنانچہ آپ صلی اللہ علیہ وسلم نے انہیں ام یحییٰ کو اپنے ساتھ رکھنے سے منع فرما دیا۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2660,
			"arabicnumber": 2660,
			"text": "ہم سے ابوعاصم نے بیان کیا عمر بن سعید سے، وہ ابن ابی ملیکہ سے، ان سے عقبہ بن حارث رضی اللہ عنہ نے بیان کیا کہ میں نے ایک عورت سے شادی کی تھی۔ پھر ایک عورت آئی اور کہنے لگی کہ میں نے تم دونوں کو دودھ پلایا تھا۔ اس لیے میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”جب تمہیں بتا دیا گیا ( کہ ایک ہی عورت تم دونوں کی دودھ کی ماں ہے ) تو پھر اب اور کیا صورت ہو سکتی ہے اپنی بیوی کو اپنے سے جدا کر دے۔“ یا اسی طرح کے الفاظ آپ صلی اللہ علیہ وسلم نے فرمائے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2661,
			"arabicnumber": 2661,
			"text": "ہم سے ابوربیع، سلیمان بن داؤد نے بیان کیا، امام بخاری رحمہ اللہ نے کہا کہ اس حدیث کے بعض مطالب مجھ کو امام احمد بن یونس نے سمجھائے، کہا ہم سے فلیح بن سلیمان نے بیان کیا، ان سے ابن شہاب زہری نے بیان کیا، ان سے عروہ بن زبیر، سعید بن مسیب، علقمہ بن وقاص لیثی اور عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے وہ قصہ بیان کیا جب تہمت لگانے والوں نے ان پر پر تہمت لگائی لیکن اللہ تعالیٰ نے خود انہیں اس سے بری قرار دیا۔ زہری نے بیان کیا ( کہ زہری سے بیان کرنے والے، جن کا سند میں زہری کے بعد ذکر ہے ) تمام راویوں نے عائشہ رضی اللہ عنہا کی اس حدیث کا ایک ایک حصہ بیان کیا تھا، بعض راویوں کو بعض دوسرے راویوں سے حدیث زیادہ یاد تھی اور وہ بیان بھی زیادہ بہتر طریقہ پر کر سکتے تھے۔ بہرحال ان سب راویوں سے میں نے یہ حدیث پوری طرح محفوظ کر لی تھی جسے وہ عائشہ رضی اللہ عنہا سے بیان کرتے تھے۔ ان راویوں میں ہر ایک کی روایت سے دوسرے راوی کی تصدیق ہوتی تھی۔ ان کا بیان تھا کہ عائشہ رضی اللہ عنہا نے کہا رسول اللہ صلی اللہ علیہ وسلم جب سفر میں جانے کا ارادہ کرتے تو اپنی بیویوں کے درمیان قرعہ ڈالتے۔ جس کے نام کا قرعہ نکلتا، سفر میں وہی آپ صلی اللہ علیہ وسلم کے ساتھ جاتی۔ چنانچہ ایک غزوہ کے موقع پر، جس میں آپ صلی اللہ علیہ وسلم بھی شرکت کر رہے تھے، آپ صلی اللہ علیہ وسلم نے قرعہ ڈلوایا اور میرا نام نکلا۔ اب میں آپ صلی اللہ علیہ وسلم کے ساتھ تھی۔ یہ واقعہ پردے کی آیت کے نازل ہونے کے بعد کا ہے۔ خیر میں ایک ہودج میں سوار رہتی تھی، اسی میں بیٹھے بیٹھے مجھ کو اتارا جاتا تھا۔ اس طرح ہم چلتے رہے۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم جہاد سے فارغ ہو کر واپس ہوئے اور ہم مدینہ کے قریب پہنچ گئے تو ایک رات آپ نے کوچ کا حکم دیا۔ میں یہ حکم سنتے ہی اٹھی اور لشکر سے آگے بڑھ گئی۔ جب حاجت سے فارغ ہوئی تو کجاوے کے پاس آ گئی۔ وہاں پہنچ کر جو میں نے اپنا سینہ ٹٹولا تو میرا ظفار کے کالے نگینوں کا ہار موجود نہیں تھا۔ اس لیے میں وہاں دوبارہ پہنچی ( جہاں قضائے حاجت کے لیے گئی تھی ) اور میں نے ہار کو تلاش کیا۔ اس تلاش میں دیر ہو گئی۔ اس عرصے میں وہ اصحاب جو مجھے سوار کراتے تھے، آئے اور میرا ہودج اٹھا کر میرے اونٹ پر رکھ دیا۔ وہ یہی سمجھے کہ میں اس میں بیٹھی ہوں۔ ان دنوں عورتیں ہلکی پھلکی ہوتی تھیں، بھاری بھر کم نہیں۔ گوشت ان میں زیادہ نہیں رہتا تھا کیونکہ بہت معمولی غذا کھاتی تھیں۔ اس لیے ان لوگوں نے جب ہودج کو اٹھایا تو انہیں اس کے بوجھ میں کوئی فرق معلوم نہیں ہوا۔ میں یوں بھی نوعمر لڑکی تھی۔ چنانچہ اصحاب نے اونٹ کو ہانک دیا اور خود بھی اس کے ساتھ چلنے لگے۔ جب لشکر روانہ ہو چکا تو مجھے اپنا ہار ملا اور میں پڑاؤ کی جگہ آئی۔ لیکن وہاں کوئی آدمی موجود نہ تھا۔ اس لیے میں اس جگہ گئی جہاں پہلے میرا قیام تھا۔ میرا خیال تھا کہ جب وہ لوگ مجھے نہیں پائیں گے تو یہیں لوٹ کے آئیں گے۔ ( اپنی جگہ پہنچ کر ) میں یوں ہی بیٹھی ہوئی تھی کہ میری آنکھ لگ گئی اور میں سو گئی۔ صفوان بن معطل رضی اللہ عنہ جو پہلے سلمی تھے پھر ذکوانی ہو گئے لشکر کے پیچھے تھے ( جو لشکریوں کی گری پڑی چیزوں کو اٹھا کر انہیں اس کے مالک تک پہنچانے کی خدمت کے لیے مقرر تھے ) وہ میری طرف سے گزرے تو ایک سوئے ہوئے انسان کا سایہ نظر پڑا اس لیے اور قریب پہنچے۔ پردہ کے حکم سے پہلے وہ مجھے دیکھ چکے تھے۔ ان کے «إنا لله» پڑھنے سے میں بیدار ہو گئی۔ آخر انہوں نے اپنا اونٹ بٹھایا اور اس کے اگلے پاؤں کو موڑ دیا ( تاکہ بلا کسی مدد کے میں خود سوار ہو سکوں ) چنانچہ میں سوار ہو گئی، اب وہ اونٹ پر مجھے بٹھائے ہوئے خود اس کے آگے آگے چلنے لگے۔ اسی طرح ہم جب لشکر کے قریب پہنچے تو لوگ بھری دوپہر میں آرام کے لیے پڑاؤ ڈال چکے تھے۔ ( اتنی ہی بات تھی جس کی بنیاد پر ) جسے ہلاک ہونا تھا وہ ہلاک ہوا اور تہمت کے معاملے میں پیش پیش عبداللہ بن ابی ابن سلول ( منافق ) تھا۔ پھر ہم مدینہ میں آ گئے اور میں ایک مہینے تک بیمار رہی۔ تہمت لگانے والوں کی باتوں کا خوب چرچا ہو رہا تھا۔ اپنی اس بیماری کے دوران مجھے اس سے بھی بڑا شبہ ہوتا تھا کہ ان دنوں رسول اللہ صلی اللہ علیہ وسلم کا وہ لطف و کرم بھی میں نہیں دیکھتی تھی جن کا مشاہدہ اپنی پچھلی بیماریوں میں کر چکی تھی۔ پس آپ صلی اللہ علیہ وسلم گھر میں جب آتے تو سلام کرتے اور صرف اتنا دریافت فرما لیتے، مزاج کیسا ہے؟ جو باتیں تہمت لگانے والے پھیلا رہے تھے ان میں سے کوئی بات مجھے معلوم نہیں تھی۔ جب میری صحت کچھ ٹھیک ہوئی تو ( ایک رات ) میں ام مسطح کے ساتھ مناصع کی طرف گئی۔ یہ ہماری قضائے حاجت کی جگہ تھی، ہم یہاں صرف رات ہی میں آتے تھے۔ یہ اس زمانہ کی بات ہے جب ابھی ہمارے گھروں کے قریب بیت الخلاء نہیں بنے تھے۔ میدان میں جانے کے سلسلے میں ( قضائے حاجت کے لیے ) ہمارا طرز عمل قدیم عرب کی طرح تھا، میں اور ام مسطح بنت ابی رہم چل رہی تھی کہ وہ اپنی چادر میں الجھ کر گر پڑیں اور ان کی زبان سے نکل گیا، مسطح برباد ہو۔ میں نے کہا، بری بات آپ نے اپنی زبان سے نکالی، ایسے شخص کو برا کہہ رہی ہیں آپ، جو بدر کی لڑائی میں شریک تھا، وہ کہنے لگیں، اے بھولی بھالی! جو کچھ ان سب نے کہا ہے وہ آپ نے نہیں سنا، پھر انہوں نے تہمت لگانے والوں کی ساری باتیں سنائیں اور ان باتوں کو سن کر میری بیماری اور بڑھ گئی۔ میں جب اپنے گھر واپس ہوئی تو رسول اللہ صلی اللہ علیہ وسلم اندر تشریف لائے اور دریافت فرمایا، مزاج کیسا ہے؟ میں نے عرض کیا کہ آپ مجھے والدین کے یہاں جانے کی اجازت دیجئیے۔ اس وقت میرا ارادہ یہ تھا کہ ان سے اس خبر کی تحقیق کروں گی۔ آپ صلی اللہ علیہ وسلم نے مجھے جانے کی اجازت دے دی اور میں جب گھر آئی تو میں نے اپنی والدہ ( ام رومان ) سے ان باتوں کے متعلق پوچھا، جو لوگوں میں پھیلی ہوئی تھیں۔ انہوں نے فرمایا، بیٹی! اس طرح کی باتوں کی پرواہ نہ کر، اللہ کی قسم! شاید ہی ایسا ہو کہ تجھ جیسی حسین و خوبصورت عورت کسی مرد کے گھر میں ہو اور اس کی سوکنیں بھی ہوں، پھر بھی اس طرح کی باتیں نہ پھیلائی جایا کریں۔ میں نے کہا سبحان اللہ! ( سوکنوں کا کیا ذکر ) وہ تو دوسرے لوگ اس طرح کی باتیں کر رہے ہیں۔ انہوں نے بیان کیا کہ وہ رات میں نے وہیں گزاری، صبح تک میرے آنسو نہیں تھمتے تھے اور نہ نیند آئی۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیوی کو جدا کرنے کے سلسلے میں مشورہ کرنے کے لیے علی ابن ابی طالب اور اسامہ بن زید رضی اللہ عنہم کو بلوایا۔ کیونکہ وحی ( اس سلسلے میں ) اب تک نہیں آئی تھی۔ اسامہ رضی اللہ عنہ کو آپ کی بیویوں سے آپ کی محبت کا علم تھا۔ اس لیے اسی کے مطابق مشورہ دیا اور کہا، آپ کی بیوی، یا رسول اللہ! واللہ، ہم ان کے متعلق خیر کے سوا اور کچھ نہیں جانتے۔ علی رضی اللہ عنہ نے کہا یا رسول اللہ! اللہ تعالیٰ نے آپ پر کوئی تنگی نہیں کی ہے، عورتیں ان کے سوا بھی بہت ہیں، باندی سے بھی آپ دریافت فرما لیجئے، وہ سچی بات بیان کریں گی۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے بریرہ رضی اللہ عنہا کو بلایا ( جو عائشہ رضی اللہ عنہا کی خاص خادمہ تھی ) اور دریافت فرمایا، بریرہ! کیا تم نے عائشہ میں کوئی ایسی چیز دیکھی ہے جس سے تمہیں شبہ ہوا ہو۔ بریرہ رضی اللہ عنہا نے عرض کیا، نہیں، اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث فرمایا ہے۔ میں نے ان میں کوئی ایسی چیز نہیں دیکھی جس کا عیب میں ان پر لگا سکوں۔ اتنی بات ضرور ہے کہ وہ نوعمر لڑکی ہیں۔ آٹا گوندھ کر سو جاتی ہیں پھر بکری آتی ہے اور کھا لیتی ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے اسی دن ( منبر پر ) کھڑے ہو کر عبداللہ بن ابی ابن سلول کے بارے میں مدد چاہی۔ آپ صلی اللہ علیہ وسلم نے فرمایا، ایک ایسے شخص کے بارے میں میری کون مدد کرے گا جس کی اذیت اور تکلیف دہی کا سلسلہ اب میری بیوی کے معاملے تک پہنچ چکا ہے۔ اللہ کی قسم، اپنی بیوی کے بارے میں خیر کے سوا اور کوئی چیز مجھے معلوم نہیں۔ پھر نام بھی اس معاملے میں انہوں نے ایک ایسے آدمی کا لیا ہے جس کے متعلق بھی میں خیر کے سوا اور کچھ نہیں جانتا۔ خود میرے گھر میں جب بھی وہ آئے ہیں تو میرے ساتھ ہی آئے۔ ( یہ سن کر ) سعد بن معاذ رضی اللہ عنہ کھڑے ہوئے اور عرض کیا، یا رسول اللہ! واللہ میں آپ کی مدد کروں گا۔ اگر وہ شخص ( جس کے متعلق تہمت لگانے کا آپ نے ارشاد فرمایا ہے ) اوس قبیلہ سے ہو گا تو ہم اس کی گردن مار دیں گے ( کیونکہ سعد رضی اللہ عنہ خود قبیلہ اوس کے سردار تھے ) اور اگر وہ خزرج کا آدمی ہوا، تو آپ ہمیں حکم دیں، جو بھی آپ کا حکم ہو گا ہم تعمیل کریں گے۔ اس کے بعد سعد بن عبادہ رضی اللہ عنہ کھڑے ہوئے جو قبیلہ خزرج کے سردار تھے۔ حالانکہ اس سے پہلے اب تک بہت صالح تھے۔ لیکن اس وقت ( سعد بن معاذ رضی اللہ عنہ کی بات پر ) حمیت سے غصہ ہو گئے تھے اور ( سعد بن معاذ رضی اللہ عنہ سے ) کہنے لگے رب کے دوام و بقا کی قسم! تم جھوٹ بولتے ہو، نہ تم اسے قتل کر سکتے ہو اور نہ تمہارے اندر اس کی طاقت ہے۔ پھر اسید بن حضیر رضی اللہ عنہ کھڑے ہوئے ( سعد بن معاذ رضی اللہ عنہ کے چچازاد بھائی ) اور کہا، اللہ کی قسم! ہم اسے قتل کر دیں گے ( اگر رسول اللہ صلی اللہ علیہ وسلم کا حکم ہوا ) کوئی شبہ نہیں رہ جاتا کہ تم بھی منافق ہو۔ کیونکہ منافقوں کی طرفداری کر رہے ہو۔ اس پر اوس و خزرج دونوں قبیلوں کے لوگ اٹھ کھڑے ہوئے اور آگے بڑھنے ہی والے تھے کہ رسول اللہ صلی اللہ علیہ وسلم جو ابھی تک منبر پر تشریف رکھتے تھے۔ منبر سے اترے اور لوگوں کو نرم کیا۔ اب سب لوگ خاموش ہو گئے اور آپ بھی خاموش ہو گئے۔ میں اس دن بھی روتی رہی۔ نہ میرے آنسو تھمتے تھے اور نہ نیند آتی تھی پھر میرے پاس میرے ماں باپ آئے۔ میں ایک رات اور ایک دن سے برابر روتی رہی تھی۔ ایسا معلوم ہوتا تھا کہ روتے روتے میرے دل کے ٹکڑے ہو جائیں گے۔ انہوں نے بیان کیا کہ ماں باپ میرے پاس بیٹھے ہوئے تھے کہ ایک انصاری عورت نے اجازت چاہی اور میں نے انہیں اندر آنے کی اجازت دے دی اور وہ میرے ساتھ بیٹھ کر رونے لگیں۔ ہم سب اسی طرح تھے کہ رسول اللہ صلی اللہ علیہ وسلم اندر تشریف لائے اور بیٹھ گئے۔ جس دن سے میرے متعلق وہ باتیں کہی جا رہی تھیں جو کبھی نہیں کہی گئیں تھیں۔ اس دن سے میرے پاس آپ نہیں بیٹھے تھے۔ آپ صلی اللہ علیہ وسلم ایک مہینے تک انتظار کرتے رہے تھے۔ لیکن میرے معاملے میں کوئی وحی آپ صلی اللہ علیہ وسلم پر نازل نہیں ہوئی تھی۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر آپ صلی اللہ علیہ وسلم نے تشہد پڑھی اور فرمایا، عائشہ! تمہارے متعلق مجھے یہ یہ باتیں معلوم ہوئیں۔ اگر تم اس معاملے میں بری ہو تو اللہ تعالیٰ بھی تمہاری برات ظاہر کر دے گا اور اگر تم نے گناہ کیا ہے تو اللہ تعالیٰ سے مغفرت چاہو اور اس کے حضور توبہ کرو کہ بندہ جب اپنے گناہ کا اقرار کر کے توبہ کرتا ہے تو اللہ تعالیٰ بھی اس کی توبہ قبول کرتا ہے۔ جونہی آپ صلی اللہ علیہ وسلم نے اپنی گفتگو ختم کی، میرے آنسو اس طرح خشک ہو گئے کہ اب ایک قطرہ بھی محسوس نہیں ہوتا تھا۔ میں نے اپنے باپ سے کہا کہ آپ رسول اللہ صلی اللہ علیہ وسلم سے میرے متعلق کہئے۔ لیکن انہوں نے کہا، قسم اللہ کی! مجھے نہیں معلوم کہ آپ صلی اللہ علیہ وسلم سے مجھے کیا کہنا چاہئے۔ میں نے اپنی ماں سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے جو کچھ فرمایا، اس کے متعلق آپ صلی اللہ علیہ وسلم سے آپ ہی کچھ کہئے، انہوں نے بھی یہی فرما دیا کہ قسم اللہ کی! مجھے معلوم نہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم سے کیا کہنا چاہئے۔ انہوں نے بیان کیا کہ میں نوعمر لڑکی تھی۔ قرآن مجھے زیادہ یاد نہیں تھا۔ میں نے کہا اللہ گواہ ہے، مجھے معلوم ہوا کہ آپ لوگوں نے بھی لوگوں کی افواہ سنی ہیں اور آپ لوگوں کے دلوں میں وہ بات بیٹھ گئی ہے اور اس کی تصدیق بھی آپ لوگ کر چکے ہیں، اس لیے اب اگر میں کہوں کہ میں ( اس بہتان سے ) بری ہوں، اور اللہ خوب جانتا ہے کہ میں واقعی اس سے بری ہوں تو آپ لوگ میری اس معاملے میں تصدیق نہیں کریں گے۔ لیکن اگر میں ( گناہ کو ) اپنے ذمہ لے لوں، حالانکہ اللہ تعالیٰ خوب جانتا ہے کہ میں اس سے بری ہوں، تو آپ لوگ میری بات کی تصدیق کر دیں گے۔ قسم اللہ کی! میں اس وقت اپنی اور آپ لوگوں کی کوئی مثال یوسف علیہ السلام کے والد ( یعقوب علیہ السلام ) کے سوا نہیں پاتی کہ انہوں نے بھی فرمایا تھا «فصبر جميل والله المستعان على ما تصفون‏» ”صبر ہی بہتر ہے اور جو کچھ تم کہتے ہو اس معاملے میں میرا مددگار اللہ تعالیٰ ہے“۔ اس کے بعد بستر پر میں نے اپنا رخ دوسری طرف کر لیا اور مجھے امید تھی کہ خود اللہ تعالیٰ میری برات کرے گا۔ لیکن میرا یہ خیال کبھی نہ تھا کہ میرے متعلق وحی نازل ہو گی۔ میری اپنی نظر میں حیثیت اس سے بہت معمولی تھی کہ قرآن مجید میں میرے متعلق کوئی آیت نازل ہو۔ ہاں مجھے اتنی امید ضرور تھی کہ آپ صلی اللہ علیہ وسلم کوئی خواب دیکھیں گے جس میں اللہ تعالیٰ مجھے بری فرما دے گا۔ اللہ گواہ ہے کہ ابھی آپ صلی اللہ علیہ وسلم اپنی جگہ سے اٹھے بھی نہ تھے اور نہ اس وقت گھر میں موجود کوئی باہر نکلا تھا کہ آپ صلی اللہ علیہ وسلم پر وحی نازل ہونے لگی اور ( شدت وحی سے ) آپ صلی اللہ علیہ وسلم جس طرح پسینے پسینے ہو جایا کرتے تھے وہی کیفیت آپ صلی اللہ علیہ وسلم کی اب بھی تھی۔ پسینے کے قطرے موتیوں کی طرح آپ صلی اللہ علیہ وسلم کے جسم مبارک سے گرنے لگے۔ حالانکہ سردی کا موسم تھا۔ جب وحی کا سلسلہ ختم ہوا تو آپ صلی اللہ علیہ وسلم ہنس رہے تھے اور سب سے پہلا کلمہ جو آپ کی زبان مبارک سے نکلا، وہ یہ تھا اے عائشہ! اللہ کی حمد بیان کر کہ اس نے تمہیں بری قرار دے دیا ہے۔ میری والدہ نے کہا بیٹی جا، رسول اللہ صلی اللہ علیہ وسلم کے سامنے جا کر کھڑی ہو جا۔ میں نے کہا، نہیں قسم اللہ کی میں آپ کے پاس جا کر کھڑی نہ ہوں گی اور میں تو صرف اللہ کی حمد و ثنا کروں گی۔ اللہ تعالیٰ نے یہ آیت نازل فرمائی تھی «إن الذين جاءوا بالإفك عصبة منكم‏» ”جن لوگوں نے تہمت تراشی کی ہے۔ وہ تم ہی میں سے کچھ لوگ ہیں“۔ جب اللہ تعالیٰ نے میری برات میں یہ آیت نازل فرمائی تو ابوبکر رضی اللہ عنہ نے جو مسطح بن اثاثہ رضی اللہ عنہ کے اخراجات قرابت کی وجہ سے خود ہی اٹھاتے تھے کہا کہ قسم اللہ کی اب میں مسطح پر کبھی کوئی چیز خرچ نہیں کروں گا کہ وہ بھی عائشہ پر تہمت لگانے میں شریک تھا۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «ولا يأتل أولو الفضل منكم والسعة‏ إلى قوله ‏غفور رحيم‏» ‏‏‏‏ ”تم میں سے صاحب فضل و صاحب مال لوگ قسم نہ کھائیں۔ اللہ تعالیٰ کے ارشاد غفور رحیم تک“۔ ابوبکر رضی اللہ عنہ نے کہا اللہ کی قسم! بس میری یہی خواہش ہے کہ اللہ تعالیٰ میری مغفرت کر دے۔ چنانچہ مسطح رضی اللہ عنہ کو جو آپ پہلے دیا کرتے تھے وہ پھر دینے لگے۔ رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش ( رضی اللہ عنہا ام المؤمنین ) سے بھی میرے متعلق پوچھا تھا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ زینب! تم ( عائشہ رضی اللہ عنہا کے متعلق ) کیا جانتی ہو؟ اور کیا دیکھا ہے؟ انہوں نے جواب دیا میں اپنے کان اور اپنی آنکھ کی حفاظت کرتی ہوں ( کہ جو چیز میں نے دیکھی ہو یا نہ سنی ہو وہ آپ سے بیان کرنے لگوں ) اللہ گواہ ہے کہ میں نے ان میں خیر کے سوا اور کچھ نہیں دیکھا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ یہی میری برابر کی تھیں، لیکن اللہ تعالیٰ نے انہیں تقویٰ کی وجہ سے بچا لیا۔ ابوالربیع نے بیان کیا کہ ہم سے فلیح نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے عروہ نے، ان سے عائشہ اور عبداللہ بن زبیر رضی اللہ عنہم نے اسی حدیث کی طرح۔ ابوالربیع نے ( دوسری سند میں ) بیان کیا کہ ہم سے فلیح نے بیان کیا، ان سے ربیعہ بن ابی عبدالرحمٰن اور یحییٰ بن سعید نے اور ان سے قاسم بن محمد بن ابی بکر نے اسی حدیث کی طرح۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2662,
			"arabicnumber": 2662,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو عبدالوہاب نے خبر دی، کہا کہ ہم سے خالد حذاء نے بیان کیا، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے باپ نے بیان کیا کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے دوسرے شخص کی تعریف کی، تو آپ صلی اللہ علیہ وسلم نے فرمایا افسوس! تو نے اپنے ساتھی کی گردن کاٹ ڈالی۔ تو نے اپنے ساتھی کی گردن کاٹ ڈالی۔ کئی مرتبہ ( آپ صلی اللہ علیہ وسلم نے اسی طرح فرمایا ) پھر فرمایا کہ اگر کسی کے لیے اپنے کسی بھائی کی تعریف کرنی ضروری ہو جائے تو یوں کہے کہ میں فلاں شخص کو ایسا سمجھتا ہوں، آگے اللہ خوب جانتا ہے، میں اللہ کے سامنے کسی کو بےعیب نہیں کہہ سکتا۔ میں سمجھتا ہوں وہ ایسا ایسا ہے اگر اس کا حال جانتا ہو۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2663,
			"arabicnumber": 2663,
			"text": "ہم سے محمد بن صباح نے بیان کیا، انہوں نے کہا ہم سے اسماعیل بن زکریا نے بیان کیا، انہوں نے کہا ہم سے برید بن عبداللہ نے بیان کیا، ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے سنا کہ ایک شخص دوسرے کی تعریف کر رہا تھا اور مبالغہ سے کام لے رہا تھا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگوں نے اس شخص کو ہلاک کر دیا۔ اس کی پشت توڑ دی۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2664,
			"arabicnumber": 2664,
			"text": "ہم سے عبداللہ بن سعید نے بیان کیا، کہا کہ ہم سے ابواسامہ نے بیان کیا، کہا کہ مجھ سے عبیداللہ نے بیان کیا، کہا کہ مجھ سے نافع نے بیان کیا، انہوں نے کہا کہ ہم سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ احد کی لڑائی کے موقع پر وہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے ( جنگ پر جانے کے لیے ) پیش ہوئے تو انہیں اجازت نہیں ملی، اس وقت ان کی عمر چودہ سال تھی۔ پھر غزوہ خندق کے موقع پر پیش ہوئے تو اجازت مل گئی۔ اس وقت ان کی عمر پندرہ سال تھی۔ نافع نے بیان کیا کہ جب میں عمر بن عبدالعزیز کے یہاں ان کی خلافت کے زمانے میں گیا تو میں نے ان سے یہ حدیث بیان کی تو انہوں نے فرمایا کہ چھوٹے اور بڑے کے درمیان ( پندرہ سال ہی کی ) حد ہے۔ پھر انہوں نے اپنے حاکموں کو لکھا کہ جس بچے کی عمر پندرہ سال کی ہو جائے ( اس کا فوجی وظیفہ ) بیت المال سے مقرر کر دیں۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2665,
			"arabicnumber": 2665,
			"text": "ہم سے علی بن عبداللہ نے بیان کا، انہوں نے کہا ہم سے سفیان نے بیان کیا، انہوں نے کہا ہم سے صفوان بن سلیم نے بیان کیا، ان سے عطاء بن یسار نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ہر بالغ پر جمعہ کے دن غسل واجب ہے۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2666,
			"arabicnumber": 2666,
			"text": "ہم سے محمد نے بیان کیا کہا ہم کو ابومعاویہ نے خبر دی اور انہیں اعمش نے انہیں شقیق نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس شخص نے کوئی ایسی قسم کھائی جس میں وہ جھوٹا تھا، کسی مسلمان کا مال چھیننے کے لیے، تو وہ اللہ تعالیٰ سے اس طرح ملے گا کہ اللہ تعالیٰ اس پر غضبناک ہو گا۔“ انہوں نے بیان کیا کہ اس پر اشعث بن قیس رضی اللہ عنہ نے کہا کہ اللہ گواہ ہے، یہ حدیث میرے ہی متعلق آپ صلی اللہ علیہ وسلم نے فرمائی تھی۔ میرا ایک یہودی سے ایک زمین کا جھگڑا تھا۔ یہودی میرے حق کا انکار کر رہا تھا۔ اس لیے میں اسے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لایا۔ آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا ( کیونکہ میں مدعی تھا ) کہ گواہی پیش کرنا تمہارے ہی ذمہ ہے۔ انہوں نے بیان کیا کہ میں نے عرض کیا گواہ تو میرے پاس کوئی بھی نہیں۔ اس لیے آپ صلی اللہ علیہ وسلم نے یہودی سے فرمایا ”پھر تم قسم کھاؤ۔“ اشعث رضی اللہ عنہ نے بیان کیا کہ میں بول پڑا، یا رسول اللہ! پھر تو یہ قسم کھا لے گا اور میرا مال ہضم کر جائے گا۔ انہوں نے بیان کیا کہ اسی واقعہ پر اللہ تعالیٰ نے یہ آیت نازل فرمائی «إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا» ”جو لوگ اللہ کے عہد اور قسموں سے معمولی پونجی خریدتے ہیں آخر آیت تک۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2668,
			"arabicnumber": 2668,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے نافع بن عمر نے بیان کیا، ان سے ابن ابی ملیکہ نے بیان کیا کہ ابن عباس رضی اللہ عنہما نے لکھا تھا ”نبی کریم صلی اللہ علیہ وسلم نے مدعیٰ علیہ کے لیے قسم کھانے کا فیصلہ کیا تھا۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2669,
			"arabicnumber": 2669,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر نے بیان کیا منصور سے، ان سے ابووائل نے بیان کیا کہ عبداللہ رضی اللہ عنہ نے کہا کہ جو شخص ( جھوٹی ) قسم کسی کا مال حاصل کرنے کے لیے کھائے گا تو اللہ تعالیٰ سے وہ اس حال میں ملے گا کہ اللہ پاک اس پر غضبناک ہو گا۔ اس کے بعد اللہ تعالیٰ نے ( اس حدیث کی ) تصدیق کے لیے یہ آیت نازل فرمائی «إن الذين يشترون بعهد الله وأيمانهم‏» ”جو لوگ اللہ کے عہد اور اپنی قسموں سے تھوڑی پونجی خریدتے ہیں۔ «عذاب أليم‏» “ تک۔ پھر اشعث بن قیس رضی اللہ عنہ ہماری طرف تشریف لائے اور پوچھنے لگے کہ ابوعبدالرحمٰن ( عبداللہ بن مسعود رضی اللہ عنہ ) تم سے کون سی حدیث بیان کر رہے تھے۔ ہم نے ان کی یہی حدیث بیان کی تو انہوں نے کہا کہ انہوں نے صحیح بیان کی، یہ آیت میرے ہی بارے میں نازل ہوئی تھی۔ میرا ایک شخص سے جھگڑا تھا۔ ہم اپنا مقدمہ رسول اللہ صلی اللہ علیہ وسلم کے پاس لے گئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یا تم دو گواہ لاؤ، ورنہ اس کی قسم پر فیصلہ ہو گا۔ میں نے کہا کہ ( گواہ میرے پاس نہیں ہیں لیکن اگر فیصلہ اس کی قسم پر ہوا ) پھر تو یہ ضرور ہی قسم کھا لے گا اور کوئی پروانہ کرے گا۔ نبی کریم صلی اللہ علیہ وسلم نے یہ سن کر فرمایا ”جو شخص بھی کسی کا مال لینے کے لیے ( جھوٹی ) قسم کھائے تو اللہ تعالیٰ سے وہ اس حال میں ملے گا کہ وہ اس پر غضبناک ہو گا۔“ اس کی تصدیق میں اللہ تعالیٰ نے مذکورہ بالا آیت نازل فرمائی تھی، پھر انہوں نے یہی آیت تلاوت کی۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2671,
			"arabicnumber": 2671,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے ابن ابی عدی نے بیان کیا، ان سے ہشام نے، ان سے عکرمہ نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ ہلال بن امیہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کے سامنے اپنی بیوی پر شریک بن سمحاء کے ساتھ تہمت لگائی تو آپ صلی اللہ علیہ وسلم نے فرمایا ”اس پر گواہ لا ورنہ تمہاری پیٹھ پر حد لگائی جائے گی۔“ انہوں نے کہا یا رسول اللہ! کیا ہم میں سے کوئی شخص اگر اپنی عورت پر کسی دوسرے کو دیکھے گا تو گواہ ڈھونڈنے دوڑے گا؟ آپ صلی اللہ علیہ وسلم برابر یہی فرماتے رہے ”گواہ لا ورنہ تمہاری پیٹھ پر حد لگائی جائے گی۔“ پھر لعان کی حدیث کا ذکر کیا۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2672,
			"arabicnumber": 2672,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے جریر بن عبدالحمید نے بیان کیا اعمش سے، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تین طرح کے لوگ ایسے ہیں کہ اللہ تعالیٰ ان سے بات بھی نہ کرے گا نہ ان کی طرف نظر اٹھا کر دیکھے گا اور نہ انہیں پاک کرے گا بلکہ انہیں سخت درد ناک عذاب ہو گا۔ ایک وہ شخص جو سفر میں ضرورت سے زیادہ پانی لے جا رہا ہے اور کسی مسافر کو ( جسے پانی کی ضرورت ہو ) نہ دے۔ دوسرا وہ شخص جو کسی ( خلیفۃ المسلمین ) سے بیعت کرے اور صرف دنیا کے لیے بیعت کرے کہ جس سے اس نے بیعت کی اگر وہ اس کا مقصد پورا کر دے تو یہ بھی وفاداری سے کام لے، ورنہ اس کے ساتھ بیعت و عہد کے خلاف کرے۔ تیسرا وہ شخص جو کسی سے عصر کے بعد کسی سامان کا بھاؤ کرے اور اللہ کی قسم کھا لے کہ اسے اس کا اتنا اتنا روپیہ مل رہا تھا اور خریدار اس سامان کو ( اس کی قسم کی وجہ سے ) لے لے۔ حالانکہ وہ جھوٹا ہے۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2673,
			"arabicnumber": 2673,
			"text": "ہم سے موسیٰ بن اسمٰعیل نے بیان کیا، کہا ہم سے عبدالاحد نے بیان کیا اعمش سے، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جو شخص قسم اس لیے کھاتا ہے تاکہ اس کے ذریعہ کسی کا مال ( ناجائز طور پر ) ہضم کر جائے تو وہ اللہ سے اس حال میں ملے گا کہ اللہ پاک اس پر سخت غضبناک ہو گا۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2674,
			"arabicnumber": 2674,
			"text": "ہم سے اسحاق بن نصر نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہیں معمر نے خبر دی، انہیں ہمام نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے چند آدمیوں سے قسم کھانے کے لیے کہا ( ایک ایسے مقدمے میں جس کے یہ لوگ مدعیٰ علیہ تھے ) قسم کے لیے سب ایک ساتھ آگے بڑھے۔ تو آپ صلی اللہ علیہ وسلم نے حکم دیا ”قسم کھانے کے لیے ان میں باہم قرعہ ڈالا جائے کہ پہلے کون قسم کھائے۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2675,
			"arabicnumber": 2675,
			"text": "مجھ سے اسحاق نے بیان کیا، کہا کہ ہم کو یزید بن ہارون نے خبر دی، انہیں عوام نے خبر دی، کہا کہ مجھ سے ابراہیم ابواسماعیل سکسکی نے بیان کیا اور انہوں نے عبداللہ بن ابی اوفی رضی اللہ عنہ کو یہ کہتے سنا کہ ایک شخص نے اپنا سامان دکھا کر اللہ کی قسم کھائی کہ اسے اس سامان کا اتنا روپیہ مل رہا تھا، حالانکہ اتنا نہیں مل رہا تھا۔ اس پر یہ آیت نازل ہوئی «إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏» ”جو لوگ اللہ کے عہد اور اپنی قسموں کے ذریعہ تھوڑی قیمت حاصل کرتے ہیں۔“ ابن ابی اوفی رضی اللہ عنہ نے کہا کہ گاہکوں کو پھانسنے کے لیے قیمت بڑھانے والا سود خور کی طرح خائن ہے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2676,
			"arabicnumber": 2676,
			"text": "",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2678,
			"arabicnumber": 2678,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے ان کے چچا ابوسہیل نے، ان سے ان کے والد نے اور انہوں نے طلحہ بن عبیداللہ رضی اللہ عنہ سے سنا، آپ نے بیان کیا کہ ایک صاحب ( ضمام بن ثعلبہ ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئے اور اسلام کے متعلق پوچھنے لگے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”دن اور رات میں پانچ نمازیں ادا کرنا۔“ اس نے پوچھا کیا اس کے علاوہ بھی مجھ پر کچھ نماز اور ضروری ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں یہ دوسری بات ہے کہ تم نفل پڑھو۔“ پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اور رمضان کے روزے ہیں۔“ اس نے پوچھا کیا اس کے علاوہ بھی مجھ پر کچھ ( روزے ) واجب ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں ”سوا اس کے جو تم اپنے طور پر نفل رکھو۔“ طلحہ رضی اللہ عنہ نے بیان کیا کہ ان کے سامنے رسول اللہ صلی اللہ علیہ وسلم نے زکوٰۃ کا بھی ذکر کیا تو انہوں نے پوچھا، کیا ( جو فرض زکوٰۃ آپ نے بتائی ہے ) اس کے علاوہ بھی مجھ پر کوئی خیرات واجب ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں، سوا اس کے جو تم خود اپنی طرف سے نفل دو۔“ اس کے بعد وہ صاحب یہ کہتے ہوئے جانے لگے کہ اللہ گواہ ہے نہ میں ان میں کوئی زیادتی کروں گا اور نہ کوئی کمی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اگر اس نے سچ کہا ہے تو کامیاب ہوا۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2679,
			"arabicnumber": 2679,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے کہا کہ ہم سے جویریہ نے بیان کیا، انہوں نے کہا کہ نافع نے عبداللہ بن عمر رضی اللہ عنہما سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اگر کسی کو قسم کھانی ہی ہے تو اللہ تعالیٰ ہی کی قسم کھائے، ورنہ خاموش رہے۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2680,
			"arabicnumber": 2680,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا امام مالک سے، ان سے ہشام بن عروہ نے، ان سے ان کے باپ نے، ان سے زینب نے اور ان سے ام سلمہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم لوگ میرے یہاں اپنے مقدمات لاتے ہو اور کبھی ایسا ہوتا ہے کہ ایک تم میں دوسرے سے دلیل بیان کرنے میں بڑھ کر ہوتا ہے ( قوت بیانیہ بڑھ کر رکھتا ہے ) پھر میں اس کو اگر اس کے بھائی کا حق ( غلطی سے ) دلا دوں، تو وہ حلال ( نہ سمجھے ) اس کو نہ لے، میں اس کو دوزخ کا ایک ٹکڑا دلا رہا ہوں۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2681,
			"arabicnumber": 2681,
			"text": "ہم سے ابرہیم بن حمزہ نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے صالح بن کیسان نے، ان سے ابن شہاب نے، ان سے عبیداللہ بن عبداللہ نے کہ عبداللہ بن عباس رضی اللہ عنہما نے انہیں خبر دی، انہوں نے بیان کیا کہ انہیں ابوسفیان رضی اللہ عنہ نے خبر دی کہ ہرقل نے ان سے کہا تھا کہ میں نے تم سے پوچھا تھا کہ وہ ( محمد صلی اللہ علیہ وسلم ) تمہیں کس بات کا حکم دیتے ہیں تو تم نے بتایا کہ وہ تمہیں نماز، سچائی، عفت، عہد کے پورا کرنے اور امانت کے ادا کرنے کا حکم دیتے ہیں۔ اور یہ نبی کی صفات ہیں۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2682,
			"arabicnumber": 2682,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے اسماعیل بن جعفر نے بیان کیا، ان سے ابوسہیل، نافع بن مالک بن ابی عامر نے بیان کیا، ان سے ان کے باپ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”منافق کی تین نشانیاں ہیں۔ جب بات کہی تو جھوٹ کہی، امانت دی گئی تو اس نے اس میں خیانت کی اور وعدہ کیا تو اسے پورا نہیں کیا۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2683,
			"arabicnumber": 2683,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہمیں ہشام نے خبر دی، ان سے ابن جریج نے بیان کیا، انہیں عمرو بن دینار نے خبر دی، انہیں محمد بن علی نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا، کہا نبی کریم صلی اللہ علیہ وسلم کی وفات کے بعد ابوبکر رضی اللہ عنہ کے پاس ( بحرین کے عامل ) علاء بن حضرمی رضی اللہ عنہ کی طرف سے مال آیا۔ ابوبکر رضی اللہ عنہ نے اعلان کرا دیا کہ جس کسی کا بھی نبی کریم صلی اللہ علیہ وسلم پر کوئی قرض ہو، یا آپ صلی اللہ علیہ وسلم کا اس سے وعدہ ہو تو وہ ہمارے پاس آئے۔ جابر رضی اللہ عنہ نے بیان کیا کہ اس پر میں نے ان سے کہا کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے وعدہ فرمایا تھا کہ آپ صلی اللہ علیہ وسلم اتنا مال مجھے عطا فرمائیں گے۔ چنانچہ ابوبکر رضی اللہ عنہ نے تین مرتبہ اپنے ہاتھ بڑھائے اور میرے ہاتھ پر پانچ سو، پھر پانچ سو اور پھر پانچ سو گن دئیے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2684,
			"arabicnumber": 2684,
			"text": "ہم سے محمد بن عبدالرحیم نے بیان کیا، کہا ہم کو سعید بن سلیمان نے خبر دی، ان سے مروان بن شجاع نے بیان کیا، ان سے سالم افطس نے اور ان سے سعید بن جبیر نے بیان کیا کہ حیرہ کے یہودی نے مجھ سے پوچھا، موسیٰ علیہ السلام نے ( اپنے مہر کے ادا کرنے میں ) کون سی مدت پوری کی تھی؟ ( یعنی آٹھ سال کی یا دس سال کی، جن کا قرآن میں ذکر ہے ) میں نے کہا کہ مجھے معلوم نہیں، ہاں! عرب کے بڑے عالم کی خدمت میں حاضر ہو کر پوچھ لوں ( تو پھر تمہیں بتا دوں گا ) چنانچہ میں نے ابن عباس رضی اللہ عنہما سے پوچھا تو انہوں نے بتایا کہ آپ نے بڑی مدت پوری کی ( دس سال کی ) جو دونوں مدتوں میں بہتر تھی۔ رسول اللہ صلی اللہ علیہ وسلم بھی جب کسی سے وعدہ کرتے تو پورا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2685,
			"arabicnumber": 2685,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، یونس سے، ان سے ابن شہاب نے، ان سے عبیداللہ بن عبداللہ بن عتبہ نے کہ ابن عباس رضی اللہ عنہما نے کہا، اے مسلمانو! اہل کتاب سے کیوں سوالات کرتے ہو۔ حالانکہ تمہاری کتاب جو تمہارے نبی صلی اللہ علیہ وسلم پر نازل ہوئی ہے، اللہ تعالیٰ کی طرف سے سب سے بعد میں نازل ہوئی ہے۔ تم اسے پڑھتے ہو اور اس میں کسی قسم کی آمیزش بھی نہیں ہوئی ہے۔ اللہ تعالیٰ تو تمہیں پہلے ہی بتا چکا ہے کہ اہل کتاب نے اس کتاب کو بدل دیا، جو اللہ تعالیٰ نے انہیں دی تھی اور خود ہی اس میں تغیر کر دیا اور پھر کہنے لگے یہ کتاب اللہ کی طرف سے ہے۔ ان کا مقصد اس سے صرف یہ تھا کہ اس طرح تھوڑی پونجی ( دنیا کی ) حاصل کر سکیں پس کیا جو علم ( قرآن ) تمہارے پاس آیا ہے وہ تم کو ان ( اہل کتاب سے پوچھنے کو نہیں روکتا۔ اللہ کی قسم! ہم نے ان کے کسی آدمی کو کبھی نہیں دیکھا کہ وہ ان آیات کے متعلق تم سے پوچھتا ہو جو تم پر ( تمہارے نبی کے ذریعہ ) نازل کی گئی ہیں۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2686,
			"arabicnumber": 2686,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، کہا ہم سے اعمش نے، کہا کہ ہم سے شعبی نے بیان کیا، انہوں نے نعمان بن بشیر رضی اللہ عنہما سے سنا، وہ کہتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اللہ کی حدود میں سستی برتنے والے اور اس میں مبتلا ہو جانے والے کی مثال ایک ایسی قوم کی سی ہے جس نے ایک کشتی ( پر سفر کرنے کے لیے جگہ کے بارے میں ) قرعہ اندازی کی۔ پھر نتیجے میں کچھ لوگ نیچے سوار ہوئے اور کچھ اوپر۔ نیچے کے لوگ پانی لے کر اوپر کی منزل سے گزرتے تھے اور اس سے اوپر والوں کو تکلیف ہوتی تھی۔ اس خیال سے نیچے والا ایک آدمی کلہاڑی سے کشتی کا نیچے کا حصہ کاٹنے لگا ( تاکہ نیچے ہی سمندر سے پانی لے لیا کرے ) اب اوپر والے آئے اور کہنے لگے کہ یہ کیا کر رہے ہو؟ اس نے کہا کہ تم لوگوں کو ( میرے اوپر آنے جانے سے ) تکلیف ہوتی تھی اور میرے لیے بھی پانی ضروری تھا۔ اب اگر انہوں نے نیچے والے کا ہاتھ پکڑ لیا تو انہیں بھی نجات دی اور خود بھی نجات پائی۔ لیکن اگر اسے یوں ہی چھوڑ دیا تو انہیں بھی ہلاک کیا اور خود بھی ہلاک ہو گئے۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2687,
			"arabicnumber": 2687,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی زہری سے، ان سے خارجہ بن زید انصاری نے بیان کیا کہ ان کی رشتہ دار ایک عورت ام علاء نامی نے جنہوں نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت بھی کی تھی، انہیں خبر دی کہ انصار نے مہاجرین کو اپنے یہاں ٹھہرانے کے لیے قرعے ڈالے تو عثمان بن مظعون رضی اللہ عنہ کا قیام ہمارے حصے میں آیا۔ ام علاء رضی اللہ عنہا نے کہا کہ پھر عثمان بن مظعون رضی اللہ عنہ ہمارے گھر ٹھہرے اور کچھ مدت بعد وہ بیمار پڑ گئے۔ ہم نے ان کی تیمارداری کی مگر کچھ دن بعد ان کی وفات ہو گئی۔ جب ہم انہیں کفن دے چکے تو رسول اللہ صلی اللہ علیہ وسلم تشریف لائے۔ میں نے کہا، ابوالسائب! ( عثمان رضی اللہ عنہ کی کنیت ) تم پر اللہ کی رحمتیں نازل ہوں، میری گواہی ہے کہ اللہ تعالیٰ نے اپنے یہاں تمہاری ضرور عزت اور بڑائی کی ہو گی۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا یہ بات تمہیں کیسے معلوم ہو گئی کہ اللہ تعالیٰ نے ان کی عزت اور بڑائی کی ہو گی۔ میں نے عرض کیا، میرے ماں اور باپ آپ پر فدا ہوں، مجھے یہ بات کسی ذریعہ سے معلوم نہیں ہوئی ہے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا، عثمان کا جہاں تک معاملہ ہے، تو اللہ گواہ ہے کہ ان کی وفات ہو چکی اور میں ان کے بارے میں اللہ سے خیر ہی کی امید رکھتا ہوں، لیکن اللہ کی قسم! اللہ کے رسول ہونے کے باوجود مجھے بھی یہ علم نہیں کہ ان کے ساتھ کیا معاملہ ہو گا۔ ام علاء رضی اللہ عنہا کہنے لگیں، اللہ کی قسم! اب اس کے بعد میں کسی شخص کی پاکی کبھی بیان نہیں کروں گی۔ اس سے مجھے رنج بھی ہوا ( کہ آپ صلی اللہ علیہ وسلم کے سامنے میں نے ایک ایسی بات کہی جس کا مجھے حقیقی علم نہیں تھا ) انہوں نے کہا ( ایک دن ) میں سو رہی تھی، میں نے خواب میں عثمان رضی اللہ عنہ کے لیے ایک بہتا ہوا چشمہ دیکھا۔ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی آپ صلی اللہ علیہ وسلم سے خواب بیان کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ان کا عمل ( نیک ) تھا۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2688,
			"arabicnumber": 2688,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، انہیں یونس نے خبر دی زہری سے، انہیں عروہ نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم جب سفر کا ارادہ فرماتے تو اپنی بیویوں میں قرعہ اندازی فرماتے اور جس کا نام نکل آتا، انہیں اپنے ساتھ لے جاتے۔ آپ صلی اللہ علیہ وسلم کا یہ بھی معمول تھا کہ اپنی ہر بیوی کے لیے ایک دن اور ایک رات مقرر کر دی تھی۔ البتہ سودہ بنت زمعہ رضی اللہ عنہا نے ( اپنی عمر کے آخری دور میں ) اپنی باری آپ صلی اللہ علیہ وسلم کی زوجہ عائشہ رضی اللہ عنہا کو دے دی تھی تاکہ رسول اللہ صلی اللہ علیہ وسلم کی ان کو رضا حاصل ہو ( اس سے بھی قرعہ اندازی ثابت ہوئی ) ۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2689,
			"arabicnumber": 2689,
			"text": "ہم سے اسماعیل نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے ابوبکر کے غلام سمی نے بیان کیا، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اگر لوگوں کو معلوم ہوتا کہ اذان اور صف اول میں کتنا ثواب ہے اور پھر ( انہیں اس کے حاصل کرنے کے لیے ) قرعہ اندازی کرنی پڑتی، تو وہ قرعہ اندازی بھی کرتے اور اگر انہیں معلوم ہو جائے کہ نماز سویرے پڑھنے میں کتنا ثواب ہے تو لوگ ایک دوسرے سے سبقت کرنے لگیں اور اگر انہیں معلوم ہو جائے کہ عشاء اور صبح کی کتنی فضیلتیں ہیں تو اگر گھٹنوں کے بل آنا پڑتا تو پھر بھی آتے۔“",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 50
			}
		}
	]
}