{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"55": "Wills and Testaments (Wasaayaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2738,
			"arabicnumber": 2738,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی نافع سے ‘ وہ عبداللہ بن عمر رضی اللہ عنہما سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کسی مسلمان کے لیے جن کے پاس وصیت کے قابل کوئی بھی مال ہو درست نہیں کہ دو رات بھی وصیت کو لکھ کر اپنے پاس محفوظ رکھے بغیر گزارے۔“ امام مالک کے ساتھ اس روایت کی متابعت محمد بن مسلم نے عمرو بن دینار سے کی ہے ‘ انہوں نے ابن عمر رضی اللہ عنہما سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ہے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2739,
			"arabicnumber": 2739,
			"text": "ہم سے ابراہیم بن حارث نے بیان کیا ‘ انہوں نے کہا ہم سے یحییٰ ابن ابی بکیر نے بیان کیا ‘ انہوں نے کہا ہم سے زہیر بن معاویہ جعفی نے بیان کیا ‘ انہوں نے کہا ہم سے ابواسحاق عمرو بن عبداللہ نے بیان کیا اور ان سے رسول اللہ صلی اللہ علیہ وسلم کے نسبتی بھائی عمرو بن حارث رضی اللہ عنہ نے جو جویریہ بنت حارث رضی اللہ عنہا ( ام المؤمنین ) کے بھائی ہیں ‘ بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی وفات کے بعد سوائے اپنے سفید خچر ‘ اپنے ہتھیار اور اپنی زمین کے جسے آپ صلی اللہ علیہ وسلم وقف کر گئے تھے نہ کوئی درہم چھوڑا تھا نہ دینار نہ غلام نہ باندی اور نہ کوئی چیز۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2740,
			"arabicnumber": 2740,
			"text": "ہم سے خلاد بن یحییٰ نے بیان کیا ‘ کہا ہم سے امام مالک نے بیان کیا ‘ کہا ہم سے طلحہ بن مصرف نے بیان کیا ‘ انہوں نے بیان کیا کہ میں نے عبداللہ بن ابی اوفی رضی اللہ عنہ سے سوال کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کوئی وصیت کی تھی؟ انہوں نے کہا کہ نہیں۔ اس پر میں نے پوچھا کہ پھر وصیت کس طرح لوگوں پر فرض ہوئی؟ یا ( راوی نے اس طرح بیان کیا ) کہ لوگوں کو وصیت کا حکم کیوں کر دیا گیا؟ انہوں نے کہا کہ آپ صلی اللہ علیہ وسلم نے لوگوں کو کتاب اللہ پر عمل کرنے کی وصیت کی تھی ( اور کتاب اللہ میں وصیت کرنے کے لیے حکم موجود ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2741,
			"arabicnumber": 2741,
			"text": "ہم سے عمرو بن زرارہ نے بیان کیا ‘ کہ ہم کو اسماعیل بن علیہ نے خبر دی عبداللہ بن عون سے ‘ انہیں ابراہیم نخعی نے ‘ ان سے اسود بن یزید نے بیان کیا کہ عائشہ رضی اللہ عنہا کے یہاں کچھ لوگوں نے ذکر کیا کہ علی رضی اللہ عنہ ( نبی کریم صلی اللہ علیہ وسلم کے ) وصی تھے تو آپ نے کہا کہ کب انہیں وصی بنایا۔ میں تو آپ کے وصال کے وقت سر مبارک اپنے سینے پر یا انہوں نے ( بجائے سینے کے ) کہا کہ اپنے گود میں رکھے ہوئے تھی پھر آپ صلی اللہ علیہ وسلم نے ( پانی کا ) طشت منگوایا تھا کہ اتنے میں ( سر مبارک ) میری گود میں جھک گیا اور میں سمجھ نہ سکی کہ آپ صلی اللہ علیہ وسلم کی وفات ہو چکی ہے تو آپ صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ کو وصی کب بنایا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2742,
			"arabicnumber": 2742,
			"text": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا سعد بن ابراہیم سے ‘ ان سے عامر بن سعد نے اور ان سے سعد بن ابی وقاص نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ( حجۃ الوداع میں ) میری عیادت کو تشریف لائے ‘ میں اس وقت مکہ میں تھا۔ نبی کریم صلی اللہ علیہ وسلم اس سر زمین پر موت کو پسند نہیں فرماتے تھے جہاں سے کوئی ہجرت کر چکا ہو۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”اللہ ابن عفراء ( سعد بن خولہ رضی اللہ عنہ ) پر رحم فرمائے۔“ میں عرض کیا یا رسول اللہ! میں اپنے سارے مال و دولت کی وصیت کر دوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”نہیں“ میں نے پوچھا پھر آدھے کی کر دوں؟ آپ صلی اللہ علیہ وسلم نے اس پر بھی یہی فرمایا ”نہیں“ میں نے پوچھا پھر تہائی کی کر دوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا تہائی کی کر سکتے ہو اور یہ بھی بہت ہے ‘ اگر تم اپنے وارثوں کو اپنے پیچھے مالدار چھوڑو تو یہ اس سے بہتر ہے کہ انہیں محتاج چھوڑو کہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں ‘ اس میں کوئی شبہ نہیں کہ جب تم اپنی کوئی چیز ( اللہ کے لیے خرچ کرو گے ) تو وہ خیرات ہے ‘ یہاں تک کہ وہ لقمہ بھی جو تم اپنی بیوی کے منہ میں ڈالو گے ( وہ بھی خیرات ہے ) اور ( ابھی وصیت کرنے کی کوئی ضرورت بھی نہیں ) ممکن ہے کہ اللہ تعالیٰ تمہیں شفاء دے اور اس کے بعد تم سے بہت سے لوگوں کو فائدہ ہو اور دوسرے بہت سے لوگ ( اسلام کے مخالف ) نقصان اٹھائیں۔ اس وقت سعد رضی اللہ عنہ کی صرف ایک بیٹی تھی۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2743,
			"arabicnumber": 2743,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے ہشام بن عروہ نے ‘ ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کاش ! لوگ (وصیت کو) چوتھائی تک کم کر دیتے تو بہتر ہوتا کیونکہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا تھا ” تم تہائی (کی وصیت کر سکتے ہو) اور تہائی بھی بہت ہے ۔ “ یا (آپ صلی ‌اللہ ‌علیہ ‌وسلم نے یہ فرمایا کہ) ” یہ بہت زیادہ رقم ہے ۔ “",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2744,
			"arabicnumber": 2744,
			"text": "ہم سے محمد بن عبدالرحیم نے بیان کیا ‘ کہا ہم سے زکریا بن عدی نے بیان کیا ‘ ان سے مروان بن معاویہ نے ‘ ان سے ہاشم ابن ہاشم نے ‘ ان سے عامر بن سعد نے اور ان سے ان کے باپ سعد بن ابی وقاص نے بیان کیا کہ میں مکہ میں بیمار پڑا تو رسول اللہ صلی اللہ علیہ وسلم میری عیادت کیلئے تشریف لائے۔ میں نے عرض کیا یا رسول اللہ! میرے لیے دعا کیجئے کہ اللہ مجھے الٹے پاؤں واپس نہ کر دے ( یعنی مکہ میں میری موت نہ ہو ) آپ صلی اللہ علیہ وسلم نے فرمایا ممکن ہے کہ اللہ تعالیٰ تمہیں صحت دے اور تم سے بہت سے لوگ نفع اٹھائیں۔ میں نے عرض کیا میرا ارادہ وصیت کرنے کا ہے۔ ایک لڑکی کے سوا اور میرے کوئی ( اولاد ) نہیں۔ میں نے پوچھا کیا آدھے مال کی وصیت کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ آدھا تو بہت ہے۔ پھر میں نے پوچھا تو تہائی کی کر دوں؟ فرمایا کہ تہائی کی کر سکتے ہو اگرچہ یہ بھی بہت ہے یا ( یہ فرمایا کہ ) بڑی ( رقم ) ہے۔ چنانچہ لوگ بھی تہائی کی وصیت کرنے لگے اور یہ ان کیلئے جائز ہو گئی۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2745,
			"arabicnumber": 2745,
			"text": "ہم سے عبداللہ بن مسلمہ قعبنی نے بیان کیا ‘ کہا ہم سے امام مالک نے ابن شہاب سے ‘ وہ عروہ بن زبیر سے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ عتبہ بن ابی وقاص نے مرتے وقت اپنے بھائی سعد بن ابی وقاص رضی اللہ عنہ کو وصیت کی تھی کہ زمعہ کی باندی کا لڑکا میرا ہے ‘ اس لیے تم اسے لے لینا چنانچہ فتح مکہ کے موقع پر سعد رضی اللہ عنہ نے اسے لے لیا اور کہا کہ میرے بھائی کا لڑکا ہے۔ انہوں نے اس بارے میں مجھے اس کی وصیت کی تھی۔ پھر عبد بن زمعہ رضی اللہ عنہ اٹھے اور کہنے لگے کہ یہ تو میرا بھائی ہے میرے باپ کی لونڈی نے اس کو جنا ہے اور میرے باپ کے بستر پر پیدا ہوا ہے۔ پھر یہ دونوں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ سعد بن ابی وقاص رضی اللہ عنہ نے عرض کیا یا رسول اللہ! یہ میرے بھائی کا لڑکا ہے ‘ مجھے اس نے وصیت کی تھی۔ لیکن عبد بن زمعہ رضی اللہ عنہ نے عرض کیا کہ یہ میرا بھائی اور میرے والد کی باندی کا لڑکا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فیصلہ یہ فرمایا کہ لڑکا تمہارا ہی ہے عبد بن زمعہ! بچہ فراش کے تحت ہوتا ہے اور زانی کے حصے میں پتھر ہیں لیکن آپ صلی اللہ علیہ وسلم نے سودہ بنت زمعہ رضی اللہ عنہا سے فرمایا کہ اس لڑکے سے پردہ کر کیونکہ آپ صلی اللہ علیہ وسلم نے عتبہ کی مشابہت اس لڑکے میں صاف پائی تھی۔ چنانچہ اس کے بعد اس لڑکے نے سودہ رضی اللہ عنہا کو کبھی نہ دیکھا تاآنکہ آپ اللہ تعالیٰ سے جا ملیں۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2746,
			"arabicnumber": 2746,
			"text": "ہم سے حسان بن ابی عباد نے بیان کیا ‘ کہا ہم سے ہمام نے بیان کیا قتادہ سے اور ان سے انس رضی اللہ عنہ نے کہ ایک یہودی نے ایک ( انصاری ) لڑکی کا سر دو پتھروں کے درمیان میں رکھ کر کچل دیا تھا۔ لڑکی سے پوچھا گیا کہ تمہارا سر اس طرح کس نے کیا ہے؟ کیا فلاں شخص نے کیا؟ فلاں نے کیا؟ آخر یہودی کا بھی نام لیا گیا ( جس نے اس کا سر کچل دیا تھا ) تو لڑکی نے سر کے اشارے سے ہاں میں جواب دیا۔ پھر وہ یہودی بلایا گیا اور آخر اس نے بھی اقرار کر لیا اور نبی کریم صلی اللہ علیہ وسلم کے حکم سے اس کا بھی پتھر سے سر کچل دیا گیا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2747,
			"arabicnumber": 2747,
			"text": "ہم سے محمد بن یوسف فریابی نے بیان کیا ورقاء سے ‘ انہوں نے ابن ابی نجیح سے ‘ ان سے عطاء نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ شروع اسلام میں ( میراث کا ) مال اولاد کو ملتا تھا اور والدین کے لیے وصیت ضروری تھی لیکن اللہ تعالیٰ نے جس طرح چاہا اس حکم کو منسوخ کر دیا پھر لڑکے کا حصہ دو لڑکیوں کے برابر قرار دیا اور والدین میں سے ہر ایک کا چھٹا حصہ اور بیوی کا ( اولاد کی موجودگی میں ) آٹھواں حصہ اور ( اولاد کے نہ ہونے کی صورت میں ) چوتھا حصہ قرار دیا۔ اسی طرح شوہر کا ( اولاد نہ ہونے کی صورت میں ) آدھا ( اولاد ہونے کی صورت میں ) چوتھائی حصہ قرار دیا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2748,
			"arabicnumber": 2748,
			"text": "ہم سے محمد بن علاء نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا سفیان ثوری سے ‘ وہ عمارہ سے ‘ ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ایک صحابی نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا یا رسول اللہ! کون سا صدقہ افضل ہے؟ فرمایا یہ کہ صدقہ تندرستی کی حالت میں کر کہ ( تجھ کو اس مال کو باقی رکھنے کی ) خواہش بھی ہو جس سے کچھ سرمایہ جمع ہو جانے کی تمہیں امید ہو اور ( اسے خرچ کرنے کی صورت میں ) محتاجی کا ڈر ہو اور اس میں تاخیر نہ کر کہ جب روح حلق تک پہنچ جائے تو کہنے بیٹھ جائے کہ اتنا مال فلاں کے لیے ‘ فلانے کو اتنا دینا ‘ اب تو فلانے کا ہو ہی گیا ( تو تو دنیا سے چلا ) ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2749,
			"arabicnumber": 2749,
			"text": "ہم سے سلیمان بن داؤد ابوالربیع نے بیان کیا ‘ انہوں نے کہا ہم سے اسمٰعیل بن جعفر نے ‘ انہوں نے کہا ہم سے نافع بن مالک بن ابی عامر ابوسہیل نے ‘ انہوں نے اپنے باپ سے ‘ انہوں نے ابوہریرہ رضی اللہ عنہ سے انہوں نے نبی کریم صلی اللہ علیہ وسلم سے، آپ صلی اللہ علیہ وسلم نے فرمایا ”منافق کی تین نشانیاں ہیں جب بات کہے تو جھوٹ کہے اور جب اس کے پاس امانت رکھیں تو خیانت کرے اور جب وعدہ کرے تو خلاف کرے۔“",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2750,
			"arabicnumber": 2750,
			"text": "ہم سے محمد بن یوسف بیکندی نے بیان کیا ‘ کہا ہم کو امام اوزاعی نے خبر دی ‘ انہوں نے زہری سے ‘ انہوں نے سعید بن مسیب اور عروہ بن زبیر سے کہ حکیم بن حزام رضی اللہ عنہ ( مشہور صحابی ) نے بیان کیا میں نے آپ صلی اللہ علیہ وسلم سے مانگا آپ نے مجھ کو دیا ‘ پھر مانگا پھر آپ نے دیا ‘ پھر فرمانے لگے حکیم یہ دنیا کا روپیہ پیسہ دیکھنے میں خوشنما اور مزے میں شیریں ہے لیکن جو کوئی اس کو سیر چشمی سے لے اس کو برکت ہوتی ہے اور جو کوئی جان لڑا کر حرص کے ساتھ اس کو لے اس کو برکت نہ ہو گی۔ اس کی مثال ایسی ہے جو کماتا ہے لیکن سیر نہیں ہوتا اوپر والا ( دینے والا ) ہاتھ نیچے والے ( لینے والے ) ہاتھ سے بہتر ہے۔ حکیم نے عرض کیا یا رسول اللہ! قسم اس کی جس نے آپ کو سچا پیغمبر کر کے بھیجا ہے میں تو آج سے آپ کے بعد کسی سے کوئی چیز کبھی نہیں لوں گا مرنے تک پھر ( حکیم کا یہ حال رہا ) کہ ابوبکر صدیق رضی اللہ عنہ ان کا سالانہ وظیفہ دینے کے لیے ان کو بلاتے ‘ وہ اس کے لینے سے انکار کرتے۔ پھر عمر رضی اللہ عنہ نے بھی اپنی خلافت میں ان کو بلایا ان کا وظیفہ دینے کے لیے لیکن انہوں نے انکار کیا۔ عمر رضی اللہ عنہ کہنے لگے مسلمانو! تم گواہ رہنا حکیم کو اس کا حق جو لوٹ کے مال میں اللہ نے رکھا ہے دیتا ہوں وہ نہیں لیتا۔ غرض حکیم نے آپ صلی اللہ علیہ وسلم کے بعد پھر کسی شخص سے کوئی چیز قبول نہیں کی ( اپنا وظیفہ بھی بیت المال میں نہ لیا ) یہاں تک کہ ان کی وفات ہو گئی۔ اللہ ان پر رحم کرے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2751,
			"arabicnumber": 2751,
			"text": "ہم سے بشر بن محمد نے بیان کیا ‘ کہا ہم کو عبداللہ بن مبارک نے خبر دی کہا ہم کو یونس نے، انہوں نے زہری سے ‘ انہوں نے کہا مجھ کو سالم نے خبر دی ‘ انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے انہوں نے کہا میں نے آپ صلی اللہ علیہ وسلم سے سنا ‘ آپ صلی اللہ علیہ وسلم فرماتے تھے تم میں سے ہر کوئی نگہبان ہے اور اپنی رعیت کے بارے میں پوچھا جائے گا۔ حاکم بھی نگہبان ہے اپنی رعیت کے بارے میں پوچھا جائے گا اور مرد اپنے گھر والوں کا نگہبان ہے اور اپنی رعیت کے بارے میں پوچھا جائے گا اور عورت اپنے خاوند کے گھر کی نگہبان ہے اپنی رعیت کے بارے میں پوچھی جائے گی اور غلام اپنے صاحب کے مال کا نگہبان ہے اور اپنی رعیت کے بارے میں پوچھا جائے گا۔ ابن عمر رضی اللہ عنہما نے کہا کہ میں سمجھتا ہوں آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ مرد اپنے باپ کے مال کا نگہبان ہے اور اپنی رعیت کے بارے میں پوچھا جائے گا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2752,
			"arabicnumber": 2752,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی ‘ انہوں نے اسحاق بن عبداللہ بن ابی طلحہ سے، انہوں نے انس رضی اللہ عنہ سے سنا ‘ انہوں نے کہا نبی کریم صلی اللہ علیہ وسلم نے ابوطلحہ سے فرمایا ( جب انہوں نے اپنا باغ بیرحاء اللہ کی راہ میں دینا چاہا ) میں مناسب سمجھتا ہوں تو یہ باغ اپنے عزیزوں کو دیدے۔ ابوطلحہ نے کہا بہت خوب ایسا ہی کروں گا۔ پھر ابوطلحہ نے وہ باغ اپنے عزیزوں اور چچا کے بیٹوں میں تقسیم کر دیا اور ابن عباس رضی اللہ عنہما نے کہا جب ( سورۃ الشعراء کی ) یہ آیت اتری «وأنذر عشيرتك الأقربين‏» اور اپنے قریب کے ناطے والوں کو ( اللہ کے عذاب سے ) ڈرا تو آپ صلی اللہ علیہ وسلم قریش کے خاندانوں بنی فہر ‘ بنی عدی کو پکارنے لگے ( ان کو ڈرایا ) اور ابوہریرہ رضی اللہ عنہ نے کہا جب یہ آیت اتری «وأنذر عشيرتك الأقربين‏» آپ صلی اللہ علیہ وسلم نے فرمایا اے قریش کے لوگو! ( اللہ سے ڈرو ) ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2753,
			"arabicnumber": 2753,
			"text": "ہم سے ابوالیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہوں نے زہری سے ‘ کہا مجھ کو سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی کہ ابوہریرہ رضی اللہ عنہ نے کہا جب ( سورۃ الشعراء کی ) یہ آیت اللہ تعالیٰ نے اتاری «وأنذر عشيرتك الأقربين‏» اور اپنے نزدیک ناطے والوں کو اللہ کے عذاب سے ڈرا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قریش کے لوگو! یا ایسا ہی کوئی اور کلمہ تم لوگ اپنی اپنی جانوں کو ( نیک اعمال کے بدل ) مول لے لو ( بچا لو ) میں اللہ کے سامنے تمہارے کچھ کام نہیں آؤں گا ( یعنی اس کی مرضی کے خلاف میں کچھ نہیں کر سکوں گا ) عبد مناف کے بیٹو! میں اللہ کے سامنے تمہارے کچھ کام نہیں آؤں گا۔ عباس عبدالمطلب کے بیٹے! میں اللہ کے سامنے تمہارے کچھ کام نہیں آؤں گا۔ صفیہ میری پھوپھی! اللہ کے سامنے تمہارے کچھ کام نہیں آؤں گا۔ فاطمہ! بیٹی تو چاہے میرا مال مانگ لے لیکن اللہ کے سامنے تیرے کچھ کام نہیں آؤں گا۔ ابوالیمان کے ساتھ حدیث کو اصبغ نے بھی عبداللہ بن وہب سے ‘ انہوں نے یونس سے ‘ انہوں نے ابن شہاب سے روایت کیا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2754,
			"arabicnumber": 2754,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے دیکھا کہ ایک شخص قربانی کا اونٹ ہانکے لیے جا رہا ہے۔ آپ صلی اللہ علیہ وسلم نے اس سے فرمایا کہ اس پر سوار ہو جا۔ اس صاحب نے کہا یا رسول اللہ! یہ قربانی کا اونٹ ہے۔ آپ صلی اللہ علیہ وسلم نے تیسری یا چوتھی بار فرمایا افسوس! سوار بھی ہو جا یا آپ نے «ويلك» کی بجائے «ويحك» فرمایا جس کے معنی بھی وہی ہیں۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2755,
			"arabicnumber": 2755,
			"text": "ہم سے اسمٰعیل بن ابی اویس نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، ان سے ابوالزناد نے، ان نے اعرج سے اور ان ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے دیکھا کہ ایک صاحب قربانی کا اونٹ ہانکے لیے جا رہے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو جا لیکن انہوں نے معذرت کی کہ یا رسول اللہ! یہ تو قربانی کا ہے۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ سوار بھی ہو جا۔ افسوس! یہ کلمہ آپ صلی اللہ علیہ وسلم نے تیسری یا چوتھی مرتبہ فرمایا تھا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2756,
			"arabicnumber": 2756,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو مخلد بن یزید نے خبر دی، انہیں ابن جریج نے خبر دی، کہا کہ مجھے یعلیٰ بن مسلم نے خبر دی، انہوں نے عکرمہ سے سنا، وہ بیان کرتے تھے کہ ہمیں ابن عباس رضی اللہ عنہما نے خبر دی کہ سعد بن عبادہ رضی اللہ عنہ کی ماں عمرہ بنت مسعود کا انتقال ہوا تو وہ ان کی خدمت میں موجود نہیں تھے۔ انہوں نے آ کر رسول اللہ صلی اللہ علیہ وسلم سے پوچھا یا رسول اللہ! میری والدہ کا جب انتقال ہوا تو میں ان کی خدمت میں حاضر نہیں تھا۔ کیا اگر میں کوئی چیز صدقہ کروں تو اس سے انہیں فائدہ پہنچ سکتا ہے؟ آپ صلی اللہ علیہ وسلم نے اثبات میں جواب دیا تو انہوں نے کہا کہ میں آپ کو گواہ بناتا ہوں کہ میرا مخراف نامی باغ ان کی طرف سے صدقہ ہے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2757,
			"arabicnumber": 2757,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے کہا کہ مجھے عبدالرحمٰن بن عبداللہ بن کعب نے خبر دی اور ان سے عبداللہ بن کعب نے بیان کیا کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا ‘ وہ بیان کرتے تھے کہ میں نے عرض کیا یا رسول اللہ! میری توبہ ( غزوہ تبوک میں نہ جانے کی ) قبول ہونے کا شکرانہ یہ ہے کہ میں اپنا مال اللہ اور اس کے رسول کے راستے میں دیدوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اپنے مال کا ایک حصہ اپنے پاس ہی باقی رکھو تو تمہارے حق میں یہ بہتر ہے۔ میں نے عرض کیا کہ پھر میں اپنا خیبر کا حصہ اپنے پاس محفوظ رکھتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2758,
			"arabicnumber": 2758,
			"text": "اور اسماعیل بن جعفر نے بیان کیا کہ مجھے عبدالعزیز بن عبداللہ بن ابی سلمہ نے خبر دی ‘ انہیں اسحاق بن عبداللہ بن ابی طلحہ نے (امام بخاری رحمہ اللہ نے کہا کہ) میں سمجھتا ہوں کہ یہ روایت انہوں نے انس رضی اللہ عنہ سے کی ہے کہ انہوں نے بیان کیا ( جب سورۃ آل عمران کی ) یہ آیت نازل ہوئی «لن تنالوا البر حتى تنفقوا مما تحبون‏» ”تم نیکی ہرگز نہیں پا سکتے جب تک اس مال میں سے خرچ نہ کرو جو تم کو زیادہ پسند ہے۔“ تو ابوطلحہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ! اللہ تبارک و تعالیٰ اپنی کتاب میں فرماتا ہے «لن تنالوا البر حتى تنفقوا مما تحبون‏» ”تم نیکی ہرگز نہیں پا سکتے جب تک اس مال میں سے خرچ نہ کرو جو تم کو زیادہ پسند ہے۔“ اور میرے اموال میں سب سے پسند مجھے بیرحاء ہے۔ بیان کیا کہ بیرحاء ایک باغ تھا۔ رسول اللہ صلی اللہ علیہ وسلم بھی اس میں تشریف لے جایا کرتے ‘ اس کے سائے میں بیٹھتے اور اس کا پانی پیتے ( ابوطلحہ نے کہا کہ ) اس لیے وہ اللہ عزوجل کی راہ میں صدقہ اور رسول اللہ صلی اللہ علیہ وسلم کے لیے ہے۔ میں اس کی نیکی اور اس کے ذخیرہ آخرت ہونے کی امید رکھتا ہوں۔ پس یا رسول اللہ! جس طرح اللہ آپ کو بتائے اسے خرچ کیجئے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا واہ واہ شاباش ابوطلحہ یہ تو بڑا نفع بخش مال ہے ‘ ہم تم سے اسے قبول کر کے پھر تمہارے ہی حوالے کر دیتے ہیں اور اب تم اسے اپنے عزیزوں کو دیدو۔ چنانچہ ابوطلحہ رضی اللہ عنہ نے وہ باغ اپنے عزیزوں کو دے دیا۔ انس رضی اللہ عنہ نے بیان کیا کہ جن لوگوں کو باغ آپ نے دیا تھا ان میں ابی اور حسان رضی اللہ عنہ تھے۔ انہوں نے بیان کیا کہ حسان رضی اللہ عنہ نے اپنا حصہ معاویہ رضی اللہ عنہ کو بیچ دیا تو کسی نے ان سے کہا کہ کیا آپ ابوطلحہ رضی اللہ عنہ کا دیا ہوا مال بیچ رہے ہو؟ حسان رضی اللہ عنہ نے جواب دیا کہ میں کھجور کا ایک صاع روپوں کے ایک صاع کے بدل کیوں نہ بیچوں۔ انس رضی اللہ عنہ نے کہا یہ باغ بنی حدیلہ کے محلہ کے قریب تھا جسے معاویہ رضی اللہ عنہ نے ( بطور قلعہ کے ) تعمیر کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2759,
			"arabicnumber": 2759,
			"text": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ‘ کہا ہم سے ابوعوانہ نے بیان کیا ابوبشر جعفر سے ‘ ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے فرمایا کہ کچھ لوگ گمان کرنے لگے ہیں کہ یہ آیت ( جس ذکر عنوان میں ہوا ) میراث کی آیت منسوخ ہو گئی ہے ‘ نہیں قسم اللہ کی آیت منسوخ نہیں ہوئی البتہ لوگ اس پر عمل کرنے میں سست ہو گئے ہیں۔ ترکے کے لینے والے دو طرح کے ہوتے ہیں ایک وہ جو وارث ہوں ان کو حصہ دیا جائے گا دوسرے وہ جو وارث نہ ہوں ان کو نرمی سے جواب دینے کا حکم ہے۔ وہ یوں کہے میاں میں تم کو دینے کا اختیار نہیں رکھتا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2760,
			"arabicnumber": 2760,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا کہ مجھ سے امام مالک نے بیان کیا ‘ ان سے ہشام نے ‘ ان سے ان کے باپ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ ایک صحابی ( سعد بن عبادہ ) نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ میری والدہ کی موت اچانک واقع ہو گئی ‘ میرا خیال ہے کہ اگر انہیں گفتگو کا موقع ملتا تو وہ صدقہ کرتیں تو کیا میں ان کی طرف سے خیرات کر سکتا ہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں ان کی طرف سے خیرات کر۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2761,
			"arabicnumber": 2761,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ کہا کہ ہم کو امام مالک نے خبر دی ابن شہاب سے ‘ انہیں عبیداللہ بن عبداللہ نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے مسئلہ پوچھا ‘ انہوں نے عرض کیا کہ میری ماں کا انتقال ہو گیا ہے اور اس کے ذمہ ایک نذر تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کی طرف سے نذر پوری کر دے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2762,
			"arabicnumber": 2762,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ‘ کہا کہ ہم کو ہشام بن یوسف نے خبر دی ‘ انہیں ابن جریج نے خبر دی کہا کہ مجھے یعلیٰ بن مسلم نے خبر دی ‘ انہوں نے ابن عباس رضی اللہ عنہما کے غلام عکرمہ سے سنا اور انہیں ابن عباس رضی اللہ عنہما نے خبر دی کہ قبیلہ بنی ساعدہ کے بھائی سعد بن عبادہ رضی اللہ عنہ کی ماں کا انتقال ہوا تو وہ ان کی خدمت میں حاضر نہیں تھے ( بلکہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ دومۃ الجندل میں شریک تھے ) اس لیے وہ آپ صلی اللہ علیہ وسلم کے پاس آئے اور عرض کیا یا رسول اللہ! میری والدہ کا انتقال ہو گیا ہے اور میں اس وقت موجود نہیں تھا تو اگر میں ان کی طرف سے خیرات کروں تو انہیں اس کا فائدہ پہنچے گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں! سعد رضی اللہ عنہ نے اس پر کہا کہ میں آپ کو گواہ بناتا ہوں کہ میرا باغ مخراف نامی ان کی طرف سے خیرات ہے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2763,
			"arabicnumber": 2763,
			"text": "ہم سے ابوالیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی زہری سے کہ عروہ بن زبیر رضی اللہ عنہ ان سے حدیث بیان کرتے تھے انہوں نے عائشہ رضی اللہ عنہا سے آیت «وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء‏» ”اور اگر تم ڈرو کہ یتیموں کے حق میں انصاف نہیں کرو گے تو ( اور ) عورتوں میں سے جو تمہیں پسند ہوں ان سے نکاح کرلو۔“ کا مطلب پوچھا تو عائشہ رضی اللہ عنہا نے فرمایا کہ اس سے مراد وہ یتیم لڑکی ہے جو اپنے ولی کی زیر پرورش ہو ‘ پھر ولی کے دل میں اس کا حسن اور اس کے مال کی طرف سے رغبت نکاح پیدا ہو جائے مگر اس کم مہر پر جو ویسی لڑکیوں کا ہونا چاہئے تو اس طرح نکاح کرنے سے روکا گیا لیکن یہ کہ ولی ان کے ساتھ پورے مہر کی ادائیگی میں انصاف سے کام لیں ( تو نکاح کر سکتے ہیں ) اور انہیں لڑکیوں کے سوا دوسری عورتوں سے نکاح کرنے کا حکم دیا گیا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا تو اللہ عزوجل نے یہ آیت نازل فرمائی «ويستفتونك في النساء قل الله يفتيكم فيهن‏» ”آپ سے لوگ عورتوں کے متعلق پوچھتے ہیں آپ کہہ دیں کہ اللہ تمہیں ان کے بارے میں ہدایت کرتا ہے۔“ عائشہ رضی اللہ عنہا نے کہا کہ پھر اللہ تعالیٰ نے اس آیت میں بیان کر دیا کہ یتیم لڑکی اگر جمال اور مال والی ہو اور ( ان کے ولی ) ان سے نکاح کرنے کے خواہشمند ہوں لیکن پورا مہر دینے میں ان کے ( خاندان کے ) طریقوں کی پابندی نہ کر سکیں تو ( وہ ان سے نکاح مت کریں ) جبکہ مال اور حسن کی کمی کی وجہ سے ان کی طرف انہیں کوئی رغبت نہ ہوتی ہو تو انہیں وہ چھوڑ دیتے اور ان کے سوا کسی دوسری عورت کو تلاش کرتے۔ راوی نے کہا جس طرح ایسے لوگ رغبت نہ ہونے کی صورت میں ان یتیم لڑکیوں کو چھوڑ دیتے ‘ اسی طرح ان کے لیے یہ بھی جائز نہیں کہ جب ان لڑکیوں کی طرف انہیں رغبت ہو تو ان کے پورے مہر کے معاملے میں اور ان کے حقوق ادا کرنے میں انصاف سے کام لیے بغیر ان سے نکاح کریں۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2764,
			"arabicnumber": 2764,
			"text": "ہم سے ہارون بن اشعث نے بیان کیا ‘ کہا کہ ہم سے بنو ہاشم کے غلام ابوسعید نے بیان کیا ‘ ان سے صخر بن جویریہ نے بیان کیا نافع سے اور ان سے ابن عمر رضی اللہ عنہما نے کہ عمر رضی اللہ عنہ نے اپنی ایک جائیداد رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں وقف کر دی ‘ اس جائیداد کا نام ثمغ تھا اور یہ ایک کھجور کا ایک باغ تھا۔ عمر رضی اللہ عنہ نے عرض کیا یا رسول اللہ! مجھے ایک جائیداد ملی ہے اور میرے خیال میں نہایت عمدہ ہے ‘ اس لیے میں نے چاہا کہ اسے صدقہ کر دوں تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اصل مال کو صدقہ کر کہ نہ بیچا جا سکے نہ ہبہ کیا جا سکے اور نہ اس کا کوئی وارث بن سکے ‘ صرف اس کا پھل ( اللہ کی راہ میں ) صرف ہو۔ چنانچہ عمر رضی اللہ عنہ نے اسے صدقہ کر دیا ‘ ان کا یہ صدقہ غازیوں کے لیے ‘ غلام آزاد کرانے کے لیے، محتاجوں اور کمزوروں کے لیے ‘ مسافروں کے لیے اور رشتہ داروں کے لیے تھا اور یہ کہ اس کے نگراں کے لیے اس میں کوئی مضائقہ نہیں ہو گا کہ وہ دستور کے موافق اس میں سے کھائے یا اپنے کسی دوست کو کھلائے بشرطیکہ اس میں سے مال جمع کرنے کا ارادہ نہ رکھتا ہو۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2765,
			"arabicnumber": 2765,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ہشام سے ‘ ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے ( قرآن مجید کی اس آیت ) «ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعرو» ”اور جو شخص مالدار ہو وہ اپنے کو یتیم کے مال سے بالکل روکے رکھے ‘ البتہ جو شخص نادار ہو تو وہ دستور کے مطابق کھا سکتا ہے“ کے بارے میں فرمایا کہ یتیموں کے ولیوں کے بارے میں نازل ہوئی کہ یتیم کے مال میں سے اگر ولی نادار ہو تو دستور کے مطابق اس کے مال میں سے لے سکتا ہے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2766,
			"arabicnumber": 2766,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ‘ ان سے ثور بن زید مدنی نے بیان کیا ‘ ان سے ابوغیث نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”سات گناہوں سے جو تباہ کر دینے والے ہیں بچتے رہو۔“ صحابہ رضی اللہ عنہم نے پوچھا یا رسول اللہ! وہ کون سے گناہ ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”اللہ کے ساتھ کسی کو شریک ٹھہرانا ‘ جادو کرنا ‘ کسی کی ناحق جان لینا کہ جسے اللہ تعالیٰ نے حرام قرار دیا ہے ‘ سود کھانا ‘ یتیم کا مال کھانا ‘ لڑائی میں سے بھاگ جانا ‘ پاک دامن بھولی بھالی ایمان والی عورتوں پر تہمت لگانا۔“",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2767,
			"arabicnumber": 2767,
			"text": "اور امام بخاری رحمہ اللہ نے کہا کہ ہم سے سلیمان بن حرب نے بیان کیا ‘ ان سے حماد بن اسامہ نے بیان کیا ‘ ان سے ایوب نے ‘ ان سے نافع نے بیان کیا کہ ابن عمر رضی اللہ عنہما کو کوئی وصی بناتا تو وہ کبھی انکار نہ کرتے۔ ابن سیرین تابعی رحمہ اللہ کا محبوب مشغلہ یہ تھا کہ یتیم کے مال و جائیداد کے سلسلے میں ان کے خیر خواہوں اور ولیوں کو جمع کرتے تاکہ ان کے لیے کوئی اچھی صورت پیدا کرنے کے لیے غور کریں۔ طاؤس تابعی رحمہ اللہ سے جب یتیموں کے بارے میں کوئی سوال کیا جاتا تو آپ یہ آیت پڑھتے کہ «والله يعلم المفسد من المصلح‏» ”اور اللہ فساد پیدا کرنے والے اور سنوارنے والے کو خوب جانتا ہے۔“ عطاء رحمہ اللہ نے یتیموں کے بارے میں کہا خواہ وہ معمولی قسم کے لوگوں میں ہوں یا بڑے درجے کے ‘ اس کا ولی اس کے حصہ میں سے جیسے اس کے لائق ہو، ویسا اس پر خرچ کرے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2768,
			"arabicnumber": 2768,
			"text": "ہم سے یعقوب بن ابراہیم بن کثیر نے بیان کیا ‘ کہا ہم سے اسماعیل بن علیہ نے بیان کیا ‘ کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا ‘ ان سے انس رضی اللہ عنہ نے بیان کیا کہ ہم سے یعقوب بن ابراہیم بن کثیر نے بیان کیا ‘ کہا ہم سے اسماعیل بن علیہ نے بیان کیا ‘ کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا ‘ ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2769,
			"arabicnumber": 2769,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ‘ کہا ہم سے امام مالک نے ‘ ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ‘ انہوں نے انس بن مالک رضی اللہ عنہ سے سنا آپ بیان کرتے تھے کہ ابوطلحہ رضی اللہ عنہ کھجور کے باغات کے اعتبار سے مدینہ کے انصار میں سب سے بڑے مالدار تھے اور انہیں اپنے تمام مالوں میں مسجد نبوی کے سامنے بیرحاء کا باغ سب سے زیادہ پسند تھا۔ خود نبی کریم صلی اللہ علیہ وسلم بھی اس باغ میں تشریف لے جاتے اور اس کا میٹھا پانی پیتے تھے۔ انس رضی اللہ عنہ نے بیان کیا کہ پھر جب یہ آیت نازل ہوئی «لن تنالوا البر حتى تنفقوا مما تحبون‏» ”نیکی تم ہرگز نہیں حاصل کرو گے جب تک اپنے اس مال سے نہ خرچ کرو جو تمہیں پسند ہوں۔“ تو ابوطلحہ رضی اللہ عنہ اٹھے اور آ کر رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ یا رسول اللہ! اللہ تعالیٰ فرماتا ہے «لن تنالوا البر حتى تنفقوا مما تحبون‏» ”تم نیکی ہرگز نہیں حاصل کر سکو گے جب تک اپنے ان مالوں میں سے نہ خرچ کرو جو تمہیں زیادہ پسند ہوں۔“ اور میرے اموال میں مجھے سب سے زیادہ پسند بیرحاء ہے اور یہ اللہ کے راستہ میں صدقہ ہے ‘ میں اللہ کی بارگاہ سے اس کی نیکی اور ذخیرہ آخرت ہونے کی امید رکھتا ہوں۔ آپ کو جہاں اللہ تعالیٰ بتائے اسے خرچ کریں۔ آپ صلی اللہ علیہ وسلم نے فرمایا شاباش یہ تو بڑا فائدہ بخش مال ہے یا آپ نے بجائے «رابح» رابع کے «رايح» کہا یہ شک عبداللہ بن مسلمہ راوی کو ہوا تھا۔۔۔ اور جو کچھ تم نے کہا میں نے سب سن لیا ہے اور میرا خیال ہے کہ تم اسے اپنے ناطے والوں کو دے دو۔ ابوطلحہ نے عرض کیا یا رسول اللہ! میں ایسا ہی کروں گا۔ چنانچہ انہوں نے اپنے عزیزوں اور اپنے چچا کے لڑکوں میں تقسیم کر دیا۔ اسماعیل ‘ عبداللہ بن یوسف اور یحییٰ بن یحییٰ نے مالک کے واسطہ سے۔ «رابح» کے بجائے «رايح» بیان کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2770,
			"arabicnumber": 2770,
			"text": "ہم سے محمد بن عبدالرحیم نے بیان کیا ‘ کہا ہم کو روح بن عبادہ نے خبر دی ‘ کہا ہم کو زکریا بن اسحاق نے بیان کیا کہ مجھ سے عمرو بن دینار نے بیان کیا عکرمہ سے اور انہوں نے ابن عباس رضی اللہ عنہما سے کہ ایک صحابی سعد بن عبادہ نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وسلم سے پوچھا کہ ان کی ماں کا انتقال ہو گیا ہے ۔ کیا اگر وہ ان کی طرف سے خیرات کریں تو انہیں اس کا فائدہ پہنچے گا ؟ آپ صلی ‌اللہ ‌علیہ ‌وسلم نے جواب دیا کہ ہاں ۔ اس پر ان صحابی نے کہا کہ میرا ایک پُر میوہ باغ ہے اور میں آپ کو گواہ بناتا ہوں کہ میں نے وہ ان کی طرف سے صدقہ کر دیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2771,
			"arabicnumber": 2771,
			"text": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے عبدالوارث نے بیان کیا ‘ ان سے ابوالتیاح یزید بن حمید نے اور ان سے انس رضی اللہ عنہ نے ‘ انہوں نے کہا نبی کریم صلی اللہ علیہ وسلم نے ( مدینہ میں ) مسجد بنانے کا حکم دیا اور بنی نجار سے فرمایا تم اپنے اس باغ کا مجھ سے مول کر لو۔ انہوں نے کہا کہ ہرگز نہیں اللہ کی قسم ہم تو اللہ ہی سے اس کا مول لیں گے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2772,
			"arabicnumber": 2772,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا ‘ کہا ہم سے یزید بن زریع نے بیان کیا ‘ کہا ہم سے عبداللہ بن عون رضی اللہ عنہ نے بیان کیا ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ ہم سے مسدد بن مسرہد نے بیان کیا ‘ کہا ہم سے یزید بن زریع نے بیان کیا ‘ کہا ہم سے عبداللہ بن عون رضی اللہ عنہ نے بیان کیا ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2773,
			"arabicnumber": 2773,
			"text": "ہم سے ابوعاصم نے بیان کیا ‘ انہوں نے کہا ہم سے عبداللہ بن عون نے بیان کیا ‘ ان سے نافع نے بیان کیا ‘ ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ ہم سے ابوعاصم نے بیان کیا ‘ انہوں نے کہا ہم سے عبداللہ بن عون نے بیان کیا ‘ ان سے نافع نے بیان کیا ‘ ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2774,
			"arabicnumber": 2774,
			"text": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے عبدالصمد نے بیان کیا، کہا کہ میں نے اپنے والد (عبدالوارث) سے سنا، ان سے ابوالتیاح نے بیان کیا، کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے عبدالصمد نے بیان کیا، کہا کہ میں نے اپنے والد ( عبدالوارث ) سے سنا، ان سے ابوالتیاح نے بیان کیا، کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2775,
			"arabicnumber": 2775,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن قطان نے بیان کیا، کہا ہم سے عبیداللہ بن عمری نے بیان کیا، کہا کہ مجھ سے نافع نے بیان کیا، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے اپنا ایک گھوڑا اللہ کے راستے میں ( جہاد کرنے کے لیے ) ایک آدمی کو دے دیا۔ یہ گھوڑا آپ صلی اللہ علیہ وسلم کو عمر رضی اللہ عنہ نے دیا تھا ‘ تاکہ آپ صلی اللہ علیہ وسلم جہاد میں کسی کو اس پر سوار کریں۔ پھر عمر رضی اللہ عنہ کو معلوم ہوا کہ جس شخص کو یہ گھوڑا ملا تھا ‘ وہ اس گھوڑے کو بازار میں بیچ رہا ہے۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ کیا وہ اسے خرید سکتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہرگز اسے نہ خرید۔ اپنا دیا ہوا صدقہ واپس نہ لے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2776,
			"arabicnumber": 2776,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی ‘ انہیں ابوالزناد نے ‘ انہیں اعرج نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو آدمی میرے وارث ہیں ‘ وہ روپیہ اشرفی اگر میں چھوڑ جاؤں تو وہ تقسیم نہ کریں ‘ وہ میری بیویوں کا خرچ اور جائیداد کا اہتمام کرنے والے کا خرچ نکالنے کے بعد صدقہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2777,
			"arabicnumber": 2777,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے حماد بن زید نے بیان کیا ‘ ان سے ایوب سختیانی نے ‘ ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ عمر رضی اللہ عنہ نے اپنے وقف میں یہ شرط لگائی تھی کہ اس کا متولی اس میں سے کھا سکتا ہے اور اپنے دوست کو کھلا سکتا ہے لیکن وہ دولت نہ جوڑے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2778,
			"arabicnumber": 2778,
			"text": "عبدان نے بیان کیا کہ مجھے میرے والد نے خبر دی ‘ انہیں شعبہ نے ‘ انہیں ابواسحاق نے ‘ انہیں ابوعبدالرحمٰن نے کہ عبدان نے بیان کیا کہ مجھے میرے والد نے خبر دی ‘ انہیں شعبہ نے ‘ انہیں ابواسحاق نے ‘ انہیں ابوعبدالرحمٰن نے کہ",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2779,
			"arabicnumber": 2779,
			"text": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے عبدالوارث نے بیان کیا ‘ ان سے ابوالتیاح نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا ”اے بنو نجار! تم اپنے باغ کی قیمت مجھ سے وصول کر لو تو انہوں نے عرض کیا کہ ہم اس کی قیمت اللہ تعالیٰ کے سوا کسی سے نہیں چاہتے۔“",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2780,
			"arabicnumber": 2780,
			"text": "امام بخاری رحمہ اللہ نے کہا مجھ سے علی بن عبداللہ مدینی نے کہا ہم سے یحییٰ بن آدم نے ‘ کہا ہم سے ابن ابی زائدہ نے ‘ انہوں نے محمد بن ابی القاسم سے ‘ انہوں نے عبدالملک بن سعید بن جبیر سے ‘ انہوں نے اپنے باپ سے ‘ کہا ہم سے عبداللہ بن عباس رضی اللہ عنہما سے انہوں نے کہا بنی سہم کا ایک شخص تمیم داری اور عدی بن بداء کے ساتھ سفر کو نکلا ‘ وہ ایسے ملک میں جا کر مر گیا جہاں کوئی مسلمان نہ تھا۔ یہ دونوں شخص اس کا متروکہ مال لے کر مدینہ واپس آئے۔ اس کے اسباب میں چاندی کا ایک گلاس گم تھا۔ آپ صلی اللہ علیہ وسلم نے ان دونوں کو قسم کھانے کا حکم فرمایا ( انہوں نے قسم کھا لی ) پھر ایسا ہوا کہ وہ گلاس مکہ میں ملا، انہوں نے کہا ہم نے یہ گلاس تمیم اور عدی سے خریدا ہے۔ اس وقت میت کے دو عزیز ( عمرو بن العاص اور مطلب کھڑے ہوئے اور انہوں نے قسم کھائی کہ یہ ہماری گواہی تمیم اور عدی کی گواہی سے زیادہ معتبر ہے ‘ یہ گلاس میت ہی کا ہے۔ عبداللہ بن عباس رضی اللہ عنہما نے کہا ان ہی کے بارے میں یہ آیت نازل ہوئی «يا أيها الذين آمنوا شهادة بينكم‏» آخر آیت تک۔)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2781,
			"arabicnumber": 2781,
			"text": "ہم سے محمد بن سابق نے بیان کیا یا فضل بن یعقوب نے محمد بن سابق سے (یہ شک خود امام بخاری رحمہ اللہ کو ہے) کہا ہم سے شیبان بن عبدالرحمٰن ابومعاویہ نے بیان کیا ‘ ان سے فراس بن یحییٰ نے بیان کیا ‘ ان سے شعبی نے بیان کیا اور ان سے جابر بن عبداللہ انصاری رضی اللہ عنہ نے بیان کیا کہ ان کے والد ( عبداللہ رضی اللہ عنہ ) احد کی لڑائی میں شہید ہو گئے تھے۔ اپنے پیچھے چھ لڑکیاں چھوڑی تھیں اور قرض بھی۔ جب کھجور کے پھل توڑنے کا وقت آیا تو میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا یا رسول اللہ! آپ کو یہ معلوم ہی ہے کہ میرے والد ماجد احد کی لڑائی میں شہید ہو چکے ہیں اور بہت زیادہ قرض چھوڑ گئے ہیں ‘ میں چاہتا تھا کہ قرض خواہ آپ کو دیکھ لیں ( تاکہ قرض میں کچھ رعایت کر دیں ) لیکن وہ یہودی تھے اور وہ نہیں مانے ‘ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور کھلیان میں ہر قسم کی کھجور الگ الگ کر لو جب میں نے ایسا ہی کر لیا تو آپ صلی اللہ علیہ وسلم کو بلایا ‘ قرض خواہوں نے آپ صلی اللہ علیہ وسلم کو دیکھ کر اور زیادہ سختی شروع کر دی تھی۔ آپ صلی اللہ علیہ وسلم نے جب یہ طرز عمل ملاحظہ فرمایا تو سب سے بڑے کھجور کے ڈھیر کے گرد آپ صلی اللہ علیہ وسلم نے تین چکر لگائے اور وہیں بیٹھ گئے پھر فرمایا کہ اپنے قرض خواہوں کو بلاؤ۔ آپ صلی اللہ علیہ وسلم نے ناپ ناپ کر دینا شروع کیا اور واللہ میرے والد کی تمام امانت ادا کر دی ‘ اللہ گواہ ہے کہ میں اتنے پر بھی راضی تھا کہ اللہ تعالیٰ میرے والد کا تمام قرض ادا کر دے اور میں اپنی بہنوں کیلئے ایک کھجور بھی اس میں سے نہ لے جاؤں لیکن ہوا یہ کہ ڈھیر کے ڈھیر بچ رہے اور میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم جس ڈھیر پر بیٹھے ہوئے تھے اس میں سے تو ایک کھجور بھی نہیں دی گئی تھی۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ «أغروا بي» ( حدیث میں الفاظ ) کے معنی ہیں کہ مجھ پر بھڑکنے اور سختی کرنے لگے۔ اسی معنی میں قرآن مجید کی آیت «فأغرينا بينهم العداوة والبغضاء» میں «فأغرينا» ہے۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 44
			}
		}
	]
}