{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"58": "Jizyah and Mawaada'ah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3157,
			"arabicnumber": 3157,
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3158,
			"arabicnumber": 3158,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، انہیں زہری نے کہا کہ مجھ سے عروہ بن زبیر رضی اللہ عنہ نے بیان کیا، ان سے مسور بن مخرمہ رضی اللہ عنہما نے اور انہیں عمرو بن عوف رضی اللہ عنہ نے خبر دی وہ بنی عامر بن لوی کے حلیف تھے اور جنگ بدر میں شریک تھے۔ انہوں نے ان کو خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوعبیدہ بن جراح رضی اللہ عنہ کو بحرین جزیہ وصول کرنے کے لیے بھیجا تھا۔ آپ صلی اللہ علیہ وسلم نے بحرین کے لوگوں سے صلح کی تھی اور ان پر علاء بن حضرمی رضی اللہ عنہ کو حاکم بنایا تھا۔ جب ابوعبیدہ رضی اللہ عنہ بحرین کا مال لے کر آئے تو انصار کو معلوم ہو گیا کہ ابوعبیدہ رضی اللہ عنہ آ گئے ہیں۔ چنانچہ فجر کی نماز سب لوگوں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھی۔ جب آپ صلی اللہ علیہ وسلم نماز پڑھا چکے تو لوگ آپ صلی اللہ علیہ وسلم کے سامنے آئے۔ آپ صلی اللہ علیہ وسلم انہیں دیکھ کر مسکرائے اور فرمایا کہ میرا خیال ہے کہ تم نے سن لیا ہے کہ ابوعبیدہ کچھ لے کر آئے ہیں؟ انصار رضی اللہ عنہم نے عرض کیا جی ہاں، یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے فرمایا، تمہیں خوشخبری ہو، اور اس چیز کے لیے تم پرامید رہو۔ جس سے تمہیں خوشی ہو گی، لیکن اللہ کی قسم! میں تمہارے بارے میں محتاجی اور فقر سے نہیں ڈرتا۔ مجھے اگر خوف ہے تو اس بات کا کچھ دنیا کے دروازے تم پر اس طرح کھول دئیے جائیں گے جیسے تم سے پہلے لوگوں پر کھول دئیے گئے تھے، تو ایسا نہ ہو کہ تم بھی ان کی طرح ایک دوسرے سے جلنے لگو اور یہ جلنا تم کو بھی اسی طرح تباہ کر دے جیسا کہ پہلے لوگوں کو کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3160,
			"arabicnumber": 3160,
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3161,
			"arabicnumber": 3161,
			"text": "ہم سے سہل بن بکار نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ان سے عمرو بن یحییٰ نے، ان سے عباس ساعدی نے اور ان سے ابو حمید ساعدی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہم غزوہ تبوک میں شریک تھے۔ ایلہ کے حاکم ( یوحنا بن روبہ ) نے نبی کریم صلی اللہ علیہ وسلم کو ایک سفید خچر بھیجا اور آپ صلی اللہ علیہ وسلم نے اسے ایک چادر بطور خلعت کے اور ایک تحریر کے ذریعہ اس کے ملک پر اسے ہی حاکم باقی رکھا۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3162,
			"arabicnumber": 3162,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے ابوجمرہ نے بیان کیا، کہا کہ میں نے جویریہ بن قدامہ تمیمی سے سنا، انہوں نے بیان کیا کہ میں نے عمر بن خطاب رضی اللہ عنہ سے سنا تھا، ( جب وہ زخمی ہوئے ) آپ سے ہم نے عرض کیا تھا کہ ہمیں کوئی وصیت کیجئے! تو آپ نے فرمایا کہ میں تمہیں اللہ تعالیٰ کے عہد کی ( جو تم نے ذمیوں سے کیا ہے ) وصیت کرتا ہوں ( کہ اس کی حفاظت میں کوتاہی نہ کرنا ) کیونکہ وہ تمہارے نبی کا ذمہ ہے اور تمہارے گھر والوں کی روزی ہے ( کہ جزیہ کے روپیہ سے تمہارے بال بچوں کی گزران ہوتی ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3163,
			"arabicnumber": 3163,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، ان سے یحییٰ بن سعید انصاری نے بیان کیا کہ میں نے انس رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے انصار کو بلایا، تاکہ بحرین میں ان کے لیے کچھ زمین لکھ دیں۔ لیکن انہوں نے عرض کیا کہ نہیں! اللہ کی قسم! ( ہمیں اسی وقت وہاں زمین عنایت فرمائیے ) جب اتنی زمین ہمارے بھائی قریش ( مہاجرین ) کے لیے بھی آپ لکھیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جب تک اللہ کو منظور ہے یہ معاش ان کو بھی ( یعنی قریش والوں کو ) ملتی رہے گی۔“ لیکن انصار یہی اصرار کرتے رہے کہ قریش والوں کے لیے بھی سندیں لکھ دیجئیے۔ جب آپ صلی اللہ علیہ وسلم نے انصار سے فرمایا کہ میرے بعد تم یہ دیکھو گے کہ دوسروں کو تم پر ترجیح دی جائے گی، لیکن تم صبر سے کام لینا، تاآنکہ تم آخر میں مجھ سے آ کر ملو ( جنگ اور فساد نہ کرنا ) ۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3165,
			"arabicnumber": 3165,
			"text": "اور ابراہیم بن طہمان نے بیان کیا، ان سے عبدالعزیز بن صہیب نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم کے ہاں بحرین سے خراج کا روپیہ آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے مسجد میں پھیلا دو، بحرین کا وہ مال ان تمام اموال میں سب سے زیادہ تھا جو اب تک رسول اللہ صلی اللہ علیہ وسلم کے یہاں آ چکے تھے۔ اتنے میں عباس رضی اللہ عنہ تشریف لائے اور کہنے لگے کہ یا رسول اللہ! مجھے بھی عنایت فرمائیے ( میں زیر بار ہوں ) کیونکہ میں نے ( بدر کے موقع پر ) اپنا بھی فدیہ ادا کیا تھا اور عقیل رضی اللہ عنہ کا بھی! نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اچھا لے لیجئے۔ چنانچہ انہوں نے اپنے کپڑے میں روپیہ بھر لیا ( لیکن اٹھایا نہ جا سکا ) تو اس میں سے کم کرنے لگے۔ لیکن کم کرنے کے بعد بھی نہ اٹھ سکا تو عرض کیا کہ آپ صلی اللہ علیہ وسلم کسی کو حکم دیں کہ اٹھانے میں میری مدد کرے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہیں ہو سکتا، انہوں نے کہا کہ پھر آپ خود ہی اٹھوا دیں۔ فرمایا کہ یہ بھی نہیں ہو سکتا۔ پھر عباس رضی اللہ عنہ نے اس میں سے کچھ کم کیا، لیکن اس پر بھی نہ اٹھا سکے تو کہا کہ کسی کو حکم دیجئیے کہ وہ اٹھا دے، فرمایا کہ نہیں ایسا نہیں ہو سکتا، انہوں نے کہا پھر آپ ہی اٹھا دیں، آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ بھی نہیں ہو سکتا۔ آخر اس میں سے انہیں پھر کم کرنا پڑا اور تب کہیں جا کے اسے اپنے کاندھے پر اٹھا سکے اور لے کر جانے لگے۔ آپ صلی اللہ علیہ وسلم اس وقت تک انہیں برابر دیکھتے رہے، جب تک وہ ہماری نظروں سے چھپ نہ گئے۔ ان کے حرص پر آپ صلی اللہ علیہ وسلم نے تعجب فرمایا اور آپ اس وقت تک وہاں سے نہ اٹھے جب تک وہاں ایک درہم بھی باقی رہا۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3166,
			"arabicnumber": 3166,
			"text": "ہم سے قیس بن حفص نے بیان کیا، انہوں نے کہا ہم سے عبدالواحد نے بیان کیا، انہوں نے کہا ہم سے حسن بن عمرو نے بیان کیا، انہوں نے کہا کہ ہم سے مجاہد نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس نے کسی ذمی کو ( ناحق ) قتل کیا وہ جنت کی خوشبو بھی نہ پا سکے گا۔ حالانکہ جنت کی خوشبو چالیس سال کی راہ سے سونگھی جا سکتی ہے۔“",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3167,
			"arabicnumber": 3167,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، کہا کہ مجھ سے سعد مقبری نے بیان کیا، ان سے ان کے والد (ابوسعید) نے کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا ہم ابھی مسجد نبوی میں موجود تھے کہ نبی کریم صلی اللہ علیہ وسلم تشریف لائے، اور فرمایا کہ یہودیوں کی طرف چلو۔ چنانچہ ہم روانہ ہوئے اور جب بیت المدراس ( یہودیوں کا مدرسہ ) پہنچے تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسلام لاؤ تو سلامتی کے ساتھ رہو گے اور سمجھ لو کہ زمین اللہ اور اور اس کے رسول کی ہے۔ اور میرا ارادہ ہے کہ تمہیں اس ملک سے نکال دوں، پھر تم میں سے اگر کسی کی جائیداد کی قیمت آئے تو اسے بیچ ڈالے۔ اگر تم اس پر تیار نہیں ہو، تو تمہیں معلوم ہونا چاہئے کہ زمین اللہ اور اس کے رسول ہی کی ہے۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3168,
			"arabicnumber": 3168,
			"text": "ہم سے محمد بن سلام نے بیان کیا، ان سے سفیان بن عیینہ نے بیان کیا، ان سے سلیمان احول نے، انہوں نے سعید بن جبیر سے سنا اور انہوں نے ابن عباس رضی اللہ عنہما سے سنا آپ نے جمعرات کے دن کا ذکر کرتے ہوئے کہا، تمہیں معلوم ہے کہ جمعرات کا دن، ہائے! یہ کون سا دن ہے؟ اس کے بعد وہ اتنا روئے کہ ان کے آنسووں سے کنکریاں تر ہو گئیں۔ سعید نے کہا میں نے عرض کیا، یا ابوعباس! جمعرات کے دن سے کیا مطلب ہے؟ انہوں نے کہا کہ اسی دن رسول اللہ صلی اللہ علیہ وسلم کی تکلیف ( مرض الموت ) میں شدت پیدا ہوئی تھی اور آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ مجھے ( لکھنے کا ) ایک کاغذ دے دو تاکہ میں تمہارے لیے ایک ایسی کتاب لکھ جاؤں، جس کے بعد تم کبھی گمراہ نہ ہو۔ اس پر لوگوں کا اختلاف ہو گیا۔ پھر آپ صلی اللہ علیہ وسلم نے خود ہی فرمایا کہ نبی کی موجودگی میں جھگڑنا غیر مناسب ہے، دوسرے لوگ کہنے لگے، بھلا کیا آپ صلی اللہ علیہ وسلم بےکار باتیں فرمائیں گے اچھا، پھر پوچھ لو، یہ سن کر آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے میری حالت پر چھوڑ دو، کیونکہ اس وقت میں جس عالم میں ہوں، وہ اس سے بہتر ہے جس کی طرف تم مجھے بلا رہے ہو۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے تین باتوں کا حکم فرمایا، کہ مشرکوں کو جزیرہ عرب سے نکال دینا اور وفود کے ساتھ اسی طرح خاطر تواضع کا معاملہ کرنا، جس طرح میں کیا کرتا تھا۔ تیسری بات کچھ بھلی سی تھی، یا تو سعید نے اس کو بیان نہ کیا، یا میں بھول گیا۔ سفیان نے کہا یہ جملہ ( تیسری بات کچھ بھلی سی تھی ) سلیمان احول کا کلام ہے۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3169,
			"arabicnumber": 3169,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، کہا کہ مجھ سے سعید مقبری نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ جب خیبر فتح ہوا تو ( یہودیوں کی طرف سے ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بکری کا یا ایسے گوشت کا ہدیہ پیش کیا گیا جس میں زہر تھا۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جتنے یہودی یہاں موجود ہیں انہیں میرے پاس جمع کرو، چنانچہ وہ سب آ گئے۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دیکھو، میں تم سے ایک بات پوچھوں گا۔ کیا تم لوگ صحیح صحیح جواب دو گے؟ سب نے کہا جی ہاں، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا، تمہارے باپ کون تھے؟ انہوں نے کہا کہ فلاں! آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم جھوٹ بولتے ہو، تمہارے باپ تو فلاں تھے۔ سب نے کہا کہ آپ سچ فرماتے ہیں۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا، اگر میں تم سے ایک اور بات پوچھوں تو تم صحیح واقعہ بیان کر دو گے؟ سب نے کہا جی ہاں، اے ابوالقاسم! اور اگر ہم جھوٹ بھی بولیں گے تو آپ ہماری جھوٹ کو اسی طرح پکڑ لیں گے جس طرح آپ نے ابھی ہمارے باپ کے بارے میں ہمارے جھوٹ کو پکڑ لیا، آپ صلی اللہ علیہ وسلم نے اس کے بعد دریافت فرمایا کہ دوزخ میں جانے والے کون لوگ ہوں گے؟ انہوں نے کہا کہ کچھ دنوں کے لیے تو ہم اس میں داخل ہو جائیں گے لیکن پھر آپ لوگ ہماری جگہ داخل کر دئیے جائیں گے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم اس میں برباد رہو، اللہ گواہ ہے کہ ہم تمہاری جگہ اس میں کبھی داخل نہیں کئے جائیں گے۔ پھر آپ نے دریافت فرمایا کہ اگر میں تم سے کوئی بات پوچھوں تو کیا تم مجھ سے صحیح واقعہ بتا دو گے؟ اس مرتبہ بھی انہوں نے یہی کہا کہ ہاں! اے ابوالقاسم! آپ صلی اللہ علیہ وسلم نے دریافت کیا کہ کیا تم نے اس بکری کے گوشت میں زہر ملایا ہے؟ انہوں نے کہا جی ہاں، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تم نے ایسا کیوں کیا؟ انہوں نے کہا کہ ہمارا مقصد یہ تھا کہ اگر آپ جھوٹے ہیں ( نبوت میں ) تو ہمیں آرام مل جائے گا اور اگر آپ واقعی نبی ہیں تو یہ زہر آپ کو کوئی نقصان نہ پہنچا سکے گا۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3170,
			"arabicnumber": 3170,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے ثابت بن یزید نے بیان کیا، ہم سے عاصم احول نے، کہا کہ میں نے انس رضی اللہ عنہ سے دعا قنوت کے بارے میں پوچھا تو آپ نے فرمایا کہ رکوع سے پہلے ہونی چاہئے، میں نے عرض کیا کہ فلاں صاحب ( محمد بن سیرین ) تو کہتے ہیں کہ آپ نے کہا تھا کہ رکوع کے بعد ہوتی ہے، انس رضی اللہ عنہ نے اس پر کہا تھا کہ انہوں نے غلط کہا ہے۔ پھر انہوں نے ہم سے یہ حدیث بیان کی کہ نبی کریم صلی اللہ علیہ وسلم نے ایک مہینے تک رکوع کے بعد دعا قنوت کی تھی۔ اور آپ نے اس میں بنو سلیم کے قبیلوں کے حق میں بددعا کی تھی۔ انہوں نے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے چالیس یا ستر قرآن کے عالم صحابہ کی ایک جماعت، راوی کو شک تھا، مشرکین کے پاس بھیجی تھی، لیکن بنو سلیم کے لوگ ( جن کا سردار عامر بن طفیل تھا ) ان کے آڑے آئے اور ان کو مار ڈالا۔ حالانکہ نبی کریم صلی اللہ علیہ وسلم سے ان کا معاہدہ تھا۔ ( لیکن انہوں نے دغا دی ) آپ صلی اللہ علیہ وسلم کو کسی معاملہ پر اتنا رنجیدہ اور غمگین نہیں دیکھا جتنا ان صحابہ کی شہادت پر آپ رنجیدہ تھے۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3171,
			"arabicnumber": 3171,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں عمرو بن عبداللہ کے غلام ابوالنضر نے، انہیں ام ہانی بنت ابی طالب کے غلام ابومرہ نے خبر دی، انہوں نے ام ہانی بنت ابی طالب رضی اللہ عنہا سے سنا، آپ بیان کرتی تھیں کہ فتح مکہ کے موقع پر میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ( مکہ میں ) میں نے دیکھا کہ آپ غسل کر رہے تھے اور فاطمہ رضی اللہ عنہا آپ کی صاحبزادی پردہ کئے ہوئے تھیں۔ میں نے آپ کو سلام کیا، تو آپ نے دریافت فرمایا کہ کون صاحبہ ہیں؟ میں نے عرض کیا کہ میں ام ہانی بنت ابی طالب ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا، آؤ اچھی آئیں، ام ہانی! پھر جب آپ صلی اللہ علیہ وسلم غسل سے فارغ ہوئے تو آپ نے کھڑے ہو کر آٹھ رکعت چاشت کی نماز پڑھی۔ آپ صلی اللہ علیہ وسلم صرف ایک کپڑا جسم اطہر پر لپیٹے ہوئے تھے۔ میں نے عرض کیا: یا رسول اللہ! میری ماں کے بیٹے علی رضی اللہ عنہ کہتے ہیں کہ وہ ایک شخص کو جسے میں پناہ دے چکی ہوں، قتل کئے بغیر نہیں رہیں گے۔ یہ شخص ہبیرہ کا فلاں لڑکا ( جعدہ ) ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا، ام ہانی! جسے تم نے پناہ دی، اسے ہماری طرف سے بھی پناہ ہے۔ ام ہانی رضی اللہ عنہا نے بیان کیا کہ یہ وقت چاشت کا تھا۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3172,
			"arabicnumber": 3172,
			"text": "مجھ سے محمد بن سلام نے بیان کیا، کہا ہم کو وکیع نے خبر دی، انہیں اعمش نے، انہیں ابراہیم تیمی نے، ان سے ان کے باپ (یزید بن شریک تیمی) نے بیان کیا کہ علی رضی اللہ عنہ نے ہمارے سامنے خطبہ دیا، جس میں فرمایا کہ کتاب اللہ اور اس ورق میں جو کچھ ہے، اس کے سوا اور کوئی کتاب ( احکام شریعت کی ) ایسی ہمارے پاس نہیں جسے ہم پڑھتے ہوں، پھر آپ نے فرمایا کہ اس میں زخموں کے قصاص کے احکام ہیں اور دیت میں دئیے جانے والے کی عمر کے احکام ہیں اور یہ کہ مدینہ حرم ہے عیر پہاڑی سے فلاں ( احد پہاڑی ) تک۔ اس لیے جس شخص نے کوئی نئی بات ( شریعت کے اندر داخل کی ) یا کسی ایسے شخص کو پناہ دی تو اس پر اللہ، ملائکہ اور انسان سب کی لعنت ہے، نہ اس کی کوئی فرض عبادت قبول ہو گی اور نہ نفل۔ اور یہ بیان ہے جو لونڈی غلام اپنے مالک کے سوا کسی دوسرے کو مالک بنائے اس پر بھی اس طرح ( لعنت ) ہے۔ اور مسلمان مسلمان سب برابر ہیں ہر ایک کا ذمہ یکساں ہے۔ پس جس شخص نے کسی مسلمان کی پناہ میں ( جو کسی کافر کو دی گئی ہو ) دخل اندازی کی تو اس پر بھی اسی طرح لعنت ہے۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3173,
			"arabicnumber": 3173,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے بشر بن مفضل نے، کہا ہم سے یحییٰ بن سعید انصاری نے، ان سے بشیر بن یسار نے اور ان سے سہل بن ابی حثمہ نے بیان کیا کہ عبداللہ بن سہل اور محیصہ بن مسعود بن زید رضی اللہ عنہما خیبر گئے۔ ان دنوں ( خیبر کے یہودیوں سے مسلمانوں کی ) صلح تھی۔ پھر دونوں حضرات ( خیبر پہنچ کر اپنے اپنے کام کے لیے ) جدا ہو گئے۔ اس کے بعد محیصہ رضی اللہ عنہ عبداللہ بن سہل رضی اللہ عنہ کے پاس آئے تو کیا دیکھتے ہیں کہ وہ خون میں لوٹ رہے ہیں۔ کسی نے ان کو قتل کر ڈالا، خیر محیصہ رضی اللہ عنہ نے عبداللہ رضی اللہ عنہ کو دفن کر دیا۔ پھر مدینہ آئے، اس کے بعد عبدالرحمٰن بن سہل ( عبداللہ رضی اللہ عنہ کے بھائی ) اور مسعود کے دونوں صاحبزادے محیصہ اور حویصہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے، گفتگو عبدالرحمٰن رضی اللہ عنہ نے شروع کی، تو آپ صلی اللہ علیہ وسلم نے فرمایا، کہ جو تم لوگوں میں عمر میں بڑے ہوں وہ بات کریں۔ عبدالرحمٰن سب سے کم عمر تھے، وہ چپ ہو گئے۔ اور محیصہ اور حویصہ نے بات شروع کی۔ آپ نے دریافت کیا، کیا تم لوگ اس پر قسم کھا سکتے ہو، کہ جس شخص کو تم قاتل کہہ رہے ہو اس پر تمہارا حق ثابت ہو سکے۔ ان لوگوں نے عرض کیا کہ ہم ایک ایسے معاملے میں کس طرح قسم کھا سکتے ہیں جس کو ہم نے خود اپنی آنکھوں سے نہ دیکھا ہو۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر کیا یہود تمہارے دعوے سے اپنی برات اپنی طرف سے پچاس قسمیں کھا کر کے کر دیں؟ ان لوگوں نے عرض کیا کہ کفار کی قسموں کا ہم کس طرح اعتبار کر سکتے ہیں۔ چنانچہ آپ صلی اللہ علیہ وسلم نے خود اپنے پاس سے ان کو دیت ادا کر دی۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3174,
			"arabicnumber": 3174,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یونس نے، ان سے ابن شہاب نے، انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی، انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی، اور انہیں ابوسفیان بن حرب رضی اللہ عنہ نے خبر دی کہ ہرقل ( فرمانروائے روم ) نے انہیں قریش کے قافلے کے ساتھ بلا بھیجا ( یہ لوگ شام اس زمانے میں تجارت کی غرض سے گئے ہوئے تھے۔ ) جب رسول اللہ صلی اللہ علیہ وسلم نے ابوسفیان سے ( صلح حدیبیہ میں ) قریش کے کافروں کے مقدمہ میں صلح کی تھی۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3175,
			"arabicnumber": 3175,
			"text": "مجھ سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، کہا ہم سے ہشام نے بیان کیا، کہا کہ مجھ سے میرے باپ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم پر جادو کر دیا گیا تھا۔ تو بعض دفعہ ایسا ہوتا کہ آپ سمجھتے کہ میں نے فلاں کام کر لیا ہے۔ حالانکہ آپ نے وہ کام نہ کیا ہوتا۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3176,
			"arabicnumber": 3176,
			"text": "مجھ سے حمیدی نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، کہا ہم سے عبداللہ بن علاء بن زبیر نے بیان کیا، انہوں نے بیان کیا کہ میں نے بسر بن عبیداللہ سے سنا، انہوں نے ابوادریس سے سنا، کہا کہ میں نے عوف بن مالک رضی اللہ عنہ سے سنا، آپ نے بیان کیا کہ میں غزوہ تبوک کے موقع پر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، آپ اس وقت چمڑے کے ایک خیمے میں تشریف فرما تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا، کہ قیامت کی چھ نشانیاں شمار کر لو، میری موت، پھر بیت المقدس کی فتح، پھر ایک وبا جو تم میں شدت سے پھیلے گی جیسے بکریوں میں طاعون پھیل جاتا ہے۔ پھر مال کی کثرت اس درجہ میں ہو گی کہ ایک شخص سو دینار بھی اگر کسی کو دے گا تو اس پر بھی وہ ناراض ہو گا۔ پھر فتنہ اتنا تباہ کن عام ہو گا کہ عرب کا کوئی گھر باقی نہ رہے گا جو اس کی لپیٹ میں نہ آ گیا ہو گا۔ پھر صلح جو تمہارے اور بنی الاصفر ( نصارائے روم ) کے درمیان ہو گی، لیکن وہ دغا کریں گے اور ایک عظیم لشکر کے ساتھ تم پر چڑھائی کریں گے۔ اس میں اسی جھنڈے ہوں گے اور ہر جھنڈے کے ماتحت بارہ ہزار فوج ہو گی ( یعنی نو لاکھ ساٹھ ہزار فوج سے وہ تم پر حملہ آور ہوں گے ) ۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3177,
			"arabicnumber": 3177,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، انہیں حمید بن عبدالرحمٰن نے کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ابوبکر رضی اللہ عنہ نے ( حجۃ الوداع سے پہلے والے حج کے موقع پر ) دسویں ذی الحجہ کے دن بعض دوسرے لوگوں کے ساتھ مجھے بھی منیٰ میں یہ اعلان کرنے بھیجا تھا کہ اس سال کے بعد کوئی مشرک حج کرنے نہ آئے اور کوئی شخص بیت اللہ کا طواف ننگے ہو کر نہ کرے اور حج اکبر کا دن دسویں تاریخ ذی الحجہ کا دن ہے۔ اسے حج اکبر اس لیے کہا گیا کہ لوگ ( عمرہ کو ) حج اصغر کہنے لگے تھے، تو ابوبکر رضی اللہ عنہ نے اس سال مشرکوں سے جو عہد لیا تھا اسے واپس کر دیا، اور دوسرے سال حجۃ الوداع میں جب نبی کریم صلی اللہ علیہ وسلم نے حج کیا تو کوئی مشرک شریک نہیں ہوا۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3178,
			"arabicnumber": 3178,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے اعمش نے، ان سے عبداللہ بن مرہ نے، ان سے مسروق نے، ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، چار عادتیں ایسی ہیں کہ اگر یہ چاروں کسی ایک شخص میں جمع ہو جائیں تو وہ پکا منافق ہے۔ وہ شخص جو بات کرے تو جھوٹ بولے، اور جب وعدہ کرے، تو وعدہ خلافی کرے، اور جب معاہدہ کرے تو اسے پورا نہ کرے۔ اور جب کسی سے لڑے تو گالی گلوچ پر اتر آئے اور اگر کسی شخص کے اندر ان چاروں عادتوں میں سے ایک ہی عادت ہے، تو اس کے اندر نفاق کی ایک عادت ہے جب تک کہ وہ اسے چھوڑ نہ دے۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3179,
			"arabicnumber": 3179,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، انہیں اعمش نے، انہیں ابراہیم تیمی نے، انہیں ان کے باپ (یزید بن شریک تیمی) نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ ہم نے نبی کریم صلی اللہ علیہ وسلم سے بس یہی قرآن مجید لکھا اور جو کچھ اس ورق میں ہے، نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ مدینہ عائر پہاڑی اور فلاں ( کدیٰ ) پہاڑی کے درمیان تک حرم ہے۔ پس جس نے یہاں ( دین میں ) کوئی نئی چیز داخل کی یا کسی ایسے شخص کو اس کے حدود میں پناہ دی تو اس پر اللہ تعالیٰ، ملائکہ اور انسان سب کی لعنت ہو گی۔ نہ اس کا کوئی فرض قبول اور نہ نفل قبول ہو گا۔ اور مسلمان پناہ دینے میں سب برابر ہیں۔ معمولی سے معمولی مسلمان ( عورت یا غلام ) کسی کافر کو پناہ دے سکتے ہیں۔ اور جو کوئی کسی مسلمان کا کیا ہوا عہد توڑ ڈالے اس پر اللہ اور ملائکہ اور انسان سب کی لعنت ہو گی، نہ اس کی کوئی فرض عبادت قبول ہو گی اور نہ نفل! اور جس غلام یا لونڈی نے اپنے آقا اپنے مالک کی اجازت کے بغیر کسی دوسرے کو اپنا مالک بنا لیا، تو اس پر اللہ اور ملائکہ اور انسان سب کی لعنت ہو گی، نہ اس کی کوئی فرض عبادت قبول ہو گی اور نہ نفل",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3180,
			"arabicnumber": 3180,
			"text": "ابوموسیٰ (محمد بن مثنیٰ) نے بیان کیا کہ ہم سے ہاشم بن قاسم نے بیان کیا، ان سے اسحاق بن سعید نے بیان کیا، ان سے ان کے والد سعید بن عمرو نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ اس وقت تمہارا کیا حال ہو گا جب ( جزیہ اور خراج میں سے ) نہ تمہیں درہم ملے گا اور نہ دینار! اس پر کسی نے کہا۔ کہ جناب ابوہریرہ رضی اللہ عنہ آپ کیسے سمجھتے ہیں کہ ایسا ہو گا؟ ابوہریرہ رضی اللہ عنہ نے کہا ہاں اس ذات کی قسم! جس کے ہاتھ میں ابوہریرہ کی جان ہے۔ یہ صادق و مصدوق صلی اللہ علیہ وسلم کا فرمان ہے۔ لوگوں نے پوچھا تھا کہ یہ کیسے ہو جائے گا؟ تو آپ نے فرمایا، جب کہ اللہ اور اس کے رسول کا عہد ( اسلامی حکومت غیر مسلموں سے ان کی جان و مال کی حفاظت کے بارے میں ) توڑا جانے لگے، تو اللہ تعالیٰ بھی ذمیوں کے دلوں کو سخت کر دے گا۔ اور وہ جزیہ دینا بند کر دیں گے ( بلکہ لڑنے کو مستعد ہوں گے ) ۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3181,
			"arabicnumber": 3181,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو ابوحمزہ نے خبر دی، کہا کہ میں نے اعمش سے سنا، انہوں نے بیان کیا کہ میں نے ابووائل سے پوچھا، کیا آپ صفین کی جنگ میں موجود تھے؟ انہوں نے بیان کیا کہ ہاں ( میں تھا ) اور میں نے سہل بن حنیف رضی اللہ عنہ کو یہ کہتے سنا تھا کہ تم لوگ خود اپنی رائے کو غلط سمجھو، جو آپس میں لڑتے مرتے ہو۔ میں نے اپنے تئیں دیکھا جس دن ابوجندل آیا ( یعنی حدیبیہ کے دن ) اگر میں نبی کریم صلی اللہ علیہ وسلم کا حکم پھیر دیتا اور ہم نے جب کسی مصیبت میں ڈر کر تلواریں اپنے کندھوں پر رکھیں تو وہ مصیبت آسان ہو گئی۔ ہم کو اس کا انجام معلوم ہو گیا۔ مگر یہی ایک لڑائی ہے ( جو سخت مشکل ہے اس کا انجام بہتر نہیں معلوم ہوتا ) ۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3182,
			"arabicnumber": 3182,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے، ان سے یزید بن عبدالعزیز نے، ان سے ان کے باپ عبدالعزیز بن سیاہ نے، ان سے حبیب بن ابی ثابت نے بیان کیا، کہا کہ مجھ سے ابووائل نے بیان کیا کہ ہم مقام صفین میں ڈیرے ڈالے ہوئے تھے۔ پھر سہل بن حنیف رضی اللہ عنہ کھڑے ہوئے اور فرمایا اے لوگو! تم خود اپنی رائے کو غلط سمجھو۔ ہم صلح حدیبیہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے، اگر ہمیں لڑنا ہوتا تو اس وقت ضرور لڑتے۔ عمر رضی اللہ عنہ اس موقع پر آئے ( یعنی حدیبیہ میں ) اور عرض کیا، یا رسول اللہ! کیا ہم حق پر اور وہ باطل پر نہیں ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیوں نہیں! عمر رضی اللہ عنہ نے کہا کیا ہمارے مقتول جنت میں اور ان کے مقتول جہنم میں نہیں جائیں گے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، کہ کیوں نہیں! پھر عمر رضی اللہ عنہ نے کہا کہ پھر ہم اپنے دین کے معاملے میں کیوں دبیں؟ کیا ہم ( مدینہ ) واپس چلے جائیں گے، اور ہمارے اور ان کے درمیان اللہ کوئی فیصلہ نہیں کرے گا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ابن خطاب! میں اللہ کا رسول ہوں اور اللہ مجھے کبھی برباد نہیں کرے گا۔“ اس کے بعد عمر رضی اللہ عنہ ابوبکر رضی اللہ عنہ کے پاس گئے اور ان سے وہی سوالات کئے، جو نبی کریم صلی اللہ علیہ وسلم سے ابھی کر چکے تھے۔ انہوں نے بھی یہی کہا کہ آپ صلی اللہ علیہ وسلم اللہ کے رسول ہیں، اور اللہ انہیں کبھی برباد نہیں ہونے دے گا۔ پھر سورۃ فتح نازل ہوئی اور آپ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کو اسے آخر تک پڑھ کر سنایا، تو عمر رضی اللہ عنہ نے عرض کیا کیا یہی فتح ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں! بلا شک یہی فتح ہے۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3183,
			"arabicnumber": 3183,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے حاتم نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے باپ نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ قریش سے جس زمانہ میں رسول اللہ صلی اللہ علیہ وسلم نے ( حدیبیہ کی ) صلح کی تھی، اسی مدت میں میری والدہ ( قتیلہ ) اپنے باپ ( حارث بن مدرک ) کو ساتھ لے کر میرے پاس آئیں، وہ اسلام میں داخل نہیں ہوئی تھیں۔ ( عروہ نے بیان کیا کہ ) اسماء رضی اللہ عنہا نے اس بارے میں آپ صلی اللہ علیہ وسلم سے پوچھا کہ یا رسول اللہ! میری والدہ آئی ہوئی ہیں اور مجھ سے رغبت کے ساتھ ملنا چاہتی ہیں، تو کیا میں ان کے ساتھ صلہ رحمی کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں! ان کے ساتھ صلہ رحمی کر۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3184,
			"arabicnumber": 3184,
			"text": "ہم سے احمد بن عثمان بن حکیم نے بیان کیا، کہا ہم سے شریح بن مسلمہ نے بیان کیا، کہا ہم سے ابراہیم بن یوسف بن ابی اسحاق نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، ان سے ابواسحاق نے بیان کیا، کہا کہ مجھ سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے جب عمرہ کرنا چاہا تو آپ نے مکہ میں داخلہ کے لیے مکہ کے لوگوں سے اجازت لینے کے لیے آدمی بھیجا۔ انہوں نے اس شرط کے ساتھ ( اجازت دی ) کہ مکہ میں تین دن سے زیادہ قیام نہ کریں۔ ہتھیار نیام میں رکھے بغیر داخل نہ ہوں اور ( مکہ کے ) کسی آدمی کو اپنے ساتھ ( مدینہ ) نہ لے جائیں ( اگرچہ وہ جانا چاہے ) انہوں نے بیان کیا کہ پھر ان شرائط کو علی بن ابی طالب رضی اللہ عنہ نے لکھنا شروع کیا اور اس طرح ”یہ محمد اللہ کے رسول کے صلح نامہ کی تحریر ہے۔“ مکہ والوں نے کہا کہ اگر ہم جان لیتے کہ آپ اللہ کے رسول ہیں تو پھر آپ کو روکتے ہی نہیں بلکہ آپ پر ایمان لاتے، اس لیے تمہیں یوں لکھنا چاہئے، ”یہ محمد بن عبداللہ کی صلح نامہ کی تحریر ہے“۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا، اللہ گواہ ہے کہ میں محمد بن عبداللہ ہوں اور اللہ گواہ ہے کہ میں اللہ کا رسول بھی ہوں۔ آپ صلی اللہ علیہ وسلم لکھنا نہیں جانتے تھے۔ راوی نے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ سے فرمایا کہ رسول اللہ کا لفظ مٹا دے۔ علی رضی اللہ عنہ نے عرض کیا کہ اللہ کی قسم! یہ لفظ تو میں کبھی نہ مٹاؤں گا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر مجھے دکھلاؤ، راوی نے بیان کیا کہ علی رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کو وہ لفظ دکھایا۔ اور آپ صلی اللہ علیہ وسلم نے خود اپنے ہاتھ سے اسے مٹا دیا۔ پھر جب آپ صلی اللہ علیہ وسلم مکہ تشریف لے گئے اور ( تین ) دن گزر گئے تو قریش علی رضی اللہ عنہ کے پاس آئے اور کہا کہ اب اپنے ساتھی سے کہو کہ اب یہاں سے چلے جائیں ( علی رضی اللہ عنہ نے بیان کیا کہ ) میں نے اس کا ذکر آپ صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ ہاں، چنانچہ آپ وہاں سے روانہ ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3185,
			"arabicnumber": 3185,
			"text": "ہم سے عبدان بن عثمان نے بیان کیا، انہوں نے کہا کہ مجھے میرے باپ نے خبر دی، انہیں شعبہ نے، انہیں ابواسحاق نے، انہیں عمرو بن میمون نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ مکہ میں ( شروع اسلام کے زمانہ میں رسول اللہ صلی اللہ علیہ وسلم سجدہ کی حالت میں تھے اور قریب ہی قریش کے کچھ لوگ بیٹھے ہوئے تھے۔ پھر عقبہ بن ابی معیط اونٹ کی اوجھڑی لایا اور نبی کریم صلی اللہ علیہ وسلم کی پیٹھ پر اسے ڈال دیا۔ نبی کریم صلی اللہ علیہ وسلم سجدہ سے اپنا سر نہ اٹھا سکے۔ آخر فاطمہ رضی اللہ عنہا آئیں اور آپ صلی اللہ علیہ وسلم کی پیٹھ پر سے اس اوجھڑی کو ہٹایا اور جس نے یہ حرکت کی تھی اسے برا بھلا کہا، نبی کریم صلی اللہ علیہ وسلم نے بھی بددعا کی کہ اے اللہ! قریش کی اس جماعت کو پکڑ۔ اے اللہ! ابوجہل بن ہشام، عتبہ بن ربیعہ، شیبہ بن ربیعہ، عقبہ بن ابی معیط، امیہ بن خلف یا ابی بن خلف کو برباد کر۔ پھر میں نے دیکھا کہ یہ سب بدر کی لڑائی میں قتل کر دئیے گئے۔ اور ایک کنویں میں انہیں ڈال دیا گیا تھا۔ سوا امیہ یا ابی کے کہ یہ شخص بہت بھاری بھر کم تھا۔ جب اسے صحابہ نے کھینچا تو کنویں میں ڈالنے سے پہلے ہی اس کے جوڑ جوڑ الگ ہو گئے۔)",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3186,
			"arabicnumber": 3186,
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3188,
			"arabicnumber": 3188,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد نے بیان کیا، ان سے ایوب نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا ”ہر دغا باز کے لیے قیامت کے دن ایک جھنڈا ہو گا جو اس کی دغا بازی کی علامت کے طور پر ( اس کے پیچھے ) گاڑ دیا جائے گا۔“",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3189,
			"arabicnumber": 3189,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے منصور نے، ان سے مجاہد نے، ان سے طاؤس نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دن فرمایا تھا، اب ( مکہ سے ) ہجرت فرض نہیں رہی۔ البتہ جہاد کی نیت اور جہاد کا حکم باقی ہے۔ اس لیے جب تمہیں جہاد کے لیے نکالا جائے تو فوراً نکل جاؤ اور آپ صلی اللہ علیہ وسلم نے فتح مکہ کے دن یہ بھی فرمایا تھا کہ جس دن اللہ تعالیٰ نے آسمان اور زمین پیدا کئے، اسی دن اس شہر ( مکہ ) کو حرم قرار دے دیا۔ پس یہ شہر اللہ کی حرمت کے ساتھ قیامت تک کے لیے حرام ہی رہے گا، اور مجھ سے پہلے یہاں کسی کے لیے لڑنا جائز نہیں ہوا۔ اور میرے لیے بھی دن کی صرف ایک گھڑی کے لیے جائز کیا گیا۔ پس اب یہ مبارک شہر اللہ تعالیٰ کی حرمت کے ساتھ قیامت تک کے لیے حرام ہے، اس کی حدود میں نہ ( کسی درخت کا ) کانٹا توڑا جائے، نہ یہاں کے شکار کو ستایا جائے، اور کوئی یہاں کی گری ہوئی چیز نہ اٹھائے سوا اس شخص کے جو ( مالک تک چیز کو پہنچانے کے لیے ) اعلان کرے اور نہ یہاں کی ہری گھاس کاٹی جائے۔ اس پر عباس رضی اللہ عنہ نے کہا، یا رسول اللہ! اذخر کی اجازت دے دیجئیے۔ کیونکہ یہ یہاں کے سناروں اور گھروں کی چھتوں پر ڈالنے کے کام آتی ہے۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اذخر کی اجازت ہے۔",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 30
			}
		}
	]
}