{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"6": "Menstrual Periods"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 294,
			"arabicnumber": 294,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان نے، کہا میں نے عبدالرحمٰن بن قاسم سے سنا، کہا میں نے قاسم سے سنا۔ وہ کہتے تھے میں نے عائشہ رضی اللہ عنہا سے سنا۔ آپ فرماتی تھیں کہ ہم حج کے ارادہ سے نکلے۔ جب ہم مقام سرف میں پہنچے تو میں حائضہ ہو گئی اور اس رنج میں رونے لگی کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے، آپ صلی اللہ علیہ وسلم نے پوچھا تمہیں کیا ہو گیا۔ کیا حائضہ ہو گئی ہو۔ میں نے کہا، ہاں! آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایک ایسی چیز ہے جس کو اللہ تعالیٰ نے آدم کی بیٹیوں کے لیے لکھ دیا ہے۔ اس لیے تم بھی حج کے افعال پورے کر لو۔ البتہ بیت اللہ کا طواف نہ کرنا۔ عائشہ رضی اللہ عنہا نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گائے کی قربانی کی۔ ( سرف ایک مقام مکہ سے چھ سات میل کے فاصلہ پر ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 295,
			"arabicnumber": 295,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہمیں خبر دی مالک نے ہشام بن عروہ سے، وہ اپنے والد سے، وہ عائشہ رضی اللہ عنہا سے نقل کرتے ہیں کہ آپ نے فرمایا میں رسول اللہ صلی اللہ علیہ وسلم کے سر مبارک کو حائضہ ہونے کی حالت میں بھی کنگھا کیا کرتی تھی۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 296,
			"arabicnumber": 296,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا، انہوں نے کہا ابن جریج نے انہیں خبر دی، انہوں نے کہا مجھے ہشام بن عروہ نے عروہ کے واسطے سے بتایا کہ ان سے سوال کیا گیا، کیا حائضہ بیوی میری خدمت کر سکتی ہے، یا ناپاکی کی حالت میں عورت مجھ سے نزدیک ہو سکتی ہے؟ عروہ نے فرمایا میرے نزدیک تو اس میں کوئی حرج نہیں ہے۔ اس طرح کہ عورتیں میری بھی خدمت کرتی ہیں اور اس میں کسی کے لیے بھی کوئی حرج نہیں۔ اس لیے کہ مجھے عائشہ رضی اللہ عنہا نے خبر دی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کو حائضہ ہونے کی حالت میں کنگھا کیا کرتی تھیں اور رسول اللہ صلی اللہ علیہ وسلم اس وقت مسجد میں معتکف ہوتے۔ آپ اپنا سر مبارک قریب کر دیتے اور عائشہ رضی اللہ عنہا اپنے حجرہ ہی سے کنگھا کر دیتیں، حالانکہ وہ حائضہ ہوتیں۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 297,
			"arabicnumber": 297,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے زہیر سے سنا، انہوں نے منصور بن صفیہ سے کہ ان کی ماں نے ان سے بیان کیا کہ عائشہ رضی اللہ عنہا نے ان سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم میری گود میں سر رکھ کر قرآن مجید پڑھتے، حالانکہ میں اس وقت حیض والی ہوتی تھی۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 298,
			"arabicnumber": 298,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے ہشام نے یحییٰ بن کثیر کے واسطہ سے بیان کیا، انہوں نے ابوسلمہ سے کہ زینب بنت ام سلمہ نے ان سے بیان کیا اور ان سے ام سلمہ رضی اللہ عنہا نے کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک چادر میں لیٹی ہوئی تھی، اتنے میں مجھے حیض آ گیا۔ اس لیے میں آہستہ سے باہر نکل آئی اور اپنے حیض کے کپڑے پہن لیے۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا کیا تمہیں نفاس آ گیا ہے؟ میں نے عرض کیا ہاں۔ پھر مجھے آپ صلی اللہ علیہ وسلم نے بلا لیا، اور میں چادر میں آپ صلی اللہ علیہ وسلم کے ساتھ لیٹ گئی۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 301,
			"arabicnumber": 301,
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 302,
			"arabicnumber": 302,
			"text": "ہم سے اسماعیل بن خلیل نے بیان کیا، کہا ہم سے علی بن مسہر نے، ہم سے ابواسحاق سلیمان بن فیروز شیبانی نے عبدالرحمٰن بن اسود کے واسطہ سے، وہ اپنے والد اسود بن یزید سے، وہ عائشہ رضی اللہ عنہا سے کہ آپ نے فرمایا ہم ازواج میں سے کوئی جب حائضہ ہوتی، اس حالت میں رسول اللہ صلی اللہ علیہ وسلم اگر مباشرت کا ارادہ کرتے تو آپ صلی اللہ علیہ وسلم ازار باندھنے کا حکم دے دیتے باوجود حیض کی زیادتی کے۔ پھر بدن سے بدن ملاتے، آپ نے کہا تم میں ایسا کون ہے جو نبی کریم صلی اللہ علیہ وسلم کی طرح اپنی شہوت پر قابو رکھتا ہو۔ اس حدیث کی متابعت خالد اور جریر نے شیبانی کی روایت سے کی ہے۔ ( یہاں بھی مباشرت سے ساتھ لیٹنا بیٹھنا مراد ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 303,
			"arabicnumber": 303,
			"text": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا، انہوں نے کہا ہم سے عبدالواحد بن زیاد نے بیان کیا، انہوں نے کہا ہم سے ابواسحاق شیبانی نے بیان کیا، انہوں نے کہا ہم سے عبداللہ بن شداد نے بیان کیا، انہوں نے کہا میں نے میمونہ سے سنا، انہوں نے کہا کہ جب نبی کریم صلی اللہ علیہ وسلم اپنی بیویوں میں سے کسی سے مباشرت کرنا چاہتے اور وہ حائضہ ہوتی، تو آپ صلی اللہ علیہ وسلم کے حکم سے، وہ پہلے ازار باندھ لیتیں۔ اور سفیان نے شیبانی سے اس کو روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 304,
			"arabicnumber": 304,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا، انہوں نے کہا مجھے زید نے اور یہ زید اسلم کے بیٹے ہیں، انہوں نے عیاض بن عبداللہ سے، انہوں نے ابو سعید خدری رضی اللہ عنہ سے کہ آپ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم عید الاضحی یا عیدالفطر میں عیدگاہ تشریف لے گئے۔ وہاں آپ صلی اللہ علیہ وسلم عورتوں کے پاس سے گزرے اور فرمایا اے عورتوں کی جماعت! صدقہ کرو، کیونکہ میں نے جہنم میں زیادہ تم ہی کو دیکھا ہے۔ انہوں نے کہا یا رسول اللہ! ایسا کیوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لعن طعن بہت کرتی ہو اور شوہر کی ناشکری کرتی ہو، باوجود عقل اور دین میں ناقص ہونے کے میں نے تم سے زیادہ کسی کو بھی ایک عقلمند اور تجربہ کار آدمی کو دیوانہ بنا دینے والا نہیں دیکھا۔ عورتوں نے عرض کی کہ ہمارے دین اور ہماری عقل میں نقصان کیا ہے یا رسول اللہ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کیا عورت کی گواہی مرد کی گواہی سے نصف نہیں ہے؟ انہوں نے کہا، جی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا بس یہی اس کی عقل کا نقصان ہے۔ پھر آپ نے پوچھا کیا ایسا نہیں ہے کہ جب عورت حائضہ ہو تو نہ نماز پڑھ سکتی ہے نہ روزہ رکھ سکتی ہے، عورتوں نے کہا ایسا ہی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہی اس کے دین کا نقصان ہے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 305,
			"arabicnumber": 305,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا، انہوں نے عبدالرحمٰن بن قاسم سے، انہوں نے قاسم بن محمد سے، وہ عائشہ رضی اللہ عنہا سے، آپ نے فرمایا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کے لیے اس طرح نکلے کہ ہماری زبانوں پر حج کے علاوہ اور کوئی ذکر ہی نہ تھا۔ جب ہم مقام سرف پہنچے تو مجھے حیض آ گیا۔ ( اس غم سے ) میں رو رہی تھی کہ نبی کریم صلی اللہ علیہ وسلم تشریف لائے، آپ صلی اللہ علیہ وسلم نے پوچھا کہ کیوں رو رہی ہو؟ میں نے کہا کاش! میں اس سال حج کا ارادہ ہی نہ کرتی۔ آپ صلی اللہ علیہ وسلم نے فرمایا شاید تمہیں حیض آ گیا ہے۔ میں نے کہا جی ہاں۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ چیز تو اللہ تعالیٰ نے آدم کی بیٹیوں کے لیے مقرر کر دی ہے۔ اس لیے تم جب تک پاک نہ ہو جاؤ طواف بیت اللہ کے علاوہ حاجیوں کی طرح تمام کام انجام دو۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 306,
			"arabicnumber": 306,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم سے امام مالک نے ہشام بن عروہ کے واسطہ سے بیان کیا، انہوں نے اپنے والد سے، انہوں نے عائشہ رضی اللہ عنہا سے، آپ نے بیان کیا کہ فاطمہ ابی حبیش کی بیٹی نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ یا رسول اللہ! میں تو پاک ہی نہیں ہوتی، تو کیا میں نماز بالکل چھوڑ دوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ رگ کا خون ہے حیض نہیں اس لیے جب حیض کے دن ( جن میں کبھی پہلے تمہیں عادتاً آیا کرتا تھا ) آئیں تو نماز چھوڑ دے اور جب اندازہ کے مطابق وہ دن گزر جائیں، تو خون دھو ڈال اور نماز پڑھ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 307,
			"arabicnumber": 307,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہمیں امام مالک نے بیان کیا، انہوں نے ہشام بن عروہ کے واسطے سے، انہوں نے فاطمہ بنت منذر سے، انہوں نے اسماء بنت ابی بکر صدیق رضی اللہ عنہما سے، انہوں نے کہا کہ ایک عورت نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا۔ اس نے پوچھا کہ یا رسول اللہ! آپ ایک ایسی عورت کے متعلق کیا فرماتے ہیں جس کے کپڑے پر حیض کا خون لگ گیا ہو۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر کسی عورت کے کپڑے پر حیض کا خون لگ جائے تو چاہیے کہ اسے رگڑ ڈالے، اس کے بعد اسے پانی سے دھوئے، پھر اس کپڑے میں نماز پڑھ لے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 308,
			"arabicnumber": 308,
			"text": "ہم سے اصبغ نے بیان کیا، انہوں نے کہا مجھ سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا مجھ سے عمرو بن حارث نے عبدالرحمٰن بن قاسم کے واسطے سے بیان کیا، انہوں نے اپنے والد قاسم بن محمد سے بیان کیا، وہ عائشہ رضی اللہ عنہا سے کہ آپ نے فرمایا کہ ہمیں حیض آتا تو کپڑے کو پاک کرتے وقت ہم خون کو مل دیتے، پھر اس جگہ کو دھو لیتے اور تمام کپڑے پر پانی بہا دیتے اور اسے پہن کر نماز پڑھتے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 309,
			"arabicnumber": 309,
			"text": "ہم سے اسحاق بن شاہین ابوبشر واسطی نے بیان کیا، انہوں نے کہا ہم سے خالد بن عبداللہ نے بیان کیا، انہوں نے خالد بن مہران سے، انہوں نے عکرمہ سے، انہوں نے عائشہ رضی اللہ عنہا سے کہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کی بعض ازواج نے اعتکاف کیا، حالانکہ وہ مستحاضہ تھیں اور انہیں خون آتا تھا۔ اس لیے خون کی وجہ سے طشت اکثر اپنے نیچے رکھ لیتیں۔ اور عکرمہ نے کہا کہ عائشہ رضی اللہ عنہا نے کسم کا پانی دیکھا تو فرمایا یہ تو ایسا ہی معلوم ہوتا ہے جیسے فلاں صاحبہ کو استحاضہ کا خون آتا تھا۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 310,
			"arabicnumber": 310,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے یزید بن زریع نے خالد سے، وہ عکرمہ سے، وہ عائشہ رضی اللہ عنہا سے، آپ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کی ازواج میں سے ایک نے اعتکاف کیا۔ وہ خون اور زردی ( نکلتے ) دیکھتیں، طشت ان کے نیچے ہوتا اور نماز ادا کرتی تھیں۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 311,
			"arabicnumber": 311,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے خالد کے واسطہ سے بیان کیا، وہ عکرمہ سے وہ عائشہ رضی اللہ عنہا سے کہ بعض امہات المؤمنین نے اعتکاف کیا حالانکہ وہ مستحاضہ تھیں۔ ( اوپر والی روایت میں ان ہی کا ذکر ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 312,
			"arabicnumber": 312,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن نافع نے بیان کیا، انہوں نے عبداللہ ابن ابی نجیح سے، انہوں نے مجاہد سے کہ عائشہ رضی اللہ عنہا نے فرمایا کہ ہمارے پاس صرف ایک کپڑا ہوتا تھا، جسے ہم حیض کے وقت پہنتے تھے۔ جب اس میں خون لگ جاتا تو اس پر تھوک ڈال لیتے اور پھر اسے ناخنوں سے مسل دیتے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 313,
			"arabicnumber": 313,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، انہوں نے کہا ہم سے حماد بن زید نے ایوب سختیانی سے، انہوں نے حفصہ سے، وہ ام عطیہ سے، آپ نے فرمایا کہ ہمیں کسی میت پر تین دن سے زیادہ سوگ کرنے سے منع کیا جاتا تھا۔ لیکن شوہر کی موت پر چار مہینے دس دن کے سوگ کا حکم تھا۔ ان دنوں میں ہم نہ سرمہ لگاتیں نہ خوشبو اور عصب ( یمن کی بنی ہوئی ایک چادر جو رنگین بھی ہوتی تھی ) کے علاوہ کوئی رنگین کپڑا ہم استعمال نہیں کرتی تھیں اور ہمیں ( عدت کے دنوں میں ) حیض کے غسل کے بعد کست اظفار استعمال کرنے کی اجازت تھی اور ہمیں جنازہ کے پیچھے چلنے سے منع کیا جاتا تھا۔ اس حدیث کو ہشام بن حسان نے حفصہ سے، انہوں نے ام عطیہ سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 314,
			"arabicnumber": 314,
			"text": "ہم سے یحییٰ بن موسیٰ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے منصور بن صفیہ سے، انہوں نے اپنی ماں صفیہ بنت شیبہ سے، وہ عائشہ رضی اللہ عنہا سے کہ آپ نے فرمایا کہ ایک انصاریہ عورت نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ میں حیض کا غسل کیسے کروں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مشک میں بسا ہوا کپڑا لے کر اس سے پاکی حاصل کر۔ اس نے پوچھا۔ اس سے کس طرح پاکی حاصل کروں، آپ صلی اللہ علیہ وسلم نے فرمایا، اس سے پاکی حاصل کر۔ اس نے دوبارہ پوچھا کہ کس طرح؟ آپ صلی اللہ علیہ وسلم نے فرمایا سبحان اللہ! پاکی حاصل کر۔ پھر میں نے اسے اپنی طرف کھینچ لیا اور کہا کہ اسے خون لگی ہوئی جگہوں پر پھیر لیا کر۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 315,
			"arabicnumber": 315,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے وہیب بن خالد نے، کہا ہم سے منصور بن عبدالرحمٰن نے اپنی والدہ صفیہ سے، وہ عائشہ سے کہ انصاریہ عورت نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ میں حیض کا غسل کیسے کروں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک مشک میں بسا ہوا کپڑا لے اور پاکی حاصل کر، یہ آپ صلی اللہ علیہ وسلم نے تین دفعہ فرمایا۔ پھر نبی کریم صلی اللہ علیہ وسلم شرمائے اور آپ صلی اللہ علیہ وسلم نے اپنا چہرہ مبارک پھیر لیا، یا فرمایا کہ اس سے پاکی حاصل کر۔ پھر میں نے انہیں پکڑ کر کھینچ لیا اور نبی کریم صلی اللہ علیہ وسلم جو بات کہنی چاہتے تھے وہ میں نے اسے سمجھائی۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 316,
			"arabicnumber": 316,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے، کہا ہم سے ابن شہاب زہری نے عروہ کے واسطہ سے کہ عائشہ رضی اللہ عنہا نے بتلایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ حجۃ الوداع کیا، میں تمتع کرنے والوں میں تھی اور ہدی ( یعنی قربانی کا جانور ) اپنے ساتھ نہیں لے گئی تھی۔ عائشہ رضی اللہ عنہا نے اپنے متعلق بتایا کہ پھر وہ حائضہ ہو گئیں اور عرفہ کی رات آ گئی اور ابھی تک وہ پاک نہیں ہوئی تھیں۔ اس لیے انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ یا رسول اللہ! آج عرفہ کی رات ہے اور میں عمرہ کی نیت کر چکی تھی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے سر کو کھول ڈال اور کنگھا کر اور عمرہ کو چھوڑ دے۔ میں نے ایسا ہی کیا۔ پھر میں نے حج پورا کیا۔ اور لیلۃ الحصبہ میں عبدالرحمٰن بن ابوبکر کو نبی کریم صلی اللہ علیہ وسلم نے حکم دیا۔ وہ مجھے اس عمرہ کے بدلہ میں جس کی نیت میں نے کی تھی تنعیم سے ( دوسرا ) عمرہ کرا لائے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 317,
			"arabicnumber": 317,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے ابواسامہ حماد نے ہشام بن عروہ کے واسطے سے بیان کیا، انہوں نے اپنے والد سے، انہوں نے عائشہ رضی اللہ عنہا سے کہ انہوں نے فرمایا ہم ذی الحجہ کا چاند دیکھتے ہی نکلے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس کا دل چاہے تو اسے عمرہ کا احرام باندھ لینا چاہیے۔ کیونکہ اگر میں ہدی ساتھ نہ لاتا تو میں بھی عمرہ کا احرام باندھتا۔ اس پر بعض صحابہ نے عمرہ کا احرام باندھا اور بعض نے حج کا۔ میں بھی ان لوگوں میں سے تھی جنہوں نے عمرہ کا احرام باندھا تھا۔ مگر عرفہ کا دن آ گیا اور میں حیض کی حالت میں تھی۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق شکایت کی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ عمرہ چھوڑ اور اپنا سر کھول اور کنگھا کر اور حج کا احرام باندھ لے۔ میں نے ایسا ہی کیا۔ یہاں تک کہ جب حصبہ کی رات آئی تو رسول اللہ صلی اللہ علیہ وسلم نے میرے ساتھ میرے بھائی عبدالرحمٰن بن ابی بکر کو بھیجا۔ میں تنعیم میں گئی اور وہاں سے اپنے عمرہ کے بدلے دوسرے عمرہ کا احرام باندھا۔ ہشام نے کہا کہ ان میں سے کسی بات کی وجہ سے بھی نہ ہدی واجب ہوئی اور نہ روزہ اور نہ صدقہ۔ ( تنعیم حد حرم سے قریب تین میل دور ایک مقام کا نام ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 318,
			"arabicnumber": 318,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے حماد بن زید نے عبیداللہ بن ابی بکر کے واسطے سے، وہ انس بن مالک رضی اللہ عنہ سے، وہ نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ رحم مادر میں اللہ تعالیٰ نے ایک فرشتہ مقرر کیا ہے۔ وہ کہتا ہے کہ اے رب! اب یہ «نطفة» ہے، اے رب! اب یہ «علقة» ہو گیا ہے، اے رب! اب یہ «مضغة‏» ہو گیا ہے۔ پھر جب اللہ چاہتا ہے کہ اس کی خلقت پوری کرے تو کہتا ہے کہ مذکر یا مونث، بدبخت ہے یا نیک بخت، روزی کتنی مقدر ہے اور عمر کتنی۔ پس ماں کے پیٹ ہی میں یہ تمام باتیں فرشتہ لکھ دیتا ہے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 319,
			"arabicnumber": 319,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، انہوں نے عقیل بن خالد سے، انہوں نے ابن شہاب سے، انہوں نے عروہ بن زبیر سے، انہوں نے عائشہ رضی اللہ عنہا سے، انہوں نے کہا ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ حجۃ الوداع کے سفر میں نکلے، ہم میں سے بعض نے عمرہ کا احرام باندھا اور بعض نے حج کا، پھر ہم مکہ آئے اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے عمرہ کا احرام باندھا ہو اور ہدی ساتھ نہ لایا ہو تو وہ حلال ہو جائے اور جس نے عمرہ کا احرام باندھا ہو اور وہ ہدی بھی ساتھ لایا ہو تو وہ ہدی کی قربانی سے پہلے حلال نہ ہو گا۔ اور جس نے حج کا احرام باندھا ہو تو اسے حج پورا کرنا چاہیے۔ عائشہ رضی اللہ عنہا نے کہا کہ میں حائضہ ہو گئی اور عرفہ کا دن آ گیا۔ میں نے صرف عمرہ کا احرام باندھا تھا مجھے نبی کریم صلی اللہ علیہ وسلم نے حکم دیا کہ میں اپنا سر کھول لوں، کنگھا کر لوں اور حج کا احرام باندھ لوں اور عمرہ چھوڑ دوں، میں نے ایسا ہی کیا اور اپنا حج پورا کر لیا۔ پھر میرے ساتھ نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن ابی بکر کو بھیجا اور مجھ سے فرمایا کہ میں اپنے چھوٹے ہوئے عمرہ کے عوض تنعیم سے دوسرا عمرہ کروں۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 320,
			"arabicnumber": 320,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے ہشام بن عروہ سے، وہ اپنے باپ سے، وہ عائشہ سے کہ فاطمہ بنت ابی حبیش کو استحاضہ کا خون آیا کرتا تھا۔ تو انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ رگ کا خون ہے اور حیض نہیں ہے۔ اس لیے جب حیض کے دن آئیں تو نماز چھوڑ دیا کر اور جب حیض کے دن گزر جائیں تو غسل کر کے نماز پڑھ لیا کر۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 321,
			"arabicnumber": 321,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ہمام بن یحییٰ نے، کہا ہم سے قتادہ نے، کہا مجھ سے معاذہ بنت عبداللہ نے کہ ایک عورت نے عائشہ رضی اللہ عنہا سے پوچھا کہ جس زمانہ میں ہم پاک رہتے ہیں۔ ( حیض سے ) کیا ہمارے لیے اسی زمانہ کی نماز کافی ہے۔ اس پر عائشہ رضی اللہ عنہا نے فرمایا کہ کیا تم حروریہ ہو؟ ہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں حائضہ ہوتی تھیں اور آپ ہمیں نماز کا حکم نہیں دیتے تھے۔ یا عائشہ رضی اللہ عنہا نے یہ فرمایا کہ ہم نماز نہیں پڑھتی تھیں۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 322,
			"arabicnumber": 322,
			"text": "ہم سے سعد بن حفص نے بیان کیا، انہوں نے کہا ہم سے شیبان نحوی نے بیان کیا، انہوں نے یحییٰ بن ابی کثیر سے، انہوں نے ابوسلمہ سے، انہوں نے زینب بنت ابی سلمہ سے، انہوں نے بیان کیا کہ ام سلمہ رضی اللہ عنہا نے فرمایا کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ چادر میں لیٹی ہوئی تھی کہ مجھے حیض آ گیا، اس لیے میں چپکے سے نکل آئی اور اپنے حیض کے کپڑے پہن لیے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، کیا تمہیں حیض آ گیا ہے؟ میں نے کہا جی ہاں۔ پھر مجھے آپ نے بلا لیا اور اپنے ساتھ چادر میں داخل کر لیا۔ زینب نے کہا کہ مجھ سے ام سلمہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم روزے سے ہوتے اور اسی حالت میں ان کا بوسہ لیتے۔ اور میں نے اور نبی کریم صلی اللہ علیہ وسلم نے ایک ہی برتن میں جنابت کا غسل کیا۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 323,
			"arabicnumber": 323,
			"text": "ہم سے معاذ بن فضالہ نے بیان کیا، کہا ہم سے ہشام دستوائی نے یحییٰ بن ابی کثیر سے، وہ ابوسلمہ سے، وہ زینب بنت ابی سلمہ سے، وہ ام سلمہ سے، انہوں نے بتلایا کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک چادر میں لیٹی ہوئی تھی کہ مجھے حیض آ گیا، میں چپکے سے چلی گئی اور حیض کے کپڑے بدل لیے، آپ نے پوچھا کیا تجھ کو حیض آ گیا ہے۔ میں نے کہا، جی ہاں! پھر مجھے آپ نے بلا لیا اور میں آپ کے ساتھ چادر میں لیٹ گئی۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 324,
			"arabicnumber": 324,
			"text": "ہم سے محمد بن سلام بیکندی نے بیان کیا، کہا ہم سے عبدالوہاب ثقفی نے ایوب سختیانی سے، وہ حفصہ بنت سیرین سے، انہوں نے فرمایا کہ ہم اپنی کنواری جوان بچیوں کو عیدگاہ جانے سے روکتی تھیں، پھر ایک عورت آئی اور بنی خلف کے محل میں اتریں اور انہوں نے اپنی بہن ( ام عطیہ ) کے حوالہ سے بیان کیا، جن کے شوہر نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ لڑائیوں میں شریک ہوئے تھے اور خود ان کی اپنی بہن اپنے شوہر کے ساتھ چھ جنگوں میں گئی تھیں۔ انہوں نے بیان کیا کہ ہم زخمیوں کی مرہم پٹی کیا کرتی تھیں اور مریضوں کی خبرگیری بھی کرتی تھیں۔ میری بہن نے ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ اگر ہم میں سے کسی کے پاس چادر نہ ہو تو کیا اس کے لیے اس میں کوئی حرج ہے کہ وہ ( نماز عید کے لیے ) باہر نہ نکلے۔ آپ صلی اللہ علیہ وسلم نے فرمایا اس کی ساتھی عورت کو چاہیے کہ اپنی چادر کا کچھ حصہ اسے بھی اڑھا دے، پھر وہ خیر کے مواقع پر اور مسلمانوں کی دعاؤں میں شریک ہوں، ( یعنی عیدگاہ جائیں ) پھر جب ام عطیہ رضی اللہ عنہا آئیں تو میں نے ان سے بھی یہی سوال کیا۔ انہوں نے فرمایا، میرا باپ آپ پر فدا ہو، ہاں آپ صلی اللہ علیہ وسلم نے یہ فرمایا تھا۔ اور ام عطیہ رضی اللہ عنہا جب بھی نبی کریم صلی اللہ علیہ وسلم کا ذکر کرتیں تو یہ ضرور فرماتیں کہ میرا باپ آپ صلی اللہ علیہ وسلم پر فدا ہو۔ ( انہوں نے کہا ) میں نے آپ کو یہ کہتے ہوئے سنا تھا کہ جوان لڑکیاں، پردہ والیاں اور حائضہ عورتیں بھی باہر نکلیں اور مواقع خیر میں اور مسلمانوں کی دعاؤں میں شریک ہوں اور حائضہ عورت جائے نماز سے دور رہے۔ حفصہ کہتی ہیں، میں نے پوچھا کیا حائضہ بھی؟ تو انہوں نے فرمایا کہ وہ عرفات میں اور فلاں فلاں جگہ نہیں جاتی۔ یعنی جب وہ ان جملہ مقدس مقامات میں جاتی ہیں تو پھر عیدگاہ کیوں نہ جائیں۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 325,
			"arabicnumber": 325,
			"text": "ہم سے احمد بن ابی رجاء نے بیان کیا، انہوں نے کہا ہمیں ابواسامہ نے خبر دی، انہوں نے کہا میں نے ہشام بن عروہ سے سنا، کہا مجھے میرے والد نے عائشہ رضی اللہ عنہا کے واسطہ سے خبر دی کہ فاطمہ بنت ابی حبیش رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ مجھے استحاضہ کا خون آتا ہے اور میں پاک نہیں ہو پاتی، تو کیا میں نماز چھوڑ دیا کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں۔ یہ تو ایک رگ کا خون ہے، ہاں اتنے دنوں میں نماز ضرور چھوڑ دیا کر جن میں اس بیماری سے پہلے تمہیں حیض آیا کرتا تھا۔ پھر غسل کر کے نماز پڑھا کرو۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 326,
			"arabicnumber": 326,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے اسماعیل بن علیہ نے بیان کیا، انہوں نے ایوب سختیانی سے، وہ محمد بن سیرین سے، وہ ام عطیہ سے، آپ نے فرمایا کہ ہم زرد اور مٹیالے رنگ کو کوئی اہمیت نہیں دیتی تھیں۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 327,
			"arabicnumber": 327,
			"text": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا، انہوں نے کہا ہم سے معن بن عیسیٰ نے بیان کیا، انہوں نے ایوب بن ابی ذئب سے، انہوں نے ابن شہاب سے، انہوں نے عروہ اور عمرہ سے، انہوں نے عائشہ رضی اللہ عنہا سے ( جو نبی کریم صلی اللہ علیہ وسلم کی بیوی ہیں ) کہ ام حبیبہ رضی اللہ عنہا سات سال تک مستحاضہ رہیں۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے انہیں غسل کرنے کا حکم دیا اور فرمایا کہ یہ رگ ( کی وجہ سے بیماری ) ہے۔ پس ام حبیبہ رضی اللہ عنہا ہر نماز کے لیے غسل کرتی تھیں۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 328,
			"arabicnumber": 328,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا ہمیں امام مالک نے خبر دی، انہوں نے عبداللہ بن ابی بکر بن عمرو بن حزم سے، انہوں نے اپنے باپ ابوبکر سے، انہوں نے عبدالرحمٰن کی بیٹی عمرہ سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا سے کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ یا رسول اللہ! صفیہ بنت حیی رضی اللہ عنہا کو ( حج میں ) حیض آ گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، شاید کہ وہ ہمیں روکیں گی۔ کیا انہوں نے تمہارے ساتھ طواف ( زیارت ) نہیں کیا۔ عورتوں نے جواب دیا کہ کر لیا ہے۔ آپ نے اس پر فرمایا کہ پھر نکلو۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 330,
			"arabicnumber": 330,
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 331,
			"arabicnumber": 331,
			"text": "ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا ہم سے زہیر بن معاویہ نے بیان کیا، انہوں نے کہا ہم سے ہشام بن عروہ نے عائشہ رضی اللہ عنہا سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب حیض کا زمانہ آئے تو نماز چھوڑ دے اور جب یہ زمانہ گزر جائے تو خون کو دھو اور نماز پڑھ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 332,
			"arabicnumber": 332,
			"text": "ہم سے احمد بن ابی سریح نے بیان کیا، کہا ہم سے شبابہ بن سوار نے، کہا ہم سے شعبہ نے حسین سے۔ وہ عبداللہ بن بریدہ سے، وہ سمرہ بن جندب سے کہ ایک عورت ( ام کعب ) زچگی میں مر گئی، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کی نماز جنازہ پڑھی، اس وقت آپ صلی اللہ علیہ وسلم ان کے ( جسم کے ) وسط میں کھڑے ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 333,
			"arabicnumber": 333,
			"text": "ہم سے حسن بن مدرک نے بیان کیا، انہوں نے کہا ہم سے یحییٰ بن حماد نے بیان کیا، انہوں نے کہا ہمیں ابوعوانہ وضاح نے اپنی کتاب سے دیکھ کر خبر دی۔ انہوں نے کہا کہ ہمیں خبر دی سلیمان شیبانی نے عبداللہ بن شداد سے، انہوں نے کہا میں نے اپنی خالہ میمونہ رضی اللہ عنہا سے جو نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ تھیں سنا کہ میں حائضہ ہوتی تو نماز نہیں پڑھتی تھی اور یہ کہ آپ رسول اللہ صلی اللہ علیہ وسلم کے ( گھر میں ) نماز پڑھنے کی جگہ کے قریب لیٹی ہوتی تھی۔ آپ صلی اللہ علیہ وسلم نماز اپنی چٹائی پر پڑھتے۔ جب آپ صلی اللہ علیہ وسلم سجدہ کرتے تو آپ صلی اللہ علیہ وسلم کے کپڑے کا کوئی حصہ مجھ سے لگ جاتا تھا۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 37
			}
		}
	]
}