{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3649,
			"arabicnumber": 3649,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے بیان کیا اور انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ ہم سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ایک زمانہ آئے گا کہ اہل اسلام کی جماعتیں جہاد کریں گی تو ان سے پوچھا جائے گا کہ کیا تمہارے ساتھ رسول اللہ صلی اللہ علیہ وسلم کا کوئی صحابی بھی ہے؟ وہ کہیں گے کہ ہاں ہیں۔ تب ان کی فتح ہو گی۔ پھر ایک ایسا زمانہ آئے گا کہ مسلمانوں کی جماعتیں جہاد کریں گی اور اس موقع پر یہ پوچھا جائے گا کہ یہاں رسول اللہ صلی اللہ علیہ وسلم کے صحابی کی صحبت اٹھانے والے ( تابعی ) بھی موجود ہیں؟ جواب ہو گا کہ ہاں ہیں اور ان کے ذریعہ فتح کی دعا مانگی جائے گی، اس کے بعد ایک زمانہ ایسا آئے گا کہ مسلمانوں کی جماعتیں جہاد کریں گی اور اس وقت سوال اٹھے گا کہ کیا یہاں کوئی بزرگ ایسے ہیں جو رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کے شاگردوں میں سے کسی بزرگ کی صحبت میں رہے ہوں؟ جواب ہو گا کہ ہاں ہیں، تو ان کے ذریعہ فتح کی دعا مانگی جائے گی پھر ان کی فتح ہو گی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3650,
			"arabicnumber": 3650,
			"text": "مجھ سے اسحٰق بن راہویہ نے بیان کیا، کہا ہم سے نضر نے بیان کیا، کہا ہم کو شعبہ نے خبر دی، انہیں ابوجمرہ نے، کہا میں نے زہدم بن مضرب سے سنا، کہا کہ میں نے عمران بن حصین رضی اللہ عنہما سے سنا، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میری امت کا سب سے بہترین زمانہ میرا زمانہ ہے، پھر ان لوگوں کا جو اس زمانہ کے بعد آئیں گے۔ پھر ان لوگوں کا جو اس زمانہ کے بعد آئیں گے۔ عمران رضی اللہ عنہ کہتے ہیں کہ مجھے یاد نہیں ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اپنے دور کے بعد دو زمانوں کا ذکر کیا یا تین کا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے بعد ایک ایسی قوم پیدا ہو گی جو بغیر کہے گواہی دینے کے لیے تیار ہو جایا کرے گی اور ان میں خیانت اور چوری اتنی عام ہو جائے گی کہ ان پر کسی قسم کا بھروسہ باقی نہیں رہے گا۔ اور نذریں مانیں گے لیکن انہیں پورا نہیں کریں گے ( حرام مال کھا کھا کر ) ان پر مٹاپا عام ہو جائے گا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3651,
			"arabicnumber": 3651,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے منصور نے، ان سے ابراہیم نے، ان سے عبیدہ بن قیس سلمانی نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بہترین زمانہ میرا ہے۔ پھر ان لوگوں کا جو اس زمانہ کے بعد آئیں گے پھر ان لوگوں کا جو اس کے بعد آئیں گے۔ اس کے بعد ایک ایسی قوم پیدا ہو گی کہ گواہی دینے سے پہلے قسم ان کی زبان پر آ جایا کرے گی اور قسم کھانے سے پہلے گواہی ان کی زبان پر آ جایا کرے گی۔ ابراہیم نے بیان کیا کہ جب ہم چھوٹے تھے تو گواہی اور عہد ( کے الفاظ زبان پر لانے ) کی وجہ سے ہمارے بڑے بزرگ ہم کو مارا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3652,
			"arabicnumber": 3652,
			"text": "ہم سے عبداللہ بن رجاء نے بیان کیا، کہا ہم سے اسرائیل نے بیان کیا، ان سے ابواسحٰق نے اور ان سے براء رضی اللہ عنہ نے بیان کیا کہ ابوبکر رضی اللہ عنہ نے ( ان کے والد ) عازب رضی اللہ عنہ سے ایک پالان تیرہ درہم میں خریدا۔ پھر ابوبکر رضی اللہ عنہ نے عازب رضی اللہ عنہ سے کہا کہ براء ( اپنے بیٹے ) سے کہو کہ وہ میرے گھر یہ پالان اٹھا کر پہنچا دیں اس پر عازب رضی اللہ عنہ نے کہا یہ اس وقت تک نہیں ہو سکتا جب تک آپ وہ واقعہ بیان نہ کریں کہ آپ اور رسول اللہ صلی اللہ علیہ وسلم ( مکہ سے ہجرت کرنے کے لیے ) کس طرح نکلے تھے حالانکہ مشرکین آپ دونوں کو تلاش بھی کر رہے تھے۔ انہوں نے کہا کہ مکہ سے نکلنے کے بعد ہم رات بھر چلتے رہے اور دن میں بھی سفر جاری رکھا۔ لیکن جب دوپہر ہو گئی تو میں نے چاروں طرف نظر دوڑائی کہ کہیں کوئی سایہ نظر آ جائے اور ہم اس میں کچھ آرام کر سکیں۔ آخر ایک چٹان دکھائی دی اور میں نے اس کے پاس پہنچ کر دیکھا کہ سایہ ہے۔ پھر میں نے نبی کریم صلی اللہ علیہ وسلم کے لیے ایک فرش وہاں بچھا دیا اور عرض کیا کہ یا رسول اللہ! آپ اب آرام فرمائیں۔ چنانچہ آپ لیٹ گئے۔ پھر میں چاروں طرف دیکھتا ہوا نکلا کہ کہیں لوگ ہماری تلاش میں نہ آئے ہوں۔ پھر مجھ کو بکریوں کا ایک چرواہا دکھائی دیا جو اپنی بکریاں ہانکتا ہوا اسی چٹان کی طرف آ رہا تھا۔ وہ بھی ہماری طرح سایہ کی تلاش میں تھا۔ میں نے بڑھ کر اس سے پوچھا کہ لڑکے تم کس کے غلام ہو۔ اس نے قریش کے ایک شخص کا نام لیا تو میں نے اسے پہچان لیا۔ پھر میں نے اس سے پوچھا: کیا تمہاری بکریوں میں دودھ ہے۔ اس نے کہا جی ہاں۔ میں نے کہا: کیا تم دودھ دوہ سکتے ہوں؟ اس نے کہا کہ ہاں۔ چنانچہ میں نے اس سے کہا اور اس نے اپنے ریوڑ کی ایک بکری باندھ دی۔ پھر میرے کہنے پر اس نے اس کے تھن کے غبار کو جھاڑا۔ اب میں نے کہا کہ اپنا ہاتھ بھی جھاڑ لے۔ اس نے یوں اپنا ایک ہاتھ دوسرے پر مارا اور میرے لیے تھوڑا سا دودھ دوہا۔ آپ صلی اللہ علیہ وسلم کے لیے ایک برتن میں نے پہلے ہی سے ساتھ لے لیا تھا اور اس کے منہ کو کپڑے سے بند کر دیا تھا ( اس میں ٹھنڈا پانی تھا ) پھر میں نے دودھ پر وہ پانی ( ٹھنڈا کرنے کے لیے ) ڈالا اتنا کہ وہ نیچے تک ٹھنڈا ہو گیا تو اسے آپ کی خدمت میں لے کر حاضر ہوا۔ آپ بھی بیدار ہو چکے تھے۔ میں نے عرض کیا: دودھ پی لیجئے۔ آپ نے اتنا پیا کہ مجھے خوشی حاصل ہو گئی، پھر میں نے عرض کیا کہ اب کوچ کا وقت ہو گیا ہے یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے فرمایا ہاں ٹھیک ہے، چلو۔ چنانچہ ہم آگے بڑھے اور مکہ والے ہماری تلاش میں تھے لیکن سراقہ بن مالک بن جعشم کے سوا ہم کو کسی نے نہیں پایا، وہ اپنے گھوڑے پر سوار تھا، میں نے اسے دیکھتے ہی کہا کہ یا رسول اللہ! ہمارا پیچھا کرنے والا دشمن ہمارے قریب آ پہنچا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: فکر نہ کرو۔ اللہ تعالیٰ ہمارے ساتھ ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3653,
			"arabicnumber": 3653,
			"text": "ہم سے محمد بن سنان نے بیان کیا، کہا ہم سے ہمام نے بیان کیا، ان سے ثابت نے، ان سے انس رضی اللہ عنہ نے اور ان سے ابوبکر رضی اللہ عنہ نے بیان کیا کہ جب ہم غار ثور میں چھپے تھے تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ اگر مشرکین کے کسی آدمی نے اپنے قدموں پر نظر ڈالی تو وہ ضرور ہم کو دیکھ لے گا۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا ”اے ابوبکر! ان دو کا کوئی کیا بگاڑ سکتا ہے جن کے ساتھ تیسرا اللہ تعالیٰ ہے۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3654,
			"arabicnumber": 3654,
			"text": "مجھ سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ابوعامر نے بیان کیا، ان سے فلیح بن سلیمان نے بیان کیا، کہا کہ مجھ سے سالم ابوالنضر نے بیان کیا، ان سے بسر بن سعید نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے خطبہ دیا اور فرمایا کہ اللہ تعالیٰ نے اپنے ایک بندے کو دنیا میں اور جو کچھ اللہ کے پاس آخرت میں ہے ان دونوں میں سے کسی ایک کا اختیار دیا تو اس بندے نے وہ اختیار کر لیا جو اللہ کے پاس تھا۔ انہوں نے بیان کیا کہ اس پر ابوبکر رضی اللہ عنہ رونے لگے۔ ابوسعید کہتے ہیں کہ ہم کو ان کے رونے پر حیرت ہوئی کہ نبی کریم صلی اللہ علیہ وسلم تو کسی بندے کے متعلق خبر دے رہے ہیں جسے اختیار دیا گیا تھا، لیکن بات یہ تھی کہ خود آپ صلی اللہ علیہ وسلم ہی وہ بندے تھے جنہیں اختیار دیا گیا تھا اور ( واقعتاً ) ابوبکر رضی اللہ عنہ ہم میں سب سے زیادہ جاننے والے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ فرمایا کہ اپنی صحبت اور مال کے ذریعہ مجھ پر ابوبکر کا سب سے زیادہ احسان ہے اور اگر میں اپنے رب کے سوا کسی کو جانی دوست بنا سکتا تو ابوبکر کو بناتا۔ لیکن اسلام کا بھائی چارہ اور اسلام کی محبت ان سے کافی ہے۔ دیکھو مسجد کی طرف تمام دروازے ( جو صحابہ کے گھروں کی طرف کھلتے تھے ) سب بند کر دیئے جائیں۔ صرف ابوبکر کا دروازہ رہنے دو۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3655,
			"arabicnumber": 3655,
			"text": "ہم سے عبدالعزیزبن عبداللہ نے بیان کیا، کہا ہم سے سلیمان نے بیان کیا، ان سے یحییٰ بن سعید نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ ہی میں جب ہمیں صحابہ کے درمیان انتخاب کے لیے کہا جاتا تو سب میں افضل اور بہتر ہم ابوبکر رضی اللہ عنہ کو قرار دیتے، پھر عمر بن خطاب رضی اللہ عنہ کو پھر عثمان بن عفان رضی اللہ عنہ کو۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3656,
			"arabicnumber": 3656,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے وہیب نے بیان کیا، ان سے ایوب نے بیان کیا، ان سے عکرمہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اگر میں اپنی امت کے کسی فرد کو اپنا جانی دوست بنا سکتا تو ابوبکر کو بناتا لیکن وہ میرے دینی بھائی اور میرے ساتھی ہیں۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3657,
			"arabicnumber": 3657,
			"text": "ہم سے معلیٰ بن اسد اور موسیٰ نے بیان کیا، کہا کہ ہم سے وہیب نے بیان کیا، ان سے ایوب نے ( یہی روایت ) کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر میں کسی کو جانی دوست بنا سکتا تو ابوبکر کو بناتا۔ لیکن اسلام کا بھائی چارہ کیا کم ہے۔ ہم سے قتیبہ نے بیان کیا، ان سے عبدالوہاب نے اور ان سے ایوب نے ایسی ہی حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3658,
			"arabicnumber": 3658,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم کو حماد بن زید نے خبر دی، انہیں ایوب نے، ان سے عبداللہ بن ابی ملیکہ نے بیان کیا کہ کوفہ والوں نے عبداللہ بن زبیر رضی اللہ عنہما کو دادا (کی میراث کے سلسلے میں) سوال لکھا تو آپ نے انہیں جواب دیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر اس امت میں کسی کو میں اپنا جانی دوست بنا سکتا تو ابوبکر کو بناتا۔ ( وہی ) ابوبکر رضی اللہ عنہ یہ فرماتے تھے کہ دادا، باپ کی طرح ہے ( یعنی جب میت کا باپ زندہ نہ ہو تو باپ کا حصہ دادا کی طرف لوٹ جائے گا۔ یعنی باپ کی جگہ دادا وارث ہو گا ) ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3659,
			"arabicnumber": 3659,
			"text": "ہم سے حمیدی اور محمد بن عبداللہ نے بیان کیا، کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ان کے والد نے، ان سے محمد بن جبیر بن مطعم نے اور ان سے ان کے والد نے بیان کیا کہ ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئی تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ پھر آنا۔ اس نے کہا: اگر میں آؤں اور آپ کو نہ پاؤں تو؟ گویا وہ وفات کی طرف اشارہ کر رہی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم مجھے نہ پا سکو تو ابوبکر کے پاس چلی آنا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3660,
			"arabicnumber": 3660,
			"text": "ہم سے احمد بن ابی طیب نے بیان کیا، کہا ہم سے اسماعیل بن ابی مجالد نے بیان کیا، ان سے بیان بن بشر نے کہا، ان سے وبرہ بن عبدالرحمٰن نے، ان سے ہمام نے بیان کیا کہ میں نے عمار رضی اللہ عنہ سے سنا، وہ بیان کرتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس وقت دیکھا ہے جب آپ صلی اللہ علیہ وسلم کے ساتھ ( اسلام لانے والوں میں صرف ) پانچ غلام، دو عورتوں اور ابوبکر رضی اللہ عنہم کے سوا اور کوئی نہ تھا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3661,
			"arabicnumber": 3661,
			"text": "مجھ سے ہشام بن عمار نے بیان کیا، کہا ہم سے صدقہ بن خالد نے بیان کیا، ان سے زید بن واقد نے بیان کیا، ان سے بسر بن عبیداللہ نے، ان سے عائذ اللہ ابوادریس نے اور ان سے ابودرداء رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا کہ ابوبکر رضی اللہ عنہ اپنے کپڑے کا کنارہ پکڑے ہوئے، گھٹنا ظاہر کئے ہوئے آئے۔ نبی کریم صلی اللہ علیہ وسلم نے یہ حالت دیکھ کر فرمایا کہ معلوم ہوتا ہے تمہارے دوست کسی سے لڑ کر آئے ہیں۔ پھر ابوبکر رضی اللہ عنہ نے حاضر ہو کر سلام کیا اور عرض کیا: یا رسول اللہ! میرے اور عمر بن خطاب کے درمیان کچھ تکرار ہو گئی تھی اور اس سلسلے میں، میں نے جلدی میں ان کو سخت لفظ کہہ دیئے لیکن بعد میں مجھے سخت ندامت ہوئی تو میں نے ان سے معافی چاہی، اب وہ مجھے معاف کرنے کے لیے تیار نہیں ہیں۔ اسی لیے میں آپ کی خدمت میں حاضر ہوا ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے ابوبکر! تمہیں اللہ معاف کرے۔ تین مرتبہ آپ نے یہ جملہ ارشاد فرمایا عمر رضی اللہ عنہ کو بھی ندامت ہوئی اور ابوبکر رضی اللہ عنہ کے گھر پہنچے اور پوچھا کیا ابوبکر گھر پر موجود ہیں؟ معلوم ہوا کہ نہیں تو آپ بھی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ نے سلام کیا۔ نبی کریم صلی اللہ علیہ وسلم کا چہرہ مبارک غصہ سے بدل گیا اور ابوبکر رضی اللہ عنہ ڈر گئے اور گھٹنوں کے بل بیٹھ کر عرض کرنے لگے، یا رسول اللہ! اللہ کی قسم زیادتی میری ہی طرف سے تھی۔ دو مرتبہ یہ جملہ کہا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے مجھے تمہاری طرف نبی بنا کر بھیجا تھا۔ اور تم لوگوں نے مجھ سے کہا تھا کہ تم جھوٹ بولتے ہو لیکن ابوبکر نے کہا تھا کہ آپ سچے ہیں اور اپنی جان و مال کے ذریعہ انہوں نے میری مدد کی تھی تو کیا تم لوگ میرے دوست کو ستانا چھوڑتے ہو یا نہیں؟ آپ نے دو دفعہ یہی فرمایا: آپ کے یہ فرمانے کے بعد پھر ابوبکر رضی اللہ عنہ کو کسی نے نہیں ستایا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3662,
			"arabicnumber": 3662,
			"text": "ہم سے معلی بن اسد نے بیان کیا، کہا ہم سے عبدالعزیز بن مختار نے بیان کیا، کہا ہم سے خالد حذاء نے، کہا ہم سے ابوعثمان نے بیان کیا، کہا کہ مجھ سے عمرو بن العاص رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے انہیں غزوہ ذات السلاسل کے لیے بھیجا ( عمرو رضی اللہ عنہ نے بیان کیا کہ ) پھر میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور میں نے پوچھا کہ سب سے زیادہ محبت آپ کو کس سے ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ عائشہ سے میں نے پوچھا، اور مردوں میں؟ فرمایا کہ اس کے باپ سے۔ میں نے پوچھا، اس کے بعد؟ فرمایا کہ عمر بن خطاب سے۔ اس طرح آپ صلی اللہ علیہ وسلم نے کئی آدمیوں کے نام لیے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3663,
			"arabicnumber": 3663,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، انہوں نے کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک چرواہا اپنی بکریاں چرا رہا تھا کہ بھیڑیا آ گیا اور ریوڑ سے ایک بکری اٹھا کر لے جانے لگا۔ چرواہے نے اس سے بکری چھڑانی چاہی تو بھیڑیا بول پڑا۔ درندوں والے دن میں اس کی رکھوالی کرنے والا کون ہو گا جس دن میرے سوا اور کوئی چرواہا نہ ہو گا۔ اسی طرح ایک شخص بیل کو اس پر سوار ہو کر لیے جا رہا تھا، بیل اس کی طرف متوجہ ہو کر کہنے لگا کہ میری پیدائش اس کے لیے نہیں ہوئی ہے۔ میں تو کھیتی باڑی کے کاموں کے لیے پیدا کیا گیا ہوں۔ وہ شخص بول پڑا۔ سبحان اللہ! ( جانور اور انسانوں کی طرح باتیں کرے ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں ان واقعات پر ایمان لاتا ہوں اور ابوبکر اور عمر بن خطاب بھی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3664,
			"arabicnumber": 3664,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے، ان سے زہری نے بیان کیا، کہا مجھ کو ابن المسیب نے خبر دی اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا، انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں سو رہا تھا کہ خواب میں میں نے اپنے آپ کو ایک کنویں پر دیکھا جس پر ڈول تھا۔ اللہ تعالیٰ نے جتنا چاہا میں نے اس ڈول سے پانی کھینچا، پھر اسے ابن ابی قحافہ ( ابوبکر رضی اللہ عنہ ) نے لے لیا اور انہوں نے ایک یا دو ڈول کھینچے، ان کے کھینچنے میں کچھ کمزوری سی معلوم ہوئی اللہ ان کی اس کمزوری کو معاف فرمائے۔ پھر اس ڈول نے ایک بہت بڑے ڈول کی صورت اختیار کر لی اور اسے عمر بن خطاب ( رضی اللہ عنہ ) نے اپنے ہاتھ میں لے لیا۔ میں نے ایسا شہ زور پہلوان آدمی نہیں دیکھا جو عمر ( رضی اللہ عنہ ) کی طرح ڈول کھینچ سکتا۔ انہوں نے اتنا پانی نکالا کہ لوگوں نے اپنے اونٹوں کو حوض سے سیراب کر لیا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3665,
			"arabicnumber": 3665,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو موسیٰ بن عقبہ نے خبر دی، انہیں سالم بن عبداللہ نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اپنا کپڑا ( پاجامہ یا تہبند وغیرہ ) تکبر اور غرور کی وجہ سے زمین پر گھسیٹتا چلے تو اللہ تعالیٰ قیامت کے دن اس کی طرف نظر رحمت سے دیکھے گا بھی نہیں، اس پر ابوبکر صدیق رضی اللہ عنہ نے عرض کیا کہ میرے کپڑے کا ایک حصہ لٹک جایا کرتا ہے۔ البتہ اگر میں پوری طرح خیال رکھوں تو وہ نہیں لٹک سکے گا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ آپ تو ایسا تکبر کے خیال سے نہیں کرتے ( اس لیے آپ اس حکم میں داخل نہیں ہیں ) موسیٰ نے کہا کہ میں نے سالم سے پوچھا، کیا عبداللہ بن عمر رضی اللہ عنہما نے اس حدیث میں یہ فرمایا تھا کہ جو اپنی ازار کو گھسیٹتے ہوئے چلے، تو انہوں نے کہا کہ میں نے تو ان سے یہی سنا کہ جو کوئی اپنا کپڑا لٹکائے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3666,
			"arabicnumber": 3666,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم سے شعیب نے بیان کیا، ان سے زہری نے بیان کیا، انہوں نے کہا کہ مجھے حمید بن عبدالرحمٰن بن عوف نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے اللہ کے راستے میں کسی چیز کا ایک جوڑا خرچ کیا ( مثلاً دو روپے، دو کپڑے، دو گھوڑے اللہ تعالیٰ کے راستے میں دیے ) تو اسے جنت کے دروازوں سے بلایا جائے گا کہ اے اللہ کے بندے! ادھر آ، یہ دروازہ بہتر ہے پس جو شخص نمازی ہو گا اسے نماز کے دروازے سے بلایا جائے گا، جو شخص مجاہد ہو گا اسے جہاد کے دروازے سے بلایا جائے گا، جو شخص اہل صدقہ میں سے ہو گا اسے صدقہ کے دروازہ سے بلایا جائے گا اور جو شخص روزہ دار ہو گا اسے صیام اور ریان ( سیرابی ) کے دروازے سے بلایا جائے گا۔ ابوبکر رضی اللہ عنہ نے عرض کیا جس شخص کو ان تمام ہی دروازوں سے بلایا جائے گا پھر تو اسے کسی قسم کا خوف باقی نہیں رہے گا اور پوچھا کیا کوئی شخص ایسا بھی ہو گا جسے ان تمام دروازوں سے بلایا جائے گا یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں اور مجھے امید ہے کہ تم بھی انہیں میں سے ہو گے اے ابوبکر!۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3668,
			"arabicnumber": 3668,
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3670,
			"arabicnumber": 3670,
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3671,
			"arabicnumber": 3671,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، کہا ہم سے جامع بن ابی راشد نے بیان کیا، کہا ہم سے ابویعلیٰ نے بیان کیا، ان سے محمد بن حنفیہ نے بیان کیا کہ میں نے اپنے والد ( علی رضی اللہ عنہ ) سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم کے بعد سب سے افضل صحابی کون ہیں؟ انہوں نے بتلایا کہ ابوبکر رضی اللہ عنہ میں نے پوچھا پھر کون ہیں؟ انہوں نے بتلایا، اس کے بعد عمر رضی اللہ عنہ ہیں۔ مجھے اس کا اندیشہ ہوا کہ اب ( پھر میں نے پوچھا کہ اس کے بعد؟ ) کہہ دیں گے کہ عثمان رضی اللہ عنہ اس لیے میں نے خود کہا، اس کے بعد آپ ہیں؟ یہ سن کر وہ بولے کہ میں تو صرف عام مسلمانوں کی جماعت کا ایک شخص ہوں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3672,
			"arabicnumber": 3672,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے مالک نے، ان سے عبدالرحمٰن بن قاسم نے بیان کیا، ان سے ان کے والد نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک سفر میں ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چلے جب ہم مقام بیداء یا مقام ذات الجیش پر پہنچے تو میرا ایک ہار ٹوٹ کر گر گیا، اس لیے نبی کریم صلی اللہ علیہ وسلم اس کی تلاش کے لیے وہاں ٹھہر گئے اور صحابہ بھی آپ کے ساتھ ٹھہرے لیکن نہ اس جگہ پانی تھا اور نہ ان کے پاس پانی تھا۔ لوگ ابوبکر رضی اللہ عنہ کے پاس آ کر کہنے لگے کہ آپ ملاحظہ نہیں فرماتے، عائشہ رضی اللہ عنہا نے کیا کیا، نبی کریم صلی اللہ علیہ وسلم کو یہیں روک لیا ہے۔ اتنے صحابہ آپ کے ساتھ ہیں۔ نہ تو یہاں پانی ہے اور نہ لوگ اپنے ساتھ ( پانی ) لیے ہوئے ہیں۔ اس کے بعد ابوبکر رضی اللہ عنہ اندر آئے۔ رسول اللہ صلی اللہ علیہ وسلم اس وقت اپنا سر مبارک میری ران پر رکھے ہوئے سو رہے تھے۔ وہ کہنے لگے، تمہاری وجہ سے آپ صلی اللہ علیہ وسلم کو اور سب لوگوں کو رکنا پڑا۔ اب نہ یہاں کہیں پانی ہے اور نہ لوگوں کے پاس پانی ہے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ ابوبکر رضی اللہ عنہ نے مجھ پر غصہ کیا اور جو کچھ اللہ کو منظور تھا انہوں نے کہا اور اپنے ہاتھ سے میری کوکھ میں کچوکے لگانے لگے۔ میں ضرور تڑپ اٹھتی مگر آپ صلی اللہ علیہ وسلم کا سر مبارک میری ران پر تھا۔ آپ صلی اللہ علیہ وسلم سوئے رہے۔ جب صبح ہوئی تو پانی نہیں تھا اور اسی موقع پر اللہ تعالیٰ نے تیمم کا حکم نازل فرمایا اور سب نے تیمم کیا۔ اس پر اسید بن حضیر رضی اللہ عنہ نے کہا کہ اے آل ابوبکر! یہ تمہاری کوئی پہلی برکت نہیں ہے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ہم نے جب اس اونٹ کو اٹھایا جس پر میں سوار تھی تو ہار اسی کے نیچے ہمیں ملا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3673,
			"arabicnumber": 3673,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، ہم سے شعبہ نے بیان کیا، ان سے اعمش نے بیان کیا، کہا میں نے ذکوان سے سنا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میرے اصحاب کو برا بھلا مت کہو۔ اگر کوئی شخص احد پہاڑ کے برابر بھی سونا ( اللہ کی راہ میں ) خرچ کر ڈالے تو ان کے ایک مد غلہ کے برابر بھی نہیں ہو سکتا اور نہ ان کے آدھے مد کے برابر۔“ شعبہ کے ساتھ اس حدیث کو جریر، عبداللہ بن داود، ابومعاویہ اور محاضر نے بھی اعمش سے روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "ہم سے ابوالحسن محمد بن مسکین نے بیان کیا، کہا ہم سے یحییٰ بن حسان نے بیان کیا، کہا ہم سے سلیمان نے بیان کیا، ان سے شریک بن ابی نمر نے، ان سے سعید بن مسیب نے بیان کیا، کہا مجھ کو ابوموسیٰ اشعری رضی اللہ عنہ نے خبر دی کہ انہوں نے ایک دن اپنے گھر میں وضو کیا اور اس ارادہ سے نکلے کہ آج دن بھر رسول اللہ صلی اللہ علیہ وسلم کا ساتھ نہ چھوڑوں گا۔ انہوں نے بیان کیا کہ پھر وہ مسجد نبوی میں حاضر ہوئے اور نبی کریم صلی اللہ علیہ وسلم کے متعلق پوچھا تو وہاں موجود لوگوں نے بتایا کہ نبی کریم صلی اللہ علیہ وسلم تو تشریف لے جا چکے ہیں اور آپ اس طرف تشریف لے گئے ہیں۔ چنانچہ میں آپ کے متعلق پوچھتا ہوا آپ کے پیچھے پیچھے نکلا اور آخر میں نے دیکھا کہ آپ ( قباء کے قریب ) بئراریس میں داخل ہو رہے ہیں، میں دروازے پر بیٹھ گیا اور اس کا دروازہ کھجور کی شاخوں سے بنا ہوا تھا۔ جب آپ قضائے حاجت کر چکے اور آپ نے وضو بھی کر لیا تو میں آپ کے پاس گیا۔ میں نے دیکھا کہ آپ بئراریس ( اس باغ کے کنویں ) کی منڈیر پر بیٹھے ہوئے ہیں، اپنی پنڈلیاں آپ نے کھول رکھی ہیں اور کنویں میں پاؤں لٹکائے ہوئے ہیں۔ میں نے آپ کو سلام کیا اور پھر واپس آ کر باغ کے دروازے پر بیٹھ گیا۔ میں نے سوچا کہ آج رسول اللہ صلی اللہ علیہ وسلم کا دربان رہوں گا۔ پھر ابوبکر رضی اللہ عنہ آئے اور دروازہ کھولنا چاہا تو میں نے پوچھا کہ کون صاحب ہیں؟ انہوں نے کہا کہ ابوبکر! میں نے کہا تھوڑی دیر ٹھہر جائیے۔ پھر میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا کہ ابوبکر دروازے پر موجود ہیں اور اندر آنے کی اجازت آپ سے چاہتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور جنت کی بشارت بھی۔ میں دروازہ پر آیا اور ابوبکر رضی اللہ عنہ سے میں نے کہا کہ اندر تشریف لے جائیے اور رسول اللہ صلی اللہ علیہ وسلم نے آپ کو جنت کی بشارت دی ہے۔ ابوبکر رضی اللہ عنہ اندر داخل ہوئے اور اسی کنویں کی منڈیر پر آپ صلی اللہ علیہ وسلم کی داہنی طرف بیٹھ گئے اور اپنے دونوں پاؤں کنویں میں لٹکا لیے۔ جس طرح آپ صلی اللہ علیہ وسلم نے لٹکائے ہوئے تھے اور اپنی پنڈلیوں کو بھی کھول لیا تھا۔ پھر میں واپس آ کر اپنی جگہ پر بیٹھ گیا۔ میں آتے وقت اپنے بھائی کو وضو کرتا ہوا چھوڑ آیا تھا۔ وہ میرے ساتھ آنے والے تھے۔ میں نے اپنے دل میں کہا، کاش اللہ تعالیٰ فلاں کو خبر دے دیتا۔ ان کی مراد اپنے بھائی سے تھی اور انہیں یہاں پہنچا دیتا۔ اتنے میں کسی صاحب نے دروازہ پر دستک دی میں نے پوچھا کون صاحب ہیں؟ کہا کہ عمر بن خطاب۔ میں نے کہا کہ تھوڑی دیر کے لیے ٹھہر جائیے، چنانچہ میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور سلام کے بعد عرض کیا کہ عمر بن خطاب رضی اللہ عنہ دروازے پر کھڑے ہیں اندر آنے کی اجازت چاہتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور جنت کی بشارت بھی پہنچا دو۔ میں واپس آیا اور کہا کہ اندر تشریف لے جائیے اور آپ کو رسول اللہ صلی اللہ علیہ وسلم نے جنت کی بشارت دی ہے۔ وہ بھی داخل ہوئے اور آپ کے ساتھ اسی منڈیر پر بائیں طرف بیٹھ گئے اور اپنے پاؤں کنویں میں لٹکا لیے۔ میں پھر دروازے پر آ کر بیٹھ گیا اور سوچتا رہا کہ اگر اللہ تعالیٰ فلاں ( ان کے بھائی ) کے ساتھ خیر چاہے گا تو اسے یہاں پہنچا دے گا، اتنے میں ایک اور صاحب آئے اور دروازے پر دستک دی، میں نے پوچھا کون صاحب ہیں؟ بولے کہ عثمان بن عفان، میں نے کہا تھوڑی دیر کے لیے رک جائیے، میں آپ کے پاس آیا اور میں نے آپ کو ان کی اطلاع دی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور ایک مصیبت پر جو انہیں پہنچے گی جنت کی بشارت پہنچا دو۔ میں دروازے پر آیا اور میں نے ان سے کہا کہ اندر تشریف لے جائیے۔ نبی کریم صلی اللہ علیہ وسلم نے آپ کو جنت کی بشارت دی ہے، ایک مصیبت پر جو آپ کو پہنچے گی۔ وہ جب داخل ہوئے تو دیکھا چبوترہ پر جگہ نہیں ہے اس لیے وہ دوسری طرف آپ صلی اللہ علیہ وسلم کے سامنے بیٹھ گئے۔ شریک نے بیان کیا کہ سعید بن مسیب نے کہا میں نے اس سے ان کی قبروں کی تاویل لی ہے ( کہ اسی طرح بنیں گی ) ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3675,
			"arabicnumber": 3675,
			"text": "مجھ سے محمد بن بشار نے بیان کیا، کہا کہ مجھ سے یحییٰ بن سعید قطان نے بیان کیا، ان سے سعید نے، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ جب نبی کریم صلی اللہ علیہ وسلم ، ابوبکر، عمر اور عثمان رضی اللہ عنہم کو ساتھ لے کر احد پہاڑ پر چڑھے تو احد کانپ اٹھا، آپ صلی اللہ علیہ وسلم نے فرمایا ”احد! قرار پکڑ کہ تجھ پر ایک نبی، ایک صدیق اور دو شہید ہیں۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3676,
			"arabicnumber": 3676,
			"text": "مجھ سے ابوعبداللہ احمد بن سعید نے بیان کیا، کہا ہم سے وہب بن جریر نے بیان کیا، کہا ہم سے صخر نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں ایک کنویں پر ( خواب میں ) کھڑا اس سے پانی کھینچ رہا تھا کہ میرے پاس ابوبکر اور عمر بھی پہنچ گئے۔ پھر ابوبکر نے ڈول لے لیا اور ایک یا دو ڈول کھینچے، ان کے کھینچنے میں ضعف تھا اور اللہ تعالیٰ ان کی مغفرت کرے گا۔ پھر ابوبکر کے ہاتھ سے ڈول عمر نے لے لیا اور ان کے ہاتھ میں پہنچتے ہی وہ ایک بہت بڑے ڈول کی شکل میں ہو گیا۔ میں نے کوئی ہمت والا اور بہادر انسان نہیں دیکھا جو اتنی حسن تدبیر اور مضبوط قوت کے ساتھ کام کرنے کا عادی ہو، چنانچہ انہوں نے اتنا پانی کھینچا کہ لوگوں نے اونٹوں کے پانی پلانے کی جگہیں بھر لیں، وہب نے بیان کیا کہ «العطن» اونٹوں کے بیٹھنے کی جگہ کو کہتے ہیں، عرب لوگ بولتے ہیں، اونٹ سیراب ہوئے کہ ( وہیں ) بیٹھ گئے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3677,
			"arabicnumber": 3677,
			"text": "ہم سے ولید بن صالح نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے بیان کیا، کہا ہم سے عمر بن سعید بن ابی الحسین مکی نے ان سے ابن ابی ملیکہ نے بیان کیا کہ ابن عباس رضی اللہ عنہما نے بیان کیا کہ میں ان لوگوں کے ساتھ کھڑا تھا جو عمر بن خطاب رضی اللہ عنہ کے لیے دعائیں کر رہے تھے، اس وقت ان کا جنازہ چارپائی پر رکھا ہوا تھا، اتنے میں ایک صاحب نے میرے پیچھے سے آ کر میرے شانوں پر اپنی کہنیاں رکھ دیں اور ( عمر رضی اللہ عنہ کو مخاطب کر کے ) کہنے لگے اللہ آپ پر رحم کرے۔ مجھے تو یہی امید تھی کہ اللہ تعالیٰ آپ کو آپ کے دونوں ساتھیوں ( رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ ) کے ساتھ ( دفن ) کرائے گا، میں اکثر رسول اللہ صلی اللہ علیہ وسلم کو یوں فرماتے سنا کرتا تھا کہ ”میں اور ابوبکر اور عمر تھے“، ”میں نے اور ابوبکر اور عمر نے یہ کام کیا“، ”میں اور ابوبکر اور عمر گئے“ اس لیے مجھے یہی امید تھی کہ اللہ تعالیٰ آپ کو ان ہی دونوں بزرگوں کے ساتھ رکھے گا۔ میں نے جو مڑ کر دیکھا تو وہ علی رضی اللہ عنہ تھے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3678,
			"arabicnumber": 3678,
			"text": "مجھ سے محمد بن یزید کوفی نے بیان کیا، کہا ہم سے ولید نے بیان کیا، ان سے اوزاعی نے، ان سے یحییٰ ابن ابی کثیر نے، ان سے محمد بن ابراہیم نے اور ان سے عروہ بن زبیر نے بیان کیا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے مشرکین مکہ کی سب سے بڑی ظالمانہ حرکت کے بارے میں پوچھا جو انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کی تھی تو انہوں نے بتلایا کہ میں نے دیکھا کہ عقبہ بن ابی معیط آپ صلی اللہ علیہ وسلم کے پاس آیا۔ آپ اس وقت نماز پڑھ رہے تھے، اس بدبخت نے اپنی چادر آپ کی گردن مبارک میں ڈال کر کھینچی جس سے آپ کا گلا بڑی سختی کے ساتھ پھنس گیا۔ اتنے میں ابوبکر رضی اللہ عنہ آئے اور اس بدبخت کو دفع کیا اور کہا کیا تم ایک ایسے شخص کو قتل کرنا چاہتے ہو جو یہ کہتا ہے کہ میرا پروردگار اللہ تعالیٰ ہے اور وہ تمہارے پاس اپنے پروردگار کی طرف سے کھلی ہوئی دلیلیں بھی لے کر آیا ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3679,
			"arabicnumber": 3679,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے عبدالعزیز ماجشون نے بیان کیا، کہا ہم سے محمد بن منکدر نے بیان کیا، اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں ( خواب میں ) جنت میں داخل ہوا تو وہاں میں نے ابوطلحہ رضی اللہ عنہ کی بیوی رمیصاء کو دیکھا اور میں نے قدموں کی آواز سنی تو میں نے پوچھا یہ کون صاحب ہیں؟ بتایا گیا کہ یہ بلال رضی اللہ عنہ ہیں اور میں نے ایک محل دیکھا اس کے سامنے ایک عورت تھی، میں نے پوچھا یہ کس کا محل ہے؟ تو بتایا کہ یہ عمر رضی اللہ عنہ کا ہے۔ میرے دل میں آیا کہ اندر داخل ہو کر اسے دیکھوں، لیکن مجھے عمر کی غیرت یاد آئی ( اور اس لیے اندر داخل نہیں ہوا ) اس پر عمر رضی اللہ عنہ نے روتے ہوئے کہا میرے ماں باپ آپ پر فدا ہوں، یا رسول اللہ! کیا میں آپ پر غیرت کروں گا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3680,
			"arabicnumber": 3680,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم کو لیث نے خبر دی، کہا کہ مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا کہ مجھے سعید بن مسیب نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں سویا ہوا تھا کہ میں نے خواب میں جنت دیکھی۔ میں نے دیکھا کہ ایک عورت ایک محل کے کنارے وضو کر رہی ہے۔ میں نے پوچھا یہ محل کس کا ہے؟ تو فرشتوں نے جواب دیا کہ عمر رضی اللہ عنہ کا۔ پھر مجھے ان کی غیرت و حمیت یاد آئی اور میں وہیں سے لوٹ آیا۔ اس پر عمر رضی اللہ عنہ رو دیئے اور عرض کیا: یا رسول اللہ! کیا میں آپ پر بھی غیرت کروں گا؟",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3681,
			"arabicnumber": 3681,
			"text": "مجھ سے ابوجعفر محمد بن صلت کوفی نے بیان کیا، انہوں نے کہا ہم سے عبداللہ بن مبارک نے بیان کیا، ان سے یونس نے، ان سے زہری نے بیان کیا، کہا مجھ کو حمزہ نے خبر دی اور انہیں ان کے والد (عبداللہ بن عمر رضی اللہ عنہما) نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے خواب میں دودھ پیا، اتنا کہ میں دودھ کی سیرابی دیکھنے لگا جو میرے ناخن یا ناخنوں پر بہ رہی ہے، پھر میں نے پیالہ عمر کو دے دیا۔ صحابہ نے پوچھا: یا رسول اللہ! اس خواب کی تعبیر کیا ہے آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی تعبیر علم ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3682,
			"arabicnumber": 3682,
			"text": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے محمد بن بشر نے بیان کیا، کہا ہم سے عبیداللہ نے بیان کیا، کہا کہ مجھ سے ابوبکر بن سالم نے بیان کیا، ان سے سالم نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے خواب میں دیکھا کہ میں ایک کنویں سے ایک اچھا بڑا ڈول کھینچ رہا ہوں، جس پر ”لکڑی کا چرخ“ لگا ہوا ہے، پھر ابوبکر آئے اور انہوں نے بھی ایک یا دو ڈول کھینچے مگر کمزوری کے ساتھ اور اللہ ان کی مغفرت کرے۔ پھر عمر آئے اور ان کے ہاتھ میں وہ ڈول ایک بہت بڑے ڈول کی صورت اختیار کر گیا۔ میں نے ان جیسا مضبوط اور باعظمت شخص نہیں دیکھا جو اتنی مضبوطی کے ساتھ کام کر سکتا ہو۔ انہوں نے اتنا کھینچا کہ لوگ سیراب ہو گئے اور اپنے اونٹوں کو پلا کر ان کے ٹھکانوں پر لے گئے۔ ابن جبیر نے کہا کہ «عبقري» کا معنی عمدہ اور «زرابي» اور «عبقري» سردار کو بھی کہتے ہیں ( حدیث میں «عبقري» سے یہی مراد ہے ) یحییٰ بن زیاد فری نے کہا، «زرابي» ان بچھونوں کو کہتے ہیں جن کے حاشیے باریک، پھیلے ہوئے بہت کثرت سے ہوتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3683,
			"arabicnumber": 3683,
			"text": "ہم سے علی بن عبداللہ بن مدینی نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا ان سے صالح نے، ان سے ابن شہاب نے، کہا مجھ کو عبدالحمید بن عبدالرحمٰن نے خبر دی، انہیں محمد بن سعد بن ابی وقاص نے خبر دی اور ان سے ان کے والد (سعد بن ابی وقاص رضی اللہ عنہ) نے بیان کیا (دوسری سند) اور مجھ سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے صالح نے، ان سے ابن شہاب نے، ان سے عبدالحمید بن عبدالرحمٰن بن زید نے، ان سے محمد بن سعد بن ابی وقاص نے اور ان سے ان کے والد نے بیان کیا کہ عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اندر آنے کی اجازت چاہی۔ اس وقت آپ کے پاس قریش کی چند عورتیں ( امہات المؤمنین میں سے ) بیٹھی باتیں کر رہی تھیں اور آپ کی آواز پر اپنی آواز اونچی کرتے ہوئے آپ سے نان و نفقہ میں زیادتی کا مطالبہ کر رہی تھیں۔ جوں ہی عمر رضی اللہ عنہ نے اجازت چاہی تو وہ تمام کھڑی ہو کر پردے کے پیچھے جلدی سے بھاگ کھڑی ہوئیں۔ آخر آپ صلی اللہ علیہ وسلم نے اجازت دی اور وہ داخل ہوئے تو آپ صلی اللہ علیہ وسلم مسکرا رہے تھے۔ عمر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! اللہ تعالیٰ آپ صلی اللہ علیہ وسلم کو ہمیشہ خوش رکھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: مجھے ان عورتوں پر ہنسی آ رہی ہے جو ابھی میرے پاس بیٹھی ہوئی تھیں، لیکن تمہاری آواز سنتے ہی سب پردے کے پیچھے بھاگ گئیں۔ عمر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! ڈرنا تو انہیں آپ سے چاہیے تھا۔ پھر انہوں نے ( عورتوں سے ) کہا اے اپنی جانوں کی دشمنو! تم مجھ سے تو ڈرتی ہو اور نبی کریم صلی اللہ علیہ وسلم سے نہیں ڈرتیں، عورتوں نے کہا کہ ہاں، آپ ٹھیک کہتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم کے مقابلے میں آپ کہیں زیادہ سخت ہیں۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا: اے ابن خطاب! اس ذات کی قسم جس کے ہاتھ میں میری جان ہے، اگر شیطان تمہیں کسی راستے پر چلتا دیکھتا ہے تو اسے چھوڑ کر وہ کسی دوسرے راستے پر چل پڑتا ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3684,
			"arabicnumber": 3684,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے اسماعیل نے بیان کیا، کہا ہم سے قیس نے بیان کیا کہ عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ عمر رضی اللہ عنہ کے اسلام لانے کے بعد پھر ہمیں ہمیشہ عزت حاصل رہی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3685,
			"arabicnumber": 3685,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم سے عمر بن سعید نے بیان کیا، ان سے ابن ابی ملیکہ اور انہوں نے ابن عباس رضی اللہ عنہما کو کہتے سنا کہ جب عمر رضی اللہ عنہ کو ( شہادت کے بعد ) ان کی چارپائی پر رکھا گیا تو تمام لوگوں نے نعش مبارک کو گھیر لیا اور ان کے لیے ( اللہ سے ) دعا اور مغفرت طلب کرنے لگے، نعش ابھی اٹھائی نہیں گئی تھی، میں بھی وہیں موجود تھا۔ اسی حالت میں اچانک ایک صاحب نے میرا شانہ پکڑ لیا، میں نے دیکھا تو وہ علی رضی اللہ عنہ تھے، پھر انہوں نے عمر رضی اللہ عنہ کے لیے دعا رحمت کی اور ( ان کی نعش کو مخاطب کر کے ) کہا: آپ نے اپنے بعد کسی بھی شخص کو نہیں چھوڑا کہ جسے دیکھ کر مجھے یہ تمنا ہوتی کہ اس کے عمل جیسا عمل کرتے ہوئے میں اللہ سے جا ملوں اور اللہ کی قسم! مجھے تو ( پہلے سے ) یقین تھا کہ اللہ تعالیٰ آپ کو آپ کے دونوں ساتھیوں کے ساتھ ہی رکھے گا۔ میرا یہ یقین اس وجہ سے تھا کہ میں نے اکثر رسول اللہ صلی اللہ علیہ وسلم کی زبان مبارک سے یہ الفاظ سنے تھے کہ ”میں، ابوبکر اور عمر گئے۔ میں، ابوبکر اور عمر داخل ہوئے۔ میں، ابوبکر اور عمر باہر آئے۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3686,
			"arabicnumber": 3686,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یزید بن زریع نے بیان کیا، کہا ہم سے سعید نے بیان کیا، (دوسری سند) امام بخاری رحمہ اللہ فرماتے ہیں اور مجھ سے خلیفہ نے بیان کیا، ان سے محمد بن سواء اور کہمس بن منہال نے بیان کیا، ان سے سعید نے بیان کیا، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم احد پہاڑ پر چڑھے تو آپ کے ساتھ ابوبکر، عمر اور عثمان رضی اللہ عنہم بھی تھے، پہاڑ لرزنے لگا تو نبی کریم صلی اللہ علیہ وسلم نے اپنے پاؤں سے اسے مارا اور فرمایا ”احد! ٹھہرا رہ کہ تجھ پر ایک نبی، ایک صدیق اور دو شہید ہی تو ہیں۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3687,
			"arabicnumber": 3687,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سے عمر بن محمد نے بیان کیا، ان سے زید بن اسلم نے بیان کیا اور ان سے ان کے والد نے بیان کیا، انہوں نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما نے مجھ سے اپنے والد عمر رضی اللہ عنہ کے بعض حالات پوچھے، جو میں نے انہیں بتا دیئے تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم کے بعد میں نے کسی شخص کو دین میں اتنی زیادہ کوشش کرنے والا اور اتنا زیادہ سخی نہیں دیکھا اور یہ خصائل عمر بن خطاب رضی اللہ عنہ پر ختم ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3688,
			"arabicnumber": 3688,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ثابت نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ ایک صاحب ( ذوالخویصرہ یا ابوموسیٰ ) نے رسول اللہ صلی اللہ علیہ وسلم سے قیامت کے بارے میں پوچھا کہ قیامت کب قائم ہو گی؟ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم نے قیامت کے لیے تیاری کیا کی ہے؟ انہوں نے عرض کیا کچھ بھی نہیں، سوا اس کے کہ میں اللہ اور اس کے رسول سے محبت رکھتا ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تمہارا حشر بھی انہیں کے ساتھ ہو گا جن سے تمہیں محبت ہے۔“ انس رضی اللہ عنہ نے بیان کیا کہ ہمیں کبھی اتنی خوشی کسی بات سے بھی نہیں ہوئی جتنی آپ کی یہ حدیث سن کر ہوئی کہ ”تمہارا حشر انہیں کے ساتھ ہو گا جن سے تمہیں محبت ہے۔“ انس رضی اللہ عنہ نے کہا کہ میں بھی رسول اللہ صلی اللہ علیہ وسلم سے اور ابوبکر و عمر رضی اللہ عنہما سے محبت رکھتا ہوں اور ان سے اپنی اس محبت کی وجہ سے امید رکھتا ہوں کہ میرا حشر انہیں کے ساتھ ہو گا، اگرچہ میں ان جیسے عمل نہ کر سکا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3689,
			"arabicnumber": 3689,
			"text": "ہم سے یحییٰ بن قزعہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ان کے والد نے، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم سے پہلی امتوں میں محدث ہوا کرتے تھے، اور اگر میری امت میں کوئی ایسا شخص ہے تو وہ عمر ہیں۔ زکریا بن زائدہ نے اپنی روایت میں سعد سے یہ بڑھایا ہے کہ ان سے ابوسلمہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم سے پہلے بنی اسرائیل کی امتوں میں کچھ لوگ ایسے ہوا کرتے تھے کہ نبی نہیں ہوتے تھے اور اس کے باوجود فرشتے ان سے کلام کیا کرتے تھے اور اگر میری امت میں کوئی ایسا شخص ہو سکتا ہے تو وہ عمر ہیں۔ ابن عباس رضی اللہ عنہما نے پڑھا «من نبي ولا محدث» ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3690,
			"arabicnumber": 3690,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا ہم سے لیث نے بیان کیا، انہوں نے کہا ہم سے عقیل نے بیان کیا، ان سے ابن شہاب نے، ان سے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے بیان کیا کہ ہم نے ابوہریرہ رضی اللہ عنہ سے سنا، وہ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ایک چرواہا اپنی بکریاں چرا رہا تھا کہ ایک بھیڑئیے نے اس کی ایک بکری پکڑ لی۔ چرواہے نے اس کا پیچھا کیا اور بکری کو اس سے چھڑا لیا۔ پھر بھیڑیا اس کی طرف متوجہ ہو کر بولا: درندوں کے دن اس کی حفاظت کرنے والا کون ہو گا؟ جب میرے سوا اس کا کوئی چرواہا نہ ہو گا۔ صحابہ رضی اللہ عنہم اس پر بول اٹھے: سبحان اللہ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں اس واقعہ پر ایمان لایا اور ابوبکر و عمر ( رضی اللہ عنہما ) بھی۔ حالانکہ وہاں ابوبکر و عمر ( رضی اللہ عنہما ) موجود نہیں تھے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3691,
			"arabicnumber": 3691,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے بیان کیا، مجھ کو ابوامامہ بن سہل بن حنیف نے خبر دی اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا: آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے خواب میں دیکھا کہ کچھ لوگ میرے سامنے پیش کئے گئے جو قمیص پہنے ہوئے تھے ان میں سے بعض کی قمیص صرف سینے تک تھی اور بعض کی اس سے بھی چھوٹی اور میرے سامنے عمر پیش کئے گئے تو وہ اتنی بڑی قمیص پہنے ہوئے تھے کہ چلتے ہوئے گھسٹتی تھی۔ صحابہ نے عرض کیا: یا رسول اللہ! آپ نے اس کی تعبیر کیا لی؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دین مراد ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3692,
			"arabicnumber": 3692,
			"text": "ہم سے صلت بن محمد نے بیان کیا کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا، کہا ہم سے ایوب نے بیان کیا، ان سے ابن ابی ملیکہ نے اور ان سے مسور بن مخرمہ نے بیان کیا کہ جب عمر رضی اللہ عنہ زخمی کر دیئے گئے تو آپ نے بڑی بے چینی کا اظہار کیا۔ اس موقع پر ابن عباس رضی اللہ عنہما نے آپ سے تسلی کے طور پر کہا کہ اے امیرالمؤمنین! آپ اس درجہ گھبرا کیوں رہے ہیں۔ آپ رسول اللہ صلی اللہ علیہ وسلم کی صحبت میں رہے اور نبی کریم صلی اللہ علیہ وسلم کی صحبت کا پورا حق ادا کیا اور پھر جب آپ نبی کریم صلی اللہ علیہ وسلم سے جدا ہوئے تو نبی کریم صلی اللہ علیہ وسلم آپ سے خوش اور راضی تھے، اس کے بعد ابوبکر رضی اللہ عنہ کی صحبت اٹھائی اور ان کی صحبت کا بھی آپ نے پورا حق ادا کیا اور جب جدا ہوئے تو وہ بھی آپ سے راضی اور خوش تھے۔ آخر میں مسلمانوں کی صحبت آپ کو حاصل رہی۔ ان کی صحبت کا بھی آپ نے پورا حق ادا کیا اور اگر آپ ان سے جدا ہوئے تو اس میں کوئی شبہ نہیں کہ انہیں بھی آپ اپنے سے خوش اور راضی ہی چھوڑیں گے۔ اس پر عمر رضی اللہ عنہ نے فرمایا: ابن عباس! تم نے جو رسول اللہ صلی اللہ علیہ وسلم کی صحبت کا اور آپ صلی اللہ علیہ وسلم کی رضا و خوشی کا ذکر کیا ہے تو یقیناً یہ صرف اللہ تعالیٰ کا ایک فضل اور احسان ہے جو اس نے مجھ پر کیا ہے۔ اسی طرح جو تم نے ابوبکر رضی اللہ عنہ کی صحبت اور ان کی خوشی کا ذکر کیا ہے تو یہ بھی اللہ تعالیٰ کا مجھ پر فضل و احسان تھا۔ لیکن جو گھبراہٹ اور پریشانی مجھ پر تم طاری دیکھ رہے ہو وہ تمہاری وجہ سے اور تمہارے ساتھیوں کی فکر کی وجہ سے ہے۔ اور اللہ کی قسم! اگر میرے پاس زمین بھر سونا ہوتا تو اللہ تعالیٰ کے عذاب کا سامنا کرنے سے پہلے اس کا فدیہ دے کر اس سے نجات کی کوشش کرتا۔ حماد بن زید نے بیان کیا، ان سے ایوب نے بیان کیا، ان سے ابن ابی ملیکہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ میں عمر رضی اللہ عنہ کی خدمت میں حاضر ہوا۔ پھر آخر تک یہی حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3693,
			"arabicnumber": 3693,
			"text": "ہم سے یوسف بن موسیٰ نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، کہا کہ مجھ سے عثمان بن غیاث نے بیان کیا، کہا کہ مجھ سے ابوعثمان نہدی نے بیان کیا، اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ میں مدینہ کے ایک باغ ( بئراریس ) میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا کہ ایک صاحب نے آ کر دروازہ کھلوایا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کے لیے دروازہ کھول دو اور انہیں جنت کی بشارت سنا دو، میں نے دروازہ کھولا تو ابوبکر رضی اللہ عنہ تھے۔ میں نے انہیں نبی کریم صلی اللہ علیہ وسلم کے فرمانے کے مطابق جنت کی خوشخبری سنائی تو انہوں نے اس پر اللہ کی حمد کی، پھر ایک اور صاحب آئے اور دروازہ کھلوایا۔ نبی کریم صلی اللہ علیہ وسلم نے اس موقع پر بھی یہی فرمایا کہ دروازہ ان کے لیے کھول دو اور انہیں جنت کی بشارت سنا دو، میں نے دروازہ کھولا تو عمر رضی اللہ عنہ تھے، انہیں بھی جب نبی کریم صلی اللہ علیہ وسلم کے ارشاد کی اطلاع سنائی تو انہوں نے بھی اللہ تعالیٰ کی حمد و ثنا بیان کی۔ پھر ایک تیسرے اور صاحب نے دروازہ کھلوایا۔ ان کے لیے بھی نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دروازہ کھول دو اور انہیں جنت کی بشارت سنا دو ان مصائب اور آزمائشوں کے بعد جن سے انہیں ( دنیا میں ) واسطہ پڑے گا۔ وہ عثمان رضی اللہ عنہ تھے۔ جب میں نے ان کو نبی کریم صلی اللہ علیہ وسلم کے ارشاد کی اطلاع دی تو انہوں نے اللہ کی حمد و ثنا کے بعد فرمایا کہ اللہ تعالیٰ ہی مدد کرنے والا ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3694,
			"arabicnumber": 3694,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھے حیوہ بن شریح نے خبر دی، کہا کہ مجھ سے ابوعقیل زہرہ بن معبد نے بیان کیا اور انہوں نے اپنے دادا عبداللہ بن ہشام رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ ہم ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے۔ آپ اس وقت عمر بن خطاب رضی اللہ عنہ کا ہاتھ اپنے ہاتھ میں لیے ہوئے تھے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3695,
			"arabicnumber": 3695,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ایوب نے، ان سے ابوعثمان نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم ایک باغ ( بئراریس ) کے اندر تشریف لے گئے اور مجھ سے فرمایا کہ میں دروازہ پر پہرہ دیتا رہوں۔ پھر ایک صاحب آئے اور اجازت چاہی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور جنت کی خوشخبری بھی سنا دو، وہ ابوبکر رضی اللہ عنہ تھے۔ پھر دوسرے ایک اور صاحب آئے اور اجازت چاہی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں بھی اجازت دے دو اور جنت کی خوشخبری سنا دو، وہ عمر رضی اللہ عنہ تھے۔ پھر تیسرے ایک اور صاحب آئے اور اجازت چاہی۔ نبی کریم صلی اللہ علیہ وسلم تھوڑی دیر کے لیے خاموش ہو گئے پھر فرمایا کہ انہیں بھی اجازت دے دو اور ( دنیا میں ) ایک آزمائش سے گزرنے کے بعد جنت کی بشارت بھی سنا دو، وہ عثمان غنی رضی اللہ عنہ تھے۔ حماد بن سلمہ نے بیان کیا، ہم سے عاصم احول اور علی بن حکم نے بیان کیا، انہوں نے ابوعثمان سے سنا اور وہ ابوموسیٰ سے اسی طرح بیان کرتے تھے، لیکن عاصم نے اپنی اس روایت میں یہ زیادہ کیا ہے کہ نبی کریم صلی اللہ علیہ وسلم اس وقت ایک ایسی جگہ بیٹھے ہوئے تھے جس کے اندر پانی تھا اور آپ اپنے دونوں گھٹنے یا ایک گھٹنہ کھولے ہوئے تھے لیکن جب عثمان رضی اللہ عنہ داخل ہوئے تو آپ نے اپنے گھٹنے کو چھپا لیا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3696,
			"arabicnumber": 3696,
			"text": "ہم سے احمد بن شبیب بن سعید نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، ان سے یونس نے کہ ابن شہاب نے بیان کیا، کہا مجھ کو عروہ نے خبر دی، انہیں عبیداللہ بن عدی بن خیار نے خبر دی کہ مسور بن مخرمہ اور عبدالرحمٰن بن اسود بن عبدیغوث رضی اللہ عنہ نے ان سے کہا کہ تم عثمان رضی اللہ عنہ سے ان کے بھائی ولید کے مقدمہ میں ( جسے عثمان رضی اللہ عنہ نے کوفہ کا گورنر بنایا تھا ) کیوں گفتگو نہیں کرتے، لوگ اس سے بہت ناراض ہیں۔ چنانچہ میں عثمان رضی اللہ عنہ کے پاس گیا، اور جب وہ نماز کے لیے باہر تشریف لائے تو میں نے عرض کیا کہ مجھے آپ سے ایک ضرورت ہے اور وہ ہے آپ کے ساتھ ایک خیر خواہی! اس پر عثمان رضی اللہ عنہ نے فرمایا: بھلے آدمی تم سے ( میں اللہ کی پناہ چاہتا ہوں ) امام بخاری رحمہ اللہ نے کہا: میں سمجھتا ہوں کہ معمر نے یوں روایت کیا، میں تجھ سے اللہ کی پناہ چاہتا ہوں۔ میں واپس ان دونوں کے پاس گیا، اتنے میں عثمان رضی اللہ عنہ کا قاصد مجھ کو بلانے کے لیے آیا میں جب اس کے ساتھ عثمان رضی اللہ عنہ کی خدمت میں حاضر ہوا تو انہوں نے دریافت فرمایا کہ تمہاری خیر خواہی کیا تھی؟ میں نے عرض کیا: اللہ سبحانہ وتعالیٰ نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ بھیجا اور ان پر کتاب نازل کی آپ بھی ان لوگوں میں شامل تھے جنہوں نے اللہ اور اس کے رسول کی دعوت کو قبول کیا تھا۔ آپ نے دو ہجرتیں کیں۔ نبی کریم صلی اللہ علیہ وسلم کی صحبت اٹھائی اور آپ کے طریقے اور سنت کو دیکھا، لیکن بات یہ ہے کہ لوگ ولید کی بہت شکایتیں کر رہے ہیں۔ عثمان رضی اللہ عنہ نے اس پر پوچھا: تم نے رسول اللہ صلی اللہ علیہ وسلم سے کچھ سنا ہے؟ میں نے عرض کیا کہ نہیں۔ لیکن رسول اللہ صلی اللہ علیہ وسلم کی احادیث ایک کنواری لڑکی تک کو اس کے تمام پردوں کے باوجود جب پہنچ چکی ہیں تو مجھے کیوں نہ معلوم ہوتیں۔ اس پر عثمان نے فرمایا: امابعد: بیشک اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ بھیجا اور میں اللہ اور اس کے رسول کی دعوت کو قبول کرنے والوں میں بھی تھا۔ نبی کریم صلی اللہ علیہ وسلم جس دعوت کو لے کر بھیجے گئے تھے میں اس پر پورے طور سے ایمان لایا اور جیسا کہ تم نے کہا دو ہجرتیں بھی کیں۔ میں نبی کریم صلی اللہ علیہ وسلم کی صحبت میں بھی رہا ہوں اور آپ سے بیعت بھی کی ہے۔ پس اللہ کی قسم میں نے کبھی آپ کے حکم سے سرتابی نہیں کی۔ اور نہ آپ کے ساتھ کبھی کوئی دھوکا کیا، یہاں تک کہ اللہ تعالیٰ نے آپ کو وفات دی۔ اس کے بعد ابوبکر رضی اللہ عنہ کے ساتھ بھی میرا یہی معاملہ رہا۔ اور عمر رضی اللہ عنہ کے ساتھ بھی یہی معاملہ رہا تو کیا جب کہ مجھے ان کا جانشیں بنا دیا گیا ہے تو مجھے وہ حقوق حاصل نہیں ہوں گے جو انہیں تھے؟ میں نے عرض کیا کہ کیوں نہیں، آپ نے فرمایا کہ پھر ان باتوں کے لیے کیا جواز رہ جاتا ہے جو تم لوگوں کی طرف سے مجھے پہنچتی رہتی ہیں لیکن تم نے جو ولید کے حالات کا ذکر کیا ہے، ان شاءاللہ ہم اس کی سزا جو واجبی ہے اس کو دیں گے۔ پھر عثمان رضی اللہ عنہ نے علی رضی اللہ عنہ کو بلایا اور ان سے فرمایا کہ ولید کو حد لگائیں۔ چنانچہ انہوں نے ولید کو اسی کوڑے حد کے لگائے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3697,
			"arabicnumber": 3697,
			"text": "مجھ سے محمد بن حاتم بن بزیع نے بیان کیا، کہا ہم سے شاذان نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی سلمہ ماجشون نے بیان کیا، ان سے عبیداللہ نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے عہد میں ہم ابوبکر رضی اللہ عنہ کے برابر کسی کو نہیں قرار دیتے تھے۔ پھر عمر رضی اللہ عنہ کو پھر عثمان رضی اللہ عنہ کو۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم کے صحابہ پر ہم کوئی بحث نہیں کرتے تھے اور کسی کو ایک دوسرے پر فضیلت نہیں دیتے تھے، اس حدیث کو عبداللہ بن صالح نے بھی عبدالعزیز سے روایت کیا ہے۔ اس کو اسماعیلی نے وصل کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3698,
			"arabicnumber": 3698,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ نے، کہا ہم سے عثمان بن موہب نے بیان کیا کہ مصر والوں میں سے ایک نام نامعلوم آدمی آیا اور حج بیت اللہ کیا، پھر کچھ لوگوں کو بیٹھے ہوئے دیکھا تو اس نے پوچھا کہ یہ کون لوگ ہیں؟ کسی نے کہا کہ یہ قریشی ہیں۔ اس نے پوچھا کہ ان میں بزرگ کون صاحب ہیں؟ لوگوں نے بتایا کہ یہ عبداللہ بن عمر ہیں۔ اس نے پوچھا۔ اے ابن عمر! میں آپ سے ایک بات پوچھنا چاہتا ہوں۔ امید ہے کہ آپ مجھے بتائیں گے۔ کیا آپ کو معلوم ہے کہ عثمان رضی اللہ عنہ نے احد کی لڑائی سے راہ فرار اختیار کی تھی؟ ابن عمر رضی اللہ عنہما نے فرمایا کہ ہاں ایسا ہوا تھا۔ پھر انہوں نے پوچھا: کیا آپ کو معلوم ہے کہ وہ بدر کی لڑائی میں شریک نہیں ہوئے تھے؟ جواب دیا کہ ہاں ایسا ہوا تھا۔ اس نے پوچھا کیا آپ کو معلوم ہے کہ وہ بیعت رضوان میں بھی شریک نہیں تھے۔ جواب دیا کہ ہاں یہ بھی صحیح ہے۔ یہ سن کر اس کی زبان سے نکلا اللہ اکبر تو ابن عمر رضی اللہ عنہما نے کہا کہ قریب آ جاؤ، اب میں تمہیں ان واقعات کی تفصیل سمجھاؤں گا۔ احد کی لڑائی سے فرار کے متعلق میں گواہی دیتا ہوں کہ اللہ تعالیٰ نے انہیں معاف کر دیا ہے۔ بدر کی لڑائی میں شریک نہ ہونے کی وجہ یہ ہے کہ ان کے نکاح میں رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی تھیں اور اس وقت وہ بیمار تھیں اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ تمہیں ( مریضہ کے پاس ٹھہرنے کا ) اتنا ہی اجر و ثواب ملے گا جتنا اس شخص کو جو بدر کی لڑائی میں شریک ہو گا اور اسی کے مطابق مال غنیمت سے حصہ بھی ملے گا اور بیعت رضوان میں شریک نہ ہونے کی وجہ یہ ہے کہ اس موقع پر وادی مکہ میں کوئی بھی شخص ( مسلمانوں میں سے ) عثمان رضی اللہ عنہ سے زیادہ عزت والا اور بااثر ہوتا تو نبی کریم صلی اللہ علیہ وسلم اسی کو ان کی جگہ وہاں بھیجتے، یہی وجہ ہوئی تھی کہ آپ صلی اللہ علیہ وسلم نے انہیں ( قریش سے باتیں کرنے کے لیے ) مکہ بھیج دیا تھا اور جب بیعت رضوان ہو رہی تھی تو عثمان رضی اللہ عنہ مکہ جا چکے تھے، اس موقع پر نبی کریم صلی اللہ علیہ وسلم نے اپنے داہنے ہاتھ کو اٹھا کر فرمایا تھا کہ یہ عثمان کا ہاتھ ہے اور پھر اسے اپنے دوسرے ہاتھ پر ہاتھ رکھ کر فرمایا تھا کہ یہ بیعت عثمان کی طرف سے ہے۔ اس کے بعد ابن عمر رضی اللہ عنہما نے سوال کرنے والے شخص سے فرمایا کہ جا، ان باتوں کو ہمیشہ یاد رکھنا۔ ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے سعید نے، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم جب احد پہاڑ پر چڑھے اور آپ کے ساتھ ابوبکر، عمر اور عثمان رضی اللہ عنہم بھی تھے تو پہاڑ کانپنے لگا۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا احد ٹھہر جا میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے اسے اپنے پاؤں سے مارا بھی تھا کہ تجھ پر ایک نبی، ایک صدیق اور دو شہید ہی تو ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3699,
			"arabicnumber": 3699,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ نے بیان کیا، ان سے سعید نے، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم جب احد پہاڑ پر چڑھے اور آپ کے ساتھ ابوبکر، عمر اور عثمان رضی اللہ عنہم بھی تھے تو پہاڑ کانپنے لگا۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا ”احد ٹھہر جا۔“ میرا خیال ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اسے اپنے پاؤں سے مارا بھی تھا کہ تجھ پر ایک نبی، ایک صدیق اور دو شہید ہی تو ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3700,
			"arabicnumber": 3700,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے حصین نے، ان سے عمرو بن میمون نے بیان کیا کہ میں نے عمر بن خطاب رضی اللہ عنہ کو زخمی ہونے سے چند دن پہلے مدینہ میں دیکھا کہ وہ حذیفہ بن یمان اور عثمان بن حنیف رضی اللہ عنہما کے ساتھ کھڑے تھے اور ان سے یہ فرما رہے تھے کہ ( عراق کی اراضی کے لیے، جس کا انتظام خلافت کی جانب سے ان کے سپرد کیا گیا تھا ) تم لوگوں نے کیا کیا ہے؟ کیا تم لوگوں کو یہ اندیشہ تو نہیں ہے کہ تم نے زمین کا اتنا محصول لگا دیا ہے جس کی گنجائش نہ ہو۔ ان لوگوں نے جواب دیا کہ ہم نے ان پر خراج کا اتنا ہی بار ڈالا ہے جسے ادا کرنے کی زمین میں طاقت ہے، اس میں کوئی زیادتی نہیں کی گئی ہے۔ عمر رضی اللہ عنہ نے فرمایا کہ دیکھو پھر سمجھ لو کہ تم نے ایسی جمع تو نہیں لگائی ہے جو زمین کی طاقت سے باہر ہو۔ راوی نے بیان کیا کہ ان دونوں نے کہا کہ ایسا نہیں ہونے پائے گا، اس کے بعد عمر رضی اللہ عنہ نے فرمایا کہ اگر اللہ تعالیٰ نے مجھے زندہ رکھا تو میں عراق کی بیوہ عورتوں کے لیے اتنا کر دوں گا کہ پھر میرے بعد کسی کی محتاج نہیں رہیں گی۔ راوی عمرو بن میمون نے بیان کیا کہ ابھی اس گفتگو پر چوتھا دن ہی آیا تھا کہ عمر رضی اللہ عنہ زخمی کر دیئے گئے۔ عمرو بن میمون نے بیان کیا کہ جس صبح کو آپ زخمی کئے گئے، میں ( فجر کی نماز کے انتظار میں ) صف کے اندر کھڑا تھا اور میرے اور ان کے درمیان عبداللہ بن عباس رضی اللہ عنہما کے سوا اور کوئی نہیں تھا عمر رضی اللہ عنہ کی عادت تھی کہ جب صف سے گزرتے تو فرماتے جاتے کہ صفیں سیدھی کر لو اور جب دیکھتے کہ صفوں میں کوئی خلل نہیں رہ گیا ہے تب آگے ( مصلی پر ) بڑھتے اور تکبیر کہتے۔ آپ ( فجر کی نماز کی ) پہلی رکعت میں عموماً سورۃ یوسف یا سورۃ النحل یا اتنی ہی طویل کوئی سورت پڑھتے یہاں تک کہ لوگ جمع ہو جاتے۔ اس دن ابھی آپ نے تکبیر ہی کہی تھی کہ میں نے سنا، آپ فرما رہے ہیں کہ مجھے قتل کر دیا یا کتے نے کاٹ لیا۔ ابولولو نے آپ کو زخمی کر دیا تھا۔ اس کے بعد وہ بدبخت اپنا دو دھاری خنجر لیے دوڑنے لگا اور دائیں اور بائیں جدھر بھی پھرتا تو لوگوں کو زخمی کرتا جاتا۔ اس طرح اس نے تیرہ آدمیوں کو زخمی کر دیا جن میں سات حضرات نے شہادت پائی۔ مسلمانوں میں سے ایک صاحب ( حطان نامی ) نے یہ صورت حال دیکھی تو انہوں نے اس پر اپنی چادر ڈال دی۔ اس بدبخت کو جب یقین ہو گیا کہ اب پکڑ لیا جائے گا تو اس نے خود اپنا بھی گلا کاٹ لیا، پھر عمر رضی اللہ عنہ نے عبدالرحمٰن بن عوف رضی اللہ عنہ کا ہاتھ پکڑ کر انہیں آگے بڑھا دیا ( عمرو بن میمون نے بیان کیا کہ ) جو لوگ عمر رضی اللہ عنہ کے قریب تھے انہوں نے بھی وہ صورت حال دیکھی جو میں دیکھ رہا تھا لیکن جو لوگ مسجد کے کنارے پر تھے ( پیچھے کی صفوں میں ) تو انہیں کچھ معلوم نہیں ہو سکا، البتہ چونکہ عمر رضی اللہ عنہ کی قرآت ( نماز میں ) انہوں نے نہیں سنی تو سبحان اللہ! سبحان اللہ! کہتے رہے۔ آخر عبدالرحمٰن بن عوف رضی اللہ عنہ نے لوگوں کو بہت ہلکی نماز پڑھائی۔ پھر جب لوگ نماز سے پلٹے تو عمر رضی اللہ عنہ نے فرمایا: ابن عباس! دیکھو مجھے کس نے زخمی کیا ہے؟ ابن عباس رضی اللہ عنہما نے تھوڑی دیر گھوم پھر کر دیکھا اور آ کر فرمایا کہ مغیرہ رضی اللہ عنہ کے غلام ( ابولولو ) نے آپ کو زخمی کیا ہے۔ عمر رضی اللہ عنہ نے دریافت فرمایا، وہی جو کاریگر ہے؟ جواب دیا کہ جی ہاں، اس پر عمر رضی اللہ عنہ نے فرمایا اللہ اسے برباد کرے میں نے تو اسے اچھی بات کہی تھی ( جس کا اس نے یہ بدلا دیا ) اللہ تعالیٰ کا شکر ہے کہ اس نے میری موت کسی ایسے شخص کے ہاتھوں نہیں مقدر کی جو اسلام کا مدعی ہو۔ تم اور تمہارے والد ( عباس رضی اللہ عنہ ) اس کے بہت ہی خواہشمند تھے کہ عجمی غلام مدینہ میں زیادہ سے زیادہ لائے جائیں۔ یوں بھی ان کے پاس غلام بہت تھے، اس پر ابن عباس رضی اللہ عنہما نے عرض کیا، اگر آپ فرمائیں تو ہم بھی کر گزریں۔ مقصد یہ تھا کہ اگر آپ چاہیں تو ہم ( مدینہ میں مقیم عجمی غلاموں کو ) قتل کر ڈالیں۔ عمر رضی اللہ عنہ نے فرمایا: یہ انتہائی غلط فکر ہے، خصوصاً جب کہ تمہاری زبان میں وہ گفتگو کرتے ہیں، تمہارے قبلہ کی طرف رخ کر کے نماز ادا کرتے ہیں اور تمہاری طرح حج کرتے ہیں۔ پھر عمر رضی اللہ عنہ کو ان کے گھر اٹھا کر لایا گیا اور ہم آپ کے ساتھ ساتھ آئے۔ ایسا معلوم ہوتا تھا جیسے لوگوں پر کبھی اس سے پہلے اتنی بڑی مصیبت آئی ہی نہیں تھی، بعض تو یہ کہتے تھے کہ کچھ نہیں ہو گا۔ ( اچھے ہو جائیں گے ) اور بعض کہتے تھے کہ آپ کی زندگی خطرہ میں ہے۔ اس کے بعد کھجور کا پانی لایا گیا۔ اسے آپ نے پیا تو وہ آپ کے پیٹ سے باہر نکل آیا۔ پھر دودھ لایا گیا اسے بھی جوں ہی آپ نے پیا زخم کے راستے وہ بھی باہر نکل آیا۔ اب لوگوں کو یقین ہو گیا کہ آپ کی شہادت یقینی ہے۔ پھر ہم اندر آ گئے اور لوگ آپ کی تعریف بیان کرنے لگے، اتنے میں ایک نوجوان اندر آیا اور کہنے لگایا امیرالمؤمنین! آپ کو خوشخبری ہو اللہ تعالیٰ کی طرف سے آپ نے رسول اللہ صلی اللہ علیہ وسلم کی صحبت اٹھائی۔ ابتداء میں اسلام لانے کا شرف حاصل کیا جو آپ کو معلوم ہے۔ پھر آپ خلیفہ بنائے گئے اور آپ نے پورے انصاف سے حکومت کی، پھر شہادت پائی، عمر رضی اللہ عنہ نے فرمایا میں تو اس پر بھی خوش تھا کہ ان باتوں کی وجہ سے برابر پر میرا معاملہ ختم ہو جاتا، نہ ثواب ہوتا اور نہ عذاب۔ جب وہ نوجوان جانے لگا تو اس کا تہبند ( ازار ) لٹک رہا تھا، عمر رضی اللہ عنہ نے فرمایا اس لڑکے کو میرے پاس واپس بلا لاؤ ( جب وہ آئے تو ) آپ نے فرمایا: میرے بھتیجے! یہ اپنا کپڑا اوپر اٹھائے رکھو کہ اس سے تمہارا کپڑا بھی زیادہ دنوں چلے گا اور تمہارے رب سے تقویٰ کا بھی باعث ہے۔ اے عبداللہ بن عمر! دیکھو مجھ پر کتنا قرض ہے؟ جب لوگوں نے آپ پر قرض کا شمار کیا تو تقریباً چھیاسی ( 86 ) ہزار نکلا۔ عمر رضی اللہ عنہ نے اس پر فرمایا کہ اگر یہ قرض آل عمر کے مال سے ادا ہو سکے تو انہی کے مال سے اس کو ادا کرنا ورنہ پھر بنی عدی بن کعب سے کہنا، اگر ان کے مال کے بعد بھی ادائیگی نہ ہو سکے تو قریش سے کہنا، ان کے سوا کسی سے امداد نہ طلب کرنا اور میری طرف سے اس قرض کو ادا کر دینا۔ اچھا اب ام المؤمنین عائشہ رضی اللہ عنہا کے یہاں جاؤ اور ان سے عرض کرو کہ عمر نے آپ کی خدمت میں سلام عرض کیا ہے۔ امیرالمؤمنین ( میرے نام کے ساتھ ) نہ کہنا، کیونکہ اب میں مسلمانوں کا امیر نہیں رہا ہوں، تو ان سے عرض کرنا کہ عمر بن خطاب نے آپ سے اپنے دونوں ساتھیوں کے ساتھ دفن ہونے کی اجازت چاہی ہے۔ عبداللہ بن عمر رضی اللہ عنہما نے ( عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہو کر ) سلام کیا اور اجازت لے کر اندر داخل ہوئے۔ دیکھا کہ آپ بیٹھی رو رہی ہیں۔ پھر کہا کہ عمر بن خطاب رضی اللہ عنہ نے آپ کو سلام کہا ہے اور اپنے دونوں ساتھیوں کے ساتھ دفن ہونے کی اجازت چاہی ہے، عائشہ رضی اللہ عنہا نے کہا: میں نے اس جگہ کو اپنے لیے منتخب کر رکھا تھا لیکن آج میں انہیں اپنے پر ترجیح دوں گی، پھر جب ابن عمر رضی اللہ عنہما واپس آئے تو لوگوں نے بتایا کہ عبداللہ آ گئے تو عمر رضی اللہ عنہ نے فرمایا کہ مجھے اٹھاؤ۔ ایک صاحب نے سہارا دے کر آپ کو اٹھایا۔ آپ نے دریافت کیا کیا خبر لائے؟ کہا کہ جو آپ کی تمنا تھی اے امیرالمؤمنین! عمر رضی اللہ عنہ نے فرمایا الحمدللہ۔ اس سے اہم چیز اب میرے لیے کوئی نہیں رہ گئی تھی۔ لیکن جب میری وفات ہو چکے اور مجھے اٹھا کر ( دفن کے لیے ) لے چلو تو پھر میرا سلام ان سے کہنا اور عرض کرنا کہ عمر بن خطاب ( رضی اللہ عنہ ) نے آپ سے اجازت چاہی ہے۔ اگر وہ میرے لیے اجازت دے دیں تب تو وہاں دفن کرنا اور اگر اجازت نہ دیں تو مسلمانوں کے قبرستان میں دفن کرنا۔ اس کے بعد ام المؤمنین حفصہ رضی اللہ عنہا آئیں۔ ان کے ساتھ کچھ دوسری خواتین بھی تھیں، جب ہم نے انہیں دیکھا تو ہم اٹھ گئے۔ آپ عمر رضی اللہ عنہ کے قریب آئیں اور وہاں تھوڑی دیر تک آنسو بہاتی رہیں۔ پھر جب مردوں نے اندر آنے کی اجازت چاہی تو وہ مکان کے اندرونی حصہ میں چلی گئیں اور ہم نے ان کے رونے کی آواز سنی پھر لوگوں نے عرض کیا امیرالمؤمنین! خلافت کے لیے کوئی وصیت کر دیجئیے، فرمایا کہ خلافت کا میں ان حضرات سے زیادہ اور کسی کو مستحق نہیں پاتا کہ رسول اللہ صلی اللہ علیہ وسلم اپنی وفات تک جن سے راضی اور خوش تھے پھر آپ نے علی، عثمان، زبیر، طلحہ، سعد اور عبدالرحمٰن بن عوف کا نام لیا اور یہ بھی فرمایا کہ عبداللہ بن عمر کو بھی صرف مشورہ کی حد تک شریک رکھنا لیکن خلافت سے انہیں کوئی سروکار نہیں رہے گا۔ جیسے آپ نے ابن عمر رضی اللہ عنہما کی تسکین کے لیے یہ فرمایا ہو۔ پھر اگر خلافت سعد کو مل جائے تو وہ اس کے اہل ہیں اور اگر وہ نہ ہو سکیں تو جو شخص بھی خلیفہ ہو وہ اپنے زمانہ خلافت میں ان کا تعاون حاصل کرتا رہے۔ کیونکہ میں نے ان کو ( کوفہ کی گورنری سے ) نااہلی یا کسی خیانت کی وجہ سے معزول نہیں کیا ہے اور عمر نے فرمایا: میں اپنے بعد ہونے والے خلیفہ کو مہاجرین اولین کے بارے میں وصیت کرتا ہوں کہ وہ ان کے حقوق پہچانے اور ان کے احترام کو ملحوظ رکھے اور میں اپنے بعد ہونے والے خلیفہ کو وصیت کرتا ہوں کہ وہ انصار کے ساتھ بہتر معاملہ کرے جو دارالہجرت اور دارالایمان ( مدینہ منورہ ) میں ( رسول اللہ صلی اللہ علیہ وسلم کی تشریف آوری سے پہلے سے ) مقیم ہیں۔ ( خلیفہ کو چاہیے ) کہ وہ ان کے نیکوں کو نوازے اور ان کے بروں کو معاف کر دیا کرے اور میں ہونے والے خلیفہ کو وصیت کرتا ہوں کہ شہری آبادی کے ساتھ بھی اچھا معاملہ رکھے کہ یہ لوگ اسلام کی مدد، مال جمع کرنے کا ذریعہ اور ( اسلام کے ) دشمنوں کے لیے ایک مصیبت ہیں اور یہ کہ ان سے وہی وصول کیا جائے جو ان کے پاس فاضل ہو اور ان کی خوشی سے لیا جائے اور میں ہونے والے خلیفہ کو بدویوں کے ساتھ بھی اچھا معاملہ کرنے کی وصیت کرتا ہوں کہ وہ اصل عرب ہیں اور اسلام کی جڑ ہیں اور یہ کہ ان سے ان کا بچا کھچا مال وصول کیا جائے اور انہیں کے محتاجوں میں تقسیم کر دیا جائے اور میں ہونے والے خلیفہ کو اللہ اور اس کے رسول کے عہد کی نگہداشت کی ( جو اسلامی حکومت کے تحت غیر مسلموں سے کیا ہے ) وصیت کرتا ہوں کہ ان سے کئے گئے عہد کو پورا کیا جائے، ان کی حفاظت کے لیے جنگ کی جائے اور ان کی حیثیت سے زیادہ ان پر بوجھ نہ ڈالا جائے، جب عمر رضی اللہ عنہ کی وفات ہو گئی تو ہم وہاں سے ان کو لے کر ( عائشہ رضی اللہ عنہا ) کے حجرہ کی طرف آئے۔ عبداللہ بن عمر رضی اللہ عنہما نے سلام کیا اور عرض کیا کہ عمر بن خطاب رضی اللہ عنہ نے اجازت چاہی ہے۔ ام المؤمنین نے کہا انہیں یہیں دفن کیا جائے۔ چنانچہ وہ وہیں دفن ہوئے، پھر جب لوگ دفن سے فارغ ہو چکے تو وہ جماعت ( جن کے نام عمر رضی اللہ عنہ نے وفات سے پہلے بتائے تھے ) جمع ہوئی عبدالرحمٰن بن عوف نے کہا: تمہیں اپنا معاملہ اپنے ہی میں سے تین آدمیوں کے سپرد کر دینا چاہیے اس پر زبیر رضی اللہ عنہ نے کہا کہ میں نے اپنا معاملہ علی رضی اللہ عنہ کے سپرد کیا۔ طلحہ رضی اللہ عنہ نے کہا کہ میں اپنا معاملہ عثمان رضی اللہ عنہ کے سپرد کرتا ہوں اور سعد بن ابی وقاص رضی اللہ عنہ نے کہا کہ میں نے اپنا معاملہ عبدالرحمٰن بن عوف کے سپرد کیا۔ اس کے بعد عبدالرحمٰن بن عوف رضی اللہ عنہ نے ( عثمان اور علی رضی اللہ عنہما کو مخاطب کر کے ) کہا کہ آپ دونوں حضرات میں سے جو بھی خلافت سے اپنی برات ظاہر کرے ہم اسی کو خلافت دیں گے اور اللہ اس کا نگراں و نگہبان ہو گا اور اسلام کے حقوق کی ذمہ داری اس پر لازم ہو گی۔ ہر شخص کو غور کرنا چاہیے کہ اس کے خیال میں کون افضل ہے، اس پر یہ دونوں حضرات خاموش ہو گئے تو عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا: کیا آپ حضرات اس انتخاب کی ذمہ داری مجھ پر ڈالتے ہیں، اللہ کی قسم کہ میں آپ حضرات میں سے اسی کو منتخب کروں گا جو سب میں افضل ہو گا۔ ان دونوں حضرات نے کہا کہ جی ہاں، پھر آپ نے ان دونوں میں سے ایک کا ہاتھ پکڑا اور فرمایا کہ آپ کی قرابت رسول اللہ صلی اللہ علیہ وسلم سے ہے اور ابتداء میں اسلام لانے کا شرف بھی۔ جیسا کہ آپ کو خود ہی معلوم ہے، پس اللہ آپ کا نگران ہے کہ اگر میں آپ کو خلیفہ بنا دوں تو کیا آپ عدل و انصاف سے کام لیں گے اور اگر عثمان رضی اللہ عنہ کو خلیفہ بنا دوں تو کیا آپ ان کے احکام سنیں گے اور ان کی اطاعت کریں گے؟ اس کے بعد دوسرے صاحب کو تنہائی میں لے گئے اور ان سے بھی یہی کہا اور جب ان سے وعدہ لے لیا تو فرمایا: اے عثمان! اپنا ہاتھ بڑھایئے۔ چنانچہ انہوں نے ان سے بیعت کی اور علی رضی اللہ عنہ نے بھی ان سے بیعت کی، پھر اہل مدینہ آئے اور سب نے بیعت کی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3701,
			"arabicnumber": 3701,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالعزیز نے بیان کیا، ان سے ابوحازم نے اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے جنگ خیبر کے موقع پر بیان فرمایا کہ کل میں ایک ایسے شخص کو اسلامی عَلم دوں گا جس کے ہاتھ پر اللہ تعالیٰ فتح عنایت فرمائے گا، راوی نے بیان کیا کہ رات کو لوگ یہ سوچتے رہے کہ دیکھئیے عَلم کسے ملتا ہے، جب صبح ہوئی تو آپ صلی اللہ علیہ وسلم کی خدمت میں سب حضرات ( جو سرکردہ تھے ) حاضر ہوئے، سب کو امید تھی کہ عَلم انہیں ہی ملے گا، لیکن آپ صلی اللہ علیہ وسلم نے دریافت فرمایا، علی بن ابی طالب کہاں ہیں؟ لوگوں نے بتایا کہ ان کی آنکھوں میں درد ہے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر ان کے یہاں کسی کو بھیج کر بلوا لو، جب وہ آئے تو آپ صلی اللہ علیہ وسلم نے ان کی آنکھ میں اپنا تھوک ڈالا اور ان کے لیے دعا فرمائی، اس سے انہیں ایسی شفاء حاصل ہوئی جیسے کوئی مرض پہلے تھا ہی نہیں، چنانچہ آپ نے عَلم انہیں کو عنایت فرمایا۔ علی رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! میں ان سے اتنا لڑوں گا کہ وہ ہمارے جیسے ہو جائیں ( یعنی مسلمان بن جائیں ) آپ نے فرمایا: ابھی یوں ہی چلتے رہو، جب ان کے میدان میں اترو تو پہلے انہیں اسلام کی دعوت دو اور انہیں بتاؤ کہ اللہ کے ان پر کیا حقوق واجب ہیں، اللہ کی قسم اگر تمہارے ذریعہ اللہ تعالیٰ ایک شخص کو بھی ہدایت دیدے تو وہ تمہارے لیے سرخ اونٹوں ( کی دولت ) سے بہتر ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3702,
			"arabicnumber": 3702,
			"text": "(ہم سے قتیبہ بن سعید نے بیان کیا، ان سے حاتم نے بیان کیا، ان سے یزید بن ابی عبید نے بیان کیا، ان سے سلمہ بن اکوع رضی اللہ عنہ نے بیان کیا کہ علی رضی اللہ عنہ غزوہ خیبر کے موقع پر نبی کریم صلی اللہ علیہ وسلم کے ساتھ بوجہ آنکھ دکھنے کے نہیں آ سکے تھے، پھر انہوں نے سوچا میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ غزوہ میں شریک نہ ہو سکوں! چنانچہ گھر سے نکلے اور آپ کے لشکر سے جا ملے، جب اس رات کی شام آئی جس کی صبح کو اللہ تعالیٰ نے فتح عنایت فرمائی تھی تو آپ صلی اللہ علیہ وسلم نے فرمایا: کل میں ایک ایسے شخص کو عَلم دوں گا یا آپ صلی اللہ علیہ وسلم نے یوں فرمایا کہ کل ) ایک ایسا شخص عَلم کو لے گا جس سے اللہ اور اس کے رسول کو محبت ہے یا آپ نے یہ فرمایا کہ جو اللہ اور اس کے رسول سے محبت رکھتا ہے اور اللہ تعالیٰ اس کے ہاتھ پر فتح عنایت فرمائے گا، اتفاق سے علی رضی اللہ عنہ آ گئے، حالانکہ ان کے آنے کی ہمیں امید نہیں تھی لوگوں نے بتایا کہ یہ ہیں علی رضی اللہ عنہ۔ آپ صلی اللہ علیہ وسلم نے عَلم انہیں دے دیا، اور اللہ تعالیٰ نے ان کے ہاتھ پر خیبر کو فتح کرا دیا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3703,
			"arabicnumber": 3703,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا، ان سے ان کے والد نے کہ ایک شخص سہل بن سعد رضی اللہ عنہ کے یہاں آیا اور کہا کہ یہ فلاں شخص اس کا اشارہ امیر مدینہ ( مروان بن حکم ) کی طرف تھا، برسر منبر علی رضی اللہ عنہ کو برا بھلا کہتا ہے، ابوحازم نے بیان کیا کہ سہل بن سعد رضی اللہ عنہ نے پوچھا کیا کہتا ہے؟ اس نے بتایا کہ انہیں ”ابوتراب“ کہتا ہے، اس پر سہل ہنسنے لگے اور فرمایا کہ اللہ کی قسم! یہ نام تو ان کا رسول اللہ صلی اللہ علیہ وسلم نے رکھا تھا اور خود علی رضی اللہ عنہ کو اس نام سے زیادہ اپنے لیے اور کوئی نام پسند نہیں تھا۔ یہ سن کر میں نے اس حدیث کے جاننے کے لیے سہل رضی اللہ عنہ سے خواہش ظاہر کی اور عرض کیا: اے ابوعباس! یہ واقعہ کس طرح سے ہے؟ انہوں نے بیان کیا کہ ایک مرتبہ علی رضی اللہ عنہ فاطمہ رضی اللہ عنہا کے یہاں آئے اور پھر باہر آ کر مسجد میں لیٹ رہے، پھر آپ صلی اللہ علیہ وسلم نے ( فاطمہ رضی اللہ عنہا سے ) دریافت فرمایا، تمہارے چچا کے بیٹے کہاں ہیں؟ انہوں نے بتایا کہ مسجد میں ہیں۔ آپ صلی اللہ علیہ وسلم مسجد میں تشریف لائے، دیکھا تو ان کی چادر پیٹھ سے نیچے گر گئی ہے اور ان کی کمر پر اچھی طرح سے خاک لگ چکی ہے۔ آپ صلی اللہ علیہ وسلم مٹی ان کی کمر سے صاف فرمانے لگے اور بولے، اٹھو اے ابوتراب اٹھو! ( دو مرتبہ آپ صلی اللہ علیہ وسلم نے فرمایا ) ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3704,
			"arabicnumber": 3704,
			"text": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے حسین نے، ان سے زائدۃ نے، ان سے ابوحصین نے، ان سے سعد بن عبیدہ نے بیان کیا کہ ایک شخص عبداللہ بن عمر رضی اللہ عنہما کی خدمت میں آیا اور عثمان رضی اللہ عنہ کے متعلق پوچھا، ابن عمر رضی اللہ عنہما نے ان کے محاسن کا ذکر کیا، پھر کہا کہ شاید یہ باتیں تمہیں بری لگی ہوں گی، اس نے کہا جی ہاں، ابن عمر رضی اللہ عنہما نے کہا اللہ تیری ناک خاک آلودہ کرے پھر اس نے علی رضی اللہ عنہ کے متعلق پوچھا، انہوں نے ان کے بھی محاسن ذکر کئے اور کہا کہ علی رضی اللہ عنہ کا گھرانہ نبی کریم صلی اللہ علیہ وسلم کے خاندان کا نہایت عمدہ گھرانہ ہے، پھر کہا شاید یہ باتیں بھی تمہیں بری لگی ہوں گی، اس نے کہا کہ جی ہاں، عبداللہ بن عمر رضی اللہ عنہما بولے اللہ تیری ناک خاک آلودہ کرے، جا، اور میرا جو بگاڑنا چاہے بگاڑ لینا، کچھ کمی نہ کرنا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3705,
			"arabicnumber": 3705,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے حکم نے، انہوں نے ابن ابی لیلیٰ سے سنا، کہا ہم سے علی رضی اللہ عنہ نے بیان کیا کہ فاطمہ رضی اللہ عنہا نے ( نبی کریم صلی اللہ علیہ وسلم سے ) چکی پیسنے کی تکلیف کی شکایت کی، اس کے بعد آپ صلی اللہ علیہ وسلم کے پاس کچھ قیدی آئے تو فاطمہ رضی اللہ عنہا آپ کے پاس آئیں لیکن آپ موجود نہیں تھے۔ عائشہ رضی اللہ عنہا سے ان کی ملاقات ہوئی تو ان سے اس کے بارے میں انہوں نے بات کی جب نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو عائشہ رضی اللہ عنہا نے آپ صلی اللہ علیہ وسلم کو فاطمہ رضی اللہ عنہا کے آنے کی اطلاع دی، اس پر نبی کریم صلی اللہ علیہ وسلم خود ہمارے گھر تشریف لائے، اس وقت ہم اپنے بستروں پر لیٹ چکے تھے، میں نے چاہا کہ کھڑا ہو جاؤں لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ یوں ہی لیٹے رہو، اس کے بعد آپ ہم دونوں کے درمیان بیٹھ گئے اور میں نے آپ صلی اللہ علیہ وسلم کے قدموں کی ٹھنڈک اپنے سینے میں محسوس کی،۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگوں نے مجھ سے جو طلب کیا ہے کیا میں تمہیں اس سے اچھی بات نہ بتاؤں، جب تم سونے کے لیے بستر پر لیٹو تو چونتیس مرتبہ اللہ اکبر، تینتیس مرتبہ سبحان اللہ اور تینتیس مرتبہ الحمدللہ پڑھ لیا کرو، یہ عمل تمہارے لیے کسی خادم سے بہتر ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3706,
			"arabicnumber": 3706,
			"text": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے سعد نے، انہوں نے ابراہیم بن سعد سے سنا، ان سے ان کے والد نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ سے فرمایا کہ کیا تم اس پر خوش نہیں ہو کہ تم میرے لیے ایسے ہو جیسے موسیٰ علیہ السلام کے لیے ہارون علیہ السلام تھے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3707,
			"arabicnumber": 3707,
			"text": "ہم سے علی بن جعد نے بیان کیا، کہا ہم کو شعبہ نے خبر دی، انہیں ایوب نے، انہیں ابن سیرین نے، انہیں عبیدہ نے کہ علی رضی اللہ عنہ نے عراق والوں سے کہا کہ جس طرح تم پہلے فیصلہ کیا کرتے تھے اب بھی کیا کرو کیونکہ میں اختلاف کو برا جانتا ہوں۔ اس وقت تک کہ سب لوگ جمع ہو جائیں یا میں بھی اپنے ساتھیوں ( ابوبکر و عمر رضی اللہ عنہما ) کی طرح دنیا سے چلا جاؤں، ابن سیرین رحمہ اللہ کہا کرتے تھے کہ عام لوگ ( روافض ) جو علی رضی اللہ عنہ سے روایات ( شیخین کی مخالفت میں ) بیان کرتے ہیں وہ قطعاً جھوٹی ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3708,
			"arabicnumber": 3708,
			"text": "ہم سے احمد بن ابی بکر نے بیان کیا، کہا ہم سے محمد بن ابراہیم بن دینار ابوعبداللہ جہنی نے بیان کیا، ان سے ابن ابی ذئب نے، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ لوگ کہتے ہیں کہ ابوہریرہ بہت احادیث بیان کرتا ہے، حالانکہ پیٹ بھرنے کے بعد میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہر وقت رہتا تھا، میں خمیری روٹی نہ کھاتا اور نہ عمدہ لباس پہنتا تھا ( یعنی میرا وقت علم کے سوا کسی دوسری چیز کے حاصل کرنے میں نہ جاتا ) اور نہ میری خدمت کے لیے کوئی فلاں یا فلانی تھی بلکہ میں بھوک کی شدت کی وجہ سے اپنے پیٹ سے پتھر باندھ لیا کرتا۔ بعض وقت میں کسی کو کوئی آیت اس لیے پڑھ کر اس کا مطلب پوچھتا تھا کہ وہ اپنے گھر لے جا کر مجھے کھانا کھلا دے، حالانکہ مجھے اس آیت کا مطلب معلوم ہوتا تھا، مسکینوں کے ساتھ سب سے بہتر سلوک کرنے والے جعفر بن ابی طالب رضی اللہ عنہ تھے، ہمیں اپنے گھر لے جاتے اور جو کچھ بھی گھر میں موجود ہوتا وہ ہم کو کھلاتے۔ بعض اوقات تو ایسا ہوتا کہ صرف شہد یا گھی کی کپی ہی نکال کر لاتے اور اسے ہم پھاڑ کر اس میں جو کچھ ہوتا اسے ہی چاٹ لیتے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3709,
			"arabicnumber": 3709,
			"text": "ہم سے عمرو بن علی نے بیان کیا، انہوں نے کہا ہم سے یزید بن ہارون نے بیان کیا، انہوں نے کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا، انہیں شعبی نے خبر دی کہ جب عبداللہ بن عمر رضی اللہ عنہما جعفر رضی اللہ عنہ کے صاحبزادے کو سلام کرتے تو یوں کہا کرتے «السلام عليك يا ابن ذي الجناحين‏.‏» اے دو پروں والے بزرگ کے صاحبزادے تم پر سلام ہو۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا حدیث میں جو «جناحين‏.‏» کا لفظ ہے اس سے مراد دو گوشے ( کونے ) ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3710,
			"arabicnumber": 3710,
			"text": "ہم سے حسن بن محمد نے بیان کیا، ان سے محمد بن عبداللہ انصاری نے بیان کیا، ان سے ابوعبداللہ بن مثنیٰ نے بیان کیا، ان سے ثمامہ بن عبداللہ بن انس نے اور ان سے انس رضی اللہ عنہ نے کہ عمر بن خطاب رضی اللہ عنہ قحط کے زمانے میں عباس بن عبدالمطلب رضی اللہ عنہ کو آگے بڑھا کر بارش کی دعا کراتے اور کہتے کہ اے اللہ پہلے ہم اپنے نبی کریم صلی اللہ علیہ وسلم سے بارش کی دعا کراتے تھے تو ہمیں سیرابی عطا کرتا تھا اور اب ہم اپنے نبی کے چچا کے ذریعہ بارش کی دعا کرتے ہیں۔ اس لیے ہمیں سیرابی عطا فرما۔ راوی نے بیان کیا کہ اس کے بعد خوب بارش ہوئی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3712,
			"arabicnumber": 3712,
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3713,
			"arabicnumber": 3713,
			"text": "مجھے عبداللہ بن عبدالوہاب نے خبر دی، کہا کہ ہم سے خالد نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے واقد نے بیان کیا کہ میں نے اپنے والد سے سنا، وہ ابن عمر رضی اللہ عنہما سے بیان کرتے تھے، وہ ابوبکر رضی اللہ عنہ سے کہ انہوں نے کہا: نبی کریم صلی اللہ علیہ وسلم کا خیال آپ کے اہل بیت میں رکھو۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3714,
			"arabicnumber": 3714,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے ابن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے ان سے ابن ابی ملیکہ نے ان سے مسور بن مخرمہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ فاطمہ میرے جسم کا ٹکرا ہے، اس لیے جس نے اسے ناحق ناراض کیا، اس نے مجھے ناراض کیا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3716,
			"arabicnumber": 3716,
			"text": "تو انہوں نے بتایا کہ پہلے مجھ سے نبی کریم صلی اللہ علیہ وسلم نے آہستہ سے یہ فرمایا تھا کہ وہ اپنی اسی بیماری میں وفات پا جائیں گے، میں اس پر رونے لگی۔ پھر مجھ سے نبی کریم صلی اللہ علیہ وسلم نے آہستہ سے فرمایا کہ آپ کے اہل بیت میں سب سے پہلے میں آپ سے جا ملوں گی، اس پر میں ہنسی تھی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3717,
			"arabicnumber": 3717,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، کہا ہم سے علی بن مسہر نے، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے بیان کیا کہ مجھے مروان بن حکم نے خبر دی کہ جس سال نکسیر پھوٹنے کی بیماری پھوٹ پڑی تھی اس سال عثمان رضی اللہ عنہ کو اتنی سخت نکسیر پھوٹی کہ آپ حج کے لیے بھی نہ جا سکے، اور ( زندگی سے مایوس ہو کر ) وصیت بھی کر دی، پھر ان کی خدمت میں قریش کے ایک صاحب گئے اور کہا کہ آپ کسی کو اپنا خلیفہ بنا دیں۔ عثمان رضی اللہ عنہ نے دریافت فرمایا: کیا یہ سب کی خواہش ہے، انہوں نے کہا جی ہاں۔ آپ نے پوچھا کہ کسے بناؤں؟ اس پر وہ خاموش ہو گئے۔ اس کے بعد ایک دوسرے صاحب گئے۔ میرا خیال ہے کہ وہ حارث تھے،۔ انہوں نے بھی یہی کہا کہ آپ کسی کو خلیفہ بنا دیں، آپ نے ان سے بھی پوچھا کیا یہ سب کی خواہش ہے؟ انہوں نے کہا: جی ہاں، آپ نے پوچھا: لوگوں کی رائے کس کے لیے ہے؟ اس پر وہ بھی خاموش ہو گئے، تو آپ نے خود فرمایا: غالباً زبیر کی طرف لوگوں کا رجحان ہے؟ انہوں نے کہا جی ہاں، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میرے علم کے مطابق بھی وہی ان میں سب سے بہتر ہیں اور بلاشبہ وہ رسول اللہ صلی اللہ علیہ وسلم کی نظروں میں بھی ان میں سب سے زیادہ محبوب تھے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3718,
			"arabicnumber": 3718,
			"text": "مجھ سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے اسامہ نے بیان کیا، ان سے ہشام نے، انہیں ان کے والد نے خبر دی کہ میں نے مروان سے سنا کہ میں عثمان رضی اللہ عنہ کی خدمت میں موجود تھا کہ اتنے میں ایک صاحب آئے اور کہا کہ کسی کو آپ اپنا خلیفہ بنا دیجئیے،۔ آپ نے دریافت فرمایا کیا اس کی خواہش کی جا رہی ہے؟ انہوں نے بتایا کہ جی ہاں، زبیر رضی اللہ عنہ کی طرف لوگوں کا رجحان ہے، آپ نے اس پر فرمایا ٹھیک ہے، تم کو بھی معلوم ہے کہ وہ تم میں بہتر ہیں، آپ نے تین مرتبہ یہ بات دہرائی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3719,
			"arabicnumber": 3719,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے عبدالعزیز نے بیان کیا جو ابوسلمہ کے صاحبزادے تھے، ان سے محمد نے بیان کیا، ان سے محمد بن منکدر نے بیان کیا، اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہر نبی کے حواری ہوتے ہیں اور میرے حواری زبیر بن عوام ( رضی اللہ عنہ ) ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3720,
			"arabicnumber": 3720,
			"text": "ہم سے احمد بن محمد نے بیان کیا، کہا ہم کو ہشام بن عروہ نے خبر دی، انہیں ان کے والد نے اور ان سے عبداللہ بن زبیر رضی اللہ عنہما نے بیان کیا کہ جنگ احزاب کے موقع پر مجھے اور عمر بن ابی سلمہ رضی اللہ عنہما کو عورتوں میں چھوڑ دیا گیا تھا ( کیونکہ یہ دونوں حضرات بچے تھے ) میں نے اچانک دیکھا کہ زبیر رضی اللہ عنہ ( آپ کے والد ) اپنے گھوڑے پر سوار بنی قریظہ ( یہودیوں کے ایک قبیلہ کی ) طرف آ جا رہے ہیں۔ دو یا تین مرتبہ ایسا ہوا، پھر جب میں وہاں سے واپس آیا تو میں نے عرض کیا، ابا جان! میں نے آپ کو کئی مرتبہ آتے جاتے دیکھا۔ انہوں نے کہا: بیٹے! کیا واقعی تم نے بھی دیکھا ہے؟ میں نے عرض کیا: جی ہاں، انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ کون ہے جو بنو قریظہ کی طرف جا کر ان کی ( نقل و حرکت کے متعلق ) اطلاع میرے پاس لا سکے۔ اس پر میں وہاں گیا اور جب میں ( خبر لے کر ) واپس آیا تو آپ صلی اللہ علیہ وسلم نے ( فرط مسرت میں ) اپنے والدین کا ایک ساتھ ذکر کر کے فرمایا کہ ”میرے ماں باپ تم پر فدا ہوں۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3721,
			"arabicnumber": 3721,
			"text": "ہم سے علی بن حفص نے بیان کیا، کہا ہم سے عبداللہ بن مبارک نے بیان کیا، کہا ہم کو ہشام بن عروہ نے خبر دی اور انہیں ان کے والد نے کہ جنگ یرموک کے موقع پر نبی کریم صلی اللہ علیہ وسلم کے صحابہ نے زبیر بن عوام رضی اللہ عنہ سے کہا آپ حملہ کیوں نہیں کرتے تاکہ ہم بھی آپ کے ساتھ حملہ کریں۔ چنانچہ انہوں نے ان ( رومیوں ) پر حملہ کیا۔ اس موقع پر انہوں نے ( رومیوں نے ) آپ کے دو کاری زخم شانے پر لگائے۔ درمیان میں وہ زخم تھا جو بدر کے موقع پر آپ کو لگا تھا۔ عروہ نے کہا کہ ( یہ زخم اتنے گہرے تھے کہ اچھے ہو جانے کے بعد ) میں بچپن میں ان زخموں کے اندر اپنی انگلیاں ڈال کر کھیلا کرتا تھا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3722,
			"arabicnumber": 3722,
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3724,
			"arabicnumber": 3724,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے خالد نے بیان کیا، ان سے خالد بن ابی خالد نے، ان سے قیس بن ابی حازم نے کہ میں نے طلحہ رضی اللہ عنہ کا وہ ہاتھ دیکھا ہے جس سے انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی ( جنگ احد میں ) حفاظت کی تھی وہ بالکل بیکار ہو چکا تھا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3725,
			"arabicnumber": 3725,
			"text": "مجھ سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، کہا کہ میں نے یحییٰ سے سنا، کہا کہ میں نے سعید بن مسیب سے سنا، کہا کہ میں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا وہ بیان کرتے تھے کہ جنگ احد کے موقع پر میرے لیے نبی کریم صلی اللہ علیہ وسلم نے اپنے والدین کو ایک ساتھ جمع کر کے یوں فرمایا کہ میرے ماں باپ تم پر فدا ہوں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3726,
			"arabicnumber": 3726,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، کہا ہم سے ہاشم بن ہاشم نے بیان کیا، ان سے عامر بن سعد نے اور ان سے ان کے والد (سعد بن ابی وقاص رضی اللہ عنہ) نے بیان کیا کہ مجھے خوب یاد ہے۔ میں نے ایک زمانے میں مسلمانوں کا تیسرا حصہ اپنے آپ کو دیکھا۔ امام بخاری رحمہ اللہ نے کہا اسلام کے تیسرے حصے سے یہ مراد ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ صرف تین مسلمان تھے جن میں تیسرا مسلمان میں تھا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3727,
			"arabicnumber": 3727,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ابن ابی زائدہ نے خبر دی، کہا ہم سے ہاشم بن ہاشم بن عتبہ بن ابی وقاص نے بیان کیا، کہا کہ میں نے سعید بن مسیب سے سنا، کہا کہ میں نے سعد بن ابی وقاص سے سنا، انہوں نے کہا کہ جس دن میں اسلام لایا، اسی دن دوسرے ( سب سے پہلے اسلام میں داخل ہونے والے حضرات صحابہ ) بھی اسلام میں داخل ہوئے ہیں اور میں سات دن تک اسی طور پر رہا کہ میں اسلام کا تیسرا فرد تھا۔ ابن ابی زائدہ کے ساتھ اس حدیث کو ابواسامہ نے بھی روایت کیا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3728,
			"arabicnumber": 3728,
			"text": "ہم سے ہاشم نے بیان کیا، کہا ہم سے عمرو بن عون نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، ان سے اسماعیل نے، ان سے قیس نے بیان کیا کہ میں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا، وہ بیان کرتے تھے کہ عرب میں سب سے پہلے اللہ کے راستے میں، میں نے تیر اندازی کی تھی ( ابتداء اسلام میں ) ہم نبی کریم صلی اللہ علیہ وسلم ، کے ساتھ اس طرح غزوات میں شرکت کرتے تھے کہ ہمارے پاس درخت کے پتوں کے سوا کھانے کے لیے کچھ بھی نہ ہوتا تھا، اس سے ہمیں اونٹ اور بکریوں کی طرح اجابت ہوتی تھی۔ یعنی ملی ہوئی نہیں ہوتی تھی۔ لیکن اب بنی اسد کا یہ حال ہے کہ اسلامی احکام پر عمل میں میرے اندر عیب نکالتے ہیں ( اگر ) ایسا ہو تو میں بالکل محروم اور بے نصیب ہی رہا اور میرے سب کام برباد ہو گئے۔ ہوا یہ تھا کہ بنی اسد نے عمر رضی اللہ عنہ سے سعد رضی اللہ عنہ کی چغلی کھائی تھی۔ یہ کہا تھا کہ وہ اچھی طرح نماز بھی نہیں پڑھتے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3729,
			"arabicnumber": 3729,
			"text": "ہم سے ابولیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، کہا مجھ سے علی بن حسین نے بیان کیا اور ان سے مسور بن مخرمہ رضی اللہ عنہ نے بیان کیا کہ علی رضی اللہ عنہ نے ابوجہل کی لڑکی کو ( جو مسلمان تھیں ) پیغام نکاح دیا، اس کی اطلاع جب فاطمہ رضی اللہ عنہا کو ہوئی تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں اور عرض کیا کہ آپ کی قوم کا خیال ہے کہ آپ کو اپنی بیٹیوں کی خاطر ( جب انہیں کوئی تکلیف دے ) کسی پر غصہ نہیں آتا۔ اب دیکھئیے یہ علی ابوجہل کی بیٹی سے نکاح کرنا چاہتے ہیں، اس پر آپ صلی اللہ علیہ وسلم نے صحابہ کو خطاب فرمایا: میں نے آپ صلی اللہ علیہ وسلم کو خطبہ پڑھتے سنا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا: امابعد: میں نے ابوالعاص بن ربیع سے ( زینب رضی اللہ عنہا کی، آپ کی سب سے بڑی صاحبزادی ) شادی کرائی تو انہوں نے جو بات بھی کہی اس میں وہ سچے اترے اور بلاشبہ فاطمہ بھی میرے ( جسم کا ) ایک ٹکڑا ہے اور مجھے یہ پسند نہیں کہ کوئی بھی اسے تکلیف دے۔ اللہ کی قسم! رسول اللہ کی بیٹی اور اللہ تعالیٰ کے ایک دشمن کی بیٹی ایک شخص کے پاس جمع نہیں ہو سکتیں۔ چنانچہ علی رضی اللہ عنہ نے اس شادی کا ارادہ ترک کر دیا۔ محمد بن عمرو بن حلحلہ نے ابن شہاب سے یہ اضافہ کیا ہے، انہوں نے علی بن حسین سے اور انہوں نے مسور رضی اللہ عنہ سے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ نے بنی عبدشمس کے اپنے ایک داماد کا ذکر کیا اور حقوق دامادی کی ادائیگی کی تعریف فرمائی۔ پھر فرمایا کہ انہوں نے مجھ سے جو بات بھی کہی سچی کہی اور جو وعدہ بھی کیا پورا کر دکھایا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3730,
			"arabicnumber": 3730,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، کہا ہم سے سلیمان نے بیان کیا، کہا کہ مجھ سے عبداللہ بن دینار نے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک فوج بھیجی اور اس کا امیر اسامہ بن زید کو بنایا۔ ان کے امیر بنائے جانے پر بعض لوگوں نے اعتراض کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر آج تم اس کے امیر بنائے جانے پر اعتراض کر رہے ہو تو اس سے پہلے اس کے باپ کے امیر بنائے جانے پر بھی تم نے اعتراض کیا تھا اور اللہ کی قسم! وہ ( زید رضی اللہ عنہ ) امارت کے مستحق تھے اور مجھے سب سے زیادہ عزیز تھے۔ اور یہ ( اسامہ رضی اللہ عنہ ) اب ان کے بعد مجھے سب سے زیادہ عزیز ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3731,
			"arabicnumber": 3731,
			"text": "ہم سے یحییٰ بن قزعہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے زہری نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک قیافہ شناس میرے یہاں آیا۔ نبی کریم صلی اللہ علیہ وسلم اس وقت وہیں تشریف رکھتے تھے اور اسامہ بن زید اور زید بن حارثہ ( ایک چادر میں ) لیٹے ہوئے تھے۔ ( منہ اور جسم کا سارا حصہ قدموں کے سوا چھپا ہوا تھا ) اس قیافہ شناس نے کہا کہ یہ پاؤں بعض، بعض سے نکلے ہوئے معلوم ہوتے ہیں۔ ( یعنی باپ بیٹے کے ہیں ) قیافہ شناس نے پھر بتایا کہ نبی کریم صلی اللہ علیہ وسلم اس کے اس اندازہ پر بہت خوش ہوئے اور پھر آپ نے عائشہ رضی اللہ عنہا سے بھی یہ واقعہ بیان فرمایا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3732,
			"arabicnumber": 3732,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے زہری نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ قریش مخزومیہ عورت کے معاملے کی وجہ سے بہت رنجیدہ تھے۔ انہوں نے یہ فیصلہ آپس میں کیا کہ اسامہ بن زید رضی اللہ عنہما کے سوا، جو رسول اللہ صلی اللہ علیہ وسلم کو انتہائی عزیز ہیں ( اس عورت کی سفارش کے لیے ) اور کون جرات کر سکتا ہے",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3733,
			"arabicnumber": 3733,
			"text": "(دوسری سند) اور ہم سے علی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، انہوں نے کہا کہ میں نے زہری سے مخزومیہ کی حدیث پوچھی تو وہ مجھ پر بہت غصہ ہو گئے۔ میں نے اس پر سفیان سے پوچھا کہ پھر آپ نے کسی اور ذریعہ سے اس حدیث کی روایت نہیں کی؟ انہوں نے بیان کیا کہ ایوب بن موسیٰ کی لکھی ہوئی ایک کتاب میں، میں نے یہ حدیث دیکھی۔ وہ زہری سے روایت کرتے تھے، وہ عروہ سے، وہ عائشہ رضی اللہ عنہا سے کہ بنی مخزوم کی ایک عورت نے چوری کر لی تھی۔ قریش نے ( اپنی مجلس میں ) سوچا کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اس عورت کی سفارش کے لیے کون جا سکتا ہے؟ کوئی اس کی جرات نہیں کر سکا، آخر اسامہ بن زید رضی اللہ عنہما نے سفارش کی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ بنی اسرائیل میں یہ دستور ہو گیا تھا کہ جب کوئی شریف آدمی چوری کرتا تو اسے چھوڑ دیتے اور اگر کوئی کمزور آدمی چوری کرتا تو اس کا ہاتھ کاٹتے۔ اگر آج فاطمہ ( رضی اللہ عنہا ) نے چوری کی ہوتی تو میں اس کا بھی ہاتھ کاٹتا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3734,
			"arabicnumber": 3734,
			"text": "مجھ سے حسن بن محمد نے بیان کیا، انہوں نے کہا ہم سے ابوعباد یحییٰ بن عباد نے بیان کیا، انہوں نے کہا ہم سے ماجشون نے بیان کیا، انہیں عبداللہ بن دینار نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے ایک دن ایک صاحب کو مسجد میں دیکھا کہ اپنا کپڑا ایک کونے میں پھیلا رہے تھے۔ انہوں نے کہا دیکھو یہ کون صاحب ہیں؟ کاش! یہ میرے قریب ہوتے۔ ایک شخص نے کہا اے ابوعبدالرحمٰن! کیا آپ انہیں نہیں پہچانتے؟ یہ محمد بن اسامہ رضی اللہ عنہ ہیں۔ ابن دینار نے بیان کیا کہ یہ سنتے ہی عبداللہ بن عمر رضی اللہ عنہما نے اپنا سر جھکا لیا اور اپنے ہاتھوں سے زمین کریدنے لگے پھر بولے اگر رسول اللہ صلی اللہ علیہ وسلم انہیں دیکھتے تو یقیناً آپ ان سے محبت فرماتے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3735,
			"arabicnumber": 3735,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے معتمر نے بیان کیا، کہا کہ میں نے اپنے باپ سے سنا، کہا ہم سے ابوعثمان نے بیان کیا، اور ان سے اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم انہیں اور حسن رضی اللہ عنہ کو پکڑ لیتے اور فرماتے: اے اللہ! تو انہیں اپنا محبوب بنا کہ میں ان سے محبت کرتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3736,
			"arabicnumber": 3736,
			"text": "اور نعیم نے کہا ان سے ابن مبارک نے بیان کیا، انہیں معمر نے خبر دی، انہیں زہری نے، انہیں اسامہ بن زید رضی اللہ عنہما کے ایک مولیٰ (حرملہ) نے خبر دی کہ حجاج بن ایمن بن ام ایمن کو عبداللہ بن عمر رضی اللہ عنہما نے دیکھا ( نماز میں ) انہوں نے رکوع اور سجدہ پوری طرح نہیں ادا کیا، ( ایمن ابن ام ایمن، اسامہ رضی اللہ عنہ کی ماں کی طرف سے بھائی تھے، ایمن رضی اللہ عنہ قبیلہ انصار کے ایک فرد تھے ) تو ابن عمر رضی اللہ عنہما نے ان سے کہا کہ ( نماز ) دوبارہ پڑھ لو۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3737,
			"arabicnumber": 3737,
			"text": "ابوعبداللہ (امام بخاری رحمہ اللہ) نے کہا کہ مجھ سے سلیمان بن عبدالرحمٰن نے بیان کیا، کہا ہم سے ولید نے بیان کیا، کہا ہم سے عبدالرحمٰن بن نمر نے بیان کیا، ان سے زہری نے، ان سے اسامہ بن زید رضی اللہ عنہما کے مولیٰ حرملہ نے بیان کیا کہ وہ عبداللہ بن عمر رضی اللہ عنہما کی خدمت میں حاضر تھے کہ حجاج بن ایمن ( مسجد کے ) اندر آئے نہ انہوں نے رکوع پوری طرح ادا کیا تھا اور نہ سجدہ۔ ابن عمر رضی اللہ عنہما نے ان سے فرمایا کہ نماز دوبارہ پڑھ لو۔ پھر جب وہ جانے لگے تو انہوں نے مجھ سے پوچھا کہ یہ کون ہیں؟ میں نے عرض کیا حجاج بن ایمن ابن ام ایمن ہیں۔ اس پر آپ نے کہا اگر انہیں رسول اللہ صلی اللہ علیہ وسلم دیکھتے تو بہت عزیز رکھتے، پھر آپ نے نبی کریم صلی اللہ علیہ وسلم کی اسامہ رضی اللہ عنہ اور ام ایمن رضی اللہ عنہا کی تمام اولاد سے محبت کا ذکر کیا۔ امام بخاری رحمہ اللہ نے بیان کیا کہ مجھ سے میرے بعض اساتذہ نے بیان کیا اور ان سے سلیمان نے کہ ام ایمن رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کو گود لیا تھا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3739,
			"arabicnumber": 3739,
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3740,
			"arabicnumber": 3740,
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3742,
			"arabicnumber": 3742,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، کہا ہم سے اسرائیل نے بیان کیا، ان سے مغیرہ نے، ان سے ابراہیم نے، ان سے علقمہ نے بیان کیا کہ میں جب شام آیا تو میں نے دو رکعت نماز پڑھ کر یہ دعا کی کہ اے اللہ! مجھے کوئی نیک ساتھی عطا فرما۔ پھر میں ایک قوم کے پاس آیا اور ان کی مجلس میں بیٹھ گیا، تھوڑی ہی دیر بعد ایک بزرگ آئے اور میرے پاس بیٹھ گئے۔ میں نے پوچھا یہ کون بزرگ ہیں؟ لوگوں نے بتایا کہ یہ ابودرداء رضی اللہ عنہ ہیں۔ اس پر میں نے عرض کیا کہ میں نے اللہ تعالیٰ سے دعا کی تھی کہ کوئی نیک ساتھی مجھے عطا فرما، تو اللہ تعالیٰ نے آپ کو مجھے عنایت فرمایا۔ انہوں نے دریافت کیا، تمہارا وطن کہاں ہے؟ میں نے عرض کیا کوفہ ہے۔ انہوں نے کہا کیا تمہارے یہاں «ابن أم عبد صاحب النعلين والوساد والمطهرة» ( یعنی عبداللہ بن مسعود رضی اللہ عنہ ) نہیں ہیں؟ کیا تمہارے یہاں وہ نہیں ہیں جنہیں اللہ تعالیٰ اپنے نبی کریم صلی اللہ علیہ وسلم کی زبانی شیطان سے پناہ دے چکا ہے کہ وہ انہیں کبھی غلط راستے پر نہیں لے جا سکتا۔ ( مراد عمار رضی اللہ عنہ سے تھی ) کیا تم میں وہ نہیں ہیں جو رسول اللہ صلی اللہ علیہ وسلم کے بتائے ہوئے بہت سے بھیدوں کے حامل ہیں جنہیں ان کے سوا اور کوئی نہیں جانتا۔ ( یعنی حذیفہ رضی اللہ عنہ ) اس کے بعد انہوں نے دریافت فرمایا: عبداللہ رضی اللہ عنہ آیت «والليل إذا يغشى‏» کی تلاوت کس طرح کرتے ہیں؟ میں نے انہیں پڑھ کر سنائی کہ «والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏» اس پر انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے خود اپنی زبان مبارک سے مجھے بھی اسی طرح یاد کرایا تھا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3743,
			"arabicnumber": 3743,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے مغیرہ نے بیان کیا، ان سے ابراہیم نے بیان کیا کہ علقمہ رضی اللہ عنہ شام میں تشریف لے گئے اور مسجد میں جا کر یہ دعا کی۔ اے اللہ! مجھے ایک نیک ساتھی عطا فرما، چنانچہ آپ کو ابودرداء رضی اللہ عنہ کی صحبت نصیب ہوئی۔ ابودرداء رضی اللہ عنہ نے دریافت کیا: تمہارا تعلق کہاں سے ہے؟ عرض کیا کہ کوفہ سے، اس پر انہوں نے کہا: کیا تمہارے یہاں نبی کریم صلی اللہ علیہ وسلم کے راز دار نہیں ہیں کہ ان رازوں کو ان کے سوا اور کوئی نہیں جانتا؟ ( ان کی مراد ابوحذیفہ رضی اللہ عنہ سے تھی ) انہوں نے بیان کیا کہ میں نے عرض کیا جی ہاں موجود ہیں، پھر انہوں نے کہا کیا تم میں وہ شخص نہیں ہیں جنہیں اللہ تعالیٰ نے اپنے نبی کی زبانی شیطان سے اپنی پناہ دی تھی۔ ان کی مراد عمار رضی اللہ عنہ سے تھی۔ میں نے عرض کیا کہ جی ہاں وہ بھی موجود ہیں، اس کے بعد انہوں نے دریافت کیا کہ عبداللہ بن مسعود رضی اللہ عنہ آیت «والليل إذا يغشى * والنهار إذا تجلى‏» کی قرآت کس طرح کرتے تھے؟ میں نے کہا کہ وہ ( «وما خلق» کے حذف کے ساتھ ) «والذكر والأنثى‏» پڑھا کرتے تھے۔ اس پر انہوں نے کہا یہ شام والے ہمیشہ اس کوشش میں رہے کہ اس آیت کی تلاوت کو جس طرح میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا اس سے مجھے ہٹا دیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3744,
			"arabicnumber": 3744,
			"text": "ہم سے عمرو بن علی نے بیان کیا، کہا ہم سے عبدالاعلیٰ نے بیان کیا، کہا ہم سے خالد نے بیان کیا، ان سے ابوقلابہ نے بیان کیا، اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہر امت میں امین ہوتے ہیں اور اس امت کے امین ابوعبیدہ بن جراح ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3745,
			"arabicnumber": 3745,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابواسحٰق نے، ان سے صلہ نے اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے اہل نجران سے فرمایا کہ میں تمہارے یہاں ایک امین کو بھیجوں گا جو حقیقی معنوں میں امین ہو گا۔ یہ سن کر تمام صحابہ کرام رضی اللہ عنہم کو شوق ہوا لیکن آپ صلی اللہ علیہ وسلم نے ابوعبیدہ رضی اللہ عنہ کو بھیجا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3746,
			"arabicnumber": 3746,
			"text": "ہم سے صدقہ نے بیان کیا، کہا ہم سے ابن عیینہ نے بیان کیا، کہا ہم سے ابوموسیٰ نے بیان کیا، ان سے حسن نے، انہوں نے ابوبکرہ رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم منبر پر تشریف فرما تھے اور حسن رضی اللہ عنہ آپ کے پہلو میں تھے، آپ کبھی لوگوں کی طرف متوجہ ہوتے اور پھر حسن رضی اللہ عنہ کی طرف اور فرماتے: میرا یہ بیٹا سردار ہے اور امید ہے کہ اللہ تعالیٰ اس کے ذریعہ مسلمانوں کی دو جماعتوں میں صلح کرائے گا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3747,
			"arabicnumber": 3747,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے معتمر نے بیان کیا، انہوں نے کہا کہ میں نے اپنے والد سے سنا، انہوں نے بیان کیا کہ ہم سے ابوعثمان نے بیان کیا اور ان سے اسامہ بن زید رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم انہیں اور حسن رضی اللہ عنہ کو پکڑ کر یہ دعا کرتے تھے «اللهم إني أحبهما فأحبهما» ”اے اللہ! مجھے ان سے محبت ہے تو بھی ان سے محبت رکھ۔“ «أو كما قال‏.‏» ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3748,
			"arabicnumber": 3748,
			"text": "مجھ سے محمد بن حسین بن ابراہیم نے بیان کیا، کہا کہ مجھ سے حسین بن محمد نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے محمد نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ جب حسین رضی اللہ عنہ کا سر مبارک عبیداللہ بن زیاد کے پاس لایا گیا اور ایک طشت میں رکھ دیا گیا تو وہ بدبخت اس پر لکڑی سے مارنے لگا اور آپ کے حسن اور خوبصورتی کے بارے میں بھی کچھ کہا ( کہ میں نے اس سے زیادہ خوبصورت چہرہ نہیں دیکھا ) اس پر انس رضی اللہ عنہ نے کہا حسین رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم سے سب سے زیادہ مشابہ تھے۔ انہوں نے «وسمة‏.‏» کا خضاب استعمال کر رکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3749,
			"arabicnumber": 3749,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا کہ مجھے عدی نے خبر دی، کہا کہ میں نے براء رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ حسن رضی اللہ عنہ آپ کے کاندھے مبارک پر تھے اور آپ صلی اللہ علیہ وسلم یہ فرما رہے تھے ”اے اللہ! مجھے اس سے محبت ہے تو بھی اس سے محبت رکھ۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3750,
			"arabicnumber": 3750,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا کہ مجھے عمر بن سعید بن ابی حسین نے خبر دی، انہیں ابن ابی ملیکہ نے، ان سے عقبہ بن حارث نے بیان کیا کہ میں نے ابوبکر رضی اللہ عنہ کو دیکھا کہ آپ حسن رضی اللہ عنہ کو اٹھائے ہوئے ہیں اور فرما رہے ہیں: میرے باپ ان پر فدا ہوں، یہ نبی کریم صلی اللہ علیہ وسلم سے مشابہ ہیں، علی سے نہیں اور علی رضی اللہ عنہ مسکرا رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3751,
			"arabicnumber": 3751,
			"text": "مجھ سے یحییٰ بن معین اور صدقہ نے بیان کیا، کہا کہ ہمیں محمد بن جعفر نے خبر دی، انہیں شعبہ نے، انہیں واقد بن محمد نے، انہیں ان کے والد نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ ابوبکر رضی اللہ عنہ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم ( کی خوشنودی ) کو آپ کے اہل بیت کے ساتھ ( محبت و خدمت کے ذریعہ ) تلاش کرو۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3752,
			"arabicnumber": 3752,
			"text": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن یوسف نے خبر دی، انہیں معمر نے، انہیں زہری نے اور انہیں انس رضی اللہ عنہ نے، اور عبدالرزاق نے بیان کیا کہ ہمیں معمر نے خبر دی، انہیں زہری نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ حسن بن علی رضی اللہ عنہما سے زیادہ اور کوئی شخص نبی کریم صلی اللہ علیہ وسلم سے زیادہ مشابہ نہیں تھا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3753,
			"arabicnumber": 3753,
			"text": "مجھ سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے غندر نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے محمد بن ابی یعقوب نے، انہوں نے ابن ابی نعم سے سنا اور انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا اور کسی نے ان سے محرم کے بارے میں پوچھا تھا، شعبہ نے بیان کیا کہ میرے خیال میں یہ پوچھا تھا کہ اگر کوئی شخص ( احرام کی حالت میں ) مکھی مار دے تو اسے کیا کفارہ دینا پڑے گا؟ اس پر عبداللہ بن عمر رضی اللہ عنہما نے فرمایا: عراق کے لوگ مکھی کے بارے میں سوال کرتے ہیں جب کہ یہی لوگ رسول اللہ صلی اللہ علیہ وسلم کے نواسے کو قتل کر چکے ہیں، جن کے بارے میں نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ دونوں ( نواسے حسن و حسین رضی اللہ عنہما ) دنیا میں میرے دو پھول ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3754,
			"arabicnumber": 3754,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا، ان سے محمد بن منکدر نے کہا ہم کو جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ عمر رضی اللہ عنہ کہا کرتے تھے کہ ابوبکر رضی اللہ عنہ ہمارے سردار ہیں اور ہمارے سردار کو انہوں نے آزاد کیا ہے، ان کی مراد بلال حبشی رضی اللہ عنہ سے تھی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3755,
			"arabicnumber": 3755,
			"text": "ہم سے ابن نمیر نے بیان کیا، ان سے محمد بن عبید نے کہا، ہم سے اسماعیل نے بیان کیا، اور ان سے قیس نے کہ بلال رضی اللہ عنہ نے ابوبکر رضی اللہ عنہ سے کہا: اگر آپ نے مجھے اپنے لیے خریدا ہے تو پھر اپنے پاس ہی رکھئے اور اگر اللہ کے لیے خریدا ہے تو پھر مجھے آزاد کر دیجئیے اور اللہ کے راستے میں عمل کرنے دیجئیے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3756,
			"arabicnumber": 3756,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، ان سے خالد نے، ان سے عکرمہ نے کہ ابن عباس رضی اللہ عنہما نے کہا: مجھے نبی کریم صلی اللہ علیہ وسلم نے سینے سے لگایا اور فرمایا ”اے اللہ! اسے حکمت کا علم عطا فرما۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3757,
			"arabicnumber": 3757,
			"text": "ہم سے احمد بن واقد نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ایوب نے ان سے حمید بن ہلال نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے کسی اطلاع کے پہنچنے سے پہلے زید، جعفر اور ابن رواحہ رضی اللہ عنہم کی شہادت کی خبر صحابہ کو سنا دی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اب اسلامی عَلم کو زید ( رضی اللہ عنہ ) لیے ہوئے ہیں اور وہ شہید کر دیئے گئے، اب جعفر ( رضی اللہ عنہ ) نے عَلم اٹھا لیا اور وہ بھی شہید کر دیئے گئے، اب ابن رواحہ ( رضی اللہ عنہ ) نے عَلم اٹھا لیا اور وہ بھی شہید کر دیئے گئے، نبی کریم صلی اللہ علیہ وسلم کی آنکھوں سے آنسو جاری تھے پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اور آخر اللہ کی تلواروں میں سے ایک تلوار ( خالد بن ولید رضی اللہ عنہ ) نے عَلم اٹھا لیا اور اللہ تعالیٰ نے ان کے ہاتھ پر مسلمانوں کو فتح عنایت فرمائی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3758,
			"arabicnumber": 3758,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عمرو بن مرہ نے، ان سے ابراہیم نے اور ان سے مسروق نے کہ عبداللہ بن عمرو رضی اللہ عنہما کے یہاں عبداللہ بن مسعود کا ذکر ہوا تو انہوں نے کہا میں ان سے ہمیشہ محبت رکھوں گا کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ چار اشخاص سے قرآن سیکھو۔ عبداللہ بن مسعود، آپ صلی اللہ علیہ وسلم نے ابتداء عبداللہ بن مسعود رضی اللہ عنہ سے ہی کی اور ابوحذیفہ کے مولیٰ سالم، ابی بن کعب اور معاذ بن جبل سے، انہوں نے بیان کیا کہ مجھے پوری طرح یاد نہیں کہ نبی کریم صلی اللہ علیہ وسلم نے پہلے ابی بن کعب کا ذکر کیا یا معاذ بن جبل رضی اللہ عنہ کا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3760,
			"arabicnumber": 3760,
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3761,
			"arabicnumber": 3761,
			"text": "ہم سے موسیٰ نے بیان کیا، ان سے ابوعوانہ نے، ان سے مغیرہ نے، ان سے ابراہیم نے، ان سے علقمہ نے کہ میں شام پہنچا تو سب سے پہلے میں نے دو رکعت نماز پڑھی اور یہ دعا کی کہ اے اللہ! مجھے کسی ( نیک ) ساتھی کی صحبت سے فیض یابی کی توفیق عطا فرما۔ چنانچہ میں نے دیکھا کہ ایک بزرگ آ رہے ہیں، جب وہ قریب آ گئے تو میں نے سوچا کہ شاید میری دعا قبول ہو گئی ہے۔ انہوں نے دریافت فرمایا: آپ کا وطن کہاں ہے؟ میں نے عرض کیا کہ میں کوفہ کا رہنے والا ہوں، اس پر انہوں نے فرمایا: کیا تمہارے یہاں «صاحب النعلين والوساد والمطهرة» ( عبداللہ بن مسعود رضی اللہ عنہ ) نہیں ہیں؟ کیا تمہارے یہاں وہ صحابی نہیں ہیں جنہیں شیطان سے ( اللہ کی ) پناہ مل چکی ہے۔ ( یعنی عمار بن یاسر رضی اللہ عنہما ) کیا تمہارے یہاں سربستہ رازوں کے جاننے والے نہیں ہیں کہ جنہیں ان کے سوا اور کوئی نہیں جانتا ( پھر دریافت فرمایا ) ابن ام عبد ( عبداللہ بن مسعود رضی اللہ عنہ ) آیت «والليل‏» کی قرآت کس طرح کرتے ہیں؟ میں نے عرض کیا کہ «والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏» آپ نے فرمایا کہ مجھے بھی رسول اللہ صلی اللہ علیہ وسلم نے خود اپنی زبان مبارک سے اسی طرح سکھایا تھا۔ لیکن اب شام والے مجھے اس طرح قرآت کرنے سے ہٹانا چاہتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3762,
			"arabicnumber": 3762,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابواسحٰق نے، ان سے عبدالرحمٰن بن زید نے بیان کیا کہ ہم نے حذیفہ رضی اللہ عنہ سے پوچھا کہ صحابہ میں نبی کریم صلی اللہ علیہ وسلم سے عادات و اخلاق اور طور طریق میں سب سے زیادہ قریب کون سے صحابی تھے؟ تاکہ ہم ان سے سیکھیں، انہوں نے کہا اخلاق، طور طریق اور سیرت و عادت میں ابن ام عبد سے زیادہ آپ صلی اللہ علیہ وسلم سے قریب اور کسی کو میں نہیں سمجھتا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3763,
			"arabicnumber": 3763,
			"text": "مجھ سے محمد بن علاء نے بیان کیا، کہا ہم سے ابراہیم بن یوسف بن ابی اسحٰق نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، ان سے ابواسحٰق نے، کہا کہ مجھ سے اسود بن یزید نے بیان کیا، کہا کہ میں نے ابوموسیٰ اشعری رضی اللہ عنہ سے سنا: انہوں نے بیان کیا کہ میں اور میرے بھائی یمن سے ( مدینہ طیبہ ) حاضر ہوئے اور ایک زمانے تک یہاں قیام کیا، ہم اس پورے عرصہ میں یہی سمجھتے رہے کہ عبداللہ بن مسعود رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے گھرانے ہی کے ایک فرد ہیں، کیونکہ نبی کریم صلی اللہ علیہ وسلم کے گھر میں عبداللہ بن مسعود رضی اللہ عنہ اور ان کی والدہ کا ( بکثرت ) آنا جانا ہم خود دیکھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3764,
			"arabicnumber": 3764,
			"text": "کہا ہم سے حسن بن بشیر نے بیان کیا، ان سے عثمان بن اسود نے اور ان سے ابن ابی ملیکہ نے بیان کیا کہ معاویہ رضی اللہ عنہ نے عشاء کے بعد وتر کی نماز صرف ایک رکعت پڑھی وہیں ابن عباس رضی اللہ عنہما کے مولیٰ ( کریب ) بھی موجود تھے، جب وہ ابن عباس رضی اللہ عنہما کی خدمت میں حاضر ہوئے تو ( امیر معاویہ رضی اللہ عنہ کی ایک رکعت وتر کا ذکر کیا ) اس پر انہوں نے کہا: کوئی حرج نہیں ہے، انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی صحبت اٹھائی ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3765,
			"arabicnumber": 3765,
			"text": "ہم سے ابن ابی مریم نے بیان کیا، کہا ہم سے نافع بن عمر نے بیان کیا، کہا مجھ سے ابن ابی ملیکہ نے بیان کیا کہ عبداللہ بن عباس رضی اللہ عنہما سے کہا گیا کہ امیرالمؤمنین معاویہ رضی اللہ عنہ کے متعلق آپ کیا فرماتے ہیں، انہوں نے وتر کی نماز صرف ایک رکعت پڑھی ہے؟ انہوں نے کہا کہ وہ خود فقیہ ہیں۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3766,
			"arabicnumber": 3766,
			"text": "مجھ سے عمرو بن عباس نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابوالتیاح نے بیان کیا، انہوں نے حمران بن ابان سے سنا کہ معاویہ رضی اللہ عنہ نے کہا تم لوگ ایک خاص نماز پڑھتے ہو، ہم لوگ نبی کریم صلی اللہ علیہ وسلم کی صحبت میں رہے اور ہم نے کبھی آپ صلی اللہ علیہ وسلم کو اس وقت نماز پڑھتے نہیں دیکھا، بلکہ آپ نے تو اس سے منع فرمایا تھا۔ معاویہ رضی اللہ عنہ کی مراد عصر کے بعد دو رکعت نماز سے تھی ( جسے اس زمانے میں بعض لوگ پڑھتے تھے ) ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3767,
			"arabicnumber": 3767,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے ابن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے، ان سے ابن ابی ملیکہ نے اور ان سے مسور بن مخرمہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ فاطمہ میرے جسم کا ایک ٹکڑا ہے جس نے اسے ناراض کیا اس نے مجھے ناراض کیا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3768,
			"arabicnumber": 3768,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے یونس نے، ان سے ابن شہاب نے بیان کیا، ان سے ابوسلمہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک دن فرمایا ”اے عائش یہ جبرائیل علیہ السلام تشریف فرما ہیں اور تمہیں سلام کہتے ہیں“ میں نے اس پر جواب دیا وعلیہ السلام ورحمۃ اللہ وبرکاتہ، آپ وہ چیز ملاحظہ فرماتے ہیں جو مجھ کو نظر نہیں آتی ( آپ کی مراد نبی کریم صلی اللہ علیہ وسلم سے تھی ) ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3769,
			"arabicnumber": 3769,
			"text": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا (امام بخاری رحمہ اللہ نے) اور ہم سے عمرو نے بیان کیا، کہا ہم کو شعبہ نے خبر دی، انہیں عمرو بن مرہ نے، انہیں مرہ نے اور انہیں ابوموسیٰ اشعری رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”مردوں میں تو بہت سے کامل پیدا ہوئے لیکن عورتوں میں مریم بنت عمران، فرعون کی بیوی آسیہ کے سوا اور کوئی کامل پیدا نہیں ہوئی، اور عائشہ کی فضیلت عورتوں پر ایسی ہے جیسے ثرید کی فضیلت بقیہ تمام کھانوں پر ہے۔“",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3770,
			"arabicnumber": 3770,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا کہ مجھ سے محمد بن جعفر نے بیان کیا، ان سے عبداللہ بن عبدالرحمٰن نے اور انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے کہ عائشہ رضی اللہ عنہا کی فضیلت باقی عورتوں پر ایسی ہے جیسے ثرید کی فضیلت اور تمام کھانوں پر۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3771,
			"arabicnumber": 3771,
			"text": "محمد بن بشار نے مجھ سے بیان کیا، کہا ہم سے عبدالوہاب بن عبدالمجید نے بیان کیا، ہم سے ابن عون نے بیان کیا، ان سے قاسم بن محمد نے کہ عائشہ رضی اللہ عنہا بیمار پڑیں تو ابن عباس رضی اللہ عنہما عیادت کے لیے آئے اور عرض کیا: ام المؤمنین! آپ تو سچے جانے والے کے پاس جا رہی ہیں، یعنی رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر کے پاس ( عالم برزخ میں ان سے ملاقات مراد تھی ) ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3772,
			"arabicnumber": 3772,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے حکم نے اور انہوں نے ابووائل سے سنا، انہوں نے بیان کیا کہ جب علی رضی اللہ عنہ نے عمار اور حسن رضی اللہ عنہما کو کوفہ بھیجا تھا تاکہ لوگوں کو اپنی مدد کے لیے تیار کریں تو عمار رضی اللہ عنہ نے ان سے خطاب کرتے ہوئے فرمایا تھا: مجھے بھی خوب معلوم ہے کہ عائشہ رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی زوجہ ہیں اس دنیا میں بھی اور آخرت میں بھی، لیکن اللہ تعالیٰ تمہیں آزمانا چاہتا ہے کہ دیکھے تم علی رضی اللہ عنہ کی اتباع کرتے ہو ( جو برحق خلیفہ ہیں ) یا عائشہ رضی اللہ عنہا کی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3773,
			"arabicnumber": 3773,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ ( نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں جانے کے لیے ) آپ نے ( اپنی بہن ) اسماء رضی اللہ عنہا سے ایک ہار عاریتاً لے لیا تھا، اتفاق سے وہ راستے میں کہیں گم ہو گیا، نبی کریم صلی اللہ علیہ وسلم نے اسے تلاش کرنے کے لیے چند صحابہ کو بھیجا، اس دوران میں نماز کا وقت ہو گیا تو ان حضرات نے بغیر وضو کے نماز پڑھ لی، پھر جب آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ سے صورت حال کے متعلق عرض کیا۔ اس کے بعد تیمم کی آیت نازل ہوئی۔ اس پر اسید بن حضیر رضی اللہ عنہ نے کہا: تمہیں اللہ تعالیٰ جزائے خیر دے، اللہ کی قسم! تم پر جب بھی کوئی مرحلہ آیا تو اللہ تعالیٰ نے اس سے نکلنے کی سبیل تمہارے لیے پیدا کر دی، اور تمام مسلمانوں کے لیے بھی اس میں برکت پیدا فرمائی۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3774,
			"arabicnumber": 3774,
			"text": "مجھ سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے ہشام نے، ان سے ان کے والد نے کہ رسول اللہ صلی اللہ علیہ وسلم اپنے مرض الوفات میں بھی ازواج مطہرات کی باری کی پابندی فرماتے رہے البتہ یہ دریافت فرماتے رہے کہ کل مجھے کس کے یہاں ٹھہرنا ہے؟ کیونکہ آپ عائشہ رضی اللہ عنہا کی باری کے خواہاں تھے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ جب میرے یہاں قیام کا دن آیا تو آپ کو سکون ہوا۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3775,
			"arabicnumber": 3775,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، کہا ہم سے حماد نے کہا، ہم سے ہشام نے، انہوں نے اپنے والد (عروہ) سے، انہوں نے کہا کہ لوگ آپ صلی اللہ علیہ وسلم کو تحفے بھیجنے میں عائشہ رضی اللہ عنہا کی باری کا انتظار کیا کرتے تھے۔ عائشہ رضی اللہ عنہا کہتی ہیں کہ میری سوکنیں سب ام سلمہ رضی اللہ عنہا کے پاس گئیں اور ان سے کہا: اللہ کی قسم لوگ جان بوجھ کر اپنے تحفے اس دن بھیجتے ہیں جس دن عائشہ رضی اللہ عنہا کی باری ہوتی ہے، ہم بھی عائشہ رضی اللہ عنہا کی طرح اپنے لیے فائدہ چاہتی ہیں، اس لیے تم نبی کریم صلی اللہ علیہ وسلم سے کہو کہ آپ لوگوں کو فرما دیں کہ میں جس بھی بیوی کے پاس رہوں جس کی بھی باری ہو اسی گھر میں تحفے بھیج دیا کرو۔ ام سلمہ رضی اللہ عنہا نے یہ بات آپ صلی اللہ علیہ وسلم کے سامنے بیان کی، آپ نے کچھ بھی جواب نہیں دیا۔ انہوں نے دوبارہ عرض کیا جب بھی جواب نہ دیا، پھر تیسری بار عرض کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: اے ام سلمہ! عائشہ کے بارے میں مجھ کو نہ ستاؤ۔ اللہ کی قسم! تم میں سے کسی بیوی کے لحاف میں ( جو میں اوڑھتا ہوں سوتے وقت ) مجھ پر وحی نازل نہیں ہوتی ہاں ( عائشہ کا مقام یہ ہے ) ان کے لحاف میں وحی نازل ہوتی ہے۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 120
			}
		}
	]
}