{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5063,
			"arabicnumber": 5063,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم کو محمد بن جعفر نے خبر دی، کہا ہم کو حمید بن ابی حمید طویل نے خبر دی، انہوں نے انس بن مالک سے سنا، انہوں نے بیان کیا کہ تین حضرات ( علی بن ابی طالب، عبداللہ بن عمرو بن العاص اور عثمان بن مظعون رضی اللہ عنہم ) نبی کریم صلی اللہ علیہ وسلم کی ازواج مطہرات کے گھروں کی طرف آپ کی عبادت کے متعلق پوچھنے آئے، جب انہیں نبی کریم صلی اللہ علیہ وسلم کا عمل بتایا گیا تو جیسے انہوں نے اسے کم سمجھا اور کہا کہ ہمارا نبی کریم صلی اللہ علیہ وسلم سے کیا مقابلہ! آپ کی تو تمام اگلی پچھلی لغزشیں معاف کر دی گئی ہیں۔ ان میں سے ایک نے کہا کہ آج سے میں ہمیشہ رات بھر نماز پڑھا کروں گا۔ دوسرے نے کہا کہ میں ہمیشہ روزے سے رہوں گا اور کبھی ناغہ نہیں ہونے دوں گا۔ تیسرے نے کہا کہ میں عورتوں سے جدائی اختیار کر لوں گا اور کبھی نکاح نہیں کروں گا۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور ان سے پوچھا کیا تم نے ہی یہ باتیں کہی ہیں؟ سن لو! اللہ تعالیٰ کی قسم! اللہ رب العالمین سے میں تم سب سے زیادہ ڈرنے والا ہوں۔ میں تم میں سب سے زیادہ پرہیزگار ہوں لیکن میں اگر روزے رکھتا ہوں تو افطار بھی کرتا ہوں۔ نماز پڑھتا ہوں ( رات میں ) اور سوتا بھی ہوں اور میں عورتوں سے نکاح کرتا ہوں۔ «فمن رغب عن سنتي فليس مني» میرے طریقے سے جس نے بے رغبتی کی وہ مجھ میں سے نہیں ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5064,
			"arabicnumber": 5064,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں نے حسان بن ابراہیم سے سنا، انہوں نے یونس بن یزید ایلی سے، ان سے زہری نے، کہا مجھ کو عروہ بن زبیر نے خبر دی اور انہوں نے عائشہ رضی اللہ عنہا سے اللہ تعالیٰ کے اس ارشاد «وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء مثنى وثلاث ورباع فإن خفتم أن لا تعدلوا فواحدة أو ما ملكت أيمانكم ذلك أدنى أن لا تعولوا‏» کے متعلق پوچھا ”اور اگر تمہیں اندیشہ ہو کہ تم یتیموں سے انصاف نہ کر سکو گے تو جو عورتیں تمہیں پسند ہوں ان سے نکاح کر لو۔ دو دو سے، خواہ تین تین سے، خواہ چار چار سے، لیکن اگر تمہیں اندیشہ ہو کہ تم انصاف نہیں کر سکو گے تو پھر ایک ہی پر بس کرو یا جو لونڈی تمہاری ملک میں ہو، اس صورت میں قوی امید ہے کہ تم ظلم و زیادتی نہ کر سکو گے۔“ عائشہ رضی اللہ عنہا نے کہا: بھانجے! آیت میں ایسی یتیم مالدار لڑکی کا ذکر ہے جو اپنے ولی کی پرورش میں ہو۔ وہ لڑکی کے مال اور اس کے حسن کی وجہ سے اس کی طرف مائل ہو اور اس سے معمولی مہر پر شادی کرنا چاہتا ہو تو ایسے شخص کو اس آیت میں ایسی لڑکی سے نکاح کرنے سے منع کیا گیا ہے۔ ہاں اگر اس کے ساتھ انصاف کر سکتا ہو اور پورا مہر ادا کرنے کا ارادہ رکھتا ہو تو اجازت ہے، ورنہ ایسے لوگوں سے کہا گیا ہے کہ اپنی پرورش میں یتیم لڑکیوں کے سوا اور دوسری لڑکیوں سے شادی کر لیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5065,
			"arabicnumber": 5065,
			"text": "ہم سے عمر بن حفص نے بیان کیا، مجھ سے ابراہیم نے بیان کیا، ان سے اعمش نے بیان کیا، کہا کہ مجھ سے ابراہیم نے بیان کیا، ان سے علقمہ بن قیس نے بیان کیا کہ میں عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ تھا، ان سے عثمان رضی اللہ عنہ نے منیٰ میں ملاقات کی اور کہا: اے ابوعبدالرحمٰن! مجھے آپ سے ایک کام ہے پھر وہ دونوں تنہائی میں چلے گئے۔ عثمان رضی اللہ عنہ نے ان سے کہا اے ابوعبدالرحمٰن! کیا آپ منظور کریں گے کہ ہم آپ کا نکاح کسی کنواری لڑکی سے کر دیں جو آپ کو گزرے ہوئے ایام یاد دلا دے۔ چونکہ عبداللہ رضی اللہ عنہ اس کی ضرورت محسوس نہیں کرتے تھے اس لیے انہوں نے مجھے اشارہ کیا اور کہا: علقمہ! میں جب ان کی خدمت میں پہنچا تو وہ کہہ رہے تھے کہ اگر آپ کا یہ مشورہ ہے تو رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا تھا اے نوجوانو! تم میں جو بھی شادی کی طاقت رکھتا ہو اسے نکاح کر لینا چاہئے کیونکہ یہ خواہش نفسانی کو توڑ دے گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5066,
			"arabicnumber": 5066,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا مجھ سے میرے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا کہ مجھ سے عمارہ نے بیان کیا، ان سے عبدالرحمٰن بن یزید نے بیان کیا، کہا کہ میں علقمہ اور اسود ( رحمہم اللہ ) کے ساتھ عبداللہ بن مسعود رضی اللہ عنہ کی خدمت میں حاضر ہوا، انہوں نے ہم سے کہا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں نوجوان تھے اور ہمیں کوئی چیز میسر نہیں تھی۔ نبی کریم صلی اللہ علیہ وسلم نے ہم سے فرمایا کہ نوجوانوں کی جماعت! تم میں جسے بھی نکاح کرنے کے لیے مالی طاقت ہو اسے نکاح کر لینا چاہئے کیونکہ یہ نظر کو نیچی رکھنے والا اور شرمگاہ کی حفاظت کرنے والا عمل ہے اور جو کوئی نکاح کی بوجہ غربت طاقت نہ رکھتا ہو اسے چاہیے کہ روزہ رکھے کیونکہ روزہ اس کی خواہشات نفسانی کو توڑ دے گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5067,
			"arabicnumber": 5067,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا کہ ہم کو ہشام بن یوسف نے خبر دی، انہیں ابن جریج نے خبر دی، کہا کہ مجھے عطا بن ابی رباح نے خبر دی کہا کہ ہم ابن عباس رضی اللہ عنہما کے ساتھ ام المؤمنین میمونہ رضی اللہ عنہا کے جنازہ میں شریک تھے۔ ابن عباس رضی اللہ عنہما نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ہیں جب تم ان کا جنازہ اٹھاؤ تو زور زور سے حرکت نہ دینا بلکہ آہستہ آہستہ نرمی کے ساتھ جنازہ کو لے کر چلنا۔ نبی کریم صلی اللہ علیہ وسلم کے پاس آپ کی وفات کے وقت آپ کے نکاح میں نو بیویاں تھیں آٹھ کے لیے تو آپ نے باری مقرر کر رکھی تھی لیکن ایک کی باری نہیں تھی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5068,
			"arabicnumber": 5068,
			"text": "ہم سے مسدد نے بیان کیا۔ کہا ہم سے یزید بن زریع نے بیان کیا، کہا ہم سے سعید نے بیان کیا، ان سے قتادہ نے، ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ ایک ہی رات میں اپنی تمام بیویوں کے پاس گئے نبی کریم صلی اللہ علیہ وسلم کے پاس نو بیویاں تھیں۔ امام بخاری رحمہ اللہ نے کہا کہ مجھ سے خلیفہ ابن خیاط نے بیان کیا، کہا ہم سے سعید نے بیان کیا، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے پھر یہی حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5069,
			"arabicnumber": 5069,
			"text": "ہم سے علی بن حکم انصاری نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے رقبہ نے، ان سے طلحہ الیامی نے، ان سے سعید بن جبیر نے بیان کیا کہ مجھ سے ابن عباس رضی اللہ عنہما نے دریافت فرمایا کہ تم نے شادی کر لی ہے؟ میں نے عرض کیا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ شادی کر لو کیونکہ اس امت کے بہترین شخص جو تھے ( یعنی نبی کریم صلی اللہ علیہ وسلم ) ان کی بہت سی بیویاں تھیں۔ بعضوں نے یوں ترجمہ کیا ہے کہ اس امت میں اچھے وہی لوگ ہیں جن کی بہت عورتیں ہوں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5070,
			"arabicnumber": 5070,
			"text": "ہم سے یحییٰ بن قزعہ نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، ان سے یحییٰ بن سعید نے، ان سے محمد بن ابراہیم بن حارث نے، ان سے علقمہ بن وقاص نے اور ان سے عمر بن خطاب رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عمل کا دارومدار نیت پر ہے اور ہر شخص کو وہی ملتا ہے جس کی وہ نیت کرے۔ اس لیے جس کی ہجرت اللہ اور اس کے رسول کی رضا حاصل کرنے کے لیے ہو، اسے اللہ اور اس کے رسول کی رضا حاصل ہو گی لیکن جس کی ہجرت دنیا حاصل کرنے کی نیت سے یا کسی عورت سے شادی کرنے کے ارادہ سے ہو، اس کی ہجرت اسی کے لیے ہے جس کے لیے اس نے ہجرت کی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5071,
			"arabicnumber": 5071,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، ان سے قیس نے بیان کیا اور ان سے ابن مسعود رضی اللہ عنہ نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جہاد کیا کرتے تھے اور ہمارے ساتھ بیویاں نہیں تھیں۔ اس لیے ہم نے کہا کہ یا رسول اللہ! ہم اپنے آپ کو خصی کیوں نہ کر لیں؟ آپ صلی اللہ علیہ وسلم نے ہمیں اس سے منع فرمایا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5072,
			"arabicnumber": 5072,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے، ان سے حمید طویل نے بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا، بیان کیا کہ عبدالرحمٰن بن عوف رضی اللہ عنہ ( ہجرت کر کے مدینہ ) آئے تو نبی کریم صلی اللہ علیہ وسلم نے ان کے اور سعد بن ربیع انصاری رضی اللہ عنہ کے درمیان بھائی چارہ کرایا۔ سعد انصاری رضی اللہ عنہ کے نکاح میں دو بیویاں تھیں۔ انہوں نے عبدالرحمٰن رضی اللہ عنہ سے کہا کہ وہ ان کے اہل ( بیوی ) اور مال میں سے آدھے لیں۔ اس پر عبدالرحمٰن نے کہا کہ اللہ تعالیٰ آپ کے اہل اور آپ کے مال میں برکت دے، مجھے تو بازار کا راستہ بتا دو۔ چنانچہ آپ بازار آئے اور یہاں آپ نے کچھ پنیر اور کچھ گھی کی تجارت کی اور نفع کمایا۔ چند دنوں کے بعد ان پر زعفران کی زردی لگی ہوئی تھی۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ عبدالرحمٰن یہ کیا ہے؟ انہوں نے عرض کیا کہ میں نے ایک انصاری خاتون سے شادی کر لی ہے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ انہیں مہر میں کیا دیا عرض کیا کہ ایک گٹھلی برابر سونا دیا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر ولیمہ کر اگرچہ ایک بکری ہی کا ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5073,
			"arabicnumber": 5073,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، کہا ہم کو ابن شہاب نے خبر دی، انہوں نے سعید بن مسیب سے سنا، وہ کہتے ہیں کہ میں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے «تبتل» یعنی عورتوں سے الگ رہنے کی زندگی سے منع فرمایا تھا۔ اگر نبی کریم صلی اللہ علیہ وسلم انہیں اجازت دے دیتے تو ہم تو خصی ہی ہو جاتے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5074,
			"arabicnumber": 5074,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، کہا مجھے سعید بن مسیب نے خبر دی اور انہوں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے عثمان بن مظعون رضی اللہ عنہ کو عورت سے الگ رہنے کی اجازت نہیں دی تھی۔ اگر نبی کریم صلی اللہ علیہ وسلم انہیں اس کی اجازت دے دیتے تو ہم بھی اپنے آپ کو خصی بنا لیتے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5075,
			"arabicnumber": 5075,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے، ان سے اسمٰعیل بن ابی خالد بجلی نے، ان سے قیس بن ابی حازم نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جہاد کو جایا کرتے تھے اور ہمارے پاس روپیہ نہ تھا ( کہ ہم شادی کر لیتے ) اس لیے ہم نے عرض کیا ہم اپنے کو خصی کیوں نہ کرا لیں لیکن نبی کریم صلی اللہ علیہ وسلم نے ہمیں اس سے منع فرمایا۔ پھر ہمیں اس کی اجازت دے دی کہ ہم کسی عورت سے ایک کپڑے پر ( ایک مدت تک کے لیے ) نکاح کر لیں۔ آپ نے ہمیں قرآن مجید کی یہ آیت پڑھ کر سنائی «يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا إن الله لا يحب المعتدين‏» کہ ”ایمان لانے والو! وہ پاکیزہ چیزیں مت حرام کرو جو تمہارے لیے اللہ تعالیٰ نے حلال کی ہیں اور حد سے آگے نہ بڑھو، بیشک اللہ حد سے آگے بڑھنے والوں کو پسند نہیں کرتا۔“",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5076,
			"arabicnumber": 5076,
			"text": "اور اصبغ نے کہا کہ مجھے ابن وہب نے خبر دی، انہیں یونس بن یزید نے، انہیں ابن شہاب نے، انہیں ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ یا رسول اللہ! میں نوجوان ہوں اور مجھے اپنے پر زنا کا خوف رہتا ہے۔ میرے پاس کوئی ایسی چیز نہیں جس پر میں کسی عورت سے شادی کر لوں۔ آپ میری یہ بات سن کر خاموش رہے۔ دوبارہ میں نے اپنی یہی بات دہرائی لیکن آپ اس مرتبہ بھی خاموش رہے۔ سہ بارہ میں نے عرض کیا آپ پھر بھی خاموش رہے۔ میں نے چوتھی مرتبہ عرض کیا آپ صلی اللہ علیہ وسلم نے فرمایا اے ابوہریرہ! جو کچھ تم کرو گے اسے ( لوح محفوظ میں ) لکھ کر قلم خشک ہو چکا ہے۔ خواہ اب تم خصی ہو جاؤ یا باز رہو۔ یعنی خصی ہونا بیکار محض ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5077,
			"arabicnumber": 5077,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا، ان سے سلیمان بن بلال نے، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا: یا رسول اللہ! فرمائیے اگر آپ کسی وادی میں اتریں اور اس میں ایک درخت ایسا ہو جس میں اونٹ چر گئے ہوں اور ایک درخت ایسا ہو جس میں سے کچھ بھی نہ کھایا گیا ہو تو آپ اپنا اونٹ ان درختوں میں سے کس درخت میں چرائیں گے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس درخت میں جس میں سے ابھی چرایا نہیں گیا ہو۔ ان کا اشارہ اس طرف تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کے سوا کسی کنواری لڑکی سے نکاح نہیں کیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5078,
			"arabicnumber": 5078,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے اسامہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے عائشہ! مجھے خواب میں دو مرتبہ تم دکھائی گئیں۔ ایک شخص ( جبرائیل ) تمہاری صورت حریر کے ایک ٹکڑے میں اٹھائے ہوئے ہے اور کہتا ہے کہ یہ آپ کی بیوی ہے میں نے جو اس کپڑے کو کھولا تو اس میں تم تھیں۔ میں نے خیال کیا کہ اگر یہ خواب اللہ کی طرف سے ہے تو وہ اسے ضرور پورا کر کے رہے گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5079,
			"arabicnumber": 5079,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا ہم سے سیار بن ابی سیار نے بیان کیا، ان سے عامر شعبی نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک جہاد سے واپس ہو رہے تھے۔ میں اپنے اونٹ کو، جو سست تھا تیز چلانے کی کوشش کر رہا تھا۔ اتنے میں میرے پیچھے سے ایک سوار مجھ سے آ کر ملا اور اپنا نیزہ میرے اونٹ کو چبھو دیا۔ اس کی وجہ سے میرا اونٹ تیز چل پڑا جیسا کہ کسی عمدہ قسم کے اونٹ کی چال تم نے دیکھی ہو گی۔ اچانک نبی کریم صلی اللہ علیہ وسلم مل گئے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا جلدی کیوں کر رہے ہو؟ میں نے عرض کیا ابھی میری شادی نئی ہوئی ہے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کنواری سے یا بیوہ سے؟ میں نے عرض کیا کہ بیوہ سے۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ کسی کنواری سے کیوں نہ کی تم اس کے ساتھ کھیل کود کرتے اور وہ تمہارے ساتھ کرتی۔ بیان کیا کہ پھر جب ہم مدینہ میں داخل ہونے والے تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تھوڑی دیر ٹھہر جاؤ اور رات ہو جائے تب داخل ہو تاکہ پریشان بالوں والی کنگھا کر لیوے اور جن کے شوہر موجود نہیں تھے وہ اپنے بال صاف کر لیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5080,
			"arabicnumber": 5080,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے محارب بن دثار نے بیان کیا، کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے عرض کیا کہ میں نے شادی کی تو نبی کریم صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا کہ کس سے شادی کی ہے؟ میں نے عرض کیا کہ ایک عورت سے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کنواری سے کیوں نہ کی کہ اس کے ساتھ تم کھیل کود کرتے۔ محارب نے کہا کہ پھر میں نے نبی کریم صلی اللہ علیہ وسلم کا یہ ارشاد عمرو بن دینار سے بیان کیا تو انہوں نے کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ہے۔ مجھ سے انہوں نے نبی کریم صلی اللہ علیہ وسلم کا فرمان اس طرح بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ تم نے کسی کنواری عورت سے شادی کیوں نہ کی کہ تم اس کے ساتھ کھیل کود کرتے اور وہ تمہارے ساتھ کھیلتی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5081,
			"arabicnumber": 5081,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم سے لیث بن سعد نے، ان سے یزید بن حبیب نے، ان سے عراک بن مالک نے اور ان سے عروہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا سے شادی کے لیے ابوبکر صدیق رضی اللہ عنہ سے کہا۔ ابوبکر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے عرض کی کہ میں آپ کا بھائی ہوں۔ ( تو عائشہ سے کیسے نکاح کریں گے ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے دین اور اس کی کتاب پر ایمان لانے کے رشتہ سے تم میرے بھائی ہو اور عائشہ میرے لیے حلال ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5082,
			"arabicnumber": 5082,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعبہ نے خبر دی، ان سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اونٹ پر سوار ہونے والی ( عرب ) عورتوں میں بہترین عورت قریش کی صالح عورت ہوتی ہے جو اپنے بچے سے بہت زیادہ محبت کرنے والی اور اپنے شوہر کے مال اسباب میں اس کی بہت عمدہ نگہبان و نگراں ثابت ہوتی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5083,
			"arabicnumber": 5083,
			"text": "ہم سے موسیٰ بن اسمٰعیل نے بیان کیا، کہا ہم سے عبدالوحد بن زیاد نے، کہا ہم سے صالح بن صالح ہمدانی نے، کہا ہم سے عامر شعبی نے، کہا کہ مجھ سے ابوبردہ نے بیان کیا اپنے والد سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس شخص کے پاس لونڈی ہو وہ اسے تعلیم دے اور خوب اچھی طرح دے، اسے ادب سکھائے اور پوری کوشش اور محنت کے ساتھ سکھائے اور اس کے بعد اسے آزاد کر کے اس سے شادی کر لے تو اسے دہرا ثواب ملتا ہے اور اہل کتاب میں سے جو شخص بھی اپنے نبی پر ایمان رکھتا ہو اور مجھ پر ایمان لائے تو اسے دوہرا ثواب ملتا ہے اور جو غلام اپنے آقا کے حقوق بھی ادا کرتا ہے اور اپنے رب کے حقوق بھی ادا کرتا ہے اسے دہرا ثواب ملتا ہے۔ عامر شعبی نے ( اپنے شاگرد سے اس حدیث کو سنانے کے بعد کہا کہ بغیر کسی مشقت اور محنت کے اسے سیکھ لو۔ اس سے پہلے طالب علموں کو اس حدیث سے کم کے لیے بھی مدینہ تک کا سفر کرنا پڑتا تھا۔ اور ابوبکر نے بیان کیا ابوحصین سے، اس نے ابوبردہ سے، اس نے اپنے والد سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ اس شخص نے باندی کو ( نکاح کرنے کے لیے ) آزاد کر دیا اور یہی آزادی اس کا مہر مقرر کی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5084,
			"arabicnumber": 5084,
			"text": "ہم سے سعید بن تلید نے بیان کیا، کہا کہ مجھے عبداللہ بن وہب نے خبر دی، کہا کہ مجھے جریر بن حازم نے خبر دی، انہیں ایوب سختیانی نے، انہیں محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا۔ ( دوسری سند ) ہم سے سلیمان بن حرب نے بیان کیا، ان سے حماد بن زید نے، ان سے ایوب سختیانی نے، ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ ابراہیم علیہ السلام کی زبان سے تین مرتبہ کے سوا کبھی دین میں جھوٹ بات نہیں نکلی۔ ایک مرتبہ آپ ایک ظالم بادشاہ کی حکومت سے گزرے آپ کے ساتھ آپ کی بیوی سارہ علیہ السلام تھیں۔ پھر پورا واقعہ بیان کیا ( کہ بادشاہ کے سامنے ) آپ نے سارہ علیہ السلام کو اپنی بہن ( یعنی دینی بہن ) کہا۔ پھر اس بادشاہ نے سارہ علیہا السلام کو آجر ( ہاجرہ ) کو دے دیا۔ ( بی بی سارہ علیہا السلام نے ابراہیم علیہ السلام سے ) کہا کہ اللہ تعالیٰ نے کافر کے ہاتھ کو روک دیا اور آجر ( ہاجرہ ) کو میری خدمت کے لیے دلوا دیا۔ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ اے آسمان کے پانی کے بیٹو! یعنی اے عرب والو! یہی ہاجرہ علیہا السلام تمہاری ماں ہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5085,
			"arabicnumber": 5085,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے اسمٰعیل بن جعفر نے بیان کیا، ان سے حمیدی نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے خیبر اور مدینہ کے درمیان تین دن تک قیام کیا اور یہیں ام المؤمنین صفیہ بنت حیی رضی اللہ عنہا کے ساتھ خلوت کی۔ پھر میں نے نبی کریم صلی اللہ علیہ وسلم کے ولیمہ کی مسلمانوں کو دعوت دی۔ اس دعوت ولیمہ میں نہ تو روٹی تھی اور نہ گوشت تھا۔ دستر خوان بچھانے کا حکم ہوا اور اس پر کھجور، پنیر اور گھی رکھ دیا گیا اور یہی نبی کریم صلی اللہ علیہ وسلم کا ولیمہ تھا۔ بعض مسلمانوں نے پوچھا کہ صفیہ امہات المؤمنین میں سے ہیں ( یعنی نبی کریم صلی اللہ علیہ وسلم نے ان سے نکاح کیا ہے ) یا لونڈی کی حیثیت سے آپ نے ان کے ساتھ خلوت کی ہے؟ اس پر کچھ لوگوں نے کہا کہ اگر نبی کریم صلی اللہ علیہ وسلم ان کے لیے پردہ کا انتظام فرمائیں تو اس سے ثابت ہو گا کہ وہ امہات المؤمنین میں سے ہیں اور اگر ان کے لیے پردہ کا اہتمام نہ کریں تو اس سے ثابت ہو گا کہ وہ لونڈی کی حیثیت سے آپ کے ساتھ ہیں۔ پھر جب کوچ کرنے کا وقت ہوا تو نبی کریم صلی اللہ علیہ وسلم نے ان کے لیے اپنی سواری پر بیٹھنے کے لیے جگہ بنائی اور ان کے لیے پردہ ڈالا تاکہ لوگوں کو وہ نظر نہ آئیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5086,
			"arabicnumber": 5086,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ثابت بنانی اور شعیب بن حبحاب نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے صفیہ رضی اللہ عنہا کو آزاد کیا اور ان کی آزادی کو ان کا مہر قرار دیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5087,
			"arabicnumber": 5087,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا، ان سے ان کے والد نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئی اور عرض کیا کہ یا رسول اللہ! میں آپ کی خدمت میں اپنے آپ کو آپ کے لیے وقف کرنے حاضر ہوئی ہوں۔ راوی نے بیان کیا کہ پھر آپ صلی اللہ علیہ وسلم نے نظر اٹھا کر اسے دیکھا۔ پھر آپ نے نظر کو نیچی کر لیا اور پھر اپنا سر جھکا لیا۔ جب اس عورت نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم نے ان کے متعلق کوئی فیصلہ نہیں فرمایا تو وہ بیٹھ گئی۔ اس کے بعد آپ صلی اللہ علیہ وسلم کے ایک صحابی کھڑے ہوئے اور عرض کیا: یا رسول اللہ! اگر آپ کو ان سے نکاح کی ضرورت نہیں ہے تو ان سے میرا نکاح کر دیجئیے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس ( مہر کے لیے ) کوئی چیز ہے؟ انہوں نے عرض کیا کہ نہیں، اللہ کی قسم، یا رسول اللہ! نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اپنے گھر جاؤ اور دیکھو ممکن ہے تمہیں کوئی چیز مل جائے۔ وہ گئے اور واپس آ گئے اور عرض کیا: اللہ کی قسم! میں نے کچھ نہیں پایا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر لوہے کی ایک انگوٹھی بھی مل جائے تو لے آؤ۔ وہ گئے اور واپس آ گئے اور عرض کیا: اللہ کی قسم، یا رسول اللہ! میرے پاس لوہے کی ایک انگوٹھی بھی نہیں البتہ میرے پاس ایک تہمد ہے۔ انہیں ( خاتون کو ) اس میں سے آدھا دے دیجئیے۔ سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ ان کے پاس چادر بھی نہیں تھی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ تمہارے اس تہمد کا کیا کرے گی۔ اگر تم اسے پہنو گے تو ان کے لیے اس میں سے کچھ نہیں بچے گا اور اگر وہ پہن لے تو تمہارے لیے کچھ نہیں رہے گا۔ اس کے بعد وہ صحابی بیٹھ گئے۔ کافی دیر تک بیٹھے رہنے کے بعد جب وہ کھڑے ہوئے تو نبی کریم صلی اللہ علیہ وسلم نے انہیں دیکھا کہ وہ واپس جا رہے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں بلوایا جب وہ آئے تو آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہیں قرآن مجید کتنا یاد ہے؟ انہوں نے عرض کیا کہ فلاں فلاں سورتیں یاد ہیں۔ انہوں نے گن کر بتائیں۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا کیا تم انہیں بغیر دیکھے پڑھ سکتے ہو؟ انہوں نے عرض کیا کہ جی ہاں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر جاؤ۔ میں نے انہیں تمہارے نکاح میں دیا۔ ان سورتوں کے بدلے جو تمہیں یاد ہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5088,
			"arabicnumber": 5088,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے، انہیں عروہ بن زبیر نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ ابوحذیفہ بن عتبہ بن ربیعہ بن عبدشمس ( مہشم ) نے جو ان صحابہ میں سے تھے جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ غزوہ بدر میں شرکت کی تھی۔ سالم بن معقل رضی اللہ عنہ کو لے پالک بیٹا بنایا، اور پھر ان کا نکاح اپنے بھائی کی لڑکی ہندہ بنت الولید بن عتبہ بن ربیعہ سے کر دیا۔ پہلے سالم رضی اللہ عنہ ایک انصاری خاتون ( شبیعہ بنت یعار ) کے آزاد کردہ غلام تھے لیکن حذیفہ نے ان کو اپنا منہ بولا بیٹا بنایا تھا جیسا کہ نبی کریم صلی اللہ علیہ وسلم نے زید کو ( جو آپ ہی کے آزاد کردہ غلام تھے ) اپنا لے پالک بیٹا بنایا تھا جاہلیت کے زمانے میں یہ دستور تھا کہ اگر کوئی شخص کسی کو لے پالک بیٹا بنا لیتا تو لوگ اسے اسی کی طرف نسبت کر کے پکارا کرتے تھے اور لے پالک بیٹا اس کی میراث میں سے بھی حصہ پاتا آخر جب سورۃ الحجرات میں یہ آیت اتری «ادعوهم لآبائهم‏» کہ ”انہیں ان کے حقیقی باپوں کی طرف منسوب کر کے پکارو“ اللہ تعالیٰ کے فرمان «ومواليكم‏» تک تو لوگ انہیں ان کے باپوں کی طرف منسوب کر کے پکارنے لگے جس کے باپ کا علم نہ ہوتا تو اسے «مولى» اور دینی بھائی کہا جاتا۔ پھر سہلہ بنت سہیل بن عمرو القرشی ثم العامدی رضی اللہ عنہا جو ابوحذیفہ رضی اللہ عنہ کی بیوی ہیں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا: یا رسول اللہ! ہم تو سالم کو اپنا حقیقی جیسا بیٹا سمجھتے تھے اب اللہ نے جو حکم اتارا وہ آپ کو معلوم ہے پھر آخر تک حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5089,
			"arabicnumber": 5089,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم ضباعہ بنت زبیر رضی اللہ عنہما کے پاس گئے ( یہ زبیر عبدالمطلب کے بیٹے اور نبی کریم صلی اللہ علیہ وسلم کے چچا تھے ) اور ان سے فرمایا شاید تمہارا ارادہ حج کا ہے؟ انہوں نے عرض کیا: اللہ کی قسم! میں تو اپنے آپ کو بیمار پاتی ہوں نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ پھر بھی حج کا احرام باندھ لے۔ البتہ شرط لگا لینا اور یہ کہہ لینا کہ اے اللہ! میں اس وقت حلال ہو جاؤں گی جب تو مجھے ( مرض کی وجہ سے ) روک لے گا۔ اور ( ضباعہ بنت زبیر قریشی رضی اللہ عنہا ) مقداد بن اسود رضی اللہ عنہ کے نکاح میں تھیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5090,
			"arabicnumber": 5090,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے، ان سے عبیداللہ عموی نے، کہ مجھ سے سعید بن ابی سعید نے، ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عورت سے نکاح چار چیزوں کی بنیاد پر کیا جاتا ہے اس کے مال کی وجہ سے اور اس کے خاندانی شرف کی وجہ سے اور اس کی خوبصورتی کی وجہ سے اور اس کے دین کی وجہ سے اور تو دیندار عورت سے نکاح کر کے کامیابی حاصل کر، اگر ایسا نہ کرے تو تیرے ہاتھوں کو مٹی لگے گی ( یعنی اخیر میں تجھ کو ندامت ہو گی ) ۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5091,
			"arabicnumber": 5091,
			"text": "ہم سے ابراہیم بن حمزہ نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی حازم نے، ان سے ان کے والد سلمہ بن دینار نے، ان سے سہل بن سعد ساعدی نے بیان کیا کہ ایک صاحب ( جو مالدار تھے ) رسول اللہ صلی اللہ علیہ وسلم کے سامنے سے گزرے۔ نبی کریم صلی اللہ علیہ وسلم نے اپنے پاس موجود صحابہ سے پوچھا کہ یہ کیسا شخص ہے؟ صحابہ نے عرض کیا کہ یہ اس لائق ہے کہ اگر یہ نکاح کا پیغام بھیجے تو اس سے نکاح کیا جائے، اگر کسی کی سفارش کرے تو اس کی سفارش قبول کی جائے، اگر کوئی بات کہے تو غور سے سنی جائے۔ سہل نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم اس پر چپ ہو رہے۔ پھر ایک دوسرے صاحب گزرے، جو مسلمانوں کے غریب اور محتاج لوگوں میں شمار کئے جاتے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اس کے متعلق تمہارا کیا خیال ہے؟ صحابہ نے عرض کیا کہ یہ اس قابل ہے کہ اگر کسی کے یہاں نکاح کا پیغام بھیجے تو اس سے نکاح نہ کیا جائے اگر کسی کی سفارش کرے تو اس کی سفارش قبول نہ کی جائے، اگر کوئی بات کہے تو اس کی بات نہ سنی جائے۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ یہ شخص اکیلا پہلے شخص کی طرح دنیا بھر سے بہتر ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5092,
			"arabicnumber": 5092,
			"text": "مجھ سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے، ان سے عقیل نے، ان سے ابن شہاب نے، انہیں عروہ بن زبیر نے خبر دی کہ انہوں نے عائشہ رضی اللہ عنہا سے آیت «وإن خفتم أن لا تقسطوا في اليتامى‏» ”اور اگر تمہیں خوف ہو کہ یتیم لڑکیوں کے بارے میں تم انصاف نہیں کر سکو گے۔“ کے متعلق سوال کیا۔ عائشہ رضی اللہ عنہا نے کہا میرے بھانجے! اس آیت میں اس یتیم لڑکی کا حکم بیان ہوا ہے جو اپنے ولی کی پرورش میں ہو اور اس کا ولی اس کی خوبصورتی اور مالداری پر ریجھ کر یہ چاہے کہ اس سے نکاح کرے لیکن اس کے مہر میں کمی کرنے کا بھی ارادہ ہو۔ ایسے ولی کو اپنی زیر پرورش یتیم لڑکی سے نکاح کرنے سے منع کیا گیا ہے جب وہ ان کا مہر انصاف سے پورا ادا کریں گے اگر وہ ایسا نہ کریں تو پھر آیت میں ایسے ولیوں کو حکم دیا گیا کہ وہ اپنی زیر پرورش یتیم لڑکی کے سوا کسی اور سے نکاح کر لیں۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بعد سوال کیا تو اللہ تعالیٰ نے سورۃ نساء میں آیت «ويستفتونك في النساء‏» سے «وترغبون أن تنكحوهن‏» تک نازل کی۔ اس آیت میں اللہ تعالیٰ نے یہ حکم دیا کہ یتیم لڑکیاں اگر خوبصورت اور صاحب مال ہوں تو ان کے ولی بھی ان کے ساتھ نکاح کر لینا چاہتے ہیں، اس کا خاندان پسند کرتے ہیں اور مہر پورا ادا کر کے ان سے نکاح کر لیتے ہیں۔ لیکن ان میں حسن کی کمی ہو اور مال بھی نہ ہو تو پھر ان کی طرف رغبت نہیں ہو گی اور وہ انہیں چھوڑ کر دوسری عورتوں سے نکاح کر لیتے ہیں۔ عائشہ رضی اللہ عنہا نے کہا کہ آیت کا مطلب یہ ہے کہ جیسے اس وقت یتیم لڑکی کو چھوڑ دیتے ہیں جب وہ نادار ہو اور خوبصورت نہ ہو ایسے ہی اس وقت بھی چھوڑ دینا چاہئے جب وہ مالدار اور خوبصورت ہو البتہ اگر اس کے حق میں انصاف کریں اور اس کا مہر پورا ادا کریں تب اس سے نکاح کر سکتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5093,
			"arabicnumber": 5093,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے ابن شہاب نے، ان سے عبداللہ بن عمر رضی اللہ عنہما کے صاحبزادے حمزہ اور سالم نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ نحوست عورت میں، گھر میں اور گھوڑے میں ہو سکتی ہے ( نحوست بےبرکتی اگر ہو تو ان میں ہو سکتی ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5094,
			"arabicnumber": 5094,
			"text": "ہم سے محمد بن منہال نے بیان کیا، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا، ان سے عمر بن محمد عسقلانی نے بیان کیا، ان سے ان کے والد اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے نحوست کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر نحوست کسی چیز میں ہو تو گھر، عورت اور گھوڑے میں ہو سکتی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5095,
			"arabicnumber": 5095,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہیں امام مالک نے خبر دی، انہیں ابوحازم نے اور انہیں سہل بن سعد ساعدی رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر ( نحوست ) کسی چیز میں ہو تو گھوڑے، عورت اور گھر میں ہو سکتی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5096,
			"arabicnumber": 5096,
			"text": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے سلیمان تیمی نے بیان کیا، انہوں نے ابوعثمان نہدی سے سنا اور انہوں نے اسامہ بن زید رضی اللہ عنہما سے روایت کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اپنے بعد مردوں کے لیے عورتوں کے فتنہ سے بڑھ کر نقصان دینے والا اور کوئی فتنہ نہیں چھوڑا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5097,
			"arabicnumber": 5097,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم کو امام مالک نے خبر دی انہیں ربیعہ بن ابوعبدالرحمٰن نے انہیں قاسم بن محمد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ بریرہ کے ساتھ تین سنت قائم ہوتی ہیں، انہیں آزاد کیا اور پھر اختیار دیا گیا ( کہ اگر چاہیں تو اپنے شوہر سابقہ سے اپنا نکاح فسخ کر سکتی ہیں ) اور رسول اللہ صلی اللہ علیہ وسلم نے ( بریرہ رضی اللہ عنہا کے بارے میں ) فرمایا کہ ولاء آزاد کرانے والے کے ساتھ قائم ہوئی ہے اور نبی کریم صلی اللہ علیہ وسلم گھر میں داخل ہوئے تو ایک ہانڈی ( گوشت کی ) چولہے پر تھی۔ پھر نبی کریم صلی اللہ علیہ وسلم کے لیے روٹی اور گھر کا سالن لایا گیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( چولہے پر ) ہانڈی ( گوشت کی ) بھی تو میں نے دیکھی تھی۔ عرض کیا گیا کہ وہ ہانڈی اس گوشت کی تھی جو بریرہ کو صدقہ میں ملا تھا اور آپ صلی اللہ علیہ وسلم صدقہ نہیں کھاتے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ اس کے لیے صدقہ ہے اور اب ہمارے لیے ان کی طرف سے تحفہ ہے۔ ہم اسے کھا سکتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5098,
			"arabicnumber": 5098,
			"text": "ہم سے محمد بن سلام بیکندی نے بیان کیا، کہا ہم کو عبدہ نے خبر دی، انہیں ہشام نے، انہیں ان کے والد نے اور انہیں عائشہ رضی اللہ عنہا نے اللہ تعالیٰ کے ارشاد «وإن خفتم أن لا،‏‏‏‏ تقسطوا في اليتامى‏» ”اور اگر تمہیں خوف ہو کہ تم یتیموں کے بارے میں انصاف نہیں کر سکو گے۔“ کے بارے میں فرمایا کہ اس سے مراد یتیم لڑکی ہے جو اپنے ولی کی پرورش میں ہو۔ ولی اس سے اس کے مال کی وجہ سے شادی کرتے اور اچھی طرح اس سے سلوک نہ کرتے اور نہ اس کے مال کے بارے میں انصاف کرتے ایسے شخصوں کو یہ حکم ہوا کہ اس یتیم لڑکی سے نکاح نہ کریں بلکہ اس کے سوا جو عورتیں بھلی لگیں ان سے نکاح کر لیں۔ دو دو، تین تین یا چار چار تک کی اجازت ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5099,
			"arabicnumber": 5099,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے، ان سے عبداللہ بن ابوبکر نے، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ان کے یہاں تشریف رکھتے تھے اور آپ نے سنا کہ کوئی صاحب ام المؤمنین حفصہ رضی اللہ عنہا کے گھر میں اندر آنے کی اجازت چاہتے ہیں۔ بیان کیا کہ میں نے عرض کیا: یا رسول اللہ! یہ شخص آپ کے گھر میں آنے کی اجازت چاہتا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میرا خیال ہے کہ یہ فلاں شخص ہے، آپ صلی اللہ علیہ وسلم نے حفصہ رضی اللہ عنہا کے ایک دودھ کے چچا کا نام لیا۔ اس پر عائشہ رضی اللہ عنہا نے پوچھا: کیا فلاں، جو ان کے دودھ کے چچا تھے، اگر زندہ ہوتے تو میرے یہاں آ جا سکتے تھے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جیسے خون ملنے سے حرمت ہوتی ہے، ویسے ہی دودھ پینے سے بھی حرمت ثابت ہو جاتی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5100,
			"arabicnumber": 5100,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے شعبہ نے، ان سے قتادہ نے، ان سے جابر بن زید نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سے کہا گیا کہ آپ حمزہ رضی اللہ عنہ کی بیٹی سے نکاح کیوں نہیں کر لیتے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ میرے دودھ کے بھائی کی بیٹی ہے۔ اور بشر بن عمر نے بیان کیا، ان سے شعبہ نے بیان کیا، انہوں نے قتادہ سے سنا اور انہوں نے اسی طرح جابر بن زید سے سنا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5101,
			"arabicnumber": 5101,
			"text": "ہم سے حکم بن نافع نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، انہیں عروہ بن زبیر نے خبر دی، انہیں زینب بنت ابی سلمہ نے خبر دی اور انہیں ام المؤمنین ام حبیبہ بنت ابی سفیان نے خبر دی کہ انہوں نے عرض کیا کہ یا رسول اللہ! میری بہن ( ابوسفیان کی لڑکی ) سے نکاح کر لیجئے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم اسے پسند کرو گی ( کہ تمہاری سوکن بہن بنے ) ؟ میں نے عرض کیا جی ہاں، میں تو پسند کرتی ہوں اگر میں اکیلی آپ کی بیوی ہوتی تو پسند نہ کرتی۔ پھر میری بہن اگر میرے ساتھ بھلائی میں شریک ہو تو میں کیونکر نہ چاہوں گی ( غیروں سے تو بہن ہی اچھی ہے ) آپ صلی اللہ علیہ وسلم نے فرمایا وہ میرے لیے حلال نہیں ہے۔ ام حبیبہ رضی اللہ عنہا نے کہا: یا رسول اللہ! لوگ کہتے ہیں آپ ابوسلمہ کی بیٹی سے جو ام سلمہ کے پیٹ سے ہے، نکاح کرنے والے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر وہ میری ربیبہ اور میری پرورش میں نہ ہوتی ( یعنی میری بیوی کی بیٹی نہ ہوتی ) جب بھی میرے لیے حلال نہ ہوتی۔ وہ دوسرے رشتے سے میری دودھ بھتیجی ہے، مجھ کو اور ابوسلمہ کے باپ کو دونوں کو ثوبیہ نے دودھ پلایا ہے۔ دیکھو، ایسا مت کرو اپنی بیٹیوں اور بہنوں کو مجھ سے نکاح کرنے کے لیے نہ کہو۔ عروہ راوی نے کہا ثوبیہ ابولہب کی لونڈی تھی۔ ابولہب نے اس کو آزاد کر دیا تھا۔ ( جب اس نے نبی کریم صلی اللہ علیہ وسلم کے پیدا ہونے کی خبر ابولہب کو دی تھی ) پھر اس نے نبی کریم صلی اللہ علیہ وسلم کو دودھ پلایا تھا جب ابولہب مر گیا تو اس کے کسی عزیز نے مرنے کے بعد اس کو خواب میں برے حال میں دیکھا تو پوچھا کیا حال ہے کیا گزری؟ وہ کہنے لگا جب سے میں تم سے جدا ہوا ہوں کبھی آرام نہیں ملا مگر ایک ذرا سا پانی ( پیر کے دن مل جاتا ہے ) ابولہب نے اس گڑھے کی طرف اشارہ کیا جو انگوٹھے اور کلمہ کے انگلی کے بیچ میں ہوتا ہے یہ بھی اس وجہ سے کہ میں نے ثوبیہ کو آزاد کر دیا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5102,
			"arabicnumber": 5102,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے اشعث نے، ان سے ان کے دادا نے، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم ان کے پاس تشریف لائے تو دیکھا کہ ان کے یہاں ایک مرد بیٹھا ہوا ہے۔ آپ صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا گویا کہ آپ نے اس کو پسند نہیں فرمایا عائشہ رضی اللہ عنہا نے عرض کیا یا رسول اللہ! یہ میرے دودھ والے بھائی ہیں آپ صلی اللہ علیہ وسلم نے فرمایا دیکھو، سوچ سمجھ کر کہو کون تمہارا بھائی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5103,
			"arabicnumber": 5103,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں عروہ بن زبیر نے، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ابوقعیس کے بھائی افلح نے ان کے یہاں اندر آنے کی اجازت چاہی۔ وہ عائشہ رضی اللہ عنہا کے رضاعی چچا تھے ( یہ واقعہ پردہ کا حکم نازل ہونے کے بعد کا ہے عائشہ رضی اللہ عنہا نے بیان کیا کہ ) میں نے انہیں اندر آنے کی اجازت نہیں دی پھر جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم کو ان کے ساتھ اپنے معاملے کو بتایا، نبی کریم صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں انہیں اندر آنے کی اجازت دے دوں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5104,
			"arabicnumber": 5104,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم نے، کہا ہم کو ایوب سختیانی نے خبر دی، انہیں عبداللہ بن ابی ملیکہ نے، کہا کہ مجھ سے عبیداللہ بن ابی مریم نے بیان کیا، ان سے عقبہ بن حارث رضی اللہ عنہ نے (عبداللہ بن ابی ملیکہ نے) بیان کیا کہ میں نے یہ حدیث خود عقبہ سے بھی سنی ہے لیکن مجھے عبید کے واسطے سے سنی ہوئی حدیث زیادہ یاد ہے۔ عقبہ بن حارث نے بیان کیا کہ میں نے ایک عورت ( ام یحییٰ بن ابی اہاب ) سے نکاح کیا۔ پھر ایک کالی عورت آئی اور کہنے لگی کہ میں نے تم دونوں ( میاں بیوی ) کو دودھ پلایا ہے۔ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا کہ میں نے فلانی بنت فلاں سے نکاح کیا ہے۔ اس کے بعد ہمارے یہاں ایک کالی عورت آئی اور مجھ سے کہنے لگی کہ میں نے تم دونوں کو دودھ پلایا ہے، حالانکہ وہ جھوٹی ہے ( آپ صلی اللہ علیہ وسلم کو عقبہ کا یہ کہنا کہ وہ جھوٹی ہے ناگوار گزرا ) آپ صلی اللہ علیہ وسلم نے اس پر اپنا چہرہ مبارک پھیر لیا۔ پھر میں آپ کے سامنے آیا اور عرض کیا وہ عورت جھوٹی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس بیوی سے اب کیسے نکاح رہ سکے گا جبکہ یہ عورت یوں کہتی ہے کہ اس نے تم دونوں کو دودھ پلایا ہے، اس عورت کو اپنے سے الگ کر دو۔“ ( حدیث کے راوی ) اسماعیل بن علیہ نے اپنی شہادت اور بیچ کی انگلی سے اشارہ کر کے بتایا کہ ایوب نے اس طرح اشارہ کر کے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5105,
			"arabicnumber": 5105,
			"text": "اور امام احمد بن حنبل نے مجھ سے کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا، انہوں نے سفیان ثوری سے، کہا مجھ سے حبیب بن ابی ثابت نے بیان کیا، انہوں نے سعید بن جبیر سے، انہوں نے ابن عباس رضی اللہ عنہما سے، انہوں نے کہا خون کی رو سے تم پر سات رشتے حرام ہیں اور شادی کی وجہ سے ( یعنی سسرال کی طرف سے ) سات رشتے بھی۔ انہوں نے یہ آیت پڑھی «حرمت عليكم أمهاتكم‏» آخر تک۔ اور عبداللہ بن جعفر بن ابی طالب نے علی رضی اللہ عنہ کی صاحبزادی زینب اور علی کی بی بی ( لیلٰی بنت مسعود ) دونوں سے نکاح کیا، ان کو جمع کیا اور ابن سیرین نے کہا اس میں کوئی قباحت نہیں ہے اور امام حسن بصری نے ایک بار تو اسے مکروہ کہا پھر کہنے لگے اس میں کوئی قباحت نہیں ہے اور حسن بن حسن بن علی بن ابی طالب نے اپنے دونوں چاچاؤں ( یعنی محمد بن علی اور عمرو بن علی ) کی بیٹیوں کو ایک ساتھ میں نکاح میں لے لیا اور جابر بن زید تابعی نے اس کو مکروہ جانا، اس خیال سے کہ بہنوں میں جلاپا نہ پیدا ہو مگر یہ کچھ حرام نہیں ہے کیونکہ اللہ تعالیٰ نے فرمایا «وأحل لكم ما وراء ذلكم‏» کہ ان کے سوا اور سب عورتیں تم کو حلال ہیں۔ اور عکرمہ نے ابن عباس رضی اللہ عنہما سے روایت کیا کہ اگر کسی نے اپنی سالی سے زنا کیا تو اس کی بیوی ( سالی کی بہن ) اس پر حرام نہ ہو گی۔ اور یحییٰ بن قیس کندی سے روایت ہے، انہوں نے شعبی اور جعفر سے، دونوں نے کہا اگر کوئی شخص لواطت کرے اور کسی لونڈے کے دخول کر دے تو اب اس کی ماں سے نکاح نہ کرے۔ اور یحییٰ راوی مشہور شخص نہیں ہے اور نہ کسی اور نے اس کے ساتھ ہو کر یہ روایت کی ہے اور عکرمہ نے ابن عباس رضی اللہ عنہما سے روایت کی کہ اگر کسی نے اپنی ساس سے زنا کیا تو اس کی بیوی اس پر حرام نہ ہو گی۔ اور ابونصر نے ابن عباس رضی اللہ عنہما سے روایت کی کہ حرام ہو جائے گی اور اس راوی ابونصر کا حال معلوم نہیں۔ اس نے ابن عباس رضی اللہ عنہما سے سنا ہے یا نہیں ( لیکن ابوزرعہ نے اسے ثقہ کہا ہے ) اور عمران بن حصین اور جابر بن زید اور حسن بصری اور بعض عراق والوں ( امام ثوری اور امام ابوحنیفہ رحمہ اللہ ) کا یہی قول ہے کہ حرام ہو جائے گی۔ اور ابوہریرہ رضی اللہ عنہ نے کہا حرام نہ ہو گی جب تک اس کی ماں ( اپنی خوشدامن ) کو زمین سے نہ لگا دے ( یعنی اس سے جماع نہ کرے ) اور سعید بن مسیب اور عروہ اور زہری نے اس کے متعلق کہا ہے کہ اگر کوئی ساس سے زنا کرے تب بھی اس کی بیٹی یعنی زنا کرنے والے کی بیوی اس پر حرام نہ ہو گی ( اس کو رکھ سکتا ہے ) اور زہری نے کہا علی رضی اللہ عنہ نے فرمایا کہ اس کی جورو اس پر حرام نہ ہو گی اور یہ روایت منقطع ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5106,
			"arabicnumber": 5106,
			"text": "ہم سے حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ ہم سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے اور ان سے زینب بنت ابی سلمہ نے اور ان سے ام حبیبہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا: یا رسول اللہ! آپ ابوسفیان کی صاحبزادی ( غرہ یا درہ یا حمنہ ) کو چاہتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر میں اس کے ساتھ کیا کروں گا؟ میں نے عرض کیا کہ اس سے آپ نکاح کر لیں۔ فرمایا کیا تم اسے پسند کرو گی؟ میں نے عرض کیا میں کوئی تنہا تو ہوں نہیں اور میں اپنی بہن کے لیے یہ پسند کرتی ہوں کہ وہ بھی میرے ساتھ آپ کے تعلق میں شریک ہو جائے۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ میرے لیے حلال نہیں ہے میں نے عرض کیا مجھے معلوم ہوا ہے کہ آپ نے ( زینب سے ) نکاح کا پیغام بھیجا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ام سلمہ کی لڑکی کے پاس؟ میں نے کہا کہ جی ہاں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ واہ واہ، اگر وہ میری ربیبہ نہ ہوتی جب بھی وہ میرے لیے حلال نہ ہوتی۔ مجھے اور اس کے والد ابوسلمہ کو ثویبہ نے دودھ پلایا تھا۔ دیکھو تم آئندہ میرے نکاح کے لیے اپنی لڑکیوں اور بہنوں کو نہ پیش کیا کرو۔ اور لیث بن سعد نے بھی اس حدیث کو ہشام سے روایت کیا ہے اس میں ابوسلمہ کی بیٹی کا نام درہ مذکور ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5107,
			"arabicnumber": 5107,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، انہیں عروہ بن زبیر نے خبر دی اور انہیں زینب بنت ابی سلمہ رضی اللہ عنہما نے خبر دی کہ ام حبیبہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا: یا رسول اللہ! میری بہن ( غرہ ) بنت ابی سفیان سے آپ نکاح کر لیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اور تمہیں بھی پسند ہے؟ میں نے عرض کیا جی ہاں کوئی میں تنہا تو ہوں نہیں اور میری خواہش ہے کہ آپ کی بھلائی میں میرے ساتھ میری بہن بھی شریک ہو جائے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ میرے لیے حلال نہیں ہے۔ میں نے عرض کیا: یا رسول اللہ! اللہ کی قسم! اس طرح کی باتیں سننے میں آتی ہیں کہ آپ ابوسلمہ کی صاحبزادی درہ سے نکاح کرنا چاہتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ ام سلمہ کی لڑکی سے؟ میں نے کہا جی ہاں۔ فرمایا اللہ کی قسم اگر وہ میری پرورش میں نہ ہوتی جب بھی وہ میرے لیے حلال نہیں تھی کیونکہ وہ میرے رضاعی بھائی کی لڑکی ہے۔ مجھے اور ابوسلمہ کو ثویبہ نے دودھ پلایا تھا۔ ( اس لیے وہ میری رضاعی بھتیجی ہو گئی ) تم لوگ میرے نکاح کے لیے اپنی لڑکیوں اور بہنوں کو نہ پیش کیا کرو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5108,
			"arabicnumber": 5108,
			"text": "ہم سے عبدالرحمٰن نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو عاصم نے خبر دی، انہیں شعبی نے اور انہوں نے جابر رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کسی ایسی عورت سے نکاح کرنے سے منع کیا تھا جس کی پھوپھی یا خالہ اس کے نکاح میں ہو۔ اور داؤد بن عون نے شعبی سے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5109,
			"arabicnumber": 5109,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک نے خبر دی، انہیں ابوالزناد نے، انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کسی عورت کو اس کی پھوپھی یا اس کی خالہ کے ساتھ نکاح میں جمع نہ کیا جائے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5111,
			"arabicnumber": 5111,
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5112,
			"arabicnumber": 5112,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے شغار سے منع فرمایا ہے۔ شغار یہ ہے کہ کوئی شخص اپنی لڑکی یا بہن کا نکاح اس شرط کے ساتھ کرے کہ وہ دوسرا شخص اپنی ( بیٹی یا بہن ) اس کو بیاہ دے اور کچھ مہر نہ ٹھہرے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5113,
			"arabicnumber": 5113,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم سے محمد بن فضیل نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے بیان کیا کہ خولہ بنت حکیم رضی اللہ عنہا ان عورتوں میں سے تھیں جنہوں نے اپنے آپ کو رسول اللہ صلی اللہ علیہ وسلم کے لیے ہبہ کیا تھا۔ اس پر عائشہ رضی اللہ عنہا نے کہا کہ ایک عورت اپنے آپ کو کسی مرد کے لیے ہبہ کرتے شرماتی نہیں۔ پھر جب آیت «ترجئ من تشاء منهن‏» ”اے پیغمبر! تو اپنی جس بیوی کو چاہے پیچھے ڈال دے اور جسے چاہے اپنے پاس جگہ دے“ نازل ہوئی تو میں نے کہا: یا رسول اللہ! اب میں سمجھی اللہ تعالیٰ جلد جلد آپ کی خوشی کو پورا کرتا ہے۔ اس حدیث کو ابوسعید ( محمد بن مسلم ) ، مؤدب اور محمد بن بشر اور عبدہ بن سلیمان نے بھی ہشام سے، انہوں نے اپنے والد سے، انہوں نے عائشہ رضی اللہ عنہا سے روایت کیا ہے۔ ایک نے دوسرے سے کچھ زیادہ مضمون نقل کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5114,
			"arabicnumber": 5114,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، کہا ہم کو سفیان بن عیینہ نے خبر دی، کہا ہم کو عمرو بن دینار نے خبر دی، کہا ہم سے جابر بن زید نے بیان کیا، کہا ہم کو ابن عباس رضی اللہ عنہما نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے ( میمونہ رضی اللہ عنہا سے ) نکاح کیا اور اس وقت آپ احرام باندھے ہوئے تھے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5115,
			"arabicnumber": 5115,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا، انہوں نے زہری سے سنا، وہ بیان کرتے تھے کہ مجھے حسن بن محمد بن علی اور ان کے بھائی عبداللہ بن محمد بن علی نے اپنے والد (محمد بن الحنفیہ) سے خبر دی کہ علی رضی اللہ عنہ نے عبداللہ بن عباس رضی اللہ عنہما سے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے متعہ اور پالتو گدھے کے گوشت سے جنگ خیبر کے زمانہ میں منع فرمایا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5116,
			"arabicnumber": 5116,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ بن حجاج نے بیان کیا، ان سے ابوجمرہ نے بیان کیا، کہا میں نے ابن عباس رضی اللہ عنہما سے سنا، ان سے عورتوں کے ساتھ نکاح متعہ کرنے کے متعلق سوال کیا گیا تھا تو انہوں نے اس کی اجازت دی، پھر ان کے ایک غلام نے ان سے پوچھا کہ اس کی اجازت سخت مجبوری یا عورتوں کی کمی یا اسی جیسی صورتوں میں ہو گی؟ تو ابن عباس رضی اللہ عنہما نے کہا کہ ہاں۔ ( نوٹ: یہ حرمت سے قبل کی بات ہے بعد میں ہر حالت میں ہر شخص کے لیے متعہ حرام قرار دیا گیا جو قیامت تک کے لیے ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5118,
			"arabicnumber": 5118,
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5119,
			"arabicnumber": 5119,
			"text": "اور ابن ابی ذئب نے بیان کیا کہ مجھ سے ایاس بن سلمہ بن الاکوع نے بیان کیا اور ان سے ان کے والد نے اور ان سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو مرد اور عورت متعہ کر لیں اور کوئی مدت متعین نہ کریں تو ( کم سے کم ) تین دن، تین رات مل کر رہیں، پھر اگر وہ تین دن سے زیادہ اس متعہ کو رکھنا چاہیں یا ختم کرنا چاہیں تو انہیں اس کی اجازت ہے ( سلمہ بن الاکوع کہتے ہیں کہ ) مجھے معلوم نہیں یہ حکم صرف ہمارے ( صحابہ ) ہی کے لیے تھا یا تمام لوگوں کے لیے ہے ابوعبداللہ ( امام بخاری رحمہ اللہ ) کہتے ہیں کہ خود علی رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ایسی روایت کی جس سے معلوم ہوتا ہے کہ متعہ کی حلت منسوخ ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5120,
			"arabicnumber": 5120,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے مرحوم بن عبدالعزیز بصریٰ نے بیان کیا، کہا کہ میں نے ثابت بنانی سے سنا، انہوں نے بیان کیا کہ میں انس رضی اللہ عنہ کے پاس تھا اور ان کے پاس ان کی بیٹی بھی تھیں۔ انس رضی اللہ عنہ نے بیان کیا کہ ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اپنے آپ کو آپ صلی اللہ علیہ وسلم کے لیے پیش کرنے کی غرض سے حاضر ہوئیں اور عرض کیا: یا رسول اللہ! کیا آپ کو میری ضرورت ہے؟ اس پر انس رضی اللہ عنہ کی بیٹی بولیں کہ وہ کیسی بےحیاء عورت تھی۔ ہائے، بےشرمی! ہائے بےشرمی! انس رضی اللہ عنہ نے ان سے کہا وہ تم سے بہتر تھیں، ان کو نبی کریم صلی اللہ علیہ وسلم کی طرف رغبت تھی، اس لیے انہوں نے اپنے آپ کو نبی کریم صلی اللہ علیہ وسلم کے لیے پیش کیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5121,
			"arabicnumber": 5121,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم سے ابوغسان نے بیان کیا کہا کہ مجھ سے ابوحازم نے بیان کیا، ان سے سہل بن سعد رضی اللہ عنہ نے کہ ایک عورت نے اپنے آپ کو نبی کریم صلی اللہ علیہ وسلم سے نکاح کے لیے پیش کیا۔ پھر ایک صحابی نے نبی کریم صلی اللہ علیہ وسلم سے کہا کہ یا رسول اللہ! ان کا نکاح مجھ سے کرا دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا تمہارے پاس ( مہر کے لیے ) کیا ہے؟ انہوں نے کہا کہ میرے پاس تو کچھ بھی نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور تلاش کرو، خواہ لوہے کی ایک انگوٹھی ہی مل جائے۔ وہ گئے اور واپس آ گئے اور عرض کیا کہ اللہ کی قسم! میں نے کوئی چیز نہیں پائی۔ مجھے لوہے کی انگوٹھی بھی نہیں ملی، البتہ یہ میرا تہمد میرے پاس ہے اس کا آدھا انہیں دے دیجئیے۔ سہل رضی اللہ عنہ نے بیان کیا کہ ان کے پاس چادر بھی نہیں تھی۔ مگر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ تمہارے اس تہمد کا کیا کرے گی، اگر یہ اسے پہن لے گی تو یہ اس قدر چھوٹا کپڑا ہے کہ پھر تو تمہارے لیے اس میں سے کچھ باقی نہیں بچے گا اور اگر تم پہنو گے تو اس کے لیے کچھ نہیں رہے گا۔ پھر وہ صاحب بیٹھ گئے، دیر تک بیٹھے رہنے کے بعد اٹھے ( اور جانے لگے ) تو نبی کریم صلی اللہ علیہ وسلم نے انہیں دیکھا اور بلایا، یا انہیں بلایا گیا ( راوی کو ان الفاظ میں شک تھا ) پھر آپ صلی اللہ علیہ وسلم نے ان سے پوچھا کہ تمہیں قرآن کتنا یاد ہے؟ انہوں نے کہا کہ مجھے فلاں، فلاں سورتیں یاد ہیں چند سورتیں انہوں نے گنائیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہم نے تمہارے نکاح میں اس کو اس قرآن کے بدلے دے دیا جو تمہیں یاد ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5122,
			"arabicnumber": 5122,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے صالح بن کیسان نے، ان سے ابن شہاب نے بیان کیا کہ مجھے سالم بن عبداللہ نے خبر دی، انہوں نے عبداللہ بن عمر سے عمر بن خطاب رضی اللہ عنہم کے متعلق سنا کہ جب ( ان کی صاحبزادی ) حفصہ بنت عمر رضی اللہ عنہا ( اپنے شوہر ) خنیس بن حذافہ سہمی کی وفات کی وجہ سے بیوہ ہو گئیں اور خنیس رسول اللہ صلی اللہ علیہ وسلم کے صحابی تھے اور ان کی وفات مدینہ منورہ میں ہوئی تھی۔ عمر بن خطاب رضی اللہ عنہ نے بیان کیا کہ میں عثمان بن عفان رضی اللہ عنہ کے پاس آیا اور ان کے لیے حفصہ رضی اللہ عنہا کو پیش کیا۔ انہوں نے کہا کہ میں اس معاملہ میں غور کروں گا۔ میں نے کچھ دنوں تک انتظار کیا۔ پھر مجھ سے ابوبکر رضی اللہ عنہ نے ملاقات کی اور میں نے کہا کہ اگر آپ پسند کریں تو میں آپ کی شادی حفصہ رضی اللہ عنہا سے کر دوں۔ ابوبکر رضی اللہ عنہ خاموش رہے اور مجھے کوئی جواب نہیں دیا۔ ان کی اس بےرخی سے مجھے عثمان رضی اللہ عنہ کے معاملہ سے بھی زیادہ رنج ہوا۔ کچھ دنوں تک میں خاموش رہا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے خود حفصہ رضی اللہ عنہا سے نکاح کا پیغام بھیجا اور میں نے نبی کریم صلی اللہ علیہ وسلم سے اس کی شادی کر دی۔ اس کے بعد ابوبکر رضی اللہ عنہ مجھ سے ملے اور کہا کہ جب تم نے حفصہ رضی اللہ عنہا کا معاملہ میرے سامنے پیش کیا تھا تو میرے اس پر میرے خاموش رہنے سے تمہیں تکلیف ہوئی ہو گی کہ میں نے تمہیں اس کا کوئی جواب نہیں دیا تھا۔ عمر رضی اللہ عنہ نے بیان کیا کہ میں نے کہا کہ واقعی ہوئی تھی۔ ابوبکر رضی اللہ عنہ نے کہا کہ تم نے جو کچھ میرے سامنے رکھا تھا، اس کا جواب میں نے صرف اس وجہ سے نہیں دیا تھا کہ میرے علم میں تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے خود حفصہ رضی اللہ عنہا کا ذکر کیا ہے اور میں نبی کریم صلی اللہ علیہ وسلم کے راز کو ظاہر کرنا نہیں چاہتا تھا اگر نبی کریم صلی اللہ علیہ وسلم چھوڑ دیتے تو میں حفصہ کو اپنے نکاح میں لے آتا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5123,
			"arabicnumber": 5123,
			"text": "ہم سے قتیبہ نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے یزید بن ابی حبیب نے، ان سے عراک بن مالک نے اور انہیں زینب بنت ابی سلمہ نے خبر دی کہ ام حبیبہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ ہمیں معلوم ہوا ہے کہ آپ درہ بنت ابی سلمہ سے نکاح کرنے والے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا میں اس سے اس کے باوجود نکاح کر سکتا ہوں کہ ( ان کی ماں ) ام سلمہ میرے نکاح میں پہلے ہی سے موجود ہے اور اگر میں ام سلمہ سے نکاح نہ کئے ہوتا جب بھی وہ درہ میرے لیے حلال نہیں تھی۔ کیونکہ اس کے والد ( ابوسلمہ رضی اللہ عنہ ) میرے رضاعی بھائی تھے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5124,
			"arabicnumber": 5124,
			"text": "امام بخاری رحمہ اللہ نے کہا مجھ سے طلق بن غنام نے بیان کیا، کہا ہم سے زائدہ بن قدام نے بیان کیا، ان سے منصور بن معتمر نے، ان سے مجاہد نے کہ ابن عباس رضی اللہ عنہما نے آیت «فيما عرضتم‏» کی تفسیر میں کہا کہ کوئی شخص کسی ایسی عورت سے جو عدت میں ہو کہے کہ میرا ارادہ نکاح کا ہے اور میری خواہش ہے کہ مجھے کوئی نیک بخت عورت میسر آ جائے اور اس نکاح میں قاسم بن محمد نے کہا کہ ( تعریض یہ ہے کہ ) عدت میں عورت سے کہے کہ تم میری نظر میں بہت اچھی ہو اور میرا خیال نکاح کرنے کا ہے اور اللہ تمہیں بھلائی پہنچائے گا یا اسی طرح کے جملے کہے اور عطاء بن ابی رباح نے کہا کہ تعریض و کنایہ سے کہے۔ صاف صاف نہ کہے ( مثلاً ) کہے کہ مجھے نکاح کی ضرورت ہے اور تمہیں بشارت ہو اور اللہ کے فضل سے اچھی ہو اور عورت اس کے جواب میں کہے کہ تمہاری بات میں نے سن لی ہے ( بصراحت ) کوئی وعدہ نہ کرے ایسی عورت کا ولی بھی اس کے علم کے بغیر کوئی وعدہ نہ کرے اور اگر عورت نے زمانہ عدت میں کسی مرد سے نکاح کا وعدہ کر لیا اور پھر بعد میں اس سے نکاح کیا تو دونوں میں جدائی نہیں کرائی جائے گی۔ حسن نے کہا کہ «لا تواعدوهن سرا‏» سے یہ مراد ہے کہ عورت سے چھپ کر بدکاری نہ کرو۔ ابن عباس رضی اللہ عنہما سے منقول ہے کہ «الكتاب أجله‏» سے مراد عدت کا پورا کرنا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5125,
			"arabicnumber": 5125,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ( نکاح سے پہلے ) میں نے تمہیں خواب میں دیکھا کہ ایک فرشتہ ( جبرائیل علیہ السلام ) ریشم کے ایک ٹکڑے میں تمہیں لپیٹ کر لے آیا ہے اور مجھ سے کہہ رہا ہے کہ یہ تمہاری بیوی ہے۔ میں نے اس کے چہرے سے کپڑا ہٹایا تو وہ تم تھیں۔ میں نے کہا کہ اگر یہ خواب اللہ کی طرف سے ہے تو وہ اسے خود ہی پورا کر دے گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5126,
			"arabicnumber": 5126,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا، ان سے ابوحازم سلمہ بن دینار نے، ان سے سہل بن سعد رضی اللہ عنہ نے کہ ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا: یا رسول اللہ! میں آپ کی خدمت میں اپنے آپ کو ہبہ کرنے آئی ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے ان کی طرف دیکھا اور نظر اٹھا کر دیکھا، پھر نظر نیچی کر لی اور سر کو جھکا لیا۔ جب خاتون نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم نے ان کے بارے میں کوئی فیصلہ نہیں فرمایا تو بیٹھ گئیں۔ اس کے بعد آپ کے صحابہ میں سے ایک صاحب کھڑے ہوئے اور عرض کیا کہ یا رسول اللہ! اگر آپ کو ان کی ضرورت نہیں تو ان کا نکاح مجھ سے کرا دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس کوئی چیز ہے؟ انہوں نے عرض کی کہ نہیں یا رسول اللہ، اللہ کی قسم! نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اپنے گھر جاؤ اور دیکھو شاید کوئی چیز مل جائے۔ وہ گئے اور واپس آ کر عرض کی کہ نہیں یا رسول اللہ! میں نے کوئی چیز نہیں پائی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اور دیکھ لو، اگر ایک لوہے کی انگوٹھی بھی مل جائے۔ وہ گئے اور واپس آ کر عرض کیا: یا رسول اللہ! مجھے لوہے کی انگوٹھی بھی نہیں ملی، البتہ یہ میرا تہمد ہے۔ سہل رضی اللہ عنہ نے بیان کیا کہ ان کے پاس چادر بھی نہیں تھی ( ان صحابی نے کہا کہ ) ان خاتون کو اس تہمد میں سے آدھا عنایت فرما دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ تمہارے تہمد کا کیا کرے گی اگر تم اسے پہنو گے تو اس کے لیے اس میں سے کچھ باقی نہیں رہے گا۔ اس کے بعد وہ صاحب بیٹھ گئے اور دیر تک بیٹھے رہے پھر کھڑے ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں واپس جاتے ہوئے دیکھا اور انہیں بلانے کے لیے فرمایا، انہیں بلایا گیا۔ جب وہ آئے تو آپ صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا کہ تمہارے پاس قرآن مجید کتنا ہے۔ انہوں نے عرض کیا فلاں فلاں سورتیں۔ انہوں نے ان سورتوں کو گنایا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم ان سورتوں کو زبانی پڑھ لیتے ہو۔ انہوں نے ہاں میں جواب دیا۔ نبی کریم صلی اللہ علیہ وسلم نے پھر فرمایا کہ جاؤ میں نے اس خاتون کو تمہارے نکاح میں اس قرآن کی وجہ سے دیا جو تمہارے پاس ہے۔ ان سورتوں کو اس سے یاد کرا دو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5127,
			"arabicnumber": 5127,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، ان سے یونس نے (دوسری سند) امام بخاری رحمہ اللہ نے کہا ہم سے احمد بن صالح نے بیان کیا، کہا ہم سے عنبسہ بن خالد نے بیان کیا، کہا ہم سے یونس نے بیان کیا، ان سے ابن شہاب نے، کہا کہ مجھے عروہ بن زبیر نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے خبر دی کہ زمانہ جاہلیت میں نکاح چار طرح ہوتے تھے۔ ایک صورت تو یہی تھی جیسے آج کل لوگ کرتے ہیں، ایک شخص دوسرے شخص کے پاس اس کی زیر پرورش لڑکی یا اس کی بیٹی کے نکاح کا پیغام بھیجتا اور اس کا مہر دے کر اس سے نکاح کر لیتا۔ دوسرا نکاح یہ تھا کہ کوئی شوہر اپنی بیوی سے جب وہ حیض سے پاک ہو جاتی تو کہتا تو فلاں شخص کے پاس چلی جا اور اس سے منہ کالا کرا لے اس مدت میں شوہر اس سے جدا رہتا اور اسے چھوتا بھی نہیں۔ پھر جب اس غیر مرد سے اس کا حمل ظاہر ہو جاتا جس سے وہ عارضی طور پر صحبت کرتی رہتی، تو حمل کے ظاہر ہونے کے بعد اس کا شوہر اگر چاہتا تو اس سے صحبت کرتا۔ ایسا اس لیے کرتے تھے تاکہ ان کا لڑکا شریف اور عمدہ پیدا ہو۔ یہ نکاح ”استبضاع“ کہلاتا تھا۔ تیسری قسم نکاح کی یہ تھی کہ چند آدمی جو تعداد میں دس سے کم ہوتے کسی ایک عورت کے پاس آنا جانا رکھتے اور اس سے صحبت کرتے۔ پھر جب وہ عورت حاملہ ہوتی اور بچہ جنتی تو وضع حمل پر چند دن گزرنے کے بعد وہ عورت اپنے ان تمام مردوں کو بلاتی۔ اس موقع پر ان میں سے کوئی شخص انکار نہیں کر سکتا تھا۔ چنانچہ وہ سب اس عورت کے پاس جمع ہو جاتے اور وہ ان سے کہتی کہ جو تمہارا معاملہ تھا وہ تمہیں معلوم ہے اور اب میں نے یہ بچہ جنا ہے۔ پھر وہ کہتی کہ اے فلاں! یہ بچہ تمہارا ہے۔ وہ جس کا چاہتی نام لے دیتی اور وہ لڑکا اسی کا سمجھا جاتا، وہ شخص اس سے انکار کی جرات نہیں کر سکتا تھا۔ چوتھا نکاح اس طور پر تھا کہ بہت سے لوگ کسی عورت کے پاس آیا جایا کرتے تھے۔ عورت اپنے پاس کسی بھی آنے والے کو روکتی نہیں تھی۔ یہ کسبیاں ہوتی تھیں۔ اس طرح کی عورتیں اپنے دروازوں پر جھنڈے لگائے رہتی تھیں جو نشانی سمجھے جاتے تھے۔ جو بھی چاہتا ان کے پاس جاتا۔ اس طرح کی عورت جب حاملہ ہوتی اور بچہ جنتی تو اس کے پاس آنے جانے والے جمع ہوتے اور کسی قیافہ جاننے والے کو بلاتے اور بچہ کا ناک نقشہ جس سے ملتا جلتا ہوتا اس عورت کے اس لڑکے کو اسی کے ساتھ منسوب کر دیتے اور وہ بچہ اسی کا بیٹا کہا جاتا، اس سے کوئی انکار نہیں کرتا تھا۔ پھر جب محمد صلی اللہ علیہ وسلم حق کے ساتھ رسول ہو کر تشریف لائے آپ نے جاہلیت کے تمام نکاحوں کو باطل قرار دے دیا صرف اس نکاح کو باقی رکھا جس کا آج کل رواج ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5128,
			"arabicnumber": 5128,
			"text": "ہم سے یحییٰ بن سعید نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ان سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ آیت «وما يتلى عليكم في الكتاب في يتامى النساء اللاتي لا تؤتونهن ما كتب لهن وترغبون أن تنكحوهن‏» یعنی ”وہ ( آیات بھی ) جو تمہیں کتاب کے اندر ان یتیم لڑکوں کے بارے میں پڑھ کر سنائی جاتی ہیں جنہیں تم وہ نہیں دیتے ہو جو ان کے لیے مقرر ہو چکا ہے اور اس سے بیزار ہو کہ ان کا کسی سے نکاح کرو۔“ ایسی یتیم لڑکی کے بارے میں نازل ہوئی تھی جو کسی شخص کی پرورش میں ہو۔ ممکن ہے کہ اس کے مال و جائیداد میں بھی شریک ہو، وہی لڑکی کا زیادہ حقدار ہے لیکن وہ اس سے نکاح نہیں کرنا چاہتا البتہ اس کے مال کی وجہ سے اسے روکے رکھتا ہے اور کسی دوسرے مرد سے اس کی شادی نہیں ہونے دیتا کیونکہ وہ نہیں چاہتا کہ کوئی دوسرا اس کے مال میں حصہ دار بنے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5129,
			"arabicnumber": 5129,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ہشام نے بیان کیا، کہا ہم کو معمر نے خبر دی، کہا ہم سے زہری نے بیان کیا، کہا کہ مجھے سالم نے خبر دی، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ جب حفصہ بنت عمر رضی اللہ عنہما ابن حذافہ سہمی سے بیوہ ہوئیں۔ ابن حذافہ رضی اللہ عنہما نبی کریم صلی اللہ علیہ وسلم کے اصحاب میں سے تھے اور بدر کی جنگ میں شریک تھے ان کی وفات مدینہ منورہ میں ہوئی تھی تو عمر رضی اللہ عنہ نے بیان کیا کہ میں عثمان بن عفان رضی اللہ عنہ سے ملا اور انہیں پیش کش کی اور کہا کہ اگر آپ چاہیں تو میں حفصہ کا نکاح آپ سے کروں۔ انہوں نے جواب دیا کہ میں اس معاملہ میں غور کروں گا چند دن میں نے انتظار کیا اس کے بعد وہ مجھ سے ملے اور کہا کہ میں اس نتیجہ پر پہنچا ہوں کہ ابھی نکاح نہ کروں۔ عمر رضی اللہ عنہ نے بیان کیا کہ پھر میں ابوبکر رضی اللہ عنہ سے ملا اور ان سے کہا کہ اگر آپ چاہیں تو میں حفصہ کا نکاح آپ سے کروں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5130,
			"arabicnumber": 5130,
			"text": "ہم سے احمد بن عمرو نے بیان کیا، کہا کہ مجھ سے میرے والد حفص بن عبداللہ نے بیان کیا، کہا کہ مجھ سے ابراہیم بن طہمان نے بیان کیا، ان سے یونس نے، ان سے حسن بصری نے آیت «فلا تعضلوهن‏» کی تفسیر میں بیان کیا کہ مجھ سے معقل بن یسار رضی اللہ عنہ نے بیان کیا کہ یہ آیت میرے ہی بارے میں نازل ہوئی تھی میں نے اپنی ایک بہن کا نکاح ایک شخص سے کر دیا تھا۔ اس نے اسے طلاق دے دی لیکن جب عدت پوری ہوئی تو وہ شخص ( ابوالبداح ) میری بہن سے پھر نکاح کا پیغام لے کر آیا۔ میں نے اس سے کہا کہ میں نے تم سے اس کا ( اپنی بہن ) کا نکاح کیا اسے تمہاری بیوی بنایا اور تمہیں عزت دی لیکن تم نے اسے طلاق دیدی اور اب پھر تم نکاح کا پیغام لے کر آئے ہو۔ ہرگز نہیں، اللہ کی قسم! اب میں تمہیں کبھی اسے نہیں دوں گا۔ وہ شخص ابوالبداح کچھ برا آدمی نہ تھا اور عورت بھی اس کے یہاں واپس جانا چاہتی تھی اس لیے اللہ تعالیٰ نے یہ آیت نازل کی «فلا تعضلوهن‏» کہ ”تم عورتوں کو مت روکو“ میں نے عرض کیا کہ یا رسول اللہ! اب میں کر دوں گا۔ بیان کیا کہ پھر انہوں نے اپنی بہن کا نکاح اس شخص سے کر دیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5131,
			"arabicnumber": 5131,
			"text": "ہم سے ابن سلام نے بیان کیا، کہا ہم کو ابومعاویہ نے خبر دی، کہا ہم سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے آیت «ويستفتونك في النساء قل الله يفتيكم فيهن‏» ”اور آپ سے عورتوں کے بارے میں مسئلہ پوچھتے ہیں، آپ کہہ دیجئیے کہ اللہ ان کے بارے میں تمہیں مسئلہ بتاتا ہے۔“ آخر آیت تک فرمایا کہ یہ آیت یتیم لڑکی کے بارے میں نازل ہوئی، جو کسی مرد کی پرورش میں ہو۔ وہ مرد اس کے مال میں بھی شریک ہو اور اس سے خود نکاح کرنا چاہتا ہو اور اس کا نکاح کسی دوسرے سے کرنا پسند نہ کرتا ہو کہ کہیں دوسرا شخص اس کے مال میں حصہ دار نہ بن جائے اس غرض سے وہ لڑکی کو روکے رکھے تو اللہ تعالیٰ نے لوگوں کو اس سے منع کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5132,
			"arabicnumber": 5132,
			"text": "ہم سے احمد بن مقدام نے بیان کیا، کہا ہم سے فضیل بن سلیمان نے بیان کیا، کہا ہم سے ابوحازم نے بیان کیا، کہا ہم سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے کہ ایک خاتون آئیں اور اپنے آپ کو نبی کریم صلی اللہ علیہ وسلم کے لیے پیش کیا۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں نظر نیچی اوپر کر کے دیکھا اور کوئی جواب نہیں دیا پھر آپ کے صحابہ میں سے ایک صحابی نے عرض کیا: یا رسول اللہ! ان کا نکاح مجھ سے کرا دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس کوئی چیز ہے؟ انہوں نے عرض کیا کہ میرے پاس تو کچھ نہیں۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ لوہے کی انگوٹھی بھی نہیں؟ انہوں نے عرض کیا کہ لوہے کی ایک انگوٹھی بھی نہیں ہے۔ البتہ میں اپنی یہ چادر پھاڑ کے آدھی انہیں دے دوں گا اور آدھی خود رکھوں گا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں، تمہارے پاس کچھ قرآن بھی ہے؟ انہوں نے عرض کیا کہ ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر جاؤ میں نے تمہارا نکاح ان سے اس قرآن مجید کی وجہ سے کیا جو تمہارے ساتھ ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5133,
			"arabicnumber": 5133,
			"text": "ہم سے محمد بن یوسف بیکندی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے جب ان کا نکاح کیا تو ان کی عمر چھ سال تھی اور جب ان سے صحبت کی تو اس وقت ان کی عمر نو برس کی تھی اور وہ نو برس آپ کے پاس رہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5134,
			"arabicnumber": 5134,
			"text": "ہم سے معلی بن اسد نے بیان کیا، کہا ہم سے وہب نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے ان سے نکاح کیا تو ان کی عمر چھ سال تھی اور جب ان سے صحبت کی تو ان کی عمر نو سال تھی۔ ہشام بن عروہ نے کہا کہ مجھے خبر دی گئی ہے کہ وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ نو سال تک رہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5135,
			"arabicnumber": 5135,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم سے امام مالک نے خبر دی، انہیں ابوحازم مسلم بن دینار نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی اور کہا کہ میں اپنے آپ کو آپ کے لیے ہبہ کرتی ہوں۔ پھر وہ دیر تک کھڑی رہی۔ اتنے میں ایک مرد نے کہا کہ اگر نبی کریم صلی اللہ علیہ وسلم کو اس کی ضرورت نہ ہو تو اس کا نکاح مجھ سے فرما دیں۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس انہیں مہر میں دینے کے لیے کوئی چیز ہے؟ اس نے کہا کہ میرے پاس اس تہمد کے سوا اور کچھ نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم اپنا یہ تہمد اس کو دے دو گے تو تمہارے پاس پہننے کے لیے تہمد بھی نہیں رہے گا۔ کوئی اور چیز تلاش کر لو۔ اس مرد نے کہا کہ میرے پاس کچھ بھی نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کچھ تو تلاش کرو، ایک لوہے کی انگوٹھی ہی سہی! اسے وہ بھی نہیں ملی تو نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا۔ کیا تمہارے پاس کچھ قرآن مجید ہے؟ انہوں نے عرض کیا کہ جی ہاں! فلاں فلاں سورتیں ہیں، ان سورتوں کا انہوں نے نام لیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر ہم نے تیرا نکاح اس عورت سے ان سورتوں کے کے بدلے کیا جو تم کو یاد ہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5136,
			"arabicnumber": 5136,
			"text": "ہم سے معاذ بن فضالہ نے بیان کیا، کہا ہم سے ہشام دستوائی نے، ان سے یحییٰ بن ابی بشیر نے، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بیوہ عورت کا نکاح اس وقت تک نہ کیا جائے جب تک اس کی اجازت نہ لی جائے اور کنواری عورت کا نکاح اس وقت تک نہ کیا جائے جب تک اس کی اجازت نہ مل جائے۔ صحابہ نے کہا کہ یا رسول اللہ! کنواری عورت اذن کیونکر دے گی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کی صورت یہ ہے کہ وہ خاموش رہ جائے۔ یہ خاموشی اس کا اذن سمجھی جائے گی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5137,
			"arabicnumber": 5137,
			"text": "ہم سے عمرو بن ربیع بن طارق نے بیان کیا، کہا کہ مجھے لیث بن سعد نے خبر دی، انہیں ابن ابی ملیکہ نے، انہیں عائشہ رضی اللہ عنہا کے غلام ابوعمرو ذکوان نے اور ان سے عائشہ رضی اللہ عنہا نے کہ انہوں نے عرض کیا: یا رسول اللہ! کنواری لڑکی ( کہتے ہوئے ) شرماتی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کا خاموش ہو جانا ہی اس کی رضا مندی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5138,
			"arabicnumber": 5138,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے عبدالرحمٰن بن قاسم نے، ان سے ان کے والد نے، ان سے عبدالرحمٰن اور مجمع نے جو دونوں یزید بن حارثہ کے بیٹے ہیں، ان سے خنساء بنت خذام انصاریہ رضی اللہ عنہا نے کہ ان کے والد نے ان کا نکاح کر دیا تھا، وہ ثیبہ تھیں، انہیں یہ نکاح منظور نہیں تھا، اس لیے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں، نبی کریم صلی اللہ علیہ وسلم نے اس نکاح کو فسخ کر دیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5139,
			"arabicnumber": 5139,
			"text": "ہم سے اسحاق بن راہویہ نے بیان کیا، کہا ہم کو یزید بن ہارون نے خبر دی، کہا ہم کو یحییٰ بن سعید انصاری نے خبر دی، ان سے قاسم بن محمد نے بیان کیا، ان سے عبدالرحمٰن بن یزید اور مجمع بن یزید نے بیان کیا کہ خذام نامی ایک صحابی نے اپنی لڑکی کا نکاح کر دیا تھا۔ پھر پچھلی حدیث کی طرح بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5140,
			"arabicnumber": 5140,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے اور (دوسری سند) اور لیث نے بیان کیا کہ مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب زہری نے، کہا مجھ کو عروہ بن زبیر نے خبر دی کہ انہوں نے عائشہ رضی اللہ عنہا سے سوال کیا کہ اے ام المؤمنین! اس آیت میں کیا حکم بیان ہوا ہے؟ «وإن خفتم أن لا تقسطوا في اليتامى‏» ”اور اگر تمہیں خوف ہو کہ تم یتیموں کے بارے میں انصاف نہ کر سکو گے۔“ «ما ملكت أيمانكم‏» تک۔ عائشہ رضی اللہ عنہا نے کہا: میرے بھانجے! اس آیت میں اس یتیم لڑکی کا حکم یبان ہوا ہے جو اپنے ولی کی پرورش میں ہو اور ولی کو اس کے حسن اور اس کے مال کی وجہ سے اس کی طرف توجہ ہو اور وہ اس کا مہر کم کر کے اس سے نکاح کرنا چاہتا ہو تو ایسے لوگوں کو ایسی یتیم لڑکیوں سے نکاح سے ممانعت کی گئی ہے سوائے اس صورت کے کہ وہ ان کے مہر کے بارے میں انصاف کریں ( اور اگر انصاف نہیں کر سکتے تو انہیں ان کے سوا دوسری عورتوں سے نکاح کا حکم دیا گیا ہے۔ عائشہ رضی اللہ عنہا نے کہا کہ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بعد مسئلہ پوچھا تو اللہ تعالیٰ نے آیت «ويستفتونك في النساء‏» ”اور آپ سے عورتوں کے بارے میں پوچھتے ہیں“ سے «وترغبون‏» تک نازل کی۔ اللہ تعالیٰ نے اس آیت میں یہ حکم نازل کیا کہ یتیم لڑکیاں جب صاحب مال اور صاحب جمال ہوتی ہیں تب تو مہر میں کمی کر کے اس سے نکاح کرنا رشتہ لگانا پسند کرتے ہیں اور جب دولت مندی یا خوبصورتی نہیں رکھتی اس وقت اس کو چھوڑ کر دوسری عورتوں سے نکاح کر دیتے ہیں ( یہ کیا بات ) ان کو چاہئے کہ جیسے مال و دولت اور حسن و جمال نہ ہونے کی صورت میں اس کو چھوڑ دیتے ہیں ایسے ہی اس وقت بھی چھوڑ دیں جب وہ مالدار اور خوبصورت ہو البتہ اگر انصاف سے چلیں اور اس کا پورا مہر مقرر کریں تو خیر نکاح کر لیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5141,
			"arabicnumber": 5141,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ابوحازم نے، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئی اور اس نے اپنے آپ کو آپ صلی اللہ علیہ وسلم سے نکاح کے لیے پیش کیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اب عورت کی ضرورت نہیں ہے۔ اس پر ایک صحابی نے عرض کیا: یا رسول اللہ! ان کا نکاح مجھ سے کر دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس کیا ہے؟ انہوں نے کہا کہ میرے پاس تو کچھ بھی نہیں ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس عورت کو کچھ دو، خواہ لوہے کی ایک انگوٹھی ہی سہی۔ انہوں نے کہا کہ یا رسول اللہ! میرے پاس کچھ بھی نہیں ہے۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا تمہیں قرآن کتنا یاد ہے؟ عرض کیا فلاں فلاں سورتیں یاد ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر میں نے انہیں تمہارے نکاح میں دیا۔ اس قرآن کے بدلے جو تم کو یاد ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5142,
			"arabicnumber": 5142,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، کہا ہم سے جریج نے بیان کیا، کہا کہ میں نے نافع سے سنا، انہوں نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے کہ ہم کسی کے بھاؤ پر بھاؤ لگائیں اور کسی شخص کو اپنے کسی ( دینی ) بھائی کے پیغام نکاح پر پیغام بھیجیں یہاں تک کہ پیغام بھیجنے والا اپنا ارادہ بدل دے یا اسے پیغام نکاح بھیجنے کی اجازت دے دے تو جائز ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5144,
			"arabicnumber": 5144,
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5145,
			"arabicnumber": 5145,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زھری نے، کہا کہ مجھے سالم بن عبداللہ نے خبر دی، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، وہ بیان کرتے تھے کہ عمر رضی اللہ عنہ نے بیان کیا کہ میری بیٹی حفصہ رضی اللہ عنہا بیوہ ہوئیں تو میں ابوبکر صدیق رضی اللہ عنہ سے ملا اور ان سے کہا کہ اگر آپ چاہیں تو میں آپ کا نکاح عزیزہ حفصہ بنت عمر رضی اللہ عنہما سے کر دوں۔ پھر کچھ دنوں کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ان کے نکاح کا پیغام بھیجا اس کے بعد ابوبکر رضی اللہ عنہ مجھ سے ملے اور کہا آپ نے جو صورت میرے سامنے رکھی تھی اس کا جواب میں نے صرف اس وجہ سے نہیں دیا تھا کہ مجھے معلوم تھا رسول اللہ صلی اللہ علیہ وسلم نے ان کا ذکر کیا ہے۔ میں نہیں چاہتا کہ آپ کا راز کھولوں ہاں نبی کریم صلی اللہ علیہ وسلم انہیں چھوڑ دیتے تو میں ان کو قبول کر لیتا۔ شعیب کے ساتھ اس حدیث کو یونس بن یزید اور موسیٰ بن عقبہ اور محمد بن ابی عتیق نے بھی زہری سے روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5146,
			"arabicnumber": 5146,
			"text": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے زید بن اسلم نے کہا کہ میں نے ابن عمر رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ دو آدمی مدینہ کے مشرق کی طرف سے آئے، وہ مسلمان ہو گئے اور خطبہ دیا، نہایت فصیح و بلیغ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ بعض تقریر جادو کی اثر کرتی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5147,
			"arabicnumber": 5147,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے بشر بن مفضل نے بیان کیا، کہا ہم سے خالد بن ذکوان نے بیان کیا، کہ ربیع بنت معوذ ابن عفراء رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور جب میں دلہن بنا کر بٹھائی گئی نبی کریم صلی اللہ علیہ وسلم اندر تشریف لائے اور میرے بستر پر بیٹھے اسی طرح جیسے تم اس وقت میرے پاس بیٹھے ہوئے ہو۔ پھر ہمارے یہاں کی کچھ لڑکیاں دف بجانے لگیں اور میرے باپ اور چچا جو جنگ بدر میں شہید ہوئے تھے، ان کا مرثیہ پڑھنے لگیں۔ اتنے میں، ان میں سے ایک لڑکی نے پڑھا، اور ہم میں ایک نبی ہے جو ان باتوں کی خبر رکھتے ہے جو کچھ کل ہونے والی ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ چھوڑ دو۔ اس کے سوا جو کچھ تم پڑھ رہی تھیں وہ پڑھو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5148,
			"arabicnumber": 5148,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عبدالعزیز بن صہیب نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ عبدالرحمٰن بن عوف رضی اللہ عنہ نے ایک خاتون سے ایک گٹھلی کے وزن کے برابر ( سونے کے مہر پر ) نکاح کیا۔ پھر نبی کریم صلی اللہ علیہ وسلم شادی کی خوشی ان میں دیکھی تو ان سے پوچھا۔ انہوں نے عرض کیا کہ میں نے ایک عورت سے ایک گٹھلی کے برابر نکاح کیا ہے اور قتادہ رضی اللہ عنہ نے انس رضی اللہ عنہ سے یہ روایت اس طرح نقل کی ہے کہ عبدالرحمٰن بن عوف رضی اللہ عنہ نے ایک عورت سے۔ ایک گٹھلی کے وزن کے برابر سونے پر نکاح کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5149,
			"arabicnumber": 5149,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان نے، کہا میں نے ابوحازم سے سنا، وہ کہتے تھے کہ میں نے سہل بن سعد ساعدی سے سنا، انہوں نے بیان کیا کہ میں لوگوں کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا اس میں ایک خاتون کھڑی ہوئیں اور عرض کیا کہ یا رسول اللہ! میں اپنے آپ کو آپ کے لیے ہبہ کرتی ہوں آپ اب جو چاہیں کریں۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں کوئی جواب نہیں دیا۔ وہ پھر کھڑی ہوئی اور عرض کیا کہ یا رسول اللہ! میں نے اپنے آپ کو آپ کے لیے ہبہ کر دیا ہے آپ جو چاہیں کریں۔ نبی کریم صلی اللہ علیہ وسلم نے اس مرتبہ بھی کوئی جواب نہیں دیا۔ وہ تیسری مرتبہ کھڑی ہوئیں اور کہا کہ انہوں نے اپنے آپ کو آپ صلی اللہ علیہ وسلم کے لیے ہبہ کر دیا، آپ جو چاہیں کریں۔ اس کے بعد ایک صحابی کھڑے ہوئے اور عرض کیا: یا رسول اللہ! ان کا نکاح مجھ سے کر دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا کہ تمہارے پاس کچھ ہے؟ انہوں نے عرض کیا کہ نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور تلاش کرو ایک لوہے کی انگوٹھی بھی اگر مل جائے لے آؤ۔ وہ گئے اور تلاش کیا، پھر واپس آ کر عرض کیا کہ میں نے کچھ نہیں پایا، لوہے کی ایک انگوٹھی بھی نہیں ملی۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس کچھ قرآن ہے؟ انہوں نے عرض کیا کہ جی ہاں۔ میرے پاس فلاں فلاں سورتیں ہیں نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر جاؤ میں نے تمہارا نکاح ان سے اس قرآن پر کیا جو تم کو یاد ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5150,
			"arabicnumber": 5150,
			"text": "ہم سے یحییٰ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ان سے سفیان نے ان سے ابوحازم نے اور ان سے صحابی سہل بن سعد رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک آدمی سے فرمایا کہ نکاح کر، خواہ لوہے کی ایک انگوٹھی پر ہی ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5151,
			"arabicnumber": 5151,
			"text": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یزید بن ابی حبیب نے، ان سے ابوالخیر اور ان سے عقبہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تمام شرطوں میں وہ شرطیں سب سے زیادہ پوری کی جانے کے لائق ہیں جن کے ذریعہ تم نے شرمگاہوں کو حلال کیا ہے۔ یعنی نکاح کی شرطیں ضرور پوری کرنی ہوں گی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5152,
			"arabicnumber": 5152,
			"text": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، کہا ان سے زکریا نے جو ابوزائدہ کے صاحبزادے ہیں، ان سے سعد بن ابراہیم نے، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کسی عورت کے لیے جائز نہیں کہ اپنی کسی ( سوکن ) بہن کی طلاق کی شرط اس لیے لگائے تاکہ اس کے حصہ کا پیالہ بھی خود انڈیل لے کیونکہ اسے وہی ملے گا جو اس کے مقدر میں ہو گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5153,
			"arabicnumber": 5153,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، ان کو مالک نے خبر دی، انہیں حمید طویل نے اور انہیں انس بن مالک نے کہ عبدالرحمٰن بن عوف رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو ان کے اوپر زرد رنگ کا نشان تھا۔ نبی کریم صلی اللہ علیہ وسلم نے اس کے متعلق پوچھا تو انہوں نے بتایا کہ انہوں نے انصارکی ایک عورت سے نکاح کیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اسے مہر کتنا دیا ہے؟ انہوں نے کہا کہ ایک گٹھلی کے برابر سونا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر ولیمہ کر خواہ ایک بکری ہی کا ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5154,
			"arabicnumber": 5154,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے حمیدی نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہا کے ساتھ نکاح پر دعوت ولیمہ کی اور مسلمانوں کے لیے کھانے کا انتظام کیا۔ ( کھانے سے فراغت کے بعد ) نبی کریم صلی اللہ علیہ وسلم باہر تشریف لے گئے، جیسا کہ نکاح کے بعد آپ کا دستور تھا۔ پھر آپ امہات المؤمنین کے حجروں میں تشریف لے گئے۔ آپ نے ان کے لیے دعا کی اور انہوں نے آپ کے لیے دعا کی۔ پھر آپ واپس تشریف لائے تو دو صحابہ کو دیکھا ( کہ ابھی بیٹھے ہوئے تھے ) اس لیے آپ صلی اللہ علیہ وسلم پھر تشریف لے گئے۔ ( انس رضی اللہ عنہ نے بیان کیا کہ ) مجھے پوری طرح یاد نہیں کہ میں نے خود نبی کریم صلی اللہ علیہ وسلم کو خبر دی یا کسی اور نے خبر دی کہ وہ دونوں صحابی بھی چلے گئے ہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5155,
			"arabicnumber": 5155,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف پر زردی کا نشان دیکھا تو پوچھا کہ یہ کیا ہے؟ انہوں نے کہا کہ میں نے ایک عورت سے ایک گٹھلی کے وزن کے برابر سونے کے مہر پر نکاح کیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ تمہیں برکت دے دعوت ولیمہ کر خواہ ایک بکری ہی کی ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5156,
			"arabicnumber": 5156,
			"text": "ہم سے فروہ بن ابی المغراء نے بیان کیا، کہا ہم سے علی بن مسہر نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے جب مجھ سے شادی کی تو میری والدہ ( ام رومان بنت عامر ) میرے پاس آئیں اور مجھے نبی کریم صلی اللہ علیہ وسلم کے گھر کے اندر لے گئیں۔ گھر کے اندر قبیلہ انصار کی عورتیں موجود تھیں۔ انہوں نے ( مجھ کو اور میری ماں کو ) یوں دعا دی «بارك وبارك الله» ”اللہ کرے تم اچھی ہو تمہارا نصیبہ اچھا ہو۔“",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5157,
			"arabicnumber": 5157,
			"text": "ہم سے محمد بن علاء نے بیان کیا، کہا ہم سے عبداللہ بن المبارک نے بیان کیا، ان سے معمر بن راشد نے، ان سے ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ گزشتہ انبیاء میں سے ایک نبی ( یوشع علیہ السلام یا داؤد علیہ السلام ) نے غزوہ کیا اور ( غزوہ سے پہلے ) اپنی قوم سے کہا کہ میرے ساتھ کوئی ایسا شخص نہ چلے جس نے کسی نئی عورت سے شادی کی ہو اور اس کے ساتھ صحبت کرنے کا ارادہ رکھتا ہو اور ابھی صحبت نہ کی ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5158,
			"arabicnumber": 5158,
			"text": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے ہشام بن عروہ نے اور ان سے عروہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا سے نکاح کیا تو ان کی عمر چھ سال کی تھی اور جب ان کے ساتھ خلوت کی تو ان کی عمر نو سال کی تھی اور وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ نو سال تک رہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5159,
			"arabicnumber": 5159,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم سے اسماعیل بن جعفر نے خبر دی، انہیں حمید نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مدینہ اور خیبر کے درمیان ( راستہ میں ) تین دن تک قیام کیا اور وہاں ام المؤمنین صفیہ بنت حیی رضی اللہ عنہا کے ساتھ خلوت کی۔ میں نے مسلمانوں کو نبی کریم صلی اللہ علیہ وسلم کے ولیمہ پر بلایا لیکن اس دعوت میں روٹی اور گوشت نہیں تھا۔ آپ نے دستر خوان بچھانے کا حکم دیا اور اس پر کھجور، پنیر اور گھی رکھ دیا گیا اور یہی نبی کریم صلی اللہ علیہ وسلم کا ولیمہ تھا۔ مسلمانوں نے صفیہ رضی اللہ عنہا کے بارے میں ( کہا کہ ) امہات المؤمنین میں سے ہیں یا نبی کریم صلی اللہ علیہ وسلم نے انہیں لونڈی ہی رکھا ہے ( کیونکہ وہ بھی جنگ خیبر کے قیدیوں میں سے تھیں۔ اس پر بعض نے کہا کہ اگر آپ صلی اللہ علیہ وسلم ان کے لیے پردہ کرائیں پھر تو وہ امہات المؤمنین میں سے ہیں اور اگر آپ ان کے لیے پردہ نہ کرائیں تو پھر وہ لونڈی کی حیثیت سے ہیں۔ جب سفر ہوا تو نبی کریم صلی اللہ علیہ وسلم نے ان کے لیے اپنی سواری پر پیچھے جگہ بنائی اور لوگوں کے اور ان کے درمیان پردہ ڈلوایا۔)",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5160,
			"arabicnumber": 5160,
			"text": "مجھ سے فروہ بن ابی المغراء نے بیان کیا، کہا ہم سے علی بن مسہر نے بیان کیا، ان سے ہشام بن عروہ نے، انس سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے شادی کی تھی۔ میری والدہ میرے پاس آئیں اور تنہا مجھے ایک گھر میں داخل کر دیا۔ پھر مجھے کسی چیز نے خوف نہیں دلایا سوائے رسول اللہ صلی اللہ علیہ وسلم کے کہ آپ اچانک ہی میرے پاس چاشت کے وقت آ گئے۔ آپ نے مجھ سے ملاپ فرمایا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5161,
			"arabicnumber": 5161,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے محمد بن المنکدر نے بیان کیا، ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے ( جب انہوں نے شادی کی ) فرمایا تم نے جھالر دار چادریں بھی لی ہیں یا نہیں؟ انہوں نے عرض کیا: یا رسول اللہ! ہمارے پاس جھالر دار چادریں کہاں ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جلد ہی میسر ہو جائیں گی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5162,
			"arabicnumber": 5162,
			"text": "ہم سے فضیل بن یعقوب نے بیان کیا، کہا ہم سے محمد بن سابق نے بیان کیا، ان سے اسرائیل نے بیان کیا، ان سے ہشام بن عروہ نے ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ وہ ایک دلہن کو ایک انصاری مرد کے پاس لے گئیں تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عائشہ! تمہارے پاس لہو ( دف بجانے والا ) نہیں تھا، انصار کو دف پسند ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5163,
			"arabicnumber": 5163,
			"text": "اور ابراہیم بن طہمان نے ابوعثمان جعد بن دینار سے روایت کیا، انہوں نے انس بن مالک سے، ابوعثمان کہتے ہیں کہ انس رضی اللہ عنہ ہمارے سامنے سے بنی رفاعہ کی مسجد میں ( جو بصرہ میں ہے ) گزرے۔ میں نے ان سے سنا وہ کہہ رہے تھے کہ نبی کریم صلی اللہ علیہ وسلم کا قاعدہ تھا آپ جب ام سلیم رضی اللہ عنہا کے گھر کی طرف سے گزرتے تو ان کے پاس جاتے، ان کو سلام کرتے ( وہ آپ کی رضاعی خالہ ہوتی تھیں ) ۔ پھر انس رضی اللہ عنہ نے بیان کیا کہ ایک بار ایسا ہوا کہ نبی کریم صلی اللہ علیہ وسلم دولہا تھے۔ آپ نے زینب رضی اللہ عنہا سے نکاح کیا تھا تو ام سلیم ( میری ماں ) مجھ سے کہنے لگیں اس وقت ہم نبی کریم صلی اللہ علیہ وسلم کے پاس کچھ تحفہ بھیجیں تو اچھا ہے۔ میں نے کہا مناسب ہے۔ انہوں نے کھجور اور گھی اور پنیر ملا کر ایک ہانڈی میں حلوہ بنایا اور میرے ہاتھ میں دے کر نبی کریم صلی اللہ علیہ وسلم کے پاس بھجوایا، میں لے کر آپ کے پاس چلا، جب پہنچا تو آپ نے فرمایا رکھ دے اور جا کر فلاں فلاں لوگوں کو بلا لا آپ نے ان کا نام لیا اور جو بھی کوئی تجھ کو راستے میں ملے اس کو بلا لے۔ انس رضی اللہ عنہ نے کہا کہ میں آپ کے حکم کے موافق لوگوں کو دعوت دینے گیا۔ لوٹ کر جو آیا تو کیا دیکھتا ہوں کہ سارا گھر لوگوں سے بھرا ہوا ہے۔ میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم نے اپنے دونوں ہاتھ اس حلوے پر رکھے اور جو اللہ کو منظور تھا وہ زبان سے کہا ( برکت کی دعا فرمائی ) ۔ پھر دس دس آدمیوں کو کھانے کے لیے بلانا شروع کیا۔ آپ ان سے فرماتے جاتے تھے اللہ کا نام لو اور ہر ایک آدمی اپنے آگے سے کھائے۔ ( رکابی کے بیچ میں ہاتھ نہ ڈالے ) یہاں تک کہ سب لوگ کھا کر گھر کے باہر چل دئیے۔ تین آدمی گھر میں بیٹھے باتیں کرتے رہے اور مجھ کو ان کے نہ جانے سے رنج پیدا ہوا ( اس خیال سے کہ نبی کریم صلی اللہ علیہ وسلم کو تکلیف ہو گی ) آخر نبی کریم صلی اللہ علیہ وسلم اپنی بیویوں کے حجروں پر گئے میں بھی آپ کے پیچھے پیچھے گیا پھر راستے میں میں نے آپ سے کہا اب وہ تین آدمی بھی چلے گئے ہیں۔ اس وقت آپ لوٹے اور ( زینب رضی اللہ عنہا کے حجرے میں ) آئے۔ میں بھی حجرے ہی میں تھا لیکن آپ نے میرے اور اپنے بیچ میں پردہ ڈال لیا۔ آپ سورۃ الاحزاب کی یہ آیت پڑھ رہے تھے۔ ”مسلمانو! نبی کے گھروں میں نہ جایا کرو مگر جب کھانے کے لیے تم کو اندر آنے کی اجازت دی جائے اس وقت جاؤ وہ بھی ایسا ٹھیک وقت دیکھ کر کہ کھانے کے پکنے کا انتظار نہ کرنا پڑے البتہ جب بلائے جاؤ تو اندر آ جاؤ اور کھانے سے فارغ ہوتے ہی چل دو۔ باتوں میں لگ کر وہاں بیٹھے نہ رہا کرو، ایسا کرنے سے پیغمبر کو تکلیف ہوتی تھی، اس کو تم سے شرم آتی تھی ( کہ تم سے کہے کہ چلے جاؤ ) اللہ تعالیٰ حق بات میں نہیں شرماتا۔“ ابوعثمان ( جعدی بن دینار ) کہتے تھے کہ انس رضی اللہ عنہ کہا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5164,
			"arabicnumber": 5164,
			"text": "مجھ سے عبید بن اسمعیل نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ انہوں نے ( اپنی بہن ) اسماء رضی اللہ عنہا سے ایک ہار عاریۃ لے لیا تھا، راستے میں وہ گم ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ میں سے کچھ آدمیوں کو اسے تلاش کرنے کے لیے بھیجا۔ تلاش کرتے ہوئے نماز کا وقت ہو گیا ( اور پانی نہیں تھا ) اس لیے انہوں نے وضو کے بغیر نماز پڑھی۔ پھر جب وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں واپس ہوئے تو آپ کے سامنے یہ شکوہ کیا۔ اس پر تیمم کی آیت نازل ہوئی۔ اسید بن حضیر رضی اللہ عنہ نے کہا کہ اے عائشہ! اللہ تمہیں بہتر بدلہ دے۔ واللہ! جب بھی آپ پر کوئی مشکل آن پڑتی ہے تو اللہ تعالیٰ نے تم سے اسے دور کیا اور مزید برآں یہ کہ مسلمانوں کے لیے برکت اور بھلائی ہوئی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5165,
			"arabicnumber": 5165,
			"text": "ہم سے سعد بن حفص طلحی نے بیان کیا، کہا ہم سے شیبان بن عبدالرحمٰن نے، ان سے منصور بن معتمر نے، ان سے سالم بن ابی الجعد نے، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کوئی شخص اپنی بیوی کے پاس ہمبستری کے لیے جب آئے تو یہ دعا پڑھے «باسم الله،‏‏‏‏ ‏‏‏‏ اللهم جنبني الشيطان،‏‏‏‏ ‏‏‏‏ وجنب الشيطان ما رزقتنا» یعنی میں اللہ کے نام سے شروع کرتا ہوں اے اللہ! شیطان کو مجھ سے دور رکھ اور شیطان کو اس چیز سے بھی دور رکھ جو ( اولاد ) ہمیں تو عطا کرے۔ پھر اس عرصہ میں ان کے لیے کوئی اولاد نصیب ہو تو اسے شیطان کبھی ضرر نہ پہنچا سکے گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5166,
			"arabicnumber": 5166,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا کہ مجھ سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے بیان کیا اور انہیں انس بن مالک رضی اللہ عنہ نے خبر دی کہ جب رسول اللہ صلی اللہ علیہ وسلم مدینہ منورہ ہجرت کر کے آئے تو ان کی عمر دس برس کی تھی۔ میری ماں اور بہنیں نبی کریم صلی اللہ علیہ وسلم کی خدمت کے لیے مجھ کو تاکید کرتی رہتی تھیں۔ چنانچہ میں نے نبی کریم صلی اللہ علیہ وسلم کی دس برس تک خدمت کی اور جب آپ کی وفات ہوئی تو میں بیس برس کا تھا۔ پردہ کے متعلق میں سب سے زیادہ جاننے والوں میں سے ہوں کہ کب نازل ہوا۔ سب سے پہلے یہ حکم اس وقت نازل ہوا تھا جب نبی کریم صلی اللہ علیہ وسلم زینب بنت جحش رضی اللہ عنہما سے نکاح کے بعد انہیں اپنے گھر لائے تھے، آپ ان کے دولہا بنے تھے۔ پھر آپ نے لوگوں کو ( دعوت ولیمہ پر ) بلایا۔ لوگوں نے کھانا کھایا اور چلے گئے۔ لیکن کچھ لوگ ان میں سے نبی کریم صلی اللہ علیہ وسلم کے گھر میں ( کھانے کے بعد بھی ) دیر تک وہیں بیٹھے ( باتیں کرتے رہے ) آخر نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے اور باہر تشریف لے گئے۔ میں بھی نبی کریم صلی اللہ علیہ وسلم کے ساتھ باہر گیا تاکہ یہ لوگ بھی چلے جائیں۔ نبی کریم صلی اللہ علیہ وسلم چلتے رہے اور میں بھی آپ کے ساتھ رہا۔ جب آپ عائشہ رضی اللہ عنہا کے حجرہ کے پاس دروازے پر آئے تو آپ کو معلوم ہوا کہ وہ لوگ چلے گئے ہیں۔ اس لیے آپ واپس تشریف لائے اور میں بھی آپ کے ساتھ آیا۔ جب آپ زینب رضی اللہ عنہا کے گھر میں داخل ہوئے تو دیکھا کہ وہ لوگ ابھی بیٹھے ہوئے ہیں اور ابھی تک نہیں گئے ہیں۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم وہاں سے پھر واپس تشریف لائے اور میں بھی آپ کے ساتھ واپس آ گیا جب آپ عائشہ رضی اللہ عنہا کے حجرہ کے دروازے پر پہنچے اور آپ کو معلوم ہوا کہ وہ لوگ چلے گئے ہیں تو آپ پھر واپس تشریف لائے اور میں بھی آپ کے ساتھ واپس آیا۔ اب وہ لوگ واقعی جا چکے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے اس کے بعد اپنے اور میرے بیچ میں پردہ ڈال دیا اور پردہ کی آیت نازل ہوئی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5167,
			"arabicnumber": 5167,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا کہ مجھ سے حمید طویل نے بیان کیا اور انہوں نے انس رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف رضی اللہ عنہ سے پوچھا، انہوں نے قبیلہ انصار کی ایک عورت سے شادی کی تھی کہ مہر کتنا دیا ہے؟ انہوں نے کہا کہ ایک گٹھلی کے وزن کے برابر سونا۔ اور حمید سے روایت ہے کہ میں نے انس رضی اللہ عنہ سے سنا اور انہوں نے بیان کیا کہ جب ( نبی کریم صلی اللہ علیہ وسلم اور مہاجرین صحابہ ) مدینہ ہجرت کر کے آئے تو مہاجرین نے انصار کے یہاں قیام کیا عبدالرحمٰن بن عوف رضی اللہ عنہ نے سعد بن ربیع رضی اللہ عنہ کے یہاں قیام کیا۔ سعد رضی اللہ عنہ نے ان سے کہا کہ میں آپ کو اپنا مال تقسیم کر دوں گا اور اپنی دو بیویوں میں سے ایک کو آپ کے لیے چھوڑ دوں گا۔ عبدالرحمٰن نے کہا کہ اللہ آپ کے اہل و عیال اور مال میں برکت دے پھر وہ بازار نکل گئے اور وہاں تجارت شروع کی اور پنیر اور گھی نفع میں کمایا۔ اس کے بعد شادی کی تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ دعوت ولیمہ کر خواہ ایک بکری ہی کی ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5168,
			"arabicnumber": 5168,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ثابت بنانی نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے زینب رضی اللہ عنہا جیسا ولیمہ اپنی بیویوں میں سے کسی کا نہیں کیا، ان کا ولیمہ آپ نے ایک بکری کا کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5169,
			"arabicnumber": 5169,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، ان سے عبدالوارث نے بیان کیا، ان سے شعیب نے اور ان سے انس رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے صفیہ رضی اللہ عنہا کو آزاد کیا اور پھر ان سے نکاح کیا اور ان کی آزادی کو ان کا مہر قرار دیا اور ان کا ولیمہ ملیدہ سے کیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5170,
			"arabicnumber": 5170,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، ان سے بیان بن بشر نے بیان کیا، انہوں نے کہا کہ میں نے انس رضی اللہ عنہ سے سنا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم ایک خاتون ( زینب بنت جحش رضی اللہ عنہا ) کو نکاح کر کے لائے تو مجھے بھیجا اور میں نے لوگوں کو ولیمہ کھانے کے لیے بلایا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5171,
			"arabicnumber": 5171,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے حماد بن زید نے، ان سے ثابت بنانی نے، کہ انس رضی اللہ عنہ کے سامنے زینب بنت جحش رضی اللہ عنہا کے نکاح کا ذکر کیا گیا تو انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ان کے جیسا اپنی بیویوں میں سے کسی کے لیے ولیمہ کرتے نہیں دیکھا۔ نبی کریم صلی اللہ علیہ وسلم نے ان کا ولیمہ ایک بکری سے کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5172,
			"arabicnumber": 5172,
			"text": "ہم سے محمد بن یوسف نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے منصور بن صفیہ نے، ان سے ان کی والدہ صفیہ بنت شیبہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے اپنی ایک بیوی کا ولیمہ دو مد ( تقریباً پونے دو سیر ) جَو سے کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5173,
			"arabicnumber": 5173,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم سے مالک نے خبر دی، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کسی کو دعوت ولیمہ پر بلایا جائے تو اسے آنا چاہئے۔ معلوم ہوا کہ دعوت ولیمہ کا قبول کرنا ضروری ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5174,
			"arabicnumber": 5174,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن کثیر نے یبان کیا، ان سے سفیان ثوری نے، کہا کہ مجھ سے منصور نے بیان کیا، ان سے ابووائل نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ قیدی کو چھڑاؤ، دعوت کرنے والے کی دعوت قبول کرو اور بیمار کی عیادت کرو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5175,
			"arabicnumber": 5175,
			"text": "ہم سے حسن بن ربیع نے بیان کیا، کہا ہم سے ابوالاحوص (سلام بن سلیم) نے بیان کیا، ان سے اشعث بن ابی الشعثاء نے، ان سے معاویہ بن سوید نے کہ براء بن عازب رضی اللہ عنہ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے ہمیں سات کاموں کا حکم دیا اور سات کاموں سے منع فرمایا۔ ہمیں نبی کریم صلی اللہ علیہ وسلم نے بیمار کی عیادت، جنازہ کے پیچھے چلنے، چھینکنے والے کے جواب دینے ( یرحمک اللہ یعنی اللہ تم پر رحم کرے کہنا ) قسم کو پورا کرنے، مظلوم کی مدد کرنے، سب کو سلام کرنے اور دعوت کرنے والے کی دعوت قبول کرنے کا حکم دیا تھا اور ہمیں نبی کریم صلی اللہ علیہ وسلم نے سونے کی انگوٹھی پہننے، چاندی کے برتن استعمال کرنے، ریشمی گدے، قسیہ ( ریشمی کپڑا ) استبرق ( موٹے ریشم کا کپڑا ) اور دیباج ( ایک ریشمی کپڑا ) کے استعمال سے منع فرمایا تھا۔ ابوعوانہ اور شیبانی نے اشعث کی روایت سے لفظ «إفشاء السلام‏.‏» میں ابوالاحوص کی متابعت کی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5176,
			"arabicnumber": 5176,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ ابواسید ساعدی رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کو اپنی شادی پر دعوت دی، ان کی دلہن ام اسید سلامہ بنت وہب ضروری جو کام کاج کر رہی تھیں اور وہی دلہن بنی تھیں۔ سہل رضی اللہ عنہ نے کہا تمہیں معلوم ہے انہوں نے نبی کریم صلی اللہ علیہ وسلم کو اس موقع پر کیا پلایا تھا؟ رات کے وقت انہوں نے کچھ کھجوریں پانی میں بھگو دی تھیں ( صبح کو ) جب نبی کریم صلی اللہ علیہ وسلم کھانے سے فارغ ہوئے تو آپ کو وہی پلایا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5177,
			"arabicnumber": 5177,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ولیمہ کا وہ کھانا بدترین کھانا ہے جس میں صرف مالداروں کو اس کی طرف دعوت دی جائے اور محتاجوں کو نہ کھلایا جائے اور جس نے ولیمہ کی دعوت قبول کرنے سے انکار کیا اس نے اللہ اور اس کے رسول کی نافرمانی کی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5178,
			"arabicnumber": 5178,
			"text": "ہم سے عبدان نے بیان کیا، ان سے ابوحمزہ نے، ان سے اعمش نے، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر مجھے بکری کے کھر کی دعوت دی جائے تو میں اسے بھی قبول کروں گا اور اگر مجھے وہ کھر بھی ہدیہ میں دیئے جائیں تو میں اسے قبول کروں گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5179,
			"arabicnumber": 5179,
			"text": "ہم سے علی بن عبداللہ بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے حجاج بن محمد اعور نے بیان کیا، انہوں نے کہا کہ ابن جریج نے کہا کہ مجھ کو موسیٰ بن عقبہ نے خبر دی، انہیں نافع نے، انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اس ولیمہ کی جب تمہیں دعوت دی جائے تو قبول کرو۔ بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما اگر روزے سے ہوتے جب بھی ولیمہ کی دعوت یا کسی دوسری دعوت میں شرکت کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5180,
			"arabicnumber": 5180,
			"text": "ہم سے عبدالرحمٰن بن المبارک نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے عورتوں اور بچوں کو کسی شادی سے آتے ہوئے دیکھا تو آپ صلی اللہ علیہ وسلم خوشی کے مارے جلدی سے کھڑے ہو گئے اور فرمایا: یا اللہ! ( تو گواہ رہ ) تم لوگ سب لوگوں سے زیادہ مجھ کو محبوب ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5181,
			"arabicnumber": 5181,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے نافع نے، ان سے قاسم بن محمد نے اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے خبر دی کہ انہوں نے ایک چھوٹا سا گدا خریدا جس میں تصویریں بنی ہوئی تھیں۔ جب نبی کریم صلی اللہ علیہ وسلم نے اسے دیکھا تو دروازے پر کھڑے ہو گئے اور اندر نہیں آئے۔ میں نے نبی کریم صلی اللہ علیہ وسلم کے چہرے پر خفگی کے آثار دیکھ لیے اور عرض کیا: یا رسول اللہ! میں اللہ اور اس کے رسول سے توبہ کرتی ہوں، میں نے کیا غلطی کی ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ گدا یہاں کیسے آیا؟ بیان کیا کہ میں نے عرض کیا میں نے ہی اسے خریدا ہے تاکہ آپ اس پر بیٹھیں اور اس پر ٹیک لگائیں نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ان تصویروں کے ( بنانے والوں کو ) قیامت کے دن عذاب دیا جائے گا اور ان سے کہا جائے گا کہ جو تم نے تصویر سازی کی ہے اسے زندہ بھی کرو؟ اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جن گھروں میں تصویریں ہوتی ہیں ان میں ( رحمت کے ) فرشتے نہیں آتے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5182,
			"arabicnumber": 5182,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم سے ابوغسان محمد بن مطرف نے بیان کیا، کہا کہ مجھ سے ابوحازم (سلمہ بن دینار) نے بیان کیا، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ جب ابواسید ساعدی رضی اللہ عنہ نے شادی کی تو انہوں نے نبی کریم صلی اللہ علیہ وسلم اور آپ کے صحابہ کو دعوت دی، اس موقعہ پر کھانا ان کی دلہن ام اسید ہی نے تیار کیا تھا اور انہوں نے ہی مردوں کے سامنے کھانا رکھا۔ انہوں نے پتھر کے ایک بڑے پیالے میں رات کے وقت کھجوریں بھگو دی تھی اور جب نبی کریم صلی اللہ علیہ وسلم کھانے سے فارغ ہوئے تو انہوں نے ہی اس کا شربت بنایا اور نبی کریم صلی اللہ علیہ وسلم کے سامنے ( تحفہ کے طور پر ) پینے کے لیے پیش کیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5183,
			"arabicnumber": 5183,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے یعقوب بن عبدالرحمٰن القاری نے بیان کیا، ان سے ابوالحازم نے، کہا کہ میں نے سہل بن سعد رضی اللہ عنہ سے سنا کہ ابواسید ساعدی نے اپنی شادی کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کو دعوت دی۔ اس دن ان کی بیوی ہی سب کی خدمت کر رہی تھیں، حالانکہ وہ دلہن تھیں بیوی نے کہا یا سہل نے ( راوی کو شک تھا ) کہ تمہیں معلوم ہے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے لیے کیا تیار کیا تھا؟ میں نے آپ کے لیے ایک بڑے پیالے میں رات کے وقت سے کھجور کا شربت تیار کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5184,
			"arabicnumber": 5184,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہ ہم سے امام مالک نے بیان کیا، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ عورت مثل پسلی کے ہے، اگر تم اسے سیدھا کرنا چاہو گے تو توڑ دو گے اور اگر اس سے فائدہ حاصل کرنا چاہو گے تو اس کی ٹیڑھ کے ساتھ ہی فائدہ حاصل کرو گے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5186,
			"arabicnumber": 5186,
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5187,
			"arabicnumber": 5187,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے وقت میں ہم اپنی بیویوں کے ساتھ گفتگو اور بہت زیادہ بےتکلفی سے اس ڈر کی وجہ سے پرہیز کرتے تھے کہ کہیں کوئی بےاعتدالی ہو جائے اور ہماری برائی میں کوئی حکم نازل نہ ہو جائے۔ پھر جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہو گئی تو ہم نے ان سے خوب کھل کے گفتگو کی اور خوب بےتکلفی کرنے لگے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5188,
			"arabicnumber": 5188,
			"text": "ہم سے ابوالنعمان نے بیان کیا، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا، ان سے ایوب نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے ہر ایک حاکم ہے اور ہر ایک سے ( اس کی رعیت کے بارے میں ) سوال ہو گا۔ پس امام حاکم ہے اس سے سوال ہو گا۔ مرد اپنی بیوی بچوں کا حاکم ہے اور اس سے سوال ہو گا۔ عورت اپنے شوہر کے مال کا حاکم ہے اور اس سے سوال ہو گا۔ غلام اپنے سردار کے مال کا حاکم ہے اور اس سے سوال ہو گا ہاں پس تم میں سے ہر ایک حاکم ہے اور ہر ایک سے سوال ہو گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5189,
			"arabicnumber": 5189,
			"text": "ہم سے سلیمان بن عبدالرحمٰن اور علی بن حجر نے بیان کیا، ان دونوں نے کہا کہ ہم کو عیسیٰ بن یونس نے خبر دی، اس نے کہا کہ ہم سے ہشام بن عروہ نے بیان کیا، انہوں نے اپنے بھائی عبداللہ بن عروہ سے، انہوں نے اپنے والد عروہ بن زبیر سے، انہوں نے عائشہ رضی اللہ عنہا سے انہوں نے کہا کہ گیارہ عورتوں کا ایک اجتماع ہوا جس میں انہوں نے آپس میں یہ طے کیا کہ مجلس میں وہ اپنے اپنے خاوند کا صحیح صحیح حال بیان کریں کوئی بات نہ چھپاویں۔ چنانچہ پہلی عورت ( نام نامعلوم ) بولی میرے خاوند کی مثال ایسی ہے جیسے دبلے اونٹ کا گوشت جو پہاڑ کی چوٹی پر رکھا ہوا ہو نہ تو وہاں تک جانے کا راستہ صاف ہے کہ آسانی سے چڑھ کر اس کو کوئی لے آوے اور نہ وہ گوشت ہی ایسا موٹا تازہ ہے جسے لانے کے لیے اس پہاڑ پر چڑھنے کی تکلیف گوارا کرے۔ دوسری عورت ( عمرہ بنت عمرو تمیمی نامی ) کہنے لگی میں اپنے خاوند کا حال بیان کروں تو کہاں تک بیان کروں ( اس میں اتنے عیب ہیں ) میں ڈرتی ہوں کہ سب بیان نہ کر سکوں گی اس پر بھی اگر بیان کروں تو اس کے کھلے اور چھپے سارے عیب بیان کر سکتی ہوں۔ تیسری عورت ( حیی بنت کعب یمانی ) کہنے لگی، میرا خاوند کیا ہے ایک تاڑ کا تاڑ ( لمبا تڑنگا ) ہے اگر اس کے عیب بیان کروں تو طلاق تیار ہے اگر خاموش رہوں تو ادھر لٹکی رہوں۔ چوتھی عورت ( مہدو بنت ابی ہرومہ ) کہنے لگی کہ میرا خاوند ملک تہامہ کی رات کی طرح معتدل نہ زیادہ گرم نہ بہت ٹھنڈا نہ اس سے مجھ کو خوف ہے نہ اکتاہٹ ہے۔ پانچوں عورت ( کبشہ نامی ) کہنے لگی کہ میرا خاوند ایسا ہے کہ گھر میں آتا ہے تو وہ ایک چیتا ہے اور جب باہر نکلتا ہے تو شیر ( بہادر ) کی طرح ہے۔ جو چیز گھر میں چھوڑ کر جاتا ہے اس کے بارے میں پوچھتا ہی نہیں ( کہ وہ کہاں گئی؟ ) اتنا بےپرواہ ہے جو آج کمایا اسے کل کے لیے اٹھا کر رکھتا ہی نہیں اتنا سخی ہے۔ چھٹی عورت ( ہند نامی ) کہنے لگی کہ میرا خاوند جب کھانے پر آتا ہے تو سب کچھ چٹ کر جاتا ہے اور جب پینے پر آتا ہے تو ایک بوند بھی باقی نہیں چھوڑتا اور جب لیٹتا ہے تو تنہا ہی اپنے اوپر کپڑا لپیٹ لیتا ہے اور الگ پڑ کر سو جاتا ہے میرے کپڑے میں کبھی ہاتھ بھی نہیں ڈالتا کہ کبھی میرا دکھ درد کچھ تو معلوم کرے۔ ساتویں عورت ( حیی بنت علقمہ ) میرا خاوند تو جاہل یا مست ہے۔ صحبت کے وقت اپنا سینہ میرے سینے سے اوندھا پڑ جاتا ہے۔ دنیا میں جتنے عیب لوگوں میں ایک ایک کر کے جمع ہیں وہ سب اس کی ذات میں جمع ہیں ( کم بخت سے بات کروں تو ) سر پھوڑ ڈالے یا ہاتھ توڑ ڈالے یا دونوں کام کر ڈالے۔ آٹھویں عورت ( یاسر بنت اوس ) کہنے لگی میرا خاوند چھونے میں خرگوش کی طرح نرم ہے اور خوشبو میں سونگھو تو زعفران جیسا خوشبودار ہے۔ نویں عورت ( نام نامعلوم ) کہنے لگی کہ میرے خاوند کا گھر بہت اونچا اور بلند ہے وہ قدآور بہادر ہے، اس کے یہاں کھانا اس قدر پکتا ہے کہ راکھ کے ڈھیر کے ڈھیر جمع ہیں۔ ( غریبوں کو خوب کھلاتا ہے ) لوگ جہاں صلاح و مشورہ کے لیے بیٹھتے ہیں ( یعنی پنچائت گھر ) وہاں سے اس کا گھر بہت نزدیک ہے۔ دسویں عورت ( کبشہ بنت رافع ) کہنے لگی میرے خاوند کا کیا پوچھنا جائیداد والا ہے، جائیداد بھی کیسی بڑی جائیداد ویسی کسی کے پاس نہیں ہو سکتی بہت سارے اونٹ جو جابجا اس کے گھر کے پاس جٹے رہتے ہیں اور جنگل میں چرنے کم جاتے ہیں۔ جہاں ان اونٹوں نے باجے کی آواز سنی بس ان کو اپنے ذبح ہونے کا یقین ہو گیا۔ گیارھویں عورت ( ام زرع بنت اکیمل بنت ساعدہ ) کہنے لگی میرا خاوند ابوزرع ہے اس کا کیا کہنا اس نے میرے کانوں کو زیوروں سے بوجھل کر دیا ہے اور میرے دونوں بازو چربی سے پھلا دئیے ہیں مجھے خوب کھلا کر موٹا کر دیا ہے کہ میں بھی اپنے تئیں خوب موٹی سمجھنے لگی ہوں۔ شادی سے پہلے میں تھوڑی سے بھیڑ بکریوں میں تنگی سے گزر بسر کرتی تھی۔ ابوزرعہ نے مجھ کو گھوڑوں، اونٹوں، کھیت کھلیان سب کا مالک بنا دیا ہے اتنی بہت جائیداد ملنے پر بھی اس کا مزاج اتنا عمدہ ہے کہ بات کہوں تو برا نہیں مانتا مجھ کو کبھی برا نہیں کہتا۔ سوئی پڑی رہوں تو صبح تک مجھے کوئی نہیں جگاتا۔ پانی پیوں تو خوب سیراب ہو کر پی لوں رہی ابوزرعہ کی ماں ( میری ساس ) تو میں اس کی کیا خوبیاں بیان کروں۔ اس کا توشہ کھانا مال و اسباب سے بھرا ہوا، اس کا گھر بہت ہی کشادہ۔ ابوزرعہ کا بیٹا وہ بھی کیسا اچھا خوبصورت ( نازک بدن دبلا پتلا ) ہری چھالی یا ننگی تلوار کے برابر اس کے سونے کی جگہ ایسا کم خوراک کہ بکری کے چار ماہ کے بچے کا دست کا گوشت اس کا پیٹ بھر دے۔ ابوزرعہ کی بیٹی وہ بھی سبحان اللہ کیا کہنا اپنے باپ کی پیاری، اپنی ماں کی پیاری ( تابع فرمان اطاعت گزار ) کپڑا بھر پور پہننے والی ( موٹی تازی ) سوکن کی جلن۔ ابوزرعہ کی لونڈی اس کی بھی کیا پوچھتے ہو کبھی کوئی بات ہماری مشہور نہیں کرتی ( گھر کا بھید ہمیشہ پوشیدہ رکھتی ہے ) کھانے تک نہیں چراتی گھر میں کوڑا کچڑا نہیں چھوڑتی مگر ایک دن ایسا ہوا کہ لوگ مکھن نکالنے کو دودھ متھ رہے تھے۔ ( صبح ہی صبح ) ابوزرعہ باہر گیا اچانک اس نے ایک عورت دیکھی جس کے دو بچے چیتوں کی طرح اس کی کمر کے تلے دو اناروں سے کھیل رہے تھے ( مراد اس کی دونوں چھاتیاں ہیں جو انار کی طرح تھیں ) ۔ ابوزرعہ نے مجھ کو طلاق دے کر اس عورت سے نکاح کر لیا۔ اس کے بعد میں نے ایک اور شریف سردار سے نکاح کر لیا جو گھوڑے کا اچھا سوار، عمدہ نیزہ باز ہے، اس نے بھی مجھ کو بہت سے جانور دے دئیے ہیں اور ہر قسم کے اسباب میں سے ایک ایک جوڑا دیا ہوا ہے اور مجھ سے کہا کرتا ہے کہ ام زرع! خوب کھا پی، اپنے عزیز و اقرباء کو بھی خوب کھلا پلا تیرے لیے عام اجازت ہے مگر یہ سب کچھ بھی جو میں نے تجھ کو دیا ہوا ہے اگر اکٹھا کروں تو تیرے پہلے خاوند ابوزرعہ نے جو تجھ کو دیا تھا، اس میں کا ایک چھوٹا برتن بھی نہ بھرے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5190,
			"arabicnumber": 5190,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ کچھ فوجی کھیل کا نیزہ بازی سے مظاہرہ کر رہے تھے، تو رسول اللہ صلی اللہ علیہ وسلم نے ( اپنے جسم مبارک سے ) میرے لیے پردہ کیا اور میں وہ کھیل دیکھتی رہی۔ میں نے اسے دیر تک دیکھا اور خود ہی اکتا کر لوٹ آئی۔ اب تم خود سمجھ لو کہ ایک کم عمر لڑکی کھیل کو کتنی دیر تک دیکھ سکتی ہے اور اس میں دلچسپی لے سکتی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5191,
			"arabicnumber": 5191,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، کہا کہ مجھے عبیداللہ بن عبداللہ بن ابی ثور نے خبر دی اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ بہت دنوں تک میرے دل میں خواہش رہی کہ میں عمر بن خطاب رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کی ان دو بیویوں کے متعلق پوچھوں جن کے بارے میں اللہ نے یہ آیت نازل کی تھی۔ «إن تتوبا إلى الله فقد صغت قلوبكما‏» الخ۔ ایک مرتبہ انہوں نے حج کیا اور ان کے ساتھ میں نے بھی حج کیا۔ ایک جگہ جب وہ راستہ سے ہٹ کر ( قضائے حاجت کے لیے ) گئے تو میں بھی ایک برتن میں پانی لے کر ان کے ساتھ راستہ سے ہٹ گیا۔ پھر انہوں نے قضائے حاجت کی اور واپس آئے تو میں نے ان کے ہاتھوں پر پانی ڈالا۔ پھر انہوں نے وضو کیا تو میں نے اس وقت ان سے پوچھا کہ یا امیرالمؤمنین! نبی کریم صلی اللہ علیہ وسلم کی بیویوں میں وہ کون ہیں جن کے متعلق اللہ نے یہ ارشاد فرمایا کہ «إن تتوبا إلى الله فقد صغت قلوبكما‏» عمر بن خطاب رضی اللہ عنہ نے اس پر کہا اے ابن عباس! تم پر حیرت ہے۔ وہ عائشہ رضی اللہ عنہا اور حفصہ رضی اللہ عنہا ہیں پھر عمر رضی اللہ عنہ نے تفصیل کے ساتھ حدیث بیان کرنی شروع کی۔ انہوں نے کہا کہ میں اور میرے ایک انصاری پڑوسی جو بنو امیہ بن زید سے تھے اور عوالی مدینہ میں رہتے تھے۔ ہم نے ( عوالی سے ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کے لیے باری مقرر کر رکھی تھی۔ ایک دن وہ حاضری دیتے اور ایک دن میں حاضری دیتا، جب میں حاضر ہوتا تو اس دن کی تمام خبریں جو وحی وغیرہ سے متعلق ہوتیں لاتا ( اور اپنے پڑوسی سے بیان کرتا ) اور جس دن وہ حاضر ہوتے تو وہ بھی ایسے کرتے۔ ہم قریشی لوگ اپنی عورتوں پر غالب تھے لیکن جب ہم مدینہ تشریف لائے تو یہ لوگ ایسے تھے کہ عورتوں سے مغلوب تھے، ہماری عورتوں نے بھی انصار کی عورتوں کا طریقہ سیکھنا شروع کر دیا۔ ایک دن میں نے اپنی بیوی کو ڈانٹا تو اس نے بھی میرا ترکی بہ ترکی جواب دیا۔ میں نے اس کے اس طرح جواب دینے پر ناگواری کا اظہار کیا تو اس نے کہا کہ میرا جواب دینا تمہیں برا کیوں لگتا ہے، اللہ کی قسم! نبی کریم صلی اللہ علیہ وسلم کی ازواج بھی ان کو جوابات دے دیتی ہیں اور بعض تو نبی کریم صلی اللہ علیہ وسلم سے ایک دن رات تک الگ رہتی ہیں۔ میں اس بات پر کانپ اٹھا اور کہا کہ ان میں سے جس نے بھی یہ معاملہ کیا یقیناً وہ نامراد ہو گئی۔ پھر میں نے اپنے کپڑے پہنے اور ( مدینہ کے لیے ) روانہ ہوا پھر میں حفصہ کے گھر گیا اور میں نے اس سے کہا: اے حفصہ! کیا تم میں سے کوئی بھی نبی کریم صلی اللہ علیہ وسلم سے ایک ایک دن رات تک غصہ رہتی ہے؟ انہوں نے کہا کہ جی ہاں کبھی ( ایسا ہو جاتا ہے ) میں نے اس پر کہا کہ پھر تم نے اپنے آپ کو خسارہ میں ڈال لیا اور نامراد ہوئی۔ کیا تمہیں اس کا کوئی ڈر نہیں کہ نبی کریم صلی اللہ علیہ وسلم کے غصہ کی وجہ سے اللہ تم پر غصہ ہو جائے اور پھر تم تنہا ہی ہو جاؤ گی۔ خبردار! نبی کریم صلی اللہ علیہ وسلم سے مطالبات نہ کیا کرو نہ کسی معاملہ میں نبی کریم صلی اللہ علیہ وسلم کو جواب دیا کرو اور نہ نبی کریم صلی اللہ علیہ وسلم کو چھوڑا کرو۔ اگر تمہیں کوئی ضرورت ہو تو مجھ سے مانگ لیا کرو۔ تمہاری سوکن جو تم سے زیادہ خوبصورت ہے اور نبی کریم صلی اللہ علیہ وسلم کو تم سے زیادہ پیاری ہے، ان کی وجہ سے تم کسی غلط فہمی میں نہ مبتلا ہو جانا۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا۔ عمر رضی اللہ عنہ نے بیان کیا کہ ہمیں معلوم ہوا تھا کہ ملک غسان ہم پر حملہ کے لیے فوجی تیاریاں کر رہا ہے۔ میرے انصاری ساتھی اپنی باری پر مدینہ منورہ گئے ہوئے تھے۔ وہ رات گئے واپس آئے اور میرے دروازے پر بڑی زور زور سے دستک دی اور کہا کہ کیا عمر رضی اللہ عنہ گھر میں ہیں۔ میں گھبرا کر باہر نکلا تو انہوں نے کہا کہ آج تو بڑا حادثہ ہو گیا۔ میں نے کہا کیا بات ہوئی، کیا غسانی چڑھ آئے ہیں؟ انہوں نے کہا کہ نہیں، حادثہ اس سے بھی بڑا اور اس سے بھی زیادہ خوفناک ہے۔ نبی کریم صلی اللہ علیہ وسلم نے ازواج مطہرات کو طلاق دے دی ہے۔ میں نے کہا کہ حفصہ تو خاسر و نامراد ہوئی۔ مجھے تو اس کا خطرہ لگا ہی رہتا تھا کہ اس طرح کا کوئی حادثہ جلد ہی ہو گا پھر میں نے اپنے تمام کپڑے پہنے ( اور مدینہ کے لیے روانہ ہو گیا ) میں نے فجر کی نماز نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھی ( نماز کے بعد ) نبی کریم صلی اللہ علیہ وسلم اپنے ایک بالا خانہ میں چلے گئے اور وہاں تنہائی اختیار کر لی۔ میں حفصہ کے پاس گیا تو وہ رو رہی تھی۔ میں نے کہا اب روتی کیا ہو۔ میں نے تمہیں پہلے ہی متنبہ کر دیا تھا۔ کیا نبی کریم صلی اللہ علیہ وسلم نے تمہیں طلاق دے دی ہے؟ انہوں نے کہا کہ مجھے معلوم نہیں۔ نبی کریم صلی اللہ علیہ وسلم اس وقت بالا خانہ میں تنہا تشریف رکھتے ہیں۔ میں وہاں سے نکلا اور منبر کے پاس آیا۔ اس کے گرد کچھ صحابہ کرام موجود تھے اور ان میں سے بعض رو رہے تھے۔ تھوڑی دیر تک میں ان کے ساتھ بیٹھا رہا۔ اس کے بعد میرا غم مجھ پر غالب آ گیا اور میں اس بالا خانہ کے پاس آیا۔ جہاں نبی کریم صلی اللہ علیہ وسلم تشریف رکھتے تھے۔ میں نے نبی کریم صلی اللہ علیہ وسلم کے ایک حبشی غلام سے کہا کہ عمر رضی اللہ عنہ کے لیے اندر آنے کی اجازت لے لو۔ غلام اندر گیا اور نبی کریم صلی اللہ علیہ وسلم سے گفتگو کر کے واپس آ گیا۔ اس نے مجھ سے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے عرض کی اور نبی کریم صلی اللہ علیہ وسلم سے آپ کا ذکر کیا لیکن آپ خاموش رہے۔ چنانچہ میں واپس چلا آیا اور پھر ان لوگوں کے ساتھ بیٹھ گیا جو منبر کے پاس موجود تھے۔ میرا غم مجھ پر غالب آیا اور دوبارہ آ کر میں نے غلام سے کہا کہ عمر کے لیے اجازت لے لو۔ اس غلام نے واپس آ کر پھر کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے سامنے آپ کا ذکر کیا تو نبی کریم صلی اللہ علیہ وسلم خاموش رہے۔ میں پھر واپس آ گیا اور منبر کے پاس جو لوگ موجود تھے ان کے ساتھ بیٹھ گیا۔ لیکن میرا غم مجھ پر غالب آیا اور میں نے پھر آ کر غلام سے کہا کہ عمر کے لیے اجازت طلب کرو۔ غلام اندر گیا اور واپس آ کر جواب دیا کہ میں نے آپ کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا اور نبی کریم صلی اللہ علیہ وسلم خاموش رہے۔ میں وہاں سے واپس آ رہا تھا کہ غلام نے مجھ کو پکارا اور کہا نبی کریم صلی اللہ علیہ وسلم نے تمہیں اجازت دے دی ہے۔ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ اس بان کی چارپائی پر جس سے چٹائی بنی جاتی ہے لیٹے ہوئے تھے۔ اس پر کوئی بستر نہیں تھا۔ بان کے نشانات آپ کے پہلو مبارک پر پڑے ہوئے تھے۔ جس تکیہ پر آپ ٹیک لگائے ہوئے تھے اس میں چھال بھری ہوئی تھی۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو سلام کیا اور کھڑے ہی کھڑے عرض کیا: یا رسول اللہ! کیا آپ نے اپنی ازواج کو طلاق دے دی ہے؟ نبی کریم صلی اللہ علیہ وسلم نے میری طرف نگاہ اٹھائی اور فرمایا نہیں۔ میں ( خوشی کی وجہ سے ) کہہ اٹھا۔ اللہ اکبر۔ پھر میں نے کھڑے ہی کھڑے نبی کریم صلی اللہ علیہ وسلم کو خوش کرنے کے لیے کہا کہ یا رسول اللہ! آپ کو معلوم ہے ہم قریش کے لوگ عورتوں پر غالب رہا کرتے تھے۔ پھر جب ہم مدینہ آئے تو یہاں کے لوگوں پر ان کی عورتیں غالب تھیں۔ نبی کریم صلی اللہ علیہ وسلم اس پر مسکرا دیئے۔ پھر میں نے عرض کیا: یا رسول اللہ! آپ کو معلوم ہے میں حفصہ کے پاس ایک مرتبہ گیا تھا اور اس سے کہہ آیا تھا کہ اپنی سوکن کی وجہ سے جو تم سے زیادہ خوبصورت اور تم سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کو عزیز ہے، دھوکا میں مت رہنا۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا۔ اس پر نبی کریم صلی اللہ علیہ وسلم دوبارہ مسکرا دیئے۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو مسکراتے دیکھا تو بیٹھ گیا پھر نظر اٹھا کر میں نبی کریم صلی اللہ علیہ وسلم کے گھر کا جائزہ لیا۔ اللہ کی قسم! میں نے نبی کریم صلی اللہ علیہ وسلم کے گھر میں کوئی ایسی چیز نہیں دیکھی جس پر نظر رکتی۔ سوا تین چمڑوں کے ( جو وہاں موجود تھے ) میں نے عرض کیا: یا رسول اللہ! اللہ سے دعا فرمائیں کہ وہ آپ کی امت کو فراخی عطا فرمائے۔ فارس و روم کو فراخی اور وسعت حاصل ہے اور انہیں دنیا دی گئی ہے حالانکہ وہ اللہ کی عبادت نہیں کرتے۔ نبی کریم صلی اللہ علیہ وسلم ابھی تک ٹیک لگائے ہوئے تھے لیکن اب سیدھے بیٹھ گئے اور فرمایا: ابن خطاب! تمہاری نظر میں بھی یہ چیزیں اہمیت رکھتی ہیں، یہ تو وہ لوگ ہیں جنہیں جو کچھ بھلائی ملنے والی تھی سب اسی دنیا میں دے دی گئی ہے۔ میں نے عرض کیا: یا رسول اللہ! میرے لیے اللہ سے مغفرت کی دعا کر دیجئیے ( کہ میں نے دنیاوی شان و شوکت کے متعلق یہ غلط خیال دل میں رکھا ) چنانچہ نبی کریم صلی اللہ علیہ وسلم نے اپنی ازواج کو اسی وجہ سے انتیس دن تک الگ رکھا کہ حفصہ نے نبی کریم صلی اللہ علیہ وسلم کا راز عائشہ سے کہہ دیا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ ایک مہینہ تک میں اپنی ازواج کے پاس نہیں جاؤں گا۔ کیونکہ جب اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم پر عتاب کیا تو نبی کریم صلی اللہ علیہ وسلم کو اس کا بہت رنج ہوا ( اور آپ نے ازواج سے الگ رہنے کا فیصلہ کیا ) پھر جب انتیسویں رات گزر گئی تو نبی کریم صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کے گھر تشریف لے گئے اور آپ سے ابتداء کی۔ عائشہ رضی اللہ عنہا نے عرض کیا کہ یا رسول اللہ! آپ نے قسم کھائی تھی کہ ہمارے یہاں ایک مہینہ تک تشریف نہیں لائیں گے اور ابھی تو انتیس ہی دن گزرے ہیں میں تو ایک ایک دن گن رہی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ انتیس کا ہے۔ وہ مہینہ انتیس ہی کا تھا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر اللہ تعالیٰ نے آیت «تخير» نازل کی اور نبی کریم صلی اللہ علیہ وسلم اپنی تمام ازواج میں سب سے پہلے میرے پاس تشریف لائے ( اور مجھ سے اللہ کی وحی کا ذکر کیا ) تو میں نے نبی کریم صلی اللہ علیہ وسلم کو ہی پسند کیا۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے اپنی تمام دوسری ازواج کو اختیار دیا اور سب نے وہی کہا جو عائشہ رضی اللہ عنہا کہہ چکی تھیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5192,
			"arabicnumber": 5192,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں ہمام بن منبہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر شوہر گھر پر موجود ہے تو کوئی عورت اس کی اجازت کے بغیر ( نفلی ) روزہ نہ رکھے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5193,
			"arabicnumber": 5193,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا، ان سے شعبہ نے، ان سے سلیمان نے، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب شوہر اپنی بیوی کو اپنے بستر پر بلائے اور وہ آنے سے ( ناراضگی کی وجہ سے ) انکار کر دے تو فرشتے صبح تک اس پر لعنت بھیجتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5194,
			"arabicnumber": 5194,
			"text": "ہم سے محمد بن عرعرہ نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے بیان کیا، ان سے زرارہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر عورت اپنے شوہر سے ناراضگی کی وجہ سے اس کے بستر سے الگ تھلگ رات گزارنے تو فرشتے اس پر اس وقت تک لعنت بھیجتے ہیں جب تک وہ اپنی اس حرکت سے باز نہ آ جائے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5195,
			"arabicnumber": 5195,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، کہا ہم سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ عورت کے لیے جائز نہیں کہ اپنے شوہر کی موجودگی میں اس کی اجازت کے بغیر ( نفلی ) روزہ رکھے اور عورت کسی کو اس کے گھر میں اس کی مرضی کے بغیر آنے کی اجازت نہ دے اور عورت جو کچھ بھی اپنے شوہر کے مال میں سے اس کی صریح اجازت کے بغیر خرچ کر دے تو اسے بھی اس کا آدھا ثواب ملے گا۔ اس حدیث کو ابوالزناد نے موسیٰ بن ابی عثمان سے بھی اور ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے روایت کیا ہے اور اس میں صرف روزہ کا ہی ذکر ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5196,
			"arabicnumber": 5196,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے اسماعیل نے بیان کیا، کہا کہ ہم کو تیمی نے خبر دی، انہیں ابوعثمان نے، انہیں اسامہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں جنت کے دروازہ پر کھڑا ہوا تو اس میں داخل ہونے والوں کی اکثریت غریبوں کی تھی۔ مالدار ( جنت کے دروازے پر حساب کے لیے ) روک لیے گئے تھے البتہ جہنم والوں کو جہنم میں جانے کا حکم دے دیا گیا تھا اور میں جہنم کے دروازے پر کھڑا ہوا تو اس میں داخل ہونے والی زیادہ عورتیں تھیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5197,
			"arabicnumber": 5197,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک نے خبر دی، انہیں زید بن اسلم نے، انہیں عطاء بن یسار نے اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن ہوا تو نبی کریم صلی اللہ علیہ وسلم نے لوگوں کے ساتھ اس کی نماز پڑھی۔ آپ نے بہت لمبا قیام کی اتنا طویل کہ سورۃ البقرہ پڑھی جا سکے پھر طویل رکوع کیا۔ رکوع سے سر اٹھا کر بہت دیر تک قیام کیا۔ یہ قیام پہلے قیام سے کچھ کم تھا۔ پھر آپ نے دوسرا طویل رکوع کیا۔ یہ رکوع طوالت میں پہلے رکوع سے کچھ کم تھا۔ پھر سر اٹھایا اور سجدہ کیا۔ پھر دوبارہ قیام کیا اور بہت دیر تک حالت قیام میں رہے۔ یہ قیام پہلی رکعت کے قیام سے کچھ کم تھا۔ پھر طویل رکوع کیا، یہ رکوع پہلے رکوع سے کچھ کم طویل تھا۔ پھر سر اٹھایا اور طویل قیام کیا۔ یہ قیام پہلے قیام سے کچھ کم تھا۔ پھر رکوع کیا، طویل رکوع۔ اور یہ رکوع پہلے رکوع سے کچھ کم طویل تھا۔ پھر سر اٹھایا اور سجدہ میں گئے۔ جب آپ نماز سے فارغ ہوئے تو گرہن ختم ہو چکا تھا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ کی نشانیوں میں سے دو نشانیاں ہیں۔ ان میں گرہن کسی کی موت یا کسی کی حیات کی وجہ سے نہیں ہوتا۔ اس لیے جب تم گرہن دیکھو تو اللہ کو یاد کرو۔ صحابہ نے عرض کیا: یا رسول اللہ! ہم نے آپ کو دیکھا کہ آپ نے اپنی جگہ سے کوئی چیز بڑھ کر لی۔ پھر ہم نے دیکھا کہ آپ ہم سے ہٹ گئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جنت دیکھی تھی یا ( نبی کریم صلی اللہ علیہ وسلم نے فرمایا راوی کو شک تھا ) مجھے جنت دکھائی گئی تھی۔ میں نے اس کا خوشہ توڑنے کے لیے ہاتھ بڑھایا تھا اور اگر میں اسے توڑ لیتا تو تم رہتی دنیا تک اسے کھاتے اور میں نے دوزخ دیکھی آج کا اس سے زیادہ ہیبت ناک منظر میں نے کبھی نہیں دیکھا اور میں نے دیکھا کہ اس میں عورتوں کی تعداد زیادہ ہے۔ صحابہ نے عرض کیا: یا رسول اللہ! ایسا کیوں ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ شوہر کی ناشکری کرتی ہیں اور ان کے احسان کا انکار کرتی ہیں، اگر تم ان میں سے کسی ایک کے ساتھ زندگی بھر بھی حسن سلوک کا معاملہ کرو پھر بھی تمہاری طرف سے کوئی چیز اس کے لیے ناگواری خاطر ہوئی تو کہہ دے گی کہ میں نے تو تم سے کبھی بھلائی دیکھی ہی نہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5198,
			"arabicnumber": 5198,
			"text": "ہم سے عثمان بن ہشیم نے بیان کیا، کہا ہم سے عوف نے بیان کیا، ان سے ابوحازم نے، ان سے عمران نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جنت میں جھانک کر دیکھا تو اس کے اکثر رہنے والے غریب لوگ تھے اور میں نے دوزخ میں جھانک کر دیکھا تو اس کے اندر رہنے والی اکثر عورتیں تھیں۔ اس روایت کی متابعت ابوایوب اور سلم بن زریر نے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5199,
			"arabicnumber": 5199,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، کہا ہم کو اوزاعی نے خبر دی، کہا کہ مجھ سے یحییٰ ابن ابی کثیر نے بیان کیا، کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا، کہا کہ مجھ سے عبداللہ بن عمرو بن العاص رضی اللہ عنہما نے بیان کیا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ عبداللہ! کیا میری یہ اطلاع صحیح ہے کہ تم ( روزانہ ) دن میں روزے رکھتے ہو اور رات بھر عبادت کرتے ہو؟ میں نے عرض کیا: جی ہاں یا رسول اللہ! نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہ کرو، روزے بھی رکھو اور بغیر روزے بھی رہو۔ رات میں عبادت بھی کرو اور سوؤ بھی۔ کیونکہ تمہارے بدن کا بھی تم پر حق ہے، تمہاری آنکھ کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5200,
			"arabicnumber": 5200,
			"text": "ہم سے عبدان نے بیان کیا، انہوں نے کہا ہم کو عبداللہ نے خبر دی، انہوں نے کہا ہم کو موسیٰ بن عقبہ نے خبر دی، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں سوال ہو گا۔ امیر ( حاکم ) ہے، مرد اپنے گھر والوں پر حاکم ہے۔ عورت اپنے شوہر کے گھر اور اس کے بچوں پر حاکم ہے۔ تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں سوال ہو گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5201,
			"arabicnumber": 5201,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، انہوں نے کہا ہم سے سلیمان نے بیان کیا، انہوں نے کہا کہ مجھ سے حمید نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اپنی ازواج مطہرات سے ایک مہینہ تک الگ رہے اور اپنے ایک بالاخانہ میں قیام کیا۔ پھر آپ انتیس دن کے بعد گھر میں تشریف لائے تو کہا گیا کہ یا رسول اللہ! آپ نے تو ایک مہینہ کے لیے عہد کیا تھا نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ انتیس ( 29 ) کا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5202,
			"arabicnumber": 5202,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور مجھ سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں ابن جریج نے خبر دی، کہا کہ مجھے یحییٰ بن عبداللہ بن صیفی نے خبر دی، انہیں عکرمہ بن عبدالرحمٰن بن حارث نے خبر دی اور انہیں ام سلمہ رضی اللہ عنہا نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم نے ( ایک واقعہ کی وجہ سے ) قسم کھائی کہ اپنی بعض ازواج کے یہاں ایک مہینہ تک نہیں جائیں گے۔ پھر جب انتیس دن گزر گئے تو نبی کریم صلی اللہ علیہ وسلم ان کے پاس صبح کے وقت گئے یا شام کے وقت نبی کریم صلی اللہ علیہ وسلم سے عرض کیا گیا کہ آپ نے تو قسم کھائی تھی کہ ایک مہینہ تک نہیں آئیں گے؟ آپ نے فرمایا کہ مہینہ انتیس دن کا بھی ہوتا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5203,
			"arabicnumber": 5203,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے مروان بن معاویہ نے، کہا ہم سے ابویعفور نے بیان کیا، کہا کہ ہم سے ابوالضحیٰ کی مجلس میں (مہینہ پر) بحث کی تو انہوں نے بیان کیا کہ ہم سے ابن عباس رضی اللہ عنہما نے بیان کیا، انہوں نے کہا کہ ایک دن صبح ہوئی تو نبی کریم صلی اللہ علیہ وسلم کی ازواج رو رہی تھیں، ہر زوجہ مطہرہ کے پاس ان کے گھر والے موجود تھے۔ مسجد کی طرف گیا تو وہ بھی لوگوں سے بھری ہوئی تھی۔ پھر عمر بن خطاب رضی اللہ عنہ آئے اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اوپر گئے تو نبی کریم صلی اللہ علیہ وسلم اس وقت ایک کمرہ میں تشریف رکھتے تھے۔ انہوں نے سلام کیا لیکن کسی نے جواب نہیں دیا۔ انہوں نے پھر سلام کیا لیکن کسی نے جواب نہیں دیا۔ پھر سلام کیا اور اس مرتبہ بھی کسی نے جواب نہیں دیا۔ تو آواز دی ( بعد میں اجازت ملنے پر ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں گئے اور عرض کیا: کیا آپ نے اپنی ازواج کو طلاق دے دی ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ ایک مہینہ تک ان سے الگ رہنے کی قسم کھائی ہے۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم انتیس دن تک الگ رہے اور پھر اپنے بیویوں کے پاس گئے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5204,
			"arabicnumber": 5204,
			"text": "ہم سے محمد بن یوسف نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عبداللہ بن زمعہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم میں کوئی شخص اپنی بیوی کو غلاموں کی طرح نہ مارے کہ پھر دوسرے دن اس سے ہمبستر ہو گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5205,
			"arabicnumber": 5205,
			"text": "ہم سے خلاد بن یحییٰ نے بیان کیا، کہا ہم سے ابراہیم بن نافع نے، ان سے حسن نے وہ مسلم کے صاحبزادے ہیں، ان سے صفیہ رضی اللہ عنہا نے، ان سے عائشہ رضی اللہ عنہا نے کہ قبیلہ انصار کی ایک خاتون نے اپنی بیٹی کی شادی کی تھی۔ اس کے بعد لڑکی کے سر کے بال بیماری کی وجہ سے اڑ گئے تو وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور آپ سے اس کا ذکر کیا اور کہا کہ اس کے شوہر نے اس سے کہا ہے کہ اپنے بالوں کے ساتھ ( دوسرے مصنوعی بال ) جوڑے۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ ایسا تو ہرگز مت کر کیونکہ مصنوعی بال سر پر رکھ کے جو جوڑے تو ایسے بال جوڑنے والیوں پر لعنت کی گئی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5206,
			"arabicnumber": 5206,
			"text": "ہم سے ابن سلام نے بیان کیا، کہا ہم کو ابومعاویہ نے خبر دی، انہیں ہشام بن عروہ نے، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے آیت «وإن امرأة خافت من بعلها نشوزا أو إعراضا‏» ”اور اگر کوئی عورت اپنے شوہر کی طرف سے نفرت اور منہ موڑنے کا خوف محسوس کرے۔“ کے متعلق فرمایا کہ آیت میں ایسی عورت کا بیان ہے جو کسی مرد کے پاس ہو اور وہ مرد اسے اپنے پاس زیادہ نہ بلاتا ہو بلکہ اسے طلاق دینے کا ارادہ رکھتا ہو اور اس کے بجائے دوسری عورت سے شادی کرنا چاہتا ہو لیکن اس کی موجودہ بیوی اس سے کہے کہ مجھے اپنے ساتھ ہی رکھو اور طلاق نہ دو۔ تم میرے سوا کسی اور سے شادی کر سکتے ہو، میرے خرچ سے بھی تم آزاد ہو اور تم پر باری کی بھی کوئی پابندی نہیں تو اس کا ذکر اللہ تعالیٰ کے اس ارشاد میں «فلا جناح عليهما أن يصالحا بينهما صلحا والصلح خير‏» کہ ”پس ان پر کوئی گناہ نہیں اگر وہ آپس میں صلح کر لیں اور صلح بہرحال بہتر ہے۔“",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5207,
			"arabicnumber": 5207,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے ابن جریج نے، ان سے عطاء نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ہم عزل کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5209,
			"arabicnumber": 5209,
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5210,
			"arabicnumber": 5210,
			"text": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا، کہا ہم سے جویریہ نے بیان کیا، ان سے امام مالک بن انس نے، ان سے زہری نے، ان سے ابن محیریز نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ ( ایک غزوہ میں ) ہمیں قیدی عورتیں ملیں اور ہم نے ان سے عزل کیا۔ پھر ہم نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا حکم پوچھا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم واقعی ایسا کرتے ہو؟ تین مرتبہ آپ صلی اللہ علیہ وسلم نے یہ فرمایا ( پھر فرمایا ) قیامت تک جو روح بھی پیدا ہونے والی ہے وہ ( اپنے وقت پر ) پیدا ہو کر رہے گی۔ پس تمہارا عزل کرنا عبث حرکت ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5211,
			"arabicnumber": 5211,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے عبدالواحد بن ایمن نے، کہا کہ مجھ سے ابن ابی ملیکہ نے، ان سے قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم جب سفر کا ارادہ کرتے تو اپنی ازواج کے لیے قرعہ ڈالتے۔ ایک مرتبہ قرعہ عائشہ اور حفصہ رضی اللہ عنہما کے نام نکلا۔ نبی کریم صلی اللہ علیہ وسلم رات کے وقت معمولاً چلتے وقت عائشہ رضی اللہ عنہا کے ساتھ باتیں کرتے ہوئے چلتے۔ ایک مرتبہ حفصہ رضی اللہ عنہا نے ان سے کہا کہ آج رات کیوں نہ تم میرے اونٹ پر سوار ہو جاؤ اور میں تمہارے اونٹ پر تاکہ تم بھی نئے مناظر دیکھ سکو اور میں بھی۔ انہوں نے یہ تجویز قبول کر لی اور ( ہر ایک دوسرے کے اونٹ پر ) سوار ہو گئیں۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم عائشہ کے اونٹ کے پاس تشریف لائے۔ اس وقت اس پر حفصہ رضی اللہ عنہا بیٹھی ہوئی تھیں۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں سلام کیا، پھر چلتے رہے، جب پڑاؤ ہوا تو نبی کریم صلی اللہ علیہ وسلم کو معلوم ہوا کہ عائشہ رضی اللہ عنہا اس میں نہیں ہیں ( اس غلطی پر عائشہ کو اس درجہ رنج ہوا کہ ) جب لوگ سواریوں سے اتر گئے تو ام المؤمنین نے اپنے پاؤں اذخر گھاس میں ڈال لیے اور دعا کرنے لگی کہ اے میرے رب! مجھ پر کوئی بچھو یا سانپ مسلط کر دے جو مجھ کو ڈس لے۔ عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نبی کریم صلی اللہ علیہ وسلم سے تو کچھ کہہ نہیں سکتی تھی کیونکہ یہ حرکت خود میری ہی تھی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5212,
			"arabicnumber": 5212,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، اس سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ سودہ بنت زمعہ نے اپنی باری عائشہ رضی اللہ عنہا کو دے دی تھی اور رسول اللہ صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کے یہاں خود ان کی باری کے دن اور سودہ رضی اللہ عنہا کی باری کے دن رہتے تھے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5213,
			"arabicnumber": 5213,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے بشر بن مفضل نے، ان سے خالد حذاء نے، ان سے ابوقلابہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے (راوی ابوقلابہ یا انس رضی اللہ عنہ نے) کہا کہ اگر میں چاہوں تو کہہ سکتا ہوں کہ نبی کریم صلی اللہ علیہ وسلم نے ( آنے والی حدیث ) ارشاد فرمائی۔ لیکن بیان کیا کہ دستور یہ ہے کہ جب کنواری سے شادی کرے تو اس کے ساتھ سات دن تک رہنا چاہئے اور جب بیوہ سے شادی کرے تو اس کے ساتھ تین دن تک رہنا چاہئے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5214,
			"arabicnumber": 5214,
			"text": "ہم سے یوسف بن راشد نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے سفیان ثوری نے، کہا ہم سے ایوب اور خالد نے دونوں نے بیان کیا، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ دستور یہ کہ جب کوئی شخص پہلے سے شادی شدہ بیوی کی موجودگی میں کسی کنواری عورت سے شادی کرے تو اس کے ساتھ سات دن تک قیام کرے اور پھر باری مقرر کرے اور جب کسی کنواری بیوی کی موجودگی میں پہلے سے شادی شدہ عورت سے نکاح کرے تو اس کے ساتھ تین دن تک قیام کرے اور پھر باری مقرر کرے۔ ابوقلابہ نے بیان کیا کہ اگر میں چاہوں تو کہہ سکتا ہوں کہ انس رضی اللہ عنہ نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم سے مرفوعاً بیان کی ہے۔ اور عبدالرزاق نے بیان کیا، انہیں سفیان نے خبر دی، انہیں ایوب اور خالد نے کہا کہ اگر میں چاہوں تو کہہ سکتا ہوں کہ انس رضی اللہ عنہ نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم سے مرفوعاً بیان کی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5215,
			"arabicnumber": 5215,
			"text": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا، کہا ہم سے یزید بن زریع نے بیان کیا، کہا ہم سے سعید نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ ایک رات میں نبی کریم صلی اللہ علیہ وسلم اپنی تمام ازواج مطہرات کے پاس گئے۔ اس وقت نبی کریم صلی اللہ علیہ وسلم کے نکاح میں نو بیویاں تھیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5216,
			"arabicnumber": 5216,
			"text": "ہم سے فروہ نے بیان کیا، کہا ہم سے علی بن مسہر نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہا رسول اللہ صلی اللہ علیہ وسلم عصر کی نماز سے فارغ ہو کر اپنی ازواج مطہرات کے پاس تشریف لے جاتے اور ان میں سے کسی ایک کے قریب بھی بیٹھتے۔ ایک دن نبی کریم صلی اللہ علیہ وسلم حفصہ رضی اللہ عنہا کے یہاں گئے اور معمول سے زیادہ کافی دیر تک ٹھہرے رہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5217,
			"arabicnumber": 5217,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا، ان سے ہشام بن عروہ نے بیان کیا، انہیں ان کے والد نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم کی جس مرض میں وفات ہوئی، اس میں آپ پوچھا کرتے تھے کہ کل میری باری کس کے یہاں ہے؟ کل میری باری کس کے یہاں ہے؟ آپ کو عائشہ کی باری کا انتظار تھا۔ چنانچہ آپ کی تمام ازواج نے آپ کو اس کی اجازت دے دی کہ آپ جہاں چاہیں بیماری کے دن گزاریں۔ نبی کریم صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کے گھر آ گئے اور یہیں آپ کی وفات ہوئی۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کی اسی دن وفات ہوئی جو میری باری کا دن تھا اور اللہ تعالیٰ کا یہ بھی احسان دیکھو اس نے جب نبی کریم صلی اللہ علیہ وسلم کو اپنے یہاں بلایا تو نبی کریم صلی اللہ علیہ وسلم کا سر مبارک میرے سینے پر تھا اور نبی کریم صلی اللہ علیہ وسلم کا لعاب دہن میرے لعاب دہن سے ملا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5218,
			"arabicnumber": 5218,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے سلیمان نے بیان کیا، ان سے یحییٰ نے، ان سے عبید بن حنین نے، انہوں نے ابن عباس رضی اللہ عنہما سے سنا، انہوں نے عمر رضی اللہ عنہ سے کہ آپ حفصہ کے یہاں گئے اور ان سے کہا کہ بیٹی اپنی اس سوکن کو دیکھ کر دھوکے میں نہ آ جانا جسے اپنے حسن پر اور رسول اللہ صلی اللہ علیہ وسلم کی محبت پر ناز ہے۔ آپ کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا ( عمر رضی اللہ عنہ نے بیان کیا ) کہ پھر میں نے یہی بات آپ کے سامنے دہرائی آپ مسکرا دیئے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5219,
			"arabicnumber": 5219,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ہشام نے، ان سے فاطمہ بنت منذر نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے (دوسری سند) اور مجھ سے محمد بن مثنٰی نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے ہشام نے، ان سے فاطمہ بنت منذر نے بیان کیا اور ان سے اسماء بنت ابوبکر رضی اللہ عنہما نے کہ ایک خاتون نے عرض کیا: یا رسول اللہ! میری سوکن ہے اگر اپنے شوہر کی طرف سے ان چیزوں کے حاصل ہونے کی بھی داستانیں اسے سناؤں جو حقیقت میں میرا شوہر مجھے نہیں دیتا تو کیا اس میں کوئی حرج ہے؟ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ جو چیز حاصل نہ ہو اس پر فخر کرنے والا اس شخص جیسا ہے جو فریب کا جوڑا یعنی ( دوسروں کے کپڑے ) مانگ کر پہنے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5220,
			"arabicnumber": 5220,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، ان سے اعمش نے بیان کیا، ان سے شقیق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ سے زیادہ غیرت مند اور کوئی نہیں ہے۔ یہی وجہ ہے کہ اس نے بےحیائی کے کاموں کو حرام کیا ہے اور اللہ سے بڑھ کر کوئی اپنی تعریف پسند کرنے والا نہیں ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5221,
			"arabicnumber": 5221,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد عروہ بن زبیر نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے امت محمد! اللہ سے بڑھ کر غیرت مند اور کوئی نہیں کہ وہ اپنے بندے یا بندی کو زنا کرتے ہوئے دیکھے۔ اے امت محمد! اگر تمہیں وہ معلوم ہوتا جو مجھے معلوم ہے تو تم ہنستے کم اور روتے زیادہ۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5222,
			"arabicnumber": 5222,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ہمام بن یحییٰ نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے، ان سے ابوسلمہ بن عبدالرحمٰن نے، ان سے عروہ بن زبیر نے بیان کیا اور ان سے ان کی والدہ اسماء بنت ابی بکر رضی اللہ عنہما نے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم فرما رہے تھے کہ اللہ تعالیٰ سے زیادہ غیرت مند کوئی نہیں اور ( اسی سند سے ) یحییٰ سے روایت ہے کہ ان سے ابوسلمہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5223,
			"arabicnumber": 5223,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے شیبان بن عبدالرحمٰن نحوی نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے، ان سے ابوسلمہ نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کو غیرت آتی ہے اور اللہ تعالیٰ کو غیرت اس وقت آتی ہے جب بندہ مومن وہ کام کرے جسے اللہ نے حرام کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5224,
			"arabicnumber": 5224,
			"text": "ہم سے محمود بن غیلان نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، کہا کہ مجھے میرے والد نے خبر دی اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ زبیر رضی اللہ عنہ نے مجھ سے شادی کی تو ان کے پاس ایک اونٹ اور ان کے گھوڑے کے سوا روئے زمین پر کوئی مال، کوئی غلام، کوئی چیز نہیں تھی۔ میں ہی ان کا گھوڑا چراتی، پانی پلاتی، ان کا ڈول سیتی اور آٹا گوندھتی۔ میں اچھی طرح روٹی نہیں پکا سکتی تھی۔ انصار کی کچھ لڑکیاں میری روٹی پکا جاتی تھیں۔ یہ بڑی سچی اور باوفا عورتیں تھیں۔ زبیر رضی اللہ عنہ کی وہ زمین جو رسول اللہ صلی اللہ علیہ وسلم نے انہیں دی تھی، اس سے میں اپنے سر پر کھجور کی گٹھلیاں گھر لایا کرتی تھی۔ یہ زمین میرے گھر سے دو میل دور تھی۔ ایک روز میں آ رہی تھی اور گٹھلیاں میرے سر پر تھیں کہ راستے میں رسول اللہ صلی اللہ علیہ وسلم سے ملاقات ہو گئی۔ نبی کریم صلی اللہ علیہ وسلم کے ساتھ قبیلہ انصار کے کئی آدمی تھے۔ نبی کریم صلی اللہ علیہ وسلم نے مجھے بلایا پھر ( اپنے اونٹ کو بٹھانے کے لیے ) کہا اخ اخ۔ نبی کریم صلی اللہ علیہ وسلم چاہتے تھے کہ مجھے اپنی سواری پر اپنے پیچھے سوار کر لیں لیکن مجھے مردوں کے ساتھ چلنے میں شرم آئی اور زبیر رضی اللہ عنہ کی غیرت کا بھی خیال آیا۔ زبیر رضی اللہ عنہ بڑے ہی باغیرت تھے۔ نبی کریم صلی اللہ علیہ وسلم بھی سمجھ گئے کہ میں شرم محسوس کر رہی ہوں۔ اس لیے آپ آگے بڑھ گئے۔ پھر میں زبیر رضی اللہ عنہ کے پاس آئی اور ان سے واقعہ کا ذکر کیا کہ نبی کریم صلی اللہ علیہ وسلم سے میری ملاقات ہو گئی تھی۔ میرے سر پر گٹھلیاں تھیں اور نبی کریم صلی اللہ علیہ وسلم کے ساتھ آپ کے چند صحابہ بھی تھے۔ نبی کریم صلی اللہ علیہ وسلم نے اپنا اونٹ مجھے بٹھانے کے لیے بٹھایا لیکن مجھے اس سے شرم آئی اور تمہاری غیرت کا بھی خیال آیا۔ اس پر زبیر نے کہا کہ اللہ کی قسم! مجھ کو تو اس سے بڑا رنج ہوا کہ تو گٹھلیاں لانے کے لیے نکلے اگر تو نبی کریم صلی اللہ علیہ وسلم کے ساتھ سوار ہو جاتی تو اتنی غیرت کی بات نہ تھی ( کیونکہ اسماء رضی اللہ عنہا آپ کی سالی اور بھاوج دونوں ہوتی تھیں ) اس کے بعد میرے والد ابوبکر رضی اللہ عنہ نے ایک غلام میرے پاس بھیج دیا وہ گھوڑے کا سب کام کرنے لگا اور میں بےفکر ہو گئی گویا والد ماجد ابوبکر رضی اللہ عنہ نے ( غلام بھیج کر ) مجھ کو آزاد کر دیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5225,
			"arabicnumber": 5225,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے اسماعیل بن علیہ نے، ان سے حمید نے، ان سے انس نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم اپنی ایک زوجہ ( عائشہ رضی اللہ عنہا ) کے یہاں تشریف رکھتے تھے۔ اس وقت ایک زوجہ ( زینب بنت جحش رضی اللہ عنہا ) نے نبی کریم صلی اللہ علیہ وسلم کے لیے ایک پیالے میں کچھ کھانے کی چیز بھیجی جن کے گھر میں نبی کریم صلی اللہ علیہ وسلم اس وقت تشریف رکھتے تھے۔ انہوں نے خادم کے ہاتھ پر ( غصہ میں ) مارا جس کی وجہ سے کٹورہ گر کر ٹوٹ گیا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے کٹورا لے کر ٹکڑے جمع کئے اور جو کھانا اس برتن میں تھا اسے بھی جمع کرنے لگے اور ( خادم سے ) فرمایا کہ تمہاری ماں کو غیرت آ گئی ہے۔ اس کے بعد خادم کو روکے رکھا۔ آخر جن کے گھر میں وہ کٹورہ ٹوٹا تھا ان کی طرف سے نیا کٹورہ منگایا گیا اور نبی کریم صلی اللہ علیہ وسلم نے وہ نیا کٹورہ ان زوجہ مطہرہ کو واپس کیا جن کا کٹورہ توڑ دیا گیا تھا اور ٹوٹا ہوا کٹورہ ان کے یہاں رکھ لیا جن کے گھر میں وہ ٹوٹا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5226,
			"arabicnumber": 5226,
			"text": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا، انہوں نے کہا ہم سے معتمر بن سلیمان نے بیان کیا، انہوں نے کہا ہم سے عبیداللہ بن عمرعمری نے، ان سے محمد بن منکدر نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں جنت میں داخل ہوا یا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ) میں جنت میں گیا، وہاں میں نے ایک محل دیکھا میں نے پوچھا یہ محل کس کا ہے؟ فرشتوں نے بتایا کہ عمر بن خطاب رضی اللہ عنہ کا میں نے چاہا کہ اس کے اندر جاؤں لیکن رک گیا کیونکہ تمہاری غیرت مجھے معلوم تھی۔ اس پر عمر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! میرے ماں باپ آپ پر فدا ہوں، اے اللہ کے نبی! کیا میں آپ پر غیرت کروں گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5227,
			"arabicnumber": 5227,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے، انہیں زہری نے، کہا کہ مجھے سعید بن مسیب نے خبر دی، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ خواب میں میں نے اپنے آپ کو جنت میں دیکھا۔ وہاں میں نے دیکھا کہ ایک محل کے کنارے ایک عورت وضو کر رہی تھی۔ میں نے پوچھا کہ یہ محل کس کا ہے؟ فرشتے نے کہا کہ عمر بن خطاب رضی اللہ عنہ کا۔ میں ان کی غیرت کا خیال کر کے واپس چلا آیا۔ عمر رضی اللہ عنہ نے جو اس وقت مجلس میں موجود تھے اس پر رو دیئے اور عرض کیا: یا رسول اللہ! کیا میں آپ پر غیرت کروں گا؟",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5228,
			"arabicnumber": 5228,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ میں خوب پہچانتا ہوں کہ کب تم مجھ سے خوش ہوتی ہو اور کب تم مجھ پر ناراض ہو جاتی ہو۔ بیان کیا کہ اس پر میں نے عرض کیا آپ یہ بات کس طرح سمجھتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم مجھ سے خوش ہوتی ہو تو کہتی ہو نہیں محمد ( صلی اللہ علیہ وسلم ) کے رب کی قسم! اور جب تم مجھ سے ناراض ہوتی ہو تو کہتی ہو نہیں ابراہیم علیہ السلام کے رب کی قسم! بیان کیا کہ میں نے عرض کیا جی ہاں، اللہ کی قسم یا رسول اللہ! ( غصے میں ) صرف آپ کا نام زبان سے نہیں لیتی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5229,
			"arabicnumber": 5229,
			"text": "مجھ سے احمد بن ابی رجاء نے بیان کیا، کہا ہم سے نضر بن شمیل نے بیان کیا، ان سے ہشام بن عروہ نے، کہا کہ مجھے میرے والد نے خبر دی، ان سے عائشہ رضی اللہ عنہا نے، آپ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے لیے کسی عورت پر مجھے اتنی غیرت نہیں آتی تھی جتنی ام المؤمنین خدیجہ رضی اللہ عنہا پر آتی تھی کیونکہ نبی کریم صلی اللہ علیہ وسلم ان کا ذکر بکثرت کیا کرتے تھے اور ان کی تعریف کرتے تھے اور نبی کریم صلی اللہ علیہ وسلم پر وحی کی گئی تھی کہ آپ خدیجہ کو جنت میں ان کے موتی کے گھر کی بشارت دے دیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5230,
			"arabicnumber": 5230,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے ابن ابی ملیکہ نے اور ان سے مسور بن مخرمہ رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم ممبر پر فرما رہے تھے کہ ہشام بن مغیرہ جو ابوجہل کا باپ تھا اس کی اولاد ( حارث بن ہشام اور سلم بن ہشام ) نے اپنی بیٹی کا نکاح علی بن ابی طالب سے کرنے کی مجھ سے اجازت مانگی ہے لیکن میں انہیں ہرگز اجازت نہیں دوں گا یقیناً میں اس کی اجازت نہیں دوں گا ہرگز میں اس کی اجازت نہیں دوں گا۔ البتہ اگر علی بن ابی طالب میری بیٹی کو طلاق دے کر ان کی بیٹی سے نکاح کرنا چاہیں ( تو میں اس میں رکاوٹ نہیں بنوں گا ) کیونکہ وہ ( فاطمہ رضی اللہ عنہا ) میرے جگر کا ایک ٹکڑا ہے جو اس کو برا لگے وہ مجھ کو بھی برا لگتا ہے اور جس چیز سے اسے تکلیف پہنچتی ہے اس سے مجھے بھی تکلیف پہنچتی ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5231,
			"arabicnumber": 5231,
			"text": "ہم سے حفص بن عمر حوضی نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ میں تم سے وہ حدیث بیان کروں گا جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے، میرے سوا یہ حدیث تم سے کوئی اور نہیں بیان کرنے والا ہے۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ قیامت کی نشانیوں میں سے یہ بھی ہے کہ قرآن و حدیث کا علم اٹھا لیا جائے گا اور جہالت بڑھ جائے گی۔ زنا کی کثرت ہو جائے گی اور شراب لوگ زیادہ پینے لگیں گے۔ مرد کم ہو جائیں گے اور عورتوں کی تعداد زیادہ ہو جائے گی۔ حالت یہ ہو جائے گی کہ پچاس پچاس عورتوں کا سنبھالنے والا ( خبر گیر ) ایک مرد ہو گا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5232,
			"arabicnumber": 5232,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یزید بن ابی حبیب نے، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ عورتوں میں جانے سے بچتے رہو اس پر قبیلہ انصار کے ایک صحابی نے عرض کیا: یا رسول اللہ! دیور کے متعلق آپ کی کیا رائے ہے؟ ( وہ اپنی بھاوج کے ساتھ جا سکتا ہے یا نہیں؟ ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دیور یا ( جیٹھ ) کا جانا ہی تو ہلاکت ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5233,
			"arabicnumber": 5233,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہ ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے بیان کیا، ان سے ابو معبد نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ محرم کے سوا کوئی مرد کسی عورت کے ساتھ تنہائی میں نہ بیٹھے۔ اس پر ایک صحابی نے عرض کیا: یا رسول اللہ! میری بیوی حج کرنے گئی ہے اور میرا نام فلاں غزوہ میں لکھا گیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر تو واپس جا اور اپنی بیوی کے ساتھ حج کر۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5234,
			"arabicnumber": 5234,
			"text": "ہم سے محمد بن بشار نے حدیث بیان کی، ان سے غندر نے حدیث بیان کی، ان سے شعبہ نے حدیث بیان کی، ان سے ہشام نے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ قبیلہ انصار کی ایک خاتون نبی کریم صلی اللہ علیہ وسلم کے پاس آئیں اور نبی کریم صلی اللہ علیہ وسلم نے اس سے لوگوں سے ایک طرف ہو کر تنہائی میں گفتگو کی اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ ( یعنی انصار ) مجھے سب لوگوں سے زیادہ عزیز ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5235,
			"arabicnumber": 5235,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے عبدہ بن سلیمان نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے، ان سے زینب بنت ام سلمہ رضی اللہ عنہا نے اور ان سے ام المؤمنین ام سلمہ نے کہ نبی کریم صلی اللہ علیہ وسلم ان کے یہاں تشریف رکھتے تھے، گھر میں ایک مغیث نامی مخنث بھی تھا۔ اس مخنث ( ہیجڑے ) نے ام سلمہ کے بھائی عبداللہ بن ابی امیہ رضی اللہ عنہ سے کہا کہ اگر کل اللہ نے تمہیں طائف پر فتح عنایت فرمائی تو میں تمہیں غیلان کی بیٹی کو دکھلاؤں گا کیونکہ وہ سامنے آتی ہے تو ( مٹاپے کی وجہ سے ) اس کے چار شکنیں پڑ جاتی ہیں اور جب پیچھے پھرتی ہے تو آٹھ ہو جاتی ہیں۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے ( ام سلمہ سے ) فرمایا کہ یہ ( مخنث ) تمہارے پاس اب نہ آیا کرے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5236,
			"arabicnumber": 5236,
			"text": "ہم سے اسحاق بن ابراہیم حنظلی نے بیان کیا، ان سے عیسیٰ بن یونس نے بیان کیا، ان سے اوزاعی نے، ان سے زہری نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم میرے لیے اپنی چادر سے پردہ کئے ہوئے ہیں۔ میں حبشہ کے ان لوگوں کو دیکھ رہی تھی جو مسجد میں ( جنگی ) کھیل کا مظاہرہ کر رہے تھے، آخر میں ہی اکتا گئی۔ اب تم سمجھ لو ایک کم عمر لڑکی جس کو کھیل تماشہ دیکھنے کا بڑا شوق ہے کتنی دیر تک دیکھتی رہی ہو گی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5237,
			"arabicnumber": 5237,
			"text": "ہم سے فروہ بن ابی المغراء نے بیان کیا، کہا ہم سے علی بن مسہر نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ام المؤمنین سودہ بنت زمعہ رضی اللہ عنہا رات کے وقت باہر نکلیں تو عمر رضی اللہ عنہ نے انہیں دیکھ لیا اور پہچان گئے۔ پھر کہا: اے سودہ، اللہ کی قسم! تم ہم سے چھپ نہیں سکتیں۔ جب سودہ رضی اللہ عنہا واپس نبی کریم صلی اللہ علیہ وسلم کے پاس آئیں تو نبی کریم صلی اللہ علیہ وسلم سے اس کا ذکر کیا۔ نبی کریم صلی اللہ علیہ وسلم اس وقت میرے حجرے میں شام کا کھانا کھا رہے تھے۔ آپ صلی اللہ علیہ وسلم کے ہاتھ میں گوشت کی ایک ہڈی تھی۔ اس وقت آپ پر وحی نازل ہونی شروع ہوئی اور جب نزول وحی کا سلسلہ ختم ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں اجازت دی گئی ہے کہ تم اپنی ضروریات کے لیے باہر نکل سکتی ہو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5238,
			"arabicnumber": 5238,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، کہا ہم سے زہری نے، ان سے سالم نے اور ان سے ان کے والد (عبداللہ بن عمر رضی اللہ عنہما) نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے کہ جب تم میں سے کسی کی بیوی مسجد میں ( نماز پڑھنے کے لیے ) جانے کی اجازت مانگے تو اسے نہ روکو بلکہ اجازت دے دو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5239,
			"arabicnumber": 5239,
			"text": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں ہشام بن عروہ نے، انہیں ان کے والد عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میرے دودھ چچا ( رضاعی چچا، افلح ) آئے اور میرے پاس اندر آنے کی اجازت چاہی لیکن میں نے کہا کہ جب تک میں رسول اللہ صلی اللہ علیہ وسلم سے پوچھ نہ لوں، اجازت نہیں دے سکتی۔ پھر آپ صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ سے اس کے متعلق پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ تمہارے رضاعی چچا ہیں، انہیں اندر بلا لو۔ میں نے اس پر کہا کہ یا رسول اللہ! عورت نے مجھے دودھ پلایا تھا کوئی مرد نے تھوڑا ہی پلایا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہیں تو وہ تمہارے چچا ہی ( رضاعی ) اس لیے وہ تمہارے پاس آ سکتے ہیں، یہ واقعہ ہمارے لیے پردہ کا حکم نازل ہونے کے بعد کا ہے۔ عائشہ رضی اللہ عنہا نے کہا کہ خون سے جو چیزیں حرام ہوتی ہیں رضاعت سے بھی وہ حرام ہو جاتی ہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5240,
			"arabicnumber": 5240,
			"text": "ہم سے محمد بن یوسف فریابی نے بیان کیا، کہا ہم سے سفیان ثوری رحمہ اللہ نے بیان کیا، ان سے منصور بن معتمر نے، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کوئی عورت کسی عورت سے ملنے کے بعد اپنے شوہر سے اس کا حلیہ نہ بیان کرے، گویا کہ وہ اسے دیکھ رہا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5241,
			"arabicnumber": 5241,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، ان سے اعمش نے بیان کیا، کہا کہ مجھ سے شقیق نے بیان کیا، کہا میں نے عبداللہ بن مسعود رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کوئی عورت کسی عورت سے مل کر اپنے شوہر سے اس کے حلیہ نہ بیان کرے گویا کہ وہ اسے دیکھ رہا ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5242,
			"arabicnumber": 5242,
			"text": "مجھ سے محمود بن غیلان نے بیان کیا، کہا ہم سے عبدالرزاق نے، کہا ہم کو معمر نے خبر دی، انہیں عبداللہ بن طاؤس نے، انہیں ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ سلیمان بن داؤد علیہاالسلام نے فرمایا کہ آج رات میں اپنی سو بیویوں کے پاس ہو آؤں گا ( اور اس قربت کے نتیجہ میں ) ہر عورت ایک لڑکا جنے گی تو سو لڑکے ایسے پیدا ہوں گے جو اللہ کے راستے میں جہاد کریں گے۔ فرشتہ نے ان سے کہا کہ ان شاءاللہ کہہ لیجئے لیکن انہوں نے نہیں کہا اور بھول گئے۔ چنانچہ آپ تمام بیویوں کے پاس گئے لیکن ایک کے سوا کسی کے بھی بچہ پیدا نہ ہوا اور اس ایک کے یہاں بھی آدھا بچہ پیدا ہوا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر ان شاءاللہ کہہ لیتے تو ان کی مراد بر آتی اور ان کی خواہش پوری ہونے کی امید زیادہ ہوتی۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5243,
			"arabicnumber": 5243,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے محارب بن دثار نے بیان کیا، کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کسی شخص سے رات کے وقت اپنے گھر ( سفر سے اچانک ) آنے پر ناپسندیدگی کا اظہار فرماتے تھے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5244,
			"arabicnumber": 5244,
			"text": "ہم سے محمد بن مقاتل مروزی نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو عاصم بن سلیمان نے خبر دی، انہیں عامر شعبی نے اور ان سے جابر بن عبداللہ انصاری رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم میں سے کوئی شخص زیادہ دنوں تک اپنے گھر سے دور ہو تو یکایک رات کو اپنے گھر میں نہ آ جائے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5245,
			"arabicnumber": 5245,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، ان سے ہشیم بن بشیر نے، ان سے سیار بن دروان نے، ان سے عامر شعبی نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک جہاد ( غزوہ تبوک ) میں تھا، جب ہم واپس ہو رہے تھے تو میں اپنے سست رفتار اونٹ کو تیز چلانے کی کوشش کر رہا تھا۔ اتنے میں میرے پیچھے سے ایک سوار میرے قریب آئے۔ میں نے مڑ کر دیکھا تو رسول اللہ صلی اللہ علیہ وسلم تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا جلدی کیوں کر رہے ہو؟ میں نے عرض کیا کہ میری شادی ابھی نئی ہوئی ہے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا، کنواری عورت سے تم نے شادی کی یا بیوہ سے؟ میں نے عرض کیا کہ بیوہ سے۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا، کنواری سے کیوں نہ کی؟ تم اس کے ساتھ کھیلتے اور وہ تمہارے ساتھ کھیلتی۔ جابر نے بیان کیا کہ پھر جب ہم مدینہ پہنچے تو ہم نے چاہا کہ شہر میں داخل ہو جائیں لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ ٹھہر جاؤ۔ رات ہو جائے پھر داخل ہونا تاکہ تمہاری بیویاں جو پراگندہ بال ہیں وہ کنگھی چوٹی کر لیں اور جن کے خاوند غائب تھے وہ موئے زیر ناف صاف کر لیں۔ ہشیم نے بیان کیا کہ مجھ سے ایک معتبر راوی نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ «الكيس، الكيس» یعنی اے جابر! جب تو گھر پہنچے تو خوب خوب «كيس» کیجؤ ( امام بخاری رحمہ اللہ نے کہا ) «كيس» کا مطلب ہے کہ اولاد ہونے کی خواہش کیجؤ۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5246,
			"arabicnumber": 5246,
			"text": "ہم سے محمد بن ولید نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے سیار نے، ان سے شعبی نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم ( غزوہ تبوک سے واپسی کے وقت ) فرمایا، جب رات کے وقت تم مدینہ میں پہنچو تو اس وقت تک اپنے گھروں میں نہ جانا جب تک ان کی بیویاں جو مدینہ منورہ میں موجود نہیں تھے، اپنا موئے زیر ناف صاف نہ کر لیں اور جن کے بال پراگندہ ہوں وہ کنگھا نہ کر لیں۔ جابر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ پھر ضروری ہے کہ جب تم گھر پہنچو تو خوب خوب «كيس» کیجؤ۔ شعبی کے ساتھ اس حدیث کو عبیداللہ نے بھی وہب بن کیسان سے، انہوں نے جابر رضی اللہ عنہ سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا، اس میں بھی «كيس» کا ذکر ہے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5247,
			"arabicnumber": 5247,
			"text": "مجھ سے یعقوب بن ابراہیم نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا ہم کو سیار نے خبر دی، انہیں شعبی نے، انہیں جابر بن عبداللہ رضی اللہ عنہما نے، انہوں نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ ( غزوہ تبوک ) میں تھے۔ واپس ہوتے ہوئے جب ہم مدینہ منورہ کے قریب پہنچے تو میں نے اپنے سست رفتار اونٹ کو تیز چلانے لگا۔ ایک صاحب نے پیچھے سے میرے قریب پہنچ کر میرے اونٹ کو ایک چھڑی سے جو ان کے پاس تھی، مارا۔ اس سے اونٹ بڑی اچھی چال چلنے لگا، جیسا کہ تم نے اچھے اونٹوں کو چلتے ہوئے دیکھا ہو گا۔ میں نے مڑ کر دیکھا تو رسول اللہ صلی اللہ علیہ وسلم تھے۔ میں نے عرض کیا: یا رسول اللہ! میری نئی شادی ہوئی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر پوچھا، کیا تم نے شادی کر لی؟ میں نے عرض کیا کہ جی ہاں۔ دریافت فرمایا، کنواری سے کی ہے یا بیوہ سے؟ بیان کیا کہ میں نے عرض کیا کہ بیوہ سے کی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کنواری سے کیوں نہ کی؟ تم اس کے ساتھ کھیلتے اور وہ تمہارے ساتھ کھیلتی۔ بیان کیا کہ پھر جب ہم مدینہ پہنچے تو شہر میں داخل ہونے لگے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ ٹھہر جاؤ رات ہو جائے پھر داخل ہونا تاکہ پراگندہ بال عورت چوٹی کنگھا کر لے اور جس کا شوہر موجود نہ رہا ہو وہ موئے زیر ناف صاف کر لے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5248,
			"arabicnumber": 5248,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عیینہ نے بیان کیا، ان سے ابوحازم سلمہ بن دینار نے بیان کیا کہ اس واقعہ میں لوگوں میں اختلاف تھا کہ احد کی جنگ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے لیے کون سی دوا استعمال کی گئی تھی۔ پھر لوگوں نے سہل بن سعد ساعدی رضی اللہ عنہ سے سوال کیا، وہ اس وقت آخری صحابی تھے جو مدینہ منورہ میں موجود تھے۔ انہوں نے بتلایا کہ اب کوئی شخص ایسا زندہ نہیں جو اس واقعہ کو مجھ سے زیادہ جانتا ہو۔ فاطمہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کے چہرہ مبارک سے خون دھو رہی تھیں اور علی رضی اللہ عنہ اپنے ڈھال میں پانی بھر کر لا رہے تھے۔ ( جب بند نہ ہوا تو ) ایک بوریا جلا کر آپ کے زخم میں بھر دیا گیا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5249,
			"arabicnumber": 5249,
			"text": "ہم سے احمد بن محمد نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو سفیان ثوری نے خبر دی، ان سے عبدالرحمٰن بن عابس نے، کہا میں نے ابن عباس رضی اللہ عنہما سے سنا، ان سے ایک شخص نے یہ سوال کیا تھا کہ تم بقر عید یا عید کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ موجود تھے؟ انہوں نے کہا کہ ہاں۔ اگر میں نبی کریم صلی اللہ علیہ وسلم کا رشتہ دار نہ ہوتا تو میں اپنی کم سنی کی وجہ سے ایسے موقع پر حاضر نہیں ہو سکتا تھا۔ ان کا اشارہ ( اس زمانے میں ) اپنے بچپن کی طرف تھا۔ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم باہر تشریف لے گئے اور ( لوگوں کے ساتھ عید کی ) نماز پڑھی اور اس کے بعد خطبہ دیا۔ ابن عباس رضی اللہ عنہما نے اذان اور اقامت کا ذکر نہیں کیا، پھر آپ عورتوں کے پاس آئے اور انہیں وعظ و نصیحت کی اور انہیں خیرات دینے کا حکم دیا۔ میں نے انہیں دیکھا کہ پھر وہ اپنے کانوں اور گلے کی طرف ہاتھ بڑھا بڑھا کر ( اپنے زیورات ) بلال رضی اللہ عنہ کو دینے لگیں۔ اس کے بعد بلال رضی اللہ عنہ کے ساتھ نبی کریم صلی اللہ علیہ وسلم واپس تشریف لائے۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5250,
			"arabicnumber": 5250,
			"text": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں عبدالرحمٰن بن قاسم نے، انہیں ان کے والد قاسم بن محمد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ( ان کے والد ) ابوبکر رضی اللہ عنہ ان پر غصہ ہوئے اور میری کوکھ میں ہاتھ سے کچوکے لگانے لگے لیکن میں حرکت اس وجہ سے نہ کر سکی کہ رسول اللہ صلی اللہ علیہ وسلم کا سر مبارک میری ران پر رکھا ہوا تھا۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 183
			}
		}
	]
}