{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"73": "Al-Adha Festival Sacrifice (Adaahi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5545,
			"arabicnumber": 5545,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے زبید ایامی نے، ان سے شعبی نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ آج ( عید الاضحی کے دن ) کی ابتداء ہم نماز ( عید ) سے کریں گے پھر واپس آ کر قربانی کریں گے جو اس طرح کرے گا وہ ہماری سنت کے مطابق کرے گا لیکن جو شخص ( نماز عید سے ) پہلے ذبح کرے گا تو اس کی حیثیت صرف گوشت کی ہو گی جو اس نے اپنے گھر والوں کے لیے تیار کر لیا ہے قربانی وہ قطعاً بھی نہیں۔ اس پر ابوبردہ بن نیار رضی اللہ عنہ کھڑے ہوئے انہوں نے ( نماز عید سے پہلے ہی ) ذبح کر لیا تھا اور عرض کیا کہ میرے پاس ایک سال سے کم عمر کا بکرا ہے ( کیا اس کی دوبارہ قربانی اب نماز کے بعد کر لوں؟ ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کی قربانی کر لو لیکن تمہارے بعد یہ کسی اور کے لیے کافی نہیں ہو گا۔ مطرف نے عامر سے بیان کیا اور ان سے براء بن عازب رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے نماز عید کے بعد قربانی کی اس کی قربانی پوری ہو گی اور اس نے مسلمانوں کی سنت کے مطابق عمل کیا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5546,
			"arabicnumber": 5546,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، ان سے ایوب نے، ان سے محمد بن سیرین نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے نماز عید سے پہلے قربانی کر لی اس نے اپنی ذات کے لیے جانور ذبح کیا اور جس نے نماز عید کے بعد قربانی کی اس کی قربانی پوری ہوئی۔ اس نے مسلمانوں کی سنت کو پا لیا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5547,
			"arabicnumber": 5547,
			"text": "ہم سے معاذ بن فضالہ نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے یحییٰ نے اور ان سے بعجہ الجہنی نے اور ان سے عقبہ بن عامر جہنی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ میں قربانی کے جانور تقسیم کئے۔ عقبہ رضی اللہ عنہ کے حصہ میں ایک سال سے کم کا بکری کا بچہ آیا۔ انہوں نے بیان کیا کہ اس پر میں نے عرض کیا: یا رسول اللہ! میرے حصہ میں تو ایک سال سے کم کا بچہ آیا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم اسی کی قربانی کر لو۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5548,
			"arabicnumber": 5548,
			"text": "ہم سے مسدد نے بیان کیا، ہم سے سفیان نے بیان کیا، ان سے عبدالرحمٰن بن قاسم نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم ( حجۃ الوداع کے موقع پر ) ان کے پاس آئے وہ مکہ مکرمہ میں داخل ہونے سے پہلے مقام سرف میں حائضہ ہو گئی تھیں۔ اس وقت آپ رو رہی تھیں۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا بات ہے کیا تمہیں حیض کا خون آنے لگا ہے؟ عائشہ رضی اللہ عنہا نے عرض کیا کہ جی ہاں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو اللہ تعالیٰ نے آدم علیہ السلام کی بیٹیوں کے مقدر میں لکھ دیا ہے۔ تم حاجیوں کی طرح تمام اعمال حج ادا کر لو بس بیت اللہ کا طواف نہ کرو، پھر جب ہم منیٰ میں تھے تو ہمارے پاس گائے کا گوشت لایا گیا۔ میں نے پوچھا کہ یہ کیا ہے؟ لوگوں نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گائے کی قربانی کی ہے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5549,
			"arabicnumber": 5549,
			"text": "ہم سے صدقہ نے بیان کیا، کہا ہم کو ابن علیہ نے خبر دی، انہیں ایوب نے، انہیں محمد بن سیرین نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے قربانی کے دن فرمایا کہ جس نے نماز عید سے پہلے قربانی ذبح کر لی ہے وہ دوبارہ قربانی کرے اس پر ایک صاحب نے کھڑے ہو کر عرض کیا: یا رسول اللہ! یہ وہ دن ہے جس میں گوشت کھانے کی خواہش ہوتی ہے پھر انہوں نے اپنے پڑوسیوں کا ذکر کیا اور ( کہا کہ ) میرے پاس ایک سال سے کم کا بکری کا بچہ ہے جس کا گوشت دو بکریوں کے گوشت سے بہتر ہے تو نبی کریم صلی اللہ علیہ وسلم نے انہیں اس کی اجازت دے دی۔ مجھے نہیں معلوم کہ یہ اجازت دوسروں کو بھی ہے یا نہیں۔ پھر نبی کریم صلی اللہ علیہ وسلم دو مینڈھوں کی طرف مڑے اور انہیں ذبح کیا پھر لوگ بکریوں کی طرف بڑھے اور انہیں تقسیم کر کے ( ذبح کیا ) ۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5550,
			"arabicnumber": 5550,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، کہا ہم سے ایوب سختیانی نے بیان کیا، ان سے محمد بن سیرین نے، ان سے ابن ابی بکرہ نے اور ان سے ابوبکر رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زمانہ پھر کر اسی حالت پر آ گیا ہے جس حالت پر اس دن تھا جس دن اللہ تعالیٰ نے آسمان و زمین پیدا کئے تھے۔ سال بارہ مہینہ کا ہوتا ہے ان میں چار حرمت کے مہینے ہیں، تین پے در پے ذی قعدہ، ذی الحجہ اور محرم اور ایک مضر کا رجب جو جمادی الاخریٰ اور شعبان کے درمیان میں پڑتا ہے۔ ( پھر آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ) یہ کون سا مہینہ ہے، ہم نے عرض کیا اللہ اور اس کے رسول زیادہ جانتے ہیں۔ آپ صلی اللہ علیہ وسلم خاموش ہو گئے۔ ہم نے سمجھا کہ شاید نبی کریم صلی اللہ علیہ وسلم اس کا کوئی اور نام رکھیں گے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کیا یہ ذی الحجہ نہیں ہے؟ ہم نے عرض کیا ذی الحجہ ہی ہے۔ پھر فرمایا یہ کون سا شہر ہے؟ ہم نے کہا کہ اللہ اور اس کے رسول کو اس کا زیادہ علم ہے۔ پھر نبی کریم صلی اللہ علیہ وسلم خاموش ہو گئے اور ہم نے سمجھا کہ شاید آپ اس کا کوئی اور نام رکھیں گے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کیا یہ بلدہ ( مکہ مکرمہ ) نہیں ہے؟ ہم نے عرض کیا کیوں نہیں۔ پھر آپ صلی اللہ علیہ وسلم نے دریافت فرمایا یہ دن کون سا ہے؟ ہم نے عرض کیا کہ اللہ اور اس کے رسول کو اس کا بہتر علم ہے۔ نبی کریم صلی اللہ علیہ وسلم خاموش ہو گئے اور ہم نے سمجھا کہ آپ اس کا کوئی اور نام تجویز کریں گے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کیا یہ قربانی کا دن ( یوم النحر ) نہیں ہے؟ ہم نے عرض کیا کیوں نہیں! پھر آپ صلی اللہ علیہ وسلم نے فرمایا پس تمہارا خون، تمہارے اموال۔ محمد بن سیرین نے بیان کیا کہ میرا خیال ہے کہ ( ابن ابی بکرہ نے ) یہ بھی کہا کہ اور تمہاری عزت تم پر ( ایک کی دوسرے پر ) اس طرح باحرمت ہیں جس طرح اس دن کی حرمت تمہارے اس شہر میں اور اس مہینہ میں ہے اور عنقریب اپنے رب سے ملو گے اس وقت وہ تم سے تمہارے اعمال کے بارے میں سوال کرے گا آ گاہ ہو جاؤ میرے بعد گمراہ نہ ہو جانا کہ تم میں سے بعض بعض دوسرے کی گردن مارنے لگے۔ ہاں جو یہاں موجود ہیں وہ ( میرا یہ پیغام ) غیر موجود لوگوں کو پہنچا دیں۔ ممکن ہے کہ بعض وہ جنہیں یہ پیغام پہنچایا جائے بعض ان سے زیادہ اسے محفوظ کرنے والے ہوں جو اسے سن رہے ہیں۔ اس پر محمد بن سیرین کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے سچ فرمایا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ آگاہ ہو جاؤ کیا میں نے ( اس کا پیغام تم کو ) پہنچا دیا ہے۔ آگاہ ہو جاؤ کیا میں نے پہنچا دیا ہے؟",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5551,
			"arabicnumber": 5551,
			"text": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا، کہا ہم سے خالد بن حارث نے بیان کیا، کہا ہم سے عبیداللہ نے بیان کیا اور ان سے نافع نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما قربان گاہ میں نحر کیا کرتے تھے اور عبیداللہ نے بیان کیا کہ مراد وہ جگہ ہے جہاں نبی کریم صلی اللہ علیہ وسلم قربانی کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5552,
			"arabicnumber": 5552,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے کثیر بن فرقد نے، ان سے نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم ( قربانی ) ذبح اور نحر عیدگاہ میں کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5553,
			"arabicnumber": 5553,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے عبدالعزیز بن صہیب نے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا کہ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم دو مینڈھوں کی قربانی کرتے تھے اور میں بھی دو مینڈھوں کی قربانی کرتا تھا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5554,
			"arabicnumber": 5554,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، ان سے ایوب نے، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم سینگ والے دو چتکبرے مینڈھوں کی طرف متوجہ ہوئے اور انہیں اپنے ہاتھ سے ذبح کیا۔ اس کی متابعت وہیب نے کی، ان سے ایوب نے اور اسماعیل اور حاکم بن وردان نے بیان کیا کہ ان سے ایوب نے، ان سے محمد بن سیرین نے اور ان سے انس رضی اللہ عنہ نے بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5555,
			"arabicnumber": 5555,
			"text": "ہم سے عمرو بن خالد نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے یزید نے، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ میں تقسیم کرنے کے لیے آپ کو کچھ قربانی کی بکریاں دیں انہوں نے انہیں تقسیم کیا پھر ایک سال سے کم کا ایک بچہ بچ گیا تو انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کا تذکرہ کیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کی قربانی تم کر لو۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5556,
			"arabicnumber": 5556,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، کہا ہم سے مطرف نے بیان کیا، ان سے عامر نے اور ان سے براء بن عازب رضی اللہ عنہ نے، انہوں نے بیان کیا کہ میرے ماموں ابوبردہ رضی اللہ عنہ نے عید کی نماز سے پہلے ہی قربانی کر لی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تمہاری بکری صرف گوشت کی بکری ہے۔ انہوں نے عرض کیا: یا رسول اللہ! میرے پاس ایک سال سے کم عمر کا ایک بکری کا بچہ ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اسے ہی ذبح کر لو لیکن تمہارے بعد ( اس کی قربانی ) کسی اور کے لیے جائز نہیں ہو گی پھر فرمایا جو شخص نماز عید سے پہلے قربانی کر لیتا ہے وہ صرف اپنے کھانے کو جانور ذبح کرتا ہے اور جو عید کی نماز کے بعد قربانی کرے اس کی قربانی پوری ہوتی ہے اور وہ مسلمانوں کی سنت کو پا لیتا ہے۔ اس روایت کی متابعت عبیدہ نے شعبی اور ابراہیم نے کی اور اس کی متابعت وکیع نے کی، ان سے حریث نے اور ان سے شعبی نے ( بیان کیا ) اور عاصم اور داؤد نے شعبی سے بیان کیا کہ ”میرے پاس ایک دودھ پیتی پٹھیا ہے۔“ اور زبید اور فراس نے شعبی سے بیان کیا کہ ”میرے پاس ایک سال سے کم عمر کا بچہ ہے۔“ اور ابوالاحوص نے بیان کیا، ان سے منصور نے بیان کیا کہ ”ایک سال سے کم کی پٹھیا۔“ اور ابن العون نے بیان کیا کہ ”ایک سال سے کم عمر کی دودھ پیتی پٹھیا ہے۔“",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5557,
			"arabicnumber": 5557,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے سلمہ نے، ان سے ابوجحیفہ نے اور ان سے براء رضی اللہ عنہ نے بیان کیا کہ ابوبردہ رضی اللہ عنہ نے نماز عید سے پہلے قربانی ذبح کر لی تھی تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اس کے بدلے میں دوسری قربانی کر لو۔ انہوں نے عرض کیا کہ میرے پاس ایک سال سے کم عمر کے بچے کے سوا اور کوئی جانور نہیں۔ شعبہ نے بیان کیا کہ میرا خیال ہے کہ ابوبردہ رضی اللہ عنہ نے یہ بھی کہا تھا کہ وہ ایک سال کی بکری سے بھی عمدہ ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اسی کی اس کے بدلے میں قربانی کر دو لیکن تمہارے بعد یہ کسی کے لیے کافی نہیں ہو گی۔ اور حاتم بن وردان نے بیان کیا، ان سے ایوب نے، ان سے محمد نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم سے آخر حدیث تک ( اس روایت میں یہ لفظ ہیں ) کہ ”ایک سال سے کم عمر کی بچی ہے۔“",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5558,
			"arabicnumber": 5558,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے قتادہ نے بیان کیا، ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے دو چتکبرے مینڈھوں کی قربانی کی۔ میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم اپنے پاؤں جانور کے اوپر رکھے ہوئے ہیں اور بسم اللہ واللہ اکبر پڑھ رہے ہیں۔ اس طرح آپ نے دونوں مینڈھوں کو اپنے ہاتھ سے ذبح کیا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5559,
			"arabicnumber": 5559,
			"text": "ہم سے قتیبہ نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے عبدالرحمٰن بن قاسم نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ مقام سرف میں رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے اور میں رو رہی تھی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کیا بات ہے، کیا تمہیں حیض آ گیا ہے؟ میں نے عرض کیا جی ہاں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو اللہ تعالیٰ نے آدم کی بیٹیوں کی تقدیر میں لکھ دیا ہے۔ اس لیے حاجیوں کی طرح تمام اعمال حج انجام دو صرف کعبہ کا طواب نہ کرو اور نبی کریم صلی اللہ علیہ وسلم نے اپنے بیویوں کی طرف سے گائے کی قربانی کی۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5560,
			"arabicnumber": 5560,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا کہ مجھے زبید نے خبر دی، کہا کہ میں نے شعبی سے سنا، ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم خطبہ دے رہے تھے۔ خطبہ میں آپ صلی اللہ علیہ وسلم نے فرمایا کہ آج کے دن کی ابتداء ہم نماز ( عید ) سے کریں گے پھر واپس آ کر قربانی کریں گے جو شخص اس طرح کرے گا وہ ہماری سنت کو پا لے گا لیکن جس نے ( عید کی نماز سے پہلے ) جانور ذبح کر لیا تو وہ ایسا گوشت ہے جسے اس نے اپنے گھر والوں کے کھانے کے لیے تیار کیا ہے وہ قربانی کسی درجہ میں بھی نہیں۔ ابوبردہ رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! میں نے تو عید کی نماز سے پہلے قربانی کر لی ہے البتہ میرے پاس ابھی ایک سال سے کم عمر کا ایک بکری کا بچہ ہے اور سال بھر کی بکری سے بہتر ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم اسی کی قربانی اس کے بدلہ میں کرو لیکن تمہارے بعد یہ کسی کے لیے جائز نہ ہو گا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5561,
			"arabicnumber": 5561,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا، ان سے ایوب نے، ان سے محمد نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے نماز سے پہلے قربانی کر لی ہو وہ دوبارہ قربانی کرے۔ اس پر ایک صحابی اٹھے اور عرض کیا: ( یا رسول اللہ! ) اس دن گوشت کی لوگوں کو خواہش زیادہ ہوتی ہے پھر انہوں نے اپنے پڑوسیوں کی محتاجی کا ذکر کیا جیسے نبی کریم صلی اللہ علیہ وسلم نے ان کا عذر قبول کر لیا ہو ( انہوں نے یہ بھی کہا کہ ) میرے پاس ایک سال کا ایک بچہ ہے اور بکریوں سے بھی اچھا ہے۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے انہیں اس کے قربانی کی اجازت دے دی لیکن مجھے اس کا علم نہیں کہ یہ اجازت دوسروں کو بھی تھی یا نہیں پھر نبی کریم صلی اللہ علیہ وسلم دو مینڈھوں کی طرف متوجہ ہوئے۔ ان کی مراد یہ تھی کہ انہیں نبی کریم صلی اللہ علیہ وسلم نے ذبح کیا پھر لوگ بکریوں کی طرف متوجہ ہوئے اور انہیں ذبح کیا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5562,
			"arabicnumber": 5562,
			"text": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے اسود بن قیس نے بیان کیا، کہا میں نے جندب بن سفیان بجلی رضی اللہ عنہ سے سنا کہ قربانی کے دن میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے نماز سے پہلے قربانی کر لی ہو وہ اس کی جگہ دوبارہ کرے اور جس نے قربانی ابھی نہ کی ہو وہ کرے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5563,
			"arabicnumber": 5563,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ نے، ان سے فراس نے، ان سے عامر نے، ان سے براء رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک دن نماز عید پڑھی اور فرمایا کہ جو ہماری طرح نماز پڑھتا ہو اور ہمارے قبلہ کو قبلہ بناتا ہو وہ نماز عید سے فارغ ہونے سے پہلے قربانی نہ کرے۔ اس پر ابوبردہ بن نیار رضی اللہ عنہ کھڑے ہوئے اور عرض کیا: یا رسول اللہ! میں نے تو قربانی کر لی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر وہ ایک ایسی چیز ہوئی جسے تم نے وقت سے پہلے ہی کر لیا ہے۔ انہوں نے عرض کیا میرے پاس ایک سال سے کم عمر کا ایک بچہ ہے جو ایک سال کی دو بکریوں سے عمدہ ہے کیا میں اسے ذبح کر لوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کر لو لیکن تمہارے بعد یہ کسی اور کے لیے جائز نہیں ہے۔ عامر نے بیان کیا کہ یہ ان کی بہترین قربانی تھی۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5564,
			"arabicnumber": 5564,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے ہمام نے بیان کیا، ان سے قتادہ نے، انہوں نے کہا کہ ہم سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سینگ والے دو چتکبرے مینڈھوں کی قربانی کیا کرتے تھے اور نبی کریم صلی اللہ علیہ وسلم اپنا پاؤں ان کی گردنوں کے اوپر رکھتے اور انہیں اپنے ہاتھ سے ذبح کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5565,
			"arabicnumber": 5565,
			"text": "ہم سے قتیبہ نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے سینگ والے دو چتکبرے مینڈھوں کی قربانی کی۔ انہیں اپنے ہاتھ سے ذبح کیا۔ بسم اللہ اور اللہ اکبر پڑھا اور اپنا پاؤں ان کی گردن کے اوپر رکھ کر ذبح کیا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5566,
			"arabicnumber": 5566,
			"text": "ہم سے احمد بن محمد نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، انہیں اسماعیل نے خبر دی، انہیں شعبی نے، انہیں مسروق نے کہ وہ عائشہ رضی اللہ عنہا کی خدمت میں آئے اور عرض کیا کہ ام المؤمنین! اگر کوئی شخص قربانی کا جانور کعبہ میں بھیج دے اور خود اپنے شہر میں مقیم ہو اور جس کے ذریعے بھیجے اسے اس کی وصیت کر دے کہ اس کے جانور کے گلے میں ( نشانی کے طور پر ) ایک قلادہ پہنا دیا جائے تو کیا اس دن سے وہ اس وقت تک کے لیے محرم ہو جائے گا جب تک حاجی اپنا احرام نہ کھول لیں۔ بیان کیا کہ اس پر میں نے پردے کے پیچھے ام المؤمنین کے اپنے ایک ہاتھ سے دوسرے ہاتھ پر مارنے کی آواز سنی اور انہوں نے کہا میں خود نبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے قلادے باندھتی تھی، نبی کریم صلی اللہ علیہ وسلم اسے کعبہ بھیجتے تھے لیکن لوگوں کے واپس ہونے تک نبی کریم صلی اللہ علیہ وسلم پر کوئی چیز حرام نہیں ہوتی تھی جو ان کے گھر کے دوسرے لوگوں کے لیے حلال ہو۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5567,
			"arabicnumber": 5567,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، ان سے سفیان نے بیان کیا کہ عمرو نے بیان کیا، انہیں عطاء نے خبر دی، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ مدینہ پہنچنے تک ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں قربانی کا گوشت جمع کرتے تھے اور کئی مرتبہ ( بجائے «لحوم الأضاحي» کے ) «لحوم الهدى‏.‏» کا لفظ استعمال کیا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5568,
			"arabicnumber": 5568,
			"text": "ہم سے اسماعیل نے بیان کیا، کہا کہ مجھ سے سلیمان نے بیان کیا، ان سے یحییٰ بن سعید نے، ان سے قاسم نے، انہیں ابن خزیمہ نے خبر دی، انہوں نے ابوسعید رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ وہ سفر میں تھے جب واپس آئے تو ان کے سامنے گوشت لایا گیا۔ کہا گیا کہ یہ ہماری قربانی کا گوشت ہے۔ ابوسعید رضی اللہ عنہ نے کہا کہ اسے ہٹاؤ میں اسے نہیں چکھوں گا۔ ابوسعید رضی اللہ عنہ نے بیان کیا کہ پھر اٹھ گیا اور گھر سے باہر نکل کر اپنے بھائی ابوقتادہ رضی اللہ عنہ کے پاس آیا وہ ماں کی طرف سے ان کے بھائی تھے اور بدر کی لڑائی میں شرکت کرنے والوں میں سے تھے۔ میں نے ان سے اس کا ذکر کیا اور انہوں نے کہا کہ تمہارے بعد حکم بدل گیا ہے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5569,
			"arabicnumber": 5569,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے یزید بن ابی عبید نے اور ان سے سلمہ بن الاکوع رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے تم میں سے قربانی کی تو تیسرے دن وہ اس حالت میں صبح کرے کہ اس کے گھر میں قربانی کے گوشت میں سے کچھ بھی باقی نہ ہو۔ دوسرے سال صحابہ کرام رضی اللہ عنہم نے عرض کیا: یا رسول اللہ! کیا ہم اس سال بھی وہی کریں جو پچھلے سال کیا تھا۔ ( کہ تین دن سے زیادہ قربانی کا گوشت بھی نہ رکھیں ) ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اب کھاؤ، کھلاؤ اور جمع کرو۔ پچھلے سال تو چونکہ لوگ تنگی میں مبتلا تھے، اس لیے میں نے چاہا کہ تم لوگوں کی مشکلات میں ان کی مدد کرو۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5570,
			"arabicnumber": 5570,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، کہا کہ مجھ سے میرے بھائی نے بیان کیا، ان سے سلیمان نے اور ان سے یحییٰ بن سعید نے، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ مدینہ میں ہم قربانی کے گوشت میں نمک لگا کر رکھ دیتے تھے اور پھر اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھی پیش کرتے تھے پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ قربانی کا گوشت تین دن سے زیادہ نہ کھایا کرو۔ یہ حکم ضروری نہیں تھا بلکہ آپ کا منشا یہ تھا کہ ہم قربانی کا گوشت ( ان لوگوں کو بھی جن کے یہاں قربانی نہ ہوئی ہو ) کھلائیں اور اللہ زیادہ جاننے والا ہے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5571,
			"arabicnumber": 5571,
			"text": "ہم سے حبان بن موسیٰ نے بیان کیا، انہوں نے کہا ہم کو عبداللہ نے خبر دی، انہوں نے کہا کہ مجھے یونس نے خبر دی، ان سے زہری نے، انہوں نے کہا کہ مجھے ابن ازہر کے غلام ابو عبید نے بیان کیا کہ وہ بقر عید کے دن عمر بن خطاب رضی اللہ عنہ کے ساتھ عیدگاہ میں موجود تھے۔ عمر رضی اللہ عنہ نے خطبہ سے پہلے عید کی نماز پڑھائی پھر لوگوں کے سامنے خطبہ دیا اور خطبہ میں فرمایا اے لوگو! رسول اللہ صلی اللہ علیہ وسلم نے تمہیں ان دو عیدوں میں روزہ رکھنے سے منع فرمایا ہے ایک وہ دن ہے جس دن تم ( رمضان کے ) روزے پورے کر کے افطار کرتے ہو ( عیدالفطر ) اور دوسرا تمہاری قربانی کا دن ہے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5572,
			"arabicnumber": 5572,
			"text": "ابو عبید نے بیان کیا کہ پھر میں عثمان بن عفان رضی اللہ عنہ کے ساتھ ( ان کی خلافت کے زمانہ میں عیدگاہ میں ) حاضر تھا۔ اس دن جمعہ بھی تھا۔ آپ نے خطبہ سے پہلے نماز عید پڑھائی پھر خطبہ دیا اور فرمایا کہ اے لوگو! آج کے دن تمہارے لیے دو عیدیں جمع ہو گئیں ہیں۔ ( عید اور جمعہ ) پس اطراف کے رہنے والوں میں سے جو شخص پسند کرے جمعہ کا بھی انتظار کرے اور اگر کوئی واپس جانا چاہے ( نماز عید کے بعد ہی ) تو وہ واپس جا سکتا ہے، میں نے اسے اجازت دے دی ہے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5573,
			"arabicnumber": 5573,
			"text": "ابوعبید نے بیان کیا کہ پھر میں عید کی نماز میں علی بن ابی طالب رضی اللہ عنہ کے ساتھ آیا۔ انہوں نے بھی نماز خطبہ سے پہلے پڑھائی پھر لوگوں کو خطبہ دیا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے تمہیں اپنی قربانی کا گوشت تین دن سے زیادہ کھانے کی ممانعت کی ہے اور معمر نے زہری سے اور ان سے ابوعبیدہ نے اسی طرح بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5574,
			"arabicnumber": 5574,
			"text": "ہم سے محمد بن عبدالرحیم نے بیان کیا، انہوں نے کہا ہم کو یعقوب بن ابراہیم بن سعد نے خبر دی، انہیں ابن شہاب کے بھتیجے نے، انہیں ان کے چچا ابن شہاب (محمد بن مسلم) نے، انہیں سالم نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ قربانی کا گوشت تین دن تک کھاؤ۔ عبداللہ بن عمر رضی اللہ عنہما منیٰ سے کوچ کرتے وقت روٹی زیتون کے تیل سے کھاتے کیونکہ وہ قربانی کے گوشت سے ( تین دن کے بعد ) پرہیز کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 30
			}
		}
	]
}