{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5970,
			"arabicnumber": 5970,
			"text": "ہم سے ابوالولید ہشام نے بیان کیا، کہا ہم سے شعبہ نے، انہوں نے کہا کہ مجھے ولید بن عیزار نے خبر دی، کہا کہ میں نے ابوعمرو شیبانی سے سنا، کہا کہ ہمیں اس گھر والے نے خبر دی اور انہوں نے اپنے ہاتھ سے عبداللہ بن مسعود رضی اللہ عنہ کے گھر کی طرف اشارہ کیا، انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا اللہ تعالیٰ کے نزدیک کون سا عمل سب سے زیادہ پسند ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وقت پر نماز پڑھنا۔ پوچھا کہ پھر کون سا؟ فرمایا کہ والدین کے ساتھ اچھا سلوک کرنا، پوچھا پھر کون سا؟ فرمایا کہ اللہ کے راستے میں جہاد کرنا۔ عبداللہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے ان کاموں کے متعلق بیان کیا اور اگر میں اسی طرح سوال کرتا رہتا تو آپ جواب دیتے رہتے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5971,
			"arabicnumber": 5971,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے عمارہ بن قعقاع بن شبرمہ نے، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ایک صحابی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ! میرے اچھے سلوک کا سب سے زیادہ حقدار کون ہے؟ فرمایا کہ تمہاری ماں ہے۔ پوچھا اس کے بعد کون ہے؟ فرمایا کہ تمہاری ماں ہے۔ انہوں نے پھر پوچھا اس کے بعد کون؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہاری ماں ہے۔ انہوں نے پوچھا اس کے بعد کون ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر تمہارا باپ ہے۔ ابن شبرمہ اور یحییٰ بن ایوب نے بیان کیا، کہا ہم سے ابوزرعہ نے اسی کے مطابق بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5972,
			"arabicnumber": 5972,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے سفیان اور شعبہ نے بیان کیا کہ ہم سے حبیب نے بیان کیا (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان نے خبر دی، انہیں حبیب نے، انہیں ابوعباس نے اور ان سے عبداللہ بن عمرو نے بیان کیا کہ ایک صحابی نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کیا میں بھی جہاد میں شریک ہو جاؤں؟ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے ماں باپ موجود ہیں انہوں نے کہا کہ جی ہاں موجود ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر انہیں میں جہاد کرو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5973,
			"arabicnumber": 5973,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ان کے والد نے، ان سے حمید بن عبدالرحمٰن نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یقیناً سب سے بڑے گناہوں میں سے یہ ہے کہ کوئی شخص اپنے والدین پر لعنت بھیجے۔ پوچھا گیا: یا رسول اللہ! کوئی شخص اپنے ہی والدین پر کیسے لعنت بھیجے گا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ شخص دوسرے کے باپ کو برا بھلا کہے گا تو دوسرا بھی اس کے باپ کو اور اس کی ماں کو برا بھلا کہے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5974,
			"arabicnumber": 5974,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم بن عقبہ نے بیان کیا، کہا کہ مجھے نافع نے خبر دی، انہیں ابن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تین آدمی چل رہے تھے کہ بارش نے انہیں آ لیا اور انہوں نے مڑ کر پہاڑی کی غار میں پناہ لی۔ اس کے بعد ان کے غار کے منہ پر پہاڑ کی ایک چٹان گری اور اس کا منہ بند ہو گیا۔ اب بعض نے بعض سے کہا کہ تم نے جو نیک کام کئے ہیں ان میں سے ایسے کام کو دھیان میں لاؤ جو تم نے خالص اللہ کے لیے کیا ہو تاکہ اللہ سے اس کے ذریعہ دعا کرو ممکن ہے وہ غار کو کھول دے۔ اس پر ان میں سے ایک نے کہا: اے اللہ! میرے والدین تھے اور بہت بوڑھے تھے اور میرے چھوٹے چھوٹے بچے بھی تھے۔ میں ان کے لیے بکریاں چراتا تھا اور واپس آ کر دودھ نکالتا تو سب سے پہلے اپنے والدین کو پلاتا تھا اپنے بچوں سے بھی پہلے۔ ایک دن چارے کی تلاش نے مجھے بہت دور لے جا ڈالا چنانچہ میں رات گئے واپس آیا۔ میں نے دیکھا کہ میرے والدین سو چکے ہیں۔ میں نے معمول کے مطابق دودھ نکالا پھر میں دوھا ہوا دودھ لے کر آیا اور ان کے سرہانے کھڑا ہو گیا میں گوارا نہیں کر سکتا تھا کہ انہیں سونے میں جگاؤں اور یہ بھی مجھ سے نہیں ہو سکتا تھا کہ والدین سے پہلے بچوں کو پلاؤں۔ بچے بھوک سے میرے قدموں پر لوٹ رہے تھے اور اسی کشمکش میں صبح ہو گئی۔ پس اے اللہ! اگر تیرے علم میں بھی یہ کام میں نے صرف تیری رضا حاصل کرنے کے لیے کیا تھا تو ہمارے لیے کشادگی پیدا کر دے کہ ہم آسمان دیکھ سکیں۔ اللہ تعالیٰ نے ( دعا قبول کی اور ) ان کے لیے اتنی کشادگی پیدا کر دی کہ وہ آسمان دیکھ سکتے تھے۔ دوسرے شخص نے کہا: اے اللہ! میری ایک چچا زاد بہن تھی اور میں اس سے محبت کرتا تھا، وہ انتہائی محبت جو ایک مرد ایک عورت سے کر سکتا ہے۔ میں نے اس سے اسے مانگا تو اس نے انکار کیا اور صرف اس شرط پر راضی ہوئی کہ میں اسے سو دینار دوں۔ میں نے دوڑ دھوپ کی اور سو دینار جمع کر لایا پھر اس کے پاس انہیں لے کر گیا پھر جب میں اس کے دونوں پاؤں کے درمیان میں بیٹھ گیا تو اس نے کہا کہ اے اللہ کے بندے! اللہ سے ڈر اور مہر کو مت توڑ۔ میں یہ سن کر کھڑا ہو گیا ( اور زنا سے باز رہا ) پس اگر تیرے علم میں بھی میں نے یہ کام تیری رضا و خوشنودی حاصل کرنے کے لیے کیا تھا تو ہمارے لیے کچھ اور کشادگی ( چٹان کو ہٹا کر ) پیدا کر دے۔ چنانچہ ان کے لیے تھوڑی سی اور کشادگی ہو گئی۔ تیسرے شخص نے کہا: اے اللہ! میں نے ایک مزدور ایک فرق چاول کی مزدوری پر رکھا تھا اس نے اپنا کام پورا کر کے کہا کہ میری مزدوری دو۔ میں نے اس کی مزدوری دے دی لیکن وہ چھوڑ کر چلا گیا اور اس کے ساتھ بےتوجہی کی۔ میں اس کے اس بچے ہوئے دھان کو بوتا رہا اور اس طرح میں نے اس سے ایک گائے اور اس کا چرواہا کر لیا ( پھر جب وہ آیا تو ) میں نے اس سے کہا کہ یہ گائے اور چرواہا لے جاؤ۔ اس نے کہا اللہ سے ڈرو اور میرے ساتھ مذاق نہ کرو۔ میں نے کہا کہ میں تمہارے ساتھ مذاق نہیں کرتا۔ اس گائے اور چرواہے کو لے جاؤ۔ چنانچہ وہ انہیں لے کر چلا گیا۔ پس اگر تیرے علم میں بھی میں نے یہ کام تیری رضا و خوشنودی حاصل کرنے کے لیے کیا تھا تو ( چٹان کی وجہ سے غار سے نکلنے میں جو رکاوٹ باقی رہ گئی ہے اسے بھی کھول دے۔ چنانچہ اللہ تعالیٰ نے ان کے لیے پوری طرح کشادگی کر دی جس سے وہ باہر آ گئے۔)",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5975,
			"arabicnumber": 5975,
			"text": "ہم سے سعد بن حفص نے بیان کیا، کہا ہم سے شیبان نے بیان کیا، ان سے منصور نے، ان سے مسیب نے ان سے وراد نے اور ان سے مغیرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے تم پر ماں کی نافرمانی حرام قرار دی ہے اور ( والدین کے حقوق ) نہ دینا اور ناحق ان سے مطالبات کرنا بھی حرام قرار دیا ہے، لڑکیوں کو زندہ دفن کرنا ( بھی حرام قرار دیا ہے ) اور «قيل وقال» ( فضول باتیں ) کثرت سوال اور مال کی بربادی کو بھی ناپسند کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5976,
			"arabicnumber": 5976,
			"text": "مجھ سے اسحاق بن شاہین واسطی نے بیان کیا، کہا ہم سے خالد واسطی نے بیان کیا، ان سے جریری نے، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا میں تمہیں سب سے بڑا گناہ نہ بتاؤں؟ ہم نے عرض کیا ضرور بتائیے یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا اور والدین کی نافرمانی کرنا۔ نبی کریم صلی اللہ علیہ وسلم اس وقت ٹیک لگائے ہوئے تھے اب آپ سیدھے بیٹھ گئے اور فرمایا آگاہ ہو جاؤ جھوٹی بات بھی اور جھوٹی گواہی بھی ( سب سے بڑے گناہ ہیں ) آگاہ ہو جاؤ جھوٹی بات بھی اور جھوٹی گواہی بھی۔ نبی کریم صلی اللہ علیہ وسلم اسے مسلسل دہراتے رہے اور میں نے سوچا کہ نبی کریم صلی اللہ علیہ وسلم خاموش نہیں ہوں گے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5977,
			"arabicnumber": 5977,
			"text": "مجھ سے محمد بن ولید نے بیان کیا، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، انہوں نے کہا کہ مجھ سے عبیداللہ بن ابی بکر نے بیان کیا، انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کبائر کا ذکر کیا یا ( انہوں نے کہا کہ ) نبی کریم صلی اللہ علیہ وسلم سے کبائر کے متعلق پوچھا گیا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا، کسی کی ( ناحق ) جان لینا، والدین کی نافرمانی کرنا پھر فرمایا کیا میں تمہیں سب سے بڑا گناہ نہ بتا دوں؟ فرمایا کہ جھوٹی بات یا فرمایا کہ جھوٹی شہادت ( سب سے بڑا گناہ ہے ) شعبہ نے بیان کیا کہ میرا غالب گمان یہ ہے کہ نبی کریم صلی اللہ علیہ وسلم نے جھوٹی گواہی فرمایا تھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5978,
			"arabicnumber": 5978,
			"text": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، کہا مجھ کو میرے والد نے خبر دی، انہیں اسماء بنت ابی بکر رضی اللہ عنہما نے خبر دی کہ میری والدہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں میرے پاس آئیں، وہ اسلام سے منکر تھیں۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کیا میں اس کے ساتھ صلہ رحمی کر سکتی ہوں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں۔ اس کے بعد اللہ تعالیٰ نے یہ آیت نازل کی «لا ينهاكم الله عن الذين لم يقاتلوكم في الدين‏» یعنی ”اللہ پاک تم کو ان لوگوں کے ساتھ نیک سلوک کرنے سے منع نہیں کرتا جو تم سے ہمارے دین کے متعلق کوئی لڑائی جھگڑا نہیں کرتے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5979,
			"arabicnumber": 5979,
			"text": "اور لیث نے بیان کیا کہ مجھ سے ہشام نے بیان کیا، ان سے عروہ نے اور ان سے اسماء رضی اللہ عنہا نے بیان کیا کہ میری والدہ مشرکہ تھیں وہ نبی کریم صلی اللہ علیہ وسلم کے قریش کے ساتھ صلح کے زمانہ میں اپنے والد کے ساتھ ( مدینہ منورہ ) آئیں۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے ان کے متعلق پوچھا کہ میری والدہ آئی ہیں اور وہ اسلام سے الگ ہیں ( کیا میں ان کے ساتھ صلہ رحمی کر سکتی ہوں؟ ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اپنی والدہ کے ساتھ صلہ رحمی کرو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5980,
			"arabicnumber": 5980,
			"text": "ہم سے یحییٰ نے بیان کیا، انہوں نے کہا ہم سے لیث نے بیان کیا، ان سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے عبیداللہ بن عبداللہ نے اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی اور انہیں ابوسفیان رضی اللہ عنہ نے خبر دی کہ ہرقل نے انہیں بلا بھیجا تو انہوں نے اسے بتایا کہ وہ یعنی نبی کریم صلی اللہ علیہ وسلم ہمیں نماز، صدقہ، پاک دامنی اور صلہ رحمی کا حکم فرماتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5981,
			"arabicnumber": 5981,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے عبدالعزیز بن مسلم نے بیان کیا، کہا ہم سے عبداللہ بن دینار نے بیان کیا، کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ عمر رضی اللہ عنہ نے سیراء کا ( ایک ریشمی ) حلہ بکتے دیکھا تو عرض کیا: یا رسول اللہ! آپ اسے خرید لیں اور جمعہ کے دن اور جب آپ کے پاس وفود آئیں تو اسے پہنا کریں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے تو وہی پہن سکتا ہے جس کا ( آخرت میں ) کوئی حصہ نہ ہو۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم کے پاس اسی قسم کے کئی حلے آئے تو نبی کریم صلی اللہ علیہ وسلم نے اس میں سے ایک حلہ عمر رضی اللہ عنہ کے لیے بھیجا۔ عمر رضی اللہ عنہ نے عرض کیا کہ میں اسے کیسے پہن سکتا ہوں جبکہ نبی کریم صلی اللہ علیہ وسلم اس کے متعلق پہلے ممانعت فرما چکے ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تمہیں پہننے کے لیے نہیں دیا بلکہ اس لیے دیا ہے کہ تم اسے بیچ دو یا کسی دوسرے کو پہنا دو چنانچہ عمر رضی اللہ عنہ نے وہ حلہ اپنے ایک بھائی کو بھیج دیا جو مکہ مکرمہ میں تھے اور اسلام نہیں لائے تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5982,
			"arabicnumber": 5982,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا کہ مجھے ابن عثمان نے خبر دی، کہا کہ میں نے موسیٰ بن طلحہ سے سنا اور ان سے ابوایوب رضی اللہ عنہ نے بیان کیا، کہا گیا کہ یا رسول اللہ! کوئی ایسا عمل بتائیں جو مجھے جنت میں لے جائے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5983,
			"arabicnumber": 5983,
			"text": "(دوسری سند) امام بخاری رحمہ اللہ نے کہا کہ مجھ سے عبدالرحمٰن بن بشر نے بیان کیا، ان سے بہز بن اسد بصریٰ نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے ابن عثمان بن عبداللہ بن موہب اور ان کے والد عثمان بن عبداللہ نے بیان کیا کہ انہوں نے موسیٰ بن طلحہ سے سنا اور انہوں نے ابوایوب انصاری رضی اللہ عنہ سے کہ ایک صاحب نے کہا: یا رسول اللہ! کوئی ایسا عمل بتائیں جو مجھے جنت میں لے جائے۔ اس پر لوگوں نے کہا کہ اسے کیا ہو گیا ہے، اسے کیا ہو گیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیوں ہو کیا گیا ہے؟ اجی اس کو ضرورت ہے بیچارہ اس لیے پوچھتا ہے۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اللہ کی عبادت کر اور اس کے ساتھ کسی اور کو شریک نہ کر، نماز قائم کر، زکوٰۃ دیتے رہو اور صلہ رحمی کرتے رہو۔ ( بس یہ اعمال تجھ کو جنت میں لے جائیں گے ) چل اب نکیل چھوڑ دے۔ راوی نے کہا شاید اس وقت نبی کریم صلی اللہ علیہ وسلم اپنی اونٹنی پر سوار تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5984,
			"arabicnumber": 5984,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے محمد بن جبیر بن مطعم نے بیان کیا اور انہیں ان کے والد جبیر بن مطعم رضی اللہ عنہ نے خبر دی انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ قطع رحمی کرنے والا جنت میں نہیں جائے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5985,
			"arabicnumber": 5985,
			"text": "مجھ سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا ہم سے محمد بن معن نے بیان کیا، انہوں نے کہا کہ مجھ سے میرے والد نے بیان کیا، انہوں نے کہا ہم سے سعید بن ابی سعید نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جسے پسند ہے کہ اس کی روزی میں فراخی ہو اور اس کی عمردراز کی جائے تو وہ صلہ رحمی کیا کرے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5986,
			"arabicnumber": 5986,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے بیان کیا، کہا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو چاہتا ہو کہ اس کے رزق میں فراخی ہو اور اس کی عمردراز ہو تو وہ صلہ رحمی کیا کرے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5987,
			"arabicnumber": 5987,
			"text": "مجھ سے بشر بن محمد نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو معاویہ بن ابی مزرد نے خبر دی، کہا کہ میں نے اپنے چچا سعید بن یسار سے سنا، وہ ابوہریرہ رضی اللہ عنہ سے بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے فرمایا اللہ تعالیٰ نے مخلوق پیدا کی اور جب اس سے فراغت ہوئی تو رحم نے عرض کیا کہ یہ اس شخص کی جگہ ہے جو قطع رحمی سے تیری پناہ مانگے۔ اللہ تعالیٰ نے فرمایا کہ ہاں کیا تم اس پر راضی نہیں کہ میں اس سے جوڑوں گا جو تم سے اپنے آپ کو جوڑے اور اس سے توڑ لوں گا جو تم سے اپنے آپ کو توڑ لے؟ رحم نے کہا کیوں نہیں، اے رب! اللہ تعالیٰ نے فرمایا کہ پس یہ تجھ کو دیا۔ رسول اللہ صلی اللہ علیہ وسلم نے اس کے بعد فرمایا کہ اگر تمہارا جی چاہے تو یہ آیت پڑھ لو «فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏» یعنی ”کچھ عجیب نہیں کہ اگر تم کو حکومت مل جائے تو تم ملک میں فساد برپا کرو اور رشتے ناطے توڑ ڈالو۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5988,
			"arabicnumber": 5988,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، کہا ہم سے عبداللہ بن دینار نے، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ رحم کا تعلق رحمن سے جڑا ہوا ہے پس جو کوئی اس سے اپنے آپ کو جوڑتا ہے اللہ پاک نے فرمایا کہ میں بھی اس کو اپنے سے جوڑ لیتا ہوں اور جو کوئی اسے توڑتا ہے میں بھی اپنے آپ کو اس سے توڑ لیتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5989,
			"arabicnumber": 5989,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا ہم سے سلیمان بن بلال نے، انہوں نے کہا مجھ کو معاویہ بن ابی مزرد نے خبر دی، انہوں نے یزید بن رومان سے، انہوں نے عروہ سے، ام المؤمنین انہوں نے عائشہ رضی اللہ عنہا سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ رحم ( رشتہ داری رحمن سے ملی ہوئی ) شاخ ہے جو شخص اس سے ملے میں اس سے ملتا ہوں اور جو اس سے قطع تعلق کرے میں اس سے قطع تعلق کرتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5990,
			"arabicnumber": 5990,
			"text": "ہم سے عمرو بن عباس نے بیان کیا، انہوں نے کہا مجھ سے محمد بن جعفر نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے اسماعیل بن ابی خالد نے بیان کیا، ان سے قیس بن ابی حازم نے بیان کیا، ان سے عمرو بن العاص رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا کہ فلاں کی اولاد ( یعنی ابوسفیان بن حکم بن عاص یا ابولہب کی اولاد ) یہ عمرو بن عباس نے کہا کہ محمد بن جعفر کی کتاب میں اس وہم پر سفید جگہ خالی تھی ( یعنی تحریر نہ تھی ) میرے عزیز نہیں ہیں ( گو ان سے نسبی رشتہ ہے ) میرا ولی تو اللہ ہے اور میرے عزیز تو ولی ہیں جو مسلمانوں میں نیک اور پرہیزگار ہیں ( گو ان سے نسبی رشتہ بھی نہ ہو ) ۔ عنبسہ بن عبدالواحد نے بیان بن بشر سے، انہوں نے قیس سے، انہوں نے عمرو بن العاص سے اتنا بڑھایا ہے کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ نے فرمایا البتہ ان سے میرا رشتہ ناطہٰ ہے اگر وہ تر رکھیں گے تو میں بھی تر رکھوں گا یعنی وہ ناطہٰ جوڑیں گے تو میں بھی جوڑوں گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5991,
			"arabicnumber": 5991,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، انہیں اعمش اور حسن بن عمرو اور فطر بن خلیفہ نے، ان سے مجاہد بن جبیر نے اور ان سے عبداللہ بن عمرو رضی اللہ عنہما نے سفیان سے، کہا کہ اعمش نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم تک مرفوع نہیں بیان کی لیکن حسن اور فطر نے نبی کریم صلی اللہ علیہ وسلم سے مرفوعاً بیان کیا، فرمایا کہ کسی کام کا بدلہ دینا صلہ رحمی نہیں ہے بلکہ صلہ رحمی کرنے والا وہ ہے کہ جب اس کے ساتھ صلہ رحمی کا معاملہ نہ کیا جا رہا ہو تب بھی وہ صلہ رحمی کرے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5992,
			"arabicnumber": 5992,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے کہا کہ مجھے عروہ بن زبیر نے خبر دی اور انہیں حکیم بن حزام نے خبر دی، انہوں نے عرض کیا کہ یا رسول اللہ! آپ کا ان کاموں کے بارے میں کیا خیال ہے جنہیں میں عبادت سمجھ کر زمانہ جاہلیت میں کرتا تھا مثلاً صلہ رحمی، غلام کی آزادی، صدقہ، کیا مجھے ان پر ثواب ملے گا؟ حکیم رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہے تم ان تمام اعمال خیر کے ساتھ اسلام لائے ہو جو پہلے کر چکے ہو۔ اور بعضوں نے ابوالیمان سے بجائے «اتحنث» کے «اتحت» ( تاء کے ساتھ ) روایت کیا ہے اور معمر اور صالح اور ابن مسافر نے بھی «اتحت» روایت کیا ہے۔ ابن اسحاق نے کہا «اتحنث»،‏‏‏‏ «تحت» سے نکلا ہے اس کے معنی مثل اور عبادت کرنا۔ ہشام نے بھی اپنے والد عروہ سے ان لوگوں کی متابعت کی ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5993,
			"arabicnumber": 5993,
			"text": "ہم سے حبان بن موسیٰ نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں خالد بن سعید نے، انہیں ان کے والد نے، ان سے ام خالد بنت سعید رضی اللہ عنہما نے بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اپنے والد کے ساتھ حاضر ہوئی۔ میں ایک زرد قمیص پہنے ہوئے تھی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ”سنہ سنہ“ عبداللہ بن مبارک نے کہا کہ یہ حبشی زبان میں ”اچھا“ کے معنی میں ہے۔ ام خالد نے بیان کیا کہ پھر میں نبی کریم صلی اللہ علیہ وسلم کی خاتم نبوت سے کھیلنے لگی تو میرے والد نے مجھے ڈانٹا لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے کھیلنے دو پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم ایک زمانہ تک زندہ رہو گی اللہ تعالیٰ تمہاری عمر خوب طویل کرے، تمہاری زندگی دراز ہو۔ عبداللہ نے بیان کیا چنانچہ انہوں نے بہت ہی طویل عمر پائی اور ان کی طول عمر کے چرچے ہونے لگے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5994,
			"arabicnumber": 5994,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے مہدی نے بیان کیا، کہا ہم سے ابن یعقوب نے بیان کیا، ان سے ابونعیم نے بیان کیا کہ میں ابن عمر رضی اللہ عنہما کی خدمت میں موجود تھا ان سے ایک شخص نے ( حالت احرام میں ) مچھر کے مارنے کے متعلق پوچھا ( کہ اس کا کیا کفارہ ہو گا ) ابن عمر رضی اللہ عنہما نے دریافت فرمایا کہ تم کہاں کے ہو؟ اس نے بتایا کہ عراق کا، فرمایا کہ اس شخص کو دیکھو، ( مچھر کی جان لینے کے تاوان کا مسئلہ پوچھتا ہے ) حالانکہ اس کے ملک والوں نے رسول اللہ صلی اللہ علیہ وسلم کے نواسہ کو ( بےتکلف قتل کر ڈالا ) میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ یہ دونوں ( حسن اور حسین رضی اللہ عنہما ) دنیا میں میرے دو پھول ہیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5995,
			"arabicnumber": 5995,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، کہا مجھ سے عبداللہ بن ابی بکر نے بیان کیا، انہیں عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ میرے یہاں ایک عورت ( اور ) اس کے ساتھ دو بچیاں تھیں، وہ مانگنے آئی تھی۔ میرے پاس سے سوا ایک کھجور کے اسے اور کچھ نہ ملا۔ میں نے اسے وہ کھجور دے دی اور اس نے وہ کھجور اپنی دونوں لڑکیوں کو تقسیم کر دی۔ پھر اٹھ کر چلی گئی اس کے بعد نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص بھی اس طرح کی لڑکیوں کی پرورش کرے گا اور ان کے ساتھ اچھا معاملہ کرے گا تو یہ اس کے لیے جہنم سے پردہ بن جائیں گی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5996,
			"arabicnumber": 5996,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، کہا ہم سے سعید مقبری نے بیان کیا، کہا ہم سے عمرو بن سلیم نے بیان کیا، کہا ہم سے ابوقتادہ رضی اللہ عنہ نے بیان کیا، کہا کہ نبی کریم صلی اللہ علیہ وسلم باہر تشریف لائے اور امامہ بنت ابی العاص ( جو بچی تھیں ) وہ آپ کے شانہ مبارک پر تھیں پھر نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھی جب آپ رکوع کرتے تو انہیں اتار دیتے اور جب کھڑے ہوتے تو پھر اٹھا لیتے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5997,
			"arabicnumber": 5997,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، انہیں زہری نے خبر دی، ان سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے حسن بن علی رضی اللہ عنہ کو بوسہ دیا۔ نبی کریم صلی اللہ علیہ وسلم کے پاس اقرع بن حابس رضی اللہ عنہ بیٹھے ہوئے تھے۔ اقرع رضی اللہ عنہ نے اس پر کہا کہ میرے دس لڑکے ہیں اور میں نے ان میں سے کسی کو بوسہ نہیں دیا۔ نبی کریم صلی اللہ علیہ وسلم نے ان کی طرف دیکھا اور فرمایا کہ جو اللہ کی مخلوق پر رحم نہیں کرتا اس پر بھی رحم نہیں کیا جاتا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5998,
			"arabicnumber": 5998,
			"text": "ہم سے محمد بن یوسف نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے ہشام نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک دیہاتی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہا آپ لوگ بچوں کو بوسہ دیتے ہیں، ہم تو انہیں بوسہ نہیں دیتے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر اللہ نے تمہارے دل سے رحم نکال دیا ہے تو میں کیا کر سکتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5999,
			"arabicnumber": 5999,
			"text": "ہم سے ابن ابی مریم نے بیان کیا، کہا ہم سے ابوغسان نے، کہا کہ مجھ سے زید بن اسلم نے، ان سے ان کے والد نے اور ان سے عمر بن خطاب رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے پاس کچھ قیدی آئے قیدیوں میں ایک عورت تھی جس کا پستان دودھ سے بھرا ہوا تھا اور وہ دوڑ رہی تھی، اتنے میں ایک بچہ اس کو قیدیوں میں ملا اس نے جھٹ اپنے پیٹ سے لگا لیا اور اس کو دودھ پلانے لگی۔ ہم سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم خیال کر سکتے ہو کہ یہ عورت اپنے بچے کو آگ میں ڈال سکتی ہے ہم نے عرض کیا کہ نہیں جب تک اس کو قدرت ہو گی یہ اپنے بچے کو آگ میں نہیں پھینک سکتی۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اللہ اپنے بندوں پر اس سے بھی زیادہ رحم کرنے والا ہے جتنا یہ عورت اپنے بچہ پر مہربان ہو سکتی ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6000,
			"arabicnumber": 6000,
			"text": "ہم سے حکم بن نافع نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، کہا ہم کو سعید بن مسیب نے خبر دی کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے رحمت کے سو حصے بنائے اور اپنے پاس ان میں سے ننانوے حصے رکھے صرف ایک حصہ زمین پر اتارا اور اسی کی وجہ سے تم دیکھتے ہو کہ مخلوق ایک دوسرے پر رحم کرتی ہے، یہاں تک کہ گھوڑی بھی اپنے بچہ کو اپنے سم نہیں لگنے دیتی بلکہ سموں کو اٹھا لیتی ہے کہ کہیں اس سے اس کے بچہ کو تکلیف نہ پہنچے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6001,
			"arabicnumber": 6001,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، انہیں منصور بن معتمر نے، انہیں ابووائل نے، انہیں عمرو بن شرحبیل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ میں نے کہا: یا رسول اللہ! کون سا گناہ سب سے بڑا ہے۔ فرمایا یہ کہ تم اللہ تعالیٰ کا کسی کو شریک بناؤ حالانکہ اسی نے تمہیں پیدا کیا ہے۔ انہوں نے کہا پھر، اس کے بعد فرمایا یہ کہ تم اپنے لڑکے کو اس خوف سے قتل کرو کہ اگر زندہ رہا تو تمہاری روزی میں شریک ہو گا۔ انہوں نے کہا اس کے بعد، نبی کریم صلی اللہ علیہ وسلم نے فرمایا یہ کہ تم اپنے پڑوسی کی بیوی سے زنا کرو۔ چنانچہ اللہ تعالیٰ نے بھی نبی کریم صلی اللہ علیہ وسلم کے اس ارشاد کی تائید میں یہ آیت «والذين لا يدعون مع الله إلها آخر‏» الخ، نازل کی کہ ”اور وہ لوگ جو اللہ کے سوا کسی دوسرے معبود کو نہیں پکارتے اور نہ وہ ناحق کسی کو قتل کرتے ہیں اور نہ وہ زنا کرتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6002,
			"arabicnumber": 6002,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے ہشام نے بیان کیا، کہا مجھ کو میرے والد عروہ نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک بچہ ( عبداللہ بن زبیر ) کو اپنی گود میں بٹھلایا اور کھجور چبا کر اس کے منہ میں دی، اس نے آپ پر پیشاب کر دیا آپ نے پانی منگوا کر اس پر بہا دیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6003,
			"arabicnumber": 6003,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا ہم سے عارم محمد بن فضل نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے بیان کیا، کہا کہ ان سے ان کے والد نے بیان کیا، کہا کہ میں نے ابو تمیمہ سے سنا، وہ ابوعثمان نہدی سے بیان کرتے تھے اور ابوعثمان نہدی نے کہا کہ ان سے اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم مجھے اپنی ایک ران پر بٹھاتے تھے اور حسن رضی اللہ عنہ کو دوسری ران پر بٹھلاتے تھے۔ پھر دونوں کو ملاتے اور فرماتے، اے اللہ! ان دونوں پر رحم کر کہ میں بھی ان پر رحم کرتا ہوں۔ اور علی بن عبداللہ مدینی نے بیان کیا کہ ہم سے یحییٰ نے بیان کیا، کہا ہم سے سلیمان تیمی نے بیان کیا، ان سے ابوعثمان نہدی نے اسی حدیث کو بیان کیا۔ سلیمان تیمی نے کہا جب ابو تمیمہ نے یہ حدیث مجھ سے بیان کی ابوعثمان نہدی سے تو میرے دل میں شک پیدا ہوا۔ میں نے ابوعثمان سے بہت سی احادیث سنی ہیں پر یہ حدیث کیوں نہیں سنی پھر میں نے اپنی احادیث کی کتاب دیکھی تو اس میں یہ حدیث ابوعثمان نہدی سے لکھی ہوئی تھی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6004,
			"arabicnumber": 6004,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ مجھے کسی عورت پر اتنا رشک نہیں آتا تھا جتنا خدیجہ رضی اللہ عنہا پر آتا تھا حالانکہ وہ نبی کریم صلی اللہ علیہ وسلم کی مجھ سے شادی سے تین سال پہلے وفات پا چکی تھیں۔ ( رشک کی وجہ یہ تھی ) کہ نبی کریم صلی اللہ علیہ وسلم کو میں کثرت سے ان کا ذکر کرتے سنتی تھی اور نبی کریم صلی اللہ علیہ وسلم کو ان کے رب نے حکم دیا تھا کہ خدیجہ کو جنت میں ایک خولدار موتیوں کے گھر کی خوشخبری سنا دیں۔ نبی کریم صلی اللہ علیہ وسلم کبھی بکری ذبح کرتے پھر اس میں سے خدیجہ رضی اللہ عنہا کی سہیلیوں کو حصہ بھیجتے تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6005,
			"arabicnumber": 6005,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، کہا کہ مجھ سے عبدالعزیز بن ابی حازم نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، کہا کہ میں نے سہل بن سعد رضی اللہ عنہ سے سنا، ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں اور یتیم کی پرورش کرنے والا جنت میں اس طرح ہوں گے اور آپ نے شہادت اور درمیانی انگلیوں کے اشارہ سے ( قرب کو ) بتایا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6006,
			"arabicnumber": 6006,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے صفوان بن سلیم تابعی اس حدیث کو مرسلاً روایت کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بیواؤں اور مسکینوں کے لیے کوشش کرنے والا اللہ کے راستہ میں جہاد کرنے والے کی طرح ہے یا اس شخص کی طرح ہے جو دن میں روزے رکھتا ہے اور رات کو عبادت کرتا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6007,
			"arabicnumber": 6007,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، ان سے ثور بن زید نے، ان سے ابوالغیث نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ بیواؤں اور مسکینوں کے لیے کوشش کرنے والا اللہ کے راستے میں جہاد کرنے والے کی طرح ہے۔ عبداللہ قعنبی کو اس میں شک ہے۔ امام مالک نے اس حدیث میں یہ بھی کہا تھا اس شخص کے برابر ثواب ملتا ہے جو نماز میں کھڑا رہتا ہے تھکتا ہی نہیں اور اس شخص کے برابر جو روزے برابر رکھے چلا جاتا ہے افطار ہی نہیں کرتا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6008,
			"arabicnumber": 6008,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے اسماعیل بن علیہ نے بیان کیا، کہا ہم سے ایوب سختیانی نے بیان کیا، ان سے ابوقلابہ نے، ان سے ابوسلیمان مالک بن حویرث رضی اللہ عنہ نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں مدینہ حاضر ہوئے اور ہم سب نوجوان اور ہم عمر تھے۔ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ بیس دنوں تک رہے۔ پھر نبی کریم صلی اللہ علیہ وسلم کو خیال ہوا کہ ہمیں اپنے گھر کے لوگ یاد آ رہے ہوں گے اور نبی کریم صلی اللہ علیہ وسلم نے ہم سے ان کے متعلق پوچھا جنہیں ہم اپنے گھروں پر چھوڑ کر آئے تھے۔ ہم نے نبی کریم صلی اللہ علیہ وسلم کو سارا حال سنا دیا۔ آپ بڑے ہی نرم خو اور بڑے رحم کرنے والے تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنے گھروں کو واپس جاؤ اور اپنے ملک والوں کو دین سکھاؤ اور بتاؤ اور تم اس طرح نماز پڑھو جس طرح تم نے مجھے نماز پڑھتے دیکھا ہے اور جب نماز کا وقت آ جائے تو تم میں سے ایک شخص تمہارے لیے اذان دے پھر جو تم میں بڑا ہو وہ امامت کرائے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6009,
			"arabicnumber": 6009,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا مجھ سے امام مالک نے بیان کیا، ان سے ابوبکر کے غلام سمی نے، ان سے ابوصالح سمان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص راستہ میں چل رہا تھا کہ اسے شدت کی پیاس لگی اسے ایک کنواں ملا اور اس نے اس میں اتر کر پانی پیا۔ جب باہر نکلا تو وہاں ایک کتا دیکھا جو ہانپ رہا تھا اور پیاس کی وجہ سے تری کو چاٹ رہا تھا۔ اس شخص نے کہا کہ یہ کتا بھی اتنا ہی زیادہ پیاسا معلوم ہو رہا ہے جتنا میں تھا۔ چنانچہ وہ پھر کنویں میں اترا اور اپنے جوتے میں پانی بھرا اور منہ سے پکڑ کر اوپر لایا اور کتے کو پانی پلایا۔ اللہ تعالیٰ نے اس کے اس عمل کو پسند فرمایا اور اس کی مغفرت کر دی۔ صحابہ کرام رضی اللہ عنہم نے عرض کیا کہ یا رسول اللہ! کیا ہمیں جانوروں کے ساتھ نیکی کرنے میں بھی ثواب ملتا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں ہر تازہ کلیجے والے پر نیکی کرنے میں ثواب ملتا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6010,
			"arabicnumber": 6010,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم ایک نماز کے لیے کھڑے ہوئے اور ہم بھی نبی کریم صلی اللہ علیہ وسلم کے ساتھ کھڑے ہوئے۔ نماز پڑھتے ہی ایک دیہاتی نے کہا: اے اللہ! مجھ پر رحم کر اور محمد ( صلی اللہ علیہ وسلم ) پر اور ہمارے ساتھ کسی اور پر رحم نہ کر۔ جب نبی کریم صلی اللہ علیہ وسلم نے سلام پھیرا تو دیہاتی سے فرمایا کہ تم نے ایک وسیع چیز کو تنگ کر دیا آپ کی مراد اللہ کی رحمت سے تھی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6011,
			"arabicnumber": 6011,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے زکریا نے بیان کیا، ان سے عامر نے کہا کہ میں نے انہیں یہ کہتے سنا ہے کہ میں نے نعمان بن بشیر سے سنا، وہ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم مومنوں کو آپس میں ایک دوسرے کے ساتھ رحمت و محبت کا معاملہ کرنے اور ایک دوسرے کے ساتھ لطف و نرم خوئی میں ایک جسم جیسا پاؤ گے کہ جب اس کا کوئی ٹکڑا بھی تکلیف میں ہوتا ہے، تو سارا جسم تکلیف میں ہوتا ہے ایسا کہ نیند اڑ جاتی ہے اور جسم بخار میں مبتلا ہو جاتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6012,
			"arabicnumber": 6012,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اگر کوئی مسلمان کسی درخت کا پودا لگاتا ہے اور اس درخت سے کوئی انسان یا جانور کھاتا ہے تو لگانے والے کے لیے وہ صدقہ ہوتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6013,
			"arabicnumber": 6013,
			"text": "ہم سے عمر بن حفص نے بیان کیا، انہوں نے کہا ہم سے ہمارے والد نے بیان کیا، ان سے اعمش نے بیان کیا، انہوں نے کہا کہ مجھ سے زید بن وہب نے بیان کیا، انہوں نے کہا کہ میں نے جریر بن عبداللہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جو رحم نہیں کرتا اس پر رحم نہیں کیا جاتا۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6014,
			"arabicnumber": 6014,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے یحییٰ بن سعید نے کہا کہ مجھے ابوبکر بن محمد نے خبر دی، انہیں عمرہ نے اور انہیں عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جبرائیل علیہ السلام مجھے پڑوسی کے بارے میں باربار اس طرح وصیت کرتے رہے کہ مجھے خیال گزرا کہ شاید پڑوسی کو وراثت میں شریک نہ کر دیں۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6015,
			"arabicnumber": 6015,
			"text": "ہم سے محمد بن منہال نے بیان کیا، کہا ہم سے یزید بن زریع نے بیان کیا، ان سے عمر بن محمد نے، ان سے ان کے والد نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جبرائیل علیہ السلام مجھے اس طرح باربار پڑوسی کے حق میں وصیت کرتے رہے کہ مجھے خیال گزرا کہ شاید پڑوسی کو وراثت میں شریک نہ کر دیں۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6016,
			"arabicnumber": 6016,
			"text": "ہم سے عاصم بن علی نے بیان کیا، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا، ان سے سعید نے بیان کیا، ان سے ابوشریح نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان کیا ”واللہ! وہ ایمان والا نہیں۔ واللہ! وہ ایمان والا نہیں۔ واللہ! وہ ایمان والا نہیں۔ عرض کیا گیا کون: یا رسول اللہ؟ فرمایا وہ جس کے شر سے اس کا پڑوسی محفوظ نہ ہو۔ اس حدیث کو شبابہ اور اسد بن موسیٰ نے بھی روایت کیا ہے اور حمید بن اسود اور عثمان بن عمر اور ابوبکر بن عیاش اور شعیب بن اسحاق نے اس حدیث کو ابن ابی ذئب سے یوں روایت کیا ہے، انہوں نے مقبری سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6017,
			"arabicnumber": 6017,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث نے بیان کیا، کہا ہم سے سعید نے بیان کیا وہ سعید مقبری ہیں، ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم فرمایا کرتے تھے ”اے مسلمان عورتو! تم میں سے کوئی عورت اپنی کسی پڑوسن کے لیے کسی بھی چیز کو ( ہدیہ میں ) دینے کے لیے حقیر نہ سمجھے خواہ بکری کا پایہ ہی کیوں نہ ہو۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6018,
			"arabicnumber": 6018,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے ابوالاحوص نے بیان، ان سے ابوحصین نے، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جو کوئی اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اپنے پڑوسی کو تکلیف نہ پہنچائے اور جو کوئی اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اپنے مہمان کی عزت کرے اور جو کوئی اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اچھی بات زبان سے نکالے ورنہ خاموش رہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6019,
			"arabicnumber": 6019,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، انہوں نے کہا کہ مجھ سے سعید مقبری نے بیان کیا، ان سے ابوشریح عدوی رضی اللہ عنہ نے بیان کیا انہوں نے کہا کہ میرے کانوں نے سنا اور میری آنکھوں نے دیکھا جب رسول اللہ صلی اللہ علیہ وسلم گفتگو فرما رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اپنے پڑوسی کا اکرام کرے اور جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اپنے مہمان کی دستور کے موافق ہر طرح سے عزت کرے۔ پوچھا: یا رسول اللہ! دستور کے موافق کب تک ہے۔ فرمایا ایک دن اور ایک رات اور میزبانی تین دن کی ہے اور جو اس کے بعد ہو وہ اس کے لیے صدقہ ہے اور جو اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ بہتر بات کہے یا خاموش رہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6020,
			"arabicnumber": 6020,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا کہ مجھے ابوعمران نے خبر دی، کہا کہ میں نے طلحہ سے سنا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا: یا رسول اللہ! میری پڑوسنیں ہیں ( اگر ہدیہ ایک ہو تو ) میں ان میں سے کس کے پاس ہدیہ بھیجوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”جس کا دروازہ تم سے ( تمہارے دروازے سے ) زیادہ قریب ہو۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6021,
			"arabicnumber": 6021,
			"text": "ہم سے علی بن عیاش نے بیان کیا، انہوں نے کہا ہم سے ابوغسان نے بیان کیا، انہوں نے کہا مجھ سے محمد بن منکدر نے بیان کیا، ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ہر نیک کام صدقہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6022,
			"arabicnumber": 6022,
			"text": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے، ان سے سعید بن ابی بردہ بن ابی موسیٰ اشعری نے بیان کیا، ان سے ان کے والد نے اور ان سے ان کے دادا (ابوموسیٰ اشعری رضی اللہ عنہ) نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ہر مسلمان پر صدقہ کرنا ضروری ہے۔“ صحابہ کرام رضی اللہ عنہم نے عرض کیا اگر کوئی چیز کسی کو ( صدقہ کے لیے ) جو میسر نہ ہو۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اپنے ہاتھ سے کام کرے اور اس سے خود کو بھی فائدہ پہنچائے اور صدقہ بھی کرے۔ صحابہ کرام رضی اللہ عنہم نے عرض کی اگر اس میں اس کی طاقت نہ ہو یا کہا کہ نہ کر سکے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر کسی حاجت مند پریشان حال کی مدد کرے۔ صحابہ کرام رضی اللہ عنہم نے عرض کیا اگر وہ یہ بھی نہ کر سکے۔ فرمایا کہ پھر بھلائی کی طرف لوگوں کو رغبت دلائے یا امر بالمعروف کا کرنا عرض کیا اور اگر یہ بھی نہ کر سکے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر برائی سے رکا رہے کہ یہ بھی اس کے لیے صدقہ ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6023,
			"arabicnumber": 6023,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے، کہا کہ مجھے عمرو نے خبر دی، انہیں خیثمہ نے اور ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے جہنم کا ذکر کیا اور اس سے پناہ مانگی اور چہرے سے اعراض و ناگواری کا اظہار کیا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے جہنم کا ذکر کیا اور اس سے پناہ مانگی اور چہرے سے اعراض و ناگواری کا اظہار کیا، شعبہ نے بیان کیا کہ دو مرتبہ نبی کریم صلی اللہ علیہ وسلم کے جہنم سے پناہ مانگنے کے سلسلے میں مجھے کوئی شک نہیں ہے۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جہنم سے بچو۔ خواہ آدھی کھجور ہی ( کسی کو ) صدقہ کر کے ہو سکے اور اگر کسی کو یہ بھی میسر نہ ہو تو اچھی بات کر کے ہی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6024,
			"arabicnumber": 6024,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن سعید نے بیان کیا، ان سے صالح نے، ان سے ابن شہاب نے اور ان سے عروہ بن زبیر نے کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ کچھ یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا «السام عليكم‏.‏» ( تمہیں موت آئے ) عائشہ رضی اللہ عنہا نے بیان کیا کہ میں اس کا مفہوم سمجھ گئی اور میں نے ان کا جواب دیا کہ «وعليكم السام واللعنة‏.‏» ( یعنی تمہیں موت آئے اور لعنت ہو ) بیان کیا کہ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، ٹھہرو، اے عائشہ! اللہ تعالیٰ تمام معاملات میں نرمی اور ملائمت کو پسند کرتا ہے۔ میں نے عرض کیا: یا رسول اللہ! کیا آپ نے سنا نہیں انہوں نے کیا کہا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اس کا جواب دے دیا تھا کہ «وعليكم» ( اور تمہیں بھی ) ۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6025,
			"arabicnumber": 6025,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ثابت نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہا کہ ایک دیہاتی نے مسجد میں پیشاب کر دیا تھا۔ صحابہ کرام ان کی طرف دوڑے لیکن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے پیشاب کو مت روکو۔ پھر آپ نے پانی کا ڈول منگوایا اور وہ پیشاب کی جگہ پر بہا دیا گیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6027,
			"arabicnumber": 6027,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6028,
			"arabicnumber": 6028,
			"text": "ہم سے محمد بن العلاء نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے برید نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم کے پاس جب کوئی مانگنے والا یا ضرورت مند آتا تو آپ صلی اللہ علیہ وسلم فرماتے کہ لوگو! تم سفارش کرو تاکہ تمہیں بھی ثواب ملے اور اللہ اپنے نبی کی زبان پر جو چاہے گا فیصلہ کرائے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6029,
			"arabicnumber": 6029,
			"text": "ہم سے حفص بن عمر بن حارث ابوعمرو حوش نے بیان کیا، کہا ہم سے شعبہ بن حجاج نے بیان کیا، ان سے سلیمان نے، انہوں نے ابووائل شقیق بن سلمہ سے سنا، انہوں نے مسروق سے سنا، انہوں نے بیان کیا کہ عمر رضی اللہ عنہ نے کہا (دوسری سند) امام بخاری رحمہ اللہ نے کہا ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے اعمش نے، ان سے شقیق بن سلمہ نے اور ان سے مسروق نے بیان کیا کہ جب معاویہ رضی اللہ عنہ کے ساتھ عبداللہ بن عمرو بن عاص کوفہ تشریف لائے تو ہم ان کی خدمت میں حاضر ہوئے۔ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کا ذکر کیا اور بتلایا کہ نبی کریم صلی اللہ علیہ وسلم بدگو نہ تھے اور نہ آپ بدزبان تھے اور انہوں نے یہ بھی بیان کیا کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سب سے بہتر وہ آدمی ہے، جس کے اخلاق سب سے اچھے ہوں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6030,
			"arabicnumber": 6030,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو عبدالوہاب ثقفی نے خبر دی، انہیں ایوب سختیانی نے، انہیں عبداللہ بن ابی ملیکہ نے اور انہیں عائشہ رضی اللہ عنہا نے کہ کچھ یہودی رسول اللہ صلی اللہ علیہ وسلم کے یہاں آئے اور کہا «السام عليكم‏.‏» ( تم پر موت آئے ) اس پر عائشہ رضی اللہ عنہا نے کہا «عليكم،‏‏‏‏ ولعنكم الله،‏‏‏‏ وغضب الله عليكم‏.‏» کہ تم پر بھی موت آئے اور اللہ کی تم پر لعنت ہو اور اس کا غضب تم پر نازل ہو۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ( ٹھہرو ) عائشہ! تمہیں نرم خوئی اختیار کرنے چاہیے سختی اور بد زبانی سے بچنا چاہیئے۔ عائشہ رضی اللہ عنہا نے عرض کیا: یا رسول اللہ! آپ نے ان کی بات نہیں سنی، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم نے انہیں میرا جواب نہیں سنا، میں نے ان کی بات انہیں پر لوٹا دی اور ان کے حق میں میری بددعا قبول ہو جائے گی۔ لیکن میرے حق میں ان کی بددعا قبول ہی نہ ہو گی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6031,
			"arabicnumber": 6031,
			"text": "ہم سے اصبغ بن فرج نے بیان کیا، انہوں نے کہا کہ مجھے عبداللہ بن وہب نے خبر دی انہوں نے کہا ہم کو ابویحییٰ فلیح بن سلیمان نے خبر دی، انہیں ہلال بن اسامہ نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نہ گالی دیتے تھے نہ بدگو تھے نہ بدخو تھے اور نہ لعنت ملامت کرتے تھے۔ اگر ہم میں سے کسی پر ناراض ہوتے اتنا فرماتے اسے کیا ہو گیا ہے، اس کی پیشانی میں خاک لگے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6032,
			"arabicnumber": 6032,
			"text": "ہم سے عمرو بن عیسیٰ نے بیان کیا، کہا ہم سے محمد بن سواء نے بیان کیا، کہا ہم سے روح ابن قاسم نے بیان کیا، ان سے محمد بن منکدر نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم سے ایک شخص نے اندر آنے کی اجازت چاہی۔ نبی کریم صلی اللہ علیہ وسلم نے اسے دیکھ کر فرمایا کہ برا ہے فلاں قبیلہ کا بھائی۔ یا ( آپ صلی اللہ علیہ وسلم نے فرمایا ) کہ برا ہے فلاں قبیلہ کا بیٹا۔ پھر جب وہ نبی کریم صلی اللہ علیہ وسلم کے پاس آ بیٹھا تو آپ اس کے ساتھ بہت خوش خلقی کے ساتھ پیش آئے۔ وہ شخص جب چلا گیا تو عائشہ رضی اللہ عنہا نے آپ سے عرض کیا: یا رسول اللہ! جب آپ نے اسے دیکھا تھا تو اس کے متعلق یہ کلمات فرمائے تھے، جب آپ اس سے ملے تو بہت ہی خندہ پیشانی سے ملے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اے عائشہ! تم نے مجھے بدگو کب پایا۔ اللہ کے یہاں قیامت کے دن وہ لوگ بدترین ہوں گے جن کے شر کے ڈر سے لوگ اس سے ملنا چھوڑ دیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6033,
			"arabicnumber": 6033,
			"text": "ہم سے عمرو بن عون نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سب سے زیادہ خوبصورت، سب سے زیادہ سخی اور سب سے زیادہ بہادر تھے۔ ایک رات مدینہ والے ( شہر کے باہر شور سن کر ) گھبرا گئے۔ ( کہ شاید دشمن نے حملہ کیا ہے ) سب لوگ اس شور کی طرف بڑھے۔ لیکن نبی کریم صلی اللہ علیہ وسلم آواز کی طرف بڑھنے والوں میں سب سے آگے تھے اور فرماتے جاتے تھے کہ کوئی ڈر کی بات نہیں، کوئی ڈر کی بات نہیں۔ نبی کریم صلی اللہ علیہ وسلم اس وقت ابوطلحہ کے ( مندوب نامی ) گھوڑے کی ننگی پیٹھ پر سوار تھے، اس پر کوئی زین نہیں تھی اور گلے میں تلوار لٹک رہی تھی۔ آپ نے فرمایا کہ میں نے اس گھوڑے کو سمندر پایا یا فرمایا کہ یہ تیز دوڑنے میں سمندر کی طرح تھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6034,
			"arabicnumber": 6034,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان نے خبر دی، ان سے ابن منکدر نے بیان کیا، انہوں نے جابر رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ کبھی ایسا نہیں ہوا کہ رسول اللہ صلی اللہ علیہ وسلم سے کسی نے کوئی چیز مانگی ہو اور آپ نے اس کے دینے سے انکار کیا ہو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6035,
			"arabicnumber": 6035,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا مجھ سے میرے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا مجھ سے شفیق نے بیان کیا، ان سے مسروق نے بیان کیا کہ ہم عبداللہ بن عمرو کے پاس بیٹھے ہوئے تھے، وہ ہم سے باتیں کر رہے تھے اسی دوران انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نہ بدگو تھے نہ بد زبانی کرتے تھے ( کہ منہ سے گالیاں نکالیں ) بلکہ آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے کہ تم میں سب سے زیادہ بہتر وہ ہے جس کے اخلاق سب سے اچھے ہوں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6036,
			"arabicnumber": 6036,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم سے ابوغسان (محمد بن مطرف) نے بیان کیا کہ کہا مجھ سے ابوحازم نے بیان کیا، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ ایک خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ”بردہ“ لے کر آئیں پھر سہل نے موجود لوگوں سے کہا تمہیں معلوم ہے، کہ بردہ کیا چیز ہے؟ لوگوں نے کہا کہ بردہ شملہ کو کہتے ہیں۔ سہل رضی اللہ عنہ نے کہا کہ ہاں لنگی جس میں حاشیہ بنا ہوا ہوتا ہے تو اس خاتون نے عرض کیا کہ یا رسول اللہ! میں یہ لنگی آپ کے پہننے کے لیے لائی ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے وہ لنگی ان سے قبول کر لی۔ اس وقت آپ کو اس کی ضرورت بھی تھی پھر آپ نے پہن لیا۔ صحابہ میں سے ایک صحابی عبدالرحمٰن بن عوف رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کے بدن پروہ لنگی دیکھی تو عرض کیا: یا رسول اللہ! یہ بڑی عمدہ لنگی ہے، آپ مجھے اس کو عنایت فرما دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ لے لو، جب نبی کریم صلی اللہ علیہ وسلم وہاں سے اٹھ کر تشریف لے گئے تو اندر جا کر وہ لنگی بدل کر تہہ کر کے عبدالرحمٰن کو بھیج دی تو لوگوں نے ان صاحب کو ملامت سے کہا کہ تم نے نبی کریم صلی اللہ علیہ وسلم سے لنگی مانگ کر اچھا نہیں کیا، تم نے دیکھ لیا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے اسے اس طرح قبول کیا تھا گویا آپ کو اس کی ضرورت تھی۔ اس کے باوجود تم نے لنگی نبی کریم صلی اللہ علیہ وسلم سے مانگی، حالانکہ تمہیں معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم سے جب بھی کوئی چیز مانگی جاتی ہے تو آپ انکار نہیں کرتے۔ اس صحابی نے عرض کیا کہ میں تو صرف اس کی برکت کا امیدوار ہوں کہ نبی کریم صلی اللہ علیہ وسلم اسے پہن چکے تھے میری غرض یہ تھی کہ میں اس لنگی میں کفن دیا جاؤں گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6037,
			"arabicnumber": 6037,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے کہا کہ مجھے حمید بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”زمانہ جلدی جلدی گزرے گا اور دین کا علم دنیا میں کم ہو جائے گا اور دلوں میں بخیلی سما جائے گی اور لڑائی بڑھ جائے گی۔“ صحابہ رضی اللہ عنہم نے عرض کیا «هرج» کیا ہوتا ہے؟ فرمایا قتل خون ریزی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6038,
			"arabicnumber": 6038,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے سلام بن مسکین سے سنا، کہا کہ میں نے ثابت سے سنا، کہا کہ ہم سے انس رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی دس سال تک خدمت کی لیکن آپ نے کبھی مجھے اف تک نہیں کہا اور نہ کبھی یہ کہا کہ فلاں کام کیوں کیا اور فلاں کام کیوں نہیں کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6039,
			"arabicnumber": 6039,
			"text": "ہم سے حفص بن عمر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے حکم نے، ان سے ابراہیم نخعی نے، ان سے اسود نے بیان کیا کہ میں نے عائشہ رضی اللہ عنہا سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم اپنے گھر میں کیا کرتے تھے؟ فرمایا نبی کریم صلی اللہ علیہ وسلم اپنے گھر کے کام کاج کرتے اور جب نماز کا وقت ہو جاتا تو نماز کے لیے مسجد تشریف لے جاتے تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6040,
			"arabicnumber": 6040,
			"text": "ہم سے عمرو بن علی نے بیان کیا، کہا ہم سے ابوعاصم نے، ان سے ابن جریج نے، کہا مجھ کو موسیٰ بن عقبہ نے خبر دی، انہیں نافع نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جب اللہ کسی بندہ سے محبت کرتا ہے تو جبرائیل علیہ السلام کو آواز دیتا ہے کہ اللہ فلاں بندے سے محبت کرتا ہے تم بھی اس سے محبت کرو۔ جبرائیل علیہ السلام بھی اس سے محبت کرنے لگتے ہیں، پھر وہ تمام آسمان والوں میں آواز دیتے ہیں کہ اللہ فلاں بندے سے محبت کرتا ہے۔ تم بھی اس سے محبت کرو۔ پھر تمام آسمان والے اس سے محبت کرنے لگتے ہیں۔ اس کے بعد وہ زمین میں بھی ( اللہ کے بندوں کا ) مقبول اور محبوب بن جاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6041,
			"arabicnumber": 6041,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کوئی شخص ایمان کی حلاوت ( مٹھاس ) اس وقت تک نہیں پا سکتا جب تک وہ کسی شخص سے محبت کرئے تو صرف اللہ کے لیے کرے اور اس کو آگ میں ڈالا جانا اچھا لگے لیکن ایمان کے بعد کفر میں جانا اسے پسند نہ ہو، اور جب تک اللہ اور اس کے رسول سے اسے ان کے سوا دوسری تمام چیزوں کے مقابلے میں زیادہ محبت نہ ہو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6042,
			"arabicnumber": 6042,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عبداللہ بن زمعہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے کسی کی ریح خارج ہونے پر ہنسنے سے منع فرمایا اور آپ نے یہ بھی فرمایا کہ تم میں سے کس طرح ایک شخص اپنی بیوی کو زور سے مارتا ہے جیسے اونٹ، حالانکہ اس کی پوری امید ہے کہ شام میں اسے وہ گلے لگائے گا۔ اور ثوری، وہیب اور ابومعاویہ نے ہشام سے بیان کیا کہ ( جانور کی طرح ) کے بجائے لفظ غلام کی طرح کا استعمال کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6043,
			"arabicnumber": 6043,
			"text": "مجھ سے محمد بن مثنیٰ نے بیان کیا، انہوں نے کہا ہم سے یزید بن ہارون نے بیان کیا، انہوں نے کہا ہم کو عاصم بن محمد بن زید نے خبر دی، انہوں نے کہا مجھے میرے والد اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ( حجۃ الوداع ) کے موقع پر منیٰ میں فرمایا تم جانتے ہو یہ کون سا دن ہے؟ صحابہ بولے اللہ اور اس کے رسول کو زیادہ علم ہے۔ فرمایا یہ حرمت والا دن ہے ( پھر فرمایا ) تم جانتے ہو یہ کون سا شہر ہے؟ صحابہ بولے اللہ اور اس رسول کو زیادہ علم ہے، فرمایا یہ حرمت والا شہر ہے۔ ( پھر فرمایا ) تم جانتے ہو یہ کون سا مہینہ ہے؟ صحابہ بولے اللہ اور اس کے رسول کو زیادہ علم ہے، فرمایا یہی حرمت والا مہینہ ہے۔ پھر فرمایا بلاشبہ اللہ نے تم پر تمہارا ( ایک دوسرے کا ) خون، مال اور عزت اسی طرح حرام کیا ہے جیسے اس دن کو اس نے تمہارے اس مہینہ میں اور تمہارے اس شہر میں حرمت والا بنایا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6044,
			"arabicnumber": 6044,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے منصور نے بیان کیا، کہا میں نے ابووائل سے سنا اور وہ عبداللہ بن مسعود رضی اللہ عنہ سے بیان کرتے تھے کہ انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مسلمان کو گالی دینا گناہ ہے اور اس کو قتل کرنا کفر ہے۔“ غندر نے شعبہ سے روایت کرنے میں سلیمان کی متابعت کی ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6045,
			"arabicnumber": 6045,
			"text": "ہم سے ابومعمر عبداللہ بن عمرو نے بیان کیا، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا، ان سے حسین بن ذکوان معلم نے بیان کیا، ان سے عبداللہ بن بریدہ نے بیان کیا، انہوں نے کہا مجھ سے یحییٰ بن یعمر نے بیان کیا، ان سے ابوالاسود دیلی نے بیان کیا اور ان سے ابوذر غفاری رضی اللہ عنہ نے کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی شخص کسی شخص کو کافر یا فاسق کہے اور وہ درحقیقت کافر یا فاسق نہ ہو تو خود کہنے والا فاسق اور کافر ہو جائے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6046,
			"arabicnumber": 6046,
			"text": "ہم سے محمد بن سنان نے بیان کیا، کہا ہم سے فلیح بن سلیمان نے بیان کیا کہا ہم سے ہلال بن علی نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم فحش گو نہیں تھے، نہ آپ لعنت ملامت کرنے والے تھے اور نہ گالی دیتے تھے، آپ کو بہت غصہ آتا تو صرف اتنا کہہ دیتے، اسے کیا ہو گیا ہے، اس کی پیشانی پہ خاک لگے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6047,
			"arabicnumber": 6047,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے عثمان بن عمر نے، کہا ہم سے علی بن مبارک نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے، ان سے ابوقلابہ نے کہ ثابت بن ضحاک رضی اللہ عنہ اصحاب شجر ( بیعت رضوان کرنے والوں ) میں سے تھے، انہوں نے ان سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو اسلام کے سوا کسی اور مذہب پر قسم کھائے ( کہ اگر میں نے فلاں کام کیا تو میں نصرانی ہوں، یہودی ہوں ) تو وہ ایسا ہو جائے گا جیسے کہ اس نے کہا اور کسی انسان پر ان چیزوں کی نذر صحیح نہیں ہوتی جو اس کے اختیار میں نہ ہوں اور جس نے دنیا میں کسی چیز سے خودکشی کر لی اسے اسی چیز سے آخرت میں عذاب ہو گا اور جس نے کسی مسلمان پر لعنت بھیجی تو یہ اس کے خون کرنے کے برابر ہے اور جو شخص کسی مسلمان کو کافر کہے تو وہ ایسا ہے جیسے اس کا خون کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6048,
			"arabicnumber": 6048,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا کہ مجھ سے عدی بن ثابت نے بیان کیا کہ میں نے سلیمان بن صرد سے سنا وہ نبی کریم صلی اللہ علیہ وسلم کے صحابی ہیں، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کے سامنے دو آدمیوں نے آپس میں گالی گلوچ کی ایک صاحب کو غصہ آ گیا اور بہت زیادہ آیا، ان کا چہرہ پھول گیا اور رنگ بدل دیا گیا۔ نبی کریم صلی اللہ علیہ وسلم نے اس وقت فرمایا کہ مجھے ایک کلمہ معلوم ہے کہ اگر ( غصہ کرنے والا شخص ) اسے کہہ لے تو اس کا غصہ دور ہو جائے گا۔ چنانچہ ایک صاحب نے جا کر غصہ ہونے والے کو نبی کریم صلی اللہ علیہ وسلم کا ارشاد سنایا اور کہا شیطان سے اللہ کی پناہ مانگ وہ کہنے لگا کیا تم مجھ کو روگی سمجھتے ہو یا دیوانہ؟ جا اپنا راستہ لے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6049,
			"arabicnumber": 6049,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے بشر بن مفضل نے بیان کیا، ان سے حمید نے بیان کیا، ان سے انس رضی اللہ عنہ نے بیان کیا کہ مجھ سے عبادہ بن صامت رضی اللہ عنہ نے کہا، نبی کریم صلی اللہ علیہ وسلم لوگوں کو لیلۃ القدر کی بشارت دینے کے لیے حجرے سے باہر تشریف لائے، لیکن مسلمانوں کے دو آدمی اس وقت آپس میں کسی بات پر لڑنے لگے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہیں ( لیلۃ القدر کے متعلق ) بتانے کے لیے نکلا تھا لیکن فلاں فلاں آپس میں لڑنے لگے اور ( میرے علم سے ) وہ اٹھا لی گئی۔ ممکن ہے کہ یہی تمہارے لیے اچھا ہو۔ اب تم اسے 29 رمضان اور 27 رمضان اور 25 رمضان کی راتوں میں تلاش کرو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6050,
			"arabicnumber": 6050,
			"text": "مجھ سے عمر بن حفص بن غیاث نے بیان کیا، کہا مجھ سے میرے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، ان سے معرور نے اور ان سے ابوذر رضی اللہ عنہ نے، معرور نے بیان کیا کہ میں نے ابوذر رضی اللہ عنہ کے جسم پر ایک چادر دیکھی اور ان کے غلام کے جسم پر بھی ایک ویسی ہی چادر تھی، میں نے عرض کیا: اگر اپنے غلام کی چادر لے لیں اور اسے بھی پہن لیں تو ایک رنگ کا جوڑا ہو جائے غلام کو دوسرا کپڑا دے دیں۔ ابوذر رضی اللہ عنہ نے اس پر کہا کہ مجھ میں اور ایک صاحب ( بلال رضی اللہ عنہ ) میں تکرار ہو گئی تھی تو ان کی ماں عجمی تھیں، میں نے اس بارے میں ان کو طعنہ دے دیا انہوں نے جا کر یہ بات نبی کریم صلی اللہ علیہ وسلم سے کہہ دی۔ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا کیا تم نے اس سے جھگڑا کیا ہے؟ میں نے عرض کیا جی ہاں۔ دریافت کیا تم نے اسے اس کی ماں کی وجہ سے طعنہ دیا ہے؟ میں نے عرض کیا جی ہاں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے اندر ابھی جاہلیت کی بو باقی ہے۔ میں نے عرض کیا: یا رسول اللہ! اس بڑھاپے میں بھی؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں یاد رکھو یہ ( غلام بھی ) تمہارے بھائی ہیں، اللہ تعالیٰ نے انہیں تمہاری ماتحتی میں دیا ہے، پس اللہ تعالیٰ جس کی ماتحتی میں بھی اس کے بھائی کو رکھے اسے چاہئے کہ جو وہ کھائے اسے بھی کھلائے اور جو وہ پہنے اسے بھی پہنائے اور اسے ایسا کام کرنے کے لیے نہ کہے، جو اس کے بس میں نہ ہو اگر اسے کوئی ایسا کام کرنے کے لیے کہنا ہی پڑے تو اس کام میں اس کی مدد کرے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6051,
			"arabicnumber": 6051,
			"text": "ہم سے حفص بن عمر حوضی نے بیان کیا، کہا ہم سے یزید بن ابراہیم نے بیان کیا، کہا ہم سے محمد بن سیرین نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ہمیں ظہر کی نماز دو رکعت پڑھائی اور سلام پھیر دیا اس کے بعد آپ مسجد کے آگے کے حصہ یعنی دالان میں ایک لکڑی پر سہارا لے کر کھڑے ہو گئے اور اس پر اپنا ہاتھ رکھا، حاضرین میں ابوبکر اور عمر رضی اللہ عنہما بھی موجود تھے مگر آپ کے دبدبے کی وجہ سے کچھ بول نہ سکے اور جلد باز لوگ مسجد سے باہر نکل گئے آپس میں صحابہ نے کہا کہ شاید نماز میں رکعات کم ہو گئیں ہیں اسی لیے نبی کریم صلی اللہ علیہ وسلم نے ظہر کی نماز چار کے بجائے صرف دو ہی رکعات پڑھائیں ہیں۔ حاضرین میں ایک صحابی تھے جنہیں آپ ذوالیدین ( لمبے ہاتھوں والا ) کہہ کر مخاطب فرمایا کرتے تھے، انہوں نے عرض کیا: اے اللہ کے نبی! نماز کی رکعات کم ہو گئیں ہیں یا آپ بھول گئے ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہ میں بھولا ہوں اور نہ نماز کی رکعات کم ہوئیں ہیں۔ صحابہ نے عرض کیا: نہیں یا رسول اللہ! آپ بھول گئے ہیں، چنانچہ آپ نے یاد کر کے فرمایا کہ ذوالیدین نے صحیح کہا ہے۔ پھر آپ کھڑے ہوئے اور دو رکعات اور پڑھائیں پھر سلام پھیرا اور تکبیر کہہ کر سجدہ ( سجدہ سہو ) میں گئے، نماز کے سجدہ کی طرح بلکہ اس سے بھی زیادہ لمبا سجدہ کیا پھر سر اٹھایا اور تکبیر کہہ کر پھر سجدہ میں گئے پہلے سجدہ کی طرح یا اس سے بھی لمبا، پھر سر اٹھایا اور تکبیر کہی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6052,
			"arabicnumber": 6052,
			"text": "ہم سے یحییٰ بن موسیٰ بلخی نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ان سے اعمش نے بیان کیا، انہوں نے مجاہد سے سنا، وہ طاؤس سے بیان کرتے تھے اور وہ ابن عباس رضی اللہ عنہما سے، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم دو قبروں کے پاس سے گزرے اور فرمایا کہ ان دونوں مردوں کو عذاب ہو رہا ہے اور یہ کسی بڑے گناہ کی وجہ سے عذاب میں گرفتار نہیں ہیں بلکہ یہ ( ایک قبر کا مردہ ) اپنے پیشاب کی چھینٹوں سے نہیں بچتا تھا ( یا پیشاب کرتے وقت پردہ نہیں کرتا تھا ) اور یہ ( دوسری قبر والا مردہ ) چغل خور تھا، پھر آپ صلی اللہ علیہ وسلم نے ایک ہری شاخ منگائی اور اسے دو ٹکڑوں میں توڑ کر دونوں قبروں پر گاڑ دیا اس کے بعد فرمایا کہ جب تک یہ شاخیں سوکھ نہ جائیں اس وقت تک شاید ان دونوں کا عذاب ہلکا رہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6053,
			"arabicnumber": 6053,
			"text": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ابوالزناد نے، ان سے ابوسلمہ نے اور ان سے ابواسید ساعدی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”قبیلہ انصار میں سب سے بہتر گھرانہ بنو نجار کا گھرانہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6054,
			"arabicnumber": 6054,
			"text": "ہم سے صدقہ بن فضل نے بیان کیا، انہوں نے کہا ہم کو سفیان بن عیینہ نے خبر دی، انہوں نے محمد بن منکدر سے سنا، انہوں نے عروہ بن زبیر سے سنا اور انہیں ام المؤمنین عائشہ رضی اللہ عنہا نے خبر دی، انہوں نے بیان کیا کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے اندر آنے کی اجازت چاہی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے اجازت دے دو، فلاں قبیلہ کا یہ برا آدمی ہے جب وہ شخص اندر آیا تو آپ نے اس کے ساتھ بڑی نرمی سے گفتگو کی۔ میں نے عرض کیا: یا رسول اللہ! آپ کو اس کے متعلق جو کچھ کہنا تھا وہ ارشاد فرمایا اور پھر اس کے ساتھ نرم گفتگو کی۔ آپ صلی اللہ علیہ وسلم نے فرمایا، عائشہ! وہ بدترین آدمی ہے جسے اس کی بدکلامی کے ڈر سے لوگ ( اسے ) چھوڑ دیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6055,
			"arabicnumber": 6055,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو عبیدہ بن عبدالرحمٰن نے خبر دی، انہیں منصور بن معمر نے، انہیں مجاہد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم مدینہ منورہ کے کسی باغ سے تشریف لائے تو آپ نے دو ( مردہ ) انسانوں کی آواز سنی جنہیں ان کی قبروں میں عذاب دیا جا رہا تھا پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں عذاب ہو رہا ہے اور کسی بڑے گناہ کی وجہ سے انہیں عذاب نہیں ہو رہا ہے۔ ان میں سے ایک شخص پیشاب کے چھینٹوں سے نہیں بچتا تھا اور دوسرا چغل خور تھا۔ پھر آپ صلی اللہ علیہ وسلم نے کھجور کی ایک ہری شاخ منگوائی اور اسے دو حصوں میں توڑا اور ایک ٹکڑا ایک کی قبر پر اور دوسرا دوسرے کی قبر پر گاڑ دیا۔ پھر فرمایا شاید کہ ان کے عذاب میں اس وقت تک کے لیے کمی کر دی جائے، جب تک یہ سوکھ نہ جائیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6056,
			"arabicnumber": 6056,
			"text": "ہم سے ابونعیم (فضل بن دکین) نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے منصور بن معمر نے، ان سے ابراہیم نخعی نے، ان سے ہمام بن حارث نے بیان کیا کہ ہم حذیفہ رضی اللہ عنہ کے پاس موجود تھے، ان سے کہا گیا کہ ایک شخص ایسا ہے جو یہاں کی باتیں عثمان سے جا لگاتا ہے۔ اس پر حذیفہ رضی اللہ عنہ نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم نے بتلایا کہ جنت میں چغل خور نہیں جائے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6057,
			"arabicnumber": 6057,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے ابن ابی ذئب نے بیان کیا، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص ( روزہ کی حالت میں ) جھوٹ بات کرنا اور فریب کرنا اور جہالت کی باتوں کو نہ چھوڑے تو اللہ کو اس کی کوئی ضرورت نہیں کہ وہ اپنا کھانا پینا چھوڑے۔ احمد بن یونس نے کہا یہ حدیث میں نے سنی تو تھی مگر میں اس کی سند بھول گیا تھا جو مجھ کو ایک شخص ( ابن ابی ذئب ) نے بتلا دی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6058,
			"arabicnumber": 6058,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، انہوں نے کہا مجھ سے میرے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا ہم سے ابوصالح نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم قیامت کے دن اللہ کے ہاں اس شخص کو سب سے بدتر پاؤ گے جو کچھ لوگوں کے سامنے ایک رخ سے آتا ہے اور دوسروں کے سامنے دوسرے رخ سے جاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6059,
			"arabicnumber": 6059,
			"text": "ہم سے محمد بن یوسف فریابی نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، انہیں اعمش نے، انہیں ابووائل نے اور ان سے ابن مسعود رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کچھ مال تقسیم کیا تو انصار میں سے ایک شخص نے کہا کہ اللہ کی قسم! محمد صلی اللہ علیہ وسلم کو اس تقسیم سے اللہ کی رضا مقصود نہ تھی۔ میں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر اس شخص کی یہ بات آپ کو سنائی تو نبی کریم صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ موسیٰ علیہ السلام پر رحم کرے، انہیں اس سے بھی زیادہ ایذا دی گئی، لیکن انہوں نے صبر کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6060,
			"arabicnumber": 6060,
			"text": "ہم سے محمد بن صباح نے بیان کیا، کہا ہم سے اسماعیل بن زکریا نے بیان کیا، انہوں نے کہا کہ ہم سے برید بن عبداللہ بن ابی بردہ نے بیان کیا، ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے سنا کہ ایک شخص دوسرے شخص کی تعریف کر رہا ہے اور تعریف میں بہت مبالغہ سے کام لے رہا تھا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم نے اسے ہلاک کر دیا یا ( یہ فرمایا کہ ) تم نے اس شخص کی کمر کو توڑ دیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6061,
			"arabicnumber": 6061,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے خالد نے، ان سے عبدالرحمٰن بن ابی بکرہ نے، ان سے ان کے والد نے نبی کریم صلی اللہ علیہ وسلم کی مجلس میں ایک شخص کا ذکر آیا تو ایک دوسرے شخص نے ان کی مبالغہ سے تعریف کی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ افسوس تم نے اپنے ساتھی کی گردن توڑ دی۔ نبی کریم صلی اللہ علیہ وسلم نے یہ جملہ کئی بار فرمایا، اگر تمہارے لیے کسی کی تعریف کرنی ضروری ہو تو یہ کہنا چاہیئے کہ میں اس کے متعلق ایسا خیال کرتا ہوں، باقی علم اللہ کو ہے وہ ایسا ہے۔ اگر اس کو یہ معلوم ہو کہ وہ ایسا ہی ہے اور یوں نہ کہے کہ وہ اللہ کے نزدیک اچھا ہی ہے۔ اور وہیب نے اسی سند کے ساتھ خالد سے یوں روایت کی ارے تیری خرابی تو نے اس کی گردن کاٹ ڈالی یعنی لفظ «ويحك» کے بجائے لفظ «ويلك» بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6062,
			"arabicnumber": 6062,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا، ان سے سالم نے اور ان سے ان کے والد عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم کو ازار لٹکانے کے بارے میں جو کچھ فرمانا تھا جب آپ نے فرمایا تو ابوبکر رضی اللہ عنہ نے عرض کیا کہ یا رسول اللہ! میرا تہمد ایک طرف سے لٹکنے لگتا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم ان تکبر کرنے والوں میں سے نہیں ہو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6063,
			"arabicnumber": 6063,
			"text": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اتنے اتنے دنوں تک اس حال میں رہے کہ آپ کو خیال ہوتا تھا کہ جیسے آپ اپنی بیوی کے پاس جا رہے ہیں حالانکہ ایسا نہیں تھا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے مجھ سے ایک دن فرمایا، عائشہ! میں نے اللہ تعالیٰ سے ایک معاملہ میں سوال کیا تھا اور اس نے وہ بات مجھے بتلا دی، دو فرشتے میرے پاس آئے، ایک میرے پاؤں کے پاس بیٹھ گیا اور دوسرا سر کے پاس بیٹھ گیا۔ اس نے اس سے کہا کہ جو میرے سر کے پاس تھا ان صاحب ( نبی کریم صلی اللہ علیہ وسلم ) کا کیا حال ہے؟ دوسرے نے جواب دیا کہ ان پر جادو کر دیا گیا ہے۔ پوچھا، کس نے ان پر جادو کیا ہے؟ جواب دیا کہ لبید بن اعصم نے، پوچھا، کس چیز میں کیا ہے، جواب دیا کہ نر کھجور کے خوشہ کے غلاف میں، اس کے اندر کنگھی ہے اور کتان کے تار ہیں۔ اور یہ ذروان کے کنویں میں ایک چٹان کے نیچے دبا دیا ہے۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم تشریف لے گئے اور فرمایا کہ یہی وہ کنواں ہے جو مجھے خواب میں دکھلایا گیا تھا۔ اس کے باغ کے درختوں کے پتے سانپوں کے پھن جیسے ڈراؤنے معلوم ہوتے ہیں اور اس کا پانی مہندی کے نچوڑے ہوئے پانی کی طرح سرخ تھا۔ پھر نبی کریم صلی اللہ علیہ وسلم کے حکم سے وہ جادو نکالا گیا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا: یا رسول اللہ! پھر کیوں نہیں، ان کی مراد یہ تھی کہ نبی کریم صلی اللہ علیہ وسلم نے اس واقعہ کو شہرت کیوں نہ دی۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اللہ نے شفاء دے دی ہے اور میں ان لوگوں میں خواہ مخواہ برائی کے پھیلانے کو پسند نہیں کرتا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ لبید بن اعصم یہود کے حلیف بنی زریق سے تعلق رکھتا تھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6064,
			"arabicnumber": 6064,
			"text": "ہم سے بشر بن محمد نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں ہمام بن منبہ نے خبر دی اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”بدگمانی سے بچتے رہو کیونکہ بدگمانی کی باتیں اکثر جھوٹی ہوتی ہیں، لوگوں کے عیوب تلاش کرنے کے پیچھے نہ پڑو، آپس میں حسد نہ کرو، کسی کی پیٹھ پیچھے برائی نہ کرو، بغض نہ رکھو، بلکہ سب اللہ کے بندے آپس میں بھائی بھائی بن کر رہو۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6065,
			"arabicnumber": 6065,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا انہوں نے کہا کہ مجھ سے انس مالک رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”آپس میں بغض نہ رکھو، حسد نہ کرو، پیٹھ پیچھے کسی کی برائی نہ کرو، بلکہ اللہ کے بندے آپس میں بھائی بھائی بن کر رہو اور کسی مسلمان کے لیے جائز نہیں کہ ایک بھائی کسی بھائی سے تین دن سے زیادہ سلام کلام چھوڑ کر رہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6066,
			"arabicnumber": 6066,
			"text": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی، ابوالزناد سے وہ اعرج سے اور وہ ابوہریرہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”بدگمانی سے بچتے رہو، بدگمانی اکثر تحقیق کے بعد جھوٹی بات ثابت ہوتی ہے اور کسی کے عیوب ڈھونڈنے کے پیچھے نہ پڑو، کسی کا عیب خواہ مخواہ مت ٹٹولو اور کسی کے بھاؤ پر بھاؤ نہ بڑھاؤ اور حسد نہ کرو، بغض نہ رکھو، کسی کی پیٹھ پیچھے برائی نہ کرو بلکہ سب اللہ کے بندے آپس میں بھائی بھائی بن کر رہو۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6067,
			"arabicnumber": 6067,
			"text": "ہم سے سعید بن عفیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میں گمان کرتا ہوں کہ فلاں اور فلاں ہمارے دین کی کوئی بات نہیں جانتے ہیں۔“ لیث بن سعد نے بیان کیا کہ یہ دونوں آدمی منافق تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6068,
			"arabicnumber": 6068,
			"text": "ہم سے یحییٰ بن بکیر نے کیا، کہا ہم سے لیث بن سعد نے یہی حدیث نقل کی اور (اس میں یوں ہے کہ) عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک دن نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے اور فرمایا عائشہ میں گمان کرتا ہوں کہ فلاں فلاں لوگ ہم جس دین پر ہیں اس کو نہیں پہچانتے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6069,
			"arabicnumber": 6069,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے، ان سے ان کے بھتیجے ابن شہاب نے، ان سے ابن شہاب (محمد بن مسلم) نے، ان سے سالم بن عبداللہ نے بیان کیا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میری تمام امت کو معاف کیا جائے گا سوا گناہوں کو کھلم کھلا کرنے والوں کے اور گناہوں کو کھلم کھلا کرنے میں یہ بھی شامل ہے کہ ایک شخص رات کو کوئی ( گناہ کا ) کام کرے اور اس کے باوجود کہ اللہ نے اس کے گناہ کو چھپا دیا ہے مگر صبح ہونے پر وہ کہنے لگے کہ اے فلاں! میں نے کل رات فلاں فلاں برا کام کیا تھا۔ رات گزر گئی تھی اور اس کے رب نے اس کا گناہ چھپائے رکھا، لیکن جب صبح ہوئی تو وہ خود اللہ کے پردے کو کھولنے لگا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6070,
			"arabicnumber": 6070,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے ابوعوانہ نے، انہوں نے قتادہ سے، انہوں نے صفوان بن محرز سے کہ ایک شخص نے ابن عمر رضی اللہ عنہما سے پوچھا تم نے نبی کریم صلی اللہ علیہ وسلم سے کانا پھوسی کے بارے میں کیا سنا ہے؟ ( یعنی سرگوشی کے بارے میں ) انہوں نے کہا نبی کریم صلی اللہ علیہ وسلم فرماتے تھے ( قیامت کے دن تم مسلمانوں ) میں سے ایک شخص ( جو گنہگار ہو گا ) اپنے پروردگار سے نزدیک ہو جائے گا۔ پروردگار اپنا بازو اس پر رکھ دے گا اور فرمائے گا تو نے ( فلاں دن دنیا میں ) یہ یہ برے کام کئے تھے، وہ عرض کرے گا۔ بیشک ( پروردگار مجھ سے خطائیں ہوئی ہیں پر تو غفور رحیم ہے ) غرض ( سارے گناہوں کا ) اس سے ( پہلے ) اقرار کرا لے گا پھر فرمائے گا دیکھ میں نے دنیا میں تیرے گناہ چھپائے رکھے تو آج میں ان گناہوں کو بخش دیتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6071,
			"arabicnumber": 6071,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، انہوں نے کہا ہم کو سفیان بن عیینہ نے خبر دی، انہوں نے کہا ہم سے معبد بن خالد قیسی نے بیان کیا، ان سے حارثہ بن وہب خزاعی رضی اللہ عنہ نے بیان کیا نبی کریم صلی اللہ علیہ وسلم نے فرمایا کیا میں تمہیں جنت والوں کی خبر نہ دوں۔ ہر کمزور و تواضع کرنے والا اگر وہ ( اللہ کا نام لے کر ) قسم کھا لے تو اللہ اس کی قسم پوری کر دے۔ کیا میں تمہیں دوزخ والوں کی خبر نہ دوں ہر تند خو، اکڑ کر چلنے والا اور متکبر۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6072,
			"arabicnumber": 6072,
			"text": "اور محمد بن عیسیٰ نے بیان کیا کہ ہم سے ہشیم نے بیان کیا، کہا ہم کو حمید طویل نے خبر دی، کہا ہم سے انس بن مالک نے کہ رسول اللہ صلی اللہ علیہ وسلم کے اخلاق فاضلہ کا یہ حال تھا کہ ایک لونڈی مدینہ کی لونڈیوں میں سے آپ کا ہاتھ پکڑ لیتی اور اپنے کسی بھی کام کے لیے جہاں چاہتی آپ کو لے جاتی تھی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6075,
			"arabicnumber": 6075,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6076,
			"arabicnumber": 6076,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا انہیں امام مالک رحمہ اللہ نے خبر دی، انہیں ابن شہاب نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”آپس میں بغض نہ رکھو اور ایک دوسرے سے حسد نہ کرو، پیٹھ پیچھے کسی کی برائی نہ کرو، بلکہ اللہ کے بندے اور آپس میں بھائی بھائی بن کر رہو اور کسی مسلمان کے لیے جائز نہیں کہ کسی بھائی سے تین دن سے زیادہ تک بات چیت بند کرے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6077,
			"arabicnumber": 6077,
			"text": "ہم سے عبدالرحمٰن بن یوسف نے بیان کیا، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں ابن شہاب نے، انہیں عطاء بن یزید لیثی نے اور انہیں ابوایوب انصاری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کسی شخص کے لیے جائز نہیں کہ اپنے کسی بھائی سے تین دن سے زیادہ کے لیے ملاقات چھوڑے، اس طرح کہ جب دونوں کا سامنا ہو جائے تو یہ بھی منہ پھیر لے اور وہ بھی منہ پھیر لے اور ان دونوں میں بہتر وہ ہے جو سلام میں پہل کرے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6078,
			"arabicnumber": 6078,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو عبدہ بن سلیمان نے خبر دی، انہیں ہشام بن عروہ نے، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میں تمہاری ناراضگی اور خوشی کو خوب پہچانتا ہوں۔ ام المؤمنین نے بیان کیا کہ میں نے عرض کیا: یا رسول اللہ! آپ کس طرح سے پہچانتے ہیں؟ فرمایا کہ جب تم خوش ہوتی ہو کہتی ہو، ہاں محمد کے رب کی قسم! اور جب ناراض ہوتی ہو تو کہتی ہو نہیں، ابراہیم کے رب کی قسم! بیان کیا کہ میں نے عرض کیا: جی ہاں , آپ کا فرمانا بالکل صحیح ہے میں صرف آپ کا نام لینا چھوڑتی ہوں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6079,
			"arabicnumber": 6079,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن عروہ نے خبر دی، انہیں معمر نے، ان سے زہری نے (دوسری سند) اور لیث بن سعد نے بیان کیا کہ مجھے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، انہیں عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ جب میں نے ہوش سنبھالا تو اپنے والدین کو دین اسلام کا پیرو پایا اور کوئی دن ایسا نہیں گزرتا تھا کہ جس میں رسول اللہ صلی اللہ علیہ وسلم ان کے پاس صبح و شام تشریف نہ لاتے ہوں، ایک دن ابوبکر رضی اللہ عنہ ( والد ماجد ) گھر میں بھری دوپہر میں بیٹھے ہوئے تھے کہ ایک شخص نے کہا یہ رسول اللہ صلی اللہ علیہ وسلم تشریف لا رہے ہیں، یہ ایسا وقت تھا کہ اس وقت ہمارے یہاں نبی کریم صلی اللہ علیہ وسلم کے آنے کا معمول نہیں تھا، ابوبکر رضی اللہ عنہ بولے کہ اس وقت نبی کریم صلی اللہ علیہ وسلم کا تشریف لانا کسی خاص وجہ ہی سے ہو سکتا ہے، پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے مکہ چھوڑنے کی اجازت مل گئی ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6080,
			"arabicnumber": 6080,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو عبدالوہاب ثقفی نے خبر دی، انہیں خالد حذاء نے، انہیں انس بن سیرین نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم قبیلہ انصار کے گھرانہ میں ملاقات کے لیے تشریف لے گئے اور انہیں کے یہاں کھانا کھایا، جب آپ واپس تشریف لانے لگے تو آپ کے حکم سے ایک چٹائی پر پانی چھڑکا گیا اور نبی کریم صلی اللہ علیہ وسلم نے اس پر نماز پڑھی اور گھر والوں کے لیے دعا کی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6081,
			"arabicnumber": 6081,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے عبدالصمد بن عبدالوارث نے، کہا کہ مجھ سے میرے والد نے بیان کیا، کہا کہ مجھ سے یحییٰ بن ابی اسحاق نے، کہا کہ مجھ سے سالم بن عبداللہ نے پوچھا کہ «إستبرق» کیا چیز ہے؟ میں نے کہا کہ دیبا سے بنا ہوا دبیز اور کھردرا کپڑا پھر انہوں نے بیان کیا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ عمر رضی اللہ عنہ نے ایک شخص کو استبرق کا جوڑا پہنے ہوئے دیکھا تو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اسے لے کر حاضر ہوئے اور عرض کیا کہ یا رسول اللہ! اسے آپ خرید لیں اور وفد جب آپ سے ملاقات کے لیے آئیں تو ان کی ملاقات کے وقت اسے پہن لیا کریں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ریشم تو وہی پہن سکتا ہے جس کا ( آخرت میں ) کوئی حصہ نہ ہو خیر اس بات پر ایک مدت گزر گئی پھر ایسا ہوا کہ ایک دن نبی کریم صلی اللہ علیہ وسلم نے خود انہیں ایک جوڑا بھیجا تو وہ اسے لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا آپ نے یہ جوڑا میرے لیے بھیجا ہے، حالانکہ اس کے بارے میں آپ اس سے پہلے ایسا ارشاد فرما چکے ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ میں نے تمہارے پاس اس لیے بھیجا ہے تاکہ تم اس کے ذریعہ ( بیچ کر ) مال حاصل کرو۔ چنانچہ ابن عمر رضی اللہ عنہما اسی حدیث کی وجہ سے کپڑے میں ( ریشم کے ) بیل بوٹوں کو بھی مکروہ جانتے تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6082,
			"arabicnumber": 6082,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے حمید طویل نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ جب عبدالرحمٰن بن عوف ہمارے یہاں آئے تو نبی کریم صلی اللہ علیہ وسلم نے ان میں اور سعد بن ربیع میں بھائی چارگی کرائی تو پھر ( جب عبدالرحمٰن بن عوف نے نکاح کیا تو ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اب ولیمہ کر خواہ ایک بکری کا ہو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6083,
			"arabicnumber": 6083,
			"text": "ہم سے محمد بن صباح نے بیان کیا، کہا ہم سے اسماعیل بن زکریا نے بیان کیا، کہا ہم سے عاصم بن سلیمان احول نے بیان کیا، کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے پوچھا، کیا تم کو یہ بات معلوم ہے کہ ہم سے محمد بن صباح نے بیان کیا، کہا ہم سے اسماعیل بن زکریا نے بیان کیا، کہا ہم سے عاصم بن سلیمان احول نے بیان کیا، کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے پوچھا، کیا تم کو یہ بات معلوم ہے کہ",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6084,
			"arabicnumber": 6084,
			"text": "ہم سے حبان بن موسیٰ نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں عروہ نے اور انہیں عائشہ رضی اللہ عنہا نے کہ رفاعہ قرظی نے اپنی بیوی کو طلاق دے دی اور طلاق رجعی نہیں دی۔ اس کے بعد ان سے عبدالرحمٰن بن زبیر رضی اللہ عنہما نے نکاح کر لیا، لیکن وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا: یا رسول اللہ! میں رفاعہ رضی اللہ عنہ کے نکاح میں تھی لیکن انہوں نے مجھے تین طلاقیں دے دیں۔ پھر مجھ سے عبدالرحمٰن بن زبیر رضی اللہ عنہما نے نکاح کر لیا، لیکن اللہ کی قسم ان کے پاس تو پلو کی طرح کے سوا اور کچھ نہیں۔ ( مراد یہ کہ وہ نامرد ہیں ) اور انہوں نے اپنے چادر کا پلو پکڑ کر بتایا ( راوی نے بیان کیا کہ ) ابوبکر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے اور سعید بن العاص کے لڑکے خالد حجرہ کے دروازے پر تھے اور اندر داخل ہونے کی اجازت کے منتظر تھے۔ خالد بن سعید اس پر ابوبکر رضی اللہ عنہ کو آواز دے کر کہنے لگے کہ آپ اس عورت کو ڈانتے نہیں کہ نبی کریم صلی اللہ علیہ وسلم کے سامنے کس طرح کی بات کہتی ہے اور نبی کریم صلی اللہ علیہ وسلم نے تبسم کے سوا اور کچھ نہیں فرمایا۔ پھر فرمایا، غالباً تم رفاعہ کے پاس دوبارہ جانا چاہتی ہو لیکن یہ اس وقت تک ممکن نہیں ہے جب تک تم ان کا ( عبدالرحمٰن رضی اللہ عنہ کا ) مزا نہ چکھ لو اور وہ تمہارا مزہ نہ چکھ لیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6085,
			"arabicnumber": 6085,
			"text": "ہم سے اسماعیل نے بیان کیا، کہا ہم سے ابراہیم نے بیان کیا، ان سے صالح بن کیسان نے، ان سے ابن شہاب نے، ان سے عبدالحمید بن عبدالرحمٰن بن زید بن خطاب نے، ان سے محمد بن سعد نے اور ان سے ان کے والد نے بیان کیا کہ عمر بن خطاب رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کی اجازت چاہی۔ اس وقت نبی کریم صلی اللہ علیہ وسلم کے پاس آپ کی کئی بیویاں جو قریش سے تعلق رکھتی تھیں آپ سے خرچ دینے کے لیے تقاضا کر رہی تھیں اور اونچی آواز میں باتیں کر رہی تھیں۔ جب عمر رضی اللہ عنہ نے اجازت چاہی تو وہ جلدی سے بھاگ کر پردے کے پیچھے چلی گئیں۔ پھر نبی کریم صلی اللہ علیہ وسلم نے ان کو اجازت دی اور وہ داخل ہوئے۔ نبی کریم صلی اللہ علیہ وسلم اس وقت ہنس رہے تھے، عمر رضی اللہ عنہ نے عرض کیا: اللہ آپ کو خوش رکھے، یا رسول اللہ! میرے ماں باپ آپ پر قربان ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ان پر مجھے حیرت ہوئی، جو ابھی میرے پاس تقاضا کر رہی تھیں، جب انہوں نے تمہاری آواز سنی تو فوراً بھاگ کر پردے کے پیچھے چلی گئیں۔ عمر رضی اللہ عنہ نے اس پر عرض کیا: یا رسول اللہ! آپ اس کے زیادہ مستحق ہیں کہ آپ سے ڈرا جائے، پھر عورتوں کو مخاطب کر کے انہوں نے کہا، اپنی جانوں کی دشمن! مجھ سے تو تم ڈرتی ہو او اللہ کے رسول سے نہیں ڈرتیں۔ انہوں نے عرض کیا: آپ نبی کریم صلی اللہ علیہ وسلم سے زیادہ سخت ہیں۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ہاں اے ابن خطاب! اس ذات کی قسم جس کے ہاتھ میں میری جان ہے، اگر شیطان بھی تمہیں راستے پر آتا ہوا دیکھے گا تو تمہارا راستہ چھوڑ کر دوسرے راستے پر چلا جائے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6086,
			"arabicnumber": 6086,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے، ان سے ابو العباس سائب نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ جب رسول اللہ صلی اللہ علیہ وسلم طائف میں تھے ( فتح مکہ کے بعد ) تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اللہ نے چاہا تو ہم یہاں سے کل واپس ہوں گے۔ آپ کے بعض صحابہ نے کہا کہ ہم اس وقت تک نہیں جائیں گے جب تک اسے فتح نہ کر لیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر یہی بات ہے تو کل صبح لڑائی کرو۔ بیان کیا کہ دوسرے دن صبح کو صحابہ نے گھمسان کی لڑائی لڑی اور بکثرت صحابہ زخمی ہوئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ان شاءاللہ ہم کل واپس ہوں گے۔ بیان کیا کہ اب سب لوگ خاموش رہے۔ اس پر نبی کریم صلی اللہ علیہ وسلم ہنس پڑے۔ حمیدی نے بیان کیا کہ ہم سے سفیان نے پوری سند «خبر‏.» کے لفظ کے ساتھ بیان کی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6087,
			"arabicnumber": 6087,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، کہا ہم کو ابن شہاب نے خبر دی، انہیں حمید بن عبدالرحمٰن نے، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ایک صاحب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا: میں تو تباہ ہو گیا اپنی بیوی کے ساتھ رمضان میں ( روزہ کی حالت میں ) ہمبستری کر لی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر ایک غلام آزاد کر۔ انہوں نے عرض کیا: میرے پاس کوئی غلام نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر دو مہینے کے روزے رکھ۔ انہوں نے عرض کیا: اس کی مجھ میں طاقت نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر ساٹھ مسکینوں کو کھانا کھلا۔ انہوں نے عرض کیا کہ اتنا بھی میرے پاس نہیں ہے۔ بیان کیا کہ پھر کھجور کا ایک ٹوکرا لایا گیا۔ ابراہیم نے بیان کیا کہ «عرق» ایک طرح کا ( نو کلوگرام کا ) ایک پیمانہ تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پوچھنے والا کہاں ہے؟ لو اسے صدقہ کر دینا۔ انہوں نے عرض کیا مجھ سے جو زیادہ محتاج ہو اسے دوں؟ اللہ کی قسم! مدینہ کے دونوں میدانوں کے درمیان کوئی گھرانہ بھی ہم سے زیادہ محتاج نہیں ہے۔ اس پر نبی کریم صلی اللہ علیہ وسلم ہنس دیئے اور آپ کے سامنے کے دندان مبارک کھل گئے، اس کے بعد فرمایا کہ اچھا پھر تو تم میاں بیوی ہی اسے کھا لو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6088,
			"arabicnumber": 6088,
			"text": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا، کہا ہم سے امام مالک رحمہ اللہ نے بیان کیا، ان سے اسحاق بن عبداللہ ابن ابی طلحہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چل رہا تھا۔ آپ کے جسم پر ایک نجرانی چادر تھی، جس کا حاشیہ موٹا تھا۔ اتنے میں ایک دیہاتی آپ صلی اللہ علیہ وسلم کے پاس آیا اور اس نے آپ کی چادر بڑے زور سے کھینچی۔ انس رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے شانے کو دیکھا کہ زور سے کھینچنے کی وجہ سے، اس پر نشان پڑ گئے۔ پھر اس نے کہا: اے محمد! اللہ کا جو مال آپ کے پاس ہے اس میں سے مجھے دیئے جانے کا حکم فرمایئے۔ اس وقت میں نے نبی کریم صلی اللہ علیہ وسلم کو مڑ کر دیکھا تو آپ مسکرا دیئے پھر آپ صلی اللہ علیہ وسلم نے اسے دیئے جانے کا حکم فرمایا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6090,
			"arabicnumber": 6090,
			"text": "میں نے نبی کریم صلی اللہ علیہ وسلم سے شکایت کی کہ میں گھوڑے پر جم کر نہیں بیٹھ پاتا تو نبی کریم صلی اللہ علیہ وسلم نے اپنا ہاتھ میرے سینے پر مارا اور دعا کی «اللهم ثبته واجعله هاديا مهديا» ”اے اللہ! اسے ثبات فرما، اسے ہدایت کرنے والا اور خود ہدایت پایا ہوا بنا۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6091,
			"arabicnumber": 6091,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ قطان نے بیان کیا، ان سے ہشام بن عروہ نے بیان کیا، انہیں ان کے والد نے خبر دی، انہیں زینب بنت ام سلمہ رضی اللہ عنہما نے، انہیں ام سلمہ رضی اللہ عنہا نے کہ ام سلیم رضی اللہ عنہا نے عرض کیا: یا رسول اللہ! اللہ حق سے نہیں شرماتا، کیا عورت کو جب احتلام ہو تو اس پر غسل واجب ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جب عورت پانی دیکھے ( تو اس پر غسل واجب ہے ) اس پر ام سلمہ رضی اللہ عنہا ہنسیں اور عرض کیا، کیا عورت کو بھی احتلام ہوتا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر بچہ کی صورت ماں سے کیوں ملتی ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6092,
			"arabicnumber": 6092,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا، انہوں نے کہا ہم کو عمرو نے خبر دی، ان سے ابوالنضر نے بیان کیا، ان سے سلیمان بن یسار نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کو اس طرح کھل کر کبھی ہنستے نہیں دیکھا کہ آپ کے حلق کا کوا نظر آنے لگتا ہو، آپ صلی اللہ علیہ وسلم صرف مسکراتے تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6093,
			"arabicnumber": 6093,
			"text": "ہم سے محمد بن محبوب نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے (دوسری سند) اور مجھ سے خلیفہ نے بیان کیا، کہا ہم کو یزید بن زریع نے بیان کیا، ان سے سعید نے بیان کیا، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ ایک صاحب جمعہ کے دن نبی کریم صلی اللہ علیہ وسلم کے پاس آئے نبی کریم صلی اللہ علیہ وسلم اس وقت مدینہ میں جمعہ کا خطبہ دے رہے تھے، انہوں نے عرض کیا بارش کا قحط پڑ گیا ہے، آپ اپنے رب سے بارش کی دعا کیجئے۔ نبی کریم صلی اللہ علیہ وسلم نے آسمان کی طرف دیکھا کہیں ہمیں بادل نظر نہیں آ رہا تھا۔ پھر آپ نے بارش کی دعا کی، اتنے میں بادل اٹھا اور بعض ٹکڑے بعض کی طرف بڑھے اور بارش ہونے لگی، یہاں تک کہ مدینہ کے نالے بہنے لگے۔ اگلے جمعہ تک اسی طرح بارش ہوتی رہی سلسلہ ٹوٹتا ہی نہ تھا چنانچہ وہی صاحب یا کوئی دوسرے ( اگلے جمعہ کو ) کھڑے ہوئے، نبی کریم صلی اللہ علیہ وسلم خطبہ دے رہے تھے اور انہوں نے عرض کیا: ہم ڈوب گئے، اپنے رب سے دعا کریں کہ اب بارش بند کر دے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اے اللہ! ہمارے چاروں طرف بارش ہو، ہم پر نہ ہو۔ دو یا تین مرتبہ آپ صلی اللہ علیہ وسلم نے یہ فرمایا، چنانچہ مدینہ منورہ سے بادل چھٹنے لگے، بائیں اور دائیں، ہمارے چاروں طرف دوسرے مقامات پر بارش ہونے لگی اور ہمارے یہاں بارش یکدم بند ہو گئی۔ یہ اللہ نے لوگوں کو نبی کریم صلی اللہ علیہ وسلم کا معجزہ اور اپنے پیغمبر صلی اللہ علیہ وسلم کی کرامت اور دعا کی قبولیت بتلائی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6094,
			"arabicnumber": 6094,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا ہم سے جریر نے بیان کیا، ان سے منصور نے بیان کیا، ان سے ابووائل نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”بلاشبہ سچ آدمی کو نیکی کی طرف بلاتا ہے اور نیکی جنت کی طرف لے جاتی ہے اور ایک شخص سچ بولتا رہتا ہے یہاں تک کہ وہ صدیق کا لقب اور مرتبہ حاصل کر لیتا ہے اور بلاشبہ جھوٹ برائی کی طرف لے جاتا ہے اور برائی جہنم کی طرف اور ایک شخص جھوٹ بولتا رہتا ہے، یہاں تک کہ وہ اللہ کے یہاں بہت جھوٹا لکھ دیا جاتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6095,
			"arabicnumber": 6095,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم سے اسماعیل بن جعفر نے بیان کیا، ان سے ابی سہیل نافع بن مالک بن ابی عامر نے، ان سے ان کے والد مالک بن ابی عامر نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”منافق کی تین نشانیاں ہیں، جب بولتا ہے جھوٹ بولتا ہے، جب وعدہ کرتا ہے خلاف کرتا ہے اور جب اسے امین بنایا جاتا ہے تو خیانت کرتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6096,
			"arabicnumber": 6096,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے جریر نے بیان کیا، انہوں نے کہا ہم سے ابورجاء نے بیان کیا، ان سے سمرہ بن جندب رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میرے پاس گذشتہ رات خواب میں دو آدمی آئے انہوں نے کہا کہ جسے آپ نے دیکھا کہ اس کا جبڑا چیرا جا رہا تھا وہ بڑا ہی جھوٹا تھا، جو ایک بات کو لیتا اور ساری دنیا میں پھیلا دیتا تھا، قیامت تک اس کو یہی سزا ملتی رہے گی۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6097,
			"arabicnumber": 6097,
			"text": "ہم سے اسحاق بن ابراہیم راہویہ نے بیان کیا، کہا کہ میں نے ابواسامہ سے پوچھا کیا تم سے اعمش نے یہ بیان کیا کہ میں نے شقیق سے سنا، کہا میں نے حذیفہ رضی اللہ عنہ سے سنا، وہ بیان کرتے تھے کہ بلاشبہ سب لوگوں سے اپنی چال ڈھال اور وضع اور سیرت میں رسول اللہ صلی اللہ علیہ وسلم سے سب سے زیادہ مشابہ عبداللہ بن مسعود رضی اللہ عنہ ہیں۔ جب وہ اپنے گھر سے باہر نکلتے اور اس کے بعد دوبارہ اپنے گھر واپس آنے تک ان کا یہی حال رہتا ہے لیکن جب وہ اکیلے گھر میں رہتے تو معلوم نہیں کیا کرتے رہتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6098,
			"arabicnumber": 6098,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے مخارق نے، انہوں نے کہا میں نے طارق سے سنا، کہا کہ عبداللہ بن مسعود رضی اللہ عنہ نے کہا بلاشبہ سب سے اچھا کلام اللہ کی کتاب ہے اور سب سے اچھا طریقہ ( چال چلن ) محمد صلی اللہ علیہ وسلم کا طریقہ ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6099,
			"arabicnumber": 6099,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے سفیان ثوری نے بیان کیا، کہا مجھ سے اعمش نے بیان کیا، ان سے سعید بن جبیر نے، ان سے ابوعبدالرحمٰن سلمی نے، ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کوئی شخص بھی یا کوئی چیز بھی تکلیف برداشت کرنے والی، جو اسے کسی چیز کو سن کر ہوئی ہو، اللہ سے زیادہ ( صبر کرنے والا ) نہیں ہے۔ لوگ اس کے لیے اولاد ٹھہراتے ہیں اور وہ انہیں تندرستی دیتا ہے بلکہ انہیں روزی بھی دیتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6100,
			"arabicnumber": 6100,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا کہ میں نے ان سے سنا وہ بیان کرتے تھے کہ عبداللہ بن مسعود نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے ( جنگ حنین ) میں کچھ مال تقسیم کیا جیسا کہ آپ ہمیشہ تقسیم کیا کرتے تھے۔ اس پر قبیلہ انصار کے ایک شخص نے کہا کہ اللہ کی قسم! اس تقسیم سے اللہ کی رضا مندی حاصل کرنا مقصود نہیں تھا۔ میں نے کہا کہ یہ بات میں ضرور رسول اللہ صلی اللہ علیہ وسلم سے کہوں گا۔ چنانچہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا نبی کریم صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ تشریف رکھتے تھے، میں نے چپکے سے یہ بات آپ صلی اللہ علیہ وسلم سے کہی۔ نبی کریم صلی اللہ علیہ وسلم کو اس کی یہ بات بڑی ناگوار گزری اور آپ کے چہرے کا رنگ بدل گیا اور آپ غصہ ہو گئے یہاں تک کہ میرے دل میں یہ خواہش پیدا ہوئی کہ کاش میں نے نبی کریم صلی اللہ علیہ وسلم کو اس بات کی خبر نہ دی ہوتی پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا موسیٰ علیہ السلام کو اس سے بھی زیادہ تکلیف پہنچائی گئی تھی لیکن انہوں نے صبر کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6101,
			"arabicnumber": 6101,
			"text": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا ہم سے مسلم نے بیان کیا، ان سے مسروق نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک کام کیا اور لوگوں کو بھی اس کی اجازت دے دی لیکن کچھ لوگوں نے اس کا نہ کرنا اچھا جانا۔ جب نبی کریم صلی اللہ علیہ وسلم کو اس کی اطلاع ہوئی تو آپ نے خطبہ دیا اور اللہ کی حمد کے بعد فرمایا کہ ان لوگوں کو کیا ہو گیا ہے جو اس کام سے پرہیز کرتے ہیں، جو میں کرتا ہوں، اللہ کی قسم میں اللہ کو ان سب سے زیادہ جانتا ہوں اور ان سب سے زیادہ اللہ سے ڈرنے والا ہوں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6102,
			"arabicnumber": 6102,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم سے عبداللہ بن مبارک نے، کہا ہم کو شعبہ نے خبر دی، انہیں قتادہ نے، کہا میں نے عبداللہ بن عتبہ سے سنا، جو انس رضی اللہ عنہ کے غلام ہیں کہ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کنواری لڑکیوں سے بھی زیادہ شرمیلے تھے، جب آپ کوئی ایسی چیز دیکھتے جو آپ کو ناگوار ہوتی تو ہم آپ کے چہرے مبارک سے سمجھ جاتے تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6103,
			"arabicnumber": 6103,
			"text": "ہم سے محمد بن یحییٰ ذہلی (یا محمد بن بشار) اور احمد بن سعید دارمی نے بیان کیا، انہوں نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا، کہا ہم کو علی بن مبارک نے خبر دی، انہیں یحییٰ بن ابی کثیر نے، انہیں ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب کوئی شخص اپنے کسی بھائی کو کہتا ہے کہ اے کافر! تو ان دونوں میں سے ایک کافر ہو گیا۔ اور عکرمہ بن عمار نے یحییٰ سے بیان کیا کہ ان سے عبداللہ بن یزید نے کہا، انہوں نے ابوسلمہ سے سنا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا انہوں نے نبی کریم صلی اللہ علیہ وسلم سے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6104,
			"arabicnumber": 6104,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا، ان سے عبداللہ بن دینار نے، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس شخص نے بھی اپنے کسی بھائی کو کہا کہ اے کافر! تو ان دونوں میں سے ایک کافر ہو گیا۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6105,
			"arabicnumber": 6105,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے ایوب سختیانی نے بیان کیا، ان سے ابوقلابہ نے، ان سے ثابت بن ضحاک رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے اسلام کے سوا کسی اور مذہب کی جھوٹ موٹ قسم کھائی تو وہ ویسا ہی ہو جاتا ہے، جس کی اس نے قسم کھائی ہے اور جس نے کسی چیز سے خودکشی کر لی تو اسے جہنم میں اسی سے عذاب دیا جائے گا اور مومن پر لعنت بھیجنا اسے قتل کرنے کے برابر ہے اور جس نے کسی مومن پر کفر کی تہمت لگائی تو یہ اس کے قتل کے برابر ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6106,
			"arabicnumber": 6106,
			"text": "ہم سے محمد بن عبادہ نے بیان کیا، کہا ہم کو یزید نے خبر دی، کہا ہم کو سلیم نے خبر دی، کہا ہم سے عمرو بن دینار نے بیان کیا، ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ معاذ بن جبل رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے، پھر اپنی قوم میں آتے اور انہیں نماز پڑھاتے۔ انہوں نے ( ایک مرتبہ ) نماز میں سورۃ البقرہ پڑھی۔ اس پر ایک صاحب جماعت سے الگ ہو گئے اور ہلکی نماز پڑھی۔ جب اس کے متعلق معاذ کو معلوم ہوا تو کہا وہ منافق ہے۔ معاذ کی یہ بات جب ان کو معلوم ہوئی تو وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا: یا رسول اللہ! ہم لوگ محنت کا کام کرتے ہیں اور اپنی اونٹنیوں کو خود پانی پلاتے ہیں معاذ نے کل رات ہمیں نماز پڑھائی اور سورۃ البقرہ پڑھنی شروع کر دی۔ اس لیے میں نماز توڑ کر الگ ہو گیا، اس پر وہ کہتے ہیں کہ میں منافق ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اے معاذ! تم لوگوں کو فتنہ میں مبتلا کرتے ہو، تین مرتبہ آپ صلی اللہ علیہ وسلم نے یہ فرمایا ( جب امام ہو تو ) سورۃ «اقرأ»،‏‏‏‏ «والشمس وضحاها‏» اور «سبح اسم ربك الأعلى‏» جیسی سورتیں پڑھا کرو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6107,
			"arabicnumber": 6107,
			"text": "مجھ سے اسحاق بن راہویہ نے بیان کیا، کہا ہم کو ابوالمغیرہ نے خبر دی، کہا ہم سے امام اوزاعی نے بیان کیا انہوں نے کہا ہم سے زہری نے بیان کیا، انہوں نے کہا ہم سے حمید بن عبدالرحمٰن بن عوف نے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے جس نے لات، عزیٰ کی ( یا دوسرے بتوں کی ) قسم کھائی تو اسے «لا إله إلا الله‏.‏» پڑھنا چاہیئے اور جس نے اپنے ساتھی سے کہا کہ آؤ جوا کھیلیں تو اسے بطور کفارہ صدقہ دینا چاہیئے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6108,
			"arabicnumber": 6108,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے نافع نے، ان سے ابن عمر رضی اللہ عنہما نے کہ وہ عمر بن خطاب رضی اللہ عنہ کے پاس پہنچے جو چند سواروں کے ساتھ تھے، اس وقت عمر رضی اللہ عنہ اپنے والد کی قسم کھا رہے تھے۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے انہیں پکار کر کہا، خبردار! یقیناً اللہ پاک تمہیں منع کرتا ہے کہ تم اپنے باپ دادوں کی قسم کھاؤ، پس اگر کسی کو قسم ہی کھانی ہے تو اللہ کی قسم کھائے، ورنہ چپ رہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6109,
			"arabicnumber": 6109,
			"text": "ہم سے بسرہ بن صفوان نے بیان کیا، انہوں نے کہا ہم سے ابراہیم نے بیان کیا، ان سے زہری نے بیان کیا، ان سے قاسم نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم اندر تشریف لائے اور گھر میں ایک پردہ لٹکا ہوا تھا جس پر تصویریں تھیں۔ نبی کریم صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا۔ پھر آپ نے پردہ پکڑا اور اسے پھاڑ دیا۔ ام المؤمنین نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”قیامت کے دن ان لوگوں پر سب سے زیادہ عذاب ہو گا، جو یہ صورتیں بناتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6110,
			"arabicnumber": 6110,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے اسماعیل بن ابی خالد نے بیان کیا، کہا ہم سے قیس بن ابی حازم نے اور ان سے ابومسعود نے بیان کیا کہ ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا میں صبح کی نماز جماعت سے فلاں امام کی وجہ سے نہیں پڑھتا کیونکہ وہ بہت لمبی نماز پڑھاتے ہیں۔ انہوں نے کہا کہ اس دن ان امام صاحب کو نصیحت کرنے میں نبی کریم صلی اللہ علیہ وسلم کو میں نے جتنا غصہ میں دیکھا ایسا میں نے آپ کو کبھی نہیں دیکھا تھا، پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اے لوگو! تم میں سے کچھ لوگ ( نماز باجماعت پڑھنے سے ) لوگوں کو دور کرنے والے ہیں، پس جو شخص بھی لوگوں کو نماز پڑھائے مختصر پڑھائے، کیونکہ نمازیوں میں کوئی بیمار ہوتا ہے کوئی بوڑھا کوئی کام کاج والا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6111,
			"arabicnumber": 6111,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے جویریہ نے بیان کیا، ان سے نافع نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نماز پڑھ رہے تھے کہ آپ صلی اللہ علیہ وسلم نے مسجد میں قبلہ کی جانب منہ کا تھوک دیکھا۔ پھر آپ نے اسے اپنے ہاتھ سے صاف کیا اور غصہ ہوئے پھر فرمایا جب تم میں سے کوئی شخص نماز میں ہوتا ہے اللہ تعالیٰ اس کے سامنے ہوتا ہے۔ اس لیے کوئی شخص نماز میں اپنے سامنے نہ تھوکے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6112,
			"arabicnumber": 6112,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو اسماعیل بن جعفر نے خبر دی، کہا ہم کو ربیعہ بن ابی عبدالرحمٰن نے خبر دی، انہیں زید بن خالد جہنی نے کہ ایک صاحب نے رسول اللہ صلی اللہ علیہ وسلم سے لقطہٰ ( راستہ میں گری پڑی چیز جسے کسی نے اٹھا لیا ہو ) کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا سال بھر لوگوں سے پوچھتے رہو پھر اس کا سر بندھن اور ظرف پہچان کے رکھ اور خرچ کر ڈال۔ پھر اگر اس کے بعد اس کا مالک آ جائے تو وہ چیز اسے آپس کر دے۔ پوچھا: یا رسول اللہ! بھولی بھٹکی بکری کے متعلق کیا حکم ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے پکڑ لا کیونکہ وہ تمہارے بھائی کی ہے یا پھر بھیڑیئے کی ہو گی۔ پوچھا: یا رسول اللہ! اور کھویا ہوا اونٹ؟ بیان کیا کہ اس پر نبی کریم صلی اللہ علیہ وسلم ناراض ہو گئے اور آپ کے دونوں رخسار سرخ ہو گئے، یا راوی نے یوں کہا کہ آپ کا چہرہ سرخ ہو گیا، پھر آپ نے فرمایا کہ تمہیں اس اونٹ سے کیا غرض ہے اس کے ساتھ تو اس کے پاؤں ہیں اور اس کا پانی ہے وہ کبھی نہ کبھی اپنے مالک کو پا لے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6113,
			"arabicnumber": 6113,
			"text": "اور مکی بن ابراہیم نے بیان کیا انہوں نے کہا کہ ہم سے عبداللہ بن سعید نے بیان کیا (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور مجھ سے محمد بن زیاد نے بیان کیا، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا، انہوں نے کہا ہم سے عبداللہ بن سعید نے بیان کیا، انہوں نے کہا کہ مجھ سے عمر بن عبیداللہ کے غلام سالم ابوالنضر نے بیان کیا، ان سے بسر بن سعید نے بیان کیا اور ان سے زید بن ثابت رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کھجور کی شاخوں یا بوریئے سے ایک مکان چھوٹے سے حجرے کی طرح بنا لیا تھا۔ وہاں آ کر آپ تہجد کی نماز پڑھا کرتے تھے، چند لوگ بھی وہاں آ گئے اور انہوں نے آپ کی اقتداء میں نماز پڑھی پھر سب لوگ دوسری رات بھی آ گئے اور ٹھہرے رہے لیکن آپ گھر ہی میں رہے اور باہر ان کے پاس تشریف نہیں لائے۔ لوگ آواز بلند کرنے لگے اور دروازے پر کنکریاں ماریں تو نبی کریم صلی اللہ علیہ وسلم غصہ کی حالت میں باہر تشریف لائے اور فرمایا تم چاہتے ہو کہ ہمیشہ یہ نماز پڑھتے رہو تاکہ تم پر فرض ہو جائے ( اس وقت مشکل ہو ) دیکھو تم نفل نمازیں اپنے گھروں میں ہی پڑھا کرو۔ کیونکہ فرض نمازوں کے سوا آدمی کی بہترین نفل نماز وہ ہے جو گھر میں پڑھی جائے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6114,
			"arabicnumber": 6114,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں سعید بن مسیب نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”پہلوان وہ نہیں ہے جو کشتی لڑنے میں غالب ہو جائے بلکہ اصلی پہلوان تو وہ ہے جو غصہ کی حالت میں اپنے آپ پر قابو پائے بے قابو نہ ہو جائے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6115,
			"arabicnumber": 6115,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے اعمش نے، ان سے عدی بن ثابت نے، ان سے سلیمان بن صرد رضی اللہ عنہ نے بیان کیا کہ دو آدمیوں نے نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں جھگڑا کیا، ہم بھی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے۔ ایک شخص دوسرے کو غصہ کی حالت میں گالی دے رہا تھا اور اس کا چہرہ سرخ تھا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں ایک ایسا کلمہ جانتا ہوں کہ اگر یہ شخص اسے کہہ لے تو اس کا غصہ دور ہو جائے۔ اگر یہ «أعوذ بالله من الشيطان الرجيم» کہہ لے۔ صحابہ نے اس سے کہا کہ سنتے نہیں، نبی کریم صلی اللہ علیہ وسلم کیا فرما رہے ہیں؟ اس نے کہا کہ کیا میں دیوانہ ہوں؟",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6116,
			"arabicnumber": 6116,
			"text": "مجھ سے یحییٰ بن یوسف نے بیان کیا، کہا ہم کو ابوبکر نے خبر دی جو ابن عیاش ہیں، انہیں ابوحصین نے، انہیں ابوصالح نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ مجھے آپ کوئی نصیحت فرما دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ غصہ نہ ہوا کر۔ انہوں نے کئی مرتبہ یہ سوال کیا اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ غصہ نہ ہوا کر۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6117,
			"arabicnumber": 6117,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے ان سے ابوالسوار عدوی نے بیان کیا، کہا کہ میں نے عمران بن حصین سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”حیاء سے ہمیشہ بھلائی پیدا ہوتی ہے۔“ اس پر بشیر بن کعب نے کہا کہ حکمت کی کتابوں میں لکھا ہے کہ حیاء سے وقار حاصل ہوتا ہے، حیاء سے سکینت حاصل ہوتی ہے۔ عمران نے ان سے کہا میں تجھ سے رسول اللہ صلی اللہ علیہ وسلم کی حدیث بیان کرتا ہوں اور تو اپنی ( دو ورقی ) کتاب کی باتیں مجھ کو سناتا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6118,
			"arabicnumber": 6118,
			"text": "ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا ہم سے عبدالعزیز بن ابوسلمہ نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے سالم نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کا گزر ایک شخص پر سے ہوا جو اپنے بھائی پر حیاء کی وجہ سے ناراض ہو رہا تھا اور کہہ رہا تھا کہ تم بہت شرماتے ہو، گویا وہ کہہ رہا تھا کہ تم اس کی وجہ سے اپنا نقصان کر لیتے ہو۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسے چھوڑ دو کہ حیاء ایمان میں سے ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6119,
			"arabicnumber": 6119,
			"text": "ہم سے علی بن الجعد نے بیان کیا، کہا ہم کو شعبہ نے خبر دی، انہیں قتادہ نے، انہیں انس رضی اللہ عنہ کے غلام قتادہ نے، ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ ان کا نام عبداللہ بن ابی عتبہ ہے، میں نے ابوسعید سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم پردہ میں رہنے والی کنواری لڑکی سے بھی زیادہ حیاء والے تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6120,
			"arabicnumber": 6120,
			"text": "ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا ہم سے زہیر نے بیان کیا، انہوں نے کہا ہم سے منصور نے بیان کیا، ان سے ربعی بن خراش نے بیان کیا، ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اگلے پیغمبروں کا کلام جو لوگوں کو ملا اس میں یہ بھی ہے کہ جب شرم ہی نہ رہی تو پھر جو جی چاہے وہ کرے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6121,
			"arabicnumber": 6121,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا مجھ سے امام مالک نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے، ان سے زینب بنت ابی سلمہ رضی اللہ عنہا نے اور ان سے ام سلمہ رضی اللہ عنہا نے بیان کیا کہ ام سلیم رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا: یا رسول اللہ! اللہ حق بات سے حیاء نہیں کرتا کیا عورت کو جب احتلام ہو تو اس پر غسل واجب ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اگر عورت منی کی تری دیکھے تو اس پر بھی غسل واجب ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6122,
			"arabicnumber": 6122,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے محارب بن دثار نے، کہا کہ میں نے ابن عمر رضی اللہ عنہا سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”مومن کی مثال اس سرسبز درخت کی ہے، جس کے پتے نہیں جھڑتے۔ صحابہ نے کہا کہ یہ فلاں درخت ہے، یہ فلاں درخت ہے۔ میرے دل میں آیا کہ کہوں کہ یہ کھجور کا درخت ہے لیکن چونکہ میں نوجوان تھا، اس لیے مجھ کو بولتے ہوئے حیاء آئی۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ کھجور کا درخت ہے۔ اور اسی سند سے شعبہ سے روایت ہے کہ کہا ہم سے خبیب بن عبدالرحمٰن نے، ان سے حفص بن عاصم نے اور ان سے ابن عمر رضی اللہ عنہما نے اسی طرح بیان کیا اور یہ اضافہ کیا کہ پھر میں نے اس کا ذکر عمر رضی اللہ عنہ سے کیا تو انہوں نے کہا اگر تم نے کہہ دیا ہوتا تو مجھے اتنا اتنا مال ملنے سے بھی زیادہ خوشی حاصل ہوتی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6123,
			"arabicnumber": 6123,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے مرحوم بن عبدالعزیز نے بیان کیا، انہوں نے کہا کہ میں نے کہا کہ میں نے ثابت سے سنا اور انہوں نے انس رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ ایک خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور اپنے آپ کو نبی کریم صلی اللہ علیہ وسلم کے نکاح کے لیے پیش کیا اور عرض کیا: کیا نبی کریم صلی اللہ علیہ وسلم کو مجھ سے نکاح کی ضرورت ہے؟ اس پر انس رضی اللہ عنہ کی صاحبزادی بولیں، وہ کتنی بےحیا تھی۔ انس رضی اللہ عنہ نے کہا کہ وہ تم سے تو اچھی تھیں انہوں نے اپنے آپ کو نبی کریم صلی اللہ علیہ وسلم کے نکاح کے لیے پیش کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6124,
			"arabicnumber": 6124,
			"text": "مجھ سے اسحاق نے بیان کیا، کہا ہم سے نضر نے بیان کیا، کہا ہم کو شعبہ نے خبر دی، انہیں سعید بن ابی بردہ نے، انہیں ان کے والد نے اور ان سے ان کے دادا نے بیان کیا کہ جب رسول اللہ صلی اللہ علیہ وسلم نے انہیں ( ابوموسیٰ اشعری رضی اللہ عنہ ) اور معاذ بن جبل کو ( یمن ) بھیجا تو ان سے فرمایا کہ ( لوگوں کے لیے ) آسانیاں پیدا کرنا، تنگی میں نہ ڈالنا، انہیں خوشخبری سنانا، دین سے نفرت نہ دلانا اور تم دونوں آپس میں اتفاق سے کام کرنا، ابوموسیٰ رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! ہم ایسی سر زمین میں جا رہے ہیں جہاں شہد سے شراب بنائی جاتی ہے اور اسے «بتع» کہا جاتا ہے اور جَو سے شراب بنائی جاتی ہے اور اسے «مزر‏.‏» کہا جاتا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہر نشہ لانے والی چیز حرام ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6125,
			"arabicnumber": 6125,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے ابوالتیاح نے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”آسانی پیدا کرو، تنگی نہ پیدا کرو، لوگوں کو تسلی اور تشفی دو نفرت نہ دلاؤ۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6126,
			"arabicnumber": 6126,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، ان سے مالک نے، ان سے ابن شہاب نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ جب بھی رسول اللہ صلی اللہ علیہ وسلم کو دو چیزوں میں سے ایک کو اختیار کرنے کا اختیار دیا گیا تو آپ نے ہمیشہ ان میں آسان چیزوں کو اختیار فرمایا، بشرطیکہ اس میں گناہ کا کوئی پہلو نہ ہوتا۔ اگر اس میں گناہ کا کوئی پہلو ہوتا تو نبی کریم صلی اللہ علیہ وسلم اس سے سب سے زیادہ دور رہتے اور نبی کریم صلی اللہ علیہ وسلم نے اپنی ذات کے لیے کسی سے بدلہ نہیں لیا، البتہ اگر کوئی شخص اللہ کی حرمت و حد کو توڑتا تو نبی کریم صلی اللہ علیہ وسلم ان سے تو محض اللہ کی رضا مندی کے لیے بدلہ لیتے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6127,
			"arabicnumber": 6127,
			"text": "ہم سے ابوالنعمان بن محمد بن فضل سدوسی نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ازرق بن قیس نے کہ اہواز نامی ایرانی شہر میں ہم ایک نہر کے کنارے تھے جو خشک پڑی تھی، پھر ابوبرزہ اسلمی صحابی گھوڑے پر تشریف لائے اور نماز پڑھی اور گھوڑا چھوڑ دیا۔ گھوڑا بھاگنے لگا تو آپ نے نماز توڑ دی اور اس کا پیچھا کیا، آخر اس کے قریب پہنچے اور اسے پکڑ لیا۔ پھر واپس آ کر نماز قضاء کی، وہاں ایک شخص خارجی تھا، وہ کہنے لگا کہ اس بوڑھے کو دیکھو اس نے گھوڑے کے لیے نماز توڑ ڈالی۔ ابوبرزہ اسلمی رضی اللہ عنہ نماز سے فارغ ہو کر آئے اور کہا جب سے میں رسول اللہ صلی اللہ علیہ وسلم سے جدا ہوا ہوں، کسی نے مجھ کو ملامت نہیں کی اور انہوں نے کہا کہ میرا گھر یہاں سے دور ہے، اگر میں نماز پڑھتا رہتا اور گھوڑے کو بھاگنے دیتا تو اپنے گھر رات تک بھی نہ پہنچ پاتا اور انہوں نے بیان کیا کہ وہ نبی کریم صلی اللہ علیہ وسلم کی صحبت میں رہے ہیں اور میں نے نبی کریم صلی اللہ علیہ وسلم کو آسان صورتوں کو اختیار کرتے دیکھا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6128,
			"arabicnumber": 6128,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے (دوسری سند) اور لیث بن سعد نے بیان کیا کہ مجھ سے یونس نے بیان کیا، ان سے ابن شہاب نے، انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور انہیں ابوہریرہ رضی اللہ عنہ نے خبر دی کہ ایک دیہاتی نے مسجد میں پیشاب کر دیا، لوگ اس کی طرف مارنے کو بڑھے، لیکن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو اور جہاں اس نے پیشاب کیا ہے اس جگہ پر پانی کا ایک ڈول بھرا ہوا بہا دو، کیونکہ تم آسانی کرنے والے بنا کر بھیجے گئے ہو تنگی کرنے والے بنا کر نہیں بھیجے گئے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6129,
			"arabicnumber": 6129,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے ابوالتیاح نے، کہا میں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ہم بچوں سے بھی دل لگی کرتے، یہاں تک کہ میرے چھوٹے بھائی ابوعمیر نامی سے ( مزاحاً ) فرماتے «يا أبا عمير ما فعل النغير‏ ‏‏.‏» ”اے ابو عمیر! تیری نغیر نامی چڑیا تو بخیر ہے؟“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6130,
			"arabicnumber": 6130,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو ابومعاویہ نے خبر دی، کہا ہم سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کے یہاں لڑکیوں کے ساتھ کھیلتی تھی، میری بہت سی سہیلیاں تھیں جو میرے ساتھ کھیلا کرتی تھیں، جب نبی کریم صلی اللہ علیہ وسلم اندر تشریف لاتے تو وہ چھپ جاتیں پھر نبی کریم صلی اللہ علیہ وسلم انہیں میرے پاس بھیجتے اور وہ میرے ساتھ کھیلتیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6131,
			"arabicnumber": 6131,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے، ان سے ابن المنکدر نے، ان سے عروہ بن زبیر نے اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم سے ایک شخص نے اندر آنے کی اجازت چاہی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے اندر بلا لو، یہ اپنی قوم کا بہت ہی برا آدمی ہے۔ جب وہ شخص اندر آ گیا تو نبی کریم صلی اللہ علیہ وسلم نے اس کے ساتھ نرمی کے ساتھ گفتگو فرمائی۔ میں نے عرض کیا: یا رسول اللہ! آپ نے ابھی اس کے متعلق کیا فرمایا تھا اور پھر اتنی نرمی کے ساتھ گفتگو فرمائی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، عائشہ اللہ کے نزدیک مرتبہ کے اعتبار سے وہ شخص سب سے برا ہے جسے لوگ اس کی بدخلقی کی وجہ سے چھوڑ دیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6132,
			"arabicnumber": 6132,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، کہا ہم کو ابن علیہ نے خبر دی، کہا ہم کو ایوب نے خبر دی، انہیں عبداللہ بن ابی ملیکہ نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم کے پاس ہدیہ میں دیبا کی چند قبائیں آئیں، ان میں سونے کے بٹن لگے ہوئے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے وہ قبائیں اپنے صحابہ میں تقسیم کر دیں اور مخرمہ کے لیے باقی رکھی، جب مخرمہ آیا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ میں نے تمہارے لیے چھپا رکھی تھی۔ ایوب نے کہا یعنی اپنے کپڑے میں چھپا رکھی تھی آپ مخرمہ کو خوش کرنے کے لیے اس کے تکمے یا گھنڈی کو دکھلا رہے تھے کیونکہ وہ ذرا سخت مزاج آدمی تھے۔ اس حدیث کو حماد بن زید نے بھی ایوب کے واسطہ سے روایت کیا مرسلات میں اور حاتم بن وردان نے کہا ہم سے ایوب نے بیان کیا، ان سے ابی ملیکہ نے اور ان سے مسور بن مخرمہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم کے پاس چند قبائیں تحفہ میں آئیں پھر ایسی ہی حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6133,
			"arabicnumber": 6133,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، انہوں نے کہا ان سے عقیل نے بیان کیا، ان سے زہری نے، ان سے ابن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”مومن کو ایک سوراخ سے دوبارہ ڈنگ نہیں لگ سکتا۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6134,
			"arabicnumber": 6134,
			"text": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے روح بن عبادہ نے، کہا ہم سے حسین نے، ان سے یحییٰ بن ابی بکر نے، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم میرے پاس تشریف لائے اور فرمایا، کیا یہ میری خبر صحیح ہے کہ تم رات بھر عبادت کرتے رہتے ہو اور دن میں روزے رکھتے ہو؟ میں نے کہا کہ جی ہاں یہ صحیح ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہ کرو، عبادت بھی کرو اور سو بھی، روزے بھی رکھو اور بلا روزے بھی رہو، کیونکہ تمہارے جسم کا بھی تم پر حق ہے، تمہاری آنکھوں کا بھی تم پر حق ہے، تم سے ملاقات کے لیے آنے والوں کا بھی تم پر حق ہے، تمہاری بیوی کا بھی تم پر حق ہے، امید ہے کہ تمہاری عمر لمبی ہو گی، تمہارے لیے یہی کافی ہے کہ ہر مہینہ میں تین روزے رکھو، کیونکہ ہر نیکی کا بدلہ دس گناہ ملتا ہے، اس طرح زندگی بھر کا روزہ ہو گا۔ انہوں نے بیان کیا کہ میں نے سختی چاہی تو آپ نے میرے اوپر سختی کر دی۔ میں نے عرض کیا کہ میں اس سے زیادہ کی طاقت رکھتا ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر ہر ہفتے تین روزہ رکھا کر، بیان کیا کہ میں نے اور سختی چاہی اور آپ نے میرے اوپر سختی کر دی۔ میں نے عرض کیا کہ میں اس سے بھی زیادہ کی طاقت رکھتا ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر اللہ کے نبی داؤد علیہ السلام جیسا روزہ رکھ۔ میں نے پوچھا، اللہ کے نبی داؤد علیہ السلام کا روزہ کیسا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ایک دن روزہ ایک دن افطار گویا آدھی عمر کے روزے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6135,
			"arabicnumber": 6135,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں سعید بن ابی سعید مقبری نے، انہیں ابوشریح کعبی رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو اسے اپنے مہمان کی عزت کرنا چاہیئے۔ اس کی خاطر داری بس ایک دن اور رات کی ہے مہمانی تین دن اور راتوں کی، اس کے بعد جو ہو وہ صدقہ ہے اور مہمان کے لیے جائز نہیں کہ وہ اپنے میزبان کے پاس اتنے دن ٹھہر جائے کہ اسے تنگ کر ڈالے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6136,
			"arabicnumber": 6136,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا کہ ہم سے ابن مہندی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے ابوحصین نے، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو، اس پر لازم ہے کہ اپنے پڑوسی کو تکلیف نہ دے، جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو، اس پر لازم ہے کہ اپنے مہمان کی عزت کرے اور جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو، اس پر لازم ہے کہ بھلی بات کہے ورنہ چپ رہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6137,
			"arabicnumber": 6137,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث بن سعد نے، ان سے یزید بن ابی حبیب نے، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے بیان کیا کہ ہم نے عرض کیا: یا رسول اللہ! آپ ہمیں ( تبلیغ وغیرہ کے لیے ) بھیجتے ہیں اور راستے میں ہم بعض قبیلوں کے گاؤں میں قیام کرتے ہیں لیکن وہ ہماری مہمانی نہیں کرتے، نبی کریم صلی اللہ علیہ وسلم کا اس سلسلے میں کیا ارشاد ہے؟ نبی کریم صلی اللہ علیہ وسلم نے اس پر ہم سے فرمایا کہ جب تم ایسے لوگوں کے پاس جا کر اترو اور وہ جیسا دستور ہے مہمانی کے طور پر تم کو کچھ دیں تو اسے منظور کر لو اگر نہ دیں تو مہمانی کا حق قاعدے کے موافق ان سے وصول کر لو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6138,
			"arabicnumber": 6138,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم سے ہشام بن یوسف نے بیان کیا، کہا ہم کو معمر نے خبر دی، انہیں زہری نے انہیں ابوسلمہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جو شخص اللہ پر اور آخرت کے دن پر ایمان رکھتا ہو اسے اپنے مہمان کی عزت کرنی چاہیئے اور جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو اسے چاہئے کہ وہ صلہ رحمی کرے، جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو، اسے چاہیئے کہ اچھی بات زبان سے نکالے ورنہ چپ رہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6139,
			"arabicnumber": 6139,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے جعفر بن عون نے بیان کیا، کہا ہم ابوالعمیس (عتبہ بن عبداللہ) نے بیان کیا، ان سے عون بن ابی جحیفہ نے اور ان سے ان کے والد نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے سلمان فارسی اور ابودرداء رضی اللہ عنہما کو بھائی بھائی بنا دیا۔ ایک مرتبہ سلمان، ابودرداء رضی اللہ عنہما کی ملاقات کے لیے تشریف لائے اور ام الدرداء رضی اللہ عنہا کو بڑی خستہ حالت میں دیکھا اور پوچھا کیا حال ہے؟ وہ بولیں تمہارے بھائی ابودرداء کو دنیا سے کوئی سروکار نہیں۔ پھر ابودرداء تشریف لائے تو سلمان رضی اللہ عنہ نے ان کے سامنے کھانا پیش کیا۔ انہوں نے کہا کہ آپ کھائیے، میں روزے سے ہوں۔ سلمان فارسی رضی اللہ عنہ بولے کہ میں اس وقت تک نہیں کھاؤں گا۔ جب تک آپ بھی نہ کھائیں۔ چنانچہ ابودرداء نے بھی کھایا رات ہوئی تو ابودرداء رضی اللہ عنہ نماز پڑھنے کی تیاری کرنے لگے۔ سلمان نے کہا کہ سو جایئے، پھر جب آخر رات ہوئی تو ابودرداء نے کہا اب اٹھئیے، بیان کیا کہ پھر دونوں نے نماز پڑھی۔ اس کے بعد سلمان رضی اللہ عنہ نے کہا کہ بلاشبہ تمہارے رب کا تم پر حق ہے اور تمہاری جان کا بھی تم پر حق ہے، تمہاری بیوی کا بھی تم پر حق ہے، پس سارے حق داروں کے حقوق ادا کرو۔ پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ سے اس کا ذکر کیا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ سلمان نے سچ کہا ہے۔ ابوجحیفہ کا نام وہب السوائی ہے، جسے وہب الخیر بھی کہتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6140,
			"arabicnumber": 6140,
			"text": "ہم سے عیاش بن ولید نے بیان کیا، کہا ہم سے عبدالاعلیٰ نے بیان کیا، کہا ہم سے سعید الجریری نے بیان کیا، ان سے ابوعثمان نہدی نے، ان سے عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے کہ ابوبکر رضی اللہ عنہ نے کچھ لوگوں کی میزبانی کی اور عبدالرحمٰن سے کہا کہ مہمانوں کا پوری طرح خیال رکھنا کیونکہ میں نبی کریم صلی اللہ علیہ وسلم کے پاس جاؤں گا، میرے آنے سے پہلے انہیں کھانا کھلا دینا۔ چنانچہ عبدالرحمٰن کھانا مہمانوں کے پاس لائے اور کہا کہ کھانا کھائیے۔ انہوں نے پوچھا کہ ہمارے گھر کے مالک کہاں ہیں؟ انہوں نے عرض کیا کہ آپ لوگ کھانا کھا لیں۔ مہمانوں نے کہا کہ جب تک ہمارے میزبان نہ آ جائیں ہم کھانا نہیں کھائیں گے۔ عبدالرحمٰن رضی اللہ عنہ نے عرض کیا کہ ہماری درخواست قبول کر لیجئے کیونکہ ابوبکر رضی اللہ عنہ کے آنے تک اگر آپ لوگ کھانے سے فارغ نہیں ہو گئے تو ہمیں ان کی خفگی کا سامنا ہو گا۔ انہوں نے اس پر بھی انکار کیا۔ میں جانتا تھا کہ ابوبکر رضی اللہ عنہ مجھ پر ناراض ہوں گے۔ اس لیے جب وہ آئے میں ان سے بچنے لگا۔ انہوں نے پوچھا: تم لوگوں نے کیا کیا؟ گھر والوں نے انہیں بتایا تو انہوں نے عبدالرحمٰن رضی اللہ عنہ کو پکارا! میں خاموش رہا۔ پھر انہوں نے پکارا! عبدالرحمٰن! میں اس مرتبہ بھی خاموش رہا۔ پھر انہوں نے کہا ارے پاجی میں تجھ کو قسم دیتا ہوں کہ اگر تو میری آواز سن رہا ہے تو باہر آ جا، میں باہر نکلا اور عرض کیا کہ آپ اپنے مہمانوں سے پوچھ لیں۔ مہمانوں نے بھی کہا عبدالرحمٰن سچ کہہ رہا ہے۔ وہ کھانا ہمارے پاس لائے تھے۔ آخر والد رضی اللہ عنہ نے کہا کہ تم لوگوں نے میرا انتظار کیا، اللہ کی قسم! میں آج رات کھانا نہیں کھاؤں گا۔ مہمانوں نے بھی قسم کھا لی اللہ کی قسم جب تک آپ نہ کھائیں ہم بھی نہ کھائیں گے۔ ابوبکر رضی اللہ عنہ نے کہا بھائی میں نے ایسی خراب بات کبھی نہیں دیکھی۔ مہمانو! تم لوگ ہماری میزبانی سے کیوں انکار کرتے ہو۔ خیر عبدالرحمٰن کھانا لا، وہ کھانا لائے تو آپ نے اس پر اپنا ہاتھ رکھ کر کہا، اللہ کے نام سے شروع کرتا ہوں، پہلی حالت ( کھانا نہ کھانے کی قسم ) شیطان کی طرف سے تھی۔ چنانچہ انہوں نے کھانا کھایا اور ان کے ساتھ مہمانوں نے بھی کھایا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6141,
			"arabicnumber": 6141,
			"text": "مجھ سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا، ان سے سلیمان ابن طرفان نے، ان سے ابوعثمان نہدی نے کہ عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ ابوبکر رضی اللہ عنہ اپنا ایک مہمان یا کئی مہمان لے کر گھر آئے۔ پھر آپ شام ہی سے نبی کریم صلی اللہ علیہ وسلم کے پاس چلے گئے، جب وہ لوٹ کر آئے تو میری والدہ نے کہا کہ آج اپنے مہمانوں کو چھوڑ کر آپ کہاں رہ گئے تھے۔ ابوبکر رضی اللہ عنہ نے پوچھا کیا تم نے ان کو کھانا نہیں کھلایا۔ انہوں نے کہا کہ ہم نے تو کھانا ان کے سامنے پیش کیا لیکن انہوں نے انکار کیا۔ یہ سن کر ابوبکر رضی اللہ عنہ کو غصہ آیا اور انہوں نے ( گھر والوں کی ) سرزنش کی اور دکھ کا اظہار کیا اور قسم کھا لی کہ میں کھانا نہیں کھاؤں گا۔ عبدالرحمٰن کہتے ہیں کہ میں تو ڈر کے مارے چھپ گیا تو آپ نے پکارا کہ اے پاجی! کدھر ہے تو ادھر آ۔ میری والدہ نے بھی قسم کھا لی کہ اگر وہ کھانا نہیں کھائیں گے تو وہ بھی نہیں کھائیں گی۔ اس کے بعد مہمانوں نے بھی قسم کھا لی کہ اگر ابوبکر رضی اللہ عنہ نہیں کھائیں گے تو وہ بھی نہیں کھائیں گے۔ آخر ابوبکر رضی اللہ عنہ نے کہا کہ یہ غصہ کرنا شیطانی کام تھا، پھر آپ نے کھانا منگوایا اور خود بھی مہمانوں کے ساتھ کھایا ( اس کھانے میں یہ برکت ہوئی ) جب یہ لوگ ایک لقمہ اٹھاتے تو نیچے سے کھانا اور بھی بڑھ جاتا تھے۔ ابوبکر رضی اللہ عنہ نے کہا: اے بنی فراس کی بہن! یہ کیا ہو رہا ہے، کھانا تو اور بڑھ گیا۔ انہوں نے کہا کہ میری آنکھوں کی ٹھنڈک! اب یہ اس سے بھی زیادہ ہو گیا۔ جب ہم نے کھانا کھایا بھی نہیں تھا۔ پھر سب نے کھایا اور اس میں سے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بھیجا، کہتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے بھی اس کھانے میں سے کھایا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6143,
			"arabicnumber": 6143,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6144,
			"arabicnumber": 6144,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن کثیر نے بیان کیا، ان سے عبیداللہ نے کہا کہ مجھ سے نافع نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اس درخت کا نام بتاؤ، جس کی مثال مسلمان کی سی ہے۔ وہ ہمیشہ اپنے رب کے حکم سے پھل دیتا ہے اور اس کے پتے نہیں جھڑا کرتے۔ میرے دل میں آیا کہ کہہ دوں کہ وہ کھجور کا درخت ہے لیکن میں نے کہنا پسند نہیں کیا۔ کیونکہ مجلس میں حضرات ابوبکر اور عمر رضی اللہ عنہما جیسے اکابر بھی موجود تھے۔ پھر جب ان دونوں بزرگوں نے کچھ نہیں کہا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ کھجور کا درخت ہے۔ جب میں اپنے والد کے ساتھ نکلا تو میں نے عرض کیا کہ میرے دل میں آیا کہ کہہ دوں یہ کھجور کا درخت ہے، انہوں نے کہا پھر تم نے کہا کیوں نہیں؟ اگر تم نے کہہ دیا ہوتا میرے لیے اتنا مال اور اسباب ملنے سے بھی زیادہ خوشی ہوتی۔ ابن عمر رضی اللہ عنہما نے بیان کیا کہ ( میں نے عرض کیا ) صرف اس وجہ سے میں نے نہیں کہا کہ جب میں نے آپ کو اور ابوبکر رضی اللہ عنہ جیسے بزرگ کو خاموش دیکھا تو میں نے آپ بزرگوں کے سامنے بات کرنا برا جانا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6145,
			"arabicnumber": 6145,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، انہوں نے کہا مجھ کو ابوبکر بن عبدالرحمٰن نے خبر دی، انہیں مروان بن حکم نے خبر دی، انہیں عبدالرحمٰن بن اسود بن عبد یغوث نے خبر دی، انہیں ابی بن کعب رضی اللہ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”بعض شعروں میں دانائی ہوتی ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6146,
			"arabicnumber": 6146,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے اسود بن قیس نے، انہوں نے کہا کہ میں نے جندب بن عبداللہ بجلی سے سنا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم چل رہے تھے کہ آپ کو پتھر سے ٹھوکر لگی اور آپ گر پڑے، اس سے آپ کی انگلی سے خون بہنے لگا، آپ صلی اللہ علیہ وسلم نے یہ شعر پڑھا ”تو تو اک انگلی ہے اور کیا ہے جو زخمی ہو گئی… کیا ہوا اگر راہ مولیٰ میں تو زخمی ہو گئی۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6147,
			"arabicnumber": 6147,
			"text": "ہم سے محمد بن بشار نے بیان کیا، انہوں نے کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، ان سے سفیان نے بیان کیا، ان سے عبدالملک نے، انہوں نے کہا ہم سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کی شعراء کے کلام میں سے سچا کلمہ لبید کا مصرعہ ہے جو یہ ہے کہ اللہ کے سوا جو کچھ ہے سب معدوم و فنا ہونے والا ہے۔ امیہ بن ابی الصلت شاعر تو قریب تھا کہ مسلمان ہو جائے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6148,
			"arabicnumber": 6148,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے حاتم بن اسماعیل نے، ان سے برید ابن ابی عبید نے اور ان سے سلمہ بن اکوع رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جنگ خیبر میں گئے اور ہم نے رات میں سفر کیا، اتنے میں مسلمانوں کے آدمی نے عامر بن اکوع رضی للہ عنہ سے کہا کہ اپنے کچھ شعر اشعار سناؤ۔ راوی نے بیان کیا کہ عامر شاعر تھے۔ وہ لوگوں کو اپنی حدی سنانے لگے۔ ”اے اللہ! اگر تو نہ ہوتا تو ہم ہدایت نہ پاتے نہ ہم صدقہ دے سکتے اور نہ نماز پڑھ سکتے۔ ہم تجھ پر فدا ہوں، ہم نے جو کچھ پہلے گناہ کئے ان کو تو معاف کر دے اور جب ( دشمن سے ) ہمارا سامنا ہو تو ہمیں ثابت قدم رکھ اور ہم پر سکون نازل فرما۔ جب ہمیں جنگ کے لیے بلایا جاتا ہے، تو ہم موجود ہو جاتے ہیں اور دشمن نے بھی پکار کر ہم سے نجات چاہی ہے۔“ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ کون اونٹوں کو ہانک رہا ہے جو حدی گا رہا ہے؟ صحابہ نے عرض کیا کہ عامر بن اکوع ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ پاک اس پر رحم کرے۔ ایک صحابی یعنی عمر رضی اللہ عنہ نے کہا: یا رسول اللہ! اب تو عامر شہید ہوئے۔ کاش اور چند روز آپ ہم کو عامر سے فائدہ اٹھانے دیتے۔ راوی نے بیان کیا کہ پھر ہم خیبر آئے اور اس کو گھیر لیا اس گھراؤ میں ہم شدید فاقوں میں مبتلا ہوئے، پھر اللہ تعالیٰ نے خیبر والوں پر ہم کو فتح عطا فرمائی جس دن ان پر فتح ہوئی اس کی شام کو لوگوں نے جگہ جگہ آگ جلائی۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا کہ یہ آگ کیسی ہے، کس کام کے لیے تم لوگوں نے یہ آگ جلائی ہے؟ صحابہ نے عرض کیا کہ گوشت پکانے کے لیے۔ اس پر آپ نے دریافت فرمایا کس چیز کے گوشت کے لیے؟ صحابہ نے کہا کہ بستی کے پالتو گدھوں کا گوشت پکانے کے لیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ گوشت کو برتنوں میں سے پھینک دو اور برتنوں کو توڑ دو۔ ایک صحابی نے عرض کیا: یا رسول اللہ! ہم گوشت تو پھینک دیں، مگر برتن توڑنے کے بجائے اگر دھو لیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اچھا یوں ہی کر لو۔ جب لوگوں نے جنگ کی صف بندی کر لی تو عامر ( ابن اکوع شاعر ) نے اپنی تلوار سے ایک یہودی پر وار کیا، ان کی تلوار چھوٹی تھی اس کی نوک پلٹ کر خود ان کے گھٹنوں پر لگی اور اس کی وجہ سے ان کی شہادت ہو گئی۔ جب لوگ واپس آنے لگے تو سلمہ ( عامر کے بھائی ) نے بیان کیا کہ مجھے نبی کریم صلی اللہ علیہ وسلم نے دیکھا کہ میرے چہرے کا رنگ بدلا ہوا ہے۔ دریافت فرمایا کہ کیا بات ہے؟ میں نے عرض کیا: یا رسول اللہ! پر میرے ماں اور باپ فدا ہوں، لوگ کہہ رہے ہیں کہ عامر کے اعمال برباد ہو گئے۔ ( کیونکہ ان کی موت خود ان کی تلوار سے ہوئی ہے ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا یہ کس نے کہا؟ میں نے عرض کیا: فلاں، فلاں، فلاں اور اسید بن حضیر انصاری نے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے یہ بات کہی اس نے جھوٹ کہا ہے انہیں تو دوہرا اجر ملے گا۔ نبی کریم صلی اللہ علیہ وسلم نے اپنی دو انگلیوں کو ملا کر اشارہ کیا کہ وہ عابد بھی تھا اور مجاہد بھی ( تو عبادت اور جہاد دونوں کا ثواب اس نے پایا ) عامر کی طرح تو بہت کم بہادر عرب میں پیدا ہوئے ہیں ( وہ ایسا بہادر اور نیک آدمی تھا ) ۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6149,
			"arabicnumber": 6149,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، کہا ہم سے ایوب سختیانی نے بیان کیا، ان سے ابوقلابہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ( ایک سفر کے موقع پر ) اپنی عورتوں کے پاس آئے جو اونٹوں پر سوار جا رہی تھیں، ان کے ساتھ ام سلیم رضی اللہ عنہا انس کی والدہ بھی تھیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ افسوس، انجشہ! شیشوں کو آہستگی سے لے چل۔ ابوقلابہ نے کہا کہ نبی کریم نے عورتوں سے متعلق ایسے الفاظ کا استعمال فرمایا کہ اگر تم میں کوئی شخص استعمال کرے تو تم اس پر عیب جوئی کرو۔ یعنی نبی کریم صلی اللہ علیہ وسلم کا یہ ارشاد کہ شیشوں کو نرمی سے لے چل۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6150,
			"arabicnumber": 6150,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم سے عبدہ نے بیان کیا، کہا ہم کو ہشام بن عروہ نے خبر دی، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہا کہ حسان بن ثابت رضی اللہ عنہ نے مشرکین کی ہجو کرنے کی اجازت چاہی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ان کا اور میرا خاندان تو ایک ہی ہے ( پھر تو میں بھی اس ہجو میں شریک ہو جاؤں گا ) ۔ حسان رضی اللہ عنہ نے کہا کہ میں ہجو سے آپ کو اس طرح صاف نکال دوں گا جس طرح گندھے ہوئے آٹے سے بال نکال لیا جاتا ہے۔ اور ہشام بن عروہ سے روایت ہے، ان سے ان کے والد نے بیان کیا کہ میں حسان بن ثابت رضی اللہ عنہ کو عائشہ رضی اللہ عنہا کی مجلس میں برا کہنے لگا تو انہوں نے کہا کہ حسان کو برا بھلا نہ کہو، وہ نبی کریم صلی اللہ علیہ وسلم کی طرف سے مشرکوں کو جواب دیتا تھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6151,
			"arabicnumber": 6151,
			"text": "ہم سے اصبغ بن فرج نے بیان کیا، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھے یونس نے خبر دی، انہیں ابن شہاب نے، انہیں ہشیم بن ابی سنان نے خبر دی کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا وہ حالات اور قصص کے تحت رسول اللہ صلی اللہ علیہ وسلم کا تذکرہ کر رہے تھے۔ کہ ایک دفعہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے ایک بھائی نے کوئی بری بات نہیں کہی۔ آپ کا اشارہ ابن رواحہ کی طرف تھا ( اپنے اشعار میں ) انہوں نے یوں کہا تھا ”اور ہم میں اللہ کے رسول ہیں جو اس کی کتاب کی تلاوت کرتے ہیں، اس وقت جب فجر کی روشنی پھوٹ کر پھیل جاتی ہے۔ ہمیں انہوں نے گمراہی کے بعد ہدایت کا راستہ دکھایا۔ پس ہمارے دل اس امر پر یقین رکھتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے جو کچھ فرمایا وہ ضرور واقع ہو گا۔ آپ رات اس طرح گزارتے ہیں کہ ان کا پہلو بستر سے جدا رہتا ہے ( یعنی جاگ کر ) جب کہ کافروں کے بوجھ سے ان کی خواب گاہیں بوجھل ہوئی رہتی ہیں۔“ یونس کے ساتھ اس حدیث کو عقیل نے بھی زہری سے روایت کیا اور محمد بن ولید زبیدی نے زہری سے، انہوں نے سعید بن مسیب سے اور عبدالرحمٰن اعرج سے انہوں نے ابوہریرہ رضی اللہ عنہ سے اس حدیث کو روایت کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6152,
			"arabicnumber": 6152,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا، ان سے سلیمان نے، ان سے محمد بن ابی عتیق نے، ان سے ابن شہاب نے، ان سے ابوسلمہ بن عبدالرحمٰن بن عوف نے، انہوں نے حسان بن ثابت انصاری رضی اللہ عنہ سے سنا، وہ ابوہریرہ رضی اللہ عنہ کو گواہ بنا کر کہہ رہے تھے کہ اے ابوہریرہ! میں آپ کو اللہ کی قسم دے کر پوچھتا ہوں، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اے حسان! اللہ کے رسول کی طرف سے مشرکوں کو جواب دو، اے اللہ! روح القدس کے ذریعہ ان کی مدد کر۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ ہاں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6153,
			"arabicnumber": 6153,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عدی بن ثابت نے اور ان سے براء بن عازب رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے حسان رضی اللہ عنہ سے فرمایا ان کی ہجو کرو ( یعنی مشرکین قریش کی ) ۔ یا نبی کریم صلی اللہ علیہ وسلم نے ( «هاجهم» کے الفاظ فرمائے ) جبرائیل علیہ السلام تیرے ساتھ ہیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6154,
			"arabicnumber": 6154,
			"text": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، انہوں نے کہا ہم کو حنظلہ نے خبر دی، انہیں سالم نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اگر تم میں سے کوئی شخص اپنا پیٹ پیپ سے بھرے تو یہ اس سے بہتر ہے کہ وہ اسے شعر سے بھرے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6155,
			"arabicnumber": 6155,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، انہوں نے کہا مجھ سے میرے والد نے بیان کیا، انہوں کہا ہم سے اعمش نے بیان کیا، کہا کہ میں نے ابوصالح سے سنا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم سے فرمایا ”اگر تم میں سے کوئی شخص اپنا پیٹ پیپ سے بھر لے تو یہ اس سے بہتر ہے کہ وہ شعروں سے بھر جائے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6156,
			"arabicnumber": 6156,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا کہا ہم سے لیث بن سعد نے بیان، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ابوقعیس کے بھائی افلح ( میرے رضاعی چچا نے ) مجھ سے پردہ کا حکم نازل ہونے کے بعد اندر آنے کی اجازت چاہی، میں نے کہا کہ اللہ کی قسم جب تک نبی کریم صلی اللہ علیہ وسلم اجازت نہ دیں گے میں اندر آنے کی اجازت نہیں دوں گی۔ کیونکہ ابوقعیس کے بھائی نے مجھے دودھ نہیں پلایا بلکہ ابوقعیس کی بیوی نے دودھ پلایا ہے۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے عرض کیا: یا رسول اللہ! مرد نے تو مجھے دودھ نہیں پلایا تھا، دودھ تو ان کی بیوی نے پلایا تھا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اندر آنے کی اجازت دے دو، کیونکہ وہ تمہارے چچا ہیں، تمہارے ہاتھ میں مٹی لگے۔ عروہ نے کہا کہ اسی وجہ سے عائشہ رضی اللہ عنہا کہتی تھیں کہ جتنے رشتے خون کی وجہ سے حرام ہوتے ہیں وہ رضاعت سے بھی حرام ہی سمجھو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6157,
			"arabicnumber": 6157,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، انہوں نے کہا ہم سے حکم بن عتیبہ نے بیان کیا، ان سے ابراہیم نخعی نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ( حج سے ) واپسی کا ارادہ کیا تو دیکھا کہ صفیہ رضی اللہ عنہا اپنے خیمے کے دروازہ پر رنجیدہ کھڑی ہیں کیونکہ وہ حائضہ ہو گئی تھیں۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا «عقرى حلقى» ( یہ قریش کا محاورہ ہے ) اب تم ہمیں روکو گی! پھر دریافت فرمایا کیا تم نے قربانی کے دن طواف افاضہ کر لیا تھا؟ انہوں نے کہا کہ جی ہاں، فرمایا کہ پھر چلو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6158,
			"arabicnumber": 6158,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، کہا ہم سے امام مالک نے، ان سے عمر بن عبیداللہ کے غلام ابوالنضر نے، ان سے ام ہانی بنت ابی طالب کے غلام ابو مرہ نے خبر دی کہ انہوں نے ام ہانی بنت ابی طالب سے سنا۔ انہوں نے بیان کیا کہ فتح مکہ کے موقع پر میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی۔ میں نے دیکھا کہ آپ غسل کر رہے ہیں اور آپ کی صاحبزادی فاطمہ رضی اللہ عنہا نے پردہ کر دیا ہے۔ میں نے سلام کیا تو نبی کریم صلی اللہ علیہ وسلم نے دریافت کیا کہ یہ کون ہیں؟ میں نے کہا کہ ام ہانی بنت ابی طالب ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ام ہانی! مرحبا ہو۔ جب آپ غسل کر چکے تو کھڑے ہو کر آٹھ رکعات پڑھیں۔ آپ اس وقت ایک کپڑے میں جسم مبارک کو لپیٹے ہوئے تھے۔ جب نماز سے فارغ ہو گئے تو میں نے عرض کیا: یا رسول اللہ! میرے بھائی ( علی بن ابی طالب رضی اللہ عنہ ) کا خیال ہے کہ وہ ایک ایسے شخص کو قتل کریں گے جسے میں نے امان دے رکھی ہے۔ یعنی فلاں بن ہبیرہ کو۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ام ہانی جسے تم نے امان دی اسے ہم نے بھی امان دی۔ ام ہانی نے بیان کیا کہ یہ نماز چاشت کی تھی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6159,
			"arabicnumber": 6159,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ہمام بن یحییٰ نے بیان کیا، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک شخص کو دیکھا کہ قربانی کے لیے ایک اونٹنی ہانکے لیے جا رہا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو کر جا، انہوں نے کہا کہ یہ تو قربانی کا جانور ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ سوار ہو جا، افسوس «ويلك» دوسری یا تیسری مرتبہ یہ فرمایا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6160,
			"arabicnumber": 6160,
			"text": "مجھ سے قتیبہ بن سعید نے بیان کیا، وہ امام مالک سے روایت کرتے ہیں، وہ ابوالزناد سے، وہ اعرج سے، وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو دیکھا کہ قربانی کا اونٹ ہنکائے جا رہا ہے۔ آپ صلی اللہ علیہ وسلم نے اس سے کہا کہ تو اس پر سوار ہو جا۔ اس نے عرض کیا: یا رسول اللہ! یہ تو قربانی کا اونٹ ہے۔ آپ صلی اللہ علیہ وسلم نے دوسری بار یا تیسری بار فرمایا کہ تیری خرابی ہو، تو سوار ہو جا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6161,
			"arabicnumber": 6161,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ثابت بنانی نے اور ان سے انس بن مالک رضی اللہ عنہ نے (دوسری سند) اور اس حدیث کو حماد نے ایوب سختیانی سے اور ایوب نے ابوقلابہ سے روایت کیا اور ان سے انس بن مالک رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم ایک سفر میں تھے اور آپ کے ساتھ آپ کا ایک حبشی غلام تھا۔ ان کا نام انجشہ تھا وہ حدی پڑھ رہا تھا ( جس کی وجہ سے سواری تیز چلنے لگی ) ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”افسوس «ويحك» اے انجشہ! شیشوں کے ساتھ آہستہ آہستہ چل۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6162,
			"arabicnumber": 6162,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ان سے خالد نے، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے سامنے ایک شخص نے دوسرے شخص کی تعریف کی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا افسوس «ويلك» تم نے اپنے بھائی کی گردن کاٹ دی، تین مرتبہ ( یہ فرمایا ) اگر تمہیں کسی کی تعریف ہی کرنی پڑ جائے تو یہ کہو کہ فلاں کے متعلق میرا یہ خیال ہے۔ اگر وہ بات اس کے متعلق جانتا ہو اور اللہ اس کا نگراں ہے میں تو اللہ کے مقابلے میں کسی کو نیک نہیں کہہ سکتا یعنی یوں نہیں کہہ سکتا کہ وہ اللہ کے علم میں بھی نیک ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6163,
			"arabicnumber": 6163,
			"text": "مجھ سے عبدالرحمٰن بن ابراہیم نے بیان کیا، کہا ہم سے ولید نے بیان کیا، ان سے امام اوزاعی نے، ان سے زہری نے، ان سے ابوسلمہ اور ضحاک نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ ایک دن نبی کریم صلی اللہ علیہ وسلم کچھ تقسیم کر رہے تھے۔ بنی تمیم کے ایک شخص ذوالخویصرۃ نے کہا: یا رسول اللہ! انصاف سے کام لیجئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، افسوس! اگر میں ہی انصاف نہیں کروں گا تو پھر کون کرے گا۔ عمر رضی اللہ عنہ نے کہا: یا رسول اللہ! مجھے اجازت دیں تو میں اس کی گردن مار دوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ اس کے کچھ ( قبیلہ والے ) ایسے لوگ پیدا ہوں گے کہ تم ان کی نماز کے مقابلہ میں اپنی نماز کو معمولی سمجھو گے اور ان کے روزوں کے مقابلہ میں اپنے روزے کو معمولی سمجھو گے لیکن وہ دین سے اس طرح نکل چکے ہوں گے جس طرح تیر شکار سے نکل جاتا ہے۔ تیر کے پھل میں دیکھا جائے تو اس پر بھی کوئی نشان نہیں ملے گا۔ اس کی لکڑی پر دیکھا جائے تو اس پر بھی کوئی نشان نہیں ملے گا۔ پھر اس کے دندانوں میں دیکھا جائے اور اس میں بھی کچھ نہیں ملے گا پھر اس کے پر میں دیکھا جائے تو اس میں بھی کچھ نہیں ملے گا۔ ( یعنی شکار کے جسم کو پار کرنے کا کوئی نشان ) تیر لید اور خون کو پار کر کے نکل چکا ہو گا۔ یہ لوگ اس وقت پیدا ہوں گے جب لوگوں میں پھوٹ پڑ جائے گی۔ ( ایک خلیفہ پر متفق نہ ہوں گے ) ان کی نشانی ان کا ایک مرد ( سردار لشکر ) ہو گا۔ جس کا ایک ہاتھ عورت کے پستان کی طرح ہو گا یا ( فرمایا ) گوشت کے لوتھڑے کی طرح تھل تھل ہل رہا ہو گا۔ ابوسعید رضی اللہ عنہ نے بیان کیا کہ میں گواہی دیتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ حدیث سنی اور میں گواہی دیتا ہوں کہ میں علی رضی اللہ عنہ کے ساتھ تھا۔ جب انہوں نے ان خارجیوں سے ( نہروان میں ) جنگ کی تھی۔ مقتولین میں تلاش کی گئی تو ایک شخص انہیں صفات کا لایا گیا جو نبی کریم صلی اللہ علیہ وسلم نے بیان کی تھیں۔ اس کا ایک ہاتھ پستان کی طرح کا تھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6164,
			"arabicnumber": 6164,
			"text": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو امام اوزاعی نے خبر دی، کہا کہ مجھ کو ابن شہاب نے خبر دی، بیان کیا ان سے حمید بن عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ ایک صحابی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا: یا رسول اللہ! میں تو تباہ ہو گیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، افسوس ( کیا بات ہوئی؟ ) انہوں نے کہا کہ میں نے رمضان میں اپنی بیوی سے صحبت کر لی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر ایک غلام آزاد کر۔ انہوں نے عرض کیا کہ میرے پاس غلام ہے ہی نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر دو مہینے متواتر روزے رکھ۔ اس نے کہا کہ اس کی مجھ میں طاقت نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر ساٹھ مسکینوں کو کھانا کھلا۔ کہا کہ اتنا بھی میں اپنے پاس نہیں پاتا۔ اس کے بعد کھجور کا ایک ٹوکرا آیا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے لے اور صدقہ کر دے۔ انہوں نے عرض کیا: یا رسول اللہ! کیا اپنے گھر والوں کے سوا کسی اور کو؟ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! سارے مدینہ کے دونوں طنابوں یعنی دونوں کناروں میں مجھ سے زیادہ کوئی محتاج نہیں۔ نبی کریم صلی اللہ علیہ وسلم اس پر اتنا ہنس دیئے کہ آپ کے آگے کے دندان مبارک دکھائی دینے لگے۔ فرمایا کہ جاؤ تم ہی لے لو۔ اوازاعی کے ساتھ اس حدیث کو یونس نے بھی زہری سے روایت کیا اور عبدالرحمٰن بن خالد نے زہری سے اس حدیث میں بجائے لفظ «ويحك» کے لفظ «ويلك‏.‏» روایت کیا ہے ( معنی دونوں کے ایک ہی ہیں ) ۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6165,
			"arabicnumber": 6165,
			"text": "ہم سے سلیمان بن عبدالرحمٰن نے بیان کیا، انہوں نے کہا ہم سے ولید نے بیان کیا، انہوں نے کہا ہم سے ابوعمرو اوزاعی نے بیان کیا، کہا کہ مجھ سے ابن شہاب زہری نے بیان کیا، ان سے عطاء بن یزید لیثی نے اور ان سے ابو سعید خدری نے کہ ایک دیہاتی نے کہا: یا رسول اللہ! ہجرت کے بارے میں مجھے کچھ بتائیے ( اس کی نیت ہجرت کی تھی ) ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تجھ پر افسوس! ہجرت کو تو نے کیا سمجھا ہے یہ بہت مشکل ہے۔ تمہارے پاس کچھ اونٹ ہیں۔ انہوں نے عرض کیا کہ جی ہاں، نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کیا تم ان کی زکوٰۃ ادا کرتے ہو؟ انہوں نے عرض کیا کہ جی ہاں، فرمایا کہ پھر سات سمندر پار عمل کرتے رہو۔ اللہ تمہارے کسی عمل کے ثواب کو ضائع نہ کرے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6166,
			"arabicnumber": 6166,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، انہوں نے کہا ہم سے خالد بن حارث نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے واقد بن محمد بن زید نے بیان کیا، انہوں نے ان کے والد سے سنا اور انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، افسوس ( «ويلكم» یا «ويحكم» ) شعبہ نے بیان کیا کہ شک ان کے شیخ ( واقد بن محمد کو ) تھا۔ میرے بعد تم کافر نہ ہو جانا کہ ایک دوسرے کی گردن مارنے لگو۔ اور نضر نے شعبہ سے بیان کیا «ويحكم» اور عمر بن محمد نے اپنے والد سے «ويلكم» یا «ويحكم» کے لفظ نقل کئے ہیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6167,
			"arabicnumber": 6167,
			"text": "ہم سے عمرو بن عاصم نے بیان کیا، کہا ہم سے ہمام بن یحییٰ نے بیان کیا، ان سے قتادہ نے اور ان سے انس نے کہ ایک بدوی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور پوچھا: یا رسول اللہ! قیامت کب آئے گی؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، افسوس «ويلك» تم نے اس قیامت کے لیے کیا تیاری کر لی ہے؟ انہوں نے عرض کیا میں نے اس کے لیے تو کوئی تیاری نہیں کی ہے البتہ میں اللہ اور اس کے رسول سے محبت رکھتا ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم قیامت کے دن ان کے ساتھ ہو، جس سے تم محبت رکھتے ہو۔ ہم نے عرض کیا اور ہمارے ساتھ بھی یہی معاملہ ہو گا؟ فرمایا کہ ہاں۔ ہم اس دن بہت زیادہ خوش ہوئے، پھر مغیرہ کے ایک غلام وہاں سے گزرے وہ میرے ہم عمر تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر یہ بچہ زندہ رہا تو اس کے بڑھاپا آنے سے پہلے قیامت قائم ہو جائے گی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6168,
			"arabicnumber": 6168,
			"text": "ہم سے بشر بن خالد نے بیان کیا، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے سلیمان نے، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”انسان اس کے ساتھ ہے جس سے وہ محبت رکھتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6169,
			"arabicnumber": 6169,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر بن عبدالحمید نے بیان کیا، ان سے اعمش نے، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود نے کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا: یا رسول اللہ! آپ کا اس شخص کے بارے میں کیا ارشاد ہے جو ایک جماعت سے محبت رکھتا ہے لیکن ان سے میل نہیں ہو سکا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انسان اس کے ساتھ ہے جس سے وہ محبت رکھتا ہے۔ اس روایت کی متابعت جریر بن حازم، سلیمان بن قرم اور ابوعوانہ نے اعمش سے کی، ان سے ابووائل نے، ان سے عبداللہ بن مسعود نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6170,
			"arabicnumber": 6170,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے اعمش نے، ان سے ابووائل نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سے عرض کیا گیا ایک شخص ایک جماعت سے محبت رکھتا ہے لیکن اس سے مل نہیں سکا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انسان اس کے ساتھ ہے جس سے وہ محبت رکھتا ہے۔ سفیان کے ساتھ اس روایت کی متابعت ابومعاویہ اور محمد بن عبید نے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6171,
			"arabicnumber": 6171,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو ہمارے والد عثمان مروزی نے خبر دی، انہیں شعبہ نے، انہیں عمرو بن مرہ نے، انہیں سالم بن ابی الجعد نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا: یا رسول اللہ! قیامت کب قائم ہو گی؟ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تم نے اس کے لیے کیا تیاری کی ہے؟ انہوں نے عرض کیا کہ میں نے اس کے لیے بہت ساری نمازیں، روزے اور صدقے نہیں تیار کر رکھے ہیں، لیکن میں اللہ اور اس کے رسول سے محبت رکھتا ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم اس کے ساتھ ہو جس سے تم محبت رکھتے ہو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6172,
			"arabicnumber": 6172,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے مسلم بن زریر نے بیان کیا، کہا میں نے ابورجاء سے سنا اور انہوں نے ابن عباس رضی اللہ عنہما سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے ابن صیاد سے فرمایا ”میں نے اس وقت اپنے دل میں ایک بات چھپا رکھی ہے، وہ کیا ہے؟“ وہ بولا «الدخ‏.‏» نبی کریم صلی اللہ علیہ وسلم نے فرمایا چل دور ہو جا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 6175,
			"arabicnumber": 6175,
			"text": "سالم نے بیان کیا کہ عبداللہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم لوگوں کے مجمع میں کھڑے ہوئے اور اللہ کی اس کی شان کے مطابق تعریف کرنے کے بعد آپ صلی اللہ علیہ وسلم نے دجال کا ذکر کیا اور فرمایا کہ میں تمہیں اس سے ڈراتا ہوں۔ کوئی نبی ایسا نہیں گزرا جس نے اپنی قوم کو اس سے نہ ڈرایا ہو۔ نوح علیہ السلام نے اپنی قوم کو اس سے ڈرایا لیکن میں اس کی تمہیں ایک ایسی نشانی بتاؤں گا جو کسی نبی نے اپنی قوم کو نہیں بتائی تم جانتے ہو کہ وہ کانا ہو گا اور اللہ کانا نہیں ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6176,
			"arabicnumber": 6176,
			"text": "ہم سے عمران بن میسرہ نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، ان سے ابوالتیاح یزید بن حمید نے بیان کیا، ان سے ابوحمزہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ جب قبیلہ عبدالقیس کا وفد نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مرحبا ان لوگوں کو جو آن پہنچے تو نہ وہ ذلیل ہوئے، نہ شرمندہ ( خوشی سے مسلمان ہو گئے ورنہ مارے جاتے شرمندہ ہوتے ) انہوں نے عرض کیا: یا رسول اللہ! ہم قبیلہ ربیع کی شاخ سے تعلق رکھتے ہیں اور چونکہ ہمارے اور آپ کے درمیان قبیلہ مضر کے کافر لوگ حائل ہیں اس لیے ہم آپ کی خدمت میں صرف حرمت والے مہینوں ہی میں حاضر ہو سکتے ہیں ( جن میں لوٹ کھسوٹ نہیں ہوتی ) آپ کچھ ایسی جچی تلی بات بتا دیں جس پر عمل کرنے سے ہم جنت میں داخل ہو جائیں اور جو لوگ نہیں آ سکے ہیں انہیں بھی اس کی دعوت پہنچائیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ چار چار چیزیں ہیں۔ نماز قائم کرو، زکوٰۃ دو، رمضان کے روزے رکھو اور غنیمت کا پانچواں حصہ ( بیت المال کو ) ادا کرو اور دباء، حنتم، نقیر اور مزفت میں نہ پیو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 6177,
			"arabicnumber": 6177,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے عبیداللہ عمری نے، ان سے نافع نے ان سے ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”عہد توڑنے والے کے لیے قیامت میں ایک جھنڈا اٹھایا جائے گا اور پکار دیا جائے گا کہ یہ فلاں بن فلاں کی دغا بازی کا نشان ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6178,
			"arabicnumber": 6178,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”عہد توڑنے والے کے لیے قیامت میں ایک جھنڈا اٹھایا جائے گا اور پکارا جائے گا کہ یہ فلاں بن فلاں کی دغا بازی کا نشان ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6179,
			"arabicnumber": 6179,
			"text": "ہم سے محمد بن یوسف نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”تم میں کوئی شخص یہ نہ کہے کہ میرا نفس پلید ہو گیا ہے بلکہ یہ کہے کہ میرا دل خراب یا پریشان ہو گیا۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6180,
			"arabicnumber": 6180,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، وہ یونس سے روایت کرتے ہیں، وہ زہری سے، وہ ابوامامہ بن سہل سے، وہ اپنے باپ سے، وہ نبی کریم صلی اللہ علیہ وسلم سے، آپ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے کوئی ہرگز یوں نہ کہے کہ میرا نفس پلید ہو گیا لیکن یوں کہہ سکتا ہے کہ میرا دل خراب یا پریشان ہو گیا۔“ اس حدیث کو عقیل نے بھی ابن شہاب سے روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6181,
			"arabicnumber": 6181,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یونس نے بیان کیا، ان سے ابن شہاب نے بیان کیا، انہیں ابوسلمہ نے خبر دی، انہوں نے کہا کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اللہ تعالیٰ فرماتا ہے کہ انسان زمانہ کو گالی دیتا ہے حالانکہ میں ہی زمانہ ہوں، میرے ہی ہاتھ میں رات اور دن ہیں۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6182,
			"arabicnumber": 6182,
			"text": "ہم سے عیاش بن ولید نے بیان کیا، کہا ہم سے عبدالاعلیٰ نے بیان کیا، کہا ہم سے معمر نے بیان کیا، ان سے زہری نے، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”انگور «عنب» کو «كرم» نہ کہو اور یہ نہ کہو کہ ہائے زمانہ کی نامرادی۔ کیونکہ زمانہ تو اللہ ہی کے اختیار میں ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6183,
			"arabicnumber": 6183,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے زہری نے بیان کیا، ان سے سعید بن مسیب نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”لوگ ( انگور کو ) «كرم» کہتے ہیں، «كرم» تو مومن کا دل ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 6184,
			"arabicnumber": 6184,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ قطان نے بیان کیا، ان سے سفیان ثوری نے، ان سے سعد بن ابراہیم نے، ان سے عبداللہ بن شداد نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کسی کے لیے اپنے آپ کو قربان کرنے کا لفظ کہتے نہیں سنا، سوا سعد بن ابی وقاص کے۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرما رہے تھے۔ تیر مار، اے سعد! میرے ماں باپ تم پر قربان ہوں، میرا خیال ہے کہ یہ غزوہ احد کے موقع پر فرمایا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6185,
			"arabicnumber": 6185,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے بشر بن مفضل نے بیان کیا، کہا ہم سے یحییٰ بن ابی اسحاق نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے کہ وہ اور ابوطلحہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( مدینہ منورہ کے لیے ) روانہ ہوئے۔ ام المؤمنین صفیہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کی سواری پر آپ کے پیچھے تھیں، راستہ میں کسی جگہ اونٹنی کا پاؤں پھسل گیا اور نبی کریم صلی اللہ علیہ وسلم اور ام المؤمنین گر گئے۔ انس رضی اللہ عنہ نے بیان کیا کہ میرا خیال ہے ابوطلحہ نے اپنی سواری سے فوراً اپنے کو گرا دیا اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچ گئے اور عرض کیا: یا نبی اللہ! اللہ آپ پر مجھے قربان کرے کیا آپ کو کوئی چوٹ آئی؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں، البتہ عورت کو دیکھو۔ چنانچہ ابوطلحہ رضی اللہ عنہ نے کپڑا اپنے چہرے پر ڈال لیا، پھر ام المؤمنین کی طرف بڑھے اور اپنا کپڑا ان کے اوپر ڈال دیا۔ اس کے بعد وہ کھڑی ہو گئیں اور نبی کریم صلی اللہ علیہ وسلم اور ام المؤمنین کے لیے ابوطلحہ نے پالان مضبوط باندھا۔ اب آپ نے سوار ہو کر پھر سفر شروع کیا، جب مدینہ منورہ کے قریب پہنچے ( یا یوں کہا کہ مدینہ دکھائی دینے لگا ) تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا «آيبون تائبون،‏‏‏‏ عابدون لربنا حامدون» ”ہم لوٹنے والے ہیں توبہ کرتے ہوئے اپنے رب کی عبادت کرتے ہوئے اور اس کی حمد بیان کرتے ہوئے۔“ نبی کریم صلی اللہ علیہ وسلم اسے برابر کہتے رہے یہاں تک کہ مدینہ میں داخل ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6186,
			"arabicnumber": 6186,
			"text": "ہم سے صدقہ بن فضل نے بیان کیا، کہا ہم کو سفیان بن عیینہ نے خبر دی، ان سے ابن المنکدر نے بیان کیا اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ ہم میں سے ایک صاحب کے یہاں بچہ پیدا ہوا تو انہوں نے اس کا نام قاسم رکھا۔ ہم نے ان سے کہا کہ ہم تم کو ابوالقاسم کہہ کر نہیں پکاریں گے ( کیونکہ ابوالقاسم نبی کریم صلی اللہ علیہ وسلم کی کنیت تھی ) اور نہ ہم تمہاری عزت کے لیے ایسا کریں گے۔ ان صاحب نے اس کی خبر نبی کریم صلی اللہ علیہ وسلم کو دی، تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اپنے بیٹے کا نام عبدالرحمٰن رکھ لے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6187,
			"arabicnumber": 6187,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے خالد نے بیان کیا، کہا ہم سے حصین نے بیان کیا، ان سے سالم نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ ہم میں سے ایک شخص کے یہاں بچہ پیدا ہوا تو انہوں نے اس کا نام قاسم رکھا۔ صحابہ نے ان سے کہا کہ جب تک ہم نبی کریم صلی اللہ علیہ وسلم سے نہ پوچھ لیں۔ ہم اس نام پر تمہاری کنیت نہیں ہونے دیں گے۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میرے نام پر نام رکھو لیکن میری کنیت نہ اختیار کرو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6188,
			"arabicnumber": 6188,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ایوب سختیانی نے، ان سے محمد بن سیرین نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ”میرے نام پر نام رکھو لیکن میری کنیت نہ رکھو۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6189,
			"arabicnumber": 6189,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، کہا کہ میں نے محمد بن المنکدر سے سنا کہ کہا کہ میں نے جابر بن عبداللہ انصاری رضی اللہ عنہما سے سنا کہ ہم میں سے ایک آدمی کے یہاں بچہ پیدا ہوا تو انہوں نے اس کا نام قاسم رکھا۔ صحابہ نے کہا کہ ہم تمہاری کنیت ابوالقاسم نہیں رکھیں گے اور نہ تیری آنکھ اس کنیت سے پکار کر ٹھنڈی کریں گے۔ وہ شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے اس کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے لڑکے کا نام عبدالرحمٰن رکھ لو۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6190,
			"arabicnumber": 6190,
			"text": "ہم سے اسحاق بن نصر نے بیان کیا، انہوں نے نے کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں سعید بن مسیب نے اور انہیں ان کے والد مسیب رضی اللہ عنہ نے کہ ان کے والد ( حزن بن ابی وہب ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارا نام کیا ہے؟ انہوں نے بتایا کہ «حزن» ( بمعنی سختی ) ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم «سهل» ( بمعنی نرمی ) ہو، پھر انہوں نے کہا کہ میرا نام میرے والد رکھ گئے ہیں اسے میں نہیں بدلوں گا۔ ابن مسیب رحمہ اللہ بیان کرتے تھے کہ چنانچہ ہمارے خاندان میں بعد تک ہمیشہ سختی اور مصیبت کا دور رہا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6191,
			"arabicnumber": 6191,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم سے ابوغسان نے بیان کیا، کہا کہ مجھ سے ابوحازم نے بیان کیا اور ان سے سہل رضی اللہ عنہ نے بیان کیا کہ منذر بن ابی اسید رضی اللہ عنہ کی ولادت ہوئی تو انہیں نبی کریم صلی اللہ علیہ وسلم کے پاس لایا گیا۔ نبی کریم صلی اللہ علیہ وسلم نے بچہ کو اپنی ران پر رکھ لیا۔ ابواسید رضی اللہ عنہ بیٹھے ہوئے تھے۔ نبی کریم صلی اللہ علیہ وسلم کسی چیز میں جو سامنے تھی مصروف ہو گئے ( اور بچہ کی طرف توجہ ہٹ گئی ) ۔ ابواسید رضی اللہ عنہ نے بچہ کے متعلق حکم دیا اور نبی کریم صلی اللہ علیہ وسلم کی ران سے اٹھا لیا گیا۔ پھر جب نبی کریم صلی اللہ علیہ وسلم متوجہ ہوئے تو فرمایا کہ بچہ کہاں ہے؟ ابواسید رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! ہم نے اسے گھر بھیج دیا۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا: اس کا نام کیا ہے؟ عرض کیا کہ فلاں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، بلکہ اس کا نام منذر ہے۔ چنانچہ اسی دن نبی کریم صلی اللہ علیہ وسلم نے ان کا یہی نام منذر رکھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6192,
			"arabicnumber": 6192,
			"text": "ہم سے صدقہ بن فضل نے بیان کیا، انہوں نے کہا ہم کو محمد بن جعفر نے خبر دی، انہیں شعبہ نے، انہیں عطاء بن ابی میمونہ نے، انہیں ابورافع نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ ام المؤمنین زینب رضی اللہ عنہا کا نام برہ تھا، کہا جانے لگا کہ وہ اپنی پاکی ظاہر کرتی ہیں۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے ان کا نام زینب رکھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6193,
			"arabicnumber": 6193,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم سے ہشام بن یوسف نے بیان کیا، انہیں ابن جریج نے خبر دی، کہا مجھ کو عبدالحمید بن جبیر بن شیبہ نے خبر دی، کہا کہ میں سعید بن مسیب کے پاس بیٹھا ہوا تھا تو انہوں نے مجھ سے بیان کیا کہ ان کے دادا حزن نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارا نام کیا ہے؟ انہوں نے کہا کہ میرا نام حزن ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم سہل ہو، انہوں نے کہا کہ میں تو اپنے باپ کا رکھا ہوا نام نہیں بدلوں گا۔ سعید بن مسیب نے کہا اس کے بعد سے اب تک ہمارے خاندان میں سختی اور مصیبت ہی رہی۔ «حزونة» سے صعوبت مراد ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 6194,
			"arabicnumber": 6194,
			"text": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے محمد بن بشر نے، ان سے اسماعیل بن ابی خالد بجلی نے، کہ میں نے ابن ابی اوفی سے پوچھا۔ تم نے نبی کریم صلی اللہ علیہ وسلم کے صاحبزادے ابراہیم کو دیکھا تھا؟ بیان کیا کہ ان کی وفات بچپن ہی میں ہو گئی تھی اور اگر نبی کریم صلی اللہ علیہ وسلم کے بعد کسی نبی کی آمد ہوتی تو نبی کریم صلی اللہ علیہ وسلم کے صاحبزادے زندہ رہتے لیکن نبی کریم صلی اللہ علیہ وسلم کے بعد کوئی نبی نہیں آئے گا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 6195,
			"arabicnumber": 6195,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم کو شعبہ نے خبر دی، انہیں عدی بن ثابت نے کہا کہ میں نے براء رضی اللہ عنہ سے سنا، بیان کیا کہ جب آپ کے فرزند ابراہیم علیہ السلام کا انتقال ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اس کے لیے جنت میں ایک دودھ پلانے والی دایہ مقرر ہو گئی ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 6196,
			"arabicnumber": 6196,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے حصین بن عبدالرحمٰن نے، ان سے سالم بن ابی الجعد نے اور ان سے جریر بن عبداللہ انصاری نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میرے نام پر نام رکھو، لیکن میری کنیت نہ اختیار کرو کیونکہ میں قاسم ( تقسیم کرنے والا ) ہوں اور تمہارے درمیان ( علوم دین کو ) تقسیم کرتا ہوں۔“ اور اس روایت کو انس رضی اللہ عنہ نے بھی نبی کریم صلی اللہ علیہ وسلم سے نقل کیا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 6197,
			"arabicnumber": 6197,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا، انہوں نے کہا ہم سے ابوحصین نے بیان کیا، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”تم میرے نام پر نام رکھو لیکن تم میری کنیت نہ اختیار کرو اور جس نے مجھے خواب میں دیکھا تو اس نے مجھے ہی دیکھا کیونکہ شیطان میری صورت میں نہیں آ سکتا اور جس نے قصداً میری طرف کوئی جھوٹی بات منسوب کی اس نے اپنا ٹھکانا جہنم میں بنا لیا۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 6198,
			"arabicnumber": 6198,
			"text": "ہم سے محمد بن علاء نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے برید بن عبداللہ بن ابی بردہ نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ میرے یہاں ایک بچہ پیدا ہوا تو میں اسے لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ نبی کریم صلی اللہ علیہ وسلم نے اس کا نام ابراہیم رکھا اور ایک کھجور اپنے دہان مبارک میں نرم کر کے اس کے منہ میں ڈالی اور اس کے لیے برکت کی دعا کی پھر اسے مجھے دے دیا۔ یہ ابوموسیٰ کی بڑی اولاد تھی۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 6199,
			"arabicnumber": 6199,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے زائدہ نے، کہا ہم سے زیاد بن علاقہ نے، کہا ہم نے مغیرہ بن شعبہ رضی اللہ عنہ سے سنا، بیان کیا کہ جس دن ابراہیم رضی اللہ عنہ کی وفات ہوئی اس دن سورج گرہن ہوا تھا۔ اس کو ابوبکرہ نے بھی نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 6200,
			"arabicnumber": 6200,
			"text": "ہم سے ابونعیم فضل بن دکین نے خبر دی، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے زہری نے بیان کیا، ان سے سعید نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ جب نبی کریم صلی اللہ علیہ وسلم نے سر مبارک رکوع سے اٹھایا تو یہ دعا کی «اللهم أنج الوليد بن الوليد وسلمة بن هشام،‏‏‏‏ وعياش بن أبي ربيعة،‏‏‏‏ والمستضعفين بمكة» ”اے اللہ! ولید بن ولید، سلمہ بن ہشام، عیاش بن ابی ربیعہ اور مکہ میں دیگر موجود کمزور مسلمانوں کو نجات دیدے۔“ «اللهم اشدد وطأتك على مضر،‏‏‏‏ اللهم اجعلها عليهم سنين كسني يوسف» ”اے اللہ! قبیلہ مضر کے کفاروں کو سخت پکڑ، اے اللہ! ان پر یوسف علیہ السلام کے زمانہ جیسا قحط نازل فرما۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 6201,
			"arabicnumber": 6201,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”یا عائش! یہ جبرائیل علیہ السلام ہیں اور تمہیں سلام کہتے ہیں۔“ میں نے کہا اور ان پر بھی سلام اور اللہ کی رحمت ہو۔ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم وہ چیزیں دیکھتے تھے جو ہم نہیں دیکھتے تھے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 6202,
			"arabicnumber": 6202,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے ایوب نے بیان کیا، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ ام سلیم رضی اللہ عنہا مسافروں کے سامان کے ساتھ تھیں اور نبی کریم صلی اللہ علیہ وسلم کے غلام انجشہ عورتوں کے اونٹ کو ہانک رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”انجش! ذرا اس طرح آہستگی سے لے چل جیسے شیشوں کو لے کر جاتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 6203,
			"arabicnumber": 6203,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، ان سے ابوالتیاح نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم حسن اخلاق میں سب لوگوں سے بڑھ کر تھے، میرا ایک بھائی ابوعمیر نامی تھا۔ بیان کیا کہ میرا خیال ہے کہ بچہ کا دودھ چھوٹ چکا تھا۔ نبی کریم صلی اللہ علیہ وسلم جب تشریف لاتے تو اس سے مزاحاً فرماتے «يا أبا عمير ما فعل النغير» اکثر ایسا ہوتا کہ نماز کا وقت ہو جاتا اور نبی کریم صلی اللہ علیہ وسلم ہمارے گھر میں ہوتے۔ آپ اس بستر کو بچھانے کا حکم دیتے جس پر آپ بیٹھے ہوئے ہوتے، چنانچہ اسے جھاڑ کر اس پر پانی چھڑک دیا جاتا۔ پھر آپ کھڑے ہوتے اور ہم آپ کے پیچھے کھڑے ہوتے اور آپ ہمیں نماز پڑھاتے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 6204,
			"arabicnumber": 6204,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، انہوں نے کہا ہم سے سلیمان نے بیان کیا، انہوں نے کہا کہ مجھے ابوحازم نے بیان کیا، ان سے سہل بن سعد نے کہ علی رضی اللہ عنہ کو ان کی کنیت ابوتراب سب سے زیادہ پیاری تھی اور اس کنیت سے انہیں پکارا جاتا تو بہت خوش ہوتے تھے کیونکہ یہ کنیت ابوتراب خود رسول اللہ صلی اللہ علیہ وسلم نے رکھی تھی۔ ایک دن فاطمہ رضی اللہ عنہا سے خفا ہو کر وہ باہر چلے آئے اور مسجد کی دیوار کے پاس لیٹ گئے۔ نبی کریم صلی اللہ علیہ وسلم ان کے پیچھے آئے اور فرمایا کہ یہ تو دیوار کے پاس لیٹے ہوئے ہیں۔ جب نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو علی رضی اللہ عنہ کی پیٹھ مٹی سے بھر چکی تھی۔ نبی کریم صلی اللہ علیہ وسلم ان کی پیٹھ سے مٹی جھاڑتے ہوئے ( پیار سے ) فرمانے لگے ابوتراب اٹھ جاؤ۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 6205,
			"arabicnumber": 6205,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، کہا ہم سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”قیامت کے دن اللہ کے نزدیک سب سے بدترین نام اس کا ہو گا جو اپنا نام ملک الاملاک ( شہنشاہ ) رکھے۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 6206,
			"arabicnumber": 6206,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ اللہ کے نزدیک سب سے بدترین نام۔ اور کبھی سفیان نے ایک سے زیادہ مرتبہ یہ روایت اس طرح بیان کیا کہ اللہ کے نزدیک سب سے بدترین ناموں ( جمع کے صیغے کے ساتھ ) میں اس کا نام ہو گا جو ”ملک الاملاک“ اپنا نام رکھے گا۔ سفیان نے بیان کیا کہ ابوالزناد کے غیر نے کہا کہ اس کا مفہوم ہے ”شاہان شاہ“۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 6207,
			"arabicnumber": 6207,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، انہیں زہری نے (دوسری سند) اور ہم سے اسماعیل بن ابی اویس نے بیان کیا، انہوں نے کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا، ان سے سلیمان نے بیان کیا، ان سے محمد بن ابی عتیق نے بیان کیا، ان سے ابن ابی شہاب نے بیان کیا، ان سے عروہ بن زبیر نے اور انہیں اسامہ بن زید رضی اللہ عنہما نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم ایک گدھے پر سوار ہوئے جس پر فدک کا بنا ہوا ایک کپڑا بچھا ہوا تھا، اسامہ آپ کے پیچھے سوار تھے۔ نبی کریم صلی اللہ علیہ وسلم بنی حارث بن خزرج میں سعد بن عبادہ رضی اللہ عنہ کی عیادت کے لیے تشریف لے جا رہے تھے، یہ واقعہ غزوہ بدر سے پہلے کا ہے یہ دونوں روانہ ہوئے اور راستے میں ایک مجلس سے گزرے جس میں عبداللہ بن ابی ابن سلول بھی تھا۔ عبداللہ نے ابھی تک اپنے اسلام کا اعلان نہیں کیا تھا۔ اس مجلس میں کچھ مسلمان بھی تھے۔ بتوں کی پرستش کرنے والے کچھ مشرکین بھی تھے اور کچھ یہودی بھی تھے۔ مسلمان شرکاء میں عبداللہ بن رواحہ بھی تھے۔ جب مجلس پر ( نبی کریم صلی اللہ علیہ وسلم کی ) سواری کا غبار اڑ کر پڑا تو عبداللہ بن ابی نے اپنی چادر ناک پر رکھ لی اور کہنے لگا کہ ہم پر غبار نہ اڑاؤ، اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے ( قریب پہنچنے کے بعد ) انہیں سلام کیا اور کھڑے ہو گئے۔ پھر سواری سے اتر کر انہیں اللہ کی طرف بلایا اور قرآن مجید کی آیتیں انہیں پڑھ کر سنائیں۔ اس پر عبداللہ بن ابی ابن سلول نے کہا کہ بھلے آدمی جو کلام تم نے پڑھا اس سے بہتر کلام نہیں ہو سکتا۔ اگرچہ واقعی یہ حق ہے مگر ہماری مجلسوں میں آ کر اس کی وجہ سے ہمیں تکلیف نہ دیا کرو۔ جو تمہارے پاس جائے بس اس کو یہ قصے سنا دیا کرو۔ عبداللہ بن رواحہ رضی اللہ عنہ نے عرض کیا: ضرور، یا رسول اللہ! آپ ہماری مجلسوں میں بھی تشریف لایا کریں کیونکہ ہم اسے پسند کرتے ہیں۔ اس معاملہ پر مسلمانوں، مشرکوں اور یہودیوں کا جھگڑا ہو گیا اور قریب تھا کہ ایک دوسرے کے خلاف ہاتھ اٹھا دیں۔ لیکن نبی کریم صلی اللہ علیہ وسلم انہیں خاموش کرتے رہے آخر جب سب لوگ خاموش ہو گئے تو نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر بیٹھے اور روانہ ہوئے۔ جب سعد بن عبادہ کے یہاں پہنچے تو ان سے فرمایا کہ اے سعد! تم نے نہیں سنا آج ابوحباب نے کس طرح باتیں کی ہیں۔ آپ کا اشارہ عبداللہ بن ابی کی طرف تھا کہ اس نے یہ باتیں کہی ہیں سعد بن عبادہ رضی اللہ عنہ بولے، میرا باپ آپ پر صدقے ہو، یا رسول اللہ! آپ اسے معاف فرما دیں اور اس سے درگذر فرمائیں، اس ذات کی قسم جس نے آپ پر کتاب نازل کی ہے اللہ نے آپ کو سچا کلام دے کر یہاں بھیجا جو آپ پر اتارا۔ آپ کے تشریف لانے سے پہلے اس شہر ( مدینہ منورہ ) کے باشندے اس پر متفق ہو گئے تھے کہ اسے ( عبداللہ بن ابی کو ) شاہی تاج پہنا دیں اور شاہی عمامہ باندھ دیں لیکن اللہ نے سچا کلام دے کر آپ کو یہاں بھیج دیا اور یہ تجویز موقوف رہی تو وہ اس کی وجہ سے چڑ گیا اور جو کچھ آپ نے آج ملاحظہ کیا، وہ اسی جلن کی وجہ سے ہے۔ نبی کریم صلی اللہ علیہ وسلم نے عبداللہ بن ابی کو معاف کر دیا۔ نبی کریم صلی اللہ علیہ وسلم اور آپ کے صحابہ، مشرکین اور اہل کتاب سے جیسا کہ انہیں اللہ تعالیٰ نے حکم دیا تھا۔ درگزر کیا کرتے تھے اور ان کی طرف سے پہنچنے والی تکلیفوں پر صبر کیا کرتے تھے۔ اللہ تعالیٰ نے بھی ارشاد فرمایا ہے کہ ”تم ان لوگوں سے جنہیں کتاب دی گئی ہے ( اذیت دہ باتیں ) سنو گے۔“ دوسرے موقع پر ارشاد فرمایا ”بہت سے اہل کتاب خواہش رکھتے ہیں۔“ الخ۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم انہیں معاف کرنے کے لیے اللہ کے حکم کے مطابق توجیہ کیا کرتے تھے۔ بالآخر آپ کو ( جنگ کی ) اجازت دی گئی۔ جب نبی کریم صلی اللہ علیہ وسلم نے غزوہ بدر کیا اور اللہ کے حکم سے اس میں کفار کے بڑے بڑے بہادر اور قریش کے سردار قتل کئے گئے تو نبی کریم صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ فتح مند اور غنیمت کا مال لیے ہوئے واپس ہوئے، ان کے ساتھ کفار قریش کے کتنے ہی بہادر سردار قید بھی کر کے لائے تو اس وقت عبداللہ بن ابی بن سلول اور اس کے بت پرست مشرک ساتھی کہنے لگے کہ اب ان کا کام جم گیا تو نبی کریم صلی اللہ علیہ وسلم سے بیعت کر لو، اس وقت انہوں نے اسلام پر بیعت کی اور بظاہر مسلمان ہو گئے ( مگر دل میں نفاق رہا ) ۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 6208,
			"arabicnumber": 6208,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، کہا ہم سے عبدالملک نے بیان کیا، ان سے عبداللہ بن حارث بن نوفل نے اور ان سے عباس بن عبدالمطلب رضی اللہ عنہ نے کہ انہوں نے عرض کیا کہ یا رسول اللہ! آپ نے جناب ابوطالب کو ان کی وفات کے بعد کوئی فائدہ پہنچایا، وہ آپ کی حفاظت کیا کرتے تھے اور آپ کے لیے لوگوں پر غصہ ہوا کرتے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں وہ دوزخ میں اس جگہ پر ہیں جہاں ٹخنوں تک آگ ہے اگر میں نہ ہوتا تو وہ دوزخ کے نیچے کے طبقے میں رہتے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 6209,
			"arabicnumber": 6209,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے، ان سے ثابت بنانی نے، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ایک سفر میں تھے، راستہ میں حدی خواں نے حدی پڑھی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اے انجشہ! شیشوں کو آہستہ آہستہ لے کر چل، تجھ پر افسوس۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 6210,
			"arabicnumber": 6210,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے حماد نے بیان کیا، ان سے ثابت بنانی نے بیان کیا، ان سے انس و ایوب نے، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم ایک سفر میں تھے، انجشہ نامی غلام عورتوں کی سواریوں کو حدی پڑھتا لے کر چل رہا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا ”انجشہ! شیشوں کو آہستہ لے چل۔“ ابوقلابہ نے بیان کیا کہ مراد عورتیں تھیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 6211,
			"arabicnumber": 6211,
			"text": "ہم سے اسحاق نے بیان کیا، کہا ہم کو حبان نے خبر دی، کہا ہم سے ہمام نے بیان کیا، ان سے قتادہ نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے ایک حدی خواں تھے انجشہ نامی ان کی آواز بڑی اچھی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا ”انجشہ! آہستہ چال اختیار کر، ان شیشوں کو مت توڑ۔“ قتادہ نے بیان کیا کہ مراد کمزور عورتیں تھیں ( کہ سواری سے گر نہ جائیں ) ۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 6212,
			"arabicnumber": 6212,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے شعبہ نے، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ مدینہ منورہ پر ( ایک رات نامعلوم آواز کی وجہ سے ) ڈر طاری ہو گیا۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم ابوطلحہ کے ایک گھوڑے پر سوار ہوئے۔ پھر ( واپس آ کر ) فرمایا ”ہمیں تو کوئی ( خوف کی ) چیز نظر نہ آئی، البتہ یہ گھوڑا تو گویا دریا تھا۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 6213,
			"arabicnumber": 6213,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو مخلد بن یزید نے خبر دی، کہا ہم کو ابن جریج نے خبر دی کہ ابن شہاب نے بیان کیا کہ مجھ کو یحییٰ بن عروہ نے خبر دی، انہوں نے عروہ سے سنا، کہا کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے کاہنوں کے بارے میں پوچھا۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ ان کی ( پیشین گوئیوں کی ) کوئی حیثیت نہیں۔ صحابہ نے عرض کیا: یا رسول اللہ! لیکن وہ بعض اوقات ایسی باتیں کرتے ہیں جو صحیح ثابت ہوتی ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ بات، سچی بات ہوتی ہے جسے جِن فرشتوں سے سن کر اڑا لیتا ہے اور پھر اسے اپنے ولی ( کاہن ) کے کان میں مرغ کی آواز کی طرح ڈالتا ہے۔ اس کے بعد کاہن اس ( ایک سچی بات میں ) سو سے زیادہ جھوٹ ملا دیتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 6214,
			"arabicnumber": 6214,
			"text": "ہم سے ابن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے کہ میں نے ابوسلمہ بن عبدالرحمٰن سے سنا، وہ بیان کرتے تھے کہ مجھے جابر بن عبداللہ نے خبر دی، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر میرے پاس وحی آنے کا سلسلہ بند ہو گیا۔ ایک دن میں چل رہا تھا کہ میں نے آسمان کی طرف سے ایک آواز سنی، میں نے آسمان کی طرف نظر اٹھائی تو میں نے پھر اس فرشتہ کو دیکھا جو میرے پاس غار حرا میں آیا تھا، وہ آسمان و زمین کے درمیان کرسی پر بیٹھا ہوا تھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 6215,
			"arabicnumber": 6215,
			"text": "ہم سے ابن ابی مریم نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا کہ مجھے شریک نے خبر دی، انہیں کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ میں نے ایک رات میمونہ رضی اللہ عنہا ( خالہ ) کے گھر گزاری، نبی کریم صلی اللہ علیہ وسلم بھی اس رات وہیں ٹھہرے ہوئے تھے۔ جب رات کا آخری تہائی حصہ ہوا یا اس کا بعض حصہ رہ گیا تو نبی کریم صلی اللہ علیہ وسلم اٹھ بیٹھے اور آسمان کی طرف دیکھا پھر اس آیت کی تلاوت کی «إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏» ”بلاشبہ آسمان کی اور زمین کی پیدائش میں اور دن رات کے بدلتے رہنے میں عقل والوں کے لیے نشانیاں ہیں۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 6216,
			"arabicnumber": 6216,
			"text": "ہم سے مسدد نے کہا، کہا ہم سے یحییٰ قطان نے بیان کیا، ان سے عثمان بن غیاث نے، کہا ہم سے ابوعثمان نہدی نے بیان کیا اور ان سے ابوموسیٰ اشعری نے کہ وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ مدینہ کے باغوں میں سے ایک باغ میں تھے۔ نبی کریم صلی اللہ علیہ وسلم کے ہاتھ میں ایک لکڑی تھی، آپ اس کو پانی اور کیچڑ میں مار رہے تھے۔ اس دوران میں ایک صاحب نے باغ کا دروازہ کھلوانا چاہا۔ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ اس کے لیے دروازہ کھول دے اور انہیں جنت کی خوشخبری سنا دے۔ میں گیا تو وہاں ابوبکر رضی اللہ عنہ موجود تھے، میں نے ان کے لیے دروازہ کھولا اور انہیں جنت کی خوشخبری سنائی پھر ایک اور صاحب نے دروازہ کھلوایا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دروازہ کھول دے اور انہیں جنت کی خوشخبری سنا دے اس مرتبہ عمر رضی اللہ عنہ تھے۔ میں نے ان کے لیے بھی دروازہ کھولا اور انہیں بھی جنت کی خوشخبری سنا دی۔ پھر ایک تیسرے صاحب نے دروازہ کھلوایا۔ نبی کریم صلی اللہ علیہ وسلم اس وقت ٹیک لگائے ہوئے تھے اب سیدھے بیٹھ گئے۔ پھر فرمایا دروازہ کھول دے اور جنت کی خوشخبری سنا دے، ان آزمائشوں کے ساتھ جس سے ( دنیا میں ) انہیں دوچار ہونا پڑے گا۔ میں گیا تو وہاں عثمان رضی اللہ عنہ تھے۔ ان کے لیے بھی میں نے دروازہ کھولا اور انہیں جنت کی خوشخبری سنائی اور وہ بات بھی بتا دی جو نبی کریم صلی اللہ علیہ وسلم نے فرمائی تھی۔ عثمان رضی اللہ عنہ نے کہا خیر اللہ مددگار ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 6217,
			"arabicnumber": 6217,
			"text": "ہم سے محمد بن بشار نے بیان کیا کہا ہم سے ابن ابی عدی نے بیان کیا، ان سے شعبہ نے، ان سے سلیمان و منصور نے، ان سے سعد بن عبیدہ نے ان سے ابوعبدالرحمٰن سلمی نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک جنازہ میں شریک تھے۔ نبی کریم صلی اللہ علیہ وسلم کے ہاتھ میں ایک چھڑی تھی اس کو آپ زمین پر مار رہے تھے پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں کوئی ایسا نہیں ہے جس کا جنت یا دوزخ کا ٹھکانا طے نہ ہو چکا ہو۔ صحابہ نے عرض کیا: پھر کیوں نہ ہم اس پر بھروسہ کر لیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عمل کرتے رہو کیونکہ ہر شخص جس ٹھکانے کے لیے پیدا کیا گیا ہے اس کو ویسی ہی توفیق دی جائے گی۔ جیسا کہ قرآن شریف کے سورۃ واللیل میں ہے «فأما من أعطى واتقى‏» ”جس نے للہ خیرات کی اور اللہ تعالیٰ سے ڈرا“ آخر تک۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 6218,
			"arabicnumber": 6218,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، ان سے ہند بن حارث نے بیان کیا کہ ام سلمہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ( رات میں ) بیدار ہوئے اور فرمایا ”سبحان اللہ! اللہ کی رحمت کے کتنے خزانے آج نازل کئے گئے ہیں اور کس طرح کے فتنے بھی اتارے گئے ہیں۔ کون ہے! جو ان حجرہ والیوں کو جگائے۔“ نبی کریم صلی اللہ علیہ وسلم کی مراد ازواج مطہرات سے تھی تاکہ وہ نماز پڑھ لیں کیونکہ بہت سی دنیا میں کپڑے پہننے والیاں آخرت میں ننگی ہوں گی۔ اور ابن ابی ثور نے بیان کیا، ان سے ابن عباس رضی اللہ عنہما نے اور ان سے عمر رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا، کیا آپ نے ازواج مطہرات کو طلاق دے دی ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ میں نے کہا اللہ اکبر!۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 6219,
			"arabicnumber": 6219,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، انہیں زہری نے (دوسری سند) اور ہم سے اسماعیل بن ابی اویس نے بیان کیا، انہوں نے کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا، ان سے سلیمان نے بیان کیا، ان سے محمد بن ابی عتیق نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے امام زین العابدین علی بن حسین نے کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ صفیہ بنت حی رضی اللہ عنہا نے انہیں خبر دی کہ وہ نبی کریم صلی اللہ علیہ وسلم کے پاس ملنے آئیں۔ نبی کریم صلی اللہ علیہ وسلم اس وقت مسجد میں رمضان کے آخری عشرہ میں اعتکاف کئے ہوئے تھے۔ عشاء کے وقت تھوڑی دیر انہوں نے نبی کریم صلی اللہ علیہ وسلم سے باتیں کیں اور واپس لوٹنے کے لیے اٹھیں تو نبی کریم صلی اللہ علیہ وسلم بھی انہیں چھوڑ آنے کے لیے کھڑے ہو گئے۔ جب وہ مسجد کے اس دروازہ کے پاس پہنچیں جہاں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا کا حجرہ تھا، تو ادھر سے دو انصاری صحابی گزرے اور نبی کریم صلی اللہ علیہ وسلم کو سلام کیا اور آگے بڑھ گئے۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تھوڑی دیر کے لیے ٹھہر جاؤ۔ یہ صفیہ بنت حی میری بیوی ہیں۔ ان دونوں صحابہ نے عرض کیا: سبحان اللہ، یا رسول اللہ۔ ان پر بڑا شاق گزرا۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ شیطان انسان کے اندر خون کی طرح دوڑتا رہتا ہے، اس لیے مجھے خوف ہوا کہ کہیں وہ تمہارے دل میں کوئی شبہ نہ ڈال دے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 6220,
			"arabicnumber": 6220,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے، انہوں نے عقبہ بن صہبان ازدی سے سنا، وہ عبداللہ بن مغفل مزنی سے نقل کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے کنکری پھینکنے سے منع کیا تھا اور فرمایا تھا کہ وہ نہ شکار مار سکتی ہے اور نہ دشمن کو کوئی نقصان پہنچا سکتی ہے، البتہ آنکھ پھوڑ سکتی ہے اور دانت توڑ سکتی ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 6221,
			"arabicnumber": 6221,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، کہا ہم سے سفیان نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے پاس دو اصحاب چھینکے۔ نبی کریم صلی اللہ علیہ وسلم نے ایک کا جواب یرحمک اللہ ( اللہ تم پر رحم کرے ) سے دیا اور دوسرے کا نہیں۔ نبی کریم صلی اللہ علیہ وسلم سے اس کی وجہ پوچھی گئی تو فرمایا کہ اس نے الحمدللہ کہا تھا ( اس لیے اس کا جواب دیا ) اور دوسرے نے الحمدللہ نہیں کہا تھا۔ چھینکنے والے کو الحمدللہ ضرور کہنا چاہئے اور سننے والوں کو یرحمک اللہ۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 6222,
			"arabicnumber": 6222,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے اشعث بن سلیم نے کہ میں نے معاویہ بن سوید بن مقرن سے سنا اور ان سے براء رضی اللہ عنہ نے بیان کیا کہ ہمیں نبی کریم صلی اللہ علیہ وسلم نے سات باتوں کا حکم دیا تھا اور سات کاموں سے روکا تھا، ہمیں نبی کریم صلی اللہ علیہ وسلم نے بیمار کی مزاج پرسی کرنے، جنازہ کے پیچھے چلنے، چھینکنے والے کے جواب دینے، دعوت کرنے والے کی دعوت قبول کرنے، سلام کا جواب دینے، مظلوم کی مدد کرنے اور قسم کھا لینے والے کی قسم پوری کرنے میں مدد دینے کا حکم دیا تھا اور نبی کریم صلی اللہ علیہ وسلم نے ہمیں سات کاموں سے روکا تھا، سونے کی انگوٹھی سے، یا بیان کیا کہ سونے کے چھلے سے، ریشم اور دیبا اور سندس ( دیبا سے باریک ریشمی کپڑا ) پہننے سے اور ریشمی زین سے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 6223,
			"arabicnumber": 6223,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا، ان سے سعید مقبری نے بیان کیا، ان سے ان کے والد نے، ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( فرمایا کہ ) اللہ تعالیٰ چھینک کو پسند کرتا ہے اور جمائی کو ناپسند کرتا ہے۔ اس لیے جب تم میں سے کوئی شخص چھینکے اور الحمدللہ کہے تو ہر مسلمان پر جو اسے سنے، حق ہے کہ اس کا جواب یرحمک اللہ سے دے۔ لیکن جمائی شیطان کی طرف سے ہوتی ہے اس لیے جہاں تک ہو سکے اسے روکے کیونکہ جب وہ منہ کھول کر ہاہاہا کہتا ہے تو شیطان اس پر ہنستا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 6224,
			"arabicnumber": 6224,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا، انہیں عبداللہ بن دینار نے خبر دی، وہ ابوصالح سے اور وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جب تم میں سے کوئی چھینکے تو «الحمد الله» کہے اور اس کا بھائی یا اس کا ساتھی ( راوی کو شبہ تھا ) «يرحمك الله» کہے۔ جب ساتھی «يرحمك الله» کہے تو اس کے جواب میں چھینکنے والا «يهديكم الله ويصلح بالكم» ۔“",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 6225,
			"arabicnumber": 6225,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے سلیمان تیمی نے بیان کیا، کہا کہ میں نے انس رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں دو آدمیوں نے چھینکا۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے ان میں سے ایک کی چھینک پر یرحمک اللہ کہا اور دوسرے کی چھینک پر نہیں کہا۔ اس پر دوسرا شخص بولا کہ یا رسول اللہ! آپ نے ان کی چھینک پر یرحمک اللہ فرمایا۔ لیکن میری چھینک پر نہیں فرمایا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے الحمدللہ کہا تھا اور تم نے نہیں کہا تھا۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 6226,
			"arabicnumber": 6226,
			"text": "ہم سے عاصم بن علی نے بیان کیا، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا، انہوں نے کہا کہ ہم سے سعید مقبری نے بیان کیا، ان سے ان کے والد نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ چھینک کو پسند کرتا ہے کیونکہ وہ بعض دفعہ صحت کی علامت ہے اور جمائی کو ناپسند کرتا ہے۔ اس لیے جب تم میں سے کوئی شخص چھینکے تو وہ الحمدللہ کہے لیکن جمائی لینا شیطان کی طرف سے ہوتا ہے۔ اس لیے جب تم میں سے کسی کو جمائی آئے تو وہ اپنی قوت و طاقت کے مطابق اسے روکے۔ اس لیے کہ جب تم میں سے کوئی جمائی لیتا ہے تو شیطان ہنستا ہے۔",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 250
			}
		}
	]
}