{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6227,
			"arabicnumber": 6227,
			"text": "ہم سے یحییٰ بن جعفر نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ان سے معمر نے، ان سے ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اللہ تعالیٰ نے آدم کو اپنی صورت پر بنایا، ان کی لمبائی ساٹھ ہاتھ تھی۔ جب انہیں پیدا کر چکا تو فرمایا کہ جاؤ اور ان فرشتوں کو جو بیٹھے ہوئے ہیں، سلام کرو اور سنو کہ تمہارے سلام کا کیا جواب دیتے ہیں، کیونکہ یہی تمہارا اور تمہاری اولاد کا سلام ہو گا۔ آدم علیہ السلام نے کہا: السلام علیکم! فرشتوں نے جواب دیا، السلام علیک ورحمۃ اللہ، انہوں نے آدم کے سلام پر ”ورحمۃ اللہ“ بڑھا دیا۔ پس جو شخص بھی جنت میں جائے گا آدم علیہ السلام کی صورت کے مطابق ہو کر جائے گا۔“ اس کے بعد سے پھر خلقت کا قد و قامت کم ہوتا گیا، اب تک ایسا ہی ہوتا رہا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6228,
			"arabicnumber": 6228,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، انہیں سلیمان بن یسار نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فضل بن عباس رضی اللہ عنہما کو قربانی کے دن اپنی سواری پر اپنے پیچھے بٹھایا۔ وہ خوبصورت گورے مرد تھے۔ نبی کریم صلی اللہ علیہ وسلم لوگوں کو مسائل بتانے کے لیے کھڑے ہو گئے۔ اسی دوران میں قبیلہ خثعم کی ایک خوبصورت عورت بھی نبی کریم صلی اللہ علیہ وسلم سے مسئلہ پوچھنے آئی۔ فضل بھی اس عورت کو دیکھنے لگے۔ اس کا حسن و جمال ان کو بھلا معلوم ہوا۔ نبی کریم صلی اللہ علیہ وسلم نے مڑ کر دیکھا تو فضل اسے دیکھ رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے اپنا ہاتھ پیچھے لے جا کر فضل کی ٹھوڑی پکڑی اور ان کا چہرہ دوسری طرف کر دیا۔ پھر اس عورت نے کہا: یا رسول اللہ! حج کے بارے میں اللہ کا جو اپنے بندوں پر فریضہ ہے وہ میرے والد پر لاگو ہوتا ہے، جو بہت بوڑھے ہو چکے ہیں اور سواری پر سیدھے نہیں بیٹھ سکتے۔ کیا اگر میں ان کی طرف سے حج کر لوں تو ان کا حج ادا ہو جائے گا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ہو جائے گا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6229,
			"arabicnumber": 6229,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، انہوں نے کہا ہم کو ابوعامر نے خبر دی، انہوں نے کہا ہم سے زہیر نے بیان کیا، ان سے زید بن اسلم نے بیان کیا، ان سے عطاء بن یسار نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیاکہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”راستوں پر بیٹھنے سے بچو! صحابہ نے عرض کیا: یا رسول اللہ! ہماری یہ مجالس تو بہت ضروری ہیں، ہم وہیں روزمرہ گفتگو کیا کرتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا جب تم ان مجلسوں میں بیٹھنا ہی چاہتے ہو تو راستے کا حق ادا کیا کرو یعنی راستے کو اس کا حق دو۔ صحابہ نے عرض کیا: راستے کا حق کیا ہے یا رسول اللہ! فرمایا ( غیر محرم عورتوں کو دیکھنے سے ) نظر نیچی رکھنا، راہ گیروں کو نہ ستانا، سلام کا جواب دینا، بھلائی کا حکم دینا اور برائی سے روکنا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6230,
			"arabicnumber": 6230,
			"text": "ہم سے عمر بن حفص نے بیان کیا، انہوں نے کہا ہم سے ہمارے والد نے بیان کیا، انہوں نے کہا ہم سے اعمش نے بیان کیا، انہوں نے کہا کہ مجھ سے شقیق نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ جب ہم ( ابتداء اسلام میں ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تو کہتے ”سلام ہو اللہ پر اس کے بندوں سے پہلے، سلام ہو جبرائیل پر، سلام ہو میکائیل پر، سلام ہو فلاں پر، پھر ( ایک مرتبہ ) جب نبی کریم صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو ہماری طرف متوجہ ہو کر فرمایا کہ اللہ ہی سلام ہے۔ اس لیے جب تم میں سے کوئی نماز میں بیٹھے تو «التحيات لله،‏‏‏‏ والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته،‏‏‏‏ السلام علينا وعلى عباد الله الصالحين‏.‏» الخ پڑھا کرے۔ کیونکہ جب وہ یہ دعا پڑھے گا تو آسمان و زمین کے ہر صالح بندے کو اس کی یہ دعا پہنچے گی۔ «أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله‏.‏» اس کے بعد اسے اختیار ہے جو دعا چاہے پڑھے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6231,
			"arabicnumber": 6231,
			"text": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا، انہوں نے کہا ہم کو عبداللہ نے خبر دی، انہوں نے کہا ہم کو معمر نے خبر دی، انہیں ہمام بن منبہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”چھوٹا بڑے کو سلام کرے، گزرنے والا بیٹھنے والے کو سلام کرے اور چھوٹی جماعت بڑی جماعت کو پہلے سلام کرے۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6232,
			"arabicnumber": 6232,
			"text": "ہم سے محمد نے بیان کیا، انہوں نے کہا ہم کو مخلد نے خبر دی، انہوں نے کہا ہم کو ابن جریج نے خبر دی، انہوں نے کہا کہ مجھے زیاد نے خبر دی، انہوں نے عبدالرحمٰن بن زید کے غلام ثابت سے سنا، اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا۔ انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”سوار پیدل چلنے والے کو سلام کرے، پیدل چلنے والا بیٹھے ہوئے کو اور کم تعداد والے بڑی تعداد والوں کو۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6233,
			"arabicnumber": 6233,
			"text": "ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا ہم کو روح بن عبادہ نے خبر دی، انہوں نے کہا ہم سے ابن جریج نے بیان کیا، انہوں نے کہا کہ مجھے زیاد نے خبر دی، انہیں ثابت نے خبر دی جو عبدالرحمٰن بن زید کے غلام ہیں۔ اور انہیں ابوہریرہ رضی اللہ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”سوار پیدل چلنے والے کو سلام کرے، پیدل چلنے والا بیٹھے ہوئے شخص کو اور چھوٹی جماعت پہلے بڑی جماعت کو سلام کرے۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6234,
			"arabicnumber": 6234,
			"text": "اور ابراہیم بن طہمان نے بیان کیا، انہوں نے کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا، ان سے صفوان بن سلیم نے بیان کیا، ان سے عطاء بن یسار نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”چھوٹا بڑے کو سلام کرے، گزرنے والا بیٹھنے والے کو اور کم تعداد والے بڑی تعداد والوں کو۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6235,
			"arabicnumber": 6235,
			"text": "ہم سے قتیبہ نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے شیبانی نے، ان سے اشعث بن ابی الشعثاء نے، ان سے معاویہ بن سوید بن مقرن نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سات باتوں کا حکم دیا تھا۔ بیمار کی مزاج پرسی کرنے کا، جنازے کے پیچھے چلنے کا، چھینکنے والے کے جواب دینے کا۔ کمزور کی مدد کرنے کا، مظلوم کی مدد کرنے کا، افشاء سلام ( سلام کا جواب دینے اور بکثرت سلام کرنے ) کا، قسم ( حق ) کھانے والے کی قسم پوری کرنے کا، اور نبی کریم صلی اللہ علیہ وسلم نے چاندی کے برتن میں پینے سے منع فرمایا تھا اور سونے کی انگوٹھی پہننے سے ہمیں منع فرمایا تھا۔ میثر ( ریشم کی زین ) پر سوار ہونے سے، ریشم اور دیباج پہننے، قسی ( ریشمی کپڑا ) اور استبرق پہننے سے ( منع فرمایا تھا ) ۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6236,
			"arabicnumber": 6236,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، کہا کہ مجھ سے یزید نے بیان کیا، ان سے ابوالخیر نے، ان سے عبداللہ بن عمر و رضی اللہ عنہ نے کہ ایک صاحب نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا: اسلام کی کون سی حالت افضل ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا یہ کہ ( اللہ کی مخلوق کو ) کھانا کھلاؤ اور سلام کرو، اسے بھی جسے تم پہچانتے ہو اور اسے بھی جسے نہیں پہچانتے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6237,
			"arabicnumber": 6237,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، ان سے زہری نے بیان کیا، ان سے عطاء بن یزید لیثی نے اور ان سے ابوایوب رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کسی مسلمان کے لیے جائز نہیں کہ وہ اپنے کسی ( مسلمان ) بھائی سے تین دن سے زیادہ تعلق کاٹے کہ جب وہ ملیں تو یہ ایک طرف منہ پھیر لے اور دوسرا دوسری طرف اور دونوں میں اچھا وہ ہے جو سلام پہلے کرے۔“ اور سفیان نے کہا کہ انہوں نے یہ حدیث زہری سے تین مرتبہ سنی ہے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6238,
			"arabicnumber": 6238,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا مجھ کو یونس نے خبر دی، انہیں ابن شہاب نے کہا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ جب رسول اللہ صلی اللہ علیہ وسلم مدینہ منورہ ( ہجرت کر کے ) تشریف لائے تو ان کی عمر دس سال تھی۔ پھر میں نے نبی کریم صلی اللہ علیہ وسلم کی زندگی کے باقی دس سالوں میں آپ کی خدمت کی اور میں پردہ کے حکم کے متعلق سب سے زیادہ جانتا ہوں کہ کب نازل ہوا تھا۔ ابی بن کعب رضی اللہ عنہ مجھ سے اس کے بارے میں پوچھا کرتے تھے۔ پردہ کے حکم کا نزول سب سے پہلے اس رات ہوا جس میں رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہا سے نکاح کے بعد ان کے ساتھ پہلی خلوت کی تھی۔ نبی کریم صلی اللہ علیہ وسلم ان کے دولہا تھے اور آپ نے صحابہ کو دعوت ولیمہ پر بلایا تھا۔ کھانے سے فارغ ہو کر سب لوگ چلے گئے لیکن چند آدمی آپ کے پاس بیٹھے رہ گئے اور بہت دیر تک وہیں ٹھہرے رہے۔ نبی کریم صلی اللہ علیہ وسلم اٹھ کر باہر تشریف لے گئے اور میں بھی نبی کریم صلی اللہ علیہ وسلم کے ساتھ چلا گیا تاکہ وہ لوگ بھی چلے جائیں۔ نبی کریم چلتے رہے اور میں بھی نبی کریم صلی اللہ علیہ وسلم کے ساتھ چلتا رہا اور سمجھا کہ وہ لوگ اب چلے گئے ہیں۔ اس لیے واپس تشریف لائے اور میں بھی نبی کریم صلی اللہ علیہ وسلم کے ساتھ واپس آیا لیکن آپ جب زینب رضی اللہ عنہا کے حجرے میں داخل ہوئے تو وہ لوگ ابھی بیٹھے ہوئے تھے اور ابھی تک واپس نہیں گئے تھے۔ نبی کریم صلی اللہ علیہ وسلم دوبارہ وہاں سے لوٹ گئے اور میں بھی آپ کے ساتھ لوٹ گیا۔ جب آپ عائشہ رضی اللہ عنہا کے حجرہ کی چوکھٹ تک پہنچے تو آپ نے سمجھا کہ وہ لوگ نکل چکے ہوں گے۔ پھر آپ لوٹ کر آئے اور میں بھی آپ کے ساتھ لوٹ آیا تو واقعی وہ لوگ جا چکے تھے۔ پھر پردہ کی آیت نازل ہوئی اور نبی کریم صلی اللہ علیہ وسلم نے میرے اور اپنے درمیان پردہ لٹکا لیا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6239,
			"arabicnumber": 6239,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے معتمر نے بیان کیا، کہا مجھ سے میرے والد نے بیان کیا کہ ان سے ابومجلز نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ جب نبی کریم صلی اللہ علیہ وسلم نے زینب رضی اللہ عنہا سے نکاح کیا تو لوگ اندر آئے اور کھانا کھایا پھر بیٹھ کے باتیں کرتے رہے۔ نبی کریم صلی اللہ علیہ وسلم نے اس طرح اظہار کیا گویا آپ کھڑے ہونا چاہتے ہیں۔ لیکن وہ کھڑے نہیں ہوئے جب نبی کریم صلی اللہ علیہ وسلم نے یہ دیکھا تو کھڑے ہو گئے۔ آپ کے کھڑے ہونے پر قوم کے جن لوگوں کو کھڑا ہونا تھا وہ بھی کھڑے ہو گئے لیکن بعض لوگ اب بھی بیٹھے رہے اور جب نبی کریم صلی اللہ علیہ وسلم اندر داخل ہونے کے لیے تشریف لائے تو کچھ لوگ بیٹھے ہوئے تھے ( آپ واپس ہو گئے ) اور پھر جب وہ لوگ بھی کھڑے ہوئے اور چلے گئے تو میں نے نبی کریم صلی اللہ علیہ وسلم کو اس کی اطلاع دی۔ نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور اندر داخل ہو گئے۔ میں نے بھی اندر جانا چاہا لیکن نبی کریم صلی اللہ علیہ وسلم نے میرے اور اپنے درمیان پردہ ڈال لیا۔ اور اللہ تعالیٰ نے یہ آیت نازل کی «يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏» ”اے ایمان والو! نبی کے گھر میں نہ داخل ہو۔“ آخر تک۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6240,
			"arabicnumber": 6240,
			"text": "ہم سے اسحاق نے بیان کیا، کہا ہم کو یعقوب نے خبر دی، مجھ سے میرے والد نے بیان کیا، ان سے صالح نے، ان سے ابن شہاب نے بیان کیا، کہا کہ مجھے عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ عمر بن خطاب رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم ازواج مطہرات کا پردہ کرائیں۔ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایسا نہیں کیا اور ازواج مطہرات رفع حاجت کے لیے صرف رات ہی کے وقت نکلتی تھیں ( اس وقت گھروں میں بیت الخلاء نہیں تھے ) ایک مرتبہ سودہ بنت زمعہ رضی اللہ عنہا باہر گئی ہوئی تھیں۔ ان کا قد لمبا تھا۔ عمر بن خطاب رضی اللہ عنہ نے انہیں دیکھا۔ اس وقت وہ مجلس میں بیٹھے ہوئے تھے۔ انہوں نے کہا سودہ میں نے آپ کو پہچان لیا یہ انہوں نے اس لیے کہا کیونکہ وہ پردہ کے حکم نازل ہونے کے بڑے متمنی تھے۔ بیان کیا کہ پھر اللہ تعالیٰ نے پردہ کی آیت نازل کی۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6241,
			"arabicnumber": 6241,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان نے، ان سے زہری نے بیان کیا (سفیان نے کہا کہ) میں نے یہ حدیث زہری سے سن کر اس طرح یاد کی ہے کہ جیسے تو اس وقت یہاں موجود ہو اور ان سے سہل بن سعد نے کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کے کسی حجرہ میں سوراخ سے دیکھا، نبی کریم صلی اللہ علیہ وسلم کے پاس اس وقت ایک کنگھا تھا جس سے آپ سر مبارک کھجا رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا کہ اگر مجھے معلوم ہوتا کہ تم جھانک رہے ہو تو یہ کنگھا تمہاری آنکھ میں چبھو دیتا ( اندر داخل ہونے سے پہلے ) اجازت مانگنا تو ہے ہی اس لیے کہ ( اندر کی کوئی ذاتی چیز ) نہ دیکھی جائے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6242,
			"arabicnumber": 6242,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے عبیداللہ بن ابی بکر نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ ایک صاحب نبی کریم صلی اللہ علیہ وسلم کے کسی حجرہ میں جھانک کر دیکھنے لگے تو نبی کریم صلی اللہ علیہ وسلم ان کی طرف تیر کا پھل یا بہت سے پھل لے کر بڑھے، گویا میں نبی کریم صلی اللہ علیہ وسلم کو دیکھ رہا ہوں ان صاحب کی طرف اس طرح چپکے چپکے تشریف لائے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6243,
			"arabicnumber": 6243,
			"text": "ہم سے حمیدی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے ابن طاؤس نے، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ کی حدیث سے زیادہ صغیرہ گناہوں سے مشابہ میں نے اور کوئی چیز نہیں دیکھی۔ ( ابوہریرہ رضی اللہ عنہ نے جو باتیں بیان کی ہیں وہ مراد ہیں ) ۔ مجھ سے محمود نے بیان کیا، کہا ہم سے عبدالرزاق نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں ابن طاؤس نے، انہیں ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ میں نے کوئی چیز صغیرہ گناہوں سے مشابہ اس حدیث کے مقابلہ میں نہیں دیکھی جسے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ہے کہ اللہ تعالیٰ نے انسانوں کے معاملہ میں زنا میں سے اس کا حصہ لکھ دیا ہے جس سے وہ لامحالہ دوچار ہو گا پس آنکھ کا زنا دیکھنا ہے، زبان کا زنا بولنا ہے، دل کا زنا یہ ہے کہ وہ خواہش اور آرزو کرتا ہے پھر شرمگاہ اس خواہش کو سچا کرتی ہے یا جھٹلا دیتی ہے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6244,
			"arabicnumber": 6244,
			"text": "ہم سے اسحٰق نے بیان کیا کہا ہم کو عبدالصمد نے خبر دی، انہیں عبداللہ بن مثنی نے خبر دی ان سے ثمامہ بن عبداللہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم جب کسی کو سلام کرتے ( اور جواب نہ ملتا ) تو تین مرتبہ سلام کرتے تھے اور جب آپ صلی اللہ علیہ وسلم کوئی بات فرماتے تو ( زیادہ سے زیادہ ) تین مرتبہ اسے دہراتے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6245,
			"arabicnumber": 6245,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، کہا ہم سے یزید بن خصیفہ نے بیان کیا ان سے بسر بن سعید اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ میں انصار کی ایک مجلس میں تھا کہ ابوموسیٰ رضی اللہ عنہ تشریف لائے جیسے گھبرائے ہوئے ہوں۔ انہوں نے کہا کہ میں نے عمر رضی اللہ عنہ کے یہاں تین مرتبہ اندر آنے کی اجازت چاہی لیکن مجھے کوئی جواب نہیں ملا، اس لیے واپس چلا آیا ( عمر رضی اللہ عنہ کو معلوم ہوا ) تو انہوں نے دریافت کیا کہ ( اندر آنے میں ) کیا بات مانع تھی؟ میں نے کہا کہ میں نے تین مرتبہ اندر آنے کی اجازت مانگی اور جب مجھے کوئی جواب نہیں ملا تو واپس چلا گیا اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ جب تم میں سے کوئی کسی سے تین مرتبہ اجازت چاہے اور اجازت نہ ملے تو واپس چلا جانا چاہئے۔ عمر رضی اللہ عنہ نے کہا: واللہ! تمہیں اس حدیث کی صحت کے لیے کوئی گواہ لانا ہو گا۔ ( ابوموسیٰ رضی اللہ عنہ نے مجلس والوں سے پوچھا ) کیا تم میں کوئی ایسا ہے جس نے نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث سنی ہو؟ ابی بن کعب رضی اللہ عنہ نے کہا کہ اللہ کی قسم! تمہارے ساتھ ( اس کی گواہی دینے کے سوا ) جماعت میں سب سے کم عمر شخص کے کوئی اور نہیں کھڑا ہو گا۔ ابوسعید نے کہا اور میں ہی جماعت کا وہ سب سے کم عمر آدمی تھا میں ان کے ساتھ اٹھ کھڑا ہو گیا اور عمر رضی اللہ عنہ سے کہا کہ واقعی نبی کریم صلی اللہ علیہ وسلم نے ایسا فرمایا ہے۔ اور ابن مبارک نے بیان کیا کہ مجھ کو سفیان بن عیینہ نے خبر دی، کہا مجھ سے یزید بن خصیفہ نے بیان کیا، انہوں نے بسر بن سعید سے، کہا میں نے ابوسعید رضی اللہ عنہ سے سنا پھر یہی حدیث نقل کی۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6246,
			"arabicnumber": 6246,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے عمر بن ذر نے بیان کیا (دوسری سند) اور ہم سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو مجاہد نے خبر دی، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( آپ کے گھر میں ) داخل ہوا نبی کریم صلی اللہ علیہ وسلم نے ایک بڑے پیالے میں دودھ پایا تو فرمایا ”ابوہریرہ! اہل صفہ کے پاس جا اور انہیں میرے پاس بلا لا۔ میں ان کے پاس آیا اور انہیں بلا لایا۔ وہ آئے اور ( اندر آنے کی ) اجازت چاہی پھر جب اجازت دی گئی تو داخل ہوئے۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6247,
			"arabicnumber": 6247,
			"text": "ہم سے علی بن الجعد نے بیان کیا، انہوں نے کہا ہم کو شعبہ نے خبر دی، انہیں سیار نے انہوں نے ثابت بنانی سے روایت کی، انہیں انس بن مالک رضی اللہ عنہ نے کہ آپ بچوں کے پاس سے گزرے تو انہیں سلام کیا اور فرمایا کہ نبی کریم صلی اللہ علیہ وسلم بھی ایسا ہی کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6248,
			"arabicnumber": 6248,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، کہا ہم سے ابن ابی حازم نے ان سے ان کے والد نے اور ان سے سہل رضی اللہ عنہ نے کہ ہم جمعہ کے دن خوش ہوا کرتے تھے۔ میں نے عرض کی کس لیے؟ فرمایا کہ ہماری ایک بڑھیا تھیں جو مقام بضاعہ جایا کرتی تھیں۔ ابن سلمہ نے کہا کہ بضاعہ مدینہ منورہ کا کھجور کا ایک باغ تھا۔ پھر وہ وہاں سے چقندر لایا کرتی تھیں اور اسے ہانڈی میں ڈالتی تھیں اور جَو کے کچھ دانے پیس کر ( اس میں ملاتی تھیں ) جب ہم جمعہ کی نماز پڑھ کر واپس ہوتے تو انہیں سلام کرنے آتے اور وہ یہ چقندر کی جڑ میں آٹا ملی ہوئی دعوت ہمارے سامنے رکھتی تھیں ہم اس وجہ سے جمعہ کے دن خوش ہوا کرتے تھے اور قیلولہ یا دوپہر کا کھانا ہم جمعہ کے بعد کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6249,
			"arabicnumber": 6249,
			"text": "ہم سے ابن مقاتل نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو معمر نے خبر دی انہیں زہری نے انہیں ابوسلمہ بن عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اے عائشہ! یہ جبرائیل ہیں تمہیں سلام کہتے ہیں بیان کیا کہ میں نے عرض کیا «وعليه السلام ورحمة الله» آپ دیکھتے ہیں جو ہم نہیں دیکھ سکتے ام المؤمنین کا اشارہ نبی کریم صلی اللہ علیہ وسلم کی طرف تھا۔ معمر کے ساتھ اس حدیث کو شعیب اور یونس اور نعمان نے بھی زہری سے روایت کیا ہے یونس اور نعمان کی روایتوں میں «وبركاته‏.» کا لفظ زیادہ ہے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6250,
			"arabicnumber": 6250,
			"text": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے محمد بن منکدر نے کہا کہ میں نے جابر رضی اللہ عنہ سے سنا، وہ بیان کرتے تھے کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اس قرض کے بارے میں حاضر ہوا جو میرے والد پر تھا۔ میں نے دروازہ کھٹکھٹایا۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کون ہیں؟ میں نے کہا ”میں“ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میں، میں“ جیسے آپ نے اس جواب کو ناپسند فرمایا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6251,
			"arabicnumber": 6251,
			"text": "ہم سے اسحٰق بن منصور نے بیان کیا انہوں نے کہا ہم کو عبداللہ بن نمیر نے خبر دی، ان سے عبیداللہ نے بیان کیا، ان سے سعید بن ابی سعید مقبری نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ایک شخص مسجد میں داخل ہوا، رسول اللہ صلی اللہ علیہ وسلم مسجد کے کنارے بیٹھے ہوئے تھے۔ اس نے نماز پڑھی اور پھر حاضر ہو کر نبی کریم صلی اللہ علیہ وسلم کو سلام کیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا وعلیک السلام واپس جا اور دوبارہ نماز پڑھ، کیونکہ تم نے نماز نہیں پڑھی۔ وہ واپس گئے اور نماز پڑھی۔ پھر ( نبی کریم صلی اللہ علیہ وسلم ) کے پاس آئے اور سلام کیا آپ نے فرمایا وعلیک السلام۔ واپس جاؤ پھر نماز پڑھو۔ کیونکہ تم نے نماز نہیں پڑھی۔ وہ واپس گیا اور اس نے پھر نماز پڑھی۔ پھر واپس آیا اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں سلام عرض کیا۔ آپ صلی اللہ علیہ وسلم نے جواب میں فرمایا وعلیکم السلام۔ واپس جاؤ اور دوبارہ نماز پڑھو۔ کیونکہ تم نے نماز نہیں پڑھی۔ ان صاحب نے دوسری مرتبہ، یا اس کے بعد، عرض کیا: یا رسول اللہ! مجھے نماز پڑھنی سکھا دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب نماز کے لیے کھڑے ہوا کرو تو پہلے پوری طرح وضو کیا کرو، پھر قبلہ رو ہو کر تکبیر ( تکبیر تحریمہ ) کہو، اس کے بعد قرآن مجید میں سے جو تمہارے لیے آسان ہو وہ پڑھو، پھر رکوع کرو اور جب رکوع کی حالت میں برابر ہو جاؤ تو سر اٹھاؤ۔ جب سیدھے کھڑے ہو جاؤ تو پھر سجدہ میں جاؤ، جب سجدہ پوری طرح کر لو تو سر اٹھاؤ اور اچھی طرح سے بیٹھ جاؤ پھر سجدہ میں جاؤ، جب سجدہ پوری طرح کر لو تو سر اٹھاؤ اور اچھی طرح سے بیٹھ جاؤ ۔ یہی عمل اپنی ہر رکعت میں کرو۔ اور ابواسامہ (راوی) نے بعد یوں کہا کہ پھر اٹھو یہاں تک کہ سید ھے کھڑا ہو جاؤ۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6252,
			"arabicnumber": 6252,
			"text": "ہم سے ابن بشار نے بیان کیا، کہا کہ مجھ سے یحییٰ نے بیان کیا، ان سے عبیداللہ نے، ان سے سعید نے بیان کیا، ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”پھر سر سجدہ سے اٹھا اور اچھی طرح بیٹھ جا۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6253,
			"arabicnumber": 6253,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے زکریا نے بیان کیا، کہا کہ میں نے عامر سے سنا، انہوں نے بیان کیا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا کہ جبرائیل علیہ السلام تمہیں سلام کہتے ہیں۔ عائشہ رضی اللہ عنہا نے کہا کہ وعلیہ السلام ورحمۃ اللہ ان پر بھی اللہ کی طرف سے سلامتی اور اس کی رحمت نازل ہو۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن عروہ نے خبر دی، انہیں معمر نے، انہیں زہری نے، ان سے عروہ بن زبیر نے بیان کیا کہ مجھے اسامہ بن زید رضی اللہ عنہما نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم ایک گدھے پر سوار ہوئے جس پر پالان بندھا ہوا تھا اور نیچے فدک کی بنی ہوئی ایک مخملی چادر بچھی ہوئی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے سواری پر اپنے پیچھے اسامہ بن زید رضی اللہ عنہما کو بٹھایا تھا۔ آپ بنی حارث بن خزرج میں سعد بن عبادہ رضی اللہ عنہ کی عیادت کے لیے تشریف لے جا رہے تھے۔ یہ جنگ بدر سے پہلے کا واقعہ ہے۔ نبی کریم صلی اللہ علیہ وسلم ایک مجلس پر سے گزرے جس میں مسلمان، بت پرست، مشرک اور یہودی سب ہی شریک تھے۔ عبداللہ بن ابی ابن سلول بھی ان میں تھا۔ مجلس میں عبداللہ بن رواحہ بھی موجود تھے۔ جب مجلس پر سواری کا گرد پڑا تو عبداللہ نے اپنی چادر سے اپنی ناک چھپا لی اور کہا کہ ہمارے اوپر غبار نہ اڑاؤ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے سلام کیا اور وہاں رک گئے اور اتر کر انہیں اللہ کی طرف بلایا اور ان کے لیے قرآن مجید کی تلاوت کی۔ عبداللہ بن ابی ابن سلول بولا، میاں میں ان باتوں کے سمجھنے سے قاصر ہوں اگر وہ چیز حق ہے جو تم کہتے ہو تو ہماری مجلسوں میں آ کر ہمیں تکلیف نہ دیا کرو۔ اس پر ابن رواحہ نے کہا یا رسول اللہ! آپ ہماری مجلسوں میں تشریف لایا کریں کیونکہ ہم اسے پسند کرتے ہیں۔ پھر مسلمانوں، مشرکوں اور یہودیوں میں اس بات پر تو تو میں میں ہونے لگی اور قریب تھا کہ وہ کوئی ارادہ کر بیٹھیں اور ایک دوسرے پر حملہ کر دیں۔ لیکن نبی کریم صلی اللہ علیہ وسلم انہیں برابر خاموش کراتے رہے اور جب وہ خاموش ہو گئے تو نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر بیٹھ کر سعد بن عبادہ رضی اللہ عنہ کے یہاں گئے۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا، سعد تم نے نہیں سنا کہ ابوحباب نے آج کیا بات کہی ہے۔ آپ کا اشارہ عبداللہ بن ابی کی طرف تھا کہ اس نے یہ یہ باتیں کہی ہیں۔ سعد نے عرض کیا کہ یا رسول اللہ! اسے معاف کر دیجئیے اور درگزر فرمائیے۔ اللہ تعالیٰ نے وہ حق آپ کو عطا فرمایا ہے جو عطا فرمانا تھا۔ اس بستی ( مدینہ منورہ ) کے لوگ ( آپ کی تشریف آوری سے پہلے ) اس پر متفق ہو گئے تھے کہ اسے تاج پہنا دیں اور شاہی عمامہ اس کے سر پر باندھ دیں لیکن جب اللہ تعالیٰ نے اس منصوبہ کو اس حق کی وجہ سے ختم کر دیا جو اس نے آپ کو عطا فرمایا ہے تو اسے حق سے حسد ہو گیا اور اسی وجہ سے اس نے یہ معاملہ کیا ہے جو آپ نے دیکھا۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے اسے معاف کر دیا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6255,
			"arabicnumber": 6255,
			"text": "ہم سے ابن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عبدالرحمٰن بن عبداللہ نے اور ان سے عبداللہ بن کعب نے بیان کیا کہ میں نے کعب بن مالک سے سنا، وہ بیان کرتے تھے کہ جب وہ غزوہ تبوک میں شریک نہیں ہو سکے تھے اور نبی کریم صلی اللہ علیہ وسلم نے ہم سے بات چیت کرنے کی ممانعت کر دی تھی اور میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر سلام کرتا تھا اور یہ اندازہ لگاتا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے جواب سلام میں ہونٹ مبارک ہلائے یا نہیں، آخر پچاس دن گزر گئے اور نبی کریم صلی اللہ علیہ وسلم نے اللہ کی بارگاہ میں ہماری توبہ کے قبول کئے جانے کا نماز فجر کے بعد اعلان کیا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6256,
			"arabicnumber": 6256,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، انہوں نے کہا کہ مجھے عروہ نے خبر دی، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ کچھ یہودی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا کہ «السام عليك‏.‏» ( تمہیں موت آئے ) میں ان کی بات سمجھ گئی اور میں نے جواب دیا «عليكم السام واللعنة‏.‏» نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عائشہ صبر سے کام لے کیونکہ اللہ تعالیٰ تمام معاملات میں نرمی کو پسند کرتا ہے، میں نے عرض کیا: یا رسول اللہ! کیا آپ نے نہیں سنا کہ انہوں نے کیا کہا تھا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے ان کو جواب دے دیا تھا کہ «وعليكم» ( اور تمہیں بھی ) ۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6257,
			"arabicnumber": 6257,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک نے خبر دی، انہیں عبداللہ بن دینار نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب تمہیں یہودی سلام کریں اور اگر ان میں سے کوئی «السام عليك‏.‏» کہے تو تم اس کے جواب میں صرف «وعليك» ( اور تمہیں بھی ) کہہ دیا کرو۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6258,
			"arabicnumber": 6258,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا ہم سے ہشیم نے بیان کیا، انہیں عبداللہ بن ابی بکر بن انس نے خبر دی، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جب اہل کتاب تمہیں سلام کریں تو تم اس کے جواب میں صرف «وعليكم» کہو۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6259,
			"arabicnumber": 6259,
			"text": "ہم سے یوسف بن بہلول نے بیان کیا، کہا ہم سے ابن ادریس نے بیان کیا، کہا کہ مجھ سے حصین بن عبدالرحمٰن نے بیان کیا، ان سے سعد بن عبیدہ نے، ان سے ابوعبدالرحمٰن سلمی نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے زبیر بن عوام اور ابومرثد غنوی کو بھیجا۔ ہم سب گھوڑ سوار تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور جب روضہ خاخ ( مکہ اور مدینہ کے درمیان ایک مقام ) پر پہنچو تو وہاں تمہیں مشرکین کی ایک عورت ملے گی اس کے پاس حاطب بن ابی بلتعہ کا ایک خط ہے جو مشرکین کے پاس بھیجا گیا ہے ( اسے لے آؤ ) ۔ بیان کیا کہ ہم نے اس عورت کو پا لیا وہ اپنے اونٹ پر جا رہی تھی اور وہیں پر ملی ( جہاں ) نبی کریم صلی اللہ علیہ وسلم نے بتایا تھا۔ بیان کیا کہ ہم نے اس سے کہا کہ خط جو تم ساتھ لے جا رہی ہو وہ کہاں ہے؟ اس نے کہا کہ میرے پاس کوئی خط نہیں ہے۔ ہم نے اس کے اونٹ کو بٹھایا اور اس کے کجاوہ میں تلاشی لی لیکن ہمیں کوئی چیز نہیں ملی۔ میرے دونوں ساتھیوں نے کہا کہ ہمیں کوئی خط تو نظر آتا نہیں۔ بیان کیا کہ میں نے کہا، مجھے یقین ہے کہ نبی کریم صلی اللہ علیہ وسلم نے غلط بات نہیں کہی ہے۔ قسم ہے اس کی جس کی قسم کھائی جاتی ہے، تم خط نکالو ورنہ میں تمہیں ننگا کر دوں گا۔ بیان کیا کہ جب اس عورت نے دیکھا کہ میں واقعی اس معاملہ میں سنجیدہ ہوں تو اس نے ازار باندھنے کی جگہ کی طرف ہاتھ بڑھایا، وہ ایک چادر ازار کے طور پر باندھے ہوئے تھی اور خط نکالا۔ بیان کیا کہ ہم اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ حاطب تم نے ایسا کیوں کیا؟ انہوں نے کہا کہ میں اب بھی اللہ اور اس کے رسول پر ایمان رکھتا ہوں۔ میرے اندر کوئی تغیر و تبدیلی نہیں آئی ہے، میرا مقصد ( خط بھیجنے سے ) صرف یہ تھا کہ ( قریش پر آپ کی فوج کشی کی اطلاع دوں اور اس طرح ) میرا ان لوگوں پر احسان ہو جائے اور اس کی وجہ سے اللہ میرے اہل اور مال کی طرف سے ( ان سے ) مدافعت کرائے۔ آپ کے جتنے مہاجر صحابہ ہیں ان کے مکہ مکرمہ میں ایسے افراد ہیں جن کے ذریعہ اللہ ان کے مال اور ان کے گھر والوں کی حفاظت کرائے گا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے سچ کہ دیا ہے اب تم لوگ ان کے بارے میں سوا بھلائی کے اور کچھ نہ کہو بیان کیا کہ اس پر عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ اس شخص نے اللہ اور اس کے رسول اور مومنوں کے ساتھ خیانت کی، مجھے اجازت دیجئیے کہ میں اس کی گردن مار دوں بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: عمر! تمہیں کیا معلوم، اللہ تعالیٰ بدر کی لڑائی میں شریک صحابہ کی زندگی پر مطلع تھا اور اس کے باوجود فرمایا کہ تم جو چاہو کرو، تمہارے لیے جنت لکھ دی گئی ہے، بیان کیا کہ اس پر عمر رضی اللہ عنہ کی آنکھیں اشک آلود ہو گئیں اور عرض کیا: اللہ اور اس کے رسول ہی زیادہ جاننے والے ہیں۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6260,
			"arabicnumber": 6260,
			"text": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا انہوں نے کہا ہم کو عبداللہ نے خبر دی انہوں نے کہا ہم کو یونس نے خبر دی اور ان سے زہری نے بیان کیا انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی اور انہیں ابوسفیان بن حرب رضی اللہ عنہ نے خبر دی کہ ہرقل نے قریش کے چند افراد کے ساتھ انہیں بھی بلا بھیجا یہ لوگ شام تجارت کی غرض سے گئے تھے سب لوگ ہرقل کے پاس آئے پھر انہوں نے واقعہ بیان کیا کہ پھر ہرقل نے رسول اللہ صلی اللہ علیہ وسلم کا خط منگوایا اور وہ پڑھا گیا خط میں یہ لکھا ہوا تھا۔ بسم اللہ الرحمن الرحیم، محمد کی طرف سے جو اللہ کا بندہ اور اس کا رسول ہے ( صلی اللہ علیہ وسلم ) ۔ ہرقل عظیم روم کی طرف، سلام ہو ان پر جنہوں نے ہدایت کی اتباع کی۔ امابعد",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6261,
			"arabicnumber": 6261,
			"text": "لیث نے بیان کیا کہ مجھ سے جعفر بن ربیع نے بیان کیا ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے کہ نبی کریم صلی اللہ علیہ وسلم نے بنی اسرائیل کے ایک شخص کا ذکر کیا کہ انہوں نے لکڑی کا ایک لٹھا لیا اور اس میں سوراخ کر کے ایک ہزار دینار اور خط رکھ دیا وہ ان کی طرف سے ان کے ساتھی ( قرض خواہ ) کی طرف تھا اور عمر بن ابی سلمہ نے بیان کیا کہ ان سے ان کے والد نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے لکڑی کے ایک لٹھے میں سوراخ کیا اور مال اس کے اندر رکھ دیا اور ان کے پاس ایک خط لکھا، فلاں کی طرف سے فلاں کو ملے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6262,
			"arabicnumber": 6262,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا ان سے سعد بن ابراہیم نے ان سے ابوامامہ بن سہل بن حنیف نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ قریظہ کے یہودی سعد بن معاذ رضی اللہ عنہ کو ثالث بنانے پر تیار ہو گئے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں بلا بھیجا جب وہ آئے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اپنے سردار کے لینے کو اٹھو یا یوں فرمایا کہ اپنے میں سب سے بہتر کو لینے کے لیے اٹھو۔ پھر وہ نبی کریم صلی اللہ علیہ وسلم کے پاس بیٹھ گئے اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بنی قریظہ کے لوگ تمہارے فیصلے پر راضی ہو کر ( قلعہ سے ) اتر آئے ہیں ( اب تم کیا فیصلہ کرتے ہو ) ۔ سعد رضی اللہ عنہ نے کہا کہ پھر میں یہ فیصلہ کرتا ہوں کہ ان میں جو جنگ کے قابل ہیں انہیں قتل کر دیا جائے اور ان کے بچوں اور عورتوں کو قید کر لیا جائے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ آپ نے وہی فیصلہ فرمایا جس فیصلہ کو فرشتہ لے کر آیا تھا۔ ابوعبداللہ ( مصنف ) نے بیان کیا کہ مجھے میرے بعض اصحاب نے ابوالولید کے واسطہ سے ابوسعید رضی اللہ عنہ کا قول ( «على» کے بجائے بصلہ «إلى حكمك‏.‏» نقل کیا ہے۔)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6263,
			"arabicnumber": 6263,
			"text": "ہم سے عمرو بن عاصم نے بیان کیا، کہا ہم سے ہمام نے بیان کیا ان سے قتادہ نے کہ میں نے انس رضی اللہ عنہ سے پوچھا، کیا مصافحہ کا دستور نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں تھا؟ انہوں نے کہا کہ جی ہاں ضرور تھا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6264,
			"arabicnumber": 6264,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا، انہوں نے کہا کہ مجھے حیوہ نے خبر دی، کہا کہ مجھ سے ابوعقیل زہرہ بن معبد نے بیان کیا، انہوں نے اپنے دادا عبداللہ بن ہشام رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے اور نبی کریم صلی اللہ علیہ وسلم عمر بن خطاب رضی اللہ عنہ کا ہاتھ پکڑے ہوئے تھے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6265,
			"arabicnumber": 6265,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سیف نے بیان کیا، انہوں نے کہا کہ میں نے مجاہد سے سنا، انہوں نے کہا کہ مجھ سے عبداللہ بن بخرہ ابومعمر نے بیان کیا کہ میں نے عبداللہ بن مسعود رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے تشہد سکھایا، اس وقت میرا ہاتھ نبی کریم صلی اللہ علیہ وسلم کی ہتھیلیوں کے درمیان میں تھا ( اس طرح سکھایا ) جس طرح آپ قرآن کی سورت سکھایا کرتے تھے۔ «التحيات لله والصلوات والطيبات،‏‏‏‏ السلام عليك أيها النبي ورحمة الله وبركاته،‏‏‏‏ السلام علينا وعلى عباد الله الصالحين،‏‏‏‏ أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله‏.‏» نبی کریم صلی اللہ علیہ وسلم اس وقت حیات تھے۔ جب آپ کی وفات ہو گئی تو ہم ( خطاب کا صیغہ کے بجائے ) اس طرح پڑھنے لگے «السلام‏.‏ على النبي» یعنی نبی کریم صلی اللہ علیہ وسلم پر سلام ہو۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6266,
			"arabicnumber": 6266,
			"text": "ہم سے اسحاق بن راہویہ نے بیان کیا، کہا ہم کو بشر بن شعیب نے خبر دی، کہا مجھ سے میرے والد نے بیان کیا، ان سے زہری نے، کہا مجھ کو عبداللہ بن کعب نے خبر دی اور ان کو عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ علی بن ابی طالب رضی اللہ عنہ ( مرض الموت میں ) نبی کریم صلی اللہ علیہ وسلم کے پاس سے نکلے ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا اور ہم سے احمد بن صالح نے بیان کیا، کہا ہم سے عنبسہ بن خالد نے بیان کیا، کہا ہم سے یونس بن یزید نے بیان کیا، ان سے ابن شہاب زہری نے بیان کیا، کہا مجھ کو عبداللہ بن کعب بن مالک نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ علی بن ابی طالب رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے یہاں سے نکلے، یہ اس مرض کا واقعہ ہے جس میں نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تھی۔ لوگوں نے پوچھا: اے ابوالحسن! نبی کریم صلی اللہ علیہ وسلم نے صبح کیسی گزاری؟ انہوں نے کہا کہ بحمدللہ آپ کو سکون رہا ہے۔ پھر علی رضی اللہ عنہ کا ہاتھ عباس رضی اللہ عنہ نے پکڑ کر کہا۔ کیا تم نبی کریم صلی اللہ علیہ وسلم کو دیکھتے نہیں ہو۔ ( واللہ ) تین دن کے بعد تمہیں لاٹھی کا بندہ بننا پڑے گا۔ واللہ میں سمجھتا ہوں کہ اس مرض میں آپ وفات پا جائیں گے۔ میں بنی عبدالمطلب کے چہروں پر موت کے آثار کو خوب پہچانتا ہوں، اس لیے ہمارے ساتھ تم نبی کریم صلی اللہ علیہ وسلم کے پاس چلو۔ تاکہ پوچھا جائے کہ نبی کریم صلی اللہ علیہ وسلم کے بعد خلافت کس کے ہاتھ میں رہے گی اگر وہ ہمیں لوگوں کو ملتی ہے تو ہمیں معلوم ہو جائے گا اور اگر دوسروں کے پاس جائے گی تو ہم عرض کریں گے تاکہ نبی کریم صلی اللہ علیہ وسلم ہمارے بارے میں کچھ وصیت کریں۔ علی رضی اللہ عنہ نے کہا کہ واللہ! اگر ہم نے نبی کریم صلی اللہ علیہ وسلم سے خلافت کی درخواست کی اور نبی کریم صلی اللہ علیہ وسلم نے انکار کر دیا تو پھر لوگ ہمیں کبھی نہیں دیں گے میں تو نبی کریم صلی اللہ علیہ وسلم سے کبھی نہیں پوچھوں گا کہ آپ کے بعد کون خلیفہ ہو۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6267,
			"arabicnumber": 6267,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ہمام نے بیان کیا، ان سے قتادہ نے، ان سے انس رضی اللہ عنہ نے اور ان سے معاذ رضی اللہ عنہ نے بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کی سواری پر نبی کریم صلی اللہ علیہ وسلم کے پیچھے سوار تھا آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے معاذ! میں نے کہا «لبيك وسعديك‏.‏» ( حاضر ہوں ) ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے تین مرتبہ مجھے اسی طرح مخاطب کیا اس کے بعد فرمایا تمہیں معلوم ہے کہ بندوں پر اللہ کا کیا حق ہے؟ ( پھر خود ہی جواب دیا ) کہ یہ کہ اسی کی عبادت کریں اور اس کے ساتھ کسی کو شریک نہ ٹھہرائیں پھر آپ تھوڑی دیر چلتے رہے اور فرمایا کہ اے معاذ! میں نے عرض کی «لبيك وسعديك‏.‏» فرمایا تمہیں معلوم ہے کہ جب وہ یہ کر لیں تو اللہ پر بندوں کا کیا حق ہے؟ یہ کہ انہیں عذاب نہ دے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6268,
			"arabicnumber": 6268,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا مجھ سے میرے والد نے بیان کیا کہا ہم سے اعمش نے بیان کیا، کہا ہم سے زید بن وہب نے بیان کیا ( کہا کہ ) واللہ ہم سے ابوذر رضی اللہ عنہ نے مقام ربذہ میں بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رات کے وقت مدینہ منورہ کی کالی پتھروں والی زمین پر چل رہا تھا کہ احد پہاڑ دکھائی دیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اے ابوذر! مجھے پسند نہیں کہ اگر احد پہاڑ کے برابر بھی میرے پاس سونا ہو اور مجھ پر ایک رات بھی اس طرح گزر جائے یا تین رات کہ اس میں سے ایک دینار بھی میرے پاس باقی بچے۔ سوائے اس کے جو میں قرض کی ادائیگی کے لیے محفوظ رکھ لوں میں اس سارے سونے کو اللہ کی مخلوق میں اس اس طرح تقسیم کر دوں گا۔ ابوذر رضی اللہ عنہ نے اس کی کیفیت ہمیں اپنے ہاتھ سے لپ بھر کر دکھائی۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اے ابوذر! میں نے عرض کیا «لبيك وسعديك‏.‏» یا رسول اللہ! نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زیادہ جمع کرنے والے ہی ( ثواب کی حیثیت سے ) کم حاصل کرنے والے ہوں گے۔ سوائے اس کے جو اللہ کے بندوں پر مال اس اس طرح یعنی کثرت کے ساتھ خرچ کرے۔ پھر فرمایا یہیں ٹھہرے رہو ابوذر! یہاں سے اس وقت تک نہ ہٹنا جب تک میں واپس نہ آ جاؤں۔ پھر آپ صلی اللہ علیہ وسلم تشریف لے گئے اور نظروں سے اوجھل ہو گئے۔ اس کے بعد میں نے آواز سنی اور مجھے خطرہ ہوا کہ کہیں نبی کریم صلی اللہ علیہ وسلم کو کوئی پریشانی نہ پیش آ گئی ہو۔ اس لیے میں نے ( نبی کریم صلی اللہ علیہ وسلم کو دیکھنے کے لیے ) جانا چاہا لیکن فوراً ہی نبی کریم صلی اللہ علیہ وسلم کا یہ ارشاد یاد آیا کہ یہاں سے نہ ہٹنا۔ چنانچہ میں وہیں رک گیا ( جب آپ تشریف لائے تو ) میں نے عرض کی۔ میں نے آواز سنی تھی اور مجھے خطرہ ہو گیا تھا کہ کہیں آپ کو کوئی پریشانی نہ پیش آ جائے پھر مجھے آپ کا ارشاد یاد آیا اس لیے میں یہیں ٹھہر گیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ جبرائیل علیہ السلام تھے۔ میرے پاس آئے تھے اور مجھے خبر دی ہے کہ میری امت کا جو شخص بھی اس حال میں مرے گا کہ اللہ کے ساتھ کسی چیز کو شریک نہ ٹھہراتا ہو تو وہ جنت میں جائے گا۔ میں نے عرض کیا: یا رسول اللہ! اگرچہ اس نے زنا اور چوری کی ہو؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اگر اس نے زنا اور چوری بھی کی ہو۔ ( اعمش نے بیان کیا کہ ) میں نے زید بن وہب سے کہا کہ مجھے معلوم ہوا ہے کہ اس حدیث کے راوی ابودرداء رضی اللہ عنہ ہیں؟ زید نے فرمایا میں گواہی دیتا ہوں کہ یہ حدیث مجھ سے ابوذر رضی اللہ عنہ نے مقام ربذہ میں بیان کی تھی۔ اعمش نے بیان کیا کہ مجھ سے ابوصالح نے حدیث بیان کی اور ان سے ابو الدرداء رضی اللہ عنہ نے اسی طرح بیان کیا اور ابوشہاب نے اعمش سے بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6269,
			"arabicnumber": 6269,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے نافع نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کوئی شخص کسی دوسرے شخص کو اس کے بیٹھنے کی جگہ سے نہ اٹھائے کہ خود وہاں بیٹھ جائے۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6270,
			"arabicnumber": 6270,
			"text": "ہم سے خلاد بن یحییٰ نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے عبداللہ عمری نے، ان سے نافع اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا تھا کہ کسی شخص کو اس کی جگہ سے اٹھایا جائے تاکہ دوسرا اس کی جگہ پر بیٹھے، البتہ ( آنے والے کو مجلس میں ) جگہ دے دیا کرو اور فراخی کر دیا کرو اور ابن عمر رضی اللہ عنہما ناپسند کرتے تھے کہ کوئی شخص مجلس میں سے کسی کو اٹھا کر خود اس کی جگہ بیٹھ جائے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6271,
			"arabicnumber": 6271,
			"text": "ہم سے حسن بن عمر نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے، کہا میں نے اپنے والد سے سنا، وہ ابومجلز (حق بن حمید) سے بیان کرتے تھے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ جب رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہ سے نکاح کیا تو لوگوں کو ( دعوت ولیمہ پر ) بلایا۔ لوگوں نے کھانا کھایا پھر بیٹھ کر باتیں کرتے رہے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے ایسا کیا گویا آپ اٹھنا چاہتے ہیں۔ لیکن لوگ ( پھر بھی بیٹھے ہوئے تھے ) پھر بھی کھڑے نہیں ہوئے۔ جب نبی کریم صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ کھڑے ہو گئے جب نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے تو آپ کے ساتھ اور بھی بہت سے صحابہ کھڑے ہو گئے لیکن تین آدمی اب بھی باقی رہ گئے۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم اندر جانے کے لیے تشریف لائے لیکن وہ لوگ اب بھی بیٹھے ہوئے تھے۔ اس کے بعد وہ لوگ بھی چلے گئے۔ انس رضی اللہ عنہ نے بیان کیا کہ پھر میں آیا اور میں نے نبی کریم صلی اللہ علیہ وسلم کو اطلاع دی کہ وہ ( تین آدمی ) بھی جا چکے ہیں۔ نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور اندر داخل ہو گئے۔ میں نے بھی اندر جانا چاہا لیکن نبی کریم صلی اللہ علیہ وسلم نے میرے اور اپنے درمیان پردہ ڈال لیا اور اللہ تعالیٰ نے یہ آیت نازل کی «يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم‏» اے ایمان والو! نبی کے گھر میں اس وقت تک داخل نہ ہو جب تک تمہیں اجازت نہ دی جائے۔“ ارشاد ہوا «إن ذلكم كان عند الله عظيما‏» تک۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6272,
			"arabicnumber": 6272,
			"text": "ہم سے محمد بن ابی غالب نے بیان کیا، کہا ہم کو ابراہیم بن المنذر حزامی نے خبر دی، کہا ہم سے محمد بن فلیح نے بیان کیا، ان سے ان کے باپ نے، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو صحن کعبہ میں دیکھا کہ آپ سرین پر بیٹھے ہوئے دونوں رانیں شکم مبارک سے ملائے ہوئے ہاتھوں سے پنڈلی پکڑے ہوئے بیٹھے تھے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6273,
			"arabicnumber": 6273,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے بشر بن مفضل نے بیان کیا، کہا ہم سے سعید بن ایاس جریری نے بیان کیا، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے باپ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کیا میں تمہیں سب سے بڑے گناہ کی خبر نہ دوں۔“ صحابہ رضی اللہ عنہم نے عرض کیا کیوں نہیں یا رسول اللہ! نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا اور والدین کی نافرمانی کرنا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6274,
			"arabicnumber": 6274,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے بشر بن مفضل نے اسی طرح مثال بیان کیا، ( اور یہ بھی بیان کیا کہ ) نبی کریم صلی اللہ علیہ وسلم ٹیک لگائے ہوئے تھے پھر آپ سیدھے بیٹھ گئے اور فرمایا ”ہاں اور جھوٹی بات بھی۔“ نبی کریم صلی اللہ علیہ وسلم اسے اتنی مرتبہ باربار دہراتے رہے کہ ہم نے کہا، کاش آپ خاموش ہو جاتے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6275,
			"arabicnumber": 6275,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے عمر بن سعید نے بیان کیا، ان سے ابن ابی ملیکہ نے اور ان سے عقبہ بن حارث رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ہمیں عصر کی نماز پڑھائی اور پھر بڑی تیزی کے ساتھ چل کر آپ گھر میں داخل ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6276,
			"arabicnumber": 6276,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے اعمش نے، ان سے ابوالضحیٰ نے، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم تخت کے وسط میں نماز پڑھتے تھے اور میں نبی کریم صلی اللہ علیہ وسلم اور قبلہ کے درمیان لیٹی رہتی تھی مجھے کوئی ضرورت ہوتی لیکن مجھ کو کھڑے ہو کر آپ کے سامنے آنا برا معلوم ہوتا۔ البتہ آپ کی طرف رخ کر کے میں آہستہ سے کھسک جاتی تھی۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6277,
			"arabicnumber": 6277,
			"text": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا، کہا ہم سے خالد نے بیان کیا (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور مجھ سے عبداللہ بن محمد مسندی نے بیان کیا، ان سے عمرو بن عون نے بیان کیا، ان سے خالد (خالد بن عبداللہ طحان) نے بیان کیا، ان سے خالد (خالد حذاء) نے، ان سے ابوقلابہ نے بیان کیا، کہا کہ مجھے ابوالملیح عامر بن زید نے خبر دی، انہوں نے (ابوقلابہ) کو (خطاب کر کے) کہا کہ میں تمہارے والد زید کے ساتھ عبداللہ بن عمر رضی اللہ عنہما کی خدمت میں حاضر ہوا، انہوں نے ہم سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سے میرے روزے کا ذکر کیا گیا۔ نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے میں نے آپ کے لیے چمڑے کا ایک گدا، جس میں کھجور کی چھال بھری ہوئی تھی بچھا دیا۔ نبی کریم صلی اللہ علیہ وسلم زمین پر بیٹھے اور گدا میرے اور نبی کریم صلی اللہ علیہ وسلم کے درمیان ویسا ہی پڑا رہا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ کیا تمہارے لیے ہر مہینے میں تین دن کے ( روزے ) کافی نہیں؟ میں نے عرض کیا: یا رسول اللہ! نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر پانچ دن رکھا کر۔ میں نے عرض کیا: یا رسول اللہ! فرمایا سات دن۔ میں نے عرض کیا: یا رسول اللہ! فرمایا نو دن۔ میں نے عرض کیا: یا رسول اللہ! فرمایا گیارہ دن۔ میں نے عرض کیا یا رسول اللہ! فرمایا داؤد علیہ السلام کے روزے سے زیادہ کوئی روزہ نہیں ہے۔ زندگی کے نصف ایام، ایک دن کا روزہ اور ایک دن بغیر روزہ کے رہنا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6278,
			"arabicnumber": 6278,
			"text": "مجھ سے یحییٰ بن جعفر نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، ان سے شعبہ نے، ان سے مغیرہ بن مقسم نے، ان سے ابراہیم نخعی نے اور ان سے علقمہ بن قیس نے کہ آپ ملک شام میں پہنچے ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا کہ اور مجھ سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے مغیرہ نے اور ان سے ابراہیم نے بیان کیا کہ علقمہ ملک شام گئے اور مسجد میں جا کر دو رکعت نماز پڑھی پھر یہ دعا کی اے اللہ! مجھے ایک ہم نشین عطا فرما۔ چنانچہ وہ ابودرداء رضی اللہ عنہ کی مجلس میں جا بیٹھے۔ ابودرداء رضی اللہ عنہ نے دریافت کیا۔ تمہارا تعلق کہاں سے ہے؟ کہا کہ اہل کوفہ سے، پوچھا کیا تمہارے یہاں ( نفاق اور منافقین کے ) بھیدوں کے جاننے والے وہ صحابی نہیں ہیں جن کے سوا کوئی اور ان سے واقف نہیں ہے؟ ان کا اشارہ حذیفہ رضی اللہ عنہ کی طرف تھا۔ کیا تمہارے یہاں وہ نہیں ہیں ( یا یوں کہا کہ ) تمہارے وہ جنہیں اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کی زبانی شیطان سے پناہ دی تھی؟ اشارہ عمار رضی اللہ عنہ کی طرف تھا۔ کیا تمہارے یہاں مسواک اور گدے والے نہیں ہیں؟ ان کا اشارہ ابن مسعود رضی اللہ عنہ کی طرف تھا۔ عبداللہ بن مسعود رضی اللہ عنہ سورۃ «والليل إذا يغشى‏» کس طرح پڑھتے تھے۔ علقمہ رضی اللہ عنہ نے کہا کہ وہ «والذكر والأنثى‏» پڑھتے تھے۔ ابودرداء رضی اللہ عنہ نے اس پر کہا کہ یہ لوگ کوفہ والے اپنے مسلسل عمل سے قریب تھا کہ مجھے شبہ میں ڈال دیتے حالانکہ میں نے نبی کریم صلی اللہ علیہ وسلم سے خود اسے سنا تھا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6279,
			"arabicnumber": 6279,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے ابوحازم نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ ہم کھانا اور قیلولہ نماز جمعہ کے بعد کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6280,
			"arabicnumber": 6280,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالعزیز بن حازم نے بیان کیا، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ علی رضی اللہ عنہ کو کوئی نام ابوتراب سے زیادہ محبوب نہیں تھا۔ جب ان کو اس نام سے بلایا جاتا تو وہ خوش ہوتے تھے۔ ایک مرتبہ رسول اللہ صلی اللہ علیہ وسلم ، فاطمہ علیہا السلام کے گھر تشریف لائے تو علی رضی اللہ عنہ کو گھر میں نہیں پایا تو فرمایا کہ بیٹی تمہارے چچا کے لڑکے ( اور شوہر ) کہاں گئے ہیں؟ انہوں نے کہا میرے اور ان کے درمیان کچھ تلخ کلامی ہو گئی تھی وہ مجھ پر غصہ ہو کر باہر چلے گئے اور میرے یہاں ( گھر میں ) قیلولہ نہیں کیا۔ نبی کریم صلی اللہ علیہ وسلم نے ایک شخص سے کہا کہ دیکھو وہ کہاں ہیں۔ وہ صحابی واپس آئے اور عرض کیا: یا رسول اللہ! وہ تو مسجد میں سوئے ہوئے ہیں۔ نبی کریم صلی اللہ علیہ وسلم مسجد میں تشریف لائے تو علی رضی اللہ عنہ لیٹے ہوئے تھے اور چادر آپ کے پہلو سے گر گئی تھی اور گرد آلود ہو گئی تھی نبی کریم صلی اللہ علیہ وسلم اس سے مٹی صاف کرنے لگے اور فرمانے لگے، ابوتراب! ( مٹی والے ) اٹھو، ابوتراب! اٹھو۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6281,
			"arabicnumber": 6281,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے محمد بن عبداللہ انصاری نے، کہا کہ مجھ سے میرے والد نے، ان سے ثمامہ نے اور ان سے انس رضی اللہ عنہ نے کہ ( ان کی والدہ ) ام سلیم، نبی کریم صلی اللہ علیہ وسلم کے لیے چمڑے کا فرش بچھا دیتی تھیں اور نبی کریم صلی اللہ علیہ وسلم ان کے یہاں اسی پر قیلولہ کر لیتے تھے۔ بیان کیا پھر جب نبی کریم صلی اللہ علیہ وسلم سو گئے ( اور بیدار ہوئے ) تو ام سلیم رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کا پسینہ اور ( جھڑے ہوئے ) آپ کے بال لے لیے اور ( پسینہ کو ) ایک شیشی میں جمع کیا اور پھر «سك» ( ایک خوشبو ) میں اسے ملا لیا۔ بیان کیا ہے کہ پھر جب انس بن مالک رضی اللہ عنہ کی وفات کا وقت قریب ہوا تو انہوں نے وصیت کی کہ اس «سك» ( جس میں نبی کریم صلی اللہ علیہ وسلم کا پسینہ ملا ہوا تھا ) میں سے ان کے حنوط میں ملا دیا جائے۔ بیان کیا ہے کہ پھر ان کے حنوط میں اسے ملایا گیا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6283,
			"arabicnumber": 6283,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6284,
			"arabicnumber": 6284,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا، ان سے زہری نے بیان کیا، ان سے عطاء بن یزید لیثی نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے دو طرح کے پہناوے سے اور دو طرح کی خرید و فروخت سے منع فرمایا تھا۔ اشتمال صماء اور ایک کپڑے میں اس طرح احتباء کرنے سے کہ انسان کی شرمگاہ پر کوئی چیز نہ ہو اور ملامست اور منابذت سے۔ اس روایت کی متابعت معمر، محمد بن ابی حفصہ اور عبداللہ بن بدیل نے زہری سے کی ہے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6286,
			"arabicnumber": 6286,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6287,
			"arabicnumber": 6287,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، کہا ہم سے زہری نے بیان کیا، کہا کہ مجھے عباد بن تمیم نے خبر دی، ان سے ان کے چچا نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو مسجد میں چت لیٹے دیکھا آپ ایک پاؤں دوسرے پر رکھے ہوئے تھے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6288,
			"arabicnumber": 6288,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی (دوسری سند) امام بخاری رحمہ اللہ نے کہا کہ ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب تین آدمی ساتھ ہوں تو تیسرے ساتھی کو چھوڑ کر دو آپس میں کانا پھوسی ( سرگوشی ) نہ کریں۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6289,
			"arabicnumber": 6289,
			"text": "ہم سے عبداللہ بن صباح نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے بیان کیا، کہا کہ میں نے اپنے والد سے سنا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے ایک راز کی بات کہی تھی اور میں نے وہ راز کسی کو نہیں بتایا ( ان کی والدہ ) ام سلیم رضی اللہ عنہا نے بھی مجھ سے اس کے متعلق پوچھا لیکن میں نے انہیں بھی نہیں بتایا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6290,
			"arabicnumber": 6290,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر بن عبدالحمید نے بیان کیا، ان سے منصور بن معتمر نے، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جب تین آدمی ہوں تو تیسرے ساتھی کو چھوڑ کر تم آپس میں کانا پھوسی ( سرگوشی ) نہ کیا کرو۔ اس لیے کہ لوگوں کو رنج ہو گا البتہ اگر دوسرے آدمی بھی ہوں تو مضائقہ نہیں۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6291,
			"arabicnumber": 6291,
			"text": "ہم سے عبدان نے بیان کیا، ان سے ابوحمزہ محمد بن میمون نے، ان سے اعمش نے، ان سے شقیق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ کچھ مال تقسیم فرمایا اس پر انصار کے ایک شخص نے کہا کہ یہ ایسی تقسیم ہے جس سے اللہ کی خوشنودی مقصود نہ تھی میں نے کہا کہ ہاں! اللہ کی قسم میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں جاؤں گا۔ چنانچہ میں گیا، نبی کریم صلی اللہ علیہ وسلم اس وقت مجلس میں بیٹھے ہوئے تھے میں نے نبی کریم صلی اللہ علیہ وسلم کے کان میں چپکے سے یہ بات کہی تو آپ غصہ ہو گئے اور آپ کا چہرہ سرخ ہو گیا پھر آپ نے فرمایا کہ موسیٰ علیہ السلام پر اللہ کی رحمت ہو انہیں اس سے بھی زیادہ تکلیف پہنچائی گئی لیکن انہوں نے صبر کیا ( پس میں بھی صبر کروں گا ) ۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6292,
			"arabicnumber": 6292,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، ان سے عبدالعزیز بن صہیب اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نماز کی تکبیر کہی گئی اور ایک صحابی رسول صلی اللہ علیہ وسلم سے سرگوشی کرتے رہے، پھر وہ دیر تک سرگوشی کرتے رہے یہاں تک کہ آپ کے صحابہ سونے لگے اس کے بعد آپ اٹھے اور نماز پڑھائی۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6293,
			"arabicnumber": 6293,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے زہری نے، ان سے سالم نے، ان سے ان کے والد نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جب سونے لگو تو گھر میں آگ نہ چھوڑو۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6294,
			"arabicnumber": 6294,
			"text": "ہم سے محمد بن علاء نے بیان کیا، انہوں نے کہا ہم سے ابواسامہ نے بیان کیا، ہم سے برید بن عبداللہ نے بیان کیا، ان سے ابوبردہ نے بیان کیا اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ مدینہ منورہ میں ایک گھر رات کے وقت جل گیا۔ نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق کہا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ آگ تمہاری دشمن ہے اس لیے جب سونے لگو تو اسے بجھا دیا کرو۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6295,
			"arabicnumber": 6295,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا، ان سے کثیر بن شنطیر نے بیان کیا، ان سے عطاء بن ابی رباح نے بیان کیا، ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” ( سوتے وقت ) برتن ڈھک لیا کرو ورنہ دروازے بند کر لیا کرو اور چراغ بجھا لیا کرو کیونکہ یہ چوہا بعض اوقات چراغ کی بتی کھینچ لیتا ہے اور گھر والوں کو جلا دیتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6296,
			"arabicnumber": 6296,
			"text": "ہم سے حسان بن ابی عباد نے بیان کیا، انہوں نے کہا ہم سے ہمام بن یحییٰ نے بیان کیا، ان سے عطاء بن ابی رباح نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جب رات میں سونے لگو تو چراغ بجھا دیا کرو اور دروازے بند کر لیا کرو اور مشکیزوں کا منہ باندھ دیا کرو اور کھانے پینے کی چیزیں ڈھک دیا کرو۔“ حماد نے کہا کہ میرا خیال ہے کہ یہ بھی فرمایا کہ ”اگرچہ ایک لکڑی سے ہی ہو۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6297,
			"arabicnumber": 6297,
			"text": "ہم سے یحییٰ بن قزعہ نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ابن شہاب نے، ان سے سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”پانچ چیزیں فطرت سے ہیں، ختنہ کرنا، زیر ناف کے بال بنانا، بغل کے بال صاف کرنا، مونچھ چھوٹی کرانا اور ناخن کاٹنا۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6298,
			"arabicnumber": 6298,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب بن ابی حمزہ نے خبر دی، انہوں نے کہا ہم سے ابوالزناد نے بیان کیا، ان سے اعرج نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”ابراہیم علیہ السلام نے اسی ( 80 ) سال کی عمر میں ختنہ کرایا اور آپ نے «قدوم‏ ‏‏.‏» ( تخفیف کے ساتھ ) ( کلہاڑی ) سے ختنہ کیا۔“ ہم سے قتیبہ نے بیان کیا، کہا ہم سے مغیرہ نے بیان کیا اور ان سے ابوالزناد نے «بالقدوم‏‏.‏» ( تشدید کے ساتھ بیان کیا ) ۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6299,
			"arabicnumber": 6299,
			"text": "ہم سے محمد بن عبدالرحیم نے بیان کیا، کہا ہم کو عباد بن موسیٰ نے خبر دی، کہا ہم سے اسماعیل بن جعفر نے بیان کیا، کہا ہم سے اسرائیل نے، ان سے ابواسحاق نے، ان سے سعید بن جبیر نے کہ ابن عباس رضی اللہ عنہما سے پوچھا گیا کہ جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی عمر کیا تھی؟ کہا کہ ان دنوں میرا ختنہ ہو چکا تھا اور عرب لوگوں کی عادت تھی جب تک لڑکا جوانی کے قریب نہ ہوتا اس کا ختنہ نہ کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6300,
			"arabicnumber": 6300,
			"text": "اور عبداللہ ابن ادریس بن یزید نے اپنے والد سے بیان کیا، ان سے ابواسحاق نے، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو میرا ختنہ ہو چکا تھا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6301,
			"arabicnumber": 6301,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے بیان کیا، کہا کہ مجھے حمید بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تم میں سے جس نے قسم کھائی اور کہا کہ لات و عزیٰ کی قسم، تو پھر وہ «لا إله إلا الله» کہے اور جس نے اپنے ساتھی سے کہا کہ آؤ جوا کھیلیں تو اسے صدقہ کر دینا چاہئے۔“",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6302,
			"arabicnumber": 6302,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے اسحاق نے بیان کیا وہ سعید کے بیٹے ہیں، ان سے سعید نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں اپنے ہاتھوں سے ایک گھر بنایا تاکہ بارش سے حفاظت رہے اور دھوپ سے سایہ حاصل ہو اللہ کی مخلوق میں سے کسی نے اس کام میں میری مدد نہیں کی۔ معلوم ہوا کہ ضرورت کے لائق گھر بنانا درست ہے۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6303,
			"arabicnumber": 6303,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے ابوسفیان ثوری نے، ان سے عمرو بن نشار نے اور ان سے ابن عمر رضی اللہ عنہما نے کہا کہ واللہ نبی کریم صلی اللہ علیہ وسلم کی وفات کے بعد نہ میں نے کوئی اینٹ کسی اینٹ پر رکھی اور نہ کوئی باغ لگایا۔ سفیان نے بیان کیا کہ جب میں نے اس کا ذکر ابن عمر رضی اللہ عنہما کے بعض گھرانوں کے سامنے کیا تو انہوں نے کہا کہ اللہ کی قسم انہوں نے گھر بنایا تھا۔ سفیان نے بیان کیا کہ میں نے کہا پھر یہ بات ابن عمر رضی اللہ عنہما نے گھر بنانے سے پہلے کہی ہو گی۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 75
			}
		}
	]
}