{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"8": "Prayers (Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 349,
			"arabicnumber": 349,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے یونس کے واسطہ سے بیان کیا، انہوں نے ابن شہاب سے، انہوں نے انس بن مالک سے، انہوں نے فرمایا کہ ابوذر غفاری رضی اللہ عنہ یہ حدیث بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میرے گھر کی چھت کھول دی گئی، اس وقت میں مکہ میں تھا۔ پھر جبرائیل علیہ السلام اترے اور انہوں نے میرا سینہ چاک کیا۔ پھر اسے زمزم کے پانی سے دھویا۔ پھر ایک سونے کا طشت لائے جو حکمت اور ایمان سے بھرا ہوا تھا۔ اس کو میرے سینے میں رکھ دیا، پھر سینے کو جوڑ دیا، پھر میرا ہاتھ پکڑا اور مجھے آسمان کی طرف لے کر چلے۔ جب میں پہلے آسمان پر پہنچا تو جبرائیل علیہ السلام نے آسمان کے داروغہ سے کہا کھولو۔ اس نے پوچھا، آپ کون ہیں؟ جواب دیا کہ جبرائیل، پھر انہوں نے پوچھا کیا آپ کے ساتھ کوئی اور بھی ہے؟ جواب دیا، ہاں میرے ساتھ محمد ( صلی اللہ علیہ وسلم ) ہیں۔ انہوں نے پوچھا کہ کیا ان کے بلانے کے لیے آپ کو بھیجا گیا تھا؟ کہا، جی ہاں! پھر جب انہوں نے دروازہ کھولا تو ہم پہلے آسمان پر چڑھ گئے، وہاں ہم نے ایک شخص کو بیٹھے ہوئے دیکھا۔ ان کے داہنی طرف کچھ لوگوں کے جھنڈ تھے اور کچھ جھنڈ بائیں طرف تھے۔ جب وہ اپنی داہنی طرف دیکھتے تو مسکرا دیتے اور جب بائیں طرف نظر کرتے تو روتے۔ انہوں نے مجھے دیکھ کر فرمایا، آؤ اچھے آئے ہو۔ صالح نبی اور صالح بیٹے! میں نے جبرائیل علیہ السلام سے پوچھا یہ کون ہیں؟ انہوں نے کہا کہ یہ آدم علیہ السلام ہیں اور ان کے دائیں بائیں جو جھنڈ ہیں یہ ان کے بیٹوں کی روحیں ہیں۔ جو جھنڈ دائیں طرف ہیں وہ جنتی ہیں اور بائیں طرف کے جھنڈ دوزخی روحیں ہیں۔ اس لیے جب وہ اپنے دائیں طرف دیکھتے ہیں تو خوشی سے مسکراتے ہیں اور جب بائیں طرف دیکھتے ہیں تو ( رنج سے ) روتے ہیں۔ پھر جبرائیل مجھے لے کر دوسرے آسمان تک پہنچے اور اس کے داروغہ سے کہا کہ کھولو۔ اس آسمان کے داروغہ نے بھی پہلے کی طرح پوچھا پھر کھول دیا۔ انس نے کہا کہ ابوذر نے ذکر کیا کہ آپ صلی اللہ علیہ وسلم یعنی نبی کریم صلی اللہ علیہ وسلم نے آسمان پر آدم، ادریس، موسیٰ، عیسیٰ اور ابراہیم علیہم السلام کو موجود پایا۔ اور ابوذر رضی اللہ عنہ نے ہر ایک کا ٹھکانہ نہیں بیان کیا۔ البتہ اتنا بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے آدم کو پہلے آسمان پر پایا اور ابراہیم علیہ السلام کو چھٹے آسمان پر۔ انس نے بیان کیا کہ جب جبرائیل علیہ السلام نبی کریم صلی اللہ علیہ وسلم کے ساتھ ادریس علیہ السلام پر گزرے۔ تو انہوں نے فرمایا کہ آؤ اچھے آئے ہو صالح نبی اور صالح بھائی۔ میں نے پوچھا یہ کون ہیں؟ جواب دیا کہ یہ ادریس علیہ السلام ہیں۔ پھر موسیٰ علیہ السلام تک پہنچا تو انہوں نے فرمایا آؤ اچھے آئے ہو صالح نبی اور صالح بھائی۔ میں نے پوچھا یہ کون ہیں؟ جبرائیل علیہ السلام نے بتایا کہ موسیٰ علیہ السلام ہیں۔ پھر میں عیسیٰ علیہ السلام تک پہنچا، انہوں نے کہا آؤ اچھے آئے ہو صالح نبی اور صالح بھائی۔ میں نے پوچھا یہ کون ہیں؟ جبرائیل علیہ السلام نے بتایا کہ یہ عیسیٰ علیہ السلام ہیں۔ پھر میں ابراہیم علیہ السلام تک پہنچا۔ انہوں نے فرمایا آؤ اچھے آئے ہو صالح نبی اور صالح بیٹے۔ میں نے پوچھا یہ کون ہیں؟ جبرائیل علیہ السلام نے بتایا کہ یہ ابراہیم علیہ السلام ہیں۔ ابن شہاب نے کہا کہ مجھے ابوبکر بن حزم نے خبر دی کہ عبداللہ بن عباس اور ابوحبۃ الانصاری رضی اللہ عنہم کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، پھر مجھے جبرائیل علیہ السلام لے کر چڑھے، اب میں اس بلند مقام تک پہنچ گیا جہاں میں نے قلم کی آواز سنی ( جو لکھنے والے فرشتوں کی قلموں کی آواز تھی ) ابن حزم نے ( اپنے شیخ سے ) اور انس بن مالک نے ابوذر رضی اللہ عنہ سے نقل کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا۔ پس اللہ تعالیٰ نے میری امت پر پچاس وقت کی نمازیں فرض کیں۔ میں یہ حکم لے کر واپس لوٹا۔ جب موسیٰ علیہ السلام تک پہنچا تو انہوں نے پوچھا کہ آپ کی امت پر اللہ نے کیا فرض کیا ہے؟ میں نے کہا کہ پچاس وقت کی نمازیں فرض کی ہیں۔ انہوں نے فرمایا آپ واپس اپنے رب کی بارگاہ میں جائیے۔ کیونکہ آپ کی امت اتنی نمازوں کو ادا کرنے کی طاقت نہیں رکھتی ہے۔ میں واپس بارگاہ رب العزت میں گیا تو اللہ نے اس میں سے ایک حصہ کم کر دیا، پھر موسیٰ علیہ السلام کے پاس آیا اور کہا کہ ایک حصہ کم کر دیا گیا ہے، انہوں نے کہا کہ دوبارہ جائیے کیونکہ آپ کی امت میں اس کے برداشت کی بھی طاقت نہیں ہے۔ پھر میں بارگاہ رب العزت میں حاضر ہوا۔ پھر ایک حصہ کم ہوا۔ جب موسیٰ علیہ السلام کے پاس پہنچا تو انہوں نے فرمایا کہ اپنے رب کی بارگاہ میں پھر جائیے، کیونکہ آپ کی امت اس کو بھی برداشت نہ کر سکے گی، پھر میں باربار آیا گیا پس اللہ تعالیٰ نے فرمایا کہ یہ نمازیں ( عمل میں ) پانچ ہیں اور ( ثواب میں ) پچاس ( کے برابر ) ہیں۔ میری بات بدلی نہیں جاتی۔ اب میں موسیٰ علیہ السلام کے پاس آیا تو انہوں نے پھر کہا کہ اپنے رب کے پاس جائیے۔ لیکن میں نے کہا مجھے اب اپنے رب سے شرم آتی ہے۔ پھر جبرائیل مجھے سدرۃ المنتہیٰ تک لے گئے جسے کئی طرح کے رنگوں نے ڈھانک رکھا تھا۔ جن کے متعلق مجھے معلوم نہیں ہوا کہ وہ کیا ہیں۔ اس کے بعد مجھے جنت میں لے جایا گیا، میں نے دیکھا کہ اس میں موتیوں کے ہار ہیں اور اس کی مٹی مشک کی ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 350,
			"arabicnumber": 350,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا ہمیں خبر دی امام مالک نے صالح بن کیسان سے، انہوں نے عروہ بن زبیر سے، انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے، آپ نے فرمایا کہ اللہ تعالیٰ نے پہلے نماز میں دو دو رکعت فرض کی تھی۔ سفر میں بھی اور اقامت کی حالت میں بھی۔ پھر سفر کی نماز تو اپنی اصلی حالت پر باقی رکھی گئی اور حالت اقامت کی نمازوں میں زیادتی کر دی گئی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 351,
			"arabicnumber": 351,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے یزید بن ابراہیم نے بیان کیا، وہ محمد سے، وہ ام عطیہ سے، انہوں نے فرمایا کہ ہمیں حکم ہوا کہ ہم عیدین کے دن حائضہ اور پردہ نشین عورتوں کو بھی باہر لے جائیں۔ تاکہ وہ مسلمانوں کے اجتماع اور ان کی دعاؤں میں شریک ہو سکیں۔ البتہ حائضہ عورتوں کو نماز پڑھنے کی جگہ سے دور رکھیں۔ ایک عورت نے کہا یا رسول اللہ! ہم میں بعض عورتیں ایسی بھی ہوتی ہیں جن کے پاس ( پردہ کرنے کے لیے ) چادر نہیں ہوتی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی ساتھی عورت اپنی چادر کا ایک حصہ اسے اڑھا دے۔ اور عبداللہ بن رجاء نے کہا ہم سے عمران قطان نے بیان کیا، کہا ہم سے محمد بن سیرین نے، کہا ہم سے ام عطیہ نے، میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا اور یہی حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 352,
			"arabicnumber": 352,
			"text": "ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا ہم سے عاصم بن محمد نے بیان کیا، انہوں نے کہا کہ مجھ سے واقد بن محمد نے محمد بن منکدر کے حوالہ سے بیان کیا، انہوں نے کہا کہ جابر بن عبداللہ رضی اللہ عنہما نے تہبند باندھ کر نماز پڑھی۔ جسے انہوں نے سر تک باندھ رکھا تھا اور آپ کے کپڑے کھونٹی پر ٹنگے ہوئے تھے۔ ایک کہنے والے نے کہا کہ آپ ایک تہبند میں نماز پڑھتے ہیں؟ آپ نے جواب دیا کہ میں نے ایسا اس لیے کیا کہ تجھ جیسا کوئی احمق مجھے دیکھے۔ بھلا رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں دو کپڑے بھی کس کے پاس تھے؟",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 353,
			"arabicnumber": 353,
			"text": "ہم سے ابومصعب بن عبداللہ مطرف نے بیان کیا، انہوں نے کہا ہم سے عبدالرحمٰن بن ابی الموالی نے بیان کیا، انہوں نے محمد بن منکدر سے، انہوں نے کہا کہ میں نے جابر رضی اللہ عنہ کو ایک کپڑے میں نماز پڑھتے دیکھا اور انہوں نے بتلایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو بھی ایک ہی کپڑے میں نماز پڑھتے دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 354,
			"arabicnumber": 354,
			"text": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، کہا ہم سے ہشام بن عروہ نے اپنے والد کے حوالہ سے بیان کیا، وہ عمر بن ابی سلمہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک کپڑے میں نماز پڑھی اور آپ نے کپڑے کے دونوں کناروں کو مخالف طرف کے کاندھے پر ڈال لیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 355,
			"arabicnumber": 355,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، انہوں نے کہا ہم سے یحییٰ نے بیان کیا، انہوں نے کہا کہ ہم سے ہشام نے بیان کیا، انہوں نے کہا کہ مجھ سے میرے والد نے عمر بن ابی سلمہ سے نقل کر کے بیان کیا کہ انھوں نے نبی کریم صلی اللہ علیہ وسلم کو ام سلمہ کے گھر میں ایک کپڑے میں نماز پڑھتے دیکھا، کپڑے کے دونوں کناروں کو آپ نے دونوں کاندھوں پر ڈال رکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 356,
			"arabicnumber": 356,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، انہوں نے کہا کہ ہم سے ابواسامہ نے ہشام کے واسطے سے بیان کیا، وہ اپنے والد سے جن کو عمر بن ابی سلمہ نے خبر دی، انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ام سلمہ رضی اللہ عنہا کے گھر میں ایک کپڑے میں نماز پڑھتے ہوئے دیکھا، آپ اسے لپیٹے ہوئے تھے اور اس کے دونوں کناروں کو دونوں کاندھوں پر ڈالے ہوئے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 357,
			"arabicnumber": 357,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا مجھ سے امام مالک بن انس نے عمر بن عبیداللہ کے غلام ابونضر سالم بن امیہ سے کہ ام ہانی بنت ابی طالب کے غلام ابومرہ یزید نے بیان کیا کہ انہوں نے ام ہانی بنت ابی طالب سے یہ سنا۔ وہ فرماتی تھیں کہ میں فتح مکہ کے موقع پر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی۔ میں نے دیکھا کہ آپ غسل کر رہے ہیں اور آپ کی صاحبزادی فاطمہ رضی اللہ عنہا پردہ کئے ہوئے ہیں۔ انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو سلام کیا۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ کون ہے؟ میں نے بتایا کہ ام ہانی بنت ابی طالب ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا اچھی آئی ہو، ام ہانی۔ پھر جب آپ صلی اللہ علیہ وسلم نہانے سے فارغ ہو گئے تو اٹھے اور آٹھ رکعت نماز پڑھی، ایک ہی کپڑے میں لپٹ کر۔ جب آپ صلی اللہ علیہ وسلم نماز پڑھ چکے تو میں نے عرض کی کہ یا رسول اللہ! میری ماں کے بیٹے ( علی بن ابی طالب ) کا دعویٰ ہے کہ وہ ایک شخص کو ضرور قتل کرے گا۔ حالانکہ میں نے اسے پناہ دے رکھی ہے۔ یہ ( میرے خاوند ) ہبیرہ کا فلاں بیٹا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ام ہانی جسے تم نے پناہ دے دی، ہم نے بھی اسے پناہ دی۔ ام ہانی نے کہا کہ یہ نماز چاشت تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 358,
			"arabicnumber": 358,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہمیں امام مالک نے ابن شہاب کے حوالہ سے خبر دی، وہ سعید بن مسیب سے نقل کرتے ہیں، وہ ابوہریرہ رضی اللہ عنہ سے کہ ایک پوچھنے والے نے رسول اللہ صلی اللہ علیہ وسلم سے ایک کپڑے میں نماز پڑھنے کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا ( کچھ برا نہیں ) بھلا کیا تم سب میں ہر شخص کے پاس دو کپڑے ہیں؟",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 359,
			"arabicnumber": 359,
			"text": "ہم سے ابوعاصم ضحاک بن مخلد نے امام مالک رحمہ اللہ کے حوالہ سے بیان کیا، انہوں نے ابوالزناد سے، انہوں نے عبدالرحمٰن اعرج سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کسی شخص کو بھی ایک کپڑے میں نماز اس طرح نہ پڑھنی چاہیے کہ اس کے کندھوں پر کچھ نہ ہو۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 360,
			"arabicnumber": 360,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا ہم سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابی کثیر کے واسطہ سے، انہوں نے عکرمہ سے، یحییٰ نے کہا میں نے عکرمہ سے سنایا میں نے ان سے پوچھا تھا تو عکرمہ نے کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا، وہ فرماتے تھے۔ میں اس کی گواہی دیتا ہوں کہ رسول اللہ صلی اللہ علیہ وسلم کو میں نے یہ ارشاد فرماتے سنا تھا کہ جو شخص ایک کپڑے میں نماز پڑھے اسے کپڑے کے دونوں کناروں کو اس کے مخالف سمت کے کندھے پر ڈال لینا چاہیے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 361,
			"arabicnumber": 361,
			"text": "ہم سے یحییٰ بن صالح نے بیان کیا، کہا ہم سے فلیح بن سلیمان نے، وہ سعید بن حارث سے، کہا ہم نے جابر بن عبداللہ سے ایک کپڑے میں نماز پڑھنے کے بارے میں پوچھا۔ تو آپ نے فرمایا کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر ( غزوہ بواط ) میں گیا۔ ایک رات میں کسی ضرورت کی وجہ سے آپ کے پاس آیا۔ میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم نماز میں مشغول ہیں، اس وقت میرے بدن پر صرف ایک ہی کپڑا تھا۔ اس لیے میں نے اسے لپیٹ لیا اور آپ کے بازو میں ہو کر میں بھی نماز میں شریک ہو گیا۔ جب آپ نماز سے فارغ ہوئے تو دریافت فرمایا جابر اس رات کے وقت کیسے آئے؟ میں نے آپ صلی اللہ علیہ وسلم سے اپنی ضرورت کے متعلق کہا۔ میں جب فارغ ہو گیا تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ یہ تم نے کیا لپیٹ رکھا تھا جسے میں نے دیکھا۔ میں نے عرض کی کہ ( ایک ہی ) کپڑا تھا ( اس طرح نہ لپیٹتا تو کیا کرتا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر وہ کشادہ ہو تو اسے اچھی طرح لپیٹ لیا کر اور اگر تنگ ہو تو اس کو تہبند کے طور پر باندھ لیا کر۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 362,
			"arabicnumber": 362,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے، انہوں نے سفیان ثوری سے، انہوں نے کہا مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا سہل بن سعد ساعدی سے، انہوں نے کہا کہ کئی آدمی نبی کریم صلی اللہ علیہ وسلم کے ساتھ بچوں کی طرح اپنی گردنوں پر ازاریں باندھے ہوئے نماز پڑھتے تھے اور عورتوں کو ( آپ کے زمانے میں ) حکم تھا کہ اپنے سروں کو ( سجدے سے ) اس وقت تک نہ اٹھائیں جب تک مرد سیدھے ہو کر بیٹھ نہ جائیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 363,
			"arabicnumber": 363,
			"text": "ہم سے یحییٰ بن موسیٰ نے بیان کیا، کہا ہم سے ابومعاویہ نے اعمش کے واسطہ سے، انہوں نے مسلم بن صبیح سے، انہوں نے مسروق بن اجدع سے، انہوں نے مغیرہ بن شعبہ سے، آپ نے فرمایا کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر ( غزوہ تبوک ) میں تھا۔ آپ نے ایک موقع پر فرمایا۔ مغیرہ! پانی کی چھاگل اٹھا لے۔ میں نے اسے اٹھا لیا۔ پھر رسول اللہ صلی اللہ علیہ وسلم چلے اور میری نظروں سے چھپ گئے۔ آپ نے قضائے حاجت کی۔ اس وقت آپ شامی جبہ پہنے ہوئے تھے۔ آپ ہاتھ کھولنے کے لیے آستین اوپر چڑھانی چاہتے تھے لیکن وہ تنگ تھی اس لیے آستین کے اندر سے ہاتھ باہر نکالا۔ میں نے آپ کے ہاتھوں پر پانی ڈالا۔ آپ صلی اللہ علیہ وسلم نے نماز کے وضو کی طرح وضو کیا اور اپنے خفین پر مسح کیا۔ پھر نماز پڑھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 364,
			"arabicnumber": 364,
			"text": "ہم سے مطر بن فضل نے بیان کیا انہوں نے کہا ہم سے روح بن عبادہ نے بیان کیا، انہوں نے کہا ہم سے زکریا بن اسحاق نے بیان کیا، انہوں نے کہا ہم سے عمرو بن دینار نے، انہوں نے کہا کہ میں نے جابر بن عبداللہ انصاری رضی اللہ عنہما سے سنا، وہ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم ( نبوت سے پہلے ) کعبہ کے لیے قریش کے ساتھ پتھر ڈھو رہے تھے۔ اس وقت آپ تہبند باندھے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم کے چچا عباس نے کہا کہ بھتیجے کیوں نہیں تم تہبند کھول لیتے اور اسے پتھر کے نیچے اپنے کاندھے پر رکھ لیتے ( تاکہ تم پر آسانی ہو جائے ) جابر نے کہا کہ آپ صلی اللہ علیہ وسلم نے تہبند کھول لیا اور کاندھے پر رکھ لیا۔ اسی وقت غشی کھا کر گر پڑے۔ اس کے بعد آپ کبھی ننگے نہیں دیکھے گئے۔ ( صلی اللہ علیہ وسلم)",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 365,
			"arabicnumber": 365,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا کہ کہا ہم سے حماد بن زید نے ایوب کے واسطہ سے، انہوں نے محمد سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے، آپ نے فرمایا کہ ایک شخص نبی کریم صلی اللہ علیہ وسلم کے سامنے کھڑا ہوا اور اس نے صرف ایک کپڑا پہن کر نماز پڑھنے کے بارے میں سوال کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم سب ہی لوگوں کے پاس دو کپڑے ہو سکتے ہیں؟ پھر ( یہی مسئلہ ) عمر رضی اللہ عنہ سے ایک شخص نے پوچھا تو انہوں نے کہا جب اللہ تعالیٰ نے تمہیں فراغت دی ہے تو تم بھی فراغت کے ساتھ رہو۔ آدمی کو چاہیے کہ نماز میں اپنے کپڑے اکٹھا کر لے، کوئی آدمی تہبند اور چادر میں نماز پڑھے، کوئی تہبند اور قمیص، کوئی تہبند اور قباء میں، کوئی پاجامہ اور چادر میں، کوئی پاجامہ اور قمیص میں، کوئی پاجامہ اور قباء میں، کوئی جانگیا اور قباء میں، کوئی جانگیا اور قمیص میں نماز پڑھے۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ مجھے یاد آتا ہے کہ آپ نے یہ بھی کہا کہ کوئی جانگیا اور چادر میں نماز پڑھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 366,
			"arabicnumber": 366,
			"text": "ہم سے عاصم بن علی نے بیان کیا، انہوں نے کہا ہم سے ابن ابی ذئب نے زہری کے حوالہ سے بیان کیا، انہوں نے سالم سے، انہوں نے ابن عمر رضی اللہ عنہما سے، انہوں نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم سے ایک آدمی نے پوچھا کہ احرام باندھنے والے کو کیا پہننا چاہیے۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہ قمیص پہنے نہ پاجامہ، نہ باران کوٹ اور نہ ایسا کپڑا جس میں زعفران لگا ہوا ہو اور نہ ورس لگا ہوا کپڑا، پھر اگر کسی شخص کو جوتیاں نہ ملیں ( جن میں پاؤں کھلا رہتا ہو ) وہ موزے کاٹ کر پہن لے تاکہ وہ ٹخنوں سے نیچے ہو جائیں اور ابن ابی ذئب نے اس حدیث کو نافع سے بھی روایت کیا، انہوں نے ایسا ہی نبی کریم صلی اللہ علیہ وسلم سے بھی روایت کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 367,
			"arabicnumber": 367,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے ابن شہاب سے بیان کیا، انہوں نے عبیداللہ بن عبداللہ بن عتبہ سے، انہوں نے ابو سعید خدری سے کہ نبی کریم صلی اللہ علیہ وسلم نے صماء کی طرح کپڑا بدن پر لپیٹ لینے سے منع فرمایا اور اس سے بھی منع فرمایا کہ آدمی ایک کپڑے میں احتباء کرے اور اس کی شرمگاہ پر علیحدہ کوئی دوسرا کپڑا نہ ہو۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 368,
			"arabicnumber": 368,
			"text": "ہم سے قبیصہ بن عقبہ نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا، جو ابوالزناد سے نقل کرتے ہیں، وہ اعرج سے، وہ ابوہریرہ رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے دو طرح کی بیع و فروخت سے منع فرمایا۔ ایک تو چھونے کی بیع سے، دوسرے پھینکنے کی بیع سے اور اشتمال صماء سے ( جس کا بیان اوپر گزرا ) اور ایک کپڑے میں گوٹ مار کر بیٹھنے سے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 369,
			"arabicnumber": 369,
			"text": "ہم سے اسحاق نے بیان کیا، انہوں نے کہا ہم سے یعقوب بن ابراہیم نے بیان کیا، انہوں نے کہا مجھے میرے بھائی ابن شہاب نے اپنے چچا کے واسطہ سے، انہوں نے کہا مجھے حمید بن عبدالرحمٰن بن عوف نے خبر دی کہ ابوہریرہ رضی اللہ عنہ نے فرمایا کہ اس حج کے موقع پر مجھے ابوبکر رضی اللہ عنہ نے یوم نحر ( ذی الحجہ کی دسویں تاریخ ) میں اعلان کرنے والوں کے ساتھ بھیجا۔ تاکہ ہم منیٰ میں اس بات کا اعلان کر دیں کہ اس سال کے بعد کوئی مشرک حج نہیں کر سکتا اور کوئی شخص ننگے ہو کر بیت اللہ کا طواف نہیں کر سکتا۔ حمید بن عبدالرحمٰن نے کہا اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ کو ابوبکر رضی اللہ عنہ کے پیچھے بھیجا اور انہیں حکم دیا کہ وہ سورۃ برات پڑھ کر سنا دیں اور اس کے مضامین کا عام اعلان کر دیں۔ ابوہریرہ رضی اللہ عنہ فرماتے ہیں کہ علی رضی اللہ عنہ نے ہمارے ساتھ نحر کے دن منیٰ میں دسویں تاریخ کو یہ سنایا کہ آج کے بعد کوئی مشرک نہ حج کر سکے گا اور نہ بیت اللہ کا طواف کوئی شخص ننگے ہو کر کر سکے گا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 370,
			"arabicnumber": 370,
			"text": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا، کہا مجھ سے عبدالرحمٰن بن ابی الموال نے محمد بن منکدر سے، کہا میں جابر بن عبداللہ انصاری کی خدمت میں حاضر ہوا۔ وہ ایک کپڑا اپنے بدن پر لپیٹے ہوئے نماز پڑھ رہے تھے، حالانکہ ان کی چادر الگ رکھی ہوئی تھی۔ جب آپ نماز سے فارغ ہوئے تو ہم نے کہا اے ابوعبداللہ! آپ کی چادر رکھی ہوئی ہے اور آپ ( اسے اوڑھے بغیر ) نماز پڑھ رہے ہیں۔ انہوں نے فرمایا، میں نے چاہا کہ تم جیسے جاہل لوگ مجھے اس طرح نماز پڑھتے دیکھ لیں، میں نے بھی نبی کریم صلی اللہ علیہ وسلم کو اسی طرح ایک کپڑے میں نماز پڑھتے دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 371,
			"arabicnumber": 371,
			"text": "ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا ہم سے اسماعیل بن علیہ نے کہ کہا ہمیں عبدالعزیز بن صہیب نے انس بن مالک رضی اللہ عنہ سے روایت کر کے کہ نبی کریم صلی اللہ علیہ وسلم غزوہ خیبر میں تشریف لے گئے۔ ہم نے وہاں فجر کی نماز اندھیرے ہی میں پڑھی۔ پھر نبی کریم صلی اللہ علیہ وسلم سوار ہوئے۔ اور ابوطلحہ بھی سوار ہوئے۔ میں ابوطلحہ کے پیچھے بیٹھا ہوا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے اپنی سواری کا رخ خیبر کی گلیوں کی طرف کر دیا۔ میرا گھٹنا نبی کریم صلی اللہ علیہ وسلم کی ران سے چھو جاتا تھا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اپنی ران سے تہبند کو ہٹایا۔ یہاں تک کہ میں نبی کریم صلی اللہ علیہ وسلم کی شفاف اور سفید رانوں کی سفیدی اور چمک دیکھنے لگا۔ جب آپ خیبر کی بستی میں داخل ہوئے، تو آپ صلی اللہ علیہ وسلم نے فرمایا «الله اكبر» اللہ سب سے بڑا ہے، خیبر برباد ہو گیا، جب ہم کسی قوم کے آنگن میں اتر جائیں تو ڈرائے ہوئے لوگوں کی صبح منحوس ہو جاتی ہے۔ آپ نے یہ تین مرتبہ فرمایا، اس نے کہا کہ خیبر کے یہودی لوگ اپنے کاموں کے لیے باہر نکلے ہی تھے کہ وہ چلا اٹھے محمد ( صلی اللہ علیہ وسلم ) آن پہنچے۔ اور عبدالعزیز راوی نے کہا کہ بعض انس رضی اللہ عنہ سے روایت کرنے والے ہمارے ساتھیوں نے «والخميس‏» کا لفظ بھی نقل کیا ہے ( یعنی وہ چلا اٹھے کہ محمد صلی اللہ علیہ وسلم لشکر لے کر پہنچ گئے ) پس ہم نے خیبر لڑ کر فتح کر لیا اور قیدی جمع کئے گئے۔ پھر دحیہ رضی اللہ عنہ آئے اور عرض کی کہ یا رسول اللہ! قیدیوں میں سے کوئی باندی مجھے عنایت کیجیئے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ کوئی باندی لے لو۔ انہوں نے صفیہ بنت حیی کو لے لیا۔ پھر ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی یا رسول اللہ! صفیہ جو قریظہ اور نضیر کے سردار کی بیٹی ہیں، انہیں آپ نے دحیہ کو دے دیا۔ وہ تو صرف آپ ہی کے لیے مناسب تھیں۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ دحیہ کو صفیہ کے ساتھ بلاؤ، وہ لائے گئے۔ جب نبی کریم صلی اللہ علیہ وسلم نے انہیں دیکھا تو فرمایا کہ قیدیوں میں سے کوئی اور باندی لے لو۔ راوی نے کہا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے صفیہ کو آزاد کر دیا اور انہیں اپنے نکاح میں لے لیا۔ ثابت بنانی نے انس رضی اللہ عنہ سے پوچھا کہ ابوحمزہ! ان کا مہر نبی کریم صلی اللہ علیہ وسلم نے کیا رکھا تھا؟ انس رضی اللہ عنہ نے فرمایا کہ خود انہیں کی آزادی ان کا مہر تھا اور اسی پر آپ نے نکاح کیا۔ پھر راستے ہی میں ام سلیم رضی اللہ عنہا ( انس رضی اللہ عنہ کی والدہ ) نے انہیں دلہن بنایا اور نبی کریم صلی اللہ علیہ وسلم کے پاس رات کے وقت بھیجا۔ اب نبی کریم صلی اللہ علیہ وسلم دولہا تھے، اس لیے آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس کے پاس بھی کچھ کھانے کی چیز ہو تو یہاں لائے۔ آپ نے ایک چمڑے کا دستر خوان بچھایا۔ بعض صحابہ کھجور لائے، بعض گھی، عبدالعزیز نے کہا کہ میرا خیال ہے انس رضی اللہ عنہ نے ستو کا بھی ذکر کیا۔ پھر لوگوں نے ان کا حلوہ بنا لیا۔ یہ رسول اللہ صلی اللہ علیہ وسلم کا ولیمہ تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 372,
			"arabicnumber": 372,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہم کو شعیب نے زہری سے خبر دی، کہا کہ مجھے عروہ بن زبیر نے خبر دی کہ عائشہ رضی اللہ عنہا نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم فجر کی نماز پڑھتے اور آپ صلی اللہ علیہ وسلم کے ساتھ نماز میں کئی مسلمان عورتیں اپنی چادریں اوڑھے ہوئے شریک نماز ہوتیں، پھر اپنے گھروں کو واپس چلی جاتی تھیں، اس وقت انہیں کوئی پہچان نہیں سکتا تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 373,
			"arabicnumber": 373,
			"text": "ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا کہ ہمیں ابراہیم بن سعد نے خبر دی، انہوں نے کہا کہ ہم سے ابن شہاب نے بیان کیا، انہوں نے عروہ سے، انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک چادر میں نماز پڑھی۔ جس میں نقش و نگار تھے۔ آپ صلی اللہ علیہ وسلم نے انہیں ایک مرتبہ دیکھا۔ پھر جب نماز سے فارغ ہوئے تو فرمایا کہ میری یہ چادر ابوجہم ( عامر بن حذیفہ ) کے پاس لے جاؤ اور ان کی انبجانیہ والی چادر لے آؤ، کیونکہ اس چادر نے ابھی نماز سے مجھ کو غافل کر دیا۔ اور ہشام بن عروہ نے اپنے والد سے روایت کی، انہوں نے عائشہ رضی اللہ عنہا سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں نماز میں اس کے نقش و نگار دیکھ رہا تھا، پس میں ڈرا کہ کہیں یہ مجھے غافل نہ کر دے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 374,
			"arabicnumber": 374,
			"text": "ہم سے ابومعمر عبداللہ بن عمرو نے بیان کیا کہ کہا ہم سے عبدالوارث بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالعزیز بن صہیب نے انس رضی اللہ عنہ سے نقل کیا کہ عائشہ رضی اللہ عنہا کے پاس ایک رنگین باریک پردہ تھا جسے انہوں نے اپنے گھر کے ایک طرف پردہ کے لیے لٹکا دیا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے سامنے سے اپنا یہ پردہ ہٹا دو۔ کیونکہ اس پر نقش شدہ تصاویر برابر میری نماز میں خلل انداز ہوتی رہی ہیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 375,
			"arabicnumber": 375,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا کہ ہم سے لیث بن سعد نے یزید بن حبیب سے بیان کیا، انہوں نے ابوالخیر مرثد سے، انہوں نے عقبہ بن عامر سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کو ایک ریشم کی قباء تحفہ میں دی گئی۔ اسے آپ صلی اللہ علیہ وسلم نے پہنا اور نماز پڑھی لیکن آپ صلی اللہ علیہ وسلم جب نماز سے فارغ ہوئے تو بڑی تیزی کے ساتھ اسے اتار دیا۔ گویا آپ صلی اللہ علیہ وسلم اسے پہن کر ناگواری محسوس کر رہے تھے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا یہ پرہیزگاروں کے لائق نہیں ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 376,
			"arabicnumber": 376,
			"text": "ہم سے محمد بن عرعرہ نے بیان کیا، کہا کہ مجھ سے عمر ابن ابی زائدہ نے بیان کیا عون بن ابی حجیفہ سے، انہوں نے اپنے والد ابوحجیفہ وہب بن عبداللہ سے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایک سرخ چمڑے کے خیمہ میں دیکھا اور میں نے یہ بھی دیکھا کہ بلال رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کو وضو کرا رہے ہیں اور ہر شخص آپ کے وضو کا پانی حاصل کرنے کے لیے ایک دوسرے سے آگے بڑھنے کی کوشش کر رہا ہے۔ اگر کسی کو تھوڑا سا بھی پانی مل جاتا تو وہ اسے اپنے اوپر مل لیتا اور اگر کوئی پانی نہ پا سکتا تو اپنے ساتھی کے ہاتھ کی تری ہی حاصل کرنے کی کوشش کرتا۔ پھر میں نے بلال رضی اللہ عنہ کو دیکھا کہ انہوں نے اپنی ایک برچھی اٹھائی جس کے نیچے لوہے کا پھل لگا ہوا تھا اور اسے انہوں نے گاڑ دیا۔ نبی کریم صلی اللہ علیہ وسلم ( ڈیرے میں سے ) ایک سرخ پوشاک پہنے ہوئے تہبند اٹھائے ہوئے باہر تشریف لائے اور برچھی کی طرف منہ کر کے لوگوں کو دو رکعت نماز پڑھائی، میں نے دیکھا کہ آدمی اور جانور برچھی کے پرے سے گزر رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 377,
			"arabicnumber": 377,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، کہا کہ ہم سے ابوحازم سلمہ بن دینار نے بیان کیا۔ کہا کہ لوگوں نے سہل بن سعد ساعدی سے پوچھا کہ منبرنبوی کس چیز کا تھا۔ آپ نے فرمایا کہ اب ( دنیائے اسلام میں ) اس کے متعلق مجھ سے زیادہ جاننے والا کوئی باقی نہیں رہا ہے۔ منبر غابہ کے جھاؤ سے بنا تھا۔ فلاں عورت کے غلام فلاں نے اسے رسول اللہ صلی اللہ علیہ وسلم کے لیے بنایا تھا۔ جب وہ تیار کر کے ( مسجد میں ) رکھا گیا تو رسول اللہ صلی اللہ علیہ وسلم اس پر کھڑے ہوئے اور آپ نے قبلہ کی طرف اپنا منہ کیا اور تکبیر کہی اور لوگ آپ کے پیچھے کھڑے ہو گئے۔ پھر آپ نے قرآن مجید کی آیتیں پڑھیں اور رکوع کیا۔ آپ کے پیچھے تمام لوگ بھی رکوع میں چلے گئے۔ پھر آپ نے اپنا سر اٹھایا۔ پھر اسی حالت میں آپ الٹے پاؤں پیچھے ہٹے۔ پھر زمین پر سجدہ کیا۔ پھر منبر پر دوبارہ تشریف لائے اور قرآت رکوع کی، پھر رکوع سے سر اٹھایا اور قبلہ ہی کی طرف رخ کئے ہوئے پیچھے لوٹے اور زمین پر سجدہ کیا۔ یہ ہے منبر کا قصہ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ علی بن عبداللہ مدینی نے کہا کہ مجھ سے امام احمد بن حنبل نے اس حدیث کو پوچھا۔ علی نے کہا کہ میرا مقصد یہ ہے کہ نبی کریم صلی اللہ علیہ وسلم نماز میں لوگوں سے اونچے مقام پر کھڑے ہوئے تھے اس لیے اس میں کوئی حرج نہ ہونا چاہیے کہ امام مقتدیوں سے اونچی جگہ پر کھڑا ہو۔ علی بن مدینی کہتے ہیں کہ میں نے امام احمد بن حنبل سے کہا کہ سفیان بن عیینہ سے یہ حدیث اکثر پوچھی جاتی تھی، آپ نے بھی یہ حدیث ان سے سنی ہے تو انہوں نے جواب دیا کہ نہیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 378,
			"arabicnumber": 378,
			"text": "ہم سے محمد بن عبدالرحیم نے بیان کیا کہ کہا ہم سے یزید بن ہارون نے، کہا ہم کو حمید طویل نے خبر دی انس بن مالک رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم ( 5 ھ میں ) اپنے گھوڑے سے گر گئے تھے۔ جس سے آپ کی پنڈلی یا کندھا زخمی ہو گئے اور آپ نے ایک مہینے تک اپنی بیویوں کے پاس نہ جانے کی قسم کھائی۔ آپ اپنے بالاخانہ پر بیٹھ گئے۔ جس کے زینے کھجور کے تنوں سے بنائے گئے تھے۔ صحابہ رضی اللہ عنہم مزاج پرسی کو آئے۔ آپ نے انہیں بیٹھ کر نماز پڑھائی اور وہ کھڑے تھے۔ جب آپ نے سلام پھیرا تو فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے۔ پس جب وہ تکبیر کہے تو تم بھی تکبیر کہو اور جب وہ رکوع میں جائے تو تم بھی رکوع میں جاؤ اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو اور اگر کھڑے ہو کر تمہیں نماز پڑھائے تو تم بھی کھڑے ہو کر نماز پڑھو اور آپ انتیس دن بعد نیچے تشریف لائے، تو لوگوں نے کہا یا رسول اللہ! آپ نے تو ایک مہینہ کے لیے قسم کھائی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ انتیس دن کا ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 379,
			"arabicnumber": 379,
			"text": "ہم سے مسدد نے بیان کیا خالد سے، کہا کہ ہم سے سلیمان شیبانی نے بیان کیا عبداللہ بن شداد سے، انہوں نے میمونہ رضی اللہ عنہا سے، آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نماز پڑھتے اور حائضہ ہونے کے باوجود میں ان کے سامنے ہوتی، اکثر جب آپ صلی اللہ علیہ وسلم سجدہ کرتے تو آپ صلی اللہ علیہ وسلم کا کپڑا مجھے چھو جاتا۔ انہوں نے کہا کہ آپ صلی اللہ علیہ وسلم ( کھجور کے پتوں سے بنے ہوئے ایک چھوٹے سے ) مصلے پر نماز پڑھتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 380,
			"arabicnumber": 380,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا کہا کہ ہمیں امام مالک نے خبر دی اسحاق بن عبداللہ بن ابی طلحہ سے، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ ان کی نانی ملیکہ نے رسول اللہ صلی اللہ علیہ وسلم کو کھانا تیار کر کے کھانے کے لیے بلایا۔ آپ صلی اللہ علیہ وسلم نے کھانے کے بعد فرمایا کہ آؤ تمہیں نماز پڑھا دوں۔ انس رضی اللہ عنہ نے کہا کہ میں نے اپنے گھر سے ایک بوریا اٹھایا جو کثرت استعمال سے کالا ہو گیا تھا۔ میں نے اس پر پانی چھڑکا۔ پھر رسول اللہ صلی اللہ علیہ وسلم نماز کے لیے ( اسی بورئیے پر ) کھڑے ہوئے اور میں اور ایک یتیم ( کہ رسول اللہ صلی اللہ علیہ وسلم کے غلام ابوضمیرہ کے لڑکے ضمیرہ ) آپ کے پیچھے صف باندھ کر کھڑے ہو گئے اور بوڑھی عورت ( انس کی نانی ملیکہ ) ہمارے پیچھے کھڑی ہوئیں۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی اور واپس گھر تشریف لے گئے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 381,
			"arabicnumber": 381,
			"text": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا، کہ کہا ہم سے شعبہ نے، کہا ہم سے سلیمان شیبانی نے عبداللہ بن شداد کے واسطے سے، انہوں نے ام المؤمنین میمونہ رضی اللہ عنہا سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم سجدہ گاہ ( یعنی چھوٹے مصلے ) پر نماز پڑھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 382,
			"arabicnumber": 382,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہ کہا مجھ سے امام مالک نے عمر بن عبیداللہ کے غلام ابوالنضر سالم کے حوالہ سے، انہوں نے ابوسلمہ بن عبدالرحمٰن سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا سے۔ آپ نے بتلایا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے آگے سو جاتی اور میرے پاؤں آپ صلی اللہ علیہ وسلم کے قبلہ میں ہوتے۔ جب آپ صلی اللہ علیہ وسلم سجدہ کرتے، تو میرے پاؤں کو آہستہ سے دبا دیتے۔ میں اپنے پاؤں سمیٹ لیتی اور آپ جب کھڑے ہو جاتے تو میں انہیں پھر پھیلا دیتی۔ ان دنوں گھروں میں چراغ بھی نہیں ہوا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 383,
			"arabicnumber": 383,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے عقیل سے، انہوں نے ابن شہاب سے، ان کو عروہ نے خبر دی کہ عائشہ رضی اللہ عنہا نے انہیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم اپنے گھر کے بچھونے پر نماز پڑھتے اور عائشہ رضی اللہ عنہا آپ صلی اللہ علیہ وسلم کے اور قبلہ کے درمیان اس طرح لیٹی ہوتیں جیسے ( نماز کے لیے ) جنازہ رکھا جاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 384,
			"arabicnumber": 384,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا کہا ہم سے لیث بن سعد نے حدیث بیان کی یزید سے، انہوں نے عراک سے، انہوں نے عروہ بن زبیر سے کہ نبی کریم صلی اللہ علیہ وسلم اس بچھونے پر نماز پڑھتے جس پر آپ صلی اللہ علیہ وسلم اور عائشہ رضی اللہ عنہا سوتے اور عائشہ رضی اللہ عنہا آپ صلی اللہ علیہ وسلم کے اور قبلہ کے درمیان اس بستر پر لیٹی رہتیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 385,
			"arabicnumber": 385,
			"text": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا، انہوں نے کہا ہم سے بشر بن مفضل نے بیان کیا، انہوں نے کہا مجھے غالب قطان نے بکر بن عبداللہ کے واسطے سے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے کہا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تھے۔ پھر سخت گرمی کی وجہ سے کوئی کوئی ہم میں سے اپنے کپڑے کا کنارہ سجدے کی جگہ رکھ لیتا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 386,
			"arabicnumber": 386,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا، انہوں نے کہا ہم سے ابومسلمہ سعید بن یزید ازدی نے بیان کیا، کہا میں نے انس بن مالک رضی اللہ عنہ سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم اپنی جوتیاں پہن کر نماز پڑھتے تھے؟ تو انہوں نے فرمایا کہ ہاں!۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 387,
			"arabicnumber": 387,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے اعمش کے واسطہ سے، اس نے کہا کہ میں نے ابراہیم نخعی سے سنا۔ وہ ہمام بن حارث سے روایت کرتے تھے، انہوں نے کہا کہ میں نے جریر بن عبداللہ رضی اللہ عنہ کو دیکھا، انہوں نے پیشاب کیا پھر وضو کیا اور اپنے موزوں پر مسح کیا۔ پھر کھڑے ہوئے اور ( موزوں سمیت ) نماز پڑھی۔ آپ سے جب اس کے متعلق پوچھا گیا، تو فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو ایسا ہی کرتے دیکھا ہے۔ ابراہیم نخعی نے کہا کہ یہ حدیث لوگوں کی نظر میں بہت پسندیدہ تھی کیونکہ جریر رضی اللہ عنہ آخر میں اسلام لائے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 388,
			"arabicnumber": 388,
			"text": "ہم سے اسحاق بن نصر نے بیان کیا کہ کہا ہم سے ابواسامہ نے بیان کیا اعمش کے واسطہ سے، انہوں نے مسلم بن صبیح سے، انہوں نے مسروق بن اجدع سے، انہوں نے مغیرہ بن شعبہ سے، انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو وضو کرایا۔ آپ صلی اللہ علیہ وسلم نے اپنے موزوں پر مسح کیا اور نماز پڑھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 389,
			"arabicnumber": 389,
			"text": "ہمیں صلت بن محمد نے بیان کیا، کہا ہم سے مہدی بن میمون نے واصل کے واسطہ سے، وہ ابووائل شقیق بن سلمہ سے، وہ حذیفہ رضی اللہ عنہ سے کہ انھوں نے ایک شخص کو دیکھا جو رکوع اور سجدہ پوری طرح نہیں کرتا تھا۔ جب اس نے اپنی نماز پوری کر لی تو حذیفہ رضی اللہ عنہ نے فرمایا کہ تم نے نماز ہی نہیں پڑھی۔ ابووائل راوی نے کہا، میں خیال کرتا ہوں کہ حذیفہ رضی اللہ عنہ نے یہ بھی فرمایا کہ اگر تو ایسی ہی نماز پر مر جاتا تو نبی کریم صلی اللہ علیہ وسلم کی سنت پر نہیں مرتا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 390,
			"arabicnumber": 390,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا مجھ سے حدیث بیان کی بکر بن مضر نے جعفر سے، وہ ابن ہرمز سے، انہوں نے عبداللہ بن مالک بن بحینہ سے کہ نبی کریم صلی اللہ علیہ وسلم جب نماز پڑھتے تو اپنے بازوؤں کے درمیان اس قدر کشادگی کر دیتے کہ دونوں بغلوں کی سفیدی ظاہر ہونے لگتی تھی اور لیث نے یوں کہا کہ مجھ سے جعفر بن ربیعہ نے اسی طرح حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 391,
			"arabicnumber": 391,
			"text": "ہم سے عمرو بن عباس نے بیان کیا، انہوں نے کہا ہم سے ابن مہدی نے بیان کیا، انہوں نے کہا ہم سے منصور بن سعد نے میمون بن سیاہ کے واسطہ سے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، جس نے ہماری طرح نماز پڑھی اور ہماری طرح قبلہ کی طرف منہ کیا اور ہمارے ذبیحہ کو کھایا تو وہ مسلمان ہے جس کے لیے اللہ اور اس کے رسول کی پناہ ہے۔ پس تم اللہ کے ساتھ اس کی دی ہوئی پناہ میں خیانت نہ کرو۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 392,
			"arabicnumber": 392,
			"text": "ہم سے نعیم بن حماد نے بیان کیا، کہا ہم سے عبداللہ ابن مبارک نے حمید طویل کے واسطہ سے، انہوں نے روایت کیا انس بن مالک رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مجھے حکم دیا گیا ہے کہ میں لوگوں کے ساتھ جنگ کروں یہاں تک کہ وہ «لا إله إلا الله» کہیں۔ پس جب وہ اس کا اقرار کر لیں اور ہماری طرح نماز پڑھنے لگیں اور ہمارے قبلہ کی طرف نماز میں منہ کریں اور ہمارے ذبیحہ کو کھانے لگیں تو ان کا خون اور ان کے اموال ہم پر حرام ہو گئے۔ مگر کسی حق کے بدلے اور ( باطن میں ) ان کا حساب اللہ پر رہے گا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 393,
			"arabicnumber": 393,
			"text": "ابن ابی مریم نے کہا، ہمیں یحییٰ بن ایوب نے خبر دی، انہوں نے کہا ہم سے حمید نے حدیث بیان کیا، انہوں نے کہا ہم سے انس بن مالک رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کر کے حدیث بیان کی۔ علی بن عبداللہ بن مدینی نے فرمایا کہ ہم سے خالد بن حارث نے بیان کیا، انہوں نے کہا ہم سے حمید طویل نے بیان کیا، انہوں نے کہا کہ میمون بن سیاہ نے انس بن مالک رضی اللہ عنہ سے پوچھا کہ اے ابوحمزہ! آدمی کی جان اور مال پر زیادتی کو کیا چیزیں حرام کرتی ہیں؟ تو انہوں نے فرمایا کہ جس نے گواہی دی کہ اللہ کے سوا کوئی معبود نہیں اور ہمارے قبلہ کی طرف منہ کیا اور ہماری نماز کی طرح نماز پڑھی اور ہمارے ذبیحہ کو کھایا تو وہ مسلمان ہے۔ پھر اس کے وہی حقوق ہیں جو عام مسلمانوں کے ہیں اور اس کی وہی ذمہ داریاں ہیں جو عام مسلمانوں پر ہیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 394,
			"arabicnumber": 394,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان نے، کہا ہم سے زہری نے عطاء بن یزید لیثی کے واسطہ سے، انہوں نے ابوایوب انصاری رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم قضائے حاجت کے لیے جاؤ تو اس وقت نہ قبلہ کی طرف منہ کرو اور نہ پیٹھ کرو۔ بلکہ مشرق یا مغرب کی طرف اس وقت اپنا منہ کر لیا کرو۔ ابوایوب نے فرمایا کہ ہم جب شام میں آئے تو یہاں کے بیت الخلاء قبلہ رخ بنے ہوئے تھے ( جب ہم قضائے حاجت کے لیے جاتے ) تو ہم مڑ جاتے اور اللہ عزوجل سے استغفار کرتے تھے اور زہری نے عطاء سے اس حدیث کو اسی طرح روایت کیا۔ اس میں یوں ہے کہ عطاء نے کہا میں نے ابوایوب سے سنا، انہوں نے اسی طرح نبی کریم صلی اللہ علیہ وسلم سے سنا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 396,
			"arabicnumber": 396,
			"text": "",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 397,
			"arabicnumber": 397,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا سیف ابن ابی سلیمان سے، انہوں نے کہا میں نے مجاہد سے سنا، انہوں نے کہا کہ ابن عمر رضی اللہ عنہما کی خدمت میں ایک آدمی آیا اور کہنے لگا، اے لو یہ رسول اللہ صلی اللہ علیہ وسلم آن پہنچے اور آپ کعبہ کے اندر داخل ہو گئے۔ ابن عمر رضی اللہ عنہما نے کہا کہ میں جب آیا تو نبی کریم صلی اللہ علیہ وسلم کعبہ سے نکل چکے تھے، میں نے دیکھا کہ بلال دونوں دروازوں کے سامنے کھڑے ہیں۔ میں نے بلال سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم نے کعبہ کے اندر نماز پڑھی ہے؟ انہوں نے کہا کہ ہاں! دو رکعت ان دو ستونوں کے درمیان پڑھی تھیں، جو کعبہ میں داخل ہوتے وقت بائیں طرف واقع ہیں۔ پھر جب باہر تشریف لائے تو کعبہ کے سامنے دو رکعت نماز ادا فرمائی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 398,
			"arabicnumber": 398,
			"text": "ہم سے اسحاق بن نصر نے بیان کیا، انہوں نے کہا ہم سے عبدالرزاق بن ہمام نے بیان کیا، انہوں نے کہا ہمیں ابن جریج نے خبر پہنچائی عطاء ابن ابی رباح سے، انہوں نے کہا میں نے ابن عباس رضی اللہ عنہما سے سنا کہ جب نبی کریم صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے تو اس کے چاروں کونوں میں آپ صلی اللہ علیہ وسلم نے دعا کی اور نماز نہیں پڑھی۔ پھر جب باہر تشریف لائے تو دو رکعت نماز کعبہ کے سامنے پڑھی اور فرمایا کہ یہی قبلہ ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 399,
			"arabicnumber": 399,
			"text": "ہم سے عبداللہ بن رجاء نے بیان کیا، انہوں نے کہا ہم سے اسرائیل بن یونس نے بیان کیا، کہا انہوں نے ابواسحاق سے بیان کیا، کہا انہوں نے براء بن عازب رضی اللہ عنہما سے کہ نبی کریم صلی اللہ علیہ وسلم نے سولہ یا سترہ ماہ تک بیت المقدس کی طرف منہ کر کے نمازیں پڑھیں اور رسول صلی اللہ علیہ وسلم ( دل سے ) چاہتے تھے کہ کعبہ کی طرف منہ کر کے نماز پڑھیں۔ آخر اللہ تعالیٰ نے یہ آیت نازل فرمائی ”ہم آپ کا آسمان کی طرف باربار چہرہ اٹھانا دیکھتے ہیں۔ پھر آپ نے کعبہ کی طرف منہ کر لیا اور احمقوں نے جو یہودی تھے کہنا شروع کیا کہ انہیں اگلے قبلہ سے کس چیز نے پھیر دیا۔ آپ فرما دیجیئے کہ اللہ ہی کی ملکیت ہے مشرق اور مغرب، اللہ جس کو چاہتا ہے سیدھے راستے کی ہدایت کر دیتا ہے۔“ ( جب قبلہ بدلا تو ) ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی پھر نماز کے بعد وہ چلا اور انصار کی ایک جماعت پر اس کا گزر ہوا جو عصر کی نماز بیت المقدس کی طرف منہ کر کے پڑھ رہے تھے۔ اس شخص نے کہا کہ میں گواہی دیتا ہوں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ وہ نماز پڑھی ہے جس میں آپ نے موجودہ قبلہ ( کعبہ ) کی طرف منہ کر کے نماز پڑھی ہے۔ پھر وہ جماعت ( نماز کی حالت میں ہی ) مڑ گئی اور کعبہ کی طرف منہ کر لیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 400,
			"arabicnumber": 400,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ہشام بن عبداللہ دستوائی نے، کہا ہم سے یحییٰ بن ابی کثیر نے محمد بن عبدالرحمٰن کے واسطہ سے، انہوں نے جابر بن عبداللہ سے، انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر خواہ اس کا رخ کسی طرف ہو ( نفل ) نماز پڑھتے تھے لیکن جب فرض نماز پڑھنا چاہتے تو سواری سے اتر جاتے اور قبلہ کی طرف منہ کر کے نماز پڑھتے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 401,
			"arabicnumber": 401,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر نے منصور کے واسطے سے، انہوں نے ابراہیم سے، انہوں نے علقمہ سے، کہ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی۔ ابراہیم نے کہا مجھے نہیں معلوم کہ نماز میں زیادتی ہوئی یا کمی۔ پھر جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو آپ صلی اللہ علیہ وسلم سے کہا گیا کہ یا رسول اللہ! کیا نماز میں کوئی نیا حکم آیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا آخر کیا بات ہے؟ لوگوں نے کہا آپ نے اتنی اتنی رکعتیں پڑھی ہیں۔ یہ سن کر آپ صلی اللہ علیہ وسلم نے اپنے دونوں پاؤں پھیرے اور قبلہ کی طرف منہ کر لیا اور ( سہو کے ) دو سجدے کئے اور سلام پھیرا۔ پھر ہماری طرف متوجہ ہوئے اور فرمایا کہ اگر نماز میں کوئی نیا حکم نازل ہوا ہوتا تو میں تمہیں پہلے ہی ضرور کہہ دیتا لیکن میں تو تمہارے ہی جیسا آدمی ہوں، جس طرح تم بھولتے ہو میں بھی بھول جاتا ہوں۔ اس لیے جب میں بھول جایا کروں تو تم مجھے یاد دلایا کرو اور اگر کسی کو نماز میں شک ہو جائے تو اس وقت ٹھیک بات سوچ لے اور اسی کے مطابق نماز پوری کرے پھر سلام پھیر کر دو سجدے ( سہو کے ) کر لے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 402,
			"arabicnumber": 402,
			"text": "ہم سے عمرو بن عون نے بیان کیا، کہا ہم سے ہشیم نے حمید کے واسطہ سے، انہوں نے انس بن مالک رضی اللہ عنہ کے واسطہ سے کہ عمر رضی اللہ عنہ نے فرمایا کہ میری تین باتوں میں جو میرے منہ سے نکلا میرے رب نے ویسا ہی حکم فرمایا۔ میں نے کہا تھا کہ یا رسول اللہ! اگر ہم مقام ابراہیم کو نماز پڑھنے کی جگہ بنا سکتے تو اچھا ہوتا۔ اس پر یہ آیت نازل ہوئی۔ ”اور تم مقام ابراہیم کو نماز پڑھنے کی جگہ بنا لو“ دوسری آیت پردہ کے بارے میں ہے۔ میں نے کہا تھا کہ یا رسول اللہ کاش! آپ اپنی عورتوں کو پردہ کا حکم دیتے، کیونکہ ان سے اچھے اور برے ہر طرح کے لوگ بات کرتے ہیں۔ اس پر پردہ کی آیت نازل ہوئی اور ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم کی بیویاں جوش و خروش میں آپ کی خدمت میں اتفاق کر کے کچھ مطالبات لے کر حاضر ہوئیں۔ میں نے ان سے کہا کہ ہو سکتا ہے کہ اللہ پاک تمہیں طلاق دلا دیں اور تمہارے بدلے تم سے بہتر مسلمہ بیویاں اپنے رسول صلی اللہ علیہ وسلم کو عنایت کریں، تو یہ آیت نازل ہوئی «عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن‏» اور سعید ابن ابی مریم نے کہا کہ مجھے یحییٰ بن ایوب نے خبر دی، کہا کہ ہم سے حمید نے بیان کیا، کہا میں نے انس رضی اللہ عنہ سے یہ حدیث سنی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 403,
			"arabicnumber": 403,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہمیں امام مالک نے عبداللہ بن دینار کے واسطہ سے، انہوں نے عبداللہ بن عمر سے، آپ نے فرمایا کہ لوگ قباء میں فجر کی نماز پڑھ رہے تھے کہ اتنے میں ایک آنے والا آیا۔ اس نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم پر کل وحی نازل ہوئی ہے اور انہیں کعبہ کی طرف ( نماز میں ) منہ کرنے کا حکم ہو گیا ہے۔ چنانچہ ان لوگوں نے بھی کعبہ کی جانب منہ کر لیے جب کہ اس وقت وہ شام کی جانب منہ کئے ہوئے تھے، اس لیے وہ سب کعبہ کی جانب گھوم گئے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 404,
			"arabicnumber": 404,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا کہ کہا ہم سے یحییٰ بن سعید بن قطان نے شعبہ کے واسطے سے، انہوں نے ابراہیم سے، انہوں نے علقمہ سے انہوں نے عبداللہ سے، انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے ( بھولے سے ) ظہر کی نماز ( ایک مرتبہ ) پانچ رکعت پڑھی ہیں۔ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا کہ پھر آپ نے اپنے پاؤں موڑ لیے اور ( سہو کے ) دو سجدے کئے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 405,
			"arabicnumber": 405,
			"text": "ہم سے قتیبہ نے بیان کیا کہ کہا ہم سے اسماعیل بن جعفر نے حمید کے واسطہ سے، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے قبلہ کی طرف ( دیوار پر ) بلغم دیکھا، جو آپ صلی اللہ علیہ وسلم کو ناگوار گزرا اور یہ ناگواری آپ صلی اللہ علیہ وسلم کے چہرہ مبارک پر دکھائی دینے لگی۔ پھر آپ صلی اللہ علیہ وسلم اٹھے اور خود اپنے ہاتھ سے اسے کھرچ ڈالا اور فرمایا کہ جب کوئی شخص نماز کے لیے کھڑا ہوتا ہے تو گویا وہ اپنے رب کے ساتھ سرگوشی کرتا ہے، یا یوں فرمایا کہ اس کا رب اس کے اور قبلہ کے درمیان ہوتا ہے۔ اس لیے کوئی شخص ( نماز میں اپنے ) قبلہ کی طرف نہ تھوکے۔ البتہ بائیں طرف یا اپنے قدموں کے نیچے تھوک سکتا ہے۔ پھر آپ نے اپنی چادر کا کنارہ لیا، اس پر تھوکا پھر اس کو الٹ پلٹ کیا اور فرمایا، یا اس طرح کر لیا کرو۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 406,
			"arabicnumber": 406,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم سے امام مالک نے نافع کے واسطہ سے روایت کیا، کہا انہوں نے عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبلے کی دیوار پر تھوک دیکھا، آپ صلی اللہ علیہ وسلم نے اسے کھرچ ڈالا پھر ( آپ صلی اللہ علیہ وسلم نے ) لوگوں سے خطاب کیا اور فرمایا کہ جب کوئی شخص نماز میں ہو تو اپنے منہ کے سامنے نہ تھوکے کیونکہ نماز میں منہ کے سامنے اللہ عزوجل ہوتا ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 407,
			"arabicnumber": 407,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے ہشام بن عروہ کے واسطہ سے، انہوں نے اپنے والد سے، انہوں نے عائشہ ام المؤمنین رضی اللہ عنہا سے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبلہ کی دیوار پر رینٹ یا تھوک یا بلغم دیکھا تو اسے آپ صلی اللہ علیہ وسلم نے کھرچ ڈالا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 409,
			"arabicnumber": 409,
			"text": "",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 411,
			"arabicnumber": 411,
			"text": "",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 412,
			"arabicnumber": 412,
			"text": "ہم سے حفص بن عمر نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، انہوں نے کہا کہ مجھے قتادہ نے خبر دی، انہوں نے کہا میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، تم اپنے سامنے یا اپنی دائیں طرف نہ تھوکا کرو، البتہ بائیں طرف یا بائیں قدم کے نیچے تھوک سکتے ہو۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 413,
			"arabicnumber": 413,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، انہوں نے کہا ہم سے قتادہ نے بیان کیا، انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا مومن جب نماز میں ہوتا ہے تو وہ اپنے رب سے سرگوشی کرتا ہے۔ اس لیے وہ اپنے سامنے یا دائیں طرف نہ تھوکے، ہاں بائیں طرف یا پاؤں کے نیچے تھوک لے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 414,
			"arabicnumber": 414,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے، کہا ہم سے امام زہری نے حمید بن عبدالرحمٰن سے، انہوں نے ابو سعید خدری سے کہ نبی کریم صلی اللہ علیہ وسلم نے مسجد کے قبلہ کی دیوار پر بلغم دیکھا تو آپ صلی اللہ علیہ وسلم نے اسے کنکری سے کھرچ ڈالا۔ پھر فرمایا کہ کوئی شخص سامنے یا دائیں طرف نہ تھوکے، البتہ بائیں طرف یا بائیں پاؤں کے نیچے تھوک لینا چاہیے۔ دوسری روایت میں زہری سے یوں ہے کہ انہوں نے حمید بن عبدالرحمٰن سے ابو سعید خدری کے واسطہ سے اسی طرح یہ حدیث سنی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 415,
			"arabicnumber": 415,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے، کہا ہم سے قتادہ نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مسجد میں تھوکنا گناہ ہے اور اس کا کفارہ اسے ( زمین میں ) چھپا دینا ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 416,
			"arabicnumber": 416,
			"text": "ہم سے اسحاق بن نصر نے بیان کیا، انہوں نے کہا ہمیں عبدالرزاق نے معمر بن راشد سے، انہوں نے ہمام بن منبہ سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا وہ نبی کریم صلی اللہ علیہ وسلم سے نقل کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا جب کوئی شخص نماز کے لیے کھڑا ہو تو سامنے نہ تھوکے کیونکہ وہ جب تک اپنی نماز کی جگہ میں ہوتا ہے تو اللہ تعالیٰ سے سرگوشی کرتا رہتا ہے اور دائیں طرف بھی نہ تھوکے کیونکہ اس طرف فرشتہ ہوتا ہے، ہاں بائیں طرف یا قدم کے نیچے تھوک لے اور اسے مٹی میں چھپا دے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 417,
			"arabicnumber": 417,
			"text": "ہم سے مالک بن اسماعیل نے بیان کیا، کہا کہ ہم سے زہیر بن معاویہ نے، کہا ہم سے حمید نے انس بن مالک سے کہ نبی کریم صلی اللہ علیہ وسلم نے قبلہ کی طرف ( دیوار پر ) بلغم دیکھا تو آپ صلی اللہ علیہ وسلم نے خود اسے کھرچ ڈالا اور آپ صلی اللہ علیہ وسلم کی ناخوشی کو محسوس کیا گیا یا ( راوی نے اس طرح بیان کیا کہ ) اس کی وجہ سے آپ صلی اللہ علیہ وسلم کی شدید ناگواری کو محسوس کیا گیا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب کوئی شخص نماز کے لیے کھڑا ہوتا ہے تو وہ اپنے رب سے سرگوشی کرتا ہے، یا یہ کہ اس کا رب اس کے اور قبلہ کے درمیان ہوتا ہے۔ اس لیے قبلہ کی طرف نہ تھوکا کرو، البتہ بائیں طرف یا قدم کے نیچے تھوک لیا کرو۔ پھر آپ صلی اللہ علیہ وسلم نے اپنی چادر کا ایک کونا ( کنارہ ) لیا، اس میں تھوکا اور چادر کی ایک تہہ کو دوسری تہہ پر پھیر لیا اور فرمایا، یا اس طرح کر لیا کرے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 418,
			"arabicnumber": 418,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے ابوالزناد سے خبر دی، انہوں نے اعرج سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کیا تمہارا یہ خیال ہے کہ میرا منہ ( نماز میں ) قبلہ کی طرف ہے، اللہ کی قسم مجھ سے نہ تمہارا خشوع چھپتا ہے نہ رکوع، میں اپنی پیٹھ کے پیچھے سے تم کو دیکھتا رہتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 419,
			"arabicnumber": 419,
			"text": "ہم سے یحییٰ بن صالح نے بیان کیا، انہوں نے کہا ہم سے فلیح بن سلیمان نے ہلال بن علی سے، انہوں نے انس بن مالک رضی اللہ عنہ سے، وہ کہتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے ہمیں ایک مرتبہ نماز پڑھائی، پھر آپ صلی اللہ علیہ وسلم منبر پر چڑھے، پھر نماز کے باب میں اور رکوع کے باب میں فرمایا میں تمہیں پیچھے سے بھی اسی طرح دیکھتا رہتا ہوں جیسے اب سامنے سے دیکھ رہا ہوں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 420,
			"arabicnumber": 420,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی، انہوں نے نافع کے واسطہ سے بیان کیا، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان گھوڑوں کی جنھیں ( جہاد کے لیے ) تیار کیا گیا تھا مقام حفیاء سے دوڑ کرائی، اس دوڑ کی حد ثنیۃ الوداع تھی اور جو گھوڑے ابھی تیار نہیں ہوئے تھے ان کی دوڑ ثنیۃ الوداع سے مسجد بنی زریق تک کرائی۔ عبداللہ بن عمر رضی اللہ عنہما نے بھی اس گھوڑ دوڑ میں شرکت کی تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 421,
			"arabicnumber": 421,
			"text": "ابراہیم بن طہمان نے کہا، عبدالعزیز بن صہیب سے، انہوں نے انس رضی اللہ عنہ سے روایت کیا کہ نبی کریم صلی اللہ علیہ وسلم کے پاس بحرین سے رقم آئی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے مسجد میں ڈال دو اور یہ رقم اس تمام رقم سے زیادہ تھی جو اب تک آپ صلی اللہ علیہ وسلم کی خدمت میں آ چکی تھی۔ پھر آپ صلی اللہ علیہ وسلم نماز کے لیے تشریف لائے اور اس کی طرف کوئی توجہ نہیں فرمائی، جب آپ صلی اللہ علیہ وسلم نماز پوری کر چکے تو آ کر مال ( رقم ) کے پاس بیٹھ گئے اور اسے تقسیم کرنا شروع فرما دیا۔ اس وقت جسے بھی آپ صلی اللہ علیہ وسلم دیکھتے اسے عطا فرما دیتے۔ اتنے میں عباس رضی اللہ عنہ حاضر ہوئے اور بولے کہ یا رسول اللہ! مجھے بھی عطا کیجیئے کیونکہ میں نے ( غزوہ بدر میں ) اپنا بھی فدیہ دیا تھا اور عقیل کا بھی ( اس لیے میں زیر بار ہوں ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ لے لیجیئے۔ انہوں نے اپنے کپڑے میں روپیہ بھر لیا اور اسے اٹھانے کی کوشش کی لیکن ( وزن کی زیادتی کی وجہ سے ) وہ نہ اٹھا سکے اور کہنے لگے یا رسول اللہ! کسی کو فرمائیے کہ وہ اٹھانے میں میری مدد کرے۔ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں ( یہ نہیں ہو سکتا ) انہوں نے کہا کہ پھر آپ ہی اٹھوا دیجیئے۔ آپ صلی اللہ علیہ وسلم نے اس پر بھی انکار کیا، تب عباس رضی اللہ عنہ نے اس میں سے تھوڑا سا گرا دیا اور باقی کو اٹھانے کی کوشش کی، ( لیکن اب بھی نہ اٹھا سکے ) پھر فرمایا کہ یا رسول اللہ! کسی کو میری مدد کرنے کا حکم دیجیئے۔ آپ صلی اللہ علیہ وسلم نے انکار فرمایا تو انہوں نے کہا کہ پھر آپ ہی اٹھوا دیجیئے۔ لیکن آپ صلی اللہ علیہ وسلم نے اس سے بھی انکار کیا، تب انہوں نے اس میں سے تھوڑا سا روپیہ گرا دیا اور اسے اٹھا کر اپنے کاندھے پر رکھ لیا اور چلنے لگے، رسول اللہ صلی اللہ علیہ وسلم کو ان کی اس حرص پر اتنا تعجب ہوا کہ آپ صلی اللہ علیہ وسلم اس وقت تک ان کی طرف دیکھتے رہے جب تک وہ ہماری نظروں سے غائب نہیں ہو گئے اور آپ صلی اللہ علیہ وسلم بھی وہاں سے اس وقت تک نہ اٹھے جب تک کہ ایک چونی بھی باقی رہی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 422,
			"arabicnumber": 422,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے مالک نے اسحاق بن عبداللہ سے انہوں نے انس رضی اللہ عنہ سے سنا، وہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو مسجد میں پایا، آپ صلی اللہ علیہ وسلم کے پاس اور بھی کئی لوگ تھے۔ میں کھڑا ہو گیا تو نبی کریم صلی اللہ علیہ وسلم نے مجھ سے پوچھا کہ کیا تجھ کو ابوطلحہ نے بھیجا ہے؟ میں نے کہا جی ہاں آپ صلی اللہ علیہ وسلم نے پوچھا کھانے کے لیے؟ ( بلایا ہے ) میں نے عرض کی کہ جی ہاں! تب آپ صلی اللہ علیہ وسلم نے اپنے قریب موجود لوگوں سے فرمایا کہ چلو، سب حضرات چلنے لگے اور میں ان کے آگے آگے چل رہا تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 423,
			"arabicnumber": 423,
			"text": "ہم سے یحییٰ بن موسیٰ نے بیان کیا، کہا ہم سے عبدالرزاق نے، کہا ہم کو ابن جریج نے، کہا ہمیں ابن شہاب نے سہل بن سعد ساعدی سے کہ ایک شخص نے کہا، یا رسول اللہ! اس شخص کے بارہ میں فرمائیے جو اپنی بیوی کے ساتھ کسی غیر مرد کو ( بدفعلی کرتے ہوئے ) دیکھتا ہے، کیا اسے مار ڈالے؟ آخر اس مرد نے اپنی بیوی کے ساتھ مسجد میں لعان کیا اور اس وقت میں موجود تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 424,
			"arabicnumber": 424,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن سعد نے ابن شہاب کے واسطہ سے بیان کیا، انہوں نے محمود بن ربیع سے انہوں نے عتبان بن مالک سے (جو نابینا تھے) کہ نبی کریم صلی اللہ علیہ وسلم ان کے گھر تشریف لائے۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ تم اپنے گھر میں کہاں پسند کرتے ہو کہ تمہارے لیے نماز پڑھوں۔ عتبان نے بیان کیا کہ میں نے ایک جگہ کی طرف اشارہ کیا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے تکبیر کہی اور ہم نے آپ صلی اللہ علیہ وسلم کے پیچھے صف باندھی پھر آپ صلی اللہ علیہ وسلم نے دو رکعت نماز ( نفل ) پڑھائی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 425,
			"arabicnumber": 425,
			"text": "ہم سے سعید بن عفیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، انہوں نے کہا کہ مجھ سے عقیل نے ابن شہاب کے واسطہ سے بیان کیا کہ مجھے محمود بن ربیع انصاری نے کہ عتبان بن مالک انصاری رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے صحابی اور غزوہ بدر کے حاضر ہونے والوں میں سے تھے، وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا یا رسول اللہ! میری بینائی میں کچھ فرق آ گیا ہے اور میں اپنی قوم کے لوگوں کو نماز پڑھایا کرتا ہوں لیکن جب برسات کا موسم آتا ہے تو میرے اور میری قوم کے درمیان جو وادی ہے وہ بھر جاتی ہے اور بہنے لگ جاتی ہے اور میں انہیں نماز پڑھانے کے لیے مسجد تک نہیں جا سکتا یا رسول اللہ! میری خواہش ہے کہ آپ میرے گھر تشریف لائیں اور ( کسی جگہ ) نماز پڑھ دیں تاکہ میں اسے نماز پڑھنے کی جگہ بنا لوں۔ راوی نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے عتبان سے فرمایا، انشاء اللہ تعالیٰ میں تمہاری اس خواہش کو پورا کروں گا۔ عتبان نے کہا کہ ( دوسرے دن ) رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر صدیق رضی اللہ عنہ جب دن چڑھا تو دونوں تشریف لے آئے اور رسول اللہ صلی اللہ علیہ وسلم نے اندر آنے کی اجازت چاہی، میں نے اجازت دے دی۔ جب آپ گھر میں تشریف لائے تو بیٹھے بھی نہیں اور پوچھا کہ تم اپنے گھر کے کس حصہ میں مجھ سے نماز پڑھنے کی خواہش رکھتے ہو۔ عتبان نے کہا کہ میں نے گھر میں ایک کونے کی طرف اشارہ کیا، تو رسول اللہ صلی اللہ علیہ وسلم ( اس جگہ ) کھڑے ہوئے اور تکبیر کہی ہم بھی آپ کے پیچھے کھڑے ہو گئے اور صف باندھی پس آپ نے دو رکعت ( نفل ) نماز پڑھائی پھر سلام پھیرا۔ عتبان نے کہا کہ ہم نے آپ کو تھوڑی دیر کے لیے روکا اور آپ کی خدمت میں حلیم پیش کیا جو آپ ہی کے لیے تیار کیا گیا تھا۔ عتبان نے کہا کہ محلہ والوں کا ایک مجمع گھر میں لگ گیا اور مجمع میں سے ایک شخص بولا کہ مالک بن دخشن یا ( یہ کہا ) ابن دخشن دکھائی نہیں دیتا۔ اس پر کسی دوسرے نے کہہ دیا کہ وہ تو منافق ہے جسے اللہ اور رسول سے کوئی محبت نہیں رسول اللہ صلی اللہ علیہ وسلم نے یہ سن کر فرمایا ایسا مت کہو، کیا تم دیکھتے نہیں کہ اس نے «لا إله إلا الله» کہا ہے اور اس سے مقصود خالص اللہ کی رضا مندی حاصل کرنا ہے۔ تب منافقت کا الزام لگانے والا بولا کہ اللہ اور اس کے رسول کو زیادہ علم ہے ہم تو بظاہر اس کی توجہات اور دوستی منافقوں ہی کے ساتھ دیکھتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے «لا إله إلا الله» کہنے والے پر اگر اس کا مقصد خالص اللہ کی رضا حاصل کرنا ہو دوزخ کی آگ حرام کر دی ہے۔ ابن شہاب نے کہا کہ پھر میں نے محمود سے سن کر حصین بن محمد انصاری سے جو بنوسالم کے شریف لوگوں میں سے ہیں ( اس حدیث ) کے متعلق پوچھا تو انہوں نے اس کی تصدیق کی اور کہا کہ محمود سچا ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 426,
			"arabicnumber": 426,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم کو شعبہ نے خبر دی اشعث بن سلیم کے واسطہ سے، انہوں نے مسروق سے، انہوں نے عائشہ رضی اللہ عنہا سے، آپ فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اپنے تمام کاموں میں جہاں تک ممکن ہوتا دائیں طرف سے شروع کرنے کو پسند فرماتے تھے۔ طہارت کے وقت بھی، کنگھا کرنے اور جوتا پہننے میں بھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 427,
			"arabicnumber": 427,
			"text": "ہم سے محمد بن مثنی نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے ہشام بن عروہ کے واسطہ سے بیان کیا، کہا کہ مجھے میرے باپ نے عائشہ رضی اللہ عنہا سے یہ خبر پہنچائی کہ ام حبیبہ اور ام سلمہ رضی اللہ عنہما دونوں نے ایک کلیسا کا ذکر کیا جسے انہوں نے حبشہ میں دیکھا تو اس میں مورتیں ( تصویریں ) تھیں۔ انہوں نے اس کا تذکرہ نبی کریم صلی اللہ علیہ وسلم سے بھی کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کا یہ قاعدہ تھا کہ اگر ان میں کوئی نیکوکار ( نیک ) شخص مر جاتا تو وہ لوگ اس کی قبر پر مسجد بناتے اور اس میں یہی مورتیں ( تصویریں ) بنا دیتے پس یہ لوگ اللہ کی درگاہ میں قیامت کے دن تمام مخلوق میں برے ہوں گے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 428,
			"arabicnumber": 428,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا، انہوں نے ابوالتیاح کے واسطہ سے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے، انہوں نے کہا کہ جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو یہاں کے بلند حصہ میں بنی عمرو بن عوف کے یہاں آپ اترے اور یہاں چوبیس راتیں قیام فرمایا۔ پھر آپ صلی اللہ علیہ وسلم نے بنونجار کو بلا بھیجا، تو وہ لوگ تلواریں لٹکائے ہوئے آئے۔ انس نے کہا، گویا میری نظروں کے سامنے نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر تشریف فرما ہیں، جبکہ ابوبکر صدیق رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کے پیچھے بیٹھے ہوئے ہیں اور بنو نجار کے لوگ آپ صلی اللہ علیہ وسلم کے چاروں طرف ہیں۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم ابوایوب کے گھر کے سامنے اترے اور آپ صلی اللہ علیہ وسلم یہ پسند کرتے تھے کہ جہاں بھی نماز کا وقت آ جائے فوراً نماز ادا کر لیں۔ آپ بکریوں کے باڑوں میں بھی نماز پڑھ لیتے تھے، پھر آپ نے یہاں مسجد بنانے کے لیے حکم فرمایا۔ چنانچہ بنو نجار کے لوگوں کو آپ صلی اللہ علیہ وسلم نے بلوا کر فرمایا کہ اے بنو نجار! تم اپنے اس باغ کی قیمت مجھ سے لے لو۔ انہوں نے جواب دیا نہیں یا رسول اللہ! اس کی قیمت ہم صرف اللہ سے مانگتے ہیں۔ انس رضی اللہ عنہ نے بیان کیا کہ میں جیسا کہ تمہیں بتا رہا تھا یہاں مشرکین کی قبریں تھیں، اس باغ میں ایک ویران جگہ تھی اور کچھ کھجور کے درخت بھی تھے پس نبی کریم صلی اللہ علیہ وسلم نے مشرکین کی قبروں کو اکھڑوا دیا ویرانہ کو صاف اور برابر کرایا اور درختوں کو کٹوا کر ان کی لکڑیوں کو مسجد کے قبلہ کی جانب بچھا دیا اور پتھروں کے ذریعہ انہیں مضبوط بنا دیا۔ صحابہ پتھر اٹھاتے ہوئے رجز پڑھتے تھے اور نبی کریم صلی اللہ علیہ وسلم بھی ان کے ساتھ تھے اور یہ کہہ رہے تھے کہ اے اللہ! آخرت کے فائدہ کے علاوہ اور کوئی فائدہ نہیں پس انصار و مہاجرین کی مغفرت فرمانا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 429,
			"arabicnumber": 429,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے ابوالتیاح کے واسطے سے، انہوں نے انس بن مالک رضی اللہ عنہ سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم بکریوں کے باڑوں میں نماز پڑھتے تھے، ابوالتیاح یا شعبہ نے کہا، پھر میں نے انس کو یہ کہتے ہوئے سنا کہ نبی کریم صلی اللہ علیہ وسلم بکریوں کے باڑہ میں مسجد کی تعمیر سے پہلے نماز پڑھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 430,
			"arabicnumber": 430,
			"text": "ہم سے صدقہ بن فضل نے بیان کیا، انہوں نے کہا ہم سے سلیمان بن حیان نے، کہا ہم سے عبیداللہ نے نافع کے واسطہ سے، انہوں نے کہا کہ میں نے ابن عمر رضی اللہ عنہما کو اپنے اونٹ کی طرف نماز پڑھتے دیکھا اور انہوں نے فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو اسی طرح پڑھتے دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 431,
			"arabicnumber": 431,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، انہوں نے امام مالک کے واسطہ سے بیان کیا، انہوں نے زید بن اسلم سے، انہوں نے عطاء بن یسار سے، انہوں نے عبداللہ بن عباس رضی اللہ عنہما سے، انہوں نے فرمایا کہ سورج گہن ہوا تو نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھی اور فرمایا کہ مجھے ( آج ) دوزخ دکھائی گئی، اس سے زیادہ بھیانک منظر میں نے کبھی نہیں دیکھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 432,
			"arabicnumber": 432,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ نے بیان کیا، انہوں نے عبیداللہ بن عمر کے واسطہ سے بیان کیا، انہوں نے کہا کہ مجھے نافع نے عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اپنے گھروں میں بھی نمازیں پڑھا کرو اور انہیں بالکل مقبرہ نہ بنا لو۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 433,
			"arabicnumber": 433,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، انہوں نے کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا، انہوں نے عبداللہ بن دینار کے واسطہ سے بیان کیا، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، ان عذاب والوں کے آثار سے اگر تمہارا گزر ہو تو روتے ہوئے گزرو، اگر تم اس موقع پر رو نہ سکو تو ان سے گزرو ہی نہیں۔ ایسا نہ ہو کہ تم پر بھی ان کا سا عذاب آ جائے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 434,
			"arabicnumber": 434,
			"text": "ہم سے محمد بن سلام بیکندی نے بیان کیا، انہوں نے کہا ہم کو عبدہ بن سلیمان نے خبر دی، انہوں نے ہشام بن عروہ سے، انہوں نے اپنے باپ عروہ بن زبیر سے، انہوں نے عائشہ رضی اللہ عنہا سے کہ ام سلمہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم سے ایک گرجا کا ذکر کیا جس کو انہوں نے حبش کے ملک میں دیکھا اس کا نام ماریہ تھا۔ اس میں جو مورتیں دیکھی تھیں وہ بیان کیں۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایسے لوگ تھے کہ اگر ان میں کوئی نیک بندہ ( یا یہ فرمایا کہ ) نیک آدمی مر جاتا تو اس کی قبر پر مسجد بناتے اور اس میں یہ بت رکھتے۔ یہ لوگ اللہ کے نزدیک ساری مخلوقات سے بدتر ہیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 436,
			"arabicnumber": 436,
			"text": "",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 437,
			"arabicnumber": 437,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، انہوں نے مالک کے واسطے سے، انہوں نے ابن شہاب سے، انہوں نے سعید بن مسیب سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، یہودیوں پر اللہ کی لعنت ہو انہوں نے اپنے انبیاء کی قبروں کو مساجد بنا لیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 438,
			"arabicnumber": 438,
			"text": "ہم سے محمد بن سنان نے بیان کیا، انہوں نے کہا ہم سے ہشیم نے بیان کیا، انہوں نے کہا ہم سے ابوالحکم سیار نے بیان کیا، انہوں نے کہا ہم سے یزید فقیر نے، کہا ہم سے جابر بن عبداللہ رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا۔ مجھے پانچ ایسی چیزیں عطا کی گئی ہیں جو مجھ سے پہلے انبیاء کو نہیں دی گئی تھیں۔ ( 1 ) ایک مہینے کی راہ سے میرا رعب ڈال کر میری مدد کی گئی۔ ( 2 ) میرے لیے تمام زمین میں نماز پڑھنے اور پاکی حاصل کرنے کی اجازت ہے۔ اس لیے میری امت کے جس آدمی کی نماز کا وقت ( جہاں بھی ) آ جائے اسے ( وہیں ) نماز پڑھ لینی چاہیے۔ ( 3 ) میرے لیے مال غنیمت حلال کیا گیا۔ ( 4 ) پہلے انبیاء خاص اپنی قوموں کی ہدایت کے لیے بھیجے جاتے تھے۔ لیکن مجھے دنیا کے تمام انسانوں کی ہدایت کے لیے بھیجا گیا ہے۔ ( 5 ) مجھے شفاعت عطا کی گئی ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 439,
			"arabicnumber": 439,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ نے ہشام کے واسطہ سے، انہوں نے اپنے باپ سے، انہوں نے عائشہ رضی اللہ عنہا سے کہ عرب کے کسی قبیلہ کی ایک کالی لونڈی تھی۔ انہوں نے اسے آزاد کر دیا تھا اور وہ انہیں کے ساتھ رہتی تھی۔ اس نے بیان کیا کہ ایک دفعہ ان کی ایک لڑکی ( جو دلہن تھی ) نہانے کو نکلی، اس کا کمر بند سرخ تسموں کا تھا اس نے وہ کمر بند اتار کر رکھ دیا یا اس کے بدن سے گر گیا۔ پھر اس طرف سے ایک چیل گزری جہاں کمر بند پڑا تھا۔ چیل اسے ( سرخ رنگ کی وجہ سے ) گوشت سمجھ کر جھپٹ لے گئی۔ بعد میں قبیلہ والوں نے اسے بہت تلاش کیا، لیکن کہیں نہ ملا۔ ان لوگوں نے اس کی تہمت مجھ پر لگا دی اور میری تلاشی لینی شروع کر دی، یہاں تک کہ انہوں نے اس کی شرمگاہ تک کی تلاشی لی۔ اس نے بیان کیا کہ اللہ کی قسم میں ان کے ساتھ اسی حالت میں کھڑی تھی کہ وہی چیل آئی اور اس نے ان کا وہ کمر بند گرا دیا۔ وہ ان کے سامنے ہی گرا۔ میں نے ( اسے دیکھ کر ) کہا یہی تو تھا جس کی تم مجھ پر تہمت لگاتے تھے۔ تم لوگوں نے مجھ پر اس کا الزام لگایا تھا حالانکہ میں اس سے پاک تھی۔ یہی تو ہے وہ کمر بند! اس ( لونڈی ) نے کہا کہ اس کے بعد میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور اسلام لائی۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ اس کے لیے مسجد نبوی میں ایک بڑا خیمہ لگا دیا گیا۔ ( یا یہ کہا کہ ) چھوٹا سا خیمہ لگا دیا گیا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ وہ لونڈی میرے پاس آتی اور مجھ سے باتیں کیا کرتی تھی۔ جب بھی وہ میرے پاس آتی تو یہ ضرور کہتی کہ کمر بند کا دن ہمارے رب کی عجیب نشانیوں میں سے ہے۔ اسی نے مجھے کفر کے ملک سے نجات دی۔ عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے اس سے کہا، آخر بات کیا ہے؟ جب بھی تم میرے پاس بیٹھتی ہو تو یہ بات ضرور کہتی ہو۔ آپ نے بیان کیا کہ پھر اس نے مجھے یہ قصہ سنایا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 440,
			"arabicnumber": 440,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ نے عبیداللہ کے واسطہ سے بیان کیا، انہوں نے کہا کہ مجھ کو نافع نے بیان کیا، کہا کہ مجھے عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ وہ اپنی نوجوانی میں جب کہ ان کے بیوی بچے نہیں تھے نبی کریم صلی اللہ علیہ وسلم کی مسجد میں سویا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 441,
			"arabicnumber": 441,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا، انہوں نے اپنے باپ ابوحازم سہل بن دینار سے، انہوں نے سہل بن سعد رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم فاطمہ رضی اللہ عنہا کے گھر تشریف لائے دیکھا کہ علی رضی اللہ عنہ گھر میں موجود نہیں ہیں۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے چچا کے بیٹے کہاں ہیں؟ انہوں نے بتایا کہ میرے اور ان کے درمیان کچھ ناگواری پیش آ گئی اور وہ مجھ پر خفا ہو کر کہیں باہر چلے گئے ہیں اور میرے یہاں قیلولہ بھی نہیں کیا ہے۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص سے کہا کہ علی رضی اللہ عنہ کو تلاش کرو کہ کہاں ہیں؟ وہ آئے اور بتایا کہ مسجد میں سوئے ہوئے ہیں۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے۔ علی رضی اللہ عنہ لیٹے ہوئے تھے، چادر آپ صلی اللہ علیہ وسلم کے پہلو سے گر گئی تھی اور جسم پر مٹی لگ گئی تھی۔ رسول اللہ صلی اللہ علیہ وسلم جسم سے دھول جھاڑ رہے تھے اور فرما رہے تھے اٹھو ابوتراب اٹھو۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 442,
			"arabicnumber": 442,
			"text": "ہم سے یوسف بن عیسیٰ نے بیان کیا، کہا ہم سے ابن فضیل نے اپنے والد کے واسطہ سے، انہوں نے ابوحازم سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ آپ نے فرمایا کہ میں نے ستر اصحاب صفہ کو دیکھا کہ ان میں کوئی ایسا نہ تھا جس کے پاس چادر ہو۔ فقط تہہ بند ہوتا، یا رات کو اوڑھنے کا کپڑا جنھیں یہ لوگ اپنی گردنوں سے باندھ لیتے۔ یہ کپڑے کسی کے آدھی پنڈلی تک آتے اور کسی کے ٹخنوں تک۔ یہ حضرات ان کپڑوں کو اس خیال سے کہ کہیں شرمگاہ نہ کھل جائے اپنے ہاتھوں سے سمیٹے رہتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 443,
			"arabicnumber": 443,
			"text": "ہم سے خلاد بن یحییٰ نے بیان کیا، کہا ہم سے مسعر نے، کہا ہم سے محارب بن دثار نے جابر بن عبداللہ کے واسطہ سے، وہ کہتے ہیں کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ آپ صلی اللہ علیہ وسلم اس وقت مسجد میں تشریف فرما تھے۔ مسعر نے کہا میرا خیال ہے کہ محارب نے چاشت کا وقت بتایا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ( پہلے ) دو رکعت نماز پڑھ اور میرا نبی کریم صلی اللہ علیہ وسلم پر کچھ قرض تھا۔ جسے آپ صلی اللہ علیہ وسلم نے ادا کیا اور زیادہ ہی دیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 444,
			"arabicnumber": 444,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا انہوں نے کہا کہ ہمیں امام مالک نے عامر بن عبداللہ بن زبیر سے یہ خبر پہنچائی، انہوں نے عمرو بن سلیم زرقی کے واسطہ سے بیان کیا، انہوں نے ابوقتادہ سلمی رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی شخص مسجد میں داخل ہو تو بیٹھنے سے پہلے دو رکعت نماز پڑھ لے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 445,
			"arabicnumber": 445,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا کہ کہا ہمیں مالک نے ابوالزناد سے، انہوں نے اعرج سے، انہوں نے ابوہریرہ رضی اللہ عنہ اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تک تم اپنے مصلے پر جہاں تم نے نماز پڑھی تھی، بیٹھے رہو اور ریاح خارج نہ کرو تو ملائکہ تم پر برابر درود بھیجتے رہتے ہیں۔ کہتے ہیں «اللهم اغفر له اللهم ارحمه» ”اے اللہ! اس کی مغفرت کیجیئے، اے اللہ! اس پر رحم کیجیئے۔‘‘",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے یعقوب بن ابراہیم بن سعید نے بیان کیا، انہوں نے کہا مجھ سے میرے والد ابراہیم بن سعید نے صالح بن کیسان کے واسطے سے، ہم سے نافع نے، عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مسجد نبوی کچی اینٹوں سے بنائی گئی تھی۔ اس کی چھت کھجور کی شاخوں کی تھی اور ستون اسی کی کڑیوں کے۔ ابوبکر رضی اللہ عنہ نے اس میں کسی قسم کی زیادتی نہیں کی۔ البتہ عمر رضی اللہ عنہ نے اسے بڑھایا اور اس کی تعمیر رسول اللہ صلی اللہ علیہ وسلم کی بنائی ہوئی بنیادوں کے مطابق کچی اینٹوں اور کھجوروں کی شاخوں سے کی اور اس کے ستون بھی کڑیوں ہی کے رکھے۔ پھر عثمان رضی اللہ عنہ نے اس کی عمارت کو بدل دیا اور اس میں بہت سی زیادتی کی۔ اس کی دیواریں منقش پتھروں اور گچھ سے بنائیں۔ اس کے ستون بھی منقش پتھروں سے بنوائے اور چھت ساگوان سے بنائی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 447,
			"arabicnumber": 447,
			"text": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے عبدالعزیز بن مختار نے بیان کیا، کہا کہ ہم سے خالد حذاء نے عکرمہ سے، انہوں نے بیان کیا کہ مجھ سے اور اپنے صاحبزادے علی سے ابن عباس رضی اللہ عنہما نے کہا کہ ابو سعید خدری رضی اللہ عنہ کی خدمت میں جاؤ اور ان کی احادیث سنو۔ ہم گئے۔ دیکھا کہ ابوسعید رضی اللہ عنہ اپنے باغ کو درست کر رہے تھے۔ ہم کو دیکھ کر آپ نے اپنی چادر سنبھالی اور گوٹ مار کر بیٹھ گئے۔ پھر ہم سے حدیث بیان کرنے لگے۔ جب مسجد نبوی کے بنانے کا ذکر آیا تو آپ نے بتایا کہ ہم تو ( مسجد کے بنانے میں حصہ لیتے وقت ) ایک ایک اینٹ اٹھاتے۔ لیکن عمار دو دو اینٹیں اٹھا رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں دیکھا تو ان کے بدن سے مٹی جھاڑنے لگے اور فرمایا، افسوس! عمار کو ایک باغی جماعت قتل کرے گی۔ جسے عمار جنت کی دعوت دیں گے اور وہ جماعت عمار کو جہنم کی دعوت دے رہی ہو گی۔ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ عمار رضی اللہ عنہ کہتے تھے کہ میں فتنوں سے اللہ کی پناہ مانگتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 448,
			"arabicnumber": 448,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا کہ کہا ہم سے عبدالعزیز نے ابوحازم کے واسطہ سے، انہوں نے سہل رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک عورت کے پاس ایک آدمی بھیجا کہ وہ اپنے بڑھئی غلام سے کہے کہ میرے لیے ( منبر ) لکڑیوں کے تختوں سے بنا دے جن پر میں بیٹھا کروں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 449,
			"arabicnumber": 449,
			"text": "ہم سے خلاد بن یحییٰ نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالواحد بن ایمن نے اپنے والد کے واسطے سے بیان کیا، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے کہ ایک عورت نے کہا یا رسول اللہ صلی اللہ علیہ وسلم ! کیا میں آپ کے لیے کوئی ایسی چیز نہ بنا دوں جس پر آپ صلی اللہ علیہ وسلم بیٹھا کریں۔ میرا ایک بڑھئی غلام بھی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا اگر تو چاہے تو منبر بنوا دے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 450,
			"arabicnumber": 450,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا کہ مجھ سے عمرو بن حارث نے بیان کیا، انہوں نے کہا ہم سے بکیر بن عبداللہ نے بیان کیا، ان سے عاصم بن عمرو بن قتادہ نے بیان کیا، انہوں نے عبیداللہ بن اسود خولانی سے سنا، انہوں نے عثمان بن عفان رضی اللہ عنہ سے سنا کہ مسجد نبوی کی تعمیر کے متعلق لوگوں کی باتوں کو سن کر آپ نے فرمایا کہ تم لوگوں نے بہت زیادہ باتیں کی ہیں۔ حالانکہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے کہ جس نے مسجد بنائی بکیر ( راوی ) نے کہا میرا خیال ہے کہ آپ نے یہ بھی فرمایا کہ اس سے مقصود اللہ تعالیٰ کی رضا ہو، تو اللہ تعالیٰ ایسا ہی ایک مکان جنت میں اس کے لیے بنائے گا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 451,
			"arabicnumber": 451,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے، انہوں نے کہا کہ میں نے عمرو بن دینار سے پوچھا کیا تم نے جابر بن عبداللہ سے یہ حدیث سنی ہے کہ ایک شخص مسجد نبوی میں آیا اور وہ تیر لیے ہوئے تھا، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا کہ ان کی نوکیں تھامے رکھو۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 452,
			"arabicnumber": 452,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہ کہا ہم سے عبدالواحد بن زیاد نے کہ کہا ہم سے ابوبردہ بن عبداللہ نے۔ انہوں نے کہا کہ میں نے اپنے والد (ابوموسیٰ اشعری صحابی) سے سنا وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ آپ صلی اللہ علیہ وسلم نے فرمایا اگر کوئی شخص ہماری مساجد یا ہمارے بازاروں میں تیر لیے ہوئے چلے تو ان کے پھل تھامے رہے، ایسا نہ ہو کہ اپنے ہاتھوں سے کسی مسلمان کو زخمی کر دے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 453,
			"arabicnumber": 453,
			"text": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا کہ ہمیں شعیب بن ابی حمزہ نے زہری کے واسطے سے کہا کہ مجھے ابوسلمہ (اسماعیل یا عبداللہ) ابن عبدالرحمٰن بن عوف نے، انہوں نے حسان بن ثابت انصاری رضی اللہ عنہ سے سنا، وہ ابوہریرہ رضی اللہ عنہ کو اس بات پر گواہ بنا رہے تھے کہ میں تمہیں اللہ کا واسطہ دیتا ہوں کہ کیا تم نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے نہیں سنا تھا کہ اے حسان! اللہ کے رسول صلی اللہ علیہ وسلم کی طرف سے ( مشرکوں کو اشعار میں ) جواب دو اور اے اللہ! حسان کی روح القدس کے ذریعہ مدد کر۔ ابوہریرہ رضی اللہ عنہ نے فرمایا، ہاں ( میں گواہ ہوں۔ بیشک میں نے نبی کریم صلی اللہ علیہ وسلم سے یہ سنا ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 455,
			"arabicnumber": 455,
			"text": "",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 456,
			"arabicnumber": 456,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا کہ کہا ہم سے سفیان بن عیینہ نے یحییٰ بن سعید انصاری کے واسطہ سے، انہوں نے عمرہ بنت عبدالرحمٰن سے، انہوں نے عائشہ رضی اللہ عنہا سے۔ آپ نے فرمایا کہ بریرہ رضی اللہ عنہ ( لونڈی ) ان سے اپنی کتابت کے بارے میں مدد لینے آئیں۔ عائشہ رضی اللہ عنہا نے کہا تم چاہو تو میں تمہارے مالکوں کو یہ رقم دے دوں ( اور تمہیں آزاد کرا دوں ) اور تمہارا ولاء کا تعلق مجھ سے قائم ہو۔ اور بریرہ کے آقاؤں نے کہا ( عائشہ رضی اللہ عنہا سے ) کہ اگر آپ چاہیں تو جو قیمت باقی رہ گئی ہے وہ دے دیں اور ولاء کا تعلق ہم سے قائم رہے گا۔ رسول اللہ صلی اللہ علیہ وسلم جب تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم سے اس امر کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم بریرہ کو خرید کر آزاد کرو اور ولاء کا تعلق تو اسی کو حاصل ہو سکتا ہے جو آزاد کرائے۔ پھر رسول اللہ صلی اللہ علیہ وسلم منبر پر تشریف لائے۔ سفیان نے ( اس حدیث کو بیان کرتے ہوئے ) ایک مرتبہ یوں کہا کہ پھر رسول اللہ صلی اللہ علیہ وسلم منبر پر چڑھے اور فرمایا۔ ان لوگوں کا کیا حال ہو گا جو ایسی شرائط کرتے ہیں جن کا تعلق کتاب اللہ سے نہیں ہے۔ جو شخص بھی کوئی ایسی شرط کرے جو کتاب اللہ میں نہ ہو اس کی کوئی حیثیت نہیں ہو گی، اگرچہ وہ سو مرتبہ کر لے۔ اس حدیث کی روایت مالک نے یحییٰ کے واسطہ سے کی، وہ عمرہ سے کہ بریرہ اور انہوں نے منبر پر چڑھنے کا ذکر نہیں کیا الخ۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 457,
			"arabicnumber": 457,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا ہم سے عثمان بن عمر عبدی نے بیان کیا، انہوں نے کہا کہ مجھے یونس بن یزید نے زہری کے واسطہ سے، انہوں نے عبداللہ بن کعب بن مالک سے، انہوں نے اپنے باپ کعب بن مالک سے کہ انھوں نے مسجد نبوی میں عبداللہ ابن ابی حدرد سے اپنے قرض کا تقاضا کیا اور دونوں کی گفتگو بلند آوازوں سے ہونے لگی۔ یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنے حجرے سے سن لیا۔ آپ پردہ ہٹا کر باہر تشریف لائے اور پکارا۔ کعب، کعب ( رضی اللہ عنہ ) بولے، جی یا رسول اللہ! ( حکم ) فرمائیے کیا ارشاد ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنے قرض میں سے اتنا کم کر دو۔ آپ کا اشارہ تھا کہ آدھا کم کر دیں۔ انہوں نے کہا یا رسول اللہ! میں نے ( بخوشی ) ایسا کر دیا۔ پھر آپ نے ابن ابی حدرد سے فرمایا، اچھا اب اٹھو اور اس کا قرض ادا کرو۔ ( جو آدھا معاف کر دیا گیا ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 458,
			"arabicnumber": 458,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا، انہوں نے ثابت سے، انہوں نے ابورافع سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ ایک حبشی مرد یا حبشی عورت مسجد نبوی میں جھاڑو دیا کرتی تھی۔ ایک دن اس کا انتقال ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے اس کے متعلق دریافت فرمایا۔ لوگوں نے بتایا کہ وہ تو انتقال کر گئی۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ تم نے مجھے کیوں نہ بتایا، پھر آپ صلی اللہ علیہ وسلم قبر پر تشریف لائے اور اس پر نماز پڑھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 459,
			"arabicnumber": 459,
			"text": "ہم سے عبدان بن عبداللہ بن عثمان نے ابوحمزہ محمد بن میمون کے واسطہ سے بیان کیا، انہوں نے اعمش سے، انہوں نے مسلم سے، انہوں نے مسروق سے، انہوں نے عائشہ رضی اللہ عنہا سے۔ آپ فرماتی ہیں کہ جب سورۃ البقرہ کی سود سے متعلق آیات نازل ہوئیں تو نبی کریم صلی اللہ علیہ وسلم مسجد میں تشریف لے گئے اور ان آیات کی لوگوں کے سامنے تلاوت فرمائی۔ پھر فرمایا کہ شراب کی تجارت حرام ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 460,
			"arabicnumber": 460,
			"text": "ہم سے احمد بن واقد نے بیان کیا کہ، کہا ہم سے حماد بن زید نے ثابت بنانی کے واسطہ سے، انہوں نے ابورافع سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ ایک عورت یا مرد مسجد میں جھاڑو دیا کرتا تھا۔ ابورافع نے کہا، میرا خیال ہے کہ وہ عورت ہی تھی۔ پھر انہوں نے نبی کریم صلی اللہ علیہ وسلم کی حدیث نقل کی کہ آپ صلی اللہ علیہ وسلم نے اس کی قبر پر نماز پڑھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 461,
			"arabicnumber": 461,
			"text": "ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے روح بن عبادہ اور محمد بن جعفر نے شعبہ کے واسطہ سے بیان کیا، انہوں نے محمد بن زیاد سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے انہوں نے نبی کریم صلی اللہ علیہ وسلم سے آپ صلی اللہ علیہ وسلم نے فرمایا کہ گذشتہ رات ایک سرکش جن اچانک میرے پاس آیا۔ یا اسی طرح کی کوئی بات آپ نے فرمائی، وہ میری نماز میں خلل ڈالنا چاہتا تھا۔ لیکن اللہ تبارک و تعالیٰ نے مجھے اس پر قابو دے دیا اور میں نے سوچا کہ مسجد کے کسی ستون کے ساتھ اسے باندھ دوں تاکہ صبح کو تم سب بھی اسے دیکھو۔ پھر مجھے اپنے بھائی سلیمان کی یہ دعا یاد آ گئی ( جو سورۃ ص میں ہے ) ”اے میرے رب! مجھے ایسا ملک عطا کرنا جو میرے بعد کسی کو حاصل نہ ہو“۔ راوی حدیث روح نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے اس شیطان کو ذلیل کر کے دھتکار دیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 462,
			"arabicnumber": 462,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، انہوں نے کہا مجھ سے سعید بن ابی سعید مقبری نے، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے کچھ سوار نجد کی طرف بھیجے ( جو تعداد میں تیس تھے ) یہ لوگ بنو حنیفہ کے ایک شخص کو جس کا نام ثمامہ بن اثال تھا پکڑ کر لائے۔ انہوں نے اسے مسجد کے ایک ستون میں باندھ دیا۔ پھر رسول اللہ صلی اللہ علیہ وسلم تشریف لائے۔ اور ( تیسرے روز ثمامہ کی نیک طبیعت دیکھ کر ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ ثمامہ کو چھوڑ دو۔ ( رہائی کے بعد ) وہ مسجد نبوی سے قریب ایک کھجور کے باغ تک گئے۔ اور وہاں غسل کیا۔ پھر مسجد میں داخل ہوئے اور کہا «أشهد أن لا إله إلا الله وأن محمدا رسول الله‏» میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ محمد اللہ کے سچے رسول ہیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 463,
			"arabicnumber": 463,
			"text": "ہم سے زکریا بن یحییٰ نے بیان کیا کہ کہا ہم سے عبداللہ بن نمیر نے کہ کہا ہم سے ہشام بن عروہ نے اپنے باپ عروہ بن زبیر کے واسطہ سے بیان کیا، انہوں نے عائشہ رضی اللہ عنہا سے آپ نے فرمایا کہ غزوہ خندق میں سعد ( رضی اللہ عنہ ) کے بازو کی ایک رگ ( اکحل ) میں زخم آیا تھا۔ ان کے لیے نبی کریم صلی اللہ علیہ وسلم نے مسجد میں ایک خیمہ نصب کرا دیا تاکہ آپ قریب رہ کر ان کی دیکھ بھال کیا کریں۔ مسجد ہی میں بنی غفار کے لوگوں کا بھی ایک خیمہ تھا۔ سعد رضی اللہ عنہ کے زخم کا خون ( جو رگ سے بکثرت نکل رہا تھا ) بہہ کر جب ان کے خیمہ تک پہنچا تو وہ ڈر گئے۔ انہوں نے کہا کہ اے خیمہ والو! تمہاری طرف سے یہ کیسا خون ہمارے خیمہ تک آ رہا ہے۔ پھر انہیں معلوم ہوا کہ یہ خون سعد رضی اللہ عنہ کے زخم سے بہہ رہا ہے۔ سعد رضی اللہ عنہ کا اسی زخم کی وجہ سے انتقال ہو گیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 464,
			"arabicnumber": 464,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہمیں امام مالک رحمہ اللہ علیہ نے محمد بن عبدالرحمٰن بن نوفل سے خبر دی، انہوں نے عروہ بن زبیر سے۔ انہوں نے زینب بنت ابی سلمہ سے، انہوں نے ام المؤمنین ام سلمہ سے، وہ کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے ( حجۃ الوداع میں ) اپنی بیماری کا شکوہ کیا ( میں نے کہا کہ میں پیدل طواف نہیں کر سکتی ) تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ لوگوں کے پیچھے رہ اور سوار ہو کر طواف کر۔ پس میں نے طواف کیا اور رسول اللہ صلی اللہ علیہ وسلم اس وقت بیت اللہ کے قریب نماز میں آیت «والطور و کتاب مسطور» کی تلاوت کر رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 465,
			"arabicnumber": 465,
			"text": "ہم سے محمد بن مثنی نے بیان کیا انہوں نے کہا ہم سے معاذ بن ہشام نے بیان کیا، انہوں نے کہا مجھ سے میرے والد نے قتادہ کے واسطہ سے بیان کیا، کہا ہم سے انس رضی اللہ عنہ نے بیان کیا کہ دو شخص نبی کریم صلی اللہ علیہ وسلم کے پاس سے نکلے، ایک عباد بن بشر اور دوسرے صاحب میرے خیال کے مطابق اسید بن حضیر تھے۔ رات تاریک تھی اور دونوں اصحاب کے پاس روشن چراغ کی طرح کوئی چیز تھی جس سے ان کے آگے آگے روشنی پھیل رہی تھی پس جب وہ دونوں اصحاب ایک دوسرے سے جدا ہوئے تو ہر ایک کے ساتھ ایک ایک چراغ رہ گیا جو گھر تک ساتھ رہا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 466,
			"arabicnumber": 466,
			"text": "ہم سے محمد بن سنان نے بیان کیا، کہ کہا ہم سے فلیح بن سلیمان نے، کہا ہم سے ابونضر سالم بن ابی امیہ نے عبید بن حنین کے واسطہ سے، انہوں نے بسر بن سعید سے، انہوں نے ابو سعید خدری رضی اللہ عنہ سے، انہوں نے بیان کیا کہ ایک دفعہ رسول اللہ صلی اللہ علیہ وسلم نے خطبہ میں فرمایا کہ اللہ تعالیٰ نے اپنے ایک بندے کو دنیا اور آخرت کے رہنے میں اختیار دیا ( کہ وہ جس کو چاہے اختیار کرے ) بندے نے وہ پسند کیا جو اللہ کے پاس ہے یعنی آخرت۔ یہ سن کر ابوبکر رضی اللہ عنہ رونے لگے، میں نے اپنے دل میں کہا کہ اگر اللہ نے اپنے کسی بندے کو دنیا اور آخرت میں سے کسی کو اختیار کرنے کو کہا اور اس بندے نے آخرت پسند کر لی تو اس میں ان بزرگ کے رونے کی کیا وجہ ہے۔ لیکن یہ بات تھی کہ بندے سے مراد رسول اللہ صلی اللہ علیہ وسلم ہی تھے اور ابوبکر رضی اللہ عنہ ہم سب سے زیادہ جاننے والے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا۔ ابوبکر آپ روئیے مت۔ اپنی صحبت اور اپنی دولت کے ذریعہ تمام لوگوں سے زیادہ مجھ پر احسان کرنے والے آپ ہی ہیں اور اگر میں کسی کو خلیل بناتا تو ابوبکر کو بناتا۔ لیکن ( جانی دوستی تو اللہ کے سوا کسی سے نہیں ہو سکتی ) اس کے بدلہ میں اسلام کی برادری اور دوستی کافی ہے۔ مسجد میں ابوبکر رضی اللہ عنہ کی طرف کے دروازے کے سوا تمام دروازے بند کر دئیے جائیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 467,
			"arabicnumber": 467,
			"text": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا، انہوں نے کہا ہم سے وہب بن جریر نے بیان کیا، انہوں نے کہا مجھ سے میرے باپ جریر بن حازم نے بیان کیا، انہوں نے کہا میں نے یعلیٰ بن حکیم سے سنا، وہ عکرمہ سے نقل کرتے تھے، وہ عبداللہ بن عباس رضی اللہ عنہما سے، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اپنے مرض وفات میں باہر تشریف لائے۔ سر پہ پٹی بندھی ہوئی تھی۔ آپ صلی اللہ علیہ وسلم منبر پر بیٹھے، اللہ کی حمد و ثنا کی اور فرمایا، کوئی شخص بھی ایسا نہیں جس نے ابوبکر بن ابوقحافہ سے زیادہ مجھ پر اپنی جان و مال کے ذریعہ احسان کیا ہو اور اگر میں کسی کو انسانوں میں سے جانی دوست بناتا تو ابوبکر ( رضی اللہ عنہ ) کو بناتا۔ لیکن اسلام کا تعلق افضل ہے۔ دیکھو ابوبکر ( رضی اللہ عنہ ) کی کھڑکی چھوڑ کر اس مسجد کی تمام کھڑکیاں بند کر دی جائیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 468,
			"arabicnumber": 468,
			"text": "ہم سے ابوالنعمان محمد بن فضل اور قتیبہ بن سعید نے بیان کیا کہ ہم سے حماد بن زید نے ایوب سختیانی کے واسطہ سے، انہوں نے نافع سے، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ نبی کریم صلی اللہ علیہ وسلم جب مکہ تشریف لائے ( اور مکہ فتح ہوا ) تو آپ نے عثمان بن طلحہ رضی اللہ عنہ کو بلوایا۔ ( جو کعبہ کے متولی، چابی بردار تھے ) انہوں نے دروازہ کھولا تو نبی کریم صلی اللہ علیہ وسلم ، بلال، اسامہ بن زید اور عثمان بن طلحہ چاروں اندر تشریف لے گئے۔ پھر دروازہ بند کر دیا گیا اور وہاں تھوڑی دیر تک ٹھہر کر باہر آئے۔ ابن عمر رضی اللہ عنہما نے فرمایا کہ میں نے جلدی سے آگے بڑھ کر بلال سے پوچھا ( کہ نبی کریم صلی اللہ علیہ وسلم نے کعبہ کے اندر کیا کیا ) انہوں نے بتایا کہ نبی کریم صلی اللہ علیہ وسلم نے اندر نماز پڑھی تھی۔ میں نے پوچھا کس جگہ؟ کہا کہ دونوں ستونوں کے درمیان۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ یہ پوچھنا مجھے یاد نہ رہا کہ آپ نے کتنی رکعتیں پڑھی تھیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 469,
			"arabicnumber": 469,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے لیث بن سعد نے سعید بن ابی سعید مقبری کے واسطہ سے بیان کیا انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے کچھ سواروں کو نجد کی طرف بھیجا تھا۔ وہ لوگ بنو حنیفہ کے ایک شخص ثمامہ بن اثال کو ( بطور جنگی قیدی ) پکڑ لائے اور مسجد میں ایک ستون سے باندھ دیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 470,
			"arabicnumber": 470,
			"text": "ہم سے علی بن عبداللہ بن جعفر نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا، انہوں نے کہا کہ ہم سے جعید بن عبدالرحمٰن نے بیان کیا، انہوں نے کہا مجھ سے یزید بن خصیفہ نے بیان کیا، انہوں نے سائب بن یزید سے بیان کیا، انہوں نے بیان کیا کہ میں مسجد نبوی میں کھڑا ہوا تھا، کسی نے میری طرف کنکری پھینکی۔ میں نے جو نظر اٹھائی تو دیکھا کہ عمر بن خطاب رضی اللہ عنہ سامنے ہیں۔ آپ نے فرمایا کہ یہ سامنے جو دو شخص ہیں انہیں میرے پاس بلا کر لاؤ۔ میں بلا لایا۔ آپ نے پوچھا کہ تمہارا تعلق کس قبیلہ سے ہے یا یہ فرمایا کہ تم کہاں رہتے ہو؟ انہوں نے بتایا کہ ہم طائف کے رہنے والے ہیں۔ آپ نے فرمایا کہ اگر تم مدینہ کے ہوتے تو میں تمہیں سزا دئیے بغیر نہ چھوڑتا۔ رسول اللہ صلی اللہ علیہ وسلم کی مسجد میں آواز اونچی کرتے ہو؟",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 471,
			"arabicnumber": 471,
			"text": "ہم سے احمد بن صالح نے بیان کیا، انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا مجھے یونس بن یزید نے خبر دی، انہوں نے ابن شہاب زہری کے واسطہ سے بیان کیا، انہوں نے کہا کہ مجھ سے عبداللہ بن کعب بن مالک نے بیان کیا، ان کو ان کے باپ کعب بن مالک رضی اللہ عنہ نے خبر دی کہ انھوں نے عبداللہ ابن ابی حدرد رضی اللہ عنہ سے اپنے ایک قرض کے سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کے دور میں مسجد نبوی کے اندر تقاضا کیا۔ دونوں کی آواز کچھ اونچی ہو گئی یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنے حجرہ سے سن لیا۔ آپ اٹھے اور حجرہ پر پڑے ہوئے پردہ کو ہٹایا۔ آپ نے کعب بن مالک کو آواز دی، اے کعب! کعب بولے۔ یا رسول اللہ! حاضر ہوں۔ آپ نے اپنے ہاتھ کے اشارے سے بتایا کہ وہ اپنا آدھا قرض معاف کر دے۔ کعب نے عرض کی یا رسول اللہ! میں نے معاف کر دیا۔ آپ نے ابن ابی حدرد سے فرمایا اچھا اب چل اٹھ اس کا قرض ادا کر۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 472,
			"arabicnumber": 472,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا کہ کہا ہم سے بشر بن مفضل نے عبیداللہ بن عمر سے، انہوں نے نافع سے، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا ( جبکہ ) اس وقت آپ صلی اللہ علیہ وسلم منبر پر تھے کہ رات کی نماز ( یعنی تہجد ) کس طرح پڑھنے کے لیے آپ فرماتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ دو دو رکعت کر کے پڑھ اور جب صبح قریب ہونے لگے تو ایک رکعت پڑھ لے۔ یہ ایک رکعت اس ساری نماز کو طاق بنا دے گی اور آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے کہ رات کی آخری نماز کو طاق رکھا کرو کیونکہ نبی کریم صلی اللہ علیہ وسلم نے اس کا حکم دیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 473,
			"arabicnumber": 473,
			"text": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا کہ کہا ہم سے حماد بن زید نے، انہوں نے ایوب سختیانی سے، انہوں نے ابن عمر رضی اللہ عنہما سے کہ ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ آپ صلی اللہ علیہ وسلم اس وقت خطبہ دے رہے تھے آنے والے نے پوچھا کہ رات کی نماز کس طرح پڑھی جائے؟ آپ صلی اللہ علیہ وسلم نے فرمایا دو دو رکعت پھر جب طلوع صبح صادق کا اندیشہ ہو تو ایک رکعت وتر کی پڑھ لے تاکہ تو نے جو نماز پڑھی ہے اسے یہ رکعت طاق بنا دے اور امام بخاری رحمہ اللہ نے فرمایا کہ ولید بن کثیر نے کہا کہ مجھ سے عبیداللہ بن عبداللہ عمری نے بیان کیا، عبداللہ بن عمر رضی اللہ عنہما نے ان سے بیان کیا کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کو آواز دی جب کہ آپ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 474,
			"arabicnumber": 474,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا کہ کہا ہمیں امام مالک نے خبر دی اسحاق بن عبداللہ ابن ابی طلحہ کے واسطے سے کہ عقیل بن ابی طالب کے غلام ابومرہ نے انہیں خبر دی ابوواقد لیثی حارث بن عوف صحابی کے واسطہ سے، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے کہ تین آدمی باہر سے آئے۔ دو تو رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں حاضری کی غرض سے آگے بڑھے لیکن تیسرا چلا گیا۔ ان دو میں سے ایک نے درمیان میں خالی جگہ دیکھی اور وہاں بیٹھ گیا۔ دوسرا شخص پیچھے بیٹھ گیا اور تیسرا تو واپس ہی جا رہا تھا۔ جب رسول اللہ صلی اللہ علیہ وسلم وعظ سے فارغ ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کیا میں تمہیں ان تینوں کے متعلق ایک بات نہ بتاؤں۔ ایک شخص تو اللہ کی طرف بڑھا اور اللہ نے اسے جگہ دی ( یعنی پہلا شخص ) رہا دوسرا تو اس نے ( لوگوں میں گھسنے سے ) شرم کی، اللہ نے بھی اس سے شرم کی، تیسرے نے منہ پھیر لیا۔ اس لیے اللہ نے بھی اس کی طرف سے منہ پھیر لیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 475,
			"arabicnumber": 475,
			"text": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک کے واسطہ سے، انہوں نے ابن شہاب زہری سے، انہوں نے عباد بن تمیم سے، انہوں نے اپنے چچا (عبداللہ بن زید بن عاصم مازنی رضی اللہ عنہ) سے کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو چت لیٹے ہوئے دیکھا۔ آپ صلی اللہ علیہ وسلم اپنا ایک پاؤں دوسرے پر رکھے ہوئے تھے۔ ابن شہاب زہری سے مروی ہے، وہ سعید بن مسیب سے روایت کرتے ہیں کہ عمر اور عثمان رضی اللہ عنہما بھی اسی طرح لیٹتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 476,
			"arabicnumber": 476,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے عقیل کے واسطہ سے بیان کیا، انہوں نے ابن شہاب زہری سے، انہوں نے کہا مجھے عروہ بن زبیر نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام المؤمنین عائشہ رضی اللہ عنہا نے بتلایا کہ میں نے جب سے ہوش سنبھالا تو اپنے ماں باپ کو مسلمان ہی پایا اور ہم پر کوئی دن ایسا نہیں گزرا جس میں رسول اللہ صلی اللہ علیہ وسلم صبح و شام دن کے دونوں وقت ہمارے گھر تشریف نہ لائے ہوں۔ پھر ابوبکر رضی اللہ عنہ کی سمجھ میں ایک ترکیب آئی تو انہوں نے گھر کے سامنے ایک مسجد بنا لی، وہ اس میں نماز پڑھتے اور قرآن مجید کی تلاوت کرتے۔ مشرکین کی عورتیں اور ان کے بچے وہاں تعجب سے سنتے اور کھڑے ہو جاتے اور آپ کی طرف دیکھتے رہتے۔ ابوبکر رضی اللہ عنہ بڑے رونے والے آدمی تھے۔ جب قرآن کریم پڑھتے تو آنسوؤں پر قابو نہ رہتا، قریش کے مشرک سردار اس صورت حال سے گھبرا گئے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 477,
			"arabicnumber": 477,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے ابومعاویہ نے اعمش کے واسطہ سے، انہوں نے ابوصالح ذکوان سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا، جماعت کے ساتھ نماز پڑھنے میں گھر کے اندر یا بازار ( دوکان وغیرہ ) میں نماز پڑھنے سے پچیس گنا ثواب زیادہ ملتا ہے۔ کیونکہ جب کوئی شخص تم میں سے وضو کرے اور اس کے آداب کا لحاظ رکھے پھر مسجد میں صرف نماز کی غرض سے آئے تو اس کے ہر قدم پر اللہ تعالیٰ ایک درجہ اس کا بلند کرتا ہے اور ایک گناہ اس سے معاف کرتا ہے۔ اس طرح وہ مسجد کے اندر آئے گا۔ مسجد میں آنے کے بعد جب تک نماز کے انتظار میں رہے گا۔ اسے نماز ہی کی حالت میں شمار کیا جائے گا اور جب تک اس جگہ بیٹھا رہے جہاں اس نے نماز پڑھی ہے تو فرشتے اس کے لیے رحمت خداوندی کی دعائیں کرتے ہیں «اللهم اغفر له،‏‏‏‏ ‏‏‏‏اللهم ارحمه» اے اللہ! اس کو بخش دے، اے اللہ! اس پر رحم کر۔ جب تک کہ ریح خارج کر کے ( وہ فرشتوں کو ) تکلیف نہ دے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 479,
			"arabicnumber": 479,
			"text": "",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"text": "اور عاصم بن علی نے کہا، ہم سے عاصم بن محمد نے بیان کیا کہ میں نے اس حدیث کو اپنے باپ محمد بن زید سے سنا۔ لیکن مجھے حدیث یاد نہیں رہی تھی۔ تو میرے بھائی واقد نے اس کو درستی سے اپنے باپ سے روایت کر کے مجھے بتایا۔ وہ کہتے ہیں کہ عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ عبداللہ بن عمرو تمہارا کیا حال ہو گا جب تم برے لوگوں میں رہ جاؤ گے اس طرح ( یعنی آپ صلی اللہ علیہ وسلم نے ایک ہاتھ کی انگلیاں دوسرے ہاتھ میں کر کے دکھلائیں ) ۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 481,
			"arabicnumber": 481,
			"text": "ہم سے خلاد بن یحییٰ نے بیان کیا، کہا ہم سے سفیان ثوری نے ابی بردہ بن عبداللہ بن ابی بردہ سے، انہوں نے اپنے دادا (ابوبردہ) سے، انہوں نے ابوموسیٰ اشعری رضی اللہ عنہ سے۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ایک مومن دوسرے مومن کے لیے عمارت کی طرح ہے کہ اس کا ایک حصہ دوسرے حصہ کو قوت پہنچاتا ہے۔ اور آپ صلی اللہ علیہ وسلم نے ایک ہاتھ کی انگلیوں کو دوسرے ہاتھ کی انگلیوں میں داخل کیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 482,
			"arabicnumber": 482,
			"text": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے نضر بن شمیل نے، انہوں نے کہا کہ ہمیں عبداللہ ابن عون نے خبر دی، انہوں نے محمد بن سیرین سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں دوپہر کے بعد کی دو نمازوں میں سے کوئی نماز پڑھائی۔ ( ظہر یا عصر کی ) ابن سیرین نے کہا کہ ابوہریرہ رضی اللہ عنہ نے اس کا نام تو لیا تھا۔ لیکن میں بھول گیا۔ ابوہریرہ رضی اللہ عنہ نے بتلایا کہ آپ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھا کر سلام پھیر دیا۔ اس کے بعد ایک لکڑی کی لاٹھی سے جو مسجد میں رکھی ہوئی تھی آپ صلی اللہ علیہ وسلم ٹیک لگا کر کھڑے ہو گئے۔ ایسا معلوم ہوتا تھا کہ جیسے آپ بہت ہی خفا ہوں اور آپ صلی اللہ علیہ وسلم نے اپنے دائیں ہاتھ کو بائیں ہاتھ پر رکھا اور ان کی انگلیوں کو ایک دوسرے میں داخل کیا اور آپ نے اپنے دائیں رخسار مبارک کو بائیں ہاتھ کی ہتھیلی سے سہارا دیا۔ جو لوگ نماز پڑھ کر جلدی نکل جایا کرتے تھے وہ مسجد کے دروازوں سے پار ہو گئے۔ پھر لوگ کہنے لگے کہ کیا نماز کم کر دی گئی ہے۔ حاضرین میں ابوبکر اور عمر ( رضی اللہ عنہما ) بھی موجود تھے۔ لیکن انہیں بھی آپ سے بولنے کی ہمت نہ ہوئی۔ انہیں میں ایک شخص تھے جن کے ہاتھ لمبے تھے اور انہیں ذوالیدین کہا جاتا تھا۔ انہوں نے پوچھا یا رسول اللہ! کیا آپ صلی اللہ علیہ وسلم بھول گئے یا نماز کم کر دی گئی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہ میں بھولا ہوں اور نہ نماز میں کوئی کمی ہوئی ہے۔ پھر آپ صلی اللہ علیہ وسلم نے لوگوں سے پوچھا۔ کیا ذوالیدین صحیح کہہ رہے ہیں۔ حاضرین بولے کہ جی ہاں! یہ سن کر آپ صلی اللہ علیہ وسلم آگے بڑھے اور باقی رکعتیں پڑھیں۔ پھر سلام پھیرا پھر تکبیر کہی اور سہو کا سجدہ کیا۔ معمول کے مطابق یا اس سے بھی لمبا سجدہ۔ پھر سر اٹھایا اور تکبیر کہی۔ پھر تکبیر کہی اور دوسرا سجدہ کیا۔ معمول کے مطابق یا اس سے بھی طویل پھر سر اٹھایا اور تکبیر کہی، لوگوں نے باربار ابن سیرین سے پوچھا کہ کیا پھر سلام پھیرا تو وہ جواب دیتے کہ مجھے خبر دی گئی ہے کہ عمران بن حصین کہتے تھے کہ پھر سلام پھیرا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 483,
			"arabicnumber": 483,
			"text": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا کہا ہم سے فضیل بن سلیمان نے، کہا ہم سے موسیٰ بن عقبہ نے، کہا میں نے سالم بن عبداللہ بن عمر رضی اللہ عنہما کو دیکھا کہ وہ ( مدینہ سے مکہ تک ) راستے میں کئی جگہوں کو ڈھونڈھ کر وہاں نماز پڑھتے اور کہتے کہ ان کے باپ عبداللہ بن عمر رضی اللہ عنہما بھی ان مقامات پر نماز پڑھا کرتے تھے۔ اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو ان مقامات پر نماز پڑھتے ہوئے دیکھا ہے اور موسیٰ بن عقبہ نے کہا کہ مجھ سے نافع نے ابن عمر رضی اللہ عنہما کے متعلق بیان کیا کہ وہ ان مقامات پر نماز پڑھا کرتے تھے۔ اور میں نے سالم سے پوچھا تو مجھے خوب یاد ہے کہ انہوں نے بھی نافع کے بیان کے مطابق ہی تمام مقامات کا ذکر کیا۔ فقط مقام شرف روحاء کی مسجد کے متعلق دونوں نے اختلاف کیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 484,
			"arabicnumber": 484,
			"text": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا، کہا ہم سے انس بن عیاض نے، کہا ہم سے موسیٰ بن عقبہ نے نافع سے، ان کو عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم جب عمرہ کے قصد سے تشریف لے گئے اور حجۃ الوداع کے موقعہ پر جب حج کے لیے نکلے تو آپ صلی اللہ علیہ وسلم نے ذوالحلیفہ میں قیام فرمایا۔ ذوالحلیفہ کی مسجد کے قریب آپ صلی اللہ علیہ وسلم ایک ببول کے درخت کے نیچے اترے اور جب آپ کسی جہاد سے واپس ہوتے اور راستہ ذوالحلیفہ سے ہو کر گزرتا یا حج یا عمرہ سے واپسی ہوتی تو آپ وادی عتیق کے نشیبی علاقہ میں اترتے، پھر جب وادی کے نشیب سے اوپر چڑھتے تو وادی کے بالائی کنارے کے اس مشرقی حصہ پر پڑاؤ ہوتا جہاں کنکریوں اور ریت کا کشادہ نالا ہے۔ ( یعنی بطحاء میں ) یہاں آپ صلی اللہ علیہ وسلم رات کو صبح تک آرام فرماتے۔ یہ مقام اس مسجد کے قریب نہیں ہے جو پتھروں کی بنی ہے، آپ اس ٹیلے پر بھی نہیں ہوتے جس پر مسجد بنی ہوئی ہے۔ وہاں ایک گہرا نالہ تھا عبداللہ بن عمر رضی اللہ عنہما وہیں نماز پڑھتے۔ اس کے نشیب میں ریت کے ٹیلے تھے اور رسول اللہ صلی اللہ علیہ وسلم وہاں نماز پڑھا کرتے تھے۔ کنکریوں اور ریت کے کشادہ نالہ کی طرف سے سیلاب نے آ کر اس جگہ کے آثار و نشانات کو پاٹ دیا ہے، جہاں عبداللہ بن عمر رضی اللہ عنہما نماز پڑھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 485,
			"arabicnumber": 485,
			"text": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے یہ بھی بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے اس جگہ نماز پڑھی جہاں اب شرف روحاء کی مسجد کے قریب ایک چھوٹی مسجد ہے، عبداللہ بن عمر رضی اللہ عنہما اس جگہ کی نشاندہی کرتے تھے جہاں نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھی تھی۔ کہتے تھے کہ یہاں تمہارے دائیں طرف جب تم مسجد میں ( قبلہ رو ہو کر ) نماز پڑھنے کے لیے کھڑے ہوتے ہو۔ جب تم ( مدینہ سے ) مکہ جاؤ تو یہ چھوٹی سی مسجد راستے کے دائیں جانب پڑتی ہے۔ اس کے اور بڑی مسجد کے درمیان ایک پتھر کی مار کا فاصلہ ہے یا اس سے کچھ کم زیادہ۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 486,
			"arabicnumber": 486,
			"text": "اور عبداللہ بن عمر رضی اللہ عنہما اس چھوٹی پہاڑی کی طرف نماز پڑھتے جو روحاء کے آخر کنارے پر ہے اور یہ پہاڑی وہاں ختم ہوتی ہے جہاں راستے کا کنارہ ہے۔ اس مسجد کے قریب جو اس کے اور روحاء کے آخری حصے کے بیچ میں ہے مکہ کو جاتے ہوئے۔ اب وہاں ایک مسجد بن گئی ہے۔ عبداللہ بن عمر رضی اللہ عنہما اس مسجد میں نماز نہیں پڑھتے تھے بلکہ اس کو اپنے بائیں طرف مقابل میں چھوڑ دیتے اور آگے بڑھ کر خود پہاڑی عرق الطبیہ کی طرف نماز پڑھتے تھے۔ عبداللہ بن عمر رضی اللہ عنہما جب روحاء سے چلتے تو ظہر اس وقت تک نہ پڑھتے جب تک اس مقام پر نہ پہنچ جاتے۔ جب یہاں آ جاتے تو ظہر پڑھتے، اور اگر مکہ سے آتے ہوئے صبح صادق سے تھوڑی دیر پہلے یا سحر کے آخر میں وہاں سے گزرتے تو صبح کی نماز تک وہیں آرام کرتے اور فجر کی نماز پڑھتے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 487,
			"arabicnumber": 487,
			"text": "اور عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم راستے کے دائیں طرف مقابل میں ایک گھنے درخت کے نیچے وسیع اور نرم علاقہ میں قیام فرماتے جو قریہ رویثہ کے قریب ہے۔ پھر آپ اس ٹیلہ سے جو رویثہ کے راستے سے تقریباً دو میل کے فاصلے پر ہے چلتے تھے۔ اب اس درخت کا اوپر کا حصہ ٹوٹ گیا ہے۔ اور درمیان میں سے دوہرا ہو کر جڑ پر کھڑا ہے۔ اس کی جڑ میں ریت کے بہت سے ٹیلے ہیں۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 488,
			"arabicnumber": 488,
			"text": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے یہ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے قریہ عرج کے قریب اس نالے کے کنارے نماز پڑھی جو پہاڑ کی طرف جاتے ہوئے پڑتا ہے۔ اس مسجد کے پاس دو یا تین قبریں ہیں، ان قبروں پر اوپر تلے پتھر رکھے ہوئے ہیں، راستے کے دائیں جانب ان بڑے پتھروں کے پاس جو راستے میں ہیں۔ ان کے درمیان میں ہو کر نماز پڑھی، عبداللہ بن عمر رضی اللہ عنہما قریہ عرج سے سورج ڈھلنے کے بعد چلتے اور ظہر اسی مسجد میں آ کر پڑھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": 489,
			"text": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے راستے کے بائیں طرف ان گھنے درختوں کے پاس قیام فرمایا جو ہرشی پہاڑ کے نزدیک نشیب میں ہیں۔ یہ ڈھلوان جگہ ہرشی کے ایک کنارے سے ملی ہوئی ہے۔ یہاں سے عام راستہ تک پہنچنے کے لیے تیر کی مار کا فاصلہ ہے۔ عبداللہ بن عمر رضی اللہ عنہما اس بڑے درخت کی طرف نماز پڑھتے تھے جو ان تمام درختوں میں راستے سے سب سے زیادہ نزدیک ہے اور سب سے لمبا درخت بھی یہی ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": 490,
			"text": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم اس نالے میں اترا کرتے تھے جو وادی مرالظہران کے نشیب میں ہے۔ مدینہ کے مقابل جب کہ مقام صفراوات سے اترا جائے۔ نبی کریم صلی اللہ علیہ وسلم اس ڈھلوان کے بالکل نشیب میں قیام کرتے تھے۔ یہ راستے کے بائیں جانب پڑتا ہے جب کوئی شخص مکہ جا رہا ہو ( جس کو اب بطن مرو کہتے ہیں ) راستے اور رسول اللہ صلی اللہ علیہ وسلم کی منزل کے درمیان صرف ایک پتھر ہی کے مار کا فاصلہ ہوتا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": 491,
			"text": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم مقام ذی طویٰ میں قیام فرماتے اور رات یہیں گزارا کرتے تھے اور صبح ہوتی تو نماز فجر یہیں پڑھتے۔ مکہ جاتے ہوئے۔ یہاں نبی کریم صلی اللہ علیہ وسلم کے نماز پڑھنے کی جگہ ایک بڑے سے ٹیلے پر تھی۔ اس مسجد میں نہیں جواب وہاں بنی ہوئی ہے بلکہ اس سے نیچے ایک بڑا ٹیلا تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": 492,
			"text": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے اس پہاڑ کے دونوں کونوں کا رخ کیا جو اس کے اور جبل طویل کے درمیان کعبہ کی سمت ہیں۔ آپ صلی اللہ علیہ وسلم اس مسجد کو جو اب وہاں تعمیر ہوئی ہے اپنی بائیں طرف کر لیتے ٹیلے کے کنارے۔ اور نبی کریم صلی اللہ علیہ وسلم کے نماز پڑھنے کی جگہ اس سے نیچے سیاہ ٹیلے پر تھی ٹیلے سے تقریباً دس ہاتھ چھوڑ کر پہاڑ کی دونوں گھاٹیوں کی طرف رخ کر کے نماز پڑھتے جو تمہارے اور کعبہ کے درمیان ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": 493,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہم سے امام مالک نے ابن شہاب کے واسطے سے بیان کیا، انہوں نے عبیداللہ بن عبداللہ بن عتبہ سے کہ عبداللہ بن عباس رضی اللہ عنہما نے فرمایا کہ میں ایک گدھی پر سوار ہو کر آیا۔ اس زمانہ میں بالغ ہونے والا تھا۔ رسول اللہ صلی اللہ علیہ وسلم منیٰ میں لوگوں کو نماز پڑھا رہے تھے۔ لیکن دیوار آپ صلی اللہ علیہ وسلم کے سامنے نہ تھی۔ میں صف کے بعض حصے سے گزر کر سواری سے اترا اور میں نے گدھی کو چرنے کے لیے چھوڑ دیا اور صف میں داخل ہو گیا۔ پس کسی نے مجھ پر اعتراض نہیں کیا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": 494,
			"text": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے عبداللہ بن نمیر نے کہا کہ ہم سے عبیداللہ بن عمر نے نافع کے واسطہ سے بیان کیا۔ انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ رسول اللہ صلی اللہ علیہ وسلم جب عید کے دن ( مدینہ سے ) باہر تشریف لے جاتے تو چھوٹے نیزہ ( برچھا ) کو گاڑنے کا حکم دیتے وہ جب آپ صلی اللہ علیہ وسلم کے آگے گاڑ دیا جاتا تو آپ صلی اللہ علیہ وسلم اس کی طرف رخ کر کے نماز پڑھتے اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہوتے۔ یہی آپ صلی اللہ علیہ وسلم سفر میں بھی کیا کرتے تھے۔ ( مسلمانوں کے ) خلفاء نے اسی وجہ سے برچھا ساتھ رکھنے کی عادت بنا لی ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": 495,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا عون بن ابی حجیفہ سے، کہا میں نے اپنے باپ (وہب بن عبداللہ) سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے لوگوں کو بطحاء میں نماز پڑھائی۔ آپ صلی اللہ علیہ وسلم کے سامنے عنزہ ( ڈنڈا جس کے نیچے پھل لگا ہوا ہو ) گاڑ دیا گیا تھا۔ ( چونکہ آپ صلی اللہ علیہ وسلم مسافر تھے اس لیے ) ظہر کی دو رکعت اور عصر کی دو رکعت ادا کیں۔ آپ صلی اللہ علیہ وسلم کے سامنے سے عورتیں اور گدھے گزر رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": 496,
			"text": "ہم سے عمرو بن زرارہ نے بیان کیا، کہا کہ ہم سے عبدالعزیز بن ابی حازم نے اپنے باپ ابوحازم سلمہ بن دینار سے بیان کیا، انہوں نے سہل بن سعد سے، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے سجدہ کرنے کی جگہ اور دیوار کے درمیان ایک بکری کے گزر سکنے کا فاصلہ رہتا تھا۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": 497,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، کہا کہ ہم سے یزید بن ابی عبید نے، انہوں نے سلمہ بن اکوع رضی اللہ عنہ سے بیان کیا، انہوں نے فرمایا کہ مسجد کی دیوار اور منبر کے درمیان بکری کے گزر سکنے کے فاصلے کے برابر جگہ تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": 498,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے عبیداللہ کے واسطے سے بیان کیا، کہا مجھے نافع نے عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم کے لیے برچھا گاڑ دیا جاتا آپ صلی اللہ علیہ وسلم اس کی طرف نماز پڑھتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا کہ ہم سے عون بن ابی حجیفہ نے بیان کیا، کہا کہ میں نے اپنے باپ ابوحجیفہ وہب بن عبداللہ سے سنا انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم دوپہر کے وقت باہر تشریف لائے۔ آپ صلی اللہ علیہ وسلم کی خدمت میں وضو کا پانی پیش کیا گیا، جس سے آپ صلی اللہ علیہ وسلم نے وضو کیا۔ پھر ہمیں آپ صلی اللہ علیہ وسلم نے ظہر کی نماز پڑھائی اور عصر کی، آپ صلی اللہ علیہ وسلم کے سامنے عنزہ گاڑ دیا گیا تھا اور عورتیں اور گدھے پر سوار لوگ اس کے پیچھے سے گزر رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": 500,
			"text": "ہم سے محمد بن حاتم بن بزیع نے بیان کیا، کہا کہ ہم سے شاذان بن عامر نے شعبہ بن حجاج کے واسطہ سے بیان کیا، انہوں نے عطاء بن ابی میمونہ سے، انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم جب رفع حاجت کے لیے نکلتے تو میں اور ایک اور لڑکا آپ صلی اللہ علیہ وسلم کے پیچھے پیچھے جاتے۔ ہمارے ساتھ عکازہ ( ڈنڈا جس کے نیچے لوہے کا پھل لگا ہوا ہو ) یا چھڑی یا عنزہ ہوتا۔ اور ہمارے ساتھ ایک چھاگل بھی ہوتا تھا۔ جب نبی کریم صلی اللہ علیہ وسلم حاجت سے فارغ ہو جاتے تو ہم آپ صلی اللہ علیہ وسلم کو وہ چھاگل دے دیتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": 501,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے حکم بن عیینہ سے، انہوں نے ابوحجیفہ سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم ہمارے پاس دوپہر کے وقت تشریف لائے اور آپ صلی اللہ علیہ وسلم نے بطحاء میں ظہر اور عصر کی دو دو رکعتیں پڑھیں۔ آپ صلی اللہ علیہ وسلم کے سامنے عنزہ گاڑ دیا گیا تھا اور جب آپ صلی اللہ علیہ وسلم نے وضو کیا تو لوگ آپ صلی اللہ علیہ وسلم کے وضو کے پانی کو اپنے بدن پر لگا رہے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": 502,
			"text": "ہم سے مکی بن ابراہیم نے بیان کیا، کہا ہم سے یزید بن ابی عبید نے بیان کیا، کہا کہ میں سلمہ بن اکوع رضی اللہ عنہ کے ساتھ ( مسجد نبوی میں ) حاضر ہوا کرتا تھا۔ سلمہ رضی اللہ عنہ ہمیشہ اس ستون کو سامنے کر کے نماز پڑھتے جہاں قرآن شریف رکھا رہتا تھا۔ میں نے ان سے کہا کہ اے ابومسلم! میں دیکھتا ہوں کہ آپ ہمیشہ اسی ستون کو سامنے کر کے نماز پڑھتے ہیں۔ انہوں نے فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا آپ صلی اللہ علیہ وسلم خاص طور سے اسی ستون کو سامنے کر کے نماز پڑھا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": 503,
			"text": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا ہم سے سفیان ثوری نے عمرو بن عامر سے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے، انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے بڑے بڑے صحابہ رضوان اللہ علیہم اجمعین کو دیکھا کہ وہ مغرب ( کی اذان ) کے وقت ستونوں کی طرف لپکتے۔ اور شعبہ نے عمرو بن عامر سے انہوں نے انس رضی اللہ عنہ سے ( اس حدیث میں ) یہ زیادتی کی ہے۔ ”یہاں تک کہ نبی کریم صلی اللہ علیہ وسلم حجرے سے باہر تشریف لاتے۔“",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": 504,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے جویریہ بن اسماء نے نافع سے، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم بیت اللہ کے اندر تشریف لے گئے اور اسامہ بن زید عثمان بن طلحہ اور بلال رضی اللہ عنہم بھی آپ کے ساتھ تھے۔ آپ صلی اللہ علیہ وسلم دیر تک اندر رہے۔ پھر باہر آئے۔ اور میں سب لوگوں سے پہلے آپ صلی اللہ علیہ وسلم کے پیچھے ہی وہاں آیا۔ میں نے بلال رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے کہاں نماز پڑھی تھی۔ انہوں نے بتایا کہ آگے کے دو ستونوں کے بیچ میں آپ صلی اللہ علیہ وسلم نے نماز پڑھی تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہمیں امام مالک بن انس نے خبر دی نافع سے، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ نبی کریم صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے اور اسامہ بن زید، بلال اور عثمان بن طلحہ حجبی بھی آپ صلی اللہ علیہ وسلم کے ساتھ تھے۔ پھر عثمان رضی اللہ عنہ نے کعبہ کا دروازہ بند کر دیا۔ اور آپ صلی اللہ علیہ وسلم اس میں ٹھہرے رہے۔ جب آپ صلی اللہ علیہ وسلم باہر نکلے تو میں نے بلال رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے اندر کیا کیا؟ انہوں نے کہا کہ آپ نے ایک ستون کو تو بائیں طرف چھوڑا اور ایک کو دائیں طرف اور تین کو پیچھے اور اس زمانہ میں خانہ کعبہ میں چھ ستون تھے۔ پھر آپ صلی اللہ علیہ وسلم نے نماز پڑھی۔ امام بخاری رحمہ اللہ نے کہا کہ ہم سے اسماعیل بن ابی ادریس نے کہا، وہ کہتے ہیں کہ مجھ سے امام مالک نے یہ حدیث یوں بیان کی کہ آپ صلی اللہ علیہ وسلم نے اپنے دائیں طرف دو ستون چھوڑے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "ہم سے ابراہیم بن المنذر نے بیان کیا، کہا کہ ہم سے ابوضمرہ انس بن عیاض نے بیان کیا، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا انہوں نے نافع سے کہ عبداللہ بن عمر رضی اللہ عنہما جب کعبہ میں داخل ہوتے تو سیدھے منہ کے سامنے چلے جاتے۔ دروازہ پیٹھ کی طرف ہوتا اور آپ آگے بڑھتے جب ان کے اور سامنے کی دیوار کا فاصلہ قریب تین ہاتھ کے رہ جاتا تو نماز پڑھتے۔ اس طرح آپ اس جگہ نماز پڑھنا چاہتے تھے جس کے متعلق بلال رضی اللہ عنہ نے آپ کو بتایا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے یہیں نماز پڑھی تھی۔ آپ فرماتے تھے کہ بیت اللہ میں جس کونے میں ہم چاہیں نماز پڑھ سکتے ہیں۔ اس میں کوئی قباحت نہیں ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "ہم سے محمد بن ابی بکر مقدمی بصریٰ نے بیان کیا، کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا عبیداللہ بن عمر سے، وہ نافع سے، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم اپنی سواری کو سامنے عرض میں کر لیتے اور اس کی طرف منہ کر کے نماز پڑھتے تھے، عبیداللہ بن عمر نے نافع سے پوچھا کہ جب سواری اچھلنے کودنے لگتی تو اس وقت آپ کیا کیا کرتے تھے؟ نافع نے کہا کہ آپ اس وقت کجاوے کو اپنے سامنے کر لیتے اور اس کے آخری حصے کی ( جس پر سوار ٹیک لگاتا ہے ایک کھڑی سی لکڑی کی ) طرف منہ کر کے نماز پڑھتے اور عبداللہ بن عمر رضی اللہ عنہما بھی اسی طرح کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": 508,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر بن عبدالحمید نے بیان کیا منصور بن معتمر سے، انہوں نے ابراہیم نخعی سے، انہوں نے اسود بن یزید سے، انہوں نے عائشہ رضی اللہ عنہا سے آپ نے فرمایا تم لوگوں نے ہم عورتوں کو کتوں اور گدھوں کے برابر بنا دیا۔ حالانکہ میں چارپائی پر لیٹی رہتی تھی۔ اور نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور چارپائی کے بیچ میں آ جاتے ( یا چارپائی کو اپنے اور قبلے کے بیچ میں کر لیتے ) پھر نماز پڑھتے۔ مجھے آپ صلی اللہ علیہ وسلم کے سامنے پڑا رہنا برا معلوم ہوتا، اس لیے میں پائینتی کی طرف سے کھسک کے لحاف سے باہر نکل جاتی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": 509,
			"text": "ہم سے ابومعمر نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، کہا کہ ہم سے یونس بن عبید نے حمید بن ہلال کے واسطے سے بیان کیا، انہوں نے ابوصالح ذکوان سمان سے کہ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( دوسری سند ) اور ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے سلیمان بن مغیرہ نے، کہا ہم سے حمید بن ہلال عدوی نے، کہا ہم سے ابوصالح سمان نے، کہا میں نے ابو سعید خدری رضی اللہ عنہ کو جمعہ کے دن نماز پڑھتے ہوئے دیکھا۔ آپ کسی چیز کی طرف منہ کئے ہوئے لوگوں کے لیے اسے آڑ بنائے ہوئے تھے۔ ابومعیط کے بیٹوں میں سے ایک جوان نے چاہا کہ آپ کے سامنے سے ہو کر گزر جائے۔ ابوسعید رضی اللہ عنہ نے اس کے سینہ پر دھکا دے کر باز رکھنا چاہا۔ جوان نے چاروں طرف نظر دوڑائی لیکن کوئی راستہ سوائے سامنے سے گزرنے کے نہ ملا۔ اس لیے وہ پھر اسی طرف سے نکلنے کے لیے لوٹا۔ اب ابوسعید رضی اللہ عنہ نے پہلے سے بھی زیادہ زور سے دھکا دیا۔ اسے ابوسعید رضی اللہ عنہ سے شکایت ہوئی اور وہ اپنی یہ شکایت مروان کے پاس لے گیا۔ اس کے بعد ابوسعید رضی اللہ عنہ بھی تشریف لے گئے۔ مروان نے کہا اے ابوسعید رضی اللہ عنہ آپ میں اور آپ کے بھتیجے میں کیا معاملہ پیش آیا۔ آپ نے فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جب کوئی شخص نماز کسی چیز کی طرف منہ کر کے پڑھے اور اس چیز کو آڑ بنا رہا ہو پھر بھی اگر کوئی سامنے سے گزرے تو اسے روک دینا چاہیے۔ اگر اب بھی اسے اصرار ہو تو اسے لڑنا چاہیے۔ کیونکہ وہ شیطان ہے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": 510,
			"text": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، انہوں نے کہا ہم سے امام مالک نے عمر بن عبیداللہ کے غلام ابونضر سالم بن ابی امیہ سے خبر دی۔ انہوں نے بسر بن سعید سے کہ زید بن خالد نے انہیں ابوجہیم عبداللہ انصاری رضی اللہ عنہ کی خدمت میں ان سے یہ بات پوچھنے کے لیے بھیجا کہ انہوں نے نماز پڑھنے والے کے سامنے سے گزرنے والے کے متعلق نبی کریم صلی اللہ علیہ وسلم سے کیا سنا ہے۔ ابوجہیم نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر نمازی کے سامنے سے گزرنے والا جانتا کہ اس کا کتنا بڑا گناہ ہے تو اس کے سامنے سے گزرنے پر چالیس تک وہیں کھڑے رہنے کو ترجیح دیتا۔ ابوالنضر نے کہا کہ مجھے یاد نہیں کہ بسر بن سعید نے چالیس دن کہا یا مہینہ یا سال۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": 511,
			"text": "ہم سے اسماعیل بن خلیل نے بیان کیا، کہا ہم سے علی بن مسہر نے بیان کیا سلیمان اعمش کے واسطہ سے، انہوں نے مسلم بن صبیح سے، انہوں نے مسروق سے، انہوں نے عائشہ رضی اللہ عنہا سے کہ ان کے سامنے ذکر ہوا کہ نماز کو کیا چیزیں توڑ دیتی ہیں، لوگوں نے کہا کہ کتا، گدھا اور عورت ( بھی ) نماز کو توڑ دیتی ہے۔ ( جب سامنے آ جائے ) عائشہ رضی اللہ عنہا نے فرمایا کہ تم نے ہمیں کتوں کے برابر بنا دیا۔ حالانکہ میں جانتی ہوں کہ نبی کریم صلی اللہ علیہ وسلم نماز پڑھ رہے تھے۔ میں آپ صلی اللہ علیہ وسلم کے اور آپ صلی اللہ علیہ وسلم کے قبلہ کے درمیان ( سامنے ) چارپائی پر لیٹی ہوئی تھی۔ مجھے ضرورت پیش آتی تھی اور یہ بھی اچھا نہیں معلوم ہوتا تھا کہ خود کو آپ صلی اللہ علیہ وسلم کے سامنے کر دوں۔ اس لیے میں آہستہ سے نکل آتی تھی۔ اعمش نے ابراہیم سے، انہوں نے اسود سے، انہوں نے عائشہ سے اسی طرح یہ حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": 512,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا، کہا کہ ہم سے ہشام بن عروہ نے بیان کیا، کہا مجھ سے میرے باپ نے عائشہ رضی اللہ عنہا کے واسطے سے بیان کیا، وہ فرماتی تھیں کہ نبی کریم صلی اللہ علیہ وسلم نماز پڑھتے رہتے اور میں ( آپ صلی اللہ علیہ وسلم کے سامنے ) بچھونے پڑ آڑی سوتی ہوئی پڑی ہوتی۔ جب آپ صلی اللہ علیہ وسلم وتر پڑھنا چاہتے تو مجھے بھی جگا دیتے اور میں بھی وتر پڑھ لیتی تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، کہا کہ ہمیں امام مالک نے خبر دی عمر بن عبیداللہ کے غلام ابوالنضر سے، انہوں نے ابوسلمہ عبداللہ بن عبدالرحمٰن سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا سے کہ آپ رضی اللہ عنہا نے فرمایا، میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے سو جایا کرتی تھی۔ میرے پاؤں آپ صلی اللہ علیہ وسلم کے سامنے ( پھیلے ہوئے ) ہوتے۔ جب آپ صلی اللہ علیہ وسلم سجدہ کرتے تو پاؤں کو ہلکے سے دبا دیتے اور میں انہیں سکیڑ لیتی پھر جب قیام فرماتے تو میں انہیں پھیلا لیتی تھی اس زمانہ میں گھروں کے اندر چراغ نہیں ہوتے تھے۔ ( معلوم ہوا کہ ایسا کرنا بھی جائز ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": 514,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا کہا، کہ مجھ سے میرے باپ نے بیان کیا، کہا کہ ہم سے اعمش نے بیان کیا، کہا کہ ہم سے ابراہیم نے اسود کے واسطہ سے بیان کیا، انہوں نے عائشہ رضی اللہ عنہا سے (دوسری سند) اور اعمش نے کہا کہ مجھ سے مسلم بن صبیح نے مسروق کے واسطہ سے بیان کیا، انہوں نے عائشہ رضی اللہ عنہا سے کہ ان کے سامنے ان چیزوں کا ذکر ہوا۔ جو نماز کو توڑ دیتی ہیں یعنی کتا، گدھا اور عورت۔ اس پر عائشہ رضی اللہ عنہا نے فرمایا کہ تم لوگوں نے ہمیں گدھوں اور کتوں کے برابر کر دیا۔ حالانکہ خود نبی کریم صلی اللہ علیہ وسلم اس طرح نماز پڑھتے تھے کہ میں چارپائی پر آپ صلی اللہ علیہ وسلم کے اور قبلہ کے بیچ میں لیٹی رہتی تھی۔ مجھے کوئی ضرورت پیش آئی اور چونکہ یہ بات پسند نہ تھی کہ آپ صلی اللہ علیہ وسلم کے سامنے ( جب کہ آپ صلی اللہ علیہ وسلم نماز پڑھ رہے ہوں ) بیٹھوں اور اس طرح آپ صلی اللہ علیہ وسلم کو تکلیف ہو۔ اس لیے میں آپ صلی اللہ علیہ وسلم کے پاؤں کی طرف سے خاموشی کے ساتھ نکل جاتی تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": 515,
			"text": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا کہ ہمیں یعقوب بن ابراہیم نے خبر دی، کہا کہ مجھ سے میرے بھتیجے ابن شہاب نے بیان کیا، انہوں نے اپنے چچا سے پوچھا کہ کیا نماز کو کوئی چیز توڑ دیتی ہے؟ تو انہوں نے فرمایا کہ نہیں، اسے کوئی چیز نہیں توڑتی۔ کیونکہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی ہے کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کھڑے ہو کر رات کو نماز پڑھتے اور میں آپ صلی اللہ علیہ وسلم کے سامنے آپ صلی اللہ علیہ وسلم کے اور قبلہ کے درمیان عرض میں بستر پر لیٹی رہتی تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": 516,
			"text": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے عامر بن عبداللہ بن زبیر رضی اللہ عنہما سے خبر دی، انہوں نے عمرو بن سلیم زرقی سے، انہوں نے ابوقتادہ انصاری رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم امامہ بنت زینب بنت رسول اللہ صلی اللہ علیہ وسلم کو ( بعض اوقات ) نماز پڑھتے وقت اٹھائے ہوتے تھے۔ ابوالعاص بن ربیعہ بن عبدشمس کی حدیث میں ہے کہ سجدہ میں جاتے تو اتار دیتے اور جب قیام فرماتے تو اٹھا لیتے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": 517,
			"text": "ہم سے عمرو بن زرارہ نے بیان کیا، کہا کہ ہم سے ہشیم نے شیبانی کے واسطے سے بیان کیا، انہوں نے عبداللہ بن شداد بن ہاد سے، کہا مجھے میری خالہ میمونہ بنت الحارث رضی اللہ عنہا نے خبر دی کہ میرا بستر نبی کریم صلی اللہ علیہ وسلم کے مصلے کے برابر میں ہوتا تھا۔ اور بعض دفعہ آپ صلی اللہ علیہ وسلم کا کپڑا ( نماز پڑھتے میں ) میرے اوپر آ جاتا اور میں اپنے بستر پر ہی ہوتی تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": 518,
			"text": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا، کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا، کہا ہم سے شیبانی سلیمان نے بیان کیا، کہا کہ ہم سے عبداللہ بن شداد بن ہاد نے بیان کیا، کہا ہم نے میمونہ رضی اللہ عنہا سے سنا، وہ فرماتی تھیں کہ نبی کریم صلی اللہ علیہ وسلم نماز پڑھتے ہوتے اور میں آپ صلی اللہ علیہ وسلم کے برابر میں سوتی رہتی۔ جب آپ صلی اللہ علیہ وسلم سجدہ میں جاتے تو آپ صلی اللہ علیہ وسلم کا کپڑا مجھے چھو جاتا حالانکہ میں حائضہ ہوتی تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": 519,
			"text": "ہم سے عمرو بن علی نے بیان کیا، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا، کہا کہ ہم سے عبیداللہ عمری نے بیان کیا، کہا کہ ہم سے قاسم بن محمد نے بیان کیا، انہوں نے عائشہ رضی اللہ عنہا سے، آپ نے فرمایا کہ تم نے برا کیا کہ ہم کو کتوں اور گدھوں کے حکم میں کر دیا۔ خود نبی کریم صلی اللہ علیہ وسلم نماز پڑھ رہے تھے۔ میں آپ صلی اللہ علیہ وسلم کے سامنے لیٹی ہوئی تھی۔ جب سجدہ کرنا چاہتے تو میرے پاؤں کو چھو دیتے اور میں انہیں سکیڑ لیتی تھی۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 520,
			"arabicnumber": 520,
			"text": "ہم سے احمد بن اسحاق سرماری نے بیان کیا، انہوں نے کہا کہ ہم سے اسرائیل نے ابواسحاق کے واسطہ سے بیان کیا۔ انہوں نے عمرو بن میمون سے، انہوں نے عبداللہ بن مسعود رضی اللہ عنہ سے، کہا کہ رسول اللہ صلی اللہ علیہ وسلم کعبہ کے پاس کھڑے نماز پڑھ رہے تھے۔ قریش اپنی مجلس میں ( قریب ہی ) بیٹھے ہوئے تھے۔ اتنے میں ان میں سے ایک قریشی بولا اس ریاکار کو نہیں دیکھتے؟ کیا کوئی ہے جو فلاں قبیلہ کے ذبح کئے ہوئے اونٹ کا گوبر، خون اور اوجھڑی اٹھا لائے۔ پھر یہاں انتظار کرے۔ جب یہ ( نبی کریم صلی اللہ علیہ وسلم ) سجدہ میں جائے تو گردن پر رکھ دے ( چنانچہ اس کام کو انجام دینے کے لیے ) ان میں سے سب سے زیادہ بدبخت شخص اٹھا اور جب آپ صلی اللہ علیہ وسلم سجدہ میں گئے تو اس نے آپ صلی اللہ علیہ وسلم کی گردن مبارک پر یہ غلاظتیں ڈال دیں۔ نبی کریم صلی اللہ علیہ وسلم سجدہ ہی کی حالت میں سر رکھے رہے۔ مشرکین ( یہ دیکھ کر ) ہنسے اور مارے ہنسی کے ایک دوسرے پر لوٹ پوٹ ہونے لگے۔ ایک شخص ( غالباً ابن مسعود رضی اللہ عنہ ) فاطمہ رضی اللہ عنہا کے پاس آئے۔ وہ ابھی بچہ تھیں۔ آپ رضی اللہ عنہا دوڑتی ہوئی آئیں۔ نبی کریم صلی اللہ علیہ وسلم اب بھی سجدہ ہی میں تھے۔ پھر ( فاطمہ رضی اللہ عنہا نے ) ان غلاظتوں کو آپ صلی اللہ علیہ وسلم کے اوپر سے ہٹایا اور مشرکین کو برا بھلا کہا۔ نبی کریم صلی اللہ علیہ وسلم نے نماز پوری کر کے فرمایا ”یا اللہ قریش پر عذاب نازل کر۔ یا اللہ قریش پر عذاب نازل کر۔ یا اللہ قریش پر عذاب نازل کر۔“ پھر نام لے کر کہا یا اللہ! عمرو بن ہشام، عتبہ بن ربیعہ، شیبہ بن ربیعہ، ولید بن عتبہ، امیہ بن خلف، عقبہ بن ابی معیط اور عمارہ ابن ولید کو ہلاک کر۔ عبداللہ بن مسعود رضی اللہ عنہ نے کہا، اللہ کی قسم! میں نے ان سب کو بدر کی لڑائی میں مقتول پایا۔ پھر انہیں گھسیٹ کر بدر کے کنویں میں پھینک دیا گیا۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کنویں والے اللہ کی رحمت سے دور کر دئیے گئے۔",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 167
			}
		}
	]
}