{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6723,
			"arabicnumber": 6723,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے محمد بن منکدر نے، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ میں بیمار پڑا تو رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ میری عیادت کے لیے تشریف لائے، دونوں حضرات پیدل چل کر آئے تھے۔ دونوں حضرات جب آئے تو مجھ پر غشی طاری تھی، نبی کریم صلی اللہ علیہ وسلم نے وضو کیا اور وضو کا پانی میرے اوپر چھڑکا مجھے ہوش ہوا تو میں نے عرض کیا: یا رسول اللہ! اپنے مال کی ( تقسیم ) کس طرح کروں؟ یا اپنے مال کا کس طرح فیصلہ کروں؟ نبی کریم صلی اللہ علیہ وسلم نے مجھے کوئی جواب نہیں دیا، یہاں تک کہ میراث کی آیتیں نازل ہوئیں۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6724,
			"arabicnumber": 6724,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے عبداللہ بن طاؤس نے بیان کیا، ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”بدگمانی سے بچتے رہو، کیونکہ گمان ( بدظنی ) سب سے جھوٹی بات ہے۔ آپس میں ایک دوسرے کی برائی کی تلاش میں نہ لگے رہو نہ ایک دوسرے سے بغض رکھو اور نہ پیٹھ پیچھے کسی کی برائی کرو، بلکہ اللہ کے بندے بھائی بھائی بن کر رہو۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6726,
			"arabicnumber": 6726,
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6727,
			"arabicnumber": 6727,
			"text": "ہم سے اسماعیل بن ابان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے، انہیں زہری نے، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ہماری وراثت نہیں ہوتی ہم جو کچھ بھی چھوڑیں وہ صدقہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6728,
			"arabicnumber": 6728,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے بیان کیا کہ مجھے مالک بن اوس بن حدثان نے خبر دی کہ محمد بن جبیر بن مطعم نے مجھ سے مالک بن اوس کی اس حدیث کا ایک حصہ ذکر کیا تھا۔ پھر میں خود مالک بن اوس کے پاس گیا اور ان سے یہ حدیث پوچھی تو انہوں نے بیان کیا کہ میں عمر رضی اللہ عنہ کی خدمت میں حاضر ہوا پھر ان کے حاجب یرفاء نے جا کر ان سے کہا کہ عثمان، عبدالرحمٰن بن زبیر اور سعد آپ کے پاس آنا چاہتے ہیں؟ انہوں نے کہا کہ اچھا آنے دو۔ چنانچہ انہیں اندر آنے کی اجازت دے دی۔ پھر کہا، کیا آپ علی و عباس رضی اللہ عنہما کو بھی آنے کی اجازت دیں گے؟ کہا کہ ہاں آنے دو۔ چنانچہ عباس رضی اللہ عنہ نے کہا کہ امیرالمؤمنین میرے اور علی رضی اللہ عنہ کے درمیان فیصلہ کر دیجئیے۔ عمر رضی اللہ عنہ نے کہا میں تمہیں اللہ کی قسم دیتا ہوں جس کے حکم سے آسمان و زمین قائم ہیں کیا تمہیں معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ ہماری وراثت تقسیم نہیں ہوتی جو کچھ ہم چھوڑیں وہ سب راہ اللہ صدقہ ہے؟ اس سے مراد نبی کریم صلی اللہ علیہ وسلم کی خود اپنی ہی ذات تھی۔ جملہ حاضرین بولے کہ جی ہاں، نبی کریم صلی اللہ علیہ وسلم نے یہ ارشاد فرمایا تھا۔ پھر عمر، علی اور عباس رضی اللہ عنہما کی طرف متوجہ ہوئے اور پوچھا، کیا تمہیں معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم نے یہ فرمایا تھا؟ انہوں نے بھی تصدیق کی کہ نبی کریم صلی اللہ علیہ وسلم نے یہ ارشاد فرمایا تھا۔ عمر رضی اللہ عنہ نے فرمایا پھر میں اب آپ لوگوں سے اس معاملہ میں گفتگو کروں گا۔ اللہ تعالیٰ نے اس فے کے معاملہ میں نبی کریم صلی اللہ علیہ وسلم کے لیے کچھ حصے مخصوص کر دئیے جو آپ کے سوا کسی اور کو نہیں ملتا تھا۔ چنانچہ اللہ تعالیٰ نے فرمایا تھا «ما أفاء الله على رسوله‏» سے ارشاد «قدير‏» تک۔ یہ تو خاص نبی کریم صلی اللہ علیہ وسلم کا حصہ تھا۔ اللہ کی قسم! نبی کریم صلی اللہ علیہ وسلم نے اسے تمہارے لیے ہی مخصوص کیا تھا اور تمہارے سوا کسی کو اس پر ترجیح نہیں دی تھی، تمہیں کو اس میں سے دیتے تھے اور تقسیم کرتے تھے۔ آخر اس میں سے یہ مال باقی رہ گیا اور نبی کریم صلی اللہ علیہ وسلم اس میں سے اپنے گھر والوں کے لیے سال بھر کا خرچہ لیتے تھے، اس کے بعد جو کچھ باقی بچتا اسے ان مصارف میں خرچ کرتے جو اللہ کے مقرر کردہ ہیں۔ نبی کریم صلی اللہ علیہ وسلم کا یہ طرز عمل آپ کی زندگی بھر رہا۔ میں آپ کو اللہ کی قسم دے کر کہتا ہوں، کیا آپ لوگوں کو معلوم ہے؟ لوگوں نے کہا کہ جی ہاں۔ پھر آپ نے علی اور عباس رضی اللہ عنہما سے پوچھا، میں اللہ کی قسم دے کر پوچھتا ہوں کیا آپ لوگوں کو یہ معلوم ہے؟ انہوں نے بھی کہا کہ جی ہاں۔ پھر نبی کریم صلی اللہ علیہ وسلم کی وفات ہو گئی اور ابوبکر رضی اللہ عنہ نے کہا کہ اب میں نبی کریم صلی اللہ علیہ وسلم کا نائب ہوں چنانچہ انہوں نے اس پر قبضہ میں رکھ کر اس طرز عمل کو جاری رکھا جو نبی کریم صلی اللہ علیہ وسلم کا اس میں تھا۔ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کو بھی وفات دی تو میں نے کہا کہ میں نبی کریم صلی اللہ علیہ وسلم کے نائب کا نائب ہوں۔ میں بھی دو سال سے اس پر قابض ہوں اور اس مال میں وہی کرتا ہوں جو رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے کیا۔ پھر آپ دونوں میرے پاس آئے ہو۔ آپ دونوں کی بات ایک ہے اور معاملہ بھی ایک ہی ہے۔ آپ ( عباس رضی اللہ عنہ ) میرے پاس اپنے بھتیجے کی میراث سے اپنا حصہ لینے آئے ہو اور آپ ( علی رضی اللہ عنہ ) اپنی بیوی کا حصہ لینے آئے ہو جو ان کے والد کی طرف سے انہیں ملتا۔ میں کہتا ہوں کہ اگر آپ دونوں چاہتے ہیں تو میں اسے آپ کو دے سکتا ہوں لیکن آپ لوگ اس کے سوا کوئی اور فیصلہ چاہتے ہیں تو اس ذات کی قسم جس کے حکم سے آسمان و زمین قائم ہیں، میں اس مال میں اس کے سوا اور کوئی فیصلہ نہیں کر سکتا، قیامت تک، اگر آپ اس کے مطابق عمل نہیں کر سکتے تو وہ جائیداد مجھے واپس کر دیجئیے میں اس کا بھی بندوبست کر لوں گا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6729,
			"arabicnumber": 6729,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میرا ورثہ دینار کی شکل میں تقسیم نہیں ہو گا۔ میں نے اپنی بیویوں کے خرچہ اور اپنے عاملوں کی اجرت کے بعد جو کچھ چھوڑا ہے وہ سب صدقہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6730,
			"arabicnumber": 6730,
			"text": "ہم سے عبداللہ بن مسلمہ قعبنی نے بیان کیا، ان سے امام مالک نے، ان سے ابن شہاب نے، ان سے عائشہ رضی اللہ عنہا نے کہ جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی بیویوں نے چاہا کہ عثمان رضی اللہ عنہ کو ابوبکر رضی اللہ عنہ کے پاس بھیجیں، اپنی میراث طلب کرنے کے لیے۔ پھر عائشہ رضی اللہ عنہا نے یاد دلایا۔ کیا نبی کریم صلی اللہ علیہ وسلم نے نہیں فرمایا تھا کہ ہماری وراثت تقسیم نہیں ہوتی، ہم جو کچھ چھوڑ جائیں وہ سب صدقہ ہے؟",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6731,
			"arabicnumber": 6731,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو یونس بن یزید ایلی نے خبر دی، انہیں ابن شہاب نے، کہا مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میں مومنوں کا خود ان سے زیادہ حقدار ہوں۔ پس ان میں سے جو کوئی قرض دار مرے گا اور ادائیگی کے لیے کچھ نہ چھوڑے گا تو ہم پر اس کی ادائیگی کی ذمہ داری ہے اور جس نے کوئی مال چھوڑا ہو گا وہ اس کے وارثوں کا حصہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6732,
			"arabicnumber": 6732,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے عبداللہ ابن طاؤس نے بیان کیا، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میراث اس کے حق داروں تک پہنچا دو اور جو کچھ باقی بچے وہ سب سے زیادہ قریبی مرد عزیز کا حصہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6733,
			"arabicnumber": 6733,
			"text": "ہم سے امام حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے زہری نے بیان کیا، کہا مجھے عامر بن سعد بن ابی وقاص نے خبر دی اور ان سے ان کے والد نے بیان کیا کہ میں مکہ مکرمہ میں ( حجۃ الوداع میں ) بیمار پڑ گیا اور موت کے قریب پہنچ گیا۔ پھر نبی کریم صلی اللہ علیہ وسلم میری عیادت کے لیے تشریف لائے تو میں نے عرض کیا: یا رسول اللہ! میرے پاس بہت زیادہ مال ہے اور ایک لڑکی کے سوا اس کا کوئی وارث نہیں تو کیا مجھے اپنے مال کے دو تہائی حصہ کا صدقہ کر دینا چاہئے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ بیان کیا کہ میں نے عرض کیا پھر آدھے کا کر دوں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ میں نے عرض کیا ایک تہائی کا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں۔ گو تہائی بھی بہت ہے، اگر تم اپنے بچوں کو مالدار چھوڑو تو یہ اس سے بہتر ہے کہ انہیں تنگدست چھوڑو اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں اور تم جو بھی خرچ کرو گے اس پر تمہیں ثواب ملے گا یہاں تک کہ اس لقمہ پر بھی ثواب ملے گا جو تم اپنی بیوی کے منہ میں رکھو گے۔ پھر میں نے عرض کیا: یا رسول اللہ! کیا میں اپنی ہجرت میں پیچھے رہ جاؤں گا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر میرے بعد تم پیچھے رہ بھی گئے تب بھی جو عمل تم کرو گے اور اس سے اللہ کی خوشنودی مقصود ہو گی تو اس کے ذریعہ درجہ و مرتبہ بلند ہو گا اور غالباً تم میرے بعد زندہ رہو گے اور تم سے بہت سے لوگوں کو فائدہ ہو گا اور بہتوں کو نقصان پہنچے گا۔ قابل افسوس تو سعد ابن خولہ ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے ان کے بارے میں اس لیے افسوس کا اظہار کیا کہ ( ہجرت کے بعد اتفاق سے ) ان کی وفات مکہ مکرمہ میں ہی ہو گئی۔ سفیان نے بیان کیا کہ سعد ابن خولہ رضی اللہ عنہ بنی عامر بن لوی کے ایک آدمی تھے۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6734,
			"arabicnumber": 6734,
			"text": "مجھ سے محمود بن غیلان نے بیان کیا، کہا ہم سے ابوالنضر نے بیان کیا، کہا ہم سے ابومعاویہ شیبان نے بیان کیا، ان سے اشعث بن ابی الشعثاء نے، ان سے اسود بن یزید نے بیان کیا کہ معاذ بن جبل رضی اللہ عنہ ہمارے یہاں یمن میں معلم و امیر بن کر تشریف لائے۔ ہم نے ان سے ایک ایسے شخص کے ترکہ کے بارے میں پوچھا جس کی وفات ہوئی ہو اور اس نے ایک بیٹی اور ایک بہن چھوڑی ہو اور اس نے اپنی بیٹی کو آدھا اور بہن کو بھی آدھا دیا ہو۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6735,
			"arabicnumber": 6735,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے عبداللہ ابن طاؤس نے بیان کیا، ان سے ان کے والد نے اور ان سے ابن عباس نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”پہلے میراث ان کے وارثوں تک پہنچا دو اور جو باقی رہ جائے وہ اس کو ملے گا جو مرد میت کا بہت نزدیکی رشتہ دار ہو۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6736,
			"arabicnumber": 6736,
			"text": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے، کہا ہم سے ابوقیس عبدالرحمٰن بن ثروان نے، انہوں نے ہزیل بن شرحبیل سے سنا، بیان کیا کہ ابوموسیٰ رضی اللہ عنہ سے بیٹی، پوتی اور بہن کی میراث کے بارے میں پوچھا گیا تو انہوں نے کہا کہ بیٹی کو آدھا ملے گا اور بہن کو آدھا ملے گا اور تو ابن مسعود رضی اللہ عنہ کے یہاں جا، شاید وہ بھی یہی بتائیں گے۔ پھر ابن مسعود رضی اللہ عنہ سے پوچھا گیا اور ابوموسیٰ رضی اللہ عنہ کی بات بھی پہنچائی گئی تو انہوں نے کہا کہ میں اگر ایسا فتویٰ دوں تو گمراہ ہو چکا اور ٹھیک راستے سے بھٹک گیا۔ میں تو اس میں وہی فیصلہ کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا کہ بیٹی کو آدھا ملے گا، پوتی کو چھٹا حصہ ملے گا، اس طرح دو تہائی پوری ہو جائے گی اور پھر جو باقی بچے گا وہ بہن کو ملے گا۔ پھر ابوموسیٰ رضی اللہ عنہ کے پاس آئے اور ابن مسعود رضی اللہ عنہ کی بات ان تک پہنچائی تو انہوں نے کہا کہ جب تک یہ عالم تم میں موجود ہیں مجھ سے مسائل نہ پوچھا کرو۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6737,
			"arabicnumber": 6737,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ان سے ابن طاؤس نے، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میراث اس کے حقدار تک پہنچا دو اور جو باقی رہ جائے وہ سب سے قریب والے مرد کو دے دو۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6738,
			"arabicnumber": 6738,
			"text": "ہم سے ابومعمر نے بیان کیا، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا، انہوں نے کہا ہم سے ایوب نے بیان کیا، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے جو یہ فرمایا ہے کہ اگر میں اس امت کے کسی آدمی کو خلیل بناتا تو ان کو ( ابوبکر رضی اللہ عنہ کو ) کو خلیل بناتا، لیکن اسلام کا تعلق ہی سب سے بہتر ہے تو اس میں نبی کریم صلی اللہ علیہ وسلم نے دادا کو باپ کے درجہ میں رکھا ہے۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6739,
			"arabicnumber": 6739,
			"text": "ہم سے محمد بن یوسف نے بیان کیا، ان سے ورقاء نے بیان کیا، ان سے ابن ابی نجیح نے بیان کیا، ان سے عطاء نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ پہلے مال کی اولاد مستحق تھی اور والدین کو وصیت کا حق تھا۔ پھر اللہ تعالیٰ نے اس میں سے جو چاہا منسوخ کر دیا اور لڑکوں کو لڑکیوں کے دگنا حق دیا اور والدین کو اور ان میں سے ہر ایک کو چھٹے حصہ کا مستحق قرار دیا اور بیوی کو آٹھویں اور چوتھے حصہ کا حق دار قرار دیا اور شوہر کو آدھے یا چوتھائی کا حقدار قرار دیا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6740,
			"arabicnumber": 6740,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے، ان سے ابن شہاب نے، ان سے ابن المسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے بنی لحیان کی ایک عورت ملیا بنت عویمر کے بچے کے بارے میں جو ایک عورت کی مار سے مردہ پیدا ہوا تھا کہ مارنے والی عورت کو خون بہا کے طور پر ایک غلام یا لونڈی ادا کرنے کا حکم فرمایا تھا۔ پھر وہ عورت بچہ گرانے والی جس کے متعلق نبی کریم صلی اللہ علیہ وسلم نے فیصلہ دیا تھا مر گئی تو نبی کریم صلی اللہ علیہ وسلم نے فیصلہ کیا کہ اس کی میراث اس کے لڑکوں اور شوہر کو دے دی جائے اور یہ دیت ادا کرنے کا حکم اس کے کنبہ والوں کو دیا تھا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6741,
			"arabicnumber": 6741,
			"text": "ہم سے بشر بن خالد نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، ان سے شعبہ بن حجاج نے، ان سے سلیمان اعمش نے، ان سے ابراہیم نخعی نے اور ان سے اسود بن یزید نے بیان کیا کہ معاذ بن جبل رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ہمارے درمیان یہ فیصلہ کیا تھا کہ آدھا بیٹی کو ملے گا اور آدھا بہن کو۔ پھر سلیمان نے جو اس حدیث کو روایت کیا تو اتنا ہی کہا کہ معاذ نے ہم کنبہ والوں کو یہ حکم دیا تھا یہ نہیں کہا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6742,
			"arabicnumber": 6742,
			"text": "ہم سے عمرو بن عباس نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے ابوقیس (عبدالرحمٰن بن عزوان) نے، ان سے ہزیل بن شرحبیل نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کے فیصلہ کے مطابق اس کا فیصلہ کروں گا، لڑکی کو آدھا، پوتی کو چھٹا اور جو باقی بچے بہن کا حصہ ہے۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6743,
			"arabicnumber": 6743,
			"text": "ہم سے عبداللہ بن عثمان نے بیان کیا، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو شعبہ بن حجاج نے خبر دی، ان سے محمد بن منکدر نے بیان کیا، انہوں نے جابر رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم میرے گھر تشریف لائے اور میں بیمار تھا۔ نبی کریم صلی اللہ علیہ وسلم نے پانی منگوایا اور وضو کیا، پھر اپنے وضو کے پانی سے مجھ پر چھینٹا ڈالا تو مجھے ہوش آ گیا۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا: یا رسول اللہ! میری بہنیں ہیں؟ اس پر میراث کی آیت نازل ہوئی۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6744,
			"arabicnumber": 6744,
			"text": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، ان سے اسرائیل نے، ان سے ابواسحاق نے، ان سے براء رضی اللہ عنہ نے بیان کیا کہ آخری آیت ( میراث کی ) سورۃ نساء کے آخر کی آیتیں نازل ہوئیں «يستفتونك قل الله يفتيكم في الكلالة‏» کہ ”آپ سے فتویٰ پوچھتے ہیں، کہہ دیجئیے کہ اللہ تعالیٰ تمہیں کلالہ کے بارے میں فتویٰ دیتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6745,
			"arabicnumber": 6745,
			"text": "ہم سے محمود نے بیان کیا، انہوں نے کہا ہم کو اسرائیل نے خبر دی، انہیں ابوحصین نے، انہیں ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میں مسلمانوں کا خود ان کی ذات سے بھی زیادہ ولی ہوں۔ پس جو شخص مر جائے اور مال چھوڑ جائے تو وہ اس کے وارثوں کا حق ہے اور جس نے بیوی بچے چھوڑے ہوں یا قرض ہو، تو میں ان کا ولی ہوں، ان کے لیے مجھ سے مانگا جائے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6746,
			"arabicnumber": 6746,
			"text": "ہم سے امیہ بن بسطام نے بیان کیا، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا، ان سے روح نے بیان کیا، ان سے عبداللہ بن طاؤس نے، ان سے ان کے والد نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میراث اس کے وارثوں تک پہنچا دو اور جو کچھ اس میں سے بچ رہے وہ قریبی عزیز مرد کا حق ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6747,
			"arabicnumber": 6747,
			"text": "مجھ سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا کہ میں نے ابواسامہ سے پوچھا کیا آپ سے ادریس نے بیان کیا تھا، ان سے طلحہ نے بیان کیا، ان سے سعید بن جبیر نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے «ولكل جعلنا موالي‏» اور «والذين عقدت أيمانكم‏» کے متعلق بتلایا کہ مہاجرین جب مدینہ آئے تو ذوی الارحام کے علاوہ انصار و مہاجرین بھی ایک دوسرے کی وراثت پاتے تھے۔ اس بھائی چارگی کی وجہ سے جو نبی کریم صلی اللہ علیہ وسلم نے ان کے درمیان کرائی تھی، پھر جب آیت «جعلنا موالي‏» نازل ہوئی تو فرمایا کہ اس نے «والذين عقدت أيمانكم‏» کو منسوخ کر دیا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6748,
			"arabicnumber": 6748,
			"text": "مجھ سے یحییٰ بن قزعہ نے بیان کیا، کہا ہم سے مالک نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ ایک شخص نے اپنی بیوی سے نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں لعان کیا اور اس کے بچہ کو اپنا بچہ ماننے سے انکار کر دیا تو نبی کریم صلی اللہ علیہ وسلم نے دونوں کے درمیان جدائی کرا دی اور بچہ عورت کو دے دیا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6749,
			"arabicnumber": 6749,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ عتبہ اپنے بھائی سعد رضی اللہ عنہ کو وصیت کر گیا تھا کہ زمعہ کی کنیز کا لڑکا میرا ہے اور اسے اپنی پرورش میں لے لینا۔ فتح مکہ کے سال سعد رضی اللہ عنہ نے اسے لینا چاہا اور کہا کہ میرے بھائی کا لڑکا ہے اور اس نے مجھے اس کے بارے میں وصیت کی تھی۔ اس پر عبد بن زمعہ رضی اللہ عنہ کھڑے ہوئے اور کہا کہ یہ میرا بھائی ہے اور میرے باپ کی لونڈی کا لڑکا ہے، اس کے بستر پر پیدا ہوا ہے۔ آخر یہ دونوں یہ معاملہ رسول اللہ صلی اللہ علیہ وسلم کے پاس لے گئے تو سعد رضی اللہ عنہ نے کہا: یا رسول اللہ!، یہ میرے بھائی کا لڑکا ہے اس نے اس کے بارے میں مجھے وصیت کی تھی۔ عبد بن زمعہ نے کہا کہ یہ میرا بھائی ہے، میرے باپ کی باندی کا لڑکا اور باپ کے بستر پر پیدا ہوا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، عبد بن زمعہ! یہ تمہارے پاس رہے گا، لڑکا بستر کا حق ہے اور زانی کے حصہ میں پتھر ہیں۔ پھر سودہ بنت زمعہ رضی اللہ عنہا سے کہا کہ اس لڑکے سے پردہ کیا کر کیونکہ عتبہ کے ساتھ اس کی شباہت آپ صلی اللہ علیہ وسلم نے دیکھ لی تھی۔ چنانچہ پھر اس لڑکے نے ام المؤمنین کو اپنی وفات تک نہیں دیکھا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6750,
			"arabicnumber": 6750,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے، ان سے شعبہ نے بیان کیا، ان سے محمد بن زیاد نے بیان کیا، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”لڑکا بستر والے کا حق ہوتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6751,
			"arabicnumber": 6751,
			"text": "ہم سے حفص بن عمر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے حکم نے، ان سے ابراہیم نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے بریرہ رضی اللہ عنہ کو خریدنا چاہا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں خرید لے، ولاء تو اس کے ساتھ قائم ہوتی ہے جو آزاد کر دے اور بریرہ رضی اللہ عنہ کو ایک بکری ملی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ ان کے لیے صدقہ تھی لیکن ہمارے لیے ہدیہ ہے۔ حکم نے بیان کیا کہ ان کے شوہر آزاد تھے۔ حکم کا قول مرسل منقول ہے۔ ابن عباس رضی اللہ عنہما نے کہا کہ میں نے انہیں غلام دیکھا تھا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6752,
			"arabicnumber": 6752,
			"text": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، انہوں نے کہا کہ مجھ سے مالک نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ولاء اسی کے ساتھ قائم ہوتی ہے جو آزاد کر دے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6753,
			"arabicnumber": 6753,
			"text": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے ابوقیس نے، ان سے ہزیل نے انہوں نے عبداللہ سے نقل کیا، انہوں نے فرمایا کہ عبداللہ رضی اللہ عنہ نے فرمایا مسلمان سائبہ نہیں بناتے اور دور جاہلیت میں مشرکین سائبہ بناتے تھے۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6754,
			"arabicnumber": 6754,
			"text": "ہم سے موسیٰ نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے منصور نے، ان سے ابراہیم نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے کہ بریرہ کو انہوں نے آزاد کرنے کے لیے خریدنا چاہا لیکن ان کے نائکوں نے اپنے ولاء کی شرط لگا دی عائشہ رضی اللہ عنہا نے کہا یا رسول اللہ! میں نے آزاد کرنے کے لیے بریرہ کو خریدنا چاہا لیکن ان کے مالکوں نے اپنے لیے ان کی ولاء کی شرط لگا دی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں آزاد کر دے، ولاء تو آزاد کرنے والے کے ساتھ قائم ہوتی ہے۔ بیان کیا کہ پھر میں نے انہیں خریدا اور آزاد کر دیا اور میں نے بریرہ کو اختیار دیا ( کہ چاہیں تو شوہر کے ساتھ رہ سکتی ہیں ورنہ علیحدہ بھی ہو سکتی ہیں ) تو انہوں نے شوہر سے علیحدگی کو پسند کیا اور کہا کہ مجھے اتنا اتنا مال بھی دیا جائے تو میں پہلے شوہر کے ساتھ نہیں رہوں گی۔ اسود نے بیان کیا کہ ان کے شوہر آزاد تھے۔ اسود کا قول منقطع ہے اور ابن عباس رضی اللہ عنہما کا قول صحیح ہے کہ میں نے انہیں غلام دیکھا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6755,
			"arabicnumber": 6755,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے اعمش نے، ان سے ابراہیم تیمی نے، ان سے ان کے والد نے بیان کیا کہ علی رضی اللہ عنہ نے بتلایا کہ ہمارے پاس کوئی کتاب نہیں ہے جسے ہم پڑھیں، سوا اللہ کی کتاب قرآن کے اور اس کے علاوہ یہ صحیفہ بھی ہے۔ بیان کیا کہ پھر وہ صحیفہ نکالا تو اس میں زخموں ( کے قصاص ) اور اونٹوں کی زکوٰۃ کے مسائل تھے۔ راوی نے بیان کیا کہ اس میں یہ بھی تھا کے عیر سے ثور تک مدینہ حرم ہے جس نے اس دین میں کوئی نئی بات پیدا کی یا نئی بات کرنے والے کو پناہ دی تو اس پر اللہ اور فرشتوں اور انسانوں سب کی لعنت ہے اور قیامت کے دن اس کا کوئی نیک عمل مقبول نہ ہو گا اور جس نے اپنے مالکوں کی اجازت کے بغیر دوسرے لوگوں سے مولات قائم کر لی تو اس پر فرشتوں اور انسانوں سب کی لعنت ہے، قیامت کے دن اس کا کوئی نیک عمل مقبول نہ ہو گا اور مسلمانوں کا ذمہ ( قول و قرار، کسی کو پناہ دینا وغیرہ ) ایک ہے۔ ایک ادنی مسلمان کے پناہ دینے کو بھی قائم رکھنے کی کوشش کی جائے گی۔ پس جس نے کسی مسلمان کی دی ہوئی پناہ کو توڑا، اس پر اللہ کی، فرشتوں اور انسانوں سب کی لعنت ہے قیامت کے دن اس کا کوئی نیک عمل قبول نہیں کیا جائے گا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6756,
			"arabicnumber": 6756,
			"text": "ہم سے ابونعیم نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ولاء کے تعلق کو بیچنے، اس کو ہبہ کرنے سے منع فرمایا ہے۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6757,
			"arabicnumber": 6757,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے امام مالک رحمہ اللہ نے بیان کیا، ان سے نافع نے، ان سے ابن عمر رضی اللہ عنہما نے کہ ام المؤمنین عائشہ رضی اللہ عنہا نے ایک کنیز کو آزاد کرنے کے لیے خریدنا چاہا تو کنیز کے مالکوں نے کہا کہ ہم بیچ سکتے ہیں لیکن ولاء ہمارے ساتھ ہو گی۔ ام المؤمنین نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس شرط کو مانع نہ بننے دو، ولاء ہمیشہ اسی کے ساتھ قائم ہوتی ہے جو آزاد کرے۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6758,
			"arabicnumber": 6758,
			"text": "ہم سے محمد نے بیان کیا، کہا ہم کو جریر نے خبر دی، انہیں منصور نے، انہیں ابراہیم نے، انہیں اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے بریرہ کو خریدنا چاہا تو ان کے مالکوں نے شرط لگائی کہ ولاء ان کے ساتھ قائم ہو گی۔ میں نے اس کا تذکرہ نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں آزاد کر دو، ولاء قیمت ادا کرنے والے ہی کے ساتھ قائم ہوتی ہے۔ بیان کیا کہ پھر میں نے آزاد کر دیا۔ پھر انہیں نبی کریم صلی اللہ علیہ وسلم نے بلایا اور ان کے شوہر کے معاملہ میں اختیار دیا۔ انہوں نے کہا کہ اگر مجھے یہ یہ چیزیں بھی وہ دیدے تو میں اس کے ساتھ رات گزارنے کے لیے تیار نہیں۔ چنانچہ اس نے شوہر سے علیحدگی کو پسند کیا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6759,
			"arabicnumber": 6759,
			"text": "ہم سے حفص بن عمر نے بیان کیا، انہوں نے کہا ہم سے ہمام نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ عائشہ رضی اللہ عنہا نے بریرہ رضی اللہ عنہا کو خریدنا چاہا اور رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ یہ لوگ ولاء کی شرط لگاتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ خرید لو، ولاء تو اسی کے ساتھ قائم ہوتی ہے جو آزاد کرے ( آزاد کرائے ) ۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6760,
			"arabicnumber": 6760,
			"text": "ہم سے ابن سلام نے بیان کیا، کہا ہم کو وکیع نے خبر دی، انہیں سفیان نے، انہیں منصور نے، انہیں ابراہیم نے، انہیں اسود نے، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ولاء اس کے ساتھ قائم ہو گی جو قیمت دے اور احسان کرے ( آزاد کر کے)",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6761,
			"arabicnumber": 6761,
			"text": "ہم سے آدم نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے معاویہ بن قرہ اور قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کسی گھرانے کا غلام اسی کا ایک فرد ہوتا ہے“ «أو كما قال‏.‏» ۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6762,
			"arabicnumber": 6762,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کسی گھرانے کا بھانجا اس کا ایک فرد ہے۔“ ( «منهم‏ ‏‏.‏» یا «من أنفسهم» کے الفاظ فرمائے ) ۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6763,
			"arabicnumber": 6763,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عدی نے، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس نے مال چھوڑا ( اپنی موت کے بعد ) وہ اس کے وارثوں کا ہے اور جس نے قرض چھوڑا ہے وہ ہمارے ذمہ ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6764,
			"arabicnumber": 6764,
			"text": "ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے علی بن حسین نے بیان کیا، ان سے عمر بن عثمان نے بیان کیا اور ان سے اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”مسلمان باپ کافر بیٹے کا وارث نہیں ہوتا اور نہ کافر بیٹا مسلمان باپ کا۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6765,
			"arabicnumber": 6765,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے لیث نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہا کا ایک لڑکے کے بارے میں جھگڑا ہوا۔ سعد رضی اللہ عنہ نے کہا کہ یا رسول اللہ! یہ میرے بھائی عتبہ بن ابی وقاص کا لڑکا ہے، اس نے مجھے وصیت کی تھی کہ یہ اس کا لڑکا ہے آپ اس کی مشابہت اس میں دیکھئیے اور عبد بن زمعہ نے کہا کہ میرا بھائی ہے یا رسول اللہ! میرے والد کے بستر پر ان کی لونڈی سے پیدا ہوا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے لڑکے کی صورت دیکھی تو اس کی عتبہ کے ساتھ صاف مشابہت واضح تھی، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا، عبد! لڑکا بستر والے کا ہوتا ہے اور زانی کے حصہ میں پتھر ہیں اور اے سودہ بنت زمعہ! ( ام المؤمنین رضی اللہ عنہا ) اس لڑکے سے پردہ کیا کر چنانچہ پھر اس لڑکے نے ام المؤمنین کو نہیں دیکھا۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6767,
			"arabicnumber": 6767,
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6768,
			"arabicnumber": 6768,
			"text": "ہم سے اصبغ بن الفرج نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ کو عمرو نے خبر دی، انہیں جعفر بن ربیعہ نے، انہیں عراک نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اپنے باپ کا کوئی انکار نہ کرے کیونکہ جو اپنے باپ سے منہ موڑتا ہے ( اور اپنے کو دوسرے کا بیٹا ظاہر کرتا ہے تو ) یہ کفر ہے۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6769,
			"arabicnumber": 6769,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، کہا کہ ہم سے ابوالزناد نے بیان کیا، ان سے عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”دو عورتیں تھیں اور ان کے ساتھ ان کے دو بچے بھی تھے، پھر بھیڑیا آیا اور ایک بچے کو اٹھا کر لے گیا اس نے اپنی ساتھی عورت سے کہا کہ بھیڑیا تیرے بچے کو لے گیا ہے، دوسری عورت نے کہا کہ وہ تو تیرا بچہ لے گیا ہے۔ وہ دونوں عورتیں اپنا مقدمہ داؤد علیہ السلام کے پاس لائیں تو آپ نے فیصلہ بڑی کے حق میں کر دیا۔ وہ دونوں نکل کر سلیمان بن داؤد علیہما السلام کے پاس گئیں اور انہیں واقعہ کی اطلاع دی۔ سلیمان علیہ السلام نے کہا کہ چھری لاؤ میں لڑکے کے دو ٹکڑے کر کے دونوں کو ایک ایک دوں گا۔ اس پر چھوٹی عورت بول اٹھی کہ ایسا نہ کیجئے آپ پر اللہ رحم کرے، یہ بڑی ہی کا لڑکا ہے لیکن آپ علیہ السلام نے فیصلہ چھوٹی عورت کے حق میں کیا۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ واللہ! میں نے «سكين» چھری کا لفظ سب سے پہلی مرتبہ ( نبی کریم صلی اللہ علیہ وسلم کی زبان سے ) اس دن سنا تھا اور ہم اس کے لیے ( اپنے قبیلہ میں ) «مدية‏.‏» کا لفظ بولتے تھے۔",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6770,
			"arabicnumber": 6770,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم میرے یہاں ایک مرتبہ بہت خوش خوش تشریف لائے۔ آپ صلی اللہ علیہ وسلم کا چہرہ چمک رہا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”تم نے نہیں دیکھا، مجزز ( ایک قیافہ شناس ) نے ابھی ابھی زید بن حارثہ اور اسامہ بن زید رضی اللہ عنہما کے ( صرف پاؤں دیکھے ) اور کہا کہ یہ پاؤں ایک دوسرے سے تعلق رکھتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6771,
			"arabicnumber": 6771,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، ان سے زہری نے بیان کیا، ان سے عروہ نے اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم میرے یہاں تشریف لائے، آپ صلی اللہ علیہ وسلم بہت خوش تھے اور فرمایا ”عائشہ! تم نے دیکھا نہیں، مجزز مدلجی آیا اور اس نے اسامہ اور زید ( رضی اللہ عنہما ) کو دیکھا، دونوں کے جسم پر ایک چادر تھی، جس نے دونوں کے سروں کو ڈھک لیا تھا اور ان کے صرف پاؤں کھلے ہوئے تھے تو اس نے کہا کہ یہ پاؤں ایک دوسرے سے تعلق رکھتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 47
			}
		}
	]
}