{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"88": "Apostates"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6918,
			"arabicnumber": 6918,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم کو جریر بن عبدالحمید نے بیان کیا، انہوں نے اعمش سے، انہوں نے ابراہیم نخعی سے، انہوں نے علقمہ سے، انہوں نے عبداللہ بن مسعود رضی اللہ عنہ سے، انہوں نے کہا کہ جب ( سورۃ الانعام کی ) یہ آیت «الذين آمنوا ولم يلبسوا إيمانهم بظلم‏» اتری ”جو لوگ ایمان لائے اور انہوں نے ایمان کو گناہ سے آلود نہیں کیا ( یعنی ظلم سے ) “ تو نبی کریم صلی اللہ علیہ وسلم کے صحابہ کو بہت گراں گزری وہ کہنے لگے بھلا ہم میں سے کون ایسا ہے جس نے ایمان کے ساتھ کوئی ظلم ( یعنی گناہ ) نہ کیا ہو۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس آیت میں ظلم سے گناہ مراد نہیں ہے ( بلکہ شرک مراد ہے ) کیا تم نے لقمان علیہ السلام کا قول نہیں سنا «إن الشرك لظلم عظيم‏» ”شرک بڑا ظلم ہے“۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6919,
			"arabicnumber": 6919,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے بشر بن مفضل نے، کہا ہم سے سعید بن ایاس جریری نے، (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور مجھ سے قیس بن حفص نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم نے، کہا ہم کو سعید جریری نے خبر دی، کہا ہم سے عبدالرحمٰن بن ابی بکرہ نے بیان کیا، انہوں نے اپنے والد (ابوبکرہ صحابی) سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بڑے سے بڑا گناہ اللہ تعالیٰ کے ساتھ شرک کرنا ہے اور ماں باپ کو ستانا ( ان کی نافرمانی کرنا ) اور جھوٹی گواہی دینا، جھوٹی گواہی دینا، تین بار یہی فرمایا یا یوں فرمایا اور جھوٹ بولنا برابر باربار آپ صلی اللہ علیہ وسلم یہی فرماتے رہے یہاں تک کہ ہم نے آرزو کی کہ کاش آپ خاموش ہو جاتے۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6920,
			"arabicnumber": 6920,
			"text": "ہم سے محمد بن حسین بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے عبیداللہ بن موسیٰ کوفی نے بیان کیا، انہوں نے کہا ہم کو شیبان نحوی نے خبر دی، انہوں نے فراش بن یحییٰ سے، انہوں نے عامر شعبی سے، انہوں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے، انہوں نے کہا کہ ایک گنوار ( نام نامعلوم ) نبی کریم صلی اللہ علیہ وسلم کے پاس آیا کہنے لگا: یا رسول اللہ! بڑے بڑے گناہ کون سے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”اللہ کے ساتھ شرک کرنا۔“ اس نے پوچھا پھر کون سا گناہ؟ آپ نے فرمایا ”ماں باپ کو ستانا۔“ پوچھا: پھر کون سا گناہ؟ آپ نے فرمایا ” «غموس‏ ‏‏.‏» قسم کھانا۔“ عبداللہ بن عمرو رضی اللہ عنہما نے کہا میں نے عرض کیا: یا رسول اللہ! «غموس‏ ‏‏.‏» قسم کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”جان بوجھ کر کسی مسلمان کا مال مار لینے کے لیے جھوٹی قسم کھانا۔“",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6921,
			"arabicnumber": 6921,
			"text": "ہم سے خلاد بن یحییٰ نے بیان کیا، کہا ہم سے سفیان ثوری نے، انہوں نے منصور اور اعمش سے، انہوں نے ابووائل سے، انہوں نے عبداللہ بن مسعود رضی اللہ عنہ سے، انہوں نے کہا ایک شخص ( نام نامعلوم ) نے عرض کیا: یا رسول اللہ! ہم نے جو گناہ ( اسلام لانے سے پہلے ) جاہلیت کے زمانہ میں کیے ہیں کیا ان کا مواخذہ ہم سے ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”جو شخص اسلام کی حالت میں نیک اعمال کرتا رہا اس سے جاہلیت کے گناہوں کا مواخذہ نہ ہو گا ( اللہ تعالیٰ معاف کر دے گا ) اور جو شخص مسلمان ہو کر بھی برے کام کرتا رہا اس سے دونوں زمانوں کے گناہوں کا مواخذہ ہو گا۔“",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6922,
			"arabicnumber": 6922,
			"text": "ہم سے ابوالنعمان محمد بن فضل سدوسی نے بیان کیا، کہا ہم سے حماد بن زید نے، انہوں نے ایوب سختیانی سے، انہوں نے عکرمہ سے، انہوں نے کہا علی رضی اللہ عنہ کے پاس کچھ بےدین لوگ لائے گئے۔ آپ نے ان کو جلوا دیا۔ یہ خبر ابن عباس رضی اللہ عنہما کو پہنچی تو انہوں نے کہا اگر میں حاکم ہوتا تو ان کو کبھی نہ جلواتا ( دوسری طرح سے سزا دیتا ) کیونکہ نبی کریم صلی اللہ علیہ وسلم نے آگ میں جلانے سے منع فرمایا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ آگ اللہ کا عذاب ہے تم اللہ کے عذاب سے کسی کو مت عذاب دو میں ان کو قتل کروا ڈالتا کیونکہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہے جو شخص اپنا دین بدل ڈالے اسلام سے پھر جائے اس کو قتل کر ڈالو۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6923,
			"arabicnumber": 6923,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے، انہوں نے قرۃ بن خالد سے، کہا مجھ سے حمید بن ہلال نے بیان کیا، کہا ہم سے ابوبردہ رضی اللہ عنہ نے، انہوں نے ابوموسیٰ اشعری سے، انہوں نے کہا میں نبی کریم صلی اللہ علیہ وسلم کے پاس آیا میرے ساتھ اشعر قبیلے کے دو شخص تھے ( نام نامعلوم ) ایک میرے داہنے طرف تھا، دوسرا بائیں طرف۔ اس وقت نبی کریم صلی اللہ علیہ وسلم مسواک کر رہے تھے۔ دونوں نے نبی کریم صلی اللہ علیہ وسلم سے عہدہ کی درخواست کی۔ آپ صلی اللہ علیہ وسلم نے فرمایا، ابوموسیٰ یا عبداللہ بن قیس! ( راوی کو شک ہے ) میں نے اسی وقت عرض کیا: یا رسول اللہ! اس پروردگار کی قسم جس نے آپ کو سچا پیغمبر بنا کر بھیجا۔ انہوں نے اپنے دل کی بات مجھ سے نہیں کہی تھی اور مجھ کو معلوم نہیں تھا کہ یہ دونوں شخص عہدہ چاہتے ہیں۔ ابوموسیٰ کہتے ہیں جیسے میں اس وقت آپ کی مسواک کو دیکھ رہا ہوں وہ آپ کے ہونٹ کے نیچے اٹھی ہوئی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو کوئی ہم سے عہدہ کی درخواست کرتا ہے ہم اس کو عہدہ نہیں دیتے۔ لیکن ابوموسیٰ یا عبداللہ بن قیس! تو یمن کی حکومت پر جا ( خیر ابوموسیٰ روانہ ہوئے ) اس کے بعد آپ نے معاذ بن جبل رضی اللہ عنہ کو بھی ان کے پیچھے روانہ کیا۔ جب معاذ رضی اللہ عنہ یمن میں ابوموسیٰ رضی اللہ عنہ کے پاس پہنچے تو ابوموسیٰ رضی اللہ عنہ نے ان کے بیٹھنے کے لیے گدا بچھوایا اور کہنے لگے سواری سے اترو گدے پر بیٹھو۔ اس وقت ان کے پاس ایک شخص تھا ( نام نامعلوم ) جس کی مشکیں کسی ہوئی تھیں۔ معاذ رضی اللہ عنہ نے ابوموسیٰ رضی اللہ عنہ سے پوچھا یہ کون شخص ہے؟ انہوں نے کہا یہ یہودی تھا پھر مسلمان ہوا اب پھر یہودی ہو گیا ہے اور ابوموسیٰ رضی اللہ عنہ نے معاذ رضی اللہ عنہ سے کہا اجی تم سواری پر سے اتر کر بیٹھو۔ انہوں نے کہا میں نہیں بیٹھتا جب تک اللہ اور اس کے رسول کے حکم کے موافق یہ قتل نہ کیا جائے گا تین بار یہی کہا۔ آخر ابوموسیٰ رضی اللہ عنہ نے حکم دیا وہ قتل کیا گیا۔ پھر معاذ رضی اللہ عنہ بیٹھے۔ اب دونوں نے رات کی عبادت ( تہجد گزاری ) کا ذکر چھیڑا۔ معاذ رضی اللہ عنہ نے کہا میں تو رات کو عبادت بھی کرتا ہوں اور سوتا بھی ہوں اور مجھے امید ہے کہ سونے میں بھی مجھ کو وہی ثواب ملے گا جو نماز پڑھنے اور عبادت کرنے میں۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6925,
			"arabicnumber": 6925,
			"text": "",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6926,
			"arabicnumber": 6926,
			"text": "ہم سے محمد بن مقاتل ابوالحسن مروزی نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو شعبہ بن حجاج نے، انہوں نے ہشام بن زید بن انس سے، وہ کہتے تھے میں نے اپنے دادا انس بن مالک رضی اللہ عنہ سے سنا، وہ کہتے تھے کہ ایک یہودی نبی کریم صلی اللہ علیہ وسلم کے پاس سے گزرا کہنے لگا «السام عليك‏.‏» یعنی تم مرو۔ نبی کریم صلی اللہ علیہ وسلم نے جواب میں صرف «وعليك‏ ‏‏.‏» کہا ( تو بھی مرے گا ) پھر آپ صلی اللہ علیہ وسلم نے صحابہ رضی اللہ عنہم سے فرمایا کہ تم کو معلوم ہوا، اس نے کیا کہا؟ اس نے «السام عليك‏.‏» کہا۔ صحابہ نے عرض کیا: یا رسول اللہ! ( حکم ہو تو ) اس کو مار ڈالیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا، نہیں۔ جب کتاب والے یہود اور نصاریٰ تم کو سلام کیا کریں تو تم بھی یہی کہا کرو «وعليكم» ۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6927,
			"arabicnumber": 6927,
			"text": "ہم سے ابونعیم نے بیان کیا، انہوں نے سفیان بن عیینہ سے، انہوں نے زہری سے، انہوں نے عروہ سے، انہوں نے عائشہ رضی اللہ عنہا سے، انہوں نے کہا کہ یہود میں سے چند لوگوں نے نبی کریم صلی اللہ علیہ وسلم کے پاس آنے کی اجازت چاہی جب آئے تو کہنے لگے «السام عليك‏.‏» میں نے جواب میں یوں کہا «عليكم السام واللعنة‏.‏» ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اے عائشہ! اللہ تعالیٰ نرمی کرتا ہے اور ہر کام میں نرمی کو پسند کرتا ہے۔ میں نے کہا: یا رسول اللہ! کیا آپ نے ان کا کہنا نہیں سنا آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے بھی تو جواب دے دیا «وعليكم» ۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6928,
			"arabicnumber": 6928,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے، انہوں نے سفیان بن عیینہ، اور امام مالک سے، ان دونوں نے کہا ہم سے عبداللہ بن دینار نے بیان کیا، کہا میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، وہ کہتے تھے نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”یہودی لوگ جب تم مسلمانوں میں سے کسی کو سلام کرتے ہیں تو «سام عليك‏.‏» کہتے ہیں تم بھی جواب میں «عليك» کہا کرو۔“",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6929,
			"arabicnumber": 6929,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے، کہا ہم سے اعمش نے، کہا مجھ سے شقیق ابن سلمہ نے کہ عبداللہ بن مسعود رضی اللہ عنہ نے کہا جیسے میں ( اس وقت ) نبی کریم صلی اللہ علیہ وسلم کو دیکھ رہا ہوں آپ ایک پیغمبر ( نوح علیہ السلام ) کی حکایت بیان کر رہے تھے ان کی قوم والوں نے ان کو اتنا مارا کہ لہولہان کر دیا وہ اپنے منہ سے خون پونچھتے تھے اور یوں دعا کرتے جاتے «رب اغفر لقومي،‏‏‏‏ فإنهم لا يعلمون‏.‏» ”پروردگار میری قوم والوں کو بخش دے وہ نادان ہیں۔“",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6930,
			"arabicnumber": 6930,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم ہمارے سے والد نے، کہا ہم سے اعمش نے، کہا ہم سے خیثمہ بن عبدالرحمٰن نے، کہا ہم سے سوید بن غفلہ نے کہ علی رضی اللہ عنہ نے کہا جب میں تم سے نبی کریم صلی اللہ علیہ وسلم کی کوئی حدیث بیان کروں تو قسم اللہ کی اگر میں آسمان سے نیچے گر پڑوں یہ مجھ کو اس سے اچھا لگتا ہے کہ میں نبی کریم صلی اللہ علیہ وسلم پر جھوٹ باندھوں ہاں جب مجھ میں تم میں آپس میں گفتگو ہو تو اس میں بنا کر بات کہنے میں کوئی قباحت نہیں کیونکہ ( نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہے ) لڑائی تدبیر اور مکر کا نام ہے۔ دیکھو میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اخیر زمانہ قریب ہے جب ایسے لوگ مسلمانوں میں نکلیں گے جو نوعمر بیوقوف ہوں گے ( ان کی عقل میں فتور ہو گا ) ظاہر میں تو ساری خلق کے کلاموں میں جو بہتر ہے ( یعنی حدیث شریف ) وہ پڑھیں گے مگر درحقیقت ایمان کا نور ان کے حلق سے نیچے نہیں اترے گا، وہ دین سے اس طرح باہر ہو جائیں گے جیسے تیر شکار کے جانور سے پار نکل جاتا ہے۔ ( اس میں کچھ لگا نہیں رہتا ) تم ان لوگوں کو جہاں پانا بے تامل قتل کرنا، ان کو جہاں پاؤ قتل کرنے میں قیامت کے دن ثواب ملے گا۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6931,
			"arabicnumber": 6931,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، انہوں نے کہا ہم سے عبدالوہاب نے بیان کیا، کہا میں نے یحییٰ بن سعید انصاری سے سنا، کہا مجھ کو محمد بن ابراہیم تیمی نے خبر دی، انہوں نے ابوسلمہ بن عبدالرحمٰن اور عطاء بن یسار سے، وہ دونوں ابو سعید خدری رضی اللہ عنہ کے پاس آئے اور ان سے پوچھا کیا تم نے حروریہ کے بارے میں کچھ نبی کریم صلی اللہ علیہ وسلم سے سنا ہے؟ انہوں نے کہا حروریہ ( دروریہ ) تو میں جانتا نہیں مگر میں نے نبی کریم صلی اللہ علیہ وسلم سے یہ سنا ہے آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اس امت میں اور یوں نہیں فرمایا اس امت میں سے کچھ لوگ ایسے پیدا ہوں گے کہ تم اپنی نماز کو ان کی نماز کے سامنے حقیر جانو گے اور قرآن کی تلاوت بھی کریں گے مگر قرآن ان کے حلقوں سے نیچے نہیں اترے گا۔ وہ دین سے اس طرح نکل جائیں گے جیسے تیر جانور میں سے پار نکل جاتا ہے اور پھر تیر پھینکنے والا اپنے تیر کو دیکھتا ہے اس کے بعد جڑ میں ( جو کمان سے لگی رہتی ہے ) اس کو شک ہوتا ہے شاید اس میں خون لگا ہو مگر وہ بھی صاف۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6932,
			"arabicnumber": 6932,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا مجھ سے ابن وہب نے، کہا کہ مجھ سے عمر بن محمد بن زید بن عبداللہ بن عمر نے، کہا ان سے ان کے والد نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے اور انہوں نے حروریہ کا ذکر کیا اور کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ وہ اسلام سے اس طرح باہر ہو جائیں گے جس طرح تیر کمان سے باہر ہو جاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6933,
			"arabicnumber": 6933,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم سے ہشام بن یوسف نے بیان کیا، کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں ابوسلمہ بن عبدالرحمٰن بن عوف نے اور ان سے ابوسعید رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم تقسیم فرما رہے تھے کہ عبداللہ بن ذی الخویصرہ تمیمی آیا اور کہا: یا رسول اللہ! انصاف کیجئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ افسوس اگر میں انصاف نہیں کروں گا تو اور کون کرے گا۔ اس پر عمر بن الخطاب رضی اللہ عنہ نے کہا کہ مجھے اجازت دیجئیے کہ میں اس کی گردن مار دوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں اس کے کچھ ایسے ساتھی ہوں گے کہ ان کی نماز اور روزے کے سامنے تم اپنی نماز اور روزے کو حقیر سمجھو گے لیکن وہ دین سے اس طرح باہر ہو جائیں گے جس طرح تیر جانور میں سے باہر نکل جاتا ہے۔ تیر کے پر کو دیکھا جائے لیکن اس پر کوئی نشان نہیں پھر اس پیکان کو دیکھا جائے اور وہاں بھی کوئی نشان نہیں پھر اس کے باڑ کو دیکھا جائے اور یہاں بھی کوئی نشان نہیں پھر اس کی لکڑی کو دیکھا جائے اور وہاں بھی کوئی نشان نہیں کیونکہ وہ ( جانور کے جسم سے تیر چلایا گیا تھا ) لید گوبر اور خون سب سے آگے ( بےداغ ) نکل گیا ( اسی طرح وہ لوگ اسلام سے صاف نکل جائیں گے ) ان کی نشانی ایک مرد ہو گا جس کا ایک ہاتھ عورت کی چھاتی کی طرح یا یوں فرمایا کہ گوشت کے تھل تھل کرتے لوتھڑے کی طرح ہو گا۔ یہ لوگ مسلمانوں میں پھوٹ کے زمانہ میں پیدا ہوں گے۔ ابو سعید خدری رضی اللہ عنہ نے کہا کہ میں گواہی دیتا ہوں کہ میں نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم سے سنی ہے اور میں گواہی دیتا ہوں کہ علی رضی اللہ عنہ نے نہروان میں ان سے جنگ کی تھی اور میں اس جنگ میں ان کے ساتھ تھا اور ان کے پاس ان لوگوں کے ایک شخص کو قیدی بنا کر لایا گیا تو اس میں وہی تمام چیزیں تھیں جو نبی کریم صلی اللہ علیہ وسلم نے بیان فرمائی تھیں۔ راوی نے بیان کیا کہ پھر قرآن مجید کی یہ آیت نازل ہوئی «ومنهم من يلمزك في الصدقات‏» کہ ”ان میں سے بعض وہ ہیں جو آپ کے صدقات کی تقسیم میں عیب پکڑتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6934,
			"arabicnumber": 6934,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے عبدالواحد بن زیادہ نے، کہا ہم سے سلمان شیبانی نے، کہا ہم سے یسیر بن عمرو نے بیان کیا کہ میں نے سہل بن حنیف ( بدری صحابی ) رضی اللہ عنہ سے پوچھا کیا تم نے نبی کریم صلی اللہ علیہ وسلم کو خوارج کے سلسلے میں کچھ فرماتے ہوئے سنا ہے، انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا ہے اور آپ نے عراق کی طرف ہاتھ سے اشارہ فرمایا تھا کہ ادھر سے ایک جماعت نکلے گی یہ لوگ قرآن مجید پڑھیں گے لیکن قرآن مجید ان کے حلقوں سے نیچے نہیں اترے گا۔ وہ اسلام سے اس طرح باہر ہو جائیں گے جیسے تیر شکار کے جانور سے باہر نکل جاتا ہے۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6935,
			"arabicnumber": 6935,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، کہا ہم سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”قیامت اس وقت تک قائم نہیں ہو گی جب تک دو ایسے گروہ آپس میں جنگ نہ کریں جن کا دعویٰ ایک ہی ہو۔“",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6936,
			"arabicnumber": 6936,
			"text": "اور ابوعبداللہ امام بخاری رحمہ اللہ نے بیان کیا، ان سے لیث بن سعد نے بیان کیا انہوں نے کہا کہ مجھ سے یونس نے بیان کیا، ان سے ابن شہاب نے بیان کیا، انہوں نے کہا مجھ کو عروہ بن زبیر نے خبر دی، انہیں مسور بن مخرمہ اور عبدالرحمٰن بن عبدالقاری نے خبر دی، ان دونوں نے عمر بن الخطاب رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ میں نے ہشام بن حکیم کو نبی اکرم صلی اللہ علیہ وسلم کی زندگی میں سورۃ الفرقان پڑھتے سنا جب غور سے سنا تو وہ بہت سی ایسی قراتوں کے ساتھ پڑھ رہے تھے جن سے نبی کریم صلی اللہ علیہ وسلم نے مجھے نہیں پڑھایا تھا۔ قریب تھا کہ نماز ہی میں، میں ان پر حملہ کر دیتا لیکن میں نے انتظار کیا اور جب انہوں نے سلام پھیرا تو ان کی چادر سے یا ( انہوں نے یہ کہا کہ ) اپنی چادر سے میں نے ان کی گردن میں پھندا ڈال دیا اور ان سے پوچھا کہ اس طرح تمہیں کس نے پڑھایا ہے؟ انہوں نے کہا کہ مجھے اس طرح رسول اللہ صلی اللہ علیہ وسلم نے پڑھایا ہے۔ میں نے ان سے کہا کہ جھوٹ بولتے ہو، واللہ یہ سورت مجھے بھی نبی کریم صلی اللہ علیہ وسلم نے پڑھائی ہے جو میں نے تمہیں ابھی پڑھتے سنا ہے۔ چنانچہ میں انہیں کھینچتا ہوا نبی کریم صلی اللہ علیہ وسلم کے پاس لایا اور عرض کیا: یا رسول اللہ! میں نے اسے سورۃ الفرقان اور طرح پر پڑھتے سنا ہے جس طرح آپ نے مجھے نہیں پڑھائی تھی۔ آپ صلی اللہ علیہ وسلم نے مجھے بھی سورۃ الفرقان پڑھائی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عمر! انہیں چھوڑ دو۔ ہشام سورت پڑھو۔ انہوں نے اسی طرح پڑھ کر سنایا جس طرح میں نے انہیں پڑھتے سنا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اسی طرح نازل ہوئی تھی پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عمر! اب تم پڑھو۔ میں نے پڑھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسی طرح نازل ہوئی تھی پھر فرمایا یہ قرآن سات قراتوں میں نازل ہوا ہے پس تمہیں جس طرح آسانی ہو پڑھو۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6937,
			"arabicnumber": 6937,
			"text": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم کو وکیع نے خبر دی (دوسری سند) امام بخاری رحمہ اللہ نے کہا، ہم سے یحییٰ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، کہا ہم سے اعمش نے، ان سے ابراہیم نے، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ جب یہ آیت نازل ہوئی «الذين آمنوا ولم يلبسوا إيمانهم بظلم‏» ”وہ لوگ جو ایمان لے آئے اور اپنے ایمان کے ساتھ ظلم کو نہیں ملایا“ تو صحابہ کو یہ معاملہ بہت مشکل نظر آیا اور انہوں نے کہا ہم میں کون ہو گا جو ظلم نہ کرتا ہو۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کا مطلب وہ نہیں ہے جو تم سمجھتے ہو بلکہ اس کا مطلب لقمان علیہ السلام کے اس ارشاد میں ہے جو انہوں نے اپنے لڑکے سے کہا تھا «يا بنى لا تشرك بالله إن الشرك لظلم عظيم‏» کہ ”اے بیٹے! اللہ کے ساتھ کسی کو شریک نہ ٹھہرانا، بلاشبہ شرک کرنا بہت بڑا ظلم ہے۔“",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6938,
			"arabicnumber": 6938,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں محمود بن الربیع نے خبر دی، کہا کہ میں نے عتبان بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ صبح کے وقت نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے پھر ایک صاحب نے پوچھا کہ مالک بن الدخشن کہاں ہیں؟ ہمارے قبیلہ کے ایک شخص نے جواب دیا کہ وہ منافق ہے، اللہ اور اس کے رسول سے اسے محبت نہیں ہے۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ کیا تم ایسا نہیں سمجھتے کہ وہ کلمہ لا الہٰ الا اللہ کا اقرار کرتا ہے اور اس کا مقصد اس سے اللہ کی رضا ہے۔ اس صحابی نے کہا کہ ہاں یہ تو ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر جو بندہ بھی قیامت کے دن اس کلمہ کو لے کر آئے گا، اللہ تعالیٰ اس پر جہنم کو حرام کر دے گا۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6939,
			"arabicnumber": 6939,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ وضاح شکری نے بیان کیا، ان سے حصین بن عبدالرحمٰن سلمی نے، ان سے فلاں شخص (سعید بن عبیدہ) نے کہ ابوعبدالرحمٰن اور حبان بن عطیہ کا آپس میں اختلاف ہوا۔ ابوعبدالرحمٰن نے حبان سے کہا کہ آپ کو معلوم ہے کہ آپ کے ساتھی خون بہانے میں کس قدر جری ہو گئے ہیں۔ ان کا اشارہ علی رضی اللہ عنہ کی طرف تھا اس پر حبان نے کہا انہوں نے کیا کیا ہے، تیرا باپ نہیں۔ ابوعبدالرحمٰن نے کہا کہ علی رضی اللہ عنہ کہتے تھے کہ مجھے، زبیر اور ابومرثد رضی اللہ عنہم کو رسول اللہ صلی اللہ علیہ وسلم نے بھیجا اور ہم سب گھوڑوں پر سوار تھے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور جب روضہ خاخ پر پہنچو ( جو مدینہ سے بارہ میل کے فاصلہ پر ایک جگہ ہے ) ابوسلمہ نے بیان کیا کہ ابوعوانہ نے خاخ کے بدلے حاج کہا ہے۔ تو وہاں تمہیں ایک عورت ( سارہ نامی ) ملے گی اور اس کے پاس حاطب بن ابی بلتعہ کا ایک خط ہے جو مشرکین مکہ کو لکھا گیا ہے تم وہ خط میرے پاس لاؤ۔ چنانچہ ہم اپنے گھوڑوں پر دوڑے اور ہم نے اسے وہیں پکڑا جہاں نبی کریم صلی اللہ علیہ وسلم نے بتایا تھا۔ وہ عورت اپنے اونٹ پر سوار جا رہی تھی حاطب بن ابی بلتعہ رضی اللہ عنہ نے اہل مکہ کو نبی کریم صلی اللہ علیہ وسلم کی مکہ کو آنے کی خبر دی تھی۔ ہم نے اس عورت سے کہا کہ تمہارے پاس وہ خط کہاں ہے اس نے کہا کہ میرے پاس تو کوئی خط نہیں ہے ہم نے اس کا اونٹ بٹھا دیا اور اس کے کجاوہ کی تلاشی لی لیکن اس میں کوئی خط نہیں ملا۔ میرے ساتھی نے کہا کہ اس کے پاس کوئی خط نہیں معلوم ہوتا۔ راوی نے بیان کیا کہ ہمیں یقین ہے کہ نبی کریم صلی اللہ علیہ وسلم نے غلط بات نہیں فرمائی پھر علی رضی اللہ عنہ نے قسم کھائی کہ اس ذات کی قسم جس کی قسم کھائی جاتی ہے خط نکال دے ورنہ میں تجھے ننگی کروں گا اب وہ عورت اپنے نیفے کی طرف جھکی اس نے ایک چادر کمر پر باندھ رکھی تھی اور خط نکالا۔ اس کے بعد یہ لوگ خط نبی کریم صلی اللہ علیہ وسلم کے پاس لائے۔ عمر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! اس نے اللہ اور اس کے رسول اور مسلمانوں کے ساتھ خیانت کی ہے، مجھے اجازت دیجئیے کہ میں اس کی گردن مار دوں۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا، حاطب! تم نے ایسا کیوں کیا؟ حاطب رضی اللہ عنہ نے کہا: یا رسول اللہ! بھلا کیا مجھ سے یہ ممکن ہے کہ میں اللہ اور اس کے رسول پر ایمان نہ رکھوں میرا مطلب اس خط کے لکھنے سے صرف یہ تھا کہ میرا ایک احسان مکہ والوں پر ہو جائے جس کی وجہ سے میں اپنی جائیداد اور بال بچوں کو ( ان کے ہاتھ سے ) بچا لوں۔ بات یہ ہے کہ آپ کے اصحاب میں کوئی ایسا نہیں جس کے مکہ میں ان کی قوم میں کے ایسے لوگ نہ ہوں جس کی وجہ سے اللہ ان کے بچوں اور جائیداد پر کوئی آفت نہیں آنے دیتا۔ مگر میرا وہاں کوئی نہیں ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ حاطب نے سچ کہا ہے۔ بھلائی کے سوا ان کے بارے میں اور کچھ نہ کہو۔ بیان کیا کہ عمر رضی اللہ عنہ نے دوبارہ کہا کہ یا رسول اللہ صلی اللہ علیہ وسلم اس نے اللہ اور اس کے رسول اور مومنوں کے ساتھ خیانت کی ہے۔ مجھے اجازت دیجئیے کہ میں اس کی گردن مار دوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کیا یہ جنگ بدر میں شریک ہونے والوں میں سے نہیں ہیں؟ تمہیں کیا معلوم اللہ تعالیٰ ان کے اعمال سے واقف تھا اور پھر فرمایا کہ جو چاہو کرو میں نے جنت تمہارے لیے لکھ دی ہے اس پر عمر رضی اللہ عنہ کی آنکھوں میں ( خوشی سے ) آنسو بھر آئے اور عرض کیا: اللہ اور اس کے رسول ہی کو حقیقت کا زیادہ علم ہے۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ «خاخ» زیادہ صحیح ہے لیکن ابوعوانہ نے «حاج» ہی بیان کیا ہے اور لفظ «حاج» بدلا ہوا ہے یہ ایک جگہ کا نام ہے اور ہشیم نے «خاخ» بیان کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 21
			}
		}
	]
}