{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6953,
			"arabicnumber": 6953,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے یحییٰ بن سعید انصاری نے، ان سے محمد بن ابراہیم تیمی نے، ان سے علقمہ بن وقاص لیثی نے بیان کیا کہ میں نے عمر بن خطاب رضی اللہ عنہ سے خطبہ میں سنا انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا تھا: اے لوگو! اعمال کا دارومدار نیتوں پر ہے اور ہر شخص کو وہی ملے گا جس کی وہ نیت کرے گا پس جس کی ہجرت اللہ اور اس کے رسول کی طرف ہو اسے ہجرت ( کا ثواب ملے گا ) اور جس کی ہجرت کا مقصد دنیا ہو گی کہ جسے وہ حاصل کر لے یا کوئی عورت ہو گی جس سے وہ شادی کر لے تو اس کی ہجرت اسی کے لیے ہو گی جس کے لیے اس نے ہجرت کی ہے۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6954,
			"arabicnumber": 6954,
			"text": "مجھ سے اسحاق نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ان سے معمر نے، ان سے ہمام نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اللہ تعالیٰ تم میں سے کسی ایسے شخص کی نماز قبول نہیں کرتا جسے وضو کی ضرورت ہو یہاں تک کہ وہ وضو کر لے۔“",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6955,
			"arabicnumber": 6955,
			"text": "ہم سے محمد بن عبداللہ الانصاری نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، کہا ہم سے ثمامہ بن عبداللہ بن انس نے بیان کیا، اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ ابوبکر رضی اللہ عنہ نے انہیں ( زکوٰۃ ) کا حکم نامہ لکھ کر بھیجا جو رسول اللہ صلی اللہ علیہ وسلم نے فرض قرار دیا تھا کہ متفرق صدقہ کو ایک جگہ جمع نہ کیا جائے اور نہ مجتمع صدقہ کو متفرق کیا جائے زکوٰۃ کے خوف سے۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6956,
			"arabicnumber": 6956,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے اسماعیل بن جعفر نے بیان کیا، ان سے ابوسہیل نافع نے، ان سے ان کے والد مالک بن ابی عامر نے، اور ان سے طلحہ بن عبیداللہ رضی اللہ عنہ نے کہ ایک دیہاتی ( ضمام بن ثعلبہ ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اس حال میں حاضر ہوا کہ اس کے سر کے بال پراگندہ تھے اور عرض کیا: یا رسول اللہ! مجھے بتائیے کہ اللہ تعالیٰ نے مجھ پر کتنی نمازیں فرض کی ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پانچ وقت کی نمازیں۔ سوا ان نمازوں کے جو تم نفلی پڑھو۔ اس نے کہا مجھے بتائیے کہ اللہ تعالیٰ نے کتنے روزے فرض کئے ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ رمضان کے مہینے کے روزے سوا ان کے جو تم نفلی رکھو۔ اس نے پوچھا مجھے بتائیے کہ اللہ تعالیٰ نے زکوٰۃ کتنی فرض کی ہے؟ بیان کیا کہ اس پر نبی کریم صلی اللہ علیہ وسلم نے زکوٰۃ کے مسائل بیان کئے۔ پھر اس دیہاتی نے کہا اس ذات کی قسم جس نے آپ کو یہ عزت بخشی ہے جو اللہ تعالیٰ نے مجھ پر فرض کیا ہے اس میں نہ میں کسی قسم کی زیادتی کروں گا اور نہ کمی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر اس نے صحیح کہا ہے تو جنت میں جائے گا اور بعض لوگوں نے کہا کہ ایک سو بیس اونٹوں میں دو حصے تین تین برس کی دو اونٹنیاں جو چوتھے برس میں لگی ہوں زکوٰۃ میں لازم آتی ہیں پس مگر کسی نے ان اونٹوں کو عمداً تلف کر ڈالا ( مثلاً ذبح کر دیا ) اور کوئی حیلہ کیا تو اس کے اوپر سے زکوٰۃ ساقط ہو گی۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6958,
			"arabicnumber": 6958,
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6959,
			"arabicnumber": 6959,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے ابن شہاب نے، ان سے عبیداللہ بن عتبہ نے، اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ سعد بن عبادہ انصاری رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے ایک نذر کے بارے میں سوال کیا جو ان کی والدہ پر تھی اور ان کی وفات نذر پوری کرنے سے پہلے ہی ہو گئی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تو ان کی طرف سے پوری کر۔ اس کے باوجود بعض لوگ یہ کہتے ہیں کہ جب اونٹ کی تعداد بیس ہو جائے تو اس میں چار بکریاں لازم ہیں۔ پس اگر سال پورا ہونے سے پہلے اونٹ کو ہبہ کر دے یا اسے بیچ دے۔ زکوٰۃ سے بچنے یا حیلہ کے طور پر تاکہ زکوٰۃ اس پر ختم ہو جائے تو اس پر کوئی چیز واجب نہیں ہو گی۔ یہی حال اس صورت میں ہے اگر اس نے ضائع کر دیا اور پھر مر گیا تو اس کے مال پر کچھ واجب نہیں ہو گا۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6960,
			"arabicnumber": 6960,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے عبیداللہ نے بیان کیا، انہوں نے کہا کہ مجھ سے نافع نے بیان کیا، اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے شغار سے منع فرمایا۔ میں نے نافع سے پوچھا شغار کیا ہے؟ انہوں نے کہا یہ کہ کوئی شخص بغیر مہر کسی کی لڑکی سے نکاح کرتا ہے یا اس سے بغیر مہر کے اپنی لڑکی کا نکاح کرتا ہے پس اس کے سوا کوئی مہر مقرر نہ ہو اور بعض لوگوں نے کہا اگر کسی نے حیلہ کر کے نکاح شغار کر لیا تو نکاح کا عقد درست ہو گا اور شرط لغو ہو گی ( اور ہر ایک کو مہر مثل عورت کا ادا کرنا ہو گا ) اور ہاں بعض لوگوں نے متعہ میں کہا ہے کہ وہاں نکاح بھی فاسد ہے اور شرط بھی باطل ہے اور بعض یہ کہتے ہیں کہ متعہ اور شغار دونوں جائز ہوں گے اور شرط باطل ہو گی۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6961,
			"arabicnumber": 6961,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ قطان نے بیان کیا، ان سے عبیداللہ بن عمر نے بیان کیا، انہوں نے کہا کہ ہم سے زہری نے بیان کیا، ان سے حسن اور عبداللہ بن محمد بن علی نے بیان کیا، ان سے ان کے والد نے کہ علی رضی اللہ عنہ سے کہا گیا کہ عبداللہ بن عباس رضی اللہ عنہما عورتوں کے متعہ میں کوئی حرج نہیں سمجھتے انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کی لڑائی کے موقع پر متعہ سے اور پالتو گدھوں کے گوشت سے منع کر دیا تھا اور بعض لوگ کہتے ہیں کہ اگر کسی نے حیلہ سے متعہ کر لیا تو نکاح فاسد ہے اور بعض لوگوں نے کہا کہ نکاح جائز ہو جائے گا اور میعاد کی شرط باطل ہو جائے گی۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6962,
			"arabicnumber": 6962,
			"text": "ہم سے اسماعیل نے بیان کیا، کہ ہم سے امام مالک نے، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”بچا ہوا بےضرورت پانی اس لیے نہ روکا جائے کہ اس کی وجہ سے بچی ہوئی گھاس بھی بچی رہے ( اس میں بھی حیلہ سازی سے روکا گیا ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6963,
			"arabicnumber": 6963,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے امام مالک نے ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے بیع نجش سے منع فرمایا۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6964,
			"arabicnumber": 6964,
			"text": "ہم سے اسماعیل نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، ان سے عبداللہ بن دینار نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ ایک صحابی نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ وہ خرید و فروخت میں دھوکہ کھا جاتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب تم کچھ خریدا کرو تو کہہ دیا کرو کہ اس میں کوئی دھوکہ نہ ہونا چاہئے۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6965,
			"arabicnumber": 6965,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے کہ عروہ ان سے بیان کرتے تھے کہ عائشہ رضی اللہ عنہا نے آیت «وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء‏» ”اور اگر تمہیں خوف ہو کہ تم یتیموں کے بارے میں انصاف نہیں کر سکو گے تو پھر دوسری عورتوں سے نکاح کرو جو تمہیں پسند ہوں۔“ آپ نے کہا کہ اس آیت میں ایسی یتیم لڑکی کا ذکر ہے جو اپنے ولی کی پرورش میں ہو اور ولی لڑکی کے مال اور اس کے حسن سے رغبت رکھتا ہو اور چاہتا ہو کہ عورتوں ( کے مہر وغیرہ کے متعلق ) جو سب سے معمولی طریقہ ہے اس کے مطابق اس سے نکاح کرے تو ایسے ولیوں کو ان لڑکیوں کے نکاح سے منع کیا گیا ہے۔ سوا اس صورت کے کہ ولی مہر کو پورا کرنے میں انصاف سے کام لے۔ پھر لوگوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے بعد مسئلہ پوچھا تو اللہ تعالیٰ نے یہ آیت نازل کی «ويستفتونك في النساء‏» ”اور لوگ آپ سے عورتوں کے بارے میں مسئلہ پوچھتے ہیں۔“ اور اس واقعہ کا ذکر کیا۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6966,
			"arabicnumber": 6966,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے عبداللہ بن دینار نے، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا، کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ہر دھوکہ دینے والے کے لیے قیامت کے دن ایک جھنڈا ہو گا جس کے ذریعہ وہ پہچانا جائے گا۔“",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6967,
			"arabicnumber": 6967,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، ان سے سفیان نے، ان سے ہشام نے، ان سے عروہ نے، ان سے زینت بنت ام سلمہ نے اور ان سے ام سلمہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میں تمہارے ہی جیسا انسان ہوں اور بعض اوقات جب تم باہمی جھگڑا لاتے ہو تو ممکن ہے کہ تم میں سے بعض اپنے فریق مخالف کے مقابلہ میں اپنا مقدمہ پیش کرنے میں زیادہ چالاکی سے بولنے والا ہو اور اس طرح میں اس کے مطابق فیصلہ کر دوں جو میں تم سے سنتا ہوں۔ پس جس شخص کے لیے بھی اس کے بھائی کے حق میں سے، میں کسی چیز کا فیصلہ کر دوں تو وہ اسے نہ لے۔ کیونکہ اس طرح میں اسے جہنم کا ایک ٹکڑا دیتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6968,
			"arabicnumber": 6968,
			"text": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ہشام نے بیان کیا، کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کسی کنواری لڑکی کا نکاح اس وقت تک نہ کیا جائے جب تک اس کی اجازت نہ لے لی جائے اور کسی بیوہ کا نکاح اس وقت تک نہ کیا جائے جب تک اس کا حکم نہ معلوم کر لیا جائے۔“ پوچھا گیا: یا رسول اللہ! اس ( کنواری ) کی اجازت کی کیا صورت ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کی خاموشی اجازت ہے۔ اس کے باوجود بعض لوگ کہتے ہیں کہ اگر کنواری لڑکی سے اجازت نہ لی گئی اور نہ اس نے نکاح کیا۔ لیکن کسی شخص نے حیلہ کر کے دو جھوٹے گواہ کھڑے کر دئیے کہ اس نے لڑکی سے نکاح کیا ہے اس کی مرضی سے اور قاضی نے بھی اس کے نکاح کا فیصلہ کر دیا۔ حالانکہ شوہر جانتا ہے کہ وہ جھوٹا ہے کہ گواہی جھوٹی تھی اس کے باوجود اس لڑکی سے صحبت کرنے میں اس کے لیے کوئی حرج نہیں ہے بلکہ یہ نکاح صحیح ہو گا۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6969,
			"arabicnumber": 6969,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان نے، کہا ہم سے یحییٰ بن سعید نے، ان سے قاسم نے کہ جعفر رضی اللہ عنہ کی اولاد میں سے ایک خاتون کو اس کا خطرہ ہوا کہ ان کا ولی ( جن کی وہ زیر پرورش تھیں ) ان کا نکاح کر دے گا۔ حالانکہ وہ اس نکاح کو ناپسند کرتی تھیں۔ چنانچہ انہوں نے قبیلہ انصار کے دو شیوخ عبدالرحمٰن اور مجمع کو جو جاریہ کے بیٹے تھے کہلا بھیجا انہوں نے تسلی دی کہ کوئی خوف نہ کریں۔ کیونکہ خنساء بنت خذام رضی اللہ عنہا کا نکاح ان کے والد نے ان کی ناپسندیدگی کے باوجود کر دیا تھا تو رسول اللہ صلی اللہ علیہ وسلم نے اس نکاح کو رد کر دیا تھا۔ سفیان نے بیان کیا کہ میں نے عبدالرحمٰن کو اپنے والد سے یہ کہتے ہوئے سنا ہے کہ خنساء رضی اللہ عنہا آخر حدیث تک بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6970,
			"arabicnumber": 6970,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے شیبان نے بیان کیا، ان سے یحییٰ نے، ان سے ابوسلمہ نے، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کسی بیوہ سے اس وقت تک شادی نہ کی جائے جب تک اس کا حکم نہ معلوم کر لیا جائے اور کسی کنواری سے اس وقت تک نکاح نہ کیا جائے جب تک اس کی اجازت نہ لے لی جائے۔ صحابہ نے پوچھا: اس کی اجازت کا کیا طریقہ ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، یہ کہ وہ خاموش ہو جائے۔ پھر بھی بعض لوگ کہتے ہیں کہا اگر کسی شخص نے دو جھوٹے گواہوں کے ذریعہ حیلہ کیا ( اور یہ جھوٹ گھڑا ) کہ کسی بیوہ عورت سے اس نے اس کی اجازت سے نکاح کیا ہے اور قاضی نے بھی اس مرد سے اس کے نکاح کا فیصلہ کر دیا جبکہ اس مرد کو خوب خبر ہے کہ اس نے اس عورت سے نکاح نہیں کیا ہے تو یہ نکاح جائز ہے اور اس کے لیے اس عورت کے ساتھ رہنا جائز ہو جائے گا۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6971,
			"arabicnumber": 6971,
			"text": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا، ان سے ابن جریج نے، ان سے ابن ابی ملیکہ نے، ان سے ذکوان نے، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کنواری لڑکی سے اجازت لی جائے گی۔“ میں نے پوچھا کہ کنواری لڑکی شرمائے گی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کی خاموشی ہی اجازت ہے۔ اور بعض لوگوں کا کہنا ہے کہ کوئی شخص اگر کسی یتیم لڑکی یا کنواری لڑکی سے نکاح کا خواہشمند ہو۔ لیکن لڑکی راضی نہ ہو اس پر اس نے حیلہ کیا اور دو جھوٹے گواہوں کی گواہی اس کی دلائی کہ اس نے لڑکی سے شادی کر لی ہے پھر جب وہ لڑکی جوان ہوئی اور اس نکاح سے وہ بھی راضی ہو گئی اور قاضی نے اس جھوٹی شہادت کو قبول کر لیا حالانکہ وہ جانتا ہے کہ یہ سارا ہی جھوٹ اور فریب ہے تب بھی اس سے جماع کرنا جائز ہے۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6972,
			"arabicnumber": 6972,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ نے، ان سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم حلوہ ( یعنی میٹھی چیز ) اور شہد پسند کرتے تھے اور عصر کی نماز سے فارغ ہونے کے بعد اپنی ازواج سے ( ان میں سے کسی کے حجرہ میں جانے کے لیے ) اجازت لیتے تھے اور ان کے پاس جاتے تھے۔ ایک مرتبہ آپ حفصہ رضی اللہ عنہا کے گھر گئے اور ان کے یہاں اس سے زیادہ دیر تک ٹھہرے رہے جتنی دیر تک ٹھہرنے کا آپ کا معمول تھا۔ میں نے اس کے متعلق نبی کریم صلی اللہ علیہ وسلم سے پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کی قوم کی ایک خاتون نے شہد کی ایک کپی انہیں ہدیہ کی تھی اور انہوں نے نبی کریم صلی اللہ علیہ وسلم کو اس کا شربت پلایا تھا۔ میں نے اس پر کہا کہ اب میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک حیلہ کروں گی چنانچہ میں نے اس کا ذکر سودہ رضی اللہ عنہا سے کیا اور کہا جب نبی کریم صلی اللہ علیہ وسلم آپ کے یہاں آئیں تو آپ کے قریب بھی آئیں گے اس وقت تم آپ سے کہنا یا رسول اللہ! شاید آپ نے مغافیر کھایا ہے؟ اس پر آپ جواب دیں گے کہ نہیں۔ تم کہنا کہ پھر یہ بو کس چیز کی ہے؟ نبی کریم صلی اللہ علیہ وسلم کو یہ بات بہت ناگوار تھی کہ آپ کے جسم کے کسی حصہ سے بو آئے۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم اس کا جواب یہ دیں گے کہ حفصہ نے مجھے شہد کا شربت پلایا تھا۔ اس پر کہنا کہ شہد کی مکھیوں نے غرفط کا رس چوسا ہو گا اور میں بھی نبی کریم صلی اللہ علیہ وسلم سے یہی بات کہوں گی اور صفیہ تم بھی نبی کریم صلی اللہ علیہ وسلم سے یہ کہنا چنانچہ جب نبی کریم صلی اللہ علیہ وسلم سودہ کے یہاں تشریف لے گئے تو ان کا بیان ہے کہ اس ذات کی قسم جس کے سوا کوئی معبود نہیں کہ تمہارے خوف سے قریب تھا کہ میں اس وقت نبی کریم صلی اللہ علیہ وسلم سے یہ بات جلدی میں کہہ دیتی جبکہ آپ دروازے ہی پر تھے۔ آخر جب نبی کریم صلی اللہ علیہ وسلم قریب آئے تو میں نے عرض کیا: یا رسول اللہ! آپ نے مغافیر کھایا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ میں نے کہا پھر بو کیسی ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ حفصہ نے مجھے شہد کا شربت پلایا ہے میں نے کہا اس شہد کی مکھیوں نے غرفط کا رس چوسا ہو گا اور صفیہ رضی اللہ عنہا کے پاس جب آپ تشریف لے گئے تو انہوں نے بھی یہی کہا۔ اس کے بعد جب حفصہ کے پاس آپ صلی اللہ علیہ وسلم گئے تو انہوں نے عرض کیا: یا رسول اللہ! وہ شہد میں پھر آپ کو پلاؤں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کی ضرورت نہیں۔ بیان کیا ہے کہ اس پر سودہ رضی اللہ عنہا بولیں۔ سبحان اللہ یہ ہم نے کیا کیا گویا شہد آپ پر حرام کر دیا، میں نے کہا چپ رہو۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6973,
			"arabicnumber": 6973,
			"text": "ہم سے عبداللہ بن مسلمہ قعبنی نے بیان کیا، کہا ہم سے امام مالک نے، ان سے ابن شہاب نے، ان سے عبداللہ ابن عامر بن ربیعہ نے کہ عمر بن خطاب رضی اللہ عنہ ( سنہ 18 ھ ماہ ربیع الثانی میں ) شام تشریف لے گئے۔ جب مقام سرغ پر پہنچے تو ان کو یہ خبر ملی کہ شام وبائی بیماری کی لپیٹ میں ہے۔ پھر عبدالرحمٰن بن عوف رضی اللہ عنہ نے انہیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جب تمہیں معلوم ہو جائے کہ کسی سر زمین میں وبا پھیلی ہوئی ہے تو اس میں داخل مت ہو، لیکن اگر کسی جگہ وبا پھوٹ پڑے اور تم وہیں موجود ہو تو وبا سے بھاگنے کے لیے تم وہاں سے نکلو بھی مت۔ چنانچہ عمر رضی اللہ عنہ مقام سرغ سے واپس آ گئے۔ اور ابن شہاب سے روایت ہے، ان سے سالم بن عبداللہ نے کہ عمر رضی اللہ عنہ عبدالرحمٰن بن عوف رضی اللہ عنہ کی حدیث سن کر واپس ہو گئے تھے۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6974,
			"arabicnumber": 6974,
			"text": "ہم سے ابوالیمان نے بیان کیا ‘ کہا ہم سے شعیب نے بیان کیا ‘ ان سے زہری نے ‘ ان سے عامر بن سعد بن ابی وقاص نے کہ انہوں نے اسامہ بن زید رضی اللہ عنہما سے سنا ‘ وہ سعد بن ابی وقاص رضی اللہ عنہ سے حدیث نقل کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے طاعون کا ذکر کیا اور فرمایا کہ یہ ایک عذاب ہے جس کے ذریعہ بعض امتوں کو عذاب دیا گیا تھا اس کے بعد اس کا کچھ حصہ باقی رہ گیا ہے اور وہ کبھی چلا جاتا ہے اور کبھی واپس آ جاتا ہے۔ پس جو شخص کسی سر زمین پر اس کے پھیلنے کے متعلق سنے تو وہاں نہ جائے لیکن اگر کوئی کسی جگہ ہو اور وہاں یہ وبا پھوٹ پڑے تو وہاں سے بھاگے بھی نہیں۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6975,
			"arabicnumber": 6975,
			"text": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے ایوب سختیانی نے ‘ ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اپنے ہبہ کو واپس لینے والا اس کتے کی طرح ہے جو اپنی قے کو خود چاٹ جاتا ہے ‘ ہمارے لیے بری مثال مناسب نہیں۔“",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6976,
			"arabicnumber": 6976,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ‘ انہوں نے کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں ابوسلمہ نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے شفعہ کا حکم ہر اس چیز میں دیا تھا جو تقسیم نہ ہو سکتی ہو۔ پس جب حد بندی ہو جائے اور راستے الگ الگ کر دئیے جائیں تو پھر شفعہ نہیں۔ اور بعض لوگ کہتے ہیں کہ شفعہ کا حق پڑوسی کو بھی ہوتا ہے پھر خود ہی اپنی بات کو غلط قرار دیا اور کہا کہ اگر کسی نے کوئی گھر خریدا اور اسے خطرہ ہے کہ اس کا پڑوسی حق شفعہ کی بنا پر اس سے گھر لے لے گا تو اس نے اس کے سو حصے کر کے ایک حصہ اس میں سے پہلے خرید لیا اور باقی حصے بعد میں خریدے تو ایسی صورت میں پہلے حصے میں تو پڑوسی کو شفعہ کا حق ہو گا۔ گھر کے باقی حصوں میں اسے یہ حق نہیں ہو گا اور اس کے لیے جائز ہے کہ یہ حیلہ کرے۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6977,
			"arabicnumber": 6977,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے ابراہیم بن میسرہ نے بیان کیا ‘ انہوں نے عمرو بن شرید سے سنا ‘ انہوں نے بیان کیا کہ مسور بن مخرمہ رضی اللہ عنہ آئے اور انہوں نے میرے مونڈھے پر اپنا ہاتھ رکھا پھر میں ان کے ساتھ سعد بن ابی وقاص رضی اللہ عنہ کے یہاں گیا تو ابورافع نے اس پر کہا کہ اس کا چار سو سے زیادہ میں نہیں دے سکتا اور وہ بھی قسطوں میں دوں گا۔ اس پر انہوں نے جواب دیا کہ مجھے تو اس کے پانچ سو نقد مل رہے تھے اور میں نے انکار کر دیا۔ اگر میں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ نہ سنا ہوتا کہ پڑوسی زیادہ مستحق ہے تو میں اسے تمہیں نہ بیچتا۔ علی بن عبداللہ مدینی نے کہا میں نے سفیان بن عیینہ سے اس پر پوچھا کہ معمر نے اس طرح نہیں بیان کیا ہے۔ سفیان نے کہا کہ لیکن مجھ سے تو ابراہیم بن میسرہ نے یہ حدیث اسی طرح نقل کی۔ اور بعض لوگ کہتے ہیں کہ اگر کوئی شخص چاہے کہ شفیع کو حق شفعہ نہ دے تو اسے حیلہ کرنے کی اجازت ہے اور حیلہ یہ ہے کہ جائیداد کا مالک خریدار کو وہ جائیداد ہبہ کر دے پھر خریدار یعنی موہوب لہ اس ہبہ کے معاوضہ میں مالک جائیداد کو ہزار درہم مثلاً ہبہ کر دے اس صورت میں شفیع کو شفعہ کا حق نہ رہے گا۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6978,
			"arabicnumber": 6978,
			"text": "ہم سے محمد بن یوسف نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، ان سے ابراہیم بن میسرہ نے بیان کیا، ان سے عمرو بن شرید نے، ان سے ابورافع نے کہ سعد رضی اللہ عنہ نے ان کے ایک گھر کی چار سو مثقال قیمت لگائی تو انہوں نے کہا کہ اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے نہ سنا ہوتا کہ پڑوسی اپنے پڑوس کا زیادہ مستحق ہے تو میں اسے تمہیں نہ دیتا۔ اور بعض لوگ کہتے ہیں کہ اگر کسی نے کسی گھر کا حصہ خریدا اور چاہا کہ اس کا حق شفہ باطل کر دے تو اسے اس گھر کو اپنے چھوٹے بیٹے کو ہبہ کر دینا چاہیے، اب نابالغ پر قسم بھی نہیں ہو گی۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6979,
			"arabicnumber": 6979,
			"text": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے ہشام نے ‘ ان سے ان کے والد عروہ نے اور ان سے ابوحمید الساعدی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو بنی سلیم کے صدقات کی وصولی کے لیے عامل بنایا ان کا نام ابن اللتیبہ تھا پھر جب یہ عامل واپس آیا اور نبی کریم صلی اللہ علیہ وسلم نے ان کا حساب لیا ‘ اس نے سرکاری مال علیحدہ کیا اور کچھ مال کی نسبت کہنے لگا کہ یہ ( مجھے ) تحفہ میں ملا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ پھر کیوں نہ تم اپنے ماں باپ کے گھر بیٹھے رہے اگر تم سچے ہو تو وہیں یہ تحفہ تمہارے پاس آ جاتا۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے ہمیں خطبہ دیا اور اللہ کی حمد و ثنا کے بعد فرمایا، امابعد! میں تم میں سے کسی ایک کو اس کام پر عامل بناتا ہوں جس کا اللہ نے مجھے والی بنایا ہے پھر وہ شخص آتا ہے اور کہتا ہے کہ یہ تمہارا مال اور یہ تحفہ ہے جو مجھے دیا گیا تھا۔ اسے اپنے ماں باپ کے گھر بیٹھا رہنا چاہئیے تھا تاکہ اس کا تحفہ وہیں پہنچ جاتا۔ اللہ کی قسم! تم میں سے جو بھی حق کے سوا کوئی چیز لے گا وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ اس چیز کو اٹھائے ہوئے ہو گا بلکہ میں تم میں ہر اس شخص کو پہچان لوں گا جو اللہ سے اس حال میں ملے گا کہ اونٹ اٹھائے ہو گا جو بلبلا رہا ہو گا یا گائے اٹھائے ہو گا جو اپنی آواز نکال رہی ہو گی یا بکری اٹھائے ہو گا جو اپنی آواز نکال رہی ہو گی۔ پھر آپ نے اپنا ہاتھ اٹھایا یہاں تک کہ آپ کے بغل کی سفیدی دکھائی دینے لگی اور فرمایا، اے اللہ کیا میں نے پہنچا دیا۔ یہ فرماتے ہوئے نبی کریم صلی اللہ علیہ وسلم کو میری آنکھوں نے دیکھا اور کانوں سے سنا۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6980,
			"arabicnumber": 6980,
			"text": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا ‘ ان سے ابراہیم بن میسرہ نے ‘ ان سے عمرو بن شرید نے اور ان سے ابورافع رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”پڑوسی اپنے پڑوسی کا زیادہ حقدار ہے۔“ اور بعض لوگوں نے کہا اگر کسی شخص نے ایک گھر بیس ہزار درہم کا خریدا ( تو شفعہ کا حق ساقط کرنے کے لیے ) یہ حیلہ کرنے میں کوئی قباحت نہیں کہ مالک مکان کو نو ہزار نو سو ننانوے درہم نقد ادا کرے اب بیس ہزار کے تکملہ میں جو باقی رہے یعنی دس ہزار اور ایک درہم اس کے بدل مالک مکان کو ایک دینار ( اشرفی ) دیدے۔ اس صورت میں اگر شفیع اس مکان کو لینا چاہے گا تو اس کو بیس ہزار درہم پر لینا ہو گا ورنہ وہ اس گھر کو نہیں لے سکتا۔ ایسی صورت میں اگر بیع کے بعد یہ گھر ( بائع کے سوا ) اور کسی کا نکلا تو خریدار بائع سے وہی قیمت واپس لے گا جو اس نے دی ہے یعنی نو ہزار نو سو ننانوے درہم اور ایک دینار ( بیس ہزار درہم نہیں واپس سکتا ) کیونکہ جب وہ گھر کسی اور کا نکلا تو اب وہ بیع صرف جو بائع اور مشتری کے بیچ میں ہو گئی تھی بالکل باطل ہو گئی ( تو اصل دینار پھرنا لازم ہو گا نہ کہ اس کے ثمن ( یعنی دس ہزار اور ایک درہم ) اگر اس گھر میں کوئی عیب نکلا لیکن وہ بائع کے سوا کسی اور کی ملک نہیں نکلا تو خریدار اس گھر کو بائع کو واپس اور بیس ہزار درہم اس سے لے سکتا ہے۔ امام بخاری رحمہ اللہ نے کہا تو ان لوگوں نے مسلمانوں کے آپس میں مکر و فریب کو جائز رکھا اور نبی کریم صلی اللہ علیہ وسلم نے تو فرمایا ہے کہ مسلمان کی بیع میں جو مسلمان کے ساتھ ہو نہ عیب ہونا چاہئیے یعنی ( بیماری ) نہ خباثت نہ کوئی آفت۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6981,
			"arabicnumber": 6981,
			"text": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ نے بیان کیا ‘ ان سے سفیان نے ‘ ان سے ابراہیم بن میسرہ نے بیان کیا ‘ ان سے عمرو بن شرید نے کہ ابورافع رضی اللہ عنہ نے سعد بن مالک رضی اللہ عنہ کو ایک گھر چار سو مثقال میں بیچا اور کہا کہ اگر میں نے نبی کریم صلی اللہ علیہ وسلم سے یہ نہ سنا ہوتا کہ پڑوسی حق پڑوس کا زیادہ حقدار ہے تو میں آپ کو یہ گھر نہ دیتا ( اور کسی کے ہاتھ بیچ ڈالتا ) ۔",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 28
			}
		}
	]
}