{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7137,
			"arabicnumber": 7137,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے، انہیں زہری نے، انہیں ابوسلمہ بن عبدالرحمٰن نے خبر دی اور انہوں نے ابوہریرہ رضی اللہ عنہ کو بیان کرتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس نے میری اطاعت کی اس نے اللہ کی اطاعت کی اور جس نے میری نافرمانی کی اس نے اللہ کی نافرمانی کی اور جس نے میرے ( مقرر کئے ہوئے ) امیر کی اطاعت کی اس نے میری اطاعت کی اور جس نے میرے امیر کی نافرمانی کی اس نے میری نافرمانی کی۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7138,
			"arabicnumber": 7138,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا مجھ کو امام مالک نے خبر دی، انہیں عبداللہ بن دینار نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”آگاہ ہو جاؤ تم میں سے ہر ایک نگہبان ہے اور ہر ایک سے اس کی رعایا کے بارے میں سوال کیا جائے گا۔ پس امام ( امیرالمؤمنین ) لوگوں پر نگہبان ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا۔ مرد اپنے گھر والوں کا نگہبان ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا اور عورت اپنے شوہر کے گھر والوں اور اس کے بچوں کی نگہبان ہے اور اس سے ان کے بارے میں سوال ہو گا اور کسی شخص کا غلام اپنے سردار کے مال کا نگہبان ہے اور اس سے اس کے بارے میں سوال ہو گا۔ آگاہ ہو جاؤ کہ تم میں سے ہر ایک نگہبان ہے اور ہر ایک سے اس کی رعایا کے بارے میں پرسش ہو گی۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7139,
			"arabicnumber": 7139,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، انہوں نے کہا کہ محمد بن جبیر بن مطعم بیان کرتے تھے کہ میں قریش کے ایک وفد کے ساتھ معاویہ رضی اللہ عنہ کے پاس تھا کہ انہیں معلوم ہوا کہ عبداللہ بن عمرو بن العاص رضی اللہ عنہما بیان کرتے ہیں کہ عنقریب قبیلہ قحطان کا ایک بادشاہ ہو گا۔ معاویہ رضی اللہ عنہ اس پر غصہ ہوئے اور کھڑے ہو کر اللہ کی تعریف اس کی شان کے مطابق کی پھر فرمایا، امابعد! مجھے معلوم ہوا ہے کہ تم میں سے کچھ لوگ ایسی حدیث بیان کرتے ہیں جو نہ کتاب اللہ میں ہے اور اور نہ رسول اللہ صلی اللہ علیہ وسلم سے منقول ہے، یہ تم میں سے جاہل لوگ ہیں۔ پس تم ایسے خیالات سے بچتے رہو جو تمہیں گمراہ کر دیں کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ یہ امر ( خلافت ) قریش میں رہے گا۔ کوئی بھی ان سے اگر دشمنی کرے گا تو اللہ اسے رسوا کر دے گا لیکن اس وقت تک جب تک وہ دین کو قائم رکھیں گے۔ اس روایت کی متابعت نعیم نے ابن مبارک سے کی ہے، ان سے معمر نے، ان سے زہری نے اور ان سے محمد بن جبیر نے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7140,
			"arabicnumber": 7140,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے عاصم بن محمد نے بیان کیا، کہا میں نے اپنے والد سے سنا، انہوں نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”یہ امر خلافت اس وقت تک قریش میں رہے گا جب تک ان میں دو شخص بھی باقی رہیں گے۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7141,
			"arabicnumber": 7141,
			"text": "ہم سے شہاب بن عباد نے بیان کیا، کہا ہم سے ابراہیم بن حمید نے بیان کیا، ان سے اسماعیل بن ابی خالد نے، ان سے قیس بن ابی حازم نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”رشک بس دو آدمیوں پر ہی کیا جانا چاہئے۔ ایک وہ شخص جسے اللہ نے مال دیا اور پھر اس نے وہ حق کے راستے میں بےدریغ خرچ کیا اور دوسرا وہ شخص جسے اللہ نے حکمت دین کا علم ( قرآن و حدیث کا ) دیا ہے وہ اس کے موافق فیصلے کرتا ہے۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7142,
			"arabicnumber": 7142,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے ابوالتیاح نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”سنو اور اطاعت کرو، خواہ تم پر کسی ایسے حبشی غلام کو ہی عامل بنایا جائے جس کا سر منقیٰ کی طرح چھوٹا ہو۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7143,
			"arabicnumber": 7143,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے حماد نے بیان کیا، ان سے جعد نے بیان کیا اور ان سے ابورجاء نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس نے اپنے امیر میں کوئی برا کام دیکھا تو اسے صبر کرنا چاہئے کیونکہ کوئی اگر جماعت سے ایک بالشت بھی جدا ہو تو وہ جاہلیت کی موت مرے گا۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7144,
			"arabicnumber": 7144,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے عبیداللہ نے، ان سے نافع نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم سے فرمایا ”مسلمان کے لیے امیر کی بات سننا اور اس کی اطاعت کرنا ضروری ہے، ان چیزوں میں بھی جنہیں وہ پسند کرے اور ان میں بھی جنہیں وہ ناپسند کرے، جب تک اسے معصیت کا حکم نہ دیا جائے۔ پھر جب اسے معصیت کا حکم دیا جائے تو نہ سننا باقی رہتا ہے نہ اطاعت کرنا۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7145,
			"arabicnumber": 7145,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، انہوں نے کہا ہم سے اعمش نے بیان کیا، ان سے سعد بن عبیدہ نے بیان کیا، ان سے ابوعبدالرحمٰن نے بیان کیا اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک دستہ بھیجا اور اس پر انصار کے ایک شخص کو امیر بنایا اور لوگوں کو حکم دیا کہ ان کی اطاعت کریں۔ پھر امیر فوج کے لوگوں پر غصہ ہوئے اور کہا کہ کیا نبی کریم صلی اللہ علیہ وسلم نے تمہیں میری اطاعت کا حکم نہیں دیا ہے؟ لوگوں نے کہا کہ ضرور دیا ہے۔ اس پر انہوں نے کہا کہ میں تمہیں حکم دیتا ہوں کہ لکڑی جمع کرو اور اس سے آگ جلاؤ اور اس میں کود پڑو۔ لوگوں نے لکڑی جمع کی اور آگ جلائی، جب کودنا چاہا تو ایک دوسرے کو لوگ دیکھنے لگے اور ان میں سے بعض نے کہا کہ ہم نے نبی کریم صلی اللہ علیہ وسلم کی فرمانبرداری آگ سے بچنے کے لیے کی تھی، کیا پھر ہم اس میں خود ہی داخل ہو جائیں۔ اسی دوران میں آگ ٹھنڈی ہو گئی اور امیر کا غصہ بھی جاتا رہا۔ پھر نبی کریم صلی اللہ علیہ وسلم سے اس کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر یہ لوگ اس میں کود پڑتے تو پھر اس میں سے نہ نکل سکتے۔ اطاعت صرف اچھی باتوں میں ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7146,
			"arabicnumber": 7146,
			"text": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے جریر بن حازم نے بیان کیا، ان سے حسن نے اور ان سے عبدالرحمٰن بن سمرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اے عبدالرحمٰن! حکومت کے طالب نہ بننا کیونکہ اگر تمہیں مانگنے کے بعد حکومت ملی تو تم اس کے حوالے کر دئیے جاؤ گے اور وہ تمہیں بلا مانگے ملی تو اس میں تمہاری ( اللہ کی طرف سے ) مدد کی جائے گی اور اگر تم نے قسم کھا لی ہو پھر اس کے سوا دوسری چیز میں بھلائی دیکھو تو اپنی قسم کا کفارہ ادا کر دو اور وہ کام کرو جس میں بھلائی ہو۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7147,
			"arabicnumber": 7147,
			"text": "ہم سے ابومعمر نے بیان کیا، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا، انہوں نے کہا ہم سے یونس نے بیان کیا، ان سے حسن نے بیان کیا، کہا کہ مجھ سے عبدالرحمٰن بن سمرہ رضی اللہ عنہ نے بیان کیا کہ ان سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اے عبدالرحمٰن ابن سمرہ! حکومت طلب مت کرنا کیونکہ اگر تمہیں مانگنے کے بعد امیری ملی تو تم اس کے حوالے کر دئیے جاؤ گے اور اگر تمہیں مانگے بغیر ملی تو اس میں تمہاری مدد کی جائے گی اور اگر تم کسی بات پر قسم کھا لو اور پھر اس کے سوا دوسری چیز میں بھلائی دیکھو تو وہ کرو جس میں بھلائی ہو اور اپنی قسم کا کفارہ ادا کر دو۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7148,
			"arabicnumber": 7148,
			"text": "ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا، ان سے سعید مقبری نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا، ان سے سعید مقبری نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7149,
			"arabicnumber": 7149,
			"text": "ہم سے محمد بن علاء نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے بریدہ نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اپنی قوم کے دو آدمیوں کو لے کر حاضر ہوا۔ ان میں سے ایک نے کہا کہ یا رسول اللہ! ہمیں کہیں کا حاکم بنا دیجئیے اور دوسرے نے بھی یہی خواہش ظاہر کی۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہم ایسے شخص کو یہ ذمہ داری نہیں سونپتے جو اسے طلب کرے اور نہ اسے دیتے ہیں جو اس کا حریص ہو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7150,
			"arabicnumber": 7150,
			"text": "ہم سے ابونعیم نے بیان کیا، انہوں نے کہا ہم سے ابوالاشہب نے بیان کیا، ان سے حسن نے کہ عبیداللہ بن زیاد، معقل بن یسار رضی اللہ عنہ کی عیادت کے لیے اس مرض میں آئے جس میں ان کا انتقال ہوا تو معقل بن یسار رضی اللہ عنہ نے ان سے کہا کہ میں تمہیں ایک حدیث سناتا ہوں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا ”جب اللہ تعالیٰ کسی بندہ کو کسی رعیت کا حاکم بناتا ہے اور وہ خیر خواہی کے ساتھ اس کی حفاظت نہیں کرتا تو وہ جنت کی خوشبو بھی نہیں پائے گا۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7151,
			"arabicnumber": 7151,
			"text": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم کو حسین الجعفی نے خبر دی کہ زائدہ نے بیان کیا، ان سے ہشام نے اور ان سے حسن نے بیان کیا کہ ہم معقل بن یسار رضی اللہ عنہ کی عیادت کے لیے ان کے پاس گئے پھر عبیداللہ بھی آئے تو معقل رضی اللہ عنہ نے ان سے کہا کہ میں تم سے ایک ایسی حدیث بیان کرتا ہوں جسے میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی شخص مسلمانوں کا حاکم بنایا گیا اور اس نے ان کے معاملہ میں خیانت کی اور اسی حالت میں مر گیا تو اللہ تعالیٰ اس پر جنت کو حرام کر دیتا ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7152,
			"arabicnumber": 7152,
			"text": "ہم سے اسحاق واسطی نے بیان کیا، کہا ہم سے خالد نے، ان سے جریری نے، ان سے ظریف ابوتمیمہ نے بیان کیا کہ میں صفوان اور جندب اور ان کے ساتھیوں کے پاس موجود تھا۔ صفوان اپنے ساتھیوں ( شاگردوں ) کو وصیت کر رہے تھے، پھر ( صفوان اور ان کے ساتھیوں نے جندب رضی اللہ عنہ سے ) پوچھا: کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے کچھ سنا ہے؟ انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو یہ کہتے سنا ہے کہ جو لوگوں کو ریاکاری کے طور پر دکھانے کے لیے کام کرے گا اللہ قیامت کے دن اس کی ریاکاری کا حال لوگوں کو سنا دے گا اور فرمایا کہ جو لوگوں کو تکلیف میں مبتلا کرے گا اللہ تعالیٰ قیامت کے دن اسے تکلیف میں مبتلا کرے گا، پھر ان لوگوں نے کہا کہ ہمیں کوئی وصیت کیجئے۔ انہوں نے کہا کہ سب سے پہلے انسان کے جسم میں اس کا پیٹ سڑتا ہے پس جو کوئی طاقت رکھتا ہو کہ پاک و طیب کے سوا اور کچھ نہ کھائے تو اسے ایسا ہی کرنا چاہئے اور جو کوئی طاقت رکھتا ہو وہ چلو بھر لہو بہا کر ( یعنی ناحق خون کر کے ) اپنے آپ کو بہشت میں جانے سے روکے۔ جریری کہتے ہیں کہ میں نے ابوعبداللہ سے پوچھا، کون صاحب اس حدیث میں یہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا؟ کیا جندب کہتے ہیں؟ انہوں نے کہا کہ ہاں وہی کہتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7153,
			"arabicnumber": 7153,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا ہم سے جریر نے بیان کیا، ان سے منصور نے، ان سے سالم بن ابی الجعد نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے کہا کہ میں اور نبی کریم صلی اللہ علیہ وسلم مسجد سے نکل رہے تھے کہ ایک شخص مسجد کی چوکھٹ پر آ کر ہم سے ملا اور دریافت کیا: یا رسول اللہ! قیامت کب ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”تم نے قیامت کے لیے کیا تیاری کی ہے؟“ اس پر وہ شخص خاموش سا ہو گیا، پھر اس نے کہا: یا رسول اللہ! میں نے بہت زیادہ روزے، نماز اور صدقہ قیامت کے لیے نہیں تیار کئے ہیں لیکن میں اللہ اور اس کے رسول سے محبت رکھتا ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”تم اس کے ساتھ ہو گے جس سے تم محبت رکھتے ہو۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7154,
			"arabicnumber": 7154,
			"text": "ہم سے اسحاق نے بیان کیا، کہا ہم کو عبدالصمد نے خبر دی، کہا ہم سے شعبہ نے، کہا ہم سے ثابت البنانی نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے کہ وہ اپنے گھر کی ایک عورت سے کہہ رہے تھے فلانی کو پہچانتی ہو؟ انہوں نے کہا کہ ہاں۔ بتلایا کہ نبی کریم صلی اللہ علیہ وسلم اس کے پاس سے گزرے اور وہ ایک قبر کے پاس رو رہی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ سے ڈر اور صبر کر۔ اس عورت نے جواب دیا۔ آپ میرے پاس سے چلے جاؤ، میری مصیبت آپ پر نہیں پڑی ہے۔ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم وہاں سے ہٹ گئے اور چلے گئے۔ پھر ایک صاحب ادھر سے گزرے اور ان سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے تم سے کیا کہا تھا؟ اس عورت نے کہا کہ میں نے انہیں پہچانا نہیں۔ ان صاحب نے کہا کہ وہ رسول اللہ صلی اللہ علیہ وسلم تھے۔ پھر وہ عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی۔ انہوں نے آپ کے یہاں کوئی دربان نہیں پایا پھر عرض کیا: یا رسول اللہ! میں نے آپ کو پہچانا نہیں ( تھا ) ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ صبر تو صدمہ کے شروع میں ہی ہوتا ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7155,
			"arabicnumber": 7155,
			"text": "ہم سے محمد بن خالد ذہلی نے بیان کیا، کہا ہم سے انصاری محمد نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، ان سے ثمامہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ قیس بن سعد رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ اس طرح رہتے تھے جیسے امیر کے ساتھ کوتوال رہتا ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7156,
			"arabicnumber": 7156,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے قرہ نے، ان سے حمید بن ہلال نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے انہیں بھیجا تھا اور ان کے ساتھ معاذ رضی اللہ عنہ کو بھی بھیجا تھا۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7157,
			"arabicnumber": 7157,
			"text": "ہم سے عبداللہ بن صباح نے بیان کیا، کہا ہم سے محبوب بن الحسن نے بیان کیا، کہا ہم سے خالد نے بیان کیا، ان سے حمید بن ہلال نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ ایک شخص اسلام لایا پھر یہودی ہو گیا پھر معاذ بن جبل رضی اللہ عنہ آئے اور وہ شخص ابوموسیٰ اشعری رضی اللہ عنہ کے پاس تھا۔ انہوں نے پوچھا اس کا کیا معاملہ ہے؟ ابوموسیٰ رضی اللہ عنہ نے جواب دیا کہ اسلام لایا پھر یہودی ہو گیا، پھر انہوں نے کہا کہ جب تک میں اسے قتل نہ کر لو نہیں بیٹھوں گا، یہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کا فیصلہ ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7158,
			"arabicnumber": 7158,
			"text": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے عبدالملک بن عمیر نے کہا کہ میں نے عبدالرحمٰن ابن ابی بکرہ سے سنا کہا کہ ابوبکرہ رضی اللہ عنہ نے اپنے لڑکے ( عبیداللہ ) کو لکھا اور وہ اس وقت سجستان میں تھے کہ دو آدمیوں کے درمیان فیصلہ اس وقت نہ کرنا جب تم غصہ میں ہو کیونکہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے کہ کوئی ثالث دو آدمیوں کے درمیان فیصلہ اس وقت نہ کرے جب وہ غصہ میں ہو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7159,
			"arabicnumber": 7159,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو اسماعیل بن ابی خالد نے خبر دی، انہیں قیس ابن ابی حازم نے، ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور عرض کیا: یا رسول اللہ! میں واللہ صبح کی جماعت میں فلاں ( امام معاذ بن جبل یا ابی بن کعب رضی اللہ عنہما ) کی وجہ سے شرکت نہیں کر پاتا کیونکہ وہ ہمارے ساتھ اس نماز کو بہت لمبی کر دیتے ہیں۔ ابومسعود رضی اللہ عنہ نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو وعظ و نصیحت کے وقت اس سے زیادہ غضب ناک ہوتا کبھی نہیں دیکھا جیسا کہ آپ اس دن تھے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ”اے لوگو! تم میں سے بعض نمازیوں کو نفرت دلانے والے ہیں، پس تم میں سے جو شخص بھی لوگوں کو نماز پڑھائے اسے اختصار کرنا چاہئے کیونکہ جماعت میں بوڑھے، بچے اور ضرورت مند سب ہی ہوتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7160,
			"arabicnumber": 7160,
			"text": "ہم سے محمد بن ابی یعقوب الکرمانی نے بیان کیا، انہوں نے کہا ہم سے حسان بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے یونس نے بیان کیا، محمد نے بیان کیا کہ مجھے سالم نے خبر دی، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ انہوں نے اپنی بیوی کو جب کہ وہ حالت حیض میں تھیں ( آمنہ بنت غفار ) طلاق دے دی، پھر عمر رضی اللہ عنہ نے اس کا تذکرہ نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ بہت خفا ہوئے پھر فرمایا ”انہیں چاہئے کہ وہ رجوع کر لیں اور انہیں اپنے پاس رکھیں، یہاں تک کہ جب وہ پاک ہو جائیں پھر حائضہ ہوں اور پھر پاک ہوں تب اگر چاہے تو اسے طلاق دیدے۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7161,
			"arabicnumber": 7161,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، انہیں عروہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ ہند بنت عتبہ بن ربیعہ آئیں اور کہا: یا رسول اللہ! روئے زمین کا کوئی گھرانہ ایسا نہیں تھا جس کے متعلق اس درجہ میں ذلت کی خواہشمند ہوں جتنا آپ کے گھرانہ کی ذلت و رسوائی کی میں خواہشمند تھی لیکن اب میرا یہ حال ہے کہ میں سب سے زیادہ خواہشمند ہوں کہ روئے زمین کے تمام گھرانوں میں آپ کا گھرانہ عزت و سربلندی والا ہو۔ پھر انہوں نے کہا کہ ابوسفیان رضی اللہ عنہ بخیل آدمی ہیں، تو کیا میرے لیے کوئی حرج ہے اگر میں ان کے مال میں سے ( ان کی اجازت کے بغیر لے کر ) اپنے اہل و عیال کو کھلاؤں؟ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تمہارے لیے کوئی حرج نہیں ہے، اگر تم انہیں دستور کے مطابق کھلاؤ۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7162,
			"arabicnumber": 7162,
			"text": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، ان سے شعبہ نے بیان کیا، کہا کہ میں نے قتادہ سے سنا، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ جب نبی کریم صلی اللہ علیہ وسلم نے اہل روم کو خط لکھنا چاہا تو صحابہ نے کہا کہ رومی صرف مہر لگا ہوا خط ہی قبول کرتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے چاندی کی ایک مہر بنوائی گویا میں اس کی چمک کو اس وقت بھی دیکھ رہا ہوں اور اس پر کلمہ «محمد رسول الله‏.‏» نقش تھا۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7163,
			"arabicnumber": 7163,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، انہیں نمر کے بھانجے سائب بن یزید نے خبر دی، انہیں حویطب بن عبدالعزیٰ نے خبر دی، انہیں عبداللہ بن السعیدی نے خبر دی کہ وہ عمر رضی اللہ عنہ کے پاس ان کے زمانہ خلافت میں آئے تو ان سے عمر رضی اللہ عنہ نے پوچھا: کیا مجھ سے یہ جو کہا گیا ہے وہ صحیح ہے کہ تمہیں لوگوں کے کام سپرد کئے جاتے ہیں اور جب اس کی تنخواہ دی جاتی ہے تو تم اسے لینا پسند نہیں کرتے؟ میں نے کہا کہ یہ صحیح ہے۔ عمر رضی اللہ عنہ نے کہا کہ تمہارا اس سے مقصد کیا ہے؟ میں نے عرض کیا کہ میرے پاس گھوڑے اور غلام ہیں اور میں خوشحال ہوں اور میں چاہتا ہوں کہ میری تنخواہ مسلمانوں پر صدقہ ہو جائے۔ عمر رضی اللہ عنہ نے فرمایا کہ ایسا نہ کرو کیونکہ میں نے بھی اس کا ارادہ کیا تھا جس کا تم نے ارادہ کیا ہے نبی کریم صلی اللہ علیہ وسلم مجھے عطا کرتے تھے تو میں عرض کر دیتا تھا کہ اسے مجھ سے زیادہ اس کے ضرورت مند کو عطا فرما دیجئیے۔ آخر آپ نے ایک مرتبہ مجھے مال عطا کیا اور میں نے وہی بات دہرائی کہ اسے ایسے شخص کو دے دیجئیے جو اس کا مجھ سے زیادہ ضرورت مند ہو تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے لو اور اس کے مالک بننے کے بعد اس کا صدقہ کرو۔ یہ مال جب تمہیں اس طرح ملے کہ تم اس کے نہ خواہشمند ہو اور نہ اسے مانگا تو اسے لے لیا کرو اور اگر اس طرح نہ ملے تو اس کے پیچھے نہ پڑا کرو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7164,
			"arabicnumber": 7164,
			"text": "اور زہری سے روایت ہے انہوں نے بیان کیا کہ مجھ سے سالم بن عبداللہ نے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ میں نے عمر رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم مجھے عطا کرتے تھے تو میں کہتا کہ آپ اسے دے دیں جو اس کا مجھ سے زیادہ ضرورت مند ہو، پھر آپ صلی اللہ علیہ وسلم نے مجھے ایک مرتبہ مال دیا اور میں نے کہا کہ آپ اسے ایسے شخص کو دے دیں جو اس کا مجھ سے زیادہ ضرورت مند ہو تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے لے لو اور اس کے مالک بننے کے بعد اس کا صدقہ کر دو۔ یہ مال جب تمہیں اس طرح ملے کہ تم اس کے خواہشمند نہ ہو اور نہ اسے تم نے مانگا ہو تو اسے لے لیا کرو اور جو اس طرح نہ ملے اس کے پیچھے نہ پڑا کرو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7165,
			"arabicnumber": 7165,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، ان سے سفیان نے بیان کیا، ان سے زہری نے بیان کیا، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ میں نے دو لعان کرنے والوں کو دیکھا، میں اس وقت پندرہ سال کا تھا اور ان دونوں کے درمیان جدائی کرا دی گئی تھی۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7166,
			"arabicnumber": 7166,
			"text": "ہم سے یحییٰ نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہیں ابن جریج نے خبر دی، انہیں ابن شہاب نے خبر دی، انہیں بنی ساعدہ کے ایک فرد سہل رضی اللہ عنہ نے خبر دی کہ قبیلہ انصار کا ایک شخص نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور عرض کیا آپ کا اس بارے میں کیا خیال ہے اگر کوئی مرد اپنی بیوی کے ساتھ دوسرے مرد کو دیکھے، کیا اسے قتل کر سکتا ہے؟ پھر دونوں ( میاں بیوی ) میں میری موجودگی میں لعان کرایا گیا۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7167,
			"arabicnumber": 7167,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے ابوسلمہ نے، ان سے سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، نبی کریم صلی اللہ علیہ وسلم مسجد میں تھے اور انہوں نے آپ کو آواز دی اور کہا: یا رسول اللہ! میں نے زنا کر لیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے منہ موڑ لیا لیکن جب اس نے اپنے ہی خلاف چار مرتبہ گواہی دی تو آپ نے اس سے پوچھا کیا تم پاگل ہو؟ اس نے کہا کہ نہیں، پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں لے جاؤ اور رجم کر دو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7168,
			"arabicnumber": 7168,
			"text": "ابن شہاب نے بیان کیا کہ پھر مجھے اس شخص نے خبر دی جس نے جابر بن عبداللہ رضی اللہ عنہما سے سنا تھا، انہوں نے بیان کیا کہ میں بھی ان لوگوں میں تھا جنہوں نے اس شخص کو عیدگاہ پر رجم کیا تھا۔ اس کی روایت یونس، معمر اور ابن جریج نے زہری سے کی، ان سے ابوسلمہ نے، ان سے جابر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے رجم کے سلسلے میں یہی حدیث ذکر کی۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7169,
			"arabicnumber": 7169,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے امام مالک نے، ان سے ہشام نے، ان سے ان کے والد نے، ان سے زینب بنت ابی سلمہ نے اور ان سے ام سلمہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”بلاشبہ میں ایک انسان ہوں، تم میرے پاس اپنے جھگڑے لاتے ہو ممکن ہے تم میں سے بعض اپنے مقدمہ کو پیش کرنے میں فریق ثانی کے مقابلہ میں زیادہ چرب زبان ہو اور میں تمہاری بات سن کر فیصلہ کر دوں تو جس شخص کے لیے میں اس کے بھائی ( فریق مخالف ) کا کوئی حق دلا دوں، چاہئے کہ وہ اسے نہ لے کیونکہ یہ آگ کا ایک ٹکڑا ہے جو میں اسے دیتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7170,
			"arabicnumber": 7170,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یحییٰ بن سعید انصاری نے، ان سے عمر بن کثیر نے، ان سے ابوقتادہ کے غلام ابو محمد نافع نے اور ان سے ابوقتادہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے حنین کی جنگ کے دن فرمایا ”جس کے پاس کسی مقتول کے بارے میں جسے اس نے قتل کیا ہو گواہی ہو تو اس کا سامان اسے ملے گا۔ چنانچہ میں مقتول کے لیے گواہ تلاش کرنے کے لیے کھڑا ہوا تو میں نے کسی کو نہیں دیکھا جو میرے لیے گواہی دے سکے، اس لیے میں بیٹھ گیا۔ پھر میرے سامنے ایک صورت آئی اور میں نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو وہاں بیٹھے ہوئے ایک صاحب نے کہا کہ اس مقتول کا سامان جس کا ابوقتادہ ذکر کر رہے ہیں، میرے پاس ہے۔ انہیں اس کے لیے راضی کر دیجئیے ( کہ وہ یہ ہتھیار وغیرہ مجھے دے دیں ) اس پر ابوبکر رضی اللہ عنہ نے کہا کہ ہرگز نہیں۔ اللہ کے شیروں میں سے ایک شیر کو نظر انداز کر کے جو اللہ اور اس کے رسول کی طرف سے جنگ کرتا ہے وہ قریش کے معمولی آدمی کو ہتھیار نہیں دیں گے۔ بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے حکم دیا اور انہوں نے ہتھیار مجھے دے دئیے اور میں نے اس سے ایک باغ خریدا۔ یہ پہلا مال تھا جو میں نے ( اسلام کے بعد ) حاصل کیا تھا۔ امام بخاری رحمہ اللہ نے کہا اور مجھ سے عبداللہ بن صالح نے بیان کیا، ان سے لیث بن سعد نے کہ پھر نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے اور مجھے وہ سامان دلا دیا، اور اہل حجاز، امام مالک وغیرہ نے کہا کہ حاکم کو صرف اپنے علم کی بنیاد پر فیصلہ کرنا درست نہیں۔ خواہ وہ معاملہ پر عہدہ قضاء حاصل ہونے کے بعد گواہ ہوا ہو یا اس سے پہلے اور اگر کسی فریق نے اس کے سامنے دوسرے کے لیے مجلس قضاء میں کسی حق کا اقرار کیا تو بعض لوگوں کا خیال ہے کہ اس بنیاد پر وہ فیصلہ نہیں کرے گا بلکہ دو گواہوں کو بلا کر ان کے سامنے اقرار کرائے گا۔ اور بعض اہل عراق نے کہا ہے کہ جو کچھ قاضی نے عدالت میں دیکھا یا سنا اس کے مطابق فیصلہ کرے گا لیکن جو کچھ عدالت کے باہر ہو گا اس کی بنیاد پر دو گواہوں کے بغیر فیصلہ نہیں کر سکتا اور انہیں میں سے دوسرے لوگوں نے کہا کہ اس کی بنیاد پر بھی فیصلہ کر سکتا ہے کیونکہ وہ امانت دار ہے۔ شہادت کا مقصد تو صرف حق کا جاننا ہے پس قاضی کا ذاتی علم گواہی سے بڑھ کر ہے۔ اور بعض ان میں سے کہتے ہیں کہ اموال کے بارے میں تو اپنے علم کی بنیاد پر فیصلہ کرے گا اور اس کے سوا میں نہیں کرے گا اور قاسم نے کہا کہ حاکم کے لیے درست نہیں کہ وہ کوئی فیصلہ صرف اپنے علم کی بنیاد پر کرے اور دوسرے کے علم کو نظر انداز کر دے گو قاضی کا علم دوسرے کی گواہی سے بڑھ کر ہے لیکن چونکہ عام مسلمانوں کی نظر میں اس صورت میں قاضی کے مہتمم ہونے کا خطرہ ہے اور مسلمانوں کو اس طرح بدگمانی میں مبتلا کرنا ہے اور نبی کریم صلی اللہ علیہ وسلم نے بدگمانی کو ناپسند کیا تھا اور فرمایا تھا کہ یہ صفیہ میری بیوی ہیں۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7171,
			"arabicnumber": 7171,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ابن شہاب نے اور ان سے جناب زین العابدین علی بن حسین رحمہ اللہ نے کہ صفیہ بنت حیی رضی اللہ عنہا ( رات کے وقت ) نبی کریم صلی اللہ علیہ وسلم کے پاس آئیں ( اور نبی کریم صلی اللہ علیہ وسلم مسجد میں معتکف تھے ) جب وہ واپس آنے لگیں تو نبی کریم صلی اللہ علیہ وسلم بھی ان کے ساتھ آئے۔ اس وقت دو انصاری صحابی ادھر سے گزرے تو نبی کریم صلی اللہ علیہ وسلم نے انہیں بلایا اور فرمایا کہ یہ صفیہ ہیں۔ ان دونوں انصاریوں نے کہا، سبحان اللہ ( کیا ہم آپ پر شبہ کریں گے ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ شیطان انسان کے اندر اس طرح دوڑتا ہے جیسے خون دوڑتا ہے۔ اس کی روایت شعیب، ابن مسافر، ابن ابی عتیق اور اسحاق بن یحییٰ نے زہری سے کی ہے، ان سے علی بن حسین نے اور ان سے صفیہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم سے یہی واقعہ نقل کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7172,
			"arabicnumber": 7172,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے عبدالملک بن عمرو عقدی نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے سعید بن ابی بردہ نے بیان کیا کہ میں نے اپنے والد سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے میرے والد ( ابوموسیٰ رضی اللہ عنہ ) اور معاذ بن جبل رضی اللہ عنہ کو یمن بھیجا اور ان سے فرمایا کہ آسانی پیدا کرنا اور تنگی نہ کرنا اور خوشخبری دینا اور نفرت نہ دلانا اور آپس میں اتفاق رکھنا۔ ابوموسیٰ رضی اللہ عنہ نے پوچھا کہ ہمارے ملک میں شہد کا نبیذ ( تبع ) بنایا جاتا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہر نشہ آور چیز حرام ہے۔ نضر بن شمیل، ابوداؤد طیالسی، یزید بن ہارو اور وکیع نے شعبہ سے بیان کیا، ان سے سعید نے، ان سے ان کے والد نے، ان سے ان کے دادا نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث نقل کی۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7173,
			"arabicnumber": 7173,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے سفیان نے، کہا مجھ سے منصور نے بیان کیا، ان سے ابوائل نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”قیدیوں کو چھڑاؤ اور دعوت کرنے والے کی دعوت قبول کرو۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7174,
			"arabicnumber": 7174,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے زہری نے، انہوں نے عروہ سے سنا، انہیں ابوحمید ساعدی رضی اللہ عنہ نے خبر دی، انہوں نے بیان کیا کہ بنی اسد کے ایک شخص کو صدقہ کی وصولی کے لیے رسول اللہ صلی اللہ علیہ وسلم نے تحصیلدار بنایا، ان کا نام ابن الاتیتہ تھا۔ جب وہ لوٹ کر آئے تو انہوں نے کہا کہ یہ آپ لوگوں کا ہے اور یہ مجھے ہدیہ میں دیا گیا ہے۔ پھر نبی کریم صلی اللہ علیہ وسلم منبر پر کھڑے ہوئے، سفیان ہی نے یہ روایت بھی کی کہ ”پھر آپ منبر پر چڑھے“ پھر اللہ کی حمد و ثنا بیان کی اور فرمایا کہ اس عامل کا کیا حال ہو گا جسے ہم تحصیل کے لیے بھیجتے ہیں پھر وہ آتا ہے اور کہتا ہے کہ یہ مال تمہارا ہے اور یہ میرا ہے۔ کیوں نہ وہ اپنے باپ یا ماں کے گھر بیٹھا رہا اور دیکھا ہوتا کہ اسے ہدیہ دیا جاتا ہے یا نہیں۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے، عامل جو چیز بھی ( ہدیہ کے طور پر ) لے گا اسے قیامت کے دن اپنی گردن پر اٹھائے ہوئے آئے گا۔ اگر اونٹ ہو گا تو وہ اپنی آواز نکالتا آئے گا، اگر گائے ہو گی تو وہ اپنی آواز نکالتی آئے گی، بکری ہو گی تو وہ بولتی آئے گی، پھر آپ نے اپنے ہاتھ اٹھائے۔ یہاں تک کہ ہم نے آپ کے دونوں بغلوں کی سفیدی دیکھی اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے پہنچا دیا! تین مرتبہ یہی فرمایا۔ سفیان بن عیینہ نے بیان کیا کہ یہ حدیث ہم سے زہری نے بیان کی اور ہشام نے اپنے والد سے روایت کی، ان سے ابوحمید رضی اللہ عنہ نے بیان کیا کہ میرے دونوں کانوں نے سنا اور دونوں آنکھوں نے دیکھا اور زید بن ثابت صحابی رضی اللہ عنہ سے بھی پوچھ کیونکہ انہوں نے بھی یہ حدیث میرے ساتھ سنی ہے۔ سفیان نے کہا زہری نے یہ لفظ نہیں کہا کہ میرے کانوں نے سنا۔ امام بخاری رحمہ اللہ نے کہا حدیث میں «خوار‏» کا لفظ ہے یعنی گائے کی آواز یا «جؤار» کا لفظ جو لفظ «تجأرون» سے نکلا ہے جو سورۃ مومنون میں ہے یعنی گائے کی آواز نکالتے ہوں گے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7175,
			"arabicnumber": 7175,
			"text": "ہم سے عثمان بن صالح نے بیان کیا، انہوں نے کہا ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا مجھ کو ابن جریج نے خبر دی، انہیں نافع نے خبر دی، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہا کہ ابوحذیفہ رضی اللہ عنہ کے ( آزاد کردہ غلام ) سالم، مہاجر اولین کی اور نبی کریم صلی اللہ علیہ وسلم کے دوسرے صحابہ رضی اللہ عنہم مسجد قباء میں امامت کیا کرتے تھے۔ ان اصحاب میں ابوبکر، عمر، ابوسلمہ، زید اور عامر بن ربیعہ رضی اللہ عنہم بھی ہوتے تھے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7177,
			"arabicnumber": 7177,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7178,
			"arabicnumber": 7178,
			"text": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا ہم سے عاصم بن محمد بن زید بن عبداللہ بن عمر نے، اور ان سے ان کے والد نے کہ کچھ لوگوں نے ابن عمر رضی اللہ عنہما سے کہا کہ ہم اپنے حاکموں کے پاس جاتے ہیں اور ان کے حق میں وہ باتیں کہتے ہیں کہ باہر آنے کے بعد ہم اس کے خلاف کہتے ہیں۔ ابن عمر رضی اللہ عنہما نے کہا کہ ہم اسے نفاق کہتے تھے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7179,
			"arabicnumber": 7179,
			"text": "ہم سے قتیبہ نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یزید بن ابی حبیب نے، ان سے عراک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بدترین وہ شخص دورخا ہے، کسی کے سامنے اس کا ایک رخ ہوتا ہے اور دوسرے کے سامنے دوسرا رخ برتتا ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7180,
			"arabicnumber": 7180,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان نے خبر دی، انہیں ہشام نے، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ ہند نے نبی کریم صلی اللہ علیہ وسلم سے کہا کہ ( ان کے شوہر ) ابوسفیان بخیل ہیں اور مجھے ان کے مال میں سے لینے کی ضرورت ہوتی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دستور کے مطابق اتنا لے لیا کرو جو تمہارے اور تمہارے بچوں کے لیے کافی ہو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7181,
			"arabicnumber": 7181,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے صالح نے، ان سے ابن شہاب نے بیان کیا، انہیں عروہ بن زبیر نے خبر دی، انہیں زینب بنت ابی سلمہ نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ ام سلمہ رضی اللہ عنہا نے خبر دی۔ آپ نے اپنے حجرہ کے دروازے پر جھگڑے کی آواز سنی تو باہر ان کی طرف نکلے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں بھی ایک انسان ہوں اور میرے پاس لوگ مقدمے لے کر آتے ہیں۔ ممکن ہے ان میں سے ایک فریق دوسرے فریق سے بولنے میں زیادہ عمدہ ہو اور میں یقین کر لوں کی وہی سچا ہے اور اس طرح اس کے موافق فیصلہ کر دوں۔ پس جس شخص کے لیے بھی میں کسی مسلمان کا حق دلا دوں تو وہ جہنم کا ایک ٹکڑا ہے وہ چاہے اسے لے یا چھوڑ دے، میں اس کو درحقیقت دوزخ کا ایک ٹکڑا دلا رہا ہوں۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7182,
			"arabicnumber": 7182,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ بن زبیر نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ عتبہ بن ابی وقاص نے اپنے بھائی سعد بن ابی وقاص رضی اللہ عنہ کو یہ وصیت کی تھی کہ زمعہ کی لونڈی ( کا لڑکا ) میرا ہے۔ تم اسے اپنی پرورش میں لے لینا۔ چنانچہ فتح مکہ کے دن سعد رضی اللہ عنہ نے اسے لے لیا اور کہا کہ یہ میرے بھائی کا لڑکا ہے اور مجھے اس کے بارے میں انہوں نے وصیت کی تھی، پھر عبد بن زمعہ کھڑے ہوئے اور کہا کہ یہ میرا بھائی، میرے والد کی لونڈی کا لڑکا ہے اور انہیں کے فراش پر پیدا ہوا۔ چنانچہ یہ دونوں نبی کریم صلی اللہ علیہ وسلم کے پاس پہنچے۔ سعد رضی اللہ عنہ نے کہا کہ یا رسول اللہ! میرے بھائی کا لڑکا ہے، انہوں نے مجھے اس کی وصیت کی تھی اور عبد بن زمعہ نے کہا کہ میرا بھائی ہے، میرے والد کی لونڈی کا لڑکا ہے اور انہیں کے فراش پر پیدا ہوا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عبد بن زمعہ! یہ تمہارا ہے، پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ بچہ فراش کا ہوتا ہے اور زانی کے لیے پتھر ہے۔ پھر آپ نے سودہ بنت زمعہ رضی اللہ عنہ سے کہا کہ اس لڑکے سے پردہ کیا کرو کیونکہ آپ صلی اللہ علیہ وسلم نے لڑکے کی عتبہ سے مشابہت دیکھ لی تھی۔ چنانچہ اس نے سودہ رضی اللہ عنہا کو موت تک نہیں دیکھا۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7184,
			"arabicnumber": 7184,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7185,
			"arabicnumber": 7185,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، انہیں عروہ بن زبیر نے، انہیں زینب بنت ابی سلمہ رضی اللہ عنہا نے خبر دی، ان سے ان کی والدہ ام سلمہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے اپنے دروازے پر جھگڑا کرنے والوں کی آواز سنی اور ان کی طرف نکلے۔ پھر ان سے فرمایا کہ میں تمہارے ہی جیسا انسان ہوں، میرے پاس لوگ مقدمہ لے کر آتے ہیں، ممکن ہے ایک فریق دوسرے سے زیادہ عمدہ بولنے والا ہو اور میں اس کے لیے اس حق کا فیصلہ کر دوں اور یہ سمجھوں کہ میں نے فیصلہ صحیح کیا ہے ( حالانکہ وہ صحیح نہ ہو ) تو جس کے لیے میں کسی مسلمان کے حق کا فیصلہ کر دوں تو بلاشبہ یہ فیصلہ جہنم کا ایک ٹکڑا ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7186,
			"arabicnumber": 7186,
			"text": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے محمد بن بشر نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، کہا ہم سے سلمہ بن کہیل نے بیان کیا، ان سے عطاء نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کو معلوم ہوا کہ آپ کے صحابہ میں سے ایک نے اپنے غلام کو مدبر بنا دیا ہے ( کہ ان کی موت کے بعد وہ آزاد ہو جائے گا ) چونکہ ان کے پاس اس کے سوا اور کوئی مال نہیں تھا اس لیے نبی کریم صلی اللہ علیہ وسلم نے اس غلام کو آٹھ سو درہم میں بیچ دیا اور اس کی قیمت انہیں بھیج دی۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7187,
			"arabicnumber": 7187,
			"text": "ہم سے اسماعیل نے بیان کیا، انہوں نے کہا ہم سے عبدالعزیز بن مسلم نے بیان کیا، ان سے عبداللہ بن دینار نے بیان کیا، انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک لشکر بھیجا اور اس کا امیر اسامہ بن زید رضی اللہ عنہما کو بنایا لیکن ان کی سرداری پر طعن کیا گیا۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اگر آج تم ان کی امارت کو مطعون قرار دیتے ہو تو تم نے اس سے پہلے اس کے والد ( زید رضی اللہ عنہ ) کی امارت کو بھی مطعون قرار دیا تھا اور اللہ کی قسم! وہ امارت کے لیے سزاوار تھے اور وہ مجھے تمام لوگوں میں سب سے زیادہ عزیز تھے اور یہ ( اسامہ رضی اللہ عنہ ) ان کے بعد سب سے زیادہ مجھے عزیز ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7188,
			"arabicnumber": 7188,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے ابن جریج نے بیان کیا، انہوں نے ابن ابی ملیکہ سے سنا، وہ عائشہ رضی اللہ عنہا سے بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اللہ کے نزدیک سب سے مبغوض وہ شخص ہے جو سخت جھگڑالو ہو۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7189,
			"arabicnumber": 7189,
			"text": "ہم سے محمود نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کہا، کہا ہم کو معمر نے خبر دی، انہیں زہری نے انہیں سالم نے اور انہیں ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے خالد رضی اللہ عنہ کو بھیجا۔ (دوسری سند) امام بخاری رحمہ اللہ نے کہا اور مجھ سے نعیم بن حماد نے بیان کیا کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں سالم نے، انہیں ان کے والد نے کہ نبی کریم صلی اللہ علیہ وسلم نے خالد بن ولید رضی اللہ عنہ کو بنی جذیمہ کی طرف بھیجا ( جب انہیں اسلام کی دعوت دی ) تو وہ «أسلمنا‏.‏» ( ہم اسلام لائے ) کہہ کر اچھی طرح اظہار اسلام نہ کر سکے بلکہ کہنے لگے کہ «صبأنا صبأنا» ( ہم اپنے دین سے پھر گئے، ہم اپنے دین سے پھر گئے ) اس پر خالد رضی اللہ عنہ انہیں قتل اور قید کرنے لگے اور ہم میں سے ہر شخص کو اس کے حصہ کا قیدی دیا اور ہمیں حکم دیا کہ ہر شخص اپنے قیدی کو قتل کر دے۔ اس پر میں نے کہا کہ واللہ! میں اپنے قیدی کو قتل نہیں کروں گا اور نہ میرے ساتھیوں میں کوئی اپنے قیدی کو قتل کرے گا۔ پھر ہم نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! میں اس سے برات ظاہر کرتا ہوں جو خالد بن ولید نے کیا، دو مرتبہ۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7190,
			"arabicnumber": 7190,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے حماد نے بیان کیا، ان سے ابوحازم المدینی نے بیان کیا اور ان سے سہل بن سعد الساعدی رضی اللہ عنہ نے بیان کیا کہ قبیلہ بنی عمرو بن عوف میں باہم لڑائی ہو گئی۔ جب نبی کریم صلی اللہ علیہ وسلم کو اس کی اطلاع ملی تو آپ نے ظہر کی نماز پڑھی اور ان کے یہاں صلح کرانے کے لیے تشریف لائے۔ جب عصر کی نماز کا وقت ہوا ( مدینہ میں ) تو بلال رضی اللہ عنہ نے اذان دی اور اقامت کہی۔ آپ نے ابوبکر رضی اللہ عنہ کو نماز پڑھانے کا حکم دیا تھا۔ چنانچہ وہ آگے بڑھے، اتنے میں نبی کریم صلی اللہ علیہ وسلم تشریف لے آئے ابوبکر رضی اللہ عنہ نماز ہی میں تھے ‘ پھر نبی کریم صلی اللہ علیہ وسلم لوگوں کی صف کو چیرتے ہوئے آگے بڑھے اور ابوبکر رضی اللہ عنہ کے پیچھے کھڑے ہو گئے اور اس صف میں آ گئے جو ان سے قریب تھی۔ سہل رضی اللہ عنہ نے کہا کہ لوگوں نے نبی کریم صلی اللہ علیہ وسلم کی آمد کو بتانے کے لیے ہاتھ مارے۔ ابوبکر رضی اللہ عنہ جب نماز شروع کرتے تو ختم کرنے سے پہلے کسی طرف توجہ نہیں کرتے تھے۔ جب انہوں نے دیکھا کہ ہاتھ پر ہاتھ مارنا رکتا ہی نہیں تو آپ متوجہ ہوئے اور نبی کریم صلی اللہ علیہ وسلم کو اپنے پیچھے دیکھا لیکن نبی کریم صلی اللہ علیہ وسلم نے اشارہ کیا کہ نماز پوری کریں اور آپ نے اس طرح ہاتھ سے اپنی جگہ ٹھہرے رہنے کا اشارہ کیا۔ ابوبکر رضی اللہ عنہ تھوڑی دیر نبی کریم صلی اللہ علیہ وسلم کے حکم پر اللہ کی حمد کرنے کے لیے ٹھہرے رہے، پھر آپ الٹے پاؤں پیچھے آ گئے۔ جب نبی کریم صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ آگے بڑھے اور لوگوں کو آپ نے نماز پڑھائی۔ نماز پوری کرنے کے بعد آپ نے فرمایا، ابوبکر! جب میں نے ارشاد کر دیا تھا تو آپ کو نماز پوری پڑھانے میں کیا چیز مانع تھی؟ انہوں نے عرض کیا، ابن ابی قحافہ کے لیے مناسب نہیں تھا کہ وہ نبی کریم صلی اللہ علیہ وسلم کی امامت کرے اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ( نماز میں ) جب کوئی معاملہ پیش آئے تو مردوں کو سبحان اللہ کہنا چاہئیے اور عورتوں کو ہاتھ پر ہاتھ مارنا چاہئے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7191,
			"arabicnumber": 7191,
			"text": "ہم سے محمد بن عبداللہ ابوثابت نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ابن شہاب نے، ان سے عبید بن سابق نے اور ان سے زید بن ثابت رضی اللہ عنہ نے کہ جنگ یمامہ میں بکثرت ( قاری صحابہ کی ) شہادت کی وجہ سے ابوبکر رضی اللہ عنہ نے مجھے بلا بھیجا۔ ان کے پاس عمر رضی اللہ عنہ بھی تھے۔ ابوبکر رضی اللہ عنہ نے مجھ سے کہا کہ عمر میرے پاس آئے اور کہا کہ جنگ یمامہ میں قرآن کے قاریوں کا قتل بہت ہوا ہے اور میرا خیال ہے کہ دوسری جنگوں میں بھی اسی طرح وہ شہید کئے جائیں گے اور قرآن اکثر ضائع ہو جائے گا۔ میں سمجھتا ہوں کہ آپ قرآن مجید کو ( کتابی صورت میں ) جمع کرنے کا حکم دیں۔ اس پر میں نے عمر رضی اللہ عنہ سے کہا کہ میں کوئی ایسا کام کیسے کر سکتا ہوں جسے رسول اللہ صلی اللہ علیہ وسلم نے نہیں کیا۔ عمر رضی اللہ عنہ نے کہا واللہ! یہ تو کار خیر ہے۔ عمر رضی اللہ عنہ اس معاملہ میں برابر مجھ سے کہتے رہے یہاں تک کہ اللہ تعالیٰ نے اسی طرح اس معاملے میں میرا بھی سینہ کھول دیا جس طرح عمر رضی اللہ عنہ کا تھا اور میں بھی وہی مناسب سمجھنے لگا جسے عمر رضی اللہ عنہ مناسب سمجھتے تھے۔ زید رضی اللہ عنہ نے بیان کیا کہ مجھ سے ابوبکر رضی اللہ عنہ نے کہا کہ تم جوان ہو، عقلمند ہو اور ہم تمہیں کسی بارے میں متہم بھی نہیں سمجھتے تم نبی کریم صلی اللہ علیہ وسلم کی وحی بھی لکھتے تھے، پس تم اس قرآن مجید ( کی آیات ) کو تلاش کرو اور ایک جگہ جمع کر دو۔ زید رضی اللہ عنہ نے بیان کیا کہ واللہ! اگر ابوبکر رضی اللہ عنہ مجھے کسی پہاڑ کو اٹھا کر دوسری جگہ رکھنے کا مکلف کرتے تو اس کا بوجھ بھی میں اتنا نہ محسوس کرتا جتنا کہ مجھے قرآن مجید کو جمع کرنے کے حکم سے محسوس ہوا۔ میں نے ان لوگوں سے کہا کہ آپ کس طرح ایسا کام کرتے ہیں جو رسول اللہ صلی اللہ علیہ وسلم نے نہیں کیا۔ ابوبکر نے کہا کہ واللہ! یہ خیر ہے۔ چنانچہ مجھے آمادہ کرنے کی کوشش کرتے رہے، یہاں تک کہ اللہ تعالیٰ نے اس کام کے لیے میرا بھی سینہ کھول دیا جس کے لیے ابوبکر و عمر رضی اللہ عنہما کا سینہ کھولا تھا اور میں بھی وہی مناسب خیال کرنے لگا جسے وہ لوگ مناسب خیال کر رہے تھے۔ چنانچہ میں نے قرآن مجید کی تلاش شروع کی۔ اسے میں کھجور کی چھال، چمڑے وغیرہ کے ٹکڑوں، پتلے پتھر کے ٹکڑوں اور لوگوں کے سینوں سے جمع کرنے لگا۔ میں نے سورۃ التوبہ کی آخری آیت «لقد جاءكم رسول من أنفسكم‏» آخر تک خزیمہ یا ابوخزیمہ رضی اللہ عنہ کے پاس پائی اور اس کو سورت میں شامل کر لیا۔ ( قرآن مجید کے یہ مرتب ) صحیفے ابوبکر رضی اللہ عنہ کے پاس رہے جب تک وہ زندہ ہے۔ یہاں تک کہ اللہ تعالیٰ نے انہیں وفات دی پھر وہ عمر رضی اللہ عنہ کے پاس آ گئے اور آخر وقت تک ان کے پاس رہے۔ جب آپ کو بھی اللہ تعالیٰ نے وفات دی تو وہ حفصہ بنت عمر رضی اللہ عنہا کے پاس محفوظ رہے۔ محمد بن عبیداللہ نے کہا کہ «اللخاف» کے لفظ سے ٹھیکری مراد ہے جسے «خزف‏.‏» کہتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7192,
			"arabicnumber": 7192,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابن ابی لیلیٰ نے (دوسری سند) امام بخاری رحمہ اللہ نے کہا کہ ہم سے اسماعیل نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، ان سے ابولیلیٰ بن عبداللہ بن عبدالرحمٰن بن سہل نے، ان سے سہل بن ابی حثمہ نے، انہیں سہل اور ان کی قوم کے بعض دوسرے ذمہ داروں نے خبر دی کہ عبداللہ، سہل اور محیصہ رضی اللہ عنہم خیبر کی طرف ( کھجور لینے کے لیے ) گئے۔ کیونکہ تنگ دستی میں مبتلا تھے۔ پھر محیصہ کو بتایا گیا کہ عبداللہ کو کسی نے قتل کر کے گڑھے یا کنویں میں ڈال دیا ہے۔ پھر وہ یہودیوں کے پاس گئے اور کہا کہ واللہ! تم نے ہی قتل کیا ہے۔ انہوں نے کہا: واللہ! ہم نے انہیں نہیں قتل کیا۔ پھر وہ واپس آئے اور اپنی قوم کے پاس آئے اور ان سے ذکر کیا۔ اس کے بعد وہ اور ان کے بھائی حویصہ جو ان سے بڑے تھے اور عبدالرحمٰن بن سہل رضی اللہ عنہ آئے، پھر محیصہ رضی اللہ عنہ نے بات کرنی چاہی کیونکہ آپ ہی خیبر میں موجود تھے لیکن نبی کریم صلی اللہ علیہ وسلم نے ان سے کہا کہ بڑے کو آگے کرو، بڑے کو آپ کی مراد عمر کی بڑائی تھی۔ چنانچہ حویصہ نے بات کی، پھر محیصہ نے بھی بات کی۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہودی تمہارے ساتھی کی دیت ادا کریں ورنہ لڑائی کے لیے تیار ہو جائیں۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے یہودیوں کو اس مقدمہ میں لکھا۔ انہوں نے جواب میں یہ لکھا کہ ہم نے انہیں نہیں قتل کیا ہے۔ پھر آپ نے حویصہ، محیصہ اور عبدالرحمٰن رضی اللہ عنہ سے کہا کہ کیا آپ لوگ قسم کھا کر اپنے شہید ساتھی کے خون کے مستحق ہو سکتے ہیں؟ ان لوگوں نے کہا کہ نہیں ( کیونکہ جرم کرتے دیکھا نہیں تھا ) پھر آپ نے فرمایا، کیا آپ لوگوں کے بجائے یہودی قسم کھائیں ( کہ انہوں نے قتل نہیں کیا ہے ) ؟ انہوں نے کہا کہ وہ مسلمان نہیں ہیں اور وہ جھوٹی قسم کھا سکتے ہیں۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے اپنی طرف سے سو اونٹوں کی دیت ادا کی اور وہ اونٹ گھر میں لائے گئے۔ سہل رضی اللہ عنہ نے بیان کیا کہ ان میں سے ایک اونٹنی نے مجھے لات ماری۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7194,
			"arabicnumber": 7194,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7195,
			"arabicnumber": 7195,
			"text": "خارجہ بن زید بن ثابت نے اپنے والد زید بن ثابت رضی اللہ عنہ سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ یہودیوں کی تحریر سیکھیں، یہاں تک کہ میں یہودیوں کے نام نبی کریم صلی اللہ علیہ وسلم کے خطوط لکھتا تھا اور جب یہودی آپ کو لکھتے تو ان کے خطوط آپ کو پڑھ کر سناتا تھا۔ عمر رضی اللہ عنہ نے عبدالرحمٰن بن حاطب سے پوچھا، اس وقت ان کے پاس علی، عبدالرحمٰن اور عثمان رضی اللہ عنہم بھی موجود تھے کہ یہ لونڈی کیا کہتی ہے؟ عبدالرحمٰن بن حاطب نے کہا کہ امیرالمؤمنین یہ آپ کو اس کے متعلق بتاتی ہے جس نے اس کے ساتھ زنا کیا ہے۔ ( جو یرغوس نام کا غلام تھا ) اور ابوجمرہ نے کہا کہ میں ابن عباس رضی اللہ عنہما اور لوگوں کے درمیان ترجمانی کرتا تھا اور بعض لوگوں ( امام محمد اور امام شافعی ) نے کہا کہ حاکم کے لیے دو ترجموں کا ہونا ضروری ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7196,
			"arabicnumber": 7196,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی انہیں زہری نے، انہیں عبیداللہ بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ ابوسفیان بن حرب نے انہیں خبر دی کہ ہرقل نے انہیں قریش کی ایک جماعت کے ساتھ بلا بھیجا، پھر اپنے ترجمان سے کہا، ان سے کہو کہ میں ان کے بارے میں پوچھوں گا۔ اگر یہ مجھ سے جھوٹ بات کہے تو اسے جھٹلا دیں۔ پھر پوری حدیث بیان کی اس سے کہو کہ اگر تمہاری باتیں صحیح ہیں تو وہ شخص اس ملک کا بھی ہو جائے گا جو اس وقت میرے قدموں کے نیچے ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7197,
			"arabicnumber": 7197,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہم کو عبدہ بن سلیمان نے خبر دی، ان سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے، ان سے ابو حمید ساعدی نے کہ نبی کریم صلی اللہ علیہ وسلم نے ابن الاتیہ کو بنی سلیم کے صدقہ کی وصول یابی کے لیے عامل بنایا۔ جب وہ نبی کریم صلی اللہ علیہ وسلم کے پاس ( وصول یابی کر کے ) آئے اور نبی کریم صلی اللہ علیہ وسلم نے ان سے حساب طلب فرمایا تو انہوں نے کہا یہ تو آپ لوگوں کا ہے اور یہ مجھے ہدیہ دیا گیا ہے۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم اپنے ماں باپ کے گھر کیوں نہ بیٹھے رہے، اگر تم سچے ہو تو وہاں بھی تمہارے پاس ہدیہ آتا۔ پھر آپ کھڑے ہوئے اور لوگوں کو خطبہ دیا۔ آپ نے حمد و ثنا کے بعد فرمایا، امابعد! میں کچھ لوگوں کو بعض ان کاموں کے لیے عامل بناتا ہوں جو اللہ تعالیٰ نے مجھے سونپے ہیں، پھر تم میں سے کوئی ایک آتا ہے اور کہتا ہے کہ یہ مال تمہارا ہے اور یہ ہدیہ ہے جو مجھے دیا گیا ہے۔ اگر وہ سچا ہے تو پھر کیوں نہ وہ اپنے باپ یا اپنی ماں کے گھر میں بیٹھا رہا تاکہ وہیں اس کا ہدیہ پہنچ جاتا۔ پس اللہ کی قسم! تم میں سے کوئی اگر اس مال میں سے کوئی چیز لے گا۔ ہشام نے آگے کا مضمون اس طرح بیان کیا کہ بلا حق کے تو قیامت کے دن اللہ تعالیٰ اسے اس طرح لائے گا کہ وہ اس کو اٹھائے ہوئے ہو گا۔ آگاہ ہو جاؤ کہ میں اسے پہچان لوں گا جو اللہ کے پاس وہ شخص لے کر آئے گا، اونٹ جو آواز نکال رہا ہو گا یا گائے جو اپنی آواز نکال رہی ہو گی یا بکری جو اپنی آواز نکال رہی ہو گی۔ پھر آپ نے اپنے ہاتھ اٹھائے یہاں تک کہ میں نے آپ کے بغلوں کی سفیدی دیکھی اور فرمایا کیا میں نے پہنچا دیا۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7198,
			"arabicnumber": 7198,
			"text": "ہم سے اصبغ نے بیان کیا، کہا ہم کو ابن وہب نے خبر دی، انہیں یونس نے خبر دی، انہیں ابن شہاب نے، انہیں ابوسلمہ نے اور انہیں ابو سعید خدری رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اللہ نے جب بھی کوئی نبی بھیجا یا کسی کو خلیفہ بنایا تو اس کے ساتھ دو رفیق تھے ایک تو انہیں نیکی کے لیے کہتا اور اس پر ابھارتا اور دوسرا انہیں برائی کے لیے کہتا اور اس پر ابھارتا۔ پس معصوم وہ ہے جسے اللہ بچائے رکھے۔“ اور سلیمان بن بلال نے اس حدیث کو یحییٰ بن سعید انصاری سے روایت کیا، کہا مجھ کو ابن شہاب نے خبر دی ( اس کو اسماعیلی نے وصل کیا ) اور ابن ابی عتیق اور موسیٰ بن عقبہ سے بھی، ان دونوں نے ابن شہاب سے یہی حدیث ( اس کو بیہقی نے وصل کیا ) اور شعیب بن ابی حمزہ نے زہری سے یوں روایت کی، مجھ سے ابوسلمہ نے بیان کیا، انہوں نے ابو سعید خدری رضی اللہ عنہ سے ان کا قول ( یعنی حدیث کوث موقوفاً نقل کیا ) اور امام اوزاعی اور معاویہ بن سلام نے کہا، مجھ سے زہری نے بیان کیا، کہا مجھ سے ابوسلمہ بن عبدالرحمٰن نے، انہوں نے ابوہریرہ رضی اللہ عنہ سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اور عبداللہ بن عبدالرحمٰن بن ابی حسین اور سعید بن زیاد نے اس کو ابوسلمہ سے روایت کیا ‘، انہوں نے ابوسعید خدری رضی اللہ عنہ سے موقوفاً ( یعنی ابوسعید کا قول ) اور عبداللہ بن ابی جعفر نے کہا، مجھ سے صفوان بن سلیم نے بیان کیا، انہوں نے ابوسلمہ سے، انہوں نے ابوایوب سے، کہا میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7200,
			"arabicnumber": 7200,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7201,
			"arabicnumber": 7201,
			"text": "ہم سے عمر بن علی نے بیان کیا، انہوں نے کہا ہم سے خالد بن حارث نے بیان کیا، انہوں نے کہا ہم سے حمید نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم سردی میں صبح کے وقت باہر نکلے اور مہاجرین اور انصار خندق کھود رہے تھے، پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اے اللہ! خیر تو آخرت ہی کی خیر ہے۔ پس انصار و مہاجرین کی مغفرت کر دے۔“ اس کا جواب لوگوں نے دیا کہ ہم وہ ہیں جنہوں نے محمد صلی اللہ علیہ وسلم سے جہاد پر بیعت کی ہے ہمیشہ کے لیے جب تک وہ زندہ ہیں۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7202,
			"arabicnumber": 7202,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک نے خبر دی، انہیں عبداللہ بن دینار نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ جب ہم رسول اللہ صلی اللہ علیہ وسلم سے سننے اور اطاعت کرنے کی بیعت کرتے تو آپ ہم سے فرماتے کہ جتنی تمہیں طاقت ہو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7203,
			"arabicnumber": 7203,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے سفیان نے، ان سے عبداللہ بن دینار نے بیان کیا کہا کہ میں اس وقت عبداللہ بن عمر رضی اللہ عنہما کے پاس موجود تھا جب سب لوگ عبدالملک بن مروان سے بیعت کے لیے جمع ہو گئے۔ بیان کیا کہ انہوں نے عبدالملک کو لکھا کہ ”میں سننے اور اطاعت کرنے کا اقرار کرتا ہوں عبداللہ عبدالملک امیرالمؤمنین کے لیے اللہ کے دین اور اس کے رسول کی سنت کے مطابق جتنی بھی مجھ میں قوت ہو گی اور یہ کہ میرے لڑکے بھی اس کا اقرار کرتے ہیں۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7204,
			"arabicnumber": 7204,
			"text": "ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا ہم کو سیار نے خبر دی، انہیں شعبی نے، ان سے جریر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سننے اور اطاعت کرنے کی بیعت کی تو آپ نے مجھے اس کی تلقین کی کہ جتنی مجھ میں طاقت ہو اور ہر مسلمان کے ساتھ خیر خواہی کرنے پر بھی بیعت کی۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7205,
			"arabicnumber": 7205,
			"text": "ہم سے عمرو بن علی نے بیان کیا، انہوں نے کہا ہم سے یحییٰ نے بیان کیا، ان سے سفیان نے بیان کیا، انہوں نے کہا مجھ سے عبداللہ بن دینار نے بیان کیا کہا کہ جب لوگوں نے عبدالملک کی بیعت کی تو عبداللہ بن عمر رضی اللہ عنہما نے اسے لکھا ”اللہ کے بندے عبدالملک امیرالمؤمنین کے نام، میں اقرار کرتا ہوں سننے اور اطاعت کرنے کی۔ اللہ کے بندے عبدالملک امیرالمؤمنین کے لیے اللہ کے دین اور اس کے رسول کی سنت کے مطابق، جتنی مجھ میں طاقت ہو گی اور میرے بیٹوں نے بھی اس کا اقرار کیا۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7206,
			"arabicnumber": 7206,
			"text": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے حاتم نے بیان کیا، ان سے یزید نے بیان کیا کہ میں نے سلمہ رضی اللہ عنہ سے پوچھا آپ لوگوں نے صلح حدیبیہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم سے کس بات پر بیعت کی تھی؟ انہوں نے کہا کہ موت پر۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7207,
			"arabicnumber": 7207,
			"text": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا، کہا ہم سے جویریہ بن اسماء نے بیان کیا، ان سے امام مالک نے، ان سے زہری نے، انہیں حمید بن عبدالرحمٰن نے خبر دی اور انہیں مسور بن مخرمہ نے خبر دی کہ وہ چھ آدمی جن کو عمر رضی اللہ عنہ خلافت کے لیے نامزد کر گئے تھے ( یعنی علی ‘ عثمان ‘ زبیر ‘ طلحہ اور عبدالرحمٰن بن عوف رضی اللہ عنہم کہ ان میں سے کسی ایک کو اتفاق سے خلیفہ بنا لیا جائے ) یہ سب جمع ہوئے اور مشورہ کیا۔ ان سے عبدالرحمٰن بن عوف نے کہا خلیفہ ہونے کے لیے میں آپ لوگوں سے کوئی مقابلہ نہیں کروں گا۔ البتہ اگر آپ لوگ چاہیں تو آپ لوگوں کے لیے کوئی خلیفہ آپ ہی میں سے میں چن دوں۔ چنانچہ سب نے مل کر اس کا اختیار عبدالرحمٰن بن عوف کو دے دیا۔ جب ان لوگوں نے انتخاب کی ذمہ داری عبدالرحمٰن رضی اللہ عنہ کے سپرد کر دی تو سب لوگ ان کی طرف جھک گئے۔ جتنے لوگ بھی اس جماعت کے پیچھے چل رہے تھے، ان میں اب میں نے کسی کو بھی ایسا نہ دیکھا جو عبدالرحمٰن کے پیچھے نہ چل رہا ہو۔ سب لوگ ان ہی کی طرف مائل ہو گئے اور ان دنوں میں ان سے مشورہ کرتے رہے جب وہ رات آئی جس کی صبح کو ہم نے عثمان رضی اللہ عنہ سے بیعت کی۔ مسور رضی اللہ عنہ نے بیان کیا تو عبدالرحمٰن رضی اللہ عنہ رات گئے میرے یہاں آئے اور دروازہ کھٹکٹھایا یہاں تک کہ میں بیدار ہو گیا۔ انہوں نے کہا میرا خیال ہے آپ سو رہے تھے، اللہ کی قسم میں ان راتوں میں بہت کم سو سکا ہوں۔ جائیے! زبیر اور سعد کو بلائیے۔ میں ان دونوں بزرگوں کو بلا لایا اور انہوں نے ان سے مشورہ کیا، پھر مجھے بلایا اور کہا کہ میرے لیے علی رضی اللہ عنہ کو بھی بلا دیجئیے۔ میں نے انہیں بھی بلایا اور انہوں نے ان سے بھی سر گوشی کی۔ یہاں تک کہ آدھی رات گزر گئی۔ پھر علی رضی اللہ عنہ ان کے پاس کھڑے ہو گئے اور ان کو اپنے ہی لیے امید تھی۔ عبدالرحمٰن کے دل میں بھی ان کی طرف سے یہی ڈر تھا، پھر انہوں نے کہا کہ میرے لیے عثمان رضی اللہ عنہ کو بھی بلا لائیے۔ میں نے انہیں بھی بلا لایا اور انہوں نے ان سے بھی سرگوشی کی۔ آخر صبح کے مؤذن نے ان کے درمیان جدائی کی۔ جب لوگوں نے صبح کی نماز پڑھ لی اور یہ سب لوگ منبر کے پاس جمع ہوئے تو انہوں نے موجود مہاجرین، انصار اور لشکروں کے قائدین کو بلایا۔ ان لوگوں نے اس سال حج عمر رضی اللہ عنہ کے ساتھ کیا تھا۔ جب سب لوگ جمع ہو گئے تو عبدالرحمٰن رضی اللہ عنہ نے خطبہ پڑھا پھر کہا امابعد! اے علی! میں نے لوگوں کے خیالات معلوم کئے اور میں نے دیکھا کہ وہ عثمان کو مقدم سمجھتے ہیں اور ان کے برابر کسی کو نہیں سمجھتے، اس لیے آپ اپنے دل میں کوئی میل پیدا نہ کریں۔ پھر کہا میں آپ ( عثمان رضی اللہ عنہ ) سے اللہ کے دین اور اس کے رسول کی سنت اور آپ کے دو خلفاء کے طریق کے مطابق بیعت کرتا ہوں۔ چنانچہ پہلے ان سے عبدالرحمٰن بن عوف رضی اللہ عنہ نے بیعت کی، پھر سب لوگوں نے اور مہاجرین، انصار اور فوجیوں کے سرداروں اور تمام مسلمانوں نے بیعت کی۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7208,
			"arabicnumber": 7208,
			"text": "ہم سے ابوالعاصم نے بیان کیا، کہا ہم سے یزید بن ابی عبید نے، ان سے سلمہ رضی اللہ عنہ نے بیان کیا کہ ہم نے نبی کریم صلی اللہ علیہ وسلم سے درخت کے نیچے بیعت کی۔ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے فرمایا ”سلمہ! کیا تم بیعت نہیں کرو گے؟ میں نے عرض کیا: یا رسول اللہ! میں نے پہلی ہی مرتبہ میں بیعت کر لی ہے، فرمایا کہ اور دوسری مرتبہ میں بھی کر لو۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7209,
			"arabicnumber": 7209,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7210,
			"arabicnumber": 7210,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے عبداللہ بن یزید نے بیان کیا، ان سے سعید ابن ابی ایوب نے بیان کیا، ان سے ابوعقیل زہرہ بن معبد نے بیان کیا انہوں نے اپنے دادا عبداللہ بن ہشام رضی اللہ عنہ سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم کا زمانہ پایا تھا اور ان کی والدہ زینب بنت حمید ان کو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر حاضر ہوئی تھیں اور عرض کیا تھا یا رسول اللہ! اس سے بیعت لے لیجئے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ابھی کمسن ہے پھر نبی کریم صلی اللہ علیہ وسلم نے اس کے سر پر ہاتھ پھیرا اور ان کے لیے دعا فرمائی اور اپنے تمام گھر والوں کی طرف سے ایک ہی بکری قربانی کیا کرتے تھے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7211,
			"arabicnumber": 7211,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7212,
			"arabicnumber": 7212,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم سے ابوحمزہ محمد بن سیرین نے بیان کیا، ان سے اعمش نے، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”تین آدمی ایسے ہیں جن سے اللہ تعالیٰ قیامت کے دن بات نہیں کرے گا اور نہ انہیں پاک کرے گا اور ان کے لیے بہت سخت دکھ دینے والا عذاب ہو گا۔ ایک وہ شخص جس کے پاس راستے میں زیادہ پانی ہو اور وہ مسافر کو اس میں سے نہ پلائے دوسرا وہ شخص جو امام سے بیعت کرے اور بیعت کی غرض صرف دنیا کمانا ہو اگر وہ امام اسے کچھ دنیا دیدے تو بیعت پوری کرے ورنہ توڑ دے۔ تیسرا وہ شخص جو کسی دوسرے سے کچھ مال متاع عصر کے بعد بیچ رہا ہو اور قسم کھائے کہ اسے اس سامان کی اتنی اتنی قیمت مل رہی تھی اور پھر خریدنے والا اسے سچا سمجھ کر اس مال کو لے لے حالانکہ اسے اس کی اتنی قیمت نہیں مل رہی تھی۔“",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7213,
			"arabicnumber": 7213,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی انہیں زہری نے (دوسری سند) اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا، ان سے ابن شہاب نے، کہا مجھ کو ابوادریس خولانی نے خبر دی، انہوں نے عبادہ بن صامت رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ ہم مجلس میں موجود تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”مجھ سے بیعت کرو کہ اللہ کے ساتھ کسی کو شریک نہیں ٹھہراؤ گے، چوری نہیں کرو گے، زنا نہیں کرو گے، اپنی اولاد کو قتل نہیں کرو گے اور اپنی طرف سے گھڑ کر کسی پر بہتان نہیں لگاؤ گے اور نیک کام میں نافرمانی نہیں کرو گے۔ پس جو کوئی تم میں سے اس وعدے کو پورا کرے اس کا ثواب اللہ کے یہاں اسے ملے گا اور جو کوئی ان کاموں میں سے کسی برے کام کو کرے گا اس کی سزا اسے دنیا میں ہی مل جائے گی تو یہ اس کے لیے کفارہ ہو گا اور جو کوئی ان میں سے کسی برائی کا کام کرے گا اور اللہ اسے چھپا لے گا تو اس کا معاملہ اللہ کے حوالہ ہے۔ چاہے تو اس کی سزا دے اور چاہے اسے معاف کر دے۔“ چنانچہ ہم نے اس پر نبی کریم صلی اللہ علیہ وسلم سے بیعت کی۔ بیعت اقرار کو کہتے ہیں جو خلیفہ اسلام کے ہاتھ پر ہاتھ رکھ کر کیا جائے یا پھر کسی نیک صالح انسان کے ہاتھ پر ہو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7214,
			"arabicnumber": 7214,
			"text": "ہم سے محمود بن غیلان نے بیان کیا، کہا ہم سے عبدالرزاق بن ہمام نے بیان کیا، کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم عورتوں سے زبانی اس آیت کے احکام کی بیعت لیتے کہ وہ اللہ کے ساتھ کسی کو شریک نہیں ٹھہرائیں گی آخر آیت تک۔ بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ نے کبھی کسی عورت کا ہاتھ نہیں چھوا، سوا اس عورت کے جو آپ کی لونڈی ہو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7215,
			"arabicnumber": 7215,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، ان سے ایوب نے، ان سے حفصہ نے اور ان سے ام عطیہ رضی اللہ عنہا نے کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تو آپ نے میرے سامنے سورۃ الممتحنہ کی یہ آیت پڑھی «أن لا يشركن بالله شيئا‏» یہ کہ ”وہ اللہ کے ساتھ کسی کو شریک نہ ٹھہرائیں گی“ آخر تک۔ اور ہمیں آپ صلی اللہ علیہ وسلم نے نوحہ سے منع کیا پھر ہم میں سے ایک عورت نے اپنا ہاتھ کھینچ لیا اور کہا کہ فلاں عورت نے کسی نوحہ میں میری مدد کی تھی ( میرے ساتھ مل کر نوحہ کیا تھا ) اور میں اسے اس کا بدلہ دینا چاہتی ہوں۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے کچھ نہیں کہا، پھر وہ گئیں اور واپس آئیں ( میرے ساتھ بیعت کرنے والی عورتوں میں سے ) کسی عورت نے اس بیعت کو پورا نہیں کیا، سوا ام سلیم اور ام العلاء اور معاذ رضی اللہ عنہم کی بیوی ابوسبرہ کی بیٹی کے یا ابوسبرہ کی بیٹی اور معاذ کی بیوی کے اور سب عورتوں نے احکام بیعت کو پورے طور پر ادا نہ کر کے بیعت کو نہیں نبھایا۔ غفر اللہ لھن اجمعین۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7216,
			"arabicnumber": 7216,
			"text": "ہم سے ابونعیم (فضل بن دکین) نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے محمد بن منکدر نے، انہوں نے کہا میں نے جابر بن عبداللہ انصاری رضی اللہ عنہ سے سنا، وہ کہتے تھے ایک گنوار ( نام نامعلوم ) یا قیس بن ابی حازم نبی کریم صلی اللہ علیہ وسلم کے پاس آیا، کہنے لگا: یا رسول اللہ! اسلام پر مجھ سے بیعت لیجئے۔ آپ نے اس سے بیعت لے لی، پھر دوسرے دن بخار میں ہلہلاتا آیا کہنے لگا میری بیعت فسخ کر دیجئیے۔ آپ صلی اللہ علیہ وسلم نے انکار کیا ( بیعت فسخ نہیں کی ) جب وہ پیٹھ موڑ کر چلتا ہوا، تو فرمایا مدینہ کیا ہے ( لوہار کی بھٹی ہے ) پلید اور ناپاک ( میل کچیل ) کو چھانٹ ڈالتا ہے اور کھرا ستھرا مال رکھ لیتا ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7217,
			"arabicnumber": 7217,
			"text": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم کو سلیمان بن بلال نے خبر دی، انہیں یحییٰ بن سعید نے، کہا میں نے قاسم بن محمد سے سنا کہ عائشہ رضی اللہ عنہا نے کہا ( اپنے سر درد پر ) ہائے سر پھٹا جاتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم مر جاؤ اور میں زندہ رہا تو میں تمہارے لیے مغفرت کروں گا اور تمہارے لیے دعا کروں گا۔ عائشہ رضی اللہ عنہا نے اس پر کہا افسوس میرا خیال ہے کہ آپ میری موت چاہتے ہیں اور اگر ایسا ہو گیا تو آپ دن کے آخری وقت ضرور کسی دوسری عورت سے شادی کر لیں گے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تو نہیں بلکہ میں اپنا سر دکھنے کا اظہار کرتا ہوں۔ میرا ارادہ ہوا تھا کہ ابوبکر اور ان کے بیٹے کو بلا بھیجوں اور انہیں ( ابوبکر کو ) خلیفہ بنا دوں تاکہ اس پر کسی دعویٰ کرنے والے یا اس کی خواہش رکھنے والے کے لیے کوئی گنجائش نہ رہے لیکن پھر میں نے سوچا کہ اللہ خود ( کسی دوسرے کو خلیفہ ) نہیں ہونے دے گا اور مسلمان بھی اسے دفع کریں گے۔ یا ( آپ نے اس طرح فرمایا کہ ) اللہ دفع کرے گا اور مسلمان کسی اور کو خلیفہ نہ ہونے دیں گے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7218,
			"arabicnumber": 7218,
			"text": "ہم سے محمد بن یوسف فریابی نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، انہیں ہشام بن عروہ نے، انہیں ان کے والد نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ عمر رضی اللہ عنہ جب زخمی ہوئے تو ان سے کہا گیا کہ آپ اپنا خلیفہ کسی کو کیوں نہیں منتخب کر دیتے، آپ نے فرمایا کہ اگر کسی کو خلیفہ منتخب کرتا ہوں ( تو اس کی بھی مثال ہے کہ ) اس شخص نے اپنا خلیفہ منتخب کیا تھا جو مجھ سے بہتر تھے یعنی ابوبکر رضی اللہ عنہ اور اگر میں اسے مسلمانوں کی رائے پر چھوڑتا ہوں تو ( اس کی بھی مثال موجود ہے کہ ) اس بزرگ نے ( خلیفہ کا انتخاب مسلمانوں کے لیے ) چھوڑ دیا تھا جو مجھ سے بہتر تھے یعنی رسول اللہ صلی اللہ علیہ وسلم ۔ پھر لوگوں نے آپ کی تعریف کی، پھر انہوں نے کہا کہ کوئی تو دل سے میری تعریف کرتا ہے کوئی ڈر کر۔ اب میں تو یہی غنیمت سمجھتا ہوں کہ خلافت کی ذمہ داریوں میں اللہ کے ہاں برابر برابر ہی چھوٹ جاؤں، نہ مجھے کچھ ثواب ملے اور نہ کوئی عذاب میں نے خلافت کا بوجھ اپنی زندگی بھر اٹھایا۔ اب مرنے پر میں اس بار کو نہیں اٹھاؤں گا۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7219,
			"arabicnumber": 7219,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام نے خبر دی، انہیں معمر نے، انہیں زہری نے، انہیں انس بن مالک رضی اللہ عنہ نے خبر دی کہ انہوں نے عمر رضی اللہ عنہ کا دوسرا خطبہ سنا جب آپ منبر پر بیٹھے ہوئے تھے، یہ واقعہ رسول اللہ صلی اللہ علیہ وسلم کی وفات کے دوسرے دن کا ہے۔ انہوں نے کلمہ شہادت پڑھا، ابوبکر رضی اللہ عنہ خاموش تھے اور کچھ نہیں بول رہے تھے، پھر کہا مجھے امید تھی کہ نبی کریم صلی اللہ علیہ وسلم زندہ رہیں گے اور ہمارے کاموں کی تدبیر و انتظام کرتے رہیں گے۔ ان کا منشا یہ تھا کہ نبی کریم صلی اللہ علیہ وسلم ان سب لوگوں کے بعد تک زندہ رہیں گے تو اگر آج محمد صلی اللہ علیہ وسلم وفات پا گئے ہیں تو اللہ تعالیٰ نے تمہارے سامنے نور ( قرآن ) کو باقی رکھا ہے جس کے ذریعہ تم ہدایت حاصل کرتے رہو گے اور اللہ نے محمد صلی اللہ علیہ وسلم کو اس سے ہدایت کی اور ابوبکر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے ساتھی ( جو غار ثور میں ) دو میں کے دوسرے ہیں، بلا شک وہ تمہارے امور خلافت کے لیے تمام مسلمانوں میں سب سے بہتر ہیں، پس اٹھو اور ان سے بیعت کرو۔ ایک جماعت ان سے پہلے ہی سقیفہ بنی ساعدہ میں بیعت کر چکی تھی، پھر عام لوگوں نے منبر پر بیعت کی۔ زہری نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے، انہوں نے عمر رضی اللہ عنہ سے سنا کہ وہ ابوبکر رضی اللہ عنہ سے، اس دن کہہ رہے تھے، منبر پر چڑھ آئیے۔ چنانچہ وہ اس کا برابر اصرار کرتے رہے، یہاں تک کہ ابوبکر رضی اللہ عنہ منبر پر چڑھ گئے اور سب لوگوں نے آپ سے بیعت کی۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7220,
			"arabicnumber": 7220,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ان کے والد نے، ان سے محمد بن جبیر بن مطعم نے، ان سے ان کے والد نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے پاس ایک خاتون آئیں اور کسی معاملہ میں آپ سے گفتگو کی، پھر نبی کریم صلی اللہ علیہ وسلم نے ان سے کہا کہ وہ دوبارہ آپ کے پاس آئیں۔ انہوں نے عرض کیا: یا رسول اللہ! اگر میں آؤں اور آپ کو نہ پاؤں تو پھر آپ کیا فرماتے ہیں؟ جیسے ان کا اشارہ وفات کی طرف ہو۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر مجھے نہ پاؤ تو ابوبکر کے پاس آئیو۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7221,
			"arabicnumber": 7221,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے سفیان نے، ان سے قیس بن مسلم نے، ان سے طارق بن شہاب نے کہ ابوبکر رضی اللہ عنہ نے قبائل بزاخہ کے وفد سے ( جو نبی کریم صلی اللہ علیہ وسلم کی وفات کے بعد مرتد ہو گیا تھا اور اب معافی کے لیے آیا تھا ) فرمایا کہ اونٹوں کی دموں کے پیچھے پیچھے جنگلوں میں گھومتے رہو، یہاں تک کہ اللہ تعالیٰ اپنے نبی کریم صلی اللہ علیہ وسلم کے خلیفہ اور مہاجرین کو کوئی امر بتلا دے جس کی وجہ سے وہ تمہارا قصور معاف کر دیں۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7223,
			"arabicnumber": 7223,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7224,
			"arabicnumber": 7224,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7225,
			"arabicnumber": 7225,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے کہ عبداللہ بن کعب بن مالک، کعب بن مالک رضی اللہ عنہ کے نابینا ہو جانے کے زمانے میں ان کے سب لڑکوں میں یہی راستے میں ان کے ساتھ چلتے تھے، ( انہوں ) نے بیان کیا کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا، انہوں نے کہا کہ جب وہ غزوہ تبوک میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نہیں جا سکتے تھے، پھر انہوں نے اپنا پورا واقعہ بیان کیا اور نبی کریم صلی اللہ علیہ وسلم نے مسلمانوں کو ہم سے گفتگو کرنے سے روک دیا تھا تو ہم پچاس دن اسی حالت میں رہے، پھر نبی کریم صلی اللہ علیہ وسلم نے اعلان کیا کہ اللہ نے ہماری توبہ قبول کر لی ہے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 84
			}
		}
	]
}