{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"94": "Wishes"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7226,
			"arabicnumber": 7226,
			"text": "ہم سے سعید بن عفیر نے بیان کیا، کہا مجھ سے لیث بن سعد نے، کہا مجھ سے عبدالرحمٰن بن خالد نے بیان کیا، ان سے ابن شہاب نے، ان سے ابوسلمہ اور سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم نے سنا آپ صلی اللہ علیہ وسلم نے فرمایا ”اس ذات کی قسم جس کے ہاتھ میں میری جان ہے۔ اگر ان لوگوں کا خیال نہ ہوتا جو میرے ساتھ غزوہ میں شریک نہ ہو سکنے کو برا جانتے ہیں مگر اسباب کی کمی کی وجہ سے وہ شریک نہیں ہو سکتے اور کوئی ایسی چیز میرے پاس نہیں ہے جس پر انہیں سوار کروں تو میں کبھی ( غزاوات میں شریک ہونے سے ) پیچھے نہ رہتا۔ میری خواہش ہے کہ اللہ کے راستے میں قتل کیا جاؤں پھر زندہ کیا جاؤں، پھر قتل کیا جاؤں، پھر زندہ کیا جاؤں، پھر قتل کیا جاؤں، اور پھر زندہ کیا جاؤں اور پھر مارا جاؤں۔“",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7227,
			"arabicnumber": 7227,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو مالک نے خبر دی، انہیں ابوالزناد نے، انہیں اعرج نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اس ذات کی قسم جس کے ہاتھ میں میری جان ہے، میری آرزو ہے کہ میں اللہ کے راستے میں جنگ کروں اور قتل کیا جاؤں پھر زندہ کیا جاؤں، پھر قتل کیا جاؤں، پھر زندہ کیا جاؤں، پھر قتل کیا جاؤں، ابوہریرہ رضی اللہ عنہ ان الفاظ کو تین مرتبہ دہراتے تھے کہ میں اللہ کو گواہ کر کے کہتا ہوں۔“",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7228,
			"arabicnumber": 7228,
			"text": "ہم سے اسحاق بن نصر نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ان سے معمر نے، ان سے ہمام بن منبہ نے، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اگر میرے پاس احد پہاڑ کے برابر سونا ہوتا تو میں پسند کرتا کہ اگر ان کے لینے والے مل جائیں تو تین دن گزرنے سے پہلے ہی میرے پاس اس میں سے ایک دینار بھی نہ بچے، سوا اس کے جسے میں اپنے اوپر قرض کی ادائیگی کے لیے روک لوں۔“",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7229,
			"arabicnumber": 7229,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عروہ رضی اللہ عنہ نے کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ( حجتہ الوداع کے موقع پر ) فرمایا ”اگر مجھ کو اپنا حال پہلے سے معلوم ہوتا جو بعد کو معلوم ہوا تو میں اپنے ساتھ قربانی کا جانور نہ لاتا اور عمرہ کر کے دوسرے لوگوں کی طرح بھی احرام کھول ڈالتا۔“",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7230,
			"arabicnumber": 7230,
			"text": "ہم سے حسن بن عمر جرمی نے بیان کیا، کہا ہم سے یزید بن زریع بصریٰ نے، ان سے حبیب بن ابی قریبہ نے، ان سے عطاء بن ابی رباح نے، ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ( حجۃ الوداع کے موقع پر ) ساتھ تھے، پھر ہم نے حج کے لیے تلبیہ کہا اور 4 ذی الحجہ کو مکہ پہنچے، پھر نبی کریم صلی اللہ علیہ وسلم نے ہمیں بیت اللہ اور صفا اور مروہ کے طواف کا حکم دیا اور یہ کہ ہم اسے عمرہ بنا لیں اور اس کے بعد حلال ہو جائیں ( سوا ان کے جن کے ساتھ قربانی کا جانور ہو وہ حلال نہیں ہو سکتے ) بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم اور طلحہ رضی اللہ عنہ کے سوا ہم میں سے کسی کے پاس قربانی کا جانور نہ تھا اور علی رضی اللہ عنہ یمن سے آئے تھے اور ان کے ساتھ بھی ہدی تھی اور کہا کہ میں بھی اس کا احرام باندھ کر آیا ہوں جس کا رسول اللہ صلی اللہ علیہ وسلم نے احرام باندھا ہے، پھر دوسرے لوگ کہنے لگے کہ کیا ہم اپنی عورتوں کے ساتھ صحبت کرنے کے بعد منیٰ جا سکتے ہیں؟ ( اس حال میں کہ ہمارے ذکر منی ٹپکاتے ہوں؟ ) نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ جو بات مجھے بعد میں معلوم ہوئی اگر پہلے ہی معلوم ہوتی تو میں ہدی ساتھ نہ لاتا اور اگر میرے ساتھ ہدی نہ ہوتی تو میں بھی حلال ہو جاتا۔ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سے سراقہ بن مالک نے ملاقات کی۔ اس وقت آپ بڑے شیطان پر رمی کر رہے تھے اور پوچھا یا رسول اللہ! ( کیا ) یہ ہمارے لیے خاص ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ ہمیشہ کے لیے ہے۔ بیان کیا کہ عائشہ رضی اللہ عنہا بھی مکہ آئی تھیں لیکن وہ حائضہ تھیں تو نبی کریم صلی اللہ علیہ وسلم نے انہیں تمام اعمال حج ادا کرنے کا حکم دیا، صرف وہ پاک ہونے سے پہلے طواف نہیں کر سکتی تھیں اور نہ نماز پڑھ سکتی تھیں۔ جب سب لوگ بطحاء میں اترے تو عائشہ رضی اللہ عنہا نے کہا: یا رسول اللہ! کیا آپ سب لوگ عمرہ و حج دونوں کر کے لوٹیں گے اور میرا صرف حج ہو گا؟ بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن ابی بکر صدیق رضی اللہ عنہ کو حکم دیا کہ عائشہ کو ساتھ لے کر مقام تنعیم جائیں۔ چنانچہ انہوں نے بھی ایام حج کے بعد ذی الحجہ میں عمرہ کیا۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7231,
			"arabicnumber": 7231,
			"text": "ہم سے خالد بن مخلد نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، کہا مجھ سے یحییٰ بن سعید نے بیان کیا، انہوں نے عبداللہ بن عامر بن ربیعہ سے سنا کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک رات نبی کریم صلی اللہ علیہ وسلم کو نیند نہ آئی، پھر آپ صلی اللہ علیہ وسلم نے فرمایا ”کاش میرے صحابہ میں سے کوئی نیک مرد میرے لیے آج رات پہرہ دیتا۔“ اتنے میں ہم نے ہتھیاروں کی آواز سنی۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا کون صاحب ہیں؟ بتایا گیا کہ سعد بن ابی وقاص رضی اللہ عنہ ہیں یا رسول اللہ! ( انہوں نے کہا ) میں آپ کے لیے پہرہ دینے آیا ہوں، پھر نبی کریم صلی اللہ علیہ وسلم سوئے یہاں تک کہ ہم نے آپ کے خراٹے کی آواز سنے۔ ابوعبداللہ امام بخاری رحمہ اللہ نے بیان کیا کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ بلال رضی اللہ عنہ جب نئے نئے مدینہ آئے تو بحالت بخار حیرانی میں یہ شعر پڑھتے تھے۔ ”کاش میں جانتا کہ میں ایک رات اس وادی میں گزار سکوں گا۔۔۔ ( وادی میں ) اور میرے چاروں طرف اذخر اور جیل گھاس ہو گی۔“ پھر میں نے نبی کریم صلی اللہ علیہ وسلم سے اس کی خبر کی۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7232,
			"arabicnumber": 7232,
			"text": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر بن عبدالحمید نے بیان کیا، ان سے اعمش نے، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”رشک صرف دو شخصوں پر ہو سکتا ہے ایک وہ جسے اللہ نے قرآن دیا ہے اور وہ اسے دن رات پڑھتا رہتا ہے اور اس پر ( سننے والا ) کہے کہ اگر مجھے بھی اس کا ایسا ہی علم ہوتا جیسا کہ اس شخص کو دیا گیا ہے تو میں بھی اسی طرح کرتا جیسا کہ یہ کرتا ہے اور دوسرا وہ شخص جسے اللہ نے مال دیا اور وہ اسے اللہ کے راستے میں خرچ کرتا ہے تو ( دیکھنے والا ) کہے کہ اگر مجھے بھی اتنا دیا جاتا جیسا اسے دیا گیا ہے تو میں بھی اسی طرح کرتا جیسا کہ یہ کر رہا ہے۔“ ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے پھر یہی حدیث بیان کی۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7233,
			"arabicnumber": 7233,
			"text": "ہم سے حسن بن ربیع نے بیان کیا، ان سے ابوالاحوص نے، ان سے عاصم نے بیان کیا، ان سے نضر بن انس نے بیان کیا کہ انس بن مالک رضی اللہ عنہ نے کہا اگر میں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ نہ سنا ہوتا کہ موت کی تمنا نہ کرو تو میں موت کی آرزو کرتا۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7234,
			"arabicnumber": 7234,
			"text": "ہم سے محمد نے بیان کیا، کہا ہم سے عبدہ نے بیان کیا، ان سے ابن ابی خالد نے، ان سے قیس نے بیان کیا کہ ہم خباب بن ارت رضی اللہ عنہ کی خدمت میں ان کی عبادت کے لیے حاضر ہوئے۔ انہوں نے سات داغ لگوائے تھے، پھر انہوں نے کہا کہ اگر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں موت کی دعا کرنے سے منع نہ کیا ہوتا تو میں اس کی دعا کرتا۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7235,
			"arabicnumber": 7235,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا، انہوں نے کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں ابی عبید نے جن کا نام سعد بن عبید ہے، عبدالرحمٰن بن ازہر کے مولیٰ کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کوئی شخص تم میں سے موت کی آرزو نہ کرے، اگر وہ نیک ہے تو ممکن ہے نیکی میں اور زیادہ ہو اور اگر برا ہے تو ممکن ہے اس سے توبہ کر لے۔“",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7236,
			"arabicnumber": 7236,
			"text": "ہم سے عبدان نے بیان کیا، کہا ہم کو ہمارے والد عثمان بن جبلہ نے خبر دی، انہیں شعبہ نے، ان سے ابواسحاق نے بیان کیا اور ان سے براء بن عازب رضی اللہ عنہ نے کہ غزوہ خندق کے دن ( خندق کھودتے ہوئے ) رسول اللہ صلی اللہ علیہ وسلم بھی خود ہمارے ساتھ مٹی اٹھایا کرتے تھے۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو اس حال میں دیکھا کہ مٹی نے آپ کے پیٹ کی سفیدی کو چھپا دیا تھا۔ آپ صلی اللہ علیہ وسلم فرماتے تھے ”اگر تو نہ ہوتا ( اے اللہ! ) تو ہم نہ ہدایت پاتے، نہ ہم صدقہ دیتے، نہ نماز پڑھتے۔ پس ہم پر دل جمعی نازل فرما۔ اس معاندین کی جمات نے ہمارے خلاف حد سے آگے بڑھ کر حملہ کیا ہے۔ جب یہ فتنہ چاہتے ہیں تو ہم ان کی بات نہیں مانتے، نہیں مانتے۔ اس پر آپ آواز کو بلند کر دیتے۔“",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7237,
			"arabicnumber": 7237,
			"text": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا ہم سے معاویہ بن عمرو نے بیان کیا، انہوں نے کہا ہم سے ابواسحاق نے بیان کیا، ان سے موسیٰ بن عقبہ نے بیان کیا، ان سے عمر بن عبیداللہ کے غلام سالم ابوالنضر نے بیان کیا، جو اپنے آقا کے کاتب تھے بیان کیا کہ عبداللہ بن ابی اوفی رضی اللہ عنہما نے انہیں لکھا اور میں نے اسے پڑھا تو اس میں یہ مضمون تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ دشمن سے مڈبھیڑ ہونے کی تمنا نہ کرو اور اللہ سے عافیت کی دعا مانگا کرو۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7238,
			"arabicnumber": 7238,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، کہا ہم سے ابوالزناد نے بیان کیا، ان سے قاسم بن محمد نے بیان کیا کہ ابن عباس رضی اللہ عنہما نے دو لعان کرنے والوں کا ذکر کیا تو اس پر عبداللہ بن شداد نے پوچھا: کیا یہی وہ ہیں جن کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ ”اگر میں کسی عورت کو بغیر گواہ کے رجم کر سکتا تو اسے کرتا۔“ ابن عباس رضی اللہ عنہما نے کہا کہ نہیں وہ ایک ( اور ) عورت تھی جو ( اسلام لانے کے بعد ) کھلے عام ( فحش کام ) کرتی تھی۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7239,
			"arabicnumber": 7239,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں نے کہا ہم سے سفیان بن عیینہ نے کہ عمرو بن دینار نے کہا، ہم سے عطاء بن ابی رباح نے بیان کیا کہ ایک رات ایسا ہوا نبی کریم صلی اللہ علیہ وسلم نے عشاء کی نماز میں دیر کی۔ آخر عمر رضی اللہ عنہ نکلے اور کہنے لگے یا رسول اللہ! نماز پڑھئے عورتیں اور بچے سونے لگے۔ اس وقت آپ صلی اللہ علیہ وسلم ( حجرے سے ) برآمد ہوئے آپ کے سر سے پانی ٹپک رہا تھا ( غسل کر کے باہر تشریف لائے ) فرمانے لگے اگر میری امت پر یا یوں فرمایا کہ لوگوں پر دشوار نہ ہوتا۔ سفیان بن عیینہ نے یوں کہا کہ میری امت پر دشوار نہ ہوتا تو میں اس وقت ( اتنی رات گئے ) ان کو یہ نماز پڑھنے کا حکم دیتا۔ اور ابن جریج نے ( اسی سند سے سفیان سے، انہوں نے ( ابن جریج سے ) انہوں نے عطاء سے روایت کی، انہوں نے ابن عباس رضی اللہ عنہما سے کہ نبی کریم صلی اللہ علیہ وسلم نے اس نماز ( یعنی عشاء کی نماز میں دیر کی۔ عمر رضی اللہ عنہ آئے اور کہنے لگے یا رسول اللہ! عورتیں بچے سو گئے۔ یہ سن کر آپ باہر تشریف لائے، اپنے سر کی ایک جانب سے پانی پونچھ رہے تھے، فرما رہے تھے اس نماز کا ( عمدہ ) وقت یہی ہے اگر میری امت پر شاق نہ ہو۔ عمرو بن دینار نے اس حدیث میں یوں نقل کیا۔ ہم سے عطاء نے بیان کیا اور ابن عباس رضی اللہ عنہما کا ذکر نہیں کیا لیکن عمرو نے یوں کہا آپ کے سر سے پانی ٹپک رہا تھا۔ اور ابن جریج کی روایت میں یوں ہے آپ صلی اللہ علیہ وسلم سر کے ایک جانب سے پانی پونچھ رہے تھے۔ اور عمرو نے کہا آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر میری امت پر شاق نہ ہوتا۔ اور ابن جریج نے کہا آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر میری امت پر شاق نہ ہوتا تو اس نماز کا ( افضل ) وقت تو یہی ہے۔ اور ابراہیم بن المنذر ( امام بخاری رحمہ اللہ کے شیخ ) نے کہا ہم سے معن بن عیسیٰ نے بیان کیا، کہا مجھ سے محمد بن مسلم نے، انہوں نے عمرو بن دینار سے، انہوں نے عطاء بن ابی رباح سے، انہوں نے ابن عباس رضی اللہ عنہما سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے پھر یہی حدیث نقل کی۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7240,
			"arabicnumber": 7240,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، ان سے جعفر بن ربیعہ نے، ان سے عبدالرحمٰن اعرج نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اگر میری امت پر شاق نہ ہوتا تو میں ان پر مسواک کرنا واجب قرار دیتا۔“",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7241,
			"arabicnumber": 7241,
			"text": "ہم سے عیاش بن الولید نے بیان کیا، کہا ہم سے عبدالاعلیٰ نے بیان کیا، کہا ہم سے حمید طویل نے، ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے رمضان کے آخری دنوں میں صوم وصال رکھا تو بعض صحابہ نے بھی صوم وصال رکھا۔ نبی کریم صلی اللہ علیہ وسلم کو اس کی اطلاع ملی تو آپ صلی اللہ علیہ وسلم نے فرمایا اگر اس مہینے کے دن اور بڑھ جاتے تو میں اتنے دن متواتر وصال کرتا کہ ہوس کرنے والے اپنی ہوس چھوڑ دیتے، میں تم لوگوں جیسا نہیں ہوں۔ میں اس طرح دن گزارتا ہوں کہ میرا رب مجھے کھلاتا پلاتا ہے۔ اس روایت کی متابعت سلیمان بن مغیرہ نے کی، ان سے ثابت نے، ان سے انس رضی اللہ عنہ نے، ان سے نبی کریم صلی اللہ علیہ وسلم نے ایسا فرمایا جو اوپر مذکور ہوا۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7242,
			"arabicnumber": 7242,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، کہا ہم کو زہری نے خبر دی اور لیث نے کہا کہ مجھ سے عبدالرحمٰن بن خالد نے بیان کیا، ان سے ابن شہاب (زہری) نے، انہیں سعید بن مسیب نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے صوم وصال سے منع کیا تو صحابہ نے عرض کی کہ آپ تو وصال کرتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم میں کون مجھ جیسا ہے، میں تو اس حال میں رات گزارتا ہوں کہ میرا رب مجھے کھلاتا پلاتا ہے لیکن جب لوگ نہ مانے تو آپ نے ایک دن کے ساتھ دوسرا دن ملا کر ( وصال کا ) روزہ رکھا، پھر لوگوں نے ( عید کا ) چاند دیکھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر چاند نہ ہوتا تو میں اور وصال کرتا، گویا آپ صلی اللہ علیہ وسلم نے انہیں تنبیہ کرنے کے لیے ایسا فرمایا۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7243,
			"arabicnumber": 7243,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے ابوالاحوص نے بیان کیا، کہا ہم سے اشعث نے، ان سے اسود بن یزید نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے ( خانہ کعبہ کے ) حطیم کے بارے میں پوچھا کہ کیا یہ بھی خانہ کعبہ کا حصہ ہے؟ فرمایا کہ ہاں۔ میں نے کہا: پھر کیوں ان لوگوں نے اسے بیت اللہ میں داخل نہیں کیا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہاری قوم کے پاس خرچ کی کمی ہو گئی تھی، میں نے کہا کہ یہ خانہ کعبہ کا دروازہ اونچائی پر کیوں ہے؟ فرمایا کہ یہ اس لیے انہوں نے کیا ہے تاکہ جسے چاہیں اندر داخل کریں اور جسے چاہیں روک دیں۔ اگر تمہاری قوم ( قریش ) کا زمانہ جاہلیت سے قریب نہ ہوتا اور مجھے خوف نہ ہوتا کہ ان کے دلوں میں اس سے انکار پیدا ہو گا تو میں حطیم کو بھی خانہ کعبہ میں شامل کر دیتا اور اس کے دروازے کو زمین کے برابر کر دیتا۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7244,
			"arabicnumber": 7244,
			"text": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، انہوں نے کہا ہم سے ابوالزناد نے بیان کیا، ان سے اعرج نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اگر ہجرت ( کی فضیلت ) نہ ہوتی تو میں انصار کا ایک فرد بننا ( پسند کرتا ) اور اگر دوسرے لوگ کسی وادی میں چلیں اور انصار ایک وادی یا گھاٹی میں چلیں تو میں انصار کی وادی یا گھاٹی میں چلوں گا۔“",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7245,
			"arabicnumber": 7245,
			"text": "ہم سے موسیٰ نے بیان کیا، انہوں نے کہا ہم سے وہیب نے بیان کیا، ان سے عمرو بن یحییٰ نے، ان سے عباد بن تمیم نے اور ان سے عبداللہ بن زید رضی اللہ عنہ نے بیان کیا کہ اگر ہجرت نہ ہوتی تو میں انصار کا ایک فرد ہوتا اور اگر لوگ کسی وادی یا گھاٹی میں چلیں تو میں انصار کی وادی یا گھاٹی میں چلوں گا۔ اس روایت کی متابعت ابوالتیاح نے کی، ان سے انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے۔ اس میں بھی درے کا ذکر ہے۔",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 20
			}
		}
	]
}