{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"95": "Accepting Information Given by a Truthful Person"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7246,
			"arabicnumber": 7246,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، کہا ہم سے ایوب نے بیان کیا، ان سے ابوقلابہ نے، ان سے مالک رضی اللہ عنہ نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ ہم سب جوان اور ہم عمر تھے، ہم آپ کی خدمت میں بیس دن تک ٹھہرے رہے۔ نبی کریم صلی اللہ علیہ وسلم بہت شفیق تھے۔ جب آپ نے معلوم کیا کہ اب ہمارا دل اپنے گھر والوں کی طرف مشتاق ہے تو آپ نے ہم سے پوچھا کہ اپنے پیچھے ہم کن لوگوں کو چھوڑ کر آئے ہیں۔ ہم نے آپ کو بتایا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے گھر چلے جاؤ اور ان کے ساتھ رہو اور انہیں اسلام سکھاؤ اور دین بتاؤ اور بہت سی باتیں آپ نے کہیں جن میں بعض مجھے یاد نہیں ہیں اور بعض یاد ہیں اور ( فرمایا کہ ) جس طرح مجھے تم نے نماز پڑھتے دیکھا اسی طرح نماز پڑھو۔ پس جب نماز کا وقت آ جائے تو تم میں سے ایک تمہارے لیے اذان کہے اور جو عمر میں سب سے بڑا ہو وہ امامت کرائے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7247,
			"arabicnumber": 7247,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ قطان نے، ان سے سلیمان تیمی نے، ان سے ابوعثمان نہدی نے، ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”کسی شخص کو بلال رضی اللہ عنہ کی اذان سحری کھانے سے نہ روکے کیونکہ وہ صرف اس لیے اذان دیتے ہیں یا نداء کرتے ہیں تاکہ جو نماز کے لیے بیدار ہیں وہ واپس آ جائیں اور جو سوئے ہوئے ہیں وہ بیدار ہو جائیں اور فجر وہ نہیں ہے جو اس طرح لمبی دھار ہوتی ہے۔ یحییٰ نے اس کے اظہار کے لیے اپنے دونوں ہاتھ ملائے اور کہا یہاں تک کہ وہ اس طرح ظاہر ہو جائے اور اس کے اظہار کے لیے انہوں نے اپنی دونوں شہادت کی انگلیوں کو پھیلا کر بتلایا۔“",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7248,
			"arabicnumber": 7248,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے عبدالعزیز بن مسلم نے بیان کیا، کہا ہم سے عبداللہ بن دینار نے بیان کیا، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”بلال ( رمضان میں ) رات ہی میں اذان دیتے ہیں ( وہ نماز فجر کی اذان نہیں ہوتی ) پس تم کھاؤ پیو، یہاں تک کہ عبداللہ ابن ام مکتوم اذان دیں ( تو کھانا پینا بند کر دو ) ۔“",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7249,
			"arabicnumber": 7249,
			"text": "ہم سے حفص بن عمر نے بیان کیا، کہا ہم سے شعبہ نے، ان سے حکم بن عتبہ نے، ان سے ابراہیم نخعی نے، ان سے علقمہ بن قیس نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ہمیں ظہر کی پانچ رکعت نماز پڑھائی تو آپ صلی اللہ علیہ وسلم سے پوچھا گیا: کیا نماز ( کی رکعتوں ) میں کچھ بڑھ گیا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا بات ہے؟ صحابہ نے کہا کہ آپ نے پانچ رکعت نماز پڑھائی ہے۔ پھر نبی کریم صلی اللہ علیہ وسلم نے سلام کے بعد دو سجدے ( سہو کے ) کئے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7250,
			"arabicnumber": 7250,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، انہوں نے کہا مجھ سے مالک نے بیان کیا ان سے ایوب سختیانی نے، ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے دو ہی رکعت پر ( مغرب یا عشاء کی نماز میں ) نماز ختم کر دی تو ذوالیدین رضی اللہ عنہ نے کہا کہ یا رسول اللہ! نماز کم کر دی گئی ہے یا آپ بھول گئے ہیں؟ آپ صلی اللہ علیہ وسلم نے پوچھا: کیا ذوالیدین صحیح کہتے ہیں؟ لوگوں نے کہا جی ہاں۔ پھر نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے اور آخری رکعتیں پڑھیں پھر سلام پھیرا، تکبیر کی اور سجدہ کیا ( نماز کے عام ) سجدے جیسا یا اس سے طویل، پھر آپ صلی اللہ علیہ وسلم نے سر اٹھایا، پھر تکبیر کہی اور نماز کے سجدے جیسا سجدہ کیا، پھر سر اٹھایا۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7251,
			"arabicnumber": 7251,
			"text": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا مجھ سے امام مالک نے بیان کیا، ان سے عبداللہ بن دینار نے، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ مسجد قباء میں لوگ صبح کی نماز پڑھ رہے تھے کہ ایک آنے والے نے ان کے پاس پہنچ کر کہا کہ رسول اللہ صلی اللہ علیہ وسلم پر رات قرآن کی آیت نازل ہوئی ہے اور آپ کو حکم دیا گیا ہے کہ نماز میں کعبہ کی طرف منہ کر لیں پس تم بھی اسی طرف رخ کر لو۔ ان لوگوں کے چہرے شام ( یعنی بیت المقدس ) کی طرف تھے، پھر وہ لوگ کعبہ کی طرف مڑ گئے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7252,
			"arabicnumber": 7252,
			"text": "ہم سے یحییٰ بن موسیٰ بلخی نے بیان کیا، کہا ہم سے وکیع بن جراح نے بیان کیا، ان سے اسرائیل بن یونس نے، ان سے ابواسحاق سبیعی نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ جب رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ سولہ یا سترہ مہینے تک بیت المقدس کی طرف منہ کر کے نماز پڑھتے رہے لیکن آپ کی آرزو تھی کہ کعبہ کی طرف منہ کر کے نماز پڑھیں۔ پھر اللہ تعالیٰ نے ( سورۃ البقرہ میں ) یہ آیت نازل کی «قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها‏» ”ہم آپ کے منہ کے باربار آسمان کی طرف اٹھنے کو دیکھتے ہیں، عنقریب ہم آپ کو منہ کو اس قبلہ کی طرف پھیر دیں گے جس سے آپ خوش ہوں گے۔“ چنانچہ رخ کعبہ کی طرف کر دیا گیا۔ ایک صاحب نے عصر کی نماز نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھی، پھر وہ مدینہ سے نکل کر انصار کی ایک جماعت تک پہنچے اور کہا کہ وہ گواہی دیتے ہیں کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ہے اور کعبہ کی طرف منہ کرنے کا حکم ہو گیا ہے چنانچہ سب لوگ کعبہ رخ ہو گئے حالانکہ وہ عصر کی نماز کے رکوع میں تھے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7253,
			"arabicnumber": 7253,
			"text": "مجھ سے یحییٰ بن قزعہ نے بیان کیا، انہوں نے کہا مجھ سے امام مالک نے بیان کیا، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ میں ابوطلحہ انصاری، ابوعبیدہ بن الجراح اور ابی بن کعب رضی اللہ عنہم کو کھجور کی شراب پلا رہا تھا۔ اتنے میں ایک آنے والے شخص نے آ کر خبر دی کہ شراب حرام کر دی گئی ہے۔ ابوطلحہ رضی اللہ عنہ نے اس شخص کی خبر سنتے ہی کہا: انس! ان مٹکوں کو بڑھ کر سب کو توڑ دے۔ انس رضی اللہ عنہ نے بیان کیا کہ میں ایک ہاون دستہ کی طرف بڑھا جو ہمارے پاس تھا اور میں نے اس کے نچلے حصہ سے ان مٹکوں پر مارا جس سے وہ سب ٹوٹ گئے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7254,
			"arabicnumber": 7254,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ بن حجاج نے بیان کیا، کہا ہم سے ابواسحاق نے، ان سے صلہ بن زفر نے اور ان سے حذیفہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے اہل نجران سے فرمایا ”میں تمہارے پاس ایک امانت دار آدمی جو حقیقی امانت دار ہو گا بھیجوں گا۔“ نبی کریم صلی اللہ علیہ وسلم کے صحابہ منتظر رہے ( کہ کون اس صفت سے موصوف ہے ) تو آپ نے ابوعبیدہ رضی اللہ عنہ کو بھیجا۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7255,
			"arabicnumber": 7255,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے خالد بن مہران نے بیان کیا، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ہر امت میں ایک امانت دار ہوتا ہے اور اس امت کے امانت دار ابوعبیدہ ابن الجراح رضی اللہ عنہ ہیں۔“",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7256,
			"arabicnumber": 7256,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا، ان سے یحییٰ بن سعید نے بیان کیا، ان سے عبید بن حنین نے بیان کیا، ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ عمر رضی اللہ عنہ نے بیان کیا کہ قبیلہ انصار کے ایک صاحب تھے ( اوس بن خولیٰ نام ) جب وہ رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں شرکت نہ کر سکتے اور میں شریک ہوتا تو انہیں آ کر نبی کریم صلی اللہ علیہ وسلم کی مجلس کی خبریں بتاتا اور جب میں نبی کریم صلی اللہ علیہ وسلم کی مجلس میں شریک نہ ہو پاتا اور وہ شریک ہوتے تو وہ آ کر نبی کریم صلی اللہ علیہ وسلم کی مجلس کی خبر مجھے بتاتے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7257,
			"arabicnumber": 7257,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے زبید نے، ان سے سعد بن عبیدہ نے، ان سے ابوعبدالرحمٰن نے اور ان سے علی رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک لشکر بھیجا اور اس کا امیر ایک صاحب عبداللہ بن حذافہ سہمی کو بنایا، پھر ( اس نے کیا کیا کہ ) آگ جلوائی اور ( لشکریوں سے ) کہا کہ اس میں داخل ہو جاؤ۔ جس پر بعض لوگوں نے داخل ہونا چاہا لیکن کچھ لوگوں نے کہا کہ ہم آگ ہی سے بھاگ کر آئے ہیں۔ پھر اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ جنہوں نے آگ میں داخل ہونے کا ارادہ کیا تھا کہ اگر تم اس میں داخل ہو جاتے تو اس میں قیامت تک رہتے۔ اور دوسرے لوگوں سے کہا کہ اللہ تعالیٰ کی نافرمانی میں کسی کی اطاعت حلال نہیں ہے اطاعت صرف نیک کاموں میں ہے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7259,
			"arabicnumber": 7259,
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7260,
			"arabicnumber": 7260,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، کہا مجھ کو عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھے کہ دیہاتیوں میں سے ایک صاحب کھڑے ہوئے اور کہا کہ یا رسول اللہ! کتاب اللہ کے مطابق میرا فیصلہ فرما دیجئیے۔ اس کے بعد ان کا مقابل فریق کھڑا ہوا اور کہا انہوں نے صحیح کہا یا رسول اللہ! ہمارا فیصلہ کتاب اللہ کے مطابق کر دیجئیے اور مجھے کہنے کی اجازت دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کہو۔ انہوں نے کہا کہ میرا لڑکا ان کے یہاں مزدوری کیا کرتا تھا، «عسيف» بمعنی «الأجير» مزدور ہے، پھر اس نے ان کی عورت سے زنا کر لیا تو لوگوں نے مجھے بتایا کہ میرے بیٹے پر رجم کی سزا ہو گی لیکن میں نے اس کی طرف سے سو بکریوں اور ایک باندی کا فدیہ دیا ( اور لڑکے کو چھڑا لیا ) پھر میں نے اہل علم سے پوچھا تو انہوں نے بتایا کہ اس کی بیوی پر رجم کی سزا لاگو ہو گی اور میرے لڑکے کو سو کوڑے اور ایک سال کے لیے جلا وطنی کی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! میں تمہارے درمیان کتاب اللہ کے مطابق فیصلہ کروں گا، باندی اور بکریاں تو اسے واپس کر دو اور تمہارے لڑکے پر سو کوڑے اور ایک سال جلا وطنی کی سزا ہے اور اے انیس! ( قبیلہ اسلم کے ایک صحابی ) اس کی بیوی کے پاس جاؤ، اگر وہ زنا کا اقرار کرے تو اسے رجم کر دو۔ چنانچہ انیس رضی اللہ عنہ ان کے پاس گئے اور اس نے اقرار کر لیا پھر انیس رضی اللہ عنہ نے اس کو سنگسار کر ڈالا۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7261,
			"arabicnumber": 7261,
			"text": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے محمد بن المنکدر نے کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، بیان کیا کہ غزوہ خندق کے دن نبی کریم صلی اللہ علیہ وسلم نے ( دشمن سے خبر لانے کے لیے ) صحابہ سے کہا تو زبیر رضی اللہ عنہ تیار ہو گئے پھر ان سے کہا تو زبیر رضی اللہ عنہ ہی تیار ہوئے۔ پھر کہا، پھر بھی انہوں نے ہی آمادگی دکھلائی۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر نبی کے حواری ( مددگار ) ہوتے ہیں اور میری حواری زبیر ہیں۔ اور سفیان بن عیینہ نے بیان کیا کہ میں نے یہ روایت ابن المنکدر سے یاد کی اور ایوب نے ابن المنکدر سے کہا، اے ابوبکر! ( یہ محمد بن منکدر کی کنیت ہے ) ان سے جابر رضی اللہ عنہ کی حدیث بیان کیجئے کیونکہ لوگ پسند کرتے ہیں کہ آپ جابر رضی اللہ عنہ کی احادیث بیان کریں تو انہوں نے اسی مجلس میں کہا کہ میں نے جابر رضی اللہ عنہ سے سنا اور چار احادیث میں پے در پے یہ کہا کہ میں نے جابر رضی اللہ عنہ سے سنا۔ علی بن عبداللہ مدینی نے کہا کہ میں نے سفیان بن عیینہ سے کہا کہ سفیان ثوری تو غزوہ قریظہ کہتے ہیں ( بجائے غزوہ خندق کے ) انہوں نے کہا کہ میں نے اتنے ہی یقین کے ساتھ یاد کیا ہے جیسا کہ تم اس وقت بیٹھے ہو کہ انہوں نے غزوہ خندق کہا، سفیان نے کہا کہ یہ دونوں ایک ہی غزوہ ہیں ( کیونکہ ) غزوہ خندق کے فوراً بعد اسی دن غزوہ قریظہ پیش آیا اور وہ مسکرائے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7262,
			"arabicnumber": 7262,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد نے بیان کیا، ان سے ایوب نے، ان سے ابوعثمان نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم ایک باغ میں داخل ہوئے اور مجھے دروازہ کی نگرانی کا حکم دیا، پھر ایک صحابی آئے اور اجازت چاہی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور انہیں جنت کی بشارت دے دو۔ وہ ابوبکر رضی اللہ عنہ تھے، پھر عمر رضی اللہ عنہ آئے، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور انہیں جنت کی بشارت دے دو، پھر عثمان رضی اللہ عنہ آئے، نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں بھی اجازت دے دو اور جنت کی بشارت دے دو۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7263,
			"arabicnumber": 7263,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، ان سے یحییٰ نے، ان سے عبید بن حنین نے، انہوں نے ابن عباس رضی اللہ عنہما سے سنا اور ان سے عمر رضی اللہ عنہ نے بیان کیا کہ میں حاضر ہوا تو رسول اللہ صلی اللہ علیہ وسلم اپنے بالا خانہ میں تشریف رکھتے تھے اور آپ کا ایک کالا غلام سیڑھی کے اوپر ( نگرانی کر رہا ) تھا میں نے اس سے کہا کہ کہو کہ عمر بن خطاب کھڑا ہے اور اجازت چاہتا ہے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7264,
			"arabicnumber": 7264,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا مجھ سے لیث بن سعد نے بیان کیا، ان سے یونس نے بیان کیا، ان سے ابن شہاب نے بیان کیا، انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی، انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے کسریٰ پرویز شاہ ایران کو خط بھیجا اور قاصد عبداللہ بن حذافہ رضی اللہ عنہ کو حکم دیا کہ خط بحرین کے گورنر منذر بن ساوی کے حوالہ کریں وہ اسے کسریٰ تک پہنچائے گا۔ جب کسریٰ نے وہ خط پڑھا تو اسے پھاڑ دیا۔ مجھے یاد ہے کہ سعید بن المسیب نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے اسے بددعا دی کہ اللہ انہیں بھی ٹکڑے ٹکڑے کر دے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7265,
			"arabicnumber": 7265,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ قطان نے بیان کیا، ان سے یزید بن ابی عبید نے، ان سے سلمہ بن الاکوع رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ اسلم کے ایک صاحب ہند بن اسماء سے فرمایا کہ اپنی قوم میں یا لوگوں میں اعلان کر دو عاشورہ کے دن کہ جس نے کھا لیا ہو وہ اپنا بقیہ دن ( بے کھائے ) پورا کرے اور اس نے نہ کھایا ہو وہ روزہ رکھے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7266,
			"arabicnumber": 7266,
			"text": "ہم سے علی بن الجعد نے بیان کیا، کہا ہم کو شعبہ نے خبر دی (دوسری سند) امام بخاری رحمہ اللہ نے کہا کہ اور مجھ سے اسحاق بن راہویہ نے بیان کیا، کہا ہم کو نضر بن شمیل نے خبر دی، کہا ہم کو شعبہ نے خبر دی، ان سے ابوجمرہ نے بیان کیا کہ ابن عباس رضی اللہ عنہما مجھے خاص اپنے تخت پر بٹھا لیتے تھے۔ انہوں نے ایک بار بیان کیا کہ قبیلہ عبدالقیس کا وفد آیا جب وہ لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچے نبی کریم صلی اللہ علیہ وسلم نے پوچھا کس قوم کا وفد ہے؟ انہوں نے کہا کہ ربیعہ قبیلہ کا ( عبدالقیس اسی قبیلے کا ایک شاخ ہے ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مبارک ہو اس وفد کو یا یوں فرمایا کہ مبارک ہو بلا رسوائی اور شرمندگی اٹھائے آئے ہو۔ انہوں نے کہا: یا رسول اللہ! ہمارے اور آپ کے بیچ میں مضر کافروں کا ملک پڑتا ہے۔ آپ ہمیں ایسی بات کا حکم دیجئیے جس سے ہم جنت میں داخل ہوں اور پیچھے رہ جانے والوں کو بھی بتائیں۔ پھر انہوں نے شراب کے برتنوں کے متعلق پوچھا تو نبی کریم صلی اللہ علیہ وسلم نے انہیں چار چیزوں سے روکا اور چار چیزوں کا حکم دیا۔ آپ نے ایمان بااللہ کا حکم دیا۔ دریافت فرمایا جانتے ہو ایمان باللہ کیا چیز ہے؟ انہوں نے کہا کہ اللہ اور اس کا رسول زیادہ جانتے ہیں۔ فرمایا کہ گواہی دینا کہ اللہ کے سوا اور کوئی معبود نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں اور نماز قائم کرنے کا ( حکم دیا ) اور زکوٰۃ دینے کا۔ میرا خیال ہے کہ حدیث میں رمضان کے روزوں کا بھی ذکر ہے اور غنیمت میں سے پانچواں حصہ ( بیت المال ) میں دینا اور آپ نے انہیں دباء، حنتم، مزفت اور نقیر کے برتن ( جن میں عرب لوگ شراب رکھتے اور بناتے تھے ) کے استعمال سے منع کیا اور بعض اوقات مقیر کہا۔ فرمایا کہ انہیں یاد رکھو اور انہیں پہنچا دو جو نہیں آ سکے ہیں۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7267,
			"arabicnumber": 7267,
			"text": "ہم سے محمد بن الولید نے بیان کیا، کہا ہم سے محمد بن جعفر نے، کہا ہم سے شعبہ نے، ان سے توبہ بن کیسان العنبری نے بیان کیا کہ مجھ سے شعبی نے کہا کہ تم نے دیکھا امام حسن بصری نبی کریم صلی اللہ علیہ وسلم سے کتنی حدیث ( مرسلاً ) روایت کرتے ہیں۔ میں ابن عمر رضی اللہ عنہما کی خدمت میں تقریباً اڑھائی سال رہا لیکن میں نے ان کو نبی کریم صلی اللہ علیہ وسلم سے اس حدیث کے سوا اور کوئی حدیث بیان کرتے نہیں سنا۔ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں سے کئی اصحاب جن میں سعد رضی اللہ عنہ بھی تھے ( دستر خوان پر بیٹھے ہوئے تھے ) لوگوں نے گوشت کھانے کے لیے ہاتھ بڑھایا تو ازواج مطہرات میں سے ایک زوجہ مطہرہ ام المؤمنین میمونہ رضی اللہ عنہا نے آگاہ کیا کہ یہ سانڈے کا گوشت ہے۔ سب لوگ کھانے سے رک گئے، پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کھاؤ ( آپ صلی اللہ علیہ وسلم نے «كلوا» فرمایا یا «اطعموا» ) اس لیے کہ حلال ہے یا فرمایا کہ اس کھانے میں کوئی حرج نہیں البتہ یہ جانور میری خوراک نہیں ہے، مجھ کو اس کے کھانے سے ایک قسم کی نفرت آتی ہے۔",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 21
			}
		}
	]
}