{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "ابوایوب انصاری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”چار باتیں انبیاء و رسل کی سنت میں سے ہیں: حیاء کرنا، عطر لگانا، مسواک کرنا اور نکاح کرنا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوایوب انصاری رضی الله عنہ کی حدیث حسن غریب ہے –",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1081,
			"arabicnumber": 1081,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ ہم نبی اکرم صلی اللہ علیہ وسلم کے ساتھ نکلے، ہم نوجوان تھے، ہمارے پاس ( شادی وغیرہ امور میں سے ) کسی چیز کی مقدرت نہ تھی۔ تو آپ نے فرمایا: ”اے نوجوانوں کی جماعت! تمہارے اوپر ۱؎ نکاح لازم ہے، کیونکہ یہ نگاہ کو نیچی کرنے والا اور شرمگاہ کی حفاظت کرنے والا ہے۔ اور جو تم میں سے نکاح کی استطاعت نہ رکھتا ہو تو اس پر صوم کا اہتمام ضروری ہے، کیونکہ روزہ اس کے لیے ڈھال ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس سند سے کئی لوگوں نے اسی کے مثل اعمش سے روایت کی ہے، ۳- اور ابومعاویہ اور محاربی نے یہ حدیث بطریق: «الأعمش عن إبراهيم عن علقمة عن عبد الله عن النبي صلى الله عليه وسلم» اسی طرح کی حدیث روایت کی ہے، ۴- دونوں حدیثیں صحیح ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1082,
			"arabicnumber": 1082,
			"text": "سمرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے بے شادی زندگی گزارنے سے منع فرمایا ہے ۱؎۔ امام ترمذی کہتے ہیں: ۱- زید بن اخزم نے اپنی حدیث میں اتنا اضافہ کیا ہے کہ قتادہ نے یہ آیت کریمہ: «ولقد أرسلنا رسلا من قبلك وجعلنا لهم أزواجا وذرية» ۲؎ ”ہم آپ سے پہلے کئی رسول بھیج چکے ہیں، ہم نے انہیں بیویاں عطا کیں اور اولادیں“ پڑھی ۳؎۔ امام ترمذی کہتے ہیں: ۱- سمرہ رضی الله عنہ کی حدیث حسن غریب ہے، ۲- اشعث بن عبدالملک نے یہ حدیث بطریق: «الحسن عن سعد بن هشام عن عائشة عن النبي صلى الله عليه وسلم» اسی طرح روایت کی ہے، ۳- کہا جاتا ہے کہ یہ دونوں ہی حدیثیں صحیح ہیں، ۴- اس باب میں سعد، انس بن مالک، عائشہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1083,
			"arabicnumber": 1083,
			"text": "سعد بن ابی وقاص رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے عثمان بن مظعون کو بغیر شادی کے زندگی گزارنے کی اجازت نہیں دی، اگر آپ انہیں اس کی اجازت دے دیتے تو ہم خصی ہو جاتے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1084,
			"arabicnumber": 1084,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تمہیں کوئی ایسا شخص شادی کا پیغام دے، جس کی دین داری اور اخلاق سے تمہیں اطمینان ہو تو اس سے شادی کر دو۔ اگر ایسا نہیں کرو گے تو زمین میں فتنہ اور فساد عظیم برپا ہو گا“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی اس روایت میں عبدالحمید بن سلیمان کی مخالفت کی گئی ہے، اسے لیث بن سعد نے بطریق: «ابن عجلان عن أبي هريرة عن النبي صلى الله عليه وسلم» مرسلاً ( منقطعاً ) روایت کی ہے ( یعنی: ابن وشیمہ کا ذکر نہیں کیا ہے ) ، ۲- محمد بن اسماعیل بخاری کا کہنا ہے کہ لیث کی حدیث اشبہ ( قریب تر ) ہے، انہوں ( بخاری ) نے عبدالحمید کی حدیث کو محفوظ شمار نہیں کیا، ۳- اس باب میں ابوحاتم مزنی اور عائشہ رضی الله عنہما سے احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1085,
			"arabicnumber": 1085,
			"text": "ابوحاتم مزنی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تمہارے پاس جب کوئی ایسا شخص ( نکاح کا پیغام لے کر ) آئے، جس کی دین داری اور اخلاق سے تم مطمئن ہو تو اس سے نکاح کر دو۔ اگر ایسا نہیں کرو گے تو زمین میں فتنہ اور فساد برپا ہو گا ۱؎ لوگوں نے عرض کیا: اللہ کے رسول! اگر اس میں کچھ ہو؟ آپ نے تین بار یہی فرمایا: ”جب تمہارے پاس کوئی ایسا شخص آئے جس کی دین داری اور اخلاق سے تم مطمئن ہو تو اس سے نکاح کر دو ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ابوحاتم مزنی کو شرف صحبت حاصل ہے، ہم اس کے علاوہ ان کی کوئی حدیث نہیں جانتے جو انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1086,
			"arabicnumber": 1086,
			"text": "جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عورت سے نکاح اس کی دین داری، اس کے مال اور اس کی خوبصورتی کی وجہ سے کیا جاتا ہے ۱؎ لیکن تو دیندار ( عورت ) سے نکاح کو لازم پکڑ لو ۲؎ تمہارے دونوں ہاتھ خاک آلود ہوں“ ۳؎۔ امام ترمذی کہتے ہیں: ۱- جابر کی حدیث حسن صحیح ہے، ۲- اس باب میں عوف بن مالک، ام المؤمنین عائشہ رضی الله عنہا، عبداللہ بن عمرو، اور ابو سعید خدری رضی الله عنہم سے احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1087,
			"arabicnumber": 1087,
			"text": "مغیرہ بن شعبہ رضی الله عنہ کہتے ہیں کہ انہوں نے ایک عورت کے پاس نکاح کا پیغام بھیجا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم اسے دیکھ لو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اس باب میں محمد بن مسلمہ، جابر، ابوحمید اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم اسی حدیث کی طرف گئے ہیں، وہ کہتے ہیں: اسے دیکھنے میں کوئی حرج نہیں جب وہ اس کی کوئی ایسی چیز نہ دیکھے جس کا دیکھنا حرام ہے۔ یہی احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۴- اور «أحرى أن يؤدم بينكما» کے معنی یہ ہیں کہ یہ تم دونوں کے درمیان محبت پیدا کرنے کے لیے زیادہ موزوں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1088,
			"arabicnumber": 1088,
			"text": "محمد بن حاطب جمحی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”حرام اور حلال ( نکاح ) کے درمیان فرق صرف دف بجانے اور اعلان کرنے کا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- محمد بن حاطب کی حدیث حسن ہے، ۲- محمد بن حاطب نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ہے، لیکن وہ کم سن بچے تھے، ۳- اس باب میں ام المؤمنین عائشہ رضی الله عنہا، جابر اور ربیع بنت معوذ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1089,
			"arabicnumber": 1089,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اس نکاح کا اعلان کرو، اسے مسجدوں میں کرو اور اس پر دف بجاؤ“۔ امام ترمذی کہتے ہیں: ۱- اس باب میں یہ حدیث غریب حسن ہے، ۲- عیسیٰ بن میمون انصاری حدیث میں ضعیف قرار دیے جاتے ہیں، ۳- عیسیٰ بن میمون جو ابن ابی نجیح سے تفسیر روایت کرتے ہیں، ثقہ ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1090,
			"arabicnumber": 1090,
			"text": "ربیع بنت معوذ رضی الله عنہا کہتی ہیں کہ جس رات میری شادی اس کی صبح رسول اللہ صلی اللہ علیہ وسلم میرے ہاں تشریف لائے۔ آپ میرے بستر پر ایسے ہی بیٹھے، جیسے تم ( خالد بن ذکوان ) میرے پاس بیٹھے ہو۔ اور چھوٹی چھوٹی بچیاں دف بجا رہی تھیں اور جو ہمارے باپ دادا میں سے جنگ بدر میں شہید ہوئے تھے ان کا مرثیہ گا رہی تھیں، یہاں تک کہ ان میں سے ایک نے کہا: ہمارے درمیان ایک نبی ہے جو ان چیزوں کو جانتا ہے جو کل ہوں گی، تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: ”یہ نہ کہہ۔ وہی کہہ جو پہلے کہہ رہی تھی“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم شادی کرنے پر جب کسی کو مبارک باد دیتے تو فرماتے: «بارك الله لك وبارك عليك وجمع بينكما في الخير» ”اللہ تجھے برکت عطا کرے، اور تجھ پر برکت نازل فرمائے اور تم دونوں کو خیر پر جمع کرے“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں علی رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم میں سے کوئی اپنی بیوی کے پاس آئے یعنی اس سے صحبت کرنے کا ارادہ کرے اور یہ دعا پڑھے: «بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا» ”اللہ کے نام سے، اے اللہ! تو ہمیں شیطان سے محفوظ رکھ اور اسے بھی شیطان سے محفوظ رکھ جو تو ہمیں عطا کرے یعنی ہماری اولاد کو“، تو اگر اللہ نے ان کے درمیان اولاد دینے کا فیصلہ کیا ہو گا تو شیطان اسے کوئی نقصان نہیں پہنچا سکے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے شوال میں مجھ سے شادی کی اور شوال ہی میں میرے ساتھ آپ نے شب زفاف منائی، عائشہ رضی الله عنہا اپنے خاندان کی عورتوں کی رخصتی شوال میں کی جانے کو مستحب سمجھتی تھیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسے ہم صرف ثوری کی روایت سے جانتے ہیں، اور ثوری اسماعیل بن امیہ سے روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف کے جسم پر زردی کا نشان دیکھا تو پوچھا: یہ کیا ہے؟ انہوں نے عرض کیا: میں نے ایک عورت سے کھجور کی ایک گٹھلی سونے کے عوض شادی کر لی ہے، آپ نے فرمایا: ”اللہ تمہیں برکت عطا کرے، ولیمہ ۱؎ کرو خواہ ایک ہی بکری کا ہو“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن مسعود، عائشہ، جابر اور زہیر بن عثمان رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- احمد بن حنبل کہتے ہیں: گٹھلی بھر سونے کا وزن تین درہم اور تہائی درہم وزن کے برابر ہوتا ہے، ۴- اسحاق بن راہویہ کہتے ہیں: پانچ درہم اور تہائی درہم کے وزن کے برابر ہوتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے صفیہ بنت حیی کا ولیمہ ستو اور کھجور سے کیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "اس سند سے بھی سفیان سے اسی طرح مروی ہے، اور کئی لوگوں نے یہ حدیث بطریق: «ابن عيينة، عن الزهري، عن أنس» روایت کی ہے لیکن ان لوگوں نے اس میں وائل بن داود اور ان کے بیٹے کے واسطوں کا ذکر نہیں کیا ہے۔ امام ترمذی کہتے ہیں: سفیان بن عیینہ اس حدیث میں تدلیس کرتے تھے۔ کبھی انہوں نے اس میں «وائل بن داود عن ابنہ» کا ذکر نہیں کیا ہے اور کبھی اس کا ذکر کیا ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "ابن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پہلے روز کا کھانا حق ہے، دوسرے روز کا کھانا سنت ہے۔ اور تیسرے روز کا کھانا تو محض دکھاوا اور نمائش ہے اور جو ریاکاری کرے گا اللہ اسے اس کی ریاکاری کی سزا دے گا ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود کی حدیث کو ہم صرف زیاد بن عبداللہ کی روایت سے مرفوع جانتے ہیں۔ اور زیاد بن عبداللہ بہت زیادہ غریب اور منکر احادیث بیان کرتے ہیں، ۲- میں نے محمد بن اسماعیل بخاری کو سنا کہ وہ محمد بن عقبہ سے نقل کر رہے تھے کہ وکیع کہتے ہیں: زیاد بن عبداللہ اس بات سے بہت بلند ہیں کہ وہ حدیث میں جھوٹ بولیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تمہیں دعوت دی جائے تو تم دعوت میں آؤ“۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، ابوہریرہ، براء، انس اور ابوایوب رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "ابومسعود رضی الله عنہ کہتے ہیں کہ ابوشعیب نامی ایک شخص نے اپنے ایک گوشت فروش لڑکے کے پاس آ کر کہا: تم میرے لیے کھانا بنا جو پانچ آدمیوں کے لیے کافی ہو کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے چہرے پر بھوک کا اثر دیکھا ہے، تو اس نے کھانا تیار کیا۔ پھر نبی اکرم صلی اللہ علیہ وسلم کو بلانے کے لیے آدمی بھیجا۔ تو اس نے آپ کو اور آپ کے ساتھ جو لوگ بیٹھے تھے سب کو کھانے کے لیے بلایا، جب نبی اکرم صلی اللہ علیہ وسلم ( چلنے کے لیے ) اٹھے، تو آپ کے پیچھے ایک اور شخص بھی چلا آیا، جو آپ کے ساتھ اس وقت نہیں تھا جب آپ کو دعوت دی گئی تھی۔ جب رسول اللہ صلی اللہ علیہ وسلم دروازے پر پہنچے تو آپ نے صاحب خانہ سے فرمایا: ”ہمارے ساتھ ایک اور شخص ہے جو ہمارے ساتھ اس وقت نہیں تھا، جب تم نے دعوت دی تھی، اگر تم اجازت دو تو وہ بھی اندر آ جائے؟“، اس نے کہا: ہم نے اسے بھی اجازت دے دی، وہ بھی اندر آ جائے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ میں نے ایک عورت سے شادی کی پھر میں نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، تو آپ نے پوچھا: ”جابر! کیا تم نے شادی کی ہے؟“ میں نے کہا: جی ہاں کی ہے، آپ نے فرمایا: ”کسی کنواری سے یا بیوہ سے؟“ میں نے کہا: نہیں، غیر کنواری سے۔ آپ نے فرمایا: ”کسی ( کنواری ) لڑکی سے شادی کیوں نہیں کی، تو اس سے کھیلتا اور وہ تجھ سے کھیلتی؟“ میں نے عرض کیا: اللہ کے رسول! ( میرے والد ) عبداللہ کا انتقال ہو گیا ہے، اور انہوں نے سات یا نو لڑکیاں چھوڑی ہیں، میں ایسی عورت کو بیاہ کر لایا ہوں جو ان کی دیکھ بھال کر سکے۔ چنانچہ آپ نے میرے لیے دعا فرمائی۔ امام ترمذی کہتے ہیں: ۱- جابر بن عبداللہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابی بن کعب اور کعب بن عجرہ رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "ابوموسیٰ اشعری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ولی کے بغیر نکاح نہیں“ ۱؎۔ امام ترمذی کہتے ہیں: اس باب میں عائشہ، ابن عباس، ابوہریرہ، عمران بن حصین اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔ ( ابوموسیٰ اشعری کی حدیث پر مولف کا مفصل کلام اگلے باب میں آ رہا ہے ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس عورت نے اپنے ولی کی اجازت کے بغیر نکاح کیا تو اس کا نکاح باطل ہے، اس کا نکاح باطل ہے، اس کا نکاح باطل ہے، اگر اس نے اس سے دخول کر لیا ہے تو اس کی شرمگاہ حلال کر لینے کے عوض اس کے لیے مہر ہے، اور اگر اولیاء میں جھگڑا ہو جائے تو جس کا کوئی ولی نہ ہو اس کا ولی حاکم ہو گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- یحییٰ بن سعید انصاری، یحییٰ بن ایوب، سفیان ثوری، اور کئی حفاظ حدیث نے اسی طرح ابن جریج سے روایت کی ہے، ۳- ابوموسیٰ اشعری رضی الله عنہ کی ( پچھلی ) حدیث میں اختلاف ہے، اسے اسرائیل، شریک بن عبداللہ، ابو عوانہ، زہیر بن معاویہ اور قیس بن ربیع نے بسند «أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» روایت کی ہے، ۴- اور اسباط بن محمد اور زید بن حباب نے بسند «يونس بن أبي إسحق عن أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» روایت کی ہے، ۵- اور ابوعبیدہ حداد نے بسند «يونس بن أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» اسی طرح روایت کی ہے، اس میں انہوں نے ابواسحاق کے واسطے کا ذکر نہیں کیا ہے، ۶- نیز یہ حدیث یونس بن ابی اسحاق سے بھی روایت کی گئی ہے انہوں نے بسند «أبي إسحق عن أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» روایت کی ہے، ۷- اور شعبہ اور سفیان ثوری بسند «أبي إسحق عن أبي بردة عن النبي صلى الله عليه وسلم» روایت کی ہے کہ ”ولی کے بغیر نکاح نہیں ہے“، اور سفیان ثوری کے بعض تلامذہ نے بسند «سفيان عن أبي إسحق عن أبي بردة عن أبي موسى» روایت کی ہے، لیکن یہ صحیح نہیں ہے۔ ان لوگوں کی روایت، جنہوں نے بطریق: «أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» روایت کی ہے کہ ”ولی کے بغیر نکاح نہیں“ میرے نزدیک زیادہ صحیح ہے، کیونکہ ابواسحاق سبیعی سے ان لوگوں کا سماع مختلف اوقات میں ہے اگرچہ شعبہ اور ثوری ابواسحاق سے روایت کرنے والے تمام لوگوں سے زیادہ پختہ اور مضبوط حافظہ والے ہیں پھر بھی ان لوگوں ( یعنی شعبہ و ثوری کے علاوہ دوسرے رواۃ ) کی روایت اشبہ ( قریب تر ) ہے۔ اس لیے کہ شعبہ اور ثوری دونوں نے یہ حدیث ابواسحاق سے ایک ہی مجلس میں سنی ہے، ( اور ان کے علاوہ رواۃ نے مختلف اوقات میں ) اس کی دلیل شعبہ کا یہ بیان ہے کہ میں نے سفیان ثوری کو ابواسحاق سے پوچھتے سنا کہ کیا آپ نے ابوبردہ کو کہتے سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ولی کے بغیر نکاح نہیں؟“ تو انہوں نے کہا: ہاں ( سنا ہے ) ۔ یہ اس بات کی دلیل ہے کہ شعبہ اور ثوری کا مکحول سے اس حدیث کا سماع ایک ہی وقت میں ہے۔ اور ابواسحاق سبیعی سے روایت کرنے میں اسرائیل بہت ہی ثقہ راوی ہیں۔ عبدالرحمٰن بن مہدی کہتے ہیں کہ مجھ سے ثوری کی روایتوں میں سے جنہیں وہ ابواسحاق سے روایت کرتے ہیں، کوئی روایت نہیں چھوٹی، مگر جو چھوٹی ہیں وہ صرف اس لیے چھوٹی ہیں کہ میں نے اس سلسلے میں اسرائیل پر بھروسہ کر لیا تھا، اس لیے کہ وہ ابواسحاق کی حدیثوں کو بطریق اتم بیان کرتے تھے۔ اور اس باب میں عائشہ رضی اللہ عنہا کی نبی اکرم صلی اللہ علیہ وسلم سے حدیث: ”بغیر ولی کے نکاح نہیں“ میرے نزدیک حسن ہے۔ یہ حدیث ابن جریج نے بطریق: «سليمان بن موسى، عن الزهري، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم»،‏‏‏‏ نیز اسے حجاج بن ارطاۃ اور جعفر بن ربیعہ نے بھی بطریق: «الزهري، عن عروة، عن النبي صلى الله عليه وسلم» روایت کی ہے۔ نیز زہری نے بطریق: «هشام بن عروة، عن أبيه عروة، عن عائشة، عن النبي صلى الله عليه وسلم» اسی کے مثل روایت کی ہے۔ بعض محدثین نے زہری کی روایت میں ( جسے انہوں نے بطریق: «عروة عن عائشة عن النبي صلى الله عليه وسلم» روایت کی ہے ) کلام کیا ہے، ابن جریج کہتے ہیں: پھر میں زہری سے ملا اور میں نے ان سے پوچھا تو انہوں نے اس کا انکار کیا اس کی وجہ سے ان لوگوں نے اس حدیث کو ضعیف قرار دیا۔ یحییٰ بن معین کہتے ہیں کہ ابن جریج سے اس بات کو اسماعیل بن ابراہیم بن علیہ کے علاوہ کسی اور نے نہیں نقل کیا ہے، یحییٰ بن معین کہتے ہیں: اسماعیل بن ابراہیم بن علیہ کا سماع ابن جریج سے نہیں ہے، انہوں نے اپنی کتابوں کی تصحیح عبدالمجید بن عبدالعزیز بن ابی رواد کی ان کتابوں سے کی ہے جنہیں عبدالمجید نے ابن جریج سے سنی ہیں۔ یحییٰ بن معین نے اسماعیل بن ابراہیم بن علیہ کی روایت کو جسے انہوں نے ابن جریج سے روایت کی ہے ضعیف قرار دیا ہے۔ ۸- صحابہ کرام میں سے اہل علم کا عمل اس باب میں نبی اکرم صلی اللہ علیہ وسلم کی حدیث «لا نكاح إلا بولي» ”ولی کے بغیر نکاح نہیں ”پر ہے جن میں عمر، علی، عبداللہ بن عباس اور ابوہریرہ رضی الله عنہم وغیرہ بھی شامل ہیں، اسی طرح بعض فقہائے تابعین سے مروی ہے کہ ولی کے بغیر نکاح درست نہیں۔ ان میں سعید بن مسیب، حسن بصری، شریح، ابراہیم نخعی اور عمر بن عبدالعزیز وغیرہ ہیں۔ یہی سفیان ثوری، اوزاعی، عبداللہ بن مبارک، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”زنا کار ہیں وہ عورتیں جو گواہوں کے بغیر خود نکاح کر لیتی ہیں“۔ یوسف بن حماد کہتے ہیں کہ عبدالاعلی نے اس حدیث کو کتاب التفسیر میں مرفوع بیان کیا ہے اور کتاب الطلاق میں اسے انہوں نے موقوفاً بیان کیا ہے، مرفوع نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "اس سند سے بھی سعید بن ابی عروبہ نے اسی طرح کی حدیث بیان کی ہے لیکن انہوں نے اسے مرفوع نہیں کیا۔ اور یہی زیادہ صحیح ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غیر محفوظ ہے، ۲- ہم کسی کو نہیں جانتے جس نے اسے مرفوع کیا ہو سوائے اس کے جو عبدالاعلیٰ سے مروی ہے انہوں نے سعید بن ابی عروبہ سے اور سعید نے قتادہ سے مرفوعاً روایت کی ہے، ۳- اور عبدالاعلیٰ سے سعید بن ابی عروبہ کے واسطے سے یہ موقوفا بھی مروی ہے۔ اور صحیح وہ ہے جو ابن عباس کے قول سے مروی ہے کہ بغیر گواہ کے نکاح نہیں، خود ابن عباس کا قول ہے، ۴- اسی طرح سے اور کئی لوگوں نے بھی سعید بن ابی عروبہ سے اسی طرح کی روایت موقوفاً کی ہے، ۵- اس باب میں عمران بن حصین، انس اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۶- صحابہ کرام اور تابعین وغیرہم میں سے اہل علم کا اسی پر عمل ہے، یہ لوگ کہتے ہیں کہ بغیر گواہ کے نکاح درست نہیں۔ پہلے کے لوگوں میں اس سلسلے میں کوئی اختلاف نہیں تھا لیکن متاخرین اہل علم میں سے کچھ لوگوں نے اس میں اختلاف کیا ہے، ۷- اہل علم میں اس سلسلے میں اختلاف ہے جب ایک دوسرے کے بعد گواہی دے یعنی دونوں بیک وقت مجلس نکاح میں حاضر نہ ہوں تو کوفہ کے اکثر اہل علم کا کہنا ہے کہ نکاح اسی وقت درست ہو گا جب عقد نکاح کے وقت دونوں گواہ ایک ساتھ موجود ہوں، ۸- اور بعض اہل مدینہ کا خیال ہے کہ جب ایک کے بعد دوسرے کو گواہ بنایا گیا ہو تو بھی جائز ہے جب وہ اس کا اعلان کر دیں۔ یہ مالک بن انس وغیرہ کا قول ہے۔ اسی طرح کی بات اسحاق بن راہویہ نے بھی کہی ہے جو اہل مدینہ نے کہی ہے، ۹- اور بعض اہل علم کہتے ہیں کہ نکاح میں ایک مرد اور دو عورتوں کی شہادت جائز ہے، یہ احمد اور اسحاق بن راہویہ کا قول ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نماز کے تشہد اور حاجت کے تشہد کو ( الگ الگ ) سکھایا، وہ کہتے ہیں صلاۃ کا تشہد یہ ہے: «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله» ”تمام زبانی، بدنی اور مالی عبادتیں اللہ ہی کے لیے ہیں۔ اے نبی: سلامتی ہو آپ پر اور اللہ کی رحمت اور اس کی برکتیں ہوں۔ سلامتی ہو ہم پر اور اللہ کے نیک بندوں پر۔ میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں اور میں گواہی دیتا ہوں کہ محمد اللہ کے بندے اور اس کے رسول ہیں“، اور حاجت کا تشہد یہ ہے: «إن الحمد لله نستعينه ونستغفره ونعوذ بالله من شرور أنفسنا وسيئات أعمالنا فمن يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله» ”سب تعریفیں اللہ ہی کے لیے ہیں، ہم اسی سے مدد چاہتے ہیں اور اسی سے مغفرت طلب کرتے ہیں، ہم اپنے دلوں کی شرارتوں اور برے اعمال سے اللہ کی پناہ مانگتے ہیں، جسے اللہ ہدایت دیدے اسے کوئی گمراہ کرنے والا نہیں اور جسے گمراہ کر دے، اسے کوئی ہدایت دینے والا نہیں۔ میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں۔ میں گواہی دیتا ہوں کہ محمد اللہ کے بندے اور اس کے رسول ہیں“۔ اور پھر آپ تین آیتیں پڑھتے۔ عبثر ( راوی حدیث ) کہتے ہیں: تو ہمیں سفیان ثوری نے بتایا کہ وہ تینوں آیتیں یہ تھی: «يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون» ”اے ایمان والو! اللہ سے ڈرو جیسا ڈرنے کا حق ہے اور حالت اسلام ہی میں مرو“ ( آل عمران: ۱۰۲ ) ، «واتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا» ”اللہ سے ڈرو، جس کے نام سے تم سوال کرتے ہو اور جس کے واسطے سے ناطے جوڑتے ہو، بلاشبہ اللہ تمہارا نگہبان ہے“ ( النساء: ۱ ) ، «يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا» ”اے ایمان والو! اللہ سے ڈرو، اور راست اور پکی بات کہو“ ( الأحزاب: ۷۰ ) ۔ امام ترمذی کہتے ہیں: ۱- عبداللہ بن مسعود رضی الله عنہ کی حدیث حسن ہے، ۲- اسے اعمش نے بطریق: «أبي إسحق عن أبي الأحوص عن عبد الله عن النبي صلى الله عليه وسلم» روایت کیا ہے۔ نیز اسے شعبہ نے بطریق: «أبي إسحق عن أبي عبيدة عن عبد الله عن النبي صلى الله عليه وسلم» روایت کیا ہے، اور یہ دونوں طریق صحیح ہیں، اس لیے کہ اسرائیل نے دونوں کو جمع کر دیا ہے، یعنی «عن أبي إسحق عن أبي الأحوص وأبي عبيدة عن عبد الله بن مسعود عن النبي صلى الله عليه وسلم»،‏‏‏‏ ۳- اس باب میں عدی بن حاتم رضی الله عنہ سے بھی روایت ہے، ۴- اہل علم نے کہا ہے کہ نکاح بغیر خطبے کے بھی جائز ہے۔ اہل علم میں سے سفیان ثوری وغیرہ کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایسے سبھی خطبے جس میں تشہد نہ ہو اس ہاتھ کی طرح ہیں جس میں کوڑھ ہو“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” «ثیبہ» ( شوہر دیدہ عورت خواہ بیوہ ہو یا مطلقہ ) کا نکاح نہ کیا جائے جب تک کہ اس کی رضا مندی ۱؎ حاصل نہ کر لی جائے، اور کنواری ۲؎ عورت کا نکاح نہ کیا جائے جب تک کہ اس کی اجازت نہ لے لی جائے اور اس کی اجازت خاموشی ہے“ ۳؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر، ابن عباس، عائشہ اور عرس بن عمیرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے کہ «ثیبہ» ( شوہر دیدہ ) کا نکاح اس کی رضا مندی حاصل کیے بغیر نہیں کیا جائے گا۔ اگر اس کے باپ نے اس کی شادی اس کی رضا مندی کے بغیر کر دی اور اسے وہ ناپسند ہو تو تمام اہل علم کے نزدیک وہ نکاح منسوخ ہو جائے گا، ۴- کنواری لڑکیوں کے باپ ان کی شادی ان کی اجازت کے بغیر کر دیں تو اہل علم کا اختلاف ہے۔ کوفہ وغیرہ کے اکثر اہل علم کا خیال ہے کہ باپ اگر کنواری لڑکی کی شادی اس کی اجازت کے بغیر کر دے اور وہ بالغ ہو اور پھر وہ اپنے والد کی شادی پر راضی نہ ہو تو نکاح منسوخ ہو جائے گا ۴؎، ۵- اور بعض اہل مدینہ کہتے ہیں کہ کنواری کی شادی اگر باپ نے کر دی ہو تو درست ہے گو وہ اسے ناپسند ہو، یہ مالک بن انس، شافعی، احمد اور اسحاق بن راہویہ کا قول ہے ۵؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ «ثیبہ» ( شوہر دیدہ ) عورت اپنے آپ پر اپنے ولی سے زیادہ استحقاق رکھتی ہے ۱؎ اور کنواری سے بھی اجازت طلب کی جائے گی اور اس کی اجازت اس کی خاموشی ہے ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- شعبہ اور ثوری نے اسے مالک بن انس سے روایت کیا ہے، ۳- بعض لوگوں نے بغیر ولی کے نکاح کے جواز پر اسی حدیث سے دلیل لی ہے۔ حالانکہ اس حدیث میں ایسی کوئی چیز نہیں ہے جو اس کی دلیل بنے۔ اس لیے کہ ابن عباس سے کئی اور طرق سے مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ولی کے بغیر نکاح درست نہیں“۔ نبی اکرم صلی اللہ علیہ وسلم کے بعد ابن عباس نے بھی یہی فتویٰ دیا کہ ولی کے بغیر نکاح درست نہیں، ۴- اور «الأيم أحق بنفسها من وليها» کا مطلب اکثر اہل علم کے نزدیک یہ ہے کہ ولی ثیبہ کا نکاح اس کی رضا مندی اور اس سے مشورہ کے بغیر نہ کرے۔ اگر اس نے ایسا کیا تو خنساء بنت خدام کی حدیث کی رو سے نکاح فسح ہو جائے گا۔ ان کے والد نے ان کی شادی کر دی، اور وہ شوہر دیدہ عورت تھیں، انہیں یہ شادی ناپسند ہوئی تو نبی اکرم صلی اللہ علیہ وسلم نے ان کے نکاح کو فسخ کر دیا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یتیم لڑکی سے اس کی رضا مندی حاصل کی جائے گی، اگر وہ خاموش رہی تو یہی اس کی رضا مندی ہے، اور اگر اس نے انکار کیا تو اس پر ( زبردستی کرنے کا ) کوئی جواز نہیں“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن ہے، ۲- اس باب میں ابوموسیٰ، ابن عمر، اور عائشہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- یتیم لڑکی کی شادی کے سلسلے میں اہل علم نے اختلاف کیا ہے۔ بعض اہل علم کا خیال ہے: یتیم لڑکی کی جب شادی کر دی جائے تو نکاح موقوف رہے گا۔ یہاں تک کہ وہ بالغ ہو جائے۔ جب وہ بالغ ہو جائے گی، تو اسے نکاح کو باقی رکھنے یا اسے فسخ کر دینے کا اختیار ہو گا۔ یہی بعض تابعین اور دیگر علماء کا بھی قول ہے، ۴- اور بعض کہتے ہیں: یتیم لڑکی کا نکاح جب تک وہ بالغ نہ ہو جائے، درست نہیں اور نکاح میں «خیار» جائز نہیں، اور اہل علم میں سے سفیان ثوری، شافعی وغیرہم کا یہی قول ہے، ۵- احمد اور اسحاق بن راہویہ کہتے ہیں کہ جب یتیم لڑکی نو سال کی ہو جائے اور اس کا نکاح کر دیا جائے، اور وہ اس پر راضی ہو تو نکاح درست ہے اور بالغ ہونے کے بعد اسے اختیار نہیں ہو گا۔ ان دونوں نے عائشہ کی اس حدیث سے دلیل لی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے جب ان کے ساتھ شب زفاف منائی، تو وہ نو برس کی تھیں۔ اور عائشہ رضی الله عنہا کا قول ہے کہ لڑکی جب نو برس کی ہو جائے تو وہ عورت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "سمرہ بن جندب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس عورت کی شادی دو ولی الگ الگ جگہ کر دیں تو وہ ان میں سے پہلے کے لیے ہو گی، اور جو شخص کوئی چیز دو آدمیوں سے بیچ دے تو وہ بھی ان میں سے پہلے کی ہوئی“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اہل علم کا اسی پر عمل ہے۔ اس سلسلے میں ہمیں علماء کے درمیان کسی اختلاف کا علم نہیں ہے۔ دو ولی میں سے ایک ولی جب دوسرے سے پہلے شادی کر دے تو پہلے کا نکاح جائز ہو گا، اور دوسرے کا نکاح فسخ قرار دیا جائے گا، اور جب دونوں نے ایک ساتھ نکاح ( دو الگ الگ شخصوں سے ) کیا ہو تو دونوں کا نکاح فسخ ہو جائے گا۔ یہی ثوری، احمد اور اسحاق بن راہویہ کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "جابر بن عبداللہ رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو غلام اپنے مالک کی اجازت کے بغیر شادی کر لے، وہ زانی ہے“۔ امام ترمذی کہتے ہیں: ۱- جابر کی حدیث حسن ہے، ۲- بعض نے اس حدیث کو بسند «عبد الله بن محمد بن عقيل عن ابن عمر عن النبي صلى الله عليه وسلم» روایت کیا ہے، اور یہ صحیح نہیں ہے، صحیح یہ ہے کہ عبداللہ بن محمد بن عقیل نے جابر سے روایت کی ہے، ۳- اس باب میں ابن عمر رضی الله عنہما سے بھی حدیث آئی ہے، ۴- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے کہ مالک کی اجازت کے بغیر غلام کا نکاح کرنا جائز نہیں۔ یہی احمد اور اسحاق بن راہویہ وغیرہ کا بھی قول ہے، اس میں کوئی اختلاف نہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "اس سند سے بھی جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس غلام نے اپنے آقا کی اجازت کے بغیر شادی کی وہ زانی ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "عامر بن ربیعہ رضی الله عنہ کہتے ہیں کہ بنی فزارہ کی ایک عورت نے دو جوتی مہر پر نکاح کر لیا، تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا: کیا تو اپنی جان و مال سے دو جوتی مہر پر راضی ہے؟ اس نے عرض کیا: جی ہاں راضی ہوں۔ وہ کہتے ہیں: تو آپ نے اس نکاح کو درست قرار دے دیا۔ امام ترمذی کہتے ہیں: ۱- عامر بن ربیعہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر، ابوہریرہ، سہل بن سعد، ابو سعید خدری، انس، عائشہ، جابر اور ابوحدرد اسلمی رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا مہر کے سلسلے میں اختلاف ہے۔ بعض اہل علم کہتے ہیں: مہر اس قدر ہو کہ جس پر میاں بیوی راضی ہوں۔ یہ سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۴- مالک بن انس کہتے ہیں: مہر ایک چوتھائی دینار سے کم نہیں ہونا چاہیئے، ۵- بعض اہل کوفہ کہتے ہیں: مہر دس درہم سے کم نہیں ہونا چاہیئے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "سہل بن سعد ساعدی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک عورت نے آ کر عرض کیا کہ میں نے اپنے آپ کو آپ کے لیے ہبہ کر دیا۔ پھر وہ کافی دیر کھڑی رہی ( اور آپ نے اسے کوئی جواب نہیں دیا ) تو ایک شخص نے عرض کیا: اللہ کے رسول! اگر آپ کو اس کی حاجت نہ ہو تو اس سے میرا نکاح کر دیجئیے۔ آپ نے فرمایا: ”کیا تمہارے پاس مہر ادا کرنے کے لیے کوئی چیز ہے؟“، اس نے عرض کیا: میرے پاس میرے اس تہبند کے سوا کچھ نہیں ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم اپنا تہبند اسے دے دو گے تو تو بغیر تہبند کے رہ جاؤ گے، تو تم کوئی اور چیز تلاش کرو“، اس نے عرض کیا: میں کوئی چیز نہیں پا رہا ہوں۔ آپ نے ( پھر ) فرمایا: ”تم تلاش کرو، بھلے لوہے کی ایک انگوٹھی ہی کیوں نہ ہو“۔ اس نے تلاش کیا لیکن اسے کوئی چیز نہیں ملی۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کیا تمہیں کچھ قرآن یاد ہے؟“، اس نے کہا: جی ہاں، فلاں، فلاں سورۃ یاد ہے اور اس نے چند سورتوں کے نام لیے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے تمہاری شادی اس عورت سے ان سورتوں کے بدلے کر دی جو تمہیں یاد ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- شافعی اسی حدیث کی طرف گئے ہیں۔ وہ کہتے ہیں کہ اگر اس کے پاس مہر ادا کرنے کے لیے کوئی چیز نہ ہو اور وہ قرآن کی کسی سورۃ کو مہر بنا کر کسی عورت سے نکاح کرے تو نکاح درست ہے اور وہ اسے قرآن کی وہ سورۃ سکھائے گا، ۳- بعض اہل علم کہتے ہیں: نکاح جائز ہو گا لیکن اسے مہر مثل ادا کرنا ہو گا۔ یہ اہل کوفہ، احمد اور اسحاق بن راہویہ کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے صفیہ کو آزاد کیا اور ان کی آزادی کو ان کا مہر قرار دیا۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث حسن صحیح ہے، ۲- اس باب میں صفیہ رضی الله عنہا سے بھی حدیث آئی ہے، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ یہی شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۴- اور بعض اہل علم نے اس کی آزادی کو اس کا مہر قرار دینے کو مکروہ کہا ہے، یہاں تک کہ اس کا مہر آزادی کے علاوہ کسی اور چیز کو مقرر کیا جائے۔ لیکن پہلا قول زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "ابوموسیٰ عبداللہ بن قیس اشعری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تین لوگ ہیں جنہیں دہرا اجر دیا جاتا ہے: ایک وہ بندہ جو اللہ کا حق ادا کرے اور اپنے مالک کا حق بھی، اسے دہرا اجر دیا جاتا ہے، اور دوسرا وہ شخص جس کی ملکیت میں کوئی خوبصورت لونڈی ہو، وہ اس کی تربیت کرے اور اچھی تربیت کرے پھر اسے آزاد کر دے، پھر اس سے نکاح کر لے اور یہ سب اللہ کی رضا کی طلب میں کرے، تو اسے دہرا اجر دیا جاتا ہے۔ اور تیسرا وہ شخص جو پہلے کتاب ( تورات و انجیل ) پر ایمان لایا ہو پھر جب دوسری کتاب ( قرآن مجید ) آئی تو اس پر بھی ایمان لایا تو اسے بھی دہرا اجر دیا جاتا ہے“۔ امام ترمذی کہتے ہیں: ابوموسیٰ اشعری رضی الله عنہ کی حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص نے کسی عورت سے نکاح کیا اور اس کے ساتھ دخول کیا تو اس کے لیے اس کی بیٹی سے نکاح کرنا درست نہیں ہے، اور اگر اس نے اس کے ساتھ دخول نہیں کیا ہے تو وہ اس کی بیٹی سے نکاح کر سکتا ہے، اور جس مرد نے کسی عورت سے نکاح کیا تو اس نے اس سے دخول کیا ہو یا نہ کیا ہو اس کے لیے اس کی ماں سے نکاح کرنا حلال نہیں ہو گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث سند کے اعتبار سے صحیح نہیں ہے، اسے صرف ابن لہیعہ اور مثنی بن صالح نے عمرو بن شعیب سے روایت کیا ہے۔ اور مثنی بن صالح اور ابن لہیعہ حدیث کے سلسلے میں ضعیف قرار دیے جاتے ہیں۔ ۲- اکثر اہل علم کا اسی پر عمل ہے۔ وہ کہتے ہیں کہ جب آدمی کسی کی ماں سے شادی کر لے اور پھر اسے دخول سے پہلے طلاق دیدے تو اس کے لیے اس کی بیٹی سے نکاح جائز ہے، اور جب آدمی کسی کی بیٹی سے نکاح کرے اور اسے دخول سے پہلے طلاق دیدے تو اس کے لیے اس کی ماں سے نکاح جائز نہیں ہے اس لیے کہ اللہ تعالیٰ کا ارشاد ہے «وأمهات نسائكم» ( النساء: ۲۳ ) ، یہی شافعی، احمد اور اسحاق بن راہویہ کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رفاعہ قرظی کی بیوی نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر کہا: میں رفاعہ کے نکاح میں تھی۔ انہوں نے مجھے طلاق دے دی اور میری طلاق طلاق بتہ ہوئی ہے۔ پھر میں نے عبدالرحمٰن بن زبیر سے شادی کر لی، ان کے پاس صرف کپڑے کے پلو کے سوا کچھ نہیں ہے ۱؎، آپ نے فرمایا: ”تو کیا تم رفاعہ کے پاس لوٹ جانا چاہتی ہو؟ ایسا نہیں ہو سکتا جب تک کہ تم ان ( عبدالرحمٰن ) کی لذت نہ چکھ لو اور وہ تمہاری لذت نہ چکھ لیں“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- ام المؤمنین عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر، انس، رمیصاء، یا غمیصاء اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے اکثر اہل علم کا اسی پر عمل ہے کہ آدمی جب اپنی بیوی کو تین طلاق دیدے پھر وہ کسی اور سے شادی کر لے اور وہ دوسرا شخص دخول سے پہلے اسے طلاق دیدے تو اس کے لیے پہلے شوہر سے نکاح درست نہیں جب تک کہ دوسرے شوہر نے اس سے جماع نہ کر لیا ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "علی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حلالہ کرنے اور کرانے والے پر لعنت بھیجی ہے ۱؎۔ امام ترمذی کہتے ہیں: ۱- علی اور جابر رضی الله عنہما کی حدیث معلول ہے، ۲- اسی طرح اشعث بن عبدالرحمٰن نے بسند «مجالد عن عامر هو الشعبي عن الحارث عن علي» روایت کی ہے۔ اور عامر الشعبی نے بسند «جابر بن عبد الله عن النبي صلى الله عليه وسلم» روایت کی ہے، ۳- اس حدیث کی سند کچھ زیادہ درست نہیں ہے۔ اس لیے کہ مجالد بن سعید کو بعض اہل علم نے ضعیف گردانا ہے۔ انہی میں سے احمد بن حنبل ہیں، ۴- نیز عبداللہ بن نمیر نے اس حدیث کو بسند «مجالد عن عامر عن جابر بن عبد الله عن علي» روایت کی ہے، اس میں ابن نمیر کو وہم ہوا ہے۔ پہلی حدیث زیادہ صحیح ہے، ۵- اور اسے مغیرہ، ابن ابی خالد اور کئی اور لوگوں نے بسند «الشعبی عن الحارث عن علی» روایت کی ہے، ۶- اس باب میں ابن مسعود، ابوہریرہ، عقبہ بن عامر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حلالہ کرنے والے اور کرانے والے ( دونوں ) پر لعنت بھیجی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ حدیث نبی اکرم صلی اللہ علیہ وسلم سے کئی اور طرق سے بھی روایت کی گئی ہے، ۳- صحابہ کرام میں سے اہل علم کا اسی حدیث پر عمل ہے۔ جن میں عمر بن خطاب، عثمان بن عفان، عبداللہ بن عمر وغیرہم رضی الله عنہم بھی شامل ہیں۔ یہی تابعین میں سے فقہاء کا بھی قول ہے اور یہی سفیان ثوری، ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ بھی کہتے ہیں، وکیع نے بھی یہی کہا ہے، ۴- نیز وکیع کہتے ہیں: اصحاب رائے کے قول کو پھینک دینا ہی مناسب ہو گا ۱؎، ۵- سفیان ثوری کہتے ہیں: آدمی جب عورت سے نکاح اس نیت سے کرے کہ وہ اسے ( پہلے شوہر کے لیے ) حلال کرے گا پھر اسے اس عورت کو اپنی زوجیت میں رکھ لینا ہی بھلا معلوم ہو تو وہ اسے اپنی زوجیت میں نہیں رکھ سکتا جب تک کہ اس سے نئے نکاح کے ذریعے سے شادی نہ کرے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "علی رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے خیبر کی فتح کے وقت عورتوں سے متعہ ۱؎ کرنے سے اور گھریلو گدھوں کے گوشت کھانے سے منع فرمایا۔ امام ترمذی کہتے ہیں: ۱- علی رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں سبرہ جہنی اور ابوہریرہ رضی الله عنہ سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے، البتہ ابن عباس سے کسی قدر متعہ کی اجازت بھی روایت کی گئی ہے، پھر انہوں نے اس سے رجوع کر لیا جب انہیں نبی اکرم صلی اللہ علیہ وسلم کے بارے میں اس کی خبر دی گئی۔ اکثر اہل علم کا معاملہ متعہ کی حرمت کا ہے، یہی ثوری، ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ متعہ ابتدائے اسلام میں تھا۔ آدمی جب کسی ایسے شہر میں جاتا جہاں اس کی جان پہچان نہ ہوتی تو وہ اپنے قیام کی مدت تک کے لیے کسی عورت سے شادی کر لیتا۔ وہ اس کے سامان کی حفاظت کرتی۔ اس کی چیزیں درست کر کے رکھتی۔ یہاں تک کہ جب آیت کریمہ «إلا على أزواجهم أو ما ملكت أيمانهم» ”لوگ اپنی شرمگاہوں کو صرف دو ہی جگہ کھول سکتے ہیں، ایک اپنی بیویوں پر، دوسرے اپنی ماتحت لونڈیوں پر“، نازل ہوئی تو ابن عباس رضی الله عنہما کہتے ہیں: ان دو کے علاوہ باقی تمام شرمگاہیں حرام ہو گئیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "عمران بن حصین رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اسلام میں نہ «جلب» ہے، نہ «جنب» ۱؎ اور نہ ہی «شغار»،‏‏‏‏ اور جو کسی کی کوئی چیز اچک لے، وہ ہم میں سے نہیں ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں انس، ابوریحانہ، ابن عمر، جابر، معاویہ، ابوہریرہ، اور وائل بن حجر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے نکاح شغار سے منع فرمایا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اکثر اہل علم کا اسی پر عمل ہے، یہ لوگ نکاح شغار کو درست نہیں سمجھتے، ۳- شغار یہ ہے کہ آدمی اپنی بیٹی کا نکاح کسی سے اس شرط پر کرے کہ وہ بھی اپنی بیٹی یا بہن کا نکاح اس سے کر دے گا اور ان کے درمیان کوئی مہر مقرر نہ ہو، ۴- بعض اہل علم کہتے ہیں: نکاح شغار فسخ کر دیا جائے گا اور وہ حلال نہیں، اگرچہ بعد میں ان کے درمیان مہر مقرر کر لیا جائے۔ یہ شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۵- لیکن عطاء بن ابی رباح کہتے ہیں کہ وہ اپنے نکاح پر قائم رہیں گے البتہ ان کے درمیان مہر مثل مقرر کر دیا جائے گا، اور یہی اہل کوفہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے منع فرمایا کہ کسی عورت سے شادی کی جائے اور اس کی پھوپھی یا اس کی خالہ ( پہلے سے ) نکاح میں ہو۔ امام ترمذی کہتے ہیں: ۱- ابوحریز کا نام عبداللہ بن حسین ہے –",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ عورت سے نکاح کیا جائے جب کہ اس کی پھوپھی ( پہلے سے ) نکاح میں ہو یا پھوپھی سے نکاح کیا جائے جبکہ اس کی بھتیجی ( پہلے سے ) نکاح میں ہو یا بھانجی سے نکاح کیا جائے جب کہ اس کی خالہ ( پہلے سے ) نکاح میں ہو یا خالہ سے نکاح کیا جائے جب کہ اس کی بھانجی پہلے سے نکاح میں ہو۔ اور نہ نکاح کیا جائے کسی چھوٹی سے جب کہ اس کی بڑی نکاح میں ہو اور نہ بڑی سے نکاح کیا جائے جب کہ چھوٹی نکاح میں ہو ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عباس اور ابوہریرہ رضی الله عنہم کی حدیث حسن صحیح ہے، ۲- اکثر اہل علم کا اسی پر عمل ہے۔ ہمیں ان کے درمیان اس بات میں کسی اختلاف کا علم نہیں کہ آدمی کے لیے یہ جائز نہیں کہ وہ بیک وقت کسی عورت کو اس کی پھوپھی کے ساتھ یا اس کی خالہ کے ساتھ نکاح میں رکھے۔ اگر اس نے کسی عورت سے نکاح کر لیا جب کہ اس کی پھوپھی یا خالہ بھی اس کے نکاح میں ہو یا پھوپھی سے نکاح کر لیا جب کہ اس کی بھتیجی نکاح میں ہو تو ان میں سے جو نکاح بعد میں ہوا ہے، وہ فسخ ہو گا، یہی تمام اہل علم کا قول ہے، ۳- شعبی نے ابوہریرہ کو پایا ہے اور ان سے ( براہ راست ) روایت بھی کی ہے۔ میں نے محمد بن اسماعیل بخاری سے اس بارے میں پوچھا تو انہوں نے کہا: صحیح ہے، ۴- شعبی نے ابوہریرہ سے ایک شخص کے واسطے سے بھی روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "عقبہ بن عامر جہنی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سب سے زیادہ پوری کیے جانے کی مستحق وہ شرطیں ہیں جن کے ذریعے تم نے شرمگاہیں حلال کی ہوں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام میں سے بعض اہل علم کا اسی پر عمل ہے۔ انہیں میں عمر بن خطاب بھی ہیں، وہ کہتے ہیں کہ جب کسی شخص نے کسی عورت سے شادی کی اور یہ شرط لگائی کہ وہ اسے اس کے شہر سے باہر نہیں لے جائے گا تو اس کے لیے جائز نہیں کہ وہ اسے باہر لے جائے، یہی بعض اہل علم کا قول ہے۔ اور شافعی، احمد اور اسحاق بن راہویہ بھی اسی کے قائل ہیں، ۳- البتہ علی بن ابی طالب سے مروی ہے کہ انہوں نے کہا: اللہ کی شرط یعنی اللہ کا حکم عورت کی شرط پر مقدم ہے، گویا ان کی نظر میں شوہر کے لیے اسے اس کے شہر سے باہر لے جانا درست ہے اگرچہ اس نے اپنے شوہر سے اسے باہر نہ لے جانے کی شرط لگا رکھی ہو، اور بعض اہل علم اس جانب گئے ہیں اور یہی سفیان ثوری اور بعض اہل کوفہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ غیلان بن سلمہ ۱؎ ثقفی نے اسلام قبول کیا، جاہلیت میں ان کی دس بیویاں تھیں، وہ سب بھی ان کے ساتھ اسلام لے آئیں، تو نبی اکرم صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ وہ ان میں سے کسی چار کو منتخب کر لیں ۲؎۔ امام ترمذی کہتے ہیں: ۱- اسی طرح اسے معمر نے بسند «الزهري عن سالم بن عبدالله عن ابن عمر» روایت کیا ہے، ۲- میں نے محمد بن اسماعیل بخاری کو کہتے سنا کہ یہ حدیث غیر محفوظ ہے۔ اور صحیح وہ ہے جو شعیب بن ابی حمزہ وغیرہ نے بسند «الزهري عن محمد بن سويد الثقفي» روایت کی ہے کہ غیلان بن سلمہ نے اسلام قبول کیا تو ان کے پاس دس بیویاں تھیں۔ محمد بن اسماعیل بخاری کہتے ہیں کہ صحیح زہری کی حدیث ہے جسے انہوں نے سالم بن عبداللہ سے اور سالم نے اپنے والد عبداللہ بن عمر سے روایت کی ہے کہ ثقیف کے ایک شخص نے اپنی بیویوں کو طلاق دے دی تو عمر نے اس سے کہا: تم اپنی بیویوں سے رجوع کر لو ورنہ میں تمہاری قبر کو پتھر ماروں گا جیسے ابورغال ۳؎ کی قبر کو پتھر مارے گئے تھے۔ ۴- ہمارے اصحاب جن میں شافعی، احمد اور اسحاق بن راہویہ بھی شامل ہیں کے نزدیک غیلان بن سلمہ کی حدیث پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "فیروز دیلمی رضی الله عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، میں نے عرض کیا: اللہ کے رسول! میں نے اسلام قبول کر لیا ہے اور میرے نکاح میں دو بہنیں ہیں؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم ان دونوں میں سے جسے چاہو منتخب کر لو“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "فیروز دیلمی رضی الله عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! میں نے اسلام قبول کیا ہے اور میرے نکاح میں دو بہنیں ہیں۔ آپ نے فرمایا: ”ان دونوں میں سے جسے چاہو، منتخب کر لو“۔ ( اور دوسرے کو طلاق دے دو ) امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "رویفع بن ثابت رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو اللہ اور یوم آخرت پر ایمان رکھتا ہو وہ اپنی ( منی ) کسی غیر کے بچے کو نہ پلائے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- یہ اور بھی کئی طرق سے رویفع بن ثابت رضی الله عنہ سے روایت کی گئی ہے، ۳- اہل علم کا عمل اسی پر ہے۔ یہ لوگ کسی شخص کے لیے یہ جائز نہیں سمجھتے کہ وہ جب کوئی حاملہ لونڈی خریدے تو وہ اس سے صحبت کرے جب تک کہ اسے وضع حمل نہ ہو جائے، ۴- اس باب میں ابو الدرداء، ابن عباس، عرباض بن ساریہ اور ابو سعید خدری رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ ہم نے جنگ اوطاس کے دن کچھ عورتیں قید کیں۔ اور ان کی قوم میں ان عورتوں کے شوہر موجود تھے، لوگوں نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو یہ آیت نازل ہوئی «والمحصنات من النساء إلا ما ملكت أيمانكم» ”تم پر شوہر والی عورتیں بھی حرام ہیں الا یہ کہ وہ تمہاری ملکیت میں آ گئی ہوں“ ( النساء: ۲۴ ) ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اسی طرح سے اسے ثوری نے بطریق: «عثمان البتي عن أبي الخليل عن أبي سعيد» روایت کیا ہے –",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "ابومسعود انصاری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے کتے کی قیمت ۱؎، زانیہ کی کمائی ۲؎ اور کاہن کی مٹھائی ۳؎ سے منع فرمایا ہے۔ امام ترمذی کہتے ہیں: ۱- ابومسعود انصاری رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں رافع بن خدیج، ابوجحیفہ، ابوہریرہ، اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کوئی آدمی اپنے بھائی کی بیع پر بیع نہ کرے اور نہ کوئی اپنے بھائی کے پیغام پر اپنا پیغام بھیجے“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں سمرہ اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- مالک بن انس کہتے ہیں: آدمی کے اپنے بھائی کے پیغام پر اپنا پیغام بھیجنے کی ممانعت کا مطلب یہ ہے کہ آدمی نے کسی عورت کو پیغام دیا ہو اور وہ عورت اس سے راضی ہو گئی ہو، تو کسی کے لیے جائز نہیں کہ وہ اپنے بھائی کے پیغام پر اپنا پیغام بھیجے، ۴- شافعی کہتے ہیں کہ اس حدیث کہ آدمی اپنے بھائی کے پیغام پر پیغام نہ بھیجے کا مطلب ہمارے نزدیک یہ ہے کہ جب آدمی نے کسی عورت کو پیغام بھیجا ہو اور وہ عورت اس سے راضی ہو گئی ہو اور اس کی طرف مائل ہو گئی ہو تو ایسی صورت میں کسی کے لیے درست نہیں کہ وہ اس کے پیغام پر اپنا پیغام بھیجے، لیکن اس کی رضا مندی اور اس کا میلان معلوم ہونے سے پہلے اگر وہ اسے پیغام دے تو اس میں کوئی حرج نہیں ہے۔ اس کی دلیل فاطمہ بنت قیس رضی الله عنہا کی یہ حدیث ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر ذکر کیا کہ ابوجہم بن حذیفہ اور معاویہ بن ابی سفیان نے انہیں نکاح کا پیغام دیا ہے تو آپ نے فرمایا: ”ابوجہم کا معاملہ یہ ہے کہ وہ اپنا ڈنڈا عورتوں سے نہیں اٹھاتے ( یعنی عورتوں کو بہت مارتے ہیں ) رہے معاویہ تو وہ غریب آدمی ہیں ان کے پاس مال نہیں ہے، لہٰذا تم اسامہ بن زید سے نکاح کر لو“۔ ہمارے نزدیک اس حدیث کا مفہوم ( اور اللہ بہتر جانتا ہے ) یہ ہے کہ فاطمہ نے ان میں سے کسی ایک کے ساتھ بھی اپنی رضا مندی کا اظہار نہیں کیا تھا اور اگر وہ اس کا اظہار کر دیتیں تو اسے چھوڑ کر آپ انہیں اسامہ رضی الله عنہ سے نکاح کا مشورہ نہ دیتے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "ابوبکر بن ابی جہم کہتے ہیں کہ میں اور ابوسلمہ بن عبدالرحمٰن دونوں فاطمہ بنت قیس رضی الله عنہا کے پاس آئے انہوں نے ہم سے بیان کیا کہ ان کے شوہر نے انہیں تین طلاق دے دی اور نہ ان کے لیے رہائش کا انتظام کیا اور نہ کھانے پینے کا۔ اور انہوں نے میرے لیے دس بوری غلہ، پانچ بوری جو کے اور پانچ گیہوں کے اپنے چچا زاد بھائی کے پاس رکھ دیں، تو میں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر آپ سے اس کا ذکر کیا، تو آپ نے فرمایا: ”انہوں نے ٹھیک کیا، اور مجھے آپ نے حکم دیا کہ میں ام شریک کے گھر میں عدت گزاروں“، پھر مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ام شریک کے گھر مہاجرین آتے جاتے رہتے ہیں۔ تم ابن ام مکتوم کے گھر میں عدت گزارو“۔ وہاں یہ بھی سہولت رہے گی کہ تم ( سر وغیرہ سے ) کپڑے اتارو گی تو تمہیں وہ نہیں دیکھ پائیں گے، پھر جب تمہاری عدت پوری ہو جائے اور کوئی تمہارے پاس پیغام نکاح لے کر آئے تو مجھے بتانا، چنانچہ جب میری عدت پوری ہو گئی تو ابوجہم اور معاویہ نے مجھے پیغام بھیجا۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر آپ سے اس کا ذکر کیا تو آپ نے فرمایا: ”معاویہ تو ایسے آدمی ہیں کہ ان کے پاس مال نہیں، اور ابوجہم عورتوں کے لیے سخت واقع ہوئے ہیں“۔ پھر مجھے اسامہ بن زید رضی الله عنہ نے پیغام بھیجا اور مجھ سے شادی کر لی۔ اللہ تعالیٰ نے اسامہ میں مجھے برکت عطا فرمائی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح ہے، ۲- اسے سفیان ثوری نے بھی ابوبکر بن ابی جہم سے اسی حدیث کی طرح روایت کیا ہے، اور اس میں انہوں نے اتنا اضافہ کیا ہے کہ مجھ سے نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم اسامہ سے نکاح کر لو“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ ہم نے عرض کیا: اللہ کے رسول! ہم لوگ عزل ۱؎ کرتے تھے، تو یہودیوں نے کہا: قبر میں زندہ دفن کرنے کی یہ ایک چھوٹی صورت ہے۔ آپ نے فرمایا: ”یہودیوں نے جھوٹ کہا۔ اللہ جب اسے پیدا کرنا چاہے گا تو اسے کوئی روک نہیں سکے گا“ ۲؎۔ امام ترمذی کہتے ہیں: اس باب میں عمر، براء اور ابوہریرہ، ابو سعید خدری رضی اللہ عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ ہم عزل کرتے تھے اور قرآن اتر رہا تھا ۱؎۔ امام ترمذی کہتے ہیں: ۱- جابر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- یہ حدیث اور بھی کئی طرق سے ان سے مروی ہے، ۳- صحابہ کرام وغیرہم میں سے اہل علم کی ایک جماعت نے عزل کی اجازت دی ہے۔ مالک بن انس کا قول ہے کہ آزاد عورت سے عزل کی اجازت لی جائے گی اور لونڈی سے اجازت لینے کی ضرورت نہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس عزل کا ذکر کیا گیا تو آپ نے فرمایا: ”تم میں سے کوئی ایسا کیوں کرتا ہے؟“۔ ابن ابی عمر نے اپنی حدیث میں یہ اضافہ کیا ہے: ”اور آپ نے یہ نہیں کہا کہ تم میں سے کوئی ایسا نہ کرے“، اور ان دونوں نے اپنی حدیث میں یہ بھی کہا ہے کہ ”جس جان کو بھی اللہ کو پیدا کرنا ہے وہ اسے پیدا کر کے ہی رہے گا“۔ امام ترمذی کہتے ہیں: ۱- ابو سعید خدری رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- یہ اس کے علاوہ اور بھی طرق سے ابو سعید خدری رضی الله عنہ سے مروی ہے، ۳- اس باب میں جابر رضی الله عنہ سے بھی روایت ہے، ۴- صحابہ کرام وغیرہم میں سے اہل علم کی ایک جماعت نے عزل کو مکروہ قرار دیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ اگر میں چاہوں تو کہوں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا لیکن انہوں نے صرف اتنا کہا: ”سنت ۱؎ یہ ہے کہ آدمی جب اپنی بیوی کے ہوتے ہوئے کسی کنواری سے شادی کرے تو اس کے ہاں سات رات ٹھہرے، اور جب غیر کنواری سے شادی کرے تو اس کے ہاں تین رات ٹھہرے“۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث حسن صحیح ہے، ۲- اسے محمد بن اسحاق نے مرفوع کیا ہے، انہوں نے بسند «ایوب عن ابی قلابہ عن انس» روایت کی ہے اور بعض نے اسے مرفوع نہیں کیا ہے، ۳- اس باب میں ام سلمہ رضی الله عنہا سے بھی روایت ہے، ۴- بعض اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں کہ جب آدمی اپنی بیوی کے ہوتے ہوئے کسی اور کنواری سے شادی کرے، تو اس کے پاس سات رات ٹھہرے، پھر اس کے بعد ان کے درمیان باری تقسیم کرے، اور پہلی بیوی کے ہوتے ہوئے جب کسی غیر کنواری ( بیوہ یا مطلقہ ) سے شادی کرے تو اس کے پاس تین رات ٹھہرے۔ مالک، شافعی، احمد اور اسحاق بن راہویہ کا یہی قول ہے، ۵- تابعین میں سے بعض اہل علم نے کہا کہ جب کوئی اپنی بیوی کے ہوتے ہوئے کنواری سے شادی کرے تو وہ اس کے پاس تین رات ٹھہرے اور جب غیر کنواری سے شادی کرے تو اس کے ہاں دو رات ٹھہرے۔ لیکن پہلا قول زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم اپنی بیویوں کے درمیان باری تقسیم کرتے ہوئے فرماتے: ”اے اللہ! یہ میری تقسیم ہے جس پر میں قدرت رکھتا ہوں، لیکن جس کی قدرت تو رکھتا ہے، میں نہیں رکھتا، اس کے بارے میں مجھے ملامت نہ کرنا“۔ امام ترمذی کہتے ہیں: عائشہ رضی الله عنہا کی حدیث کو اسی طرح کئی لوگوں نے بسند «حماد بن سلمة عن أيوب عن أبي قلابة عن عبد الله بن يزيد عن عائشة» روایت کیا ہے کہ نبی اکرم صلی اللہ علیہ وسلم باری تقسیم کرتے تھے جب کہ اسے حماد بن زید اور دوسرے کئی ثقات نے بسند «أيوب عن أبي قلابة» روایت کیا ہے کہ نبی اکرم صلی اللہ علیہ وسلم باری تقسیم کرتے تھے اور یہ حماد بن سلمہ کی حدیث سے زیادہ صحیح ہے، اور ”جس کی قدرت تو رکھتا ہے میں نہیں رکھتا“ سے مراد محبت و مؤدّۃ ہے، اسی طرح بعض اہل علم نے اس کی تفسیر کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جب کسی شخص کے پاس دو بیویاں ہوں اور ان کے درمیان انصاف سے کام نہ لے تو وہ قیامت کے دن اس حال میں آئے گا کہ اس کا ایک پہلو جھکا ہوا ہو گا“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کو ہمام بن یحییٰ نے قتادہ سے مسنداً ۱؎ روایت کیا ہے، ۲- اور اسے ہشام دستوائی نے بھی قتادہ سے روایت کیا ہے لیکن اس روایت میں ہے کہ ایسا کہا جاتا تھا … ۳- ہم اس حدیث کو صرف ہمام ہی کی روایت سے مرفوع جانتے ہیں اور ہمام ثقہ حافظ ہیں ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "عبداللہ بن عمرو رضی الله عنہما سے کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی لڑکی زینب کو ابوالعاص بن ربیع رضی الله عنہ کے پاس نئے مہر اور نئے نکاح کے ذریعے لوٹا دیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کی سند میں کچھ کلام ہے اور دوسری حدیث میں بھی کلام ہے، ۲- اہل علم کا عمل اسی حدیث پر ہے کہ عورت جب شوہر سے پہلے اسلام قبول کر لے، پھر اس کا شوہر عدت کے دوران اسلام لے آئے تو اس کا شوہر ہی اس کا زیادہ حقدار ہے جب وہ عدت میں ہو۔ یہی مالک بن انس، اوزاعی، شافعی، احمد اور اسحاق بن راہویہ کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنی بیٹی زینب کو ابوالعاص بن ربیع رضی الله عنہ کے پاس چھ سال بعد ۱؎ پہلے نکاح ہی پر واپس بھیج دیا اور پھر سے نکاح نہیں کیا۔ امام ترمذی کہتے ہیں: اس حدیث کی سند میں کوئی اشکال نہیں ہے، لیکن ہم اس حدیث میں نقد کی وجہ نہیں جانتے ہیں۔ شاید یہ چیز داود بن حصین کی جانب سے ان کے حفظ کی طرف سے آئی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے زمانے میں مسلمان ہو کر آیا پھر اس کی بیوی بھی مسلمان ہو کر آ گئی تو اس نے عرض کیا: اللہ کے رسول! اس نے میرے ساتھ اسلام قبول کیا تھا۔ تو آپ اسے مجھے واپس دے دیجئیے۔ تو آپ نے اسے اسی کو واپس دے دیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح ہے، ۲- حجاج نے یہ حدیث بطریق «عمرو بن شعيب عن أبيه عن جده» روایت کی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنی بیٹی زینب کو ابوالعاص کے ہاں نئے مہر اور نئے نکاح کے ذریعے لوٹایا، ۳- یزید بن ہارون کہتے ہیں کہ ابن عباس کی حدیث سند کے اعتبار سے سب سے اچھی ہے لیکن عمل «عمرو بن شعيب عن أبيه عن جده» کی حدیث پر ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "عبداللہ بن مسعود رضی الله عنہ سے روایت ہے کہ ان سے ایک ایسے شخص کے بارے میں پوچھا گیا جس نے ایک عورت سے شادی کی لیکن اس نے نہ اس کا مہر مقرر کیا اور نہ اس سے صحبت کی یہاں تک کہ وہ مر گیا، تو ابن مسعود رضی الله عنہ نے کہا: اس عورت کے لیے اپنے خاندان کی عورتوں کے جیسا مہر ہو گا۔ نہ اس سے کم اور نہ اس سے زیادہ۔ اسے عدت بھی گزارنی ہو گی اور میراث میں بھی اس کا حق ہو گا۔ تو معقل بن سنان اشجعی نے کھڑے ہو کر کہا: بروع بنت واشق جو ہمارے قبیلے کی عورت تھی، کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے ایسا ہی فیصلہ فرمایا تھا جیسا آپ نے کیا ہے۔ تو اس سے ابن مسعود رضی الله عنہ خوش ہوئے ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں جراح سے بھی روایت ہے۔ ۳- یزید بن ہارون اور عبدالرزاق نے بسند «سفيان عن منصور» سے اسی طرح روایت کی ہے، ۴- ابن مسعود رضی الله عنہ سے یہ اور بھی طرق سے مروی ہے، ۵- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے ۲؎ یہی ثوری، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۶- اور صحابہ کرام میں سے بعض اہل علم صحابہ کہتے ہیں: جن میں علی بن ابی طالب، زید بن ثابت، ابن عباس اور ابن عمر رضی الله عنہم بھی شامل ہیں کہتے ہیں کہ جب آدمی کسی عورت سے شادی کرے، اور اس نے اس سے ابھی دخول نہ کیا ہو اور نہ ہی اس کا مہر مقرر کیا ہو اور وہ مر جائے تو یہ لوگ کہتے ہیں کہ اس عورت کو میراث میں حق ملے گا، لیکن کوئی مہر نہیں ہو گا ۳؎ اور اسے عدت گزارنی ہو گی۔ یہی شافعی کا بھی قول ہے۔ وہ کہتے ہیں: اگر بروع بنت واشق کی حدیث صحیح ہو تو نبی اکرم صلی اللہ علیہ وسلم سے مروی ہونے کی وجہ سے حجت ہو گی۔ اور شافعی سے مروی ہے کہ انہوں نے بعد میں مصر میں اس قول سے رجوع کر لیا اور بروع بنت واشق کی حدیث کے مطابق فتویٰ دیا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		}
	]
}