{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"12": "The Book on Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے رضاعت سے بھی وہ سارے رشتے حرام کر دئیے ہیں جو نسب سے حرام ہیں“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- علی کی حدیث حسن صحیح ہے، ۲- اس باب میں عائشہ، ابن عباس اور ام حبیبہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے۔ اس سلسلے میں ہم ان کے درمیان اس بارے میں کوئی اختلاف نہیں جانتے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ نے رضاعت سے بھی وہ تمام رشتے حرام قرار دے دیئے ہیں جو ولادت ( نسب ) سے حرام ہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ وغیرہم میں سے اہل علم کا اسی پر عمل ہے۔ ہمیں نہیں معلوم کہ ان کے درمیان اس بارے میں کوئی اختلاف ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ میرے رضاعی چچا آئے، وہ مجھ سے اندر آنے کی اجازت مانگ رہے تھے، تو میں نے انہیں اجازت دینے سے انکار کیا یہاں تک کہ میں رسول اللہ صلی اللہ علیہ وسلم سے اجازت لے لوں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”وہ تیرے پاس آ سکتے ہیں کیونکہ وہ تیرے چچا ہیں“، اس پر انہوں نے عرض کیا: مجھے عورت نے دودھ پلایا ہے، مرد نے نہیں، تو آپ نے فرمایا: ”تیرے چچا ہیں، وہ تیرے پاس آ سکتے ہیں“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے انہوں نے «لبن فحل» ( مرد کے دودھ ) کو حرام کہا ہے۔ اس باب میں اصل عائشہ کی حدیث ہے، ۳- اور بعض اہل علم نے «لبن فحل» ( مرد کے دودھ ) کی رخصت دی ہے۔ پہلا قول زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ ان سے ایک ایسے شخص کے بارے میں پوچھا گیا جس کے پاس دو لونڈیاں ہوں، ان میں سے ایک نے ایک لڑکی کو دودھ پلایا ہے اور دوسری نے ایک لڑکے کو۔ تو کیا اس لڑکے کے لیے جائز ہے کہ وہ اس لڑکی سے شادی کرے۔ انہوں نے ( ابن عباس رضی الله عنہما ) نے کہا: نہیں۔ اس لیے کہ «لقاح» ایک ہی ہے ۱؎۔ امام ترمذی کہتے ہیں: یہی اس باب میں اصل ہے۔ احمد اور اسحاق بن راہویہ بھی اسی کے قائل ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1150,
			"arabicnumber": 1150,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ایک بار یا دو بار چھاتی سے دودھ چوس لینے سے حرمت رضاعت ثابت نہیں ہوتی“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اس باب میں ام فضل، ابوہریرہ، زبیر بن عوام اور ابن زبیر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اس حدیث کو دیگر کئی لوگوں نے بطریق: «هشام بن عروة عن أبيه عن عبد الله بن الزبير عن النبي صلى الله عليه وسلم» روایت کیا ہے کہ آپ نے فرمایا: ”ایک یا دو بار دودھ چوس لینے سے حرمت رضاعت ثابت نہیں ہوتی“۔ اور محمد بن دینار نے بطریق: «هشام بن عروة عن أبيه عن عبد الله بن الزبير عن الزبير عن النبي صلى الله عليه وسلم» روایت کیا ہے، اس میں محمد بن دینار بصریٰ نے زبیر کے واسطے کا اضافہ کیا ہے۔ لیکن یہ غیر محفوظ ہے، ۳- محدثین کے نزدیک صحیح ابن ابی ملیکہ کی روایت ہے جسے انہوں نے بطریق: «عبد الله بن الزبير عن عائشة عن النبي صلى الله عليه وسلم» روایت کیا ہے، ۴- میں نے محمد بن اسماعیل بخاری سے اس حدیث کے بارے میں پوچھا تو انہوں نے کہا: صحیح ابن زبیر کی روایت ہے جسے انہوں نے عائشہ سے روایت کی ہے اور محمد بن دینار کی روایت جس میں: زبیر کے واسطے کا اضافہ ہے وہ دراصل ہشام بن عروہ سے مروی ہے جسے انہوں نے اپنے والد عروہ سے اور انہوں نے زبیر سے روایت کی ہے، ۵- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے۔ ۶- عائشہ رضی اللہ عنہا کہتی ہیں کہ قرآن میں ( پہلے ) دس رضعات والی آیت نازل کی گئی پھر اس میں سے پانچ منسوخ کر دی گئیں تو پانچ رضاعتیں باقی رہ گئیں، اور رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو معاملہ انہیں پانچ پر قائم رہا ۲؎، ۷- اور عائشہ رضی اللہ عنہا اور بعض دوسری ازواج مطہرات رضی اللہ عنہن اسی کا فتویٰ دیتی تھیں، اور یہی شافعی اور اسحاق بن راہویہ کا بھی قول ہے۔ ۸- امام احمد نبی اکرم صلی اللہ علیہ وسلم کی حدیث ”ایک بار یا دو بار کے چوسنے سے حرمت ثابت نہیں ہوتی“ کے قائل ہیں اور انہوں نے یہ بھی کہا ہے کہ اگر کوئی عائشہ رضی الله عنہا کے پانچ رضعات والے قول کی طرف جائے تو یہ قوی مذہب ہے۔ لیکن انہیں اس کا فتویٰ دینے کی ہمت نہیں ہوئی، ۹- صحابہ کرام وغیرہم میں سے بعض اہل علم کہتے ہیں کہ رضاعت تھوڑی ہو یا زیادہ جب پیٹ تک پہنچ جائے تو اس سے حرمت ثابت ہو جاتی ہے۔ یہی سفیان ثوری، مالک بن انس، اوزاعی، عبداللہ بن مبارک، وکیع اور اہل کوفہ کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"text": "عقبہ بن حارث رضی الله عنہ کہتے ہیں کہ نے ایک عورت سے شادی کی تو ایک کالی کلوٹی عورت نے ہمارے پاس آ کر کہا: میں نے تم دونوں کو دودھ پلایا ہے، میں نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر عرض کیا کہ میں نے فلاں کی بیٹی فلاں سے شادی کی ہے، اب ایک کالی کلوٹی عورت نے آ کر کہا کہ میں نے تم دونوں کو دودھ پلایا ہے، وہ جھوٹ کہہ رہی ہے۔ آپ نے اپنا چہرہ مجھ سے پھیر لیا تو میں آپ کے چہرے کی طرف سے آیا، آپ نے ( پھر ) اپنا چہرہ پھیر لیا۔ میں نے عرض کیا: وہ جھوٹی ہے۔ آپ نے فرمایا: ”یہ کیسے ہو سکتا ہے جب کہ وہ کہہ چکی ہے کہ اس نے تم دونوں کو دودھ پلایا ہے۔ اپنی بیوی اپنے سے علاحدہ کر دو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عقبہ بن حارث رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس حدیث کو کئی اور بھی لوگوں نے ابن ابی ملیکہ سے روایت کیا ہے اور ابن ابی ملیکہ نے عقبہ بن حارث سے روایت کی ہے اور ان لوگوں نے اس میں عبید بن ابی مریم کے واسطے کا ذکر نہیں کیا ہے، نیز اس میں «دعها عنك» ”اسے اپنے سے علاحدہ کر دو“، کا ذکر بھی نہیں ہے۔ اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی حدیث پر عمل ہے۔ انہوں نے رضاعت کے سلسلے میں ایک عورت کی شہادت کو درست قرار دیا ہے، ۴- ابن عباس رضی الله عنہما کہتے ہیں: رضاعت کے سلسلے میں ایک عورت کی شہادت جائز ہے۔ لیکن اس سے قسم بھی لی جائے گی۔ احمد اور اسحاق بن راہویہ اسی کے قائل ہیں، ۵- اور بعض اہل علم نے کہا ہے کہ ایک عورت کی گواہی درست نہیں جب تک کہ وہ ایک سے زائد نہ ہوں۔ یہ شافعی کا قول ہے، ۶- وکیع کہتے ہیں: ایک عورت کی گواہی فیصلے میں درست نہیں۔ اور اگر ایک عورت کی گواہی سن کر وہ بیوی سے علاحدگی اختیار کر لے تو یہ عین تقویٰ ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1152,
			"arabicnumber": 1152,
			"text": "ام المؤمنین ام سلمہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”رضاعت سے حرمت اسی وقت ثابت ہوتی ہے جب وہ انتڑیوں کو پھاڑ دے ۱؎، اور یہ دودھ چھڑانے سے پہلے ہو“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہم میں سے اکثر اہل علم کا اسی پر عمل ہے کہ رضاعت کی حرمت اس وقت ہوتی ہے جب بچے کی عمر دو برس سے کم ہو، اور جو دو برس پورے ہونے کے بعد ہو تو اس سے کوئی چیز حرام نہیں ہوتی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1153,
			"arabicnumber": 1153,
			"text": "حجاج اسلمی رضی الله عنہ سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا کہ اللہ کے رسول! مجھ سے حق رضاعت کس چیز سے ادا ہو گا؟ آپ نے فرمایا: ”ایک جان: غلام یا لونڈی کے ذریعہ سے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسی طرح اسے یحییٰ بن سعید قطان، حاتم بن اسماعیل اور کئی لوگوں نے بطریق: «هشام بن عروة عن أبيه عن حجاج بن حجاج عن أبيه عن النبي صلى الله عليه وسلم» روایت کی ہے۔ اور سفیان بن عیینہ نے بطریق: «هشام بن عروة عن أبيه عن حجاج بن أبي حجاج عن أبيه عن النبي صلى الله عليه وسلم» روایت کی ہے اور ابن عیینہ کی حدیث غیر محفوظ ہے۔ صحیح وہی ہے جسے ان لوگوں نے ہشام بن عروۃ سے اور انہوں نے اپنے والد سے روایت کی ہے۔ ( یعنی: «حجاج بن حجاج» والی نہ کہ «حجاج بن أبي حجاج» والی ) ۳- اور «مايذهب عني مذمة الرضاعة» سے مراد رضاعت کا حق اور اس کا ذمہ ہے۔ وہ کہتے ہیں: جب تم دودھ پلانے والی کو ایک غلام دے دو، یا ایک لونڈی تو تم نے اس کا حق ادا کر دیا، ۴- ابوالطفیل رضی الله عنہ سے روایت کی گئی ہے، وہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ بیٹھا ہوا تھا۔ اتنے میں ایک عورت آئی تو نبی اکرم صلی اللہ علیہ وسلم نے اپنی چادر بچھا دی، یہاں تک کہ وہ اس پر بیٹھ گئی، جب وہ چلی گئی تو کہا گیا: یہی وہ عورت تھی جس نے نبی اکرم صلی اللہ علیہ وسلم کو دودھ پلایا تھا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1154,
			"arabicnumber": 1154,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ بریرہ کے شوہر غلام تھے، رسول اللہ صلی اللہ علیہ وسلم نے بریرہ کو اختیار دیا، تو انہوں نے خود کو اختیار کیا، ( عروہ کہتے ہیں ) اگر بریرہ کے شوہر آزاد ہوتے تو آپ بریرہ کو اختیار نہ دیتے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1155,
			"arabicnumber": 1155,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ بریرہ کے شوہر آزاد تھے، پھر بھی رسول اللہ صلی اللہ علیہ وسلم نے انہیں اختیار دیا۔ امام ترمذی کہتے ہیں: ۱- عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اسی طرح ہشام نے اپنے والد عروہ سے اور عروہ نے عائشہ رضی الله عنہا سے روایت کی ہے، وہ کہتی ہیں کہ بریرہ کا شوہر غلام تھا، ۳- عکرمہ سے روایت ہے کہ ابن عباس رضی الله عنہما کہتے ہیں: میں نے بریرہ کے شوہر کو دیکھا ہے، وہ غلام تھے اور انہیں مغیث کہا جاتا تھا، ۴- اسی طرح کی ابن عمر رضی الله عنہما سے روایت کی گئی ہے، ۵- بعض اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں کہ جب لونڈی آزاد مرد کے نکاح میں ہو اور وہ آزاد کر دی جائے تو اسے اختیار نہیں ہو گا۔ اسے اختیار صرف اس صورت میں ہو گا، جب وہ آزاد کی جائے اور وہ کسی غلام کی زوجیت میں ہو۔ یہی شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۶- لیکن اعمش نے بطریق: «إبراهيم عن الأسود عن عائشة» روایت کی ہے کہ بریرہ کے شوہر آزاد تھے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں اختیار دیا۔ اور ابو عوانہ نے بھی اس حدیث کو بطریق: «الأعمش عن إبراهيم عن الأسود عن عائشة» بریرہ کے قصہ کے سلسلہ میں روایت کیا ہے، اسود کہتے ہیں: بریرہ کے شوہر آزاد تھے، ۷- تابعین اور ان کے بعد کے لوگوں میں سے بعض اہل علم کا اسی پر عمل ہے۔ اور یہی سفیان ثوری اور اہل کوفہ کا بھی قول ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1156,
			"arabicnumber": 1156,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ بریرہ کے شوہر بنی مغیرہ کے ایک کالے کلوٹے غلام تھے، جس دن بریرہ آزاد کی گئیں، اللہ کی قسم، گویا میں انہیں مدینے کے گلی کوچوں اور کناروں میں اپنے سامنے دیکھ رہا ہوں کہ ان کے آنسو ان کی داڑھی پر بہہ رہے ہیں، وہ انہیں منا رہے ہیں کہ وہ انہیں ساتھ میں رہنے کے لیے چن لیں لیکن انہوں نے ایسا نہیں کیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1157,
			"arabicnumber": 1157,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بچہ صاحب فراش ( یعنی شوہر یا مالک ) کا ہو گا ۱؎ اور زانی کے لیے پتھر ہوں گے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر، عثمان، عائشہ، ابوامامہ، عمرو بن خارجہ، عبداللہ بن عمر، براء بن عازب اور زید بن ارقم رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام میں سے اہل علم کا اسی پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1158,
			"arabicnumber": 1158,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک عورت کو دیکھا تو آپ زینب رضی الله عنہا کے پاس تشریف لائے اور آپ نے اپنی ضرورت پوری کی اور باہر تشریف لا کر فرمایا: ”عورت جب سامنے آتی ہے تو وہ شیطان کی شکل میں آتی ہے ۱؎، لہٰذا جب تم میں سے کوئی کسی عورت کو دیکھے اور وہ اسے بھلی لگے تو اپنی بیوی کے پاس آئے اس لیے کہ اس کے پاس بھی اسی جیسی چیز ہے جو اس کے پاس ہے“۔ امام ترمذی کہتے ہیں: ۱- جابر کی حدیث صحیح حسن غریب ہے، ۲- اس باب میں ابن مسعود رضی الله عنہ سے بھی روایت ہے، ۳- ہشام دستوائی دراصل ہشام بن سنبر ہیں۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1159,
			"arabicnumber": 1159,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اگر میں کسی کو کسی کے لیے سجدہ کرنے کا حکم دیتا تو میں عورت کو حکم دیتا کہ وہ اپنے شوہر کو سجدہ کرے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن غریب ہے، ۲- اس باب میں معاذ بن جبل، سراقہ بن مالک بن جعشم، عائشہ، ابن عباس، عبداللہ بن ابی اوفی، طلق بن علی، ام سلمہ، انس اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1160,
			"arabicnumber": 1160,
			"text": "طلق بن علی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب آدمی اپنی بیوی کو اپنی خواہش پوری کرنے کے لیے بلائے تو اسے فوراً آنا چاہیئے اگرچہ وہ تنور پر ہو“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "ام المؤمنین ام سلمہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو عورت مر جائے اور اس کا شوہر اس سے خوش ہو تو وہ جنت میں داخل ہو گی“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایمان میں سب سے کامل مومن وہ ہے جو سب سے بہتر اخلاق والا ہو، اور تم میں سب سے بہتر وہ ہے جو اخلاق میں اپنی عورتوں کے حق میں سب سے بہتر ہو“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی یہ حدیث حسن صحیح ہے، ۲- اس باب میں عائشہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "سلیمان بن عمرو بن احوص کہتے ہیں کہ مجھ سے میرے والد نے بیان کیا کہ وہ حجۃ الوداع میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شریک ہوئے۔ آپ نے اللہ کی حمد و ثنا بیان کی۔ اور ( لوگوں کو ) نصیحت کی اور انہیں سمجھایا۔ پھر راوی نے اس حدیث میں ایک قصہ کا ذکر کیا اس میں یہ بھی ہے کہ آپ نے فرمایا: ”سنو! عورتوں کے ساتھ خیر خواہی کرو۔ اس لیے کہ وہ تمہارے پاس قیدی ہیں۔ تم اس ( ہمبستری اور اپنی عصمت اور اپنے مال کی امانت وغیرہ ) کے علاوہ اور کچھ اختیار نہیں رکھتے ( اور جب وہ اپنا فرض ادا کرتی ہوں تو پھر ان کے ساتھ بدسلوکی کا جواز کیا ہے ) ہاں اگر وہ کسی کھلی ہوئی بیحیائی کا ارتکاب کریں ( تو پھر تمہیں انہیں سزا دینے کا ہے ) پس اگر وہ ایسا کریں تو انہیں بستروں سے علاحدہ چھوڑ دو اور انہیں مارو لیکن اذیت ناک مار نہ ہو، اس کے بعد اگر وہ تمہاری مطیع ہو جائیں تو پھر انہیں سزا دینے کا کوئی اور بہانہ نہ تلاش کرو، سنو! جس طرح تمہارا تمہاری بیویوں پر حق ہے اسی طرح تم پر تمہاری بیویوں کا بھی حق ہے۔ تمہارا حق تمہاری بیویوں پر یہ ہے کہ وہ تمہارے بستر پر ایسے لوگوں کو نہ روندنے دیں جنہیں تم ناپسند کرتے ہو، اور تمہارے گھر میں ایسے لوگوں کو آنے کی اجازت نہ دیں جنہیں تم اچھا نہیں سمجھتے۔ سنو! اور تم پر ان کا حق یہ ہے کہ تم ان کے لباس اور پہنے میں اچھا سلوک کرو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- «عوان عندكم» کا معنی ہے تمہارے ہاتھوں میں قیدی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "علی بن طلق رضی الله عنہ کہتے ہیں کہ ایک اعرابی نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر کہا: اللہ کے رسول! ہم میں ایک شخص صحرا ( بیابان ) میں ہوتا ہے، اور اس کو ہوا خارج ہو جاتی ہے ( اور وضو ٹوٹ جاتا ہے ) اور پانی کی قلت بھی ہوتی ہے ( تو وہ کیا کرے؟ ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے کسی کی جب ہوا خارج ہو جائے تو چاہیئے کہ وہ وضو کرے، اور عورتوں کی دبر میں صحبت نہ کرو، اللہ تعالیٰ حق بات سے نہیں شرماتا“۔ امام ترمذی کہتے ہیں: ۱- علی بن طلق کی حدیث حسن ہے، ۲- اور میں نے محمد بن اسماعیل بخاری کو کہتے سنا کہ سوائے اس ایک حدیث کے علی بن طلق کی کوئی اور حدیث مجھے نہیں معلوم، جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہو، اور طلق بن علی سحیمی کی روایت سے میں یہ حدیث نہیں جانتا۔ گویا ان کی رائے یہ ہے کہ یہ صحابہ میں سے کوئی اور آدمی ہیں، ۳- اس باب میں عمر، خزیمہ بن ثابت، ابن عباس اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ اس شخص کی طرف ( رحمت کی نظر سے ) نہیں دیکھے گا جو کسی مرد یا کسی عورت کی دبر میں صحبت کرے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "علی بن طلق رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی ہوا خارج کرے تو چاہیئے کہ وضو کرے اور تم عورتوں کی دبر میں صحبت نہ کرو“۔ امام ترمذی کہتے ہیں: علی سے مراد علی بن طلق ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "میمونہ بنت سعد رضی الله عنہا کہ جو نبی اکرم صلی اللہ علیہ وسلم کی خادمہ تھیں، وہ کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اپنے شوہر کے علاوہ غیروں کے سامنے بناؤ سنگار کر کے اترا کر چلنے والی عورت کی مثال قیامت کے دن کی تاریکی کی طرح ہے، اس کے پاس کوئی نور نہیں ہو گا“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کو ہم صرف موسیٰ بن عبیدہ ہی کی روایت سے جانتے ہیں، ۲- موسیٰ بن عبیدہ اپنے حفظ کے تعلق سے ضعیف قرار دیے جاتے ہیں، وہ صدوق ہیں، ان سے شعبہ اور ثوری نے بھی روایت کی ہے۔ ۳- اور بعض نے اسے موسیٰ بن عبیدہ سے روایت کیا ہے، اور اسے مرفوع نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ کو غیرت آتی ہے اور مومن کو بھی غیرت آتی ہے، اللہ کی غیرت اس پر ہے کہ مومن کوئی ایسا کام کرے جسے اللہ نے اس پر حرام کیا ہے“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن غریب ہے، ۲- اور یہ حدیث یحییٰ بن ابی کثیر ( اس طریق سے بھی ) سے مروی ہے «عن أبي سلمة عن عروة عن أسماء بنت أبي بكر عن النبي صلى الله عليه وسلم» یہ دونوں حدیثیں صحیح ہیں، ۳- حجاج صواف ہی حجاج بن ابی عثمان ہیں۔ ابوعثمان کا نام میسرہ ہے اور حجاج کی کنیت ابوصلت ہے۔ یحییٰ بن سعید نے ان کی توثیق کی ہے۔ یحییٰ بن سعید القطان نے حجاج صواف کے بارے میں کہا: وہ ثقہ ذہین اور ہوشیار ہیں، ۴- اس باب میں عائشہ اور عبداللہ بن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی عورت کے لیے جو اللہ اور یوم آخرت پر ایمان رکھتی ہو، حلال نہیں کہ وہ تین دن ۱؎ یا اس سے زائد کا سفر کرے اور اس کے ساتھ اس کا باپ یا اس کا بھائی یا اس کا شوہر یا اس کا بیٹا یا اس کا کوئی محرم نہ ہو“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابوہریرہ، ابن عباس اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- نبی اکرم صلی اللہ علیہ وسلم سے یہ بھی مروی ہے کہ آپ نے فرمایا: ”عورت ایک دن اور ایک رات کی مسافت کا سفر کسی محرم کے بغیر نہ کرے۔ اہل علم کا اسی پر عمل ہے، وہ عورت کے لیے درست نہیں سمجھتے کہ محرم کے بغیر سفر کرے۔ اہل علم کا اس عورت کے بارے میں اختلاف ہے کہ جو حج کی استطاعت رکھتی ہو لیکن اس کا کوئی محرم نہ ہو تو وہ حج کرے یا نہیں؟ بعض اہل علم کہتے ہیں: اس پر حج نہیں ہے، اس لیے کہ محرم بھی اللہ تعالیٰ کے ارشاد «من استطاع إليه سبيلا» میں استطاعت سبیل میں داخل ہے۔ وہ کہتے ہیں کہ جب اس کا کوئی محرم نہ ہو تو وہ استطاعت سبیل نہیں رکھتی۔ یہ سفیان ثوری اور اہل کوفہ کا قول ہے۔ اور بعض اہل علم کہتے ہیں کہ جب راستہ مامون ہو، تو وہ لوگوں کے ساتھ حج میں جا سکتی ہے۔ یہی مالک اور شافعی کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کوئی عورت ایک دن اور ایک رات کی مسافت کا سفر محرم کے بغیر نہ کرے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": 1171,
			"text": "عقبہ بن عامر رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عورتوں کے پاس خلوت ( تنہائی ) میں آنے سے بچو“، اس پر انصار کے ایک شخص نے کہا: اللہ کے رسول! دیور ( شوہر کے بھائی ) کے بارے میں کیا خیال ہے؟ آپ نے فرمایا: ”دیور موت ہے“۔ امام ترمذی کہتے ہیں: ۱- عقبہ بن عامر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر، جابر اور عمرو بن العاص رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- عورتوں کے پاس خلوت ( تنہائی ) میں آنے کی حرمت کا مطلب وہی ہے جو نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے کہ آپ نے فرمایا: ”کوئی شخص کسی عورت کے ساتھ خلوت ( تنہائی ) میں ہوتا ہے تو اس کا تیسرا شیطان ہوتا ہے“، ۴- «حمو» شوہر کے بھائی یعنی دیور کو کہتے ہیں، گویا آپ نے دیور کے بھاوج کے ساتھ تنہائی میں ہونے کو حرام قرار دیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": 1172,
			"text": "جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم لوگ ایسی عورتوں کے گھروں میں داخل نہ ہو، جن کے شوہر گھروں پر نہ ہوں، اس لیے کہ شیطان تم میں سے ہر ایک کے اندر ایسے ہی دوڑتا ہے جیسے خون جسم میں دوڑتا ہے“، ہم نے عرض کیا: آپ کے بھی؟ آپ نے فرمایا: ”ہاں میرے بھی، لیکن اللہ تعالیٰ نے اس کے مقابلے میں میری مدد کی ہے، اس لیے میں ( اس کے شر سے ) محفوظ رہتا ہوں“۔ امام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے۔ بعض لوگوں نے مجالد بن سعید کے حفظ کے تعلق سے کلام کیا ہے، ۲- سفیان بن عیینہ نبی اکرم صلی اللہ علیہ وسلم کے قول «ولكن الله اعانني عليه فاسلم» ”لیکن اللہ نے میری مدد کی ہے اس لیے میں محفوظ رہتا ہوں“ کی تشریح میں کہتے ہیں: اس سے مراد یہ ہے کہ ”میں اس شیطان سے محفوظ رہتا ہوں“، نہ یہ کہ وہ اسلام لے آیا ہے ( کیونکہ ) : شیطان مسلمان نہیں ہوتا، ۳- «ولاتلجوا على المغيبات» میں «مغیبة» سے مراد وہ عورت ہے، جس کا شوہر موجود نہ ہو، «مغيبات»،‏‏‏‏ «مغيبة» کی جمع ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "عبداللہ بن مسعود رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عورت ( سراپا ) پردہ ہے، جب وہ باہر نکلتی ہے تو شیطان اس کو تاکتا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "معاذ بن جبل رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو عورت بھی اپنے شوہر کو دنیا میں تکلیف پہنچاتی ہے تو ( جنت کی ) بڑی آنکھوں والی حوروں میں سے اس کی بیوی کہتی ہے: تو اسے تکلیف نہ دے۔ اللہ تجھے ہلاک کرے، یہ تو ویسے بھی تیرے پاس بس مسافر ہے، قریب ہے کہ یہ تجھے چھوڑ کر ہمارے پاس آ جائے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ہم اسے صرف اسی طریق سے جانتے ہیں، ۲- اسماعیل بن عیاش کی روایتیں جنہیں انہوں نے اہل شام سے روایت کی ہیں بہتر ہے، لیکن اہل حجاز اور اہل عراق سے ان کی روایتیں منکر ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 29
			}
		}
	]
}