{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"14": "The Book on Business"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1205,
			"arabicnumber": 1205,
			"text": "نعمان بن بشیر رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”حلال واضح ہے اور حرام بھی واضح ہے اور اس کے درمیان بہت سی چیزیں شبہ والی ہیں ۱؎ جنہیں بہت سے لوگ نہیں جانتے ہیں کہ یہ حلال کے قبیل سے ہیں یا حرام کے۔ تو جس نے اپنے دین کو پاک کرنے اور اپنی عزت بچانے کے لیے انہیں چھوڑے رکھا تو وہ مامون رہا اور جو ان میں سے کسی میں پڑ گیا یعنی انہیں اختیار کر لیا تو قریب ہے کہ وہ حرام میں مبتلا ہو جائے، جیسے وہ شخص جو سرکاری چراگاہ کے قریب ( اپنا جانور ) چرا رہا ہو، قریب ہے کہ وہ اس میں واقع ہو جائے، جان لو کہ ہر بادشاہ کی ایک چراگاہ ہوتی ہے اور اللہ کی چراگاہ اس کی حرام کردہ چیزیں ہیں“۔ دوسری سند سے مؤلف نے شعبی سے اور انہوں نے نے نعمان بن بشیر رضی الله عنہما سے اسی طرح کی اسی مفہوم کی حدیث روایت کی ہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے، اسے کئی رواۃ نے شعبی سے اور شعبی نے نعمان بن بشیر سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": 1206,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سود لینے والے، سود دینے والے، اس کے دونوں گواہوں اور اس کے لکھنے والے پر لعنت بھیجی ہے ۱؎۔ امام ترمذی کہتے ہیں: ۱- عبداللہ بن مسعود کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر، علی، جابر اور ابوجحیفہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": 1207,
			"text": "انس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے کبیرہ گناہوں ۱؎ سے متعلق فرمایا: ”اللہ کے ساتھ شرک کرنا، والدین کی نافرمانی کرنا، کسی کو ( ناحق ) قتل کرنا اور جھوٹی بات کہنا ( کبائر میں سے ہیں“ ۲؎ ) ۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث حسن صحیح غریب ہے، ۲- اس باب میں ابوبکرہ، ایمن بن خریم اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": 1208,
			"text": "قیس بن ابی غرزہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے، ہم ( اس وقت ) «سماسرہ» ۱؎ ( دلال ) کہلاتے تھے، آپ نے فرمایا: ”اے تاجروں کی جماعت! خرید و فروخت کے وقت شیطان اور گناہ سے سابقہ پڑ ہی جاتا ہے، لہٰذا تم اپنی خرید فروخت کو صدقہ کے ساتھ ملا لیا کرو“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- قیس بن ابی غرزہ کی حدیث حسن صحیح ہے، ۲- اسے منصور نے بسند «الأعمش وحبيب بن أبي ثابت»،‏‏‏‏ اور دیگر کئی لوگوں نے بسند «أبي وائل عن قيس بن أبي غرزة» سے روایت کیا ہے۔ ہم اس کے علاوہ قیس کی کوئی اور حدیث نہیں جانتے جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہو، ۳- مؤلف نے بسند «أبو معاوية عن الأعمش عن شقيق بن سلمة وشقيق هو أبو وائل عن قيس بن أبي غرزة عن النبي صلى الله عليه وسلم» اسی جیسی اسی مفہوم کی حدیث روایت کی ہے، ۴- یہ حدیث صحیح ہے، ۵- اس باب میں براء بن عازب اور رفاعہ سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": 1209,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سچا اور امانت دار تاجر ( قیامت کے دن ) انبیاء، صدیقین اور شہداء کے ساتھ ہو گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ہم اسے بروایت ثوری صرف اسی سند سے جانتے ہیں انہوں نے ابوحمزہ سے روایت کی ہے، ۲- اور ابوحمزہ کا نام عبداللہ بن جابر ہے اور وہ بصرہ کے شیخ ہیں –",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": 1210,
			"text": "رفاعہ رضی الله عنہ سے روایت ہے کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے ہمراہ عید گاہ کی طرف نکلے، آپ نے لوگوں کو خرید و فروخت کرتے دیکھا تو فرمایا: ”اے تاجروں کی جماعت!“ تو لوگ رسول اللہ صلی اللہ علیہ وسلم کی بات سننے لگے اور انہوں نے آپ کی طرف اپنی گردنیں اور نگاہیں اونچی کر لیں، آپ نے فرمایا: ”تاجر لوگ قیامت کے دن گنہگار اٹھائے جائیں گے سوائے اس کے جو اللہ سے ڈرے نیک کام کرے اور سچ بولے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسماعیل بن عبید بن رفاعہ کو اسماعیل بن عبیداللہ بن رفاعہ بھی کہا جاتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": 1211,
			"text": "ابوذر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تین لوگ ایسے ہیں جن کی طرف اللہ تعالیٰ قیامت کے دن نہ ( رحمت کی نظر سے ) نہیں دیکھے گا، نہ انہیں ( گناہوں سے ) پاک کرے گا، اور ان کے لیے درد ناک عذاب ہو گا“، ہم نے پوچھا: اللہ کے رسول! یہ کون لوگ ہیں؟ یہ تو نقصان اور گھاٹے میں رہے، آپ نے فرمایا: ”احسان جتانے والا، اپنے تہبند ( ٹخنے سے نیچے ) لٹکانے والا ۱؎ اور جھوٹی قسم کے ذریعہ اپنے سامان کو رواج دینے والا“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابوذر کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن مسعود، ابوہریرہ، ابوامامہ بن ثعلبہ، عمران بن حصین اور معقل بن یسار رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": 1212,
			"text": "صخر غامدی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اے اللہ! میری امت کو اس کے دن کے ابتدائی حصہ میں برکت دے“ ۱؎ صخر کہتے ہیں کہ آپ جب کسی سریہ یا لشکر کو روانہ کرتے تو اسے دن کے ابتدائی حصہ میں روانہ کرتے۔ اور صخر ایک تاجر آدمی تھے۔ جب وہ تجارت کا سامان لے کر ( اپنے آدمیوں کو ) روانہ کرتے تو انہیں دن کے ابتدائی حصہ میں روانہ کرتے۔ تو وہ مالدار ہو گئے اور ان کی دولت بڑھ گئی۔ امام ترمذی کہتے ہیں: ۱- صخر غامدی کی حدیث حسن ہے۔ ہم اس حدیث کے علاوہ صخر غامدی کی کوئی اور حدیث نہیں جانتے جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہو، ۲- اس باب میں علی، ابن مسعود، بریدہ، انس، ابن عمر، ابن عباس، اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": 1213,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے جسم مبارک پر دو موٹے قطری کپڑے تھے، جب آپ بیٹھتے اور پسینہ آتا تو وہ آپ پر بوجھل ہو جاتے، شام سے فلاں یہودی کے کپڑے آئے۔ تو میں نے عرض کیا: کاش! آپ اس کے پاس کسی کو بھیجتے اور اس سے دو کپڑے اس وعدے پر خرید لیتے کہ جب گنجائش ہو گی تو قیمت دے دیں گے، آپ نے اس کے پاس ایک آدمی بھیجا، تو اس نے کہا: جو وہ چاہتے ہیں مجھے معلوم ہے، ان کا ارادہ ہے کہ میرا مال یا میرے دراہم ہڑپ کر لیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”وہ جھوٹا ہے، اسے خوب معلوم ہے کہ میں لوگوں میں اللہ سے سب سے زیادہ ڈرنے والا اور امانت کو سب سے زیادہ ادا کرنے والا ہوں“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عائشہ رضی الله عنہا کی حدیث حسن غریب صحیح ہے، ۲- اسے شعبہ نے بھی عمارہ بن ابی حفصہ سے روایت کیا ہے، ۳- ابوداؤد طیالسی کہتے ہیں: ایک دن شعبہ سے اس حدیث کے بارے میں پوچھا گیا تو انہوں نے کہا: میں تم سے اس وقت اسے نہیں بیان کر سکتا جب تک کہ تم کھڑے ہو کر حرمی بن عمارہ بن ابی حفصہ ( جو اس حدیث کے ایک راوی ہیں ) کا سر نہیں چومتے اور حرمی ( وہاں ) لوگوں میں موجود تھے، انہوں نے اس حدیث سے حد درجہ خوش ہوتے ہوئے یہ بات کہی، ۴- اس باب میں ابن عباس، انس اور اسماء بنت یزید رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": 1214,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی زرہ بیس صاع غلے کے عوض گروی رکھی ہوئی تھی۔ آپ نے اسے اپنے گھر والوں کے لیے لیا تھا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": 1215,
			"text": "انس رضی الله عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس جو کی روٹی اور پگھلی ہوئی چربی جس میں کچھ تبدیلی آ چکی تھی لے کر چلا، آپ کی زرہ ایک یہودی کے پاس بیس صاع غلے کے عوض جسے آپ نے اپنے گھر والوں کے لیے لے رکھا تھا گروی رکھی ہوئی تھی ۱؎ قتادہ کہتے ہیں میں نے ایک دن انس رضی الله عنہ کو کہتے ہوئے سنا کہ محمد صلی اللہ علیہ وسلم کے گھر والوں کے پاس ایک صاع کھجور یا ایک صاع غلہ شام کو نہیں ہوتا تھا جب کہ اس وقت آپ کے پاس نو بیویاں تھیں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": 1216,
			"text": "عبدالمجید بن وہب کہتے ہیں کہ مجھ سے عداء بن خالد بن ھوذہ نے کہا: کیا میں تمہیں ایک تحریر نہ پڑھاؤں جو رسول اللہ صلی اللہ علیہ وسلم نے میرے لیے لکھی تھی؟ میں نے کہا: کیوں نہیں، ضرور پڑھائیے، پھر انہوں نے ایک تحریر نکالی، ( جس میں لکھا تھا ) ”یہ بیع نامہ ہے ایک ایسی چیز کا جو عداء بن خالد بن ھوذہ نے محمد صلی اللہ علیہ وسلم سے خریدی ہے“، انہوں نے آپ سے غلام یا لونڈی کی خریداری اس شرط کے ساتھ کی کہ اس میں نہ کوئی بیماری ہو، نہ وہ بھگیوڑو ہو اور نہ حرام مال کا ہو، یہ مسلمان کی مسلمان سے بیع ہے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے، ہم اسے صرف عباد بن لیث کی روایت سے جانتے ہیں۔ ان سے یہ حدیث محدثین میں سے کئی لوگوں نے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": 1217,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ناپ تول والوں سے فرمایا: ”تمہارے دو ایسے کام ۱؎ کیے گئے ہیں جس میں تم سے پہلے کی امتیں ہلاک ہو گئیں“ ۲؎۔ امام ترمذی کہتے ہیں: ہم اس حدیث کو صرف بروایت حسین بن قیس مرفوع جانتے ہیں، اور حسین بن قیس حدیث میں ضعیف گردانے جاتے ہیں۔ نیز یہ صحیح سند سے ابن عباس سے موقوفاً مروی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک ٹاٹ جو کجاوہ کے نیچے بچھایا جاتا ہے اور ایک پیالہ بیچا، آپ نے فرمایا: ”یہ ٹاٹ اور پیالہ کون خریدے گا؟ ایک آدمی نے عرض کیا: میں انہیں ایک درہم میں لے سکتا ہوں“، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ایک درہم سے زیادہ کون دے گا؟“ تو ایک آدمی نے آپ کو دو درہم دیا، تو آپ نے اسی کے ہاتھ سے یہ دونوں چیزیں بیچ دیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے۔ ہم اسے صرف اخضر بن عجلان کی روایت سے جانتے ہیں، ۲- اور عبداللہ حنفی ہی جنہوں نے انس سے روایت کی ہے ابوبکر حنفی ہیں ۱؎، ۳- بعض اہل علم کا اسی پر عمل ہے۔ یہ لوگ غنیمت اور میراث کے سامان کو زیادہ قیمت دینے والے سے بیچنے میں کوئی حرج نہیں سمجھتے ہیں، ۴- یہ حدیث معتمر بن سلیمان اور دوسرے کئی بڑے لوگوں نے بھی اخضر بن عجلان سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": 1219,
			"text": "جابر رضی الله عنہ سے روایت ہے کہ انصار کے ایک شخص نے ۱؎ اپنے غلام کو مدبر ۲؎ بنا دیا ( یعنی اس سے یہ کہہ دیا کہ تم میرے مرنے کے بعد آزاد ہو ) ، پھر وہ مر گیا، اور اس غلام کے علاوہ اس نے کوئی اور مال نہیں چھوڑا۔ تو نبی اکرم صلی اللہ علیہ وسلم نے اسے بیچ دیا ۳؎ اور نعیم بن عبداللہ بن نحام نے اسے خریدا۔ جابر کہتے ہیں: وہ ایک قبطی غلام تھا۔ عبداللہ بن زبیر رضی الله عنہما کی امارت کے پہلے سال وہ فوت ہوا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ جابر بن عبداللہ سے اور بھی سندوں سے مروی ہے۔ ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ یہ لوگ مدبر غلام کو بیچنے میں کوئی حرج نہیں سمجھتے ہیں۔ یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۴- اور صحابہ کرام وغیرہم میں سے بعض اہل علم نے مدبر کی بیع کو مکروہ جانا ہے۔ یہ سفیان ثوری، مالک اور اوزاعی کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1220,
			"arabicnumber": 1220,
			"text": "عبداللہ بن مسعود رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے مال بیچنے والوں سے بازار میں پہنچنے سے پہلے جا کر ملنے سے منع فرمایا ہے۔ امام ترمذی کہتے ہیں: اس باب میں علی، ابن عباس، ابوہریرہ، ابو سعید خدری، ابن عمر، اور ایک اور صحابی رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1221,
			"arabicnumber": 1221,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے باہر سے آنے والے سامانوں کو بازار میں پہنچنے سے پہلے آگے جا کر خرید لینے سے منع فرمایا: اگر کسی آدمی نے مل کر خرید لیا تو صاحب مال کو جب وہ بازار میں پہنچے تو اختیار ہے ( چاہے تو وہ بیچے چاہے تو نہ بیچے ) ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث ایوب کی روایت سے حسن غریب ہے، ۲- ابن مسعود کی حدیث حسن صحیح ہے۔ اہل علم کی ایک جماعت نے مال بیچنے والوں سے بازار میں پہنچنے سے پہلے مل کر مال خریدنے کو ناجائز کہا ہے یہ دھوکے کی ایک قسم ہے ہمارے اصحاب میں سے شافعی وغیرہ کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1222,
			"arabicnumber": 1222,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”شہری باہر سے آنے والے دیہاتی کا مال نہ بیچے ۱؎ ( بلکہ دیہاتی کو خود بیچنے دے“ ) ۔ امام ترمذی کہتے ہیں: اس باب میں طلحہ، جابر، انس، ابن عباس، ابویزید کثیر بن عبداللہ کے دادا عمرو بن عوف مزنی اور ایک اور صحابی رضی الله عنہ سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": 1223,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کوئی شہری کسی گاؤں والے کا سامان نہ فروخت کرے، تم لوگوں کو ( ان کا سامان خود بیچنے کے لیے ) چھوڑ دو۔ اللہ تعالیٰ بعض کو بعض کے ذریعے رزق دیتا ہے“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن صحیح ہے۔ ۲- اس باب میں جابر کی حدیث بھی حسن صحیح ہے۔ ۳- صحابہ کرام میں سے بعض اہل علم کا اسی حدیث پر عمل ہے۔ ان لوگوں نے مکروہ سمجھا ہے کہ شہری باہر سے آنے والے دیہاتی کا سامان بیچے، ۴- اور بعض لوگوں نے رخصت دی ہے کہ شہری دیہاتی کے لیے سامان خرید سکتا ہے۔ ۵- شافعی کہتے ہیں کہ شہری کا دیہاتی کے سامان کو بیچنا مکروہ ہے اور اگر وہ بیچ دے تو بیع جائز ہو گی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1224,
			"arabicnumber": 1224,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے محاقلہ اور مزابنہ سے منع فرمایا ہے۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر، ابن عباس، زید بن ثابت، سعد، جابر، رافع بن خدیج اور ابوسعید رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بالیوں میں کھڑی کھیتی کو گیہوں سے بیچنے کو محاقلہ کہتے ہیں، اور درخت پر لگے ہوئی کھجور توڑی گئی کھجور سے بیچنے کو مزابنہ کہتے ہیں، ۴- اکثر اہل علم کا اسی پر عمل ہے۔ یہ لوگ محاقلہ اور مزابنہ کو مکروہ سمجھتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1225,
			"arabicnumber": 1225,
			"text": "عبداللہ بن یزید سے روایت ہے کہ ابوعیاش زید نے سعد رضی الله عنہ سے گیہوں کو چھلکا اتارے ہوئے جو سے بیچنے کے بارے میں پوچھا تو انہوں نے پوچھا: ان دونوں میں کون افضل ہے؟ انہوں نے کہا: گیہوں، تو انہوں نے اس سے منع فرمایا۔ اور سعد رضی الله عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ سے تر کھجور سے خشک کھجور خریدنے کا مسئلہ پوچھا جا رہا تھا۔ تو آپ نے قریب بیٹھے لوگوں سے پوچھا: ”کیا تر کھجور خشک ہونے پر کم ہو جائے گا؟ ۱؎“ لوگوں نے کہا ہاں ( کم ہو جائے گا ) ، تو آپ نے اس سے منع فرمایا۔ مؤلف نے بسند «وكيع عن مالك» اسی طرح کی حدیث بیان کی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اسی پر عمل ہے، اور یہی شافعی اور ہمارے اصحاب کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1226,
			"arabicnumber": 1226,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ رسول اللہ نے کھجور کے درخت کی بیع سے منع فرمایا ہے یہاں تک کہ وہ خوش رنگ ہو جائے ( پختگی کو پہنچ جائے ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1227,
			"arabicnumber": 1227,
			"text": "اسی سند سے مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ( گیہوں اور جو وغیرہ کے ) خوشے بیچنے سے منع فرمایا یہاں تک کہ وہ پختہ ہو جائیں اور آفت سے مامون ہو جائیں، آپ نے بائع اور مشتری دونوں کو منع فرمایا ہے۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں انس، عائشہ، ابوہریرہ، ابن عباس، جابر، ابو سعید خدری اور زید بن ثابت رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام میں سے اہل علم کا اسی پر عمل ہے۔ یہ لوگ پھل کی پختگی ظاہر ہونے سے پہلے اس کے بیچنے کو مکروہ سمجھتے ہیں، یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1228,
			"arabicnumber": 1228,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے انگور کو بیچنے سے منع فرمایا ہے یہاں تک کہ وہ سیاہ ( پختہ ) ہو جائے۔ اور دانے ( غلے ) کو بیچنے سے منع فرمایا ہے یہاں تک کہ وہ سخت ہو جائے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔ ہم اسے صرف بروایت حماد بن سلمہ ہی مرفوع جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1229,
			"arabicnumber": 1229,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے حمل کے حمل کو بیچنے سے منع فرمایا ۱؎۔ امام ترمذی کہتے: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- شعبہ نے اس حدیث کو بطریق: «عن أيوب عن سعيد بن جبير عن ابن عباس» روایت کیا ہے۔ اور عبدالوھاب ثقفی وغیرہ نے بطریق: «عن أيوب عن سعيد بن جبير ونافع عن ابن عمر عن النبي صلى الله عليه وسلم» روایت کی ہے۔ اور یہ زیادہ صحیح ہے، ۳- اہل علم کا اسی پر عمل ہے۔ «حبل الحبلة» ( حمل کے حمل ) سے مراد اونٹنی کے بچے کا بچہ ہے۔ اہل علم کے نزدیک یہ بیع منسوخ ہے اور یہ دھوکہ کی بیع میں سے ایک بیع ہے، ۴- اس باب میں عبداللہ بن عباس اور ابو سعید خدری رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1230,
			"arabicnumber": 1230,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بیع غرر ۱؎ اور بیع حصاۃ سے منع فرمایا ہے۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر، ابن عباس، ابوسعید اور انس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی حدیث پر عمل ہے، وہ بیع غرر کو مکروہ سمجھتے ہیں، ۴- شافعی کہتے ہیں: مچھلی کی بیع جو پانی میں ہو، بھاگے ہوئے غلام کی بیع، آسمان میں اڑتے پرندوں کی بیع اور اسی طرح کی دوسری بیع، بیع غرر کی قبیل سے ہیں، ۵- اور بیع حصاۃ سے مراد یہ ہے کہ بیچنے والا خریدنے والے سے یہ کہے کہ جب میں تیری طرف کنکری پھینک دوں تو میرے اور تیرے درمیان میں بیع واجب ہو گئی۔ یہ بیع منابذہ کے مشابہ ہے۔ اور یہ جاہلیت کی بیع کی قسموں میں سے ایک قسم تھی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1231,
			"arabicnumber": 1231,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک بیع میں دو بیع کرنے سے منع فرمایا ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو، ابن عمر اور ابن مسعود رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے، ۴- بعض اہل علم نے ایک بیع میں دو بیع کی تفسیر یوں کی ہے کہ ایک بیع میں دو بیع یہ ہے کہ مثلاً کہے: میں تمہیں یہ کپڑا نقد دس روپے میں اور ادھار بیس روپے میں بیچتا ہوں اور مشتری دونوں بیعوں میں سے کسی ایک پر جدا نہ ہو، ( بلکہ بغیر کسی ایک کی تعیین کے مبہم بیع ہی پر وہاں سے چلا جائے ) جب وہ ان دونوں میں سے کسی ایک پر جدا ہو تو کوئی حرج نہیں بشرطیکہ ان دونوں میں سے کسی ایک پر بیع منعقد ہو گئی ہو، ۵- شافعی کہتے ہیں: ایک بیع میں دو بیع کا مفہوم یہ ہے کہ کوئی کہے: میں اپنا یہ گھر اتنے روپے میں اس شرط پر بیچ رہا ہوں کہ تم اپنا غلام مجھ سے اتنے روپے میں بیچ دو۔ جب تیرا غلام میرے لیے واجب و ثابت ہو جائے گا تو میرا گھر تیرے لیے واجب و ثابت ہو جائے گا، یہ بیع بغیر ثمن معلوم کے واقع ہوئی ہے ۲؎ اور بائع اور مشتری میں سے کوئی نہیں جانتا کہ اس کا سودا کس چیز پر واقع ہوا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1232,
			"arabicnumber": 1232,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر عرض کیا: میرے پاس کچھ لوگ آتے ہیں اور اس چیز کو بیچنے کے لیے کہتے ہیں جو میرے پاس نہیں ہوتی، تو کیا میں اس چیز کو ان کے لیے بازار سے خرید کر لاؤں پھر فروخت کروں؟ آپ نے فرمایا: ”جو چیز تمہارے پاس نہیں ہے اس کی بیع نہ کرو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے- حکم ۱۲۳۴ میں آ رہا ہے، ۲- اس باب میں عبداللہ بن عمر رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے اس چیز کے بیچنے سے منع فرمایا جو میرے پاس نہ ہو۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اسحاق بن منصور کہتے ہیں: میں نے احمد بن حنبل سے پوچھا: بیع کے ساتھ قرض سے منع فرمانے کا کیا مفہوم ہے؟ انہوں نے کہا: اس کی صورت یہ ہے کہ آدمی کو قرض دے پھر اس سے بیع کرے اور سامان کی قیمت زیادہ لے اور یہ بھی احتمال ہے کہ کوئی کسی سے کسی چیز میں سلف کرے اور کہے: اگر تیرے پاس روپیہ فراہم نہیں ہو سکا تو تجھے یہ سامان میرے ہاتھ بیچ دینا ہو گا۔ اسحاق ( ابن راھویہ ) نے بھی وہی بات کہی ہے جو احمد نے کہی ہے، ۳- اسحاق بن منصور نے کہا: میں نے احمد سے ایسی چیز کی بیع کے بارے میں پوچھا جس کا بائع ضامن نہیں تو انہوں نے جواب دیا، ( یہ ممانعت ) میرے نزدیک صرف طعام کی بیع کے ساتھ ہے جب تک قبضہ نہ ہو یعنی ضمان سے قبضہ مراد ہے، اسحاق بن راہویہ نے بھی وہی بات کہی ہے جو احمد نے کہی ہے لیکن یہ ممانعت ہر اس چیز میں ہے جو ناپی یا تولی جاتی ہو۔ احمد بن حنبل کہتے ہیں: جب بائع یہ کہے: میں آپ سے یہ کپڑا اس شرط کے ساتھ بیچ رہا ہوں کہ اس کی سلائی اور دھلائی میرے ذمہ ہے۔ تو بیع کی یہ شکل ایک بیع میں دو شرط کے قبیل سے ہے۔ اور جب بائع یہ کہے: میں یہ کپڑا آپ کو اس شرط کے ساتھ بیچ رہا ہوں کہ اس کی سلائی میرے ذمہ ہے۔ یا بائع یہ کہے: میں یہ کپڑا آپ کو اس شرط کے ساتھ بیچ رہا ہوں کہ اس کی دھلائی میرے ذمہ ہے، تو اس بیع میں کوئی مضائقہ نہیں ہے، یہ ایک ہی شرط ہے۔ اسحاق بن راہویہ نے بھی وہی بات کہی ہے جو احمد نے کہی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بیع کے ساتھ قرض جائز نہیں ہے ۱؎، اور نہ ایک بیع میں دو شرطیں جائز ہیں ۲؎ اور نہ ایسی چیز سے فائدہ اٹھانا جائز ہے جس کا وہ ضامن نہ ہو ۳؎ اور نہ ایسی چیز کی بیع جائز ہے جو تمہارے پاس نہ ہو۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- حکیم بن حزام کی حدیث حسن ہے ( ۱۲۳۲، ۱۲۳۳ ) ، یہ ان سے اور بھی سندوں سے مروی ہے۔ اور ایوب سختیانی اور ابوبشر نے اسے یوسف بن ماہک سے اور یوسف نے حکیم بن حزام سے روایت کیا ہے۔ اور عوف اور ہشام بن حسان نے اس حدیث کو ابن سیرین سے اور ابن سیرین نے حکیم بن حزام سے اور حکیم بن حزام نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے اور یہ حدیث ( روایت ) مرسل ( منقطع ) ہے۔ اسے ( اصلاً ) ابن سیرین نے ایوب سختیانی سے اور ایوب نے یوسف بن ماہک سے اور یوسف بن ماہک نے حکیم بن حزام سے اسی طرح روایت کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1235,
			"arabicnumber": 1235,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے اس چیز کے بیچنے سے منع فرمایا ہے جو میرے پاس نہیں ہے۔ امام ترمذی کہتے ہیں: ۱- وکیع نے اس حدیث کو بطریق: «عن يزيد بن إبراهيم عن ابن سيرين عن أيوب عن حكيم بن حزام» روایت کیا ہے اور اس میں یوسف بن ماہک کے واسطے کا ذکر نہیں کیا ہے۔ عبدالصمد کی روایت زیادہ صحیح ہے ( جس میں ابن سیرین کا ذکر ہے ) ۔ اور یحییٰ بن ابی کثیر نے یہ حدیث بطریق: «عن يعلى بن حكيم عن يوسف بن ماهك عن عبد الله بن عصمة عن حكيم بن حزام عن النبي صلى الله عليه وسلم» روایت کیا ہے، ۲- اکثر اہل علم کا اسی حدیث پر عمل ہے، یہ لوگ اس چیز کی بیع کو مکروہ سمجھتے ہیں جو آدمی کے پاس نہ ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1236,
			"arabicnumber": 1236,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ولاء ۱؎ کو بیچنے اور ہبہ کرنے سے منع فرمایا ۲؎۔ امام ترمذی کہتے ہیں: ۱ – یہ حدیث حسن صحیح ہے، ۲- ہم اسے صرف بروایت عبداللہ بن دینار جانتے ہیں جسے انہوں نے ابن عمر سے روایت کی ہے، ۳- یحییٰ بن سلیم نے یہ حدیث بطریق: «عبيد الله بن عمر عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم» روایت کی ہے کہ آپ نے ولاء کو بیچنے اور ہبہ کرنے سے منع فرمایا۔ اس سند میں وہم ہے۔ اس کے اندر یحییٰ بن سلیم سے وہم ہوا ہے، ۴- عبدالوھاب ثقفی، اور عبداللہ بن نمیر اور دیگر کئی لوگوں نے بطریق: «عن عبيد الله بن عمر عن عبد الله بن دينار عن ابن عمر عن النبي صلى الله عليه وسلم» روایت کی ہے اور یہ یحییٰ بن سلیم کی حدیث سے زیادہ صحیح ہے، ۵- اہل علم کا اسی حدیث پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1237,
			"arabicnumber": 1237,
			"text": "سمرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے جانور کو جانور سے ادھار بیچنے سے منع فرمایا ہے۔ امام ترمذی کہتے ہیں: ۱- سمرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- حسن کا سماع سمرہ سے صحیح ہے۔ علی بن مدینی وغیرہ نے ایسا ہی کہا ہے، ۳- اس باب میں ابن عباس، جابر اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- صحابہ کرام وغیرہم میں سے اکثر اہل علم کا جانور کو جانور سے ادھار بیچنے کے مسئلہ میں اسی حدیث پر عمل ہے۔ سفیان ثوری اور اہل کوفہ کا یہی قول ہے۔ احمد بھی اسی کے قائل ہیں، ۵- صحابہ کرام وغیرہم میں سے بعض اہل علم نے جانور کے جانور سے ادھار بیچنے کی اجازت دی ہے۔ اور یہی شافعی، اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": 1238,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”دو جانور کو ایک جانوروں سے ادھار بیچنا درست نہیں ہے، ہاتھوں ہاتھ ( نقد ) بیچنے میں کوئی حرج نہیں ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": 1239,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ ایک غلام آیا اور اس نے نبی اکرم صلی اللہ علیہ وسلم سے ہجرت پر بیعت کی، نبی اکرم صلی اللہ علیہ وسلم نہیں جان سکے کہ یہ غلام ہے۔ اتنے میں اس کا مالک آ گیا وہ اس کا مطالبہ رہا تھا، نبی اکرم صلی اللہ علیہ وسلم نے اس سے کہا: تم اسے مجھ سے بیچ دو، چنانچہ آپ نے اسے دو کالے غلاموں کے عوض خرید لیا، پھر اس کے بعد آپ کسی سے اس وقت تک بیعت نہیں لیتے تھے جب تک کہ اس سے دریافت نہ کر لیتے کہ کیا وہ غلام ہے؟ امام ترمذی کہتے ہیں: ۱- جابر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں انس رضی الله عنہ سے بھی روایت ہے، ۳- اہل علم کا اسی حدیث پر عمل ہے کہ ایک غلام کو دو غلام سے نقدا نقد خریدنے میں کوئی حرج نہیں ہے اور جب ادھار ہو تو اس میں اختلاف ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": 1240,
			"text": "عبادہ بن صامت رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سونے کو سونے سے، چاندی کو چاندی سے، کھجور کو کھجور سے، گیہوں کو گیہوں سے، نمک کو نمک سے اور جو کو جو سے برابر برابر بیچو، جس نے زیادہ دیا یا زیادہ لیا اس نے سود کا معاملہ کیا۔ سونے کو چاندی سے نقداً نقد، جیسے چاہو بیچو، گیہوں کو کھجور سے نقداً نقد جیسے چاہو بیچو، اور جو کو کھجور سے نقداً نقد جیسے چاہو بیچو“۔ امام ترمذی کہتے ہیں: ۱- عبادہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- بعض لوگوں نے اس حدیث کو خالد سے اسی سند سے روایت کیا ہے اس میں یہ ہے کہ گیہوں کو جو سے نقدا نقد جیسے چاہو بیچو، ۳- بعض لوگوں نے اس حدیث کو خالد سے اور خالد نے ابوقلابہ سے اور ابوقلابہ نے ابوالاشعث سے اور ابوالاشعث نے عبادہ سے اور عبادہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے اور اس میں یہ اضافہ کیا ہے: خالد کہتے ہیں: ابوقلابہ نے کہا: گیہوں کو جو سے جیسے سے چاہو بیچو۔ پھر انہوں نے پوری حدیث ذکر کی، ۴- اس باب میں ابوسعید، ابوہریرہ، بلال اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔ ۵- اہل علم کا اسی پر عمل ہے، وہ لوگ گیہوں کو گیہوں سے اور جو کو جو سے صرف برابر برابر ہی بیچنے کو جائز سمجھتے ہیں اور جب اجناس مختلف ہو جائیں تو کمی، بیشی کے ساتھ بیچنے میں کوئی حرج نہیں بشرطیکہ بیع نقداً نقد ہو۔ صحابہ کرام وغیرہم میں سے اہل علم کا یہی قول ہے۔ سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے۔ شافعی کہتے ہیں: اس کی دلیل نبی اکرم صلی اللہ علیہ وسلم کا یہ فرمان ہے کہ جو کو گیہوں سے نقدا نقد جیسے چاہو بیچو، ۶- اہل علم کی ایک جماعت نے جو سے بھی گیہوں کے بیچنے کو مکروہ سمجھا ہے، الا یہ کہ وزن میں مساوی ہوں، پہلا قول ہی زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1241,
			"arabicnumber": 1241,
			"text": "نافع کہتے ہیں کہ میں اور ابن عمر دونوں ابو سعید خدری رضی الله عنہم کے پاس آئے تو انہوں نے ہم سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( اسے میرے دونوں کانوں نے آپ سے سنا ) : ”سونے کو سونے سے برابر برابر ہی بیچو اور چاندی کو چاندی سے برابر برابر ہی بیچو۔ ایک کو دوسرے سے کم و بیش نہ کیا جائے اور غیر موجود کو موجود سے نہ بیچو“۔ امام ترمذی کہتے ہیں: ۱- رباء کے سلسلہ میں ابو سعید خدری رضی الله عنہ کی حدیث جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے حسن صحیح ہے، ۲- اس باب میں ابوبکر، عمر، عثمان، ابوہریرہ، ہشام بن عامر، براء، زید بن ارقم، فضالہ بن عبید، ابوبکرہ، ابن عمر، ابودرداء اور بلال رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے، ۴- مگر وہ جو ابن عباس رضی الله عنہما سے مروی ہے کہ وہ سونے کو سونے سے اور چاندی کو چاندی سے کمی بیشی کے ساتھ بیچنے میں کوئی مضائقہ نہیں سمجھتے تھے، جب کہ بیع نقدا نقد ہو، اور وہ یہ بھی کہتے تھے کہ سود تو ادھار بیچنے میں ہے اور ایسا ہی کچھ ان کے بعض اصحاب سے بھی مروی ہے، ۵- اور ابن عباس سے یہ بھی مروی ہے کہ ابو سعید خدری نے جب ان سے نبی اکرم صلی اللہ علیہ وسلم کی حدیث بیان کی تو انہوں نے اپنے قول سے رجوع کر لیا، پہلا قول زیادہ صحیح ہے۔ اہل علم کا اسی پر عمل ہے۔ اور یہی سفیان ثوری، ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، اور ابن مبارک کہتے ہیں: صرف ۱؎ میں اختلاف نہیں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": 1242,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ میں بقیع کے بازار میں اونٹ بیچا کرتا تھا، میں دیناروں سے بیچتا تھا، اس کے بدلے چاندی لیتا تھا، اور چاندی سے بیچتا تھا اور اس کے بدلے دینار لیتا تھا، میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور میں نے آپ کو دیکھا کہ آپ حفصہ رضی الله عنہا کے گھر سے نکل رہے ہیں تو میں نے آپ سے اس کے بارے میں پوچھا آپ نے فرمایا: ”قیمت کے ساتھ ایسا کرنے میں کوئی مضائقہ نہیں ہے“۔ امام ترمذی کہتے ہیں: ۱- ہم اس حدیث کو صرف سماک بن حرب ہی کی روایت سے مرفوع جانتے ہیں، ۲- سماک نے اسے سعید بن جبیر سے اور سعید نے ابن عمر سے روایت کی ہے اور داود بن ابی ھند نے یہ حدیث سعید بن جبیر سے اور سعید نے ابن عمر سے موقوفاً روایت کی ہے، ۳- بعض اہل علم کا عمل اسی حدیث پر ہے کہ اگر کوئی سونا کے بدلے چاندی لے یا چاندی کے بدلے سونا لے، تو کوئی حرج نہیں ہے۔ یہی احمد اور اسحاق کا بھی قول ہے، ۴- اور صحابہ کرام وغیرہم میں سے بعض اہل علم نے اسے مکروہ جانا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": 1243,
			"text": "مالک بن اوس بن حدثان رضی الله عنہ کہتے ہیں کہ میں ( بازار میں ) یہ کہتے ہوئے آیا: درہموں کو ( دینار وغیرہ سے ) کون بدلے گا؟ تو طلحہ بن عبیداللہ رضی الله عنہ نے کہا اور وہ عمر بن خطاب رضی الله عنہ کے پاس تھے: ہمیں اپنا سونا دکھاؤ، اور جب ہمارا خادم آ جائے تو ہمارے پاس آ جاؤ ہم ( اس کے بدلے ) تمہیں چاندی دے دیں گے۔ ( یہ سن کر ) عمر رضی الله عنہ نے کہا: اللہ کی قسم! ایسا ہرگز نہیں ہو سکتا تم اسے چاندی ہی دو ورنہ اس کا سونا ہی لوٹا دو، اس لیے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ”سونے کے بدلے چاندی لینا سود ہے، الا یہ کہ ایک ہاتھ سے دو، دوسرے ہاتھ سے لو ۱؎، گیہوں کے بدلے گیہوں لینا سود ہے، الا یہ کہ ایک ہاتھ سے دو، دوسرے ہاتھ سے لو، جو کے بدلے جو لینا سود ہے الا یہ کہ ایک ہاتھ سے دو، دوسرے ہاتھ سے لو، اور کھجور کے بدلے کھجور لینا سود ہے الا یہ کہ ایک ہاتھ سے دو، دوسرے ہاتھ سے لو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اسی پر عمل ہے۔ «إلاھاء وھاء» کا مفہوم ہے نقدا نقد۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”جس نے «تأبیر» ۱؎ ( پیوند کاری ) کے بعد کھجور کا درخت خریدا تو اس کا پھل بیچنے والے ہی کا ہو گا ۲؎ الا یہ کہ خریدنے والا ( خریدتے وقت پھل کی ) شرط لگا لے۔ اور جس نے کوئی ایسا غلام خریدا جس کے پاس مال ہو تو اس کا مال بیچنے والے ہی کا ہو گا الا یہ کہ خریدنے والا ( خریدتے وقت مال کی ) شرط لگا لے“۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اسی طرح اور بھی طرق سے بسند «عن الزهري عن سالم عن ابن عمر عن النبي صلى الله عليه وسلم» سے روایت ہے آپ نے فرمایا: ”جس نے پیوند کاری کے بعد کھجور کا درخت خریدا تو اس کا پھل بیچنے والے ہی کا ہو گا الا یہ کہ خریدنے والا ( درخت کے ساتھ پھل کی بھی ) شرط لگا لے اور جس نے کوئی ایسا غلام خریدا جس کے پاس مال ہو تو اس کا مال بیچنے والے کا ہو گا الا یہ کہ خریدنے والا ( غلام کے ساتھ مال کی بھی ) شرط لگا لے“، ۳- یہ نافع سے بھی مروی ہے انہوں نے ابن عمر سے اور ابن عمر نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ نے فرمایا: ”جس نے کھجور کا کوئی درخت خریدا جس کی پیوند کاری کی جا چکی ہو تو اس کا پھل بیچنے والے ہی کا ہو گا الا یہ کہ خریدنے والا ( درخت کے ساتھ پھل کی بھی ) شرط لگا لے“، ۴- نافع سے مروی ہے وہ ابن عمر سے روایت کرتے ہیں، وہ کہتے ہیں کہ جس نے کوئی غلام بیچا جس کے پاس مال ہو تو اس کا مال بیچنے والے ہی کا ہو گا الا یہ کہ خریدنے والا ( غلام کے ساتھ مال کی بھی ) شرط لگا لے، ۵- اسی طرح عبیداللہ بن عمر وغیرہ نے نافع سے دونوں حدیثیں روایت کی ہیں، ۶- نیز بعض لوگوں نے یہ حدیث نافع سے، نافع نے ابن عمر سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، ۷- عکرمہ بن خالد نے ابن عمر سے ابن عمر نے نبی اکرم صلی اللہ علیہ وسلم سے سالم کی حدیث کی طرح روایت کی ہے۔ ۸- محمد بن اسماعیل بخاری کہتے ہیں کہ زہری کی حدیث جسے انہوں نے بطریق: «عن سالم عن أبيه عن النبي صلى الله عليه وسلم» روایت کی ہے اس باب میں سب سے زیادہ صحیح ہے، ۹- بعض اہل علم کا اسی حدیث پر عمل ہے۔ اور یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۱۰- اس باب میں جابر رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": 1245,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”بیچنے والا اور خریدنے والا دونوں کو جب تک وہ جدا نہ ہوں بیع کو باقی رکھنے اور فسخ کرنے کا اختیار ہے ۱؎ یا وہ دونوں اختیار کی شرط کر لیں“ ۲؎۔ نافع کہتے ہیں: جب ابن عمر رضی الله عنہما کوئی چیز خریدتے اور بیٹھے ہوتے تو کھڑے ہو جاتے تاکہ بیع واجب ( پکی ) ہو جائے ( اور اختیار باقی نہ رہے ) ۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوبرزہ، حکیم بن حزام، عبداللہ بن عباس، عبداللہ بن عمرو، سمرہ اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ اور یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔ یہ لوگ کہتے ہیں کہ تفرق سے مراد جسمانی جدائی ہے نہ کہ قولی جدائی، یعنی مجلس سے جدائی مراد ہے گفتگو کا موضوع بدلنا مراد نہیں، ۴- اور بعض اہل علم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے قول «مالم يتفرقا» سے مراد قولی جدائی ہے، پہلا قول زیادہ صحیح ہے، اس لیے کہ ابن عمر رضی الله عنہما نے ہی اس کو نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے۔ اور وہ اپنی روایت کردہ حدیث کا معنی زیادہ جانتے ہیں اور ان سے مروی ہے کہ جب وہ بیع واجب ( پکی ) کرنے کا ارادہ کرتے تو ( مجلس سے اٹھ کر ) چل دیتے تاکہ بیع واجب ہو جائے، ۵- ابوبرزہ رضی الله عنہ سے بھی اسی طرح مروی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": 1246,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بائع ( بیچنے والا ) اور مشتری ( خریدار ) جب تک جدا نہ ہوں ۱؎ دونوں کو بیع کے باقی رکھنے اور فسخ کر دینے کا اختیار ہے، اگر وہ دونوں سچ کہیں اور سامان خوبی اور خرابی واضح کر دیں تو ان کی بیع میں برکت دی جائے گی اور اگر ان دونوں نے عیب کو چھپایا اور جھوٹی باتیں کہیں تو ان کی بیع کی برکت ختم کر دی جائے گی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح ہے، ۲- اسی طرح ابوبرزہ اسلمی سے بھی مروی ہے کہ دو آدمی ایک گھوڑے کی بیع کرنے کے بعد اس کا مقدمہ لے کر ان کے پاس آئے، وہ لوگ ایک کشتی میں تھے۔ ابوبرزہ نے کہا: میں نہیں سمجھتا کہ تم دونوں جدا ہوئے ہو اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ”بائع اور مشتری کو جب تک ( مجلس سے ) جدا نہ ہوں اختیار ہے“، ۳- اہل کوفہ وغیرہم میں سے بعض اہل علم اس طرف گئے ہیں کہ جدائی قول سے ہو گی، یہی سفیان ثوری کا قول ہے، اور اسی طرح مالک بن انس سے بھی مروی ہے، ۴- اور ابن مبارک کا کہنا ہے کہ میں اس مسلک کو کیسے رد کر دوں؟ جب کہ نبی اکرم صلی اللہ علیہ وسلم سے وارد حدیث صحیح ہے، ۵- اور انہوں نے اس کو قوی کہا ہے۔ نبی اکرم صلی اللہ علیہ وسلم کے قول «إلا بيع الخيار» کا مطلب یہ ہے کہ بائع مشتری کو بیع کے واجب کرنے کے بعد اختیار دیدے، پھر جب مشتری بیع کو اختیار کر لے تو اس کے بعد اس کو بیع فسخ کرنے کا اختیار نہیں ہو گا، اگرچہ وہ دونوں جدا نہ ہوئے ہوں۔ اسی طرح شافعی وغیرہ نے اس کی تفسیر کی ہے، ۶- اور جو لوگ جسمانی جدائی ( تفرق بالابدان ) کے قائل ہیں ان کے قول کو عبداللہ بن عمرو کی حدیث تقویت دے رہی ہے جسے وہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں ( آگے ہی آ رہی ہے ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": 1247,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بائع اور مشتری جب تک جدا نہ ہوں ان کو اختیار ہے الا یہ کہ بیع خیار ہو ( تب جدا ہونے کے بعد بھی واپسی کا اختیار باقی رہتا ہے ) ، اور بائع کے لیے جائز نہیں ہے کہ اپنے ساتھی ( مشتری ) سے اس ڈر سے جدا ہو جائے کہ وہ بیع کو فسخ کر دے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اور اس کا معنی یہی ہے کہ بیع کے بعد وہ مشتری سے جدا ہو جائے اس ڈر سے کہ وہ اسے فسخ کر دے گا اور اگر جدائی صرف کلام سے ہو جاتی، اور بیع کے بعد مشتری کو اختیار نہ ہوتا تو اس حدیث کا کوئی معنی نہ ہو گا جو کہ آپ نے فرمایا ہے: ”بائع کے لیے جائز نہیں ہے کہ وہ مشتری سے اس ڈر سے جدا ہو جائے کہ وہ اس کی بیع کو فسخ کر دے گا“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": 1248,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بائع اور مشتری بیع ( کی مجلس ) سے رضا مندی کے ساتھ ہی جدا ہوں“۔ امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1249,
			"arabicnumber": 1249,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے بیع کے بعد ایک اعرابی کو اختیار دیا۔ یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "انس رضی الله عنہ کہتے ہیں کہ ایک آدمی خرید و فروخت کرنے میں بودا ۱؎ تھا اور وہ ( اکثر ) خرید و فروخت کرتا تھا، اس کے گھر والے نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے اور ان لوگوں نے عرض کیا: اللہ کے رسول! آپ اس کو ( خرید و فروخت سے ) روک دیجئیے، تو نبی اکرم صلی اللہ علیہ وسلم نے اس کو بلوایا اور اسے اس سے منع فرما دیا۔ اس نے عرض کیا: اللہ کے رسول! میں بیع سے باز رہنے پر صبر نہیں کر سکوں گا، آپ نے فرمایا: ” ( اچھا ) جب تم بیع کرو تو یہ کہہ لیا کرو کہ ایک ہاتھ سے دو اور دوسرے ہاتھ سے لو اور کوئی دھوکہ دھڑی نہیں ۲؎“۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث حسن صحیح غریب ہے، ۲- اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے، ۳- بعض اہل علم کا اسی حدیث پر عمل ہے، وہ کہتے ہیں کہ آزاد شخص کو خرید و فروخت سے اس وقت روکا جا سکتا ہے جب وہ ضعیف العقل ہو، یہی احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۴- اور بعض لوگ آزاد بالغ کو بیع سے روکنے کو درست نہیں سمجھتے ہیں ۳؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کوئی ایسا جانور خریدا جس کا دودھ تھن میں ( کئی دنوں سے ) روک دیا گیا ہو، تو جب وہ اس کا دودھ دو ہے تو اسے اختیار ہے اگر وہ چاہے تو ایک صاع کھجور کے ساتھ اس کو واپس کر دے“ ۱؎۔ امام ترمذی کہتے ہیں: اس باب میں انس اور ایک اور صحابی سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کوئی ایسا جانور خریدا جس کا دودھ تھن میں روک دیا گیا ہو تو اسے تین دن تک اختیار ہے۔ اگر وہ اسے واپس کرے تو اس کے ساتھ ایک صاع کوئی غلہ بھی واپس کرے جو گیہوں نہ ہو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ہمارے اصحاب کا اسی پر عمل ہے۔ ان ہی میں شافعی، احمد اور اسحاق بن راہویہ ہیں۔ آپ کے قول «لا سمراء» کا مطلب «لابُرّ» ہے یعنی گیہوں نہ ہو ( کھانے کی کوئی اور چیز ہو، پچھلی حدیث میں کھجور کا تذکرہ ہے ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ انہوں نے ( راستے میں ) نبی اکرم صلی اللہ علیہ وسلم سے ایک اونٹ بیچا اور اپنے گھر والوں تک سوار ہو کر جانے کی شرط رکھی لگائی ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ اور بھی سندوں سے جابر سے مروی ہے، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ یہ لوگ بیع میں شرط کو جائز سمجھتے ہیں جب شرط ایک ہو۔ یہی قول احمد اور اسحاق بن راہویہ کا ہے، ۴- اور بعض اہل علم کہتے ہیں کہ بیع میں شرط جائز نہیں ہے اور جب اس میں شرط ہو تو بیع تام نہیں ہو گی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سواری کا جانور جب رہن رکھا ہو تو اس پر سواری کی جائے اور دودھ والا جانور جب گروی رکھا ہو تو اس کا دودھ پیا جائے، اور جو سواری کرے اور دودھ پیے جانور کا خرچ اسی کے ذمہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ہم اسے بروایت عامر شعبی ہی مرفوع جانتے ہیں، انہوں نے ابوہریرہ سے روایت کی ہے اور کئی لوگوں نے اس حدیث کو اعمش سے روایت کیا ہے اور اعمش نے ابوصالح سے اور ابوصالح نے ابوہریرہ رضی الله عنہ سے موقوفا روایت کی ہے، ۳- بعض اہل علم کا اسی حدیث پر عمل ہے۔ اور یہی قول احمد اور اسحاق بن راہویہ کا بھی ہے، ۴- بعض اہل علم کہتے ہیں کہ رہن سے کسی طرح کا فائدہ اٹھانا درست نہیں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "فضالہ بن عبید رضی الله عنہ کہتے ہیں کہ میں نے خیبر کے دن بارہ دینار میں ایک ہار خریدا، جس میں سونے اور جواہرات جڑے ہوئے تھے، میں نے انہیں ( توڑ کر ) جدا جدا کیا تو مجھے اس میں بارہ دینار سے زیادہ ملے۔ میں نے نبی اکرم صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ نے فرمایا: ” ( سونے اور جواہرات جڑے ہوئے ہار ) نہ بیچے جائیں جب تک انہیں جدا جدا نہ کر لیا جائے“۔ اسی طرح مؤلف نے قتیبہ سے اسی سند سے حدیث روایت کی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ یہ لوگ چاندی جڑی ہوئی تلوار یا کمر بند یا اسی جیسی دوسرے چیزوں کو درہم سے فروخت کرنا درست نہیں سمجھتے ہیں، جب تک کہ ان سے چاندی الگ نہ کر لی جائے۔ ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے۔ ۳- اور صحابہ کرام وغیرہم میں سے بعض اہل علم نے اس کی اجازت دی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ انہوں نے بریرہ ( لونڈی ) کو خریدنا چاہا، تو بریرہ کے مالکوں نے ولاء ۱؎ کی شرط لگائی تو نبی اکرم صلی اللہ علیہ وسلم نے عائشہ سے فرمایا: ”تم اسے خرید لو، ( اور آزاد کر دو ) اس لیے کہ ولاء تو اسی کا ہو گا جو قیمت ادا کرے، یا جو نعمت ( آزاد کرنے ) کا مالک ہو“۔ امام ترمذی کہتے ہیں: ۱- عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر رضی الله عنہما سے بھی حدیث مروی ہے، ۳- اہل علم کا اسی پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں ایک دینار میں قربانی کا جانور خریدنے کے لیے بھیجا، تو انہوں نے قربانی کا ایک جانور خریدا ( پھر اسے دو دینار میں بیچ دیا ) ، اس میں انہیں ایک دینار کا فائدہ ہوا، پھر انہوں نے اس کی جگہ ایک دینار میں دوسرا جانور خریدا، قربانی کا جانور اور ایک دینار لے کر وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، تو آپ نے فرمایا: ”بکری کی قربانی کر دو اور دینار کو صدقہ کر دو“۔ امام ترمذی کہتے ہیں: حکیم بن حزام کی حدیث کو ہم صرف اسی سند سے جانتے ہیں، اور میرے نزدیک جبیب بن ابی ثابت کا سماع حکیم بن حزام سے ثابت نہیں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"text": "عروہ بارقی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بکری خریدنے کے لیے مجھے ایک دینار دیا، تو میں نے اس سے دو بکریاں خریدیں، پھر ان میں سے ایک کو ایک دینار میں بیچ دیا اور ایک بکری اور ایک دینار لے کر نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور آپ سے تمام معاملہ بیان کیا اور آپ نے فرمایا: ”اللہ تمہیں تمہارے ہاتھ کے سودے میں برکت دے“، پھر اس کے بعد وہ کوفہ کے کناسہ کی طرف جاتے اور بہت زیادہ منافع کماتے تھے۔ چنانچہ وہ کوفہ کے سب سے زیادہ مالدار آدمی بن گئے۔ مؤلف نے احمد بن سعید دارمی کے طرق سے زبیر بن خریت سے اسی طرح کی حدیث روایت کی۔ امام ترمذی کہتے ہیں: ۱- بعض اہل علم اسی حدیث کی طرف گئے ہیں اور وہ اسی کے قائل ہیں اور یہی احمد اور اسحاق بن راہویہ کا بھی قول ہے۔ بعض اہل علم نے اس حدیث کو نہیں لیا ہے، انہیں لوگوں میں شافعی اور حماد بن زید سعید بن زید کے بھائی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جب مکاتب غلام کسی دیت یا میراث کا مستحق ہو تو اسی کے مطابق وہ حصہ پائے گا جتنا وہ آزاد کیا جا چکا ہے“، نیز آپ نے فرمایا: ”مکاتب جتنا زر کتابت ادا کر چکا ہے اتنی آزادی کے مطابق دیت دیا جائے گا اور جو باقی ہے اس کے مطابق غلام کی دیت دیا جائے گا“۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن ہے، ۲- اسی طرح یحییٰ بن ابی کثیر نے عکرمہ سے اور عکرمہ نے ابن عباس سے اور ابن عباس نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، ۳- اس باب میں ام سلمہ رضی الله عنہا سے بھی روایت ہے، ۴- لیکن خالد الحذاء نے بھی عکرمہ سے ( روایت کی ہے مگر ان کے مطابق ) عکرمہ نے علی رضی الله عنہ کے قول سے روایت کی ہے، ۵- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی حدیث پر عمل ہے۔ اور صحابہ کرام وغیرہم میں سے اکثر اہل علم کا کہنا ہے کہ جب تک مکاتب پر ایک درہم بھی باقی ہے وہ غلام ہے، سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "عبداللہ بن عمر و رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو خطبہ کے دوران کہتے سنا: ”جو اپنے غلام سے سو اوقیہ ( بارہ سو درہم ) پر مکاتبت کرے اور وہ دس اوقیہ کے علاوہ تمام ادا کر دے پھر باقی کی ادائیگی سے وہ عاجز رہے تو وہ غلام ہی رہے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- حجاج بن ارطاۃ نے بھی عمرو بن شعیب سے اسی طرح کی حدیث روایت کی ہے، ۳- صحابہ کرام وغیرہم میں سے اکثر اہل علم کا اسی پر عمل ہے کہ جب تک مکاتب پر کچھ بھی زر کتابت باقی ہے وہ غلام ہی رہے گا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "ام المؤمنین ام سلمہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کسی کے مکاتب غلام کے پاس اتنی رقم ہو کہ وہ زر کتابت ادا کر سکے تو اسے اس سے پردہ کرنا چاہیئے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اس حدیث پر عمل ازراہ ورع و تقویٰ اور احتیاط ہے۔ یہ لوگ کہتے ہیں کہ مکاتب غلام جب تک زر کتابت نہ ادا کر دے آزاد نہیں ہو گا اگرچہ اس کے پاس زر کتابت ادا کرنے کے لیے رقم موجود ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو ( قرض دار ) آدمی مفلس ہو جائے اور ( قرض دینے والا ) آدمی اپنا سامان اس کے پاس بعینہ پائے تو وہ اس سامان کا دوسرے سے زیادہ مستحق ہے“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں سمرہ اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے اور یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، اور بعض اہل علم کہتے ہیں: وہ بھی دوسرے قرض خواہوں کی طرح ہو گا، یہی اہل کوفہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ ہمارے پاس ایک یتیم کی شراب تھی، جب سورۃ المائدہ نازل ہوئی ( جس میں شراب کی حرمت مذکور ہے ) تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا اور عرض کیا کہ وہ ایک یتیم کی ہے؟ تو آپ نے فرمایا: ”اسے بہا دو“۔ امام ترمذی کہتے ہیں: ۱- ابو سعید خدری رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اور بھی سندوں سے یہ نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح مروی ہے، ۳- اس باب میں انس بن مالک رضی الله عنہ سے روایت ہے، ۴- بعض اہل علم اسی کے قائل ہیں، یہ لوگ شراب کا سرکہ بنانے کو مکروہ سمجھتے ہیں، اس وجہ سے اسے مکروہ قرار دیا گیا ہے کہ مسلمان کے گھر میں شراب رہے یہاں تک کہ وہ سرکہ بن جائے۔ «واللہ اعلم»،‏‏‏‏ ۵- بعض لوگوں نے شراب کے سرکہ کی اجازت دی ہے جب وہ خود سرکہ بن جائے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو تمہارے پاس امانت رکھے اسے امانت لوٹاؤ ۱؎ اور جو تمہارے ساتھ خیانت کرے اس کے ساتھ ( بھی ) خیانت نہ کرو“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- بعض اہل علم اسی حدیث کی طرف گئے ہیں، وہ کہتے ہیں کہ جب آدمی کا کسی دوسرے کے ذمہ کوئی چیز ہو اور وہ اسے لے کر چلا جائے پھر اس جانے والے کی کوئی چیز اس کے ہاتھ میں آئے تو اس کے لیے جائز نہیں ہے کہ اس میں سے اتنا روک لے جتنا وہ اس کالے کر گیا ہے، ۳- تابعین میں سے بعض اہل علم نے اس کی اجازت دی ہے، اور یہی ثوری کا بھی قول ہے، وہ کہتے ہیں: اگر اس کے ذمہ درہم ہو اور ( بطور امانت ) اس کے پاس اس کے دینار آ گئے تو اس کے لیے جائز نہیں کہ وہ اپنے دراہم کے بدلے اسے روک لے، البتہ اس کے پاس اس کے دراہم آ جائیں تو اس وقت اس کے لیے درست ہو گا کہ اس کے دراہم میں سے اتنا روک لے جتنا اس کے ذمہ اس کا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "ابوامامہ رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو حجۃ الوداع کے سال خطبہ میں فرماتے سنا: ”عاریت لی ہوئی چیز لوٹائی جائے گی، ضامن کو تاوان دینا ہو گا اور قرض واجب الاداء ہو گا“۔ امام ترمذی کہتے ہیں: ۱- ابوامامہ رضی الله عنہ کی حدیث حسن غریب ہے، ۲- اور یہ ابوامامہ کے واسطے سے نبی اکرم صلی اللہ علیہ وسلم سے اور بھی طریق سے مروی ہے، ۳- اس باب میں سمرہ، صفوان بن امیہ اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "سمرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو کچھ ہاتھ نے لیا ہے جب تک وہ اسے ادا نہ کر دے اس کے ذمہ ہے“ ۱؎، قتادہ کہتے ہیں: پھر حسن بصری اس حدیث کو بھول گئے اور کہنے لگے ”جس نے عاریت لی ہے“ وہ تیرا امین ہے، اس پر تاوان نہیں ہے، یعنی عاریت لی ہوئی چیز تلف ہونے پر تاوان نہیں ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہم میں سے بعض اہل علم اسی طرف گئے ہیں یہ لوگ کہتے ہیں: عاریۃً لینے والا ضامن ہوتا ہے۔ اور یہی شافعی اور احمد کا بھی قول ہے، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کہتے ہیں کہ عاریت لینے والے پر تاوان نہیں ہے، الا یہ کہ وہ سامان والے کی مخالفت کرے۔ ثوری اور اہل کوفہ کا یہی قول ہے اور اسحاق بن راہویہ بھی اسی کے قائل ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "معمر بن عبداللہ بن نضلہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”گنہگار ہی احتکار ( ذخیرہ اندوزی ) کرتا ہے“ ۱؎۔ محمد بن ابراہیم کہتے ہیں: میں نے سعید بن المسیب سے کہا: ابو محمد! آپ تو ذخیرہ اندوزی کرتے ہیں؟ انہوں نے کہا: معمر بھی ذخیرہ اندوزی کرتے تھے۔ امام ترمذی کہتے ہیں: ۱- معمر کی حدیث حسن صحیح ہے، ۲- سعید بن مسیب سے مروی ہے، وہ تیل، گیہوں اور اسی طرح کی چیزوں کی ذخیرہ اندوزی کرتے تھے، ۳- اس باب میں عمر، علی، ابوامامہ، اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- اہل علم کا اسی پر عمل ہے۔ ان لوگوں نے کھانے کی ذخیرہ اندوزی ناجائز کہا ہے، ۵- بعض اہل علم نے کھانے کے علاوہ دیگر اشیاء کی ذخیرہ اندوزی کی اجازت دی ہے، ۶- ابن مبارک کہتے ہیں: روئی، دباغت دی ہوئی بکری کی کھال، اور اسی طرح کی چیزوں کی ذخیرہ اندوزی میں کوئی حرج نہیں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” ( بازار میں آنے والے قافلہ تجارت کا بازار سے پہلے ) استقبال نہ کرو، جانور کے تھن میں دودھ نہ روکو ( تاکہ خریدار دھوکہ کھا جائے ) اور ( جھوٹا خریدار بن کر ) ایک دوسرے کا سامان نہ فروخت کراؤ“۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن مسعود اور ابوہریرہ رضی الله عنہما سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے، یہ لوگ ایسے جانور کی بیع کو جس کا دودھ تھن میں روک لیا گیا ہو جائز نہیں سمجھتے، ۴- محفلۃ ایسے جانور کو کہتے ہیں جس کا دودھ تھن میں چھوڑے رکھا گیا ہو، اس کا مالک کچھ دن سے اسے نہ دوہتا ہوتا کہ اس کی تھن میں دودھ جمع ہو جائے اور خریدار اس سے دھوکہ کھا جائے۔ یہ فریب اور دھوکہ ہی کی ایک شکل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے جھوٹی قسم کھائی تاکہ اس کے ذریعہ وہ کسی مسلمان کا مال ہتھیا لے تو وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ اللہ تعالیٰ اس سے ناراض ہو گا“۔ اشعث بن قیس رضی الله عنہ کہتے ہیں: اللہ کی قسم! آپ نے میرے سلسلے میں یہ حدیث بیان فرمائی تھی۔ میرے اور ایک یہودی کے درمیان ایک زمین مشترک تھی، اس نے میرے حصے کا انکار کیا تو میں اسے نبی اکرم صلی اللہ علیہ وسلم سے پاس لے گیا، رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا: ”کیا تمہارے پاس کوئی گواہ ہے؟“ میں نے عرض کیا: نہیں، تو آپ نے یہودی سے فرمایا: ”تم قسم کھاؤ“ میں نے عرض کیا: اللہ کے رسول! وہ تو قسم کھا لے گا اور میرا مال ہضم کر لے گا۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی «إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا» ”اور جو لوگ اللہ کے قرار اور اپنی قسموں کے عوض تھوڑا سا مول حاصل کرتے ہیں…“ ( آل عمران: ۷۷ ) ۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود کی حدیث حسن صحیح ہے، ۲- اس باب میں وائل بن حجر، ابوموسیٰ، ابوامامہ بن ثعلبہ انصاری اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب بائع اور مشتری میں اختلاف ہو جائے تو بات بائع کی مانی جائے گی، اور مشتری کو اختیار ہو گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث مرسل ہے، عون بن عبداللہ نے ابن مسعود کو نہیں پایا، ۲- اور قاسم بن عبدالرحمٰن سے بھی یہ حدیث مروی ہے، انہوں نے ابن مسعود سے اور ابن مسعود نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔ اور یہ روایت بھی مرسل ہے، ۳- اسحاق بن منصور کہتے ہیں: میں نے احمد سے پوچھا: جب بائع اور مشتری میں اختلاف ہو جائے اور کوئی گواہ نہ ہو تو کس کی بات تسلیم کی جائے گی؟ انہوں نے کہا: بات وہی معتبر ہو گی جو سامان کا مالک کہے گا، یا پھر دونوں اپنی اپنی چیز واپس لے لیں یعنی بائع سامان واپس لے لے اور مشتری قیمت۔ اسحاق بن راہویہ نے بھی وہی کہا ہے جو احمد نے کہا ہے، ۴- اور بات جس کی بھی مانی جائے اس کے ذمہ قسم کھانا ہو گا۔ امام ترمذی کہتے ہیں: تابعین میں سے بعض اہل علم سے اسی طرح مروی ہے، انہیں میں شریح بھی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "ایاس بن عبد مزنی رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے پانی بیچنے سے منع فرمایا ۱؎۔ امام ترمذی کہتے ہیں: ۱- ایاس کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر، بہیسہ، بہیسہ کے باپ، ابوہریرہ، عائشہ، انس اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اکثر اہل علم کا اسی پر عمل ہے، ان لوگوں نے پانی بیچنے کو ناجائز کہا ہے، یہی ابن مبارک شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۴- اور بعض اہل علم نے پانی بیچنے کی اجازت دی ہے، جن میں حسن بصری بھی شامل ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ضرورت سے زائد پانی سے نہ روکا جائے کہ اس کے سبب گھاس سے روک دیا جائے“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے نر کو مادہ پر چھوڑنے کی اجرت لینے سے منع فرمایا ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوہریرہ، انس اور ابوسعید رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے۔ بعض علماء نے اس کام پر بخشش قبول کرنے کی اجازت دی ہے، جمہور کے نزدیک یہ نہی تحریمی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ قبیلہ کلاب کے ایک آدمی نے نبی اکرم صلی اللہ علیہ وسلم سے نر کو مادہ پر چھوڑنے کی اجرت لینے کے بارے میں پوچھا تو آپ نے اسے منع کر دیا، پھر اس نے عرض کیا: اللہ کے رسول! ہم مادہ پر نر چھوڑتے ہیں تو ہمیں بخشش دی جاتی ہے ( تو اس کا حکم کیا ہے؟ ) آپ نے اسے بخشش لینے کی اجازت دے دی۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔ ہم اسے صرف ابراہیم بن حمید ہی کی روایت سے جانتے ہیں جسے انہوں نے ہشام بن عروہ سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "رافع بن خدیج رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پچھنا لگانے والے کی کمائی خبیث ( گھٹیا ) ہے ۱؎ زانیہ کی اجرت ناپاک ۲؎ ہے اور کتے کی قیمت ناپاک ہے“ ۳؎۔ امام ترمذی کہتے ہیں: ۱- رافع رضی اللہ عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر، علی، ابن مسعود، ابومسعود، جابر، ابوہریرہ، ابن عباس، ابن عمر اور عبداللہ ابن جعفر رضی اللہ عنہم سے بھی احادیث آئی ہیں، ۳- اکثر اہل علم کا اسی پر عمل ہے۔ ان لوگوں نے کتے کی قیمت کو ناجائز جانا ہے، یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔ اور بعض اہل علم نے شکاری کتے کی قیمت کی اجازت دی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "ابومسعود انصاری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے کتے کی قیمت، زانیہ کی کمائی اور کاہن کی مٹھائی سے منع فرمایا ہے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "محیصہ رضی الله عنہ کہتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے پچھنا لگانے والے کی اجرت کی اجازت طلب کی، تو آپ نے انہیں اس سے منع فرمایا ۱؎ لیکن وہ باربار آپ سے پوچھتے اور اجازت طلب کرتے رہے یہاں تک کہ آپ نے فرمایا: ”اسے اپنے اونٹ کے چارہ پر خرچ کرو یا اپنے غلام کو کھلا دو“۔ امام ترمذی کہتے ہیں: ۱- محیصہ کی حدیث حسن صحیح ہے، ۲- اس باب میں رافع بن خدیج، جحیفہ، جابر اور سائب بن یزید سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے، ۴- احمد کہتے ہیں: اگر مجھ سے کوئی پچھنا لگانے والا مزدوری طلب کرے تو میں نہیں دوں گا اور دلیل میں یہی حدیث پیش کروں گا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "حمید کہتے ہیں کہ انس رضی الله عنہ سے پچھنا لگانے والے کی کمائی کے بارے میں پوچھا گیا تو انس رضی الله عنہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے پچھنا لگوایا، اور آپ کو پچھنا لگانے والے ابوطیبہ تھے، تو آپ نے انہیں دو صاع غلہ دینے کا حکم دیا اور ان کے مالکوں سے بات کی، تو انہوں نے ابوطیبہ کے خراج میں کمی کر دی اور آپ نے فرمایا: ”جن چیزوں سے تم دوا کرتے ہو ان میں سب سے افضل پچھنا ہے“ یا فرمایا: ”تمہاری بہتر دواؤں میں سے پچھنا ہے“۔ امام ترمذی کہتے ہیں: ۱- انس رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، ابن عباس اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳ – صحابہ کرام وغیرہم میں سے بعض اہل علم نے پچھنا لگانے والے کی اجرت کو جائز قرار دیا ہے۔ یہی شافعی کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے کتے اور بلی کی قیمت سے منع فرمایا ہے۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کی سند میں اضطراب ہے۔ بلی کی قیمت کے بارے میں یہ صحیح نہیں ہے، ۲- یہ حدیث اعمش سے مروی ہے انہوں نے اپنے بعض اصحاب سے روایت کی ہے اور اس نے جابر سے، یہ لوگ اعمش سے اس حدیث کی روایت میں اضطراب کا شکار ہیں، ۳- اور ابن فضل نے اس سند کے علاوہ دوسری سند سے بطریق: «الأعمش، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم» روایت کی ہے، ۴- اہل علم کی ایک جماعت نے بلی کی قیمت کو ناجائز کہا ہے، ۵- اور بعض لوگوں نے اس کی رخصت دی ہے، یہی احمد اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے بلی اور اس کی قیمت کھانے سے منع فرمایا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اور ہم عبدالرزاق کے علاوہ کسی بڑے محدث کو نہیں جانتے جس نے عمرو بن زید سے روایت کی ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": 1281,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ کتے کی قیمت سے ( رسول اللہ صلی اللہ علیہ وسلم نے ) منع فرمایا ہے سوائے شکاری کتے کی قیمت کے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس طریق سے صحیح نہیں ہے، ۲- ابومہزم کا نام یزید بن سفیان ہے، ان کے سلسلہ میں شعبہ بن حجاج نے کلام کیا ہے اور ان کی تضعیف کی ہے، ۳- اور جابر سے مروی ہے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی جیسی حدیث روایت کی ہے، اور اس کی سند بھی صحیح نہیں ہے ( دیکھئیے الصحیحۃ رقم: ۲۹۷۱ ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "ابوامامہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”گانے والی لونڈیوں کو نہ بیچو اور نہ انہیں خریدو، اور نہ انہیں ( گانا ) سکھاؤ ۱؎، ان کی تجارت میں خیر و برکت نہیں ہے اور ان کی قیمت حرام ہے۔ اور اسی جیسی چیزوں کے بارے میں یہ آیت اتری ہے: «ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله» ”اور بعض لوگ ایسے ہیں جو لغو باتوں کو خرید لیتے ہیں تاکہ لوگوں کو اللہ کی راہ سے بہکائیں“ ( لقمان: ۶ ) “۔ امام ترمذی کہتے ہیں: ۱- ابوامامہ کی حدیث کو ہم اس طرح صرف اسی طریق سے جانتے ہیں، اور بعض اہل علم نے علی بن یزید کے بارے میں کلام کیا ہے اور ان کی تضعیف کی ہے۔ اور یہ شام کے رہنے والے ہیں، ۲- اس باب میں عمر بن خطاب رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "ابوایوب انصاری رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”جو شخص ماں اور اس کے بچے کے درمیان جدائی ڈالے گا اللہ تعالیٰ قیامت کے دن اس کے اور اس کے دوستوں کے درمیان جدائی ڈال دے گا“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "علی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے دو غلام دیئے جو آپس میں بھائی تھے، میں نے ان میں سے ایک کو بیچ دیا، پھر رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا: ”علی! تمہارا غلام کیا ہوا؟“، میں نے آپ کو بتایا ( کہ میں نے ایک کو بیچ دیا ہے ) تو آپ نے فرمایا: ”اسے واپس لوٹا لو، اسے واپس لوٹا لو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- صحابہ کرام وغیرہم میں سے بعض اہل علم بیچتے وقت ( رشتہ دار ) قیدیوں کے درمیان جدائی ڈالنے کو ناجائز کہا ہے، ۳- اور بعض اہل علم نے ان لڑکوں کے درمیان جدائی کو جائز قرار دیا ہے جو سر زمین اسلام میں پیدا ہوئے ہیں۔ پہلا قول ہی زیادہ صحیح ہے، ۴- ابراہیم نخعی سے مروی ہے کہ انہوں نے بیچتے وقت ماں اور اس کے لڑکے کے درمیان تفریق، چنانچہ ان پر یہ اعتراض کیا گیا تو انہوں نے کہا: میں نے اس کی ماں سے اس کی اجازت مانگی تو وہ اس پر راضی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ کیا کہ فائدے کا استحقاق ضامن ہونے کی بنیاد پر ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ اور بھی سندوں سے مروی ہے، ۳ – اہل علم کا اسی پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": 1286,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فیصلہ کیا کہ فائدہ کا استحقاق ضامن ہونے کی بنیاد پر ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث ہشام بن عروہ کی روایت سے حسن صحیح غریب ہے، ۲- امام ترمذی کہتے ہیں: محمد بن اسماعیل نے اس حدیث کو عمر بن علی کی روایت سے غریب جانا ہے۔ میں نے پوچھا: کیا آپ کی نظر میں اس میں تدلیس ہے؟ انہوں نے کہا: نہیں، ۳- مسلم بن خالد زنجی نے اس حدیث کو ہشام بن عروہ سے روایت کیا ہے۔ ۴- جریر نے بھی اسے ہشام سے روایت کیا ہے، ۵- اور کہا جاتا ہے کہ جریر کی حدیث میں تدلیس ہے، اس میں جریر نے تدلیس کی ہے، انہوں نے اسے ہشام بن عروہ سے نہیں سنا ہے، ۶- «الخراج بالضمان» کی تفسیر یہ ہے کہ آدمی غلام خریدے اور اس سے مزدوری کرائے پھر اس میں کوئی عیب دیکھے اور اس کو بیچنے والے کے پاس لوٹا دے، تو غلام کی جو مزدوری اور فائدہ ہے وہ خریدنے والے کا ہو گا۔ اس لیے کہ اگر غلام ہلاک ہو جاتا تو مشتری ( خریدار ) کا مال ہلاک ہوتا۔ یہ اور اس طرح کے مسائل میں فائدہ کا استحقاق ضامن ہونے کی وجہ سے ہوتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": 1287,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص کسی باغ میں داخل ہو تو ( پھل ) کھائے، کپڑوں میں باندھ کر نہ لے جائے“۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث غریب ہے۔ ہم اسے اس طریق سے صرف یحییٰ بن سلیم ہی کی روایت سے جانتے ہیں، ۲- اس باب میں عبداللہ بن عمرو، عباد بن شرحبیل، رافع بن عمرو، عمیر مولی آبی اللحم اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم نے راہ گیر کے لیے پھل کھانے کی رخصت دی ہے۔ اور بعض نے اسے ناجائز کہا ہے، الا یہ کہ قیمت ادا کر کے ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "رافع بن عمرو رضی الله عنہما کہتے ہیں کہ میں انصار کے کھجور کے درختوں پر پتھر مارتا تھا، ان لوگوں نے مجھے پکڑ لیا اور نبی اکرم صلی اللہ علیہ وسلم کے پاس لے گئے آپ نے پوچھا: ”رافع! تم ان کے کھجور کے درختوں پر پتھر کیوں مارتے ہو؟“ میں نے عرض کیا: اللہ کے رسول! بھوک کی وجہ سے، آپ نے فرمایا: ”پتھر مت مارو، جو خودبخود گر جائے اسے کھاؤ اللہ تمہیں آسودہ اور سیراب کرے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے لٹکے ہوئے پھل کے بارے میں پوچھا گیا تو آپ نے فرمایا: ”جو ضرورت مند اس میں سے ( ضرورت کے مطابق ) لے لے اور کپڑے میں جمع کرنے والا نہ ہو تو اس پر کوئی مواخذہ نہیں ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے محاقلہ، مزابنہ ۱؎ مخابرہ ۲؎ اور بیع میں کچھ چیزوں کو مستثنیٰ کرنے سے منع فرمایا ۳؎ الا یہ کہ استثناء کی ہوئی چیز معلوم ہو۔ امام ترمذی کہتے ہیں: یہ حدیث اس طریق سے بروایت یونس بن عبید جسے یونس نے عطاء سے اور عطاء نے جابر سے روایت کی ہے حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص غلہ خریدے تو اسے نہ بیچے جب تک کہ اس پر قبضہ نہ کر لے“ ۱؎، ابن عباس رضی الله عنہما کہتے ہیں: میں ہر چیز کو غلے ہی کے مثل سمجھتا ہوں۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر، ابن عمر اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اکثر اہل علم کا اسی پر عمل ہے، ان لوگوں نے غلہ کی بیع کو ناجائز کہا ہے۔ جب تک مشتری اس پر قبضہ نہ کر لے، ۴- اور بعض اہل علم نے قبضہ سے پہلے اس شخص کو بیچنے کی رخصت دی ہے جو کوئی ایسی چیز خریدے جو ناپی اور تولی نہ جاتی ہو اور نہ کھائی اور پی جاتی ہو، ۵- اہل علم کے نزدیک سختی غلے کے سلسلے میں ہے۔ احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے کوئی دوسرے کی بیع پر بیع نہ کرے ۱؎ اور نہ کوئی کسی کے شادی کے پیغام پر پیغام دے“۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوہریرہ اور سمرہ رضی الله عنہما سے بھی احادیث آئی ہیں، ۳- نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے کہ آپ نے فرمایا آدمی اپنے بھائی کے بھاؤ پر بھاؤ نہ کرے۔ ۴- اور بعض اہل علم کے نزدیک نبی اکرم صلی اللہ علیہ وسلم سے مروی اس حدیث میں بیع سے مراد بھاؤ تاؤ اور مول تول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "ابوطلحہ رضی الله عنہ کہتے ہیں کہ انہوں نے عرض کیا: اللہ کے نبی! میں نے ان یتیموں کے لیے شراب خریدی تھی جو میری پرورش میں ہیں۔ ( اس کا کیا حکم ہے؟ ) آپ نے فرمایا: ”شراب بہا دو اور مٹکے توڑ دو“۔ امام ترمذی کہتے ہیں: ۱- ابوطلحہ رضی الله عنہ کی اس حدیث کو ثوری نے بطریق: «السدي، عن يحيى بن عباد، عن أنس» روایت کیا ہے کہ ابوطلحہ آپ کے پاس تھے ۱؎، اور یہ لیث کی روایت سے زیادہ صحیح ہے، ۲- اس باب میں جابر، عائشہ، ابوسعید، ابن مسعود، ابن عمر، اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے پوچھا گیا: کیا شراب کا سرکہ بنایا جا سکتا ہے؟ آپ نے فرمایا: ”نہیں“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے شراب کی وجہ سے ”دس آدمیوں پر لعنت بھیجی: اس کے نچوڑوانے والے پر، اس کے پینے والے پر، اس کے لے جانے والے پر، اس کے منگوانے والے پر، اور جس کے لیے لے جائی جائے اس پر، اس کے پلانے والے پر، اور اس کے بیچنے والے پر، اس کی قیمت کھانے والے پر، اس کو خریدنے والے پر اور جس کے لیے خریدی گئی ہو اس پر“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث انس رضی الله عنہ کی روایت سے غریب ہے، ۲- اور اسی حدیث کی طرح ابن عباس، ابن مسعود اور ابن عمر رضی الله عنہم سے بھی مروی ہے جسے یہ لوگ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "سمرہ بن جندب رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی کسی ریوڑ کے پاس ( دودھ پینے ) آئے تو اگر ان میں ان کا مالک موجود ہو تو اس سے اجازت لے، اگر وہ اجازت دیدے تو دودھ پی لے۔ اگر ان میں کوئی نہ ہو تو تین بار آواز لگائے، اگر کوئی جواب دے تو اس سے اجازت لے لے، اور اگر کوئی جواب نہ دے تو دودھ پی لے لیکن ساتھ نہ لے جائے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- سمرہ کی حدیث حسن غریب ہے، ۲- اس باب میں عمر اور ابو سعید خدری سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے، احمد اور اسحاق بن راہویہ اسی کے قائل ہیں، ۴- علی بن مدینی کہتے ہیں کہ سمرہ سے حسن کا سماع ثابت ہے، ۵- بعض محدثین نے حسن کی روایت میں جسے انہوں نے سمرہ سے روایت کی ہے کلام کیا ہے، وہ لوگ کہتے ہیں کہ حسن سمرہ کے صحیفہ سے حدیث روایت کرتے تھے ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ انہوں نے فتح مکہ کے سال مکہ کے اندر رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”اللہ اور اس کے رسول نے شراب، مردار، خنزیر اور بتوں کی بیع کو حرام قرار دیا ہے“، عرض کیا گیا، اللہ کے رسول! مجھے مردار کی چربی کے بارے میں بتائیے، اسے کشتیوں پہ ملا جاتا ہے، چمڑوں پہ لگایا جاتا ہے، اور لوگ اس سے چراغ جلاتے ہیں؟ آپ نے فرمایا: ”نہیں، یہ جائز نہیں، یہ حرام ہے“، پھر آپ نے اسی وقت فرمایا: ”یہود پر اللہ کی مار ہو، اللہ نے ان کے لیے چربی حرام قرار دے دی، تو انہوں نے اس کو پگھلایا پھر اسے بیچا اور اس کی قیمت کھائی“۔ امام ترمذی کہتے ہیں: ۱- جابر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بری مثال ہمارے لیے مناسب نہیں، ہدیہ دے کر واپس لینے والا کتے کی طرح ہے جو قے کر کے چاٹتا ہے“ ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "عبداللہ بن عمر اور ابن عباس رضی الله عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کسی کے لیے جائز نہیں کہ کوئی عطیہ دے کر اسے واپس لے سوائے باپ کے جو اپنے بیٹے کو دے“۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی حدیث پر عمل ہے۔ یہ لوگ کہتے ہیں کہ جو کسی ذی محرم کو کوئی چیز بطور ہبہ دے تو پھر اسے واپس لینے کا اختیار نہیں، اور جو کسی غیر ذی محرم کو کوئی چیز بطور ہبہ دے تو اس کے لیے اسے واپس لینا جائز ہے جب اسے اس کا بدلہ نہ دیا گیا ہو، یہی ثوری کا قول ہے، ۳- اور شافعی کہتے ہیں: کسی کے لیے جائز نہیں کہ وہ کسی کو کوئی عطیہ دے پھر اسے واپس لے، سوائے باپ کے جو اپنے بیٹے کو دے، شافعی نے عبداللہ بن عمر رضی الله عنہما کی حدیث سے استدلال کیا ہے جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ نے فرمایا: ”کسی کے لیے جائز نہیں کہ کوئی عطیہ دے کر اسے واپس لے سوائے باپ کے جو اپنے بیٹے کو دے“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "زید بن ثابت رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے محاقلہ اور مزابنہ سے منع فرمایا، البتہ آپ نے عرایا والوں کو اندازہ لگا کر اسے اتنی ہی کھجور میں بیچنے کی اجازت دی ۱؎۔ امام ترمذی کہتے ہیں: ۱- زید بن ثابت رضی الله عنہ کی حدیث کو محمد بن اسحاق نے اسی طرح روایت کیا ہے۔ اور ایوب، عبیداللہ بن عمر اور مالک بن انس نے نافع سے اور نافع نے ابن عمر سے روایت کی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے محاقلہ اور مزابنہ سے منع فرمایا ہے، ۲- اس باب میں ابوہریرہ اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں۔ اور اسی سند سے ابن عمر نے زید بن ثابت سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ نے بیع عرایا کی اجازت دی۔ اور یہ محمد بن اسحاق کی حدیث سے زیادہ صحیح ہے ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے پانچ وسق سے کم میں عرایا کے بیچنے کی اجازت دی ہے یا ایسے ہی کچھ آپ نے فرمایا۔ راوی کو شک ہے کہ حدیث کے یہی الفاظ ہیں یا کچھ فرق ہے۔ امام ترمذی کہتے ہیں: ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "زید بن ثابت رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اندازہ لگا کر عرایا کو بیچنے کی اجازت دی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- بعض اہل علم کا اسی پر عمل ہے۔ جس میں شافعی، احمد اور اسحاق بن راہویہ بھی میں شامل ہیں۔ یہ لوگ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے من جملہ جن چیزوں سے منع فرمایا ہے اس سے عرایا مستثنیٰ ہے، اس لیے کہ آپ نے محاقلہ اور مزابنہ سے منع فرمایا ہے۔ ان لوگوں نے زید بن ثابت اور ابوہریرہ کی حدیث سے استدلال کیا ہے ان کا کہنا ہے کہ اس کے لیے پانچ وسق سے کم خریدنا جائز ہے، ۳- بعض اہل علم کے نزدیک اس کا مفہوم یہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم کے پیش نظر اس سلسلہ میں توسع اور گنجائش دینا ہے، اس لیے کہ عرایا والوں نے آپ سے شکایت کی اور عرض کیا کہ خشک کھجور کے سوا ہمیں کوئی اور چیز میسر نہیں جس سے ہم تازہ کھجور خرید سکیں۔ تو آپ نے انہیں پانچ وسق سے کم میں خریدنے کی اجازت دے دی تاکہ وہ تازہ کھجور کھا سکیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "رافع بن خدیج اور سہل بن ابی حثمہ رضی الله عنہما کا بیان ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بیع مزابنہ یعنی سوکھی کھجوروں کے عوض درخت پر لگی کھجور بیچنے سے منع فرمایا، البتہ آپ نے عرایا والوں کو اجازت دی، اور خشک انگور کے عوض تر انگور بیچنے سے اور اندازہ لگا کر کوئی بھی پھل بیچنے سے منع فرمایا۔ امام ترمذی کہتے ہیں: یہ حدیث اس طریق سے حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم نجش نہ کرو“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر اور انس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اور بعض اہل علم کا اسی پر عمل ہے، ان لوگوں نے «نجش» کو ناجائز کہا ہے، ۴- «نجش» یہ ہے کہ ایسا آدمی جو سامان کے اچھے برے کی تمیز رکھتا ہو سامان والے کے پاس آئے اور اصل قیمت سے بڑھا کر سامان کی قیمت لگائے اور یہ ایسے وقت ہو جب خریدار اس کے پاس موجود ہو، مقصد صرف یہ ہو کہ اس سے خریدار دھوکہ کھا جائے اور وہ ( دام بڑھا چڑھا کر لگانے والا ) خریدنے کا خیال نہ رکھتا ہو بلکہ صرف یہ چاہتا ہو کہ اس کی قیمت لگانے کی وجہ سے خریدار دھوکہ کھا جائے۔ یہ دھوکہ ہی کی ایک قسم ہے، ۵- شافعی کہتے ہیں: اگر کوئی آدمی «نجش» کرتا ہے تو اپنے اس فعل کی وجہ سے وہ یعنی «نجش» کرنے والا گنہگار ہو گا اور بیع جائز ہو گی، اس لیے کہ بیچنے والا تو «نجش» نہیں کر رہا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "سوید بن قیس رضی الله عنہ کہتے ہیں کہ میں اور مخرمہ عبدی دونوں مقام ہجر سے ایک کپڑا لے آئے، نبی اکرم صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور آپ نے ہم سے ایک پائجامے کا مول بھاؤ کیا۔ میرے پاس ایک تولنے ولا تھا جو اجرت لے کر تولتا تھا تو نبی اکرم صلی اللہ علیہ وسلم نے تولنے والے سے فرمایا: ”جھکا کر تول“۔ امام ترمذی کہتے ہیں: ۱- سوید رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اہل علم جھکا کر تولنے کو مستحب سمجھتے ہیں، ۳- اس باب میں جابر اور ابوہریرہ رضی الله عنہما سے بھی احادیث آئی ہیں، ۴- اور شعبہ نے بھی اس حدیث کو سماک سے روایت کیا ہے، لیکن انہوں نے «عن سوید بن قیس» کی جگہ «عن ابی صفوان» کہا ہے پھر آگے حدیث ذکر کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص کسی تنگ دست ( قرض دار ) کو مہلت دے یا اس کا کچھ قرض معاف کر دے، تو اللہ اسے قیامت کے دن اپنے عرش کے سایہ کے نیچے جگہ دے گا جس دن اس کے سایہ کے علاوہ کوئی اور سایہ نہ ہو گا“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث اس سند سے حسن صحیح غریب ہے، ۲- اس باب میں ابویسر ( کعب بن عمرو ) ، ابوقتادہ، حذیفہ، ابن مسعود، عبادہ اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "ابومسعود انصاری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم سے پہلی امتوں میں سے ایک آدمی کا حساب ( اس کی موت کے بعد ) لیا گیا، تو اس کے پاس کوئی نیکی نہیں ملی، سوائے اس کے کہ وہ ایک مالدار آدمی تھا، لوگوں سے لین دین کرتا تھا اور اپنے خادموں کو حکم دیتا تھا کہ ( تقاضے کے وقت ) تنگ دست سے درگزر کریں، تو اللہ تعالیٰ نے ( فرشتوں سے ) فرمایا: ہم اس سے زیادہ اس کے ( درگزر کے ) حقدار ہیں، تم لوگ اسے معاف کر دو“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم فرمایا: ”مالدار آدمی کا قرض کی ادائیگی میں ٹال مٹول کرنا ظلم ہے ۱؎ اور جب تم میں سے کوئی کسی مالدار کی حوالگی میں دیا جائے تو چاہیئے کہ اس کی حوالگی اسے قبول کرے“ ۲؎۔ امام ترمذی کہتے ہیں: اس باب میں ابن عمر اور شرید بن سوید ثقفی رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مالدار آدمی کا قرض کی ادائیگی میں ٹال مٹول کرنا ظلم ہے۔ اور جب تم کسی مالدار کے حوالے کئے جاؤ تو اسے قبول کر لو، اور ایک بیع میں دو بیع نہ کرو“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس کا مطلب یہ ہے کہ جب تم میں سے کوئی قرض وصول کرنے میں کسی مالدار کے حوالے کیا جائے تو اسے قبول کرنا چاہیئے، ۳- بعض اہل علم کہتے ہیں کہ جب آدمی کو کسی مالدار کے حوالے کیا جائے اور وہ حوالہ قبول کر لے تو حوالے کرنے والا بری ہو جائے گا اور قرض خواہ کے لیے درست نہیں کہ پھر حوالے کرنے والے کی طرف پلٹے۔ یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔ ۴- اور بعض اہل علم کہتے ہیں: کہ «محتال علیہ» ”جس آدمی کی طرف تحویل کیا گیا ہے“، کے مفلس ہو جانے کی وجہ سے اس کے مال کے ڈوب جانے کا خطرہ ہو تو قرض خواہ کے لیے جائز ہو گا کہ وہ پہلے کی طرف لوٹ جائے، ان لوگوں نے اس بات پر عثمان رضی الله عنہ وغیرہ کے قول سے استدلال کیا ہے کہ مسلمان کا مال ضائع نہیں ہوتا ہے، ۵- اسحاق بن راہویہ کہتے ہیں: اس حدیث «ليس على مال مسلم توي» ”مسلمان کا مال ضائع نہیں ہوتا ہے“، کا مطلب یہ ہے کہ جب کوئی قرض خواہ کسی کے حوالے کیا گیا اور اسے مالدار سمجھ رہا ہو لیکن درحقیقت وہ غریب ہو تو ایسی صورت میں مسلمان کا مال ضائع نہ ہو گا ( اور وہ اصل قرض دار سے اپنا مال طلب کر سکتا ہے ) ۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بیع منابذہ اور بیع ملامسہ سے منع فرمایا۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوسعید اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اس حدیث کا مطلب یہ ہے کہ کوئی شخص یہ کہے: جب میں تمہاری طرف یہ چیز پھینک دوں تو میرے اور تمہارے درمیان بیع واجب ہو جائے گی۔ ( یہ منابذہ کی صورت ہے ) اور ملامسہ یہ ہے کہ کوئی شخص یہ کہے: جب میں یہ چیز چھولوں تو بیع واجب ہو جائے گی اگرچہ وہ سامان کو بالکل نہ دیکھ رہا ہو۔ مثلاً تھیلے وغیرہ میں ہو۔ یہ دونوں جاہلیت کی مروج بیعوں میں سے تھیں لہٰذا آپ نے اس سے منع فرمایا ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے اور اہل مدینہ پھلوں میں سلف کیا کرتے تھے یعنی قیمت پہلے ادا کر دیتے تھے، آپ نے فرمایا: ”جو سلف کرے وہ متعین ناپ تول اور متعین مدت میں سلف کرے“۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن ابی اوفی اور عبدالرحمٰن بن ابزی رضی الله عنہما سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے۔ یہ لوگ غلہ، کپڑا، اور جن چیزوں کی حد اور صفت معلوم ہو اس کی خریداری کے لیے پیشگی رقم دینے کو جائز کہتے ہیں، ۴- جانور خریدنے کے لیے پیشگی رقم دینے میں اختلاف ہے، ۵- بعض اہل علم جانور خریدنے کے لیے پیشگی رقم دینے کو جائز کہتے ہیں۔ شافعی، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے۔ اور صحابہ کرام وغیرہم میں سے بعض اہل علم نے جانور خریدنے کے لیے پیشگی دینے کو مکروہ سمجھا ہے۔ سفیان اور اہل کوفہ کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس آدمی کے باغ میں کوئی ساجھی دار ہو تو وہ اپنا حصہ اس وقت تک نہ بیچے جب تک کہ اسے اپنے ساجھی دار پر پیش نہ کر لے“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کی سند متصل نہیں ہے، ۲- میں نے محمد بن اسماعیل بخاری کو کہتے سنا: سلیمان یشکری کے بارے میں کہا جاتا ہے کہ وہ جابر بن عبداللہ کی زندگی ہی میں مر گئے تھے، ان سے قتادہ اور ابوبشر کا سماع نہیں ہے۔ محمد بن اسماعیل بخاری کہتے ہیں: میں نہیں جانتا ہوں کہ ان میں سے کسی نے سلیمان یشکری سے کچھ سنا ہو سوائے عمرو بن دینار کے، شاید انہوں نے جابر بن عبداللہ کی زندگی ہی میں سلیمان یشکری سے حدیث سنی ہو۔ وہ کہتے ہیں کہ قتادہ، سلیمان یشکری کی کتاب سے حدیث روایت کرتے تھے، سلیمان کے پاس ایک کتاب تھی جس میں جابر بن عبداللہ سے مروی احادیث لکھی تھیں، ۳- سلیمان تمیمی کہتے ہیں: لوگ جابر بن عبداللہ کی کتاب حسن بصری کے پاس لے گئے تو انہوں نے اسے لیا یا اس کی روایت کی۔ اور لوگ اسے قتادہ کے پاس لے گئے تو انہوں نے بھی اس کی روایت کی اور میرے پاس لے کر آئے تو میں نے اس کی روایت نہیں کی میں نے اسے رد کر دیا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے بیع محاقلہ، مزابنہ ۱؎، مخابرہ ۲؎ اور معاومہ ۳؎ سے منع فرمایا، اور آپ نے عرایا ۴؎ کی اجازت دی ہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "انس رضی الله عنہ کہتے ہیں کہ ایک بار رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ( غلہ وغیرہ کا ) نرخ بڑھ گیا، تو لوگوں نے عرض کیا: اللہ کے رسول! آپ ہمارے لیے نرخ مقرر کر دیجئیے، آپ نے فرمایا: ”نرخ مقرر کرنے والا تو اللہ ہی ہے، وہی روزی تنگ کرنے والا، کشادہ کرنے والا اور کھولنے والا اور بہت روزی دینے والا ہے۔ میں چاہتا ہوں کہ اپنے رب سے اس حال میں ملوں کہ تم میں سے کوئی مجھ سے جان و مال کے سلسلے میں کسی ظلم ( کے بدلے ) کا مطالبہ کرنے والا نہ ہو“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک غلہ کے ڈھیر سے گزرے، تو آپ نے اس کے اندر اپنا ہاتھ داخل کر دیا، آپ کی انگلیاں تر ہو گئیں تو آپ نے فرمایا: ”غلہ والے! یہ کیا معاملہ ہے؟“ اس نے عرض کیا: اللہ کے رسول! بارش سے بھیگ گیا ہے، آپ نے فرمایا: ”اسے اوپر کیوں نہیں کر دیا تاکہ لوگ دیکھ سکیں“، پھر آپ نے فرمایا: ”جو دھوکہ دے ۱؎، ہم میں سے نہیں ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲ – اس باب میں ابن عمر، ابوحمراء، ابن عباس، بریدہ، ابوبردہ بن دینار اور حذیفہ بن یمان رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے۔ وہ دھوکہ دھڑی کو ناپسند کرتے ہیں اور اسے حرام کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک جوان اونٹ قرض لیا اور آپ نے اسے اس سے بہتر اونٹ دیا اور فرمایا: ”تم میں سے بہتر وہ لوگ ہیں جو قرض کی ادائیگی میں بہتر ہوں“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اسے شعبہ اور سفیان نے بھی سلمہ سے روایت کیا ہے، ۳- اس باب میں ابورافع رضی الله عنہ سے بھی روایت ہے، ۴- بعض اہل علم کا اسی پر عمل ہے، وہ کسی بھی عمر کا اونٹ قرض لینے کو مکروہ نہیں سمجھتے ہیں، ۵- اور بعض لوگوں نے اسے مکروہ جانا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے ( قرض کا ) تقاضہ کیا اور سختی کی، صحابہ نے اسے دفع کرنے کا قصد کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اسے چھوڑ دو، کیونکہ حقدار کو کہنے کا حق ہے“، پھر آپ نے فرمایا: ”اسے ایک اونٹ خرید کر دے دو“، لوگوں نے تلاش کیا تو انہیں ایسا ہی اونٹ ملا جو اس کے اونٹ سے بہتر تھا، آپ نے فرمایا: ”اسی کو خرید کر دے دو، کیونکہ تم میں بہتر وہ لوگ ہیں جو قرض کی ادائیگی میں بہتر ہوں“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "ابورافع رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک جوان اونٹ قرض لیا، پھر آپ کے پاس صدقے کا اونٹ آیا تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں اس آدمی کا اونٹ ادا کر دوں، میں نے آپ سے عرض کیا: مجھے چار دانتوں والے ایک عمدہ اونٹ کے علاوہ کوئی اور اونٹ نہیں مل رہا ہے، تو آپ نے فرمایا: ”اسے اسی کو دے دو، کیونکہ لوگوں میں سب سے اچھے وہ ہیں جو قرض کی ادائیگی میں سب سے اچھے ہوں“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ بیچنے، خریدنے اور قرض کے مطالبہ میں نرمی و آسانی کو پسند کرتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- بعض لوگوں نے اس حدیث کو بسند «عن يونس عن سعيد المقبري عن أبي هريرة» روایت کی ہے، ۳- اس باب میں جابر رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے ایک شخص کو جو تم سے پہلے تھا بخش دیا، جو نرمی کرنے والا تھا جب بیچتا اور جب خریدتا اور جب قرض کا مطالبہ کرتا“۔ امام ترمذی کہتے ہیں: یہ حدیث اس طریق سے حسن، صحیح، غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم ایسے شخص کو دیکھو جو مسجد میں خرید و فروخت کر رہا ہو تو کہو: اللہ تعالیٰ تمہاری تجارت میں نفع نہ دے، اور جب ایسے شخص کو دیکھو جو مسجد میں گمشدہ چیز ( کا اعلان کرتے ہوئے اسے ) تلاش کرتا ہو تو کہو: اللہ تمہاری چیز تمہیں نہ لوٹائے“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن غریب ہے، ۲- بعض اہل علم کا اسی پر عمل ہے، وہ مسجد میں خرید و فروخت ناجائز سمجھتے ہیں۔ یہی احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۳- بعض اہل علم نے اس میں خرید و فروخت کی رخصت دی ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 125
			}
		}
	]
}