{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"16": "The Book on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم فرمایا: ”قتل خطا ۱؎ کی دیت ۲؎ بیس بنت مخاض ۳؎، بیس ابن مخاض، بیس بنت لبون ۴؎، بیس جذعہ ۵؎ اور بیس حقہ ۶؎ ہے“۔ ہم کو ابوہشام رفاعی نے ابن ابی زائدہ اور ابوخالد احمر سے اور انہوں نے حجاج بن ارطاۃ سے اسی طرح کی حدیث بیان کی۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود رضی الله عنہ کی حدیث کو ہم صرف اسی سند سے مرفوع جانتے ہیں اور عبداللہ بن مسعود سے یہ حدیث موقوف طریقہ سے بھی آئی ہے، ۲- اس باب میں عبداللہ بن عمرو رضی الله عنہما سے بھی روایت ہے، ۳- بعض اہل علم کا یہی مسلک ہے، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ۴- اہل علم کا اس بات پر اتفاق ہے کہ دیت تین سال میں لی جائے گی، ہر سال دیت کا تہائی حصہ لیا جائے گا، ۵- اور ان کا خیال ہے کہ دیت خطا عصبہ پر ہے، ۶- بعض لوگوں کے نزدیک عصبہ وہ ہیں جو باپ کی جانب سے آدمی کے قرابت دار ہوں، مالک اور شافعی کا یہی قول ہے، ۷- بعض لوگوں کا کہنا ہے کہ عصبہ میں سے جو مرد ہیں انہی پر دیت ہے، عورتوں اور بچوں پر نہیں، ان میں سے ہر آدمی کو چوتھائی دینار کا مکلف بنایا جائے گا، ۸- کچھ لوگ کہتے ہیں: آدھے دینار کا مکلف بنایا جائے گا، ۹- اگر دیت مکمل ہو جائے گی تو ٹھیک ہے ورنہ سب سے قریبی قبیلہ کو دیکھا جائے گا اور ان کو اس کا مکلف بنایا جائے گا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1387,
			"arabicnumber": 1387,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کسی مومن کو جان بوجھ کر قتل کیا اسے مقتول کے وارثوں کے حوالے کیا جائے گا، اگر وہ چاہیں تو اسے قتل کر دیں اور چاہیں تو اس سے دیت لیں، دیت کی مقدار تیس حقہ، تیس جذعہ اور چالیس خلفہ ۱؎ ہے اور جس چیز پر وارث مصالحت کر لیں وہ ان کے لیے ہے اور یہ دیت کے سلسلہ میں سختی کی وجہ سے ہے۔ امام ترمذی کہتے ہیں: عبداللہ بن عمرو کی حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1388,
			"arabicnumber": 1388,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے دیت بارہ ہزار درہم مقرر کی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1389,
			"arabicnumber": 1389,
			"text": "ہم سے سعید بن عبدالرحمٰن المخزومی نے بیان کیا، وہ کہتے ہیں کہ ہم سے سفیان بن عیینہ نے عمرو بن دینار کے واسطے سے بیان کیا، عمرو بن دینار نے عکرمہ سے اور عکرمہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کیا ہے، لیکن انہوں نے اس روایت میں ابن عباس کا ذکر نہیں کیا، ابن عیینہ کی روایت میں محمد بن مسلم طائفی کی روایت کی بنسبت کچھ زیادہ باتیں ہیں۔ امام ترمذی کہتے ہیں: ۱- ہمارے علم میں محمد بن مسلم کے علاوہ کسی نے اس حدیث میں ”ابن عباس“ کے واسطہ کا ذکر نہیں کیا ہے، ۲- بعض اہل علم کے نزدیک اسی حدیث پر عمل ہے، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ۳- اور بعض اہل اعلم کے نزدیک دیت دس ہزار ( درہم ) ہے، سفیان ثوری اور اہل کوفہ کا یہی قول ہے، ۴- امام شافعی کہتے ہیں: ہم اصل دیت صرف اونٹ کو سمجھتے ہیں اور وہ سو اونٹ یا اس کی قیمت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1390,
			"arabicnumber": 1390,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” «موضحہ» ( ہڈی کھل جانے والے زخم ) ۱؎ میں پانچ اونٹ ہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اور اہل علم کے نزدیک اسی پر عمل ہے، سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ کا قول یہی ہے کہ «موضحہ» ( ہڈی کھل جانے والے زخم ) میں پانچ اونٹ ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": 1391,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے انگلیوں کی دیت کے بارے میں فرمایا: ”دونوں ہاتھ اور دونوں پیر برابر ہیں، ( دیت میں ) ہر انگلی کے بدلے دس اونٹ ہیں“۔ امام ترمذی کہتے ہیں: ۱- اس سند سے ابن عباس کی حدیث حسن صحیح اور غریب ہے، ۲- اہل علم کا عمل اسی پر ہے، سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ اسی کے قائل ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": 1392,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”دیت میں یہ اور یہ برابر ہیں، یعنی چھنگلیا انگوٹھا“ ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": 1393,
			"text": "ابوسفر سعید بن احمد کہتے ہیں کہ ایک قریشی نے ایک انصاری کا دانت توڑ دیا، انصاری نے معاویہ رضی الله عنہ سے فریاد کی، اور ان سے کہا: امیر المؤمنین! اس ( قریشی ) نے میرا دانت توڑ دیا ہے، معاویہ رضی الله عنہ نے کہا: ہم تمہیں ضرور راضی کریں گے، دوسرے ( یعنی قریشی ) نے معاویہ رضی الله عنہ سے بڑا اصرار کیا اور ( یہاں تک منت سماجت کی کہ ) انہیں تنگ کر دیا، معاویہ اس سے مطمئن نہ ہوئے، چنانچہ معاویہ نے اس سے کہا: تمہارا معاملہ تمہارے ساتھی کے ہاتھ میں ہے، ابو الدرداء رضی الله عنہ ان کے پاس بیٹھے ہوئے تھے، ابو الدرداء رضی الله عنہ نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا ہے، میرے کانوں نے اسے سنا ہے اور دل نے اسے محفوظ رکھا ہے، آپ فرما رہے تھے: ”جس آدمی کے بھی جسم میں زخم لگے اور وہ اسے صدقہ کر دے ( یعنی معاف کر دے ) تو اللہ تعالیٰ اسے ایک درجہ بلندی عطا کرتا ہے اور اس کا ایک گناہ معاف فرما دیتا ہے، انصاری نے کہا: رسول اللہ صلی اللہ علیہ وسلم سے آپ نے سنا ہے؟ ابو الدرداء نے کہا: میرے دونوں کانوں نے سنا ہے اور میرے دل نے اسے محفوظ رکھا ہے، اس نے کہا: تو میں اس کی دیت معاف کر دیتا ہوں، معاویہ رضی الله عنہ نے کہا: لیکن میں تمہیں محروم نہیں کروں گا، چنانچہ انہوں نے اسے کچھ مال دینے کا حکم دیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہمیں یہ صرف اسی سند سے معلوم ہے، مجھے نہیں معلوم کہ ابوسفر نے ابو الدرداء سے سنا ہے، ۲- ابوسفر کا نام سعید بن احمد ہے، انہیں ابن یحمد ثوری بھی کہا جاتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": 1394,
			"text": "انس رضی الله عنہ کہتے ہیں کہ ایک لڑکی زیور پہنے ہوئے کہیں جانے کے لیے نکلی، ایک یہودی نے اسے پکڑ کر پتھر سے اس کا سر کچل دیا اور اس کے پاس جو زیور تھے وہ اس سے چھین لیا، پھر وہ لڑکی ایسی حالت میں پائی گئی کہ اس میں کچھ جان باقی تھی، چنانچہ اسے نبی اکرم صلی اللہ علیہ وسلم کے پاس لایا گیا، آپ نے اس سے پوچھا: ”تمہیں کس نے مارا ہے، فلاں نے؟“ اس نے سر سے اشارہ کیا: نہیں، آپ نے پوچھا: ”فلاں نے؟“ یہاں تک کہ اس یہودی کا نام لیا گیا ( جس نے اس کا سر کچلا تھا ) تو اس نے اپنے سر سے اشارہ کیا یعنی ہاں! تو یہودی پکڑا گیا، اور اس نے اعتراف جرم کر لیا، پھر رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا، اور اس کا سر دو پتھروں کے درمیان کچل دیا گیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور اہل علم کے نزدیک اسی پر عمل ہے، احمد اور اسحاق بن راہویہ کا یہی قول ہے، بعض اہل علم کہتے ہیں: قصاص صرف تلوار سے لیا جائے گا ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1395,
			"arabicnumber": 1395,
			"text": "عبداللہ بن عمرو کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”دنیا کی بربادی اللہ کے نزدیک ایک مسلمان کے قتل ہونے سے کہیں زیادہ کمتر و آسان ہے“۔ امام ترمذی کہتے ہیں: ۱- ہم سے محمد بن بشار نے بسند «محمد بن جعفر حدثنا شعبة عن يعلى بن عطاء عن أبيه عن عبد الله بن عمرو» اسی طرح روایت کی ہے، لیکن انہوں نے اسے مرفوع نہیں کیا ہے، ۲- یہ روایت ابن ابی عدی کی روایت کے بالمقابل زیادہ صحیح ہے ( یعنی موقوف ہونا زیادہ صحیح ہے ) ، ۳- عبداللہ بن عمرو رضی الله عنہما کی حدیث کو ابن ابی عدی نے شعبہ سے، بسند «يعلى بن عطاء عن أبيه عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم» اسی طرح روایت کیا ہے، جب کہ محمد بن جعفر اور ان کے علاوہ دوسروں نے شعبہ سے بسند «يعلى بن عطاء» روایت کیا ہے، لیکن انہوں نے اسے مرفوع نہیں کیا ہے، اسی طرح سفیان ثوری نے یعلیٰ بن عطاء سے موقوفا روایت کی ہے اور یہ ( موقوف روایت ابن ابی عدی کی ) مرفوع حدیث سے زیادہ صحیح ہے، ۴- اس باب میں سعد، ابن عباس، ابوسعید، ابوہریرہ، عقبہ بن عامر، ابن مسعود اور بریدہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": 1396,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( آخرت میں ) بندوں کے درمیان سب سے پہلے خون کے بارے میں فیصلہ کیا جائے گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عبداللہ کی حدیث حسن صحیح ہے، اسی طرح کئی لوگوں نے اعمش سے مرفوعاً روایت کی ہے، ۲- اور بعض نے اعمش سے روایت کی ہے ان لوگوں نے اسے مرفوع نہیں کہا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( آخرت میں ) بندوں کے درمیان سب سے پہلے خون کا فیصلہ کیا جائے گا“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "ابو سعید خدری اور ابوہریرہ رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر آسمان اور زمین والے ( سارے کے سارے ) ایک مومن کے خون میں ملوث ہو جائیں تو اللہ ان ( سب ) کو اوندھے منہ جہنم میں ڈال دے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1399,
			"arabicnumber": 1399,
			"text": "سراقہ بن مالک بن جعشم رضی الله عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، ( تو دیکھا ) کہ آپ باپ کو بیٹے سے قصاص دلواتے تھے اور بیٹے کو باپ سے قصاص نہیں دلواتے تھے ۱؎۔ امام ترمذی کہتے ہیں: ۱- سراقہ رضی الله عنہ کی اس حدیث کو ہم صرف اسی سند سے جانتے ہیں۔ اس کی سند صحیح نہیں ہے، اسے اسماعیل بن عیاش نے مثنیٰ بن صباح سے روایت کی ہے اور مثنیٰ بن صباح حدیث میں ضعیف گردانے جاتے ہیں، ۲- اس حدیث کو ابوخالد اُحمر نے بطریق: «عن الحجاج بن أرطاة عن عمرو بن شعيب عن أبيه عن جده عن عمر عن النبي صلى الله عليه وسلم» روایت کیا ہے، ۴- یہ حدیث عمرو بن شعیب سے مرسلاً بھی مروی ہے، اس حدیث میں اضطراب ہے، ۴- اہل علم کا عمل اسی پر ہے کہ باپ جب اپنے بیٹے کو قتل کر دے تو بدلے میں ( قصاصاً ) اسے قتل نہیں کیا جائے گا اور جب باپ اپنے بیٹے پر ( زنا کی ) تہمت لگائے تو اس پر حد قذف نافذ نہیں ہو گی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "عمر بن خطاب رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”باپ سے بیٹے کا قصاص نہیں لیا جائے گا“ ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مسجدوں میں حدود نہیں قائم کی جائیں گی اور بیٹے کے بدلے باپ کو ( قصاص میں ) قتل نہیں کیا جائے گا“۔ امام ترمذی کہتے ہیں: اس سند سے اس حدیث کو ہم صرف اسماعیل بن مسلم کی روایت سے مرفوع جانتے ہیں اور اسماعیل بن مسلم مکی کے حفظ کے سلسلے میں بعض اہل علم نے کلام کیا ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی مسلمان شخص کا خون جو اس بات کی گواہی دیتا ہو کہ اللہ کے سوا کوئی معبود برحق نہیں اور میں اللہ کا رسول ہوں، حلال نہیں سوائے تین باتوں میں سے کسی ایک کے: یا تو وہ شادی شدہ زانی ہو، یا جان کو جان کے بدلے مارا جائے، یا وہ اپنا دین چھوڑ کر جماعت مسلمین سے الگ ہو گیا ہو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عثمان، عائشہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”خبردار! جس نے کسی ایسے ذمی ۱؎ کو قتل کیا جسے اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی پناہ حاصل تھی تو اس نے اللہ کے عہد کو توڑ دیا، لہٰذا وہ جنت کی خوشبو نہیں پا سکے گا، حالانکہ اس کی خوشبو ستر سال کی مسافت ( دوری ) سے آئے گی“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- نبی اکرم صلی اللہ علیہ وسلم سے ابوہریرہ کی حدیث کئی سندوں سے مروی ہے، ۳- اس باب میں ابوبکرہ رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے قبیلہ عامر کے دو آدمیوں کو مسلمانوں کے برابر دیت دی، ( کیونکہ ) ان دونوں کا رسول اللہ صلی اللہ علیہ وسلم سے عہد و پیمان تھا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، اسے ہم صرف اسی سند سے جانتے ہیں، ۲- حدیث کے راوی ابوسعد بقال کا نام سعید بن مرزبان ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ جب اللہ نے اپنے رسول کے لیے مکہ کو فتح کر دیا تو آپ صلی اللہ علیہ وسلم نے لوگوں میں کھڑے ہو کر اللہ کی حمد و ثنا بیان کی، پھر فرمایا: ”جس کا کوئی شخص مارا گیا ہو اسے دو باتوں میں سے کسی ایک کا اختیار ہے: یا تو معاف کر دے یا ( قصاص میں ) اسے قتل کرے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے ( کماسیأتی ) ، ۲- اس باب میں وائل بن حجر، انس، ابوشریح اور خویلد بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "ابوشریح کعبی رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مکہ کو اللہ نے حرمت والا ( محترم ) بنایا ہے، لوگوں نے اسے نہیں بنایا، پس جو شخص اللہ اور یوم آخرت پر ایمان رکھتا ہو وہ اس میں خونریزی نہ کرے، نہ اس کا درخت کاٹے، ( اب ) اگر کوئی ( خونریزی کے لیے ) اس دلیل سے رخصت نکالے کہ مکہ رسول اللہ صلی اللہ علیہ وسلم کے لیے حلال کیا گیا تھا ( تو اس کا یہ استدلال باطل ہے ) اس لیے کہ اللہ نے اسے میرے لیے حلال کیا تھا لوگوں کے لیے نہیں، اور میرے لیے بھی دن کے ایک خاص وقت میں حلال کیا گیا تھا، پھر وہ تاقیامت حرام ہے؟ اے خزاعہ والو! تم نے ہذیل کے اس آدمی کو قتل کیا ہے، میں اس کی دیت ادا کرنے والا ہوں، ( سن لو ) آج کے بعد جس کا بھی کوئی آدمی مارا جائے گا تو مقتول کے ورثاء کو دو چیزوں میں سے کسی ایک کا اختیار ہو گا: یا تو وہ ( اس کے بدلے ) اسے قتل کر دیں، یا اس سے دیت لے لیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ابوہریرہ رضی الله عنہ کی حدیث بھی حسن صحیح ہے، ۲- اسے شیبان نے بھی یحییٰ بن ابی کثیر سے اسی کے مثل روایت کیا ہے، ۳- اور یہ ( حدیث بنام ابوشریح کعبی کی جگہ بنام ) ابوشریح خزاعی بھی روایت کی گئی ہے۔ ( اور یہ دونوں ایک ہی ہیں ) اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، آپ نے فرمایا: ”جس کا کوئی آدمی مارا جائے تو اسے اختیار ہے یا تو وہ اس کے بدلے اسے قتل کر دے، یا معاف کر دے، یا دیت وصول کرے“، ۴- بعض اہل علم اسی طرف گئے ہیں، احمد اور اسحاق بن راہویہ کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک آدمی قتل کر دیا گیا، تو قاتل مقتول کے ولی ( وارث ) کے سپرد کر دیا گیا، قاتل نے عرض کیا: اللہ کے رسول! اللہ کی قسم! میں نے اسے قصداً قتل نہیں کیا ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”خبردار! اگر وہ ( قاتل ) اپنے قول میں سچا ہے پھر بھی تم نے اسے قتل کر دیا تو تم جہنم میں جاؤ گے ۱؎“، چنانچہ مقتول کے ولی نے اسے چھوڑ دیا، وہ آدمی رسی سے بندھا ہوا تھا، تو وہ رسی گھسیٹتا ہوا باہر نکلا، اس لیے اس کا نام ذوالنسعہ ( رسی یا تسمے والا ) رکھ دیا گیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور «نسعہ» : رسی کو کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "بریدہ رضی الله عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم کسی لشکر پر امیر مقرر کر کے بھیجتے تو خاص طور سے اسے اپنے بارے میں اللہ سے ڈرنے کی وصیت فرماتے، اور جو مسلمان اس کے ساتھ ہوتے انہیں بھلائی کی وصیت کرتے، چنانچہ آپ نے فرمایا: ”اللہ کے نام سے اس کے راستے میں جہاد کرو، جو کفر کرے اس سے لڑو، جہاد کرو، مگر مال غنیمت میں خیانت نہ کرو، بدعہدی نہ کرو، مثلہ ۱؎ نہ کرو اور نہ کسی بچے کو قتل کرو“، حدیث میں کچھ تفصیل ہے ۲؎۔ امام ترمذی کہتے ہیں: ۱- بریدہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن مسعود، شداد بن اوس، عمران بن حصین، انس، سمرہ، مغیرہ، یعلیٰ بن مرہ اور ابوایوب سے بھی احادیث آئی ہیں، ۳- اہل علم نے مثلہ کو حرام کہا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"text": "شداد بن اوس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بیشک اللہ نے ہر کام کو اچھے طریقے سے کرنا ضروری قرار دیا ہے، لہٰذا جب تم قتل ۱؎ کرو تو اچھے طریقے سے قتل کرو، اور جب تم ذبح کرو تو اچھے طریقے سے ذبح کرو، تمہارے ہر آدمی کو چاہیئے کہ اپنی چھری تیز کر لے اور اپنے ذبیحہ کو آرام پہنچائے“ ۲؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے «جنين» ( حمل ) کی دیت میں «غرة» یعنی غلام یا لونڈی ( دینے ) کا فیصلہ کیا، جس کے خلاف فیصلہ کیا گیا تھا وہ کہنے لگا: کیا ایسے کی دیت دی جائے گی، جس نے نہ کچھ کھایا نہ پیا، نہ چیخا، نہ آواز نکالی، اس طرح کا خون تو ضائع اور باطل ہو جاتا ہے، ( یہ سن کر ) نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”یہ شاعروں والی بات کر رہا ہے ۱؎، «جنين» ( حمل گرا دینے ) کی دیت میں «غرة» یعنی غلام یا لونڈی دینا ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں حمل بن مالک بن نابغہ اور مغیرہ بن شعبہ سے احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے، ۴- غرہ کی تفسیر بعض اہل علم نے، غلام، لونڈی یا پانچ سو درہم سے کی ہے، ۵- اور بعض اہل علم کہتے ہیں: «غرة» سے مراد گھوڑا یا خچر ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "مغیرہ بن شعبہ رضی الله عنہ کہتے ہیں کہ دو عورتیں سوکن تھیں، ان میں سے ایک نے دوسری کو پتھر یا خیمے کی میخ ( گھونٹی ) سے مارا، تو اس کا حمل ساقط ہو گیا، رسول اللہ صلی اللہ علیہ وسلم نے اس حمل کی دیت میں «غرة» یعنی غلام یا لونڈی دینے کا فیصلہ فرمایا اور دیت کی ادائیگی اس عورت کے عصبہ کے ذمہ ٹھہرائی ۱؎۔ حسن بصری کہتے ہیں: زید بن حباب نے سفیان ثوری سے روایت کی، اور سفیان ثوری نے منصور سے اس حدیث کو اسی طرح روایت کی ہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "ابوجحیفہ کہتے ہیں کہ میں نے علی رضی الله عنہ سے پوچھا کیا ۱؎: امیر المؤمنین! کیا آپ کے پاس کاغذ میں لکھی ہوئی کوئی ایسی تحریر ہے جو قرآن میں نہیں ہے؟ انہوں نے کہا: نہیں، اس ذات کی قسم جس نے دانے کو پھاڑا اور جان کو پیدا کیا! میں سوائے اس فہم و بصیرت کے جسے اللہ تعالیٰ قرآن کے سلسلہ میں آدمی کو نوازتا ہے اور اس صحیفہ میں موجود چیز کے کچھ نہیں جانتا، میں نے پوچھا: صحیفہ میں کیا ہے؟ کہا: اس میں دیت، قید یوں کے آزاد کرنے کا ذکر اور آپ کا یہ فرمان ہے: ”مومن کافر کے بدلے قتل نہیں کیا جائے گا“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- علی رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو رضی الله عنہما سے بھی روایت ہے، ۳- بعض اہل علم کے نزدیک اسی پر عمل ہے، سفیان ثوری، مالک بن انس، شافعی، احمد اور اسحاق بن راہویہ کا یہی قول ہے، یہ لوگ کہتے ہیں: مومن کافر کے بدلے نہیں قتل کیا جائے گا، ۴- اور بعض اہل علم کہتے ہیں: ذمی کے بدلے بطور قصاص مسلمان کو قتل کیا جائے گا، لیکن پہلا قول زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان کافر کے بدلے قصاص میں قتل نہیں کیا جائے گا“، اور اسی سند سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کافر کی دیت مومن کی دیت کا نصف ہے“۔ امام ترمذی کہتے ہیں: ۱- اس باب میں عبداللہ بن عمرو رضی الله عنہما کی حدیث حسن ہے، ۲- یہودی اور نصرانی کی دیت میں اہل علم کا اختلاف ہے، یہودی اور نصرانی کی دیت کی بابت بعض اہل علم کا مسلک نبی اکرم صلی اللہ علیہ وسلم سے مروی حدیث کے موافق ہے، ۳- عمر بن عبدالعزیز کہتے ہیں: یہودی اور نصرانی کی دیت مسلمان کی دیت کا نصف ہے، احمد بن حنبل اسی کے قائل ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "سمرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو اپنے غلام کو قتل کرے گا ہم بھی اسے قتل کر دیں گے اور جو اپنے غلام کا کان، ناک کاٹے گا ہم بھی اس کا کان، ناک کاٹیں گے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- تابعین میں سے بعض اہل علم کا یہی مسلک ہے، ابراہیم نخعی اسی کے قائل ہیں، ۳- بعض اہل علم مثلاً حسن بصری اور عطا بن ابی رباح وغیرہ کہتے ہیں: آزاد اور غلام کے درمیان قصاص نہیں ہے، ( نہ قتل کرنے میں، نہ ہی قتل سے کم زخم پہنچانے ) میں، احمد اور اسحاق بن راہویہ کا یہی قول ہے، ۴- بعض اہل علم کہتے ہیں: اگر کوئی اپنے غلام کو قتل کر دے تو اس کے بدلے اسے قتل نہیں کیا جائے گا، اور جب دوسرے کے غلام کو قتل کرے گا تو اسے اس کے بدلے میں قتل کیا جائے گا، سفیان ثوری اور اہل کوفہ کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"text": "سعید بن مسیب سے روایت ہے کہ عمر رضی الله عنہ کہتے تھے: دیت کی ادائیگی عاقلہ ۱؎ پر ہے، اور بیوی اپنے شوہر کی دیت سے میراث میں کچھ نہیں پائے گی، یہاں تک کہ ان کو ضحاک بن سفیان کلابی نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں ایک فرمان لکھا تھا: ”اشیم ضبابی کی بیوی کو اس کے شوہر کی دیت سے میراث دو“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اسی پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ ایک آدمی نے ایک آدمی کا ہاتھ کاٹ کھایا، اس نے اپنا ہاتھ کھینچا تو دانت کاٹنے والے کے دونوں اگلے دانت ٹوٹ گئے، وہ دونوں نبی اکرم صلی اللہ علیہ وسلم کے پاس اپنا معاملہ لے گئے تو آپ نے فرمایا: ”تم میں سے کوئی اپنے بھائی کو اونٹ کے کاٹنے کی طرح کاٹ کھاتا ہے، تمہارے لیے کوئی دیت نہیں، پھر اللہ نے یہ آیت نازل کی: «والجروح قصاص» ۱؎۔ امام ترمذی کہتے ہیں: ۱- عمران بن حصین رضی الله عنہ کی حدیث حسن صحیح ہے، ۲ – اس باب میں یعلیٰ بن امیہ اور سلمہ بن امیہ رضی الله عنہما سے بھی احادیث آئی ہیں اور یہ دونوں بھائی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "معاویہ بن حیدہ قشیری رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک آدمی کو تہمت ۱؎ کی بنا پر قید کیا، پھر ( الزام ثابت نہ ہونے پر ) اس کو رہا کر دیا۔ امام ترمذی کہتے ہیں: ۱- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے، ۲- بہز بن حکیم بن معاویہ بن حیدۃ قشیری کی حدیث جسے وہ اپنے باپ سے اور وہ ان کے دادا سے روایت کرتے ہیں، حسن ہے، ۳- اسماعیل بن ابراہیم ابن علیہ نے بہز بن حکیم سے یہ حدیث اس سے زیادہ مکمل اور مطول روایت کی ہے ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "سعید بن زید رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو اپنے مال کی حفاظت کرتے ہوئے مارا جائے وہ شہید ہے ۱؎ اور جس نے ایک بالشت بھی زمین چرائی قیامت کے دن اسے سات زمینوں کا طوق پہنایا جائے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس حدیث میں حاتم بن سیاہ مروزی نے اضافہ کیا ہے، معمر کہتے ہیں: زہری سے مجھے حدیث پہنچی ہے، لیکن میں نے ان سے نہیں سنا کہ انہوں نے اس حدیث یعنی «من قتل دون ماله فهو شهيد» ”جو اپنے مال کی حفاظت کرتے ہوئے مارا جائے وہ شہید ہے“ میں کچھ اضافہ کیا ہو، اسی طرح شعیب بن ابوحمزہ نے یہ حدیث بطریق: «الزهري عن طلحة بن عبد الله عن عبدالرحمٰن بن عمرو بن سهل عن سعيد بن زيد عن النبي صلى الله عليه وسلم» روایت کی ہے، نیز سفیان بن عیینہ نے بطریق: «الزهري عن طلحة بن عبد الله عن سعيد بن زيد عن النبي صلى الله عليه وسلم» روایت کی ہے، اس میں سفیان نے عبدالرحمٰن بن عمرو بن سہل کا ذکر نہیں کیا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "عبداللہ بن عمرو رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو اپنے مال کی حفاظت کرتے ہوئے مارا جائے وہ شہید ہے“۔ امام ترمذی کہتے ہیں: ۱- عبداللہ بن عمرو رضی الله عنہما کی حدیث حسن ہے، یہ دوسری سندوں سے بھی ان سے مروی ہے ۲- بعض اہل علم نے آدمی کو اپنی جان و مال کی حفاظت کے لیے دفاع کی اجازت دی ہے، ۳- اس باب میں علی، سعید بن زید، ابوہریرہ، ابن عمر، ابن عباس اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- عبداللہ بن مبارک کہتے ہیں: آدمی اپنے مال کی حفاظت کے لیے دفاع کرے خواہ اس کا مال دو درہم ہی کیوں نہ ہو ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس آدمی کا مال ناحق چھینا جائے اور وہ اس کی حفاظت کے لیے دفاع کرتا ہوا مارا جائے تو وہ شہید ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔ اس سند سے بھی عبداللہ بن عمرو بن العاص رضی الله عنہما نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "سعید بن زید رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”جو اپنے مال کی حفاظت کرتے ہوئے قتل کیا جائے وہ شہید ہے، جو اپنے دین کی حفاظت کرتے ہوئے قتل کیا جائے وہ شہید ہے، جو اپنی جان کی حفاظت کی خاطر مارا جائے وہ شہید ہے اور جو اپنے اہل و عیال کی حفاظت کرتے ہوئے قتل کیا جائے وہ شہید ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ابراہیم بن سعد سے کئی راویوں نے اسی جیسی حدیث روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "سہل بن ابو حثمہ اور رافع بن خدیج رضی الله عنہما کہتے ہیں کہ عبداللہ بن سہل بن زید اور محیصہ بن مسعود بن زید رضی الله عنہما کہیں جانے کے لیے گھر سے روانہ ہوئے، جب وہ خیبر پہنچے تو الگ الگ راستوں پر ہو گئے، پھر محیصہ نے عبداللہ بن سہل کو مقتول پایا، کسی نے ان کو قتل کر دیا تھا، آپ نے انہیں دفنا دیا، پھر وہ ( یعنی راوی حدیث ) حویصہ بن مسعود اور عبدالرحمٰن بن سہل رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے، عبدالرحمٰن بن سہل ان میں سب سے چھوٹے تھے، وہ اپنے دونوں ساتھیوں سے پہلے ( اس معاملہ میں آپ سے ) گفتگو کرنا چاہتے تھے، رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: ”بڑے کا لحاظ کرو، لہٰذا وہ خاموش ہو گئے اور ان کے دونوں ساتھیوں نے گفتگو کی، پھر وہ بھی ان دونوں کے ساتھ شریک گفتگو ہو گئے، ان لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے عبداللہ بن سہل کے قتل کا واقعہ بیان کیا، آپ نے ان سے فرمایا: ”کیا تم لوگ پچاس قسمیں کھاؤ گے ( کہ فلاں نے اس کو قتل کیا ہے ) تاکہ تم اپنے ساتھی کے خون بہا کے مستحق ہو جاؤ ( یا کہا ) قاتل کے خون کے مستحق ہو جاؤ؟“ ان لوگوں نے عرض کیا: ہم قسم کیسے کھائیں جب کہ ہم حاضر نہیں تھے؟ آپ نے فرمایا: ”تو یہود پچاس قسمیں کھا کر تم سے بری ہو جائیں گے“، ان لوگوں نے کہا: ہم کافر قوم کی قسم کیسے قبول کر لیں؟ پھر رسول اللہ صلی اللہ علیہ وسلم نے جب یہ معاملہ دیکھا تو ان کی دیت ۱؎ خود ادا کر دی۔ اس سند سے بھی سہل بن ابو حثمہ اور رافع بن خدیج سے اسی طرح اسی معنی کی حدیث مروی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- قسامہ کے سلسلہ میں بعض اہل علم کا اسی حدیث پر عمل ہے، ۳- مدینہ کے بعض فقہاء قسامہ ۲؎ کی بنا پر قصاص درست سمجھتے ہیں، ۴- کوفہ کے بعض اہل علم اور کچھ دوسرے لوگ کہتے ہیں: قسامہ کی بنا پر قصاص واجب نہیں، صرف دیت واجب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 39
			}
		}
	]
}