{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"20": "The Book on Vows and Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”معصیت کے کاموں میں نذر جائز نہیں ہے، اور اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح نہیں ہے، اس لیے کہ زہری نے اس کو ابوسلمہ سے نہیں سنا ہے، ۲- میں نے محمد بن اسماعیل بخاری کو یہ کہتے ہوئے سنا ہے کہ اس حدیث کو کئی لوگوں نے روایت کیا ہے، انہیں میں موسیٰ بن عقبہ اور ابن ابی عتیق ہیں، ان دونوں نے زہری سے بطریق: «سليمان بن أرقم عن يحيى بن أبي كثير عن أبي سلمة عن عائشة عن النبي صلى الله عليه وسلم» روایت کی ہے، محمد بن اسماعیل بخاری کہتے ہیں: وہ حدیث یہی ہے ( اور آگے آ رہی ہے ) ، ۳- اس باب میں ابن عمر، جابر اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ کی معصیت پر مبنی کوئی نذر جائز نہیں ہے، اور اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اور ابوصفوان کی اس حدیث سے جسے وہ یونس سے روایت کرتے ہیں، زیادہ صحیح ہے، ۳- ابوصفوان مکی ہیں، ان کا نام عبداللہ بن سعید بن عبدالملک بن مروان ہے، ان سے حمیدی اور کئی بڑے بڑے محدثین نے روایت کی ہے، ۴- اہل علم صحابہ کی ایک جماعت اور دوسرے لوگ کہتے ہیں: اللہ کی معصیت کے سلسلے میں کوئی نذر نہیں ہے اور اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے، احمد اور اسحاق کا یہی قول ہے، ان دونوں نے زہری کی اس حدیث سے استدلال کیا ہے جسے وہ ابوسلمہ سے اور ابوسلمہ عائشہ سے روایت کرتے ہیں، ۵- بعض اہل علم صحابہ اور دوسرے لوگ کہتے ہیں: معصیت میں کوئی نذر جائز نہیں ہے، اور اس میں کوئی کفارہ بھی نہیں، مالک اور شافعی کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص نذر مانے کہ وہ اللہ کی اطاعت کرے گا تو وہ اللہ کی اطاعت کرے، اور جو شخص نذر مانے کہ وہ اللہ کی نافرمانی کرے گا تو وہ اللہ کی نافرمانی نہ کرے“۔ اس سند سے بھی عائشہ رضی الله عنہا سے اسی جیسی حدیث مروی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسے یحییٰ بن ابی کثیر نے بھی قاسم بن محمد سے روایت کیا ہے، ۳- بعض اہل علم صحابہ اور دوسرے لوگوں کا یہی قول ہے، مالک اور شافعی کا بھی یہی قول ہے، یہ لوگ کہتے ہیں کہ اللہ کی نافرمانی نہ کرے اور جب نذر اللہ کی نافرمانی کی بابت ہو تو اس میں قسم کا کفارہ نہیں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "ثابت بن ضحاک رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بندہ کے اختیار میں جو چیز نہیں ہے اس میں نذر صحیح نہیں ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": 1528,
			"text": "عقبہ بن عامر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”غیر متعین نذر کا کفارہ وہی ہے جو قسم کا کفارہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "عبدالرحمٰن بن سمرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عبدالرحمٰن! منصب امارت کا مطالبہ نہ کرو، اس لیے کہ اگر تم نے اسے مانگ کر حاصل کیا تو تم اسی کے سپرد کر دیئے جاؤ گے ۱؎، اور اگر وہ تمہیں بن مانگے ملی تو اللہ کی مدد و توفیق تمہارے شامل ہو گی، اور جب تم کسی کام پر قسم کھاؤ پھر دوسرے کام کو اس سے بہتر سمجھو تو جسے تم بہتر سمجھتے ہو اسے ہی کرو اور اپنی قسم کا کفارہ ادا کر دو“۔ امام ترمذی کہتے ہیں: ۱- عبدالرحمٰن بن سمرہ کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، جابر، عدی بن حاتم، ابو الدرداء، انس، عائشہ، عبداللہ بن عمرو، ابوہریرہ، ام سلمہ اور ابوموسیٰ اشعری رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو آدمی کسی امر پر قسم کھائے، اور اس کے علاوہ کام کو اس سے بہتر سمجھے تو وہ اپنی قسم کا کفارہ ادا کرے اور وہ کام کرے ( جسے وہ بہتر سمجھتا ہے ) “۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ام سلمہ رضی الله عنہا سے بھی روایت ہے، ۳- اکثر اہل علم صحابہ اور دیگر لوگوں کا اسی پر عمل ہے کہ قسم توڑنے سے پہلے کفارہ ادا کرنا صحیح ہے، مالک بن انس، شافعی، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ۴- بعض اہل علم کہتے ہیں: «حانث» ہونے ( یعنی قسم توڑنے ) کے بعد ہی کفارہ ادا کیا جائے گا، ۵- سفیان ثوری کہتے ہیں: اگر کوئی «حانث» ہونے ( یعنی قسم توڑنے ) کے بعد کفارہ ادا کرے تو میرے نزدیک زیادہ اچھا ہے اور اگر «حانث» ہونے سے پہلے کفارہ ادا کرے تو بھی درست ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کسی امر پر قسم کھائی اور ساتھ ہی ان شاءاللہ کہا، تو اس قسم کو توڑنے کا کفارہ نہیں ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن ہے، ۲- اس حدیث کو عبیداللہ بن عمرو وغیرہ نے نافع سے، نافع نے ابن عمر سے موقوفا روایت کیا ہے، اسی طرح اس حدیث کو سالم بن علیہ نے ابن عمر رضی الله عنہما سے موقوفاً روایت کی ہے، ہمیں نہیں معلوم کہ ایوب سختیانی کے سوا کسی اور نے بھی اسے مرفوعاً روایت کیا ہے، اسماعیل بن ابراہیم کہتے ہیں: ایوب اس کو کبھی مرفوعاً روایت کرتے تھے اور کبھی مرفوعاً نہیں روایت کرتے تھے، ۳- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے، ۴- اکثر اہل علم صحابہ اور دوسرے لوگوں کا اسی پر عمل ہے کہ جب قسم کے ساتھ «إن شاء اللہ» کا جملہ ملا ہو تو اس قسم کو توڑنے کا کفارہ نہیں ہے، سفیان ثوری، اوزاعی، مالک بن انس، عبداللہ بن مبارک، شافعی، احمد اور اسحاق کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے قسم کھائی اور ان شاءاللہ کہا، وہ «حانث» نہیں ہوا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- میں نے محمد بن اسماعیل بخاری سے اس حدیث کے بارے میں سوال کیا تو انہوں نے کہا: اس حدیث میں غلطی ہے، اس میں عبدالرزاق سے غلطی ہوئی ہے، انہوں نے اس کو معمر کی حدیث سے اختصار کر دیا ہے، معمر اس کو بسند «ابن طاؤس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم» روایت کرتے ہیں کہ آپ نے فرمایا: ”سلیمان بن داود علیہما السلام نے کہا: ( اللہ کی قسم! ) آج رات میں ستر بیویوں کے پاس ضرور جاؤں گا، ہر عورت سے ایک لڑکا پیدا ہو گا، وہ ستر بیویوں کے پاس گئے، ان میں سے کسی عورت نے بچہ نہیں جنا، صرف ایک عورت نے آدھے ( ناقص ) بچے کو جنم دیا“، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر انہوں ( سلیمان علیہ السلام ) نے «إن شاء اللہ» کہہ دیا ہوتا تو ویسے ہی ہوتا جیسا انہوں نے کہا تھا“، اسی طرح یہ حدیث پوری تفصیل کے ساتھ عبدالرزاق سے آئی ہے، عبدالرزاق نے بسند «معمر عن ابن طاؤس عن أبيه» روایت کی ہے اس میں «على سبعين امرأة» کے بجائے «سبعين امرأة» ہے، یہ حدیث ابوہریرہ رضی الله عنہ سے دیگر سندوں سے آئی ہے، ( اس میں یہ ہے کہ ) وہ نبی کرم صلی اللہ علیہ وسلم سے ( یوں ) روایت کرتے ہیں کہ آپ نے فرمایا: ”سلیمان بن داود نے کہا: آج رات میں سو بیویوں کے پاس ضرور جاؤں گا“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے عمر رضی الله عنہ کو کہتے سنا: میرے باپ کی قسم! میرے باپ کی قسم! آپ نے ( انہیں بلا کر ) فرمایا: ”سنو! اللہ نے تمہیں اپنے باپ دادا کی قسم کھانے سے منع فرمایا ہے“، عمر رضی الله عنہ کہتے ہیں: اللہ کی قسم اس کے بعد میں نے ( باپ دادا کی ) قسم نہیں کھائی، نہ جان بوجھ کر اور نہ ہی کسی کی بات نقل کرتے ہوئے۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث حسن صحیح ہے، ۲- اس باب میں ثابت بن ضحاک، ابن عباس، ابوہریرہ، قتیلہ اور عبدالرحمٰن بن سمرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- ابو عبید کہتے ہیں کہ عمر کے قول «ولا آثرا» کے یہ معنی ہیں «لم آثره عن غيري» ( میں نے دوسرے کی طرف سے بھی نقل نہیں کیا ) عرب اس جملہ کو «لم أذكره عن غيري» کے معنی میں استعمال کرتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے عمر رضی الله عنہ کو ایک قافلہ میں پایا، وہ اپنے باپ کی قسم کھا رہے تھے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بیشک اللہ تم لوگوں کو باپ، دادا کی قسم کھانے سے منع فرماتا ہے، قسم کھانے والا اللہ کی قسم کھائے ورنہ چپ چاپ رہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "سعد بن عبیدہ سے روایت ہے کہ ابن عمر رضی الله عنہما نے ایک آدمی کو کہتے سنا: ایسا نہیں قسم ہے کعبہ کی، تو اس سے کہا: غیر اللہ کی قسم نہ کھائی جائے، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”جس نے غیر اللہ کی قسم کھائی اس نے کفر کیا یا شرک کیا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اس حدیث کی تفسیر بعض اہل علم کے نزدیک یہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم کا فرمان «فقد كفر أو أشرك» تنبیہ و تغلیظ کے طور پر ہے، اس کی دلیل ابن عمر رضی الله عنہما کی حدیث ہے، نبی اکرم صلی اللہ علیہ وسلم نے عمر کو کہتے سنا: میرے باپ کی قسم، میرے باپ کی قسم! تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ باپ، دادا کی قسم کھانے سے منع فرماتا ہے“، نیز ابوہریرہ رضی الله عنہ کی ( روایت ) کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے لات اور عزیٰ کی قسم کھائی وہ «لا إله إلا الله» کہے، امام ترمذی کہتے ہیں: ۳- یہ نبی اکرم صلی اللہ علیہ وسلم کے اس فرمان کی طرح ہے ”بیشک ریا، شرک ہے، ۴- بعض اہل علم نے آیت کریمہ «فمن كان يرجو لقاء ربه فليعمل عملا صالحا» ( الکہف: ۱۱۰ ) کی یہ تفسیر کی ہے کہ وہ ریا نہ کرے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "انس رضی الله عنہ کہتے ہیں کہ ایک عورت نے نذر مانی کہ وہ بیت اللہ تک ( پیدل ) چل کر جائے گی، نبی اکرم صلی اللہ علیہ وسلم سے اس سلسلے میں سوال کیا گیا تو آپ نے فرمایا: ”اللہ تعالیٰ اس کے ( پیدل ) چلنے سے بے نیاز ہے، اسے حکم دو کہ وہ سوار ہو کر جائے“۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث اس سند سے حسن صحیح غریب ہے، ۲- اس باب میں ابوہریرہ، عقبہ بن عامر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے، یہ لوگ کہتے ہیں کہ جب عورت ( حج کو پیدل ) چل کر جانے کی نذر مان لے تو وہ سوار ہو جائے اور ایک بکری دم میں دے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "انس رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم ایک بوڑھے کے قریب سے گزرے جو اپنے دو بیٹوں کے سہارے ( حج کے لیے ) چل رہا تھا، آپ نے پوچھا: کیا معاملہ ہے ان کا؟ لوگوں نے کہا: اللہ کے رسول! انہوں نے ( پیدل ) چلنے کی نذر مانی ہے، آپ نے فرمایا: ”اللہ عزوجل اس کے اپنی جان کو عذاب دینے سے بے نیاز ہے“، پھر آپ نے اس کو سوار ہونے کا حکم دیا۔ اس سند سے بھی انس رضی الله عنہ سے اسی جیسی حدیث مروی ہے۔ اور یہ صحیح حدیث ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نذر مت مانو، اس لیے کہ نذر تقدیر کے سامنے کچھ کام نہیں آتی، صرف بخیل اور کنجوس کا مال اس طریقہ سے نکال لیا جاتا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے، ۳- بعض اہل علم صحابہ اور دوسرے لوگوں کا اسی پر عمل ہے، وہ لوگ نذر کو مکروہ سمجھتے ہیں، ۴- عبداللہ بن مبارک کہتے ہیں: نذر کے اندر کراہیت کا مفہوم طاعت اور معصیت دونوں سے متعلق ہے، اگر کسی نے اطاعت کی نذر مانی اور اسے پورا کیا تو اسے اس نذر کے پورا کرنے کا اجر ملے گا، لیکن یہ نذر مکروہ ہو گی ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "عمر رضی الله عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! میں نے جاہلیت میں نذر مانی تھی کہ ایک رات مسجد الحرام میں اعتکاف کروں گا، ( تو اس کا حکم بتائیں؟ ) آپ نے فرمایا: ”اپنی نذر پوری کرو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عمر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا مسلک اسی حدیث کے موافق ہے، وہ کہتے ہیں کہ جب کوئی اسلام لائے، اور اس کے اوپر جاہلیت کی نذر طاعت واجب ہو تو اسے پوری کرے، ۴- بعض اہل علم صحابہ اور دوسرے لوگ کہتے ہیں کہ بغیر روزے کے اعتکاف نہیں ہے اور دوسرے اہل علم کہتے ہیں کہ معتکف پر روزہ واجب نہیں ہے الا یہ کہ وہ خود اپنے اوپر ( نذر مانتے وقت ) روزہ واجب کر لے، ان لوگوں نے عمر رضی الله عنہ کی اس حدیث سے استدلال کیا ہے کہ انہوں نے جاہلیت میں ایک رات کے اعتکاف کی نذر مانی تھی، تو نبی اکرم صلی اللہ علیہ وسلم نے ان کو نذر پوری کرنے کا حکم دیا ( اور روزے کا کوئی ذکر نہیں کیا ) ، احمد اور اسحاق کا بھی یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم قسم کھاتے تھے تو اکثر «لا ومقلب القلوب» کہتے تھے ”نہیں، دلوں کے بدلنے والے کی قسم“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”جس نے ایک مومن غلام کو آزاد کیا، اللہ اس غلام کے ہر عضو کے بدلے آزاد کرنے والے کے ایک ایک عضو کو آگ سے آزاد کرے گا، یہاں تک کہ اس ( غلام ) کی شرمگاہ کے بدلے اس کی شرمگاہ کو آزاد کرے گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی یہ حدیث اس سند سے حسن صحیح، غریب ہے، ۲- اس باب میں عائشہ، عمرو بن عبسہ، ابن عباس، واثلہ بن اسقع، ابوامامہ، عقبہ بن عامر اور کعب بن مرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "سوید بن مقرن مزنی رضی الله عنہ کہتے ہیں کہ صورت حال یہ تھی کہ ہم سات بھائی تھے، ہمارے پاس ایک ہی خادمہ تھی، ہم میں سے کسی نے اس کو طمانچہ مار دیا، تو نبی اکرم صلی اللہ علیہ وسلم نے حکم دیا کہ ہم اس کو آزاد کر دیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسے حصین بن عبدالرحمٰن سے کئی لوگوں نے روایت کیا ہے، بعض لوگوں نے اپنی روایت میں یہ ذکر کیا ہے کہ سوید بن مقرن مزنی نے «لطمها على وجهها» کہا یعنی ”اس نے اس کے چہرے پر طمانچہ مارا“۔ ۳- اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "ثابت بن ضحاک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے اسلام کے سوا کسی دوسرے مذہب کی جھوٹی قسم کھائی وہ ویسے ہی ہو گیا جیسے اس نے کہا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اس مسئلہ میں اختلاف ہے کہ جب کوئی اسلام کے سوا کسی دوسرے مذہب کی قسم کھائے اور یہ کہے: اگر اس نے ایسا ایسا کیا تو یہودی یا نصرانی ہو گا، پھر اس نے وہ کام کر لیا، تو بعض اہل علم کہتے ہیں کہ اس نے بہت بڑا گناہ کیا لیکن اس پر کفارہ واجب نہیں ہے، یہ اہل مدینہ کا قول ہے، مالک بن انس بھی اسی کے قائل ہیں اور ابو عبید نے بھی اسی کو اختیار کیا ہے، ۳- اور صحابہ و تابعین وغیرہ میں سے بعض اہل علم کہتے ہیں کہ اس صورت میں اس پر کفارہ واجب ہے، سفیان، احمد اور اسحاق کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "عقبہ بن عامر رضی الله عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! میری بہن نے نذر مانی ہے کہ وہ چادر اوڑھے بغیر ننگے پاؤں چل کر خانہ کعبہ تک جائے گی، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ تمہاری بہن کی سخت کوشی پر کچھ نہیں کرے گا! ۱؎ اسے چاہیئے کہ وہ سوار ہو جائے، چادر اوڑھ لے اور تین دن کے روزے رکھے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اس باب میں ابن عباس سے بھی روایت ہے، ۳- اہل علم کا اسی پر عمل ہے، احمد اور اسحاق کا بھی یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے جس نے قسم کھائی اور اپنی قسم میں کہا: لات اور عزیٰ کی قسم ہے! وہ «لا إله إلا الله» کہے“ اور جس شخص نے کہا: ”آؤ جوا کھیلیں وہ صدقہ کرے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ سعد بن عبادہ رضی الله عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے ایک نذر کے بارے جو ان کی ماں پر واجب تھی اور اسے پوری کرنے سے پہلے وہ مر گئیں، فتویٰ پوچھا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ان کی طرف سے نذر تم پوری کرو“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "ابوامامہ رضی الله عنہ اور دوسرے صحابہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ نے فرمایا: ”جو مسلمان کسی مسلمان کو آزاد کرے گا، تو یہ آزاد کرنا اس کے لیے جہنم سے نجات کا باعث ہو گا، اس آزاد کیے گئے مرد کا ہر عضو اس آزاد کرنے والے کے عضو کی طرف سے کفایت کرے گا، جو مسلمان دو مسلمان عورتوں کو آزاد کرے گا، تو یہ دونوں اس کے لیے جہنم سے خلاصی کا باعث ہوں گی، ان دونوں آزاد عورتوں کا ہر عضو اس کے عضو کی طرف سے کفایت کرے گا، جو مسلمان عورت کسی مسلمان عورت کو آزاد کرے گی، تو یہ اس کے لیے جہنم سے نجات کا باعث ہو گی، اس آزاد کی گئی عورت کا ہر عضو اس آزاد کرنے والے کے عضو کی طرف سے کفایت کرے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے حسن صحیح غریب ہے، ۲- یہ حدیث دلیل ہے کہ مردوں کے لیے مرد آزاد کرنا عورت کے آزاد کرنے سے افضل ہے، اس لیے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کسی مسلمان مرد کو آزاد کیا وہ اس کے لیے جہنم سے نجات کا باعث ہو گا، اس آزاد کئے گئے مرد کا ہر عضو اس کے عضو کی طرف سے کفایت کرے گا“۔ راوی نے پوری حدیث بیان کی جو اپنی سندوں کے اعتبار سے صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		}
	]
}