{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"24": "The Book on Clothing"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "ابوموسیٰ اشعری رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ریشم کا لباس اور سونا میری امت کے مردوں پر حرام ہے اور ان کی عورتوں کے لیے حلال کیا گیا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عمر، علی، عقبہ بن عامر، انس، حذیفہ، ام ہانی، عبداللہ بن عمرو، عمران بن حصین، عبداللہ بن زبیر، جابر، ابوریحان، ابن عمر، براء، اور واثلہ بن اسقع رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "سوید بن غفلہ رضی الله عنہ کہتے ہیں کہ عمر نے مقام جابیہ میں خطبہ دیا اور کہا: نبی اکرم صلی اللہ علیہ وسلم نے ریشم سے منع فرمایا سوائے دو، یا تین، یا چار انگشت کے برابر ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ عبدالرحمٰن بن عوف اور زبیر بن عوام رضی الله عنہما نے ایک غزوہ میں نبی اکرم صلی اللہ علیہ وسلم سے جوؤں کی شکایت کی، تو آپ نے انہیں ریشم کی قمیص کی اجازت دے دی، انس رضی الله عنہ کہتے ہیں: میں نے ان کے بدن پر ریشم کی قمیص دیکھی۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "واقد بن عمرو بن سعد بن معاذ کہتے ہیں کہ انس بن مالک رضی الله عنہ ( ہمارے پاس ) آئے تو میں ان کے پاس گیا، انہوں نے پوچھا: تم کون ہو؟ میں نے کہا: میں واقد بن عمرو بن سعد بن معاذ رضی الله عنہ ہوں، انس رضی الله عنہ رو پڑے اور بولے: تم سعد کی شکل کے ہو، سعد بڑے دراز قد اور لمبے تھے، نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک ریشمی جبہ بھیجا گیا جس میں زری کا کام کیا ہوا تھا ۱؎ آپ اسے پہن کر منبر پر چڑھے، کھڑے ہوئے یا بیٹھے تو لوگ اسے چھو کر کہنے لگے: ہم نے آج کی طرح کبھی کوئی کپڑا نہیں دیکھا، آپ نے فرمایا: ”کیا تم اس پر تعجب کر رہے ہو؟ جنت میں سعد کے رومال اس سے کہیں بہتر ہیں جو تم دیکھ رہے ہو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں اسماء بنت ابی بکر سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "براء رضی الله عنہ کہتے ہیں کہ میں نے سرخ جوڑے میں کسی لمبے بال والے کو رسول اللہ صلی اللہ علیہ وسلم سے خوبصورت نہیں دیکھا، آپ کے بال شانوں کو چھوتے تھے، آپ کے شانوں کے درمیان دوری تھی، آپ نہ کوتاہ قد تھے اور نہ لمبے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں جابر بن سمرہ، ابورمثہ اور ابوجحیفہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "علی رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے مجھے قسی کے بنے ہوئے ریشمی اور زرد رنگ کے کپڑے پہننے سے منع فرمایا ۱؎۔ امام ترمذی کہتے ہیں: ۱- علی رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں انس اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "سلمان رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے گھی، پنیر اور پوستین ( چمڑے کا لباس ) کے بارے میں پوچھا گیا تو آپ نے فرمایا: ”حلال وہ ہے جسے اللہ نے اپنی کتاب میں حلال کر دیا، اور حرام وہ ہے، جسے اللہ نے اپنی کتاب میں حرام کر دیا اور جس چیز کے بارے میں وہ خاموش رہا وہ اس قبیل سے ہے جسے اللہ نے معاف کر دیا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے صرف اسی سند سے مرفوع جانتے ہیں، ۲- اسے سفیان نے بسند «سليمان التيمي عن أبي عثمان عن سلمان» موقوفاً روایت کیا ہے، گویا یہ موقوف حدیث زیادہ صحیح ہے، اس باب میں مغیرہ سے بھی حدیث آئی ہے، ۳- میں نے امام بخاری سے اس حدیث کے بارے میں پوچھا: تو انہوں نے کہا: میں اس کو محفوظ نہیں سمجھتا ہوں، سفیان نے بسند «سليمان التيمي عن أبي عثمان عن سلمان» موقوفا روایت کی ہے، ۴- امام بخاری کہتے ہیں: سیف بن ہارون مقارب الحدیث ہیں، اور سیف بن محمد عاصم سے روایت کرنے میں ذاہب الحدیث ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ ایک بکری مر گئی، رسول اللہ صلی اللہ علیہ وسلم نے بکری والے سے کہا: تم نے اس کی کھال کیوں نہ اتار لی؟ پھر تم دباغت دے کر اس سے فائدہ حاصل کرتے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس چمڑے کو دباغت دی گئی، وہ پاک ہو گیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- بواسطہ ابن عباس نبی اکرم صلی اللہ علیہ وسلم سے دوسری سندوں سے بھی اسی طرح مروی ہے، ۳- یہ حدیث ابن عباس سے کبھی میمونہ کے واسطہ سے نبی اکرم صلی اللہ علیہ وسلم سے اور کبھی سودہ کے واسطہ سے نبی اکرم صلی اللہ علیہ وسلم سے آئی ہے، ۴- میں نے محمد بن اسماعیل بخاری کو نبی اکرم صلی اللہ علیہ وسلم سے مروی ابن عباس کی حدیث اور میمونہ کے واسطہ سے مروی ابن عباس کی حدیث کو صحیح کہتے ہوئے سنا، انہوں نے کہا: احتمال ہے کہ ابن عباس نے بواسطہ میمونہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہو، اور ابن عباس نے نبی اکرم صلی اللہ علیہ وسلم سے براہ راست بھی روایت کیا، اکثر اہل علم کا اسی پر عمل ہے، سفیان ثوری، ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ کا یہی قول ہے، ۵- نضر بن شمیل نے بھی اس کا یہی مفہوم بیان کیا ہے، اسحاق بن راہویہ کہتے ہیں: نضر بن شمیل نے کہا: «إهاب» اس جانور کے چمڑے کو کہا جاتا ہے، جس کا گوشت کھایا جاتا ہے، ۶- اکثر اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں: مردار کا چمڑا دباغت دینے کے بعد پاک ہو جاتا ہے“، ۷- شافعی کہتے ہیں: کتے اور سور کے علاوہ جس مردار جانور کا چمڑا دباغت دیا جائے وہ پاک ہو جائے گا، انہوں نے اسی حدیث سے استدلال کیا ہے، ۸- بعض اہل علم صحابہ اور دوسرے لوگوں نے درندوں کے چمڑوں کو مکروہ سمجھا ہے، اگرچہ اس کو دباغت دی گئی ہو، عبداللہ بن مبارک، احمد اور اسحاق بن راہویہ کا یہی قول ہے، ان لوگوں نے اسے پہننے اور اس میں نماز ادا کرنے کو برا سمجھا ہے، ۹- اسحاق بن ابراہیم بن راہویہ کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم کے قول «أيما إهاب دبغ فقد طهر» کا مطلب یہ ہے کہ اس جانور کا چمڑا دباغت سے پاک ہو جائے گا جس کا گوشت کھایا جاتا ہے، ۱۰- اس باب میں سلمہ بن محبق، میمونہ اور عائشہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "عبداللہ بن عکیم کہتے ہیں کہ ہمارے پاس رسول اللہ صلی اللہ علیہ وسلم کا خط آیا کہ تم لوگ مردہ جانوروں کے چمڑے ۱؎ اور پٹھوں سے فائدے نہ حاصل کرو۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- یہ حدیث عبداللہ بن عکیم سے ان کے شیوخ کے واسطہ سے بھی آئی ہے، ۳- اکثر اہل علم کا اس پر عمل نہیں ہے، ۴- عبداللہ بن عکیم سے یہ حدیث مروی ہے، انہوں نے کہا: ہمارے پاس نبی اکرم صلی اللہ علیہ وسلم کا خط آپ کی وفات سے دو ماہ پہلے آیا، ۵- میں نے احمد بن حسن کو کہتے سنا، احمد بن حنبل اسی حدیث کو اختیار کرتے تھے اس وجہ سے کہ اس میں آپ کی وفات سے دو ماہ قبل کا ذکر ہے، وہ یہ بھی کہتے تھے: یہ نبی اکرم صلی اللہ علیہ وسلم کا آخری حکم تھا، ۶- پھر احمد بن حنبل نے اس حدیث کو چھوڑ دیا اس لیے کہ راویوں سے اس کی سند میں اضطراب واقع ہے، چنانچہ بعض لوگ اسے عبداللہ بن عکیم سے ان کے جہینہ کے شیوخ کے واسطہ سے روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ قیامت کے دن اس شخص کی طرف نہیں دیکھے گا جس نے تکبر سے اپنا تہ بند گھیسٹا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث حسن صحیح ہے، ۲- اس باب میں حذیفہ، ابو سعید خدری، ابوہریرہ، سمرہ، ابوذر، عائشہ اور وہیب بن مغفل رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص تکبر سے اپنا کپڑا گھسیٹے گا اللہ تعالیٰ قیامت کے دن اس کی طرف نہیں دیکھے گا“، ام سلمہ نے کہا: عورتیں اپنے دامنوں کا کیا کریں؟ آپ نے فرمایا: ”ایک بالشت لٹکا لیں“، انہوں نے کہا: تب تو ان کے قدم کھل جائیں گے، آپ نے فرمایا: ”ایک بالشت لٹکائیں ۱؎ اور اس سے زیادہ نہ لٹکائیں“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "ام المؤمنین ام سلمہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فاطمہ کے «نطاق» کے لیے ایک بالشت کا اندازہ لگایا ۱؎۔ امام ترمذی کہتے ہیں: ۱- بعض لوگوں نے اسے «حماد بن سلمة عن علي بن زيد عن الحسن عن أمه عن أم سلمة» کی سند سے روایت کی ہے، ۲- اس حدیث میں عورتوں کے لیے تہ بند ( چادر ) گھسیٹنے کی اجازت ہے، اس لیے کہ یہ ان کے لیے زیادہ ستر پوشی کا باعث ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "ابوبردہ کہتے ہیں کہ عائشہ رضی الله عنہا نے ہمارے سامنے ایک اونی چادر اور موٹا تہ بند نکالا اور کہا: رسول اللہ صلی اللہ علیہ وسلم کی وفات انہی دونوں کپڑوں میں ہوئی ۱؎۔ امام ترمذی کہتے ہیں: ۱- عائشہ کی حدیث حسن صحیح ہے، ۲- اس باب میں علی اور ابن مسعود رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "عبداللہ بن مسعود رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس دن موسیٰ علیہ السلام سے ان کے رب نے گفتگو کی اس دن موسیٰ علیہ السلام کے بدن پر پرانی چادر، اونی جبہ، اونی ٹوپی، اور اونی سراویل ( پائجامہ ) تھا اور ان کے جوتے مرے ہوئے گدھے کے چمڑے کے تھے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے ہم اسے صرف حمید اعرج کی روایت سے جانتے ہیں، حمید سے مراد حمید بن علی کوفی ہیں، ۲- میں نے محمد بن اسماعیل بخاری کو کہتے ہوئے سنا کہ حمید بن علی اعرج منکرالحدیث ہیں اور حمید بن قیس اعرج مکی جو مجاہد کے شاگرد ہیں، وہ ثقہ ہیں، ۳- «کمہ» : چھوٹی ٹوپی کو کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم فتح مکہ کے دن مکہ میں اس حال میں داخل ہوئے کہ آپ کے سر پر سیاہ عمامہ تھا ۱؎۔ امام ترمذی کہتے ہیں: اس باب میں علی، عمر، ابن حریث، ابن عباس اور رکانہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ جب نبی اکرم صلی اللہ علیہ وسلم عمامہ باندھتے تو اسے اپنے شانوں کے بیچ لٹکا لیتے۔ نافع کہتے ہیں: ابن عمر رضی الله عنہما اپنے عمامہ کو شانوں کے بیچ لٹکاتے تھے۔ عبیداللہ بن عمر کہتے ہیں: میں نے قاسم اور سالم کو بھی ایسا کرتے ہوئے دیکھا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اس باب میں علی رضی الله عنہ سے بھی روایت ہے، لیکن ان کی حدیث سند کے اعتبار سے صحیح نہیں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے مجھے سونے کی انگوٹھی، «قسی» ( ایک ریشمی کپڑا ) کا لباس، رکوع و سجود میں قرآن پڑھنے اور «معصفر» ( کسم سے رنگے ہوئے زرد ) کپڑے سے منع فرمایا ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سونے کی انگوٹھی سے منع فرمایا۔ امام ترمذی کہتے ہیں: ۱- عمران کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، ابن عمر، ابوہریرہ اور معاویہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "انس رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی انگوٹھی چاندی کی تھی اور اس کا نگینہ ( عقیق ) حبشہ کا بنا ہوا تھا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے حسن صحیح غریب ہے، ۲- اس باب میں ابن عمر اور بریدہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی انگوٹھی چاندی کی تھی، اس کا نگینہ بھی اسی کا تھا۔ امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے سونے کی ایک انگوٹھی بنائی اور اسے داہنے ہاتھ میں پہنا، پھر منبر پر بیٹھے اور فرمایا: ”میں نے اس انگوٹھی کو اپنے داہنے ہاتھ میں پہنا تھا“، پھر آپ نے اسے نکال کر پھینکا اور لوگوں نے بھی اپنی انگوٹھیاں پھینک دیں ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث بواسطہ نافع ابن عمر سے دوسری سند سے اسی طرح آئی ہے، اس میں انہوں نے یہ ذکر کیا کہ آپ نے داہنے ہاتھ میں انگوٹھی پہنی، ۲- اس باب میں علی، جابر، عبداللہ بن جعفر، ابن عباس، عائشہ اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "صلت بن عبداللہ بن نوفل کہتے ہیں کہ میں نے ابن عباس رضی الله عنہما کو داہنے ہاتھ میں انگوٹھی پہنے دیکھا اور میرا یہی خیال ہے کہ انہوں نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو داہنے ہاتھ میں انگوٹھی پہنے دیکھا۔ امام ترمذی کہتے ہیں: محمد بن اسماعیل بخاری نے کہا: صلت بن عبداللہ بن نوفل کے واسطہ سے محمد بن اسحاق کی روایت حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "محمد الباقر کہتے ہیں کہ حسن اور حسین اپنے بائیں ہاتھ میں انگوٹھی پہنتے تھے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "حماد بن سلمہ کہتے ہیں کہ میں نے ابن ابی رافع ۱؎ کو داہنے ہاتھ میں انگوٹھی پہنتے دیکھا تو اس کے بارے میں ان سے پوچھا تو انہوں نے کہا کہ میں نے عبداللہ بن جعفر رضی الله عنہ کو داہنے ہاتھ میں انگوٹھی پہنتے دیکھا، عبداللہ بن جعفر رضی الله عنہ نے کہا: نبی اکرم صلی اللہ علیہ وسلم اپنے داہنے ہاتھ میں انگوٹھی پہنتے تھے۔ محمد بن اسماعیل بخاری کہتے ہیں: یہ اس باب میں سب سے صحیح روایت ہے جو نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنائی، اس میں «محمد رسول اللہ» نقش کرایا، پھر فرمایا: ”تم لوگ اپنی انگوٹھی پر یہ نقش مت کرانا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔ «لا تنقشوا عليه» کا مطلب یہ ہے کہ آپ نے منع فرمایا کوئی دوسرا اپنی انگوٹھی پر «محمد رسول الله» نقش کرائے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب پاخانہ جاتے تو اپنی انگوٹھی اتار دیتے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": 1747,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی انگوٹھی کا نقش اس طرح تھا «محمد» ایک سطر، «رسول» ایک سطر اور «اللہ» ایک سطر میں، امام ترمذی کہتے ہیں: انس کی حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": 1748,
			"text": "انس رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی انگوٹھی کا نقش تین سطروں میں تھا «محمد» ایک سطر میں «رسول» ایک سطر میں اور «اللہ» ایک سطر میں۔ امام ترمذی کہتے ہیں: ۱- محمد بن یحییٰ نے اپنی روایت میں تین سطروں کا ذکر نہیں کیا ہے، ۲- اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": 1749,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے گھر میں تصویر رکھنے سے منع فرمایا اور آپ نے اس کو بنانے سے بھی منع فرمایا ۱؎۔ امام ترمذی کہتے ہیں: ۱- جابر کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، ابوطلحہ، عائشہ ابوہریرہ اور ابوایوب رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": 1750,
			"text": "عبیداللہ بن عبداللہ بن عتبہ کہتے ہیں کہ وہ ابوطلحہ انصاری رضی الله عنہ کی عیادت کرنے ان کے گھر گئے، تو میں نے ان کے پاس سہل بن حنیف رضی الله عنہ کو پایا، ابوطلحہ رضی الله عنہ نے ایک آدمی کو وہ چادر نکالنے کے لیے بلایا جو ان کے نیچے تھی، سہل رضی الله عنہ نے ان سے کہا: کیوں نکال رہے ہیں؟ انہوں نے کہا: اس لیے کہ اس میں تصویریں ہیں، نبی اکرم صلی اللہ علیہ وسلم نے اس سلسلے میں جو کچھ فرمایا ہے اسے آپ جانتے ہیں، سہل رضی الله عنہ نے کہا: آپ نے تو یہ بھی فرمایا ہے: سوائے اس کپڑے کے جس میں نقش ہو ابوطلحہ نے کہا: آپ نے تو یہ فرمایا ہے لیکن یہ میرے لیے زیادہ اچھا ہے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": 1751,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کوئی تصویر بنائی اللہ تعالیٰ اس کو عذاب دیتا رہے گا یہاں تک کہ مصور اس میں روح پھونک دے اور وہ اس میں روح نہیں پھونک سکے گا، اور جس نے کسی قوم کی بات کان لگا کر سنی حالانکہ وہ اس سے بھاگتے ہوں ۱؎، قیامت کے دن اس کے کان میں سیسہ ڈالا جائے گا“۔ امام ترمذی کہتے ہیں: ۱- ابن عباس کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن مسعود، ابوہریرہ، ابوحجیفہ، عائشہ اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": 1752,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بال کی سفیدی ( خضاب کے ذریعہ ) بدل ڈالو اور یہود کی مشابہت نہ اختیار کرو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- یہ حدیث ابوہریرہ رضی الله عنہ کے واسطہ سے مرفوع طریقہ سے دوسری سندوں سے بھی آئی ہے، ۳- اس باب میں زبیر، ابن عباس، جابر، ابوذر، انس، ابورمثہ، جہدمہ، ابوطفیل، جابر بن سمرہ، ابوحجیفہ اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": 1753,
			"text": "ابوذر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سب سے بہتر چیز جس سے بال کی سفیدی بدلی جائے وہ مہندی اور وسمہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": 1754,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم میانہ قد تھے، آپ نہ لمبے تھے نہ کوتاہ قد، گندمی رنگ کے سڈول جسم والے تھے، آپ کے بال نہ گھونگھریالے تھے نہ سیدھے، آپ جب چلتے تو پیر اٹھا کر چلتے جیسا کوئی اوپر سے نیچے اترتا ہے۔ امام ترمذی کہتے ہیں: ۱- اس سند سے حمید کی روایت سے انس کی حدیث حسن صحیح غریب ہے، ۲- اس باب میں عائشہ، براء، ابوہریرہ، ابن عباس، ابوسعید، جابر، وائل بن حجر اور ام ہانی رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": 1755,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک ہی برتن سے غسل کرتی تھی، آپ کے بال «جمہ» سے چھوٹے اور «وفرہ» سے بڑے تھے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے حسن صحیح غریب ہے، ۲- دوسری سندوں سے یہ حدیث عائشہ سے یوں مروی ہے، کہتی ہیں: میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک ہی برتن سے غسل کرتی تھی، راویوں نے اس حدیث میں یہ جملہ نہیں بیان کیا ہے، «وكان له شعر فوق الجمة ودون الوفرة» ۳- عبدالرحمٰن بن ابی زناد ثقہ ہیں، مالک بن انس ان کی توثیق کرتے تھے اور ان کی روایت لکھنے کا حکم دیتے تھے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "عبداللہ بن مغفل رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے کنگھی کرنے سے منع فرمایا، سوائے اس کے کہ ناغہ کر کے کی جائے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اثمد سرمہ لگاؤ اس لیے کہ وہ بینائی کو جلا بخشتا ہے اور پلکوں کا بال اگاتا ہے“، نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک سرمہ دانی تھی جس سے آپ ہر رات تین سلائی اس ( داہنی آنکھ ) میں اور تین سلائی اس ( بائیں آنکھ ) میں سرمہ لگاتے تھے“۔ امام ترمذی کہتے ہیں: ۱- ابن عباس کی حدیث حسن غریب ہے، ۲- ہم اس لفظ کے ساتھ صرف عباد بن منصور کی روایت سے جانتے ہیں، ۳- اس باب میں جابر اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے دو لباس سے منع فرمایا: ”ایک صماء، اور دوسرا یہ کہ کوئی شخص خود کو کپڑے میں اس طرح لپیٹ لے کہ اس کی شرمگاہ پر اس کپڑے کا کوئی حصہ نہ رہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث اس سند سے حسن صحیح غریب ہے، ۲- یہ دوسری سندوں سے بھی ابوہریرہ کے واسطہ سے مرفوع طریقہ سے آئی ہے، ۳- اس باب میں علی، ابن عمر، عائشہ، ابوسعید، جابر اور ابوامامہ سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے بال میں جوڑے لگانے والی، بال میں جوڑے لگوانے والی، گدنا گوندنے والی اور گدنا گوندوانے والی پر لعنت بھیجی ہے“۔ نافع کہتے ہیں: گدنا مسوڑے میں ہوتا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عائشہ، ابن مسعود، اسماء بنت ابی بکر، ابن عباس، معقل بن یسار اور معاویہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم کو ریشمی زین پر سوار ہونے سے منع فرمایا: راوی کہتے ہیں: اس حدیث میں ایک قصہ مذکور ہے۔ امام ترمذی کہتے ہیں: ۱- براء رضی الله عنہ کی حدیث حسن صحیح ہے، ۲ – اس باب میں علی اور معاویہ رضی الله عنہما سے بھی روایت ہے، شعبہ نے بھی اشعث بن ابی شعثاء سے اسی جیسی حدیث روایت کی ہے، اس حدیث میں ایک قصہ مذکور ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جس بچھونے پر سوتے تھے وہ چمڑے کا تھا، اس کے اندر کھجور کے درخت کی چھال بھری ہوئی تھی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں حفصہ اور جابر رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "ام المؤمنین ام سلمہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے نزدیک پسندیدہ لباس قمیص تھی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "اسماء بنت یزید بن سکن انصاریہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے بازو کی آستین کلائی ( پہنچوں ) تک ہوتی تھی۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم قمیص پہنتے تو داہنی طرف سے ( پہننا ) شروع کرتے۔ امام ترمذی کہتے ہیں: کئی لوگوں نے یہ حدیث بسند «شعبة عن أبي هريرة» موقوف روایت کی ہے، شعبہ سے روایت کرنے والے عبدالصمد بن عبدالوارث کے علاوہ ہم نہیں جانتے کہ کسی نے اسے مرفوع طریقہ سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم کوئی نیا کپڑا پہنتے تو اس کا نام لیتے جیسے عمامہ ( پگڑی ) ، قمیص یا چادر، پھر کہتے: «اللهم لك الحمد أنت كسوتنيه أسألك خيره وخير ما صنع له وأعوذ بك من شره وشر ما صنع له» ”اللہ! تیرے ہی لیے تعریف ہے، تو نے ہی مجھے یہ پہنایا ہے، میں تم سے اس کی خیر اور اس چیز کی خیر کا طلب گار ہوں جس کے لیے یہ بنایا گیا ہے، اور اس کی شر اور اس چیز کے شر سے تیری پناہ مانگتا ہوں جس کے لیے یہ بنایا گیا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب صحیح ہے، ۲- اس باب میں عمر اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "مغیرہ بن شعبہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے رومی جبہ پہنا جس کی آستینیں تنگ تھیں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "مغیرہ بن شعبہ رضی الله عنہ کہتے ہیں کہ دحیہ کلبی نے رسول اللہ صلی اللہ علیہ وسلم کے لیے دو موزے تحفہ بھیجے، چنانچہ آپ نے انہیں پہنا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اسرائیل نے اپنی روایت میں کہا ہے ( جسے وہ بطریق «عن جابر» روایت کرتے ہیں ) : ایک جبہ بھی بھیجا، آپ نے ان دونوں موزوں کو پہنا یہاں تک کہ وہ پھٹ گئے، نبی اکرم صلی اللہ علیہ وسلم نہیں جانتے تھے کہ وہ مذبوح جانور کی کھال کے ہیں یا غیر مذبوح، ۳- ابواسحاق سبیعی کا نام سلیمان ہے، ۴- حسن بن عیاش ابوبکر بن عیاش کے بھائی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "عرفجہ بن اسعد رضی الله عنہ کہتے ہیں کہ ایام جاہلیت میں کلاب ۱؎ ( ایک لڑائی ) کے دن میری ناک کٹ گئی، میں نے چاندی کی ایک ناک لگائی تو اس سے بدبو آنے لگی، اس لیے رسول اللہ صلی اللہ علیہ وسلم نے مجھے سونے کی ایک ناک لگانے کا حکم دیا ۲؎۔ اس سند سے بھی ابوشہب سے اسی جیسی حدیث روایت ہے، امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ہم اسے صرف عبدالرحمٰن بن طرفہ کی روایت سے جانتے ہیں، سلیم بن زریر نے بھی عبدالرحمٰن بن طرفہ سے ابوشہاب کی حدیث جیسی روایت کی ہے، ۳- اہل علم میں سے کئی ایک سے روایت ہے کہ انہوں نے اپنے دانتوں کو سونے ( کے تار ) سے باندھا، اس حدیث میں ان کے لیے دلیل موجود ہے، ۴- عبدالرحمٰن بن مہدی نے ( سلم بن زریر کے بجائے ) سلم بن زرین کہا ہے، یہاں ان سے وہم ہوا ہے وزریر زیادہ صحیح ہے، راوی ابوسعید صغانی کا نام محمد بن میسر ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": 1771,
			"text": "ابوالملیح سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے درندوں کی کھال ( استعمال کرنے ) سے منع فرمایا۔ امام ترمذی کہتے ہیں: یہ زیادہ صحیح ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "قتادہ کہتے ہیں کہ میں نے انس بن مالک رضی الله عنہ سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم کے جوتے کیسے تھے؟ کہا: ان کے دو تسمے تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس اور ابوہریرہ سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے جوتے کے دو تسمے تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس و ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے کوئی آدمی ایک جوتا پہن کر نہ چلے، دونوں پہن لے یا دونوں اتار دے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں جابر رضی الله عنہ سے بھی احادیث آئی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": 1775,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ کوئی شخص کھڑے ہو کر جوتا پہنے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- عبیداللہ بن عمر ورقی نے اس حدیث کو معمر سے، معمر نے قتادہ سے، قتادہ نے انس سے روایت کی ہے، یہ دونوں حدیثیں محدثین کے نزدیک صحیح نہیں ہیں، حارث بن نبہان کا حافظہ محدثین کے نزدیک قوی نہیں ہے، ۳- قتادہ کی انس سے مروی حدیث کی ہم کوئی اصل نہیں جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "انس رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کھڑے ہو کر جوتا پہننے سے منع فرمایا۔ ٍ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- محمد بن اسماعیل بخاری کہتے ہیں: یہ حدیث صحیح نہیں ہے، اور نہ ہی معمر کی حدیث جسے وہ عمار بن ابی عمار سے اور عمار ابوہریرہ سے روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ بسا اوقات نبی اکرم صلی اللہ علیہ وسلم ایک جوتا پہن کر چلتے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ وہ ایک جوتا پہن کر چلیں۔ امام ترمذی کہتے ہیں: ۱- یہ روایت زیادہ صحیح ہے ۱؎، ۲- سفیان ثوری اور کئی لوگوں نے اسی طرح اس حدیث کو عبدالرحمٰن بن قاسم کے واسطہ سے موقوف طریقہ سے روایت کیا ہے اور یہ موقوف روایت زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے جب کوئی جوتا پہنے تو داہنے پیر سے شروع کرے اور جب اتارے تو بائیں سے شروع کرے، پہننے میں داہنا پاؤں پہلے اور اتارنے میں پیچھے ہو“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: ”اگر تم ( آخرت میں ) مجھ سے ملنا چاہتی ہو تو دنیا سے مسافر کے سامان سفر کے برابر حاصل کرنے پر اکتفا کرو، مالداروں کی صحبت سے بچو اور کسی کپڑے کو اس وقت تک پرانا نہ سمجھ یہاں تک کہ اس میں پیوند لگا لو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف صالح بن حسان کی روایت سے جانتے ہیں، ۳- میں نے محمد بن اسماعیل بخاری کو کہتے سنا: صالح بن حسان منکر حدیث ہیں اور صالح بن ابی حسان جن سے ابن ابی ذئب نے روایت کی ہے وہ ثقہ ہیں، ۴",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "ام ہانی رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مکہ اس حال میں آئے کہ آپ کی چار چوٹیاں تھیں ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- محمد بن اسماعیل بخاری کہتے ہیں: ام ہانی سے مجاہد کا سماع میں نہیں جانتا ہوں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "ابوکبشہ انماری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کی آستینیں کشادہ تھیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث منکر ہے، ۲- عبداللہ بن بسر بصرہ کے رہنے والے ہیں، محدثین کے نزدیک ضعیف ہیں، یحییٰ بن سعید وغیرہ نے انہیں ضعیف کہا ہے، ۳- «بطح» چوڑی اور کشادہ چیز کو کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "حذیفہ بن یمان رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی یا میری پنڈلی کا گوشت پکڑا اور فرمایا: ”یہ تہبند کی جگہ ہے، اگر اس پر راضی نہ ہو تو تھوڑا اور نیچا کر لو، پھر اگر اور نیچا کرنا چاہو تو تہ بند ٹخنوں سے نیچا نہیں کر سکتے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے، ثوری اور شعبہ نے بھی اس کو ابواسحاق سبیعی سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "محمد بن رکانہ سے روایت ہے کہ رکانہ نے نبی اکرم صلی اللہ علیہ وسلم سے کشتی لڑی تو نبی اکرم صلی اللہ علیہ وسلم نے اسے پچھاڑ دیا، رکانہ کہتے ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہوئے سنا: ”ہمارے اور مشرکوں کے درمیان فرق ٹوپیوں پر عمامہ باندھنے کا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اس کی سند قائم ( صحیح ) نہیں ہے، ۳- ہم ابوالحسن عسقلانی اور ابن رکانہ کو نہیں جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "بریدہ رضی الله عنہ کہتے ہیں کہ ایک آدمی نبی اکرم صلی اللہ علیہ وسلم کے پاس لوہے کی انگوٹھی پہن کر آیا، آپ نے فرمایا: ”کیا بات ہے میں دیکھ رہا ہوں کہ تم جہنمیوں کا زیور پہنے ہو؟“ پھر وہ آپ کے پاس پیتل کی انگوٹھی پہن کر آیا، آپ نے فرمایا: ”کیا بات ہے کہ تم سے بتوں کی بدبو آ رہی ہے؟ پھر وہ آپ کے پاس سونے کی انگوٹھی پہن کر آیا، تو آپ نے فرمایا: ”کیا بات ہے میں دیکھ رہا ہوں کہ تم جنتیوں کا زیور پہنے ہو؟ اس نے پوچھا: میں کس چیز کی انگوٹھی پہنوں؟ آپ نے فرمایا: ”چاندی کی اور ( وزن میں ) ایک مثقال سے کم رکھو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اس باب میں عبداللہ بن عمرو سے بھی روایت ہے، ۳- عبداللہ بن مسلم کی کنیت ابوطیبہ ہے اور وہ عبداللہ بن مسلم مروزی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "علی رضی الله عنہ کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے «قسي» ( ایک ریشمی کپڑا ) سرخ ( رنگ کا ریشمی ) زین پوش اور اس انگلی اور اس انگلی میں انگوٹھی پہننے سے منع فرمایا اور انہوں نے شہادت اور بیچ کی انگلی کی طرف اشارہ کیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا پسندیدہ کپڑا جسے آپ پہنتے تھے وہ دھاری دار یمنی چادر تھی۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 76
			}
		}
	]
}