{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"32": "Chapters On Al-Qadar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2133,
			"arabicnumber": 2133,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ ( ایک دن ) رسول اللہ صلی اللہ علیہ وسلم ہماری طرف نکلے، اس وقت ہم سب تقدیر کے مسئلہ میں بحث و مباحثہ کر رہے تھے، آپ غصہ ہو گئے یہاں تک کہ آپ کا چہرہ سرخ ہو گیا اور ایسا نظر آنے لگا گویا آپ کے گالوں پر انار کے دانے نچوڑ دئیے گئے ہوں۔ آپ نے فرمایا: ”کیا تمہیں اسی کا حکم دیا گیا ہے، یا میں اسی واسطے تمہاری طرف نبی بنا کر بھیجا گیا ہوں؟ بیشک تم سے پہلی امتیں ہلاک ہو گئیں جب انہوں نے اس مسئلہ میں بحث و مباحثہ کیا، میں تمہیں قسم دلاتا ہوں کہ اس مسئلہ میں بحث و مباحثہ نہ کرو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱ – یہ حدیث غریب ہے، ۲- ہم اسے اس سند سے صرف صالح مری کی روایت سے جانتے ہیں اور صالح مری کے بہت سارے غرائب ہیں جن کی روایت میں وہ منفرد ہیں، کوئی ان کی متابعت نہیں کرتا۔ ۳- اس باب میں عمر، عائشہ اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": 2134,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”آدم اور موسیٰ نے باہم مناظرہ کیا، موسیٰ نے کہا: آدم! آپ وہی تو ہیں جسے اللہ تعالیٰ نے اپنے ہاتھ سے پیدا کیا اور آپ کے اندر اپنی روح پھونکی ۱؎ پھر آپ نے لوگوں کو گمراہ کیا اور ان کو جنت سے نکالا؟ آدم نے اس کے جواب میں کہا: آپ وہی موسیٰ ہیں جسے اللہ تعالیٰ نے گفتگو کرنے کے لیے منتخب کیا، کیا آپ میرے ایسے کام پر مجھے ملامت کرتے ہیں جسے اللہ تعالیٰ نے آسمان و زمین کو پیدا کرنے سے پہلے میرے اوپر لازم کر دیا تھا؟، آدم موسیٰ سے دلیل میں جیت گئے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- حسن صحیح غریب ہے، ۲- یہ حدیث اس سند سے یعنی سلیمان تیمی کی روایت سے جسے وہ اعمش سے روایت کرتے ہیں، ۳- اعمش کے بعض شاگردوں نے «عن الأعمش عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم» کی سند سے اسی جیسی حدیث روایت کی ہے۔ اور بعض نے اس کی سند یوں بیان کی ہے «عن الأعمش عن أبي صالح عن أبي سعيد عن النبي صلى الله عليه وسلم»،‏‏‏‏ ۴- کئی اور سندوں سے یہ حدیث ابوہریرہ کے واسطہ سے نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے، ۵- اس باب میں عمر اور جندب رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": 2135,
			"text": "عمر رضی الله عنہ سے روایت ہے کہ انہوں نے عرض کیا: اللہ کے رسول! جو عمل ہم کرتے ہیں اس کے بارے میں آپ کا کیا خیال ہے، وہ نیا شروع ہونے والا امر ہے یا ایسا امر ہے جس سے فراغت ہو چکی ہے؟ ۱؎ آپ نے فرمایا: ”ابن خطاب! وہ ایسا امر ہے جس سے فراغت ہو چکی ہے، اور ہر آدمی کے لیے وہ امر آسان کر دیا گیا ہے ( جس کے لیے وہ پیدا کیا گیا ہے ) ، چنانچہ جو آدمی سعادت مندوں میں سے ہے وہ سعادت والا کام کرتا ہے اور جو بدبختوں میں سے ہے وہ بدبختی والا کام کرتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں علی، حذیفہ بن اسید، انس اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": 2136,
			"text": "علی رضی الله عنہ کہتے ہیں کہ ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے، آپ زمین کرید رہے تھے کہ اچانک آپ نے آسمان کی طرف اپنا سر اٹھایا پھر فرمایا: ”تم میں سے کوئی آدمی ایسا نہیں ہے جس کا حال معلوم نہ ہو، ( وکیع کی روایت میں ہے: تم میں سے کوئی آدمی ایسا نہیں جس کی جنت یا جہنم کی جگہ نہ لکھ دی گئی ہو ) ، صحابہ نے عرض کیا: اللہ کے رسول! کیا ہم لوگ ( تقدیر کے لکھے ہوئے پر ) بھروسہ نہ کر لیں؟ آپ نے فرمایا: ”نہیں، تم لوگ عمل کرو اس لیے کہ ہر آدمی کے لیے وہ چیز آسان کر دی گئی ہے جس کے لیے وہ پیدا کیا گیا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": 2137,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ ہم سے صادق و مصدوق رسول اللہ صلی اللہ علیہ وسلم نے بیان کیا ۱؎، ”تم میں سے ہر آدمی اپنی ماں کے پیٹ میں چالیس دن تک نطفہ کی شکل میں رہتا ہے، پھر اتنے ہی دن تک «علقة» ( یعنی جمے ہوئے خون ) کی شکل میں رہتا ہے، پھر اتنے ہی دن تک «مضغة» ( یعنی گوشت کے لوتھڑے ) کی شکل میں رہتا ہے، پھر اللہ تعالیٰ اس کے پاس فرشتہ بھیجتا ہے جو اس کے اندر روح پھونکتا ہے، پھر اسے چار چیزوں ( کے لکھنے ) کا حکم کیا جاتا ہے، چنانچہ وہ لکھتا ہے: اس کا رزق، اس کی موت، اس کا عمل اور یہ چیز کہ وہ «شقي» ( بدبخت ) ہے یا «سعيد» ( نیک بخت ) ، اس ذات کی قسم جس کے سوا کوئی معبود برحق نہیں، تم میں سے کوئی آدمی جنتیوں کا عمل کرتا رہتا ہے یہاں تک کہ اس کے اور جنت کے درمیان ایک گز کا فاصلہ رہ جاتا ہے پھر اس کے اوپر لکھی ہوئی تقدیر غالب آتی ہے اور جہنمیوں کے عمل پر اس کا خاتمہ کیا جاتا ہے۔ لہٰذا وہ جہنم میں داخل ہو جاتا ہے، اور تم میں سے کوئی آدمی جہنمیوں کا عمل کرتا رہتا ہے پھر اس کے اوپر لکھی ہوئی تقدیر غالب آتی ہے اور جنتیوں کے عمل پر اس کا خاتمہ کیا جاتا ہے، لہٰذا وہ جنت میں داخل ہوتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": 2138,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہر بچہ فطرت ( اسلام ) پر پیدا ہوتا ہے ۱؎، پھر اس کے ماں باپ اسے یہودی، نصرانی، یا مشرک بناتے ہیں“ عرض کیا گیا: اللہ کے رسول! جو اس سے پہلے ہی مر جائے؟ ۲؎ آپ نے فرمایا: ”اللہ خوب جانتا ہے کہ وہ کیا عمل کرتے“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": 2139,
			"text": "سلمان رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”دعا کے سوا کوئی چیز تقدیر کو نہیں ٹالتی ہے ۱؎ اور نیکی کے سوا کوئی چیز عمر میں اضافہ نہیں کرتی ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث سلمان کی روایت سے حسن غریب ہے، ۲- اس باب میں ابواسید سے بھی روایت ہے، ۳- ہم اسے صرف یحییٰ بن ضریس کی روایت سے جانتے ہیں، ۴- ابومودود دو راویوں کی کنیت ہے، ایک کو فضہ کہا جاتا ہے، اور یہ وہی ہیں جنہوں نے یہ حدیث روایت کی ہے، ان کا نام فضہ ہے اور دوسرے ابومودود کا نام عبدالعزیز بن ابوسلیمان ہے، ان میں سے ایک بصرہ کے رہنے والے ہیں اور دوسرے مدینہ کے، دونوں ایک ہی دور میں تھے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": 2140,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اکثر یہ دعا پڑھتے تھے «يا مقلب القلوب ثبت قلبي على دينك» ”اے دلوں کے الٹنے پلٹنے والے میرے دل کو اپنے دین پر ثابت رکھ“، میں نے عرض کیا: اللہ کے رسول! ہم لوگ آپ پر اور آپ کی لائی ہوئی شریعت پر ایمان لے آئے کیا آپ کو ہمارے سلسلے میں اندیشہ رہتا ہے؟ آپ نے فرمایا: ”ہاں، لوگوں کے دل اللہ کی انگلیوں میں سے دو انگلیوں کے درمیان ہیں جیسا چاہتا ہے انہیں الٹتا پلٹتا رہتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- کئی لوگوں نے اسی طرح «عن الأعمش عن أبي سفيان عن أنس» کی سند سے روایت کی ہے۔ بعض لوگوں نے «عن الأعمش عن أبي سفيان عن جابر عن النبي صلى الله عليه وسلم» کی سند سے روایت کی ہے، لیکن ابوسفیان کی حدیث جو انس سے مروی ہے زیادہ صحیح ہے، ۳- اس باب میں نواس بن سمعان، ام سلمہ، عبداللہ بن عمرو اور عائشہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": 2141,
			"text": "عبداللہ بن عمرو بن عاص رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ( ایک بار ) ہماری طرف نکلے اس وقت آپ کے ہاتھ میں دو کتابیں تھیں۔ آپ نے پوچھا: ”تم لوگ جانتے ہو یہ دونوں کتابیں کیا ہیں؟“ ہم لوگوں نے کہا: نہیں، سوائے اس کے کہ آپ ہمیں بتا دیں۔ داہنے ہاتھ والی کتاب کے بارے میں آپ نے فرمایا: ”یہ رب العالمین کی کتاب ہے، اس کے اندر جنتیوں، ان کے آباء و اجداد اور ان کے قبیلوں کے نام ہیں، پھر آخر میں ان کا میزان ذکر کر دیا گیا ہے۔ لہٰذا ان میں نہ تو کسی کا اضافہ ہو گا اور نہ ان میں سے کوئی کم ہو گا“، پھر آپ نے بائیں ہاتھ والی کتاب کے بارے میں فرمایا: ”یہ رب العالمین کی کتاب ہے، اس کے اندر جہنمیوں، ان کے آباء و اجداد اور ان کے قبیلوں کے نام ہیں اور آخر میں ان کا میزان ذکر کر دیا گیا ہے، اب ان میں نہ تو کسی کا اضافہ ہو گا اور نہ ان میں سے کوئی کم ہو گا۔ صحابہ نے عرض کیا: اللہ کے رسول! پھر عمل کس لیے کریں جب کہ اس معاملہ سے فراغت ہو چکی ہے؟ آپ نے فرمایا: ”سیدھی راہ پر چلو اور میانہ روی اختیار کرو، اس لیے کہ جنتی کا خاتمہ جنتی کے عمل پہ ہو گا، اگرچہ اس سے پہلے وہ جو بھی عمل کرے اور جہنمی کا خاتمہ جہنمی کے عمل پہ ہو گا اگرچہ اس سے پہلے وہ جو بھی عمل کرے“، پھر رسول اللہ صلی اللہ علیہ وسلم نے اپنے دونوں ہاتھوں سے اشارہ کیا، پھر ان دونوں کتابوں کو پھینک دیا اور فرمایا: ”تمہارا رب بندوں سے فارغ ہو چکا ہے، ایک فریق جنت میں جائے گا اور ایک فریق جہنم میں جائے گا“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": 2142,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب اللہ تعالیٰ کسی بندے کے ساتھ بھلائی کا ارادہ کرتا ہے تو اس سے عمل کراتا ہے“، عرض کیا گیا: اللہ کے رسول! کیسے عمل کراتا ہے؟ آپ نے فرمایا: ”موت سے پہلے اسے عمل صالح کی توفیق دیتا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": 2143,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے درمیان کھڑے ہوئے اور فرمایا: ”کسی کی بیماری دوسرے کو نہیں لگتی“، ایک اعرابی ( بدوی ) نے عرض کیا: اللہ کے رسول! خارشتی شرمگاہ والے اونٹ سے ( جب اسے باڑہ میں لاتے ہیں ) تو تمام اونٹ ( کھجلی والے ) ہو جاتے ہیں“، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پھر پہلے کو کس نے کھجلی دی؟ کسی کی بیماری دوسرے کو نہیں لگتی ہے اور نہ ماہ صفر کی نحوست کی کوئی حقیقت ہے، اللہ تعالیٰ نے ہر نفس کو پیدا کیا ہے اور اس کی زندگی، رزق اور مصیبتوں کو لکھ دیا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: اس باب میں ابوہریرہ، ابن عباس اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": 2144,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کوئی بندہ مومن نہیں ہو سکتا یہاں تک کہ اچھی اور بری تقدیر پر ایمان لے آئے، اور یہ یقین کر لے کہ جو کچھ اسے لاحق ہوا ہے چوکنے والا نہ تھا اور جو کچھ چوک گیا ہے اسے لاحق ہونے والا نہ تھا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے صرف عبداللہ بن میمون کی روایت سے جانتے ہیں، ۲- عبداللہ بن میمون منکر حدیث ہیں، ۳- اس باب میں عبادہ، جابر اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": 2145,
			"text": "علی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کوئی بندہ چار چیزوں پر ایمان لائے بغیر مومن نہیں ہو سکتا: ( ۱ ) گواہی دے کہ اللہ کے سوا کوئی معبود برحق نہیں اور میں اللہ کا رسول ہوں، اس نے مجھے حق کے ساتھ بھیجا ہے، ( ۲ ) موت پر ایمان لائے، ( ۳ ) مرنے کے بعد دوبارہ اٹھائے جانے پر ایمان لائے، ( ۴ ) تقدیر پر ایمان لائے“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": 2147,
			"text": "ابوعزہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب اللہ تعالیٰ کسی بندے کی موت کے لیے کسی زمین کا فیصلہ کر دیتا ہے تو وہاں اس کی کوئی حاجت پیدا کر دیتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح ہے، ۲- ابوعزہ کو شرف صحبت حاصل ہے اور ان کا نام یسار بن عبد ہے، ۳- راوی ابوملیح کا نام عامر بن اسامہ بن عمیر ہذلی ہے۔ انہیں زید بن اسامہ بھی کہا جاتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": 2148,
			"text": "ابوخزامہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک آدمی نے آ کر عرض کیا: اللہ کے رسول! یہ دم جن سے ہم جھاڑ پھونک کرتے ہیں، دوائیں جن سے علاج کرتے ہیں اور بچاؤ کی چیزیں جن سے بچاؤ کرتے ہیں، آپ بتائیے کیا یہ اللہ کی تقدیر میں سے کچھ لوٹا سکتی ہیں؟ آپ نے فرمایا: ”یہ سب بھی تو اللہ کی تقدیر سے ہیں“۔ امام ترمذی کہتے ہیں: ہم اس حدیث کو صرف زہری کی روایت سے جانتے ہیں، کئی لوگوں نے یہ حدیث «عن سفيان عن الزهري عن أبي خزامة عن أبيه» کی سند سے روایت کی ہے، یہ زیادہ صحیح ہے۔ اسی طرح کئی لوگوں نے «عن الزهري عن أبي خزامة عن أبيه» کی سند سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2149,
			"arabicnumber": 2149,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میری امت کے دو قسم کے لوگوں کے لیے اسلام میں کوئی حصہ نہیں ہے: ( ۱ ) مرجئہ ( ۲ ) قدریہ“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ۲- اس باب میں عمر، ابن عمر اور رافع بن خدیج رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2150,
			"arabicnumber": 2150,
			"text": "عبداللہ بن شخیر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ابن آدم کی مثال ایسی ہے کہ اس کے پہلو میں ننانوے آفتیں ہیں اگر وہ ان آفتوں سے بچ گیا تو بڑھاپے میں گرفتار ہو جائے گا یہاں تک کہ اسے موت آ جائے گی“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔ ہم اسے صرف اسی سند سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": 2151,
			"text": "سعد بن ابی وقاص رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ کے فیصلے پر راضی ہونا ابن آدم کی سعادت ( نیک بختی ) ہے، اللہ سے خیر طلب نہ کرنا ابن آدم کی شقاوت ( بدبختی ) ہے اور اللہ کے فیصلے پر ناراض ہونا ابن آدم کی شقاوت ( بدبختی ) ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف محمد بن ابی حمید کی روایت سے جانتے ہیں، انہیں حماد بن ابی حمید بھی کہا جاتا ہے، ان کی کنیت ابوابراہیم ہے، اور مدینہ کے رہنے والے ہیں، یہ محدثین کے نزدیک قوی نہیں ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": 2152,
			"text": "نافع کا بیان ہے کہ ابن عمر رضی الله عنہما کے پاس ایک شخص آیا اور اس نے کہا: فلاں شخص نے آپ کو سلام عرض کیا ہے، اس سے ابن عمر رضی الله عنہما نے کہا: مجھے خبر ملی ہے کہ اس نے دین میں نیا عقیدہ ایجاد کیا ہے، اگر اس نے دین میں نیا عقیدہ ایجاد کیا ہے تو اسے میرا سلام نہ پہنچانا، اس لیے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”اس امت میں یا میری امت میں، ( یہ شک راوی کی طرف سے ہوا ہے ) تقدیر کا انکار کرنے والوں پر «خسف»،‏‏‏‏ «مسخ» یا «قذف» کا عذاب ہو گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ۲- ابوصخر کا نام حمید بن زیاد ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": 2153,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”میری امت میں «خسف» اور «مسخ» کا عذاب ہو گا اور یہ عذاب تقدیر کے جھٹلانے والوں پر آئے گا“۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": 2154,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”چھ قسم کے لوگ ایسے ہیں جن پر میں نے، اللہ تعالیٰ نے اور تمام انبیاء نے لعنت بھیجی ہے: اللہ کی کتاب میں اضافہ کرنے والا، اللہ کی تقدیر کو جھٹلانے والا، طاقت کے ذریعہ غلبہ حاصل کرنے والا تاکہ اس کے ذریعہ اسے عزت دے جسے اللہ نے ذلیل کیا ہے، اور اسے ذلیل کرے جسے اللہ نے عزت بخشی ہے، اللہ کی محرمات کو حلال سمجھنے والا، میرے کنبہ میں سے اللہ کی محرمات کو حلال سمجھنے والا اور میری سنت ترک کرنے والا“۔ امام ترمذی کہتے ہیں: عبدالرحمٰن بن ابوموالی نے یہ حدیث اسی طرح «عن عبيد الله ابن عبدالرحمٰن بن موهب عن عمرة عن عائشة عن النبي صلى الله عليه وسلم» کی سند سے روایت کی ہے۔ سفیان ثوری، حفص بن غیاث اور کئی لوگوں نے اسے «عن عبيد الله بن عبدالرحمٰن بن موهب عن علي بن حسين عن النبي صلى الله عليه وسلم» کی سند سے مرسلاً روایت کیا ہے۔ یہ زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": 2155,
			"text": "عبدالواحد بن سلیم کہتے ہیں کہ میں مکہ گیا تو عطاء بن ابی رباح سے ملاقات کی اور ان سے کہا: ابو محمد! بصرہ والے تقدیر کے سلسلے میں ( برسبیل انکار ) کچھ گفتگو کرتے ہیں، انہوں نے کہا: بیٹے! کیا تم قرآن پڑھتے ہو؟ میں نے کہا: ہاں، انہوں نے کہا: سورۃ الزخرف پڑھو، میں نے پڑھا: «حم والكتاب المبين إنا جعلناه قرآنا عربيا لعلكم تعقلون وإنه في أم الكتاب لدينا لعلي حكيم» ”حم، قسم ہے اس واضح کتاب کی، ہم نے اس کو عربی زبان کا قرآن بنایا ہے کہ تم سمجھ لو، یقیناً یہ لوح محفوظ میں ہے، اور ہمارے نزدیک بلند مرتبہ حکمت والی ہے“ ( الزخرف: ۱-۴ ) پڑھی، انہوں نے کہا: جانتے ہو ام الکتاب کیا ہے؟ میں نے کہا: اللہ اور اس کے رسول زیادہ جانتے ہیں، انہوں نے کہا: وہ ایک کتاب ہے جسے اللہ تعالیٰ نے آسمان اور زمین کے پیدا کرنے سے پہلے لکھا ہے، اس میں یہ لکھا ہوا ہے کہ فرعون جہنمی ہے اور اس میں «تبت يدا أبي لهب وتب» ”ابولہب کے دونوں ہاتھ ٹوٹ گئے، اور وہ ( خود ) ہلاک ہو گیا“ ( تبت: ۱ ) بھی لکھا ہوا ہے۔ عطاء کہتے ہیں: پھر میں ولید بن عبادہ بن صامت رضی الله عنہ سے ملا ( ولید کے والد عبادہ بن صامت صحابی رسول تھے ) اور ان سے سوال کیا: مرتے وقت آپ کے والد کی کیا وصیت تھی؟ کہا: میرے والد نے مجھے بلایا اور کہا: بیٹے! اللہ سے ڈرو اور یہ جان لو کہ تم اللہ سے ہرگز نہیں ڈر سکتے جب تک تم اللہ پر اور تقدیر کی اچھائی اور برائی پر ایمان نہ لاؤ۔ اگر اس کے سوا دوسرے عقیدہ پر تمہاری موت آئے گی تو جہنم میں جاؤ گے، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”اللہ تعالیٰ نے سب سے پہلے قلم کو پیدا کیا“ اور فرمایا: ”لکھو“، قلم نے عرض کیا: کیا لکھوں؟ اللہ تعالیٰ نے فرمایا: ”تقدیر لکھو جو کچھ ہو چکا ہے اور جو ہمیشہ تک ہونے والا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": 2156,
			"text": "عبداللہ بن عمرو بن العاص رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”اللہ تعالیٰ نے تقدیر کو زمین و آسمان کی پیدائش سے پچاس ہزار سال پہلے لکھا تھا“۔ امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": 2157,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ مشرکین قریش تقدیر کے بارے میں جھگڑتے ہوئے رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو یہ آیت نازل ہوئی «يوم يسحبون في النار على وجوههم ذوقوا مس سقر إنا كل شيء خلقناه بقدر» یعنی ”جس دن وہ جہنم میں منہ کے بل گھسیٹے جائیں گے ( تو ان سے کہا جائے گا ) تم لوگ جہنم کا مزہ چکھو، ہم نے ہر چیز کو اندازے سے پیدا کیا ہے“ ( القمر: ۴۸-۴۹ ) ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح ہے، ۲- مذکورہ حدیث مجھ سے قبیصہ نے بیان کی، وہ کہتے ہیں: مجھ سے عبدالرحمٰن بن زید نے بیان کی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2298,
			"arabicnumber": 2298,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”خیانت کرنے والے مرد اور عورت کی گواہی درست اور مقبول نہیں ہے، اور نہ ان مردوں اور عورتوں کی گواہی مقبول ہے جن پر حد نافذ ہو چکی ہے، نہ اپنے بھائی سے دشمنی رکھنے والے کی گواہی مقبول ہے، نہ اس آدمی کی جس کی ایک بار جھوٹی گواہی آزمائی جا چکی ہو، نہ اس شخص کی گواہی جو کسی کے زیر کفالت ہو اس کفیل خاندان کے حق میں ( جیسے مزدور وغیرہ ) اور نہ اس شخص کی جو ولاء یا رشتہ داری کی نسبت میں متہم ہو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف یزید بن زیاد دمشقی کی روایت سے جانتے ہیں، اور یزید ضعیف الحدیث ہیں، نیز یہ حدیث زہری کی روایت سے صرف اسی طریق سے جانی جاتی ہے، ۳- اس باب میں عبداللہ بن عمرو سے بھی حدیث مروی ہے، ۴- فزازی کہتے ہیں: «قانع» سے مراد «تابع» ہے، ۵- اس حدیث کا مطلب ہم نہیں سمجھتے اور نہ ہی سند کے اعتبار سے یہ میرے نزدیک صحیح ہے، ۶- اس بارے میں اہل علم کا عمل ہے کہ رشتہ دار کے لیے رشتہ کی گواہی درست ہے، البتہ بیٹے کے حق میں باپ کی گواہی یا باپ کے حق میں بیٹے کی گواہی کے بارے میں اہل علم کا اختلاف ہے، اکثر اہل علم بیٹے کے حق میں باپ کی گواہی یا باپ کے حق میں بیٹے کی گواہی کو درست نہیں سمجھتے، ۷- بعض اہل علم کہتے ہیں: جب گواہی دینے والا عادل ہو تو باپ کی گواہی بیٹے کے حق میں اسی طرح باپ کے حق میں بیٹے کی گواہی درست ہے، ۸- بھائی کی گواہی کے جواز کے بارے میں اختلاف نہیں ہے، ۹- اسی طرح رشتہ دار کے لیے رشتہ دار کی گواہی میں بھی اختلاف نہیں ہے، ۱۰- امام شافعی کہتے ہیں: جب دو آدمیوں میں دشمنی ہو تو ایک کے خلاف دوسرے کی گواہی درست نہ ہو گی، گرچہ گواہی دینے والا عادل ہو، انہوں نے عبدالرحمٰن اعرج کی حدیث سے استدلال کیا ہے جو نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً مروی ہے کہ دشمنی رکھنے والے کی گواہی درست نہیں ہے، اسی طرح اس ( مذکورہ ) حدیث کا بھی مفہوم یہی ہے، ( جس میں ) آپ نے فرمایا: ”اپنے بھائی کے لیے دشمنی رکھنے والے کی گواہی درست نہیں ہے“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 14
			}
		}
	]
}