{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"35": "Chapters On Witnesses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2295,
			"arabicnumber": 2295,
			"text": "زید بن خالد جہنی رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کیا میں تمہیں سب سے اچھے گواہ کے بارے میں نہ بتا دوں؟ سب سے اچھا گواہ وہ آدمی ہے جو گواہی طلب کیے جانے سے پہلے گواہی دے“ ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2296,
			"arabicnumber": 2296,
			"text": "اس سند سے بھی اسی جیسی حدیث مروی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اکثر لوگوں نے اپنی روایت میں عبدالرحمٰن بن ابی عمرہ کہا ہے۔ ۳- اس حدیث کی روایت کرنے میں مالک کے شاگردوں کا اختلاف ہے، بعض راویوں نے اسے ابی عمرہ سے روایت کیا ہے، اور بعض نے ابن ابی عمرہ سے، ان کا نام عبدالرحمٰن بن ابی عمرہ انصاری ہے، ابن ابی عمرہ زیادہ صحیح ہے، کیونکہ مالک کے سوا دوسرے راویوں نے «عن عبدالرحمٰن بن أبي عمرة عن زيد بن خالد» کہا ہے «عن ابن أبي عمرة عن زيد بن خالد» کی سند سے اس کے علاوہ دوسری حدیث بھی مروی ہے، اور وہ صحیح حدیث ہے، ابو عمرہ زید بن خالد جہنی کے آزاد کردہ غلام تھے، اور ابو عمرہ کے واسطہ سے خالد سے حدیث غلول مروی ہے، اکثر لوگ عبدالرحمٰن بن ابی عمرہ ہی کہتے ہیں ۱؎۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2297,
			"arabicnumber": 2297,
			"text": "زید بن خالد جہنی رضی الله عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”سب سے بہتر گواہ وہ ہے جو گواہی طلب کیے جانے سے پہلے اپنی گواہی کا فریضہ ادا کر دے“۔ امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2299,
			"arabicnumber": 2299,
			"text": "ایمن بن خریم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم خطبہ کے لیے کھڑے ہوئے اور فرمایا: ”لوگو! جھوٹی گواہی اللہ کے ساتھ شرک کرنے کے برابر ہے، پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی «فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور» ”تو بتوں کی گندگی سے بچے رہو ( ان کی پرستش نہ کرو ) اور جھوٹ بولنے سے بچے رہو“ ( الحج: ۳۰ ) ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف سفیان بن زیاد کی روایت سے جانتے ہیں۔ اور لوگوں نے سفیان بن زیاد سے اس حدیث کی روایت کرنے میں اختلاف کیا ہے، ۳- نیز ہم ایمن بن خریم کا نبی اکرم صلی اللہ علیہ وسلم سے سماع بھی نہیں جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2300,
			"arabicnumber": 2300,
			"text": "خریم بن فاتک اسدی رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فجر پڑھائی، جب پلٹے تو خطبہ کے لیے کھڑے ہوئے اور فرمایا: ”جھوٹی گواہی اللہ کے ساتھ شرک کرنے کے برابر ہے“، آپ نے یہ بات تین مرتبہ دہرائی پھر آپ نے یہ مکمل آیت تلاوت فرمائی «واجتنبوا قول الزور» ”اور جھوٹی بات سے اجتناب کرو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث میرے نزدیک زیادہ صحیح ہے، ۲- خریم بن فاتک کو شرف صحابیت حاصل ہے، نبی اکرم صلی اللہ علیہ وسلم سے انہوں نے کئی حدیثیں روایت کی ہیں، اور مشہور صحابی ہیں۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2301,
			"arabicnumber": 2301,
			"text": "ابوبکرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کیا تمہیں بڑے بڑے ( کبیرہ ) گناہوں کے بارے میں نہ بتا دوں؟“ صحابہ نے عرض کیا: کیوں نہیں؟ اللہ کے رسول! آپ نے فرمایا: ”اللہ کے ساتھ شرک کرنا، ماں باپ کی نافرمانی کرنا اور جھوٹی گواہی دینا یا جھوٹی بات بولنا“، ابوبکرہ رضی الله عنہ کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم آخری بات کو برابر دہراتے رہے یہاں تک کہ ہم لوگوں نے دل میں کہا: کاش! آپ خاموش ہو جاتے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو رضی الله عنہما سے بھی حدیث آئی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2302,
			"arabicnumber": 2302,
			"text": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”سب سے اچھے لوگ میرے زمانہ کے ہیں ( یعنی صحابہ ) ، پھر وہ لوگ جو ان کے بعد آئیں گے ( یعنی تابعین ) ، پھر وہ لوگ جو ان کے بعد آئیں گے ( یعنی اتباع تابعین ) ۱؎، آپ صلی اللہ علیہ وسلم نے یہ بات تین مرتبہ دہرائی، پھر ان کے بعد ایسے لوگ آئیں گے جو موٹا ہونا چاہیں گے، موٹاپا پسند کریں گے اور گواہی طلب کیے جانے سے پہلے گواہی دیں گے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اعمش کے واسطہ سے علی بن مدرک کی روایت سے غریب ہے، ۲- اعمش کے دیگر شاگردوں نے «عن الأعمش عن هلال بن يساف عن عمران بن حصين» کی سند سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2303,
			"arabicnumber": 2303,
			"text": "عمر بن خطاب رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سب سے اچھے اور بہتر لوگ ہمارے زمانے والے ہیں، پھر وہ لوگ جو ان کے بعد ہوں گے، پھر وہ لوگ جو ان کے بعد ہوں گے، پھر جھوٹ عام ہو جائے گا یہاں تک کہ آدمی گواہی طلب کیے بغیر گواہی دے گا، اور قسم کھلائے بغیر قسم کھائے گا“۔ اور نبی اکرم صلی اللہ علیہ وسلم کی وہ حدیث کہ سب سے بہتر گواہ وہ ہے، جو گواہی طلب کیے بغیر گواہی دے تو اس کا مفہوم ہمارے نزدیک یہ ہے کہ جب کسی سے کسی چیز کی گواہی ( حق بات کی خاطر ) دلوائی جائے تو وہ گواہی دے، گواہی دینے سے باز نہ رہے، بعض اہل علم کے نزدیک دونوں حدیثوں میں تطبیق کی یہی صورت ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 10
			}
		}
	]
}