{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"39": "The Book on the Description of Hellfire"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن جہنم اس طرح لائی جائے گی کہ اس کی ستر ہزار لگام ہوں گی اور ہر لگام کے ساتھ ستر ہزار فرشتے اسے کھینچ رہے ہوں گے“۔ عبداللہ بن عبدالرحمٰن دارمی کہتے ہیں: ثوری نے اسے مرفوع نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن جہنم سے ایک گردن نکلے گی اس کی دو آنکھیں ہوں گی جو دیکھیں گی، دو کان ہوں گے جو سنیں گے اور ایک زبان ہو گی جو بولے گی، وہ کہے گی: مجھے تین لوگوں پر مقرر کیا گیا ہے: ہر سرکش ظالم پر، ہر اس آدمی پر جو اللہ کے سوا کسی دوسرے کو پکارتا ہو، اور مجسمہ بنانے والوں پر“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب صحیح ہے، ۲- اس باب میں ابو سعید خدری رضی الله عنہ سے بھی روایت ہے، ۳- بعض لوگوں نے یہ حدیث «عن الأعمش عن عطية عن أبي سعيد عن النبي صلى الله عليه وسلم» کی سند سے اسی طرح روایت کی ہے، ۴- اشعث بن سوار نے بھی «عن عطية عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم» کی سند سے اسی طرح روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "حسن بصری کہتے ہیں کہ عتبہ بن غزوان رضی الله عنہ نے ہمارے اس بصرہ کے منبر پر بیان کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اگر ایک بڑا بھاری پتھر جہنم کے کنارہ سے ڈالا جائے تو وہ ستر برس تک اس میں گرتا جائے گا پھر بھی اس کی تہہ تک نہیں پہنچے گا۔ عتبہ کہتے ہیں: عمر رضی الله عنہ کہا کرتے تھے: جہنم کو کثرت یاد کرو، اس لیے کہ اس کی گرمی بہت سخت ہے۔ اس کی گہرائی بہت زیادہ ہے اور اس کے آنکس ( آنکڑے ) لوہے کے ہیں۔ امام ترمذی کہتے ہیں: ہم عتبہ بن غزوان سے حسن بصری کا سماع نہیں جانتے ہیں، عمر رضی الله عنہ کے عہد خلافت میں عتبہ بن غزوان رضی الله عنہ بصرہ آئے تھے، اور حسن بصری کی ولادت اس وقت ہوئی جب عمر رضی الله عنہ کے عہد خلافت کے دو سال باقی تھے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” «صعود» جہنم کا ایک پہاڑ ہے، اس پر کافر ستر سال میں چڑھے گا اور اتنے ہی سال میں نیچے گرے گا اور یہ عذاب اسے ہمیشہ ہوتا رہے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث غریب ہے، ہم اسے صرف ابن لہیعہ کی روایت سے مرفوع جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کافر کے چمڑے کی موٹائی بیالیس گز ہو گی، اس کی ڈاڑھ احد پہاڑ جیسی ہو گی اور جہنم میں اس کے بیٹھنے کی جگہ اتنی ہو گی جتنا مکہ اور مدینہ کے درمیان کا فاصلہ“۔ امام ترمذی کہتے ہیں: یہ حدیث اعمش کی روایت سے حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن کافر کی ڈاڑھ احد پہاڑ جیسی ہو گی، اس کی ران بیضاء ( پہاڑ ) جیسی ہو گی اور جہنم کے اندر اس کے بیٹھنے کی جگہ تین میل کی مسافت کے برابر ہو گی جس طرح ربذہ کی دوری ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- «مثل الربذة» کا مطلب ہے کہ جس طرح ربذہ پہاڑ مدینہ سے دور ہے، ربذہ اور بیضاء احد کی طرح دو پہاڑ ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کافر کی ڈاڑھ احد جیسی ہو گی“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کافر اپنی زبان کو ایک یا دو فرسخ تک گھسیٹے گا اور لوگ اسے روندیں گے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے صرف اسی سند سے جانتے ہیں، ۲- فضل بن یزید کوفی ہیں، ان سے کئی ائمہ حدیث نے روایت کی ہے، ۳- ابوالمخارق غیر معروف راوی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم سے اللہ تعالیٰ کے قول «كالمهل» کے بارے میں فرمایا: ”وہ پانی تلچھٹ کی طرح ہو گا جب اسے ( کافر ) اپنے منہ کے قریب کرے گا تو اس کے چہرے کی کھال اس میں گر جائے گی“۔ امام ترمذی کہتے ہیں: یہ حدیث ہم صرف رشدین بن سعد کی روایت سے جانتے ہیں، اور رشدین کے بارے میں کلام کیا گیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جہنمیوں کے سر پر «ماء حمیم» ( گرم پانی ) انڈیلا جائے گا تو وہ ( بدن میں ) سرایت کر جائے گا یہاں تک کہ اس کے پیٹ تک جا پہنچے گا اور اس کے پیٹ کے اندر جو کچھ ہے اسے کاٹے گا یہاں تک کہ اس کے پیروں ( یعنی سرین ) سے نکل جائے گا۔ یہی وہ «صہر» ہے ( جس کا ذکر قرآن میں آیا ہے ) پھر اسی طرح لوٹا دیا جائے گا جس طرح تھا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "ابوامامہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اللہ تعالیٰ کے اس قول «ويسقى من ماء صديد يتجرعه» ( ابراہیم: ۱۶ ) کے بارے میں فرمایا: ” «صديد» ( پیپ ) اس کے منہ کے قریب کی جائے گی تو اسے ناپسند کرے گا جب اسے اور قریب کیا جائے گا تو اس کا چہرہ بھن جائے گا اور اس کے سر کی کھال گر جائے گی اور جب اسے پیئے گا تو اس کی آنت کٹ جائے گی یہاں تک کہ اس کے سرین سے نکل جائے گی۔ اللہ تعالیٰ فرماتا ہے «وسقوا ماء حميما فقطع أمعاءهم» ”وہ «ماء حمیم» ( گرم پانی ) پلائے جائیں گے تو وہ ان کی آنتوں کو کاٹ دے گا“ ( سورۃ محمد: ۱۵ ) اور اللہ تعالیٰ فرماتا ہے «وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب» ”اور اگر وہ فریاد کریں گے تو ان کی فریاد رسی ایسے پانی سے کی جائے گی جو تلچھٹ کی طرح ہو گا چہرے کو بھون دے گا اور وہ نہایت برا مشروب ہے“ ( الکہف: ۲۹ ) امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اسی طرح محمد بن اسماعیل بخاری نے بھی سند میں «عن عبيد الله بن بسر» کہا ہے اور ہم عبیداللہ بن بسر کو صرف اسی حدیث میں جانتے ہیں، ۳- صفوان بن عمر نے عبداللہ بن بسر سے جو نبی اکرم صلی اللہ علیہ وسلم کے صحابی ہیں، ایک دوسری حدیث روایت کی ہے، عبداللہ بن بسر کے ایک بھائی ہیں جنہوں نے نبی اکرم صلی اللہ علیہ وسلم سے سنی ہے اور ان کی ایک بہن نے بھی نبی اکرم صلی اللہ علیہ وسلم سے حدیث سنی ہے۔ جس عبیداللہ بن بسر سے صفوان بن عمرو نے یہ حدیث روایت کی ہے، یہ صحابی نہیں ہیں کوئی دوسرے آدمی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” «كالمهل» یعنی تلچھٹ کی طرح ہو گا جب اسے ( جہنمی ) اپنے قریب کرے گا تو اس کے چہرے کی کھال اس میں گر جائے گی“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت پڑھی «اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون» ”تم اللہ سے ڈرنے کی طرح ڈرو اور مسلمان ہی رہتے ہوئے مرو“ ( آل عمران: ۱۰۲ ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر «زقوم» تھوہڑ کا ایک قطرہ بھی دنیا کی زمین میں ٹپکا دیا جائے تو دنیا والوں کی معیشت بگڑ جائے، بھلا اس آدمی کا کیا ہو گا جس کی غذا ہی «زقوم» ہو۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "ابو الدرداء رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنمیوں پر بھوک مسلط کر دی جائے گی اور یہ عذاب کے برابر ہو جائے گی جس سے وہ دوچار ہوں گے، لہٰذا وہ فریاد کریں گے تو ان کی فریاد رسی «ضريع» ( خاردار پودا ) کے کھانے سے کی جائے گی جو نہ انہیں موٹا کرے گا اور نہ ان کی بھوک ختم کرے گا، پھر وہ دوبارہ کھانے کی فریاد کریں گے تو ان کی فریاد رسی گلے میں اٹکنے والے کھانے سے کی جائے گی، پھر وہ یاد کریں گے کہ دنیا میں اٹکے ہوئے نوالے کو پانی کے ذریعہ نگلتے تھے، چنانچہ وہ پانی کی فریاد کریں گے اور ان کی فریاد رسی «حميم» ( جہنمیوں کے مواد ) سے کی جائے گی جو لوہے کے برتنوں میں دیا جائے گا جب مواد ان کے چہروں سے قریب ہو گا تو ان کے چہروں کو بھون ڈالے گا اور جب ان کے پیٹ میں جائے گا تو ان کے پیٹ کے اندر جو کچھ ہے اسے کاٹ ڈالے گا، وہ کہیں گے: جہنم کے داروغہ کو بلاؤ، داروغہ کہیں گے: کیا تمہارے پاس رسول روشن دلائل کے ساتھ نہیں گئے تھے؟ وہ کہیں گے: کیوں نہیں، داروغہ کہیں گے: پکارتے رہو، کافروں کی پکار بیکار ہی جائے گی“۔ آپ نے فرمایا: ”جہنمی کہیں گے: مالک کو بلاؤ اور کہیں گے: اے مالک! چاہیئے کہ تیرا رب ہمارا فیصلہ کر دے ( ہمیں موت دیدے ) “، آپ نے فرمایا: ”ان کو مالک جواب دے گا: تم لوگ ( ہمیشہ کے لیے ) اسی میں رہنے والے ہو“۔ اعمش کہتے ہیں: مجھ سے بیان کیا گیا کہ ان کی پکار اور مالک کے جواب میں ایک ہزار سال کا وقفہ ہو گا، آپ نے فرمایا: ”جہنمی کہیں گے: اپنے رب کو پکارو اس لیے کہ تمہارے رب سے بہتر کوئی نہیں ہے، وہ کہیں گے: اے ہمارے رب! ہمارے اوپر شقاوت غالب آ گئی تھی اور ہم گمراہ لوگ تھے، اے ہمارے رب! ہمیں اس سے نکال دے اگر ہم پھر ویسا ہی کریں گے تو ظالم ہوں گے۔ آپ نے فرمایا: ”اللہ تعالیٰ انہیں جواب دے گا: پھٹکار ہو تم پر اسی میں پڑے رہو اور مجھ سے بات نہ کرو“، آپ نے فرمایا: ”اس وقت وہ ہر خیر سے محروم ہو جائیں گے اور اس وقت گدھے کی طرح رینکنے لگیں گے اور حسرت و ہلاکت میں گرفتار ہوں گے“۔ امام ترمذی کہتے ہیں: ۱- عبداللہ بن عبدالرحمٰن ( دارمی ) کہتے ہیں: لوگ اس حدیث کو مرفوعاً نہیں روایت کرتے ہیں، ۲- ہم اس حدیث کو صرف «عن الأعمش عن شمر بن عطية عن شهر بن حوشب عن أم الدرداء عن أبي الدرداء» کی سند سے جانتے ہیں جو ابودرداء کا اپنا قول ہے، مرفوع حدیث نہیں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اس آیت کریمہ «وهم فيها كالحون» ”کافر جہنم کے اندر بد شکل ہوں گے“ ( المؤمنون: ۱۰۴ ) کے بارے میں فرمایا: ”ان کے چہروں کو آگ جھلس دے گی تو ان کے اوپر کا ہونٹ سکڑ کر بیچ سر تک پہنچ جائے گا اور نیچے کا ہونٹ لٹک کر ناف سے جا لگے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "عبداللہ بن عمرو بن عاص رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر اس کے برابر ایک ٹکڑا ( اور آپ نے اپنے سر کی طرف اشارہ کیا ) آسمان سے زمین کی طرف جو پانچ سو سال کی مسافت ہے، چھوڑا جائے تو زمین پر رات سے پہلے پہنچ جائے گا اور اگر وہی ٹکڑا زنجیر ( جس کا ذکر ) قرآن میں آیا ہے: «ثم في سلسلة ذرعها سبعون ذراعا فاسلكوه» ( الحاقة: ۳۲ ) کے سر سے چھوڑا جائے تو اس زنجیر کی جڑ یا اس کی تہہ تک پہنچنے سے پہلے چالیس سال رات اور دن کے گزر جائیں“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کی سند حسن صحیح ہے، ۲- سعید بن یزید مصری ہیں۔ ان سے لیث بن سعد اور کئی ائمہ نے حدیث روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تمہاری ( دنیا کی ) آگ جسے تم جلاتے ہو جہنم کی آگ کے ستر حصوں میں سے ایک ٹکڑا ( حصہ ) ہے“، لوگوں نے عرض کیا: اللہ کے رسول! اگر یہی آگ رہتی تو کافی ہوتی، آپ نے فرمایا: ”وہ اس سے انہتر حصہ بڑھی ہوئی ہے، ہر حصے کی گرمی اسی آگ کی طرح ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تمہاری یہ آگ جہنم کی آگ کے ستر حصوں میں سے ایک حصہ ہے، اس کے ہر حصے کی گرمی اسی طرح ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث ابوسعید کی روایت سے حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم نے اپنے رب سے شکایت کی کہ میرا بعض حصہ بعض حصے کو کھائے جا رہا ہے لہٰذا اللہ تعالیٰ نے اس کے لیے دو سانسیں مقرر کر دیں: ایک سانس گرمی میں اور ایک سانس جاڑے میں، جہنم کے جاڑے کی سانس سے سخت سردی پڑتی ہے۔ اور اس کی گرمی کی سانس سے لو چلتی ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح ہے، ۲- ابوہریرہ رضی الله عنہ کے واسطہ سے یہ حدیث نبی اکرم صلی اللہ علیہ وسلم سے دوسری سند سے بھی مروی ہے، ۳- مفضل بن صالح محدثین کے نزدیک کوئی قوی حافظے والے نہیں ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم سے نکلے گا ( شعبہ نے اپنی روایت میں کہا ہے: ( اللہ تعالیٰ کہے گا، اسے جہنم سے نکال لو ) جس نے «لا إلٰہ إلا اللہ» کہا اور اس کے دل میں ایک جو کے دانہ کے برابر بھلائی تھی، اسے جہنم سے نکالو جس نے «لا إلٰہ إلا اللہ» کہا، اور اس کے دل میں گیہوں کے دانہ کے برابر بھلائی تھی، اسے جہنم سے نکالو جس نے «لا إلٰہ إلا اللہ» کہا اس کے دل میں رائی کے دانہ کے برابر بھلائی تھی۔ ( شعبہ نے کہا ہے: جوار کے برابر بھلائی تھی ) “۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں جابر، ابو سعید خدری اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "انس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ کہے گا: اسے جہنم سے نکال لو جس نے ایک دن بھی مجھے یاد کیا یا ایک مقام پر بھی مجھ سے ڈرا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم سے سب سے آخر میں نکلنے والے آدمی کو میں جانتا ہوں، وہ ایسا آدمی ہو گا جو سرین کے بل چلتے ہوئے نکلے گا اور عرض کرے گا: اے میرے رب! لوگ جنت کی تمام جگہ لے چکے ہوں گے“، آپ نے فرمایا: ”اس سے کہا جائے گا: چلو جنت میں داخل ہو جاؤ“، آپ نے فرمایا: ”وہ داخل ہونے کے لیے جائے گا ( جنت کو اس حال میں ) پائے گا کہ لوگ تمام جگہ لے چکے ہیں، وہ واپس آ کر عرض کرے گا: اے میرے رب! لوگ تمام جگہ لے چکے ہیں؟ !“، آپ نے فرمایا: ”اس سے کہا جائے گا: کیا وہ دن یاد ہیں جن میں ( دنیا کے اندر ) تھے؟“ وہ کہے گا: ہاں، اس سے کہا جائے گا: ”آرزو کرو“، آپ نے فرمایا: ”وہ آرزو کرے گا، اس سے کہا جائے گا: تمہارے لیے وہ تمام چیزیں جس کی تم نے آرزو کی ہے اور دنیا کے دس گنا ہے“۔ آپ نے فرمایا: ”وہ کہے گا: ( اے باری تعالیٰ! ) آپ مذاق کر رہے ہیں حالانکہ آپ مالک ہیں“، ابن مسعود کہتے ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم کو ہنستے دیکھا حتیٰ کہ آپ کے اندرونی کے دانت نظر آنے لگے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "ابوذر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم سے سب سے آخر میں نکلنے اور جنت میں سب سے آخر میں داخل ہونے والے آدمی کو میں جانتا ہوں، ایک آدمی کو لایا جائے گا اور اللہ تعالیٰ ( فرشتوں سے ) کہے گا: اس سے اس کے چھوٹے چھوٹے گناہوں کے بارے میں پوچھو اور اس کے بڑے گناہوں کو چھپا دو، اس سے کہا جائے گا: تم نے فلاں فلاں دن ایسے ایسے گناہ کئے تھے، تم نے فلاں فلاں دن ایسے ایسے گناہ کیے تھے؟“، آپ نے فرمایا: ”اس سے کہا جائے گا: تمہارے ہر گناہ کے بدلے ایک نیکی ہے“۔ آپ نے فرمایا: ”وہ عرض کرے گا: اے میرے رب! میں نے کچھ ایسے بھی گناہ کیے تھے جسے یہاں نہیں دیکھ رہا ہوں“۔ ابوذر رضی الله عنہ کہتے ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم کو ہنستے ہوئے دیکھا حتیٰ کہ آپ کے اندرونی دانت نظر آنے لگے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”موحدین میں سے کچھ لوگ جہنم میں عذاب دئیے جائیں گے، یہاں تک کہ کوئلہ ہو جائیں گے، پھر ان پر رحمت الٰہی سایہ فگن ہو گی تو وہ نکالے جائیں گے اور جنت کے دروازے پر ڈال دئیے جائیں گے“۔ آپ نے فرمایا: ”جنتی ان پر پانی چھڑکیں گے تو وہ ویسے ہی اگیں گے جیسے سیلاب کی مٹیوں میں دانہ اگتا ہے، پھر وہ جنت میں داخل ہوں گے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ دوسری سند سے بھی جابر سے مروی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جہنم سے وہ آدمی نکلے گا جس کے دل میں ذرہ برابر ایمان ہو گا، ابو سعید خدری رضی الله عنہ نے کہا: جس کو شک ہو وہ یہ آیت پڑھے «إن الله لا يظلم مثقال ذرة» ”اللہ ذرہ برابر بھی ظلم نہیں کرتا ہے“ ( النساء: ۴۰ ) ۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم میں داخل ہونے والوں میں سے دو آدمیوں کی چیخ بلند ہو گی“۔ رب عزوجل کہے گا: ان دونوں کو نکالو، جب انہیں نکالا جائے گا تو اللہ تعالیٰ ان سے پوچھے گا: تمہاری چیخ کیوں بلند ہو رہی ہے؟ وہ دونوں عرض کریں گے: ہم نے ایسا اس وجہ سے کیا تاکہ تو ہم پر رحم کر۔ اللہ تعالیٰ فرمائے گا: تم دونوں کے لیے ہماری رحمت یہی ہے کہ تم جاؤ اور اپنے آپ کو اسی جگہ جہنم میں ڈال دو جہاں پہلے تھے۔ وہ دونوں چلیں گے ان میں سے ایک اپنے آپ کو جہنم میں ڈال دے گا تو اللہ تعالیٰ اس کے لیے جہنم کو ٹھنڈا اور سلامتی والی بنا دے گا اور دوسرا کھڑا رہے گا اور اپنے آپ کو نہیں ڈالے گا۔ اس سے رب عزوجل پوچھے گا: تمہیں جہنم میں اپنے آپ کو ڈالنے سے کس چیز نے روکا؟ جیسے تمہارے ساتھی نے اپنے آپ کو ڈالا؟ وہ عرض کرے گا: اے میرے رب! مجھے امید ہے کہ تو جہنم سے نکالنے کے بعد اس میں دوبارہ نہیں داخل کرے گا، اس سے رب تعالیٰ کہے گا: تمہارے لیے تیری تمنا پوری کی جا رہی ہے، پھر وہ دونوں اللہ کی رحمت سے جنت میں داخل ہوں گے“۔ امام ترمذی کہتے ہیں: اس حدیث کی سند ضعیف ہے، اس لیے کہ یہ رشدین بن سعد کے واسطہ سے مروی ہے، اور رشدین بن سعد محدثین کے نزدیک ضعیف ہیں، اور رشدین عبدالرحمٰن بن انعم سے روایت کرتے ہیں، یہ ابن انعم افریقی ہیں اور افریقی بھی محدثین کے نزدیک ضعیف ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "عمران بن حصین رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”میری امت کی ایک جماعت میری شفاعت کے سبب جہنم سے نکلے گی ان کا نام جہنمی رکھا جائے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے جہنم جیسی کوئی چیز نہیں دیکھی جس سے بھاگنے والے سو رہے ہیں اور جنت جیسی کوئی چیز نہیں دیکھی جس کے طلب کرنے والے سو رہے ہیں“۔ امام ترمذی کہتے ہیں: اس کو ہم صرف یحییٰ بن عبیداللہ کی سند سے جانتے ہیں اور یحییٰ بن عبیداللہ اکثر محدثین کے نزدیک ضعیف ہیں، ان کے بارے میں شعبہ نے کلام کیا ہے۔ یحییٰ بن عبیداللہ کے دادا کا نام موہب ہے اور وہ مدنی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے جنت میں جھانکا تو دیکھا کہ اکثر جنتی فقیر ہیں اور جہنم میں جھانکا تو دیکھا کہ اکثر جہنمی عورتیں ہیں“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے جہنم میں جھانکا تو دیکھا کہ اکثر جہنمی عورتیں ہیں اور جنت میں جھانکا تو دیکھا کہ اکثر جنتی فقیر ہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- عوف نے سند بیان کرتے ہوئے اس طرح کہا ہے: «عن أبي رجاء عن عمران بن حصين» اور ایوب نے کہا: «عن أبي رجاء عن ابن عباس»،‏‏‏‏ دونوں سندوں میں کوئی کلام نہیں ہے۔ اس بات کا احتمال ہے کہ ابورجاء نے عمران بن حصین اور ابن عباس دونوں سے سنا ہو، عوف کے علاوہ دوسرے لوگوں نے بھی یہ حدیث ابورجاء کے واسطہ سے عمران بن حصین سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "نعمان بن بشیر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن سب سے ہلکا عذاب والا وہ جہنمی ہو گا جس کے تلوے میں دو انگارے ہوں گے جن سے اس کا دماغ کھول رہا ہو گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عباس بن عبدالمطلب، ابو سعید خدری اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "حارثہ بن وہب خزاعی رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”کیا میں تمہیں جنتیوں کے بارے میں نہ بتا دوں؟ ہر کمزور حال آدمی جسے لوگ حقیر سمجھیں اگر وہ اللہ کی قسم کھائے تو اللہ اسے پوری کر دے۔ کیا میں تمہیں جہنمیوں کے بارے میں نہ بتا دوں؟ ہر سرکش، بخیل اور متکبر“، ( جہنم میں جائے گا۔ ) امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "جرہد رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم مسجد میں جرہد کے پاس ( یعنی میرے پاس سے ) سے گزرے ( اس وقت ) ان کی ران کھلی ہوئی تھی تو آپ نے فرمایا: ”ران بھی ستر ( چھپانے کی چیز ) ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- میرے نزدیک اس کی سند متصل نہیں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 19
			}
		}
	]
}