{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"4": "The Book on the Day of Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 488,
			"arabicnumber": 488,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سب سے بہتر دن جس میں سورج نکلا، جمعہ کا دن ہے، اسی دن آدم کو پیدا کیا گیا، اسی دن انہیں جنت میں داخل کیا گیا، اسی دن انہیں جنت سے نکالا گیا، اور قیامت بھی اسی دن قائم ہو گی“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابولبابہ، سلمان، ابوذر، سعد بن عبادہ اور اوس بن اوس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": 489,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جمعہ کے روز اس گھڑی کو جس میں دعا کی قبولیت کی امید کی جاتی ہے عصر سے لے کر سورج ڈوبنے تک کے درمیان تلاش کرو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے غریب ہے، ۲- یہ حدیث انس رضی الله عنہ سے بھی کئی سندوں سے مروی ہے، ۳- محمد بن ابی حمید ضعیف گردانے جاتے ہیں، بعض اہل علم نے ان کے حفظ کے تعلق سے ان کی تضعیف کی ہے، انہیں حماد بن ابی حمید بھی کہا جاتا ہے، نیز کہا جاتا ہے کہ یہی ابوابراہیم انصاری ہیں اور یہ منکرالحدیث ہیں، ۴- صحابہ کرام وغیرہم میں سے بعض اہل علم کا خیال ہے کہ یہ گھڑی جس میں قبولیت دعا کی امید کی جاتی ہے عصر کے بعد سے سورج ڈوبنے کے درمیان ہے، یہی احمد اور اسحاق بن راہویہ بھی کہتے ہیں۔ احمد کہتے ہیں: اس گھڑی کے سلسلے میں جس میں دعا کی قبولیت کی امید کی جاتی ہے زیادہ تر حدیثیں یہی آئی ہیں کہ یہ عصر کے بعد سے سورج ڈوبنے کے درمیان ہے، نیز سورج ڈھلنے کے بعد بھی اس کے ہونے کی امید کی جاتی ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": 490,
			"text": "عمرو بن عوف مزنی رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جمعہ میں ایک گھڑی ایسی ہے کہ بندہ جو کچھ بھی اس میں مانگتا ہے اللہ اسے عطا کرتا ہے“، لوگوں نے عرض کیا: اللہ کے رسول! یہ کون سی گھڑی ہے؟ آپ نے فرمایا: ”نماز ( جمعہ ) کھڑی ہونے کے وقت سے لے کر اس سے پلٹنے یعنی نماز ختم ہونے تک ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عمرو بن عوف کی حدیث حسن غریب ہے، ۲- اس باب میں ابوموسیٰ، ابوذر، سلمان، عبداللہ بن سلام، ابولبابہ، سعد بن عبادہ اور ابوامامہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": 491,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سب سے بہتر دن جس میں سورج نکلا جمعہ کا دن ہے، اسی دن آدم پیدا کیے گئے، اسی دن وہ جنت میں داخل کیے گئے، اسی دن وہ جنت سے ( زمین پر اتارے گئے ) اس دن میں ایک گھڑی ایسی ہے کہ جسے مسلم بندہ نماز کی حالت میں پائے اور اللہ سے اس میں کچھ طلب کرے تو اللہ اسے ضرور عطا فرمائے گا، ابوہریرہ رضی الله عنہ کہتے ہیں: پھر میں عبداللہ بن سلام سے ملا اور ان سے اس حدیث کا ذکر کیا تو انہوں نے کہا: میں یہ گھڑی اچھی طرح جانتا ہوں، میں نے کہا: مجھے بھی اس کے بارے میں بتائیے اور اس سلسلہ میں مجھ سے بخل نہ کیجئے، انہوں نے کہا: یہ عصر کے بعد سے لے کر سورج ڈوبنے کے درمیان ہے، اس پر میں نے کہا: یہ عصر کے بعد کیسے ہو سکتی ہے جب کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ”اسے مسلمان بندہ حالت نماز میں پائے اور یہ وقت ایسا ہے جس میں نماز نہیں پڑھی جاتی؟ تو عبداللہ بن سلام نے کہا: کیا رسول اللہ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا ہے کہ جو شخص نماز کے انتظار میں کسی جگہ بیٹھا رہے تو وہ بھی نماز ہی میں ہوتا ہے؟ میں نے کہا: کیوں نہیں، ضرور فرمایا ہے تو انہوں نے کہا: تو یہی مراد ہے ۱؎۔ امام ترمذی کہتے ہیں: ۱- اس حدیث میں ایک طویل قصہ ہے، ۲- یہ حدیث حسن صحیح ہے، ۳- اور آپ کے اس قول «أخبرني بها ولا تضنن بها علي» کے معنی ہیں اسے مجھے بتانے میں بخل نہ کیجئے، «ضنّ» کے معنی بخل کے ہیں اور «ظنين» کے معنی، متہم کے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": 492,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا: ”جو جمعہ کی نماز کے لیے آئے اسے چاہیئے کہ ( پہلے ) غسل کر لے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس بات میں عمر، ابو سعید خدری، جابر، براء، عائشہ اور ابو الدرداء سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": 493,
			"text": "نیز ابن شہاب زہری سے یہ حدیث بطریق: «الزهري عن عبد الله بن عبد الله بن عمر عن أبيه عن النبي صلى الله عليه وسلم» بھی مروی ہے، محمد بن اسماعیل بخاری کہتے ہیں: زہری کی حدیث جسے انہوں نے بطریق: «سالم عن أبيه عبدالله بن عمر» روایت کی ہے اور جو حدیث انہوں نے بطریق: «عبدالله بن عبدالله بن عمر عن أبيه عبدالله بن عمر» روایت کی ہے دونوں حدیثیں صحیح ہیں، اور زہری کے بعض تلامذہ نے اسے بطریق: «الزهري عن آل عبد الله بن عمر عن عبد الله بن عمر» روایت کی ہے۔ امام ترمذی کہتے ہیں: جمعہ کے دن کے غسل کے سلسلہ میں بطریق: «ابن عمر عن عمر عن النبي صلى الله عليه وسلم» مرفوعاً مروی ہے، ( جو آگے آ رہی ہے ) اور یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": 494,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ عمر بن خطاب رضی الله عنہ جمعہ کے روز خطبہ دے رہے تھے کہ اسی دوران صحابہ میں سے ایک شخص ۱؎ ( مسجد میں ) داخل ہوئے، تو عمر رضی الله عنہ نے پوچھا: یہ کون سا وقت ( آنے کا ) ہے؟ تو انہوں نے کہا: میں نے صرف اتنی دیر کی کہ اذان سنی اور بس وضو کر کے آ گیا ہوں، اس پر عمر رضی الله عنہ نے کہا: تم نے صرف ( وضو ہی پر اکتفا کیا ) حالانکہ تمہیں معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے غسل کا حکم دیا ہے؟",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": 495,
			"text": "اس سند سے بھی زہری سے یہی حدیث مروی ہے۔ اور مالک نے بھی یہ حدیث بطریق: «عن الزہری عن سالم» ‏‏‏‏ روایت کی ہے، وہ سالم بن عمر کہتے ہیں کہ عمر بن خطاب رضی الله عنہ جمعہ کے دن خطبہ دے رہے تھے، آگے انہوں نے پوری حدیث ذکر کی۔ امام ترمذی کہتے ہیں: میں نے اس سلسلے میں محمد بن اسماعیل بخاری سے پوچھا تو انہوں نے کہا: صحیح زہری کی حدیث ہے جسے انہوں نے بطریق: «سالم عن أبیہ» روایت کی ہے۔ محمد بن اسماعیل بخاری کہتے ہیں کہ مالک سے بھی اسی حدیث کی طرح مروی ہے، انہوں نے بطریق: «الزهري عن سالم عن أبيه» بھی روایت کی ہے۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": 496,
			"text": "اوس بن اوس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے جمعہ کے دن غسل کیا اور غسل کرایا، اور سویرے پہنچا، شروع سے خطبہ میں شریک رہا، امام کے قریب بیٹھا اور غور سے خطبہ سنا اور خاموش رہا تو اسے اس کے ہر قدم کے بدلے ایک سال کے روزے اور رات کے قیام کا ثواب ملے گا“۔ وکیع کہتے ہیں: اس کا معنی ہے کہ اس نے خود غسل کیا اور اپنی عورت کو بھی غسل کرایا۔ امام ترمذی کہتے ہیں: ۱- اوس بن اوس کی حدیث حسن ہے، ۲- عبداللہ بن مبارک نے اس حدیث کے سلسلہ میں کہا ہے کہ «من غسل واغتسل» کے معنی ہیں: جس نے اپنا سر دھویا اور غسل کیا، ۳- اس باب میں ابوبکر، عمران بن حصین، سلمان، ابوذر، ابوسعید، ابن عمر، اور ابوایوب رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": 497,
			"text": "سمرہ بن جندب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے جمعہ کے دن وضو کیا تو اس نے رخصت کو اختیار کیا اور خوب ہے یہ رخصت، اور جس نے غسل کیا تو غسل افضل ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- سمرہ رضی الله عنہ کی حدیث حسن ہے، ۲- قتادہ کے بعض تلامذہ نے تو یہ حدیث قتادہ سے اور قتادہ نے حسن بصری سے اور حسن بصری نے سمرہ بن جندب سے ( مرفوعاً ) روایت کی ہے۔ اور بعض نے قتادہ سے اور قتادہ نے حسن سے اور حسن نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کی ہے، ۳- اس باب میں ابوہریرہ، عائشہ اور انس رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- صحابہ کرام اور ان کے بعد کے اہل علم کا عمل اسی پر ہے، انہوں نے جمعہ کے دن کے غسل کو پسند کیا ہے، ان کا خیال ہے کہ غسل کے بدلے وضو بھی کافی ہو جائے گا، ۵- شافعی کہتے ہیں: جمعہ کے روز نبی اکرم صلی اللہ علیہ وسلم کے غسل کے حکم کے وجوبی ہونے کے بجائے اختیاری ہونے پر جو چیزیں دلالت کرتی ہیں ان میں سے عمر رضی الله عنہ کی حدیث بھی ہے جس میں انہوں نے عثمان رضی الله عنہ سے کہا ہے کہ تم نے صرف وضو پر اکتفا کیا ہے حالانکہ تمہیں معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جمعہ کے دن غسل کا حکم دیا ہے، اگر انہیں یہ معلوم ہوتا کہ یہ حکم واجبی ہے، اختیاری نہیں تو عمر رضی الله عنہ عثمان رضی الله عنہ کو لوٹائے بغیر نہ چھوڑتے اور ان سے کہتے: جاؤ غسل کرو، اور نہ ہی عثمان رضی الله عنہ سے اس بات کے جاننے کے باوجود کہ نبی اکرم صلی اللہ علیہ وسلم نے جمعہ کو غسل کرنے کا حکم دیا ہے اس کے وجوب کی حقیقت مخفی رہتی، بلکہ اس حدیث میں صاف دلالت ہے کہ جمعہ کے دن غسل افضل ہے نہ کہ واجب۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": 498,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم فرمایا: ”جس نے وضو کیا اور اچھی طرح کیا ۱؎ پھر جمعہ کے لیے آیا ۲؎، امام کے قریب بیٹھا، غور سے خطبہ سنا اور خاموش رہا تو اس کے اس جمعہ سے لے کر دوسرے جمعہ تک کے اور مزید تین دن کے ۳؎ کے گناہ ۴؎ بخش دیئے جائیں گے۔ اور جس نے کنکریاں ہٹائیں تو اس نے لغو کیا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے جمعہ کے روز جنابت کے غسل کی طرح ( یعنی خوب اہتمام سے ) غسل کیا پھر نماز جمعہ کے لیے ( پہلی گھڑی میں ) گیا تو گویا اس نے ایک اونٹ اللہ کی راہ میں قربان کیا، اور جو اس کے بعد والی گھڑی میں گیا تو گویا اس نے ایک گائے قربان کی، اور جو تیسری گھڑی میں گیا تو گویا اس نے ایک سینگوں والا مینڈھا قربان کیا اور جو چوتھی گھڑی میں گیا تو گویا اس نے ایک مرغی کا صدقہ کر کے اللہ کا تقرب حاصل کیا، اور جو پانچویں گھڑی میں گیا تو گویا اس نے ایک انڈا اللہ کی راہ میں صدقہ کیا، پھر جب امام خطبہ کے لیے گھر سے نکل آیا تو فرشتے ذکر سننے کے لیے حاضر ہو جاتے ہیں ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو اور سمرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": 500,
			"text": "ابوالجعد ضمری رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو جمعہ تین بار سستی ۱؎ سے حقیر جان کر چھوڑ دے گا تو اللہ اس کے دل پر مہر لگا دے گا“۔ امام ترمذی کہتے ہیں: ۱- ابوالجعد کی حدیث حسن ہے، ۲- میں نے محمد بن اسماعیل بخاری سے ابوالجعد ضمری کا نام پوچھا تو وہ نہیں جان سکے، ۳- اس حدیث کے علاوہ میں ان کی کوئی اور حدیث نہیں جانتا جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہو، ۴- ہم اس حدیث کو صرف محمد بن عمرو کی روایت سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": 501,
			"text": "اہل قباء میں سے ایک شخص اپنے والد سے روایت کرتا ہے – اس کے والد صحابہ میں سے ہیں – وہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم قباء سے آ کر جمعہ میں شریک ہوں۔ اس سلسلے میں ابوہریرہ رضی الله عنہ سے بھی روایت کی گئی ہے، وہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں، لیکن یہ صحیح نہیں ہے۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کو ہم صرف اسی سند سے جانتے ہیں، اور اس باب میں نبی اکرم صلی اللہ علیہ وسلم سے مروی کوئی چیز صحیح نہیں ہے، ۲- ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جمعہ اس پر فرض ہے جو رات کو اپنے گھر والوں تک پہنچ سکے“، اس حدیث کی سند ضعیف ہے، یہ حدیث معارک بن عباد سے روایت کی جاتی ہے اور معارک عبداللہ بن سعید مقبری سے روایت کرتے ہیں، یحییٰ بن سعید قطان نے عبداللہ بن سعید مقبری کی حدیث کی تضعیف کی ہے، ۳- اہل علم کا اس میں اختلاف ہے کہ جمعہ کس پر واجب ہے، بعض کہتے ہیں: جمعہ اس شخص پر واجب ہے جو رات کو اپنے گھر پہنچ سکے اور بعض کہتے ہیں: جمعہ صرف اسی پر واجب جس نے اذان سنی ہو، شافعی، احمد اور اسحاق بن راہویہ کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": 502,
			"text": "میں نے احمد بن حسن کو کہتے سنا کہ ہم لوگ احمد بن حنبل کے پاس تھے تو لوگوں نے ذکر کیا کہ جمعہ کس پر واجب ہے؟ تو امام احمد نے اس سلسلے میں نبی اکرم صلی اللہ علیہ وسلم سے کوئی چیز ذکر نہیں کی، احمد بن حسن کہتے ہیں: تو میں نے احمد بن حنبل سے کہا: اس سلسلہ میں ابوہریرہ رضی الله عنہ کی روایت ہے جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، تو امام احمد نے پوچھا کیا نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے؟ میں نے کہا: ہاں ( نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے ) ، پھر احمد بن حسن نے «حجاج بن نصير حدثنا معارك بن عباد عن عبد الله بن سعيد المقبري عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم» روایت کی ہے کہ آپ نے فرمایا: ”جمعہ اس پر واجب ہے جو رات کو اپنے گھر والوں کے پاس لوٹ کر آ سکے“، احمد بن حسن کہتے ہیں کہ احمد بن حنبل مجھ پر غصہ ہوئے اور مجھ سے کہا: اپنے رب سے استغفار کرو، اپنے رب سے استغفار کرو۔ امام ترمذی کہتے ہیں: احمد بن حنبل نے ایسا اس لیے کیا کہ انہوں نے اس حدیث کو کوئی حیثیت نہیں دی اور اسے کسی شمار میں نہیں رکھا، سند کی وجہ سے اسے ضعیف قرار دیا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": 503,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جمعہ کی نماز اس وقت پڑھتے جب سورج ڈھل جاتا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": 504,
			"text": "اس سند سے بھی انس رضی الله عنہ نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کرتے ہیں۔ امام ترمذی کہتے ہیں: ۱- انس رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں سلمہ بن الاکوع، جابر اور زبیر بن عوام رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اور اسی پر اکثر اہل علم کا اجماع ہے کہ جمعہ کا وقت ظہر کے وقت کی طرح اس وقت شروع ہوتا ہے جب سورج ڈھل جائے، یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۴- اور بعض کی رائے ہے کہ جمعہ کی نماز جب زوال سے پہلے پڑھ لی جائے تو جائز ہے۔ احمد کہتے ہیں: جس نے جمعہ کی نماز زوال سے پہلے پڑھ لی تو اس پر دہرانا ضروری نہیں۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کھجور کے ایک تنے پر ( کھڑے ہو کر ) خطبہ دیتے تھے، جب آپ صلی اللہ علیہ وسلم نے منبر بنا لیا تو وہ تنا رو پڑا یہاں تک کہ آپ اس کے پاس آئے اور اسے چمٹا لیا تو وہ چپ ہو گیا۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن غریب صحیح ہے، ۲- اس باب میں انس، جابر، سہل بن سعد، ابی بن کعب، ابن عباس اور ام سلمہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ اکرم صلی اللہ علیہ وسلم جمعہ کے دن خطبہ دیتے پھر ( بیچ میں ) بیٹھتے، پھر کھڑے ہوتے اور خطبہ دیتے، راوی کہتے ہیں: جیسے آج کل تم لوگ کرتے ہو۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس، جابر بن عبداللہ اور جابر بن سمرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- یہی اہل علم کی رائے ہے کہ دونوں خطبوں کے درمیان بیٹھ کر فصل کرے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "جابر بن سمرہ رضی الله عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتا تھا تو آپ کی نماز بھی درمیانی ہوتی تھی اور خطبہ بھی درمیانا ہوتا تھا۔ ( یعنی زیادہ لمبا نہیں ہوتا تھا ) امام ترمذی کہتے ہیں: ۱- جابر بن سمرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عمار بن یاسر اور ابن ابی اوفی رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": 508,
			"text": "یعلیٰ بن امیہ رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو منبر پر پڑھتے سنا: «ونادوا يا مالك» ۱؎ ”اور وہ پکار کر کہیں گے اے مالک!“ امام ترمذی کہتے ہیں: ۱- یعلیٰ بن امیہ رضی الله عنہ کی حدیث حسن صحیح غریب ہے، اور یہی ابن عیینہ کی حدیث ہے، ۲- اس باب میں ابوہریرہ اور جابر بن سمرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کی ایک جماعت نے امام کے خطبہ میں قرآن کی کچھ آیتیں پڑھنے کو پسند کیا ہے ۲؎، شافعی کہتے ہیں: امام جب خطبہ دے اور اس میں قرآن کچھ نہ پڑھے تو خطبہ دہرائے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": 509,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب منبر پر بیٹھتے تو ہم اپنا منہ آپ کی طرف کر لیتے۔ امام ترمذی کہتے ہیں: ۱- منصور کی حدیث کو ہم صرف محمد بن فضل بن عطیہ کی روایت سے جانتے ہیں، ۲- محمد بن فضل بن عطیہ ہمارے اصحاب کے نزدیک ضعیف اور ذاہب الحدیث ہیں، ۳- اس باب میں نبی اکرم صلی اللہ علیہ وسلم سے روایت کی گئی کوئی چیز صحیح نہیں ہے ۱؎، ۴- صحابہ کرام وغیرہم میں سے اہل علم کا عمل اسی پر ہے، وہ خطبے کے وقت امام کی طرف رخ کرنا مستحب سمجھتے ہیں اور یہی سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۵- اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": 510,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جمعہ کے دن خطبہ دے رہے تھے کہ اسی دوران ایک شخص آیا تو آپ نے اُسے پوچھا: کیا تم نے نماز پڑھ لی؟ اس نے کہا: نہیں، آپ نے فرمایا: ”اٹھو اور ( دو رکعت ) نماز پڑھ لو“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے اور اس باب میں سب سے زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": 511,
			"text": "عیاض بن عبداللہ بن ابی سرح سے روایت ہے کہ ابو سعید خدری رضی الله عنہ جمعہ کے دن ( مسجد میں ) داخل ہوئے، مروان بن حکم خطبہ دے رہے تھے، وہ کھڑے ہو کر نماز پڑھنے لگے، پہریدار آئے تاکہ انہیں بٹھا دیں لیکن وہ نہیں مانے اور نماز پڑھ ہی لی، جب وہ نماز سے فارغ ہوئے تو ہم نے ان کے پاس آ کر کہا: اللہ آپ پر رحم فرمائے قریب تھا کہ یہ لوگ آپ سے ہاتھا پائی کر بیٹھتے، تو انہوں نے کہا: میں تو یہ دونوں رکعتیں ہرگز چھوڑنے والا تھا نہیں، بعد اس کے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسا کرتے دیکھا ہے، پھر انہوں نے بیان کیا کہ ایک شخص جمعہ کے دن پراگندہ حالت میں آیا، نبی اکرم صلی اللہ علیہ وسلم جمعہ کے دن خطبہ دے رہے تھے تو آپ نے اسے دو رکعت پڑھنے کا حکم دیا، اس نے دو رکعتیں پڑھیں اور نبی اکرم صلی اللہ علیہ وسلم خطبہ دے رہے تھے۔ ابن ابی عمر کہتے ہیں: سفیان بن عیینہ جب مسجد میں آتے اور امام خطبہ دے رہا ہوتا تو دو رکعتیں پڑھتے تھے، وہ اس کا حکم بھی دیتے تھے، اور ابوعبدالرحمٰن المقری بھی اسے درست سمجھتے تھے۔ امام ترمذی کہتے ہیں: ۱- ابو سعید خدری رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- میں نے ابن ابی عمر کو کہتے سنا کہ سفیان بن عیینہ کہتے تھے کہ محمد بن عجلان ثقہ ہیں اور حدیث میں مامون ہیں، ۳- اس باب میں جابر، ابوہریرہ اور سہل بن سعد رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- بعض اہل علم کا اسی پر عمل ہے، شافعی، احمد اور اسحاق بن راہویہ بھی اسی کے قائل ہیں اور بعض کہتے ہیں کہ جب کوئی مسجد میں داخل ہو اور امام خطبہ دے رہا ہو تو وہ بیٹھ جائے نماز نہ پڑھے، یہی سفیان ثوری اور اہل کوفہ کا قول ہے، ۵- پہلا قول زیادہ صحیح ہے۔ علاء بن خالد قرشی کہتے ہیں: میں نے حسن بصری کو دیکھا کہ وہ جمعہ کے دن مسجد میں داخل ہوئے اور امام خطبہ دے رہا تھا، تو انہوں نے دو رکعت نماز پڑھی، پھر بیٹھے، حسن بصری نے ایسا حدیث کی اتباع میں کیا، یہ حدیث انہوں نے جابر سے اور جابر نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": 512,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے جمعہ کے دن امام کے خطبہ کے دوران کسی سے کہا: چپ رہو تو اس نے لغو بات کی یا اس نے اپنا جمعہ لغو کر لیا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن ابی اوفی اور جابر بن عبداللہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اسی پر عمل ہے، علماء نے آدمی کے لیے خطبہ کے دوران گفتگو کرنا مکروہ جانا ہے اور کہا ہے کہ اگر کوئی دوسرا گفتگو کرے تو اسے بھی منع نہ کرے سوائے اشارے کے، ۴- البتہ دوران خطبہ سلام کے جواب دینے اور چھینکنے والے کے جواب میں «يرحمك الله» کہنے کے سلسلہ میں اختلاف ہے بعض اہل علم نے دوران خطبہ سلام کا جواب دینے اور چھینکنے والے کے جواب میں «يرحمك الله» کہنے کی اجازت دی ہے، احمد اور اسحاق بن راہویہ کا یہی قول ہے اور تابعین وغیرہم میں سے بعض اہل علم نے اسے مکروہ قرار دیا ہے، اور یہی شافعی کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "معاذ بن انس جہنی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جمعہ کے دن جس نے لوگوں کی گردنیں پھاندیں اس نے جہنم کی طرف لے جانے والا پل بنا لیا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- اس باب میں جابر سے بھی روایت ہے۔ سہل بن معاذ بن انس جہنی کی حدیث غریب ہے، اسے ہم صرف رشد بن سعد کی روایت سے جانتے ہیں، ۲- البتہ اہل علم کا عمل اسی پر ہے۔ انہوں نے اس بات کو مکروہ سمجھا ہے، کہ آدمی جمعہ کے دن لوگوں کی گردنیں پھاندے اور انہوں نے اس میں سختی سے کام لیا ہے۔ اور ان کے حفظ کے تعلق سے انہیں ضعیف گردانا ہے۔ بعض اہل علم نے رشدین بن سعد پر کلام کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": 514,
			"text": "معاذ بن انس جہنی رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے جمعہ کے دن جب کہ امام خطبہ دے رہا ہو گھٹنوں کو پیٹ کے ساتھ ملا کر بیٹھنے سے منع فرمایا ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- عام اہل علم نے جمعہ کے دن حبوہ کو مکروہ جانا ہے، اور بعض نے اس کی رخصت دی ہے، انہیں میں سے عبداللہ بن عمر وغیرہ ہیں۔ احمد اور اسحاق بن راہویہ بھی یہی کہتے ہیں، یہ دونوں امام کے خطبہ دینے کی حالت میں حبوہ کرنے میں کوئی مضائقہ نہیں سمجھتے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": 515,
			"text": "حصین کہتے ہیں کہ بشر بن مروان خطبہ دے رہے تھے، انہوں نے دعا ۱؎ کے لیے اپنے دونوں ہاتھ اٹھائے، تو میں نے عمارہ بن رویبہ کو کہتے سنا: اللہ ان دونوں چھوٹے ہاتھوں کو غارت کرے، میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا آپ صرف اس طرح کرتے تھے اس سے زیادہ کچھ نہیں، اور ہشیم نے اپنی انگشت شہادت سے اشارہ کیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": 516,
			"text": "سائب بن یزید رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر و عمر رضی الله عنہما کے زمانے میں ( پہلی ) اذان اس وقت ہوتی جب امام نکلتا اور ( دوسری ) جب نماز کھڑی ہوتی ۱؎ پھر جب عثمان رضی الله عنہ خلیفہ ہوئے تو انہوں نے زوراء ۲؎ میں تیسری اذان کا اضافہ کیا ۳؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": 517,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم ضرورت کی بات اس وقت کرتے جب آپ منبر سے اترتے۔ امام ترمذی کہتے ہیں: ہم اس حدیث کو صرف جریر بن حازم کی روایت سے جانتے ہیں، اور میں نے محمد بن اسماعیل بخاری کو کہتے سنا کہ جریر بن حازم کو اس حدیث میں وہم ہوا ہے، اور صحیح وہی ہے جو بطریق: «ثابت عن أنس» مروی ہے، انس رضی الله عنہ کہتے ہیں کہ نماز کھڑی ہوئی اور ایک آدمی نے نبی اکرم صلی اللہ علیہ وسلم کا ہاتھ پکڑا تو آپ برابر اس سے گفتگو کرتے رہے یہاں تک کہ بعض لوگوں کو اونگھ آنے لگی۔ محمد بن اسماعیل بخاری کہتے ہیں: حدیث یہی ہے، اور جریر کو کبھی کبھی وہم ہو جاتا ہے حالانکہ وہ صدوق ہیں۔ محمد بن اسماعیل بخاری کہتے ہیں کہ جریر بن حازم کو ثابت کی حدیث میں ( بھی ) جسے ثابت نے انس سے اور انس نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے وہم ہوا ہے ( جو یہ ہے کہ ) آپ نے فرمایا: جب نماز کھڑی ہو جائے تو تم اس وقت تک نہ کھڑے ہو جب تک کہ مجھے نہ دیکھ لو۔ محمد بن اسماعیل بخاری کہتے ہیں: نیز حماد بن زید سے روایت کی جاتی ہے کہ ہم لوگ ثابت بنانی کے پاس تھے، اور حجاج صواف نے یحییٰ ابن ابی کثیر کے واسطہ سے حدیث بیان کی، جسے یحییٰ نے عبداللہ بن ابوقتادہ سے اور عبداللہ نے اپنے والد ابوقتادہ سے اور ابوقتادہ رضی الله عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ نے فرمایا: ”جب نماز کھڑی ہو جائے تو تم کھڑے نہ ہو جب تک کہ مجھے نہ دیکھ لو“ چنانچہ جریر کو وہم ہوا، انہیں گمان ہوا کہ ثابت نے ان سے بیان کیا ہے اور ثابت نے انس سے اور انس نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": 518,
			"text": "انس رضی الله عنہ کہتے ہیں کہ نماز کھڑی ہو جانے کے بعد میں نے نبی اکرم صلی اللہ علیہ وسلم کو دیکھا کہ آپ سے ایک آدمی باتیں کر رہا ہے، اور آپ اس کے اور قبلے کے درمیان کھڑے ہیں، آپ برابر اس سے گفتگو کرتے رہے، میں نے دیکھا کہ نبی اکرم صلی اللہ علیہ وسلم کے طول قیام کی وجہ سے بعض لوگ اونگھ رہے ہیں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": 519,
			"text": "عبیداللہ بن ابی رافع کہتے ہیں: مروان نے ابوہریرہ رضی الله عنہ کو مدینے میں اپنا نائب مقرر کیا اور وہ خود مکہ کی طرف نکلے، ابوہریرہ رضی الله عنہ نے ہمیں جمعہ کے دن نماز پڑھائی تو انہوں نے ( پہلی رکعت میں ) سورۃ الجمعہ پڑھی اور دوسری رکعت میں «إذا جاءك المنافقون»،‏‏‏‏ عبیداللہ کہتے ہیں: تو میں ابوہریرہ رضی الله عنہ سے ملا، میں نے ان سے کہا: آپ نے دو ایسی سورتیں پڑھی ہیں جنہیں علی رضی الله عنہ کوفہ میں پڑھتے ہیں، اس پر ابوہریرہ رضی الله عنہ نے کہا: میں نے ان دونوں سورتوں کو رسول اللہ صلی اللہ علیہ وسلم کو پڑھتے سنا ہے۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس، نعمان بن بشیر اور ابوعنبہ خولانی رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- نبی اکرم صلی اللہ علیہ وسلم سے یہ بھی مروی ہے کہ آپ جمعہ کی نماز میں «سبح اسم ربك الأعلى» اور «هل أتاك حديث الغاشية» پڑھتے تھے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 520,
			"arabicnumber": 520,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں «الم ‏تنزيل السجدةَ»،‏‏‏‏ «هل أتى على الإنسان» پڑھتے تھے۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں سعد، ابن مسعود اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- سفیان ثوری، شعبہ اور کئی لوگوں نے بھی یہ حدیث مخول بن راشد سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 521,
			"arabicnumber": 521,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جمعہ کے بعد دو رکعت ( سنت ) پڑھتے تھے ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر رضی الله عنہ سے بھی روایت ہے، ۳- یہ حدیث بطریق «نافع عن ابن عمر» ہے، ۴- اسی پر بعض اہل علم کا عمل ہے، اور یہی شافعی اور احمد بھی کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 522,
			"arabicnumber": 522,
			"text": "نافع سے روایت ہے ابن عمر رضی الله عنہما جب جمعہ پڑھ لیتے تو ( گھر ) واپس آتے اور دو رکعت اپنے گھر میں پڑھتے پھر کہتے رسول اللہ صلی اللہ علیہ وسلم ایسا ہی کرتے تھے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": 523,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو تم میں سے جمعہ کے بعد نماز پڑھے تو چاہیئے کہ چار رکعت پڑھے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- بعض اہل علم کا اسی پر عمل ہے، ۳- نیز عبداللہ بن مسعود رضی الله عنہ سے بھی مروی ہے کہ وہ جمعہ سے پہلے چار رکعتیں اور اس کے بعد بھی چار رکعتیں پڑھتے تھے، ۴- اور علی بن ابی طالب رضی الله عنہ سے بھی مروی ہے کہ انہوں نے حکم دیا کہ جمعہ کے بعد پہلے دو پھر چار رکعتیں پڑھی جائیں، ۵- سفیان ثوری اور ابن مبارک بھی ابن مسعود کے قول کی طرف گئے ہیں، ۶- اسحاق بن راہویہ کہتے ہیں: جمعہ کے دن اگر مسجد میں پڑھے تو چار رکعتیں اور اگر اپنے گھر میں پڑھے تو دو رکعتیں پڑھے، ان کی دلیل یہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم جمعہ کے بعد دو رکعتیں اپنے گھر میں پڑھتے تھے۔ اور نبی اکرم صلی اللہ علیہ وسلم کی ( یہ بھی ) حدیث ہے کہ تم میں سے جو کوئی جمعہ کے بعد نماز پڑھے تو چار رکعتیں پڑھے، ۷- ابن عمر رضی الله عنہما ہی ہیں جنہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ جمعہ کے بعد دو رکعتیں اپنے گھر میں پڑھتے تھے۔ اور ابن عمر رضی الله عنہما نے خود نبی اکرم صلی اللہ علیہ وسلم کے بعد مسجد میں جمعہ کے بعد دو رکعتیں پڑھیں اور دو رکعتوں کے بعد چار رکعتیں پڑھیں۔ عطا سے روایت کی ہے کہ میں نے ابن عمر رضی الله عنہما کو دیکھا کہ انہوں نے جمعہ کے بعد دو رکعتیں پڑھیں۔ اس کے بعد چار رکعتیں پڑھیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": 524,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے نماز میں ایک رکعت پا لی اس نے نماز پا لی“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، صحابہ کرام وغیرہم میں سے اکثر اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں کہ جس نے جمعہ کی ایک رکعت پا لی تو وہ دوسری رکعت ( خود سے ) پڑھ لے اور جس نے لوگوں کو سجدے میں پایا تو وہ چار رکعت ( ظہر کی نماز ) پڑھے۔ اور یہی سفیان ثوری، ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ بھی کہتے ہیں ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": 525,
			"text": "سہل بن سعد رضی الله عنہ کہتے ہیں ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں جمعہ کے بعد ہی کھانا کھاتے اور قیلولہ کرتے تھے۔ امام ترمذی کہتے ہیں: ۱- سہل بن سعد کی حدیث حسن صحیح ہے، ۲- اس باب میں انس بن مالک سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": 526,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی جمعہ کے دن اونگھے تو اپنی جگہ بدل دے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": 527,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے عبداللہ بن رواحہ رضی الله عنہ کو ایک سریہ میں بھیجا، اتفاق سے وہ جمعہ کا دن تھا، ان کے ساتھی صبح سویرے روانہ ہو گئے، انہوں نے ( اپنے جی میں ) کہا: میں پیچھے رہ جاتا ہوں، اور رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھ لیتا ہوں۔ پھر میں ان لوگوں سے جا ملوں گا، چنانچہ جب انہوں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی، تو آپ نے انہیں دیکھ کر فرمایا: ”تمہیں کس چیز نے اپنے ساتھیوں کے ساتھ جانے سے روک دیا؟“، عرض کیا: میں نے چاہا کہ میں آپ کے ساتھ نماز پڑھ لوں پھر میں ان سے جا ملوں گا۔ آپ نے فرمایا: ”اگر تم جو کچھ زمین میں ہے سب خرچ کر ڈالو تو بھی ان کے صبح روانہ ہونے کا ثواب نہیں پاس کو گے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم صرف اسی سند سے اسے جانتے ہیں، ۲- یحییٰ بن سعید کہتے ہیں کہ شعبہ کہتے ہیں کہ حکم نے مقسم سے صرف پانچ حدیثیں سنی ہیں اور شعبہ نے انہیں گن کر بتایا تو یہ حدیث شعبہ کی گنی ہوئی حدیثوں میں نہیں تھی۔ گویا حکم نے یہ حدیث مقسم سے نہیں سنی ہے، ۳- جمعہ کے دن سفر کے سلسلے میں اہل علم کا اختلاف ہے۔ بعض لوگوں نے جمعہ کے دن سفر پر نکلنے میں کوئی حرج نہیں جانا ہے جب کہ نماز کا وقت نہ ہوا ہو اور بعض کہتے ہیں، جب جمعہ کی صبح ہو جائے تو جمعہ پڑھے بغیر نہ نکلے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": 528,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسلمانوں پر لازم ہے کہ وہ جمعہ کے دن غسل کریں اور ہر ایک اپنے گھر والوں کی خوشبو میں سے خوشبو لگائے، اگر اسے خوشبو میسر نہ ہو تو پانی ہی اس کے لیے خوشبو ہے“۔ اس باب میں ابوسعید رضی الله عنہ اور ایک انصاری شیخ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": 529,
			"text": "اس سند سے بھی اسی طرح مروی ہے۔ امام ترمذی کہتے ہیں: ۱- براء رضی الله عنہ کی حدیث حسن ہے، ۲- ہشیم کی روایت ( رقم ۵۲۹ ) اسماعیل بن ابراہیم تیمی کی روایت ( رقم ۵۲۸ ) سے زیادہ اچھی ہے، ۳- اسماعیل بن ابراہیم تیمی کو حدیث کے سلسلے میں ضعیف گردانا جاتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 42
			}
		}
	]
}