{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"42": "Chapters on Seeking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2688,
			"arabicnumber": 2688,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، تم جنت میں داخل نہیں ہو سکتے جب تک کہ تم ( صحیح معنوں میں ) مومن نہ بن جاؤ اور تم مومن نہیں ہو سکتے جب تک کہ تم آپس میں ایک دوسرے سے ( سچی ) محبت نہ کرنے لگو۔ کیا میں تمہیں ایک ایسی چیز نہ بتاؤں کہ اگر تم اسے کرنے لگو تو تم میں باہمی محبت پیدا ہو جائے ( وہ یہ کہ ) آپس میں سلام کو عام کرو ( پھیلاؤ ) “ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن سلام، شریح بن ہانی عن ابیہ، عبداللہ بن عمرو، براء، انس اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2689,
			"arabicnumber": 2689,
			"text": "عمران بن حصین رضی الله عنہ سے روایت ہے کہ ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر کہا: «السلام عليكم»،‏‏‏‏ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” ( اس کے لیے ) دس نیکیاں ہیں“، پھر ایک دوسرا شخص آیا اور اس نے کہا: «السلام عليكم ورحمة الله»،‏‏‏‏ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” ( اس کے لیے ) بیس نیکیاں ہیں“، پھر ایک اور آدمی آیا اور اس نے کہا: «السلام عليكم ورحمة الله وبركاته»،‏‏‏‏ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” ( اس کے لیے ) تیس نیکیاں ہیں“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے حسن صحیح غریب ہے، ۲- اس باب میں علی، ابوسعید اور سہل بن حنیف سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2690,
			"arabicnumber": 2690,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ ابوموسیٰ اشعری رضی الله عنہ نے عمر رضی الله عنہ سے ان کے پاس حاضر ہونے کی اجازت طلب کی تو انہوں نے کہا: «السلام عليكم» کیا میں اندر آ سکتا ہوں؟ عمر رضی الله عنہ نے ( دل میں ) کہا: ابھی تو ایک بار اجازت طلب کی ہے، تھوڑی دیر خاموش رہ کر پھر انہوں نے کہا: «السلام عليكم» کیا میں اندر آ سکتا ہوں؟ عمر رضی الله عنہ نے ( دل میں ) کہا: ابھی تو دو ہی بار اجازت طلب کی ہے۔ تھوڑی دیر ( مزید ) خاموش رہ کر انہوں نے پھر کہا: «السلام عليكم» کیا مجھے اندر داخل ہونے کی اجازت ہے؟ عمر رضی الله عنہ نے ( دل میں کہا ) تین بار اجازت طلب کر چکے، پھر ابوموسیٰ اشعری رضی الله عنہ واپس ہو لیے، عمر رضی الله عنہ نے دربان سے کہا: ابوموسیٰ نے کیا کیا؟ اس نے کہا: لوٹ گئے۔ عمر رضی الله عنہ نے کہا انہیں بلا کر میرے پاس لاؤ، پھر جب وہ ان کے پاس آئے تو عمر رضی الله عنہ نے کہا: یہ آپ نے کیا کیا ہے؟ انہوں نے کہا: میں نے سنت پر عمل کیا ہے، عمر رضی الله عنہ نے کہا سنت پر؟ قسم اللہ کی! تمہیں اس کے سنت ہونے پر دلیل و ثبوت پیش کرنا ہو گا ورنہ میں تمہارے ساتھ سخت برتاؤ کروں گا۔ ابو سعید خدری کہتے ہیں: پھر وہ ہمارے پاس آئے، اس وقت ہم انصار کی ایک جماعت کے ساتھ تھے۔ ابوموسیٰ اشعری نے کہا: اے انصار کی جماعت! کیا تم رسول اللہ صلی اللہ علیہ وسلم کی حدیث کو دوسرے لوگوں سے زیادہ جاننے والے نہیں ہو، کیا رسول اللہ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا: «الاستئذان ثلاث» ( اجازت طلبی ) تین بار ہے۔ اگر تمہیں اجازت دے دی جائے تو گھر میں جاؤ اور اگر اجازت نہ دی جائے تو لوٹ جاؤ؟ ( یہ سن کر ) لوگ ان سے ہنسی مذاق کرنے لگے، ابو سعید خدری کہتے ہیں: میں نے اپنا سر ابوموسیٰ اشعری کی طرف اونچا کر کے کہا: اس سلسلے میں جو بھی سزا آپ کو ملے گی میں اس میں حصہ دار ہوں گا، راوی کہتے ہیں: پھر وہ ( ابوسعید ) عمر رضی الله عنہ کے پاس آئے، اور ان کو اس حدیث کی خبر دی، عمر نے کہا: مجھے اس حدیث کا علم نہیں تھا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، اور جریری کا نام سعید بن ایاس ہے اور ان کی کنیت ابومسعود ہے۔ یہ حدیث ان کے سوا اور لوگوں نے بھی ابونضرہ سے روایت کی ہے، اور ابونضرہ عبدی کا نام منذر بن مالک بن قطعہ ہے، ۲- اس باب میں علی اور سعد کی آزاد کردہ لونڈی رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2691,
			"arabicnumber": 2691,
			"text": "عمر بن خطاب رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے آپ کے پاس آنے کی تین بار اجازت مانگی، تو آپ نے مجھے اجازت دے دی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ابوزمیل کا نام سماک الحنفی ہے، ۳- میرے نزدیک عمر کو ابوموسیٰ کی اس بات پر اعتراض اور انکار اس وجہ سے تھا کہ ابوموسیٰ نے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اجازت تین بار طلب کی جائے، اگر اجازت مل جائے تو ٹھیک ور نہ لوٹ جاؤ“۔ ( رہ گیا عمر رضی الله عنہ کا اپنا معاملہ ) تو انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے تین بار اجازت طلب کی تھی تو انہیں اجازت مل گئی تھی، اس حدیث کی خبر انہیں نہیں تھی جسے ابوموسیٰ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، آپ نے فرمایا: ”پھر اگر اندر جانے کی اجازت مل جائے تو ٹھیک ورنہ واپس لوٹ جاؤ“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2692,
			"arabicnumber": 2692,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ ایک شخص مسجد میں آیا ( اس وقت ) رسول اللہ صلی اللہ علیہ وسلم مسجد کے ایک کونے میں تشریف فرما تھے۔ اس نے نماز پڑھی پھر آ کر آپ کو سلام عرض کیا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا «وعليك» ”تم پر بھی سلام ہو، جاؤ دوبارہ نماز پڑھو کیونکہ تم نے نماز نہیں پڑھی“، پھر راوی نے پوری حدیث بیان کی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- یحییٰ بن سعید قطان نے یہ حدیث عبیداللہ بن عمر سے اور عبیداللہ بن عمر نے سعید مقبری سے روایت کی ہے، اس میں انہوں نے «عن أبيه عن أبي هريرة» کہا ہے، اس میں «فسلم عليه وقال وعليك» ”اس نے آپ کو سلام کیا اور آپ نے کہا تم پر بھی سلام ہو“ کا ذکر نہیں کیا، ۳- یحییٰ بن سعید کی حدیث زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2693,
			"arabicnumber": 2693,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کا بیان ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: ”جبرائیل تمہیں سلام کہتے ہیں، تو انہوں نے جواب میں کہا: وعلیہ السلام ورحمۃ اللہ وبرکاتہ۔ ان پر بھی سلام اور اللہ کی رحمت اور اس کی برکتیں ہوں“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں بنی نمیر کے ایک شخص سے بھی روایت ہے وہ اپنے باپ سے اور وہ ان کے دادا کے واسطہ سے روایت کرتے ہیں، ۳- زہری نے بھی یہ حدیث ابوسلمہ کے واسطہ سے عائشہ سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2694,
			"arabicnumber": 2694,
			"text": "ابوامامہ رضی الله عنہ کہتے ہیں کہ پوچھا گیا: اللہ کے رسول! جب دو آدمی آپس میں ملیں تو سلام کرنے میں پہل کون کرے؟ آپ نے فرمایا: ”ان دونوں میں سے جو اللہ کے زیادہ قریب ہے“ ۱؎۔ ( وہ پہل کرے گا ) امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- محمد بن اسماعیل بخاری کہتے ہیں: ابوفروہ رہاوی مقارب الحدیث ہیں، مگر ان کے بیٹے محمد بن یزید ان سے منکر حدیثیں روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2695,
			"arabicnumber": 2695,
			"text": "عبداللہ بن عمرو بن عاص رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”وہ شخص ہم میں سے نہیں ہے جو ہمارے غیروں سے مشابہت اختیار کرے، نہ یہود کی مشابہت کرو اور نہ نصاریٰ کی، یہودیوں کا سلام انگلیوں کا اشارہ ہے اور نصاریٰ کا سلام ہتھیلیوں کا اشارہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کی سند ضعیف ہے، ۲- ابن مبارک نے یہ حدیث ابن لھیعہ سے روایت کی ہے، اور اسے انہوں نے مرفوع نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2696,
			"arabicnumber": 2696,
			"text": "سیار کہتے ہیں کہ میں ثابت بنانی کے ساتھ جا رہا تھا، وہ بچوں کے پاس سے گزرے تو انہیں سلام کیا، ثابت نے ( اپنا واقعہ بیان کرتے ہوئے ) کہا: میں انس رضی الله عنہ کے ساتھ ( جا رہا ) تھا وہ بچوں کے پاس سے گزرے تو انہوں نے سلام کیا، پھر انس نے ( اپنا واقعہ بیان کرتے ہوئے ) کہا: میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا، آپ بچوں کے پاس سے گزرے تو انہیں سلام کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث صحیح ہے، ۲- اسے کئی لوگوں نے ثابت سے روایت کیا ہے، ۳- یہ حدیث متعدد سندوں سے انس رضی الله عنہ سے بھی روایت کی گئی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2697,
			"arabicnumber": 2697,
			"text": "اسماء بنت یزید رضی الله عنہا بیان کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک دن مسجد میں گزرے وہاں عورتوں کی ایک جماعت بیٹھی ہوئی تھی، چنانچہ آپ نے انہیں اپنے ہاتھ کے اشارے سے سلام کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- عبدالحمید ( راوی ) نے بھی پتے ہاتھ سے اشارہ کیا ( کہ اس طرح ) ، ۳- احمد بن حنبل کہتے ہیں: شہر بن حوشب کے واسطہ سے عبدالحمید بن بہرام کی روایت میں کوئی حرج نہیں ہے، ۴- محمد بن اسماعیل بخاری کہتے ہیں: شہر حسن الحدیث ہیں اور ان کو روایت حدیث میں قوی بخاری کہتے ہیں: ان کے بارے میں ابن عون نے کلام کیا ہے۔ ابن عون کہتے ہیں: «إن شهرا نزكوه» کے واسطہ سے کہا: شہر کی شخصیت کو محدثین نے داغ دار بتایا ہے۔ ابوداؤد کہتے ہیں کہ نضر کہتے ہیں «نزكوه» کا مطلب یہ ہے کہ «طعنوا فيه» یعنی ان کی شخصیت کو داغ دار بتایا ہے، اور لوگوں نے ان پر جرح اس لیے کی ہے کہ وہ سلطان ( حکومت ) کے ملازم بن گئے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2698,
			"arabicnumber": 2698,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: ”بیٹے! جب تم اپنے گھر والوں کے پاس جاؤ تو انہیں سلام کیا کرو، یہ سلام تمہارے لیے اور تمہارے گھر والوں کے لیے خیر و برکت کا باعث ہو گا“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2699,
			"arabicnumber": 2699,
			"text": "جابر بن عبداللہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بات چیت شروع کرنے سے پہلے سلام کیا کرو“",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2700,
			"arabicnumber": 2700,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یہود و نصاریٰ کو سلام کرنے میں پہل نہ کرو، اور جب تمہاری ان کے کسی فرد سے راستے میں ملاقات ہو جائے تو اسے تنگ راستے سے ہی جانے پر مجبور کرو“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2701,
			"arabicnumber": 2701,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ کچھ یہودیوں نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر کہا: «السّام عليك» ”تم پر موت و ہلاکت آئے“، نبی اکرم صلی اللہ علیہ وسلم نے جواب میں فرمایا: «عليكم» ۱؎، عائشہ نے ( اس پر دو لفظ بڑھا کر ) کہا «بل عليكم السام واللعنة» ”بلکہ تم پر ہلاکت اور لعنت ہو“۔ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عائشہ! اللہ تعالیٰ ہر معاملے میں رفق، نرم روی اور ملائمیت کو پسند کرتا ہے“، عائشہ رضی الله عنہا نے کہا: کیا آپ نے سنا نہیں؟ انہوں نے کیا کہا ہے؟ ۔ آپ نے فرمایا: ”تبھی تو میں نے «عليكم» کہا ہے۔ امام ترمذی کہتے ہیں: ۱- عائشہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابو بصرہ غفاری، ابن عمر، انس اور ابوعبدالرحمٰن جہنی سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2702,
			"arabicnumber": 2702,
			"text": "اسامہ بن زید رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ایک ایسی مجلس کے پاس سے گزرے جس میں مسلمان اور یہود دونوں تھے تو آپ نے انہیں سلام کیا ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2703,
			"arabicnumber": 2703,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سوار پیدل چلنے والے کو اور پیدل چلنے والا بیٹھے ہوئے کو، اور تھوڑے لوگ زیادہ لوگوں کو ( یعنی چھوٹی جماعت بڑی جماعت کو سلام کرے“۔ اور ابن مثنی نے اپنی روایت میں اتنا اضافہ کیا ہے: ”چھوٹا اپنے بڑے کو سلام کرے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث ابوہریرہ رضی الله عنہ سے متعدد سندوں سے مروی ہے، ۲- ایوب سختیانی، یونس بن عبید اور علی بن یزید کہتے ہیں کہ حسن بصری نے ابوہریرہ رضی الله عنہ سے نہیں سنا ہے، ۳- اس باب میں عبدالرحمٰن بن شبل، فضالہ بن عبید اور جابر رضی الله عنہ سے بھی احادیث آئی ہیں۔)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2704,
			"arabicnumber": 2704,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”چھوٹا بڑے کو، چلنے والا بیٹھے ہوئے کو اور تھوڑے لوگ زیادہ لوگوں کو سلام کریں“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2705,
			"arabicnumber": 2705,
			"text": "فضالہ بن عبید رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سوار پیدل چلنے والے کو اور چلنے والا کھڑے ہوئے شخص کو اور تھوڑے لوگ زیادہ لوگوں کو سلام کریں“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2706,
			"arabicnumber": 2706,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی شخص کسی مجلس میں پہنچے تو سلام کرے، پھر اگر اس کا دل بیٹھنے کو چاہے تو بیٹھ جائے۔ پھر جب اٹھ کر جانے لگے تو سلام کرے۔ پہلا ( سلام ) دوسرے ( سلام ) سے زیادہ ضروری نہیں ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- یہ حدیث ابن عجلان سے بھی آئی ہے، ابن عجلان نے بسند «سعيد المقبري عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم» روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2707,
			"arabicnumber": 2707,
			"text": "ابوذر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( گھر میں داخل ہونے کی ) اجازت ملنے سے پہلے ہی جس نے ( دروازے کا ) پردہ کھسکا کر کسی کے گھر کے اندر جھانکا، اور گھر والے کی بیوی کی پردہ دری کی تو اس نے ایک ایسا کام کیا جس کا کرنا اس کے لیے حلال نہ تھا، جس وقت اس نے اپنی نگاہ اندر ڈالی تھی کاش اس وقت اس کا سامنا کسی ایسے شخص سے ہو جاتا جو اس کی دونوں آنکھیں پھوڑ دیتا تو میں اس پر اسے خوں بہا نہ دیتا۔ اور اگر کوئی شخص ایسے دروازے کے سامنے سے گزرا جس پر کوئی پردہ پڑا ہوا نہیں ہے اور دروازہ بند بھی نہیں ہے پھر اس کی نظر اٹھ گئی تو اس کی کچھ خطا نہیں۔ غلطی و کوتاہی تو گھر والے کی ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اس طرح کی حدیث صرف ابن لہیعہ کی روایت سے جانتے ہیں، ۳- اس باب میں ابوہریرہ اور ابوامامہ رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2708,
			"arabicnumber": 2708,
			"text": "انس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم اپنے گھر میں تھے ( اسی دوران ) ایک شخص نے آپ کے گھر میں جھانکا، آپ صلی اللہ علیہ وسلم تیر کا پھل لے کر لپکے ( کہ اس کی آنکھیں پھوڑ دیں ) لیکن وہ فوراً پیچھے ہٹ گیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2709,
			"arabicnumber": 2709,
			"text": "سہل بن سعد ساعدی رضی الله عنہ سے روایت ہے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے حجرے میں ایک سوراخ سے جھانکا ( اس وقت ) نبی اکرم صلی اللہ علیہ وسلم کے ہاتھ میں ایک لکڑی تھی جس سے آپ اپنا سر کھجا رہے تھے۔ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اگر مجھے ( پہلے سے ) معلوم ہوتا کہ تو جھانک رہا ہے تو میں اسے تیری آنکھ میں کونچ دیتا ( تجھے پتا نہیں ) اجازت مانگنے کا حکم تو دیکھنے کے سبب ہی سے ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2710,
			"arabicnumber": 2710,
			"text": "کلدہ بن حنبل رضی الله عنہ نے بیان کیا کہ صفوان بن امیہ نے انہیں دودھ، پیوسی اور ککڑی کے ٹکڑے دے کر نبی اکرم صلی اللہ علیہ وسلم کے پاس بھیجا اور آپ اس وقت مکہ کے اونچائی والے حصہ میں تھے، میں آپ کے پاس اجازت لیے اور سلام کئے بغیر چلا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”واپس باہر جاؤ، پھر کہو «السلام علیکم»،‏‏‏‏ کیا میں اندر آ سکتا ہوں؟“ یہ اس وقت کی بات ہے جب صفوان اسلام لا چکے تھے۔ عمرو بن عبداللہ کہتے ہیں: یہ حدیث امیہ بن صفوان نے مجھ سے بیان کی ہے لیکن انہوں نے یہ نہیں کہا کہ یہ حدیث میں نے کلدہ سے سنی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اسے ہم صرف ابن جریج کی روایت ہی سے جانتے ہیں، ۳- ابوعاصم نے بھی ابن جریج سے اسی طرح روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2711,
			"arabicnumber": 2711,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے ایک قرض کے سلسلے میں جو میرے والد کے ذمہ تھا کچھ بات کرنے کے لیے آپ کے پاس حاضر ہونے کی اجازت مانگی تو آپ نے کہا: ”کون ہے؟“۔ میں نے کہا: میں ہوں، آپ نے فرمایا: ”میں میں ( کیا ہے؟ ) “ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2712,
			"arabicnumber": 2712,
			"text": "جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے لوگوں کو سفر سے رات میں بیویوں کے پاس لوٹ کر آنے سے روکا ہے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ حدیث کئی سندوں سے جابر رضی الله عنہ کے واسطہ سے نبی اکرم صلی اللہ علیہ وسلم سے آئی ہے، ۳- اس باب میں انس، ابن عمر، اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- ابن عباس رضی الله عنہما سے بھی مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے لوگوں کو رات میں بیویوں کے پاس سفر سے واپس لوٹ کر آنے سے روکا ابن عباس رضی الله عنہما کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم کے اس روکنے کے باوجود دو شخص رات میں لوٹ کر اپنی بیویوں کے پاس آئے ( نتیجہ انہیں اس نافرمانی کا یہ ملا ) کہ ان دونوں میں سے ہر ایک نے اپنی بیوی کے پاس ایک دوسرے مرد کو پایا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2713,
			"arabicnumber": 2713,
			"text": "جابر رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی تحریر لکھے تو لکھنے کے بعد اس پر مٹی ڈالنا چاہیئے، کیونکہ اس سے حاجت برآری کی زیادہ توقع ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث منکر ہے، ۲- ہم اسے صرف اسی سند سے ابوزبیر کی روایت سے جانتے ہیں، ۳- حمزہ ہمارے نزدیک عمرو نصیبی کے بیٹے ہیں، اور وہ حدیث بیان کرنے میں ضعیف مانے جاتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2714,
			"arabicnumber": 2714,
			"text": "زید بن ثابت رضی الله عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچا۔ آپ کے سامنے ایک کاتب بیٹھا ہوا تھا۔ میں نے سنا آپ اس سے فرما رہے تھے: ”تم اپنا قلم اپنے کان پر رکھے رہا کرو کیونکہ اس سے لکھوانے والوں کو آگاہی و یاد دہانی ہو جایا کرے گی“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف اسی سند سے جانتے ہیں اور یہ سند ضعیف ہے، ۳- عنبسہ بن عبدالرحمٰن اور محم بن زاذان، دونوں حدیث بیان کرنے میں ضعیف قرار دیئے گئے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2715,
			"arabicnumber": 2715,
			"text": "زید بن ثابت رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں آپ کے لیے یہود کی کچھ تحریر سیکھ لوں، آپ نے فرمایا: ”قسم اللہ کی! میں یہود کی تحریر پر اعتماد و اطمینان نہیں کرتا“، چنانچہ ابھی آدھا مہینہ بھی نہیں گزرا تھا کہ میں نے آپ کے لیے اسے سیکھ لیا۔ کہتے ہیں: پھر جب میں نے سیکھ لیا اور آپ کو یہودیوں کے پاس کچھ لکھ کر بھیجنا ہوا تو میں نے لکھ کر ان کے پاس بھیج دیا، اور جب یہودیوں نے کوئی چیز لکھ کر آپ کے پاس بھیجی تو میں نے ان کی کتاب ( تحریر ) پڑھ کر آپ کو سنا دی ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ حدیث اس سند کے علاوہ بھی دوسری سند سے زید بن ثابت رضی الله عنہ سے مروی ہے، اسے اعمش نے ثابت بن عبید انصاری کے واسطہ سے زید بن ثابت رضی الله عنہ سے روایت کی ہے، وہ کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم فرمایا کہ میں سریانی زبان سیکھ لوں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2716,
			"arabicnumber": 2716,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی وفات سے پہلے کسریٰ و قیصر، نجاشی اور سارے سرکش و متکبر بادشاہوں کو اللہ کی طرف دعوت دیتے ہوئے خطوط لکھ کر بھیجے۔ اس نجاشی سے وہ نجاشی ( بادشاہ حبش اصحمہ ) مراد نہیں ہے کہ جن کے انتقال پر نبی اکرم صلی اللہ علیہ وسلم نے نماز جنازہ پڑھی تھی۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2717,
			"arabicnumber": 2717,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ ابوسفیان بن حرب رضی الله عنہ نے ان سے بیان کیا کہ وہ قریش کے کچھ تاجروں کے ساتھ شام میں تھے کہ ہرقل ( شہنشاہ شام ) نے انہیں بلا بھیجا، تو وہ سب اس کے پاس آئے، پھر سفیان نے آگے بات بڑھائی۔ کہا: پھر اس نے رسول اللہ صلی اللہ علیہ وسلم کا خط منگوایا۔ پھر خط پڑھا گیا، اس میں لکھا تھا «بسم الله الرحمن الرحيم من محمد عبدالله ورسوله إلى هرقل عظيم الروم السلام على من اتبع الهدى أمابعد» ”میں شروع کرتا ہوں اس اللہ کے نام سے جو رحمان ( بڑا مہربان ) اور رحیم ( نہایت رحم کرنے والا ) ہے۔ یہ خط محمد کی جانب سے ہے جو اللہ کے بندے اور اس کے رسول ہیں۔ اور ہرقل کے پاس بھیجا جا رہا ہے جو روم کے شہنشاہ ہیں۔ سلامتی ہے اس شخص کے لیے جو ہدایت کی پیروی کرے۔ امابعد: حمد و نعت کے بعد … الخ“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ابوسفیان کا نام صخر بن حرب رضی الله عنہ تھا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2718,
			"arabicnumber": 2718,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے جب عجمی ( بادشاہوں ) کو خطوط بھیجنے کا ارادہ فرمایا تو آپ کو بتایا گیا کہ عجمی بغیر مہر لگا ہوا خط قبول نہیں کرتے چنانچہ آپ نے ( مہر کے لیے ) ایک انگوٹھی بنوائی، تو ان میں آپ کی ہتھیلی میں اس کی چمک کو اس وقت دیکھ رہا ہوں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "مقداد بن اسود رضی الله عنہ کہتے ہیں کہ میں اور میرے دو دوست ( مدینہ ) آئے، فقر و فاقہ اور جہد و مشقت کی بنا پر ہماری سماعت متاثر ہو گئی تھی ۱؎ اور ہماری آنکھیں دھنس گئی تھیں، ہم نبی اکرم صلی اللہ علیہ وسلم کے صحابہ کے سامنے اپنے آپ کو پیش کرنے لگے لیکن ہمیں کسی نے قبول نہ کیا ۲؎، پھر ہم نبی اکرم صلی اللہ علیہ وسلم کے پاس گئے تو آپ ہمیں اپنے گھر لے آئے، اس وقت آپ کے پاس تین بکریاں تھیں۔ آپ نے فرمایا: ”ان کا دودھ ہم سب کے لیے دوہو“، تو ہم دوہتے اور ہر شخص اپنا حصہ پیتا اور رسول اللہ صلی اللہ علیہ وسلم کا حصہ اٹھا کر رکھ دیتے، پھر رسول اللہ صلی اللہ علیہ وسلم رات میں تشریف لاتے اور اس انداز سے سلام کرتے تھے کہ سونے والا جاگ نہ اٹھے اور جاگنے والا سن بھی لے ۳؎، پھر آپ مسجد آتے نماز تہجد پڑھتے پھر جا کر اپنے حصے کا دودھ پیتے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2720,
			"arabicnumber": 2720,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم کو اس وقت سلام کیا جب آپ پیشاب کر رہے تھے، تو آپ نے اس کے سلام کا جواب نہیں دیا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2721,
			"arabicnumber": 2721,
			"text": "جابر بن سلیم رضی الله عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم سے ملنا چاہتا تھا، مگر آپ تک پہنچ نہ سکا، میں بیٹھا رہا پھر کچھ لوگ سامنے آئے جن میں آپ صلی اللہ علیہ وسلم بھی تھے۔ میں آپ سے واقف نہ تھا، آپ ان لوگوں میں صلح صفائی کرا رہے تھے، جب آپ ( اس کام سے ) فارغ ہوئے تو آپ کے ساتھ کچھ دوسرے لوگ بھی اٹھ کھڑے ہوئے، ان لوگوں نے کہا: اللہ کے رسول! جب میں نے ( لوگوں کو ) ایسا کہتے دیکھا تو میں نے کہا: ” «علیک السلام یا رسول اللہ» !“ ( آپ پر سلامتی ہو اے اللہ کے رسول ) اور ایسا میں نے تین بار کہا، آپ نے فرمایا: ” «علیک السلام» میت کا سلام ہے“ ۱؎، آپ نے بھی ایسا تین بار کہا، پھر آپ میری طرف پوری طرح متوجہ ہوئے اور فرمایا: ”جب آدمی اپنے مسلمان بھائی سے ملے تو اس کے لیے مناسب یہ ہے کہ کہے «السلام علیکم ورحمة اللہ» پھر آپ نے میرے سلام کا جواب اس طرح لوٹایا، فرمایا: «وعلیک ورحمة اللہ وعلیک ورحمة اللہ وعلیک ورحمة اللہ» ( تین بار ) ۔ امام ترمذی کہتے ہیں: ابوغفار نے یہ حدیث بسند «ابو تمیمہ الہجیمی عن ابی جری جابر بن سلیم الہجیمی» سے روایت کی ہے، ہجیمی کہتے ہیں: میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا پھر آگے پوری حدیث بیان کر دی۔ ابو تمیمہ کا نام طریف بن مجالد ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2722,
			"arabicnumber": 2722,
			"text": "جابر بن سلیم رضی الله عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، پھر آپ سے عرض کیا: «علیک السلام» آپ پر سلامتی ہو تو آپ نے فرمایا: «علیک السلام» مت کہو بلکہ «السلام علیک» کہو اور آگے پورا لمبا قصہ بیان کیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2723,
			"arabicnumber": 2723,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب سلام کرتے تو تین بار سلام کرتے اور جب کوئی بات کہتے تو اسے تین بار دھراتے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔ فائدہ ۱؎: تاکہ بات اچھی طرح سمجھ میں آ جائے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "ابوواقد حارث بن عوف لیثی رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے، آپ کے ساتھ لوگ بھی بیٹھے تھے، اسی دوران اچانک تین آدمی آئے، ان میں سے دو رسول اللہ صلی اللہ علیہ وسلم کی طرف بڑھ آئے، اور ایک واپس چلا گیا، جب وہ دونوں رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچ کر رکے تو انہوں نے سلام کیا، پھر ان دونوں میں سے ایک نے مجلس میں کچھ جگہ ( گنجائش ) دیکھی تو وہ اسی میں ( گھس کر ) بیٹھ گیا۔ اور دوسرا شخص ان لوگوں کے ( یعنی صحابہ ) کے پیچھے جا کر بیٹھ گیا۔ اور تیسرا تو پیٹھ موڑے چلا ہی گیا تھا، پھر جب فارغ ہوئے تو آپ صلی اللہ علیہ وسلم نے صحابہ کو مخاطب کر کے فرمایا: ”کیا میں تمہیں تینوں اشخاص کے متعلق نہ بتاؤں؟ ( سنو ) ان میں سے ایک نے اللہ کی پناہ حاصل کی تو اللہ نے اسے پناہ دی اور دوسرے نے شرم کی تو اللہ نے بھی اس سے شرم کی اور رہا تیسرا شخص تو اس نے اعراض کیا، چنانچہ اللہ نے بھی اس سے اعراض کیا، منہ پھیر لیا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ابو مرہ ام ہانی بنت ابی طالب رضی الله عنہا کے آزاد کردہ غلام ہیں اور ان کا نام یزید ہے، یہ بھی کہا جاتا ہے کہ وہ عقیل ابن ابی طالب کے آزاد کردہ غلام ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2725,
			"arabicnumber": 2725,
			"text": "جابر بن سمرہ رضی الله عنہ کہتے ہیں کہ ہم جب نبی اکرم صلی اللہ علیہ وسلم کے پاس آتے تو جس کو جہاں جگہ ملتی وہیں بیٹھ جاتا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ۲- یہ حدیث زہیر بن معاویہ نے سماک سے بھی روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2726,
			"arabicnumber": 2726,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں کہ ( سند میں اس بات کی صراحت ہے کہ ابواسحاق نے براء سے سنا نہیں ہے اس لیے سند میں انقطاع ہے، لیکن شواہد کی بناء پر صحیح ہے، بالخصوص شعبہ کی روایت ہونے کی وجہ سے قوی ہے ) انصار کے کچھ لوگ راستے میں بیٹھے ہوئے تھے اور رسول اللہ صلی اللہ علیہ وسلم کا ان کے پاس سے گزر ہوا تو آپ نے ان سے فرمایا: ” ( یوں تو راستے میں بیٹھنا اچھا نہیں ہے ) لیکن اگر تم بیٹھنا ضروری سمجھتے ہو تو سلام کا جواب دیا کرو، مظلوم کی مدد کیا کرو، اور ( بھولے بھٹکے ہوئے کو ) راستہ بتا دیا کرو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اس باب میں ابوہریرہ اور ابوشریح خزاعی رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Matn"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2727,
			"arabicnumber": 2727,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب دو مسلمان آپس میں ایک دوسرے سے ملتے اور ( سلام ) و مصافحہ کرتے ہیں تو ان دونوں کے ایک دوسرے سے علیحدہ اور جدا ہونے سے پہلے انہیں بخش دیا جاتا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- یہ حدیث براء سے متعدد سندوں سے بھی مروی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2728,
			"arabicnumber": 2728,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ ایک آدمی نے پوچھا: اللہ کے رسول! ہمارا آدمی اپنے بھائی سے یا اپنے دوست سے ملتا ہے تو کیا وہ اس کے سامنے جھکے؟ آپ نے فرمایا: ”نہیں“، اس نے پوچھا: کیا وہ اس سے چمٹ جائے اور اس کا بوسہ لے؟ آپ نے فرمایا: ”نہیں“، اس نے کہا: پھر تو وہ اس کا ہاتھ پکڑے اور مصافحہ کرے، آپ نے فرمایا: ”ہاں“ ( بس اتنا ہی کافی ہے ) ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2729,
			"arabicnumber": 2729,
			"text": "قتادہ کہتے ہیں کہ میں نے انس بن مالک رضی الله عنہ سے پوچھا: کیا رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں مصافحہ کا رواج تھا؟ انہوں نے کہا: ہاں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2730,
			"arabicnumber": 2730,
			"text": "عبداللہ بن مسعود رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مکمل سلام ( «السلام علیکم ورحمة اللہ وبرکاتہ» کہنے کے ساتھ ساتھ ) ہاتھ کو ہاتھ میں لینا یعنی ( مصافحہ کرنا ) ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے صرف یحییٰ بن سلیم کی روایت سے جسے وہ سفیان سے روایت کرتے ہیں جانتے ہیں، ۲- میں نے محمد بن اسماعیل بخاری سے اس حدیث کے متعلق پوچھا تو انہوں نے اسے محفوظ شمار نہیں کیا، اور کہا کہ میرے نزدیک یحییٰ بن سلیم نے سفیان کی وہ روایت مراد لی ہے جسے انہوں نے منصور سے روایت کی ہے، اور منصور نے خیثمہ سے اور خیثمہ نے اس سے جس نے ابن مسعود رضی الله عنہ سے سنا ہے اور ابن مسعود نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔ آپ نے فرمایا: ” ( بعد نماز عشاء ) بات چیت اور قصہ گوئی نہیں کرنی چاہیئے، سوائے اس شخص کے جس کو ( ابھی کچھ دیر بعد اٹھ کر تہجد کی ) نماز پڑھنی ہے یا سفر کرنا ہے، محمد کہتے ہیں: اور منصور سے مروی ہے انہوں نے ابواسحاق سے اور ابواسحاق نے عبدالرحمٰن بن یزید سے یا ان کے سوا کسی اور سے روایت کی ہے۔ وہ کہتے ہیں: سلام کی تکمیل سے مراد ہاتھ پکڑنا ( مصافحہ کرنا ) ہے، ۳- اس باب میں براء اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2731,
			"arabicnumber": 2731,
			"text": "ابوامامہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مریض کی مکمل عیادت یہ ہے کہ تم میں سے عیادت کرنے والا اپنا ہاتھ اس کی پیشانی پر رکھے“، یا آپ نے یہ فرمایا: ” ( راوی کو شبہ ہو گیا ہے ) اپنا ہاتھ اس کے ہاتھ پر رکھے، پھر اس سے پوچھے کہ وہ کیسا ہے؟ اور تمہارے سلام کی تکمیل یہ ہے کہ تم آپس میں ایک دوسرے سے مصافحہ کرو“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کی سند قوی نہیں ہے، ۲- محمد بن اسماعیل بخاری کہتے ہیں: عبیداللہ بن زحر ثقہ ہیں اور علی بن یزید ضعیف ہیں، ۳ – قاسم بن عبدالرحمٰن کی کنیت ابوعبدالرحمٰن ہے اور یہ عبدالرحمٰن بن خالد بن یزید بن معاویہ کے آزاد کردہ غلام ہیں اور ثقہ ہیں اور قاسم شامی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2732,
			"arabicnumber": 2732,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ زید بن حارثہ مدینہ آئے ( اس وقت ) رسول اللہ صلی اللہ علیہ وسلم میرے گھر میں تشریف فرما تھے، وہ آپ کے پاس آئے اور دروازہ کھٹکھٹایا، تو آپ ان کی طرف ننگے بدن اپنے کپڑے سمیٹتے ہوئے لپکے اور قسم اللہ کی میں نے آپ کو ننگے بدن نہ اس سے پہلے کبھی دیکھا تھا اور نہ اس کے بعد دیکھا ۱؎، آپ نے ( بڑھ کر ) انہیں گلے لگا لیا اور ان کا بوسہ لیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ہم اسے صرف زہری کی روایت سے صرف اسی سند سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "صفوان بن عسال رضی الله عنہ کہتے ہیں کہ ایک یہودی نے اپنے ساتھی سے کہا: چلو اس نبی کے پاس لے چلتے ہیں۔ اس کے ساتھی نے کہا ”نبی“ نہ کہو۔ ورنہ اگر انہوں نے سن لیا تو ان کی چار آنکھیں ہو جائیں گی، پھر وہ دونوں رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، اور آپ سے ( موسیٰ علیہ السلام کو دی گئیں ) نو کھلی ہوئی نشانیوں کے متعلق پوچھا۔ آپ نے ان سے کہا ( ۱ ) کسی کو اللہ کا شریک نہ بناؤ ( ۲ ) چوری نہ کرو ( ۳ ) زنا نہ کرو ( ۴ ) ناحق کسی کو قتل نہ کرو ( ۵ ) کسی بےگناہ کو حاکم کے سامنے نہ لے جاؤ کہ وہ اسے قتل کر دے ( ۶ ) جادو نہ کرو ( ۷ ) سود مت کھاؤ ( ۸ ) پارسا عورت پر زنا کی تہمت مت لگاؤ ( ۹ ) اور دشمن سے مقابلے کے دن پیٹھ پھیر کر بھاگنے کی کوشش نہ کرو۔ اور خاص تم یہودیوں کے لیے یہ بات ہے کہ «سبت» ( سنیچر ) کے سلسلے میں حد سے آگے نہ بڑھو، ( آپ کا جواب سن کر ) انہوں نے آپ کے ہاتھ پیر چومے اور کہا: ہم گواہی دیتے ہیں کہ آپ نبی ہیں۔ آپ نے فرمایا: ”پھر تمہیں میری پیروی کرنے سے کیا چیز روکتی ہے؟“ انہوں نے کہا: داود علیہ السلام نے اپنے رب سے دعا کی تھی کہ ان کی اولاد میں ہمیشہ کوئی نبی رہے۔ اس لیے ہم ڈرتے ہیں کہ اگر ہم نے آپ کی اتباع ( پیروی ) کی تو یہودی ہمیں مار ڈالیں گے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں یزید بن اسود، ابن عمر اور کعب بن مالک رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2734,
			"arabicnumber": 2734,
			"text": "ام ہانی رضی الله عنہا کہتی ہیں کہ فتح مکہ والے سال میں رسول اللہ صلی اللہ علیہ وسلم کے پاس گئی۔ آپ اس وقت غسل فرما رہے تھے، اور فاطمہ رضی الله عنہا ایک کپڑے سے آپ کو آڑ کیے ہوئے تھیں۔ میں نے سلام کیا تو آپ نے پوچھا: ”کون ہیں یہ؟“ میں نے کہا: میں ام ہانی ہوں، آپ نے فرمایا: ”ام ہانی کا آنا مبارک ہو“۔ راوی کہتے ہیں پھر ابو مرہ نے حدیث کا پورا واقعہ بیان کیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 47
			}
		}
	]
}