{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ابی بن کعب رضی الله عنہ کے پاس سے گزرے وہ نماز پڑھ رہے تھے، آپ نے فرمایا: ”اے ابی ( سنو ) وہ ( آواز سن کر ) متوجہ ہوئے لیکن جواب نہ دیا، نماز جلدی جلدی پوری کی، پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا: السلام علیک یا رسول اللہ! ( اللہ کے رسول آپ پر سلامتی نازل ہو ) ، رسول اللہ صلی اللہ علیہ وسلم نے کہا: وعلیک السلام ( تم پر بھی سلامتی ہو ) ابی! جب میں نے تمہیں بلایا تو تم میرے پاس کیوں نہ حاضر ہوئے؟ انہوں نے کہا: اللہ کے رسول! میں نماز پڑھ رہا تھا۔ آپ نے فرمایا: ” ( اب تک ) جو وحی مجھ پر نازل ہوئی ہے اس میں تجھے کیا یہ آیت نہیں ملی «استجيبوا لله وللرسول إذا دعاكم لما يحييكم» ”اے ایمان والو! تم اللہ اور رسول کے کہنے کو بجا لاؤ، جب کہ رسول تم کو تمہاری زندگی بخش چیز کی طرف بلاتے ہوں“ ( انفال ۲۴ ) ، انہوں نے کہا: جی ہاں، اور آئندہ إن شاء اللہ ایسی بات نہ ہو گی۔ آپ نے فرمایا: ”کیا تمہیں پسند ہے کہ میں تمہیں ایسی سورت سکھاؤں جیسی سورت نہ تو رات میں نازل ہوئی نہ انجیل میں اور نہ زبور میں اور نہ ہی قرآن میں؟“ انہوں نے کہا: اللہ کے رسول! ( ضرور سکھائیے ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نماز میں تم ( قرآن ) کیسے پڑھتے ہو؟“ تو انہوں نے ام القرآن ( سورۃ فاتحہ ) پڑھی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قسم ہے اس ذات کی جس کے قبضے میں میری جان ہے۔ تورات میں، انجیل میں، زبور میں ( حتیٰ کہ ) قرآن اس جیسی سورت نازل نہیں ہوئی ہے۔ یہی سبع مثانی ۲؎ ( سات آیتیں ) ہیں اور یہی وہ قرآن عظیم ہے جو مجھے عطا کیا گیا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں انس بن مالک اور ابوسعید بن معلی رضی الله عنہ سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2876,
			"arabicnumber": 2876,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے گنتی کے کچھ لشکری بھیجے ( بھیجتے وقت ) ان سے ( قرآن ) پڑھوایا، تو ان میں سے ہر ایک نے جسے جتنا قرآن یاد تھا پڑھ کر سنایا۔ جب ایک نوعمر نوجوان کا نمبر آیا تو آپ نے اس سے کہا: اے فلاں! تمہارے ساتھ کیا ہے یعنی تمہیں کون کون سی سورتیں یاد ہیں؟ اس نے کہا: مجھے فلاں فلاں اور سورۃ البقرہ یاد ہے۔ آپ نے کہا: کیا تمہیں سورۃ البقرہ یاد ہے؟ اس نے کہا: ہاں، آپ نے فرمایا: ”جاؤ تم ان سب کے امیر ہو“۔ ان کے شرفاء میں سے ایک نے کہا: اللہ کے رسول! قسم اللہ کی! میں نے سورۃ البقرہ صرف اسی ڈر سے یاد نہ کی کہ میں اسے ( نماز تہجد میں ) برابر پڑھ نہ سکوں گا۔ آپ نے فرمایا: ”قرآن سیکھو، اسے پڑھو اور پڑھاؤ۔ کیونکہ قرآن کی مثال اس شخص کے لیے جس نے اسے سیکھا اور پڑھا، اور اس پر عمل کیا اس تھیلی کی ہے جس میں مشک بھری ہوئی ہو اور چاروں طرف اس کی خوشبو پھیل رہی ہو، اور اس شخص کی مثال جس نے اسے سیکھا اور سو گیا اس کا علم اس کے سینے میں بند رہا۔ اس تھیلی کی سی ہے جو مشک بھر کر سیل بند کر دی گئی ہو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اس حدیث کو لیث بن سعد نے سعید مقبری سے، اور سعید نے ابواحمد کے آزاد کردہ غلام عطا سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کیا ہے، اور انہوں نے اس روایت میں ابوہریرہ کا ذکر نہیں کیا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2877,
			"arabicnumber": 2877,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اپنے گھروں کو قبرستان نہ بناؤ۔ وہ گھر جس میں سورۃ البقرہ پڑھی جاتی ہے اس میں شیطان داخل نہیں ہوتا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2878,
			"arabicnumber": 2878,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہر چیز کی ایک چوٹی ہوتی ہے ۱؎ اور قرآن کی چوٹی سورۃ البقرہ ہے، اس سورۃ میں ایک آیت ہے یہ قرآن کی ساری آیتوں کی سردار ہے اور یہ آیت آیۃ الکرسی ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف حکیم بن جبیر کی روایت سے جانتے ہیں، ۳- حکیم بن جبیر کے بارے میں شعبہ نے کلام کیا ہے اور انہیں ضعیف قرار دیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2879,
			"arabicnumber": 2879,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے سورۃ مومن کی ( ابتدائی تین آیات ) «حم» سے «إليه المصير» تک اور آیت الکرسی صبح ہی صبح ( بیدار ہونے کے بعد ہی ) پڑھی تو ان دونوں کے ذریعہ شام تک اس کی حفاظت کی جائے گی، اور جس نے ان دونوں کو شام ہوتے ہی پڑھا تو ان کے ذریعہ اس کی صبح ہونے تک حفاظت کی جائے گی“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- بعض اہل علم نے عبدالرحمٰن بن ابی بکر بن ابی ملیکہ کے حافظے کے سلسلے میں کلام کیا ہے، ۳- زرارہ بن مصعب کا پورا نام زرارہ بن مصعب بن عبدالرحمٰن بن عوف ہے، اور وہ ابومصعب مدنی کے دادا ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2880,
			"arabicnumber": 2880,
			"text": "ابوایوب انصاری رضی الله عنہ سے روایت ہے کہ ان کا اپنا ایک احاطہٰ تھا اس میں کھجوریں رکھی ہوئی تھیں۔ جن آتا تھا اور اس میں سے اٹھا لے جاتا تھا، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اس بات کی شکایت کی۔ آپ نے فرمایا: ”جاؤ جب دیکھو کہ وہ آیا ہوا ہے تو کہو: بسم اللہ ( اللہ کے نام سے ) رسول اللہ صلی اللہ علیہ وسلم کی بات مان“، ابوذر رضی الله عنہ نے اسے پکڑ لیا تو وہ قسمیں کھا کھا کر کہنے لگا کہ مجھے چھوڑ دو، دوبارہ وہ ایسی حرکت نہیں کرے گا، چنانچہ انہوں نے اسے چھوڑ دیا۔ پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو آپ نے ان سے پوچھا، ”تمہارے قیدی نے کیا کیا؟ !“ انہوں نے کہا: اس نے قسمیں کھائیں کہ اب وہ دوبارہ ایسی حرکت نہ کرے گا۔ آپ نے فرمایا: ”اس نے جھوٹ کہا: وہ جھوٹ بولنے کا عادی ہے“، راوی کہتے ہیں: انہوں نے اسے دوبارہ پکڑا، اس نے پھر قسمیں کھائیں کہ اسے چھوڑ دو، وہ دوبارہ نہ آئے گا تو انہوں نے اسے ( دوبارہ ) چھوڑ دیا، پھر وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے تو آپ نے پوچھا: ”تمہارے قیدی نے کیا کیا؟“ انہوں نے کہا: اس نے قسم کھائی کہ وہ پھر لوٹ کر نہ آئے گا۔ آپ نے فرمایا: ”اس نے جھوٹ کہا، وہ تو جھوٹ بولنے کا عادی ہے“۔ ( پھر جب وہ آیا ) تو انہوں نے اسے پکڑ لیا، اور کہا: اب تمہیں نبی اکرم صلی اللہ علیہ وسلم کے پاس لے جائے بغیر نہ چھوڑوں گا۔ اس نے کہا: مجھے چھوڑ دو، میں تمہیں ایک چیز یعنی آیت الکرسی بتا رہا ہوں۔ تم اسے اپنے گھر میں پڑھ لیا کرو۔ تمہارے قریب شیطان نہ آئے گا اور نہ ہی کوئی اور آئے گا“، پھر ابوذر رضی الله عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے تو آپ نے ان سے پوچھا: ”تمہارے قیدی نے کیا کیا؟“ تو انہوں نے آپ کو وہ سب کچھ بتایا جو اس نے کہا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اس نے بات تو صحیح کہی ہے، لیکن وہ ہے پکا جھوٹا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اس باب میں ابی بن کعب رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2881,
			"arabicnumber": 2881,
			"text": "ابومسعود انصاری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے رات میں سورۃ البقرہ کی آخری دو آیتیں پڑھیں وہ اس کے لیے کافی ہو گئیں“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2882,
			"arabicnumber": 2882,
			"text": "نعمان بن بشیر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے زمین و آسمان پیدا کرنے سے دو ہزار سال پہلے ایک کتاب لکھی، اس کتاب کی دو آیتیں نازل کیں اور انہیں دونوں آیتوں پر سورۃ البقرہ کو ختم کیا، جس گھر میں یہ دونوں آیتیں ( مسلسل ) تین راتیں پڑھی جائیں گی ممکن نہیں ہے کہ شیطان اس گھر کے قریب آ سکے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2883,
			"arabicnumber": 2883,
			"text": "نواس بن سمعان رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”قرآن اور قرآن والا جو دنیا میں قرآن پر عمل کرتا ہے دونوں آئیں گے ان کی پیشوائی سورۃ البقرہ اور آل عمران کریں گی“۔ رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں سورتوں کی تین مثالیں دیں، اس کے بعد پھر میں ان سورتوں کو نہ بھولا۔ آپ نے فرمایا: ”گویا کہ وہ دونوں چھتریاں ہیں، جن کے بیچ میں شگاف اور پھٹن ہیں، یا گویا کہ وہ دونوں کالی بدلیاں ہیں، یا گویا کہ وہ صف بستہ چڑیوں کا سائبان ہیں، یہ دونوں سورتیں اپنے پڑھنے والوں اور ان پر عمل کرنے والوں کا لڑ جھگڑ کر دفاع و بچاؤ کر رہی ہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے غریب ہے، ۲- اس باب میں بریدہ اور ابوامامہ سے بھی روایت ہے، ۳- اس حدیث کا بعض اہل علم کے نزدیک معنی و مفہوم یہ ہے کہ قرآن پڑھنے کا ثواب آئے گا۔ اس حدیث اور اس جیسی دیگر احادیث کی بعض اہل علم نے یہی تفسیر کی ہے کہ قرآن پڑھنے کا ثواب آئے گا، نواس رضی الله عنہ کی نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، مفسرین کی اس تفسیر کی دلیل اور اس کا ثبوت ملتا ہے۔ نبی اکرم صلی اللہ علیہ وسلم کے اس قول «وأهله الذين يعملون به في الدنيا» میں اشارہ ہے کہ قرآن کے آنے سے مراد ان کے اعمال کا ثواب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2884,
			"arabicnumber": 2884,
			"text": "سفیان بن عیینہ سے روایت ہے، وہ عبداللہ بن مسعود رضی الله عنہ کی اس حدیث «ما خلق الله من سماء ولا أرض أعظم من آية الكرسي» کی تفسیر میں کہتے ہیں: آیت الکرسی کی فضیلت اس وجہ سے ہے کہ یہ اللہ کا کلام ہے اور اللہ کا کلام اللہ کی مخلوق یعنی آسمان و زمین سے بڑھ کر ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "براء رضی الله عنہ کہتے ہیں کہ ایک آدمی سورۃ الکہف پڑھ رہا تھا کہ اسی دوران اس نے اپنے چوپائے ( سواری ) کو دیکھا کہ وہ ( اپنے کھونٹے پر ) ناچنے اور اچھل کود کرنے لگا۔ اس نے نظر ( ادھر ادھر ) دوڑائی تو اسے ایک بدلی سی نظر آئی، پھر وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، اور اس ( واقعہ ) کا آپ سے ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”یہ سکینت ( طمانینت ) تھی جو قرآن کی وجہ سے یا قرآن پڑھنے پر نازل ہوئی“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں اسید بن حضیر سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "ابو الدرداء رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے سورۃ الکہف کی ابتدائی تین آیات پڑھیں وہ دجال کے فتنہ سے بچا لیا گیا“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "انس رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ہر چیز کا ایک دل ہوتا ہے، اور قرآن کا دل سورۃ یاسین ہے۔ اور جس نے سورۃ یاسین پڑھی تو اللہ تعالیٰ اس کے لیے اس کے پڑھنے کے صلے میں دس مرتبہ قرآن شریف پڑھنے کا ثواب لکھے گا“۔ اس سند سے بھی یہ سابقہ حدیث کی طرح مروی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اس حدیث کو ہم صرف حمید بن عبدالرحمٰن کی روایت سے جانتے ہیں۔ اور اہل بصرہ قتادہ کی روایت کو صرف اسی سند سے جانتے ہیں۔ اور ہارون ابو محمد شیخ مجہول ہیں۔ ۳- اس باب میں ابوبکر صدیق سے بھی روایت ہے، اور یہ روایت سند کے اعتبار سے صحیح نہیں ہے۔ ۴- اس کی سند ضعیف ہے اور اس باب میں ابوہریرہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص سورۃ «حم الدخان» کسی رات میں پڑھے وہ اس حال میں صبح کرے گا کہ اس کے لیے ستر ہزار فرشتے دعائے مغفرت کر رہے ہوں گے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف اسی سند سے جانتے ہیں، ۳- عمر بن ابی خثعم ضعیف قرار دیئے گئے ہیں، محمد بن اسماعیل بخاری کہتے ہیں کہ وہ منکر الحدیث ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص جمعہ کی رات میں «حم الدخان» پڑھے گا اسے بخش دیا جائے گا“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کو ہم صرف اسی سند سے جانتے ہیں، ۲- ہشام ابوالمقدام ضعیف قرار دیئے گئے ہیں، ۳- حسن بصری نے ابوہریرہ رضی الله عنہ سے نہیں سنا ہے، ایوب، یونس بن عبید اور علی بن زید نے ایسا ہی کہا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ صحابہ میں سے کسی نے اپنا خیمہ ایک قبر پر نصب کر دیا اور انہیں معلوم نہیں ہوا کہ وہاں قبر ہے، ( انہوں نے آواز سنی ) اس قبر میں کوئی انسان سورۃ «تبارك الذي بيده الملك» پڑھ رہا تھا، یہاں تک کہ اس نے پوری سورۃ ختم کر دی۔ وہ صحابی نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے پھر آپ سے کہا: اللہ کے رسول! میں نے اپنا خیمہ ایک قبر پر نصب کر دیا، مجھے گمان نہیں تھا کہ اس جگہ پر قبر ہے۔ مگر اچانک کیا سنتا ہوں کہ اس جگہ ایک انسان سورۃ «تبارك الملك» پڑھ رہا ہے اور پڑھتے ہوئے اس نے پوری سورۃ ختم کر دی۔ آپ نے فرمایا: «هي المانعة» ”یہ سورۃ مانعہ ہے، یہ نجات دینے والی ہے، اپنے پڑھنے والے کو عذاب قبر سے بچاتی ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے حسن غریب ہے، ۲- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”قرآن کی تیس آیتوں کی ایک سورۃ نے ایک آدمی کی شفاعت ( سفارش ) کی تو اسے بخش دیا گیا، یہ سورۃ «تبارك الذي بيده الملك» ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب تک «الم تنزيل» اور «تبارك الذي بيده الملك» پڑھ نہ لیتے سوتے نہ تھے۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کو کئی ایک رواۃ نے لیث بن ابی سلیم سے اسی طرح روایت کیا ہے، ۲- مغیرہ بن مسلم نے ابوزبیر سے، اور ابوزبیر نے جابر کے واسطہ سے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کی ہے، ۳- زہیر روایت کرتے ہوئے کہتے ہیں: میں نے ابوزبیر سے کہا: آپ نے جابر سے سنا ہے، تو انہوں نے یہی حدیث بیان کی؟ ابوالزبیر نے کہا: مجھے صفوان یا ابن صفوان نے اس کی خبر دی ہے۔ تو ان زہیر نے ابوالزبیر سے جابر کے واسطہ سے اس حدیث کی روایت کا انکار کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے سورۃ «إذا زلزلت الأرض» سورۃ پڑھی تو اسے آدھا قرآن پڑھنے کے برابر ثواب ملے گا، اور جس نے سورۃ «قل يا أيها الكافرون» پڑھی تو اسے چوتھائی قرآن پڑھنے کے برابر ثواب ملے گا، اور جس نے سورۃ «قل هو الله أحد» پڑھی تو اسے ایک تہائی قرآن پڑھنے کا ثواب ملے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے کسی اور سے نہیں صرف انہیں حسن بن مسلم کی روایت سے جانتے ہیں، ۳- اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «إذا زلزلت» ( ثواب میں ) آدھے قرآن کے برابر ہے، اور «قل هو الله أحد» تہائی قرآن کے برابر ہے اور «قل يا أيها الكافرون» چوتھائی قرآن کے برابر ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف یمان بن مغیرہ کی روایت ہی سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2895,
			"arabicnumber": 2895,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے ایک صحابی سے فرمایا: ”اے فلاں! کیا تم نے شادی کر لی؟“ انہوں نے کہا: نہیں، قسم اللہ کی! اللہ کے رسول! نہیں کی ہے، اور نہ ہی میرے پاس ایسا کچھ ہے جس کے ذریعہ میں شادی کر سکوں۔ آپ نے فرمایا: ”کیا تمہارے پاس سورۃ «قل هو الله أحد» نہیں ہے؟“ انہوں نے کہا: کیوں نہیں، میرے پاس ہے۔ آپ نے فرمایا: ”سورۃ «قل هو الله أحد» ثواب میں ایک تہائی قرآن کے برابر ہے“۔ آپ نے فرمایا: ”کیا تمہارے پاس سورۃ «إذا جاء نصر الله والفتح» نہیں ہے؟“ انہوں نے کہا: کیوں نہیں، ( ہے ) آپ نے فرمایا: ”یہ ایک چوتھائی قرآن ہے“، آپ نے فرمایا: ”کیا تمہارے پاس سورۃ «قل يا أيها الكافرون» نہیں ہے؟“ انہوں نے کہا: کیوں نہیں۔ ( ہے ) آپ نے فرمایا: ” ( یہ ) چوتھائی قرآن ہے“۔ آپ نے فرمایا: ”کیا تمہارے پاس سورۃ «إذا زلزلت الأرض» نہیں ہے؟“ انہوں نے کہا: کیوں نہیں ( ہے ) آپ نے فرمایا: ”یہ ایک چوتھائی قرآن ہے“، آپ نے فرمایا: ”تم شادی کرو“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "ابوایوب انصاری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کیا تم میں سے کوئی اس بات سے بھی عاجز ہے کہ رات میں ایک تہائی قرآن پڑھ ڈالے؟ ( آپ نے فرمایا ) جس نے «الله الواحد الصمد» پڑھا ( یعنی سورۃ الاخلاص پڑھی ) اس نے تہائی قرآن پڑھی ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- ہم کسی کو نہیں جانتے جس نے زائدہ کی روایت سے بہتر اسے روایت کیا ہو، اور ان کی روایت پر ان کی متابعت اسرائیل، فضیل بن عیاض نے کی ہے۔ شعبہ اور ان کے علاوہ کچھ دوسرے لوگوں نے یہ حدیث منصور سے روایت کی ہے اور ان سبھوں نے اس میں اضطراب کا سے کام لیا، ۳- اس باب میں ابوالدرداء، ابو سعید خدری، قتادہ بن نعمان، ابوہریرہ، انس، ابن عمر اور ابومسعود رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ آیا، آپ نے وہاں ایک آدمی کو «قل هو الله أحد الله الصمد» پڑھتے ہوئے سنا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”واجب ہو گئی“۔ میں نے کہا: کیا چیز واجب ہو گئی؟ آپ نے فرمایا: ”جنت ( واجب ہو گئی ) “۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ہم اس حدیث کو صرف مالک بن انس کی روایت سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص ہر دن دو سو مرتبہ «قل هو الله أحد» پڑھے گا تو قرض کے سوا اس کے پچاس سال تک کے گناہ مٹا دیئے جائیں گے“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «قل هو الله أحد» ایک تہائی قرآن کے برابر ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم سب اکٹھے ہو جاؤ کیونکہ میں تم سب کو تہائی قرآن پڑھ کر سنانے والا ہوں“، چنانچہ آپ صلی اللہ علیہ وسلم کی اس پکار پر جو بھی پہنچ سکا جمع ہو گیا، پھر نبی اکرم صلی اللہ علیہ وسلم باہر تشریف لائے، سورۃ «قل هو الله أحد» پڑھی اور ( حجرہ شریفہ میں ) واپس چلے گئے۔ تو بعض صحابہ نے چہ میگوئیاں کرتے ہوئے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا: میں عنقریب تمہیں تہائی قرآن پڑھ کر سناؤں گا، میرا خیال یہ ہے کہ ایسا اس وجہ سے ہوا ہے کہ آسمان سے کوئی خبر ( کوئی اطلاع ) آ گئی ہے، پھر نبی اکرم صلی اللہ علیہ وسلم کمرے سے باہر نکلے اور فرمایا: ”میں نے کہا تھا میں تمہیں تہائی قرآن پڑھ کر سناؤں گا تو سن لو یہ سورۃ «قل هو الله أحد» تہائی قرآن کے برابر ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ مسجد قباء میں ایک انصاری شخص ان کی امامت کرتا تھا، اور اس کی عادت یہ تھی کہ جب بھی وہ ارادہ کرتا کہ کوئی سورت نماز میں پڑھے تو اسے پڑھتا لیکن اس سورت سے پہلے «قل هو الله أحد» پوری پڑھتا، پھر اس کے ساتھ دوسری سورت پڑھتا، اور وہ یہ عمل ہر رکعت میں کرتا تھا۔ تو اس کے ساتھیوں ( نمازیوں ) نے اس سے ( اس موضوع پر ) بات کی، انہوں نے کہا: آپ یہ سورت پڑھتے ہیں پھر آپ خیال کرتے ہیں کہ یہ تو آپ کے لیے کافی نہیں ہے یہاں تک کہ دوسری سورت ( بھی ) پڑھتے ہیں، تو آپ یا تو صرف اسے پڑھیں، یا اسے چھوڑ دیں اور کوئی دوسری سورت پڑھیں، تو انہوں نے کہا: میں اسے چھوڑنے والا نہیں، اگر آپ لوگ پسند کریں کہ میں اسے پڑھنے کے ساتھ ساتھ امامت کروں تو امامت کروں گا اور اگر آپ لوگ اس کے ساتھ امامت کرنا پسند نہیں کرتے تو میں آپ لوگوں ( کی امامت ) کو چھوڑ دوں گا۔ اور لوگوں کا حال یہ تھا کہ انہیں اپنوں میں سب سے افضل سمجھتے تھے اور ناپسند کرتے تھے کہ ان کے سوا کوئی دوسرا ان کی امامت کرے، چنانچہ نبی اکرم صلی اللہ علیہ وسلم جب ان لوگوں کے پاس آئے تو انہوں نے آپ کو ساری بات بتائی۔ آپ نے فرمایا: ”اے فلاں! تمہارے ساتھی جو بات کہہ رہے ہیں، اس پر عمل کرنے سے تمہیں کیا چیز روک رہی ہے اور تمہیں کیا چیز مجبور کر رہی ہے کہ ہر رکعت میں تم اس سورت کو پڑھو؟“، انہوں نے کہا: اللہ کے رسول! میں اسے پسند کرتا ہوں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اس کی محبت تمہیں جنت میں لے جائے گی“۔ امام ترمذی کہتے ہیں ۱- یہ حدیث اس سند سے حسن غریب صحیح ہے اور یہ عبیداللہ بن عمر کی روایت سے ہے جسے وہ ثابت سے روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "عقبہ بن عامر جہنی رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے مجھ پر ایسی آیات نازل کی ہیں جیسی ( کبھی ) نہیں دیکھی گئی ہیں، وہ یہ ہیں: «قل أعوذ برب الناس» آخر سورۃ تک اور «قل أعوذ برب الفلق» آخر سورۃ تک“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "عقبہ بن عامر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ ہر نماز کے بعد معوذتین پڑھا کروں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص قرآن پڑھتا ہے اور قرآن پڑھنے میں مہارت رکھتا ہے وہ بزرگ پاکباز فرشتوں کے ساتھ ہو گا، اور جو شخص قرآن پڑھتا ہے اور بڑی مشکل سے پڑھ پاتا ہے، پڑھنا اسے بہت شاق گزرتا ہے تو اسے دہرا اجر ملے گا“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے قرآن پڑھا اور اسے پوری طرح حفظ کر لیا، جس چیز کو قرآن نے حلال ٹھہرایا اسے حلال جانا اور جس چیز کو قرآن نے حرام ٹھہرایا اسے حرام سمجھا تو اللہ اسے اس قرآن کے ذریعہ جنت میں داخل فرمائے گا۔ اور اس کے خاندان کے دس ایسے لوگوں کے بارے میں اس ( قرآن ) کی سفارش قبول کرے گا جن پر جہنم واجب ہو چکی ہو گی“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، اسے ہم صرف اسی سند سے جانتے ہیں، ۲- اس کی سند صحیح نہیں ہے، ۳- حفص بن سلیمان حدیث میں ضعیف قرار دیئے گئے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "حارث اعور کہتے ہیں کہ مسجد میں گیا تو کیا دیکھتا ہوں کہ لوگ گپ شپ اور قصہ کہانیوں میں مشغول ہیں، میں علی رضی الله عنہ کے پاس پہنچا۔ میں نے کہا: امیر المؤمنین! کیا آپ دیکھ نہیں رہے ہیں کہ لوگ لایعنی باتوں میں پڑے ہوئے ہیں؟ ۔ انہوں نے کہا: کیا واقعی وہ ایسا کر رہے ہیں؟ میں نے کہا: ہاں، انہوں نے کہا: مگر میں نے تو رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: ”عنقریب کوئی فتنہ برپا ہو گا“، میں نے کہا: اس فتنہ سے بچنے کی صورت کیا ہو گی؟ اللہ کے رسول! آپ نے فرمایا: ”کتاب اللہ، اس میں تم سے پہلے کے لوگوں اور قوموں کی خبریں ہیں اور بعد کے لوگوں کی بھی خبریں ہیں، اور تمہارے درمیان کے امور و معاملات کا حکم و فیصلہ بھی اس میں موجود ہے، اور وہ دو ٹوک فیصلہ کرنے والا ہے، ہنسی مذاق کی چیز نہیں ہے۔ جس نے اسے سرکشی سے چھوڑ دیا اللہ اسے توڑ دے گا اور جو اسے چھوڑ کر کہیں اور ہدایت تلاش کرے گا اللہ اسے گمراہ کر دے گا۔ وہ ( قرآن ) اللہ کی مضبوط رسی ہے یہ وہ حکمت بھرا ذکر ہے، وہ سیدھا راستہ ہے، وہ ہے جس کی وجہ سے خواہشیں ادھر ادھر نہیں بھٹک پاتی ہیں، جس کی وجہ سے زبانیں نہیں لڑکھڑاتیں، اور علماء کو ( خواہ کتنا ہی اسے پڑھیں ) آسودگی نہیں ہوتی، اس کے باربار پڑھنے اور تکرار سے بھی وہ پرانا ( اور بے مزہ ) نہیں ہوتا۔ اور اس کی انوکھی ( و قیمتی ) باتیں ختم نہیں ہوتیں، اور وہ قرآن وہ ہے جسے سن کر جن خاموش نہ رہ سکے بلکہ پکار اٹھے: ہم نے ایک عجیب ( انوکھا ) قرآن سنا ہے جو بھلائی کا راستہ دکھاتا ہے، تو ہم اس پر ایمان لے آئے، جو اس کے مطابق بولے گا اس کے مطابق عمل کرے گا اسے اجر و ثواب دیا جائے گا۔ اور جس نے اس کے مطابق فیصلہ کیا اس نے انصاف کیا اور جس نے اس کی طرف بلایا اس نے اس نے سیدھے راستے کی ہدایت دی۔ اعور! ان اچھی باتوں کا خیال رکھو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، اس حدیث کو ہم صرف اسی سند سے جانتے ہیں، ۲- اس کی سند مجہول ہے، ۳- حارث کے بارے میں کلام کیا گیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "عثمان بن عفان رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے بہتر وہ شخص ہے جو قرآن سیکھے اور سکھلائے“، ابوعبدالرحمٰن سلمی ( راوی حدیث ) کہتے ہیں: یہی وہ چیز ہے جس نے مجھے اپنی اس نشست گاہ ( مسند ) پر بٹھا رکھا ہے، عثمان کے زمانہ میں قرآن کی تعلیم دینی شروع کی ( اور دیتے رہے ) یہاں تک حجاج بن یوسف کے زمانہ میں یہ سلسلہ چلتا رہا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "عثمان بن عفان رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سب سے بہتر یا تم میں سب سے افضل وہ شخص ہے جو قرآن سیکھے اور سکھلائے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- عبدالرحمٰن بن مہدی اور کئی دوسروں نے اسی طرح بسند «سفيان الثوري عن علقمة بن مرثد عن أبي عبدالرحمٰن عن عثمان عن النبي صلى الله عليه وسلم» روایت کی ہے، ۳- سفیان اس کی سند میں سعد بن عبیدہ کا ذکر نہیں کرتے ہیں، ۴- یحییٰ بن سعید قطان نے یہ حدیث بسند «سفيان وشعبة عن علقمة بن مرثد عن سعد بن عبيدة عن أبي عبدالرحمٰن عن عثمان عن النبي صلى الله عليه وسلم» روایت کی۔ ہم سے بیان کیا اسے محمد بن بشار نے، وہ کہتے ہیں: ہم سے بیان کیا یحییٰ بن سعید نے سفیان اور شعبہ کے واسطہ سے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "علی ابن ابی طالب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سب سے بہتر وہ شخص ہے جو قرآن سیکھے اور سکھلائے“۔ امام ترمذی کہتے ہیں: اس حدیث کو ہم علی بن ابی طالب کی روایت سے جسے وہ رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے ہیں صرف عبدالرحمٰن بن اسحاق کی روایت سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کتاب اللہ کا ایک حرف پڑھا اسے اس کے بدلے ایک نیکی ملے گی، اور ایک نیکی دس گنا بڑھا دی جائے گی، میں نہیں کہتا «الم» ایک حرف ہے، بلکہ «الف» ایک حرف ہے، «لام» ایک حرف ہے اور «میم» ایک حرف ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند کے علاوہ دوسری سند سے بھی ابن مسعود سے روایت کی گئی ہے، ۲- اس حدیث کو ابوالاحوص نے ابن مسعود سے روایت کیا ہے۔ بعض نے اسے مرفوعاً روایت کیا ہے اور بعض نے اسے ابن مسعود سے موقوفاً روایت کیا ہے، ۳- یہ حدیث اس سند سے حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "ابوامامہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ کسی بندے کی کوئی بات اتنی زیادہ توجہ اور ہمہ تن گوش ہو کر نہیں سنتا جتنی دو رکعتیں پڑھنے والے بندے کی سنتا ہے، اور بندہ جب تک نماز پڑھ رہا ہوتا ہے اس کے سر پر نیکی کی بارش ہوتی رہتی ہے، اور بندے اللہ عزوجل سے ( کسی چیز سے ) اتنا قریب نہیں ہوتے جتنا اس چیز سے جو اس کی ذات سے نکلی ہے“، ابونضر کہتے ہیں: آپ اس قول سے قرآن مراد لیتے تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے اور ہم اسے صرف اسی سند سے جانتے ہیں، ۲- بکر بن خنیس کے بارے میں ابن مبارک نے کلام کیا ہے اور آخر امر یعنی بعد میں ( ان کے ضعیف ہونے کی وجہ سے ) ان سے روایت کرنی چھوڑ دی تھی، ۳- یہ حدیث زید بن ارطاۃ کے واسطہ سے جبیر بن نفیر سے مروی ہے انہوں نے نبی کریم صلی اللہ علیہ وسلم سے مرسل طریقہ سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "جبیر بن نفیر کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم اللہ کی طرف رجوع کرنے کے لیے قرآن سے بڑھ کر کوئی اور ذریعہ نہیں پا سکتے“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”وہ شخص جس کے دل میں قرآن کا کچھ حصہ یاد نہ ہو وہ ویران گھر کی طرح ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "عبداللہ بن عمرو رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” ( قیامت کے دن ) صاحب قرآن سے کہا جائے گا: ( قرآن ) پڑھتا جا اور ( بلندی کی طرف ) چڑھتا جا۔ اور ویسے ہی ٹھہر ٹھہر کر پڑھ جس طرح تو دنیا میں ٹھہر ٹھہر کر ترتیل کے ساتھ پڑھتا تھا۔ پس تیری منزل وہ ہو گی جہاں تیری آخری آیت کی تلاوت ختم ہو گی“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”قرآن قیامت کے دن پیش ہو گا پس کہے گا: اے میرے رب! اسے ( یعنی صاحب قرآن کو ) جوڑا پہنا، تو اسے کرامت ( عزت و شرافت ) کا تاج پہنایا جائے گا۔ پھر وہ کہے گا: اے میرے رب! اسے اور دے، تو اسے کرامت کا جوڑا پہنایا جائے گا۔ وہ پھر کہے گا: اے میرے رب اس سے راضی و خوش ہو جا، تو وہ اس سے راضی و خوش ہو جائے گا۔ اس سے کہا جائے گا پڑھتا جا اور چڑھتا جا، تیرے لیے ہر آیت کے ساتھ ایک نیکی کا اضافہ کیا جاتا رہے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میری امت کے نیک اعمال کے اجر و ثواب میرے سامنے پیش کیے گئے یہاں تک کہ اس تنکے کا ثواب بھی پیش کیا گیا جسے آدمی مسجد سے نکال کر پھینک دیتا ہے۔ اور مجھ پر میری امت کے گناہ ( بھی ) پیش کیے گئے تو میں نے کوئی گناہ اس سے بڑھ کر نہیں دیکھا کہ کسی کو قرآن کی کوئی سورۃ یا کوئی آیت یاد ہو اور اس نے اسے بھلا دیا ہو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اس حدیث کو ہم صرف اسی سند سے جانتے ہیں، ۳- میں نے اس حدیث کا تذکرہ محمد بن اسماعیل بخاری سے کیا تو اس کو وہ پہچان نہ سکے اور انہوں نے اس حدیث کو غریب قرار دیا، ۴- محمد بن اسماعیل بخاری نے یہ بھی کہا کہ میں نہیں جانتا کہ مطلب بن عبداللہ کی کسی صحابی رسول سے سماع ثابت ہے، سوائے مطلب کے اس قول کے کہ مجھ سے اس شخص نے روایت کی ہے جو نبی کریم صلی اللہ علیہ وسلم کی حاضرین میں موجود تھا، ۵- میں نے عبداللہ بن عبدالرحمٰن ( دارمی ) کو کہتے ہوئے سنا ہے کہ ہم مطلب کا سماع کسی صحابی رسول سے نہیں جانتے، ۶- عبداللہ ( دارمی یہ بھی ) کہتے ہیں: علی بن مدینی اس بات کا انکار کرتے ہیں کہ مطلب نے انس سے سنا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "عمران بن حصین رضی الله عنہ سے روایت ہے کہ وہ ایک قصہ گو کے پاس سے گزرے جو قرآن پڑھ رہا تھا ( پڑھ کر ) وہ مانگنے لگا۔ تو انہوں نے «إنا لله وإنا إليه راجعون» پڑھا، پھر کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہوئے سنا ہے جو قرآن پڑھے تو اسے اللہ ہی سے مانگنا چاہیئے۔ کیونکہ عنقریب کچھ لوگ ایسے آئیں گے جو قرآن پڑھ پڑھ کر لوگوں سے مانگیں گے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، اس کی سند ویسی قوی نہیں ہے، ۲- محمود بن غیلان کہتے ہیں: یہ خیثمہ بصریٰ ہیں جن سے جابر جعفی نے روایت کی ہے۔ یہ خیثمہ بن عبدالرحمٰن نہیں ہیں۔ اور خیثمہ شیخ بصریٰ ہیں ان کی کنیت ابونصر ہے اور انہوں نے انس بن مالک سے کئی حدیثیں روایت کی ہیں۔ اور جابر جعفی نے بھی خیثمہ سے کئی حدیثیں روایت کی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "صہیب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے قرآن کی حرام کی ہوئی چیزوں کو حلال جانا وہ قرآن پر ایمان نہیں رکھتا“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کی سند زیادہ قوی نہیں ہے، وکیع کی روایت میں وکیع سے اختلاف کیا گیا ہے، ۲- محمد بن اسماعیل بخاری کہتے ہیں: ابوفروہ کہتے ہیں: یزید بن سنان رہاوی کی روایت لینے میں کوئی حرج نہیں ہے۔ سوائے اس روایت کے جسے ان کے بیٹے محمد ان سے روایت کرتے ہیں، اس لیے کہ وہ ان سے مناکیر روایت کرتے ہیں، ۳- محمد بن یزید بن سنان نے اپنے باپ سے یہ حدیث بھی روایت کی ہے اور اس کی سند میں اتنا اضافہ کیا ہے: «عن مجاهد عن سعيد بن المسيب عن صهيب» محمد بن یزید کی روایت کی کسی نے متابعت نہیں کی، وہ ضعیف ہیں، اور ابوالمبارک ایک مجہول شخص ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "عقبہ بن عامر رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: ”بلند آواز سے قرآن پڑھنے والا ایسا ہے جیسا کھلے عام صدقہ دینے والا، اور آہستگی و خاموشی سے قرآن پڑھنے والا ایسا ہے جیسے چھپا کر صدقہ دینے والا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اس حدیث کا معنی و مطلب یہ ہے کہ جو شخص آہستگی سے قرآن پڑھتا ہے وہ اس شخص سے افضل ہے جو بلند آواز سے قرآن پڑھتا ہے، اس لیے کہ اہل علم کے نزدیک چھپا کر صدقہ دینا برسر عام صدقہ دینے سے افضل ہے۔ مفہوم یہ ہے کہ اہل علم کے نزدیک اس سے آدمی عجب ( خود نمائی ) سے محفوظ رہتا ہے۔ کیونکہ جو شخص چھپا کر عمل کرتا ہے اس کے عجب میں پڑنے کا اتنا خطرہ نہیں ہے جتنا اس کے کھلے عام عمل کرنے میں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب تک سورۃ بنی اسرائیل اور سورۃ الزمر پڑھ نہ لیتے بستر پر سوتے نہ تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ابولبابہ ایک بصریٰ شیخ ہیں، حماد بن زید نے ان سے کئی حدیثیں روایت کی ہیں، کہا جاتا ہے کہ ان کا نام مروان ہے، یہ بات مجھے محمد بن اسماعیل بخاری نے کتاب التاریخ میں بتائی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "عرباض بن ساریہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سونے سے پہلے مسبحات پڑھتے تھے ۱؎ آپ فرماتے تھے: ”ان میں ایک آیت ایسی ہے جو ہزار آیتوں سے بہتر ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "معقل بن یسار رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص صبح کے وقت «أعوذ بالله السميع العليم من الشيطان الرجيم» تین بار پڑھے، اور تین بار سورۃ الحشر کی آخری تین آیتیں پڑھے، تو اللہ تعالیٰ اس کے لیے مغفرت مانگنے کے لیے ستر ہزار فرشتے لگا دیتا ہے جو شام تک یہی کام کرتے ہیں۔ اگر وہ ایسے دن میں مر جاتا ہے تو شہید ہو کر مرتا ہے، اور جو شخص ان کلمات کو شام کے وقت کہے گا وہ بھی اسی درجہ میں ہو گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- اس حدیث کو ہم صرف اسی سند سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "یعلیٰ بن مملک سے روایت ہے، انہوں نے ام المؤمنین ام سلمہ رضی الله عنہ سے نبی اکرم صلی اللہ علیہ وسلم کی نماز اور آپ کی قرأت کے متعلق پوچھا تو انہوں نے کہا: تمہارا اور آپ کی نماز کا کیا جوڑ؟ آپ نماز پڑھتے تھے پھر اتنی دیر سوتے تھے جتنی دیر نماز پڑھے ہوتے، پھر نماز پڑھتے تھے اسی قدر جتنی دیر سوئے ہوئے ہوتے، پھر اتنی دیر سوتے تھے جتنی دیر نماز پڑھے ہوتے۔ یہاں تک کہ آپ صبح کرتے، پھر انہوں نے آپ کے قرأت کی کیفیت بیان کی اور انہوں نے اس کیفیت کو واضح طور پر ایک ایک حرف حرف کر کے بیان کیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ۲- اسے ہم صرف لیث بن سعد کی روایت سے جانتے ہیں جسے انہوں نے ابن ابی ملیکہ سے اور ابن ابی ملیکہ نے یعلیٰ بن مملک کے واسطہ سے ام سلمہ سے روایت کی، ۳- ابن جریج نے یہ حدیث ابن ابی ملیکہ سے اور ابن ابی ملیکہ نے ام سلمہ سے روایت کی ہے کہ نبی اکرم صلی اللہ علیہ وسلم کی قرأت کا ہر حرف جدا جدا ہوتا تھا، ۴- لیث کی حدیث ( ابن جریج کی حدیث سے ) زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "عبداللہ بن ابی قیس بصریٰ کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی الله عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی وتر کے بارے میں پوچھا کہ آپ وتر رات کے شروع حصے میں پڑھتے تھے یا آخری حصے میں؟ انہوں نے کہا: آپ دونوں ہی طرح سے کرتے تھے۔ کبھی تو آپ شروع رات میں وتر پڑھ لیتے تھے اور کبھی آخر رات میں وتر پڑھتے تھے۔ میں نے کہا: الحمدللہ! تمام تعریف اس اللہ کے لیے ہیں جس نے دین کے معاملے میں وسعت و کشادگی رکھی، پھر میں نے پوچھا: آپ صلی اللہ علیہ وسلم کی قرأت کیسی ہوتی تھی؟ کیا آپ دھیرے پڑھتے تھے یا بلند آواز سے؟ کہا: آپ صلی اللہ علیہ وسلم یہ سب کرتے تھے۔ کبھی تو دھیرے پڑھتے تھے اور کبھی آپ زور سے میں نے کہا: الحمدللہ، تمام تعریفیں اس اللہ کے لیے ہیں جس نے دین میں وسعت و کشادگی رکھی۔ پھر میں نے کہا: آپ جب جنبی ہو جاتے تھے تو کیا کرتے تھے؟ کیا سونے سے پہلے غسل کر لیتے تھے یا غسل کیے بغیر سو جاتے تھے؟ کہا: آپ صلی اللہ علیہ وسلم یہ تمام ہی کرتے تھے، کبھی تو آپ غسل کر لیتے تھے پھر سوتے، اور کبھی وضو کر کے سو جاتے، میں نے کہا: اللہ کا شکر ہے کہ اس نے دینی کام میں وسعت و کشادگی رکھی۔ امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم «موقف» ( عرفات ) میں اپنے آپ کو لوگوں کے سامنے پیش کرتے ہوئے کہتے تھے: ”ہے کوئی جو مجھے اپنی قوم میں لے چلے، کیونکہ قریش نے مجھے اپنے رب کے کلام ( قرآن ) کی تبلیغ سے روک دیا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث غریب صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ عزوجل فرماتا ہے: جس کو قرآن نے میری یاد نے مجھ سے سوال کرنے سے مشغول رکھا۔ میں اسے اس سے زیادہ دوں گا جتنا میں مانگنے والوں کو دیتا ہوں، اللہ کے کلام کی فضیلت دوسرے سارے کلام پر ایسی ہے جیسے اللہ کی فضیلت اس کی اپنی ساری مخلوقات پر ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 52
			}
		}
	]
}