{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 809,
			"arabicnumber": 809,
			"text": "ابوشریح عدوی رضی الله عنہ سے روایت ہے کہ انہوں نے عمرو بن سعید ۲؎ سے – جب وہ مکہ کی طرف ( عبداللہ بن زبیر سے قتال کے لیے ) لشکر روانہ کر رہے تھے کہا: اے امیر! مجھے اجازت دیجئیے کہ میں آپ سے ایک ایسی بات بیان کروں جسے رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دوسرے دن فرمایا، میرے کانوں نے اسے سنا، میرے دل نے اسے یاد رکھا اور میری آنکھوں نے آپ کو دیکھا، جب آپ نے یہ حدیث بیان فرمائی تو اللہ کی حمد و ثنا بیان کی پھر فرمایا: ”مکہ ( میں جنگ و جدال کرنا ) اللہ نے حرام کیا ہے۔ لوگوں نے حرام نہیں کیا ہے، لہٰذا کسی شخص کے لیے جو اللہ اور یوم آخرت پر ایمان رکھتا ہو، یہ جائز نہیں کہ وہ اس میں خون بہائے، یا اس کا کوئی درخت کاٹے۔ اگر کوئی اس میں رسول اللہ صلی اللہ علیہ وسلم کے قتال کو دلیل بنا کر ( قتال کا ) جواز نکالے تو اس سے کہو: اللہ نے اپنے رسول صلی اللہ علیہ وسلم کو اس کی اجازت دی تھی، تمہیں نہیں دی ہے۔ تو مجھے بھی دن کے کچھ وقت کے لیے آج اجازت تھی، آج اس کی حرمت ویسے ہی لوٹ آئی ہے جیسے کل تھی۔ جو لوگ موجود ہیں وہ یہ بات ان لوگوں کو پہنچا دیں جو موجود نہیں ہیں“، ابوشریح سے پوچھا گیا: اس پر عمرو بن سعید نے آپ سے کیا کہا؟ کہا: اس نے مجھ سے کہا: ابوشریح! میں یہ بات آپ سے زیادہ اچھی طرح جانتا ہوں، حرم مکہ کسی نافرمان ( یعنی باغی ) کو پناہ نہیں دیتا اور نہ کسی کا خون کر کے بھاگنے والے کو اور نہ چوری کر کے بھاگنے والے کو۔ امام ترمذی کہتے ہیں: ۱- ابوشریح رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- ابوشریح خزاعی کا نام خویلد بن عمرو ہے۔ اور یہی عدوی اور کعبی یہی ہیں، ۳- اس باب میں ابوہریرہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- «ولا فارا بخربة» کی بجائے «ولا فارا بخزية» زائے منقوطہٰ اور یاء کے ساتھ بھی مروی ہے، ۵- اور «ولا فارا بخربة» میں «خربہ» کے معنی گناہ اور جرم کے ہیں یعنی جس نے کوئی جرم کیا یا خون کیا پھر حرم میں پناہ لی تو اس پر حد جاری کی جائے گی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": 810,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”حج اور عمرہ ایک کے بعد دوسرے کو ادا کرو اس لیے کہ یہ دونوں فقر اور گناہوں کو اس طرح مٹا دیتے ہیں جیسے بھٹی لوہے، سونے اور چاندی کے میل کو مٹا دیتی ہے اور حج مبرور ۱؎ کا بدلہ صرف جنت ہے“۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود کی حدیث حسن ہے، اور ابن مسعود کی روایت سے غریب ہے، ۲- اس باب میں عمر، عامر بن ربیعہ، ابوہریرہ، عبداللہ بن حبشی، ام سلمہ اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": 811,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے حج کیا اور اس نے کوئی فحش اور بیہیودہ بات نہیں کی، اور نہ ہی کوئی گناہ کا کام کیا ۱؎ تو اس کے گزشتہ تمام گناہ ۲؎ بخش دئیے جائیں گے“۔ امام ترمذی کہتے ہیں: ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": 812,
			"text": "علی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سفر کے خرچ اور سواری کا مالک ہو جو اسے بیت اللہ تک پہنچا سکے اور وہ حج نہ کرے تو اس میں کوئی فرق نہیں کہ وہ یہودی ہو کر مرے یا عیسائی ہو کر، اور یہ اس لیے کہ اللہ نے اپنی کتاب ( قرآن ) میں فرمایا ہے: ”اللہ کے لیے بیت اللہ کا حج کرنا لوگوں پر فرض ہے جو اس تک پہنچنے کی استطاعت رکھتے ہوں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے ۱؎، ہم اسے صرف اسی سند سے جانتے ہیں، ۲- اس کی سند میں کلام ہے۔ ہلال بن عبداللہ مجہول راوی ہیں۔ اور حارث حدیث میں ضعیف گردانے جاتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": 813,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر پوچھا: اللہ کے رسول! کیا چیز حج واجب کرتی ہے؟ آپ نے فرمایا: ”سفر خرچ اور سواری“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- ابراہیم ہی ابن یزید خوزی مکی ہیں اور ان کے حافظہ کے تعلق سے بعض اہل علم نے ان پر کلام کیا ہے، ۳- اہل علم کا اسی پر عمل ہے کہ آدمی جب سفر خرچ اور سواری کا مالک ہو جائے تو اس پر حج واجب ہو جاتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": 814,
			"text": "علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ جب یہ حکم نازل ہوا کہ ”اللہ کے لیے لوگوں پر خانہ کعبہ کا حج فرض ہے جو اس تک پہنچنے کی طاقت رکھیں“، تو لوگوں نے پوچھا: اللہ کے رسول! کیا حج ہر سال ( فرض ہے ) ؟ آپ خاموش رہے۔ لوگوں نے پھر پوچھا: اللہ کے رسول! کیا ہر سال؟ آپ نے فرمایا: ”نہیں“، اور ”اگر میں ہاں کہہ دیتا تو ( ہر سال ) واجب ہو جاتا اور پھر اللہ نے یہ حکم نازل فرمایا: ”اے ایمان والو! ایسی چیزوں کے بارے میں مت پوچھا کرو کہ اگر وہ تمہارے لیے ظاہر کر دی جائیں تو تم پر شاق گزریں“۔ امام ترمذی کہتے ہیں: ۱- علی رضی الله عنہ کی حدیث اس سند سے حسن غریب ہے، ۲- ابوالبختری کا نام سعید بن ابی عمران ہے اور یہی سعید بن فیروز ہیں، ۳- اس باب میں ابن عباس اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": 815,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے تین حج کئے، دو حج ہجرت سے پہلے اور ایک حج ہجرت کے بعد، اس کے ساتھ آپ نے عمرہ بھی کیا اور ترسٹھ اونٹ ہدی کے طور پر ساتھ لے گئے اور باقی اونٹ یمن سے علی لے کر آئے۔ ان میں ابوجہل کا ایک اونٹ تھا۔ اس کی ناک میں چاندی کا ایک حلقہ تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے انہیں نحر کیا، پھر آپ نے ہر اونٹ میں سے ایک ایک ٹکڑا لے کر اسے پکانے کا حکم دیا، تو پکایا گیا اور آپ نے اس کا شوربہ پیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث سفیان کی روایت سے غریب ہے، ہم اسے صرف زید بن حباب کے طریق سے جانتے ہیں ۱؎، ۲- میں نے عبداللہ بن عبدالرحمٰن دارمی کو دیکھا کہ انہوں نے اپنی کتابوں میں یہ حدیث عبداللہ بن ابی زیاد کے واسطہ سے روایت کی ہے، ۳- میں نے محمد بن اسماعیل بخاری سے اس حدیث کے سلسلے میں پوچھا تو وہ اسے بروایت «الثوري عن جعفر عن أبيه عن جابر عن النبي صلى الله عليه وسلم» نہیں جان سکے، میں نے انہیں دیکھا کہ انہوں نے اس حدیث کو محفوظ شمار نہیں کیا، اور کہا: یہ ثوری سے روایت کی جاتی ہے اور ثوری نے ابواسحاق سے اور ابواسحاق نے مجاہد سے مرسلاً روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": 816,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے چار عمرے کئے: حدیبیہ کا عمرہ، دوسرا عمرہ اگلے سال یعنی ذی قعدہ میں قضاء کا عمرہ، تیسرا عمرہ جعرانہ ۱؎ کا، چوتھا عمرہ جو اپنے حج کے ساتھ کیا۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن غریب ہے، ۲- اس باب میں انس، عبداللہ بن عمرو اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": 817,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ جب نبی اکرم صلی اللہ علیہ وسلم نے حج کا ارادہ کیا تو آپ نے لوگوں میں اعلان کرایا۔ ( مدینہ میں ) لوگ اکٹھا ہو گئے، چنانچہ جب آپ ( وہاں سے چل کر ) بیداء پہنچے تو احرام باندھا ۱؎۔ امام ترمذی کہتے ہیں: ۱- جابر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر، انس، مسور بن مخرمہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": 818,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں بیداء جس کے بارے میں لوگ رسول اللہ صلی اللہ علیہ وسلم پر جھوٹ باندھتے ہیں ( کہ وہاں سے احرام باندھا ) ۱؎ اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم نے مسجد ( ذی الحلیفہ ) کے پاس درخت کے قریب تلبیہ پکارا ۲؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": 819,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے نماز کے بعد احرام باندھا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ہم عبدالسلام بن حرب کے علاوہ کسی کو نہیں جانتے جس نے یہ حدیث روایت کی ہو، ۳- جس چیز کو اہل علم نے مستحب قرار دیا ہے وہ یہی ہے کہ آدمی نماز کے بعد احرام باندھے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": 820,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حج افراد ۱؎ کیا۔ امام ترمذی کہتے ہیں: ۱- عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے، ۴- ابن عمر رضی الله عنہما سے بھی مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے حج افراد کیا، ابوبکر، عمر اور عثمان رضی الله عنہم نے بھی افراد کیا، ۵- ثوری کہتے ہیں کہ حج افراد کرو تو بھی بہتر ہے، حج قران کرو تو بھی بہتر ہے اور حج تمتع کرو تو بھی بہتر ہے۔ شافعی نے بھی اسی جیسی بات کہی، ۶- کہا: ہمیں سب سے زیادہ افراد پسند ہے پھر تمتع اور پھر قران۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": 821,
			"text": "انس رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو «لبيك بعمرة وحجة» فرماتے سنا ۱؎۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر اور عمران بن حصین سے بھی احادیث آئی ہیں، ۳- بعض اہل علم اسی طرف گئے ہیں، اہل کوفہ وغیرہ نے اسی کو اختیار کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": 822,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حج تمتع کیا ۱؎ اور ابوبکر، عمر اور عثمان رضی الله عنہم نے بھی ۲؎ اور سب سے پہلے جس نے اس سے روکا وہ معاویہ رضی الله عنہ ہیں ۳؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": 823,
			"text": "محمد بن عبداللہ بن حارث بن نوفل کہتے ہیں کہ انہوں نے سعد بن ابی وقاص اور ضحاک بن قیس رضی الله عنہما سے سنا، دونوں عمرہ کو حج میں ملانے کا ذکر کر رہے تھے۔ ضحاک بن قیس نے کہا: ایسا وہی کرے گا جو اللہ کے حکم سے ناواقف ہو، اس پر سعد رضی الله عنہ نے کہا: بہت بری بات ہے جو تم نے کہی، میرے بھتیجے! تو ضحاک بن قیس نے کہا: عمر بن خطاب رضی الله عنہ نے اس سے منع کیا ہے، اس پر سعد رضی الله عنہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے اسے کیا ہے اور آپ کے ساتھ ہم نے بھی اسے کیا ہے۔ امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": 824,
			"text": "ابن شہاب زہری کہتے ہیں کہ سالم بن عبداللہ نے ان سے بیان کیا کہ انہوں نے اہل شام میں سے ایک شخص سے سنا، وہ عبداللہ بن عمر رضی الله عنہما سے حج میں عمرہ سے فائدہ اٹھانے کے بارے میں پوچھ رہا تھا، تو عبداللہ بن عمر رضی الله عنہما نے کہا: یہ جائز ہے۔ اس پر شامی نے کہا: آپ کے والد نے تو اس سے روکا ہے؟ عبداللہ بن عمر رضی الله عنہما نے کہا: ذرا تم ہی بتاؤ اگر میرے والد کسی چیز سے روکیں اور رسول اللہ صلی اللہ علیہ وسلم نے اسے کیا ہو تو میرے والد کے حکم کی پیروی کی جائے گی یا رسول اللہ صلی اللہ علیہ وسلم کے حکم کی، تو اس نے کہا: رسول اللہ صلی اللہ علیہ وسلم کے حکم کی، تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے ایسا کیا ہے۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث ( ۸۲۲ ) حسن ہے، ۲- اس باب میں علی، عثمان، جابر، سعد، اسماء بنت ابی بکر اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے ایک جماعت نے اسی کو پسند کیا ہے کہ حج میں عمرہ کو شامل کر کے حج تمتع کرنا درست ہے، ۴- اور حج تمتع یہ ہے کہ آدمی حج کے مہینوں میں عمرہ کے ذریعہ داخل ہو، پھر عمرہ کر کے وہیں ٹھہرا رہے یہاں تک کہ حج کر لے تو وہ متمتع ہے، اس پر ہدی کی جو اسے میسر ہو قربانی لازم ہو گی، اگر اسے ہدی نہ مل سکے تو حج میں تین دن اور گھر لوٹ کر سات دن کے روزے رکھے، ۵- متمتع کے لیے مستحب ہے کہ جب وہ حج میں تین روزے رکھے تو ذی الحجہ کے ( ابتدائی ) دس دنوں میں رکھے اور اس کا آخری روزہ یوم عرفہ کو ہو، اور صحابہ کرام میں سے بعض اہل علم جن میں ابن عمر اور عائشہ رضی الله عنہم بھی شامل ہیں کے قول کی رو سے اگر وہ دس دنوں میں یہ روزے نہ رکھ سکے تو ایام تشریق میں رکھ لے۔ یہی مالک، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۶- اور بعض کہتے ہیں: ایام تشریق میں روزہ نہیں رکھے گا۔ یہ اہل کوفہ کا قول ہے۔ امام ترمذی کہتے ہیں: اہل حدیث حج میں عمرہ کو شامل کر کے حج تمتع کرنے کو پسند کرتے ہیں، یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": 825,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کا تلبیہ یہ تھا «لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك» ”حاضر ہوں، اے اللہ میں حاضر ہوں، حاضر ہوں، تیرا کوئی شریک نہیں میں حاضر ہوں۔ سب تعریف اور نعمت تیری ہی ہے اور سلطنت بھی، تیرا کوئی شریک نہیں“۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن مسعود، جابر، ام المؤمنین عائشہ رضی الله عنہا، ابن عباس اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ اور یہی سفیان، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۴- شافعی کہتے ہیں: اگر وہ اللہ کی تعظیم کے کچھ کلمات کا اضافہ کر لے تو کوئی حرج نہیں ہو گا – ان شاء اللہ- لیکن میرے نزدیک پسندیدہ بات یہ ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے تلبیہ پر اکتفا کرے۔ شافعی کہتے ہیں: ہم نے جو یہ کہا کہ ”اللہ کی تعظیم کے کچھ کلمات بڑھا لینے میں کوئی حرج نہیں تو اس دلیل سے کہ ابن عمر سے مروی ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے تلبیہ یاد کیا پھر اپنی طرف سے اس میں «لبيك والرغباء إليك والعمل» ”حاضر ہوں، تیری ہی طرف رغبت ہے اور عمل بھی تیرے ہی لیے ہے“ کا اضافہ کیا ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": 826,
			"text": "امام ترمذی کہتے ہیں: ۱- عبداللہ بن عمر رضی الله عنہما کہتے تھے: یہ رسول اللہ صلی اللہ علیہ وسلم کا تلبیہ ہے، پھر وہ رسول اللہ صلی اللہ علیہ وسلم کے تلبیہ کے اخیر میں اپنی طرف سے ان الفاظ کا اضافہ کرتے: «لبيك لبيك وسعديك والخير في يديك لبيك والرغباء إليك والعمل» ”حاضر ہوں تیری خدمت میں حاضر ہوں تیری خدمت میں اور خوش ہوں تیری تابعداری پر اور ہر طرح کی بھلائی تیرے ہی دونوں ہاتھوں میں ہے اور تیری طرف رغبت ہے اور عمل بھی تیرے ہی لیے ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": 827,
			"text": "ابوبکر صدیق رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے پوچھا گیا کہ کون سا حج افضل ہے؟ آپ نے فرمایا: ”جس میں کثرت سے تلبیہ پکارا گیا ہو اور خوب خون بہایا گیا ہو“ ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "سہل بن سعد رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو مسلمان بھی تلبیہ پکارتا ہے اس کے دائیں یا بائیں پائے جانے والے پتھر، درخت اور ڈھیلے سبھی تلبیہ پکارتے ہیں، یہاں تک کہ دونوں طرف کی زمین کے آخری سرے تک کی چیزیں سبھی تلبیہ پکارتی ہیں“۔ امام ترمذی کہتے ہیں: ۱- ابوبکر رضی الله عنہ کی حدیث غریب ہے، ہم اسے ابن ابی فدیک ہی کے طریق سے جانتے ہیں، انہوں نے ضحاک بن عثمان سے روایت کی ہے، ۲- محمد بن منکدر نے عبدالرحمٰن بن یربوع سے اسے نہیں سنا ہے، البتہ محمد بن منکدر نے بسند «سعید بن عبدالرحمٰن بن یربوع عن أبیہ عبدالرحمٰن بن یربوع» اس حدیث کے علاوہ دوسری چیزیں روایت کی ہیں، ۳- ابونعیم طحان ضرار بن صرد نے یہ حدیث بطریق: «ابن أبي فديك عن الضحاك بن عثمان عن محمد بن المنكدر عن سعيد بن عبدالرحمٰن بن يربوع عن أبيه عن أبي بكر عن النبي صلى الله عليه وسلم» روایت کی ہے اور اس میں ضرار سے غلطی ہوئی ہے، ۴- احمد بن حنبل کہتے ہیں: جس نے اس حدیث میں یوں کہا: «عن محمد بن المنكدر عن ابن عبدالرحمٰن بن يربوع عن أبيه» اس نے غلطی کی ہے، ۵- میں نے محمد بن اسماعیل بخاری سے ضرار بن صرد کی حدیث ذکر کی جسے انہوں نے ابن ابی فدیک سے روایت کی ہے تو انہوں نے کہا: یہ غلط ہے، میں نے کہا: اسے دوسرے لوگوں نے بھی انہیں کی طرح ابن ابی فدیک سے روایت کی ہے تو انہوں نے کہا: یہ کچھ نہیں ہے لوگوں نے اسے ابن ابی فدیک سے روایت کیا ہے اور اس میں سعید بن عبدالرحمٰن کے واسطے کا ذکر نہیں کیا ہے، میں نے بخاری کو دیکھا کہ وہ ضرار بن صرد کی تضعیف کر رہے تھے، ۶- اس باب میں ابن عمر اور جابر رضی الله عنہ سے بھی احادیث آئی ہیں، ۷- «عج» : تلبیہ میں آواز بلند کرنے کو اور «ثج» : اونٹنیاں نحر ( ذبح ) کرنے کو کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": 829,
			"text": "سائب بن خلاد رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میرے پاس جبرائیل نے آ کر مجھے حکم دیا کہ میں اپنے صحابہ کو حکم دوں کہ وہ تلبیہ میں اپنی آواز بلند کریں“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- خلاد بن السائب کی حدیث جسے انہوں نے اپنے والد سے روایت کی ہے، حسن صحیح ہے۔ ۲- بعض لوگوں نے یہ حدیث بطریق: «خلاد بن السائب عن زيد بن خالد عن النبي صلى الله عليه وسلم» روایت کی ہے، لیکن یہ صحیح نہیں ہے۔ صحیح یہی ہے کہ خلاد بن سائب نے اپنے باپ سے روایت کی ہے، اور یہ خلاد بن سائب بن خلاد بن سوید انصاری ہیں، ۳- اس باب میں زید بن خالد، ابوہریرہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": 830,
			"text": "زید بن ثابت رضی الله عنہ سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو دیکھا کہ آپ نے احرام باندھنے کے لیے اپنے کپڑے اتارے اور غسل کیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اہل علم کی ایک جماعت نے احرام باندھنے کے وقت غسل کرنے کو مستحب قرار دیا ہے۔ یہی شافعی بھی کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": 831,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ ایک شخص نے عرض کیا: اللہ کے رسول! ہم احرام کہاں سے باندھیں؟ آپ نے فرمایا: ”اہل مدینہ ذی الحلیفہ ۲؎ سے احرام باندھیں، اہل شام جحفہ ۳؎ سے اور اہل نجد قرن سے ۴؎۔ اور لوگوں کا کہنا ہے کہ اہل یمن یلملم سے ۵؎۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس، جابر بن عبداللہ اور عبداللہ بن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": 832,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اہل مشرق کی میقات عقیق ۱؎ مقرر کی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- محمد بن علی ہی ابو جعفر محمد بن علی بن حسین بن علی ابن ابی طالب ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": 833,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ ایک شخص نے کھڑ ہو کر عرض کیا: اللہ کے رسول! آپ ہمیں احرام میں کون کون سے کپڑے پہننے کا حکم دیتے ہیں؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نہ قمیص پہنو، نہ پاجامے، نہ عمامے اور نہ موزے، الا یہ کہ کسی کے پاس جوتے نہ ہوں تو وہ خف ( چمڑے کے موزے ) پہنے اور اسے کاٹ کر ٹخنے سے نیچے کر لے ۱؎ اور نہ ایسا کوئی کپڑا پہنو جس میں زعفران یا ورس لگا ہو ۲؎، اور محرم عورت نقاب نہ لگائے اور نہ دستانے پہنے“ ۳؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم اسی پر عمل ہے۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": 834,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”محرم کو جب تہبند میسر نہ ہو تو پاجامہ پہن لے اور جب جوتے میسر نہ ہوں تو «خف» ( چمڑے کے موزے ) پہن لے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں کہ جب محرم تہ بند نہ پائے تو پاجامہ پہن لے، اور جب جوتے نہ پائے تو «خف» ( چرمی موزے ) پہن لے۔ یہ احمد کا قول ہے، ۴- بعض نے ابن عمر رضی الله عنہما کی حدیث کی بنیاد پر جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہا ہے کہ جب وہ جوتے نہ پائے تو «خف» ( چرمی موزے ) پہنے اور اسے کاٹ کر ٹخنے کے نیچے کر لے، سفیان ثوری، شافعی، اور مالک اسی کے قائل ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": 835,
			"text": "یعلیٰ بن امیہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک اعرابی کو دیکھا جو احرام کی حالت میں کرتا پہنے ہوئے تھا۔ تو آپ نے اسے حکم دیا کہ وہ اسے اتار دے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": 836,
			"text": "یعلیٰ رضی الله عنہ نبی اکرم صلی اللہ علیہ وسلم سے اسی مفہوم کی حدیث روایت کرتے ہیں۔ یہ زیادہ صحیح ہے اور حدیث میں ایک قصہ ہے ۱؎۔ امام ترمذی کہتے ہیں: اسی طرح اسے قتادہ، حجاج بن ارطاۃ اور دوسرے کئی لوگوں نے عطا سے اور انہوں نے یعلیٰ بن امیہ سے روایت کی ہے۔ لیکن صحیح وہی ہے جسے عمرو بن دینار اور ابن جریج نے عطاء سے، اور عطاء نے صفوان بن یعلیٰ سے اور صفوان نے اپنے والد یعلیٰ سے اور یعلیٰ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 837,
			"arabicnumber": 837,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانچ موذی جانور ہیں جو حرم میں یا حالت احرام میں بھی مارے جا سکتے ہیں: چوہیا، بچھو، کوا، چیل، کاٹ کھانے والا کتا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عائشہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن مسعود، ابن عمر، ابوہریرہ، ابوسعید اور ابن عباس رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 838,
			"arabicnumber": 838,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”محرم سرکش درندے، کاٹ کھانے والے کتے، چوہا، بچھو، چیل اور کوے مار سکتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اہل علم کا اسی پر عمل ہے۔ وہ کہتے ہیں: محرم ظلم ڈھانے والے درندوں کو مار سکتا ہے، سفیان ثوری اور شافعی کا بھی یہی قول ہے۔ شافعی کہتے ہیں: محرم ہر اس درندے کو جو لوگوں کو یا جانوروں کو ایذاء پہنچائے، مار سکتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 839,
			"arabicnumber": 839,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے پچھنا لگوایا اور آپ محرم تھے ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عباس کی حدیث حسن صحیح ہے، ۲- اس باب میں انس ۲؎، عبداللہ بن بحینہ ۳؎ اور جابر رضی الله عنہ سے بھی احادیث آئی ہیں، ۳- اہل علم کی ایک جماعت نے محرم کو پچھنا لگوانے کی اجازت دی ہے۔ وہ کہتے ہیں کہ وہ بال نہیں منڈائے گا، ۴- مالک کہتے ہیں کہ محرم پچھنا نہیں لگوا سکتا، الا یہ کہ ضروری ہو، ۵- سفیان ثوری اور شافعی کہتے ہیں: محرم کے پچھنا لگوانے میں کوئی حرج نہیں لیکن وہ بال نہیں اتار سکتا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 840,
			"arabicnumber": 840,
			"text": "نبیہ بن وہب کہتے ہیں کہ ابن معمر نے اپنے بیٹے کی شادی کرنی چاہی، تو انہوں نے مجھے ابان بن عثمان کے پاس بھیجا، وہ مکہ میں امیر حج تھے۔ میں ان کے پاس آیا اور میں نے ان سے کہا: آپ کے بھائی اپنے بیٹے کی شادی کرنا چاہتے ہیں اور چاہتے ہیں کہ آپ کو اس پر گواہ بنائیں، تو انہوں نے کہا: میں انہیں ایک گنوار اعرابی سمجھتا ہوں، محرم نہ خود نکاح کر سکتا اور نہ کسی کا نکاح کرا سکتا ہے – «أو كما قال» – پھر انہوں نے ( اپنے والد ) عثمان رضی الله عنہ سے روایت کرتے ہوئے اسی کے مثل بیان کیا، وہ اسے مرفوع روایت کر رہے تھے۔ امام ترمذی کہتے ہیں: ۱- عثمان رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابورافع اور میمونہ رضی الله عنہ سے بھی احادیث آئی ہیں، ۳- بعض صحابہ کرام جن میں عمر بن خطاب، علی بن ابی طالب اور ابن عمر رضی الله عنہم بھی شامل ہیں اسی پر عمل ہے، اور یہی بعض تابعین فقہاء کا بھی قول ہے اور مالک، شافعی، احمد اور اسحاق بن راہویہ بھی یہی کہتے ہیں۔ یہ لوگ محرم کے لیے نکاح کرنا جائز نہیں سمجھتے، ان لوگوں کا کہنا ہے کہ اگر محرم نے نکاح کر لیا تو اس کا نکاح باطل ہو گا ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 841,
			"arabicnumber": 841,
			"text": "ابورافع رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے میمونہ سے نکاح کیا اور آپ حلال تھے پھر ان کے خلوت میں گئے تب بھی آپ حلال تھے، اور میں ہی آپ دونوں کے درمیان پیغام رساں تھا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اور ہم حماد بن زید کے علاوہ کسی ایسے شخص کو نہیں جانتے جس نے اسے مطر وراق کے واسطے سے ربیعہ سے مسنداً روایت کیا ہو، ۳- اور مالک بن انس نے ربیعہ سے، اور ربیعہ نے سلیمان بن یسار سے روایت کی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے میمونہ سے شادی کی اور آپ حلال تھے۔ اسے مالک نے مرسلا روایت کیا ہے، اور سلیمان بن ہلال نے بھی اسے ربیعہ سے مرسلا روایت کیا ہے، ۴- یزید بن اصم ام المؤمنین میمونہ رضی الله عنہا سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے شادی کی اور آپ حلال تھے یعنی محرم نہیں تھے۔ یزید بن اصم میمونہ کے بھانجے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 842,
			"arabicnumber": 842,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے میمونہ سے شادی کی اور آپ محرم تھے۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں عائشہ رضی الله عنہا سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے۔ اور یہی سفیان ثوری اور اہل کوفہ بھی کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 843,
			"arabicnumber": 843,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے میمونہ سے شادی کی اور آپ محرم تھے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 844,
			"arabicnumber": 844,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے میمونہ سے شادی کی تو آپ محرم تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- نبی اکرم صلی اللہ علیہ وسلم کے میمونہ سے شادی کرنے کے بارے میں لوگوں کا اختلاف ہے۔ اس لیے کہ نبی اکرم صلی اللہ علیہ وسلم نے مکے کے راستے میں ان سے شادی کی تھی، بعض لوگوں نے کہا: آپ نے جب ان سے شادی کی تو آپ حلال تھے البتہ آپ کے ان سے شادی کرنے کی بات ظاہر ہوئی تو آپ محرم تھے، اور آپ نے مکے کے راستے میں مقام سرف میں ان کے ساتھ خلوت میں گئے تو بھی آپ حلال تھے۔ میمونہ کا انتقال بھی سرف میں ہوا جہاں رسول اللہ صلی اللہ علیہ وسلم نے ان سے خلوت کی تھی اور وہ مقام سرف میں ہی دفن کی گئیں۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 845,
			"arabicnumber": 845,
			"text": "ام المؤمنین میمونہ رضی الله عنہا کہتی ہیں: : رسول اللہ صلی اللہ علیہ وسلم نے ان سے شادی کی اور آپ حلال تھے اور ان سے خلوت کی تو بھی آپ حلال تھے۔ اور انہوں نے سرف ہی میں انتقال کیا، ہم نے انہیں اسی سایہ دار مقام میں دفن کیا جہاں آپ نے ان سے خلوت کی تھی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- دیگر کئی لوگوں نے یہ حدیث یزید بن اصم سے مرسلاً روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے میمونہ سے شادی کی اور آپ حلال تھے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 846,
			"arabicnumber": 846,
			"text": "جابر بن عبداللہ رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”خشکی کا شکار تمہارے لیے حالت احرام میں حلال ہے جب کہ تم نے اس کا شکار خود نہ کیا ہو، نہ ہی وہ تمہارے لیے کیا گیا ہو۔ امام ترمذی کہتے ہیں: ۱- اس باب میں ابوقتادہ اور طلحہ رضی الله عنہما سے بھی روایت ہے، ۲- جابر کی حدیث مفسَّر ہے، ۳- اور ہم مُطّلب کا جابر سے سماع نہیں جانتے، ۴- اور بعض اہل علم کا اسی پر عمل ہے۔ وہ محرم کے لیے شکار کے کھانے میں کوئی حرج نہیں سمجھتے جب اس نے خود اس کا شکار نہ کیا ہو، نہ ہی وہ اس کے لیے کیا گیا ہو، ۵- شافعی کہتے ہیں: یہ اس باب میں مروی سب سے اچھی اور قیاس کے سب سے زیادہ موافق حدیث ہے، اور اسی پر عمل ہے۔ اور یہی احمد اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 847,
			"arabicnumber": 847,
			"text": "ابوقتادہ رضی الله عنہ کہتے ہیں کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے ساتھ تھے، یہاں تک کہ آپ جب مکے کا کچھ راستہ طے کر چکے تو وہ اپنے بعض محرم ساتھیوں کے ساتھ پیچھے رہ گئے جب کہ ابوقتادہ خود غیر محرم تھے، اسی دوران انہوں نے ایک نیل گائے دیکھا، تو وہ اپنے گھوڑے پر سوار ہوئے اور اپنے ساتھیوں سے درخواست کی کہ وہ انہیں ان کا کوڑا اٹھا کر دے دیں تو ان لوگوں نے اسے انہیں دینے سے انکار کیا۔ پھر انہوں نے ان سے اپنا نیزہ مانگا۔ تو ان لوگوں نے اسے بھی اٹھا کر دینے سے انکار کیا تو انہوں نے اسے خود ہی ( اتر کر ) اٹھا لیا اور شکار کا پیچھا کیا اور اسے مار ڈالا، تو بعض صحابہ کرام نے اس شکار میں سے کھایا اور بعض نے نہیں کھایا۔ پھر وہ نبی اکرم صلی اللہ علیہ وسلم سے آ کر ملے اور اس بارے آپ صلی اللہ علیہ وسلم سے پوچھا تو آپ نے فرمایا: ”یہ تو ایک ایسی غذا ہے جسے اللہ نے تمہیں کھلایا ہے“ ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 848,
			"arabicnumber": 848,
			"text": "اس سند سے بھی ابوقتادہ سے نیل گائے کے بارے میں ابونضر ہی کی حدیث کی طرح مروی ہے البتہ زید بن اسلم کی اس حدیث میں اتنا زائد ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کیا تمہارے پاس اس کے گوشت میں سے کچھ ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 849,
			"arabicnumber": 849,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ صعب بن جثامہ رضی الله عنہ نے انہیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم ابواء یا ودان میں ان کے پاس سے گزرے، تو انہوں نے آپ کو ایک نیل گائے ہدیہ کیا، تو آپ نے اسے لوٹا دیا۔ ان کے چہرے پر ناگواری کے آثار ظاہر ہوئے، جب رسول اللہ صلی اللہ علیہ وسلم نے اسے دیکھا تو فرمایا: ”ہم تمہیں لوٹاتے نہیں لیکن ہم محرم ہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہم میں سے اہل علم کی ایک جماعت اسی حدیث کی طرف گئی ہے اور انہوں نے محرم کے لیے شکار کا گوشت کھانے کو مکروہ کہا ہے، ۳- شافعی کہتے ہیں: ہمارے نزدیک اس حدیث کی توجیہ یہ ہے کہ آپ نے وہ گوشت صرف اس لیے لوٹا دیا کہ آپ کو گمان ہوا کہ وہ آپ ہی کی خاطر شکار کیا گیا ہے۔ سو آپ نے اسے تنزیہاً چھوڑ دیا، ۴- زہری کے بعض تلامذہ نے یہ حدیث زہری سے روایت کی ہے۔ اور اس میں «أهدى له حمارا وحشياً» کے بجائے «أهدى له لحم حمارٍ وحشٍ» ہے لیکن یہ غیر محفوظ ہے، ۵- اس باب میں علی اور زید بن ارقم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 850,
			"arabicnumber": 850,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج یا عمرہ کے لیے نکلے تھے کہ ہمارے سامنے ٹڈی کا ایک دل آ گیا، ہم انہیں اپنے کوڑوں اور لاٹھیوں سے مارنے لگے تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اسے کھاؤ، کیونکہ یہ سمندر کا شکار ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے صرف ابوالمھزم کی روایت سے جانتے ہیں جسے انہوں نے ابوہریرہ سے روایت کی ہے، ۲- ابوالمہزم کا نام یزید بن سفیان ہے۔ شعبہ نے ان میں کلام کیا ہے، ۳- اہل علم کی ایک جماعت نے محرم کو ٹڈی کا شکار کرنے اور اسے کھانے کی رخصت دی ہے، ۴- اور بعض کا خیال ہے کہ اگر وہ اس کا شکار کرے اور اسے کھائے تو اس پر فدیہ ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 851,
			"arabicnumber": 851,
			"text": "ابن ابی عمار کہتے ہیں کہ میں نے جابر رضی الله عنہ سے پوچھا: کیا لکڑ بگھا شکار میں داخل ہے؟ انہوں نے کہا: ہاں، ( پھر ) میں نے پوچھا: کیا میں اسے کھا سکتا ہوں ـ؟ انہوں نے کہا: ہاں، میں نے کہا: کیا اسے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے؟ انہوں نے کہا: ہاں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- علی بن مدینی کہتے ہیں کہ یحییٰ بن سعید کا بیان ہے کہ یہ حدیث جریر بن حزم نے بھی روایت کی ہے لیکن انہوں نے جابر سے اور جابر نے عمر رضی الله عنہ سے روایت کی ہے، ابن جریج کی حدیث زیادہ صحیح ہے، ۳- اور یہی احمد اور اسحاق بن راہویہ کا قول ہے۔ اور بعض اہل علم کا عمل اسی حدیث پر ہے کہ محرم جب لگڑ بگھا کا شکار کرے یا اسے کھائے تو اس پر فدیہ ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 852,
			"arabicnumber": 852,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے مکے میں داخل ہونے کے لیے ( مقام ) فخ میں ۱؎ غسل کیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غیر محفوظ ہے، ۲- صحیح وہ روایت ہے جسے نافع نے ابن عمر سے روایت کی ہے کہ وہ مکے میں داخل ہونے کے لیے غسل کرتے تھے۔ اور یہی شافعی بھی کہتے ہیں کہ مکے میں داخل ہونے کے لیے غسل کرنا مستحب ہے، ۳- عبدالرحمٰن بن زید بن اسلم حدیث میں ضعیف ہیں۔ احمد بن حنبل اور علی بن مدینی وغیرہما نے ان کی تضعیف کی ہے اور ہم اس حدیث کو صرف انہی کے طریق سے مرفوع جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 853,
			"arabicnumber": 853,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ جب نبی اکرم صلی اللہ علیہ وسلم مکہ آتے تو بلندی کی طرف سے داخل ہوتے اور نشیب کی طرف سے نکلتے۔ امام ترمذی کہتے ہیں: ۱- عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر رضی الله عنہما سے روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 854,
			"arabicnumber": 854,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم مکہ میں دن کے وقت داخل ہوئے تھے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 855,
			"arabicnumber": 855,
			"text": "مہاجر مکی کہتے ہیں کہ جابر بن عبداللہ سے پوچھا گیا: جب آدمی بیت اللہ کو دیکھے تو کیا اپنے دونوں ہاتھ اٹھائے؟ انہوں نے کہا: ہم نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ حج کیا، تو کیا ہم ایسا کرتے تھے؟ ۔ امام ترمذی کہتے ہیں: بیت اللہ کو دیکھ کر ہاتھ اٹھانے کی حدیث ہم شعبہ ہی کے طریق سے جانتے ہیں، شعبہ ابوقزعہ سے روایت کرتے ہیں، اور ابوقزعہ کا نام سوید بن حجیر ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 856,
			"arabicnumber": 856,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ جب نبی اکرم صلی اللہ علیہ وسلم مکہ آئے تو آپ مسجد الحرام میں داخل ہوئے، اور حجر اسود کا بوسہ لیا، پھر اپنے دائیں جانب چلے آپ نے تین چکر میں رمل کیا ۱؎ اور چار چکر میں عام چال چلے۔ پھر آپ نے مقام ابراہیم کے پاس آ کر فرمایا: ”مقام ابراہیم کو نماز پڑھنے کی جگہ بناؤ“، چنانچہ آپ نے دو رکعت نماز پڑھی، اور مقام ابراہیم آپ کے اور بیت اللہ کے درمیان تھا۔ پھر دو رکعت کے بعد حجر اسود کے پاس آ کر اس کا استلام کیا۔ پھر صفا کی طرف گئے۔ میرا خیال ہے کہ ( وہاں ) آپ نے یہ آیت پڑھی: «‏‏‏‏ ( إن الصفا والمروة من شعائر الله» ”صفا اور مروہ اللہ کی نشانیوں میں سے ہیں“۔ امام ترمذی کہتے ہیں: ۱- جابر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر رضی الله عنہما سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے۔)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 857,
			"arabicnumber": 857,
			"text": "جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے حجر اسود سے حجر اسود تک تین پھیروں میں رمل ۱؎ کیا اور چار میں عام چل چلے۔ امام ترمذی کہتے ہیں: ۱- جابر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے، ۳- اہل علم کا اسی پر عمل ہے، ۴- شافعی کہتے ہیں: جب کوئی جان بوجھ کر رمل کرنا چھوڑ دے تو اس نے غلط کیا لیکن اس پر کوئی چیز واجب نہیں اور جب اس نے ابتدائی تین پھیروں میں رمل نہ کیا ہو تو باقی میں نہیں کرے گا، ۵- بعض اہل علم کہتے ہیں: اہل مکہ کے لیے رمل نہیں ہے اور نہ ہی اس پر جس نے مکہ سے احرام باندھا ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 858,
			"arabicnumber": 858,
			"text": "ابوالطفیل کہتے ہیں کہ میں ابن عباس رضی الله عنہما کے ساتھ تھا، معاویہ رضی الله عنہ جس رکن کے بھی پاس سے گزرتے، اس کا استلام کرتے ۱؎ تو ابن عباس نے ان سے کہا: نبی اکرم صلی اللہ علیہ وسلم نے حجر اسود اور رکن یمانی کے علاوہ کسی کا استلام نہیں کیا، اس پر معاویہ رضی الله عنہ نے کہا: بیت اللہ کی کوئی چیز چھوڑی جانے کے لائق نہیں ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابن عباس کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر سے بھی روایت ہے، ۳- اکثر اہل علم کا اسی پر عمل ہے کہ حجر اسود اور رکن یمانی کے علاوہ کسی کا استلام نہ کیا جائے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 859,
			"arabicnumber": 859,
			"text": "یعلیٰ بن امیہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اضطباع کی حالت میں ۱؎ بیت اللہ کا طواف کیا، آپ کے جسم مبارک پر ایک چادر تھی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہی ثوری کی حدیث ہے جسے انہوں نے ابن جریج سے روایت کی ہے اور اسے ہم صرف کے انہی طریق سے جانتے ہیں، ۳- عبدالحمید جبیرہ بن شیبہ کے بیٹے ہیں، جنہوں نے ابن یعلیٰ سے اور ابن یعلیٰ نے اپنے والد سے روایت کی ہے اور یعلیٰ سے مراد یعلیٰ بن امیہ ہیں رضی الله عنہ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 860,
			"arabicnumber": 860,
			"text": "عابس بن ربیعہ کہتے ہیں کہ میں نے عمر بن خطاب رضی الله عنہ کو حجر اسود کا بوسہ لیتے دیکھا، وہ کہہ رہے تھے: میں تیرا بوسہ لے رہا ہوں اور مجھے معلوم ہے کہ تو ایک پتھر ہے، اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کو تیرا بوسہ لیتے نہ دیکھا ہوتا تو میں تجھے بوسہ نہ لیتا ۱؎۔ امام ترمذی کہتے ہیں: ۱- عمر کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوبکر اور ابن عمر سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 861,
			"arabicnumber": 861,
			"text": "زبیر بن عربی سے روایت ہے کہ ایک شخص نے ابن عمر رضی الله عنہما سے حجر اسود کا بوسہ لینے کے بارے میں پوچھا تو انہوں نے کہا: میں نے نبی اکرم صلی اللہ علیہ وسلم کو اسے چھوتے اور بوسہ لیتے دیکھا ہے۔ اس نے کہا: اچھا بتائیے اگر میں وہاں تک پہنچنے میں مغلوب ہو جاؤں اور اگر میں بھیڑ میں پھنس جاؤں؟ تو اس پر ابن عمر نے کہا: تم ( یہ اپنا ) اگر مگر یمن میں رکھو ۱؎ میں نے نبی اکرم صلی اللہ علیہ وسلم کو اسے چھوتے اور بوسہ لیتے دیکھا ہے۔ یہ زبیر بن عربی وہی ہیں، جن سے حماد بن زید نے روایت کی ہے، کوفے کے رہنے والے تھے، ان کی کنیت ابوسلمہ ہے۔ انہوں نے انس بن مالک اور دوسرے کئی صحابہ سے حدیثیں روایت کیں ہیں۔ اور ان سے سفیان ثوری اور دوسرے کئی اور ائمہ نے روایت کی ہیں۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے۔ ان سے یہ دوسری سندوں سے بھی مروی ہے۔ ۲- اہل علم کا اسی پر عمل ہے، وہ حجر اسود کے بوسہ لینے کو مستحب سمجھتے ہیں۔ اگر یہ ممکن نہ ہو اور آدمی وہاں تک نہ پہنچ سکے تو اسے اپنے ہاتھ سے چھو لے اور اپنے ہاتھ کا بوسہ لے لے اور اگر وہ اس تک نہ پہنچ سکے تو جب اس کے سامنے میں پہنچے تو اس کی طرف رخ کرے اور اللہ اکبر کہے، یہ شافعی کا قول ہے۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 862,
			"arabicnumber": 862,
			"text": "جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جس وقت مکہ آئے تو آپ نے بیت اللہ کے سات چکر لگائے اور یہ آیت پڑھی: «‏‏‏‏ ( واتخذوا من مقام إبراهيم مصلى» ”مقام ابراہیم کو مصلی بناؤ یعنی وہاں نماز پڑھو“ ( البقرہ: ۱۲۵ ) ، پھر مقام ابراہیم کے پیچھے نماز پڑھی، پھر حجر اسود کے پاس آئے اور اس کا استلام کیا پھر فرمایا: ”ہم ( سعی ) اسی سے شروع کریں گے جس سے اللہ نے شروع کیا ہے۔ چنانچہ آپ نے صفا سے سعی شروع کی اور یہ آیت پڑھی: «إن الصفا والمروة من شعائر الله» ”صفا اور مروہ اللہ کی نشانیوں میں سے ہیں“ ( البقرہ: ۱۵۸ ) ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسی پر اہل علم کا عمل ہے کہ سعی مروہ کے بجائے صفا سے شروع کی جائے۔ اگر کسی نے صفا کے بجائے مروہ سے سعی شروع کر دی تو یہ سعی کافی نہ ہو گی اور سعی پھر سے صفا سے شروع کرے گا، ۳- اہل علم کا اس شخص کے بارے میں اختلاف ہے کہ جس نے بیت اللہ کا طواف کیا اور صفا اور مروہ کے درمیان سعی نہیں کی، یہاں تک کہ واپس گھر چلا گیا، بعض اہل علم کہتے ہیں کہ اگر کسی نے صفا و مروہ کے درمیان سعی نہیں کی یہاں تک کہ وہ مکہ سے باہر نکل آیا پھر اسے یاد آیا، اور وہ مکے کے قریب ہے تو واپس جا کر صفا و مروہ کی سعی کرے۔ اور اگر اسے یاد نہیں آیا یہاں تک کہ وہ اپنے ملک واپس آ گیا تو اسے کافی ہو جائے گا لیکن اس پر دم لازم ہو گا، یہی سفیان ثوری کا قول ہے۔ اور بعض کہتے ہیں کہ اگر اس نے صفا و مروہ کے درمیان سعی چھوڑ دی یہاں تک کہ اپنے ملک واپس آ گیا تو یہ اسے کافی نہ ہو گا۔ یہ شافعی کا قول ہے، وہ کہتے ہیں کہ صفا و مروہ کے درمیان سعی واجب ہے، اس کے بغیر حج درست نہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 863,
			"arabicnumber": 863,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف کیا اور صفا اور مروہ کے درمیان سعی کی، تاکہ مشرکین کو اپنی قوت دکھا سکیں۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں عائشہ، ابن عمر اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم اسی کو مستحب سمجھتے ہیں کہ آدمی صفا و مروہ کے درمیان سعی کرے، اگر وہ سعی نہ کرے بلکہ صفا و مروہ کے درمیان عام چال چلے تو اسے جائز سمجھتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 864,
			"arabicnumber": 864,
			"text": "کثیر بن جمہان کہتے ہیں کہ میں نے ابن عمر رضی الله عنہما کو سعی میں عام چال چلتے دیکھا تو میں نے ان سے کہا: کیا آپ صفا و مروہ کی سعی میں عام چال چلتے ہیں؟ انہوں نے کہا: اگر میں دوڑوں تو میں نے رسول اللہ صلی اللہ علیہ وسلم کو دوڑتے بھی دیکھا ہے، اور اگر میں عام چال چلوں تو میں نے رسول اللہ صلی اللہ علیہ وسلم کو عام چال چلتے بھی دیکھا ہے، اور میں کافی بوڑھا ہوں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- سعید بن جبیر کے واسطے سے ابن عمر سے اسی طرح مروی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 865,
			"arabicnumber": 865,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنی سواری پر بیت اللہ کا طواف کیا جب ۱؎ آپ حجر اسود کے پاس پہنچتے تو اس کی طرف اشارہ کرتے ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر، ابوالطفیل اور ام سلمہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کی ایک جماعت نے بیت اللہ کا طواف، اور صفا و مروہ کی سعی سوار ہو کر کرنے کو مکروہ کہا ہے الا یہ کہ کوئی عذر ہو، یہی شافعی کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 866,
			"arabicnumber": 866,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے بیت اللہ کا طواف پچاس بار کیا تو وہ اپنے گناہوں سے اس طرح نکل آئے گا جیسے اسی دن اس کی ماں نے اسے جنم دیا ہے“۔ امام ترمذی کہتے ہیں: ۱- اس باب میں انس اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں، ۲- ابن عباس رضی الله عنہما کی حدیث غریب ہے، ۳- میں نے محمد بن اسماعیل بخاری سے اس حدیث کے بارے میں پوچھا تو انہوں نے کہا: یہ تو ابن عباس سے ان کے اپنے قول سے روایت کیا جاتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 867,
			"arabicnumber": 867,
			"text": "ایوب سختیانی کہتے ہیں کہ لوگ عبداللہ بن سعید بن جبیر کو ان کے والد سے افضل شمار کرتے تھے۔ اور عبداللہ کے ایک بھائی ہیں جنہیں عبدالملک بن سعید بن جبیر کہتے ہیں۔ انہوں نے ان سے بھی روایت کی ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 868,
			"arabicnumber": 868,
			"text": "جبیر بن مطعم رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اے بنی عبد مناف! رات دن کے کسی بھی حصہ میں کسی کو اس گھر کا طواف کرنے اور نماز پڑھنے سے نہ روکو“۔ امام ترمذی کہتے ہیں: ۱- جبیر مطعم رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- عبداللہ بن ابی نجیح نے بھی یہ حدیث عبداللہ بن باباہ سے روایت کی ہے، ۳- اس باب میں ابن عباس اور ابوذر رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- مکے میں عصر کے بعد اور فجر کے بعد نماز پڑھنے کے سلسلے میں اہل علم کا اختلاف ہے۔ بعض کہتے ہیں: عصر کے بعد اور فجر کے بعد نماز پڑھنے اور طواف کرنے میں کوئی حرج نہیں ہے۔ یہ شافعی، احمد اور اسحاق بن راہویہ کا قول ہے ۱؎ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کی حدیث ۲؎ سے دلیل لی ہے۔ اور بعض کہتے ہیں: اگر کوئی عصر کے بعد طواف کرے تو سورج ڈوبنے تک نماز نہ پڑھے۔ اسی طرح اگر کوئی فجر کے بعد طواف کرے تو سورج نکلنے تک نماز نہ پڑھے۔ ان کی دلیل عمر رضی الله عنہ کی حدیث ہے کہ انہوں نے فجر کے بعد طواف کیا اور نماز نہیں پڑھی پھر مکہ سے نکل گئے یہاں تک کہ وہ ذی طویٰ میں اترے تو سورج نکل جانے کے بعد نماز پڑھی۔ یہ سفیان ثوری اور مالک بن انس کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 869,
			"arabicnumber": 869,
			"text": "جابر بن عبداللہ رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے طواف کی دو رکعت میں اخلاص کی دونوں سورتیں یعنی «قل يا أيها الكافرون» اور «قل هو الله أحد» پڑھیں ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 870,
			"arabicnumber": 870,
			"text": "محمد (محمد بن علی الباقر) سے روایت ہے کہ وہ طواف کی دونوں رکعتوں میں: «قل يا أيها الكافرون» اور «قل هو الله أحد» پڑھنے کو مستحب سمجھتے تھے۔ امام ترمذی کہتے ہیں: ۱- سفیان کی جعفر بن محمد عن أبیہ کی روایت عبدالعزیز بن عمران کی حدیث سے زیادہ صحیح ہے، ۲- اور ( سفیان کی روایت کردہ ) جعفر بن محمد کی حدیث جسے وہ اپنے والد ( کے عمل سے ) سے روایت کرتے ہیں ( عبدالعزیز کی روایت کردہ ) جعفر بن محمد کی اس حدیث سے زیادہ صحیح ہے جسے وہ اپنے والد سے اور وہ جابر سے اور وہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں ۱؎، ۳- عبدالعزیز بن عمران حدیث میں ضعیف ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 871,
			"arabicnumber": 871,
			"text": "زید بن اثیع کہتے ہیں کہ میں نے علی رضی الله عنہ سے پوچھا: آپ کو کن باتوں کا حکم دے کر بھیجا گیا ہے؟ ۱؎ انہوں نے کہا: چار باتوں کا: جنت میں صرف وہی جان داخل ہو گی جو مسلمان ہو، بیت اللہ کا طواف کوئی ننگا ہو کر نہ کرے۔ مسلمان اور مشرک اس سال کے بعد جمع نہ ہوں، جس کسی کا نبی اکرم صلی اللہ علیہ وسلم سے کوئی عہد ہو تو اس کا یہ عہد اس کی مدت تک کے لیے ہو گا۔ اور جس کی کوئی مدت نہ ہو تو اس کی مدت چار ماہ ہے۔ امام ترمذی کہتے ہیں: ۱- علی رضی الله عنہ کی حدیث حسن ہے، ۲- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 872,
			"arabicnumber": 872,
			"text": "ہم سے ابن ابی عمر اور نصر بن علی نے بیان کیا، یہ دونوں کہتے ہیں کہ ہم سے سفیان بن عیینہ نے بیان کیا اور سفیان نے ابواسحاق سبیعی سے اسی طرح کی حدیث روایت کی، البتہ ابن ابی عمر اور نصر بن علی نے ( زید بن اثیع کے بجائے ) زید بن یثیع کہا ہے، اور یہ زیادہ صحیح ہے۔ امام ترمذی کہتے ہیں: شعبہ کو اس میں وہم ہوا ہے، انہوں نے: زید بن اثیل کہا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 873,
			"arabicnumber": 873,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم میرے پاس سے نکل کر گئے، آپ کی آنکھیں ٹھنڈی تھیں اور طبیعت خوش، پھر میرے پاس لوٹ کر آئے، تو غمگین اور افسردہ تھے، میں نے آپ سے ( وجہ ) پوچھی، تو آپ نے فرمایا: ”میں کعبہ کے اندر گیا۔ اور میری خواہش ہوئی کہ کاش میں نے ایسا نہ کیا ہوتا۔ میں ڈر رہا ہوں کہ اپنے بعد میں نے اپنی امت کو زحمت میں ڈال دیا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 874,
			"arabicnumber": 874,
			"text": "بلال رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے کعبہ کے اندر نماز پڑھی۔ جب کہ ابن عباس رضی الله عنہما کہتے ہیں: آپ نے نماز نہیں پڑھی بلکہ آپ نے صرف تکبیر کہی۔ امام ترمذی کہتے ہیں: ۱- بلال رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں اسامہ بن زید، فضل بن عباس، عثمان بن طلحہ اور شیبہ بن عثمان رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اکثر اہل علم کا اسی پر عمل ہے۔ وہ کعبہ کے اندر نماز پڑھنے میں کوئی حرج نہیں سمجھتے، ۴- مالک بن انس کہتے ہیں: کعبے میں نفل نماز پڑھنے میں کوئی حرج نہیں، اور انہوں نے کعبہ کے اندر فرض نماز پڑھنے کو مکروہ کہا ہے، ۵- شافعی کہتے ہیں: کعبہ کے اندر فرض اور نفل کوئی بھی نماز پڑھنے میں کوئی حرج نہیں اس لیے کہ نفل اور فرض کا حکم وضو اور قبلے کے بارے میں ایک ہی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 875,
			"arabicnumber": 875,
			"text": "اسود بن یزید سے روایت ہے کہ عبداللہ بن زبیر رضی الله عنہما نے ان سے کہا: تم مجھ سے وہ باتیں بیان کرو، جسے ام المؤمنین یعنی عائشہ رضی الله عنہا تم سے رازدارانہ طور سے بیان کیا کرتی تھیں، انہوں نے کہا: مجھ سے انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: ”اگر تمہاری قوم کے لوگ جاہلیت چھوڑ کر نئے نئے مسلمان نہ ہوئے ہوتے، تو میں کعبہ کو گرا دیتا اور اس میں دو دروازے کر دیتا“، چنانچہ ابن زبیر رضی الله عنہما جب اقتدار میں آئے تو انہوں نے کعبہ گرا کر اس میں دو دروازے کر دیئے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں میں چاہتی تھی کہ بیت اللہ میں داخل ہو کر اس میں نماز پڑھوں، رسول اللہ صلی اللہ علیہ وسلم نے میرا ہاتھ پکڑا اور مجھے حطیم ۱؎ کے اندر کر دیا اور فرمایا: ”اگر تم بیت اللہ کے اندر داخل ہونا چاہتی ہو تو حطیم میں نماز پڑھ لو، یہ بھی بیت اللہ کا ایک حصہ ہے، لیکن تمہاری قوم کے لوگوں نے کعبہ کی تعمیر کے وقت اسے چھوٹا کر دیا، اور اتنے حصہ کو بیت اللہ سے خارج کر دیا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”حجر اسود جنت سے اترا، وہ دودھ سے زیادہ سفید تھا، لیکن اسے بنی آدم کے گناہوں نے کالا کر دیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن عباس کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمر اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”حجر اسود اور مقام ابراہیم دونوں جنت کے یاقوت میں سے دو یاقوت ہیں، اللہ نے ان کا نور ختم کر دیا، اگر اللہ ان کا نور ختم نہ کرتا تو وہ مشرق و مغرب کے سارے مقام کو روشن کر دیتے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- یہ عبداللہ بن عمرو بن العاص رضی الله عنہما سے موقوفاً ان کا قول روایت کیا جاتا ہے، ۳- اس باب میں انس رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ ہمیں رسول اللہ صلی اللہ علیہ وسلم نے منیٰ ۱؎ میں ظہر، عصر، مغرب، عشاء اور فجر پڑھائی ۲؎ پھر آپ صبح ۳؎ ہی عرفات کے لیے روانہ ہو گئے۔ امام ترمذی کہتے ہیں: اسماعیل بن مسلم پر ان کے حافظے کے تعلق سے لوگوں نے کلام کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے منیٰ میں ظہر اور فجر پڑھی ۱؎، پھر آپ صبح ہی صبح ۲؎ عرفات کے لیے روانہ ہو گئے۔ امام ترمذی کہتے ہیں: ۱- مقسم کی حدیث ابن عباس سے مروی ہے، ۲- شعبہ کا بیان ہے کہ حکم نے مقسم سے صرف پانچ چیزیں سنی ہیں، اور انہوں نے انہیں شمار کیا تو یہ حدیث شعبہ کی شمار کی ہوئی حدیثوں میں نہیں تھی، ۳- اس باب میں عبداللہ بن زبیر اور انس سے بھی احادیث آئی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ ہم نے عرض کیا: اللہ کے رسول! کیا ہم آپ کے لیے منی میں ایک گھر نہ بنا دیں جو آپ کو سایہ دے۔ آپ نے فرمایا: ”نہیں ۱؎، منیٰ میں اس کا حق ہے جو وہاں پہلے پہنچے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "حارثہ بن وہب رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ منیٰ میں دو رکعت نماز پڑھی جب کہ لوگ ہمیشہ سے زیادہ مامون اور بےخوف تھے۔ امام ترمذی کہتے ہیں: ۱- حارثہ بن وہب کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن مسعود، ابن عمر اور انس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اور ابن مسعود رضی الله عنہ سے بھی مروی ہے انہوں نے کہا کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ منیٰ میں دو رکعتیں پڑھیں، پھر ابوبکر کے ساتھ، عمر کے ساتھ اور عثمان رضی الله عنہم کے ساتھ ان کے ابتدائی دور خلافت میں دو رکعتیں پڑھیں، ۴- اہل مکہ کے منیٰ میں نماز قصر کرنے کے سلسلے میں اہل علم کے درمیان اختلاف ہے۔ بعض اہل علم کہتے ہیں کہ اہل مکہ کے لیے جائز نہیں کہ وہ منیٰ میں نماز قصر کریں ۱؎، بجز ایسے شخص کے جو منیٰ میں مسافر کی حیثیت سے ہو، یہ ابن جریج، سفیان ثوری، یحییٰ بن سعید قطان، شافعی، احمد اور اسحاق بن راہویہ کا قول ہے۔ بعض کہتے ہیں کہ اہل مکہ کے لیے منیٰ میں نماز قصر کرنے میں کوئی حرج نہیں۔ یہ اوزاعی، مالک، سفیان بن عیینہ، اور عبدالرحمٰن بن مہدی کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "یزید بن شیبان کہتے ہیں ہمارے پاس یزید بن مربع انصاری رضی الله عنہ آئے، ہم لوگ موقف ( عرفات ) میں ایسی جگہ ٹھہرے ہوئے تھے جسے عمرو بن عبداللہ امام سے دور سمجھتے تھے ۱؎ تو یزید بن مربع نے کہا: میں تمہاری طرف رسول اللہ صلی اللہ علیہ وسلم کا بھیجا ہوا قاصد ہوں، تم لوگ مشاعر ۲؎ پر ٹھہرو کیونکہ تم ابراہیم کے وارث ہو۔ امام ترمذی کہتے ہیں: ۱- یزید بن مربع انصاری کی حدیث حسن صحیح ہے، ۲- اسے ہم صرف ابن عیینہ کے طریق سے جانتے ہیں، اور ابن عیینہ عمرو بن دینار سے روایت کرتے ہیں، ۳- ابن مربع کا نام یزید بن مربع انصاری ہے، ان کی صرف یہی ایک حدیث جانی جاتی ہے، ۴- اس باب میں علی، عائشہ، جبیر بن مطعم، شرید بن سوید ثقفی رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں قریش اور ان کے ہم مذہب لوگ – اور یہ «حمس» ۱؎ کہلاتے ہیں – مزدلفہ میں وقوف کرتے تھے اور کہتے تھے: ہم تو اللہ کے خادم ہیں۔ ( عرفات نہیں جاتے ) ، اور جوان کے علاوہ لوگ تھے وہ عرفہ میں وقوف کرتے تھے تو اللہ نے آیت کریمہ «ثم أفيضوا من حيث أفاض الناس» ”اور تم بھی وہاں سے لوٹو جہاں سے لوگ لوٹتے ہیں“ ( البقرہ: ۱۹۹ ) نازل فرمائی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس حدیث کے معنی یہ ہیں کہ اہل مکہ حرم سے باہر نہیں جاتے تھے اور عرفہ حرم سے باہر ہے۔ اہل مکہ مزدلفہ ہی میں وقوف کرتے تھے اور کہتے تھے: ہم اللہ کے آباد کئے ہوئے لوگ ہیں۔ اور اہل مکہ کے علاوہ لوگ عرفات میں وقوف کرتے تھے تو اللہ نے حکم نازل فرمایا: «ثم أفيضوا من حيث أفاض الناس» ”تم بھی وہاں سے لوٹو جہاں سے لوگ لوٹتے ہیں“ «حمس» سے مراد اہل حرم ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے عرفات میں قیام کیا اور فرمایا: ”یہ عرفہ ہے، یہی وقوف ( ٹھہرنے ) کی جگہ ہے، عرفہ ( عرفات ) کا پورا ٹھہرنے کی جگہ ہے، پھر آپ جس وقت سورج ڈوب گیا تو وہاں سے لوٹے۔ اسامہ بن زید کو پیچھے بٹھایا، اور آپ اپنی عام رفتار سے چلتے ہوئے اپنے ہاتھ سے اشارہ کر رہے تھے، اور لوگ دائیں بائیں اپنے اونٹوں کو مار رہے تھے، آپ ان کی طرف متوجہ ہو کر کہتے جاتے تھے: ”لوگو! سکون و وقار کو لازم پکڑو“، پھر آپ مزدلفہ آئے اور لوگوں کو دونوں نمازیں ( مغرب اور عشاء قصر کر کے ) ایک ساتھ پڑھائیں، جب صبح ہوئی تو آپ قزح ۱؎ آ کر ٹھہرے، اور فرمایا: ”یہ قزح ہے اور یہ بھی موقف ہے اور مزدلفہ پورا کا پورا موقف ہے“، پھر آپ لوٹے یہاں تک کہ آپ وادی محسر ۲؎ پہنچے اور آپ نے اپنی اونٹنی کو مارا تو وہ دوڑی یہاں تک کہ اس نے وادی پار کر لی، پھر آپ نے وقوف کیا۔ اور فضل بن عباس رضی الله عنہما کو ( اونٹنی پر ) پیچھے بٹھایا، پھر آپ جمرہ آئے اور رمی کی، پھر منحر ( قربانی کی جگہ ) آئے اور فرمایا: ”یہ منحر ہے، اور منیٰ پورا کا پورا منحر ( قربانی کرنے کی جگہ ) ہے“، قبیلہ خثعم کی ایک نوجوان عورت نے آپ سے مسئلہ پوچھا، اس نے عرض کیا: میرے والد بوڑھے ہو چکے ہیں اور ان پر اللہ کا فریضہ حج واجب ہو چکا ہے۔ کیا میں ان کی طرف سے حج کر لوں تو کافی ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”ہاں، اپنے باپ کی طرف سے حج کر لے“۔ علی رضی الله عنہ کہتے ہیں: آپ صلی اللہ علیہ وسلم نے فضل کی گردن موڑ دی، اس پر آپ سے، عباس رضی الله عنہ نے پوچھا: اللہ کے رسول! آپ نے اپنے چچا زاد بھائی کی گردن کیوں پلٹ دی؟ تو آپ نے فرمایا: ”میں نے دیکھا کہ لڑکا اور لڑکی دونوں جوان ہیں تو میں ان دونوں کے سلسلہ میں شیطان سے مامون نہیں رہا“ ۳؎، پھر ایک شخص نے آپ کے پاس آ کر کہا: اللہ کے رسول! میں نے سر منڈانے سے پہلے طواف افاضہ کر لیا۔ آپ نے فرمایا: ”سر منڈوا لو یا بال کتروا لو کوئی حرج نہیں ہے“۔ پھر ایک دوسرے شخص نے آ کر کہا: اللہ کے رسول! میں نے رمی کرنے سے پہلے قربانی کر لی، آپ نے فرمایا: ”رمی کر لو کوئی حرج نہیں“ ۴؎ پھر آپ بیت اللہ آئے اور اس کا طواف کیا، پھر زمزم پر آئے، اور فرمایا: ”بنی عبدالمطلب! اگر یہ اندیشہ نہ ہوتا کہ لوگ تمہیں مغلوب کر دیں گے تو میں بھی ( تمہارے ساتھ ) پانی کھینچتا“۔ ( اور لوگوں کو پلاتے ) امام ترمذی کہتے ہیں: ۱- علی رضی الله عنہ کی حدیث حسن صحیح ہے۔ ہم اسے علی کی روایت سے صرف اسی طریق سے جانتے ہیں۔ یعنی عبدالرحمٰن بن حارث بن عیاش کی سند سے، اور دیگر کئی لوگوں نے بھی ثوری سے اسی کے مثل روایت کی ہے، ۲- اس باب میں جابر رضی الله عنہ سے بھی روایت ہے، ۳- اہل علم کا اسی پر عمل ہے، ان کا خیال ہے کہ عرفہ میں ظہر کے وقت ظہر اور عصر کو ملا کر ایک ساتھ پڑھے، ۴- اور بعض اہل علم کہتے ہیں: جب آدمی اپنے ڈیرے ( خیمے ) میں نماز پڑھے اور امام کے ساتھ نماز میں شریک نہ ہو تو چاہے دونوں نمازوں کو ایک ساتھ جمع اور قصر کر کے پڑھ لے، جیسا کہ امام نے کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم وادی محسر میں تیز چال چلے۔ ( بشر کی روایت میں یہ اضافہ ہے کہ ) آپ مزدلفہ سے لوٹے، آپ پرسکون یعنی عام رفتار سے چل رہے تھے، لوگوں کو بھی آپ نے سکون و اطمینان سے چلنے کا حکم دیا۔ ( اور ابونعیم کی روایت میں اتنا اضافہ ہے کہ ) آپ نے انہیں ایسی کنکریوں سے رمی کرنے کا حکم دیا جو دو انگلیوں میں پکڑی جا سکیں، اور فرمایا: ”شاید میں اس سال کے بعد تمہیں نہ دیکھ سکوں“۔ امام ترمذی کہتے ہیں: ۱- جابر کی حدیث حسن صحیح ہے، ۲- اس باب میں اسامہ بن زید رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "عبداللہ بن مالک کہتے ہیں کہ ابن عمر رضی الله عنہما نے مزدلفہ میں نماز پڑھی اور ایک اقامت سے مغرب اور عشاء کی دونوں نمازیں ایک ساتھ ملا کر پڑھیں اور کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس جگہ پر ایسے ہی کرتے دیکھا ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "اس سند سے بھی ابن عمر رضی الله عنہما نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مثل روایت کرتے ہیں۔ محمد بن بشار نے ( «حدثنا» کے بجائے ) «قال یحییٰ» کہا ہے۔ اور صحیح سفیان والی روایت ہے۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث جسے سفیان نے روایت کی ہے اسماعیل بن ابی خالد کی روایت سے زیادہ صحیح ہے، اور سفیان کی حدیث صحیح حسن ہے، ۲- اسرائیل نے یہ حدیث ابواسحاق سبیعی سے روایت کی ہے اور ابواسحاق سبیعی نے مالک کے دونوں بیٹوں عبداللہ اور خالد سے اور عبداللہ اور خالد نے ابن عمر سے روایت کی ہے۔ اور سعید بن جبیر کی حدیث جسے انہوں نے ابن عمر رضی الله عنہما سے روایت کی ہے حسن صحیح ہے، سلمہ بن کہیل نے اسے سعید بن جبیر سے روایت کی ہے، رہے ابواسحاق سبیعی تو انہوں نے اسے مالک کے دونوں بیٹوں عبداللہ اور خالد سے اور ان دونوں نے ابن عمر سے روایت کی ہے، ۳- اس باب میں علی، ابوایوب، عبداللہ بن سعید، جابر اور اسامہ بن زید رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- اہل علم کا اسی پر عمل ہے۔ اس لیے کہ مغرب مزدلفہ آنے سے پہلے نہیں پڑھی جائے گی، جب حجاج جمع ۱؎ یعنی مزدلفہ جائیں تو دونوں نمازیں ایک اقامت سے اکٹھی پڑھیں اور ان کے درمیان کوئی نفل نماز نہیں پڑھیں گے۔ یہی مسلک ہے جسے بعض اہل علم نے اختیار کیا ہے اور اس کی طرف گئے ہیں اور یہی سفیان ثوری کا بھی قول ہے۔ ان کا کہنا ہے کہ اگر وہ چاہے تو مغرب پڑھے پھر شام کا کھانا کھائے، اور اپنے کپڑے اتارے پھر تکبیر کہے اور عشاء پڑھے، ۴- اور بعض اہل علم کہتے ہیں کہ مغرب اور عشاء کو مزدلفہ میں ایک اذان اور دو اقامت کے ساتھ جمع کرے۔ مغرب کے لیے اذان کہے اور تکبیر کہے اور مغرب پڑھے، پھر تکبیر کہے اور عشاء پڑھے یہ شافعی کا قول ہے۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "عبدالرحمٰن بن یعمر رضی الله عنہ کہتے ہیں کہ نجد کے کچھ لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، اس وقت آپ عرفہ میں تھے۔ انہوں نے آپ سے حج کے متعلق پوچھا تو آپ نے منادی کو حکم دیا تو اس نے اعلان کیا: حج عرفات میں ٹھہرنا ہے ۱؎ جو کوئی مزدلفہ کی رات کو طلوع فجر سے پہلے عرفہ آ جائے، اس نے حج کو پا لیا ۲؎ منی کے تین دن ہیں، جو جلدی کرے اور دو دن ہی میں چلا جائے تو اس پر کوئی گناہ نہیں اور جو دیر کرے تیسرے دن جائے تو اس پر بھی کوئی گناہ نہیں۔ ( یحییٰ کی روایت میں اتنا اضافہ ہے کہ ) آپ نے ایک شخص کو پیچھے بٹھایا اور اس نے آواز لگائی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "۸۹۰- ابن ابی عمر نے بسند سفیان بن عیینہ عن سفیان الثوری عن بکیر بن عطاء عن عبدالرحمٰن بن یعمر عن النبی کریم صلی اللہ علیہ وسلم اسی طرح اسی معنی کی حدیث روایت کی ہے۔ ابن ابی عمر کہتے ہیں: قال سفیان بن عیینہ، اور یہ سب سے اچھی حدیث ہے جسے سفیان ثوری نے روا ابن ابی عمر نے بسند «سفيان الثوري عن بكير بن عطاء عن عبدالرحمٰن بن يعمر عن النبي صلى الله عليه وسلم» اسی طرح اسی معنی کی حدیث روایت کی ہے۔ ابن ابی عمر کہتے ہیں: «قال سفيان بن عيينة»،‏‏‏‏ اور یہ سب سے اچھی حدیث ہے جسے سفیان ثوری نے روایت کی ہے۔ امام ترمذی کہتے ہیں: ۱- شعبہ نے بھی بکیر بن عطا سے ثوری ہی کی طرح روایت کی ہے، ۲- وکیع نے اس حدیث کا ذکر کیا تو کہا کہ یہ حدیث حج کے سلسلہ میں ”ام المناسک“ کی حیثیت رکھتی ہے، ۳- صحابہ کرام میں سے اہل علم کا عمل عبدالرحمٰن بن یعمر کی حدیث پر ہے کہ ”جو طلوع فجر سے پہلے عرفات میں نہیں ٹھہرا، اس کا حج فوت ہو گیا، اور اگر وہ طلوع فجر کے بعد آئے تو یہ اسے کافی نہیں ہو گا۔ اسے عمرہ بنا لے اور اگلے سال حج کرے“، یہ ثوری، شافعی، احمد اور اسحاق بن راہویہ کا قول ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "عروہ بن مضرس بن اوس بن حارثہ بن لام الطائی رضی الله عنہ کہتے ہیں: میں رسول اللہ صلی اللہ علیہ وسلم کے پاس مزدلفہ آیا، جس وقت آپ نماز کے لیے نکلے تو میں نے آپ سے عرض کیا: اللہ کے رسول! میں قبیلہ طی کے دونوں پہاڑوں سے ہوتا ہوا آیا ہوں، میں نے اپنی سواری کو اور خود اپنے کو خوب تھکا دیا ہے، اللہ کی قسم! میں نے کوئی پہاڑ نہیں چھوڑا جہاں میں نے ( یہ سوچ کر کہ عرفات کا ٹیلہ ہے ) وقوف نہ کیا ہو تو کیا میرا حج ہو گیا؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو بھی ہماری اس نماز میں حاضر رہا اور اس نے ہمارے ساتھ قیام کیا یہاں تک کہ ہم یہاں سے روانہ ہوں اور وہ اس سے پہلے دن یا رات میں عرفہ میں وقوف کر چکا ہو ۱؎ تو اس نے اپنا حج پورا کر لیا، اور اپنا میل کچیل ختم کر لیا“ ۲؎۔ امام ترمذی کہتے ہیں: ۱ – یہ حدیث حسن صحیح ہے، ۲- «تَفَثَهُ» کے معنی «نسكه» کے ہیں یعنی مناسک حج کے ہیں۔ اور اس کے قول: «ما تركت من حبل إلا وقفت عليه» ”کوئی ٹیلہ ایسا نہ تھا جہاں میں نے وقوف نہ کیا ہو“ کے سلسلے میں یہ ہے کہ جب ریت کا ٹیلہ ہو تو اسے حبل اور جب پتھر کا ہو تو اسے جبل کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم دسویں ذی الحجہ کو ( ٹھنڈی ) چاشت کے وقت رمی کرتے تھے اور اس کے بعد زوال کے بعد کرتے ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اکثر اہل علم کا اسی حدیث پر عمل ہے کہ وہ دسویں ذی الحجہ کے زوال بعد کے بعد ہی رمی کرے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ( مزدلفہ سے ) سورج نکلنے سے پہلے لوٹے۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر رضی الله عنہ سے بھی روایت ہے، ۳- جاہلیت کے زمانے میں لوگ انتظار کرتے یہاں تک کہ سورج نکل آتا پھر لوٹتے تھے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 896,
			"arabicnumber": 896,
			"text": "عمرو بن میمون بیان کرتے ہیں کہ ہم لوگ مزدلفہ میں ٹھہرے ہوئے تھے، عمر بن خطاب رضی الله عنہ نے کہا: مشرکین جب تک کہ سورج نکل نہیں آتا نہیں لوٹتے تھے اور کہتے تھے: ثبیر! تو روشن ہو جا ( تب ہم لوٹیں گے ) ، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کی مخالفت کی، چنانچہ عمر رضی الله عنہ سورج نکلنے سے پہلے لوٹے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"text": "جابر رضی الله عنہ کہتے ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ ایسی کنکریوں سے رمی جمار کر رہے تھے جو انگوٹھے اور شہادت والی انگلی کے درمیان پکڑی جا سکتی تھیں ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں سلیمان بن عمرو بن احوص ( جو اپنی ماں ام جندب ازدیہ سے روایت کرتے ہیں ) ، ابن عباس، فضل بن عباس، عبدالرحمٰن بن عثمان تمیمی اور عبدالرحمٰن بن معاذ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اور اسی کو اہل علم نے اختیار کیا ہے کہ کنکریاں جن سے رمی کی جاتی ہے ایسی ہوں جو انگوٹھے اور شہادت کی انگلی سے پکڑی جا سکیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رمی جمار اس وقت کرتے جب سورج ڈھل جاتا ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے دسویں ذی الحجہ کو جمرہ کی رمی سواری پر کی۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن ہے، ۲- اس باب میں جابر، قدامہ بن عبداللہ، اور سلیمان بن عمرو بن احوص کی ماں ( رضی الله عنہم ) سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے، ۴- بعض نے یہ پسند کیا ہے کہ وہ جمرات تک پیدل چل کر جائیں، ۵- ابن عمر سے مروی ہے، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ جمرات تک پیدل چل کر جاتے، ۶- ہمارے نزدیک اس حدیث کی توجیہ یہ ہے کہ آپ نے کبھی کبھار سواری پر رمی اس لیے کی تاکہ آپ کے اس فعل کی بھی لوگ پیروی کریں۔ اور دونوں ہی حدیثوں پر اہل علم کا عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب رمی جمار کرتے، تو جمرات تک پیدل آتے جاتے تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- بعض لوگوں نے اسے عبیداللہ ( العمری ) سے روایت کیا ہے، لیکن انہوں نے اسے مرفوع نہیں کیا ہے، ۳- اکثر اہل علم کا اسی پر عمل ہے، ۴- بعض لوگ کہتے ہیں کہ دسویں ذی الحجہ کو سوار ہو سکتا ہے، اور دسویں کے بعد باقی دنوں میں پیدل جائے گا۔ گویا جس نے یہ کہا ہے اس کے پیش نظر صرف نبی اکرم صلی اللہ علیہ وسلم کے اس فعل کی اتباع ہے۔ اس لیے کہ نبی اکرم صلی اللہ علیہ وسلم سے یہ بھی مروی ہے کہ آپ دسویں ذی الحجہ کو سوار ہوئے جب آپ رمی جمار کرنے گئے۔ اور دسویں ذی الحجہ کو صرف جمرہ عقبہ ہی کی رمی کرے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "عبدالرحمٰن بن یزید کہتے ہیں کہ جب عبداللہ ( عبداللہ بن مسعود ) جمرہ عقبہ کے پاس آئے تو وادی کے بیچ میں کھڑے ہوئے اور قبلہ رخ ہو کر اپنے داہنے ابرو کے مقابل رمی شروع کی۔ پھر سات کنکریوں سے رمی کی۔ ہر کنکری پر وہ ”اللہ اکبر“ کہتے تھے، پھر انہوں نے کہا: اللہ کی قسم جس کے سوا کوئی معبود برحق نہیں، اس ذات نے بھی یہیں سے رمی کی جس پر سورۃ البقرہ نازل کی گئی ہے۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں فضل بن عباس، ابن عباس، ابن عمر اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے، ان کے نزدیک پسندیدہ یہی ہے کہ آدمی بطن وادی میں کھڑے ہو کر سات کنکریوں سے رمی کرے اور ہر کنکری پر ”اللہ اکبر“ کہے، ۴- اور بعض اہل علم نے اجازت دی ہے کہ اگر بطن وادی سے رمی کرنا ممکن نہ ہو تو ایسی جگہ سے کرے جہاں سے وہ اس پر قادر ہو گو وہ بطن وادی میں نہ ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جمرات کی رمی اور صفا و مروہ کی سعی اللہ کے ذکر کو قائم کرنے کے لیے شروع کی گئی ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "قدامہ بن عبداللہ رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو دیکھا آپ ایک اونٹنی پر جمرات کی رمی کر رہے تھے، نہ لوگوں کو دھکیلنے اور ہانکنے کی آواز تھی اور نہ ہٹو ہٹو کی ۱؎۔ امام ترمذی کہتے ہیں: ۱- قدامہ بن عبداللہ کی حدیث حسن صحیح ہے، ۲- یہ حدیث اسی طریق سے جانی جاتی ہے، یہ ایمن بن نابل کی حدیث ہے۔ اور ایمن اہل حدیث ( محدثین ) کے نزدیک ثقہ ہیں، ۳- اس باب میں عبداللہ بن حنظلہ رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ حدیبیہ کے سال ہم نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ گائے اور اونٹ کو سات سات آدمیوں کی جانب سے نحر ( ذبح ) کیا۔ امام ترمذی کہتے ہیں: ۱- جابر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر، ابوہریرہ، عائشہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اور صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں کہ اونٹ سات لوگوں کی طرف سے اور گائے سات لوگوں کی طرف سے ہو گی۔ اور یہی سفیان ثوری، شافعی اور احمد کا قول ہے، ۴- ابن عباس رضی الله عنہما نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ گائے سات لوگوں کی طرف سے اور اونٹ دس لوگوں کی طرف سے کافی ہو گا ۱؎۔ یہ اسحاق بن راہویہ کا قول ہے۔ اور انہوں نے اسی حدیث سے دلیل لی ہے۔ ابن عباس کی حدیث کو ہم صرف ایک ہی طریق سے جانتے ہیں ( ملاحظہ ہو آنے والی حدیث: ۹۰۵)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ ہم ایک سفر میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ تھے کہ عید الاضحی کا دن آ گیا، چنانچہ گائے میں ہم سات سات لوگ اور اونٹ میں دس دس لوگ شریک ہوئے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے، اور یہ حسین بن واقد کی حدیث ( روایت ) ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ اکرم صلی اللہ علیہ وسلم نے ذو الحلیفہ میں ( ہدی کے جانور کو ) دو جوتیوں کے ہار پہنائے اور ان کی کوہان کے دائیں طرف اشعار ۱؎ کیا اور اس سے خون صاف کیا۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- صحابہ کرام رضی الله عنہم وغیرہم میں سے اہل علم کا اسی پر عمل ہے، وہ اشعار کے قائل ہیں۔ یہی ثوری، شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۳- یوسف بن عیسیٰ کہتے ہیں کہ میں نے وکیع کو کہتے سنا جس وقت انہوں نے یہ حدیث روایت کی کہ اس سلسلے میں اہل رائے کے قول کو نہ دیکھو، کیونکہ اشعار سنت ہے اور ان کا قول بدعت ہے، ۴- میں نے ابوسائب کو کہتے سنا کہ ہم لوگ وکیع کے پاس تھے تو انہوں نے اپنے پاس کے ایک شخص سے جو ان لوگوں میں سے تھا جو رائے میں غور و فکر کرتے ہیں کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے اشعار کیا ہے، اور ابوحنیفہ کہتے ہیں کہ وہ مثلہ ہے تو اس آدمی نے کہا: ابراہیم نخعی سے مروی ہے انہوں نے بھی کہا ہے کہ اشعار مثلہ ہے، ابوسائب کہتے ہیں: تو میں نے وکیع کو دیکھا کہ ( اس کی اس بات سے ) وہ سخت ناراض ہوئے اور کہا: میں تم سے کہتا ہوں کہ ”رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے“ اور تم کہتے ہو: ابراہیم نے کہا: تم تو اس لائق ہو کہ تمہیں قید کر دیا جائے پھر اس وقت تک قید سے تمہیں نہ نکالا جائے جب تک کہ تم اپنے اس قول سے باز نہ آ جاؤ ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنا ہدی کا جانور قدید سے خریدا۔ امام ترمذی کہتے ہیں: یہ حدیث غریب ہے، ہم اسے ثوری کی حدیث سے صرف یحییٰ بن یمان ہی کی روایت سے جانتے ہیں: اور نافع سے مروی ہے کہ ابن عمر نے قدید ۱؎ سے خریدا، اور یہ زیادہ صحیح ہے ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی ہدی کے قلادے بٹے، پھر آپ نہ محرم ہوئے اور نہ ہی آپ نے کوئی کپڑا پہننا چھوڑا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- بعض اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں کہ جب آدمی ہدی ( کے جانور ) کو قلادہ پہنا دے اور وہ حج کا ارادہ رکھتا ہو تو اس پر کپڑا پہننا یا خوشبو لگانا حرام نہیں ہوتا جب تک کہ وہ احرام نہ باندھ لے، ۳- اور بعض اہل علم کا کہنا ہے کہ جب آدمی اپنے ہدی ( کے جانور ) کو قلادہ پہنا دے تو اس پر وہ سب واجب ہو جاتا ہے جو ایک محرم پر واجب ہوتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی ہدی کی بکریوں کے سارے قلادے ( پٹے ) میں ہی بٹتی تھی ۱؎ پھر آپ احرام نہ باندھتے ( حلال ہی رہتے تھے ) ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہ میں سے بعض اہل علم کے نزدیک اسی پر عمل ہے، وہ بکریوں کے قلادہ پہنانے کے قائل ہیں۔",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "رسول اللہ صلی اللہ علیہ وسلم کے اونٹوں کی دیکھ بھال کرنے والے ناجیہ خزاعی رضی الله عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! جو اونٹ راستے میں مرنے لگیں انہیں میں کیا کروں؟ آپ نے فرمایا: ”انہیں نحر ( ذبح ) کر دو، پھر ان کی جوتی انہیں کے خون میں لت پت کر دو، پھر انہیں لوگوں کے لیے چھوڑ دو کہ وہ ان کا گوشت کھائیں“۔ امام ترمذی کہتے ہیں: ۱- ناجیہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ذویب ابو قبیصہ خزاعی رضی الله عنہ سے بھی روایت ہے، ۳- اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں کہ نفلی ہدی کا جانور جب مرنے لگے تو نہ وہ خود اسے کھائے اور نہ اس کے سفر کے ساتھی کھائیں۔ وہ اسے لوگوں کے لیے چھوڑ دے، کہ وہ اسے کھائیں۔ یہی اس کے لیے کافی ہے۔ یہ شافعی، احمد اور اسحاق بن راہویہ کا قول ہے۔ یہ لوگ کہتے ہیں کہ اگر اس نے اس میں سے کچھ کھا لیا تو جتنا اس نے اس میں سے کھایا ہے اسی کے بقدر وہ تاوان دے، ۴- بعض اہل علم کہتے ہیں کہ جب وہ نفلی ہدی کے جانور میں سے کچھ کھا لے تو جس نے کھایا وہ اس کا ضامن ہو گا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "انس رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص کو ہدی کے اونٹ ہانکتے دیکھا، تو اسے حکم دیا ”اس پر سوار ہو جاؤ“، اس نے عرض کیا: اللہ کے رسول! یہ ہدی کا اونٹ ہے، پھر آپ نے اس سے تیسری یا چوتھی بار میں کہا: ”اس پر سوار ہو جاؤ، تمہارا برا ہو ۱؎ یا تمہاری ہلاکت ہو“۔ امام ترمذی کہتے ہیں: ۱- انس رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، ابوہریرہ، اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہ میں سے اہل علم کی ایک جماعت نے ہدی کے جانور پر سوار ہونے کی اجازت دی ہے، جب کہ وہ اس کا محتاج ہو، یہی شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۴- بعض کہتے ہیں: جب تک مجبور نہ ہو ہدی کے جانور پر سوار نہ ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں جب نبی اکرم صلی اللہ علیہ وسلم نے جمرہ کی رمی کر لی تو اپنے ہدی کے اونٹ نحر ( ذبح ) کیے۔ پھر سر مونڈنے والے کو اپنے سر کا داہنا جانب ۱؎ دیا اور اس نے سر مونڈا، تو یہ بال آپ نے ابوطلحہ کو دئیے، پھر اپنا بایاں جانب اسے دیا تو اس نے اسے بھی مونڈا تو آپ نے فرمایا: ”یہ بال لوگوں میں تقسیم کر دو“ ۲؎۔ ابن ابی عمر کی سند سے ہشام سے اسی طرح حدیث روایت ہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سر منڈوایا، صحابہ کی ایک جماعت نے بھی سر مونڈوایا اور بعض لوگوں نے بال کتروائے۔ ابن عمر کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک بار یا دو بار فرمایا: ”اللہ سر مونڈانے والوں پر رحم فرمائے“، پھر فرمایا: ”کتروانے والوں پر بھی“ ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "علی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اس بات سے منع فرمایا ہے کہ عورت اپنا سر مونڈوائے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "اس سند سے بھی خلاس سے اسی طرح مروی ہے، لیکن اس میں انہوں نے علی رضی الله عنہ کے واسطے کا ذکر نہیں کیا ہے۔ امام ترمذی کہتے ہیں: ۱- علی رضی الله عنہ کی حدیث میں اضطراب ہے، یہ حدیث حماد بن سلمہ سے بطریق: «قتادة عن عائشة أن النبي صلى الله عليه وسلم» مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے عورت کو اپنا سر مونڈانے سے منع فرمایا، ۲- اہل علم کا اسی پر عمل ہے، وہ عورت کے لیے سر منڈانے کو درست نہیں سمجھتے ان کا خیال ہے کہ اس پر تقصیر ( بال کتروانا ) ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "عبداللہ بن عمرو رضی الله عنہما سے روایت ہے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ میں نے ذبح کرنے سے پہلے سر منڈا لیا؟ آپ نے فرمایا: ”اب ذبح کر لو کوئی حرج نہیں“ ایک دوسرے نے پوچھا: میں نے رمی سے پہلے نحر ( ذبح ) کر لیا ہے؟ آپ نے فرمایا: ”اب رمی کر لو کوئی حرج نہیں“۔ امام ترمذی کہتے ہیں: ۱- عبداللہ بن عمرو رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، جابر، ابن عباس، ابن عمر، اسامہ بن شریک رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اکثر اہل علم کا اسی پر عمل ہے۔ یہی احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۴- بعض اہل علم کہتے ہیں: اگر کسی نسک کو یعنی رمی یا نحر یا حلق وغیرہ میں سے کسی ایک کو دوسرے سے پہلے کر لے تو اس پر دم ( ذبیحہ ) لازم ہو گا ( مگر یہ بات بغیر دلیل کے ہے ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم کو آپ کے احرام باندھنے سے پہلے اور دسویں ذی الحجہ کو بیت اللہ کا طواف کرنے سے پہلے خوشبو لگائی جس میں مشک تھی ۱؎۔ امام ترمذی کہتے ہیں: ۱- عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے، ۳- صحابہ کرام وغیرہم میں سے اکثر اہل علم کا اسی پر عمل ہے کہ محرم جب دسویں ذی الحجہ کو جمرہ عقبہ کی رمی کر لے، جانور ذبح کر لے، اور سر مونڈا لے یا بال کتروا لے تو اب اس کے لیے ہر وہ چیز حلال ہو گئی جو اس پر حرام تھی سوائے عورتوں کے۔ یہی شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۴- عمر بن خطاب رضی الله عنہ سے مروی ہے کہ اس کے لیے ہر چیز حلال ہو گئی سوائے عورتوں اور خوشبو کے، ۵- صحابہ کرام وغیرہم میں سے بعض اہل علم اسی حدیث کی طرف گئے ہیں، اور یہی کوفہ والوں کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "فضل بن عباس رضی الله عنہما کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے مجھے مزدلفہ سے منیٰ تک اپنا ردیف بنایا ( یعنی آپ مجھے اپنے پیچھے سواری پر بٹھا کر لے گئے ) آپ برابر تلبیہ کہتے رہے یہاں تک کہ آپ نے جمرہ ( عقبہ ) کی رمی کی۔ امام ترمذی کہتے ہیں: ۱- فضل رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، ابن مسعود، اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اور صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے کہ حاجی تلبیہ بند نہ کرے جب تک کہ جمرہ کی رمی نہ کر لے۔ یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "عبداللہ بن عباس رضی الله عنہما سے مرفوعاً روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم عمرہ میں تلبیہ پکارنا اس وقت بند کرتے جب حجر اسود کا استلام کر لیتے۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو رضی الله عنہما سے بھی روایت ہے، ۳- اکثر اہل علم کا اسی پر عمل ہے، وہ کہتے ہیں کہ عمرہ کرنے والا شخص تلبیہ بند نہ کرے جب تک کہ حجر اسود کا استلام نہ کر لے، ۴- بعض کہتے ہیں کہ جب مکے کے گھروں یعنی مکہ کی آبادی میں پہنچ جائے تو تلبیہ پکارنا بند کر دے۔ لیکن عمل نبی اکرم صلی اللہ علیہ وسلم کی ( مذکورہ ) حدیث پر ہے۔ یہی سفیان، شافعی، احمد اور اسحاق بن راہویہ بھی کہتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "عبداللہ بن عباس رضی الله عنہما اور ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے طواف زیارت کو رات تک مؤخر کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے ۲؎، ۲- بعض اہل علم نے طواف زیارت کو رات تک مؤخر کرنے کی اجازت دی ہے۔ اور بعض نے دسویں ذی الحجہ کو طواف زیارت کرنے کو مستحب قرار دیا ہے، لیکن بعض نے اُسے منیٰ کے آخری دن تک مؤخر کرنے کی گنجائش رکھی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم ، ابوبکر، عمر، اور عثمان رضی الله عنہم ابطح ۱؎ میں قیام کرتے تھے۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث حسن صحیح غریب ہے۔ ہم اسے صرف عبدالرزاق کی سند سے جانتے ہیں، وہ عبیداللہ بن عمر سے روایت کرتے ہیں، ۲- اس باب میں عائشہ، ابورافع اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم نے ابطح میں قیام کو مستحب قرار دیا ہے، واجب نہیں، جو چاہے وہاں قیام کرے، ۴- شافعی کہتے ہیں: ابطح کا قیام حج کے مناسک میں سے نہیں ہے۔ یہ تو بس ایک مقام ہے جہاں نبی اکرم صلی اللہ علیہ وسلم نے قیام فرمایا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ وادی محصب میں قیام کوئی چیز نہیں ۱؎، یہ تو بس ایک جگہ ہے جہاں رسول اللہ صلی اللہ علیہ وسلم نے قیام فرمایا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- «تحصیب» کے معنی ابطح میں قیام کرنے کے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ کہ رسول اللہ صلی اللہ علیہ وسلم نے ابطح میں قیام فرمایا اس لیے کہ یہاں سے ( مدینے کے لیے ) روانہ ہونا زیادہ آسان تھا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔ ہم سے ابن ابی عمر نے بیان کیا، وہ کہتے ہیں کہ ہم سے سفیان نے بیان کیا اور سفیان نے ہشام بن عروہ سے اسی طرح کی حدیث روایت کی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ ایک عورت نے اپنے بچے کو رسول اللہ صلی اللہ علیہ وسلم کی طرف اٹھا کر پوچھا: اللہ کے رسول! کیا اس پر بھی حج ہے؟ آپ نے فرمایا: ”ہاں، اور اجر تجھے ملے گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- جابر کی حدیث غریب ہے، ۲- اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 927,
			"arabicnumber": 927,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ جب ہم نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ حج کیا تو ہم عورتوں کی طرف سے تلبیہ کہتے اور بچوں کی طرف سے رمی کرتے تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے صرف اسی طریق سے جانتے ہیں، ۲- اہل علم کا اس بات پر اتفاق ہے کہ عورت کی طرف سے کوئی دوسرا تلبیہ نہیں کہے گا، بلکہ وہ خود ہی تلبیہ کہے گی البتہ اس کے لیے تلبیہ میں آواز بلند کرنا مکروہ ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "فضل بن عباس رضی الله عنہما کہتے ہیں کہ قبیلہ خثعم کی ایک عورت نے عرض کیا: اللہ کے رسول! میرے والد کو اللہ کے فریضہ حج نے پا لیا ہے لیکن وہ اتنے بوڑھے ہیں کہ اونٹ کی پیٹھ پر بیٹھ نہیں سکتے ( تو کیا کیا جائے؟ ) ۔ آپ نے فرمایا: ”تو ان کی طرف سے حج کر لے“۔ امام ترمذی کہتے ہیں: ۱- فضل بن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- ابن عباس رضی الله عنہما سے حصین بن عوف مزنی رضی الله عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، ۳- ابن عباس رضی الله عنہما سے مروی ہے کہ سنان بن عبداللہ جہنی رضی الله عنہ نے اپنی پھوپھی سے اور ان کی پھوپھی نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، ۴- ابن عباس رضی الله عنہما نے براہ راست نبی اکرم صلی اللہ علیہ وسلم سے بھی روایت کی ہے، ۵- امام ترمذی کہتے ہیں: میں نے ان روایات کے بارے میں محمد بن اسماعیل بخاری سے پوچھا تو انہوں نے کہا: اس باب میں سب سے صحیح روایت وہ ہے جسے ابن عباس نے فضل بن عباس سے اور فضل نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے ۶- محمد بن اسماعیل بخاری کہتے ہیں کہ اس کا بھی احتمال ہے کہ ابن عباس نے اسے ( اپنے بھائی ) فضل سے اور ان کے علاوہ دوسرے لوگوں سے بھی سنا ہو اور ان لوگوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہو، اور پھر ابن عباس رضی الله عنہما نے اسے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کی ہو اور جس سے انہوں نے اسے سنا ہو اس کا نام ذکر نہ کیا ہو، نبی اکرم صلی اللہ علیہ وسلم سے اس باب میں کئی اور بھی احادیث ہیں، ۷- اس باب میں علی، بریدہ، حصین بن عوف، ابورزین عقیلی، سودہ بنت زمعہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۸- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے، اور یہی ثوری، ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ بھی کہتے ہیں کہ میت کی طرف سے حج کیا جا سکتا ہے، ۹- مالک کہتے ہیں: میت کی طرف سے حج اس وقت کیا جائے گا جب وہ حج کرنے کی وصیت کر گیا ہو، ۱۰- بعض لوگوں نے زندہ شخص کی طرف سے جب وہ بہت زیادہ بوڑھا ہو گیا ہو یا ایسی حالت میں ہو کہ وہ حج پر قدرت نہ رکھتا ہو حج کرنے کی اجازت دی ہے۔ یہی ابن مبارک اور شافعی کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "بریدہ رضی الله عنہ کہتے ہیں کہ ایک عورت نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر عرض کیا: میری ماں مر گئی ہے، وہ حج نہیں کر سکی تھی، کیا میں اس کی طرف سے حج کر لوں؟ آپ نے فرمایا: ”ہاں، تو اس کی طرف سے حج کر لے“۔ امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "ابورزین عقیلی لقیط بن عامر رضی الله عنہ کہتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر عرض کیا: اللہ کے رسول! میرے والد بہت بوڑھے ہیں، وہ حج و عمرہ کرنے اور سوار ہو کر سفر کرنے کی طاقت نہیں رکھتے۔ ( ان کے بارے میں کیا حکم ہے؟ ) آپ نے فرمایا: ”تم اپنے والد کی طرف سے حج اور عمرہ کر لو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- عمرے کا ذکر صرف اسی حدیث میں مذکور ہوا ہے کہ آدمی غیر کی طرف سے عمرہ کر سکتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے عمرے کے بارے میں پوچھا گیا: کیا یہ واجب ہے؟ آپ نے فرمایا: ”نہیں، لیکن عمرہ کرنا بہتر ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور یہی بعض اہل علم کا قول ہے، وہ کہتے ہیں کہ عمرہ واجب نہیں ہے، ۳- اور یہ بھی کہا جاتا ہے کہ حج دو ہیں: ایک حج اکبر ہے جو یوم نحر ( دسویں ذی الحجہ کو ) ہوتا ہے اور دوسرا حج اصغر ہے جسے عمرہ کہتے ہیں، ۴- شافعی کہتے ہیں: عمرہ ( کا وجوب ) سنت سے ثابت ہے، ہم کسی ایسے شخص کو نہیں جانتے جس نے اسے چھوڑنے کی اجازت دی ہو۔ اور اس کے نفل ہونے کے سلسلے میں کوئی چیز ثابت نہیں ہے۔ نبی اکرم صلی اللہ علیہ وسلم سے جس سند سے ( نفل ہونا ) مروی ہے وہ ضعیف ہے۔ اس جیسی حدیث سے حجت نہیں پکڑی جا سکتی، اور ہم تک یہ بات بھی پہنچی ہے کہ ابن عباس رضی الله عنہما اسے واجب قرار دیتے تھے۔ یہ سب شافعی کا کلام ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عمرہ حج میں قیامت تک کے لیے داخل ہو چکا ہے“۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن ہے، ۲- اس باب میں سراقہ بن جعشم اور جابر بن عبداللہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اس حدیث کا معنی یہ ہے کہ حج کے مہینوں میں عمرہ کرنے میں کوئی حرج نہیں۔ یہی تشریح شافعی، احمد اور اسحاق بن راہویہ نے بھی کی ہے کہ جاہلیت کے لوگ حج کے مہینوں میں عمرہ نہیں کرتے تھے، جب اسلام آیا تو نبی اکرم صلی اللہ علیہ وسلم نے اس کی اجازت دے دی اور فرمایا: ”عمرہ حج میں قیامت تک کے لیے داخل ہو چکا ہے“، یعنی حج کے مہینوں میں عمرہ کرنے میں کوئی حرج نہیں ہے، اور اشہر حج شوال، ذی قعدہ اور ذی الحجہ کے دس دن ہیں“، کسی شخص کے لیے یہ مناسب نہیں کہ وہ حج کے مہینوں کے علاوہ کسی اور مہینے میں حج کا احرام باندھے، اور حرمت والے مہینے یہ ہیں: رجب، ذی قعدہ، ذی الحجہ اور محرم۔ صحابہ کرام وغیرہم میں سے اکثر اہل علم اسی کے قائل ہیں ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک عمرے کے بعد دوسرا عمرہ درمیان کے تمام گناہ مٹا دیتا ہے ۱؎ اور حج مقبول ۲؎ کا بدلہ جنت ہی ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "عبدالرحمٰن بن ابی بکر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ وہ عائشہ رضی الله عنہا کو تنعیم ۱؎ سے عمرہ کرائیں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "محرش کعبی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جعرانہ سے رات کو عمرے کی نیت سے نکلے اور رات ہی میں مکے میں داخل ہوئے، آپ نے اپنا عمرہ پورا کیا، پھر اسی رات ( مکہ سے ) نکل پڑے اور آپ نے واپس جعرانہ ۱؎ میں صبح کی، گویا آپ نے وہیں رات گزاری ہو، اور جب دوسرے دن سورج ڈھل گیا تو آپ وادی سرف ۲؎ سے نکلے یہاں تک کہ اس راستے پر آئے جس سے وادی سرف والا راستہ آ کر مل جاتا ہے۔ اسی وجہ سے ( بہت سے ) لوگوں سے آپ کا عمرہ پوشیدہ رہا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ہم اس حدیث کے علاوہ محرش کعبی کی کوئی اور حدیث نہیں جانتے جسے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہو اور کہا جاتا ہے: «جاء مع الطريق» والا ٹکڑا موصول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "عروہ کہتے ہیں کہ ابن عمر رضی الله عنہما سے پوچھا گیا: رسول اللہ صلی اللہ علیہ وسلم نے کس مہینے میں عمرہ کیا تھا؟ تو انہوں نے کہا: رجب میں، اس پر عائشہ رضی الله عنہا نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے جو بھی عمرہ کیا، اس میں وہ یعنی ابن عمر آپ کے ساتھ تھے، آپ نے رجب کے مہینے میں کبھی بھی عمرہ نہیں کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- میں نے محمد بن اسماعیل بخاری کو کہتے سنا کہ جبیب بن ابی ثابت نے عروہ بن زبیر سے نہیں سنا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے چار عمرے کیے، ان میں سے ایک رجب میں تھا ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"text": "براء رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ذی قعدہ کے مہینہ میں عمرہ کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "ام معقل رضی الله عنہما کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”رمضان کا عمرہ ایک حج کے برابر ہے“۔ امام ترمذی کہتے ہیں: ۱- ام معقل کی حدیث اس سند سے حسن غریب ہے، ۲- ( وہب کے بجائے ) ھرم بن خنبش بھی کہا جاتا ہے۔ بیان اور جابر نے یوں کہا ہے «عن الشعبي عن وهب بن خنبش» اور داود اودی نے یوں کہا ہے «عن الشعبي عن هرم بن خنبش» لیکن صحیح وہب بن خنبش ہی ہے، ۳- اس باب میں ابن عباس، جابر، ابوہریرہ، انس اور وہب بن خنبش رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- احمد اور اسحاق بن راہویہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے ثابت ہے کہ رمضان کا عمرہ حج کے ثواب برابر ہے، اسحاق بن راہویہ کہتے ہیں کہ اس حدیث کا مفہوم بھی اس حدیث کے مفہوم کی طرح ہے جو نبی اکرم صلی اللہ علیہ وسلم سے روایت کی گئی ہے کہ جس نے سورۂ «قل هو الله أحد» پڑھی اس نے تہائی قرآن پڑھا ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "حجاج بن عمرو رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس کا کوئی عضو ٹوٹ جائے یا وہ لنگڑا ہو جائے تو اس کے لیے احرام کھول دینا درست ہے، اس پر دوسرا حج لازم ہو گا“ ۱؎۔ میں نے اس کا ذکر ابوہریرہ اور ابن عباس رضی الله عنہم سے کیا تو ان دونوں نے کہا کہ انہوں نے ( حجاج ) سچ کہا۔ اسحاق بن منصور کی سند بھی حجاج رضی الله عنہ سے اسی کے مثل روایت ہے البتہ اس میں «عن الحجاج بن عمرو قال قال رسول الله صلى الله عليه وسلم» کے بجائے «سمعت رسول الله صلى الله عليه وسلم» کے الفاظ ہیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسی طرح کئی اور لوگوں نے بھی حجاج الصواف سے اسی طرح روایت کی ہے، ۳- معمر اور معاویہ بن سلام نے بھی یہ حدیث بطریق: «يحيى بن أبي كثير عن عكرمة عن عبد الله بن رافع عن الحجاج بن عمرو عن النبي صلى الله عليه وسلم» روایت کی ہے، ۴- اور حجاج الصواف نے اپنی روایت میں عبداللہ بن رافع کا ذکر نہیں کیا ہے، حجاج الصواف محدثین کے نزدیک ثقہ اور حافظ ہیں، ۵- میں نے محمد بن اسماعیل بخاری کو کہتے سنا کہ معمر اور معاویہ بن سلام کی روایت سب سے زیادہ صحیح ہے، ۶- عبدالرزاق نے بسند «معمر عن يحيى بن أبي كثير عن عكرمة عن عبد الله بن رافع عن الحجاج بن عمرو عن النبي صلى الله عليه وسلم» اسی طرح روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ ضباعہ بنت زبیر نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر کہا: اللہ کے رسول! میں حج کا ارادہ رکھتی ہوں، تو کیا میں شرط لگا سکتی ہوں؟ ( کہ اگر کوئی عذر شرعی لاحق ہوا تو احرام کھول دوں گی ) آپ نے فرمایا: ”ہاں، تو انہوں نے پوچھا: میں کیسے کہوں؟ آپ نے فرمایا: «لبيك اللهم لبيك لبيك محلي من الأرض حيث تحبسني» ”حاضر ہوں اے اللہ حاضر ہوں حاضر ہوں، میرے احرام کھولنے کی جگہ وہ ہے جہاں تو مجھے روک دے“۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر، اسماء بنت ابی بکر اور عائشہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اسی پر بعض اہل علم کا عمل ہے، وہ حج میں شرط لگا لینے کو درست سمجھتے ہیں۔ وہ کہتے ہیں کہ اگر اس نے شرط کر لی پھر اسے کوئی مرض یا عذر لاحق ہوا تو اس کے لیے جائز ہے کہ وہ حلال ہو جائے اور اپنے احرام سے نکل آئے۔ یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۴- بعض اہل علم حج میں شرط لگانے کے قائل نہیں ہیں۔ وہ کہتے ہیں کہ اگر اس نے شرط لگا بھی لی تو اسے احرام سے نکلنے کا حق نہیں، یہ لوگ اسے اس شخص کی طرح سمجھتے ہیں جس نے شرط نہیں لگائی ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ وہ حج میں شرط لگانے سے انکار کرتے تھے اور کہتے تھے: کیا تمہارے لیے تمہارے نبی اکرم صلی اللہ علیہ وسلم کا طریقہ کافی نہیں ہے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے ذکر کیا کہ صفیہ بنت حیی منیٰ کے دنوں میں حائضہ ہو گئی ہیں، آپ نے پوچھا: ”کیا وہ ہمیں ( مکے سے روانہ ہونے سے ) روک دے گی؟“ لوگوں نے عرض کیا: وہ طواف افاضہ کر چکی ہیں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تب تو کوئی حرج نہیں“۔ امام ترمذی کہتے ہیں: ۱- ام المؤمنین عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے کہ عورت جب طواف زیارت کر چکی ہو اور پھر اسے حیض آ جائے تو وہ روانہ ہو سکتی ہے، طواف وداع چھوڑ دینے سے اس پر کوئی چیز لازم نہیں ہو گی۔ یہی سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ جس نے بیت اللہ کا حج کیا، اس کا آخری کام بیت اللہ کا طواف ( وداع ) ہونا چاہیئے حائضہ عورتوں کے سوا کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں رخصت دی ہے۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث حسن صحیح ہے، ۲- اہل علم کا اسی پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "ام المؤمنین عائشہ رضی الله عنہما کہتی ہیں کہ مجھے حیض آ گیا چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے طواف کے علاوہ سبھی مناسک ادا کرنے کا حکم دیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس طریق کے علاوہ سے بھی عائشہ سے مروی ہے۔ ۲- اہل علم کا اسی حدیث پر عمل ہے کہ حائضہ خانہ کعبہ کے طواف کے علاوہ سبھی مناسک ادا کرے گی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "حارث بن عبداللہ بن اوس رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا: ”جس نے اس گھر ( بیت اللہ ) کا حج یا عمرہ کیا تو چاہیئے کہ اس کا آخری کام بیت اللہ کا طواف ہو۔ تو ان سے عمر رضی الله عنہ نے کہا: تم اپنے ہاتھوں کے بل زمین پر گرو یعنی ہلاک ہو، تم نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے سنی اور ہمیں نہیں بتائی“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- حارث بن عبداللہ بن اوس رضی الله عنہ کی حدیث غریب ہے، اسی طرح دوسرے اور لوگوں نے بھی حجاج بن ارطاۃ سے اسی کے مثل روایت کی ہے۔ اور اس سند کے بعض حصہ کے سلسلہ میں حجاج سے اختلاف کیا گیا ہے، ۲- اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "جابر رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حج اور عمرہ دونوں کو ملا کر ایک ساتھ کیا اور ان کے لیے ایک ہی طواف کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- جابر رضی الله عنہ کی حدیث حسن ہے، ۲- اس باب میں ابن عمر اور ابن عباس رضی الله عنہم سے بھی روایت ہے، ۳- صحابہ کرام رضی الله عنہم وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ وہ کہتے ہیں کہ حج قران کرنے والا ایک ہی طواف کرے گا۔ یہی شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، ۴- اور صحابہ کرام وغیرہم میں سے بعض اہل علم کا کہنا ہے کہ وہ دو طواف اور دو سعی کرے گا۔ یہی ثوری اور اہل کوفہ کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے حج اور عمرہ دونوں کا احرام باندھا اس کے لیے ایک طواف اور ایک سعی کافی ہے یہاں تک کہ وہ ان دونوں کا احرام کھول دے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ۲- اسے ان الفاظ کے ساتھ روایت کرنے میں عبدالعزیز دراوردی منفرد ہیں، اسے دوسرے کئی اور لوگوں نے بھی عبیداللہ بن عمر ( العمری ) سے روایت کیا ہے، لیکن ان لوگوں نے اسے مرفوع نہیں کیا ہے اور یہی زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 949,
			"arabicnumber": 949,
			"text": "علاء بن حضرمی رضی الله عنہ سے مرفوعاً روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مہاجر اپنے حج کے مناسک ادا کرنے کے بعد مکے میں تین دن ٹھہر سکتا ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور اس سند سے اور طرح سے بھی یہ حدیث مرفوعاً روایت کی گئی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب کسی غزوے، حج یا عمرے سے لوٹتے اور کسی بلند مقام پر چڑھتے تو تین بار اللہ اکبر کہتے، پھر کہتے: «لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير آيبون تائبون عابدون سائحون لربنا حامدون صدق الله وعده ونصر عبده وهزم الأحزاب» ”اللہ کے سوا کوئی معبود برحق نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ سلطنت اسی کی ہے اور تمام تعریفیں بھی اسی کے لیے ہیں اور وہ ہر چیز پر قادر ہے۔ ہم لوٹنے والے ہیں، رجوع کرنے والے ہیں، عبادت کرنے والے ہیں، سیر و سیاحت کرنے والے ہیں، اپنے رب کی تعریف کرنے والے ہیں۔ اللہ نے اپنا وعدہ سچ کر دکھایا۔ اپنے بندے کی مدد کی، اور تنہا ہی ساری فوجوں کو شکست دے دی“، امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں براء، انس اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 951,
			"arabicnumber": 951,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ ہم لوگ ایک سفر میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ تھے، آپ نے دیکھا کہ ایک شخص اپنے اونٹ سے گر پڑا، اس کی گردن ٹوٹ گئی اور وہ مر گیا وہ محرم تھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اسے پانی اور بیری کے پتوں سے غسل دو اور اسے اس کے انہی ( احرام کے ) دونوں کپڑوں میں کفناؤ اور اس کا سر نہ چھپاؤ، اس لیے کہ وہ قیامت کے دن تلبیہ پکارتا ہوا اٹھایا جائے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- بعض اہل علم کا اسی پر عمل ہے۔ یہی سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۳- بعض اہل علم کہتے ہیں کہ جب محرم مر جاتا ہے تو اس کا احرام ختم ہو جاتا ہے، اور اس کے ساتھ بھی وہی سب کچھ کیا جائے گا جو غیر محرم کے ساتھ کیا جاتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "نبیہ بن وہب کہتے ہیں کہ عمر بن عبیداللہ بن معمر کی آنکھیں دکھنے لگیں، وہ احرام سے تھے، انہوں نے ابان بن عثمان سے مسئلہ پوچھا، تو انہوں نے کہا: ان میں ایلوے کا لیپ کر لو، کیونکہ میں نے عثمان بن عفان رضی الله عنہ کو اس کا ذکر کرتے سنا ہے، وہ رسول اللہ صلی اللہ علیہ وسلم سے روایت کر رہے تھے آپ نے فرمایا: ”ان پر ایلوے کا لیپ کر لو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اسی پر عمل ہے، یہ لوگ محرم کے ایسی دوا سے علاج کرنے میں کوئی حرج نہیں سمجھتے جس میں خوشبو نہ ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "کعب بن عجرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم مکہ میں داخل ہونے سے پہلے ان کے پاس سے گزرے، وہ حدیبیہ میں تھے، احرام باندھے ہوئے تھے۔ اور ایک ہانڈی کے نیچے آگ جلا رہے تھے۔ جوئیں ان کے منہ پر گر رہی تھیں تو آپ نے پوچھا: کیا یہ جوئیں تمہیں تکلیف پہنچا رہی ہیں؟ کہا: ہاں، آپ نے فرمایا: ”سر منڈوا لو اور چھ مسکینوں کو ایک فرق کھانا کھلا دو، ( فرق تین صاع کا ہوتا ہے ) یا تین دن کے روزے رکھ لو۔ یا ایک جانور قربان کر دو۔ ابن ابی نجیح کی روایت میں ہے ”یا ایک بکری ذبح کر دو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام رضی الله عنہم وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے کہ محرم جب اپنا سر مونڈا لے، یا ایسے کپڑے پہن لے جن کا پہننا احرام میں درست نہیں یا خوشبو لگا لے۔ تو اس پر اسی کے مثل کفارہ ہو گا جو نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "عدی رضی الله عنہ کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم نے چرواہوں کو رخصت دی کہ ایک دن رمی کریں اور ایک دن چھوڑ دیں ۱؎۔ امام ترمذی کہتے ہیں: ۱- اسی طرح ابن عیینہ نے بھی روایت کی ہے، اور مالک بن انس نے بسند «عبد الله بن أبي بكر بن محمد ابن عمرو بن حزم عن أبيه عن أبي البداح بن عدي عن أبيه أن النبي صلى الله عليه وسلم» روایت کی ہے، اور مالک کی روایت زیادہ صحیح ہے، ۲- اہل علم کی ایک جماعت نے چرواہوں کو رخصت دی ہے کہ وہ ایک دن رمی کریں اور ایک دن ترک کر دیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "عاصم بن عدی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اونٹ کے چرواہوں کو ( منی میں ) رات گزارنے کے سلسلہ میں رخصت دی کہ وہ دسویں ذی الحجہ کو ( جمرہ عقبہ کی ) رمی کر لیں۔ پھر دسویں ذی الحجہ کے بعد کے دو دنوں کی رمی جمع کر کے ایک دن میں اکٹھی کر لیں ۱؎ ( مالک کہتے ہیں: میرا گمان ہے کہ راوی نے کہا ) ”پہلے دن رمی کر لے پھر کوچ کے دن رمی کرے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے، اور یہ ابن عیینہ کی عبداللہ بن ابی بکر سے روایت والی حدیث سے زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ علی رضی الله عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس یمن سے آئے تو آپ نے پوچھا: ”تم نے کیا تلبیہ پکارا، اور کون سا احرام باندھا ہے؟“ انہوں نے عرض کیا: میں نے وہی تلبیہ پکارا، اور اسی کا احرام باندھا ہے جس کا تلبیہ رسول اللہ صلی اللہ علیہ وسلم نے پکارا، اور جو احرام رسول اللہ صلی اللہ علیہ وسلم نے باندھا ہے ۱؎ آپ نے فرمایا: ”اگر میرے ساتھ ہدی کے جانور نہ ہوتے تو میں احرام کھول دیتا“ ۲؎، امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"text": "علی رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا: حج اکبر ( بڑے حج ) کا دن کون سا ہے؟ تو آپ نے فرمایا: «یوم النحر» ”قربانی کا دن“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 958,
			"arabicnumber": 958,
			"text": "علی رضی الله عنہ کہتے ہیں کہ حج اکبر ( بڑے حج ) کا دن دسویں ذی الحجہ کا دن ہے ۱؎۔ امام ترمذی کہتے ہیں: ابن ابی عمر نے اسے مرفوع نہیں کیا ہے اور یہ پہلی حدیث سے زیادہ صحیح ہے اور ابن عیینہ کی موقوف روایت محمد بن اسحاق کی مرفوع روایت سے زیادہ صحیح ہے۔ اسی طرح بہت سے حفاظ حدیث نے اسے بسند «أبي إسحق عن الحارث عن علي» موقوفاً روایت کیا ہے، شعبہ نے بھی ابواسحاق سبیعی سے روایت کی ہے انہوں نے یوں کہا ہے «عن عبد الله بن مرة عن الحارث عن علي موقوفا» ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "عبید بن عمیر کہتے ہیں کہ ابن عمر رضی الله عنہما حجر اسود اور رکن یمانی پر ایسی بھیڑ لگاتے تھے جو میں نے صحابہ میں سے کسی کو کرتے نہیں دیکھا۔ تو میں نے پوچھا: ابوعبدالرحمٰن! آپ دونوں رکن پر ایسی بھیڑ لگاتے ہیں کہ میں نے صحابہ میں سے کسی کو ایسا کرتے نہیں دیکھا؟ تو انہوں نے کہا: اگر میں ایسا کرتا ہوں تو اس لیے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”ان پر ہاتھ پھیرنا گناہوں کا کفارہ ہے“۔ اور میں نے آپ کو فرماتے سنا ہے: ”جس نے اس گھر کا طواف سات مرتبہ ( سات چکر ) کیا اور اسے گنا، تو یہ ایسے ہی ہے گویا اس نے ایک غلام آزاد کیا۔“ اور میں نے آپ کو فرماتے سنا ہے: ”وہ جتنے بھی قدم رکھے اور اٹھائے گا اللہ ہر ایک کے بدلے اس کی ایک غلطی معاف کرے گا اور ایک نیکی لکھے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- حماد بن زید نے بطریق: «عطا بن السائب، عن ابن عبید بن عمير، عن ابن عمر» روایت کی ہے اور اس میں انہوں نے ابن عبید کے باپ کے واسطے کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بیت اللہ کے گرد طواف نماز کے مثل ہے۔ البتہ اس میں تم بول سکتے ہو ( جب کہ نماز میں تم بول نہیں سکتے ) تو جو اس میں بولے وہ زبان سے بھلی بات ہی نکالے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث ابن طاؤس وغیرہ نے ابن عباس سے موقوفاً روایت کی ہے۔ ہم اسے صرف عطاء بن سائب کی روایت سے مرفوع جانتے ہیں، ۲- اسی پر اکثر اہل علم کا عمل ہے، یہ لوگ اس بات کو مستحب قرار دیتے ہیں کہ آدمی طواف میں بلا ضرورت نہ بولے ( اور اگر بولے ) تو اللہ کا ذکر کرے یا پھر علم کی کوئی بات کہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حجر اسود کے بارے میں فرمایا: ”اللہ کی قسم! اللہ اسے قیامت کے دن اس حال میں اٹھائے گا کہ اس کی دو آنکھیں ہوں گی، جس سے یہ دیکھے گا، ایک زبان ہو گی جس سے یہ بولے گا۔ اور یہ اس شخص کے ایمان کی گواہی دے گا جس نے حق کے ساتھ ( یعنی ایمان اور اجر کی نیت سے ) اس کا استلام کیا ہو گا“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم حالت احرام میں زیتون کا تیل لگاتے تھے اور یہ ( تیل ) بغیر خوشبو کے ہوتا تھا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، اسے ہم صرف فرقد سبخی کی روایت سے جانتے ہیں، اور فرقد نے سعید بن جبیر سے روایت کی ہے۔ یحییٰ بن سعید نے فرقد سبخی کے سلسلے میں کلام کیا ہے، اور فرقد سے لوگوں نے روایت کی ہے، ۲- مقتت کے معنی خوشبودار کے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ وہ زمزم کا پانی ساتھ مدینہ لے جاتی تھیں، اور بیان کرتی تھیں کہ رسول اللہ صلی اللہ علیہ وسلم بھی زمزم ساتھ لے جاتے تھے ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے، ہم اسے صرف اسی طریق سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "عبدالعزیز بن رفیع کہتے ہیں کہ میں نے انس بن مالک رضی الله عنہ سے کہا: مجھ سے آپ کوئی ایسی بات بیان کیجئیے جو آپ نے رسول اللہ صلی اللہ علیہ وسلم سے یاد کر رکھی ہو۔ بتائیے آپ نے آٹھویں ذی الحجہ کو ظہر کہاں پڑھی؟ انہوں نے کہا: منیٰ میں، ( پھر ) میں نے پوچھا: اور کوچ کے دن عصر کہاں پڑھی؟ کہا: ابطح میں لیکن تم ویسے ہی کرو جیسے تمہارے امراء و حکام کرتے ہیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور اسحاق بن یوسف الازرق کی روایت سے غریب جانی جاتی ہے جسے انہوں نے ثوری سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 158
			}
		}
	]
}