{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"1": "Revelation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1,
			"arabicnumber": 1,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: எண்ணத்தைப் பொறுத்தே செயல் கள் அமைகின்றன. ஒவ்வொரு மனித ருக்கும் அவர் எண்ணியதுதான் கிடைக் கிறது. ஆகவே, எவரது ‘ஹிஜ்ரத்’ (புலம் பெயர்தல்) அவர் அடைய விரும்பும் உலக (ஆதாய)த்தை, அல்லது அவர் மணக்க விரும்பும் பெண்ணை நோக்கமாகக் கொண்டுள்ளதோ, அவரது ஹிஜ்ரத்(தின் பலனும்) அதுவாகவே இருக்கும்.4 இதை உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் சொற்பொழிவு மேடை (மிம்பர்) மீதிருந்தவாறு அறிவித்தார்கள். அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஹாரிஸ் பின் ஹிஷாம் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், “அல்லாஹ்வின் தூதரே! தங்க ளுக்கு வேத அறிவிப்பு (வஹீ) எப்படி வருகின்றது?” என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “சில வேளைகளில் மணி ஓசையைப் போன்று எனக்கு வேத அறிவிப்பு (வஹீ) வரும். இவ்வாறு வருவது எனக்கு மிகவும் கடினமாக இருக்கும். மணி ஓசை மூலம் அவர் (வானவர்) கூறியதை நான் மனனமிட்டுக்கொண்ட நிலையில் அது என்னைவிட்டு விலகிவிடும். இன்னும் சில வேளைகளில், வானவர் ஒரு மனிதரைப் போன்று எனக்குக் காட்சியளித்து என்னுடன் உரையாடுவார். அப்போது அவர் கூறுவதை நான் நினைவிலிருத்திக்கொள்வேன்” என்று பதிலளித்தார்கள். மேலும், ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு, கடுமையான குளிர்வீசும் நாளில் வேதஅறிவிப்பு (வஹீ) வருவதை நான் பார்த்துள்ளேன். வேதஅறிவிப்பு நின்ற பின் அவர்களது நெற்றியிலிருந்து வியர்வை சொட்டும்.5 அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3,
			"arabicnumber": 3,
			"text": "இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு ஆரம்பமாக வந்த வேத அறிவிப்பு (வஹீ) தூக்கத்தில் கண்ட உண்மைக் கனவாகவே இருந்தது. அப்போது அவர்கள் எந்தக் கனவு கண்டாலும், அது அதிகாலைப் பொழுதின் விடியலைப் போன்று (தெளி வாகவே) இருக்கும். பின்னர் தனிமையில் இருப்பது அவர்களின் விருப்பமாயிற்று. (எனவே,) அவர்கள் ‘ஹிரா’ குகையில் தனித்திருந்து பல இரவுகள் வணக்க வழிபாடுகளில் ஈடுபட்டுவந்தார்கள். பின்னர் தம் வீட்டாரிடம் திரும்பிவந்து, அதற்காக (பல நாட்களுக்கு வேண்டிய) உணவைத் தம்முடன் கொண்டுசெல்வார்கள். (அந்த உணவு தீர்ந்ததும்) மீண்டும் (தம் துணைவியார்) கதீஜா (ரலி) அவர்களிடம் திரும்பிவந்து அதைப் போன்று (பல நாட்களுக்கு வேண்டிய) உணவைத் தம்முடன் பெற்றுச் செல்வார்கள். இந்நிலை, ‘ஹிரா’ குகையில் அவர்களுக்குச் சத்திய (வேத)ம் வரும்வரை நீடித்தது. (ஒரு நாள்) அந்த வானவர் (ஜிப்ரீல்) நபி (ஸல்) அவர்களிடம் வந்து, “ஓதுவீராக” என்றார். நபி (ஸல்) அவர்கள், “நான் ஓதத் தெரிந்தவனில்லையே!” என்று சொன்னார்கள். (பின்பு நடந்தவற்றை) நபி (ஸல்) அவர்களே (பின்வருமாறு எடுத்துக்) கூறினார்கள்: வானவர் (ஜிப்ரீல்) என்னைப் பிடித்து நான் திணறும் அளவுக்கு இறுகக் கட்டியணைத்தார். பிறகு என்னை விட்டு விட்டு “ஓதுவீராக” என்றார். அப்போதும் “நான் ஓதத் தெரிந்தவனில்லையே!” என்றேன். உடனே அவர் இரண்டாம் முறையாக என்னைப் பிடித்து நான் திணறும் அளவுக்கு இறுகக் கட்டி யணைத்தார். பிறகு என்னை விட்டு விட்டு “ஓதுவீராக!” என்றார். அப்போதும் “நான் ஓதத் தெரிந்தவனில்லையே!” என்றேன். உடனே அவர் என்னைப் பிடித்து மூன்றாவது முறையாகக் கட்டித் தழுவினார். பின்னர் என்னை விட்டுவிட்டு, “படைத்த உம்முடைய இறைவனின் (திருப்) பெயரால் ஓதுவீராக! அவனே மனிதனை ‘அலக்’ (அட்டை போன்று ஒட்டிப்பிடித் துத் தொங்கும் கருவில்) இருந்து படைத்தான். ஓதுவீராக! உம்முடைய இறைவன் மாபெரும் கொடையாளி” எனும் இறைவசனங்களை (96:1-5) அவர் ஓதினார். (தொடர்ந்து ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்:) பிறகு (அச்சத்தால்) இதயம் படபடக்க அந்த வசனங்களுடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், (தம் துணைவியார்) கதீஜா பின்த் குவைலித் (ரலி) அவர்களிடம் வந்து, “எனக்குப் போர்த்திவிடுங்கள்; எனக்குப் போர்த்திவிடுங்கள்” என்றார்கள். அவ்வாறே வீட்டாரும் அவர்களுக்குப் போர்த்திவிட, அச்சம் அவர்களைவிட்டு அகன்றது. பின்னர் கதீஜாவிடம் நடந்தவற்றைத் தெரிவித்துவிட்டு, “எனக்கேதும் நேர்ந்துவிடுமோ என நான் அஞ்சுகிறேன்” என்று சொன்னார்கள். அதற்கு கதீஜா (ரலி) அவர்கள், “அப்படியொன்றும் ஆகாது. அல்லாஹ் வின் மீதாணையாக! உங்களை ஒரு போதும் அல்லாஹ் இழிவுபடுத்த மாட்டான்; (ஏனெனில்,) தாங்கள் உறவுகளைச் சேர்ந்து வாழ்கிறீர்கள்; சுயகாலில் நிற்க முடியாதவர்களைச் சுமக்கிறீர்கள்; வறியவர்களுக்காகப் பாடுபடுகிறீர்கள்; விருந்தினர்களை உபசரிக்கிறீர்கள்; சத்திய சோதனையில் ஆட்பட்டோருக்கு உதவி செய்கிறீர்கள் (அதனால் நீங்கள் அஞ்ச வேண்டிய தில்லை)” என்று (ஆறுதல்) சொன் னார்கள்.6 பின்னர் நபி (ஸல்) அவர்களை அழைத்துக் கொண்டு தம் தந்தையின் சகோதரர் மகனான வரக்கா பின் நவ்ஃபல் பின் அசத் பின் அப்தில் உஸ்ஸா என்பாரிடம் கதீஜா (ரலி) அவர்கள் சென்றார்கள்.7 -‘வரக்கா’ அறியாமைக் காலத்திலேயே கிறித்தவ சமயத்தைத் தழுவியவராக இருந்தார். மேலும், அவர் (அரபி மற்றும்) எபிரேயு (ஹீப்ரு) மொழியில் எழுதத் தெரிந்தவராக இருந்தார். எனவே, இன்ஜீல் வேதத்தை அல்லாஹ் நாடிய அளவுக்கு எபிரேயு மொழியி(லிருந்து அரபி மொழியி)ல் எழுதுவார். அவர் கண் பார்வையிழந்த முதியவராகவும் இருந்தார்.- அவரிடம் கதீஜா (ரலி) அவர்கள், “என் தந்தையின் சகோதரர் புதல்வரே! உங்கள் சகோதரர் புதல்வர் (முஹம்மத்) இடம் அவர் கூறுவதைக் கேளுங்கள்” என்றார்கள்.8 அப்போது வரக்கா நபி (ஸல்) அவர்களிடம், “என் சகோதரர் மகனே! நீங்கள் என்ன பார்த்தீர்கள்?” எனக் கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தாம் பார்த்தவற்றின் விவ ரத்தை அவரிடம் சொன்னார்கள். (இதைக் கேட்ட) வரக்கா, “(நீர் கண்ட) இவர்தான், (இறைத்தூதர்) மூசாவிடம் இறைவன் அனுப்பிய வானவர் (ஜிப்ரீல்) ஆவார்” என்று நபியவர்களிடம் கூறி விட்டு, “(மகனே!) உம்மை உம்முடைய சமூகத்தார் (உமது நாட்டிலிருந்து) வெளியேற்றும் அந்தச் சமயத்தில் நான் இளைஞனாக (திடகாத்திரமானவனாக) இருந்தால் நன்றாயிருக்குமே! நான் அந்தத் தருணத்தில் உயிரோடு இருந்தால் நன்றாயிருக்குமே!” என்றார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(என் சமூக) மக்கள் என்னை (நாட்டைவிட்டு) வெளியேற்றவா செய்வார்கள்?” என்று கேட்க, வரக்கா, “ஆம், நீங்கள் பெற்றுள்ள (உண்மையான வேதம் போன்ற)தைப் பெற்ற (இறைத் தூதர்) எவரும் (மக்களால்) பகைத்துக் கொள்ளப்படாமல் இருந்ததில்லை. உங்களது (தூதுப்பணி பரவலாகும்)நாளை நான் அடைந்தால் உங்களுக்குப் பலமான உதவி செய்வேன்” என்று சொன்னார். பின்னர் வரக்கா நீண்ட நாள் இருக்கவில்லை; இறந்துவிட்டார். (அந்த முதல் வஹீயுடன்) வேத அறிவிப்பு (சிறிது காலம்) நின்றுபோயிற்று. அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4,
			"arabicnumber": 4,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தமக்கு வேத அறிவிப்பு (வஹீ) நின்றுபோயிருந்த இடைக்காலம் பற்றி அறிவிக்கையில் (பின்வருமாறு) கூறனார்கள்: நான் நடந்துபோய்க்கொண்டிருக்கும் போது வானத்திலிருந்து ஒரு குரலைக் கேட்டு அண்ணாந்து பார்த்தேன். அங்கே, ‘ஹிரா’வில் என்னிடம் வந்த வானவர் (ஜிப்ரீல்) வானுக்கும் பூமிக்கு மிடையே ஓர் ஆசனத்தில் அமர்ந்திருந் தார். அவரைக் கண்டு நான் அச்சமடைந் தேன். உடனே நான் (வீட்டுக்குத்) திரும்பி (என் வீட்டாரிடம்) “எனக்குப் போர்த்தி விடுங்கள்; எனக்குப் போர்த்திவிடுங்கள்” என்று சொன்னேன். (அவர்களும் போர்த்தி விட்டார்கள்.) அப்போது அல்லாஹ், “போர்த்தி யிருப்பவரே! எழுந்து எச்சரிக்கை செய்வீராக. உம்முடைய இறைவனைப் பெருமைப்படுத்துவீராக. உம்முடைய ஆடைகளைத் தூய்மையாக வைத்திருப் பீராக. அசுத்தத்திலிருந்து விலகியிருப் பீராக” எனும் வசனங்களை (74:1-5) அருளினான். பின்னர் வேத அறிவிப்பு (வஹீ) தொடர்ந்து அதிகமாக வரலாயிற்று. இந்த ஹதீஸ் ஆறு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் யூனுஸ், மஅமர் (ரஹ்) ஆகியோரது அறிவிப்பில் (முந்தைய ஹதீஸில் இடம்பெற்றுள்ள ‘இதயம் படபடக்க’ என்பதற்குப் பதிலாக) ‘கழுத்துச் சதைகள் படபடக்க’ என வந்துள்ளது. அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5,
			"arabicnumber": 5,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: “(நபியே!) இந்த வஹீயை (வேத அறிவிப்பை) அவசர அவசரமாக மனனம் செய்வதற்காக நீர் உமது நாவை அசைக்காதீர்” (75:16) எனும் இறை வசனத்தி(ற்கு விளக்கமளிக்கையி)ல் இப்னு அப்பாஸ் (ரலி) அவர்கள் (பின் வருமாறு) கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வேதஅறிவிப்பு அருளப்பெறும் போது (தம்மைத் தாமே) மிகுந்த சிரமத் திற்கு உள்ளாக்கிக்கொண்டிருந்தார்கள்; தம் உதடுகளை (வேத வசனங்களை மனனமிட வேகவேகமாக) அசைத்துக் கொண்டிருப்பார்கள்.9 அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் உதடுகளை அசைத்ததைப் போன்று நானும் உங்களுக்கு அசைத்துக்காட்டுகிறேன். (அறிவிப்பாளர்) சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள், “நான் இப்னு அப்பாஸ் (ரலி) அவர்கள் தம் இதழ்களை அசைத்துக்காட்டியதைப் போன்று நானும் உங்களுக்கு அசைத்துக்காட்டுகிறேன்” என்றார்கள். அப்போதுதான் உயர்ந்தோன் அல்லாஹ், “(நபியே!) இந்த வஹீயை அவசர அவசரமாக மனனம் செய்வதற்காக நீர் உமது நாவை அசைக்காதீர்” (75:16-19) எனும் வசனங்களை அருளினான். “அதை (உமது மனத்தில்) ஒன்றுசேர்த்து, அதை (நீர்) ஓதும்படி செய்வது எமது பொறுப்பாகும்” (75:17) எனும் வசனத்திற்கு “உமது நெஞ்சில் பதியச் செய்வதும் அதை நீர் ஓதும்படிசெய்வதும் எமது பொறுப்பாகும்” என்பது பொருள். “மேலும், நாம் இதை ஓதிவிட்டோமாயின் நீர் ஓதுவதைத் தொடர்வீராக” (75:18) எனும் வசனத்திற்கு “(நாம் இதை அருளும்போது) மௌனமாக இருந்து செவிதாழ்த்திக்கொண்டிருப்பீராக” என்பது பொருள். “பின்னர், இ(தன் கருத்)தை விவரிப்ப தும் எமது பொறுப்பேயாகும்” (75:19) எனும் வசனத்திற்கு “(உமது நாவால்) அதை (மக்களுக்கு) நீர் ஓதிக்காட்(டி விளக்கமளித்தி)டச் செய்வதும் எமது பொறுப்பாகும்” என்பது பொருள். மேலும், இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறுகையில், “அதன் பின்னர் அல்லாஹவின் தூதர் (ஸல்) அவர்கள் தம்மிடம் (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் வரும்போது, (அவர்கள் ஓதுவதை) செவிதாழ்த்திக் கேட்பார்கள். ஜிப்ரீல் சென்றதும் அவர் ஓதியதைப் போன்றே அ(ந்த வசனத்)தை நபி (ஸல்) அவர்களும் ஓதினார்கள்” என்று குறிப்பிட்டார்கள். அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6,
			"arabicnumber": 6,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களிலேயே அதிகமாக வாரி வழங்குபவர்களாகத் திகழ்ந்தார்கள். (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் ரமளான் மாதத்தில் தம்மைச் சந்திக்கின்ற வேளையில், நபியவர்கள் இன்னும் அதிகமாக வாரி வழங்குபவர்களாக இருந்தார்கள். ஜிப்ரீல் (அலை) அவர்கள் ரமளானின் ஒவ்வோர் இரவிலும் நபி (ஸல்) அவர்களைச் சந்தித்துக்கொண்டிருந்தார்கள். அப்போது (அதுவரை அருளப்பெற்ற) குர்ஆனை ஜிப்ரீல் (அலை) அவர்கள் நபி (ஸல்) அவர்களுக்கு நினைவுபடுத்துவார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொடர்ந்து வீசும் மழைக் காற்றைவிட அதிகமாக நல்லதை வாரி வழங்குபவர்களாக இருந்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7,
			"arabicnumber": 7,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (மக்கா குறைஷித் தலைவர்களில் ஒருவரான) அபூசுஃப்யான் பின் ஹர்ப் (ரலி) அவர்கள் என்னிடம் தெரிவித்தார்கள்: என்னிடமும் குறைஷி இறைமறுப் பாளர்களிடமும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஹுதைபியா) ஒப்பந் தம் செய்துகொண்டிருந்த காலகட்டத் தில் குறைஷியரின் வணிகக் குழு ஒன்று ஷாம் (சிரியா) நாட்டில் வணிகம் செய்துகொண்டிருந்தது.10 குறைஷி வணிகக் குழுவினருடன் இருந்த என்னை அழைத்துவரும்படி (கிழக்கு ரோமானியப் பேரரசர்) ஹிரக்ளீயஸ் ஆளனுப்பினார். நாங்கள் அவரிடம் வந்துசேர்ந்தோம். அவரும் அவருடைய ஆட்களும் ‘ஈலியா’வில் (பைத்துல் மக்தஸில்) இருந்தார்கள். (கிழக்கு) ரோமானிய அரசுப் பிரதிநிதிகள் தம்மைச் சூழ்ந்திருந்த அ(ரச)வைக்கு வரும்படி எங்களை ஹிரக்ளீயஸ் அழைத்தார். (நாங்கள் அங்கு போய்ச்சேர்ந்த) பிறகு (தமக்கு அருகில் வந்து அமருமாறு) எங்களை அழைத்ததுடன் தம்முடைய மொழிபெயர்ப்பாளரையும் அழைத்தார். (பிறகு எங்களைப் பார்த்து,) “தம்மை இறைத்தூதர் என்று சொல்லிக்கொண்டி ருக்கும் இந்த (முஹம்மத் எனும்) மனிதருக்கு உங்களில் நெருங்கிய உறவினர் யார்?” என்று கேட்டார். நான் “நானே இவர்களில் (அவருக்கு) நெருங்கிய உறவினன்” என்று பதில ளித்தேன்.11 ஹிரக்ளீயஸ் (தம் அதிகாரி களிடம்), “அவரை என் அருகே அழைத்துவாருங்கள்; (அவருடன் வந்தி ருக்கும்) அவருடைய நண்பர்களையும் எனக்கருகில் கொண்டுவந்து இவரது முதுகுக்குப் பின்னால் நிறுத்துங்கள்” என்று கூறினார். பிறகு தம் மொழிபெயர்ப்பாளரிடம் “நான் இந்த மனிதரை (முஹம்மதை)ப் பற்றி இவரிடம் கேட்பேன். இவர் பொய் (ஏதும்) சொன்னால், உடனே ‘அவர் பொய் சொல்கிறார்’ என்று கூறிவிட வேண்டும்” என அவருடைய நண்பர் களிடம் (மொழிபெயர்த்துச்) சொல் என்று சொன்னார். நான் பொய் சொன்னால் என் நண்பர்கள் என்னைக் காட்டிக் கொடுத்து விடுவார்கள் என்ற வெட்கம் மட்டும் எனக்கு அப்போது இல்லாதிருந்தால், அல்லாஹ்வின் மீது சத்தியமாக! நான் நபியவர்களைப் பற்றிப் பொய்(யானத் தகவல்களைச்) சொல்லியிருப்பேன். பிறகு ஹிரக்ளீயஸ் என்னிடம் நபி (ஸல்) அவர்களைப் பற்றிக் கேட்ட முதல் கேள்வி, “உங்களிடையே அந்த மனிதரின் குலம் எப்படிப்பட்டது?” என்பதே ஆகும். அதற்கு, “அவர் எங்களில் சிறந்த குலத்தைச் சேர்ந்தவர்” என்று கூறி னேன். (பிறகு) அவர், “உங்களில் எவரேனும் இதற்குமுன் இப்படி எப்போதாவது (தம்மை ‘நபி’ என) வாதித்ததுண்டா?” என்று கேட்டார். நான் ‘இல்லை’ என்று பதிலளித்தேன். “அவருடைய முன்னோர்களில் அரசர் யாரேனும் இருந்திருக் கின்றாரா?” என்று கேட்டார். நான் ‘இல்லை’ என்றேன். “அவரை மக்களில் மேட்டுக் குடியினர் பின்பற்றுகின்றனரா? அல்லது அவர்களில் பலவீனர்கள் (ஒடுக்கப்பட்ட வர்கள்) பின்பற்றுகின்றனரா?” என்று மன்னர் கேட்டார். அதற்கு நான், ‘இல்லை; பலவீனர்கள்தான் (அவரைப் பின்பற்றுகின்றனர்)” என்று சொன்னேன். “அவரைப் பின்பற்றுவோர் அதிகரித் துக்கொண்டே செல்கின்றார்களா? அல்லது குறைந்துகொண்டே போகின் றார்களா?” என்று கேட்டார். நான், “இல்லை; அவர்கள் (நாளுக்கு நாள்) அதிகரித்துக்கொண்டே செல்கின்றனர்” என்று கூறினேன். “அவரது மார்க்கத்தில் இணைந்த பிறகு அதன்மீது அதிருப்தியடைந்து எவரேனும் அதிலிருந்து வெளியேறிச் செல்வதுண்டா?” என்று கேட்டார். நான் ‘இல்லை’ என்று சொன்னேன். “அவர் இவ்வாறு (தம்மை இறைத்தூதர் என) வாதிப்பதற்குமுன் அவர் (மக்களிடம்) பொய் சொன்னார் என்று (எப்போதேனும்) நீங்கள் அவரைச் சந்தேகித்திருக்கிறீர்களா?” என்று கேட்டார். நான் ‘இல்லை’ என்றேன். “அந்த மனிதர் உடன்படிக்கையை மீறுகின்றாரா?” என்று கேட்டார். நான் “இல்லை; (தற்போது நடைமுறையிலுள்ள ஹுதைபியா சமாதான உடன்படிக்கை யின்) இந்தக் காலகட்டத்தில் நாங்கள் இருக்கின்றோம். இதில் அவர் எப்படி நடந்துகொள்வார் என்பது எங்களுக்குத் தெரியாது” என்று சொன்னேன். இதைத் தவிர (நபியவர்களைக் குறைசொல்வதற்கு) வேறு எந்த வார்த்தையையும் புகுத்த எனக்கு வாய்ப்புக் கிடைக்கவில்லை. அவர், “அந்த மனிதருடன் நீங்கள் போர் புரிந்ததுண்டா?” என்று கேட்டார். நான் ‘ஆம்’ என்றேன். அவர், “அவருடன் நீங்கள் நடத்திய போர்க(ளின் முடிவு)கள் எப்படி அமைந்தன?” என்று கேட்டார். “எங்களுக்கிடையேயான போர் (கிணற்று) வாளிகள்தான்; (அவை சுழல் முறையில் மாறி மாறி வருகின்றன. ஒரு முறை) அவர் எங்களை வெல்வார். (மறுமுறை) நாங்கள் அவரை வெல்வோம்” என்றேன். “அவர் உங்களுக்கு என்ன (செய்யும் படி) கட்டளையிடுகிறார்?” என்று கேட் டார். நான் “அல்லாஹ் ஒருவனையே வழிபடுங்கள்; அவனுக்கு எதனையும், யாரையும் இணையாக்காதீர்கள்; உங்கள் மூதாதையர் சொல்லிவருகின்ற (அறி யாமைக் கால) கூற்றுகளையெல்லாம் விட்டுவிடுங்கள் என்று கூறுகிறார். தொழுகையை நிறைவேற்றும்படியும், ‘ஸகாத்’ கொடுக்கும்படியும், உண்மை பேசும்படியும், தன்மானத்துடன் வாழும் படியும், உறவுகளைப் பேணும்படியும் எங்களுக்கு அவர் கட்டளையிடுகின் றார்” என்று சொன்னேன். பிறகு ஹிரக்ளீயஸ் தம் மொழி பெயர்ப்பாளரிடம் (பின்வருமாறு) கூறினார்: (அபூசுஃப்யானிடம்) கூறிவிடு: நான் உம்மிடம் அவருடைய குலத்தைப் பற்றிக் கேட்டேன். அதற்கு நீர், “அவர் எங்கள் மத்தியில் சிறந்த குலத்தை உடையவர்” என்று பதிலளித்தீர். இவ்வாறே இறைத் தூதர்கள் ஒரு சமுதாயத்தின் நற்குடியில்தான் தேர்ந்தெடுக்கப்படுகின்றனர். நான் உம்மிடம் “(இவருக்கு முன்னர்) உங்களில் எவரேனும் இந்த வாதத்தை முன்வைத்ததுண்டா?” என்று கேட்டேன். அதற்கு நீர் ‘இல்லை’ என்று பதிலளித் தீர். இவருக்கு முன்னர் எவரேனும் இந்த வாதத்தை முன்வைத்திருந்(ததாக நீர் கூறியிருந்)தால், “தமக்கு முன்னர் (சிலரால்) முன்வைக்கப்பட்ட ஒரு வாதத்தைப் பின்பற்றிச் செல்கின்ற ஒரு (சராசரி) மனிதர்தான் இவர்” என்று நான் சொல்லி யிருப்பேன். நான் உம்மிடம் “அவருடைய முன்னோர்களில் அரசர் எவரேனும் இருந் திருக்கின்றாரா” என்று கேட்டேன். அதற்கு நீர் ‘இல்லை’ என்று பதிலளித்தீர். அவருடைய முன்னோர்களில் அரசர் எவரேனும் இருந்(ததாக நீர் கூறியிருந்) தால், “தம் முன்னோரின் ஆட்சியதிகாரத்தை(த் தாமும்) அடைய விரும்பும் ஒரு (சராசரி) மனிதர்தான் இவர்” என்று நான் கூறியிருப்பேன். நான் உம்மிடம் “அவர் இவ்வாறு (தம்மை இறைத்தூதர் என) வாதிப்பதற்கு முன்பு (அவர் மக்களிடம்) பொய் பேசினார் என்று எப்போதேனும் நீங்கள் சந்தேகித்ததுண்டா?” என்று கேட்டேன். அதற்கு நீர் ‘இல்லை’ என்று பதிலளித்தீர். இதிலிருந்து மக்களிடம் பொய் பேச(த் துணிய)ôத அவர் இறைவன்மீது பொய் சொல்லமாட்டார் என்று நான் புரிந்து கொண்டேன். நான் உம்மிடம் “மக்களில் மேட்டுக் குடியினர் அவரைப் பின்பற்றுகின்ற னரா? அல்லது பலவீனர்களா (ஒடுக்கப் பட்டவர்களா)?” என்று கேட்டேன். அதற்கு நீர் “ஒடுக்கப்பட்ட மக்களே அவரைப் பின்பற்றுகின்றனர்” என்று பதிலளித்தீர். (பெரும்பாலும்) அவர்கள் தான் இறைத்தூதர்களைப் பின்பற்று வோர் ஆவர். நான் உம்மிடம் “அவ(ரைப் பின் பற்றுபவ)ர்கள் (நாளுக்கு நாள்) அதிக ரித்துவருகின்றனரா? அல்லது குறைந்துவருகின்றனரா?” என்று கேட்டேன். அதற்கு நீர் “அவர்கள் அதிகரித்தேவருகின்றனர்” என்று பதிலளித்தீர். இறை நம்பிக்கை எனும் (இந்த) விஷயம் அவ்வாறுதான்; (வளர்ந்துகொண்டே) இருக்கும். நான் உம்மிடம் “அவரது மார்க்த்தில் இணைந்தபின் எவரேனும் அதன் மீது அதிருப்தி கொண்டு அதிலிருந்து வெளியேறிச் செல்வதுண்டா?” என்று கேட்டேன். அதற்கு நீர் ‘இல்லை’ என்று பதிலளித்தீர். இறைநம்பிக்கை இத்தகையதே; அதன் மலர்ச்சி இதயங்களில் கலந்துவிடும்போது (அதைக் குறித்து எவருமே அதிருப்தியடையமாட்டார்). நான் உம்மிடம் “அந்த மனிதர் உடன்படிக்கையை மீறுகின்றாரா?” என்று கேட்டேன். அதற்கு நீர் ‘இல்லை’ என்று பதிலளித்தீர். இறைத்தூதர்கள் இத்தகையோரே; அவர்கள் உடன்படிக்கையை மீறமாட்டார்கள். நான் உம்மிடம் “அவர் உங்களுக்கு என்ன கட்டளையிடுகின்றார்?” என்று கேட்டேன். அதற்கு நீர் “அல்லாஹ்வையே வழிபட வேண்டும்; அவனுக்கு எதையும், எவரையும் இணை கற்பிக்கக் கூடாது” என்று அவர் கட்டளையிடுவ தாகவும், சிலைகளை வழிபடக் கூடா தென்று உங்களுக்குத் தடை விதிப்பதாக வும், தொழுகை, உண்மை, தன்மானம் ஆகியவற்றை(க் கடைப்பிடிக்கும்படி) அவர் கட்டளையிடுவதாகவும் நீர் பதிலளித்தீர். நீர் சொல்வது உண்மையாயிருப்பின், அவர் என்னுடைய இந்தப் பாதங்கள் உள்ள இடத்திற்கு ஆட்சியாளராவார். இறைத்தூதரான அவர் வரவிருப்பதாக நான் அறிந்திருந்தேன். ஆனால், அவர் (குறைஷியரான) உங்களிலிருந்து வருவார் என்று நான் நினத்திருக்க வில்லை. நான் அவரைச் சென்றடை வேன் என அறிந்தால், நான் அவரைச் சந்திக்க பெரு முயற்சி எடுப்பேன். அவர் அருகில் நான் இருந்திருந்தால், அவரு டைய பாதங்களைக் கழுவியிருப்பேன் என்று கூறினார். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் கடிதத்தைக் கொண்டுவருமாறு ஹிரக்ளீயஸ் உத்தரவிட்டார். அக்கடிதத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் திஹ்யா அல்கல்பீ (ரலி) அவர்களிடம் கொடுத்து, புஸ்ரா நகர ஆட்சியர் (ஹாரிஸ் பின் அபீஷம்ர்) வாயிலாக ஹிரக்ளீயஸிடம் ஒப்படைக்கும்படி கூறியிருந்தார்கள்.12 ஹிரக்ளீயஸ் அதை வாசிக்கச் செய்தார். அந்தக் கடிதத்தில் (பின்வருமாறு) எழுதப்பட்டிருந்தது: அளவிலா அருளாளன் நிகரிலா அன்புடையோன் அல்லாஹ்வின் திருப்பெயரால்... இது அல்லாஹ்வின் அடியாரும் அவனுடைய தூதருமாகிய முஹம்மதிட மிருந்து (கிழக்கு) ரோமாபுரியின் அதிபர் ஹரக்ளீயஸுக்கு (எழுதப்படும் கடிதம்:) நல்வழியைப் பின்பற்றியவர்மீது சாந்தி நிலவட்டும். இறைவாழ்த்துக்குப்பின் (விஷயம் என்னவென்றால்); இஸ்லாத்தை ஏற்கு மாறு உங்களுக்கு நான் அழைப்பு விடுக்கின்றேன். இஸ்லாத்தை ஏற்றுக் கொள்ளுங்கள். (ஏற்றுக்கொண்டால் ஈருலகிலும்) நீங்கள் பாதுகாப்புப் பெறு வீர்கள். (நீங்கள் இஸ்லாத்தை ஏற்றுக் கொண்டால்,) அல்லாஹ் உங்களுக்குச் சேர வேண்டிய நன்மையை இரு மடங் காகத் தருவான். நீங்கள் புறக்கணித்தால், (உங்கள் நாட்டுக் குடிமக்களான) குடியானவர்களின் பாவமும் (அவர்கள் இஸ்லாத்தை ஏற்காமல் போவதன் குற்றமும்) உங்களையே சாரும். வேதக்காரர்களே! எங்களுக்கும் உங்களுக்கும் இடையே பொதுவான தொரு கொள்கையின்பால் நீங்கள் வாருங்கள். (அதாவது) நாம் அல்லாஹ்வைத் தவிர வேறு யாரையும் வழிபடக் கூடாது; அவனுக்கு எதையும் இணை கற்பிக்கக் கூடாது; அல்லாஹ்வை விடுத்து நம்மில் சிலர் வேறுசிலரைக் கடவுளாக ஆக்கிக்கொள்ளக் கூடாது; என்று (நபியே!) நீர் கூறுவீராக. (இதற்குப் பிறகும்) அவர்கள் புறக்கணித்தால், நாங்கள் (அல்லாஹ்வுக்கு அடிபணிந்த) முஸ்லிம்கள்தான் என்பதற்கு நீங்கள் சாட்சிகளாக இருங்கள் என்று சொல்லிவிடுங்கள். (3:64) ஹிரக்ளீயஸ் தாம் சொல்ல வேண்டியதை எல்லாம் சொல்லி அந்தக் கடிதத்தைப் படித்து முடித்தபோது, அவர் அருகில் (அவரைச் சுற்றிலுமிருந்த மதகுருமார்கள், கிழக்கு ரோமானிய ஆட்சியாளர்கள் ஆகியோரின்) கூச்சலும் இரைச்சலும் அதிகரித்தது; குரல்கள் உயர்ந்தன. உடனே நாங்கள் (அந்த அவையிலிருந்து) வெளியேற்றப்பட்டோம். நாங்கள் வெளியேற்றப்பட்டபோது நான் என் நண்பர்களிடம், “இப்னு அபீகப்ஷா (முஹம்மது)வின் விவகாரம் வலிமை பெற்றுவிட்டது. மஞ்சள் நிற இனத்தாரின் (ரோமரின்) மன்னரே அவருக்கு (முஹம்மதுக்கு) அஞ்சுகிறாரே!” என்று சொன்னேன். (அன்று முதல்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் அம்மார்க்கம் விரை வில் வெற்றி பெறும் என்று உறுதிபூண்ட வனாக நான் இருக்கலானேன். முடிவில் அல்லாஹ் என் உள்ளத்தில் இஸ்லாத்தைப் புகுத்தினான். ஈலியா (பைத்துல் மக்தஸ்) நிர்வாகி யும் (மன்னர்) ஹிரக்ளீயஸின் நண்பரு மான இப்னு நாத்தூர் என்பார் ஷாம் (சிரியா) நாட்டுக் கிறித்தவர்களின் பேராயராக இருந்தவர் ஆவார். அவர் அறிவிக்கிறார்: ஹிரக்ளீயஸ் ‘ஈலியா’ (பைத்துல் மக்தஸ்) வந்தபோது மனசஞ்சலத்துடன் காணப்பட்டார். அப்போது அவருடைய அரசவைப் பிரதானிகளில் சிலர் “தங்களின் (கவலை தோய்ந்த) இந்தத் தோற்றம் எங்களுக்குக் கவலை அளிக்கிறது” என்று கூறினார்கள். -மன்னர் ஹிரக்ளீயஸ், கிரகங்களைப் பார்த்து சோதிடம் சொல்வதில் கைதேர்ந்த வராயிருந்தார்- (தங்களின் கவலைக்குக் காரணம் என்னவென்று) அவர்கள் வினவியதற்கு, “இன்றிரவு நான் நட்சத் திரங்களைக் கூர்ந்து கவனித்துக்கொண்டிருந்தபோது, விருத்தசேதனர்களின் அரசர் தோன்றிவிட்டதைப் பார்த்தேன்” என்று ஹிரக்ளீயஸ் கூறிவிட்டு, “இந்தத் தலைமுறையினரில் விருத்தசேதனம் செய்துகொள்ளும் வழக்கமுடையவர்கள் யார்?” என்று கேட்டார். அதற்கு அவர்கள், “(நாங்கள் அறிந்த வரையில்) யூதர்களைத் தவிர வேறு யாரும் விருத்தசேதனம் செய்துகொள்வதில்லை; அவர்களைப் பற்றி நீங்கள் கவலைப்படாதீர்கள்; உங்கள் ஆட்சிக்குட்பட்ட நகரங்களுக்கெல்லாம் எழுதி, அங்குள்ள யூதர்களைக் கொன்றுவிடுமாறு கட்டளையிடுங்கள்” என்றார்கள். இவ்வாறு அவர்கள் உரையாடிக்கொண்டிருக்கையில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பற்றிய தகவலைத் தெரிவிக்கும் ஒரு மனிதரை ‘ஃகஸ்ஸான்’ குலத்தின் (குறுநில) மன்னர், ஹிக்ளீயஸி டம் அனுப்பியிருந்தார்; அம்மனிதர் ஹிரக்ளீயஸிடம் அழைத்துவரப்பட்டார். அவரிடமிருந்து தகவல்களைப் பெற்றுக்கொண்ட ஹிரக்ளீயஸ், “இவரை அழைத்துச் சென்று இவர் விருத்த சேதனம் செய்திருக்கிறாரா, அல்லவா என்று சோதியுங்கள்” என்று ஆணையிட் டார். அவ்வாறே அவரைப் பார்வையிட்ட னர்; அவர் விருத்தசேதனம் செய்திருப் பதாக ஹிரக்ளீயஸிடம் கூறினார்கள். மேலும், அந்த மனிதரிடம் ஹிரக்ளீயஸ் அரபுக(ளின் பழக்க வழக்கங்க)ள் குறித்து விசாரித்தபோது, “அவர்கள் விருத்த சேதனம் செய்துகொள்ளும் வழக்க முடையவர்கள்தான்” என்று குறிப்பிட்டார். உடனே ஹிரக்ளீயஸ், “இதோ இந்தத் தலைமுறையினரின் அரசர் தோன்றிவிட்டார்” என்று கூறினார். பின்னர் (இது தொடர்பாக ரோமின் தலைநகரான) ரூமியாவில் இருந்த தம் நண்பரும் கல்வி கேள்வியில் தமக்கு நிகரானவருமான (ளஃகாத்திர் எனும்) ஒவருக்குக் கடிதம் எழுதிவிட்டு, ஹிரக்ளீயஸ் ஹிம்ஸ் நகருக்குச் சென்றார்.13 அவர் ‘ஹிம்ஸ்’ சென்றடைவதற்குள் நண்பரிடமிருந்து (பதில்) கடிதம் வந்தது. அந்தக் கடிதத்தில், ஹிரக்ளீயஸின் ஊகப்படியே, நபிகளாரின் வருகை பற்றியும் அவர் இறைத்தூதர்தான் என்பது பற்றியும் கூறப்பட்டிருந்தது. பின்னர் ஹிரக்ளீயஸ் ஹிம்ஸ் நகரிலிருந்த தமது கோட்டை ஒன்றுக்கு வருமாறு (கிழக்கு) ரோமின் பிரமுகர்கள் அனைவருக்கும் ஆணையிட்டார். (அவர்கள் வந்து சேர்ந்ததும்) அந்தக் கோட்டையின் கதவுகளையெல்லாம் பூட்டிவிடும்படி உத்தர விட்டார். அவ்வாறே அவை பூட்டப்பட்டன. பின்னர் ஹிரக்ளீயஸ் (அந்த அவையிலிருந்தவர்கள்) முன்தோன்றி, “ரோமானிய சமுதாயத்தாரே! உங்களுக்கு வெற்றியும் நல்வழியும் கிடைக்க வேண்டு மென்ற ஆசையும், உங்கள் ஆட்சி நீடிக்க வேண்டுமென்ற எண்ணமும் உங்களுக்கு உண்டா? இந்த இறைத் தூதரை ஏற்றுக்கொள்ளுங்கள்” என்று பேசினார். இதைக் கேட்ட மாத்திரத்தில் காட்டுக் கழுதைகள் வெருண்டோடுவதைப் போன்று கோட்டைக் கதவுகளை நோக்கி அவர்கள் வெருண்டோடி, கதவுகளை நெருங்கியதும் அவை தாளிடப்பட்டி ருக்கக் கண்டனர். அவர்கள் வெருண் டோடுவதைப் பார்த்த ஹிரக்ளீயஸ் (நபி (ஸல்) அவர்கள்மீது) இந்த மக்கள் விசுவாசம் கொள்ளமாட்டார்கள் என்று நிராசையானபோது, “அவர்களை என்னிடம் திருப்பியனுப்புங்கள்” என்று (காவலர்களை நோக்கிச்) சொன்னார். (அவர்கள் திரும்பி வந்ததும்) “நீங்கள் உங்கள் மதத்தின் மீது கொண்டுள்ள பிடிப்பைச் சோதிக்கவே நான் சற்று முன்னர் அவ்வாறு பேசினேன். இப்போது (உங்கள் உறுதியை) அறிந்துகொண்டேன்” என்று கூறினார். உடனே (ரோமர்களின் வழக்கப்படி) அனைவரும் அவருக்குச் சிரம்பணிந்தனர். அவரைக் குறித்துத் திருப்தியும் அடைந்தனர். இதுவே (மன்னர்) ஹிரக்ளீயஸின் இறுதி நிலைப்பாடாக இருந்தது.14 இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		}
	]
}