{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"12": "Fear Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "ஷுஐப் பின் அபீஹம்ஸா (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்களிடம், “நபி (ஸல்) அவர்கள் அச்சநேரத் தொழுகை (ஸலாத்துல் ஃகவ்ஃப்) தொழுதுள்ளார்களா?” என்று கேட்டேன். அதற்கு சா-ம் (ரஹ்) அவர்கள் தம் தந்தை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடமிருந்து அறிவித்த (பின்வரும்) ஹதீஸை ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறினார்கள்: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் (‘தாத்துர் ரிகாஉ’ எனும்) போருக்காக நஜ்தை நோக்கிப் புறப்பட்டுச் சென்றேன். அங்கு நாங்கள் எதிரிகளை எதிர்கொண்டு அவர்களுக்காக அணி வகுத்து நின்றோம். (போர் நடக்காவிட்டா லும் பீதி நிலவிக்கொண்டிருந்த அந்தப் போர் முனையில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு அஸ்ர் தொழுகை தொழுவிப்பதற்காக நின்றார்கள். (எங்களில்) ஓர் அணியினர் நபி (ஸல்) அவர்களுடன் (தொழுகையில்) நின்றனர். மற்றோர் அணியினர் எதிரிகளை நோக்கி நின்றனர். நபி (ஸல்) அவர்கள் தம்மோடு இருந்த வர்களுடன் ருகூஉ செய்து இரு சஜ்தாக் கள் செய்தார்கள். பிறகு (நபியவர்களுடன் தொழுத) அந்த அணியினர், தொழாமல் (எதிரிகளைக் கண்காணித்துக்கொண்டு) இருந்த மற்றோர் அணியினரின் இடத்துக் குச் சென்றுவிட்டனர். அந்த அணியினர் வந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்த அணியினருடன் ஒரு ருகூஉம் இரு சஜ்தாக்களும் செய்தார்கள்; பிறகு சலாம் கொடுத்தார்கள். பிறகு அவர்களில் ஒவ்வொருவரும் எழுந்து ஒரு ருகூஉம் இரண்டு சஜ்தாக்களும் செய்து (மீதியிருந்த ஒரு ரக்அத்தைத்) தமக்காக நிறைவேற்றிக்கொண்டனர். அத்தியாயம் : 12",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: “முஸ்லிம் வீரர்கள் (தனியாகப் பிரிந்து வர முடியாத அளவுக்கு எதிரிகளுடன்) கலந்துவிட்டால், நின்றவர்களாகவே (சைகை செய்து) தொழுதுகொள்வார்கள்” என இப்னு உமர் (ரலி) அவர்கள் கூறி னார்கள். முஜாஹித் (ரஹ்) அவர்களின் கூற் றைப் போன்றே இப்னு உமர் (ரலி) அவர் களின் மேற்கண்ட கூற்றும் அமைந்துள் ளது. ஆனால், இப்னு உமர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடமிருந்து கூடுத லாகப் பின்வருமாறு அறிவித்துள்ளார்கள்: எதிரிகள் இதைவிடவும் அதிகமாக இருந்தால் நின்றுகொண்டோ ஊர்தியில் அமர்ந்துகொண்டோ அவர்கள் தொழுது கொள்ளட்டும். அத்தியாயம் : 12",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (போர்க் களத்தில் அச்சநேரத்) தொழுகைக்காக நின்றார்கள். மக்களும் (இரு வரிசைகளில்) அவர்களுடன் நின்றுகொண்டனர். நபி (ஸல்) அவர்கள் தக்பீர் கூற அனைவரும் தக்பீர் கூறினர். நபி (ஸல்) அவர்கள் ருகூஉ செய்தபோது, அவர்களில் (முதல் வரிசையில் நின்ற) சிலர் (மட்டும்) ருகூஉ செய்தனர். நபி (ஸல்) அவர்கள் சஜ்தா செய்தபோது அவர்களும் அவர்களுடன் சஜ்தா செய்தனர். பிறகு இரண்டாவது ரக்அத்திற்காக நபி (ஸல்) அவர்கள் எழுந்தபோது, நபி (ஸல்) அவர்களுடன் (முதலாவது ரக்அத்தில்) சஜ்தா செய்தவர்கள் எழுந்து (இரண்டா வது வரிசைக்குச் சென்று நின்று கொண்டு) தம் சகோதரர்களைப் பாதுகாக்கும் பணியில் ஈடுபட்டனர். (இரண்டாவது வரிசையில் நின்றுகொண்டிருந்த) அந்த அணியினர் (முதல் வரிசைக்கு) வந்து நபி (ஸல்) அவர்களுடன் ருகூஉம் சஜ்தாவும் செய்தனர். மக்கள் அனைவரும் தொழுகை யில்தான் ஈடுபட்டிருந்தனர். ஆயினும், ஒருவரையொருவர் பாதுகாத்துக்கொண்டி ருந்தனர். அத்தியாயம் : 12",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அகழ்ப் போரின்போது உமர் (ரலி) அவர்கள் குறைஷி இறைமறுப்பாளர்களை ஏசிக்கொண்டே வந்து, “அல்லாஹ்வின் தூதரே! சூரியன் மறையும் நேரம் நெருங்கி யும் என்னால் அஸ்ர் தொழுகையைத் தொழ முடியாமற் போய்விட்டது” என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நானும் தான் இதுவரை அத்தொழுகையைத் தொழவில்லை” என்று சொன்னார்கள். பிறகு நபி (ஸல்) அவர்கள் ‘புத்ஹான்’ எனும் பள்ளத்தாக்கில் இறங்கி அங்கத் தூய்மை (உளூ) செய்துவிட்டு, சூரியன் மறைந்தபின் அஸ்ர் தொழுகையைத் தொழு(வித்)தார்கள். பின்னர் மஃக்ரிப் தொழுகையைத் தொழு(வித்)தார்கள் அத்தியாயம் : 12",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அகழ்ப் போரி-ருந்து திரும்பியபோது நபி (ஸல்) அவர்கள் எங்களிடம், “பனூ குறைழா குலத்தார் வசிக்குமிடத்தை நீங்கள் அடையாத வரை (உங்களில்) யாரும் அஸ்ர் தொழுகையைத் தொழ வேண்டாம்” என்று கூறினார்கள். வழியிலேயே அஸ்ர் நேரத்தை மக்கள் சிலர் அடைந்தனர். அப்போது சிலர், “பனூ குறைழா குலத்தாரை அடையாத வரை நாம் அஸ்ர் தொழுகையைத் தொழ மாட்டோம்” என்று கூறினர். வேறுசிலர், “(தொழுகை நேரம் தவறிப்போனாலும் தொழ வேண்டாம் என்ற) அந்த அர்த்தத்தில் நபி (ஸல்) அவர்கள் நம்மிடம் (அவ்வாறு) கூறவில்லை; (‘வேகமாக அங்கு போய்ச் சேருங்கள்’ என்ற கருத்தில்தான் இந்த வார்த்தையைக் கூறினார்கள்). எனவே, நாம் தொழுவோம்” என்று கூறினர். நபி (ஸல்) அவர்களிடம் இரு சாரார் குறித்தும் தெரிவிக்கப்பட்டபோது அவர்களில் எவரையும் அவர்கள் குறைகூறவில்லை.7 அத்தியாயம் : 12",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (கைபருக்கு அருகில் ஓரிடத்தில்) சுப்ஹு தொழுகையை இருள் இருக்கும்போதே (அதன் ஆரம்ப நேரத்தில்) தொழு(வித்)தார் கள். பிறகு (கைபரை நோக்கிப்) பயணமா னார்கள். (கைபருக்குள் அவர்கள் பிரவேசித்தபோது) “அல்லாஹு அக்பர் (அல்லாஹ் மிகப் பெரியவன்); கைபர் பாழா(வது உறுதியா)கிவிட்டது. நாம் ஒரு சமுதாயத்தின் களத்தில் (அவர்களுடன் போரிட) இறங்குவோமாயின், எச்சரிக்கப் பட்ட அவர்களுக்கு அது மிகக் கெட்ட காலையாக அமையும்” என்று (மூன்று முறை) கூறினார்கள். (முஸ்-ம்களைக் கண்ட) கைபர்வாசி கள் வீதிகளில் ஓடிக்கொண்டே, “முஹம்ம தும் அவருடைய ஐந்து அணிகள் கொண்ட படையும் (வருகின்றனர்)” என்று கூறினர். அப்போது நபி (ஸல்) அவர்கள் தாக்குதலைத் தொடங்கி தம்முடன் போரிட்டவர்களை வீழ்த்தினார்கள். (போரில் கலந்துகொள்ளாத) அவர்களுடைய குடும்பத்தாரைக் கைது செய்(து தம் வீரர்களிடையே ஒப்படைத்)தார்கள். அப்போது (பனூ குறைழா, பனூ நளீர் குலங்களின் தலைவரின் புதல்வியான) ஸஃபிய்யா அவர்கள் திஹ்யா அல்கல்பீ (ரலி) அவர்களிடம் (அன்னாரின் போர்ச் செல்வத்தின் பங்காகப்) போய்ச்சேர்ந்தார்கள். (பிறகு) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு (அவர்கள் கேட்டுக்கொண்டதற்கிணங்க) சொந்தமானார்கள். பின்னர் அவரது விடுதலையையே மணக் கொடையாக்கி அவரை நபி (ஸல்) அவர்கள் மணமுடித்துக்கொண்டார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், அப்துல் அஸீஸ் பின் ஸுஹைப் (ரஹ்) அவர்கள் கூறுகிறார்கள்: இந்த ஹதீஸை ஸாபித் அல்புனானீ (ரஹ்) அவர்கள் அறிவித்தபோது அவர்களிடம், “அபூமுஹம்மதே! நபி (ஸல்) அவர்கள் ஸஃபிய்யாவுக்கு என்ன மணக்கொடை (மஹ்ர்) கொடுத்தார்கள் என்று அனஸ் (ரலி) அவர்களிடம் நீங்கள் கேட்டீர்களா?” என நான் வினவினேன். அதற்கு ஸாபித் (ரஹ்) அவர்கள், “அவரையே (அதாவது அவரை விடுதலை செய்வதையே) அவருக்கு மணக்கொடையாக ஆக்கினார்கள்” என்று கூறிவிட்டுப் புன்னகைத்தார்கள். அத்தியாயம் : 12",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		}
	]
}