{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1040,
			"arabicnumber": 1040,
			"text": "அபூபக்ரா (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் இருந்துகொண்டிருந்தோம். அப்போது சூரிய கிரகணம் ஏற்பட்டது. உடனே நபி (ஸல்) அவர்கள் எழுந்து தமது மேலாடையை இழுத்துக்கொண்டே பள்ளிவாசலுக்குள் சென்றார்கள். நாங்க ளும் சென்றோம். (கிரகணம் விலகி) வெளிச்சம் வரும்வரை எங்களுக்கு இரண்டு ரக்அத்கள் தொழுவித்தார்கள். பிறகு, “யாருடைய இறப்புக்காகவும் சூரிய கிரகணமோ சந்திர கிரகணமோ ஏற்படுவதில்லை. எனவே, அவற்றை நீங்கள் கண்டால், உங்களுக்கு ஏற்பட்ட (கிரகணமான)து அகற்றப்படும்வரை நீங்கள் தொழுங்கள்; பிரார்த்தியுங்கள்” என்று கூறினார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மனிதர்களில் யாருடைய இறப்புக்காக வும் சூரிய கிரகணமோ சந்திர கிரகணமோ ஏற்படுவதில்லை. ஆயினும், அவை அல்லாஹ்வின் சான்றுகளில் இரு சான்று களாகும். எனவே, அவற்றை நீங்கள் கண் டால் எழுந்து, (இறையைத்) தொழுங்கள். இதை அபூமஸ்ஊத் (உக்பா பின் அம்ர் - ர-) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1042,
			"arabicnumber": 1042,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யாருடைய இறப்புக்காகவும் பிறப்புக் காகவும் சூரிய கிரகணமோ சந்திர கிரகணமோ ஏற்படுவதில்லை. ஆயினும், அவை அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். எனவே, அவற்றை நீங்கள் கண்டால் (இறைவனைத்) தொழுங்கள். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1043,
			"arabicnumber": 1043,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. அன்றைய தினம் (நபி (ஸல்) அவர்களின் புதல்வர்) இப்ராஹீம் (ரலி) இறந்தார். இதையொட்டி மக்கள் “இப்ராஹீமின் இறப்புக்காகத்தான் சூரிய கிரகணம் ஏற்பட்டது” என்று பேசிக் கொண்டனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “யாருடைய இறப்புக்காகவும் யாருடைய பிறப்புக்காகவும் சூரிய கிரகணமோ சந்திர கிரகணமோ ஏற்படுவ தில்லை. எனவே, அவற்றை நீங்கள் கண்டால் (பிரகாசம் வரும்வரை) தொழுங் கள்; அல்லாஹ்விடம் பிரார்த்தியுங்கள்” என்று கூறினார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1044,
			"arabicnumber": 1044,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களுக்குத் தொழுகை நடத்தினார்கள். அதில் நீண்ட நேரம் நிலையில் நின்றார்கள். பிறகு ருகூஉ செய்தார்கள். அந்த ருகூஉவை நீண்ட நேரம் செய்தார்கள். பிறகு (ருகூஉவி-ருந்து) எழுந்து நின்றார்கள். அந்த நிலையை நீண்ட நேரம் செய்தார்கள். -இந்த நிலையானது முதல் நிலையை விடச் சிறியதாகவே இருந்தது.- பிறகு (மீண்டும்) ருகூஉ செய்தார்கள். அதை நீண்ட நேரம் செய்தார்கள் -அது முதல் ருகூவைவிடக் குறைவாக இருந்தது- பிறகு சஜ்தா (சிரவணக்கம்) செய்தார்கள். அந்த சஜ்தாவையும் நீண்ட நேரம் செய்தார்கள். பின்னர் முதல் ரக்அத்தில் செய்ததைப் போன்றே இரண்டாவது ரக்அத்திலும் செய்தார்கள். (கிரகணம் விலகி) வெளிச்சம் வந்துவிட்டிருந்த நிலையில் தொழுகையை முடித்தார்கள். பிறகு அவர்கள் மக்களுக்கு உரை யாற்றினார்கள். அவர்கள் (தமது உரையில்), “சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். எவரது இறப்புக்காகவும் எவரது பிறப்புக்காகவும் கிரகணம் ஏற்படுவதில்லை. அதை நீங்கள் கண்டால், அல்லாஹ்விடம் பிரார்த்தனை புரியுங்கள்; தக்பீர் சொல்லுங்கள்; தொழுங் கள்; தான தர்மம் செய்யுங்கள்” என்று கூறினார்கள். பிறகு, “முஹம்மதின் சமுதாயமே! அல்லாஹ்வின் மீதாணையாக! தன் அடியார்களில் ஆணோ பெண்ணோ யார் விபசாரத்தில் ஈடுபடுவதைக் கண்டாலும் அல்லாஹ்வைவிடக் கடுமையாக ரோஷம் கொள்பவர் வேறெவருமிலர். முஹம்மதின் சமுதாயமே! அல்லாஹ் வின் மீதாணையாக! நான் அறிவதை யெல்லாம் நீங்களும் அறிந்தால் குறை வாகச் சிரிப்பீர்கள்; அதிகமாக அழுவீர் கள்!” என்று கூறினார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1045,
			"arabicnumber": 1045,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் காலத்தில் சூரிய கிரகணம் ஏற்பட்டபோது, ‘அஸ்ஸலாத்து ஜாமிஆ’ (தொழுகை நடைபெறுகிறது) என்று அழைப்பு விடுக்கப்பட்டது. அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "நபி (ஸல்) அவர்களின் துணைவி யார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களது ஜீவிய காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. உடனே அவர்கள் பள்ளிவாசலுக்குப் புறப்பட்டுச் சென்றார்கள். அவர்களுக்குப் பின்னால் மக்கள் அணிவகுத்து நின்றனர். நபி (ஸல்) அவர்கள் ‘தக்பீர் (தஹ்ரீமா)’ கூறி, நீண்ட நேரம் (குர்ஆன் வசனங்களை) ஓதினார்கள். பிறகு தக்பீர் கூறி, நீண்ட நேரம் ருகூஉ செய்தார்கள். பின்னர் ‘சமிஅல்லாஹு -மன் ஹமிதஹ்’ (அல்லாஹ் தன்னைப் புகழ்ந்தோரின் புகழுரையை ஏற்றுக்கொள்கிறான்) என்று கூறி நிலையில் நின்றார்கள். சஜ்தாவுக்குச் செல்லாமல் நீண்ட நேரம் (குர்ஆன்) ஓதினார்கள். ஆனால், இது முத-ல் ஓதியதைவிடக் குறைந்த நேரமே அமைந்திருந்தது. பிறகு தக்பீர் கூறி ருகூஉ செய்தார்கள். இந்த ருகூஉ முதல் ருகூஉவைவிடக் குறைந்த நேரமே அமைந்திருந்தது. பின்னர் ‘சமிஅல்லாஹு -மன் ஹமிதஹ், ரப்பனா வ ல(க்)கல் ஹம்து’ என்று கூறி (எழுந்து)விட்டு, சஜ்தா செய்தார்கள். பிறகு இதைப் போன்றே மற்றொரு ரக்அத்திலும் செய்தார்கள்.- இவ்வாறு நான்கு சஜ்தாக்(கள் கொண்ட இரண்டு ரக்அத்)களில் நான்கு ருகூஉகள் செய்து முடித்தார்கள். அவர்கள் தொழுகையை முடிப்பதற்குமுன் (கிரகணம் விலகி) வெளிச்சம் வந்துவிட்டது. பிறகு நபி (ஸல்) அவர்கள் எழுந்து, இறைவனை அவனுக்குத் தகுதியான தன்மைகளைக் கூறிப் போற்றி(யபின் உரை நிகழ்த்தி)னார்கள். அவர்கள் (தமது உரையில்), “(சூரியன் மற்றும் சந்திரன்) இவ்விரண்டும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். எவரது இறப்புக்காகவும் எவரது பிறப்புக்காகவும் கிரகணங்கள் ஏற்படுவதில்லை. அவற்றை நீங்கள் கண்டால் (கிரகணத்) தொழுகையில் கவனம் செலுத்துங்கள்” என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. (இதன் அறிவிப்பாளர்களில் ஒருவரான) இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் (எனக்கு இதை அறிவித்த) உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்களிடம், “மதீனாவில் சூரிய கிரகணம் ஏற்பட்ட தினம் உங்கள் சகோதரர் (அப்துல்லாஹ் பின் அஸ்ஸுபைர் - ர-) (தலா ஒரு ருகூஉ கொண்ட) இரண்டு ரக்அத்களைவிடக் கூடுதலாக்காமல் சுப்ஹு தொழுகை போன்று தொழுவித்தார்களே?” என்று கேட்டேன். அதற்கு உர்வா (ரஹ்) அவர்கள், “ஆம்! (அவர் அவ்வாறு தொழுவித்தார்.) அவர் நபிவழியைத் தவறவிட்டார்” என்று பதிலளித்தார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள் வாயிலாகவும் இதுபோன்ற ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவை கஸீர் பின் அப்பாஸ் (ரலி) அவர்கள் வழியாக வந்துள்ளன. அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1047,
			"arabicnumber": 1047,
			"text": "நபி (ஸல்) அவர்களின் துணைவி யார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சூரிய கிரகணம் (ஹசஃபத்) ஏற்பட்டபோது தொழுவித்தார்கள். அப்போது அவர்கள் நின்று ‘தக்பீர் (தஹ்ரீமா)’ கூறி, நீண்ட நேரம் (குர்ஆன் வசனங்களை) ஓதினார்கள். பிறகு நீண்ட நேரம் ருகூஉ செய்தார்கள். பின்னர் தலையை உயர்த்தி, ‘சமிஅல்லாஹு -மன் ஹமிதஹ்’ என்று கூறி முன்பு போன்றே நிலையில் நின்றார்கள். பிறகு நீண்ட நேரம் (குர்ஆன்) ஓதினார்கள். இ(ப்போது அவர்கள் ஓதிய)து முன்பு ஓதியதைவிடக் குறைவானதாகவே இருந்தது. பின்னர் நீண்ட நேரம் ருகூஉ செய்தார்கள். இந்த ருகூஉ முதலில் செய்த ருகூஉவைவிடக் குறைவானதாகவே இருந்தது. பிறகு நீண்ட நேரம் சஜ்தா செய்தார்கள். பின்னர் இதைப் போன்றே மற்றொரு ரக்அத்திலும் செய்தார்கள். பிறகு (கிரகணம் விலகி) சூரியன் பிரகாசித்து விட்டிருந்த நிலையில் ‘சலாம்’ கொடுத் தார்கள். பிறகு அவர்கள் மக்களுக்கு உரை நிகழ்த்தினார்கள். சூரிய, சந்திர கிரகணங் கள் பற்றி அவர்கள் குறிப்பிடுகையில், “அவ்விரண்டும் அல்லாஹ்வின் சான்று களில் இரு சான்றுகளாகும். எவரது இறப்புக்காகவும் எவரது பிறப்புக்காகவும் கிரகணங்கள் ஏற்படுவதில்லை. அவற்றை நீங்கள் கண்டால் தொழுகையில் கவனம் செலுத்துங்கள்” என்று கூறினார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1048,
			"arabicnumber": 1048,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். எவரது இறப்புக்காகவும் எவரது பிறப்புக்காகவும் சூரிய, சந்திர கிரகணங்கள் ஏற்படுவதில்லை. மாறாக, அவற்றின் மூலம் உயர்ந்தோன் அல்லாஹ் தன் அடியார்களை எச்சரிக் கிறான்.7 இதை அபூபக்ரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஏழு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: யூனுஸ் பின் உபைத் (ரஹ்) அவர் களிடமிருந்து அப்துல் வாரிஸ் (ரஹ்), ஷுஅபா பின் அல்ஹஜ்ஜாஜ் (ரஹ்), கா-த் பின் அப்தில்லாஹ் (ரஹ்), ஹம்மாத் பின் சலமா (ரஹ்) ஆகியோர் அறிவிக்கும் அறிவிப்புகளில், “அவற்றின் மூலம் அல்லாஹ் தன் அடியார்களை எச்சரிக்கிறான்” எனும் வாக்கியம் இடம்பெறவில்லை. அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1050,
			"arabicnumber": 1050,
			"text": "பின்னர் (ஒரு நாள்) காலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஊர்தியில் ஏறிப் புறப்பட்டார்கள். அப்போது சூரிய கிரகணம் ஏற்பட்டு விடவே, உடனே அவர்கள் முற்பகல் நேரத்தில் திரும்பி வந்தார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் துணைவியர் வசிக்கும்) அறைகளைக் கடந்து சென்று (கிரகணத் தொழுகை) தொழ நின்றார்கள். அவர்களுக்குப் பின்னால் மக்களும் (அணிவகுத்து) நின்றனர். (அத்தொழுகையில்) நீண்ட நேரம் அவர்கள் நிலையில் நின்றார்கள். பிறகு நீண்ட நேரம் ருகூஉ செய்தார்கள். பின்னர் (ருகூஉவி-ருந்து) நிமிர்ந்து நீண்ட நேரம் நிலையில் நின்றார்கள். இ(ந்த நிலையான)து முதல் நிலையைவிடக் குறைவானதாகவே இருந்தது. பிறகு நீண்ட நேரம் ருகூஉ செய்தார்கள். இந்த ருகூஉ முதல் ருகூஉவைவிடக் குறைவானதாகவே இருந்தது. பிறகு (ருகூஉவி-ருந்து) நிமிர்ந்து சஜ்தாவுக்குச் சென்றார்கள். பிறகு (எழுந்து) நீண்ட நேரம் நிலையில் நின்றார்கள். இது முதல் நிலையைவிடக் குறைவானதாகவே இருந்தது. பின்னர் நீண்ட நேரம் ருகூஉ செய்தார்கள். இந்த ருகூஉ முதல் ருகூஉவைவிடக் குறைவான தாகவே இருந்தது. பிறகு (ருகூஉவி-ருந்து) நிமிர்ந்து நீண்ட நேரம் நிலையில் நின்றார்கள். இந்த நிலை முந்திய நிலையை விடக் குறைவானதாகவே இருந்தது. பின்னர் நீண்ட நேரம் ருகூஉ செய்தார்கள். இது முந்திய ருகூஉவைவிடக் குறைவான தாகவே இருந்தது. பிறகு (ருகூஉவி-ருந்து) நிமிர்ந்து சஜ்தாவுக்குச் சென்றார்கள். தொழுது முடித்தபின் அல்லாஹ் சொல்ல நாடியிருந்ததைச் சொன்னார்கள். பிறகு மண்ணறையின் (கப்று) வேதனை யி-ருந்து பாதுகாப்புக் கோருமாறு மக்களைப் பணித்தார்கள். அத்தியாயம் :",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் சூரிய கிரகணம் ஏற்பட்ட போது, ‘இன்னஸ் ஸலாத்த ஜாமிஆ’ (தொழுகை நடைபெறுகிறது) என்று (மக்களுக்கு) அறிவிப்புச் செய்யப்பட்டது. நபி (ஸல்) அவர்கள் ஒரு ரக்அத்தில் இரண்டு ருகூஉகள் செய்தார்கள். பின்னர் (அடுத்த ரக்அத்தில்) எழுந்து (மீண்டும்) ஒரு ரக்அத்தில் இரண்டு ருகூஉகள் செய்தார்கள். பின்னர் (அத்தஹிய்யாத்தில்) அமர்ந்தார்கள். பின்னர் கிரகணமும் விலகியது. ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: அதைவிட நீண்ட நேரம் நான் ஒருபோதும் சஜ்தா செய்ததில்லை. அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் சூரிய கிரகணம் ஏற்பட் டது. அப்போது அவர்கள் (ஜமாஅத்தாக கிரகணத் தொழுகை) தொழுவித்தார்கள். அத்தொழுகையில் ‘அல்பகரா’ (2ஆவது) அத்தியாயம் போன்ற (பெரிய அத்தி யாயத்)தை ஓதும் அளவுக்கு நீண்ட நேரம் நிலையில் நின்றார்கள். பிறகு நீண்ட நேரம் ருகூஉ செய்தார்கள். பிறகு (ருகூஉவி-ருந்து) நிமிர்ந்து நீண்ட நேரம் நிலையில் நின்றார்கள். இந்த நிலை முந்திய நிலையைவிடக் குறைவானதாக இருந்தது. பிறகு நீண்ட நேரம் ருகூ செய்தார்கள் அந்த ருகூஉ முந்திய ருகூஉவைவிடக் குறைவானதாக இருந்தது. பின்னர் சஜ்தா செய்தார்கள். பிறகு (சஜ்தாவி-ருந்து) எழுந்து (இரண்டாவது ரக்அத்தில்) நீண்ட நேரம் நிலையில் நின்றார்கள். இந்த நிலை முந்திய நிலையைவிடக் குறைவானதாக இருந்தது. பிறகு நீண்ட நேரம் ருகூஉ செய்தார்கள். இந்த ருகூஉ முந்திய ருகூஉவைவிடக் குறைவானதாகவே இருந்தது. பிறகு (ருகூஉவி-ருந்து) நிமிர்ந்து வெகு நேரம் நிலையில் நின்றார்கள். இது முந்திய நிலையைவிடக் குறைவானதாகவே இருந்தது. பின்னர் நீண்ட நேரம் ருகூஉ செய்தார்கள். இது முந்திய ருகூஉவைவிடக் குறைவானதாக இருந்தது. பிறகு சஜ்தா செய்தார்கள். (கிரகணம் விலகி) வெளிச்சம் வந்துவிட்டிருந்த நிலையில் தொழுது முடித்தார்கள். அப்போது நபி (ஸல்) அவர்கள் (உரையாற்றுகையில்), “சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்று களாகும். எவரது இறப்புக்காகவும் பிறப்புக் காகவும் கிரகணங்கள் ஏற்படுவதில்லை. எனவே, இ(த்தகைய கிரகணத்)தை நீங்கள் கண்டால் அல்லாஹ்வை நினைவுகூருங் கள்” என்று கூறினார்கள். அப்போது மக்கள், “அல்லாஹ்வின் தூதரே! நீங்கள் (தொழுதுகொண்டிருக்கை யில் இதோ) இந்த இடத்தில் எதையோ பிடிக்க முயன்றதைக் கண்டோம். பிறகு (அந்த முயற்சியி-ருந்து) பின்வாங்கிய தையும் கண்டோமே! (அது ஏன்?)” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “நான் (தொழுதுகொண்டிருக்கையில்) சொர்க்கத்தைக் கண்டேன். (அதி-ருந்து பழக்)குலையொன்றை எடுக்க முயன்றேன். அது கிடைத்திருந்தால் இந்த உலகம் உள்ள வரை நீங்கள் அதை உண்டிருப்பீர்கள். மேலும், (நான் தொழுதுகொண்டிருக் கையில்) நரகம் எனக்குக் காட்டப்பட்டது. இன்றைய தினத்தைப் போன்று மிக பயங்கரமான காட்சி எதையும் ஒருபோதும் நான் கண்டதேயில்லை. நரகவாசிகளில் அதிகமாகப் பெண்களையே கண்டேன்” என்று கூறினார்கள். மக்கள், “ஏன் (அது), அல்லாஹ்வின் தூதரே?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “பெண்களின் நிராகரிப்பே காரணம்” என்றார்கள். அப்போது “அல்லாஹ்வையா பெண்கள் நிராகரிக்கிறார்கள்?” என்று வினவப்பட்டது. அதற்கு “கணவன்மார்களை நிராகரி(த்து நிந்தி)க்கிறார்கள். (கணவர் செய்த) உதவிகளுக்கு நன்றிகாட்ட மறுக்கிறார்கள். காலமெல்லாம் ஒருத்திக்கு நீ உதவி செய்து, பிறகு உன்னிடம் ஏதேனும் (குறை) ஒன்றை அவள் கண்டால், ‘உன்னிடமிருந்து எந்த நன்மையையும் ஒருபோதும் நான் கண்டதேயில்லை’ என்று சொல்-விடுவாள்” எனப் பதிலளித்தார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "ஃபாத்திமா பின்த் அல்முன்திர் (ரஹ்) அவர்கள் கூறியதாவது: அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்கள் கூறினார்கள்: ஒரு சூரிய கிரகணத்தின் போது நான் நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்களி டம் சென்றேன். அப்போது மக்கள் நின்று (கிரகணத் தொழுகை) தொழுதுகொண்டி ருந்தனர். அப்போது (அவர்களுடன்) ஆயிஷா (ரலி) அவர்களும் நின்று தொழுதுகொண்டிருந்தார்கள். நான் (ஆயிஷா (ரலி) அவர்களிடம்), “மக்க ளுக்கு என்னவாயிற்று?” என்று கேட் டேன். அதற்கு ஆயிஷா (ரலி) அவர்கள் தமது கையால் வானை நோக்கி சைகை செய்து, ‘சுப்ஹானல்லாஹ்’ (அல்லாஹ் தூயவன்) என்று கூறினார்கள். நான், “ஏதேனும் அடையாளமா?” என்று கேட்டேன். அதற்கு அவர்கள், ‘ஆம்’ என்பது போன்று சைகை செய்தார் கள். உடனே நானும் (தொழுகையில் நீண்ட நேரம்) நின்றேன். எனக்கு கிறக் கமே வந்துவிட்டது. (கிறக்கம் நீங்க) நான் என் தலையில் தண்ணீரை ஊற்றலானேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுது முடித்ததும் அல்லாஹ்வைப் போற்றிப் புகழ்ந்துவிட்டுக் கூறினார்கள்: நான் இதோ இந்த இடத்தில் (தொழுதவாறு) நின்றுகொண்டிருக்கையில் சொர்க்கம் மற்றும் நரகம் உள்பட இதுவரை நான் பார்த்திராத அனைத்தையும் பார்த்தேன். நீங்கள் (உங்கள் அடக்கக் குழிகளில்) மகாக் குழப்பவாதியான தஜ்ஜா-ன் ‘குழப்பத்தைப் போன்ற’ அல்லது ‘அதற்கு நிகரான’ குழப்பத்துக்கு உள்ளாக்கப்படுவீர்கள் என எனக்கு ‘வஹீ’ (இறைச்செய்தி) அறிவிக்கப்பட்டது. - (‘குழப்பத்தைப் போன்ற’ அல்லது ‘அதற்கு நிகரான’ என்பதில் எதை அஸ்மா (ரலி) அவர்கள் அறிவித்தார்கள் என்று எனக்குத் தெரியவில்லை என இதன் அறிவிப்பாளரான ஃபாத்திமா பின்த் அல்முன்திர் ஐயப்படுகிறார்.)- (நீங்கள் அடக்கக் குழிகளில் இருக்கும் போது) உங்களில் ஒருவரிடம் (என்னைக் காட்டி) “இம்மனிதரைப் பற்றி நீ என்ன அறிந்துள்ளாய்?” என்று வினவப்படும். அதற்கு ‘இறைநம்பிக்கையாளரோ’ அல்லது ‘(இறைத்தூதின் மீது) உறுதி கொண்டிருந்தவரோ’ -(இந்த இரண்டில் அஸ்மா (ரலி) அவர்கள் எதைச் சொன் னார்கள் என அறிவிப்பாளர் ஃபாத்திமா பின்த் அல்முன்திர் ஐயம் தெரிவிக்கிறார்.)- “இவர் அல்லாஹ்வின் தூதர் முஹம்மத் (ஸல்) அவர்கள் ஆவார்கள். அன்னார் எங்களிடம் சான்றுகளையும் நல்வழியை யும் கொண்டு வந்தார்கள். நாங்கள் (அவர்களின்) அழைப்பை ஏற்றோம்; (அவர்களை) நம்பினோம்; பின்பற்றினோம்” என்று பதிலளிப்பார். அப்போது அவரிடம், “நலமுடன் உறங்குவீராக! நீர் (உலகில் வாழ்ந்தபோதும் அவரை) நம்பிக்கைகொண்டிருந்தீர் என்பதை நாங்கள் அறிந்திருந்தோம்” என்று கூறப்படும். ‘நயவஞ்சகனோ’ அல்லது ‘(என்னைப் பற்றி) சந்தேகத்துடன் இருந்தவனோ’ -(இவ்விரண்டில் அஸ்மா (ரலி) அவர்கள் எதைச் சொன்னார்கள் என்று எனக்குத் தெரியவில்லை.)- (அந்த வினாவிற்கு) “(அவரை) எனக்குத் தெரியாது; மக்கள் ஒன்றைச் சொல்லக் கேட்டேன். நானும் அதையே சொன்னேன்” என்று பதிலளிப்பான். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "அஸ்மா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், சூரிய கிரகணத் தின்போது அடிமைகளை விடுதலை செய்யும்படி உத்தரவிட்டுள்ளார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: எவரது இறப்புக்காகவும் பிறப்புக்காகவும் சூரிய கிரகணமும் சந்திர கிரகணமும் ஏற்படுவதில்லை. மாறாக அவை, அல்லாஹ்வின் சான்றுகளில் இரு சான்று களாகும். கிரகணத்தை நீங்கள் கண்டால் (இறைவனைத்) தொழுங்கள். இதை அபூமஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எழுந்து, மக்களுக்குத் தொழுகை நடத்தினார்கள். அதில் நீண்ட நேரம் (குர்ஆன்) ஓதினார்கள். பிறகு ருகூஉ செய்தார்கள்; ருகூவை நீண்ட நேரம் செய்தார்கள். பிறகு தலையை உயர்த்தி (மீண்டும் குர்ஆன்) ஓதினார்கள். அது முதலில் ஓதியதைவிடக் குறைவாகவே இருந்தது. பிறகு (மீண்டும்) ருகூஉ செய்தார்கள்; முதல் ருகூவைவிடக் குறைவாகவே அதை நீட்டினார்கள். பிறகு தலையை உயர்த்தி இரு முறை சிரவணக்கம் (சஜ்தா) செய்தார்கள். பின்னர் எழுந்து, முதல் ரக்அத்தில் செய்ததைப் போன்றே இரண்டாவது ரக்அத்திலும் செய்தார்கள். பிறகு எழுந்து (உரையாற்றியபோது), “யாருடைய இறப்புக்காகவும் சூரியனுக்கோ சந்திரனுக்கோ கிரகணம் ஏற்படுவதில்லை. மாறாக, அவை இரண்டும் இறைச்சான்றுகளில் இரு சான்றுகளாகும். தன் அடியார்களுக்கு அவற்றை இறைவன் காட்டுகின்றான். எனவே, அதை நீங்கள் காணும்போது, தொழுகைக்கு விரையுங்கள்” என்று சொன்னார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: சூரிய கிரகணம் ஏற்பட்டபோது நபி (ஸல்) அவர்கள் உலகமுடிவு நாள் வந்துவிட்டதோ என்று அஞ்சித் திடுக்குற்ற வர்களாக எழுந்து பள்ளிவாசலுக்குச் சென்றார்கள். நிற்றல், குனிதல், சிரவணக்கம் ஆகிய வற்றை நீண்ட நெடிய நேரம் செய்து தொழுதார்கள். நான் ஒருபோதும் அவர்கள் அவ்வாறு செய்யக் கண்டதில்லை. (தொழுகை முடிந்ததும்), “அல்லாஹ் அனுப்பிவைக்கும் இந்த அடையாளங்கள் எவரது இறப்புக்காகவும் எவரது பிறப்புக் காகவும் ஏற்படுவனவல்ல. எனினும், அல்லாஹ் தன் அடியார்களை இவற்றின் மூலம் எச்சரிக்கின்றான். இவற்றில் ஏதேனும் ஒன்றை நீங்கள் கண்டால், அல்லாஹ்வை நினைவுகூர்வதிலும் அவனிடம் பிரார்த்திப்பதிலும் அவனிடம் பாவமன்னிப்புக் கோருவதிலும் கவனம் செலுத்துங்கள்” என்று கூறினார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: (நபி (ஸல்) அவர்களின் புதல்வர்) இப்ராஹீம் (ரலி) அவர்கள் இறந்த நாளில் சூரிய கிரகணம் ஏற்பட்டது. இதையொட்டி மக்கள், “இப்ராஹீமின் இறப்புக்காகத்தான் கிரகணம் ஏற்பட்டது” என்று பேசிக் கொண்டனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். எவரது இறப்புக்காகவும் எவரது பிறப்புக்காகவும் அவற்றில் கிரகணம் ஏற்படுவதில்லை. எனவே, அவற்றை நீங்கள் கண்டால், பிரகாசம் வரும்வரை அல்லாஹ்விடம் பிரார்த்தி யுங்கள்; தொழுங்கள்” என்று சொன் னார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "அஸ்மா (ரலி) அவர்கள் கூறியதாவது: (கிரகணம் விலகி) சூரியன் பிரகாசித்து விட்டிருந்த நிலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையை முடித்தார்கள். பிறகு உரை நிகழ்த்தினார் கள். அவர்கள் (தமது உரையில்) இறைவனை அவனுக்குத் தகுதியானவற்றைக் கூறிப் புகழ்ந்தபின் ‘அம்மா பஅத்’ (இறைவாழ்த்துக்குப்பின்) எனக் கூறினார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "அபூபக்ரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. அப்போது அவர்கள் இரண்டு ரக்அத்கள் தொழுதார்கள்.9 அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "அபூபக்ரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. உடனே அவர்கள் தமது மேலாடையை இழுத்தபடியே பள்ளி வாசலைச் சென்றடைந்தார்கள். (தொழுது விட்டுச் சென்றிருந்த) மக்களும் அவர்களிடம் வந்து குழுமினர். அப்போது அவர்களுடன் நபி (ஸல்) அவர்கள் இரண்டு ரக்அத்கள் தொழுதார்கள். (கிரகணம் விலகி) சூரியன் ஒளிர்ந்த தும், “சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். எவரது இறப்புக்காகவும் அவற்றில் கிரகணம் ஏற்படுவதில்லை. இ(த்தகைய கிரகண மான)து ஏற்பட்டால், உங்களைவிட்டு இது அகற்றப்படும்வரை தொழுங்கள்; பிரார்த்தி யுங்கள்” என்று கூறினார்கள்.10 இவ்வாறு நபி (ஸல்) அவர்கள் கூறக் காரணம், (கிரகணம் ஏற்பட்ட தினம்) நபி (ஸல்) அவர்களுடைய புதல்வர் இப்ராஹீம் எனப்படுவார் இறந்துவிட்டார். இதையொட்டி மக்கள் (‘இப்ராஹீமின் இறப்புக்காகவே கிரகணம் ஏற்பட்டது’ என்று) பேசிக்கொண்டனர். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மக்களுக்குச் சூரிய கிரகணத் தொழுகை தொழுவித்த போது, இரண்டு ரக்அத்களில் நான்கு ருகூஉகள் செய்தார்கள். அதில் முந்திய முந்திய ருகூஉகள் (அடுத்தடுத்த ருகூஉ களைவிட) நீளமானவையாக இருந்தன. அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		}
	]
}