{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தஹஜ்ஜுத் தொழுவதற்காக இரவில் எழுந்ததும் பின்வருமாறு பிரார்த்திப்பார்கள்: அல்லாஹும்ம! ல(க்)கல் ஹம்து. அன்த்த கய்யிமுஸ் ஸமாவாத்தி, வல் அர்ளி, வமன் ஃபீ ஹின்ன. வல(க்)கல் ஹம்து. ல(க்)க முல்க்குஸ் ஸமாவாத்தி, வல்அர்ளி, வமன் ஃபீஹின்ன. வல(க்)கல் ஹம்து. அன்த்த நூருஸ் ஸமாவாத்தி வல்அர்ளி, வ மன் ஃபீஹின்ன. வல(க்)கல் ஹம்து. அன்த்த மலிக்குஸ் ஸமாவாத்தி வல்அர்ள். வல(க்)கல் ஹம்து. அன்த்தல் ஹக்கு. வ வஅது(க்)கல் ஹக்கு. வ லிகாஉக்க ஹக்குன். வ கவ்லு(க்)க ஹக்குன். வல்ஜன்னத்து ஹக்குன். வந்நாரு ஹக்குன். வந்நபிய்யூன ஹக்குன். வ முஹம்மதுன் (ஸல்) ஹக்குன். வஸ்ஸா அத்து ஹக்குன். அல்லாஹும்ம! ல(க்)க அஸ்லம்த்து, வ பி(க்)க ஆமன்த்து, வ அலை(க்)க தவக் கல்த்து, வ இலை(க்)க அனப்த்து, வ பி(க்)க காஸம்த்து, வ இலை(க்)க ஹாகம்த்து. ஃபக்ஃபிர்லீ மா கத்தம்த்து, வ மா அக்கர்த்து, வ மா அஸ்ரர்த்து, வமா அஃலன்த்து. அன்த்தல் முகத்திமு, வ அன்த்தல் முஅக்கிரு. லா இலாஹ இல்லா அன்த்த; அல்லது லா இலாஹ ஃகைருக்க. (பொருள்: இறைவா! உனக்கே புகழ் அனைத்தும். வானங்கள், பூமி, அவற்றில் உள்ளவை ஆகிய அனைத்தையும் நிர்வகிப்பவன் நீயே! உனக்கே புகழ் அனைத்தும். வானங்கள், பூமி, அவற்றில் உள்ளவை ஆகிய அனைத்தின் ஆட்சி யும் உனக்கே! உனக்கே புகழ் அனைத்தும். வானங்கள், பூமி, அவற்றில் உள்ளவை ஆகிய அனைத்தின் ஒளி நீயே! உனக்கே புகழ் அனைத்தும். வானங்கள் மற்றும் பூமிக்கு அரசன் நீயே! உனக்கே புகழ் அனைத்தும். நீ உண்மை. உன் வாக்குறுதி உண்மை. உனது சந்திப்பு உண்மை. உனது கூற்று உண்மை. சொர்க்கம் உண்மை. நரகம் உண்மை. நபிமார்கள் உண்மை. முஹம்மத் (ஸல்) அவர்கள் உண்மை. மறுமை உண்மை. இறைவா! உனக்கே கட்டுப்பட்டேன். உன்மீதே நம்பிக்கை கொண்டுள்ளேன். உன்னையே சார்ந்துள்ளேன். உன்னிடமே திரும்புகிறேன். உன்னிடமே வழக்காடு வேன். உன்னிடமே நீதி கேட்பேன். எனவே, நான் முந்திச் செய்த, பிந்திச் செய்கின்ற, இரகசியமாகச் செய்த, பகிரங்கமாகச் செய்த பாவங்கள் அனைத்தையும் மன்னிப்பாயாக! நீயே முற்படுத்துபவன். நீயே பிற்படுத்துபவன். உன்னைத் தவிர வேறு இறைவன் இல்லை.) இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில், அபூஉமய்யா அப்துல் கரீம் (ரஹ்) அவர்களின் அறிவிப்பில் ‘வ லா ஹவ்ல வலா குவ்வத்த இல்லா பில்லாஹ்’ (அல்லாஹ்வின் உதவியின்றி பாவத்திலிருந்து விலகவோ நன்மை புரியும் ஆற்றலோ இல்லை) என்று கூறுவார்கள் எனக் கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இரவில்) பதினொன்று ரக்அத்கள் தொழுவார்கள். அதுவே அவர்களின் (இரவுத்) தொழுகையாக இருந்தது. அவர்கள் (சஜ்தாவிலிருந்து) தலையை உயர்த்துவதற்குமுன், உங்களில் ஒருவர் ஐம்பது வசனங்கள் ஓதக்கூடிய நேரம் அத்தொழுகையில் ஒரு சஜ்தா செய்வார் கள். ஃபஜ்ர் தொழுகைக்கு முன்னால் இரண்டு ரக்அத்கள் (சுன்னத்) தொழுது விட்டு, (ஃபஜ்ர்) தொழுகைக்காகத் தம்மை அழைக்க தொழுகை அறிவிப்பாளர் (முஅத்தின்) தம்மிடம் வரும்வரை வலப் பக்கம் சாய்ந்து படுத்துக்கொண்டி ருப்பார்கள்.3 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "ஜுன்துப் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் நோய்வாய்ப்பட்ட போது, ஓர் இரவோ அல்லது இரண்டு இரவுகளோ (இரவுத் தொழுகைக்காக) அவர்கள் எழவில்லை.4 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "ஜுன்துப் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் (சில நாட்கள் ‘வஹீ’ கொண்டு) வரவில்லை. அப்போது குறைஷிக் குலத்தைச் சேர்ந்த ஒரு பெண் “இவரது ஷைத்தான் (இவரை கைவிட்டு விட்டான். எனவேதான்,) அவன் இவரிடம் வருவதில் தாமதம் ஏற்படுகிறது” என்று கூறினாள். அப்போதுதான், “முற்பகல்மீது சத்திய மாக! இருண்டுவிட்ட இரவின் மீது சத்தியமாக! (நபியே!) உம்முடைய இறைவன் உம்மைக் கைவிடவுமில்லை; கோபம் கொள்ளவுமில்லை” (93:1-3) எனும் வசனங்கள் அருளப்பெற்றன. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: ஓர் இரவில் நபி (ஸல்) அவர்கள் (திடீரென) விழித்தெழுந்து (பிரமிப்புடன்), “சுப்ஹானல்லாஹ் (அல்லாஹ் தூயவன்)! இன்றிரவு இறக்கிவைக்கப்பட்ட சோதனை கள்தான் என்ன? (இன்றிரவு) இறக்கி வைக்கப்பட்ட கருவூலங்கள்தான் என்ன?” என்று கூறிவிட்டு, (தம் துணைவியரை கருத்தில் கொண்டு) “இந்த அறைகளி லுள்ள பெண்களை எழுப்பிவிடுபவர் யார்? (அவர்கள் இறைவனைத் தொழட் டும்.) இவ்வுலகில் ஆடை அணிந்திருக்கும் எத்தனையோ பெண்கள் மறுவுலகில் நிர்வாணிகளாய் இருப்பார்கள்” என்று கூறினார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "அலீ பின் அபீதாலிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடமும் ஃபாத்திமா (ரலி) அவர் களிடமும் இரவு நேரத்தில் வந்து, “நீங்கள் இருவரும் (‘தஹஜ்ஜுத்’) தொழவில் லையா?” என்று கேட்டார்கள். நான், “அல்லாஹ்வின் தூதரே! எங்களது உயிர் அல்லாஹ்வின் கையில் உள்ளது. அவன் எங்களை (தூக்கத்திலிருந்து) எழுப்ப நினைத்தால் அவன் எழுப்பிவிடுவான்” என்று கூறினேன். இவ்வாறு நாம் கூறியதும் எனக்கு எந்த மறுமொழியும் கூறாமல் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் திரும்பிச் செல்லலானார்கள். அவர்கள் திரும்பிச் சென்றபோது தமது தொடையில் அடித்துக்கொண்டே, (நான் உடனடியாகப் பதில் சொன்னதை எண்ணி) “மனிதன் அதிகமாகத் தர்க்கம் செய்பவனாக இருக்கிறான்” என்று (18:54ஆவது வசனத்தைக்) கூறியபடியே சென்றார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குச் சில (கூடுதலான) வழிபாடுகளைச் செய்ய விருப்பம் இருந்தாலும்கூட, அவற்றைச் செய்யாமல் விட்டுவிடுவது உண்டு. (எங்கே தாம் செய்வதைப் போன்று) மக்களும் அவற்றைச் செய்ய, அவர்கள்மீது அவை கடமையாக்கப்பட்டு விடுமோ என்ற அச்சமே இதற்குக் காரணம். நான் ‘ளுஹா’ தொழுகை தொழுதுவரு கிறேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒருபோதும் ளுஹா தொழு(து நான் பார்த்)ததில்லை.5 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இரவுத் தொழுகையை) ஓர் இரவில் பள்ளிவாசலில் தொழுதார்கள். அவர் களைப் பின்பற்றி மக்களும் தொழுதனர். மறுநாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுதபோது, மக்களின் எண்ணிக்கை அதிகமானது. மூன்றாவது அல்லது நான்காவது இரவில் (அங்கு மக்கள் திரண்டபோது) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வரவில்லை. அதிகாலையானதும் “நீங்கள் செய்ததை நிச்சயாக நான் பார்த்(துக்கொண்டுதான் இருந்)தேன். இத்தொழுகை உங்கள் மீது கடமையாக்கப்பட்டுவிடுமோ என்று நான் அஞ்சியதுதான் உங்களிடம் வர விடாமல் என்னைத் தடுத்துவிட்டது” என்று கூறினார்கள். இது ஒரு ரமளான் மாதத்தில் நடந்ததாகும்.6 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ‘தம் பாதங்கள்’ அல்லது ‘தம் கணைக்கால்கள்’ வீங்கும் அளவுக்கு நின்று தொழுவார்கள். இதுபற்றி அவர்களிடம் கேட்கப்படும்போது, “நான் நன்றியுள்ள அடியானாக இருக்க வேண்டாமா?” என்று கேட்பார்கள்.7 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: என்னிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வுக்கு மிகவும் விருப்பமான தொழுகை தாவூத் (அலை) அவர்களின் தொழுகையாகும். அல்லாஹ்வுக்கு மிகவும் விருப்பமான நோன்பு தாவூத் (அலை) அவர்களின் நோன்பாகும். அவர்கள் பாதி இரவுவரை உறங்குவார்கள். இரவில் மூன்றில் ஒரு பகுதி நேரம் நின்று தொழுவார்கள். (பிறகு) ஆறில் ஒரு பகுதி நேரம் (மீண்டும்) உறங்குவார்கள். அவர்கள் ஒரு நாள் நோன்பு நோற்பார்கள்; ஒரு நாள் நோன்பை விட்டுவிடுவார்கள்.8 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "மஸ்ரூக் பின் அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: நான் ஆயிஷா (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்களுக்கு விருப்பமான நற்செயல் (அமல்) எது?” என்று கேட்டேன். அதற்கு அவர்கள் ‘நிலையாகச் செய்யும் நற்செயல்’ என்று விடையளித்தார் கள். “(இரவுத் தொழுகைக்காக) நபி (ஸல்) அவர்கள் எப்போது எழுவார்கள்?” என்று கேட்டேன். அதற்கு அவர்கள், “சேவல் கூவும் நேரம் (இரவின் இறுதி மூன்றில் ஒரு பகுதியில்) எழுவார்கள்”’ என்று விடையளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், ‘சேவல் கூவும்போது எழுந்து தொழுவார்கள்’ என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "நபி (ஸல்) அவர்களின் துணைவி யார்) ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் என்னிடம் தங்கியிருக்கும் தினத்தில் (சேவல் கூவும் நேரம் எழுந்து தொழுத பின்னர்) உறங்கிய நிலையில் தவிர, சஹர் நேரம் அவர்களை அடைந்ததில்லை. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களும் ஸைத் பின் ஸாபித் (ரலி) அவர்களும் (நோன்பு நோற்க) சஹர் உணவு சாப்பிட்டனர். சாப்பிட்டு முடித்ததும் நபி (ஸல்) அவர்கள் (ஃபஜ்ர்) தொழுகைக்காக எழுந்து சென்று தொழு தார்கள். இதன் அறிவிப்பாளரான கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: நாங்கள் அனஸ் (ரலி) அவர்களிடம், “அவர்கள் இருவரும் சாப்பிட்டு முடித்ததற்கும் தொழுததற்கும் இடையே எவ்வளவு நேரம் இடைவெளி இருந்தது?” என்று கேட்டோம். அதற்கு அனஸ் (ரலி) அவர்கள், “ஒருவர் ஐம்பது இறைவசனங்கள் ஓதும் அளவு நேரம் (இடைவெளி) இருந்தது” என்று பதிலளித்தார்கள்.9 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "அபூவாயில் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், “நான் ஓர் இரவில் நபி (ஸல்) அவர்களுடன் (தஹஜ்ஜுத்) தொழுதேன். அவர்கள் (நீண்ட நேரம் நிலையில்) நின்றுகொண்டே இருந்தார்கள். நான் தவறான ஒரு முடிவுக்குக்கூட சென்று விட்டேன் (அந்த அளவுக்கு நீண்ட நேரம் நின்றார்கள்)” என்று கூறினார்கள். நான், “அந்தத் தவறான முடிவு என்ன?” என்று கேட்டேன். அதற்கு அவர்கள், “நபி (ஸல்) அவர்களுடன் தொழுவதை விட்டுவிட்டு உட்கார்ந்து விடலாம் என்று எண்ணினேன்” என விடையளித்தார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இரவில் ‘தஹஜ் ஜுத்’ தொழுவதற்காக எழும்போது, பல் துலக்கு(ம் குச்சியால் தமது வாயைச் சுத்தம் செய்)வார்கள்.10 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம், “அல்லாஹ்வின் தூதரே! இரவுத் தொழுகை எவ்வாறு (தொழ வேண்டும்)?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “இரண்டிரண்டு ரக்அத்களாகத் தொழ வேண்டும். ஆனால், சுப்ஹு (நேரம் வந்துவிட்டது) பற்றி நீர் அஞ்சினால், ஒரு ரக்அத் (வித்ர்) தொழுவீராக” என்று கூறினார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களின் இரவுத் தொழுகை பதிமூன்று ரக்அத்களாக இருந்தது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "மஸ்ரூக் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஆயிஷா (ரலி) அவர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் இரவுத் தொழுகை பற்றி கேட்டேன். அதற்கு அவர்கள் “ஃபஜ்ருடைய இரண்டு ரக்அத் (சுன்னத்) தவிர ஏழு ரக்அத்கள், (சில சமயம்) ஒன்பது ரக்அத்கள், (சில சமயம்) பதினொன்று ரக்அத்கள் (தொழுவார்கள்)” என்று பதிலளித்தார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இரவில் பதிமூன்று ரக்அத்கள் தொழுவார்கள். வித்ர், ஃபஜ்ருடைய இரண்டு ரக்அத் (சுன்னத்) ஆகியவை அவற்றில் அடங்கும்.11 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், இம்மாதம் நோன்பு நோற்கமாட்டார்கள் என்று நாங்கள் கருதுமளவுக்குச் சில மாதங்களில் அவர்கள் (தொடர்ந்து) நோன்பு நோற்காமல் இருப்பார்கள். இம்மாதம் அவர்கள் நோன்பை விடமாட்டார்கள் என்று நாங்கள் கருதுமளவுக்கு அவர்கள் (சில மாதங்களில்) நோன்பு நோற்பார்கள். அவர்களை இரவில் தொழும் நிலையில் நீ காண விரும்பினால், அவ்வாறே அவர்களைக் காண்பாய். அவர்களை (இரவில்) உறங்கும் நிலையில் நீ காண விரும்பினால், அவ்வாறே காண்பாய்.12 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் உறங்கும்போது உங்கள் தலையின் பின்பக்கத்தில் ஷைத்தான் மூன்று முடிச்சுகளைப் போட்டு விடுகிறான். ஒவ்வொரு முடிச்சின்போதும் “இன்னும் உனக்கு நீண்ட இரவு (ஓய்வெடுக்க எஞ்சி) இருக்கிறது. ஆகவே, நீ உறங்கு” என்று கூறி (உங்களை விழிக்க விடாமல் உறங்கவைத்து)விடுகிறான். அவர் (அவனது கூற்றை ஏற்காமல்) கண் விழித்து அல்லாஹ்வை நினைவுகூர்ந்தால், ஒரு முடிச்சு அவிழ்ந்துவிடுகிறது. அவர் அங்கத் தூய்மை (உளூ) செய்தால், மற்றொரு முடிச்சு அவிழ்ந்துவிடுகிறது. அவர் (இரவுத் தொழுகையோ ஃபஜ்ரோ) தொழுதுவிட்டால், முடிச்சுகள் முழுவதும் அவிழ்ந்துவிடுகின்றன. அவர் உற்சாகத்துடனும் நல்ல மனநிலையுடனும் காலைப் பொழுதை அடைவார். இல்லையெனில், மந்தமான மனநிலையுடனும் சோம்பலுட னும் காலைப் பொழுதை அடைவார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "சமுரா பின் ஜுன்துப் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், தாம் கனவில் கண்ட கல்லால் தலை நசுக்கப்படும் மனிதரைப் பற்றிக் குறிப்பிடுகையில், “அவர் குர்ஆனைக் கற்று அ(தன்படி செயல்படுவ)தை விட்டுவிட்டவர்; கடமை யான தொழுகையைத் தொழாமல் உறங்கியவர்” என்று கூறினார்கள்.13 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம். ஒரு மனிதர் பொழுது விடியும்வரை தொழுகைக்கு எழாமல் உறங்கிக்கொண்டேயிருப்பது பற்றிக் கூறப்பட்டது. அப்போது நபி (ஸல்) அவர்கள், “அவரது காதில் ஷைத்தான் சிறுநீர் கழித்துவிட்டான்” என்று கூறினார்கள்.14 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உயர்வும் வளமும் மிக்க நம் இறைவன் ஒவ்வோர் இரவிலும், இரவின் இறுதி மூன்றிலோரு பகுதி இருக்கும்போது கீழ் வானிற்கு இறங்கிவந்து, “என்னிடம் யாரேனும் பிரார்த்தித்தால் அவரது பிரார்த்தனையை நான் ஏற்கிறேன். என்னி டம் யாரேனும் கேட்டால் அவருக்கு நான் கொடுக்கிறேன். என்னிடம் யாரேனும் பாவமன்னிப்புக் கோரினால் அவரை நான் மன்னிக்கிறேன்” என்று கூறுகின்றான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஆயிஷா (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்களின் இரவுத் தொழுகை எவ்வாறு இருந்தது?” என்று கேட்டேன். அதற்கு அவர்கள், “இரவின் ஆரம்பப் பகுதியில் நபி (ஸல்) அவர்கள் உறங்கு வார்கள். இரவின் இறுதிப் பகுதியில் எழுந்து தொழுவார்கள். பிறகு தமது படுக்கைக்குத் திரும்புவார்கள். தொழுகை அறிவிப்பாளர் (முஅத்தின்) தொழுகை அறிவிப்பு (பாங்கு) சொன்னதும் விரைவாக எழுந்து குளிக்க வேண்டிய அவசியம் இருந்தால் குளிப்பார்கள். இல்லாவிட்டால், அங்கத் தூய்மை (உளூ) செய்துவிட்டு (தொழுகைக்காகப்) புறப்பட்டுவிடுவார்கள்” என்று பதிலளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "அபூசலமா பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: நான் (நபி (ஸல்) அவர்களின் துணைவியார்) ஆயிஷா (ரலி) அவர்களிடம், “ரமளான் மாதத்தி(ன் இரவுகளி)ல் நபி (ஸல்) அவர்களின் தொழுகை எவ்வாறு இருந்தது?” என்று கேட்டேன். அதற்கு அவர்கள், “நபி (ஸல்) அவர்கள் ரமளானிலும் ரமலான் அல்லாத மற்ற காலங்களிலும் பதினொன்று ரக்அத்களை விட அதிகமாகத் தொழமாட்டார்கள். (முதலில்) நான்கு ரக்அத்கள் தொழுவார் கள். அதன் அழகையும் நீளத்தையும் பற்றி நீ கேட்காதே! பிறகு நான்கு ரக்அத்கள் தொழுவார்கள். அதன் அழகையும் நீளத்தையும் பற்றி நீ கேட்காதே! பின்னர் மூன்று ரக்அத்கள் தொழுவார்கள்” என்று விடையளித்தார்கள். மேலும் ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: நான், “அல்லாஹ்வின் தூதரே! நீங்கள் வித்ர் தொழுவதற்குமுன் உறங்குவீர்களா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “என் கண்கள்தான் உறங்குகின்றன; என் உள்ளம் உறங்குவதில்லை” என்று விடையளித்தார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (முதுமை அடை யும்வரை) இரவுத் தொழுகை எதிலும் அமர்ந்து (குர்ஆன்) ஓதியதை நான் பார்த்ததில்லை. அவர்கள் முதுமை யடைந்தபின் அமர்ந்துகொண்டு ஓதினார் கள். ஓர் அத்தியாயத்தில் முப்பது அல்லது நாற்பது வசனங்கள் எஞ்சியிருக்கும்போது, எழுந்து நின்று அவற்றை ஓதிவிட்டுப் பிறகு ருகூஉ செய்வார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) அதிகாலைத் தொழுகை யின்போது நபி (ஸல்) அவர்கள் பிலால் (ரலி) அவர்களிடம், “பிலாலே! இஸ்லாத்தில் இணைந்தபின் நீங்கள் ஈடுபாட்டுடன் செய்த ஒரு நற்செயல் குறித்து எனக்குச் சொல்வீராக! ஏனெனில், சொர்க்கத்தில் எனக்கு முன்பாக, (நீங்கள் நடந்து செல்லும்) காலணி ஓசையை நான் செவியுற்றேன்” என்று கூறினார்கள். அதற்கு பிலால் (ரலி) அவர்கள், “நான் இரவிலோ பகலிலோ எந்த நேரத்தில் அங்கத் தூய்மை (உளூ) செய்தாலும் அந்த அங்கத் தூய்மை மூலம் நான் தொழ வேண்டுமென என் விதியில் எழுதப்பட்டி ருப்பதை நான் தொழாமல் இருந்ததில்லை. இந்த நற்செயலைத்தான் நான் மிகுந்த ஈடுபாட்டுடன் செய்ததாக நான் கருது கிறேன்” என்று கூறினார்கள்.16 அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: (இந்த ஹதீஸின் மூலத்திலுள்ள) ‘தஃப்ப நஅலைக்க’ எனும் சொற்றொடருக்கு ‘உங்கள் காலணி ஓசை’ என்பது பொருள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1150,
			"arabicnumber": 1150,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மஸ்ஜிதுந் நபவீ பள்ளிவாசலுக்குள்) நுழைந்தபோது, இரு தூண்களுக்கிடையில் நீண்ட கயிறு ஒன்று காணப்பட்டது. “இந்தக் கயிறு என்ன (ஏன்)?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அதற்கு மக்கள், “இது ஸைனப் (ரலி) அவர்களுக்கு உரியதாகும்; அவர் (நின்று தொழும்போது) சோர்வடைந் தால் இந்தக் கயிற்றைப் பற்றிக்கொள்வார்” என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், “வேண்டாம். இதை அவிழ்த்துவிடுங்கள். உங்களில் ஒருவர் உற்சாகமாக இருக்கும் போது (கூடுதலான தொழுகைகளைத்) தொழட்டும். சோர்வடைந்தால் உட்கார்ந்து கொள்ளட்டும்” என்று கூறினார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: என்னிடம் ‘பனூ அசத்’ குலத்தைச் சேர்ந்த ஒரு பெண்மணி இருந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வீட்டுக்குள்) வந்து, “யார் இவர்?” என்று கேட்டார்கள். நான் “இவர் இன்னார்” என்று கூறிவிட்டு, “இரவெல்லாம் உறங்கமாட்டார் (தொழுதுகொண்டே இருப்பார்) என்று அவரது தொழுகை குறித்து கூறப்படுகிறது என்றேன். அப்போது நபி (ஸல்) அவர்கள் “போதும் நிறுத்து!” என்று கூறிவிட்டு, “(வழிபாடுகள் உள்ளிட்ட) நற்செயல்களில் உங்களால் இயன்றதையே (நிலையாகச்) செய்துவாருங்கள். நிச்சயமாக நீங்கள் சடைவடையாத வரை அல்லாஹ்வும் சடைவடையமாட்டான்” என்று கூறினார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1152,
			"arabicnumber": 1152,
			"text": "அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம், “அப்துல்லாஹ்! இரவில் (அதிகமாக) நின்று வழிபாடு செய்துவிட்டு, இறுதியில் இரவுத் தொழுகையையே கைவிட வேண்டிய நிலைக்கு ஆளான இன்ன மனிதரைப் போன்று நீரும் ஆகிவிட வேண்டாம்” என்று கூறி னார்கள்.18 இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1153,
			"arabicnumber": 1153,
			"text": "அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் என்னிடம், “நீர் இரவெல்லாம் நின்று வழிபடுவதாகவும் பகலெல்லாம் நோன்பு நோற்பதாகவும் கேள்விப்பட்டேனே (உண்மையா)?” என்று கேட்டார்கள். அதற்கு நான், “அப்படித்தான் செய்கிறேன்” என்றேன். அதற்கு நபி (ஸல்) அவர்கள், “நீர் இவ்வாறு செய்தால், உம்முடைய கண்கள் சொருகிவிடும்; உமது உடல் நலிந்துவிடும். நீர் உமது உடலுக்குச் செய்ய வேண்டிய கடமைகளும் உமக்கு உள்ளன; உம்மு டைய குடும்பத்தாருக்குச் செய்ய வேண்டிய கடமைகளும் உமக்கு உள்ளன. எனவே, நீர் (ஒரு நாள்) நோன்பு நோற்பீ ராக! (ஒரு நாள்) நோன்பை விட்டுவிடு வீராக! (இரவில் சிறிது நேரம்) தொழுவீராக! (சிறிது நேரம்) உறங்குவீராக!” என்று கூறினார்கள்.19 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1154,
			"arabicnumber": 1154,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யார் இரவில் உறக்கம் கலைந்ததோடு வாய்விட்டு, “லா இலாஹ இல்லல்லாஹு, வஹ்தஹு, லா ஷரீக்க லஹு, லஹுல் முல்க்கு வலஹுல் ஹம்து. வஹுவ அலா குல்லி ஷையின் கதீர். அல்ஹம்து லில்லாஹி, வ சுப்ஹானல்லாஹி, வ லா இலாஹ இல்லல்லாஹு. வல்லாஹு அக்பர். வ லா ஹவ்ல, வ லா குவ்வத்த இல்லா பில்லாஹ்” (அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை. அவன் ஏகன்; அவனுக்கு இணையானவர் யாரும் இல்லை; ஆட்சியதிகாரம் அவனுக்கே உரியது; புகழ் அனைத்தும் அவனுக்கே உரியன; அவன் அனைத்தின் மீதும் ஆற்றல் உள்ளவன். எல்லாப் புகழும் அல்லாஹ்வுக்கே. அல்லாஹ்வைத் துதிக்கிறேன்; அவனைத் தவிர வேறு இறையில்லை. அல்லாஹ் மிகப் பெரியவன்; அல்லாஹ்வின் உதவியின்றி பாவத்திலிருந்து விலகுவதோ நன்மை செய்யும் ஆற்றல் பெறுவதோ கிடையாது) என்று கூறிவிட்டு, ‘அல்லாஹும்மஃக்பிர்லீ’ (இறைவா! எனக்கு மன்னிப்பு அளிப்பாயாக!) என்றோ, அல்லது வேறு பிரார்த்தனையோ புரிந்தால் அவை ஏற்கப்படும். அவர் அங்கத் தூய்மை (உளூ) செய்து தொழுதால் அத்தொழுகை ஒப்புக்கொள்ளப்படும். இதை உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1155,
			"arabicnumber": 1155,
			"text": "ஹைஸம் பின் அபீசினான் (ரஹ்) அவர்கள் கூறியதாவது: அபூஹுரைரா (ரலி) அவர்கள் உரை யாற்றிக்கொண்டிருந்தபோது, தமது பேச்சி னிடையே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பற்றிக் குறிப்பிட்டார்கள். (அப்போது கவிஞர்) அப்துல்லாஹ் பின் ரவாஹா (ரலி) அவர்களைக் கருத்தில் கொண்டு, “உங்களுடைய சகோதரர் எதையும் தவறாகச் சொல்பவர் அல்லர்” என்று குறிப்பிட்டுவிட்டு, (நபி (ஸல்) அவர்களைப் பற்றி அவர் இயற்றிய) பின்வரும் பாடல் வரிகளை எடுத்துரைத் தார்கள்: எங்களிடையே இறைவேதத்தை ஓதுகிறார் இறைத்தூதர் வைகறை புலரும்போது! எங்களுக்கு நல்வழி காட்டினார் நாங்கள் இருந்ததோ இருட்டில்! அவர் சொன்னதெல்லாம் நடக்கும் இப்போது எம் இதயங்களுக்கு உறுதி! இரவில் அவர் விலா படுக்கைக்கு அந்நியம் இணைவைப்பாளர்களோ மஞ்சங்களில் தஞ்சம்! இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1158,
			"arabicnumber": 1158,
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1159,
			"arabicnumber": 1159,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இஷா தொழுகை தொழுதுவிட்டுப் பின்னர் எட்டு ரக்அத்கள் தொழுதார்கள். மேலும், உட்கார்ந்து இரண்டு ரக்அத்கள் தொழுதார்கள். (ஃபஜ்ருடைய) பாங்குக்கும் இகாமத்துக்கும் இடையே இரண்டு ரக்அத்கள் தொழுதார்கள். அவ்விரு ரக்அத்களையும் நபி (ஸல்) அவர்கள் ஒருபோதும் கைவிட்டதில்லை.20 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1160,
			"arabicnumber": 1160,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், ஃபஜ்ருடைய (சுன்னத்) இரண்டு ரக்அத் தொழுததும் வலப் புறம் சாய்ந்து படுத்துக்கொள்வார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஃபஜ்ருடைய சுன்னத்) தொழுததும் நான் விழித்திருந் தால் என்னுடன் பேசிக்கொண்டிருப் பார்கள். இல்லாவிடில் (ஃபஜ்ர்) தொழு கைக்கு அழைக்கப்படும்வரை படுத்து ஓய்வெடுப்பார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஃபஜ்ருடைய சுன்னத்) இரண்டு ரக்அத்கள் தொழுததும் நான் விழித்திருந்தால் என்னுடன் பேசிக் கொண்டிருப்பார்கள். இல்லையேல், (தொழுகைக்கு அழைக்கப்படும்வரை) சாய்ந்து படுத்திருப்பார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவ ரான அலீ பின் அப்தில்லாஹ் அல்மதீனீ (ரஹ்) அவர்கள் கூறுகிறார்கள்:) நான் (இந்த ஹதீஸை எனக்கு அறிவித்த) சுஃப்யான் பின் உயைனா (ரஹ்) அவர்களிடம், “சிலர் ஃபஜ்ருடைய (சுன்னத்) இரண்டு ரக்அத் (தொழுத பிறகுதான் நபி (ஸல்) அவர்கள் இவ்வாறு செய்வார்கள்) என இந்த ஹதீஸில் அறிவிக்கின்றனரே?” என்று கேட்டேன். அதற்கு அவர்கள், ‘ஆம்; அப்படித்தான்’ என்று பதிலளித்தார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஃபஜ்ருடைய (சுன்னத்) இரண்டு ரக்அத்கள் அளவுக்கு வேறு எந்தக் கூடுதலான தொழுகைக்கும் அதிக முக்கியத்துவம் அளித்ததில்லை. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவில் பதிமூன்று ரக்அத்கள் தொழுவார் கள். பிறகு (ஃபஜ்ரின்) பாங்கைக் கேட்டதும் சுருக்கமாக (ஓதி) இரண்டு ரக்அத்கள் (சுன்னத்) தொழுவார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் சுப்ஹு தொழு கைக்குமுன் சுருக்கமாக (ஓதி) இரண்டு ரக்அத் (சுன்னத்) தொழுவார்கள். எந்த அளவுக்கென்றால், அதில் அவர்கள் ‘அல்ஃபாத்திஹா’ அத்தியாயத்தை ஓதி னார்களா என்றுகூட நான் நினைப்பேன்.29 இந்த ஹதீஸ் இரண்டு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு குர்ஆன் அத்தியாயங் களைக் கற்றுக்கொடுப்பதைப் போன்று, எல்லாக் காரியங்களிலும் நல்லதைத் தேர்ந்தெடுப்பதற்கான முறையையும் கற்றுக்கொடுப்பவர்களாய் இருந்தார்கள். நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் ஒரு காரியத்தை(ச் செய்ய) நாடினால், கடமையான தொழுகை அல்லாத (கூடுதலான தொழுகையாக) இரண்டு ரக்அத்களைத் தொழட்டும். பின்னர் (பின்வருமாறு) பிரார்த்திக்கட்டும்: அல்லாஹும்ம! இன்னீ அஸ்தகீரு(க்)க பி இல்மி(க்)க. வ அஸ்தக்திரு(க்)க பி குத்ரத்தி(க்)க. வ அஸ்அலு(க்)க மின் ஃபள்லி(க்)கல் அழீம். ஃப இன்ன(க்)க தக்திரு, வலா அக்திரு, வ தஅலமு வலா அஉலமு. வ அன்(த்)த அல்லாமல் ஃகுயூப். அல்லாஹும்ம! இன் குன்(த்)த தஅலமு அன்ன ஹாதல் அம்ர கைருன் லீ ‘ஃபீ தீனீ, வ மஆஷீ, வ ஆக்கிப(த்)தி அம்ரீ’ / ‘ஃபீ ஆஜிலி அம்ரீ வ ஆஜிலிஹி / ஃபக்துர்ஹு லீ, வ யஸ்ஸிர்ஹு லீ, ஸும்ம பாரிக் லீ ஃபீஹீ. வ இன் குன்(த்)த தஅலமு அன்ன ஹாதல் அம்ர ஷர்ருன் லீ ‘ஃபீ தீனீ, வ மஆஷீ, வ ஆக்கிப(த்)தி அம்ரீ’ / ‘ஃபீ ஆஜிலி அம்ரீ வ ஆஜிலிஹி / ஃபஸ்ரிஃப்ஹு அன்னீ. வஸ்ரிஃப்னீ அன்ஹு. வக்துர்ஹு லியல்கைர ஹைஸு கான, ஸும்ம அர்ளினீ. (பொருள்: இறைவா! நீ அறிந்துள்ளபடி (எது எனக்கு) நன்மை(யோ அ)தனை உன்னிடம் நான் வேண்டுகிறேன். உனது ஆற்றலால் எனக்கு ஆற்றல் உண்டாக வேண்டுமென உன்னிடம் கோருகிறேன். உனது மகத்தான தயவை உன்னிடம் கோருகிறேன். ஏனெனில், நீயே ஆற்றல் மிக்கவன்; எனக்கோ எந்த ஆற்றலும் கிடையாது. நீயே நன்கறிந்தவன்; எனக்கோ எந்த அறிவும் கிடையாது. நீயே மறைவான வற்றை நன்கறிந்தவன். இறைவா! (நான் செய்யப்போகும்) இந்தக் காரியம் எனக்கு ‘என் மார்க்கத்திலும் என் வாழ்க்கையிலும் என் காரியத்தின் முடிவிலும்’ / அல்லது ‘என் இம்மை வாழ்விலும் மறுமை வாழ்விலும்’ / நன்மையானதாக இருக்கும் என நீ அறிந்தால், அதைச் செய்வதற்கு எனக்கு ஆற்றல் வழங்குவாயாக! அதை எனக்கு எளிதாக்குவாயாக! பிறகு அதில் எனக்கு வளத்தை வழங்குவாயாக! (நான் செய்யப்போகும்) இந்தக் காரியம் எனக்கு ‘என் மார்க்கத்திலும் என் வாழ்க்கையிலும் என் காரியத்தின் முடிவிலும்’ -அல்லது ‘என் இம்மை வாழ்விலும் மறுமை வாழ்விலும்’- கேடாக அமையும் என நீ அறிந்தால், இக்காரியத்தை என்னை விட்டுத் திருப்பிவிடுவாயாக! என்னையும் இக்காரியத்தைவிட்டுத் திருப்பிவிடுவாயாக! நன்மை எங்கிருந்தாலும் அதை அடைவதற்குரிய செயல் திறனை எனக்கு வழங்குவாயாக! பிறகு அதைத் திருப்தி கொண்டவனாக என்னை ஆக்குவாயாக!) பிறகு அவர் தமது தேவை இன்னதெனக் குறிப்பிடட்டும். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் பள்ளிவாசலுக்குள் நுழைந்ததும் (பள்ளிவாசல் காணிக்கையாக) இரண்டு ரக்அத்கள் தொழாமல் உட்கார வேண்டாம். இதை அபூகத்தாதா பின் ரிப்ஈ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.22 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (எங்கள் வீட்டில்) எங்களுக்கு இரண்டு ரக்அத்கள் தொழு வித்துவிட்டுத் திரும்பிச் சென்றார்கள்.23 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் லுஹ்ர் தொழுகைக்குமுன் இரண்டு ரக்அத்களும் லுஹ்ருக்குப்பின் இரண்டு ரக்அத்களும் ஜுமுஆவுக்குப் பின் இரண்டு ரக்அத்களும் மஃக்ரிப் தொழுகைக்குப்பின் இரண்டு ரக்அத்களும் இஷா தொழுகைக்குப்பின் இரண்டு ரக்அத்களும் தொழுதிருக்கிறேன்.24 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உங்களில் ஒருவர் ‘இமாம் உரை நிகழ்த்திக் கொண்டிருக்கும்போது’ அல்லது ‘அவர் புறப்பட்டு வந்திருக்கும்போது’ (பள்ளி வாசலுக்குள்) வந்தால், இரண்டு ரக்அத்கள் தொழுதுகொள்ளட்டும்” என்று (ஜுமுஆ நாள்) சொற்பொழிவில் குறிப்பிட்டார்கள்.25 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": 1171,
			"text": "முஜாஹித் (ரஹ்) அவர்கள் கூறியதாவது: (மக்கா வெற்றி நாளில்) இப்னு உமர் (ரலி) அவர்கள் தமது இல்லத்தில் இருந்த போது அவர்களிடம், “இதோ! அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் இறையில்லம் கஅபாவுக்குள் நுழைந்துவிட்டர்கள்” என்று சொல்லப்பட்டது. (பிறகு நடந்ததை) இப்னு உமர் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (கஅபாவிற்குள்ளிருந்து) வெளியே வந்து கொண்டிருந்தபோது, நான் அங்கு சென்று அவர்களைக் கண்டேன்; பிலால் (ரலி) அவர்கள் (கஅபாவின்) தலைவாயில் அருகில் நிற்பதையும் கண்டேன். நான் பிலால் அவர்களிடம், “பிலாலே! அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் கஅபாவிற் குள் தொழுதார்களா?” என்று கேட்டேன். அதற்கு அவர்கள் ‘ஆம்’ என்றார்கள். ‘எந்த இடத்தில்?’ என்று கேட்டேன். “இந்த இரு தூண்களுக்கு மத்தியில் (தொழுதார் கள்). பிறகு வெளியே வந்து கஅபாவை முன்னோக்கியபடி தொழுதார்கள்” என்று பதிலளித்தார்கள்.26 அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: ‘ளுஹா’ நேரத்தில் இரண்டு ரக்அத்கள் தொழுமாறு நபி (ஸல்) அவர்கள் என்னை வலியுறுத்தினார்கள் என அபூஹுரைரா (ரலி) அவர்கள் கூறினார்கள்.27 “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் நண் பகலில் என்னிடம் வந்தார்கள். நாங்கள் நபி (ஸல்) அவர்களுக்குப் பின்னால் அணி வகுத்து நின்றோம். அவர்கள் (எங்களுக்கு) இரண்டு ரக்அத்கள் தொழுவித்தார்கள்” என இத்பான் பின் மாலிக் (ரலி) அவர்கள் குறிப்பிட்டுள்ளார்கள்.28 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "அபுஷ்ஷஅஸா ஜஅஃபர் பின் ஸைத் (ரஹ்) அவர்கள் கூறியதாவது: இப்னு அப்பாஸ் (ரலி) அவர்கள், “நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களு டன் எட்டு ரக்அத்கள் (கொண்ட லுஹ்ர், அஸ்ர் ஆகிய தொழுகைகளை இடையில் கூடுதல் தொழுகைகள் ஏதும் தொழாமல்) சேர்ந்தாற்போல் தொழுதிருக்கிறேன். ஏழு ரக்அத்கள் கொண்ட (மஃக்ரிப், இஷா ஆகிய தொழுகைகளை இடையில் கூடுதல் தொழுகைகள் ஏதும் தொழாமல்) சேர்ந்தாற்போல் தொழுதிருக்கிறேன்” என்று கூறினார்கள். (இதன் அறிவிப்பாளரான) அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் அபுஷ்ஷஅஸா (ரஹ்) அவர்களிடம், “நபி (ஸல்) அவர்கள் லுஹ்ர் தொழு கையைத் தாமதப்படுத்தி அஸ்ரின் ஆரம்ப நேரத்திலும், மஃக்ரிப் தொழுகையைத் தாமதப்படுத்தி இஷாவின் ஆரம்ப நேரத்திலும் தொழுதிருப்பார்கள் என நான் எண்ணுகிறேன்” என்றேன். அதற்கு அபுஷ்ஷஅஸா (ரஹ்) அவர்கள் “நானும் அவ்வாறே எண்ணுகிறேன்” என்றார்கள்.31 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1175,
			"arabicnumber": 1175,
			"text": "முவர்ரிக் பின் முஷம்ரிஜ் (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு உமர் (ரலி) அவர்களிடம், “நீங்கள் ‘ளுஹா’ (முற்பகல்) தொழுகை தொழுவது உண்டா?” என்று கேட்டேன். அதற்கு அவர்கள் ‘இல்லை’ என்றார்கள். “சரி, உமர் (ரலி) அவர்கள் தொழுவார் களா?” என்று கேட்டேன். அதற்கு அவர்கள் ‘இல்லை’ என்றார்கள். “சரி, அபூபக்ர் (ரலி) அவர்கள் தொழுவார்களா?” என்று கேட்டேன். அதற்கும் ‘இல்லை’ என்றார்கள். “சரி, நபி (ஸல்) அவர்கள் (தொழுவார் களா)?” என்று கேட்டேன். “அவர்கள் தொழுததாக நான் எண்ணவில்லை” என்றார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1176,
			"arabicnumber": 1176,
			"text": "அப்துர் ரஹ்மான் பின் அபீலைலா (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ‘ளுஹா’ தொழுத தாக உம்முஹானீ (ரலி) அவர்களைத் தவிர வேறெவரும் எமக்கு அறிவிக்க வில்லை. நபி (ஸல்) அவர்கள் மக்கா வெற்றி நாளில் தமது இல்லத்திற்கு வந்து குளித்துவிட்டு, எட்டு ரக்அத்கள் தொழுததாக உம்மு ஹானீ (ரலி) அவர்கள் கூறினார்கள். மேலும், “நபி (ஸல்) அவர்கள் அதைவிடச் சுருக்கமாக வேறு எந்தத் தொழுகைகளையும் தொழுததை நான் ஒருபோதும் கண்டதில்லை. ஆயினும், அவர்கள் ருகூஉவையும் சஜ்தாவையும் நிறைவாகச் செய்தார்கள்” என்றும் உம்முஹானீ (ரலி) அவர்கள் குறிப்பிட்டார்கள்.32 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": 1177,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ‘ளுஹா’ தொழுததை நான் பார்த்ததில்லை. ஆனால், நான் அதைத் தொழுது வருகிறேன்.33 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒவ்வொரு மாதமும் மூன்று நாட்கள் நோன்பு நோற்பது, (இரண்டு ரக்அத்கள்) ‘ளுஹா’ தொழுகை தொழுவது, வித்ர் தொழுதுவிட்டு உறங்குவது ஆகிய மூன்று விஷயங்களை என் உற்ற தோழர் (நபி (ஸல்) அவர்கள்) எனக்கு அறிவுறுத்தினார் கள். அவற்றை நான் இறக்கும்வரை கை விடமாட்டேன். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1179,
			"arabicnumber": 1179,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: உடல் பருமனாக இருந்த ஓர் அன்சாரித் தோழர் (இத்பான் பின் மாலிக்) நபி (ஸல்) அவர்களிடம் (வந்து), “என்னால் (பள்ளிவாசலுக்கு வந்து) உங்களுடன் நின்று தொழ முடிவதில்லை” என்று கூறினார். எனவே, அவர் நபியவர்களுக் காக உணவு சமைத்துத் தமது இல்லத்திற்கு வருமாறு அழைத்தார். (அவரது இல்லத்திற்கு நபி (ஸல்) அவர்கள் சென்றபோது) அவர்கள் தொழுவதற்காக அவர் (பாயொன்றை விரித்து, பதப்படுத்துவதற்காக அந்தப்) பாயின் ஓரத்தில் தண்ணீர் தெளித்தார். நபி (ஸல்) அவர்கள் அதன்மீது இரண்டு ரக்அத்கள் தொழுதார்கள். அப்துல் ஹமீத் பின் முன்திர் பின் அல்ஜாரூத் (ரஹ்) அவர்கள் அனஸ் (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்கள் ‘ளுஹா’ தொழுகை தொழுவார்களா?” என்று கேட்டார்கள். அதற்கு அனஸ் (ரலி) அவர்கள், “அன்றைய தினம் தவிர வேறு எப்போதும் அவர்கள் தொழ நான் பார்த்ததில்லை” என விடையளித்தார்கள். இதை அனஸ் பின் சீரீன் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள்.34 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1181,
			"arabicnumber": 1181,
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1182,
			"arabicnumber": 1182,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் லுஹ்ர் தொழுகைக்குமுன் நான்கு ரக்அத்களும் சுப்ஹு தொழுகைக்குமுன் இரண்டு ரக்அத்களும் தொழாமல் இருந்ததில்லை. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1183,
			"arabicnumber": 1183,
			"text": "அப்துல்லாஹ் அல்முஸ்னீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், “மஃக்ரிப் தொழு கைக்குமுன் (இரு ரக்அத்கள் சுன்னத்) தொழுங்கள்” என (மூன்று முறை) கூறினார்கள். மூன்றாம் முறை கூறும்போது, அதை (எங்கே) மக்கள் (அவசியம் பின்பற்ற வேண்டிய) ஒரு ‘சுன்னத்’தாக எடுத்துக் கொள்வார்களோ என்று அஞ்சி, “இது விரும்பியவர்களுக்கு மட்டும்தான்” என்றார்கள். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1184,
			"arabicnumber": 1184,
			"text": "மர்ஸத் பின் அப்தில்லாஹ் அல்யஸனீ (ரஹ்) அவர்கள் கூறியதாவது: நான் (எகிப்தின் ஆளுநராயிருந்த) உக்பா பின் ஆமிர் அல்ஜுஹனீ (ரலி) அவர்களிடம் சென்று, “அபூதமீம் (அப்துல்லாஹ் பின் மாலிக்-ரலி) அவர்கள் மஃக்ரிப் தொழுகைக்குமுன் இரண்டு ரக்அத்கள் தொழுகிறார்களே, உங்களுக்கு இது ஆச்சரியமாக இல்லையா?” என்று கேட்டேன். அதற்கு அவர்கள் “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் நாங்கள் அவ்வாறு செய்துவந்தோம்” என்று விடையளித்தார்கள். “இப்போது ஏன் நீங்கள் செய்வதில்லை?” என்று நான் கேட்டேன். அதற்கு அவர்கள் ‘அலுவல்களே காரணம்’ என்றார்கள்.36 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "மஹ்மூத் பின் ரபீஉ அல்அன்சாரி (ரலி) அவர்கள் கூறியதாவது: எனக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை நினைவிருக்கிறது. (நான் சிறுவனாக இருந்தபோது) அவர்கள் என் வீட்டிலிருந்த ஒரு கிணற்றிலிருந்து (ஒரு வாளியில் தண்ணீர் எடுத்து தமது வாயில் வைத்து) என் முகத்தில் ஒரு முறை (பாசத்தோடு) உமிழ்ந்ததை இப்போதும் நினைவில் வைத்திருக்கிறேன்.38 அல்லாஹ்வின் தூதர் (ஸல்) அவர் களுடன் பத்ர் போரில் கலந்துகொண்ட வர்களில் ஒருவரான இத்பான் பின் மாலிக் (ரலி) அவர்கள் கூறினார்கள்: நான் என் சமுதாயத்தாரான பனூ சாலிம் குலத்தாருக்கு (இமாமாகத்) தொழுகை நடத்திவந்தேன். மழைக் காலங்களில் என(து இல்லத்து)க்கும் என் குலத்தாரு(டைய பள்ளிவாசலு)க்கும் இடையே உள்ள பள்ளத்தாக்கில் தண்ணீர் ஓடியது. ஆகவே, அதைக் கடந்து அவர்களின் பள்ளிவாசலுக்கு வருவது எனக்குச் சிரமமாகிவிட்டது. எனவே, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று, “(அல்லாஹ் வின் தூதரே!) நான் என் கண் பார்வையை இழந்துவருகிறேன். மழை வந்தால் எனக்கும் என் சமுதாயத்தாருக்கும் இடையே வெள்ளநீர் வழிந்தோடுகிறது. என்னால் அதைக் கடக்க முடியவில்லை. எனவே, தாங்கள் வந்து எனது வீட்டில் தொழுகை நடத்த வேண்டும் என்றும் அவ்விடத்தை நான் (எனது) தொழுமிட மாக ஆக்கிக்கொள்ள வேண்டும் என்றும் விரும்புகிறேன்” என்றேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(அல்லாஹ் நாடினால்) அவ்வாறே செய்கிறேன்” என்று கூறினார்கள். மறுநாள் நண்பகல் நேரத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் என்னிடம் வந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என் வீட்டிற்குள் வர) அனுமதி கோரினார்கள். அவர்களுக்கு நான் அனுமதியளித்தேன். (வீட்டில் நுழைந்த தும்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உட்காரக்கூட இல்லை. “(இத்பானே!) உங்கள் வீட்டில் எந்த இடத்தில் நான் தொழ வேண்டுமென நீங்கள் விரும்பு கிறீர்கள்?” என்று கேட்டார்கள். அவர்கள் (என் வீட்டில்) எந்த இடத்தில் தொழ வேண்டுமென நான் விரும்பினேனோ அந்த இடத்தை அவர்களுக்குச் சுட்டிக் காட்டினேன். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அந்த இடத்தில்) நின்று (தொழுகைக்காக) ‘தக்பீர்’ கூறினார்கள். நாங்களும் அவர்களுக்குப் பின்னால் அணிவகுத்து நின்றோம். அவர்கள் இரண்டு ரக்அத்கள் தொழுவித்துவிட்டு ‘சலாம்’ கொடுத்தார்கள். அவர்கள் ‘சலாம்’ கொடுத்தபோது நாங்களும் ‘சலாம்’ கொடுத்தோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காக நாங்கள் தயாரித்திருந்த ‘கஸீர்’ எனும் (கோதுமைக் குறுணைக் கஞ்சி) உணவி(னை உண்பத)ற்காக அவர்களை நான் இருக்க வைத்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என் வீட்டில் இருப்பதைக் கேள்விப்பட்ட கணிசமான மக்கள் எனது வீட்டில் திரண்டுவிட்டனர். அவர்களில் ஒருவர், “மாலிக் பின் துக்ஷுன் என்ன ஆனார் (அவர் ஏன் வரவில்லை)?” என்று கேட்டார். அங்கி ருந்த மற்றொரு மனிதர், “அவர் அல்லாஹ் வையும் அவனுடைய தூதரையும் நேசிக்காத ஒரு நயவஞ்சகர் (முனாபிக்). (அதனால்தான் அல்லாஹ்வின் தூதரைச் சந்திக்க அவர் வரவில்லை)” என்று கூறினார். இதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் “அவ்வாறு சொல்லாதீர் கள்! அல்லாஹ்வின் அன்பை நாடி அவர், ‘லா இலாஹ இல்லல்லாஹ்’ (அல்லாஹ் வைத் தவிர வேறு இறைவனில்லை) என்று கூறியதை நீர் பார்க்கவில்லையா?”’ என்று கேட்டார்கள். அதற்கு அம்மனிதர், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்; அல்லாஹ்வின் மீதாணையாக! அவரது நேசமும் அவரது உரையாடலும் நயவஞ்ச கர்களுடன் இருப்பதையே நாங்கள் காண்கிறோம்” என்றார். அதற்கு அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள், “அல்லாஹ் வின் அன்பை நாடி ‘லா இலாஹ இல்லல்லாஹ்’ என்று சொன்னவருக்கு அல்லாஹ் நரகத்தைத் தடை செய்துவிட்டான்” என்று கூறினார்கள். அறிவிப்பாளர் மஹ்மூத் பின் ரபீஉ (ரலி) அவர்கள் கூறுகிறார்கள்: இந்த ஹதீஸை நான் மக்களிடம் எடுத்துரைத்தேன். அப்போது அவர்களிடையே நபித்தோழர் அபூஅய்யூப் (காலித் பின் ஸைத்-ரலி) அவர்களும் இருந்தார்கள். -அன்னார் அப்போது நடைபெற்ற (கான்ஸ்டன்டி நோபிள்) போரிலேயே இறந்தார்கள். அப்போது கிழக்கு ரோமில் யஸீத் பின் முஆவியாவே அவர்களுக்கு ஆளுநராக இருந்தார்.- இந்த ஹதீஸை நான் கூறியபோது அதை அய்யூப் (ரலி) அவர்கள் ஆட்சேபித்தார்கள். “அல்லாஹ்வின் மீதாணையாக! நீங்கள் கூறிய செய்தியை நபி (ஸல்) அவர்கள் ஒருபோதும் சொல்லியிருக்கமாட்டார்கள் என்றே நான் கருதுகிறேன்” என்று அவர்கள் கூறினார்கள். இ(வ்வாறு அவர்கள் கூறிய)து எனக்குப் பெரும் கவலையளித்தது. “இந்தப் போரிலிருந்து அல்லாஹ் என்னை உயிரோடு திரும்பச் செய்து, இத்பான் (ரலி) அவர்களை அன்னாருடைய சமூகத் தாரின் பள்ளிவாசலில் உயிருடன் நான் கண்டால், இதுபற்றி அவரிடம் கேட்காமல் இருக்கப்போவதில்லை என்று அல்லாஹ் வின் மீது ஆணையிட்டு சபதம் செய்து கொண்டேன். நான் (ஊர்) திரும்பி ஹஜ்ஜுக்கோ உம்ராவுக்கோ இஹ்ராம் கட்டினேன். பின்னர் நான் மதீனா சென்றேன். பனூ சாலிம் கூட்டத்தாரிடம் சென்றேன். அங்கே வயது முதிர்ந்து பார்வையும் இழந்து இத்பான் (ரலி) அவர்கள் தம் சமுதாயத்திற்குத் தொழுவித் துக்கொண்டிருந்தார்கள். தொழுது சலாம் கொடுத்ததும் அவர்களுக்கு முகமன் கூறி, நான் யார் என்ற விவரத்தையும் கூறினேன். பிறகு இந்த ஹதீஸைப் பற்றி (திரும்ப) விசாரித்தேன். முதலில் எனக்கு அறிவித்தவாறே மீண்டும் எனக்கு அந்த ஹதீஸை அன்னார் அறிவித்தார்கள்.39 அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1187,
			"arabicnumber": 1187,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களுடைய இல்லங்களிலும் உங்கள் தொழுகைகளில் சிலவற்றைத் தொழுங்கள். இல்லங்களை (தொழுகை நடைபெறாத) அடக்கத் தலங்களாக ஆக்கிவிடாதீர்கள். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.40 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 63
			}
		}
	]
}