{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"2": "Belief"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 8,
			"arabicnumber": 8,
			"text": "அல்லாஹ்வின் தூதர்(ஸல்) அவர்கள் கூறினார்கள்: இஸ்லாம் ஐந்து தூண்கள்மீது எழுப் பப்பட்டுள்ளது. 1. அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை என்றும், முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் தூதர் என்றும் உறுதிமொழிவது. 2. தொழுகையைக் கடைப்பிடிப்பது. 3. (கடமையானோர்) ஸகாத் (கட்டாய தர்மம்) வழங்குவது. 4. (இயன்றோர் இறையில்லம் கஅபாவில்) ஹஜ் செய்வது. 5. ரமளானில் நோன்பு நோற்பது.9 இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 9,
			"arabicnumber": 9,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கை (ஈமான்) அறுபதுக் கும் மேற்பட்ட கிளைகளைக் கொண்ட தாகும். நாணமும் இறைநம்பிக்கையின் ஒரு கிளையே.11 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 10,
			"arabicnumber": 10,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: எவரது நாவு, கை ஆகியவற்றி(ன் தொல்லைகளி)லிருந்து பிற முஸ்லிம்கள் பாதுகாப்புப் பெற்றிருக்கிறார்களோ அவரே (உண்மையான) முஸ்லிம் ஆவார். எவர் அல்லாஹ் தடை விதித்தவற்றிலிருந்து விலகிக்கொண்டாரோ அவரே (உண்மை யான) முஹாஜிர் (புலம்பெயர்ந்தவர்) ஆவார்.12 இதை அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 11,
			"arabicnumber": 11,
			"text": "அபூமூசா (அப்துல்லாஹ் பின் கைஸ்-ரலி) அவர்கள் கூறியதாவது: மக்கள், “அல்லாஹ்வின் தூதரே! இஸ்லாத்தில் சிறந்தது எது?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “எவரது நாவிலிருந்தும் கரத்திலிருந் தும் பிற முஸ்லிம்கள் பாதுகாப்புப் பெற்றிருக்கிறார்களோ அவரே (சிறந்தவர்; அவரது இஸ்லாமே சிறந்தது)” என்று பதிலளித்தார்கள்.13 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 12,
			"arabicnumber": 12,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம், “இஸ்லாமி(யப் பண்புகளி)ல் சிறந்தது எது?” எனக் கேட்டார். அதற்கு நபி (ஸல்) அவர்கள் “(பசித்தோருக்கு) நீங்கள் உணவளிப்பதும், நீங்கள் அறிந்தவருக்கும் அறியாதவருக்கும் சலாம் (முகமன்) கூறுவதும் ஆகும்” என்று பதிலளித்தார்கள்.14 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 13,
			"arabicnumber": 13,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தமக்கு விரும்பு வதையே தம் சகோதரனுக்கும் விரும்பாத வரை (முழுமையான) இறைநம்பிக்கை கொண்டவர் ஆகமாட்டார்.15 இதை அனஸ் (ரலி) அவர்கள் அறி விக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 14,
			"arabicnumber": 14,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: என் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! உங்களில் ஒருவருக்கு, அவருடைய தந்தையையும் அவருடைய பிள்ளையையும்விட நான் மிகவும் நேசத்திற்குரியவனாக ஆகாத வரை அவர் (உண்மையான) இறைநம்பிக்கை உள்ளவர் ஆகமாட்டார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 15,
			"arabicnumber": 15,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவருக்கு, அவருடைய தந்தை, அவருடைய பிள்ளை, ஏனைய மக்கள் அனைவரையும்விட நான் நேசத் திற்குரியவனாக ஆகாத வரை அவர் (உண்மையான) இறைநம்பிக்கை கொண் டவர் ஆகமாட்டார்.16 இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 16,
			"arabicnumber": 16,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யாரிடம் மூன்று தன்மைகள் அமைந்துவிட்டனவோ அவர் இறைநம்பிக்கையின் சுவையை உணர்ந்துகொள்வார். (அவை:) 1. அல்லாஹ்வும் அவனுடைய தூதரும் அவருக்கு மற்றெதையும்விட அதிக நேசத்திற்குரியோர் ஆவது. 2. அல்லாஹ்வுக்காகவே ஒருவரை அவர் நேசிப்பது. 3. நெருப்பில் வீசப்படுவதை வெறுப் பதைப் போன்று இறைமறுப்புக்குத் திரும்புவதை அவர் வெறுப்பது.17 இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 17,
			"arabicnumber": 17,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையின் அடையாளம் அன்சாரிகளை நேசிப்பதாகும்; நயவஞ்சகத் தின் அடையாளம் அன்சாரிகளை வெறுப்பதாகும்.18 இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 18,
			"arabicnumber": 18,
			"text": "பத்ர் போரில் கலந்துகொண்டவரும், இரவில் நடந்த ‘அகபா’ உடன்பாட்டில் கலந்துகொண்ட (பன்னிரண்டு) தலைவர் களில் ஒருவருமான உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம்மைச் சுற்றிலும் தம் தோழர்களின் ஒரு குழுவினர் இருக்க, “அல்லாஹ்வுக்கு எதையும் (எவரையும்) இணையாக்கமாட்டீர்கள் என்றும், திருட மாட்டீர்கள் என்றும், விபசாரம் புரிய மாட்டீர்கள் என்றும், உங்கள் குழந்தை களைக் கொல்லமாட்டீர்கள் என்றும், நீங்கள் எவர்மீதும் அவதூறை இட்டுக் கட்டி உங்களிடையே பரப்பமாட்டீர்கள் என்றும், எந்த நல்ல காரியத்திலும் (எனக்கு) மாறு செய்யமாட்டீர்கள் என்றும் என்னிடம் உறுதிமொழி கொடுங்கள். உங்களில் யார் (இவற்றையெல்லாம்) நிறைவேற்றுகிறாரோ, அவருக்குப் பிரதி பலன் அளிப்பது அல்லாஹ்வின் பொறுப் பாகும். இவற்றில் (மேற்கூறப்பட்ட குற்றங்களில்) ஏதேனுமொன்றை ஒருவர் செய்து, அதற்காக அவர் இந்த உலகத்திலயே தண்டிக்கப்பட்டுவிட்டால் அதுவே அவருக்குரிய பரிகாரமாகிவிடும். இவற்றில் ஏதேனுமொன்றை ஒருவர் செய்து அல்லாஹ் அவரது குற்றத்தை (உலகத்தில்) மறைத்துவிட்டால், அவர் அல்லாஹ்வின் பொறுப்பில் விடப்படுகிறார். அவன் நாடினால் அவரை மன்னிப்பான்; அவன் நாடினால் அவரைத் தண்டிப்பான்” என்று சொன்னார்கள். உடனே நாங்கள் அதன்படி நபி (ஸல்) அவர்களிடம் உறுதிமொழி அளித்தோம். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 19,
			"arabicnumber": 19,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிமின் செல்வங்களிலேயே ஆடுதான் சிறந்த செல்வமாக இருக்கும் நிலை தோன்றக்கூடும். அவர் குழப்பங் களிலிருந்து தமது மார்க்க (விசுவாச)த் தைக் காத்துக்கொள்ள அந்த ஆட்டை ஓட்டிக்கொண்டு மலைகளின் உச்சிக்கும் மழை பொழியும் (கனவாய், பள்ளத்தாக்கு போன்ற) இடங்களுக்கும் சென்றுவிடுவார். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 20,
			"arabicnumber": 20,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நல்லவற்றை(ச் செய்யுமாறு) மக்களுக்குக் கட்டளையிட்டால், அவர்களால் இயன்ற செயல்களையே (செய்யுமாறு) கட்டளை யிடுவார்கள். மக்கள், “அல்லாஹ்வின் தூதரே! அல்லாஹ் உங்களுடைய முன் பின் பாவங்களை மன்னித்துவிட்டான். (ஆனால்,) எங்கள் நிலையோ உங்கள் நிலையைப் போன்றதன்று (நாங்கள் குறைந்த அளவில் நல்லறங்கள் புரிந்தால் போதாது; அதிகமாகச் செய்ய வேண்டிய நிலையில் உள்ளோம்)” என்று கூறி னார்கள். (இதைக் கேட்ட) உடன் நபி (ஸல்) அவர்கள் கோபமடைந்தார்கள். எந்த அளவுக்கென்றால் கோபத்தின் அறிகுறி அவர்களது முகத்தில் காணப்பட்டது. பிறகு “உங்கள் அனைவரைவிடவும் நான் (அல்லாஹ்வை) நன்கு அஞ்சி நடப்பவ னும் அல்லாஹ்வைப் பற்றி அறிந்தவனும் ஆவேன்” என்று கூறினார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 21,
			"arabicnumber": 21,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யாரிடம் மூன்று தன்மைகள் அமைந்துவிட்டனவோ அவர் இறைநம்பிக்கையின் சுவையை உணர்ந்துகொள்வார். (அவை:) 1. அல்லாஹ்வும் அவனுடைய தூதரும் ஒருவருக்கு மற்ற அனைத்தையும்விட அதிக நேசத்திற்குரியோர் ஆவது. 2. அல்லாஹ்வுக்காகவே ஓர் அடியாரை ஒருவர் நேசிப்பது. 3. ஒருவரை அல்லாஹ் இறைமறுப்பி லிருந்து காத்தபின், இறைமறுப்புக்குத் திரும்புவதைத் தாம் நெருப்பில் வீசப்படு வதைப் போன்று அவர் வெறுப்பது. இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.20 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 22,
			"arabicnumber": 22,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (மறுமையில் விசாரணைகள் முடிந்த பின்) சொர்க்கவாசிகள் சொர்க்கத்திலும் நரகவாசிகள் நரகத்திலும் நுழைந்துவிடு வார்கள். பிறகு “யாருடைய உள்ளத்தில் கடுகு வித்தளவேனும் இறைநம்பிக்கை (ஈமான்) இருக்கிறதோ அவரை (நரகத் திலிருந்து) வெறியேற்றிவிடுங்கள்” என்று உயர்ந்தோன் அல்லாஹ் கட்டளை யிடுவான். உடனே அவர்கள் (கருகிக்) கறுத்துவிட்ட நிலையில் நரகத்திலிருந்து வெளியேற்றப்படுவார்கள். பின்னர் ‘மழைநதி’யில் (நஹ்ருல் ஹயா) அல்லது ‘ஜீவநதி’யில் (நஹ்ருல் ஹயாத்) அவர்கள் இடப்படுவார்கள். -இந்த இடத்தில் அறிவிப்பாளர்களில் ஒருவரான மாலிக் பின் அனஸ் (ரஹ்) அவர்கள் ஐயப்பாட்டுடன் அறிவிக்கிறார்கள்.- (அவ்வாறு அவர்கள் அந்த நதியில் போடப்பட்டதும்) ஓடைக் கரையில் விதைப் பயிர் முளைப்பதைப் போன்று (நிறம்) மாறிவிடுவார்கள். அந்த வித்து(விலிருந்து வரும் பயிர்கள்) மஞ்சள் நிறத்தில் (பார்ப்பதற்கு அழகாகவும், காற்றில்) அசைந்தாடியதாக(வும்) வெளிவருவதை நீர் கண்டதில்லையா? இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில், வுஹைப் பின் காலித் (ரஹ்) அவர்களது அறிவிப்பில், (மழைநதி அல்லது ஜீவநதி என்று சந்தேகத்தோடு அறிவிக்காமல்) ஜீவநதி என்று (உறுதியுடன்) அம்ர் பின் யஹ்யா (ரஹ்) அவர்கள்அறிவிக்கிறார்கள். ஆயினும், (கடுகு வித்தளவு இறை நம்பிக்கை என்பதற்குப் பதிலாக) ‘கடுகளவு நன்மை’ என்று அறிவித்துள்ளார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 23,
			"arabicnumber": 23,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “நான் உறங்கிக்கொண்டி ருக்கும்போது (கனவில்), மக்கள் (பல விதமான) சட்டைகளை அணிந்தவர்களாக எனக்கு எடுத்துக்காட்டப்பட்டனர். அவற்றில் (அவர்களுடைய) மார்பை எட்டக்கூடியவையும், மார்பை எட்டாத வையும் இருந்தன. உமர் பின் அல்கத்தாப் அவர்கள் (தரையில்) இழுபடும் அளவுக்கு (நீளமான) சட்டையொன்றை அணிந்தவராக எனக்குக் காட்டப்பட்டார்” என்று கூறினார்கள். மக்கள், “அல்லாஹ்வின் தூதரே! இதற்கு நீங்கள் என்ன விளக்கம் கண்டீர்கள்?” என்று கேட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(அந்தச் சட்டைகள் அவர்களுடைய) மார்க்கத்தை (மார்க்க உணர்வையும் செயல்பாடுகளையும்) குறிக்கும்” என்று பதிலளித்தார்கள்.21 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 24,
			"arabicnumber": 24,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்சாரிகளில் ஒருவரைக் கடந்து சென் றார்கள். வெட்கப்படுவது தொடர்பாக(க் கண்டித்து) தம் சகோதரருக்கு அவர் அறிவுரை கூறிக்கொண்டிருந்தார். (இதைக் கண்ட) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் “அவரை(க் கண்டிக்காதீர்கள்;) விட்டுவிடுங்கள். ஏனெனில், நாணமும் இறைநம்பிக்கையின் ஓர் அம்சமே” என்று கூறினார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 25,
			"arabicnumber": 25,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: “அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை; முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் தூதர்” என உறுதிமொழிந்து, (கடமையான) தொழுகையைக் கடைப்பிடித்து, ஸகாத் (எனும் கட்டாய தர்மத்)தை வழங்காத வரை (இணைவைக்கும்) மக்களுடன் போரிடும்படி நான் கட்டளையிடப்பட்டேன். இவற்றை அவர்கள் செய்துவிடுவார்களானால், தம் உயிரையும் உடைமை களையும் என்னிடமிருந்து அவர்கள் பாதுகாத்துக்கொள்ள முடியும். (மரண தண்டனைக்குரிய) இஸ்லாத்தின் இதர உரிமைகளில் (அவர்கள் எல்லை மீறினால்) தவிர! மேலும், (இரகசியமாகக் குற்றமிழைத் தால்) அவர்களின் விசாரணை அல்லாஹ் வின் பொறுப்பில் உள்ளது.23 இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 26,
			"arabicnumber": 26,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களி டம் “எந்த நற்செயல் சிறந்தது?” என்று கேட்கப்பட்டது. அதற்கு அவர்கள் “அல்லாஹ்வின் மீதும் அவனுடைய தூதரின் மீதும் நம்பிக்கை (ஈமான்) கொள்வது” என்று பதிலளித்தார்கள். “பிறகு எது?” என்று கேட்கப்பட்ட போது, “இறைவழியில் அறப்போர் புரிவது” என்றார்கள். “பிறகு எது?” என்று கேட்கப் பட்டபோது, “ஏற்றுக்கொள்ளப்பட்ட ஹஜ்” என்று சொன்னார்கள்.24 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களுடன் நான் அமர்ந்திருந்தபோது, அவர்கள் (மக்களில்) ஒரு குழுவினருக்கு (மட்டும் தர்மப் பொருட்களை) வழங்கினார் கள். அப்போது அவர்களில் எனக்குப் பிடித்த ஒருவருக்கு (ஏதும் வழங்காமல்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் விட்டுவிட்டார்கள். ஆகவே நான், “அல்லாஹ்வின் தூதரே! (அவரை ஏன் விட்டுவிட்டீர்கள்?) அவர்மீது உங்களுக்கு என்ன (அதிருப்தி)? அல்லாஹ்வின் மீதாணையாக! அவரை நான் ஓர் இறைநம்பிக்கையாளர் (முஃமின்) என்றே கருதுகின்றேன்” என்றேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவரை முஸ்லிம் (வெளித் தோற்றத்தில் இறைநம்பிக்கையாளர்) என்று சொல்க” என்றார்கள். சிறிது நேரம் நான் அமைதியாக இருந்தேன். நான் அவரைப் பற்றி அறிந்திருந்த விஷயங்கள் என்னை மிகைத்துவிடவே, முன்பு சொன்னதையே திரும்பவும் சொன்னேன். “அவர் மீது உங்களுக்கு என்ன (அதிருப்தி)? அல்லாஹ்வின் மீதாணையாக! நிச்சயமாக நான் அவரை ஓர் இறைநம்பிக்கையாளர் (முஃமின்) என்றே கருதுகிறேன்” என்றேன். அதற்கும் அலலாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவரை முஸ்லிம் என்று சொல்க” என்றார்கள். அவரைப் பற்றி நான் அறிந்திருந்த விஷயங்கள் என்னை மிகைத்துவிடவே, முன்பு சொன்னதை மறுபடியும் சொன்னேன். அப்போதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பழைய பதிலையே கூறி விட்டு, “சஅத்! நான் ஒருவருக்குக் கொடுக் கிறேன்; ஆனால், மற்றொருவர் அவரை விட என் அன்புக்குரியவராய் இருப்பார். (அப்படியிருந்தும் அவருக்கு நான் கொடுப் பதற்குக்) காரணம், (கொடுக்காதிருந்து விட்டால் வறுமையால் குற்றம் இழைத்து அதனால்) அவரை அல்லாஹ் நரகத்தில் முகம்குப்புறத் தள்ளிவிடுவானோ என்ற அச்சம்தான்” என்றார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 28,
			"arabicnumber": 28,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், “இஸ்லாமி(யப் பண்பு களி)ல் சிறந்தது எது?” என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(பசித்தோருக்கு) நீங்கள் உணவளிப்பதும், அறிந்தவர்களுக்கும் அறியாதவர்களுக் கும் ‘சலாம்’ சொல்வதும் ஆகும்” என்று பதிலளித்தார்கள்.27 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 29,
			"arabicnumber": 29,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் “(நான் சூரிய கிரகணத் தொழுகையில் இருந்தபோது) எனக்கு நரகம் காட்டப்பட்டது. நரகவாசிகளில் அதிகம்பேர் பெண்களாகவே இருந்தனர். பெண்கள் நிராகரிக்கின்றனர்” என்று கூறினார்கள். அப்போது “இறைவனையா அவர்கள் நிராகரிக்கிறார்கள்?” என்று கேட்கப்பட்டது. நபி (ஸல்) அவர்கள், “கணவனை நிராகரிக் கிறார்கள்; (அதாவது அவன் செய்த) உதவி களுக்கு நன்றி செய்ய மறுக்கிறார்கள். அவர்களில் ஒருத்திக்குக் காலமெல்லாம் நீ உதவி செய்து, பிறகு உன்னிடம் ஏதேனும் (குறை) ஒன்றை அவள் கண்டால், ‘உன்னி டமிருந்து எந்த நலனையும் நான் கண்ட தேயில்லை’ என்று சொல்லிவிடுவாள்” எனப் பதிலளித்தார்கள். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 30,
			"arabicnumber": 30,
			"text": "மஅரூர் பின் சுவைத் (ரஹ்) அவர்கள் கூறியதாவது: நான் அபூதர் (ரலி) அவர்களை (மதீனாவுக்கு அருகிலுள்ள) ‘ரபதா’ எனுமிடத்தில் சந்தித்தேன். அப்போது அவர்மீது (பழையதும் புதியதுமாக) ஒரு ஜோடி ஆடையும் (அதைப் போன்றே) அவருடைய அடிமைமீது ஒரு ஜோடி ஆடையும் இருப்பதைக் கண்டேன். நான் (அடிமையும் உரிமையாளரும் ஒரே விதமான உடையணிந்திருப்பதைக் கண்டு வியந்தவனாக) அதைப் பற்றி அபூதர் (ரலி) அவர்களிடம் கேட்டேன். அதற்கு அவர்கள் கூறினார்கள்: நான் (ஒரு முறை) ஒரு மனிதரை ஏசிக்கொண்டிருக்கையில் அவருடைய தாயைக் கொண்டு அவரை இழிவு படுத்திப் பேசிவிட்டேன். அப்போது என்னைப் பார்த்து நபி (ஸல்) அவர்கள், “அபூதர்! அவருடைய தாயைக் குறிப்பிட்டு இழிவுபடுத்திப் பேசினீரா? நீர் அறியாமைக் காலத்துக் கலாசாரம் உள்ள மனிதராகவே இருக்கின்றீர். உங்களின் அடிமைகள் உங்களின் சகோதரர்கள் ஆவர். அல்லாஹ்தான் அவர்களை உங்கள் அதிகாரத்தின்கீழ் வைத்துள்ளான். எனவே, தம் சகோதரரைத் தமது அதிகாரத்தில் வைத்திருப்பவர் தாம் உண்பதிலிருந்து அவருக்கு உணவளிக்கட்டும். தாம் உடுத்துவதிலிருந்து அவருக்கு உடுத்தத் தரட்டும். அவர்களின் சக்திக்கு மீறிய பணியைக் கொடுத்து அவர்களைச் சிரமப்படுத்த வேண்டாம். அவ்வாறு கொடுத்தால், அவர்களுக்கு நீங்கள் ஒத்துழையுங்கள்” என்று கூறினார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 31,
			"arabicnumber": 31,
			"text": "அஹ்னஃப் பின் கைஸ் (ரஹ்) அவர்கள் கூறியதாவது: நான் (முஸ்லிம்களிடையே நடந்த ‘ஜமல்’ போரின்போது) இந்த மனிதருக்கு (அலீ (ரலி) அவர்களுக்கு) உதவி செய்வ தற்காகப் போய்க்கொண்டிருந்தேன். அப்போது அபூபக்ரா (ரலி) அவர்கள் என்னைச் சந்தித்து “எங்கே செல்கிறீர்?” எனக் கேட்டார்கள். நான் “இந்த மனிதருக்கு உதவி செய்யப்போகிறேன்” என்றேன். அதற்கு அபூபக்ரா (ரலி) அவர்கள் “நீர் திரும்பிச் சென்றுவிடும்; ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘இரண்டு முஸ்லிம்கள் தம் வாட்களை ஏந்தி சண்டையிட்டுக்கொண்டால், அதில் கொன்றவரும் கொல்லப்பட்டவரும் நரகத்திற்குத் தான் செல்வார்கள்’ என்று கூறுவதை நான் கேட்டேன். உடனே நான் ‘அல்லாஹ்வின் தூதரே! இவரோ கொலைகாரர்; (நரகத்திற்குச் செல்வது சரி) கொல்லப்பட்டவரின் நிலை என்ன (அவர் ஏன் நரகம் செல்ல வேண்டும்)?’ என்று கேட்டேன். அதற்கு அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் ‘அவர் தம் சகாவைக் கொல்ல வேண்டுமென்று பேராசை கொண்டிருந்தார்’ என்று சொன்னார்கள்” என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 32,
			"arabicnumber": 32,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: “யார் இறைநம்பிக்கை கொண்டு, பிறகு தமது இறைநம்பிக்கையில் அநீதியைக் கலந்துவிடவில்லையோ அவர்களுக்கு மட்டுமே பாதுகாப்பு உண்டு. மேலும், அவர்களே நல்வழி பெற்றவர்கள் ஆவர்” (6:82) எனும் இறைவசனம் அருளப்பெற்ற போது, நபித்தோழர்கள் “எங்களில் யார்தான் தமக்குத்தாமே அநீதி இழைக் காதவர்?” என்று கேட்டார்கள். அப்போது அல்லாஹ், “இணை கற்பிப்பதுதான் மிகப்பெரும் அநீதியாகும்” (31:13) எனும் வசனத்தை அருளினான்.32 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 33,
			"arabicnumber": 33,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நயவஞ்சகனின் அடையாளங்கள் மூன்றாகும். அவன் பேசும்போது பொய் பேசுவான்; வாக்களித்தால் அதற்கு மாறு செய்வான்; அவனிடம் நம்பி (ஏதேனு மொன்றை) ஒப்படைத்தால் (அதில்) மோசடி செய்வான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 34,
			"arabicnumber": 34,
			"text": "அல்லாஹ்வின் தூதர்(ஸல்) அவர்கள் கூறினார்கள்: நான்கு குணங்கள் எவனிடம் உள்ள னவோ அவன் அப்பட்டமான நயவஞ்ச கன் (முனாஃபிக்) ஆவான். எவனிடம் அவற்றில் ஒரு குணம் உள்ளதோ அவன் அதை விட்டொழிக்கும்வரை நயவஞ்சகத் தின் ஒரு குணம் அவனிடம் குடியிருக் கும். (ஏதேனுமொன்றை) நம்பி ஒப்படைத் தால் (அதில்) மோசடி செய்வதும், பேசும் போது பொய் சொல்வதும், ஒப்பந்தம் செய்துகொண்டால் நம்பிக்கை துரோகம் செய்வதும், வழக்காடினால் நேர்மை தவறுவதும்தான் அவை (நான்கும்).33 இதை அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 35,
			"arabicnumber": 35,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் இறைநம்பிக்கையோடும் நன் மையை எதிர்பார்த்தும் மகத்துவமிக்க (லைலத்துல் கத்ர்) இரவில் நின்று வழிபடு கிறாரோ அவரது முந்தைய பாவங்கள் மன்னிக்கப்படும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 36,
			"arabicnumber": 36,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: தனது வழியில் (அறப்போர் புரிய) புறப்பட்டுச் சென்றவருக்கு அல்லாஹ் விரைவாக நற்பலன் வழங்குவான். அல்லாஹ்வின் மீதும் அவன் தூதர்கள் மீதும் கொண்ட நம்பிக்கையாலேயே அவர் புறப்பட்டிருக்க வேண்டும். அவர் அடையும் நன்மையுடன், அல்லது போர்ச் செல்வங்களுடன் அவரைத் திரும்பச் செய்வதற்கோ, அல்லது அவரைச் சொர்க் கத்தில் அனுமதிப்பதற்கோ (அல்லாஹ் பொறுப்பேற்றுக் கொள்கிறான்). என் சமுதாயத்திற்குச் சிரமம் ஏற்பட்டுவிடும் எனும் அச்சம் மட்டும் எனக்கு இல்லாவிட்டால், (நான்) அனுப்பும் எந்தப் படைப்பிரிவுக்குப் பின்னரும் (ஊரில்) நான் அமர்ந்திருக்கமாட்டேன். நிச்சயமாக நான் இறைவழியில் (போரிட்டுக்) கொல்லப்பட்டு, மீண்டும் உயிர்ப்பிக்கப்பட்டு, மீண்டும் (இறைவழியில்) கொல்லப்பட்டு, மீண்டும் உயிர்ப்பிக்கப்பட்டு, மீண்டும் (அவ்வழியில்) கொல்லப்பட (இவ்வாறே மீண்டும் மீண்டும் இறைவழியில் உயிர்த்தியாகம் செய்ய) வேண்டும் என்றே விரும்புகிறேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 37,
			"arabicnumber": 37,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் இறைநம்பிக்கையோடும் நன் மையை எதிர்பார்த்தும் ரமளான் மாதத்தில் நின்று வழிபடுகிறாரோ அவரது முந்தைய பாவங்கள் மன்னிக்கப்படும். இதை அபூஹுரைரா (ரலி) அறிவிக் கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 38,
			"arabicnumber": 38,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் இறைநம்பிக்கையோடும் நன் மையை எதிர்பார்த்தும் ரமளான் மாதத்தில் நோன்பு நோற்கிறாரோ அவரது முந்தைய பாவங்கள் மன்னிக்கப்படும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 39,
			"arabicnumber": 39,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நிச்சயமாக, இந்த மார்க்கம் எளிதானது. இந்த மார்க்கத்தை எவரேனும் (தம்மீது) சிரமமானதாக ஆக்கிக்கொண்டால், அது அவரை மிகைக்காமல் விடாது. எனவே, (கூடுதலான வழிபாடுகள் உட்பட அனைத் துக் காரியங்களிலும்) நடுநிலையையே கடைப்பிடியுங்கள். இயன்றதைச் செய்யுங் கள்; நற்செய்தி பெறுங்கள்; (கூடுதல் வழிபாடுகளை உற்சாகத்துடனும் நிரந்தர மாகவும் நிறைவேற்றிட) காலையையும் மாலையையும் இரவில் சிறிது நேரத்தையும் துணையாக்கிக்கொள்ளுங்கள்.34 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 40,
			"arabicnumber": 40,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவுக்கு வந்த ஆரம்பத்தில் ‘தம் பாட்டனார்களி(ன் வமிசாவளியினரி)டத்தில்’ அல்லது ‘அன்சாரிகளிலுள்ள தம் மாமன்மார்களி(ன் வமிசாவளியினரி)டத்தில்’ தங்கியிருந்தார் கள். நபி (ஸல்) அவர்கள் (ஜெருசலத்தி லுள்ள) பைத்துல் மக்திஸை, நோக்கி ‘பதினாறு மாதங்கள்’ அல்லது ‘பதினேழு மாதங்கள்’ தொழுதார்கள். (மக்காவிலுள்ள) இறையில்லம் கஅபாவே தொழுகையில் தாம் முன்னோக்கும் திசையாக இருக்க வேண்டும் என்பதே அவர்களின் விருப்பமாக இருந்தது. (பிறகு கஅபாவை முன்னோக்கித் தொழும்படி, இறைவனிடமிருந்து உத்தரவு வந்தது. கஅபாவை முன்னோக்கி) நபி (ஸல்) அவர்கள் தொழுத முதல் தொழுகை அஸ்ர் தொழுகையாகும். (அந்தத் தொழுகையை) நபி (ஸல்) அவர்களுடன் மக்கள் சிலரும் தொழுதனர். அவர்களில் ஒருவர் அங்கிருந்து புறப்பட்டு (மற்றொரு) பள்ளிவாசலில் (தொழுதுகொண்டு) இருந்தவர்களைக் கடந்து சென்றார். அப்போது அங்கிருந்தவர்கள் ‘ருகூஉ’ செய்துகொண்டிருந்தனர். உடனே அவர், “அல்லாஹ்வின் மீதாணையாக! நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் சேர்ந்து மக்கா(விலுள்ள கஅபா)வை நோக்கித் தொழுதேன்” என்று சொல்ல, அவர்கள் (அனைவரும்) அப்படியே (ருகூஉவிலிருந்தபடியே சுழன்று) கஅபாவை நோக்கித் திரும்பிக்கொண்டார்கள். நபி (ஸல்) அவர்கள் பைத்துல் மக்திஸை நோக்கித் தொழுதுவந்தது, யூதர்களுக்கும் மற்ற வேதக்காரர்களுக்கும் மகிழ்ச்சியாகவே இருந்துவந்தது. (தொழுகையில்) தமது முகத்தை நபி (ஸல்) அவர்கள் கஅபாவை நோக்கித் திருப்பியபோது அதை அவர்கள் வெறுத்தார்கள். மற்றோர் அறிவிப்பில், “(புதிய கிப்லா வான கஅபாவுக்கு) கிப்லா மாற்றப்படு வதற்குமுன் (பழைய பைத்துல் மக்திஸ்) கிப்லாவை நோக்கித் தொழுத காலத்தி லேயே சிலர் இறந்து விட்டிருந்தனர்; சிலர் கொல்லப்பட்டுவிட்டனர். அவர்கள் விஷயத்தில் நாங்கள் என்ன கூறுவது என்று எங்களுக்குத் தெரியவில்லை. அப்போது உயர்ந்தோன் அல்லாஹ், ‘அல்லாஹ் உங்கள் நம்பிக்கையை (அதாவது தொழுகையை) பாழ்ப்படுத்தப் போவதில்லை’ (2:143) எனும் வசனத்தை அருளினான்” என்று இடம்பெற்றுள்ளது.35 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 41,
			"arabicnumber": 41,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஓர் அடியார் இஸ்லாத்தைத் தழுவி, அவரது இஸ்லாம் (அகத்திலும் புறத்திலும்) அழகு பெற்றுவிட்டால், அவர் அதற்குமுன் செய்த அனைத்துத் தீமைகளையும் அல்லாஹ் மாய்த்துவிடுகின்றான். அதற்குப் பின்னர் (அவர் செய்யும் நன்மை, தீமைகள்) நிகருக்கு நிகராக இருக்கும். (நன்மை செய்தால் நன்மையும் தீமை செய்தால் தீமையும் கிடைக்கும். அதிலும்) ஒரு நன்மைக்கு அது போன்ற பத்து முதல் எழுநூறு மடங்கு நன்மை கிடைக்கும். (ஆனால்,) ஒரு பாவத்திற்கு அதைப் போன்ற ஒன்றே (தண்டனையாகக்) கிடைக்கும். அதையும் அல்லாஹ் மன்னித்துவிட்டால் (எந்தத் தண்டனையும்) கிடையாது. இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 42,
			"arabicnumber": 42,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தமது இஸ்லாமை (நம்பிக்கையாலும் நடத்தையாலும்) அழகாக்கிக்கொண்டால், அவர் செய்யும் ஒவ்வொரு நன்மைக்கும் பத்து மடங்கி லிருந்து எழுநூறு மடங்குவரை (நன்மை) பதிவு செய்யப்படும். அவர் செய்யும் ஒவ் வொரு தீமைக்கும் அத்தீமை போன்றே (ஒரு தீமையே) பதிவு செய்யப்படும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 43,
			"arabicnumber": 43,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: என்னிடத்தில் ஒரு பெண்மணி அமர்ந்திருக்கும்போது நபி (ஸல்) அவர்கள் (வீட்டுக்கு) வந்தார்கள். “யார் இவர்?” என்று கேட்டார்கள். நான் “இவர் இன்னவர்?” என்று கூறிவிட்டு, அவரது தொழுகையைப் பற்றி (சிலாகித்து)க் கூறினேன். அப்போது நபி (ஸல்) அவர்கள், “போதும் நிறுத்து! (வழிபாடுகளில்) உங்களால் முடிந்தவற்றைச் செய்துவாருங்கள். அல்லாஹ்வின் மீதாணையாக! நீங்கள் சலிப்படையாத வரை அல்லாஹ் சலிப்படையமாட்டான். மேலும், மார்க்கத்தின் நல்லறங்களில் அல்லாஹ்வுக்கு மிகவும் விருப்பமானவை, ஒருவர் நிரந்தரமாகச் செய்யும் நற்செயல்கள்தான்” என்று கூறினார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 44,
			"arabicnumber": 44,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யார் தமது உள்ளத்தில் ஒரு வாற்கோதுமையின் அளவு நன்மை இருக்கும் நிலையில், ‘லா இலாஹ இல்லல்லாஹ்’ (அல்லாஹ்வைத் தவிர வேறு இறைவ னில்லை) என்று சொன்னாரோ அவர் நரகத்திலிருந்து வெளியேறிவிடுவார். யார் தமது உள்ளத்தில் ஒரு மணிக்கோதுமையின் அளவு நன்மை இருக்கும் நிலையில், ‘லா இலாஹ இல்லல்லாஹ்’ சொன்னாரோ அவரும் நரகத்திலிருந்து வெளியேறிவிடுவார். யார் தமது உள்ளத்தில் ஓர் அணுவளவு நன்மை இருக்கும் நிலையில், ‘லா இலாஹ இல்லல்லாஹ்’ சொன்னாரோ அவரும் நரகத்திலிருந்து வெளியேறிவிடுவார். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், ‘நன்மை’ என்பதற்குப் பதிலாக ‘இறை நம்பிக்கை’ (‘ஈமான்’) என்று நபி (ஸல்) அவர்கள் குறிப்பிட்டதாக அனஸ் (ரலி) அவர்கள் அறிவித்துள்ளார்கள்.36 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 45,
			"arabicnumber": 45,
			"text": "தாரிக் பின் ஷிஹாப் (ரலி) அவர்கள் கூறியதாவது: யூதர்களில் ஒருவர் (கலீஃபா) உமர் பின் அல்கத்தாப் (ரலி) அவர்களிடம், “இறைநம்பிக்கையாளர்களின் தலைவரே! (அமீருல் முஃமினீன்!) நீங்கள் ஓதிக் கொண்டிருக்கும் உங்கள் வேதத்தில் ஒரு வசனம் உள்ளது. அது யூதர்களாகிய எங்கள்மீது அருளப்பெற்றிருக்குமானால், அந்நாளை நாங்கள் ஒரு பண்டிகை நாளாக்கிக்கொண்டிருப்போம்” என்றார். அதற்கு உமர் (ரலி) அவர்கள் “அது எந்த வசனம்?” எனக் கேட்டார்கள். அதற்கு அந்த யூதர், “இன்று உங்களின் மார்க்கத்தை உங்களுக்காக முழுமை யாக்கிவிட்டேன். உங்கள்மீது எனது அருட்கொடையை நிறைவாக்கிவிட்டேன். இஸ்லாத்தை உங்களுக்குரிய மார்க்கமாக நான் பொருந்திக்கொண்டுவிட்டேன்” (5:3) (என்பதே அந்த வசனமாகும்)” என்றார். அதற்கு உமர் (ரலி) அவர்கள் “இந்த வசனம் எந்த நாளில் எந்த இடத்தில் நபி (ஸல்) அவர்களுக்கு அருளப்பெற்றது என்பதை நாங்கள் அறிந்துள்ளோம். ஒரு வெள்ளிக்கிழமை தினத்தில் ‘அரஃபா’ பெருவெளியில் நபி (ஸல்) அவர்கள் நின்றுகொண்டிருக்கும்போதுதான் (இவ்வசனம் அருளப்பெற்றது; அந்த நாள் எங்களுக்குப் பண்டிகை நாள்தான்)” என்றார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 46,
			"arabicnumber": 46,
			"text": "தல்ஹா பின் உபைதில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நஜ்த்வாசிகளில் ஒருவர் தலைவிரி கோலத்துடன் (பயணம் முடிந்த கையோடு) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தார். (தூரத்திலிருந்து) ஒலித்த அவரது குரல் கேட்டதே தவிர, அவர் என்ன சொல்கிறார் என்பதை எங்களால் விளங்க முடியவில்லை. அவர் (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு) அருகில் வந்ததும் இஸ்லாத்தைப் பற்றிக் கேட்டார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “பகலிலும் இரவிலும் ஐந்து தொழுகைகள்” என்றார்கள். அவர் “இவற்றைத் தவிர வேறு (தொழுகைகள்) ஏதாவது என்மீது (கடமையாக்கப்பட்டு) உள்ளதா?” என்று கேட்க, “இல்லை, நீயாக விரும்பித் தொழும் (கூடுதலான) தொழுகையைத் தவிர” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பதிலளித்தார்கள். மேலும், ரமளான் மாதம் நோன்பு நோற்க வேண்டும் என்றும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். உடனே அவர், ‘இதைத் தவிர வேறு ஏதேனும் (நோன்பு) என்மீது (கடமையாக்கப்பட்டு) உள்ளதா?” எனக் கேட்க, “இல்லை, நீயாக விரும்பி நோற்கும் (கூடுதலான) நோன்பைத் தவிர” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஸகாத் பற்றியும் அவருக்கு எடுத்து ரைத்தார்கள். அவர், “இதைத் தவிர வேறு (தர்மம்) ஏதேனும் என்மீது (கடமையாக் கப்பட்டு) உள்ளதா?” என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இல்லை, நீயாக விரும்பிச் செய்யும் (கூடுதலான) தர்மத்தை தவிர” என்றார்கள். அந்த மனிதர், “அல்லாஹ்வின் மீதாணையாக! நான் இதற்குமேல் அதிகமாகச் செய்யவுமாட்டேன்; இதைக் குறைக்கவுமாட்டேன்” என்று கூறியவாறு திரும்பிச் சென்றுவிட்டார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவர் உண்மையாகவே (இதைக்) கூறியிருந்தால், அவர் வெற்றியடைந்து விட்டார்” என்று சொன்னார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 47,
			"arabicnumber": 47,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் இறைநம்பிக்கையோடும் நன்மையை எதிர்பார்த்தும் ஒரு முஸ்லிமின் ஜனாஸாவை (பிரேதத்தை)ப் பின் தொடர்ந்து சென்று, அதற்காக (இறுதி)த் தொழுகை நடத்தப்பட்டு, அது அடக்கம் செய்யப்படும்வரை அதனுடன் இருந்தாரோ அவர் இரண்டு ‘கீராத்’ நன்மையுடன் திரும்புகிறார். ஒவ்வொரு ‘கீராத்’தும் ‘உஹுத்’ மலை போன்றதாகும். யார் அதற்காக (இறுதி)த் தொழுகையை மட்டும் முடித்துவிட்டு, அதை அடக்கம் செய்யும் முன்னர் திரும்பிவிடுகிறாரோ அவர் ஒரு ‘கீராத்’ நன்மையுடன் திரும்புகிறார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 48,
			"arabicnumber": 48,
			"text": "ஸுபைத் பின் அல்ஹாரிஸ் (ரஹ்) அவர்கள் கூறியதாவது: நான் அபூவாயில் (ஷகீக் பின் உபைதில்லாஹ் - ரஹ்) அவர்களிடம் ‘முர்ஜிஆக்கள்’ (‘இறைநம்பிக்கையாளர் கள் செய்யும் எந்தப் பாவத்திற்கும் தண்டனை கிடையாது’ என்று கூறுவது) பற்றிக் கேட்டேன். அப்போது அபூவாயில் (ரஹ்) அவர்கள் கூறினார்கள்: நபி (ஸல்) அவர்கள், “ஒரு முஸ்லிமை ஏசுவது பாவமாகும்; அவனுடன் போரிடு வது (அல்லது கொலை செய்வது) இறை மறுப்பு (போன்ற குற்றச்செயல்) ஆகும்” என்று கூறியதாக அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் என்னிடம் கூறினார்கள்.37 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 49,
			"arabicnumber": 49,
			"text": "உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ‘லைலத்துல் கத்ர்’ (கண்ணியமிக்க இரவு) பற்றி (‘அது ரமளான் மாதத்தில் எந்த இரவு’ என்று) அறிவிப்பதற்காக(த் தமது வீட்டிலிருந்து) வெளியே வந்தார்கள். அப்போது இரு முஸ்லிம்கள் தமக்கிடையே சச்சரவு செய்துகொண்டிருந்தார்கள். (இதைக் கண்ணுற்ற) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “லைலத்துல் கத்ர் இரவு பற்றி உங்களுக்கு அறிவிப்பதற்காக நான் புறப்பட்டுவந்தேன். அப்போது இன்ன மனிதரும் இன்ன மனிதரும் சச்சரவு செய்துகொண்டிருந்தனர். (அவர் களை விலக்கிவிடச் சென்றேன்.) எனவே, அது (பற்றிய விளக்கம் என் நினைவி லிருந்து) நீக்கப்பட்டுவிட்டது. அதுவும் உங்களுக்கு ஒரு நன்மையாக இருக்க லாம். (ரமளான் மாதத்தின் இருபத்து) ஏழு, (இருபத்து) ஒன்பது, (இருபத்து) ஐந்து ஆகிய (ஒற்றை எண்ணிக்கையிலான) இரவுகளில் அதைத் தேடிக்கொள் ளுங்கள்” என்றார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 50,
			"arabicnumber": 50,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரு நாள் மக்கள்முன் (வெளிப்படையாக) வந்தி ருந்தார்கள். அப்போது அவர்களிடம் ஒரு மனிதர் வந்து, “ஈமான் என்றால் என்ன?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள் “ஈமான் என்பது, அல்லாஹ்வை யும் அவனுடைய வானவர்களையும் அவனுடைய வேதங்களையும் அவனது சந்திப்பையும் அவனுடைய தூதர்களையும் நீர் நம்புவதும், (மறுமையில்) உயிர்ப்பித்து எழுப்பப்படுவதை நீர் நம்புவதும் ஆகும்” என்று பதிலளித்தார்கள். அடுத்து அவர், “இஸ்லாம் என்றால் என்ன?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “இஸ்லாம் என்பது அல்லாஹ்வை நீர் வழிபடுவதும், அவனுக்கு (எதனையும் எவரையும்) இணையாக்காமலிருப்பதும், தொழுகையைக் கடைப்பிடிப்பதும், கடமையாக்கப்பட்ட ஸகாத்தை வழங்கி வருவதும், ரமளான் மாதத்தில் நோன்பு நோற்பதும் ஆகும்” என்றார்கள். அடுத்து “இஹ்ஸான் என்றால் என்ன?” என்று அவர் கேட்டார். நபி (ஸல்) அவர்கள் “(இஹ்ஸான் என்பது) அல்லாஹ்வை (நேரில்) காண்பதைப் போன்று நீர் வழிபடுவதாகும். நீர் அவனைப் பார்க்காவிட்டாலும் அவன் உம்மைப் பார்த்துக்கொண்டிருக்கிறான் (என்ற உணர்வுடன் வழிபடுவதாகும்)” என்றார்கள்.39 அடுத்து அவர் “மறுமை (நாள்) எப்போது?” என்று கேட்க, அதற்கு நபி (ஸல்) அவர்கள் “இதைப் பற்றிக் கேள்வி கேட்கப்பட்டவர் (அதாவது நான்), கேள்வி கேட்பவரைவிட (அதாவது உம்மைவிட) அதிகம் அறிந்தவர் அல்லர். (ஆயினும்,) மறுமையின் அடையாளங்கள் சிலவற்றை உமக்கு அறிவிக்கிறேன். (அவை:) ஓர் அடிமைப் பெண் தன் உரிமையாளனைப் பெற்றெடுத்தல்;40 கறுப்பு நிற (மட்டமான) ஒட்டகங்களை மேய்ப்பவர்கள் உயரமான கட்டடங்கள் கட்டித் தமக்குள் பெருமையடித்துக் கொள்ளல். (மறுமை நாள் எப்போது வரவிருக்கிறது எனும் அறிவு) அல்லாஹ்வைத் தவிர வேறெவரும் அறியாத ஐந்து விஷயங்களில் அடங்கும்” என்று கூறிவிட்டு, “உலக முடிவு பற்றிய அறிவு அல்லாஹ்விடம் மட்டுமே இருக்கின்றது...” (31:34) எனும் இறைவசனத்தை ஓதினார்கள். பிறகு அந்த மனிதர் திரும்பிச் சென்றுவிட்டார். அப்போது நபி (ஸல்) அவர்கள், “அவரை (என்னிடம்) திரும்ப அழைத்து வாருங்கள்” என்றார்கள். (அவரைத் தேடிச் சென்றவர்கள்) அவரை எங்கும் காணவில்லை. அப்போது நபி (ஸல்) அவர்கள், “இ(ப்போது வந்துபோன)வர்தான் (வானவர்) ஜிப்ரீல். மக்களுக்கு அவர்களது மார்க்கத்தை (தீன்) கற்றுத்தர வந்திருந்தார்” என்றார்கள். அபூஅப்தில்லாஹ் (புகாரியாகிய நான்) கூறுகின்றேன்: ஜிப்ரீல் (அலை) அவர்களுக்கு தாம் அளித்த பதில்கள் அனைத்தையும் நபி (ஸல்) அவர்கள் இறைநம்பிக்கையின் (‘தீன்’) அம்சங்களாகவே கருதினார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 51,
			"arabicnumber": 51,
			"text": "(கிழக்கு ரோமானியப் பேரரசர்) ஹிரக்ளீயஸ் தம்மிடம் சொன்னதாக அபூ சுஃப்யான் (ரலி) அவர்கள் கூறியதாவது: நான் உம்மிடம் “(தம்மை இறைத்தூதர் என்று கூறும்) அவ(ரைப் பின்பற்றுப)வர் கள் (நாளுக்கு நாள்) அதிகரித்து வருகின் றனரா? அல்லது குறைந்து வருகின்ற னரா?” என்று கேட்டேன். அதற்கு நீர் “அவர்கள் அதிகரித்தே வருகின்றனர்” என்று கூறினீர். அவ்வாறுதான் இறை நம்பிக்கை நிறைவடையும்வரை (வளர்ந்து கொண்டேதான்) இருக்கும். நான் உம்மிடம் “அவரது மார்க்கத்தில் இணைந்தோரில் யாரேனும் அதன் மீது அதிருப்தி கொண்டு அதிலிருந்து வெளியேறிச் செல்வதுண்டா?” என்று கேட்டேன். அதற்கு நீர், ‘இல்லை’ என்று பதிலளித்தீர். இறைநம்பிக்கை இத்தகையதே. அதன் மலர்ச்சி இதயங்களில் கலந்துவிடும்போது அதைக் குறித்து யாருமே அதிருப்தி அடையமாட்டார். இதை அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.41 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 52,
			"arabicnumber": 52,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அனுமதிக்கப்பட்டதும் (ஹலால்) தெளிவானது. தடை செய்யப்பட்டதும் (ஹராம்) தெளிவானது. இவ்விரண்டுக்கும் இடையில் சந்தேகத்திற்கு இடமானவையும் (முஷப்பஹாத்) இருக்கின்றன. அவற்றை மக்களில் பெரும்பாலோர் அறியமாட்டார் கள். எனவே, யார் சந்தேகத்திற்கு இடமான வற்றைத் தவிர்த்துக்கொள்கிறாரோ அவர் தமது மார்க்கத்தையும் மானத்தையும் காப்பாற்றிக்கொள்கிறார். யார் சந்தேகத்திற் கிடமானவற்றில் தலையிடுகிறாரோ அவர், (அனுமதிக்கப்படாதவற்றில் தலையிடு கிறார்.) வேலியோரங்களில் (கால்நடை களை) மேய்ப்பவரைப் போன்று. அவர் (ஒரு நாள்) வேலிக்குள்ளேயே (கால்நடைகளை) விட்டுவிட நேரும். அறிக! ஒவ்வொரு மன்னனுக்கும் ஓர் எல்லை உண்டு. அல்லாஹ்வின் பூமியில் அவனது எல்லை (வேலி) அவனால் தடை விதிக்கப்பெற்றவையே. அறிக! உடலில் ஒரு சதைத் துண்டு இருக்கிறது. அது சீரடைந்துவிட்டால் முழு உடலும் சீரடைந்து விடும். அது சீரழிந்துவிட்டால் முழு உடலும் சீரழிந்துவிடும். அறிக! அதுவே இதயம்.42 இதை நுஅமான் பின் பஷீர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 53,
			"arabicnumber": 53,
			"text": "அபூஜம்ரா (நஸ்ர் பின் இம்ரான் அள்ளுபஈ - ரஹ்) அவர்கள் கூறியதாவது: (பஸ்ராவின் ஆளுநராயிருந்த) இப்னு அப்பாஸ் (ரலி) அவர்களுடன் நான் அமர்ந்திருந்தேன். அவர்கள் என்னைத் தமது கட்டிலில் அமரவைத்திருந்தார்கள். அப்போது அவர்கள், “என்னிடம் நீங்கள் (பாரசீகத்தில் மொழிபெயர்ப்பவராக இங்கேயே) தங்கிவிடுங்கள். (அதற்காக) நான் எனது செல்வத்திலிருந்து ஒரு பங்கை உங்களுக்குத் தருகிறேன்” என்று கேட்டுக் கொண்டார்கள். அதன்படி அவர்களுடன் நான் இரண்டு மாதங்கள் தங்கினேன். பின்னர் அவர்கள் (என்னிடம்) கூறினார்கள்: அப்துல் கைஸ் குலத்தாரின் தூதுக்குழுவினர் நபி (ஸல்) அவர்களிடம் வந்த போது, ‘இம்மக்கள் யார்?’ அல்லது ‘இத்தூதுக் குழுவினர் யார்?’ என்று கேட்டார் கள். அதற்கு மக்கள், ‘ரபீஆ (குடும்பத்தார்)’ என்று பதிலளித்தனர். நபி (ஸல்) அவர்கள், “இழிவுக்குள்ளாகாமலும் மனவருத்திற்குள்ளாகாமலும் (தாமாக முன்வந்து இஸ்லாத்தை ஏற்ற நிலையில்) வருகை புரிந்துள்ள ‘சமுதாயமே’ அல்லது ‘தூதுக் குழாமே’ வருக!” என்று வரவேற்றார்கள். அத்தூதுக் குழுவினர், “அல்லாஹ்வின் தூதரே! (போர் புரியக் கூடாதெனத் தடை விதிக்கப்பட்டுள்ள) புனித மாதங்கள் தவிர மற்ற மாதங்களில் எங்களால் தங்களிடம் வர முடியவில்லை. (காரணம்) எங்களுக் கும் உங்களுக்கும் இடையே (எதிரிகளான) ‘முளர்’ குலத்து இறைமறுப்பாளர்களின் இந்தக் குடும்பத்தார் (தடையாக) உள்ளனர். ஆகவே, தெளிவான ஆணையொன் றைப் பிறப்பியுங்கள். அதை நாங்கள் எங்களுக்குப் பின்னால் உள்ளவர்களுக் கும் தெரிவிப்போம். அ(தைச் செயல் படுத்துவ)தன் மூலம் நாங்களும் சொர்க்கம் செல்வோம்” என்றார்கள். அதையொட்டி அவர்கள் நபி (ஸல்) அவர்களிடம் சில வகை குடிபானங் களைப் பற்றியும் கேட்டார்கள். அப்போது நபி (ஸல்) அவர்கள் அவர்களுக்கு நான்கு விஷயங்களைக் கட்டளையிட்டார்கள்; நான்கு விஷயங்களை அவர்களுக்குத் தடை செய்தார்கள். 1. அல்லாஹ் ஒருவனையே நம்புமாறு அவர்களுக்குக் கட்டளையிட்டுவிட்டு, “அல்லாஹ் ஒருவனையே நம்புதல் என்றால் என்னவென்று உங்களுக்குத் தெரியுமா?” என்று கேட்டார்கள். அதற்கு மக்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கு அறிந்தவர்கள்” என்றார்கள். நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை என்றும், முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் தூதர் என்றும் உறுதி கூறுவது. 2. தொழுகையைக் கடைப்பிடிப்பது; 3. ஸகாத் வழங்குவது; 4. ரமளான் மாதத்தில் நோன்பு நோற்பது. (இவையன்றி) போரில் கிடைக்கும் பொருட்களி லிருந்து ஐந்தில் ஒரு பாகத்தை நீங்கள் வழங்க வேண்டும். (மது ஊற்றிவைக்கப் பயன்படும்) மண்சாடி, சுரைக்காய் குடுவை, மரப் பீப்பாய், தார் பூசப்பட்ட பாத்திரம் ஆகிய நான்கையும் பயன்படுத்த வேண்டாமென அவர்களுக்குத் தடை செய்தார்கள். மேலும், “இவற்றை மனதில் வைத்துக் கொள்ளுங்கள். உங்களுக்குப் பின்னால் இருப்போருக்குத் தெரிவித்துவிடுங்கள்” என்றும் கூறினார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 54,
			"arabicnumber": 54,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: செயல்கள் அனைத்தும் எண்ணங்களைப் பொறுத்தே அமைகின்றன. ஒவ்வொரு மனிதருக்கும் அவர் எண்ணியதுதான் கிடைக்கிறது. எனவே, எவரது புலம் பெயர்தல் (ஹிஜ்ரத்) அல்லாஹ்வையும் அவனுடைய தூதரையும் (திருப்திப்படுத்து வதை) நோக்கமாகக் கொண்டு அமைகி றதோ, அவரது புலம்பெயர்தல் (உடைய பலனும் அவ்வாறே) அல்லாஹ்விடமும் அவனுடைய தூதரிடமும் அமையும். யார், தாம் அடைய விரும்பும் உலக (ஆதாய)த் திற்காக, அல்லது தாம் மணக்க விரும்பும் பெண்ணுக்காக புலம்பெயர்கிறாரோ, அவரது புலம்பெயர்தல் (உடைய பலனும்) அதுவாகத்தான் இருக்கும். இதை உமர் (ரலி) அவர்கள் அறிவிக் கிறார்கள்.45 அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 55,
			"arabicnumber": 55,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒரு மனிதர் (இறைவனிடம் கிடைக் கும்) நன்மையை நாடித் தம் குடும்பத் தாருக்குச் செலவு செய்தால், அதுவும் அவருக்குத் தர்மம் ஆகும். இதை அபூமஸ்ஊத் அல்அன்சாரி (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 56,
			"arabicnumber": 56,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் அன்பை நாடி நீர் செய்கின்ற எந்த ஒரு செலவானாலும் சரி, அதற்காக உமக்கு நற்பலன் வழங்கப்படும். உம்முடைய மனைவியின் வாயில் (அன்புடன்) நீர் ஊட்டும் ஒரு கவள உணவு உட்பட. இதை சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 57,
			"arabicnumber": 57,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், தொழுகையைக் கடைப் பிடிப்பேன்; ஸகாத் வழங்குவேன்; ஒவ் வொரு முஸ்லிமுக்கும் நலம் நாடுவேன் என்று உறுதிமொழி (பைஅத்) அளித்தேன். அத்தியாயம் : 3",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 58,
			"arabicnumber": 58,
			"text": "ஸியாத் பின் இலாக்கா (ரஹ்) அவர்கள் கூறியதாவது: (முஆவியா (ரலி) அவர்களது ஆட்சிக் காலத்தில் கூஃபாவின் ஆளுநராக இருந்த) முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் இறந்த நாளில் ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் (எழுந்து மேடையில்) நின்று இறைவனைப் போற் றிப் புகழ்ந்துவிட்டுக் கூறலானார்கள்: (அடுத்த) தலைவர் வரும்வரையில் இணையற்ற ஏக இறைவனுக்கு அஞ்சு வதையும் கண்ணியத்தையும் அமைதி யையும் கடைப்பிடியுங்கள். கூடிய விரை வில் உங்கள் (புதிய) தலைவர் வந்து விடுவார். பின்னர் தொடர்ந்து கூறினார்கள்: (இறந்து விட்ட) உங்கள் தலைவருக்காகப் பாவமன்னிப்புக் கோருங்கள். ஏனெனில், அவர் மன்னிப்பை விரும்பக்கூடியவராக இருந்தார். இறைவாழ்த்துக்குப்பின்! (விஷயம் என்னவென்றால்,) நான் (ஒரு முறை) நபி (ஸல்) அவர்களிடம் சென்று, “இஸ்லாத்தைத் ஏற்று நடப்பதாகத் தங்களிடம் உறுதிமொழி எடுத்துக்கொள்ள வந்திருக்கிறேன்” என்றேன். அப்போது நபியவர்கள், “முஸ்லிம்கள் ஒவ்வொருவருக்கும் நலம் நாட வேண்டும்” என்று எனக்கு நிபந்தனை விதித்தார்கள். அதன்படி உறுதிமொழி அளித்தேன். (கூஃபா நகர மக்களே!) இந்த இறையில்லத்தின் அதிபதிமீது ஆணையாக! நான் உங்களுக்கு நலம் நாடுபவனாக இருக்கிறேன். பிறகு பாவமன்னிப்புக் கோரிவிட்டு (மேடையிலிருந்து) இறங்கினார்கள். அத்தியாயம் : 3",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		}
	]
}