{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"26": "`Umrah (Minor pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஓர் உம்ரா செய்வது மறு உம்ராவரை (ஏற்படும் சிறு) பாவங்களுக்குப் பரிகார மாகும். (பாவச் செயல் கலவாத) ஏற்றுக் கொள்ளப்பட்ட ஹஜ்ஜுக்கு, சொர்க்கத் தைத் தவிர வேறு கூலியில்லை இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "இப்னு ஜுரைஜ் (ரஹ்) அவர்கள் கூறியதாவது: இக்ரிமா பின் காலித் (ரஹ்) அவர்கள் ஹஜ்ஜுக்குமுன் உம்ரா செய்வது பற்றி இப்னு உமர் (ரலி) அவர்களிடம் கேட்டார் கள். அதற்கு ‘தவறில்லை’ என இப்னு உமர் (ரலி) அவர்கள் பதிலளித்தார்கள்.3 மேலும், “நபி (ஸல்) அவர்கள் ஹஜ் செய்வதற்குமுன் உம்ரா செய்தார்கள்” என்று இப்னு உமர் (ரலி) அவர்கள் கூறியதாகவும் இக்ரிமா (ரஹ்) அவர்கள் கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்களிடம் நான் (நபி (ஸல்) அவர்களின் உம்ரா பற்றிக்) கேட்டேன். அதற்கு அவர்கள், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ரஜப் மாதத்தில் உம்ரா செய்யவில்லை” என்றார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "கத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்கள் எத்தனை ‘உம்ரா’க்கள் செய்தார்கள்?” என்று கேட்டேன். அதற்கு அவர்கள், “நான்கு (உம்ராக் கள் செய்துள்ளார்கள்); அவை: ஹுதை பியா எனுமிடத்தில் இருந்து துல்கஅதா மாதத்தில் செய்(ய முனைந்)த உம்ரா. ஆனால், இணைவைப்பாளர்கள் நபியவர் களைத் தடுத்துவிட்டனர். இணைவைப் பாளர்களுடன் செய்துகொண்ட சமாதான ஒப்பந்தப்படி, அடுத்த ஆண்டு துல்கஅதா மாதத்தில் செய்த உம்ரா; அடுத்து ‘ஜிஇர்ரானா’ என்ற இடத்திலிருந்து ஒரு போரில் -அது ஹுனைன் போர் என்றே கருதுகிறேன்- கிடைத்த செல்வங்களைப் பங்கிட்டபோது செய்த உம்ரா (ஹஜ்ஜுடன் சேர்த்து செய்த உம்ரா). பிறகு “எத்தனை ஹஜ் செய்திருக் கிறார்கள்?” என்று நான் கேட்டதற்கு, “ஒரு ஹஜ்தான்” என்றார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (முதலில்), இணைவைப்பாளர்கள் (ஹுதைபியாவில் அவர்களைத்) தடுத்துவிட்டபோது உம்ராவுக்காகச் சென்றிருந்தார்கள்; அடுத்த ஆண்டு (அதே) ஹுதைபியாவிலிருந்து உம்ராவை நிறைவேற்றினார்கள்; பிறகு துல்கஅதா மாதத்தில் உம்ரா செய்தார்கள்; அடுத்து ஹஜ்ஜுடன் ஒரு உம்ரா செய்தார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "ஹம்மாம் பின் யஹ்யா (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் நான்கு உம்ராக்களையும் துல்கஅதா மாதத்திலேயே செய்தார்கள்; ஹஜ்ஜுடன் செய்த உம்ராவைத் தவிர! அவை, ஹுதைபியாவிலிருந்து (அவர்கள் தடுக்கப்பட்டபோது) செய்யச் சென்ற உம்ரா; அதற்கடுத்த ஆண்டின் உம்ரா; ஹுனைன் போரில் கிடைத்த செல்வங் களைப் பங்கிட்ட இடமான ‘ஜிஇர்ரானா’ விலிருந்து செய்த உம்ரா; ஹஜ்ஜுடன் செய்த உம்ரா ஆகியவை ஆகும்.7 அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "அபூஇஸ்ஹாக் (ரஹ்) அவர்கள் கூறியதாவது: மஸ்ரூக், அதாஉ, முஜாஹித் (ரஹ்) ஆகியோரிடம் (நபி (ஸல்) அவர்கள் செய்த உம்ராவைப் பற்றி) நான் கேட்டேன். அதற்கு அவர்கள் அனைவரும், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஹஜ் செய்வதற்கு முன்னர் துல்கஅதாவில் உம்ரா செய்துள்ளார்கள்” என்று கூறினர். மேலும், “நபி (ஸல்) அவர்கள் ஹஜ் செய்வதற்கு முன்பு துல்கஅதாவில் (வெவ்வேறு ஆண்டுகளில்) இரண்டு முறை உம்ரா செய்துள்ளார்கள்” என பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூற நான் கேட்டுள்ளேன்.8 அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்சாரிப் பெண்களில் ஒருவரிடம், -“இப்னு அப்பாஸ் (ரலி) அவர்கள் அப்பெண்ணின் பெயரைக் குறிப்பிட்டார்கள்; நான் அதை மறந்துவிட்டேன்” என அவரிடமிருந்து அறிவிக்கும் அதாஉ (ரஹ்) அவர்கள் கூறுகிறார்- “நீ ஏன் எங்களுடன் ஹஜ் செய்யவில்லை?” எனக் கேட்டார்கள். அதற்கு அப்பெண்மணி, “எங்களிடம் இருந்த நீர் இறைப்பதற்கான (இரு ஒட்டகங்களில்) ஓர் ஒட்டகத்தில் இன்னா ரின் தந்தையும் அவருடைய மகனும் (என் கணவரும் மகனும் ஹஜ்ஜுக்கு) ஏறிச் சென்றுவிட்டனர்; மற்றோர் ஒட்டகத்தை அவர் விட்டுச்சென்றுள்ளார். அதன் மூலம் நாங்கள் நீர் இறைத்துக்கொண்டிருக்கி றோம்” என்றார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “ரமளான் வந்துவிட்டால் அதில் நீ உம்ரா செய்துகொள். ஏனெனில், ரமளானில் உம்ரா செய்வது ஹஜ்ஜாகும்” என்றோ, அல்லது அதைப் போன்றோ கூறினார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (விடைபெறும் ஹஜ்ஜின்போது துல்கஅதாவைப் பூர்த்தி செய்துவிட்டு) துல்ஹஜ்ஜின் பிறையை எதிர்நோக்கியவர்களாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் புறப்பட்டோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உங்களில் யார் ஹஜ்ஜுக்கு இஹ்ராம் கட்ட விரும்புகிறாரோ அவர் ஹஜ்ஜுக்கு இஹ்ராம் கட்டிக்கொள்ளட்டும்; யார் உம்ரா செய்ய விரும்புகிறாரோ அவர் உம்ராவுக்கு இஹ்ராம் கட்டிக்கொள்ளட்டும். நான் குர்பானிப் பிராணியைக் கொண்டுவர வில்லையானால் உம்ராவுக்காக இஹ்ராம் கட்டியிருப்பேன்” எனக் கூறினார்கள். எனவே, எங்களில் சிலர் உம்ராவுக்காக இஹ்ராம் கட்டினர். வேறுசிலர் ஹஜ்ஜுக் காக இஹ்ராம் கட்டினர்; நான் உம்ராவுக் காக இஹ்ராம் கட்டியவர்களில் ஒருத்தி யாவேன். இந்நிலையில், அரஃபா நாள் நெருங்கியதும் எனக்கு மாதவிடாய் ஏற்பட்டுவிட்டது. எனவே, நான் நபி (ஸல்) அவர்களிடம் முறையிட்டேன். நபி (ஸல்) அவர்கள், “உனது உம்ராவை விட்டுவிட்டு உனது தலைமுடியை அவிழ்த்து வாரிக் கொள்; ஹஜ்ஜுக்காக இஹ்ராம் கட்டிக்கொள்” என்றார்கள். அல்முஹஸ்ஸபில் தங்குவதற்கான இரவு வந்தபோது (துல்ஹஜ் பத்தாம் நாள் நான் தூய்மையடைந்தபின்) என்னுடன் (என் சகோதரர்) அப்துர் ரஹ்மானை நபி (ஸல்) அவர்கள் அனுப்பி தன்யீம் என்ற இடத்திற்குப் போகச் சொன்னார்கள். நான் எனது விடுபட்ட உம்ராவுக்குப் பகரமாக மற்றொரு உம்ராவுக்காக (அங்கு) இஹ்ராம் கட்டினேன். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "அப்துர் ரஹ்மான் பின் அபீபக்ர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஆயிஷா (ரலி) அவர்களை வாகனத்தில் ஏற்றிக்கொண்டு சென்று ‘தன்யீம்’ எனுமிடத்தில் உம்ராவுக் காக இஹ்ராம் கட்டச் செய்ய வேண்டும் என எனக்குக் கட்டளையிட்டார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவ ரான) சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் ஒரு முறை, “அம்ர் பின் தீனார் (ரஹ்) அவர்களிடம் இதைக் கேட்டுள் ளேன்; எத்தனையோ முறை கேட்டுள் ளேன்” என்று கூறினார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (விடைபெறும் ஹஜ்ஜின்போது) நபி (ஸல்) அவர்களும் அவர்களின் தோழர் களும் ஹஜ்ஜுக்ôக இஹ்ராம் கட்டினார் கள். நபி (ஸல்) மற்றும் தல்ஹா (ரலி) ஆகிய இருவரைத் தவிர வேறு யாரிடமும் குர்பானி பிராணி இருக்கவில்லை. யமனி லிருந்து அலீ (ரலி) அவர்கள் குர்பானி பிராணியுடன் வந்தார்கள். “நபி (ஸல்) அவர்கள் எதற்காக இஹ்ராம் கட்டியுள் ளார்களோ அதற்காகவே நானும் இஹ்ராம் கட்டியுள்ளேன்” என அவர்கள் கூறி னார்கள். அப்போது நபி (ஸல்) அவர்கள் தம் தோழர்களில் குர்பானி பிராணி கொண்டுவந்தவர்கள் தவிர மற்றவர்கள் தங்களின் இஹ்ராமை உம்ராவுக்காக மாற்றிக்கொள்ளுமாறும் தவாஃப் செய்து, தலைமுடியைக் குறைத்து, இஹ்ராமிலிருந்து விடுபடுமாறும் கட்டளையிட்டார்கள். அப்போது மக்கள் (சிலர்), “(இஹ்ராமிலிருந்து விடுபட்டபின்) தாம்பத்திய உறவை முடித்த கையோடு நாங்கள் மினாவுக்குச் செல்வதா?” என்று பேசிக்கொண்ட செய்தி நபி (ஸல்) அவர்களுக்கு எட்டியது. அப்போது அவர்கள் “(ஹஜ் மாதங்களில் உம்ரா செய்ய அனுமதியுண்டு என) நான் பின்னால் அறிந்துகொண்டதை முன்பே அறிந்திருந்தால், நான் குர்பானி பிராணி கொண்டுவந்திருக்கமாட்டேன்; நான் குர்பானி பிராணியை மட்டும் கொண்டுவந்திருக்க வில்லையாயின், இஹ்ராமிலிருந்து விடு பட்டிருப்பேன்” எனக் கூறினார்கள். அப்போது ஆயிஷா (ரலி) அவர்களுக்கு மாதவிடாய் ஏற்பட்டிருந்தது. எனவே அவர்கள், இறையில்லம் கஅபாவை தவாஃப் செய்வதைத் தவிர, ஹஜ்ஜின் மற்றெல்லா கிரியைகளையும் நிறைவேற்றினார்கள்; மாதவிடாயிலிருந்து தூய்மையடைந்ததும் கஅபாவை தவாஃப் செய்தார்கள். மேலும் ஆயிஷா (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! நான் ஹஜ்ஜை மட்டும் நிறைவேற்றிவிட்டுச் செல்ல, நீங்கள் (எல்லாரும்) ஹஜ்ஜையும் உம்ரா வையும் நிறைவேற்றிவிட்டுச் செல்கிறீர் களே?” என (ஏக்கத்துடன்) கேட்டார்கள். உடனே நபி (ஸல்) அவர்கள் (ஆயிஷா வின் சகோதரர்) அப்துர் ரஹ்மான் பின் அபீபக்ரை, ஆயிஷா (ரலி) அவர்களுடன் (உம்ரா செய்திட இஹ்ராம் கட்டுவதற்காக) ‘தன்யீம்’ என்ற இடத்திற்குச் செல்லுமாறு கட்டளையிட்டார்கள். அதன்படி, ஆயிஷா (ரலி) அவர்கள் ஹஜ் செய்தபின், துல்ஹஜ் மாதத்திலேயே உம்ராவையும் நிறைவேற்றினார்கள். நபி (ஸல்) அவர்கள் ஜம்ரத்துல் அகபாவில் கல்லெறிந்துகொண்டிருந்தபோது அவர்களைச் சந்தித்த சுராக்கா பின் மாலிக் பின் ஜுஅஷும் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! இது (ஹஜ் மாதத்தில் உம்ரா செய்வது), உங்களுக்கு மட்டுமுள்ள தனிச் சட்டமா?” எனக் கேட்டார். அதற்கு அவர்கள், “இல்லை. இது எப்போதைக்கும் உரியதே” என்று பதிலளித்தார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (விடைபெறும் ஹஜ்ஜின்போது துல்கஅதாவை பூர்த்தி செய்துவிட்டு) துல்ஹஜ் பிறையை எதிர் நோக்கியவர் களாக அல்லாஹ்வின் தூதர் (ஸல்) அவர் களுடன் புறப்பட்டோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “யார் உம்ராவுக்கு (மட்டும்) இஹ்ராம் கட்ட விரும்புகிறாரோ, அவர் உம்ராவுக்காக (மட்டும்) இஹ்ராம் கட்டிக்கொள்ளட்டும்; யார் ஹஜ்ஜுக்காக இஹ்ராம் கட்ட விரும்புகிறாரோ அவர் ஹஜ்ஜுக்காக இஹ்ராம் கட்டிக்கொள்ளட் டும்! நான் குர்பானி பிராணியைக் கொண்டுவந்திராவிட்டால் உம்ராவுக்காக (மட்டும்) இஹ்ராம் கட்டியிருப்பேன்” என்றார்கள். சிலர் உம்ராவுக்காக இஹ்ராம் கட்டினர்; வேறுசிலர் ஹஜ்ஜுக்காக இஹ்ராம் கட்டி னர். நான் உம்ராவுக்காக இஹ்ராம் கட்டிய வர்களில் ஒருத்தியாக இருந்தேன். ஆனால், மக்காவில் நுழைவதற்குமுன் எனக்கு மாதவிடாய் ஏற்பட்டது. மாதவிடா யுள்ள நிலையிலேயே அரஃபா நாளையும் அடைந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (இது பற்றி) நான் முறையிட்டபோது, “உனது உம்ராவை விட்டுவிட்டு; தலையை அவிழ்த்து, வாரிக் கொள்! மேலும், ஹஜ்ஜுக்காக இஹ்ராம் கட்டிக்கொள்!” என்றார்கள். நான் அவ்வாறே செய்தேன். அல்முஹஸ்ஸபில் தங்கும் இரவு வந்தபோது, என்னுடன் (என் சகோதரர்) அப்துர் ரஹ்மானை ‘தன்யீம்’வரை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அனுப்பினார்கள். அப்துர் ரஹ்மான் தமது ஒட்டகத்தின் பின்னால் என்னை ஏற்றிக்கொண்டார். விடுபட்ட உம்ராவுக்குப் பகரமாக, மற்றொரு உம்ராவுக்காக நான் இஹ்ராம் கட்டினேன். இதன் அறிவிப்பாளர்களில் ஒருவரான ஹிஷாம் பின் உர்வா (ரஹ்) அவர்கள் கூறுகிறார்கள்: அல்லாஹ், ஆயிஷா (ரலி) அவர்களுக்கு ஹஜ்ஜையும் உம்ராவையும் நிறைவேற்றித் தந்தான். இதற்காக, ஆயிஷா (ரலி) அவர்கள் குர்பானியோ, தர்மமோ, நோன்போ பரிகாரமாகச் செய்யவில்லை. அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "காசிம் பின் முஹம்மத் (ரஹ்), அஸ்வத் பின் யஸீத் (ரஹ்) ஆகியோர் கூறியதாவது: ஆயிஷா (ரலி) அவர்கள் (நபி (ஸல்) அவர்களிடம்), “அல்லாஹ்வின் தூதரே! “மக்கள் அனைவரும் (ஹஜ், உம்ரா ஆகிய) இரண்டு வழிபாடுகளுடன் திரும்பு கின்றனர்; நான் மட்டும் (ஹஜ் என்கிற) ஒரேயொரு வழிபாட்டுடன் திரும்புகிறேனே?” என்று கேட்டார்கள். அவர்களிடம், “நீ சற்றுக் காத்திருந்து, (மாதவிடாயிலிருந்து) தூய்மையடைந்ததும் தன்யீமுக்குச் சென்று (உம்ராவுக்காக) இஹ்ராம் கட்டிக்கொள்! பிறகு (நீயும் உன் சகோதரரும்) எங்களை இன்ன இடத்தில் வந்து சந்தியுங்கள்! ஆனால், உம்ராவுக்கான நற்பலன் உனது சிரமத்திற்கோ, பொருட் செலவுக்கோ தக்கவாறுதான் கிடைக்கும்!” என (நபி (ஸல்) அவர்களால்) சொல்லப்பட்டது. அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நாங்கள் ஹஜ் மாதங்களில், ஹஜ் கிரியைகளில் (பங்கேற்க) ஹஜ்ஜுக்காக இஹ்ராம் கட்டி (மதீனாவிலிருந்து) புறப் பட்டோம். ‘சரிஃப்’ எனும் இடத்திற்கு வந்து தங்கினோம்.12 அப்போது நபி (ஸல்) அவர்கள் தம் தோழர்களிடம், “யார் குர்பானி பிராணி கொண்டுவராமல் ஹஜ்ஜை உம்ராவாக ஆக்கிக்கொள்ள விரும்புகிறாரோ அவர் அவ்வாறே செய்துகொள்ளட்டும்! யாரிடம் குர்பானி பிராணி உள்ளதோ அவர் அவ்வாறு செய்ய வேண்டாம்” எனக் கூறினார்கள். நபி (ஸல்) அவர்களிடமும் அவர்களு டைய தோழர்களில் வசதி படைத்தவர் களிடமும் குர்பானி பிராணிகள் இருந்தன. எனவே, அவர்களுக்கு (தனியான) உம்ரா இல்லை. பிறகு நபி (ஸல்) அவர்கள் என்னிடம் வந்தபோது, நான் அழுது கொண்டிருந்தேன். அவர்கள் “ஏன் அழுகி றாய்?” எனக் கேட்டார்கள். “நீங்கள் உங்கள் தோழர்களிடம் கூறியதை நான் செவியுற் றேன்; ஆனால், நான் உம்ரா செய்வதிலிருந்து தடுக்கப்பட்டுவிட்டேன்” என்றேன். அதற்கு அவர்கள், “என்ன காரணம்?” எனக் கேட்டதும், “நான் தொழுகை இல்லாமல் இருக்கிறேன்” என்றேன். அவர்கள், “அதனால் உனக்கு ஒரு பாதிப்பும் இல்லை. நீ ஆதமின் பெண்மக்களில் ஒருத்தியே! அவர்களுக்கு விதிக்கப்பட்டது தான் உனக்கும் விதிக்கப்பட்டுள்ளது. எனவே, நீ ஹஜ் செய்துகொண்டிரு. அல்லாஹ் உனக்கு (உம்ரா செய்யவும்) வாய்ப்பளிக்கக்கூடும்!” என்றார்கள். நாங்கள் மினாவிலிருந்து புறப்படும் வரை நான் அப்படியே (ஹஜ்ஜில்) இருந்தேன். பிறகு (நான் தூய்மையானபின்) அல்முஹஸ்ஸப் வந்து தங்கினோம். அப்போது நபி (ஸல்) அவர்கள் அப்துர் ரஹ்மானை அழைத்து, “உன் சகோதரியை ஹரமுக்கு வெளியே அழைத்துப் போ! அவர் உம்ராவுக்காக இஹ்ராம் கட்டிக் கொள்ளட்டும்! பிறகு நீங்களிருவரும் தவாஃபை முடித்துக்கொள்ளுங்கள்! உங்களுக்காக நான் இந்த இடத்தில் காத்திருப்பேன்” என்றார்கள். நாங்கள் (தவாஃபை முடித்து) நடுநிசியில் வந்தபோது, “(தவாஃபை) முடித்துவிட்டீர்களா?” என நபி (ஸல்) அவர்கள் கேட்டார்கள். நான் “ஆம்” என்றேன். நபி (ஸல்) அவர்கள் தம் தோழர்களிடம் புறப்படுமாறு அறிவித்தார் கள். மக்களும், சுப்ஹுக்கு முன்பே கஅபா ஆலயத்தை தவாஃப் (வதா) செய்தவர்களும் புறப்படத் தயாரானதும் நபி (ஸல்) அவர்கள் மதீனாவை நோக்கிப் பயணமானார்கள்.13 அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "யஅலா பின் உமய்யா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஜிஇர்ரானா எனுமிடத்தில் இருந்தபோது, நறுமணப் பொருளின் அடையாளமோ அல்லது மஞ்சள் நிறமோ உள்ள மேலங்கி அணிந் திருந்த ஒருவர் அவர்களிடம் வந்தார். அவர், “நான் என் உம்ராவில் என்ன செய்ய வேண்டும் எனக் கட்டளையிடு கிறீர்கள்?” எனக் கேட்டார். அப்போது நபி (ஸல்) அவர்களுக்கு அல்லாஹ் வஹீ அறிவித்தான். எனவே, நபி (ஸல்) அவர்கள் ஒரு துணியால் மறைக்கப்பட்டார்கள். நான் நபி (ஸல்) அவர்களுக்கு வஹீ அருளப்படும் போது அவர்களைப் பார்க்க வேண்டும் என ஆவல் கொண்டிருந்தேன். உமர் (ரலி) அவர்கள், “இங்கு வாரும்! நபி (ஸல்) அவர்களுக்கு அல்லாஹ் வஹீ அருளும் போது அவர்களைப் பார்க்க வேண்டும் என்று நீர் விரும்புகிறீரா?” எனக் கேட்டார் கள். நான் ‘ஆம்’ என்றேன். உடனே (நபி (ஸல்) அவர்களை மறைத்திருந்த) அந்தத் துணியின் ஓரத்தை உமர் (ரலி) அவர்கள் விலக்கினார்கள். நான் நபி (ஸல்) அவர்களை உற்று நோக்கினேன். அப்போது குறட்டை சப்தம் -ஒட்டகத்தின் குறட்டை சப்தம் என்று சொன்னதாகவே எண்ணுகிறேன்- அவர் களிடமிருந்து வந்தது. பிறகு (வஹீயின்) அந்நிலை அவர்களைவிட்டு விலகியபோது அவர்கள், “உம்ராவைப் பற்றிக் கேள்வி கேட்டவர் எங்கே?” எனக் கேட்டுவிட்டு (அவரிடம்), “உமது மேலங்கியைக் கழற்றி நறுமணப் பொருளின் அடையாளத்தைக் கழுவிவிட்டு, மஞ்சள் நிறத்தையும் அகற்றிவிடுவீராக! மேலும், நீர் ஹஜ்ஜில் செய்வதைப் போன்று உம்ராவிலும் செய்வீராக!” எனக் கூறினார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் சிறு வயதுடையவனாக இருந்தபோது நபி (ஸல்) அவர்களின் துணைவியார் (என் சிறிய தாயார்) ஆயிஷா (ரலி) அவர்களிடம், “நிச்சயமாக, ஸஃபாவும் மர்வாவும் அல்லாஹ்வின் அடையாளச் சின்னங் களில் உள்ளவையாகும். எனவே, யார் அந்த (கஅபா) ஆலயத்தில் ஹஜ்ஜோ உம்ராவோ செய்கிறாரோ அவர்மீது அவ்விரண்டையும் சுற்றிவருவது குற்ற மன்று” (2:158) என உயர்வும் வளமும் மிக்க அல்லாஹ் கூறுகின்றான்; எனவே, “அவ் விரண்டையும் சுற்றாமல் இருப்பது குற்ற மாகாது என்றே நான் கருதுகிறேன்” என்று கூறினேன். அதற்கு ஆயிஷா (ரலி) அவர்கள், “அவ்வாறில்லை; நீ கருதுவதைப் போன்றி ருந்தால் ‘அவ்விரண்டையும் தவாஃப் செய்யாமலிருப்பதில் குற்றமில்லை’ என்று அவ்வசனம் அமைந்திருக்க வேண்டும்; மேலும், இந்த வசனம் அன்சாரிகள் தொடர்பாக அருளப்பட்டதாகும். (அறியா மைக் காலத்தில்) அவர்கள் ‘குதைத்’ என்ற இடத்தின் அருகில் ‘மனாத்’ என்ற சிலைக் காக இஹ்ராம் கட்டிவந்தார்கள். அதனால் (இஸ்லாத்தை ஏற்றபின்) ஸஃபா-மர்வாவுக் கிடையே சுற்றிவருவதைக் குற்றமாக அவர்கள் கருதினர். எனவே, அவர்கள் இஸ்லாத்திற்கு வந்ததும் அது தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கேட்டனர்; அப்போதுதான் இந்த வசனத்தை (2:158) உயர்ந்தோன் அல்லாஹ் அருளினான்” எனக் கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் இரு அறிவிப்புகளில், “ஸஃபா-மர்வாவுக்கிடையே சுற்றி வராதவரின் ஹஜ்ஜையோ உம்ராவையோ அல்லாஹ் முழுமைப்படுத்தவில்லை” என்றும் ஆயிஷா (ரலி) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது. அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ‘அல்பத்ஹா’ எனுமிடத்தில் ஒட்டகத்தை இளைப்பாற வைத்துக்கொண்டிருந்தபோது நான் அவர்களிடம் சென்றேன். அப்போது அவர்கள், “ஹஜ் செய்ய நாடியுள்ளீரா?” எனக் கேட்டார்கள். நான் ‘ஆம்’ என்றதும், “எதற்காக இஹ்ராம் கட்டினீர்?” என்று கேட்டார்கள். நான் “நபி (ஸல்) அவர்கள் எதற்காக இஹ்ராம் கட்டினார்களோ அதற்காகவே இஹ்ராம் கட்டியுள்ளேன்” என்று கூறினேன். அதற்கு அவர்கள், “நன்றே செய்தீர். இறையில்லம் கஅபாவை தவாஃப் செய்துவிட்டு, ஸஃபா-மர்வாவுக் கிடையே ‘சயீ’ செய்துவிட்டு இஹ்ராமி லிருந்து விடுபட்டுவிடுவீராக!” எனக் கூறினார்கள். நான் அவ்வாறே கஅபாவை தவாஃப் செய்துவிட்டு, ஸஃபா-மர்வாவுக்கிடையே ‘சயீ’ செய்துவிட்டு, பனூ கைஸ் கோத்திரத் தைச் சேர்ந்த (என் நெருங்கிய உறவின ரான) ஒரு பெண்ணிடம் வந்தேன். அவர் எனது தலையில் பேன் பார்த்தார். பிறகு நான் ஹஜ்ஜுக்காக இஹ்ராம் கட்டினேன். இந்த அடிப்படையிலேயே நான் உமர் (ரலி) அவர்களது ஆட்சிக் காலம்வரை மக்களுக்குத் தீர்ப்பளித்துக் கொண்டிருந்தேன். உமர் (ரலி) அவர்கள், “அல்லாஹ்வின் வேதத்தைப் பார்த்தால் அது நம்மை (ஹஜ்ஜையும் உம்ராவையும்) முழுமைப்படுத்துமாறு கட்டளையிடுகிறது; நபி (ஸல்) அவர்களின் நடைமுறையைப் பார்த்தாலும், குர்பானி பிராணி அதற்குரிய இடத்தை அடையும்வரை இஹ்ராமிலிருந்து அவர்கள் விடுபடவில்லை எனத் தெரிகிறது!” என்று கூறினார்கள்.16 அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்களால் விடுதலை செய்யப்பட்ட அவர்களின் அடிமை) அப்துல்லாஹ் பின் கைசான் (ரஹ்) அவர்கள் கூறியதாவது: அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்கள், (மக்காவிலுள்ள) ‘அல்ஹஜூன்’ என்ற இடத்தைக் கடந்து செல்லும் போதெல்லாம், “முஹம்மத் (ஸல்) அவர்கள் மீது அல்லாஹ் கருணை புரிவானாக! (விடைபெறும் ஹஜ்ஜின்போது) நாங்கள் அவர்களுடன் இங்கு வந்து இறங்கினோம்; அப்போது எங்களிடம் (பயண) மூட்டை முடிச்சுகள் குறைவாகவே இருந்தன; (பயண) வாகனங்களும் உணவுகளும் குறைவாகவே இருந்தன; அப்போது நானும், என் சகோதரி ஆயிஷா (ரலி), (என் கணவர்) ஸுபைர் (ரலி) ஆகியோரும், மற்றும் இன்னாரும் இன்னாரும் உம்ராவுக் காக இஹ்ராம் கட்டியிருந்தோம்; கஅபாவை தவாஃப் செய்ததும் இஹ்ராமி லிருந்து விடுபட்டுவிட்டோம். பிறகு மாலையில் ஹஜ்ஜுக்காக இஹ்ராம் கட்டினோம்” என அஸ்மா (ரலி) அவர்கள் கூறுவார்கள்.17 அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஹஜ் அல்லது உம்ராவிலிருந்தோ அறப்போரிலிருந்தோ திரும்பும்போது மேடான இடங்களில் ஏறும்போதெல்லாம் மூன்று முறை தக்பீர் (அல்லாஹு அக்பர்) கூறுவார்கள். மேலும், “லா இலாஹ இல்லல்லாஹு, வஹ்தஹு, லா ஷரீ(க்)க லஹு, லஹுல் முல்கு வ லஹுல் ஹம்து, வஹுவ அலா குல்லி ஷையின் கதீர்; ஆயிபூன தாயிபூன, ஆபிதூன, சாஜிதூன, லி ரப்பினா ஹாமிதூன்; ஸத(க்)கல்லாஹு வஅதஹு, வ நஸர அப்தஹு, வ ஹஸமல் அஹ்ஸாப வஹ்தஹ்” என்று கூறுவார்கள். (பொருள்: “அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை. அவன் தனித்தவன்; அவனுக்கு இணை யாருமில்லை. ஆட்சி யதிகாரம் அவனுக்கே. புகழும் அவனுக்கே. அவன் அனைத்தின்மீதும் பேராற்றலுடையோன்; நாங்கள் பாவ மன்னிப்புக் கோரி மீண்டவர்களாகவும், (எங்கள் இறையை வழிபட்டவர்களாகவும், சஜ்தா செய்தவர்களாகவும்; எங்கள் இறையைப் புகழ்ந்தவர்களாகவும் திரும்பு கிறோம்; அல்லாஹ் தனது வாக்குறுதியை மெய்யாக்கிவிட்டான்; தன் அடியாருக்கு (முஹம்மத் (ஸல்) அவர்களுக்கு) உதவி செய்துவிட்டான். (எதிரிகளின்) கூட்டுப் படைகளைத் தன்னந்தனியாக அவனே தோற்கடித்துவிட்டான்) அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மக்காவுக்கு வந்தபோது, அவர்களை அப்துல் முத்தலிப் குடும்பத்துச் சிறார்கள் வரவேற்றனர். அப்போது நபி (ஸல்) அவர்கள் (அச்சிறார்களில்) ஒருவரை தமக்கு முன்னாலும் மற்றொருவரைத் தமக்குப் பின்னாலும் வாகனத்தில் ஏற்றிக்கொண்டார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்காவுக்குப் புறப்பட்டால் (துல்ஹுலை ஃபாவில் உள்ள) ‘அஷ்ஷஜரா’ பள்ளி வாசலில் தொழுவார்கள். (மக்காவிலிருந்து) திரும்பும்போது பத்னுல் வாதியில் உள்ள துல்ஹுலைஃபாவில் தொழுவார்கள்; மேலும் அங்கேயே காலைவரை தங்குவார் கள். (பிறகுதான் மதீனா திரும்புவார்கள்.) அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (பயணத்தை முடித்து) இரவு நேரத்தில் திடீரெனத் தம் வீட்டாரிடம் செல்லமாட்டார்கள்; காலை யிலோ அல்லது மாலையிலோதான் செல்வார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: (பயணத்திலிருந்து திரும்பும்போது) இரவு நேரத்தில் திடீரென வீட்டாரிடம் செல்வதை நபி (ஸல்) அவர்கள் தடுத்துள்ளார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பயணத்திலிருந்து திரும்பி மதீனாவின் உயரமான பாதைகளைப் பார்க்கும்போது தமது ஒட்டகத்தை விரைவாகச் செலுத்து வார்கள்; வாகனம் கால்நடையாக இருப் பின் அதைத் தட்டிவிடுவார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஹாரிஸ் பின் உமைர் (ரஹ்) அவர்களது அறிவிப்பில், “மதீனாமீது கொண்ட அன்பால் ஒட்டகத்தை முடுக்கி விடுவார்கள்” என்று இடம்பெற்றுள்ளது. இஸ்மாயீல் பின் ஜஅஃபர் (ரஹ்) அவர்களது அறிவிப்பில், ‘மதீனாவின் (சுற்றுச்) சுவர்களைப் பார்க்கும்போது’ என இடம்பெற்றுள்ளது. அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: இந்த வசனம் (அன்சாரிகளான) எங்கள் விஷயத்தில்தான் அருளப் பெற்றது. (அறியாமைக் காலத்தில்) அன்சாரிகள் ஹஜ் செய்(ய இஹ்ராம் கட்டி முடித்)துவிட்டு, மீண்டும் (வீட்டுக்கு) வருவதானால், வீடுகளில் (முன்பக்க) வாசல் வழியாக நுழையமாட்டார்கள். மாறாக, பின்பக்க வாசல் வழியேதான் நுழைவார்கள். இந்நிலையில் அன்சாரிகளில் ஒருவர் தமது (வீட்டின்) முன்வாசல் வழியாகவே நுழைந்துவிட்டார். இதனால் அவரைப் பற்றி குறைசொல்லப்பட்டது. அப்போதுதான், “நீங்கள் வீடுகளுக்குள் அவற்றின் பின்புற வழியாக வருவது புண்ணியமன்று. மாறாக, (இறைவனுக்கு) அஞ்சி நடப்பவரே புண்ணியவான் ஆவார். ஆகவே, வீடுகளுக்குள் அவற் றின் வாசல்கள் வழியாகவே வாருங்கள்” (2:189) எனும் வசனம் அருளப்பெற்றது. அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: பயணம் வேதனையில் ஒரு பகுதி யாகும். அது உங்களில் ஒருவரது உணவையும் பானத்தையும் உறக்கத்தை யும் தடுத்துவிடுகிறது. எனவே, ஒருவர் தமது தேவையை முடித்ததும் தம் குடும்பத்தாரிடம் விரைந்து செல்லட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "அஸ்லம் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் மக்கா செல்லும் வழியில் நானும் அவர்களுடன் (பயணம் செய்துகொண்டு) இருந்தேன். (அவர்களின் துணைவியார்) ஸஃபிய்யா பின்த் அபீஉபைத் அவர்களின் உடல்நிலை மோசமான செய்தி அவர்களுக்குக் கிடைத்தது. உடனே பயணத்தை விரைவுபடுத்தினார்கள். செம்மேகம் மறையும்வரை (மஃக்ரிப் தொழுகையைத்) தாமதப்படுத்தி ஓரிடத்தில் இறங்கினார்கள். அங்கு மஃக்ரிபையும் இஷாவையும் சேர்த்துத் தொழுதார்கள். “நபி (ஸல்) அவர்கள் அவசரமாகப் பயணம் செய்ய நேரிட்டால் (இவ்வாறுதான்) மஃக்ரிபைத் தாமதப்படுத்தி இரு தொழுகைகளையும் சேர்த்துத் தொழுவதை நான் பார்த்திருக்கிறேன்” என்றும் இப்னு உமர் (ரலி) அவர்கள் குறிப்பிட்டார்கள். அத்தியாயம் : 26",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 30
			}
		}
	]
}