{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"41": "Agriculture"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2320,
			"arabicnumber": 2320,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: முஸ்லிம் ஒருவர் ஒரு மரத்தை நட்டு அல்லது விதை விதைத்து விவசாயம் செய்து, அதிலிருந்து (அதன் விளைச்சலை அல்லது காய்கனிகளை) ஒரு பறவையோ, ஒரு மனிதனோ, ஒரு பிராணியோ உண்டால் அதன் காரணத்தால் ஒரு தர்மம் செய்ததற்கான பிரதிபலன் அவருக்குக் கிடைக்கும். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2321,
			"arabicnumber": 2321,
			"text": "முஹம்மத் பின் ஸியாத் அல் அல்ஹானீ (ரஹ்) அவர்கள் கூறியதாவது: அபூஉமாமா அல்பாஹிலீ (ரலி) அவர்கள், ஒரு வீட்டில் ஏர் கலப்பையையும் மற்றும் சில விவசாயக் கருவிகளையும் கண்டார்கள். உடனே அவர்கள், ‘ யிஇந்தக் கருவி ஒரு சமுதாயத்தாரின் வீட்டில் புகும்போது அந்த வீட்டில் அல்லாஹ் இழிவைப் புகச்செய்யாமல் இருப்பதில்லை என நபி (ஸல்) அவர்கள் கூற நான் கேட்டிருக்கிறேன்” என்று கூறினார்கள்.2 அபூஉமாமா (ரலி) அவர்களின் இயற் பெயர் ஸுதை பின் அஜ்லான் என்ப தாகும். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2322,
			"arabicnumber": 2322,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: எவர் நாய் வைத்திருக்கிறாரோ அவரது நற்செயல்களிலிருந்து ஒவ்வொரு நாளும் ஒரு யிகீராத்’ அளவுக்கு (அவற்றின் நன்மை) குறைந்துபோய்விடும்; விவசாயப் பண்ணையையோ கால்நடைகளையோ (திருடு போய்விடாமல்) பாதுகாப்பதற்காக வைத்திருக்கும் நாய்களைத் தவிர.3 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஓர் அறிவிப்பில் அபூஹுரைரா (ரலி) அவர்கள் கூறியிருப்பதாவது: ‘‘கால்நடைகளைப் பாதுகாப்பதற் காகவோ, விவசாயப் பண்ணைகளைப் பாதுகாப்பதற்காகவோ, வேட்டையாடு வதற்காகவோ வைத்திருக்கும் நாய்களைத் தவிர” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். மற்றோர் அறிவிப்பில் அபூஹுரைரா (ரலி) அவர்கள் கூறியுள்ளார்கள்: ‘‘கால்நடைகளைப் பாதுகாப்பதற்காக, அல்லது வேட்டையாடுவதற்காக வைத்திருக்கும் நாய்களைத் தவிர” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2323,
			"arabicnumber": 2323,
			"text": "சாயிப் பின் யஸீத் (ரலி) அவர்கள் கூறியதாவது: ‘அஸ்த் ஷனூஆ’ குலத்தைச் சேர்ந்த சுஃப்யான் பின் அபீஸுஹைர் (ரலி) அவர்கள் என்னிடம், ‘‘ யிவிவசாயப் பண்ணையையோ கால்நடைகளையோ பாதுகாக்கும் தேவை எதுவும் இன்றி எவர் நாய் வைத்திருக்கிறாரோ அவரது நற்செயல்களிலிருந்து ஒவ்வொரு நாளும் ஒரு யிகீராத்’ அளவுக்கு (நன்மை) குறைந்து விடும்’ என்று நபி (ஸல்) அவர்கள் கூற நான் கேட்டேன்” என்று சொன்னார்கள். நான், ‘‘இதை நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து (நேரடியாகக்) கேட்டீர்களா?” என்று வினவினேன். சுஃப்யான் பின் அபீ ஸுஹைர் (ரலி) அவர்கள், ‘‘ஆம்; இந்தப் பள்ளிவாசலின் அதிபதி (அல்லாஹ்வின்) மீது ஆணையாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து நானே நேரடியாகச் செவியுற்றேன்” என்று பதிலளித்தார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2324,
			"arabicnumber": 2324,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ‘‘ஒரு மனிதர் ஒரு மாட்டின் மீது சவாரி செய்துகொண்டிருந்தபோது அந்த மாடு அவரைத் திரும்பிப் பார்த்து, யிநான் இதற்காக (சுமை சுமந்துசெல்வதற்காக) படைக்கப்படவில்லை; நிலத்தை உழுவதற்காகவே படைக்கப்பட்டுள்ளேன்’ என்று கூறியது” என நபி (ஸல்) அவர்கள் கூறினார்கள். இதைக் கூறிவிட்டு நபி (ஸல்) அவர்கள், ‘‘நானும் அபூபக்ரும் உமரும் இதை நம்புகிறோம். மேலும், (ஒருமுறை) ஓர் ஓநாய், ஆடு ஒன்றைக் கவ்விக்கொண்டு ஓடலாயிற்று. அந்த ஆட்டை மேய்த்துக்கொண்டிருந்தவர் அந்த ஓநாயைத் துரத்திச் சென்றார். அப்போது ஓநாய் அவரைப் பார்த்து, யிகொடிய விலங்குகள் ஆதிக்கம் செலுத்தும் (உலக முடிவு) நாளில் இதைப் பாதுகாக்கக்கூடியவர் யார்? அப்போது என்னைத் தவிர இதற்கு மேய்ப்பாளன் (பொறுப்பாளன்) எவனும் இருக்கமாட்டாú” என்று கூறியது. நானும், அபூபக்ரும் உமரும் இந்த நிகழ்ச்சியை நம்புகிறோம்” என்று கூறினார்கள். பிறகு, (இதை அபூஹுரைரா (ரலி) அவர்களிடமிருந்து அறிவித்த) அபூசலமா (ரஹ்) அவர்கள், ‘‘நபி (ஸல்) அவர்கள் இதைக் கூறிய அந்நாளில் அபூ பக்ரும் உமரும் அங்கு இருக்கவில்லை” என்று கூறினார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2325,
			"arabicnumber": 2325,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (மதீனாவாசிகளான) அன்சாரி தோழர் கள், நபி (ஸல்) அவர்களிடம், ‘‘எங்களுக் கும் (மக்கா நகரிலிருந்து வந்த) எங்கள் (முஹாஜிர்) சகோதரர்களுக்கும் இடையே எங்கள் பேரீச்சமரங்களைப் பங்கிட்டு விடுங்கள்” என்றனர். அதற்கு நபி (ஸல்) அவர்கள், ‘‘வேண்டாம்” என்று கூறிவிட்டார்கள். இதைக் கேட்ட அன்சாரி தோழர்கள், முஹாஜிர் சகோதரர்களை நோக்கி, ‘‘அப்படியென்றால், எங்கள் தோட்டத்தை எங்களுக்குப் பதிலாக நீங்கள் பராமரித்துவாருங்கள். நாங்கள் உங்களுடன் அதன் வருமானத்தில் பங்கு பெற்றுக்கொள்கிறோம்” என்று கூறினர். அதற்கு முஹாஜிர்கள், ‘‘செவியேற்றோம்; கீழ்ப்படிந்தோம் (அவ்வாறே செய்கிறோம்)” என்று கூறினார்கள்.4 அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2326,
			"arabicnumber": 2326,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பனூ நளீர் குலத் தாரின் பேரீச்ச மரங்களைத் தீயிலிட்டுக் கொளுத்தியும் (இன்னும் பல மரங்களை) வெட்டியும்விட்டார்கள். இந்தப் பேரீச்சந் தோப்புகளுக்குத்தான் ‘அல்புவைரா’ என்று கூறுவர். இதைக் குறிப்பிட்டுத்தான் ஹஸ்ஸான் பின் ஸாபித் (ரலி) அவர்கள், ‘‘புவைராவின் நெருப்பு பரவிக்கொண்டிருக்க, அதை (அணைத்திட) எதுவும் செய்ய முடியாமல் (இயலாமையுடன்) பார்த்துக்கொண்டிருப்பது யிபனூ லுஅய்’ குலத்து (குறைஷி)த் தலைவர்களுக்கு எளிதாகிவிட்டது” என்று (பரிகாசம் செய்து) கவிதை பாடுகிறார்கள்.6 அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2327,
			"arabicnumber": 2327,
			"text": "ராஃபிஉ பின் கதீஜ் (ரலி) அவர்கள் கூறியதாவது: மதீனாவாசிகளிலேயே அதிகமாக விவசாய வேலை பார்ப்பவர்களாக நாங்கள் இருந்தோம். (மொத்த விளைச்சலில் இவ்வளவு பங்கு என்றில்லாமல்) யிநிலத்தின் ஒரு பகுதி விளைச்சல் மட்டும் அதன் உரிமையாளருக்குரியது’ என்ற நிபந்தனை யுடன் அதைக் குத்தகைக்கு எடுத்து வந்தோம். சில வேளைகளில் அந்தப் பகுதி விளைச்சல் மட்டும் (நோய்களாலும் பூச்சிகளாலும்) பாதிக்கப்பட்டுவிடும். மீதமுள்ள (எங்கள் வருவாய்க்கான) நிலப் பகுதி (அவற்றின் தாக்குதல்களிலிருந்து) தப்பித்துக்கொள்ளும். இன்னும் சில வேளைகளில் மீதமுள்ள நிலப்பகுதி பாதிக்கப்பட்டு, குறிப்பிட்ட பகுதி தப்பித்துக்கொள்ளும். ஆகவே, நாங்கள் (நபி (ஸல்) அவர்களால்) இவ்விதம் குத்தகைக்கு எடுக்க வேண்டா மென்று தடை செய்யப்பட்டோம். அந் நாட்களில் தங்கமும் வெள்ளியும் (குத்தகைத் தொகையாகப் பயன்படுத்தப் படும் வழக்கம்) இருக்கவில்லை. அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2328,
			"arabicnumber": 2328,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் கைபரில் இருந்த மக்களுடன், அங்குள்ள மரங்களில் விளையும் கனிகள், நிலத்தில் விளையும் தானியங்கள் ஆகியவற்றில் பாதியைக் கொடுத்துவிட வேண்டும் என்ற நிபந்தனை யின் பேரில் (கைபரின் நிலங்களையும் மரங்களையும் அம்மக்கள் விவசாயத்திற் காகப் பயன்படுத்திக்கொள்ள அனுமதி யளித்து) ஒப்பந்தம் செய்துகொண் டார்கள். இந்த நிலங்கள் மற்றும் மரங்களின் விளைச்சலிலிருந்து, நபி (ஸல்) அவர்கள், தம் துணைவியருக்கு எண்பது யிவஸ்க்’குகள் பேரீச்சம்பழமும் இருபது யிவஸ்க்’குகள் தொலிநீக்கப்படாத கோதுமையும் ஆக, நூறு யிவஸ்க்’குகள் கொடுத்துவந்தார்கள். உமர் (ரலி) அவர்கள் (கலீஃபாவாக வந்தபோது) கைபர் நிலங்களைப் பங்கிட்டார் கள். அப்போது நபி (ஸல்) அவர்களின் துணைவியருக்கு, அவர்கள் தங்கள் பங்காக நிலத்தையும் நீரையும் மட்டும் எடுத்துக்கொள்வது, அல்லது முன்பு நடைபெற்று வந்த வழக்கத்தின்படியே, நூறு யிவஸ்க்’குகளைத் தங்கள் பங்காகப் பெற்றுக்கொள்வது என்று இரண்டில் எதை வேண்டுமானாலும் தேர்ந்தெடுத்துக் கொள்ள உரிமையளித்தார்கள். அவர்களில் சிலர் நிலத்தைத் தமக்காகப் பெற்றுக் கொண்டனர். சிலர் (முன்பு கிடைத்து வந்தபடி) யிவஸ்க்’குகளையே தொடர்ந்து பெற்றுக்கொண்டனர். அன்னை ஆயிஷா (ரலி) அவர்கள் நிலத்தைப் பெற்றுக் கொண்டார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2329,
			"arabicnumber": 2329,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் கைபரில் உள்ள மரங்களையும் நிலங்களையும் ‘அவற்றில் விளையும் (பழங்கள், தானியங்கள், காய்கறிகள் ஆகியவற்றின்) விளைச்சலில் பாதியை (இஸ்லாமிய அரசுக்குக்) கொடுத்து விட வேண்டும்’ என்னும் நிபந்தனையின் பேரில் கைபர் வாழ் மக்களுடன் ஒப்பந்தம் செய்துகொண்டார்கள்.7 அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2330,
			"arabicnumber": 2330,
			"text": "அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறியதாவது: நான் தாவூஸ் (ரஹ்) அவர்களிடம், ‘‘(விளைச்சலில் ஒரு பகுதியைப் பெற்றுக் கொண்டு) நிலத்தைக் குத்தகைக்கு விடுவதை நீங்கள் விட்டுவிட்டால் நன்றாயிருக்கும். ஏனென்றால், நபி (ஸல்) அவர்கள் நிலத்தைக் குத்தகைக்கு விடவேண்டாமென்று மக்களைத் தடுத்தார்கள் என்று சிலர் எண்ணுகிறார்கள்” என்றேன். இதைக் கேட்ட தாவூஸ் (ரஹ்) அவர்கள் (என்னிடம்) சொன்னார்கள்: அம்ரே! (எனது நிலத்தை அவர்களுக்குக் குத்தகைக்கு விடுவதால்) அவர்களுக்கு நிலத்தைக் கொடுத்து நான் உதவுகிறேன். ஏனெனில், ‘‘நபி (ஸல்) அவர்கள் அதைத் தடை செய்யவில்லை. மாறாக, யிஉங்களில் ஒருவர் தன் நிலத்தைக் குத்தகைக்கு விட்டு, அதிலிருந்து குறிப்பிட்ட குத்தகைத் தொகையை வாங்கிக்கொள்வதைவிட, தன் சகோதரனுக்கு (இலவசமாகப் பயன்படுத்திக்கொள்ளும்படி அதைக்) கொடுத்துவிடுவது சிறந்ததாகும்’ என்றுதான் நபி (ஸல்) அவர்கள் கூறினார்கள்” என்று மக்களில் பேரறிஞரான இப்னு அப்பாஸ் (ரலி) அவர்கள் என்னிடம் தெரிவித்தார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2331,
			"arabicnumber": 2331,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், கைபர் பகுதியில் உள்ள நிலங்களை யூதர்களுக்கு, ‘அவர்கள் அவற்றில் உழைத்து விவசாயம் செய்து கொள்ளலாம். அதிலிருந்து கிடைக்கும் விளைச்சலில் பாதி அவர்களுக்குரியது (மீதிப் பாதியை மதீனாவின் இஸ்லாமிய அரசுக்குக் கொடுத்துவிட வேண்டும்)› என்னும் நிபந்தனையின் பேரில் கொடுத்தார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2332,
			"arabicnumber": 2332,
			"text": "ராஃபிஉ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் மதீனாவாசிகளிலேயே அதிகமாகப் பண்ணை வயல்களில் விவசாயம் செய்பவர்களாயிருந்தோம். நாங்கள் நிலத்தைக் குத்தகைக்கு எடுக்கும்போது நிலத்தின் உரிமையாளரிடம், ‘‘(நிலத்தின்) இந்தத் துண்டு(டைய விளைச்சல் குத்தகைப் பங்காக) உஙகளுக்குரியது. இந்தத் துண்டு(டைய விளைச்சல்) எங்களுக்குரியது” என்று சொல்வது வழக்கம். சில வேளைகளில், நிலத்தின் ஒரு பகுதி விளைச்சல் தரும்; இன்னொரு பகுதி விளைச்சல் தராது. ஆகவே, நபி (ஸல்) அவர்கள் இவ்வாறு நிபந்தனையிட வேண்டாமென்று எங்களைத் தடுத்து விட்டார்கள்.8 அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2333,
			"arabicnumber": 2333,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: மூன்று பேர் நடந்து சென்றுகொண்டி ருந்தனர். அப்போது திடீர் என மழை பிடித்துக்கொண்டது. எனவே, அம்மூவரும் மலைப் பகுதியில் அமைந்திருந்த குகை ஒன்றில் தஞ்சம் புகுந்தனர். (எதிர் பாராவிதமாக) பெரும் பாறை ஒன்று மலையிலிருந்து உருண்டு வந்து அந்தக் குகையின் வாயிலை மூடிக்கொண்டது. (இதைக் கண்ட) அவர்கள் தமக்குள், ‘‘நாம் (வேறெவரின் திருப்திக்காகவுமின்றி) அல்லாஹ்வுக்காக என்று தூய்மையான முறையில் செய்த நற்செயல்களை நினைத்துப் பார்த்து, அவற்றைக் கொண்டு அல்லாஹ்விடம் பிரார்த்திப்போம். அவன் இந்தப் பாறையை நம்மை விட்டு அகற்றிவிடக்கூடும்” என்று பேசிக்கொண்டனர். அவர்களில் ஒருவர் இவ்விதம் (இறைவனிடம்) பிரார்த்தித்தார்: இறைவா! எனக்கு முதிர்ந்த வயதுடைய தாய் தந்தையர் இருந்தனர். சிறு குழந்தைகளும் இருந்தனர். அவர்களைப் பராமரிப்பதற்காக நான் ஆடுகளை மேய்த்துக்கொண்டிருந்தேன். மாலையில் நான் திரும்பி வந்தபின் ஆட்டின் பாலைக் கறந்து கொண்டுவந்து என் குழந்தை களுக்குக் கொடுப்பதற்கு முன்பாக என் தாய் தந்தையர்க்கு அதைப் புகட்டுவேன். ஒருநாள் நான் தாமதமாகத் திரும்பி வந்தேன். (நான் வீட்டை அடைந்தபோது) (நெடு நேரம் கழிந்து) இரவாகிவிட்டிருந்தது. (என் தாய், தந்தை) இருவரும் உறங்கி விட்டிருக்கக் கண்டேன். வழக்கமாக நான் கறந்து வந்ததைப் போன்றே அன்றைக்கும் (ஆட்டுப்) பாலைக் கறந்து எடுத்துக்கொண்டு வந்தேன். அவர்களை (தூக்கத்திலிருந்து) எழுப்பிட மனமில்லாமல் அவர்களுடைய தலைமாட்டில் நின்றுகொண்டேன். என் (தாய் தந்தையர்க்கு முதலில் புகட்டாமல் என்) குழந்தைகளுக்கு முதலில் புகட்டிட எனக்கு விருப்பமில்லை. என் குழந்தை களோ (என்) காலுக்கு அடியில் பாலுக்காக அழுது பரிதவித்துக்கொண்டிருந்தனர். இதே நிலையில் வைகறை நேரம் உதயமாகிவிட்டது. நான் இச்செயலை உன் அன்பை நாடியே செய்திருக்கிறேன் என்று நீ கருதினால் எங்களுக்கு இந்தப் பாறையை சற்றே நகர்த்திக் கொடுப்பாயாக! அதன் வழியாக நாங்கள் வானத்தைப் பார்த்துக்கொள்வோம். அவ்வாறே (அவர்களுக்கு) அல்லாஹ் சிறிதளவு நகர்த்தித்தந்தான். அதன் வழியாக அவர்கள் வானத்தைப் பார்த்தார்கள். மற்றொருவர் பின்வருமாறு பிரார்த்தனை புரிந்தார்: இறைவா! எனக்கு என் தந்தையின் சகோதரருடைய மகள் (ஒன்றுவிட்ட சகோதரிலி முறைப் பெண்) ஒருத்தி இருந்தாள். ஆண்கள் பெண்களை எப்படி ஆழமாக நேசிப்பார்களோ அப்படி நான் அவளை நேசித்தேன். நான் அவளிடம் என்னுடன் உடலுறவு கொள்ள வருமாறு அழைத்தேன். நான் அவளுக்கு நூறு தீனார்கள் (பொற்காசுகள்) கொடுத்தால் தவிர என்னுடன் உறவு கொள்ள முடியாது என்று அவள் மறுத்தாள். நான் அ(ந்தப் பணத்)தை மிகவும் சிரமப்பட்டு லிஅல்லது முயற்சி செய்துலி சேகரித்தேன். நான் (அந்தப் பணத்துடன் சென்று) அவளுடைய இரு கால்களுக்கும் இடையே அமர்ந்தபோது அவள், ‘‘அல்லாஹ்வின் அடியானே! அல்லாஹ் வுக்கு அஞ்சு. முத்திரையை (கற்பை) அதற்குரிய (மணபந்த) உரிமையின்றி திறக்காதே” என்று கூறினாள். உடனே நான் (உடலுறவு கொள்ளாமல்) எழுந்து விட்டேன். (இறைவா! உன் அச்சத்தால் நான் புரிந்த) இந்த நற்செயலை நான் உன் அன்பைப் பெற விரும்பியே செய்ததாக நீ கருதினால் இந்தப் பாறையை எங்களை விட்டு (இன்னும்) சற்று நீக்கிவிடுவாயாக! உடனே பாறை இன்னும் சற்று விலகி யது. மூன்றாமவர் பின்வருமாறு பிரார்த்தனை புரிந்தார்: இறைவா! நான் ஒரு யிஃபரக்’ அளவு நெல்லைக் கூலியாக நிர்ணயித்துக் கூலியாள் ஒருவரை வேலை செய்ய அழைத்துச் சென்றேன். அவர் தமது வேலை முடிந்தவுடன், ‘‘என்னுடைய உரிமையை (கூலியைக்) கொடு” என்று கேட்டார். நான் (நிர்ணயம் செய்திருந்த) அவரது கூலியை அவர்முன் வைத்தேன். அவர் அதை ஏற்க மறுத்துவிட்டார். (அவர் சென்றபின்) அதை நான் தொடர்ந்து நிலத்தில் விதைத்து விவசாயம் செய்துவந்தேன். எதுவரையென்றால், அதன் வருவாயிலிருந்து பல மாடுகளையும் இடையர்களையும் நான் சேகரித்துவிட்டேன். சில காலங்களுக்குப் பிறகு அந்த மனிதர் (கூலியாள்) என்னிடம் வந்து, ‘‘அல்லாஹ்வுக்கு அஞ்சு” என்று கூறினார். நான் அவரிடம், ‘‘அந்த மாடுகளிடமும் இடையர்களிடமும் சென்று அவற்றை எடுத்துக்கொள்” என்றேன். அதற்கு அம்மனிதர், ‘‘அல்லாஹ்வுக்கு அஞ்சு. என்னைப் பரிகாசம் செய்யாதே” என்று கூறினார். நான், ‘‘உன்னை நான் பரிகாசம் செய்யவில்லை. நீ இவற்றை எடுத்துக்கொள்” என்று பதிலளித்தேன். அவர் அவற்றை எடுத்துச் சென்றுவிட்டார். நான் இந்த நற்செயலை உன் அன்பைப் பெற விரும்பியே செய்திருந்ததாக நீ கருதினால் மீதமுள்ள அடைப்பையும் நீக்குவாயாக! (இந்தப் பிரார்த்தனை முடிந்தவுடன்) அல்லாஹ் (அப்பாறையை முழுவதுமாக அகற்றி) மீதியிருந்த அடைப்பையும் நீக்கிவிட்டான். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2334,
			"arabicnumber": 2334,
			"text": "அஸ்லம் (ரஹ்) அவர்கள் கூறியதாவது: ‘‘முஸ்லிம்களின் வருங்காலத் தலைமுறைகள் இல்லாதிருந்தால் நபி (ஸல்) அவர்கள் கைபர் நிலங்களைப் பங்கிட்டதைப் போன்று நானும், நான் வெற்றி கொண்ட ஊர்களின் நிலங்களையெல்லாம் (அவற்றை வென்றவர்களான) உரியவர் களிடையே பங்கிட்டிருப்பேன்” என்று உமர் (ரலி) அவர்கள் கூறினார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2335,
			"arabicnumber": 2335,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ‘‘எவர் யாருக்கும் சொந்தமில்லாத ஒரு நிலத்தைப் பயிரிடுகிறாரோ அதைச் சொந்தமாக்கிக்கொள்ள அவரே அதிக உரிமையுடையவர் ஆவார்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். ‘‘உமர் (ரலி) அவர்கள் தமது ஆட்சிக் காலத்தில் இதை ஆதாரமாகக் கொண்டே தீர்ப்பளித்தார்கள்” என்று உர்வா (ரஹ்) அவர்கள் கூறினார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2336,
			"arabicnumber": 2336,
			"text": "உமர் (ரலி) அவர்கள் கூறியதாவது: ‘அல்அகீக்’ பள்ளத்தாக்கின் கீழே (பத்னுல் வாதியில்) யிதுல்ஹுலைஃபா’ எனுமிடத்தில், தமது ஓய்விடத்தில் நபி (ஸல்) அவர்கள் இரவைக் கழித்துக் கொண்டிருந்தபோது கனவொன்று கண்டார் கள். அதில் அவர்களுக்கு, ‘‘நீங்கள் அருள்வளம் நிரம்பிய ஒரு பள்ளத்தாக்கில் தங்கியுள்ளீர்கள்” என்று கூறப்பட்டது. (அறிவிப்பாளர்) மூசா பின் உக்பா (ரஹ்) அவர்கள் கூறினார்கள்: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் தமது ஒட்டகத்தை எங்கே மண்டியிட்டு அமரச்செய்வது வழக்கமோ அதே இடத்தில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓய்வெடுக்கும் இடத்தைத் தேடியவராக, எங்கள் ஒட்டகத்தையும் சாலிம் (ரஹ்) அவர்கள் மண்டியிட்டு அமரச்செய்தார்கள். (நபி (ஸல்) அவர்களின்) அந்த ஓய்விடம் ‘அகீக்’ பள்ளத்தாக்கின் அடிவாரத்தில் அமைந்திருந்த பள்ளி வாசலுக்குக் கீழ்ப் பகுதியில் இருந்தது. பள்ளிவாசலிலிருந்து (வரும்) நடுவழி யொன்று அந்த ஓய்விடத்திற்கும் நெடுஞ்சாலைக்கும் இடையே அமைந்திருந்தது. அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2337,
			"arabicnumber": 2337,
			"text": "உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ‘அல்அகீக்’ பள்ளத்தாக்கில் தங்கியிருந்தபோது ‘‘இன்றிரவு (என் கனவில்) என் அதிபதியான இறைவனிடமிருந்து (வானவர்) ஒருவர் (ஜிப்ரீல்) வருகை தந்து, யிஇந்த அருள்வளம் நிரம்பிய பள்ளத்தாக்கில் தொழுவீராக! மேலும், யிஹஜ்ஜுடன் உம்ரா செய்ய நாடுகிறேன்’ என்று சொல்வீராக!› என்று சொன்னார்” என நபி (ஸல்) அவர்கள் கூறினார்கள்.9 அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2338,
			"arabicnumber": 2338,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் யூதர்களையும் கிறித்தவர்களையும் ஹிஜாஸ் மாநிலத்திலிருந்து நாடு கடத்தி விட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கைபர் பிரதேசத்தை வெற்றி கொண்டபொழுது (அங்கிருந்த) யூதர்களை நாடு கடத்திட விரும்பினார்கள். (ஏனெனில்,) அந்தப் பிரதேசத்தை வெற்றி கொண்டுவிட்டபொழுது அந்தப் பகுதியி லிருந்த நிலம் முழுவதும் அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் முஸ்லிம்களுக்கும் உரியதாகிவிட்டிருந்தது. (அந்த நிலையில்) யூதர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், ‘‘நாங்கள் இந்த நிலங்களில் பயிரிட்டு உழைக்கிறோம். இவற்றின் விளைச்சலில் பாதியைப் பெற்றுக்கொள்கிறோம். (மீதியை இஸ்லாமிய அரசுக்கு நிலவரியாகச் செலுத்திவிடுகிறோம்)” என்று கேட்டுக் கொண்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘நீங்கள் ஒப்புக்கொண்ட இந்த நிபந்தனையின் (நிலக் குத்தகை ஒப்பந்தத்தின்) அடிப்படையில் நாம் விரும்பும்வரை நீங்கள் அதில் பயிரிட்டுக் கொள்ள நாம் அனுமதிக்கிறோம்” என்று கூறினார்கள். ஆகவே, உமர் (ரலி) அவர்கள், தமது ஆட்சிக் காலத்தில் அந்த யூதர்களை தைமா, அரீஹா (ஜெரிக்கோ) ஆகிய பகுதிகளுக்கு நாடு கடத்தி அனுப்பும்வரை அவர்கள் அங்கேயே (நிலங்களைப் பயி ரிட்டு வரி செலுத்தி) வசித்துவந்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2339,
			"arabicnumber": 2339,
			"text": "ராஃபிஉ பின் கதீஜ் (ரலி) அவர்கள் கூறியதாவது: ‘‘எங்களுக்கு உதவியாக இருந்த ஒன்றைக் கூடாது என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்குத் தடை விதித்தார்கள்” என்று (என் தந்தையின் சகோதரர்) ளுஹைர் (ரலி) அவர்கள் கூறினார்கள். (உடனே), ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொன்னதே சரியானது” என்று நான் கூறினேன். (அதற்கு) அவர் சொன்னார்: ஒரு முறை என்னை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழைத்து, ‘‘நீங்கள் உங்கள் வயல்களை என்ன செய்கிறீர்கள்?” என்று கேட்டார்கள். நீரோடைகளின் கரைகளின் ஓரமாக விளைபவற்றை எங்களுக்குக் கொடுத்துவிட வேண்டும் என்னும் நிபந்தனையின் பேரில் அல்லது சில யிவஸ்க்’குகள் பேரீச்சம் பழங்களை அல்லது தொலி நீக்கப்படாத கோதுமையை எங்களுக்குக் கொடுத்துவிட வேண்டும் என்னும் நிபந்தனையின் பேரில் அவற்றைக் குத்தகைக்கு விட்டுவிடு கின்றோம்” என்று நான் பதிலளித்தேன். அதற்கு நபியவர்கள், ‘‘அவ்வாறு செய்யாதீர்கள். நீங்களே அவற்றில் வேளாண்மை செய்யுங்கள்; அல்லது பிறருக்கு இலவசமாக (கைமாறு பெறாமல்) பயிரிடக் கொடுத்துவிடுங்கள்; அல்லது பயிரிடாமல் அப்படியே விட்டுவிடுங்கள்” என்று சொன்னார்கள். (இதைக் கேட்ட) நான், ‘‘நாங்கள் செவியேற்றோம்; கீழ்ப்படிந்தோம்” என்று கூறினேன். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2341,
			"arabicnumber": 2341,
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2342,
			"arabicnumber": 2342,
			"text": "அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறியதாவது: ராஃபிஉ பின் கதீஜ் (ரலி) அவர்கள் அறிவித்த நபிமொழியை, நான் தாஊஸ் (ரஹ்) அவர்களிடம் கூறியபோது அவர்கள் என்னிடம் (பின்வருமாறு) கூறினார்கள்: ஒருவர் தமது நிலத்தைக் குத்தகைக்கு விட்டுப் பயிரிடச் செய்வது அனுமதிக்கப் பட்டதேயாகும். ஏனெனில், நபி (ஸல்) அவர்கள் அதை (நிலத்தைக் குத்தகைக்கு விடுவதை)த் தடை செய்யவில்லை. மாறாக, ‘‘ஒருவர் தம் சகோதரருக்குத் தமது நிலத்தை இலவசமாகப் பயிரிட்டு (அதன் விளைச்சல் முழுவதையும் எடுத்து)க்கொள்ளக் கொடுத்துவிடுவதானது, அதற்காக ஒரு குறிப்பிட்ட பங்கை (குத்தகைத் தொகையாகப்) பெற்றுக்கொள்வதைவிடச் சிறந்தது’ என்றுதான் கூறினார்கள்” என இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியுள்ளார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2344,
			"arabicnumber": 2344,
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2345,
			"arabicnumber": 2345,
			"text": "சாலிம் (ரஹ்) அவர்கள் கூறியதாவது: ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் காலத்தில் நிலம் குத்தகைக்கு விடப்பட்டுவந்ததை நான் அறிந்திருந்தேன்” என்று அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறினார்கள். பிறகு அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் (ராஃபிஉ பின் கதீஜ் (ரலி) அவர்கள் கூறியதைக் கேட்டபின்) நிலக் குத்தகை தொடர்பாக நபி (ஸல்) அவர்கள் (அது கூடாது என்று) புதிய சட்டம் எதையேனும் பிறப்பித்து (பழைய விதிகளை மாற்றியமைத்து)விட்டிருக்க, அதை நாம் அறியாதிருந்துவிட் டோமோ என்று அஞ்சி நிலத்தைக் குத்தகைக்கு விடுவதை நிறுத்திவிட்டார்கள். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2347,
			"arabicnumber": 2347,
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2348,
			"arabicnumber": 2348,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு முறை நபி (ஸல்) அவர்கள், கிராம வாசி ஒருவர் தம்மிடம் அமர்ந்திருக்க (பின்வரும் நிகழ்ச்சியை) எடுத்துரைத்துக் கொண்டிருந்தார்கள்: சொர்க்கவாசிகளில் ஒரு மனிதர், தம் இறைவனிடம் விவசாயம் செய்ய அனுமதி கேட்பார். அதற்கு இறைவன் அவரிடம், ‘‘நீ விரும்பிய (இன்பமான) நிலையில் (இப்போது) நீ வாழ்ந்துகொண்டிருக்க வில்லையா?” என்று கேட்பான். அதற்கு அவர், ‘‘ஆம். (நான் விரும்பியபடியே இன்பமான நிலையில்தான் வாழ்ந்து கொண்டிருக்கின்றேன்.) ஆனால், நான் நிலத்தை உழுது பயிரிட விரும்புகிறேன்” என்று கூறுவார். (இறைவனும் அவருக்கு அனுமதியளிப்பான்.) அந்த மனிதர் விதை தூவிவிடுவார். கண் இமைக்கும் நேரத்திற்குள் அந்தப் பயிர் வளர்ந்து முதிர்ந்து அறுவடைக்குத் தயாராகிவிடும்; மலைகளைப் போல் விளைந்து குவிந்துவிடும். அப்போது இறைவன், ‘‘எடுத்துக்கொள், ஆதமின் மகனே! உன்னை எதுவுமே திருப்திப்படுத் தாது” என்று கூறுவான். (நபி (ஸல்) அவர்களிடமிருந்து இதைச் செவியுற்ற) அந்தக் கிராமவாசி, ‘‘அல்லாஹ்வின் மீதாணையாக! அந்த மனிதர் குறைஷியாகவோ (மக்காவாசியாகவோ) அன்சாரியாகவோ (மதீனாவாசியாகவோ)தான் இருக்க முடியும். அவர்கள்தான் விவசாயிகள். நாங்களோ விவசாயிகள் அல்லர்” என்று கூறினார். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள் சிரித்து விட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2349,
			"arabicnumber": 2349,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் வெள்ளிக்கிழமையன்று மிகுந்த மகிழ்ச்சியுடன் இருந்துவந்தோம். ஏனெனில், எங்களுடன் மூதாட்டி ஒருவர் நட்பாக இருந்தார். அவர், எங்கள் நீரோடைகளின் ஓரமாக நாங்கள் நட்டு வந்த யிசில்க்’ என்னும் கீரைத் தண்டுகளைப் பிடுங்கி, அவற்றைத் தமது பாத்திர மொன்றில் போட்டு, அவற்றுடன் தொலி நீக்கப்படாத கோதுமை வித்துகள் சில வற்றையும் கலந்து (ஒரு வகை உணவைத் தயார் செய்து) தருவார். நாங்கள் ஜுமுஆ தொழுகை தொழுதுவிட்டோமென்றால் அந்த மூதாட்டியைச் சந்திப்போம். அவர் அந்த உணவை எங்களுக்குப் பிரியமாகத் தருவார். இதன் காரணமாக நாங்கள் வெள்ளிக்கிழமையன்று மகிழ்ச்சியுடன் இருப்போம். ஜுமுஆ தொழுகைக்குப் பிறகுதான் நாங்கள் உண்போம்; மதிய ஓய்வு கொள்வோம். இதன் மூன்றாவது அறிவிப்பாளரான யஅகூப் (ரஹ்) அவர்கள் கூறுகிறார்கள்: இரண்டாம் அறிவிப்பாளர் அபூ ஹாஸிம் (ரஹ்) அவர்கள், ‘‘அந்த உணவு கெட்டியான கொழுப்போ திரவக் கொழுப்போ எதுவும் அற்றதாக இருந்தது” என்று கூறியதாகவே நான் கருதுகிறேன். அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2350,
			"arabicnumber": 2350,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அபூஹுரைரா ஏராளமான நபிமொழிகளை அறிவிக்கிறாரே என்று மக்கள் (என்னைக் குறைகூறும் தொனியில்) பேசிக்கொள்கிறார்கள். அல்லாஹ்விடம் இதற்கெனக் குறித்த வேளை ஒன்று உண்டு. மேலும், அவர்கள், ‘‘முஹாஜிர்களுக்கும் அன்சாரிகளுக்கும் என்ன நேர்ந்துவிட்டது? அபூஹுரைரா நபிமொழிகளை அறிவிப் பதைப் போன்று அவர்கள் அறிவிப்ப தில்லையே ஏன்?” என்று கேட்கிறார் கள். என் முஹாஜிர் சகோதரர்கள் கடை வீதிகளில் வியாபாரங்களில் ஈடுபட்டி ருந்தனர்; என் அன்சாரி சகோதரர்களோ தங்கள் சொத்துகளைப் பராமரிக்கும் வேலையில் (விவசாயம் போன்ற பணிகளில்) ஈடுபட்டிருந்தனர். (அதே நேரத்தில்) நானோ என் வயிற்றை நிரப்பும் (வருவாய் போதுமென்ற) திருப்தியுடன் (மேற்கொண்டு வருவாய் எதுவும் தேடாமல்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடனேயே எப்போதும் இருப்பதை வழக்கமாகக் கொண்ட ஏழை மனிதனாய் இருந்தேன். நபி (ஸல்) அவர்களுடன் மற்றவர்கள் இல்லாதபோதும் (சம்பாத்தியத்தைத் தேடி அவர்கள் வெளியே சென்றுவிடும் போதும்) நான் (நபியவர்களுடன்) இருப்பேன். அவர்கள் (நபிமொழிகளை) மறந்துவிடும்போது நான் (அவற்றை) நினைவில் (பாதுகாப்பாக) வைத்திருப்பேன். மேலும், ஒருநாள் நபி (ஸல்) அவர்கள், ‘‘நான் எனது இந்தச் சொல்லைச் சொல்லிமுடிக்கின்ற வரை, எவர் தமது ஆடையை விரித்து வைத்திருந்து, பிறகு தம் நெஞ்சோடு அதைச் சேர்த்து வைத்துக்கொள்கிறாரோ அவர் என் வாக்கு எதையும் மறக்கமாட்டார்” என்று கூற, நான் என் அங்கியை விரித்தேன். அதைத் தவிர என்மீது வேறு ஆடை எதுவும் இருக்கவில்லை. நபி (ஸல்) அவர்கள் தமது சொல்லைச் சொல்லி முடிக்கும்வரை அதை அப்படியே விரித்து வைத்தி ருந்துவிட்டு, பிறகு அதை என் நெஞ்சோடு சேர்த்து (அணைத்து)க்கொண்டேன். நபி (ஸல்) அவர்களைச் சத்திய மார்க்கத்துடன் அனுப்பிவைத்தவன் மீதாணை யாக! அப்போதிருந்து அவர்களுடைய சொற்களில் எதையுமே இன்றுவரை நான் மறக்கவில்லை. அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வுடைய வேதத்தின் இரு வசனங்கள் மட்டும் இல்லையென்றால் நான் (நபிமொழிகளில்) எதையுமே உங்களுக்கு ஒருபோதும் அறிவித்திருக்க மாட்டேன். இவைதான் அந்த வசனங்கள்: நாம் அருளிய சான்றுகளையும் நல்வழியையும் வேதத்தில் நாம் மக்களுக் குத் தெளிவுபடுத்திய பிறகும் அவற்றை மறைப்பவர்களை அல்லாஹ் சபிக்கின்றான்; சபிப்போரும் அவர்களைச் சபிக்கின்றனர்; எனினும், பாவத்திலிருந்து மீண்டு, (தம்மைச்) சீர்திருத்தி (தாம் மறைத்தவற்றை) தெளிவுபடுத்தியவர்களைத் தவிர. அவர்களை நான் மன்னிப்பேன். நான் மிகவும் மன்னிப்பவனும் பெருங் கருணையாளனும் ஆவேன். (2:159,160) அத்தியாயம் : 41",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		}
	]
}