{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"45": "Lost Things Picked up by Someone (Luqatah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2426,
			"arabicnumber": 2426,
			"text": "உபை பின் கஅப் (ரலி) அவர்கள் கூறியதாவது: நான் ஒரு பணப்பையைக் கண்டெடுத் தேன். அதில் நூறு பொற்காசுகள் இருந்தன. (அதை எடுத்துக்கொண்டு) நபி (ஸல்) அவர்களிடம் வந்தேன். அவர்கள், ‘‘ஓராண்டுக் காலம் அதைப் பற்றி நீர் (பொது) அறிவிப்புச் செய்வீராக!” என்று கூறினார்கள். நானும் அதைப் பற்றி அறிவிப்புக் கொடுத்தேன். அதை அடை யாளம் புரிந்துகொள்பவர் எவரையும் நான் காணவில்லை. பிறகு மீண்டும் நான் நபி (ஸல்) அவர்களிடம் சென்றேன். அப்போதும், ‘‘ஓராண்டுக் காலம் அதைப் பற்றி அறிவிப்புச் செய்க!” என்று கூறி னார்கள். நானும் அதைப் பற்றி அறி விப்புக் கொடுத்தேன். அதை அடையாளம் புரிந்து (பெற்றுக்)கொள்பவர் எவரையும் நான் காணவில்லை. பிறகு மூன்றாவது முறையாக நபி (ஸல்) அவர்களிடம் வந்தேன். அப்போது அவர்கள், ‘‘அதன் பையையும் அதன் எண்ணிக்கையையும் அதன் முடிச்சையும் நினைவில் வைத்திருப்பீராக! அதன் உரிமையாளர் வந்தால் அவரிடம் ஒப்படைத்துவிடுக!. இல்லையென்றால் நீரே அதைப் பயன்படுத்திக்கொள்க” என்று கூறினார்கள். ஆகவே, நானே அதைப் பயன்படுத்திக்கொண்டேன். அறிவிப்பாளர் ஷுஅபா (ரஹ்) அவர்கள் கூறுகிறார்கள்: (இதை எனக்கு அறிவித்த) சலமா (ரஹ்) அவர்களைப் பின்னர் மக்காவில் சந்தித்தேன். அப்போது அவர்கள், ‘‘(நான் அறிவித்த ஹதீஸில்) நபி (ஸல்) அவர்கள், யிமூன்று ஆண்டுகள் அறிவிப்புச் செய்ய வேண்டும்’ என்று கூறினார்களா, அல்லது யிஓராண்டுக் காலம்வரை மட்டும் அறிவிப்புச் செய்ய வேண்டும்’ என்று கூறினார்களா என்று நான் அறியமாட்டேன்” (அதாவது ‘‘எனக்கு நினைவில்லை”) என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2427,
			"arabicnumber": 2427,
			"text": "ஸைத் பின் காலித் அல்ஜுஹனீ(ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் ஒரு கிராம வாசி வந்து, (பாதையில்) கண்டெடுக்கும் பொருளைப் பற்றிக் கேட்டார். நபி (ஸல்) அவர்கள், ‘‘ஒரு வருட காலத்திற்கு அதைப் பற்றி அறிவிப்புச்செய். பிறகு, அதன் பை(உறை)யையும் அதன் முடிச்சை யும் அடையாளம் பார்த்து வைத்துக்கொள். அதைப் பற்றி (அடையாளம்) தெரிவிப்ப வர் எவராவது உன்னிடம் வந்தால் (அவரிடம் ஒப்படைத்துவிடு.) இல்லை யென்றால், அதை உன் செலவுக்கு எடுத்துக்கொள்” என்று கூறினார்கள். அந்தக் கிராமவாசி, ‘‘அல்லாஹ்வின் தூதரே! வழிதவறி (நம்மிடம் வந்து சேர்ந்து)விட்ட ஆட்டை என்ன செய்வது?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், ‘‘அது உனக்குரியது; அல்லது உன் சகோதரருக்குரியது; அல்லது ஓநாய்க்குரியது” என்று கூறினார்கள்.2 அந்தக் கிராமவாசி, ‘‘வழிதவறி வந்த ஒட்டகத்தை என்ன செய்வது?” என்று கேட்டார். இதைக் கேட்டவுடன் நபி (ஸல்) அவர்களின் முகம் (வெறுப்பால் மங்கலாகி) நிறம் மாறிவிட்டது. பிறகு, ‘‘உனக்கும் அதற்கும் என்ன சம்பந்தம்? அதனுடன் அதன் குளம்பும் அதன் தண்ணீர்ப் பையும் உள்ளதே! நீர்நிலைகளுக்கு அது செல்கிறது; மரத்திலிருந்து தின்கிறது” என்று கூறினார்கள்.3 அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2428,
			"arabicnumber": 2428,
			"text": "ஸைத் பின் காலித் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் கண்டெடுக்கப் பட்ட பொருள் பற்றிக் கேட்கப்பட்டது. அதற்கு நபி (ஸல்) அவர்கள், ‘‘அதன் பை(உறை)யையும் அதன் முடிச்சையும் அடையாளம் அறிந்துகொள். பிறகு ஓராண்டுக் காலத்திற்கு (அதை) அறிவிப்புச் செய்” என்று கூறினார்கள். பின்னர் அறிவிப்பாளர் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: அதை அடையாளம் கூறிப் பெற்றுக் கொள்ள எவரும் முன்வராவிட்டால் அதைக் கண்டெடுத்தவர் அதைச் செலவு செய்துகொள்வார். மேலும், அது அவரிடத் தில் அடைக்கலப் பொருளாக இருக்கும். ‘‘இந்தப் பிந்திய வாக்கியம் மட்டும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் சொல்லா, அல்லது அறிவிப்பாளர் யஸீத் அவர்களின் சொல்லா என்பது எனக்குத் தெரியவில்லை” என்று அறிவிப்பாளர் யஹ்யா பின் சயீத் (ரஹ்) அவர்கள் கூறுகிறார்கள்.4 பிறகு நபி (ஸல்) அவர்களிடம் (கண்டெடுத்த பொருளைப் பற்றிக் கேட்டவர்), ‘‘வழிதவறி வந்த ஆட்டைப் பற்றி என்ன கருதுகிறீர்கள்?” என்று கேட்டார். நபி (ஸல்) அவர்கள், ‘‘அதை நீ எடுத்துக்கொள். ஏனெனில், அது உனக்குரியது; அல்லது உன் சகோதரருக்குரியது; அல்லது ஓநாய்க்குரியது” என்று கூறினார்கள். அறிவிப்பாளர் யஸீத் (ரஹ்) அவர்கள், ‘‘அதையும்கூட அறிவிப்புச் செய்ய வேண்டும்” என்று கூறினார்கள். பிறகு அந்த நபர், ‘‘வழிதவறி வந்த ஒட்டகத்தைப் பற்றி என்ன கருதுகிறீர்கள்?” என்று கேட்க, நபி (ஸல்) அவர்கள், ‘‘அதை (அப்படியே) விட்டுவிடுவீராக!. ஏனெனில், அதனுடன் அதன் குளம்பு இருக்கிறது; அதன் தண்ணீர்ப்பை (வயிறு) இருக்கிறது; அதை அதன் உரிமையாளர் அடைந்துகொள்ளும்வரை அது நீர் நிலைகளுக்குச் செல்கிறது; (அங்கே நீரருந்தித் தாகம் தணித்துக்கொள்கிறது;) மரங்களிலிருந்து (இலை தழைகளைத்) தின்கிறது” என்று பதில் கூறினார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2429,
			"arabicnumber": 2429,
			"text": "ஸைத் பின் காலித் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு மனிதர் வந்து, கண்டெடுக்கப் பட்ட பொருளைப் பற்றிக் கேட்டார். நபி (ஸல்) அவர்கள், ‘‘அதன் பையையும் (உறையையும்) முடிச்சையும் (மூடியையும்) அடையாளம் பார்த்து வைத்துக்கொள். பிறகு ஒரு வருட காலத்திற்கு அதைப் பற்றி அறிவிப்புச் செய்துகொண்டேயிரு. அதன் உரிமையாளர் வந்தால் கொடுத்துவிடு. இல்லையென்றால் உன் விருப்பப்படி அதைப் பயன்படுத்திக்கொள்” என்று சொன்னார்கள். அந்த மனிதர், ‘‘வழிதவறி வந்த ஆட்டை என்ன செய்வது?” என்று கேட்க, நபி (ஸல்) அவர்கள், ‘‘அது உனக்குரியது; அல்லது உன் சகோதரருக்குரியது; அல்லது ஓநாய்க்கு உரியது” என்று கூறினார்கள். அந்த மனிதர், ‘‘வழிதவறி வந்த ஒட்டகத்தை என்ன செய்வது?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், ”உனக்கும் அதற்கும் என்ன தொடர்பு? அதனுடன் அதன் தண்ணீர்ப் பையும் (வயிறும்) அதன் குளம்பும் உள்ளது. அதை அதன் உரிமையாளர் சந்திக்கும் வரை அது நீர் நிலைக்குச் செல்கின்றது; (அங்கு தண்ணீர் குடித்துத் தாகம் தணித்துக் கொள்கிறது;) மரத்திலிருந்து (அதன் இலைகளைத்) தின்கிறது” என்று கூறினார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2430,
			"arabicnumber": 2430,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பனூ இஸ்ராயீல் களில் ஒரு மனிதரை நினைவு கூர்ந்தார்கள். ‘‘...அந்த மனிதர் கடலில் தனது செல்வத்து டன் வாகனம் ஏதும் வருகின்றதா என்று கவனிப்பதற்காகப் புறப்பட்டார். அப்போது ஒரு மரக்கட்டை (கரையில் ஒதுங்கக்) கண்டார். தம் குடும்பத்தாருக்கு விறகாகப் பயன்படட்டும் என்று அதை எடுத்துக்கொண்டார். அதை அவர் பிளந்தபோது தமது செல்வத்தையும் (அதை வைத்து அனுப்பியவரின்) கடிதத்தையும் (அதனுள்) கண்டார்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். அபூஹுரைரா (ரலி) அவர்கள் ஹதீஸ் முழுவதையும் கூறினார்கள்.5 அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2431,
			"arabicnumber": 2431,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பாதையில் கிடந்த ஒரு பேரீச்சம்பழத்தைக் கடந்து சென்றார் கள். ‘‘இது தர்மப் பொருளாக இருக்குமோ என்ற அச்சம் எனக்கு இல்லாவிட்டால், இதை நான் சாப்பிட்டிருப்பேன்” என்று கூறினார்கள்.6 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2432,
			"arabicnumber": 2432,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: நான் என் வீட்டாரிடம் திரும்பி வரு வேன். என் படுக்கையின் மீது பேரீச்சம் பழம் விழுந்திருப்பதைப் பார்த்து அதை உண்பதற்காக எடுப்பேன். அதற்குள் அது தர்மப் பொருளாக இருக்குமோ என்னும் அச்சம் எனக்கு ஏற்படும்; உடனே அதைப் போட்டுவிடுவேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2433,
			"arabicnumber": 2433,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அதன் (மக்காவின்) மரங்களை வெட்டக் கூடாது. அதன் வேட்டைப் பிராணிகளை விரட்டியடிக்கக் கூடாது. அதில் கண்டெடுக்கப்படும் (கேட்பாரற்ற) பொருள் அதைப் பற்றி அறிவிப்புச் செய்பவருக்குத் தவிர வேறெவருக்கும் அனுமதிக்கப்பட்டதன்று. அதன் புற்பூண்டு களைக் கிள்ளவும் கூடாது” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். உடனே அப்பாஸ் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதரே! யிஇத்கிரை’த் தவிரவா?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், யிஇத்கிரைத் தவிர’ என்று பதிலளித்தார்கள்.7 அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ் தன் தூதர் (ஸல்) அவர்களுக்கு மக்கா நகர வெற்றியை அளித்த போது அவர்கள் மக்கள் மத்தியில் நின்று அல்லாஹ்வைப் போற்றிப் புகழ்ந்துவிட்டு, ‘‘அல்லாஹ் மக்காவை (துவம்சம் செய் வதை)விட்டு யானை(ப் படை)யைத் தடுத் தான். அதன்மீது (தற்போது) தன் தூதருக்கும் (எனக்கும்) இறைநம்பிக்கை யாளர்களுக்கும் அதிகாரம் வழங்கியுள் ளான். இந்த மக்கா நகரில் எனக்கு முன்பு எவருக்கும் போரிடுவதற்கு அனுமதியளிக்கப்பட்டதில்லை. எனக்கும்கூட (இதில் போரிடுவதற்கு) பகலின் ஒரு சிறிது நேரத்தில் மட்டுமே அனுமதி வழங்கப்பட்டது. எனக்குப் பின்பும் அது எவருக்கும் அனுமதிக்கப்படவில்லை. இந்நகரின் வேட்டைப் பிராணிகள் விரட்டப்படக் கூடாது. இதன் முட்கள் பிடுங்கப்படக் கூடாது. இதில் கீழே விழுந்து கிடக்கும் பொருளை (எடுத்து வைத்துக்கொள்வது) அதை அறிவிப்புச் செய்பவருக்குத் தவிர வேறெவருக்கும் அனுமதிக்கப்படாது. எவருடைய உறவினர் கொல்லப்பட்டாரோ அவர் இரண்டு விஷயங்களில் சிறந்ததைத் தேர்ந்தெடுத்துக் கொள்ளலாம். ஒன்று, அவர் இழப்பீடு பெற்றுக்கொள்ளலாம்; அல்லது அதற்காகப் பழிவாங்கிக்கொள்ளலாம்” என்று கூறி னார்கள். அப்பாஸ் (ரலி) அவர்கள், ‘‘இத்கிர் புல்லைத் தவிரவா? ஏனெனில், அதை நாங்கள் எங்கள் அடக்கத் தலங்களுக்கும் வீடுகளுக்கும் பயன்படுத்துகிறோம்” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், யிஇத்கிர் புல்லைத் தவிர’ என்று கூறினார்கள். அப்போது யமன்வாசிகளில் ஒருவரான அபூஷாஹ் (ரலி) என்பவர் எழுந்து, ‘‘அல்லாஹ்வின் தூதரே! (இதை) எனக்கு எழுதிக்கொடுங்கள்” என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘அபூஷாஹுக்கு எழுதிக்கொடுங்கள்” என்று உத்தரவிட்டார்கள். (அறிவிப்பாளர்களில் ஒருவரான வலீத் பின் முஸ்லிம் (ரஹ்) அவர்கள் கூறுகிறார்:) நான் அவ்ஸாயீ (ரஹ்) அவர்களிடம், ‘‘ ‘அல்லாஹ்வின் தூதரே! எனக்கு எழுதிக்கொடுங்கள்’ என்னும் அபூஷாஹ் (ரலி) அவர்களுடைய சொல் எதைக் குறிக்கிறது?” என்று கேட்டேன். அதற்கு அவர்கள், ‘‘அல்லாஹ்வின் தூதரிடமிருந்து அவர் கேட்ட இந்த உரையைத்தான் (எழுதிக்கொடுக்கச் சொன்னார்)” என்று பதிலளித்தார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2435,
			"arabicnumber": 2435,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவரின் கால்நடையில் அவரது அனுமதியின்றி எவரும் பால் கறக்க வேண்டாம். உங்களில் எவரும் அவரது சரக்குப் பெட்டகத்திற்கு ஒருவர் வந்து, அவரது உணவுக் கருவூலத்தை உடைத்து, அவரது உணவை எடுத்துச் சென்று விடுவதை விரும்புவாரா? கால்நடைகளு டைய மடிகள், கால்நடை உரிமையாளர் களின் உணவையே சேகரித்துப் பாதுகாத்து வைத்திருக்கின்றன. ஆகவே, எவரும் ஒருவரது கால்நடையில் அவரது அனுமதி யின்றிப் பால் கறக்க வேண்டாம்.8 இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2436,
			"arabicnumber": 2436,
			"text": "ஸைத் பின் காலித் அல்ஜுஹனி (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கண்டெடுக்கப்பட்ட பொருளைப் பற்றிக் கேட்டார். நபி (ஸல்) அவர்கள், ‘‘அதைப் பற்றி ஓராண்டுக் காலத்திற்கு அறிவிப்புச் செய்து கொண்டேயிரு. பிறகு, அதன் முடிச்சையும் பை(உறை)யையும் அடையாளம் தெரிந்து வைத்துக்கொள். பிறகு அதைச் செலவழித் துக் கொள். அதன் உரிமையாளர் வந்து (சரியான) அடையாளம் கூறிவிட்டால் அதை அவரிடம் திருப்பிச் செலுத்திவிடு” என்று கூறினார்கள். அந்த மனிதர், ‘‘அல்லாஹ்வின் தூதரே! வழிதவறி வந்த ஆட்டை என்ன செய்வது?” என்று கேட்டார். நபி (ஸல்) அவர்கள், ‘‘அதை எடுத்துக்கொள். ஏனெனில், அது உனக்குரியது; அல்லது உன் சகோதரருக்குரியது; அல்லது ஓநாய்க் குரியது” என்று பதிலளித்தார்கள். அந்த மனிதர், ‘‘அல்லாஹ்வின் தூதரே! வழி தவறி வந்த ஒட்டகத்தை என்ன செய்வது?” என்று கேட்டார். இதைச் செவியுற்றவுடன் நபி (ஸல்) அவர்கள் கோபமடைந்தார்கள். எந்த அளவுக்கென்றால் அவர்களின் கன்னங் கள் இரண்டும் சிவந்துவிட்டன; லிஅல்லது அவர்களின் முகம் சிவந்து விட்டது.லி பிறகு ‘‘உனக்கும் அதற்கும் என்ன தொடர்பு? அதன் உரிமையாளர் அதைச் சந்திக்கும்வரை (தன்னைப் பசியிலிருந்தும் தாகத்தி லிருந்தும் பாதுகாத்துக்கொள்ள) அதனுடன் அதன் குளம்பும் தண்ணீர்ப் பையும் இருக்கிறதே” என்று கூறினார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2437,
			"arabicnumber": 2437,
			"text": "சுவைத் பின் கஃபலா (ரஹ்) அவர்கள் கூறியதாவது: நான் சல்மான் பின் ரபீஆ அல்பாஹிலீ (ரலி) அவர்களுடனும் ஸைத் பின் ஸூஹான் (ரஹ்) அவர்களுடனும் ஒரு போரில் கலந்துகொண்டபோது சாட்டை ஒன்றைக் கண்(டு எடுத்துக்கொண்)டேன். (என் தோழர்கள்) இருவரும், ‘‘அதைப் போட்டு விடு” என்று கூறினார்கள். நான், ‘‘இல்லை. இதன் உரிமையாளரைக் கண்டால் (இதைக் கொடுத்துவிடுவேன்.) இல்லையென்றால் இதைப் பயன்படுத்திக் கொள்வேன்” என்று கூறினேன். நான் போரிலிருந்து திரும்பியபோது ஹஜ் செய்தேன். அப்போது மதீனா வழியாக நான் சென்றேன். அங்கு உபை பின் கஅப் (ரலி) அவர்களிடம் இது பற்றிக் கேட்டேன். அவர்கள் கூறினார்கள்: நான், நபி (ஸல்) அவர்களின் காலத்தில் நூறு பொற்காசுகள் இருந்த ஒரு பையைக் கண்டேன். அதை எடுத்துக்கொண்டு நபி (ஸல்) அவர்களிடம் சென்றேன். நபி (ஸல்) அவர்கள், ‘‘ஒரு வருட காலத்திற்கு அதைப் பற்றி அறிவிப்புச் செய்” என்று கூறினார்கள். ஒரு வருட காலம் அதைப் பற்றி அறிவிப்புச் செய்தேன். பிறகு மீண்டும் அவர்களிடம் சென்றேன். அப்போதும் அவர்கள், ‘‘ஒரு வருட காலத்திற்கு அறிவிப்புச் செய்” என்று கூறினார்கள். அவ்வாறே நான் ஒரு வருட காலத்திற்கு அறிவிப்புச் செய்தேன். பிறகு திரும்பவும் அவர்களிடம் வந்தேன். அப்போதும் அவர்கள், ‘‘ஒரு வருட காலத்திற்கு அறிவிப்புச் செய்” என்று கூறினார்கள். அவ்வாறே, நானும் ஒரு வருட காலத்திற்கு அதைப் பற்றி அறிவிப்புச் செய்தேன். நான்காவது முறையாக நபி (ஸல்) அவர்களிடம் சென்றேன். அப்போது அவர்கள், ‘‘அதன் (பையிலுள்ள பணத்தின்) எண்ணிக்கையையும், முடிச்சையும், பையையும் அடையாளம் அறிந்துகொள். அதன் உரிமையாளர் வந்தால் அதை அவரிடம் கொடுத்துவிடு. இல்லையென்றால் அதை நீ பயன்படுத்திக்கொள்” என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் உஸ்மான் பின் ஜபலா (ரஹ்) அவர்களது அறிவிப்பில் (பின்வருமாறு) காணப் படுகிறது: அறிவிப்பாளர் ஷுஅபா (ரஹ்) அவர்கள், ‘‘(இதை எனக்கு அறிவித்த) சலமா (ரஹ்) அவர்களைப் பின்னர் மக்காவில் சந்தித்தேன். அவர், யிமூன்றாண்டுகள் அறிவிக்க வேண்டுமா; ஓராண்டா’ எதை சுவைத் (ரஹ்) அவர்கள் குறிப்பிட்டார்கள் என்பது எனக்குத் தெரியவில்லை என்று கூறினார்” என்றார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2438,
			"arabicnumber": 2438,
			"text": "ஸைத் பின் காலித் (ரலி) அவர்கள் கூறியதாவது: கிராமவாசி ஒருவர் நபி (ஸல்) அவர்களிடம் கண்டெடுக்கப்பட்ட பொருளைப் பற்றிக் கேட்டார். நபி (ஸல்) அவர்கள், ‘‘ஒரு வருட காலத்திற்கு அறிவிப்புச் செய். அதன் பை(உறை)யையும் முடிச்சையும் பற்றி (அடையாளம்) தெரிவிக்கக் கூடியவர் எவரேனும் வந்தால் (அதை அவரிடம் ஒப்படைத்துவிடு). இல்லையென் றால் அதைச் செலவழித்துக்கொள்” என்று கூறினார்கள். பிறகு அவர் நபி (ஸல்) அவர்களிடம் வழி தவறி வந்த ஒட்டகத்தைப் பற்றிக் கேட்டார். இதைக் கேட்டு நபியவர்களின் முகம் நிறம் மாறிவிட்டது. ‘‘உனக்கும் அதற்கும் என்ன தொடர்பு? அதனுடன் அதன் தண்ணீர்ப் பையும் அதன் குளம் பும் உள்ளது. அது நீர் நிலைக்குச் செல்கிறது; (அங்கே தாகம் தணித்துக்கொள்கிறது.) மரத்திலிருந்து (இலை தழைகளைத்) தின்கிறது. அதை அதன் உரிமையாளர் அடைந்துகொள்ளும்வரை அதை விட்டுவிடு” என்று கூறினார்கள். அவர் நபி (ஸல்) அவர்களிடம் வழி தவறி வந்த ஆட்டைப் பற்றிக் கேட்டார். அதற்கு, ‘‘அது உனக்குரியது; அல்லது உன் சகோதரருக்குரியது; அல்லது ஓநாய்க்குரியது” என்று நபி (ஸல்) அவர்கள் கூறினார்கள்.9 அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2439,
			"arabicnumber": 2439,
			"text": "அபூபக்ர் (ரலி) அவர்கள் கூறியதாவது: நான் நடந்து சென்றுகொண்டிருந்தேன். என் முன்னே ஆடு மேய்ப்பவன் ஒருவனைக் கண்டேன். அவன் தன் ஆடுகளை ஓட்டிக்கொண்டு வந்து கொண்டிருந்தான். அவனிடம் நான், ‘‘நீ யாருடைய பணியாள்?” என்று கேட்டேன். அவன், ‘‘குறைஷியரில் இன்ன மனிதருடைய பணியாள்” என்று சொல்லி அவரது பெயரைக் கூறினான். நான் அந்த மனிதரை அடையாளம் புரிந்து கொண்டேன். அவனிடம் நான், ‘‘உன் ஆடுகளிடம் பால் இருக்கிறதா?” என்று கேட்டேன். அவன், ”ஆம்; (இருக்கிறது)” என்று பதிலளித்தான். எனக்காக நீ பால் கறந்து கொடுப்பாயா? என்று கேட்டேன். அவன் சரி என்றான். நான் (பால் கறந்து கொடுக்கும்படி) அவனுக்கு உத்தரவிட்டேன். அவன் ஆடுகளில் ஒன்றைப் பிடித்து அதன் தொடைகளுக்கிடையே காலை வைத்து அழுத்திக்கொண்டான். (பால் கறக்கத் தயாரானான்.) பிறகு நான், ஆட்டின் மடியை (அதில் படிந்திருக்கும்) புழுதி போக உதறும்படி கட்டளையிட்டேன். பிறகு அவன் தன் இரு கைகளையும் (தூய்மைப்படுத்திக்கொள்வதற்காக) உதறும்படிக் கட்டளையிட்டேன். ...றறஇப்படி உதறும்படி” என்று அபூபக்ர் (ரலி) அவர்கள் ஒரு கையை மற்றொரு கைமீது அடித்துக் காட்டினார்கள்... (அவ்வாறே, அவனும் கைகளைத் தூய்மைப்படுத்திக்கொண் டான்.) பிறகு சிறிதளவு பால் கறந்தான். நான் நபி (ஸல்) அவர்களுக்காக ஒரு தோல் பாத்திரத்தை எடுத்து, அதில் பாலை ஊற்றி அதன் வாயை ஒரு துண்டுத் துணியால் மூடினேன். பிறகு அதன் (பால் பாத்திரத்தின்) அடிப்பகுதி குளிர்ந்து போகும்வரை அதன் மீது தண்ணீர் ஊற்றினேன். பிறகு நபி (ஸல்) அவர்களிடம் சென்று, ‘‘அல்லாஹ்வின் தூதரே! அருந்துங்கள்” என்று கூறினேன். நான் திருப்தியடையும்வரை (அதை) அவர்கள் அருந்தி னார்கள்.10 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		}
	]
}