{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2440,
			"arabicnumber": 2440,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளர்கள் நரகத்தி லிருந்து தப்பி வரும்போது, சொர்க்கத் திற்கும் நரகத்திற்கும் இடையிலுள்ள ஒரு பாலத்தில் தடுத்து நிறுத்தப்படுவார்கள். அப்போது உலகில் (வாழ்ந்தபோது) அவர்களுக்கிடையே நடந்த அநீதிகளுக்கு ஒருவருக்கொருவர் கணக்குத் தீர்த்துக் கொள்வார்கள். இறுதியில், அவர்கள் பாவங்களிலிருந்து நீங்கித் தூய்மையாக்கப் பட்டுவிடும்போது சொர்க்கத்தில் நுழைய அவர்களுக்கு அனுமதி வழங்கப்படும். முஹம்மதின் உயிரைத் தன் கையில் வைத்திருப்பவன்மீது சத்தியமாக! அவர்கள் சொர்க்கத்தில் உள்ள தமது வசிப்பிடத்தை, உலகில் அவர்களுக்கிருந்த இல்லத்தைவிட எளிதாக அடையாளம் கண்டுகொள் வார்கள். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2441,
			"arabicnumber": 2441,
			"text": "ஸஃப்வான் பின் முஹ்ரிஸ் அல் மாஸினீ (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு உமர் (ரலி) அவர்களுடன், அவர்களுடைய கையைப் பிடித்தபடி சென்றுகொண்டிருந்தேன். அப்போது ஒரு மனிதர் குறுக்கிட்டு, ‘‘(மறுமை நாளில் அல்லாஹ்வுக்கும் அவனுடைய அடியார் களுக்குமிடையே நடைபெறும்) இரகசிய உரையாடல் பற்றி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து என்ன செவியுற் றீர்கள்?” என்று கேட்டார். அதற்கு இப்னு உமர் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் இறைநம்பிக்கை யாளரை தன் பக்கம் நெருங்கச்செய்து, அவர்மீது தன் திரையைப் போட்டு அவரை மறைத்துவிடுவான். பிறகு அவரை நோக்கி, ‘‘நீ செய்த இன்ன பாவம் உனக்கு நினைவிருக்கிறதா? நீ செய்த இன்ன பாவம் உனக்கு நினைவிருக்கிறதா?” என்று கேட்பான். அதற்கு அவர், யிஆம், என் இறைவா!› என்று கூறுவார். (இப்படி ஒவ்வொரு பாவமாக எடுத்துக்கூறி) அவர் (தாம் செய்த) எல்லாப் பாவங்களையும் ஒப்புக் கொள்ளச் செய்வான். அந்த இறைநம்பிக்கையாளர் யிநாம் இத்தோடு ஒழிந்தோம்’ என்று தம்மைப் பற்றிக் கருதிக்கொண்டிருக்கும்போது இறைவன், யிஇவற்றையெல்லாம் உலகில் நான் பிறருக்குத் தெரியாமல் மறைத்துவைத்திருந்தேன். இன்று உனக்கு அவற்றை மன்னித்துவிடுகிறேன்’ என்று கூறுவான். அப்போது அவரது நற்செயல்களின் பதிவேடு அவரிடம் கொடுக்கப்படும். இறைமறுப்பாளர்களையும் நயவஞ்சகர்களையும் நோக்கி சாட்சியாளர்கள், ‘‘இவர்கள்தான், தம் இறைவன்மீது பொய்யைப் புனைந்துரைத்தவர்கள். இதோ! இத்தகைய அக்கிரமக்காரர்கள்மீது இறைவனின் சாபம் உண்டாகும்” என்று கூறுவார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2442,
			"arabicnumber": 2442,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) கூறினார்கள்: ஒரு முஸ்லிம் மற்றொரு முஸ்லிமின் சகோதரர் ஆவார். அவருக்கு அநீதி யிழைக்கவும்மாட்டார்; அவரை (பிறரது அநீதிக்கு ஆளாகும்படி) கைவிட்டு விடவும்மாட்டார். எவர் தம் சகோதரரின் தேவையை நிறைவு செய்வதில் ஈடுபட்டி ருக்கிறாரோ அவரது தேவையை நிறைவு செய்வதில் அல்லாஹ்வும் ஈடுபட்டிருக்கி றான். எவர் ஒரு முஸ்லிமின் ஒரு துன்பத்தை நீக்குகிறாரோ அவரைவிட்டு அல்லாஹ்வும் மறுமை நாளின் துன்பங் களில் ஒரு துன்பத்தை நீக்குகிறான். எவர் ஒரு முஸ்லிமின் குறைகளை மறைக்கி றாரோ அவருடைய குறைகளை மறுமை நாளில் அல்லாஹ்வும் மறைக்கிறான். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2443,
			"arabicnumber": 2443,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உன் சகோதரன் அநீதியிழைத்தவனாக உள்ள நிலையிலும் அநீதியிழைக்கப் பட்டவனாக உள்ள நிலையிலும் அவனுக்கு நீ உதவி செய். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2444,
			"arabicnumber": 2444,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘உன் சகோதரன் அநீதி யிழைத்தவனாக உள்ள நிலையிலும் அநீதியிழைக்கப்பட்டவனாக உள்ள நிலையிலும் அவனுக்கு உதவி செய்” என்று கூறினார்கள். மக்கள், ‘‘அல்லாஹ் வின் தூதரே! அநீதியிழைக்கப்பட்டவனுக்கு நாங்கள் உதவி செய்வோம் (அது சரிதான்). அநீதியிழைத்தவனுக்கு நாங்கள் எப்படி உதவி செய்வோம்?” என்று கேட்டனர். நபி (ஸல்) அவர்கள், ‘‘அவனுடைய கைகளைப் பிடித்து (அநீதியிழைக்க விடாமல் தடுத்து)க்கொள்வாய் (இதுவே, நீ அவனுக்குச் செய்யும் உதவி)” என்று கூறினார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2445,
			"arabicnumber": 2445,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஏழு செயல்களைச் செய்யும்படி எங்களுக்குக் கட்டளை யிட்டார்கள்; ஏழு செயல்களிலிருந்து எங்களைத் தடுத்தார்கள். (கட்டளையிடப்பட்ட) அவையாவன: 1. நோயாளிகளை நலம் விசாரிப்பது. 2. ஜனாஸாவைப் பின்தொடர்ந்து செல்வது. 3. தும்மியவருக்கு அவர், ‘அல்ஹம்து லில்லாஹ்’ (‘அல்லாஹ்வுக்கே எல்லாப் புகழும்’) என்று சொன்னால், யியர்ஹமுக்கல்லாஹ்’ (அல்லாஹ் உமக்குக் கருணை புரிவானாக!) என்று பதிலளிப்பது. 4. சலாமுக்கு (முகமனுக்கு) பதிலுரைப்பது.5. அநீதியிழைக்கப்பட்டவருக்கு உதவுவது. 6. விருந்துக்காக அழைப்பவரின் அழைப்பை ஏற்றுக்கொள்வது. 7. சத்தியம் செய்தவரின் சத்தியத்தை நிறைவேற்ற உதவுவது.2 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: ஓர் இறைநம்பிக்கையாளர் மற்றோர் இறைநம்பிக்கையாளருக்கு (துணை நிற்கும் விஷயத்தில்) ஒரு கட்டடத்தைப் போன்றவர் ஆவார். அதன் ஒரு பகுதி மற்றொரு பகுதிக்கு வலுவூட்டுகிறது. (இப்படிக் கூறியபோது) நபி (ஸல்) அவர்கள் தம் கைவிரல்களை ஒன்றோ டொன்று கோத்துக்காட்டினார்கள். இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: அநீதி, மறுமை நாளில் பல இருள் களாகக் காட்சி தரும்.3 இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2448,
			"arabicnumber": 2448,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் முஆத் பின் ஜபல் (ரலி) அவர்களை யமன் நாட்டுக்கு அனுப்பிவைத்தார்கள். அப்போது ‘‘அநீதி யிழைக்கப்பட்டவரின் சாபத்திற்கு அஞ்சுங் கள். ஏனெனில், அதற்கும் அல்லாஹ் வுக்கும் இடையே எந்தத் திரையும் இல்லை” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2449,
			"arabicnumber": 2449,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவர், தம் சகோதரனுக்கு, அவனது மானம் தொடர்பாகவோ வேறு பொருள் தொடர்பாகவோ இழைத்த அநீதிக்கு இன்றே லிபொற்காசோ வெள்ளிக்காசோ இல்லாத நாள் வருவதற்கு முன்பேலி (மன்னிப்புப் பெற்று) விமோசனம் காணட்டும்!4 (ஏனெனில், மறுமை நாளில்) அவரிடம் நற்செயல் ஏதும் இருக்குமாயின் அவர் இழைத்த அநீதியின் அளவுக்கு அவரிடமிருந்து எடுத்துக்கொள்ளப்பட்டு (அநீதியிழைக்கப்பட்டவரின் கணக்கில் வரவு வைக்கப்பட்டு)விடும். அநீதி யிழைத்தவரிடம் நற்செயல்கள் எதுவும் இல்லையென்றால் அவரது தோழரின் (அநீதிக்குள்ளானவரின்) தீய செயல்கள் (அவர் கணக்கிலிருந்து) எடுக்கப்பட்டு அநீதியிழைத்தவரின் மீது சுமத்தப்பட்டுவிடும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: இதன் அறிவிப்பாளர்களில் ஒருவரான சயீத் அல்மக்புரீ (ரஹ்) அவர்களுக்கு ‘அல்மக்புரீ’ (கப்றைச் சார்ந்தவர்) எனப் பெயர் வரக் காரணம், அவர் கப்றுகளுக்கு (அடக்கத் தலங்களுக்கு) அருகிலேயே தங்குவார். அவர் யிபனூ லைஸ்’ குலத்தாரின் முன்னாள் அடிமை ஆவார். இவருடைய தந்தை அபூசயீதின் இயற்பெயர் யிகைசான்’ என்பதாகும். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2450,
			"arabicnumber": 2450,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: ‘‘ஒரு பெண் தன் கணவனிடமிருந்து ஏற்படும் பிணக்கை, அல்லது புறக்கணிப் பைப் பற்றி அஞ்சினால், அவ்விருவரும் (தம் உரிமைகளில் சிலவற்றைப் பரஸ்பரம் விட்டுக்கொடுத்து) தமக்கிடையே சமாதானம் செய்துகொள்வதில் தவறேதும் இல்லை” (4:128) என்ற குர்ஆனின் வசனத்தைப் பற்றி ஆயிஷா (ரலி) அவர்கள் பின்வருமாறு கூறினார்கள்: ஒரு மனிதர் தம் மனைவியிடம் அதிக நாட்டம் கொள்ளாமல் அவளைவிட்டுப் பிரிந்துவிட விரும்புகிறார். இந்நிலையில் மனைவி, ‘‘என் (தாம்பத்திய உரிமைகள்) விஷயத்தில் (நான் விட்டுக்கொடுத்து) நடந்துகொள்கிறேன் (என்னை மணவிலக் குச் செய்துவிட வேண்டாம்)” என்று கேட்டுக்கொள்கிறாள். இது தொடர்பாகவே இந்த இறைவசனம் அருளப்பட்டது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2451,
			"arabicnumber": 2451,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு பானம் கொண்டு வரப்பட்டது. அதிலிருந்து அவர்கள் அருந்தினார்கள். அப்போது அவர்களின் வலப் பக்கம் ஒரு சிறுவரும் இடப் பக்கம் வயது முதிர்ந்தவர்களும் இருந்தனர். நபி (ஸல்) அவர்கள் அந்தச் சிறுவரிடம், ‘‘(இந்தப் பானத்தை) இவர்களிடம் (வயது முதிர்ந்த வர்களிடம்) கொடுக்க நீ எனக்கு அனுமதி தருவாயா?” என்று கேட்டார்கள். அந்தச் சிறுவர், ‘‘மாட்டேன், இறைவன் மீதாணையாக! அல்லாஹ்வின் தூதரே! தங்களிடமிருந்து (எனக்குக் கிடைக்கக் கூடிய) என் பங்கை எவருக்கும் நான் விட்டுக்கொடுக்கமாட்டேன்” என்று கூறினார். எனவே, அல்லாஹ்வின் தூதர் அச்சிறுவரின் கரத்தில் அந்தப் பானத்தை வைத்தார்கள்.5 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2452,
			"arabicnumber": 2452,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: எவர் பிறரது நிலத்தில் ஒரு பகுதியை அநியாயமாகக் கைப்பற்றுகிறாரோ, அவரது கழுத்தில் (மறுமை நாளில்) அந்த நிலத்தி(ன் மேற்பகுதியி)லிருந்து ஏழு பூமிகள்வரை (செல்லும் பகுதி) மாலையாக மாட்டப்படும். இதை சயீத் பின் ஸைத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2453,
			"arabicnumber": 2453,
			"text": "அபூசலமா (ரஹ்) அவர்கள் கூறியதாவது: எனக்கும் வேறு சிலருக்கும் இடையே (ஒரு நிலம் சம்பந்தமாகத்) தகராறு இருந்து வந்தது. அதை நான் ஆயிஷா (ரலி) அவர்களிடம் கூறினேன். அப்போது என்னிடம் அவர்கள் சொன்னார்கள்: அபூசலமாவே! (பிறரது) நிலத்தை (எடுத்துக்கொள்வதைத்) தவிர்த்துக் கொள்ளுங்கள். ஏனெனில், நபி (ஸல்) அவர்கள், ‘‘எவர் ஓர்அங்குலம் அளவு நிலத்தை அநியாயமாகக் கைப்பற்றிக் கொள்கிறாரோ (மறுமையில்) அவர் கழுத்தில் அந்த நிலத்தி(ன் மேற்பகுதியி)லிருந்து ஏழு பூமிகள்வரை (செல்லும் பகுதி) மாலையாக மாட்டப்படும்” என்று கூறினார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2454,
			"arabicnumber": 2454,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: யார் (அடுத்தவரின்) ஒரு நிலத்திலிருந்து ஒரு பகுதியைத் தமக்கு உரிமையின்றி எடுத்துக்கொண்டாரோ அவர் மறுமை நாளில் ஏழு பூமிகளுக்குக் கீழே அமிழ்த் தப்படுவார். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: இதன் அறிவிப்பாளர்களில் ஒருவரான அப்துல்லாஹ் பின் அல்முபாரக் (ரஹ்) அவர்கள் குராசானில் தொகுத்த நூலில் இந்த ஹதீஸ் இடம்பெறவில்லை. மாறாக, (இராக்கிலுள்ள) யிபஸ்ரா’வில்தான் இந்த ஹதீஸை மாணவர்களுக்குச் சொல்லிக் கொடுத்தார்.6 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2455,
			"arabicnumber": 2455,
			"text": "ஜபலா பின் சுஹைம் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் இராக்வாசிகள் சிலருடன் மதீனாவில் இருந்தோம். எங்களுக்குப் பஞ்சம் ஏற்பட்டது. ஆகவே, இப்னு ஸுபைர் (ரலி) அவர்கள் எங்களுக்குப் பேரீச்சம்பழங்களைக் கொடுத்துவந்தார் கள். (அதை நாங்கள் கூடி அமர்ந்து உண்ணும்போது) இப்னு உமர் (ரலி) அவர்கள் எங்களைக் கடந்து செல்வார்கள். அப்போது, ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், இரண்டு பேரீச்சம் பழங்களை ஒரே தடவையில் எடுத்து உண்பதைத் தடை செய்தார்கள்; உங்களில் (அப்படிச் சேர்த்து உண்ண விரும்பும்) அந்த மனிதர் தம் சகோதரரிடம் அனுமதி கேட்டுக்கொண்டால் தவிர” என்று கூறுவார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2456,
			"arabicnumber": 2456,
			"text": "அபூமஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ‘அபூஷுஐப்’ எனப்படும் அன்சாரித் தோழர் ஒருவருக்கு இறைச்சி விற்கும் ஊழியர் ஒருவர் இருந்தார். அவரிடம் அபூஷுஐப் (ரலி) அவர்கள், ‘‘எனக்கு ஐந்து பேருக்கான உணவைத் தயார் செய். நான் ஐவரில் ஒருவராக நபி (ஸல்) அவர்களை அழைக்கக்கூடும்” என்று கூறினார். அவர் நபி (ஸல்) அவர்களின் முகத்தில் பசியைக் கண்டார். ஆகவே, அவர்களை விருந்துக்கு அழைத்தார்; நபி (ஸல்) அவர்களுடன் வந்தவர்களோடு விருந்துக்கு அழைக்கப் படாத ஒரு மனிதரும் சேர்ந்துகொண்டார். ஆகவே, நபி (ஸல்) அவர்கள் (அபூஷுஐப் (ரலி) அவர்களிடம்), ‘‘இவர் எங்களைப் பின்தொடர்ந்து வந்துவிட்டார். இவருக்கு நீங்கள் அனுமதியளிக்கிறீர்களா?” என்று கேட்டார்கள். அதற்கு அவர், ‘‘ஆம் (அனுமதியளிக்கிறேன்)” என்று பதில் கூறினார். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2457,
			"arabicnumber": 2457,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: அல்லாஹ்விடம் மனிதர்களிலேயே மிகவும் வெறுப்புக்குரியவன் கடுமையாக விதண்டாவாதம் புரிபவன்தான். இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2458,
			"arabicnumber": 2458,
			"text": "உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தமது அறையின் வாசலுக்கருகே (சிலர்) சச்சரவிட்டுக்கொண்டிருந்ததைச் செவியுற் றார்கள். உடனே அவர்களிடம் சென்று, ‘‘நான் ஒரு மனிதன்தான். வழக்காடுபவர்கள் என்னிடம் வருகிறார்கள். உங்களில் ஒருவர் மற்றவரைவிட வாக்கு சாதுரியம் மிக்கவராக இருக்கலாம். அவர்தான் உண்மையைப் பேசியுள்ளார் என்று கருதி, நான் அவருக்குச் சாதகமாகத் தீர்ப்பளித்து விடுகிறேன். அப்படி ஒரு முஸ்லிமின் உரிமையை வேறொருவருக்கு உரியதென்று (உண்மை தெரியாமல்) நான் தீர்ப்பளித்துவிட்டால், (அது தமக்கு உரிமையான பொருள் என அவர் எண்ணிவிட வேண்டாம். அவருக்கு) அது நரக நெருப்பின் ஒரு துண்டேயாகும். அவர் (விரும்பினால்) அதை எடுத்துக்கொள்ளட்டும்; அல்லது அதை (எடுத்துக்கொள்ளாமல்) விட்டு விடட்டும்” என்று கூறினார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2459,
			"arabicnumber": 2459,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நான்கு குணங்கள் யாரிடம் உள்ளனவோ அவர் நயவஞ்சகர் ஆவார். அல்லது அந்த நான்கு குணங்களில் ஒரு குணம் அவரிடம் குடிகொண்டிருந்தாலும் அவர் அதை விட்டுவிடும்வரை நயவஞ்சகத்தின் ஒரு குணம் அவரிடம் குடியிருக்கும். (அந்த நான்கு குணங்களாவன:) அவன் பேசும்போது பொய் பேசுவான்; வாக்க ளித்தால் மாறுசெய்வான்; ஒப்பந்தம் செய்தால் மோசடி செய்வான்; வழக்காடினால் நேர்மை தவறி நடந்துகொள்வான் (அவமதிப்பான்). இதை அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஹின்த் பின்த் உத்பா (ரலி) அவர்கள், நபி (ஸல்) அவர்களிடம் வந்து, ‘‘அல்லாஹ் வின் தூதரே! (என் கணவர்) அபூசுஃப்யான் மிகவும் கருமியாக இருக்கிறார். அவரது பணத்திலிருந்து (அவருக்குத் தெரியாமல் எடுத்து) எங்கள் பிள்ளைகளுக்கு உணவளிப்பதால் என்மீது குற்றம் ஏதும் உண்டா?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், ‘‘நியாயமான அளவுக்கு (உன் கணவனின் பணத்தை எடுத்து) அவர்களுக்கு உணவளிப்பதால் உன்மீது குற்றம் எதுவும் இல்லை” என்று பதிலளித்தார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2461,
			"arabicnumber": 2461,
			"text": "உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களிடம், ‘‘நீங்கள் எங்களை ஒரு சமூகத்தாரிடம் அனுப்பிவைக்கிறீர்கள்; நாங்களும் (உங்கள் கட்டளையை ஏற்று) அங்கு சென்று தங்குகிறோம்; (ஆனால்,) அவர்கள் எங்களை உபசரிக்க மறுக்கிறார்கள். அது குறித்து நீங்கள் என்ன கருதுகிறீர்கள்?” என்று கேட்டோம். அதற்கு நபி (ஸல்) அவர்கள், ‘‘நீங்கள் ஒரு சமூகத்தாரிடம் சென்றபோது விருந் தினர்களுக்குத் தேவையான வசதிகளை உங்களுக்குச் செய்து தர ஏற்பாடு செய்யப் பட்டால் அதை ஏற்றுக்கொள்ளுங்கள். அவர்கள் அப்படிச் செய்யவில்லை யென்றால், அவர்களிடமிருந்து விருந்தின ரின் உரிமையை (நீங்களாகவே) எடுத்துக் கொள்ளுங்கள்” என்று எங்களுக்குப் பதில் அளித்தார்கள்.7 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2462,
			"arabicnumber": 2462,
			"text": "உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ், தன் தூதர் (ஸல்) அவர் களை மரணிக்கச் செய்தபோது, அன்சாரி கள் யிபனூ சாயிதா’ சாவடியில் ஒன்றுகூடி விட்டார்கள். நான் அபூபக்ர் (ரலி) அவர் களை, ‘‘எங்களுடன் வாருங்கள்” என்று அழைத்தேன். நாங்கள் அன்சாரிகளிடம் பனூ சாயிதா (குலத்தாரின்) சாவடிக்குச் சென்றோம்.8 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2463,
			"arabicnumber": 2463,
			"text": "அப்துர் ரஹ்மான் பின் ஹுர் முஸ் அல்அஃரஜ் (ரஹ்) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘ஒருவர், தமது (வீட்டுச்) சுவரில், தம் அண்டை வீட்டுக்காரர் மரக்கட்டை (சாரம்) பதிப்பதைத் தடுக்க வேண்டாம்” என்று கூறினார்கள் என அபூஹுரைரா (ரலி) அவர்கள் அறிவித்தார்கள். பிறகு அபூஹுரைரா (ரலி) அவர்கள், ‘‘என்ன இது? (நபியவர்களின்) இ(ந்த உபதேசத்)தைப் புறக்கணிப்பவர்களாகவே உங்களை நான் பார்க்கின்றேனே! அல்லாஹ்வின் மீதாணையாக! (உங்களுக் குப் பிடிக்காவிட்டாலும்) இதை நான் உங்களுக்கு வலியுறுத்திக்கொண்டே இருப்பேன்” என்று கூறுவார்கள்.9 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2464,
			"arabicnumber": 2464,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நான் அபூதல்ஹா (ரலி) அவர்கள் வீட்டில் மக்களுக்கு மது பரிமாறுபவனாக இருந்தேன்.10 அந்த நாட்களில் பேரீச்சம் பழ மதுவையே அவர்கள் குடித்துவந்தனர். (மதுவைத் தடை செய்யும் இறைவசனம் அருளப்பட்டவுடன்,) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பொது அறிவிப்புச் செய்பவரை அழைத்து, ‘‘(மக்களே!) மது தடை செய்யப்பட்டுவிட்டது” என்று அறிவிக்கும்படி கட்டளையிட்டார்கள். அபூதல்ஹா (ரலி) அவர்கள் என்னிடம், ‘‘வெளியே சென்று இதை ஊற்றிவிடு” என்று கூறினார்கள். நான் வெளியே சென்று அதை (சாலையில்) ஊற்றிவிட்டேன். மதீனா நகரின் தெருக்களில் அது ஓடியது. மக்களில் சிலர், ‘‘மது தங்கள் வயிறுகளில் இருக்கும் நிலையில் பல பேர் கொல்லப் பட்டிருக்கிறார்களே! (அவர்களின் நிலை என்ன?)” என்று கேட்டார்கள். அப்போதுதான், ‘‘யார் இறைநம்பிக்கை கொண்டு நற்செயல்கள் புரிந்தார்களோ அவர்கள் (தடை செய்யப்பட்டதை முன்பு) உட்கொண்டதால் அவர்கள்மீது எந்தக் குற்றமும் இல்லை” (5:93) எனும் குர்ஆன் வசனம் அருளப்பட்டது.11 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2465,
			"arabicnumber": 2465,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: ‘‘நீங்கள் சாலைகளில் அமர்வதைத் தவிர்த்துவிடுங்கள்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். மக்கள், ‘‘எங்க ளுக்கு அங்கு அமர்வதைத் தவிர வேறு வழியில்லை. (பல விஷயங்களைப்) பேசிக் கொண்டு நாங்கள் அமரும் இடங்கள் அவைதான்” என்று கூறினார்கள். நபி (ஸல்) அவர்கள், ‘‘அந்த இடங்களுக்கு நீங்கள் வ(ந்து அம)ரும்போது, பாதைக்கு அதன் உரிமையைக் கொடுத்துவிடுங்கள்” என்று கூறினார்கள். மக்கள், ‘‘பாதையின் உரிமை என்ன?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், ‘‘(அந்நியப் பெண்களைப் பார்க்காமல்) பார்வையைத் தாழ்த்திக்கொள்வதும் (பாதையில் செல்வோருக்குச் சொல்லாலோ செயலாலோ) துன்பம் தராமலிருப்பதும், சலாமுக்குப் பதிலுரைப்பதும், நன்மை புரியும்படி கட்டளையிடுவதும், தீமையிலிருந்து தடுப்பதும் (அதன் உரிமைகள்) ஆகும்” என்று பதிலளித்தார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2466,
			"arabicnumber": 2466,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ‘‘ஒரு மனிதர் ஒரு பாதையில் சென்று கொண்டிருந்தபோது அவருக்குக் கடும் தாகம் ஏற்பட்டது. (வழியில்) அவர் ஒரு கிணற்றைக் கண்டு அதில் இறங்கினார். (அதிலிருந்து) தண்ணீர் குடித்தார். பிறகு வெளியே வந்தார். அப்போது, தன் எதிரே நாய் ஒன்று தாகத்தால் (தவித்து) ஈர மண்ணை (நக்கி) உண்டுகொண்டிருப்ப தைப் பார்த்தார். யிஎனக்கு ஏற்பட்டதைப் போன்ற அதே (கடுமையான) தாகம் இந்த நாய்க்கும் ஏற்பட்டுள்ளது போலும்’ என்று (தமது மனத்திற்குள்) கூறிக்கொண்டார். பிறகு கிணற்றில் இறங்கி, (தோலால் ஆன) தமது காலுறையைத் தண்ணீரால் நிரப்பி (மேலே கொண்டுவந்து) அந்த நாய்க்குப் புகட்டினார். அவருடைய இந்த நற்செயலை அல்லாஹ் அங்கீகரித்து அவருக்கு மன்னிப்பளித்தான்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். இதைச் செவியுற்ற மக்கள், ‘‘அல்லாஹ் வின் தூதரே! இந்த மிருகங்கள் விஷயத்திலுமா எங்களுக்குப் நற்பலன் உண்டு?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், ‘‘உயிர் பிராணிகள் ஒவ்வொன் றின் விஷயத்திலும் (அதற்குக் கருணை காட்டினால்) உங்களுக்குப் பிரதிபலன் கிடைக்கும்” என்று பதிலளித்தார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2467,
			"arabicnumber": 2467,
			"text": "உசாமா பின் ஸைத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவின் கோட்டைகளில் ஒரு கோட்டைமீது ஏறி நோட்டமிட்டார்கள். பிறகு, ‘‘நான் பார்ப் பதை நீங்கள் பார்க்கிறீர்களா? மழைத் துளிகள் விழுவதைப் போன்று, உங்கள் வீடுகள் நெடுகிலும் குழப்பங்கள் நிகழப் போவதை நான் பார்க்கிறேன்” என்று கூறினார்கள்.14 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களின் துணைவி யரில் இருவரைப் பற்றி உமர் (ரலி) அவர்களிடம் கேட்க வேண்டும் என்று நீண்ட நாட்களாகப் பேராவல் கொண்டிருந் தேன். ஏனெனில், அவ்விருவரைப் பற்றித்தான் அல்லாஹ் (குர்ஆனில்), ‘‘நீங்கள் இருவரும் அல்லாஹ்விடம் பாவமன்னிப்புக் கோரி மீண்டால் (அது உங்களுக்குச் சிறந்ததாகும்.) உங்கள் இருவரின் உள்ளங்களும் நேரிய வழியிலிருந்து (சற்றே) பிறழ்ந்துவிட்டி ருக்கின்ற”’ (66:4) என்று கூறியிருந்தான். (ஒருமுறை) உமர் (ரலி) அவர்களு டன் நான் ஹஜ் செய்தேன். (ஹஜ்ஜிலிருந்து திரும்பும்போது) உமர் (ரலி) அவர்கள் (இயற்கைக் கடனை நிறைவேற்றுவதற்காக) ஒதுங்கினார்கள். நானும் அவர்களுடன் தண்ணீர்க் குவளையை எடுத்துக்கொண்டு ஒதுங்கிச் சென்றேன். அவர்கள் இயற்கைக் கடனை முடித்துவிட்டுத் திரும்பி வந்தார்கள். நான் அவர்களின் கைகளில் குவளையிலிருந்த தண்ணீரை ஊற்றினேன். (அதில்) அவர்கள் அங்கத் தூய்மை செய்தார்கள். அப்போது நான், ‘‘இறை நம்பிக்கையாளர்களின் தலைவரே! நபி (ஸல்) அவர்களின் துணைவியரில் இருவரைக் குறித்து, ‘நீங்கள் இருவரும் அல்லாஹ்விடம் பாவமன்னிப்புக் கோரி மீண்டால் (அது உங்களுக்குச் சிறந்ததாகும்)› என்று வல்லமையும் மாண்பும் மிக்க இறைவன் கூறியுள்ளானே, அந்த இருவர் யார்?” என்று கேட்டேன். அதற்கு உமர் (ரலி) அவர்கள், ‘‘இப்னு அப்பாஸே! உங்களைக் கண்டு நான் வியப்படைகிறேன். (குர்ஆனின் விளக்கத்தில் பெரும் அறிஞரான உங்களுக்கு இது கூடவா தெரியாது?) ஆயிஷா (ரலி) அவர்களும் ஹஃப்ஸா (ரலி) அவர்களும்தான் அந்த இருவர்” என்று கூறினார்கள். பிறகு உமர் (ரலி) அவர்கள் நடந்த நிகழ்ச்சி முழுவதையும் கூறலானார்கள். அப்போது அவர்கள் கூறியதாவது: நான் அன்சாரியான என் பக்கத்து வீட்டுக்காரர் ஒருவருடன் பனூ உமய்யா பின் ஸைத் குலத்தாரின் குடியிருப்பில் வசித்து வந்தேன். அது மதீனாவின் மேட்டுப் பகுதியில் ஒரு குடியிருப்பாகும். நாங்கள் இருவரும் முறை வைத்துக்கொண்டு நபி (ஸல்) அவர்களிடம் தங்குவோம். அவர் ஒருநாள் நபி (ஸல்) அவர்களுடன் இருப்பார். நான் ஒருநாள் நபி (ஸல்) அவர்களுடன் இருப்பேன். நான் நபி (ஸல்) அவர்களுடன் இருக்கும்போது நபி (ஸல்) அவர்களுடைய அன்றைய நாளின் கட்டளைகளையும் போதனைகளையும் பிறவற்றையும் அவரிடம் தெரிவிப்பேன். அவர் நபி (ஸல்) அவர்களுடன் இருக்கும் போது இதே போன்று அவரும் எனக்குத் தெரிவிப்பார். குறைஷிக் குலத்தாராகிய நாங்கள் (மக்காவில் இருந்தபோது) பெண்களை மிகைத்துவிடுபவர்களாக இருந்துவந்தோம். (பெண்களை எங்கள் சொல்லுக்குக் கீழ்ப்படிந்தவர்களாக, எங்கள் கட்டுப் பாட்டில் வைத்திருந்தோம்.) நாங்கள் அன்சாரிகளிடம் (மதீனா நகருக்கு) வந்தபோது, பெண்கள் அவர்களை (ஆண்களை) மிஞ்சிவிடக்கூடியவர்களாக இருக்கக் கண்டோம். (பெண்கள் ஆண்களைக் கட்டுப்படுத்துபவர்களாக, தம்முடைய மனத்திற்குப் பிடிக்காதவற்றைக் கூறும்போது ஆண்களை எதிர்த்துப் பேசக்கூடியவர்களாக இருக்கக் கண்டோம்.) (இதைக் கண்ட) எங்களுடைய பெண்களும் அன்சாரிப் பெண்களின் வழக்கத்தைப் பின்பற்றத் தொடங்கினார்கள். (ஒருநாள்) நான் என் மனைவியிடம் (கோபத்துடன்) இரைந்து பேசினேன். அவர் என்னை எதிர்த்துப் பேசினார். அவர் என்னை எதிர்த்துப் பேசியதை நான் வெறுத்தேன். அதற்கு அவர், ‘‘நான் உம்மை எதிர்த்துப் பேசியதை நீங்கள் ஏன் வெறுக்கிறீர்கள்? அல்லாஹ்வின் மீதாணையாக! நபி (ஸல்) அவர்களின் துணைவியர்கள்கூட நபியவர்கள் பேச்சுக்கு மறுபேச்சு பேசுகிறார்கள். அவர்களில் சிலர் நபியவர்களிடம் பகல் முதல் இரவுவரை பேசுவதில்லை” என்று கூறினார். இதைக் கேட்டு நான் அதிர்ச்சியுற்றேன். ‘‘அவர்களில் இப்படிச் செய்தவர் பெரும் இழப்புக்கு ஆளாகிவிட்டார்” என்று கூறினேன். பிறகு உடை அணிந்துகொண்டு (என் மகள்) ஹஃப்ஸாவிடம் சென்றேன். ‘‘ஹஃப்ஸாவே! உங்களில் சிலர் அல்லாஹ் வின் தூதர் (ஸல்) அவர்களிடம் பகல் முதல் இரவுவரை கோபமாக இருக்கிறார் களாமே! (உண்மையா?)” என்று கேட்டேன். அதற்கு அவர், ‘‘ஆம்” என்று பதில ளித்தார். நான், ‘‘அப்படி இருப்பவர் நஷ்டப்பட்டு விட்டார்; இழப்புக்குள்ளாகிவிட்டார். இறைத் தூதருக்குக் கோபம் ஏற்பட்டால் அதனால் அல்லாஹ்வும் நம்மீது கோபமடைந்து நாம் அழிந்துபோய்விடு வோம் என்னும் அச்சம் அவருக்கில் லையா? அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அதிகமாக (தேவைகளை) நீ கேட்காதே. எந்த விஷயத்திலும் அவர் களை எதிர்த்துப் பேசாதே. அவர்களிடம் பேசாமல் இருக்காதே. உனக்கு (அவசியத் தேவையென்று) தோன்றியதை என்னிடம் கேள். உன் அண்டை வீட்டுக்காரர் (ஆயிஷா (ரலி)) உன்னை விட அழகு மிக்கவராகவும் அல்லாஹ்வின் தூதருக்குப் பிரியமானவராகவும் இருப்பதைவைத்து (அவர் நபியவர்களிடம் அதிக உரிமை எடுத்துக்கொண்டு ஊடலும் கோபமும் கொள்வதைப் பார்த்து) நீ ஏமாந்து போய் (அவரைப் போல் நடந்துகொண்டு) விடாதே” என்று நான் (அறிவுரை) கூறினேன். அந்தக் காலகட்டத்தில் நாங்கள், (சிரியா நாட்டில் வாழும்) யிஃகஸ்ஸான்’ குலத்தார் எங்கள் (மதீனா)மீது படையெடுப்பதற்காக, தங்கள் குதிரைகளுக்கு லாடம் அடித்து(த் தயாராகி)க்கொண்டிருக்கின்றனர் என்று ஒரு (வதந்தியான) செய்தியைப் பேசிக்கொண்டிருந்தோம். என் அன்சாரித் தோழர் தமது முறை வந்தபோது, நபி (ஸல்) அவர்களிடம் சென்று தங்கி, இஷா நேரத்தில் திரும்பி வந்தார். என் வீட்டுக் கதவை பலமாகத் தட்டி, ‘‘அவர் (உமர்) அங்கே இருக்கிறாரா?” என்று கேட்டார். நான் அச்சமுற்று அவரைப் பார்க்க வெளியே வந்தேன். அவர், ‘‘மிகப் பெரிய ஒரு சம்பவம் நிகழ்ந்துவிட்டது” என்று கூறினார். நான், ‘‘என்ன அது? ஃகஸ்ஸானியர்கள் (படையெடுத்து) வந்துவிட்டனரா?” என்று கேட்டேன். ‘‘இல்லை. அதை விடப் பெரிய, அதைவிட (அதிகக்) கவலைக்குரிய சம்பவம் நடந்துவிட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் துணைவியரை விவாகரத்து (தலாக்) செய்துவிட்டார்கள்” என்று கூறினார். நான், ‘‘(என் மகள்) ஹஃப்ஸா நஷ்டமடைந்து பெரும் இழப்புக்குள்ளாகி விட்டார். நான் இப்படி (விரைவில்) நடக்கத்தான்போகிறது என்று எண்ணி யிருந்தேன்” என்று கூறிவிட்டு, உடை அணிந்துகொண்டு புறப்பட்டேன். நபி (ஸல்) அவர்களுடன் ஃபஜ்ர் தொழுகை தொழுதேன். நபி (ஸல்) அவர்கள் (தொழுகை முடிந்தவுடன்) தமது மாடியறைக்குள் (சென்று) அங்கே தனியே இருந்தார்கள். நான் ஹஃப்ஸாவிடம் சென்றேன். அப்போது அவர் அழுது கொண்டிருந்தார். நான், ‘‘ஏன் அழுகிறாய்? நான் உன்னை எச்சரித்திருக்கவில்லையா? அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உங்களை விவாகரத்து (தலாக்) செய்து விட்டார்களா?” என்று கேட்டேன். அதற்கு அவர், ‘‘எனக்கொன்றும் தெரியாது. அவர்கள் அந்த மாடி அறையில்தான் இருக்கிறார்கள்” என்று கூறினார். நான் சொற்பொழிவு மேடைக்கு அருகில் சென்றேன். அதைச் சுற்றி ஒரு கூட்டத்தார் அமர்ந்திருந்தனர். அவர்களில் சிலர் (கேள்விப்பட்ட செய்தியை எண்ணி) அழுதுகொண்டிருந்தனர். அவர்களுடன் நான் சிறிது நேரம் அமர்ந்திருந்தேன். பிறகு நான் அந்த (துக்ககரமான) சூழ்நிலையைத் தாங்க முடியாமல் நபியவர்கள் இருந்த மாடி அறைக்கு அருகே சென்றேன். அங்கிருந்த, நபி (ஸல்) அவர்களின் கறுப்பு நிற அடிமையிடம், ‘‘உமருக்காக நபியவர்களிடம் (அறைக்குள் வர) அனுமதி கேள்” என்று சொன்னேன். அந்த அடிமை அறைக்கு உள்ளே சென்று நபி (ஸல்) அவர்களிடம் பேசிவிட்டுப் பிறகு வெளியே வந்து, ‘‘உங்களைப் பற்றி நபி (ஸல்) அவர்களிடம் கூறினேன். அவர்கள் மௌனமாக இருந்துவிட்டார்கள்” என்று கூறினார். ஆகவே, நான் திரும்பி வந்து சொற்பொழிவு மேடைக்கருகில் இருந்த கூட்டத்தாருடன் அமர்ந்துகொண்டேன். பின்னர் அங்கு நிலவிய (துக்ககரமான) சூழ்நிலையைத் தாங்க முடியாமல் மீண்டும் அந்த அடிமையிடம் சென்று, ‘‘உமருக்காக நீ (நபி (ஸல்) அவர்களின் அறைக்குள் வர) அனுமதி கேள்” என்று கூறினேன். அவர் (உள்ளே சென்று வந்து) முன்பு சொன்னதைப் போன்றே இப்போதும் கூறினார். நான் (மறுபடியும்) சொற்பொழிவு மேடைக்கருகில் இருந்த கூட்டத்தாருடன் அமர்ந்துகொண்டேன். மறுபடி அங்கு நான் கண்ட (கவலையான) சூழ்நிலையைத் தாங்க முடியாமல் அந்த அடிமையிடம் சென்று, ‘‘உமருக்காக அனுமதி கேள்” என்று கூறினேன். அப்போதும் அந்த அடிமை முன்போலவே கூறினார். நான் திரும்பிச் செல்ல இருந்தபோது அந்த அடிமை என்னை அழைத்து, ‘‘உங்களுக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அனுமதியளித்துவிட்டார்கள்” என்று கூறினார். உடனே, நான் நபி (ஸல்) அவர்களின் அறைக்குள் நுழைந்தேன். அப்போது அவர்கள் ஓர் ஈச்சம் பாயில் படுத்துக்கொண்டிருந்தார்கள். அவர்களுக்கும் அந்தப் பாய்க்குமிடையே மெத்தை எதுவும் இருக்கவில்லை. ஆகவே, அவர்களின் விலாவில் அந்த ஈச்சம் பாய் அடையாளம் பதித்திருந்தது. அவர்கள் ஈச்ச நார்கள் அடைத்த தோல் தலையணை ஒன்றின் மீது சாய்ந்து அமர்ந்துகொண்டிருந்தார்கள். அவர்களுக்கு நான் சலாம் கூறினேன். பிறகு நான் நின்றுகொண்டே, ‘‘தங்கள் துணைவியரை தாங்கள் மணவிலக்குச் செய்துவிட்டீர்களா?” என்று கேட்டேன். அவர்கள் தமது பார்வையை என் பக்கம் உயர்த்தி, ‘‘இல்லை” என்று கூறினார்கள். பிறகு, நான் நின்றுகொண்டே (அவர்களுடைய கோபத்தைக் குறைத்து) அவர்களை சகஜ நிலைக்குக் கொண்டுவர விரும்பி, பின்வருமாறு சொல்லத் தொடங்கினேன்: அல்லாஹ்வின் தூதரே! குறைஷியரான நாங்கள் பெண்களை எங்கள் அதிகாரத்திற்குள் வைத்திருந்தோம். பெண்கள் ஆதிக்கம் செலுத்தும் ஒரு கூட்டத்தாரிடம் (மதீனாவாசிகளிடம்) நாங்கள் வந்தபோது... (எங்கள் பெண்களும் அவர்களைப் பார்த்துக் கற்றுக்கொண்டு எங்களிடம் எதிர்த்துப் பேசத் தொடங்கி விட்டனர்)... என்று தொடங்கி, (முன்பு இப்னு அப்பாஸ் (ரலி) அவர்களிடம் என் மனைவி பற்றிச் சொன்னவை) எல்லாவற் றையும் கூறினேன். (அதைக் கேட்டு) நபி (ஸல்) அவர்கள் புன்னகைத்தார்கள். பிறகு நான் (நபி (ஸல்) அவர்களிடம்), ‘‘நான் ஹஃப்ஸாவிடம் சென்று, யிஉன் அண்டை வீட்டுக்காரர் (ஆயிஷா (ரலி) உன்னைவிட அழகானவராகவும் அல்லாஹ்வின் தூதருக்குப் பிரியமானவ ராகவும் இருப்பதை வைத்து (அவர் நபியவர்களிடம் அதிக உரிமை எடுத்துக் கொண்டு ஊடலும் கோபமும் கொள்வதைக் கண்டு) நீ ஏமாந்துபோய் (அவரைப் போல நடந்துகொண்டு)விடாதே’ என்று கூறி னேன்” எனச் சொன்னேன். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள் இன்னொரு முறை புன்னகைத்தார்கள். நபி (ஸல்) அவர்கள் புன்னகைத்ததைக் கண்ட நான் அமர்ந்துகொண்டேன். பிறகு என் பார்வையை உயர்த்தி அவர்களின் அறையை நோட்டமிட்டேன். அல்லாஹ்வின் மீதாணையாக! கண்ணைக் கவருகின்ற பொருள் எதையும் நான் அதில் காணவில்லை; மூன்றே மூன்று (பதனிடப்படாத) தோல்களைத் தவிர. அப்போது நான், ‘‘தங்கள் சமுதாயத்தாருக்கு உலகச் செல்வங்களைத் தாராளமாக வழங்கும்படி தாங்கள் அல்லாஹ்விடம் பிரார்த்தியுங்கள். ஏனெனில், பாரசீகர்களுக் கும் கிழக்கு ரோமானியருக்கும் லிஅவர்கள் அல்லாஹ்வை வழிபடாதவர்களாக இருந்தும்லி (உலகச் செல்வங்கள்) தாராளமாக வழங்கப்பட்டிருக்கின்றனவே” என்று கூறினேன். நபி (ஸல்) அவர்கள் (தலையணைமீது) சாய்ந்து உட்கார்ந்துகொண்டு, ‘‘கத்தாபின் புதல்வரே! நீங்கள் இன்னும் சந்தேகத்தில் இருக்கிறீர்களா? அவர்கள், தமக்குரிய இன்பங்கள் அனைத்தும் இந்த உலக வாழ்விலேயே (மறுமை வாழ்வுக்கு) முன்னதாகக் கொடுக்கப்பட்டுவிட்ட மக்கள் ஆவர்” என்று கூறினார்கள். உடனே நான், ‘‘அல்லாஹ்வின் தூதரே! (அவசரப் பட்டுக் கேட்டுவிட்ட) எனக்காகப் பாவ மன்னிப்புக் கோரிப் பிரார்த்தியுங்கள்” என்று கூறினேன். நபி (ஸல்) அவர்களின் அந்த இரக சியத்தை ஹஃப்ஸா (ரலி) அவர்கள் ஆயிஷா (ரலி) அவர்களிடம் சொல்லி பரப்பிய காரணத்தாலேயே நபி (ஸல்) அவர்கள் தம் துணைவியரிடமிருந்து விலகித் தனிமையில் இருக்கத் தொடங்கி னார்கள்.15 மேலும், ‘‘அவர்களிடம் ஒரு மாத காலத்திற்கு நான் செல்லமாட்டேன்” என்றும் கூறியிருந்தார்கள். அவர்களை அல்லாஹ் கண்டித்தபோது தம் துணைவியர்மீது அவர்களுக்கு ஏற்பட்ட கடும் வருத்தமே இவ்வாறு அவர்கள் சொல்லக் காரணமாகும். இருபத் தொன்பது நாட்கள் கழிந்தபொழுது, ஆரம்பமாக நபி (ஸல்) அவர்கள் ஆயிஷா (ரலி) அவர்களிடமே சென்றார்கள். அப்போது ஆயிஷா (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம், ‘‘எங்களிடம் ஒரு மாத காலத்திற்கு வரப்போவதில்லை என்று நீங்கள் சத்தியம் செய்திருந்தீர்களே! நாங்கள் இருபத்தொன்பது இரவுகளைத்தானே கழித்திருக்கின்றோம்? (ஒரு நாள் முன்னதாக வந்துவிட்டீர்களே!) அதை நான் ஒவ்வொரு நாளாக எண்ணிக்கொண்டே வருகின்றேனே!” என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், ‘‘மாதம் என்பது இருபத்தொன்பது நாட்களாகவும் இருக்கலாம்” என்று பதில் கூறினார்கள். அந்த மாதமும் இருபத்தொன்பது நாட்களாகவே இருந்தது. ஆயிஷா (ரலி) அவர்கள் கூறி னார்கள்: அப்போதுதான், (நபி (ஸல்) அவர் களுடன் வாழ்வது, அல்லது அவர்களின் மணபந்தத்திலிருந்து விலகிவிடுவது ஆகிய இரு விஷயங்களில்) நாங்கள் விரும்பியதைத் தேர்ந்தெடுத்துக் கொள்ளும்படி கட்டளையிடும் இறை வசனம் அருளப்பட்டது. ஆகவே, நபி (ஸல்) அவர்கள் தம் துணைவியரில் முதலாவதாக என்னிடம் தொடங்கி, ‘‘உனக்கு ஒரு விஷயத்தைச் சொல்கிறேன்: நீ உன் தாய் தந்தையரிடம் (அதற்காக) அனுமதி வாங்கும்வரை அவசரப்படத் தேவையில்லை” என்று கூறினார்கள். அதற்கு நான், ‘‘என் தாய் தந்தையர் தங்களைவிட்டுப் பிரிந்து வாழும்படி ஒருபோதும் சொல்லமாட்டார்கள் என்பது எனக்குத் தெரியும்” என்று கூறினேன். பிறகு நபி (ஸல்) அவர்கள், ‘‘நபியே! உங்கள் துணைவியரிடம் கூறிவிடுங்கள்: நீங்கள் உலக வாழ்வையும் அதன் அலங்காரத்தையும் விரும்புகிறீர்களென்றால் வாருங்கள். நான் ஏதேனும் சிலவற்றைக் கொடுத்து அழகிய முறையில் உங்களை அனுப்பிவிடுகிறேன். ஆனால், நீங்கள் அல்லாஹ்வையும் அவனுடைய தூதரை யும் மறுமையையும் விரும்புகிறீர்கள் என்றால் (அறிந்துகொள்ளுங்கள்:) உங்களில் நற்செயல் புரிபவர்களுக்கு அல்லாஹ் மகத்தான பிரதிபலனைத் தயார் செய்துவைத்துள்ளான் என்று அல்லாஹ் கூறுகின்றான். (33:28, 29) (ஆகவே, உங்கள் முடிவு என்ன?)” என்று கேட்டார்கள். நான், ‘‘இந்த விஷயத்திலா என் தாய் தந்தையரிடம் அனுமதி கேட்பேன்! நானோ அல்லாஹ்வையும் அவனுடைய தூதரையும் மறுமையையும்தான் விரும்புகிறேன்” என்று கூறினேன். பிறகு தம் துணைவியர் அனைவருக்கும் (யிதம்முடன் வாழ்வது, தம்மைவிட்டுப் பிரிந்துவிடுவது’ ஆகிய இரண்டில்) விரும்பியதைத் தேர்ந்தெடுத்துக்கொள்ள உரிமை வழங்கினார்கள். அவர்கள் அனைவருமே நான் சொன்னதைப் போன்றே சொன்னார்கள்.16 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2469,
			"arabicnumber": 2469,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் துணைவியரை ஒரு மாத காலத்திற்கு விலக்கிவைப்பதாக சத்தியம் செய்திருந் தார்கள். அவர்களின் பாதம் (நரம்பு) பிசகி விட்டிருந்தது; ஆகவே, அவர்கள் தமது உயரமான மாடியறை ஒன்றில் அமர்ந் திருந்தார்கள். அப்போது உமர் (ரலி) அவர்கள் வந்து, ‘‘தாங்கள் தங்கள் துணைவியரை விவாகரத்து (தலாக்) செய்து விட்டீர்களா?” என்று கேட்டார்கள். அதற்கு அவர்கள், ‘‘இல்லை; ஆனால், நான் அவர்களிடமிருந்து ஒரு மாத காலம் விலகியிருப்பதாக சத்தியம் செய்துள்ளேன்” என்று கூறினார்கள்; அவ்வாறே இருபத் தொன்பது நாட்கள் (அதில்) தங்கியிருந் தார்கள். பிறகு இறங்கி வந்து தம் துணைவி யரிடம் சென்றார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2470,
			"arabicnumber": 2470,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பள்ளிவாசலில் நுழைந்தார்கள். நானும் அவர்களைச் சந்திக்கப் பள்ளிவாசலில் நுழைந்தேன். ஒட்டகத்தை (மஸ்ஜிதுந் நபவீ) பள்ளி வாசலின் முன்பு, கற்கள் பதிக்கப்பட்டிருந்த நடைபாதையில் கட்டிவைத்தேன். (நபியவர்களிடம் சென்று), ‘‘இதோ, தங்கள் ஒட்டகம்” என்று கூறினேன். நபி (ஸல்) அவர்கள் வெளியே வந்து ஒட்டகத்தைச் சுற்றிப் பார்க்கத் தொடங்கினார்கள். ‘‘ஒட்டகமும் (அதன்) விலையும் உனக்கே” என்று கூறினார்கள்.18 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2471,
			"arabicnumber": 2471,
			"text": "ஹுதைஃபா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரு குலத்தாரின் குப்பை மேட்டிற்கு வந்து, (அங்கு) நின்று கொண்டு சிறுநீர் கழித்தார்கள். ‘‘அல்லது ‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்... சிறுநீர் கழித்ததை நான் பார்த்தேன்’ என்று ஹுதைஃபா (ரலி) அவர்கள் கூறினார்கள்” என்று அறிவிப் பாளர் அபூவாயில் (ரஹ்) அவர்கள் கூறுகிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2472,
			"arabicnumber": 2472,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாவது: ஒரு மனிதர் ஒரு சாலையில் நடந்து சென்றுகொண்டிருந்தபோது பாதையில் முட்கிளையொன்றைக் கண்டு அதை எடுத்து (எறிந்து)விட்டார். அவரது இந்த நற்செயலை அல்லாஹ் அங்கீகரித்து அவருக்கு (அவர் செய்த பாவங்களிலிருந்து) மன்னிப்பு வழங்கினான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2473,
			"arabicnumber": 2473,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: பொதுப்பாதை தொடர்பாக மக்களி டையே சர்ச்சை எழுந்தபோது, ஏழு முழங் கள் இடம் (பாதைக்காக) ஒதுக்க வேண்டு மென்று நபி (ஸல்) அவர்கள் தீர்ப்பளித் தார்கள்.19 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2474,
			"arabicnumber": 2474,
			"text": "அப்துல்லாஹ் பின் யஸீத் (ரலி) அவர்கள் கூறியதாவது: கொள்ளையடிப்பதற்கும் சித்திரவதை செய்வதற்கும் நபி (ஸல்) அவர்கள் தடை விதித்தார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2475,
			"arabicnumber": 2475,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: விபசாரி, விபசாரம் புரியும்போது இறைநம்பிக்கையாளனாக இருந்துகொண்டு அதைச் செய்யமாட்டான். (மது அருந்து பவன் மது அருந்தும்போது இறை நம்பிக்கையாளனாக இருந்துகொண்டு மது அருந்தமாட்டான். திருடன் திருடும்போது இறைநம்பிக்கையாளனாக இருந்துகொண்டு திருடமாட்டான். (மக்களின் மதிப்புமிக்க) செல்வத்தை, மக்கள் தம் விழிகளை உயர்த்திப் பார்த்துக் கொண்டிருக்கக் கொள்ளையடிப்பவன் இறைநம்பிக்கையாளனாக இருந்துகொண்டு கொள்ளையடிக்கமாட்டான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் இரு அறிவிப்புகளில் கொள்ளையடிப்பது தொடர்பான குறிப்பு இல்லை. அபூஅப்தில்லாஹ் (புகாரீ) கூறுகின் றேன்: இவற்றைச் செய்யும்போது இறை நம்பிக்கை(யின் ஒளி) அவனிடமிருந்து அகற்றப்படுகிறது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2476,
			"arabicnumber": 2476,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மர்யமின் குமாரர் (ஈசா) அவர்கள் நீதி செலுத்தும் நடுவராக உங்களிடையே இறங்குவார்கள். அவர்கள் வந்தவுடன் சிலுவையை உடைப்பார்கள்; பன்றியைக் கொல்வார்கள்; யிஜிஸ்யா’ (எனும் காப்பு) வரியை (ஏற்க) மறுப்பார்கள்; எவரும் பெற்றுக்கொள்ள முன்வராத அளவுக்குச் செல்வம் பெருகி வழியும். இவையெல்லாம் நடக்காத வரை உலக முடிவு (மறுமை) நாள் வராது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "சலமா பின் அல்அக்வஉ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், கைபர் போரின்போது நெருப்பு ஒன்று மூட்டப்பட்டுக் கொண்டிருப்பதைக் கண்டார்கள். அப்போது ‘‘எதற்காக இந்த நெருப்பு மூட்டப்படுகின்றது?” என்று கேட்டார்கள். ‘‘நாட்டுக் கழுதை இறைச்சியைச் சமைப்ப தற்காக” என்று மக்கள் பதிலளித்தார்கள். அதைக் கேட்ட நபி (ஸல்) அவர்கள், ‘‘பானைகளை உடைத்து அவற்றிலுள்ள (இறைச்சி, உணவு ஆகிய)வற்றைக் கொட்டிவிடுங்கள்” என்று உத்தரவிட் டார்கள். மக்கள், ‘‘இறைச்சிகளைக் கொட்டி விட்டு, பாத்திரங்களைக் கழுவிக்கொள்ள லாமா?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், ‘‘(அவ்வாறே) கழுவிக்கொள் ளுங்கள்” என்று கூறினார்கள். அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: (என் ஆசிரியர்) இஸ்மாயீல் பின் அபீஉவைஸ் (ரஹ்) அவர்கள், (யிநாட்டுக் கழுதை’ என்பதைக் குறிக்க ‘அல்ஹுமுருல் இன்சிய்யா’ என்பதற்குப் பதிலாக) ‘அல் ஹுமுருல் அனசிய்யா’ என்று குறிப் பிடுவார்கள். (பொருள் ஒன்றே; யிகாட்டுக் கழுதை’க்கு எதிர்ச்சொல்.) அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2478,
			"arabicnumber": 2478,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் கஅபாவைச் சுற்றிலும் முந்நூற்று அறுபது சிலைகள் இருக்க, மக்கா நகருக்குள் நுழைந்தார்கள். அப்போது அவர்கள், தமது கையிலிருந்த குச்சியால் அவற்றை குத்தி (அடிக்கத் தொடங்கி)னார்கள். ‘‘சத்தியம் வந்துவிட்டது; அசத்தியம் அழிந்துவிட்டது” (குர்ஆன்லி17: 81) எனும் வசனத்தை கூறத் தொடங்கினார்கள்.21 அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2479,
			"arabicnumber": 2479,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் எனது அலமாரி (நிலைப் பேழை) ஒன்றின் மீது (உயிரினங்களின்) உருவங்கள் (வரையப்பட்டு) இருந்த ஒரு திரைச் சீலையைத் தொங்கவிட்டிருந்தேன். அதை நபி (ஸல்) அவர்கள் கிழித்து விட்டார்கள். ஆகவே, அதிலிருந்து நான் இரு திண்டுகளைச் செய்துகொண்டேன். அவை வீட்டில் இருந்தன. அவற்றின் மீது நபி (ஸல்) அவர்கள் அமர்வார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2480,
			"arabicnumber": 2480,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தமது செல்வத்தைப் பாதுகாப்பதற்காகப் போராடும்போது கொல்லப்பட்டவர் (இறை வழியில்) உயிர்த் தியாகம் செய்தவர் (ஷஹீத்) ஆவார். இதை அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2481,
			"arabicnumber": 2481,
			"text": "அனஸ் (ரலி) அவர்கள் கூறி னார்கள்: நபி (ஸல்) அவர்கள் தம் துணைவியரில் ஒருவரிடம் (ஆயிஷா (ரலி) அவர்களிடம்) இருந்தார்கள். இறைநம்பிக்கையாளர்களின் அன்னையரில் (நபியவர்களின் துணைவியரில்) ஒருவர் பணிப்பெண் ஒருவரிடம் உணவுள்ள தட்டு ஒன்றைக் கொடுத்தனுப்பினார்கள். அவர் (ஆயிஷா) அந்தப் பணிப் பெண்ணின் கையைத் தட்டி தட்டை உடைத்துவிட்டார். நபி (ஸல்) அவர்கள் அந்த உடைந்த தட்டை ஒன்று சேர்த்து, உணவை அதில் எடுத்து வைத்து (தம் தோழர்களிடம்), ‘‘உண்ணுங்கள்” என்று கூறினார்கள். அவர்கள் உண்டு முடிக்கும்வரை தட்டையும் அதைக் கொண்டுவந்த பணிப் பெண்ணையும் அங்கேயே நிறுத்தி வைத்தார்கள். (அனைவரும் உண்டு முடித்த பின்பு) உடைந்த தட்டைத் தம்மிடமே வைத்துக்கொண்டு (உடையாத) நல்ல தட்டைக் கொடுத்து (அனுப்பி) விட்டார்கள்.22 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2482,
			"arabicnumber": 2482,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: பனூ இஸ்ராயீல் சமுதாயத்தைச் சேர்ந்த யிஜுரைஜ்’ என்று அழைக்கப்பட்டு வந்த ஒரு மனிதர் (தமது ஆசிரமத்தில்) தொழுதுகொண்டிருந்தார். அப்போது அவருடைய தாயார் வந்து அவரை அழைத்தார். அவருக்குப் பதிலளிக்க மறுத்துவிட்ட ஜுரைஜ், ‘‘நான் தாய்க்குப் பதிலளிப்பதா, அல்லது தொழுவதா?” என்று (மனத்திற்குள்) கூறிக்கொண்டார். பிறகு (மீண்டும்) அவருடைய தாயார் அவரிடம் வந்து, (தான் அழைத்தும் தன் மகன் பதிலளிக்கவில்லையே என்ற கோபத்தில்), ‘‘இறைவா! விபசாரிகளின் முகத்தில் விழிக் கச் செய்யாத வரை அவனுக்கு (ஜுரை ஜுக்கு) மரணத்தைத் தராதே” என்று கூறினார். (ஒருநாள்) ஜுரைஜ் தமது ஆசிரமத்தில் இருந்தார். அப்போது ஒரு பெண், ‘‘நான் ஜுரைஜை நிச்சயம் சோதனைக்குள்ளாக்கு வேன்” என்று சொல்லிக்கொண்டு, ஜுரைஜின் முன்பு வந்து அவருடன் (தகாத உறவு கொள்ள) அழைத்தாள். அவர் மறுத்துவிட்டார். ஆகவே, அவள் ஓர் இடையனிடம் சென்று, அவனுக்குத் தன்னைக் கொடுத் தாள். அதன் காரணமாக ஒரு (ஆண்) குழந்தையைப் பெற்றெடுத்தாள். பிறகு, ‘‘இவன் ஜுரைஜுக்குப் பிறந்தவன்” என்று கூறினாள். (இதைக் கேட்ட) மக்கள் (வெகுண்டெழுந்து) ஜுரைஜிடம் வந்து, அவரது ஆசிரமத்தை உடைத்து தகர்த்துவிட்டனர்; அவரை (அவரது அறையிலிருந்து) இறக்கி அவரை ஏசினர். ஜுரைஜ் அங்கத் தூய்மை செய்து தொழுதார். பிறகு அக்குழந்தையிடம் வந்து, ‘‘குழந்தையே! உன் தந்தை யார்?” என்று கேட்டார். அந்தக் குழந்தை (வாய் திறந்து), ‘‘(இன்ன) இடையன்” என்று கூறியது. இதைச் செவியுற்ற மக்கள், ‘‘உங்கள் ஆசிரமத்தைத் தங்கத்தால் நாங்கள் கட்டித்தருகிறோம்” என்று (ஜுரைஜிடம்) கூறினர். அதற்கு ஜுரைஜ், ‘‘இல்லை; களிமண்ணால் கட்டித்தந்தாலே போதும்” என்று கூறினார். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 43
			}
		}
	]
}