{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"48": "Mortgaging"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2508,
			"arabicnumber": 2508,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது போர்க் கவசத்தை தொலி நீக்கப் படாத கோதுமைக்குப் பகரமாக அடகு வைத்திருந்தார்கள். நான் நபி (ஸல்) அவர்களிடம் தொலி நீக்கப்படாத கோதுமை ரொட்டியையும் வாசனை நீங்கிய உருகிய கொழுப்பையும் கொண்டு சென்றேன். ‘‘முஹம்மதின் வீட்டாரிடம், அவர்கள் ஒன்பது வீட்டுக்காரர்களாக இருந்தும்கூட ஒரேயொரு ‘ஸாஉ’ (தானியம் அல்லது பேரீச்சம்பழம்) தவிர வேறெதுவும் காலையிலோ மாலையிலோ இருந்ததில்லை” என்று நபி (ஸல்) அவர்கள் கூற நான் கேட்டிருக்கிறேன்.3 அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2509,
			"arabicnumber": 2509,
			"text": "சுலைமான் பின் மஹ்ரான் அல்அஃமஷ் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்களிடம் கடனுக்கு அடைமானம் வைப்பது மற்றும் பிணையேற்பது குறித்துக் கருத்துப் பரிமாற்றம் செய்து கொண்டோம். அப்போது இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்கள், ‘‘நபி (ஸல்) அவர்கள் யூதர் ஒருவரிடமிருந்து ஒரு குறிப்பிட்ட தவணைக்கு (பிறகு பெற்றுக் கொள்வதாக) உணவுப் பொருளை வாங்கி னார்கள்; (அதற்காக) தமது (இரும்புக்) கவசத்தை அடைமானம் வைத்தார்கள் என ஆயிஷா (ரலி) அவர்கள் கூறியதாக எமக்கு அஸ்வத் (ரஹ்) அவர்கள் அறிவித்தார்கள்” என்று கூறினார்கள். அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2510,
			"arabicnumber": 2510,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: ஒருமுறை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘(கொடிய குற்றவாளியான) கஅப் பின் அல்அஷ்ரஃபைக் வீழ்த்து வதற்கு யார் (தயாராக) இருக்கிறார்கள்? ஏனெனில், அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் அவன் தொல்லை கொடுத்து விட்டான்” என்று கூறினார்கள். உடனே முஹம்மத் பின் மஸ்லமா (ரலி) அவர்கள், ‘‘நான் தயாராக இருக்கிறேன்” என்று கூறினார்கள். (பிறகு) அவர்கள் கஅப் பின் அல்அஷ்ரஃபிடம் சென்று, ‘‘ஒரு யிவஸ்க்’ அல்லது இரண்டு யிவஸ்க்’கள் (உணவுப் பொருளைக்) கடனாக எங்களுக்கு நீ தரவேண்டும் என்று விரும்புகிறோம்” எனக் கூறினார். அதற்கு அவன், ‘‘உங்கள் பெண்களை என்னிடம் அடகுவையுங்கள்” என்று கூறினான். அதற்கு முஹம்மத் பின் மஸ்லமா (ரலி) அவர்கள், ‘‘நீயோ அரபியரிலேயே அழகு மிக்கவன். உன்னிடம் எப்படி எங்கள் பெண்களை நாங்கள் அடகுவைக்க முடியும்?” என்று கேட்டார்கள். அதற்கு அவன், ‘‘உங்கள் குழந்தைகளை என்னிடம் அடகுவையுங்கள்” என்று கேட்டான். அதற்கு அவர், ‘‘நாங்கள் எப்படி எங்கள் குழந்தைகளை அடகுவைக்க முடியும்? (அப்படி அடகுவைத்தால்) யிஓரிரண்டு யிவஸ்க்’களுக்காக அடகுவைக்கப் பட்டவன்தானே இவன்’ என்று அவர்களை மற்றவர்கள் (இழிவாகப் பேசிப் பரிகாசமாக) ஏசுவார்களே! இது எங்களுக்கு அவமான மல்லவா? ஆயினும், நாங்கள் உன்னிடம் எங்கள் ஆயுதங்களை அடகுவைக்கி றோம்” என்று கூறினார்கள். (அவனும் அதற்குச் சம்மதிக்க) பின்னர் வருவதாக வாக்களித்துவிட்டுச் சென்றார்கள். (பிறகு ஆயுதத்துடன் வந்து அதை அடகுவைக்கின்ற சாக்கில்) அவனைக் கொன்றுவிட்டார்கள்; பிறகு அவர்கள் நபி (ஸல்) அவர்களிடம் வந்து செய்தியைத் தெரிவித்தார்கள்.4 அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2511,
			"arabicnumber": 2511,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அடைமானம் வைக்கப்பட்ட பிராணியை, அதற்காகும் (பராமரிப்புச்) செலவுக்குப் பிரதியாக (அடைமானம் வாங்கியவர்) வாகனமாகப் பயன்படுத்திக்கொள்ளலாம். பால் தரும் பிராணி அடைமானம் வைக் கப்பட்டிருப்பின், அதன் பாலை (அடை மானம் வாங்கியவர்) அருந்தலாம். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2512,
			"arabicnumber": 2512,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அடைமானம் வைக்கப்பட்ட பிராணிக் காகும் (பராமரிப்புச்) செலவுக்குப் பிரதியாக அதன் முதுகில் (அடைமானம் வாங்கிய வர்) பயணம் செய்யலாம். பால் கொடுக்கும் பிராணி அடகுவைக்கப்பட்டிருப்பின் அதற்காகும் (பராமரிப்புச்) செலவுக்குப் பிரதியாக அதன் பாலை (அடைமானம் வாங்கியவர்) அருந்தலாம். பயணம் செய்பவரும் பாலை அருந்துபவரும்தான் அதன் (பராமரிப்புச்) செலவை ஏற்க வேண்டும்.5 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2513,
			"arabicnumber": 2513,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு யூதரிடம் உணவுப் பொருளை வாங்கினார்கள்; (அதற்காக) தமது கவசத்தை அந்த யூதரிடம் அடைமானம் வைத்தார்கள். அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2514,
			"arabicnumber": 2514,
			"text": "இப்னு அபீமுளைக்கா (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களுக்கு (ஒரு வழக்கில் விளக்கம் கேட்டு) கடிதம் எழுதினேன். அவர்கள் எனக்கு, ‘‘நபி (ஸல்) அவர்கள் பிரதிவாதி (தன் மீதுள்ள வழக்கை மறுப்பதற்கு) சத்தியம் செய்ய வேண்டுமென்று தீர்ப்பளித்தார்கள்” எனப் பதில் எழுதினார்கள். அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2515,
			"arabicnumber": 2515,
			"text": "அபூவாயில் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், ‘‘யார் ஒரு பிரமாண (வாக்குமூல)த்தின்போது ஒரு செல்வத்தை அடைவதற் காகத் திட்டமிட்டுப் பொய்ச் சத்தியம் செய்கிறாரோ அவர், (மறுமையில்) தம்மீது அல்லாஹ் கோபம் கொண்டுள்ள நிலையில்தான் அவனைச் சந்திப்பார்” எனும் நபிமொழியைக் கூறினார்கள். பிறகு இதை உண்மைப்படுத்தும் வகையில் பின்வரும் வசனத்தை அல்லாஹ் அருளினான் என்று கூறினார்கள்: எவர் அல்லாஹ்வுடன் செய்துகொண்ட உடன்படிக்கையையும் தம் சத்தியங்களையும் அற்ப விலைக்கு விற்றுவிடுகிறார்களோ அவர்களுக்கு மறுமையில் எந்த நற்பேறுமில்லை. அவர்களுடன் அல்லாஹ் பேசமாட்டான்; மறுமை நாளில் அவர்களை (ஏறெடுத்துப்) பார்க்கவும்மாட்டான்; அவர்களைத் தூய்மைப்படுத்தவும்மாட்டான். மாறாக, அவர்களுக்கு வதைக்கும் வேதனைதான் கிடைக்கும். (3:77) பிறகு அஷ்அஸ் பின் கைஸ் (ரலி) அவர்கள் எங்களிடம் வந்து, ‘‘அபூஅப்திர் ரஹ்மான் (இப்னு மஸ்ஊத்) உங்களிடம் என்ன சொல்லிக்கொண்டிருக்கிறார்” என்று கேட்டார்கள். நாங்கள் அவர் (இப்னு மஸ்ஊத் (ரலி)) சொன்னதை எடுத்துரைத்தோம். அப்போது அஷ்அஸ் பின் கைஸ் (ரலி) அவர்கள் பின்வருமாறு கூறினார்கள்: அவர் சொன்னது உண்மைதான். என் விவகாரத்தில்தான் இவ்வசனம் (3:77) அருளப்பட்டது. எனக்கும் இன்னொரு மனிதருக்குமிடையே ஒரு கிணறு தொடர் பாகத் தகராறு இருந்துவந்தது; ஆகவே, நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (எங்கள்) வழக்கைக் கொண்டுசென்றோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘நீர் இரண்டு சாட்சிகளைக் கொண்டுவர வேண்டும்; அல்லது (பிரதிவாதியான) அவர் (குற்றத்தை மறுத்து) சத்தியம் செய்ய வேண்டும்” என்று கூறினார்கள். அதற்கு நான், ‘‘அப்படியென்றால் அவர் (பொய்) சத்தியம் செய்வாரே; (பொய்ச் சத்தியம் செய்கிறோமே என்று) கவலைப்படமாட்டாரே” என்று கூறினேன். அதற்கு நபி (ஸல்) அவர்கள் ‘‘எவர் ஒரு செல்வத்தை அடைந்துகொள்வதற்காகப் பொய்ச் சத்தியம் செய்கிறாரோ அவர் (மறுமையில்) தம்மீது அல்லாஹ் கோபம்கொண்டிருக் கும் நிலையில்தான் அவனைச் சந்திப்பார்” என்று கூறினார்கள். பிறகு, இந்த நபிவாக்கை உறுதிப்படுத்தி அல்லாஹ் ஒரு வசனத்தை அருளினான். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இந்த வசனத்தை (3:77) ஓதிக் காட்டி னார்கள். அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 8
			}
		}
	]
}