{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"50": "Makaatib"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2560,
			"arabicnumber": 2560,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (அடிமையாய் இருந்த) பரீரா (ரலி) அவர்கள் (தம் உரிமையாளர்களிடமிருந்து) எழுதி வாங்கிய விடுதலைப் பத்திரத்தின் தொகையைச் செலுத்துவதற்குத் தமக்கு உதவி செய்யும்படி கேட்டு என்னிடம் வந்தார். அவர் (தம் உரிமையாளர்களுக்கு விடுதலைத் தொகையாக) ஐந்து யிஊக்கி யாக்’களை3 ஐந்து ஆண்டுகளில், (ஆண் டுக்கு ஒரு ஊக்கியா வீதம்) தவணை முறையில் செலுத்த வேண்டியிருந்தது. ஆகவே, நான் லிஅவரை விடுதலை செய்ய ஆசைப்பட்டுலி ‘‘உன் உரிமையாளர் களுக்கு ஒரே தடவையில் முழுத் தொகையையும் நான் செலுத்திவிடுகிறேன்; அவர்கள் உன்னை விற்(பதற்கு சம்மதிப்)பார்களா? பின்னர் உன்னை நான் விடுதலையும் செய்துவிடுகிறேன். ஆனால், (உனது வாரிசுரிமை எனக்கே இருக்க வேண்டும்! என்ன சொல்கிறாய்?” என்று கேட்டேன். உடனே பரீரா (ரலி), தன் உரிமையாளர்களிடம் சென்று, எனது நிபந்தனையை அவர்கள்முன் வைத்தார். அதற்கு அவர்கள், ‘‘இதை நாங்கள் ஒப்புக்கொள்ள முடியாது. (உனது) வாரிசுரிமை (உன்னை விற்ற பின்பும்) எங்களுக்கே இருக்க வேண்டும்” என்று கூறிவிட்டனர். (இதை அறிந்த) நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று விஷயத்தைக் கூறினேன். அவர்கள் என்னிடம், ‘‘(அவரை) விலைக்கு வாங்கி விடுதலை செய்துவிடு. ஏனெனில், விடுதலை செய்தவருக்கே வாரிசுரிமை உரியதாகும்” என்று கூறினார்கள். பிறகு எழுந்து நின்று, ‘‘சில மனிதர் களுக்கு என்ன நேர்ந்தது? இறைச் சட்டத் தில் இல்லாத நிபந்தனைகளையெல்லாம் விதிக்கிறார்களே! ஒருவர் இறைச் சட்டத் தில் இல்லாத நிபந்தனைகளை விதித்தால் அது செல்லாது. அல்லாஹ்வின் நிபந் தனையே (ஏற்று) பின்பற்றத் தக்கதும் உறுதி மிக்கதும் ஆகும்” என்று கூறி னார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2561,
			"arabicnumber": 2561,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (அடிமையாய் இருந்த) பரீரா (ரலி), தாம் (தம் உரிமையாளர்களிடம்) எழுதி வாங்கிய விடுதலை ஆவணத்திற்கான தொகையைச் செலுத்துவதற்கு உதவி கோரி என்னிடம் வந்தார். (அப்போது) அவர் தமது விடுதலைத் தொகையில் சிறிதளவும் செலுத்தியிருக்கவில்லை. நான் அவரிடம், ‘‘நீ உன் உரிமையாளர்களிடம் திரும்பிச் சென்று, (அவர்களின் சம்மதத்தைக் கேள்.) நான் உன் சார்பாக உன் விடுதலைப் பத்திரத்தின் தொகையைச் செலுத்தி விடுகிறேன். ஆனால், உன் வாரிசுரிமை எனக்குத்தான் இருக்க வேண்டும். இதை அவர்கள் விரும்பினால், அவ்வாறு நான் செய்கிறேன்” என்று கூறினேன். அவ்வாறே, பரீரா (ரலி) தன் உரிமை யாளர்களிடம் கேட்க, அவர்கள் மறுத்து, ‘‘உன்(னை வாங்கி விடுதலை செய்வதன்) மூலம் அவர் (ஆயிஷா (ரலி) அவர்கள்) இறைவனிடம் நன்மையைப் பெற விரும்பு வாராயின் அவ்வாறே செய்யட்டும். ஆனால், உனது வாரிசுரிமை எங்களுக்கே உரியதாக இருக்கும்” என்று கூறிவிட்டார் கள். இதை நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கூறினேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘நீ அவரை வாங்கி விடுதலை செய்துவிடு, ஏனெனில், விடுதலை செய்பவருக்கே வாரிசுரிமை உரியதாகும்” என்று கூறி னார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எழுந்து, ‘‘மக்களில் சிலருக்கு என்னவாயிற்று? இறைச் சட்டத்தில் இல்லாத நிபந்தனைகளை விதிக்கின்றார் களே! இறைச் சட்டத்தில் இல்லாத ஒரு நிபந்தனையை ஒருவர் விதித்தால், அது செல்லாது; அவர் நூறுமுறை நிபந்தனை விதித்தாலும் சரியே! அல்லாஹ்வின் நிபந்தனையே (ஏற்று) பின்பற்றத் தக்கதும் உறுதி வாய்ந்ததும் ஆகும்” என்று கூறினார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2562,
			"arabicnumber": 2562,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்கள், விடுதலை செய்வதற்காக ஓர் அடிமைப் பெண்ணை விலைக்கு வாங்க விரும்பினார்கள். அப்போது அப்பெண்ணின் உரிமையாளர்கள், ‘அவரது வாரிசுரிமை எங்களுக்கே உரியது’ என்னும் நிபந்தனையின் பேரில்தான் நாங்கள் அவரை விற்போம் என்று கூறினார்கள். (இதை அறிந்த) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘அவர்களுடைய இந்த நிபந்தனை உனக்குத் தடை ஆகாது. ஏனெனில், விடுதலை செய்தவருக்கே (விடுதலை செய்யப்பட்ட அடிமையின்) வாரிசுரிமை உரியதாகும்” என்று கூறி னார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2563,
			"arabicnumber": 2563,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: பரீரா (ரலி) அவர்கள் (என்னிடம்) வந்து, ‘‘நான் என் உரிமையாளர்களிடம் (விடுதலைத் தொகையாக) ஒவ்வோர் ஆண்டும் ஓர் யிஊக்கியா’ வீதம் ஒன்பது யிஊக்கியா’க்களைச் செலுத்திவிட வேண்டும் எனும் நிபந்தனையின் பேரில் விடுதலைப் பத்திரம் எழுதி வாங்கியுள்ளேன்; ஆகவே, நீங்கள் எனக்கு உதவுங்கள்” என்று கேட்டார்.5 நான், ‘‘உன் உரிமையாளர்களுக்கு அந்த யிஊக்கியாக்’களை ஒரே தடவையில் கொடுத்து உன்னை விடுதலை செய்துவிடுவதை அவர்கள் விரும்பினால் அவ்வாறே செய்கிறேன். ஆனால், உன் வாரிசுரிமை எனக்குத்தான் இருக்க வேண்டும்” என்று கூறினேன். எனவே, பரீரா (ரலி) தன் உரிமையாளர்களிடம் சென்றார். (அவர்களிடம் நான் சொன்னதைக் கூற) அவர்கள் அவரிடம் அதற்கு மறுப்புத் தெரிவித்துவிட்டார்கள். பிறகு பரீரா (என்னிடம் வந்து), ‘‘அவர்களிடம் உங்கள் விருப்பத்தை முன்வைத் தேன். ‘(என்) வாரிசுரிமை தங்களுக்குக் கிடைத்தால் தவிர அதற்கு ஒப்புக் கொள்ள முடியாது’ என்று அவர்கள் மறுத்துவிட்டனர்” என்று கூறினார். இதைச் செவியுற்ற அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அது பற்றி) என்னைக் கேட்க, நான் அவர்களுக்கு விவரத்தைச் சொன்னேன். பரீராவை வாங்கி விடுதலை செய்துவிடு. அவருடைய வாரிசுரிமை அவர்களுக்கே உரியது என்று நிபந்தனை விதித்துவிடு (பின்னர் பார்த்துக்கொள்வோம்.) ஏனெனில், சட்டப்படி விடுதலை செய்ப வருக்கே வாரிசுரிமை உரியதாகும்” என்று கூறினார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களிடையே எழுந்து நின்று, அல்லாஹ்வைப் போற்றிப் புகழ்ந்தார்கள். பிறகு கூறினார்கள்: இறைவாழ்த்துக்குப்பின்! உங்களில் சில மனிதர்களுக்கு என்ன நேர்ந்தது? இறைச் சட்டத்தில் இல்லாத நிபந்தனைகளை விதிக்கின்றார்களே! இறைச் சட்டத்தில் இல்லாத எந்த ஒரு நிபந்தனையும் செல்லாது; நூறு முறை நிபந்தனை விதித்தாலும் சரியே! அல்லாஹ்வின் தீர்ப்பே (ஏற்று) பின்பற்றத் தக்கதாகும். அல்லாஹ்வின் நிபந்தனையே உறுதி வாய்ந்ததாகும். உங்களில் சில மனிதர்களுக்கு என்ன நேர்ந்தது? அவர்களில் ஒருவர் ‘‘இன்னாரே! (என் அடிமையை விலைக்கு வாங்கி) விடுதலை செய்துவிடு. ஆனால், வாரிசுரிமை எனக்கே உரியது” என்று கூறுகிறாரே! (உண்மையில்) விடுதலை செய்பவருக்கே வாரிசுரிமை உரியதாகும்” என்று கூறினார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2564,
			"arabicnumber": 2564,
			"text": "அம்ரா பின்த் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: பரீரா (ரலி) அவர்கள், இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்களிடம் (தமது விடுதலைப் பத்திரத் தொகையைச் செலுத்தும் விஷயத்தில்) உதவி கேட்டு வந்தார். அவரிடம் ஆயிஷா (ரலி) அவர்கள், ‘‘நான் உன் உரிமையாளர்களுக்கு உன் விலையை ஒரே தடவையில் கொடுத்துவிடுகிறேன். பிறகு உன்னை விடுதலை செய்துவிடுகிறேன். இதை அவர்கள் விரும்பினால் அவ்வாறே செய்(யத் தயாராக இருக்)கி றேன்” என்று கூறினார்கள். (அன்னை) ஆயிஷா (ரலி) அவர்களின் இந்த விருப்பத்தை பரீரா (ரலி) தம் உரிமையாளர்களிடம் தெரிவித்தார். அதற்கு அவர்கள், ‘‘(உனது) வாரிசுரிமை எங்களுக்கே உரியதாக இருந்தால் தவிர, நாங்கள் இதற்குச் சம்மதிக்கமாட்டோம்” என்று கூறிவிட்டனர். ஆயிஷா (ரலி) அவர்கள் இந்தச் செய்தியை அல்லாஹ் வின் தூதர் (ஸல்) அவர்களிடம் கூறினார்கள். அதற்கு அவர்கள், ‘‘நீ அவரை விலைக்கு வாங்கி விடுதலை செய்துவிடு. ஏனெனில், விடுதலை செய்தவருக்கே வாரிசுரிமை உரியதாகும்” என்று கூறி னார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2565,
			"arabicnumber": 2565,
			"text": "அய்மன் பின் உம்மி அய்மன் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஆயிஷா (ரலி) அவர்களிடம் சென்று, ‘‘நான் உத்பா பின் அபீலஹபுக்கு அடிமையாக இருந்தேன். அவர் இறந்துவிட்டார். பிறகு அவருடைய மக்கள் எனக்கு உரிமையாளர்கள் ஆனார்கள். அவர்கள் என்னை அபூஅம்ருடைய மகனுக்கு விற்றார்கள். ஆனால், உத்பாவின் மக்கள், எனது வாரிசுரிமை தமக்கே கிடைக்க வேண்டும் என்று நிபந்தனை விதித்தார்கள்” என்று கூறினேன். அதற்கு ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: விடுதலைப் பத்திரம் எழுதிக் கொடுக்கப்பட்ட பரீரா என்னிடம் வந்திருந்தார். ‘‘என்னை விலைக்கு வாங்கி விடுதலை செய்துவிடுங்கள்” என்று கேட்டுக்கொண்டார். நான், ‘‘சரி” என்று சொன்னேன். அதற்கு அவர், ‘‘என் உரிமையாளர்கள் தங்களுக்கே (எனது) வாரிசுரிமை வேண்டும் என்று நிபந்தனை விதிக்காமல் என்னை விற்கமாட்டார்கள்” என்று கூறினார். அதற்கு நான், ‘‘அப்படியென்றால் எனக்கு அது தேவையற்றது” என்று கூறினேன். நபி (ஸல்) அவர்கள் இதைச் செவியுற்றார்கள்; அல்லது இந்தச் செய்தி அவர்களுக்கு எட்டியது. உடனே, நபி (ஸல்) அவர்கள் என்னிடம் இது பற்றிக் கேட்க, நான் பரீரா என்னிடம் கூறியதைச் சொன்னேன். அதற்கு நபி (ஸல்) அவர்கள், ‘‘அவரை விலைக்கு வாங்கி விடுதலை செய்துவிடு. அவருடைய உரிமையாளர்கள் தாங்கள் விரும்பியவற்றையெல்லாம் நிபந்தனையிட்டுக்கொள்ளட்டும் (அது செல்லப் போவதில்லை)” என்று கூறினார்கள். ஆகவே, நான் பரீராவை விலைக்கு வாங்கி விடுதலை செய்துவிட்டேன். (அப்போதும்) அவருடைய உரிமையாளர்கள் (அவரது) வாரிசுரிமை தங்களுக்கே உரியது என்று நிபந்தனை விதித்தார்கள். (இதை அறிந்த) நபி (ஸல்) அவர்கள், ‘‘விடுதலை செய்தவருக்கே வாரிசுரிமை உரியதாகும்; அவர்கள் (அடிமையின் உரிமையாளர்கள்) நூறு முறை நிபந்தனை விதித்தாலும் சரியே” என்று கூறினார்கள். அத்தியாயம் : 50",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 6
			}
		}
	]
}