{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3776,
			"arabicnumber": 3776,
			"text": "ஃகைலான் பின் ஜரீர் (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் (ரலி) அவர்களிடம், “(அவ்ஸ் மற்றும் கஸ்ரஜ் குலத்தாரான உங்களுக்கு) “அன்சார்' (உதவியாளர்கள்) எனும் பெயர் வந்ததைப் பற்றி எனக்குக் கூறுங்கள். உங்களுக்கு அந்தப் பெயர் (குர்ஆனுக்கு முன்பே) சூட்டப்பட்டி ருந்ததா? அல்லது அல்லாஹ் உங்களுக்கு அந்தப் பெயரைச் சூட்டினானா?” என்று கேட்டேன். அவர்கள், “அல்லாஹ்தான் எங்களுக்கு (“அன்சார்' என்று திருக்குர்ஆன் 9:100ஆம் வசனத்தில்) பெயர் சூட்டினான். (பஸ்ரா வில்) நாங்கள் அனஸ் (ரலி) அவர்களிடம் (வந்து) சென்றுகொண்டிருந்தோம். அப்போது அவர்கள் அன்சாரிகளின் சிறப்புகளையும் அவர்களுடைய (தியாக) நிகழ்ச்சிகளையும் எங்களுக்கு எடுத்துரைப் பார்கள். என்னை அல்லது “அஸ்த்' குலத்தைச் சேர்ந்த ஒரு மனிதரை நோக்கி, “உன் குலத்தார் இன்னின்ன நாளில் இன்னின்னவாறு செய்தார்கள்” என்று சொல்வார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3777,
			"arabicnumber": 3777,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: “புஆஸ்' போர் நாள், தன் தூதருக்காக அல்லாஹ் (சாதகமான சூழ்நிலையை உருவாக்கும் வகையில்) முன்கூட்டியே நிகழச்செய்த நாளாக அமைந்தது . (அந்தப் போரின் காரணத்தால்) மதீனாவாசிகளின் கூட்டமைப்பு (குலைந்து) பிளவுபட்டிருந்த நிலையிலும் அவர்களில் முக்கியப் பிரமுகர்கள் கொல்லப்பட்டும் காயமுற்றும் இருந்த நிலையிலும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அங்கு) வந்தார்கள். ஆகவே, மக்கள் இஸ்லாத்தை ஏற்க (ஏதுவான சூழ்நிலையை உருவாக்குவதற்காக) அல்லாஹ்தான், தன் தூதர் (ஸல்) அவர்களுக்குச் சாதகமாக அந்த நாளை முன்கூட்டியே நிகழச்செய்தான்.2 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3778,
			"arabicnumber": 3778,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: மக்கா வெற்றி கொள்ளப்பட்ட ஆண்டில் (ஹுனைன் போரில் கிடைத்த செல்வங்களை) நபி (ஸல்) அவர்கள் (அன்சாரிகளுக்கு வழங்காமல், புதிதாக இஸ்லாத்தைத் தழுவியிருந்த) மக்கா குறைஷியருக்குக் கொடுத்தபோது அன்சாரிகள், “அல்லாஹ்வின் மீதாணை யாக! உண்மையில், இது வியப்பாகத்தான் இருக்கிறது. நம்முடைய வாட்களில் குறைஷியரின் இரத்தம் சொட்டிக்கொண்டி ருக்க, நமக்குச் சேர வேண்டிய போர்ச் செல்வங்கள் அவர்களுக்கல்லவா திருப்பிக் கொடுக்கப்படுகின்றன?” என்று பேசிக்கொண்டார்கள்.3 அவர்கள் இப்படிப் பேசிக்கொண்டது நபி (ஸல்) அவர்களுக்கு எட்டியது. உடனே அன்சாரிகளை அவர்கள் அழைத்து, “உங்களைப் பற்றி எனக்கெட்டிய செய்தி என்ன?” என்று கேட்டார்கள். அவர்கள் (நபித்தோழர்கள்) பொய் சொல்லாதவர்களாய் இருந்தனர்- ஆகவே அவர்கள், “(உண்மையில் நாங்கள் பேசிக்கொண்டதும்) உங்களுக்கு எட்டியதேதான்” என்று பதிலளித்தார்கள். நபி (ஸல்) அவர்கள், “மக்கள் போர்ச் செல்வங்களைப் பெற்றுக்கொண்டு தம் வீடுகளுக்குத் திரும்பிச் செல்ல, நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுட னேயே உங்கள் வீடுகளுக்குத் திரும்பிச் செல்வதை நீங்கள் விரும்பவில்லையா? அன்சாரிகள் ஒரு பள்ளத்தாக்கிலோ ஒரு கணவாயிலோ நடந்துசென்றால் அவர்கள் செல்கின்ற பள்ளத்தாக்கிலோ கண வாயிலோதான் நானும் நடந்துசெல்வேன்” என்று சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3779,
			"arabicnumber": 3779,
			"text": "அபுல்காசிம் (நபி-ஸல்) அவர்கள் கூறினார்கள்: அன்சாரிகள் ஒரு பள்ளத்தாக்கிலோ ஒரு கணவாயிலோ நடந்துசென்றால் அன்சாரிகள் நடந்துசெல்லும் பள்ளத் தாக்கில்தான் நானும் நடந்துசெல்வேன். ஹிஜ்ரத் மட்டும் நடைபெறாமல் இருந்திருந்தால் நான் அன்சாரிகளில் ஒருவனாக இருந்திருப்பேன். இதன் அறிவிப்பாளர்களில் ஒருவர் கூறுகிறார்: இதை அறிவித்த அபூஹுரைரா (ரலி) அவர்கள், “நபி (ஸல்) அவர்கள் மிகச் சரியாகவே இப்படிக் கூறியுள்ளார்கள் (என்று கூறிவிட்டு) - என் தந்தையும் என் தாயும் அவர்களுக்கு அர்ப்பணமாகட்டும்- “(நபியவர்கள் இப்படிச் சொன்னதற்குக் காரணம்) அன்சாரிகள் நபி (ஸல்) அவர்களுக்குப் புகலிடம் அளித்து அவர்களுக்கு உதவி செய்தார்கள்' என்றோ... (இவ்விரு வாக்கியங்களுடன் சேர்த்து) வேறொரு வாக்கியத்தையோ சொன்னார்கள்.6 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3780,
			"arabicnumber": 3780,
			"text": "இப்ராஹீம் பின் அப்திர் ரஹ்மான் பின் அவ்ஃப் (ரஹ்) அவர்கள் கூறியதாவது: (முஹாஜிர்களான) நாங்கள் மதீனாவுக்கு வந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என் தந்தை) அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்களுக்கும் சஅத் பின் அர்ரபீஉ (ரலி-என்னும் அன்சாரித் தோழர்) அவர்களுக்கும் இடையே சகோதரத்துவ உறவை ஏற்படுத்தினார்கள். (என் தந்தை) அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்களிடம் சஅத் பின் அர்ரபீஉ (ரலி) அவர்கள், “நான் அன்சாரிகளில் அதிகச் செல்வம் உடையவன். என் செல்வத்தை இரு பாதிகளாகப் பங்கிட்டு நான் (ஒரு பாதியை உங்களுக்குக் கொடுத்து)விடுகிறேன். எனக்கு இரு மனைவிமார்கள் உள்ளனர். அவ்விருவரில் உங்களுக்கு அதிகமாகப் பிடித்திருப்ப வளைப் பார்த்து என்னிடம் சொல்லுங்கள். நான் அவளை மணவிலக்குச் செய்து விடுகிறேன். அவளுடைய “இத்தா' காலம் முடிந்தபின் அவளை நீங்கள் மணந்து கொள்ளுங்கள்” என்று சொன்னார். அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள், “அல்லாஹ் உங்களுக்கு உங்கள் வீட்டாரிலும் உங்கள் செல்வத்திலும் அருள்வளத்தை வழங்கட்டும். உங்கள் கடைவீதி எங்கே?” என்று கேட்டார்கள். மக்கள் அவர்களுக்கு “பனூ கைனுகா' கடைவீதியைக் காட்டினார்கள். அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் (அங்கு சென்று வியாபாரம் செய்து) தம்முடன் பாலாடைக் கட்டியையும் நெய்யையும் இலாபமாகப் பெற்றுத்தான் திரும்பினார்கள். பிறகு அடுத்த நாள் காலையும் தொடர்ந்து சென்றார்கள். (இப்படியே தொடர்ந்து சென்று வியாபாரம் செய்து சம்பாதித்தார்கள்.) ஒருநாள் தம்மீது (நறுமணப் பொருள் தடவிக்கொண்டிருந்ததால்) மஞ்சள் அடையாளத்துடன் (நபி (ஸல்) அவர்களிடம்) வந்தார்கள். நபி (ஸல்) அவர்கள் அப்துர் ரஹ்மான் (ரலி) அவர்களை நோக்கி, “என்ன இது?” என்று கேட்டார்கள். அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள், “நான் மணம் புரிந்துகொண்டேன்” என்று பதிலளித்தார்கள். நபி (ஸல்) அவர்கள், “அவளுக்கு எவ்வளவு (மணக்கொடை) கொடுத்தீர்கள்?” என்று கேட்டார்கள். அவர்கள், “ஒரு பேரீச்சங் கொட்டையளவு தங்கம் அல்லது ஒரு பேரீச்சங் கொட்டையின் எடையளவு தங்கம்” என்று பதிலளித்தார்கள். அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள், “ஒரு பேரீச்சங் கொட்டையளவு தங்கம்' என்று சொன்னார்களா, “ஒரு பேரீச்சங் கொட்டை எடையளவு தங்கம்' என்று சொன்னார்களா என்பதில் அறிவிப்பாளர் இப்ராஹீம் (ரஹ்) அவர்களுக்குச் சந்தேகம் ஏற்பட்டுள்ளது.8 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3781,
			"arabicnumber": 3781,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் (புலம்பெயர்ந்து மதீனாவுக்கு) எங்களிடம் வந்தார்கள். அவர்களுக்கும் சஅத் பின் அர்ரபீஉ (ரலி) அவர்களுக்கும் இடையே சகோதரத்துவ உறவை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஏற்படுத்தினார்கள் - சஅத் பின் அர்ரபீஉ (ரலி) அவர்கள் அதிக செல்வமுடையவராக இருந்தார்கள் - சஅத் (ரலி) அவர்கள், “அன்சாரிகள், நான் அவர்களில் அதிகச் செல்வமுடையவன் என்று அறிந்திருக் கின்றனர். என் செல்வத்தை எனக்கும் உங்களுக்கும் இடையே இரு பாதிகளாகப் பங்கிட்டு (கொடுத்து)விடுவேன். எனக்கு இரு மனைவிகள் உள்ளனர். அவர்களில் உங்களுக்கு அதிகமாகப் பிடித்தவளைப் பாருங்கள். நான் அவளை மணவிலக்குச் செய்துவிடுகின்றேன். அவள் ஹலால் (இத்தா முடிந்து பிறரை மணந்துகொள்ளத் தகுதியுடையவள்) ஆனதும் அவளை நீங்கள் மணந்துகொள்ளுங்கள்” என்று (தம் முஹாஜிர் சகோதரரான அப்துர் ரஹ்மான் பின் அவ்ஃபிடம்) கூறினார்கள். அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள், “அல்லாஹ் உங்களுக்கு உங்கள் வீட்டார் விஷயத்தில் அருள்வளம் வழங்கட்டும்” என்று கூறி (கடைவீதி சென்று)விட்டார்கள். சிறிது நெய்யையும் பாலாடைக் கட்டியையும் இலாபமாகச் சம்பாதித்த பின்னரே அன்று திரும்பி வந்தார்கள். சிறிது காலம்தான் சென்றிருக் கும். அதற்குள் அவர்கள் தம்மீது (நறுமணப் பொருளின்) மஞ்சள் அடையாளம் தோய்ந்திருக்க அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தார்கள். அவர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “என்ன இது?” என்று கேட்க, “நான் அன்சாரிப் பெண் ஒருத்தியை மணந்துகொண்டேன்” என்று அவர்கள் பதிலளித்தார்கள். நபி (ஸல்) அவர்கள், “அவளுக்கு என்ன (மணக்கொடை) கொடுத்தீர்கள்?” என்று கேட்டதற்கு அவர்கள், “ஒரு பேரீச்சங் கொட்டையின் எடையளவு தங்கம் அல்லது ஒரு பேரீச்சங் கொட்டையளவு தங்கம்” என்று பதிலளித் தார்கள். நபி (ஸல்) அவர்கள், “ஒரேயோர் ஆட்டையேனும் (அறுத்து) மணவிருந்து (வலீமா) கொடுப்பீராக” என்று சொன்னார் கள்.9 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3782,
			"arabicnumber": 3782,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (நபி (ஸல்) அவர்களிடம்) அன்சாரிகள், “எங்களுக்கும் (முஹாஜிர்களான) அவர்களுக்குமிடையே (எங்கள்) பேரீச்ச மரங்களைப் பங்கிடுங்கள்” என்று சொன் னார்கள். நபி (ஸல்) அவர்கள், “வேண்டாம்” என்று சொல்ல அவர்கள், “(அப்படியென் றால்) அவர்கள் (முஹாஜிர் சகோதரர்கள்) எங்களுக்காக உழைக்கட்டும்; எங்களுடன் விளைச்சலில் (இலாபப்) பங்கு பெற்றுக் கொள்ளட்டும்” என்று சொன்னார்கள். (அதற்குச் சம்மதித்து) முஹாஜிர்கள், “நாங்கள் செவியுற்றோம்; கீழ்ப்படிந்தோம்” என்று கூறினர்.10 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3783,
			"arabicnumber": 3783,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளரைத் தவிர வேறெவரும் அன்சாரிகளை நேசிக்க மாட்டார்கள்; அவர்களை நயவஞ்சகர்களைத் தவிர வேறெவரும் வெறுக்கவும் மாட்டார்கள். யார் அவர்களை நேசிக்கிறார்களோ அவர்களை அல்லாஹ்வும் நேசிக்கிறான். யார் அவர்களை வெறுக் கிறார்களோ அவர்களை அல்லாஹ்வும் வெறுக்கிறான். இதை பராஉ (ரலி) அவர்கள் அறிவிக் கிறார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3784,
			"arabicnumber": 3784,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையின் அடையாளம் அன்சாரிகளை நேசிப்பதாகும்; நயவஞ்சகத் தின் அடையாளம் அன்சாரிகளை வெறுப்பதாகும். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.11 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3785,
			"arabicnumber": 3785,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: (அன்சாரிப்) பெண்களும் குழந்தை களும் எதிரில் வருவதை நபி (ஸல்) அவர்கள் பார்த்தார்கள்.- அறிவிப்பாளர் களில் ஒருவர் கூறுகிறார்: இதை எனக்கு அறிவித்தவர், “ஒரு மண விழாவிலிருந்து வருவதை” என்று சொன்னதாக நினைக்கிறேன் - உடனே நபி (ஸல்) அவர்கள் நேராக எழுந்து நின்றுகொண்டு, “இறைவா! (நீயே சாட்சி! அன்சாரிகளே!) நீங்கள் மக்களிலேயே எனக்கு மிகவும் பிரியமானவர்கள்” என்று சொன்னார்கள். இ(ந்த வாக்கியத்)தை அவர்கள் மூன்று முறை சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3786,
			"arabicnumber": 3786,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தமது குழந்தையொன்றைத் தம்முடன் எடுத்துக்கொண்டு அன்சாரிப் பெண்மணி ஒருவர் வந்தார். அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பேசினார்கள். அப்போது அவர்கள், “அல்லாஹ்வின் மீதாணையாக! (அன்சாரி களான) நீங்கள் மக்களிலேயே எனக்கு மிகவும் பிரியமானவர்கள்” என்று இருமுறை சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3787,
			"arabicnumber": 3787,
			"text": "ஸைத் பின் அர்கம் (ரலி) அவர்கள் கூறியதாவது: அன்சாரிகள் (நபி (ஸல்) அவர்களிடம்), “அல்லாஹ்வின் தூதரே! இறைத்தூதர்கள் ஒவ்வவொருவருக்கும் அவர்களைப் பின் தொடர்ந்த (சார்பு நிலை கொண்ட)வர்கள் இருந்தனர். நாங்கள் உங்களைப் பின்பற்றி னோம். ஆகவே, எங்களுக்கும் எங்களைப் பின்தொடரும் சார்பு நிலையாளர்களை எங்களிலிருந்தே உருவாக்கித் தரும்படி அல்லாஹ்விடம் பிரார்த்தியுங்கள்” என்று கேட்டுக்கொண்டனர். அவ்வாறே நபி (ஸல்) அவர்கள் பிரார்த்தித்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3788,
			"arabicnumber": 3788,
			"text": "அன்சாரிகளில் ஒருவரான அபூஹம்ஸா (ரலி) அவர்கள் கூறியதாவது: அன்சாரிகள் (நபி (ஸல்) அவர்களிடம்), “ஒவ்வொரு சமுதாயத்தாருக்கும் அவர்களைப் பின்தொடரும் சார்பு நிலையாளர்கள் உண்டு. நாங்கள் உங்களைப் பின்பற்றினோம். ஆகவே, எங்களைப் பின்பற்றும் சார்பு நிலையாளர்களை எங்களிலிருந்தே உருவாக்கித் தரும்படி நீங்கள் அல்லாஹ்விடம் பிரார்த்தியுங்கள்” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள், “இறைவா! இவர் களுடைய சார்பாளர்களை இவர்களிலிருந்தே உருவாக்கித் தருவாயாக!” என்று பிரார்த்தித்தார்கள்.12 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3789,
			"arabicnumber": 3789,
			"text": "அபூஉசைத் (ரலி) அவர்கள் கூறியதாவது: “அன்சாரிகளின் கிளைக் குடும்பங் களில் சிறந்தது பனுந் நஜ்ஜார் குடும்ப மாகும்.13 பிறகு பனூ அப்தில் அஷ்ஹல் குடும்பமாகும்.14 பிறகு பனூ ஹாரிஸ் பின் அல்கஸ்ரஜ் குடும்பமாகும்.15 பிறகு பனூ சாஇதா குடும்பமாகும்.16 அன்சாரி கிளைக் குடும்பங்கள் ஒவ்வொன்றிலும் நன்மை உண்டு” என்று நபி (ஸல்) அவர்கள் சொன்னார்கள். சஅத் (பின் உபாதா -ரலி) அவர்கள், “நபி (ஸல்) அவர்கள் எங்களைவிட (வேறுசில குலங்களைச்) சிறப்பித்துக் கூறியதாகவே காண்கிறேன்” என்று சொன்னார்கள்.17 அவர்களிடம், “நபி (ஸல்) அவர்கள் (இங்கே குறிப்பிடப்படாத மற்ற) பலரையும் விட உங்களைச் சிறப்பித்துக் கூறியுள் ளார்கள்” என்று சொல்லப்பட்டது. மற்றோர் அறிவிப்பில், “சஅத் பின் உபாதா' என்று (முழுமையாகப் பெயர்) குறிப்பிட்டு அறிவிப்பாளர் கூறியுள்ளார். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3790,
			"arabicnumber": 3790,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: “அன்சாரிகளில் சிறந்தோர்' அல்லது “அன்சாரிகளின் கிளைக் குடும்பங்களில் சிறந்தது' பனுந் நஜ்ஜார் குடும்பமும், பனூ அப்தில் அஷ்ஹல் குடும்பமும் பனுல் ஹாரிஸ் மற்றும் பனூ சாஇதா குடும்பங் களும் ஆகும். இதை அபூஉசைத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.18 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3791,
			"arabicnumber": 3791,
			"text": "அபூஹுமைத் (ரலி) அவர்கள் கூறியதாவது: “அன்சாரிகளின் கிளைக் குடும்பங்களில் சிறந்தது பனுந் நஜ்ஜார் குடும்பமாகும். பிறகு பனூ அப்தில் அஷ்ஹல், பிறகு பனுல் ஹாரிஸ், பிறகு பனூ சாஇதா குடும்பங்கள் ஆகும். அன்சாரிக் குடும்பங் கள் ஒவ்வொன்றிலும் நன்மை உள்ளது” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். சஅத் பின் உபாதா (ரலி) அவர்கள் எங்களிடம் வந்து சேர்ந்தார். அப்போது (அவரிடம்) அபூஉசைத் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்சாரிகளைச் சிறந்த வர்கள் எனக் குறிப்பிட்டு (அப்படிக் குறிப்பிட்டவர்களில்) நம்மைக் கடைசியானவர்களாகக் குறிப்பிட்டுள்ளதை நீங்கள் கவனிக்கவில்லையா?” என்று கேட்டார்கள். (இதைக் கேட்ட) உடனே சஅத் பின் உபாதா (ரலி) அவர்கள் நபி (ஸல்) அவர்களை அடைந்து, “அல்லாஹ் வின் தூதரே! அன்சாரிகளின் கிளைக் குடும்பங்கள் (தங்களால்) சிறப்பித்துக் கூறப்பட்டபோது (அன்சாரிகளில் ஒரு குடும்பத்தாரான) நாங்கள் கடைசியாகக் குறிப்பிடப்பட்டுள்ளோமே (ஏன்?)” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “நீங்கள் மிகச் சிறந்த (குடும்பத்த)வர்களில் இடம்பெற்றிருப்பதே உங்களுக்குப் போதுமானதல்லவா?” என்று சொன்னார்கள்.19 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3792,
			"arabicnumber": 3792,
			"text": "உசைத் பின் ஹுளைர் (ரலி) அவர்கள் கூறியதாவது: அன்சாரிகளில் ஒரு மனிதர், “அல்லாஹ்வின் தூதரே! இன்ன மனிதரை நீங்கள் அதிகாரியாக நியமித்ததுபோல் என்னையும் அதிகாரியாக நியமிக்க மாட்டீர்களா?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “எனக்குப் பிறகு (உங்களைவிட மற்றவர்களுக்கு ஆட்சியதி காரத்தில்) முன்னுரிமை தரப்படுவதை நீங்கள் காண்பீர்கள். ஆகவே, (மறுமையில் எனக்குச் சிறப்புப் பரிசாகக் கிடைக்கும் “அல்கவ்ஸர்' எனும்) தடாகத்தின் அருகே என்னைச் சந்திக்கும்வரை நீங்கள் பொறுத்திருங்கள்” என்று சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3793,
			"arabicnumber": 3793,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் அன்சாரிகளிடம், “எனக்குப் பிறகு (உங்களைவிட ஆட்சி யதிகாரத்தில் மற்றவர்களுக்கு) முன்னுரிமை தரப்படுவதை நீங்கள் காண்பீர்கள். ஆகவே, (மறுமையில்) என்னைச் சந்திக் கும்வரை நீங்கள் பொறுமையாக இருங்கள். என்னைச் சந்திக்க உங்களுக்கு வாக்களிக் கப்பட்டுள்ள இடம் (மறுமையில் எனக்கு சிறப்புப் பரிசாக இறைவன் வழங்கவிருக்கும் அல்கவ்ஸர் எனும்) தடாகமேயாகும்.21 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3794,
			"arabicnumber": 3794,
			"text": "யஹ்யா பின் சயீத் (ரஹ்) அவர்கள் கூறியதாவது: அனஸ் பின் மாலிக் (ரலி) அவர்கள் என்னுடன் பயணம் செய்து வலீத் பின் அப்துல் மலிக்கைச் சந்தித்தபோது (வலீத் இடம்) சொன்னார்கள்:22 நபி (ஸல்) அவர்கள் பஹ்ரைனுடைய நிலங்களை வருவாய் மானியமாக எங்களுக்குத் தருவதற்காக அழைத்தார்கள். அன்சாரிகள், “எங்கள் முஹாஜிர் சகோதரர் களுக்கும் இதே போன்று மானியம் தந்தால் தவிர நாங்கள் இதை ஏற்க மாட்டோம்” என்று கூறினர். “நீங்கள் இதை ஏற்கமாட்டீர்கள் என்றால், என்னை (மறுமையில் “அல் கவ்ஸர்' தடாகத்தின் அருகே) சந்திக் கும்வரை பொறுத்திருங்கள். ஏனெனில், எனக்குப்பின் (ஆட்சியதிகாரத்தில்) உங்களைவிடப் பிறருக்கு முன்னுரிமை வழங்கப்படும் நிலை உங்களுக்கு நேரும்” என்று சொன்னார்கள்.23 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3795,
			"arabicnumber": 3795,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: “மறுமை வாழ்க்கையைத் தவிர வேறு (நிலையான) வாழ்க்கை இல்லை; அன்சாரிகளையும் முஹாஜிர்களையும் (அந்த நிரந்தர மறுமை வாழ்விற்காக) செம்மைப்படுத்துவாயாக” என்று (பாடியபடி) சொன்னார்கள்24 இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அனஸ் (ரலி) அவர்களிடமிருந்து வேறோர் அறிவிப்பாளர்தொடர் வழியாக வும் இதே போன்று அறிவிக்கப்பட்டுள்ளது. அந்த அறிவிப்பில், “அன்சாரிகளுக்கு(ம் முஹாஜிர்களுக்கும்) நீ மன்னிப்பு அளிப்பாயாக!” என்று (பாடியபடி) கூறிய தாக வந்துள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3796,
			"arabicnumber": 3796,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அகழ்ப்போர் நாளில் அன்சாரிகள், “நாங்கள் (எத்தகையவர்கள் எனில்) “நாங்கள் உயிரோடிருக்கும் காலம்வரை அறப்போர் புரிவோம்' என்று முஹம்மத் (ஸல்) அவர்களிடம் உறுதிமொழி கொடுத் திருக்கின்றோம்” என்று (கவிதையில்) கூறிக்கொண்டிருந்தனர். அவர்களுக்கு நபி (ஸல்) அவர்கள், “இறைவா! மறுமை வாழ்க்கையைத் தவிர வேறு (நிலையான) வாழ்க்கை எதுவுமில்லை; ஆகவே, அன்சாரிகளையும் முஹாஜிர்களையும் கண்ணியப்படுத்துவாயாக!” என்று (கவிதையிலேயே பதில்) சொன்னார்கள்.25 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3797,
			"arabicnumber": 3797,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அகழ் தோண்டிக்கொண்டும் எங்கள் தோள்களின்மீது மண்ணைச் சுமந்து எடுத்துச் சென்றுகொண்டும் இருந்தபோது எங்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்தார்கள். அப்போது அவர்கள், “இறைவா! மறுமை வாழ்க்கையைத் தவிர வேறு (நிலையான) வாழ்க்கை எதுவுமில்லை. ஆகவே, முஹாஜிர்களுக்கும் அன்சாரி களுக்கும் மன்னிப்பருள்வாயாக!” என்று (கவிதையில்) கூறினார்கள்.26 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3798,
			"arabicnumber": 3798,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் (விருந்தாளியாக) வந்தார். நபி (ஸல்) அவர்கள் (அவருக்கு உணவளிப்பதற்காகத்) தம் துணைவியரிடம் சொல்லியனுப்பினார் கள். அப்போது துணைவியர், “எங்களிடம் தண்ணீரைத் தவிர வேறெதுவும் இல்லை” என்று பதிலளித்தார்கள். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் தோழர்களை நோக்கி), “ “இவரை (தம்முடன் உணவில்) சேர்த்துக்கொள்பவர் யார்?' அல்லது “இவருக்கு விருந்தளிப்பவர் யார்” என்று கேட்டார்கள். அப்போது அன்சாரிகளில் ஒருவர், “நான் (விருந்தளிக்கிறேன்)” என்று சொல்லி அவரை அழைத்துக்கொண்டு தம் மனைவியிடம் சென்றார். (மனைவியிடம்) “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய விருந்தாளியைக் கண்ணியப்படுத்து” என்று சொன்னார். அதற்கு அவருடைய மனைவி, “நம்மிடம் நம் குழந்தைகளின் உணவைத் தவிர வேறெதுவுமில்லை” என்று சொன்னார். அதற்கு அந்த அன்சாரித் தோழர், “உன் (குடும்பத்திற்கான) உணவைத் தயாராக எடுத்துவைத்துவிட்டு விளக்கை ஏற்றி (விடுவதைப்போல் பாவனை செய்து அணைத்து)விடு. உன் குழந்தைகள் உணவு உண்ண விரும்பினால் அவர்களைத் தூங்கச் செய்துவிடு” என்று சொன்னார். அவ்வாறே அவருடைய மனைவியும் உணவைத் தயாராக எடுத்துவைத்து, விளக்கை ஏற்றிவிட்டுத் தம் குழந்தைகளைத் தூங்கச் செய்துவிட்டார். பிறகு விளக்கை சரி செய்வதுபோல் நின்று (பாவனை செய்துகொண்டே) விளக்கை அணைத்து விட்டார். பிறகு அவரும் அவரின் மனைவியும் உண்பதுபோல் (விருந்தாளி யான) அந்த மனிதருக்கு (பாவனை) காட்டலானார்கள். பிறகு இருவரும் (உணவு உண்ணாமல்) வயிறு ஒட்டியவர்களாக இரவைக் கழித்தனர். காலையானதும் அந்த அன்சாரீ அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றார். நபி (ஸல்) அவர்கள், “நீங்கள் இருவரும் செய்ததைக் கண்டு அல்லாஹ் இன்றிரவு (மகிழ்ச்சியால்) “சிரித்துக் கொண்டான்' அல்லது “வியப்படைந்தான்' என்று சொன்னார்கள். அப்போது அல்லாஹ், “தமக்கே தேவை இருந்தும்கூட, தம்மைவிடப் பிறருக்கே அவர்கள் முன்னுரிமை வழங்குகிறார்கள். உண்மையில், யார் தம் உள்ளத்தின் கருமித்தனத்திலிருந்து பாதுகாக்கப்பட்டுவிட்டார்களோ அவர்கள் தான் வெற்றியாளர்கள்” எனும் (59:9ஆம்) வசனத்தை அருளினான். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3799,
			"arabicnumber": 3799,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: (நபி (ஸல்) அவர்கள் நோய்வாய்ப்பட்டிருந்த சமயம்) அன்சாரிகள் தமது சபைகளில் ஒன்றில் (அமர்ந்தபடி) அழுதுகொண்டிருந்தபோது அபூபக்ர் (ரலி) அவர்களும் அப்பாஸ் (ரலி) அவர்களும் அந்த வழியாகச் சென்றார்கள். அப்போது, அப்பாஸ் (ரலி) அவர்கள் (அல்லது அபூபக்ர் (ரலி) அவர்கள்), “நீங்கள் ஏன் அழுகிறீர்கள்?” என்று கேட்டார்கள். அதற்கு அவர்கள், “நாங்கள் நபி (ஸல்) அவர்களுடன் (கூடி) அமர்ந்திருந்த அவையை நினைத்துப் பார்த்தோம். (அதனால் அழுகிறோம்.)” என்று பதிலளித்தார்கள்.27 அப்பாஸ் (ரலி) அவர்கள் (அல்லது அபூபக்ர் (ரலி) அவர்கள்), நபி (ஸல்) அவர்களிடம் சென்று, இந்த விஷயத்தைத் தெரிவித்தார்கள். உடனே நபி (ஸல்) அவர்கள் தம் சால்வையின் ஓரத்தைத் தம் தலையில் கட்டியிருந்த நிலையில் வெளியே வந்து, (உரை நிகழ்த்துவதற்காக) சொற்பொழிவு மேடையில் ஏறினார்கள் - அந்த நாளுக்குப் பிறகு அவர்கள் மேடையில் ஏறவில்லை- அல்லாஹ்வைப் புகழ்ந்து அவனைப் போற்றிய பிறகு, “அன்சாரிகள் விஷயத்தில் (நல்ல விதமாக நடந்துகொள்ளும்படி) உங்களுக்கு நான் அறிவுரை கூறுகிறேன். ஏனெனில், அவர்கள் என் இரைப்பை; என் கருவூலம் ஆவர்.28 தம் மீதிருந்த பொறுப்பை, அவர்கள் நிறைவேற்றிவிட்டார்கள். இனி அவர்களுக்குரிய உரிமைதான் எஞ்சியுள்ளது.29 ஆகவே, அவர்களில் நன்மை புரிவோரிடமிருந்து (அந்த நன்மையை) ஏற்றுக்கொண்டு, அவர்களில் தவறிழைப்பவரை மன்னித்துவிடுங்கள்” என்று சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3800,
			"arabicnumber": 3800,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நோய்வாய்ப்பட்டிருந்தபோது) தம் தோள்களின் மீது ஒரு போர்வையைப் போர்த்திக்கொண்டு (வீட்டிலிருந்து பள்ளிவாசலுக்குப்) புறப்பட்டார்கள். அப்போது அவர்கள் (தலை)மீது கறுப்புக் கட்டு ஒன்று (போடப்பட்டு) இருந்தது. சொற்பொழிவு மேடை (மிம்பர்)மீது அமர்ந்து, அல்லாஹ்வைப் போற்றிப் புகழ்ந்துவிட்டு, பிறகு சொன்னார்கள்: மக்களே! (இஸ்லாத்தில் இணையும்) மக்கள் (எண்ணிக்கையில்) அதிகமாவார்கள். (ஆனால் இறைமார்க்கத்திற்கு) உதவி புரிவோர் (அன்சார்கள்) உணவில் உப்பைப் போன்று ஆகிவிடும் அளவுக்குக் குறைந்து போய்விடுவார்கள். ஆகவே, ஒருவருக்கு நன்மையளிக்கக்கூடிய, அல்லது தீங்கு செய்யக்கூடிய (அளவுக்குள்ள) ஓர் அதிகாரப் பொறுப்பை உங்களில் ஒருவர் ஏற்றால், அன்சாரிகளில் நன்மை புரிந்தவரின் நன்மையை ஏற்றுக்கொண்டு அவர்களில் தவறிழைத்தவரை மன்னித்து விடட்டும்.30 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3801,
			"arabicnumber": 3801,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அன்சாரிகள் என் இரைப்பை; என் கருவூலம் ஆவர். இனி (அன்சாரிகள் அல்லாத) மக்கள் பெருகுவார்கள்; (அன்சாரிகள்) குறைந்துபோய்விடுவார்கள். ஆகவே, அவர்களில் நன்மை புரிபவர்களிடமிருந்து (அதை) ஏற்றுக்கொள்ளுங்கள்; அவர்களில் தவறிழைப்பவர்களை (பெருந் தன்மையுடன்) மன்னித்துவிடுங்கள். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3802,
			"arabicnumber": 3802,
			"text": "பராஉ (ரலி) அவர்கள் கூறிய தாவது: (ஒருமுறை) நபி (ஸல்) அவர்களுக்குப் பட்டு அங்கி ஒன்று அன்பளிப்பாக வழங்கப்பட்டது. நபி (ஸல்) அவர்களின் தோழர்கள் அதைத் தொட்டுப் பார்த்து அதன் மென்மையைக் கண்டு வியப் படையலானார்கள். நபி (ஸல்) அவர்கள், “இதன் மென்மையைக் கண்டு நீங்கள் வியப்படைகிறீர்களா? (சொர்க்கத்தில்) சஅத் பின் முஆத் அவர்களின் கைக் குட்டைகள் “இதைவிடச் சிறந்தது' அல்லது “இதைவிட மென்மையானது' ஆகும்” என்று சொன்னார்கள்.32 இதே ஹதீஸ் அனஸ் பின் மாலிக் (ரலி) அவர்களிடமிருந்து இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.33 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3803,
			"arabicnumber": 3803,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: சஅத் பின் முஆத் அவர்களின் இறப் பிற்காக அர்ஷ் (இறை அரியணை) அசைந்தது.34 இதை ஜாபிர் (ரலி) அவர்கள் அறிவிக் கிறார்கள். ஜாபிர் (ரலி) அவர்களிடமிருந்து இதே ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் அறிவிக்கப்பட்டுள்ளது. அதில் வந்துள்ளதாவது: ஒரு மனிதர் ஜாபிர் (ரலி) அவர்களிடம், “பராஉ (ரலி) அவர்கள், “சஅத் பின் முஆத் (ரலி) அவர்களைச் சுமந்து சென்ற (ஜனாஸா) பெட்டிதான் அசைந்தது' என்று இதற்கு விளக்கம் தருகிறார்கள்” என்று சொன்னதற்கு ஜாபிர் (ரலி) அவர்கள், “இந்த (அவ்ஸ் மற்றும் கஸ்ரஜ்) இரு குடும்பங்களுக்கிடையே குரோதங்கள் இருந்தன. நபி (ஸல்) அவர்கள், “சஅத் பின் முஆத் அவர்களின் இறப்பிற்காக அளவற்ற அருளாள(னான இறைவ)னின் அரியணை அசைந்தது' என்று சொல்ல நான் கேட்டிருக்கின்றேன்” என்று பதிலளித்தார்கள்.35 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3804,
			"arabicnumber": 3804,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: சஅத் பின் முஆத் (ரலி) அவர்களு டைய தீர்ப்பை ஏற்பதாக ஒப்புக்கொண்டு (பனூ குறைழா யூத) மக்கள் (கைபரிலுள்ள கோட்டையிலிருந்து) இறங்கி வந்தார்கள். அப்போது நபி (ஸல்) அவர்கள் சஅத் பின் முஆத் (ரலி) அவர்களுக்கு ஆளனுப் பிட அவர்கள் (மஸ்ஜிதுந் நபவீயிலிருந்து) கழுதையின் மீது (பயணம் செய்தபடி) வந்தார்கள். (நபியவர்கள் தாற்காலிமாக அமைத்திருந்த) தொழுமிடத்திற்கு அருகே அவர்கள் வந்து சேர்ந்ததும், நபி (ஸல்) அவர்கள், “உங்களில் சிறந்தவரை'அல்லது “உங்கள் தலைவரை' நோக்கி எழுந்திரு(த்துச் சென்று அவரை வாகனத் திலிருந்து இறக்கிவிடு)ங்கள்” என்று சொன்னார்கள். பிறகு, “சஅதே! இவர்கள் உங்கள் தீர்ப்பின் மீது (இசைவு தெரிவித்து) இறங்கி வந்திருக்கிறார்கள் (நீங்கள் என்ன தீர்ப்பு அளிக்கப்போகிறீர்கள்?)” என்று கேட்டார் கள். சஅத் (ரலி) அவர்கள், “இவர்களில் போரிடும் வலிமையுடையவர்கள் கொல்லப்பட வேண்டும் என்றும், இவர்களுடைய பெண்களும் குழந்தைகளும் கைது செய்யப்பட வேண்டும் என்றும் நான் இவர்கள் விஷயத்தில் தீர்ப்பளிக்கிறேன்” என்று சொன்னார்கள். உடனே நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் தீர்ப்புப்படியே நீங்கள் தீர்ப்பளித்தீர்கள்; அல்லது அரசனின் (அல்லாஹ்வின்) தீர்ப்புப்படியே நீங்கள் தீர்ப்பளித்தீர்கள்” என்று சொன்னார்கள்.36 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3805,
			"arabicnumber": 3805,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: (நபித்தோழர்களில்) இரு மனிதர்கள் நபி (ஸல்) அவர்களிடமிருந்து (விடை பெற்றுக்கொண்டு) இருண்ட ஓர் இரவில் (தம் இல்லங்களுக்குப்) புறப்பட்டார்கள். அப்போது அவ்விருவருக்கும் முன்னால் ஒளி ஒன்று பிரகாசித்தபடி அவர்கள் ஒருவரையொருவர் பிரியும்வரை சென்று கொண்டேயிருந்தது. (அவர்கள் ஒருவரையொருவர் பிரிந்து சென்றவுடன்) அந்த ஒளியும் அவர் களுடன் பிரிந்து சென்றுவிட்டது. அனஸ் (ரலி) அவர்களிடமிருந்தே ஸாபித் (ரஹ்) அவர்கள் வழியாக மஅமர் (ரஹ்) அவர்கள் அறிவிக்கும் மற்றோர் அறிவிப்பில், “இரு மனிதர்கள்' என்பதற்குப் பதிலாக, “உசைத் பின் ஹுளைர் (ரலி) அவர்களும் அன்சாரிகளில் ஒரு மனிதரும்' என்று இடம்பெற்றுள்ளது. அனஸ் (ரலி) அவர்களிடமிருந்தே ஸாபித் (ரஹ்) அவர்கள் வழியாக ஹம்மாத் (ரஹ்) அவர்கள் அறிவிக்கும் இன்னோர் அறிவிப்பில், “உசைத் பின் ஹுளைர் (ரலி) அவர்களும் அப்பாத் பின் பிஷ்ர் (ரலி) அவர்களும் நபி (ஸல்) அவர்களிடம் இருந்தனர். (இருவரும் நபி (ஸல்) அவர்களிடமிருந்து புறப்பட்டுத் தம் இல்லங் களுக்குச் சென்றபோது)” என்று இடம்பெற்றுள்ளது.38 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3806,
			"arabicnumber": 3806,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இப்னு மஸ்ஊத், அபூஹுதைஃபாவின் முன்னாள் அடிமையான சாலிம், உபை பின் கஅப் மற்றும் முஆத் பின் —பல் ஆகிய நான்கு பேரிடமிருந்து குர்ஆனை ஓதக் கற்றுக்கொள்ளுங்கள். இதை அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.40 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3807,
			"arabicnumber": 3807,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: “அன்சாரிகளின் கிளைக் குடும்பங் களில் சிறந்தது பனுந் நஜ்ஜார் குடும்பம் ஆகும். பிறகு பனூ அப்தில் அஷ்ஹல் குடும்பம் ஆகும். பிறகு பனுல் ஹாரிஸ் பின் அல்கஸ்ரஜ் குடும்பம் ஆகும். பிறகு பனூ சாஇதா குடும்பம் ஆகும். அன்சாரி கிளைக் குடும்பங்கள் ஒவ்வொன்றிலும் நன்மை உண்டு” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்” என அபூஉசைத் (ரலி) அவர்கள் கூறினார்கள். அப்போது சஅத் பின் உபாதா (ரலி) அவர்கள் -இஸ்லாத்தில் செல்வாக்கு உடையவர்களாக அன்னார் இருந்தார்கள்- “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நம்மைவிட (மற்றக் குடும்பங்களைச்) சிறப் புக்குரியவர்களாக ஆக்கிவிட்டதை நான் பார்க்கிறேன்” என்று சொன்னார்கள். அப்போது அவர்களிடம், “உங்களை நபி (ஸல்) அவர்கள் நிறைய மக்களைவிடச் சிறப்பித்துக் கூறியுள்ளார்கள்” என்று சொல்லப்பட்டது.43 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3808,
			"arabicnumber": 3808,
			"text": "மஸ்ரூக் (ரஹ்) அவர்கள் கூறிய தாவது: அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்களிடம் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் குறித்துக் கூறப்பட்டது. அப்போது அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் சொன்னார்கள்: அவர் நான் நேசித்துக்கொண்டேயிருக்கும் ஒரு மனிதர். (ஏனெனில்,) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அப்துல்லாஹ் பின் மஸ்ஊத், அபூஹுதைஃபாவின் முன்னாள் அடிமை சாலிம், முஆத் பின் ஜபல், உபை பின் கஅப் ஆகிய நான்கு பேரிடமிருந்து குர்ஆனை (ஓதும் முறையை) எடுத்துக்கொள்ளுங்கள்” என்று சொல்ல நான் கேட்டேன். நபி (ஸல்) அவர்கள் அப்துல்லாஹ் பின் மஸ்ஊத் அவர்களையே முதலில் குறிப்பிட் டார்கள்.45 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3809,
			"arabicnumber": 3809,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் உபை பின் கஅப் (ரலி) அவர்களிடம் “அல்லாஹ் உங்களுக்கு, “வேதம் அருளப்பட்டவர்களிலும் இணைவைப்பாளர்களிலும் உள்ள இறைமறுப்பாளர்கள் தெளிவான சான்று தங்களிடம் வரும்வரை தங்களுடைய இறைமறுப்பிலிருந்து விலகிக்கொள்வோராய் இருக்கவில்லை...” எனும் (திருக்குர்ஆனின் 98ஆம்) அத்தியாயத்தை ஓதிக்காட்டும்படி எனக்குக் கட்டளை யிட்டான்” என்று சொன்னார்கள். அதற்கு உபை பின் கஅப் (ரலி) அவர்கள், “என் பெயரைக் குறிப்பிட்டா (அப்படிச்) சொன்னான்?” என்று கேட்க, நபி (ஸல்) அவர்கள், “ஆம்' என்று பதிலளித்தார்கள். அதைக் கேட்டு உபை பின் கஅப் (ரலி) அவர்கள் (ஆனந்தம் மேலிட) அழுதார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3810,
			"arabicnumber": 3810,
			"text": "க(த்)தாதா (ரஹ்) அவர்கள் கூறிய தாவது: “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய காலத்தில் நான்கு பேர் (கொண்ட குழுவினர்) குர்ஆனை (மனனம் செய்து) திரட்டினார்கள். அவர்கள் அனைவருமே அன்சாரிகள் ஆவர். 1. உபை பின் கஅப். 2. முஆத் பின் ஜபல். 3. அபூஸைத். 4. ஸைத் பின் ஸாபித் (ரலி) ஆகியோர்தான் அவர்கள்” என்று அனஸ் (ரலி) அவர்கள் சொன்னார்கள். நான் அனஸ் (ரலி) அவர்களிடம், “அபூஸைத் என்பவர் யார்?” என்று கேட்டேன். அதற்கு அவர்கள், “என் தந்தையின் சகோதரர்களில் ஒருவர்” என்று பதிலளித்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3811,
			"arabicnumber": 3811,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: உஹுத் போரின்போது நபி (ஸல்) அவர்களை(த் தனியே) விட்டுவிட்டு மக்கள் தோற்று (ஓடி)விட்டனர். அபூதல்ஹா (ரலி) அவர்கள் நபி (ஸல்) அவர்களைத் தம் தோல் கேடயத்தால் மறைத்துக்கொண்டு பாதுகாத்தபடி நின்றார் கள். மேலும், அபூதல்ஹா (ரலி) அவர்கள் வில்லின் நாணை நன்கு இழுத்து வேகமாக அம்பெய்யக்கூடியவர்களாக இருந்தார்கள். (அப்படி வேகமாக இழுத்து அம்பெய்கை யில்) இரண்டு அல்லது மூன்று விற்களை அவர்கள் அன்று உடைத்துவிடுவார்கள். எவரேனும் ஒரு மனிதர் அம்புக்கூட்டுடன் செல்வதைக் கண்டால் நபி (ஸல்) அவர்கள், “அதை அபூதல்ஹாவிடம் போடு” என்று சொல்வார்கள். அந்த நேரத்தில் நபி (ஸல்) அவர்கள் மேலேயிருந்து (தலையை உயர்த்தி) மக்களை எட்டிப்பார்க்க, அபூதல்ஹா அவர்கள், “அல்லாஹ்வின் தூதரே! உங்களுக்கு என் தந்தையும் என் தாயும் அர்ப்பணமாகட்டும். எட்டிப் பார்க்காதீர்கள். எதிரிகளின் அம்புகளில் ஏதேனும் ஒன்று தங்களைத் தாக்கிவிடலாம். (தாங்கள் எட்டிப்பார்க்காமலிருந்தால்) என் மார்பு தங்கள் மார்புக்கு முன்னால் (கேடயம் போன்று உங்களுக்குப் பாதுகாப்பாக) இருக்கும்” என்று சொன்னார்கள். அபூபக்ர் (ரலி) அவர்களின் மகள் ஆயிஷா (ரலி) அவர்களும் (என் தாயார்) உம்மு சுலைம் (ரலி) அவர்களும் வரிந்து கட்டிக்கொண்டு (காயமுற்றவர்களுக்குப் பணிவிடைகள் செய்துகொண்டு) இருந்ததை நான் கண்டேன். அவர்கள் (தண்ணீர் நிரம்பிய) தோல் துருத்திகளைத் தங்கள் முதுகுகளில் சுமந்து கொண்டு எடுத்துச்சென்று (காயமுற்று வீழ்ந்து கிடக்கும்) மக்களின் வாய்களில் ஊற்றிவிட்டு, பிறகு திரும்பிச்சென்று, அவற்றை (மீண்டும்) நிரப்பிக்கொண்டு வந்து, அவர்களுடைய வாய்களில் மீண்டும் ஊற்றிக்கொண்டிருக்கும் நிலையில் அவர்களுடைய கால் கொலுசு களை நான் கண்டேன். அபூதல்ஹா (ரலி) அவர்களின் கரத்திலிருந்து இரு முறையோ மும்முறையோ வாள் (கீழே தவறி) விழுந்தது.48 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3812,
			"arabicnumber": 3812,
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பூமியின் மீது நடந்து செல்லும் எவரையும், “இவர் சொர்க்கவாசி” என்று சொல்லி நான் கேட்டதில்லை; அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்களைத் தவிர. அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்களைக் குறித்தே, “மேலும், இஸ்ரவேலர்களிலிருந்து சாட்சியம் சொல்பவர் ஒருவர் இதுபோன்ற வேதத்திற்குச் சாட்சியம் கூறியுள்ளார். அவர் நம்பிக்கையும் கொண்டிருந்தார்” எனும் (46:10) இறைவசனம் அருளப்பெற்றது. அறிவிப்பாளர் அப்துல்லாஹ் பின் யூசுஃப் (ரஹ்) அவர்கள் கூறுகிறார்கள்: (இதை அறிவித்த இமாம்) மாலிக் (ரஹ்) அவர்கள் இந்த இறைவசனம் அருளப்பெற்ற காரணத்தை (தாமாகவே) சொன்னார்களா; அல்லது இந்த ஹதீஸிலேயே (இந்த இறைவசனம்) இடம் பெற்றிருக்கிறதா என்பது எனக்குத் தெரியாது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3813,
			"arabicnumber": 3813,
			"text": "கைஸ் பின் உபாத் (ரஹ்) அவர்கள் கூறியதாவது: நான் மதீனாவின் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலில் (நபித்தோழர்கள் சிலருடன்) அமர்ந்திருந்தேன். அப்போது ஒரு மனிதர் தமது முகத்தில் சிரம்பணிந்(து சஜ்தா செய்)ததற்கான அடையாளத்துடன் உள்ளே வந்தார். மக்கள், “இவர் சொர்க்கவாசிகளில் ஒருவர்” என்று சொன்னார்கள். அவர் இரு ரக்அத்கள் தொழுதார்; அவற்றை (அதிக நேரம் எடுக்காமல்) சுருக்கமாகத் தொழுதார். பிறகு அவர் வெளியேற, நான் அவரைப் பின்தொடர்ந்து சென்று, “நீங்கள் பள்ளிவாசலுக்குள் நுழைந்தபோது மக்கள், “இவர் சொர்க்கவாசி' என்று கூறினர்” என்றேன். அதற்கு அவர் சொன்னார்: அல்லாஹ்வின் மீதாணையாக! தமக்குத் தெரியாததைக் கூறுவது எவருக்கும் முறையல்ல. ஏன் அவ்வாறு (மக்கள் பேசிக் கொள்கிறார்கள்) என்று உங்களுக்கு இதோ தெரிவிக்கிறேன்: அதாவது நான் நபி (ஸல்) அவர்களின் காலத்தில் கனவொன்று கண்டேன். அதை அவர்களிடம் விவரித்தேன். நான் ஒரு பூங்காவில் இருப்பதைப் போன்று கண்டேன்- அறிவிப்பாளர் கூறுகிறார்: அம்மனிதர் அதன் விசாலத்தையும் பசுமையையும் வர்ணித்தார் -அதன் நடுவே இரும்பாலான தூண் இருந்தது. அதன் அடிப்பகுதி பூமியில் இருந்தது. மேற்பகுதி வானத்தில் இருந்தது. அதன் மேற்பகுதியில் பிடி ஒன்று இருந்தது. என்னிடம், “இதில் ஏறு” என்று சொல்லப்பட்டது. நான், “என்னால் இயலாதே” என்று சொன்னேன். அப்போது என்னிடம் பணியாள் ஒருவர் வந்து என் ஆடையைப் பின்னாலிருந்து தூக்கிவிட்டார். உடனே நான் (அதில்) ஏறினேன். இறுதியில் அதன் மேற்பகுதிக்கு நான் சென்றுவிட்ட போது அந்தப் பிடியை நான் பற்றினேன். உடனே என்னிடம், “நன்கு பற்றிப் பிடித்துக்கொள்” என்று சொல்லப்பட்டது. (நான் அதைப் பற்றினேன்.) அந்தப் பிடி என் கையில் இருக்க (திடுக்கிட்டு) நான் விழித் தெழுந்தேன். நபி (ஸல்) அவர்களிடம் அதை நான் விவரித்தபோது, “அந்தப் பூங்கா இஸ்லாமாகும். அந்தத் தூண் இஸ்லாம் எனும் தூணாகும். அந்தப் பிடி பலமான (இறைநம்பிக்கை என்னும்) பிடியாகும். ஆகவே, நீங்கள் இறக்கும்வரை இஸ்லாத்திலேயே நிலைத்து நிற்பீர்கள்” என்று நபியவர்கள் பதிலளித்தார்கள். (இப்படிச் சொன்ன) அந்த மனிதர் அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்கள்தான். இந்த ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடரிலும் வந்துள்ளது. அதில் “பணியாள்' என்பதற்குப் பதிலாக “சிறிய பணியாள்' எனும் சொல் இடம்பெற்றுள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3814,
			"arabicnumber": 3814,
			"text": "அபூபுர்தா ஆமிர் (ரஹ்) அவர்கள் கூறியதாவது: நான் மதீனாவுக்கு வந்து அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்களைச் சந்தித்தேன். அவர்கள் (என்னிடம்), “நீங்கள் (என்னுடன்) வரமாட்டீர்களா? உங்களுக்கு நான் மாவையும் பேரீச்சம் பழத்தையும் உண்ணத் தருவேன். நீங்கள் (நபி (ஸல்) அவர்கள் வருகை தந்த என்) வீட்டிற்கு வந்ததாகவும் இருக்குமே” என்று கேட்டார்கள். பிறகு, “நீங்கள் வட்டி மலிந்துள்ள (இராக்) நாட்டில் வசிக்கிறீர்கள். உங்களுக்கு ஒருவர் கடனைத் திருப்பிச் செலுத்த வேண்டியிருந்து, அவர் ஒரு வைக்கோல் போரையோ, தொலிநீக்கப்படாத கோதுமை மூட்டையையோ, கால்நடைத் தீவன மூட்டையையோ அன்பளிப்பாகக் கொடுத் தாலும் அதுவும் வட்டியாகும்” (அதைத் தவிர்ப்பதே நல்லது) என்று சொன்னார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் சில தொடர்களில் “(என்) வீட்டிற்கு' எனும் சொல் இடம்பெறவில்லை. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3815,
			"arabicnumber": 3815,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உலகின் பெண்களிலேயே (அன்று) சிறந்தவர் மர்யம் ஆவார். (இன்று) உலகப் பெண்களிலேயே சிறந்தவர் கதீஜா ஆவார். இதை அலீ (ரலி) அவர்கள் அறிவிக் கிறார்கள்.51 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3816,
			"arabicnumber": 3816,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: கதீஜா (ரலி) அவர்களின் மீது நான் (தன்மான உணர்வால்) ரோஷம் கொண்ட தைப் போன்று நபி (ஸல்) அவர்களின் (இதர) மனைவிமார்களில் வேறெவரின் மீதும் நான் ரோஷப்பட்டதில்லை. ஏனெனில், அவர்களை நபி (ஸல்) அவர்கள் (அடிக்கடி) நினைவுகூர்வதை நான் கேட்டுவந்தேன். - என்னை நபி (ஸல்) அவர்கள் மணம் புரிந்துகொள்வதற்கு முன்பே கதீஜா இறந்துவிட்டிருந்தார் - மேலும், முத்து மாளிகை ஒன்று (சொர்க்கத் தில்) கதீஜாவுக்குக் கிடைக்கவுள்ளது என்று அவர்களுக்கு நற்செய்தி சொல்லும்படி அல்லாஹ், நபி (ஸல்) அவர்களுக்குக் கட்டளையிட்டான். மேலும், நபி (ஸல்) அவர்கள் ஆட்டை அறுத்து (அதன் இறைச்சியில்) சிறிதளவை கதீஜா (ரலி) அவர்களின் தோழியரிடையே அவர்களுக்குப் போதுமான அளவுக்கு அன்பளிப்பாகப் பங்கிட்டுவிடுவது வழக்கம். (இதனாலெல்லாம் எனக்குள் ரோஷம் பிறந்தது.) அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3817,
			"arabicnumber": 3817,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: கதீஜா (ரலி) அவர்களின் மீது நான் ரோஷப்பட்டதைப் போன்று வேறெந்தப் பெண்ணின் மீதும் ரோஷப்பட்டதில்லை. ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அவரை அதிகமாக நினைவு கூர்ந்து (பாராட்டிப் பேசி)வந்தார்கள். கதீஜா அவர்கள் இறந்து மூன்றாண்டுகள் கழித்து நபி (ஸல்) அவர்கள் என்னை மணந்து கொண்டார்கள். கதீஜா (ரலி) அவர்களுக்கு சொர்க்கத் தில் முத்து மாளிகை ஒன்று கொடுக்கப்படும் என்று அவர்களுக்கு நற்செய்தி கூறும்படி நபியவர்களுக்கு அவர்களின் “இறைவன் கட்டளையிட்டான்' அல்லது “(இவ்வாறு நற்செய்தி சொல்லும்படி இறைவன் கட்டளையிட்டதை) ஜிப்ரீல் (அலை) அவர்கள் சொன்னார்கள்'. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3818,
			"arabicnumber": 3818,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: கதீஜா (ரலி) அவர்களின் மீது நான் ரோஷப்பட்டதைப் போன்று நபி (ஸல்) அவர்களின் வேறெந்த மனைவியின் மீதும் ரோஷப்பட்டதில்லை. நான் (நபி (ஸல்) அவர்களிடம்) அவரைப் பார்த்த தில்லை. ஆனால், நபி (ஸல்) அவர்கள் அவரை அதிகமாக நினைவுகூர்ந்து (பாராட்டிப் பேசி)வந்தார்கள். அவர்கள் சில வேளைகளில் ஆட்டை அறுத்து அதைப் பல துண்டுகளாகப் பிரித்து, பிறகு அதை கதீஜாவின் தோழியரிடையே (பங்கிட்டு) அனுப்பிவிடுவார்கள். சில வேளைகளில் நான் நபி (ஸல்) அவர்களிடம், “உலகில் கதீஜாவைத் தவிர வேறெந்தப் பெண்ணும் இல்லாததைப் போன்று நடந்துகொள்கிறீர்களே” என்று கேட்டது உண்டு. அப்போது அவர்கள், “அவர் இவ்வாறு இவ்வாறு (நற்குணமும் புத்திசாலித்தனமும் கொண்டவராக) இருந்தார். மேலும், எனக்கு அவர் வாயிலாகத் தான் பிள்ளைச் செல்வம் கிடைத்தது” என்று பதில் சொன்னார்கள்.52 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3819,
			"arabicnumber": 3819,
			"text": "இஸ்மாயீல் பின் அபீகாலித் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் அபீஅவ்ஃபா (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்கள் கதீஜா (ரலி) அவர்களுக்கு நற்செய்தி எதுவும் சொன்னார்களா?” என்று நான் கேட்டேன். அவர்கள், “ஆம்! (சொர்க்கத்தில்) கூச்சல் குழப்பமோ களைப்போ இல்லாத, துளையுள்ள முத்து மாளிகை ஒன்றை (இறைவன் அவர்களுக்கு அளிக்க இருப்பது) கொண்டு (நற்செய்தி சொன்னார்கள்)” என்று பதிலளித்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3820,
			"arabicnumber": 3820,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) நபி (ஸல்) அவர்களிடம் (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் வந்தார்கள். “அல்லாஹ்வின் தூதரே! இதோ, கதீஜா தம்முடன் ஒரு பாத்திரத்தில் “குழம்பு' அல்லது “உணவு' அல்லது”பானம்' எடுத்துக்கொண்டு உங்களை நோக்கி வந்துகொண்டிருக்கிறார். அவர் உங்களிடம் வந்தவுடன் அவருக்கு அவருடைய இறைவனின் தரப்பிலிருந்தும் என் தரப்பிலிருந்தும் சலாம் கூறி அவருக்குச் சொர்க்கத்தில் கூச்சல் குழப்பமோ களைப்போ காண முடியாத, முத்து மாளிகை ஒன்று தரப்படவிருப்பதாக நற்செய்தி சொல்லுங்கள்” என்று சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3821,
			"arabicnumber": 3821,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: கதீஜா (ரலி) அவர்களின் சகோதரி ஹாலா பின்த் குவைலித் அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (இல்லத்துக்குள்) வருவதற்கு அனுமதி கேட்டார். உடனே நபி (ஸல்) அவர்கள் (கதீஜா (ரலி) அவர்களைப் போன்ற குரலில் ஹாலாவும் அனுமதி கேட்ட காரணத்தால்) கதீஜா (ரலி) அவர்கள் அனுமதி கேட்கும் விதத்தை நினைவு கூர்ந்து கவனம் மாறி, “இறைவா! இவர் ஹாலாவாக இருக்கட்டும்” என்று சொன் னார்கள். உடனே நான் ரோஷமடைந்து, “எப்போதோ மரணமடைந்துவிட்ட, தாடை கள் சிவந்த ஒரு குறைஷி மூதாட்டியை ஏன் (எப்போது பார்த்தாலும்) நினைத்துக் கொண்டிருக்கிறீர்கள்? அவருக்குப் பதிலாக அவரைவிடச் சிறந்த மனைவியை உங்களுக்கு அல்லாஹ் கொடுத்து விட்டானே (அப்படியிருக்க, இன்னும் ஏன் அவரையே நினைத்துக்கொண்டி ருக்கிறீர்கள்)” என்று கேட்டேன்.53 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3822,
			"arabicnumber": 3822,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் இஸ்லாத்தை ஏற்றதிலிருந்து (நான் சந்திக்க அனுமதி கேட்ட எந்தச் சமயத்திலும்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னைத் தடுத்ததில்லை; சிரித்த முகத்துடன் தவிர அவர்கள் என்னைக் கண்டதில்லை. இதை கைஸ் பின் அபீஹாஸிம் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3823,
			"arabicnumber": 3823,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அறியாமைக் காலத்தில் “துல்கலஸா'55 எனும் ஆலயம் ஒன்று இருந்தது. அது “யமன் நாட்டு கஅபா' அல்லது “ஷாம் நாட்டு கஅபா'56 என்று அழைக்கப்பட்டு வந்தது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம், “துல்கலஸாவி(ன் கவலையி)லிருந்து என்னை நீ விடுவித்து விடுவாயா?” என்று கேட்டார்கள். ஆகவே நான் “அஹ்மஸ்' எனும் (என்) குலத்தாரிலிருந்து நூற்று ஐம்பது குதிரை வீரர்களுடன் அதை நோக்கிப் புறப்பட்டேன். அதை நாங்கள் உடைத்துவிட்டோம். அதனருகே இருந்த (பகை)வர்களை நாங்கள் கொன்றுவிட்டோம்.57 பிறகு நபி (ஸல்) அவர்களிடம் வந்து விவரத்தைத் தெரிவித்தோம். அப்போது, நபி (ஸல்) அவர்கள் எங்களுக்காகவும் “அஹ்மஸ்' குலத்தாருக்காகவும் பிரார்த்தனை புரிந்தார்கள்.58 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3824,
			"arabicnumber": 3824,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: உஹுத் போரின் (ஆரம்பத்தின்) போது இணைவைப்பாளர்கள் அப்பட்ட மாகத் தோற்கடிக்கப்பட்டனர். அப்போது இப்லீஸ், “அல்லாஹ்வின் அடியார்களே! உங்களுக்குப் பின்னால் இருப்பவர்களைக் கவனியுங்கள்” என்று கத்தினான். உடனே, முஸ்லிம்களில் முன்அணியினர் (எதிரிகள் என்றெண்ணி), பின்அணியினரை நோக்கித் திரும்பிச் செல்ல, பின் அணியின ருடன் (மோதலேற்பட்டுப்) போரிட்டுக் கொண்டனர். அப்போது ஹுதைஃபா (ரலி) அவர்கள், தம் தந்தை அங்கே (முஸ்லிம்களின் தாக்குதலுக்கு ஆளாக) இருப்பதைக் கண்டார். ஆகவே, “அல்லாஹ்வின் அடியார்களே! என் தந்தை! என் தந்தை!” என்று உரக்கக் கூவினார். அல்லாஹ்வின் மீதாணையாக! அவரைக் கொன்ற பின்புதான் அவர்கள் (அவரைவிட்டு) நகர்ந்தார்கள். அப்போது ஹுதைஃபா (ரலி) அவர்கள், “அல்லாஹ் உங்களை மன்னிப்பானாக!” என்று சொன்னார்கள். அறிவிப்பாளர் ஹிஷாம் பின் உர்வா (ரஹ்) அவர்கள் கூறுகிறார்கள்: “அல்லாஹ்வின் மீதாணையாக! ஹுதைஃபா (ரலி) அவர்கள் மன்னித்ததால் (அவர்களுடைய வாழ்க்கையில்) அவர்கள் அல்லாஹ்வைச் சந்திக்கும்வரை நல்ல பலன் இருந்துகொண்டேயிருந்தது” என்று என் தந்தை (உர்வா (ரஹ்) அவர்கள்) கூறுகிறார்கள்.60 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3825,
			"arabicnumber": 3825,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: ஹின்த் பின்த் உத்பா (ரலி) அவர்கள், (நபி (ஸல்) அவர்களிடம்) வந்து, “அல்லாஹ் வின் தூதரே! (நான் இஸ்லாத்தை எதிர்த்து வந்தபொழுது) பூமியின் முதுகிலுள்ள வேறெந்த வீட்டார் இழிவடைவதையும் விட உங்கள் வீட்டார் இழிவடைவதே எனக்கு மிகவும் விருப்பமானதாக இருந்து வந்தது. (நான் இஸ்லாத்தை ஏற்றுக்கொண்ட) பிறகு இன்று பூமியின் முதுகிலுள்ள வேறெந்த வீட்டார் கண்ணியம் பெறுவதையும்விட உங்கள் வீட்டார் கண்ணியம் பெறுவதே எனக்கு அதிக விருப்பமானதாக மாறிவிட்டது” என்று சொன்னார்கள். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள், “என் உயிரைக் தன் கையில் வைத்திருப்பவன்மீது சத்தியமாக! (இந்த உனது விருப்பம்) இன்னும் (அதிகமாகும்)” என்று பதிலளித்தார்கள். ஹின்த் பின்த் உத்பா, “அல்லாஹ்வின் தூதரே! (என் கணவர்) அபூசுஃப்யான் மிகவும் கையிருக்கமான மனிதர். ஆகவே, அவருக்குரிய பணத்திலிருந்து (அவருக்குத் தெரியாமல் எடுத்து) எங்கள் பிள்ளை குட்டிகளுக்கு நான் உண்ணக் கொடுத்தால் என்மீது குற்றமாகுமா?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “நியாயமான அளவுக்கு எடுத்(து உண்ணக் கொடுத்)தால் குற்றமில்லை” என்று பதிலளித்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3826,
			"arabicnumber": 3826,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், தமக்கு வேத அறிவிப்பு (வஹீ) அருளப்படுவதற்கு முன்பு கீழ் “பல்தஹில்'63 ஸைத் பின் அம்ர் பின் நுஃபைல் அவர்களைச் சந்தித்தார்கள். அப்போது (குறைஷியரின்) பயண உணவு ஒன்று நபி (ஸல்) அவர்கள் முன்னிலையில் பரிமாறப்பட்டது. அந்த உணவை ஸைத் பின் அம்ர் உண்ண மறுத்துவிட்டார். பிறகு ஸைத் (உணவைப் பரிமாறிய குறைஷியரிடம்), “நீங்கள் உங்கள் (சிலைகளுக்குப் பலியிடும்) பலிபீடக் கற்களில் வைத்து அறுப்பவற்றை நான் உண்ணமாட்டேன். (அறுக்கும்போது) அல்லாஹ்வின் பெயர் எதன்மீது கூறப் பட்டதோ அதைத் தவிர வேறெதையும் உண்ணமாட்டேன்” என்று சொன்னார்கள். ஸைத் பின் அம்ர் அவர்கள், குறைஷி யரால் (சிலைகளுக்காக) அறுக்கப்பட்ட வற்றைக் குறைகூறிவந்தார்கள். மேலும், “ஆட்டை அல்லாஹ்வே படைத்தான்; அதற்காக வானத்திலிருந்து தண்ணீரைப் பொழிந்தான்; அதற்காக பூமியிலிருந்து (புற்பூண்டுகளை) முளைக்கச்செய்தான். (இத்தனைக்கும்) பிறகு நீங்கள் அல்லாஹ் வின் பெயரல்லாத மற்ற (கற்பனைத் தெய்வங்களின்) பெயர் சொல்லி அதை அறுக்கிறீர்கள்; இறைவனின் அருட் கொடையை நிராகரிக்கும் விதத்திலும் அல்லாஹ் அல்லாதவரை கண்ணியப் படுத்தும் விதத்திலும் இப்படிச் செய்கிறீர் கள்” என்று கூறிவந்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3827,
			"arabicnumber": 3827,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: ஸைத் பின் அம்ர் பின் நுஃபைல், (நபித்துவக் காலத்திற்கு முன்பு) ஏகத்துவ மார்க்கத்தைப் பற்றி விசாரித்துப் பின்பற்றுவதற்காக ஷாம் (சிரியா) நாட்டை நோக்கிப் புறப்பட்டார். அப்போது யூத அறிஞர் ஒருவரைச் சந்தித்து யூதர்களின் மார்க்கத்தைப் பற்றி அவரிடம் விசாரித்தார். அந்த அறிஞரிடம், “நான் உங்கள் மார்க்கத்தை ஏற்றுப் பின்பற்றக்கூடும். ஆகவே, எனக்கு (அதைப் பற்றித்) தெரிவியுங்கள்” என்று சொன்னார். அதற்கு அந்த அறிஞர், “அல்லாஹ்வின் கோபத்தில் உனக்குள்ள பங்கை நீ எடுத்துக்(கொண்டு அதற்காக வேதனையை அனுபவித்துக்)கொள்ளாத வரை நீ எங்கள் மார்க்கத்தில் இருக்க முடியாது” என்று சொன்னார். ஸைத் அவர்கள், “நான் அல்லாஹ்வின் கோபத்திலிருந்துதானே வெருண்டோடி வருகிறேன்! மேலும், அல்லாஹ்வின் கோபத்தில் சிறிதளவைக்கூட ஒருபோதும் நான் தாங்கமாட்டேன். என்னால் எப்படி அதைத் தாங்க முடியும்? வேறெந்த மார்க்கத்தையாவது எனக்கு அறிவித்துத் தர முடியுமா?” என்று கேட்டார். அந்த அறிஞர், “அது (ஏகத்துவ மார்க்கமான) நேரிய மார்க்கம் (ஹனீஃப்) ஆகத் தவிர வேறொன்றாக இருக்க முடியாது என்பதை நான் நன்கறிவேன்” என்று பதிலளித்தார். ஸைத் அவர்கள், “நேரிய மார்க்கம் என்றால் என்ன?” என்று கேட்டார். அதற்கு அந்த அறிஞர், “அது இப்ராஹீம் (அலை) அவர்களின் மார்க்கம். அவர்கள் யூதராகவும் இருக்கவில்லை. கிறித்தவராகவும் இருக்கவில்லை. மேலும், அல்லாஹ்வைத் தவிர வேறெவரையும் அவர்கள் வழிபடமாட்டார்கள்” என்று சொன்னார். (மீண்டும்) புறப்பட்டுச் சென்று கிறித்தவ அறிஞர் ஒருவரைச் சந்தித்தார். அவரும் யூத அறிஞரைப் போலவே, “அல்லாஹ்வின் (கருணையைவிட்டு அப்புறப்படுத்தப்படும்) சாபத்தில் உனக்குள்ள பங்கை நீ எடுத்துக்கொள்ளாத வரை நீ எங்கள் மார்க்கத்தில் இருக்க முடியாது” என்று சொன்னார். ஸைத் அவர்கள், “அல்லாஹ்வின் சாபத்திலிருந்துதானே நான் வெருண்டோடி வருகின்றேன். அல்லாஹ்வின் சாபத்திலிருந்தும் அவனது கோபத்திலிருந்தும் சிறிதளவைக்கூட ஒருபோதும் நான் தாங்கமாட்டேன். (அவற்றை) எப்படி என்னால் தாங்க முடியும்? வேறெந்த மார்க்கத்தையாவது எனக்கு நீங்கள் அறிவித்துத் தருவீர்களா?” என்று கேட்க, அதற்கு அவர், “நேரிய (ஏகத்துவ) மார்க்கமாகத்தான் அது இருக்குமென்பதை நான் நன்கறிவேன்” என்று சொன்னார். ஸைத் அவர்கள், “நேரிய மார்க்கம் என்றால் என்ன?” என்று கேட்டார். அதற்கு அந்த அறிஞர், “இப்ராஹீம் (அலை) அவர்களின் மார்க்கம். அவர்கள் யூதராகவோ கிறித்தவராகவோ இருக்கவில்லை. மேலும் அல்லாஹ்வைத் தவிர வேறெவரையும் அவர்கள் வழிபடமாட்டார்கள்” என்று பதிலளித்தார். ஸைத் அவர்கள் அந்த அறிஞர்கள் இப்ராஹீம் (அலை) அவர் களின் மார்க்கத்தைப் பற்றிக் கூறியதைக் கண்டபோது, (அவர்களிடமிருந்து) புறப்பட்டு வெளியே வந்ததும் தம் கைகளை உயர்த்தி, “இறைவா! நான் இப்ராஹீம் (அலை) அவர்களுடைய (ஏகத்துவ) மார்க்கத்தில் உள்ளேன் என்று உறுதிகூறுகிறேன்” எனச் சொன்னார். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3828,
			"arabicnumber": 3828,
			"text": "அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்கள் கூறியதாவது: ஸைத் பின் அம்ர் பின் நுஃபைல் அவர்கள் (நபித்துவக் காலத்திற்கு முன்பு) இறையில்லம் கஅபாவின் மீது சாய்ந்து கொண்டு நின்றபடி, “குறைஷிக் குலத்தாரே! அல்லாஹ்வின் மீதாணையாக! என்னைத் தவிர உங்களில் எவரும் இப்ராஹீம் (அலை) அவர்களுடைய மார்க்கத்தின் படி நடக்கவில்லை” என்று சொல்லிக் கொண்டி ருந்ததை நான் பார்த்தேன். மேலும், அவர், உயிரோடு புதைக்கப் படவிருந்த பெண் குழந்தைகளைக் காப்பாற்றி வாழவைத்துவந்தார். எவரேனும் தம் பெண்மகவைக் கொல்ல நாடினால் அவரிடம், “அவளைக் கொல்லாதே. அவளுடைய செலவுக்கு உன்னிடம் நான் பொறுப்பேற்கிறேன்” என்று சொல்லிவிட்டு, அந்தப் பெண் குழந்தையை (தாமே வளர்க்க) எடுத்துக்கொள்வார். அவள் வளர்ந்ததும் அவளுடைய தந்தையிடம் (சென்று), “நீ விரும்பினால் இவளை உன்னிடம் ஒப்படைத்துவிடுகிறேன்; நீ விரும்பினால் அவளது செலவுக்குப் பொறுப்பேற்று (பழையபடி நானே பராமரித்து)க்கொள்கிறேன்” என்று சொல்வார். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3829,
			"arabicnumber": 3829,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (நபியவர்களின் காலத்தில் குறைஷி யரால்) கஅபா (புதுப்பித்துக்) கட்டப்பட்ட போது நபி (ஸல்) அவர்களும் அப்பாஸ் (ரலி) அவர்களும் கற்களை(ச் சுமந்து) எடுத்து வந்துகொண்டிருந்தார்கள். அப்போது அப்பாஸ் (ரலி) அவர்கள் (சிறுவரான) நபி (ஸல்) அவர்களிடம், “உங்கள் கீழங்கியை (அவிழ்த்து) உங்கள் பிடரிக்குமேல் வைத்துக்கொள்ளுங்கள். கல்லி(ன் சுமையால் ஏற்படும் வலியி)லிருந்து அது உங்களைக் காக்கும்” என்று சொன்னார்கள். (நபி (ஸல்) அவர்கள் அப்படிச் செய்ய முனைந்தபோது) அவர்கள் பூமியில் (மூர்ச்சையாகி) விழுந்துவிட்டார்கள். அவர்களுடைய இரு கண்களும் வானத்தை நோக்கியபடி நிலைகுத்தி நின்றுவிட்டன. பிறகு மூர்ச்சை தெளிந்ததும், “என் கீழங்கி, என் கீழங்கி” என்று கேட்கலானார்கள். (கீழங்கி தரப்பட்ட) உடனே அதை இறுக்கமாகக் கட்டிக்கொண்டார்கள்.65 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3830,
			"arabicnumber": 3830,
			"text": "அம்ர் பின் தீனார் (ரஹ்) அவர்களும் உபைதுல்லாஹ் பின் அபீயஸீத் (ரஹ்) அவர்களும் கூறியதாவது: நபி (ஸல்) அவர்களுடைய காலத்தில் (இறையில்லமான) பைத்துல் ஹராமைச் சுற்றிலும் சுற்றுச்சுவர் இருந்ததில்லை.66 மக்கள் இறையில்லத்தைச் சுற்றிலும் தொழுதுவந்தார்கள். உமர் (ரலி) அவர் களுடைய ஆட்சிக் காலம் வந்தபோது அதைச் சுற்றிலும் சுறறுச் சுவர் கட்டி னார்கள். அறிவிப்பாளர் உபைதுல்லாஹ் (ரஹ்) அவர்கள், “அந்தச் சுவர் குட்டையாக இருந்தது. பிறகு அதை (அப்துல்லாஹ்) இப்னுஸ் ஸுபைர் (ரலி) அவர்கள் (உயர்த்திக்) கட்டினார்கள்” என்று கூறுகி றார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3831,
			"arabicnumber": 3831,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஆஷூரா (முஹர்ரம் பத்தாம்) நாள் என்பது அறியாமைக் காலத்தில் குறைஷி யர் நோன்பு நோற்கின்ற நாளாக இருந்துவந்தது. நபி (ஸல்) அவர்களும் அந்த நாளில் நோன்பு நோற்றுவந்தார்கள். நபி (ஸல்) அவர்கள் மதீனாவுக்குச் சென்ற போது அந்த நாளில் தாமும் நோன்பு நோற்று, நோன்பு நோற்கும்படி (முஸ்லிம் களுக்கு) உத்தரவுமிட்டார்கள். ரமளான் (நோன்பின் கட்டளை) வந்தபோது68 ஆஷூரா தினம், விரும்பி யவர்கள் நோன்பு நோற்கவும் செய்யலாம்; விரும்பாதவர்கள் நோன்பு நோற்காமலும் இருக்கலாம் என்ற நிலைக்கு வந்து விட்டது.69 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3832,
			"arabicnumber": 3832,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: “ஹஜ்ஜுடைய மாதங்களில் (ஹஜ் மட்டுமே செய்ய வேண்டும்; அம்மாதங் களில்) உம்ரா செய்வது பூமியில் நடக்கும் பாவகரமான செயல்களில் ஒன்று' என (அறியாமைக் கால) மக்கள் கருதிக் கொண்டிருந்தார்கள். (போரிடுவது தடை செய்யப்பட்ட நான்கு மாதங்களில் துல்கஅதா, துல்ஹிஜ்ஜா, முஹர்ரம் ஆகிய மூன்று மாதங்கள் தொடர்ந்து வந்ததால் சலிப்புற்று முஹர்ரம் மாதத்திற்கான தடையை அவர்கள் ஸஃபர் மாதத்திற்கு மாற்றி) ஸஃபருக்கு “முஹர்ரம்' என்று பெயர் சூட்டிவந்தார்கள். “(ஹஜ் பயணத்துக்கான சுமையைச் சுமந்த ஒட்டகங்களின் முதுகில்) வடு மறைந்து காலடித்தடங்கள் அழிந்து ஸஃபர் மாதம் கழிந்தால் உம்ரா செய்யலாம்; உம்ரா செய்பவர்” என்று கூறிவந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்களின் தோழர்களும் (துல்ஹிஜ்ஜா மாதம்) நான்காம் நாள் காலை, ஹஜ்ஜுக்காக இஹ்ராம் கட்டிக்கொண்டு (மதீனாவிலிருந்து) மக்கா நகருக்கு வந்தபோது நபி (ஸல்) அவர்கள், மக்கள் தம் இஹ்ராமை உம்ராவிற்குரியதாக மாற்றிக்கொள்ள வேண்டும் என்று கட்டளை யிட்டார்கள். அவர்கள், “அல்லாஹ்வின் தூதரே! (இவ்வாறு உம்ராவிற்குப் பிறகு) இஹ்ராமிóருந்து விடுபடுவதால் எந்தச் செயல்கள் அனுமதிக்கப்படும்?” எனக் கேட்டனர். அதற்கு, “(இஹ்ராம் கட்டிய வருக்கு விலக்கப்பட்டிருந்த) அனைத்து செயல்களும் அனுமதிக்கப்படும்”70 என நபி (ஸல்) அவர்கள் பதிலளித்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3833,
			"arabicnumber": 3833,
			"text": "ஹஸ்ன் பின் அபீவஹ்ப் அல் முஹாஜிரீ (ரலி) அவர்கள் கூறியதாவது: (இஸ்லாத்திற்கு முந்தைய) அறியா மைக் காலத்தில் (ஒருமுறை) பெருவெள்ளம் ஒன்று (பெருக்கெடுத்து) வந்து (மக்காவின்) இரு மலைகளையும் மூடிக்கொண்டது. இதை சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் தம் தந்தை முசய்யப் பின் ஹஸ்ன் (ரலி) அவர்களிடமிருந்து அறிவிக் கிறார்கள். சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகிறார்கள்: “இது பெரியதொரு நிகழ்ச்சியை விவரிக்கும் அறிவிப்பாகும்” என்று அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறுகிறார்கள்.71 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3834,
			"arabicnumber": 3834,
			"text": "கைஸ் பின் அபீஹாஸிம் (ரஹ்) அவர்கள் கூறியதாவது: அபூபக்ர் (ரலி) அவர்கள் “ஸைனப்' என்றழைக்கப்படும் “அஹ்மஸ்' குலத்துப் பெண்ணொருத்தியிடம் (அவளது இல்லத்துக்குச்) சென்றார்கள். அவளை (மௌன விரதம் பூண்டு) பேசாமலிருப்பவளாகக் கண்டார்கள். உடனே, “இவளுக்கென்ன ஆயிற்று? ஏன் பேசாமலிருக்கிறாள்?” என்று கேட்டார்கள். மக்கள், “(இவள் ஹஜ் செய்யும்வரை) எவருடனும் பேசமாட்டேன் என்று நேர்ச்சை செய்திருக்கிறாள்” என்று சொன்னார்கள். அபூபக்ர் (ரலி) அவர்கள் அவளிடம், “நீ பேசு. ஏனெனில் இ(வ்வாறு மௌனவிரதம் பூணுவ)து அனுமதிக்கப் பட்ட செயலன்று; இது அறியாமைக் காலச் செயலாகும்” என்று சொன்னார்கள். ஆகவே, அவள் (மௌன விரதத்தைக் கலைத்துப்) பேசினாள். “நீங்கள் யார்?” என்று கேட்டாள். அபூபக்ர் (ரலி) அவர்கள், “முஹாஜிர்களில் ஒருவன்” என்று பதிலளித் தார்கள். அப்பெண், “முஹாஜிர்களில் நீங்கள் எந்தக் குலத்தைச் சேர்ந்தவர்?” என்று கேட்க, அபூபக்ர் (ரலி) அவர்கள், “குறைஷிக் குலத்தைச் சேர்ந்தவன்” என்று பதிலளித்தார்கள். அப்பெண், “குறைஷி யரில் நீங்கள் எந்தக் குடும்பத்தைச் சேர்ந்தவர்?” என்று கேட்க, அபூபக்ர் (ரலி) அவர்கள், “நீ அதிகமாகக் கேள்வி கேட்கிறாயே? நான்தான் அபூபக்ர்” என்று பதிலளித்தார்கள். அப்பெண், “அறியாமைக் காலத்திற் குப் பிறகு எங்களிடம் வந்த இந்த (இஸ்லாம் எனும்) நல்ல நிலையில் நாங்கள் நீடித்து நிலைத்திருக்க வழி யாது?” என்று கேட்டாள். அபூபக்ர் (ரலி) அவர்கள், “உங்கள் தலைவர்கள் உங்களைச் சீராக நிர்வகித்து வரும்வரை அதில் நீங்கள் நீடித்து நிலைத்திருப்பீர்கள்” என்று பதிலளித்தார்கள். அந்தப் பெண், “அந்தத் தலைவர்கள் யார்?” என்று கேட்க, அபூபக்ர் (ரலி) அவர்கள், “உங்கள் சமுதாயத்தாருக்குக் கட்டளையிடவும், அதற்கு அவர்கள் கீழ்ப்படியவும் செய்கின்ற தலைவர்களும் முக்கியஸ்தர்களும் உங்களுக்கு இல்லையா?” என்று கேட்டார்கள். அதற்கு அந்தப் பெண், “ஆம், இருக்கிறார்கள்” என்று பதிலளித்தாள். அபூபக்ர் (ரலி) அவர்கள், “அவர்கள்தான் மக்களின் தலைவர்கள்” என்று சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3835,
			"arabicnumber": 3835,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஓர் அரபுக் கோத்திரத்திற்குச் சொந்த மான கறுப்பு (நிற அடிமைப்) பெண் ஒருத்தி இஸ்லாத்தை ஏற்றுக்கொண்டாள். அவளுக்குப் பள்ளிவாசலில் சிறிய (தங்கும்) அறையொன்று இருந்தது. அவள் எங்களிடம் வந்து பேசிக்கொண்டி ருப்பாள். அவள் பேசி முடிக்கும்போது, “அரை யணித் தோள்பட்டிகை72 (காணாமற் போன) நாள் எம் இறைவனின் விந்தை களில் ஒன்றாகும். அந்த நாள் இறைமறுப்பு (மேலோங்கி) இருந்த ஊரிலிருந்து என்னை (வெளியேற்றிக்) காப்பாற்றிவிட்டது” என்று பாடுவாள். இவ்வாறு அவள் அதிகமாகப் பாடுவதைக் கேட்ட நான், “அரையணித் தோள்பட்டிகை நாள் என்றால் என்ன?” என்று கேட்டேன். அதற்கு அவள் சொன்னாள்: என் (எஜமானியர்) குடும்பத்தாரில் ஒருவருக்குரிய சிறுமி ஒருத்தி (மணப் பெண்ணாக இருந்ததால்) பதனிடப்பட்ட தோலால் ஆன (சிவப்பு) அரையணித் தோள்பட்டிகை ஒன்றை அணிந்து கொண்டு (குளியலறைக்குச்) சென்றாள். அப்போது அந்தப் பட்டிகை (எதிர்பாராத விதமாக) அவளிடமிருந்து (கழன்று) விழுந்துவிட, அதைப் பருந்து ஒன்று இறைச்சி என்று நினைத்துக் கவ்வி எடுத்துச் சென்றுவிட்டது. (என் எஜமானர்கள் நான்தான் அதைத் திருடினேன் என்று) என்மீது குற்றம் சாட்டி என்னைச் சித்திரவதை செய்தார்கள். எந்த அளவுக்கென்றால், அவர்கள் என் பிறவி உறுப்பையும் சோதனையிட்டார்கள். அவர்கள் என்னைச் சூழ்ந்திருக்க, நான் கடும் வேதனையில் (துடித்தபடி) இருந்தபோது, அந்தப் பருந்து எங்கள் தலைகளுக்கு நேராக வந்து அந்தப் பட்டிகையை(க் கீழே) போட்டது. உடனே அதை அவர்கள் எடுத்துக்கொண்டனர். அப்போது நான் அவர்களிடம், “நான் குற்றமற்றவளாயிருக்க, நான் திருடிவிட் டதாக நீங்கள் குற்றம் சாட்டினீர்களே அந்தப் பட்டிகைதான் இது” என்று சொன்னேன்.73 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3836,
			"arabicnumber": 3836,
			"text": "இப்னு உமர் (ரலி) அவர்கள் அவர்கள் கூறியதாவது: “எவர் சத்தியம் செய்ய விரும்புகிறாரோ அவர் அல்லாஹ்வின் மீதே தவிர (வேறெவர்மீதும்) சத்தியம் செய்ய வேண்டாம்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். ஏனெனில், குறைஷியர் தம் முன்னோர்கள்மீது சத்தியம் செய்து வந்தார்கள். ஆகவே நபி (ஸல்) அவர்கள், “உங்கள் முன்னோர்கள்மீது சத்தியம் செய்யாதீர்கள்” என்று சொன்னார்கள்.74 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3837,
			"arabicnumber": 3837,
			"text": "அப்துர் ரஹ்மான் பின் அல்காசிம் (ரஹ்) அவர்கள் கூறியதாவது: (என் தந்தை) காசிம் (ரஹ்) அவர்கள் ஜனாஸாவுக்கு (பிரேதத்திற்கு) முன்னால் நடந்து செல்வார்கள். அதற்காக எழுந்து நிற்கமாட்டார்கள். மேலும், ஆயிஷா (ரலி) அவர்களிடமிருந்து இப்படியும் அறிவிப்பார்கள்: ஜனாஸாவுக்காக எழுந்து நிற்பதும் அதைக் கண்டால், “(உன் வாழ்நாளில்) நீ எப்படி இருந்தாயோ அப்படியே இப்போதும் இருப்பாய்” என்று இருமுறை கூறுவதும் அறியாமைக் கால மக்களின் வழக்கமாகும்.75 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3838,
			"arabicnumber": 3838,
			"text": "உமர் (ரலி) அவர்கள் கூறிய தாவது: (ஹஜ்ஜின்போது) “ஸபீர்' மலைமீது சூரியன் ஒளிராதவரை, இணைவைப்பாளர் கள் முஸ்தலிஃபாவைவிட்டுப் புறப்பட மாட்டார்கள். அவர்களுக்கு நபி (ஸல்) அவர்கள் மாறு செய்து சூரியன் உதிக்கும் முன்பாகப் புறப்பட்டார்கள்.76 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3839,
			"arabicnumber": 3839,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர் களின் முன்னாள் அடிமையான) இக்ரிமா (ரஹ்) அவர்கள் கூறியதாவது: திருக்குர்ஆனில் (78:34ல்) இடம் பெற்றுள்ள “கஃஸன் திஹாக்கன்' (நிரம் பிய கிண்ணமும்) என்பதற்கு “(தீரத் தீரத்) தொடர்ந்து நிரம்பிக்கொண்டிருக்கக்கூடிய கிண்ணமும் (சொர்க்கத்தில் உண்டு)' என்பது பொருளாகும். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3840,
			"arabicnumber": 3840,
			"text": "மேலும் இப்னு அப்பாஸ் (ரலி) அவர்கள், “என் தந்தை (அப்பாஸ் (ரலி) அவர்கள் இஸ்லாத்தில் இணைவதற்கு முன் அவர்களது) அறியாமைக் காலத்தில் “எங்களுக்குத் தொடர்ந்து நிரம்பும் கிண்ணத்(திலிருப்ப)தை அருந்தச்செய்' என்று (தம் பணியாளரிடம்) கூற நான் கேட்டேன்” எனச் சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3841,
			"arabicnumber": 3841,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (கவிஞர்) லபீத் அவர்கள்77 சொன்ன, “இதோ (பாருங்கள்)! அல்லாஹ்வைத் தவிர மற்றப் பொருள்கள் அனைத்துமே அழியக்கூடியவையே” எனும் சொல்தான், கவிஞர் சொன்ன சொற்களிலேயே மிக உண்மையான சொல்லாகும். (கவிஞர்) உமய்யா பின் அபிஸ்ஸல்த்78 (தம் கவிதை யின் கருத்துகளால்) இஸ்லாத்தை ஏற்கும் அளவுக்கு வந்துவிட்டார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3842,
			"arabicnumber": 3842,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: அபூபக்ர் (ரலி) அவர்களுக்கு அடிமை ஒருவன் இருந்தான். அவன் (அடிமை என்ற முறையில் தன் எசமானாகிய) அபூபக்ர் (ரலி) அவர்களுக்கு(த் தனது சம்பாத்தியத்தில்) நிர்ணயிக்கப்பட்ட தொகையைச் செலுத்திவந்தான். அபூபக்ர் (ரலி) அவர்கள் அவன் செலுத்தும் தொகையிலிருந்து உண்டுவந்தார்கள். ஒருநாள் அவன் ஏதோ ஒரு பொருளைக் கொண்டு வந்தான். அதிலிருந்து அபூபக்ர் (ரலி) அவர்கள் சிறிது உண்டார்கள். அப்போது அவர்களி டம் அந்த அடிமை, “இது என்ன என்று உங்களுக்குத் தெரியுமா?” என்று கேட்டான். அபூபக்ர் (ரலி) அவர்கள், “இது என்ன?” என்று கேட்டார்கள். அவன், “நான் அறியாமைக் காலத்தில் ஒரு மனிதருக்குக் குறி சொல்லிவந்தேன்; எனக்கு நன்றாகக் குறி சொல்லத் தெரியாது. ஆயினும், (குறி சொல்லத் தெரிந்தவன் போல் நடித்து) அவரை நான் ஏமாற்றி விட்டேன். அவர் அதற்காக எனக்குக் கூலி கொடுத்தார். நீங்கள் உண்டது (குறி சொன்னதற்காக) எனக்குக் கூலியாகக் கிடைத்த அந்தப் பொருளிலிருந்துதான்” என்று சொன்னான். உடனே அபூபக்ர் (ரலி) அவர்கள் தம் கையை (வாய்க்குள்) நுழைத்துத் தம் வயிற்றிலிருந்த அனைத்தையும் வாந்தி யெடுத்துவிட்டார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3843,
			"arabicnumber": 3843,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அறியாமைக் கால மக்கள் ஹபலுல் ஹபலாவுக்காக - கருவிலுள்ள ஒட்டகக் குட்டி பிறந்து அந்தக் குட்டி சுமந்து பெறவிருக்கும் குட்டிக்காக- ஒட்டகத்தின் இறைச்சிகளை விற்றுவந்தார்கள். நபி (ஸல்) அவர்கள் இத்தகைய வியாபாரம் செய்யக் கூடாது என்று அவர்களுக்குத் தடை விதித்தார்கள்.79 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3844,
			"arabicnumber": 3844,
			"text": "ஃகைலான் பின் ஜரீர் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம் செல்வோம். அவர்கள் அன்சாரிகளைக் குறித்து எங்களிடம் பேசுவார்கள். அவர்கள், “(அறியாமைக் காலத்தில்) உங்கள் (அன்சாரி) சமுதாயத்தார் இன்ன இன்ன நாளில் இப்படி இப்படியெல்லாம் செய்துவந்தார்கள். (அறியாமைக் காலத்தில்) உங்கள் (அன்சாரி) சமுதாயத்தார் இன்ன இன்ன நாளில் இப்படி இப்படியெல்லாம் செய்துவந்தார்கள்” என்று என்னிடம் சொல்வார்கள்.80 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அறியாமைக் காலத்தில் நடைபெற்ற முதல் “கசாமா' (எனும் சத்தியம் தொடர்பான சட்டத்தின் அடிப்படையில் தீர்ப்பு வழங்கப்பட்ட சம்பவம்) எங்கள் பனூ ஹாஷிம் குலத்தாரிடையேதான் நிகழ்ந்தது. (அதன் விவரம் வருமாறு:) பனூ ஹாஷிம் குலத்தில் (அம்ர் பின் அல்கமா என்று) ஒருவர் இருந்தார். அவரைக் குறைஷியரில் மற்றொரு கிளையைச் சேர்ந்த (கிதாஷ் பின் அப்தில்லாஹ் என்ற) ஒருவர் கூலிக்கு அமர்த்திக்கொண்டார். அந்தக் கூலிக்காரர் தம் முதலாளியுடன் அவ ருடைய ஒட்டகத்தில் (வாணிபக் குழுவின ருடன் ஷாம் நோக்கிச்) சென்றார். அப்போது பனூ ஹாஷிம் குலத்தைச் சேர்ந்த இன்னொருவர் அந்தக் கூலிக் காரரின் அருகே சென்றுகொண்டிருந்தார். அந்த பனூ ஹாஷிம் குலத்தாருடைய (ஒட்டகத்தின் இரு பக்கங்களிலும் தொங்கவிடப்படும்) பையின் பிடி அறுந்துவிட்டிருந்தது. அவர் அந்தக் கூலிக்காரரைப் பார்த்து, “எனது ஒட்டகம் தப்பியோடாமல் இருக்க, (அறுந்துபோன) எனது பையின் பிடியை (இணைத்து)க் கட்டுவதற்கு ஒரு கயிறு தந்து எனக்கு உதவி செய்யுங்கள்” என்று கூறினார். அந்தக் கூலியாள் அவருக்கு ஒரு கயிறு கொடுத்தார். உடனே அவர், அதன் மூலம் தனது பையின் பிடியை (இணைத்து)க் கட்டிக்கொண்டார். அவர்கள் அனைவரும் (ஓய்வெடுப்பதற்காக ஓரிடத்தில்) தங்கியபோது எல்லா ஒட்டகங்களும் (அவற்றுக்குரிய கயிறுகளால்) கட்டிப்போடப்பட்டன. ஒரேயோர் ஒட்டகம் மட்டும் (அதன் கயிற்றை பனூ ஹாஷிம் குலத்தாருக்கு அந்தக் கூலிக்காரர் கொடுத்துவிட்டிருந்ததால்) கட்டிப்போடப்படாமல் இருந்தது. அப்போது (கூலிக்காரரை நோக்கி) அந்தக் குறைஷி (முதலாளி), “இந்த ஒட்டகத்திற்கென்ன? பிற ஒட்டகங்களுக்கிடையே இது மட்டும் ஏன் கட்டிப்போடப்படவில்லை?” என்று கேட்டார். அதற்கு அந்தக் கூலிக்காரர், “அதற்குக் கயிறு இல்லை” என்று கூறினார். முதலாளி, “(ஏன்?) அதன் கயிறு எங்கே (போனது)?” என்று கேட்டார். பிறகு அந்தக் கூலிக்காரரின் மீது (கோபம் கொண்டு) ஒரு தடியை (எடுத்து) எறிந்தார். அந்த அடியே அந்தக் கூலிக்காரரின் மரணத்திற்குக் காரணமாக அமைந்தது. அப்போது (அடிபட்டுக் குற்றுயிராய்க் கிடந்த) அந்தக் கூலிக்காரரை யமன் நாட்டைச் சேர்ந்த ஒரு மனிதர் கடந்து சென்றார். அவரை நோக்கி (அந்தக் கூலிக்காரர்), “ஹஜ் பருவத்தில் நீங்கள் (ஹஜ்ஜில்) கலந்துகொள்வீர்களா?” என்று கேட்டார். அந்த வழிப்போக்கர், “நான் கலந்துகொள்ளமாட்டேன். ஒருகால் நான் கலந்துகொள்ளவும் செய்யலாம்” என்று கூறினார். அந்தக் கூலிக்காரர், “என் சார்பாக ஒரு செய்தியை எப்போதாவது (நான் சொல்லும் குலத்தாரிடம்) தெரிவித்து விடுவாயா?” என்று கேட்டார். அதற்கு அவர், “ஆம் (செய்கிறேன்)” என்று கூறினார். உடனே அந்தக் கூலிக்காரர், “நீ ஹஜ் பருவத்தில் கலந்து கொண்டால் “குறைஷிக் குலத்தாரே!' என்று கூப்பிடு! அவர்கள் பதிலளித்தால் உடனே (குறைஷிக் கிளையான) “பனூ ஹாஷிம் குலத்தாரே!' என்று கூப்பிடு! அவர்கள் உனக்குப் பதிலளித்தால் (பனூ ஹாஷிம் குடும்பத் தலைவரான) “அபூதாலிப்' பற்றி விசாரி! (அவரைச் சந்தித்து) அவரிடம், “இன்னான் ஒரு கயிற்றுக்காக என்னைக் கொன்றுவிட்டான்' என்று தெரிவித்துவிடு” என்று கூறினார். பிறகு அந்தக் கூலிக்காரர் இறந்தும்விட்டார். அவரைக் கூலிக்கு அமர்த்திச் சென்ற அந்த குறைஷி முதலாளி (மக்காவிற்குத்) திரும்பி வந்தபோது அவரிடம் அபூதாலிப் வந்து, “(கூலிக்காரரான) எங்கள் ஆள் என்ன ஆனார்?” என்று கேட்டார். “அவர் நோய்வாய்ப்பட்டார். அவரை நல்ல முறையில் நான் கவனித்துவந்தேன். (ஆனாலும் அவர் இறந்துவிட்டார்.) அவரை அடக்கம் செய்யும் பொறுப்பையும் நானே ஏற்றுக்கொண்டேன்” என்று கூறினார். “உம்மிடமிருந்து (இந்த உதவிகளைப் பெறுவதற்கு) அவர் தகுதியானவரே” என்று அபூதாலிப் கூறினார். பின்னர் சிறிது காலம் கழிந்தது. தன்னைப் பற்றிய செய்தியைத் தெரிவித்து விடும்படி அந்தக் கூலிக்காரர் இறுதி உபதேசம் செய்து அனுப்பிய (யமன் நாட்டைச் சேர்ந்த) அந்த மனிதர் ஹஜ் பருவத்தில் (ஹஜ்ஜுக்கு) வந்தார். அவர், “குறைஷிக் குலத்தாரே!' என்று அழைத்தார். “(சிலரைக் காட்டி) இவர்கள்தான் குறைஷியர்” என்று மக்கள் கூறினார்கள். “பனூ ஹாஷிம் குலத்தாரே!' என்று அவர் அழைத்தார். “இவர்கள்தான் பனூ ஹாஷிம் குலத்தார்” என்று மக்கள் தெரிவித்தனர். அவர், “அபூதாலிப் எங்கே?” என்று கேட்டார். “இவர்தான் அபூதாலிப்” என்று மக்கள் சொன்னார்கள். “ஒரு கயிற்றுக்காக இன்ன மனிதன் என்னைக் கொன்றுவிட்டான் என்ற செய்தியை உங்களிடம் தெரிவித்துவிடும்படி இன்ன மனிதர் எனக்கு உத்தரவிட்டார்” என்று அவர் (அபூதாலிடம்) கூறினார். அந்த முதலாளியிடம் அபூதாலிப் சென்று, “எங்களிடமிருந்து மூன்றில் ஒன்றைத் தேர்ந்தெடுத்துக்கொள்” என்று கூறி(விட்டு அறியாமைக்கால வழக்கப்படி பின்வருமாறு சொன்)னார்: 1. நீ விரும்பி னால், எங்கள் ஆளை நீ கொலை செய்த தற்காக (நமது மரபுப்படி) நூறு ஒட்டகத்தை (நஷ்ட ஈடாகச்) செலுத்தலாம். 2. நீ விரும்பி னால் உன் சமுதாயத்திலிருந்து ஐம்பது பேர் “நீ அவரைக் கொலை செய்யவில்லை' என்று சத்தியம் செய்யலாம். 3. (இந்த இரண்டையும் செய்ய) நீ மறுத்தால் உன்னை நாங்கள் அவருக்குப் பதிலாகக் கொன்றுவிடுவோம்” (என்று கூறினார்.) அந்த குறைஷி (முதலாளி) தம் சமுதாயத்தாரிடம் சென்றார். அப்போது அவர்கள், “நாங்கள் சத்தியம் செய்கிறோம்” என்று கூறினர். அபூதாலிபிடம் பனூ ஹாஷிம் குலத்தைச் சேர்ந்த ஒரு பெண்82 வந்தாள். பனூ ஹாஷிம் குலத்(தில் கொலையாளியின் குடும்பத்)தைச் சேர்ந்த ஒருவருடைய மனைவியாக அவள் இருந்தாள். அவருக்காக ஒரு குழந்தையையும் அவள் பெற்றெடுத்திருந்தாள். அவள் கூறினாள்: “அபூதாலிப் அவர்களே! (சத்தியம் செய்ய வேண்டிய) ஐம்பது பேர்களில் இந்த என் மகனும் ஒருவனாக இருக்க அனுமதிக்க வேண்டும் என விரும்புகிறேன். ஆனால், சத்தியம் மேற்கொள்ளப்படும் (கஅபாவிலுள்ள ருக்ன்- மகாமு இப்ராஹீம் இடையிலான) இடத்தில் இவனைச் சத்தியம் செய்யும்படி கட்டாயப்படுத்தாதீர்கள்.” (அவளது கோரிக்கைப்படி) அபூதாலிப் செயல் பட்டார். அப்போது பனூ ஹாஷிம் குலத்தாரில் (கொலையாளியின் குடும்பத்தைச் சேர்ந்த) இன்னொரு மனிதரும் வந்து, “அபூதாலிப் அவர்களே! (கொலைக் குற்றத்திற்குப் பரிகாரமாகத் தரப்படும்) நூறு ஒட்டகங் களுக்குப் பதிலாக ஐம்பது ஆண்கள் சத்தியம் செய்ய வேண்டுமென்று நீங்கள் விரும்பினீர்கள். ஒவ்வோர் ஆணுக்கும் இரண்டு ஒட்டகங்கள் (விகிதம்) வரும். இதோ, இந்த இரண்டு ஒட்டகங்களை எனக்காக ஏற்றுக்கொள்ளுங்கள். சத்தியம் செய்யுமாறு (அவர்களை) நீங்கள் கட்டாயப் படுத்தும்போது என்னையும் கட்டாயப் படுத்தாதீர்கள்” என்று கூறினார். அந்த இருவரது கோரிக்கையையும் அபூதாலிப் ஏற்றுக்கொண்டார். ஆக, நாற்பத்தெட்டுப் பேர் வந்து, (“எங்கள் குலத்தைச் சேர்ந்த கிதாஷ், கொலை செய்யப்பட்டவரின் உயிரீட்டுத் தொகை யைச் செலுத்த வேண்டிய பொறுப்பிலிருந்து விடுபட்டுவிட்டார்” என்று) சத்தியம் செய்தனர். அறிவிப்பாளர் இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறுகிறார்கள்: என் உயிர் எவன் கையிலுள்ளதோ அவன் மீதாணையாக! (அவர்கள் சத்தியம் செய்து) ஓராண்டுகூடக் கழியவில்லை; அதற்குள் (பொய்ச் சத்தியம் செய்த) அந்த நாற்பத்தெட்டுப் பேரும் மாண்டனர். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3846,
			"arabicnumber": 3846,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: “புஆஸ்' போர் நாள், தன் தூதருக்காக அல்லாஹ் (சாதகமான சூழ்நிலையை உருவாக்கும் வகையில்) முன்கூட்டியே நிகழ்த்திக் காட்டிய நாளாகும். மதீனாவாசிகளின் கூட்டமைப்பு (குலைந்து) பிளவுபட்டிருந்த நிலையிலும், அவர்களில் முக்கியப் பிரமுகர்கள் கொல்லப்பட்டும் காயமுற்றும் இருந்த நிலையிலும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அங்கு) வருகை புரிந்தார்கள். ஆகவே, மக்கள் இஸ்லாத்தை ஏற்க (ஏதுவான சூழ்நிலையை உருவாக்குவதற் காக) அல்லாஹ்தான், தன் தூதர் (ஸல்) அவர்களுக்குச் சாதகமாக அந்த நாளை முன்கூட்டியே நிகழச்செய்தான்.83 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3847,
			"arabicnumber": 3847,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: “ஸஃபா' மற்றும் “மர்வா' (குன்றுகளுக்கு) இடையே பள்ளத்தாக்கின் மையப்பகுதியில் (வேகமாகத்) தொங்கோட்டம் ஓடுவது நபிவழியன்று. அறியாமைக் காலத்தவர்தான் அவ்வாறு (வேகமாகத்) தொங்கோட்டம் ஓடிவந்தனர்; மேலும், அவர்கள், “நாங்கள் அந்தப் பள்ளத்தாக்கை வேகமாகவே கடப்போம்” என்று கூறியும் வந்தார்கள்.84 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3848,
			"arabicnumber": 3848,
			"text": "அபுஸ்ஸஃபர் (ரஹ்) அவர்கள் கூறியதாவது: இப்னு அப்பாஸ் (ரலி) அவர்கள், “மக்களே! நான் உங்களுக்குச் சொல்வதை என்னிடமிருந்து (காது கொடுத்துக் கவன மாகக்) கேளுங்கள். நீங்கள் சொல்வதை நான் (கவனமாகக்) கேட்க விடுங்கள். (என்னிடமிருந்து அரைகுறையாகக் கேட்டுக்கொண்டு)போய், “இப்னு அப்பாஸ் சொன்னார்; இப்னு அப்பாஸ் சொன்னார்” என்று (தப்பும் தவறுமாகச்) சொல்லாதீர்கள். இறையில்லம் கஅபாவைச் சுற்றி (தவாஃப்) வருபவர் “ஹிஜ்ர்' எனும் (வளைந்த) பகுதிக்கு அப்பாலிருந்து சுற்றட்டும்! “அல்ஹத்தீம்' என்று (அதற்குப்) பெயர் சொல்லாதீர்கள். ஏனெனில், அறியாமைக் காலத்தில் ஒரு மனிதர் சத்தியம் செய்துவிட்டு (சத்தியம் செய்ததற்கு அடையாளமாக) தமது சாட்டையையோ, தமது செருப் பையோ, தமது வில்லையோ அங்கே போட்டுவிடுவார் (அதனால்தான் அதற்கு “ஹத்தீம்' (வீழ்த்தக் கூடியது) என்ற பெயர் வந்தது)” என்று சொல்வதை நான் கேட்டேன். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3849,
			"arabicnumber": 3849,
			"text": "அம்ர் பின் மைமூன் (ரஹ்)85 அவர்கள் கூறியதாவது: அறியாமைக் காலத்தில் விபசாரம் புரிந்த பெண்குரங்கொன்றைக் குரங்குகள் பல சூழ்ந்துகொண்டு கல்லெறிந்து தண்டிப்பதை நான் கண்டேன். நானும் அவற்றுடன் சேர்ந்துகொண்டு அதன் மீது கல்லெறிந்தேன். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3850,
			"arabicnumber": 3850,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: பிறர் வமிசத்தைக் குறைகூறுவதும் ஒப்பாரிவைத்து அழுவதும் அறியாமைக் காலத்துப் பண்புகளாகும். -அறிவிப்பாளர் உபைதுல்லாஹ் பின் அபீயஸீத் (ரஹ்) அவர்கள் மூன்றாவது பண்பொன்றை மறந்துவிட்டார்கள்- “நட்சத்திரங்களால்தான் எங்களுக்கு மழை பெய்தது என்று சொல்வதே (இறைவனுக்கு இணை கற்பிக்கும்) அந்த மூன்றாவது பண்பாகும்” என சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகிறார்கள்.86 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3851,
			"arabicnumber": 3851,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நாற்பது வயதுடையவர்களாக இருக்கும் போது அவர்களுக்கு (வஹீ எனும்) வேத அறிவிப்பு அருளப்பெற்றது. அதன் பிறகு அவர்கள் மக்கா நகரில் பதிமூன்றாண்டு கள் தங்கியிருந்தார்கள். பிறகு, (இறை மார்க்கத்திற்காகப் புலம்பெயர்ந்து) ஹிஜ்ரத் செய்யும்படி அவர்களுக்குக் கட்டளை யிடப்பட்டது. ஆகவே, அவர்கள் மதீனா வுக்கு (புலம்பெயர்ந்து) ஹிஜ்ரத் சென்றார் கள்; அங்கே பத்தாண்டுகள் தங்கினார்கள்; பிறகு இறந்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3852,
			"arabicnumber": 3852,
			"text": "கப்பாப் (பின் அல்அரத் -ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் கஅபாவின் நிழலில் ஒரு சால்வையைத் தலையணை யாக வைத்து சாய்ந்துகொண்டிருக்க, நான் அவர்களிடம் சென்றேன். அப்போது நாங்கள் இணைவைப்பவர்களால் கடும் துன்பங்களைச் சந்தித்திருந்தோம். ஆகவே, நான், “அல்லாஹ்வின் தூதரே! எங்களுக்காக நீங்கள் அல்லாஹ்விடம் பிரார்த்திக்கமாட்டீர்களா?” என்று கேட்டேன். உடனே அவர்கள் முகம் சிவந்துபோய், (எழுந்து) உட்கார்ந்துகொண்டு சொன்னார்கள்: உங்களுக்குமுன் (இந்த ஓரிறை மார்க்கத்தைத் தழுவி) இருந்தவர் (பழுக்கக் காய்ச்சிய) இரும்புச் சீப்புகளால் கோதப்பட்டு (கொடுமைப்படுத்தப்பட்டு) வந்தார். அது அவரது எலும்புகளையும் கடந்து சென்று அதன் கீழுள்ள சதையையும் நரம்பையும் அடைந்துவிடும். (ஆனால்,) அ(ந்தக் கொடுமையான)து அவரை அவரது மார்க்கத்திலிருந்து (திசை) திருப்பிவிடவில்லை. மேலும், அவருடைய தலையின் வகிட்டில் ரம்பம் வைக்கப்பட்டு இரு கூறுகளாக அவர் பிளக்கப்படுவார். ஆனால், அதுவும் அவரை அவருடைய மார்க்கத்திருந்து திருப்பிவிடவில்லை. நிச்சயம் அல்லாஹ் இந்த மார்க்கத்தை முழுமைப்படுத்தியே தீருவான். எந்த அளவுக்கென்றால், (தன் வாகனத்தில்) சவாரி செய்து வரும் ஒருவன், (யமன் நாட்டிலுள்ள) “ஸன்ஆ'விலிருந்து “ஹள்ரமவ்த்'வரை பயணம் செய்து செல்வான். (வழியில்) அவனுக்கு அல்லாஹ்வைப் பற்றிய அச்சத்தைத் தவிர வேறெந்த அச்சமும் இருக்காது. மற்றோர் அறிவிப்பில், “தன் ஆடுகள் விஷயத்தில் ஓநாய் பற்றிய அச்சத்தையும் தவிர” என்னும் வாக்கியத்தை பயான் (ரஹ்) அவர்கள் கூடுதலாக அறிவித்துள் ளார்கள்.88 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3853,
			"arabicnumber": 3853,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மக்காவில்) “அந்நஜ்ம்' எனும் (53ஆவது) அத்தியாயத்தை ஓதினார்கள். (ஓதி முடித்த) பிறகு (இறுதியில் ஓதலுக்குரிய) சஜ்தா செய்தார்கள். அப்போது (அங்கிருந்த) யாவரும் சிரவணக்கம் செய்யாமல் இருக்கவில்லை; ஒரேயொரு மனிதரைத் தவிர. அவர் (தரையில் சிரம்பணியாமல்) ஒரு கைப்பிடியளவு சிறு கூழாங்கற்களை எடுத்து (முகத்தருகே) உயர்த்தி (அப்படியே) அதன்மீது சஜ்தா செய்து, “இது எனக்குப் போதும்” என்று சொல்லிக்கொண்டிருந்ததை நான் கண்டேன். பின்னால், அவர் அல்லாஹ்வை மறுத்தவராகக் கொல்லப்பட்டதையும் நான் பார்த்தேன்.89 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3854,
			"arabicnumber": 3854,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ஒருமுறை (கஅபா அருகில்) நபி (ஸல்) அவர்கள் (தொழுது) சிரவணக்கம் (சஜ்தா) செய்துகொண்டிருக்க, அவர்களைச் சுற்றிலும் குறைஷியரில் சிலர் இருந்தனர். அப்போது (குறைஷித் தலைவன்) உக்பா பின் அபீமுஐத், ஒட்டகக் கருவைச் சுற்றியுள்ள மெல்லிய சவ்வைக் கொண்டுவந்து, நபி (ஸல்) அவர்களின் முதுகின் மீது எறிந்தான். நபி (ஸல்) அவர்கள் தம் தலையை உயர்த்தவில்லை. உடனே ஃபாத்திமா (ரலி) அவர்கள் வந்து, அதை நபி (ஸல்) அவர்களின் முதுகிலிருந்து எடுத்துவிட்டு, அதைச் செய்தவனுக் கெதிராகப் பிரார்த்தித்தார்கள். பின்னர் நபி (ஸல்) அவர்கள், “இறைவா! குறைஷித் தலைவர்களான அபூஜஹ்ல் பின் ஹிஷாம், உத்பா பின் ரபீஆ, ஷைபா பின் ரபீஆ, “உமய்யா பின் கலஃப்' அல்லது “உபை பின் கலஃப்' ஆகியோரை நீ கவனித்துக்கொள்” என்று பிரார்த்தித்தார்கள். (அதன்படியே) இவர்கள் அனைவரும் பத்ர் போரில் கொல்லப்பட்டு ஒரு (பாழுங்)கிணற்றில் போடப்பட்டிருக்கக் கண்டேன்; “உமய்யா பின் கலஃப்' அல்லது “உபை'யைத் தவிர. அவனுடைய மூட்டுகள் துண்டாகி (தனித்தனியாகி)விட்டிருந்த காரணத்தால் அவன் மட்டும் கிணற்றில் போடப்படவில்லை. உமய்யா பின் கலஃப் அல்லது உபை பின் கலஃப் (இந்த இருவரில் நபி (ஸல்) அவர்கள் யாரைச் சொன்னார்கள்) என்று சந்தேகப்படுபவர் அறிவிப்பாளர்களில் ஒருவரான ஷுஅபா (ரஹ்) அவர்களா வார்.90 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3855,
			"arabicnumber": 3855,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: அப்துர் ரஹ்மான் பின் அப்ஸா (ரலி) அவர்கள், “(தக்க காரணமின்றிக் கொல்வதைத் தடை செய்து) “அல்லாஹ் கண்ணியத்திற்குரியதாக்கிய எந்த ( மனித) உயிரையும் நியாயமின்றி கொலை செய்யாதீர்கள்' எனும் இந்த (6:151, 17:33) இரு (குர்ஆன்) வசனங்களுக்கும், “ஓர் இறைநம்பிக்கையாளரை ஒருவன் வேண்டுமென்றே கொலை செய்துவிட்டால் அவனுக்குரிய தண்டனை நரகமாகும். மறுமை நாளில் அவனுக்கு இரு மடங்கு தண்டனை அளிக்கப்படும். என்றென்றும் இழப்புக்குரியவனாய் அவன் அதில் வீழ்ந்து கிடப்பான்' எனும் (4:93) வசனத்திற்கும் இடையே இணக்கமான கருத்துக் காண்பது எப்படி என்று இப்னு அப்பாஸ் (ரலி) அவர்களிடம் நீ கேள்” என்று எனக்குக் கட்டளையிட்டார்கள்.91 நான் (சென்று) இப்னு அப்பாஸ் (ரலி) அவர்களிடம் கேட்டேன். அவர்கள், “திருக்குர்ஆனில், “கருணையாளனின் உண்மையான அடியார்கள் எத்தகை யவர்கள் எனில், ...(தக்க காரணமின்றி கொல்லக் கூடாதென்று தடை செய்து) அல்லாஹ் கண்ணியத்திற்குரிய தாக்கியுள்ள மனித உயிரை நியாயத்துடனே தவிர கொல்லமாட்டார்கள்...' எனும் அத்தியாயம் அல்ஃபுர்கானின் 68ஆம் வசனம் அருளப்பட்டபோது மக்காவாசி களில் இணைவைப்போராயிருந்தவர்கள், “அல்லாஹ் கண்ணியத்திற்குரியதாய் ஆக்கிய மனித உயிரை நாங்கள் கொன்றிருக்கிறோம்; அல்லாஹ்வுடன் மற்ற தெய்வத்தையும் அழைத்திருக்கிறோம்; மேலும், தீய செயல்களையும் செய்திருக்கிறோம் (நாங்கள் நரகத்தில்தான் வீழ்ந்து கிடக்க வேண்டுமா? எங்களுக்கு இஸ்லாம் எப்படிப் பயன் தரும்?)” என்று சொன்னார்கள். அப்போது அல்லாஹ், “பாவமன்னிப்புக் கோரி நம்பிக்கை கொண்டு நற்செயலும் புரிகின்றவர் தவிர! இத்தகையோரின் தீமைகளை அல்லாஹ் நன்மைகளாக மாற்றிவிடுவான். மேலும், அவன் பெரும் மன்னிப்பாளனும் கிருபையாளனும் ஆவான்” எனும் (25:70ஆம்) வசனத்தை அருளினான். இது குற்றம் புரிந்த இறைமறுப்பாளர்களுக்கான சட்டமாகும். அத்தியாயம் அந்நிசாவில் (93ஆம் வசனத்தில்) கூறப்பட்டிருப்பது, இஸ்லாத்தையும் அதன் சட்ட திட்டங்களையும் அறிந்த (முஸ்லிமான) ஒரு மனிதன் விஷயத்தில் ஆகும். அவன் அறிந்த பிறகும் எவரையாவது வேண்டுமென்றே கொலை செய்துவிட்டால் அவனுக்குரிய தண்டனை நரகமாகும். அதில் அவன் நிரந்தரமாக விழுந்து கிடப்பான்” என்று பதிலளித்தார்கள்.92 அப்துர் ரஹ்மான் பின் அப்ஸா (ரலி) அவர்கள் கூறுகிறார்கள்: நான் இப்னு அப்பாஸ் (ரலி) அவர் களின் இந்தக் கருத்தை முஜாஹித் (ரஹ்) அவர்களிடம் சொன்னேன். அதற்கு அவர்கள், “தன் குற்றத்திற்காக வருந்தி (பாவமன்னிப்புக் கோரி)யவனைத் தவிர (மற்றவர்கள்தான் நிரந்தரமாக நரகம் புக வேண்டியிருக்கும்)” என்று பதிலளித் தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3856,
			"arabicnumber": 3856,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்களிடம், “இணை வைப்பாளர்கள் நபி (ஸல்) அவர்களுக்கு இழைத்த துன்பங்களிலேயே மிகக் கடுமை யானது எது என்று எனக்கு அறிவியுங்கள்” என்று கேட்டேன். அவர்கள், “நபி (ஸல்) அவர்கள் கஅபாவின் “ஹிஜ்ர்' பகுதியில் தொழுதுகொண்டிருந்தபோது, உக்பா பின் அபீமுஐத் என்பவன் முன்னோக்கி வந்து, தன் துணியை நபி (ஸல்) அவர்களின் கழுத்தில் வைத்து (முறுக்கி), அவர்கள் மூச்சுத் திணறும்படி (அவர்களின் கழுத்தைக்) கடுமையாக நெறித்தான். அப்போது அபூபக்ர் (ரலி) அவர்கள் முன்னால் வந்து அவனது தோளைப் பிடித்து நபி (ஸல்) அவர்களைவிட்டு விலக்கினார்கள். மேலும், “என் இறைவன் அல்லாஹ்தான் என்று சொல்கிறார் என்பதற்காகவா ஒரு மனிதரை நீங்கள் கொல்கிறீர்கள்?” (40:28) என்று கேட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. மேலும், இதே ஹதீஸ் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்களிடமிருந்தும் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.93 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3857,
			"arabicnumber": 3857,
			"text": "அம்மார் பின் யாசிர் (ரலி) அவர்கள் கூறியதாவது: (இஸ்லாத்தின் ஆரம்பக் காலத்தில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஐந்து அடிமைகளும் இரண்டு பெண்களும் (அடிமையல்லாத ஆண்களில்) அபூபக்ர் (ரலி) அவர்களும் மட்டுமே இருக்கக் கண்டேன்.95 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3858,
			"arabicnumber": 3858,
			"text": "சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் கூறியதாவது: சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள், “நான் இஸ்லாத்தை ஏற்ற நாளில்(தான் மற்றவர்களும் இஸ்லாத்தை ஏற்றனர். அந்நாளில்) தவிர, (அதற்கு முன்பு) வேறெவரும் இஸ்லாத்தை ஏற்றிடவில்லை. நான் இஸ்லாத்தில் மூன்றிலொரு பாகமாக ஏழு நாட்கள் (வரை) இருந்தேன்” என்று சொல்லக் கேட்டேன்.96 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3859,
			"arabicnumber": 3859,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களின் மகன் அப்துர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: நான் மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்களிடம், “ஜின்கள் குர்ஆனைச் செவியுற்ற அந்த இரவில் ஜின்களும் அங்கு இருந்தார்கள் என்பதை நபி (ஸல்) அவர்களுக்குத் தெரிவித்தவர் யார்?” என்று கேட்டேன். அதற்கு மஸ்ரூக் (ரஹ்) அவர்கள், “ஒரு மரம்தான் நபி (ஸல்) அவர்களிடம் ஜின்களைப் பற்றித் தெரிவித் ததாக உங்கள் தந்தை இப்னு மஸ்ஊத் (ரó) அவர்கள் என்னிடம் கூறினார்கள்” என்று பதிலளித்தார்கள்.99 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3860,
			"arabicnumber": 3860,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அங்கத் தூய்மை செய்யும் தண்ணீரும் (இயற்கைத்) தேவைக்கான தண்ணீரும் வைத்திருக்கும் குவளையை நபி (ஸல்) அவர்களுடன் நான் சுமந்து செல்வேன். (ஒருநாள்) அவற்றைச் சுமந்துகொண்டு நான் நபி (ஸல்) அவர்களைப் பின் தொடர்ந்து சென்றுகொண்டிருந்தபோது, “யார் அது?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். “நான் அபூஹுரைராதான் (வருகிறேன்)” என்று நான் சொன்னேன். நபி (ஸல்) அவர்கள், “நான் (இயற்கைக் கடன் முடித்தபின்) துப்புரவு செய்வதற்காக எனக்குச் சில கற்களைத் தேடி (எடுத்து)க் கொண்டுவருவீராக. நீர் என்னிடம் எலும்பையோ கெட்டிச் சாணத்தையோ கொண்டு வந்துவிடாதீர்” என்று சொன்னார்கள். நான் என் ஆடையின் ஓரத்தில் கற்களை வைத்துச் சுமந்துகொண்டு வந்து அவர்களுக்குப் பக்கத்தில் வைத்துவிட்டுத் திரும்பிவிட்டேன். அவர்கள் (இயற்கைக் கடனை) முடித்ததும் அவர்களுடன் நடந்து சென்றேன். அப்போது, “எலும்பும் கெட்டிச் சாணமும் வேண்டாம் என்று ஏன் சொன்னீர்கள்?” எனக் கேட்டேன். அதற்கு அவர்கள், “அவ்விரண்டும் ஜின்களின் உணவாகும். என்னிடம் “நஸீபீன்'100 எனுமிடத்தைச் சேர்ந்த ஜின்களின் குழு ஒன்று வந்தது. அவை நல்ல ஜின்களாயி ருந்தன. அவை என்னிடம் உணவு தரும்படி கேட்டன. நான், “அவை எந்த எலும்பையும் எந்தக் கெட்டிச் சாணத்தையும் கடந்து சென்றாலும் அதில் உணவைப் பெற்றுக் கொள்ள வேண்டும்” என்று அல்லாஹ் விடம் அவற்றுக்காகப் பிரார்த்தித்தேன்” என்று பதிலளித்தார்கள்.101 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3861,
			"arabicnumber": 3861,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அபூதர் (அல்கிஃபாரீ) அவர்களுக்கு நபி (ஸல்) அவர்கள் இறைத்தூதராக நியமிக்கப்பட்ட செய்தி எட்டியபோது தம் சகோதரரிடம், “இந்த (மக்கா) பள்ளத்தாக்கை நோக்கிப் பயணம் செய்து, “வானத்திலிருந்து (இறைச்)செய்தி தம்மிடம் வருகின்ற ஓர் இறைத்தூதர்' என்று தம்மை வாதிடுகின்ற இந்த மனிதரைக் குறித்த விவரத்தை (திரட்டி) என்னிடம் சொல்! அவரது சொல்லைக் கேட்டுத் தெரிந்துகொண்ட பிறகு என்னிடம் வா!” என்று சொன்னார்கள். உடனே அச்சகோதரர் புறப்பட்டுச் சென்று நபி (ஸல்) அவர்களை அடைந்து அவர்களின் சொல்லைக் கேட்டார். பிறகு அபூதர்ரிடம் திரும்பிச் சென்று, “அவர் நற்குணங்களைக் கடைபிடிக்கும்படி (மக்களுக்குக்) கட்டளையிடுவதை நான் பார்த்தேன். ஒரு வாக்கையும் (செவியுற் றேன்). அது கவிதையாக இல்லை” என்று சொன்னார். அபூதர், “நான் விரும்பியதை நீ திருப்திகரமாகச் செய்யவில்லை” என்று கூறிவிட்டு, பயண உணவை எடுத்துக் கொண்டு, நீர் நிரம்பிய தனது தோல்பை ஒன்றைச் சுமந்துகொண்டு புறப்பட்டார். மக்காவை வந்தடைந்து (கஅபா) பள்ளிவாசலுக்குச் சென்றார். நபி (ஸல்) அவர்களை அவர் அறியாதவராயிருந்த காரணத்தால் அவர்களைத் தேடினார். (அங்கிருந்த குறைஷியர் தமக்குத் தொல்லை தரக்கூடும் என்பதால் அவர்களிடம்) நபியவர்களைப் பற்றிக் கேட்க அவர் விரும்பவில்லை. இரவில் சிறிது நேரம் கழிந்துவிட்டது. அப்போது அலீ (ரலி) அவர்கள் அவரைக் கண்டு, அவர் அந்நியர் என்று புரிந்து கொண்டார்கள். அலீயைக் கண்டவுடன் (அலீ (ரலி) அவர்கள் அபூதர்ரிடம், “வீட்டுக்கு வாருங்கள்” என்று சொல்ல) அவர்களைப் பின்தொடர்ந்து அபூதர் சென்றார். விடியும்வரை அவர்களில் ஒருவரும் (தம்முடனிருந்த) மற்றவரிடம் எதைப் பற்றியும் கேட்டுக்கொள்ளவில்லை. பிறகு அபூதர் தம் தோல்பையையும் தம் பயண உணவையும் சுமந்துகொண்டு பள்ளிவாசலுக்குச் சென்றார். அன்று மாலையாகும்வரை நபி (ஸல்) அவர்கள் தம்மைப் பார்க்காத நிலையிலேயே அன்றைய பகலைக் கழித்தார். பிறகு (மாலையானதும்) தம் படுக்கைக்குத் திரும்பினார். அப்போது அலீ (ரலி) அவர்கள் அவரைக் கடந்து சென்றார்கள். “தம் தங்குமிடத்தை அறிந்துகொள்ள இந்த மனிதருக்கு இன்னும் வேளை வரவில்லையா?” என்று கேட்டுவிட்டு அவரை(ப் படுக்கையிலிருந்து) எழுப்பித் தம்முடன் அழைத்துச் சென்றார்கள். அவ்விருவரும் ஒருவர் மற்றவரிடம் எதைப் பற்றியும் கேட்டுக்கொள்ளவில்லை. இறுதியில் மூன்றாம் நாள் வந்தபோது அலீ (ரலி) அவர்கள் அதே போன்று திரும்பச் செய்தார்கள். தம்முடன் அவரைத் தங்கவைத்துக்கொண்டு பிறகு, (அபூதர்ரிடம்), “நீங்கள் எதற்காக (இங்கே) வந்தீர்கள் என்று எனக்குச் சொல்லக் கூடாதா?” என்று கேட்டார்கள். அவர், “(நான் விரும்பி வந்ததை அடைய) எனக்குச் சரியான வழிகாட்டுவதற்கு நீங்கள் உறுதிமொழியளித்தால் நான் (எதற்காக வந்தேன் என்று சொல்லச்) செய்கிறேன்” என்று பதிலளித்தார். அலீ (ரலி) அவர்களும் அவ்வாறே உறுதிமொழி யளிக்க, அபூதர் (தாம் வந்த காரணத்தை) அவர்களுக்குத் தெரிவித்தார். அலீ (ரலி) அவர்கள், “அவர்கள் உண்மையானவர்களே! அவர்கள் அல்லாஹ்வின் தூதர்தான். காலையானதும் நீங்கள் என்னைப் பின்தொடர்ந்து வாருங் கள். நான் உங்களுக்குத் தீங்கு நேரும் என்று அஞ்சுகின்ற எதையாவது கண்டால் தண்ணீர் ஊற்றுவதைப் போன்று நின்றுகொள்வேன்.103 நான் போய்க் கொண்டேயிருந்தால் நான் நுழைய வேண்டிய இடத்தில் நுழையும்வரை என்னைப் பின்தொடருங்கள்” என்று சொன்னார்கள். அபூதர்ரும் அவ்வாறே செய்தார். அலீ அவர்களைப் பின்தொடர்ந்து நடந்தார். இறுதியில், அலீ (ரலி) அவர்கள், நபி (ஸல்) அவர்கள் தங்கியிருந்த வீட்டில் நுழைந்தபோது அவர்களுடன் அவரும் நுழைந்தார். நபி (ஸல்) அவர்களின் சொல்லைக் கேட்டு அதே இடத்தில் இஸ்லாத்தை ஏற்றார். அப்போது நபி (ஸல்) அவர்கள் அவரிடம், “நீங்கள் உங்கள் (ஃகிஃபார்) சமுதாயத்தாரிடம் திரும்பிச் சென்று என் கட்டளை உங்களிடம் வந்து சேரும்வரை (இஸ்லாத்தின் செய்தியை) அவர்களுக்குத் தெரிவியுங்கள்” என்று சொன்னார்கள். அபூதர், “என் உயிரைத் தன் கையில் வைத்திருப்பவன் மீதாணையாக! நான் இந்தச் செய்தியை (இறைமறுப்பாளர்களான) அவர்களிடையே உரக்கக் கூவிச் சொல்வேன்” என்று சொல்லிவிட்டு வெளியேறி, பள்ளி வாசலுக்கு வந்து, உரத்த குரலில், “அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை என்றும், முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் தூதர் என்றும் உறுதி கூறுகிறேன்” என்று சொன்னார். உடனே, அங்கிருந்த (இறைமறுப்பாளர்களின்) கூட்டத்தார் எழுந்து அவருக்கு வலி ஏற்படும் அளவுக்கு அவரை அடித் தார்கள். அப்பாஸ் (ரலி) அவர்கள் வந்து, அவர்மீது கவிழ்ந்து படுத்து (அடி விழாமல் தடுத்து)க்கொண்டார்கள். “உங்களுக்குக் கேடு உண்டாகட்டும். இவர் கிஃபார் குலத்தைச் சேர்ந்தவர் என்பதும், உங்கள் வணிகர்கள் செல்லும் வழி (ஃகிஃபார் குலத்தாரின் ஆதிக்கத்திற்குட் பட்ட) ஷாம் நாட்டுப் பாதையில்தான் உள்ளது என்பதும், உங்களுக்குத் தெரியாதா?” என்று சொல்லி அவர்களிடமிருந்து அபூதர்ரைக் காப்பாற்றினார்கள். அடுத்த நாள் மீண்டும் (பள்ளிவாசலுக்குச் சென்று) அபூதர் அதேபோன்று செய்ய குறைஷியரும் அடித்தபடி அவர்மீது பாய்ந்தார்கள். உடனே (முன்பு போலவே) அப்பாஸ் (ரலி) அவர்கள் அபூதர்ரின் மீது கவிழ்ந்து படுத்துக் கொண்டார்கள்.104 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3862,
			"arabicnumber": 3862,
			"text": "கைஸ் பின் அபீஹாஸிம் (ரஹ்) அவர்கள் கூறியதாவது: “அல்லாஹ்வின் மீதாணையாக! உமர் அவர்கள், நான் இஸ்லாத்தை ஏற்றதைக் கண்டித்து அவர் இஸ்லாத்தை ஏற்பதற்கு முன்பு என்னைக் கட்டிவைத்(து தண்டித்)த (அனுபவத்)தை நான் கண்டிருக்கிறேன். நீங்கள் உஸ்மான் (ரலி) அவர்கள் விஷயத் தில் (அன்னாரைக் கொலை செய்து) நடந்துகொண்டதைக் கண்டு (மனம் தாளாமல்), உஹுத் மலை தனது இடத்தை விட்டுப் பெயர்ந்துவிட்டால் அதுவும் சரியானதே” என்று சயீத் பின் ஸைத் பின் அம்ர் பின் நுஃபைல் (ரலி) அவர்கள் கூஃபாவின் மஸ்ஜிதில் வைத்துக் கூற நான் கேட்டேன். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3863,
			"arabicnumber": 3863,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: உமர் (ரலி) அவர்கள் இஸ்லாத்தை ஏற்றதிலிருந்து நாங்கள் வலிமையும் கண்ணியமும் உடையவர்களாகத் திகழலானோம். இதை கைஸ் பின் அபீஹாஸிம் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள்.106 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3864,
			"arabicnumber": 3864,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை உமர் (ரலி) அவர்கள் இஸ்லாத்தை ஏற்றதால் தம்மை குறைஷியர் கொல்ல வருவார்கள் என்று) அஞ்சியவர்களாக(த் தமது) இல்லத்தினுள் அவர்கள் இருந்தபோது, ஆஸ் பின் வாயில் அஸ்ஸஹ்மீ அபூஅம்ர் (எனும் குறைஷித் தலைவர்)107 கோடு போட்ட சால்வை ஒன்றைப் போட்டுக்கொண்டு பட்டினால் தைக்கப்பட்ட சட்டையொன்றை அணிந்து கொண்டு வந்து, “என்ன விஷயம்?” என்று கேட்டார் - அவர் அறியாமைக் காலத்தில் எங்கள் நட்புக் குலமாயிருந்த “பனூ சஹ்ம்' குலத்தைச் சேர்ந்தவர் - உமர் அவர்கள், “உங்கள் குலத்தார் நான் இஸ்லாத்தை ஏற்றதற்காக என்னைக் கொல்ல எண்ணு கிறார்கள்” என்று அவரிடம் சொன்னார்கள். அதற்கு அவர், “உம்மிடம் (நெருங்க அவர்களுக்கு) வழியில்லை” என்று சொன்னார். (உமர் (ரலி) கூறுகிறார்கள்:) இவ்வாறு அவர் சொன்ன பிறகு நான் அமைதியடைந் தேன். உடனே, “ஆஸ் பின் வாயில்' வெளியே சென்று (மக்கா) பள்ளத்தாக்கே நிரம்பி வழியும்படி திரண்டு நின்ற மக்களைச் சந்தித்து, “நீங்கள் எங்கே நாடிப் போகிறீர்கள்?” என்று கேட்டார். அவர்கள், “மதம் மாறி (நமக்குத் துரோகம் செய்து) விட்ட இந்த கத்தாபின் மகனைத்தான் நாடிச் செல்கிறோம்” என்று பதிலளித்தார் கள். அதற்கு அவர், “அவரிடம் (நெருங்க உங்களுக்கு) வழியில்லை” என்று சொல்ல, (வேறு வழியின்றி) மக்கள் திரும்பிச் சென்றுவிட்டனர். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3865,
			"arabicnumber": 3865,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: உமர் (ரலி) அவர்கள் இஸ்லாத்தைத் தழுவியபோது மக்கள் அவர்களுடைய வீட்டருகே ஒன்றுதிரண்டு, “உமர் மதம் மாறிவிட்டார்” என்று சொல்லலானார்கள். - அப்போது சிறுவயதினனாக இருந்த நான் என் வீட்டுக் கூரைமீது அமர்ந்து கொண்டிருந்தேன் - அப்போது ஒரு மனிதர் பட்டு அங்கி ஒன்றை அணிந்து கொண்டு வந்து, “உமர் மதம் மாறிவிட்டார். அதனால் என்ன? நான் அவருக்கு அபயம் அளித்திருக்கிறேன் (ஆகவே, அவரை யாரும் ஒன்றும் செய்ய முடியாது)” என்று சொன்னார். மக்கள் (அவர் சொன்னதைக் கேட்டு) அங்கிருந்து கலைந்து சென்றுவிட்டதைப் பார்த்தேன். நான், “யார் இவர்?” என்று கேட்டேன். மக்கள், “(இவர்தான்) ஆஸ் பின் வாயில்” என்று பதிலளித்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3866,
			"arabicnumber": 3866,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: உமர் (ரலி) அவர்கள் (ஒரு விஷயத் தைப் பற்றி), “நான் இதைக் குறித்து இப்படிக் கருதுகிறேன்” என்று சொல்ல நான் கேட்பேனாயின், அந்த விஷயம் அவர்கள் கூறியதைப் போலத்தான் இருக்கும். ஒருமுறை உமர் (ரலி) அவர்கள் (தம் இடத்தில்) அமர்ந்திருந்தபொழுது அழகான ஒரு மனிதர் அவர்களைக் கடந்து சென்றார். அப்போது உமர் (ரலி) அவர்கள், “ஒன்று நான் (இவர் அஞ்ஞானக் கலாசாரத்தில் இருப்பவர் என்று) நினைத்தது தவறாயிருக்க வேண்டும்; அல்லது (நான் நினைத்தது சரியாக இருக்குமானால்) இந்த மனிதர் தமது (பழைய) அறியாமைக் கால மார்க்கத்திலேயே இருக்க வேண்டும்; அல்லது (அறியாமைக் கால) அம்மக்களுக்குக் குறிசொல்பவராக (சோதிடராக) இருந்திருக்க வேண்டும். அந்த மனிதரை என்னிடம் அழைத்து வாருங்கள்” என்று சொன்னார்கள். அவ்வாறே அவர், உமர் (ரலி) அவர்களிடம் அழைத்துவரப்பட்டார். உமர் (ரலி) அவர்கள், தாம் (முன்பு சந்தேகத்துடன்) கூறியதையே அந்த மனிதரிடமும் கேட்டார்கள். அந்த மனிதர் (தம்மைப் பற்றி உமர் முன்வைத்த சந்தேகத்தால் வெறுப்படைந்தவராய்), “இன்று ஒரு முஸ்லிமான மனிதருக்குக் கொடுக்கப்பட்ட வரவேற்பு போன்று நான் (எப்போதும்) பார்த்ததில்லை” என்று சொன்னார். உமர் (ரலி) அவர்கள், “நீ எனக்கு (அறியாமைக் காலத்தில் நடந்த) செய்தியைச் சொல்லத்தான் வேண்டும் என்று விரும்பு கிறேன்” என்று சொன்னார்கள். அதற்கு அவர், “நான் அறியாமைக் காலத்தில் அம்மக்களின் சோதிடனாக (குறிகாரனாக) இருந்தேன்” என்று சொன்னார். உமர் (ரலி) அவர்கள், “உனது பெண் ஜின் உன்னிடம் கொண்டுவந்த செய்திகளிலேயே மிகவும் வியப்புக்குரியது எது?” என்று கேட்டார்கள். அம்மனிதர், “நான் ஒரு நாள் கடைவீதியில் இருந்தபோது, பெண் ஜின் என்னிடம் வந்தது. அதனிடம் பீதியைக் கண்டேன். அப்போது “ஜின்கள் அடைந்துள்ள அச்சத்தை நீங்கள் பார்க்கவில்லையா? அவை (மேலுலகச் செய்திகளை ஒட்டுக் கேட்க முடியாமல்) தோல்வியுற்றுத் திரும்புவதால் அடைந்துள்ள நிராசையை யும் நீங்கள் பார்க்கவில்லையா? அவை இளம் ஒட்டகங்களையும் அவற்றின் (சேண இருக்கையின் கீழே விரிக்கப்படும்) துணியையும் பின்பற்றிச் செல்வதைக் காணவில்லையா?'108 என்று கேட்டது” என்று சொன்னார். உமர் (ரலி) அவர்கள், “இவர் உண்மை சொன்னார். நான் (கஅபாவில்) இணைவைப்பாளர்களின் கடவுள் (சிலை)களுக்கு அருகே தூங்கிக்கொண்டிருந்தபோது, ஒரு மனிதர் காளைக் கன்று ஒன்றைக் கொண்டுவந்து (பலி கொடுத்து) அதை அறுத்தார். அப்போது அசரீரிக் குரல் ஒன்று வந்தது. அதைவிடக் கடுமையான குரலில் குரல் கொடுப்பவர் எவரையும் நான் செவியுற்றதேயில்லை. அது, “பகிரங்கமாகப் பகைத்துக்கொண்டவரே! வெற்றிகரமான ஒரு விஷயம். பேச்சுத் திறனுள்ள ஒரு மனிதர், “(அல்லாஹ்வே!) உன்னைத் தவிர வேறு இறைவனில்லை' என்று சொல்வார்” என்று குரல் கொடுத்தது. உடனே (இணைவைக்கும்) மக்கள் குதித்தெழுந்தார்கள். நான், “இந்த மர்மக் குரலுக்குப் பின்னால் என்ன உள்ளது என்பதை அறிந்துகொள்ளாமல் விடமாட்டேன்” என்று சொன்னேன். பிறகு (மீண்டும்) அந்த அசரீரி, “பகிரங்கமாகப் பகைத்துக் கொண்டவரே! வெற்றிகரமான ஒரு விஷயம். பேச்சுத் திறனுள்ள ஒரு மனிதர், “அல்லாஹ்வைத் தவிர வேறு இறைவ னில்லை' என்று சொல்வார்” என்று குரல் கொடுத்தது. நான் எழுந்து சென்றுவிட்டேன். சிறிது காலத்திற்குள்ளாகவே, “இதோ ஒரு நபி (வந்துவிட்டார்)” என்று சொல்லப் பட்டது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3867,
			"arabicnumber": 3867,
			"text": "கைஸ் பின் அபீஹாஸிம் (ரஹ்) அவர்கள் கூறியதாவது: “உமர் அவர்கள், நானும் அவருடைய சகோதரியும் இஸ்லாத்தை ஏற்றதற்காக என்னைக் கட்டிவைத்(து தண்டித்)த (அனுபவத்)தை நான் கண்டிருக்கிறேன். -அப்போது அவர் முஸ்லிமாயிருக்க வில்லை. -உஸ்மான் (ரலி) அவர்கள் விஷயத்தில் (அன்னாரைக் கொலை செய்து) நீங்கள் நடந்துகொண்ட (விதத்)தைக் கண்டு (மனம் தாளாமல்) உஹுத் மலை தனது இடத்தைவிட்டுப் பெயர்ந்து விட்டால் அதுவும் சரியானதே” என்று (கூஃபாவின் மஸ்ஜிதில் கூடியிருந்த) மக்களிடம் சயீத் பின் ஸைத் (ரலி) அவர்கள் கூற நான் கேட்டிருக்கிறேன்.109 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3868,
			"arabicnumber": 3868,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (அவர்கள் இறைத்தூதர்தான் என்பதை உறுதிப்படுத்தும் விதத்தில்) தங்களுக்கு ஒரு சான்றைக் காட்டும்படி மக்காவாசிகள் கேட்டுக்கொண்டார்கள். அவர்களுக்கு நபி (ஸல்) அவர்கள் சந்திரனை இரு துண்டுகளாக (பிளந்திருக்க)க் காட்டினார்கள். எந்த அளவுக் கென்றால், மக்காவாசிகள் அவ்விரு துண்டுகளுக்கிடையே “ஹிரா' மலையைக் கண்டார்கள்.110 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3869,
			"arabicnumber": 3869,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுடன் மினாவில் இருந்தபோது சந்திரன் (இரு துண்டுகளாகப்) பிளவுபட்டது. உடனே நபி (ஸல்) அவர்கள், “நீங்கள் (இதைப் பார்த்து நினைவில் இருத்தி) சாட்சியாக இருங்கள்” என்று சொன்னார்கள். (அதன்) இரு துண்டுகளில் ஒன்று (ஹிரா) மலையின் திசையில் சென்றது.111 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில், மஸ்ரூக் (ரஹ்) அவர்களின் அறிவிப்பில், “மக்காவில் (சந்திரன்) பிளந்தது” என அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியுள்ளார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3870,
			"arabicnumber": 3870,
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் சந்திரன் (இரு துண்டு களாகப்) பிளவுபட்டது.112 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3871,
			"arabicnumber": 3871,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (நபி (ஸல்) அவர்கள் காலத்தில்) சந்தி ரன் (இரு துண்டுகளாகப்) பிளவுபட்டது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "உபைதுல்லாஹ் பின் அதீ பின் அல்கியார் (ரஹ்) அவர்கள் கூறியதாவது: மிஸ்வர் பின் மக்ரமா (ரலி) அவர்களும் அப்துர் ரஹ்மான் பின் அஸ்வத் பின் அப்தி யகூஸ் (ரஹ்) அவர்களும் என்னிடம், “நீங்கள் உங்களுடைய (குலவழி) மாமா உஸ்மான் (ரலி) அவர்களி டம், அவர்களுடைய தாய்வழிச் சகோதரர் வலீத் பின் உக்பா பற்றிப் பேசாமலிருப்பது ஏன்? மக்கள் வலீதின் செயல்பாடுகள் குறித்து அதிகமாகக் குறை கூறுகிறார்களே!” என்று கேட்டார்கள். ஆகவே, நான் உஸ்மான் (ரலி) அவர்கள் தொழுகைக்காகப் புறப்பட்ட நேரத்தில் அவர்களுக்காகக் காத்திருந்தேன். அவர்களிடம், “எனக்கு உங்களிடம் சற்று(ப் பேச வேண்டிய) தேவை உள்ளது. அது (உங்க ளுக்கு நான் கூற விரும்பும்) அறிவுரை” என்று சொன்னேன். அதற்கு அவர்கள், “மனிதரே! உம்மிடமிருந்து நான் அல்லாஹ் விடம் பாதுகாப்புக் கோருகிறேன்” என்று சொன்னார்கள். உடனே, நான் திரும்பி (அவ்விரு வரிடமும்) வந்தேன். நான் தொழுது முடித்தபோது மிஸ்வர் (ரலி) அவர்களுக்கும் இப்னு அப்தி யகூஸ் (ரஹ்) அவர்களுக்கும் அருகில் (சென்று) அமர்ந்து, உஸ்மான் (ரலி) அவர்களிடம் நான் (வலீத் பின் உக்பா விஷயமாகக்) கூறியதையும் அதற்கு அவர்கள் என்னிடம் சொன்ன பதிலையும் தெரிவித்தேன். அப்போது அவர்கள் இருவரும், “உங்கள் மீதிருந்த கடமையை நீங்கள் நிறைவேற்றிவிட்டீர்கள்” என்று சொன்னார்கள். அவ்விருவருடனும் நான் அமர்ந்திருந்தபோது உஸ்மான் (ரலி) அவர்களுடைய தூதுவர் (என்னைத் தேடி) வர, அவ்விருவரும், “அல்லாஹ் உங்களைச் சோதனைக்குள்ளாக்கிவிட்டான்” என்று கூறினர். உடனே நான் (தூதுவருடன் புறப்பட்டு) உஸ்மான் (ரலி) அவர்களிடம் சென்றேன். உஸ்மான் (ரலி) அவர்கள், “நீங்கள் சற்றுமுன் கூறி(ட விரும்பி)ய உங்கள் அறிவுரை என்ன?” என்று கேட்டார்கள். அதற்கு நான் ஏகத்துவ உறுதி மொழியைக் கூறி (இறைவனைப் புகழ்ந்து விட்டு), “அல்லாஹ், முஹம்மத் (ஸல்) அவர்களை (சத்திய மார்க்கத்துடன்) அனுப்பி அவர்களுக்கு இறை வேதத்தை யும் அருளினான். அல்லாஹ் மற்றும் அவனுடைய தூதர் (ஸல்) அவர்களின் அழைப்புக்குப் பதிலளித்து அவர்கள்மீது நம்பிக்கை கொண்டவர்களில் நீங்களும் ஒருவராயிருந்தீர்கள். மேலும், முதல் இரண்டு ஹிஜ்ரத்துகளை மேற்கொண்டீர் கள்.116 நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தோழமை கொண்டு அவர்களின் வழிமுறையைப் பார்த்திருக்கிறீர்கள். மக்களோ வலீத் பின் உக்பாவைப் பற்றி நிறைய குறைபேசுகிறார்கள். எனவே, அவரை (இஸ்லாமியச் சட்டப்படி) தண்டிப்பது உங்கள்மீது கடமையாகிவிட்டது” என்று சொன்னேன். அதற்கு அவர்கள், “என் சகோதரர் மகனே! நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பார்த்திருக்கிறீர்களா?” என்று கேட்க நான், “இல்லை. ஆனால், திரைக்கப்பால் இருக்கும் கன்னிப் பெண்களிடம்(கூட) அல்லாஹ்வின் தூதருடைய கல்வி சென்றடைந்துகொண்டிருக்கும்(போது, அந்த) அளவு கல்வி என்னிடமும் வந்து சேர்ந்துள்ளது (குறித்து வியப்பில்லை)” என்று பதில் சொன்னேன். உடனே உஸ்மான் (ரலி) அவர்கள், ஏகத்துவ உறுதிமொழியைக் கூறி, “அல்லாஹ் முஹம்மத் (ஸல்) அவர்களைச் சத்திய (மார்க்க)த்துடன் அனுப்பி அவர்களுக்கு வேதத்தையும் அருளினான். அப்போது, அல்லாஹ்வின் அழைப்புக்கும் அல்லாஹ்வின் தூதருடைய அழைப்புக் கும் பதிலளித்தவர்களில் நானும் ஒருவ னாயிருந்தேன். மேலும், அவர்கள் எந்த வேதத்தைக் கொடுத்தனுப்பப்பட்டார்களோ அதை நான் நம்பி ஏற்றுக்கொண்டேன். நான் முதல் இரண்டு ஹிஜ்ரத்துகளையும் மேற்கொண்டேன். -நீங்கள் சொன்னதைப் போல்- நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தோழமை கொண்டேன்; அவர்களிடம் விசுவாசப் பிரமாணம் செய்தேன். ஆகவே, அல்லாஹ்வின் மீதாணை யாக! அவர்களை அல்லாஹ் இறக்கச் செய்யும்வரை நான் அவர்களுக்கு மாறு செய்யவுமில்லை; அவர்களை ஏமாற்றவு மில்லை. பிறகு அல்லாஹ் அபூபக்ர் (ரலி) அவர்களை கலீஃபாவாக (ஆட்சியாளராக) ஆக்கினான். அல்லாஹ்வின் மீதாணை யாக! நான் அவர்களுக்கு மாறு செய்யவு மில்லை; அவர்களை ஏமாற்றவுமில்லை. பிறகு உமர் (ரலி) அவர்கள் கலீஃபாவாக (ஆட்சியாளராக) ஆக்கப்பட்டார்கள். அல்லாஹ்வின் மீதாணையாக! நான் அவர்களுக்கு மாறு செய்யவுமில்லை; அவர்களை ஏமாற்றவுமில்லை. பிறகு நான் கலீஃபாவாக (ஆட்சியாளராக) ஆக்கப்பட்டேன். ஆகவே, என் விஷயத்தில் அவர்களுக்கிருந்தது போன்ற அதே உரிமை உங்கள் விஷயத்தில் எனக்கில்லையா?” என்று கேட்டார்கள். நான், “ஆம் (உங்களுக்கும் அதே போன்ற உரிமை இருக்கின்றது)” என்றேன். அவர்கள், “அப்படியென்றால் உங்களைக் குறித்து எனக்கு எட்டுகின்ற (என்னைக் குறைகூறும்) இந்தப் பேச்சுகளெல்லாம் என்ன? நீங்கள் வலீத் பின் உக்பா தொடர்பாகச் சொன்னவற்றில் இறைவன் நாடினால் விரைவில் நான் சரியான நடவடிக்கையை எடுப்பேன்” என்று சொன்னார்கள். பிறகு வலீத் பின் உக்பாவுக்கு (எதி ராகச் சாட்சிகள் கிடைத்ததால் அவருக்கு) நாற்பது சாட்டையடிகள் தண்டனையாக அறிவித்து, அவருக்குச் சாட்டையடிகள் கொடுக்கும்படி அலீ (ரலி) அவர்களுக்கு உஸ்மான் (ரலி) அவர்கள் உத்தரவிட்டார்கள். அலீ (ரலி) அவர்கள்தான் வலீதுக்குச் சாட்டையடி வழங்கினார்கள்.117 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் இரண்டில் “அவர்களுக்கு இருந்ததைப் போன்ற உரிமை உங்கள்மீது எனக்கில் லையா? என இடம்பெற்றுள்ளது. அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: இங்கு “அல்லாஹ் உங்களைச் சோதனைக்குள்ளாக்கி விட்டான்' என்பதைக் குறிக்க மூலத்தில் “பலாஉ' எனும் சொல் ஆளப்பட்டுள்ளது. இதற்கு “சோதனை' எனும் பொருள் இருப்பதைப் போன்றே, “அருட்கொடை' எனும் பொருளும் உண்டு. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3873,
			"arabicnumber": 3873,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: உம்மு ஹபீபா (ரலி) அவர்களும் உம்மு சலமா (ரலி) அவர்களும் அபிசீனியாவில் தாம் பார்த்த உருவப் படங்கள் கொண்ட ஒரு கிறித்தவ ஆலயத்தைக் குறித்து (என்னிடம்) பேசினார்கள்.118 மேலும், அவ்விருவரும் நபி (ஸல்) அவர்களிடம் (அதைப் பற்றிக்) கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், “(அவர்கள் எத்தகையவர்கள் என்றால்) அவர்களி டையே நல்ல மனிதர் ஒருவர் வாழ்ந்து இறந்துவிடும்போது, அவரது அடக்கத் தலத்தின் மீது வணக்கத் தலம் ஒன்றைக் கட்டி அதில் (அவருடைய) அந்த உருவங் களை வரைவார்கள். அவர்கள்தான், மறுமை நாளில் அல்லாஹ்விடம் மக்களி லேயே மிக மோசமானவர்கள்” என்று சொன்னார்கள்.119 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3874,
			"arabicnumber": 3874,
			"text": "உம்மு காலித் பின்த் காலித் (ரலி) அவர்கள் கூறியதாவது: நான் சிறுமியாக இருந்தபோது (என் தந்தையுடன்) அபிசீனியா நாட்டிலிருந்து (நபியவர்களிடம்) வந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எனக்குப் பட்டுத் துணி ஒன்றை உடுத்தக் கொடுத்தார்கள். அதில் அடையாளக் குறிகள் சில இருந்தன. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் கரத்தால் அந்த அடையாளங் களைத் தடவியபடி, “அழகாயிருக்கிறதே! அழகாயிருக்கிறதே!” (என்பதைக் குறிக்க அபிசீனிய மொழியில் “சனா, சனா') என்று கூறலானார்கள்.120 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3875,
			"arabicnumber": 3875,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தொழுதுகொண்டிருக்கும்போது நாங்கள் அவர்களுக்கு சலாம் சொல்லுவோம். உடனே அவர்கள் எங்களுக்குப் பதில் சலாம் சொல்வார்கள். நாங்கள் (அபிசீனிய மன்னர்) நஜாஷீ யிடமிருந்து திரும்பி வந்தபோது நபி (ஸல்) அவர்களுக்கு (அவர்கள் தொழுகை யிலிருக்கும்போது) சலாம் சொன்னோம். அப்போது அவர்கள் எங்களுக்குப் பதில் சலாம் சொல்லவில்லை. நாங்கள், “அல்லாஹ்வின் தூதரே! (நீங்கள் தொழும் போது) நாங்கள் உங்களுக்கு சலாம் சொல்ல, நீங்களும் அதற்குப் பதில் சலாம் சொல்லிவந்தீர்களே” என்று கேட்டோம். அதற்கு அவர்கள், “நிச்சயமாக! தொழுகை யில் கவனம் தேவைப்படுகிறது” என்று பதிலளித்தார்கள்.121 (இதன் அறிவிப்பாளர்களில் ஒருவரான) சுலைமான் அல்அஃமஷ் (ரஹ்) அவர்கள் (தமக்கு முந்திய அறிவிப் பாளரான) இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்களிடம், “(நீங்கள் தொழும்போது யாராவது சலாம் சொல்லிவிட்டால்) நீங்கள் எப்படிச் செய்கிறீர்கள்?” என்று கேட்டார். அதற்கு இப்ராஹீம் (ரஹ்) அவர்கள், “என் மனதுக்குள் நான் பதில் சலாம் சொல்லிவிடுகிறேன்” என்று சொன்னார். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3876,
			"arabicnumber": 3876,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நாங்கள் யமன் நாட்டில் இருந்தபோது நபி (ஸல்) அவர்கள் (ஹிஜ்ரத் செய்து மக்காவிலிருந்து) வெளியேறிய செய்தி எங்களுக்கு எட்டியது. உடனே நாங்கள் ஒரு கப்பலில் ஏறிப் பயணம் புறப்பட்டோம். எங்கள் கப்பல் (திசைமாறி) எங்களை அபிசீனியாவில் மன்னர் நஜாஷீ அவர்களிடம் கொண்டு(போய் இறக்கிவிட்டுச்) சென்றுவிட்டது. நாங்கள் ஜஅஃபர் பின் அபீதாலிப் (ரலி) அவர்களை(த் தற்செயலாக அங்கே) சந்தித்தோம். நாங்கள் அங்கிருந்து வரும்வரை ஜஅஃபர் (ரலி) அவர்களுடனேயே தங்கினோம். கைபரை நபி (ஸல்) அவர்கள் வெற்றி கொண்டிருந்த வேளையில் சென்று அவர்களை அடைந்தோம். அப்போது நபி (ஸல்) அவர்கள் (எங்களை நோக்கி), “கப்பல்காரர்களே! உங்களுக்குத்தான் இரண்டு ஹிஜ்ரத்கள்” என்று சொன்னார்கள்.122 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3877,
			"arabicnumber": 3877,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறிய தாவது: (மன்னர்) நஜாஷீ இறந்தபோது நபி (ஸல்) அவர்கள், “இன்று (ஒரு) நல்ல மனிதர் இறந்துவிட்டார். ஆகவே, எழுந்து நின்று உங்கள் சகோதரர் “அஸ்ஹமா'வுக்காக (ஃகாயிப் ஜனாஸா தொழுகை) தொழுங் கள்” என்று சொன்னார்கள்.124 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3878,
			"arabicnumber": 3878,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் அல் அன்சாரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (அபிசீனிய மன்னர்) நஜாஷீ (இறந்துவிட்டபோது) அவருக்காக (ஃகாயிப் ஜனாஸா) தொழுகை தொழுதார்கள். நாங்கள் நபி (ஸல்) அவர்களுக்குப் பின்னே வரிசையாக நின்றுகொண்டோம். நான் இரண்டாவது வரிசையில், அல்லது மூன்றாவது வரிசையில் இருந்தேன்.125 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3879,
			"arabicnumber": 3879,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் “அஸ்ஹமா' அந் நஜாஷீக்காக (ஃகாயிப்) ஜனாஸா தொழுகை தொழுதார்கள். அப்போது அவர்மீதான தொழுகையில் நான்கு தக்பீர்கள் கூறினார்கள்.126 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3880,
			"arabicnumber": 3880,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அபிசீனியாவின் அதிபர் நஜாஷீ அவர்கள் இறந்துவிட்ட செய்தியை அவர் இறந்த நாளன்றே எங்களுக்கு அறிவித்தார்கள். மேலும், “உங்கள் சகோதரருக்காகப் பாவமன்னிப்புக் கோருங்கள்” என்று சொன்னார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3881,
			"arabicnumber": 3881,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களை (ஜனாஸா தொழுகை) தொழு மிடத்தில் வரிசையாக நிற்கவைத்துநஜாஷீக்காக ஜனாஸா தொழுகை தொழு (வித்)தார்கள்; (அதில்) நான்கு தக்பீர்கள் கூறினார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3882,
			"arabicnumber": 3882,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஹுனைன் போருக்குச் செல்ல விரும்பிய போது, “நாளை நாம் (போருக்காக) முகாமிடப்போகும் இடம் - இறைவன் நாடினால் - “பனூ கினானா' குலத்தாரின் (முஹஸ்ஸப்) பள்ளத்தாக்காகும். அது அவர்கள், “நாங்கள் இறைமறுப்பில் நிலைத்திருப்போம்” என்று சூளுரைத்த இடமாகும் என்று கூறினார்கள்.128 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3883,
			"arabicnumber": 3883,
			"text": "அப்பாஸ் பின் அப்தில் முத்தலிப் (ரலி) அவர்கள் கூறியதாவது: நான் (ஒருமுறை) நபி (ஸல்) அவர்களிடம், “உங்கள் தந்தையின் சகோதரருக்கு (அபூதாலிபுக்கு, அவர் செய்த உதவிகளுக் குக் கைமாறாக) நீங்கள் என்ன பயனை அளித்தீர்கள்? ஏனெனில், அல்லாஹ்வின் மீதாணையாக, அவர் உங்களை (எதிரி களின் தாக்குதலிலிருந்து) பாதுகாப்ப வராகவும், உங்களுக்காக (உங்கள் எதிரிகளிடம்) கோபப்படுபவராகவும் இருந்தாரே!” என்று கேட்டேன். அதற்கு அவர்கள், “அவர் இப்போது (கணுக்கால்வரை தீண்டும்) சிறிதளவு நரக நெருப்பில்தான் இருக்கிறார். நான் மட்டும் இல்லையென்றால் அவர் நரகத்தின் அடித்தட்டில் இருந்திருப்பார்” என்று பதிலளித்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3884,
			"arabicnumber": 3884,
			"text": "முசய்யப் பின் ஹஸ்ன் பின் அபீவஹ்ப் (ரலி) அவர்கள் கூறியதாவது: அபூதாலிப் அவர்களுக்கு மரண வேளை வந்துவிட்டபோது நபி (ஸல்) அவர்கள் அவரிடம் சென்றார்கள். அப்போது அபூஜஹ்ல் அவரருகே இருந்தான். நபி (ஸல்) அவர்கள், “என் தந்தையின் சகோதரரே! “லா இலாஹ இல்லல்லாஹ்' (அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை) என்று சொல்லுங்கள். இந்தச் சொல்லை (நீங்கள் சொல்லிவிட்டால் அதை)வைத்து (மறுமையில் நரகத்திலிருந்து விடுதலை கேட்டு) உங்களுக்காக அல்லாஹ்விடம் நான் வாதாடுவேன்” என்று சொன்னார்கள். அப்போது அபூஜஹ்லும் அப்துல்லாஹ் பின் அபீஉமய்யாவும், “அபூதாலிபே! (பெரியவர், உங்கள் தந்தை) அப்துல் முத்தலிபின் மார்க்கத்தையா புறக்கணிக்கப் போகிறீர்கள்?” என்று கேட்டனர். அவ்விருவரும் இவ்வாறே தொடர்ந்து அவரிடம் பேச இறுதியில் அவர், “(என் இறப்பு என் தந்தை) அப்துல் முத்தலிபின் மார்க்கத்தில் தான் (நிகழும்)” என்று அவர்களிடம் சொன்னார். எனவே, நபி (ஸல்) அவர்கள், “நான் உங்களுக்காக அல்லாஹ்விடம் பாவமன்னிப்புக் கோருவேன்; (அவ்விதம் பாவமன்னிப்புக் கோரக் கூடாது என்று) எனக்குத் தடை விதிக்கப்படும்வரை” என்று சொன்னார்கள். அப்போதுதான், “இணைவைப்பாளர் கள் நரகவாசிகள்தான் என்பது தெளிவாகி விட்ட பின்பும் அவர்களுக்காகப் பாவமன் னிப்புக் கோருவதற்கு, அவர்கள் உறவினர் களாயிருந்தாலும்கூட இறைத்தூதருக்கும் இறை நம்பிக்கையாளர்களுக்கும் உரிமை யில்லை” எனும் (9:113) குர்ஆன் வசனமும், “(நபியே!) நீங்கள் விரும்பியவரை உங்க ளால் நல்வழியில் செலுத்திவிட முடியாது” எனும் (28:56) குர்ஆன் வசனமும் அருளப் பெற்றன.130 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3885,
			"arabicnumber": 3885,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் அவர்களுடைய தந்தையின் சகோதரர் அபூதாலிப் அவர்களைப் பற்றிக் கூறப்பட்டபோது அவர்கள், “அவருக்கு என் பரிந்துரை மறுமை நாளில் பயனளிக்கக்கூடும்; (அதனால்) நரக நெருப்பு அவரது (முழு உடலையும் தீண்டாமல்) கணுக்கால்கள்வரை மட்டுமே தீண்டும்படி ஆக்கப்படலாம். (ஆனால்) அதனால் அவருடைய மூளை (தகித்துக்) கொதிக்கும்” என்று சொல்ல நான் கேட்டேன். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், “அவரது மூளையின் மூலப்பகுதி (தகித்துக்) கொதித்துக்கொண்டிருக்கும்” என்று காணப்படுகிறது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3886,
			"arabicnumber": 3886,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (நான் இரவின் சிறு பகுதியில் கஅபாவிலிருந்து பைத்துல் மக்திஸ்வரை சென்றதாகச் சொன்ன சமயம்) என்னை குறைஷியர் நம்ப மறுத்தபோது நான் கஅபாவின் “ஹிஜ்ர்' என்னும் (வளைந்த) பகுதியில் நின்றேன். அல்லாஹ் எனக்கு பைத்துல் மக்திஸைக் காட்சியளிக்கச் செய்தான். அப்போது அதைப் பார்த்த படியே நான் அவர்களுக்கு அதன் அடை யாளங்களை விவரிக்கலானேன்.132 இதை ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3887,
			"arabicnumber": 3887,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நான் (இறையில்லம் கஅபா அருகில்) “ஹத்தீமில்' அல்லது “ஹிஜ்ரில்' படுத்துக் கொண்டிருந்தேன். அப்போது என்னிடம் ஒருவர் (வானவர் ஜிப்ரீல்) வந்து (என் நெஞ்சைப்) பிளந்தார். -அறிவிப்பாளர்களில் ஒருவரான அனஸ் (ரலி) அவர்கள், “இங்கிருந்து இது வரையில் அவர் பிளந்தார்” என்று நபி (ஸல்) அவர்கள் சொன்னதாகக் கூறி னார்கள். அறிவிப்பாளர் கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் என்னருகில் இருந்த (அனஸ் (ரலி) அவர்களின் நண்பர்) ஜாரூத் (ரஹ்) அவர்களிடம், “அனஸ் (ரலி) அவர்கள், இங்கிருந்து இதுவரையில்... என்று எதைக் கருத்தில் கொண்டு கூறினார்கள்?” என்று கேட்டேன். அதற்கு ஜாரூத் (ரஹ்) அவர்கள், “நபி (ஸல்) அவர்களின் “நெஞ்சின் காறையெலும்பிலிருந்து அடிவயிறுவரை' அல்லது “நெஞ்சின் ஆரம்பத்திலிருந்து அடிவயிறுவரை' என்ற கருத்தில் அனஸ் (ரலி) அவர்கள் கூறினார்கள்” என்று பதிலளித்தார்கள்.- பிறகு அ(ந்த வான)வர் (ஜிப்ரீல்) எனது இதயத்தை வெளியில் எடுத்தார். பிறகு, இறைநம்பிக்கையால் நிரப்பப்பட்ட தங்கத் தட்டு ஒன்று என்னிடம் கொண்டுவரப் பட்டு, எனது இதயம் கழுவப்பட்டு, (அதில்) அந்த இறைநம்பிக்கை நிரப்பப்பட்டது. பிறகு பழையபடி மீண்டும் (எனது இதயம், மூடி)வைக்கப்பட்டது. பிறகு கோவேறுக் கழுதையைவிடச் சிறியதும் கழுதையை விடப் பெரியதுமான வெள்ளை நிறத்தில் அமைந்த (மின்னல் வேக) வாகனம் ஒன்றும் என்னிடம் கொண்டுவரப்பட்டது. -(இந்த ஹதீஸின் அறிவிப்பாளர்களில் ஒருவரான) அனஸ் (ரலி) அவர்களிடம் ஜாரூத் (ரஹ்) அவர்கள், “அது புராக் எனும் வாகனம்தானே, அபூஹம்ஸா அவர்களே?” என்று கேட்டார்கள். அதற்கு அனஸ் (ரலி) அவர்கள், “ஆம், (அது புராக்தான்.) அந்த வாகனம் பார்வை எட்டுகிற தூரத்திற்கு ஓர் எட்டு வைக்கும்” என்று கூறினார்கள்.- பிறகு நான் அந்த வாகனத்தில் ஏற்றப்பட்டேன். என்னை ஜிப்ரீல் முதல் வானத் திற்கு அழைத்துச்சென்று அதன் கதவைத் திறக்கும்படி கூறினார். அப்போது, “யார் அது?” என்று கேட்கப்பட்டது. அதற்கு அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் (வந்திருப்பவர்) யார்?” என்று கேட்கப்பட்டது. அதற்கு அவர், “முஹம்மத்' என்று பதிலளித்தார். “(அவரை அழைத்து வரச்சொல்லி) அவரிடம் ஆள் அனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்றார். “அவரது வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொல்லப்பட்டது. அப்போது (அந்த வானத்தின் காவலர்) கதவைத் திறந்தார். நான் அங்கு சென்றடைந்தபோது அங்கு (ஆதி மனிதர்) ஆதம் (அலை) அவர்கள் இருந்தார்கள். (என்னிடம் ஜிப்ரீல்) “இவர்கள் உங்கள் தந்தை ஆதம். இவர்களுக்கு சலாம் சொல்லுங்கள்” என்று கூறினார். அவர்களுக்கு நான் சலாம் சொன்னேன். அவர்கள் (எனக்கு) பதில் சலாம் சொன்னார்கள். பிறகு, ஆதம் (அலை) அவர்கள், “(என்) நல்ல மகனும், நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வரவாகுக!” என்று சொன்னார்கள். பிறகு (என்னை அழைத்துக்கொண்டு ஜிப்ரீல்) இரண்டாம் வானத்தில் ஏறி அதைத் திறக்கும்படி சொன்னார். “யார் அது?” என்று கேட்கப்பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளிக்க, “உங்களுடன் (இருப்பவர்) யார்?” என்று வினவப்பட்டது. (அதற்கு) அவர், “முஹம்மத்' என்று பதிலளித்தார், “(அவரை அழைத்து வரும் படி) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்று பதிலளித்தார். “அவரது வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொல்லப்பட்டது. பிறகு (அந்த வானத்தின் காவலர் கதவைத்) திறந்தார். நான் அங்கு சென்றடைந்த போது, அங்கு யஹ்யா (அலை) அவர்களும், ஈசா (அலை) அவர்களும் இருந்தனர். -அவ்விருவரும் சிற்றன்னையின் மக்களாவர்.-134 இது யஹ்யா அவர்களும், ஈசா அவர்களும் ஆவர். இவர்களுக்கும் சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் (அவர்கள் இருவருக்கும்) சலாம் சொன்னபோது அவர்கள் சலாமிற்குப் பதில் கூறினார்கள். பிறகு அவர்கள் இருவரும், “நல்ல சகோதரரும், நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்துக்) கூறினர். பிறகு ஜிப்ரீல் என்னை அழைத்துக்கொண்டு மூன்றாம் வானத்திற்கு ஏறினார். (அந்த வானத்தின் கதவைத்) திறக்கும்படி கூறினார். “யார் அது?” என்று கேட்கப் பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளித் தார். “உங்களுடன் (இருப்பவர்) யார்?” என்று கேட்கப்பட்டது. அவர், “முஹம்மத்' என்று பதிலளித்தார். “(அவரை அழைத்து வரும்படி) அவரிடம் ஆளனுப்பப்பட்டி ருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்று பதிலளித்தார். “அவர் வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொல்லப்பட்டது. பிறகு (அந்த வானத்தின் கதவு) திறக்கப்பட்டது. அங்கு நான் சென்றடைந்த போது அங்கு யூசுஃப் (அலை) அவர்கள் இருந்தார்கள். “இவர்கள்தான் (இறைத்தூதர்) யூசுஃப். இவர்களுக்கு சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் அவர்களுக்கு சலாம் உரைத்தேன். அவர்களும் (எனக்கு) பதில் சலாம் சொன்னார்கள். பிறகு, “நல்ல சகோதரரும் நல்ல இறைத் தூதருமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்துச்) சொன்னார்கள். பிறகு என்னை அழைத்துக்கொண்டு ஜிப்ரீல் நான்காம் வானத்திற்கு ஏறினார். (அந்த வானத்தின் கதவைத்) திறக்குமாறு சொன்னார். “யார் அது” என்று கேட்கப்பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் இருப்பவர் யார்?” என்று கேட்கப்பட்டது. அவர், “முஹம்மத்' என்று பதிலளித்தார். “(அவரை அழைத்து வரும்படி) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று வினவப்பட்ட போது, “ஆம்' என்று அவர் பதிலுரைத்தார். “அவர் வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (எனக்கு வாழ்த்துச்) சொல்லப்பட்டு(க் கதவும்) திறக்கப்பட்டது. அங்கு நான் சென்றடைந்தபோது அங்கு இத்ரீஸ் (அலை) அவர்கள் இருந்தார்கள். “இவர்கள்தான் இத்ரீஸ் (அலை) அவர்கள். இவர்களுக்கு சலாம் கூறுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் அவர்களுக்கு சலாம் சொன்னேன். அவர்களும் எனக்குப் பதில் சலாம் கூறினார்கள். பிறகு, “நல்ல சகோதரரும் நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்தும்) சொன்னார்கள். பிறகு என்னை அழைத்துக்கொண்டு ஜிப்ரீல் ஐந்தாம் வானத்திற்கு வந்து சேர்ந்து அதைத் திறக்கும்படி சொன்னார். “யார் அது?” என்று கேட்கப்பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் (இருப்பவர்) யார்?” என்று வினவப்பட்டது. அவர், “முஹம்மத்' என்று பதிலளித்தார். “(அவரை அழைத்து வருமாறு) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்றார். “அவர் வரவு நல்வரவாகட்டும். அவர் வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொல்லப்பட்டது. நான் அங்கு சென்றடைந்தபோது ஹாரூன் (அலை) அவர்கள் அங்கிருந் தார்கள். “இவர்கள்தான் ஹாரூன். இவர்களுக்கும் சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் சொன்னார். நான் அவர்களுக்கு சலாம் சொன்னேன். அவர்கள் (எனக்கு) பதில் சலாம் சொன்னார்கள். பிறகு அவர்கள், “நல்ல சகோதரரும் நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வரவாகட்டும் “ என்று (வாழ்த்துச்) சொன்னார்கள். பிறகு என்னுடன் அவர் ஆறாம் வானத்திற்கு ஏறினார். (அதன் கதவைத்) திறக்கும்படி கூறினார். “யார் அது?” என்று கேட்கப்பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் யார்?” என்று கேட்கப்பட்டது. அவர், “முஹம்மத்' என்றார். “(அவரை அழைத்து வரும்படி) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்றார். (அந்த வானத்தின் காவலர்,) “அவர் வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொன்னார். அங்கு நான் சென்றடைந்தபோது மூசா (அலை) அவர்கள் அங்கிருந்தார்கள். “இவர்கள்தான் மூசா. இவர்களுக்கு சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் அவர்களுக்கு சலாம் சொன்னேன். அவர்கள் (எனக்கு) பதில் சலாம் சொன் னார்கள். பிறகு, “நல்ல சகோதரரும் நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வர வாகட்டும்” என்று (வாழ்த்துச்) சொன்னார் கள். நான் (மூசா (அலை) அவர்களைக்) கடந்து சென்றபோது அவர்கள் அழுதார் கள். “தங்கள் அழுகைக்கு என்ன காரணம்?” என்று அவர்களிடம் கேட்கப் பட்டது. அவர்கள், “என் சமுதாயத்தாரில் சொர்க்கம் புகுபவர்களைவிட அதிகமான வர்கள், எனக்குப் பிறகு அனுப்பப்பட்ட இந்த இளைஞரின் சமுதாயத்திலிருந்து சொர்க்கம் புகுவார்கள் என்பதால்தான் அழுகிறேன்” என்று பதிலளித்தார்கள். பிறகு என்னை அழைத்துக்கொண்டு ஜிப்ரீல் ஏழாவது வானத்திற்கு ஏறினார். (அதன் கதவைத்) திறக்கும்படி ஜிப்ரீல் கூறினார். “யார் அது?' என்று கேட்கப்பட் டது. அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் இருப்பவர் யார்?” என்று வினவப்பட்டபோது அவர், “முஹம்மத்' என்று பதில் சொன்னார். “(அவரை அழைத்து வரும்படி) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்றார். (அந்த வானத்தின் காவலர்,) “அவரது வரவு நல்வரவாகட்டும், அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொன்னார். நான் அங்கு சென்றடைந்தபோது, இப்ராஹீம் (அலை) அவர்கள் அங்கிருந்தார்கள். “இவர்கள்தான் உங்கள் தந்தை. இவர்களுக்கு சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் அவர்களுக்கு சலாம் சொன்னேன். அவர்கள் (எனக்குப்) பதில் சலாம் உரைத்தார்கள். அவர்கள், “நல்ல மகனும், நல்ல இறைத்தூதருமான இவரது வரவு நல்வரவாகட்டும்” என்று வாழ்த்துச் சொன்னார்கள். பிறகு, (வான எல்லையில் அமைந்துள்ள இலந்தை மரமான) “சித்ரத்துல்முன்(த்)தஹா' எனும் இடத்திற்கு நான் கொண்டுசெல்லப்பட்டேன். அதன் (இலந்தைப்) பழங்கள் (யமனில் உள்ள) “ஹஜர்' எனுமிடத்தின் (உற்பத்திப் பொருளான மண்) கூஜாக்கள்போல் இருந்தன. அதன் இலைகள் யானைகளின் காதுகள் போலிருந்தன. “இதுதான் சித்ரத்துல் முன்(த்)தஹா” என்று ஜிப்ரீல் (அறிமுகப்படுத்திக்) கூறினார். அங்கு (அந்த மரத்தின் வேர்ப்பகுதியில் இருந்து ஓடிவருகின்ற) நான்கு ஆறுகள் இருந்தன. இரண்டு ஆறுகள் உள்ளே இருந்தன. மற்றும் இரண்டு ஆறுகள் வெளியே இருந்தன. “ஜிப்ரீலே! இவ்விரண்டு ஆறுகள் எவை?” என்று நான் கேட்டேன். அவர், “உள்ளேயிருப்பவை இரண்டும் சொர்க்கத் தில் உள்ள (ஸல்ஸபீல், கவ்ஸர் ஆகியவை)வையாகும். வெளியே இருப்பவை இரண்டும் நீல் நதியும் யூப்ரடீஸ் நதியும் ஆகும்” என்று பதிலளித்தார்கள். பிறகு, “அல்பைத்துல் மஅமூர்' (எனும் “வானவர்கள் அதிகம் சஞ்சரிக்கும் இறையில்லம்') எனக்கு (அருகே கொண்டுவந்து) காட்டப்பட்து. பிறகு என்னிடம் ஒரு பாத்திரத்தில் மதுவும், ஒரு பாத்திரத்தில் பாலும் இன்னொரு பாத்திரத்தில் தேனும் கொண்டுவரப்பட்டது. நான் பாலை (தேர்ந்து) எடுத்தேன். (பிறகு அதைக் குடித்தேன்.) அப்போது ஜிப்ரீல், “இதுதான் நீங்களும் உங்கள் சமுதாயத்தாரும் இருக்கும் (இஸ்லாம் எனும்) இயற்கை நெறியாகும்” என்று கூறினார்கள். பிறகு என்மீது ஒவ்வொரு தினத்திற்கும் ஐம்பது (வேளைத்) தொழுகைகள் கடமையாக்கப்பட்டன. நான் திரும்பிவந்தபோது மூசா (அலை) அவர்களைக் கடந்து சென்றேன். அப்போது அவர்கள், “உங்களுக்கு என்ன உத்தரவிடப்பட்டது?” என்று கேட்டார்கள். “ஒவ்வொரு நாளும் ஐம்பது (வேளைத்) தொழுகை (கட்டாயக் கடமையாக நிறைவேற்றும்படி) எனக்கு உத்தரவிடப்பட்டது” என்று நான் பதிலளித்தேன். உங்கள் சமுதாயத்தார் ஒரு தினத்திற்கு ஐம்பது வேளைத் தொழுகையைத் தாங்கமாட்டார்கள். அல்லாஹ்வின் மீதாணையாக! நான் உங்களுக்கு முன் மக்களிடம் அனுபவப்பட்டுள்ளேன். இஸ்ரவேலர்களுடன் பழகி நன்கு பக்குவப் பட்டுள்ளேன். ஆகவே, உங்கள் இறைவனிடம் திரும்பிச் சென்று அவனிடம் உங்கள் சமுதாயத்தாருக்காக (தொழுகையின் எண்ணிக்கையைக்) குறைத்துக் தரும்படி கேளுங்கள்” என்று சொன்னார்கள். நான் திரும்பிச் சென்றேன். (இறைவனிடம் குறைத்துத் தரும்படி கேட்டேன்) இறைவன் (ஐம்பதிலிருந்து) பத்தை எனக்குக் குறைத்தான். நான் மூசா (அலை) அவர்களிடம் திரும்பி வந்தேன். முன்பு போலவே (இன்னும் குறைத்துக் கேட்கும் படி) சொன்னார்கள். நான் திரும்பிச் சென்றேன். அப்போது (நாற்பதிலிருந்து) பத்தைக் குறைத்தான். நான் மூசா (அலை) அவர்களிடம் திரும்பி வந்தேன். அப்போதும் முன்பு போலவே (இன்னும் குறைத்துக் கேட்கும்படி) கூறினார்கள். நான் (இறைவனிடம்) திரும்பிச் சென்றேன். எனக்கு (முப்பதி óருந்து) பத்தைக் குறைத்தான். நான் மூசா (அலை) அவர்களிடம் திரும்பி வந்தேன். அப்போது அவர்கள் முன்பு போலவே (குறைத்து கேட்கும்படி) கூறினார்கள். நான் திரும்பிச் சென்றேன். எனக்கு (இருபதிலிருந்து பத்து குறைக்கப்பட்டு) தினந்தோறும் பத்து (வேளைத்) தொழுகைகள் (தொழும்படி) உத்தரவிடப்பட்டது. நான் (மூசா (அலை) அவர்களிடம்) திரும்பி வந்தேன். அப்போதும் அவர்கள் முன்பு போலவே சொன்னார்கள். நான் திரும்பிச் சென்றேன். ஒவ்வொரு நாளும் ஐந்து (வேளைத்) தொழுகைகள் (நிறைவேற்றும்படி) எனக்கு உத்தரவிடப்பட்டது. நான் மூசா (அலை) அவர்களிடம் திரும்பி வந்தேன். அப்போது, “உங்களுக்கு என்ன உத்தரவிடப்பட்டது?”என்று கேட்டார்கள். ஒவ்வொரு நாளைக்கும் ஐந்து (நேரத்) தொழுகைகள் எனக்கு உத்தரவிடப்பட்டுள்ளன” என்று சொன்னேன். “ஒவ்வொரு நாளும் ஐந்து (நேரத்) தொழுகைகளை உங்கள் சமுதாயத்தார் தாங்கமாட்டார்கள். உங்களுக்கு முன்பே மக்களுடன் பழகி நான் நன்கு அனுபவப்பட்டுள்ளேன். நான் இஸ்ர வேலர்களுடன் பழகி நன்கு பக்குவப் பட்டுள்ளேன். எனவே, உங்கள் இறைவனிடம் திரும்பிச் சென்று உங்கள் சமுதாயத்தாருக்காக இன்னும் குறைத்துத் தரும்படி கேளுங்கள்” என்று கூறினார்கள். அதற்கு நான், “(கடமையான தொழுகை களின் எண்ணிக்கையைக் குறைத்துத் தரும்படி பலமுறை இறைவனிடம்) எனக்கே வெட்கமேற்படும்வரையில் நான் கேட்டுவிட்டேன். ஆகவே, நான் திருப்தி யடைகிறேன்; (இந்த எண்ணிக்கையை) ஒப்புக்கொள்கிறேன்” என்று கூறினேன். பிறகு (அந்த இடத்தை) நான் கடந்தபோது (அல்லாஹ்வின் தரப்பிலிருந்து), “நான் என் (ஐந்து நேரத் தொழுகை எனும்) விதியை நடைமுறைப்படுத்திவிட்டேன். என் அடியார்களுக்கு (ஐம்பது வேளை களிலிருந்து ஐந்து நேரமாகக் குறைத்துக் கடமையை) எளிதாக்கிவிட்டேன்” என்று ஒரு (அசரீரிக்) குரல் ஒலித்தது.135 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3888,
			"arabicnumber": 3888,
			"text": "இக்ரிமா (ரஹ்) அவர்கள் கூறியதாவது: “(நபியே! இப்போது) நாம் உங்களுக்குக் காட்டிய (அந்த இரவுக்) காட்சியையும், குர்ஆனில் சபிக்கப்பட்டுள்ள மரத்தையும் (இந்த) மக்களுக்கு ஒரு சோதனையாகவே ஆக்கியுள்ளோம்” என்ற (17:60) இறைவசனத்திற்கு விளக்கம் அளித்தபோது இப்னு அப்பாஸ் (ரலி) அவர்கள், “இது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பைத்துல் மக்திசுக்கு அழைத்துச் செல்லப்பட்ட இரவில் அவர்களுக்குக் காட்டப்பட்ட காட்சிகளைக் குறிக்கும். குர்ஆனில் சபிக்கப்பட்டுள்ள மரம் என்பது “ஸக்கூம்' என்னும் (நரகத்திலுள்ள கள்ளிச்) செடியைக் குறிக்கும்” என்று சொன்னார்கள்.136 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3889,
			"arabicnumber": 3889,
			"text": "அப்துர் ரஹ்மான் பின் அப்தில் லாஹ் பின் கஅப் (ரஹ்) அவர்கள் கூறிய தாவது: கஅப் பின் மாலிக் (ரலி) அவர்கள் (முதுமையடைந்து) கண்பார்வையிழந்து விட்டபோது அவர்களைக் கரம் பிடித்து அழைத்துச் செல்பவர்களாயிருந்த (அவர்களின் மகனும் என் தந்தையுமான) அப்துல்லாஹ் பின் கஅப் (ரஹ்) அவர்கள் என்னிடம் கூறினார்கள்: என் தந்தை கஅப் பின் மாலிக் (ரலி) அவர்கள், தபூக் போரின்போது, நபி (ஸல்) அவர்களுடன் செல்லாமல் (அசிரத்தை காரணமாக) தாம் பின்தங்கிவிட்ட வேளை குறித்து என்னிடம் பேசியதை நான் செவியுற்றேன்... என்று கூறிவிட்டு முழு ஹதீஸையும் சொன்னார்கள்.138 இப்னு புகைர் (ரஹ்) அவர்கள் உகைல் (ரஹ்) வாயிலாக அறிவிக்கும் அறிவிப்பில், கஅப் பின் மாலிக் (ரலி) அவர்கள் கூறுவதாக அறிவிக்கிறார்கள்: “அல்அகபா' (எனுமிடத்தில் உறுதி மொழி அளித்த நிகழ்ச்சி நடந்த) இரவில் இஸ்லாத்தை ஏற்பதாக (மதீனாவாசிகளான) நாங்கள் பிரமாணம் செய்த வேளையில் நான் நபி (ஸல்) அவர்களுடன் இருந்தேன். இதற்குப் பதிலாகப் பத்ர் போரில் கலந்து (கொள்கின்ற வாய்ப்பைப் பெற்றுக்) கொள்ளுதல் எனக்கு இருந்திருக்க வேண்டும் என நான் விரும்பியதில்லை; “அல்அகபா' பிரமாணத்தைவிட “பத்ர்' மக்களிடையே பெயர் பெற்றதாக இருந் தாலும் சரியே! அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3890,
			"arabicnumber": 3890,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: என் இரு மாமன்மார்களும் அல்அகபா உடன்படிக்கையில் கலந்துகொண்டனர். சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள், “அந்த இருவரில் ஒருவர் பராஉ பின் மஅரூர் (ரலி) அவர்களாவார்”139 என்று சொன்னார் என அபூஅப்தில்லாஹ் புகாரீயாகிய நான் கூறுகிறேன். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3891,
			"arabicnumber": 3891,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: அல்அகபா உடன்படிக்கையில் கலந்துகொண்டவர்களில் நானும், என் தந்தையும், என் இரு தாய்மாமன்மார்களும் அடங்குவோம். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3892,
			"arabicnumber": 3892,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் பத்ர் போரில் கலந்து கொண்டவரும், இரவில் நடந்த “அல்அகபா' உடன்பாட்டில் கலந்துகொண்ட நபித் தோழர்களில் ஒருவருமான உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: (அல்அகபா இரவில்) தம்மைச் சுற்றிலும் தம் தோழர்களின் ஒரு குழுவினர் அமர்ந்திருக்க, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “வாருங்கள்; நீங்கள் அல்லாஹ்வுக்கு எதையும் இணைவைக்க மாட்டீர்கள் என்றும், திருடமாட்டீர்கள் என்றும், விபசாரம் புரியமாட்டீர்கள் என்றும், உங்கள் குழந்தைகளைக் கொல்லமாட்டீர்கள் என்றும், உங்கள் தரப்பிலிருந்து நீங்களே இட்டுக்கட்டும் அவதூறு எதனையும் புனைந்துகொண்டு வரமாட்டீர்கள் என்றும், எனக்கு நல்ல விஷயங்களில் மாறு செய்யமாட்டீர்கள் என்றும் என்னிடம் உறுதிமொழி கொடுங்கள். உங்களில் எவர் (இந்த உறுதிமொழியை) நிறைவேற்றுகிறாரோ அவருக்குரிய நற்பலனைத் தருவது அல்லாஹ்வின் பொறுப்பாகும். இவற்றில் (மேற்சொன்ன குற்றங்களில்) எதையேனும் ஒருவர் செய்து, அதற்காக அவர் இந்த உலகத்தி லேயே (இஸ்லாமியச் சட்டப்படி) தண்டிக் கப்பட்டுவிட்டால், அதுவே அவருக்குப் பரிகாரமாகிவிடும். இவற்றில் எதையேனும் ஒருவர் செய்து அல்லாஹ் அவரது குற்றத்தை (உலக வாழ்வில்) மறைத்து விட்டால் (அவரது மறுமை நிலை குறித்த) அவரது விவகாரம் அல்லாஹ்விடம் உண்டு. (மறுமையில்) அவன் நாடினால் அவரைத் தண்டிப்பான்; அவன் நாடினால் அவரை மன்னிப்பான்” என்று சொன்னார்கள். நாங்கள் நபி (ஸல்) அவர்களிடம் அவற்றுக்காக உறுதிமொழி கொடுத்தோம்.140 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3893,
			"arabicnumber": 3893,
			"text": "உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களி டம் உறுதிமொழி கொடுத்த (மதீனாவின்) தலைவர்களில் நானும் ஒருவனாவேன். நாங்கள் அல்லாஹ்வுக்கு எதையும் இணை கற்பிக்கமாட்டோம் என்றும், திருடமாட்டோம் என்றும், விபசாரம் புரியமாட்டோம் என்றும், அல்லாஹ் புனிதப்படுத்தியுள்ள (மனித) உயிரை நியாயமின்றிக் கொல்லமாட்டோம் என்றும், நாங்கள் (பிறர் பொருளை) அபகரிக்க மாட்டோம் என்றும், இந்த வாக்குறுதிகளை நாங்கள் நிறைவேற்றினால் (எங்களுக்குச்) சொர்க்கம் உண்டு என நாங்களாகத் தீர்ப்பளித்துக்கொள்ளமாட்டோம்; (இறைவ னிடமே ஒப்படைத்துவிடுவோம்) என்றும், இக்குற்றங்களில் எதையேனும் நாங்கள் செய்துவிட்டால் அதன் தீர்ப்பு அல்லாஹ் விடமே உண்டு என்றும் நாங்கள் நபி (ஸல்) அவர்களிடம் உறுதி மொழி கொடுத்தோம். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3894,
			"arabicnumber": 3894,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் ஆறு வயதுடையவளாக இருந்தபோது நபி (ஸல்) அவர்கள் என்னை மணந்துகொண்டார்கள். பிறகு நாங்கள் மதீனா வந்து ஹாரிஸ் பின் அல்கஸ்ரஜ் குலத்தாரிடம் தங்கினோம். எனக்குக் காய்ச்சல் கண்டுவிடவே என் முடிகள் உதிர்ந்து விழுந்தன. பிறகு (என்) முடி வளர்ந்து அதிகமாகிவிட்டது. நான் என் தோழிகள் சிலருடன் ஊஞ்சலாடிக் கொண்டிருந்தபோது என் தாயார் உம்மு ரூமான் (ரலி) அவர்கள் என்னிடம் வந்து என்னைச் சப்தமிட்டு அழைத்தார்கள். நான் அவர்களிடம் சென்றேன். அவர்கள் என்னிடம் எதை நாடி வந்திருக்கிறார்கள் என்பது எனக்குத் தெரியாது. அவர்கள் என் கையைப் பிடித்து (அழைத்துச் சென்று) வீட்டின் கதவருகே என்னை நிறுத்திவிட்டார்கள். நான் (வேகமாக வந்ததால்) எனக்கு மூச்சிறைக் கத் தொடங்கவே, அவர்கள் சிறிது தண்ணீரை எடுத்து என் முகத்தையும் தலையையும் துடைத்துப் பிறகு என்னை வீட்டினுள் கொண்டுசென்றார்கள். அங்கு வீட்டில் சில அன்சாரி பெண்கள் இருந்தார்கள். அவர்கள், “நன்மையுடனும் அருள்வளத்துடனும் வருக! (அல்லாஹ்வின்) நற்பேறு உண் டாகட்டும்” என்று (வாழ்த்துக்) கூறினர். உடனே என் தாய் என்னை அப்பெண்களி டம் ஒப்படைக்க, அவர்கள் என்னை அலங்கரித்து (தாம்பத்தியத்தைத் துவங்கு வதற்காகத் தயார்படுத்தி)விட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முற்பகல் வேளையில் திடீரென வந்தார்கள். அவர்களிடம் அப்பெண்கள் என்னை ஒப்படைத்தனர். நான் அன்று ஒன்பது வயதுடையவளாக இருந்தேன். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3895,
			"arabicnumber": 3895,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: “நான் உன்னைக் கனவில் இருமுறை கண்டேன். உன்னைப் பட்டுத் (துணியின்) துண்டு ஒன்றில் (முக்காடிட்டபடி) கண் டேன். எவரோ, “இது உங்கள் மனைவிதான்; (முக்காட்டை) நீக்கிப் பாருங்கள்' என்று கூற, (நானும் அவ்வாறே பார்த்தேன்.) அது நீயாகவே இருக்கக் கண்டேன். அப்போது நான், “இது (நீ எனக்கு மனைவியாவது) அல்லாஹ்வின் தரப்பிலிருந்து (விதிக்கப் பட்டு) உள்ளதெனில் அதை அவன் நடத்திவைப்பான்' என்று சொல்லிக் கொண்டேன்” என்று நபி (ஸல்) அவர்கள் என்னிடம் கூறினார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3896,
			"arabicnumber": 3896,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவுக்கு (ஹிஜ்ரத் செய்து) செல்வதற்கு மூன்றாண் டுகளுக்கு முன்பு கதீஜா (ரலி) அவர்கள் இறந்துவிட்டார்கள். (அதன்பின்) நபி (ஸல்) அவர்கள் “இரண்டு ஆண்டுகள்' அல்லது “கிட்டத்தட்ட இரண்டாண்டுகள்' (மக்காவில்) தங்கியிருந்தார்கள்; ஆயிஷா (ரலி) அவர்கள் ஆறு வயதுடையவர்களாயிருக்கும் போது அவர்களை மணந்துகொண்டார்கள். பிறகு ஆயிஷா (ரலி) அவர்கள் ஒன்பது வயதுடையவர்களாக இருக்கும்போது அவர்களுடன் நபி (ஸல்) அவர்கள் தாம்பத்திய உறவைத் தொடங்கினார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3897,
			"arabicnumber": 3897,
			"text": "அபூவாயில் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் கப்பாப் பின் அல்அரத் (ரலி) அவர்களை உடல்நலம் விசாரிக்கச் சென்றோம். அப்போது அவர்கள் கூறினார்கள்: நாங்கள் நபி (ஸல்) அவர்களுடன் அல்லாஹ்வின் அன்பை நாடியவர்களாகப் புலம்பெயர்ந்து (ஹிஜ்ரத்) சென்றோம். எங்களுக்கு (அதற்கான) பிரதிபலனையளிப்பது அல்லாஹ்வின் பொறுப்பாகிவிட்டது. எங்களில் ஹிஜ்ரத் செய்ததற்கான (இவ்வுலகப்) பிரதிபலனில் சிறிதையும் பெற்றுக்கொள்ளாமல் சென்றுவிட்டவர்களும் உண்டு. அவர்களில் ஒருவர்தான் முஸ்அப் பின் உமைர் (ரலி) அவர்கள். அவர் உஹுத் போரின்போது கொல்லப்பட்டார். கோடிட்ட வண்ணத் துணி ஒன்றை அவர் விட்டுச்சென்றிருந்தார். நாங்கள் (அவருக்கு கஃபனிடுவதற்காக) அவரது (சடலத்தின்) தலையை அதனால் மூடியபோது அவரு டைய கால்கள் இரண்டும் வெளியே தெரியலாயின. அவருடைய கால்களை மூடினால் அவருடைய தலை தெரிய லாயிற்று. ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், முஸ்அப் (ரலி) அவர்களின் தலையை மூடிவிடும்படியும் அவர்களு டைய இரு கால்களிலும் இத்கிர் புல்லைச் சிறிது போட்டு (மறைத்து)விடும்படியும் எங்களுக்கு உத்தரவிட்டார்கள். (ஹிஜ்ரத் செய்ததற்கான) பலன் கனிந்து அதைப் பறித்து (அனுபவித்து)க்கொண்டிருப்ப வர்களும் எங்களில் உள்ளனர்.145 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3898,
			"arabicnumber": 3898,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: எண்ணத்தைப் பொறுத்தே செயல்கள் அமைகின்றன. ஒருவரது ஹிஜ்ரத் அவர் அடையவிருக்கும் உலக (ஆதாய)த்தைக் குறிக்கோளாகக் கொண்டிருந்தால், அல்லது அவர் மணக்கவிருக்கும் ஒரு பெண்ணை நோக்கமாகக் கொண்டிருந்தால், அவரது ஹிஜ்ரத் எதை நோக்கமாகக் கொண்டதோ அதுவாகவே அமையும். ஒருவரது ஹிஜ்ரத் அல்லாஹ்வையும் அவனுடைய தூதரையும் (திருப்தியுறச் செய்வதைக்) குறிக்கோளாகக் கொண்டிருந்தால் அவரது ஹிஜ்ரத் அல்லாஹ்வையும் அவனுடைய தூதரையும் நோக்கியதாகவே அமைந்திருக்கும். இதை உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.146 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3899,
			"arabicnumber": 3899,
			"text": "முஜாஹித் பின் ஜப்ர் அல்மக்கீ (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், “(மக்கா) வெற்றிக்குப் பிறகு ஹிஜ்ரத் கிடையாது” என்று சொல்லி வந்தார்கள்.147 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3900,
			"arabicnumber": 3900,
			"text": "அதாஉ பின் அபீரபாஹ் (ரஹ்) அவர்கள் கூறியதாவது: நான் உபைத் பின் உமைர் அல்லைஸீ (ரஹ்) அவர்களுடன் ஆயிஷா (ரலி) அவர்களைச் சந்தித்தேன். (அப்போது ஆயிஷா (ரலி) அவர்கள் “ஸபீர்' எனும் மலைக்கருகில் தங்கியிருந்தார்கள்.)148 அவர்களிடம் ஹிஜ்ரத்தைப் பற்றிக் கேட்டோம். அதற்கு அவர்கள், “இன்று (மக்கா வெற்றி கொள்ளப்பட்டுவிட்ட பிறகு) ஹிஜ்ரத் கிடையாது. இறைநம்பிக்கை யாளர்கள் (தம் மார்க்கத்தைப் பின்பற்ற முடியாதவாறு) தாம் சோதிக்கப்பட்டு விடுவோமோ என்று அஞ்சி தமது மார்க்கத்துடன் அல்லாஹ்வையும் அவனுடைய தூதரையும் (திருப்தியுறச் செய்வதைக்) குறிக்கோளாகக் கொண்டு (தம் தாய் நாட்டைத் துறந்து ஒரு காலத்தில்) ஓடிவந்தார்கள். ஆனால், இன்றோ அல்லாஹ் இஸ்லாத்தை ஓங்கச் செய்துவிட்டான். இன்று இறைநம்பிக்கையாளர், தாம் விரும்பிய இடத்தில் தம் இறைவனை வழிபடலாம். ஆயினும் (“ஹிஜ்ரத்'தான் இனி இல்லையே தவிர) ஜிஹாத் (எனும் அறப்போர்) புரிவதும் (அதற்காகவும் பிற நற்செயல்களுக்காகவும்) நாட்டம் கொள்வதும் (இன்றும்) உண்டு” என்று பதிலளித்தார்கள்.149 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3901,
			"arabicnumber": 3901,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: சஅத் பின் முஆத் (ரலி) அவர்கள், “இறைவா! உன் பாதையில் யாரை எதிர்த்துப் போர் புரிய நான் மிகவும் விரும்புகின்றேனோ அவர்கள் உன் தூதரை நம்ப மறுத்து அவர்களை (மக்கா விலிருந்து) வெளியேற்றிய சமுதாயத்தார் தான் என்பதை நீ அறிவாய். இறைவா! எங்களுக்கும் அவர்களுக்குமிடையிலான போரை நீ முடித்து வைத்துவிட்டாய் என நான் எண்ணுகிறேன்” என்று (தம் மரணத் தறுவாயில்) கூறினார்கள். ஆயிஷா (ரலி) அவர்கள் வழியாகவே வரும் மற்றோர் அறிவிப்பில், “உன் னுடைய நபியை நம்ப மறுத்து அவர்களை வெளியேற்றிய குறைஷிச் சமுதாயத்தார் தான்” என்று (சிறிய வித்தியாசத்துடன்) சஅத் (ரலி) அவர்கள் கூறியதாக இடம் பெற்றுள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3902,
			"arabicnumber": 3902,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் நாற்பதாம் வயதில் நபியாக நியமிக்கப் பட்டார்கள். தமக்கு வேதஅறிவிப்பு (வஹீ) அருளப்பட்டுவந்த நிலையில் மக்காவில் பதிமூன்றாண்டுகள் தங்கியிருந்தார்கள். பிறகு ஹிஜ்ரத் செய்யும்படி அவர்களுக்குக் கட்டளையிடப்பட, ஹிஜ்ரத் செய்து (மதீனாவில்) பத்தாண்டுகள் வாழ்ந்துவந் தார்கள். தம் அறுபத்து மூன்றாம் வயதில் இறந்தார்கள்.150 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3903,
			"arabicnumber": 3903,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நபியாக்கப்பட்டபின்) மக்காவில் பதிமூன்றாண்டுகள் தங்கியிருந்தார்கள். தமது அறுபத்து மூன்றாம் வயதில் இறந்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3904,
			"arabicnumber": 3904,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எந்த நோயில் இறந்தார்களோ அந்த நோயின்போது) சொற்பொழிவு மேடை மீதமர்ந்து, (மக்களுக்கு உரை நிகழ்த்தினார் கள். அதில்,) “அல்லாஹ், தன் அடியார் ஒருவருக்கு உலகச் செல்வத்தில் அவர் விரும்புவ(து எதுவாயினும் அ)தைக் கொடுப்பதாகவும் அல்லது தன்னிடமுள்ள (மறுமைப் பெருவாழ்வு)தனை எடுத்துக் கொள்ளும்படியும் (இரண்டிலொன்றைத் தேர்ந்தெடுத்துக்கொள்ள) வாய்ப்பளித்தான். அப்போது அந்த அடியார் அல்லாஹ் விடமிருப்பதையே தேர்ந்தெடுத்துக் கொண்டார்” என்று சொன்னார்கள். உடனே அபூபக்ர் (ரலி) அவர்கள் அழுதார்கள். மேலும் (நபியவர்களை நோக்கி), “தங்களுக்கு எங்கள் தந்தையரும் அன்னையரும் அர்ப்பணமாகட்டும்” என்று சொன்னார்கள். நாங்கள் அபூபக் ரு(டைய அழுகை)க்காக வியப்படைந்தோம். மக்கள், “இந்த முதியவரைப் பாருங்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அல்லாஹ் தன் அடியார் ஒருவருக்கு உலகச் செல்வத்தில் அவர் விரும்புவதைக் கொடுப்பதாகவும் அல்லது தன்னிடமிருப் பதை எடுத்துக்கொள்ளும்படியும் இரண்டிலொன்றைத் தேர்ந்தெடுத்துக்கொள்ள வாய்ப்பு வழங்கிய (மகிழ்ச்சியான விஷயத்)தைத் தெரிவித்துக்கொண்டிருக்க இவர், “தங்களுக்கு எங்கள் தந்தையரும் அன்னையரும் அர்ப்பணமாகட்டும்' என்று (அழுதபடி) கூறுகிறாரே” என்று சொன்னார்கள் -அல்லாஹ்வின் தூதர் (ஸல்) அவர்களே இப்படி வாய்ப்பு வழங்கப்பட்டவராவார்- அபூபக்ர் (ரலி) அவர்கள்தான் எங்களில் அல்லாஹ்வின் தூதரைப் பற்றி அதிகம் அறிந்தவராக இருந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “தம் தோழமையாலும் தம் செல்வத்தாலும் எனக்குப் பேருபகாரம் புரிந்தவர் அபூபக்ர் அவர்கள்தான். என் சமுதாயத்தாரிóருந்து எவரையேனும் என் உற்ற நண்பராக நான் ஆக்கிக்கொள்வதாயிருந்தால் அபூபக் ரையே ஆக்கிக்கொண்டிருப்பேன்; எனினும், இஸ்லாத்தின் (காரணத்தால் உள்ள) நட்பே (சிறந்ததாகும்;) போதுமான தாகும். (எனது இந்தப்) பள்ளிவாசலில் உள்ள வாசல்களில் அபூபக்ரின் வாசல் தவிர மற்றவை கண்டிப்பாக நீடிக்க வேண்டாம்” என்று சொன்னார்கள்.151 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3905,
			"arabicnumber": 3905,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: என் பெற்றோர் (அபூபக்ரும் உம்மு ரூமானும்) எனக்கு விவரம் தெரிந்தது முதல் (இஸ்லாமிய) மார்க்கத்தைக் கடைப்பிடிப்பவர்களாகவே இருந்தனர். பகலின் இரண்டு ஓரங்களான காலையிலும் மாலையிலும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் வராமல் எங்களின் எந்த நாளும் கழிந்ததில்லை. (மக்கா நகரில் வாழ்ந்த) முஸ்லிம்கள் இணை வைப்பவர் களால் பல்வேறு துன்பங்கள்) சோதனை களுக்கு உள்ளாக்கப்பட்டபோது, அபூபக்ர் அவர்கள் அபிசீனிய நாட்டை நோக்கி, நாடு துறந்து (ஹிஜ்ரத்) சென்றார்கள். அவர்கள் (யமன் செல்லும் வழியில்) “பர்குல் கிமாத்'152 எனும் இடத்தை அடைந்தபோது இப்னுத் தஃகினா என்பவர் அவர்களைச் சந்தித்தார். -அவர் “அல்காரா' எனும் (பிரபல) குலத்தின் தலைவராவார்- அவர் “அபூபக்ரே எங்கே செல்கிறீர்?” என்று கேட்டார். “என் சமுதாயத்தார் என்னை (நாடு துறந்து) வெளியேறிச் செல்லும் நிலைக்குத் தள்ளிவிட்டனர். ஆகவே, நான் பூமியில் பரவலாகப் பயணம் செய்து (நிம்மதியாக) என் இறைவனை வழிபடப்போகிறேன்” என்று அவர்கள் பதிலளித்தார்கள். அப்போது இப்னுத் தஃகினா, “அபூபக்ரே! தங்களைப் போன்றவர்கள் (தாமாகவும்) வெளியேறக் கூடாது, (பிறரால்) வெளியேற்றப்படவும் கூடாது. (ஏனெனில்) நீங்கள் ஏழைகளுக்காக உழைக்கிறீர்கள். இரத்த பந்த உறவுகளைப் பேணி நடந்து கொள்கிறீர்கள். (சிரமப்படுவோரின்) பாரத்தைச் சுமக்கிறீர்கள். விருந்தினர் களை உபசரிக்கிறீர்கள். சத்திய சோதனை களில் (ஆட்பட்டோருக்கு) உதவி புரிகிறீர்கள் என்று (அவர்களின் அறச் சேவைகளைப் புகழ்ந்து) கூறிவிட்டு, “தங்களுக்கு நான் அடைக்கலம் தரு கிறேன். நீங்கள் (மக்காவிற்கே) திரும்பிச் சென்று உங்களது (அந்த) ஊரிலேயே உங்கள் இறைவனை வழிபடுங்கள்” என்று கூறினார். அபூபக்ர் (அபிசீனிய பயணத்தை ரத்துச் செய்துவிட்டு மக்காவிற்குத்) திரும்பினார்கள். அவர்களுடன் இப்னுத் தஃகினாவும் பயணமா(கித் திரும்பி)னார். மாலையில் இப்னுத் தஃகினா குறைஷிக் குல பிரமுகர்களைப் போய்ச் சந்தித்து அவர்களிடம், “(நாட்டு மக்களுக்காகப் பாடுபடும்) அபூபக்ரைப் போன்றவர்கள் (நாட்டிலிருந்து தாமாக) வெளியேறுவதோ, (பிறரால்) வெளியேற்றப்படுவதோ கூடாது. ஏழைகளுக்கு உழைக்கும், உறவுகளைப் பேணி வாழும், (சிரமப்படுவர்களின்) பாரஞ் சுமந்துவரும், விருந்தினர்களை உபசரித்துவரும், சத்திய சோதனைகளில் (ஆட்படுத்தப்பட்டோருக்கு) உதவிவரும் ஒரு (ஒப்பற்ற) மனிதரையா (நாடு துறந்து) வெளியேறிச் செல்லும் நிலைக்கு உள்ளாக்குகிறீர்கள்?” என்று கேட்டார். (அபூபக்ர் (ரலி) அவர்களுக்குத் தாம் அடைக்கலம் தரப்போவதாகக் கோரிய) இப்னுத் தஃகினாவின் அடைக்கலத்தை குறைஷியர் மறுக்கவில்லை. அவர்கள் இப்னுத் தஃகினாவை நோக்கி, “அபூபக்ர், தமது இல்லத்திற்குள்ளேயே தமது இறைவனை வழிபடவோ, தொழவோ, தாம் விரும்பியதை ஓதவோ செய்யட்டும். ஆனால், இவற்றின் மூலம் எங்களுக்கு இடையூறு செய்யவோ இவற்றைப் பகிரங்கமாகச் செய்யவோ கூடாது. ஏனெனில் எங்கள் மனைவி, மக்கள் (புதிய மத நம்பிக்கை மற்றும் வணக்க வழிபாட்டு முறைகளைப் பார்த்து) குழப்ப மடைந்துவிடுவார்களோ என்று நாங்கள் அஞ்சுகிறோம் என அவரிடம் கூறி விடுங்கள்” என்று சொன்னார்கள். அ(வர்கள் கூறிய)தை இப்னுத் தஃகினா அபூபக்ர் (ரலி) அவர்களிடம் தெரிவித்தார். அதன்படி அபூபக்ர் (ரலி) அவர்கள் தமது இல்லத்திற்குள் தம்முடைய இறைவனை வழிபட்டும், தமது தொழுகை யைப் பகிரங்கப்படுத்தாமலும் தமது வீட்டுக்கு வெளியில் (திருக்குர்ஆன் வசனங்களை) ஓதாமலும் (அவர்கள் விதித்த நிபந்தனைப்படி) இருந்துவந்தார்கள். பிறகு அபூபக்ர் (ரலி) அவர்களுக்கு (மாற்று யோசனை) தோன்றியது. தமது வீட்டு முற்றத்தில் தொழுமிடம் ஒன்றை உருவாக்கி அதில் தொழுதுகொண்டும் திருக்குர்ஆனை ஓதியும் வந்தார்கள். அப்போது, இணைவைப்பாளர்களின் மனைவி, மக்கள் அபூபக்ர் அவர்களைப் பார்த்து ஆச்சரியப்பட்டு (அவர்களைச் சூழ்ந்து கொண்டு வேடிக்கை பார்ப்பதற்காக) அவர்கள்மீது முண்டியடித்து விழுந்தனர். அபூபக்ர் (ரலி) அவர்கள் குர்ஆன் ஓதும்போது தம் கண்களைக் கட்டுப்படுத்த முடியாமல் (கண்ணீர் உகுத்த வண்ணம்) அதிகமாக அழக்கூடியவராக இருந்தார்கள். (அபூபக்ர் அவர்களின்) இந்த நடவடிக்கை (எங்கே தம்முடைய இளகிய இதயம் படைத்த மனைவி, மக்களை மதம்மாறச் செய்துவிடுமோ என்ற அச்சம்) இணைவைப்பாளர்களான குறைஷியரைப் பீதிக்குள்ளாக்கியது.153 அதனால் அவர்கள் இப்னுத் தஃகினாவிடம் ஆளனுப்பினர். அவரும் குறைஷியரிடம் வந்தார். அப்போது அவர்கள், “அபூபக்ர் தமது இல்லத்திற்குள்ளேயே தம் இறைவனை வழிபட்டுக்கொள்ளட்டும் என்று (நிபந்தனையிட்டு) அவருக்கு நீங்கள் அடைக்கலம் தந்ததன் பேரிலேயே நாங்கள் அவருக்கு அடைக்கலம் தந்தோம். அவர் அதை மீறிவிட்டுத் தமது வீட்டுமுற்றத்தில் தொழுமிடம் ஒன்றை உருவாக்கி அந்த இடத்தில் பகிரங்கமாகத் தொழுதுகொண்டும், (குர்ஆனை) ஓதிக் கொண்டும் இருக்கிறார். நாங்கள் எங்கள் மனைவி, மக்கள் குழப்பத்திற்குள்ளாகி விடுவார்களோ என்று அஞ்சுகிறோம். எனவே அபூபக்ரைத் தடுத்துவையுங்கள். அவர், அவருடைய இறைவனைத் தமது இல்லத்தில் வழிபடுவதோடு மட்டும் நிறுத்திக்கொள்ள விரும்பினால் அவ்வாறு செய்யட்டும். அவர் அதை மறுத்துப் பகிரங்கப்படுத்தவே செய்வேன் என்றால், அவரிடம் உமது (அடைக்கலப்) பொறுப் பைத் திரும்பத் தருமாறு கேளுங்கள். ஏனெனில், (உங்களது உடன்பாட்டை முறித்து) உங்களுக்கு நாங்கள் மோசடி செய்வதை வெறுக்கிறோம். (அதே சமயம்) அபூபக்ர் (அவற்றை) பகிரங்கமாகச் செய்ய நாங்கள் அனுமதிப்போராகவும் இல்லை” என்று கூறினர். ஆயிஷா (ரலி) அவர்கள் கூறுகிறார்கள்: இப்னுத் தஃகினா அபூபக்ர் (ரலி) அவர்களிடம் வந்து, “நான் எ(ந்)த (நிபந்தனையி)ன் பேரில் உங்களிடம் ஒப்பந்தம் செய்தேன் என்பதைத் தாங்கள் அறிவீர்கள். ஆகவே ஒன்று, அதனோடு மட்டும் நீங்கள் நிறுத்திக்கொள்ள வேண்டும். அல்லது எனது (அடைக்கலப்) பொறுப்பை என்னிடம் திரும்பத் தந்துவிட வேண்டும். ஏனென்றால், நான் உடன்படிக்கை செய்துகொண்ட ஒரு மனிதரின் விஷயத்தில் ஏமாற்றப்பட்டேன் என்று அரபியர் கேள்விப்படுவதை நான் விரும்பமாட்டேன்” என்று கூறினார். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “உமது அடைக்கலத்தை உம்மிடமே திரும்பத் தந்துவிடுகிறேன். வல்லமையும் மாண்புமிக்க அல்லாஹ்வின் அடைக்கலம் குறித்து நான் திருப்திப்படுகிறேன்” என்று கூறினார்கள். அன்றைக்கு நபி (ஸல்) அவர்கள் மக்காவில் இருந்துகொண்டி ருந்தார்கள். அப்போது நபி (ஸல்) அவர்கள் முஸ்லிம்களைப் பார்த்து, “இரு கருங்கல் மலைகளுக்கிடையே பேரீச்ச மரங்கள் நிறைந்த (மதீனா) பகுதியை நீங்கள் ஹிஜ்ரத் செல்கின்ற நாடாக நான் (கனவில்) காட்டப்பட்டேன்” என்று கூறினார்கள். எனவே, மதீனா நோக்கி ஹிஜ்ரத் சென்றவர்கள் சென்றார்கள். (ஏற்கெனவே) அபிசீனிய நாட்டிற்கு ஹிஜ்ரத் சென்றிருந்த வர்கள் பலர் (முஸ்லிம்கள் மதீனாவில் குடியேறுவதைக் கேள்விப்பட்டு) மதீனா வுக்குத் திரும்பினார்கள். (மக்காவிலிருந்து) அபூபக்ர் அவர்களும் மதீனா நோக்கி (ஹிஜ்ரத் புறப்பட) ஆயத்தமானார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “சற்று பொறுங்கள். எனக்கு (ஹிஜ்ரத்திற்கு) அனுமதி வழங்கப்படுவதை நான் எதிர்பார்த்துக்கொண்டிருக்கிறேன்” என்று (அபூபக்ர் (ரலி) அவர்களிடம்) கூறினார்கள். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “என் தந்தை தங்களுக்கு அர்ப்பணம்; அனுமதியை(த்தான்) எதிர்பார்க்கிறீர்களா?” என்று கேட்டார்கள். அதற்கு, “ஆம் (எதிர்பார்க்கிறேன்)” என்று நபி (ஸல்) அவர்கள் பதிலளித்தார்கள். ஆகவே அபூபக்ர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களுடன் (ஹிஜ்ரத்) செல்வதற்காகத் தன்(பயணத்தி)னை நிறுத்தினார்கள். மேலும் அபூபக்ர் அவர்கள் (இந்தப் பயணத்திற் காகவே) தம்மிடம் இருந்த இரு ஊர்தி ஒட்டகங்களுக்கு நான்கு மாதம் கருவேலந் தழையைத் தீனிபோட்டு (வளர்த்து)வந்தார்கள்.154 ஆயிஷா (ரலி) அவர்கள் (தொடர்ந்து) கூறுகிறார்கள்: நாங்கள் ஒருநாள் அபூபக்ர் (ரலி) அவர்களின் இல்லத்தில் உச்சிப் பொழுதில் அமர்ந்துகொண்டிருந்தோம். அப்போது ஒருவர் அபூபக்ர் (ரலி) அவர்களிடம், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தமது தலையை மூடிய வண்ணம் -நம்மிடம் வருகை தராத ஒரு நேரத்தில் (வழக்கத்திற்கு மாற்றமாக)- இதோ வந்து கொண்டிருக்கிறார்கள்” என்று கூறினார். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “என் தந்தையும் என் தாயும் (நபி) அவர்களுக்கு அர்ப்பணமாகட்டும்! அல்லாஹ்வின் மீதாணையாக! ஏதோ (முக்கிய) விஷயம் தான் அவர்களை இந்த நேரத்தில் (இங்கு) வரச்செய்திருக்கிறது” என்று கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்து (இல்லத்திற்குள் நுழைய) அனுமதி கோரினார்கள். அவர்களுக்கு அனுமதியளிக்கப்பட்ட வுடன் அவர்கள் உள்ளே நுழைந்து, அபூபக்ர் (ரலி) அவர்களிடம், “உங்களிடம் இருப்பவர்களை வெளியேபோகச் சொல்லுங்கள். (உங்களிடம் ஒரு ரகசியம் பேச வேண்டும்)” என்று கூறினார்கள். அதற்கு, அபூபக்ர் (ரலி) அவர்கள் (இல்லத்திற்குள் இருக்கும்) இவர்கள் உங்களுடைய (துணைவியின்) குடும்பத்தார்தான். என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும்! அல்லாஹ்வின் தூதரே!” என்று சொன்னார்கள். அதற்கு நபி (ஸல்) அவர்கள் (ஹிஜ்ரத்) புறப்பட்டுச் செல்ல எனக்கு அனுமதி வழங்கப்பட்டு விட்டது” என்று கூறினார்கள். அப்போது அபூபக்ர் (ரலி) அவர்கள், “தங்களுடன் நானும் வர விரும்புகிறேன்! என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும் அல்லாஹ்வின் தூதரே!” என்று கேட்டார்கள். “சரி! (நீங்களும் வாருங்கள்)” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பதிலளித்தார்கள். “அல்லாஹ்வின் தூதரே! என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும். இந்த என் இரு ஊர்தி ஒட்டகங்களில் ஒன்றைத் தாங்கள் எடுத்துக்கொள்ளுங்கள்” என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “விலைக்குத்தான் (இதை நான் எடுத்துக்கொள்வேன்)” என்று கூறினார்கள். ஆயிஷா (ரலி) அவர்கள் கூறுகிறார் கள்: அவர்கள் இருவருக்காகவும் தேவையான பயண ஏற்பாடுகளை வெகு விரைவாக நாங்கள் செய்து முடித்தோம். ஒரு தோல்பையில் பயண உணவை நாங்கள் தயார் செய்துவைத்தோம். அப்போது அபூபக்ரின் மகள் (என் சகோதரி) அஸ்மா தனது இடுப்புக் கச்சிலிருந்து ஒரு துண்டை(க் கிழித்து) அதை அந்தப் பையின் வாய்மீது வைத்துக் கட்டினார்கள். இதனால்தான் அவர்களுக்கு “கச்சுடையாள்' என்று பெயர் வந்தது. பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் (பயணம் புறப்பட்டு) “ஸவ்ர்' மலையில் உள்ள ஒரு குகைக்கு வந்து சேர்ந்து அதில் மூன்று நாட்கள் ஒளிந்திருந்தார்கள். (அந்த மூன்று நாட்களில்) அவர்கள் இருவருடன் அப்துல்லாஹ் பின் அபீபக்ரும் இரவில் வந்து தங்கியிருப்பார் -அவர் சமயோசித அறிவு படைத்த, புத்திக் கூர்மையுள்ள இளைஞராக இருந்தார்- பின்னிரவு (சஹர்) நேரத்தில் அவர்கள் இருவரைவிட்டுப் புறப்பட்டு மக்கா குறைஷியருடன் இரவில் தங்கியிருந்தவர் போல அவர்களுடன் காலையில் இருப்பார். அவர்கள் இருவரைப் பற்றி (குறைஷியரால் செய்யப்படும்) சூழ்ச்சிகளைக் கேட்டு, அவற்றை நினைவில் இருத்திக்கொண்டு இருள் கவிழும் நேரத்தில் அவர்கள் இருவரிடமும் அந்தச் செய்திகளைக் கொண்டுவந்துவிடுவார். அவர்கள் இருவருக்காக அபூபக்ர் (ரலி) அவர்களின் (முன்னாள்) அடிமை ஆமிர் பின் ஃபுஹைரா (அபூபக்ர் அவர்களின்) மந்தையிலிருந்து ஒரு பால் தரும் ஆட்டை மேய்த்து வருவார். இரவில் சிறிது நேரம் கழிந்தவுடன் அதனை அவர்கள் இருவரிடமும் ஓட்டிவருவார். அந்தப்பாலிலேயே இருவரும் இரவைக் கழித்துவிடுவார்கள்-அது புத்தம் புதிய, அடர்த்தி அகற்றப்பட்ட பாலாகும் -அந்த ஆட்டை ஆமிர் பின் ஃபுஹைரா இரவின் இருட்டு இருக்கும்போதே விரட்டிச் சென்றுவிடுவார். இதை (அவர்கள் இருவரும் அந்தக் குகையில் தங்கியிருந்த) மூன்று இரவுகளில் ஒவ்வோர் இரவிலும் அவர் செய்துவந்தார். மேலும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும், அபூபக்ர் (ரலி) அவர்களும் பனூ அப்த் பின் அதீ குலத்தில் “பனூ அத்தீல்' எனும் கிளையைச் சேர்ந்த கை தேர்ந்த ஒருவரை155 பயண வழிகாட்டி யாக இருக்கக் கூலிக்கு அமர்த்தினர். அவர் ஆஸ் பின் வாயில் அஸ்ஸஹ்மீ எனும் குலத்தாருடன் நட்புறவு ஒப்பந்தம் செய்துகொண்டிருந்தார். (ஆனாலும்) அவர் குறைஷி இறைமறுப்பாளர்களின் மதத்தில் இருந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் அவரை நம்பி, தங்களது இரு ஊர்தி ஒட்டகங்களை ஒப்படைத்து மூன்று இரவுகளுக்குப் பின் “ஸவ்ர்' குகைக்கு வந்துவிடுமாறு வாக்குறுதி வாங்கியிருந்தனர். மூன்றாம் (நாள்) அதிகாலையில் அந்த இரு ஊர்திகளுடன் (அவர் ஸவ்ர் குகைக்கு வந்து சேர்ந்தார்.) அவர்கள் இருவருடன் ஆமிர் பின் ஃபுஹைராவும் பயண வழிகாட்டியும் சென்றனர். பயண வழிகாட்டி அவர்களைக் கடற்கரைப் பாதையில் அழைத்துச் சென்றார்.156 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "சுராகா பின் (மாலிக் பின்) ஜுஅஷும் (ரலி) அவர்கள் கூறியதாவது: குறைஷிக் குலத்தின் தூதுவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை யும் அபூபக்ர் (ரலி) அவர்களையும் கொலை செய்பவருக்கு, அல்லது (உயிருடன்) கைதுசெய்து வருபவருக்கு இருவரில் ஒவ்வொருவருக்கும் (நூறு ஒட்டகம் என்று) பரிசை நிர்ணயம் செய்(து அறிவித்)தவர்களாக எங்களிடம் வந்த னர். அப்போது நான் எங்களது பனூ முத்லிஜ் சமுதாயத்தின் அவைகளில் ஒன்றில் அமர்ந்திருந்தேன். அப்போது அவர்களில் ஒருவர் எழுந்து வந்து, அமர்ந்துகொண்டிருந்த எங்களிடையே நின்றுகொண்டு, “சுராகாவே! சற்றுமுன் நான் கடலோரத்தில் சில உருவங்களைப் பார்த்தேன். அவர்கள் முஹம்மதும் அவருடைய தோழர்களும் தான் என்று நான் கருதுகிறேன்” என்று கூறினார். அவர்கள் முஹம்மதும் தோழர்களும் தான் என்று நான் அறிந்துகொண்டேன். (இருப்பினும் அவரைத் திசை திருப்புவதற் காக) “அவர்கள் முஹம்மதும் தோழர்களும் அல்லர். மாறாக, இன்னார் இன்னாரைத்தான் நீ பார்த்திருப்பாய். அவர்கள் எங்கள் கண்ணெதிரேதான் (தங்களின் காணாமற்போன ஒட்டகங்களைத் தேடிப்)போனார்கள்” என்று நான் அவரிடம் கூறினேன். பிறகு அந்த அவையிலேயே சிறிது நேரம் இருந்தேன். அதற்குப் பிறகு எழுந்து (எனது இல்லத்திற்குள்) நுழைந்து என் அடிமைப் பெண்ணிடம் எனது குதிரையை வெளியே கொண்டுவரும்படி உத்தரவிட்டேன். - அப்போது குதிரை ஒரு மலைக்குன்றுக்கு அப்பால் இருந்தது.- எனக்காக அதை அவள் (அங்கே) கட்டிவைத்திருந்தாள். பின்பு, நான் என்னுடைய ஈட்டியை எடுத்துக்கொண்டு வீட்டின் பின்புற வாசல் வழியாக வெளியேறினேன். (ஈட்டியை நான் தாழ்த்திப் பிடித்திருந்ததால்) அதன் கீழ் முனையால் (என்னையும் அறியாம லேயே) தரையில் கோடு கிழித்தேன். மேலும், அதன்மேல் நுனியை தாழ்த்திக் கொண்டு என் குதிரையிடம் வந்து அதன் மீது ஏறிக்கொண்டேன். அதன் முன்னங் கால் இரண்டையும் ஒரே நேரத்தில் உயர்த்தி ஒரே நேரத்தில் பூமியில் வைக்குமாறு செய்து மிக வேகமாகப் புறப்பட்டு அவர்களை நெருங்கினேன். அப்போது எனது குதிரை காலிடறி அதிலிருந்து நான் விழுந்துவிட்டேன். உடனே நான் எழுந்து எனது கையை அம்புக்கூட்டை நோக்கி நீட்டி, அதிலி ருந்து (சகுனச் சொற்கள் எழுதப்பட்ட) அம்புகளை எடுத்தேன். அவற்றின் மூலம் என்னால் அவர்களுக்குப் பாதிப்பை உருவாக்க முடியுமா; அல்லது முடியாதா என்று குறிபார்த்தேன். நான் விரும்பாத (வகையில், என்னால் அவர்களுக்குப் பாதிப்பு ஏற்படுத்த முடியாது என்ப)தே வந்தது. என் அம்புகளுக்கு மாறு செய்துவிட்டு எனது குதிரையில் ஏறினேன். அது பாய்ந்த வண்ணம் சென்றது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (திருக்குர்ஆன்) ஓதியதை நான் கேட்டேன். அவர்கள் திரும்பிப் பார்க்கவில்லை. அபூபக்ர் அவர்கள் அடிக் கடி திரும்பிப் பார்த்துக்கொண்டிருந்தார்கள். (அப்போது) எனது குதிரையின் முன்கால்கள் இரண்டும் முட்டுக் கால்கள்வரையிலும் பூமியில் புதைந்துகொண்டன. நான் குதிரையிலிருந்து கீழே விழுந்துவிட்டேன். பிறகு (அதை எழச்செய்வதற்காக) அதை நான் அரற்றினேன். அது எழுந்(திருக்க முயற்சித்)தது. (ஆனால்,) அதன் கால்களை அதனால் வெளியே எடுக்க முடியவில்லை. அது நேராக எழுந்து நின்றபோது இரு முன்னங்கால்களின் அடிச் சுவட்டிலிருந்து புகை போல வானத்தில் பரவலாகப் புழுதி கிளம்பிற்று. உடனே நான் (எனது) அம்புகளைக் கொண்டு (சகுனக்) குறிபார்த்தேன். நான் விரும்பாததே வந்தது. உடனே நான் எனக்கு (உயிர்) பாதுகாப்பு நல்கும்படி அவர்களை அழைத்தேன். உடனே அவர்கள் நின்றுவிட்டனர். நான் எனது குதிரையிலேறி அவர்களிடம் வந்து சேர்ந்தேன். அவர்களைவிட்டு (எனது குதிரை) தடுக்கப்பட்ட அந்த நிகழ்ச்சியை நான் கண்டபோது எனது மனதிற்குள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் (மார்க்க) விஷயம் மேலோங்கும் என்று தோன்றியது. நான் அல்லாஹ்வின் தூதரிடம், “உங்களுடைய (குறைஷி) சமுதாயத்தார் உங்களுக்காகப் பரிசை நிர்ணயித்துள்ள னர்” என்று கூறிவிட்டு அந்த (குறைஷி) மக்கள் முஸ்லிம்களைப் பற்றி என்ன எண்ணுகிறார்கள் என்ற தகவல்களை அவர்களிடம் எடுத்துச் சொன்னேன். மேலும், எனது பயண உணவுப் பொருள் களை எடுத்துக்காட்டினேன். அவர்கள் என்னிடமிருந்து ஒன்றையும் (எடுத்து) எனக்கு குறைவு செய்யவுமில்லை; (என்னிடமிருந்த எதையும்) அவர்கள் இருவரும் என்னிடம் கேட்கவுமில்லை. ஆயினும், நபி (ஸல்) அவர்கள் (என்னிடம்), “எங்களைப் பற்றி(ய செய்தியை) மறைத்துவிடு” என்று கூறினார்கள். உடனே, நான் நபி (ஸல்) அவர்களிடம் எனக்கு ஒரு பாதுகாப்புப் பத்திரம் எழுதித் தரும்படி வேண்டினேன். அப்போது, நபி (ஸல்) அவர்கள் ஆமிர் பின் ஃபுஹைராவுக்கு உத்தரவிட அவர் பாடமிடப்பட்ட தோல் துண்டில் (பாதுகாப்புப் பத்திரத்தின் வாசகத்தை) எழுதினார். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (சகாக்களுடன் மதீனா நோக்கிச்) சென்றார்கள்.157 உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறுகிறார்கள்: ஷாம் நாட்டிலிருந்து (வியாபாரத்தை முடித்துக்கொண்டு) திரும்பிக்கொண்டிருந்த முஸ்லிம்களின் வணிகக் குழுவிலிருந்த ஸுபைர் பின் அல்அவ்வாம் (ரலி) அவர்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சந்தித்தார்கள். அப்போது ஸுபைர் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கும், அபூபக்ர் (ரலி) அவர்களுக்கும் வெண்ணிற ஆடைகளைப் போர்த்தினார்கள். மதீனா விலிருந்த முஸ்லிம்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்காவிலிருந்து புறப்பட்டுவிட்டதைக் கேள்விப்பட்டு, ஒவ்வொரு நாள் காலையிலும் (மதீனா வின் புறநகர்ப் பகுதியிலிருந்த கருங்கற்கள் நிறைந்த) “அல்ஹர்ரா' எனுமிடத்திற்கு வந்து நண்பகலின் வெப்பம் அவர்களைத் திருப்பியனுப்பும்வரையில் நபி (ஸல்) அவர்களை எதிர்பார்த்துக்கொண்டிருந் தனர். அப்படி ஒருநாள் நீண்ட நேரம் நபி (ஸல்) அவர்களை எதிர்பார்த்துவிட்டு (ஊருக்குள்) அவர்கள் திரும்பித் தத்தமது வீட்டுக்குள் ஒதுங்கியபோது யூதர்களில் ஒருவர் அவர்களது கோட்டைகளில் ஒன்றின் மீது எதையோ பார்ப்பதற்காக ஏறியிருந்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்களின் தோழர்களும் வெண்ணிற ஆடையில், கானல் நீர் விலக வருவதைப் பார்த்தார். அந்த யூதரால் (தம்மைக்) கட்டுப்படுத்த இயலாமல் உரத்த குரலில், “அரபுக் குழாமே! இதோ நீங்கள் எதிர்பார்த்துக் காத்திருந்த உங்களுடைய நாயகர்” என்று கூவினார். உடனே, முஸ்லிம்கள் (நபி (ஸல்) அவர்களைப் பாதுகாப்புடன் வரவேற்பதற்காக). ஆயுதங்களை நோக்கிக் கிளர்ந்தெழுந்தனர். அந்த (கருங்கற்கள் நிறைந்த) அல்ஹர்ராவின் பரப்பில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைச் சந்தித்தார்கள். அவர்களுடன் நபி (ஸல்) அவர்கள் வலப் பக்கமாகத் திரும்பி (“குபா'வில் உள்ள) பனூஅம்ர் பின் அவ்ஃப் குலத்தாரி(ன் குடியிருப்புப் பகுதியி)ல் தங்கினார்கள். இது ரபீஉல் அவ்வல் மாதம் திங்கள்கிழமை நடந்தது. அப்போது மக்களை நோக்கி அபூபக்ர் (ரலி) அவர்கள் எழுந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மௌனமாக அமர்ந்திருந்தார்கள். அப்போது அங்கு வந்திருந்த -நபி (ஸல்) அவர்களைப் பார்த்திராத- அன்சாரிகளில் சிலர் (அபூபக்ர் (ரலி) அவர்களை அல்லாஹ்வின் தூதர் என்று எண்ணிக் கொண்டு) அபூபக்ர் (ரலி) அவர்களுக்கு முகமன் கூறிக்கொண்டிருந்தனர். இறுதியில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்மீது வெயில் பட்டபோது உடனே அபூபக்ர் (ரலி) அவர்கள் சென்று தமது துண்டால் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்மீது நிழலிட்டார்கள். அப்போதுதான் மக்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை அறிந்து கொண்டனர். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பனூ அம்ர் பின் அவ்ஃப் குலத்தாரிடையே (குபாவில்) பத்துக்கும் மேற்பட்ட நாட்கள் தங்கியிருந்து “இறையச் சத்தின்மீது அடித்தளமிடப்பட்ட (மஸ்ஜித் குபா) பள்ளிவாசலை' நிறுவினார்கள். (தாம் தங்கியிருந்த நாட்களில்) அந்தப் பள்ளி வாசலில்தான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுதார்கள். பிறகு தமது வாகனத்தில் ஏறிப் பயணமானார்கள். அவர்களுடன் மக்களும் நடந்து சென்றனர். முடிவாக (அவர்களது) ஒட்டகம் மதீனாவில் (தற்போது) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது பள்ளிவாசல் (அமைந்துள்ள இடம்) அருகே மண்டியிட்டு படுத்துக்கொண்டது. அந்த நாளில் முஸ்லிம்களில் சிலர் அங்குதான் தொழுதுகொண்டிருந்தனர். அது சஅத் பின் ஸுராரா (ரலி) அவர்களின் பொறுப்பிலிருந்த சஹ்ல், சுஹைல் என்ற இரு அநாதைச் சிறுவர்களுக்குச் சொந்தமான பேரீச்சம் பழம் (உலரவைக்கப்படும்) களமாக இருந்தது. அந்த இடத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் வாகனம் மண்டியிட்டுப் படுத்தபோது அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள், “இன்ஷா அல்லாஹ் இதுதான் (நமது) தங்குமிடம்” என்று கூறினார்கள். பிறகு அந்த இரு சிறுவர்களையும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழைத்து அந்தக் களத்தை பள்ளிவாசல் அமைப்பதற்காக விலைக்குக் கேட்டார்கள். அவர்கள் இருவரும், “இல்லை; அதை உங்களுக்கு அன்பளிப்பாகத் தருகிறோம் அல்லாஹ் வின் தூதரே!” என்று கூறினர். அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் சிறுவர்களிட மிருந்து அதை அன்பளிப்பாகப் பெற மறுத்து இறுதியில் அதை அவர்களிட மிருந்து விலைக்கே வாங்கினார்கள். பிறகு அதில் ஒரு பள்ளிவாசலைக் கட்டினார்கள். அதைக் கட்டும்போது அவர்களுடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் செங்கல் சுமக்கலானார்கள். (அப்போது,) “இந்தச் சுமை கைபரின் சுமையல்ல. இது எங்களது இறைவனிடம் (சேமித்துவைக்கப்படும்) நீடித்த நன்மையும் (கைபரின் சுமையை விடப்) பரிசுத்தமானதுமாகும்” என்று (“ரஜ்ஸ்' எனும் ஈரசைச் சீரில் அமைந்த பாடலைப் பாடியபடி) கூறிக்கொண்டிருந்தார்கள். மேலும், “இறைவா (உண்மையான) பலன் மறுமையின் பலனே. ஆகவே (மறுமைப் பலனுக்காக பாடுபடும்) அன்சாரிகளுக்கும் முஹாஜிர்களுக்கும் கருணை காட்டுவாயாக” என்று கூறினார்கள். அப்போது முஸ்லிம்களில் ஒருவரின் கவிதையை நபியவர்கள் பாடிக்காட்டி னார்கள். அவரது பெயர் என்னிடம் கூறப்படவில்லை (என்று அறிவிப்பாளர்களில் ஒருவரான இப்னு ஷிஹாப் (ரஹ்) அவர்கள் கூறிவிட்டு தொடர்ந்து) இப்னு ஷிஹாப் (ரஹ்) அவர்கள் சொன்னார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இந்தப் பாடல் (வரி)களைத் தவிர ஒரு முழுமையான கவிதையின் பாடலைப் பாடியதாக எனக்கு ஹதீஸ்களில் (செய்தி) எட்டவில்லை. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3907,
			"arabicnumber": 3907,
			"text": "அஸ்மா (ரலி) அவர்கள் கூறிய தாவது: (ஹிஜ்ரத்தின்போது) நபி (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் மதீனா செல்ல நாடிய சமயம் நான் அவர்கள் இருவருக்கும் பயண உணவைத் தயாரித் தேன். என் தந்தை (அபூபக்ர்-ரலி) அவர்களிடம், “இதைக் கட்டுவதற்கு என்னிடம் என் இடுப்புக் கச்சுத் தவிர வேறெதுவும் இல்லை” என்று சொன்னேன். அவர்கள், “அப்படியென்றால் அதை இரண்டாகக் கிழி” என்று சொன்னார்கள். நான் அவ்வாறே செய்(து என் இடுப்புக் கச்சை இரண்டாகக் கிழித்துப் பயண உணவைக் கட்டி முடித்)தேன். ஆகவே நான், “இரு கச்சுடையாள்” என்று (புனை பெயர்) சூட்டப்பட்டேன்.158 இப்னு அப்பாஸ் (ரலி) அவர்கள் “அஸ்மா கச்சுடையாள்' என்று சொன்னார் கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3908,
			"arabicnumber": 3908,
			"text": "பராஉ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவை நோக்கி (ஹிஜ்ரத்) சென்றபோது சுராக்கா பின் மாலிக் பின் ஜுஅஷும் என்பவர் அவர்களைப் (பிடித்துவரப்) பின்தொடர்ந்து சென்றார். நபி (ஸல்) அவர்கள் அவருக்கெதிராக (அவரைச் செயலிழக்கச் செய்யும்படி) பிரார்த்தித்தார்கள். உடனே, அவரது குதிரை அவருடனேயே பூமியில் புதையுண்டது. சுராக்கா (நபியவர்களிடமே), “எனக்காக அல்லாஹ்விடம் பிரார்த்தியுங் கள். நான் உங்களுக்குத் தீங்கு செய்யமாட்டேன்” என்று சொன்னார். அவ்வாறே நபி (ஸல்) அவர்கள் அவருக்காகப் பிரார்த்தித்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தாகத்துடனிருக்க, ஓர் ஆட்டிடையர் அவ்வழியே சென்றார். உடனே, அபூபக்ர் (ரலி) அவர்கள் ஒரு கிண்ணத்தை எடுத்து (ஆடு ஒன்றிலிருந்து) சிறிது பாலை அதில் கறந்து அதை நபி (ஸல்) அவர்களிடம் கொண்டுவந்தார்கள். அபூபக்ர் அவர்கள் திருப்தியடையும்வரை நபி (ஸல்) அவர்கள் (அதிலிருந்து) அருந்தி னார்கள்.159 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3909,
			"arabicnumber": 3909,
			"text": "அஸ்மா (ரலி) அவர்கள் கூறிய தாவது: நான் (என் மகன்) அப்துல்லாஹ் பின் அஸ்ஸுபைரை (மக்காவில்) கருவுற்றிருந் தேன். கர்ப்பக் காலம் பூர்த்தியானதும் நான் (ஹிஜ்ரத்) புறப்பட்டேன்; மதீனா வந்தேன். (வழியில்) குபாவில் தங்கி, குபாவிலேயே குழந்தையைப் பெற்றெடுத்தேன். பிறகு, நபி (ஸல்) அவர்களிடம் குழந்தையைக் கொண்டுசென்று அவர்களின் மடியில் அவனை வைத்தேன். பிறகு அவர்கள் பேரீச்சம்பழம் ஒன்றைக் கொண்டுவரும்படி கூறி அதை மென்று அவனது வாயில் உமிழ்ந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் உமிழ்நீர்தான் அவனது வாயில் நுழைந்த முதல் பொருளாக இருந்தது. பிறகு நபி (ஸல்) அவர்கள் ஒரு பேரீச்சம் பழத்தை மென்று அவனது வாயினுள் வைத்துத் தேய்த்துவிட்டார்கள். பிறகு அவனுக்காக துஆ செய்து, இறைவனிடம் அருள்வளம் வேண்டி இறைஞ்சினார்கள். அவன்தான் இஸ்லாத்தில் (முஹாஜிர்களுக்கு மதீனாவில்) பிறந்த முதல் குழந்தையாக இருந்தான். மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் இதே போன்று அறிவிக்கப் பட்டுள்ளது. அதில், “அஸ்மா (ரலி) அவர்கள் நபி (ஸல்-அவர்களிடம் மதீனா) நோக்கி கர்ப்பிணியான நிலையில் ஹிஜ்ரத் செய்தார்கள்” என்று கூறப்பட்டுள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3910,
			"arabicnumber": 3910,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: (முஹாஜிர்களிலேயே) இஸ்லாத்தில் பிறந்த முதல் குழந்தை அப்துல்லாஹ் பின் அஸ்ஸுபைர் ஆவார். (அவர் பிறந் தவுடன்) அவரை நபி (ஸல்) அவர்களிடம் கொண்டுவந்தனர். நபி (ஸல்) அவர்கள் ஒரு பேரீச்சம்பழத்தை எடுத்து, அதை மென்று அவரது வாய்க்குள் நுழைத்தார்கள். அவரது வயிற்றினுள் முதலாவதாக நுழைந்தது நபி (ஸல்) அவர்களது உமிழ் நீரேயாகும். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தமக்குப் பின்னால் அபூபக்ர் (ரலி) அவர்கள் வர (மக்காவிலிருந்து) மதீனா நோக்கி (ஹிஜ்ரத்) சென்றார்கள். அபூபக்ர் (ரலி) அவர்கள் (இளநரையின் காரணத்தால் தோற்றத்தில்) மூத்தவராகவும், (மதீனாவாசி களிடையே வியாபார நிமித்தமாக அடிக்கடி சென்றதில் அவர்களிடையே) அறிமுகமானவராகவும் இருந்தார்கள். ஆனால், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், (நரை விழாத காரணத்தால் உருவத்தில்) இளையவராகவும் (வெளியூர் சென்று நீண்ட காலமாகிவிட்டதால் அந்த மக்களிடையே) அறிமுகமற்றவராகவும் இருந்தார்கள். (அவர்கள் இருவரும் ஹிஜ்ரத் சென்ற அந்தப் பயணத்தின்போது) அபூபக்ர் (ரலி) அவர்களை ஒரு மனிதர் சந்தித்து, “அபூபக்ரே! உமக்கு முன்னால் உள்ள இந்த மனிதர் யார்?” என்று கேட்கிறார். அதற்கு, அபூபக்ர் (ரலி) அவர்கள், “இந்த மனிதர் எனக்கு வழிகாட்டுபவர்” என்று (நபி (ஸல்) அவர்களை எதிரிக்குக் காட்டிக் கொடுத்துவிடாமலும், அதே சமயம் உண்மைக்குப் புறம்பில்லாமலும் இரு பொருள்படும்படி) பதிலளிக்கிறார்கள். இதற்கு, “(பயணத்தில்) பாதை (காட்டுபவர்)' என்றே அபூபக்ர் பொருள் கொள்கிறார் என எண்ணுபவர் எண்ணிக்கொள்வார். ஆனால், “நன்மார்க்கத்திற்கு (வழி காட்டுபவர்)' என்ற பொருளையே அபூபக்ர் கொண்டிருந்தார்கள். அப்போது, அபூபக்ர் (ரலி) அவர்கள் திரும்பிப் பார்த்தார்கள். அங்கு (அவர்களுக்குப் பின்னால்) ஒரு குதிரை வீரர் (சுராக்கா) அவர்களைப் பின்தொடர்ந்து வந்துகொண்டிருந்தார். உடனே அபூபக்ர் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! (இதோ!) இந்தக் குதிரை வீரர் நம்மை (நெருங்கி) வந்தடைந்துவிட்டார்” என்று கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் திரும்பிப் பார்த்து விட்டு, “இறைவா! அவரைக் கீழே விழச் செய்!” என்று பிரார்த்தித்தார்கள். உடனே குதிரை அவரைக் கீழே தள்ளிவிட்டது; பிறகு கனைத்துக்கொண்டே எழுந்து நின்றது. (உடனே சுராக்கா மனம் திருந்தி), “அல்லாஹ்வின் தூதரே! நீங்கள் விரும்பியதை எனக்கு உத்தரவிடுங்கள்” என்று கூறினார். அதற்கு நபி (ஸல்) அவர்கள், “இங்கேயே நின்றுகொள். எங்களைப் பின்தொடர்ந்து வரும் எவரையும் விட்டுவிடாதே” என்று கூறினார்கள். இந்த சுராக்கா முற்பகலில் அல்லாஹ்வின் நபிக்கெதிராகப் போரிடுபவராக இருந்தார்; பிற்பகலில் நபியைக் காக்கும் ஆயுதமாக மாறினார். பிறகு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (கருங்கற்கள் நிறைந்த) “அல்ஹர்ரா' பகுதியில் இறங்கி(த் தங்கி)னார்கள். (அங்கே குபாவில் ஒரு பள்ளிவாசலையும் கட்டச் செய்தார்கள்.) பிறகு, (குபாவிலிருந்துகொண்டு மதீனாவாசிகளான) அன்சாரிகளிடம் ஆளனுப்பினார்கள். உடனே அன்சாரிகள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமும் அபூபக்ர் (ரலி) அவர்களிடமும் வந்து, அவர்கள் இருவருக்கும் சலாம் சொன்னார்கள். பிறகு, “(இப்போது) நீங்கள் இருவரும் அச்சமற்றவர்களாவும் (ஆணையிடும்) அதிகாரம் படைத்தவர்களாவும் பயணம் செய்யலாம்” என்று கூறினர். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் (மதீனா நோக்கிப்) பயணமாயினர். அன்சாரிகள் (அவர்களுக்குப் பாதுகாப்பாக) ஆயுதங் களுடன் (அவர்களைச்) சூழ்ந்தபடி சென்றனர். அப்போது மதீனாவில், “அல்லாஹ்வின் தூதர் (ஸல்) வந்துவிட்டார் கள். அல்லாஹ்வின் தூதர் (ஸல்) வந்துவிட்டார்கள்” என்று சொல்லப்பட்டது. எதிர்பார்த்துக்கொண்டிருந்த மக்கள், “அல்லாஹ்வின் தூதர் வந்துவிட்டார்கள்” என்று கூறலாயினர். நபி (ஸல்) அவர்கள் சிறிது தூரம் பயணித்த பின்னர் (தமது வாகனத்திலிருந்து) அபூஅய்யூப் (அல்அன்சாரீ -ரலி) அவர்களின் வீட்டிற்குப் பக்கத்தில் இறங்கினார்கள். (அங்கே) நபியவர்கள் தம் குடும்பத்தாரிடம் உரையாற்றிக்கொண்டிருந்தார்கள். அப்போது தமது குடும்பத்தாருக்குச் சொந்தமான பேரீச்சந்தோட்டத்தில் கனிகளைப் பறித்துக் கொண்டிருந்த (யூத அறிஞர்) அப்துல்லாஹ் பின் சலாம் அவர்கள் இதைக் கேட்டுவிட்டு, குடும்பத்தாருக்காகப் பறித்தவற்றை அவர்களுக்கென எடுத்துவைக்கத் தவறி, அவற்றைத் தம்முடன் கொண்டுவந்துவிட்டார். அங்கே அல்லாஹ்வின் தூதர் (ஸல்) அவர்(கள் மக்களுக்குச் சொல்லிக் கொண்டிருந்த அறிவுரைகளை160 அவர்)களிடமிருந்து கேட்டுவிட்டுத் தம் வீட்டாரிடம் திரும்பிச் சென்றார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “எங்கள் குடும்பத்தாரின் வீடுகளில் அருகிலிருப்பது எது?”161 என்று கேட் டார்கள். அதற்கு அபூஅய்யூப் அவர்கள், “அல்லாஹ்வின் தூதரே! இது என் வீடு. இதுதான் என் (வீட்டு) வாசல். (நானே உங்கள் குடும்பத்தாரில் மிக அருகில் உள்ளவன்)” என்று கூறினார்கள். நபி (ஸல்) அவர்கள், “நீங்கள் சென்று மதிய ஓய்வு கொள்வதற்காக (உங்கள் வீட்டை) எமக்குத் தயார் செய்யுங்கள்” என்று கூறினார்கள். அபூஅய்யூப் (ரலி) அவர்கள், “உயர்ந்தவ னான அல்லாஹ்வின் அருள்வளத்துடன் நீங்கள் இருவரும் எழுங்கள்” என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அபூஅய்யூப் அல்அன்சாரீ (ரலி) அவர் களின் இல்லத்திற்கு) வந்தபோது (யூத அறிஞர்) அப்துல்லாஹ் பின் சலாம் அவர்கள் வந்து (சில விளக்கங்களைக் கேட்டு உறுதி செய்துகொண்ட பிறகு), “தாங்கள் அல்லாஹ்வின் தூதர் என்றும், தாங்கள் சத்திய (மார்க்க)த்துடன் வந்துள்ளீர்கள் என்றும் நான் சாட்சியம் அளிக்கிறேன். யூதர்கள் என்னைப் பற்றி, நான் அவர்களின் தலைவன் என்றும், அவர்களின் தலைவருடைய மகன் என்றும், அவர்களில் நான் மிகவும் அறிந்தவன் என்றும், அவர்களில் மிகவும் அறிந்தவரின் மகன் என்றும் அறிந்துள்ளனர். நான் முஸ்லிமாகிவிட்டேன் என்பதை அவர்கள் அறியும் முன்பாக அவர்களை அழைத்து என்னைப் பற்றி அவர்களிடம் கேளுங்கள். ஏனெனில், நான் முஸ்óமாகிவிட்டேன் என்பதை அவர்கள் அறிந்தால் என்னிடம் இல்லாத (குற்றங்குறைகள் முதலிய)வற்றை என்னிடமிருப்பதாகக் கூறுவர்” என்று சொன்னார்கள். (யூதர்களை அழைத்து வரும்படி) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஆளனுப்பினார்கள். யூதர்கள் நபி (ஸல்) அவர்களை நோக்கி வந்தனர். (உடனே அப்துல்லாஹ் பின் சலாம் அவர்கள் ஓரிடத்தில் மறைந்துகொண்டார்கள்.) அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “யூதப் பெருமக்களே! அல்லாஹ்வை நீங்கள் அஞ்சுங்கள்! (இல்லையேல்,) உங்களுக்குக் கேடுதான். எவனைத் தவிர வேறு இறைவன் இல்லையோ அவன் மீதாணையாக! நான் உண்மையிலேயே அல்லாஹ்வின் தூதர்தான் என்றும், நான் சத்திய(மார்க்க)த்துடன் உங்களிடம் வந்துள்ளேன் என்றும் நீங்கள் அறிவீர்கள். எனவே, நீங்கள் முஸ்லிமாகிவிடுங்கள்” என்று கூறி னார்கள். யூதர்கள் (ஏற்க மறுத்து), “அ(த்தகைய தூதர் ஒரு)வரை நாங்கள் அறியமாட்டோம்” என்று -நபி (ஸல்) அவர்களிடம் கூற, நபியவர்கள் அதையே மூன்று முறை- கூறினார்கள். (பிறகு,) நபி (ஸல்) அவர்கள், “உங்களிடையே அப்துல்லாஹ் பின் சலாம் எத்தகைய மனிதர்?” என்று கேட்டார்கள். அவர்கள், “அவர் எங்களின் தலைவர்; எங்களுடைய தலைவரின் மகன்; மேலும் எங்களில் மிகப் பெரிய அறிஞர்; மிகப் பெரிய அறிஞரின் மகன்” என்று கூறினர். “அவர் முஸ்லிமாகிவிட்டால் (என்ன செய்வீர்கள்?) கூறுங்கள்” என்றார்கள். அவர்கள், “அல்லாஹ் காப்பாற்றட்டும்! அவர் முஸ்லிமாகமாட்டார்” என்று கூறினர். நபி (ஸல்) அவர்கள், “அவர் முஸ்லிமாகிவிட்டால் (என்ன செய்வீர்கள்?) கூறுங்கள்” என்று (மீண்டும்) கேட்க, அவர்கள் (முன்பு போலவே), “அல்லாஹ் காப்பாற்றட்டும்! அவர் முஸ்லிமாகமாட்டார்” என்று கூறினர். “அவர் முஸ்லிமாகிவிட்டால் கூறுங்கள்” என்று (மீண்டும்) நபி (ஸல்) அவர்கள் கேட்க, அவர்கள், “அல்லாஹ் காப்பாற்றட்டும்! அவர் முஸ்லிமாகமாட்டார்” என்று கூறினர். நபி (ஸல்) அவர்கள், “இப்னு சலாமே! இவர்களிடம் வாருங்கள்” என்று சொன்னார்கள். உடனே, அப்துல்லாஹ் பின் சலாம் அவர்கள் வெளியே வந்து, “யூதப் பெருமக்களே! அல்லாஹ்வை அஞ்சுங்கள்! எவனைத் தவிர வேறு இறைவன் இல்லையோ அவன்மீதாணையாக! இவர்கள் அல்லாஹ்வின் தூதர்தான் என்பதையும் இவர்கள் சத்திய (மார்க்க)த் துடன் வந்துள்ளார்கள் என்பதையும் நீங்கள் நன்கறிவீர்கள்” என்று கூறி னார்கள். உடனே யூதர்கள், “நீ பொய் சொன் னாய்” என்று கூறினார்கள். உடனே யூதர் களை நபி (ஸல்) அவர்கள் (தம்மிடத்திலிருந்து) வெளியேறச் செய்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3912,
			"arabicnumber": 3912,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் முதன்முதலாக ஹிஜ்ரத் செய்து வந்தவர்களுக்கு (பொதுநிதியிலிருந்து) நான்காண்டுகளுக்கு நான்காயிரம் (திர்ஹம்/தீனார்) கொடுக்க வேண்டுமென நிர்ணயித்தார்கள். (தமது மகனான) எனக்கு மூவாயிரத்து ஐநூறு கொடுக்க வேண்டும் என நிர்ணயித்தார்கள். அவர்களிடம், “(தங்கள் மகன்) இப்னு உமர் ஹிஜ்ரத் செய்து வந்தவர்களில் ஒருவர்தானே! நான்காயிரம் கொடுக்காமல் அவருக்கு மட்டும் ஏன் குறைவாக நிர்ணயித்தீர்கள்?” என்று கேட்கப்பட்டது. அதற்கு அவர்கள், “அவரை அழைத்துக்கொண்டு ஹிஜ்ரத் செய்துவந்ததெல்லாம் அவருடைய தாய், தந்தையர்தான்” என்று சொன்னார்கள். “அவர் சுயமாக ஹிஜ்ரத் செய்து வந்தவர்களைப் போன்றவரல்லர்” என்றும் உமர் (ரலி) அவர்கள் சொல்வார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3913,
			"arabicnumber": 3913,
			"text": "கப்பாப் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஹிஜ்ரத் செய்தோம்.162 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3914,
			"arabicnumber": 3914,
			"text": "கப்பாப் பின் அல்அரத் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் அல்லாஹ்வின் அன்பை நாடியவர்களாக ஹிஜ்ரத் செய்தோம். எங்களுக்கு (அதற்கான) பிரதிபலனளிப்பது அல்லாஹ்வின் பொறுப்பாகிவிட்டது. அதன் (உலகப்) பலன்களில் எதையுமே அனுபவிக்காமல் சென்றுவிட்டவர்களும் எங்களிடையே உண்டு. முஸ்அப் பின் உமைர் (ரலி) அத்தகையவர்களில் ஒருவர்தான். அவர் உஹுத் போரின்போது கொல்லப்பட்டார். அவரை கஃபனிடு வதற்கு (அவரது) கோடிட்ட வண்ணத் துணி ஒன்றைத் தவிர வேறெதுவும் எங்களுக்குக் கிடைக்கவில்லை. அந்தத் துணியால் நாங்கள் அவரது தலையை மூடியபோது அவருடைய கால்கள் இரண்டும் வெளியே தெரியலாயின; அவருடைய கால்கள் இரண்டையும் நாங்கள் மூடியபோது அவரது தலை வெளியே தெரியலாயிற்று. ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்தத் துணியால் அவரது தலையை மூடிவிடும்படியும் அவருடைய கால்கள் இரண்டின்மீதும் “இத்கிர்' புல்லைச் சிறிது போட்டு (மறைத்து)விடும்படியும் எங்களுக்கு உத்தரவிட்டார்கள். (ஹிஜ்ரத் செய்ததற்கான இவ்வுலகப்) பலன் கனிந்து அதைப் பறித்து(சுவைத்து)க்கொண்டிருப்பவர்களும் எங்களில் உள்ளனர்.163 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3915,
			"arabicnumber": 3915,
			"text": "அபூபுர்தா பின் அபீமூசா அல்அஷ்அரீ (ரஹ்) அவர்கள் கூறியதாவது: என்னிடம் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், “என் தந்தை (உமர் (ரலி) அவர்கள்) உங்கள் தந்தை (அபூமூசா (ரலி) அவர்கள்) இடம் என்ன சொன்னார் கள் என்பது உங்களுக்குத் தெரியுமா?” என்று கேட்டார்கள். நான், “தெரியாது” என்று பதிலளித்தேன். அதற்கு அவர்கள் சொன்னார்கள்: என் தந்தை உங்கள் தந்தையிடம், “அபூமூசாவே! நாம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் இஸ்லாத்தை ஏற்றதும், அவர்களுடன் ஹிஜ்ரத் செய்ததும், அவர் களுடன் (சேர்ந்து) அறப்போர் புரிந்ததும், அவர்களுடன் (இணைந்து) நாம் புரிந்த நற்செயல்களும் (இவையெல்லாம்) நிச்சய மாகப் பலன் தரும் என்பது உங்களுக்கு மகிழ்ச்சி அளிக்கிறதா? மேலும், நபியவர் களுக்குப்பின் நாம் புரிந்த செயல்கள் அனைத்தும் (அவற்றிலுள்ள நிறைகளும் குறைகளும்) சரிக்குச் சரிநிகராகி (இறை வனின் தண்டனையிலிருந்து) நாம் தப்பித் துக்கொள்வோம் என்பதும் (உங்களுக்கு மகிழ்ச்சியளிக்கிறதா?)” என்று கேட்டார்கள். அதற்கு (என் தந்தையிடம்) உங்கள் தந்தை (அபூமூசா), “இல்லை; இறைவன் மீதாணையாக! நாம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குப் பிறகு அறப்போர் புரிந்துள்ளோம்; தொழுதுள்ளோம்; நோன்பு நோற்றுள்ளோம்; நற்செயல்கள் நிறையப் புரிந்துள்ளோம். மேலும், நம் கரங்களால் நிறைய மக்கள் இஸ்லாத்தை ஏற்றுள்ளனர். இவற்றுக்கெல்லாம் (இறைவன் நமக்குப் பிரதிபலன் அளிப்பான் என) நாம் எதிர்பார்க்கின்றோம்” என்று பதிலளித்தார்கள். உடனே என் தந்தை (உமர்), “ஆனால், உமரின் உயிரைத் தன் கையில் வைத்திருப்பவன்மீது ஆணையாக! நானோ, (நபியவர்களுடன் நாம் புரிந்த நற்செயல்களான) அவற்றின் பலன் நிச்சயம் நமக்குக் கிடைக்கும் என்பதும், நபிகளாருக்குப்பின் நாம் புரிந்த செயல்கள் அனைத்தும் (அவற்றிலுள்ள நிறைகளும் குறைகளும்) சரிக்குச் சரிநிகராகி (இறைவனின் தண்டனையிலிருந்து) நாம் தப்பித்துக்கொள்வோம் என்பதும் போதும் என்றே நான் விரும்புகிறேன்” எனக் கூறினார்கள். அப்போது நான், “அல்லாஹ்வின் மீதாணையாக! உங்கள் தந்தை (உமர்) என் தந்தையைவிடச் சிறந்தவர்” என்று சொன்னேன். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3916,
			"arabicnumber": 3916,
			"text": "அபூஉஸ்மான் அந்நஹ்தீ (ரஹ்) அவர்கள் கூறியதாவது: இப்னு உமர் (ரலி) அவர்களிடம், “நீங்கள் உங்கள் தந்தைக்கு முன்னதாக ஹிஜ்ரத் செய்துவந்தீர்கள்” என்று சொல்லப்படும்போது அவர்கள் கோப முற்றுக் கூறுவார்கள்: “நானும் (என் தந்தை) உமர் (ரலி) அவர்களும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (“பைஅத்' எனும் உறுதிமொழி எடுத்துக்கொள்வதற் காகச்) சென்றோம். நபி (ஸல்) அவர்கள் மதிய ஓய்வெடுத்து (உறங்கி)க்கொண்டி ருக்கக் கண்டோம். ஆகவே நாங்கள் வீட்டிற்குத் திரும்பிவிட்டோம். பிறகு உமர் (ரலி) அவர்கள் என்னை அனுப்பி, “நீ போய், அவர்கள் (உறக்கத் திலிருந்து) விழித்தெழுந்துவிட்டார்களா என்று பார்” என்று சொன்னார்கள். நான் நபி (ஸல்) அவர்களிடம் சென்றேன். (அவர்கள் விழித்திருந்தார்கள். எனவே,) அவர்களிடம் உறுதிமொழி அளித்தேன். பிறகு உமர் (ரலி) அவர்களிடம் சென்று நபி (ஸல்) அவர்கள் விழித்தெழுந்து விட்டார்கள் என்று தெரிவித்தேன். பிறகு நாங்கள் நபி (ஸல்) அவர்களை நோக்கிப் புறப்பட்டு விரைந்தோடிச் சென்றடைந்தோம். அப்போது நபி (ஸல்) அவர்களிடம் உமர் (ரலி) அவர்கள் உறுதிமொழி அளித்தார்கள். பிறகு நானும் (இரண்டாம் முறையாக) உறுதிமொழி அளித்தேன்.164 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3917,
			"arabicnumber": 3917,
			"text": "பராஉ (ரலி) அவர்கள் கூறியதாவது: அபூபக்ர் (ரலி) அவர்கள் (என் தந்தை) ஆஸிப் (ரலி) அவர்களிடமிருந்து ஒட்டகச் சேணம் ஒன்றை விலைக்கு வாங்கினார்கள். நான் அவர்களுடன் அதைச் சுமந்து சென்றேன். ஆஸிப் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் (ஹிஜ்ரத்) பயணம் குறித்து அபூபக்ர் (ரலி) அவர்களிடம் கேட்டார்கள். அதற்கு அபூபக்ர் (ரலி) அவர்கள் சொன்னார்கள்: எங்கள்மீது (எதிரிகளால்) கண்காணிப்பு மேற்கொள்ளப்பட்டது. ஆகவே, நாங்கள் இரவில் புறப்பட்டோம். நாங்கள் நண்பகல் நேரம் வரும்வரை இரவும் பகலும் கண் விழித்துப் பயணித்தோம். பிறகு எங்களுக் குப் பாறை ஒன்று தென்பட்டது. நாங்கள் அதனருகே சென்றோம். அதற்கு ஏதோ கொஞ்சம் நிழல் இருந்தது. நான் அல்லாஹ் வின் தூதருக்காக என்னுடன் இருந்த தோல் ஆடை ஒன்றை விரித்தேன். பிறகு நபி (ஸல்) அவர்கள் அதன்மீது படுத்துக் கொண்டார்கள். நான் அவர்களைச் சுற்றிலு மிருந்த புழுதியைத் தட்டிக்கொண்டே சென்றேன். அப்போது (தற்செயலாக) ஓர் ஆட்டிடையனைக் கண்டேன். அவன் தனது சிறிய ஆட்டு மந்தை ஒன்றுடன் நாங்கள் நாடிச் சென்ற (அதே பாறை நிழல்)தனை நாடி, அதை நோக்கி வந்துகொண்டிருந்தான். நான் அவனிடம், “இளைஞனே! நீ யாருடைய பணியாள்?” என்று கேட்டேன். அவன், “நான் இன்ன மனிதரின் பணியாள்” என்று சொன்னான். நான், “உன் ஆடுகளிடம் சிறிது பால் இருக்குமா?” என்று கேட்டேன். அவன், “ஆம்' என்றான். நான், “நீ (எங்களுக்குப்) பால் கறந்து தருவாயா?” என்று கேட்டேன். அவன், “ஆம் (தருகிறேன்)” என்றான். பின்னர், அவன் தன் ஆடுகளில் ஒன்றைப் பிடித்து வந்தான். நான் அவனிடம், “அதன் மடியை (புழுதி போக) உதறு” என்று சொன்னேன். பிறகு, அவன் சிறிது பாலைக் கறந்தான். என்னிடம் தண்ணீருள்ள தோல் பாத்திரம் ஒன்றிருந்தது. அதில் துண்டுத் துணியொன்று (மூடி) இருந்தது. அதில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காகத் தண்ணீர் வைத்திருந் தேன். அதைப் பால் (பாத்திரத்தின்) மீது அதன் கீழ்ப்பகுதி குளிர்ந்து போகும்வரை ஊற்றினேன். பிறகு அதை நபி (ஸல்) அவர்களிடம் கொண்டு சென்று, “பருகுங்கள், அல்லாஹ் வின் தூதரே!” என்று சொன்னேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நான் திருப்தியடையும்வரை (அதை)ப் பருகினார்கள். பிறகு, எங்களைத் தேடிவந்தவர்கள் எங்கள் தடயத்தைப் பின்தொடர்ந்து வந்துகொண்டிருக்க நாங்கள் புறப்பட்டோம்.165 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3918,
			"arabicnumber": 3918,
			"text": "பராஉ (ரலி) அவர்கள் கூறிய தாவது: நான் அபூபக்ர் (ரலி) அவர்களுடன் அவர்களின் வீட்டாரிடம் சென்றேன். அப்போது அவர்களுடைய மகளான ஆயிஷா (ரலி) அவர்கள், காய்ச்சல் கண்டு (படுக்கையில்) படுத்திருந்தார்கள். அவருடைய தந்தை(யான அபூபக்ர் (ரலி) அவர்கள்) அவரது கன்னத்தில் (பாசத் தோடு) முத்தமிட்டு, “எப்படியிருக்கிறாய்? அருமை மகளே!” என்று கேட்டதை நான் கண்டேன்.166 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3919,
			"arabicnumber": 3919,
			"text": "நபி (ஸல்) அவர்களுடைய ஊழியரான அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மதீனாவுக்கு) வந்தார்கள்; அப்போது அவர்கள் தம் தோழர்களில் அபூபக்ர் (ரலி) அவர்கள் மட்டுமே கறுப்பு- வெள்ளை முடி உடையவர்களாக இருந்தார்கள். அன்னார் மருதாணியாலும், “கத்தம்' எனும் (ஒரு வகை மூலிகை) இலைச் சாயத்தாலும் தம் (தாடி) முடியைத் தோய்த்து (நரையை) மறைத்துக்கொண்டார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவுக்கு வந்தபோது, அவர்கள்தம் தோழர்களி லேயே அபூபக்ர் (ரலி) அவர்கள்தான் அதிக வயதுடையவர்களாக இருந்தார்கள். பிறகு, தம் (தாடி முடியை) அபூபக்ர் (ரலி) அவர்கள் மருதாணியாலும், “கத்தம்' எனும் (மூலிகை) இலைச் சாயத்தாலும் தோய்த்து (நரையை) மறைத்துக்கொண்டார்கள். அதனால் அதன் நிறம் கருஞ்சிவப்பாகி விட்டது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3921,
			"arabicnumber": 3921,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: (என் தந்தை) அபூபக்ர் (ரலி) அவர்கள் “பனூ கல்ப்' குலத்தைச் சேர்ந்த ஒரு பெண்ணை மணமுடித்தார்கள். “உம்மு பக்ர்' என்பது அந்தப் பெண்ணின் பெயராகும். அபூபக்ர் (ரலி) அவர்கள் (மதீனாவுக்கு) ஹிஜ்ரத் செய்தபோது அப்பெண்ணை மணவிலக்கு செய்துவிடவே, அவரை அவருடைய தந்தையின் சகோதரர் மகன் (மறு)மணம் புரிந்துகொண்டார். அவர்தான் (பத்ர் போரில் கொல்லப்பட்டு, பத்ர் பாழுங்கிணற்றில் போடப்பட்ட) குறைஷி குல இறைமறுப்பாளர் களுக்காக இந்த இரங்கற்பாவைப் பாடிய கவிஞர் ஆவார்: பத்ரின் பாழுங்கிணற்றுக்கு(இப்போது)என்ன களங்கம் நேர்ந்துவிட்டது?ஒட்டகத் திமில்களால்அலங்கரிக்கப்பட்ட மரத்தட்டுகளால்(விருந்தளிக்கும் அதிபர்கள்167தூக்கி வீசப்பட்டதால்..........)பத்ரின் பாழுங்கிணற்றுக்குஎன்ன (களங்கமா)நேர்ந்துவிட்டது? அழகிய பாடகிகளால் ..........மதிப்புக்குரியமதுபோதைப் பிரியர்களால் .........(என் காதலி)உம்மு பக்ர் எங்கள்மனச்சாந்திக்காகஆறுதல் சொல்கிறாள். என் சமுதாயமே(சமாதிக்குப்) போனபின்எனக்கேது மனச்சாந்தி ..........? (மரணத்திற்குப்பின்)நாம் மீண்டும்உயிர்த்தெழுவோம்என்கிறார் இறைத்தூதர்!(ஆனால்,)ஆந்தைகளும் தேவாங்குகளும்உயிர் பிழைப்பது எப்படி.......... ?168 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3922,
			"arabicnumber": 3922,
			"text": "அபூபக்ர் (ரலி) அவர்கள் கூறியதாவது: (ஹிஜ்ரத் பயணத்தின்போது வழியில்) நபி (ஸல்) அவர்களுடன் நான் (“ஸவ்ர்' மலைக்) குகையில் (தங்கி) இருந்தேன். நான் தலையை உயர்த்தியபோது (எங்களைத் தேடிவந்த) கூட்டத்தாரின் பாதங்கள் என் (தலைக்கு)மேலே தெரிந்தன. நான், “அல்லாஹ்வின் தூதரே! அவர்களில் எவராவது தம் பார்வையைத் தாழ்த்தி (குகைக்குள் உற்றுநோக்கி)னால் நம்மைப் பார்த்துவிடுவாரே! (இப்போது என்ன செய்வது?)” என்று சொன்னேன். நபி (ஸல்) அவர்கள், “அமைதியாயிருங் கள்; அபூபக்ரே! (நாம்) இருவர்; நம்முடன் அல்லாஹ் மூன்றாமவன். (அவன் நம்மைக் காப்பாற்றுவான்)” என்று சொன்னார்கள்.169 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3923,
			"arabicnumber": 3923,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: கிராமவாசி ஒருவர் நபி (ஸல்) அவர்களிடம் வந்து ஹிஜ்ரத் குறித்துக் கேட்டார். நபி (ஸல்) அவர்கள், “உமக்கு என்ன கேடு? -(எனச் செல்லமாகக் கேட்டுவிட்டு)- நிச்சயமாக அதன் நிலை மிகவும் கடின மானது. உம்மிடம் ஒட்டகங்கள் இருக்கின் றனவா?” என்று கேட்டார்கள். அவர், “ஆம்' என்றார். நபி (ஸல்) அவர்கள், “அவற்றுக்குரிய ஸகாத் கொடுத்து வருகி றாயா?” என்று கேட்டார்கள். அவர், “ஆம்' என்றார். நபி (ஸல்) அவர்கள், “அவற்றிலிருந்து (இலவசமாகப் பால் கறந்துகொள்ள, ஏழைகளுக்கு) இரவல் கொடுக்கிறீரா?” என்று கேட்டார்கள். அவர், “ஆம்' என்றார். நபி (ஸல்) அவர்கள், “அவை (நீர்நிலைகளுக்கு) நீரருந்தச் செல்லும் (முறை வரும்) நாளில் அவற்றின் பாலைக் கறந்து (ஏழைகளுக்குக்) கொடுக்கிறீரா?” என்று கேட்க அவர், “ஆம்' என்றார். நபி (ஸல்) அவர்கள், “அப்படியென்றால், நீர் ஊர்களுக்கு அப்பால் சென்றுகூட நன்மை செய்யலாம். அல்லாஹ் உம்முடைய நற்செயல்(களின் பிரதிபலன்)களில் எதையும் குறைக்கமாட்டான்” என்று சொன்னார்கள்.170 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3924,
			"arabicnumber": 3924,
			"text": "பராஉ (ரலி) அவர்கள் கூறிய தாவது: எங்களிடம் (மதீனாவுக்குப் புலம் பெயர்ந்து) முதன் முதலில் வந்தவர்கள் முஸ்அப் பின் உமைர் (ரலி) அவர்களும் இப்னு உம்மி மக்(த்)தூம் (ரலி) அவர்களும் தான். பிறகு எங்களிடம் அம்மார் பின் யாசிர் (ரலி) அவர்களும் பிலால் (ரலி) அவர்களும் வந்தனர்.172 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3925,
			"arabicnumber": 3925,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: எங்களிடம் (மதீனாவுக்குப் புலம் பெயர்ந்து) முதன்முதலில் வந்தவர்கள் முஸ்அப் பின் உமைர் (ரலி) அவர்களும் இப்னு உம்மி மக்(த்)தூம் (ரலி) அவர்களும்தான். இவர்கள் மக்களுக்கு (குர்ஆன்) ஓதக் கற்றுக் கொடுத்துவந்தனர். பிறகு பிலால் (ரலி) அவர்களும், சஅத் பின் அபீவக்காஸ் (ரலி) அவர்களும், அம்மார் பின் யாசிர் (ரலி) அவர்களும் வந்தனர். பிறகு உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் நபித்தோழர்கள் இருபது பேர் (கொண்ட ஒரு குழு) உடன் வந்தார்கள். பிறகு நபி (ஸல்) அவர்கள் வந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர் கள(து வருகைய)ôல் மதீனாவாசிகள் மகிழ்ச்சியடைந்ததைப் போன்று வேறெதற் காகவும் அவர்கள் மகிழ்ச்சியடைந்ததை நான் பார்க்கவில்லை. எந்த அளவுக் கென்றால் (மதீனாவின்) அடிமைப் பெண்கள், “அல்லாஹ்வின் தூதர் வந்து விட்டார்கள்” என்று பாடி (மகிழலா)னார்கள். “சப்பிஹிஸ்ம ரப்பிக்கல் அஃலா' எனும் (87ஆவது) அத்தியாயத்தை, குர்ஆனின் (மற்ற) சிறுசிறு (முஃபஸ்ஸல்) அத்தியாயங் கள் சிலவற்றுடன் நான் (மனப்பாடமாக) ஓதும்வரை நபி (ஸல்) அவர்கள் (மதீனா) வரவில்லை. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3926,
			"arabicnumber": 3926,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவுக்கு வந்தபோது அபூபக்ர் (ரலி) அவர்களுக்கும் பிலால் (ரலி) அவர்களுக் கும் காய்ச்சல் கண்டிருந்தது. அவ்விருவரிட மும் நான் சென்று, “என் தந்தையே! எப்படியிருக்கிறீர்கள்? பிலால் அவர்களே! எப்படியிருக்கிறீர்கள்?” என்று கேட்டேன். அபூபக்ர் அவர்களுக்கு காய்ச்சல் ஏற்படும்போது அவர்கள் பின்வரும் கவிதையைக் கூறுவார்கள்: காலைவாழ்த்துக் கூறப்பெற்றநிலையில்ஒவ்வொரு மனிதனும்தன் குடும்பத்தாரோடுகாலைப் பொழுதை அடைகிறான்... (ஆனால்,)மரணம்-அவன் செருப்பு வாரைவிடமிக அருகில் இருக்கிறது(என்பது-அவனுக்குத் தெரிவதில்லை). பிலால் (ரலி) அவர்கள் காய்ச்சல் நீங்கியதும், வேதனைக் குரல் எழுப்பி, “இத்கிர்' (நறுமணப்) புல்லும்”ஜலீல்' (கூரைப்) புல்லும்என்னைச் சூழ்ந்திருக்க..........(மக்காவின்) பள்ளத்தாக்கில்ஓர் இராப் பொழுதையேனும்நான் கழிப்பேனா......... ? “மஜன்னா' எனும்(மக்காவின் இனிப்புச்சுனை) நீரைஒருநாள் ஒரு பொழுதாவதுநான் பருகுவேனா......... ? ரு (மக்கா நகரின்)ஷாமா, தஃபீல் மலைகள்(இனி எப்போதாவது)எனக்குத் தென்படுமா......... ? என்ற கவிதையைக் கூறுவார்கள். உடனே, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, (அவர்களின் நிலையைத்) தெரிவித்தேன். அப்போது நபி (ஸல்) அவர்கள், “இறைவா! நாங்கள் மக்காவை நேசித்ததுபோல் அல்லது அதைவிட அதிகமாக மதீனாவை எங்கள் நேசத்திற்குரியதாக ஆக்கு வாயாக! மேலும் இவ்வூரை ஆரோக்கியமானதாகவும் ஆக்குவாயாக! எங்களுடைய (அளவைகளான) “ஸாஉ', “முத்' முதலியவற்றில் (எங்கள் உணவில்) எங்களுக்கு நீ அருள்வளத்தை வழங்குவாயாக! இங்குள்ள காய்ச்சலை இடம்பெயரச் செய்து அதை “ஜுஹ்ஃபா' எனுமிடத்தில் (குடி)அமர்த்திவிடுவாயாக!” என்று துஆ செய்தார்கள்.173 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3927,
			"arabicnumber": 3927,
			"text": "உபைதுல்லாஹ் பின் அதீ பின் அல்கியார் (ரஹ்) அவர்கள் கூறியதாவது: நான் உஸ்மான் (ரலி) அவர்களிடம் சென்றேன். அவர்கள் ஏகத்துவ உறுதி மொழி கூறி (இறைவனைப் புகழ்ந்து)விட்டு, “இறைவாழ்த்துக்குப்பின்! அல்லாஹ் முஹம்மத் (ஸல்) அவர்களை சத்திய (மார்க்க)த்துடன் அனுப்பினான். நான் அல்லாஹ் மற்றும் அவனுடைய தூதரின் அழைப்பை ஏற்று முஹம்மத் (ஸல்) அவர்கள் எ(ந்த வேத)த்துடன் அனுப்பப் பட்டார்களோ அதை நான் நம்பி ஏற்றுக் கொண்டேன். பிறகு, (மக்காவைத் துறந்து அபிசீனியாவுக்கும் அடுத்து மதீனாவுக்கு மாக) இரண்டு ஹிஜ்ரத்கள் செய்தேன். மேலும், நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய மருமகனாக இருந்தேன். அவர்களிடம் விசுவாசப் பிரமாணம் செய்து (உறுதிமொழி) கொடுத்தேன். அல்லாஹ்வின் மீதாணையாக! அவர்களை அல்லாஹ் மரணிக்கச் செய்யும்வரை அவர்களுக்கு நான் மாறு செய்யவுமில்லை; மோசடி செய்யவுமில்லை” என்று சொன் னார்கள். “ஸுஹ்ரீ (ரஹ்) அவர்கள் எனக்கு இதையே அறிவித்தார்கள்” என்று இஸ்ஹாக் அல்கல்பீ (ரஹ்) என்னும் அறிவிப்பாளர் கூறுகிறார்கள்.174 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3928,
			"arabicnumber": 3928,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: உமர் (ரலி) அவர்கள் செய்த இறுதி ஹஜ்ஜின்போது அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் “மினா' பெரு வெளியில் தங்கியிருந்த சமயம் தமது (தங்குமிடத்தில் இருந்த) வீட்டாரை நோக்கித் திரும்பினார்கள். அப்போது அவர்கள் என்னைக் கண்டு, “(நான் உமர் (ரலி) அவர்களிடம்)175 இறைநம்பிக்கை யாளர்களின் தலைவரே! ஹஜ்ஜுப் பருவத்தில் (நன்மக்களுடன்) தரம் தாழ்ந்த மக்களும், (வாய்க்கு வந்தபடி பேசி) குழப்பம் செய்யும் மக்களும் ஒன்று கூடுவர். (எனவே,) தாங்கள் மதீனா சென்றடையும்வரையிலும், (அங்குள்ள) மார்க்க அறிஞர்கள், பிரமுகர்கள், ஆலோசகர்களைப் போய்ச்சேரும் வரையிலும் தாங்கள் நிதானிக்க வேண்டு மென்று நான் கருதுகிறேன். ஏனெனில் மதீனா, ஹிஜ்ரத் பிரதேசமும், நபிவழி (நடைமுறைப்படுத்தப்படும்) நாடும், பாதுகாப்புமிக்க நாடும் ஆகும்” என்று கூறினேன். அதற்கு உமர் (ரலி) அவர்கள், “இனி, நான் மதீனாவில் (உரை நிகழ்த்த) நிற்கப்போகும் முதல் கூட்டத்திலேயே (இது குறித்து எச்சரிக்க) உறுதியோடு நிற்பேன்” என்று கூறினார்கள் எனத் தெரிவித்தார்கள்.176 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "காரிஜா பின் ஸைத் பின் ஸாபித் (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் உறுதிமொழி அளித்திருந்த அன்சாரி பெண்களில் ஒருவரான (என் தாயார்) உம்முல் அலா (ரலி) அவர்கள் என்னிடம் தெரிவித்தார் கள்: (மதீனாவுக்கு ஹிஜ்ரத் செய்துவந்த) முஹாஜிர்களின் தங்குமிடத்தி(னை முடிவு செய்வத)ற்காக அன்சாரிகள் சீட்டுக் குலுக்கிப் போட்டபோது, உஸ்மான் பின் மழ்ஊன் (ரலி) அவர்களின் பெயர் எங்கள் பங்கில் வந்தது. எங்களிடம் (வந்து தங்கிய) உஸ்மான் (ரலி) நோய்வாய்ப்பட்டார். ஆகவே, அவருக்கு நான் நோய்க் காலப் பணிவிடைகள் செய்துவந்தேன். இறுதியில் அவர் இறந்தும்விட்டார். அவருக்கு அவரது துணிகளால் கஃபனிட்டோம். அப்போது நபி (ஸல்) அவர்கள் எங்களிடம் வந்தார்கள். நான் (இறந்துபோன உஸ்மானை நோக்கி), “அபூசாயிபே! அல்லாஹ்வின் கருணை உங்கள்மீது உண்டாகட்டும்! அல்லாஹ் உங்களைக் கண்ணியப்படுத்திவிட்டான் என்பதற்கு நான் சாட்சியம் பகர்கிறேன்” என்று கூறினேன். அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ் அவரைக் கண்ணியப்படுத்தி விட்டான் என்று உமக்கெப்படித் தெரியும்?” என்று கேட்டார்கள். நான், “எனக்குத் தெரியாது. என் தந்தையும் தாயும் தங்களுக்கு அர்ப்பணமாகட்டும், அல்லாஹ்வின் தூதரே! (அல்லாஹ் இவரைக் கண்ணியப்படுத்தாவிட்டால் பின்) யாரைத்தான் (கண்ணியப்படுத்துவான்)?” என்று நான் சொன்னேன். நபி (ஸல்) அவர்கள், “இவருக்கோ மரணம் வந்துவிட்டது; அல்லாஹ்வின் மீதாணையாக! நான் இவருக்கு நன்மையையே எதிர்பார்க்கின்றேன்; அல்லாஹ்வின் மீதாணையாக! நான் அல்லாஹ்வின் தூதராக இருந்தும் என்னிடம் (மறுமையில்) எப்படி நடந்துகொள்ளப்படும் என்பதே அல்லாஹ்வின் மீதாணையாக! எனக்குத் தெரியாது” என்று சொன்னார்கள். (இதைக் கேட்ட) நான், “அல்லாஹ்வின் மீதாணையாக! இவருக்குப் பிறகு எவரையும் நான் தூய்மையானவர் என்று கூறமாட்டேன்” என்று சொன்னேன். நபி (ஸல்) அவர்கள், இப்படிச் சொன்னது எனக்குக் கவலையளித்தது. பிறகு, நான் தூங்கியதும் (கனவில்) உஸ்மான் பின் மழ்ஊன் (ரலி) அவர்களுக்குரிய ஓர் ஆறு (சொர்க்கத்தில்) ஓடிக்கொண்டிருப்ப தாகக் கண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து அதைத் தெரிவித்தேன். நபி (ஸல்) அவர்கள், “அது அவருடைய (நற்)செயல்” என்று சொன்னார்கள்.177 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: “புஆஸ்' போர் நாள், தன் தூதருக்காக அல்லாஹ் (சாதகமான சூழ்நிலையை உருவாக்கும் வகையில்) முன்கூட்டியே நிகழச்செய்த நாளாக அமைந்தது. (அந்தப் போரின் காரணத்தால்) மதீனா வாசிகளின் கூட்டமைப்பு (குலைந்து) பிளவுபட்டிருந்த நிலையிலும், அவர்களில் முக்கியப் பிரமுகர்கள் கொல்லப்பட்டு விட்டிருந்த நிலையிலும் அவர்கள் இஸ்லாத்தில் இணைய ஏதுவான நிலை உருவாகியிருந்த போதுதான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனா வந்தார்கள்.178 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: “ஈதுல் பித்ர்' அல்லது “ஈதுல் அள்ஹா' (பெரு)நாளில் நபி (ஸல்) அவர்கள் என்னிடம் அமர்ந்திருந்தபோது அபூபக்ர் (ரலி) அவர்கள் என்னிடம் வந்தார்கள். அப்போது “புஆஸ்' போர் நாளில் அன்சாரிகள் பாடிய பாடல்களை (சலங்கை யில்லா கஞ்சிராவை அடித்துக்கொண்டு) பாடியபடி இரு பாடகியர் என்னருகே இருந்தனர். அபூபக்ர் (ரலி) அவர்கள், “ஷைத்தா னின் (இசைக்) கருவி” என்று இருமுறை கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், “அவ்விருவரையும் விட்டுவிடுங்கள், அபூபக்ரே! ஒவ்வொரு சமுதாயத்தாருக்கும் பண்டிகை (நாள்) ஒன்று உண்டு. நமது பண்டிகை (நாள்) இந்த நாள்தான்” என்று சொன்னார்கள்.179 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3932,
			"arabicnumber": 3932,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவுக்குப் புலம்பெயர்ந்து வந்தபோது மதீனாவின் மேற்பகுதியில் “பனூ அம்ர் பின் அவ்ஃப்' என்றழைக்கப்பட்டுவந்த ஒரு குடும்பத்தாரிடம் இறங்கி, அவர்களி டையே பதினான்கு நாட்கள் தங்கினார்கள். பிறகு பனுந் நஜ்ஜார் கூட்டத்தாருக்கு ஆளனுப்பினார்கள். பனுந் நஜ்ஜார் கூட்டத்தார் (நபியவர்களை வரவேற்கும் முகமாக) தம் வாட்களைத் தொங்கவிட்டபடி வந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் வாகனத்தில் அமர்ந்திருக்க, அபூபக்ர் (ரலி) அவர்கள், அவர்களுக்குப் பின்னே அமர்ந்திருக்க, பனுந் நஜ்ஜார் கூட்டத்தார் அவர்களைச் சுற்றிலும் குழுமியிருந்த (அந்தக் காட்சி)தனை (இப்போதும்) நான் காண்பதைப் போன் றுள்ளது. இறுதியாக, நபி (ஸல்) அவர்கள் (தம் வாகனத்தை) அபூஅய்யூப் அல்அன்சாரீ (ரலி) அவர்களின் வீட்டு முற்றத்தில் நிறுத்தினார்கள். -தொழுகை நேரம் (தம்மை) வந்தடையும் இடத்திலேயே நபி (ஸல்) அவர்கள் தொழுகையை நிறைவேற்றுவார்கள். ஆட்டுத் தொழுவங்களிலும் தொழுவார்கள்- பிறகு நபி (ஸல்) அவர்கள் பள்ளிவாசல் கட்டும்படி உத்தரவிட்டார்கள். பனுந் நஜ்ஜார் கூட்டத்தாருக்கு நபி (ஸல்) அவர்கள் ஆளனுப்ப, அவர்கள் வந்தார்கள். நபி (ஸல்) அவர்கள், “பனுந் நஜ்ஜார் கூட்டத்தாரே! (பள்ளிவாசல் கட்டுவதற்காக) உங்களது இந்தத் தோட்டத்திற்கு என்னிடம் விலை கூறுங்கள்” என்று கேட்டார்கள். அதற்கு அவர்கள், “இல்லை. அல்லாஹ் வின் மீதாணையாக! அதன் விலையை நாங்கள் அல்லாஹ்விடமே கோருவோம்” என்று பதிலளித்தார்கள். நான் உங்களிடம் சொல்பவைதான் அந்தத் தோட்டத்தில் இருந்தன: அதில் இணைவைப்பவர்களின் அடக்கத் தலங்கள் இருந்தன. அதில் இடிபாடுகளும், சில பேரீச்சமரங்களும் இருந்தன. ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், இணைவைப்போரின் அடக்கத் தலங்களைத் தோண்டும்படி உத்தரவிட அவ்வாறே அவை தோண்டப்பட்டன. இடிபாடுகளை (அகற்றிச்) சமப்படுத்தும்படி உத்தரவிட அவ்வாறே அவை சமப்படுத்தப்பட்டன. பேரீச்ச மரங்களை வெட்டும்படி உத்தரவிட அவ்வாறே அவை வெட்டப்பட்டன. பள்ளிவாசலின் கிப்லா திசையில் பேரீச்சமரங்களை வரிசையாக நட்டனர். பள்ளிவாசலின் (கதவின்) இரு நிலைக் கால்களாக கல்லை (நட்டு) வைத்தனர். “ரஜ்ஸ்' எனும் ஈரசைச் சீரில் அமைந்த பாடலைப் பாடிக்கொண்டே அந்தக் கல்லை எடுத்துவரலாயினர். அப்போது அவர்களுடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் இருந்தார்கள். “இறைவா! மறுமையின் நன்மையைத் தவிர வேறு நன்மை கிடையாது; ஆகவே, (மறுமை வெற்றிக்காகப் பாடுபடும்) அன்சாரிகளுக்கும் முஹாஜிர்களுக்கும் உதவி செய்!” என்று அவர்கள் பாடிக்கொண்டிருந்தார்கள்.180 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3933,
			"arabicnumber": 3933,
			"text": "அப்துர் ரஹ்மான் பின் ஹுமைத் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறிய தாவது: நமிர் அல்கிந்தீயின் சகோதரி மகனான சாயிப் பின் யஸீத் (ரலி) அவர்களிடம் உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்கள், “முஹாஜிர், (ஹஜ் வழிபாடுகளை நிறைவேற்றிவிட்டு மினாவிலிருந்து வந்த பிறகு) மக்காவில் தங்குவது பற்றி நீங்கள் என்ன செவியுற்றிருக்கிறீர்கள்?” என்று வினவினார்கள். அதற்கு சாயிப் (ரலி) அவர்கள், “மினாவிலிருந்து வந்த பின்பு மூன்று நாட்கள் (மக்காவில் தங்க) முஹாஜிருக்கு அனுமதியுண்டு' என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள் என்று அலா பின் அல்ஹள்ரமீ (ரலி) அவர்கள் சொல்ல நான் கேட்டேன்” என்று பதிலளித்தார்கள்.181 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3934,
			"arabicnumber": 3934,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: மக்கள் (ஆண்டுக் கணக்கை) நபி (ஸல்) அவர்கள் இறைத்தூதராக நியமிக்கப் பட்ட (அவர்களுடைய 40ஆம் வய)திலிருந்தோ அவர்களுடைய மறைவிலிருந்தோ கணக்கிடவில்லை; மதீனாவுக்கு நபி (ஸல்) அவர்கள் (ஹிஜ்ரத் செய்து) வந்ததிலிருந்தே கணக்கிட்டார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3935,
			"arabicnumber": 3935,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: (மக்காவில்) தொழுகை இரண்டு ரக்அத்களாகக் கடமையாக்கப்பட்டது. பிறகு நபி (ஸல்) அவர்கள் மதீனாவுக்கு ஹிஜ்ரத் சென்றபின் நான்கு ரக்அத்களாகக் கடமையாக்கப்பட்டது. மேலும், பயணத் தொழுகை மட்டும் முன்பு கடமையாக்கப் பட்டிருந்தவாறே (இரண்டு ரக்அத்களாகவே இருக்கட்டுமென்று) விட்டுவிடப் பட்டது.183 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: “விடைபெறும் ஹஜ்'ஜின்போது நபி (ஸல்) அவர்கள், நோயுற்றிருந்த என்னை (நலம்) விசாரிக்க வந்தார்கள். அந்த நோயால் நான் இறப்பின் விளிம்புக்கே சென்றுவிட்டிருந்தேன். (நபி (ஸல்) அவர்களைக் கண்டதும்) நான், “அல்லாஹ் வின் தூதரே! நான் ஒரு செல்வந்தன்; எனக்கு ஒரேயொரு மகளைத் தவிர வேறு (நேரடி வாரிசு) எவரும் இல்லை. இந் நிலையில் நீங்கள் பார்க்கின்ற வேதனை என்னை வந்தடைந்துவிட்டது. ஆகவே, நான் என் செல்வத்தில் மூன்றில் இரண்டு பங்கைத் தர்மம் செய்துவிடட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “வேண்டாம்” என்று சொன்னார்கள். நான், “அப்படியென் றால் அதில் பாதியைத் தர்மம் செய்து விடட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “மூன்றிலொரு பங்கு (போதும்.) சஅதே! மூன்றிலொரு பங்கே அதிகம்தான். நீங்கள் உங்கள் சந்ததிகளை மக்களிடம் கையேந்தும் நிலையில் ஏழைகளாக விட்டுச்செல்வதைவிடத் தன்னிறைவுடையவர் களாக விட்டுச்செல்வதே சிறந்ததாகும். நீங்கள் அல்லாஹ்வின் அன்பை நாடிச் செலவழிக்கின்ற எதுவாயினும் அதற்குரிய பிரதிபலனை அல்லாஹ் உங்களுக்கு அளித்தே தீருவான்; உங்கள் மனைவியின் வாயில் நீங்கள் ஊட்டும் ஒரு கவளம் உணவாயினும் சரியே” என்று சொன்னார்கள். நான், “அல்லாஹ்வின் தூதரே! என் தோழர்கள் (எல்லாரும் மதீனாவுக்குச்) சென்றுவிட்ட பிறகு நான் (மட்டும், இங்கே மக்காவில்) பின்தங்கிவிடுவேனா?” என்று கேட்டேன். அதற்கு அவர்கள்,” நீங்கள் (இங்கு) பின்தங்கியிருந்து அல்லாஹ்வின் அன்பை நாடி நீங்கள் புரியும் நற்செயல் எதுவாயினும் அதனால் உங்களுக்குத் தகுதியும் உயர்வும் அதிகமாகவே செய்யும். சில சமுதாயத்தார் உங்களால் பலனடைவ தற்காகவும் வேறுசிலர் இழப்புக்குள்ளாவ தற்காகவும் (உங்கள் ஆயுள் நீட்டிக்கப்பட்டு இங்கேயே) நீங்கள் பின்தங்கிவிடக்கூடும்” என்று சொல்லிவிட்டு, “இறைவா! என் தோழர்கள் தங்கள் ஹிஜ்ரத்தை முழுமை யாக நிறைவேற்றும்படி செய்வாயாக! அவர்களைத் தம் கால்சுவடுகளின் வழியே (பழைய அறியாமைக் கால நிலைக்குத்) திருப்பியனுப்பிவிடாதே” என்று பிரார்த்தித் தார்கள். மேலும், “ஆயினும் சஅத் பின் கவ்லாதான் பாவம்” என்று சொன்னார்கள். சஅத் பின் கவ்லா (ரலி) அவர்கள் மக்காவிலேயே இறந்துவிட்டதற்காக அனுதாபம் தெரிவிக்கும் விதத்தில்தான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இப்படிக் கூறினார்கள்.184 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் இரு அறிவிப்புகளில், (உங்கள் வாரிசுகளை என்பதற்குப் பதிலாக) “உங்கள் வாரிசுகளை ஏழைகளாக நீங்கள் விட்டுச்செல்வது” என்று (நபி (ஸல்) அவர்கள் கூறியதாக) காணப்படுகிறது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3937,
			"arabicnumber": 3937,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் (ஹிஜ்ரத் செய்து) மதீனா வந்தார்கள். அப்போது நபி (ஸல்) அவர்கள் அவருக்கும் சஅத் பின் அர்ரபீஉ அல் அன்சாரி (ரலி) அவர்களுக்கும் இடையே சகோதரத்துவ உறவை ஏற்படுத்தினார்கள். சஅத் பின் அர்ரபீஉ (ரலி) அவர்கள், தம் குடும்பத்தாரையும் தமது செல்வத்தையும் அவருக்குச் சரிபாதியாகப் பங்கிட்டுத் தருவதாகக் கூறினார்கள். அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள், “அல்லாஹ் உங்களுக்கு உங்கள் வீட்டாரிலும் செல்வத்திலும் அருள்வளத்தை வழங்குவானாக! எனக்குக் கடைவீதியைக் காட்டுங்கள்” என்று சொன்னார்கள். (அவ்வாறே அவர் கடைவீதியைக் காட்ட அங்கு வியாபாரம் செய்து) சிறிது பாலாடைக் கட்டியையும் நெய்யையும் இலாபமாகப் பெற்றார்கள். சில நாட்களுக்குப் பிறகு நபி (ஸல்) அவர்கள், அப்துர் ரஹ்மான் பின் அவ்ஃப் அவர்கள்மீது (வாசனை திரவியத்தின்) மஞ்சள் அடையாளத்தைக் கண்டு (வியந்து), “என்ன இது, அப்துர் ரஹ்மான்!” என்று கேட்டார்கள். அதற்கு அப்துர் ரஹ்மான் அவர்கள், “அல்லாஹ்வின் தூதரே! நான் அன்சாரி பெண்ணொரு வரை மணம் புரிந்துகொண்டேன்” என்று பதிலளித்தார்கள். நபி (ஸல்) அவர்கள், “அவளுக்கு (மணக்கொடையாக) என்ன கொடுத்தீர்?” என்று கேட்க, “ஒரு பேரீச்சங் கொட்டை யளவு தங்கம்” என்று அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் பதிலளித் தார்கள். உடனே, நபி (ஸல்) அவர்கள், “ஓர் ஆட்டை அறுத்தாவது மணவிருந்து (வலீமா) கொடுப்பீராக!” என்று சொன் னார்கள்.188 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3938,
			"arabicnumber": 3938,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவுக்கு வந்திருக்கும் செய்தி (யூத மதத்தில் இருந்த) அப்துல்லாஹ் பின் சலாம் அவர்களுக்கு எட்டியது. உடனே அவர் நபி (ஸல்) அவர்களிடம் வந்து சில விஷயங்களைக் குறித்துக் கேட்டார். “தங்களிடம் நான் மூன்று விஷயங்களைப் பற்றிக் கேட்கப்போகிறேன். அவற்றை ஓர் இறைத்தூதர் மட்டுமே அறிவார்” என்று கூறினார். பிறகு, “1. இறுதி நாளின் அடையாளங்களில் முதலாவது அடையாளம் எது? 2. சொர்க்கவாசி முதலில் உண்ணும் உணவு எது? 3. குழந்தை தன் தந்தையின் சாயலிலோ, அல்லது தன் தாயின் சாயலிலோ இருப்பது எதனால்?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “சற்று முன்புதான் ஜிப்ரீல் எனக்கு இவற்றைக் குறித்து (விளக்கம்) தெரிவித்தார்” என்று கூறினார்கள். உடனே, அப்துல்லாஹ் பின் சலாம் அவர்கள், “ஜிப்ரீல்தான் வானவர்களிலேயே யூதர்களுக்குப் பகைவராயிற்றே!” என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இறுதிநாளின் அடையாளங்களில் முதலாவது அடையாளம் ஒரு நெருப் பாகும். அது மக்களைக் கிழக்கிலிருந்து (துரத்திக் கொண்டுவந்து) மேற்குத் திசையில் ஒன்றுதிரட்டும். சொர்க்கவாசிகள் முதலில் உண்ணும் உணவு பெரிய மீனின் ஈரல் பகுதியில் உள்ள அதிகப்படியான சதையாகும். குழந்தை(யிடம் காணப்படும் தாயின் அல்லது தந்தையின்) சாயலுக்குக் காரணம், ஆண் மனைவியுடன் உடலுறவு கொள்ளும்போது அவனது நீர் (விந்து உயிரணு) முந்திக்கொண்டால் குழந்தை அவனது சாயலில் பிறக்கிறது. பெண்ணின் நீர் (கருமுட்டை உயிரணு) முந்திக் கொண்டால் குழந்தை அவளது சாயலில் பிறக்கிறது” என்று பதிலளித்தார்கள். (உடனே) அப்துல்லாஹ் பின் சலாம் அவர்கள், “அல்லாஹ்வைத் தவிர வேறு இறைவன் யாருமில்லை என்றும், தாங்கள் அல்லாஹ்வின் தூதர்தான் என்றும் நான் உறுதிமொழிகிறேன்” என்று கூறினார்கள். பிறகு, “அல்லாஹ்வின் தூதரே! யூதர்கள் பொய்யில் ஊறித் திளைத்த சமுதாயத்தார் ஆவர். ஆகவே, நான் இஸ்லாத்தை ஏற்றுக்கொண்ட செய்தியை அவர்கள் அறிவதற்கு முன்னால் தாங்கள் என்னைப் பற்றி அவர்களிடம் கேட்டுப் பாருங்கள்” என்று கூறினார்கள். அப்போது யூதர்கள் (நபி (ஸல்) அவர்களிடம்) வந்தார்கள். (உடனே, அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்கள் வீட்டினுள் புகுந்து மறைந்து கொண்டார்கள்.) நபி (ஸல்) அவர்கள் (யூதர்களிடம்), “உங்களில் அப்துல்லாஹ் பின் சலாம் எத்தகைய மனிதர்?” என்று கேட்டார்கள். அதற்கு அவர்கள், “அவர் எங்களில் நல்லவரும், எங்களில் நல்லவரின் மகனும் ஆவார்; எங்களில் சிறந்தவரும், சிறந்தவரின் மகனும் ஆவார்” என்று பதிலளித்தார்கள். உடனே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அப்துல்லாஹ் (பின் சலாம்) இஸ்லாத்தை ஏற்றுக்கொண்டார் என்றால் நீங்கள் என்ன நினைப்பீர்கள்?” என்று கேட்டார்கள். அதற்கு அவர்கள், “அல்லாஹ் அவரை அதிலிருந்து காப்பாற்றுவானாக!” என்று சொன்னார்கள். மீண்டும் நபி (ஸல்) அவர்கள் யூதர்களிடம் முன்பு போலவே கேட்டார்கள். அதற்கு அவர்கள் முன்பு போலவே பதிலளித்தார் கள். உடனே (வீட்டினுள் மறைந்து கேட்டுக்கொண்டிருந்த) அப்துல்லாஹ் பின் சலாம் அவர்கள் வெளியே வந்து, “அல்லாஹ்வைத் தவிர வேறு இறைவன் யாருமில்லை என்றும் முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் தூதராவார்கள் என்றும் நான் உறுதிமொழிகிறேன்” என்று சொன்னார்கள். உடனே யூதர்கள், “இவர் எங்களில் கெட்டவரும் எங்களில் கெட்டவரின் மகனும் ஆவார்” என்று சொல்லிவிட்டு அவரைக் குறித்து (இல்லாத குற்றங்களைப் புனைந்து) குறை கூறலானார்கள். (அவற்றைக் கேட்ட) அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்கள், “இதைத்தான் நான் அஞ்சிக்கொண்டிருந்தேன், அல்லாஹ்வின் தூதரே!” என்று சொன்னார்கள்.189 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": 3940,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": 3941,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யூதர்களில் (முக்கியப் பிரமுகர்கள்) பத்துப் பேர் என்மீது நம்பிக்கை கொண்டி ருப்பார்களாயின், யூதர்கள் (அனைவருமே) என்மீது நம்பிக்கை கொண்டிருந்திருப் பார்கள்.192 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": 3942,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறிய தாவது: நபி (ஸல்) அவர்கள் மதீனா நகருக்குள் நுழைந்தார்கள். அப்போது யூதர்களில் சிலர் (முஹர்ரம் மாதம் பத்தாம் நாளான) ஆஷூரா நாளைக் கண்ணியப்படுத்தி அதில் நோன்பு நோற்றுவந்தார்கள். ஆகவே, நபி (ஸல்) அவர்கள், “அந்த நாளில் நோன்பு நோற்க நாமே அதிக உரிமையுடையவர்கள்” என்று சொல்லி அந்த நாளில் நோன்பு நோற்கும்படி (முஸ்லிம்களுக்கு) உத்தரவிட்டார்கள்.193 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": 3943,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவுக்கு வந்தபோது யூதர்கள் (முஹர்ரம் பத்தாம் நாளான) ஆஷூரா தினத்தன்று நோன்பு நோற்பதைக் கண்டார்கள். யூதர்களிடம் அது பற்றிக் கேட்கப்பட்டபோது அவர்கள், “இந்த நாள்தான் ஃபிர்அவ்னுக்கெதிராக மூசா (அலை) அவர்களுக்கும் இஸ்ரவேலர் களுக்கும் அல்லாஹ் வெற்றியளித்த நாள். ஆகவே, நாங்கள் மூசா (அலை) அவர் களைக் கண்ணியப்படுத்தும் விதத்தில் அதில் நோன்பு நோற்கிறோம்” என்று சொன்னார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “மூசா (அலை) அவர் களைக் கண்ணியப்படுத்திட நாங்களே அதிக உரிமையுடையவர்கள்” என்று சொல்லிவிட்டு அந்நாளில் (தாமும் நோன்பு நோற்று) நோன்பு நோற்கும்படி (முஸ்óம்களுக்கு) உத்தரவிட்டார்கள்.194 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": 3944,
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தம் (முன்தலை) முடியைத் (தம் நெற்றியின் மீது) தொங்க விட்டுவந்தார்கள். இணைவைப்பாளர்கள் தங்கள் தலை (முடி)களைப் பிரித்து (நெற்றியில் விழ விடாமல் இரு பக்கமும் தொங்கவிட்டு)வந்தார்கள். வேதக்காரர்கள் தங்கள் தலை (முடி)களைத் (தம் நெற்றிகளின் மீது) தொங்கவிட்டுவந்தார்கள். எந்த விஷயங்களில் (இறைக்)கட்டளை எதுவும் இடப்படவில்லையோ அந்த விஷயங்களில் வேதக்காரர்களுடன் ஒத்துப்போவதை நபி (ஸல்) அவர்கள் விரும்பிவந்தார்கள். பின்னர் (நபி (ஸல்) அவர்கள் தம் தலை(முடி)யை (இரு பக்கங்களிலும்) பிரித்து (வகிடெடுத்து)க் கொண்டார்கள்.195 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": 3945,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அந்த வேதக்காரர்கள் (எத்தகையவர்கள் எனில், குர்ஆன் எனும்) அதனைப் பல பகுதிகளாகப் பிரித்துக்கொண்டார்கள். அதில் சிலவற்றை நம்பி ஏற்று, சிலவற்றை ஏற்க மறுத்துவிட்டார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": 3946,
			"text": "அபூஉஸ்மான் அந்நஹ்தீ (ரஹ்) அவர்கள் கூறியதாவது: சல்மான் அல்ஃபாரிசீ (ரலி) அவர்கள், “நான் ஓர் எசமானிடமிருந்து இன்னோர் எசமானாகப் பத்துக்கு மேற்பட்ட எசமானர் களின் கைக்கு (விற்கப்பட்டு) மாறிக் கொண்டிருந்தேன்” என்று சொன்னார்கள்.197 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": 3947,
			"text": "சல்மான் அல்ஃபாரிசீ (ரலி) அவர்கள் கூறியதாவது: நான் “ராம ஹுர்முஸ்' எனுமிடத்திலிருந்து வந்தவன்.198 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": 3948,
			"text": "சல்மான் அல்ஃபாரிசீ (ரலி) அவர்கள் கூறியதாவது: ஈசா (அலை) அவர்களுக்கும் முஹம்மத் (ஸல்) அவர்களுக்கும் இடை யிலான காலம் அறுநூறாண்டுகளாகும்.199 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 172
			}
		}
	]
}