{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4979,
			"arabicnumber": 4979,
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4980,
			"arabicnumber": 4980,
			"text": "அபூஉஸ்மான் அப்துர் ரஹ்மான் அந்நஹ்தீ (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் வந்து பேசிக் கொண்டிருந்தார்கள். அப்போது அவர்கள் அருகில் (அன்னை) உம்மு சலமா (ரலி) அவர்கள் இருந்தார்கள். (ஜிப்ரீல் எழுந்து சென்றதும்) நபி (ஸல்) அவர்கள் உம்மு சலமா (ரலி) அவர்களிடம், ‘‘இவர் யார் (தெரியுமா)?” என்றோ, அல்லது இது போன்ற வேறொரு வார்த்தையைக் கூறியோ கேட்டார்கள். உம்மு சலமா (ரலி) அவர்கள், ‘‘இவர் (தங்களுடைய தோழர்) திஹ்யா” என்று பதிலளித்தார்கள். நபி (ஸல்) அவர்கள் எழுந்து சென்றபின், உம்மு சலமா (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! நபி (ஸல்) அவர்கள் ஜிப்ரீல் (அலை) அவர்கள் சொன்ன செய்தி குறித்து நிகழ்த்திய உரையை நான் செவியுறும்வரை, வந்தவர் திஹ்யா அல்கல்பீ என்றே நினைத்திருந்தேன். (அந்த உரையைக் கேட்ட பின்புதான் அவர் திஹ்யாவின் உருவில் வந்த (வானவர்) ஜிப்ரீல் என்று எனக்குத் தெரியவந்தது.)” என்று கூறினார்கள். (அறிவிப்பாளர்களில் ஒருவரான) சுலைமான் பின் தர்கான் அத் தைமீ (ரஹ்) அவர்கள் கூறினார்கள்: நான் அபூஉஸ்மான் (ரஹ்) அவர்களிடம், ‘‘இந்த அறிவிப்பைத் தாங்கள் யாரிடமிருந்து செவியுற்றீர்கள்?” என்று கேட்டேன். அவர்கள், ‘‘உசாமா பின் ஸைத் (ரலி) அவர்களிடமிருந்து” என்று பதிலளித்தார்கள்.3 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4981,
			"arabicnumber": 4981,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒவ்வோர் இறைத்தூதருக்கும் சில அற்புதங்கள் வழங்கப்பட்டே இருந்தன. அவற்றைக் காணும் மக்கள் நம்பித்தான் ஆக வேண்டிய நிலை இருந்தது. எனக்கு வழங்கப்பெற்ற அற்புதமெல்லாம், அல்லாஹ் எனக்கு அருளிய வேதஅறிவிப்பு (வஹீ)தான். ஆகவே, நபிமார்களிலேயே மறுமை நாளில், பின்பற்றுவோர் அதிகம் உள்ள நபியாக நான் இருக்க வேண்டும் என எதிர்பார்க்கிறேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4982,
			"arabicnumber": 4982,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ், தன் தூதர் (ஸல்) அவர்கள் இறக்கும்வரையிலும் அவர்களுக்குத் தொடர்ந்து ‘வஹீ’ (வேதஅறிவிப்பை) அருளினான். அவர்கள் இறப்பதற்குச் சற்று முன்பு அருளப்பெற்ற வேதஅறிவிப்பு (மற்றக் காலங்களில் அருளப்பெற்றதைவிட) அதிகமாக இருந்தது. அதற்குப் பின்னரே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறந்தார்கள்.4 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4983,
			"arabicnumber": 4983,
			"text": "ஜுன்துப் பின் அப்தில்லாஹ் பின் சுஃப்யான் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) நபி (ஸல்) அவர்கள் நோய்வாய்ப்பட்டபோது ‘ஓர் இரவு’ அல்லது ‘இரண்டு இரவுகள்’ அவர்கள் (இரவுத் தொழுகைக்காகக்கூட) எழவில்லை. அப்போது ஒரு பெண் நபி (ஸல்) அவர்களிடம் வந்து, ‘‘முஹம்மதே! உம்முடைய ஷைத்தான் உம்மைக் கைவிட்டுவிட்டதாகவே நான் கருதுகின்றேன். (அதனால்தான் ஓரிரு இரவுகளாக உம்மை அவன் நெருங்க வில்லை)” என்று கூறினாள். அப்போது வல்லமையும் மாண்பும் மிக்க அல்லாஹ், ‘‘முற்பகலின் மீது சத்தியமாக! மேலும், இருண்டுவிட்ட இரவின்மீது சத்தியமாக! (நபியே!) உம்முடைய இறைவன் உம்மைக் கைவிடவுமில்லை; கோபங்கொள்ளவும் இல்லை” எனும் (93:1-3 ஆகிய) வசனங் களை அருளினான்.5 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4984,
			"arabicnumber": 4984,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: (மூன்றாவது கலீஃபா) உஸ்மான் (ரலி) அவர்கள் (நபி (ஸல்) அவர்களின் துணைவியாரான ஹஃப்ஸா (ரலி) அவர்கள் வசமிருந்த குர்ஆன் பதிவுகளை வாங்கி வரச்செய்து), ஸைத் பின் ஸாபித், சயீத் பின் அல்ஆஸ், அப்துல்லாஹ் பின் அஸ்ஸுபைர், அப்துர் ரஹ்மான் பின் ஹாரிஸ் பின் ஹிஷாம் (ரலி) ஆகியோரை (அழைத்து வரச்செய்து அவர்களிடம்) அவற்றை ஏடுகளில் பிரதியெடுக்கப் பணித்தார்கள். மேலும் உஸ்மான் (ரலி) அவர்கள் (அன்சாரியான ஸைத் பின் ஸாபித் (ரலி) அவர்கள் அல்லாத குறைஷியரான மற்ற மூவரிடமும்), ‘‘நீங்கள் மூவரும் ஸைத் பின் ஸாபித்தும் குர்ஆனின் ஏதேனும் ஓர் அரபிமொழி (எழுத்திலக்கணம்) விஷயத்தில் கருத்து வேறுபாடு கொண்டால், குறைஷியரின் மொழி வழக்கிலேயே அதைப் பதிவு செய்யுங்கள்! ஏனெனில், குர்ஆன் குறைஷியரின் மொழி வழக்கில்தான் அருளப்பெற்றது” என்று சொன்னார்கள். அம்மூவரும் அவ்வாறே செய்தனர்.6 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4985,
			"arabicnumber": 4985,
			"text": "ஸஃப்வான் பின் யஅலா (ரஹ்) அவர்கள் கூறியதாவது: (என் தந்தை) யஅலா பின் உமைய்யா (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு வேதஅறிவிப்பு (வஹீ) அருளப்பெறும்போது நான் அவர்களைப் பார்க்க வேண்டும் (என்று ஆசையாக உள்ளது)” என்று கூறுவது வழக்கம். நபி (ஸல்) அவர்கள் (மக்காவிற்கு அருகிலுள்ள) ‘ஜிஅரானா’ எனும் இடத்தில் தமக்கு மேலே துணியொன்று நிழலிட்டுக்கொண்டிருக்கத் தங்கியிருந்தார்கள். அவர்களுடன் தோழர்கள் சிலரும் இருந்தனர். அப்போது நறுமணம் பூசிய ஒரு மனிதர் வந்து, ‘‘அல்லாஹ்வின் தூதரே! நறுமணம் பூசப்பட்ட அங்கியால் (உம்ராவுக்காக) இஹ்ராம் அணிந்தவர் பற்றி என்ன கூறுகிறீர்கள்?” என்று கேட்டார். நபி (ஸல்) அவர்கள் சிறிது நேரம் (மௌனத்துடன்) காத்திருந்தார்கள். அப்போது அவர்களுக்கு ‘வஹீ’ (வேத அறிவிப்பு) வந்தது. உமர் (ரலி) அவர்கள் யஅலா அவர்களை, ‘‘இங்கு வாருங்கள்” என்று சைகையால் அழைத்தார்கள். (என் தந்தை யஅலா (ரலி) அவர்கள் கூறினார்கள்:) நான் சென்றேன். (நபி (ஸல்) அவர்களுக்கு நிழல் தருவதற்காகக் கட்டப்பட்டிருந்த துணிக்குள்) நான் எனது தலையை நுழைத்தேன். நபி (ஸல்) அவர்கள் முகம் சிவந்த நிலையில் (வஹீயின் கனத்தால்) முனகியவர்களாக சிறிது நேரம் காணப்பட்டார்கள். பிறகு (சிறிது சிறிதாக) அந்தச் சிரம நிலை விலகியது. அப்போது நபி (ஸல்) அவர்கள், ‘‘சற்றுமுன் என்னிடம் உம்ராவைப் பற்றிக் கேட்டவர் எங்கே?” என்றார்கள். அந்த மனிதரைத் தேடி அவரை நபி (ஸல்) அவர்களிடம் (அழைத்துக்) கொண்டுவரப்பட்டது. அவரிடம், ‘‘உம்மீதுள்ள நறுமணத்தை மூன்று முறை கழுவிக்கொள்க! (தைக்கப்பட்ட) அங்கியைக் களைந்துகொள்க! பிறகு உமது ஹஜ்ஜில் செய்வதைப் போன்றே உமது உம்ராவிலும் செய்துகொள்க!” என்று சொன்னார்கள்.7 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4986,
			"arabicnumber": 4986,
			"text": "(வேதஅறிவிப்பை எழுதுவோரில் ஒருவராக இருந்த) ஸைத் பின் ஸாபித் அல்அன்சாரீ (ரலி) அவர்கள் கூறியதாவது: யமாமா போர் நடைபெற்றபின் (கலீஃபா) அபூபக்ர் (ரலி) அவர்கள், எனக்கு ஆளனுப்பி (என்னை அழைத்துவரச் சொன்)னார்கள். (நான் சென்றேன்.) அங்கே அவர்களுடன் உமர் பின் அல்கத்தாப் (ரலி) அவர்களும் இருந்தார்கள். அப்போது அபூபக்ர் (ரலி) அவர்கள் கூறினார்கள்: உமர் (ரலி) அவர்கள் என்னிடம் வந்து, ‘‘இந்த யமாமா போரில் ஏராளமான குர்ஆன் அறிஞர்கள் கொல்லப்பட்டுவிட்டனர். (இறைமறுப் பாளர்களுடன் போர் நடக்கும்) பல்வேறு இடங்களில் குர்ஆன் அறிஞர்களில் ஏராளமான பேர் கொல்லப்பட்டு, அதனால் குர்ஆனின் பெரும் பகுதி (நம்மைவிட்டுப்) போய்விடுமோ என நான் அஞ்சுகிறேன். (ஆகவே,) தாங்கள் குர்ஆனைத் திரட்டி ஒன்றுசேர்க்க உத்தரவிட வேண்டுமென நான் கருதுகின்றேன்” என்று கூறினார்கள். நான், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்யாத ஒன்றை நாம் எப்படிச் செய்வது?” என உமர் அவர்களிடம் கேட்டேன். அதற்கு உமர் அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! இது (குர்ஆனைத் திரட்டுவது) நன்மை(யான பணி)தான்” என்று கூறினார்கள். இதற்காக என் மனத்தை அல்லாஹ் விரிவாக்கும்வரை இந்த விஷயத்தில் (தொடர்ந்து) அவர்கள் என்னிடம் வலியுறுத்திக்கொண்டேயிருந்தார்கள். (முடிவில்) உமர் அவர்கள் கருதியதை(யே) நானும் (உசிதமானதாகக்) கண்டேன். (இதை அபூபக்ர் அவர்கள் என்னிடம் தெரிவித்தபோது உமர் (ரலி) அவர்கள் ஏதும் பேசாமல் அபூபக்ர் (ரலி) அவர்களுக்கு அருகில் அமர்ந்துகொண்டிருந்தார்கள்.) (பிறகு) அபூபக்ர் (ரலி) அவர்கள் (என்னிடம்), ‘‘(ஸைதே!) நீங்கள் புத்திசாóயான இளைஞர்; உங்களை நாங்கள் (எந்த விதத்திலும்) சந்தேகப்படமாட்டோம். நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காக ‘வஹீ’ (வேத வசனங்களை) எழுதக்கூடியவராயிருந்தீர்கள். எனவே, நீங்கள் குர்ஆனைத் தேடிக் கண்டுபிடித்து (ஒரே பிரதியில்) ஒன்றுதிரட்டுங்கள்” என்று கூறினார்கள். அல்லாஹ்வின் மீதாணையாக! மலைகளில் ஒன்றை நகர்த்த வேண்டுமென எனக்கு அவர்கள் கட்டளையிட்டிருந்தாலும்கூட அது எனக்குப் பளுவாக இருந்திருக்காது. குர்ஆனை ஒன்றுதிரட்டும்படி எனக்கு அவர்கள் கட்டளையிட்டது அதைவிட எனக்குப் பளுவாக இருந்தது. நான், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்யாத ஒன்றை நீங்கள் எப்படிச் செய்கிறீர்கள்?” என்று கேட்டேன். அதற்கு அபூபக்ர் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! இது நன்மை(யான பணி)தான்” என்று பதிலளித்தார்கள். இதையே அன்னார் என்னிடம் தொடர்ந்து வலியுறுத்திக்கொண்டிருந்தார்கள். முடிவில் எதற்காக அபூபக்ர் மற்றும் உமர் ஆகியோரின் மனத்தை அல்லாஹ் விரிவாக்கினானோ அதற்காக என் மனத்தையும் அல்லாஹ் விரிவாக்கினான். (குர்ஆனை ஒன்றுதிரட்ட முன்வந்தேன்.) ஆகவே, (மக்களின் கரங்களிலிருந்த) குர்ஆன் (சுவடிகளைத்) தேடினேன். அவற்றை பேரீச்ச மட்டைகள், ஓடுகள் மற்றும் (குர்ஆனை மனனம் செய்திருந்த) மனிதர்களின் நெஞ்சுகளிலிருந்து திரட்டினேன். (இவ்வாறு திரட்டியபோது) ‘அத்தவ்பா’ எனும் (9ஆவது) அத்தியாயத்தின் கடைசி (இரு) வசனங்களை அபூகுஸைமா அல்அன்சாரீ (ரலி) அவர்களிடமிருந்து பெற்றேன்; அவரல்லாத வேறெவரிடமிருந்தும் அவற்றை நான் பெறவில்லை. (அவை:) உங்களிலிருந்தே ஒரு தூதர் உங்களிடம் வந்திருக்கின்றார். நீங்கள் துன்பத்திற்குள்ளாவது அவருக்குக் சிரமமாக இருக்கிறது. மேலும், உங்கள் (வெற்றியின்) விஷயத்தில் பேராவல் கொண்டவராகவும், நம்பிக்கையாளர்கள் மீது அதிகப் பரிவும், கருணையும் உடையோராகவும் அவர் இருக்கின்றார். (நபியே! இதற்குப்) பின்னரும் அவர்கள் உம்மைப் புறக்கணித்தால் நீர் கூறிவிடும்: அல்லாஹ் எனக்குப் போதுமானவன். அவனைத் தவிர வேறு இறைவன் இல்லை. அவனையே நான் முழுமையாகச் சார்ந்திருக்கின்றேன். மேலும், அவன் மகத்தான அரியணையின் அதிபதியாயிருக்கின்றான். (9:128, 129) (என் வாயிலாக) திரட்டித் தொகுக்கப்பட்ட குர்ஆன் பிரதிகள் (கலீஃபா) அபூபக்ர் (ரலி) அவர்களிடம், அவர்களை அல்லாஹ் இறக்கச் செய்யும்வரை இருந்(து வந்)தது. பின்னர் (கலீஃபாவான) உமர் (ரலி) அவர்களிடம் அவர்களின் வாழ்நாளில் இருந்தது. (அவர்களது இறப்பிற்குப்) பிறகு உமர் (ரலி) அவர்களுடைய புதல்வி ஹஃப்ஸா (ரலி) அவர்களிடம் இருந்தது.8 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4987,
			"arabicnumber": 4987,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் உஸ்மான் (ரலி) அவர்களிடம் (அவர்களது ஆட்சிக் காலத்தின்போது மதீனாவிற்கு) வருகை புரிந்தார்கள். அப்போது (கலீஃபா) உஸ்மான் (ரலி) அவர்கள், அர்மீனியா மற்றும் ஆதர்பைஜான் ஆகிய நாடுகளை இராக்கியருடன் சேர்ந்து வெற்றி கொள்வதற்கு ஷாம்வாசிகளை ஆயத்தப்படுத்தியிருந்தார்கள்.9 (இப்போரில் கலந்துகொண்டிருந்த) ஹ’தைஃபா (ரலி) அவர்களை, குர்ஆன் ஓதும் முறைகளில் மக்களிடையே எழுந்த கருத்து வேறுபாடு அதிர்ச்சிக் குள்ளாக்கியது.10 ஆகவே, ஹுதைஃபா (ரலி) அவர்கள் உஸ்மான் (ரலி) அவர்களிடம், ‘‘யூதர்களும் கிறித்தவர்களும் (தங்களுடைய வேதங்களில்) கருத்து வேறுபாடு கொண்டதுபோல் இந்தச் சமுதாயமும் இந்த(த் திருக்குர்ஆன்) வேதத்தில் கருத்து வேறுபாடு கொள்வதற்கு முன்பே இவர்களைக் காப்பாற்றுங்கள், இறைநம்பிக்கையாளர்களின் தலைவர் அவர்களே!” என்று கூறினார்கள். ஆகவே, உஸ்மான் (ரலி) அவர்கள் (அன்னை) ஹஃப்ஸா (ரலி) அவர்களிடம் ஆளனுப்பி, ‘‘தங்களிடமுள்ள குர்ஆன் பதிவை எங்களிடம் கொடுத்து அனுப்புங் கள்! நாங்கள் அதனைப் பல பிரதிகள் படியெடுத்துவிட்டு திருப்பித் தந்துவிடுகிறோம்” என்று தெரிவித்தார்கள். எனவே, ஹஃப்ஸா (ரலி) அவர்கள் தம்மிடமிருந்த குர்ஆன் பதிவை உஸ்மான் (ரலி) அவர்களிடம் கொடுத்தனுப்பினார்கள். ஸைத் பின் ஸாபித் (ரலி), அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி), சயீத் பின் அல்ஆஸ் (ரலி), அப்துர் ரஹ்மான் பின் ஹாரிஸ் பின் ஹிஷாம் (ரலி) ஆகியோரிடம் அவற்றைப் பல பிரதிகளில் படியெடுக்கும்படி உஸ்மான் (ரலி) அவர்கள் உத்தரவிட்டார்கள். மேலும், உஸ்மான் (ரலி) அவர்கள் (அந்த நால்வரில்) குறைஷிக் குழுவினரான மூவரை நோக்கி, ‘‘நீங்களும் (அன்சாரியான) ஸைத் பின் ஸாபித் அவர்களும் குர்ஆனில் ஏதேனும் ஒரு (எழுத்திலக்கண) விஷயத்தில் கருத்து வேறுபாடு கொண்டால் குறைஷியரின் (வட்டார) மொழி வழக்குப்படியே பதிவு செய்யுங்கள். ஏனெனில், குர்ஆன் குறைஷியரின் மொழி வழக்குப்படியே அருளப்பெற்றது” என்று கூறினார்கள். அந்த நால்வரும் அவ்வாறே செயல்பட்டார்கள். (ஹஃப்ஸா (ரலி) அவர்களிடமிருந்த) அந்த குர்ஆன் பதிவைப் பல பிரதிகளில் படியெடுத்தார்கள். பிறகு உஸ்மான் (ரலி) அவர்கள் அந்தப் பிரதியை ஹஃப்ஸா (ரலி) அவர்களிடமே திருப்பிக் கொடுத்துவிட்டார்கள். பிறகு அவர்கள் படியெடுத்த பிரதிகளில் ஒவ்வொன்றையும் ஒவ்வொரு பகுதிக்கு அனுப்பிவைத்தார்கள். இதுவல்லாமல் (புழக்கத்திலிருந்த) இதர பிரதிகளை, அல்லது ஏடுகளை எரித்துவிடும்படி உஸ்மான் (ரலி) அவர்கள் உத்தரவிட்டார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4988,
			"arabicnumber": 4988,
			"text": "ஸைத் பின் ஸாபித் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (உஸ்மான் (ரலி) அவர்களின் ஆட்சிக் காலத்தில்) குர்ஆனுக்குப் பிரதிகள் எடுத்தபோது ‘அல்அஹ்ஸாப்’ எனும் (33ஆவது) அத்தியாயத்தில் ஒரு வசனம் காணவில்லை. அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓத நான் கேட்டிருந்தேன். அதை நாங்கள் தேடியபோது அது குஸைமா பின் ஸாபித் அல்அன்சாரீ (ரலி) அவர்களிடம் இருக்கக் கண்டோம். (அந்த வசனம் இதுதான்:) அல்லாஹ்விடம் தாங்கள் கொடுத்த வாக்குறுதியை மெய்ப்படுத்திவிட்டவர்களும் இறைநம்பிக்கையாளர்களில் உள்ளனர். அவர் களில் சிலர் (இறைவழியில் உயிரை அர்ப்பணிக்க வேண்டுமென்ற) தமது இலட்சியத்தை நிறைவேற்றிவிட்டார்கள். அவர்களில் சிலர் (அதை நிறைவேற்ற தக்க தருணம்) எதிர்பார்த்துக் காத்துக்கொண்டிருக்கின்றனர்.(33:23) உடனே நாங்கள் அ(ந்த வசனத்)தை குர்ஆன் பிரதியில் அதற்குரிய அத்தியாயத்தில் இணைத்துவிட்டோம்.11 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4989,
			"arabicnumber": 4989,
			"text": "ஸைத் பின் ஸாபித் (ரலி) அவர்கள் கூறியதாவது: (கலீஃபா) அபூபக்ர் (ரலி) அவர்கள் எனக்கு ஆளனுப்பி (என்னை அழைத்து வரச் சொன்)னார்கள். (நான் அவர்களிடம் சென்றேன். என்னிடம்) அவர்கள், ‘‘நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு அருளப்பெற்ற ‘வஹீ’ (வேத வசனங்)களை எழுதிவந்தீர்கள். எனவே, குர்ஆன் வசனங்களைத் தேடுங்கள்!” என்று சொன்னார்கள். ஆகவே, நான் குர்ஆன் வசனங்களைத் தேடும் பணியில் ஈடுபட்டேன். இறுதியாக ‘அத்தவ்பா’ எனும் (9ஆவது) அத்தியாயத்தின் கடைசி இரு வசனங்களை அபூகுஸைமா அல்அன்சாரீ (ரலி) அவர்களிடமிருந்து பெற்றேன். அவரல்லாத வேறு எவரிடமும் அவற்றை நான் காணவில்லை. (அவ்விரு வசனங்களாவன:) உங்களிலிருந்தே ஒரு தூதர் உங்களிடம் வந்திருக்கின்றார். நீங்கள் துன்பத்திற்குள்ளாவது அவருக்குச் சிரமமாக இருக்கிறது. மேலும், உங்கள் (வெற்றியின்) விஷயத்தில் பேராவல் கொண்டவராகவும், நம்பிக்கையாளர்கள்மீது அதிகப் பரிவும் கருணையும் உடையோராகவும் அவர் இருக்கின்றார். (நபியே! இதற்குப்) பின்னரும் அவர்கள் உம்மைப் புறக்கணித்தால் நீர் கூறிவிடும்: அல்லாஹ் எனக்குப் போதுமானவன். அவனைத் தவிர வேறு இறைவன் யாருமில்லை. அவனையே நான் முழுமையாகச் சார்ந்திருக்கின்றேன். மேலும், அவன் மகத்தான அரியணையின் அதிபதியாயிருக்கின்றான்.(9:128,129)13 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4990,
			"arabicnumber": 4990,
			"text": "பராஉ (ரலி) அவர்கள் கூறியதாவது: ‘‘இறைநம்பிக்கையாளர்களில் அறப்போரில் கலந்துகொள்ளாமல் இருந்துவிட்டவர்களும், தமது உயிராலும் பொருளாலும் அல்லாஹ்வின் வழியில் அறப்போர் புரிந்தவர்களும் சமமாகமாட்டார்கள்” எனும் (4:95ஆவது) இறைவசனம் அருளப்பெற்றபோது, நபி (ஸல்) அவர்கள் (என்னிடம்), ‘‘ஸைதை அழைத்துவாருங்கள். அவர் தம்முடன் ‘பலகை, மைக்கூடு, அகலமான எலும்பு’ அல்லது ‘அகலமான எலும்பு, மைக்கூடு’ ஆகியவற்றை எடுத்துவரட்டும்” என்று சொன்னார்கள். (ஸைத் பின் ஸாபித் (ரலி) அவர்கள் வந்தபோது,) ‘‘இந்த (4:95ஆவது) இறைவசனத்தை எழுதிக்கொள்ளுங்கள்!” என்று சொன்னார்கள். அப்போது நபி (ஸல்) அவர்களது முதுகுக்குப் பின்னால், கண்பார்வையற்றவரான அம்ர் பின் உம்மி மக்த்தூம் (ரலி) அவர்கள் இருந்தார்கள். அவர், ‘‘அல்லாஹ்வின் தூதரே! தாங்கள் எனக்கு என்ன உத்தரவிடுகின்றீர்கள். நானோ, கண்பார்வையற்ற மனிதனாயிற்றே!” என்று கேட்டார்கள். உடனடியாக அதே இடத்தில், ‘தக்க காரணமின்றி’ எனும் (இணைப்புடன்) இவ்வசனம் (முழுமையாக) அருளப்பெற்றது.14 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4991,
			"arabicnumber": 4991,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரேயொரு (வட்டார) மொழிவழக்குப் படி (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் (குர்ஆனை) எனக்கு ஓதக் கற்றுக் கொடுத்தார்கள். அதை இன்னும் பல (வட்டார) மொழிவழக்குகளின் படி எனக்கு ஓதக் கற்றுத்தருமாறு அவர்களிடம் நான் திரும்பத் திரும்பக் கேட்டுக்கொண்டேயிருந்தேன். (நான் கேட்கக் கேட்க) எனக்கு அவர்கள் அதிகப் படுத்திக்கொண்டே வந்து இறுதியில் ஏழு (வட்டார) மொழிவழக்குகள் அளவுக்கு வந்து நின்றது. இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.16 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4992,
			"arabicnumber": 4992,
			"text": "உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது வாழ்நாளில் ஹிஷாம் பின் ஹகீம் (ரலி) அவர்கள் ‘அல்ஃபுர்கான்’ எனும் (25ஆவது) அத்தியாயத்தை (தொழுகையில்) ஓதுவதை நான் செவியுற்றேன். அவரது ஓதலை நான் செவிதாழ்த்திக் கேட்டபோது எனக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓதிக்காண்பிக்காத பல (வட்டார) மொழி வழக்குகளில் அதை அவர் ஓதிக் கொண்டிருந்தார். தொழுகையில் வைத்தே நான் அவரைத் தண்டிக்க முனைந்தேன். பிறகு (யோசித்து) அவர் (தொழுகையை முடித்து) சலாம் கொடுக்கும்வரை பொறுத்துக்கொண்டேன். (அவர் தொழுது முடித்த) பிறகு அவரது மேல்துண்டைக் கழுத்தில் போட்டுப் பிடித்து, ‘‘நீர் ஓதியபோது நான் செவியுற்ற இந்த அத்தியாயத்தை உமக்கு ஓதிக்காண்பித்தது யார்?” என்று கேட்டேன். அவர், ‘‘இதை எனக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்தான் ஓதிக்காண்பித்தார்கள்” என்று பதிலளித்தார். உடனே நான், ‘‘நீர் பொய் சொல்லிவிட்டீர்! ஏனெனில், நீர் ஓதியதற்கு மாற்றமாகவே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அதை எனக்கு ஓதிக்கொடுத்தார்கள்” என்று கூறியபடி அவரை இழுத்துக்கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றேன். அவர்களிடம், ‘‘(அல்லாஹ்வின் தூதரே!) தாங்கள் எனக்கு ஓதிக்கொடுக்காத பல (வட்டார) மொழிவழக்குகளில் ‘அல்ஃபுர்கான்’ அத்தியாயத்தை இவர் ஓதக் கேட்டேன்” என்று சொன்னேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘அவரை விடுங்கள்!” என்று கூறிவிட்டு (ஹிஷாம் அவர்களை நோக்கி), ‘‘ஹிஷாமே, நீங்கள் ஓதுங்கள்!” என்றார்கள். அவர் என்னிடம் ஓதியதைப் போன்றே நபி (ஸல்) அவர்களுக்கு முன்னாலும் ஓதிக்காட்டினார். (இதைக் கேட்ட) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘இப்படித்தான் (இந்த அத்தியாயம்) அருளப்பெற்றது” என்று கூறினார்கள். பிறகு (என்னைப் பார்த்து), ‘‘உமரே, ஓதுங்கள்!” என்று சொன்னார்கள். எனக்கு அவர்கள் ஓதிக்கொடுத்திருந்த ஓதல்முறைப்படி நான் ஓதினேன். (அதைக் கேட்ட) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘இப்படித்தான் (இந்த அத்தியாயம்) அருளப்பெற்றது. இந்தக் குர்ஆன் ஏழு முறைகளில் அருளப்பட்டிருக்கிறது. ஆகவே, உங்களுக்கு அதில் எளிதானது எதுவோ அதை ஓதிக்கொள்ளுங்கள்” என்று கூறினார்கள்.17 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4993,
			"arabicnumber": 4993,
			"text": "யூசுப் பின் மாஹக் (ரஹ்) அவர்கள் கூறியதாவது: இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்களிடம் நான் இருந்துகொண்டிருந்தேன். அப்போது இராக் நாட்டைச் சேர்ந்த ஒருவர் வந்து, ‘‘(இறந்தவருக்கு அணிவிக்கப்படும்) ‘கஃபன்’ துணியில் சிறந்தது எது? (வெள்ளை நிறமா? மற்ற நிறமா?)” என்று கேட்டார். ஆயிஷா (ரலி) அவர்கள், ‘‘அடப் பாவமே! (நீங்கள் இறந்ததற்குப் பின்னால் எந்த கஃபன் துணியில் அடக்கப்பட்டாலும்) உங்களுக்கு என்ன கஷ்டம் வந்துவிடப் போகிறது?” என்று கேட்டார்கள். அதற்கு அவர், ‘‘இறைநம்பிக்கையாளர் களின் அன்னையே! தங்களிடமுள்ள குர்ஆன் பிரதியை எனக்குக் காட்டுங்கள்?” என்று கூறினார். (அன்னை) அவர்கள், ‘ஏன்?’ என்று கேட்டார்கள். அதற்கு அவர், ‘‘அதை (முன்மாதிரியாக)க் கொண்டு நான் குர்ஆனை (வரிசைப்படி) தொகுக்க வேண்டும். ஏனெனில், (தற்சமயம்) வரிசைப் பிரகாரம் தொகுக்கப்படாமல்தான் குர்ஆன் ஓதப்பட்டுவருகிறது” என்று சொன்னார். ஆயிஷா (ரலி) அவர்கள், ‘‘(வரிசைப்படுத்தப்படாமல் உள்ள குர்ஆன் அத்தியாயங்களில்) எதை நீங்கள் முதலில் ஓதினால் (என்ன? எதை அடுத்து ஓதினால்) என்ன கஷ்டம் (ஏற்பட்டுவிடப்போகிறது)?” என்று கேட்டார்கள். ‘முஃபஸ்ஸல்’ (எனும் ஓரளவு சிறிய) அத்தியாயங்களில்19 உள்ள ஒன்றுதான் முதன்முதலில் அருளப்பட்டது; அதில் சொர்க்கம் நரகம் பற்றிக் கூறப்பட்டது.20 அடுத்து மக்கள் இஸ்லாத்தை நோக்கித் திரும்பி (அதன் நம்பிக்கைள்மீது திருப்தியடையத் தொடங்கி)யபோது ஹலால் (அனுமதிக்கப்பட்டவை) ஹராம் (விலக்கப்பட்டவை) குறித்த வசனங்கள் அருளப்பட்டன. எடுத்த எடுப்பிலேயே, ‘‘நீங்கள் மது அருந்தாதீர்கள்” என்று வசனம் அருளப்பட்டிருந்தால் அவர்கள், ‘‘நாங்கள் ஒருபோதும் மதுவைக் கைவிடமாட்டோம்” என்று கூறியிருப்பார் கள். அல்லது, ‘‘விபசாரம் செய்யாதீர்கள்” என்று (முதன்முதலில்) வசனம் அருளப்பட்டிருக்குமானால், நிச்சயம் அவர்கள், ‘‘நாங்கள் ஒருபோதும் விபசாரத்தைக் கைவிடமாட்டோம்” என்று கூறியிருப்பார்கள். (ஆகவேதான் அல்லாஹ், படிப்படியாகச் சட்ட விதிகளைக் கூறும் வசனங்களை அருளினான்.) நான் விளையாடும் சிறுமியாக இருந்தபோதுதான் மக்காவில் முஹம்மத் (ஸல்) அவர்களுக்கு, ‘‘(இவர்களின் கணக்கைத் தீர்ப்பதற்காக உண்மையில்) வாக்களிக்கப்பட்ட நேரம் மறுமை நாளாகும். மேலும், அந்த நேரம் மிகவும் அதிர்ச்சியளிக்கக்கூடியதும் கசப்பானதும் ஆகும்” எனும் (54:46ஆவது) வசனம் அருளப்பெற்றது. (சட்டங்கள் சம்பந்தமான வசனங்கள் இடம்பெற்றுள்ள) அல்பகரா (2ஆவது) அத்தியாயமும், அந்நிசா (4ஆவது) அத்தியாயமும் நான் (மதீனாவில்) நபி (ஸல்) அவர்களுடன் (அவர்களுடைய மனைவியாக) இருந்தபோதுதான் அருளப்பெற்றன என்று கூறிவிட்டு, ஆயிஷா (ரலி) அவர்கள் தம்மிடமிருந்த அந்த குர்ஆன் பிரதியை (இராக் நாட்டவரான) அந்த மனிதருக்காகக் கொண்டுவந்து அவருக்காக ஒவ்வோர் அத்தியாயத்தின் வசனங்களையும் எழுதச் செய்தார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4994,
			"arabicnumber": 4994,
			"text": "அப்துர்ரஹ்மான் பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: இப்னு மஸ்ஊத் (ரலி) அவர்கள் பனூ இஸ்ராயீல், அல்கஹ்ஃப், மர்யம் (ஆகிய 17, 18, 19ஆம்) அத்தியாயங்கள் குறித்துக் கூறுகையில், ‘‘இவை அதிசயமான முதல்தர அத்தியாயங்களில் உள்ளவையாகும். மேலும், இவை நான் மனனம் செய்த பழைய தொடக்கக் கால அத்தியாயங்களில் அடங்கும்” என்று குறிப்பிட்டார்கள்.21 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4995,
			"arabicnumber": 4995,
			"text": "பராஉ (ரலி) அவர்கள் கூறியதாவது: நான், ‘சப்பிஹிஸ்ம ரப்பிக்கல் அஃலா’ எனும் (87ஆவது) அத்தியாயத்தை நபி (ஸல்) அவர்கள் (மதீனாவிற்கு) வருவதற்கு முன்பே கற்றுக்கொண்டேன்.22 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4996,
			"arabicnumber": 4996,
			"text": "அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: ‘‘நபி (ஸல்) அவர்கள் தமது தொழுகையில் ஒவ்வொரு ரக்அத்திலும் இரண்டிரண்டாக ஓதிவந்த சரிநிகர் அத்தியாயங்களை நான் கற்றுள்ளேன்” என அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறினார்கள். (இதைக் கூறிய) பிறகு, அப்துல்லாஹ் (ரலி) அவர்கள் எழுந்து (தமது இல்லத்தினுள்) சென்றார்கள். அவர்களுடன் அல்கமா பின் கைஸ் அந்நகஈ (ரஹ்) அவர்களும் உள்ளே சென்றார்கள். (சிறிது நேரம் கழித்து) அல்கமா (ரஹ்) அவர்கள் வெளியே வந்தார்கள். நாங்கள் அவர்களிடம் அது குறித்துக் கேட்டோம். அதற்கு அவர்கள், ‘‘அவை, இப்னு மஸ்ஊத் (ரலி) அவர்கள் (தொகுத்துவைத்துள்ள) குர்ஆன் பிரதியின்படி ஆரம்ப இருபது ‘முஃபஸ்ஸல்’ அத்தியாயங்களாகும். அவற்றின் கடைசி அத்தியாயங்கள் ‘ஹாமீம்’ அத்தியாயங்களாகும். ‘ஹாமீம் அத்துகான்’ மற்றும் ‘அம்ம யத்தசாஅலூன’ ஆகியனவும் அவற்றில் அடங்கும்” என்று சொன்னார்கள்.23 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4997,
			"arabicnumber": 4997,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மக்களிலேயே நல்லவற்றை அதிகமாக வாரி வழங்குபவர் களாகத் திகழ்ந்தார்கள். அவர்கள் ரமளான் மாதத்தில் இன்னும் அதிகமாக வாரி வழங்குவார்கள். ஏனென்றால், (வானவர்) ஜிப்ரீல் ரமளானின் ஒவ்வோர் இரவும் -ரமளான் முடியும்வரை- நபி (ஸல்) அவர்களைச் சந்திப்பது வழக்கம். (அப்போது) அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குர்ஆனை ஓதிக் காட்டுவார்கள். (அவ்வாறு) ஜிப்ரீல் தம்மைச் சந்திக்கும்போது தொடர்ந்து வீசும் (மழைக்) காற்றைவிட அதிகமாக நபி (ஸல்) அவர்கள் நல்லவற்றை வாரி வழங்குவார்கள்.25 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4998,
			"arabicnumber": 4998,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒவ்வோர் ஆண்டுக்கும் ஒருமுறை (வானவர் ஜிப்ரீல் (அலை) அதுவரை அருளப்பெற்ற) குர்ஆன் வசனங்களை நபி (ஸல்) அவர்களுக்கு (மொத்தமாக) ஓதிக்காட்டுவது வழக்கம். நபி (ஸல்) அவர்கள் இறந்துபோன ஆண்டில் இரண்டு முறை அவர்களுக்கு (ஜிப்ரீல்) ஓதிக்காட்டினார்கள். நபி (ஸல்) அவர்கள் ஒவ்வோர் ஆண்டும் (ரமளான் மாதத்தின் இறுதிப்) பத்து நாட்கள் ‘இஃதிகாஃப்’ மேற்கொள்வது வழக்கம். அவர்கள் இறந்த ஆண்டு, (ரமளானில்) இருபது நாட்கள் ‘இஃதிகாஃப்’ மேற்கொண்டார்கள்.26 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4999,
			"arabicnumber": 4999,
			"text": "மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் குறித்து அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறுகையில், ‘‘நான் என்றென்றும் அவர்களை நேசிப்பேன்; (ஏனெனில்,) நபி (ஸல்) அவர்கள், அப்துல்லாஹ் பின் மஸ்ஊத், சாலிம், முஆத் பின் ஜபல், உபை பின் கஅப் ஆகிய நால்வரிடமிருந்தும் குர்ஆனை (ஓதக்) கற்றுக்கொள்ளுங்கள் என்று கூறக் கேட்டுள்ளேன்” என்றார்கள்.28 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5000,
			"arabicnumber": 5000,
			"text": "ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: எங்களிடையே அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் உரையாற்றி னார்கள். அப்போது, ‘‘அல்லாஹ்வின் மீதாணையாக! நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் வாயிலிருந்து எழுபதுக்கும் மேற்பட்ட அத்தியாயங்களைக் கேட்டறிந்துள்ளேன். அல்லாஹ்வின் மீதாணையாக, தங்களிலேயே அல்லாஹ்வின் வேதமான குர்ஆனை நன்கறிந்தவன் நானே என்பதை நபித்தோழர்கள் நன்கறிவார்கள். (அதற்காக எல்லா வகையிலும்) நான் அவர்களில் சிறந்தவன் அல்லன்” என்று குறிப்பிட்டார்கள். (இது குறித்து) மற்றவர்கள் என்ன கூறுகிறார்கள் என்பதைச் செவியுற்றவாறே அந்த அவையில் நான் அமர்ந்திருந்தேன். இப்னு மஸ்ஊத் (ரலி) அவர்கள் சொன்னதை மறுத்து வேறு விதமாகப் பேசியதை யாரிடமிருந்தும் நான் கேட்கவில்லை. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5001,
			"arabicnumber": 5001,
			"text": "அல்கமா பின் கைஸ் அந்நகஈ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் (சிரியா நாட்டின் பிரபல நகரமான) ஹிம்ஸில் இருந்துகொண்டிருந் தோம். (ஒரு சமயம்) இப்னு மஸ்ஊத் (ரலி) அவர்கள் ‘யூசுஃப்’ எனும் (12ஆவது) அத்தியாயத்தை ஓதினார்கள். அப்போது ஒரு மனிதர் (அதை ஆட்சேபிக்கும் விதமாக), ‘‘இவ்வாறு இந்த அத்தியாயம் அருளப்பெறவில்லை” என்று கூறினார். இப்னு மஸ்உத் (ரலி) அவர்கள், ‘‘(இவ்வாறு தான்) நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முன்னிலையில் ஓதினேன். அவர்களும், ‘மிகச் சரியாக ஓதினாய்’ என்று கூறினார்கள்” என்று பதிலளித்தார்கள். அப்போது (ஆட்சேபிக்க வந்த) அந்த மனிதரின் வாயிலிருந்து மதுவின் வாடை வருவதைக் கண்டார்கள். ‘‘மதுவையும் அருந்திக்கொண்டு அல்லாஹ்வின் வேதத்தை மறுக்கவும் முனைகிறாயா?” என்று இப்னு மஸ்ஊத் (ரலி) அவர்கள் கூறிவிட்டு, அந்த மனிதருக்கு (மது அருந்திய குற்றத்திற்கான) தண்டனையை நிறைவேற்றும்படி செய்தார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5002,
			"arabicnumber": 5002,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: யாரைத் தவிர வேறு இறைவன் இல்லையோ அத்தகைய அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் வேதத்தில் ஓர் அத்தியாயம் அருளப்பட்டால், அது எங்கே அருளப்பட்டது என்பதை நான் நன்கு அறிவேன். அல்லாஹ்வின் வேதத்தில் ஒரு வசனம் அருளப்பெற்றால் அது யார் விஷயத்தில் அருளப்பெற்றது என்பதையும் நான் நன்கறிவேன். என்னைவிட அல்லாஹ்வின் வேதத்தை நன்கு அறிந்தவர்கள், ஒட்டகம் சென்றடையும் தூரத்தில் இருந்தால் நான் (அவரிடமிருந்து அதைக் கற்றுக்கொள்வதற்காக) அவரை நோக்கி நிச்சயம் பயணம் புறப்பட்டு விடுவேன். இதை மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5003,
			"arabicnumber": 5003,
			"text": "கத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம், ‘‘நபி (ஸல்) அவர்களின் காலத்தில் குர்ஆனை (மனனம் செய்து) திரட்டியவர்கள் யார்?” என்று கேட்டேன். அவர்கள், ‘‘நால்வர்: 1. உபை பின் கஅப் (ரலி) அவர்கள். 2. முஆத் பின் ஜபல் (ரலி) அவர்கள். 3. ஸைத் பின் ஸாபித் (ரலி) அவர்கள். 4. அபூஸைத் (ரலி) அவர்கள்; அவர்கள் அனைவருமே அன்சாரிகளாவர்” என்று கூறினார்கள்.29 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5004,
			"arabicnumber": 5004,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: இந்த நால்வரைத் தவிர வேறு எவரும் (குர்ஆனைக் கேட்டுத்) திரட்டியிராத நிலையில் நபி (ஸல்) அவர்கள் இறந் தார்கள். (அந்த நால்வர்:) 1. அபுத்தர்தா. 2. முஆத் பின் ஜபல். 3. ஸைத் பின் ஸாபித். 4. அபூஸைத் (ரலி) ஆகியோர் ஆவர். நாங்களே (என் தந்தையின் சகோதரர்களில் ஒருவரான) அபூஸைத் (ரலி) அவர்களுக்கு வாரிசானோம். (அன்னாருக்கு வேறு வாரிசுகள் இல்லை.) இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5005,
			"arabicnumber": 5005,
			"text": "உமர் (ரலி) அவர்கள் கூறியதாவது: எங்களில் (குர்ஆனை) நன்கு ஓதத் தெரிந்தவர் உபை பின் கஅப் (ரலி) ஆவார். நாங்கள் உபை (ரலி) அவர்களின் சொற்களில் சிலவற்றை விட்டுவிடுவோம். ஏனெனில் அவர்கள், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து நான் செவிமடுத்த எதையும் கைவிடமாட்டேன்” என்று சொல்வார். ஆனால், அல்லாஹ்வோ, ‘‘எந்த ஒரு வசனத்தையாவது நாம் மாற்றிவிட்டால், அல்லது அகற்றிவிட்டால் (அதற்குப் பதிலாக) அதனினும் சிறந்த, அல்லது அது போன்ற வேறு வசனத்தை நாம் கொண்டுவருகிறோம்” என்று கூறியுள்ளான். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.30 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5006,
			"arabicnumber": 5006,
			"text": "அபூசயீத் பின் முஅல்லா (ரலி) அவர்கள் கூறியதாவது: நான் (பள்ளிவாசலில்) தொழுது கொண்டிருந்தபோது என்னை நபி (ஸல்) அவர்கள் அழைத்தார்கள். (தொழுகையில் இருந்தமையால்) நான் அவர்களுக்கு உடனடியாகப் பதிலளிக்கவில்லை. (தொழுது முடித்தபிறகு), ‘‘அல்லாஹ்வின் தூதரே! நான் தொழுதுகொண்டிருந்தேன். (அதனால்தான் உடனடியாகத் தங்களுக்கு நான் பதிலளிக்கவில்லை)” என்று சொன்னேன். நபி (ஸல்) அவர்கள், ‘‘அல்லாஹ், ‘(இறைநம்பிக்கையாளர்களே!) அல்லாஹ்வுக்கும் உங்களை அழைக்கும்போது இத்தூதருக்கும் பதிலளியுங்கள்’ என்று (8:24ஆவது வசனத்தில்) சொல்லவில்லையா?” என்று கேட்டார்கள். பிறகு, ‘‘நீங்கள் பள்ளிவாசலிலிருந்து வெளியேறுவதற்கு முன்பாக குர்ஆனிலேயே மகத்துவமிக்க ஓர் அத்தியாயத்தை உங்களுக்கு நான் கற்றுத்தர வேண்டாமா?” என்று வினவியபடி எனது கையைப் பிடித்தார்கள். நாங்கள் (பள்ளிவாசலிலிருந்து) வெளியேற முற்பட்டபோது நான் (அவர்கள் வாக்களித்ததை நினைவூட்டி) ‘‘அல்லாஹ்வின் தூதரே! தாங்கள் குர்ஆனிலேயே மகத்துவம் பொருந்தியதோர் அத்தியாயத்தை நான் உங்களுக்குக் கற்றுத்தர வேண்டாமா என்று கேட்டீர்களே!” என்று வினவினேன். நபி (ஸல்) அவர்கள், ‘‘(அது) அல்ஹம்து லில்லாஹி ரப்பில் ஆலமீன் (என்று தொடங்கும் ‘அல்ஃபாத்திஹா’ அத்தியாயமே) ஆகும். அது திரும்பத் திரும்ப ஓதப்படும் ஏழு வசனங்களும் எனக்கு வழங்கப்பெற்றுள்ள மேன்மைமிகு குர்ஆனும் ஆகும்” என்று சொன்னார்கள்.31 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5007,
			"arabicnumber": 5007,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் ஒரு பயணத்தில் சென்று கொண்டிருந்தபோது, (ஓய்வெடுப்பதற்காக) ஓரிடத்தில் இறங்கித் தங்கினோம். அப்போது ஓர் இளம் பெண் வந்து ‘‘எங்கள் கூட்டத் தலைவரை தேள் கொட்டிவிட்டது. எங்கள் ஆட்கள் வெளியே சென்றுள்ளார்கள். அவருக்கு ஓதிப்பார்ப்பவர் உங்களில் எவரேனும் உண்டா?” என்று கேட்டாள். அவளுடன் எங்களில் ஒரு மனிதர் சென்றார். அவருக்கு ஓதிப்பார்க்கத் தெரியும் என்று நாங்கள் நினைத்ததுகூட இல்லை. அவர் சென்று ஓதிப்பார்த்தார். உடனே அந்தத் தலைவர் குணமடைந்துவிட்டார். ஆகவே, எங்களுக்கு முப்பது ஆடுகள் (அன்பளிப்பாக) வழங்குமாறு அவர்களுடைய தலைவர் உத்தரவிட்டதுடன் எங்களுக்குப் பாலும் கொடுத்தனுப்பினார். (ஓதிப்பார்க்கச் சென்ற) அந்த மனிதர் திரும்பி வந்தபோது, அவரிடம், ‘உமக்கு நன்றாக ஓதிப்பார்க்கத் தெரியுமா?’. அல்லது ‘ஏற்கனவே, நீர் ஓதிப்பார்ப்பவராக இருந்தீரா?’ என்று கேட்டோம். அவர், ‘‘இல்லை; ‘குர்ஆனின் அன்னை’ என்றழைக்கப்படும் (‘அல் ஃபாத்திஹா’) அத்தியாயத்தைத்தான் ஓதிப்பார்த்தேன்” என்று சொன்னார். (இந்த முப்பது ஆடுகளையும்) நாம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ‘செல்லும்வரையில்’ அல்லது ‘சென்று (விளக்கம்) கேட்கும்வரையில்’ ஒன்றும் செய்துவிடாதீர்கள்” என்று (எங்களுக் கிடையே) பேசிக்கொண்டோம். நாங்கள் மதீனா வந்து சேர்ந்தபோது, இது குறித்து நபி (ஸல்) அவர்களிடம் கூறினோம். ‘‘இது (‘அல்ஃபாத்திஹா’ அத்தியாயம்) ஓதிப்பார்த்து நிவாரணம் பெறத்தக்கது என்பது அவருக்கு எப்படித் தெரியும்? அந்த ஆடுகளைப் பங்கிட்டு அதில் ஒரு பங்கை எனக்கும் தாருங்கள்!” என்று சொன்னார்கள்.32 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5008,
			"arabicnumber": 5008,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யார் இரண்டு வசனங்களை ஓதினார்களோ...33 இதை அபூமஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5009,
			"arabicnumber": 5009,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யார் ‘அல்பகரா’ எனும் (2ஆவது) அத்தியாயத்தின் இறுதி இரு வசனங்களை (285, 286) இரவில் ஓதுகிறாரோ அவருக்கு அந்த இரண்டுமே போதும்!34 இதை அபூமஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5010,
			"arabicnumber": 5010,
			"text": "முஹம்மத் பின் சீரீன் (ரஹ்) அவர்கள் கூறியதாவது: அபூஹுரைரா (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ரமளானின் (ஃபித்ரா) ஸகாத்தைப் பாதுகாக்கும் பொறுப்பை என்னிடம் ஒப்படைத்தார்கள். அப்போது யாரோ ஒருவன் என்னிடம் வந்து அந்த (ஸகாத்) உணவுப் பொருளை அள்ளலானான்.உடனே அவனை நான் பிடித்து, ‘உன்னை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுசெல்லப் போகிறேன்’ என்று சொன்னேன்” என்று கூறிவிட்டு, -அந்த நிகழ்ச்சியை முழுமையாகக் குறிப்பிட்டார்கள்.- (இறுதியில், திருட வந்த) அவன், ‘‘நீங்கள் படுக்கைக்குச் செல்லும்போது ‘ஆயத்துல் குர்சீ’யை ஓதுங்கள்! (அவ்வாறு செய்தால்,) விடியும்வரை அல்லாஹ்வின் தரப்பிலிருந்து (உங்களைப் பாதுகாக்கின்ற) காவலர் (வானவர்) ஒருவர் இருந்துகொண்டேயிருப்பார்; எந்த ஷைத்தானும் உங்களை நெருங்கமாட்டான்” என்று கூறினான். (இதை நான் நபி (ஸல்) அவர்களிடம் தெரிவித்தேன்). அப்போது நபியவர்கள், ‘‘அவன் பெரும் பொய்யனாயிருப்பினும் அவன் உம்மிடம் உண்மையைத்தான் சொல்லியிருக்கின்றான்; (உம்மிடம் வந்த) அவன்தான் ஷைத்தான்” என்று கூறியதாகவும் சொன்னார்கள்.35 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5011,
			"arabicnumber": 5011,
			"text": "பராஉ (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் ‘அல்கஹ்ஃப்’ எனும் (18ஆவது) அத்தியாயத்தை (தமது இல்லத்தில் அமர்ந்து) ஓதிக்கொண்டிருந்தார். அவருக்கு அருகில் இரு கயிறுகளால் குதிரையொன்று கட்டப்பட்டிருந்தது. அதை ஒரு மேகம் சூழ்ந்துகொண்டு, குதிரையை மெல்ல மெல்ல நெருங்கலாயிற்று. மேலும், அவரது குதிரை மிரளத் தொடங்கியது. விடிந்தவுடன் அவர் நபி (ஸல்) அவர்களிடம் சென்று நடந்ததைத் தெரிவித்தார். அப்போது நபி (ஸல்) அவர்கள், ‘‘குர்ஆன் ஓதிய காரணத்தால் இறங்கிய அமைதிதான் அது” என்று சொன்னார்கள்.36 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5012,
			"arabicnumber": 5012,
			"text": "அஸ்லம் (ரஹ்) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓர் இரவில் பயணம் மேற்கொண்டு இருந்தார்கள். உமர் பின் அல்கத்தாப் (ரலி) அவர்களும் நபியவர்களுடன் சென்றுகொண்டிருந்தார்கள். அப்போது உமர் (ரலி) அவர்கள் ஏதோ ஒன்றைக் குறித்து நபி (ஸல்) அவர்களிடம் கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பதில் சொல்லவில்லை. பிறகு (மீண்டும்) உமர் (ரலி) அவர்கள் கேட்டார்கள். அப்போதும் அவர்களுக்கு நபியவர்கள் பதில் சொல்லவில்லை. பிறகு (மூன்றாம் முறையாக) உமர் (ரலி) அவர்கள் கேட்டார்கள். அப்போதும் அவர்களுக்கு நபியவர்கள் பதில் சொல்லவில்லை. பின்னர், (தம்மைத் தாமே கடிந்த வண்ணம்) ‘‘உமரே! உன்னை உன் தாய் இழக்கட்டும்! மூன்று முறை (கேள்வி கேட்டு) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை வற்புறுத்தினாய். அந்த ஒவ்வொரு முறையும் அவர்கள் உனக்குப் பதில் சொல்லவில்லையே” என்று உமர் (ரலி) அவர்கள் கூறினார்கள். மேலும், உமர் (ரலி) அவர்கள் கூறினார்கள்: அதற்குப் பிறகு நான் எனது ஒட்டகத்தைச் செலுத்தி மக்களுக்கு முன்னால் வந்து சேர்ந்தேன். (அல்லாஹ்வின் தூதரிடம் இப்படி நான் நடந்துகொண்டதற்காக) என் விஷயத்தில் ஏதாவது குர்ஆன் (வசனம்) அருளப்பெற்றுவிடுமோ என நான் அஞ்சினேன். சற்று நேரத்திற்குள் யாரோ ஒருவர் என்னை அழைப்பதைக் கேட்டேன். (நான் நினைத்தபடி) என் விஷயத்தில் குர்ஆன் (வசனம்) ஏதும் அருளப்பெற்றிருக்கும் என அஞ்சினேன் என்று கூறியபடி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, அவர்களுக்கு சலாம் சொன்னேன். அப்போது அவர்கள், ‘‘இந்த இரவு எனக்கு ஒரு (குர்ஆன்) அத்தியாயம் அருளப்பெற்றுள்ளது. சூரியன் எதன்மீது உதிக்கிறதோ அ(ந்த உலகத்)தைவிட எனக்கு அந்த அத்தியாயம் மிகவும் விருப்பமானதாகும்” என்று கூறினார்கள். பிறகு, ‘‘உமக்கு நாம் பகிரங்கமானதொரு வெற்றியை அளித்துள்ளோம்” என்று (தொடங்கும் 48:1ஆவது வசனத்தை) ஓதினார்கள்.37 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5013,
			"arabicnumber": 5013,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் ‘குல் ஹுவல்லாஹு அஹத்’ எனும் (112ஆவது) அத்தியாயத்தைத் திரும்பத் திரும்ப ஓதிக்கொண்டிருந்ததை மற்றொரு மனிதர் செவியுற்றார்.39 (இதைக் கேட்ட) அந்த மனிதர் விடிந்ததும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து அதைப் பற்றிக் கூறினார். அந்தச் சிறிய அத்தியாயத்தை(த் திரும்பத் திரும்ப அவர் ஓதியதை) இவர் சாதாரணமாக மதிப்பிட்டதைப் போல் தெரிந்தது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘என் உயிர் எவன் கையிலுள்ளதோ அ(ந்த இறை)வன்மீது சத்தியமாக! அந்த அத்தியாயம் குர்ஆனின் மூன்றில் ஒரு பங்கிற்கு ஈடானதாகும்” என்று சொன்னார்கள்.40 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5014,
			"arabicnumber": 5014,
			"text": "கத்தாதா பின் நுஅமான் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களின் காலத்தில் ஒரு மனிதர் (அதிகாலைக்கு முன்னுள்ள) ‘சஹர்’ நேரத்தில் எழுந்து, ‘குல்ஹு வல்லாஹு அஹத்’ எனும் (112ஆவது) அத்தியாயத்தை மட்டுமே ஓதி (தொழுது)வந்தார். அதைவிட அதிகமாக (வேறு எதையும்) அவர் ஓதுவதில்லை. காலையான போது இன்னொரு மனிதர் நபி (ஸல்) அவர்களிடம் வந்து மேற்கண்ட (5013) ஹதீஸில் உள்ளபடி கூறினார். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5015,
			"arabicnumber": 5015,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தம் தோழர்களை நோக்கி, ‘‘ஓர் இரவில் குர்ஆனின் மூன்றில் ஒரு பகுதியை உங்களில் ஒருவரால் ஓத முடியாதா?” என்று கேட்டார்கள். அதைச் சிரமமாகக் கருதிய நபித்தோழர்கள், ‘‘எங்களில் யாருக்கு இந்தச் சக்தி உண்டு, அல்லாஹ்வின் தூதரே!” என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள்,’அல்லாஹ் ஒருவனே; அல்லாஹ் தேவையற்றவன்’ (என்று தொடங்கும் 112ஆவது அத்தியாயம்) குர்ஆனின் மூன்றிலொரு பகுதியாகும் என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்கள் வழியாக வரும் அறிவிப்பாளர்தொடர் (முர்சல்) - முறிவுற்றதாகும். ளஹ்ஹாக் அல்மஷ்ரிகீ (ரஹ்) அவர்கள் வழியாக வந்துள்ள மற்றொரு தொடரே முழுமை பெற்றதாகும் (முஸ்னத்) என அபூஅப்தில்லாஹ் (புகாரீ) கூறுகிறேன். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5016,
			"arabicnumber": 5016,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நோய்வாய்ப்பட்டால், ‘அல்முஅவ்விஃதாத்’ (பாதுகாப்புக் கோரும் கடைசி மூன்று) அத்தியாயங்களை ஓதித் தம்மீது ஊதிக்கொள்வார்கள். அவர்களது (இறப்புக்குமுன்) நோய் கடுமையானபோது, நான் அவற்றை ஓதி அவர்களின் (கையில் ஊதி அந்தக்) கையாலேயே (அவர்களின் உடல்மீது) தடவிக்கொண்டிருந்தேன். நபியவர்களின் கரத்திற்குள்ள வளத்தை (பரக்கத்தை) நாடியே அவ்வாறு செய்தேன்.42 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5017,
			"arabicnumber": 5017,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது நபி (ஸல்) அவர்கள் தமது படுக்கைக்கு (உறங்கச்) சென்றால் ஒவ்வோர் இரவிலும் தமது உள்ளங்கைகளை இணைத்து அதில், ‘குல் ஹுவல்லாஹு அஹத்’, ‘குல் அஊது பிரப்பில் ஃபலக்’, ‘குல் அஊது பிரப்பிந் நாஸ்’ ஆகிய (112, 113, 114) அத்தியாயங்களை ஓதி ஊதிக்கொள்வார்கள். பிறகு தம் இரு கைகளால் (அவை எட்டும் அளவுக்கு) தமது உடலில் இயன்ற வரையில் தடவிக்கொள்வார்கள். முதலில் தலையில் ஆரம்பித்து, பிறகு முகம், பிறகு தம் உடலின் முற்பகுதியில் கைகளால் தடவிக்கொள்வார்கள். இவ்வாறு மூன்று முறை செய்வார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5018,
			"arabicnumber": 5018,
			"text": "உசைத் பின் ஹுளைர் (ரலி) அவர்கள் கூறியதாவது: நான் இரவு நேரத்தில் (என் வீட்டில்) ‘அல்பகரா’ எனும் (2ஆவது) அத்தியாயத்தை ஓதிக்கொண்டிருந்தேன். எனது குதிரை எனக்குப் பக்கத்தில் கட்டப்பட்டிருந்தது. திடீரென அந்தக் குதிரை மிகக் கடுமையாக மிரண்டது. உடனே நான் ஓதுவதை நிறுத்திக்கொண்டேன். குதிரை அமைதியாகிவிட்டது. பிறகு ஓதினேன். அப்போது குதிரை (முன்பு போலவே) மிரண்டது. நான் ஓதுவதை நிறுத்தினேன்.குதிரையும் அமைதியானது. மீண்டும் நான் ஓதியபோது குதிரை மிரண்டது. நான் திரும்பிப் பார்த்தேன் அப்போது என் மகன் யஹ்யா குதிரைக்குப் பக்கத்தில் இருந்தான். அவனை அது (மிதித்துக்) காயப்படுத்திவிடுமோ என்று அஞ்சினேன். எனவே, அவனை (அந்த இடத்திலிருந்து) இழுத்துவிட்டு வானை நோக்கித் தலையைத் தூக்கினேன். அங்கு (விளக்குகள் நிறைந்த மேகம் போன்றதொரு பொருள் வானில் மறைந்தது. அதனால்) அதைக் காண முடியவில்லை. காலை நேரமானபோது நான் நபி (ஸல்) அவர்களிடம் நடந்ததைத் தெரிவித்தேன். அவர்கள் என்னிடம், ‘‘இப்னு ஹுளைரே! தொடர்ந்து ஓதியிருக்கலாமே! இப்னு ஹுளைரே! தொடர்ந்து ஓதியிருக்கலாமே (ஏன் ஓதுவதை நிறுத்தினீர்கள்?)” என்று கேட்டார்கள். நான், என் மகன் யஹ்யாவைக் குதிரை மிதித்துவிடுமோ என்று அஞ்சினேன், அல்லாஹ்வின் தூதரே! அவன் அதன் அருகில் இருந்தான். ஆகவே, நான் தலையைத் தூக்கிப் பார்த்துவிட்டு அவன் அருகில் சென்றேன். பிறகு, நான் வானை நோக்கியபோது அங்கு மேகம் போன்றதொரு பொருளைக் கண்டேன். அதில் விளக்குகள் போன்ற (பிரகாசிக்கும்) பொருள்கள் இருந்தன. உடனே நான் வெளியே வந்(து பார்த்)தபோது அதைக் காணவில்லை” என்று சொன்னேன். நபி (ஸல்) அவர்கள், ‘‘அது என்ன வென்று நீ அறிவாயா?” என்று கேட்டார்கள். நான், ‘‘இல்லை (தெரியாது)” என்று சொன்னேன். நபி (ஸல்) அவர்கள், ‘‘உன் குரலைக் கேட்டு நெருங்கிவந்த வானவர்கள்தான் அவர்கள். நீ தொடர்ந்து ஓதிக்கொண்டிருந்திருந்தால் காலையில் மக்களும் அதைப் பார்த்திருப்பார்கள்; மக்களைவிட்டு அது மறைந்திருக்காது” என்று கூறினார்கள். இந்த ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் தமக்குக் கிடைத்துள்ளதாக அறிவிப்பாளர்களில் ஒருவரான இப்னுல் ஹாதி (ரஹ்) அவர்கள் கூறினார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5019,
			"arabicnumber": 5019,
			"text": "அப்துல் அஸீஸ் பின் ருஃபைஉ (ரஹ்) அவர்கள் கூறியதாவது: நானும் ஷத்தாத் பின் மஅகில் (ரஹ்) அவர்களும் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் சென்றோம். அப்போது இப்னு அப்பாஸ் (ரலி) அவர்களிடம் ஷத்தாத் (ரஹ்) அவர்கள், ‘‘நபி (ஸல்) அவர்கள் (உலகைப் பிரிந்தபோது, இந்த குர்ஆனில் இடம்பெறாத) வேறு (இறைவசனங்கள்) எதையும் (நம்மிடையே) விட்டுச்சென்றார் களா?” என்று கேட்டார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள், ‘‘(இந்த குர்ஆனின்) இரு அட்டை களுக்கிடையேயுள்ள வசனங்களைத்தான் (இறைவேதமாக) நபி (ஸல்) அவர்கள் விட்டுச்சென்றார்கள்” என்று பதிலளித் தார்கள். நாங்கள் (அலீ (ரலி) அவர்களுடைய புதல்வரான) முஹம்மத் பின் அல்ஹனஃபிய்யா (ரஹ்) அவர்களிடம் சென்று, இது குறித்துக் கேட்டோம். அதற்கு அவர்கள் (இப்னு அப்பாஸ் (ரலி) அவர்கள் பதிலளித்ததைப் போன்றே), ‘‘(இந்த குர்ஆனின்) இரு அட்டைகளுக்கிடையேயுள்ள வசனங்களைத்தான் (இறைவேதமாக) நபி (ஸல்) அவர்கள் விட்டுச்சென்றார்கள்” என்று பதிலளித்தார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5020,
			"arabicnumber": 5020,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனை ஓதுகின்ற (நல்ல)வரின் நிலையானது நாரத்தைப் பழம் போன்றதாகும். அதன் சுவையும் நன்று; வாசனையும் நன்று. (மற்ற நற்செயல்கள் புரிந்துகொண்டு) குர்ஆன் ஓதாமலிருப்பவர், பேரீச்சம் பழத்தைப் போன்றவராவார். அதன் சுவை நன்று; (ஆனால்) அதற்கு வாசனை கிடையாது. தீயவராக (நயவஞ்சகராக)வும் இருந்துகொண்டு, குர்ஆனையும் ஓதிவருகின்றவனின் நிலையானது, துளசிச் செடியின் நிலையை ஒத்திருக்கின்றது. அதன் வாசனை நன்று; சுவையோ கசப்பு. தீமையும் செய்துகொண்டு, குர்ஆனையும் ஓதாமóருப்பவரின் நிலையானது, குமட்டிக்காயின் நிலையை ஒத்திருக்கிறது. அதன் சுவையும் கசப்பு; அதற்கு வாசனையும் கிடையாது. இதை அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5021,
			"arabicnumber": 5021,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (உங்களுக்கு)முன் சென்ற சமு தாயங்களின் ஆயுட்காலத்துடன் ஒப்பிடுகையில் உங்கள் ஆயுட்காலம், அஸ்ர் தொழுகைக்கும் சூரியன் மறைவதற்கும் இடையேயுள்ள (குறைந்த) கால அளவேயாகும். உங்களது நிலையும் (வேதக்காரர்களான) யூதர்கள் மற்றும் கிறித்தவர்களின் நிலையும் தொழிலாளர்கள் சிலரை வேலைக்கு அமர்த்திய ஒரு மனிதரின் நிலை போன்றதாகும். அவர் (தொழிலாளர்களிடம்), ‘‘எனக்காக நண்பகல்வரை ஒவ்வொரு ‘கீராத்’ (ஊதியத்)திற்கு வேலை செய்பவர் யார்?” என்று கேட்டார். அப்போது யூதர்கள் (ஒவ்வொரு கீராத்திற்கு நண்பகல்வரை) வேலை செய்தனர். அடுத்து அந்த மனிதர், ‘‘நண்பகல் முதல் அஸ்ர்வரை (ஒவ்வொரு கீராத் ஊதியத்திற்கு) எனக்காக வேலை செய்பவர் யார்?” என்று கேட்க, (அவ்வாறே) கிறித்தவர்கள் வேலை செய்தார்கள். பிறகு (என் சமுதாயத்தாராகிய) நீங்கள் இரண்டு ‘கீராத்’ (ஊதியத்)திற்காக அஸ்ர் முதல் மஃக்ரிப் (நேரம்)வரை வேலை செய்கிறீர்கள். (இதைக் கண்ட வேதக்காரர்களாகிய) அவர்கள், ‘‘நாங்கள் அதிகமாக வேலை செய்திருக்க, ஊதியம் (மட்டும் எங்களுக்குக்) குறைவாகக் கிடைப்பதா?” என்று கேட்டனர். அதற்கு (இறைவன்,) ‘‘நான் (ஊதியமாக நிர்ணயித்த) உங்களது உரிமையில் (ஏதேனும் குறைத்து) உங்களுக்கு அநீதி இழைத்துவிட்டேனா?” என்று கேட்டான். அவர்கள், ‘‘இல்லை” என்றனர். அப்போது இறைவன், ‘‘அ(ப்படிச் சிலருக்கு மட்டும் சிறிது நேரப் பணிக்கு அதிகமாகக் கொடுப்ப)து என் (தனிப்பட்ட) அருளாகும். அதை நான் விரும்பியோருக்கு வழங்குகிறேன்” என்று சொன்னான்.44 இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5022,
			"arabicnumber": 5022,
			"text": "தல்ஹா பின் முஸர்ரிஃப் (ரஹ்) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் அபீஅவ்ஃபா (ரலி) அவர்களிடம், ‘‘நபி (ஸல்) அவர்கள் இறுதி விருப்பம் (வஸிய்யத்) தெரிவித்தார்களா?” என்று கேட்டேன். அன்னார் ‘இல்லை’ என்றார்கள். நான் ‘‘அப்படியானால் இறுதி விருப்பம் தெரிவிப்பது மக்கள்மீது எப்படிக் கடமையாக்கப்பட்டது? நபியவர்கள் இறுதி விருப்பம் தெரிவிக்காமலேயே மக்களுக்கு அந்தக் கட்டளை பிறப்பிக்கப்பட்டதா?” என்று வினவினேன். அன்னார், ‘‘இறைவேதத்தின்படி செயல்படுமாறு நபியவர்கள் அறிவுரை கூறினார்கள்” என்று பதிலளித்தார்கள்.45 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5023,
			"arabicnumber": 5023,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், தன் தூதர் (முழு ஈடுபாட்டுடன்) இனிய குரலில் குர்ஆனை ஓதும்போது அதைச் செவி கொடுத்துக் கேட்டதைப் போன்று வெறெதையும் அவன் செவி கொடுத்துக் கேட்டதில்லை. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) அபூசலமா (ரஹ்) அவர்களுடைய தோழர் ஒருவர் (அப்துல் ஹமீத் பின் அப்திர் ரஹ்மான்) கூறுகிறார்: குரலெடுத்து (இனிமையாக) குர்ஆனை ஓதுவதே இங்கு நோக்கமாகும். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5024,
			"arabicnumber": 5024,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், ‘‘நான் (முழு ஈடுபாட்டுடன்) இனிய குரலில் குர்ஆனை ஓதும்போது அல்லாஹ் செவி கொடுத்துக் கேட்டதைப் போன்று வேறெதையும் அவன் செவி கொடுத்துக் கேட்டதில்லை” என்று கூறினார்கள். ‘‘இந்த ஹதீஸின் மூலத்திலுள்ள, ‘யத ஃகன்னா’ என்பதற்கு ‘குர்ஆனைக் கொண்டு தன்னிறைவு பெற்றார்’ என்பது பொருள்” என சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறினார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5025,
			"arabicnumber": 5025,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். இரண்டு விஷயங்களைத் தவிர வேறெதற்காகவும் பொறாமை கொள்ளக் கூடாது. 1. ஒரு மனிதருக்கு அல்லாஹ் வேத ஞானத்தை வழங்கியுள்ளான். அதை அவர் இரவு நேரங்களிலும் ஓதி வழிபடுகிறார். 2. இன்னொரு மனிதருக்கு அல்லாஹ் செல்வத்தை அளித்துள்ளான். அவர் அதை இரவு, பகல் எல்லா நேரங்களிலும் தானம் செய்கிறார். (இவ்விருவரைப் பார்த்து நாமும் அப்படியாக வேண்டும் எனப் பொறாமை கொள்ளலாம்.)47 இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5026,
			"arabicnumber": 5026,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரண்டு விஷயங்களைத் தவிர வேறெதற்காகவும் பொறாமை கொள்ளக் கூடாது. 1. ஒரு மனிதருக்கு அல்லாஹ் குர்ஆனைக் கற்றுத்தந்தான். அவர் அதை இரவு, பகல் எல்லா நேரங்களிலும் ஓதிவருகிறார். இதைக் கேள்விப்பட்டு அவருடைய அண்டை வீட்டுக்காரர், ‘‘இன்னாருக்கு வழங்கப்பட்டதைப் போன்று எனக்கும் வழங்கப்பட்டிருந்தால் நானும் அவர் செயல்படுவது (ஓதுவது)போல் செயல் பட்டிருப்பேனே (ஓதியிருப்பேனே)!” என்று கூறுகின்றார். 2. இன்னொரு மனிதருக்கு அல்லாஹ் செல்வத்தை வழங்கினான். அவர் அதை அறவழியில் செலவிட்டுவருகிறார். (இதைக் காணும்) ஒரு மனிதர், ‘‘இன்னாருக்கு வழங்கப்பட்டதைப் போன்று எனக்கும் (செல்வம்) வழங்கப்பட்டிருக்குமானால் அவர் (தர்மம்) செய்ததுபோல் நானும் செய்திருப்பேனே” என்று கூறுகின்றார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5027,
			"arabicnumber": 5027,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனைத் தாமும் கற்றுப் பிறருக்கும் அதைக் கற்பித்தவரே உங்களில் சிறந்தவர். இதை உஸ்மான் (ரலி) அவர்களிட மிருந்து அபூஅப்திர் ரஹ்மான் வழியாக சஅத் பின் உபைதா (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். உஸ்மான் (ரலி) அவர்களின் ஆட்சிக் காலத்தில் அபூஅப்திர் ரஹ்மான் (ரஹ்) அவர்கள் (மக்களுக்கு) குர்ஆனைக் கற்றுக் கொடுத்துவந்தார்கள். ஹஜ்ஜாஜ் பின் யூசுஃப் (இராக்கின் ஆட்சியாளராக) ஆகும் வரையில் இது தொடர்ந்தது. அபூஅப்திர் ரஹ்மான் அவர்கள், ‘‘(குர்ஆனின் சிறப்பு குறித்துக் கூறப்பட்ட) இந்த நபிமொழியே என்னை (மக்களுக்குக் கற்றுத்தரும்) இந்த இடத்தில் அமரவைத்தது” என்று சொன்னார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5028,
			"arabicnumber": 5028,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனைத் தாமும் கற்றுப் பிறருக்கும் அதைக் கற்றுக்கொடுத்தவரே உங்களில் சிறந்தவர். இதை உஸ்மான் பின் அஃப்பான் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5029,
			"arabicnumber": 5029,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: ஒரு பெண்மணி நபி (ஸல்) அவர்களிடம் வந்து, அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் தம்மை (அர்ப்பணித்து) அன்பளிப்புச் செய்துவிட்டதாக (மஹ்ரின்றி தம்மை மணந்துகொள்ளுமாறு) கூறினார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘(இனி) எனக்கு எந்தப் பெண்ணும் தேவையில்லை” என்று சொன்னார்கள். அப்போது அங்கிருந்த ஒரு மனிதர், ‘‘இந்தப் பெண்ணை எனக்கு மணமுடித்துவையுங்கள்!” என்று கூறினார். நபி (ஸல்) அவர்கள், ‘‘ஏதேனும் ஆடையொன்றை அவளுக்கு (மணக் கொடையாக)க் கொடு!” என்று (அந்த மனிதரிடம்) சொன்னார்கள். அவர், ‘‘என்னிடம் இல்லை” என்று கூறினார். நபி (ஸல்) அவர்கள், ‘‘அவளுக்கு (எதையேனும் மணக்கொடையாகக்) கொடு! அது இரும்பாலான மோதிரமாக இருந்தாலும் சரியே” என்று சொன்னார்கள். இதைக் கேட்டு அந்த மனிதர் கலங்கி னார். எனவே, நபி (ஸல்) அவர்கள், ‘‘குர்ஆனிலிருந்து உன்னிடம் என்ன (அத்தியாயம் மனனமாக) இருக்கிறது?” என்று கேட்டார்கள். அவர் இன்ன இன்ன அத்தியாயங்கள் (எனக்கு மனப்பாடமாக) உள்ளன” என்று கூறினார். நபி (ஸல்) அவர்கள், ‘‘உம்முடன் இருக்கும் குர்ஆன் அத்தியாயங்களுக்காக இவளை உமக்கு மணமுடித்துவைத்தேன்” என்று சொன்னார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5030,
			"arabicnumber": 5030,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: ஒரு பெண்மணி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, ‘‘அல்லாஹ்வின் தூதரே! என்னைத் தங்களுக்கு அன்பளிப்பாக வழங்கிட (மஹ்ரின்றி என்னைத் தாங்கள் மணந்துகொள்ள) வந்துள்ளேன்” என்று சொன்னார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவரை நோக்கிப் பார்வையை உயர்த்தி நேராகப் பார்த்துவிட்டு பார்வையைத் தாழ்த்திக்கொண்டார்கள். பிறகு, தமது தலையைத் தொங்கவிட்டுக்கொண்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தமது விஷயத்தில் எந்த முடிவையும் செய்யவில்லை என்பதைக் கண்ட அந்தப் பெண் (அந்த இடத்திலேயே) அமர்ந்து கொண்டார். அப்போது நபித்தோழர்களில் ஒருவர் எழுந்து, ‘‘அல்லாஹ்வின் தூதரே! தங்களுக்கு அவர் தேவையில்லை யென்றால், அவரை எனக்கு மணமுடித்து வையுங்கள்!” என்று சொன்னார். நபி (ஸல்) அவர்கள், ‘‘(மணக்கொடை யாகச் செலுத்த) உம்மிடம் ஏதேனும் பொருள் உண்டா?” என்று கேட்டார்கள். அதற்கு அவர், ‘‘அல்லாஹ்வின் மீதாணையாக! என்னிடம் ஏதுமில்லை, அல்லாஹ்வின் தூதரே!” என்றார். நபி (ஸல்) அவர்கள், ‘‘உம்முடைய குடும்பத் தாரிடம் சென்று ஏதாவது கிடைக்குமா என்று பார்!” என்றார்கள். அவரும் போய் பார்த்துவிட்டுத் திரும்பி வந்து, ‘‘அல்லாஹ்வின் மீதாணையாக! ஏதும் கிடைக்கவில்லை அல்லாஹ்வின் தூதரே!” என்று சொன்னார். ‘‘இரும்பாலான ஒரு மோதிரமாவது கிடைக்குமா என்று பார்!” என நபி (ஸல்) அவர்கள் சொல்óயனுப்பி னார்கள். அவர் மீண்டும் சென்றுவிட்டுத் திரும்பிவந்து, ‘‘அல்லாஹ்வின் தூதரே! இரும்பாலான மோதிரம்கூடக் கிடைக்கவில்லை. ஆனால், இதோ இந்த எனது கீழங்கிதான் உள்ளது” என்று சொன்னார். -அறிவிப்பாளர் சஹ்ல் (ரலி) அவர்கள் கூறுகிறார்கள்: அவரிடம் ஒரு மேல்துண்டுகூட இல்லை. அதனால்தான் தனது கீழங்கியில் பாதியை அவளுக்குத் தருவதாகச் சொன்னார்.- அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘இந்தக் கீழங்கியை நீர் அணிந்து கொண்டால், அவள்மீது ஏதும் இருக்காது. அவள் அணிந்துகொண்டால், உம்மீது ஏதும் இருக்காது. (ஒரு கீழங்கியை வைத்துக்கொண்டு என்ன செய்வாய்?)” என்று கேட்டார்கள். பிறகு அந்த மனிதர் நீண்ட நேரம் அங்கேயே அமர்ந்துகொண்டார். பிறகு அவர் எழுந்தார். அவர் திரும்பிச் செல்வதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பார்த்தபோது அவரை அழைத்து வரும்படி உத்தரவிட்டார்கள். அவர் வரவழைக்கப்பட்டபோது, ‘‘உம்முடன் குர்ஆனில் என்ன (அத்தி யாயம் மனப்பாடமாக) உள்ளது?” என்று கேட்டார்கள். அவர், ‘‘இன்ன அத்தியாயம், இன்ன அத்தியாயம், இன்ன அத்தியாயம் என்னுடன் உள்ளன” என்று எண்ணி எண்ணிச் சொன்னார். நபி (ஸல்) அவர்கள், ‘‘அவற்றை நீர் மனப்பாடமாக ஓதுவீரா?” என்று கேட்டார்கள். அவர், ‘‘ஆம் (ஓதுவேன்)” என்று சொன்னார். நபி (ஸல்) அவர்கள், ‘‘உம்முடன் உள்ள குர்ஆன் அத்தியாயங்களுக்காக இப்பெண்ணை உமக்குத் திருமணம் முடித்துக்கொடுத்தேன். நீர் செல்லலாம்!” என்று சொன்னார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5031,
			"arabicnumber": 5031,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனை(ப் பார்த்தோ மனப்பாட மாகவோ) ஓதுகின்றவரின் நிலையெல்லாம், கயிற்றால் கட்டிவைக்கப்பட்டுள்ள ஓர் ஒட்டகத்தின் உரிமையாளரின் நிலையை ஒத்திருக்கிறது. அதை அவர் கண்காணித்துவந்தால் தம்மிடமே அதை அவர் தக்கவைத்துக்கொள்ளலாம். அதை அவிழ்த்துவிட்டுவிட்டாலோ அது ஓடிப்போய்விடும். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5032,
			"arabicnumber": 5032,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ‘‘இன்ன இன்ன குர்ஆன் வசனங்களை நான் மறந்துவிட்டேன்” என்று ஒருவர் கூறுவதுதான் அவரின் வார்த்தைகளிலேயே மிகவும் மோசமான வார்த்தையாகும். வேண்டுமானால், ‘மறக்க வைக்கப்பட்டுவிட்டது’ என்று அவர் கூறட்டும்! குர்ஆனைத் தொடர்ந்து (ஓதி) நினைவுபடுத்திவாருங்கள். ஏனெனில், ஒட்டகங்களைவிடவும் வேகமாக மனிதர் களின் நெஞ்சங்களிலிருந்து குர்ஆன் தப்பக்கூடியதாகும். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5033,
			"arabicnumber": 5033,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனை (ஓதி அதை)க் கவனித்து வாருங்கள். ஏனெனில், என் உயிர் எவன் கையிலுள்ளதோ அ(ந்த இறை)வன்மீது சத்தியமாக! கயிற்றில் கட்டி வைக்கப்பட்டுள்ள ஒட்டகத்தைவிட மிக வேகமாகக் குர்ஆன் (நினைவிலிருந்து) தப்பக்கூடியதாகும். இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5034,
			"arabicnumber": 5034,
			"text": "அப்துல்லாஹ் பின் முஃகஃப்பல் (ரலி) அவர்கள் கூறியதாவது: மக்கா வெற்றியின்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தமது ஊர்தி ஒட்டகத்தில் இருந்தபடி ‘அல்ஃபத்ஹ்’ எனும் (48ஆவது) அத்தியாயத்தை ஓதிக்கொண்டிருந்ததை நான் பார்த்தேன்.48 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5035,
			"arabicnumber": 5035,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நீங்கள் ‘அல்முஃபஸ்ஸல்’ என்று கூறிவரும் அத்தியாயங்களே ‘அல்முஹ்கம்’ ஆகும். இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறுகிறார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறக்கும்போது நான் பத்து வயதுடைய (சிறு)வனாக இருந்தேன். அப்போது நான் ‘அல்முஹ்கம்’ அத்தியாயங்களை ஓதிமுடித்திருந்தேன்.49 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5036,
			"arabicnumber": 5036,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: ‘‘நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வாழ்ந்த) காலத்திலேயே ‘அல்முஹ்கம்’ அத்தியாயங்களை மனனம் செய்திருந்தேன்” என்று இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறினார்கள். நான் அவர்களிடம், ‘‘ ‘அல்முஹ்கம்’ என்றால் என்ன?” என்று கேட்டேன். அவர்கள், ‘அல்முஃபஸ்ஸல்’தான் (‘அல்முஹ்கம்’) என்று (பதில்) சொன்னார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5037,
			"arabicnumber": 5037,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: பள்ளிவாசலில் ஒரு மனிதர் குர்ஆனை ஓதிக்கொண்டிருப்பதை நபி (ஸல்) அவர்கள் செவியுற்றார்கள். அப்போது அவர்கள், ‘‘அல்லாஹ் அவருக்குக் கருணை புரியட்டும்! இன்ன அத்தியாயத்தின் இன்ன இன்ன வசனங்களை எனக்கு அவர் நினைவூட்டி விட்டார்” என்று கூறினார்கள் ‘‘இன்ன அத்தியாயத்தில் நான் மறந் திருந்த இன்ன இன்ன வசனங்களை” என்று நபி (ஸல்) அவர்கள் கூறியதாகவும் ஹிஷாம் (ரஹ்) அவர்களின் அறிவிப்பில் காணப்படுகிறது.50 இந்த ஹதீஸ் நான்கு அறிவிப் பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5038,
			"arabicnumber": 5038,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் இரவு நேரத்தில் ஓர் அத்தியாயத்தை ஓதிக்கொண்டிருப்பதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கேட்டார்கள். அப்போது அவர்கள், ‘‘அல்லாஹ் அவருக்குக் கருணை புரியட்டும்! இன்ன இன்ன அத்தியாயங்களிலிருந்து எனக்கு மறக்கவைக்கப்பட்டிருந்த இன்ன இன்ன வசனங்களை அவர் எனக்கு நினைவூட்டிவிட்டார்” என்று சொன்னார்கள் அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5039,
			"arabicnumber": 5039,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இன்ன இன்ன குர்ஆன் வசனங் களை நான் மறந்துவிட்டேன் என்று ஒருவர் கூறுவதுதான் அவரின் வார்த்தைகளிலேயே மிகவும் மோசமான வார்த்தையாகும். உண்மையில், அவர் மறக்கவைக்கப்பட்டுவிட்டார். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.51 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5040,
			"arabicnumber": 5040,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ‘அல்பகரா’ எனும் (2ஆவது) அத்தியாயத்தின் இறுதி இரு வசனங்களை (285, 286) யார் இரவில் ஓதுகிறாரோ அவருக்கு அந்த இரண்டுமே போதும்! இதை அபூமஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.53 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5041,
			"arabicnumber": 5041,
			"text": "உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது வாழ்நாளில் ஹிஷாம் பின் ஹகீம் (ரலி) அவர்கள் ‘அல்ஃபுர்கான்’ எனும் (25ஆவது) அத்தியாயத்தை (தொழுகையில்) ஓதுவதை நான் செவியுற்றேன். அவரது ஓதலை நான் செவிதாழ்த்திக் கேட்டபோது எனக்குஅல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓதிக் காண்பிக்காத பல (வட்டார) மொழி வழக்குகளில் அவர் அதை ஓதிக் கொண்டிருந்தார். தொழுகையில் வைத்தே அவரை நான் தண்டிக்க முனைந்தேன். (சற்று நிதானித்து) அவர் (தொழுகையை முடித்து) சலாம் கொடுக்கும்வரை எதிர்பார்த்துக்கொண்டிருந்தேன். (அவர் தொழுகையை முடித்ததும் அவரது மேல்துண்டை) அவரது கழுத்தில் போட்டுப் பிடித்து, ‘‘இந்த அத்தியாயத்தை நான் (உம்மிடமிருந்து) செவியுற்றபடி உமக்கு ஓதிக்கொடுத்தது யார்?” என்று கேட்டேன். அவர், ‘‘இதை எனக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்தான் ஓதிக்கொடுத்தார்கள்” என்று பதிலளித்தார். உடனே நான், ‘‘நீர் பொய் சொல்லிவிட்டீர்! அல்லாஹ்வின் மீதாணையாக! உம்மிடம் நான் செவியுற்ற இந்த அத்தியாயத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களே எனக்கு (நீர் ஓதியதற்கு மாற்றமாக) ஓதிக்கொடுத்தார்கள்” என்று கூறியபடி அவரை இழுத்துக்கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றேன். அவர்களிடம், ‘‘(அல்லாஹ்வின் தூதரே!) தாங்கள் எனக்கு ஓதிக்கொடுக்காத பல (வட்டார) மொழி வழக்குகளில் ‘அல்ஃபுர்கான்’ அத்தியாயத்தை இவர் ஓதக் கேட்டேன். இந்த அத்தியாயத்தை நீங்கள் எனக்கு (வேறு முறையில்) ஓதிக்கொடுத்துள்ளீர்கள்” என்று சொன்னேன். அப்போது நபி (ஸல்) அவர்கள், ‘‘ஹிஷாமே, அதை ஓதுங்கள்!” என்றார்கள். உடனே அவர், நான் அவரிடமிருந்து செவியுற்றபடியே (நபி (ஸல்) அவர்களுக்கு முன்னாலும்) ஓதிக்காட்டினார். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள், ‘‘இப்படித்தான் (இந்த அத்தியாயம்) அருளப்பெற்றது” என்று கூறினார்கள். பிறகு (என்னைப் பார்த்து), ‘‘நீங்கள் ஓதுங்கள், உமரே!” என்று சொன்னார்கள். எனக்கு நபி (ஸல்) அவர்கள் ஓதிக் கொடுத்தபடி நான் ஓதினேன். (அதைக் கேட்ட) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘இப்படித்தான் (இந்த அத்தியாயம்) அருளப்பெற்றது” என்று கூறிவிட்டு, ‘‘இந்த குர்ஆன் ஏழு முறைகளில் அருளப்பட்டுள்ளது. ஆகவே, உங்களுக்கு அவற்றில் எளிதானது எதுவோ அதை ஓதிக்கொள்ளுங்கள்” என்று கூறினார்கள்.54 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5042,
			"arabicnumber": 5042,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: இரவு நேரம் பள்ளிவாசலில் ஒருவர் குர்ஆன் ஓதிக்கொண்டிருப்பதை நபி (ஸல்) அவர்கள் கேட்டார்கள். அப்போது நபியவர்கள், ‘‘அல்லாஹ் அவருக்குக் கருணை புரியட்டும்! இன்ன அத்தியாயங்களிலிருந்து நான் மறந்துவிட்டிருந்த இன்ன இன்ன வசனங்களை அவர் எனக்கு நினைவூட்டி விட்டார்” என்று சொன்னார்கள்.55 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5043,
			"arabicnumber": 5043,
			"text": "அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் (ஒரு நாள்) காலையில் சென்றோம். அப்போது ஒருவர், ‘‘நேற்றிரவு நான் ‘அல்முஃபஸ்ஸல்’ அத்தியாயங்களை (முழுமையாக) ஓதி முடித்தேன்” என்றார். அதற்கு அப்துல்லாஹ் (ரலி) அவர்கள், ‘‘பாட்டுப் பாடுவதைப் போன்று அவசர அவசரமாக ஓதினீரா? யாம் (சரியான) ஓதல்முறையைச் செவியுற்றுள்ளோம். மேலும், நபி (ஸல்) அவர்கள் தாம் (வழக்கமாக) ஓதிவந்த ஒரே அளவில் அமைந்த ‘அல்முஃபஸ்ஸல்’ அத்தி யாயங்களில் பதினெட்டையும் ‘ஹா மீம்’ (எனத் தொடங்கும் அத்தியாயங்களின்) குடும்பத்தில் இரண்டு அத்தியாயங்களையும் நான் மனன மிட்டுள்ளேன்” என்றார்கள்.56 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5044,
			"arabicnumber": 5044,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: ‘‘(நபியே!) இந்த ‘வஹீ’யை (வேத அறிவிப்பை) அவசரம் அவசரமாக மனனம் செய்வதற்காக உமது நாவை அசைக்காதீர்” எனும் (75:16ஆவது) இறைவசனத்தி(ன் விளக்கவுரையி)ல் இப்னு அப்பாஸ் (ரலி) அவர்கள் (பின்வருமாறு) கூறினார்கள்: (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் தம்மிடம் ‘வஹீ’யைக் கொண்டுவரும்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எங்கே வேத வசனங்களை மறந்துவிடப் போகிறோமோ என்ற அச்சத்தால் அதை மனனமிடுவதற்காக ஓதியபடி) தமது நாவையும் தம் இதழ்களையும் அசைத்துக்கொண்டிருப்பார்கள். இது அவர்களுக்குச் சிரமமாக இருந்தது. அது அவர்களின் வதனத்திலேயே காணப்படலாயிற்று. ஆகவே, அல்லாஹ், ‘லா உக்சிமு பி யவ்மில் கியாமா’ என்று தொடங்கும் (75ஆவது) அத்தியாயத்திலுள்ள, ‘‘இந்த வஹீயை (வேதஅறிவிப்பை) அவசரம் அவசரமாக மனனம் செய்வதற்காக உங்களது நாவை அசைக்காதீர்கள். அதை (உங்கள் மனத்தில்) ஒன்றுசேர்த்து, அதை (நீங்கள்) ஓதும்படி செய்வது எமது பொறுப்பாகும்” எனும் (75:16, 17) வசனங்களை அருளினான். (அதாவது) ‘உமது நெஞ்சில் பதியச்செய்வதும் அதை நீர் ஓதும்படி செய்வதும் எமது பொறுப்பாகும்’ (என்று சொன்னான்). ‘‘மேலும், நாம் இதை ஓதிவிட்டோமாயின் நீர் ஓதுவதைத் தொடர்வீராக!” (75:18). (அதாவது,) ‘நாம் இதை அருளும்போது செவிகொடுத்துக் கேட்டுக்கொண்டிருப்பீராக!’ (என்றும் சொன்னான்). ‘‘பின்னர், இதன் கருத்தை விவரிப்பதும் எமது பொறுப்பேயாகும்” (75:19). (அதாவது) ‘உமது நாவால் அதனை (மக்களுக்கு) விளக்கித் தரச்செய்வதும் எமது பொறுப்பாகும்’ என இறைவன் கூறினான். (இந்த வசனங்கள் அருளப்பட்ட பின்பு) தம்மிடம் ஜிப்ரீல் (அலை) அவர்கள் (வஹீயுடன்) வருகையில் நபி (ஸல்) அவர்கள் தலையைத் தாழ்த்தி (மௌனமாகக் கேட்டு)க்கொண்டிருப்பார்கள். அவர் (வசனங்களை அருளிவிட்டுச்) சென்று விடும்போது அல்லாஹ் வாக்களித்தபடி நபி (ஸல்) அவர்கள் வசனங்களை ஓதிக்கொண்டார்கள்.57 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5045,
			"arabicnumber": 5045,
			"text": "கத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம் நபி (ஸல்) அவர்களின் ஓதுதல்முறை பற்றிக் கேட்டேன் அதற்கு அவர்கள், ‘‘(நீட்டி ஓத வேண்டிய இடங்களில்) நன்றாக நீட்டி ஓதுவது நபி (ஸல்) அவர்களின் வழக்கமாக இருந்தது” என்று பதிலளித்தார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5046,
			"arabicnumber": 5046,
			"text": "கத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: ‘‘நபி (ஸல்) அவர்களின் ஓதுதல்முறை எப்படியிருந்தது?” என அனஸ் (ரலி) அவர்களிடம் வினவப்பட்டது. அதற்கு அவர்கள், ‘‘நீட்டி ஓதுவதே அவர்களின் வழக்கம் என்று கூறிவிட்டு, ‘பிஸ்மில்லாஹிர் ரஹ்மானிர் ரஹீம்’ என்பதில் ‘பிஸ்மில்லா...ஹ்’ என நீட்டுவார்கள்; ‘அர்ரஹ்மா...ன்’ என்றும் நீட்டுவார்கள்; ‘அர்ரஹீ...ம்’ என்றும் நீட்டுவார்கள்” என்று பதிலளித்தார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5047,
			"arabicnumber": 5047,
			"text": "அப்துல்லாஹ் பின் முஃகஃப்பல் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மக்கா வெற்றி நாளன்று) பயணித்துக்கொண்டிருந்த தமது ஒட்டகத்தின் மீது இருந்தவாறு ‘அல்ஃபத்ஹ் எனும் (48ஆவது) அத்தியாயத்தை’ அல்லது ‘அந்த அத்தியாயத்திலிருந்து ஒரு பகுதியை’ மெல்லிய குரலில் ‘தர்ஜீஉ’ எனும் ஓசை நயத்துடன் ஓதிக்கொண்டிருந்ததை நான் பார்த்தேன்.60 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5048,
			"arabicnumber": 5048,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (நான் இனிய குரலில் குர்ஆன் ஓதுவதைப் பாராட்டி), ‘‘அபூமூசா! (இறைத்தூதர்) தாவூத் (அலை) அவர்களுக்கு வழங்கப்பட்டிருந்த (சங்கீதம் போன்ற) இனிய குரல் உங்களுக்கும் வழங்கப்பட்டுள்ளது” என என்னிடம் கூறினார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5049,
			"arabicnumber": 5049,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) நபி (ஸல்) அவர்கள் என்னிடம், ‘‘குர்ஆனை எனக்கு ஓதிக் காட்டுங்கள்!” என்று சொன்னார்கள். நான், ‘‘தங்கள்மீதே குர்ஆன் அருளப்பட்டுக் கொண்டிருக்க, தங்களுக்கே நான் ஓதிக் காட்டுவதா?” என்று கேட்டேன். அவர்கள், ‘‘பிறரிடமிருந்து அதை நான் செவியுற விரும்புகிறேன்” என்று சொன்னார்கள்.61 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5050,
			"arabicnumber": 5050,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) நபி (ஸல்) அவர்கள் என்னிடம், ‘‘எனக்கு (குர்ஆனை) ஓதிக் காட்டுங்கள்!” என்று சொன்னார்கள். நான், ‘‘தங்கள்மீதே குர்ஆன் அருளப்பட்டுக் கொண்டிருக்க, தங்களுக்கே நான் ஓதிக் காட்டுவதா?” என்று கேட்டேன். அதற்கு அவர்கள், ‘ஆம்’ என்று சொன்னார்கள். ஆகவே, நான் ‘அந்நிசா’ எனும் (4ஆவது) அத்தியாயத்தை ஓதினேன். ‘‘ஒவ்வொரு சமுதாயத்திóருந்தும் (அவர்களுடைய நபியாகிய) சாட்சியை நாம் (மறுமையில்) கொண்டுவரும் போதும், (நபியே!) உம்மை இவர் களுக்கெதிரான சாட்சியாக நாம் கொண்டுவரும்போதும் (இவர்களது நிலை) எப்படியிருக்கும்?” எனும் (4:41ஆவது) வசனத்தை நான் அடைந்த போது நபி (ஸல்) அவர்கள், ‘‘இத்துடன் போதும்!” என்று சொன்னார்கள். அப்போது நான் அவர்களைப் பார்த்தேன்; அவர்களின் கண்கள் இரண்டும் கண்ணீரைச் சொரிந்துகொண்டிருந்தன.62 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5051,
			"arabicnumber": 5051,
			"text": "சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறியதாவது: என்னிடம் (கூஃபா நகர நீதிபதி) அப்துல்லாஹ் பின் ஷுப்ருமா (ரஹ்) அவர்கள், ‘‘ஒரு மனிதர் (தொழுகையில், அல்லது நாளொன்றுக்கு) குர்ஆனிலிருந்து (குறைந்தது) எவ்வளவு ஓதினால் போதும் என்று நான் ஆய்வு செய்தபோது, மூன்று வசனங்களைவிடக் குறைவான (வசனங் களைக் கொண்ட) ஓர் அத்தியாயத்தை நான் காணவில்லை; அதனால் மூன்று வசனங்களுக்குக் குறைவாக ஒருவர் ஓதுவது முறையாகாது என்ற முடிவுக்கு வந்தேன்” என்று கூறினார்கள். அல்கமா பின் கைஸ் (ரஹ்) அவர்கள் கூறியதாவது: அபூமஸ்ஊத் உக்பா பின் ஆமிர் (ரலி) அவர்கள் இறையில்லம் கஅபாவைச் சுற்றி (தவாஃப்) வந்துகொண்டிருந்தபோது, அன்னாரை நான் சந்தித்தேன். அப்போது அவர்கள், ‘‘யார் ‘அல்பகரா’ எனும் (2ஆவது) அத்தியாயத்தின் இறுதி இரு வசனங்களை (285, 286) இரவில் ஓதுகிறாரோ அவருக்கு அவ்விரண்டுமே போதும்” என்ற நபிமொழியைக் கூறினார்கள்.64 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5052,
			"arabicnumber": 5052,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: பாரம்பரியமிக்க ஒரு பெண்ணை என் தந்தை எனக்கு மணமுடித்துவைத்தார்கள். (என் தந்தை) அம்ர் (ரலி) அவர்கள் தம் மருமகளை அணுகி அவளுடைய கணவர் குறித்துக் கேட்பது (அதாவது என்னைப் பற்றி விசாரிப்பது) வழக்கம். அப்போது அவள், ‘‘அவர் நல்ல மனிதர்தான்; (ஆனால்,) அவர் படுக்கைக்கு வரவுமில்லை; அவரிடம் நான் வந்து சேர்ந்தது முதல் எனக்காகத் திரைச் சீலையை அவர் இழுத்து மூடவுமில்லை” என்று சொல்வாள். இதே நிலை நீடித்தபோது, (என் தந்தை) அம்ர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம் (இதைப் பற்றிக்) கூறினார்கள். அப்போது, ‘‘என்னை வந்து சந்திக்குமாறு உங்கள் மகனிடம் சொல்லுங்கள்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். பிறகு நான் நபி (ஸல்) அவர்களைச் சந்தித்தேன். அப்போது அவர்கள், ‘‘நீ எப்படி நோன்பு நோற்கிறாய்?” என்று கேட்டார்கள். நான், ‘‘தினந்தோறும் நோன்பு நோற்கிறேன்” என்று சொன்னேன். (‘‘குர்ஆனை) எப்படி ஓதி முடிக்கிறாய்” என்று கேட்டார்கள். நான், ‘‘ஒவ்வோர் இரவிலும் (குர்ஆனை ஓதி முடிக்கிறேன்)” என்று சொன்னேன். அவர்கள், ‘‘மாதந்தோறும் மூன்று நாட்கள் நோன்பு நோற்றுக்கொள். குர்ஆனை ஒவ்வொரு மாதமும் (ஒரு தடவை முழுமையாக) ஓதிக்கொள்” என்று சொன்னார்கள். ‘‘நான் அதைவிட அதிகமாக (நோன்பு நோற்கச்) சக்தி பெற்றுள்ளேன்” என்று கூறினேன். அவர்கள் ‘‘வாரத்தில் மூன்று நாட்கள் நோன்பு நோற்றுக்கொள்” என்றார்கள். நான், ‘‘அதைவிட அதிகமாக (நோன்பு நோற்க) எனக்குச் சக்தி உண்டு” என்று கூறினேன். ‘‘இரண்டு நாட்கள் நோன்பை விட்டுவிட்டு, ஒரு நாள் நோற்றுக்கொள்!” என்று சொன்னார்கள். நான், ‘‘இதைவிடவும் அதிகமாக (நோன்பு நோற்கச்) சக்தி பெற்றுள்ளேன்” என்று கூறினேன். நபி (ஸல்) அவர்கள், ‘‘(இறைத்தூதர்) தாவூத் (அலை) அவர்களின் உயர்ந்த நோன்பு வழக்கப்படி, ஒருநாள் விட்டு ஒருநாள் நோன்பு நோற்றுக்கொள்! மேலும், ஒவ்வோர் ஏழு இரவுகளிலும் (ஒருமுறை குர்ஆனை) ஓதி (முடித்து)க்கொள்” என்று சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வழங்கிய இந்தச் சலுகையை நான் ஏற்று நடந்திருந்தால் நன்றாயிருந்திருக்கும்! காரணம் நான் (இப்போது) தள்ளாமை வயதையடைந்து மிகவும் பலவீனம் அடைந்துவிட்டேன். (அறிவிப்பாளர்களில் ஒருவரான முஜாஹித் (ரஹ்) அவர்கள் கூறினார்கள்:) அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் (தமது முதுமையில்) குர்ஆனில் ஏழில் ஒரு பாகத்தை (அதாவது ஒரு மன்ஸிலை) தம் வீட்டாரில் சிலரிடம் பகலில் ஓதிக்காட்டுவார்கள். (இரவில்) ஓதவேண்டுமென அவர்கள் விரும்பிய பாகத்தையே (இவ்வாறு) பகலில் ஓதிக்காட்டுவார்கள். இரவில் (ஓதும்போது) சுலபமாக இருக்கட்டும் என்பதே இதற்குக் காரணம். அன்னார் (நோன்பு நோற்கச்) சக்தி பெறவேண்டும் என விரும்பும்போது, பல நாட்கள் நோன்பு நோற்காமல் விட்டுவிட்டு அந்நாட்களைக் கணக்கில் வைத்துக்கொள்வார்கள். பிறகு (வசதிப்படும் போது) அதே அளவு நாட்கள் நோன்பு நோற்பார்கள். நபி (ஸல்) அவர்களிடமிருந்து பிரிந்தபோது (நபியவர்கள் இறந்தபோது) தாம் செய்துவந்த எந்த வழிபாட்டையும் கைவிடுவதை அன்னார் விரும்பாததே இதற்குக் காரணம். அபூஅப்தில்லாஹ் (புகாரீ) கூறுகிறேன்: (அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்களிடம், ‘‘மாதம் ஒருமுறை குர்ஆனை ஓதி நிறைவு செய்” என நபி (ஸல்) அவர்கள் கூறியபோது, அதைவிட அதிகமாக ஓதுவதற்குத் தம்மால் முடியும் என அன்னார் தெரிவிக்க, நபியவர்கள் நாட்களைக் குறைத்துக்கொண்டே வந்து) மூன்று நாட்களுக்கு ஒருமுறை, அல்லது ஐந்து நாட்களுக்கு ஒருமுறை (குர்ஆனை ஓதி நிறைவு செய் என்று நபியவர்கள் கூறினார்கள்) என அறிவிப்பாளர்களில் சிலர் தெரிவித்துள்ளனர். ‘ஏழு நாட்களுக்கு ஒருமுறை’ என்றே பெரும்பாலோர் கூறியுள்ளனர். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5053,
			"arabicnumber": 5053,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: என்னிடம் நபி (ஸல்) அவர்கள், ‘‘எத்தனை நாட்களில் குர்ஆனை ஓதி முடிக்கிறாய்?” என்று கேட்டார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5054,
			"arabicnumber": 5054,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: என்னிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘ஒவ்வொரு மாதமும் (ஒருமுறை குர்ஆனை) ஓதி நிறைவு செய்!” என்று கூறினார்கள். அப்போது நான், ‘‘(அதைவிடவும் குறைந்த நாட்களில் குர்ஆனை முழுமையாக ஓதி முடிக்கும்) சக்தி எனக்கு உள்ளது” என்று கூறினேன். (அதற்குப் பிறகு படிப்படியாகக் குறைத்துக்கொண்டே வந்து) இறுதியாக ‘‘அப்படியானால், ஏழு நாட்களில் (ஒரு முறை) ஓதி நிறைவு செய்; அதைவிட (ஓதுவதை) அதிகமாக்கிவிடாதே” என்று சொன்னார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5055,
			"arabicnumber": 5055,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ‘‘எனக்கு குர்ஆனை ஓதிக்காட்டுக!” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னிடம்) கூறினார்கள். அதற்கு நான், ‘‘தங்கள்மீதே குர்ஆன் அருளப்பட்டுக்கொண்டிருக்க, தங்களுக்கே நான் ஓதிக்காட்டுவதா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், ‘‘பிறரிடமிருந்து அதைக் கேட்க நான் பெரிதும் ஆசைப்படுகிறேன்” என்று சொன்னார்கள். நான், ‘அந்நிசா’ எனும் (4ஆவது) அத்தியாயத்தை ஓதினேன். ‘‘ஒவ்வொரு சமுதாயத்திலிருந்தும் (அவர்களுடைய நபியாகிய) சாட்சியை நாம் (மறுமையில்) கொண்டுவரும்போதும், (நபியே!) உம்மை இவர்களுக்கெதிரான சாட்சியாக நாம் கொண்டுவரும்போதும் (இவர்களின் நிலை) எப்படியிருக்கும்?” எனும் (4:41ஆவது) வசனத்தை நான் அடைந்தபோது ‘நிறுத்துங்கள்’ என்று நபியவர்கள் சொன்னார்கள். அப்போது அவர்களின் கண்கள் கண்ணீரைச் சொரிவதை நான் கண்டேன்.65 இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5056,
			"arabicnumber": 5056,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ‘‘எனக்கு குர்ஆனை ஓதிக்காட்டுக!” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம் கூறினார்கள். அதற்கு நான், ‘‘தங்கள்மீதே குர்ஆன் அருளப்பட்டுக்கொண்டிருக்க, தங்களுக்கே நான் ஓதிக்காட்டுவதா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், ‘‘பிறரிடமிருந்து அதைக் கேட்க நான் விரும்புகிறேன்” என்று சொன்னார்கள்.66 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5057,
			"arabicnumber": 5057,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறுதிக் காலத்தில் ஒரு கூட்டத்தார் வருவார்கள். அவர்கள் குறைந்த வயது கொண்ட இளைஞர்களாயிருப் பார்கள். முதிர்ச்சியற்ற புத்தியுடையவர் களாயிருப்பார்கள். பூமியிலேயே மிகச் சிறந்த சொல்லை (குர்ஆன் வசனங்களை) எடுத்துச் சொல்வார்கள். அவர்கள், வேட்டைப் பிராணியி(ன்உடலி)லிருந்து (வேடன் எய்த) அம்பு (அதன் உடலுக்குள் பாய்ந்து மறுபுறமாக) வெளிப்பட்டுச் சென்றுவிடுவதைப் போல் இஸ்லாத்திலிருந்து வெளியேறிச் சென்றுவிடுவார்கள். அவர்களது இறைநம்பிக்கை(யும் மார்க்க விசுவாசமும்) அவர்களின் தொண்டைக் குழிகளைத் தாண்டி (இதயம்வரை) செல்லாது. ஆகவே, அவர்களை நீங்கள் எங்கு கண்டாலும் கொன்றுவிடுங்கள். ஏனெனில், அவர்களை ஒழிப்பது, அவர்களைக் கொன்றவர்களுக்கு மறுமை நாளில் நற்பலனாக அமையும்” என்று சொன்னார்கள். இதை அலீ (ரலி) அவர்கள் அறிவிக் கிறார்கள்.67 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5058,
			"arabicnumber": 5058,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களிடையே ஒரு கூட்டத்தார் கிளம்புவார்கள். அவர்களது தொழுகையுடன் உங்களுடைய தொழுகையையும், அவர்களது நோன்புடன் உங்களுடைய நோன்பையும், அவர்களின் நற்செயல்களுடன் உங்களின் நற்செயல்களையும் ஒப்பிட்டுப் பார்த்து உங்களுடைய தொழுகை, நோன்பு மற்றும் நற்செயல்களை அற்பமானவையாகக் கருதுவீர்கள். (அந்த அளவுக்கு அவர்களது வழிபாடு களை கட்டியிருக்கும்.) மேலும், அவர்கள் குர்ஆனை ஓதுவார்கள். ஆனால், அது அவர்களின் தொண்டைக் குழிகளைத் தாண்டிச் செல்லாது. வேட்டைப் பிராணியை விட்டு (அதன் உடலைத் துளைக்கின்ற) அம்பு (உடலின் மறுபுறம்) வெளிப்பட்டுச் சென்றுவிடுவதைப் போன்று மார்க்கத்திலிருந்து அவர்கள் வெளியேறிவிடுவார்கள். (அந்தப் பிராணியின் உடலைத் துளைத்து வெளிவந்ததற்கான அடையாளம் ஏதுமிருக்கிறதா என்று) அம்பின் முனையைப் பார்ப்பார். அதில் (அடையாளம்) ஏதும் காணமாட்டார். பிறகு அம்பின் (அடிப்பாகக்) குச்சியைப் பார்ப்பார். அதிலும் (அடையாளம்) ஏதும் காணமாட்டார். பிறகு அம்பின் இறகைப் பார்ப்பார். அதிலும் (அடையாளம்) ஏதும் காணமாட்டார். அம்பி(ன் முனை’)ல் நாணைப் பொருத்தும் இடம் தொடர்பாகவும் (அது வேட்டைப் பிராணியைத் தைத்ததா) என்று சந்தேகம் கொள்வார். (அந்த அளவுக்கு அம்பில் எந்தச் சுவடும் இராது.) இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.68 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5059,
			"arabicnumber": 5059,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனை ஓதி அதன்படி செயலும் ஆற்றக்கூடிய இறைநம்பிக்கையாளர் நாரத்தைப் பழம் போன்றவர்; அதன் சுவையும் நன்று; வாசனையும் நன்று. குர்ஆனை ஓதாமல் அதன்படி செயலாற்றி மட்டும் வருபவர், பேரீச்சம் (பழம்) போன்றவர். அதன் சுவை நன்று; (ஆனால்,) அதற்கு மணமில்லை. குர்ஆனை ஓதுகின்ற நயவஞ்சகனின் நிலை, துளசிச் செடியின் நிலையை ஒத்திருக்கிறது. அதன் வாசனை நன்று; அதன் சுவையோ கசப்பானது. குர்ஆனை ஓதாத நயவஞ்சகனின் நிலை, குமட்டிக்காய் போன்றதாகும். அதன் சுவையும் ‘கசப்பானது’ அல்லது ‘அருவருப்பானது.’ அதன் வாடையும் வெறுப்பானது. இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.69 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5060,
			"arabicnumber": 5060,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களின் உள்ளங்கள் ஒன்றுபட்டி ருக்கும்வரை குர்ஆனை ஓதுங்கள். (அதன் கருத்தை அறிவதில்) உங்களிடையே கருத்து வேறுபாடு எழுந்தால் அ(ந்த இடத்)தைவிட்டு எழுந்து (சென்று)விடுங்கள்.70 இதை ஜுன்துப் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5061,
			"arabicnumber": 5061,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களின் உள்ளங்கள் ஒன்றுபட்டி ருக்கும்வரை குர்ஆனை ஓதுங்கள். (அதன் கருத்தை அறிவதில்) நீங்கள் கருத்து வேறுபாடு கொண்டால் அ(ந்த இடத்)தைவிட்டு எழுந்து (சென்று)விடுங்கள். இதை ஜுன்துப் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஏழு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5062,
			"arabicnumber": 5062,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் (குர்ஆனின்) ஒரு வசனத்தை ஓதுவதை நான் கேட்டேன். அவர் ஓதியதற்கு மாற்றமாக அந்த வசனத்தை நபி (ஸல்) அவர்கள் ஓத நான் கேட்டிருந்தேன். எனவே, அந்த மனிதரது கையைப் பிடித்து நபி (ஸல்) அவர்களிடம் அழைத்துச் சென்றேன். (விவரத்தை விசாரித்தறிந்த) நபி (ஸல்) அவர்கள், ‘‘நீங்கள் இருவருமே சரியாகத்தான் ஓதியிருக்கிறீர்கள்” என்று கூறிவிட்டு, (ஒவ்வொருவரையும் பார்த்து, ‘‘அவ்வாறே) ஓதுங்கள்!” என்றார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) ஷுஅபா (ரஹ்) அவர்கள் கூறுகிறார்கள்: நபி (ஸல்) அவர்கள், ‘‘(வேற்றுமை கொள்ளாதீர்கள்!) ஏனெனில், உங்களுக்கு முன்னிருந்தவர்கள் (இப்படித்தான்) வேறுபட்டனர். அது அவர்களை அழித்துவிட்டது” என்று கூறியதாகவே பெரும்பாலும் நான் கருதுகிறேன். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 87
			}
		}
	]
}