{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5970,
			"arabicnumber": 5970,
			"text": "வலீத் பின் அய்ஸார் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களின் இல்லத்தைச் சுட்டிக் காட்டியவாறு அபூஅம்ர் அஷ்ஷைபானீ (ரஹ்) அவர்கள், “(இதோ!) இந்த வீட்டுக்காரர் (பின்வருமாறு) எனக்குத் தெரிவித்தார்கள்” என்று கூறினார்கள்: நான் நபி (ஸல்) அவர்களிடம், “வல்லமையும் மாண்பும் மிக்க அல்லாஹ்விற்கு மிகவும் விருப்பமான செயல் (அமல்) எது?” என்று கேட்டேன். அவர்கள், “தொழுகையை அதற்குரிய நேரத்தில் நிறைவேற்றுவது” என்றார்கள். “பிறகு எது?” என்று கேட்டேன். “தாய் தந்தையருக்கு நன்மை செய்வது” என்றார்கள். (நான் தொடர்ந்து) “பிறகு எது?” என்றேன். அவர்கள், “அல்லாஹ்வின் வழியில் அறப்போர் புரிவது” என்று பதிலளித்தார்கள். இவற்றை (மட்டுமே) என்னிடம் நபி (ஸல்) அவர்கள் தெரிவித்தார்கள். இன்னும் அதிகமாக (இது குறித்து) நான் அவர்களிடம் கேட்டிருந்தால் எனக்கு இன்னும் நிறைய பதிலளித்திருப்பார்கள்.2 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5971,
			"arabicnumber": 5971,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு மனிதர் வந்து, “அல்லாஹ்வின் தூதரே! நான் அழகிய முறையில் உறவாடுவதற்கு மிகவும் அருகதையானவர் யார்?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “உன் தாய்” என்றார்கள். அவர், “பிறகு யார்?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “உன் தாய்” என்றார்கள். அவர், “பிறகு யார்?” என்றார். “உன் தாய்” என்றார்கள். அவர், “பிறகு யார்?” என்றார். அப்போது நபி (ஸல்) அவர்கள், “பிறகு, உன் தந்தை” என்றார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5972,
			"arabicnumber": 5972,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம், “நான் (இந்த) அறப்போரில் கலந்து கொள்ளட்டுமா?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “உமக்குத் தாய் தந்தை இருக்கின்றனரா?” என்று கேட்டார்கள். அவர், “ஆம் (இருக்கிறார்கள்)” என்று கூறினார். நபி (ஸல்) அவர்கள், “(அவ்வாறா யின் திரும்பிச் சென்று) அவர்கள் இருவருக்காகவும் பாடுபடுவீராக!” என்றார் கள்.3 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5973,
			"arabicnumber": 5973,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: “ஒரு மனிதர் தம் தாய் தந்தையரை சபிப்பது பெரும் பாவங்களில் உள்ளதாகும்” என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். அப்போது “அல்லாஹ்வின் தூதரே! ஒரு மனிதர் தம் தாய் தந்தையரை எவ்வாறு சபிப்பார்?” என்று கேட்கப்பட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “ஒருவர் இன்னொருவரின் தந்தையை ஏசுவார். உடனே (பதிலுக்கு) அவர் இவருடைய தந்தையையும் தாயையும் ஏசுவார் (ஆக, தம் தாய் தந்தையர் ஏசப்பட இவரே காரணமாகிறார்)” என்றார்கள்.4 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5974,
			"arabicnumber": 5974,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (உங்களுக்குமுன் வாழ்ந்தவர்களில்) மூன்றுபேர் நடந்து சென்றுகொண்டி ருந்தபோது (திடீரென்று) மழை பிடித்துக் கொண்டது. ஆகவே, அவர்கள் (ஒதுங்கு வதற்காக) ஒரு மலைக்குகையை நோக்கிப் போனார்கள். (அவர்கள் உள்ளே நுழைந்த) உடனே மலையிலிருந்து உருண்டு வந்த ஒரு பாறை அவர்களது குகைவாயிலை அடைத்துக்கொண்டது. (வெளியேற முடியாமல் திணறிய) அவர்கள் (மூவரும்) அப்போது தமக்குள், “நாம் (வேறெவருடைய திருப்திக்காகவுமின்றி) அல்லாஹ்வுக்காக (என்று தூய்மையான முறையில்) செய்த நற்செயல்களை நினைத்துப்பார்த்து, அவற்றை முன்வைத்து அல்லாஹ்விடம் பிரார்த்திப்போம். அவன் இ(ப்பாறை)தனை (நம்மைவிட்டு) அகற்றிவிடக்கூடும்” என்று பேசிக்கொண்டனர். எனவே, அவர்களில் ஒருவர் இவ்விதம் (இறைவனிடம்) வேண்டினார்: இறைவா! எனக்கு முதிர்ந்த வயதுடைய தாய் தந்தையர் இருந்தனர். எனக்குச் சிறு குழந்தைகளும் உண்டு. நான் இவர்களைப் பராமரிப்பதற்காக ஆடுகளை மேய்த்துக்கொண்டிருந்தேன். மாலையில் அவர்களிடம் நான் திரும்பி வந்தபின் ஆட்டின் பாலைக் கறந்துகொண்டு வந்து என் குழந்தைகளுக்கு ஊட்டுவதற்கு முன்பாக என் தாய் தந்தையருக்கு முதலில் ஊட்டுவேன். (ஒருநாள்) இலை தழைகளைத் தேடியபடி வெகுதூரம் சென்றுவிட்டேன். அதனால் அந்திப் பொழுதிலேயே (வீட்டுக்கு) வர முடிந்தது. அப்போது (என் தாய், தந்தை) இருவரும் உறங்கிவிட்டிருக்கக் கண்டேன். உடனே எப்போதும்போல பால் கறந்து, பால் செம்புடன் வந்தேன். பெற்றோரைத் தூக்கத்திலிருந்து எழுப்பிட மனமில்லாமல் அவர்கள் இருவருடைய தலைமாட்டில் நின்று கொண்டேன். அவர்கள் இருவருக்கும் முன் குழந்தைகளுக்கு முதலில் ஊட்டுவதையும் நான் விரும்பவில்லை. என் குழந்தைகளோ எனது காலருகில் (பசியால்) கதறிக்கொண்டிருந்தனர். இதே நிலையில் நானும் அவர்களும் இருக்க, வைகறை வந்துவிட்டது. (இறைவா!) நான் இச்செயலை உனது அன்பை நாடியே செய்தேன் என்று நீ கருதியிருந்தால் எங்களுக்கு இந்தப் பாறையைச் சற்றே நகர்த்திடுவாயாக! அதன் வழியாக நாங்கள் ஆகாயத்தைப் பார்த்துக்கொள்வோம். அவ்வாறே அவர்களுக்கு அல்லாஹ் சற்றே நகர்த்திக்கொடுத்தான். அதன் வழியாக அவர்கள் ஆகாயத்தைப் பார்த்தார்கள். இரண்டாமவர் (பின்வருமாறு) வேண்டினார்: இறைவா! எனக்கு என் தந்தையின் சகோதரருடைய புதல்வி ஒருத்தி இருந்தாள். பெண்களை ஆண்கள் நேசிப்பதிலேயே மிகவும் ஆழமாக அவளை நான் நேசித்தேன். (ஒருநாள்) அவளிடம் அவளைக் கேட்டேன். நான் அவளிடம் நூறு பொற்காசுகள் கொண்டுவந்தால் தவிர (எனக்கு இணங்க முடியாதென) அவள் மறத்துவிட்டாள். நான் முயற்சி செய்து, (அந்த) நூறு பொற்காசுகளைச் சேகரித்தேன். நான் அதனுடன் சென்று அவளைச் சந்தித்து, அவளுடைய இரு கால்களுக்கிடையே அமர்ந்தபோது அவள், “அல்லாஹ்வின் அடியானே! அல்லாஹ்வை அஞ்சு! முத்திரையை அதற்குரிய (சட்டபூர்வ) உரிமை(யான திருமணம்) இன்றித் திறக்காதே” என்று சொன்னாள். உடனே நான் அவளை விட்டுவிட்டு எழுந்துவிட்டேன். (இறைவா!) இதை உன் அன்பைப் பெற விரும்பியே நான் செய்ததாக நீ கருதினால், இந்தப் பாறையை எங்களுக்காக (இன்னும் சற்று) நகர்த்திடுவாயாக! அவ்வாறே (அல்லாஹ்), அவர்களுக்கு (அப்பாறையை இன்னும்) சற்றே நகர்த்திக்கொடுத்தான். மற்றொருவர் (பின்வருமாறு) வேண்டினார்: இறைவா! நான் ஒரு ‘ஃபரக்’ அளவு நெல்லைக் கூலியாக நிர்ணயித்து கூலியாள் ஒருவரை (பணிக்கு) அமர்த்தினேன். அவர் தமது வேலை முடிந்தவு டன், “என்னுடைய உரிமையை (கூலியை)க் கொடு” என்று கேட்டார். நான் (நிர்ணயித்தபடி) அவரது உரிமையை (கூலியை) அவர்முன் வைத்தேன். அதை அவர் பெற்றுக்கொள்ளாமல் (என்னிடமே) விட்டுவிட்(டுச் சென்றுவிட்)டார். பின்னர் நான் அதை (நிலத்தில் விதைத்து) தொடர்ந்து விவசாயம் செய்துவந்தேன். அதி(ல் கிடைத்த வருவாயி)லிருந்து பல மாடுகளையும் அவற்றுக்கான இடையர்களையும் நான் சேகரித்துவிட்டேன். பின்னர் (ஒருநாள்) அவர் என்னிடம் வந்து, “அல்லாஹ்வை அஞ்சுவீராக! எனக்கு அநீதி இழைக்காதீர்! எனது உரிமையை என்னிடம் கொடுத்துவிடுவீராக!” என்று கூறினார். அதற்கு நான், “அந்த மாடுகளிடத்திலும் அவற்றின் இடையர்களிடத்திலும் நீ செல்! (அவை உனக்கே உரியவை)” என்று சொன்னேன். அதற்கு அம்மனிதர், “அல்லாஹ்வை அஞ்சுவீராக! என்னைப் பரிகாசம் செய்யாதீர்!” என்று சொன்னார். நான், “உன்னை நான் பரிகாசம் செய்யவில்லை. இந்த மாடுகளையும் இடையர்களையும் நீயே எடுத்துக்கொள்” என்று சொன்னேன். அவர் அவற்றைப் பிடித்தபடி நடந்தார். (இறைவா!) நான் இந்த (நற்)செயலை உன் அன்பைப் பெற விரும்பியே செய்ததாக நீ கருதியிருந்தால் மீதியுள்ள அடைப்பையும் நீ அகற்றிடுவாயாக! அவ்வாறே அல்லாஹ் (அப்பாறையை) அவர்களைவிட்டு (முழுமையாக) அகற்றிவிட்டான்.5 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5975,
			"arabicnumber": 5975,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அன்னையரைப் புண்படுத்துவது, (அடுத்தவருக்குத் தரவேண்டியதைத்) தர மறுப்பது, (அடுத்தவருக்கு உரியதைத்) தருமாறு கேட்பது, பெண் சிசுக்களை உயிருடன் புதைப்பது ஆகியவற்றை அல்லாஹ் தடை செய்துள்ளான். மேலும், (இவ்வாறு) சொல்லப்பட்டது; அவர் சொன்னார் என (ஊர்ஜிதமாகா ததை)ப் பேசுவது, அதிகமாகக் (கேள்வி, அல்லது யாசகம்) கேட்பது, செல்வத்தை வீணாக்குவது ஆகியவற்றை உங்களுக்கு அல்லாஹ் வெறுத்துள்ளான். இதை முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.7 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5976,
			"arabicnumber": 5976,
			"text": "அபூபக்ரா நுஃபைஉ பின் அல் ஹாரிஸ் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் “பெரும்பாவங்களிலேயே மிகப் பெரும் பாவங்களை நான் உங்களுக்கு அறிவிக்கட்டுமா?” என்று மூன்று முறை கேட்டார்கள். நாங்கள், “ஆம், அல்லாஹ்வின் தூதரே! (அறிவியுங்கள்)” என்று கூறினோம். நபி (ஸல்) அவர்கள், “அல்லாஹ்வுக்கு இணைகற்பிப்பதும், பெற்றோரைப் புண்படுத்துவதும்” என்று சொல்லிவிட்டு சாய்ந்துகொண்டிருந்த அவர்கள் எழுந்து அமர்ந்து, “அறிந்துகொள்ளுங்கள்: பொய் பேசுவதும் பொய் சாட்சியமும் (மிகப் பெரும் பாவம்தான்); பொய் பேசுவதும் பொய் சாட்சியமும் (மிகப் பெரும் பாவம்தான்)” என்று கூறினார்கள். இதை அவர்கள் திரும்பத் திரும்பச் சொல்óக்கொண்டேயிருந்தார்கள். (இதைக் கண்ட) நான் “அவர்கள் நிறுத்திக்கொள்ளக் கூடாதா?” என்றேன்.8 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5977,
			"arabicnumber": 5977,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘பெரும் பாவங்கள் தொடர்பாகக் குறிப்பிட்டார்கள்’ அல்லது ‘அவர்களி டம் பெரும் பாவங்கள் பற்றிக் கேட்கப் பட்டது’. அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ்வுக்கு இணைகற்பிப்பது, கொலை செய்வது, பெற்றோரைப் புண்படுத்துவது ஆகியன (பெரும்பாவங் களாகும்)” என்று கூறிவிட்டு, “பெரும் பாவங்களிலேயே மிகப் பெரும் பாவத்தை நான் உங்களுக்கு அறிவிக்கட்டுமா?” என்று கேட்டார்கள். “ ‘பொய் பேசுவது’ அல்லது ‘பொய் சாட்சியம்’ (மிகப் பெரும் பாவமாகும்)” என்று சொன்னார்கள்.9 (அறிவிப்பாளர்களில் ஒருவரான) ஷுஅபா பின் அல்ஹஜ்ஜாஜ் (ரஹ்) அவர்கள் கூறுகிறார்கள்: ‘பொய் சாட்சியம்’ என்றுதான் நபி (ஸல்) அவர்கள் குறிப்பிட்டார்கள் என்றே நான் அநேகமாகக் கருதுகிறேன். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5978,
			"arabicnumber": 5978,
			"text": "அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களது காலத்தில் என் தாயார் ஆசையாக என்னிடம் வந்தார். (அப்போது அவர் இணைவைப்பாளராக இருந்தார்.) நான் நபி (ஸல்) அவர்களிடம் “(என் தாயார் வந்துள்ளார்.) அவருடன் உறவைப் பேணிக்கொள்ளட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “ஆம்” என்று கூறினார்கள்.11 “ஆகவே, அஸ்மாவின் தாயார் தொடர் பாக, ‘மார்க்க (விஷய)த்தில் உங்களிடம் போரிடாமலும், உங்கள் இல்லங்களிலிருந்து உங்களை வெளியேற்றாமலும் இருந்தார் களே அவர்களுக்கு நீங்கள் நன்மை செய்வதையும், அவர்களுக்கு நீங்கள் நீதி செலுத்துவதையும் அல்லாஹ் தடுக்கவில்லை. நிச்சயமாக அல்லாஹ் நீதி செலுத்துவோரை நேசிக்கிறான்’ எனும் (60:8ஆவது) வசனத்தை அல்லாஹ் அருளினான்” என (இதன் அறிவிப்பாளர்களில் ஒருவரான) சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5979,
			"arabicnumber": 5979,
			"text": "அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுடன் குறைஷியர் சமாதான ஒப்பந்தம் செய்துகொண்டிருந்த காலத்தில் இணைவைப்பாளராக இருந்த என் தாயார் தம் தந்தையுடன் (என்னைப் பார்க்க) வந்தார். நான், “என் தாயார் என்னிடம் ஆசையுடன் வந்துள்ளார்; நான் அவருடன் உறவுகொண்டாடலாமா?” என்று நபி (ஸல்) அவர்களிடம் தீர்ப்புக் கேட்டேன். நபி (ஸல்) அவர்கள், “ஆம். நீ உன் தாயின் உறவைப் பேணி நடந்துகொள்” என்று சொன்னார்கள். அத்தியாயம் :",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5980,
			"arabicnumber": 5980,
			"text": "அபூசுஃப்யான் (ரலி) அவர்கள் கூறியதாவது: (கிழக்கு ரோமானிய மன்னர்) ஹிரக்ளீயஸ் (வணிகர்களாகச் சென்றிருந்த மக்காவைச் சேர்ந்தவர்களிடையே இருந்த) என்னை அழைத்துவரச் சொல்லி ஆளனுப்பினார். (நான் அவரிடம் சென்றேன்.) அப்போது ஹிரக்ளீயஸ், “அவர் (நபி (ஸல்) அவர்கள்) உங்களுக்கு என்னதான் போதிக்கின்றார்?” என்று கேட்டார். நான், “தொழுகை, தர்மம், கற் பொழுக்கம், உறவைப் பேணிவாழ்வது ஆகியப் பண்புகளை எங்களுக்குக் கட்டளையிடுகின்றார்” என்று பதிலளித் தேன். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.12 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5981,
			"arabicnumber": 5981,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை) உமர் (ரலி) அவர்கள் கோடுபோட்ட பட்டு அங்கி ஒன்று விற்கப்படுவதைக் கண்டு, “அல்லாஹ்வின் தூதரே! இதைத் தாங்கள் வாங்கி வெள்ளிக் கிழமையிலும், தூதுக்குழுக்கள் தங்களிடம் வரும்போதும் அணிந்து கொள்ளுங்கள்” என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், “எ(ந்த ஆட)வருக்கு (மறுமையில்) எந்த நற்பேறும் இல்லையோ அவர்தான் இதை (இம்மையில்) அணிவார்” என்று சொன்னார்கள். பிறகு அதே பட்டு அங்கிகளில் சில நபி (ஸல்) அவர்களிடம் கொண்டுவரப்பட்டன. (அவற்றி óருந்து) ஓர் அங்கியை நபி (ஸல்) அவர்கள் உமர் (ரலி) அவர்களுக்குக் கொடுத்தனுப்பினார்கள். உமர் (ரலி) அவர்கள், “நான் இதை எப்படி அணிய முடியும்? இந்தப் பட்டாடை தொடர்பாகத் தாங்கள் முன்பு வேறுவிதமாகச் சொன்னீர்களே?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “இதை நீங்கள் அணிந்துகொள்ள நான் உங்களுக்குத் தரவில்லை. மாறாக, இதை நீங்கள் விற்றுவிடலாம்; (பெண்களுக்கோ மற்ற மதத்தாருக்கோ) அணிவிக்கலாம் என்பதற்காகவே வழங்கினேன்” என்று சொன்னார்கள். எனவே, உமர் (ரலி) அவர்கள் அதை மக்காவாசியான தம் சகோதரர் ஒருவருக்குக் கொடுத்தனுப்பினார்கள். அப்போது அவர் முஸ்லிமாயிருக்கவில்லை.13 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5982,
			"arabicnumber": 5982,
			"text": "அபூஅய்யூப் அல்அன்சாரி (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம், “அல்லாஹ்வின் தூதரே! என்னைச் சொர்க்கத்தில் சேர்க்கும் ஒரு (நற்)செயலை எனக்குத் தெரிவியுங்கள்” என்று வினவப்பட்டது.14 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5983,
			"arabicnumber": 5983,
			"text": "அபூஅய்யூப் அல்அன்சாரி (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம், “அல்லாஹ்வின் தூதரே! என்னைச் சொர்க்கத்தில் சேர்க்கும் ஒரு (நற்) செயலை எனக்குக் கூறுங்கள்” என்று (அவசரமாகக்) கேட்டார். அப்போது மக்கள், “இவருக்கென்ன நேர்ந்தது? இவருக்கென்ன நேர்ந்தது?” என்று கூறினார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவருக்கு ஏதேனும் (அவசரத்) தேவை இருக்கலாம்” என்று (மக்களை நோக்கிச்) சொல்லிவிட்டு (அந்த மனிதரை நோக்கி), “நீர் அல்லாஹ்வை வழிபட வேண்டும்; அவனுக்கு எதையும் இணையாக்கக் கூடாது; (கடமையான) தொழுகையையும் (கடமையான) ஸகாத்தையும் நிறைவேற்ற வேண்டும். உறவைப் பேணிவாழ வேண்டும்” என்று கூறிவிட்டு, “(என்) ஒட்டகத்தை விட்டுவிடுவீராக!” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள் (அப்போது) தமது வாகனத்தில் அமர்ந்திருந்தார்கள் போலும்.15 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5984,
			"arabicnumber": 5984,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உறவை முறித்து வாழ்பவன் சொர்க்கத்தில் நுழையமாட்டான். இதை ஜுபைர் பின் முத்இம் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.16 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5985,
			"arabicnumber": 5985,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தமது வாழ்வாதாரம் (ரிஸ்க்) விசாலமாக்கப்படுவதும் வாழ்நாள் நீட்டிக்கப்படுவதும் யாருக்கு மகிழ்ச்சி அளிக்குமோ அவர் தமது உறவைப் பேணிவாழட்டும்.17 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5986,
			"arabicnumber": 5986,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தமது வாழ்வாதாரம் (ரிஸ்க்) விசாலமாக்கப்படுவதையும் வாழ்நாள் நீட்டிக்கப்படுவதையும் யார் விரும்புகின் றாரோ அவர் தமது உறவைப் பேணி வாழட்டும். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5987,
			"arabicnumber": 5987,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் படைப்பினங்களை படைத்து முடித்தபோது உறவானது (எழுந்து இறைவனின் அரியணையின் கால்களைப் பற்றிக்கொண்டு), “உறவுகளைத் துண்டிப்பதிலிருந்து உன்னிடம் பாதுகாப்புக் கோரியே இப்படி நிற்கிறேன்” என்று கூறி (மன்றாடி)யது. அல்லாஹ், “ஆம். உன்னை (உறவை)ப் பேணி நடந்துகொள்பவனுடன் நானும் நல்ல முறையில் நடந்துகொள்வேன் என்பதும், உன்னைத் துண்டித்துவிடுபவனை நானும் துண்டித்துவிடுவேன் என்பதும் உனக்குத் திருப்தியளிக்கவில்லையா?” என்று கேட்டான். அதற்கு உறவு, “ஆம் (திருப்தியே) என் இறைவா!” என்று கூறியது. அல்லாஹ், “இது உனக்காக நடக்கும்” என்று சொன்னான். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “நீங்கள் விரும்பினால் ‘(நயவஞ்சகர்களே!) நீங்கள் (போருக்கு வராமல்) பின்வாங்கிக்கொண்டு பூமியில் குழப்பம் விளைவிக்கவும் உங்கள் உறவுகளைத் துண்டித்துவிடவும் முனைகிறீர்களா?’ எனும் (47:22ஆவது) வசனத்தை ஓதிக்கொள்ளுங்கள்” என்று கூறினார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.17ஆ அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5988,
			"arabicnumber": 5988,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உறவு (ரஹிம்) என்பது, அளவிலா அருளாளன் (ரஹ்மான்) இடமிருந்து வந்த (அருட்கொடை) கிளையாகும்.18 ஆகவே, இறைவன் (உறவை நோக்கி) “உன்னோடு ஒட்டி வாழ்பவனுடன் நானும் உறவு பாராட்டுவேன். உன்னை முறித்துக்கொள்பவனை நானும் முறித்துக் கொள்வேன்” என்று கூறினான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5989,
			"arabicnumber": 5989,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உறவு (இறையருளின்) ஒரு கிளை யாகும். ஆகவே, “அதனுடன் யார் ஒட்டி வாழ்கின்றாரோ அவருடன் நானும் உறவு பாராட்டுவேன். அதை யார் முறித்துக்கொள்கிறாரோ அவரை நானும் முறித்துக்கொள்வேன்” (என்று உறவைப் படைத்தபோது இறைவன் சொன்னான்). இதை நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5990,
			"arabicnumber": 5990,
			"text": "அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: இன்னாரின் தந்தையின் குடும்பத்தார் என் நேசர்கள் அல்லர்; என் நேசர்கள் யாரெனில், அல்லாஹ்வும் நல்ல இறைநம்பிக்கையாளர்களும்தான்” என நபி (ஸல்) அவர்கள் ஒளிவு மறைவின்றி பகிரங்கமாகவே கூறினார்கள். “முஹம்மத் பின் ஜஅஃபர் (ரஹ்) அவர்களின் (மூலநூல்) பிரதியொன்றில் ‘இன்னார்’ எனும் (சொல் உள்ள) இடம் (நிரப்பப்படாமல்) வெற்றிடமாக உள்ளது” என அறிவிப்பாளர் அம்ர் பின் அப்பாஸ் (ரஹ்) அவர்கள் கூறுகிறார்கள். அம்ர் பின் அல்ஆஸ் (ரலி) அவர்களின் வழியாக வரும் அன்பசா பின் அப்தில் வாஹித் (ரஹ்) அவர்களது அறிவிப்பில், நபி (ஸல்) அவர்கள், “ஆயினும் அவர்களுடன் எனக்கு இரத்த உறவு உண்டு. அதை நான் (காய்ந்து போகவிடாமல்) பசுமையாக்குவேன்” என்று கூறினார்கள் எனும் கூடுதல் தகவல் இடம்பெற்றுள்ளது. அதாவது, “அவர்களின் உறவைப் பேணி நடந்து கொள்வேன்” என்றார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5991,
			"arabicnumber": 5991,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: பதிலுக்குப் பதில் உறவாடுகின்றவர் (உண்மையில்) உறவைப் பேணுகின்றவர் அல்லர்; மாறாக உறவு முறிந்தாலும் அந்த உறவுடன் இணைகின்றவரே உறவைப் பேணுபவர் ஆவார்.19 இதை அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. இதன் அறிவிப்பாளர்களில் சிலர் இதை அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்களின் பொன்மொழி என்றும், வேறுசிலர் நபி (ஸல்) அவர்களின் பொன்மொழி என்றும் கூறுகிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5992,
			"arabicnumber": 5992,
			"text": "ஹகீம் பின் ஹிஸாம் (ரலி) அவர்கள் கூறியதாவது: நான், “அல்லாஹ்வின் தூதரே! நான் (இஸ்லாத்தை ஏற்பதற்கு முன்பு) அறியாமைக் காலத்தில் உறவைப் பேணுதல், அடிமைகளை விடுதலை செய்தல், தானதர்மம் செய்தல் ஆகிய நற்செயல்களைப் புரிந்துள்ளேன். அவற்றுக்கு (மறுமையில்) எனக்கு நற்பலன் ஏதும் உண்டா? கூறுங்கள்!” என்று கேட்டேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “நீர் முன்னர் செய்த நற்செயல்(களுக்குரிய நற்பலன்)களுடனேயே இஸ்லாத்தைத் தழுவியுள்ளீர்” என்று பதிலளித்தார்கள்.20 இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் சிலவற்றில் ‘நற்செயல்’ என்பதைக் குறிக்க மூலத்தில் ‘தஹன்னுஸ்’ என்றும், வேறுசிலவற்றில் ‘தஹன்னுத்’ என்றும் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5993,
			"arabicnumber": 5993,
			"text": "உம்மு காலித் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நான் என் தந்தையுடன் மஞ்சள்நிறச் சட்டை ஒன்றை அணிந்து கொண்டு சென்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(இது) நன்றாயிருக்கிறதே! (இது) நன்றாயிருக்கிறதே!” என்று (என் சட்டை குறித்துச்) சொன்னார்கள். நான் (நபி (ஸல்) அவர்களின் இரு புஜங்களுக்கிடையே இருந்த) நபித்துவ முத்திரையில் விளையாடத் தொடங்கி னேன். உடனே, என் தந்தை என்னை அதட்டினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(குழந்தைதானே!) அவளை (விளையாட) விடுவீராக!” என்று கூறினார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(இந்தச் சட்டையை) நீ (பழையதாக்கிக்) கிழித்து நைந்துபோகச் செய்துவிடு. பிறகும் (அதைக்) கிழித்து நைந்துபோகச் செய்துவிடு. மீண்டும் அதை (பழையதாக்கிக்) கிழித்து நைந்துபோகச் செய்துவிடு” என்று (எனது நீண்ட ஆயுளுக்காகப் பிரார்த்தித்துக்) கூறினார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) அப்துல்லாஹ் பின் அல்முபாரக் (ரஹ்) அவர்கள், “(அந்தச் சட்டை நிறம் மாறி பழுப்பேறி மக்கள்) பேசும் அளவுக்கு உம்மு காலித் (ரலி) அவர்கள் நெடுங்காலம் வாழ்ந்தார்கள்” என்று கூறுகிறார்கள்.21 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5994,
			"arabicnumber": 5994,
			"text": "அப்துர் ரஹ்மான் பின் அபீநுஅம் (ரஹ்) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களுடன் இருந்தேன். அப்போது அவர்களிடம் ஒரு மனிதர், “(இஹ்ராம் கட்டியவர்) கொசுக்களைக் கொன்றுவிட்டால் பரிகாரம் என்ன?” என்று கேட்டார். அப்போது அப்துல் லாஹ் பின் உமர் (ரலி) அவர்கள், “நீங்கள் எந்த நாட்டைச் சேர்ந்தவர்?” என்று கேட்டார்கள். அவர், “நான் இராக்வாசி” என்று பதிலளித்தார். அதற்கு அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் (தம்மருகில் இருந்தவர்களிடம்), “இவரைப் பாருங்கள். கொசுக்களைக் கொன்றால் பரிகாரம் என்ன என்று இவர் என்னிடம் கேட்கிறார். ஆனால், (இராக்வாசிகளான) இவர்களோ நபி (ஸல்) அவர்களுடைய (புதல்வி ஃபாத்திமா (ரலி) அவர்களுடைய) புதல்வரைக் கொன்றுவிட்டார்கள். (ஆனால்) நபி (ஸல்) அவர்கள், “(ஹசன், ஹுசைன் ஆகிய) அவர்கள் இருவரும் உலகின் இரு துளசி மலர்கள் ஆவர்” என்று (பாராட்டிக்) கூறக் கேட்டேன்” என்று சொன்னார்கள்.23 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5995,
			"arabicnumber": 5995,
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: என்னிடம் ஏதேனும் (தரும்படி) கேட்டு ஒரு பெண்மணி வந்தார். அவருடன் இரு பெண் குழந்தைகள் இருந்தனர். அப்போது ஒரே ஒரு பேரீச்சம்பழத்தை தவிர வேறெதுவும் அவருக்கு என்னிடம் கிடைக்கவில்லை. ஆகவே, நான் அதை அவருக்குக் கொடுத்தேன். உடனே அதனை அவர் இரண்டாகப் பிட்டு குழந்தைகள் இருவருக்கும் பங்கிட்டுக் கொடுத்தார். பிறகு அப்பெண்மணி எழுந்து சென்றுவிட்டார். பின்னர் நபி (ஸல்) அவர்கள் வந்தார்கள். அவர்களிடம் இதுபற்றி நான் சென்னேன். அதற்கு நபி (ஸல்) அவர்கள், “யார் இந்தப் பெண் குழந்தைகளில் ஒன்றுக்குப் பொறுப்பேற்று நன்மை புரிவாரோ அவருக்கு அந்தக் குழந்தைகள் நரகத்திலிருந்து தடுக்கும் திரையாக இருப்பார்கள்” என்றார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5996,
			"arabicnumber": 5996,
			"text": "அபூகத்தாதா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தமது தோளின் மீது (சிறுமி) உமாமா பின்த் அபில் ஆஸை அமர்த்தியவாறு எங்களிடையே வந்து அப்படியே (எங்களுக்கு இமாமாக நின்று) தொழுவித்தார்கள். அவர்கள் ருகூஉ செய்யும்போது உமாமாவைக் கீழிறக்கிவிட்டார்கள். (சஜ்தாவிலிருந்து நிலைக்கு) உயரும்போது அவரை மீண்டும் (தோளில்) ஏற்றிக்கொண்டார்கள்.24 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5997,
			"arabicnumber": 5997,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் பேரரான) ஹசன் பின் அலீயை முத்தமிட்டார்கள். அப்போது அவர்கள் அருகில் அமர்ந்துகொண்டிருந்த அக்ரஉ பின் ஹாபிஸ் அத்தமீமீ (ரலி) அவர்கள், “எனக்குப் பத்துக் குழந்தைகள் இருக்கின்றார்கள். அவர்களில் ஒருவரைக் கூட நான் முத்தமிட்டதில்லை” என்றார். அவரை ஏறெடுத்துப் பார்த்த அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் “அன்பு காட்டாதவர் அன்பு காட்டப்படமாட்டார்” என்று கூறினார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5998,
			"arabicnumber": 5998,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு கிராமவாசி நபி (ஸல்) அவர்களிடம் வந்து, “நீங்கள் சிறு குழந்தைகளை முத்தமிடுகின்றீர்களா? நாங்களெல்லாம் அவர்களை முத்தமிடுவதில்லை” என்றார். அதற்கு நபி (ஸல்) அவர்கள், “அல்லாஹ் உமது இதயத்திலிருந்து அன்பைக் கழற்றிவிட்ட பின்னர் உமக்காக நான் என்ன செய்ய முடியும்?” என்று கேட்டார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5999,
			"arabicnumber": 5999,
			"text": "உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் கூறியதாவது: (ஹவாஸின் குலத்தைச் சேர்ந்த) கைதிகள் சிலர் நபி (ஸல்) அவர்களிடம் வந்தார்கள். அவர்களிடையே இருந்த ஒரு பெண்ணின் மார்பில் பால் சுரந்தது. அவள் பாலூட்டுவதற்காக(த் தன் குழந்தையைத் தேடினாள். குழந்தை கிடைக்கவில்லை. எனவே), கைதிகளில் எந்தக் குழந்தையைக் கண்டாலும், அதை (வாரி) எடுத்து(ப் பாலூட்டினாள். தன் குழந்தை கிடைத்தவுடன் அதை எடுத்து)த் தன் வயிற்றோடு அணைத்துப் பாலூட்டலானாள். அப்போது எங்களிடம் நபி (ஸல்) அவர்கள், “இந்தப் பெண் தன் குழந்தையை தீயில் எறிவாளா? சொல்லுங்கள்!” என்றார்கள். நாங்கள், “இல்லை, எந்நிலையிலும் அவளால் எறிய முடியாது” என்று சொன்னோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இந்தக் குழந்தையின் மீது இவளுக்குள்ள அன்பைவிட அல்லாஹ் தன் அடியார்கள்மீது மிகவும் அன்பு வைத்துள்ளான்” என்று சொன்னார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6000,
			"arabicnumber": 6000,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் அன்பை நூறாகப் பங்கிட்டான். அதில் தொண்ணூற்று ஒன்பது பங்கைத் தன்னிடம் வைத்துக் கொண்டான். (மீதியிருக்கும்) ஒன்றையே பூமியில் இறக்கினான். இந்த ஒரு பங்கினால்தான் படைப்பினங்கள் பரஸ்பரம் பாசம்காட்டுகின்றன. எந்த அளவுக்கென்றால், மிதித்துவிடுவோமோ என்ற அச்சத்தால் குதிரை தனது குட்டியைவிட்டுக் கால்குளம்பைத் தூக்கிக் கொள்கிறது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6001,
			"arabicnumber": 6001,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நான், “அல்லாஹ்வின் தூதரே! பாவங்களிலேயே மிகப் பெரியது எது?” என்று கேட்டேன். “உன்னைப் படைத்த இறைவனுக்கே நீ இணைகற்பிப்பது ஆகும்” என்று பதிலளித்தார்கள். “பிறகு எது?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “உன் குழந்தை உன்னுடன் (அமர்ந்து உன் உணவைப் பங்குபோட்டு) உண்ணும் என அஞ்சி அதை நீயே கொலை செய்வது” என்று சொன்னார்கள். நான், “பிறகு எது?” என்றேன். “உன் அண்டை வீட்டுக்காரனின் மனைவியுடன் நீ விபசாரம் புரிவது” என்றார்கள். நபி (ஸல்) அவர்களின் இக்கூற்றை மெய்ப்பிக்கும் வகையில், “அவர்கள் அல்லாஹ்வுடன் வேறெந்தத் தெய்வத்தையும் அழைக்கமாட்டார்கள்” என்று தொடங்கும் (25:68 ஆவது) வசனத்தை அல்லாஹ் அருளினான்.25 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6002,
			"arabicnumber": 6002,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரு சிறு குழந்தையைத் தமது மடியில் வைத்து இனிப்புப் பொருளை மென்று அதன் வாயிலிட்டுக்கொண்டிருந்தார்கள். அப்போது அவர்கள்மீது அந்தக் குழந்தை சிறுநீர் கழித்துவிட்டது. ஆகவே, அவர்கள் தண்ணீர் கொண்டுவரச்சொல்லி அதன்மீது ஊற்றச்செய்தார்கள்.26 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6003,
			"arabicnumber": 6003,
			"text": "நபி (ஸல்) அவர்களின் வளர்ப்புப் பேரரான) உசாமா பின் ஸைத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (சிறுவனாக இருந்த) என்னைப் பிடித்துத் தமது ஒரு தொடையின் மீதும் (தம் சொந்தப் பேரரான) ஹசன் பின் அலீ (ரலி) அவர்களைப் பிடித்து தமது இன்னொரு தொடையின் மீதும் அமர்த்திக்கொண்டு பிறகு எங்கள் இருவரையும் கட்டியணைத்த வாறு, “இறைவா! இவர்கள் இருவர்மீதும் நான் அன்பு செலுத்துகிறேன். நீயும் இவர்கள்மீது அன்பு செலுத்துவாயாக!” என்றார்கள்.27 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. (இதன் அறிவிப்பாளர்களில் ஒருவரான) சுலைமான பின் தர்கான் அத்-தைமீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: (நான் இந்த ஹதீஸை அபூஉஸ்மான் அந்நஹ்தீ (ரஹ்) அவர்களிடமிருந்து அபூதமீமா பின் முஜாலித் (ரஹ்) அவர்கள் வாயிலாகக் கேட்டேனா; அல்லது நேரடியாக அபூஉஸ்மானிடமே கேட்டேனா என) இந்த ஹதீஸ் விஷயத்தில் எனக்குச் சந்தேகம் இருந்தது. இந்நிலையில் இத்தனை முறை இதை அறிவித்துவிட்டோமே என்று (மனத்துக்குள்) சொல்லிக் கொண்டேன். பின்னர் (எடுத்துப்) பார்த்தபோது அபூஉஸ்மானிடமிருந்து (நேரடியாக) நான் கேட்டவற்றில் இதுவும் பதிவு செய்யப்பட்டிருந்ததைக் கண்டேன். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6004,
			"arabicnumber": 6004,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: கதீஜா (ரலி) அவர்களின் மீது நான் ரோஷம்கொண்டதைப் போன்று நபி (ஸல்) அவர்களின் துணைவியரில் வேறெவரின் மீதும் நான் ரோஷம் கொண்டதில்லை. ஏனெனில், கதீஜா (ரலி) அவர்களை நபி (ஸல்) அவர்கள் (அடிக்கடி) நினைவு கூர்வதை நான் கேட்டுவந்தேன். -என்னை நபி (ஸல்) அவர்கள் மணம் புரிந்துகொள்வதற்கு மூன்று வருடங்களுக்கு முன்பே கதீஜா இறந்துவிட்டிருந்தார்.- மேலும், முத்துமாளிகை ஒன்று சொர்க்கத்தில் கதீஜாவுக்குக் கிடைக்க வுள்ளது என்று அவர்களுக்கு நற்செய்தி சொல்லும்படி நபி (ஸல்) அவர்களுக்கு அவர்களுடைய இறைவன் கட்டளை யிட்டிருந்தான். இன்னும் நபி (ஸல்) அவர்கள் ஆட்டை அறுத்து (அதன் இறைச்சியில்) சிறிதளவை கதீஜா (ரலி) அவர்களின் தோழியரிடையே அன்பளிப்பாகப் பங்கிட்டுவிடுவார்கள்.28 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6005,
			"arabicnumber": 6005,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: ‘நானும் அநாதையின் காப்பாளரும் சொர்க்கத்தில் இப்படி இருப்போம்’ என்று கூறியவாறு நபி (ஸல்) அவர்கள் தம் சுட்டுவிரலாலும் நடுவிரலாலும் (சற்றே இடைவெளி விட்டு) சைகை செய்தார்கள்.29 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6006,
			"arabicnumber": 6006,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: கணவனை இழந்த கைம்பெண்ணுக் காகவும் ஏழைக்காகவும் பாடுபடுகின்றவர் ‘அல்லாஹ்வின் பாதையில் அறப்போர் புரிபவரைப் போன்றவராவார்’ அல்லது ‘இரவில் நின்று வழிபட்டு; பகலில் நோன்பு நோற்பவர் போன்றவராவார்’. இதை ஸஃப்வான் பின் சுலைம் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இதே ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்து மற்றோர் அறிவிப்பாளர்தொடர்வழியாக அறிவிக்கப் பட்டுள்ளது.30 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6007,
			"arabicnumber": 6007,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: கணவனை இழந்த கைம்பெண்ணுக் காகவும் ஏழைக்காகவும் பாடுபடுபவர் ‘அல்லாஹ்வின் பாதையில் அறப்போர் புரிபவரைப் போன்றவராவார்’. அப்துல்லாஹ் அல்கஅனபீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: அல்லது ‘சோர்ந்துவிடாமல் இரவு முழுவதும் நின்று வழிபட்டு, பகல் முழுவதும் விடாது நோன்பு நோற்பவர் போன்றவராவார்’ என்று (நபி (ஸல்) அவர்கள் கூறியதாக) மாலிக் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள் என்றே நான் கருதுகிறேன்.31 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6008,
			"arabicnumber": 6008,
			"text": "அபூசுலைமான் மாலிக் பின் ஹுவைரிஸ் (ரலி) அவர்கள் கூறியதாவது: (பனூ லைஸ் தூதுக்குழுவில்) சம வயதுடைய இளைஞர்களான நாங்கள் நபி (ஸல்) அவர்களிடம் வந்தோம். அவர்களுடன் இருபது நாட்கள் தங்கினோம். நாங்கள் எங்கள் குடும்பத்தாரிடம் (திரும்பிச்) செல்ல ஆசைப்படுவதை அறிந்த நபி (ஸல்) அவர்கள் (ஊரில்) நாங்கள் விட்டுவந்த எங்கள் குடும்பத்தாரைப் பற்றி விசாரித்தார்கள். நாங்கள் அவர்களைப் பற்றித் தெரிவித்தோம். -நபி (ஸல்) அவர்கள் நல்ல தோழராகவும் இரக்க குணமுடையவர்களாகவும் இருந்தார்கள்.- ஆகவே, நபி (ஸல்) அவர்கள், “நீங்கள் உங்கள் குடும்பத்தாரிடம் திரும்பிச் சென்று அவர்களுக்குக் கல்வி கற்றுக்கொடுங்கள். அவர்களை (கடமையானவற்றைச் செய்யுமாறு) பணியுங்கள். என்னை எவ்வாறு தொழக் கண்டீர்களோ அவ்வாறே தொழுங்கள். தொழுகை நேரம் வந்ததும் உங்களில் ஒருவர் தொழுகை அறிவிப்புச் செய்யட்டும்; பிறகு உங்களில் (வயதில்) மூத்தவர் உங்களுக்குத் தொழுவிக்கட்டும்” என்றார்கள்.32 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6009,
			"arabicnumber": 6009,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: “ஒரு மனிதர் ஒரு பாதையில் நடந்து சென்றுகொண்டிருந்தபோது அவருக்குக் கடுமையான தாகம் ஏற்பட்டது. அவர் (வழியில்) ஒரு கிணற்றைக் கண்டார். உடனே அதில் இறங்கித் தண்ணீர் அருந்தினார். பிறகு (கிணற்றிலிருந்து) அவர் வெளியே வந்தார். அப்போது நாய் ஒன்று தாகத்தால் (தவித்து) நாக்கைத் தொங்கவிட்டபடி ஈரமண்ணை நக்கிக் கொண்டிருப்பதைக் கண்டார். அந்த மனிதர் (தம் மனத்திற்குள்) ‘எனக்கு ஏற்பட்டதைப் போன்ற(அ)தே (கடுமையான தாகம்) இந்த நாய்க்கும் ஏற்பட்டிருக்கின்றது போலும்’ என்று சொல்லிக்கொண்டார். உடனே (மீண்டும்) அக்கிணற்றில் இறங்கி (தண்ணீரைத் தோலால் ஆன) தனது காலுறையில் நிரப்பிக்கொண்டு அதைத் தமது வாயால் கவ்வியபடி (மேலேறி வந்து) அந்த நாய்க்குப் புகட்டினார். அல்லாஹ் இதற்கு நன்றியாக அவரை (அவருடைய பாவங்களை) மன்னித்தான்” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். (இதைச் செவியுற்ற) மக்கள், “அல்லாஹ்வின் தூதரே! மிருகங்களுக்கு உதவும் விஷயத்திலும் எங்களுக்கு (மறுமையில்) நற்பலன் கிடைக்குமா?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “(ஆம்;) உயிருடைய பிராணி ஒவ்வொன்றின் விஷயத்திலும் (அதற்கு உதவி செய்யும்பட்சத்தில் மறுமையில்) அதற்கான நற்பலன் கிடைக்கும்” என்று சொன்னார்கள்.33 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6010,
			"arabicnumber": 6010,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையில் நின்றார் கள். அவர்களுடன் நாங்களும் நின்றோம். அப்போது தொழுகையில் ஈடுபட்டிருந்த ஒரு கிராமவாசி, “இறைவா! எனக்கும் முஹம்மது அவர்களுக்கும் (மட்டும்) அருள் புரிவாயாக! எங்களுடன் வேறு யாருக்கும் அருள் புரியாதே!” என்று பிரார்த்தித்தார். (தொழுது முடித்து) நபி (ஸல்) அவர்கள் சலாம் கொடுத்தபோது அந்தக் கிராமவாசியிடம், “விசாலமானதை, அதாவது இறைவனின் அருளை நீ குறுக்கிவிட்டாயே!’ என்று சொன்னார் கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6011,
			"arabicnumber": 6011,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவருக்கொருவர் கருணை புரிவதிலும், அன்புசெலுத்துவதிலும், இரக்கம்காட்டுவதிலும் (உண்மையான) இறைநம்பிக்கையாளர்களை ஓர் உடலைப் போன்று நீ காண்பாய். (உடலின்) ஓர் உறுப்பு சுகவீனமடைந்தால் அதனுடன் மற்ற உறுப்புகளும் (சேர்ந்துகொண்டு) உறங்காமல் விழித்துக்கொண்டிருக்கின் றன. அத்துடன் (உடல் முழுதும்) காய்ச்சலும் கண்டுவிடுகிறது. இதை நுஅமான் பின் பஷீர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6012,
			"arabicnumber": 6012,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிம் மரம் ஒன்றை நட்டு அதிலிருந்து ஒரு மனிதனோ அல்லது (மற்ற) உயிரினமோ உண்டால் (அதன் காரணத்தால்) ஒரு தர்மம் செய்ததற்கான பிரதிபலன் அவருக்குக் கிடைக்காமல் இருப்பதில்லை. இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.34 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6013,
			"arabicnumber": 6013,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (படைப்பினங்கள்மீது) கருணை காட்டாதவர் (படைத்தவனால்) கருணை காட்டப்படமாட்டார். இதை ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6014,
			"arabicnumber": 6014,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அண்டை வீட்டார் குறித்து என்னி டம் (வானவர்) ஜிப்ரீல் அறிவுறுத்திக் கொண்டேயிருந்தார். எந்த அளவுக் கென்றால், (எங்கே) அண்டை வீட்டாரை எனக்கு வாரிசாக்கிவிடுவாரோ என்றுகூட நான் எண்ணினேன்.35 இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6015,
			"arabicnumber": 6015,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அண்டை வீட்டார் குறித்து என்னிடம் (வானவர்) ஜிப்ரீல் (அவ்வப்போது) அறிவுறுத்திக் கொண்டேயிருந்தார். எந்த அளவுக்கென்றால், (எங்கே) அண்டை வீட்டாரை எனக்கு வாரிசாக்கிவிடுவாரோ என்றுகூட நான் எண்ணினேன். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6016,
			"arabicnumber": 6016,
			"text": "அபூஷுரைஹ் (ரலி) அவர்கள் கூறியதாவது: “அல்லாஹ்வின் மீதாணையாக! அவன் இறைநம்பிக்கையாளன் அல்லன். அல்லாஹ்வின் மீதாணையாக! அவன் இறைநம்பிக்கையாளன் அல்லன். அல்லாஹ்வின் மீதாணையாக! அவன் இறைநம்பிக்கையாளன் அல்லன்” என்று (மூன்று முறை) நபி (ஸல்) அவர்கள் கூறினார்கள். “அவன் யார்? அல்லாஹ்வின் தூதரே!” என்று கேட்கப்பட்டது. அதற்கு நபி (ஸல்) அவர்கள் “எவனுடைய நாசவேலைகளிலிருந்து அவனுடைய அண்டை வீட்டார் பாதுகாப்பு உணர்வைப் பெறவில்லையோ அவன்தான்” என்று பதிலளித்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. இதே ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்து நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6017,
			"arabicnumber": 6017,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: “முஸ்லிம் பெண்களே! (உங்களில்) எந்தப் பெண்ணும் தன் அண்டை வீட்டுக்காரிக்கு ஓர் ஆட்டின் கால்குளம்பை (அன்பளிப்பாக) அளித்தாலும் அதை அற்பமாகக் கருத வேண்டாம்” என்று நபி (ஸல்) அவர்கள் கூறுவார்கள்.36 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6018,
			"arabicnumber": 6018,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் தம் அண்டை வீட்டாருக்குத் தொல்லை தரவேண்டாம். அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் தம் விருந்தாளியைக் கண்ணியப்படுத்தட்டும். அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் (ஒன்று) நல்லதைப் பேசட்டும். அல்லது வாய்மூடி இருக்கட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6019,
			"arabicnumber": 6019,
			"text": "அபூஷுரைஹ் அல்அதவீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பேசியபோது என் காதுகளால் கேட்டேன்; என் கண்களால் பார்த்தேன். அப்போது அவர்கள், “அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் தம் அண்டை வீட்டாரைக் கண்ணியப்படுத்தட்டும். அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் தம் விருந்தாளிக் குத் தமது கொடையைக் கண்ணியமாக வழங்கட்டும்” என்று கூறினார்கள். அப்போது, “அல்லாஹ்வின் தூதரே! அவருடைய கொடை என்ன?” என்று கேட்கப்பட்டது. அதற்கு அவர்கள், “(அவருடைய கொடை) ஒரு பகல் ஓர் இரவு (உபசரிப்பது) ஆகும். விருந்தோம்பல் மூன்று தினங்களாகும். அதற்குமேல் (அளிக்கும் உணவும் உபசரிப்பும்) அவருக்குத் தர்மமாக அமையும். மேலும், அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் (ஒன்று) நல்லதைப் பேசட்டும். அல்லது வாய்மூடி இருக்கட்டும்” என்று கூறினார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6020,
			"arabicnumber": 6020,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான், “அல்லாஹ்வின் தூதரே! எனக்கு இரண்டு அண்டை வீட்டார் உள்ளனர். அவர்களில் யாருக்கு நான் அன்பளிப்புச் செய்வது?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “இருவரில் யாருடைய வீட்டு வாசல் உனக்கு நெருக்கமாக இருக்கிறதோ அவருக்கு” என்று பதிலளித்தார்கள்.37 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6021,
			"arabicnumber": 6021,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: எல்லா நற்கர்மமும் தர்மமே.38 இதை ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6022,
			"arabicnumber": 6022,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: “தர்மம் செய்வது எல்லா முஸ்லிமின் மீதும் கடமையாகும்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். மக்கள், “(தர்மம் செய்ய ஏதும்) கிடைக்கவில்லையானால்?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “தம் இரு கைகளால் உழைத்துத் தாமும் பயனடைவார்; தர்மம் செய்(து பிறரையும் பயனடையச் செய்)வார்” என்று சொன்னார்கள். மக்கள், “ ‘அவருக்கு (உழைக்க உடலில்) தெம்பு இல்லையானால்’ அல்லது ‘அதை அவர் செய்யாவிட்டால்’ (என்ன செய்வது?)” என்று கேட்டனர். நபி (ஸல்) அவர்கள், “பாதிக்கப்பட்ட தேவையாளிக்கு அவர் உதவட்டும்” என்றார்கள். மக்கள், “(இதை இயலாமையாலோ சோம்பóனாலோ) அவர் செய்யவில்லையானால் (என்ன செய்வது?)” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “அப்போது ‘நல்லதை’ அல்லது ‘நற்கர்மத்தை’(ச் செய்யும்படி பிறரை) அவர் ஏவட்டும்” என்றார்கள். “(இதையும்) அவர் செய்யாவிட்டால்?” என்று கேட்டதற்கு, நபி (ஸல்) அவர்கள், “அவர் தீங்கு செய்யாமல் இருக்கட்டும். அதுவே அவருக்குத் தர்மம் ஆகும்” என்றார்கள்.39 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6023,
			"arabicnumber": 6023,
			"text": "அதீ பின் ஹாத்திம் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) நபி (ஸல்) அவர்கள் நரகத்தைப் பற்றிக் குறிப்பிட்டார்கள். அப்போது அதைவிட்டு அல்லாஹ்விடம் பாதுகாப்புக் கோரினார்கள். அப்போது தமது முகத்தைத் திருப்பிக்கொண்டார்கள். பிறகும் நரகத்தைப் பற்றிக் குறிப்பிட்டார்கள். அப்போதும் அதைவிட்டு அல்லாஹ்விடம் பாதுகாப்புக் கோரினார்கள். அப்போதும் தமது முகத்தைத் திருப்பிக் கொண்டார்கள். பிறகு, “பேரீச்சம்பழத்தின் ஒரு துண்டைத் தர்மம் செய்தேனும் நரகத்திலிருந்து உங்களைக் காப்பாற்றிக்கொள்ளுங்கள். அதுவும் இல்லையானால் இன் சொல்லைக் கொண்டாவது (காப்பாற்றிக்கொள்ளுங்கள்)” என்றார்கள். அறிவிப்பாளர் ஷுஅபா (ரஹ்) அவர்கள், “(நபியவர்கள் நரகத்தைப் பற்றி) இருமுறை (குறிப்பிட்டார்கள்) என்பதில் சந்தேகமில்லை. (மூன்றாவது முறை குறிப்பிட்டார்களா என்பதில்தான் சந்தேகம் உள்ளது)” என்று கூறினார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6024,
			"arabicnumber": 6024,
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: யூதர்களில் ஒரு குழுவினர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, ‘அஸ்ஸாமு அலைக்கும்’ (உங்களுக்கு மரணம் உண்டாகட்டும்) என்று (சற்றே மாற்றி சலாம்) கூறினர். அவர்கள் கூறியதைப் புரிந்துகொண்ட நான் அவர்களுக்கு “வ அலைக்கும் அஸ்ஸாமு வல்லஅனா (அவ்வாறே உங்கள்மீது மரணமும் சாபமும் உண்டாகட்டும்)” என்றேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “ஆயிஷா! நிதானம்! எல்லா விஷயங்களிலும் நளினத்தைக் கையாளுவதையே அல்லாஹ் விரும்புகிறான்” என்று சொன்னார்கள். அப்போது நான், “அல்லாஹ்வின் தூதரே! அவர்கள் சொன்னதை நீங்கள் கேட்கவில் லையா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “நான்தான் ‘வ அலைக்கும்’ (அவ்வாறே உங்களுக்கு உண்டாகட்டும்) என்று சொல்லிவிட்டேனே! (அதை நீ கவனிக்கவில்லையா?)” என்று கேட்டார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6025,
			"arabicnumber": 6025,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஒரு கிராமவாசி பள்ளிவாசலினுள் சிறுநீர் கழித்தார். அவரை நோக்கி நபித்தோழர்கள் (வேகத்துடன்) எழுந்தனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் “(அவர் சிறுநீர் கழிப்பதை) இடைமறிக்காதீர்கள்” என்று கூறிவிட்டுப் பிறகு ஒரு வாளியில் தண்ணீர் கொண்டுவரச் சொன்னார்கள். பிறகு (தண்ணீர் கொண்டுவரப்பட்டு) அது சிறுநீர்மீது ஊற்றப்பட்டது.41 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6027,
			"arabicnumber": 6027,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6028,
			"arabicnumber": 6028,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: ‘யாசகர்’ அல்லது ‘தேவையுடையவர்’ எவரேனும் நபி (ஸல்) அவர்களிடம் வந்தால் நபியவர்கள் (தம் தோழர்களை நோக்கி, “இவருக்காக என்னிடம்) பரிந்துரை செய்யுங்கள். அதனால் உங்களுக்கும் நற்பலன் வழங்கப்படும்; அல்லாஹ் தன் தூதருடைய நாவால் தான் நாடியதை நிறைவேற்றுவானாக” என்று கூறுவார்கள்.44 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6029,
			"arabicnumber": 6029,
			"text": "மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: முஆவியா (ரலி) அவர்களுடன் (இராக்கிலுள்ள) கூஃபா நகருக்கு வந்திருந்த அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்களிடம் நாங்கள் சென்றோம். அப்போது அவர்கள், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை நினைவுகூர்ந்து, “அவர்கள் இயற்கையாகவும் அருவருப் பாகப் பேசுபவராக இருக்கவில்லை; செயற்கையாகவும் அருவருப்பாகப் பேசுபவராக இருக்கவில்லை” என்று கூறிவிட்டு, “நற்குணமுடையவரே உங்களில் மிகவும் சிறந்தவர்” என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொன்னார்கள் என்றும் கூறினார்கள்.45 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6030,
			"arabicnumber": 6030,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: யூதர்கள் (சிலர்) நபி (ஸல்) அவர்களிடம் வந்து அஸ்ஸாமு அலைக்கும் (உங்களுக்கு மரணம் நேரட்டும்) என்று (முகமன்) கூறினர். உடனே நான், “(அது) உங்களுக்கு நேரட்டும். மேலும், அல்லாஹ் தனது கருணையிலிருந்து உங்களை அப்புறப்படுத்தி உங்கள்மீது அல்லாஹ் கோபம் கொள்ளட்டும்” என்று (அவர்களுக்குப் பதில்) சொன்னேன். (அப்போது) நபி (ஸல்) அவர்கள், “ஆயிஷா! நிதானம்! (எதிலும்) நளினமாக நடந்துகொள். மேலும், வன்மையுடன் நடந்துகொள்வதிலிருந்தும் அருவருப்பாகப் பேசுவதிலிருந்தும் உன்னை நான் எச்சரிக்கிறேன்” என்று சொன்னார்கள். அப்போது நான், “அவர்கள் சொன்னதை நீங்கள் செவியேற்கவில்லையா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “நான் (அவர்களுக்கு) அளித்த பதிலை நீ கேட்கவில்லையா? (‘அஸ்ஸாமு’ எனும் சொல்லைத் தவிர்த்து ‘வ அலைக்கும்’- அவ்வாறே உங்கள்மீது உண்டாகட்டும் என்று) அவர்களுக்கு நான் பதிலளித்து விட்டேன். அவர்களுக்காக நான் செய்த பிரார்த்தனை ஏற்றுக்கொள்ளப்படும். எனக்காக அவர்கள் செய்த பிரார்த்தனை ஏற்றுக்கொள்ளப்படாது” என்று சொன்னார் கள்.46 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6031,
			"arabicnumber": 6031,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஏசுபவராகவோ, கெட்ட வார்த்தைகள் பேசுபவராகவோ சாபமிடுபவராகவோ இருக்கவில்லை. எங்களில் ஒருவரைக் கண்டிக்கும்போது கூட “அவருக்கென்ன நேர்ந்தது? அவருடைய நெற்றி மண்ணில் படட்டும்” என்றே கூறுவார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6032,
			"arabicnumber": 6032,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் (வீட்டுக்குள் வர) அனுமதி கேட்டார். அவரைக் கண்ட நபி (ஸல்) அவர்கள், “இவர் அந்தக் கூட்டத்தாரிலேயே மிகவும் தீயவர்” என்று (என்னிடம்) சொன்னார்கள். அவர் வந்து அமர்ந்தபோது அவரிடம் நபி (ஸல்) அவர்கள் மலர்ந்த முகத்துடன் இதமாக நடந்துகொண்டார்கள். அந்த மனிதர் (எழுந்து) சென்றதும் நான் (நபி (ஸல்) அவர்களிடம்), “அல்லாஹ்வின் தூதரே! அந்த மனிதரைக் கண்டதும் தாங்கள் இவ்வாறு இவ்வாறு சொன்னீர்கள். பிறகு அவரிடம் மலர்ந்த முகத்துடன் இதமாக நடந்துகொண்டீர்களே” என்று கேட்டேன். அதற்கு அவர்கள், “ஆயிஷா! நான் கடுமையாக நடந்துகொண்டதை நீ எப்போதாவது கண்டுள்ளாயா? எவரது தீங்கை அஞ்சி மக்கள் (அவருடன் இயல் பாகப் பழகாமல்) விட்டுவிடுகிறார்களோ அவரே மறுமை நாளில் அல்லாஹ்விடம் தகுதியில் மிகவும் மோசமானவர் ஆவார்” என்று சொன்னார்கள்.47 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6033,
			"arabicnumber": 6033,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (குணத்தாலும் தோற்றத்தாலும்) மக்களிலேயே மிகவும் அழகானவர்களாகவும் மக்களிலேயே அதிகக் கொடை குணம் கொண்டவர் களாகவும் மக்களிலேயே அதிக வீரமுடையவர்களாகவும் இருந்தார்கள். (ஒருமுறை) மதீனாவாசிகள் இரவு நேரத்தில் (எதிரிகள் படையெடுத்து வருவதாகக் கேள்விப்பட்டு) பீதியடைந் தார்கள். சப்தம் வந்த திசையை நோக்கி மக்கள் நடந்தனர். அப்போது நபி (ஸல்) அவர்கள் மக்களை எதிர்கொண்டார்கள். சப்தம் வந்த திசையை நோக்கி மக்களுக்கு முன்பே நபி (ஸல்) அவர்கள் சென்றுவிட்டிருந்தார்கள். அப்போது நபி (ஸல்) அவர்கள் தமது கழுத்தில் வாளைத் தொங்கவிட்டபடி அபூதல்ஹா (ரலி) அவர்களது சேணம் பூட்டப்படாத வெற்றுடலான குதிரையின் மீது அமர்ந்த வண்ணம், “பீதியடையாதீர்கள். பீதியடையாதீர்கள்” என்று (மக்களைப் பார்த்துச்) சொன்னார்கள். பிறகு, “ ‘(தங்கு தடையின்றி) ஓடும் கடலாக இந்தக் குதிரையை நாம் கண்டோம்’ அல்லது ‘இந்தக் குதிரை (தங்கு தடையின்றி) ஓடும் கடல்’ என்று கூறினார்கள்.50 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6034,
			"arabicnumber": 6034,
			"text": "முஹம்மத் பின் முன்கதிர் (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் எது கேட்கப்பட்டாலும் ஒருபோதும் அவர்கள் ‘இல்லை’ என்று சொன்னதில்லை என ஜாபிர் (ரலி) அவர்கள் கூறக் கேட்டேன். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6035,
			"arabicnumber": 6035,
			"text": "மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்களுடன் அமர்ந்திருந்தோம். அவர்கள் எங்களிடம் பேசினார்கள். அப்போது அவர்கள், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இயற்கையாகவும் அருவருப்பாகப் பேசுபவராக இருக்கவில்லை; செயற்கையாகவும் அருவருப்பாகப் பேசுபவராக இருக்க வில்லை. மேலும், நபி (ஸல்) அவர்கள், ‘நற்குணமுடையவரே உங்களில் சிறந்தவர்’ என்று கூறுவார்கள்” என்று சொன்னார்கள்.51 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6036,
			"arabicnumber": 6036,
			"text": "அபூஹாஸிம் சலமா பின் தீனார் (ரஹ்) அவர்கள் கூறியதாவது: “ஒரு பெண்மணி நபி (ஸல்) அவர்களிடம் ‘புர்தா’ (சால்வை) ஒன்றைக் கொண்டுவந்தார்” என்று சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறிவிட்டு, “புர்தா என்றால் என்னவென்று உங்களுக்குத் தெரியுமா?” என மக்களிடம் கேட்டார் கள். அப்போது மக்கள், “அது சால்வை” என்றனர். அப்போது சஹ்ல் (ரலி) அவர்கள், “அது கரைவைத்து நெய்யப்பட்ட சால்வையாகும்” என்று கூறினார்கள். (தொடர்ந்து கூறினார்கள்:) அப்போது அந்தப் பெண்மணி, “இதை நான் உங்களுக்கு அணிவிக்க(வே நெய்து) உள்ளேன்; அல்லாஹ்வின் தூதரே!” என்று கூறினார். அது தேவையாயிருந்ததால் நபி (ஸல்) அவர்கள் அதைப் பெற்றுக்கொண்டார்கள். பிறகு அவர்கள் அதை அணிந்(துகொண்டு வந்)தபோது நபித்தோழர்களில் ஒருவர் அதைப் பார்த்துவிட்டு, “அல்லாஹ்வின் தூதரே! இது மிகவும் அழகாயிருக்கிறதே! இதை அணிந்துகொள்ள எனக்கு கொடுங்களேன்” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “சரி” என்று கூறிவிட்டு அவர்கள் (அதைக் கழற்றுவதற்காக) எழுந்து சென்று விட்டபோது, அந்தத் தோழரிடம் அவருடைய நண்பர்கள், “நீர் செய்தது அழகல்ல; நபி (ஸல்) அவர்களுக்கு அது தேவைப்பட்டதால்தான் அதைப் பெற்றுக்கொண்டார்கள். தம்மிடம் (உள்ள) ஏதேனும் ஒன்று கேட்கப்பட்டு விட்டால் அதை அவர்கள் கொடுக்காமல் இருக்கமாட்டார்கள் என்று தெரிந்து கொண்டே நீர் அவர்களிடம் அதைக் கேட்டுவிட்டீரே” என்று கூறி அவரைக் கண்டித்தனர். அதற்கு அவர், “நபி (ஸல்) அவர்கள் அதை அணிந்ததால் ஏற்பட்ட வளத்தை (பரக்கத்தை) நான் அதில் எதிர்பார்த்தேன்; நான் (இறக்கும்போது) அதில் கஃபனிடப்படலாம் (என்று எண்ணியே அதை நான் கேட்டேன்)” என்று சொன்னார்.52 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6037,
			"arabicnumber": 6037,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(இறுதிக் காலத்தில் மக்களின் ஆயுட்)காலம் குறுகிவிடும்; நற்செயல் குறைந்துவிடும்; (பேராசையின் விளைவாக மக்களின் மனங்களில்) கருமித்தனம் உருவாக்கப்படும். ‘ஹர்ஜ்’ பெருகிவிடும்” என்று சொன்னார்கள். மக்கள், “ஹர்ஜ் என்றால் என்ன?” என்று கேட்டனர். நபி (ஸல்) அவர்கள், “கொலை, கொலை” என்று (இருமுறை) கூறினார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6038,
			"arabicnumber": 6038,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுக்குப் பத்து ஆண்டுகள் சேவகம் புரிந்தேன். (மனம் வேதனைப்படும்படி) என்னை “ச்சீ ‘‘ என்றோ, “(இதை) ஏன் செய்தாய்” என்றோ, “நீ (இப்படிச்) செய்திருக்கக் கூடாதா?” என்றோ அவர்கள் சொன்ன தில்லை. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6039,
			"arabicnumber": 6039,
			"text": "அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: “தம் வீட்டாரிடம் இருக்கும்போது நபி (ஸல்) அவர்கள் என்ன செய்வார்கள்?” என்று நான் (அன்னை) ஆயிஷா (ரலி) அவர்களிடம் கேட்டேன். அவர்கள், “தம் வீட்டாருக்காக (வீட்டு) வேலைகளை நபி (ஸல்) அவர்கள் செய்துவந்தார்கள். தொழுகை (நேரம்) வந்துவிட்டால், தொழுகைக்காக எழுந்து (சென்று) விடுவார்கள்” என்று பதிலளித்தார்கள்.53 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6040,
			"arabicnumber": 6040,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: ஓர் அடியாரை அல்லாஹ் நேசிக்கும்பொழுது (வானவர்) ஜிப்ரீல் (அலை) அவர்களை அவன் அழைத்து, “அல்லாஹ் இன்னாரை நேசிக்கிறான். ஆகவே, நீங்களும் அவரை நேசியுங்கள்” என்று கூறுவான். ஆகவே, அவரை ஜிப்ரீலும் நேசித்துவிட்டு விண்ணகத்தில் வசிப்பவர்களை அழைத்து, “அல்லாஹ் இன்னாரை நேசிக்கிறான். நீங்களும் அவரை நேசியுங்கள்” என்று ஜிப்ரீல் அறிவிப்பார். உடனே விண்ணகத்தாரும் அவரை நேசிப்பார்கள். பிறகு அவருக்குப் பூமியில் வசிப்பவர்களிடமும் அங்கீகாரம் அளிக்கப்படுகிறது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.54 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6041,
			"arabicnumber": 6041,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (மூன்று தன்மைகள் அமையப்பெறாத) எவரும் இறைநம்பிக்கையின் சுவையை உணரமாட்டார். (அவை:) 1. ஒருவரை நேசிப்பதானால் அல்லாஹ்வுக்காகவே நேசிப்பது. 2. இறைமறுப்பிலிருந்து அல்லாஹ் காப்பாற்றியபின் மீண்டும் அதற்குத் திரும்புவதைவிட நெருப்பில் வீசப்படுவதையே விரும்புவது. 3. அல்லாஹ்வும் அவனுடைய தூதரும் மற்றெதையும்விட அவருக்கு அதிக நேசத்திற்குரியோராவது. இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.55 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6042,
			"arabicnumber": 6042,
			"text": "அப்துல்லாஹ் பின் ஸம்ஆ (ரலி) அவர்கள் கூறியதாவது: உடலில் இருந்து வெளியேறும் ஒன்(றான வாயுக் காற்)றைக் கேட்டு எவரும் சிரிப்பதை நபி (ஸல்) அவர்கள் தடை செய்தார்கள். மேலும், (பெண்கள் தொடர்பாக) “நீங்கள் உங்கள் மனைவியை ஏன் காளையை அடிப்பதுபோல் அடிக்கிறீர்கள்? பிறகு நீங்களே அவளை (இரவில்) அணைத்துக்கொள்ள வேண்டிவருமே!” என்றும் சொன்னார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஓர் அறிவிப்பில், “அடிமையை அடிப்பது போல் (ஏன் அடிக்கிறீர்கள்?)” என்று காணப்படுகிறது.56 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6043,
			"arabicnumber": 6043,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மினாவில் (தங்கி யிருந்தபோது ‘துல்ஹிஜ்ஜா’ பத்தாம் நாள் உரையாற்றுகையில்) “மக்களே! இது என்ன நாள் தெரியுமா?” என்று கேட்டார்கள். மக்கள், “அல்லாஹ்வும் அவனுடைய தூதரும்தான் நன்கு அறிந்தவர்கள்” என்றனர். நபி (ஸல்) அவர்கள், “இது புனித நாள்” என்று கூறினார்கள். (பிறகு) “இது எந்த நகரம் தெரியுமா?” என்று கேட்டார்கள். மக்கள், “அல்லாஹ் வும் அவனுடைய தூதருமே நன்கு அறிந்தவர்கள்” என்றனர். நபி (ஸல்) அவர்கள், “இது புனித நகரம்” என்று கூறினார்கள். (பிறகு) “இது என்ன மாதம் தெரியுமா?” என்று கேட்டார்கள். மக்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கு அறிந்தவர்கள்” என்றனர். நபி (ஸல்) அவர்கள், “இது புனித மாதம்” என்று கூறிவிட்டு, “நிச்சயமாக உங்களுடைய இந்த மாதத்தில் உங்களுடைய இந்த நகரத்தில் உங்களுடைய இந்த நாள் எவ்வாறு புனிதம் பெற்றுள்ளதோ அவ்வாறே உங்களின் உயிர்களும் உடைமைகளும் மானமும் உங்களுக்குப் புனிதமானவையாகும்” என்று கூறினார்கள்.57 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6044,
			"arabicnumber": 6044,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ஒரு முஸ்லிமை ஏசுவது பாவமாகும். அவனுடன் போரிடுவது (அல்லது கொலை செய்வது), இறைமறுப்பு (போன்ற பாவச்செயல்) ஆகும்” என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.58 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6045,
			"arabicnumber": 6045,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒருவர் மற்றவரை ‘பாவி’ (ஃபாஸிக்) என்றோ ‘இறைமறுப்பாளன்’ (காஃபிர்) என்றோ அழைத்தால், அவர் (உண்மையில்) அவ்வாறு (பாவியாக, இறைமறுப்பாளராக) இல்லையாயின் அவர் சொன்ன சொல் சொன்னவரை நோக்கியே திரும்பிவிடுகின்றது. இதை அபூதர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6046,
			"arabicnumber": 6046,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: கெட்ட வார்த்தைகள் பேசுபவராகவோ சாபமிடுபவராகவோ ஏசுபவராகவோ அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இருக்கவில்லை. (ஒருவரைக்) கண்டிக்கும் போதுகூட “அவருக்கென்ன நேர்ந்தது? அவருடைய நெற்றி மண்ணில் படட்டும்” என்றே கூறுவார்கள்.59 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6047,
			"arabicnumber": 6047,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் இஸ்லாம் அல்லாத மார்க்கத்தின் மீது சத்தியம் செய்கிறாரோ அவர் தாம் சொன்னதைப் போன்றே ஆகிவிடுகிறார்.60 தனக்கு உடைமையில்லாத ஒன்றில் நேர்ச்சை செய்வது(ம், அந்த நேர்ச்சையை நிறைவேற்றுவதும்) எந்த மனிதனுக்கும் தகாது.61 எதன் மூலம் ஒருவர் தம்மைத்தாமே தற்கொலை செய்துகொள்கின்றாரோ அதன் மூலம் அவர் மறுமை நாளில் வேதனை செய்யப்படுவார். ஓர் இறைநம்பிக்கையாளரை ஒருவர் சபிப்பது அவரைக் கொலை செய்வது போன்றதாகும். யார் ஓர் இறைநம்பிக்கையாளரை இறை மறுப்பாளர் (காஃபிர்) என்று அவதூறு சொல்கிறாரோ அதுவும் அவரைக் கொலை செய்வது போன்றதேயாகும். இதை அந்த மரத்தின்கீழ் (பைஅத்துர் ரிள்வான்) உறுதிமொழி அளித்தவர்களில் ஒருவரான ஸாபித் பின் ளஹ்ஹாக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6048,
			"arabicnumber": 6048,
			"text": "சுலைமான் பின் ஸுரத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் அருகில் இரண்டுபேர் ஒருவரையொருவர் ஏசிக் கொண்டனர். அவர்களில் ஒருவருக்கு மிகக் கடுமையான கோபம் ஏற்பட்டு அவரது முகம் புடைத்து, நிறம் மாறிவிட்டது. அப்போது நபி (ஸல்) அவர்கள், “எனக்கு ஒரு (பிரார்த்தனை) வார்த்தை தெரியும். அதை இவர் சொல்வாராயின் இவருக்கு ஏற்பட்டிருக்கக்கூடிய (கோபமான)து போய்விடும்” என்று சொன்னார்கள். (இதைக் கேட்டுக்கொண்டிருந்தவர்களில்) ஒருவர் (கோபத்திலிருந்த) அந்த மனிதரை நோக்கி நடந்து, நபி (ஸல்) அவர்கள் கூறியதை எடுத்துக்கூறி, “ஷைத்தானிடமிருந்து அல்லாஹ்விடம் பாதுகாப்புக் கோரு” என்றார். அதற்கு அம்மனிதர் “(கவலைப்படும்படி) பிணி ஏதேனும் எனக்கு ஏற்பட்டுவிட்டதாக நினைக்கிறீரா? நான் என்ன பைத்தியக் காரனா? (உமது வேலையைக் கவனிக் கச்) செல்!” என்றார்.62 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6049,
			"arabicnumber": 6049,
			"text": "உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ரமளானில் வரும்) ‘லைலத்துல் கத்ர்’ (கண்ணியமிக்க இரவு) பற்றி (அது ரமளான் மாதத்தில் எந்த இரவு என்று) மக்களுக்குத் தெரிவிப்பதற்காக (தமது வீட்டிலிருந்து) புறப்பட்டார்கள். அப்போது இரு முஸ்லிம்கள் சச்சரவு செய்துகொண்டிருந்தார்கள். (இதைக் கண்ணுற்ற) நபி (ஸல்) அவர்கள், “லைலத்துல் கத்ர் பற்றி உங்களுக்குத் தெரிவிப்பதற்காக நான் (வீட்டிலிருந்து) புறப்பட்டேன். அப்போது இன்னாரும் இன்னாரும் தமக்குள் சச்சரவு செய்துகொண்டிருந்தனர். ஆகவே, அது (என் நினைவிலிருந்து) அகற்றப்பட்டுவிட்டது. அதுவும் உங்களுக்கு ஒரு நன்மையாகவே இருக்கலாம். எனவே, (ரமளான் மாதத்தின் இருபத்து) ஒன்பதாவது, (இருபத்து) ஏழாவது, (இருபத்து) ஐந்தாவது இரவுகளில் அதைத் தேடிக் கொள்ளுங்கள்” என்று சொன்னார்கள்.63 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6050,
			"arabicnumber": 6050,
			"text": "மஅரூர் பின் சுவைத் (ரஹ்) அவர்கள் கூறியதாவது: நான் அபூதர் அல்கிஃபாரீ (ரலி) (அவர்களை மதீனாவுக்கருகில் உள்ள ‘ரபதா’ எனுமிடத்தில் சந்தித்தேன். அப்போது) அவர்கள்மீது ஒரு மேலங்கியும், அவர்களுடைய அடிமையின் மீது (அதே மாதிரியான) ஒரு மேலங்கியும் இருக்கக் கண்டேன். நான் (அவர்களிடம்), “(அடிமை அணிந்திருக்கும்) இதை நீங்கள் வாங்கி (கீழங்கியாக) அணிந்துகொண்டால் (உங்களுக்கு) ஒரு ஜோடி ஆடையாக இருக்குமே! இவருக்கு வேறோர் ஆடையைக் கொடுத்துவிடலாமே” என்று சொன்னேன். அப்போது அபூதர் (ரலி) அவர்கள் கூறினார்கள்: எனக்கும் ஒரு மனிதருக்கும் இடையே வாய்த்தகராறு ஏற்பட்டது. அம்மனிதரின் தாய் அரபியரல்லாதவர் ஆவார். ஆகவே, நான் அவருடைய தாயைக் குறிப்பிட்டு (இழிவாக)ப் பேசிவிட்டேன். உடனே அம்மனிதர் நபி (ஸல்) அவர்களிடம் என்னைப் பற்றி முறையிட்டார். அப்போது நபி (ஸல்) அவர்கள் என்னிடம், “நீர் இன்னாரை ஏசினீரா?” என்று கேட்டார்கள். நான், “ஆம்” என்று சொன்னேன். “அவருடைய தாயைக் குறிப்பிட்டு (இழிவாக)ப் பேசினீரா?” என்று கேட்டார்கள். நான் (அதற்கும்) “ஆம்” என்று பதிலளித்தேன். அப்போது நபி (ஸல்) அவர்கள், “நீர் அறியாமைக் காலத்துக் கலாசாரம் உள்ள மனிதராகவே இருக்கின்றீர்” என்று சொன்னார்கள். நான், “வயோதிகத்தை அடைந்துவிட்ட இந்தக் காலகட்டத்திலுமா? (அறியாமைக் கால குணம் கொண்டவனாய் உள்ளேன்?)” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “ஆம்” என்று கூறிவிட்டு, “(பணியாளர்களான) அவர்கள் உங்கள் சகோதரர்கள் ஆவர். அவர்களை அல்லாஹ் உங்கள் ஆதிக்கத்தின் கீழ் வைத்துள்ளான். ஆகவே, யாருடைய ஆதிக்கத்தின் கீழ் அவருடைய சகோதரரை அல்லாஹ் வைத்துள்ளானோ அவர் தம் சகோதரருக்குத் தாம் உண்பதிலிருந்து உணவளிக்கட்டும். தாம் அணிவதிலிருந்து அவருக்கு அணியத்தரட்டும். அவரது சக்திக்கு மீறிய பணியை அவருக்குக் கொடுத்து அவரைச் சிரமப்படுத்த வேண்டாம். அவ்வாறு அவரது சக்திக்கு மீறிய பணியை அவருக்குக் கொடுத்தால் அவருக்குத் தாமும் ஒத்துழைக்கட்டும்” என்று கூறினார்கள்.64 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6051,
			"arabicnumber": 6051,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒருநாள்) நபி (ஸல்) அவர்கள் எங்களுக்கு (நான்கு ரக்அத் தொழுகையான) லுஹ்ர் தொழுகையை (மறந்து) இரண்டு ரக்அத்களாகத் தொழுவித்துவிட்டு சலாம் கொடுத்துவிட்டார்கள். பிறகு எழுந்து பள்ளிவாசலின் தாழ்வாரத்திலிருந்த (பேரீச்சங்)கட்டையினை நோக்கிச் சென்று அதன் மீது தமது கையை வைத்து (நின்று)கொண்டார்கள். அன்று (பள்ளிவாசலில் இருந்த) மக்களில் அபூபக்ர் (ரலி) அவர்களும் உமர் (ரலி) அவர்களும் இருந்தனர். ஆனால், அவர்கள் இருவரும் நபி (ஸல்) அவர்களிடம் (அது குறித்துப்) பேச அஞ்சினர். மக்களில் சிலர் வேகமாக வெளியேறிச் செல்லலாயினர். அப்போது அவர்கள் “தொழுகை(யின் ரக்அத்) குறைந்துவிட்டதா?” என்று பேசிக் கொண்டனர். மக்களில் (‘கிர்பாக்’ எனும் இயற்பெயருடைய) ஒருவரும் இருந்தார். அவரை நபி (ஸல்) அவர்கள் ‘இரு கைக்காரர்’ (துல் யதைன்) என்று அழைப்பது வழக்கம். அவர், “அல்லாஹ்வின் நபியே! தாங்கள் மறந்து விட்டீர்களா? அல்லது தொழுகை(யின் ரக்அத்) குறைந்துவிட்டதா?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “(என் எண்ணப்படி) நான் மறக்கவுமில்லை. தொழுகை குறைந்துவிடவுமில்லை” என்று சொன்னார்கள். அவர், “இல்லை; தாங்கள் மறந்துவிட்டீர்கள், அல்லாஹ்வின் தூதரே!” என்று கூறினார். “இரு கைக்காரர் (துல் யதைன்) சொல்வது உண்மையா?” என (மக்களிடம்) நபி (ஸல்) அவர்கள் கேட்டார்கள். (மக்களும் உண்மையே என்று தெரிவித்தனர்.) பிறகு நபி (ஸல்) அவர்கள் எழுந்து இன்னும் இரண்டு ரக்அத்கள் தொழுவித்து ‘சலாம்’ கொடுத்தார்கள். பிறகு தக்பீர் (‘அல்லாஹு அக்பர் -அல்லாஹ் மிகப் பெரியவன்’ எனக்) கூறி ‘முன்பு செய்ததைப் போன்று’ அல்லது ‘அதைவிடவும் நீண்ட’ (மறதிக்கான) சிரவணக்கம் (சஜ்தா) செய்தார்கள். பின்னர் (சிரவணக்கத்திலிருந்து) எழுந்து ‘தக்பீர்’ சொன்னார்கள். பின்னர் மீண்டும் ‘முன்பு செய்ததைப் போன்று’ அல்லது ‘அதைவிட நீளமாக’ சிரவணக்கம் செய்தார்கள். பின்னர் தலையை உயர்த்தி ‘தக்பீர்’ சொன்னார்கள்.66 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6052,
			"arabicnumber": 6052,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரு மண்ணறைகளை (கப்றுகளை)க் கடந்து சென்றார்கள். அப்போது “(மண்ணறைகளிலுள்ள) இவ்விருவரும் வேதனை செய்யப்படுகிறார்கள். ஆனால், மிகப்பெரும் (பாவச்) செயலுக்காக (இவர்கள்) இருவரும் வேதனை செய்யப்படவில்லலை. இதோ! இவர் (தம் வாழ்நாளில்) சிறுநீர் கழிக்கும்போது (தம் உடலை) மறைக்கமாட்டார். இதோ! இவர் (மக்களிடையே) கோள் சொல்லி (புறம் பேசி)த் திரிந்துகொண்டிருந்தார்” என்று கூறினார்கள். பிறகு பச்சைப் பேரீச்சமட்டையொன் றைக் கொண்டுவரச் சொல்லி அதை இரண்டாகப் பிளந்து இவர் (மண்ணறை) மீது ஒன்றையும் அவர் (மண்ணறை)மீது ஒன்றையும் நட்டார்கள். பிறகு, “இவ்விரண்டின் ஈரம் உலராத வரை இவர்களின் வேதனை குறைக்கப்பட லாம்” என்று சொன்னார்கள்.69 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6053,
			"arabicnumber": 6053,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்.: அன்சாரிகளின் கிளைக் குடும்பங் களில் சிறந்தது ‘பனூ நஜ்ஜார்’ குடும்ப மாகும். இதை அபூஉசைத் அஸ்ஸாஇதீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.70 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6054,
			"arabicnumber": 6054,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் (எங்கள் வீட்டுக்குள் வர) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அனுமதி கேட்டார். அப்போது நபி (ஸல்) அவர்கள், “அவரை உள்ளே வரச்சொல்லுங்கள். அந்தக் கூட்டத்தாரிலேயே (இவர்) மோசமானவர்” என்று (அவரைப் பற்றிச்) சொன்னார்கள். (வீட்டுக்கு) உள்ளே அவர் வந்தபோது, (எல்லாரிடமும் பேசுவதுபோல்) அவரி ட(மு)ம் கனிவாகவே பேசினார்கள். (அவர் பேசிவிட்டு எழுந்து சென்றதும்) நான், “அல்லாஹ்வின் தூதரே! நீங்கள் (அவரைக் கண்டதும்) ஒன்று சொன்னீர்கள்; பிறகு அவரிடமே கனிவாகப் பேசினீர்களே?” என்று கேட்டேன். (அப்போது) நபி (ஸல்) அவர்கள், “ஆயிஷா! மக்கள் எவரது அருவருப்பான பேச்சுகளிலிருந்து (தங்களைத்) தற்காத்துக் கொள்ள அவரைவிட்டு ஒதுங்குகிறார் களோ அவரே மக்களில் தீயவர் ஆவார். (அருவருப்பான பேச்சுகள் பேசும் அவர் குறித்து மற்றவர்களை எச்சரிக்கை செய்யவே அவரைப் பற்றி அவ்வாறு சொன்னேன்)” என்றார்கள்.71 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6055,
			"arabicnumber": 6055,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவின் தோட்டம் ஒன்றிலிருந்து புறப்பட்டு வந்து கொண்டிருந்தபோது தம் மண்ணறைகளில் (கப்றுகளில்) வேதனை செய்யப்பட்டுக் கொண்டிருந்த இரு மனிதர்களின் (கூக்)குரலைச் செவியுற்றார்கள். அப்போது நபி (ஸல்) அவர்கள் “(இவர்கள்) இருவரும் (மண்ணறைக்குள்) வேதனை செய்யப்பட்டுக்கொண்டிருக்கின்றனர். ஒரு மாபெரும் (பாவச்) செயலுக்காக இவர்கள் வேதனை செய்யப்படவில்லை. ஆனாலும், அது ஒரு (வகையில்) பெரிய (பாவச்) செயல்தான். இவர்களில் ஒருவர் சிறுநீர் கழிக்கும் போது (தமது உடலை) மறைக்கமாட்டார். இன்னொருவர் (மக்களிடையே) கோள் சொல்லித் திரிந்துகொண்டிருந்தார்” என்று கூறினார்கள். பிறகு நபி (ஸல்) அவர்கள் பேரீச்ச மட்டை ஒன்றைக் கொண்டுவரச் சொல்லி அதை ‘இரு துண்டாக’ அல்லது ‘இரண்டாக’ப் பிளந்து ஒரு துண்டை இவரது மண்ணறையிலும் மற்றொரு துண்டை இவரது மண்ணறையிலும் (ஊன்றி) வைத்தார்கள். அப்போது “இவ்விரண்டின் ஈரம் உலராத வரை இவர்களின் வேதனை குறைக்கப்படலாம்” என்று கூறினார்கள்.73 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6056,
			"arabicnumber": 6056,
			"text": "ஹம்மாம் பின் ஹாரிஸ் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்களுடன் இருந்தோம். அப்போது அவர்களிடம், “(இங்குள்ள) ஒருவர் (நமக்கிடையே நடக்கும்) உரையாடல்களை (கலீஃபா) உஸ்மான் பின் அஃப்பான் (ரலி) அவர்களிடம் போய்ச் சொல்கிறார்” என்று கூறப்பட்டது. அப்போது ஹுதைஃபா (ரலி) அவர்கள், “கோள் சொல்கின்றவன் சொர்க்கம் செல்லமாட்டான்” என நபி (ஸல்) அவர்கள் கூற நான் கேட்டுள்ளேன் என்று சொன்னார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6057,
			"arabicnumber": 6057,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யார் பொய்யான பேச்சு, பொய்யான நடவடிக்கை, அறியாமை (உள்ளவர்களின் செயல்) ஆகியவற்றைக் கைவிடவில்லையோ அவர் (நோன்பின்போது) தமது உணவையும் பானத்தையும் (வெறுமனே) கைவிடுவதில் அல்லாஹ்வுக்கு எந்தத் தேவையுமில்லை. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.74 அறிவிப்பாளர் அஹ்மத் பின் யூனுஸ் (ரஹ்) அவர்கள் கூறுகிறார்கள்: (இந்த ஹதீஸை எனக்கு அறிவித்த இப்னு அபீதிஃப் (ரஹ்) அவர்கள்) இதன் அறிவிப்பாளர்தொடரை (விளக்கவில்லை. அவையில் இருந்த) ஒருவர் (அதை) எனக்கு விளக்கினார். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6058,
			"arabicnumber": 6058,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் அல்லாஹ்விடம் மனிதர்களிலேயே மிகவும் மோசமான வனாக இரட்டை முகத்தானைக் காண்பீர். அவன் இவர்களிடம் செல்லும்போது ஒரு முகத்துடனும் அவர்களிடம் செல்லும்போது இன்னொரு முகத்துடனும் செல்கிறான்.75 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6059,
			"arabicnumber": 6059,
			"text": "இப்னு மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஹுனைன் போரில் கிடைத்த செல்வங்களைப்) பங்கிட்டார்கள். அப்போது அன்சாரிகளில் ஒரு மனிதர், “அல்லாஹ்வின் மீதாணையாக! இதில் முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் திருப்தியை நாடவில்லை” என்று (மனத்தாங்கலுடன்) பேசினார். ஆகவே, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று அவர்களிடம் (அம்மனிதர் கூறியதைச்) சொன்னேன். (அதைக் கேட்ட) உடனே அவர்களின் முகம் (கோபத்தால் நிறம்) மாறிவிட் டது. (தொடர்ந்து) அவர்கள், “(இறைத் தூதர்) மூசாவுக்கு அல்லாஹ் கருணை புரிவானாக! அவர்கள் இதைவிட அதிக மனவேதனைக்கு ஆளாக்கப்பட்டார்கள். ஆயினும் சகித்துக்கொண்டார்கள்” என்று சொன்னார்கள்.76 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6060,
			"arabicnumber": 6060,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், ஒரு மனிதர் இன்னொரு மனிதரை அளவு கடந்து புகழ்ந்து கொண்டிருப்பதைச் செவியுற்றார்கள். அப்போது அவர்கள், “அந்த மனிதரின் முதுகை ‘அழித்துவிட்டீர்கள்’ அல்லது ‘ஒடித்துவிட்டீர்கள்’ ‘‘ என்று (கடிந்து) கூறினார்கள்.77 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6061,
			"arabicnumber": 6061,
			"text": "அபூபக்ரா நுஃபைஉ பின் அல் ஹாரிஸ் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதரைப் பற்றி நபி (ஸல்) அவர்கள் அருகில் பேசப்பட்டது. அப்போது ஒருவர் அவரைப் பற்றிப் புகழ்ந்துரைத்தார். உடனே நபி (ஸல்) அவர்கள், “உமக்குக் கேடுதான். உம்முடைய தோழரின் கழுத்தை நீர் துண்டித்துவிட்டீரே!” என்று பலமுறை கூறினார்கள். பிறகு, “உங்களில் ஒருவர் (தம் சகோதரரைப்) புகழ்ந்தேயாக வேண்டும் என்றிருந்தால், ‘(அவர் குறித்து) நான் இன்னின்ன விதமாக எண்ணுகிறேன்’ என்று (மட்டும்) அவர் கூறட்டும். அதுவும் அவர் அவ்வாறு இருப்பதாகக் கருதினால் மட்டுமே கூறட்டும். அல்லாஹ்வே அவரைக் குறித்து விசாரணை (செய்து முடிவு) செய்பவன் ஆவான். அல்லாஹ்வை முந்திக்கொண்டு யாரையும் தூய்மையானவர் என்று (யாரும்) கூற வேண்டாம். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் காலித் பின் மஹ்ரான் (ரஹ்) அவர்களின் அறிவிப்பில், “(நபி (ஸல்) அவர்கள் தம்முன் புகழ்ந்தவரைப் பார்த்து) உமக்கு அழிவுதான்” என்று கூறியதாக இடம்பெற்றுள்ளது.78 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6062,
			"arabicnumber": 6062,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கீழங்கி குறித்து (யார் தமது ஆடையைப் பெருமையுடன் தரையில் படும்படி இழுத்துச் செல்கிறாரோ அவரை மறுமையில் அல்லாஹ் ஏறெடுத்தும் பார்க்கமாட்டான் என்று) குறிப்பிட்டபோது அபூபக்ர் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! என் கீழங்கியின் இரு பக்கங்களில் ஒன்று (இடுப்பில் நிற்காமல் கீழே) விழுந்துவிடுகிறதே!” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “நீங்கள் (தற்பெருமையுடன் கீழங்கியைத் தொங்கவிடும்) அவர்களில் உள்ளவர் அல்லர்” என்று சொன்னார்கள்.80 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6063,
			"arabicnumber": 6063,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்கு (சூனியம் செய்யப்பட்டதால்) அவர்கள் இன்னின்ன வாறு நடந்துகொண்டார்கள். அவர்கள் தம் வீட்டாரிடம் செல்லாமலேயே சென்றுவந்துவிட்டதாகப் பிரமையூட்டப் பட்டார்கள். அவர்கள் ஒருநாள் என்னிடம், “ஆயிஷா! நான் எந்த விவகாரத்தில் தெளிவைத் தரும்படி அல்லாஹ்விடம் கேட்டுக்கொண்டிருந்தேனோ அதில் அவன் எனக்குத் தெளிவை அளித்துவிட்டான். (நான் உறங்கிக் கொண்டிருந்தபோது கனவில் வானவர்கள்) இரண்டுபேர் என்னிடம் வந்தனர். அவர்களில் ஒருவர் என் கால்மாட்டிலும் மற்றவர் என்னுடைய தலைமாட்டிலும் அமர்ந்தனர். அப்போது என் கால்மாட்டில் அமர்ந்திருந்தவர் என் தலைமாட்டில் அமர்ந்திருந்தவரிடம் (என்னைக் காட்டி), “இந்த மனிதரின் நிலை என்ன?” என்று கேட்க, மற்றவர், “இவருக்குச் சூனியம் வைக்கப்பட்டுள்ளது” என்று பதிலளித்தார். முதலாமவர், “இவருக்குச் சூனியம் வைத்தவர் யார்?” என்று கேட்க, மற்றவர், ‘லபீத் பின் அஃஸம்’ என்று பதிலளித்தார். முதலாமவர், “எதில் (சூனியம் வைக்கப்பட்டுள்ளது)?” என்று கேட்க, மற்றவர், “ஆண் பேரீச்சம் பாளையின் உறை, (தலைவாரும்) சீப்பு, சிக்குமுடி ஆகியவற்றில் (சூனியம்) செய்யப்பட்டு ‘தர்வான்’ (குலத்தாரின்) கிணற்றில் ஒரு பாறைக்கடியில் வைக்கப்பட்டுள்ளது” என்று பதிலளித்தார். ஆகவே, நபி (ஸல்) அவர்கள் (தம் தோழர்கள் சிலருடன் அந்தக் கிணற்றுக்கு) வந்து (பார்த்துவிட்டு), “இந்தக் கிணறுதான் எனக்குக் (கனவில்) காட்டப்பட்டது. அந்தக் கிணற்றைச் சுற்றியிருந்த பேரீச்சம் மரங்களின் தலைகள் ஷைத்தான்களின் தலைகளைப் போன்றிருந்தன. அந்தக் கிணற்றின் தண்ணீர் மருதாணிச் சாற்றைப் போன்றிருந்தது” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள் உத்தரவிட அது வெளியே எடுக்கப்பட்டது. நான், “அல்லாஹ்வின் தூதரே! அ(ந்தப் பாளை உறை)தனைப் பிரித்துப் பார்க்கவில்லையா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள் “அல்லாஹ் என்னைக் குணப்படுத்திவிட்டான். நானோ (அதைப் பிரித்துக் காட்டுவதால்) மக்களுக்கெதிராக வன்மத்தைத் தூண்டிவிடுவதை அஞ்சுகிறேன்” என்று சொன்னார்கள். (நபி (ஸல்) அவர்களுக்குச் சூனியம் வைத்த) லபீத் பின் அஃஸம், பனூ ஸுரைக் குலத்தாரிலுள்ள ஒருவன் ஆவான். (அவன்) யூதர்களின் நட்புக் குலத்தவன் ஆவான்.81 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6064,
			"arabicnumber": 6064,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (ஆதாரமில்லாமல் பிறரைச்) சந்தேகப்படுவது குறித்து உங்களை நான் எச்சரிக்கிறேன். ஏனெனில், சந்தேகம் கொள்வது மிகப்பெரிய பொய்யாகும். (பிறரின் குறையைத்) துருவித்துருவி ஆராயாதீர்கள். ஒட்டுக்கேட்காதீர்கள். ஒருவருக்கொருவர் பொறாமை கொள்ளாதீர்கள். பிணங்கிக் கொள்ளாதீர்கள். கோபம் கொள்ளாதீர்கள். (மாறாக,) அல்லாஹ்வின் அடியார்களே! (அன்பு பாராட்டுவதில்) சகோதரர்களாய் இருங்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6065,
			"arabicnumber": 6065,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவருக்கொருவர் கோபம் கொள்ளாதீர்கள். பொறாமை கொள்ளாதீர்கள். பிணங்கிக்கொள்ளாதீர்கள். (மாறாக,) அல்லாஹ்வின் அடியார்களே! (அன்பு பாராட்டுவதில்) சகோதரர்களாய் இருங்கள். எந்தவொரு முஸ்லிமும் தம் சகோதரருடன் மூன்று நாட்களுக்குமேல் பேசாமல் இருப்பது அனுமதிக்கப்பட்டதன்று. இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6066,
			"arabicnumber": 6066,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (ஆதாரமில்லாமல் பிறரைச்) சந்தேகிப் பது குறித்து உங்களை நான் எச்சரிக்கி றேன். ஏனெனில், சந்தேகம் கொள்வது பெரும் பொய்யாகும். (பிறரின் குறையைத்) துருவித்துருவி ஆராயாதீர்கள். ஒட்டுக் கேட்காதீர்கள். (பிறரை அதிக விலை கொடுத்து வாங்க வைப்பதற்காக விற்பனைப் பொருளின்) விலையை ஏற்றிக் கேட்காதீர்கள். ஒருவருக்கொருவர் பொறாமை கொள்ளாதீர்கள். கோபம் கொள்ளாதீர்கள். பிணங்கிக்கொள்ளாதீர்கள். (மாறாக,) அல்லாஹ்வின் அடியார்களே! (அன்புகாட்டுவதில்) சகோதரர்களாய் இருங்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6067,
			"arabicnumber": 6067,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: “இன்னாரும் இன்னாரும் நமது மார்க்கத்தில் எதையும் அறிந்ததாக நான் கருதவில்லை” என்று (இருவரைப் பற்றி) நபி (ஸல்) அவர்கள் கூறினார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) லைஸ் (ரஹ்) அவர்கள் கூறுகிறார்கள்: அவர்கள் இருவரும் நயவஞ்சகர்களாய் இருந்தனர். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6068,
			"arabicnumber": 6068,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒருநாள் நபி (ஸல்) அவர்கள் என்னிடம் வந்து, “ஆயிஷா! இன்னாரும் இன்னாரும் நாம் எந்த மார்க்கத்தில் இருக்கிறோமோ அதை அறிந்திருப்பவர் களாக நான் கருதவில்லை” என்று கூறினார்கள்.83 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6069,
			"arabicnumber": 6069,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: என் சமுதாயத்தாரில் (பாவம் செய்த) அனைவரும் (இறைவனால்) மன்னிக்கப் படுவர்; (தம் பாவங்களைத்) தாமே பகிரங்கப்படுத்துகின்றவர்களைத் தவிர. ஒரு மனிதன் இரவில் ஒரு (பாவச்) செயல் புரிந்துவிட்டுப் பிறகு காலையில் அல்லாஹ் அவனது பாவத்தை (பிறருக்குத் தெரியாமல்) மறைத்து விட்டிருக்க, “இன்னாரே! நேற்றிரவு நான் (பாவங்களில்) இன்னின்னதைச் செய்தேன்” என்று அவனே கூறுவது பகிரங்கப்படுத்துவதில் அடங்கும். (அவன் செய்த பாவத்தை) இரவில் (பிறருக்குத் தெரியாமல்) இறைவன் மறைத்துவிட்டான். (ஆனால்,) இறைவன் மறைத்ததைக் காலையில் அந்த மனிதன் தானே வெளிச்சமாக்கிவிடுகிறான் இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6070,
			"arabicnumber": 6070,
			"text": "ஸஃப்வான் பின் முஹ்ரிஸ் அல்மாஸினீ (ரஹ்) அவர்கள் கூறியதாவது: ஒரு மனிதர் இப்னு உமர் (ரலி) அவர்களிடம், “(மறுமை நாளில் அல்லாஹ் வுக்கும் அவனுடைய அடியார்களுக்குமிடையே நடைபெறும்) இரகசிய உரையாடல் குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து என்ன செவியுற்றீர்கள்?” என்று கேட்டார். அதற்கு இப்னு உமர் (ரலி) அவர்கள் (பின்வருமாறு) கூறினார்கள்: “உங்களில் ஒருவர் தம்முடைய இறைவனை நெருங்குவார். எந்த அளவுக் கென்றால் இறைவன் தன் திரையை அவர்மீது போட்டு (அவரை மறைத்து) விடுவான். அப்போது இறைவன், ‘நீ (உலகத்தில்) இன்னின்ன (பாவச்) செயல்களைச் செய்தாயா?’ என்று கேட்பான். அதற்கு அவர், ‘ஆம்’ என்பார். இறைவன் (மீண்டும்) ‘இன்னின்ன (பாவச்) செயல்களைச் செய்தாயா?’ என்று கேட்பான். அப்போதும் அவர், ‘ஆம்’ என்று கூறி (தமது பாவச்)செயல்களை ஒப்புக்கொள்வார். பிறகு அவன், ‘இவற்றையெல்லாம் உலகில் நான் (பிறருக்குத் தெரியாமல்) மறைத்(திருந்)தேன். இன்று உனக்கு அவற்றை மன்னித்துவிடுகிறேன்’ என்று கூறுவான்” என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொன்னார்கள்.85 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6071,
			"arabicnumber": 6071,
			"text": "ஹாரிஸா பின் வஹ்ப் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஒருமுறை), “சொர்க்கவாசிகள் யார் என்று உங்க ளுக்கு நான் தெரிவிக்கட்டுமா? அவர்கள் (மக்களின் பார்வையில்) பலவீனமானவர்கள்; பணிவானவர்கள். (ஆனால்,) அவர்கள் அல்லாஹ்வின் மேல் ஆணையிட்டு (எதையேனும்) கூறுவார்களானால், அல்லாஹ் அதை (அவ்வாறே) நிறைவேற்றிவைப்பான். (இதைப் போன்றே,) நரகவாசிகள் யார் என்று உங்களுக்கு நான் தெரிவிக்கட்டுமா? அவர்கள் இரக்கமற்றவர்கள்; அகம்பாவம் கொண்டவர்கள்; பெருமை பிடித்தவர்கள்” என்று கூறினார்கள்.86 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6072,
			"arabicnumber": 6072,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: மதீனாவாசிகளின் (சாதாரண) அடிமைப் பெண்களில் ஒருத்திகூட அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் கையைப் பற்றியவண்ணம் (தன் வாழ்க்கைத் தேவை நிமித்தமாக) தான் நாடிய இடத்திற்கு அவர்களை அழைத்துச் செல்ல முடியும். (அந்த அளவுக்கு மிக எளிமையானவர்களாகவும் சமூக சேவை புரிபவர்களாகவும் நபி (ஸல்) அவர்கள் திகழ்ந்தார்கள்.) அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6075,
			"arabicnumber": 6075,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6076,
			"arabicnumber": 6076,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவருக்கொருவர் கோபம் கொள்ளாதீர்கள். பொறாமை கொள்ளாதீர்கள். பிணங்கிக்கொள்ளாதீர்கள். அல்லாஹ்வின் அடியார்களே! (அன்பு காட்டுவதில்) சகோதரர்களாய் இருங்கள். ஒரு முஸ்லிம் தம் சகோதரருடன் (மனஸ்தாபம் கொண்டு) மூன்று நாட்களுக்குமேல் பேசாமல் இருப்பது அனுமதிக்கப்பட்டதன்று. இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6077,
			"arabicnumber": 6077,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவர் தம் சகோதரரிடம் (மனஸ்தாபம் கொண்டு) மூன்று நாட்களுக்குமேல் பேசாமல் இருப்பது அனுமதிக்கப்பட்டதன்று. அவர்கள் இருவரும் சந்தித்து ஒருவரைவிட்டு ஒருவர் முகத்தைத் திருப்பிக்கொள்வர். (இவ்வாறு செய்யலாகாது.) இவர்கள் இருவரில் சிறந்தவர், யார் சலாமை (முகமனை) முதலில் தொடங்குகிறாரோ அவர்தான். இதை அபூஅய்யூப் அல்அன்சாரி (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6078,
			"arabicnumber": 6078,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (என்னிடம்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உன்னுடைய கோபத்தையும் உன்னுடைய பிரியத்தையும் நான் நன்றாக அறிவேன்” என்று கூறினார்கள். அதற்கு நான், “அதை எவ்வாறு தாங்கள் அறிந்து கொள்வீர்கள்? அல்லாஹ்வின் தூதரே!” என்று கேட்டேன். அதற்கு அவர்கள், “நீ பிரியத்துடன் இருக்கும்போது (பேசினால்), ‘ஆம்; முஹம்மதுடைய அதிபதிமீது சத்தியமாக’ என்று கூறுவாய். நீ கோபமாய் இருக்கும்போது (பேசினால்), ‘இல்லை; இப்ராஹீம் (அலை) அவர்களுடைய அதிபதிமீது சத்தியமாக’ என்று கூறுவாய்” என்று சொன்னார்கள். நான், “ஆம் (உண்மைதான்). நான் தங்களது பெயரைத்தான் கோபித்துக் கொள்வேன் (தங்கள்மீதன்று)” என்று கூறினேன்.90 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6079,
			"arabicnumber": 6079,
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: என் பெற்றோர் (அபூபக்ர்-உம்மு ரூமான்) எனக்கு விவரம் தெரிந்தது முதல் (இஸ்லாமிய) மார்க்கத்தைக் கடைப்பிடிப்பவர்களாகவே இருந்தார்கள். பகலின் இரண்டு ஓரங்களான காலை யிலும் மாலையிலும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் வருகைதராமல் (மக்காவில்) எந்த நாளும் எங்களுக்குக் கழிந்ததில்லை. நாங்கள் ஒருநாள் உச்சிப் பொழுதின்போது அபூபக்ர் (ரலி) அவர்களின் வீட்டில் அமர்ந்துகொண்டிருந்தோம். அப்போது ஒருவர் அபூபக்ர் (ரலி) அவர்களிடம், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நம்மிடம் வருகைதராத நேரத்தில் (வழக்கத்திற்கு மாறாக) இதோ வந்து கொண்டிருக்கிறார்கள்” என்று கூறினார். (அதற்கு) அபூபக்ர் (ரலி) அவர்கள், “ஏதோ (முக்கிய) விவகாரம்தான் நபியவர்களை இந்த நேரத்தில் (இங்கு) வரச்செய்திருக்கிறது” என்று கூறினார்கள். நபி (ஸல்) அவர்கள், “(ஹிஜ்ரத்) புறப்பட்டுச் செல்ல எனக்கு (இறைவனிட மிருந்து) அனுமதி வழங்கப்பட்டுவிட்டது” என்று சொன்னார்கள்.91 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6080,
			"arabicnumber": 6080,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்சாரிகளில் ஒரு குடும்பத்தாரைச் சந்தித்துவிட்டு அவர்களிடம் உணவருந்தினார்கள். பிறகு அவர்கள் புறப்பட விரும்பியபோது வீட்டில் உள்ள ஓர் இடத்தை ஒதுக்கித் தரும்படி பணித்தார்கள். ஆகவே, நபியவர்களுக்காகப் பாய் விரிக்கப்பட்டுத் தண்ணீர் தெளிக்கப்பட்டது. அதன் மீது நபியவர்கள் தொழுதார்கள். அக்குடும்பத்தினருக்காகப் பிரார்த்தனை யும் புரிந்தார்கள்.94 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6081,
			"arabicnumber": 6081,
			"text": "யஹ்யா பின் அபீஇஸ்ஹாக் அல்ஹள்ரமீ (ரஹ்) அவர்கள் கூறியதாவது: சாலிம் பின் அப்தில்லாஹ் (ரஹ்) அவர்கள் என்னிடம், “ ‘அல்இஸ்தப்ரக்’ என்றால் என்ன?” என்று கேட்டார்கள். நான், “கெட்டியான முரட்டுப் பட்டு” என்று பதிலளித்தேன். அப்போது அவர்கள், (என் தந்தை) அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் (பின்வருமாறு) கூறக் கேட்டுள்ளேன் என்றார்கள்: (என் தந்தை) உமர் (ரலி) அவர்கள் ஒரு மனிதர்மீது கெட்டியான பட்டு அங்கி ஒன்றைக் கண்டார்கள். அதை (அவரிடமிருந்து வாங்கி) நபி (ஸல்) அவர்களிடம் கொண்டுவந்து “அல்லாஹ்வின் தூதரே! இதைத் தாங்கள் விலைக்கு வாங்கி மக்களின் தூதுக் குழு தங்களிடம் வரும்பொழுது இதைத் தாங்கள் அணிந்து கொள்ளுங்கள்” என்று சொன்னார்கள். அதற்கு நபி (ஸல்) அவர்கள், “(மறுமைப்) பேறற்ற (ஆட)வர்களே (இது போன்ற) பட்டை (இம்மையில்) அணிந்துகொள்வார்கள்” என்று சொன்னார்கள். இது நடந்து சில நாட்கள் கழிந்தபிறகு (ஒருநாள்) நபி (ஸல்) அவர்கள் உமர் (ரலி) அவர்களுக்கு ஒரு பட்டு அங்கியை கொடுத்தனுப்பினார்கள். உடனே அதை எடுத்துக்கொண்டு உமர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம் வந்து, “இதை எனக்குத் தாங்கள் கொடுத்தனுப்பியுள்ளீர்கள். (ஆனால்) இது போன்ற (பட்டு அங்கி) விஷயத்தில் தாங்கள் வேறுவிதமாகக் கூறினீர்களே?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “(இதை விற்று) இதன் மூலம் (வருவாயாகக் கிடைக்கும்) செல்வத்தை நீங்கள் அடைந்துகொள்ளும் பொருட்டே இதை உங்களுக்கு நான் கொடுத்தனுப்பினேன்” என்று சொன்னார்கள்.95 இந்த நபிமொழியின் காரணமாகவே, இப்னு உமர் (ரலி) அவர்கள் ஆடையில் வேலைப்பாடு செய்யப்படுவதை வெறுப்பவர்களாக இருந்தார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6082,
			"arabicnumber": 6082,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் (மதீனாவாசிகளான) எங்களிடம் (ஹிஜ்ரத் செய்து) வந்தபோது அவர்களுக்கும் சஅத் பின் ரபீஉ (ரலி) அவர்களுக்கும் இடையே நபி (ஸல்) அவர்கள் சகோதரத்துவத்தை ஏற்படுத்தினார்கள். பிறகு (அப்துர் ரஹ்மான் (ரலி) அவர்கள் மணமுடித்துக்கொண்டபோது அவரிடம்) “ஓர் ஆட்டையாவது (அறுத்து) மணவிருந்து (வலீமா) கொடுங்கள்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள்.98 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6083,
			"arabicnumber": 6083,
			"text": "ஆஸிம் பின் சுலைமான் அல்அஹ்வல் (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம், “இஸ்லாத்தில் (மனிதர்களாக எற்படுத்திக்கொள்கிற ஒப்பந்த) நட்புறவுமுறை இல்லை” என்று நபி (ஸல்) அவர்கள் கூறியதாகத் தங்களுக்குச் செய்தி கிடைத்ததா?” என்று கேட்டேன். அதற்கு அவர்கள், “நபி (ஸல்) அவர்கள் எனது வீட்டில் வைத்து குறைஷி (முஹாஜிர்)களுக்கும் (மதீனா) அன்சாரிகளுக்கும் இடையே நட்புறவு முறையை ஏற்படுத்தியிருந்தார்களே!” என்றார்கள்.99 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6084,
			"arabicnumber": 6084,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது.: ரிஃபாஆ அல்குறழீ (ரலி) அவர்கள் தம் துணைவியாரை ஒட்டுமொத்த மணவிலக்குச் செய்துவிட்டார்கள். அவருக்குப் பிறகு அப்துர் ரஹ்மான் பின் ஸபீர் (ரலி) அவர்கள் அவரை மணமுடித்துக்கொண்டார்கள். அப்போது அவர் நபி (ஸல்) அவர்களிடம் வந்து, “அல்லாஹ்வின் தூதரே! நான் ரிஃபாஆ அவர்களிடம் (மனைவியாக) இருந்தேன். என்னை அவர் மூன்று தலாக்குகளில் இறுதி தலாக் சொல்லிவிட்டார். அவருக்குப் பிறகு என்னை அப்துர் ரஹ்மான் பின் ஸபீர் மணந்துகொண்டார். அல்லாஹ்வின் மீதாணையாக! (இரண்டாம் கணவரான) இவருக்கு (இன உறுப்பு என்று) இருப்பதெல்லாம் இதோ இந்த (முகத்திரையின்) குஞ்சத்தைப் போன்றுதான்” என்று கூறி தமது முகத்திரையின் குஞ்சத்தைப் பிடித்துக் காட்டினார். (அப்போது) அபூபக்ர் (ரலி) அவர்கள் நபி (ஸல்) அவர்கள் அருகில் அமர்ந்துகொண்டிருந்தார்கள். காலித் பின் சயீத் பின் அல்ஆஸ் (ரலி) அவர்கள் அந்த அறையின் வாசலில் அனுமதிக்காக (காத்துக்கொண்டு) அமர்ந்திருந்தார்கள். காலித் அவர்கள் அபூபக்ர் (ரலி) அவர்களை அழைத்து, “அபூபக்ரே! அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் முன்னிலையில் பகிரங்கமாக இப்படிப் பேசக் கூடாதென இவரை நீங்கள் கண்டிக்கக் கூடாதா?” என்று கேட்கலானார்கள். (ஆனால்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களோ புன்னகை செய்ததைவிடக் கூடுதலாக (வேறேதும்) செய்யவில்லை. பிறகு நபி (ஸல்) அவர்கள் (அப் பெண்ணிடம்), “நீ (முதல் கணவர்) ரிஃபாஆவிடமே திரும்பிச் செல்ல விரும்புகிறாய் போலும். நீ (உன் இரண் டாம் கணவரான) இவரிடம் (தாம்பத்திய) இன்பத்தை அனுபவிக்காத வரையிலும், இவர் உன்னிடம் (தாம்பத்திய) இன் பத்தை அனுபவிக்காத வரையிலும் அது முடியாது” என்று சொன்னார்கள்.102 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6085,
			"arabicnumber": 6085,
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) (அவர்களின் வீட்டுக்குள் வர) அவர்களிடம் உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் அனுமதி கேட்டார்கள். அப்போது நபியவர்களிடம் (அவர் களுடைய துணைவியரான) குறைஷிப் பெண்கள் (குடும்பச் செலவுத் தொகையை) அதிகமாக்கித் தரும்படி குரலை உயர்த்திக் கேட்டுக்கொண்டிருந்தார்கள். உமர் (ரலி) அவர்கள் அனுமதி கேட்டபோது அப்பெண்கள் அவசர அவசரமாகத் தங்கள் பர்தாக்களை அணிந்(தபடி எழுந்)துகொண்டனர். நபி (ஸல்) அவர்கள் அனுமதி கொடுத்த உடன் உமர் (ரலி) அவர்கள் உள்ளே வந்தார்கள். நபி (ஸல்) அவர்கள் சிரித்துக்கொண்டிருந்தார்கள். அப்போது உமர் (ரலி) அவர்கள் “அல்லாஹ்வின் தூதரே! தங்களை அல்லாஹ் (வாழ்நாள் முழுதும்) சிரித்தபடி (மகிழ்ச்சியாக) இருக்கச்செய்வானாக! என் தந்தையும் என் தாயும் தங்களுக்கு அர்ப்பணமாகட்டும்” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள், “என்னிடமிருந்த இந்தப் பெண்களைக் கண்டு நான் வியப்படைகிறேன். (என்னிடம் சகஜமாக அமர்ந்திருந்த இவர்கள்) உங்கள் குரலைக் கேட்டவுடன் அவசர அவசரமாக பர்தா அணிந்துகொண்(டு உள்ளே சென்றுவிட்)டார்களே!” என்று சொன்னார்கள். அதற்கு உமர் (ரலி) அவர்கள், “இவர்கள் (எனக்கு அஞ்சுவதைவிட) அதிகமாக அஞ்சத் தாங்கள்தான் தகுதியுடையவர்கள், அல்லாஹ்வின் தூதரே!” என்று கூறிவிட்டுப் பிறகு அப்பெண்களை நோக்கி, “தமக்குத் தாமே பகைவர்களாகிவிட்ட பெண்களே! அல்லாஹ்வின் தூதருக்கு அஞ்சாமல் எனக்கா நீங்கள் அஞ்சுகிறீர்கள்?” என்று கேட்டார்கள். அதற்கு அந்தப் பெண்கள், “அல்லாஹ்வின் தூதருடன் ஒப்பிடும்போது நீங்கள் கடினசித்தம் உடையவராகவும் கடுமை காட்டக்கூடியவராகவும் இருக்கி றீர்கள்” என்று பதிலளித்தார்கள். (அப்போது) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அது இருக்கட்டும் கத்தாபின் புதல்வரே! என் உயிர் யார் கையிலுள்ளதோ அவன்மீது சத்தியமாக! நீங்கள் ஓர் அகன்ற பாதையில் சென்றுகொண்டிருக்கையில் உங்களை ஷைத்தான் எதிர்கொண்டால் உங்களுடைய பாதையல்லாத வேறு பாதையில்தான் அவன் செல்வான்” என்று கூறினார்கள்.103 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6086,
			"arabicnumber": 6086,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தாயிஃபில் (அதை முற்றுகையிட்டபடி) இருந்துகொண்டிருந்தபோது, “இறைவன் நாடினால், நாம் நாளை (மதீனாவுக்குத்) திரும்பிச் செல்வோம்” என்று சொன்னார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தோழர்களில் சிலர், “தாயிஃபை வெற்றிகொள்ளும் வரை நாங்கள் (திரும்பிச்செல்லமாட்டோம்) இங்கேயே இருப்போம்” என்று கூறினார்கள். (அவர்களின் தயக்கத்தைக் கண்ட) நபி (ஸல்) அவர்கள், “முற்பகóலேயே போர் புரியுங்கள்” என்று சொன்னார்கள். அவ்வாறே எதிரிகளுடன் அவர்கள் கடுமையாகப் போர் புரிந்ததில் அவர்களுக்கு அதிகமான காயங்கள் ஏற்பட்டன. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இறைவன் நாடினால், நாளை நாம் (மதீனாவுக்குத்) திரும்பிச் செல்வோம்” என்று சொன்னார்கள். நபித்தோழர்கள் இப்போது (ஏதும் பதிலளிக்காமல் அதை ஆதரிக்கும் வகையில்) அமைதியாக இருந்தார்கள். இதைக் கண்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சிரித்தார்கள்.104 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில் முழுத்தகவல் இடம்பெறுகிறது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6087,
			"arabicnumber": 6087,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் ஒரு மனிதர் வந்து, “நான் அழிந்துவிட்டேன்; நான் ரமளான் மாதத்தில் (நோன்பு நோற்றுக்கொண்டு) என் மனைவியுடன் தாம்பத்திய உறவு கொண்டுவிட்டேன்” என்று சொன்னார். நபி (ஸல்) அவர்கள், “(இதற்குப் பரிகாரமாக) ஓர் அடிமையை விடுதலை செய்வீராக” என்று சொன்னார்கள். அவர், “என்னிடம் அடிமை இல்லை” என்று சொன்னார். நபி (ஸல்) அவர்கள், “அவ்வாறாயின் தொடர்ந்து இரு மாதம் நோன்பு நோற்பீராக” என்று சொன்னார்கள். அவர், “எனக்குச் சக்தியில்லை” என்று சொன்னார். நபி (ஸல்) அவர்கள், “அவ்வாறாயின் அறுபது ஏழைகளுக்கு உணவளிப்பீராக” என்று கூறினார்கள். அவர், “என்னிடம் ஏதுமில்லை” என்று சொன்னார். அப்போது (நபி (ஸல்) அவர்களிடம்) ‘அரக்’ கொண்டுவரப்பட்டது. அதில் பேரீச்சம்பழம் இருந்தது. -அறிவிப்பாளர்களில் ஒருவரான இப்ராஹீம் பின் சஅத் (ரஹ்) அவர்கள் கூறுகிறார்கள்: ‘அரக்’ என்பது (பதினைந்து ‘ஸாஉ’ பிடிக்கும்) ஒரு முகத்தலளவை ஆகும்- அப்போது நபி (ஸல்) அவர்கள், “கேள்வி கேட்டவர் எங்கே?” (என்று கேட்க, அவர் வந்தார். அவரிடம்) “இதை(ப் பெற்று) தர்மம் செய்வீராக!” என்று சொன் னார்கள். அந்த மனிதர் “என்னைவிட ஏழையாக இருப்போருக்கா நான் தர்மம் செய்வது? கருங்கற்கள் நிறைந்த (மதீனாவின்) இரண்டு மலைகளுக்கு இடைப்பட்ட பகுதியில் எங்களைவிடப் பரம ஏழையான குடும்பத்தார் யாருமில்லை” என்று சொன்னார். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள் தம் கடைவாய்ப்பற்கள் தெரியும் அளவுக்குச் சிரித்தார்கள். (பிறகு) “அவ்வாறாயின் நீங்களே (அதற்கு உரியவர்கள்)” என்று சொன்னார்கள்.105 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6088,
			"arabicnumber": 6088,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் நடந்துகொண்டிருந்தேன். அப்போது அவர்கள் தடித்த கரை கொண்ட நஜ்ரான் நாட்டு சால்வை ஒன்றைப் போர்த்தியிருந்தார்கள். அப்போது கிராமவாசி ஒருவர் அவர்களை நெருங்கி அந்தச் சால்வையால் (அவர்களை) வேகமாக இழுத்தார். அந்தக் கிராமவாசி வேகமாக இழுத்ததால் சால்வையின் ஓரப் பகுதி நபி (ஸல்) அவர்களின் தோள்பட்டையில் அடையாளம் பதித்துவிட்டிருந்ததை நான் கண்டேன். பிறகு அவர், “முஹம்மதே! உங்களிடமுள்ள அல்லாஹ்வின் செல்வத்திலிருந்து எனக்குக் கொடுக்கும்படி கட்டளையிடுங்கள்” என்று சொன்னார். உடனே நபி (ஸல்) அவர்கள் அவரைத் திரும்பிப் பார்த்துச் சிரித்துவிட்டுப் பிறகு அவருக்குக் கொடுக்கும்படி ஆணையிட்டார்கள்.106 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6090,
			"arabicnumber": 6090,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6091,
			"arabicnumber": 6091,
			"text": "உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: உம்மு சுலைம் (ரலி) அவர்கள் (நபி (ஸல்) அவர்களிடம்), “அல்லாஹ்வின் தூதரே! சத்தியத்தைக் கூற அல்லாஹ் வெட்கப்படுவதில்லை. ஒரு பெண்ணுக்குத் தூக்கத்தில் ஸ்கலிதம் ஏற்பட்டால் அவள் மீது குளியல் கடமையாகுமா?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “ஆம்; அவள் (மதன) நீரைப் பார்த்தால் (குளியல் அவள்மீது கடமைதான்.)” என்று பதிலளித்தார்கள். இதைக் கேட்டு நான் சிரித்தவாறு, “பெண்ணுக்குக் கூடவா தூக்க ஸ்கலிதம் ஏற்படும்?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “பிறகு எவ்வாறு குழந்தை (தாயின்) சாயலில் பிறக்கிறது?” என்று கேட்டார்கள்.109 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6092,
			"arabicnumber": 6092,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களை நான் ஒருபோதும் ஒரேயடியாகத் தமது உள்நாக்குத் தெரியும் அளவுக்குச் சிரிக்கக் கண்டதில்லை. அவர்கள் (பெரும்பாலும்) புன்னகைப்பவர்களா கவே இருந்தார்கள்.110 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6093,
			"arabicnumber": 6093,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவில் வெள்ளிக்கிழமை (ஜுமுஆ நாளில்) உரை நிகழ்த்திக்கொண்டிருந்தபோது (கிராமவாசி) ஒருவர் வந்து, “(அல்லாஹ்வின் தூதரே!) மழை பொய்த்துவிட்டது. (எங்களுக்கு) மழை வேண்டி உங்கள் இறைவனிடம் பிரார்த்தனை புரியுங்கள்” என்று சொன்னார். அப்போது நபி (ஸல்) அவர்கள் வானத்தை (அண்ணாந்து) பார்த்தார்கள். (அதில் மழை) மேகம் ஏதும் இருக்கவில்லை. அப்போது நபி (ஸல்) அவர்கள் மழை வேண்டிப் பிரார்த்தித்தார்கள். உடனே மேகம் ஒன்றோடொன்று திரள ஆரம்பித்தது. பிறகு மழை பொழிந்தது. இதையடுத்து மதீனாவின் நீர்வழிகள் (எல்லாம் நிரம்பி) வழிந்தோடின. இடையறாமல் அடுத்த ஜுமுஆவரை அம்மழை நீடித்தது. பிறகு ‘அந்த மனிதர்’ அல்லது ‘வேறொரு மனிதர்’ எழுந்தார். அப்போது நபி (ஸல்) அவர்கள் (ஜுமுஆ) உரை நிகழ்த்திக்கொண்டிருந்தார்கள். அவர், “(தொடர்) மழையினால் நாங்கள் மூழ்கிக் கொண்டிருக்கிறோம். எங்களைவிட்டு மழையை நிறுத்துமாறு உங்கள் இறைவனிடம் பிரார்த்தியுங்கள்” என்று சொன்னார். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள் சிரித்தார்கள். பிறகு நபி (ஸல்) அவர்கள், “அல்லாஹ்வே! எங்கள் சுற்றுப்புறங்களில் (உள்ள மானாவாரி நிலங்கள், நீர்நிலைகள் ஆகியவற்றுக்கு இம்மழையைப் பொழியச் செய்வாயாக!) எங்களுக்குப் பாதகமாக இதை நீ ஆக்கிவிடாதே!” என்று இரண்டு அல்லது மூன்று முறை பிரார்த்தித்தார்கள். அந்த(த் திரண்ட) மேகம் மதீனாவிலிருந்து (விலகி) வலப் பக்கமாகவும் இடப் பக்கமாகவும் பிரிந்து சென்றது. மதீனாவைச் சுற்றி மழை பொழிகிறது; ஆனால் மதீனாவுக்குள் சிறிதும் பெய்யவில்லை. தன்னுடைய தூதரின் மதிப்பையும் அவர்களின் பிரார்த்தனை ஏற்றுக்கொள்ளப்பட்டதையும் அல்லாஹ் மக்களுக்கு (நேரடியாகக்) காட்டினான்.111 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6094,
			"arabicnumber": 6094,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உண்மை, நிச்சயமாக நன்மைக்கு வழிகாட்டும். நன்மையானது நிச்சயம் சொர்க்கத்திற்கு வழிகாட்டும். ஒரு மனிதர் உண்மை பேசிக்கொண்டே இருப்பார். இறுதியில் அவர் ‘வாய்மையாளர்’ (சித்தீக்- எனும் பெயருக்கு உரியவர்) ஆகிவிடுவார். (இதைப் போன்றே) பொய் நிச்சயமாகத் தீமைக்கு வழிவகுக்கும்; தீமை நரகத்திற்கு வழிவகுக்கும். ஒரு மனிதர் பொய் பேசிக்கொண்டேயிருப்பார். இறுதியில் அவர் அல்லாஹ்விடம் ‘பெரும் பொய்யர்’ எனப் பதிவு செய்யப் பட்டுவிடுவார். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6095,
			"arabicnumber": 6095,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நயவஞ்சகனின் அடையாளங்கள் மூன்று. பேசினால் பொய் சொல்வான்; வாக்களித்தால் மாறு செய்வான்; அவனை நம்பி எதையும் ஒப்படைத்தால் (அதில்) மோசடி செய்வான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.112 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6096,
			"arabicnumber": 6096,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நான் இன்றிரவு (கனவில்) இருவரைப் பார்த்தேன். அவர்கள் என்னிடம் வந்து (என்னைப் பல இடங்களுக்கும் அழைத்துச் சென்று பல காட்சிகளைக் காட்டினார்கள். அவற்றில் ஒன்றுக்கு விளக்கமளிக்கையில்,) “தாடை சிதைக்கப்பட்ட நிலையில் நீங்கள் பார்த்தீர்களே அவர் பெரும் பொய்யர். அவர் பொய் பேச, அது அவரிடமிருந்து பரவி உலகம் முழுவதையும் அடையும். ஆகவே, (நீங்கள் பார்த்த) அந்தத் தண்டனை அவருக்கு மறுமை நாள்வரை கொடுக்கப்படும்” என்று கூறினார்கள். இதை சமுரா பின் ஜுன்துப் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.113 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6097,
			"arabicnumber": 6097,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு அசைவு (நடை), தோற்றம் (உடை), நடத்தை (பாவனை) ஆகிய அனைத்திலும் மக்களிலேயே மிகவும் ஒப்பானவர் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள்தான். (இப்னு உம்மி அப்த் எனப்படும் அவர்கள்) தமது இல்லத்திலிருந்து புறப்பட்டது முதல் வீடு திரும்பும்வரை (அவ்வாறு இருப்பார்கள்.) தம் வீட்டாருடன் தனியாக இருக்கும்போது அவர்கள் எவ்வாறு நடந்துகொள்வார்கள் என்பது எங்களுக்குத் தெரியாது.114 (அறிவிப்பாளர்) இஸ்ஹாக் பின் இப்ராஹீம் (ரஹ்) அவர்கள் கூறினார்கள்: நான் அபூஉசாமா (ரஹ்) அவர்களிடம், “இந்த ஹதீஸை அஃமஷ் (ரஹ்) அவர்கள் தங்களுக்கு அறிவித்தார்களா?” என்று கேட்டேன். (அதற்கு அவர்கள் ‘ஆம்’ என்றார்கள்.) அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6098,
			"arabicnumber": 6098,
			"text": "தாரிக் பின் ஷிஹாப் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், “உரையில் சிறந்தது அல்லாஹ்வின் வேதம் (குர்ஆன்) ஆகும். நடத்தையில் சிறந்தது முஹம்மத் (ஸல்) அவர்களின் நடத்தையாகும்” என்று கூறினார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6099,
			"arabicnumber": 6099,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மனவேதனைக்குள்ளாக்கும் செய்தி கேட்டும் (உடனே தண்டித்துவிடாமல்) மிகவும் பொறுமை காப்பவர் அல்லாஹ்வைவிட வேறு ‘யாருமில்லை’ அல்லது ‘ஏதுமில்லை’. மனிதர்கள் (சிலர்) அவனுக்குக் குழந்தை இருப்பதாகக் கூறுகின்றனர். (இது மன்னிக்க முடியாத குற்றமாக இருந்தும்) அவனோ அவர்களுக்கு உடல்நலத்தையும் உணவு வளத்தையும் வழங்கிக்கொண்டிருக்கிறான். இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6100,
			"arabicnumber": 6100,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஹுனைன் போரில் கிடைத்த செல்வங்களை) வழக்க மாகப் பங்கிடுவதைப் போன்று பங்கிட் டுக்கொண்டிருந்தார்கள். அப்போது அன்சாரிகளில் ஒருவர், “அல்லாஹ்வின் மீதாணையாக! இது அல்லாஹ்வின் திருப்தி நாடப்படாத பங்கீடாகும்” என்று (அதிருப்தியுடன்) கூறினார். நான், “நிச்சயம் (இதைப் பற்றி) நபி (ஸல்) அவர்களிடம் சொல்வேன்” என்று கூறிவிட்டு நபி (ஸல்) அவர்களிடம் சென்றேன். அப்போது நபி (ஸல்) அவர்கள் தம் தோழர்களிடையே இருந்தார்கள். நபி (ஸல்) அவர்களிடம் அதை இரகசியமாகச் சொன்னேன். அது நபி (ஸல்) அவர்களுக்கு மனவருத்தத்தை அளித்தது. அவர்களின் முகமே (நிறம்) மாறிவிட்டது. (அந்த அளவுக்கு) அவர்கள் கோபமடைந்தார்கள். இதையடுத்து நான் அவர்களிடம் (அது பற்றித்) தெரிவிக்காமல் இருந்திருக்கலாமே என்று நினைத்தேன். பிறகு நபி (ஸல்) அவர்கள் “(இறைத் தூதர்) மூசா இதைவிட அதிகமாக மனவேதனைக்கு ஆளாக்கப்பட்டார். இருப்பினும் (பொறுமையுடன்) அவர் சகித்துக்கொண்டார்” என்று சொன்னார்கள்.115 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6101,
			"arabicnumber": 6101,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒன்றைச் செய்தார்கள். (மற்றவர்களுக்கும்) அதைச் செய்ய அனுமதி அளித்தார்கள். அப்போது ஒரு கூட்டத்தார் அதைச் செய்வதிலிருந்து தவிர்ந்துகொண்டனர். இச்செய்தி நபி (ஸல்) அவர்களுக்கு எட்டியபோது (மக்களிடையே) உரையாற்றினார்கள். அப்போது அல்லாஹ்வைப் புகழ்ந்துவிட்டு, “சிலருக்கு என்ன நேர்ந்தது? நான் செய்கின்ற ஒன்றைச் செய்வதிலிருந்து தவிர்ந்துகொள்கிறார்களாமே! அல்லாஹ்வின் மீதாணையாக! நான் அவர்களைவிட அல்லாஹ்வை மிகவும் அறிந்தவன்; அவனை மிகவும் அஞ்சி நடப்பவன் ஆவேன்” என்று சொன்னார்கள். (சம்பந்தப்பட்டவர்களை நேரடியாகக் கண்டிக்கவில்லை.) அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6102,
			"arabicnumber": 6102,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் திரைக்குள் இருக்கும் கன்னிப் பெண்ணைவிடவும் அதிக வெட்கமுடையவர்களாயிருந்தார்கள். தாம் விரும்பாத ஒன்றை அவர்கள் பார்த்து விட்டால், அந்த வெறுப்பை அவர்களின் முகத்திலிருந்தே நாங்கள் அறிந்து விடுவோம்.116 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6103,
			"arabicnumber": 6103,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு மனிதர் தம் (முஸ்லிம்) சகோ தரரை நோக்கி ‘காஃபிரே!’ (இறைமறுப் பாளனே!) என்று கூறினால் நிச்சயம் அவ்விருவரில் ஒருவர் அச்சொல்லுக்கு உரியவராகத் திரும்புவார்.118 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6104,
			"arabicnumber": 6104,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: எந்த மனிதர் தம் (முஸ்லிம்) சகோதர ரைப் பார்த்து ‘காஃபிரே!’ (இறைமறுப் பாளனே!) என்று அழைக்கிறாரோ நிச்சயம் அவ்விருவரில் ஒருவர் அச்சொல்லுக்கு உரியவராகத் திரும்புவார். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6105,
			"arabicnumber": 6105,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யார் இஸ்லாம் அல்லாத மார்க்கத்தின் மீது பொய்ச் சத்தியம் செய்கிறாரோ அவர் தாம் சொன்னதைப் போன்றே ஆகிவிடுகின்றார். எதன் மூலம் ஒருவர் தம்மைத் தற்கொலை செய்துகொள்கிறாரோ அதன் மூலம் அவர் நரக நெருப்பில் வேதனை செய்யப்படுவார். இறை நம்பிக்கையாளரைச் சபிப்பது அவரைக் கொலை செய்வதைப் போன்றதாகும். இறைநம்பிக்கையாளர் ஒருவரை யார் இறைமறுப்பாளர் (காஃபிர்) என்று அவதூறு சொல்கிறாரோ அதுவும் அவரைக் கொலை செய்வதைப் போன்றதாகும்.119 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6106,
			"arabicnumber": 6106,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: முஆத் பின் ஜபல் (ரலி) அவர்கள் நபி (ஸல்) அவர்களுடன் தொழுதுவிட்டுப் பிறகு தம் (பனூ சலமா) கூட்டத்தாரிடம் சென்று அவர்களுக்கு (நபி (ஸல்) அவர்களுடன் தொழுத) அதே தொழு கையைத் தொழுவிப்பது வழக்கம். (ஒருமுறை அவர் இஷா தொழுகை நடத்தும்போது) அவர்களுக்கு (நீண்ட அத்தியாயமான) ‘அல்பகரா’ எனும் (2ஆவது) அத்தியாயத்தை ஓதினார். அப்போது ஒரு மனிதர் (தனியாக விலகிச் சென்று) விரைவாகத் தொழுது(விட்டுத் தமது பணியைக் கவனிக்கச் சென்று)விட்டார். இச்செய்தி முஆத் (ரலி) அவர்களுக்கு எட்டியது. அப்போது அவர்கள், “அவர் ஒரு நயவஞ்சகர் (முனாஃபிக்)” என்று சொன்னார்கள். அந்த மனிதருக்கு இச்செய்தி எட்டியதும் அவர் நபி (ஸல்) அவர்களிடம் சென்று, “அல்லாஹ்வின் தூதரே! நாங்கள் உழைக்கும் வர்க்கத்தினர். எங்கள் ஒட்டகங்கள் மூலம் நீர்ப் பாய்ச்சுவோம். இந்நிலையில் முஆத் அவர்கள் நேற்றிரவு எங்களுக்குத் தொழுவித்தபோது (நீண்ட அத்தியாயமான) ‘அல்பகரா’வை ஓதினார்கள். ஆகவே, நான் (விலகித் தனியாகச் சென்று) விரைவாகத் தொழுதேன். இதனால் அவர் என்னை நயவஞ்சகன் என்று சொன்னாராம்” என்று கூறினார். அப்போது நபி (ஸல்) அவர்கள் (முஆத் (ரலி) அவர்களிடம்), “முஆதே! (நீரென்ன) குழப்பவாதியா?” என்று மூன்று முறை கேட்டார்கள். மேலும், “(நீர் இமாமாக நிற்கும்போது) ஸப்பிஹிஸ்ம ரப்பிக்க, வஷ்ஷம்ஸி வ ளுஹாஹா போன்ற (சற்று சிறிய) அத்தியாயங்களை ஓதுவீராக!” என்றும் சொன்னார்கள்.121 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6107,
			"arabicnumber": 6107,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் யார் சத்தியம் செய்யும் போது (அறியாமைக்கால தெய்வச் சிலைகளான) ‘லாத்’தின் மீதும் ‘உஸ்ஸா’ வின்மீதும் சத்தியமாக என்று கூறிவிட் டாரோ அவர் (அதற்குப் பரிகாரமாக) ‘லா இலாஹ இல்லல்லாஹு’ (அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை) என்று சொல்லட்டும். யார் தம் நண்பரிடம், ‘வா! சூது விளையாடுவோம்’ என்று கூறுகிறாரோ, அவர் (அதற்குப் பரிகாரமாக எதையேனும்) தர்மம் செய்யட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.122 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6108,
			"arabicnumber": 6108,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் பயணிகள் சிலரிடையே இருந்துகொண்டிருந்தபோது அவர்களை நான் அடைந்தேன். அப்போது உமர் (ரலி) அவர்கள் தம் தந்தையின் மீது சத்தியம் செய்தார்கள். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களை அழைத்து, “அறிந்துகொள்ளுங்கள்! உங்கள் தந்தையர்மீது சத்தியம் செய்வதை அல்லாஹ் உங்களுக்குத் தடை செய்துவிட்டான். யார் சத்தியம் செய்ய விழைகிறாரோ அவர் அல்லாஹ்வின் மீது சத்தியம் செய்யட்டும். அல்லது மௌனமாக இருந்துவிடட்டும்” என்று கூறினார்கள்.123 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6109,
			"arabicnumber": 6109,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஒரு பயணத்தை முடித்துக்கொண்டு) என்னிடம் வந்தார்கள். என் வீட்டில் உருவப்படங்கள் உள்ள திரைச்சீலை ஒன்றிருந்தது. (அதைக் கண்ட) நபி (ஸல்) அவர்களின் முகம் (கோபத்தால்) நிறமாறிவிட்டது. பிறகு அவர்கள் அந்தத் திரையை எடுத்துக் கிழித்துவிட்டார்கள். மேலும் அவர்கள், “மறுமை நாளில் மக்களிலேயே மிகக் கடினமான வேதனைக்குள்ளாவோரில் இந்த உருவப்படங்களை வரைகின்றவர்களும் அடங்குவர்” என்று சொன்னார்கள்.125 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6110,
			"arabicnumber": 6110,
			"text": "அபூமஸ்ஊத் உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் வந்து, “(அல்லாஹ்வின் தூதரே!) இன்ன மனிதர் எங்களுக்குத் தொழுகையை நீட்டுவதால் நான் அதிகாலை(க் கூட்டு)த்தொழுகைக்கு (ஃபஜ்ருடைய ஜமாஅத் திற்கு)ச் செல்வதில்லை” என்று கூறினார். இதைக் கேட்டதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஆற்றிய உரையின்போது முன்எப்போதும் இல்லாத அளவுக்குக் கடுமையாகக் கோபம் கொண்டதை நான் கண்டேன். அப்போது அவர்கள், “மக்களே! (வணக்க வழிபாடுகளில்) வெறுப்பை ஏற்படுத்துகின்றவர்களும் உங்களில் உள்ளனர். உங்களில் யாரேனும் மக்களுக்கு (தலைமையேற்று)த் தொழுவித்தால் அவர் சுருக்கமாகத் தொழுகை நடத்தட்டும். ஏனெனில், மக்களில் நோயாளிகளும் முதியோரும் அலுவல் உடையோரும் இருக்கின்றனர்” என்று கூறினார்கள்.126 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6111,
			"arabicnumber": 6111,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஒருமுறை) தொழுதுகொண்டிருக்கையில் பள்ளிவாசலின் கிப்லா திசையில் (சுவரில் உமிழப்பட்டிருந்த) சளியைக் கண்டார்கள். அதனால் கோபமடைந்த அவர்கள் அதை (மட்டை ஒன்றினால்) தமது கரத்தாலேயே சுரண்டிவிட்டார்கள். பிறகு, “நீங்கள் தொழுகையில் இருக்கும்போது இறைவன் உங்கள் எதிரே இருக்கின்றான். எனவே, எவரும் தொழுகையில் இருக்கும்போது தமது முகத்துக்கு எதிரே உமிழ வேண்டாம்” என்று சொன்னார்கள்.127 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6112,
			"arabicnumber": 6112,
			"text": "ஸைத் பின் காலித் அல்ஜுஹனீ (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் (சாலையில்) கண்டெடுக்கும் பொருளைப் பற்றிக் கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “ஓராண்டு காலத்திற்கு அதைப் பற்றி அறிவிப்புச்செய்! பிறகு, அதன் முடிச்சையும் அதன் பை(உறை) யையும் பாதுகாத்து வைத்திரு! பிறகு (யாரும் உரிமை கோராவிட்டால்) நீயே அதனைச் செலவழித்துக்கொள்! பின்னர் அதன் உரிமையாளர் உன்னிடம் (அதன் அடையாளத்தைக் கூறியபடி) வந்தால் அவரிடம் அதை ஒப்படைத்துவிடு!” என்று சொன்னார்கள். அந்த மனிதர், “அல்லாஹ்வின் தூதரே! வழிதவறி (நம்மிடம் வந்து சேர்ந்து)விட்ட ஆட்டை என்ன செய்வது?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “அதை நீ பிடித்துக்கொள். ஏனெனில், அது உனக்கு உரியது; அல்லது உன் சகோதரருக்கு உரியது; அல்லது ஓநாய்க்குரியது” என்று சொன்னார்கள். அந்த மனிதர், “அல்லாஹ்வின் தூதரே! வழிதவறி வந்த ஒட்டகத்தை என்ன செய்வது?” என்று கேட்டார். (இதை அவர் கேட்ட) உடன் கோபத்தால் அல்லாஹ்வின் தூதர் (ஸல்) ‘அவர்களுடைய இரு கன்னங்களும் சிவந்துவிட்டன’ அல்லது ‘அவர்களின் முகம் சிவந்துவிட்டது’. பிறகு, “உனக்கும் அதற்கும் என்ன சம்பந்தம்? அதை அதன் எசமான் சந்திக்கும்வரை (நடப்பதற்கு) அதன் குளம்பும் (குடிப்பதற்கு) அதன் தண்ணீர் பையும் அதனிடம் உள்ளதே!” என்று கேட்டார்கள்.128 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6113,
			"arabicnumber": 6113,
			"text": "ஸைத் பின் ஸாபித் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ரமளான் மாதத்தின் ஓர் இரவில்) பாயினால் ஒரு சிறிய அறையை (பள்ளி வாசலில்) அமைத்துக்கொண்டு அதில் தொழுவதற்காகப் புறப்பட்டார்கள். அந்த இடத்தைத் தேடி (நபித்தோழர்களில்) சிலரும் வந்து நபி (ஸல்) அவர்களைப் பின்பற்றித் தொழலாயினர். பிறகு அடுத்த நாள் இரவும் வந்து கூடினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தோழர்களிடம் வராமல் தாமதப்படுத்தி னார்கள். எனவே, தோழர்கள் தங்களது குரலை எழுப்பி (சப்தமிட்ட)னர். (நபிய வர்களுக்கு நினைவூட்ட அவர்களது வீட்டுக்) கதவின் மீது சிறு கற்களை எறிந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோபத்துடன் அவர்களை நோக்கி வந்து, “(இத்தொழுகையில் கலந்துகொள்ளும்) உங்களுடைய இச்செயல் தொடர்ந்துகொண்டே போகிறது. (இத்தொழுகை) உங்கள்மீது கடமையாக்கப்பட்டுவிடுமோ என்று நான் எண்ணி (அஞ்சி)னேன். (அதனால்தான் இன்று நான் உங்களிடம் வரவில்லை.) எனவே, உங்கள் இல்லங்களிலேயே (கூடுதலான) தொழுகையைத் தொழுது வாருங்கள். கடமையாக்கப்பட்ட தொழுகை தவிர மற்றத் தொழுகைகளை ஒருவர் தமது வீட்டிலேயே நிறைவேற்றுவதுதான் சிறந்ததாகும்” என்று சொன்னார்கள்.129 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6114,
			"arabicnumber": 6114,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மக்களைத் தனது பலத்தால் அதிகமாக அடித்து வீழ்த்துபவன் வீரன் அல்லன்; உண்மையில் வீரன் என்பவன், கோபத்தின்போது தன்னை ஆள்பவனே ஆவான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6115,
			"arabicnumber": 6115,
			"text": "சுலைமான் பின் ஸுரத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் அருகில் இரண்டு பேர் ஒருவரையொருவர் திட்டிக்கொண்டார்கள். அப்போது நாங்கள் நபி (ஸல்) அவர்கள் அருகில் அமர்ந்துகொண்டிருந்தோம். அவர்களில் ஒருவரது முகம் சிவந்துவிட்டிருக்க கோபத்துடன் தம் தோழரைத் திட்டிக்கொண்டிருந்தார். அப்போது நபி (ஸல்) அவர்கள், “எனக்கு ஒரு (பிரார்த்தனை) வார்த்தை தெரியும். அதை இவர் சொல்வாராயின் இவருக்கு ஏற்பட்டுள்ள கோபம் போய்விடும். ‘அவூது பில்லாஹி மினஷ் ஷைத்தானிர் ரஜீம்’ (சபிக்கப்பட்ட ஷைத்தானிடமிருந்து அல்லாஹ்விடம் பாதுகாப்புக் கோருகிறேன்) என்பதே அச்சொல்லாகும்” என்று கூறினார்கள். ஆகவே, மக்கள் அம்மனிதரிடம், “நபி (ஸல்) அவர்கள் சொல்வதை நீர் செவியேற்கவில்லையா?” என்று கூறினர். அந்த மனிதர், “நான் பைத்தியக்காரன் அல்லன்” என்று சொன்னார்.130 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6116,
			"arabicnumber": 6116,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம், “எனக்கு அறிவுரை கூறுங்கள்” என்றார். நபி (ஸல்) அவர்கள், “கோபத்தைக் கைவிடு” என்று (அறிவுரை) கூறினார்கள். அவர் (“அறிவுரை கூறுங்கள்” எனப்) பலமுறை கேட்டபோதும் நபி (ஸல்) அவர்கள் “கோபத்தைக் கைவிடு” என்றே சொன்னார்கள்.131 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6117,
			"arabicnumber": 6117,
			"text": "அபுஸ் ஸவ்வார் அல்அதவீ (ரஹ்) அவர்கள் கூறியதாவது: இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள், “நாணம் நன்மையே தரும்” என நபி (ஸல்) அவர்கள் சொன்னார்கள் என்று கூறினார்கள். அப்போது புஷைர் பின் கஅப் (ரஹ்) அவர்கள், “சில (வகை) நாணத்தில் கம்பீரம் உண்டு. சில (வகை) நாணத்தில் மனஅமைதி உண்டு எனத் தத்துவ(ப் புத்தக)த்தில் எழுதப்பட்டுள்ளது” என்று கூறினார். அப்போது அவரிடம் இம்ரான் (ரலி) அவர்கள், “நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (கூறியது) பற்றி உங்களுக்குச் சொல்லிக்கொண்டிருக்கி றேன். நீங்கள் உங்கள் ஏட்டில் உள்ளவை குறித்துச் சொல்லிக்கொண்டிருக்கிறீர் களே!” என்று கேட்டார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6118,
			"arabicnumber": 6118,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (அன்சாரிகளில்) ஒருவரைக் கடந்து சென்றார்கள். அவர் வெட்கப்படுவது தொடர்பாகத் தம் சகோதரரைக் கண்டித்துக்கொண்டிருந்தார். “நீ (அதிகமாக) வெட்கப்படுகிறாய். (இதனால் உனக்கு வரவேண்டிய நன்மைகள் பாதிக்கப்படுகின்றன.) வெட்கத்தால் உனக்கு இழப்புதான்” என்பதுபோல் சொல்லிக்கொண்டிருந்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவரை விட்டுவிடு! நாணம் இறைநம்பிக்கையில் ஓரம்சமாகும்” என்று சொன்னார்கள்.133 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6119,
			"arabicnumber": 6119,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் திரைக்குள் இருக்கும் கன்னிப் பெண்ணைவிடவும் அதிகக் கூச்ச சுபாவம் உள்ளவர்களாய் இருந்தார்கள்.134 இதை அப்துல்லாஹ் பின் அபீஉத்பா (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6120,
			"arabicnumber": 6120,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: மக்கள் முந்தைய இறைத்தூதர்களின் (முது)மொழிகளிலிருந்து அடைந்து கொண்ட ஒன்றுதான், “உனக்கு நாணம் இல்லையேல் நாடியதைச் செய்துகொள்” என்பதும். இதை அபூமஸ்ஊத் உக்பா பின் ஆமிர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.135 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6121,
			"arabicnumber": 6121,
			"text": "உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: உம்மு சுலைம் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களி டம் வந்து, “அல்லாஹ்வின் தூதரே! சத்தி யத்தைச் சொல்ல அல்லாஹ் வெட்கப் படுவதில்லை. ஒரு பெண்ணுக்குத் தூக்கத்தில் ஸ்கலிதம் ஏற்பட்டால் அவள்மீது குளியல் கடமையாகுமா?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “ஆம். அவள் (மதன) நீரைப் பார்த்தால் (குளியல் அவள்மீது கடமைதான்)” என்று பதிலளித்தார்கள்.136 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6122,
			"arabicnumber": 6122,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியாதாவது: “இறைநம்பிக்கையாளரின் நிலை பசுமையான ஒரு மரத்தைப் போன்ற தாகும். அதன் இலை உதிர்வதில்லை; (அதன் இலைகள் ஒன்றோடொன்று) உராய்வதில்லை” என்று நபி (ஸல்) அவர்கள் சொன்னார்கள். அப்போது மக்கள், “அது இன்ன மரம்; அது இன்ன மரம்” என்று கூறினர். அது பேரீச்ச மரம்தான் என்று நான் கூற நினைத்தேன். நான் இளவயதுக்காரனாக இருந்ததால் வெட்கப்பட்(டுக்கொண்டு சொல்லாமல் இருந்துவிட்)டேன். அப்போது நபி (ஸல்) அவர்கள், “அது பேரீச்சமரம்” என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில் இப்னு உமர் (ரலி) அவர்கள், “நான் அது குறித்து என் தந்தை உமர் (ரலி) அவர்களிடம் எடுத்துரைத்தேன். அப்போது அவர்கள், “நீ அதைச் சொல்லியிருந்தால் அது எனக்கு இன்ன இன்னவற்றைவிட உவப்பானதாய் இருந்திருக்கும்” என்று கூறியதாக இடம்பெற்றுள்ளது.137 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6123,
			"arabicnumber": 6123,
			"text": "ஸாபித் அல்புனானீ (ரஹ்) அவர்கள் கூறியதாவது: “ஒரு பெண்மணி நபி (ஸல்) அவர்களிடம் வந்து தன்னை மணமுடித்துக் கொள்ளுமாறு கூறினார். அப்போது அந்தப் பெண் ‘(மணமுடித்துக்கொள்ள) தங்களுக்கு நான் தேவையா?’ என்று கேட்டார்” என அனஸ் (ரலி) அவர்கள் கூறினார்கள். அப்போது அனஸ் (ரலி) அவர்களுடைய புதல்வியார் “என்ன வெட்கங்கெட்டதனம்!” என்று (ஆச்சரியத்துடன்) கேட்டார். அதற்கு அனஸ் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தன்னை மணந்துகொள்ளும்படி கோரிய அந்தப் பெண் உன்னைவிடச் சிறந்தவர் ஆவார்” என்று சொன்னார்கள்.138 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6124,
			"arabicnumber": 6124,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னையும் முஆத் பின் ஜபல் (ரலி) அவர்களையும் (‘விடைபெறும்’ ஹஜ்ஜுக்கு முன்பு யமன் நாட்டுக்கு) அனுப்பியபோது எங்கள் இருவரிடமும், “(மார்க்க விஷயங்களில் மக்களிடம்) எளிதாக நடந்துகொள்ளுங்கள். (மக்களைச்) சிரமப்படுத்தாதீர்கள். நற்செய்தி(களை அதிகம்) கூறுங்கள். (எச்சரிக்கை செய்யும்போதுகூட) வெறுப்பேற்றி விடாதீர்கள். (தீர்ப்பளிக்கும்போது) ஒத்த கருத்துடன் நடந்துகொள்ளுங்கள் (பிளவு பட்டுவிடாதீர்கள்)” என்று சொன்னார்கள். நான், “அல்லாஹ்வின் தூதரே! எங்கள் (பிறந்தகமான) யமன் நாட்டில் தேனில் ‘அல்பித்உ’ எனப்படும் ஒருவகை பானமும் தொலி நீக்கப்படாத கோதுமையில் ‘மிஸ்ர்’ என்று கூறப்படும் ஒருவகை பானமும் தயாரிக்கப்படுகிறது (அவற்றின் சட்டம் என்ன?)” என்று கேட்டேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “போதை தரக்கூடிய ஒவ்வொன்றும் தடை செய்யப்பட்டது (ஹராம்) ஆகும்” என்று பதிலளித்தார்கள்.141 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6125,
			"arabicnumber": 6125,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (மார்க்க விஷயங்களில்) எளிதாக நடந்துகொள்ளுங்கள்; (மக்களைச்) சிரமப்படுத்தாதீர்கள். ஆறுதலாக நடந்துகொள்ளுங்கள்; வெறுப்பேற்றிவிடாதீர்கள். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.142 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6126,
			"arabicnumber": 6126,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: இரண்டு விஷயங்களில் விரும்பியதைத் தேர்வு செய்துகொள்ளும்படி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கூறப்பெற்றால், அவர்கள் அவ்விரண்டில் எளிதானதையே -அது பாவமான விஷயமாக இல்லாதிருக்கும்பட்சத்தில்- எப்போதும் தேர்வு செய்வார்கள். அது பாவமான விஷயமாக இருந்தால் அதிóருந்து (விலகி) வெகு தொலைவில் நிற்பார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தமக்காக எதிலும் (யாரையும்) ஒருபோதும் பழிவாங்கியதில்லை; இறைவனின் புனித(ச் சட்ட)ம் ஏதும் சீர்குலைக்கப்பட்டு, அதற்குப் பதிலாக அல்லாஹ்வின் சார்பாகத் தண்டிக்க வேண்டுமென்று இருந்தால் தவிர! (அப்போது மட்டும் பழிவாங்குவார்கள்).143 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6127,
			"arabicnumber": 6127,
			"text": "அஸ்ரக் பின் கைஸ் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் (ஈரானிலுள்ள) ‘அஹ்வாஸ்’ எனுமிடத்திலிருக்கும் ஓர் ஆற்றங்கரை யில் இருந்துகொண்டிருந்தோம்.-அதில் தண்ணீர் வற்றிப்போயிருந்தது.- அப்போது அபூபர்ஸா அல்அஸ்லமீ (ரலி) அவர்கள் குதிரையொன்றில் வந்து (இறங்கி) அந்தக் குதிரையை அவிழ்த்துவிட்டுத் தொழுதார்கள். அப்போது அந்தக் குதிரை நடக்கலாயிற்று. உடனே அபூபர்ஸா (ரலி) அவர்கள் தமது தொழுகையை விட்டுவிட்டு குதிரையைப் பின்தொடர்ந்து சென்று, அதை அடைந்து பிடித்துக்கொண்டார்கள். பிறகு வந்து தமது தொழுகையை நிறைவு செய்தார்கள். எங்களிடையே (மாறுபட்ட) சிந்தனைகொண்ட (காரிஜிய்யாக்களில்) ஒரு மனிதர் இருந்தார். அவர், “ஒரு குதிரைக்காகத் தமது தொழுகையையே விட்டுவிட்ட இந்த முதியவரைப் பாருங்கள்” என்று கூறியவாறு (சபித்தவராக) முன்னோக்கி வந்தார். உடனே அபூபர்ஸா (ரலி) அவர்கள் அவரைப் பார்த்து, “நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பிரிந்ததிலிருந்து என்னுடன் யாரும் (இவ்வளவு) கடுமையாக நடந்துகொண்டதில்லை. எனது இல்லம் தொலைவில் உள்ளது. நான் (எனது குதிரையை) விட்டுவிட்டு தொழுதுகொண்டிருந்தால் (அது எங்காவது போய்விடும். பிறகு) நான் என் வீட்டாரிடம் இரவுவரை போய்ச் சேர முடியாது” என்று கூறினார்கள். மேலும், தாம் நபி (ஸல்) அவர்களுடன் தோழமை கொண்டிருந்ததாகவும் அப்போது நபி (ஸல்) அவர்கள் (எதிலும்) எளிதாக நடந்துகொண்டதாகவும் குறிப்பிட் டார்கள்.144 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6128,
			"arabicnumber": 6128,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு கிராமவாசி மஸ்ஜிது(ந் நபவீ பள்ளிவாசலு)க்குள் சிறுநீர் கழித்துவிட்டார். அவரைத் தாக்குவதற்காக அவரை நோக்கி மக்கள் குதித்தெழுந்தனர். அப்போது மக்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவரை விட்டுவிடுங்கள்; அவர் கழித்த சிறுநீர் மீது ஒரு வாளித் தண்ணீரை ஊற்றிவிடுங்கள். (எப்போதும்) நளினமாக நடந்துகொள்ளவே நீங்கள் அனுப்பப்பட்டுள்ளீர்கள். கடினமாக நடந்துகொள்ள நீங்கள் அனுப்பப்படவில்லை” என்று கூறினார்கள்.145 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6129,
			"arabicnumber": 6129,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் எங்களுடன் (இனிமையாகப்) பழகுவார்கள். எந்த அளவுக்கென்றால், சிறுவனாக இருந்த என் தம்பியிடம், “அபூஉமைரே! பாடும் உனது சின்னக் குருவி (புள்புள்) என்ன ஆயிற்று?” என்றுகூடக் கேட்பார்கள்.146 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6130,
			"arabicnumber": 6130,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் (சிறுமியாக இருந்தபோது) நபி (ஸல்) அவர்களுக்கு அருகில் பொம்மைகள் வைத்து விளையாடுவேன். எனக்குச் சில தோழியர் இருந்தனர். அவர்கள் என்னுடன் விளையாடிக்கொண்டிருப்பார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வீட்டுக்குள் நுழைந்தால் அவர்களைக் கண்டதும் தோழியர் (பயந்துகொண்டு) திரைக்குள் ஒளிந்துகொள்வார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என் தோழியரை என்னிடம் அனுப்பிவைப்பார்கள். தோழிகள் என்னுடன் (சேர்ந்து) விளையாடுவார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6131,
			"arabicnumber": 6131,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் (எங்கள் வீட்டுக்குள் நுழைய) நபி (ஸல்) அவர்களிடம் அனுமதி கேட்டார். அப்போது நபி (ஸல்) அவர்கள், “அவருக்கு (உள்ளே வர) அனுமதி கொடுங்கள்; (இவர்) அந்தக் கூட்டத்தாரிலேயே (மிக) மோசமானவர்” என்று சொன்னார்கள். (வீட்டுக்குள்) அவர் வந்தபோது (எல்லாரிடமும் பேசுவதுபோல்) அவரிடமும் கனிவாகப் பேசினார்கள். (அவர் சென்றதும்) நான், “அல்லாஹ்வின் தூதரே அந்த மனிதரைப் பற்றித் தாங்கள் ஒன்று சொன்னீர்கள். பிறகு அவரிடமே கனிவாகப் பேசினீர்களே?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “ஆயிஷா! மக்கள் யாருடைய அருவருப்பான பேச்சுகளிலிருந்து தங்களைக் காத்துக்கொள்வதற்காக அவரிடமிருந்து ஒதுங்குகிறார்களோ அவரே இறைவனிடம் தகுதியில் மிகவும் மோசமானவர்” என்று கூறினார்கள்.148 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6132,
			"arabicnumber": 6132,
			"text": "அப்துல்லாஹ் பின் அபீமுளைக்கா (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்குப் பொன் பித்தான்கள் கொண்ட பட்டு அங்கிகள் சில அன்பளிப்பாக வழங்கப்பட்டன. அவற்றை அவர்கள் தம் தோழர்கள் சிலரிடையே பங்கிட்டார்கள். அவற்றி லிருந்து ஒன்றை மக்ரமா பின் நவ்ஃபல் (ரலி) அவர்களுக்காகத் தனியே எடுத்து வைத்தார்கள். மக்ரமா (ரலி) அவர்கள் வந்தபோது நபி (ஸல்) அவர்கள் (அந்த அங்கியுடன் வந்து) “உங்களுக்காக நான் இதை எடுத்து வைத்தேன்” என்று சொன்னார்கள். அய்யூப் (ரஹ்) அவர்களின் அறிவிப் பில், “அந்த ஆடையை எடுத்துவந்து அவரிடம் காட்டியவாறு” என்றும், “மக்ரமா (ரலி) அவர்களின் சுபாவத்தில் சிறிது (கடுமை) இருந்தது” என்றும் கூறப்பெற்றுள்ளது.149 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஹாத்திம் பின் வர்தான் (ரஹ்) அவர்களது அறிவிப்பில், “நபி (ஸல்) அவர்களிடம் சில அங்கிகள் வந்தன” என்று மிஸ்வர் (ரலி) அவர்களிடமிருந்தே (அறிவிப்பாளர்தொடர் முறிவுறாமல்- முத்தஸிலாக) அறிவிக்கப்பட்டுள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6133,
			"arabicnumber": 6133,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளர் ஒரே புற்றில் இரண்டு முறை தீண்டப்படமாட்டார்.150 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6134,
			"arabicnumber": 6134,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம் வந்து, “நீர் இரவெல்லாம் நின்று வணங்குவதாகவும் பகலெல்லாம் நோன்பு நோற்பதாகவும் எனக்குத் தெரிவிக்கப்பட்டதே! (அது உண்மை தானா?)” என்று கேட்டார்கள். நான், “ஆம்” என்று பதிலளித்தேன். (அதற்கு) நபி (ஸல்) அவர்கள், “அவ்வாறு செய்யாதீர்! (சிறிது நேரம்) தொழுவீராக! (சிறிது நேரம்) உறங்குவீராக! (சிலநாட்கள்) நோன்பு நோற்பீராக! (சில நாட்கள் நோன்பை) விட்டுவிடுவீராக! ஏனெனில், உமது உடலுக்குச் செய்ய வேண்டிய கடமையும் உமக்கு உண்டு; உமது கண்ணுக்குச் செய்ய வேண்டிய கடமையும் உமக்கு உண்டு; உம்முடைய விருந்தினருக்குச் செய்ய வேண்டிய கடமையும் உமக்கு உண்டு; உம்முடைய துணைவிக்குச் செய்ய வேண்டிய கடமையும் உமக்கு உண்டு. உமது வயது நீளக்கூடும். (அப்போது உம்மால் தொடர்நோன்பும் தொடர் வழிபாடும் சாத்தியப்படாமல்போகலாம். ஆகவே) ஒவ்வொரு மாதமும் (ஏதேனும்) மூன்று நாட்கள் நோன்பு நோற்பது உமக்குப் போதுமானதாகும். ஏனெனில், ஒவ்வொரு நற்செயலுக்கும் பிரதியாக அது போன்ற பத்து மடங்கு (நற்பலன்)கள் உண்டு. (இதன்படி மாதத்தில் மூன்று நாட்கள் நோன்பு நோற்பது மாதம் முழுவதும் நோற்றதற்குச் சமமாகும்.) எனவே, இது காலமெல்லாம் நோற்றதாக அமையும்” என்று கூறினார்கள். ஆனால், நான் சிரமத்தை வலிந்து ஏற்றுக்கொண்டேன்; அதனால் என்மீது சிரமம் சுமத்தப்பட்டது. நான் “(அல்லாஹ்வின் தூதரே!) இதற்கு மேலும் என்னால் முடியும்” என்றேன். நபி (ஸல்) அவர்கள், “அவ்வாறாயின், வாரத்திற்கு மூன்று நோன்பு நோற்றுக்கொள்க” என்றார்கள். நான் (மறுபடியும்) சிரமத்தை வலிந்து ஏற்றுக்கொண்டேன்; அதனால் என்மீது சிரமம் சுமத்தப்பட்டது. “இதற்கு மேலும் என்னால் முடியும் (அல்லாஹ்வின் தூதரே!)” என்றேன். நபி (ஸல்) அவர்கள், “அவ்வாறாயின், இறைத்தூதர் தாவூத் (அலை) அவர்கள் நோற்றவாறு நோன்பு நோற்றுக்கொள்வீராக” என்றார்கள். “இறைத்தூதர் தாவூத் (அலை) அவர்களின் நோன்பு எது?” என்று கேட்டேன். “(ஒருநாள் விட்டு ஒருநாள் நோற்பதால்) வருடத்தில் பாதி நாட்கள் நோற்பதாகும்” என்று பதிலளித்தார்கள்.151 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6135,
			"arabicnumber": 6135,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் தம் விருந்தினரைக் கண்ணியப்படுத்தட்டும். விருந்தினருக்கு அளிக்கும் கொடை என்பது, ஒரு பகல் ஓர் இரவு (உபசரிப்பது) ஆகும். விருந்தோம்பல் மூன்று தினங்களாகும். அதற்குமேலுள்ள (உபசரிப்பான)து தர்மமாக அமையும். (உபசரிக்கும்) அவரைச் சிரமப்படுத்தும் அளவுக்கு அவரிடம் தங்குவது விருந்தாளிக்கு அனுமதிக்கப்பட்டதன்று. இதை அபூஷுரைஹ் குவைலித் பின் அம்ர் (ரலி) அவர்கள் அறிவிக்கி றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், “அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் நல்லதைப் பேசட்டும். அல்லது வாய்மூடி இருக்கட்டும்” என்று கூடுதலாக இடம்பெற்றுள்ளது.152 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6136,
			"arabicnumber": 6136,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: அல்லாஹ்வையும் மறுமை நாளை யும் நம்பிக்கை கொண்டவர் தம் அண்டை வீட்டாருக்குத் தொல்லை தர வேண்டாம். அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் தம் விருந்தினரைக் கண்ணியப்படுத்தட்டும். அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் (ஒன்று) நல்லதைப் பேசட்டும்; அல்லது வாய்மூடி இருக்கட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.153 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6137,
			"arabicnumber": 6137,
			"text": "உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: நாங்கள், “அல்லாஹ்வின் தூதரே! தாங்கள் எங்களை ஒரு சமூகத்தாரிடம் அனுப்பிவைக்கிறீர்கள். நாங்களும் (அங்கு) சென்று அவர்களிடம் தங்குகிறோம். ஆனால், அவர்கள் எங்களை உபசரிக்க மறுக்கின்றார்கள். அவ்வாறெனில், அது குறித்து தாங்கள் என்ன கருதுகின்றீர்கள்?” என்று கேட்டோம். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம், “நீங்கள் ஒரு சமூகத்தாரிடம் செல்ல, அவர்கள் விருந்தினர்களுக்கு வேண்டிய வசதிகளை உங்களுக்குச் செய்துதர ஏற்பாடு செய்தால் அதை ஏற்றுக்கொள்ளுங்கள். அவர்கள் அப்படிச் செய்யவில்லையென்றால் அவர்களிடமிருந்து விருந்தினர்க(ளான உங்க)ளுக்குத் தேவையான விருந்தினர் உரிமையை (நீங்களே) எடுத்துக்கொள்ளுங்கள்” என்று பதிலளித்தார்கள்.154 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6138,
			"arabicnumber": 6138,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் தம் விருந்தினரைக் கண்ணியப்படுத்தட்டும். அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் தம் இரத்த உறவுகளைப் பேணிவாழட்டும். அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் (ஒன்று) நல்ல தைப் பேசட்டும்; அல்லது வாய்மூடி இருக்கட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6139,
			"arabicnumber": 6139,
			"text": "அபூஜுஹைஃபா (ரலி) அவர்கள் கூறியதாவது: சல்மான் அல்ஃபார்சீ (ரலி) அவர்களை யும் அபுத்தர்தா (ரலி) அவர்களையும் நபி (ஸல்) அவர்கள் (ஒப்பந்தச்) சகோதரர்களாக ஆக்கினார்கள். ஆகவே, சல்மான் (ரலி) அவர்கள் அபுத்தர்தா (ரலி) அவர்களை (அவரது இல்லத்திற்குச் சென்று) சந்தித்தார்கள். அப்போது (அபுத்தர்தாவின் துணைவியார்) உம்முத்தர்தா (ரலி) அவர்களை அழுக்கடைந்த ஆடையுடன் சல்மான் கண்டார்கள். அப்போது சல்மான் (ரலி) அவர்கள், “உங்களுக்கு என்ன நேர்ந்தது?” என்று கேட்டார்கள். அதற்கு உம்முத்தர்தா, “உங்கள் சகோதரர் அபுத்தர்தாவிற்கு உலகமே தேவையில்லைபோலும்” என்றார். பிறகு, அபுத்தர்தா (ரலி) அவர்கள் வந்து சல்மான் (ரலி) அவர்களுக்காக உணவு தயார் செய்தார்கள். பிறகு “(சல்மானே!) நீங்கள் சாப்பிடுங்கள்! நான் (நஃபில்) நோன்பு நோற்றுள்ளேன்” என்றார்கள் அபுத்தர்தா. அதற்கு சல்மான் (ரலி) அவர்கள், “நீங்கள் சாப்பிடாத வரை நான் சாப்பிடமாட்டேன்” என்று சொன்னார்கள். ஆகவே, (சல்மானுடன்) அபுத்தர்தா சாப்பிட்டார்கள். இரவு நேரம் வந்ததும் அபுத்தர்தா (ரலி) அவர்கள் (இரவுத் தொழுகைக்காக) நிற்கப்போனார்கள். அப்போது சல்மான் (ரலி) அவர்கள், “தூங்குங்கள்” என்றார்கள். ஆகவே, அபுத்தர்தா (ரலி) அவர்கள் தூங்கிவிட்டார்கள். பிறகு தொழுவதற்காக எழுந்தார்கள். அப்போதும் சல்மான் (ரலி) அவர்கள், “தூங்குங்கள்” என்றார்கள். இரவின் கடைசி நேரம் ஆனதும் சல்மான் (ரலி) அவர்கள், “இப்போது எழுங்கள்” என்று சொன்னார்கள். பிறகு அவர்கள் இருவரும் தொழுதார்கள். அப்போது சல்மான் (ரலி) அவர்கள் அபுத்தர்தா (ரலி) அவர்களிடம், “உங்கள் இறைவனுக்காகச் செய்ய வேண்டிய கடமைகள் உங்களுக்கு உள்ளன. மேலும், உங்கள் உடலுக்குச் செய்ய வேண்டிய கடமைகளும் உங்களுக்கு உள்ளன. உங்கள் குடும்பத்தாருக்குச் செய்யவேண்டிய கடமைகளும் உங்களுக்கு உள்ளன. ஆகவே, ஒவ்வொருவருக்கும் அவரவருக்குச் சேரவேண்டிய உரிமைகளை வழங்குங்கள்” என்று கூறினார்கள். பின்னர் அபுத்தர்தா (ரலி) அவர்கள், நபி (ஸல்) அவர்களிடம் சென்று (சல்மான் அவர்கள் தமக்குச் சொன்னதை) அவர்களிடம் தெரிவித்தார்கள். அப்போது அவர்களிடம் நபி (ஸல்) அவர்கள், “சல்மான் சொன்னது உண்மைதான்” என்றார்கள்.155 அபூஜுஹைஃபா வஹ்புஸ் ஸுவாஈ (ரலி) அவர்களுக்கு ‘வஹ்புல் கைர்’ என்றும் (பெயர்) சொல்லப்படுகிறது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6140,
			"arabicnumber": 6140,
			"text": "அப்துர் ரஹ்மான் பின் அபீபக்ர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை) அபூபக்ர் (ரலி) அவர்களிடம் (மூன்றுபேர் கொண்ட) ஒரு குழுவினர் விருந்தினராக வந்தார்கள். அப்போது அபூபக்ர் (ரலி) அவர்கள் என்னிடம், “உன் விருந்தினரைக் கவனித்துக்கொள். நான் நபி (ஸல்) அவர்களிடம் செல்கிறேன். நான் வருவதற்கு முன் அவர்களை விருந்துண்ணச் செய்து விடு” என்று கூறினார்கள். நான் சென்று, எங்களிடமிருந்த உணவை அவர்களிடம் கொண்டுவந்து, “உண்ணுங்கள்!” என்றேன். அதற்கு அவர்கள், “வீட்டுக்காரர் எங்கே?” என்று கேட்டனர். நான் அவர்களிடம், “நீங்கள் உண்ணுங்கள்” என்றேன். அவர்கள் “வீட்டுக்காரர் வராத வரை நாங்கள் சாப்பிடமாட்டோம்” என்று கூறினர். அதற்கு, “நான் அளிக்கும் விருந்தை ஏற்று உண்ணுங்கள். ஏனெனில், நீங்கள் உண்ணாத நிலையில் என் தந்தை வந்துவிட்டால் அவர்கள் நம்மைக் கண்டிப்பார்கள்” என்றேன். ஆனால், அவர்கள் (சாப்பிட) மறுத்துவிட்டார்கள். மேலும், அபூபக்ர் (ரலி) அவர்கள் வந்தால் என்மீது கோபப்படுவார்கள் என்பதை நான் புரிந்துகொண்டேன். என் தந்தை வந்தபோது நான் அவர்களிடமிருந்து விலகி (ஒளிந்து)கொண்டேன். அவர்கள் “(விருந்தாளிகளுக்கு) என்ன செய்தீர்கள்?” என (வீட்டாரிடம்) கேட்டார்கள். அவர்கள் நடந்ததைத் தெரிவித்தார்கள். அப்போது என் தந்தை, “அப்துர் ரஹ்மானே!” என்று கூப்பிட்டார்கள். நான் (பயத்தால் பதிலளிக்காமல்) மௌனமாயிருந்தேன். பிறகு “அப்துர் ரஹ்மானே!” என்று (மீண்டும்) கூப்பிட்டார்கள். நான் (அப்போதும்) மௌனமாயிருந்தேன். பிறகு (மூன்றாம் முறை) “அறிவில்லாதவனே! உன் (இறைவன்)மீது சத்தியம் செய்கிறேன். என் குரல் உனக்குக் கேட்குமானால் நீ வந்தாக வேண்டும்” என்றார்கள். உடனே நான் வெளியே வந்தேன். “தங்கள் விருந்தினரிடமே கேளுங்கள்” என்றேன். அப்போது விருந்தினர், “அவர் எங்க ளிடம் உணவைக் கொண்டுவந்தார். (நாங்கள்தான் ஏற்றுக்கொள்ளவில்லை)” என்றனர். என் தந்தை, “என்னைத்தானே எதிர்பார்த்தீர்கள்? அல்லாஹ்வின் மீதாணையாக! (இவ்வளவு தாமதத்திற்குக் காரணமாகிவிட்ட) நான் இன்றிரவு சாப்பிடப்போவதில்லை” என்றார்கள். மற்றவர்களோ “அல்லாஹ்வின் மீதாணையாக! நீங்கள் சாப்பிடாத வரை நாங்களும் சாப்பிடமாட்டோம்” என்று கூறினர். அபூபக்ர் (ரலி) அவர்கள் “இன்றிரவைப் போன்று ஒரு தர்மசங்கடமான இரவை நான் கண்டதில்லை” என்று கூறிவிட்டு, “உங்களுக்கு என்ன கேடு! எங்கள் விருந்தை ஏன் நீங்கள் ஏற்க மறுக்கிறீர்கள்? (அப்துர் ரஹ்மானே!) உன் உணவைக் கொண்டுவா!” என்றார்கள். நான் கொண்டுவந்தேன். அதில் என் தந்தை தமது கையை வைத்து “அல்லாஹ்வின் திருப்பெயரால் (ஆரம்பம்). (நான் உண்ணமாட்டேன் எனச் சத்தியம் செய்த) முதல் நிலை ஷைத்தானால் விளைந்தது” என்றார்கள். பிறகு அவர்களும் சாப்பிட்டார்கள். விருந்தினரும் சாப்பிட்டனர்.156 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6141,
			"arabicnumber": 6141,
			"text": "அப்துர் ரஹ்மான் பின் அபீபக்ர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை) அபூபக்ர் (ரலி) அவர்கள் ‘தம் விருந்தாளியுடன்’ அல்லது ‘தம் விருந்தினருடன்’ (எங்கள் வீட்டிற்கு) வந்தார்கள். பிறகு மாலையில் (இஷா தொழும் வரை) நபி (ஸல்) அவர்களிடம் இருந்தார் கள். பிறகு அவர்கள் (திரும்பி) வந்த போது என் தாயார் (உம்மு ரூமான்), “இன்றிரவு தங்கள் ‘விருந்தாளியை’ அல்லது ‘விருந்தினரை’ இங்கேயே (காத்து) இருக்கும்படி செய்துவிட்டீர்களே!” என்று கேட்டார்கள். அபூபக்ர் (ரலி) அவர்கள், “அவர்களுக்கு நீ இரவு சாப்பாடு கொடுக்கவில்லையா?” என்று கேட்டார்கள். அதற்கு என் தாயார், “நான் ‘இவரிடம்’ அல்லது ‘இவர்களிடம்’ சாப்பிடச் சொன்னேன். ஆனால் ‘இவர்’ அல்லது ‘இவர்கள்’ (சாப்பிட) மறுத்துவிட்டனர்” என்று கூறினார்கள். இதனால் (என் தந்தை) அபூபக்ர் (ரலி) அவர்கள் கோபமடைந்தார்கள்; ஏசினார்கள்; “உன் மூக்கறுந்துபோக” என (என்னை)த் திட்டினார்கள். மேலும், தாம் சாப்பிடப் போவதில்லை எனச் சத்தியம் செய்தார்கள். நான் ஒளிந்துகொண்டேன். அப்போது அவர்கள், “அறிவில்லாதவனே!” என்று (என்னை) அழைத்தார்கள். “என் தந்தை சாப்பிடாமல் தாமும் சாப்பிடப்போவதில்லை என்று என் தாயாரும் சத்தியம் செய்தார்கள். என் தந்தை சாப்பிடாத வரை தாங்களும் சாப்பிடப்போவதில்லை என ‘விருந்தாளி’ அல்லது ‘விருந்தாளிகளும்’ சத்தியம் செய்தனர். அப்போது (என் தந்தை) அபூபக்ர் (ரலி) அவர்கள் “இந்த நிலை ஷைத்தானால் ஏற்பட்டுவிட்டது போலும்” என்று கூறிவிட்டு, உணவு கொண்டு வரச்சொல்லி தாமும் சாப்பிட்டார்கள். விருந்தினரும் சாப்பிட்டனர். அவர்கள் ஒவ்வொரு கவளம் உணவு எடுக்கும்போதும் அதன் கீழ் பகுதியிலிருந்து (உணவு) அதிகமாகிக்கொண்டே இருந்தது. அப்போது என் தந்தை அபூபக்ர் (ரலி) அவர்கள் (என் தாயாரிடம்), “பனூ ஃபிராஸ் குலத்தவளே! இது என்ன (பெருக்கம்)?”என்று கேட்டார்கள். அதற்கு “என் கண்குளிர்ச்சியின் மீது சத்தியமாக! நாம் சாப்பிடுவதற்கு முன்னால் இருந்ததைவிட இப்போது (மும்மடங்கு) கூடுதலாக உள்ளதே!” என்று என் தாயார் கூறினார்கள். பிறகு அனைவரும் சாப்பிட்டோம். அந்த உணவை நபி (ஸல்) அவர்களுக் கும் கொடுத்தனுப்பினார்கள். நபி (ஸல்) அவர்களும் அதைச் சாப்பிட்டார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6143,
			"arabicnumber": 6143,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6144,
			"arabicnumber": 6144,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “ஒரு மரத்தைப் பற்றி எனக்குக் கூறுங்கள். அதன் நிலை ஒரு முஸ்லிமின் நிலைக்குச் சமமாகும். அந்த மரம் தன் அதிபதியின் ஆணைக்கேற்ப எல்லா நேரங்களிலும் கனி தருகிறது. அதன் இலை உதிர்வதில்லை. (அது எந்த மரம்?)” என்று கேட்டார்கள். என் மனத்தில் அது பேரீச்சமரம்தான் என்று தோன்றியது. ஆயினும், (அதைப் பற்றிப்) பேச நான் விரும்பவில்லை. அங்கு (மூத்தவர்களான) அபூபக்ர் (ரலி) அவர்களும் உமர் (ரலி) அவர்களும் (ஏதும் பேசாமல்) இருந்தார்கள். அவர்கள் பேசாமலிருக்கவே, நபி (ஸல்) அவர்கள், “அது பேரீச்சமரம்தான்” என்றார்கள். நான் என் தந்தை (உமர் -ரலி) அவர்களுடன் வெளியில் வந்தபோது, “தந்தையே! அது பேரீச்சமரம்தான் என்று என் மனத்தில் தோன்றியது” என்றேன். அவர்கள், “ஏன் அதை நபி (ஸல்) அவர்களிடம் நீ சொல்லவில்லை? நீ அதைச் சொல்லியிருந்தால் இன்ன இன்னதைவிட எனக்கு மிகவும் விருப்பமானதாய் இருந்திருக்குமே!” என்று சொன்னார்கள். தாங்களும் அபூபக்ர் (ரலி) அவர்களும் பேசாமல் இருந்ததைக் கண்டதாலேயே நான் (அது குறித்துப் பேச) விரும்பவில்லை” என்றேன்.161 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6145,
			"arabicnumber": 6145,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நிச்சயமாகக் கவிதையிலும் ஞானம் (ஹிக்மத்) உண்டு.164 இதை உபை பின் கஅப் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6146,
			"arabicnumber": 6146,
			"text": "ஜுன்தப் பின் சுஃப்யான் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஒரு போரின் போது) நடந்துகொண்டிருக்கையில் அவர்களுக்குக் (காலில்) கல் பட்டுவிட்டது. இதனால் அவர்களின் (கால்) விரலில் (காயமேற்பட்டு) இரத்தம் சொட்டியது. அப்போது அவர்கள், “நீ இரத்தம் சொட்டுகின்றஒரு விரல்தானே!நீ பட்டதெல்லாம்இறைவழியில்தானே!” என்று (ஈரசைச் சீர் பாடல் போன்ற வடிவில்) கூறினார்கள்.165 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6147,
			"arabicnumber": 6147,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: கவிஞர் சொன்ன சொற்களிலேயே மிக உண்மையான சொல், (கவிஞர்) லபீத் பின் ரபீஆ சொன்ன “அறிக!அல்லாஹ்வைத் தவிரஅனைத்துப் பொருட்களும்அழியக் கூடியவையே!” எனும் சொல்தான். (கவிஞர்) உமய்யா பின் அபிஸ்ஸல்த் (தமது கவிதையின் கருத்துகளால்) இஸ்லாத்தை ஏற்கும் அளவுக்கு வந்து விட்டார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.166 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6148,
			"arabicnumber": 6148,
			"text": "சலமா பின் அல்அக்வஉ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் கைபரை நோக்கி (போருக்காக)ப் புறப்பட்டோம். இரவு நேரத்தில் நாங்கள் சென்றுகொண்டிருந்த போது மக்களிடையேயிருந்த ஒருவர், (என் தந்தையின் சகோதரர்) ஆமிர் பின் அல்அக்வஉ (ரலி) அவர்களிடம், “உங்கள் கவிதைகளில் சிலவற்றை எங்களுக்குப் பாடிக்காட்டக் கூடாதா?” என்று கேட்டடார். ஆமிர் (ரலி) அவர்கள் கவிஞராக இருந்தார்கள். அவர்கள் (தமது வாகனத் திலிருந்து) இறங்கி மக்களுக்காகப் (பின்வரும் ஈரசைச்சீர் கவிதையைப்) பாடி அவர்களுடைய ஒட்டகங்களை விரைந்தோடச் செய்தார்கள். இறைவா!நீ இல்லையென்றால் நாங்கள்நேர்வழி பெற்றிருக்கமாட்டோம்.தர்மமும் செய்திருக்கமாட்டோம்.தொழுதிருக்கவுமாட்டோம். நாங்கள் புரிந்துவிட்டபாவங்களுக்காகஎங்களை மன்னிப்பாயாக.உனக்கே நாங்கள் அர்ப்பணம். (போர்முனையில் எதிரியை)நாங்கள் சந்திக்கும்போதுஎங்கள் பாதங்களைஉறுதிப்படுத்துவாயாக. எங்கள்மீது அமைதியைப்பொழிவாயாக. (அறவழியில் செல்ல)நாங்கள் அழைக்கப்பட்டால்நாங்கள் (தயாராக) வந்துவிடுவோம். எங்களிடம்மக்கள் (அபயக்) குரல்எழுப்பினால்(உதவிக்கு வருவோம்). என்று பாடிக்கொண்டிருந்தார்கள். (வழக்கம் போலப் பாடலைக் கேட்டு ஒட்டகங்கள் விரைந்தோடலாயின.) அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “யார் இந்த ஒட்டக வோட்டி?” என்று கேட்டார்கள். மக்கள், “ஆமிர் பின் அல்அக்வஉ” என்று பதிலளித்தனர். அப்போது, “அவருக்கு அல்லாஹ் அருள்புரிவானாக!” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். (இந்தப் பிரார்த்தனையின் பொருள் புரிந்த) ஒருவர், “இறைத்தூதரே! (ஆமிருக்கு வீரமரணமும் அதையடுத்து சொர்க்கமும்) உறுதியாகிவிட்டது. அவர் (நீண்ட காலம் உயிர் வாழ்வதன்) மூலம் எங்களுக்குப் பயன் கிடைக்க (பிரார்த்தனை) செய்யக் கூடாதா?” என்று கேட்டார். பிறகு நாங்கள் கைபருக்கு வந்து கைபர்வாசிகளை முற்றுகையிட்டோம். அப்போது எங்களுக்குக் கடுமையான பசி ஏற்பட்டது. அதன் பிறகு (யூதர்களான) அவர்களுக்கெதிராக அல்லாஹ் (எங்களுக்கு) வெற்றியளித்தான். அவர்கள் வெற்றி கொள்ளப்பட்ட அன்றைய மாலை நேரத்தில் மக்கள் (ஆங்காங்கே) அதிகமாக நெருப்பு மூட்டினர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இது என்ன நெருப்பு? எதற்காக (இதை) மூட்டியிருக்கிறீர்கள்?” என்று கேட்டார்கள். “இறைச்சி சமைப்பதற்காக” என்று மக்கள் பதிலளித்தனர். “என்ன இறைச்சி?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். “நாட்டுக் கழுதைகளின் இறைச்சி” என்று மக்கள் கூறினர். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவற்றைக் கொட்டிவிட்டு அந்தப் பாத்திரங்களை உடைத்துவிடுங்கள்” என்று கூறினார்கள். அப்போது ஒருவர், “இறைச்சிகளைக் கொட்டிவிட்டு அதன் பாத்திரங்களை நாங்கள் கழுவி (வைத்து)க்கொள்ளலாமா?” என்று கேட்டார். “அப்படியே ஆகட்டும்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். (அன்றைய தினம் போருக்காக) மக்கள் அணிவகுத்து நின்றபோது (என் தந்தையின் சகோதரர்) ஆமிர் (ரலி) அவர்களின் வாள் குட்டையானதாக இருந்தது. (அதனால்) அவர்கள் குனிந்து, ஒரு யூதனை வெட்டப்போனபோது அன்னாரது வாளின் மேற்பகுதி அன்னாரின் முழங்காலையே திருப்பித் தாக்கிவிட்டது. அதனால் அவர்கள் இறந்துவிட்டார்கள். (கைபரை வென்று, மதீனா நோக்கி) மக்கள் திரும்பியபோது (நிகழ்ந்தவற்றை) சலமா (ரலி) அவர்கள் கூறுகிறார்கள்: (கவலையால்) நிறம் மாறிப்போயிருந்த என்னைப் பார்த்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உங்களுக்கு என்ன நேர்ந்தது?” என்று கேட்டார்கள். அதற்கு நான், “என் தந்தையும் என் தாயும் தங்களுக்கு அர்ப்பணமாகட்டும். (என் தந்தையின் சகோதரர்) ஆமிர் அவர்களின் நற்செயல்கள் அழிந்துவிட்டன. (அவர் தமது வாளால் தம்மைத் தாமே குத்திக்கொண்டு தற்கொலை செய்துகொண்டார்) என மக்கள் கூறுகிறார்கள்” என்று சொன்னேன். (அதற்கு) நபி (ஸல்) அவர்கள், “யார் இதைச் சொன்னவர்?” என்று கேட்டார்கள். “இதை இன்னாரும் இன்னாரும் இன்னாரும் உசைத் பின் ஹுளைர் அல்அன்சாரி அவர்களும் கூறினர்” என்றேன். (இதைக் கேட்ட) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இதைக் கூறியவர் உண்மைக்குப் புறம்பாகக் கூறிவிட்டார். ஆமிருக்கு நிச்சயமாக (நற்செயல் புரிந்த நன்மை, அறப்போரில் பங்குகொண்ட நன்மையென) இரண்டு நன்மைகள் உண்டு” என்று கூறியவாறு தம்மிரு விரல்களையும் அவர்கள் இணைத்துக் காட்டினார்கள். (தொடர்ந்து) “அவர் துன்பங்களைத் தாங்கினார். (இறைவழியில்) அறப்போரும் புரிந்தார். (துன்பங்களைத் தாங்கியதுடன் அறவழியில் போரும் புரிந்த) இவரைப் போன்ற அரபியர் பூமியில் பிறப்பது அரிது” என்று சொன்னார்கள்.167 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6149,
			"arabicnumber": 6149,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஒரு பயணத்தில்) தம் துணைவியர் சிலரிடம் சென்றார்கள். (அவர்கள் ஒட்டகத்தில் பயணம் செய்துகொண்டிருந்தார்கள். என் தாயார்) உம்மு சுலைம் (ரலி) அவர்களும் அத்துணைவியருடன் இருந்தார்கள். அப்போது நபி (ஸல்) அவர்கள் (ஒட்டகவோட்டியிடம்) “உமக்கு நாசம்தான். அன்ஜஷா! நிதானமாக ஓட்டிச்செல்! (ஒட்டகச் சிவிகைக்குள் இருக்கும்) கண்ணாடிக் குடுவைகளை (பெண்களை) உடைத்துவிடாதே!” என்று கூறினார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) அபூகிலாபா (ரஹ்) அவர்கள் (தம்முடன் இருந்த இராக்கியரிடம்) கூறினார்கள்: அப்போது நபி (ஸல்) அவர்கள் ஒரு வார்த்தை கூறினார்கள். உங்களில் ஒருவர் அதைச் சொல்லியிருந்தால் (இங்கிதம் தெரியாத நீங்கள்) அதற்காக அவரை(க் கேலிசெய்து) விளையாடியிருப்பீர்கள். “நிதானமாக ஓட்டிச்செல். கண்ணாடிக் குடுவைகளை உடைத்துவிடாதே” (என்பதுதான் அந்த வார்த்தை).168 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6150,
			"arabicnumber": 6150,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: இணைவைப்பாளர்களைத் தாக்கி வசைக்கவி பாட (கவிஞர்) ஹஸ்ஸான் பின் ஸாபித் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அனுமதி கேட்டார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(குறைஷியரான அவர்களுடன் பின்னிப்பிணைந்துள்ள) என் வமிசப் பரம்பரையை என்ன செய்வாய்?” என்று கேட்டார்கள். அதற்கு ஹஸ்ஸான் (ரலி) அவர்கள், “குழைத்த மாவிலிருந்து முடியை உருவியெடுப்பதைப் போன்று தங்களை(யும் தங்கள் வமிசப் பரம்பரையையும் வசையிóருந்து) உருவியெடுத்து விடுவேன்” என்று பதிலளித்தார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) உர்வா (ரஹ்) அவர்கள் கூறுகி றார்கள்: நான் (என் சிறிய தாயார்) ஆயிஷா (ரலி) அவர்களிடம் ஹஸ்ஸான் பின் ஸாபித் (ரலி) அவர்களை (அவதூறு பரப்புவதில் சம்பந்தப்பட்டதால்) ஏசிக் கொண்டே போனேன். அப்போது அவர்கள், “அவரை ஏசாதே! ஏனெனில், அவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காக (இணைவைப்பாளர்களைத் தாக்கி) பதிலடி கொடுத்துக்கொண்டிருந்தார்” என்றார்கள்.169 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6151,
			"arabicnumber": 6151,
			"text": "ஹைஸம் பின் அபீசினான் (ரஹ்) அவர்கள் கூறியதாவது: அபூஹுரைரா (ரலி) அவர்கள் தமது பேச்சுக்கிடையே நபி (ஸல்) அவர்களைப் பற்றிக் குறிப்பிட்டார்கள். (அப்போது) உங்கள் சகோதரர் (கவிஞர்) அப்துல்லாஹ் பின் ரவாஹா (ரலி) அவர்கள் தவறானவற்றைக் கூறுபவர் அல்லர். (நபி (ஸல்) அவர்களைப் பாராட்டி பின்வருமாறு) அவர் பாடினார் என்றார்கள்: எங்களிடையேஇறைத்தூதர்ஓதுகிறார் இறைவேதம்வைகறைப்பொழுது புலரும் நேரத்தில் கருத்துக் குருடர்களானஎங்களுக்குகாட்டினார் நல்வழிஅவர் சொன்னதுநடக்கும் நிச்சயம்!இதுஎங்கள் இதய நம்பிக்கை இரவில்அன்னாரது விலாதொட்டதில்லை படுக்கையைஅப்போது இணைவைப்பாளர்அழுந்திக் கிடப்பர் படுக்கையில்!170 இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6152,
			"arabicnumber": 6152,
			"text": "அபூசலமா பின் அப்திர் ரஹ்மான் பின் அவ்ஃப் (ரஹ்) அவர்கள் கூறியதாவது: (கவிஞர்) ஹஸ்ஸான் பின் ஸாபித் அல்அன்சாரி (ரலி) அவர்கள் அபூஹுரைரா (ரலி) அவர்களிடம், “அபூஹுரைரா! அல்லாஹ்வை முன்னிறுத்தி உங்களிடம் கேட்கிறேன்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ‘ஹஸ்ஸானே! அல்லாஹ்வின் தூதர் சார்பாக (எதிரிகளுக்குக் கவிதைகள் மூலம்) பதிலடி கொடுப்பீராக. இறைவா! தூய ஆன்மா (ஜிப்ரீல்) மூலம் ஹஸ்ஸானை வலுப்படுத்துவாயாக!’ என்று கூறியதை நீங்கள் செவியுற்றீர்கள் அல்லவா?” என்று விவரம் கேட்டார்கள். அதற்கு அபூஹுரைரா (ரலி) அவர்கள், “ஆம்” என்று பதிலளித்தார்கள்.171 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6153,
			"arabicnumber": 6153,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (பனூ குறைழா போரின்போது, கவிஞர்) ஹஸ்ஸான் (ரலி) அவர்களிடம், “எதிரிகளுக்கு (பதிலடியாக) வசைக் கவிதை பாடுங்கள். (வானவர்) ஜிப்ரீல் உங்களுடன் (துணையாக) இருப்பார்” என்று கூறினார்கள்.172 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6154,
			"arabicnumber": 6154,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவருடைய வயிறு கவிதையால் நிரம்பியிருப்பதைவிடச் சீழ் சலத்தால் நிரம்பியிருப்பது நன்று. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6155,
			"arabicnumber": 6155,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு மனிதரின் வயிற்றில் புரையோடும் அளவுக்குச் சீழ் சலம் நிரம்பியிருப்பது, அது கவிதையால் நிரம்பியிருப்பதைவிட மேலானதாகும்.173 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6156,
			"arabicnumber": 6156,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: பர்தா தொடர்பான வசனம் அருளப் பெற்றபிறகு, என் வீட்டினுள் வர அபுல் குஐஸின் சகோதரர் அஃப்லஹ் (ரலி) அவர்கள் அனுமதி கோரினார்கள். அப்போது நான், “அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அனுமதி கேட்காத வரை (உள்ளே வர) அவரை நான் அனுமதிக்கமாட்டேன். ஏனெனில், அபுல் குஐஸின் சகோதரர் (அஃப்லஹ்) எனக்குப் பாலூட்டியவர் அல்லர். மாறாக, அபுல்குஐஸ் அவர்களின் மனைவியே எனக்குப் பாலூட்டினார்” என்றேன். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம் வந்தார்கள். அப்போது நான், “அல்லாஹ்வின் தூதரே! இந்த மனிதர் எனக்குப் பாலூட்டியவர் அல்லர். மாறாக, இவருடைய (சகோதரரின்) மனைவியே எனக்குப் பாலூட்டினார்” என்றேன். நபி (ஸல்) அவர்கள், “அவருக்கு (உள்ளே வர) அனுமதி கொடு! ஏனெனில், அவர் உன் (பால்குடித்) தந்தையின் சகோதரர்தான். உன் வலக்கை மண்ணைக் கவ்வட்டும்” என்று சொன்னார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) உர்வா (ரஹ்) அவர்கள் கூறுகி றார்கள்: இதனால்தான் (என் சிறிய தாயார்) ஆயிஷா (ரலி) அவர்கள், “இரத்த உறவால் மணமுடிக்கத் தடை செய்யப்பட்டவர்களைப் பால்குடி உறவாலும் மணமுடிக்கத் தடை செய்யுங்கள்” என்று கூறுவார்கள்.175 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6157,
			"arabicnumber": 6157,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஹஜ்ஜை முடித்துக்கொண்டு மக்காவிலிருந்து) புறப்பட விரும்பினார்கள். அப்போது (தம் துணைவியாரான) ஸஃபிய்யா (ரலி) அவர்கள் தமது கூடார வாசலில் சோர்வாகவும் கவலையாகவும் இருக்கக் கண்டார்கள். ஏனெனில், அவர்களுக்கு மாதவிடாய் ஏற்பட்டிருந்தது. அப்போது நபி (ஸல்) அவர்கள் குறைஷியரின் வழக்கில் (செல்லமாகச் ஏசப்படும் வார்த்தையில்) அல்லாஹ் உன்னை அறுக்கட்டும்! உனக்குத் தொண்டை வலி வரட்டும்! நீ எம்மை (மக்காவிலிருந்து புறப்பட விடாமல்) தடுத்துவிட்டாய்” என்று கூறினார்கள். பிறகு, “நஹ்ருடைய (துல்ஹிஜ்ஜா பத்தாவது) நாளில் நீ (கஅபாவைச்) சுற்றி வந்தாயா?” என்று கேட்டார்கள். ஸஃபிய்யா (ரலி) அவர்கள், “ஆம்” என்று சொன்னார்கள். “அப்படியானால் (உன் ஹஜ் பூர்த்தியாகிவிட்டது). நீ புறப்படு” என்று நபி (ஸல்) அவர்கள் சொன்னார்கள்.176 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6158,
			"arabicnumber": 6158,
			"text": "உம்மு ஹானீ பின்த் அபீதாலிப் (ரலி) அவர்கள் கூறியதாவது: ‘மக்கா வெற்றி’ ஆண்டில் நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றேன். அப்போது நபி (ஸல்) அவர்கள் குளித்துக்கொண்டிருக்க, அவர்களை அவர்களுடைய புதல்வி ஃபாத்திமா (ரலி) அவர்கள் மறைத்துக் கொண்டிருப்பதைக் கண்டேன். அப்போது நான் அவர்களுக்கு முகமன் (சலாம்) சொன்னேன். உடனே நபி (ஸல்) அவர்கள் “யார் அது?” என்று கேட்டார்கள். “நான் உம்மு ஹானீ பின்த் அபீதாலிப் (வந்திருக்கிறேன்)” என்று பதிலளித்தேன். அப்போது நபி (ஸல்) அவர்கள், “உம்மு ஹானீயே வருக!” எனக் கூறினார்கள். நபி (ஸல்) அவர்கள் குளித்து முடித்தவுடன் ஒரே ஆடையை (தமது உடலில்) சுற்றிக்கொண்டவர்களாக எழுந்து நின்று எட்டு ரக்அத்கள் தொழுதார்கள். தொழுது முடித்ததும், “அல்லாஹ்வின் தூதரே! என் சகோதரர் (அலீ பின் அபீதாலிப்) நான் அடைக்கலம் அளித்திருக்கும் ஹுபைராவின் இன்ன மகனைக் கொலை செய்யப்போவதாகக் கருதுகிறார்” என்று கூறினேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உம்மு ஹானீயே! நீ அடைக்கலம் அளித்தவருக்கு நாமும் அடைக்கலம் அளித்துவிட்டோம்” என்று கூறினார்கள். உம்மு ஹானீ (ரலி) அவர்கள் குறிப்பிடுகிறார்கள்: (நான் நபி (ஸல்) அவர்களிடம் சென்ற) அந்த நேரம் முற்பகல் (ளுஹா) ஆகும்.178 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6159,
			"arabicnumber": 6159,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஒருவர் தமது குர்பானி ஒட்டகத்தை இழுத்துக்கொண்டு (நடந்து) செல்வதைக் கண்ட நபி (ஸல்) அவர்கள், “அதில் ஏறிச் செல்லுங்கள்!” என்றார்கள். அதற்கு அவர், “இது குர்பானி ஒட்டகமாயிற்றே?” என்றார். நபி (ஸல்) அவர்கள், “(பரவாயில்லை) அதில் ஏறிச்செல்லும்!” என்றார்கள். (மீண்டும்) அவர், “இது குர்பானி ஒட்டகமாயிற்றே!” என்றதும் “அதில் ஏறிச் செல்க. உமக்குக் கேடுதான் (‘வைலக்க’)” என்றார்கள்.180 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6160,
			"arabicnumber": 6160,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒருவர் தமது குர்பானி ஒட்டகத்தை இழுத்துக்கொண்டு (நடந்து) செல்வதைக் கண்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவரிடம், “அதில் ஏறிச் செல்லுங்கள்!” என்றார்கள். அவர், “இது குர்பானி ஒட்டகமாயிற்றே, அல்லாஹ்வின் தூதரே?” என்றார். நபி (ஸல்) அவர்கள், ‘இரண்டாவது தடவையில்’ அல்லது ‘மூன்றாவது தடவையில்’ “இதில் ஏறிச்செல்லும்! உமக்குக் கேடுதான்” என்றார்கள்.181 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6161,
			"arabicnumber": 6161,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு பயணத்தில் இருந்தார்கள். அவர்களுடன் அவர்களுடைய கறுப்பு நிற அடிமையான அன்ஜஷா எனப்படுபவரும் இருந்தார். அவர் பாட்டுப்பாடி (ஒட்டகத்தை விரைந்தோடச் செய்து)கொண்டிருந்தார். அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உமக்கு நாசம்தான் (வைஹக்க). அன்ஜஷா! நிதானம்! (ஒட்டகத்தின் மேலுள்ள) கண்ணாடிக் குடுவைகளை (பெண்களை) உடைத்துவிடாதே!’ என்று கூறினார்கள்.182 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6162,
			"arabicnumber": 6162,
			"text": "அபூபக்ரா நுஃபைஉ பின் அல் ஹாரிஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் ஒரு மனிதர் இன்னொரு மனிதரைப் பற்றிப் புகழ்ந்து பேசினார். அப்போது நபி (ஸல்) அவர்கள் “உனக்குக் கேடுதான் (வைலக்க!). உன் சகோதரரின் கழுத்தைத் துண்டித்துவிட்டாயே!” என மூன்று முறை கூறிவிட்டு, “உங்களில் ஒருவர் (தம் சகோதரரைப்) புகழ்ந்தேயாக வேண்டும் என்றிருந்தால், ‘(அவரைப் பற்றி) நான் (இவ்வாறு) எண்ணுகிறேன்’ என்று (மட்டும்) அவர் கூறட்டும். அதுவும் அவர் (அவ்வாறு இருக்கிறார் என) அறிந்தால் மட்டுமே அவர் இவ்வாறு கூறட்டும். அல்லாஹ்வே அவரைக் குறித்து விசாரணை (செய்து முடிவு) செய்பவன் ஆவான். நான் அல்லாஹ்வை முந்திக்கொண்டு யாரையும் தூய்மையானவர் என்று கூறமாட்டேன்” என்று கூறினார்கள்.183 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6163,
			"arabicnumber": 6163,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஹவாஸின்) போரில் கிடைத்த செல்வங்களை ஒரு நாள் பங்கிட்டுக்கொண்டிருந்தபோது பனூ தமீம் குலத்தைச் சேர்ந்த ‘துல் குவைஸிரா’ எனும் மனிதர், “அல்லாஹ்வின் தூதரே! நீதியுடன் நடந்துகொள்ளுங்கள்” என்று சொன்னார். உடனே நபி (ஸல்) அவர்கள், “உனக்குக் கேடுதான். நான் நீதியுடன் நடந்துகொள்ளவில்லையென்றால் வேறு யார்தான் நீதியுடன் நடந்துகெள்வார்கள்?” என்று கூறினார்கள். உடனே (அங்கிருந்த) உமர் (ரலி) அவர்கள், “இவரது கழுத்தைக் கொய்ய என்னை அனுமதியுங்கள் (அல்லாஹ்வின் தூதரே!)” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள், “இல்லை (இவரை விட்டுவிடுங்கள்). நிச்சயமாக இவருக்குத் தோழர்கள் சிலர் இருக்கின்றனர். அவர் களுடைய தொழுகையுடன் உங்களுடைய தொழுகையையும் அவர்களுடைய நோன்புடன் உங்களுடைய நோன்பையும் ஒப்பிட்டுப்பார்த்து உங்களுடைய தொழுகையையும் உங்களுடைய நோன்பையும் அற்பமாகக் கருதுவீர்கள். (அந்த அளவுக்கு அவர்களின் வழிபாடு அதிகமாக இருக்கும். ஆயினும்,) வேட்டைப் பிராணியைவிட்டு (அதன் உடலைத் துளைக்கின்ற) அம்பு (உடலின் மறுபக்கம்) வெளியேறிச் சென்றுவிடுவதைப் போன்று மார்க்கத்திலிருந்து அவர்கள் வெளியேறிச் சென்றுவிடுவார்கள். (அந்தப் பிராணியின் உடலைத் துளைத்து வெளிவந்ததற்கான அடையாளம் ஏதும் இருக்கிறதா என்று அறிய) அம்பின் முனை பார்க்கப்படும். அதில் (அடையாளம்) எதுவும் காணக் கிடைக்காது. பிறகு (அம்பில்) அதன் (முனையைப் பொருத்தப் பயன்படும்) நாண் பார்க்கப்படும். அதிலும் (அடையாளம்) எதுவும் காணக் கிடைக்காது. பிறகு அம்பின் (அடிப்பாகக்) குச்சி பார்க்கப்படும். அதிலும் எதுவும் காணக் கிடைக்காது. பிறகு, அம்பின் இறகு பார்க்கப்படும். அதிலும் (அடையாளம்) எதுவும் காணக் கிடைக்காது. அ(ம்பான)து, சாணத்தையும் இரத்தத்தையும் (அவை தன்மீது படாதவாறு) முந்திக்கொண்டுவிட்டிருக்கும். அவர்கள் மக்களிடையே பிரிவினை ஏற்படும் வேளையில் கிளம்புவார்கள். அவர்களின் அடையாளம் ஒரு (கறுப்பு நிற) மனிதராவார். அவரது இரு (புஜக்) கைகளில் ஒன்று ’பெண்ணின் கொங்கை போன்றிருக்கும்’ அல்லது ‘துடிக்கும் இறைச்சித்துண்டு போன்றிருக்கும்’ என்று சொன்னார்கள். நான் நிச்சயமாக இந்த நபிமொழியை நபி (ஸல்) அவர்களிடமிருந்து செவியுற் றேன் என்று சாட்சியம் அளிக்கின்றேன். மேலும், அந்தக் கூட்டத்தாருடன் அலீ (ரலி) அவர்கள் போரிட்டபோது அலீ (ரலி) அவர்களுடன் நானும் இருந்தேன். (அந்தப் போரில்) கொல்லப்பட்டவர்களிடையே (நபி (ஸல்) அவர்கள் இனங்காட்டிய) அந்த மனிதர் தேடிக் (கண்டுபிடித்துக்) கொண்டுவரப்பட்டார். நபி (ஸல்) அவர்களின் வர்ணனையின்படியே அவர் இருந்தார் என்றும் நான் சாட்சியம் அளிக்கின்றேன்.184 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6164,
			"arabicnumber": 6164,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, “நான் அழிந்துவிட்டேன், அல்லாஹ்வின் தூதரே!” என்றார். நபி (ஸல்) அவர்கள், “உமக்கு நாசம்தான் (வைஹக்க- என்ன நடந்தது?)” என்று கேட்டார்கள். அந்த மனிதர், “நான் ரமளான் மாதத்தில் (நோன்பு நோற்றுக்கொண்டு) என் மனைவியுடன் தாம்பத்திய உறவு கொண்டுவிட்டேன்” என்று சொன்னார். நபி (ஸல்) அவர்கள், “(இதற்குப் பரிகாரமாக) ஓர் அடிமையை விடுதலை செய்வீராக!” என்றார்கள். அவர், “(அதற்கான வசதி) என்னிடம் இல்லையே!” என்றார். நபி (ஸல்) அவர்கள், “அவ்வாறாயின், தொடர்ந்து இரு மாதம் நோன்பு நோற்பீராக!” என்றார்கள். அவர், “என்னால் இயலாது” என்றார். நபி (ஸல்) அவர்கள், “அவ்வாறாயின், (அறுபது) ஏழைகளுக்கு உணவளிப்பீராக!” என்றார்கள். அவர் “(அதற்கான வசதி) என்னிடம் இல்லை” என்றார். அப்போது நபி (ஸல்) அவர்களிடம் (பதினைந்து ‘ஸாஉ’ கொள்ளளவு கொண்ட அளவையான) ‘அரக்’ ஒன்று கொண்டுவரப்பட்டது. (அதில் பேரீச்சம் பழங்கள் இருந்தன.) உடனே நபி (ஸல்) அவர்கள், “இதைப் பெற்று தர்மம் செய்வீராக!” என்றார்கள். அதற்கு அந்த மனிதர், “அல்லாஹ்வின் தூதரே! என் குடும்பத்தார் அல்லாதோருக்கா (இதை நான் தர்மம் செய்ய)? என் உயிர் யார் கையிலுள்ளதோ அவன் மீதாணையாக! மதீனா எனும் கூடாரத்தின் இருமருங்கிலும் என்னைவிடத் தேவையானோர் யாருமில்லை” என்றார். (இதைக் கேட்ட) உடனே நபி (ஸல்) அவர்கள் தம் கடைவாய்ப் பற்கள் தெரியச் சிரித்துவிட்டு “(இதோ) இதைப் பெற்றுக்கொள்வீராக!” என்று சொன்னார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில் “(‘வைஹக்க’ என்பதற்குப் பதிலாக) ‘வைலக்க’ (உனக்குக் கேடுதான்) என்று காணப்படுகிறது.185 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6165,
			"arabicnumber": 6165,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: கிராமவாசி ஒருவர், “அல்லாஹ்வின் தூதரே! புலம்பெயர்ந்து (ஹிஜ்ரத்) செல்வது பற்றி எனக்குத் தெரிவியுங்கள்” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “உனக்கு நாசம்தான் (வைஹக்க!) ஹிஜ்ரத்தின் நிலை மிகவும் கடினமானது. உன்னிடம் ஒட்டகம் ஏதேனும் இருக்கின் றதா?” என்று கேட்டார்கள். அவர், “ஆம் (இருக்கின்றது)” என்று பதிலளித்தார். நபி (ஸல்) அவர்கள், “ஒட்டகத்துக்குரிய ஸகாத்தை நீ கொடுத்துவருகிறாயா?” என்று கேட்டார்கள். அவர், “ஆம்” என்றார். நபி (ஸல்) அவர்கள், “அப்படியென்றால் நீ ஊர்களுக்கு அப்பால் சென்றுகூட நன்மை செய்யலாம். அல்லாஹ் உன் நற்செயல்க(ளின் பிரதிபலன்க)ளிலிருந்து எதையும் குறைக்கமாட்டான்” என்று சொன்னார்கள்.186 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6166,
			"arabicnumber": 6166,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (தமது ‘விடை பெறும்’ ஹஜ் உரையில்) “உங்களுக்குக் கேடுதான் (வைலக்கும்)’ அல்லது ‘உங்களுக்கு அழிவுதான் (வைஹக்கும்)’. எனக்குப் பிறகு ஒருவர் மற்றவரின் கழுத்தை வெட்டிமாய்த்துக்கொள்ளும் இறைமறுப்பாளர்களாக நீங்கள் மாறிவிடாதீர்கள்” என்று கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஷுஅபா பின் அல்ஹஜ்ஜாஜ் (ரஹ்) அவர்களின் அறிவிப்பில், ‘வைஹக்கும்’ என்று நபி (ஸல்) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது. முஹம்மத் பின் ஸைத் (ரஹ்) அவர்களின் அறிவிப்பில், ‘வைலக்கும்’ அல்லது ‘வைஹக்கும்’ என்று இடம் பெற்றுள்ளது.187 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6167,
			"arabicnumber": 6167,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: கிராமவாசிகளில் ஒருவர் நபி (ஸல்) அவர்களிடம் வந்து, “அல்லாஹ்வின் தூதரே! மறுமை நாள் எப்போது சம்பவிக்கும்?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “உனக்கென்ன கேடு! அதற்காக நீ என்ன முன்முயற்சி செய்துள்ளாய்?” என்று கேட்டார்கள். அவர் “நான் அதற்காக (ஏதும்) முன்முயற்சி செய்யவில்லை; ஆயினும், நான் அல்லாஹ்வையும் அவனுடைய தூதரையும் நேசிக்கிறேன்” என்று பதிலளித்தார். நபி (ஸல்) அவர்கள், “(அப்படியானால்,) நீ யாரை நேசிக்கிறாயோ அவர்களுடன் (மறுமையில்) இருப்பாய்!” என்றார்கள். உடனே நாங்கள், “நாங்களும் அவ்வாறுதானா?” என்று கேட்டோம். நபி (ஸல்) அவர்கள், “ஆம்” என்று சொன்னார்கள். (இதைக் கேட்டு) அன்று நாங்கள் மிகவும் மகிழ்ந்தோம். -அப்போது முஃகீரா பின் ஷுஅபா (ரலி) அவர்களின் அடிமை (எங்களைக்) கடந்து சென்றார். அவர் என் வயதொத்த (சிறு)வராக இருந்தார்.- “இவர் உயிர் வாழ்ந்தால், இவரை முதுமை அடைவதற்கு முன்பே மறுமை சம்பவிக்கும்” என நபி (ஸல்) அவர்கள் கூறினார்கள். (அதாவது அவ்வளவு நெருக்கத்தில் மறுமை நாளை எதிர்பார்க்கலாம்.) இந்த ஹதீஸை ஷுஅபா (ரஹ்) அவர்கள் கத்தாதா (ரஹ்) அவர்கள் வழியாக அனஸ் (ரலி) அவர்களிடமிருந்து சுருக்கமாக அறிவித்துள்ளார்கள்.188 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6168,
			"arabicnumber": 6168,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மனிதன் யார்மீது அன்பு கொண்டுள்ளானோ அவர்களுடன்தான் இருப் பான்.190 இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6169,
			"arabicnumber": 6169,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு மனிதர் வந்து, “அல்லாஹ்வின் தூதரே! ஒருவர் (நன்) மக்களை நேசிக்கிறார். ஆனால், (செயல்பாட்டிலும் சிறப்பிலும்) அவர்களை அவர் எட்டவில்லை. அவர் விஷயத்தில் தாங்கள் என்ன கூறுகின்றீர்கள்?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “மனிதன் யார்மீது அன்புகொண்டுள்ளானோ அவர்களுடன்தான் இருப்பான்” என்றார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6170,
			"arabicnumber": 6170,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: “(அல்லாஹ்வின் தூதரே!) ஒரு மனிதர் (நன்) மக்களை நேசிக்கிறார். ஆனால், (செயல்பாட்டிலும் சிறப்பிலும்) அவர்களை அவர் எட்டவில்லை. (இவரைக் குறித்துத் தாங்கள் என்ன கருதுகின்றீர்கள்?)” என்று நபி (ஸல்) அவர்களிடம் வினவப்பட்டது. நபி (ஸல்) அவர்கள், “மனிதன் யார்மீது அன்பு வைத்துள்ளானோ அவர்களுடன்தான் இருப்பான்” என்று கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6171,
			"arabicnumber": 6171,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம், “மறுமை நாள் எப்போது வரும்? அல்லாஹ்வின் தூதரே!” என்று கேட்டார். நபி (ஸல்) அவர்கள், “அதற்காக என்ன முன்முயற்சி செய்துள்ளாய்?” என்று கேட்டார்கள். அவர், “அதற்காக நான் அதிகமான தொழுகையையோ நோன் பையோ தான தர்மங்களையோ முன் ஏற்பாடாகச் செய்துவைக்கவில்லை. ஆயினும், நான் அல்லாஹ்வையும் அவனுடைய தூதரையும் நேசிக்கிறேன்” என்று சொன்னார். நபி (ஸல்) அவர்கள், “நீ யாரை நேசிக்கிறாயோ அவருடன் (மறுமையில்) இருப்பாய்” என்று கூறினார்கள்.191 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6172,
			"arabicnumber": 6172,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (தன்னை இறைத்தூதர் என வாதிட்டுவந்த) இப்னு ஸய்யாத் (எனும் யூதச் சிறுவன்) இடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உனக்காக ஒன்றை நான் (மனத்தில்) மறைத்துவைத்துள்ளேன். அது என்ன (சொல்)?” என்றார்கள். அவன், “அத்துக்” (‘அத்துகான்’ எனும் 44ஆவது அத்தியாயம்) என்றான். நபி (ஸல்) அவர்கள், “தூர விலகிப்போ” என்றார்கள்.193 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 6175,
			"arabicnumber": 6175,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6176,
			"arabicnumber": 6176,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அப்துல் கைஸ் குலத்தாரின் தூதுக் குழு தம்மிடம் வந்தபோது, “இழிவுக்குள்ளா காமலும் மன வருத்தத்திற்குள்ளாகாமலும் வருகை புரிந்த தூதுக் குழுவினரே! உங்கள் வரவு நல்வரவாகட்டும்!” என்று நபி (ஸல்) அவர்கள் (வாழ்த்துக்) கூறினார்கள். அப்போது அக்குழுவினர், “அல்லாஹ்வின் தூதரே! நாங்கள் ரபீஆ குலத்தைச் சேர்ந்த ஒரு கூட்டத்தாராவோம். எங்களுக்கும் உங்களுக்கும் இடையே (இறைமறுப்பாளர்களான) ‘முளர்’ குலத்தார் (தடையாக) உள்ளனர். (போர் தடை செய்யப்பட்ட) புனித மாதங்களில் தவிர (வேறு மாதத்தில்) தங்களிடம் நாங்கள் வந்துசேர முடிவதில்லை. எனவே (வாய்மையையும் பொய்மையையும் பாகுபடுத்தும்) சில தீர்க்கமான விஷயங் களை எங்களுக்குக் கட்டளையிடுங்கள். அத(னைக் கடைப்பிடிப்பத)ன் மூலம் நாங்கள் சொர்க்கம் செல்வோம். எங்களுக்குப் பின்னால் உள்ள (இங்கு வர முடியாமல் தங்கிவிட்ட)வர்களுக்கு அறிவிப்போம்” என்றார்கள். அதற்கு நபி (ஸல்) அவர்கள், “நான்கு (விஷயங்களைக் கட்டளையிடுகிறேன்). நான்கு (விஷயங்களைத் தடை செய்கிறேன்). தொழுகையை நிலை நிறுத்துங்கள். ஸகாத்தைச் செலுத்துங்கள். ரமளான் மாதத்தில் நோன்பு நோறுங்கள். உங்களுக்குக் கிடைக்கும் போர்ச் செல்வத்திலிருந்து ஐந்தில் ஒரு பங்கை (குமுஸ்) கொடுத்துவிடுங்கள். மேலும், (மது ஊற்றிவைக்கப்படும் பாத்திரங்களான) சுரைக்காய்க் குடுவை; மண்சாடி; பேரீச்சமரத்தின் பீப்பாய்; தார் பூசப்பட்ட பாத்திரம் ஆகியவற்றில் நீங்கள் பருகாதீர்கள்” என்று சொன்னார்கள்.200 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 6177,
			"arabicnumber": 6177,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மோசடி செய்பவனுக்கு மறுமை நாளில் (அவனுடைய மோசடியை வெளிச்சமிட்டுக் காட்டும் முகமாக அடையாளக்) கொடி ஒன்று நட்டப்பட்டு, “இது இன்னாருடைய மகன் இன்னாரின் மோசடி(யைக் குறிக்கும் கொடி)” என்று கூறப்படும். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6178,
			"arabicnumber": 6178,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மோசடி செய்பவனுக்கு மறுமை நாளில் (அவனுடைய மோசடியை வெளிச்ச மிட்டுக் காட்டும் முகமாக அடையாளக்) கொடி ஒன்று நட்டப்படும். அப்போது “இது இன்னார் மகன் இன்னாரின் மோசடி(யைக் குறிக்கும் கொடி)” என்று கூறப்படும். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.201 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6179,
			"arabicnumber": 6179,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் (மனக் குழப்பத்திலிருக்கும்) யாரும் (‘என் மனம் அசுத்தமாகிவிட்டது’ எனும் பொருள் பொதிந்த) ‘கபுஸத் நஃப்ஸீ’ எனும் சொல்லைக் கூற வேண்டாம். மாறாக, (‘என் மனம் கனத்துவிட்டது’ எனும் பொருள் கொண்ட) ‘லகிசத் நஃப்ஸீ’ எனும் சொல்லையே கூறட்டும்.202 இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6180,
			"arabicnumber": 6180,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் (மனக் குழப்பத்திலிருக்கும்) யாரும் (‘என் மனம் அசுத்தமாகிவிட்டது’ எனும் பொருள் பொதிந்த) ‘கபுஸத் நஃப்ஸீ’ எனும் சொல்லை ஆள வேண்டாம். மாறாக, (‘என் மனம் கனத்துவிட்டது’ எனும் பொருள்தரும்) ‘லகிசத் நஃப்ஸீ’ எனும் சொல்லையே ஆளட்டும். இதை சஹ்ல் பின் ஹுனைஃப் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6181,
			"arabicnumber": 6181,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் கூறினான்: ஆதமின் மகன் (மனிதன்) காலத்தை ஏசுகிறான். நானே காலம் (படைத்தவன்). என் கையில்தான் இரவு பகல் (இயக்கம்) உள்ளது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.203 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6182,
			"arabicnumber": 6182,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: திராட்சையை (‘கண்ணியமானது’ எனும் பொருள் கொண்ட) ‘அல்கர்ம்’ என்று பெயரிட்டழைக்காதீர்கள். ‘மோசமான காலமே!’ என்று (காலத்தை ஏசிக்) கூறாதீர்கள். ஏனெனில், அல்லாஹ்வே காலம் (படைத்தவன்). இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6183,
			"arabicnumber": 6183,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மக்கள் (திராட்சைப் பழத்திற்கு) ‘அல்கர்ம்’ (கண்ணியமானது) என்று சொல்கின்றனர். உண்மையில் இறை நம்பிக்கையாளரின் இதயமே ‘அல்கர்ம்’ (கண்ணியத்திற்குரியது) ஆகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 6184,
			"arabicnumber": 6184,
			"text": "அலீ பின் அபீதாலிப் (ரலி) அவர்கள் கூறியதாவது: சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் தவிர வேறெவருக்கும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் தாய் தந்தையரை அர்ப்பணிப்பதாகக் கூறியதை நான் கேட்டதில்லை. (சஅத் அவர்களிடம்) நபி (ஸல்) அவர்கள், “அம்பெய்யுங்கள். உங்களுக்கு என் தந்தையும் என் தாயும் அர்ப்பணமாகட்டும்” என்று கூறியதைக் கேட்டேன். இது உஹுத் போர் நாளில் நடைபெற்றதாகவே நான் எண்ணுகிறேன்.208 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6185,
			"arabicnumber": 6185,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நானும் அபூதல்ஹா (ரலி) அவர்களும் நபி (ஸல்) அவர்களுடன் (கைபரிலிருந்து மதீனாவை) முன்னோக்கிச் சென்றுகொண்டிருந்தோம். நபி (ஸல்) அவர்கள் தம்முடனிருந்த (தம் துணைவியாரான) ஸஃபிய்யா (ரலி) அவர்களைத் தமது வாகனத்தில் பின்னால் அமர்த்தியிருந்தார்கள். (சிறிது தூரம் கடந்து) பாதையில் ஓரிடத்தில் நாங்கள் சென்றுகொண்டிருந்தபோது (நபியவர்களின்) அந்த ஒட்டகம் இடறி விழுந்தது. நபி (ஸல்) அவர்களும் அவர்களின் துணைவியாரும் கீழே தள்ளப்பட்டனர். அபூதல்ஹா (ரலி) அவர்கள் தமது ஒட்டகத்திலிருந்து தாவிக் குதித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, “அல்லாஹ்வின் நபியே! என்னை அல்லாஹ் தங்களுக்கு அர்ப்பணமாக்குவானாக! தங்களுக்கு (காயம்) ஏதும் ஏற்பட்டதா?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “இல்லை; ஆயினும், நீ இந்தப் பெண்ணைக் கவனி!” என்று கூறினார்கள். உடனே அபூதல்ஹா (ரலி) அவர்கள் தமது துணியைத் தமது முகத்தில் போட்டு (மூடி)க்கொண்டு (அன்னை) ஸஃபிய்யா (ரலி) அவர்கள் இருந்த திசையை நோக்கி நடந்து சென்று அவர்கள்மீது அத்துணியைப் போட்டார்கள். உடனே அப்பெண்மணி (ஸஃபிய்யா -ரலி) எழுந்துகொண்டார்கள். பிறகு அபூதல்ஹா (ரலி) அவர்கள் (நபி (ஸல்) மற்றும் அன்னை ஸஃபிய்யா (ரலி) ஆகிய) அவர்கள் இருவருக்காகவும் அவர்களின் சிவிகையைக் கட்டி (சீராக்கி)னார்கள். அவர்கள் இருவரும் அதில் ஏறிக்கொண்டனர். பிறகு நாங்கள் அனைவரும் பயணமாகி ‘மதீனாவின் புறநகர் பகுதிக்கு வந்தபோது’ அல்லது ‘மதீனாவை நெருங்கியபோது’ நபி (ஸல்) அவர்கள், “பாவமன்னிப்புக் கோரி மீண்டவர்களாக, எங்கள் இறைவனுக்குப் பணிந்தவர்களாக, (அவனைப் போற்றிப்) புகழ்ந்தவர்களாக (நாங்கள் திரும்பிக்கொண்டிருக்கின்றோம்)” என்று கூறினார்கள். மதீனாவிற்குள் நுழையும்வரை இவ்வாறு கூறிக்கொண்டே யிருந்தார்கள்.210 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6186,
			"arabicnumber": 6186,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: எங்களில் ஒருவருக்கு ஆண் குழந்தை பிறந்தது. அக்குழந்தைக்கு அவர் ‘காசிம்’ என்று பெயர் சூட்டினார். நாங்கள் (அவரிடம்), “உம்மை நாங்கள் அபுல்காசிம் (காசிமின் தந்தை) என்ற குறிப்புப் பெயரால் அழைத்து, மேன்மைப்படுத்திடமாட்டோம். (நபியவர்களுக்கு ‘அபுல்காசிம்’ எனும் பெயர் இருப்பதே காரணம்)” என்று சொன்னோம். ஆகவே, அவர் நபி (ஸல்) அவர்களிடம் (சென்று, இதைத்) தெரிவித்தார். அப்போது நபி (ஸல்) அவர்கள், “உம்முடைய மகனுக்கு அப்துர் ரஹ்மான் எனப் பெயர் சூட்டுக!” என்று கூறினார்கள்.212 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6187,
			"arabicnumber": 6187,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: எங்களில் ஒருவருக்கு ஆண் குழந்தை பிறந்தது. அக்குழந்தைக்கு அவர் ‘காசிம்’ என்று பெயர் சூட்டினார். அப்போது மக்கள் “நாங்கள் நபி (ஸல்) அவர்களிடம் (இது குறித்துத் தீர்ப்பு) கேட்காத வரை (குழந்தையின் தந்தையான) அவரை, ‘அபுல் காசிம் (காசிமின் தந்தை) என்ற குறிப்புப் பெயரால் அழைக்கமாட்டோம்” என்று கூறினர். (அவ்வாறே நாங்கள் நபி (ஸல்) அவர்களிடம் கேட்டோம்.) அப்போது நபி (ஸல்) அவர்கள், “என் பெயரைச் சூட்டிக்கொள்ளுங்கள்; ஆனால், எனது (‘அபுல்காசிம்’ எனும்) குறிப்புப் பெயரை நீங்கள் சூட்டிக்கொள்ளாதீர்கள்” என்று கூறினார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6188,
			"arabicnumber": 6188,
			"text": "அபுல்காசிம் (முஹம்மத் - ஸல்) அவர்கள் கூறினார்கள்: என் பெயரை நீங்கள் சூட்டிக்கொள்ளுங்கள். ஆனால், எனது (அபுல்காசிம் எனும்) குறிப்புப் பெயரை நீங்கள் சூட்டிக்கொள்ளாதீர்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.214 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6189,
			"arabicnumber": 6189,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: எங்களில் ஒருவருக்கு ஆண் குழந்தை பிறந்தது. அக்குழந்தைக்கு அவர் ‘காசிம்’ என்று பெயர் சூட்டினார். அப்போது மக்கள், “உம்மை நாங்கள் ‘அபுல் காசிம்’ (காசிமின் தந்தை) என்று குறிப்புப் பெயரால் அழைத்து உமக்கு மகிழ்ச்சி ஊட்டமாட்டோம்” என்று கூறினர். ஆகவே, அவர் நபி (ஸல்) அவர்களிடம் சென்று அதைத் தெரிவித்தார். அப்போது நபி (ஸல்) அவர்கள், “உங்கள் மகனுக்கு அப்துர் ரஹ்மான் என்று பெயர் சூட்டுங்கள்” என்று சொன்னார்கள்.215 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6190,
			"arabicnumber": 6190,
			"text": "முசய்யப் பின் ஹஸ்ன் (ரலி) அவர்கள் கூறியதாவது: என் தந்தை (ஹஸ்ன் பின் அபீவஹ்ப்-ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம் வந்தார்கள். அப்போது நபி (ஸல்) அவர்கள், “உங்கள் பெயரென்ன?” என்று கேட்டார்கள். அவர்கள், “ஹஸ்ன்” (முரடு) என்று கூறினார். நபி (ஸல்) அவர்கள், “(இல்லை) நீங்கள் (இனிமேல்) ‘சஹ்ல்’ (மென்மை)” என்று சொன்னார்கள். அவர், “என் தந்தை சூட்டிய பெயரை நான் மாற்றிக்கொள்ளமாட்டேன்” என்றார். அதற்குப் பின்னர் எங்கள் குடும்பத்தாரிடையே (அவர்களுடைய குணநலன்களில்) முரட்டுத்தனம் நீடித்தது. இதை சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஹஸ்ன் பின் அபீவஹ்ப் (ரலி) அவர்களிடமிருந்தும் இரு அறிவிப் பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6191,
			"arabicnumber": 6191,
			"text": "சஹ்ல் பின் சஅத் அஸ்ஸாஇதீ (ரலி) அவர்கள் கூறியதாவது: அபூஉசைத் மாலிக் பின் ரபீஆ (ரலி) அவர்களின் புதல்வர் ‘முன்திர்’ என்பவர் பிறந்தவுடன் நபி (ஸல்) அவர்களிடம் கொண்டுவரப்பட்டார். அப்போது நபி (ஸல்) அவர்கள், அக்குழந்தையைத் தமது மடியில் வைத்துக்கொண்டார்கள். அப்போது (குழந்தையின் தந்தை) அபூஉசைத் (ரலி) அவர்களும் அமர்ந்திருந்தார்கள். (திடீரென) நபி (ஸல்) அவர்களுக்கு முன்னால் நடந்த (சம்பவம்) ஒன்றினால் அவர்களின் கவனம் (வேறு பக்கம்) திரும்பியது. உடனே அபூஉசைத் (ரலி) அவர்கள் தம் புதல்வரை நபியவர்களின் மடியிலிருந்து எடுத்துவிடுமாறு கூற, அவ்வாறே (குழந்தை) தூக்கப்பட்டது. (சிறிது நேரத்தில்) தன்னிலைக்குத் திரும்பிய நபி (ஸல்) அவர்கள் “அந்தக் குழந்தை எங்கே?” என்று கேட்டார்கள். அதற்கு அபூஉசைத் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! குழந்தையை (வீட்டுக்கு) அனுப்பிவிட்டோம்” என்று கூறினார். “அக்குழந்தையின் பெயரென்ன?” என நபி (ஸல்) அவர்கள் கேட்க, ‘இன்னது’ என (தம் மகனுக்கு வைக்கப்பட்ட பெயரை) அபூஉசைத் கூறினார்கள். (அப்பெயர் பிடிக்காததால்) நபி (ஸல்) அவர்கள் “அல்ல; (இனிமேல்) அவர் பெயர் ‘முன்திர்’ (எச்சரிப்பவர்) ஆகும்” என்று கூறினார்கள். ஆகவே, அன்று அவருக்கு நபி (ஸல்) அவர்கள்தான் ‘முன்திர்’ எனப் பெயர் சூட்டினார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6192,
			"arabicnumber": 6192,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஸைனப் (ரலி) அவர்களுக்கு (முதலில்) ‘பர்ரா’ (நல்லவள்) என்ற பெயர் இருந்தது. அப்போது “அவர் தம்மைத் தாமே பரிசுத்தப்படுத்திக்கொள்கிறார்” என்று (மக்களால்) சொல்லப்பட்டது. ஆகவே, அவருக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ‘ஸைனப்’ என்று பெயர் சூட்டினார்கள்.217 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6193,
			"arabicnumber": 6193,
			"text": "சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் கூறியதாவது: என் பாட்டனார் (ஹஸ்ன்-ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம் வந்தார்கள். அப்போது நபி (ஸல்) அவர்கள், “உங்கள் பெயரென்ன?” என்று கேட்டார்கள். அவர் ‘ஹஸ்ன்’ (முரடு) என்று கூறினார். நபி (ஸல்) அவர்கள் “இல்லை; நீங்கள் (இனிமேல்) ‘சஹ்ல்’ (மென்மை)” என்று சொன்னார்கள். அவர், “என் தந்தை எனக்குச் சூட்டிய பெயரை நான் மாற்றமாட்டேன்” என்றார். அதற்குப் பின்னர் எங்கள் குடும்பத்தாரிடையே (அவர்களுடைய குணநலன்களில்) முரட்டுத்தனம் நீடித்தது.218 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 6194,
			"arabicnumber": 6194,
			"text": "இஸ்மாயீல் பின் காலித் அல்பஜலீ (ரஹ்) அவர்கள் கூறியதாவது: நான், இப்னு அபீஅவ்ஃபா (ரலி) அவர்களிடம், “தாங்கள் நபி (ஸல்) அவர்களின் புதல்வர் இப்ராஹீம் (ரலி) அவர்களைப் பார்த்தீர்களா?” என்று கேட்டேன். அதற்கு அவர்கள், “(ஆம். பார்த்திருக்கிறேன். எனினும்,) அவர் சிறுவயதிலேயே இறந்துவிட்டார். முஹம்மத் (ஸல்) அவர்களுக்குப் பின்னால் இறைத்தூதர் ஒருவர் இருப்பார் என (இறைவனால்) தீர்மானிக்கப்பட்டிருந்தால், நபி (ஸல்) அவர்களின் புதல்வர் (இப்ராஹீம் -ரலி) உயிர் வாழ்ந்திருப்பார். ஆனால், முஹம்மத் (ஸல்) அவர்களுக்குப் பின்னால் எந்த இறைத்தூதரும் இல்லை (என்பதே இறைவனின் முடிவாகும்). அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 6195,
			"arabicnumber": 6195,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: (தம் புதல்வர்) இப்ராஹீம் (ரலி) அவர்கள் இறந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இவருக்குப் பாலூட்டக்கூடிய செவிலித்தாய் சொர்க்கத்தில் இருக்கிறார்” என்று சொன்னார்கள்.220 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 6196,
			"arabicnumber": 6196,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் அல் அன்சாரி (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “என் பெயரை நீங்கள் சூட்டிக் கொள்ளுங்கள்; ஆனால், (‘அபுல்காசிம்’ எனும்) என் குறிப்புப் பெயரை நீங்கள் சூட்டிக்கொள்ளாதீர்கள். ஏனெனில், நானே உங்களிடையே பங்கீடு செய்பவன் (காசிம்) ஆவேன்” என்று கூறினார்கள்.221 இதை அனஸ் (ரலி) அவர்களும் அறிவிக்கிறார்கள்.222 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 6197,
			"arabicnumber": 6197,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: என் பெயரை நீங்கள் சூட்டிக்கொள்ளுங்கள். ஆனால், எனது (‘அபுல்காசிம்’ எனும்) குறிப்புப் பெயரை நீங்கள் சூட்டிக்கொள்ளாதீர்கள். யார் என்னைக் கனவில் கண்டாரோ உண்மையில் அவர் என்னைத்தான் கண்டார். ஏனெனில், ஷைத்தான் என் உருவத்தில் காட்சியளிக்க முடியாது. என்மீது யார் வேண்டுமென்றே பொய் சொல்கிறாரோ அவர் தமது இருப்பிடத்தை நரகத்தில் ஆக்கிக்கொள்ளட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.223 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 6198,
			"arabicnumber": 6198,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: எனக்கு ஓர் ஆண் குழந்தை பிறந் தது. அக்குழந்தையை நான் நபி (ஸல்) அவர்களிடம் கொண்டுசென்றேன். அப்போது அக்குழந்தைக்கு நபி (ஸல்) அவர்கள் ‘இப்ராஹீம்’ என்று பெயர் சூட்டி பேரீச்சம்பழத்தை மென்று குழந்தையின் வாயிலிட்டார்கள். அவனுக்காக வளம் வேண்டிப் பிரார்த்தனையும் புரிந்துவிட்டு என்னிடம் அவனைத் தந்தார்கள். அக்குழந்தையே அபூமூசா (ரலி) அவர்களின் மூத்த குழந்தையாகும்.224 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 6199,
			"arabicnumber": 6199,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: (நபி (ஸல்) அவர்களின் புதல்வர்) இப்ராஹீம் (ரலி) அவர்கள் இறந்த அன்று சூரிய கிரகணம் ஏற்பட்டது.225 இதே ஹதீஸை அபூபக்ரா (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடமிருந்து அறிவிக்கிறார்கள்.226 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 6200,
			"arabicnumber": 6200,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை தொழுகையில்) நபி (ஸல்) அவர்கள் ருகூவிலிருந்து தலையை உயர்த்தி (‘குனூத்’ எனும் சிறப்புப் பிரார்த்தனையில் பின்வருமாறு) கூறினார்கள்: இறைவா! வலீத் பின் அல்வலீத், சலமா பின் ஹிஷாம், அய்யாஷ் பின் அபீரபீஆ ஆகியோரையும் மக்காவிóலுள்ள ஒடுக்கப்பட்ட இறைநம்பிக்கை யாளர்களையும் நீ காப்பாற்றுவாயாக! இறைவா! (கடும்பகை) கொண்ட முளர் குலத்தார்மீது உனது பிடியை இறுக்கு வாயாக! இறைவா! (உன் தூதர்) யூசுஃபின் காலத்தில் ஏற்பட்ட பஞ்சம் நிறைந்த ஆண்டுகளைப்போல் இவர்களுக்கும் பஞ்ச ஆண்டுகளை ஏற்படுத்துவாயாக!227 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 6201,
			"arabicnumber": 6201,
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (ஒருநாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “ஆயிஷ்! இதோ (வானவர்) ஜிப்ரீல் உனக்கு சலாம் உரைக்கிறார்” என்று சொன்னார்கள். நான், (சலாமுக்குப் பதில் கூறும் முகமாக) ‘வ அலைஹிஸ் ஸலாம் வ ரஹ்மத்துல்லாஹ்’ (அவர்மீதும் சாந்தி பொழியட்டும். மேலும், அல்லாஹ்வின் கருணையும் பொழியட்டும்) என்று கூறினேன். மேலும், “நாங்கள் பார்க்க முடியாதவற்றை (நபி) அவர்கள் பார்க்கி றார்கள்” என்றும் ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்.230 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 6202,
			"arabicnumber": 6202,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: (ஒரு பயணத்தில் என் தாயார்) உம்மு சுலைம் (ரலி) அவர்கள் பயணப் பொருட்களுடன் (அவற்றின் காவலராக) இருந்தார்கள். நபி (ஸல்) அவர்களின் அடிமையான ‘அன்ஜஷா’ (நபியவர்களுடைய) துணைவியரின் ஒட்டகங்களைப் பாட்டுப் பாடி ஓடச் செய்துகொண்டிருந்தார். அப்போது நபி (ஸல்) அவர்கள், “அன்ஜஷ்! நிதானமாக ஓட்டிச்செல்! (ஒட்டகச் சிவிகைக்குள் இருக்கும்) கண்ணாடிக் குடுவைகளை (பெண்களை) உடைத்துவிடாதே!” என்றார்கள்.231 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 6203,
			"arabicnumber": 6203,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மக்களிலேயே மிகவும் நற்குணமுடையவராக விளங்கி னார்கள். எனக்கு ‘அபூஉமைர்’ என்ற ழைக்கப்பட்ட ஒரு தம்பி இருந்தார். அப்போது அவர் பால்குடி மறக்கவைக் கப்பட்ட பருவத்தில் இருந்தார் என்றே எண்ணுகிறேன். நபி (ஸல்) அவர்கள் (எம் வீட்டிற்கு வந்தால்), “அபூஉமைரே! பாடும் உன் சின்னக் குருவி என்ன செய்கிறது?” என்று கேட்பார்கள். அவன் அப்பறவையுடன் விளையாடிக்கொண்டிருப்பான். சில வேளை நபி (ஸல்) அவர்கள் எங்கள் வீட்டில் இருக்கும்போது தொழுகைக்குத் தயாராகிவிடுவார்கள். தாம் அமர்ந்திருக்கும் விரிப்பைச் சுத்தம் செய்திடுமாறு உத்தரவிடுவார்கள். அவ்வாறே அது கூட்டிச் சுத்தம் செய்யப்பட்டு தண்ணீர் தெளிக்கப்படும். பிறகு அதன் மீது நிற்பார்கள். நாங்களும் அவர்களுக்குப் பின்னால் நிற்போம். அப்போது அவர்கள் எங்களுக்குத் தொழுவிப்பார்கள்.233 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 6204,
			"arabicnumber": 6204,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: அலீ (ரலி) அவர்களுக்கு ‘அபூதுராப்’ (மண்ணின் தந்தை) எனும் குறிப்புப் பெயரே மிகவும் பிரியமானதாக இருந் தது. மேலும், அப்பெயர் சொல்லி தாம் அழைக்கப்படுவதையே அவர்கள் விரும்பினார்கள். அவர்களுக்கு ‘அபூதுராப்’ என நபி (ஸல்) அவர்களே பெயர் சூட்டினார்கள். (அப்பெயர் அவர்களுக்குச் சூட்டப்பட்டதற்கான காரணம்:) ஒருநாள் அலீ (ரலி) அவர்கள் (தம் துணைவியாரான) ஃபாத்திமா (ரலி) அவர்கள் மீது (ஏதோ காரணத்திற்காகக்) கோபப்பட்டு வெளியேறிச் சென்று பள்ளிவாசலில் ஒரு சுவரில் சாய்ந்து படுத்துக்கொண்டார்கள். அவர்களை (தேடியவாறு) பின்தொடர்ந்து நபி (ஸல்) அவர்கள் வந்தார்கள். அப்போது ஒருவர், “அவர் இதோ பள்ளிவாசலில் சுவரில் சாய்ந்து படுத்திருக்கிறார்” என்று கூறினார். ஆகவே, அலீ (ரலி) அவர்களிடம் நபி (ஸல்) அவர்கள் வந்தார்கள். (படுத்திருந்த தால்) அலீ (ரலி) அவர்களுடைய முதுகில் நிறைய மண் படிந்திருந்தது. நபி (ஸல்) அவர்கள் அலீயின் முதுகிலிருந்த மண்ணைத் துடைத்தவாறே “அபூதுராபே! (மண்ணின் தந்தையே! எழுந்து) அமருங்கள்” என்று கூறினார்கள்.234 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 6205,
			"arabicnumber": 6205,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் அல்லாஹ்விடம் மிகவும் அருவருப்பான பெயர், (உலகில்) ஒரு மனிதர் தமக்கு ‘மன்னாதி மன்னன்’ (மலிக்குல் அம்லாக்) என்று பெயர் சூட்டிக்கொண்டதாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 6206,
			"arabicnumber": 6206,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: அல்லாஹ்விடம் மிகவும் கேவலமான பெயர், (உலகில்) ஒரு மனிதன் தனக்கு ‘மன்னாதி மன்னன்’ (மலிக்குல் அம்லாக்) என்று பெயர் சூட்டிக்கொண்டதாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) சுஃப்யான் (ரஹ்) அவர்களது அறிவிப்பில், “பெயர்களில் மிகவும் கேவலமானது...” என்றும், வேறுசிலர் (‘மலிக்குல் அம்லாக்’ என்பதற்கு பாரசீக மொழியில்) ஷாஹான் ஷாஹ் (அரசர்களுக்கு அரசன்) என்று விளக்கம் கூறினர்” என்றும் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 6207,
			"arabicnumber": 6207,
			"text": "உஸாமா பின் ஸைத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘ஃபதக்’ நகர் முரட்டுத் துணி விரிக்கப்பட்ட கழுதையொன்றின் மீது அமர்ந்து, தமக்குப் பின்னால் என்னை அமர்த்திக்கொண்டு ஹாரிஸ் பின் கஸ்ரஜ் குலத்தாரிடையே (உடல்நலம் குன்றி) இருந்த சஅத் பின் உபாதா (ரலி) அவர்களை உடல் நலம் விசாரிக்கச் சென்றார்கள். இது பத்ர் போர் நிகழ்ச்சிக்கு முன்னால் நடந்தது. நாங்கள் இருவரும் பயணித்து ஓர் அவையைக் கடந்துசென்றோம். அந்த அவையில் (நயவஞ்சகர்களின் தலைவர்) அப்துல்லாஹ் பின் உபை பின் சலூல் இருந்தார். அவர் தம்மை முஸ்லிம் என்று காட்டிக்கொள்வதற்குமுன் இது நடந்தது. அந்த அவையில் முஸ்óம்கள், சிலை வழிபாட்டாளர்களான இணை வைப்பாளர்கள், யூதர்கள் ஆகிய பல்வேறு பிரிவினரும் இருந்தனர். முஸ்லிம்களில் (கவிஞர்) அப்துல்லாஹ் பின் ரவாஹா (ரலி) அவர்கள் இருந்தார்கள். (எங்கள்) ஊர்திப் பிராணியின் (காலடிப்) புழுதி அந்த அவையைச் சூழ்ந்து கொண்ட போது (நயவஞ்சகர்) அப்துல்லாஹ் பின் உபை தமது மேல்துண்டால் தமது மூக்கைப் பொத்திக்கொண்டு, “எங்கள்மீது புழுதியைக் கிளப்பாதீர்கள்” என்று சொன்னார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அ(ந்த அவையில் இருந்த)வர்களுக்கு சலாம் சொன்னார்கள். பிறகு தமது வாகனத்தை நிறுத்தி இறங்கி, அவர்களை அல்லாஹ்வின் (மார்க்கத்தின்)பால் அழைத்தார்கள். மேலும், அவர்களுக்கு குர்ஆனை ஓதிக் காட்டினார்கள். இதைக் கேட்ட அப்துல்லாஹ் பின் உபை (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை நோக்கி,) “மனிதரே! நீர் கூறுகின்ற விஷயம் உண்மையாயிருப்பின், அதைவிடச் சிறந்தது வேறொன்று மில்லை. (ஆனாலும்,) அதை எங்களுடைய (இதுபோன்ற) அவைகளில் கூறி எங்களுக்குத் தொல்லை தராதீர். உம்மிடம் வருவோரிடம் (இதை) எடுத் துரையுங்கள்” என்றார். (இதைக் கேட்ட) அப்துல்லாஹ் பின் ரவாஹா (ரலி) அவர்கள், “இல்லை. அல்லாஹ்வின் தூதரே! (இந்த) அவையிலேயே (இதை) எங்களுக்கு எடுத்துரையுங்கள். ஏனெனில், நாங்கள் அதை விரும்புகிறோம்” என்றார்கள். இதையொட்டி முஸ்லிம்களும் இணை வைப்பாளர்களும் யூதர்களும் (ஒருவரை யொருவர்) ஏசத் தொடங்கி தாக்கிக்கொள்ளும் அளவுக்குச் சென்றுவிட்டார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்கள் அனைவரும் மௌனமாகும்வரை அமைதிப்படுத்திக்கொண்டேயிருந்தார்கள். பிறகு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வாகனத்தில் ஏறிப் பயணத்தைத் தொடர்ந்து சஅத் பின் உபாதா (ரலி) அவர்களிடம் சென்று, “சஅதே! அபூஹுபாப் (அப்துல்லாஹ் பின் உபை) சொன்னதை நீங்கள் செவியுறவில்லையா? அவர் இப்படி இப்படிச் சொன்னார்” என்று அப்துல்லாஹ் பின் உபை சொன்னதைக் கூறினார்கள். (இதைக் கேட்ட) சஅத் பின் உபாதா (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! என் தந்தை தங்களுக்கு அர்ப்பணமாகட் டும். அவரை மன்னித்து விட்டுவிடுங்கள். தங்களுக்கு வேதத்தை அருளியவன்மீது சத்தியமாக! இந்த (மதீனா) நகரவாசிகள் (அப்துல்லாஹ் பின் உபை எனும்) அவருக்குக் கிரீடம் அணிவித்து அவருக்கு முடிசூட்டிட முடிவு செய்துவிட்டிருந்த நேரத்தில் அல்லாஹ் தங்களுக்கு அருளிய சத்திய (மார்க்க)த்தைக் கொண்டுவந்தான். அல்லாஹ் உங்களுக்கு வழங்கிய இந்த சத்திய(மார்க்க)த்தின் மூலம் அல்லாஹ்வே (இந்த நகரத்தாரின்) அந்த முடிவை நிராகரித்துவிட்டதைக் கண்ட அவர் ஆத்திரப்பட்டார். அதுதான் தாங்கள் பார்த்தபடி அவர் நடந்துகொண்டதற்குக் காரணம்” என்று கூறினார்கள். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அப்துல்லாஹ்வை மன்னித்துவிட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்கள் தம் தோழர்களும் அல்லாஹ்வின் ஆணைக்கேற்ப இணைவைப்பாளர்களையும் வேதக்காரர்களையும் மன்னித்துவிடுபவர்களாகவும், (அவர்களின்) தொல்லைகளைச் சகித்துக் கொள்பவர்களாகவும் இருந்தனர். உயர்ந்தோன் அல்லாஹ் கூறுகின்றான்: (இறைநம்பிக்கையாளர்களே!) உங்களுடைய செல்வங்களிலும் உங்களுடைய உயிர்களிலும் நிச்சயமாக நீங்கள் சோதிக்கப்படுவீர்கள். மேலும், உங்களுக்குமுன் வேதம் அருளப்பட்டவர்களிடமிருந்தும் இணைவைப்போரிடமிருந்தும் ஏராளமான நிந்தனைகளை நிச்சயம் நீங்கள் கேட்பீர்கள். (அப்போதெல்லாம்) நீங்கள் பொறுமையை மேற்கொண்டு (இறைவனை) அஞ்சினால் அதுதான் தீரச்செயலாகும்.(3:186) மேலும் அல்லாஹ் கூறுகின்றான்: (இறைநம்பிக்கையாளர்களே!) நீங்கள் இறைநம்பிக்கை கொண்டதற்குப்பின் உங்களை இறைமறுப்பாளர்களாக மாற்றிவிட வேண்டும் என்று வேதக்காரர்களில் பலர் விரும்புகின்றனர். (இது) அவர்களுக்கு உண்மை தெளிவாகிவிட்ட பின்னர் அவர்களின் உள்ளத்துள் எழுந்த பொறாமையினாலேயாம். ஆயினும், அல்லாஹ் தன் ஆணையைப் பிறப்பிக்கும்வரை (அவர்களை) நீங்கள் மன்னித்து விட்டுவிடுங்கள். நிச்சயமாக, அல்லாஹ் அனைத்தின் மீதும் பேராற்றல் உள்ளவன். (2:109) ‘அவர்களை மன்னித்து விட்டுவிட வேண்டும்’ என்பதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘அவர்கள் விஷயத்தில் (திட்டவட்டமான நடவடிக்கையெடுக்கும்படி) இறைவனிட மிருந்து தமக்கு ஆணை வரும்வரை அவர்களை மன்னித்து விட்டுவிட வேண்டும்’ என்பதையே விளக்கமாகக் கண்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பத்ர் போர் புரிந்தபோது (அவர்களுடன் போரிட்ட) குறைஷித் தலைவர்களையும் இறைமறுப்பாளர்களின் தலைவர்களையும் பத்ரில் அல்லாஹ் அழித்தான். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்கள் தம் தோழர்களும் வெற்றிவாகை சூடியவர்களாக, போர்ச் செல்வங்களைப் பெற்றவர்களாக (பத்ரிலிருந்து) திரும்பினார்கள். அவர்களுடன் குறைஷித் தலைவர்கள் மற்றும் இறைமறுப்பாளர்களின் தலைவர்கள் ஆகியோர் சிறைக்கைதிகளாக வந்தனர். அப்போது (அப்துல்லாஹ்) இப்னு உபை பின் சலூலும், அவருடன் இருந்த சிலை வழிபாட்டாளர்களான இணைவைப்பாளர்களும், “(இஸ்லாம் எனும்) இந்த விஷயம் மேலோங்கிவிட்டது. ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், இஸ்லாத்தை ஏற்பதாக உறுதிமொழி அளித்துவிடுங்கள்” என்று கூறி, (வெளித்தோற்றத்தில்) இஸ்லாத்தை ஏற்றனர்.236 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 6208,
			"arabicnumber": 6208,
			"text": "அப்பாஸ் பின் அப்தில் முத்தலிப் (ரலி) அவர்கள் கூறியதாவது: நான், “அல்லாஹ்வின் தூதரே! அபூதாலிப் (அப்து மனாஃப்) அவர்களுக்கு ஏதேனும் (பிரதி) உபகாரம் செய்தீர்களா? ஏனெனில், தங்களை அவர் பாதுகாப்பவராகவும் தங்களுக்காக (தங்கள் எதிரிகள்மீது) கோபப்படுபவராகவும் இருந்தாரே!” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “ஆம்; அவர் இப்போது (கணுக்கால்வரை தீண்டும்) சிறிதளவு நரக நெருப்பிலேயே உள்ளார். நான் இல்லையானால் அவர் நரகின் அடித்தளத்திற்குச் சென்றிருப்பார்” என்று கூறினார்கள்.237 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 6209,
			"arabicnumber": 6209,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரு பயணத்தில் இருந்தார்கள். அப்போது பாட்டுப்பாடி ஒட்டகமோட்டுபவர் ஒருவர் (அன்ஜஷா என்பவர்) பாடினார். அப்போது (அவரிடம்) நபி (ஸல்) அவர்கள், “அன்ஜஷா! உனக்குக் கேடுதான்! மெல்லப்போ. கண்ணாடிக் குடுவைகளை (பெண்களை) உடைத்துவிடாதே!” என்றார்கள்.240 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 6210,
			"arabicnumber": 6210,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரு பயணத்தில் இருந்தார்கள். அப்போது ‘அன்ஜஷா’ எனப்படும் ஓர் அடிமை பாட்டுப்பாடி (ஒட்டகத்திலிருந்த) பெண்களை அழைத்துச் சென்றுகொண்டிருந்தார். அப்போது அவரிடம் நபி (ஸல்) அவர்கள், “அன்ஜஷா! நிதானமாக ஓட்டிச்செல். கண்ணாடிக் குடுவைகளை -அதாவது பெண்களை -உடைத்துவிடாதே” என்றார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 6211,
			"arabicnumber": 6211,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்கு ‘அன்ஜஷா’ எனப்படும் ‘பாட்டுப்பாடி ஒட்டகமோட்டுபவர்’ ஒருவர் இருந்தார். அவர் அழகிய குரல் வளம் கொண்டவராக இருந்தார். (அவர் ஒருமுறை ஒட்டகத்தில் பெண்கள் இருக்க பாடிக்கொண்டிருந்தபோது) அவரிடம் நபி (ஸல்) அவர்கள், “அன்ஜஷா! நிதானம்! கண்ணாடிக் குடுவைகளை உடைத்துவிடாதே!” என்று சொன்னார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: மென்மையான பெண்களைக் கருத்தில் கொண்டே நபி (ஸல்) அவர்கள் (கண்ணாடிக் குடுவைகள் என்று சிலேடையாகக்) கூறினார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 6212,
			"arabicnumber": 6212,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை எதிரிகள் படையெடுத்து வருவதாக) மதீனாவில் பீதி நிலவியது. உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அபூதல்ஹா (ரலி) அவர்களின் குதிரை ஒன்றில் ஏறி (விவரமறிந்து வரத் துணிவுடன்) புறப்பட்டார்கள். (திரும்பி வந்து) “(பீதி ஏற்படுத்தும்) எதையும் நாம் காணவில்லை. (தங்கு தடையின்றி) ஓடும் கடலாகவே நாம் இந்தக் குதிரையைக் கண்டோம்” என்று சொன்னார்கள்.241 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 6213,
			"arabicnumber": 6213,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சோதிடர்கள் குறித்துச் சிலர் கேட்டனர். அவர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் “சோதிடர்கள் (பொருட்படுத்தத் தக்க) ஒரு பொருளே அல்ல” என்று பதிலளித்தார்கள். அவர்கள், “அல்லாஹ்வின் தூதரே! அவ்வாறா யின், சோதிடர்கள் சில வேளைகளில் ஒன்றைப் பற்றி அறிவிக்க அது உண்மை யாகிவிடுகிறதே (அது எப்படி?)” என்று வினவினர். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அந்த உண்மையான வார்த்தைகளை (வானவரிடமிருந்து) ஜின் ஒட்டுக்கேட்டு வந்து தம் (சோதிட) நண்பனின் காதில் சேவல் கொக்கரிப்பதுபோல் போட்டுவிடுகிறது. சோதிடர்கள் அதனுடன் நூற்றுக்கும் அதிகமான பொய்களைக் கலந்துவிடுகின்றனர்” என்று கூறினார்கள்.244 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 6214,
			"arabicnumber": 6214,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: பிறகு (சுமார் மூன்று வருடம்) எனக்கு வேதஅறிவிப்பு வருவது நின்றுபோய் விட்டது. இதற்கிடையில் (ஒருநாள்) நான் நடந்து போய்க்கொண்டிருந்தேன். அப்போது வானிலிருந்து ஒரு குரலைக் கேட்டேன். உடனே வானத்தை அண்ணாந்து பார்த்தேன். அங்கு ‘ஹிரா’ (குகையில்) என்னிடம் வந்த அதே வானவர் (ஜிப்ரீல்) வானத்துக்கும் பூமிக்கு மிடையே ஓர் ஆசனத்தில் அமர்ந்து கொண்டிருந்தார். இதை ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.247 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 6215,
			"arabicnumber": 6215,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (ஒருநாள்) நான் (என் சிறிய தாயார்) மைமூனா (ரலி) அவர்களின் வீட்டில் இரவு தங்கினேன். அவர்களிடம் நபி (ஸல்) அவர்களும் இருந்தார்கள். ‘இரவின் இறுதி மூன்றில் ஒரு பகுதி’ அல்லது ‘அதில் சிறிது நேரம்’ ஆனபோது நபி (ஸல்) அவர்கள் (படுக்கையிலிருந்து எழுந்து) அமர்ந்து வானத்தைப் பார்த்தவாறு “நிச்சயமாக வானங்கள் மற்றும் பூமியைப் படைத்திருப்பதிலும், இரவு பகல் மாறிமாறி வருவதிலும் அறிவுடையோருக்கு சான்றுகள் பல உள்ளன” எனும் (3:190ஆவது) இறை வசனத்தை ஓதினார்கள்.248 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 6216,
			"arabicnumber": 6216,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் மதீனாவின் தோட்டங்களில் ஒன்றில் இருந்தேன். நபி (ஸல்) அவர்களின் கையில் தடி ஒன்று இருந்தது. (ஏதோ யோசனையில் ஆழ்ந்திருந்த) அவர்கள் அந்தத் தடியால் நீருக்கும் களிமண்ணுக்கும் இடையே (தரையில்) அடித்துக் கொண்டிருந்தார்கள். அப்போது ஒரு மனிதர் வந்து (வாயிற்கதவைத்) திறக்கும்படி கேட்டார். நபி (ஸல்) அவர்கள், “அவருக்காகத் திறந்துவிடுங்கள்; அவருக்குச் சொர்க்கம் கிடைக்கவிருக்கிறது என்று நற்செய்தி சொல்லுங்கள்” என்று சொன்னார்கள். நான் சென்றேன். அங்கே அபூபக்ர் (ரலி) அவர்கள் இருந்தார்கள். அவர்களுக்காக (வாயிற்கதவைத்) திறந்தேன். அவர்களுக்குச் சொர்க்கம் கிடைக்கவிருப்பதாக (நபி (ஸல்) அவர்கள் கூறிய) நற்செய்தியைத் தெரிவித்தேன். பிறகு ஒரு மனிதர் வந்து (கதவைத்) திறக்கும்படி கோரினார். (நான் நபியவர்களிடம் அனுமதி கேட்க) நபி (ஸல்) அவர்கள், “அவருக்குத் திறந்துவிடுங்கள்; அவருக்குச் சொர்க்கம் கிடைக்கவிருக்கிறது என்று நற்செய்தி சொல்லுங்கள்” என்று சொன்னார்கள். அங்கு உமர் (ரலி) அவர்கள் இருந்தார்கள். அவர்களுக்காக(க் கதவை)த் திறந்து அவர்களுக்குச் சொர்க்கம் கிடைக்கவிருப்பதாக (நபி (ஸல்) அவர்கள் கூறிய) நற்செய்தியைத் தெரிவித்தேன். பிறகு ஒரு மனிதர் (கதவைத்) திறக்கும்படி கோரினார். (நான் நபியவர்களிடம் சென்று அனுமதி கேட்க) சாய்ந்துகொண்டிருந்த நபி (ஸல்) அவர்கள் (நேராக நிமிர்ந்து) அமர்ந்து, “(அவருக்கும்) திறந்துவிடுங்கள்; அவருக்கு நேரவிருக்கும் ஒரு துன்பத்தையடுத்து சொர்க்கம் அவருக்குக் கிடைக்கவிருக்கிறது என்று அவருக்கு நற்செய்தி சொல்லுங்கள்” என்று சொன்னார்கள். நானும் சென்றேன். (கதவைத் திறந்தேன்.) அங்கு உஸ்மான் (ரலி) அவர்கள் இருந்தார்கள். அவர்களுக்குச் சொர்க்கம் கிடைக்கவிருக்கும் நற்செய்தியைத் தெரிவித்து, நபி (ஸல்) அவர்கள் கூறியதையும் தெரிவித்தேன். அவர்கள் “(எனக்கு நேரவிருக்கும் அந்தத் துன்பத்தின்போது) அல்லாஹ்வே (பொறுமையைத் தந்து) உதவி புரிபவன் ஆவான்” என்று சொன்னார்கள்.249 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 6217,
			"arabicnumber": 6217,
			"text": "அலீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுடன் (‘பகீஉல் ஃகர்கத்’ எனும் பொது மைய வாடியில்) ஒரு ஜனாஸாவில் கலந்து கொண்டோம். அப்போது அவர்கள் ஒரு தடியால் தரையைக் கீறிய வண்ணம் (ஆழ்ந்த சிந்தனையில்) இருந்தார்கள். பின்னர், “தமது இருப்பிடம் சொர்க்கமா, அல்லது நரகமா எனத் தீர்மானிக்கப்படாத எவரும் உங்களில் இல்லை” என்று கூறினார்கள். அப்போது மக்கள் (சிலர்), “நாங்கள் (இதையே) நம்பி (நல்லறங்கள் செய்யாமல்) இருந்துவிடமாட்டோமா?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “நீங்கள் செயலாற்றுங்கள். (நல்லார், பொல்லார்) எல்லாருக்கும் (அவரவர் செல்லும் வழி) எளிதாக்கப்பட்டுள்ளது” என்று கூறிவிட்டு “யார் (இறைவழியில்) வழங்கி, (இறைவனை) அஞ்சி வாழ்ந்து, நல்லறங்களை மெய்ப்பிக்கிறாரோ அவர் (சொர்க்கத்தின்) நல்ல வழியில் செல்வதை நாம் எளிதாக்குவோம்” எனும் (92:5-7ஆகிய) வசனங்களை ஓதிக்காட்டினார்கள்.250 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 6218,
			"arabicnumber": 6218,
			"text": "உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: (ஒருநாள் இரவில்) நபி (ஸல்) அவர்கள் (திடீரென) விழித்தெழுந்து (பிரமிப்புடன்), “சுப்ஹானல்லாஹ்! (அல்லாஹ் தூயவன். இன்றிரவு) இறக்கிவைக்கப்பட்ட கருவூலங்கள்தான் என்ன? (இன்றிரவு) இறக்கிவைக்கப்பட்ட குழப்பங்கள்தான் என்ன? இந்த அறைகளில் உள்ள பெண்களை எழுப்பிவிடுகின்றவர் யார்? -தம் துணைவியர் குறித்தே இவ்வாறு கூறினார்கள்- அவர்கள் (அல்லாஹ்வைத்) தொழட்டும்! ஏனெனில், இவ்வுலகில் உடையணிந்திருக்கும் எத்தனையோ பெண்கள் மறுமையில் நிர்வாணமானவர்களாய் இருப்பார்கள்” என்று கூறினார்கள்.252 உமர் (ரலி) அவர்கள் கூறுகிறார்கள்: நான் நபி (ஸல்) அவர்களிடம், “தங்கள் துணைவியரை மணவிலக்குச் செய்துவிட்டீர்களா?” என்று (ஒரு சந்தர்ப் பத்தில்) கேட்டேன். அவர்கள், “இல்லை” என்று பதிலளித்தார்கள். நான் (ஆச்சரியப் பட்டவாறு) ‘அல்லாஹு அக்பர்’ (அல்லாஹ் மிகப் பெரியவன்) என்று சொன்னேன்.253 அத்தியாயம் :",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 6219,
			"arabicnumber": 6219,
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஸஃபிய்யா பின்த் ஹுயை (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ரமளான் மாதத்தின் இறுதிப் பத்து நாட்களில் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலில் ‘இஃதிகாஃப்’ இருந்துகொண்டிருந்தபோது அவர்களைச் சந்திப்பதற்காக நான் (பள்ளிவாசலுக்குச்) சென்றேன். (அந்த) இரவில் சிறிது நேரம் பேசிவிட்டு நான் திரும்பிச் செல்ல எழுந்தபோது, என்னை அனுப்பிவைப்பதற்காக என்னுடன் நபி (ஸல்) அவர்களும் எழுந்தார்கள். நான் நபி (ஸல்) அவர்களின் (மற்றொரு) துணைவியாரான உம்மு சலமா (ரலி) அவர்களின் இல்லத்தை ஒட்டியிருந்த பள்ளிவாசலின் வாயில் அருகில் வந்தபோது அன்சாரிகளில் இருவர் எங்களைக் கடந்து சென்றனர். அவர்கள் இருவரும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு முகமன் கூறிவிட்டுப் போய்க் கொண்டேயிருந்தனர். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இருவரையும் பார்த்து, “சற்று பொறுங்கள்! (என்னுடன் இருக்கும்) இந்தப் பெண் ஸஃபிய்யா பின்த் ஹுயைதான்” என்றார்கள். அந்த இருவரும் (வியப்புடன்) ‘சுப்ஹானல்லாஹ்’ (அல்லாஹ் தூயவன்), அல்லாஹ்வின் தூதரே!” என்றனர். நபி (ஸல்) அவர்கள் சொன்ன வார்த்தை அவர்கள் இருவருக்கும் பளுவாக இருந்தது. நபி (ஸல்) அவர்கள் “ஷைத்தான் ஆதமின் மகனின் (மனிதனின்) இரத்த நாளங்களில்(கூட) ஓடுகின்றான். உங்கள் உள்ளங்களில் (சந்தேகம் அல்லது தீய எண்ணம் எதையாவது) அவன் போட்டுவிடுவானோ என நான் அஞ்சினேன்” என்று சொன்னார்கள்.254 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 6220,
			"arabicnumber": 6220,
			"text": "அப்துல்லாஹ் பின் முகஃப்பல் (ரலி) அவர்கள் கூறியதாவது: கல்சுண்டு விளையாட்டிற்கு (‘கத்ஃப்’) நபி (ஸல்) அவர்கள் தடை விதித்தார்கள். மேலும் நபி (ஸல்) அவர்கள், “அது வேட்டைப் பிராணியையும் கொல்லாது; எதிரியையும் வீழ்த்தாது. மாறாக, அது கண்ணைப் பறித்துவிடும்; பல்லை உடைத்துவிடும்” என்று சொன்னார்கள்.255 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 6221,
			"arabicnumber": 6221,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்கருகில் இரு மனிதர்கள் தும்மினர். அப்போது அவர்களில் ஒருவருக்கு நபி (ஸல்) அவர்கள் (‘யர்ஹமுகல்லாஹ்-அல்லாஹ் உமக்குக் கருணைபுரிவானாக’ என்று) மறுமொழி கூறினார்கள். மற்றொருவருக்கு மறுமொழி கூறவில்லை. அப்போது அவர்களிடம் (இது குறித்துக்) கேட்கப்பட்டது. அதற்கு அவர்கள், “இவர் (தும்மியவுடன்) ‘அல்ஹம்து லில்லாஹ்’ என்று இறைவனைப் புகழ்ந்தார். அவர், ‘அல்ஹம்து லில்லாஹ்’ என்று இறைவனைப் புகழவில்லை. (எனவே, இவருக்கு மறுமொழி பகர்ந்தேன். அவருக்கு மறுமொழி பகரவில்லை)” என்று பதிலளித்தார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 6222,
			"arabicnumber": 6222,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஏழு விஷயங் களைக் கடைப்பிடிக்கும்படி எங்களுக்குக் கட்டளையிட்டார்கள். ஏழு செயல்களைச் செய்ய வேண்டாமென எங்களுக்குத் தடை விதித்தார்கள். எங்களுக்குக் கட்டளையிட்ட ஏழு விஷயங்கள் இவைதான்: 1.நோயாளிகளை நலம் விசாரிப்பது.2. ஜனாஸாவைப் பின்தொடர்ந்து செல்வது. 3. தும்மிய(வர் ‘அல்லாஹ்வுக்கே எல்லாப் புகழும்’ என்று கூறினால் அ)வருக்கு (‘அல்லாஹ் உங்களுக்குக் கருணை புரிவானாக’ என்று) மறுமொழி கூறுவது. 4. விருந்து அழைப்பை ஏற்றுக்கொள்வது. 5. சலாமுக்கு (முகமனுக்கு) பதில் உரைப்பது. 6. அநீதியிழைக்கப்பட்டவருக்கு உதவுவது. 7. சத்தியம் செய்தவர் அதை நிறைவேற்ற உதவுவது. (ஆண்களாகிய) எங்களுக்கு அவர்கள் தடை செய்த ஏழு விஷயங்கள் இவைதான்: 1. ‘பொன் மோதிரம் அணிவது’ அல்லது ‘பொன் வளையம் அணிவது’.2. சாதாரணப் பட்டு அணிவது. 3. அலங்காரப் பட்டு அணிவது. 4. மென்பட்டு அணிவது. 5. மென்பட்டுத் திண்டு பயன்படுத்துவது.257 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 6223,
			"arabicnumber": 6223,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் தும்மலை விரும்புகிறான்; கொட்டாவியை வெறுக்கிறான். ஆகவே, ஒருவர் தும்மியவுடன் ‘அல்ஹம்து லில் லாஹ்’ (எல்லாப் புகழும் அல்லாஹ் வுக்கே) என்று சொன்னால், அதைக் கேட்கும் ஒவ்வொரு முஸ்லிமின் மீதும் அவருக்கு (‘யர்ஹமுக்கல்லாஹ்-அல்லாஹ் உங்களுக்குக் கருணை புரியட்டும்’ என்று) மறுமொழி கூறுவது அவசியமாகும். ஆனால், கொட்டாவி ஷைத்தானிட மிருந்து வருவதாகும். உங்களில் யாராவது கொட்டாவி விட்டால் முடிந்த வரை அதைக் கட்டுப்படுத்தட்டும். ஏனெனில், யாரேனும் (கட்டுப்படுத்தாமல்) ‘ஹா’ என்று (கொட்டாவியால்) சப்தமிட்டால் ஷைத்தான் சிரிக்கிறான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.259 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 6224,
			"arabicnumber": 6224,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: உங்களில் ஒருவர் தும்மினால், ‘அல்ஹம்து லில்லாஹ்’ (எல்லாப் புகழும் அல்லாஹ்வுக்கே) என்று சொல்லட்டும்! (இதைக் கேட்கும்) ‘அவர் சகோதரர்’ அல்லது ‘நண்பர்’ யர்ஹமுக்கல்லாஹ் (அல்லாஹ் உங்களுக்குக் கருணை புரியட்டும்) என்று சொல்லட்டும். அவர் உங்களுக்காக ‘யர்ஹமுக்கல்லாஹ்’ என்று சொன்னால், நீங்கள் (அவருக்காக) ‘யஹ்தீக்குமுல்லாஹ் வ யுஸ்லிஹு பாலக்கும்’ (அல்லாஹ் உங்களுக்கு நல்வழி காட்டட்டும்! உங்கள் நிலையைச் சீராக்கட்டும்) என்று சொல்லுங்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 6225,
			"arabicnumber": 6225,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்கருகில் இருவர் தும்மினர். அப்போது அவர்களில் ஒருவருக்கு நபி (ஸல்) அவர்கள் (‘அல்லாஹ் உங்களுக்குக் கருணை புரிவானாக’ என) மறுமொழி கூறினார்கள். இன்னொருவருக்கு மறுமொழி கூறவில்லை. அப்போது அந்த மனிதர், “அல்லாஹ்வின் தூதரே! இவருக்கு மறுமொழி கூறினீர்கள். எனக்கு மறுமொழி கூறவில்லையே!” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “இவர் (தும்மியவுடன்) (‘அல்ஹம்து லில்லாஹ்’ என்று) இறைவனைப் புகழ்ந்தார். நீர் (‘அல்ஹம்து லில்லாஹ்’ என்று கூறி) இறைவனைப் புகழவில்லை. (எனவே, இவருக்கு மறுமொழி பகர்ந்தேன். உமக்கு மறுமொழி பகரவில்லை)” என்று பதிலளித்தார்கள்.260 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 6226,
			"arabicnumber": 6226,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் தும்மலை விரும்புகிறான். கொட்டாவியை வெறுக்கிறான். ஆகவே, உங்களில் ஒருவர் தும்மியவுடன் ‘அல்ஹம்து லில்லாஹ்’ (எல்லாப் புகழும் அல்லாஹ்வுக்கே) என்று சொன்னால், அதைக் கேட்கும் ஒவ்வொரு முஸ்லிமின் மீதும் அவருக்கு (‘அல்லாஹ் உங்களுக்குக் கருணை புரிவானாக’ என) மறுமொழி கூறுவது அவசியமாகும். ஆனால், கொட்டாவி ஷைத்தானிடமிருந்து வருவதாகும். ஆகவே, உங்களில் யாராவது கொட்டாவி விட்டால் முடிந்த வரை அதைக் கட்டுப்படுத்தட்டும். ஏனெனில், உங்களில் ஒருவர் (கட்டுப்படுத்தாமல் ‘ஹா’ என்று சப்தமிட்டுக்) கொட்டாவி விட்டால் அதைப் பார்த்து ஷைத்தான் சிரிக்கிறான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.261 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 250
			}
		}
	]
}