{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"8": "Prayers (Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 349,
			"arabicnumber": 349,
			"text": "அபூதர் (ரலி) அவர்கள் அறிவித்து வந்ததாக அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நான் மக்காவில் இருந்தபோது என் வீட்டின் கூரை பிளக்கப்பட்டது. (அதன் வழியாக வானவர்) ஜிப்ரீல் (அலை) அவர்கள் இறங்கி (வந்து), என்னுடைய நெஞ்சைப் பிளந்தார். பிறகு அதை ‘ஸம்ஸம்’ தண்ணீரால் கழுவினார். பிறகு நுண்ணறிவாலும் இறைநம்பிக்கையாலும் நிரம்பிய தங்கத் தட்டு ஒன்றைக் கொண்டுவந்து என் நெஞ்சத்தினுள் அதை ஊற்றி (நிரப்பி)னார். பிறகு (பழையபடியே நெஞ்சை) மூடிவிட்டார். பிறகு என் கையைப் பிடித்து (என்னை அழைத்து)க்கொண்டு விண்ணில் ஏறினார். முதலாவது வானத்திற்கு நான் சென்றபோது அந்த வானத்தின் காவலரிடம், ‘திறங்கள்’ என்று ஜிப்ரீல் (அலை) அவர்கள் கூறினார். அதற்கு அவர், “யார் அது?” எனக் கேட்டார். ஜிப்ரீல் (அலை) அவர்கள், “ஜிப்ரீல்” என்று பதிலளித்தார். அதற்கு அவர், “உங்களுடன் யாரேனும் உள்ளார்களா?” எனக் கேட்டார். அவர், “ஆம்; என்னுடன் முஹம்மத் (ஸல்) அவர்கள் இருக்கிறார் கள்” என்று பதிலளித்தார். அதற்கு அவர், “(அவரை அழைத்துவரச் சொல்-) அவரிடம் ஆளனுப்பப்பட்டதா?” என்று கேட்க, ஜிப்ரீல் (அலை) அவர்கள் ‘ஆம்’ என்று கூறினார். (முதல் வானத்தின் கதவை) அவர் திறந்தபோது, நாங்கள் அந்த வானத்தின் மேலே (இன்னும்) சென்றோம். அங்கு ஒரு மனிதர் அமர்ந்திருந்தார். அவரது வலப் பக்கத்திலும் இடப் பக்கத்திலும் மக்கள் இருந்தனர். அவர் தமது வலப் பக்கம் பார்க்கும்போது சிரித்தார்; தமது இடப் பக்கம் பார்க்கும்போது அழுதார். (பிறகு என்னைப் பார்த்து,) “நல்ல இறைத்தூதரே வருக! நல்ல மகனே வருக!” என்று (வாழ்த்துக்) கூறினார். நான் ஜிப்ரீல் அவர்களிடம், “இவர் யார்?” எனக் கேட்டேன். ஜிப்ரீல் அவர்கள், “இவர்தான் (ஆதி மனிதர்) ஆதம் (அலை) அவர்கள்; இவருடைய வலப் பக்கமும் இடப் பக்கமும் இருக்கும் மக்கள் அவருடைய சந்ததிகள். அவர்களில் வலப் பக்கம் இருப்பவர்கள் சொர்க்கவாசிகள். இடப் பக்கத்தில் இருக்கும் மக்கள் நரகவாசிகள். ஆகவேதான், இவர் வலப் பக்கம் பார்க்கும்போது (மகிழ்ச்சியால்) சிரிக்கிறார்; இடப் பக்கம் பார்க்கும் போது (வேதனைப்பட்டு) அழுகிறார்” என்று பதிலளித்தார். பிறகு என்னை அழைத்துக்கொண்டு ஜிப்ரீல் இரண்டாம் வானத்திற்கு ஏறிச் சென்றார். அதன் காவலரிடம் ‘திறங்கள்’ என்று கூறினார். அதன் காவலரும் முதலாமவர் கேட்டதைப் போன்றே கேட்டார். பிறகு (முன்பு போன்றே ஜிப்ரீல் பதிலளித்தபின்) அவர் கதவைத் திறந்தார். அனஸ் (ரலி)அவர்கள் கூறுகிறார்கள்: “நபி (ஸல்) அவர்கள், வானங்களில் ஆதம் (அலை), இத்ரீஸ் (அலை), மூசா (அலை), ஈசா (அலை), இப்ராஹீம் (அலை) ஆகியோரைக் கண்டதாக அபூதர் (ரலி) அவர்கள் கூறினார்களே தவிர, அவர்கள் தங்கியிருந்த இடங்கள் எங்கெங்கே அமைந்திருந்தன என்பது பற்றி அவர்கள் (என்னிடம்) குறிப்பிட்டுக் கூறவில்லை. எனினும், நபி (ஸல்) அவர்கள் ஆதம் (அலை) அவர்களை அண்மையிலுள்ள (முதல்) வானத்தில் கண்டதாகவும் இப்ராஹீம் (அலை) அவர்களை ஆறாவது வானத்தில் கண்டதாகவும் மட்டுமே சொன்னார்கள்.4 அனஸ் (ரலி) அவர்கள் மேலும் கூறுகிறார்கள்: “என்னுடன் ஜிப்ரீல் (அலை) அவர்கள் இத்ரீஸ் (அலை) அவர்களைக் கடந்து சென்றபோது “நல்ல இறைத்தூதரே வருக! நல்ல சகோதரரே வருக!” என்று இத்ரீஸ் (அலை) அவர்கள் (வாழ்த்துக்) கூறினார்கள். நான், “இவர் யார்?” என்று கேட்டேன். அதற்கு ஜிப்ரீல், “இவர்தான் இத்ரீஸ்” என்று பதிலளித்தார். பிறகு மூசா (அலை) அவர்களைக் கடந்து சென்றேன். அப்போது அவர்களும், “நல்ல நபியே வருக! நல்ல சகோதரரே வருக!” என்று (வாழ்த்துக்) கூறினார்கள். நான், “இவர் யார்?” என்று (ஜீப்ரீ-டம்) கேட்டேன். அதற்கு ஜிப்ரீல் (அலை) அவர்கள், “இவர்தான் மூசா” என்று பதிலளித்தார். பின்னர் நான் (அந்தப் பயணத்தில்) ஈசா (அலை) அவர்களையும் கடந்து சென்றேன். அவர்களும் “நல்ல சகோதரரே வருக! நல்ல இறைத்தூதரே வருக!” என்று கூறினார்கள். நான், “இவர் யார்?” என்று (ஜிப்ரீ-டம்) கேட்டேன். அதற்கு ஜிப்ரீல், “இவர்தான் ஈசா” என்று பதிலளித்தார். பிறகு நான் இப்ராஹீம் (அலை) அவர்களைக் கடந்து சென்றேன். அவர்கள், “நல்ல நபியே வருக! நல்ல மகனே வருக!” என்று (வாழ்த்துச்) சொன்னார்கள். நான், “இவர் யார்?” என்று கேட்டேன். ஜிப்ரீல் (அலை) அவர்கள், “இவர்தான் இப்ராஹீம்” என்று கூறினார் என நபி (ஸல்) அவர்கள் கூறினார்கள். இப்னு ஷிஹாப் (முஹம்மத் பின் முஸ்-ம்) அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: இப்னு அப்பாஸ் (ரலி), அபூஹப்பா அல்அன்சாரி (ரலி) ஆகியோர் கூறி வந்ததாக இப்னு ஹஸ்ம் (அபூபக்ர் பின் முஹம்மத்- ரஹ்) அவர்கள் என்னிடம் தெரிவித்ததாவது: நபி (ஸல்) அவர்கள் கூறினார்கள்: பிறகு (இன்னும்) மேலே என்னை அழைத் துச் செல்லப்பட்டது. நான் ஓர் உயரமான இடத்தில் ஏறிக்கொண்டிருந்தபோது, (வானவர்கள் விதிகளைப் பதிவு செய்யும்) எழுதுகோல்களின் ஓசையைச் செவி யுற்றேன். இப்னு ஹஸ்ம் (ரஹ்) அவர்களும் அனஸ் பின் மா-க் (ரலி) அவர்களும் கூறியதாவது: நபி (ஸல்) அவர்கள் கூறினார்கள்: அப்போது (நான் உட்பட) என் சமுதாயத்தார் அனைவர்மீதும் (நாளொன்றுக்கு) ஐம்பது தொழுகைகளை அல்லாஹ் கடமையாக்கினான். அதைப் பெற்றுக்கொண்டு நான் திரும்பியபோது மூசா (அலை) அவர்களைக் கடந்தேன். அப்போது மூசா (அலை) அவர்கள், “உங்கள்மீது உங்கள் சமுதாயத்தாருக்காக அல்லாஹ் என்ன கடமையாக்கினான்?” என்று கேட்டார்கள். நான், “(என் சமுதாயத்தார்மீது) ஐம்பது தொழுகைகளைக் கடமையாக்கியுள்ளான்” என்று பதிலளித்தேன். அவர்கள், “அப்படியானால் உங்கள் இறைவனிடம் திரும்பிச் செ(ன்று சற்று குறைத்துக் கடமையாக்கும்படி சொ)ல்லுங்கள் ஏனெனில், உங்கள் சமுதாயத்தாரால் அதைத் தாங்க முடியாது” என்று கூறினார்கள். உடனே நான் என் இறைவனிடம் திரும்பிச் சென்றேன். (தொழுகைகளின் எண்ணிக்கையைக் குறைத்துக் கேட்டபோது) இறைவன் ஐம்பதில் ஒரு பகுதியைக் குறைத்தான். மூசா (அலை) அவர்களிடம் நான் திரும்பிச்சென்று, “அதில் ஒரு பகுதியை இறைவன் குறைத்துவிட்டான்” என்று சொன்னேன். அப்போதும் அவர்கள், “உங்கள் இறைவனிடம் திரும்பிச் செல்லுங்கள் (இன்னும் சிறிது குறைத்துத் தரும்படி கேளுங்கள்). ஏனெனில், இதையும் உங்கள் சமுதாயத்தாரால் தாங்க முடியாது” என்று சொன்னார்கள். அவ்வாறே, நானும் (இறைவனிடம்) திரும்பினேன். அவன் அவற்றில் இன்னொரு பகுதியைக் குறைத்தான். மூசா (அலை) அவர்களிடம் வந்தபோது, “உங்கள் இறைவனிடம் திரும்பிச் செல்லுங் கள். இதையும் உங்கள் சமுதாயத்தார் தாங்கமாட்டார்கள்” என்றார்கள். இவ் வாறாக நான் திரும்பிச் சென்று (இறுதியில்) “இவை ஐவேளைத் தொழுகைகள் ஆகும். (நற்பலனில்) ஐம்பது (வேளைத் தொழு கைக்கு ஈடு) ஆகும். என்னிடம் இந்தச் சொல் (இனி) மாற்றப்படாது” என்று அல்லாஹ் கூறிவிட்டான். பின்னர் நான் மூசா (அலை) அவர்களி டம் திரும்பிச் சென்றேன். அவர்கள், “(மீண்டும்) உங்கள் இறைவனிடம் திரும்பிச் செல்லுங்கள்” என்றார்கள். நான், “என் இறைவனிடம் (மேலும் சலுகை கோர) வெட்கப்படுகிறேன்” என்று சொன்னேன். பிறகு ஜிப்ரீல் (அலை) அவர்கள் என்னை அழைத்துக்கொண்டு (வானுலகின் எல்லையான) ‘சித்ரத்துல் முன்தஹா’வுக்குச் சென்றார்கள். இனம் புரியாத பல வண்ணங்கள் அதைப் போர்த்தியிருந்தன. பிறகு நான் சொர்க்கத்துக்குள் அனுமதிக்கப்பட்டேன். அங்கு முத்தாலான கழுத்தணிகளைக் கண்டேன். சொர்க்கத்தின் மண் (நறுமணம் கமழும்) கஸ்தூரியாக இருந்தது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 350,
			"arabicnumber": 350,
			"text": "இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (மிஅராஜ் இரவில்) அல்லாஹ் தொழுகையைக் கடமையாக்கியபோது, சொந்த ஊரில் இருந்தாலும் பயணத்தில் இருந்தாலும் இரண்டு இரண்டு ரக்அத்களாகவே கடமையாக்கினான். பின்னர் பயணத் தொழுகை அவ்வாறே (இரண்டு இரண்டு ரக்அத்களாகவே) நீடித்தது; சொந்த ஊரில் தொழும் தொழுகையில் (லுஹ்ர், அஸ்ர், இஷா ஆகியவற்றில்) தலா இரண்டு ரக்அத்கள் கூடுதலாக்கப்பட்டது.5 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 351,
			"arabicnumber": 351,
			"text": "உம்மு அத்திய்யா (ரலி) அவர்கள் கூறியதாவது: இரு பெருநாட்களில் மாதவிடாய் ஏற்பட்டுள்ள பெண்களையும் திரைக்குள் ளிருக்கும் (பருவமடைந்த) பெண்களை யும் (தொழுகைத் திடலுக்கு) புறப்படச் செய்யுமாறு நாங்கள் (இறைத்தூதரால்) பணிக்கப்பட்டோம். “பெண்கள் அனைவரும் முஸ்-ம்களின் கூட்டுத் தொழுகையிலும் பிரார்த்தனை யிலும் கலந்துகொள்ள வேண்டும். மாதவிடாயுள்ள பெண்கள் மற்றப் பெண்கள் தொழும் இடத்தி-ருந்து விலகியிருக்க வேண்டும்” (என்று நபி (ஸல்) அவர்கள் கூற, இதைக் கேட்டுக் கொண்டிருந்த) ஒரு பெண், “அல்லாஹ்வின் தூதரே! எங்களில் ஒருத்தியிடம் துப்பட்டா இல்லாவிட்டால் என்ன செய்வது)?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “(ஒரு பெண்ணிடம் துப்பட்டா இல்லாவிட்டால்) அவளுடைய தோழி தன் துப்பட்டாக்களில் ஒன்றை அவளுக்கு (இரவலாக) அணியக் கொடுக்கட்டும்!” என்றார்கள்.8 இதை முஹம்மத் பின் சீரீன் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 352,
			"arabicnumber": 352,
			"text": "முஹம்மத் பின் அல்முன்கதிர் (ரஹ்) அவர்கள் கூறியதாவது: ஜாபிர் (ரலி) அவர்கள் (ஒரு முறை) ஒரே கீழாடையை அணிந்துகொண்டு, அதைத் தமது பிடரியின் பக்கமாக முடிச்சுப்போட்டுக்கொண்டவர்களாகத் தொழுதார்கள். அப்போது அவர்களின் (மற்ற) ஆடைகள் துணி மாட்டும் பலகையில் வைக்கப்பட்டிருந்தன. அவர்களிடம் ஒருவர், “ஒரே கீழாடையிலா தொழுகிறீர்கள்?” என்று கேட்டார். அதற்கு ஜாபிர் (ரலி) அவர்கள், “உம்மைப் போன்ற விவரமில்லாதவர்கள் என்னைப் பார்க்க வேண்டும் என்பதற்காகவே இவ்வாறு நான் செய்தேன்” என்று கூறிவிட்டு, “நபி (ஸல்) அவர்களது காலத்தில் எங்களில் யாருக்குத்தான் இரு ஆடைகள் இருந்தன?” என்று வினவினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 353,
			"arabicnumber": 353,
			"text": "முஹம்மத் பின் அல்முன்கதிர் (ரஹ்) அவர்கள் கூறியதாவது: ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் ஒரே ஆடையை அணிந்து கொண்டு தொழுவதை நான் பார்த்தேன். மேலும் அவர்கள், “நபி (ஸல்) அவர்கள் ஒரே ஆடையை அணிந்துகொண்டு தொழுவதை நான் கண்டேன்” என்றும் கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 354,
			"arabicnumber": 354,
			"text": "உமர் பின் அபீசலமா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரே ஆடையை அணிந்துகொண்டு, அதன் இரு ஓரங் களையும் தம் தோள்கள்மீது மாற்றிப் போட்டுக்கொண்டு தொழுதார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 355,
			"arabicnumber": 355,
			"text": "உமர் பின் அபீசலமா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் உம்மு சலமா (ரலி) அவர்களின் இல்லத்தில், ஒரே ஆடையை அணிந்து அதன் இரு ஓரங் களையும் தம் தோள்கள்மீது மாற்றிப் போட்டுக்கொண்டு தொழுததை நான் பார்த்தேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 356,
			"arabicnumber": 356,
			"text": "உமர் பின் அபீசலமா (ரலி) அவர்கள் கூறியதாவது: உம்மு சலமா (ரலி) அவர்களது இல்லத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரே ஆடையை அணிந்து கொண்டு, அதன் இரு ஓரங்களையும் தம் தோள்கள்மீது மாற்றிப் போட்டுக்கொண்டு தொழுவதை நான் பார்த்தேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 357,
			"arabicnumber": 357,
			"text": "உம்முஹானீ பின்த் அபீதா-ப் (ரலி) அவர்கள் கூறியதாவது: மக்கா வெற்றிகொள்ளப்பட்ட ஆண்டில் நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றேன். (வெற்றி கிட்டிய அந்த நாளில்) நபி (ஸல்) அவர்கள் குளித்துக்கொண்டிருப்பதைக் கண்டேன். அவர்களை, அவர்களுடைய புதல்வி ஃபாத்திமா (ரலி) அவர்கள் (ஒரு துணியால்) மறைத்துக்கொண்டிருந்தார்கள். அப்போது அவர்களுக்கு நான் முகமன் (சலாம்) கூறினேன். (அதைக் கேட்ட) அவர்கள், “யார் அது?” என்று கேட்டார்கள். அதற்கு “நான் உம்மு ஹானீ பின்த் அபீதா-ப்” என்றேன். “உம்மு ஹானியே! வருக!” என்று சொன்னார்கள். அவர்கள் குளித்து முடித்ததும் ஒரே ஆடையை மாற்றிப் போட்டுக்கொண்டு எட்டு ரக்அத்கள் தொழுதார்கள், அவர்கள் தொழுது முடித்ததும், “அல்லாஹ்வின் தூதரே! என் தாயாரின் மகன் (என் சகோதரர் அலீ,) நான் புக-டம் அளித் திருக்கும் ஒரு மனிதரை- ஹுபைராவின் மகன் இன்னாரை- தாம் கொல்லப் போவ தாகக் கூறுகிறார்” என்று சொன்னேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உம்மு ஹானியே! நீ அபயம் அளித்தவருக்கு நாமும் அபயம் அளித்து விட்டோம் (ஆகவே கவலை வேண்டாம்)” என்று கூறினார்கள். (நான் நபி (ஸல்) அவர்களிடம் சென்ற) அந்த நேரம் முற்பகல் (ளுஹா) நேரமாக இருந்தது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 358,
			"arabicnumber": 358,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரே ஆடையை அணிந்துகொண்டு தொழுவது பற்றிக் கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உங்களில் ஒவ்வொரு வருக்கும் இரண்டு ஆடைகள் உண்டா?” என்று (திருப்பிக்) கேட்டார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 359,
			"arabicnumber": 359,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தம் தோள்களை மறைக்காமல் ஒரே ஆடையை அணிந்துகொண்டு தொழ வேண்டாம். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 360,
			"arabicnumber": 360,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “ஒரே ஆடையை அணிந்துகொண்டு எவரேனும் தொழுதால், அதன் இரு ஓரங்களையும் (வலப்புற ஓரத்தை இடது தோளிலும் இடப்புற ஓரத்தை வலது தோளிலுமாக) மாற்றிப் போட்டுக் கொள்ளட்டும்” என்று கூறியதை நான் கேட்டேன் என உறுதி அளிக்கிறேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 361,
			"arabicnumber": 361,
			"text": "சயீத் பின் ஹாரிஸ் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடம், ஒரே ஆடை அணிந்துகொண்டு தொழுவது பற்றிக் கேட்டோம். அதற்கு ஜாபிர் (ரலி) அவர்கள் கூறினார்கள்: நபி (ஸல்) அவர்கள் மேற்கொண்ட ஒரு பயணத்தில் நான் அவர்களுடன் சென்றேன். ஒரு (நாள்) இரவு எனது தேவையொன்றுக்காக நான் (அவர்களிடம்) சென்றபோது நபி (ஸல்) அவர்கள் தொழுதுகொண்டிருக்கக் கண்டேன். அப்போது என்மீது ஒரே ஆடை மட்டுமே இருந்தது. அதை நான் என் உடல் முழுதும் போர்த்திக்கொண்டு நபி (ஸல்) அவர்களுக்கு அருகில் நின்று தொழுதேன். அவர்கள் தொழுது முடித்ததும் “என்ன, இரவு நேரத்தில் வந்திருக்கிறீர், ஜாபிரே?” என்று கேட்டார்கள். அப்போது நான் எனது நோக்கத்தை அவர்களிடம் தெரிவித்தேன். நான் சொல்-முடித்ததும், “என்ன இப்படி (கைகள்கூட வெளியே தெரியாமல்) போர்த்திக் கொண்டிருக்கிறீர்?” என்று கேட்டார்கள். நான் ஆடை சிறியது (அதனால் இப்படிப் போர்த்தியுள்ளேன்)” என்று சொன்னேன். அப்போது நபி (ஸல்) அவர்கள், “ஆடை விசாலமானதாக இருந்தால், அதை (கீழேயும் தோள்மீதும்) சுற்றிக் கொள்ளுங்கள்; ஆடை சிறியதாக இருந் தால் அதை இடுப்பில் (வேட்டியாக) அணிந்துகொள்ளுங்கள்” என்று கூறி னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 362,
			"arabicnumber": 362,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: சில ஆண்கள் சிறுவர்களைப் போன்று தங்களது சிறிய கீழங்கியைத் தங்கள் கழுத்தில் கட்டிக்கொண்டு நபி (ஸல்) அவர்களுடன் தொழுவார்கள். (இதைக் கண்ட நபியவர்கள்) பெண்களிடம், “ஆண்கள் (சஜ்தாவி-ருந்து எழுந்து) உட்காரும்வரை நீங்கள் (சஜ்தாவி-ருந்து) தலையை உயர்த்தாதீர்கள்” என்று சொன்னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 363,
			"arabicnumber": 363,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் (தபூக் போர்) பயணத்தில் இருந்தேன். அப்போது அவர்கள், “முஃகீராவே! தண்ணீர்ப் பாத்திரத்தை எடுங்கள்” என்றார்கள். நான் அதை எடுத்துக்கொண்டேன். நபி (ஸல்) அவர்கள் நடந்து (கண்ணுக்கெட்டாத தூரம்) சென்று என்னைவிட்டு மறைந்து இயற்கைக் கடனை நிறைவேற்றினார்கள். அப்போது அவர்கள் (இறைமறுப்பாளர் கள் நெய்த) ஷாம் (சிரியா) நாட்டு நீளங்கி (ஜுப்பா) அணிந்திருந்தார்கள். (அங்கத் தூய்மை செய்வதற்காக) அதன் கை பகுதியி-ருந்து தமது கையை வெளியே எடுக்க முயன்றார்கள். அதன் கைப் பகுதி குறுகலாக இருந்ததால் தமது கையை அதன் கீழ்ப்புறமாக வெளியே எடுத்தார்கள். நான் (அவர்கள் அங்கத் தூய்மை செய்வதற்காக) அவர்க(ளின் உறுப்பு)கள்மீது தண்ணீர் ஊற்றினேன். அவர்கள் தொழுகைக்காக அங்கத் தூய்மை செய்வதைப் போன்று அங்கத் தூய்மை செய்தார்கள். (இறுதியில் கால்களைக் கழுவுவதற்குப் பதிலாகக் கால்களில் அணிந்திருந்த) தமது காலுறைகள்மீது ஈரக் கையால் தொட்டுத் தடவி (மஸ்ஹு செய்திடலா)னார்கள். பிறகு தொழுதார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 364,
			"arabicnumber": 364,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (நபியவர்களின் காலத்தில் குறைஷி யரால் இறையில்லம் கஅபா புதுப்பித்துக் கட்டப்பட்டபோது) அவர்களுடன் (சிறுவராயிருந்த) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் கஅபாவிற்காகக் கற் களை(ச் சுமந்து) எடுத்து வந்துகொண்டி ருந்தார்கள். அப்போது நபியவர்கள்மீது கீழங்கி (மட்டுமே) இருந்தது. அவர்களு டைய பெரிய தந்தை அப்பாஸ் அவர்கள் (சிறுவராயிருந்த) நபி (ஸல்) அவர்களிடம், “என் சகோதரரின் மகனே! நீங்கள் உங்கள் கீழங்கியை அவிழ்த்துத் தோள்மீது (வைத்துள்ள) கல்லுக்குக் கீழே வைத்து (கற்களைச் சுமந்து)கொண்டு வரலாமே!” என்று கூறினார்கள். அவ்வாறே நபி (ஸல்) அவர்களும் தமது கீழங்கியை அவிழ்த்துத் தம் தோள்கள்மீது வைத்தார்கள். உடனே மூர்ச்சையடைந்து கீழே விழுந்துவிட்டார்கள். அதற்குப்பின் நபி (ஸல்) அவர்கள் (ஒருபோதும்) பிறந்த மேனியுடன் காணப்பட்டதில்லை. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 365,
			"arabicnumber": 365,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களை நோக்கி எழுந்து, ஓரே ஆடையை அணிந்துகொண்டு தொழுவது பற்றிக் கேட்டார். அப்போது நபி (ஸல்) அவர்கள், “உங்களில் ஒவ்வொருவரும் இரு ஆடைகள் வைத்துள்ளனரா?” என்று கேட்டார்கள். பின்னர் ஒரு மனிதர் உமர் (ரலி) அவர்களிடம் (அவர்களது ஆட்சிக் காலத்தில் இது பற்றிக்) கேட்டார். அதற்கு உமர் (ரலி) அவர்கள், “அல்லாஹ் உங்களுக்கு (ஆடைகளைத்) தாராளமாக வழங்கியிருந்தால் நீங்களும் தாராளமாக அணிந்துகொள்ளுங்கள். (அதாவது:) - ஒருவர் தம் ஆடை (வகை)கள் அனைத்தையும் அணிந்து தொழலாம்; - மற்றொருவர் கீழங்கியும் மேல் துண்டும் அணிந்து தொழலாம்; - மற்றொருவர் கீழங்கியும் (முழுநீளச்) சட்டையும் அணிந்து தொழலாம்; - மற்றொருவர் கீழங்கியும் வெளிப்புற மேலங்கியும் அணிந்து தொழலாம்; - மற்றொருவர் முழுக்கால் சட்டையும் மேல்துண்டும் அணிந்து தொழலாம்; - மற்றொருவர் முழுக்கால் சட்டையும் (முழுநீளச்) சட்டையும் அணிந்து தொழலாம்; - மற்றொருவர் முழுக்கால் சட்டையும் வெளிப்புற மேலங்கியும் அணிந்து தொழலாம்; - மற்றொருவர் அரைக்கால் சட்டையும் வெளிப்புற மேலங்கியும் அணிந்து தொழலாம்; - மற்றொருவர் அரைக்கால் சட்டையும் (முழு நீளச்) சட்டையும் அணிந்து தொழலாம்; (இறுதியாக) உமர் (ரலி) அவர்கள் “அரைக்கால் சட்டையும் (விசாலமான) மேல்துண்டும் அணிந்து தொழலாம்” என்று கூறியதாக நான் எண்ணுகிறேன்.12 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 366,
			"arabicnumber": 366,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: ஒருவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், “இஹ்ராம் கட்டியவர் எந்த ஆடையை அணிய வேண்டும்?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “இஹ்ராம் கட்டியவர் (முழு நீளச்) சட்டை அணியமாட்டார்; முழுக்கால் சட்டை அணியமாட்டார்; முக்காடுள்ள மேலங்கி அணியமாட்டார்; குங்குமப் பூச் சாயம் மற்றும் ‘வர்ஸ்’ எனும் வாசனைச் செடியின் சாயம் தோய்க்கப்பட்ட ஆடைகளையும் அணியமாட்டார். (காலுறைகள் அணியமாட்டார்.) காலணிகள் கிடைக்காதவர், காலுறைகள் அணியட்டும்; காலுறைகளைக் கணுக்கால்களுக்கு கீழே இருக்கும்படி கத்தரித்து (அணிந்து)கொள்ளட்டும்” என்று சொன்னார்கள்.13 இதை சாலிம் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இதே ஹதீஸ் இப்னு உமர் (ரலி) அவர் களிடமிருந்து நாஃபிஉ (ரஹ்) அவர்கள் வழியாகவும் அறிவிக்கப்பட்டுள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 367,
			"arabicnumber": 367,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: ஒரே துணியை உடலில் சுற்றிக் கொண்டு, அதன் ஒரு மூலையை ஒரு தோளில் போட்டுக்கொண்டு, மற்றொரு தோளைத் திறந்த நிலையில் விட்டுவிடு வதற்கும் (இஷ்திமாலுஸ் ஸம்மாஉ), மர்ம உறுப்பை மறைக்காமல் ஒரே துணியால் (முதுகையும் முழங்கால்களையும்) போர்த்திக்கொண்டு (குத்துக்காலிட்டு) அமர்வதற்கும் (இஹ்திபா) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தடை விதித்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 368,
			"arabicnumber": 368,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், ‘-மாஸ்’ (முலாமஸா), ‘நபாத்’ (முனாபஃதா) எனும் இரு வியாபார முறைகளுக்குத் தடை விதித்தார்கள். மேலும், ஒரே துணியை உடலில் சுற்றிக்கொண்டு அதன் ஒரு மூலையை ஒரு தோளில் போட்டுக்கொண்டு மற்றொரு தோளைத் திறந்த நிலையில் விட்டுவிடுவதற்கும் (இஷ்திமாலுஸ் ஸம்மாஉ), ஒருவர் ஒரே துணியால் (தம் முதுகையும் முழங்கால்களையும்) போர்த்திக்கொண்டு அமர்ந்திருப்பதற்கும் (இஹ்திபா) தடை விதித்தார்கள்.14 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 369,
			"arabicnumber": 369,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அபூபக்ர் (ரலி) அவர்கள் (தமது தலைமையில் ‘ஹஜ்ஜத்துல் வதா’விற்கு முந்தைய ஆண்டு நடந்த) அந்த ஹஜ்ஜின்போது, “இந்த ஆண்டுக்குப் பிறகு இணைவைப்பவர் எவரும் ஹஜ் செய்ய (வர)க்கூடாது; நிர்வாணமானவர் எவரும் இறையில்லம் கஅபாவைச் சுற்றி (தவாஃப்) வரக் கூடாது” என்று ‘மினா’வில் பொது அறிவிப்புச் செய்யும்படி சிலரை அனுப்பி வைத்தார்கள். அவர்களுடன் என்னையும் அனுப்பினார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவ ரான) ஹுமைத் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறுகிறார்கள்: பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அபூபக்ர் (ரலி) அவர்களுக் குப்) பின்னால் அலீ (ரலி) அவர்களை அனுப்பி, (இணைவைப்பாளர்களிட மிருந்து அல்லாஹ்வும் அவனுடைய தூதரும்) விலகிக்கொண்டது குறித்துப் பிரகடனம் செய்யும்படி அலீ (ரலி) அவர்களுக்குக் கட்டளையிட்டார்கள். அவ்வாறே எங்களுடன் அலீ (ரலி) அவர்களும் நஹ்ருடைய (துல்ஹஜ் 10ஆம்) நாளில் மினாவாசிகளிடையே, “(இணைவைப்போரிடமிருந்து அல்லாஹ்வும் அவனுடைய தூதரும் விலகிக்கொண்டது குறித்தும்,) இந்த ஆண்டுக்குப் பிறகு இணைவைப்பாளர் எவரும் ஹஜ் செய்யமாட்டார் என்றும், இறையில்லம் கஅபாவை நிர்வாணமானவர் எவரும் சுற்றி (தவாஃப்) வரக் கூடாது என்றும் அறிவிப்புச் செய்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 370,
			"arabicnumber": 370,
			"text": "முஹம்மத் பின் அல்முன்கதிர் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடம் சென்றேன். அப்போது அவர்கள் ஒரே ஆடையைச் சுற்றியபடி தொழுதுகொண்டிருந்தார்கள். அப்போது அவர்களது மேல்துண்டு (தனியாக) வைக்கப்பட்டிருந்தது. தொழுது முடித்ததும் அவர்களிடம் “அபூஅப்தில்லாஹ்! உங்களது மேல் துண்டை (தனியாக) வைத்துவிட்டு (ஒரே ஆடையில்) தொழுகின்றீர்களே?” என்று நாங்கள் கேட்டோம். அதற்கு அவர்கள், “ஆம்; உங்களைப் போன்ற விவரம் புரியாதவர்கள் என்னைப் பார்க்க வேண்டு மென்றே நான் விரும்பினேன். நபி (ஸல்) அவர்கள் இவ்வாறு தொழுவதை நான் கண்டிருக்கிறேன்” என்று பதிலளித்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 371,
			"arabicnumber": 371,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கைபர்மீது போர் தொடுத்தார்கள். (அந்தப் போரின்போது) கைபருக்கு அருகில் (அதன் புறநகரில்) நாங்கள் (இரவின் இறுதிப் பகுதி) இருட்டிலேயே வைகறைத் தொழுகையைத் தொழுதோம். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தமது வாகனத்தில் ஏறி) பயணமானார்கள். அபூதல்ஹா (ரலி) அவர்களும் (தமது வாகனத்தில் ஏறி) பயணமானார்கள். நான் அபூதல்ஹா (ரலி) அவர்களுக்குப் பின்னால் அமர்ந்துகொண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கைபர் சாலையில் (தமது வாகனத்தைச்) செலுத்தினார்கள். அப்போது எனது முழங்கால் (அருகில் சென்றுகொண்டிருந்த) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தொடையில் உராய்ந்துகொண்டிருந்தது. பின்னர் அவர்கள் தமது தொடையி-ருந்த கீழங்கியை விலக்கினார்கள். எந்த அளவுக்கென்றால், நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது தொடையின் வெண்மையைப் பார்த்தேன். (பிறகு) அந்த நகருக்குள் அவர்கள் பிரவேசித்தபோது, “அல்லாஹ் மிகப் பெரியவன்” கைபர் பாழா(வது உறுதியா)கி விட்டது. நாம் ஒரு சமுதாயத்தின் களத்தில் (அவர்களுடன் போரிட) இறங்குவோ மாயின், எச்சரிக்கப்பட்ட அவர்களுக்கு அது மிகக் கெட்ட காலையாக அமையும்” என்று மூன்று முறை கூறினார்கள். அந்த ஊர் மக்கள் தங்களுடைய அலுவல்களுக்காகப் புறப்பட்டு வந்தபோது (எங்களைக் கண்டதும்), “முஹம்மத் (வந்துவிட்டார்)” என்று கூறினர். -(இதன் அறிவிப்பாளர்களில் ஒருவ ரான) அப்துல் அஸீஸ் பின் ஸுஹைப் (ரஹ்) அவர்கள் கூறுகிறார்கள்: எம்முடைய நண்பர்களில் சிலர், “(முஹம்மதும் அவருடைய ஐந்து அணிகள் கொண்ட) படையும் (வருகின்றனர்)” என்று அம்மக்கள் கூறியதாக அறிவித்தனர்.- பிறகு (கைபர்வாசிகளை ஒடுக்கி) அதை நாங்கள் எங்கள் கட்டுப்பாட்டின் கீழ் கொண்டுவந்தோம். போர்க் கைதிகள் திரட்டப்பட்டபோது திஹ்யா அல்கல்பீ (ரலி) அவர்கள் வந்து, “அல்லாஹ்வின் தூதரே! கைதிகளில் ஓர் அடிமைப் பெண்ணை எனக்குத் தாருங்கள்” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “நீங்கள் சென்று ஓர் அடிமைப் பெண்ணைப் பெற்றுக்கொள்ளுங்கள்” என்று சொன்னார்கள். அவ்வாறே திஹ்யா (ரலி) அவர்கள் சென்று ஸஃபிய்யா பின்த் ஹுயை எனும் பெண்மணியைப் பெற்றுக்கொண்டார்கள். இந்நிலையில் ஒருவர் நபி (ஸல்) அவர்களிடம் வந்து, “அல்லாஹ்வின் தூதரே! குறைழா, நளீர் குலத்தாரின் தலைவியான ஸஃபிய்யா பின்த் ஹுயை அவர்களை திஹ்யா அவர்களுக்கு வழங்கிவிட்டீர் களே! ஸஃபிய்யா, உங்களுக்கல்லாமல் வேறெவருக்கும் தகுதியாகமாட்டார்” என்று கூறினார். நபி (ஸல்) அவர்கள், “திஹ்யா வையும் அப்பெண்ணையும் அழைத்து வாருங்கள்” என்றார்கள். ஸஃபிய்யா அவர்களுடன் திஹ்யா (ரலி) அவர்கள் வந்தார்கள். ஸஃபிய்யா அவர்களைக் கண்ட நபி (ஸல்) அவர்கள் (திஹ்யா (ரலி) அவர்களிடம்), “கைதிகளில் இவரல்லாத மற்றோர் அடிமைப் பெண்ணை நீங்கள் பெற்றுக்கொள்ளுங் கள்” என்று சொன்னார்கள். பின்னர் ஸஃபிய்யாவை நபி (ஸல்) அவர்கள் விடுதலை செய்து மணந்துகொண்டார்கள். (இந்த ஹதீஸை அறிவிக்கிற) அனஸ் (ரலி) அவர்களிடம் ஸாபித் (அல்புனானீ -ரஹ்) அவர்கள், “அபூஹம்ஸா! நபி (ஸல்) அவர்கள் ஸஃபிய்யா (ரலி) அவர்களுக்கு மணக்கொடையாக (மஹ்ர்) எனன கொடுத்தார்கள்?” என்று கேட்டார்கள். அதற்கு அனஸ் (ரலி) அவர்கள், “அவரையே மணக்கொடையாக ஆக்கினார்கள்; (அதாவது) அவரை விடுதலை செய்வதையே மணக்கொடையாக ஆக்கி அவரை மணந்துகொண்டார்கள்” என்று பதிலளித்தார்கள். நாங்கள் (கைபரி-ருந்து திரும்பி வரும்) வழியில் (‘சத்துஸ் ஸஹ்பா’ எனுமிடத்தில்) இருந்தபோது, (புது மணப்பெண்) ஸஃபிய்யா (ரலி) அவர்களை (என் தாயார்) உம்மு சுலைம் (ரலி) அவர்கள் நபி (ஸல்) அவர்களுக்காக (அலங்கார) ஆயத்தம் செய்து இரவு நேரத்தில் அவர்களிடம் ஒப்படைத்தார்கள். புது மாப்பிள்ளையாக காலையில் எழுந்த நபி (ஸல்) அவர்கள், “எவரிடமேனும் ஏதேனும் (உணவுப்) பொருள் இருப்பின், அதை (எம்மிடம்) கொண்டுவாருங்கள்” என்று கூறி, தோல் விரிப்பொன்றை விரித்தார்கள். அப்போது (அங்கிருந்த நபித்தோழர்களில்) ஒருவர் பேரீச்சம் பழத்தைக் கொண்டுவரலானார். மற்றொருவர் நெய்யைக் கொண்டுவரலானார். -(இதன் அறிவிப்பாளர்களில் ஒருவரான) அப்துல் அஸீஸ் பின் ஸுஹைப் (ரஹ்) அவர்கள் கூறுகிறார்கள்: அனஸ் (ரலி) அவர்கள், “(மற்றொருவர்) மாவு (கொண்டுவரலானார்”) என்று குறிப்பிட்டதாகவே நான் கருதுகிறேன்.- அவற்றையெல்லாம் ஒன்றாகக் கலந்து ‘ஹைஸ்’ எனும் (ம-தா போன்ற) ஒருவகை பலகாரத்தைத் தயார் செய்தனர். அதுவே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் மணவிருந்தாக (வலீமா) அமைந்தது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 372,
			"arabicnumber": 372,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அதிகாலை) ஃபஜ்ர் தொழுகையைத் தொழுவார்கள். அப்போது இறை நம்பிக்கை கொண்ட பெண்களும் தங்களின் மேலாடைகளால் தங்கள் உடல் முழுவதையும் சுற்றி மறைத்தவர்களாக நபி (ஸல்) அவர்களுடன் (தொழுகையில்) கலந்துகொள்வார்கள். பின்னர் தங்களின் வீடுகளுக்கு அப்பெண்கள் திரும்பிச் செல்வார்கள். அவர்களை (யார் யார் என்று) எவரும் அறியமாட்டார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 373,
			"arabicnumber": 373,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் வேலைப்பாடு மிக்க (சதுரமான) கறுப்புக் கம்பளி ஆடை ஒன்றை அணிந்துகொண்டு தொழுதார் கள். (தொழுது கொண்டிருக்கும்போது) அதன் வேலைப்பாடுகளை ஒரு முறை கூர்ந்து கவனித்தார்கள். தொழுது முடித்ததும், “எனது இந்தக் கறுப்புக் கம்பளி ஆடையை, (இதை எனக்கு அன்பளித்த) அபூஜஹ்மிடம் கொடுத்துவிட்டு, அபூஜஹ்மிடம் இருக்கும் (வேலைப்பாடுகளற்ற) ‘அன்பிஜான்’ (நகர எளிய) ஆடையை (வாங்கி) என்னிடம் கொண்டுவாருங்கள். இந்த ஆடை சற்று முன்னர் எனது தொழுகையிலிருந்து என் கவனத்தைத் திருப்பிவிட்டது” என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், “நான் தொழுதுகொண்டிருக்கும்போதே அதன் வேலைப்பாடுகளைக் கூர்ந்து கவனித்துக்கொண்டு இருந்தேன். அது என்னைக் குழப்பிவிடுமோ என நான் அஞ்சினேன்” என்று நபி (ஸல்) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது.17 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 374,
			"arabicnumber": 374,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்களிடம் உருவச் சித்திரங்கள் பொறித்த பல வண்ண திரைச் சீலை ஒன்று இருந்தது. அதைக் கொண்டு வீட்டின் ஒரு பகுதி(யிலிருந்த அல மாரி)யை அவர்கள் மறைத்திருந்தார்கள். (அதை நோக்கித் தொழுத) நபி (ஸல்) அவர்கள், “உன்னுடைய இந்தத் திரைச் சீலையை நம்மிடமிருந்து அகற்றிவிடு! ஏனெனில், இதிலுள்ள உருவப்படங்கள் என் தொழுகையில் குறுக்கிட்டுக் கொண்டே இருக்கின்றன” என்று சொன்னார்கள்.18 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 375,
			"arabicnumber": 375,
			"text": "உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: (ஆண்கள் பட்டு அணிவது தடை செய்யப்படுவதற்கு முன்பு) நபி (ஸல்) அவர்களுக்கு (‘ஃபர்ரூஜ்’ எனும்) பட்டு நீளங்கி ஒன்று அன்பளிப்பாக வழங்கப் பட்டது. அதை அவர்கள் அணிந்துகொண்டார்கள். பிறகு அதை அணிந்தபடியே (மஃக்ரிப் தொழுகை) தொழுதார்கள். பிறகு (தொழுதுவிட்டுத்) திரும்பியதும், அதை வெறுப்பவர்கள் போன்று கடுமையாக (உருவிக்) கழற்றினார்கள். பிறகு, “இது இறையச்சமுடையவர்களுக்கு உகந்ததன்று” எனக் கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 376,
			"arabicnumber": 376,
			"text": "அபூஜுஹைஃபா (வஹ்ப் பின் அப்தில்லாஹ் அஸ்ஸுவாயீ-ர-) அவர்கள் கூறியதாவது: (ஹஜ்ஜின்போது ‘அப்தஹ்’ எனுமிடத் தில்) தோ-னாலான சிவப்பு நிற கூடார மொன்றில் (தங்கியிருந்த) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை நான் பார்த்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அங்கத் தூய்மை (‘உளூ’) செய்துவிட்டு மீதிவைத்த தண்ணீரை பிலால் (ரலி) அவர்கள் எடுத்துவருவதைக் கண்டேன். மேலும், அந்த எஞ்சிய தண்ணீருக்காக மக்கள் போட்டியிட்டுக்கொள்வதையும் நான் பார்த்தேன். அந்தத் தண்ணீரில் சிறிதளவைப் பெற்றவர், அதை(த் தமது மேனியில்) தடவிக்கொண்டார். அந்தத் தண்ணீரில் சிறிதளவும் கிடைக்கப்பெறாதவர், அடுத்தவரின் கையில் இருந்த ஈரத்தைத் தொட்டுக்கொண்டார். பிறகு பிலால் (ரலி) அவர்கள் ஒரு (இரும்புப் பூண் போட்ட) கைத்தடி ஒன்றை எடுத்து வந்து அதை ஊன்றுவதை நான் கண்டேன். நபி (ஸல்) அவர்கள் ஒரு சிவப்பு நிற மேலங்கியை (தமது கணைக்கால்கள் தெரியுமளவுக்கு) உயர்த்திப் பிடித்தபடி வெளியில் வந்து (தடுப்பாக வைக்கப்பட்டிருந்த) அந்தக் கைத்தடியை நோக்கி மக்களுடன் இரண்டு ரக்அத்கள் தொழுதார்கள். அந்தக் கைத்தடிக்கு அப்பால் மனிதர்களும் கால்நடைகளும் கடந்து செல்வதை நான் பார்த்தேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 377,
			"arabicnumber": 377,
			"text": "அபூஹாஸிம் (சலமா பின் தீனார்- ரஹ்) அவர்கள் கூறியதாவது: (மக்களில் சிலர்) சஹ்ல் பின் சஅத் (ரலி) அவர்களிடம், “(நபி (ஸல்) அவர்கள் பயன்படுத்திய) அந்தச் சொற்பொழிவு மேடை (மிம்பர்) எதனால் செய்யப்பட்டது?” என்று வினவினர். அதற்கு சஹ்ல் (ரலி) அவர்கள் கூறினார்கள்: மக்களில் என்னைவிட (இது பற்றி) நன்கு தெரிந்தவர்கள் யாரும் (இப்போது) எஞ்சியிருக்கவில்லை. அது ஒரு வகை சவுக்கு மரத்தால் செய்யப்பட்டதாகும்; அதை இன்ன பெண்மணியின் அடிமையான இன்னாரே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காகச் செய்(து கொடுத்)தார். அது செய்யப்பட்டு (உரிய இடத்தில்) வைக்கப்பட்டபோது அதன்மீது அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் (ஏறி) நின்று கிப்லாவை முன்னோக்கி (தொழுகைக்காக) தக்பீர் (தஹ்ரீமா) சொன்னார்கள். மக்களும் அவர்களுக்குப் பின்னால் (தொழுகையில்) நின்றார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (குர்ஆன் வசனங் களை) ஓதிவிட்டு, ‘ருகூஉ’ செய்தார்கள். மக்களும் அவர்களுக்குப் பின்னால் ருகூஉ செய்தனர். பிறகு நபி (ஸல்) அவர்கள் தலையை உயர்த்தி (நிமிர்ந்து நின்றுவிட்டு)ப் பிறகு (முதுகைத் திருப்பாமல்) பின்வாக்கில் நகர்ந்து தரையில் (இறங்கி) சஜ்தா செய்தார்கள். பிறகு திரும்பவும் மேடைக் குத் திரும்பினார்கள். பிறகு (இரண்டாவது ரக்அத்தில் குர்ஆன் வசனங்களை) ஓதினார்கள். பிறகு ருகூஉ செய்தார்கள். அதன் பின்னர் தலையை உயர்த்தி (நிமிர்ந்து நின்று விட்டு)ப் பிறகு (முதுகைத் திருப்பாமல்) பின்வாக்கில் நகர்ந்து வந்து தரையின்மீது சஜ்தா (சிரவணக்கம்) செய்தார்கள். இதுதான் நடந்த நிகழ்ச்சியாகும். அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன். அலீ பின் அப்தில்லாஹ் அல்மதீனீ (ரஹ்) அவர்கள் கூறினார்கள்: என்னிடம் அஹ்மத் பின் ஹம்பல் (ரஹ்) அவர்கள் இந்த ஹதீஸ் பற்றிக் கூறுகையில், “(தொழுகையில்) நபி (ஸல்) அவர்கள், (பின்பற்றித் தொழுத) மக்களை விட உயரமான இடத்தில் (நின்றுகொண்டு) இருந்தார்கள் என்று கூறும் இந்த ஹதீஸிலிருந்து ‘மக்களைவிட உயரமான இடத்தில் இமாம் இருப்பதில் தவறில்லை’ என்றே நான் கருதுகிறேன்” என்றார்கள். அப்போது நான், “(இது சம்பந்தமாக) சுஃப்யான் பின் உயைனா (ரஹ்) அவர்களிடம் அதிகமாகக் கேட்கப்படுகிறதாமே! அவரிடமிருந்து இந்த ஹதீஸை நீங்கள் செவியுறவில்லையா?” என்று கேட்டேன். அதற்கு அஹ்மத் பின் ஹம்பல் (ரஹ்) அவர்கள், “இல்லை (நான் அவரிடமிருந்து இந்த ஹதீஸைச் செவியுறவில்லை)” என்று பதிலளித்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 378,
			"arabicnumber": 378,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பயணம் செய்துகொண் டிருந்தபோது) தமது குதிரையி-ருந்து கீழே விழுந்துவிட்டார்கள். இதனால் அவர்களது ‘கணைக்கால்’ அல்லது ‘தோள்பட்டை’யில் சிராய்ப்பு ஏற்பட்டு விட்டது. மேலும், (இந்தக் காலகட்டத்தில்) நபி (ஸல்) அவர்கள் ‘தம் துணைவியரை ஒரு மாத காலத்திற்கு நெருங்கமாட்டேன்’ என்று சத்தியமும் செய்திருந்தார்கள். அப்போது அவர்கள் தமக்குரிய மாடி அறையொன்றில் ஏறி அமர்ந்தார்கள். அதன் படிகள் பேரீச்சங்கட்டையால் ஆனவை. ஆகவே, அவர்களுடைய தோழர்கள் அவர்களிடம் உடல்நலம் விசாரிக்க வந்தார்கள். அப்போது அவர்களுக்கு அமர்ந்தவாறே தொழுவித்தார்கள்; தோழர் கள் நின்றவாறு தொழுதார்கள். நபி (ஸல்) அவர்கள் சலாம் கொடுத்(து தொழுகையை முடித்)தபோது, “பின்பற்றப்படுவதற்காகவே இமாம் ஏற்படுத்தப்பட்டுள்ளார். எனவே, அவர் தக்பீர் சொன்னால் நீங்களும் தக்பீர் சொல்லுங்கள்; அவர் ருகூஉ செய்தால் ருகூஉ செய்யுங்கள்; அவர் சஜ்தா செய்தால் நீங்களும் சஜ்தா செய்யுங்கள்; அவர் நின்றவராகத் தொழுதால் நீங்களும் நின்றவாறு தொழுங்கள்” என்று சொன்னார்கள்.19 (அந்த அறையி-ருந்து) அவர்கள் இருபத்தொன்பதாம் நாள் இறங்கிவந்தார்கள். அப்போது மக்கள், “ஒரு மாத காலம் தங்கள் துணைவியரை நெருங்கமாட்டேன் எனத் தாங்கள் சத்தியம் செய்திருந்தீர்களே, அல்லாஹ்வின் தூதரே?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “இந்த மாதத்திற்கு இருபத்தொன்பது நாட்கள்தான்” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 379,
			"arabicnumber": 379,
			"text": "மைமூனா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுதுகொண்டிருக்கும்போது அவர்களுக்கு எதிரில் நான் (படுத்துக்கொண்டு) இருப்பேன். அப்போது எனக்கு மாத விடாய் ஏற்பட்டிருக்கும். அவர்கள் சிரவணக்கம் (சஜ்தா) செய்யும்போது சில நேரங்களில் அவர்களது ஆடை என்மீது படும். நபி (ஸல்) அவர்கள் (பேரீச்சங் கீற்றினால் வேயப்பட்ட) தொழுகை விரிப்பில் தொழுவார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 380,
			"arabicnumber": 380,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: என் (தாய்வழிப்) பாட்டி முளைக்கா (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காக உணவு சமைத்து (விருந்துண்ண) அவர்களை அழைத்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வந்து) அதில் சிறிதளவு சாப்பிட்டுவிட்டுப் பின்னர், “எழுங்கள். உங்களுக்காக நான் (கூடுதலான தொழுகையைத்) தொழுவிக் கிறேன்” என்று கூறினார்கள். (தொழுவதற் காக) எங்களுக்குரிய பாயொன்றை (எடுப்பதற்காக அதை) நோக்கி நான் எழுந்தேன்; அதுவோ நீண்ட நாட்கள் பயன்படுத்தப்பட்டதால் கறுப்பேறி இருந் தது. ஆகவே, அதில் நான் தண்ணீரைத் தெளித்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அந்தப் பாயின் மீது தொழு கைக்காக) நின்றார்கள். உடனே நானும் ஓர் அநாதைச் சிறுவரும் அவர்களுக்குப் பின்னால் அணிவகுத்து நின்றோம். அந்த மூதாட்டி எங்களுக்குப் பின்னால் (தனியாக) நின்றுகொண்டார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இமாமாக நின்று கூடுதலான) இரண்டு ரக்அத்கள் எங்களுக்குத் தொழவைத்து விட்டு, (தமது இல்லம் நோக்கித்) திரும்பிச் சென்றார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 381,
			"arabicnumber": 381,
			"text": "மைமூனா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (பேரீச்சங் கீற்றினால் வேயப்பட்ட) தொழுகை விரிப்பின் மீது தொழுதுவந்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 382,
			"arabicnumber": 382,
			"text": "நபி (ஸல்) அவர்களின் துணைவி யார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் (இரவில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு முன்புறமாக (விரிப் பில் படுத்து) உறங்கிக்கொண்டிருப்பேன். அப்போது என் கால்கள் அவர்களது கிப்லாவில் (அவர்கள் ‘சஜ்தா’ செய்யுமிடத் தில்) இருந்துகொண்டிருக்கும். அவர்கள் ‘சஜ்தா’வுக்கு வரும்போது என்னை (தமது விரலால்) தொட்டுணர்த்துவார்கள். உடனே நான் என் கால்களை மடக்கிக் கொள்வேன். அவர்கள் எழுந்துவிட்டால் (மறுபடியும்) நான் கால்களை நீட்டிக் கொள்வேன். அந்த நாட்களில் (எங்கள்) வீடுகளில் விளக்குகள் இருக்கவில்லை. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 383,
			"arabicnumber": 383,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நான் படுத்திருக்கும்) எனது படுக்கை விரிப்பில் தொழுவார்கள். அப்போது அவர்களுக்கும் கிப்லாவுக்கும் இடையே ‘ஜனாஸா’வைப் போன்று குறுக்கே நான் படுத்திருப்பேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 384,
			"arabicnumber": 384,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், தாமும் (தம் துணைவியாரும் என் சிற்றன்னையுமான) ஆயிஷா (ரலி) அவர்களும் உறங்கும் படுக்கை விரிப்பில் (இரவில்) தொழுவார்கள். அப்போது ஆயிஷா (ரலி) அவர்கள் நபி (ஸல்) அவர்களுக்கும் (அவர்கள் சஜ்தா செய்யும்) ‘கிப்லா’ திசைக்கும் இடையே குறுக்கே படுத்திருப்பார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 385,
			"arabicnumber": 385,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுடன் (பகல் நேரத்தில்) தொழும்போது, எங்களில் சிலர் கடுமையான வெப்பம் காரணமாக ஆடையின் ஒரு பகுதியைச் சிரவணக்கம் (சஜ்தா) செய்யுமிடத்தில் வைத்துக்கொள் வார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 386,
			"arabicnumber": 386,
			"text": "சயீத் பின் யஸீத் அல்அஸ்தீ (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் பின் மா-க் (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்கள் தம் காலணி களுடன் தொழுவார்களா?” என்று கேட்டேன். அதற்கு அவர்கள், “ஆம்” என்று பதிலளித்தார்கள்.21 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 387,
			"arabicnumber": 387,
			"text": "ஹம்மாம் பின் அல்ஹாரிஸ் (ரஹ்) அவர்கள் கூறியதாவது: ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் சிறுநீர் கழித்துவிட்டுப் பின்னர் அங்கத் தூய்மை (உளூ) செய்தார்கள்; (கால்களைக் கழுவுவதற்குப் பதிலாக ஈரக் கையால் தடவி) தம் காலுறைகள்மீது ‘மஸ்ஹு’ செய்தார்கள். பிறகு அவர்கள் (காலுறைகளுடனேயே) எழுந்து தொழு வதை நான் கண்டேன். அவர்களிடம் இது பற்றிக் கேட்கப்பட் டது. அதற்கு அவர்கள், “நபி (ஸல்) அவர்கள் இவ்வாறு செய்வதை நான் பார்த்திருக் கிறேன்” என்று பதிலளித்தார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவ ரான) இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்கள் கூறுகிறார்கள்: (“காலுறைகளின் மீது ‘மஸ்ஹு’ செய்து தொழலாம்” என்ற கருத்துடைய அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களின் மாணவர்கள் உள்ளிட்ட) மக்களுக்கு, (ஜரீர் (ரலி) அவர்களின்) இந்த ஹதீஸ் மகிழ்ச்சியளிப்பதாய் அமைந்தது. ஏனெனில், ஜரீர் (ரலி) அவர்கள் (நபி (ஸல்) அவர்களின் காலத்தில்) கடைசியாக இஸ்லாத்தைத் தழுவியவர் ஆவார். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 388,
			"arabicnumber": 388,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நான் நபி (ஸல்) அவர்கள் அங்கத் தூய்மை (உளூ) செய்வதற்காகத் தண்ணீர் ஊற்றினேன். (அவர்கள் உளூவின் இறுதியில், கால்களைக் கழுவாமல்) தம் காலுறைகள்மீது (ஈரக் கையால்) தடவி (மஸ்ஹு செய்து)விட்டு (காலுறைகளுட னேயே) தொழுதார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 389,
			"arabicnumber": 389,
			"text": "அபூவாயில் (ஷகீக் பின் சலமா- ரஹ்) அவர்கள் கூறியதாவது: தமது (தொழுகையில்) ருகூஉவையும் சஜ்தாவையும் முழுமையாகச் செய்யாத ஒருவரைக் கண்ட ஹுதைஃபா (பின் அல்யமான் -ர-) அவர்கள், அவர் தொழுது முடித்தபோது, “நீர் (உரிய முறையில்) தொழவில்லை” என்று கூறி னார்கள். மேலும் அவர்கள், “(இதே நிலையில்) நீர் இறந்துவிட்டால், முஹம்மத் (ஸல்) அவர்களின் வழிமுறைக்கு மாற்றம் செய்தவராகவே இறப்பீர்” என்று சொன்ன தாகவும் நான் எண்ணுகிறேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 390,
			"arabicnumber": 390,
			"text": "அப்துல்லாஹ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தொழும்போது (சிரவணக்கத்தில்) அவர்களின் இரு அக்குள்களின் வெண்மை தென்படும் அளவுக்கு இரு கை (புஜங்)களையும் விரி(த்து வை)ப்பார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 391,
			"arabicnumber": 391,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் நாம் தொழுவதைப் போன்று தொழுது, நமது (தொழும் திசையான) கிப்லாவை முன்னோக்கி, நம்மால் (அல்லாஹ்வின் பெயர் கூறி) அறுக்கப் பட்டதைப் புசிக்கின்றாரோ அவர்தான் முஸ்-ம். அத்தகையவருக்கு அல்லாஹ் வின் பொறுப்பும் (காப்புறுதியும்) அவனு டைய தூதரின் பொறுப்பும் (காப்புறுதியும்) உண்டு. எனவே, (இப்படிப்பட்டவர்மீது) அல்லாஹ் ஏற்றுக்கெண்டிருக்கும் பொறுப் பி(னைப் பாழாக்கும் விஷயத்தி)ல் அல்லாஹ்வுக்கு(ம் அவனுடைய தூதருக் கும்) வஞ்சனை செய்துவிடாதீர்கள். இதை அனஸ் பின் மா-க் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 392,
			"arabicnumber": 392,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை என இம்மக்கள் (உறுதி) கூறும் வரை அவர்களுடன் போரிட வேண்டுமென நான் பணிக்கப்பட்டுள்ளேன். எனவே, இதை அவர்கள் கூறி, நாம் தொழுவதைப் போன்று தொழுது, நமது (தொழும் திசையான) கிப்லாவை முன்னோக்கி, நம்மால் அறுக்கப்பட்டதை அவர்கள் புசிப்பார்களேயானால், தக்க காரணமின்றி அவர்களின் உயிர் மற்றும் உடைமைகள் (மீது கைவைப்பது) நம்மீது தடை செய்யப்பட்டதாகிவிடும்; மேலும், (இரகசியமாகக் குற்றமிழைத்தால்) அவர்களின் விசாரணை அல்லாஹ்வின் பொறுப்பில் உள்ளது. இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 393,
			"arabicnumber": 393,
			"text": "மைமூன் பின் சியாஹ் (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் பின் மா-க் (ரலி) அவர்களிடம், “அபூஹம்ஸா! ஓர் அடி யாரின் உயிரையும் பொருளையும் (அதன்மீது கைவைக்க விடாமல்) தடை செய்வது எது?” என்று கேட்டேன். அதற்கு அவர்கள், “யார் அல்லாஹ் வைத் தவிர வேறு இறைவனில்லை என உறுதி மொழிந்து, நமது (தொழும் திசையான) கிப்லாவை முன்னோக்கி நாம் தொழுவதைப் போன்றே தொழுது, நம்மால் அறுக்கப்பட்டதைப் புசிக்கின்றாரோ அவர் தான் முஸ்-ம். மற்ற முஸ்-ம்களுக்கு உள்ள உரிமையும் அவருக்கு உண்டு; மற்ற முஸ்-ம்களுக்கு உள்ள கடமையும் அவருக்கு உண்டு” என்று கூறினார்கள்.22 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 394,
			"arabicnumber": 394,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நீங்கள் மலம் கழிக்கச் சென்றால், கிப்லா (கஅபா) திசையை முன்னோக்கவும் வேண்டாம்; (அதன் திசையில்) முதுகைக் காட்டி அமரவும் வேண்டாம். மாறாக, கிழக்கு நோக்கியோ மேற்கு நோக்கியோ திரும்பிக்கொள்ளுங்கள். இதை அறிவித்த அபூஅய்யூப் அல்அன்சாரி (ரலி) அவர்கள், “நாங்கள் ஷாம் (சிரியா) நாட்டிற்குச் சென்றிருந்த போது, (அங்குள்ள) கழிப்பறைகள் கிப்லாவை முன்னோக்கி கட்டப்பட்டி ருப்பதைக் கண்டோம். ஆகவே, நாங்கள் (கிப்லாவின் திசையி-ருந்து) திரும்பிக் கொண்டோம்; (அவ்வாறு கட்டியவர்களுக் காக) அல்லாஹ்விடம் பாவமன்னிப்பும் கோரினோம்” என்று சொன்னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 396,
			"arabicnumber": 396,
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 397,
			"arabicnumber": 397,
			"text": "முஜாஹித் பின் ஜப்ர் (ரஹ்) அவர்கள் கூறியதாவது: (மக்கா வெற்றி நாளில்) இப்னு உமர் (ரலி) அவர்களிடம், “இதோ அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் கஅபாவிற் குள் நுழைந்துவிட்டார்கள்” என்று சொல்லப்பட்டது. (பிறகு நடந்ததை) இப்னு உமர் (ரலி) அவர்கள் கூறுகிறார்கள்: நபி (ஸல்) அவர்கள் (கஅபாவிற்குள் ளிருந்து) வெளியே வந்துகொண்டிருந்த போது நான் அங்கு சென்றேன். அப்போது பிலால் (ரலி) அவர்கள் கதவின் இரு நிலைக்கால்களுக்கிடையே நின்றுகொண்டி ருப்பதைக் கண்டேன். உடனே நான் பிலால் (ரலி) அவர்களிடம், “கஅபாவிற் குள் நபி (ஸல்) அவர்கள் தொழுதார்களா?” என்று கேட்டேன். அதற்கு அவர்கள், “ஆம்; நீங்கள் கஅபாவிற்குள் நுழையும்போது இடப் பக்கமிருக்கின்ற இரு தூண்களுக்கு மத்தியில் இரண்டு ரக்அத்கள் தொழுதார் கள்; பிறகு வெளியே வந்து கஅபாவின் கதவை முன்னோக்கியபடி இரண்டு ரக்அத்கள் தொழுதார்கள்” என்றார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 398,
			"arabicnumber": 398,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (மக்கா வெற்றி கொள்ளப்பட்ட நாளில்) நபி (ஸல்) அவர்கள் இறையில்லம் கஅபாவிற்குள் நுழைந்ததும் அதன் அனைத்துத் திசைகளிலும் பிரார்த்தனை புரிந்தார்கள். (கஅபாவிற்குள்) தொழாமலேயே அதி-ருந்து வெளியேறிவிட்டார்கள். வெளியே வந்ததும் கஅபாவிற்கு முன்னே (நின்று) இரண்டு ரக்அத்கள் தொழுதுவிட்டு, “இது தான் கிப்லா (தொழும் திசை)” என்று சொன்னார்கள்.26 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 399,
			"arabicnumber": 399,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மதீனாவுக்கு வந்து) ‘பதினாறு மாதங்கள்’ அல்லது ‘பதினேழு மாதங்கள்’ (ஜெருசல மிலுள்ள) பைத்துல் மக்திசை நோக்கித் தொழுதார்கள். (மக்காவிலுள்ள) கஅபாவை நோக்கித் தாம் திருப்பப்பட வேண்டு மென்றே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் விரும்பிக்கொண்டிருந்தார்கள். ஆகவே, (தொழுகையில் கஅபாவை முன்னோக்கும்படி ஆணையிட்டு) அல்லாஹ், “(நபியே!) உம்முடைய முகம் (அடிக்கடி) விண்ணை நோக்கித் திரும்புவதை நாம் காண்கிறோம்...” (2:144) என்று தொடங்கும் வசனத்தை அருளினான். உடனே நபி (ஸல்) அவர்கள் கஅபாவை முன்னோக்கி(த் தொழலா)னார்கள். (இதைக் கண்ட) அறிவற்ற மக்கள் -அதாவது யூதர்கள்- “(முஸ்-ம்களாகிய) அவர்கள் முன்னர் நோக்கியிருந்த கிப்லாவை விட்டுத் திருப்பிவிட்டது எது?” என்று கூறினர். (அதற்கு அல்லாஹ்,) “(நபியே!) கூறுக: கிழக்கும் மேற்கும் அல்லாஹ் வுக்கே உரியவை; தான் நாடியவரை அவன் நல்வழியில் நடத்திச்செல்வான்” (2:142) என்று சொன்னான். (கஅபாவை நோக்கி கிப்லா மாற்றம் நடைபெற்ற அந்தத் தொழுகையில்) நபி (ஸல்) அவர்களுடன் ஒரு மனிதர் தொழுதார். தொழுதுவிட்டு அவர் புறப் பட்டு(ச் செல்லும் வழியில்), பைத்துல் மக்திசை நோக்கி அஸ்ர் தொழுகையை நிறைவேற்றிக்கொண்டிருந்த அன்சாரி களில் சிலரைக் கடந்து சென்றார். அப்போது அவர் “நான் அல்லாஹ் வின் தூதர் (ஸல்) அவர்களுடன் தொழு தேன்; அவர்கள் கஅபாவை முன்னோக் கித் தொழுதார்கள் என்று நான் உறுதி கூறு கின்றேன்” என்றார். உடனே (தொழுகை யி-ருந்த) அம்மக்கள் கஅபாவின் திசையில் திரும்பிக்கொண்டார்கள் அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 400,
			"arabicnumber": 400,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வாகனத்தின் மீது (அமர்ந்து சைகை செய்தவாறு,) அது செல்கின்ற திசையை நோக்கி (கூடுதல் தொழுகைகளை) தொழுபவர்களாக இருந்தார்கள். கடமையான தொழுகையை அவர்கள் தொழ நாடும்போது (வாகனத்தி-ருந்து) இறங்கி, கிப்லாவை முன்னோக்கித் தொழுவார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 401,
			"arabicnumber": 401,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) நபி (ஸல்) அவர்கள் (லுஹ்ர் தொழுகையை வழக்கத்திற்கு மாறாகத்) தொழுதார்கள். -(இதன் அறிவிப்பாளர்களில் ஒருவ ரான) இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்கள் கூறுகிறார்கள்: நபியவர்கள் (அத்தொழுகை யின் ரக்அத்தை) கூடுதலாக்கினார்களா, அல்லது குறைத்துவிட்டார்களா என்று எனக்குத் தெரியவில்லை.- (தொழுகையை முடிக்க) அவர்கள் சலாம் கொடுத்தபோது அவர்களிடம், “அல்லாஹ்வின் தூதரே! இந்தத் தொழுகை யின்போது (தற்போதுள்ள தொழுகையின் ரக்அத்தை) மாற்றுகின்ற (இறை அறிவிப்பு) ஏதேனும் வந்ததா?” என்று கேட்கப்பட்டது. அதற்கு நபி (ஸல்) அவர்கள், “ஏன் இவ்வாறு (வினவுகிறீர்கள்?)” என்று கேட்டார்கள். அதற்கு மக்கள், “நீங்கள் இப்படி இப்படித் தொழுதீர்கள் (அதனால் தான் கேட்கிறோம்)” என்றனர். உடனே நபி (ஸல்) அவர்கள் (தொழுகையின் அமர்வில் இருப்பதைப் போன்று) தமது காலை மடக்கி, கிப்லாவை முன்னோக்கி இரு சிரவணக்கங்கள் (சஜ்தாக்கள்) செய்துவிட்டுப் பின்னர் (மீண்டும்) சலாம் கொடுத்தார்கள். இதன் பின்னர் எங்களை முன்னோக்கித் திரும்பியபோது, “ஒரு விஷயம்! தொழுகையில் (எனக்கு) ஏதேனும் மாற்றங்க(ளை அறிவிக்கும் இறை அறிவிப்பு)கள் வருமானால், கட்டாயம் அதை நான் உங்களுக்குத் தெரிவித்துவிடுவேன். ஆயினும், நானும் உங்களைப் போன்ற ஒரு மனிதன்தான்; (சில நேரங்களில்) நீங்கள் மறந்துவிடுவதைப் போன்று நானும் மறந்துவிடுகிறேன். அவ்வாறு நான் (எதையேனும்) மறந்துவிடும்போது எனக்கு (அதை) நினைவூட்டுங்கள்” என்று கூறிவிட்டு, “உங்களில் ஒருவர் தமது தொழுகையில் (எதையேனும் கூடுதலாகச் செய்ததாகவோ குறைத்துவிட்டதாகவோ) சந்தேகிக்கும்போது, சரியானதை அவர் தீர்மானிக்கட்டும். அத்தீர்மானத்தின் அடிப்படையில் (தொழுகையைப்) பூர்த்தி செய்து ‘சலாம்’ கொடுத்த பின்னர் (மறதிக்குரிய) இரண்டு சிரவணக்கங்கள் (சஜ்தாக்கள்) செய்யட்டும்” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 402,
			"arabicnumber": 402,
			"text": "உமர் (ரலி) அவர்கள் கூறியதாவது: மூன்று விஷயங்களில் நான் என் இறைவனுக்கு இசைவான கருத்து கொண்டேன்: 1. நான் (நபி (ஸல்) அவர்களிடம்), “அல்லாஹ்வின் தூதரே! இப்ராஹீம் (அலை) அவர்கள் நின்ற இடத்தைத் தொழுமிடமாக நாம் ஆக்கிக்கொள்ளலாமே!” என்று கேட்டேன். அப்போது, “இப்ராஹீம் நின்ற இடத்தைத் தொழும் இடமாக ஆக்கிக் கொள்ளுங்கள்” (2:125) எனும் இறை வசனம் அருளப்பெற்றது.29 2. பர்தா குறித்த இறைவசனமும் (என் கருத்துக்கு இசைவாகவே அருளப் பெற்றது.) : நான் (நபி (ஸல்) அவர்களிடம்), “அல்லாஹ்வின் தூதரே! தங்கள் துணைவி யரை பர்தா அணியும்படி தாங்கள் கட்டளையிடலாமே! ஏனெனில், அவர் களுடன் நல்லவரும் கெட்டவரும் (எல்லா வகை மனிதர்களும்) உரையாடலாம்” என்று சொன்னேன். அப்போது பர்தா குறித்த இறைவசனம் அருளப்பெற்றது. 3. (ஒருமுறை) நபி (ஸல்) அவர்களின் துணைவியர் அனைவரும் ஒன்று சேர்ந்து, நபி (ஸல்) அவர்களிடம் வைராக்கியமாக நடந்துகொண்டனர். அப்போது நான் அவர்களிடம், “இறைத் தூதர் உங்களை மணவிலக்குச் செய்து விட்டால், உங்களை விடச் சிறந்த துணைவியரை அவர்களுக்கு அல்லாஹ் வழங்கலாம்” என்று சொன்னேன். அப்போது (நான் கூறியவாறே) இந்த இறைவசனம் (66:5) அருளப்பெற்றது. இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 403,
			"arabicnumber": 403,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: மக்கள் (மஸ்ஜித்) குபாவில் சுப்ஹு தொழுகையைத் தொழுதுகொண்டிருந்தபோது அவர்களிடம் ஒரு மனிதர் வந்து, “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குக் கடந்த இரவொன்றில், (தொழு கையின்போது) கஅபாவை முன்னோக்கும் படி ஆணையிட்டு அவர்களுக்குக் குர்ஆன் (வசனம்) அருளப்பெற்றுவிட்டது. ஆகவே, நீங்களும் கஅபாவையே முன்னோக்கித் தொழுங்கள்” என்று கூறினார். உடனே (பைத்துல் மக்திஸ் இருக்கும் திசையான) ‘ஷாம்’ நாட்டை நோக்கித் தொழுதுகொண்டிருந்த அவர்கள், கஅபாவை நோக்கி (அப்படியே தொழுகை யிலேயே) சுழன்று (திரும்பிக்) கொண்டனர். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 404,
			"arabicnumber": 404,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நபி (ஸல்) அவர்கள் லுஹ்ர் தொழுகையை ஐந்து ரக்அத்களா கத் தொழு(வித்)துவிட்டார்கள். (தொழுகை முடிந்து திரும்பியமர்ந்த நபியவர்களை நோக்கி) மக்கள், “தொழுகையில் (அதன் ரக்அத்கள்) கூடுதலாக்கப்பட்டுவிட்டதா?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “ஏன் இவ்வாறு (வினவுகிறீர்கள்)?” என்று கேட்டார்கள். மக்கள், “நீங்கள் ஐந்து ரக்அத்கள் தொழு(வித்)தீர்கள் (அதனால்தான் வினவினோம்.)” என்று கூறினர். உடனே நபி (ஸல்) அவர்கள் (தொழுகை இருப்பில் அமர்வதைப் போன்று) தம் கால்களை மடக்கி (கிப்லாவை நோக்கித் திரும்பி மறதிக்காக) இரண்டு சஜ்தாக்கள் செய்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 405,
			"arabicnumber": 405,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: கிப்லா திசையில் (காறி உமிழப்பட்டி ருந்த) சளியை நபி (ஸல்) அவர்கள் கண்டார்கள். இது அவர்களுக்குச் சஞ் சலத்தை ஏற்படுத்தியது. அதன் பிரதி பலிப்பு அவர்களின் முகத்திலும் காணப் பட்டது. உடனே அவர்கள் எழுந்து தமது கையால் அதைச் சுரண்டி (தூய்மைப் படுத்தி)னார்கள். பிறகு “உங்களில் ஒருவர் தொழுகை யில் நிற்கும்போது, ‘அவர் தம் இறைவனு டன் அந்தரங்கமாக உரையாடுகிறார்’ அல்லது ‘அவருக்கும் கிப்லாவுக்கும் இடையே அவருடைய இறைவன் இருக்கிறான்’. ஆகவே, உங்களில் யாரும் தமது கிப்லா திசை நோக்கிக் கண்டிப்பாக உமிழ வேண்டாம். தமது இடப் புறமோ அல்லது தம் பாதங்களுக்கு அடியிலோ உமிழ்ந்துகொள்ளட்டும்” என்று கூறி விட்டுப் பிறகு, தமது மேலங்கியின் ஓர் ஓரத்தை எடுத்து அதில் உமிழ்ந்து, அதன் ஒரு பகுதியை மற்றொரு பகுதியுடன் கசக்கிவிட்டு, “அல்லது இவ்வாறு அவர் செய்துகொள்ளட்டும்” என்று சொன்னார்கள்.30 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 406,
			"arabicnumber": 406,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பள்ளிவாச-ன்) கிப்லா திசையிலுள்ள சுவரில் (உமிழப்பட்டிருந்த) எச்சிலைக் கண்டார்கள். உடனே அதைச் சுரண்டி (தூய்மைப்படுத்தி)ய பின்னர் மக்களை நோக்கி, “உங்களில் ஒருவர் தொழுதுகொண்டிருக்கும்போது தமது முகத்துக்கெதிரே (கிப்லா திசையில்) உமிழ வேண்டாம். ஏனெனில், அவர் தொழும்போது அவரது முகத்திற்கெதிரே அல்லாஹ் இருக்கின்றான்” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 407,
			"arabicnumber": 407,
			"text": "இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பள்ளிவாச-ன்) கிப்லா திசையிலுள்ள சுவரில் ‘மூக்குச்சளியை’ அல்லது ‘எச் சிலை’ அல்லது ‘காறல் சளியை’க் கண்டார் கள். உடனே அதைச் சுரண்டி (தூய்மைப் படுத்தி)விட்டார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 409,
			"arabicnumber": 409,
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 411,
			"arabicnumber": 411,
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 412,
			"arabicnumber": 412,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: தமக்கு முன்புறமோ தமக்கு வலப் புறமோ உங்களில் எவரும் துப்பக் கூடாது. எனினும், தமக்கு இடப் புறமோ காலுக் கடியிலோ (துப்பலாம்). இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 413,
			"arabicnumber": 413,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஓர் இறைநம்பிக்கையாளர் தொழுதுகொண்டிருக்கும்போது தம் இறைவனுடன் தான் அந்தரங்கமாக உரையாடுகிறார். எனவே, அவர் தமக்கு முன்புறத்திலும் உமிழ வேண்டாம்; தமக்கு வலப் பக்கத்தி லும் உமிழ வேண்டாம்.. எனினும், இடப் புறமோ அல்லது தமது பாதத்திற்குக் கீழேயோ உமிழட்டும். இதை அனஸ் பின் மா-க் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 414,
			"arabicnumber": 414,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பள்ளிவாச-ன் கிப்லா திசைச் சுவரில் (உமிழப்பட்டிருந்த) சளியைக் கண்டார்கள். உடனே சிறு கல் ஒன்றால் அதைச் சுரண்டி (தூய்மைப் படுத்தி)னார்கள். பிறகு “(தொழுகையி-ருக்கும்) ஒருவர் தமக்கு முன்புறமோ அல்லது வலப் புறமோ துப்பக் கூடாது எனத் தடை விதித்துவிட்டு, “எனினும், அவர் தமது இடப் புறமோ அல்லது இடப் பாதத்திற் குக் கீழேயோ உமிழட்டும்” என்று சொன் னார்கள். (இதன் மூன்றாவது அறிவிப்பாளரான) ஸுஹ்ரீ (ரஹ்) அவர்கள் (இரண்டாவது அறிவிப்பாளர்) ஹுமைத் (ரஹ்) அவர்களிடம் நேரடியாகவும் இந்த ஹதீஸ் போன்றதைக் கேட்டுள்ளார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 415,
			"arabicnumber": 415,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: பள்ளிவாசலுக்குள் உமிழ்வது குற்றமாகும். அதை மண்ணுக்குள் புதைப்பது அதற்கான பரிகாரமாகும். இதை அனஸ் பின் மா-க் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 416,
			"arabicnumber": 416,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தொழுகைக்காக நிற்கும்போது தமக்கு முன்புறம் உமிழ வேண்டாம். ஏனெனில், அவர் தொழுகை யில் இருக்கும்வரை அல்லாஹ்வுடன் தான் அந்தரங்கமாக உரையாடிக்கொண்டி ருக்கிறார். (அவ்வாறே) அவர் தமக்கு வலப் புறமாகவும் உமிழ வேண்டாம். ஏனெனில், அவரது வலப் புறத்தில் வானவர் ஒருவர் இருக்கிறார். (உமிழ வேண்டிய கட்டாயம் நேர்ந்தால்) தமக்கு இடப் புறமோ அல்லது பாதத்திற்குக் கீழேயோ உமிழ்ந்துவிட்டு, அதை (மண்ணுக்குள்) புதைத்து விடட்டும்.31 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 417,
			"arabicnumber": 417,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (பள்ளிவாச-ன்) கிப்லா திசையில் (உள்ள சுவரில்) சளியைக் கண்டார்கள். (இதைக் கண்ட) உடன் ‘நபி (ஸல்) அவர்களிடம் வெறுப்பு காணப்பட்டது’ அல்லது ‘இந்தச் செயலை நபி (ஸல்) அவர்கள் வெறுப்பதும் அதன் மீது அவர்கள் காட்டிய கடுமையும் நேரடியாகத் தெரிந்தது.’ அப்போது அவர்கள், “உங்களில் ஒருவர் தொழுகையில் நிற்கும்போது ‘தம் இறை வனுடனேயே உரையாடுகிறார்’. அல்லது ‘அவருக்கும் அவரது கிப்லாவுக்கும் இடையில் அவருடைய இறைவன் இருக்கிறான்’. எனவே, அவர் தமது கிப்லா திசையில் கட்டாயமாக உமிழ வேண்டாம்.. எனினும், அவர் தமக்கு இடப் புறமோ அல்லது வலப் புறமோ அல்லது தமது பாதத்திற்குக் கீழேயோ உமிழ்ந்து கொள்ளட்டும்” என்று கூறினார்கள். பிறகு, “தமது மேல்துண்டின் ஓர் ஓரத்தைப் பிடித்து அதில் உமிழ்ந்து, அதன் ஒரு பகுதியை மற்றொரு பகுதியுடன் தேய்த்துக்காட்டி, “அல்லது அவர் இவ்வாறு செய்துகொள்ளலாம்” என்றார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 418,
			"arabicnumber": 418,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இதுதான் என் கிப்லா திசை (என்பதால் எனக்குப் பின்னால் நின்று நீங்கள் என்ன செய்கிறீர்கள் என்பதை நான் கவனிக்கவில்லை) என்று நினைத்துக்கொண்டி ருக்கிறீர்களா? அல்லாஹ்வின் மீதாணையாக! உங்களது பணிதலும் (சஜ்தாவும்) உங்களது குனிதலும் (ருகூஉம்) எனக்குத் தெரியாமல் இருப்பதில்லை. நிச்சயமாக எனது முதுகுக்கு அப்பாலும் உங்களை நான் பார்க்கிறேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 419,
			"arabicnumber": 419,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் எங்களுக்கு ஒரு தொழுகையைத் தொழுவித்தார்கள். பின்னர் சொற்பொழிவு மேடை (மிம்பர்) மீதேறி தொழுகையைப் பற்றியும் (அதன் முக்கிய நிலைகளில் ஒன்றான) ருகூஉ (குனிதல்) பற்றியும் (அவற்றைக் குறைவின்றி நிறைவேற்றுமாறு) கூறினார்கள். அப்போது, “(உங்களை முன்புறமாக) நான் காண்பதைப் போன்றே, எனது முதுகுக்குப் பின்புற மாகவும் உங்களை நான் காண்கிறேன்” என்று கூறினார்கள்.32 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 420,
			"arabicnumber": 420,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மெலியவைக்கப்பட்ட (பயிற்சியளிக்கப் பட்ட) குதிரைகளுக்கிடையே ‘ஹஃப்யா’ எனும் இடத்தி-ருந்து பந்தயம் வைத்தார்கள். அவற்றின் (பந்தய) எல்லை ‘ஸனிய்யத்துல் வதா’ எனும் மலைக் குன்றாகும். மெ-யவைக்கப்படாத (பயிற்சி பெறாத) குதிரைகளுக்கிடையே அந்த ‘ஸனிய்யத்துல் வதா’வி-ருந்து ‘பனூ ஸுரைக்’ குலத்தாரின் பள்ளிவாசல்வரை பந்தயம் வைத்தார்கள். (இதன் அறிவிப்பாளரான) நாஃபிஉ (ரஹ்) அவர்கள் கூறுகிறார்கள்: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் இந்தப் பந்தயங்களில் கலந்துகொண்ட வர்களில் ஒருவராக இருந்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 421,
			"arabicnumber": 421,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் பஹ்ரைனி-ருந்து (கணிசமான) நிதி கொண்டுவரப் பட்டது. நபி (ஸல்) அவர்கள், “இதைப் பள்ளிவாச-ல் கொட்டிவையுங்கள்” என்று உத்தரவிட்டார்கள். -அது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டு வரப்பட்ட செல்வங்களிலேயே அதிகமானதாக இருந்தது.- அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அதை ஏறிட்டுப்பார்க்காமல் தொழுகைக் காகச் சென்றார்கள். தொழுகையை முடித்துவிட்டு அந்தச் செல்வம் நோக்கி வந்து (அதன் அருகில்) அமர்ந்துகொண்டு ஒருவர் விடாமல் தாம் காண்பவர்களுக்கெல்லாம் வழங்கிக்கொண்டிருந்தார்கள். அப்போது நபி (ஸல்) அவர்களிடம் (அவர்களின் பெரிய தந்தை) அப்பாஸ் (ரலி) அவர்கள் வந்து, “அல்லாஹ்வின் தூதரே! எனக்குக் கொடுங்கள். நான் (பத்ர் போரில் தங்களால் கைது செய்யப்பட்டபின் விடுதலை பெறுவதற்காக) எனக்காகவும் பிணைத்தொகை கொடுத்திருக்கிறேன்; (என் சகோதரர் மகன்) அகீலுக்காகவும் பிணைத்தொகை கொடுத்திருக்கிறேன்” என்று கேட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவரிடம், “எடுத்துக்கொள்ளுங்கள்” என்று சொன்னார்கள். உடனே அப்பாஸ் (ரலி) அவர்கள் தமது துணியில் அதை (அள்ளி) அள்ளிப்போட்டார்கள். பிறகு அதைத் தூக்கிச் செல்ல முனைந்தார்கள். அவர் களால் (அதைத் தூக்க) முடியவில்லை. ஆகவே, “அல்லாஹ்வின் தூதரே! (உங்கள் தோழர்களான) இவர்களில் ஒருவரை எனக்கு இதைத் தூக்கிவிடச் சொல்லுங் கள்” என்று கூறினார்கள். நபி (ஸல்) அவர்கள், “இல்லை (நான் யாரிடமும் சொல்லமாட்டேன்)” என்று சொல்-விட்டார்கள். அதற்கு அப்பாஸ் (ரலி) அவர்கள், “நீங்களாவது என் (தோள்)மீது தூக்கிவையுங்கள்” என்று கேட்டார்கள். அதற்கும் நபி (ஸல்) அவர்கள், “இல்லை (முடியாது)” என்று சொல்-விட்டார்கள். பிறகு அதி-ருந்து சிறிதளவைக் கொட்டிவிட்டு. பிறகு அதைத் தூக்கிச் செல்ல முயன்றார்கள். (அப்போதும் அவர்களால் அதைத் தூக்க முடியவில்லை.) எனவே, (நபி (ஸல்) அவர்களிடம்), “அல்லாஹ்வின் தூதரே! இதைத் தூக்கி விடுமாறு இவர்களில் ஒருவரிடம் கூறுங்கள்” என்று (மீண்டும்) கூறினார்கள். நபி (ஸல்) அவர்கள், “இல்லை (கூறமாட்டேன்)” என்று சொல்-விட்டார்கள். “நீங்களாவது என் (தோள்)மீது இதைத் தூக்கிவையுங்கள்” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள் “இல்லை (முடியாது)” என்று சொல்-விட்டார்கள். பிறகு அப்பாஸ் (ரலி) அவர்கள் அதி-ருந்து இன்னும் சிறிதளவைக் கீழே கொட்டிவிட்டு, அதைத் தூக்கி தம் தோள்கள்மீது வைத்துக்கொண்டு நடக்கலானார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அப்பாஸ் (ரலி) அவர்களின் பேராசை யைக் கண்டு வியப்படைந்து அவர்களையே கண்கொட்டாமல் பார்த்துக்கொண்டே யிருந்தார்கள அங்கு அந்த நிதியி-ருந்து ஒரேயொரு திர்ஹம்கூட எஞ்சாமல் (தர்மம் செய்து) தீர்ந்துவிட்ட பின்புதான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது இடத்தைவிட்டு எழுந்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 422,
			"arabicnumber": 422,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களைப் பள்ளிவாச-ல் கண்டேன். அவர்களுடன் மக்கள் சிலரும் இருந்தனர். (அவர்களுக்கு முன்னால் சென்று) நான் நின்றேன். அப்போது அவர்கள் என்னிடம், “உன்னை அபூதல்ஹா அனுப்பினாரா?” என்று கேட்டார்கள். நான் ‘ஆம்’ என்றேன். “உணவு அருந்துவதற்காகவா?” என்று கேட்டார்கள். நான் ‘ஆம்’ என்றேன். அப்போது நபி (ஸல்) அவர்கள் தம்முடன் இருந்தவர்களிடம், “எழுந்திருங்கள்” என்று சொல்-விட்டு நடந்தார்கள். நான் அவர்கள் அனைவருக்கும் முன்னால் நடந்தேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 423,
			"arabicnumber": 423,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் (நபி (ஸல்) அவர்களிடம் வந்து), “அல்லாஹ்வின் தூதரே! தன் மனைவியுடன் மற்றோர் ஆடவனை (தகாத உறவு கொண்ட நிலையில் இருக்க)க் கண்ட ஒரு மனிதன் அவனைக் கொன்று விடலாமா?” என்று கேட்டார். (இந்த விவகாரத்தில் கணவன்-மனைவி இரு வரும் ‘சாப அழைப்புப் பிரமாணம்’ செய்ய வேண்டும் என நபி (ஸல்) அவர்கள் தீர்ப்பளித்தார்கள்.) எனவே, பள்ளிவாசலுக்குள் அத் தம்பதியர் இருவரும் சாப அழைப்புப் பிரமாணம் (லிஆன்) செய்தனர். அப்போது நான் அந்த இடத்தில் (நபி (ஸல்) அவர்களுக்கு அருகில்) இருந்தேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 424,
			"arabicnumber": 424,
			"text": "இத்பான் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: (எனது வீட்டில் ஓர் இடத்தில் தொழுவித்து, அந்த இடத்தை எனது தொழுமிடமாக்க வருமாறு நான் அழைத்ததன் பேரில்) நபி (ஸல்) அவர்கள் எனது வீட்டுக்கு வந்தார்கள். (வீட்டுக்குள் வந்ததும்) “உமது வீட்டில் உமக்காக நான் எந்த இடத்தில் தொழ வேண்டுமென நீர் விரும்புகிறீர்?” என்று கேட்டார்கள். நான் அவர்களிடம் (குறிப்பிட்ட) ஓர் இடத்தைக் காட்டியதும், (அந்த இடத்தில் நின்று) நபி (ஸல்) அவர்கள் ‘தக்பீர்’ கூறி(த் தொழலா)னார்கள். நாங்களும் அவர்களுக்குப் பின்னால் அணிவகுத்து நின்றோம். அப்போது அவர்கள் இரண்டு ரக்அத்கள் தொழு(வித்)தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 425,
			"arabicnumber": 425,
			"text": "மஹ்மூத் பின் அர்ரபீஉ அல் அன்சாரி (ரலி) அவர்கள் கூறியதாவது: பத்ர் போரில் கலந்துகொண்ட அன்சாரி களில் ஒருவரான நபித்தோழர் இத்பான் பின் மாலிக் (ரலி) அவர்கள் அல்லாஹ் வின் தூதர் (ஸல்) அவர்களிடம் வந்து, “அல்லாஹ்வின் தூதரே! எனது பார்வை (மங்கிப்)போய்விட்டது. நான் என் சமூகத்தாருக்கு (இமாமாக இருந்து) தொழுகை நடத்திவருகிறேன். மழைக் காலங்களில் என(து இல்லத்து)க்கும் அவர்களுக்கும் இடையே உள்ள பள்ளத்தாக்கில் தண்ணீர் ஓடுவதால் அவர்களின் பள்ளிவாசலுக்குச் சென்று என்னால் தொழுவிக்க முடியவில்லை. எனவே, அல்லாஹ்வின் தூதரே! தாங்கள் எனது இல்லத்திற்கு வந்து அதில் (ஓர் இடத்தில்) தொழ வேண்டும். அதை நான் தொழு(விக்கு)ம் இடமாக ஆக்கிக்கொள்ள வேண்டும் என ஆசைப்படுகிறேன்” என்று சொன்னார்கள். அப்போது அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அல்லாஹ் நாடினால் (இன்ஷா அல்லாஹ்) அவ்வாறே நான் செய்வேன்” என்று கூறினார்கள். இத்பான் பின் மா-க் (ரலி) அவர்கள் கூறுகிறார்கள்: (மறு நாள்) முற்பகல் நேரத்தில் அபூபக்ர் (ரலி) அவர்களுடன் அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் வந்து (எனது இல்லத்துக்குள்) நுழைய அனுமதி கேட்டார்கள். அவர்களுக்கு நான் அனுமதியளித்தேன். வீட்டில் நுழைந்ததும். உட்காராமலேயே, “உங்கள் வீட்டில் எந்த இடத்தில் நான் தொழ வேண்டுமென விரும்புகிறீர்கள்?” என்று (என்னிடம்) கேட்டார்கள். அப்போது நான் அவர்களுக்கு வீட்டின் ஒரு பகுதியைக் காட்டினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அவ்விடத்தில்) நின்று ‘தக்பீர் (தஹ்ரீமா)’ கூறினார்கள். நாங்களும் அவர்களுக்குப் பின்னால் (தொழுகையில்) அணிவகுத்து நின்றோம். அப்போது அவர்கள் இரண்டு ரக்அத்கள் தொழு(வித்)துவிட்டு ‘சலாம்’ கொடுத்தார்கள். நபி (ஸல்) அவர்களுக்காக நாங்கள் தயாரித்துவைத்திருந்த ‘கஸீரா’ எனும் (கஞ்சி வகை) உணவி(னை உட்கொள்வத)ற்காக அவர்களை நாங்கள் இருக்கவைத்தோம். (நபியவர்களின் வருகையை அறிந்த) அப்பகுதி மக்களில் கணிசமானோர் வீட்டில் வந்து குழுமிவிட்டனர். அப்போது அவர்களில் ஒருவர், ‘மா-க் பின் துகைஷின்’ அல்லது ‘இப்னு துக்ஷுன்’ எங்கே என்று கேட்டார். மற்றொருவர், “அவர் ஒரு நயவஞ்சகர் (முனாஃபிக்); அல்லாஹ்வையும் அவனுடைய தூதரையும் நேசிக்காதவர் (அதனால்தான் அல்லாஹ்வின் தூதரைக் காண அவர் வரவில்லை)” என்று சொன்னார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவ்வாறு சொல்லாதே! அல்லாஹ்வின் அன்பை நாடி, அவர் அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை (லா இலாஹ இல்லல்லாஹ்) என்று சொல்-விட்டிருப்பதை நீ பார்க்கவில்லையா?” என்று கேட்டார்கள். அவர், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்” என்று கூறிவிட்டு, “அவர் (மாலிக் பின் துக்ஷுன்) நயவஞ்சகர்களுடன் தொடர்பு வைத்திருப்பதையும் (அவர்கள்மீது) அபிமானம் கொண்டிருப்பதையும் காண் கிறோம்” என்று சொன்னார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அல்லாஹ்வின் அன்பை நாடி ‘லா இலாஹ இல்லல்லாஹ்’ என்று யார் சொன்னாரோ அவர்மீது அல்லாஹ் நரகத்தைத் தடை செய்துவிட்டான்” என்று கூறினார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான இப்னு ஷிஹாப் (அஸ்ஸுஹ்ரீ-ரஹ்) அவர்கள் கூறுகிறார்கள்: பிறகு நான் பனூ சா-ம் குலத்தைச் சேர்ந்தவரும் அவர்களின் பிரமுகர்களில் ஒருவருமான ஹுஸைன் பின் முஹம்மத் அல்அன்சாரி (ரஹ்) அவர்களிடம் மஹ்மூத் பின் அர்ரபீஉ (ரலி) அவர்களின் ஹதீஸ் குறித்துக் கேட்டேன். அன்னார் சொன்ன ஹதீஸை ஹுஸைன் பின் முஹம்மத் (ரஹ்) அவர்கள் உறுதிப்படுத்தி னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 426,
			"arabicnumber": 426,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (அங்கத்) தூய்மை செய்யும்போதும் தலைவாரும்போதும் செருப்பணியும்போதும் தம் செயல்கள் ஒவ்வொன்றிலும் இயன்ற வரை வலப் பக்கத்தைக் கொண்டு ஆரம்பிப்பதையே விரும்பக்கூடியவர்களாக இருந்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 427,
			"arabicnumber": 427,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: உம்மு ஹபீபா (ரலி) அவர்களும் உம்மு சலமா (ரலி) அவர்களும் (அபிசீனிய ஹிஜ்ரத்தின்போது) அபிசீனி யாவில் தாங்கள் பார்த்த உருவப் படங்கள் உள்ள ஒரு கிறித்தவ ஆலயம் குறித்து (என்னிடம்) பேசினார்கள். மேலும், அவ்விருவரும் நபி (ஸல்) அவர்களிடம் அதைப் பற்றிக் கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், “(அவர்கள் எத்தகையவர்கள் என்றால்) அவர்களிடையே நல்ல மனிதர் ஒருவர் வாழ்ந்து இறந்துவிடும்போது, அவரது சமாதியின் மீது வழிபாட்டுத் தலம் ஒன்றைக் கட்டி, அதில் (அவருடைய) அந்த உருவங்களை வரைவார்கள். அவர்கள்தான் மறுமை நாளில் அல்லாஹ் விடம் மக்களிலேயே மிகவும் மோசமான வர்கள்” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 428,
			"arabicnumber": 428,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (புலம்பெயர்ந்து) மதீனாவுக்கு வந்தபோது, மதீனாவின் மேட்டுப்பாங்கான பகுதியில் ‘பனூ அம்ர் பின் அவ்ஃப்’ என்றழைக்கப்பட்டுவந்த ஒரு குடும்பத்தாரிடம் இறங்கி, அவர்களி டையே பதினான்கு நாட்கள் தங்கினார்கள். பிறகு ‘பனூ நஜ்ஜார்’ கூட்டத்தாருக்கு ஆளனுப்பினார்கள். ‘பனூ நஜ்ஜார்’ கூட்டத்தார் (நபியவர்களை வரவேற்கும் முகமாகத் தம்) வாட்களைத் தொங்கவிட்டபடி வந்தனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வாகனத்தில் அமர்ந்திருக்க, அபூபக்ர் (ரலி) அவர்கள் அவர்களுக்குப் பின்னே அமர்ந்திருக்க, ‘பனூ நஜ்ஜார்’ கூட்டத்தார் அவர்களைச் சுற்றிலும் குழுமியிருந்த (அந்தக் காட்சி)தனை (இப்போதும்) நான் காண்பதைப் போன்றுள்ளது. நபி (ஸல்) அவர்களின் ஊர்தி ஒட்டகம் அபூஅய்யூப் (ரலி) அவர்களின் வீட்டு முற்றத்தில் அவர்களை இறக்கியது.- அப்போதெல்லாம் தொழுகை நேரம் தம்மை வந்தடையும் இடத்திலேயே நபி (ஸல்) அவர்கள் தொழுகையை நிறைவேற்று வார்கள்; ஆட்டுத் தொழுவங்களிலும் தொழுவார்கள்- பிறகு நபி (ஸல்) அவர்கள் பள்ளிவாசல் கட்டும்படி பணித்தார்கள். பனூ நஜ்ஜார் கூட்டத்தாருக்கு ஆளனுப்பி னார்கள். (அவர்கள் வந்தபோது), “பனூ நஜ்ஜார் கூட்டத்தாரே! உங்களின் இந்தத் தோட்டத்திற்கு என்னிடம் விலை கூறுங்கள்” என்று கேட்டார்கள். அதற்கு அவர்கள், “இல்லை. அல்லாஹ்வின் மீதாணையாக! இதற்கான விலையை நாங்கள் அல்லாஹ்விடமே கோருவோம்” என்று பதில் (கூறி, அந்தத் தோட்டத்தை) அளித்தனர். நான் உங்களிடம் கூறப்போகின்றவை தான் அ(ந்தத் தோட்டத்)தில் இருந்தன: அதில் இணைவைப்பாளர்களின் சமாதிகள் இருந்தன; அதில் இடிபாடுகள் இருந்தன; சில பேரீச்ச மரங்களும் அதில் இருந்தன. எனவே, (அங்கு பள்ளிவாசல் கட்டுவதற்கு வசதியாக) நபி (ஸல்) அவர்களின் ஆணையின் பேரில் (அங்கிருந்த) இணைவைப்பாளர்களின் சமாதிகள் தோண்டப்பட்டு, இடிபாடுகள் அகற்றப்பட்டு சமப்படுத்தப்பட்டன. பேரீச்ச மரங்கள் வெட்டப்பட்டன. பின்னர் பள்ளிவாச-ன் கிப்லா திசையில் பேரீச்ச மரங்களை வரிசையாக நட்டனர். பள்ளிவாச-ன் (கதவின்) இரு நிலைக் கால்களாகக் கல்லை (நட்டு) வைத்தனர். ‘ரஜ்ஸ்’ எனும் ஈரசைச்சீர் வகைப் பாடலை பாடிக்கொண்டே அந்தக் கல்லை எடுத்துவரலாயினர். “இறைவா! மறுமையின் நன்மையைத் தவிர வேறு நன்மை கிடையாது; ஆகவே, (மறுமையின் நன்மைகளுக்காகப் பாடுபடும்) அன்சாரிகளுக்கும் முஹாஜிர்களுக்கும் நீ மன்னிப்பு அளிப்பாயாக!” என்று நபி (ஸல்) அவர்கள் கூறியவாறு அவர்களுடன் (சேர்ந்து பாறைகளை அப்புறப்படுத்துபவர்களாக) இருந்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 429,
			"arabicnumber": 429,
			"text": "ஷுஅபா (பின் அல்ஹஜ்ஜாஜ் -ரஹ்) அவர்கள் கூறியதாவது: “நபி (ஸல்) அவர்கள் ஆட்டுத் தொழுவங்களில் தொழுபவர்களாக இருந்தார்கள்” என்று அனஸ் (ரலி) அவர்கள் கூறியதாக அபுத்தய்யாஹ் (ரஹ்) அவர்கள் அறிவித்துவந்தார்கள். பின்னர் “பள்ளிவாசல் கட்டப்படு வதற்கு முன்னால் நபி (ஸல்) அவர்கள் (அவ்வாறு) ஆட்டுத் தொழுவங்களில் தொழுபவர்களாக இருந்தார்கள்” என்று (காலவரையறையுடன் சேர்த்துக்) கூறக் கேட்டேன்.37 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 430,
			"arabicnumber": 430,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: இப்னு உமர் (ரலி) அவர்கள் தமது ஒட்டகத்தை (தடுப்பாக வைத்து அதை) நோக்கித் தொழுதுவிட்டு, “நபி (ஸல்) அவர்கள் இவ்வாறு செய்வதை நான் பார்த்திருக்கிறேன்” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 431,
			"arabicnumber": 431,
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) சூரிய கிரகணம் ஏற்பட் டது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (சூரிய கிரகணத் தொழு கையை) தொழு(வித்)தார்கள். பிறகு (இத் தொழுகையில் நான் இருந்தபோது) எனக்கு நரகம் எடுத்துக்காட்டப்பட்டது. இன்று (நான் கண்டதைப்) போன்று பயங்கரமான காட்சி எதையும் நான் ஒரு போதும் கண்டதில்லை” என்று சொன் னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 432,
			"arabicnumber": 432,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்கள் தொழுகைகளில் சிலவற்றை உங்கள் இல்லங்களிலும் நிறைவேற்றுங்கள் உங்கள் இல்லங்களை மண்ணறைகளாக (கப்றுகள்) ஆக்கிவிடாதீர்கள்.39 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 433,
			"arabicnumber": 433,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (‘ஹிஜ்ர்’வாசிகளைக் குறித்து), “இவர்களைத் தீண்டியதைப் போன்ற அதே வேதனை நம்மையும் தீண்டிவிடுமோ என்று (அஞ்சி) அழுதபடியே தவிர, வேதனை செய்யப்பட்ட இந்த மக்களின் (வசிப்பிடங்கள்) வழியாகச் செல்லாதீர்கள். உங்களால் அழ முடியாவிட்டால் அந்த இடத்திற்கே செல்லாதீர்கள்” என்று (ஹிஜ்ர் பிரதேசத்தைக் கடந்து சென்றபோது எங்களிடம்) கூறினார்கள்.41 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 434,
			"arabicnumber": 434,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அபிசீனிய நாட்டில் தாம் கண்ட ‘மரியா’ என்றழைக்கப்பட்ட ஒரு கிறித்தவ ஆலயத்தைப் பற்றி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் உம்மு சலமா (ரலி) அவர்கள் கூறினார்கள். அதில் தாம் கண்ட உருவப்படங்களைக் குறித்தும் உம்மு சலமா அவர்கள் குறிப்பிட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவர்கள் எத்தகைய மக்கள் எனில், அவர்களிடையே ‘நல்ல அடியார்’ அல்லது ‘நல்ல மனிதர்’ ஒருவர் வாழ்ந்து இறந்துவிடும்போது, அவரது சமாதியின் மீது வழிபாட்டுத் தலம் ஒன்றைக் கட்டிவிடு வார்கள்; அதில் அந்த உருவங்களை வரைந்தும்விடுவார்கள். இத்தகையோர் தான் அல்லாஹ்விடம் மக்களிலேயே மிகவும் மோசமானவர்கள்” என்று சொன்னார்கள்.43 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 436,
			"arabicnumber": 436,
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 437,
			"arabicnumber": 437,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: “அல்லாஹ் யூதர்களைத் தனது கருணையி-ருந்து அப்புறப்படுத்துவானாக! தம் இறைத்தூதர்களின் மண்ணறைகளை அவர்கள் வழிபாட்டுத் தலங்களாக ஆக்கிக் கொண்டார்கள்” என அல்லாஹ்வின் தூதர் அவர்கள் கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 438,
			"arabicnumber": 438,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: எனக்கு முன்னிருந்த இறைத்தூதர்கள் யாருக்கும் வழங்கப்பெறாத ஐந்து விஷயங் கள் எனக்கு வழங்கப்பெற்றுள்ளன: 1. (எதிரிகளுக்கும் எனக்கும் இடையே) ஒரு மாத காலப் பயணத் தொலைவு இருந் தாலும், (அவர்களுடைய உள்ளங்களில் என்னைப் பற்றிய மதிப்பு கலந்த) அச்சம் ஏற்படுவதன் மூலம் எனக்கு வெற்றி அளிக்கப்பட்டுள்ளது. 2. எனக்குப் பூமி முழுவதும் சுத்தம் (தயம்மும்) செய்வதற்கேற்றதாகவும் தொழு மிடமாகவும் ஆக்கப்பட்டுள்ளது. (எனவே,) என் சமுதாயத்தாரில் யாருக்கேனும் தொழுகை(யின் நேரம்) வந்துவிட்டால், (அவர் எந்த இடத்தில் இருக்கிறாரோ அந்த இடத்தில்) தொழுதுகொள்ளட்டும். 3. (முந்தைய இறைத்தூதர்கள் யாருக்கும் அனுமதிக்கப்படாத) போரில் கிடைக்கும் செல்வங்கள் எனக்கு (மட்டும்) அனுமதிக்கப்பட்டுள்ளன. 4. ஒவ்வோர் இறைத்தூதரும் தத்தம் சமுதாயத்தாருக்கு மட்டுமே (தூதராக நியமிக்கப்பட்டு) அனுப்பப்பட்டார்கள். (ஆனால்,) நானோ ஒட்டு மொத்த மனித குலத்திற்கும் இறைத்தூதராக அனுப்பப்பட்டுள்ளேன். 5. (மறுமையில் என் சமுதாயத்தாருக்காகப்) பரிந்துரை செய்யும் வாய்ப்பு அளிக்கப்பட்டுள்ளேன். இதை ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.44 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 439,
			"arabicnumber": 439,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு கறுப்பு நிற அடிமைப்பெண் அரபியரில் ஒரு குடும்பத்தாருக்குச் சொந்தமானவளாயிருந்தாள். பின்னர் அவளை அவர்கள் விடுதலை செய்து விட்டனர். ஆயினும், அவர்களுடனேயே அவள் இருந்துவந்தாள். அந்தப் பெண் (தனது வாழ்வில் நடந்த நிகழ்ச்சி ஒன்றை பின்வருமாறு என்னிடம்) கூறினாள்: (ஒரு நாள்) அந்தக் குடும்பத்தைச் சேர்ந்த ஒரு இளம்பெண் (மணமுடித்த புதிதில்) சிவப்புத் தோ-ல் முத்துகள் பதிக்கபட்ட அரையணித் தோள் பட்டிகை அணிந்துகொண்டு (குளியலறைக்குப்) புறப்பட்டாள்.45 அப்போது ‘அவள் அதை (ஓர் இடத்தில் கழற்றி) வைத்தாள்’ அல்லது ‘(எதிர்பாராத விதமாக) அந்தப் பட்டிகை அவளிடமிருந்து (கழன்று) விழுந்துவிட்டது’. கீழே கிடந்த அதைக் கடந்து சென்ற பருந்துக் குஞ்சு ஒன்று, இறைச்சி என்று நினைத்துக் கொத்திச் சென்றுவிட்டது. அவர்கள் அதைத் தேடினர். ஆனால், அவர்களுக்கு அது கிடைக்கவில்லை. அந்தக் குடும்பத்தார் (அதை நான்தான் திருடியிருப்பேன் என்று எண்ணி) என்மீது குற்றம்சாட்டி (என்னை வதைத்த)னர். (எந்த அளவுக்கென்றால்,) எனது பிறவி உறுப்பில்கூட சோதனையிட்டனர். அல்லாஹ்வின் மீது சத்தியமாக! நான் அவர்களுடன் நின்றுகொண்டிருந்தபோது, பறந்துவந்த அந்தப் பருந்துக் குஞ்சு அந்தப் பட்டிகையைக் (கீழே) போட அவர்களுக்கு மத்தியில் அது விழுந்தது. (உடனே) நான் (அவர்களிடம்), “நிரபராதியான என்மீது (திருட்டுக்)குற்றம் சாட்டி, (அதை நான் எடுத்துவிட்டதாக)க் கூறினீர்களே! அந்தப் பட்டிகை இதோ இங்கு இருக்கிறது” என்று சொன்னேன். இதற்குப் பிறகு நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து இஸ்லாத்தைத் தழுவினேன். ஆயிஷா (ரலி) அவர்கள் கூறு கிறார்கள்: (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ல் அந்தப் பெண்ணுக்கென முடியாலான ஒரு கூடாரம்’ அல்லது ‘சிறிய குடில்’ இருந்தது. (அதில் அவள் வசித்துவந்தாள்.) அந்தப் பெண் என்னிடம் வந்து பேசிக்கொண்டிருப்பார். அவர் என்னிடம் அமர்ந்திருந்த ஒவ்வோர் அமர்வி(ன் முடிவி)லும் (பின்வருமாறு) பாடாமல் அவர் இருந்ததில்லை: எம் இறைவனின் விந்தைப் பட்டி ய-ல் அந்த அரையணிப் பட்டிகை நாளும் ஒன்றே! எனை இறைமறுப்பின் பட்டியி-ருந்து ஈடேற்றிக் காத்த நாளும் அன்றே! (ஒரு நாள்) நான் அவரிடம், “நீ என்னுடன் அமரும்போதெல்லாம் இதை நீ சொல்லாமல் இருப்பதில்லையே! உனக்கு என்ன நேர்ந்தது?” என்று கேட்டேன். அப்போதுதான் அந்தப் பெண் (மேற்கண்ட) அந்தச் செய்தியை என்னிடம் கூறினார். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 440,
			"arabicnumber": 440,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: மணமாகாத, குடும்பமில்லாத இளைஞ னாக நான் இருந்தபோது, நபி (ஸல்) அவர் களின் பள்ளிவாசலில் (தங்கி) உறங்கிக் கொண்டிருந்தேன். இதை நாஃபிஉ (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 441,
			"arabicnumber": 441,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் புதல்வி ஃபாத்திமா (ரலி) அவர்களின் இல்லத்திற்கு வந்த போது, (மருமகனான) அலீ (ரலி) அவர்கள் வீட்டில் காணவில்லை. ஆகவே, உன் (தந்தையின்) பெரிய தந்தையின் புதல்வர் எங்கே?” என்று கேட்க, அதற்கு ஃபாத்திமா (ரலி) அவர்கள், “எனக்கும் அவருக்கும் இடையே சிறிய மனஸ்தாபம் ஏற்பட்டது. ஆகவே, அவர் என்னைக் கோபித்துக்கொண்டு என்னிடம் மதிய ஓய்வெடுக்காமல் (வீட்டி-ருந்து) சென்று விட்டார்” என்று கூறினார்கள். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு மனிதரிடம், “அவர் எங்கே என்று பாருங்கள்” என்றார்கள். உடனே அந்த மனிதர் (சென்றுவிட்டு) வந்து, “அவர் பள்ளிவாச-ல் உறங்கிக்கொண்டிருக்கிறார், அல்லாஹ்வின் தூதரே!” என்றார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பள்ளிவாசலுக்கு) வந்தபோது, அலீ (ரலி) அவர்களின் மேலங்கி அவரது முதுகி-ருந்து (தரையில்) விழுந்துவிட்டிருக்க, அவரது மேனியில் மண் படிந்திருக்கும் நிலையில் அவர் ஒருக்களித்துப் படுத்திருக் கக் கண்டார்கள். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அலீ (ரலி) அவர்களின் மேனியி-ருந்த மண்ணைத் துடைத்தவாறே, “எழுந்திருங்கள், மண்ணின் தந்தையே (அபுத்துராப்)! எழுந்திருங்கள், மண்ணின் தந்தையே!!” என்று கூறலானார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 442,
			"arabicnumber": 442,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: திண்ணைத் தோழர்களில் எழுபது பேரை நான் பார்த்திருக்கிறேன். அவர் களில் ஒருவருக்குக்கூட மேல்துண்டு இருந்ததில்லை. (ஒரேயோர் ஆடைதான் அவர்களுக்கு இருந்தது.) ஒன்று அது கீழங்கியாக இருக்கும்; அல்லது (அது) ஒரு துணியாக (மட்டும்) இருக்கும். அதை அவர்கள் தங்கள் பிடரியில் முடிந்து கொண்டிருப்பார்கள். அவற்றில் சில, (பற்றாக் குறையால்) கணைக்கால்களின் பாதியளவே இருக்கும். இன்னும் சில கணுக்கால்களை எட்டு மளவுக்கு இருக்கும். அதை அவர்கள் (தொழும்போதும் மற்ற நேரங்களிலும்) தமது கரத்தால் சேர்த்துப் பிடித்துக் கொள்வார்கள். மறைக்க வேண்டிய தம் உறுப்புகளை பிறர் பார்த்துவிடக் கூடாதே! என்பதற்காக (அவ்வாறு சேர்த்துப் பிடித்தனர்.) அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 443,
			"arabicnumber": 443,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (பயணத்தை முடித்துக்கொண்டு) பள்ளிவாச-ல் இருந்த நபி (ஸல்) அவர்களிடம் நான் வந்தேன். அப்போது அவர்கள் (என்னிடம்), “(பயணத்தி-ருந்து திரும்பிய நீர்) இரண்டு ரக்அத்கள் தொழுவீராக!” என்று சொன்னார்கள். எனக்கு நபி (ஸல்) அவர்கள் தர வேண்டிய கடன் (பாக்கி) ஒன்றும் இருந்தது. அப்போது அவர்கள் அதை எனக்கு வழங்கியதுடன், மேலதிகமாகவும் வழங்கினார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவ ரான) மிஸ்அர் (ரஹ்) அவர்கள் கூறு கிறார்கள்: (எமக்கு இந்த ஹதீஸை அறிவித்த) முஹாரிப் பின் திஸார் (ரஹ்) அவர்கள், ‘முற்பகல் நேரத்தில் (நான் நபிகளாரிடம் சென்றேன்)’ என்று (ஜாபிர் (ரலி) அவர்கள்) கூறியதாகவும் குறிப்பிட்டார்கள் என நான் எண்ணுகிறேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 444,
			"arabicnumber": 444,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் பள்ளிவாசலுக்குள் நுழைந்தால், உட்காருவதற்கு முன்பு இரண்டு ரக்அத்கள் தொழட்டும். இதை அபூகத்தாதா அஸ்ஸலமீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 445,
			"arabicnumber": 445,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவர் எந்த இடத்தில் தொழுவாரோ அந்த இடத்திலேயே அமர்ந்திருக்கும் வரை அவருக்காக வானவர்கள் பிரார்த் தனை செய்கிறார்கள்; ஆனால், (உளூவை முறிக்கக்கூடிய) சிறுதுடக்கு ஏற்படாம-ருக்க வேண்டும். வானவர்கள், “இறைவா! இவருக்கு மன்னிப்பு அளிப்பாயாக! இறைவா! இவருக்குக் கருணை புரிவாயாக!” என்று பிரார்த்திக்கிறார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் ‘மஸ்ஜிதுந் நபவீ’ பள்ளிவாசல் (உடைய சுவர்கள்) செங்கற் களால் கட்டப்பட்டிருந்தன; அதன் மேற் கூரை பேரீச்சமர ஓலைகளாலும், அதன் தூண்கள் பேரீச்ச மரக் கட்டைகளாலும் அமைந்திருந்தன. அபூபக்ர் (ரலி) அவர்கள் (தமது ஆட்சிக் காலத்தில்) அதில் எந்த விரிவாக்கமும் செய்யவில்லை. என்றாலும், உமர் (ரலி) அவர்கள் (தமது ஆட்சியில்) அதை விரிவுபடுத்தினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் காலத்தி-ருந்த கட்டட அமைப்பிலேயே செங்கல், பேரீச்ச மர ஓலை ஆகியவற்றால் அதைக் கட்டினார்கள். அதன் தூண்களை முன்பு போன்றே (பேரீச்சமரக்) கட்டைகளால் அமைத்தார்கள். பின்னர் (ஆட்சிப் பொறுப்பேற்ற) உஸ்மான் (ரலி) அவர்கள் அதில் மாற்றம் செய்து, அதிகமான அம்சங்களைச் சேர்த்தார்கள். வேலைப்பாடுகள் செய்யப்பட்ட கற்களாலும் சுண்ணாம்புக் காரையாலும் அதன் சுவர்களைக் கட்டினார்கள். வேலைப்பாடுகள் செய்யப்பட்ட கற்களால் அதன் தூண்களை எழுப்பினார்கள். தேக்கு மரத்தால் அதற்கு மேற்கூரை அமைத்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 447,
			"arabicnumber": 447,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்களால் விடுதலை செய்யப்பட்ட அவர்களின் முன்னாள் அடிமையான) இக்ரிமா (ரஹ்) அவர்கள் கூறியதாவது: இப்னு அப்பாஸ் (ரலி) அவர்கள் (பஸ்ராவின் ஆளுநராயிருந்த காலகட்டத்தில்) என்னிடமும் தம் புதல்வர் அலீ (ரஹ்) அவர்களிடமும், “நீங்கள் இருவரும் அபூசயீத் அல்குத்ரீ (ரலி) அவர்களிடம் சென்று, அவர் கூறும் ஹதீஸைக் கேட்டு வாருங்கள்” என்று கூறினார்கள். அவ்வாறே நாங்கள் சென்றோம். அப்போது அபூசயீத் (ரலி) அவர்கள் தோட்டத்தில் (நீர்பாய்ச்சி) அதைப் பராமரித்துக்கொண்டிருந்தார்கள். (அவர்கள் எங்களைக் கண்ட) உடன் தமது மேல்துண்டை எடுத்துப் போர்த்திக்கொண்டபின் (பல ஹதீஸ்களை) எங்களுக்குக் கூறத் தொடங்கினார்கள். இறுதியாக ‘மஸ்ஜிதுந் நபவீ’ கட்டியது பற்றிப் பேச்சு வந்தபோது (பின்வருமாறு) அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறினார்கள்: நாங்கள் (மஸ்ஜிதுந் நபவீ பள்ளிவாச-ன்) செங்கற்களை ஒவ்வொன்றாகச் சுமந்து எடுத்துக்கொண்டு சென்றோம்.. அம்மார் (ரலி) அவர்கள் இரண்டிரண்டு செங்கற் களாகச் சுமந்த வண்ணமிருந்தார். அவரைக் கண்ட நபி (ஸல்) அவர்கள் (அவரது தலையில் படிந்திருந்த) புழுதி யைத் தட்டிவிட்டு, “பாவம் அம்மார்! அவரை ஒரு கலகக் கூட்டத்தார் கொன்று விடுவார்கள். அவர்களை அம்மார் சொர்க்கத்தி(ற்குக் காரணமான, தலை மைக்குக் கட்டுப்படும் செயலி)ன் பக்கம் அழைக்க, அந்தக் கூட்டத்தாரோ அவரை நரகத்தி(ற்குக் காரணமான நல்ல தலைமைக்கு எதிராகச் செயல்படுவத)ன் பக்கம் அழைத்துக்கொண்டிருப்பார்கள்” என்று கூறினார்கள். (இதைக் கேட்டதிலிருந்து) அம்மார் (ரலி) அவர்கள், “குழப்பங்களைவிட்டு அல்லாஹ்விடம் நான் பாதுகாப்புக் கோருகிறேன்” என்று கூறுவார்கள்.47 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 448,
			"arabicnumber": 448,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு (அன்சாரிப்) பெண்ணிடம் ஆள னுப்பி, “நான் மக்களுக்கு உரையாற்றும்போது அமர்ந்துகொள்வதற்கு (ஏற்ற வகையில் மேடை தயாரிக்க) எனக்கு மரச்சட்டங்களைச் செய்து தருமாறு தச்சு வேலை தெரிந்த உன் பணியாளருக்கு உத்தரவிடுவீராக” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 449,
			"arabicnumber": 449,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: ஒரு (அன்சாரிப்) பெண்மணி, “அல்லாஹ்வின் தூதரே! என்னிடம் தச்சு வேலை தெரிந்த ஒரு பணியாளர் இருக்கி றார்; நீங்கள் அமர்ந்துகொள்வதற்கேற்ப (மேடை) ஒன்றை நான் உங்களுக்குச் செய்து தரலாமா?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “நீங்கள் விரும்பினால் (செய்து கொடுங்கள்)” என்று கூற, அப்பெண்மணி சொற்பொழிவு மேடை (மிம்பர்) ஒன்றை செய்(து கொடுத்)தார். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 450,
			"arabicnumber": 450,
			"text": "உபைதுல்லாஹ் அல்கவ்லானீ (ரஹ்) அவர்கள் கூறியதாவது: (கலீஃபா) உஸ்மான் (ரலி) அவர்கள், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது பள்ளிவாசலை (அதன் பழைய அமைப்பை மாற்றி விரிவுபடுத்தி)க் கட்ட விரும்பியபோது, அவர்களைப் பற்றி மக்கள் (குறை) பேசினர். அப்போது உஸ்மான் (ரலி) அவர்கள் (மக்களிடம்), “நீங்கள் (உங்கள் எதிர்ப்பை) அதிகமாக்கிவிட்டீர்கள். ‘யார் பள்ளிவாசல் ஒன்றைக் கட்டுகிறாரோ அதைப் போன்ற ஒன்றை சொர்க்கத்தில் அவருக்காக அல்லாஹ் கட்டுகிறான்’ என நபி (ஸல்) அவர்கள் கூறியதை நான் கேட்டுள்ளேன்” என்று கூறினார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) புகைர் பின் அப்தில்லாஹ் அல்அஷஜ் (ரஹ்) அவர்கள் கூறுகிறார்கள்: எமக்கு இந்த ஹதீஸை அறிவித்த ஆஸிம் பின் உமர் (ரஹ்) அவர்கள், “அல்லாஹ்வின் அன்பை நாடி (யார் பள்ளிவாசல் ஒன்றைக் கட்டுகிறாரோ)” என்று (நபியவர்கள்) கூறியதாகவே நான் கருதுகிறேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 451,
			"arabicnumber": 451,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலில் ஒருவர் அம்புகளுடன் நடந்து சென்றார். அப்போது அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவற்றின் முனை களைப் பிடித்து (மறைத்து)க்கொள்” என்று சொன்னார்கள்.48 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 452,
			"arabicnumber": 452,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நம்முடைய பள்ளிவாசல்களிலோ அல்லது கடைவீதிகளிலோ அம்புடன் நடந்து செல்பவர், தமது கையால் அதன் முனையைப் பிடித்து (மறைத்து)க் கொள்ளட்டும்; எந்த முஸ்-மையும் அவர் காயப்படுத்திவிட வேண்டாம்.. இதை அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 453,
			"arabicnumber": 453,
			"text": "அபூசலமா பின் அப்திர் ரஹ்மான் பின் அவ்ஃப் (ரஹ்) அவர்கள் கூறியதாவது: (பள்ளிவாசலுக்குள் கவி பாடுவதை உமர் (ரலி) அவர்கள் கண்டித்தபோது கவிஞர்) ஹஸ்ஸான் பின் ஸாபித் (ரலி) அவர்கள் அபூஹுரைரா (ரலி) அவர்களி டம், “அல்லாஹ்வின் பெயரால் உங்களிடம் கேட்கிறேன்: (என்னிடம்) நபி (ஸல்) அவர்கள், ‘ஹஸ்ஸானே! அல்லாஹ்வின் தூதர் (ஆகிய என்) சார்பாக (எதிரிகளின் வசைக் கவிகளுக்கு) நீங்கள் (கவிதைகளாலேயே) பதிலளியுங்கள். இறைவா! ஹஸ்ஸானை ‘ரூஹுல் குதுஸ்’ (தூய ஆத்மா வானவர் ‘ஜிப்ரீல்’) மூலம் பலப்படுத்துவாயாக!’ என்று கூறியதை நீங்கள் செவியுற்றிருக்கிறீர் களா?” என்று கேட்டார்கள். அதற்கு அபூஹுரைரா (ரலி) அவர்கள், “ஆம் (செவியுற்றிருக்கிறேன்)” என்று பதிலளித் தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 455,
			"arabicnumber": 455,
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 456,
			"arabicnumber": 456,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (அடிமைப்பெண்) பரீரா, தனது விடுதலைப் பத்திரம் தொடர்பாக (அதில் குறிப்பிட்டுள்ள தொகையைச் செலுத்த உதவி கோரி) என்னிடம் வந்தார். நான், “நீ விரும்பினால் உன் உரிமையாளர்களுக்கு (முழுத் தொகையும்) நான் செலுத்தி விடுகிறேன். ஆனால், உன் வாரிசுரிமை (‘வலாஉ’) எனக்கே உரியதாகிவிட வேண்டும்” என்று கூறினேன். ஆனால், பரீராவின் உரிமையாளர்கள் என்னிடம், “நீங்கள் விரும்பினால் பரீரா செலுத்த வேண்டிய மீதித் தொகையைச் செலுத்தி (பரீராவை விடுதலை செய்து) விடலாம்” என்று கூறினார்கள். -(இதன் அறிவிப்பாளர்களில் ஒருவ ரான) சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் மற்றொரு முறை அறிவிக்கை யில், “நீங்கள் விரும்பினால் அவரை விடுதலை செய்துகொள்ளலாம். ஆனால், (பரீராவின்) வாரிசுரிமை எங்களுக்கே உரியதாகிவிட வேண்டும்.” என (பரீராவின் உரிமையாளர்கள் நிபந்தனையிட்டுக்) கூறியதாகச் சொன்னார்கள்.- தொடர்ந்து ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்தபோது, நான் அதைப் பற்றி அவர்களிடம் கூறினேன். அப்போது அவர்கள், “அவரை வாங்கி நீ விடுதலை செய்துவிடு. ஏனெனில், வாரிசுரிமை விடுதலை செய்தவருக்கே உரியது” என்று சொன்னார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பள்ளிவாச-லுள்ள) சொற்பொழிவு மேடைமீது நின்று (உரை நிகழ்த்தலானார்கள்:) “மக்களில் சிலருக்கு என்ன நேர்ந்துவிட்டது? இறைச் சட்டத்தில் இல்லாத நிபந்தனைகளை விதிக்கிறார்களே! யார் இறைச் சட்டத்தில் இல்லாத நிபந்தனைகளை விதிக்கிறாரோ அவருக்கு அதற்கான (அதை நிறைவேற்றக் கோரும்) உரிமை இல்லை; அவர் நூறு முறை நிபந்தனை விதித்தாலும் சரியே” என்று குறிப்பிட்டார்கள்.51 இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் மா-க் (ரஹ்) அவர்களது அறிவிப்பில், ‘சொற்பொழிவு மேடைமீது நபி (ஸல்) அவர்கள் ஏறியது’ பற்றிய குறிப்பு இல்லை. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 457,
			"arabicnumber": 457,
			"text": "கஅப் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: (அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில்) எனக்கு அப்துல்லாஹ் பின் அபீஹத்ரத் அல்அஸ்லமீ (ரலி) அவர்கள் தர வேண்டியிருந்த ஒரு கடனை (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ல் வைத்துத் திருப்பித் தரும்படி கேட்டேன். (இது தொடர்பாக எங்களிடையே வாக்கு வாதம் ஏற்பட்டு) எங்கள் இருவரின் குரல் களும் உயர்ந்தன. தமது வீட்டில் இருந்த அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்கள் குரலைக் கேட்டுவிட்டார்கள். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிருவரையும் நோக்கிப் புறப்பட்டார்கள். தமது அறையின் திரையை விலக்கி, ‘கஅப்!’ என்று அழைத்தார்கள். நான், “இதோ வந்துவிட்டேன், அல்லாஹ்வின் தூதரே!” என்று பதிலளித்தேன். அப்போது நபி (ஸல்) அவர்கள், “இதை (இந்த அளவை) உமது கடனி-ருந்து தள்ளுபடி செய்க!” என்று கூறி, பாதியளவு கடனைக் குறைத்துக்கொள்ளும்படி (என்னிடம் விரலால்) சைகை செய்தார்கள். “அவ்வாறே செய்துவிட்டேன், அல்லாஹ்வின் தூதரே!” என்று கூறினேன். பிறகு நபி (ஸல்) அவர்கள் (அப்துல்லாஹ் பின் அபீஹத்ரத் அவர்களை நோக்கி,) “எழுந்து சென்று பாதிக் கடனை அடைப்பீராக!” என்று சொன்னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 458,
			"arabicnumber": 458,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலைப் பெருக்குபவராக இருந்த ‘ஒரு கறுப்பு ஆண்’ அல்லது ‘ஒரு கறுப்புப் பெண்’ இறந்துவிட்டார். (அவர் இறந்த செய்தி நபி (ஸல்) அவர்களுக்குத் தெரியாம-ருந்தது.) ஆகவே, அவரைப் பற்றி (ஒரு நாள்) நபி (ஸல்) அவர்கள் விசாரித்தார்கள். அப்போது மக்கள், “அவர் இறந்துவிட்டார்” எனக் கூறினார்கள். நபி (ஸல்) அவர்கள், “அது பற்றி (முன்பே) என்னிடம் நீங்கள் அறிவித் திருக்கக் கூடாதா? ‘அவரது அடக்கத் தலத்தை’ அல்லது ‘அந்தப் பெண்மணி யின் அடக்கத் தலத்தை’ எனக்குக் காட்டுங்கள்” என்று கூறிவிட்டு, அவரது அடக்கத் தலத்திற்குச் சென்று அவருக்காக இறுதித் தொழுகை (ஜனாஸா) தொழுதார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 459,
			"arabicnumber": 459,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ‘அல்பகரா’ அத்தியாத்தின் (இறுதி) வசனங்கள் (2:275-281) வட்டி தொடர்பாக அருளப்பெற்றபோது, நபி (ஸல்) அவர்கள் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலுக்குப் புறப்பட்டு வந்து, அவற்றை மக்களுக்கு ஓதிக்காட்டினார்கள். பிறகு மது வியாபாரத்தைத் தடை செய்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 460,
			"arabicnumber": 460,
			"text": "அபூராஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: “(மஸ்ஜிதுந் நபவீ) பள்ளிவாசலை ‘ஓர் ஆண்’ அல்லது ‘ஒரு பெண்’ பெருக்கு பவராக இருந்தார்” என்று அபூஹுரைரா (ரலி) அவர்கள் கூறினார்கள். - ‘ஒரு பெண்மணி’ என்று அவர்கள் கூறியதாகவே நான் கருதுகிறேன்.- பிறகு அவரது அடக்கத் தலத்தில் நபி (ஸல்) அவர்கள் இறுதித் தொழுகை தொழுதது பற்றிய (மேற்கண்ட 458ஆவது) ஹதீஸைக் கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 461,
			"arabicnumber": 461,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) நபி (ஸல்) அவர்கள், “நேற்றிரவு முரட்டு ‘ஜின்’ ஒன்று என் தொழுகையை (இடையில்) துண்டிப்பதற் காகத் திடீரென்று வந்து நின்றது” என்றோ, அல்லது இதைப் போன்ற வார்த்தை யையோ கூறினார்கள். பிறகு “அதன் மீது அல்லாஹ் எனக்குச் சக்தியை வழங்கினான். நீங்கள் அனைவரும் காலையில் வந்து அதைக் காணும்வரை இந்த (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ன் தூண்களில் ஒன்றில் அதைக் கட்டிவைக்கலாம் என்று நினைத் தேன். அப்போது “இறைவா! எனக்குப்பின் வேறெவருக்கும் கிடைக்காத ஓர் ஆளுமையை எனக்கு நீ வழங்குவாயாக’ (38:35) என்று என் சகோதரர் சுலைமான் (அலை) அவர்கள் செய்த வேண்டுதல் என் நினைவுக்கு வந்தது” என்று கூறி னார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான ரவ்ஹ் பின் உபாதா (ரஹ்) அவர்கள், “ஆகவே, நான் அதை இழிந்த நிலையில் விரட்டியடித்துவிட்டேன்” என்றும் நபியவர்கள் கூறியதாக அறிவித்துள்ளார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 462,
			"arabicnumber": 462,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதவது: நபி (ஸல்) அவர்கள் நஜ்த் பகுதியை நோக்கிக் குதிரைப்படை ஒன்றை அனுப்பி வைத்தார்கள். அவர்கள் பனூ ஹனீஃபா குலத்தைச் சேர்ந்த (‘யமாமா’வாசிகளின் தலைவரான) ஸுமாமா பின் உஸால் எனப்படும் ஒரு மனிதரைக் கொண்டு வந்தார்கள். அவரை (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ன் தூண்களில் ஒன்றில் (மக்கள்) கட்டிவைத்தனர். நபி (ஸல்) அவர்கள் அவரை நோக்கி (மூன்று நாட்களாக வந்து பார்த்தார்கள். மூன்றாவது நாள்) வந்தபோது, ‘ஸுமாமாவை அவிழ்த்துவிடுங்கள்” என்று கூறினார்கள். அவர் பள்ளிவாசலுக்கு அருகி-ருந்த (அபூதல்ஹா (ரலி) அவர்களுக்குச் சொந்த மான) பேரீச்சந் தோட்டத்திற்குச் சென்று குளித்தார். பிறகு பள்ளிவாசலுக்குள் வந்து “அல்லாஹ்வைத் தவிர வேறு இறைவ னில்லை என்றும், முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் தூதர் என்றும் நான் உறுதி மொழிகிறேன்” என்றார். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 463,
			"arabicnumber": 463,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அகழ்ப் போரின்போது சஅத் பின் முஆத் (ரலி) அவர்கள் நாடி நரம்பில் தாக்கப்பட்டார்கள். அவரை அருகில்வைத்து நலம் விசாரிப்பதற்காக (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலில் (அவருக்கென) ஒரு கூடாரத்தை நபி (ஸல்) அவர்கள் அமைத்தார்கள் -பள்ளிவாசலில் பனூ ஃகிஃபார் குலத்தாருக்கென ஒரு கூடாரம் இருந்தது- சஅத் (ரலி) அவர்களின் (உடலில் இருந்து வழிந்தோடிய) இரத்தம் தான் அக்குலத்தாரை அதிர்ச்சியடையச் செய்தது. அப்போது அவர்கள், “கூடாரவாசி களே! உங்கள் பகுதியி-ருந்து எங்களை நோக்கி(ப் பாய்ந்து) வருகிறதே, இது என்ன?” என்று கேட்டுக்கொண்டே அங்கு சென்று பார்த்தபோது, தமது காயத்தி-ருந்து இரத்தம் வழிய சஅத் (ரலி) அவர்கள் இருந்தார்கள். அ(ந்த நோயிலேயே, அல்லது அந்தக் கூடாரத்)தி லேயே சஅத் (ரலி) அவர்கள் இறந்தார்கள். அத்தியாயம் : 7",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 464,
			"arabicnumber": 464,
			"text": "உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: “நான் நோயுற்றுள்ளேன்” என அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நான் முறையிட்டேன். அதற்கு அவர்கள், “மக்களுக்கப்பா-ருந்து வாகனத்தில் அமர்ந்து (கஅபாவைச்) சுற்றி (தவாஃப்) வருவாயாக!” என்று சொன்னார்கள். அவ்வாறே நான் சுற்றிவந்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ‘அத்தூர்’ எனும் (52ஆவது) அத்தியாத்தை ஓதியவாறு கஅபாவின் ஒரு பக்கத்தில் தொழுதுகொண்டிருந்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 465,
			"arabicnumber": 465,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களின் தோழர்களில் இருவர் நபி (ஸல்) அவர்களிடமிருந்து (விடைபெற்று) இருள் கப்பிய ஓர் இரவில் (தம் இல்லங்களுக்கு நடந்து)சென்றனர். அவ்விருவருடனும் இரு விளக்குகளைப் போன்றவை அவர்களுக்கு முன்னால் ஒளிவீசிச் சென்றன. அவர்கள் (வழியில்) பிரிந்து சென்றபோது, அவர்கள் தம் வீட்டாரிடம் போய்ச் சேரும்வரை ஒவ் வொருவருடனும் ஓர் ஒளி (மற்றொன்றை விட்டுப் பிரிந்து அவர்களுடன்) சென்றது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 466,
			"arabicnumber": 466,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (இறப்பதற்குமுன் நோய்வாய்ப்பட்டிருந்தபோது மக்களுக்கு) உரை நிகழ்த்தினார்கள். அதில், “அல்லாஹ் ஓர் அடியாருக்கு இந்த உலகம், அல்லது தன்னிடமிருப்பது ஆகிய இரண்டில் ஏதேனும் ஒன்றைத் தேர்ந்தெடுத்துக் கொள்ளுமாறு விருப்ப உரிமை அளித் தான். அ(ந்த அடியாரான)வர், அல்லாஹ்விடம் இருப்பதையே தேர்ந்தெடுத்துக் கொண்டார்” என்று சொன்னார்கள். (இதைக் கேட்ட) உடன், அபூபக்ர் (ரலி) அவர்கள் அழுதார்கள். அப்போது நான் எனக்குள்ளே, “அல்லாஹ் ஓர் அடியாருக்கு இந்த உலகம், அல்லது தன்னிடமிருப்பது ஆகிய இரண்டில் ஏதேனும் ஒன்றைத் தேர்ந்தெடுத்துக்கொள்ள விருப்ப உரிமை அளித்தபோது அ(ந்த அடியாரன)வர், அல்லாஹ்விடமிருப்பதைத் தேர்ந்தெடுத் துக்கொண்டால், அதற்காக இந்தப் பெரியவர் ஏன் அழ வேண்டும்.?” என்று வினவிக்கொண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தான் அந்த (விருப்ப உரிமை அளிக்கப் பட்ட) அடியாராக இருந்தார்கள். (நபி (ஸல்) அவர்கள் தமது இறப்பைப் பற்றியே குறிப்படுகிறார்கள் என்பதை அபூபக்ர் (ரலி) அவர்கள் அறிந்துகொண்டார்கள். ஏனெனில்) அபூபக்ர் (ரலி) அவர்கள் எங்களில் மிகவும் அறிந்தவராக இருந்தார்கள். அப்போது நபி (ஸல்) அவர்கள், “அபூபக்ர் அவர்களே! அழாதீர்கள்” என்று கூறிவிட்டு, “தமது நட்பிலும் செல்வத்திலும் எனக்கு மக்களிலேயே பேருதவியாளராக இருப்பவர் அபூபக்ரே ஆவார். ஒருவரை என் சமுதாயத்தாரில் நான் உற்ற நண்பராக ஆக்கிக்கொள்ள விரும்பியிருந்தால், அபூபக்ர் அவர்களையே ஆக்கிக் கொண்டிருப்பேன். ஆயினும், (அதை விடச் சிறந்த) இஸ்லாத்தின் சகோதரத்துவமும் அதனால் ஏற்படும் பாச உணர்வும் (எனக்கும் அபூபக்ருக்கும் இடையே ஏற்கெனவே) இருக்கத்தான் செய்கிறது. (எனது) இந்தப் பள்ளிவாச-ல் எந்தச் சிறு நுழைவாயிலும் அடைக்கப்படாமல் இருக்க வேண்டாம்; அபூபக்ரின் வாசலைத் தவிர” என்று சொன்னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 467,
			"arabicnumber": 467,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எந்த நோயில் இறந்தார்களோ அந்த நோயின்போது தமது தலையில் ஒரு துணியால் கட்டுப்போட்டவர்களாக (தமது இல்லத்தி-ருந்து) புறப்பட்டு வந்து சொற்பொழிவு மேடை (மிம்பர்)மீது அமர்ந்து அல்லாஹ்வைப் போற்றிப் புகழ்ந்தார்கள். பிறகு “தமது நட்பிலும் செல்வத்திலும் எனக்கு அபூபக்ர் பின் அபீகுஹாஃபாவை விட வேறெவரும் பேருதவி புரிந்தவர் கிடையாது. மக்களில் ஒருவரை நான் (என்) உற்ற நண்பராக ஆக்கிக்கொள்ள விரும்பியிருந்தால், அபூபக்ர் அவர் களையே உற்ற நண்பராக ஆக்கிக் கொண்டிருப்பேன். என்றாலும், இஸ்லாமிய அடிப்படையிலான நேசமே சிறந்ததாகும்” என்று கூறிவிட்டு, “இந்தப் பள்ளிவாச-ல் என்னிடம் வருவதற்காக உள்ள எல்லா சிறு நுழைவாயில்களையும் அடைத்து விடுங்கள்; அபூபக்ரின் நுழைவாயிலைத் தவிர” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 468,
			"arabicnumber": 468,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மக்காவை வெற்றி கொண்டு) மக்காவுக்கு வந்தபோது உஸ்மான் பின் தல்ஹா (ரலி) அவர்களை அழைத்தார்கள். அவர் (வந்து) இறையில்லம் கஅபாவின் கதவைத் திறந்தார். பிறகு நபி (ஸல்) அவர்களும், பிலால், உசாமா பின் ஸைத், உஸ்மான் பின் தல்ஹா (ரலி) ஆகியோர் உள்ளே சென்று கதவைத் தாழிட்டுக்கொண்டனர். அதில் சிறிது நேரம் இருந்துவிட்டுப் பிறகு அனைவரும் வெளியே வந்தனர். நான் விரைந்து வந்து பிலால் (ரலி) அவர்களிடம், (‘நபி (ஸல்) அவர்கள் கஅபாவினுள் தொழுதார்களா?’ என்று) கேட்டேன். அதற்கு பிலால் (ரலி) அவர்கள், “(ஆம்) அதனுள் தொழுதார்கள்” என்று பதிலளித்தார்கள். “எ(ந்த இடத்)தில் தொழுதார்கள்?” என்று கேட்டதற்கு, ‘இரண்டு தூண்களுக்கிடையே’ என்று பிலால் (ரலி) அவர்கள் கூறினார்கள். அப்போது “எத்தனை ரக்அத்கள் தொழு தார்கள்?” என்று கேட்கத் தவறிவிட்டேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 469,
			"arabicnumber": 469,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நஜ்த் பகுதியை நோக்கி குதிரைப் படை ஒன்றை அனுப்பிவைத்தார்கள். அவர்கள் (சென்று) பனூ ஹனீஃபா குலத்தை சேர்ந்த (யமாமாவாசிகளின் தலைவர்) ஸுமாமா பின் உஸால் எனப்படும் ஒரு மனிதரைக் கொண்டுவந்தனர். அவரை (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ன் தூண்களில் ஒன்றில் கட்டிவைத்தனர். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 470,
			"arabicnumber": 470,
			"text": "சாயிப் பின் யஸீத் (ரலி) அவர்கள் கூறியதாவது: நான் (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ல் நின்றுகொண்டிருந்தேன். அப்போது யாரோ ஒருவர் என்மீது சிறு கல்லை வீசினார். நான் (திரும்பிப்) பார்த்தபோது அங்கே (கலீஃபா) உமர் (ரலி) அவர்கள் இருந்தார்கள். “நீர் சென்று (அதோ) அந்த இருவரையும் என்னிடம் அழைத்து வருவீராக” என்றார்கள். அவ்வாறே நான் அவ்விருவரையும் அழைத்துக்கொண்டு உமர் (ரலி) அவர்களிடம் வந்தேன். அப்போது உமர் (ரலி) அவர்கள் (அவ்விருவரிடமும்), ‘நீங்கள் யார்?’ அல்லது ‘நீங்கள் எந்த ஊரைச் சேர்ந்தவர் கள்?’ என்று கேட்டார்கள். அதற்கு அவர்கள் இருவரும், ‘நாங்கள் தாயிஃப்வாசிகள்’ என்று பதிலளித்தனர். அப்போது உமர் (ரலி) அவர்கள், “(நல்ல வேளை! நீங்கள் வெளியூர்க்காரர் களாய்ப் போய்விட்டீர்கள்) நீங்கள் இந்த (மதீனா) நகரைச் சேர்ந்தவர்களாயிருந் திருந்தால், நிச்சயமாக நான் உங்கள் இருவரையும் (சாட்டையால்) அடித்திருப் பேன்; (ஏனெனில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் பள்ளிவாச-ல் நீங்கள் இருவரும் குரலை உயர்த்திப் பேசிக் கொண்டிருந்தீர்கள்” என்று சொன்னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 471,
			"arabicnumber": 471,
			"text": "கஅப் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: எனக்கு அப்துல்லாஹ் பின் அபீ ஹத்ரத் (ரலி) அவர்கள் தர வேண்டி யிருந்த கடன் ஒன்றை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ல் வைத்து திருப்பிச் செலுத்தும்படி கேட்டேன். (இது தொடர்பாக எங்களிடையே வாக்குவாதம் ஏற்பட்டு) எங்கள் இருவரின் குரல்களும் உயர்ந்தன. தமது வீட்டில் இருந்த அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்கள் குரலைக் கேட்டுவிட்டார்கள். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்கள் இருவரையும் நோக்கிப் புறப்பட்டார்கள். (இதற்காக) தமது அறையின் திரையை விலக்கி, “கஅப் பின் மா-க்! கஅப்!” என்று அழைத்தார்கள். உடனே நான், “இதோ வந்துவிட்டேன், அல்லாஹ்வின் தூதரே!” என்றேன். அப்போது அவர்கள் “உமது கடனி-ருந்து பாதியைத் தள்ளுபடி செய்க” என்று சைகை செய்தார்கள். “அவ்வாறே செய்து விட்டேன், அல்லாஹ்வின் தூதரே!” என்று நான் கூறினேன். (பிறகு) நபி (ஸல்) அவர்கள் (அப்துல்லாஹ் பின் அபீஹத் ரத்தை நோக்கி), “எழுந்து சென்று பாதிக் கடனைச் செலுத்துவீராக” என்றார்கள்.53 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 472,
			"arabicnumber": 472,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நபி (ஸல்) அவர்கள் சொற் பொழிவு மேடை (மிம்பர்)மீது இருந்தபோது ஒரு மனிதர், “இரவுத் தொழுகை பற்றித் தாங்கள் என்ன கூறுகிறீர்கள்?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “(இரவுத் தொழுகை) இரண்டிரண்டு ரக்அத்களாகும். சுப்ஹு (நேரம் நுழைந்து விட்டது) பற்றி அஞ்சினால் (இறுதியில்) ஒரு ரக்அத் தொழுதுகொள்ள வேண்டும். அவர் முன்னர் தொழுதவற்றை அது ஒற்றையாக ஆக்கிவிடும்” என்றார்கள். (இதன் அறிவிப்பாளரான) நாஃபிஉ (ரஹ்) அவர்கள் கூறுகிறார்கள்: இப்னு உமர் (ரலி) அவர்கள், “உங்களின் இறுதித் தொழுகையாக ‘வித்ரை’ ஆக்கிக்கொள்ளுங்கள்; ஏனெனில், நபி (ஸல்) அவர்கள் இவ்வாறே கட்டளை யிட்டார்கள்” என்று கூறுவார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 473,
			"arabicnumber": 473,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மஸ்ஜிதுந் நபவீ பள்ளிவாசலில்) உரையாற்றிக்கொண்டி ருக்கையில் அவர்களை நோக்கி ஒரு மனிதர் வந்து, “இரவுத் தொழுகை எவ்வாறு (தொழ வேண்டும்)?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “இரண்டி ரண்டு ரக்அத்களாகத் தொழ வேண்டும்; சுப்ஹு தொழுகை(யின் நேரம் நுழைந்து விட்டது) பற்றி நீங்கள் அஞ்சினால் (இறுதி யில்) வித்ருக்காக ஒரு ரக்அத் தொழுது கொள்ளுங்கள்! நீங்கள் தொழுது முடித்த வற்றை அது ஒற்றையாக ஆக்கிவிடும்” என்றார்கள்.54 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், ‘நபி (ஸல்) அவர்கள் பள்ளி வாசலில் இருந்தபோது ஒரு மனிதர் அவர்களைச் சப்தமிட்டு அழைத்து’ என இடம்பெற்றுள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 474,
			"arabicnumber": 474,
			"text": "அபூவாக்கித் அவ்ஃப் பின் அல்ஹாரிஸ் அல்லைஸீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ல் (மக்களுடன் வட்டமாக அமர்ந்து) இருந்தபோது, மூன்று பேர் (அவர்களை நோக்கி) வந்தனர். (அவர்களில்) இருவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை முன்னோக்கி வந்தனர். மற்றொருவர் (அலட்சியப்படுத்திவிட்டுச்) சென்றுவிட்டார். பிறகு அவ்விருவரில் ஒருவரோ வட்டமாக அமர்ந்திருந்த அந்த அவையில் ஓர் இடைவெளி இருப்பதைக் கண்டு அதில் அமர்ந்துகொண்டார். மற்றவரோ (வெட்கப் பட்டுக்கொண்டு) பின்னால் போய்விட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தமது பேச்சை) முடித்ததும் கூறினார்கள்: (சற்று முன்னர் வந்த) அந்த மூன்று பேரைப் பற்றி உங்களுக்கு நான் சொல்லட் டுமா? அவர்களில் ஒருவரோ, அல்லாஹ் வின் பக்கம் ஒதுங்கினார்; அல்லாஹ்வும் அவரை அரவணைத்துக்கொண்டான். மற்றொருவரோ வெட்கப்பட்டு (பின்னால் போய் உட்கார்ந்து)கொண்டார். எனவே, அல்லாஹ்வும் அவர் விஷயத்தில் (கருணைகாட்ட) வெட்கப்பட்டான். மூன்றாமவரோô (காரணமின்றி இந்த அவையை) அலட்சியப்படுத்தினார். எனவே, அல்லாஹ்வும் அவரை அலட்சி யம் செய்துவிட்டான். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 475,
			"arabicnumber": 475,
			"text": "அப்துல்லாஹ் பின் ஸைத் பின் ஆஸிம் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ல் ஒரு கா-ன்மேல் இன்னொரு காலைப் போட்டுக்கொண்டு (கீழாடை விலகாதவாறு) மல்லாந்து படுத்து (ஓய்வெடுத்துக்)கொண்டிருந்ததை நான் கண்டேன். சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் கூறுகிறார்கள்: உமர் (ரலி) அவர்களும் உஸ்மான் (ரலி) அவர்களும் இவ்வாறு செய்பவர்களாக இருந்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 476,
			"arabicnumber": 476,
			"text": "நபி (ஸல்) அவர்களின் துணைவி யார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: என் பெற்றோர் (அபூபக்ர்-உம்மு ரூமான்) எனக்கு விவரம் தெரிந்தது முதல் (இஸ்லாமிய) மார்க்கத்தைக் கடைப்பிடிப்ப வர்களாகவே இருந்தனர். பக-ன் இரு பக்கங்களான காலையிலும் மாலையிலும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் வராமல் (மக்காவில்) எங்களின் எந்த நாளும் கழிந்ததில்லை. பிறகு அபூபக்ர் (ரலி) அவர்களுக்கு ஏதோ (யோசனை) தோன்றியது. தமது வீட்டு முற்றத்தில் தொழுமிடம் ஒன்றை உருவாக்கி அதில் தொழுது கொண்டும் குர்ஆனை ஓதிக்கொண்டும்வந்தார்கள். அப்போது இணைவைப்பாளர்களின் மனைவி, மக்கள் அபூபக்ர் (ரலி) அவர்களைப் பார்த்து ஆச்சரியப்பட்டு அவர்களைச் சூழ்ந்து (வேடிக்கை பார்த்துக்கொண்டு) நிற்பர். அபூபக்ர் (ரலி) அவர்கள் குர்ஆன் ஓதும்போது தம் கண்களைக் கட்டுப்படுத்த முடியாமல் (கண்ணீர் உகுத்த வண்ணம்) அதிகமாக அழக்கூடியவராக இருந்தார்கள். (அபூபக்ர் அவர்களின்) இந்த நடவடிக்கை (எங்கே தம் மனைவி, மக்களை மதம் மாறச் செய்துவிடுமோ என்ற அச்சம்) இணைவைப்பாளர்களான குறைஷித் தலைவர் களை பீதிக்குள்ளாக்கியது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 477,
			"arabicnumber": 477,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒருவர் தமது வீட்டில் தொழுவதை விடவும், தமது கடைத்தெருவில் தொழு வதைவிடவும் ‘ஜமாஅத்துடன்’ (கூட்டுத் தொழுகை) தொழுவது, மதிப்பில் இருபத்து ஐந்து (மடங்கு தொழுகைகள்) கூடுதலாகும். ஏனெனில், உங்களில் ஒருவர் அங்கத் தூய்மை (உளூ) செய்து, அதைச் செம்மை யாகச் செய்து, தொழுகின்ற ஒரே நோக்கத் துடன் பள்ளிவாசலுக்கு வந்தால், அவர் பள்ளிவாசலுக்குள் நுழையும்வரை எடுத்து வைக்கும் ஒவ்வோர் எட்டுக்கும் ஒரு தகுதியை அவருக்கு அல்லாஹ் உயர்த்து கிறான்; ஒரு பாவத்தை அவரை விட்டு நீக்குகிறான். அவர் பள்ளிவாசலில் நுழைந்துவிட்டால், அவர் (கூட்டுத்) தொழுகையை எதிர்பார்த்து தம்மைக் கட்டுப்படுத்திக்கொண்டிருக்கும்வரை அவர் தொழுது கொண்டிருப்பவராகவே கருதப்படுகிறார். மேலும் அவர் (வெளியேறிவிடாமல்) எந்த இடத்தில் தொழுகின்றாரோ அந்த இடத்திலேயே இருக்கும்வரை, அவருக் காக வானவர்கள் பிரார்த்தனை செய்கி றார்கள். ஆனால், (அங்கத் தூய்மையை அகற்றிவிடக்கூடிய) சிறுதுடக்கு அவருக்கு ஏற்படாமல் இருக்க வேண்டும். அப்போது வானவர்கள், “இறைவா! இவரை மன்னிப்பாயாக! இவருக்குக் கருணை புரிவாயாக! என்று பிரார்த்திக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 479,
			"arabicnumber": 479,
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் கைவிரல்களைக் கோத்துக்காட்டி) “அப்துல்லாஹ் பின் அம்ரே! மக்களில் மிகவும் மட்டமானவர்களுடன் இப்படி நீர் (சேர்ந்து) வாழ நேர்ந்தால், உமது நிலை எப்படியிருக்கும்?” என்று கேட்டார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 481,
			"arabicnumber": 481,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளர்கள் ஒருவருக்கொருவர் (துணை நிற்கும் விஷயத்தில்) ஒரு கட்டடத்தைப் போன்றவர்கள் ஆவர். அதன் ஒரு பகுதி மற்றொரு பகுதிக்கு வலுவூட்டுகிறது. (இப்படிக் கூறியபோது) நபி (ஸல்) அவர்கள் தம் (இரு) கைவிரல்களை, ஒன்றுடன் ஒன்றைக் கோத்துக்காட்டி னார்கள். இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 482,
			"arabicnumber": 482,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு மாலைத் தொழுகைகளில் ஒன்றை (லுஹ்ர் அல்லது அஸ்ர்) தொழுவித்தார்கள். - (இதன் அறிவிப்பாளரான) முஹம்மத் பின் சீரீன் (ரஹ்) அவர்கள் கூறுகிறார்கள்: அந்தத் தொழுகையின் பெயரை அபூஹுரைரா (ரலி) அவர்கள் குறிப்பிட்டார்கள். ஆனால், நான்தான் அதை மறந்துவிட்டேன்- (நான்கு ரக்அத்களுடைய அத்தொழு கையை) எங்களுக்கு இரண்டு ரக்அத் களாகத் தொழுவித்துவிட்டு ‘சலாம்’ கொடுத்துவிட்டார்கள். உடனே எழுந்து பள்ளிவாசலில் அகலவாக்கில் போடப்பட்டிருந்த ஒரு மரக்கட்டையை நோக்கிச் சென்று, ஏதோ கோபத்தி-ருப்பவரைப் போன்று அதில் சாய்ந்துகொண்டார்கள். தமது வலக் கரத்தை இடக் கரத்தின் மீது வைத்து, கை விரல்களைப் பின்னிக் கோத்துக்கொண்டார்கள். மேலும், தமது வலக் கன்னத்தை இடப் புறங்கையின் மீது வைத்துக்கொண்டார்கள். அவசரமாகச் செல்பவர்கள் பள்ளிவாசலின் தலைவாயில்கள் வழியாக வெளியேறியபோது, “தொழுகை குறைக்கப்பட்டுவிட்டது (போலும்)” என்று கூறினர். அந்தக் கூட்டத்தில் அபூபக்ர் (ரலி), உமர் (ரலி) ஆகியோரும் இருந்தனர். ஆனால், (இது பற்றி) நபி (ஸல்) அவர்களிடம் பேச அவர்களிருவரும் (மரியாதைக்காக) அஞ்சினர். அந்தக் கூட்டத்திலேயே நீளமான இரு கைகளை உடைய ஒரு மனிதர் இருந்தார். அவர் ‘துல்யதைன்’ (இரு கையாளர்) என்று அழைக்கப்படுவார். அவர், “நீங்கள் மறந்துவிட்டீர்களா, அல்லது தொழுகை சுருக்கப்பட்டுவிட்டதா, அல்லாஹ்வின் தூதரே?” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “நான் மறக்கவுமில்லை; (தொழுகை) சுருக்கப்படவு மில்லை” என்று கூறிவிட்டு (மக்களைப் பார்த்து), “துல்யதைன் சொல்வதைப் போன்றுதான் நடந்ததா?” என்று கேட்க, மக்கள் ‘ஆம்’ என்று பதிலளித்தனர். உடனே (தொழுமிடத்தை நோக்கி) முன்னேறிச் சென்று, விடுபட்டதைத் தொழுதுவிட்டு, ‘சலாம்’ கொடுத்தார்கள். பிறகு தக்பீர் (‘அல்லாஹு அக்பர்’ என்று) சொல்- ‘(வழக்கமாக) தாம் சஜ்தா (சிரவணக்கம்) செய்வதைப் போன்று’ அல்லது ‘அதைவிட நீண்ட (நேரம்)’ சஜ்தா செய்தார்கள். பிறகு (சஜ்தாவி-ருந்து) தமது தலையை உயர்த்தி ‘தக்பீர்’ சொன்னார்கள். பின்னர் ‘தக்பீர்’ சொல்- ‘(வழக்கமாகத்) தாம் செய்யும் சஜ்தாவைப் போன்று’ அல்லது ‘அதைவிட நீண்ட (நேரம்)’ (மறதிக்குரிய) சஜ்தா செய்தார்கள். பிறகு தமது தலையை உயர்த்தியவாறு தக்பீர் சொன்னார்கள். மக்கள் சில சந்தர்ப்பங்களில் முஹம்மத் பின் சீரீன் (ரஹ்) அவர்களிடம், “(இறுதியாக நபி -ஸல்) அவர்கள் ‘சலாம்’ கொடுத்தார்களா?” என்று கேட்பார்கள். அதற்கு முஹம்மத் பின் சீரீன் (ரஹ்) அவர்கள், “இம்ரான் பின் ஹுஸைன் (ரலி) அவர்களிடமிருந்து எமக்குக் கிடைத்த ஹதீஸில்தான், (மறதிக்குரிய சஜ்தா செய்த) பின்னர் நபியவர்கள் சலாம் கொடுத்தார்கள் என்று இடம்பெற்றுள்ளது. (அபூஹுரைராவின் அறிவிப்பில் அவ்வாறு இல்லை)” என்று பதிலளிப்பார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 483,
			"arabicnumber": 483,
			"text": "மூசா பின் உக்பா (ரஹ்) அவர்கள் கூறியதாவது: சா-ம் பின் அப்தில்லாஹ் (ரஹ்) அவர்கள் சாலையோர இடங்கள் சிலவற்றைத் தேடிப்பிடித்து அங்கே தொழுவதை நான் பார்த்திருக்கிறேன். மேலும், தம் தந்தை (அப்துல்லாஹ் பின் உமர் -ர-) அவர்கள் அந்த இடங்களில் தொழுதுவந்ததாகவும் அவ்விடங்களில் நபி (ஸல்) அவர்கள் தொழுததைத் தம் தந்தை பார்த்திருப்பதாகவும் குறிப்பிடு வார்கள். அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அவ்விடங்களில் தொழுது வந்ததாக நாஃபிஉ (ரஹ்) அவர்களும் என்னிடம் அறிவித்துள்ளார்கள். சா-ம் (ரஹ்) அவர்களிடம் நான் இது பற்றிக் கேட்டபோது, (அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் தொழுத) அனைத்து இடங்களைப் பற்றியும் நாபிஃஉ (ரஹ்) அவர்கள் கூறியதைப் போன்றே கூறி னார்கள். என்றாலும், (மதீனாவுக்கு அருகில் உள்ள) ‘ஷரஃபுர் ரவ்ஹா’ எனும் சிற்றூரில் அமைந்த பள்ளிவாசல் விஷயத்தில் இருவரும் மாறுபட்ட கருத்தைத் தெரிவித்தனர். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 484,
			"arabicnumber": 484,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களால் விடுதலை செய்யப்பட்ட அவர்களின் முன்னாள் அடிமையான) நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உம்ராவுக்காக (மக்கா செல்லும்போது) ‘துல்ஹுலைஃபா’ எனும் இடத்தில் உள்ள கருவேல மரமொன்றுக்குக் கீழே ‘துல்ஹுலைஃபா’ பள்ளிவாசல் (இன்று) அமைந்துள்ள இடத்தில் இறங்கி இளைப்பாறுவார்கள். தமது (‘விடைபெறும்’) ஹஜ்ஜுக்காகச் சென்றபோதும் (இங்கு) இறங்கி இளைப்பாறினார்கள். அறப்போரோ அல்லது ஹஜ்ஜோ அல்லது உம்ராவோ செய்துவிட்டு அந்தப் பாதையில் திரும்பிவ(ர நேர்)ந்தால் ‘பத்னுல் வாதீ’ (அகீக்) பள்ளத்தாக்கு வழியாக இறங்குவார்கள். ‘பத்னுல் வாதீ’ பள்ளத் தாக்கைத் தாண்டியதும் அதன் கிழக்குக் கரையிலுள்ள விசாலமான ஓடையில் தமது ஒட்டகத்தைப் படுக்கவைத்து அதிகாலை யாகும்வரை ஓய்வெடுப்பார்கள். அந்த இடம், கற்களாலான இந்தப் பள்ளிவாச-ன் அருகிலுமில்லை; பள்ளி வாசல் அமைந்துள்ள மேட்டிலுமில்லை. அங்கு பெரிய பள்ளம் ஒன்று இருந்தது. அதன் அருகில் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் தொழுவார்கள். அதன் நடுவே மணற்குவியல் இருந்தது. அங்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுவார்கள். (பின்னர்) விசாலமான அந்த ஓடையில் இருந்த அந்த இடத்தில் வெள்ளம் புகுந்து அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் தொழுதுவந்த அந்த இடத்தைப் புதையுறச் செய்துவிட்டது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 485,
			"arabicnumber": 485,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: “நபி (ஸல்) அவர்கள் ‘ஷரஃபுர் ரவ்ஹா’ எனும் சிற்றூரில் உள்ள (பெரிய) பள்ளி வாசலுக்கு அருகில் இருக்கும் சிறிய பள்ளிவாசல் அமைந்துள்ள இடத்தில் தொழுதிருக்கிறார்கள் என்று அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் என்னிடம் கூறினார்கள். நபி (ஸல்) அவர்கள் தொழுத அந்த இடத்தின் அடையாளத்தைப் பற்றிக் கூறுகையில், “(நீ மதினாவி-ருந்து) மக்கா செல்லும் வழியில் பாதையின் வலப் பக்கம் அமைந்த பள்ளிவாசலில் (கிப்லா நோக்கி) நீ தொழுதுகொண்டிருக்கும்போது அந்த இடம் உனது வலப் பக்கத்தில் இருக்கும். (நபி (ஸல்) அவர்கள் தொழுத) அந்த இடத்திற்கும் அந்தப் பெரிய பள்ளிவாசலுக்கும் இடையே கல்லெறியும் தூரம்தான் உள்ளது” என்றோ, அல்லது அதைப் போன்ற வேறொரு வார்த்தையோ குறிப்பிட்டார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 486,
			"arabicnumber": 486,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: ‘இர்க்’ (‘இர்க்குல் ழப்யா’ எனும் பள்ளத்தாக்கு அமைந்துள்ள) பகுதியில் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் தொழுவார்கள். அந்த ‘இர்க்’ பள்ளத் தாக்கின் எல்லை நீ (மதீனாவி-ருந்து) மக்கா செல்லும் வழியில், ‘அர்ரவ்ஹா’ கிராமத்தின் எல்லைக்கும் அங்குள்ள பள்ளிவாசலுக்கும் மத்தியில் அமைந் துள்ள சாலையில் முடிவடைகிறது. (அந்த ‘இர்க்’ பள்ளத்தாக்கில் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் தொழுதார்கள்.) அந்த இடத்தில் ஒரு பள்ளிவாசல் கட்டப்பட்டிருந்தது. ஆனால், அந்தப் பள்ளிவாச-ல் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் தொழுவதில்லை. தமது இடப் புறத்தில் தமக்குப் பின்னால் அந்தப் பள்ளிவாசல் இருக்கும் விதத்தில் அந்தப் பள்ளிவாசலைவிட (சற்று) முன்னால் நின்றுகொண்டு அந்த ‘இர்க்’ பள்ளத்தாக்கை நோக்கியவாறு அவர்கள் தொழுவார்கள். ‘அர்ரவ்ஹா’ கிராமத்தி-ருந்து அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் (மக்காவுக்குப்) புறப்பட்டுச் செல்லும்போது (‘இர்க்’ எனும்) அந்த இடத்தைச் சென்றடையும்முன் அவர்கள் ‘லுஹ்ர்’ தொழுகையைத் தொழமாட்டார்கள். (‘இர்க்’ வந்ததும்) அங்குதான் லுஹ்ர் தொழுவார்கள். மக்காவி-ருந்து (மதீனாவுக்குத்) திரும்பி வரும்போது சுப்ஹு நேரத்திற்கு சற்று முன்னர் அல்லது சஹர் நேரத்தின் இறுதிப் பகுதியில் அந்த (‘இர்க்’ எனும்) இடத்தைக் கடக்க நேரிட்டால், அங்கேயே சற்று நேரம் ஓய்வெடுப்பார்கள். (நேரம் வந்ததும்) அந்த இடத்தில் சுப்ஹு தொழுகையை நிறைவேற்றுவார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 487,
			"arabicnumber": 487,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மதீனாவி-ருந்து மக்கா செல்லும்) சாலையின் எதிர்த் திசையில் வலப் புறம் அமைந்துள்ள ‘ருவைஸா’ எனும் சிற்றூருக்குச் சற்று அருகில் உள்ள ஒரு பெரிய மரத்தின்கீழ் இறங்கித் தங்குவார்கள். அந்த இடம் விசாலமானதாகவும் பள்ளமானதாகவும் இருந்தது. நபி (ஸல்) அவர்கள் தங்கிய அந்த இடம் அவ்வூரி-ருந்து இரண்டு மைல் தொலைவில் இருந்தது. அங்கிருந்த மேட்டுப் பகுதியிலிருந்தே நபியவர்கள் புறப்படுவார்கள். அந்த மரத்தின் மேற் கிளைகள் முறிந்து அதன் மையப் பகுதிக்குள் கவிழ்ந்து கிடந்தன. அதன் அடிமரம் நின்றுகொண்டிருந்தது, அந்த அடி மரத்தில் அதிகமான மணல் குவிந்திருந்தது. இதை நாஃபிஉ (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 488,
			"arabicnumber": 488,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: “நீ (மதீனாவி-ருந்து) ‘ஹள்பா’ எனும் மலைக்குச் செல்லும் வழியில் ‘அர்ஜ்’ எனும் சிற்றூருக்குப் பின்புறத்திலுள்ள (மேலிருந்து பாயும்) நீரோடையின் ஓரத்தில் நபி (ஸல்) அவர்கள் தொழுதார்கள். அந்தத் தொழுமிடத்திற்கு அருகில் இரண்டோ மூன்றோ மண்ணறைகள் (கப்று) இருந்தன. அவற்றின்மேல் கற்பாறைகள் இருந்தன. அந்தப் பள்ளிவாசல் சாலையின் வலப் புறம் அமைந்திருந்தது. அந்தச் சாலையின் ஓரங்களில் மரங்கள் இருந்தன” என்று அப்துல்லாஹ் (ரலி) அவர்கள் என்னிடம் கூறினார்கள். அந்த மரங்களுக்கு நடுவே அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் நண்பகலில் சூரியன் உச்சி சாய்ந்ததும் ‘அர்ஜ்’ எனும் சிற்றூரிலிருந்து புறப்பட்டு அந்தப் பள்ளிவாசலில் லுஹ்ர் தொழுவார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": 489,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், (ஷாம் செல்லும்) சாலையின் இடப் புறம் ‘ஹர்ஷா’ எனும் மலைக்கு அருகில் ஓடும் நீரோடையை ஒட்டியுள்ள மரங்களுக்குக் கீழே இறங்கித் தங்கினார்கள். அந்த நீரோடை ‘ஹர்ஷா’ எனும் மலையின் அடிவாரத்தை ஒட்டிச் செல்கிறது. (நபி (ஸல்) அவர்கள் தொழுத) அந்த இடத்திற்கும் சாலைக்கும் மத்தியில் கிட்டத்தட்ட அம்பெய்தால் சென்றடையும் தொலைவே இருந்தது. அங்கிருந்த மரங்களில் சாலைக்கு மிக நெருங்கியதும் மிக நெடியதுமான ஒரு மரத்திற்குப் பக்கத்தில் தொழுவது அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களின் வழக்கம். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": 490,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: “ ‘மர்ருழ் ழஹ்ரான்’ எனும் சிற்றூருக்கு அருகிலுள்ள நீரோடையை ஒட்டி நபி (ஸல்) அவர்கள் தங்கி இளைப்பாறு வார்கள். அந்த நீரோடை (மக்காவி-ருந்து) மதீனா செல்லும்போது (மர்ருழ் ழஹ்ரான் தாண்டியதும்) ‘ஸஃப்ராவாத்’ எனும் இடத்தைக் கடந்ததும். மக்கா நோக்கிச் செல்லும் சாலையின் இடப்புறம் அமைந்துள்ளது. (நபி (ஸல்) அவர்கள் தங்கி இளைப்பாறிய) அந்த இடத்திற்கும் சாலைக்கும் இடையே கல்லெறியும் தொலைவே உண்டு” என அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் என்னிடம் கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": 491,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: “நபி (ஸல்) அவர்கள் (மதீனாவி-ருந்து) மக்கா செல்லும்போது ‘தூத்துவா’ என்ற இடத்தில் இரவு நேரம் தங்கிவிட்டு, அங்கேயே காலையில் சுப்ஹு தொழுகையைத் தொழுவார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுத இடம் அங்குள்ள கெட்டியான மேட்டின் மீது அமைந் துள்ளது. அங்கு (தற்போது) பள்ளிவாசல் கட்டப்பட்டுள்ள இடம் (நபி (ஸல்) அவர்கள் தொழுத) அந்த இடமன்று; அந்தப் பள்ளிவாசலுக்குக் கீழ்ப்புறமாக அமைந்துள்ள கெட்டியான மேடே (நபி (ஸல்) அவர்கள் தொழுத) அந்த இடமாகும்” என அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் என்னிடம் கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": 492,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், இரு மலைக் கணவாய்களை முன்னோக்கி (நின்று இறைவனை வணங்கி)னார்கள். அந்த இடத்திற்கும் உயரமான அந்த மலைக்கும் இடையே கஅபாவின் திசை அமைந் திருந்தது. எனவே, நான் (அந்த இடத்தில் தொழும்போது) அங்கு தற்போது கட்டப் பட்டுள்ள பள்ளிவாச-ன் இடப் பக்கத்தை அந்த மேட்டின் ஒரு பகுதியில் வரும்படி செய்தேன். நபி (ஸல்) அவர்கள் தொழுத இடம், அதைவிடக் கீழே ஒரு கறுப்பு மேட்டின் மீதே அமைந்திருந்தது. (நபி (ஸல்) அவர்கள் தொழுத அதே இடத்தில் நீ தொழ நினைத்தால் பள்ளிவாசலுக்கு அருகிலுள்ள) அந்த மேட்டி-ருந்து பத்து முழம் அல்லது அதைப் போன்றதை விட்டுவிட்டு, உனக்கும் கஅபாவுக்கும் இடையே அமைந்துள்ள அந்த இரு மலைக் கணவாய்களை முன்னோக்கித் தொழுதுகொள்!”58 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": 493,
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (‘விடைபெறும்’ ஹஜ்ஜின்போது) ‘மினா’வில் சுவர் அல்லாத (கைத்தடி போன்ற) ஒன்றை நோக்கி (திறந்தவெளியில்) மக்களுக்குத் தொழுவித்துக்கொண்டிருந்தார்கள். அப்போது நான் பெட்டைக் கழுதை ஒன்றில் பயணித்தபடி (அவர்களை) நோக்கிச் சென்றேன் -அப்போது நான் பருவ வயதை நெருங்கியிருந்தேன்- (தொழுது கொண்டிருந்தவர்களின்) ஓர் அணியில் ஒரு பகுதியை நான் கடந்து சென்று (கழுதையி-ருந்து) இறங்கி அதை மேய விட்டுவிட்டு, (தொழுவோரின்) வரிசையினூடே புகுந்து (நின்று) கொண் டேன். அ(வ்வாறு நான் தொழுகை அணியைக் கடந்துசென்ற)தற்காக யாரும் என்னை ஆட்சேபிக்கவில்லை. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": 494,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பெருநாள் தினத்தன்று (தொழுவிப்ப தற்காகத் தொழுகைத் திடல் நோக்கிப்) புறப்படும்போது, ஈட்டியை எடுத்துவருமாறு (தம் ஊழியரைப்) பணிப்பார்கள். (தடுப்புச் சுவர் இல்லாத திறந்த வெளியில்) நபியவர்களுக்கு முன்னால் அந்த ஈட்டி (தடுப்பாக நட்டு) வைக்கப்படும். பிறகு அதை நோக்கித் தொழுவார்கள். மக்கள் அவர்களுக்குப் பின்னே இருப்பார்கள். பயணத்தின்போதும் (குறுக்குச் சுவரில்லாத திறந்தவெளியில் தொழ நேர்ந்தால்) இவ்வாறே நபி (ஸல்) அவர்கள் செய்வார்கள். இதனால்தான் (நம்) தலைவர்களும் (திறந்தவெளியில் தொழும்போது தமக்கு முன்னால்) ஈட்டியை வைத்துக் கொள்கின்றனர். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": 495,
			"text": "அபூஜுஹைஃபா வஹ்ப் பின் அப்தில்லாஹ் அஸ்ஸுவாயீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (புறநகர் மக்காவிலுள்ள) ‘அல்பத்ஹா’ எனுமிடத்தில் எங்களுக்கு லுஹ்ரையும் அஸ்ரையும் இரண்டிரண்டு ரக்அத்களாகத் தொழு வித்தார்கள். அப்போது அவர்களுக்கு முன்னால் (இரும்புப் பூண் போட்ட) கைத்தடி ஒன்று (தடுப்பாக) இருந்தது. அவர்களுக்கு முன்னால் (அந்தக் கைத்தடிக்கு அப்பால்) பெண்கள் மற்றும் கழுதைகள் நடந்துசென்றன. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": 496,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: (மஸ்ஜிதுந் நபவீ பள்ளிவாச-ல்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நின்று தொழும் இடத்திற்கும் (பள்ளி வாச-ன் கிப்லா திசையில் அமைந்த) சுவருக்கும் இடையே ஆடு ஒன்று நடந்து செல்லும் அளவுக்கு இடைவெளி இருந்தது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": 497,
			"text": "சலமா பின் அல்அக்வஉ (ரலி) அவர்கள் கூறியதாவது: (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலின் (கிப்லா திசையில் அமைந்த) சுவருக்கும் சொற்பொழிவு மேடைக்கும் (மிம்பர்) இடையே ஆடு கடந்துசெல்லும் அளவுக்கு இடைவெளி இருந்தது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": 498,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்(கள் திறந்த வெளியில் தொழும்போது, அவர்)களுக்காக ஈட்டி (பூமியில்) நட்டுவைக்கப்படும். அவர்கள் அதை நோக்கித் தொழுவார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "அபூஜுஹைஃபா வஹ்ப் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நண்பகல் வேளையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் வந்தார்கள். அப்போது அங்கத் தூய்மை (உளூ) செய்வதற்காக அவர்களுக்குத் தண்ணீர் கொண்டுவரப்பட்டது. அவர்கள் அங்கத் தூய்மை செய்துவிட்டு எங்க ளுக்கு லுஹ்ரையும் அஸ்ரையும் (சேர்த்து) தொழுவித்தார்கள். அப்போது அவர்களுக்கு முன்னால் (இரும்புப் பூண் போட்ட) கைத்தடி ஒன்று (தடுப்பாக) இருந்தது. பெண்மணிகள் மற்றும் கழுதைகள் அந்தக் கைத்தடிக்கு அப்பால் சென்றுகொண்டிருந்தன. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": 500,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தமது இயற்கைக் கடனை நிறைவேற்றச் சென்றால் நானும் இன்னொரு சிறுவரும் எங்களுடன் (இரும்புப் பூண் போட்ட) கைத்தடி, அல்லது (சாதாரண) கைத்தடி, அல்லது (சற்று) பெரிய கைத்தடியும் தண்ணீர் நிரம்பிய தோல் பையும் இருக்க, அவர்களைப் பின்தொடர்ந்து செல்வோம். அவர்கள் தமது தேவையை முடித்துக்கொண்டதும் நாங்கள் அவர்களிடம் அந்தத் தண்ணீர் பையைக் கொடுப்போம். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": 501,
			"text": "அபூஜுஹைஃபா வஹ்ப் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நண்பகல் நேரத்தில் புறப்பட்டுவந்து (புறநகர் மக்காவிலுள்ள) ‘அல்பத்ஹா’ எனுமிடத்தில் லுஹ்ரையும் அஸ்ரையும் (சேர்த்து) இரண்டிரண்டு ரக்அத்களாக (எங்களுக்குத்) தொழுவித்தார்கள். தமக்கு முன்னால் கைத்தடி ஒன்றை (தடுப்பாக) நட்டுவைத்தார்கள். (தொழுகைக்காக) அவர்கள் அங்கத் தூய்மை (உளூ) செய்தார்கள். அவர்கள் அங்கத் தூய்மை செய்த தண்ணீரில் எஞ்சியதை மக்கள் (தம் மேனியில்) தடவிக்கொண்டனர். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": 502,
			"text": "யஸீத் பின் அபீஉபைத் (ரஹ்) அவர்கள் கூறியதாவது: நான் (அபூமுஸ்-ம்) சலமா பின் அல்அக்வஉ (ரலி) அவர்களுடன் (மஸ்ஜிதுந் நபவீ பள்ளிவாசலுக்கு) செல்வது வழக்கம். சலமா (ரலி) அவர்கள் குர்ஆன் பிரதிகள் (வைக்கப்படும் இடத்திற்கு) அருகிலுள்ள தூணருகே தொழுவார்கள். ஆகவே நான், “அபூமுஸ்-ம்! தாங்கள் இந்தத் தூணைத் தேர்ந்தெடுத்துத் தொழுவதையே காண்கி றேனே (என்ன காரணம்)?” என்று கேட்டேன். அதற்கு அவர்கள், “நபி (ஸல்) அவர்கள் இந்தத் தூணைத் தேர்ந்தெடுத்து (அதை முன்னோக்கி நின்று) தொழுவதை நான் பார்த்திருக்கிறேன். (ஆகவேதான், நானும் இதைத் தேர்ந்தெடுத்துத் தொழுகி றேன்)” என்று பதிலளித்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": 503,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: மஃக்ரிப் (தொழுகைக்காக பாங்கு சொல்லும்) நேரம் மூத்த நபித்தோழர்கள் (இரு ரக்அத்கள் முன்சுன்னத் தொழுவதற் காகப் பள்ளிவாச-லுள்ள) தூண்களை நோக்கி விரைவதை நான் பார்த்திருக்கிறேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், ‘(மஃக்ரிப் தொழுகைக்காக பாங்கு சொல்லும் நேரம் முதல்) நபி (ஸல்) அவர்கள் (தமது இல்லத்திலிருந்து) வெளியேறும்வரை’ எனக் கூடுதலாக ஷுஅபா (ரஹ்) அவர்கள் அறிவித்துள்ளார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": 504,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (மக்கா வெற்றி நாளில்) நபி (ஸல்) அவர்களும் உசாமா பின் ஸைத் (ரலி), உஸ்மான் பின் தல்ஹா (ரலி), பிலால் (ரலி) ஆகியோரும் இறையில்லம் கஅபாவுக் குள் நுழைந்தனர். நீண்ட நேரம் உள்ளே இருந்துவிட்டு நபி (ஸல்) அவர்கள் வெளியே வந்தார்கள். (வெளியே வந்த வுடன்) நபி (ஸல்) அவர்களுக்குப் பின்னால் முதல் ஆளாக நானே கஅபா வினுள் நுழைந்தேன். பிலால் (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்கள் (கஅபாவுக்குள்) எங்கே (எந்த இடத்தில்) தொழுதார்கள்?” என்று கேட்டேன். அதற்கு பிலால் (ரலி) அவர்கள், ‘முன்னால் உள்ள இரண்டு தூண் களுக்கு இடையில்’ என்று பதிலளித் தார்கள் அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: (மக்கா வெற்றி நாளில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் உசாமா பின் ஸைத், பிலால், கஅபாவின் பொறுப்பாளரான உஸ்மான் பின் தல்ஹா (ரலி) ஆகியோரும் இறையில்லம் கஅபாவுக்குள் சென்று தாழிட்டுக்கொண்டார்கள். (நீண்ட நேரம்) உள்ளே இருந்தார்கள். வெளியே வந்(துகொண்டிருந்)த பிலால் (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்கள் (உள்ளே) என்ன செய்தார்கள்?” என்று கேட்டேன். அதற்கு பிலால் (ரலி) அவர்கள், “ஒரு தூணைத் தமக்கு இடப் பக்கமும் மற்றொரு தூணைத் தமக்கு வலப் பக்கமும் மூன்று தூண்களைத் தமக்குப் பின்புறமும் இருக்குமாறு செய்(து, தொழு)தார்கள்” என்று கூறினார்கள். அன்று இறையில்லம் கஅபாவினுள் ஆறு தூண்கள் இருந்தன. (அபூஅப்தில்லாஹ் புகாரீ ஆகிய நான் கூறுகின்றேன்:) (இதன் அறிவிப்பாளர்களின் ஒருவ ரான) மா-க் (ரஹ்) அவர்களின் மற்றோர் அறிவிப்பில் “தமது வலப் பக்கம் இரண்டு தூண்கள் (இருக்குமாறு தொழுதார்கள்)” என்று இடம்பெற்றுள்ளதாக எம்மிடம் இஸ்மாயீல் பின் அபீஉவைஸ் (ரஹ்) அவர்கள் கூறினார்கள்.60 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கஅபாவிற்குள் நுழையும்போது கஅபாவை நோக்கி நேராகச் சென்று, அதன் கதவு தமது முதுகுக்குப் பின்னால் இருக்குமாறு தமக்கும் எதிர் சுவருக்கு மிடையே சுமார் மூன்று முழ இடைவெளி விட்டு நெருக்கமாக நின்று தொழுவார்கள். (அதாவது,) நபி (ஸல்) அவர்கள் கஅபாவில் எந்த இடத்தில் நின்று தொழுததாகத் தமக்கு பிலால் (ரலி) அவர்கள் தெரிவித்தார்களோ அந்த இடத்தைத் தேடித் தொழுவார்கள். “நம்மில் ஒருவர் கஅபாவில் தாம் நாடிய எந்தப் பகுதியில் நின்று தொழுதாலும் தவறேது மில்லை” என்றும் கூறுவார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: “நபி (ஸல்) அவர்கள் (திறந்தவெளியில் தொழும்போது) தமது ஊர்தி ஒட்டகத்தை குறுக்கே (தடுப்பாக) நிறுத்தி அதை நோக்கித் தொழுவார்கள்” என இப்னு உமர் (ரலி) அவர்கள் கூறினார்கள். நான் (அவர்களிடம்), “ஒட்டகம் மிரண்டு ஓடிவிட்டால்...?” என்று கேட் டேன். “இந்தச் சிவிகையை எடுத்து நேராக வைத்து அதன் (பின்னால் இருக்கும்) சாய்மானக் குச்சியை நோக்கித் தொழுவார் கள்” என்று பதிலளித்தார்கள்.61 இப்னு உமர் (ரலி) அவர்கள் இவ்வாறே செய்துவந்தார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": 508,
			"text": "அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: (“தொழுபவருக்குக் குறுக்கே நாய், கழுதை, பெண் ஆகியோர் சென்றால், தொழுகை முறிந்துவிடும் என்று ஒருவர் கூறினார். அவரிடம்) ஆயிஷா (ரலி) அவர்கள், “எங்களை நாய்க்கும் கழுதைக்கும் சமமாக்குகிறீர்களா? நான் கட்டிலில் ஒருக்களித்துப் சாய்ந்து படுத்திருப்பேன். அப்போது நபி (ஸல்) அவர்கள் வந்து நடுக் கட்டிலுக்கு நேராக நின்று தொழுவார்கள். அவர்கள் பார்வையில் படும் விதமாக படுத்திருக்கப் பிடிக்காமல் நான் கட்டி-ன் இரு கால்களினூடே நுழைந்து வெளியேறிவிடுவேன்; எனது போர்வையி-ருந்தும் நழுவிச் சென்றேவிடுவேன்” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": 509,
			"text": "அபூஸா-ஹ் தக்வான் அஸ் ஸம்மான் (ரஹ்) அவர்கள் கூறியதாவது: மக்கள் தமக்கு குறுக்கே செல்லாம-ருக்கத் தடுப்பு ஒன்றை வைத்துக்கொண்டு அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் வெள்ளிக்கிழமை அன்று தொழுது கொண்டிருப்பதை நான் கண்டேன். அப்போது பனூ அபீமுஐத் குலத்தைச் சேர்ந்த ஓர் இளைஞர் அபூசயீத் (ரலி) அவர்களுக்கு முன்னால் கடந்து செல்லப் போனார். உடனே அபூசயீத் (ரலி) அவர்கள் அவரது நெஞ்சில் (கையை வைத்துத்) தள்ளினார்கள். அபூசயீத் (ரலி) அவர்களுக்கு முன்னால் (அவர்களைக் கடந்து) செல்வதைத் தவிர நடைபாதை யேதும் இல்லை என்பதைக் கண்ட அந்த இளைஞர், மீண்டும் அவர்களைத் தாண்டி (குறுக்கே) செல்லப்போனார். உடனே அபூசயீத் (ரலி) அவர்கள் முன்பைவிடக் கடுமையாக அவரைத் தள்ளினார்கள். உடனே அந்த இளைஞர் அபூசயீத் (ரலி) அவர்களை ஏசினார். பிறகு (மதீனாவின் ஆளுநராயிருந்த) மர்வான் பின் ஹகமிடம் சென்று அபூசயீத் (ரலி) அவர்கள் தம்மிடம் நடந்துகொண்டது பற்றி அவர் முறையிட்டார். அவருக்குப் பின்னால் அபூசயீத் (ரலி) அவர்களும் மர்வானிடம் சென்றார்கள். அப்போது மர்வான், “உங்களுக்கும் உங்கள் சகோதரரின் புதல்வருக்கும் இடையே என்ன பிரச்சினை, அபூசயீத் அவர்களே?” என்று கேட்டார். அப்போது அபூசயீத் (ரலி) அவர்கள், “மக்கள் தமக்குக் குறுக்கே செல்லாம-ருக்கத் தமக்கு முன்னால் ஏதேனும் ஒன்றைத் தடுப்பாக வைத்துக்கொண்டு உங்களில் ஒருவர் தொழும்போது, யாரேனும் தமக்கு முன்னால் (குறுக்கே) கடந்துசெல்ல முயன்றால், அவரைத் தள்ளிவிடுங்கள். அவர் (விலகிக்கொள்ள) மறுத்தால், அவருடன் சண்டையி(ட்டுத் த)டுங்கள். ஏனெனில், அவன்தான் ஷைத்தான்” என நபி (ஸல்) அவர்கள் கூறக் கேட்டுள்ளேன் (எனவேதான், இந்த இளைஞரிடம் இவ்வாறு நான் நடந்துகொண்டேன்)” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": 510,
			"text": "புஸ்ர் பின் சயீத் (ரஹ்) அவர்கள் கூறியதாவது: ஸைத் பின் காலித் (ரலி) அவர்கள் என்னை அபூஜுஹைம் (ரலி) அவர்களிடம் அனுப்பிவைத்து, தொழுதுகொண்டிருப்பவருக்குக் குறுக்கே செல்பவர் தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் என்ன கேட்டார்கள் என்பதை விசாரித்து (அறிந்து) வருமாறு கூறினார்கள். (நான் சென்று கேட்டேன்). அப்போது அபூஜுஹைம் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தொழுதுகொண்டிருப்பவருக்குக் குறுக்கே செல்பவர், அதனால் தமக்கு என்ன (பாவம்) ஏற்படும் என்பதை அறிந்தால், தொழுபவருக்கு முன்னால் செல்வதைவிட நாற்பதுவரை நிற்பது அவருக்கு நல்லதாக இருக்கும். (இதன் அறிவிப்பாளர்களில் ஒருவ ரான) அபுந்நள்ர் சா-ம் பின் அபீஉமய்யா (ரஹ்) அவர்கள் கூறுகிறார்கள்: புஸ்ர் பின் சயீத் (ரஹ்) அவர்கள், ‘நாற்பது நாட்கள்’ என்று சொன்னார்களா, அல்லது ‘நாற்பது மாதங்கள்’ என்று சொன்னார்களா, அல்லது ‘நாற்பது ஆண்டுகள்’ என்று சொன்னார்களா என்பது எனக்குத் தெரியவில்லை.62 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": 511,
			"text": "மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்களிடம் தொழு கையை முறிக்கும் செயல்கள் குறித்துப் பேசப்பட்டது. அப்போது சிலர், (தொழுது கொண்டிருப்பவருக்கு குறுக்கே செல்லும்) “நாயும் கழுதையும் பெண்ணும் தொழு கையை முறித்துவிடுவர்” என்று கூறினர். அப்போது ஆயிஷா (ரலி) அவர்கள், “(பெண்களாகிய) எங்களை நாய்களுக்குச் சமமாக்கிவிட்டீர்களே? நபி (ஸல்) அவர்கள் தொழுதுகொண்டிருக்கையில் நான் அவர்களுக்கும் கிப்லாவுக்கும் இடையே கட்டி-ல் ஒருக்களித்துப் படுத்திருப்பேன். அப்போது எனக்கு ஏதேனும் தேவை ஏற்படும். (தொழுது கொண்டிருக்கும்) அவர்களுக்கு முன்னால் செல்ல விருப்பமில்லாமல் (நான் கட்டி--ருந்து) நழுவிச் சென்றுவிடுவேன்” என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": 512,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களது விரிப்பில் குறுக்கே உறங்கிக்கொண்டிருக்கையில் நபி (ஸல்) அவர்கள் தொழுதுகொண்டிருப்பார்கள். அவர்கள் ‘வித்ர்’ தொழ எண்ணும் போது, என்னை எழுப்புவார்கள். (அதன்பின்) நான் ‘வித்ர்’ தொழுவேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "நபி (ஸல்) அவர்களின் துணைவி யார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் (இரவில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு முன்புறமாக (படுத்து) உறங்கிக்கொண்டிருப்பேன். அப்போது என் கால்கள் அவர்களது கிப்லா திசையில் (அவர்கள் ‘சிரவணக்கம்’ செய்யுமிடத்தில்) இருக்கும். அவர்கள் சிரவணக்கத்திற்கு வரும்போது என்னைத் தமது விரலால் குத்துவார்கள். உடனே நான் என் கால்களை மடக்கிக்கொள்வேன். அவர்கள் எழுந்து நின்றுவிட்டால் (மறுபடியும்) நான் கால்களை நீட்டிக்கொள்வேன். அந்த நாட்களில் (எங்கள்) வீடுகளில் விளக்குகள் இல்லை. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": 514,
			"text": "மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்களிடம் தொழு கையை முறிப்பவை குறித்துப் பேசப்பட் டது. -“நாயும் கழுதையும் பெண்ணும் (தொழுபவருக்கு குறுக்கே செல்வது தொழுகையை முறித்துவிடும்” என்று சிலர் கூறினர்.)- அப்போது ஆயிஷா (ரலி) அவர்கள், “(பெண்களாகிய) எங்களைக் கழுதைகளுக் கும் நாய்களுக்கும் ஒப்பாக்கிவிட்டீர்களே! அல்லாஹ்வின் மீதாணையாக! நான் நபி (ஸல்) அவர்களுக்கும் (அவர்களின்) கிப்லாவுக்கும் இடையே கட்டி-ல் ஒருக்களித்துப் படுத்துக்கொண்டிருக்க, நபி (ஸல்) அவர்கள் தொழுதுகொண்டி ருப்பார்கள். அப்போது எனக்கு ஏதேனும் தேவையேற்பட்டால், நபி (ஸல்) அவர்களுக்கு முன்னால் அமர்ந்து அவர்களுக்கு இடையூறு அளிக்கப் பிடிக்காமல் கட்டி-ன் இரு கால்களினூடே நான் நழுவிச் சென்றுவிடுவேன்” என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": 515,
			"text": "முஹம்மத் பின் அப்தில்லாஹ் பின் முஸ்-ம் (ரஹ்) அவர்கள் கூறியதாவது: நான் என் தந்தையின் சகோதரர் (முஹம்மத் பின் முஸ்-ம் பின் ஷிஹாப் அஸ்ஸுஹ்ரீ - ரஹ்) அவர்களிடம், “எது (குறுக்கே செல்வது) தொழுகையை முறிக்கும்?” என்று கேட்டேன். அதற்கு அவர்கள், “தொழுகையை எதுவும் முறிக்காது” என்று கூறிவிட்டு, உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் தெரிவித்ததாக (பின்வருமாறு) கூறினார்கள்: நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவில் எழுந்து தம் குடும்பத்தாரின் விரிப் பில் தொழுவார்கள். அப்போது நான் அவர்களுக்கும் அவர்களின் கிப்லாவுக்கும் (சிரவணக்கம் செய்யும் இடத்திற்கும்) இடையே குறுக்கு வாக்கில் படுத்துக் கொண்டிருப்பேன். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": 516,
			"text": "அபூகத்தாதா (ஹாரிஸ் பின் ரிப்ஈ) அல்அன்சாரி (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் புதல்வி ஸைனபுக்கும் - அபுல்ஆஸ் பின் ரபீஆ பின் அப்தி ஷம்ஸ் (ரலி) அவர்களுக்கும் பிறந்த (தம் பேத்தி) உமாமா பின்த் ஸைனபை (தமது தோளில்) சுமந்துகொண்டு தொழுதிருக்கிறார்கள். சிரவணக்கம் செய்யச் செல்லும்போது உமாமாவை இறக்கிவிடுவார்கள்; எழுந்து நிற்கும்போது (மீண்டும்) உமாமாவை (தமது தோளில்) தூக்கிக்கொள்வார்கள்.64 அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": 517,
			"text": "மைமூனா பின்த் அல்ஹாரிஸ் (ரலி) அவர்கள் கூறியதாவது: எனது படுக்கை விரிப்பு நபி (ஸல்) அவர்களின் தொழுகை விரிப்புக்கு அருகில் (அத்துடன் ஒட்டி) இருக்கும். சில சமயம் நான் எனது படுக்கையில் இருக்கும்போது, நபி (ஸல்) அவர்களின் ஆடை என்மீது படுவதுண்டு. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": 518,
			"text": "மைமூனா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தொழுதுகொண்டி ருக்கும்போது அவர்களுக்கு அருகில் நான் (படுத்து) உறங்கிக்கொண்டிருப்பேன். அவர்கள் சிரவணக்கம் (சஜ்தா) செய்யும் போது அவர்களது ஆடை என்மீது படும். அப்போது நான் மாதவிடாய் ஏற்பட்ட வளாய் இருப்பேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் முசத்தத் (ரஹ்) அவர்களது அறிவிப்பி லேயே, “அப்போது நான் மாதவிடாய் ஏற்பட்டவளாய் இருப்பேன்” எனும் குறிப்பு கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": 519,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இரவில்) தொழுதுகொண்டிருக்கும்போது, நான் அவர்களுக்கும் அவர்களது கிப்லாவுக்கும் இடையே ஒருக்களித்துப் படுத்திருப்பேன். அவர்கள் சிரவணக்கம் (சஜ்தா) செய்யச் செல்லும்போது, என் கால்களைத் தொட்டு (என்னை) உணர்த்துவார்கள். உடனே நான் என் கால்களை மடக்கிக்கொள்வேன். இவ்வாறிருக்க, (‘தொழுபவருக்குக் குறுக்கே நாயும் கழுதையும் பெண்ணும் செல்வது தொழுகையை முறித்துவிடும்’ என்று கூறுவதன் மூலம் பெண்களாகிய) எங்களை நாய்க்கும் கழுதைக்கும் நீங்கள் சமமாக்கியது தவறாகும். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 520,
			"arabicnumber": 520,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறையில்லம் கஅபா அருகில் நின்று தொழுதுகொண்டிருந் தார்கள். அப்போது (அபூஜஹ்ல், உக்பா பின் அபீமுஐத் உள்ளிட்ட) குறைஷிக் குழு ஒன்று தங்கள் அவையில் கூடியிருந்தனர். அப்போது அவர்களில் ஒருவன், “(பொது இடத்தில் தொழும்) இந்தப் பகட்டுக்காரரை நீங்கள் பார்க்க வில்லையா?” என்று கூறிவிட்டு, “உங்களில் யார், இறைச்சிக்காக அறுக்கப்பட்ட இன்ன குடும்பத்தாரின் ஒட்டகத்தை நோக்கிச் சென்று, அதன் சாணத்தையும், அதன் இரத்தத்தையும், அதன் கருவைச் சுற்றியுள்ள சவ்வையும் கொண்டுவந்து, முஹம்மத் சிரவணக்கம் செய்யும் நேரம் பார்த்து அவருடைய தோள்கள் மத்தியில் வைக்கத் தயார்?” என்று கேட்டான். அங்கிருந்தவர்களிலேயே படுபாதகனாயிருந்த ஒருவன் (அதற்கு) முன்வந்தான். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சிரவணக்கம் செய்தபோது அவர்களு டைய தோள்கள் மத்தியில் அ(ந்த அசுத்தத்)தை அவன் போட்டான். நபி (ஸல்) அவர்கள் அப்படியே சிரவணக்கம் செய்தவாறே இருந்தார்கள். (இதைப் பார்த்துக்கொண்டிருந்த குறைஷியர்) ஒருவர்மீது ஒருவர் விழுந்து சிரித்தனர். உடனே ஒருவர் (நபி (ஸல்) அவர்களின் புதல்வி) ஃபாத்திமா (ரலி) அவர்களை நோக்கிச் சென்றார். -அப்போது ஃபாத்திமா (ரலி) அவர்கள் சிறுமியாக இருந்தார்கள்.- (செய்தி அறிந்த) ஃபாத்திமா (ரலி) அவர்கள் ஓடோடி வந்தார்கள். அவர்கள் வந்து அசுத்தங்களைத் தம்மைவிட்டு எடுத்தெறியும்வரை நபியவர்கள் அப்படியே சிரவணக்கம் செய்தபடியே இருந்தார்கள். அ(வ்வாறு செய்த)வர்களைப் பார்த்து ஃபாத்திமா (ரலி) அவர்கள் ஏசினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையை முடித்ததும் (பின்வருமாறு) பிராத்தித்தார்கள்: “இறைவா! குறைஷியரை நீ கவனித்துக் கொள்வாயாக! இறைவா! குறைஷியரை நீ கவனித்துக்கொள்வாயாக! இறைவா! குறைஷியரை நீ கவனித்துக்கொள்வாயாக! என்று (பொதுவாகக்) கூறிவிட்டு, “அல்லாஹ்வே அம்ர் பின் ஹிஷாம் (அபூ ஜஹ்ல்), உத்பா பின் ரபிஆ, ஷைபா பின் ரபீஆ, வலீத் பின் உத்பா, உமய்யா பின் கலஃப், உக்பா பின் அபீமுஐத், உமாரா பின் அல்வலீத் ஆகியோரை நீ கவனித் துக்கொள்வாயாக!” என்று (ஏழு பேரின்) பெயர்களைக் குறிப்பிட்டுப் பிராத்தித்தார்கள். தொடர்ந்து அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறுகிறார்கள்: அல்லாஹ்வின் மீது சத்தியமாக! (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் யாருக்கெதிராகப் பிராத்தித்தார்களோ அவர்களில் உமாரா பின் அல்வலீத் நீங்கலாக மற்ற) அனைவரும் பத்ருப் போர் நாளில் (உடல் உப்பி உருக்குலைந்து) மாண்டு கிடந்ததையும், பின்னர் ‘கலீபு பத்ர்’ எனும் பாழுங்கிணற்றை நோக்கி அவர்கள் இழுத்துச்செல்லப்பட்டதையும் நான் பார்த்தேன். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இந்தப் பாழுங்கிணற்றில் உள்ளோரை (இனியும்) சாபம் தொடரும்” என்று கூறினார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 167
			}
		}
	]
}