{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"82": "Divine Will (Al-Qadar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6594,
			"arabicnumber": 6594,
			"text": "உண்மையே பேசியவரும் உண்மையே அறிவிக்கப்பட்டவருமான அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தம் தாயின் வயிற்றில் நாற்பது நாட்கள் (கருவாக) சேமிக்கப்படுகிறார். பிறகு அதைப் போன்றே (நாற்பது நாட்கள்) அந்தக் கரு (அட்டை போன்று கருப்பையின் சுவரைப் பற்றிப் பிடித்துத் தொங்கும்) ஒரு கருக் கட்டியாக மாறுகிறது. பிறகு அதைப் போன்றே (மேலும் நாற்பது நாட்கள் மெல்லப்பட்ட சக்கை போன்ற) ஒரு சதைப்பிண்டமாக மாறிவிடுகிறது. பிறகு (அதனிடம்) அல்லாஹ் ஒரு வானவரை அனுப்புகிறான். அவர் நான்கு விஷயங்களை எழுதுமாறு பணிக்கப்படுகிறார். அந்த மனிதனின் வாழ்வாதாரம், வாழ்நாள், (செயல்பாடு), அவன் நற்பேறுபெற்றவரா, அல்லது நற்பேறு அற்றவரா (ஆகியவை எழுதப்படும்). பிறகு அவனுள் உயிர் ஊதப்படும். இதனால்தான் அல்லாஹ்வின் மீதாணையாக! ‘உங்களில் ஒருவர்’, அல்லது ‘ஒரு மனிதர்’ நரகவாசிகளின் (தீய) செயலைச் செய்துகொண்டே செல்வார். இறுதியில் அவருக்கும் நரகத்திற்கும் இடையே ‘விரிந்த இரு கைகளின் நீட்டளவு’ அல்லது ‘ஒரு முழம்’ இடைவெளிதான் இருக்கும்; அதற்குள் அவரது விதி அவரை முந்திக்கொள்ள, அவர் சொர்க்கவாசிகளின் செயலைச் செய்து அதன் விளைவாகச் சொர்க்கத்தில் புகுந்துவிடுவார். (இதைப் போன்றே) ஒருவர் சொர்க்கவாசிகளின் (நற்)செயலைச் செய்துகொண்டே செல்வார். இறுதியில் அவருக்கும் சொர்க்கத்திற்கும் இடையே ‘ஒரு முழம்’ அல்லது ‘இரு முழங்கள்’ இடைவெளிதான் இருக்கும்; அதற்குள் விதி அவரை முந்திக்கொள்ள, அவர் நரகவாசிகளின் செயலைச் செய்து அதன் காரணத்தால் நரகத்தினுள் புகுந்துவிடுவார். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.2 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில், ஆதம் பின் அபீஇயாஸ் (ரஹ்) அவர்களின் அறிவிப்பில் (ஒரு முழமா இரு முழங்களா? என்பதில் சந்தேகம் இல்லாமல்) ஒரு முழம் என்றே (தீர்மானமாக) இடம்பெற்றுள்ளது. அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6595,
			"arabicnumber": 6595,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், (தாயின்) கருப்பையில் ஒரு வானவரை நியமிக்கின்றான். அவர், “இறைவா! (இது ஒரு துளி) விந்து. இறைவா! (இது பற்றித் தொங்கும்) கருக்கட்டி. இறைவா! (இது மெல்லப்பட்ட சக்கை போன்ற) சதைத்துண்டு” என்று கூறிக்கொண்டிருப்பார். அதன் படைப்பை முழுமையாக்கிட அல்லாஹ் விரும்பும்போது, “இறைவா! இது ஆணா? அல்லது பெண்ணா? நற்பேறு பெற்றதா? அல்லது நற்பேறு அற்றதா? (இதன்) வாழ்வாதாரம் எவ்வளவு? ஆயுள் எவ்வளவு?” என்று வானவர் கேட்பார். அவ்வாறே (இவையனைத்தும் அல்லாஹ்வால் நிர்ணயிக்கப்பட்டு,) அது தன் தாயின் வயிற்றில் இருக்கும்போதே எழுதப்படும். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.3 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6596,
			"arabicnumber": 6596,
			"text": "இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர், “அல்லாஹ்வின் தூதரே! சொர்க்கவாசிகள் யார்? நரகவாசிகள் யார்? என்று (முன்பே அல்லாஹ்வுக்குத்) தெரியுமா?” எனக் கேட்டார். நபி (ஸல்) அவர்கள் “ஆம் (தெரியும்)” என்று சொன்னார்கள். அவர் “அவ்வாறாயின் ஏன் நற்செயல் புரிகின்றவர்கள் நற்செயல் புரிய வேண்டும்?” என்று கேட்டார். நபி (ஸல்) அவர்கள் “ஒவ்வொருவரும் ‘எ(தை அடைவ)தற்காகப் படைக்கப்பட்டார்களோ’ அல்லது ‘எ(தை அடைவ)தற்கு வாய்ப்பளிக்கப்பட்டார்களோ’ அதற்காகச் செயல்படுகிறார்கள்” என்று பதிலளித் தார்கள்.6 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6597,
			"arabicnumber": 6597,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: இணைவைப்போரின் குழந்தைகள் (இறந்துவிட்டால் அவர்களின் முடிவு யாது? என்பது) குறித்து நபி (ஸல்) அவர்களிடம் வினவப்பட்டது. அதற்கு அவர்கள், “அவர்கள் (உயிருடன் வாழ்ந்தால்) எவ்வாறு செயல்பட்டிருப்பார்கள் என்பதை அல்லாஹ் நன்கு அறிவான்” என்று பதிலளித்தார்கள்.8 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6598,
			"arabicnumber": 6598,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: இணைவைப்போரின் குழந்தைகள் (இறந்துவிட்டால் அவர்களின் முடிவு யாது? என்பது) குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கேட்கப்பட்டது. அதற்கு அவர்கள், “அவர்கள் (உயிருடன் வாழ்ந்தால்) எவ்வாறு செயல்பட்டி ருப்பார்கள் என்பதை அல்லாஹ் நன்கறி வான்” என்று விடையளித்தார்கள்.9 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6600,
			"arabicnumber": 6600,
			"text": "மக்கள் “அல்லாஹ்வின் தூதரே! சிறிய வயதில் ஒருவர் இறந்துவிட்டால் அவரது நிலை (என்ன என்பது) பற்றி என்ன கூறுகிறீர்கள்?” என்று கேட்டார் கள். நபி (ஸல்) அவர்கள், “அவர்கள் (உயிருடன் வாழ்ந்தால்) எவ்வாறு செயல் பட்டிருப்பார்கள் என்பதை அல்லாஹ் நன்கு அறிவான்” என்று சொன்னார்கள். அத்தியாயம் :",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6601,
			"arabicnumber": 6601,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு பெண், மற்றொரு பெண்ணின் பாத்தி(ரம் எனும் வாழ்வாதா)ரத்தைக் காலி செய்(துவிட்டு, அதைத் தனதாக்கிக்கொள்)வதற்காக அவளை மணவிலக்குச் செய்திடுமாறு (தம் மணாளரிடம்) கோர வேண்டாம். (மாறாக, அந்த நிபந்தனையின்றி) அவள் மணம் புரிந்துகொள்ளட்டும். ஏனெனில், அவளுக்கென விதிக்கப்பட்டது அவளுக்கே கிடைக்கும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.11 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6602,
			"arabicnumber": 6602,
			"text": "உசாமா பின் ஸைத் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்கள் அருகில் இருந்துகொண்டிருந்தேன். அப்போது நபி (ஸல்) அவர்களின் புதல்வியார் ஒருவரின் தூதுவர் நபி (ஸல்) அவர்களிடம் வந்தார். அப்போது சஅத் பின் உபாதா (ரலி), உபை பின் கஅப் (ரலி), முஆத் பின் ஜபல் (ரலி) ஆகியோர் நபி (ஸல்) அவர்களுடன் இருந்தனர். அந்தப் புதல்வியாரின் மகன் உயிருக்காகப் போராடிக்கொண்டிருப்பதாகத் தூதுவர் தெரிவித்தார். அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ் எடுத்துக்கொண்டதும் கொடுத்ததும் அவனுக்கே உரியது. ஒவ்வொன்றுக்கும் ஒரு தவணை உண்டு. ஆகவே, பொறுமையைக் கடைப்பிடித்து நன்மையை எதிர் பார்ப்பாயாக” என்று தம் புதல்விக்குச் சொல்லி அனுப்பினார்கள்.12 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6603,
			"arabicnumber": 6603,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் அமர்ந்திருந்தபோது அன்சாரிகளில் ஒருவர் வந்து, “அல்லாஹ்வின் தூதரே! எங்களுக்கு (பெண்) போர்க் கைதிகள் கிடைக்கின்றனர். அவர்களை (விற்று) காசாக்கிக்கொள்ள நாங்கள் விரும்புவ தால் (அவர்களுடன் உடலுறவு கொள் ளும்போது) புணர்ச்சி இடைமுறிப்பு (அஸ்ல்) செய்துகொள்வது குறித்துத் தாங்கள் என்ன கருதுகிறீர்கள்?” என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அப்படியா நீங்கள் செய்கிறீர்கள்? இதைச் செய்யாமலிருந்தால் உங்கள்மீது தவறேதுமில்லையே? ஏனெனில், உருவாக வேண்டுமென்று அல்லாஹ் விதித்துள்ள எந்த உயிரும் கட்டாயம் உருவாகியே தீரும்” என்று பதிலளித்தார்கள்.13 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6604,
			"arabicnumber": 6604,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) எங்களிடையே நபி (ஸல்) அவர்கள் உரையாற்றினார்கள். அந்த உரையில், மறுமை ஏற்படும்வரையிலான எந்தத் தகவலையும் அவர்கள் குறிப்பிடாமல் விட வில்லை. அதனை அறிந்தவர்கள் அறிந்துகொண்டார்கள். அதனை அறியாதவர்கள் அறியாமலானார்கள். (அதில்) ஏதேனும் ஒன்றை நான் மறந்துவிட்டிருந்தாலும் அதை (நேரில்) காணும்போது அறிந்துகொள்வேன்; தம்மைவிட்டு மறைந்துவிட்ட ஒருவரை (மீண்டும்) பார்க்கும்போது அவரை ஒருவர் அடையாளம் கண்டுகொள்வதைப் போன்று. அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6605,
			"arabicnumber": 6605,
			"text": "அலீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுடன் (பகீஉல் ஃகர்கத் எனும் பொது மையவாடியில் ஜனாஸா ஒன்றில் கலந்துகொள்வதற்காக) அமர்ந்திருந்தோம். அப்போது நபி (ஸல்) அவர்கள் தம்மிடமிருந்த ஒரு குச்சியால் தரையைக் குத்திக் கீறியபடி (ஆழ்ந்த யோசனையில்) இருந்தார்கள். பின்னர் “சொர்க்கம் அல்லது நரகத்திலுள்ள தமது இருப்பிடம் எழுதப்பட்டிராத எவரும் உங்களில் இல்லை” என்று சொன்னார்கள். அப்போது மக்களில் ஒருவர், “அவ்வாறாயின் (ஏற்கெனவே எழுதப்பட்டுவிட்ட விதியை நம்பிக்கொண்டு நல்லறங்கள் ஏதும் புரியாமல்) நாங்கள் இருந்துவிட மாட்டோமா? அல்லாஹ்வின் தூதரே!” என்று கேட்டார். நபி (ஸல்) அவர்கள், “இல்லை. நீங்கள் செயலாற்றுங்கள். (நல்லார், பொல்லார்) அனைவருக்கும் (அவரவர் செல்லும் வழி) எளிதாக்கப்பட்டுள்ளது” என்று கூறி விட்டு, பிறகு “எவர் (இறைவழியில்) வழங்கி (இறைவனை) அஞ்சி வாழ்ந்து, நல்லறங்களை மெய்யாக்குகிறாரோ, அவருக்கு (சொர்க்கம் என்ற) நல்வழியை எளிதாக்குவோம்” எனும் (92:5-7) வசனங்களை ஓதிக்காட்டினார்கள்.14 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6606,
			"arabicnumber": 6606,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் நாங்கள் கைபர் போரில் கலந்துகொண்டோம். அப்போரின்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம்முடன் இருந்தவர்களில், தம்மை முஸ்லிம் என்று சொல்லிக்கொண்ட ஒருவரைப் பற்றி “இவர் நரகவாசிகளில் ஒருவர்” என்று கூறினார்கள். போரிடும் நேரம் வந்தபோது அந்த மனிதர் மிகக் கடுமையாகப் போரிட்டார். அப்போது அவருக்கு நிறைய காயங்கள் ஏற்பட்டு அவரை உட்காரவைத்துவிட்டன. அப்போது நபித்தோழர்களில் ஒருவர் வந்து, “அல்லாஹ்வின் தூதரே! தாங்கள் எவரைக் குறித்து ‘அவர் நரகவாசி’ என்று சொன்னீர்களோ அவர் இறைவழியில் கடுமையாகப் போரிட்டு அதிகமான காயங்கள் அடைந்துள்ளார்” என்று கூறினார். அப்போதும் நபி (ஸல்) அவர்கள் “அவர் நரகவாசிகளில் ஒருவர்தான்” என்றே கூறினார்கள். அப்போது முஸ்லிம்களில் சிலர் (நபி (ஸல்) அவர்களின் இச்சொல் குறித்து) சந்தேகப்படும் அளவுக்குப் போய்விட்டார்கள். நிலைமை இவ்வாறு இருக்கும் போது, அந்த மனிதர் காயத்தின் வேதனையை உணரலானார். உடனே அவர் தமது கையை அம்புக் கூட்டுக்குள் நுழைத்து அதிலிருந்து ஓர் அம்பை உருவி அதன் மூலம் தற்கொலை செய்துகொண்டார். உடனே முஸ்லிம்களில் சிலர் அல்லாஹ்வின் தூதர் ஸல்) அவர்களிடம் விரைந்து வந்து, “அல்லாஹ்வின் தூதரே! தங்களின் அறிவிப்பை அல்லாஹ் மெய்ப்படுத்திவிட்டான். இன்ன மனிதர் தற்கொலை செய்து தம்மை மாய்த்துக்கொண்டார் (அதனால் அவர் நரகவாசிகளில் ஒருவராகிவிட்டார்)” என்று கூறினர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “பிலாலே! எழுந்து சென்று ‘இறைநம்பிக்கையாளர் தவிர வேறெவரும் சொர்க்கத்தில் நுழைய முடியாது. மேலும், அல்லாஹ் இந்த மார்க்கத்திற்குப் பாவியான மனிதனின் மூலமாகவும் வலுவூட்டுகின்றான்’ என்று (மக்களிடையே) அறிவிப்புச் செய்யுங்கள்” என்று கூறினார்கள்.15 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6607,
			"arabicnumber": 6607,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் கலந்துகொண்ட (கைபர்) போரில், எதிரி களுக்குப் பதிலடி கொடுப்பதில் முஸ்லிம் களிலேயே மகத்தான (பங்காற்றுப)வராக இருந்த ஒருவரைப் பார்த்த நபி (ஸல்) அவர்கள், “நரகவாசிகளில் ஒருவரைப் பார்க்க விரும்புகின்றவர் இவரைப் பார்த்துக்கொள்ளலாம்” என்று கூறினார்கள். (அவரைப் பற்றி நபியவர்கள் ஏன் அவ்வாறு குறிப்பிட்டார்கள் என்பதை அறிய) மக்களில் ஒருவர் அவரைப் பின்தொடர்ந்து சென்றார். அந்த மனிதரோ இணைவைப்பாளர்களை எதிர்த்து எல்லாரையும்விடக் கடுமையாகப் போராடும் அதே நிலையில் இருந்தார். இறுதியில் அவர் (எதிரிகளால் கடுமையாகக்) காயப்படுத்தப்பட்டார். அதனால் அவர் அவசரமாக இறந்துவிட விரும்பி, தமது வாளின் கூரான பகுதியைத் தம் மார்புகளுக்கிடையே வைத்து (அழுத்தி)க்கொண்டார். வாள் அவருடைய தோள்களுக்கிடையே இருந்து வெளியேறியது. (பின்தொடர்ந்து சென்ற) அந்த மனிதர் நபி (ஸல்) அவர்களை நோக்கி விரைந்து வந்து, “தாங்கள் அல்லாஹ்வின் தூதர்தான் என்று நான் உறுதிகூறுகின்றேன்” என்று சொன்னார். அதற்கு நபி ஸல்) அவர்கள், “என்ன விஷயம்?” என்று கேட்டார்கள். அவர் “தாங்கள் எவரைக் குறித்து நரகவாசிகளில் ஒருவரை எவர் பார்க்க விரும்புகின்றாரோ அவர் இவரைப் பார்த்துக்கொள்ளட்டும் என்று குறிப்பிட்டீர்களோ அவர் முஸ்óம்களுக்காகப் போராடுவதில் மகத்தான (பங்காற்றுப)வராகத் திகழ்ந்தார். (தாங்கள் அவரைப் பற்றி நரகவாசி என்று குறிப்பிட்டிருப்பதால்) அவர் இதே (தியாக) நிலையில் இறக்கப்போவதில்லை என்று நான் அறிந்தேன். அவர் (எதிரிகளால் கடுமையாகக்) காயப்படுத்தப்பட்டபோது அவசரமாக இறந்துவிட விரும்பி தற்கொலை செய்துகொண்டார்” என்று சொன்னார். அப்போதுதான் நபி (ஸல்) அவர்கள் (பின்வருமாறு) கூறினார்கள்: ஓர் அடியார் நரகவாசிகளின் செயல்களைச் செய்துவருவார். ஆனால், (இறுதியில்) அவர் சொர்க்க வாசிகளில் ஒருவராகிவிடுவார். இன்னொருவர் சொர்க்கவாசிகளின் செயலைச் செய்துவருவார். ஆனால், (இறுதியில்) அவர் நரகவாசிகளில் ஒருவராகிவிடுவார். இறுதி முடிவுகளைப் பொறுத்தே செயல்கள் தீர்மானிக்கப்படுகின்றன.16 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6608,
			"arabicnumber": 6608,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் நேர்த்திக்கடன் செய்ய வேண்டாமென்று தடை விதித்தார்கள். மேலும், “நேர்த்திக்கடன் (விதியிலுள்ள) எதையும் மாற்றிவிடாது. நேர்த்திக் கடன்மூலம் கஞ்சனிடமிருந்து (செல்வம்) வெளிக்கொணரப்படுகிறது (அவ்வளவுதான்)” என்று சொன்னார் கள்.18 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6609,
			"arabicnumber": 6609,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (அல்லாஹ் கூறினான்:) நேர்த்திக் கடனானது, நான் விதியில் எழுதியிராத எந்தவொன்றையும் மனிதனிடம் கொண்டுவந்துவிடாது. மாறாக, விதிதான் அவனை (நேர்த்திக்கடன் பக்கம்) கொண்டுசெல்கிறது. நேர்த்திக்கடன் மூலம் கஞ்சனிடமிருந்து (செல்வத்தை) வெளிக் கொணர்வதென நான் (முன்பே) விதியில் எழுதிவிட்டேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6610,
			"arabicnumber": 6610,
			"text": "அபூமூசா அப்துல்லாஹ் பின் கைஸ் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் ஒரு போரில் (கைபரில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களு டன் இருந்தோம். அப்போது நாங்கள் ஒரு மேட்டின் மீது ஏறும்போதும் ஒரு கணவாயில் இறங்கும்போதும் உரத்த குரலில் ‘அல்லாஹு அக்பர்’ (அல்லாஹ் மிகப் பெரியவன்) என்று கூறலானோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்கள் அருகில் வந்து, “மக்களே! உங்களைக் கட்டுப்படுத்திக் கொள்ளுங்கள். (மென்மையாக மெதுவாகக் கூறுங்கள்.) ஏனெனில், நீங்கள் காது கேட்காதவனையோ இங்கு இல்லாதவனையோ அழைப்பதில்லை. நன்கு செவியுறுபவனையும் (எல்லாரையும்) பார்ப்பவனையுமே அழைக்கின்றீர்கள்” என்று கூறிவிட்டு, (என்னைப் பார்த்து) “அப்துல்லாஹ் பின் கைஸே! சொர்க்கத்தின் கருவூலங்களிலுள்ள ஒரு வார்த்தையை உமக்கு நான் அறிவிக்கட்டுமா? (அது) ‘லா ஹவ்ல வ லா குவ்வத்த இல்லா பில்லாஹ்’தான் என்று சொன்னார்கள்.20 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6611,
			"arabicnumber": 6611,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (இப்புவியின் ஆட்சிக்கு இறைவனுடைய) பிரதிநிதியாக ஆக்கப்படும் எவருக்கும் இரு நெருக்கமான ஆலோசகர்கள் இருக்கவே செய்வார்கள். ஓர் ஆலோசகர், அவரை நன்மை செய்யும்படி ஏவி அதற்குத் தூண்டுகோலாக இருப்பார். மற்றோர் ஆலோசகர், அவரைத் தீமை புரியும்படி ஏவி அதற்குத் தூண்டுகோலாக இருப்பார். அல்லாஹ் (குற்றங்களிலிருந்து) யாரை பாதுகாத்தானோ அவரே மாசற்றவராக இருப்பார். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6612,
			"arabicnumber": 6612,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: விபசாரத்தில் மனிதனுக்குள்ள பங்கை இறைவன் எழுதியுள்ளான். அதை மனிதன் அடைந்தே தீருவான். (பாலுறுப்பின் விபசாரம் மட்டுமல்ல; கண்ணும் நாவும்கூட விபசாரம் செய்கின்றன.) கண் செய்யும் விபசாரம் (தவறான) பார்வையாகும். நாவு செய்யும் விபசாரம் (பாலுணர்வைத் தூண்டும்) பேச்சாகும். மனம் ஏங்குகிறது; இச்சை கொள்கிறது. பாலுறுப்பு இவை அனைத்தையும் உண்மையாக்குகிறது; அல்லது பொய்யாக்குகிறது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இதன் அறிவிப்பாளரான இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறுகிறார்கள்: நபி (ஸல்) அவர்களிடமிருந்து அபூ ஹுரைரா (ரலி) அவர்கள் அறிவித்துள்ள இந்த ஹதீஸைவிடச் சிறுபாவங்களுக்கு எடுத்துக்காட்டாக வேறெதையும் நான் காணவில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.22 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6613,
			"arabicnumber": 6613,
			"text": "இக்ரிமா (ரஹ்) அவர்கள் கூறியதாவது: “(நபியே!) உங்களுக்கு நாம் காண்பித்த (இக்)காட்சியையும், சபிக்கப்பட்ட மரத்தை (அது மறுமையில் பாவிகளுக்கு உணவாகும் என) குர்ஆனில் நாம் கூறியிருப்பதையும் இந்த மக்களுக்கு ஒரு சோதனையாகவே ஆக்கியுள்ளோம்” எனும் (17:60 ஆவது) வசனம் தொடர்பாக இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: இது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மக்காவிலிருந்து) பைத்துல் மக்திஸிற்கு அழைத்துச் செல்லப்பட்ட இரவில் அன்னாருக்குக் காட்டப்பட்ட கண்கூடான காட்சியைக் குறிக்கிறது. ‘குர்ஆனில் சபிக்கப்பட்ட மரம்’ என்பது ‘சப்பாத்திக் கள்ளி’ மரத்தைக் குறிக்கிறது.23 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6614,
			"arabicnumber": 6614,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (இறைத்தூதர்களான) ஆதம் (அலை) அவர்களும் மூசா (அலை) அவர்களும் தர்க்கம் செய்தார்கள். ஆதம் (அலை) அவர்களிடம் மூசா (அலை) அவர்கள், “ஆதம் அவர்களே! எங்கள் தந்தையான நீங்கள் (உங்கள் பாவத்தின் காரணத்தால்) எங்களை இழப்புக்குள்ளாக்கிவிட்டீர்கள்; சொர்க்கத்திலிருந்து எங்களை வெளி யேற்றிவிட்டீர்கள்” என்று சொன்னார்கள். அதற்கு ஆதம் (அலை) அவர்கள், “மூசாவே! அல்லாஹ் தன்னுடன் உரையாடுவதற்கு உம்மையே தேர்ந்தெடுத்தான்; அவன் தன் கரத்தால் (வல்லமையால்) உமக்காக (தவ்ராத் எனும் வேதத்தை) வரைந்தான். (இத்தகைய) நீங்கள், அல்லாஹ் என்னைப் படைப்பதற்கு நாற்பது ஆண்டுகளுக்கு முன்பே என்மீது அவன் விதித்துவிட்ட ஒரு விஷயத்திற்காக என்னைப் பழிக்கிறீர்களா?” என்று கேட்டார்கள். (இந்தப் பதில் மூலம்) மூசா (அலை) அவர்களை ஆதம் (அலை) அவர்கள் தோற்கடித்துவிட்டார்கள்; தோற்கடித்துவிட்டார்கள் என மூன்றுமுறை நபி (ஸல்) அவர்கள் கூறினார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.24 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6615,
			"arabicnumber": 6615,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்களால் விடுதலை செய்யப்பட்ட அவர்களின் அடிமையான வர்ராத் (ரஹ்) அவர்கள் கூறியதாவது: முஆவியா (ரலி) அவர்கள், முஃகீரா (ரலி) அவர்களுக்குக் கடிதம் எழுதி, நபி (ஸல்) அவர்கள் தொழுகைக்குப்பின் ஓதிய துஆக்களில் நீங்கள் செவியுற்றதை எனக்கு எழுதி அனுப்புங்கள் என்று குறிப்பிட்டிருந்தார்கள். அப்போது (பின்வருமாறு பதில்) எழுதுமாறு முஃகீரா (ரலி) அவர்கள் என்னிடம் கூறினார்கள்: தொழுகைக்குப்பின் நபி (ஸல்) அவர்கள் “லா இலாஹ இல்லல்லாஹு வஹ்தஹு லா ஷரீக்க லஹு. அல்லாஹும்ம லா மானிஅ லிமா அஉதைத்த வ லா முஉத்திய லிமா மனஉத்த வலா யன்ஃபஉ தல்ஜத்தி மின்கல் ஜத்” என்று கூறுவதை நான் கேட்டேன். (பொருள்: அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை. அவன் தனித்தவன். அவனுக்கு இணையானவன் எவனுமில்லை. இறைவா! நீ கொடுப்பதைத் தடுப்பவர் யாருமில்லை. நீ தடுப்பதைக் கொடுப்பவர் யாருமில்லை. எந்தச் செல்வரின் செல்வமும் அவருக்கு உன்னிடம் பயன் (ஏதும்) அளிக்காது.) இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில் இப்னு ஜுரைஜ் (ரஹ்) அவர்கள் கூறியிருப்பதாவது: இதை வர்ராத் (ரஹ்) அவர்கள் தமக்குத் தெரிவித்ததாக அப்தா பின் அபீலுபாபா (ரஹ்) அவர்கள் என்னிடம் தெரிவித்தார்கள். பின்னர் தாம் முஆவியா (ரலி) அவர்களிடம் சென்றதாகவும், அப்போது முஆவியா (ரலி) அவர்கள் இந்த துஆவை ஓதும்படி மக்களுக்குக் கட்டளையிட்டதைக் கண்டதாகவும் அப்தா கூறினார்கள்.25 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6616,
			"arabicnumber": 6616,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நீங்கள் அல்லாஹ்விடம் தாங்கமுடியாத சோதனை, அழிவில் வீழ்வது, விதியின் கேடு, எதிரிகளால் ஏற்படும் மன உளைச்சல் ஆகியவற்றிலிருந்து பாதுகாப்புக் கோருங்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.26 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6617,
			"arabicnumber": 6617,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (சத்தியம் செய்வதாக இருந்தால்) “இல்லை. உள்ளங்களைப் புரட்டக்கூடியவன் மீதாணையாக!” என்றே பெரும்பாலும் சத்தியம் செய்வார்கள். அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6618,
			"arabicnumber": 6618,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: இப்னு ஸய்யாதிடம் நபி (ஸல்) அவர்கள், “நான் (உன்னைச் சோதிப்ப தற்காக) ஒன்றை மனத்தில் மறைத்து வைத்துள்ளேன். (அது என்னவென்று சொல்)” என்று கேட்டார்கள். அப்போது நபி (ஸல்) அவர்கள் ‘அத்துகான்’ எனும் 44ஆவது அத்தியாயத்தின் 10ஆவது வசனத்தை மனத்திற்குள் நினைத்துக் கொண்டார்கள். அதற்கு இப்னு ஸய்யாத், “(அது) ‘அத்துக்’ என்றான். உடனே நபி (ஸல்) அவர்கள் “தூர விலகிப்போ! நீ உன் எல்லையைத் தாண்டிவிட முடியாது” என்று சொன்னார்கள். (அருகிலிருந்த) உமர் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! இவனைக் கொன்றுவிட எனக்கு அனுமதியளியுங்கள்” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “இவனை விட்டுவிடுங்கள். இவன் அவனாக (தஜ்ஜாலாக) இருந்தால், இவனை நீங்கள் கொல்ல முடியாது. (ஏனெனில், இவனைக் கொல்ல வேறொருவர்-நபி ஈசா-வருவார் என்பது இறைவனின் ஏற்பாடு.) இவன் அவனாக இல்லையாயின், இவனைக் கொல்வதில் உங்களுக்கு எந்த நன்மையும் இல்லை” என்று கூறினார்கள்.28 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6619,
			"arabicnumber": 6619,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொள்ளைநோய் குறித்துக் கேட்டேன். அதற்கு அவர்கள், “அது, தான் நாடியவர்கள்மீது அல்லாஹ் அனுப்புகின்ற வேதனையாக இருந்தது. பிறகு அதை இறைநம்பிக்கையாளர்களுக்கு அல்லாஹ் கருணையாக ஆக்கிவிட்டான். ஆகவே, அந்த நோய் (பரவி) உள்ள ஓர் ஊரில் ஓர் அடியார், தமக்கு அல்லாஹ் எழுதிய விதிப்படியே தவிர எந்த நோயும் தம்மைத் தீண்டாது என உறுதிபூண்டவராகப் பொறுமையோடும் நன்மையை எதிர்பார்த்தும் அந்த ஊரிலிருந்து வெளியேறாமல் அங்கேயே தங்கியிருந்தால் உயிர்த் தியாகிக்குக் கிடைக்கும் நன்மையைப் போன்று அவருக்கும் கிடைக்கும்” என்று பதிலளித்தார்கள்.29 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6620,
			"arabicnumber": 6620,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: அகழ்ப் போரின்போது நபி (ஸல்) அவர்கள் எங்களுடன் மண்ணைச் சுமந்து எடுத்துச் சென்றுகொண்டிருப்பதை நான் கண்டேன். அப்போது அவர்கள் (இவ்வாறு பாடியவண்ணம்) கூறிக்கொண்டிருந்தார்கள்: இறை ஆணை!இறைவன் (மட்டும்)இல்லாவிட்டால்நாங்கள்நல்வழி அடைந்திருக்கமாட்டோம்!நோன்பு நோற்றிருக்கமாட்டோம்!தொழுதும் இருக்கமாட்டோம்! எனவே,எங்கள்மீதுபொழிவாயாக அமைதியை!(எதிரிகளை)நாங்கள் சந்திக்கும்போதுபாதங்களைஉறுதிப்படுத்துவாயாக! இணைவைப்பாளர்கள்எங்களுக்குஅநீதியிழைத்துவிட்டனர்எங்களைச்சோதனையில் ஆழ்த்தஇவர்கள்விரும்பினாலும்இடம் தரமாட்டோம்.30 அத்தியாயம் : 82",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 26
			}
		}
	]
}