{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6708,
			"arabicnumber": 6708,
			"text": "கஅப் பின் உஜ்ரா (ரலி) அவர்கள் கூறியதாவது: நான் (ஹஜ்ஜின்போது) நபி (ஸல்) அவர்களிடம் சென்றேன். அப்போது அவர்கள் ‘அருகில் வா!’ என்று அழைத் தார்கள். ஆகவே, நான் அவர்கள் அருகில் சென்றேன். அப்போது அவர்கள் “உமது (தலையிலுள்ள) பேன்கள் உமக்குத் துன்பம் தருகின்றனவா?” என்று கேட்டார்கள். நான் ‘ஆம்’ என்றேன். அவர்கள் “நோன்பு நோற்றல், அல்லது தர்மம் செய்தல், அல்லது பலியிடல் பரிகாரமாகும்” (2:196) என்று சொன்னார்கள். அய்யூப் (ரஹ்) அவர்கள் கூறினார்கள்: நோன்பு என்பது மூன்று நாட்கள் நோன்பு நோற்பதையும், பலியிடல் என்பது ஓர் ஆட்டைக் குர்பானி கொடுப்பதையும், தர்மம் என்பது ஆறு ஏழைகளுக்கு உணவளிப்பதையும் குறிக்கும்.4 அத்தியாயம் : 84",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6709,
			"arabicnumber": 6709,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் ஒரு மனிதர் வந்து, “அல்லாஹ்வின் தூதரே! நான் அழிந்துவிட்டேன்” என்றார். நபி (ஸல்) அவர்கள். “உமக்கு என்ன நேர்ந்தது?” என்று கேட்டார்கள். “நான் ரமளானில் (நோன்பு வைத்துக்கொண்டே) என் மனைவியுடன் தாம்பத்திய உறவு கொண்டுவிட்டேன்” என்று அவர் சொன்னார். நபி (ஸல்) அவர்கள் “ஓர் அடிமையை விடுதலை செய்ய உம்மால் முடியுமா?” என்று கேட்டார்கள். அவர் “இல்லை” என்றார். “தொடர்ந்து இரு மாதங்கள் நோன்பு நோற்க உம்மால் முடியுமா?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அவர் “இல்லை” என்றார். “அறுபது ஏழைகளுக்கு உணவளிக்க உம்மால் முடியுமா?” என்று நபி (ஸல்) அவர்கள் கேட்க, அதற்கும் அவர் “இல்லை” என்றார். நபி (ஸல்) அவர்கள் “அமர்வீராக!” என்றார்கள். அவரும் அமர்ந்தார். பின்னர் நபி (ஸல்) அவர்களிடம் பேரீச்சம்பழம் நிறைந்த ‘அரக்’ ஒன்று கொண்டுவரப்பட்டது. -’அரக்’ என்பது பெரிய கூடை ஆகும்.- அப்போது நபி (ஸல்) அவர்கள் “இதைப் பெற்று தர்மம் செய்வீராக!” என்று கூறினார்கள். அம்மனிதர், “(அல்லாஹ்வின் தூதரே!) என்னைவிட ஏழையாக இருப்போருக்கா (நான் தர்மம் செய்ய வேண்டும்)?” என்று கேட்டார். அப்போது நபி (ஸல்) அவர்கள் தம் கடைவாய்ப் பற்கள் தெரியும் அளவுக்குச் சிரித்தார்கள். பிறகு “இதை உம்முடைய குடும்பத்தாருக்கே உண்ணக் கொடுத்துவிடுவீராக!” என்றார்கள்.5 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6710,
			"arabicnumber": 6710,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களி டம் ஒரு மனிதர் வந்து, “(அல்லாஹ்வின் தூதரே!) நான் அழிந்துவிட்டேன்” என்றார். நபி (ஸல்) அவர்கள் “என்ன அது?” என்று கேட்டார்கள். “நான் ரமளானில் (நோன்பு வைத்துக்கொண்டே) என் மனைவியுடன் தாம்பத்திய உறவு கொண்டுவிட்டேன்” என்று அவர் சொன்னார். நபி (ஸல்) அவர்கள் “(விடுதலை செய்வதற்கு) ஓர் அடிமை உம்மிடம் இருக்கிறாரா?” என்று கேட்டார்கள். அவர் “இல்லை” என்றார். “தொடர்ந்து இரு மாதங்கள் நோன்பு நோற்க உமக்குச் சக்தி இருக்கிறதா?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அவர் “இல்லை” என்றார். “அறுபது ஏழைகளுக்கு உணவளிக்க உமக்குச் சக்தியிருக்கிறதா?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அதற்கும் அவர் “இல்லை” என்றார். பின்னர் அன்சாரிகளில் ஒருவர் ‘அரக்’ ஒன்றைக் கொண்டுவந்தார். -’அரக்’ என்பது பேரீச்சம்பழம் உள்ள கூடை ஆகும்.- அப்போது நபி (ஸல்) அவர்கள் “இதைக் கொண்டுசென்று தர்மம் செய்வீராக!” என்று கூறினார்கள். அதற்கு அம்மனிதர், “அல்லாஹ்வின் தூதரே! எங்களைவிட ஏழையாக இருப்போருக்கா (நான் தர்மம் செய்ய வேண்டும்)? சத்தியத்தோடு உங்களை அனுப்பிய (இறை)வன்மீது ஆணையாக! மதீனாவின் (பாறைகள் நிறைந்த) இரண்டு மலைகளுக்கும் இடைப்பட்ட பகுதியில் எங்களைவிடப் பரமஏழை வீட்டார் யாருமில்லை!” என்று கூறினார். பிறகு “நீ போய் இதை உம் குடும்பத்தாருக்கே உண்ணக்கொடுப்பீராக!” என்று நபி (ஸல்) அவர்கள் கூறினார்கள்.6 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6711,
			"arabicnumber": 6711,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் ஒரு மனிதர் வந்து, “(அல்லாஹ்வின் தூதரே!) நான் அழிந்துவிட்டேன்!” என்றார். நபி (ஸல்) அவர்கள் “உமக்கு என்ன நேர்ந்தது?” என்று கேட்டார்கள். “நான் ரமளானில் (நோன்பு நோற்றுக்கொண்டே) என் மனைவியுடன் தாம்பத்திய உறவு கொண்டுவிட்டேன்” என்று அவர் சொன்னார். நபி (ஸல்) அவர்கள், “ஓர் அடிமையை விடுதலை செய்யும் வசதியைப் பெற்றுள்ளீரா?” என்று கேட்டார்கள். அவர் “இல்லை” என்றார். “தொடர்ந்து இரு மாதம் நோன்பு நோற்க உமக்குச் சக்தி இருக்கிறதா?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அவர் “இல்லை” என்றார். “அறுபது ஏழைகளுக்கு உணவளிக்க உமக்குச் சக்தியிருக்கிறதா?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அதற்கும் அவர் “என்னால் இயலாது” என்றார். பின்னர் நபி (ஸல்) அவர்களிடம் பேரீச்சம்பழம் உள்ள கூடை ஒன்று கொண்டுவரப்பட்டது. அப்போது நபி (ஸல்) அவர்கள், “இதை எடுத்துச் சென்று தர்மம் செய்வீராக!” என்று கூறினார்கள். அப்போது அம்மனிதர். “என்னைவிட ஏழையாக இருப்போருக்கா (நான் தர்மம் செய்ய வேண்டும்)? மதீனாவின் (பாறைகள் நிறைந்த) இரண்டு மலைகளுக்கும் இடைப்பட்ட பகுதியில் எங்களைவிடப் பரமஏழைகள் யாருமில்லை” என்று கூறினார். பிறகு, நபி (ஸல்) அவர்கள் “இதை எடுத்துச் சென்று உம்முடைய குடும்பத்தாருக்கே உண்ணக் கொடுத்துவிடுவீராக!” என்றார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6712,
			"arabicnumber": 6712,
			"text": "சாயிப் பின் யஸீத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களின் காலத்தில் ‘ஸாஉ’ என்பது, இன்றைக்கு (நடைமுறை யிலிருக்கும்) உங்களது ‘முத்’தில் ஒரு ‘முத்’தும் மூன்றில் ஒரு பாகமும் (1 1/3) கொண்டதாக இருந்தது. பின்னர் உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்களது காலத்தில் இதன் அளவு அதிகமாக்கப் பட்டது.8 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6713,
			"arabicnumber": 6713,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் ரமளான் மாத (ஸதகத்துல் ஃபித்ர்) தர்மத்தை ஆரம்ப(க் கால) ‘முத்’தான நபி (ஸல்) அவர்களின் ‘முத்’தைக் கொண்டே வழங்கிவந்தார்கள். மேலும், சத்திய (முறிவுக்கான) பரிகாரத்தையும் நபி (ஸல்) அவர்களின் ‘முத்’தைக் கொண்டே வழங்கிவந்தார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) அபூகுதைபா (ரஹ்) அவர்கள் கூறுகிறார்கள்: மாலிக் பின் அனஸ் (ரஹ்) அவர்கள், “(மதீனாவில் வழக்கிலுள்ள) எங்களது ‘முத்’தே (ஹிஷாம் உருவாக்கிய) உங்களது ‘முத்’தைவிட (அளவில் சிறியதானாலும் வளத்தில்) பெரியதாகும். நபி (ஸல்) அவர்களது (காலத்தில் இருந்த மதீனா) ‘முத்’தில் தவிர வேறொன்றில் சிறப்பு இருப்பதாக நாங்கள் கருதவில்லை” என்று கூறினார்கள். மேலும், அவர்கள் என்னிடம் “ஓர் ஆட்சியாளர் உங்களிடம் வந்து நபி (ஸல்) அவர்களது ‘முத்’தைவிட (அளவில்) சிறியதொரு ‘முத்’தை நிர்ணயித்தால், நீங்கள் எந்த அளவையைக் கொண்டு (ரமளான் தர்மம், பரிகாரம் ஆகியவற்றை) வழங்குவீர்கள்?” என்று கேட்டார்கள். அதற்கு நான், “நபி (ஸல்) அவர்களது ‘முத்’தைக் கொண்டே வழங்குவோம்” என்று கூறினேன். அவர்கள் “பார்த்தீர்களா? (இறுதியில்) விஷயம் நபி (ஸல்) அவர்களது ‘முத்’துக்கே வந்து சேர்கிறது” என்றார்கள்.9 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6714,
			"arabicnumber": 6714,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இறைவா! (மதீனாவாசிகளான) இவர்களுக்கு இவர்களின் அளவை களான ‘ஸாஉ’ மற்றும் ‘முத்’ ஆகியவற்றில் வளம் சேர்ப்பாயாக” என்று பிரார்த்தித்தார்கள்.10 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6715,
			"arabicnumber": 6715,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிமான அடிமையை எவர் விடுதலை செய்கிறாரோ (விடுதலை செய்யப்பட்ட) அந்த முஸ்லிமின் ஒவ்வொரு உறுப்புக்கும் பகரமாக (விடுதலை செய்தவரின்) ஓர் உறுப்பை நரகத்திலிருந்து அல்லாஹ் விடுதலை செய்வான். அவரது பாலுறுப்புக்குப் பதிலாக இவரது பாலுறுப்பையும் விடுதலை செய்வான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.12 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6716,
			"arabicnumber": 6716,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: அன்சாரிகளில் ஒருவர் தம்முடைய அடிமை ஒருவனைத் தமது இறப்புக்குப் பின் விடுதலை பெற்றவனாவான் என்று அறிவித்திருந்தார். ஆனால், அவரிடம் அந்த அடிமையைத் தவிர வேறு செல்வம் எதுவுமிருக்கவில்லை. இந்த விஷயம் நபி (ஸல்) அவர்களுக்கு எட்டியபோது, “என்னிடமிருந்து இவனை (விலைக்கு) வாங்குபவர் யார்?” என்று கேட்டார்கள். அப்போது அவனை நுஐம் பின் நஹ்ஹாம் (ரலி) அவர்கள் எண்ணூறு திர்ஹங்களுக்கு (வெள்ளிக் காசுகளுக்கு) வாங்கிக்கொண்டார்கள். (அறிவிப்பாளர்களில் ஒருவரான) அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறுகிறார்கள்: ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள், “அவன் (எகிப்து நாட்டு) கிப்தீ அடிமையாவான். அவன் (இப்னுஸ் ஸுபைர் (ரலி) அவர்களின் ஆட்சியின்) முதலாவது ஆண்டில் இறந்துவிட்டான்” என்றும் கூறக் கேட்டேன்.14 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6717,
			"arabicnumber": 6717,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (அடிமையாயிருந்த) பரீராவை நான் விலைக்கு வாங்க விரும்பினேன். ஆனால், அவருக்கு வாரிசாகும் உரிமை தங்களுக்கே இருக்க வேண்டுமென அவருடைய எசமான்கள் முன்நிபந்தனை விதித்தார்கள். ஆகவே, இது தொடர்பாக நபி (ஸல்) அவர்களிடம் தெரிவித்தேன். அப்போது அவர்கள், “பரீராவை விலைக்கு வாங்கி (விடுதலை செய்து)விடு! ஏனெனில், விடுதலை செய்தவருக்கே வாரிசுரிமை சொந்தம்” என்று சொன்னார்கள்.16 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6718,
			"arabicnumber": 6718,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நான் (என்) அஷ்அரீ குலத்தாரில் ஒரு குழுவினருடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று (எங்களையும் எங்கள் பயணச் சுமைகளையும்) சுமந்து செல்ல (ஒட்டகங்கள் ஏற்பாடு) செய்யும்படி கேட்டேன். அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நான் உங்களை (ஒட்டகத்தில்) ஏற்றியனுப்ப முடியாது. ஏனெனில், உங்களை ஏற்றியனுப்பத் தேவையான (வாகன) ஒட்டகங்கள் என்னிடம் (தற்போது கைவசம்) இல்லை” என்று சொன்னார்கள். பிறகு அல்லாஹ் நாடிய நேரம்வரை நாங்கள் (அங்கேயே) இருந்தோம். பின்பு சில ஒட்டகங்கள் கொண்டுவரப்பட்டன. அவற்றில் மூன்று ஒட்டக மந்தைகளை எங்களுக்கு வழங்கும்படி ஆணையிட்டார்கள். (அவற்றில் ஏறி) நாங்கள் சென்றபோது, எங்களில் சிலர் சிலரிடம், “நபி (ஸல்) அவர்களிடம் நம்மைச் சுமந்து செல்ல ஒட்டகங்கள் ஏற்பாடு செய்யும்படி கேட்டோம். அவ்வாறு நம்மை ஏற்றியனுப்பத் தம்மால் இயலாது என நபியவர்கள் சத்தியம் செய்து கூறினார்கள். பிறகு, நாம் ஏறிச்செல்ல ஒட்டகங்கள் வழங்கினார்கள் அல்லாஹ்வின் மீதாணையாக! நபி (ஸல்) அவர்கள் தரமாட்டேனென்று சத்தியம் செய்த பிறகு இவற்றை நாம் வாங்கிச் சென்றால் இவற்றில் நமக்கு வளம் (பரக்கத்) ஏற்படாதே!” என்று கூறினார்கள். ஆகவே, நாங்கள் நபி (ஸல்) அவர்களிடம் (திரும்பவும்) சென்று, அவர்களுக்கு அதை நினைவு படுத்தினோம். அப்போது அவர்கள், “நான் உங்களை ஒட்டகத்தில் ஏற்றி அனுப்பவில்லை; மாறாக, அல்லாஹ்தான் உங்களை (அதில்) ஏற்றி அனுப்பினான். அல்லாஹ்வின் மீதாணையாக! அவன் நாடினால், நான் இனிமேல் ஏதேனும் ஒரு சத்தியம் செய்து, பிறகு அதுவல்லாத வேறொன்றை அதைவிடச் சிறந்ததாகக் கருதும்பட்சத்தில் சிறந்ததையே செய்வேன்; சத்தியத்தை முறித்ததற்காகப் பரிகாரம் செய்துவிடுவேன்” என்று சொன்னார்கள்.18 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6719,
			"arabicnumber": 6719,
			"text": "(மேற்கண்ட ஹதீஸில்) நபி (ஸல்) அவர்கள் கூறினார்கள்: இனிமேல் நான் ஏதேனும் ஒரு சத்தியம் செய்து, அதுவல்லாத வேறொன்றை அதைவிடச் சிறந்ததாகக் கருதும்பட்சத்தில், ‘சத்திய முறிவுக்காகப் பரிகாரம் செய்துவிட்டு அந்தச் சிறந்ததையே செய்வேன்’. அல்லது ‘சிறந்ததையே செய்துவிட்டுப் பரிகாரம் செய்துவிடுவேன்’. இதை ஹம்மாத் பின் ஸைத் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6720,
			"arabicnumber": 6720,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (இறைத்தூதர்) சுலைமான் (அலை) அவர்கள் (ஒரு முறை), “நான் இன்றிரவு (என்னுடைய) தொண்ணூறு துணைவியரிடமும் சென்று (தாம்பத்திய உறவு கொண்டு) வருவேன். அவர்களில் ஒவ்வொருவரும் அல்லாஹ்வின் பாதையில் அறப்போர் புரியும் (குதிரை) வீரன் ஒருவனைப் பெற்றெடுப்பார்கள்” என்று கூறினார்கள். அப்போது அவர்களுடைய தோழர் ஒருவர், -அவர் ஒரு வானவர் என அறிவிப்பாளர்களில் ஒருவரான சுஃப்யான் (ரஹ்) அவர்கள் கூறுகிறார்கள்- “இன்ஷா அல்லாஹ் (அல்லாஹ் நாடினால்) என்று சொல்லுங்கள்” எனக் கூறினார். சுலைமான் (அலை) அவர்கள் ‘இன்ஷா அல்லாஹ்’ என்று கூற மறந்துவிட்டார்கள்; தம் துணைவியரிடம் சென்று வந்தார்கள். ஆனால், அவர்களுடைய துணைவியரில் ஒரே ஒருவரைத் தவிர வேறெவரும் கர்ப்பமடையவில்லை. அந்த ஒருவரும் ஒரு புஜமுடைய அரை மனிதரையே பெற்றெடுத்தார். (நபி) சுலைமான் (அலை) அவர்கள் ‘இன்ஷா அல்லாஹ்’ (அல்லாஹ் நாடினால்) என்று கூறியிருந்தால் சத்தியத்தை அடையாமல் இருந்திருக்கமாட்டார்கள். தமது தேவையைப் பூர்த்தி செய்திருப்பார்கள்.19 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6721,
			"arabicnumber": 6721,
			"text": "ஸஹ்தம் பின் முளர்ரிப் அல் ஜர்மீ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களிடம் இருந்தோம். ‘ஜர்ம்’ குலத்தாரான எங்களுக்கும் இந்த (அஷ்அரீ) குலத்தாருக்கும் இடையே நட்புறவும் ஒத்துழைப்பும் இருந்தது. அப்போது (அபூமூசா அவர்களுக்கு) உணவு கொண்டுவரப்பட்டது. அந்த உணவில் கோழி இறைச்சி இருந்தது. அங்கு பனூ தைமுல்லாஹ் குலத்தைச் சேர்ந்த சிவப்பு மனிதர் ஒருவர் இருந்தார். அவர் ஓர் அடிமையைப் போன்று காணப்பட்டார். அவர் (உணவின் பக்கம்) நெருங்கவில்லை. ஆகவே, அவரிடம் அபூமூசா “அருகில் வாருங்கள். ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோழி இறைச்சி உண்பதை நான் பார்த்திருக்கிறேன்” என்றார்கள். அதற்கு அவர், “இந்தக் கோழி (இனம்) நான் அருவருப்பாகக் கருதும் ஒன்றைத் தின்னப் பார்த்தேன். உடனே ஒரு போதும் இதை நான் உண்ணமாட்டேன் என்று சத்தியம் செய்துவிட்டேன்” என்றார். அப்போது அபூமூசா (ரலி) அவர்கள் “அருகில் வாருங்கள். அது குறித்து உங்களுக்குத் தெரிவிக்கிறேன்” என்று சொல்லிவிட்டு(ப் பின்வருமாறு) கூறலானார்கள்: நாங்கள் அஷ்அரீ குலத்தார் சிலர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றோம். அப்போது அவர்கள் தர்ம ஒட்டகங்களில் சிலவற்றை பங்கிட்டுக் கொண்டிருந்தார்கள். நான் (எங்களைச்) சுமந்துசெல்ல ஒட்டகங்கள் தருமாறு அவர்களிடம் கேட்டேன். -அப்போது நபியவர்கள் கோபமாக இருந்தார்கள் என்று அறிவிப்பாளர் கூறியதாகவே நான் கருதுகிறேன் என அய்யூப் (ரஹ்) அவர்கள் கூறினார்கள்- அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நான் உங்களை (ஒட்டகத்தில்) ஏற்றியனுப்ப முடியாது. ஏனெனில், உங்களை ஏற்றியனுப்பத் தேவையான (ஊர்தி) ஒட்டகங்கள் என்னிடம் (தற்போது கைவசம்) இல்லை” என்று சொன்னார்கள். ஆகவே, நாங்கள் சென்றுவிட்டோம். பிறகு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் போரில் கிடைத்த ஒட்டகங்கள் கொண்டுவரப்பட்டன. உடனே “இந்த அஷ்அரீகள் எங்கே? இந்த அஷ்அரீகள் எங்கே?” என்று வினவப்பட்டது. இதையடுத்து நாங்கள் (நபியவர்களிடம்) சென்றோம். அப்போது வெள்ளைத் திமில்கள் கொண்ட ஐந்து ஒட்டக மந்தைகளை எங்களுக்கு வழங்கும்படி உத்தரவிட்டார்கள். (அவற்றைப் பெற்றுக்கொண்டு) விரைவாக நாங்கள் புறப்பட்டோம். அப்போது நான் என் தோழர்களிடம், “நாம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று நாம் ஏறிச்செல்ல வாகனம் கேட்டோம். அவ்வாறு நம்மை ஏற்றியனுப்ப இயலாது என அவர்கள் சத்தியம் செய்தார்கள். பிறகு நம்மை அழைத்து ஏற்றியனுப்பினார்கள். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தாம் செய்த சத்தியத்தை மறந்துவிட்டார்கள். அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தாம் செய்த சத்தியத்தை மறக்கும்படி நாம் செய்திருந்தால் ஒருபோதும் நாம் வெற்றியடையமாட்டோம். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் திரும்பச் சென்று, அவர்கள் செய்த சத்தியத்தை அவர்களுக்கு நாம் நினைவுபடுத்துவோம்” என்று கூறினேன். ஆகவே, நாங்கள் திரும்பச் சென்று, “அல்லாஹ்வின் தூதரே! நாங்கள் ஒட்டகம் கேட்டுத் தங்களிடம் வந்தோம். எங்களுக்குத் தரமுடியாது எனத் தாங்கள் சத்தியம் செய்தீர்கள். பிறகு எங்களை (அழைத்து) ஒட்டகங்களில் ஏற்றியனுப்பினீர்கள். ஆகவே, தாங்கள் செய்த சத்தியத்தை மறந்துவிட்டீர்களென நாங்கள் ‘எண்ணுகிறோம்’ அல்லது ‘அறிகிறோம்’ என்று கூறினோம். அதற்கு நபி (ஸல்) அவர்கள், “செல்லுங்கள். நான் உங்களை ஒட்டகத் தில் ஏற்றியனுப்பவில்லை. மாறாக, அல்லாஹ்தான் உங்களை அதில் ஏற்றியனுப்பினான். அல்லாஹ்வின் மீதாணையாக! அல்லாஹ் நாடினால், இனிமேல் நான் எந்த ஒன்றுக்காகவும் சத்தியம் செய்து, பிறகு அது அல்லாத வேறொன்றை அதைவிடச் சிறந்ததாகக் கருதும்பட்சத்தில் அந்தச் சிறந்ததையே நான் செய்வேன். சத்திய முறிவுக்காகப் பரிகாரம் செய்துவிடுவேன்” என்று கூறினார்கள்.21 இந்த ஹதீஸ் ஆறு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6722,
			"arabicnumber": 6722,
			"text": "அப்துர் ரஹ்மான் பின் சமுரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னிடம்) “ஆட்சிப் பொறுப்பை நீயாக (விரும்பிக்) கேட்காதே! ஏனெனில், நீ கேட்காமல் அது உனக்கு வழங்கப்பட்டால், அது தொடர்பாக உனக்கு (இறைவனது) உதவி அளிக்கப்படும். (நீ) கேட்டதால் அது உனக்கு வழங்கப்பட்டால் அதோடு நீ (தனிமையில்) விடப்படுவாய். (இறைவனது உதவி கிட்டாது.) நீ ஒரு சத்தியம் செய்து, அதுவல்லாத வேறொன்றை அதைவிடச் சிறந்ததாக நீ கருதினால், அந்தச் சிறந்ததைச் செய்துவிட்டு, உனது சத்தியத்(தை முறித்த)துக்கான பரிகாரத்தைச் செய்துவிடு” என்று கூறினார்கள்.22 இந்த ஹதீஸ் பத்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 15
			}
		}
	]
}