{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6723,
			"arabicnumber": 6723,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் அல்அன்சாரி (ரலி) அவர்கள் கூறியதாவது: நான் (ஒருமுறை) நோய்வாய்ப்பட்டேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் என்னை உடல் நலம் விசாரிக்க நடந்தே வந்தனர். என்னிடம் அவர்கள் வந்தபோது நான் மயக்கமுற்றிருந்தேன். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அங்கத் தூய்மை (உளூ) செய்தார்கள். பிறகு அந்தத் தண்ணீரை என்மீது ஊற்றினார்கள். உடனே நான் மயக்கம் தெளிந்(து கண்விழித்)தேன். அப்போது நான்,”அல்லாஹ்வின் தூதரே! என் செல்வத்தை நான் என்ன செய்ய வேண்டும்? என் செல்வத்தின் விஷயத்தில் நான் என்ன முடிவு செய்ய வேண்டும்?” என்று கேட்டேன். அப்போது அவர்கள் எனக்குப் பதிலேதும் கூறவில்லை. முடிவில் வாரிசுரிமை தொடர்பான (மேற்கண்ட வசனம்) இறங்கிற்று.4 அத்தியாயம் : 85",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6724,
			"arabicnumber": 6724,
			"text": "அல்லாஹ்வின் தூதலிர் (ஸல்) அவர்கள் கூறினார்கள்: (அடிப்படையில்லாமல் பிறர்மீது) சந்தேகம் கொள்வது குறித்து உங்களை நான் எச்சரிக்கிறேன். ஏனெனில், இவ்வாறு சந்தேகம் கொள்வது மாபெரும் பொய்யாகும். (மற்றவர்களின் குறைகளை) துருவித்துருவி ஆராயாதீர்கள். ஒட்டுக் கேட்காதீர்கள். ஒருவர்மீது ஒருவர் கோபம் கொள்ளாதீர்கள்; பிணங்கிக்கொள்ளாதீர்கள். (மாறாக,) அல்லாஹ்வின் அடியார்களே! (அன்பு பாராட்டுவதில்) சகோதரர்களாய் இருங்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.5 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6726,
			"arabicnumber": 6726,
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6727,
			"arabicnumber": 6727,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (இறைத்தூதர்களான) எங்களுக்கு யாரும் (சொத்தில்) வாரிசாவதில்லை. நாங்கள் விட்டுச்செல்பவையெல்லாம் தர்மமே. இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6728,
			"arabicnumber": 6728,
			"text": "முஹம்மத் பின் ஜுபைர் பின் முத்இம் (ரஹ்) அவர்கள் கூறியதாவது: நான் மாலிக் பின் அவ்ஸ் பின் அல் ஹதஸான் (ரஹ்) அவர்களிடம் சென்று (ஃபதக் தொடர்பான நிகழ்ச்சி குறித்துக்) கேட்டேன். அவர்கள் கூறினார்கள்: நான் உமர் (ரலி) அவர்களிடம் சென்று அவர்களின் அறைக்குள் நுழைந்தேன். அப்போது உமர் (ரலி) அவர்களின் மெய்க்காவலர் ‘யர்ஃபஉ’ என்பவர் அவர்களிடம் வந்து, “உஸ்மான் (ரலி), அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி), ஸுபைர் பின் அல்அவ்வாம் (ரலி), சஅத் பின் அபீவக்காஸ் (ரலி) ஆகியோர் தங்களைச் சந்திக்கத் தங்களுக்கு இசைவு உண்டா?” என்று கேட்டார். உமர் (ரலி) அவர்கள், ‘ஆம்’ என்று கூறி, அவர்களுக்கு அனுமதியளித்தார்கள். (சற்று நேரத்திற்குப்) பிறகு யர்ஃபஉ (வந்து), “அலீ (ரலி) அவர்களையும் அப்பாஸ் (ரலி) அவர்களையும் சந்திப்பதில் தங்களுக்கு இசைவு உண்டா?” என்று கேட்டார். ‘ஆம்’ என்றார்கள். (அனுமதிக்குப்பின் அவர்கள் இருவரும் உள்ளே வந்தனர்). அப்பாஸ் (ரலி) அவர்கள், “இறை நம்பிக்கையாளர்களின் தலைவரே! எனக் கும் இவருக்கும் (அலீக்கும்) இடையே (இந்தச் சொத்து தொடர்பாகத்) தீர்ப்ப ளியுங்கள்” என்று சொன்னார்கள். உமர் (ரலி) அவர்கள், “வானமும் பூமியும் எந்த அல்லாஹ்வின் கட்டளை யால் நிலைபெற்றிருக்கின்றனவோ அவன் பொருட்டால் கேட்கின்றேன்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(இறைத்தூதர்களான) எங்களுக்கு எவரும் (சொத்தில்) வாரிசாகமாட்டார். நாங்கள் விட்டுச்செல்வதெல்லாம் தர்மமே” என்று தம்மைக் குறித்துக் கூறியதை நீங்கள் அறிவீர்களா?” என்று கேட்டார்கள். அதற்கு (அங்கிருந்த) அந்தக் குழுவினர், “நபியவர்கள் அவ்வாறு சொல்லத்தான் செய்தார்கள்” என்று பதிலளித்தனர். உமர் (ரலி) அவர்கள், அலீ (ரலி) அவர்களையும் அப்பாஸ் (ரலி) அவர்களையும் நோக்கி, “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவ்வாறு சொன்னதை நீங்கள் அறிவீர்களா?” என்று கேட்டார்கள். அவ்விருவரும், “(ஆம்) அவ்வாறு சொல்லியிருக்கிறார்கள்” என்று பதிலளித்தனர். உமர் (ரலி) அவர்கள், “அவ்வாறெனில், உங்களிடம் இந்த விஷயம் குறித்துப் பேசுகிறேன்: (போரிடாமல் கிடைத்த) இந்த (ஃபய்உ)ச் செல்வத்திலிருந்து சிறிதளவைத் தன் தூதருக்கு உரியதாக அல்லாஹ் ஆக்கினான். அவர்களைத் தவிர வேறெவருக்கும் அவன் அதை வழங்கவில்லை” என்று கூறிவிட்டு, “அல்லாஹ் எந்தச் செல்வத்தை (எதிரிகளான) அவர்களின் பிடியிலிருந்து விடுவித்துத் தன் தூதரிடம் திருப்பிக் கொடுத்தானோ அந்தச் செல்வம் உங்கள் குதிரைகளையும் ஒட்டகங்களையும் (அறப்போர் புரிவதற்காக) நீங்கள் ஓட்டிச்சென்றதால் கிடைத்ததன்று. மாறாக அல்லாஹ், தான் நாடுகின்றவர்களின் மீது தன்னுடைய தூதர்களுக்கு அதிகாரம் வழங்குகின்றான். மேலும், அல்லாஹ் அனைத்தின் மீதும் பேராற்றல் உள்ளவனாக இருக்கின்றான்” எனும் (59:6ஆவது) இறைவசனத்தை ஓதினார்கள். தொடர்ந்து, “எனவே, இது இறைத் தூதருக்கென ஒதுக்கப்பட்ட செல்வமாகும். அல்லாஹ்வின் மீதாணையாக! உங்களை விட்டுவிட்டு அதை அவர்கள் தமக்காகச் சேகரித்துக்கொள்ளவில்லை; அதை உங்களைவிடப் பெரிதாகக் கருதவுமில்லை. உங்களுக்கு அதைக் கொடுத்தார்கள்; உங்களிடையே அதைப் பரவலாகப் பங்கிட்டார்கள். இறுதியில் அதிலிருந்து இந்தச் செல்வம் மட்டுமே எஞ்சியது. நபி (ஸல்) அவர்கள் இந்தச் செல்வத்திலிருந்து தம் வீட்டாரின் ஆண்டுச் செலவை அவர்களுக்குக் கொடுத்துவந்தார்கள். அப்படிக் கொடுத்த பிறகு எஞ்சியதை எடுத்து, அல்லாஹ்வின் (பாதையில் செலவிடும்) செல்வத்தை எந்த இனங்களில் செலவிடுவார்களோ அவற்றில் செலவிடுவார்கள். இவ்வாறே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வாழ்நாளில் செயல்பட்டுவந்தார்கள்.” (இவ்வளவும் சொல்லிவிட்டு, அக்குழுவினரை நோக்கி) “அல்லாஹ்வின் பொருட்டால் உங்களை நான் கேட்கின்றேன்: இதை நீங்கள் அறிவீர்களா?” என்று கேட்டார்கள். அதற்கு அவர்கள், ‘ஆம்’ (அறிவோம்) என்று பதிலளித்தனர். பிறகு, அலீ (ரலி) அவர்களிடமும் அப்பாஸ் (ரலி) அவர்களிடமும், “உங்கள் இருவரையும் அல்லாஹ்வின் பொருட்டால் கேட்கின்றேன்: நீங்கள் இதை அறிவீர்களா?” என்று வினவினார்கள். அவர்கள் இருவரும், ‘ஆம்’ (அறிவோம்) என்று பதிலளித்தனர். (தொடர்ந்து), பிறகு அல்லாஹ் தன் தூதரை அழைத்துக்கொண்டான். அப்போது அபூபக்ர் (ரலி) அவர்கள், “நான் அல்லாஹ்வின் தூதருடைய (ஆட்சிக்குப்) பிரதிநிதியாவேன்” என்று கூறி, அ(ந்தச் செல்வத்)தைத் தமது கைவசம் எடுத்துக்கொண்டார்கள். அது விஷயத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செயல்பட்டதைப் போன்றே தாமும் செயல்பட்டார்கள். பிறகு அபூபக்ர் (ரலி) அவர்களையும் அல்லாஹ் அழைத்துக்கொண்டான். அப்போது நான், “நான் அல்லாஹ்வின் தூதருடைய பிரதிநிதியின் பிரதிநிதியாவேன்” என்று கூறி, அதை (என் ஆட்சிக் காலத்தில்) இரண்டு ஆண்டுகளுக்கு என் கைவசம் எடுத்துக் கொண்டு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் நடந்துகொண்ட முறைப்படி செயல் பட்டுவந்தேன். பிறகு நீங்கள் இருவரும் என்னிடம் வந்தீர்கள்; (பேசினீர்கள்.) உங்கள் இருவரின் கோரிக்கையும் ஒன்றாகவே இருந்தது; உங்கள் இருவரின் விஷயமும் ஒன்றாகவே இருந்தது. (அப்பாஸ் (ரலி) அவர்களே!) நீங்கள் என்னிடம் உங்கள் சகோதரரின் புதல்வர் (நபி) இடமிருந்து உங்களுக்குச் சேர வேண்டிய (வாரிசுப்) பங்கைக் கேட்டு வந்தீர்கள். அவரும் (அலீயும்) தம் துணைவியாருக்கு அவருடைய தந்தை யிடமிருந்து கிடைக்க வேண்டிய (வாரிசுப்) பங்கைக் கேட்டு என்னிடம் வந்தார். அப்போது நான் (உங்கள் இருவரிடமும்,) “(நபிகளார் செயல்பட்டவாறு செயல்பட வேண்டும் எனும் நிபந்தனையின் பேரில்) நீங்கள் இருவரும் விரும்பினால் உங்கள் இருவரிடமும் அதைக் கொடுத்துவிடுகின்றேன்” என்று சொன்னேன். (இப்போது) அதன்றி வேறொரு தீர்ப்பை நீங்கள் என்னிடமிருந்து கோருகின்றீர்களா? எவனது அனுமதியுடன் வானமும் பூமியும் நிலைபெற்றுள்ளனவோ அவன் மீது சத்தியமாக! நான் அந்தச் செல்வம் தொடர்பாக இதைத் தவிர வேறெந்தத் தீர்ப்பையும் இறுதிநாள்வரை அளிக்கமாட்டேன். உங்கள் இருவராலும் அதைப் பராமரிக்க முடியவில்லை என்றால் என்னிடம் அதை ஒப்படைத்துவிடுங்கள். அதை உங்களுக்குப் பதிலாக நானே பராமரித்துக்கொள்வேன்” என்று சொன்னார்கள்.9 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6729,
			"arabicnumber": 6729,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: என் வாரிசுகள் ஒரு பொற்காசைக்கூட (வாரிசுப்) பங்காகப் பெறமாட்டார்கள். என் துணைவியருக்கான வாழ்க்கைச் செலவும் என் (பிரதிநிதி மற்றும்) ஊழியரின் ஊதியமும்போக நான் விட்டுச் செல்பவையெல்லாம் தர்மமேயாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.10 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6730,
			"arabicnumber": 6730,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறந்தபோது அவர்களின் துணைவியர் உஸ்மான் (ரலி) அவர்களை (என் தந்தை கலீஃபா) அபூபக்ர் (ரலி) அவர்களிடம் அனுப்பிவைத்து, (அல்லாஹ்வின் தூதரிடமிருந்து) தங்களுக்குச் சேர வேண்டிய சொத்தை அபூபக்ர் (ரலி) அவர்களிடம் கேட்க விரும்பினர். அப்போது நான் (அவர்களைப் பார்த்து), ‘(இறைத்தூதர்களான) எங்களுக்கு எவரும் (சொத்தில்) வாரிசாக முடியாது. நாங்கள் விட்டுச்செல்பவையெல்லாம் தர்மமே’ என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொல்லவில்லையா?” என்று கேட்டேன். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6731,
			"arabicnumber": 6731,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளர்களுக்கு அவர்களின் உயிர்களைவிட நானே நெருக்கமான (உரிமையுடைய)வன் ஆவேன். ஆகவே, எவர் தம்மீது கடன் இருக்கும் நிலையில் அதை அடைப்பதற்கான ஒன்றையும் விட்டுச்செல்லாமல் இறந்துவிடுகின்றாரோ அந்தக் கடனை அடைப்பது எனது பொறுப்பாகும். எவர் (இறக்கும்போது) ஒரு செல்வத்தை விட்டுச்செல்கிறாரோ அது அவருடைய வாரிசுகளுக்குரியதாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.11 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6732,
			"arabicnumber": 6732,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (பாகப்பிரிவினை தொடர்பாகக் குர்ஆனில் நிர்ணயிக்கப்பெற்றுள்ள) பாகங்களை (முதலில்) அவற்றுக்கு உரியவர்களிடம் சேர்த்துவிடுங்கள். பிறகு எஞ்சியிருப்பது (இறந்தவரின்) மிக நெருக்கமான (உறவினரான) ஆணுக்கு உரியதாகும்.13 இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6733,
			"arabicnumber": 6733,
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: (‘விடைபெறும்’ ஹஜ்ஜின்போது) மக்காவில் நான் கடுமையாக நோய்வாய்ப்பட்டு மரணத்தை எதிர்நோக்கியிருந்தேன். அப்போது நபி (ஸல்) அவர்கள் என்னை நலம் விசாரிக்க வந்தார்கள். அப்போது நான், “அல்லாஹ்வின் தூதரே! என்னிடம் ஏராளமான செல்வங்கள் உள்ளன. என் ஒரு மகளைத் தவிர வேறு வாரிசுகள் யாரும் எனக்கில்லை. எனவே, எனது செல்வத்தில் மூன்றில் இரு பங்கை நான் தர்மம் செய்துவிடட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், ‘வேண்டாம்’ என்றார்கள். “அவ்வாறாயின் பாதியை தர்மம் செய்யட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், ‘வேண்டாம்’ என்று சொன்னார்கள். “மூன்றில் ஒரு பங்கை (தர்மம் செய்யட்டுமா?)” என்று கேட்டேன். நபியவர்கள், “மூன்றில் ஒரு பங்குகூட அதிகம்தான். நீங்கள் உங்கள் பிள்ளைகளை மக்களிடம் கையேந்தும் ஏழைகளாக விட்டுச்செல்வதைவிடத் தன்னிறைவு உடையவர்களாக விட்டுச்செல்வதே சாலச்சிறந்ததாகும். (நல்ல நோக்கத்தில்) நீங்கள் செய்கின்ற ஒவ்வொரு செலவுக்கும் உங்களுக்கு நிச்சயம் நற்பலன் வழங்கப்படும்; நீங்கள் உங்கள் மனைவியின் வாயில் ஊட்டுகின்ற ஒரு கவளம் உணவாயினும் சரி! (அதற்கும் நற்பலன் உண்டு)” என்று சொன்னார்கள். அப்போது நான், “அல்லாஹ்வின் தூதரே! (ஹஜ் முடிந்து என் தோழர்கள் அனைவரும் மதீனா சென்றுவிடுவார்கள்.) நான் மட்டும் என் ஹிஜ்ரத் பூமி(யான மதீனாவு)க்குச் செல்லாமல் (மக்காவிலேயே) தங்கிவிடுவேனா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “நான் (மதீனா) சென்றபிறகு நீங்கள் இங்கேயே தங்கியிருந்து, அல்லாஹ்வின் அன்பை நாடி எந்த நல்லறம் புரிந்தாலும் அதன் மூலம் உங்கள் உயர்வும் தகுதியும் அதிகமாகவே செய்யும். நான் (மதீனா) சென்றபிறகு, உங்கள் மூலம் சிலர் நன்மையடைவதற்காவும் மற்றச் சிலர் துன்பம் அடைவதற்காகவும் நீங்கள் இங்கேயே தங்கவைக்கப்படலாம். ஆனால், பாவம், சஅத் பின் கவ்லா! (அவருடைய ஆசை நிறைவேறவில்லை)” என்று மக்காவிலேயே இறந்துவிட்ட சஅத் பின் கவ்லா (ரலி) அவர்களுக்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அனுதாபம் தெரிவித்தார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகிறார்கள்: சஅத் பின் கவ்லா (ரலி) அவர்கள் ஆமிர் பின் லுஅய் குலத்தைச் சேர்ந்தவராவார்.14 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6734,
			"arabicnumber": 6734,
			"text": "அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: முஆத் பின் ஜபல் (ரலி) அவர்கள் யமன் நாட்டுக்கு எங்களின் போதக ராகவும் ஆட்சியாளராகவும் வந்தார்கள். அன்னாரிடம் நாங்கள், தம் மகளையும் சகோதரியையும் விட்டுவிட்டு இறந்துபோன ஒருவரைக் குறித்து (பாகப்பிரிவினை தொடர்பாக)க் கேட்டோம். அப்போது அவர்கள் (மொத்தச் சொத்தில்) மகளுக்குப் பாதியும் சகோதரிக்கு (மீதி)ப் பாதியும் அளிக்கும்படி கூறினார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6735,
			"arabicnumber": 6735,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (பாகப்பிரிவினை தொடர்பாக குர்ஆனில் நிர்ணயிக்கப்பெற்றுள்ள) பாகங்களை (முதலில்) அவற்றுக்கு உரியவர்களிடம் சேர்த்துவிடுங்கள். பிறகு எஞ்சியிருப்பது (இறந்தவரின்) மிக நெருக்கமான (உறவினரான) ஆணுக்கு உரியதாகும். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.15 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6736,
			"arabicnumber": 6736,
			"text": "ஹுஸைல் பின் ஷுரஹ்பீல் (ரஹ்) அவர்கள் கூறியதாவது: அபூமூசா (ரலி) அவர்களிடம், (இறந்துபோன ஒருவருக்கு) மகள், மகனுடைய மகள், சகோதரி ஆகியோர் (இருந்தால், அவர்களுக்குக் கிடைக்கும் சொத்துரிமை) குறித்து வினவப்பட்டது. அதற்கு அவர்கள் “மகளுக்கு (மொத்தச் சொத்தில்) பாதியும் சகோதரிக்கு (மீதி)ப்பாதியும் கிடைக்கும் (மகனுடைய மகளுக்கு ஒன்றும் கிடையாது)” என்று கூறிவிட்டு, “(வேண்டுமானால்,) இப்னு மஸ்ஊத் (ரலி) அவர்களிடம் சென்று (கேட்டுப்)பாருங்கள். அன்னாரும் என் (கருத்தி)னையே பிரதிபலிப்பார்கள்” என்று சொன்னார்கள். ஆகவே, இப்னு மஸ்ஊத் (ரலி) அவர்களிடம் (சென்று) அபூமூசா (ரலி) அவர்களின் கூற்றைத் தெரிவித்து (இது குறித்து விளக்கம்) கேட்கப்பட்டது. அதற்கு அவர்கள், “இவ்வாறு (மகனின் மகளுக்கு சொத்தில் பங்கு இல்லை என்று) நானும் சொன்னால் நிச்சயம் நான் வழிதவறியவனாகிவிடுவேன்; நான் நல்வழியடைந்தவர்களில் ஒருவனாக இருக்கமாட்டேன். இந்த விஷயத்தில் நபி (ஸல்) அவர்கள் அளித்த தீர்ப்பையே நானும் அளிக்கிறேன்: மகளுக்குப் பாதியும் மகனின் மகளுக்கு ஆறில் ஒரு பாகமும் வழங்கப்பட வேண்டும். அப்போதுதான் மூன்றில் இரு பாகங்கள் நிறைவாகும். எஞ்சியிருப்பது சகோதரிக்கு உரியதாகும்” என்றார்கள். பின்னர் அபூமூசா (ரலி) அவர்களிடம் சென்று இப்னு மஸ்ஊத் (ரலி) அவர்கள் சொன்னதைத் தெரிவித்தோம். அப்போது, “இந்தப் பேரறிஞர் (இப்னு மஸ்ஊத்-ரலி) உங்களிடையே இருக்கும்வரை என்னிடம் (விளக்கம்) கேட்காதீர்கள்” என்று (புகழ்ந்து) சொன்னார்கள்.16 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6737,
			"arabicnumber": 6737,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (பாகப்பிரிவினை தொடர்பாகக் குர்ஆனில் நிர்ணயிக்கப்பெற்றுள்ள) பாகங்களை (முதலில்) அவற்றுக்கு உரியவர்களிடம் சேர்த்துவிடுங்கள். பிறகு எஞ்சியிருப்பது (இறந்தவரின்) மிக நெருக்கமான (உறவினரான) ஆணுக்கு உரியதாகும். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.21 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6738,
			"arabicnumber": 6738,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இந்தச் சமுதாயத்தில் யாரையேனும் நான் உற்றநண்பராக ஆக்கிக்கொள் வதாயிருந்தால் அவரையே ஆக்கிக் கொண்டிருப்பேன். என்றாலும், இஸ்லாமிய சகோதரத்துவமே (எல்லா உறவுகளையும் விடச்) ‘சிறந்தது’ அல்லது ‘நல்லது” என்று யார் விஷயத்தில் கூறினார்களோ (அந்த அபூபக்ர்-ரலி) அவர்கள்தான், (சொத்துரிமை பெறுவதில்) பாட்டனாரை ‘தந்தையின் இடத்தில் வைத்தார்கள்’ அல்லது ‘தந்தை’ எனத் தீர்ப்பளித்தார்கள்.22 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6739,
			"arabicnumber": 6739,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (இறந்துபோனவர் விட்டுச்சென்ற) செல்வம் (அவருடைய) குழந்தைகளுக்கு (மட்டுமே) உரியதாக இருந்தது. பெற்றோருக்கு(ப் பங்கு கிடைக்க வேண்டுமெனில் இறந்தவர்) இறுதி விருப்பம் தெரிவித்திருக்க வேண்டும் என்றிருந்தது. இதில் அல்லாஹ், தான் நாடியதை மாற்றியமைத்து, ‘ஓர் ஆணுக்கு இரு பெண்களின் பங்கு’ என்ற விகிதத்தை ஏற்படுத்தினான். பெற்றோரில் ஒவ்வொருவருக்கும் ஆறில் ஒரு பாகம் என்று நிர்ணயித்தான். (குழந்தை இருக்கும்போது) மனைவிக்கு எட்டில் ஒரு பாகமும் (குழந்தை இல்லாதபோது) நான்கில் ஒரு பாகமும் நிர்ணயித்தான். (குழந்தை இல்லாதபோது) கணவனுக்குச் சரிபாதியும் (குழந்தை இருக்கும்போது) நான்கில் ஒரு பாகமும் நிர்ணயித்தான்.23 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6740,
			"arabicnumber": 6740,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ‘பனூ லிஹ்யான்’ குலத்தைச் சேர்ந்த (கர்ப்பிணி) பெண் ஒருத்தியின் (வயிற்றிóருந்த) சிசு, (மற்றொரு பெண் அடித்ததால்) இறந்து பிறந்தது. அதற்கு இழப்பீடாக ஓர் ஆண் அடிமையை, அல்லது ஓர் அடிமைப் பெண்ணை வழங்கிட வேண்டுமென அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தீர்ப்பளித்தார்கள். பின்னர், இழப்பீடு வழங்கும்படி நபியவர்கள் தீர்ப்பளித்த அந்த(க் குற்றவாளி)ப் பெண் இறந்துவிட்டார். ஆகவே, (அவர் சார்பாக) அவருடைய தந்தைவழி உறவினர்கள் (அஸபாக்கள்) இழப்பீடு வழங்கிட வேண்டுமென்றும், அவரது சொத்து அவருடைய ஆண் மக்களுக்கும் கணவருக்கும் உரியதென்றும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தீர்ப்பளித்தார்கள்.24 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6741,
			"arabicnumber": 6741,
			"text": "அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களின் காலத்தில் (யமன் நாட்டுக்கு வந்த) முஆத் பின் ஜபல் (ரலி) அவர்கள், “(சொத்தில்) பாதி (இறந்தவரின்) மகளுக் கும் (மீதிப்) பாதி சகோதரிக்கும் உரியது” என்று தீர்ப்பளித்தார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான சுலைமான் பின் மிஹ்ரான் அல்அஃமஷ் (ரஹ்) அவர்களின் அறிவிப்பில் “முஆத் பின் ஜபல் (ரலி) அவர்கள் எங்களிடையே (மேற்கண்டவாறு) தீர்ப்பளித்தார்கள்” என்று காணப்படுகிறது. ‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் காலத்தில்’ என்ற குறிப்பு இடம்பெறவில்லை.26 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6742,
			"arabicnumber": 6742,
			"text": "ஹுஸைல் பின் ஷுரஹ்பீல் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், “(மகனின் மகளுக்குக் கிடைக்க வேண்டிய) இந்தச் சொத்து விஷயத்தில் ‘நபி (ஸல்) அவர்கள் அளித்த தீர்ப்பையே அளிக்கிறேன்’ அல்லது ‘நபி (ஸல்) அவர்கள் கூறினார்கள்’ ‘‘ என்று சொல்லிவிட்டு, “(இறந்தவரின் சொத்தில்) மகளுக்குப் பாதியும் மகனின் மகளுக்கு ஆறில் ஒரு பாகமும் கிடைக்கும்; எஞ்சியது சகோதரிக்கு உரியதாகும்” என்று (தீர்ப்புக்) கூறினார்கள்.27 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6743,
			"arabicnumber": 6743,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: நான் நோய்வாய்ப்பட்டிருந்தபோது (என்னை நலம் விசாரிப்பதற்காக) நபி (ஸல்) அவர்கள் என் வீட்டுக்கு வந்தார்கள். அங்கத் தூய்மை (உளூ) செய்வதற்காகத் தண்ணீர் கேட்டு வாங்கி அங்கத் தூய்மை செய்தார்கள். பிறகு தாம் அங்கத் தூய்மை செய்த தண்ணீரை என் மீது தெளித்தார்கள். உடனே எனக்கு மயக்கம் தெளிந்துவிட்டது. அப்போது நான், “அல்லாஹ்வின் தூதரே! எனக்குச் சகோதரிகள் மட்டுமே இருக்கின்றனர். (என் சொத்துகள் யாருக்குச் சேர வேண்டும்?)” என்று கேட்டேன். அப்போதுதான் பாகப் பிரிவினை தொடர்பான வசனம் அருளப்பெற்றது.29 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6744,
			"arabicnumber": 6744,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: (நபி (ஸல்) அவர்களுக்கு) இறுதியாக அருளப்பெற்ற (பாகப் பிரிவினை தொடர்பான) வசனம், ‘அந்நிசா’ அத்தியாயத்தின் இறுதி வசனமான “(நபியே!) ‘கலாலா’ குறித்து உம்மிடம் அவர்கள் தீர்ப்புக் கேட்கிறார்கள்” என்று தொடங்கும் வசனமாகும்.30 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6745,
			"arabicnumber": 6745,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளர்களுக்கு அவர்களின் உயிரைவிட நானே நெருக்கமான (உரிமையுடைய)வன் ஆவேன். ஆகவே, எவர் செல்வத்தை விட்டுவிட்டு இறந்தாரோ அவரது செல்வம் (அவருடைய) தந்தைவழியிலுள்ள நெருங்கிய உறவினர்களுக்குரியதாகும். எவர் (குடும்பம் மற்றும் கடன் போன்ற) சுமைகள், சொத்தில்லா குழந்தைகள் ஆகியவற்றை விட்டுச்செல்கிறாரோ அவருக்கு நான் பொறுப்பாளியாவேன். அவருக்காக என்னை அழைக்கலாம். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6746,
			"arabicnumber": 6746,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: (பாகப்பிரிவினை தொடர்பாகக் குர்ஆன் நிர்ணயித்துள்ள) பாகங்களை (முதலில்) அவற்றுக்கு உரியவர்களிடம் சேர்த்துவிடுங்கள். பாகம் நிர்ணயிக்கப் பட்டவர்கள் எடுத்ததுபோக எஞ்சியிருப்பது (இறந்தவரின்) மிக நெருக்கமான (உறவினரான) ஆணுக்கு உரியதாகும். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.33 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6747,
			"arabicnumber": 6747,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: “தாய் தந்தையரும் நெருங்கிய உறவினரும் விட்டுச்சென்ற (சொத்)திலிருந்து (பங்கு பெறுகின்ற) வாரிசுக்காரர்களை நாம் ஒவ்வொருவருக்கும் நிர்ணயித்துள் ளோம். நீங்கள் யாருடன் உடன்படிக்கை செய்துள்ளீர்களோ அவர்களுக்கும் அவர்களது பங்கை அளித்துவிடுங்கள்” எனும் (4:33ஆவது) வசனத்தின் விளக்கமாவது: முஹாஜிர்கள் மதீனாவுக்கு வந்த போது, அன்சாரி (ஒருவர் இறந்துவிட்டால் அவரு)க்கு அவருடைய உறவினர்கள் (தவுல் அர்ஹாம்) அன்றி (அவருடைய) முஹாஜிர் (நண்பரே) வாரிசாகிவந்தார். நபி (ஸல்) அவர்கள் முஹாஜிர்களுக்கும் அன்சாரிகளுக்கும் இடையே (இஸ்லாமிய) சகோதரத்துவத்தை ஏற்படுத்தியிருந்ததே இதற்குக் காரணம். (பின்னர்) இந்த வசனத்தின் முதல் தொடர் இறங்கியபோது, அது இரண்டாவது தொடரை மாற்றிவிட்டது.35 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6748,
			"arabicnumber": 6748,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களின் காலத்தில் ஒரு மனிதர் தம் மனைவிக்கு எதிராக சாபஅழைப்புப் பிரமாணம் (லிஆன்) செய்தார். மேலும், அவர் அவளுடைய குழந்தையைத் தம்முடையதல்ல என்று சொன்னார். ஆகவே, அவ்விருவரையும் நபி (ஸல்) அவர்கள் பிரித்துவைத்தார்கள்; குழந்தையை மனைவியிடம் சேர்த்தார் கள்.37 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6749,
			"arabicnumber": 6749,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: உத்பா பின் அபீவக்காஸ் தம் சகோதரர் சஅத் பின் அபீவக்காஸ் (ரலி) அவர்களிடம், ‘ஸம்ஆவின் அடிமைப் பெண் ணுடைய மகன் எனக்குப் பிறந்தவன். ஆகவே, அவனை நீ பிடித்துவைத்துக் கொள்’ என்று உறுதிமொழி வாங்கியிருந் தார். மக்கா வெற்றி ஆண்டின்போது சஅத் (ரலி) அவர்கள் அவனைப் பிடித்துக்கொண்டார்கள். மேலும், அவர்கள், “இவன் என் சகோதரரின் மகன். என் சகோதரர் இவனைக் கைப்பற்றும்படி என்னிடம் உறுதிமொழி வாங்கியுள்ளார்” என்று சொன்னார்கள். அப்போது ஸம்ஆவின் புதல்வர் அப்து (ரலி) அவர்கள் எழுந்து, “இவன் என் சகோதரன். என் தந்தையின் அடிமைப் பெண்ணுடைய மகன். அவரது படுக்கையில் (அதாவது அவரது அதிகாரத்தில் இவனுடைய தாய் இருந்தபோது) பிறந்தவன்” என்று கூறினார்கள். ஆகவே, இருவரும் நபி (ஸல்) அவர்களிடம் (தீர்ப்புக் கேட்டு) சென்றனர். சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! இவன் என் சகோதரருடைய மகன். இவனைக் கைப்பற்றிக்கொள்ளும்படி என்னிடம் அவர் உறுதிமொழி வாங்கியிருந்தார்” என்று கூற, ஸம்ஆவின் புதல்வர் அப்து (ரலி) அவர்கள், “(இவன்) என் சகோதரன். என் தந்தையின் அடிமைப் பெண்ணுக்குப் பிறந்தவன். அவரது படுக்கையில் (அவரது அதிகாரத்தில் இவனுடைய தாய் இருந்தபோது) பிறந்தவன்” என்று சொன்னார். நபி (ஸல்) அவர்கள், “அப்து பின் ஸம்ஆவே! இவன் உனக்கே உரியவன். ஏனெனில், (சட்டப்படி) தாய் யாருடைய அதிகாரத்தில் இருக்கின்றாளோ அவருக்கே குழந்தை உரியதாகும். விபசாரம் செய்தவனுக்கு இழப்பே உரியது” என்று கூறினார்கள். பிறகு நபி (ஸல்) அவர்கள் (தம் துணைவியும்) ஸம்ஆவின் புதல்வி (யுமான) சவ்தா (ரலி) அவர்களிடம், “இவனிடமிருந்து நீ உன்னைத் திரையிட்டு மறைத்துக்கொள்!” என்று சொன்னார்கள். சாயலில் அவன் உத்பாவைப் போன்று இருந்ததை நபியவர்கள் பார்த்ததே இதற்குக் காரணம். அதன் பிறகு அந்த மனிதர் இறக்கும்வரை அவரை சவ்தா (ரலி) அவர்கள் பார்க்கவில்லை.39 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6750,
			"arabicnumber": 6750,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: தாய் (பெண்) யாருடைய அதிகாரத்தின் கீழ் இருக்கிறாளோ அவருக்கே குழந்தை உரியதாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6751,
			"arabicnumber": 6751,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (அடிமைப் பெண்ணாயிருந்த) பரீராவை நான் விலைக்கு வாங்க விரும்பினேன். அப்போது நபி (ஸல்) அவர்கள், “அவளை விலைக்கு வாங்கிக்கொள். ஏனெனில், (அடிமையை) விடுதலை செய்தவருக்கே (அந்த அடிமையின் சொத்தில்) வாரிசுரிமை உண்டு” என்றார்கள். மேலும், பரீராவுக்கு ஓர் ஆடு அன்பளிப்பாக வழங்கப்பட்டது. அப்போது நபி (ஸல்) அவர்கள், “அந்த ஆடு பரீராவுக்குத் தர்மமாகும். (பரீராவிடமிருந்து) நமக்கு அது அன்பளிப்பாகும்” என்று சொன்னார்கள்.41 இதன் அறிவிப்பாளர்களில் ஒருவரான ஹகம் பின் உதைபா (ரஹ்) அவர்கள் கூறுகிறார்கள்: பரீராவின் கணவர் (முஃகீஸ்) சுதந்திரம் பெற்றவராக இருந்தார். ஹகம் அவர்களின் இந்த அறிவிப்பு ‘முர்சல்’ (அறிவிப்பாளர்தொடரில் நபித் தோழர் விடுபட்டது) ஆகும். இப்னு அப்பாஸ் (ரலி) அவர்கள், “முஃகீஸை நான் அடிமையாகவே கண்டேன்” என்று சொன்னார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6752,
			"arabicnumber": 6752,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (அடிமையாயிருந்த ஒருவருக்கு) வாரிசாகும் தகுதி (அவரை) விடுதலை செய்தவருக்கே உண்டு. இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6753,
			"arabicnumber": 6753,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ‘உன்மீது யாருக்கும் வாரிசுரிமை கிடையாது’ என்ற நிபந்தனையின்பேரில் அடிமைகளை முஸ்லிம்கள் விடுதலை செய்வதில்லை; அறியாமைக் காலத்தவர் தான் அவ்வாறு விடுதலை செய்துவந்தனர். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6754,
			"arabicnumber": 6754,
			"text": "அஸ்வத் (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்கள் (அடிமைப் பெண்ணாயிருந்த) பரீராவை விடுதலை செய்வதற்காக விலைக்கு வாங்க விரும்பினார்கள். பரீராவின் எசமானர்கள் ‘பரீராவின் வாரிசுரிமை தங்களுக்கே இருக்க வேண்டும்’ என நிபந்தனையிட்டார்கள். ஆகவே, ஆயிஷா (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! விடுதலை செய்வதற்காக நான் பரீராவை விலைக்கு வாங்க விரும்பினேன். பரீராவின் எசமானர்களோ அவளுடைய வாரிசுரிமை தங்களுக்கே உரியது என்று நிபந்தனையிடுகிறார்கள்” என்று சொன்னார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(பரீராவை விலைக்கு வாங்கி) விடுதலை செய்! ஏனெனில், (பொதுவாக) விடுதலை செய்தவருக்கே (அடிமையின் சொத்தில்) வாரிசுரிமை உண்டு” அல்லது “விலையைக் கொடுத்துவிடு” என்று சொன்னார்கள். ஆகவே, ஆயிஷா (ரலி) அவர்கள் பரீராவை விலைக்கு வாங்கி விடுதலை செய்தார்கள். (தொடர்ந்து கணவர் முஃகீஸுடன் சேர்ந்து வாழ, அல்லது திருமண உறவை முறித்துக்கொள்ள) பரீராவிற்கு விருப்ப உரிமை அளிக்கப்பட்டது. அப்போது பரீரா தனது விருப்பத்திற்கேற்ப (தனித்து) வாழ்வதையே தேர்ந்தெடுத்துக்கொண்டதுடன், “இவ்வளவு இவ்வளவு (செல்வம்) எனக்குக் கொடுக்கப்பட்டாலும் நான் அவருடன் வாழமாட்டேன்” என்று சொல்லிவிட்டார். அறிவிப்பாளர் அஸ்வத் (ரஹ்) அவர்கள், “பரீராவின் கணவர் (முஃகீஸ்) சுதந்திர மனிதராக இருந்தார்” என்று சொன்னார்கள். (அபூஅப்தில்லாஹ் புகாரீ கூறுகிறேன்:) அஸ்வத் (ரஹ்) அவர்களின் இந்த அறிவிப்பு ‘முன்கதிஉ’ (அறிவிப்பாளர்தொடரில் தொடர்பு அறுந்தது) ஆகும். இப்னு அப்பாஸ் (ரலி) அவர்கள், “முஃகீஸை நான் அடிமையாகவே கண்டேன்” என்று கூறியதே சரியானதாகும். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6755,
			"arabicnumber": 6755,
			"text": "யஸீத் பின் ஷரீக் அத்தைமீ (ரஹ்) அவர்கள் கூறியதாவது: அலீ (ரலி) அவர்கள், “நாங்கள் ஓதிவருகின்ற அல்லாஹ்வின் வேதத் தையும் (நபியவர்களிடமிருந்து கிடைக்கப் பெற்ற) இந்த ஏட்டையும் தவிர (எழுத்து வடிவிலான மார்க்கச் சட்டம்) வேறெதுவும் (நபியின் குடும்பத்தாரான) எங்களிடம் இல்லை” என்று கூறிவிட்டு, அந்த ஏட்டை வெளியே எடுத்தார்கள். அதில் காயங்களுக்கான தண்டனை குறித்தும் (உயிரீட்டிற்காகவும் ஸகாத்தாகவும் வழங்கப்படும்) ஒட்டகங்களின் வயது குறித்தும் எழுதப்பட்டிருந்தது. மேலும், அதில் (பின்வருமாறு குறிப்பிடப்பட்டு) இருந்தது: மதீனா நகரம் ‘அய்ர்’ எனும் மலை யிóருந்து ‘ஸவ்ர்’ மலைவரை புனிதமானதாகும். அதில் யார் (மார்க்கத்தின் பெயரால்) புதிதாக ஒன்றை உருவாக்குகின்றானோ, அல்லது (அவ்வாறு) புதிதாக ஒன்றை உருவாக்குகின்றவனுக்கு அடைக்கலம் அளிக்கின்றானோ அவன்மீது அல்லாஹ்வின் சாபமும் வானவர்கள் மற்றும் அனைத்து மக்களின் சாபமும் உண்டாகும். மேலும், அவன் புரிந்த கடமையான வழிபாடோ கூடுதலான வழிபாடோ எதுவுமே அவனிடமிருந்து ஏற்கப்படாது. தன்னை விடுதலை செய்த எசமானர்களின் அனுமதியின்றி வேறு யாரையேனும் வாரிசுகளாக ஆக்கிக்கொள்ளும் அடிமைமீது அல்லாஹ்வின் சாபமும் வானவர்கள் மற்றும் அனைத்து மக்களின் சாபமும் உண்டாகும். மேலும், அவன் புரிந்த கடமையான மற்றும் கூடுதலான வழிபாடுகள் எதுவும் அவனிடமிருந்து ஏற்கப்படாது. முஸ்லிம்களில் எவர் அடைக்கலம் கொடுத்தாலும் அது ஒன்றேயாகும். (மற்ற முஸ்óம்கள் தரும் அடைக்கலத்திற்குச் சமமானதாகும்.) அவர்களில் கீழ் நிலையில் உள்ளவர்கள் கூட அடைக்கலம் தர முன்வரலாம். ஒரு முஸ்லிம் கொடுத்த அடைக்கலத்தை எவரேனும் முறித்தால் அவன்மீது அல்லாஹ்வின் சாபமும் வானவர்கள் மற்றும் அனைத்து மக்களின் சாபமும் உண்டாகும். மேலும், அவன் செய்த கடமையான வழிபாடு கூடுதலான வழிபாடு எதுவுமே மறுமை நாளில் ஏற்றுக்கொள்ளப்படாது.43 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6756,
			"arabicnumber": 6756,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், “(முன்னாள் அடிமையின் சொத்திற்கு) வாரிசாகும் உரிமையை விற்பதற்கும் அதை அன்பளிப்புச் செய்வதற்கும் தடை விதித்தார்கள்.44 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6757,
			"arabicnumber": 6757,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்கள் (பரீரா எனும்) ஓர் அடிமைப் பெண்ணை விலைக்கு வாங்கி விடுதலை செய்ய விரும்பினார்கள். பரீராவின் எசமானர்களோ, “பரீராவின் வாரிசுரிமை எங்களுக்கே வேண்டுமென்ற நிபந்தனையின் பேரில் அவளை நாங்கள் உங்களுக்கு விற்கிறோம்” என்று கூறினர். ஆகவே, ஆயிஷா (ரலி) அவர்கள் இதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(அதற்காக) நீ விடுதலை செய்யாமல் இருந்துவிடாதே! விடுதலை செய்தவருக்கே வாரிசுரிமை உரியது” என்று சொன்னார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6758,
			"arabicnumber": 6758,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் பரீராவை விலைக்கு வாங்க விரும்பினேன். அப்போது பரீராவின் எசமானர்கள் அவளுடைய வாரிசுரிமை தங்களுக்கே உரியது என்று நிபந்தனை விதித்தார்கள். நான் இது குறித்து நபி (ஸல்) அவர்களிடம் சொன்னேன். அதற்கு நபி (ஸல்) அவர்கள், “அவளை நீ விடுதலை செய்! ஏனெனில், வெள்ளியைக் கொடுத்(து விலைக்கு வாங்கி விடுதலை செய்)தவருக்கே வாரிசுரிமை உரியது” என்று சொன்னார்கள். ஆகவே, நான் பரீராவை (விலைக்கு வாங்கி) விடுதலை செய்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பரீராவை அழைத்து, அவள் தன்னுடைய கணவரிடமிருந்து (பிரிந்துவிட) விருப்ப உரிமையளித்தார்கள். அப்போது பரீரா, “அவர் எனக்கு இவ்வளவு இவ்வளவு (செல்வம்) தந்தாலும் நான் அவருடன் சேர்ந்து வாழமாட்டேன்” என்று கூறி தனித்து வாழ்வதையே தேர்ந்தெடுத்துக்கொண்டார். இதை அஸ்வத் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள்.46 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6759,
			"arabicnumber": 6759,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (அடிமைப் பெண்ணாயிருந்த) பரீராவை விலைக்கு வாங்க ஆயிஷா (ரலி) அவர்கள் விரும்பினார்கள். அப்போது அவர்கள் நபி (ஸல்) அவர்களிடம், “பரீராவின் எசமானர்கள் வாரிசுரிமை தங்களுக்கே இருக்க வேண்டும் என்று நிபந்தனையிடுகின்றனர்” என்று சொன்னார்கள். அதற்கு நபி (ஸல்) அவர்கள், “அவளை வாங்கி (விடுதலை செய்து)விடு! ஏனென்றால், விடுதலை செய்தவருக்கே வாரிசுரிமை உரியது” என்று சொன்னார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6760,
			"arabicnumber": 6760,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: வெள்ளியை(க் கிரயமாக)க் கொடுத்து (விலைக்கு வாங்கி, விடுதலை எனும்) பேருபகாரம் செய்தவருக்கே (அடிமைக்கு) வாரிசாகும் உரிமை உண்டு. இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6761,
			"arabicnumber": 6761,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ‘ஒரு கூட்டத்தாரால் விடுதலை செய்யப்பட்ட அடிமை அவர்களில் உள்ளவனே’ என்றோ, அல்லது ‘இதைப் போன்றோ’ அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்.47 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6762,
			"arabicnumber": 6762,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஒரு கூட்டத்தாரின் சகோதரி மகன், ‘அவர்களில் உள்ளவன்’ அல்லது ‘அவர் களிலேயே உள்ளவன்’ ஆவான் என்று நபி (ஸல்) அவர்கள் கூறினார்கள்.48 அத்தியாயம் :",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6763,
			"arabicnumber": 6763,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (இறந்துவிட்ட) ஒருவர் ஒரு செல்வத்தை விட்டுச்சென்றால் அது அவருடைய வாரிசுகளுக்குரியதாகும். ஒருவர் (தம்மைத் தவிர வேறு திக்கற்ற) தம் மனைவி மற்றும் மக்களை விட்டுச்சென்றால் அவர்களைப் பராமரிப்பது (மக்கள் தலைவரான) எமது பொறுப்பாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.50 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6764,
			"arabicnumber": 6764,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிம் இறைமறுப்பாளருக்கு வாரிசாகமாட்டார். ஓர் இறைமறுப்பாளர் முஸ்லிமுக்கு வாரிசாகமாட்டார். இதை உசாமா பின் ஸைத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.53 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6765,
			"arabicnumber": 6765,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: சஅத் பின் அபீவக்காஸ் (ரலி) அவர்களும் அப்த் பின் ஸம்ஆ (ரலி) அவர்களும் ஒரு சிறுவன் (யாருடைய மகன் என்பது) தொடர்பாகச் சர்ச்சையிட்டுக்கொண்டனர். சஅத் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! இவன் என் சகோதரர் உத்பா பின் அபீவக்காஸ் (ரலி) அவர்களின் மகன். இவன் தம்முடைய மகன் (ஆகவே, இவனைப் பிடித்துவர வேண்டும்) என்று அவர் என்னிடம் உறுதிமொழி வாங்கியிருந்தார். இவனுடைய சாயலை (நீங்களே) பாருங்கள்!” என்று கூறினார்கள். அப்த் பின் ஸம்ஆ (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! இவன் என் சகோதரன். என் தந்தையின் படுக்கையில் அவருடைய அடிமைப் பெண்ணுக்குப் பிறந்தவன்” என்று சொன்னார். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சிறுவனின் சாயலைப் பார்த்தார்கள். உத்பாவின் சாயல் வெளிப்படையாக அமைந்திருக்கக் கண்டார்கள். இருப்பினும், “அப்த் பின் ஸம்ஆவே! இவன் உனக்கே உரியவன். ஏனெனில், (சட்டப்படி) தாய் யாருடைய அதிகாரத்தின் கீழ் இருக்கின்றாளோ அவருக்கே குழந்தை உரியதாகும். விபசாரம் செய்தவனுக்கு இழப்பே உரியது” என்று கூறிவிட்டு(த் தம் துணைவியாரிடம்), “சவ்தா பின்த் ஸம்ஆவே! இவனிடமிருந்து உன்னைத் திரையிட்டு மறைத்துக்கொள்!” என்று சொன்னார்கள். அதற்குப் பிறகு அந்த மனிதர் சவ்தா (ரலி) அவர்களை (நேரடியாகப்) பார்க்க வில்லை.55 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6767,
			"arabicnumber": 6767,
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6768,
			"arabicnumber": 6768,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்கள் தந்தையரை நீங்கள் வெறுக்காதீர்கள். யார் தம் தந்தையை வெறுத்து (வேறு யாரோ ஒருவரை தம் தந்தை என்று கூறி)விடுகிறாரோ அவர் நன்றி கொன்றவராவார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.57 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6769,
			"arabicnumber": 6769,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (தாவூத் (அலை) அவர்களின் காலத்தில்) இரண்டு பெண்கள் வாழ்ந்தார்கள். அவர்களுடன் அவர்களுடைய புதல்வர் களும் இருந்தனர். (ஒருநாள்) ஓநாய் ஒன்று அவ்விருவரின் புதல்வர்களில் ஒருவனைக் கொண்டுசென்று விட்டது. அவர்களில் ஒருத்தி தன் தோழியிடம், “உன் மகனைத்தான் ஓநாய் கொண்டுசென்றுவிட்டது” என்று கூற, அதற்கு மற்றவள், “உன் மகனைத்தான் ஓநாய் கொண்டுசென்றுவிட்டது” என்று சொன்னாள். ஆகவே, இருவரும் தாவூத் (அலை) அவர்களிடம் தீர்ப்புக் கேட்டுச் சென்றார்கள். தாவூத் (அலை) அவர்கள் அவ்விரு பெண்களில் மூத்தவளுக்குச் சாதகமாகத் தீர்ப்பளித்தார்கள். (இந்தத் தீர்ப்பின் மீது கருத்து வேறுபாடு கொண்ட) அப்பெண்கள் இருவரும் தாவூத் (அலை) அவர்களின் புதல்வர் சுலைமான் (அலை) அவர்களிடம் (தீர்ப்புக் கேட்க) புறப்பட்டுச் சென்றார்கள். அன்னாரிடம் விஷயத்தைத் தெரிவித்தார்கள். அப்போது சுலைமான் (அலை) அவர்கள், “என்னிடம் ஒரு கத்தியைக் கொண்டுவாருங்கள். நான் உங்களிருவருக்குமிடையே (மீதமுள்ள ஒரு மகனை ஆளுக்குப் பாதியாக) பிளந்து (பங்கிட்டு)விடுகின்றேன்” என்று கூறினார்கள். உடனே இளையவள், “அவ்வாறு செய்துவிடாதீர்கள். அல்லாஹ் உங்களுக்குக் கருணை புரியட்டும். இவன் அவளுடைய மகன்தான்” என்று (பதறிப்போய்) கூறினாள். ஆகவே, சுலைமான் (அலை) அவர்கள், ‘அந்தக் குழந்தை இளையவளுக்கே உரியது’ என்று தீர்ப்பளித்தார்கள். இதை அறிவித்த அபூஹுரைரா (ரலி) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நான் அன்றுதான் (கத்திக்கு) ‘சிக்கீன்’ எனும் சொல்லை (நபியவர்களின் வாயிலாக)ச் செவியுற்றேன். (கத்தியைக் குறிக்க) ‘முத்யா’ என்னும் சொல்லைத்தான் நாங்கள் பயன்படுத்திவந்தோம்” என்று கூறினார்கள்.58 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6770,
			"arabicnumber": 6770,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் நெற்றிக்கோடுகள் மின்னும்வண்ணம் மகிழ்ச்சியுடன் என்னிடம் வந்து, “உனக்குத் தெரியுமா? சற்றுமுன் (அங்க அடையாளங்களைக் கொண்டு தந்தை- பிள்ளையைக் கண்டறி யும்) முஜஸ்ஸிஸ், (என் வளர்ப்பு மகன்) ஸைத் பின் ஹாரிஸாவையும் (அவருடைய புதல்வர்) உசாமா பின் ஸைதையும் (அவர்கள் படுத்திருந்தபோது அவர்களின் பாதங்களைப்) பார்த்துவிட்டு, ‘இந்தப் பாதங்களில் ஒன்று மற்றொன்றிலிருந்து உருவானது’ என்று சொன்னார்” என்றார்கள்.59 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6771,
			"arabicnumber": 6771,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒருநாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மகிழ்ச்சியுடன் என்னிடம் வந்து, “ஆயிஷா! முஜஸ்ஸிஸ் அல்முத்லிஜீ என்னிடம் வந்தார். அப்போது உசாமாவும் (அவருடைய தந்தை) ஸைதும் ஒரு துணியைப் போர்த்தி(க்கொண்டு படுத்து) இருப்பதைக் கண்டார். அவர்களிருவரும் தமது தலையை மூடியிருந்தனர்; (ஆனால்,) அவர்களின் பாதங்கள் வெளியே தெரிந்தன. அப்போது முஜஸ்ஸிஸ் ‘இந்தப் பாதங்கள் ஒன்று மற்றொன்றிலிருந்து உருவானவை’ என்று சொன்னார்” என்றார்கள்.60 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 47
			}
		}
	]
}