{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"9": "Times of the Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 522,
			"arabicnumber": 522,
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": 523,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: ‘அப்துல் கைஸ்’ குலத்தாரின் தூதுக்குழு ஒன்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தது. அக்குழுவினர், “(அல்லாஹ்வின் தூதரே!) நாங்கள் ‘ரபீஆ’ குலத்தாரில் இன்ன (அப்துல் கைஸ்) குடும்பத்தார் ஆவோம். (முளர் குலத்து இறைமறுப்பாளர்கள் நாம் சந்திக்கத் தடையாக உள்ளனர். போர் நிறுத்தம் செய்யப்படுகின்ற புனித மாதங்களில் தவிர வேறு மாதங்களில் நாங்கள் தங்களிடம் வந்து சேர முடியாத நிலையில் இருக்கிறோம். எனவே, (தெளிவான) ஆணை யொன்றை எங்களுக்குப் பிறப்பியுங்கள். அதை உங்களிடமிருந்து நாங்கள் பெற்றுக்கொள்வோம்; எங்களுக்குப் பின்னாலிருப்பவர்களையும் அதன்பால் அழைப்போம்” என்று கூறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உங்களுக்கு நான்கு விஷயங்களைச் செய்யும்படி கட்டளையிடுகிறேன்; நான்கு விஷயங்களைச் செய்ய வேண்டாமெனத் தடைவிதிக்கிறேன்” என்று கூறிவிட்டு, “அல்லாஹ்வின் மீது நம்பிக்கை கொள்வது -அதாவது அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை. நான் அல்லாஹ்வின் தூதராவேன் என்று உறுதிகூறுவது- தொழுகையைக் கடைப்பிடிப்பது, ஸகாத் வழங்குவது, உங்களுக்குப் போரில் கிடைத்த செல்வத்தி-ருந்து ஐந்திலொரு பங்கை (இறைவனுக்காக) என்னிடம் செலுத்துவது ஆகியவைதான் நான் கட்டளையிடும் அந்த நான்கு விஷயங்கள். மேலும், (மது ஊற்றிவைக்கப் பயன்படுத்தப்படும்) சுரைக்காய் குடுவை, மண்சாடி, தார் பூசப்பட்ட பாத்திரம், (பேரீச்ச மரத்தின் அடிப்பாகத்தைக் குடைந்து தயாரிக்கப்படும்) மரப் பீப்பாய் ஆகியவற்றை உபயோகிக்க வேண்டாமென உங்களுக்குத் தடை விதிக்கிறேன்” என்று கூறினார்கள்.2 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": 524,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தொழுகையைக் கடைப் பிடிப்பதாகவும், ஸகாத் வழங்குவதாகவும், ஒவ்வொரு முஸ்-முக்கும் நலம் நாடுவ தாகவும் உறுதிமொழி அளித்தேன். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": 525,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (கலீஃபா) உமர் (ரலி) அவர்களிடம் அமர்ந்திருந்தோம். அப்போது உமர் (ரலி) அவர்கள், “உங்களில் யார் (இனி தலைதூக்கவிருக்கும்) ‘ஃபித்னா’ (சோதனை அல்லது குழப்பம்) பற்றி அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொன்னதை நினைவில் வைத்திருக்கி றார்?” என்று கேட்டார்கள். நான், “நபி (ஸல்) அவர்கள் சொன்னதைப் போன்றே நான் அதை நினைவில் வைத்திருக்கிறேன்” என்று சொன்னேன். உமர் (ரலி) அவர்கள், “(அதைக் கூறுங்கள்) நீங்கள்தான் ‘நபி (ஸல்) அவர்களிடம்’ அல்லது ‘(நபி (ஸல்) அவர்களின்) அக்கூற்றைப் பற்றி’ துணிச்சலுடன் (கேள்வி கேட்டு விளக்கம் பெறக்கூடியவராய்) இருந்தீர்கள்” என்று சொன்னார்கள். நான், “ஒரு மனிதன் (இறைவழிபாட்டில் கவனம் செலுத்த முடியாத அளவுக்கு) தன் குடும்பத்தார், சொத்து, பிள்ளைகள் ஆகியோரின் விஷயத்தில் (அளவு கடந்த நேசம் வைப்பதன் மூலமும்), தன் அண்டை வீட்டார் விஷயத்தில் (அவர்களின் உரிமைகளில் குறைவைப்பதன் மூலமும்) ‘ஃபித்னா’வில் (சோதனையில்) ஆழ்த்தப்படுவார். அப்போது தொழுகை, நோன்பு, தர்மம், நன்மை புரியும்படி கட்டளையிட்டு தீமையி-ருந்து தடுத்தல் ஆகியவை அதற்கான பரிகாரமாகும்” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள் என்றேன். உமர் (ரலி) அவர்கள், “நான் (‘சோதனை’ எனும் பொருள் கொண்ட ஃபித்னாவான) இதை(ப் பற்றி)க் கேட்கவில்லை. கடல் அலையைப் போன்று, அடுக்கடுக்காக ஏற்படக் கூடிய (நபி (ஸல்) அவர்களால் முன்னேறிவிப்புச் செய்யப்பட்ட ‘குழப்பம்’ எனும் பொருள் கொண்ட) ‘ஃபித்னா’வைப் பற்றியே கேட்கிறேன்” என்று சொன்னார்கள். அதற்கு நான், “இறைநம்பிக்கை யாளர்களின் தலைவரே! அதைப் பற்றி நீங்கள் கவலைப்பட வேண்டியதில்லை. (உங்கள் காலத்தில் அவற்றில் எதுவும் தலைதூக்கப் போவதில்லை.) உங்களுக்கும் அவற்றுக்கும் இடையே மூடப்பட்ட கதவொன்று உள்ளது” என்று கூறினேன். “அந்தக் கதவு உடைக்கப்படுமா? அல்லது திறக்கப்படுமா” என்று கேட்டார் கள். நான், “இல்லை, அது உடைக்கப்படும்” என்று பதிலளித்தேன். அதற்கு உமர் (ரலி) அவர்கள், “அவ்வாறாயின், (அது உடைக்கப்பட்டுவிட்டால் பின்னர் மறுமை நாள்வரை) ஒருபோதும் அது மூடப் படாது” என்று சொன்னார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவ ரான அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறுகிறார்கள்:) நாங்கள் (ஹுதைஃபா (ரலி) அவர்களிடம்), “உமர் (ரலி) அவர்கள் அந்தக் கதவு எதுவென்று அறிந்திருந்தார்களா?” என்று கேட்டோம். ஹுதைஃபா (ரலி) அவர்கள், “ஆம்; பகலுக்குமுன் இரவு உண்டு என்பதை அறிவதைப் போன்று உமர் (ரலி) அவர்கள் அதை அறிந்திருந்தார்கள். (ஏனெனில்,) பொய்கள் கலவாத செய்தியையே அவருக்கு நான் அறிவித்திருந்தேன்” என்று பதிலளித்தார்கள். அந்தக் கதவு எதுவென ஹுதைஃபா (ரலி) அவர்களிடம் கேட்க நாங்கள் அஞ்சினோம். எனவே, மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்களை (ஹுதைஃபா (ரலி) அவர்களிடம் அது குறித்து)க் கேட்கச் சொன்னோம். மஸ்ரூக் அவர்கள் கேட்டதற்கு “(அந்தக் கதவு) உமர் (ரலி) அவர்கள்தான்” என்று ஹுதைஃபா (ரலி) அவர்கள் பதிலளித்தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": 526,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் ஒரு (அந்நியப்) பெண்ணை முத்தமிட்டுவிட்டார். அந்த மனிதர் நபி (ஸல்) அவர்களிடம் வந்து (பரிகாரம் கேட்டு), இந்த விவரத்தைச் சொன்னார். அப்போது அல்லாஹ், “(நபியே!) பக-ன் இரு முனைகளிலும் இரவில் சில பகுதிகளிலும் தொழுகையைப் கடைப் பிடிப்பீராக. நிச்சயமாக நன்மைகள் தீமைகளைப் போக்கிவிடும்” (11:114) எனும் வசனத்தை அருளினான். அந்த மனிதர், “இது எனக்கு மட்டுமா, அல்லாஹ்வின் தூதரே! (அல்லது அனை வருக்குமா?)” என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், “(இதன்படி செயல்படும்) என் சமுதாயத்தார் அனைவருக்கும்தான்” என்று பதிலளித்தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": 527,
			"text": "வலீத் பின் அல்அய்ஸார் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களின் இல்லத்தை நோக்கி சைகை செய்தவாறு அபூஅம்ர் அஷ்ஷைபானீ (ரஹ்) அவர்கள் கூறினார்கள்: இதோ இந்த வீட்டுக்காரர் (பின்வருமாறு) என்னிடம் தெரிவித்தார்கள்: நான் நபி (ஸல்) அவர்களிடம், “அல்லாஹ்வுக்கு மிகவும் விருப்பமான செயல் (அமல்) எது?” என்று கேட்டேன். அவர்கள், “உரிய நேரத்தில் தொழுகையை நிறைவேற்றுவது” என்றார்கள். “பிறகு எது?” என்று கேட்டேன். “தாய் தந்தையருக்கு நன்மை புரிவது” என்றார்கள். “பிறகு எது?” என்றேன். அவர்கள், “அல்லாஹ்வின் பாதையில் அறப்போர் புரிவது” என்று பதிலளித்தார்கள். இ(ம் மூ)வற்றை மட்டுமே என்னிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தெரிவித்தார்கள். இன்னும் அதிகமாக (இது குறித்து) நான் கேட்டிருந்தால், எனக்கு இன்னும் அதிகமாகப் பதிலளித்திருப்பார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": 528,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: உங்களில் ஒருவரது (வீட்டு) வாச-ல் ஆறு ஒன்று (ஓடிக்கொண்டு) இருக்கிறது. அதில் அவர் தினமும் ஐந்து தடவை நீராடுகிறார். அ(வ்வாறு நீராடுவ)து அவரது (மேனியிலுள்ள) அழுக்குகளில் எதையும் தங்கவிடுமா? என்ன நினைக்கிறீர்கள் சொல்லுங்கள்?” என்று கேட்டார்கள். “அவரது (மேனியிலுள்ள) அழுக்குகளில் எதையும் தங்க விடாது” என்று மக்கள் பதிலளித்தார்கள். “இதுதான் ஐவேளைத் தொழுகையின் நிலையாகும்; இ(வற்றை நிறைவேற்றுவ)தன் மூலம் அல்லாஹ் குற்றங்களைக் களைகிறான்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": 529,
			"text": "ஃகைலான் பின் ஜரீர் அல்மஅவலீ (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களது காலத்தில் இருந்தவற்றில் எதையும் (இன்று) என்னால் காண முடியவில்லை” என அனஸ் (ரலி) அவர்கள் கூறினார்கள். “தொழுகை இருக்கிறதே” என்று (அவர்களிடம்) கேட்கப்பட்டது. அதற்கு அனஸ் (ரலி) அவர்கள், “(உரிய நேரத்தில் நிறைவேற்றாமல்) தொழுகையைக்கூட நீங்கள் வீணாக்கிவிடவில்லையா?” என்று கேட்டார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 530,
			"arabicnumber": 530,
			"text": "முஹம்மத் பின் முஸ்-ம் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறியதாவது: திமஷ்க் (டமாஸ்கஸ்) நகரி-ருந்த அனஸ் (ரலி) அவர்களிடம் நான் சென்றேன். அவர்கள் அழுதுகொண்டிருந்தார்கள். அப்போது நான் அவர்களிடம், “ஏன் அழுகிறீர்கள்?” என்று கேட்டேன். அதற்கு அவர்கள், “(நபி (ஸல்) அவர்களது காலத் தில் நடைமுறைப்படுத்தப்பட்டு) நான் கண்டவற்றில் இந்தத் தொழுகையைத் தவிர வேறெதையும் (முறையாக நடை முறைப்படுத்தப்படுவதை இன்று) என்னால் காண முடியவில்லை; இந்தத் தொழுகை கூட (உரிய நேரத்தில் நிறைவேற்றப் படாமல்) வீணடிக்கப்பட்டுவிட்டது” என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": 531,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தொழுதுகொண்டிருக்கையில் தம் இறைவனுடன் இரகசியமாக உரையாடுகிறார். எனவே, (தொழுதுகொண்டிருக்கும்போது எச்சில் வந்துவிட்டால்) அவர் தமக்கு வலப் பக்கத்தில் உமிழ வேண்டாம். மாறாக, தமது இடப் பாதத்திற்குக் கீழே உமிழட்டும். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் சயீத் பின் அபீஅரூபா (ரஹ்) அவர்களது அறிவிப்பில், “தமக்கு முன்புறமாகத் துப்பலாகாது. எனினும் தமது இடப் பக்கமோ அல்லது பாதத்துக்குக் கீழேயோ துப்புக” என்று (நபி (ஸல்) அவர்கள் கூறியதாக) இடம்பெற்றுள்ளது. ஷுஅபா பின் அல்ஹஜ்ஜாஜ் (ரஹ்) அவர்களது அறிவிப்பில், “தமக்கு முன்புறமோ, வலப் பக்கமோ துப்பலாகாது. எனினும், தமது இடப் பக்கமோ அல்லது பாதத்துக்குக் கீழேயோ துப்புக!” என்று (நபி (ஸல்) அவர்கள் கூறியதாக) காணப் படுகிறது. ஹுமைத் (ரஹ்) அவர்களது அறிவிப்பில், “கிப்லா (கஅபா) திசையில் அவர் துப்பலாகாது; தமக்கு வலப் புறமாகவும் துப்பலாகாது. எனினும், அவர் தமக்கு இடப் பக்கமோ அல்லது தமது பாதத்துக்குக் கீழேயோ துப்பட்டும்” என்று கூறப்பட்டுள்ளது.3 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": 532,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: முறைப்படி சிரவணக்கம் (சஜ்தா) செய்யுங்கள். நாயைப் போன்று கைகளைப் படுக்க வைக்கலாகாது. (தொழும்போது எச்சில் வந்துவிட்டால்) தமக்கு முன்புறமோ, வலப் புறமோ துப்பலாகாது. ஏனெனில், தொழுதுகொண்டிருப்பவர், தம் இறைவனுடன் இரகசியமாக உரையாடிக் கொண்டிருக்கிறார். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 534,
			"arabicnumber": 534,
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": 535,
			"text": "அபூதர் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை நாங்கள் பயணத்தில் இருந்தோம். அப்போது) நபி (ஸல்) அவர்களின் தொழுகை அறிவிப்பாளர் (முஅத்தின் பிலால் (ரலி) அவர்கள்) லுஹ்ர் தொழுகைக்கு ‘பாங்கு’ சொல்ல முற்பட்டார். அப்போது நபி (ஸல்) அவர்கள், ‘வெப்பம் தணியட்டும்; வெப்பம் தணியட் டும்’ அல்லது ‘பொறுப்பீராக; பொறுப்பீராக’ என்று கூறிவிட்டு, “கடுமையான வெப்பம் நரக நெருப்பின் பெருமூச்சால் உண்டா கிறது. வெப்பம் கடுமையாகும்போது (லுஹ்ர்) தொழுகையை வெப்பம் தணிந்தபின் தொழுங்கள்” என்று கூறினார்கள். (எனவே நாங்கள் லுஹ்ர் தொழுகையைத் தாமதப்படுத்தினோம்). எந்த அளவுக்கென்றால் மணல் மேடுகளிலிருந்து நிழல் படிவதை நாங்கள் பார்த்தோம். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": 537,
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": 538,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: லுஹ்ர் தொழுகையை வெப்பம் தணிந்தபின் தொழுங்கள். ஏனெனில், கடுமையான வெப்பம், நரக நெருப்பின் பெருமூச்சால் உண்டாகிறது. இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": 539,
			"text": "அபூதர் அல்ஃகிஃபாரீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் ஒரு பயணத்தில் நபி (ஸல்) அவர்களுடன் இருந்தோம். அப்போது தொழுகை அறிவிப்பாளர் (பிலால் (ரலி) அவர்கள்), லுஹ்ர் தொழுகைக்காக பாங்கு சொல்ல முற்பட்டபோது, (அவரிடம்) நபி (ஸல்) அவர்கள், “வெப்பம் தணியட்டும்” என்று கூறினார்கள். பிறகு (சிறிது நேரம் கழித்து) மீண்டும் அவர் ‘பாங்கு’ சொல்ல முற்பட்டபோது அவரிடம், “வெப்பம் தணியட்டும்” என்று மணல் மேடுகளிலி ருந்து நிழல் படிவதை நாங்கள் பார்க்கும் வரை (இவ்வாறு) கூறினார்கள். பிறகு, “கடுமையான வெப்பம் நரக நெருப்பின் பெருமூச்சால் உண்டாகிறது. எனவே, வெப்பம் கடுமையாகும்போது (லுஹ்ர்) தொழுகையை வெப்பம் தணிந்த பின் தொழுங்கள்” என்று சொன்னார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறினார்கள்: ‘நிழல் படிதல்’ (‘தத்தஃபய்யஉ’) என்றால், ‘நிழல் சாய்தல்’ (தத்தமய்யலு) என்று பொருள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": 540,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சூரியன் உச்சியிலிருந்து சாய்ந்த (நண்பகலின்)போது (தமது இல்லத்தி-ருந்து) புறப்பட்டு வந்து லுஹ்ர் தொழு(வித்) தார்கள். பிறகு சொற்பொழிவுமேடை (மிம்பர்) மீதேறி நின்று மறுமை நாளை நினைவூட்டிப் பேசினார்கள். அந்நாளில் அதிர்ச்சியூட்டும் பல சம்பவங்கள் நிகழும் என்று குறிப்பிட்டார்கள். பிறகு (அவர்கள் விரும்பாத பல்வேறு கேள்விகளை மக்கள் வற்புறுத்திக் கேட்டபோது), “(இன்று) யார் எது குறித்துக் கேட்க விரும்பினாலும் கேட்கட்டும். இந்த இடத்தில் நான் இருக்கும்வரை எது குறித்து நீங்கள் என்னிடம் கேட்டாலும் அது குறித்து உங்களுக்கு நான் தெரிவிக்காமல் இருக்கமாட்டேன்” என்று (கோபத்துடன்) கூறினார்கள். எனவே, மக்கள் அதிகமாக அழலாயினர். நபி (ஸல்) அவர்களோ, “கேளுங்கள் என்னிடம்” என்று அடிக்கடி கூறிக்கொண்டி ருந்தார்கள். அப்போது அப்துல்லாஹ் பின் ஹுதாஃபா அஸ்ஸஹ்மீ (ரலி) அவர்கள் எழுந்து, “என் தந்தை யார்?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள் “ஹுதாஃபாதான் உம்முடைய தந்தை” என்று பதிலளித்துவிட்டு மீண்டும், “கேளுங்கள் என்னிடம்” என்று அடிக்கடி கூறலானார்கள். (நபியவர்களின் கோபத்தை அறிந்துகொண்ட) உமர் (ரலி) அவர்கள் மண்டியிட்டு அமர்ந்து, “அல்லாஹ்வை இறைவனாகவும் இஸ்லாத்தை மார்க்கமாகவும் முஹம்மத் (ஸல்) அவர்களை இறைத்தூதராகவும் நாங்கள் மனநிறைவுடன் ஏற்றுக்கொண்டோம்” என்று கூறினார்கள். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள் அமைதியானார்கள். பிறகு, நபி (ஸல்) அவர்கள், “சற்றுமுன் (நான் தொழுதுகொண்டிருந்தபோது) இதோ இந்தச் சுவரில் சொர்க்கமும் நரகமும் எனக்கு எடுத்துக்காட்டப்பட்டன. (இந்த இடத்தில் நான் கண்ட காட்சியைப் போன்று) நன்மையிலும் தீமையிலும் வேறெந்தக் காட்சியையும் நான் (ஒருபோதும்) கண்டதில்லை” என்று கூறினார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": 541,
			"text": "அபூபர்ஸா நள்லா பின் உபைத் அல்அஸ்லமீ (ரலி) அவர்கள் கூறியதாவது: எங்களில் ஒருவர் தம் பக்கத்தி-ருப்ப வரை அறிந்துகொள்ளும் (அளவுக்கு வெளிச்சம் வந்துவிடும்) நேரத்தில் நபி (ஸல்) அவர்களை சுப்ஹு தொழுவிப்ப வராக இருந்தார்கள். அறுபது (வசனங்கள்) முதல் நூறு (வசனங்கள்)வரை சுப்ஹு தொழுகையில் ஓதுவார்கள். சூரியன் உச்சியிலிருந்து சாயும் (நண்பகல் நேரத்தின்)போது லுஹ்ரை தொழுவிப்பார்கள். அடுத்து எங்களில் ஒருவர் (தொழுது விட்டு) மதீனாவின் கோடியிலுள்ள (தமது இல்லத்துக்குத்) திரும்பிச் சென்றுவிடுவார். அப்போதும் சூரியன் (வெப்பம் தணியாமல் வெளிச்சம் குறையாமல்) தெளிவாக இருந்துகொண்டிருக்கும். (அந்த அளவுக்கு நேரம் இருக்கும்போது) அஸ்ர் தொழுவிப்பார்கள். -இதன் அறிவிப்பாளரான அபுல் மின்ஹால் (சய்யார் பின் சலாமா அல்பஸ்ரீ-ரஹ்) அவர்கள் கூறுகிறார்கள்: மஃக்ரிப் தொழுகை(யின் நேரம்) பற்றி அபூபர்ஸா (ரலி) அவர்கள் (கூறினார்கள். ஆனால், அவர்கள்) கூறியதை நான் மறந்துவிட்டேன். “இஷா தொழுகையை இரவின் மூன்றில் ஒரு பகுதி(யில் முதல் பகுதி)வரை தாமதப்படுத்துவதை நபி (ஸல்) அவர்கள் குறையாகக் கருதமாட்டார்கள்” என்று அபுல்மின்ஹால் (ரஹ்) அவர்கள் குறிப்பிட்டார்கள். பின்னர் (ஒரு முறை) ‘பாதி இரவுவரை’ என்று அபுல்மின்ஹால் (ரஹ்) அவர்கள் கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஓர் அறிவிப்பில், முஆத் பின் முஆத் (ரஹ்) அவர்கள் கூறியுள்ளார் கள்: “பின்னர் ஒரு முறை அபுல்மின்ஹால் (ரஹ்) அவர்களைச் சந்தித்தேன். அப்போது அவர் ‘அல்லது இரவில் மூன்றில் ஒரு பகுதிவரை’ என்று (ஐயப்பாட்டுடன்) அறிவித்தார்” என ஷுஅபா (ரஹ்) அவர்கள் கூறினார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": 542,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நண்பகல் நேரங்களில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக் குப்பின் (லுஹ்ர்) தொழும்போது, வெப்பத் தைத் தவிர்ப்பதற்காக எங்கள் ஆடையின் (ஒரு பகுதியின்) மீது சிரவணக்கம் (சஜ்தா) செய்பவர்களாக இருந்தோம். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": 543,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவில் லுஹ்ரையும் அஸ்ரையும் (சேர்த்து) எட்டு ரக்அத்களாகவும் மஃக்ரிபையும் இஷா வையும் (சேர்த்து) ஏழு ரக்அத்களாகவும் தொழு(வித்)தார்கள். இதன் அறிவிப்பாளரான ஜாபிர் பின் ஸைத் (ரஹ்) அவர்களிடம் அய்யூப் அஸ் ஸக்தியானீ (ரஹ்) அவர்கள், “இ(வ்வாறு சேர்த்துத் தொழுத)து மழைக் காலத்தில் நடந்திருக்கலாமோ?” என்று கேட்டார்கள். அதற்கு ஜாபிர் (ரஹ்) அவர்கள் ‘இருக் கலாம்’ என்று பதிலளித்தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: எனது அறையி-ருந்து சூரிய ஒளி (முற்றாக) அகலாத நிலையில் அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் அஸ்ர் தொழுகையைத் தொழுவார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் அபூஉசாமா (ரஹ்) அவர் களது அறிவிப்பில், ‘எனது அறையின் மத்தியிலிருந்து விலகாத நிலையில்’ என்று காணப்படுகிறது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": 545,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: சூரிய ஒளி எனது அறைக்குள் இருந்துகொண்டிருக்க, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அஸ்ர் தொழுகையைத் தொழுவார்கள்; அப்போது எனது அறையில் நிழல் படிந்திருக்காது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": 546,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: சூரிய ஒளி எனது அறைக்குள் விழுந்துகொண்டும் நிழல் இன்னும் (கிழக்குப் பக்கச் சுவரில்) விழாமலும் உள்ள நிலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அஸ்ர் தொழுவார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் மா-க் (ரஹ்), யஹ்யா பின் சயீத் (ரஹ்), ஷுஐப் பின் அபீஹம்ஸா (ரஹ்), இப்னு அபீஹஃப்ஸா (முஹம்மத் பின் மைஸரா அல்பஸரீ- ரஹ்) ஆகியோரது அறிவிப்பில், ‘சூரிய ஒளி (முற்றாக) அகலாத நிலையில்’ என்று இடம்பெற்றுள்ளது.8 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": 547,
			"text": "சய்யார் பின் சலாமா (ரஹ்) அவர்கள் கூறியதாவது: நானும் என் தந்தையும் அபூபர்ஸா (நள்லா பின் உபைத்-ர-) அவர்களிடம் சென்றோம். அப்போது அவர்களிடம் என் தந்தை, “கடமையான தொழுகையை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எவ்வாறு தொழுவார்கள்?” என்று கேட்டார்கள். அதற்கு அபூபர்ஸா (ரலி) அவர்கள், “-நீங்கள் முதல் தொழுகை என்று அழைக்கும்- நண்பகல் (லுஹ்ர்) தொழுகையைச் சூரியன் (நடுவானி-ருந்து மேற்கு நோக்கி) சாயும்போது நபி (ஸல்) அவர்கள் தொழுவார்கள். (பின்னர்) அஸ்ர் தொழுவார்கள். எங்களில் ஒருவர் (அஸ்ர் தொழுதுவிட்டு) மதீனாவின் கடைக்கோடி யிலுள்ள தமது இல்லத்திற்குத் திரும்பி சென்றுவிடுவார். அப்போதும் சூரியன் (வெளிச்சம் குறையாமல்) தெளிவாக இருந்துகொண்டிருக்கும்” என்று கூறினார்கள். -அறிவிப்பாளர் சய்யார் (ரஹ்) அவர்கள் கூறுகிறார்கள்: மஃக்ரிப் (தொழுகையின் நேரம்) பற்றி அபூபர்ஸா (ரலி) அவர்கள் (கூறினார்கள்; ஆனால், அவர்கள்) கூறியதை நான் மறந்துவிட்டேன். தொடர்ந்து அபூபர்ஸா (ரலி) அவர்கள் கூறினார்கள்: ‘அல்அ(த்)தமா’ என்று நீங்கள் அழைக்கும் இஷா தொழுகையைத் தாமதப்படுத்துவதையே நபி (ஸல்) அவர்கள் விரும்புவார்கள். இஷா தொழு கைக்குமுன் உறங்குவதையும் இஷா தொழுகைக்குப்பின் பேசிக்கொண்டிருப் பதையும் நபி (ஸல்) அவர்கள் வெறுப் பார்கள். (எங்களில்) ஒருவர் தமக்குப் பக்கத்தி-ருப்பவரை அறிந்துகொள்ளும் (அளவுக்கு வெளிச்சம் வந்துவிடும்) நேரத்தில் வைகறை (சுப்ஹு) தொழுகையை முடித்துத் திரும்புவார்கள். (வைகறைத் தொழுகையில்) அறுபது (வசனங்கள்) முதல் நூறு (வசனங்கள்)வரை ஓதுவார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அஸ்ர் தொழுகையைத் தொழுதுவிட்டு (மதீனாவுக்கு அருகிலுள்ள ‘குபா’ பகுதியில் வசிக்கும்) பனூ அம்ர் பின் அவ்ஃப் குலத்தாரிடம் எங்களில் சிலர் சென்றால், அக்குலத்தார் அஸ்ர் தொழுதுகொண்டிருப்பதைக் காண்போம். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": 549,
			"text": "அபூஉமாமா (அஸ்அத் பின் சஹ்ல் பின் ஹுனைஃப்-ர-) அவர்கள் கூறியதாவது: நாங்கள் (கலீஃபா) உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்களுடன் லுஹ்ர் தொழுகையை (அதன் இறுதி நேரத்தில்) தொழுதோம். பின்னர் (அங்கிருந்து) புறப்பட்டு (மதீனாவின் துணை ஆட்சியராக இருந்த) அனஸ் பின் மா-க் (ரலி) அவர்களிடம் சென்றபோது, அவர்கள் அஸ்ர் தொழுகையை (அதன் ஆரம்ப நேரத்தில்) தொழுதுகொண்டிருப்பதைக் கண்டோம். அப்போது நான் (மரியாதை நிமித்தம்) ‘என் தந்தையின் சகோதரரே!’ (என்று அழைத்து) “இப்போது நீங்கள் தொழுதது எந்தத் தொழுகை (லுஹ்ரா? அல்லது அஸ்ரா?)” என்று கேட்டேன். அதற்கு அனஸ் (ரலி) அவர்கள், “(இது) அஸ்ர் தொழுகை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் இவ்வாறே (ஆரம்ப நேரத்தில்) நாங்கள் தொழுபவர்களாக இருந்தோம்” என்று பதிலளித்தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": 550,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அஸ்ர் தொழுகையைத் தொழுவார்கள். அப்போது சூரியன் உயர்ந்தே இருக்கும்; (அஸ்தமனத்தை நெருங்கும்போது ஏற்படும் நிறமாற்றம் நிகழாமல்) தெளிவாகவே இருக்கும். (நஜ்த் திசையி-ருந்த) மேட்டுப்பாங்கான (கிராமப்) பகுதிகளுக்குச் செல்பவர் அங்கே இருப்பவர்களிடம் சென்றடையும்போது, சூரியன் உயர்ந்தே இருக்கும். அந்த மேட்டுப்பாங்கான (கிராமப்) பகுதிகளில் சில மதீனாவி-ருந்து சுமார் நான்கு மைல் தொலைவில் அமைந்திருந்தன. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": 551,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அஸ்ர் தொழுகையைத் தொழுவோம். பிறகு எங்களில் (மேட்டுப் பாங்கான பகுதிகளில் ஒன்றான) ‘குபா’விற்குச் செல்பவர் அங்கே சென்றடைவார். அப்போதும் சூரியன் உயரத்திலேயே இருக்கும்.9 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": 552,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (உரிய நேரத்தில் தொழாமல்) யாருக்கு அஸ்ர் தொழுகை தவறிவிடுமோ அவர் தம் குடும்பத்தையும் செல்வத்தையும் இழந்து தனிமைப்படுத்தப்பட்டவரைப் போன்றவர் ஆவார். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": 553,
			"text": "அபுல்மலீஹ் (ஆமிர் பின் உசாமா-ரஹ்) அவர்கள் கூறியதாவது: மேகமூட்டம் இருந்த ஒரு நாளில் புரைதா பின் அல்ஹசீப் (ரலி) அவர்களு டன் ஒரு போரில் நாங்கள் இருந்தோம். அப்போது அவர்கள், “அஸ்ர் தொழு கையை விரைவாக (அதன் ஆரம்ப நேரத்தில்) நிறைவேற்றுங்கள். ஏனெனில் நபி (ஸல்) அவர்கள், ‘யார் அஸ்ர் தொழுகையை விட்டுவிடுகிறாரோ அவருடைய நற்செயல்கள் அழிந்து விட்டன’ என்று கூறியுள்ளார்கள்” என்றார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": 554,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (ஒரு பௌர்ணமி இரவில்) நபி (ஸல்) அவர்களுடன் (அமர்ந்துகொண்டு) இருந்தோம். அப்போது அவர்கள் முழு நிலவைக் கூர்ந்து பார்த்தபடி, “இந்த நிலாவை நீங்கள் நெரிசல் இல்லாமல் காண்பதைப் போன்று உங்கள் இறைவனையும் (மறுமையில்) காண்பீர்கள். எனவே, சூரியன் உதிக்கும் முன்னருள்ள தொழு கையிலும், சூரியன் மறையும் முன்னருள்ள தொழுகையிலும் (ஃபஜ்ரிலும் அஸ்ரிலும் உறக்கம் போன்ற) எதற்கும் ஆட்படாமல் இருக்க உங்களால் இயலுமானால், அவ்வாறே செய்யுங்கள் (இறைவனை நீங்கள் தரிசிக்கலாம்)” என்று கூறிவிட்டு, “சூரியன் உதயமாகும் முன்னரும், மறையும் முன்னரும் உங்கள் இறைவனைப் போற்றித் துதியுங்கள்” (50:39) எனும் இறைவசனத்தை ஓதினார்கள். (இதற்கு விளக்கமளிக்கையில்) இதன் அறிவிப்பாளர்களில் ஒருவரான இஸ்மா யீல் பின் அபீகா-த் (ரஹ்) அவர்கள், “(இந்தத் தொழுகைகளை) நீங்கள் தவறா மல் தொழுங்கள்” என்று கூறினார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரவு நேரத்தில் சில வானவர்களும் பகல் நேரத்தில் சில வானவர்களும் அடுத்தடுத்து (சுழற்சி முறையில்) உங்களிடையே வருகின்றனர்; ஃபஜ்ர் தொழுகை யிலும் அஸ்ர் தொழுகையிலும் ஒன்றுகூடுகின்றனர். பிறகு, உங்களிடையே இரவில் தங்கியவர்கள் (வானத்துக்கு) ஏறிச் செல்கின்றனர். அப்போது மக்களைப் பற்றி மிகவும் அறிந்தவனான அல்லாஹ் அ(வ் வான)வர் களிடம், “(பூமியிலுள்ள) என் அடியார்களை எந்த நிலையில் விட்டுவந்தீர்கள்?” என்று கேட்பான். அதற்கு அ(வ்வான)வர்கள், “அவர்களை உன்னைத் தொழுகின்ற நிலையில் விட்டுவந்தோம்; அவர்கள் (உன்னைத்) தொழுதுகொண்டிருந்த நிலையிலேயே அவர்களிடம் நாங்கள் சென்றோம்” என்று பதிலளிப்பார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": 556,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் சூரியன் மறைவ தற்குமுன் அஸ்ர் தொழுகையில் ஒரு சிரவணக்கத்தை (ஒரு ரக்அத்தை) அடைந்துகொண்டால், அவர் தமது தொழுகையை முழுமைப்படுத்தட்டும்! சூரியன் உதிப்பதற்குமுன் சுப்ஹு தொழுகையில் ஒரு சிரவணக்கத்தை (ஒரு ரக்அத்தை) அடைந்துகொண்டால் அவரும் தமது தொழுகையை முழுமைப் படுத்தட்டும்! இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": 557,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களுக்குமுன் வாழ்ந்த சமுதாயத்தாரோடு நீங்கள் வாழும் காலத்தை ஒப்பிடுகையில் நீங்கள் (இவ்வுலகில்) வாழ்வது, அஸ்ர் தொழுகைக்கும் சூரியன் மறைவதற்கும் இடையிலான (குறுகிய) கால அளவே ஆகும். ‘தவ்ராத்’ வேதக்காரர்களுக்கு அந்த வேதம் வழங்கப்பெற்றது. (அதன்படி) அவர்கள் நண்பகல்வரை செயல்பட்டார் கள். பின்னர் ஓய்ந்துபோனார்கள். (கூலி யாக) ஒவ்வொருவருக்கும் ஒரு ‘கீராத்’ வழங்கப்பட்டது. பின்னர் ‘இன்ஜீல்’ வேதக்காரர்களுக்கு அந்த வேதம் வழங்கப்பெற்றது. அவர்கள் அஸ்ர் தொழுகைவரை செயல்பட்டு விட்டுப் பின்னர் ஓய்ந்துபோனார்கள். (கூலியாக) அவர்களுக்கும் ஒவ்வொரு ‘கீராத்’ வழங்கப்பட்டது. பிறகு நமக்கு குர்ஆன் வழங்கப் பெற்றது. நாம் (அஸ்ரிலிருந்து) சூரியன் மறையும்வரை (அதன்படி) செயல்பட் டோம். நமக்கு(க் கூலியாக) இரண்டிரண்டு ‘கீராத்’கள் வழங்கப்பட்டன. எனவே, வேதம் அருளப்பெற்ற அவ்விரு சமுதாயத்தாரும், “எங்கள் இறைவா! இவர்களுக்கு இரண்டிரண்டு ‘கீராத்’கள் வழங்கியுள்ளாய். எங்களுக்கோ ஒவ்வொரு கீராத் வழங்கியுள்ளாயே? நாங்கள் (இவர்களைவிட) அதிக நேரம் வேலை செய்திருந்தோமே?” என்று வினவினர். அதற்கு வல்லமையும் மாண்பும் மிக்க அல்லாஹ், “உங்களுக் குரிய கூ-யில் ஏதேனும் நான் (குறைத்து) உங்களுக்கு அநீதி இழைத்திருக்கிறேனா?” என்று கேட்டான். அவர்கள் “இல்லை” என்று கூறினர். அதற்கு அல்லாஹ், “அ(வ்வாறு முஸ்லிம்களுக்கு அதிகமாகக் கொடுத்த)து, எனது அருட்கொடை; நான் நாடியவர்களுக்கு அதை வழங்குகிறேன்” என்று கூறினான். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: முஸ்-ம்கள், யூதர்கள், கிறித்தவர்கள் ஆகியோரின் நிலை, (குறிப்பிட்ட கூ-க் குக் காலையி-ருந்து) இரவுவரை தமக்கு வேலை செய்வதற்காக ஒரு மனிதரால் அமர்த்தப்பட்ட கூட்டத்தாரின் நிலையை ஒத்திருக்கிறது. (அவர் முத-ல் ஒரு குழுவினரை கூ-க்கு அமர்த்தினார்;) அவர்கள் நண்பகல்வரை வேலை செய்துவிட்டு, “எங்களுக்கு உமது கூ- தேவையில்லை” என்று கூறிவிட்டனர். பிறகு அந்த மனிதர் இன்னொரு குழுவினரைக் கூ-க்கு அமர்த்தி, “இன்று எஞ்சியுள்ள நேரத்தைப் பூர்த்தி செய்யுங்கள். (முதலாவது குழுவின ருக்கு) நான் தருவதாகப் பேசிய கூ-யை உங்களுக்குத் தருகிறேன்” என்றார். அதன்படி அவர்கள் வேலை செய்ய(த் தொடங்கி) அஸ்ர் தொழுகையின் நேரம் வந்தபோது, “உமக்காக நாங்கள் செய்த வேலை (வீணாகட்டும்)” என்றனர். எனவே, அந்த மனிதர் மற்றொரு குழுவினரை வேலைக்கு அமர்த்தினார். அவர்கள் அன்று (அஸ்ரி-ருந்து) சூரியன் மறையும்வரை உள்ள எஞ்சிய நேரத்தில் வேலை செய்தனர். இதனால் அவர்கள் முத-ரண்டு குழுவினரின் கூ-யையும் (சேர்த்து) முழுமையாகப் பெற்றுக்கொண்டனர்.11 இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "ராஃபிஉ பின் கதீஜ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுடன் நாங்கள் மஃக்ரிப் தொழுகை தொழுவோம். பிறகு எங்களில் ஒருவர் திரும்பிச் செல்லும் போது, அவர் தமது அம்பு விழும் இடத்தைப் பார்க்க முடியும். (அந்த அளவுக்கு வெளிச்சமிருக்க, ஆரம்ப நேரத்திலேயே மஃக்ரிப் தொழுவோம்.) அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "முஹம்மத் பின் அம்ர் பின் ஹசன் பின் அலீ (ரஹ்) அவர்கள் கூறியதாவது: ஹஜ்ஜாஜ் பின் யூசுஃப் (மதீனாவின் ஆட்சியராக) வந்தார் (அவர் தொழுகை களைத் தாமதப்படுத்தி தொழுவித்தார்).13 அப்போது நாங்கள் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடம் (தொழுகை நேரம் பற்றிக்) கேட்டோம். அப்போது ஜாபிர் (ரலி) அவர்கள் கூறினார்கள்: நபி (ஸல்) அவர்கள் நண்பக-ல் லுஹ்ர் தொழுவார்கள். சூரியன் (வெளிச் சமோ வெப்பமோ குறையாமல்) தெளிவாக இருக்கும்போது அஸ்ர் தொழுவார்கள். சூரியன் மறைந்ததும் மஃக்ரிப் தொழுவார்கள். இஷாவை சில நேரம் (பின்னேரத்திலும்) சில நேரம் (முன்னேரத்திலுமாகச் சூழ்நிலைக்குத் தக்கவாறு) தொழுவார்கள். மக்கள் (முன்னேரத்திலேயே) குழுமியிருக்கக் கண்டால், ஆரம்ப நேரத்திலேயே தொழுவார்கள். மக்கள் தாமதமாக வரக் கண்டால் தாமதப்படுத்துவார்கள். சுப்ஹு தொழுகையை ‘மக்கள்’ அல்லது ‘நபி (ஸல்) அவர்கள்’ இருள் இருக்கவே (காலை வெளிச்சம் வருவதற்கு முன்பே) தொழு பவர்களாய் இருந்தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "சலமா பின் அல்அக்வஉ (ரலி) அவர்கள் கூறியதாவது: சூரியன் அடிவானில் மறைந்ததும் நாங்கள் நபி (ஸல்) அவர்களுடன் மஃக்ரிப் தொழுகையைத் தொழுபவர்களாக இருந்தோம். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மஃக்ரிபையும் இஷாவையும்) ஏழு ரக்அத்களாக ஒரே நேரத்திலும், (லுஹ்ரையும் அஸ்ரையும்) எட்டு ரக்அத்களாக ஒரே நேரத்திலும் (ஜம்உ செய்து) தொழு(வித்)தார்கள்.14 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": 563,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களது மஃக்ரிப் தொழுகையின் பெயர் விஷயத்தில் உங்களைக் கிராமப்புற அரபியர் மிகைத்துவிட வேண்டாம். கிராமப்புற அரபியர் அதை ‘இஷா’ என்று குறிப்பிட்டுவருகின்றனர். இதை அப்துல்லாஹ் பின் முஃகஃப்பல் அல்முஸனீ (ரலி) அவர்கள் அறிவிக் கிறார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘அ(த்)தமா’ என மக்கள் அழைத்துவந்த இஷா தொழுகையை ஒரு (நாள்) இரவில் எங்களுக்குத் தொழுவித்தார்கள். தொழுது முடித்து எங்களை முன்னோக்கி (எழுந்து நின்று), “இந்த இரவைப் பற்றி உங்களுக் குத் தெரியுமா? இன்றி-ருந்து (சரியாக) ஒரு நூற்றாண்டின் ஆரம்பத்தில், இப்போது பூமியின்மேல் இருக்கக் கூடியவர்களில் ஒருவர்கூட எஞ்சியிருக்க மாட்டார்கள்” என்று கூறினார்கள்.17 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": 565,
			"text": "முஹம்மத் பின் அம்ர் பின் அல்ஹசன் பின் அலீ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடம் நபி (ஸல்) அவர்களின் தொழுகை (நேரம்) பற்றிக் கேட்டோம். அப்போது அவர்கள் (பின்வருமாறு) பதிலளித்தார்கள்: நபி (ஸல்) அவர்கள் நண்பக-ல் லுஹ்ர் தொழுகையைத் தொழுவார்கள். சூரியன் (ஒளி குறையாமல்) தெளிவாக இருக்கும்போது அஸ்ர் தொழுவார்கள். சூரியன் மறைந்ததும் மஃக்ரிப் தொழுவார்கள். (அதிக) மக்கள் குழுமிவிட்டால் இஷாவை விரைவாக (அதன் முன்னேரத்திலேயே) தொழுவார்கள்; மக்கள் குறைவாக இருந்தால் தாமதப்படுத்தித் தொழுவார்கள். சுப்ஹு தொழுகையை இருள் இருக்கவே (காலை வெளிச்சம் வருவதற்குமுன்பே) தொழுவார்கள்.18 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": 566,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: இஸ்லாம் (மதீனாவுக்கு வெளியே) பரவுவதற்கு முன்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு (நாள்) இரவு இஷாவைத் தாமதப்படுத்தினார்கள். உமர் (ரலி) அவர்கள்,“(தங்களை எதிர்பார்த்துக் காத்திருந்து) பெண்களும் சிறுவர்களும் உறங்கிவிட்டனர்” எனத் தெரிவிக்கும் வரை நபி (ஸல்) அவர்கள் (தமது இல்லத் தி-ருந்து தொழுகை நடத்த) வெளியே வரவில்லை. பிறகு வெளியே வந்து பள்ளிவாசலில் உள்ளவர்களை நோக்கி, “(தற்போது) பூமி யிலுள்ளவர்களில் உங்களைத் தவிர வேறு யாரும் இதை எதிர்பார்த்துக் காத்திருக்க வில்லை” என்று கூறினார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": 567,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நானும் (யமன் நாட்டி-ருந்து) என்னு டன் கப்பலில் வந்த என் தோழர்களும் (மதீனாவிலிருந்த) ‘பகீஉ புத்ஹான்’ எனும் பள்ளத்தாக்கில் தங்கியிருந்தோம். நபி (ஸல்) அவர்கள் மதீனாவில் இருந்தார்கள். ஒவ்வோர் இரவும் இஷா தொழுகை நேரத்தில் எங்களில் ஒரு குழுவினர் முறைவைத்து நபி (ஸல்) அவர்களிடம் செல்பவர்களாக இருந்தோம். (எனது முறை வந்தபோது) நானும் என் தோழர்களும் நபி (ஸல்) அவர்களிடம் சென்ற நேரம் அவர்கள் (போர் ஆயத்தம் சம்பந்தப்பட்ட) ஒரு விவகாரத்தில் ஈடுபட்டுக்கொண்டிருந்ததால் நள்ளிரவு நேரமாகும்வரை இஷாவைத் தாமதப்படுத்தினார்கள். பிறகு நபி (ஸல்) அவர்கள் வெளியே வந்து மக்களுக்கு இஷா தொழுகை நடத்தினார்கள். தொழுது முடித்தபோது வந்திருந் தோரை நோக்கி, “அப்படியே இருங்கள். நற்செய்தி பெற்றுக்கொள்ளுங்கள்” என்று கூறிவிட்டு, ‘இந்த நேரத்தில் உங்களைத் தவிர மக்களில் வேறு யாரும் தொழ வில்லை’ அல்லது ‘இந்த நேரத்தில் உங்க ளைத் தவிர வேறு யாரும் தொழவில்லை’ என்று கூறினார்கள் -இந்த இரண்டு வாக்கியங்களில் எதை நபி (ஸல்) அவர்கள் சொன்னார்கள் என்று எனக்குத் தெரிய வில்லை.- இது அல்லாஹ் உங்களுக்குச் செய்த அருட்கொடைகளில் ஒன்றாகும்” என்று குறிப்பிட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர் களிடமிருந்து செவியுற்ற இந்த விஷயத் தைக் கேட்டுப் பேருவகையடைந்தவர் களாக நாங்கள் திரும்பினோம். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": 568,
			"text": "அபூபர்ஸா (நள்லா பின் உபைத்-ர-) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இஷா தொழுகைக்குமுன் உறங்குவதையும் இஷா தொழுகைக்குப்பின் (உறங்காமல்) பேசிக்கொண்டிருப்பதையும் வெறுப்ப வர்களாக இருந்தார்கள்.19 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": 569,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இஷாவை தாமதப்படுத்தி னார்கள். இறுதியில், “பெண்களும் சிறுவர்களும் (தங்களை எதிர்பார்த்துக் காத்திருந்து) உறங்கிவிட்டனர். தொழுவிக்க வாருங்கள்” என்று உமர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களை அழைத்தார்கள். பிறகு அவர்கள் வந்து, “உங்களைத் தவிர பூமியிலுள்ள வேறு யாரும் இத்தொழு கையை எதிர்பார்த்துக் காத்துக்கொண்டி ருக்கவில்லை” என்று கூறினார்கள். அன்றைய தினத்தில் மதீனாவைத் தவிர வேறு எங்கும் தொழுகை நடைபெறவில்லை. செம்மேகம் மறைந்தது முதல் இரவின் மூன்று பாகத்தில் முந்திய பகுதி முடியும்வரையுள்ள இடைப்பட்ட நேரத்தில் மக்கள் இஷா தொழுபவர்களாக இருந்தனர். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": 571,
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஒரு நாள் இரவு) இஷா தொழுகையைப் பாதி இரவுவரை தாமதப்படுத்தினார்கள். பிறகே தொழு(வித்)தார்கள். பின்னர், “மக்கள் தொழுதுவிட்டு உறங்கிவிட்டனர். அறிந்துகொள்ளுங்கள்: ஒரு தொழுகைக்காக நீங்கள் காத்துக் கொண்டிருக்கும்வரை நீங்கள் அத்தொழு கையிலேயே உள்ளீர்கள் (என்றே கருதப்படும்)” என நபி (ஸல்) அவர்கள் கூறினார்கள்.21 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், “அன்றிரவு நபி (ஸல்) அவர்கள் அணிந்திருந்த மோதிரம் மின்னியதை இப்போதும் நான் காண்பதைப் போன்றுள் ளது” என்று அனஸ் (ரலி) அவர்கள் கூறி னார்கள் எனக் கூடுதலாக இடம்பெற் றுள்ளது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": 573,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: ஒரு பௌர்ணமி இரவில் நாங்கள் நபி (ஸல்) அவர்களிடம் இருந்தோம். அப்போது அவர்கள் நிலாவைக் கூர்ந்து பார்த்தபடி, “அறிந்து கொள்ளுங்கள்! இந்த நிலாவை நீங்கள் ‘நெரிசல் இல்லாமல்’ அல்லது ‘குழப்பமடையாமல்’ காண்பதைப் போன்று உங்கள் இறைவனையும் நீங்கள் நிச்சயமாகக் காண்பீர்கள். எனவே, சூரியன் உதிக்கும் முன்னருள்ள தொழுகையிலும், சூரியன் மறையும் முன்னருள்ள தொழுகையிலும் (ஃபஜ்ரிலும் அஸ்ரிலும் உறக்கம் போன்ற) எதற்கும் ஆட்படாமல் இருக்க உங்களால் இயலுமானால், அவ்வாறே செய்யுங்கள் (இறைவனை நீங்கள் தரிசிக்கலாம்)” என்று கூறினார்கள். “சூரியன் உதயமாகும் முன்னரும் மறையும் முன்னரும் உங்கள் இறைவனைப் போற்றித் துதியுங்கள்” (50:39) எனும் இறைவசனத்தை ஓதி(க்காட்டி)னார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": 574,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: பக-ன் இரு முனைகளிலுள்ள (ஃபஜ்ர், அஸ்ர் ஆகிய) குளிர்ந்த இரு நேரத் தொழுகைகளை யார் தொழுகின் றாரோ அவர் சொர்க்கத்தில் நுழைவார். இதை அபூமூசா (அப்துல்லாஹ் பின் கைஸ் அல்அஷ்அரீ-ர-) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": 575,
			"text": "ஸைத் பின் ஸாபித் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுடன் மக்கள் நோன்பு நோற்க உணவருந்தி (சஹர் செய்து)விட்டுப் பின்னர் ஃபஜ்ர் தொழு கைக்காகத் தயாராவார்கள். இதை ஸைத் (ரலி) அவர்களிடமிருந்து அறிவிக்கும் அனஸ் (ரலி) அவர்கள் கூறுகிறார்கள்: நான் (ஸைத் (ரலி) அவர்களிடம்), “உணவு உட்கொண்டு (சஹர் செய்து) முடிப்பதற்கும் தொழுகைக்(காக இப்னு உம்மி மக்(த்)தூம் (ரலி) அவர்கள் பாங்கு செல்வதற்)கும் இடையே எவ்வளவு நேரம் இடைவெளி இருந்தது?” என்று கேட்டேன். அதற்கு ஸைத் பின் ஸாபித் (ரலி) அவர்கள், “ஐம்பது அல்லது அறுபது வசனங்கள் (ஓதும்) அளவு நேரம் (இடைவெளி இருந்தது)” என்று பதிலளித்தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களும் ஸைத் பின் ஸாபித் (ரலி) அவர்களும் (ஒன்றாக நோன்பு நோற்க) சஹர் உணவு உட் கொண்டனர். அவர்கள் இருவரும் சஹர் செய்து முடித்ததும் நபி (ஸல்) அவர்கள் ஃபஜ்ர் தொழுகைக்காக எழுந்து (சென்று) தொழுதார்கள். (இதன் அறிவிப்பாளரான) கத்தாதா பின் திஆமா (ரஹ்) அவர்கள் கூறு கிறார்கள்: நான் அனஸ் (ரலி) அவர்களிடம், “அவர்கள் இருவரும் சஹர் உணவு உட்கொண்டு முடிப்பதற்கும் தொழுகை யில் ஈடுபடுவதற்கும் இடையே எவ்வளவு நேரம் இடைவெளி இருந்தது?” என்று கேட்டேன். அதற்கு அனஸ் (ரலி) அவர்கள், “ஒரு மனிதர் ஐம்பது இறைவசனங்கள் ஓதும் அளவு நேரம் (இடைவெளி இருந்தது)” என்று பதிலளித்தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": 577,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: நான் என் குடும்பத்தாருடன் நோன்பு நோற்க (சஹர்) உணவு அருந்திவிட்டு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களு டன் ஃபஜ்ர் (வைகறைத்) தொழுகையில் கலந்துகொள்வதற்காக அவசர(மாகப் புற)ப்படுவேன். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 578,
			"arabicnumber": 578,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: இறைநம்பிக்கை கொண்ட பெண்கள் தங்களது கம்பளி ஆடைகளால் போர்த்திக்கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஃபஜ்ர் தொழுகை யில் பங்கு பெறுபவர்களாக இருந்தனர்; தொழுகையை முடித்துக்கொண்டு தம் இல்லங்களுக்குத் திரும்பிச் செல்வார்கள். இருட்டின் காரணமாக அவர்களை யாரும் (ஆணா. பெண்ணா என்று) அறிந்து கொள்ள முடியாது.22 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: சூரியன் உதிப்பதற்குமுன் சுப்ஹு தொழுகையின் ஒரு ரக்அத்தை அடைந்து கொண்டவர், சுப்ஹு தொழுகையை அடைந்துகொண்டுவிட்டார். சூரியன் மறைவதற்குமுன் அஸ்ர் தொழுகையின் ஒரு ரக்அத்தை அடைந்துகொண்டவர், அஸ்ர் தொழுகையை அடைந்துகொண்டுவிட்டார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.23 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": 580,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். தொழுகையில் ஒரு ரக்அத்தை (அதற் குரிய நேரத்தில்) அடைந்துகொண்டவர், அந்தத் தொழுகையை அடைந்து கொண்டுவிட்டார்.24 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": 581,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், சுப்ஹு தொழுகைக்குப் பின்னால் இருந்து சூரியன் (உயர்ந்து) சுடர்விடும்வரை தொழுவதை யும், அஸ்ர் தொழுகைக்குப் பின்னால் சூரியன் மறையும்வரை தொழுவதையும் தடை செய்தார்கள் என (மார்க்கப் பற்று, வாய்மை ஆகியவற்றில்) திருப்திக்குரிய சிலர் என்னிடம் உறுதிபடக் கூறினர். அவர்களில் என்னிடம் மிகவும் திருப்திக் குரியவர் உமர் (ரலி) அவர்கள் ஆவார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், “மக்கள் சிலர் இவ்வாறு எனக்கு அறிவித்தனர்” என இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியுள்ளார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": 583,
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": 584,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், இரண்டு வியாபார முறைகளையும், ஆடை அணியும் இரண்டு முறைகளை யும், இரண்டு நேரங்களில் தொழுவதையும் தடை செய்தார்கள்; ஃபஜ்ர் தொழுகைக்குப் பின்னா-ருந்து சூரியன் (முழுமையாக) உதயமாகும்வரையிலும், அஸ்ர் தொழு கைக்குப் பின்னா-ருந்து சூரியன் (முழுமையாக) மறையும்வரையிலும் தொழ வேண்டாமெனத் தடை செய்தார்கள். ஒரே துணியை உடலில் சுற்றிக் கொண்டு அதன் ஒரு மூலையை ஒரு தோளில் போட்டுக்கொண்டு, மற்றொரு தோளைத் திறந்த நிலையில் விட்டுவிடு வதற்கும் (இஷ்திமாலுஸ் ஸம்மாஉ), மர்ம உறுப்பு வானுக்குத் தெரியும்படி ஒருவர் ஒரே ஆடையை (முழங்காலில்) சுற்றிக் கொண்டு இரு முழங்கால்களையும் நட்டு வைத்துக்கொண்டு (அவற்றைக் கைகளால் கட்டியபடி) உட்கார்ந்திருப்பதற்கும் (இஹ்திபா) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தடை செய்தார்கள். முனாபதா, முலாமஸா எனும் இரண்டு வியாபார முறைகளையும் தடை செய்தார்கள்.26 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": 585,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் (சரியாகச்) சூரியன் உதிக்கும் நேரத்தையும் சூரியன் மறையும் நேரத்தையும் தேர்ந்தெடுத்து தொழ வேண்டாம். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": 586,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: சுப்ஹு தொழுகைக்குப் பின்னா-ருந்து சூரியன் (முழுமையாக) உதிக்கும் வரை எந்தத் தொழுகையும் இல்லை. அஸ்ர் தொழுகைக்குப் பின்னா-ருந்து சூரியன் (முழுமையாக) மறையும்வரை எந்தத் தொழுகையும் இல்லை. இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "ஹும்ரான் பின் அபான் (ரஹ்) அவர்கள் கூறியதாவது: “நீங்கள் ஒரு தொழுகையைத் தொழுது கொண்டிருக்கிறீர்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தோழமை கொண்டிருந்த நாங்கள், நபி (ஸல்) அவர்கள் அத்தொழுகையைத் தொழக் கண்டதில்லை. (ஏன், நீங்கள் தொழுது வரும்) அந்த இரு ரக்அத்களைத் தொழ வேண்டாமென நபி (ஸல்) அவர்கள் தடை விதித்துள்ளார்கள்” என முஆவியா (ரலி) அவர்கள் கூறினார்கள். அதாவது அஸ்ருக்குப் பின்னால் இரண்டு ரக்அத்கள் தொழுவதைத் தடை செய்தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": 588,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: இரண்டு நேரங்களில் தொழ வேண்டாமென அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தடை விதித்தார்கள்: 1) ஃபஜ்ர் தொழுகைக்குப் பின்னா-ருந்து சூரியன் (முழுமையாக) உதயமாகும் வரையிலும். 2) அஸ்ர் தொழுகைக்குப் பின்னா-ருந்து (முழுமையாகச்) சூரியன் மறையும் வரையிலும். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": 589,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: என் தோழர்கள் எவ்வாறு (எந்நேரத் தில்) தொழக் கண்டேனோ அவ்வாறே நான் தொழு(து வரு)கின்றேன். இரவிலும் பக-லும் தாம் விரும்பியதைத் தொழும் எவரையும் நான் தடுக்கமாட்டேன். ஆயினும், (சரியாகச்) சூரியன் உதிக்கும் நேரத்தையோ சூரியன் மறையும் நேரத்தையோ (தொழுவதற்காக) நீங்கள் தேர்ந்தெடுக்கக் கூடாது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": 590,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களை இறக்கச் செய்த (இறை)வன் மீதாணையாக! (அஸ்ர் தொழு கைக்குப் பின்னுள்ள அந்த) இரண்டு ரக்அத் தொழுகையை அல்லாஹ்வைச் சந்திக்கும்வரை நபி (ஸல்) அவர்கள் விட்டுவிடவில்லை. தொழுவதற்குச் சிரமப்படும் நிலையை அடைந்த பிறகே நபி (ஸல்) அவர்கள் அல்லாஹ்வைச் சந்தித்தார்கள். நபி (ஸல்) அவர்கள் பெரும்பாலும் -தாம் அஸ்ருக்குப் பின்னர் தொழும் அந்த இரண்டு ரக்அத்களை- அமர்ந்து கொண்டே தொழுவார்கள். நபி (ஸல்) அவர்கள் அந்த இரண்டு ரக்அத்களையும் தொழுவார்கள்; ஆனால், பள்ளிவாச-ல் அதைத் தொழமாட்டார்கள். தம் சமுதாயத் தாருக்குச் சிரமம் ஏற்படுத்துவதை அஞ்சி யதே இதற்குக் காரணம். தம் சமுதாயத் தாருக்கு எளிதானதையே அவர்கள் விரும்புவார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": 591,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்கள் (என்னிடம்), “என் சகோதரி (அஸ்மாவின்) மகனே! அஸ்ர் தொழுகைக்குப்பின் இரண்டு சஜ்தாக்கள் (ரக்அத்கள்) தொழுவதை என்னிடம் இருக்கும்போது நபி (ஸல்) அவர்கள் ஒருபோதும் கைவிட்டதில்லை” என்று சொன்னார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், இரண்டு தொழுகைகளை இரகசியமாகவும் விட்டதில்லை; பகிரங்கமாகவும் விட்டதில்லை. (அவை:) சுப்ஹு தொழுகைக்குமுன் இரண்டு ரக்அத்கள், அஸ்ர் தொழுகைக்குப்பின் இரண்டு ரக்அத்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": 593,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் அஸ்ர் தொழு கைக்குப்பின் எந்த நாளில் என்னிடம் (என் வீட்டிற்கு) வந்தாலும் அவர்கள் இரண்டு ரக்அத்கள் தொழாமல் இருந்த தில்லை.28 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "அபுல்மலீஹ் (ஆமிர் பின் உசாமா- ரஹ்) அவர்கள் கூறியதாவது: மேகமூட்டம் இருந்த ஒரு நாளில் புரைதா பின் அல்ஹஸீப் (ரலி) அவர்களுடன் (ஒரு போரில்) நாங்கள் இருந்தோம். அப்போது அவர்கள், “அஸ்ர் தொழுகையை விரைவாக (அதன் ஆரம்ப நேரத்திலேயே) நிறைவேற்றுங்கள். ஏனெனில், நபி (ஸல்) அவர்கள் ‘யார் அஸ்ர் தொழுகையை விட்டுவிடுகிறாரோ அவருடைய நற்செயல்கள் அழிந்துவிட்டன’ என்று கூறியுள்ளார்கள்” என்றார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": 595,
			"text": "அபூகத்தாதா (ஹாரிஸ் பின் ரிப்ஈ-ர-) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுடன் ஓர் இரவில் (பயணம்) சென்றுகொண்டிருந் தோம். அப்போது மக்களில் சிலர், “அல்லாஹ்வின் தூதரே! (பயணத்தை சற்று நிறுத்தி) எங்களை இளைப்பாறச் செய்ய லாமே!” என்று கேட்டனர். அதற்கு நபி (ஸல்) அவர்கள், “நீங்கள் (ஃபஜ்ர்) தொழாமல் உறங்கிவிடுவீர்களோ என நான் அஞ்சுகிறேன்” என்றார்கள். அப்போது பிலால் (ரலி) அவர்கள், “உங்களை நான் விழிக்கச்செய்கிறேன்” என்று கூறினார்கள். எனவே, அனைவரும் (பயனத்தை நிறுத்தி) படுத்துக்கொண்டனர். பிலால் (ரலி) அவர்கள் தமது முதுகைத் தமது வாகனத்தின் மீது சாய்த்துக்கொண்டி ருந்தபோது தம்மையும் மீறி கண்ணயர்ந்து உறங்கிவிட்டார்கள். சூரிய வட்டத்தின் ஒரு பகுதி உதித்துவிட்ட நிலையில், நபி (ஸல்) அவர்கள் (முதன் முத-ல்) உறக்கத்தி-ருந்து விழித்தார்கள். உடனே, “பிலால்! நீங்கள் சொன்னது என்ன ஆயிற்று?” என்று கேட்டார்கள். “இதுபோன்று உறக்கம் எனக்கு எப்போதும் ஏற்பட்டதில்லை” என்று பிலால் (ரலி) அவர்கள் கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ், தான் நாடும்போது உங்கள் உயிர்களைக் கைப்பற்றிக்கொள்கிறான்; தான் நாடும்போது உங்களிடம் திருப்பித் தருகின்றான்” என்று கூறிவிட்டு, “பிலால்! எழுந்து, பாங்கு சொல்- தொழுகைக்கு மக்களை அழைப்பீராக!” என்று கூறினார்கள். பின்னர் அங்கத் தூய்மை (உளூ) செய்து, சூரியன் உயர்ந்து தெளிவாகத் தென்பட்ட போது (ஃபஜ்ர்) தொழு(கையை முன்னின்று நடத்)திடலானார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": 596,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அகழ்ப் போரின்போது சூரியன் மறைந்தபின் உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் குறைஷி குல இறைமறுப் பாளர்களை ஏசிக்கொண்டே வந்து, “அல்லாஹ்வின் தூதரே! சூரியன் மறையத் தொடங்கும்வரை என்னால் அஸ்ர் தொழுகையைத் தொழ முடியாமல் போய் விட்டது” என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நானும் (இதுவரை) அஸ்ர் தொழவில்லை” என்று கூறினார்கள். பின்னர் ‘புத்ஹான்’ எனும் பள்ளத் தாக்கை நோக்கி நாங்கள் சென்றோம். அங்கு தொழுகைக்காக நபி (ஸல்) அவர்கள் அங்கத் தூய்மை (உளூ) செய்தார்கள். நாங்களும் தொழுகைக்காக அங்கத் தூய்மை (உளூ) செய்தோம். சூரியன் மறைந்தபிறகு அஸ்ர் தொழுதார்கள். அதன் பின்னர் மஃக்ரிப் தொழுதார்கள். (அவர்களுக்குப்பின் நின்று நாங்களும் தொழுதோம்). அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யாரேனும் ஒரு தொழுகையை(த் தொழ) மறந்துவிட்டால் அதன் நினைவு வந்ததும் அவர் அதைத் தொழட்டும்! இதைத் தவிர அதற்கு வேறு பரிகாரம் ஏதுமில்லை. (அல்லாஹ் கூறுகின்றான்:) என்னை நினைவுகூரும் பொருட்டு தொழு கையை நிலைநிறுத்துவீராக. (20:14)30 இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) ஹம்மாம் பின் யஹ்யா (ரஹ்) அவர்கள் கூறுகிறார்கள்: (மேற்கண்ட வசனத்தின் மூலத்திலுள்ள ‘வஅகிமிஸ் ஸலாத்த -திக்ரீ’ எனும் வாக்கியத்தை) கத்தாதா பின் திஆமா (ரஹ்) அவர்கள் மற்றொரு சந்தர்ப்பத்தில் ‘வ அகிமிஸ் ஸலாத்த -த்திக்ரா’ என்று ஓதக் கேட்டேன். (பொருள் ஒன்றே.) இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": 598,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: அகழ்ப் போரின்போது உமர் (ரலி) அவர்கள் (தங்களுடன் போரிட்ட குறைஷி) இறைமறுப்பாளர்களை ஏசிக் கொண்டே (வந்து), “சூரியன் மறையத் தொடங்கும்வரை என்னால் அஸ்ர் தொழுகையைத் தொழ முடியாமல் போய் விட்டது” என்று கூறினார்கள். எனவே, நாங்கள் ‘புத்ஹான்’ எனும் பள்ளத்தாக்கில் இறங்கினோம். சூரியன் மறைந்த பின்னர் (எங்களுக்கு இமாமாக நின்று) நபி (ஸல்) அவர்கள் (முத-ல் அஸ்ர் தொழுகை யைத்) தொழுதார்கள். பின்னர் மஃக்ரிப் தொழுகையைத் தொழு(வித்)தார்கள். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": 599,
			"text": "அபுல் மின்ஹால் (சய்யார் பின் சலாமா-ரஹ்) அவர்கள் கூறியதாவது: நானும் என் தந்தையும் அபூபர்ஸா அல்அஸ்லமீ (நள்லா பின் உபைத்-ர-) அவர்களிடம் சென்றோம். அப்போது அவர்களிடம் என் தந்தை, “கடமையான தொழுகைகளை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எவ்வாறு (எந்நேரத்தில்) தொழுவார்கள் என்று எங்களுக்கு அறிவியுங்கள்” எனக் கேட்டார்கள். அதற்கு அபூபர்ஸா (ரலி) அவர்கள் கூறினார்கள்: நீங்கள் ‘முதல் தொழுகை’ என்று அழைக்கும் நண்பகல் (லுஹ்ர்) தொழுகையைச் சூரியன் (நடுவானி-ருந்து மேற்கு நோக்கி) சாயும்போது நபி (ஸல்) அவர்கள் தொழுவார்கள். (பின்னர்) அஸ்ர் தொழுகையைத் தொழுவார்கள். எங்களில் ஒருவர் (அஸ்ர் தொழுகையைத் தொழுதுவிட்டு) மதீனா வின் கடைக் கோடியிலுள்ள தமது இல்லத்திற்குத் திரும்பிச் சென்றுவிடுவார். அப்போதும் சூரியன் (வெளிச்சமோ வெப்பமோ குறையாமல்) தெளிவாக இருந்துகொண்டிருக்கும். -மஃக்ரிப் தொழுகை(யின் நேரம்) பற்றி அபூபர்ஸா (ரலி) அவர்கள் (கூறினார்கள்; ஆனால், அவர்கள்) கூறியதை நான் மறந்துவிட்டேன்.- இஷா தொழுகையைப் பிற்படுத்து வதையே நபி (ஸல்) அவர்கள் விரும்பு வார்கள். இஷா தொழுகைக்குமுன் உறங்குவதையும் இஷா தொழுகைக்குப் பின் பேசிக்கொண்டிருப்பதையும் நபி (ஸல்) அவர்கள் வெறுப்பார்கள். எங்களில் ஒருவர் தம் அருகில் அமர்ந்திருப்பவரை அறிந்துகொள்ளும் (அளவுக்கு வெளிச்சம் வந்துவிடும்) நேரத்தில் வைகறைத் தொழுகை (சுப்ஹு தொழுகை)யை முடித்துத் திரும்புவார்கள். (வைகறைத் தொழுகையில்) அறுபது (வசனங்கள்) முதல் நூறு (வசனங்கள்)வரை ஓதுவார்கள்.31 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "குர்ரா பின் கா-த் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் (ஒரு நாள் இரவு) ஹசன் அல்பஸ்ரீ (ரஹ்) (அவர்களிடம் மார்க்கக் கல்வி பயில) அவர்களை எதிர்பார்த்துக் காத்துக்கொண்டிருந்தோம். அவர்கள் (வழக்கத்திற்கு மாறாக அன்று) எங்களிடம் தாமதமாக வந்தார்கள். எந்த அளவுக்கென்றால், (வழக்கமாக அவர்கள் எங்களுடன் அமர்ந்துவிட்டு) எழுந்து செல்லும் நேரமும் நெருங்கியது. அப்போது அவர்கள் வந்து, “எம்முடைய இந்த அண்டை வீட்டார் எம்மை அழைத்தனர் (அதனால் தாமதம் ஏற்பட்டுவிட்டது)” என்று கூறிவிட்டு (பின்வருமாறு) சொன்னார்கள்: அனஸ் (ரலி) அவர்கள் கூறினார்கள்: நாங்கள் ஒரு (நாள்) இரவில் (இஷா தொழுகைக்காக) நபி (ஸல்) அவர்களை எதிர்பார்த்துக் காத்துக்கொண்டிருந்தோம். நள்ளிரவு நேரம் ஆகும்போது நபி (ஸல்) அவர்கள் வந்து எங்களுக்கு இஷா தொழுகை நடத்தினார்கள். பின்னர் எங்களுக்கு உரையாற்றினார்கள். அப்போது அவர்கள், “அறிந்து கொள்ளுங்கள்: (உங்களைத் தவிர மற்ற) மக்கள் அனைவரும் தொழுதுவிட்டு உறங்கிவிட்டனர். நீங்கள் தொழுகையை எதிர்பார்த்துக் காத்துக்கொண்டிருக்கும்வரை அத்தொழுகையில் நீங்கள் உள்ளீர்கள் (என்றே கருதப்படும்)” என்று கூறினார்கள். தொடர்ந்து ஹசன் அல்பஸ்ரீ (ரஹ்) அவர்கள் கூறினார்கள்: ஒரு நன்மையை எதிர்பார்த்துக் காத்துக்கொண்டிருக்கும்வரை மக்கள் அந்த நன்மையிலேயே இருக்கிறார்கள். அறிவிப்பாளர் குர்ரா பின் கா-த் (ரஹ்) அவர்கள் கூறுகிறார்கள்: இ(ந்த இறுதி கூற்றான)து, நபி (ஸல்) அவர்களிடமிருந்து அனஸ் (ரலி) அவர்கள் அறிவித்த ஹதீஸில் உள்ளதாகும். அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தமது வாழ்நாளின் இறுதி நாட்களில் (ஒரு நாள்) இஷா தொழுகை நடத்தினார்கள். சலாம் கொடுத்(து தொழுகையை முடித்)ததும் எழுந்து நின்று, “இந்த இரவைப் பற்றி உங்களுக்குத் தெரியுமா? (இன்றிலிருந்து) நூறாம் ஆண்டின் துவக்கத்தில், இன்று பூமியில் இருக்கும் யாரும் எஞ்சியிருக்கமாட்டார் கள்” என்று கூறினார்கள். மக்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து அறிவிக்கும் ஹதீஸ் களில் நூறாண்டைப் பற்றிய இந்த ஹதீஸைத் தவறாகப் புரிந்து(கொண்டு, நூறு ஆண்டுகளுக்குப்பின் உலகம் அழிந்து விடும்போலும் என்று புரிந்து)கொண்டனர். நபி (ஸல்) அவர்கள் கூறியது, இன்று பூமியில் இருப்பவர்களில் யாரும் நூறு ஆண்டுகளுக்குப்பின் இருக்கமாட்டார்கள் என்ற பொருளில்தான்.32 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "அப்துர் ரஹ்மான் பின் அபீபக்ர் (ரலி) அவர்கள் கூறியதாவது: திண்ணைத் தோழர்கள் (அஸ்ஹாபுஸ் ஸுஃப்பா) ஏழை மக்களாக இருந்தார்கள். (ஒரு முறை) நபி (ஸல்) அவர்கள், “யாரிடம் இரண்டு பேருக்கான உணவு உள்ளதோ, அவர் மூன்றாமவ(ராக திண்ணைத் தோழர் ஒருவ)ரை(த் தம்முடன்) அழைத்துச் செல்லட்டும். நான்கு பேருக்குரிய உணவு (யாராவது ஒருவரிடம்) இருந்தால், (அவர் தம்முடன்) ஐந்தாமவரையும் (ஐந்து பேருக்குரிய உணவு இருந்தால்) ஆறாமவரையும் அழைத்துச் செல்லட்டும்” என்று கூறினார்கள். (என் தந்தை) அபூபக்ர் (ரலி) அவர்கள் (திண்ணைத் தோழர்கள்) மூவருடன் (இல்லத்திற்கு) வந்தார்கள். நபி (ஸல்) அவர்கள் பத்துப் பேருடன் (தம் இல்லம் நோக்கி) நடந்தார்கள். (என் தந்தை வீட்டுக்கு வந்தபோது வீட்டில்) நானும் (அப்துர் ரஹ்மான்), என் தந்தையும் (அபூபக்ர்), என் தாயும் (உம்மு ரூமான்), எங்கள் வீட்டுக்கும் (என் தந்தை) அபூபக்ர் (ரலி) அவர்களின் வீட்டுக்கும் கூட்டாகப் பணிபுரிந்துவந்த பணியாளரும் தான் இருந்தோம். -இதன் அறிவிப்பாளரான அபூ உஸ்மான் அந்நஹ்தீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: ‘என் மனைவியும்... (இருந்தார்)’ என அப்துர் ரஹ்மான் பின் அபீபக்ர் (ரலி) அவர்கள் கூறினார்களா என்பது எனக்கு (உறுதியாக)த் தெரியவில்லை (சந்தேகமாகவே இருக்கிறது). அபூபக்ர் (ரலி) அவர்கள் (விருந்தினருக்கு உணவளிக்குமாறு தம் வீட்டாரிடம் கூறிவிட்டு), நபி (ஸல்) அவர்களிடம் (சென்று) இரவு உணவு அருந்தினார்கள். பிறகு இஷா தொழுகை நடைபெறும்வரை அங்கேயே இருந்துவிட்டுப் பிறகு நபி (ஸல்) அவர்கள் இரவு உணவு அருந்தும்வரை காத்திருந்துவிட்டு, இரவில் அல்லாஹ் நாடிய ஒரு பகுதி கழிந்தபிறகு அபூபக்ர் (ரலி) அவர்கள் (தம் வீட்டுக்கு) வந்தார்கள். அவர்களுடைய துணைவியார் (என் தாயார்) அபூபக்ர் (ரலி) அவர்களிடம், “உங்கள் விருந்தாளிகளை’ அல்லது ‘உங்கள் விருந்தாளியை’ (உபசரிக்க வராமல்) தாமதமானதற்கு என்ன காரணம்?” என்று கேட்டார்கள். அபூபக்ர் (ரலி) அவர்கள், “விருந்தினருக்கு நீ உணவளிக்கவில்லையா?” என்று கேட்டார்கள். அதற்கு என் தாயார், “நீங்கள் வரும் வரை உண்ணமாட்டோம் என்று அவர்கள் மறுத்துவிட்டார்கள். அவர்களிடம் எடுத்துச்சொல்-யும் அவர்கள் (உண்ண) மறுத்துவிட்டார்கள்” என்று பதிலளித்தார்கள். (என் தந்தை அபூபக்ர் (ரலி) அவர்கள், நான் விருந்தாளிகளைச் சரியாகக் கவ னிக்கவில்லை என்று என்னைக் கண்டிப்பார்கள் என்று அஞ்சி) நான் சென்று ஒளிந்துகொண்டேன். அப்போது (என் தந்தை) அபூபக்ர் (ரலி) அவர்கள், ‘தடியா!’ (என்றழைத்து என்னை) ‘உன் மூக்கறுந்து போக!’ என்று கூறி ஏசினார்கள். (அவர்கள் உணவருந்த தாமதமான தற்கு அவர்களே காரணம் என்று அறிந்து கொண்டபோது) “மகிழ்ச்சியாக இல்லை; நீங்கள் உண்ணுங்கள்” என்று (தம் விருந்தி னரிடம்) கூறிவிட்டு, (தம் வீட்டாரை நோக்கி, “என்னை எதிர்பார்த்துத்தானே இவ்வளவு நேரம் தாமதம் செய்தீர்கள்!) அல்லாஹ்வின் மீதாணையாக! நான் ஒருபோதும் இதை உண்ணப் போவ தில்லை” என்று சொன்னார்கள். அல்லாஹ்வின் மீதாணையாக! நாங்கள் (பாத்திரத்தி-ருந்து) ஒரு கவள உணவை எடுக்கும்போதெல்லாம் அதன் கீழ்ப் பகுதியி-ருந்து அதைவிட அதிகமாக உணவு பெருகியது. இறுதியில் அவர்கள் அனைவரும் வயிறார உண்டனர். அப்போது அந்த உணவு முன்பிருந்ததைவிடக் கூடுதலாகிவிட்டிருந்தது. அபூபக்ர் (ரலி) அவர்கள் அ(ந்த பாத்திரத்)தைப் பார்த்தார்கள். அப்போது அது முன்பிருந்த அளவு, அல்லது அதைவிட அதிகமாகக் காணப்பட்டது. உடனே அபூபக்ர் (ரலி) அவர்கள் தம் துணைவியாரிடம் (என் தாயாரிடம்), “பனூ ஃபிராஸ் குலமகளே! என்ன இது?” என்று வினவ, அதற்கு என் தாயார், “எனது கண்குளிர்ச்சியின் மீதாணையாக! இது முன்பிருந்ததைவிட இப்போது மூன்று மடங்கு அதிகமாகிவிட்டிருக்கிறது” என்று சொன்னார்கள். அதி-ருந்து அபூபக்ர் (ரலி) அவர்களும் உண்டார்கள். மேலும், தமது சத்தியம் குறித்து, “(நான் ஒருபோதும் இதை உண்ணமாட்டேன் என்று என்னை சத்தியம் செய்ய வைத்தது) ஷைத்தான் தான்” என்று கூறிவிட்டு, அதி-ருந்து இன்னும் ஒரு கவளம் உண்டார்கள். பிறகு அ(ந்தப் பாத்திரத்)தை எடுத்துக்கொண்டு நபி (ஸல்) அவர்களிடம் சென்றார்கள். பிறகு அது நபி (ஸல்) அவர்களிடம் இருக்கலாயிற்று. (அப்போது) எங்களுக்கும் ஒரு சமுதாயத்திற்கும் இடையே சமாதான ஒப்பந்தம் இருந்துவந்தது. அந்த ஒப்பந்த தவணை முடிவுற்றது. (இனி அவர்கள் போருக்கு வந்தால், அவர்களை எதிர் கொள்வதற்காக) நபி (ஸல்) அவர்கள் எங்களைப் பன்னிரண்டு பேராகப் பிரித்து ஒவ்வொருவரிடமும் சில படை வீரர்களை ஒப்படைத்தார்கள். ஒவ்வொருவருடனும் எத்தனை பேர் இருந்தனர் என்பதை அல்லாஹ்வே அறிவான். (அவ்வளவு பெரிய படையினருடன் அந்த உணவுப் பாத்திரத்தையும் கொடுத்தனுப்பினார்கள்.) அவர்கள் அனைவரும் அதிலிருந்து உண்டனர். (இவ்வாறோ அல்லது) வேறொரு முறையிலோ இதை அப்துர் ரஹ்மான் பின் அபீபக்ர் (ரலி) அவர்கள் அறிவித்தார்கள் என அறிவிப்பாளர் அபூஉஸ்மான் (ரஹ்) அவர்கள் கூறினார்கள்.33 அத்தியாயம் : 9",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		}
	]
}