{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7048,
			"arabicnumber": 7048,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: நான் (மறுமை நாளில் ‘அல்கவ்ஸர்’ எனும்) எனது தடாகத்தின் அருகே இருந்தவாறு என்னிடம் வருகின்றவர் களை எதிர்பார்த்துக் காத்திருப்பேன். அப்போது என்னை நெருங்க விடாமல் சிலர் பிடிக்கப்படுவார்கள். அப்போது நான், “(இவர்கள்) என் சமுதாயத்தார்” என்பேன். அதற்கு “உங்களுக்குத் தெரியாது. (நீங்கள் உலகைவிட்டுப் பிரிந்த பின்னால்) இவர்கள் வந்த வழியே அப்படியே திரும்பிச் சென்றுவிட்டார் கள்” என்று கூறப்படும். இதை அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான இப்னு அபீமுளைக்கா (ரஹ்) அவர்கள், “அல்லாஹ்வே! நாங்கள் (வந்த வழியே) எங்கள் குதிகால்கள்மீது திரும்பிச் செல்வதிலிருந்தும், நாங்கள் குழப்பத்தில் ஆழ்த்தப்படுவதிலிருந்தும் உன்னிடம் பாதுகாப்புக் கோருகிறோம்” என்று பிரார்த்திப்பார்கள்.3 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7049,
			"arabicnumber": 7049,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நான் உங்களுக்கு முன்பே (மறுமை நாளில் ‘அல்கவ்ஸர்’) தடாகத்திற்குச் சென்று (நீர் புகட்டக்) காத்திருப்பேன். அப்போது உங்களில் சிலர் என்னிடம் கொண்டுவரப்படுவார்கள். நான் அவர்களுக்கு (தடாகத்திலிருந்து தண்ணீர்) வழங்க முற்படும்போது அவர்கள் என்னிடமிருந்து விலக்கிவைக்கப்படுவார்கள். உடனே நான், “என் இறைவா! இவர்கள் என் தோழர்கள்” என்று கூறுவேன். அதற்கு அல்லாஹ், “இவர்கள் உமக்குப் பின்னால் (புதிது புதிதாக) என்னென்ன (குழப்பங்களை) உருவாக்கினார்கள் என்று உமக்குத் தெரியாது” என்று கூறுவான். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.4 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7050,
			"arabicnumber": 7050,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நான் (மறுமை நாளில்) உங்களுக்கு முன்பே (‘அல்கவ்ஸர்’) தடாகத்திற்குச் சென்று (நீர் புகட்டக்) காத்திருப்பேன். அங்கு யாருக்கு வர முடிகிறதோ அவர் அதை அருந்துவார். யார் அதை அருந்துகிறாரோ அவருக்கு அதன் பிறகு ஒருபோதும் தாகமே ஏற்படாது. (இந்நிலையில்) என்னிடம் சிலர் வரு வார்கள். அவர்களை நான் அறிவேன்; அவர்களும் என்னை அறிந்துகொள் வார்கள். பிறகு எனக்கும் அவர்களுக்கும் இடையே தடுப்பு ஏற்படுத்தப்படும். இதை சஹ்ல் பின் சஅத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். (அறிவிப் பாளர்களில் ஒருவரான) அபூஹாஸிம் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் இந்த ஹதீஸை மக்களுக்கு அறிவித்துக்கொண்டிருந்தபோது நுஅமான் பின் அபீஅய்யாஷ் (ரஹ்) அவர்கள் கேட்டுக்கொண்டிருந்தார்கள். பிறகு, “நீங்கள் இவ்வாறுதான் சஹ்ல் (ரலி) அவர்களிடமிருந்து செவியுற்றீர்களா?” என்று வினவினார்கள். நான், “ஆம்” என்று சொன்னேன். அதற்கு அவர்கள், “அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் இதை அறிவித்ததற்கு நான் சாட்சி. அவர்கள் தமது அறிவிப்பில் கூடுதலாக (பின்வருமாறு) குறிப்பிட்டார்கள்: “அவர்கள் என்னைச் சார்ந்தவர்கள்தான்” என்று நபியவர்கள் கூறியதற்கு, “உங்களுக்குப் பிறகு என்னவெல்லாம் புதிதாக உண்டாக்கினார்கள் என்று உங்களுக்குத் தெரியாது” என்று சொல்லப்படும். உடனே நான், “எனக்குப் பிறகு (தமது மார்க்கத்தை) மாற்றிவிட்டவர்களை இறைவன் தன் கருணையிóருந்து அப்புறப்படுத்துவானாக! அப்புறப்படுத்து வானாக!” என்று சொல்வேன்.5 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7051,
			"arabicnumber": 7051,
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7052,
			"arabicnumber": 7052,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அன்சாரிகளான) எங்களிடம், “எனக்குப் பிறகு (ஆட்சியதிகாரத்தில் உங்களைவிடப் பிறருக்கு) முன்னுரிமை வழங்கப்படுவதையும், நீங்கள் வெறுக்கின்ற சில விஷயங்களையும் பார்ப்பீர்கள்” என்று சொன்னார்கள். மக்கள், “அப்போது நாங்கள் என்ன செய்ய வேண்டும் என்று தாங்கள் கட்டளையிடுகிறீர்கள், அல்லாஹ்வின் தூதரே?” என்று கேட்க, நபி (ஸல்) அவர்கள், “(ஆட்சியாளர்களான) அவர்களுக்கு அவர்களது உரிமையை வழங்கிவிடுங்கள்; உங்கள் உரிமையை அல்லாஹ்விடம் கேளுங்கள்” என்று சொன்னார்கள்.7 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7053,
			"arabicnumber": 7053,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: தம் (ஆட்சித்) தலைவரிடமிருந்து (மார்க்க விஷயத்தில் குறை) எதையேனும் (கண்டு அதை) வெறுப்பவர் பொறுமையாக இருக்கட்டும். ஏனெனில், ஆட்சியாள (ருக்குக் கட்டுப்படாமல் அவ)ரிடமிருந்து யார் ஒரு சாண் அளவு வெளியேறுகிறாரோ அவர் அஞ்ஞான கால மரணத்தை அடைவார். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7054,
			"arabicnumber": 7054,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: எவர் தம் (ஆட்சித்) தலைவரிட மிருந்து (மார்க்க விஷயத்தில்) தமக்குப் பிடிக்காத (குறை) ஒன்றைக் காண்கிறாரோ அவர் அதைப் பொறுத்துக்கொள்ளட்டும்! ஏனெனில், ஒருவர் (இஸ்லாமியக்) கட்டமைப்பிலிருந்து பிரிந்து, (அதே நிலையில்) இறந்துவிட்டால் அஞ்ஞான கால மரணத்தையே அவர் சந்திப்பார். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7056,
			"arabicnumber": 7056,
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7057,
			"arabicnumber": 7057,
			"text": "உசைத் பின் ஹுளைர் (ரலி) அவர்கள் கூறியதாவது: (அன்சாரிகளில்) ஒருவர் நபி (ஸல்) அவர்களிடம் வந்து, “இன்னாரை நீங்கள் அதிகாரியாக நியமித்தீர்கள்; என்னை நீங்கள் அதிகாரியாக நியமிக்கவில்லையே?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “எனக்குப் பிறகு (உங்களைவிட) மற்றவர்களுக்கு (ஆட்சியதிகாரத்தில்) முன்னுரிமை அளிக்கப்படுவதை நீங்கள் காண்பீர்கள். ஆகவே, (மறுமையில்) என்னைச் சந்திக்கும்வரை நீங்கள் பொறுத்திருங்கள்” என்று சொன்னார்கள்.8 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7058,
			"arabicnumber": 7058,
			"text": "சயீத் பின் அம்ர் பின் சயீத் அல்உமவீ (ரஹ்) அவர்கள் கூறியதாவது: நான் மதீனாவில் நபி (ஸல்) அவர் களின் பள்ளிவாசலில் அபூஹுரைரா (ரலி) அவர்களுடன் அமர்ந்திருந்தேன். அப்போது எங்களுடன் மர்வான் பின் அல்ஹகமும் இருந்தார். அபூஹுரைரா (ரலி) அவர்கள், “உண்மையாளரும் உண்மையே அறிவிக்கப்பட்டவருமான நபி (ஸல்) அவர்கள், ‘என் சமுதாயத்தாரின் அழிவு குறைஷி இளைஞர்களின் கரங்களில்தான் உள்ளது’ என்று சொல்ல நான் கேட்டேன்” என்றார்கள். அப்போது மர்வான், “இந்த இளைஞர்களின் மீது அல்லாஹ்வின் சாபம் உண்டாகட்டும்” என்று சொன்னார். உடனே அபூஹுரைரா (ரலி) அவர்கள், “நான் நினைத்தால் (அந்த இளைஞர்கள்) இன்னாரின் மக்கள், இன்னாரின் மக்கள் என்று (குறிப்பிட்டுச்) சொல்ல முடியும்” என்று கூறினார்கள். (அறிவிப்பாளர்களில் ஒருவரான அம்ர் பின் யஹ்யா (ரஹ்) அவர்கள் கூறினார்கள்:) நான் என் பாட்டனார் சயீத் பின் அம்ர் பின் சயீத் அல்உமவீ (ரஹ்) அவர்களுடன் ‘பனூ மர்வான்’ குலத்தாரிடம் அவர்கள் ஷாம் (சிரியா) நாட்டிற்கு அதிபர்களான வேளையில் சென்றிருந்தேன். அவர்கள் இளம் வாலிபர்களாக இருப்பதைப் பார்த்துவிட்டு எங்களிடம், “இவர்கள் (அபூஹுரைரா (ரலி) அவர்கள் குறிப்பிட்ட) அந்த இளைஞர்களாக இருக்கலாம்” என்று என் பாட்டனார் கூறினார்கள். நாங்கள், “நீங்கள்தான் (இது பற்றி எங்களைவிட) அதிகமாக அறிந்தவர்கள்” என்று கூறினோம்.9 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7059,
			"arabicnumber": 7059,
			"text": "ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்கள் கூறியதாவது: (ஒருநாள்) நபி (ஸல்) அவர்கள் தூக்கத்திலிருந்து முகம் சிவந்த நிலையில் (பின்வருமாறு) கூறியபடியே எழுந்தார்கள்: அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை. நெருங்கிவிட்ட ஒரு தீமையின் காரணமாக அரபியருக்குக் கேடுதான். இன்று யஃஜூஜ், மஃஜூஜ் கூட்டத்தாரின் தடுப்புச் சுவரிலிருந்து இந்த அளவுக்குத் திறக்கப்பட்டுள்ளது. -அறிவிப்பாளர் சுஃப்யான் (ரஹ்) அவர்கள் (‘இந்த அளவுக்கு’ என்று கூறியபோது, தமது கை விரல்களால் அரபி எண் வடிவில்) 90 அல்லது 100 என்று மடித்துக் காட்டினார்கள்.- அப்போது “நல்லவர்கள் நம்மிடையே இருக்கும்போதுமா நமக்கு அழிவு ஏற்படும்?” என்று வினவப்பட்டது. அதற்கு நபி (ஸல்) அவர்கள் “ஆம். தீமை பெருத்துவிட்டால்” என்று பதிலளித்தார்கள்.10 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7060,
			"arabicnumber": 7060,
			"text": "உசாமா பின் ஸைத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவின் கோட்டைகளில் ஒன்றின் மீது ஏறிக் கொண்டு (நோட்டமிட்டவாறு), “நான் பார்க் கின்றவற்றை நீங்கள் பார்க்கிறீர்களா?” என்று கேட்க மக்கள், “இல்லை” என்று பதிலளித்தார்கள். நபி (ஸல்) அவர்கள், “நான் மழைத்துளிகள் விழுவதைப் போன்று உங்கள் வீடுகள் நெடுகிலும் குழப்பங்கள் விளையப்போவதைப் பார்க்கின்றேன்” என்று சொன்னார்கள்.11 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7061,
			"arabicnumber": 7061,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், “(மறுமை நாள் நெருங்கும்போது) காலம் சுருங்கிவிடும்; செயல்பாடு (அமல்) குறைந்து போய் விடும்; மக்களின் உள்ளங்களில் (பேராசையின் விளைவாக) கருமித்தனம் உருவாக்கப்பட்டுவிடும். குழப்பங்கள் தோன்றும். ‘ஹர்ஜ்’ பெருகிவிடும்” என்று கூறினார்கள். மக்கள், “அல்லாஹ்வின் தூதரே! அது என்ன (ஹர்ஜ்)?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “கொலை, கொலை” என்று பதிலளித்தார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7063,
			"arabicnumber": 7063,
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7064,
			"arabicnumber": 7064,
			"text": "அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: (ஒருமுறை) அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களும் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களும் அமர்ந்து பேசிக்கொண்டிருந்தார்கள். அப்போது அபூமூசா (ரலி) அவர்கள், “மறுமை நாளுக்கு முன்பு ஒரு காலகட்டம் வரும். அப்போது கல்வி அகற்றப்பட்டுவிடும்; அறியாமை நிலவும்; ‘ஹர்ஜ்’ பெருகிவிடும். ‘ஹர்ஜ்’ என்பது கொலையாகும் என்று நபி (ஸல்) அவர்கள் கூறினார்கள்” எனத் தெரிவித்தார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7065,
			"arabicnumber": 7065,
			"text": "அபூவாயில் (ரஹ்) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி), அபூமூசா (ரலி) ஆகியோருடன் அமர்ந்திருந்தேன். அப்போது அபூமூசா (ரலி) அவர்கள், “நான் நபி (ஸல்) அவர்கள் இவ்வாறு சொல்லக் கேட்டேன். மேலும், ‘ஹர்ஜ்’ எனும் சொல்லுக்கு அபிசீனிய மொழியில் ‘கொலை’ என்பது பொருள்” எனக் கூறினார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7066,
			"arabicnumber": 7066,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளுக்கு முன்பாகக் கொலைகள் மலிந்த ஒரு காலகட்டம் வரும். அப்போது கல்வி மறைந்துபோய் அறியாமை வெளிப்படும். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அபூமூசா (ரலி) அவர்கள், “ ‘ஹர்ஜ்’ என்பது அபீசீனிய மொழியில் கொலை யைக் குறிக்கும்” என்று கூறுகிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7067,
			"arabicnumber": 7067,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம், “கொலைகள் மலிந்த காலம் வரும் என்று மேற்கண்டவாறு நபி (ஸல்) அவர்கள் கூறிய காலத்தை நீங்கள் அறிவீர்கள்” என்றேன். அப்போது அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் (கூடுதலாகப் பின்வருமாறு) சொன்னார்கள்: யார் உயிரோடு இருக்கும்போது அவர்களை மறுமை நாள் வந்தடைகிறதோ அவர்கள்தான் மக்களிலேயே தீயோர் ஆவர் என நபி (ஸல்) அவர்கள் சொல்ல நான் கேட்டிருக்கிறேன். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7068,
			"arabicnumber": 7068,
			"text": "ஸுபைர் பின் அதீ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம் சென்று (ஆளுநர்) ஹஜ்ஜாஜ் மூலம் நாங்கள் அனுபவித்து வரும் கொடுமைகள் குறித்து முறையிட் டோம். அதற்கு அவர்கள், “நீங்கள் உங்கள் இறைவனைச் சந்திக்கும்வரை பொறுமையோடு இருங்கள். ஏனெனில், உங்களிடம் ஒரு காலம் வந்தால், அதற்குப் பின்வரும் காலம் அதைவிட மோசமானதாகவே இருக்கும்” என்று கூறிவிட்டு, “இதை நான் உங்கள் நபி (ஸல்) அவர்களிடமிருந்து செவியுற் றேன்” என்று சொன்னார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7069,
			"arabicnumber": 7069,
			"text": "நபி (ஸல்) அவர்களின் துணைவி யார் உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: ஒரு(நாள்) இரவில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (திடீரென) பதற்றத் துடன் விழித்தெழுந்து, “அல்லாஹ் தூயவன்! (இன்றிரவு) அல்லாஹ் இறக்கிவைத்த கருவூலங்கள்தான் என்ன! (இன்றிரவு) இறக்கிவைக்கப்பட்ட குழப்பங்கள்தான் என்ன! -தம் துணைவியரை மனத்தில் கொண்டு- இந்த அறைகளிலுள்ள பெண்களை எழுப்பிவிடுகின்றவர் யார்? அவர்கள் (அல்லாஹ்வைத்) தொழட்டும்! ஏனெனில், இவ்வுலகில் உடையணிந்திருக்கும் எத்தனையோ பெண்கள் மறுவுலகில் நிர்வாணிகளாய் இருப்பார்கள்” என்று கூறினார்கள்.13 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7070,
			"arabicnumber": 7070,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நமக்கெதிராக ஆயுதம் ஏந்தியவர் நம்மைச் சார்ந்தவர் அல்லர். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7071,
			"arabicnumber": 7071,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: நமக்கெதிராக ஆயுதம் ஏந்தியவர் நம்மைச் சார்ந்தவர் அல்லர். இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7072,
			"arabicnumber": 7072,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நீங்கள் உங்கள் சகோதரரை நோக்கி ஆயுதத்தைக் காட்டி சைகை செய்ய வேண்டாம். ஏனெனில், உங்களுக்குத் தெரியாமலேயே ஷைத்தான் உங்கள் கையிலிருந்து அதைப் பிடுங்கி (சகோதரர் மீது தாக்குதல் நடத்தி)விடக்கூடும். அதனால் நீங்கள் நரகத்தில் வீழ்ந்து விடக்கூடும்.15 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள் அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7073,
			"arabicnumber": 7073,
			"text": "சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறியதாவது: நான் அம்ர் பின் தீனார் (ரஹ்) அவர்களிடம், “அபூமுஹம்மதே! (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலில் ஒருவர் அம்பு களுடன் நடந்துசென்றார்; அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ‘அம்புகளின் முனைகளைப் பிடித்து (மறைத்து)க்கொள்’ என்று அவரிடம் கூறினார்கள் என ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் சொல்ல நீங்கள் கேட்டீர்களா?” என்று வினவினேன். அதற்கு அம்ர் (ரஹ்) அவர்கள் ‘ஆம்’ என்று பதிலளித்தார்கள்.16 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7074,
			"arabicnumber": 7074,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: ஒருவர் பள்ளிவாசலில் அம்புகள் சிலவற்றை அவற்றின் முனைகள் வெளியே தெரியுமாறு எடுத்துச் சென்றார். நபி (ஸல்) அவர்கள் அவற்றின் முனைகளைப் பிடித்து (மறைத்து)க்கொண்டு எந்த முஸ்லிமையும் கீறிவிடாதபடி செல்லுமாறு அவருக்குக் கட்டளையிட்டார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7075,
			"arabicnumber": 7075,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தம்முடன் அம்பை எடுத்துக்கொண்டு நமது பள்ளிவாசலில், அல்லது நமது கடைவீதியில் நடந்து சென்றால், அவர் ‘அவற்றின் முனைகளை (மறைத்து)ப் பிடித்துக்கொள்ளட்டும்’. அல்லது ‘தமது கைக்குள் (அதன் முனையை) மூடிவைத்துக்கொள்ளட்டும்’. அவற்றில் எதுவும் முஸ்லிம்களில் யாரையும் கீறிவிடக் கூடாது. இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7076,
			"arabicnumber": 7076,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிமை ஏசுவது பாவச் செயலாகும். அவனுடன் போரிடுவது (அல்லது கொலை செய்வது) இறைமறுப்பு (போன்ற குற்றச்செயல்) ஆகும். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.17 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7077,
			"arabicnumber": 7077,
			"text": "நபி (ஸல்) அவர்கள் (‘விடைபெறும்’ ஹஜ்ஜின்போது) கூறினார்கள்: எனக்குப் பின்னால் உங்களில் ஒருவர் மற்றவரின் பிடரியை வெட்டிக்கொள்ளும் இறைமறுப்பாளர்களாய் மாறிவிடாதீர்கள். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.18 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7078,
			"arabicnumber": 7078,
			"text": "அபூபக்ரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (துல்ஹிஜ்ஜா பத்தாம் நாளில் மக்காவில்) மக்களுக்கு உரை நிகழ்த்தினார்கள். அப்போது “இது எந்த நாள் என்பது உங்களுக்குத் தெரியாதா?” என்று கேட்டார்கள். மக்கள் “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கு அறிந்தவர் கள்” என்று கூறினார்கள். அந்த நாளுக்கு அவர்கள் வேறு பெயர் சூட்டுவார்களோ என்று நாங்கள் எண்ணினோம். (அந்த அளவுக்கு மௌனமாக இருந்தார்கள்.) பிறகு “இது நஹ்ர் உடைய (துல்ஹிஜ்ஜா 10ஆம்) நாள் அல்லவா?” என்று கேட்டார்கள். நாங்கள் “ஆம், அல்லாஹ்வின் தூதரே” என்று சொன்னோம். நபியவர்கள், “இது எந்த ஊர்? இது புனித நகரமல்லவா?” என்று கேட்டார்கள். நாங்கள் “ஆம், அல்லாஹ்வின் தூதரே!” என்று சொன்னோம். நபி (ஸல்) அவர்கள், “அவ்வாறாயின், (புனிதம் வாய்ந்த) உங்களது இந்த நகரத்தில் உங்களுடைய (புனிதமான) இந்த மாதத்தில் இந்த நாள் எவ்வளவு புனிதமானதோ அந்த அளவுக்கு உங்கள் உயிர்களும் உங்கள் செல்வங்களும் உங்களது மானமும் உங்கள் உடல்களும் உங்களுக்குப் புனிதமானவையே” என்று கூறிவிட்டு, “(நான் வாழ்ந்த இதுகாலம்வரை உங்களிடம் இறைச்செய்திகள் அனைத்தையும்) தெரிவித்துவிட்டேனா?” எனக் கேட்டார்கள். நாங்கள், “ஆம் (தெரிவித்துவிட்டீர்கள்)” என்று பதிலளித்தோம். பிறகு நபி (ஸல்) அவர்கள் “இறைவா! நீயே சாட்சி!” என்று சொன்னார்கள். பிறகு (மக்களிடம்), “இங்கு வந்திருப் பவர்கள் வராதவர்களுக்கு அறிவித்து விடுங்கள். ஏனெனில், இச்செய்தியை(ப் பிறருக்கு)த் தெரிவிப்பவர்களில் எத்தனையோ பேர், தம்மைவிட அதை நன்கு நினைவிலிருத்திக்கொள்பவரிடம் தெரிவிக்கலாம்” என்று கூறினார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான முஹம்மத் பின் சீரீன் (ரஹ்) அவர்கள் கூறுகிறார்கள்:) நபி (ஸல்) அவர்கள் கூறியபடியே நடந்தது. (நினைவாற்றல் குறைந்தவர்கள் தம்மைவிடச் சிறந்த நினைவாற்றல் உள்ளோரிடம் அவற்றைத் தெரிவித்தார்கள்.) மேலும், நபி (ஸல்) அவர்கள், “எனக்குப் பின்னால் ஒருவரையொருவர் பிடரியில் வெட்டி மாய்த்துக்கொள்ளும் இறைமறுப்பாளர்களாய் நீங்கள் மாறிவிட வேண்டாம்” என்றும் (அன்றைய உரையில்) குறிப்பிட்டார்கள்.19 அப்துல்லாஹ் பின் அம்ர் பின் அல்ஹள்ரமீ (ரஹ்) அவர்கள் ஜாரியா பின் குதாமா என்பவரால் (உயிருடன்) கொளுத்தப்பட்ட நாளில் (ஜாரியா தம் ஆட்களிடம்), “அபூபக்ரா (ரலி) அவர்களை ஏறிப்பாருங்கள் (அவர் நமக்கு ஆதரவாளரா என்பதைக் கண்டுவாருங்கள்)” என்றார். அப்போது மக்கள், “இதோ அபூபக்ரா (ரலி) அவர்கள் உம்மைப் பார்த்துக்கொண்டிருக்கிறார்கள்” என்று கூறினர். அப்துர் ரஹ்மான் பின் அபீபக்ரா (ரஹ்) அவர்கள் கூறுகிறார்கள்: (என் தந்தை) அபூபக்ரா (ரலி) அவர்கள், “மக்கள் என்னிடம் (என்னைத் தாக்க) வந்தால் அப்போது (நான் அவர்களைத் தடுக்க) ஒரு மூங்கில் குச்சியைக்கூட எடுக்கமாட்டேன்” என்று சொன்னார்கள் என என் தாயார் என்னிடம் தெரிவித்தார்கள்.20 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7079,
			"arabicnumber": 7079,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: எனக்குப் பின்னர், உங்களில் ஒருவர் மற்றவரின் பிடரியை வெட்டிக்கொள்ளும் இறைமறுப்பாளர்களாய் மாறிவிடாதீர்கள். இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7080,
			"arabicnumber": 7080,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: ‘விடைபெறும்’ ஹஜ்ஜின்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “மக்களை மௌனம்காக்கச் சொல்லுங் கள்” என்று சொல்லிவிட்டு (மக்கள் மௌனமான) பின்னர், “எனக்குப் பின்னால் உங்களில் ஒருவர் மற்றவரின் பிடரியை வெட்டிக்கொள்ளும் இறைமறுப் பாளர்களாய் மாறிவிடாதீர்கள்” என்று சொன்னார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7081,
			"arabicnumber": 7081,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: விரைவில் குழப்பங்கள் சில தோன்றும். அப்போது அவற்றுக்கிடையே (மௌனமாக) அமர்ந்திருப்பவன் (அவற் றுக்காக) எழுந்து நிற்பவனைவிடவும், அவற்றுக்கிடையே எழுந்து நிற்பவன் நடப்பவனைவிடவும், அவற்றுக்கிடையே நடப்பவன் (அவற்றை நோக்கி) ஓடுபவனைவிடவும் சிறந்தவன் ஆவான். யார் அதில் தம்மை ஈடுபடுத்திக்கொள் கிறாரோ அவரை அவை அழிக்க முற்ப டும். அப்போது யார் ஒரு புகலிடத்தையோ காப்பிடத்தையோ பெறுகின்றாரோ அவர் அதன் வாயிலாகத் தம்மைத் தற்காத்துக்கொள்ளட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.21 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7082,
			"arabicnumber": 7082,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: விரைவில் சில குழப்பங்கள் தோன்றும். அவற்றுக்கிடையே (மௌனமாக) அமர்ந்திருப்பவன் (அவற்றை நோக்கி) எழுந்து நிற்பவனைவிடச் சிறந்தவன் ஆவான். எழுந்து நிற்பவன் (அவற்றை நோக்கி) நடப்பவனைவிடச் சிறந்தவன் ஆவான். அவற்றுக்கிடையே நடப்பவன் (அவற்றை நோக்கி) ஓடுபவனைவிடச் சிறந்தவன் ஆவான். அதில் யார் தம்மை ஈடுபடுத்திக்கொள்கிறாரோ அவரை அவை அழிக்க முற்படும். அப்போது ஒரு புகலிடத்தையோ காப்பிடத்தையோ யார் பெறுகின்றாரோ அவர் அதன் வாயிலாகத் தம்மைத் தற்காத்துக்கொள்ளட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7083,
			"arabicnumber": 7083,
			"text": "ஹசன் அல்பளி (ரஹ்) அவர்கள் கூறியதாவது: அலீ (ரலி) அவர்களது காலத்தில் உள்நாட்டு அரசியல் குழப்பம் தோன்றிய காலகட்டத்தில் நான் எனது ஆயுதத்தை எடுத்துக்கொண்டு புறப்பட்டேன். அப்போது என்னை அபூபக்ரா (ரலி) அவர்கள் எதிர்கொண்டு “எங்கே செல்கிறீர்கள்?” என்று கேட்டார்கள். நான், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய தந்தையின் சகோதரர் மகன் (அலீ-ரலி) அவர்களுக்கு உதவிட விரும்புகின்றேன்” என்று கூறினேன். அதற்கு அவர்கள் (பின்வருமாறு) கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இரண்டு முஸ்லிம்கள் தம் வாட்களால் ஒருவரையொருவர் எதிர் கொண்டால் (சண்டையிட்டு மடிந்தால்) அவர்கள் இருவருமே நரகவாசிகள்” ஆவர் என்று சொன்னார்கள். அப்போது (அவர்களிடம்), “இவர் கொலைகாரர்; (தண்டனை பெறுவது சரிதான்.) ஆனால், கொல்லப்பட்டவரின் நிலை என்ன? (அவர் எப்படி நரகவாசி யாவார்?)” என்று கேட்கப்பட்டது. நபி (ஸல்) அவர்கள், “கொல்லப்பட்ட வரும் தம் தோழரைக் கொல்ல வேண்டும் என்ற எண்ணத்துடன்தான் இருந்தார்” என்று பதிலளித்தார்கள். இந்த ஹதீஸ் பதினோரு அறிவிப் பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் :",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7084,
			"arabicnumber": 7084,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் மக்கள் நன்மையைப் பற்றிக் கேட்டுக்கொண்டிருந்தார்கள். நான் நபியவர்களிடம் தீமையைப் பற்றிக் கேட்டுக்கொண்டிருந்தேன். அது என்னைத் தீண்டிவிடுமோ என்று அஞ்சி யதே காரணம். நான், “அல்லாஹ்வின் தூதரே! நாங்கள் அறியாமைக் கால மாச்சரியத்திலும் தீமையிலும் மூழ்கிக் கிடந்தோம். அப்போது அல்லாஹ் (இஸ்லாம் எனும்) இந்த நன்மையை எங்களிடம் கொண்டுவந்தான். இந்த நன்மைக்குப் பிறகு ஒரு தீமை (குழப்பம்) இருக்கின்றதா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “ஆம் (இருக்கின்றது)” என்று பதிலளித்தார்கள். நான், “அந்தத் தீமைக்குப் பிறகு நன்மை ஏதும் இருக்கின்றதா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “ஆம். ஆனால், அதில் சற்று கலங்கலான நிலை (குழப்பம்) இருக்கும்” என்று பதிலளிக்க நான், “அந்தக் கலங்கலான நிலை என்ன?” என்று கேட்டேன். அதற்கு அவர்கள், “ஒரு கூட்டத்தார் எனது நேர்வழியல்லாத ஒன்றைக்கொண்டு பிறருக்கு வழிகாட்டுவார்கள். அவர்களில் நன்மையையும் நீ காண்பாய்; தீமையையும் நீ காண்பாய்” என்று பதிலளித்தார்கள். நான், “அந்த நன்மைக்குப் பிறகு ஒரு தீமை உண்டா?” என்று கேட்டேன். அதற்கு அவர்கள், “ஆம்; நரகத்தின் வாயில்களுக்கு (வருமாறு) அழைப்பவர்கள் சிலர் தோன்றுவார்கள். அவர்களின் அழைப்பை ஏற்பவனை நரகத்தில் அவர்கள் எறிந்துவிடுவார்கள்” என்று பதிலளித்தார்கள். நான், “அல்லாஹ்வின் தூதரே! அவர்க(ளுடைய அடையாளங்க)ளை எங்களுக்குத் தெரிவியுங்கள்” என்று கேட்க, நபி (ஸல்) அவர்கள், “அவர்கள் நம் இனத்தைச் சேர்ந்தவர்களாகவே இருப்பார்கள்; நம் மொழிகளையே பேசுவார்கள்” என்று பதிலளித்தார்கள். நான், “இந்த (மனிதர்களைச் சந்திக்கும்) நிலையை அடைந்தால் என்ன (செய்ய வேண்டுமென்று) எனக்குக் கட்டளையிடுகின்றீர்கள்?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “நீ முஸ்லிம்களின் ஜமாஅத்தை (கூட்டமைப்பை)யும் அவர்களுடைய தலைவரையும் (இறுகப்) பற்றிக்கொள்” என்று பதிலளித்தார்கள். அதற்கு நான், “அவர்களுக்கு ஒரு கூட்டமைப்போ ஒரு தலைவரோ இல்லை (பல பிரிவுகளாகப் பிரிந்து கிடக்கிறார்கள்) என்றால் (என்ன செய்வது)?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “அந்தப் பிரிவுகள் அனைத்தையும்விட்டு (விலகி) ஒதுங்கிவிடு; ஒரு மரத்தின் வேர் பாகத்தை பற்களால் நீ கவ்விப்பிடித்திருக்க நேர்ந்து, அதே நிலையில் மரணம் உன்னைத் தழுவிக்கொண்டாலும் சரி (எந்தப் பிரிவினரோடும் சேர்ந்துவிடாதே)” என்று பதிலளித்தார்கள்.22 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7085,
			"arabicnumber": 7085,
			"text": "அபுல்அஸ்வத் முஹம்மத் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: மதீனாவாசிகள் ஒரு படைப் பிரிவை அனுப்பிட வேண்டும் எனக் கட்டாயப் படுத்தப்பட்டனர். அதில் என் பெயரும் பதிவு செய்யப்பட்டது. அப்போது நான் (இப்னு அப்பாஸ் (ரலி) அவர்களின் முன்னாள் அடிமையான) இக்ரிமா (ரஹ்) அவர்களைச் சந்தித்தேன். அவர்களிடம் இது குறித்துத் தெரிவித்தேன். அவர்கள் என்னை வன்மையாகத் தடுத்தார்கள். பிறகு தமக்கு இப்னு அப்பாஸ் (ரலி) அவர்கள் (பின்வருமாறு) அறிவித்ததாகத் தெரிவித்தார்கள்: நபி (ஸல்) அவர்களது காலத்தில் சில முஸ்லிம்கள் இணைவைப்பாளர்களுடன் இருந்தனர். அவர்கள் (பத்ர் போரில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கெதிராக இணைவைப்பாளர்களின் கூட்டத்தை அதிகப்படுத்தி(க் காட்டக் காரணமாக இருந்த)னர். (முஸ்லிம்கள் அணியிலிருந்து அவர்களை நோக்கி) எய்யப்படும் அம்பு செல்லும். அது அவர்களில் ஒருவரைத் தாக்கிக் கொன்றுவிடும். அல்லது (வாளால்) அடிவாங்கிப் பலியாவார். (இது தொடர்பாகவே) அல்லாஹ், “தமக்குத்தாமே அநீதி இழைத்துக் கொண்டிருந்தவர்களின் உயிர்களை வானவர்கள் கைப்பற்றும்போது” எனும் (4:97ஆவது) வசனத்தை அருளினான்.23 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7086,
			"arabicnumber": 7086,
			"text": "ஹுதைஃபா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு (நம்பகத் தன்மை தொடர்பாக) இரு செய்திகள் கூறினார்கள். அவற்றில் ஒன்றை நான் (என் வாழ்நாளிலேயே) பார்த்துவிட்டேன். மற்றொன்றை எதிர்பார்த்திருக்கிறேன். ஒரு செய்தி யாதெனில், (இயற்கையாகவே) மனிதர்களின் ஆழ்மனதில் (‘அமானத்’ எனும்) நம்பகத் தன்மை இடம்பிடித்தது. பின்னர் அவர்கள் குர்ஆனிóருந்தும் (அதை) அறிந்துகொண்டார்கள். பிறகு (எனது வழியான) சுன்னாவிóருந்தும் (அதை) அறிந்துகொண்டார்கள். (நபியவர்கள் கூறிய இதை நான் பார்த்துவிட்டேன்.) இரண்டாவது செய்தி, நம்பகத் தன்மை அகற்றப்படுவது தொடர்பானதாகும். மனிதன் ஒருமுறை உறங்குவான். (உறக்கத்திலேயே) அவனது உள்ளத்திóருந்து நம்பகத் தன்மை (சிறிது) கைப்பற்றப்படும். அதையடுத்து அ(து அகற்றப்பட்ட)தன் அடையாளம் சிறு (கரும்) புள்ளி அளவுக்கு (அவனில்) தங்கிவிடும். பிறகு மீண்டும் ஒருமுறை அவன் உறங்குவான். அப்போது (மறுபடியும்) அது கைப்பற்றப்படும். இம்முறை அ(து அகற்றப்பட்ட)தன் அடையாளம் (கடின உழைப்பால் கையில் ஏற்படும்) காய்ப்பு அளவுக்கு (அவனில்) நிலைத்துவிடும். (இவ்வாறு முதலில் ‘நம்பகத் தன்மை’ எனும் ஒளி உள்ளத்தில் ஏற்றப்பட்டுப் பிறகு சிறிது சிறிதாக அணைக்கப்படுவதானது) காலில் தீக்கங்கை உருட்டிவிட்டு, அதனால் கால் கொப்பளித்து உப்பிவிடுவதைப் போன்றதாகும். பார்வையில் அது உப்பி பெரியதாகத் தெரியுமே தவிர, அதனுள் ஒன்றும் இராது. பின்னர் காலையில் மக்கள் தங்களிடையே கொடுக்கல் வாங்கல் செய்துகொள்வார்கள். (ஆனால், அவர்களில்) யாருமே நம்பிக்கையைக் காப்பாற்ற எத்தனிக்கமாட்டார்கள். இன்னாருடைய மக்களில் நம்பிக்கையான ஒருவர் இருக்கிறார் என்று (தேடிக் கண்டுபிடித்து) சொல்லப்படும் (அளவுக்கு நம்பிக்கையாளர்கள் அரிதாகிவிடுவார்கள்). மேலும், ஒருவரைப் பற்றி, “அவரது அறிவுதான் என்ன! அவரது விவேகம்தான் என்ன! அவரது வீரம்தான் என்ன!” என்று (சிலாகித்துக்) கூறப்படும். ஆனால், அந்த மனிதரின் இதயத்தில் கடுகளவுகூட நம்பிக்கை (ஈமான்) இராது. (அறிவிப்பாளர் ஹுதைஃபா (ரலி) அவர்கள் கூறுகிறார்கள்:) என்மீது ஒரு காலம் வந்திருந்தது. அக்காலத்தில் நான் உங்களில் யாரிடம் கொடுக்கல் வாங்கல் செய்கிறேன் என்று பொருட்படுத்தியதில்லை. ஏனெனில், முஸ்லிமாக இருந்தால் இஸ்லாம் (எனது பொருளை அவரிடமிருந்து) என்னிடம் திருப்பித் தந்துவிடும். கிறித்தவராயிருந்தால் அவருக்கான அதிகாரி என்னிடம் (எனது பொருளை) மீட்டுத் தந்துவிடுவார். ஆனால், இன்றோ நான் இன்னார் இன்னாரிடம் மட்டுமே கொடுக்கல் வாங்கல் செய்கிறேன்.24 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7087,
			"arabicnumber": 7087,
			"text": "சலமா பின் அல்அக்வஉ (ரலி) அவர்கள் கூறியதாவது: நான் (ஒருமுறை ஹிஜாஸ் மாகாண ஆளுநர்) ஹஜ்ஜாஜ் பின் யூசுஃபிடம் சென்றேன். அவர் “இப்னுல் அக்வஉ! நீங்கள் (மதீனாவுக்கு ஹிஜ்ரத் செய்தபின் அங்கிருந்து) உங்கள் குதிகால்களின் வழியே (கிராமத்திற்குத்) திரும்பிச் சென்றதன் மூலம் கிராமவாசியாக மாறிவிட்டீர்களா?” என்று கேட்டார். நான், “இல்லை; ஆயினும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கிராமத்தில் வசிக்க எனக்கு அனுமதியளித்துள்ளார்கள்” என்று சொன்னேன். (அறிவிப்பாளர்களில் ஒருவரான) யஸீத் பின் அபீஉபைத் (ரஹ்) அவர்கள் கூறினார்கள்: உஸ்மான் பின் அஃப்பான் (ரலி) அவர்கள் கொல்லப்பட்டபோது சலமா பின் அல்அக்வஉ (ரலி) அவர்கள் (மதீனாவிலிருந்து) வெளியேறி ‘ரபதா’ என்னுமிடத் திற்குச் சென்று அங்கு ஒரு பெண்ணை மணந்துகொண்டார்கள். அப்பெண் மூலம் அவர்களுக்குப் பல குழந்தைகள் பிறந்தன. அங்கேயே வசித்துவந்த சலமா பின் அல்அக்வஉ (ரலி) அவர்கள், தாம் இறப்பதற்குச் சில நாட்கள் முன்புதான் (அங்கிருந்து திரும்பி வந்து) மதீனாவில் தங்கினார்கள்.26 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7088,
			"arabicnumber": 7088,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிமின் செல்வங்களிலேயே ஆடு ஒன்றுதான் சிறந்த செல்வமாக மாறக்(கூடிய காலம் வரக்)கூடும். குழப்பங்களிலிருந்து தமது மார்க்க(விசு வாசத்)த்தைக் காப்பாற்றிக்கொள்ள அந்த ஆட்டை ஓட்டிக்கொண்டு அவர் மலை உச்சிக்கும் மழைத்துளிகள் விழும் (கணவாய்கள், பள்ளத்தாக்குகள் போன்ற) இடங்களுக்கும் சென்று வாழ்வார். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.27 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7089,
			"arabicnumber": 7089,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபித்தோழர்கள் (சிலர்) நபி (ஸல்) அவர்களிடம் (அவர்களுக்குப் பிடிக்காத) சில விஷயங்கள் குறித்து வற்புறுத்திக் கேட்டுக்கொண்டிருந்தார்கள். ஆகவே, நபி (ஸல்) அவர்கள் ஒருநாள் சொற்பொழிவு மேடையின் மீதேறி, “(இன்று) நீங்கள் என்னிடம் எதைப் பற்றிக் கேட்டாலும் அதைப் பற்றி நான் உங்களுக்குத் தெளிவுபடுத்தாமல் இருக்கப்போவதில்லை” என்று (கோபத்துடன்) கூறினார்கள். உடனே நான்வலப் பக்கமும் இடப் பக்கமும் திரும்பிப் பார்க்கத் தலைப்பட்டபோது அங்கிருந்த ஒவ்வொருவரும் தமது ஆடையால் தலையைச் சுற்றிப் போர்த்தியவாறு அழுதுகொண்டிருந்தார்கள். அப்போது ஒரு மனிதர் பேசத் தொடங்கினார். அம்மனிதர் (பிறருடன்) சண்டைசச்சரவு செய்யும்போது அவருடைய தந்தையல்லாத மற்றொரு வரின் மகன் என அழைக்கப்பட்டுவந்தார். ஆகவே அவர், “அல்லாஹ்வின் நபியே! என் தந்தை யார்?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “உன் தந்தை ஹுதாஃபா” என்று சொன்னார்கள். பிறகு உமர் (ரலி) அவர்கள், “நாங்கள் அல்லாஹ்வை இறைவனாகவும், இஸ்லாத்தை மார்க்கமாகவும், முஹம்மத் (ஸல்) அவர்களை இறைத்தூதராகவும் மனநிறைவுடன் ஏற்றுக்கொண்டோம். குழப்பங்களின் தீங்கிலிருந்து (எங்களை) பாதுகாக்கும்படி அல்லாஹ்விடம் கோருகின்றோம்” என்று கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள், “நன்மையிலும் தீமையிலும் இன்றைய தினத்தைப் போன்று எந்த நாளையும் ஒருபோதும் நான் கண்டதில்லை. எனக்கு (இன்று) சொர்க்கமும் நரகமும் காட்டப்பட்டன. அவற்றை (மிஹ்ராபின்) இந்தச் சுவருக்கு அப்பால் நான் கண்டேன்” என்று சொன்னார்கள். (அறிவிப்பாளர்களில் ஒருவரான) கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: இந்த நபிமொழி, “இறைநம்பிக்கை கொண்டவர்களே! சில விஷயங்களைக் குறித்துக் கேட்காதீர்கள். அவை உங்களுக்கு வெளிப்படுத்தப்பட்டால் உங்களுக்கு மன வருத்தத்தை ஏற்படுத்தும்” எனும் (5:101ஆவது) இறை வசனத்தை ஓதும்போது நினைவுகூரப்படுவது வழக்கம்.28 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7090,
			"arabicnumber": 7090,
			"text": "கத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: அனஸ் (ரலி) அவர்கள் மக்களுக்கு நபி (ஸல்) அவர்களின் இந்த ஹதீஸை அறிவித்துவிட்டுப் (பின்வருமாறு) கூறினார்கள்: அப்போது (அங்கிருந்த) ஒவ்வொருவரும் (நபியவர்களின் கோபத்தைக் கண்டு அஞ்சி) தமது ஆடையால் தலையைச் சுற்றிப் போர்த்தியவாறு அழுதுகொண்டிருந்தார்கள். மேலும், ‘குழப்பங்களின் தீங்கிலிருந்து பாதுகாப்புக் கோரிக்கொண்டிருந் தார்கள்’, அல்லது ‘குழப்பங்களின் தீங்கிலிருந்து பாதுகாப்புக் கோருகிறேன் என்று சொல்லிக்கொண்டிருந்தார்கள்’. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7091,
			"arabicnumber": 7091,
			"text": "கத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: அனஸ் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடமிருந்து (கேட்டு) மக்களுக்கு இந்த ஹதீஸை அறிவித்தார்கள். மேலும், “குழப்பங்களின் தீங்கிலிருந்து அல்லாஹ்விடம் பாதுகாப்புக் கோரியவர்களாக” என்றும் கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7092,
			"arabicnumber": 7092,
			"text": "(அப்துல்லாஹ் பின் உமர் ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் சொற்பொழிவு மேடையின் அருகில் நின்றுகொண்டு, (கிழக்குத் திசையைச் சுட்டிக்காட்டி) “குழப்பம் இங்குதான் தோன்றும்; குழப்பம் இங்குதான் தோன்றும். ‘ஷைத்தானின் கொம்பு’ அல்லது ‘சூரியனின் கொம்பு’ உதயமாகும் இடத்திலிருந்து” என்று சொன்னார்கள்.29 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7093,
			"arabicnumber": 7093,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கிழக்கை நோக்கியவாறு, “அறிந்து கொள்ளுங்கள்! குழப்பம், ஷைத்தானின் கொம்பு உதயமாகும் இந்த இடத்திலிருந்து தோன்றும்” என்று சொல்ல நான் கேட்டேன். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7094,
			"arabicnumber": 7094,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், “இறைவா! எங்கள் ஷாம் (சிரியா) நாட்டில் எங்களுக்கு வளம் வழங்குவாயாக! இறைவா! எங்கள் யமன் நாட்டில் எங்களுக்கு வளம் வழங்குவாயாக!” என்று சொன்னார்கள். மக்கள், “(இராக் திசையில் அமைந்த) எங்கள் ‘நஜ்த்’ பகுதியிலும் (வளம் வழங்குமாறு பிரார்த்தியுங்கள்)” என்று கேட்க, (மீண்டும்) நபி (ஸல்) அவர்கள், “இறைவா! எங்கள் ஷாம் நாட்டில் வளம் வழங்குவாயாக! எங்கள் யமன் நாட்டில் வளம் வழங்குவாயாக!” என்றே பிரார்த்தித்தார்கள். மக்கள், “அல்லாஹ்வின் தூதரே! எங்கள் ‘நஜ்த்’ பகுதியிலும் (வளம் வழங்குமாறு பிரார்த்தியுங்களேன்)” என்று (மீண்டும்) கேட்டனர். அப்போது நபி (ஸல்) அவர்கள், -மூன்றாவது முறையில் என்று நினைக்கிறேன்- “அங்குதான் நில நடுக்கங்களும் குழப்பங்களும் தோன்றும்; அங்குதான் ஷைத்தானின் கொம்பு உதயமாகும்” என்று கூறினார்கள்.30 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7095,
			"arabicnumber": 7095,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் (மக்காவில் அரசியல் குழப்பம் நடந்து கொண்டிருந்தபோது) எங்களிடம் (ஒருநாள்) வந்தார்கள். அன்னார் எங்க ளுக்கு ஒரு நல்ல ஹதீஸை எடுத்துரைக்க வேண்டுமென நாங்கள் எதிர்பார்த்தோம். இதற்கிடையில் ஒருவர் அவர்களை நோக்கி விரைந்துசென்று, “அபூஅப்திர் ரஹ்மானே! குழப்பத்தின்போது போர் புரிவது பற்றி எங்களுக்குச் சொல்லுங்கள். அல்லாஹ்வோ, “குழப்பம் நீங்கும்வரை போரிடுங்கள்” என்று (8:39ஆவது வசனத்தில்) கூறுகின்றானே!” எனக் கேட்டார். அதற்கு அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், “தாயற்றுப்போவாய்! (இந்த வசனத்தில் கூறப்பட்டுள்ள) ‘குழப்பம்’ என்னவென்று உனக்குத் தெரியுமா? முஹம்மத் (ஸல்) அவர்கள் இணைவைப்பாளர்களுடன்தான் போரிட்டார்கள். இணைவைப்பாளர்களின் மார்க்கத்தில் இருப்பதுதான் குழப்பமே. ஆனால், (இன்று) ஆட்சியதிகாரத்திற்காக நீங்கள் போரிட்டுக்கொள்வதைப் போன்று அது இருக்கவில்லை” என்று பதிலளித்தார்கள்.31 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7096,
			"arabicnumber": 7096,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (ஒருமுறை கலீஃபா) உமர் (ரலி) அவர்கள் அருகில் அமர்ந்திருந்தபோது அவர்கள், “உங்களில் யார் இனி தலை தூக்கவிருக்கும் (ஃபித்னா) குழப்பத்தைப் பற்றி நபி (ஸல்) அவர்கள் சொன்னதை நினைவில் வைத்திருக்கின்றார்?” என்று கேட்டார்கள். நான், “ஒரு மனிதன் தன் குடும்பத்தார் விஷயத்தில் (அவர்கள்மீது அளவு கடந்த பாசத்தை வைத்திருப்பதன் மூலமும்), தனது செல்வம் விஷயத்தில் (அது இறைவனைப் பணிந்து வாழும் வாழ்க்கையிலிருந்து திசைதிருப்புவதன் மூலமும்), தன் அண்டை வீட்டார் விஷயத்தில் (அவர்களின் உரிமைகளில் குறைவைப்பதன் மூலமும்) ஃபித்னாவில் (சோதனையில்) ஆழ்த்தப்படும்போது தொழுகை, தர்மம், நன்மை புரியும்படி கட்டளையிட்டு, தீமையிலிருந்து தடுத்தல் ஆகியன அதற்கான பரிகாரமாக அமையும்” என்று (நபி (ஸல்) அவர்கள் சொன்னார்கள் எனக்) கூறினேன். உமர் (ரலி) அவர்கள், “நான் (சோதனை எனும் பொருள் கொண்ட ஃபித்னாவான) இதைப் பற்றிக் கேட்கவில்லை. கடல் அலையைப் போன்று அடுக்கடுக்காக ஏற்படக்கூடிய (நபியவர்களால் முன்னறிவிக்கப்பட்ட குழப்பம் எனும் பொருள் கொண்ட ஃபித்னா)வைப் பற்றியே கேட்கிறேன்” என்று சொன்னார்கள். நான், “இறைநம்பிக்கையாளர்களின் தலைவரே! அதைப் பற்றி நீங்கள் கவலைப்பட வேண்டியதில்லை. (உங்கள் ஆட்சியில் அவற்றில் ஏதும் தலைதூக்கப் போவதில்லை.) உங்களுக்கும் அதற்குமிடையே மூடப்பட்ட கதவொன்று உள்ளது” என்று கூறினேன். உமர் (ரலி) அவர்கள், “அந்தக் கதவு உடைக்கப்படுமா? அல்லது திறக்கப்படுமா?” என்று கேட்டார்கள். நான், “இல்லை; அது உடைக்கப்படும்” என்று பதிலளித்தேன். அதற்கு உமர் (ரலி) அவர்கள், “அப்படியானால் அது ஒருபோதும் மூடப்படாது” என்று சொன்னார்கள். நான், “ஆம் (சரிதான்)” என்று சொன்னேன். அறிவிப்பாளர் அபூவாயில் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நாங்கள் ஹுதைஃபா (ரலி) அவர்களிடம், “உமர் (ரலி) அவர்கள் அந்தக் கதவு எதுவென்று அறிந்திருந்தார்களா?” என்று கேட்டோம். ஹுதைஃபா (ரலி) அவர்கள், “ஆம். பகலுக்குமுன் இரவு உண்டு என்பதை அறிவதைப் போன்று உமர் (ரலி) அவர்கள் அதை அறிந்திருந் தார்கள். ஏனெனில், பொய்கள் கலவாத செய்தியையே நான் அவருக்கு அறிவித் திருந்தேன்” என்று பதிலளித்தார்கள். அந்தக் கதவு எதுவென்று ஹுதைஃபா (ரலி) அவர்களிடம் கேட்க நாங்கள் அஞ்சினோம். எனவே, அவர்களிடம் மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்களைக் கேட்கச் சொன்னோம். அவர் அந்தக் கதவு எது என்று கேட்டதற்கு ஹுதைஃபா (ரலி) அவர்கள், “உமர் (ரலி) அவர்கள்தான் அந்தக் கதவு” என்று பதிலளித்தார்கள்.33 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7097,
			"arabicnumber": 7097,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவின் தோட்டங்களில் ஒன்றுக்குத் தமது இயற்கைக் கடனை நிறைவேற்றுவதற்காகச் சென்றார்கள். அவர்களுக்குப் பின்னாலேயே நான் சென்றேன். இறுதியில் (குபாவிற்கு அருகிலுள்ள ‘பிஃரு அரீஸ்’ எனும்) தோட்டத்திற்குள் நபி (ஸல்) அவர்கள் சென்றபோது நான் அதன் தலைவாயிலில் அமர்ந்துகொண்டேன். நபியவர்கள் எனக்குக் கட்டளையிடாமலேயே “இன்றைய தினம் நான் அவர்களின் வாயிற்காவலனாக இருப்பேன்” என்று கூறிக்கொண்டேன். நபி (ஸல்) அவர்கள் சென்று தமது இயற்கைக் கடனை நிறைவேற்றிவிட்டு (அங்கிருந்த) கிணற்றின் சுற்றுச் சுவரில் தம் கால்கள் இரண்டையும் திறந்து கிணற்றுக்குள் தொங்கவிட்டபடி அமர்ந்துகொண்டார்கள். அப்போது அபூபக்ர் (ரலி) அவர்கள் வந்து நபியவர்களிடம் செல்ல அன்னாரின் அனுமதி கேட்கும்படி சொன்னார்கள். நான், “உங்களுக்காக நான் (நபியவர்களிடம்) அனுமதி கேட்கும்வரை நீங்கள் அப்படியே (இங்கே) இருங்கள்” என்று கூறினேன். அவ்வாறே அவர்கள் (அவ்வாசலில்) நின்றுகொள்ள, நான் நபியவர்களிடம் சென்று, “அல்லாஹ்வின் தூதரே! (இதோ!) அபூபக்ர் (ரலி) அவர்கள் (வந்து) தங்களிடம் உள்ளே வர அனுமதி கேட்கிறார்கள்” என்று சொன்னேன். நபி (ஸல்) அவர்கள், “அவருக்கு அனுமதி அளியுங்கள். மேலும், அவர் சொர்க்கவாசி என்று நற்செய்தி கூறுங்கள்” என்று சொன்னார்கள். அபூபக்ர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களுக்கு வலப் பக்கத்தில் வந்து தம் கால்கள் இரண்டையும் திறந்து கிணற்றுக்குள் அவற்றை தொங்கவிட்டபடி அமர்ந்து கொண்டார்கள். பிறகு உமர் (ரலி) அவர்கள் வந்தார்கள். அப்போது நான், “இங்கேயே இருங்கள். உங்களுக்காக நான் நபி (ஸல்) அவர்களிடம் உள்ளே வர அனுமதி கேட்கின்றேன்” என்று கூறினேன். (நான் அவர்களுக்காக அனுமதி கேட்டபோது) நபி (ஸல்) அவர்கள், “அவருக்கு அனுமதி அளியுங்கள்; அவர் சொர்க்கவாசி என்று அவருக்கு நற்செய்தி சொல்லுங்கள்” என்று (என்னிடம்) கூறினார்கள். உமர் (ரலி) அவர்கள் (உள்ளே) வந்து, நபி (ஸல்) அவர்களுக்கு இடப் பக்கம் தம் கால்களைத் திறந்து அந்தக் கிணற்றுக்குள் தொங்கவிட்டபடி அமர்ந்துகொண்டார்கள். அந்தச் சுவர் நிரம்பிவிட்டது. அதில் (இனி யாரும்) அமர்வதற்கு இடம் இருக்கவில்லை. பிறகு உஸ்மான் (ரலி) அவர்கள் வந்தார்கள். நான், “நீங்கள் இங்கேயே இருங்கள்; உங்களுக்காக நான் நபி (ஸல்) அவர்களிடம் அனுமதி கேட்டு வருகின்றேன்” என்று சொன்னேன். (நான் உள்ளே சென்றபோது) நபி (ஸல்) அவர்கள், “அவருக்கு அனுமதி அளியுங்கள்; அவர் சொர்க்கவாசி என்று அவருக்கு நற்செய்தி கூறுங்கள். அத்துடன் அவருக்கு நேரவிருக்கும் சோதனையையும் கூறுங்கள்” என்றார்கள். (அவ்வாறே நான் அனுமதி வழங்கி நற்செய்தி தெரிவித்தேன்.) உஸ்மான் (ரலி) அவர்கள் உள்ளே வந்து, ஏற்கெனவே அமர்ந்திருந்தவர்களுடன் அமர இடம் இல்லாததால் திரும்பிச் சென்று அவர்களுக்கு எதிரிலிருந்த அக்கிணற்றின் மற்றொரு சுற்றுச் சுவரில் தம் கால்களைத் திறந்து அவற்றைக் கிணற்றில் தொங்கவிட்டபடி அமர்ந்தார்கள். என் சகோதரர் ஒருவரை எதிர்பார்த்த படி அவர் (அங்கு) வர வேண்டும் என்று நான் அல்லாஹ்விடம் பிரார்த்திக்க லானேன். அறிவிப்பாளர் சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் கூறினார்கள்: நான், “(நபி (ஸல்) அவர்களும் அபூபக்ர் (ரலி), உமர் (ரலி) ஆகியோரும் அடுத்தடுத்து அமர்ந்திருந்த இந்த நிலையும் அவர்களுக்கு எதிரே உஸ்மான் (ரலி) அவர்கள் அமர்ந்திருந்த நிலையும் தற்போது) அவர்களின் கப்றுகள் (மண்ணறைகள்) இங்கு ஒரே இடத்தில் அமைந்திருக்கும் நிலையையும் உஸ்மான் (ரலி) அவர்கள் பிரிந்து (‘ஜன்னத்துல் பகீஉ’ மையவாடிக்கு) சென்றுவிட்ட நிலையையும் குறிப்பதாக விளக்கம் கண்டேன்.34 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7098,
			"arabicnumber": 7098,
			"text": "அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: உசாமா பின் ஸைத் (ரலி) அவர்களிடம், “நீங்கள் இவரிடம் (உஸ்மான் (ரலி) அவர்களிடம் இந்த அரசியல் குழப்பங்கள் தொடர்பாகப்) பேசக் கூடாதா? (அவர்கள் உங்களுக்கு நெருக்கமானவர்கள் ஆயிற்றே!)” என்று கேட்கப்பட்டது. அதற்கு உசாமா (ரலி) அவர்கள், “நான் அவர்களிடம் (அரசியல் குழப்பம் குறித்துப் பேசுவதாயிருந்தால், கலகத்திற்குக்) கதவைத் திறந்துவிடாமலேயே அவர்களிடம் (இரகசியமாகப்) பேசுகின்றேன். (ஏனெனில், குழப்பத்தின்) கதவைத் திறக்கும் முதல் ஆள் நானாக இருக்க விரும்பவில்லை. மேலும், ஒரு மனிதர் இரண்டு பேருக்குத் தலைவராக (ஆணையிடும் அதிகாரத்தில்) இருப்பதனால் அவரை ‘மக்களில் நீங்கள்தான் சிறந்தவர்’ என்று நான் சொல்லமாட்டேன். (அதுவும்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து (ஒரு விஷயத்தை) நான் செவியுற்ற பிறகு (அவ்வாறு நான் சொல்லமாட்டேன்). அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (மறுமை நாளில்) ஒரு மனிதர் கொண்டுவரப்பட்டு அவர் நரகத்தில் வீசப்படுவார். கழுதை தனது செக்கைச் சுற்றிவருவதைப் போன்று அவர் நரகில் சுற்றிவருவார். அப்போது நரகவாசிகள் அவரைச் சுற்றி ஒன்றுகூடி, “இன்னாரே (உமக்கேன் இந்த நிலை?) நீர் (உலக வாழ்வின்போது) நற்செயல் புரியும்படி (மக்களுக்கு) கட்டளையிட்டு, தீமை புரிய வேண்டாம் என (அவர்களைத்) தடுத்துக்கொண்டிருக்(கும் நற்பணி செய்துகொண்டிருக்)கவில்லையா?” என்று கேட்பார்கள். அதற்கு அந்த மனிதர், “நற்செயல் புரியும்படி (மக்களுக்கு) நான் கட்டளையிட்டேன்; ஆனால், அந்த நற்செயலை நான் செய்யவில்லை. தீமை புரிய வேண்டாம் என்று (மக்களை) நான் தடுத்தேன்; ஆனால், அந்தத் தீமையை நானே செய்துவந்தேன்” என்று கூறுவார்.35 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7099,
			"arabicnumber": 7099,
			"text": "அபூபக்ரா நுஃபைஉ பின் ஹாரிஸ் (ரலி) அவர்கள் கூறியதாவது: ‘ஜமல்’ போர் சமயத்தில் (ஆயிஷா (ரலி) அவர்களின் ஆதரவாளர்களுடன் சேர்ந்துகொண்டு நான் போரிட முற்பட்டபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து நான் செவியுற் றிருந்த) ஒரு சொல் மூலம் அல்லாஹ் எனக்குப் பயனளித்தான். பாரசீகர்கள் கிஸ்ராவின் மகளைத் தங்களுக்கு அரசியாக்கிவிட்டார்கள் எனும் செய்தி நபி (ஸல்) அவர்களுக்கு எட்டியபோது அவர்கள், “தமது விவகாரத்தை ஒரு பெண்ணிடம் (முழுமையாக) ஒப்படைத்த சமுதாயம் ஒருபோதும் வெல்லாது” என்று சொன்னார்கள். (இதுதான் எனக்குப் பயனளித்த நபி (ஸல்) அவர்களின் சொல்.)37 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7100,
			"arabicnumber": 7100,
			"text": "அபூமர்யம் அப்துல்லாஹ் பின் ஸியாத் அல்அசதீ (ரஹ்) அவர்கள் கூறியதாவது: (ஜமல் பேரின்போது) தல்ஹா (ரலி), ஸுபைர் (ரலி), ஆயிஷா (ரலி) ஆகியோர் (இராக்கிலுள்ள) ‘பஸ்ரா’வுக்குச் சென்றபோது அலீ (ரலி) அவர்கள், அம்மார் பின் யாசிர் (ரலி) அவர்களையும் ஹசன் பின் அலீ (ரலி) அவர்களையும் (மக்களைத் திரட்டுமாறு கூஃபாவுக்கு) அனுப்பிவைத்தார்கள். அவர்கள் இருவரும் எங்களிடம் கூஃபாவுக்கு வந்து சொற்பொழிவு மேடையில் (மிம்பர்) ஏறினர். ஹசன் பின் அலீ (ரலி) அவர்கள் சொற்பொழிவு மேடையில் அதன்மேல் தளத்தில் இருந்தார்கள். அம்மார் (ரலி) அவர்கள் ஹசன் (ரலி) அவர்களுக்குக் கீழே நின்றிருந்தார்கள். நாங்கள் அவர்களிடம் ஒன்றுதிரண்டோம். அப்போது அம்மார் (ரலி) அவர்கள், “ஆயிஷா (ரலி) அவர்கள் பஸ்ராவுக்குச் சென்றுவிட்டார்கள். அல்லாஹ்வின் மீதாணையாக! அவர்கள் இவ்வுலகிலும் மறுமையிலும் உங்கள் நபியின் துணைவியார் ஆவார்கள். (அதில் எந்தச் சந்தேகமும் இல்லை.) ஆனால், வளமும் உயர்வும் உடைய அல்லாஹ், நீங்கள் அவனுக்குக் கீழ்ப்படிகிறீர்களா? அல்லது ஆயிஷாவுக்குக் கீழ்ப்படி கிறீர்களா? என்று (வெளிப்படையாக) அறிந்துகொள்வதற்காக உங்களைச் சோதிக்கின்றான்” என்று சொல்லக் கேட்டேன். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7101,
			"arabicnumber": 7101,
			"text": "அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: அம்மார் பின் யாசிர் (ரலி) அவர்கள் கூஃபாவின் (பள்ளிவாசல்) மிம்பரில் நின்று ஆயிஷா (ரலி) அவர்களைப் பற்றியும் (தம் ஆதரவாளர்களுடன் பஸ்ராவுக்கு) அவர்கள் மேற்கொண்ட பயணம் பற்றியும் குறிப்பிட்டுவிட்டு, “ஆயிஷா (ரலி) அவர்கள், இந்த உலகிலும் மறுமையிலும் உங்கள் நபியின் துணைவியார் ஆவார்கள். ஆனால், அவர் மூலம் நீங்கள் சோதனைக்குள்ளாக்கப்பட்டுள்ளீர்கள்” என்று கூறினார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7104,
			"arabicnumber": 7104,
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7107,
			"arabicnumber": 7107,
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7108,
			"arabicnumber": 7108,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு சமுதாயத்தின் மீது அல்லாஹ் வேதனையை இறக்கும்போது அதிலுள்ளவர்கள் அனைவரையும் அந்த வேதனை தாக்கும். பிறகு அவர்கள் தம் செயல்களுக்கு ஏற்ப (மறுமையில்) எழுப்பப்படுவார்கள்.38 இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7109,
			"arabicnumber": 7109,
			"text": "சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறியதாவது: (அபூஜஅஃபர் மன்சூர் ஆட்சிக் காலத்தில் இராக்கிலுள்ள) கூஃபாவில் அபூமூசா இஸ்ராயீல் அவர்களை நான் சந்தித்தேன். அன்னார் (கூஃபாவின் நீதிபதியான) அப்துல்லாஹ் பின் ஷுப்ருமா (ரஹ்) அவர்களிடம் வந்திருந்தார்கள். அபூமூசா (ரஹ்) அவர்கள், “என்னை (கூஃபாவின் ஆளுநர்) ஈசா பின் மூசாவிடம் அழைத்துச் செல்லுங்கள்; அவருக்கு நான் உபதேசம் செய்ய வேண்டும்” என்று இப்னு ஷுப்ருமாவிடம் கூறினார்கள். (ஆளுநர் ஈசா) அபூமூசா விஷயத்தில் (ஏதும் செய்துவிடுவார் என்று) இப்னு ஷுப்ருமா பயந்துவிட்டார்போலும். அதனால் (அபூமூசாவின் கோரிக்கையை ஏற்று) அவர் செயல்படவில்லை. பின்னர் ஹசன் அல்பளி (ரஹ்) அவர்கள் (பின்வருமாறு) அறிவித்ததாக அபூமூசா (ரஹ்) அவர்கள் கூறினார்கள்: ஹசன் பின் அலீ (ரலி) அவர்கள் பெரும் படையணிகளுடன் முஆவியா (ரலி) அவர்களை நோக்கிப் பயணமானார்கள். (இதை அறிந்த முஆவியா (ரலி) அவர்களுடைய ஆலோசகர்) அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் முஆவியா (ரலி) அவர்களிடம், “தன் எதிரணியைப் புறமுதுகிட்டு ஓடச்செய்யாத வரையில் பின்வாங்காத பெரும் படையணியை நான் பார்க்கிறேன்” என்று குறிப்பிட்டார்கள். முஆவியா (ரலி) அவர்கள், “(இவர்கள் கொல்லப்பட்டுவிட்டால்) முஸ்லிம்களின் (வருங்காலச்) சந்ததிகளுக்கு (பொறுப்பேற்க) யார் இருக்கிறார்கள்?” என்று கேட்க, அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள், “நான் (இருக்கிறேன்)” என்று பதிலளித்தார்கள். அப்போது அப்துல்லாஹ் பின் ஆமிர் (ரலி) அவர்களும் அப்துர் ரஹ்மான் பின் சமுரா (ரலி) அவர்களும், “நாங்கள் ஹசன் (ரலி) அவர்களைச் சந்தித்து அவர்களிடம் சமாதானம் செய்துகொள்ளும்படி கூறுகிறோம்” என்று சொன்னார்கள். தொடர்ந்து ஹசன் அல்பளி (ரஹ்) அவர்கள் கூறுகிறார்கள்: நபி (ஸல்) அவர்கள் (சொற்பொழிவு மேடைமீது நின்று) உரையாற்றிக்கொண்டி ருந்தபோது ஹசன் (ரலி) அவர்கள் வந்தார்கள். உடனே நபி (ஸல்) அவர்கள், “என்னுடைய இந்த (புதல்வியின்) புதல்வர் தலைவர் ஆவார். முஸ்லிம்களின் இரு குழுவினரிடையே இவர் வாயிலாக அல்லாஹ் சமாதானம் செய்துவைப்பான்” என்று கூறினார்கள் என அபூபக்ரா (ரலி) அவர்கள் தெரிவித்தார்கள்.39 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7110,
			"arabicnumber": 7110,
			"text": "உசாமா பின் ஸைத் (ரலி) அவர்களால் விடுதலை செய்யப்பட்ட அடிமையான ஹர்மலா (ரஹ்) அவர்கள் கூறியதாவது: உசாமா (ரலி) அவர்கள் என்னை அலீ (ரலி) அவர்களிடம் அனுப்பி, “இப்போது அவர் (அலீ-ரலி) உன்னிடம் உம் தோழர் (உசாமா, ஜமல் மற்றும் ஸிஃப்பீன் போர்களில் எனக்கு ஆதரவளிக்காமல்) பின் வாங்கியதற்குக் காரணம் என்ன? என்று கேட்பார். நீங்கள் சிங்கத்தின் தாடைக்குள் இருந்தாலும் உங்களுடன் இருப்பதையே நான் விரும்புவேன்; ஆனால், (முஸ்லிம்களிடையே நடக்கும்) இந்தச் சண்டையில் எனக்கு உடன்பாடில்லை என்று நான் கூறுவதாக அவரிடம் சொல்” என்று சொன்னார்கள். (நானும் அவ்வாறே அலீ (ரலி) அவர்களிடம் சென்று சொன்னேன்.) அலீ (ரலி) அவர்கள் (போர்ச் செல்வத்தி லிருந்து) எனக்கு எதுவும் கொடுக்க வில்லை. ஆகவே, நான் ஹசன் (ரலி), ஹுசைன் (ரலி), அப்துல்லாஹ் பின் ஜஅஃபர் (ரலி) ஆகியோரிடம் சென்றேன். அவர்கள் எனது வாகனத்தில் அது (சுமக்க முடிந்த அளவுக்கு) எனக்காக (அன்பளிப்புப் பொருள்களை) ஏற்றியனுப்பினார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7111,
			"arabicnumber": 7111,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: மதீனாவாசிகள் யஸீத் பின் முஆவியாவுக்கு அளித்த விசுவாசப் பிரமாணத்தை விலக்கிக்கொண்டபோது இப்னு உமர் (ரலி) அவர்கள் தம் அபிமானிகளையும் தம் மக்களையும் ஒன்றுதிரட்டி, “மோசடி (நம்பிக்கைத் துரோகம்) செய்பவன் ஒவ்வொருவனுக்கும் (உலகில்) அவன் செய்த மோசடியை வெளிச்சமிட்டுக் காட்டுவதற்காக மறுமை நாளில் கொடியொன்று நடப்படும் என்று நபி (ஸல்) அவர்கள் சொல்லக் கேட்டுள்ளேன். அல்லாஹ் மற்றும் அவனுடைய தூதர் வழிமுறைப்படி நாம் இந்த மனிதருக்கு (யஸீதுக்கு) விசுவாசப் பிராமணம் செய்துகொடுத்துள்ளோம். அல்லாஹ் மற்றும் அவனுடைய தூதரின் வழிமுறைப்படி ஒரு மனிதருக்கு விசுவாசப் பிரமாணம் செய்துகொடுத்து விட்டுப் பிறகு அவருக்கே எதிராகப் போர் நடத்துவதைவிடப் பெரிய மோசடி எதையும் நான் அறியவில்லை. (என் சகாக்களான) உங்களில் எவரும் யஸீதுக்கு செய்துகொடுத்த விசுவாசப் பிரமாணத்தை விலக்கிக்கொண்டதாகவோ, இந்த ஆட்சியதிகாரத்தில் வேறெவருக்காவது விசுவாசப் பிரமாணம் செய்து கொடுத்ததாகவோ நான் அறிந்தால், அதுவே அவருக்கும் எனக்கும் இடையே உள்ள உறவை துண்டிக்கக்கூடியதாக இருக்கும்” என்று சொன்னார்கள்.41 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7112,
			"arabicnumber": 7112,
			"text": "அபுல் மின்ஹால் பின் சலாமா (ரஹ்) அவர்கள் கூறியதாவது: இப்னு ஸியாத் (பஸ்ராவிலிருந்து வெளியேறி ஷாம் நாட்டுக்கு வர, அங்கு) மர்வான் பின் அல்ஹகம் ஷாம் நாட்டில் (கிளர்ச்சியை ஆரம்பித்து) இருந்தபோது, மேலும் (அதே நேரத்தில்) மக்காவில் அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்களும் பஸ்ராவில் காரிஜிய்யாக்களும் கிளர்ச்சியில் ஈடுபட்டிருந்தபோது நான் என் தந்தையுடன் அபூபர்ஸா அல்அஸ்லமீ (ரலி) அவர்களிடம் சென்றேன். அன்னார் பேரீச்சங்கழியாலான உப்பரிகை ஒன்றில் அமர்ந்திருக்க அவர்களது இல்லத்தினுள் நுழைந்து அவர்களிடம் நாங்கள் அமர்ந்து கொண்டோம்.42 அப்போது என் தந்தை (சலாமா) அபூபர்ஸா (ரலி) அவர்களுடன் தகவல் பரிமாறிக்கொள்ளும் எண்ணத்தில் பேசத் தொடங்கினார்கள். “அபூபர்ஸா! மக்கள் எந்த விஷயத்தில் சிக்கிக்கொண்டுவிட்டார்கள் என்பதை நீங்கள் பார்க்கவில்லையா?” என்று என் தந்தை கேட்டார்கள். அப்போது அபூபர்ஸா (ரலி) அவர்கள் பேசி நான் கேட்ட முதல் விஷயம் இதுதான். (அன்னார் கூறினார்கள்:) குறைஷிக் குடும்பங்கள் சிலவற்றின் மீது நான் கோபம் கொண்டவனாய் மாறியதற்கு அல்லாஹ்விடம் நற்பலனை எதிர்பார்க்கிறேன். (குறைஷியரிடம் நான் கூறினேன்:) அரபுகளே! நீங்கள் இழிவு, பொருளாதாரக் குறைவு மற்றும் வழிகேடு ஆகிய (மோசமான) நிலைகளில் இருந்தீர்கள் என்பது உங்களுக்குத் தெரியும். அல்லாஹ், இஸ்லாத்தின் மூலமாகவும் முஹம்மத் (ஸல்) அவர்கள் மூலமாகவும் உங்களைக் காப்பாற்றினான். அதன் விளைவாக நீங்கள் காண்கின்ற இந்த (கண்ணியம், வளமிக்க வாழ்வு, நல்வழி ஆகிய நல்ல) நிலைகளை அடைந்தீர்கள். இந்த உலக (மோக)ம் எத்தகைய தென்றால், உங்களுக்கிடையே அது சீர்கேட்டை(யும் குழப்பத்தையும்) விளைவித்துவிட்டது. ஷாம் நாட்டி óருக்கின்றாரே அவர் (மர்வான் பின் அல்ஹகம்), அல்லாஹ்வின் மீதாணையாக! உலக (ஆதாய)த்திற்காகவே போரிடுகின்றார். (இங்கு பஸ்ராவில்) உங்கள் முன்னே இருக்கின்றார்களே அவர்களும் (காரிஜிய்யாக்கள்), அல்லாஹ்வின் மீதாணையாக! உலக (ஆதாய)த்திற்காகவே போரிடுகின்றார்கள். மக்காவில் இருக்கின்றாரே அவரும் (அப்துல்லாஹ் பின் அஸ்ஸுபைர்) உலக (ஆதாய)த்திற்காகவே போரிடுகின்றார். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7113,
			"arabicnumber": 7113,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: இன்றிருக்கும் நயவஞ்சகர்கள் நபி (ஸல்) அவர்களது காலத்திலிருந்த நயவஞ்சகர்களைவிட மோசமானவர்கள் ஆவர். (ஏனெனில்) அன்று அவர்கள் இரகசியமாகச் செயல்பட்டுவந்தார்கள். இன்றோ இவர்கள் பகிரங்கமாகச் செயல்படுகின்றார்கள்.43 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7114,
			"arabicnumber": 7114,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நயவஞ்சகம் என்பதெல்லாம் (மக்கள் சிலரிடம்) நபி (ஸல்) அவர்களது காலத்தில்தான் இருந்தது. இன்றோ, இறைநம்பிக்கைக்குப்பின் இறைமறுப்பு மட்டுமே உள்ளது.44 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7115,
			"arabicnumber": 7115,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒரு மனிதர் மற்றொரு மனிதரின் மண்ணறையை (கப்றை)க் கடந்து செல்லும் போது, “அந்தோ! நான் இவரது இடத்தில் (மண்ணறைக்குள்) இருக்கக் கூடாதா?” என்று (ஏக்கத்துடன்) சொல்லும் காலம் வராத வரை மறுமை நாள் வராது.45 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7116,
			"arabicnumber": 7116,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ‘தவ்ஸ்’ குலப் பெண்களின் புட்டங்கள் ‘துல்கலஸா’ கடவுள் சிலையைச் சுற்றி அசையாத வரை மறுமை நாள் வராது. ‘துல்கலஸா’ என்பது அறியாமைக் காலத்தில் தவ்ஸ் குலத்தார் வழிபட்டு வந்த ஒரு சிலையாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.46 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7117,
			"arabicnumber": 7117,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ‘கஹ்தான்’ குலத்திலிருந்து ஒரு மனிதர் தோன்றி, தமது கைத்தடியால் மக்களை ஓட்டிச்செல்லாத வரை மறுமை நாள் வராது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.47 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7118,
			"arabicnumber": 7118,
			"text": "அல்லாஹவின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஹிஜாஸ் பகுதியிலிருந்து ஒரு நெருப்பு கிளம்பி, (ஷாம் நாட்டின்) புஸ்ரா (ஹவ்ரான்) எனும் ஊரிலுள்ள ஒட்டகங்களின் பிடரிகளைப் பிரகாசிக்கச் செய்யாத வரை மறுமை நாள் வராது.49 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7119,
			"arabicnumber": 7119,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (மேற்காசியாவில் பாயும்) யூப்ரட்டீஸ் நதியானது தங்கப் புதையல் ஒன்றை வெளிப்படுத்த உள்ளது. அப்போது அங்கிருப்பவர்கள் அதிலிருந்து எதையும் எடுத்துவிட வேண்டாம். அறிவிப்பாளர்களில் ஒருவரான உக்பா பின் காலித் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நபி (ஸல்) அவர்களிடமிருந்து அபூஹுரைரா (ரலி) அவர்கள் அறிவித் துள்ள இந்த ஹதீஸ் மற்றொரு வழியாக வும் அறிவிக்கப்பட்டுள்ளது. ஆனால், அதில் “தங்கமலை ஒன்றை வெளிப்படுத் தவுள்ளது” என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7120,
			"arabicnumber": 7120,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (இப்போதே) தானதர்மம் செய்து கொள்ளுங்கள். ஏனெனில், மக்களுக்கு ஒரு காலம் வரும்; அப்போது ஒருவர் தமது தர்மப் பொருளை எடுத்துக் கொண்டு (அதைப் பெறுபவரைத் தேடி) நடந்துசெல்வார். ஆனால், அதை ஏற்பவர் எவரையும் காணமாட்டார். இதை ஹாரிஸா பின் வஹ்ப் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.50 அபூஅப்தில்லாஹ் (புகாரீ) கூறுகிறேன்: அறிவிப்பாளர் ஹாரிஸா (ரஹ்) அவர்கள், உபைதுல்லாஹ் பின் உமர் (ரலி) அவர்களின் தாய்வழிச் சகோதரர் ஆவார். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7121,
			"arabicnumber": 7121,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரு பெரும் குழுக்களிடையே பெரும் போர் ஏற்பட்டு அவை ஒன்றோ டொன்று சண்டையிட்டுக்கொள்ளாத வரை மறுமை நாள் வராது. அவ்விரு குழுக்கள் முன்வைக்கும் வாதமும் ஒன்றாகவே இருக்கும்.51 மேலும், ஏறத்தாழ முப்பது பெரும் பொய்யர்களான தஜ்ஜால்கள் (உலகில்) தோன்றாத வரை மறுமை நாள் வராது. அவர்களில் ஒவ்வொருவனும் தன்னை இறைத்தூதர் என்று வாதிடுவான்.52 மேலும், (கல்வியாளர்களின் மறைவால்) கல்வி கைப்பற்றப்பட்டு, நிலநடுக்கங்கள் அதிகமாகி, காலம் சுருங்கி, குழப்பங்கள் தோன்றி, கொலை பெருகாதவரை மறுமை நாள் வராது..53 மேலும், உங்களிடையே செல்வம் பெருகிக் கொழிக்காத வரை மறுமை நாள் வராது. அப்போது செல்வன் தனது தர்மத்தை ஏற்பவர் யாரேனும் கிடைக்கமாட்டாரா என்று கவலைப்படுவான். அவன் அதை எடுத்து ஒருவருக்குக் கொடுக்க முனையும்போது, இது தமக்குத் தேவையில்லை என்று அவர் சொல்லிவிடுவார்..54 மேலும், மக்கள் கட்டடங்களை (போட்டி போட்டுக்கொண்டு) உயரமாகக் கட்டாத வரை மறுமை நாள் வராது. மேலும், ஒரு மனிதன் மற்றொரு மனிதனின் மண்ணறையைக் கடந்துசெல்லும்போது, ‘அந்தோ! நான் இவனுடைய இடத்தில் (மண்ணறைக்குள்) இருக்கக் கூடாதா?’ என்று (ஏக்கத்துடன்) கூறாத வரை மறுமை நாள் வராது..55 சூரியன் மேற்குத் திசையிலிருந்து உதயமாகாத வரை மறுமை நாள் வராது. அவ்வாறு உதயமாகும்போது அதைக் காணும் மக்கள் அனைவரும் இறைநம்பிக்கை கொள்வார்கள். ஆனால், அதற்கு முன்பே இறை நம்பிக்கை கொள்ளாத, அல்லது இறை நம்பிக்கை கொண்டும் (அதை மெய்ப்பிக்கும் வகையில்) நற்செயல் எதுவும் புரியாத எந்த மனிதனும் அப்போது நம்பிக்கை கொள்வது அவனுக்குப் பயனளிக்காத நேரமாக அது இருக்கும்.56 இரண்டு பேர் தங்களுக்கு முன்னே தங்கள் துணிகளை (வியாபாரத்திற்காக) விரித்துவைப்பார்கள். அந்தத் துணியை வியாபாரம் செய்திருக்கவுமாட்டார்கள்; அதைச் சுருட்டி வைத்திருக்கவுமாட்டார்கள்; அதற்குள் மறுமை நாள் வந்துவிடும். ஒருவர் தமது ஒட்டகத்தின் பாலைக் (கறந்து எடுத்துக்)கொண்டு அப்போதுதான் திரும்பியிருப்பார்; அதை அவர் அருந்தியிருக்கவுமாட்டார். அதற்குள் மறுமை நாள் வந்துவிடும். ஒருவர் தமது தடாகத்தை அப்போதுதான் செப்பனிட்டிருப்பார்; அதிலிருந்து அவர் (தம் கால்நடைகளுக்கு) நீர் புகட்டியிருக்கவுமாட்டார். அதற்குள் மறுமை நாள் வந்துவிடும். ஒருவர் தமது உணவைத் தம் வாயருகே கொண்டுசென்றிருப்பார்; ஆனால், இன்னும் அதை உண்டிருக்கமாட்டார்; அதற்குள் மறுமை நாள் வந்துவிடும். (அந்த அளவுக்குத் திடீரென உலக அழிவுநாள் ஏற்படும்.) இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7122,
			"arabicnumber": 7122,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் தஜ்ஜாலைக் குறித்து நான் வினவியதைவிட அதிக மாக வேறெவரும் வினவியதில்லை. மேலும், அவர்கள் என்னிடம், “அவனால் உமக்கென்ன தீங்கு?” என்று கேட்டார்கள். நான், “(அச்சம்தான்.) ஏனெனில், தஜ்ஜாலு டன் மலையளவு ரொட்டியும் நதியளவு நீரும் இருக்கும் என்று மக்கள் கூறுகிறார்கள்” என்று சொன்னேன். நபி (ஸல்) அவர்கள், “இது என்ன (பிரமாதம்)? (அவன்மூலம் அல்லாஹ் எதையெல்லாம் காட்டவிருக்கின்றானோ) அதைவிட இது அல்லாஹ்வுக்கு மிகவும் சுலபமானதே” என்று சொன்னார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7123,
			"arabicnumber": 7123,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: இப்னு உமர் (ரலி) அவர்கள், “(தஜ்ஜால்) (ஒரே குலையில்) துருத்திக் கொண்டிருக்கும் திராட்சையைப் போன்று வலக் கண் குருடானவனாக இருப்பான்” என்று சொன்னார்கள். இதை அவர்கள் நபி (ஸல்) அவர்களிட மிருந்து கேட்டுச் சொன்னதாகவே நான் கருதுகின்றேன்.58 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7124,
			"arabicnumber": 7124,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: தஜ்ஜால் வருவான்; வந்து மதீனாவின் ஓர் ஓரத்தில் இறங்குவான். பிறகு மதீனா மும்முறை குலுங்கும். உடனே ஒவ்வோர் இறைமறுப்பாளனும் நயவஞ்சகனும் அவனை நோக்கிப் புறப்படுவார்கள். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.59 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7125,
			"arabicnumber": 7125,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மஸீஹுத் தஜ்ஜாலைக் குறித்த அச்சம் மதீனாவிற்குள் நுழையாது. அந்த நாளில் மதீனாவுக்கு ஏழு நுழைவாயில்கள் இருக்கும். ஒவ்வொரு நுழைவாயிலிலும் இரண்டு வானவர்கள் (காவல் காப்பதற்காக நியமிக்கப்பட்டு) இருப்பார்கள். இதை அபூபக்ரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.60 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7126,
			"arabicnumber": 7126,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மதீனாவிற்குள் மஸீஹுத் தஜ்ஜால் குறித்த அச்சம் புகாது. அந்நாளில் மதீனாவிற்கு ஏழு நுழைவாயில்கள் இருக்கும். ஒவ்வொரு நுழைவாயிலிலும் இரண்டு வானவர்கள் (காவல் காப்பதற்காக நியமிக்கப்பட்டு) இருப்பார்கள். இதை அபூபக்ரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில் இப்ராஹீம் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் (இராக்கிலுள்ள) பஸ்ரா சென்றேன். (அங்கு) அபூபக்ரா (ரலி) அவர்கள் இந்த ஹதீஸை எனக்கு அறிவித்தார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7127,
			"arabicnumber": 7127,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களிடையே எழுந்து நின்று அல்லாஹ்வை அவனுடைய தகுதிக்கேற்ப போற்றியபின் தஜ்ஜாலைப் பற்றிக் குறிப்பிட்டார்கள். அப்போது, “நான் உங்களை அவனைப் பற்றி அச்சுறுத்தி எச்சரிக்கின்றேன். இறைத்தூதர் எவரும் அவனைக் குறித்து தம் சமுதாயத்தாரை எச்சரிக்காமல் இருந்ததில்லை. ஆயினும், எந்த இறைத்தூதரும் அவனைக் குறித்து தம் சமுதாயத்தாருக்குத் தெரிவிக்காத ஒரு தகவலை நான் உங்களுக்குச் சொல்வேன்: அவன் ஒற்றைக் கண்ணன் ஆவான்; நிச்சயமாக அல்லாஹ் ஒற்றைக் கண்ணன் அல்லன்” என்று சொன்னார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7128,
			"arabicnumber": 7128,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (ஒருநாள்) நான் உறங்கிக்கொண்டி ருந்தபோது நான் கஅபாவைச் சுற்றி (தவாஃப்) வந்துகொண்டிருப்பதாக (கனவில்) கண்டேன். அப்போது மா நிறமான படிந்த தலைமுடியுடைய மனிதர் ஒருவரின் தலையிலிருந்து ‘தண்ணீர் சொட்டிக்கொண்டிருக்க’ அல்லது ‘சிந்திக்கொண்டிருக்க’க் கண்டேன். “இவர் யார்?” என்று கேட்டேன். “மர்யமின் மைந்தர் (ஈசா)” என்று சொன்னார்கள். பிறகு நான் திரும்பிப் பார்த்தபடியே சென்றபோது (ஒரே குலையில்) துருத்திக்கொண்டிருக்கும் திராட்சை போன்று ஒரு கண் குருடான, சுருட்டைத் தலைமுடியுடைய, சிவப்பான, பருமனான மனிதன் ஒருவன் அங்கிருந்தான். “இவன்தான் தஜ்ஜால்; மக்களில் இவனுக்கு உருவ அமைப்பில் ஒப்பானவன் ‘இப்னு கத்தன்’ எனும் குஸாஆ குலத்து மனிதன் ஆவான்” என்று சொன்னார்கள். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.61 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7129,
			"arabicnumber": 7129,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது தொழுகையில் தஜ்ஜாலின் குழப்பத்திலிருந்து (அல்லாஹ்விடம்) பாதுகாப்புக் கோருவதை நான் கேட்டி ருக்கிறேன்.62 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7130,
			"arabicnumber": 7130,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: தஜ்ஜாலைப் பற்றி நபி (ஸல்) அவர்கள் குறிப்பிடும்போது, “அவனுடன் நீரும் நெருப்பும் இருக்கும். அவனுடன் உள்ள நெருப்பு (உண்மையில்) குளிர்ந்த நீராகவும், அவனுடன் உள்ள நீர் (உண்மையில்) நெருப்பாகவும் இருக்கும்” என்று சொன்னார்கள்.63 அபூமஸ்ஊத் (ரலி) அவர்களும், “நான் இந்த ஹதீஸை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்றிருக்கிறேன்” என்று கூறியுள்ளார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7131,
			"arabicnumber": 7131,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைவனால் அனுப்பிவைக்கப் பெற்ற எந்த ஓர் இறைத்தூதரும் தம் சமுதாயத்தாரை மகா பொய்யனான ஒற்றைக் கண்ணன் (தஜ்ஜால்) குறித்து எச்சரிக்காமல் இருந்ததில்லை. அறிந்து கொள்ளுங்கள்: அவன் ஒற்றைக் கண்ணன் ஆவான். (ஆனால்,) நிச்சயமாக, உங்கள் இறைவன் ஒற்றைக் கண்ணன் அல்லன். அந்தப் பொய்யனுடைய இரு கண்களுக்கிடையே ‘காஃபிர்’ (இறைமறுப்பாளன்) என்று எழுதப்பட்டிருக்கும். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இதே கருத்தில் அபூஹுரைரா (ரலி) அவர்களும் இப்னு அப்பாஸ் (ரலி) அவர்களும் நபி (ஸல்) அவர்களிடமிருந்து அறிவித்துள்ளனர். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7132,
			"arabicnumber": 7132,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒருநாள் தஜ்ஜாலைக் குறித்து நீண்ட ஹதீஸ் ஒன்றை அறிவித்தார்கள். அவனைப் பற்றி எங்களுக்கு நபி (ஸல்) அவர்கள் அறிவித்தவற்றில் இவையும் அடங்கும்: மதீனாவின் தெருக்களில் நுழைவது தடை செய்யப்பட்டிருக்கும் நிலையில் தஜ்ஜால் வருவான். மதீனாவையடுத்து (ஷாம் நாட்டுத் திசையில்) உள்ள உவர் நிலம் ஒன்றில் அவன் தங்குவான். அந்த நாளில் ‘மக்களிலேயே சிறந்தவரான ஒரு மனிதர்’ அல்லது ‘மக்களிலேயே சிறந்தவர்களில் ஒரு மனிதர்’ அவனிடம் புறப்பட்டுச் சென்று, “எவனது செய்தியை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு முன்னறிவிப்புச் செய்தார் களோ அந்த தஜ்ஜால் நீதான் என்று நான் உறுதிகூறுகிறேன்” என்று கூறுவார். அப்போது தஜ்ஜால், “நான் இவரைக் கொன்று பிறகு உயிராக்கிவிட்டால் அப்போதுமா (நான் இறைவன்தான் எனும்) விஷயத்தில் சந்தேகம்கொள்வீர்கள்?” என்று (தம்முடன் உள்ளவர்களிடம்) கேட்பான். மக்கள் “இல்லை” என்று பதிலளிப்பார்கள். உடனே அவன் அம்மனிதரைக் கொன்று பிறகு உயிராக்கிவிடுவான். உடனே, அந்த மனிதர், “அல்லாஹ்வின் மீதாணையாக! நான் இன்று உன்னை அறிந்துகொண்டதைவிட நன்றாக வேறு எப்போதும் அறிந்துகொண்டதில்லை” என்று சொல்வார். உடனே தஜ்ஜால் அந்த மனிதரைக் கொன்றுவிட விரும்புவான். ஆனால், அவர்மீது அவனுக்கு ஆதிக்கம் வழங்கப்படாது.64 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7133,
			"arabicnumber": 7133,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மதீனாவின் தெருக்களில் வானவர்கள் (காவலுக்கு) இருப்பார்கள். அதில் கொள்ளை நோய் நுழையாது; தஜ்ஜாலும் நுழையமாட்டான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.65 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7134,
			"arabicnumber": 7134,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: மதீனா நகருக்கு தஜ்ஜால் வருவான். அதை வானவர்கள் காவல் காத்துக் கொண்டிருப்பதைக் காண்பான். ஆகவே, அதை தஜ்ஜால் நெருங்கமாட்டான்; அல்லாஹ் நாடினால் கொள்ளைநோயும் அணுகாது. இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7135,
			"arabicnumber": 7135,
			"text": "ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்கள் கூறியதாவது: ஒருநாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நடுக்கத்துடன் என்னிடம் வந்து, “அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை; நெருங்கிவிட்ட ஒரு தீமையின் காரணத்தால் அரபியருக்குக் கேடு நேரவிருக்கிறது. யஃஜூஜ், மஃஜூஜ் கூட்டத்தாரின் தடுப்புச் சுவரிலிருந்து இந்த அளவுக்கு இன்று திறக்கப்பட்டுள்ளது” என்று சொல்லி, தமது கட்டை விரலையும் அதற்கடுத்த விரலையும் வளையமிட்டுக் காட்டினார்கள். நான், “அல்லாஹ்வின் தூதரே! எங்களிடையே நல்லவர்கள் இருக்க, நாங்கள் அழிந்துபோவோமா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “ஆம்; தீமை பெருகிவிடும்போது” என்று சொன்னார்கள்.67 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7136,
			"arabicnumber": 7136,
			"text": "நபி (ஸல்) அவர்கள் கூறி னார்கள்: யஃஜூஜ் மற்றும் மஃஜூஜ் கூட்டத்தாரின் தடுப்புச் சுவர் இந்த அளவுக்குத் திறக்கப்படுகின்றது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அறிவிப்பாளர்களில் ஒருவரான வுஹைப் பின் காலித் (ரஹ்) அவர்கள் (அரபு எண்) தொண்ணூறு என்பதைப் போன்று (விரல்களை) மடித்துக் காட்டினார்கள்.68 அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 83
			}
		}
	]
}