{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"94": "Wishes"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7226,
			"arabicnumber": 7226,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: என் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! என்னுடன் (அறப்போரில்) கலந்துகொள்ளாமல் பின்தங்கிவிடுவதைப் பலரும் விரும்ப மாட்டார்கள்; (அதே நேரத்தில்) அவர்கள் அனைவரையும் ஏற்றிச் செல்வ தற்கு என்னிடம் வாகன வசதி கிடையாது. இந்நிலை மட்டும் இல்லாதிருப்பின், நான் (எந்தப் போரிலும்) கலந்துகொள்ளாமல் பின்தங்கியிருக்கமாட்டேன். (ஒன்றுவிடாமல் அனைத்திலும் கலந்து கொண்டிருப்பேன்.) நான் அல்லாஹ்வின் பாதையில் கொல்லப்பட்டுப் பிறகு உயிர் கொடுக்கப்பட்டு, மீண்டும் கொல்லப் பட்டு மீண்டும் உயிர் கொடுக்கப்பட்டு, மீண்டும் கொல்லப்பட்டு மீண்டும் உயிர் கொடுக்கப்பட்டு, மறுபடியும் கொல்லப் படுவதையே நான் விரும்புகிறேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.2 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7227,
			"arabicnumber": 7227,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: என் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! நான் அல்லாஹ்வின் பாதையில் போரிட்டுக் கொல்லப் பட்டுப் பிறகு உயிர் கொடுக்கப்பட்டு, பிறகு கொல்லப்பட்டு மீண்டும் உயிர் கொடுக்கப்பட்டு, மறுபடியும் கொல்லப்படுவதையே விரும்புகிறேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அறிவிப்பாளர்களில் ஒருவரான அஃரஜ் (ரஹ்) அவர்கள் கூறினார்கள்: அபூஹுரைரா (ரலி) அவர்கள் இந்தச் சொற்களை மும்முறை கூறினார்கள் என்பதற்கு நான் அல்லாஹ்வை முன்வைத்து சாட்சியம் கூறுகிறேன். அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7228,
			"arabicnumber": 7228,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: என்னிடம் உஹுத் மலை அளவுக்குத் தங்கம் இருந்தாலும், அதிலிருந்து ஒரு பொற்காசு என்னிடம் (எஞ்சி) இருந்து அதைப் பெற்றுக்கொள்பவரை நான் அடையும் நிலையில் மூன்று நாட்கள் கழிவதைக்கூட நான் விரும்பமாட்டேன்; கடனை அடைப்பதற்காக நான் (அதிóருந்து) எடுத்துவைக்கும் சிறிதளவு (தங்கத்தைத்) தவிர. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7229,
			"arabicnumber": 7229,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நான் பின்னால் அறிந்துகொண்டதை முன்பே அறிந்திருந்தால் (என்னுடன்) குர்பானி பிராணியைக் கொண்டு வந்திருக்கமாட்டேன்; மேலும், மக்கள் இஹ்ராமிலிருந்து விடுபட்டபோதே நானும் (இஹ்ராமிலிருந்து) விடுபட்டிருப்பேன். இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7230,
			"arabicnumber": 7230,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (‘விடைபெறும்’ ஹஜ்ஜின்போது) நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் இருந்தோம். அப்போது நாங்கள் ஹஜ்ஜுக்காக (இஹ்ராம் கட்டி) ‘தல்பியா’ சொன்னோம். துல்ஹிஜ்ஜா மாதம் நான்காம் நாள் நாங்கள் மக்கா வந்தோம். அப்போது நபி (ஸல்) அவர்கள், “இறையில்லம் கஅபாவையும் ஸஃபா-மர்வாவையும் சுற்றி (தவாஃபும் சஃயும் செய்து)விட்டு, தம்முடன் குர்பானி பிராணி கொண்டுவந்தவர்களைத் தவிர மற்றவர்கள் அந்த ஹஜ்ஜை உம்ராவாக ஆக்கி, இஹ்ராமிóருந்து விடுபட்டுக்கொள்ளுமாறு உத்தர விட்டார்கள். நபி (ஸல்) அவர்களையும் தல்ஹா (ரலி) அவர்களையும் தவிர எங்களில் வேறு யாரிடமும் குர்பானி பிராணி இருக்கவில்லை. அலீ (ரலி) அவர்கள் குர்பானி பிராணியுடன் யமன் நாட்டி óருந்து வந்தார்கள். “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஹஜ்-உம்ரா ஆகிய இரண்டில்) எதற்காக இஹ்ராம் கட்டினார்களோ அதற்காக நானும் இஹ்ராம் கட்டினேன்” என அவர்கள் கூறினார்கள். அப்போது மக்கள் (சிலர்), “தாம்பத்திய உறவு கொண்ட கையோடு நாங்கள் ‘மினா’விற்குச் செல்ல வேண்டுமா?” என்று கேட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “(ஹஜ் பருவத்தில் உம்ரா செய்யலாம் என) நான் இப்போது அறிந்ததை முன்கூட்டியே அறிந்திருந்தால் (பலியிட) குர்பானி பிராணி கொண்டுவந்திருக்கமாட்டேன்; நான் என்னுடன் குர்பானி பிராணியை கொண்டுவந்திருக்காவிடில் இஹ்ராமிலிருந்து நான் விடுபட்டிருப்பேன்” என்று கூறினார்கள். (இதையடுத்து) ஜம்ரத்துல் அகபாவில் நபி (ஸல்) அவர்கள் கல்லெறிந்து கொண்டிருக்கையில் அவர்களை சுராக்கா பின் மாலிக் (ரலி) அவர்கள் சந்தித்து, “அல்லாஹ்வின் தூதரே! இ(வ்வாறு ஹஜ்ஜை உம்ராவாக மாற்றிக்கொள்வ)து, எங்களுக்கு மட்டும் உரியதா? (எல்லாத் தலைமுறையினருக்கும் பொதுவானதா)” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “இல்லை! எல்லாக் காலத்து (மக்களு)க் கும் உரியது” என்று பதிலளித்தார்கள். ஆயிஷா (ரலி) அவர்கள் மாத விடாயோடு மக்காவிற்கு நபி (ஸல்) அவர்களுடன் வந்திருந்தார்கள். “ஹஜ்ஜுக் கிரியைகள் அனைத்தையும் செய்யலாம்; ஆனால், மாதவிடாயிலிருந்து தூய்மையடையும்வரை இறையில்லத்தைச் சுற்றி (தவாஃப்) வரக் கூடாது; தொழக் கூடாது” என்று ஆயிஷாவுக்கு நபி (ஸல்) அவர்கள் கட்டளையிட்டார்கள். நபியவர்களும் மக்களும் ‘அல்பத்ஹா’ எனும் இடத்தில் தங்கியபோது ஆயிஷா (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! நீங்கள் (எல்லாரும்) ஹஜ்ஜையும் உம்ராவையும் நிறைவேற்றிச் செல்ல, நான் ஹஜ்ஜை மட்டும் நிறைவேற்றிச் செல்வதா?” என்று (மனக்குறையுடன்) கேட்டார்கள். ஆகவே, நபி (ஸல்) அவர்கள் அப்துர் ரஹ்மான் பின் அபீபக்ர் (ரலி) அவர்களை(த் தம் சகோதரி) ஆயிஷா (ரலி) அவர்களுடன் ‘தன்யீம்’ என்ற இடத்திற்குச் செல்லுமாறு கட்டளையிட்டார்கள். அப்போது ஆயிஷா (ரலி) அவர்கள் (அங்கு சென்று உம்ராவிற்காக இஹ்ராம் கட்டிக்கொண்டு) துல்ஹிஜ்ஜா மாதத்தில் ஹஜ் நாட்கள் கழிந்தபின் ஓர் உம்ராவை நிறைவேற்றினார்கள்.5 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7231,
			"arabicnumber": 7231,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மதீனாவுக்கு வந்த புதிதில்) ஓர் இரவில் கண் விழித்திருந்தார்கள். பின்னர் (ஒருநாள்), “என்னை இரவில் காவல் காப்பதற்கு என் தோழர்களில் ஏற்ற ஒருவர் வேண்டுமே?” என்று கூறினார்கள், அப்போது நாங்கள் ஆயுதத்தின் ஓசையைக் கேட்டோம். நபி (ஸல்) அவர்கள், “யார் அங்கே?” என்று கேட்டார்கள். வந்தவர், “நான்தான் சஅத், அல்லாஹ்வின் தூதரே! தங்களைக் காவல் காப்பதற்காக வந்தேன்” என்று கூறினார். பிறகு நபி (ஸல்) அவர்கள், நாங்கள் அவர்களின் குறட்டைச் சப்தத்தை கேட்குமளவுக்கு (நிம்மதியாக) உறங்கி னார்கள்.7 அபூஅப்தில்லாஹ் (புகாரீ) கூறுகின் றேன்: பிலால் (ரலி) அவர்கள் (மதீனாவில் காய்ச்சல்கண்டு நிவாரணமடைந்த போது), ‘இத்கிர்’ (நறுமணப்) புல்லும்’ஜலீல்’ (கூரைப்) புல்லும்என்னைச் சூழ்ந்திருக்க ...(மக்காவின்) பள்ளத்தாக்கில்ஓர் இராப் பொழுதையேனும்நான் கழிப்பேனா?” என்ற கவிதையைக் கூறினார்கள். அதை நான் நபி (ஸல்) அவர்களிடம் தெரிவித்தேன் என ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.8 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7232,
			"arabicnumber": 7232,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரண்டு விஷயங்களைத் தவிர வேறெதற்காகவும் பொறாமைப்படலாகாது: 1. ஒரு மனிதருக்கு அல்லாஹ் குர்ஆனின் அறிவை வழங்கினான். அவர் அதைக் காலையும் மாலையும் ஓதிவருகிறார். (இதைக் கண்ட) மற்றொருவர், “இவருக்குக் கொடுக்கப்பட்டதைப் போன்று எனக்கும் கொடுக்கப்பட்டிருந்தால் இவர் செய்வதைப் போன்று நானும் செய்திருப்பேன்” என்று (ஆதங்கத்துடன்) சொல்கிறார். 2. மற்றொரு மனிதருக்கு அல்லாஹ் செல்வத்தை வழங்கினான். அவர் அதை உரிய வழியில் செலவிடுகிறார். (இதைக் காணும்) மற்றொருவர், “இவருக்குக் கொடுக்கப்பட்டதைப் போன்று எனக்கும் கொடுக்கப்பட்டிருந்தால் இவர் செய்வ தைப் போன்று நானும் செய்திருப்பேன்” என்று (ஆதங்கத்துடன்) சொல்கிறார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.9 -ஜரீர் பின் அப்தில் ஹமீத் (ரஹ்) அவர்களிடமிருந்து இந்த ஹதீஸை குதைபா (ரஹ்) அவர்களும் அறிவித்துள்ளார்கள். அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7233,
			"arabicnumber": 7233,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: “இறப்பை (எதிர்பார்த்து) ஆசைப் படாதீர்கள்” என நபி (ஸல்) அவர்கள் கூறியதை நான் செவியுற்றிருக்காவிட்டால், (இறப்பின் மீது) ஆசைகொண்டிருப் பேன். இதை நள்ர் பின் அனஸ் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7234,
			"arabicnumber": 7234,
			"text": "கைஸ் பின் அபீஹாஸிம் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் கப்பாப் பின் அல்அரத் (ரலி) அவர்களை உடல்நலம் விசாரிக்கச் சென்றோம். (கடும் வயிற்று வலிக்கு சிகிச்சை பெறுவதற்காகத் தமது வயிற்றில்) அவர்கள் ஏழு முறை சூடுபோட்டி ருந்தார்கள். அப்போது அவர்கள், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மரணத்தை வேண்டிப் பிரார்த்தனை செய்ய வேண்டாமென எங்களுக்குத் தடை விதித்திருக்காவிட்டால், அதை வேண்டி நான் பிரார்த்தனை புரிந்திருப்பேன்” என்று சொன்னார்கள்.10 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7235,
			"arabicnumber": 7235,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் எவரும் மரணத்தை விரும்ப வேண்டாம். ஒன்று அவர் நல்லவராக இருப்பார்; (அவர் உயிர்வாழ்வதன் மூலம் நன்மையை) அவர் அதிகமாக்கிக் கொள்ளலாம். அல்லது அவர் தீயவராக இருப்பார்; அவர் (உயிர்வாழ்வதால்) மனம் திருந்தக்கூடும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.11 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7236,
			"arabicnumber": 7236,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: அகழ்ப் போரின்போது எங்களுடன் நபி (ஸல்) அவர்களும் மண்ணைச் சுமந்து எடுத்துவந்தார்கள். அவர்கள் (சுமந்துவந்த) மண் அவர்களது வயிற்றின் வெண்மையை மறைத்திருந்ததை நான் பார்த்தேன். அப்போது அவர்கள், “(இறைவா!) நீ இல்லாவிட்டால்நாங்கள் நல்வழி அடைந்திருக்கமாட்டோம்.நாங்கள் தர்மம் செய்யதிருக்கவுமாட்டோம்;தொழுதிருக்கவுமாட்டோம்.ஆகவே, எங்கள்மீது அமைதியை இறக்கியருள்வாயாக! ‘இவர்கள்’ அல்லது ‘(குறைஷித்) தலைவர்கள்’ எங்கள்மீது அக்கிரமம் புரிந்துவிட்டார்கள். இவர்கள் எங்களைச் சோதனையில் ஆழ்த்த விரும்பினால் அதற்கு நாங்கள் இடமளிக்கமாட்டோம்” என்று (இறுதி வரியைக்) குரலை உயர்த்தி (பாடலில்) கூறினார்கள்.12 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7237,
			"arabicnumber": 7237,
			"text": "உமர் பின் உபைதில்லாஹ் (ரஹ்) அவர்களிடம் எழுத்தராகப் பணி புரிந்தவரும் அவர்களால் விடுதலை செய்யப்பட்ட அடிமையுமான அபுந் நள்ர் சாலிம் (ரஹ்) அவர்கள் கூறியதாவது: உமர் பின் உபைதில்லாஹ் (ரஹ்) அவர்களுக்கு அப்துல்லாஹ் பின் அபீஅவ்ஃபா (ரலி) அவர்கள் கடிதம் எழுதியிருந்தார்கள். நான் அதை (அவர்களுக்கு)ப் படித்துக்காட்டினேன். அதில், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், எதிரிகளை(ப் போர்க் களத்தில்) சந்திக்க ஆசைப்படாதீர்கள். அல்லாஹ்விடம் (போர் அழிவுகளிலிருந்து) பாதுகாப்புக் கோருங்கள். என்று சொன்னார்கள்” என்றிருந்தது.14 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7238,
			"arabicnumber": 7238,
			"text": "காசிம் பின் முஹம்மத் (ரஹ்) அவர்கள் கூறியதாவது: இப்னு அப்பாஸ் (ரலி) அவர்கள் சாப அழைப்புப் பிரமாணம் (‘லிஆன்’) செய்த ஒரு தம்பதியரைக் பற்றிக் குறிப்பிட்டார் கள். உடனே அப்துல்லாஹ் பின் ஷத்தாத் (ரஹ்) அவர்கள், “நான் சாட்சி இல்லாமலேயே ஒரு பெண்ணுக்குக் கல்லெறி தண்டனை அளிப்பவனா யிருந்தால் (இவளுக்கு அளித்திருப் பேன்)” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியது இந்தப் பெண் குறித்தா? என்று கேட்டார்கள். அதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள், “இல்லை; அவள் வெளிப்படையாகவே தவறு செய்துவந்தவள்” என்று கூறினார்கள்.16 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7239,
			"arabicnumber": 7239,
			"text": "அதாஉ பின் அபீரபாஹ் (ரஹ்) அவர்கள் கூறியதாவது: (ஒருநாள்) நபி (ஸல்) அவர்கள் இஷா தொழுகையை (எப்போதும் தொழும் நேரத்தைவிட)த் தாமதப்படுத்தினார்கள். அப்போது உமர் (ரலி) அவர்கள் வந்து, “தொழுகைக்கு வாருங்கள், அல்லாஹ்வின் தூதரே! பெண்களும் குழந்தைகளும் உறங்கிவிட்டார்கள்” என்று சொன்னார்கள். அப்போது நபி (ஸல்) அவர்கள் தமது தலையில் நீர் சொட்டிக்கொண்டிருக்க வெளியே வந்து, “‘என் சமுதாயத்தாருக்கு’ அல்லது ‘மக்களுக்கு’ச் சிரமம் ஏற்படும் என்று நான் கருதியிராவிட்டால், (இஷா) தொழுகையை இந்த (இருள் கப்பிய) நேரத்தில்தான் தொழ வேண்டும் என்று அவர்களுக்கு நான் உத்தரவிட்டிருப்பேன்” என்று கூறினார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இந்த (இஷா) தொழுகையைத் தாமதப்படுத்தினார்கள். அப்போது உமர் (ரலி) அவர்கள் வந்து, “அல்லாஹ்வின் தூதரே! பெண்களும் குழந்தைகளும் தூங்கிவிட்டார்கள்” என்று சொல்ல, நபி (ஸல்) அவர்கள் தமது விலாவிலிருந்து வழியும் தண்ணீரைத் துடைத்தபடி, “என் சமுதாயத்தாருக்குச் சிரமம் ஏற்படும் என்று நான் கருதியிரா விட்டால், (இஷா தொழுகைக்கு) இதுதான் சரியான நேரம் (என்று சொல்லியிருப்பேன்)” என்று சொன்னார்கள்.17 அதாஉ (ரஹ்) அவர்கள் அறிவித்ததாக அம்ர் பின் தீனார் (ரஹ்) அவர்களின் அறிவிப்பு ஒன்றும் உள்ளது. அதன் அறிவிப்பாளர்தொடரில் இப்னு அப்பாஸ் (ரலி) அவர்கள் இடம்பெறவில்லை. இந்த ஹதீஸ் சிற்சில வாசக மாற்றங்களுடன் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7240,
			"arabicnumber": 7240,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: என் சமுதாயத்தாருக்குச் சிரமம் ஏற்படும் என்று நான் கருதியிரா விட்டால், (எல்லாத் தொழுகைகளிலும் கட்டாயமாகப்) பல் துலக்கும்படி (மிஸ்வாக் செய்யும்படி) மக்களுக்கு நான் கட்டளையிட்டிருப்பேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7241,
			"arabicnumber": 7241,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ரமளான்) மாதக் கடைசியில் தொடர்நோன்பு நோற்றார் கள். (இதைக் கண்டு) மக்கள் சிலரும் தொடர்நோன்பு நோற்றார்கள். இந்த விஷயம் நபி (ஸல்) அவர்களுக்கு எட்டியபோது அவர்கள், “எனக்கு (மட்டும்) இந்த மாதம் (எத்தனை நாட்கள்) நீட்டிக்கப்பட்டாலும் என்னால் தொடர்நோன்பு நோற்க முடியும். அப்போது (என்னைப் பார்த்து தொடர் நோன்பு நோற்று, வணக்க வழிபாடுகளில்) மிதமிஞ்சி ஈடுபடுபவர்கள் தங்களது போக்கைக் கைவிட வேண்டியது வரும். நான், உங்களைப் போன்றவன் அல்லன். எனக்கு என் இறைவன் உண்ணவும் பருகவும் கொடுக்கும் நிலையில் நான் உள்ளேன்” என்று சொன்னார்கள்.18 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7242,
			"arabicnumber": 7242,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொடர்நோன்பு நோற்க வேண்டாம் என்று தடை விதித்தார்கள். மக்கள், “நீங்கள் தொடர்நோன்பு நோற்கிறீர்களே?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “உங்களில் யார் என்னைப் போல் இருக்கிறார்? எனக்கு என் இறைவன் உண்ணவும் பருகவும் கொடுக்கின்ற நிலையில் நான் உள்ளேன்” என்று பதிலளித்தார்கள். மக்கள் (தொடர்நோன்பைக்) கைவிட மறுத்தபோது அவர்களுடன் சேர்ந்து ஒருநாளும் அதன்பிறகு ஒரு நாளும் நபியவர்கள் தொடர்நோன்பு நோற்றார்கள். அதற்குள் (அடுத்த) மாதப் பிறையைக் கண்டார்கள். அப்போது “பிறை இன்னும் தள்ளிப்போயிருந்தால், உங்களை இன்னும் (தொடர்நோன்பை) அதிகமாக்க வைத்திருப்பேன்” என்று -அவர்களைக் கண்டிப்பவர்களைப் போன்று- சொன்னார்கள்.19 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7243,
			"arabicnumber": 7243,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் (ஒருமுறை) நபி (ஸல்) அவர்களிடம், (புனித கஅபாவை ஒட்டியுள்ள ஹத்தீம் எனும்) வளைந்த சுவரைப் பற்றி, “இது கஅபாவில் சேர்ந்ததா?” என்று கேட்டேன். அதற்கு அவர்கள், “ஆம்” என்று பதிலளித்தார்கள். நான், “அப்படி யானால் கஅபாவுடன் இதை அவர்கள் இணைக்காததற்குக் காரணமென்ன?” என்று கேட்டேன். அதற்கு அவர்கள், “உன் (குறைஷி) சமூகத்தாருக்குப் பொருளாதாரப் பற்றாக்குறை ஏற்பட்டிருந்தது” என்று பதிலளித்தார்கள். நான், “கஅபாவின் வாயிலை உயரமாக வைத்திருப்பதன் காரணம் என்ன?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “தாம் விரும்பியவர்களை உள்ளே அனுமதிப்பதற்காகவும் தாம் விரும்பாதவர்களை (உள்ளே நுழைய விடாமல்) தடுத்துவிடுவதற்காக வும்தான் உன் சமூகத்தார் இவ்வாறு செய்தார்கள். உன் சமுதாயத்தார் புதிதாக இஸ்லாத்தை ஏற்றவர்களாயிருப்பதால், அவர்களின் மனத்தில் வெறுப்பு தோன்றும் என்ற அச்சம் எனக்கு இல்லாவிட்டால், நான் இந்த வளைந்த சுவரை கஅபாவுடன் இணைத்து அதன் வாயிலை(க் கீழிறக்கி) பூமியுடன் சேர்ந்தாற்போன்று ஆக்கியிருப்பேன்” என்று சொன்னார்கள்.20 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7244,
			"arabicnumber": 7244,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஹிஜ்ரத் (மார்க்கத்திற்காகப் பிறந்தகத்தைத் துறந்து செல்வது) மட்டும் நடைபெறாமல் இருந்திருந் தால் நான் அன்சாரிகளில் ஒருவனாயிருந் திருப்பேன். மக்கள் ஒரு பள்ளத்தாக்கிலும் அன்சாரிகள் ‘வேறொரு பள்ளத்தாக்கிலும்’ அல்லது ‘மலைக் கணவாயிலும்’ நடந்து சென்றால் நான் அன்சாரிகளின் ‘பள்ளத்தாக்கு’ அல்லது ‘கணவாயில்’ தான் நடந்துசெல்வேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.21 அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7245,
			"arabicnumber": 7245,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஹிஜ்ரத் மட்டும் நடந்திராவிட்டால் நான் அன்சாரிகளில் ஒருவனாயிருந் திருப்பேன். மக்கள் ஒரு ‘பள்ளத்தாக்கில்’ அல்லது ‘கணவாயில்’ நடந்துசென்றால் நான் அன்சாரிகளின் பள்ளத்தாக்கிலும் கணவாயிலும்தான் நடந்துசெல்வேன். இதை அப்துல்லாஹ் பின் ஸைத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.22 இதே ஹதீஸ் அனஸ் (ரலி) அவர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 94",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 20
			}
		}
	]
}