{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7371,
			"arabicnumber": 7371,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் முஆத் பின் ஜபல் (ரலி) அவர்களை யமன் நாட்டுக்கு (நீதி நிர்வாகத்தைக் கவனிக்க) அனுப்பி வைத்தார்கள்.2 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7372,
			"arabicnumber": 7372,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் முஆத் பின் ஜபல் (ரலி) அவர்களை யமன் நாட்டுக்கு அனுப்பியபோது அவர்களிடம், “நீங்கள் வேதம் வழங்கப்பெற்ற ஒரு சமுதாயத்தாரிடம் செல்கிறீர்கள். ஆகவே, அவர்களுக்கு முதலாவதாக, அல்லாஹ் ஒருவன் எனும் (ஓரிறைக்) கொள் கையை ஏற்கும்படி அழைப்புக்கொடுங்கள். அதை அவர்கள் புரிந்து (ஏற்றுக்) கொண்டால், தினந்தோறும் ஐவேளைத் தொழுகைகளை அவர்கள்மீது அல்லாஹ் கடமையாக்கியுள்ளான் என்று அவர்களி டம் தெரிவியுங்கள். அவர்கள் (அதை ஏற்று) தொழவும் செய்தால், அவர்களிடையேயுள்ள செல்வர்களிடமிருந்து வசூலிக்கப்பட்டு அவர்களிடையேயுள்ள ஏழைகளுக்குச் செலுத்தப்படுகின்ற ஸகாத்தை அவர்களுடைய செல்வங்களில் அல்லாஹ் கடமையாக்கியுள்ளான் என்று அவர்களிடம் தெரிவியுங்கள். அதையும் அவர்கள் ஒப்புக்கொண்டால் அவர்களிட மிருந்து (ஸகாத்தை) வசூலித்துக்கொள்ளுங்கள். (ஆனால்,) மக்களின் செல்வங்களில் சிறந்தவற்றைத் தவிர்த்துவிடுங்கள்” என்று சொன்னார்கள்.3 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7373,
			"arabicnumber": 7373,
			"text": "முஆத் பின் ஜபல் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (என்னிடம்), “முஆதே! அடியார்கள்மீது அல்லாஹ்வுக் குள்ள உரிமை என்ன என்று உங்களுக் குத் தெரியுமா?” என்று கேட்டார்கள். நான், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கு அறிந்தவர்கள்” என்று சொன்னேன். நபி (ஸல்) அவர்கள், “அவர்கள் அவனையே வழிபடுவதும் அவனுக்கு எதையும் இணைகற்பிக்காமலிருப்பதும் ஆகும். (அவ்வாறு அவர்கள் செய்தால்) அவர்களுக்கு அல்லாஹ்வின் மீதுள்ள உரிமை என்ன என்று உங்களுக்குத் தெரியுமா?” என்று கேட்க, நான், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கு அறிந்தவர்கள்” என்று சொன்னேன். நபி (ஸல்) அவர்கள், “அவர்களை அவன் (மறுமையில்) வேதனை செய்யாமலிருப்பதுதான்” என்று பதிலளித்தார்கள்.4 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7374,
			"arabicnumber": 7374,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர், ‘குல் ஹுவல்லாஹு அஹத்’ (‘நபியே! கூறுக: அல்லாஹ் ஒருவனே’) எனும் (112ஆவது) அத்தியாயத்தைத் திரும்பத்திரும்ப ஓதிக்கொண்டிருந்ததை ஒருவர் செவிமடுத்தார். விடிந்ததும் அம்மனிதர் நபி (ஸல்) அவர்களிடம் சென்று அதைப் பற்றிக் கூறினார். அம்மனிதர் (பேசிய விதம்) அந்த அத்தியாயத்தை(த் திரும்பத் திரும்ப ஓதியதை)க் குறைத்து மதிப்பிட்டதைப் போன்றிருந்தது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “என் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! அந்த அத்தியாயம் குர்ஆனின் மூன்றில் ஒரு பகுதிக்குச் சமமானது” என்று சொன்னார்கள்.5 இதே ஹதீஸ் கத்தாதா பின் நுஅமான் (ரலி) அவர்கள் வாயிலாகவும் அறிவிக்கப் பட்டுள்ளது.6 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7375,
			"arabicnumber": 7375,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரு மனிதரை படைப்பிரிவொன்றுக்குத் தளபதியாக்கி அனுப்பினார்கள். அவர், தமது தொழுகை யில் தம் தோழர்களுக்கு (குர்ஆன் வசனங்களை) ஓதி (தொழுவித்து)வந்தார்; (ஒவ்வொரு முறையும்) ஓதி முடிக்கும் போது ‘குல் ஹுவல்லாஹு அஹத்’ எனும் (112ஆவது) அத்தியாயத்துடன் முடிப்பார். அப்படையினர் திரும்பிவந்தபோது நபி (ஸல்) அவர்களிடம் இதைப் பற்றி தெரிவித்தனர். அப்போது நபி (ஸல்) அவர்கள், “எதற்காக இப்படிச் செய்கிறார் என்று அவரிடமே கேளுங்கள்” என்று கூற, அவர்களும் அவரிடம் கேட்டனர். அவர், “ஏனெனில், அந்த அத்தியாயம் பேரருளாளனின் (ஓரிறைப்) பண்புகளை எடுத்துரைக்கின்றது. நான் அதை (அதிகமாக) ஓதுவதை விரும்புகின்றேன்” என்று சொன்னார். (இதைக் கேள்விப்பட்ட) நபி (ஸல்) அவர்கள், “அவரை அல்லாஹ் நேசிக்கிறான் என்று அவருக்குத் தெரிவியுங்கள்” என்று கூறினார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7376,
			"arabicnumber": 7376,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மனிதர்கள்மீது கருணைகாட்டாத வனுக்கு அல்லாஹ் கருணைகாட்ட மாட்டான். இதை ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.7 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7377,
			"arabicnumber": 7377,
			"text": "உசாமா பின் ஸைத் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களிடம் இருந்தோம். அப்போது அவர்களுடைய புதல்வியரில் ஒருவருடைய (ஸைனப் (ரலி) அவர்களுடைய) தூதுவர் அங்கு வந்தார். ஸைனப் உடைய புதல்வர் இறக்கும் தறுவாயில் இருப்பதாகச் சொல்லி, ஸைனப் அழைப்பதாகத் தெரிவித்தார். நபி (ஸல்) அவர்கள், “நீ ஸைனபிடம் சென்று, “அல்லாஹ் எடுத்துக் கொண்டதும் அவனுக்குரியதே! அவன் கொடுத்ததும் அவனுக்குரியதுதான். ஒவ்வொன்றுக்கும் அவனிடம் ஒரு குறிப்பிட்ட தவணை உண்டு. ஆகவே, (அல்லாஹ்விடம் அதற்கான) நன்மையை எதிர்பார்த்து பொறுமையாக இருக்கச்சொல்” என்று சொல்லி அனுப்பினார்கள். ஆனால், அவர்களுடைய புதல்வியார், (அல்லாஹ்வின் மீது) ஆணையிட்டுக் கண்டிப்பாக வரவேண்டுமெனச் சொல்லி தம் தூதுவரை மீண்டும் அனுப்பிவைத்தார். உடனே நபி (ஸல்) அவர்கள் (தம் புதல்வியின் வீட்டுக்குச் செல்ல) எழுந்தார்கள். அவர்களுடன் சேர்ந்து சஅத் பின் உபாதா (ரலி), முஆத் பின் ஜபல் (ரலி) ஆகியோரும் எழுந்தனர். (அங்கு சென்றவுடன்) நபி (ஸல்) அவர்களிடம் அக்குழந்தை தரப்பட்டது. அப்போது தோல் பைக்குள் உள்ள காற்றைப் போன்று அது (சுவாசிக்க முடியாமல்) மூச்சுத் திணறிக்கொண்டிருந்தது. அதைக் கண்ட நபி (ஸல்) அவர்களின் கண்கள் நீரைச் சொரிந்தன. அப்போது சஅத் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! என்ன இது? (அழுகிறீர்களே!)” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “இது அல்லாஹ் தன் அடியார்களின் உள்ளங் களில் (இயல்பாகவே) வைத்துள்ள இரக்க உணர்வாகும்; அல்லாஹ் தன் அடியார் களில் இரக்கமுடையவர்களுக்கே இரக்கம் காட்டுவான்” என்று சொன்னார்கள்.8 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7378,
			"arabicnumber": 7378,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மனவேதனைக்குள்ளாக்கும் செய்தி கேட்டும் (உடனே தண்டித்துவிடாமல்) மிகவும் பொறுமை காப்பவர் அல்லாஹ்வைவிட வேறு யாருமில்லை. மனிதர்கள் (சிலர்) அவனுக்குக் குழந்தை இருப்பதாகக் கூறுகின்றார்கள். அதன் பிறகும் அவர்களுக்கு உடல் நலத்தையும் உணவு வளத்தையும் அவன் வழங்கிக் கொண்டிருக்கின்றான். இதை அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.9 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7379,
			"arabicnumber": 7379,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மறைவானவற்றின் திறவுகோல்கள் ஐந்தாகும். அவற்றை அல்லாஹ்வைத் தவிர வேறெவரும் அறியமாட்டார்கள். (பெண்களின்) கருப்பைகளில் ஏற்படும் குறைவை(யும் கூடுதலையும்) அல்லாஹ்வைத் தவிர வேறெவரும் அறியமாட்டார்கள். நாளை என்ன நடக்கும் என்பதை அல்லாஹ்வைத் தவிர வேறெவரும் அறியமாட்டார்கள். மழை எப்போது வரும் என்பதையும் அல்லாஹ்வைத் தவிர வேறெவரும் (உறுதியாக) அறியமாட்டார்கள். எந்த உயிரும் தான் எந்த இடத்தில் இறக்கும் என்பதை அறியாது; அல்லாஹ்தான் அதை அறிவான். மறுமை நாள் எப்போது வரும் என்பது அல்லாஹ்வைத் தவிர வேறெவருக்கும் தெரியாது. இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.10 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7380,
			"arabicnumber": 7380,
			"text": "மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்கள், “முஹம்மத் (ஸல்) அவர்கள் தம் இறைவனை (நேரில்) பார்த்தார்கள் என்று உங்களிடம் யார் அறிவிக்கிறாரோ அவர் பொய் சொல்லிவிட்டார். இறைவனோ ‘கண்பார்வைகள் அவனை எட்ட முடியாது’ என்று தெரிவிக்கின்றான் (6:103). மேலும், முஹம்மத் (ஸல்) அவர்கள் மறைவானவற்றை அறிவார்கள் என யார் உங்களிடம் அறிவிக்கிறாரோ அவரும் பொய் சொல்லிவிட்டார். இறைவனோ ‘அல்லாஹ்வைத் தவிர வேறு யாரும் மறைவானவற்றை அறியமாட்டார்’ எனக் கூறுகின்றான் (27:65)” என்று சொன்னார்கள்.11 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7381,
			"arabicnumber": 7381,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுக்குப் பின்னால் தொழும்போது, ‘அஸ்ஸலாமு அலல்லாஹ்’ (அல்லாஹ்வின் மீது சாந்தி உண்டாகட்டும்) என்று (அத்தஹிய்யாத் அமர்வில்) சொல்லிவந்தோம். அதற்கு நபி (ஸல்) அவர்கள், “அல்லாஹ்வே சாந்தி அளிப்பவன் (அஸ்ஸலாம்). (ஆகவே, இப்படிச் சொல்லாதீர்கள்.) மாறாக, “(சொல், செயல், பொருள் சார்ந்த) எல்லாக் காணிக்கைகளும் வழிபாடுகளும் பாராட்டுகளும் அல்லாஹ்வுக்கே உரியன. உடல் மற்றும் பொருள் சார்ந்த வழிபாடுகளும் அவனுக்கே உரியன. நபியே! உங்கள்மீது சாந்தியும் அல்லாஹ்வின் கருணையும் அவனுடைய வளமும் ஏற்படட்டும். எங்கள்மீதும் அல்லாஹ்வின் நல்லடியார்கள் (அனைவர்)மீதும் சாந்தி உண்டாகட்டும். அல்லாஹ் ஒருவனைத் தவிர வேறு இறைவனில்லை என்றும், முஹம்மத் (ஸல்) அவர்கள் அவனுடைய அடியாரும் அவனுடைய தூதருமாவார்கள் என்றும் நான் உறுதி கூறுகின்றேன்” எனக் கூறுங்கள் என்று சொன்னார்கள்.12 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7382,
			"arabicnumber": 7382,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், மறுமை நாளில் பூமியைத் தனது கைப்பிடிக்குள் அடக்கிக்கொள் வான்; வானத்தைத் தனது வலக் கரத்தில் சுருட்டிக்கொள்வான்; பிறகு “நானே அரசன்; பூமியின் அரசர்கள் எங்கே?” என்று கேட்பான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.14 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7383,
			"arabicnumber": 7383,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (பின்வருமாறு) பிரார்த்தனை செய்துவந்தார்கள்: (இறைவா!) உன் கண்ணியத்தின் பெயரால் பாதுகாப் புக் கோருகிறேன். மரணமே இல்லாத உன்னைத் தவிர வேறு இறைவன் இல்லை. ஜின் இனத்தாரும் மனித குலத்தாரும் இறந்துவிடுவார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7384,
			"arabicnumber": 7384,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (நரகவாசிகள்) நரகத்தில் போடப்பட்டுக் கொண்டேயிருப்பார்கள். அப்போது நரகம், “இன்னும் அதிகம் இருக்கிறதா?” என்று கேட்கும்; இறுதியில் அகிலங்களின் அதிபதி(யான அல்லாஹ்), நரகத்தில் தனது பாதத்தை வைப்பான். உடனே நரகத்தின் ஒரு பகுதி மற்றொரு பகுதியுடன் ஒட்டிக்கொள்ளும். பிறகு, “போதும்; போதும். உன் கண்ணியத்தின் மீதும், உன் கொடையின் மீதும் சத்தியமாக!” என்று கூறும். சொர்க்கத்தில் இடம் மீதி இருந்து கொண்டேயிருக்கும். இறுதியில், சொர்க்கத்திற்கென அல்லாஹ் புதியவர் களைப் படைத்து, சொர்க்கத்தில் மீதியுள்ள இடத்தில் அவர்களைக் குடியமர்த்து வான். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது.19 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7385,
			"arabicnumber": 7385,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இரவு நேரத்தில் (தொழுவதற்காக எழும்போது பின் வருமாறு) பிரார்த்திப்பார்கள்: இறைவா! உனக்கே புகழனைத்தும். நீயே வானங் கள், பூமி மற்றும் அவற்றில் உள்ளவர் களின் இறைவன் ஆவாய். உனக்கே புகழனைத்தும். நீ வானங்கள் மற்றும் பூமியின் ஒளியாவாய். உன் சொல் உண்மை; உன் வாக்குறுதி உண்மை; (மறுமையில்) உன் தரிசனம் உண்மை; சொர்க்கம் உண்மை; நரகம் உண்மை; மறுமை நாள் உண்மையானது. இறைவா! உனக்கே நான் அடிபணிந் தேன்; உன்மீதே நம்பிக்கை கொண்டேன்; உன்னையே சார்ந்துள்ளேன். உன்னிடமே திரும்புகிறேன்; உன் சான்றுகளைக் கொண்டே வழக்காடுவேன்; உன்னிடமே நீதி கேட்பேன். ஆகவே, நான் முந்திச் செய்த, பிந்திச் செய்கின்ற, இரகசியமாகச் செய்த, பகிரங்கமாகச் செய்த பாவங்கள் அனைத்தையும் மன்னித்தருள்வாயாக! நீயே என் இறைவன். உன்னைத் தவிர எனக்கு வேறெவரும் இறைவன் இல்லை. -ஸாபித் பின் முஹம்மத் (ரஹ்) அவர்கள் கூறியதாவது: சுஃப்யான் அஸ்ஸவ்ரீ (ரஹ்) அவர்கள் இதை நமக்கு அறிவித்துவிட்டு, “நீ உண்மை; உன் சொல் உண்மை” என்று சொன்னார்கள்.20 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7386,
			"arabicnumber": 7386,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுடன் (கைபர்) பயணத்தில் இருந்தோம். அப்போது நாங்கள் மேட்டில் ஏறும்போது ‘அல்லாஹு அக்பர்’ (அல்லாஹ் மிகப் பெரியவன்) என்று (உரக்கச்) சொல்லிவந்தோம். நபி (ஸல்) அவர்கள், “உங்களைக் கட்டுப்படுத்திக்கொள்ளுங்கள் (மெல்லக் கூறுங்கள்). ஏனெனில், நீங்கள் காது கேட்காதவனையோ, இங்கு இல்லாதவனையோ அழைப்பதில்லை. மாறாக, அருகிóருந்து செவியுறுபவனையும் பார்ப்பவனையுமே அழைக்கின்றீர்கள்” என்று சொன்னார்கள். பிறகு நான் என் மனத்திற்குள் “லா ஹவ்ல வலா குவ்வ(த்)த இல்லா பில்லாஹ்” (அல்லாஹ்வின் உதவியின்றி பாவங்களிóருந்து விலகிடவும் முடியாது; நல்லறங்கள் புரிய ஆற்றல் பெறவும் முடியாது) என்று சொல்லிக் கொண்டிருந்தபோது, நபி (ஸல்) அவர்கள் என்னிடம் வந்தார்கள். “அப்துல்லாஹ் பின் கைஸே! ‘லா ஹவ்ல வலா குவ்வ(த்)த இல்லா பில்லாஹ்’ என்று சொல்லுங்கள். ஏனெனில் அது, ‘சொர்க்கத்தின் கருவூலங்களில் ஒரு கருவூலமாகும்’ என்றோ, ‘அதைப் பற்றி நான் அறிவிக்கட்டுமா?’ என்றோ சொன்னார்கள்.22 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7388,
			"arabicnumber": 7388,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7389,
			"arabicnumber": 7389,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் என்னை அழைத்து, “(நபியே!) உங்கள் சமுதாயத்தாரின் சொல்லையும் அவர்கள் உங்களுக்கு அளித்த பதிலையும் அல்லாஹ் செவியுற்றான்” என்று சொன்னார்கள். இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.24 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7390,
			"arabicnumber": 7390,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் அஸ்ஸலமீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தம் தோழர்களுக்கு எல்லா விஷயங்களிலும் நல்லதைத் தேர்ந்தெடுக்கப் பிரார்த்திக்கும் முறையை (இஸ்திகாராவை), குர்ஆனின் அத்தியாயத்தைக் கற்றுக்கொடுப்பதைப் போன்று கற்றுக்கொடுத்துவந்தார்கள். அவர்கள் கூறுவார்கள்: உங்களில் ஒருவர் ஒன்றைச் செய்ய நினைத்தால், கூடுதலான (நஃபிலான) இரண்டு ரக்அத்கள் தொழுதுகொள்ளட்டும். பின்னர் “இறைவா! நீ அறிந்துள்ளபடி (எது எனக்கு) நன்மை(யோ அ)தனை உன்னிடம் நான் கோருகிறேன். உனது ஆற்றலால் எனக்கு ஆற்றல் உண்டாக வேண்டுமென உன்னிடம் கோருகிறேன். உன் அருளைக் கோருகிறேன். ஏனெனில், நீயே ஆற்றல்மிக்கவன்; எனக்கோ எந்த ஆற்றலும் கிடையாது. நீயே நன்கறிந்தவன்; எனக்கோ எந்த அறிவும் கிடையாது. நீயே மறைவானவற்றை நன்கறிந்தவன். இறைவா! இந்தக் காரியம் -(தாம் தொடங்கப்போகும்) அந்தக் காரியம் இன்னதெனக் குறிப்பிட்டு- எனக்கு ‘என் இம்மை வாழ்விலும் மறுமை வாழ்விலும்’ அல்லது ‘என் மார்க்கத்திலும் என் வாழ்க்கையிலும் என் காரியத்தின் முடிவிலும்’ நன்மை பயக்கும் என நீ அறிந்திருந்தால் அதைச் சாதிப்பதற்குரிய ஆற்றலை எனக்கு வழங்கி, அதை எளிதாக்கித் தருவாயாக! பிறகு அதில் எனக்கு வளம் வழங்கிடுவாயாக! இறைவா! இந்தக் காரியம் எனக்கு ‘என் மார்க்கத்திலும் வாழ்க்கையிலும் என் காரியத்தின் முடிவிலும்’ அல்லது ‘என் இம்மை வாழ்விலும் மறுமை வாழ்விலும்’ தீமை பயக்கும் என நீ அறிந்திருந்தால் இந்தக் காரியத்தைவிட்டு என்னைத் திருப்பிவிடுவாயாக! நன்மை எங்கிருந்தாலும் அதை அடைவதற்குரிய ஆற்றலை எனக்கு வழங்கி, அதில் எனக்குத் திருப்தி அளித்திடுவாயாக!” என்று பிரார்த்திக்கட்டும்.25 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7391,
			"arabicnumber": 7391,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் சத்தியம் செய்யும்போது அதிகமாகப் பயன்படுத்திய வாக்கியம், “இல்லை; உள்ளங்களைப் புரட்டுபவன்மீதாணையாக!” என்ப தாகவே இருந்தது.26 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7392,
			"arabicnumber": 7392,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நிச்சயமாக அல்லாஹ்விற்கு தொண் ணூற்று ஒன்பது -நூற்றுக்கு ஒன்று குறைவான- பெயர்கள் உள்ளன. அவற்றை (நம்பிக்கை கொண்டு) மனனமிட்டவர் சொர்க்கத்தில் நுழைவார்.27 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். (இந்த ஹதீஸின் மூலத்திலுள்ள) ‘அஹ்ஸா’ எனும் சொல்லுக்கு ‘மனனமிடல்’ என்பது பொருள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7393,
			"arabicnumber": 7393,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நீங்கள் படுக்கைக்குச் சென்றால் உங்கள் ஆடையின் ஓரத்தால் மூன்று முறை விரிப்பைத் தட்டிவிடுங்கள். மேலும் (பின்வருமாறு) பிரார்த்தியுங்கள்: என் அதிபதியே! உன் பெயரால் நான் என் விலாவை (தரையில்) வைத்தேன். உன் உதவியாலேயே (மீண்டும்) எழுவேன். என் உயிரை நீ கைப்பற்றிக்கொண்டால் அதற்கு நீ மன்னிப்பு அளிப்பாயாக. அதை நீ (கைப்பற்றாமல்) விட்டுவிட்டால், உன் நல்லடியார்களை நீ எதன்மூலம் பாதுகாப்பாயோ அதன்மூலம் என் உயிரையும் காத்திடுவாயாக. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஏழு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.28 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7394,
			"arabicnumber": 7394,
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் படுக்கைக்குச் செல்லும்போது, “அல்லாஹும்ம பிஸ்மிக்க அஹ்யா வ அமூத்து” (அல்லாஹ்வே! உன் பெயர் கூறியே நான் உயிர் வாழ்கிறேன்; இறக்கவும் செய்கிறேன்) என்று கூறுவார்கள். காலையில் (எழும்போது) “அல்ஹம்து லில்லாஹில்லதீ அஹ்யானா பஅத மா அமாத்தனா வ இலைஹிந் நுஷூர்” (எல்லாப் புகழும் அல்லாஹ்வுக்கே. அவன் எங்களை இறக்கச்செய்த பின்னர் எங்களுக்கு உயிரூட்டினான். மேலும், -மண்ணறையிலிருந்து வெளியேறி- அவனிடமே செல்ல வேண்டியதுள்ளது) என்று கூறுவார்கள்.29 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7395,
			"arabicnumber": 7395,
			"text": "அபூதர் அல்கிஃபாரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இரவில் படுக் கைக்குச் செல்லும்போது “பிஸ்மிக்க நமூத்து வ நஹ்யா” (அல்லாஹ்வே! உன் பெயர் கூறியே நாங்கள் இறக்கிறோம்; உயிர் வாழவும் செய்கிறோம்) என்று கூறுவார்கள். (உறக்கத்திலிருந்து) விழித்தெழும் போது, “அல்ஹம்து லில்லாஹில்லதீ அஹ்யானா பஅத மா அமாத்தனா வ இலைஹிந் நுஷூர்” (எல்லாப் புகழும் அல்லாஹ்வுக்கே. அவன் எங்களை இறக்கச்செய்த பின்னர் எங்களுக்கு உயிரூட்டினான். மேலும் -மண்ணறை யிலிருந்து வெளியேறி- அவனிடமே செல்ல வேண்டியதுள்ளது) என்று கூறுவார்கள்.30 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7396,
			"arabicnumber": 7396,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தம் மனைவியுடன் தாம்பத்திய உறவு கொள்ள விரும்பும்போது, “பிஸ்மில்லாஹி, அல்லாஹும்ம ஜன்னிப்னஷ் ஷைத்தான வ ஜன்னிபிஷ் ஷைத்தான மா ரஸக்த்தனா” (அல்லாஹ்வின் திருப்பெயரால்... இறைவா! எங்களைவிட்டு ஷைத்தானை விலக்கி வைப்பாயாக! எங்களுக்கு நீ வழங்கும் குழந்தைச் செல்வத்தைவிட்டும் ஷைத்தானை விலக்கிவைப்பாயாக!) என்று பிரார்த்தித்து, அந்த உறவில் அத்தம்பதியருக்கு விதிக்கப்பட்டபடி குழந்தை பிறந்தால், அக்குழந்தைக்கு ஒருபோதும் ஷைத்தான் தீங்கிழைப்பதில்லை. இதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.31 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7397,
			"arabicnumber": 7397,
			"text": "அதீ பின் ஹாத்திம் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களிடம் “பயிற்சியளிக்கப்பட்ட எனது நாயை (வேட்டைக்காக) அனுப்பு கிறேன். (அது வேட்டிடையாடிக் கொண்டுவருகின்றவற்றை நான் உண்ணலாமா?)” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள்,”நீங்கள் பயிற்சியளிக்கப்பட்ட உங்களது நாயை (வேட்டைக்காக) அனுப்பிவைக்கும்போது அல்லாஹ்வின் பெயரைக் கூறியிருந்தால், அது (உங்களுக்காக வேட்டையாடிக்) கவ்விப் பிடித்தவற்றை நீங்கள் சாப்பிடுங்கள். நீங்கள் இறகு இல்லாத அம்பை எய்து, அது (தனது முனையால்) தைத்துக் கொன்றதையும் சாப்பிடுங்கள்” என்று கூறினார்கள்.32 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7398,
			"arabicnumber": 7398,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: மக்கள், “அல்லாஹ்வின் தூதரே! இங்கு இப்போதுதான் இணைவைப்பிலிருந்து விலகி (இஸ்லாத்தை ஏற்று) வந்த சில சமுதாயத்தார் உள்ளனர். அவர்கள் எங்களிடம் இறைச்சி கொண்டுவருகிறார்கள். அவர்கள் பிராணிகளை அறுக்கும்போது அல்லாஹ்வின் பெயர் கூறுகிறார்களா, இல்லையா என்பது எங்களுக்குத் தெரியாது. (இந்நிலையில் அதைச் சாப்பிடலாமா)?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “நீங்கள் (அதன் மீது) அல்லாஹ்வின் பெயரைச் சொல்லி உண்ணுங்கள்” என்று பதில் சொன்னார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.33 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7399,
			"arabicnumber": 7399,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இரண்டு செம்மறி ஆட்டுக்கிடாக்களை அல்லாஹ்வின் பெயர் (‘பிஸ்மில்லாஹ்’) சொல்லியும், அல்லாஹ் மிகப் பெரியவன் என்று (தக்பீர்) சொல்லியும் குர்பானி கொடுத்தார்கள்.34 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7400,
			"arabicnumber": 7400,
			"text": "ஜுன்தப் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் நஹ்ரு டைய (துல்ஹிஜ்ஜா பத்தாம்) நாளன்று இருந்தேன். அவர்கள் (பெருநாள் தொழுகை) தொழுதுவிட்டு உரையாற்றினார்கள். அப்போது அவர்கள், “தொழுவதற்கு முன்பே (குர்பானிப் பிராணியை) அறுத்து விட்டவர் அதற்குப் பகரமாக மற்றொரு பிராணியை அறுக்கட்டும். (தொழுது முடிக்கும்வரை) அறுக்காமலிருப்பவர் (தொழுகைக்குப்பின்) அல்லாஹ்வின் பெயர் சொல்லி அறுக்கட்டும்” என்று சொன்னார்கள்.35 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7401,
			"arabicnumber": 7401,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நீங்கள் உங்கள் தந்தையர் பெயர் சொல்லி சத்தியம் செய்ய வேண்டாம்; சத்தியம் செய்பவர் அல்லாஹ்வின் பெயர் கூறியே சத்தியம் செய்யட்டும். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.36 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7402,
			"arabicnumber": 7402,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பத்துப்பே(ர் கொண்ட உளவுப் படையின)ரை (ஓரிடத்திற்கு) அனுப்பிவைத்தார் கள். அவர்களில் அன்சாரியான குபைப் (ரலி) அவர்களும் இருந்தார்கள். (உளவுப் படையினரின் வருகையை அறிந்த ஹுதைல் எனும் கூட்டத்தார் பின் தொடர்ந்து வந்து சிலரைக் கொன்றுவிட்டு, சிலரை சிறைபிடித்தார்கள். குபைப் மக்காவில் பனுல் ஹாரிஸ் எனும் கூட்டத்தாரிடம் விற்கப்பட்டார்.) அவர்கள் குபைப் (ரலி) அவர்களைக் கொலை செய்வதற்காக ஒன்றுதிரண்டபோது குபைப் (ரலி) அவர்கள் தமது மறைவிடத்து முடிகளை மழித்துக்கொள்வதற்காக ஹாரிஸின் மகளிடம் சவரக்கத்தி ஒன்றை இரவல் வாங்கினார்கள். அவர்கள் அவரைக் கொல்வதற்காக (மக்காவின்) புனித எல்லைக்கு வெளியே சென்றபோது குபைப் (ரலி) அவர்கள், நான்முஸ்லிமாகக் கொல்லப்படுகையில்எதைப் பற்றியும்பொருட்படுத்தப்போவதில்லைஎந்த இடத்தில்நான் இறந்தாலும்இறைவனுக்காககொல்லப்படுகிறேன்(என்பதில் மகிழ்ச்சியே) நான் கொல்லப்படுவதுஇறையின்தனித்துவத்திற்காக எனும்போதுஅவன் நாடினால்துண்டிக்கப்பட்டஎன் உறுப்புகளின்இணைப்புகள்மீதுகூடவளம் வழங்குவான் என்று பாடினார்கள். பின்னர், ஹாரிஸின் மகன், குபைப் (ரலி) அவர்களைக் கொன்றுவிட்டான். குபைப் (ரலி) அவர்கள் மற்றும் அவர்களுடைய தோழர்களின் செய்தியை அவர்கள் கொல்லப்பட்ட அன்றே நபி (ஸல்) அவர்கள் (இறைஅறிவிப்பின் வாயிலாக அறிந்து) தம் தோழர்களுக்குத் தெரிவித்தார்கள்.39 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7403,
			"arabicnumber": 7403,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வைவிட அதிக ரோஷம் உள்ளவர் வேறெவரும் இல்லை. ஆகவேதான், அவன் ஆபாசங்களுக்குத் தடை விதித்துள்ளான். அல்லாஹ்வைவிட மிகவும் புகழை விரும்புகின்றவர் வேறெவருமிலர். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.40 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7404,
			"arabicnumber": 7404,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் படைப்புகளைப் படைத்த போது (தனது) அரியணையின் மீது வைக்கப்பட்டிருந்த தனது பதிவேட்டில், “என் கருணை என் கோபத்தை வென்று விட்டது” என்று (கருணையைத்) தனக்குத் தானே விதியாக்கிக்கொள்ளும் வகையில் எழுதினான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.41 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7405,
			"arabicnumber": 7405,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உயர்ந்தோன் அல்லாஹ் கூறுகின்றான்: என் அடியான் என்னைப் பற்றி என்ன நினைக்கின்றானோ அதற்கேற்ப அவனிடம் நான் நடந்துகொள்வேன். அவன் என்னை நினைவுகூரும்போது நான் அவனுடன் இருப்பேன். அவன் என்னைத் தன் உள்ளத்தில் நினைவு கூர்ந்தால் நானும் அவனை என் உள்ளத்தில் நினைவுகூருவேன். அவன் ஓர் அவையோர் மத்தியில் என்னை நினைவுகூர்ந்தால் அவர்களைவிடச் சிறந்த ஓர் அவையினரிடம் அவனை நான் நினைவுகூருவேன். அவன் ஒரு சாண் அளவுக்கு என்னை நெருங்கினால் நான் ஒரு முழமளவுக்கு அவனை நெருங்குவேன். அவன் ஒரு முழம் அளவுக்கு என்னை நெருங்கினால் நான் (வலதும் இடதுமாக விரித்த) இரு கைகளின் நீள அளவுக்கு அவனை நெருங்குவேன். அவன் என்னை நோக்கி நடந்து வந்தால் நான் அவனை நோக்கி ஓடிச்செல்வேன்.42 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7406,
			"arabicnumber": 7406,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: “(நபியே!) கூறுக: உங்களுக்கு மேலிருந்தோ, உங்கள் கால்களுக்குக் கீழிருந்தோ ஏதேனுமொரு வேதனையை உங்கள்மீது இறக்கவும், அல்லது உங்களைப் பல்வேறு குழுக்களாகப் பிரித்து உங்களில் சிலர் தரும் துன்பத்தை வேறுசிலர் அனுபவிக்கும்படி செய்யவும் அவன் ஆற்றலுள்ளவன்” எனும் (6:65 ஆவது) இறைவசனம் அருளப்பெற்றபோது, “உங்களுக்கு மேலிருந்து” என்பதைக் கேட்டவுடன் “(இறைவா!) உன் (திரு)முகத்தால் நான் பாதுகாப்புக் கோருகிறேன்” என நபி (ஸல்) அவர்கள் கூறினார்கள். “அல்லது உங்கள் கால்களுக்குக் கீழிலிருந்து” என்பதைக் கேட்டவுடனும் “(இறைவா!) உன் (திரு)முகத்தால் நான் பாதுகாப்புக் கோருகிறேன்” என்றார்கள். “உங்களைப் பல்வேறு குழுக்களாகப் பிரித்து...” என்பதைக் கேட்டவுடன் “இது (முந்தைய வேதனைகளைவிட) மிக எளிதானது” என நபி (ஸல்) அவர்கள் கூறினார்கள்.43 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7407,
			"arabicnumber": 7407,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் தஜ்ஜால் பற்றிக் குறிப்பிடப்பட்டது. அப்போது அவர்கள், “அல்லாஹ்வை நீங்கள் அறியாதவர்கள் அல்லர். நிச்சயமாக, அல்லாஹ் ஒற்றைக் கண்ணன் அல்லன்” என்று கூறிவிட்டு, தமது கரத்தால் தமது கண்ணைச் சுட்டிக்காட்டினார்கள். மேலும், “மஸீஹுத் தஜ்ஜால் வலக் கண் குருடானவன் ஆவான். அவனது கண் (ஒரே குலையில்) துருத்திக்கொண்டிருக் கும் திராட்சையைப் போன்றிருக்கும்” என்றும் கூறினார்கள்.45 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7408,
			"arabicnumber": 7408,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இறைவனால் அனுப்பிவைக்கப்பட்ட எந்த ஓர் இறைத்தூதரும் தம் சமுதாயத் தாரை, மகா பொய்யனான ஒற்றைக் கண்ணன் (தஜ்ஜால்) குறித்து எச்சரிக்காமல் இருந்ததில்லை. (நினைவிற் கொள்க!) அவன் ஒற்றைக் கண்ணன் ஆவான். ஆனால், உங்கள் இறைவன் ஒற்றைக் கண்ணன் அல்லன். அந்தப் பொய்யனின் இரு கண்களுக்கிடையே ‘காஃபிர்’ (இறை மறுப்பாளன்) என்று எழுதப்பட்டிருக்கும். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.46 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7409,
			"arabicnumber": 7409,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: பனுல் முஸ்தலிக் போரின்போது பெண் போர்க் கைதிகள் சிலர் எங்களுக்குக் கிடைத்தனர். அவர்களுடன் தாம்பத்திய உறவு கொள்ள வேண்டும் என்றும், அதே நேரத்தில் அப்பெண்கள் கருவுற்றுவிடக் கூடாதென்றும் நாங்கள் விரும்பினோம். ஆகவே, புணர்ச்சி இடைமுறிப்பு (‘அஸ்ல்’) செய்துகொள்வது குறித்து நபி (ஸல்) அவர்களிடம் கேட்டோம். அதற்கு நபி (ஸல்) அவர்கள், “இதைச் செய்யாமலிருப்பதால் உங்களுக்கு எந்தத் தீங்கும் நேர்ந்துவிடப் போவதில்லை. ஏனெனில், அல்லாஹ் மறுமை நாள்வரை தான் படைக்கவிருப்பவற்றை எழுதிமுடித்துவிட்டான்” என்று சொன்னார்கள். மற்றோர் அறிவிப்பில் அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் (பின்வருமாறு) கூறியுள்ளார்கள்: “படைக்கப்பட உள்ள எந்த உயிரையும் அல்லாஹ் படைத்தே தீருவான்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள்.47 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7410,
			"arabicnumber": 7410,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (ஆதிமுதல் அந்தம்வரை வாழ்ந்த) இறைநம்பிக்கையாளர்கள் அனைவரை யும் அப்படியே மறுமை நாளில் அல்லாஹ் ஒன்றுதிரட்டுவான். அப்போது அவர்கள் “(நமக்கு ஏற்பட்டுள்ள) இந்த(ச் சோதனையான) கட்டத்திலிருந்து நம்மை விடுவிக்க நாம் (யார் மூலமாவது) நம் இறைவனிடம் மன்றாடினால் (மிகவும் நன்றாயிருக்கும்)” என்று பேசிக்கொள்வார்கள். பிறகு அவர்கள் ஆதம் (அலை) அவர்களிடம் சென்று, “ஆதம் (அலை) அவர்களே! மக்களை(ச் சூழ்ந்துள்ள இக்கட்டான சூழ்நிலையை) நீங்கள் காணவில்லையா? அல்லாஹ் தன் கையால் உங்களைப் படைத்தான். தன்னுடைய வானவர்களை உங்களுக்குச் சிரம்பணியச் செய்தான். மேலும், உங்களுக்கு எல்லாப் பொருள்களின் பெயர்களையும் கற்றுத்தந்தான். (எனவே) இந்த(ச் சோதனையான) கட்டத்திலிருந்து எங்களை விடுவிப்பதற்காக உங்களுடைய இறைவனிடத்தில் எங்களுக்காகப் பரிந்து பேசுங்கள்” என்று சொல்வார்கள். அதற்கு ஆதம் (அலை) அவர்கள், “(நீங்கள் நினைக்கும்) அந்த நிலையில் நான் இல்லை” என்று கூறிவிட்டுத் தாம் புரிந்த தவற்றை மக்களிடம் கூறுவார்கள். “ஆகவே, நீங்கள் நூஹ் (அலை) அவர்களிடம் செல்லுங்கள். ஏனென்றால், அவர் (எனக்குப்பின்) பூமியிலுள்ளவர்களுக்கு அல்லாஹ் அனுப்பிவைத்த (முக்கிய) தூதர்களில் முதலாமவர் ஆவார்” என்று கூறுவார்கள். உடனே, இறைநம்பிக்கையாளர்கள் நூஹ் (அலை) அவர்களிடம் செல்வார்கள். அப்போது அன்னாரும், “(நீங்கள் நினைக்கும்) அந்த நிலையில் நான் இல்லை” என்று கூறிவிட்டுத் தாம் புரிந்த தவற்றை அவர்களிடம் கூறுவார்கள். பிறகு, “நீங்கள் அளவற்ற அருளாள(ன் இறைவ)னின் உற்றநண்பர் இப்ராஹீம் (அலை) அவர்களிடம் செல்லுங்கள்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் இப்ராஹீம் (அலை) அவர்களிடம் செல்வார்கள். அப்போது அவர்களும், “(நீங்கள் நினைக்கும்) அந்த நிலையில் நான் இல்லை” என்று கூறிவிட்டுத் தாம் புரிந்த தவறுகளை மக்களிடம் கூறுவார்கள். பிறகு, “அல்லாஹ் தவ்ராத் (வேதத்)தை அளித்து, உரையாடவும் செய்த அடியாரான மூசாவிடம் நீங்கள் செல்லுங்கள்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் மூசா (அலை) அவர்களிடம் செல்வார்கள். அப்போது அவர்களும், “(நீங்கள் நினைக்கும்) அந்த நிலையில் நான் இல்லை” என்று கூறிவிட்டுத் தாம் புரிந்த தவற்றை அவர்களும் மக்களிடம் சொல்வார்கள். பிறகு, “நீங்கள் அல்லாஹ்வின் அடியாரும், அவனுடைய தூதரும், அவனுடைய வார்த்தையும், அவனுடைய ஆவியுமான (நபி) ஈசாவிடம் செல்லுங்கள்” என்று சொல்வார்கள். உடனே அவர்கள் ஈசா (அலை) அவர்களிடம் செல்வார்கள். அப்போது அவர்களும், “(நீங்கள் நினைக்கும்) அந்த நிலையில் நான் இல்லை; ஆகவே, நீங்கள் முன்பின் பாவங்கள் மன்னிக்கப்பட்ட அடியாரான முஹம்மத் (ஸல்) அவர்களிடம் செல்லுங்கள்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் என்னிடம் வருவார்கள். அப்போது நான் என்னுடைய இறைவனிடத்தில் (பரிந்துரை செய்ய) அனுமதி கேட்பதற்காகச் செல்வேன். அதற்கான அனுமதி எனக்கு வழங்கப்படும். என் இறைவனை நான் காணும்போது அவனுக்கு (சிரம்பணிந்து) சஜ்தாவில் விழுவேன். தான் நாடிய வரை அல்லாஹ் (அப்படியே) என்னை (சிரவணக்கத்தில்) விட்டுவிடுவான். பிறகு (இறைவனின் தரப்பிலிருந்து) “முஹம்மதே! தலையை உயர்த்துங்கள்! சொல்லுங்கள்; செவியேற்கப்படும். கேளுங்கள்; உங்களுக்குத் தரப்படும். பரிந்துரை செய்யுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும்” என்று என்னிடம் சொல்லப்படும். அப்போது நான் என் இறைவனை அவன் எனக்குக் கற்றுத்தந்த புகழ் மொழிகளைக் கூறி போற்றுவேன். பிறகு நான் பரிந்துரை செய்வேன். அப்போது இறைவன், (நான் யார் யாருக்குப் பரிந்துரை செய்யலாம் என்பதை வரையறுத்து) எனக்கு வரம்பு விதிப்பான். பிறகு நான் அவர்களைச் சொர்க்கத்திற்கு அனுப்பிவைப்பேன். பின்னர் மீண்டும் நான் (இறைவனிடம்) செல்வேன். என் இறைவனைக் காணும்போது நான் (முன்போலவே, சிரம்பணிந்து) சஜ்தாவில் விழுவேன். அப்போது அல்லாஹ் தான் நாடிய வரை என்னை (அப்படியே சிர வணக்கத்தில்) விட்டுவிடுவான். பிறகு (இறைவனின் தரப்பிலிருந்து), “முஹம்மதே! தலையை உயர்த்துங்கள். சொல்லுங்கள்; செவியேற்கப்படும். கேளுங்கள்; அது உங்களுக்குத் தரப்படும். பரிந்துரை செய்யுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும்” என்று சொல்லப்படும். அப்போது நான் என் இறைவனை அவன் எனக்குக் கற்றுத்தந்த புகழ்மொழிகளைக் கூறி போற்றுவேன். பிறகு நான் பரிந்துரை செய்வேன். அப்போதும் இறைவன், (நான் யார் யாருக்குப் பரிந்துரை செய்யலாம் என்பதை வரையறுத்து) எனக்கு வரம்பு விதிப்பான். பிறகு (அவர்களுக்காகப் பரிந்துபேசி) அவர்களை நான் சொர்க்கத்திற்கு அனுப்பிவைப்பேன். பிறகு (மூன்றாம் முறையாக) நான் (இறைவனிடம்) செல்வேன். அப்போதும் முன்போலவே நடக்கும். பின்னர் (நான்காம் முறையாக இறைவனிடம்) செல்வேன். அப்போது நான், “என் இறைவா! குர்ஆன் தடுத்துவிட்ட, நிரந்தர நரகம் கட்டாயமாகிவிட்டவர்(களான இறைமறுப்பாளர்கள், நயவஞ்சகர்)களைத் தவிர வேறு யாரும் நரகத்தில் மிஞ்சவில்லை” என்று சொல்வேன். நபி (ஸல்) அவர்கள் கூறினார்கள்: யார் “லா இலாஹ இல்லல்லாஹ்” (அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை) என்று கூறியதுடன் அவரது உள்ளத்தில் ஓர் வாற்கோதுமை எடையளவு நன்மையிருக்குமோ அவர் நரகத்திலிருந்து வெளியேற்றப்படுவார். பிறகு யார் “லா இலாஹ இல்லல்லாஹ்” என்று கூறியதுடன் அவரது உள்ளத்தில் மணிக்கோதுமையின் எடையளவு நன்மை இருக்குமோ அவரும் நரகத்திலிருந்து வெளியேற்றப்படுவார். பிறகு யார் “லா இலாஹ இல்லல்லாஹ்” என்று கூறியதுடன், அவரது உள்ளத்தில் கடுகின் எடையளவு நன்மை இருக்குமோ அவரும் நரகத்திலிருந்து வெளியேற் றப்படுவார். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.48 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7411,
			"arabicnumber": 7411,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் கரம் நிரம்பியுள்ளது; வாரிவழங்குவதால் அது வற்றிப்போய் விடுவதில்லை. இரவும் பகலும் (மழை மேகத்தைப்போல் அது தன் அருள் மழையைப்) பொழிந்துகொண்டேயிருக்கிறது. வானங்களையும் பூமியையும் அவன் படைத்தது முதல் அவன் வழங்கியவை அவனது கரத்திலுள்ள (செல்வத்)தை வற்றச் செய்துவிடவில்லை என்பதைப் பார்த்தீர்களா?. (வானங்களையும் பூமியையும் படைப்பதற்கு முன்னர்) அவனுடைய அரியணை (அர்ஷ்), நீரின் மீது இருந்தது. அவனது இன்னொரு கரத்தில் தராசு உள்ளது. அவனே (அதைத்) தாழ்த்துகின்றான்; அவனே உயர்த்துகின்றான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.49 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7413,
			"arabicnumber": 7413,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7414,
			"arabicnumber": 7414,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறினார்கள்: ஒரு யூதர் நபி (ஸல்) அவர்களிடம் வந்து, “முஹம்மதே! அல்லாஹ் (மறுமை நாளில்) வானங்களை ஒரு விரலின் மீதும் பூமிகளை ஒரு விரலின் மீதும் மலைகளை ஒரு விரலின் மீதும் மரத்தை ஒரு விரலின் மீதும் (இதர) படைப்புகளை ஒரு விரலின் மீதும் நிறுத்திக்கொண்டு, ‘நானே அரசன்’ என்று கூறுவான்” என்று சொன்னார். (இதைக் கேட்ட) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் கடைவாய்ப் பற்கள் வெளியே தெரியச் சிரித்துவிட்டு, “அவர்கள் அல்லாஹ்வை எப்படி மதிக்க வேண்டுமோ அப்படி மதிக்கவில்லை” எனும் (யூதர்களைப் பற்றிய 6:91ஆவது) வசனத்தை ஓதிக்காட்டினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இந்த யூதரின் சொல்லைக் கேட்டு வியப்படைந்து, அதை உறுதிப்படுத்தும் வகையில் சிரித்தார்கள்”.51 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7415,
			"arabicnumber": 7415,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: வேதக்காரர்களில் ஒருவர் நபி (ஸல்) அவர்களிடம் வந்து, “அபுல் காசிமே! (மறுமையில்) அல்லாஹ் வானங்களை ஒரு விரலின் மீதும் பூமிகளை ஒரு விரலின் மீதும் மரத்தையும் ஈரமண்ணையும் ஒரு விரலின் மீதும், (இதர) படைப்புகளை ஒரு விரலின் மீதும் (நிறுத்தி) வைத்துக்கொண்டு, ‘நானே அரசன்; நானே அரசன்’ எனக் கூறுவான்” என்று சொன்னார். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள் தமது கடைவாய்ப் பற்கள் தெரியச் சிரித்துவிட்டு, “அவர்கள் அல்லாஹ்வை எப்படி மதிக்க வேண்டுமோ அப்படி மதிக்கவில்லை” எனும் (யூதர்களைப் பற்றிய 6:91 ஆவது) வசனத்தை ஓதிக்காட்டி னார்கள்.52 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7416,
			"arabicnumber": 7416,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: சஅத் பின் உபாதா (ரலி) அவர்கள், “என் மனைவியுடன் ஓர் ஆண் (தவறான உறவு கொண்ட நிலையில்) இருக்கக் கண்டால் வாளின் முனையாலேயே அவனை நான் வெட்டுவேன்” என்று சொல்ல, இந்தச் செய்தி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு எட்டியது. அப்போது அவர்கள், “சஅத் அவர்களின் ரோஷத்தைக் கண்டு நீங்கள் வியக்கின்றீர்களா? அல்லாஹ்வின் மீதாணையாக! நான் அவரைவிட அதிக ரோஷமுள்ளவன்; அல்லாஹ் என்னைவிடவும் அதிக ரோஷமுள்ளவன். அல்லாஹ் தன் ரோஷத்தின் காரணத்தால்தான் வெளிப்படையான மற்றும் மறைவான மானக்கேடான செயல்கள் (ஆபாசங்கள்) அனைத்தையும் தடை செய்துவிட்டான். (திருந்துவதற்கு வாய்ப்பளித்து) விட்டுப்பிடிப்பதை மிகவும் விரும்புகின்றவர் அல்லாஹ்வைவிட வேறெவரும் இல்லை. அதனால்தான் நற்செய்தி சொல்பவர்களையும் எச்சரிக்கை செய்பவர்களையும் அல்லாஹ் அனுப்பி வைத்தான். அல்லாஹ்வைவிட மிகவும் புகழை விரும்புகின்றவர் வேறெவருமில்லை. அதனால்தான் அல்லாஹ் சொர்க்கத்தை அளிப்பதாக வாக்களித்துள்ளான்.53 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7417,
			"arabicnumber": 7417,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரு மனிதரிடம், “குர்ஆனிலிருந்து உங்களுடன் (மனனமாக) ஏதேனும் ஒன்று (ஷைஉ) இருக்கின்றதா?” என்று கேட்டார்கள். அம்மனிதர் “ஆம். இன்ன அத்தியாயம், இன்ன அத்தியாயம்” என்று சில அத்தியாயங்களைப் பெயர் குறிப்பிட்டுச் சொன்னார்.55 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7418,
			"arabicnumber": 7418,
			"text": "இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்கள் அருகில் இருந்தேன். அப்போது பனூ தமீம் குலத் தாரில் சிலர் நபி (ஸல்) அவர்களிடம் வந்தனர். (அவர்களிடம்) நபி (ஸல்) அவர்கள், “நற்செய்தியை ஏற்றுக்கொள்ளுங்கள், பனூ தமீம் குலத்தாரே!” என்று சொன்னார் கள். அதற்கு அவர்கள், “எங்களுக்கு நற்செய்தி சொன்னீர்கள். (அது இருக்கட் டும்! தர்மம்) கொடுங்கள்” என்று கூறினார்கள். அப்போது யமன் நாட்டு மக்கள் சிலர் (அஷ்அரீ குலத்தார்) வந்தனர். நபி (ஸல்) அவர்கள், “யமன் வாசிகளே! நீங்கள் நற்செய்தியை ஏற்றுக்கொள்ளுங்கள். ஏனெனில், பனூ தமீம் குலத்தார் அதை ஏற்கவில்லை” என்று சொன்னார்கள். அதற்கு அவர்கள், “நாங்கள் (அதை) ஏற்றுக்கொண்டோம்; மார்க்கக் கல்வி கற்பதற்காகவும், இந்த உலகம் உண்டான தன் ஆரம்ப நிலை குறித்துத் தங்களிடம் கேட்பதற்காகவுமே நாங்கள் தங்களிடம் வந்தோம்” என்று கூறினார்கள். நபி (ஸல்) அவர்கள், “(ஆதியில்) அல்லாஹ் மட்டுமே இருந்தான்; அவனுக்கு முன் (அவனைத் தவிர வேறு) எந்தப் பொருளும் இருக்கவில்லை. (பிறகு படைக்கப்பட்ட) அவனது அரியணை (அர்ஷ்) தண்ணீரின் மீது இருந்தது. பின்னர் வானங்கள் மற்றும் பூமியை அவன் படைத்தான். (லவ்ஹுல் மஹ்ஃபூழ் எனும்) பாதுகாக்கப்பெற்ற பலகையில் (பேரண்டத்தின்) எல்லா விஷயங்களையும் எழுதினான்” என்று சொன்னார்கள். (அறிவிப்பாளர் கூறுகிறார்:) பின்னர் ஒருவர் என்னிடம் வந்து, “இம்ரானே! உங்கள் ஒட்டகத்தை (கண்டு) பிடியுங்கள்; அது (ஓடிப்) போய்விட்டது” என்று கூற, நான் அதைத் தேட (எழுந்து) சென்றுவிட்டேன். சென்று பார்த்தால் ஒட்டகத்தைக் காண முடியாதபடி கானல் நீர் தடுத்துவிட்டது. அல்லாஹ்வின் மீது சத்தியமாக! அது போனால் போகட்டும் என்று கருதி, (ஹதீஸ் முடிவதற்குமுன்) நான் அங்கிருந்து எழுந்து செல்லாமல் இருந்திருக்க வேண்டும் என்று நான் ஆசைப்பட்டேன்.57 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7419,
			"arabicnumber": 7419,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் வலக் கரம் நிரம்பி யுள்ளது. வாரி வழங்குவதால் அது வற்றிவிடுவதில்லை. அது இரவிலும் பகலிலும் (அருள் மழையைப்) பொழிந்து கொண்டேயிருக்கிறது. அவன் வானங்கள் மற்றும் பூமியைப் படைத்த (நேரத்)திலிருந்து (இப்போதுவரை) அவன் வாரி வழங்கியது எவ்வளவு இருக்கும் சொல் லுங்கள். அதுவும்கூட அவனது வலக் கரத்தில் இருப்பதைக் குறைத்துவிடவில்லை. (வானங்கள் மற்றும் பூமியைப் படைத்தபோது) அவனது அரியணை (அர்ஷ்) தண்ணீரின் மீதிருந்தது. அவனது மற்றொரு கரத்தில் ‘கொடைப் பொழிவு’ அல்லது ‘கொடைக் குறைவு’ உள்ளது. (அதன் வாயிலாக) அவன் (சிலரை) உயர்த்துகின்றான்; (சிலரைத்) தாழ்த்துகின்றான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.58 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7420,
			"arabicnumber": 7420,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: ஸைத் பின் ஹாரிஸா (ரலி) அவர்கள் தம் மனைவியின் (ஸைனப்) போக்கு குறித்து (நபி (ஸல்) அவர்களிடம்) முறையிட வந்தார்கள். நபி (ஸல்) அவர்கள், “அல்லாஹ்வுக்கு அஞ்சி நடந்துகொள்; உன் மனைவியை (மணவிலக்குச் செய்துவிடாமல்) மணபந்தத்தில் நீடிக்கச்செய்” என்று கூறலானார்கள். நபி (ஸல்) அவர்கள் (தம் வாழ்நாளில் குர்ஆன் வசனங்களில்) எதையேனும் மறைப்பவர்களாக இருந்திருந்தால் (பின்வரும் 33:37ஆவது வசனமான) இதைத்தான் மறைத்திருப்பார்கள். இதன் காரணத்தால் ஸைனப் (ரலி) அவர்கள் நபி (ஸல்) அவர்களுடைய மற்றத் துணைவியர் முன்பாக (தமக்குத் தனிச் சிறப்பு இருப்பதாகப்) பெருமை பாராட்டிக்கொள்வார்கள். “உங்களை (நபி (ஸல்) அவர்களுக்கு) உங்கள் வீட்டார் மணமுடித்துத் தந்தார்கள். என்னையோ உயர்ந்தவனான அல்லாஹ்வே ஏழு வானங்களுக்கு மேலிருந்து (நபி (ஸல்) அவர்களுக்கு) மணமுடித்துக்கொடுத்தான்” என்று சொல்வார்கள். (அறிவிப்பாளர்களில் ஒருவரான) ஸாபித் அல்புனானீ (ரஹ்) அவர்கள் கூறினார்கள்: “(நபியே!) நீர் (அந்நேரத்தில்) அல்லாஹ் வெளிப்படுத்த நாடியிருந்த விஷயத்தை உமது உள்ளத்தில் மறைத்து வைத்துக்கொண்டீர்” எனும் (33:37ஆவது) இறைவசனம், (தம்பதியராயிருந்த) ஸைனப் (ரலி) அவர்களுக்கும் ஸைத் பின் ஹாரிஸா (ரலி) அவர்களுக்குமிடையே நடந்த பிரச்சினையில் (நபி (ஸல்) அவர்கள் கருத்து தெரிவித்தபோது)தான் அருளப்பெற்றது” என்று அனஸ் (ரலி) அவர்கள் சொன்னார்கள்.59 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7421,
			"arabicnumber": 7421,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: பர்தா தொடர்பான வசனம் ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்கள் விஷயத்தில்தான் அருளப்பெற்றது. அன்று நபி (ஸல்) அவர்கள் ஸைனப் (ரலி) அவர்களை மணந்ததற்காக (‘வலீமா’ விருந்தாக) ரொட்டியையும் இறைச்சியையும் உண்ணக் கொடுத்தார்கள். ஸைனப் (ரலி) அவர்கள் நபி (ஸல்) அவர்களின் மற்றத் துணைவியர் முன்பாகப் பெருமை பாராட்டிவந்தார்கள்: “அல்லாஹ் எனக்கு வானத்தில் மணமுடித்து வைத்தான்” என்று சொல்வார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7422,
			"arabicnumber": 7422,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் (படைப்புகளைப்) படைக் கும் பணியை நிறைவு செய்தபோது தன்னிடமுள்ள அரியணைக்கு மேலே, “என் கருணை என் கோபத்தை முந்திவிட்டது” என்று எழுதினான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.60 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7423,
			"arabicnumber": 7423,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: “அல்லாஹ்வின் மீதும் அவனுடைய தூதரின் மீதும் நம்பிக்கை கொண்டு, தொழுகையை நிலைநிறுத்தி, ரமளானில் நோன்பும் நோற்ற மனிதரை சொர்க்கத்தில் நுழையச்செய்வது அல்லாஹ்வின் மீது கடமையாகிவிட்டது; அவர் அல்லாஹ்வின் பாதையில் புலம்பெயர்ந்து (ஹிஜ்ரத்) சென்றாலும் சரி; அல்லது அவர் பிறந்த பூமியில் உட்கார்ந்துகொண்டாலும் சரி” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். “அல்லாஹ்வின் தூதரே! நாங்கள் மக்களுக்கு இந்த (நற்)செய்தியை அறிவிக்கலாமா?” என்று (நபித்தோழர்கள்) கேட்டனர். அதற்கு நபி (ஸல்) அவர்கள், “சொர்க்கத்தில் நூறு படித்தரங்கள் உள்ளன. அவற்றைத் தனது பாதையில் அறப்போர் புரிபவர்களுக்காக (அல்லாஹ்) தயார்படுத்தி வைத்துள்ளான். ஒவ்வொரு இரு படித்தரங்களுக்கிடையே வானத்திற்கும் பூமிக்கும் இடையிலுள்ளதைப் போன்ற தொலைதூரம் உள்ளது. நீங்கள் அல்லாஹ்விடம் கேட்டால், ஃபிர்தவ்ஸ் எனும் (சொர்க்கத்தின்) படித்தரத்தையே கேளுங்கள்; ஏனெனில், அதுவே சொர்க்கத்தின் மிகச் சிறந்த படித்தரமும் மிக உயர்ந்த படித்தரமும் ஆகும். அதற்குமேலே அளவிலா அருளாள(ன் இறைவ)னின் அரியணை (அர்ஷ்) இருக்கிறது. இன்னும் அ(ந்த படித்தரத்)திலிருந்தே சொர்க்கத்தின் ஆறுகள் பாய்கின்றன என்று கூறினார்கள்.61 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7424,
			"arabicnumber": 7424,
			"text": "அபூதர் அல்ஃகிஃபாரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அமர்ந்திருக்க பள்ளிவாசலினுள் நான் நுழைந்தேன். சூரியன் மறையத் தொடங்கியதும் நபி (ஸல்) அவர்கள், “அபூதர்ரே! இது (சூரியன்) எங்கு செல்கின்றது என்பது உங்களுக்குத் தெரியுமா?” என்று கேட்டார்கள். நான், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்” என்று சொன்னேன். அவர்கள், “இது இறைவனுக்கு (அவனது அரியணைக்குக் கீழே) சிரவணக்கம் (சஜ்தா) செய்ய அனுமதி கேட்பதற்காகச் செல்கின்றது. அதற்கு அனுமதி வழங்கப்படும். அதனிடம், “நீ எங்கிருந்து வந்தாயோ அந்த இடத்திற்கே திரும்பிச் செல்” என்று சொல்லப்பட்டுவிட்டதைப் போன்று இருக்கும். உடனே அது மறைந்த இடத்திலிருந்து (இறுதிநாளில்) உதயமாகும்” என்று சொல்லிவிட்டு, “அதுதான் அது நிலைகொள்ளும் இடமாகும்” (தாலிக்க முஸ்த்தகர்ருல் லஹா) என்று அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களது ஓதல் முறைப்படி (36:38ஆவது வசனத்தை) ஓதினார்கள்.62 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7425,
			"arabicnumber": 7425,
			"text": "ஸைத் பின் ஸாபித் (ரலி) அவர்கள் கூறியதாவது: அபூபக்ர் (ரலி) அவர்கள் (தமது ஆட்சிக் காலத்தில் குர்ஆன் வசனங்களை ஒன்றுதிரட்டும்படி கேட்டு) என்னிடம் ஆளனுப்பினார்கள். ஆகவே, நான் குர்ஆன் (சுவடிகளைத்) தேடினேன். அப்போது ‘அத்தவ்பா’ எனும் (9ஆவது) அத்தியாயத்தின் இறுதிப் பகுதியை அன்சாரியான அபூகுஸைமா (ரலி) அவர்களிடம் கிடைக்கப்பெற்றேன். அவரல்லாத வேறொருவரிடமும் அதை நான் காணவில்லை. அந்த இறுதிப் பகுதி, “உங்களிலிருந்தே ஓர் இறைத்தூதர் உங்களிடம் வந்திருக்கின்றார்” என்பதிலிருந்து அல்பராஅத் அத்தியாயத்தின் இறுதி(யான ‘அவனே மகத்தான அரியணையின் அதிபதி ஆவான்’ என்பது)வரை உள்ளதாகும். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.63 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7426,
			"arabicnumber": 7426,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் துன்பம் நேரும்போது, “லா இலாஹ இல்லல்லாஹுல் அலீமுல் ஹலீம்; லா இலாஹ இல்லல் லாஹு ரப்புல் அர்ஷில் அழீம்; லா இலாஹ இல்லல்லாஹு ரப்புஸ் ஸமாவாத்தி, வ ரப்புல் அர்ளி, வ ரப்புல் அர்ஷில் கரீம்” (நன்கறிந்தோனும் பொறுமை மிக்கோனுமாகிய அல்லாஹ் வைத் தவிர வேறு இறைவனில்லை; மகத்தான அரியணையின் அதிபதி யான அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை; வானங்கள் மற்றும் பூமியின் அதிபதியும், சிறப்புக்குரிய அரியணையின் அதிபதியுமாகிய அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை) என்று பிரார்த்தித்து வந்தார்கள்.64 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7428,
			"arabicnumber": 7428,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7429,
			"arabicnumber": 7429,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரவில் சில வானவர்களும், பகலில் சில வானவர்களும் உங்களிடையே அடுத்தடுத்து (இறங்கி) வருகிறார்கள். அவர்கள் அஸ்ர் தொழுகையிலும் ஃபஜ்ர் தொழுகையிலும் ஒன்றுசேர்கின்றார்கள். பிறகு உங்களிடையே இரவு தங்கியிருந்த வர்கள் (வானத்திற்கு) ஏறிச்செல்கின் றார்கள். அவர்களிடம் அல்லாஹ் “என் அடியார்களை எந்த நிலையில் விட்டுவிட்டு வந்தீர்கள்?” என்று -உங்களைப் பற்றி அவன் நன்கறிந்த நிலையிலேயே- கேட்கின்றான். “அவர்கள் தொழுதுகொண்டிருக்கும் நிலையில் அவர்களை விட்டுவிட்டு வந்தோம்; அவர்கள் தொழுதுகொண்டிருக்கும் நிலையிலேயே அவர்களிடம் நாங்கள் சென்றோம்” என்று வானவர்கள் பதிலளிப்பார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.69 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7430,
			"arabicnumber": 7430,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் நல்ல சம்பாத்தியத்தின் வாயிலாக (ஈட்டிய வருமானத்திலிருந்து) ஒரு பேரீச்சம்பழத்திற்குச் சமமான அளவு தர்மம் செய்கிறாரோ அ(வரது தர்மத்)தை அல்லாஹ் தன் வலக் கரத்தால் ஏற்றுக்கொள்வான். -அல்லாஹ்வை நோக்கி நல்ல (தூய்மையான)து மட்டுமே மேலே செல்லும்- பிறகு அதை, உங்களில் ஒருவர் தமது குதிரைக் குட்டியை வளர்ப்பதைப் போன்று மலை அளவுக்கு அல்லாஹ் வளர்த்துப் பெருகச்செய்வான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.70 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7431,
			"arabicnumber": 7431,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் துன்பம் நேரும் போது இந்தச் சொற்களைக் கூறிப் பிரார்த்தித்துவந்தார்கள்: லா இலாஹ இல்லல்லாஹுல் அழீமுல் ஹலீம்; லா இலாஹ இல்லல்லாஹு ரப்புல் அர்ஷில் அழீம்; லா இலாஹ இல்லல்லாஹு ரப்புஸ் ஸமாவாத்தி வ ரப்புல் அர்ஷில் கரீம். (மகத்துவமிக்கோனும் பொறுமை மிகுந்தோனுமாகிய அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை; மகத்தான அரியணையின் அதிபதி யான அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை; வானங்களின் அதிபதியும் சிறப்புமிக்க அரியணையின் அதிபதியுமாகிய அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை.)71 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7432,
			"arabicnumber": 7432,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அலீ (ரலி) அவர்கள் வார்க்கப்படாத சிறிய தங்கக் கட்டி ஒன்றை யமன் நாட்டிலிருந்து நபி (ஸல்) அவர்களுக்கு அனுப்பி வைத்தார்கள். அதை நபி (ஸல்) அவர்கள் அக்ரஉ பின் ஹாபிஸ் அல்ஹன்ழலீ அல்முஜாஷிஈ (ரலி), உயைனா பின் பத்ர் அல்ஃபஸாரீ (ரலி), அல்கமா பின் உலாஸா அல்ஆமிரீ அல்கிலாபீ (ரலி), ஸைத் அல்கைல் அத்தாயீ அந்நப்ஹானீ (ரலி) ஆகிய நால்வரிடையே பங்கிட்டார்கள். இதைக் கண்ட குறைஷியரும் அன்சாரி களும் கோபமடைந்து, “நஜ்த்வாசிகளின் தலைவர்களுக்கு இதைக் கொடுக்கிறார்கள்; நம்மை விட்டுவிடுகிறார்களே” என்று கூறினார்கள். (இதையறிந்த) நபி (ஸல்) அவர்கள், “(புதிதாக இஸ்லாத்தைத் தழுவிய) அவர்களை ஈர்ப்பதற்காகவே இவ்வாறு கொடுத்தேன்” என்று சொன்னார்கள். அப்போது கண்கள் பஞ்சடைந்த, நெற்றி புடைத்த, அடர்த்தியான தாடி கொண்ட, கன்னங்கள் உப்பிய, தலை முடி மழிக்கப்பட்டிருந்த ஒரு மனிதர் முன்வந்து, “முஹம்மதே! அல்லாஹ்வுக்கு அஞ்சுங்கள்” என்று சொன்னார். அதற்கு நபி (ஸல்) அவர்கள், “நான் அல்லாஹ் வுக்கு மாறு செய்தால் வேறு யார் அவனுக்குக் கீழ்ப்படியப் போகிறார்கள்? பூமியிலிருப்பவர்களில் என்னை அவன் நம்பிக்கைக்குரியவனாக ஆக்கியுள்ளான்; (நான் வானிலிருப்பவர்களின் நம்பிக்கைக்கும் உரியவன்;) ஆனால், நீங்கள் என்னை நம்ப மறுக்கின்றீர்களே?” என்று கேட்டார்கள். அப்போது மக்களில் ஒருவர் அம்மனிதரைக் கொன்றுவிட அனுமதி கேட்டார் -அவர் காலித் பின் அல்வலீத் (ரலி) என்றே நான் கருதுகிறேன்- ஆனால், நபி (ஸல்) அவர்கள் அவரைத் தடுத்துவிட்டார்கள். அந்த மனிதர் திரும்பிச் சென்றபோது நபி (ஸல்) அவர்கள், “இந்த மனிதரின் பரம்பரையிலிருந்து ஒரு சமுதாயத்தார் தோன்றுவர். அவர்கள் குர்ஆனை ஓதுவார்கள். ஆனால், அது அவர்களின் தொண்டைக் குழிகளைத் தாண்டி (இதயத்திற்குள்) செல்லாது; வேட்டையாடப்பட்ட பிராணியின் உடலிலிருந்து (அதன்மீது எய்யப்பட்ட) அம்பு வெளியேறிவிடுவதைப் போன்று அவர்கள் இஸ்லாத்திலிருந்து வெளியேறிவிடுவார்கள். இஸ்லாமியர்களையே அவர்கள் கொலை செய்வார்கள்; சிலை வழிபாட்டாளர்களை விட்டுவிடுவார்கள். நான் அவர்க(ள் வாழும் நாட்க)ளை அடைந்தால் ‘ஆத்’ கூட்டத்தார் அழிக்கப்பட்டதைப் போன்று அவர்களை நிச்சயம் நான் அழிப்பேன்” என்று சொன்னார்கள்.72 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7433,
			"arabicnumber": 7433,
			"text": "அபூதர் அல்ஃகிஃபாரீ (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களிடம் “சூரியன், தான் நிலைகொள்ளும் இடத்தை நோக்கிச் சென்றுகொண்டிருக்கின்றது” எனும் (36:38 ஆவது) இறைவசனத்தைப் பற்றிக் கேட்டேன். அதற்கு அவர்கள், “அது நிலைகொள்ளும் இடம் இறை அரியணைக்குக் கீழே உள்ளது” என்று சொன்னார்கள்.73 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7434,
			"arabicnumber": 7434,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுடன் அமர்ந்திருந்தோம். அப்போது (அந்த) பௌர்ணமி இரவில் அவர்கள் முழு நிலாவைக் கூர்ந்துபார்த்தார்கள். “இந்த நிலாவை நீங்கள் நெருக்கடியின்றிக் காண்பதைப் போன்றே உங்கள் இறை வனையும் (மறுமையில்) காண்பீர்கள். ஆகவே, சூரியன் உதயமாவதற்கு முன்புள்ள தொழுகையிலும் சூரியன் மறைவதற்கு முன்புள்ள தொழுகையிலும் (உறக்கம் போன்ற) எதற்கும் ஆட்படாமல் இருக்க உங்களால் முடியும் என்றால் அவ்வாறே செய்யுங்கள் (உங்கள் இறைவனை நீங்கள் தரிசிக்கலாம்)” என்று சொன்னார்கள்.75 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7435,
			"arabicnumber": 7435,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நீங்கள் உங்கள் இறைவனை (மறுமை யில்) கண்கூடாகக் காண்பீர்கள். இதை ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7436,
			"arabicnumber": 7436,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு பௌர்ணமி இரவில் புறப்பட்டு எங்களிடம் வந்து, “நீங்கள் இந்த முழு நிலாவை நெருக்கடியின்றி காண்பதைப் போன்றே உங்கள் இறைவனை மறுமை நாளில் காண்பீர்கள்” என்று சொன்னார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7438,
			"arabicnumber": 7438,
			"text": "அதாஉ பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: அபூஹுரைரா (ரலி) அவர்கள் மேற்கண்ட ஹதீஸை அறிவித்தபோது அவர்களுடன் அபூசயீத் அல்குத்ரீ (ரலி) அவர்களும் இருந்தார்கள். அன்னார் அபூஹுரைரா (ரலி) அவர்கள் அறிவித்த இந்த ஹதீஸிற்கு எந்த மறுப்பும் தெரிவிக்கவில்லை. இறுதியில் அபூஹுரைரா (ரலி) அவர்கள், “இதுவும் உனக்குக் கிடைக்கும்; இதைப் போன்று இன்னொரு மடங்கும் உனக்குக் கிடைக்கும் என்று அல்லாஹ் கூறுவான்” என அறிவித்தபோதுதான் அபூசயீத் (ரலி) அவர்கள் (குறுக்கிட்டு), “இதுவும் இதைப் போன்று பத்து மடங்கும் உனக்குக் கிடைக்கும்” என்றல்லவா ஹதீஸ் இருக்கிறது அபூஹுரைராவே!” என்று கேட்டார்கள். அபூஹுரைரா (ரலி) அவர்கள், “நான் அல்லாஹ்வின் தூதரிடமிருந்து ‘உனக்கு இதுவும் இதைப் போன்ற இன்னொரு மடங்கும் கிடைக்கும்’ என்று கூறியதாகவே மனனம் செய்துள்ளேன்” என்று சொன்னார்கள். அதற்கு அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள், “நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து ‘இதுவும் இதைப் போன்று பத்து மடங்கும் உனக்குக் கிடைக்கும்’ என்ற சொல்லையே மனனம் செய்துள்ளேன் என உறுதிகூறுகிறேன்” என்றார்கள். அபூஹுரைரா (ரலி) அவர்கள் “அந்த மனிதர்தான் சொர்க்கத்தில் இறுதியாக நுழையும் மனிதர் ஆவார்” என்று சொன்னார்கள்.77 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7439,
			"arabicnumber": 7439,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள், “அல்லாஹ்வின் தூதரே! மறுமை நாளில் எங்கள் இறைவனை நாங்கள் காண்போமா?” என்று (நபி (ஸல்) அவர்களிடம்) கேட்டோம். அதற்கு அவர்கள், “(மேகமூட்டமில்லாது) வானம் தெளிவாக இருக்கையில் சூரியனையும் சந்திரனையும் பார்க்க நீங்கள் (முண்டியத்துக்கொண்டு) சிரமப்படுவீர்களா?” என்று கேட்டார்கள். நாங்கள், “இல்லை” என்று பதிலளித்தோம். இவ்விரண்டையும் பார்க்க நீங்கள் சிரமப்படாததைப் போன்றே அந்த நாளில் உங்கள் இறைவனைக் காணவும் நீங்கள் சிரமப்படமாட்டீர்கள்” என்று கூறிவிட்டு (பின்வருமாறு) விளக்கினார்கள்: (மறுமை நாளில்) அழைப்பாளர் ஒருவர், “ஒவ்வொரு சமுதாயத்தாரும் தாம் வழிபட்டுக்கொண்டிருந்தவர்களைப் பின்தொடர்ந்து செல்லட்டும்” என்று அழைப்பு விடுப்பார். அப்போது சிலுவை வழிபாட்டாளர்கள் தங்கள் சிலுவையுடனும், சிலை வழிபாட்டாளர்கள் தங்கள் சிலைகளுடனும், ஒவ்வொரு (பொய்த்) தெய்வ வழிபாட்டாளர்கள் தத்தம் கடவுள்களுடனும் செல்வார்கள். முடிவில் அல்லாஹ்வை வழிபட்டுக்(கொண்டு நன்மைகளும் புரிந்து)கொண்டிருந்த நல்லவர்கள், அல்லது (அல்லாஹ்வையும் வழிபட்டுக்கொண்டு பாவங்களும் புரிந்துவந்த) பாவிகள், மேலும் வேதக்காரர்களில் மிஞ்சியவர்கள் மட்டுமே எஞ்சியிருப்பர். பின்னர் நரகம் கொணரப்பட்டுக் கானலைப் போன்று அவர்களுக்குக் காட்டப்படும். அப்போது யூதர்களிடம், “நீங்கள் எதை வழிபட்டுக்கொண்டி ருந்தீர்கள்?” என்று கேட்கப்படும். அதற்கு அவர்கள், “நாங்கள் அல்லாஹ்வின் மைந்தர் உஸைர் அவர்களை வழிபட்டுக்கொண்டிருந்தோம்” என்று பதிலளிப்பார்கள். அப்போது அவர்களிடம், “நீங்கள் பொய்யுரைக்கிறீர்கள். அல்லாஹ் வுக்கு மனைவியோ மக்களோ இருக்கவில்லை” என்று சொல்லப்படும். பிறகு அவர்களிடம், “இப்போது நீங்கள் என்ன விரும்புகிறீர்கள்?” என்று கேட்கப்படும். அதற்கு அவர்கள், “எங்களுக்கு (குடிப்பதற்கு நீர்) புகட்டுவாயாக!” என்பார்கள். அப்போது (அவர்களிடம் கானலைப் போன்று நரகம் காட்டப்பட்டு), “குடியுங்கள்” என்று கூறப்படும். (அதைக் குடிக்க முனையும்போது) அவர்கள் நரகத்தில் விழுந்துவிடுவார்கள். பின்னர் கிறித்தவர்களிடம், “நீங்கள் எதை வழிபட்டுக்கொண்டிருந்தீர்கள்?” என்று கேட்கப்படும். அதற்கு அவர்கள், “அல்லாஹ்வின் மைந்தர் மஸீஹை (ஈசாவை) நாங்கள் வழிபட்டுக்கொண்டிருந்தோம்” என்று பதிலளிப்பார்கள். அப்போது அவர்களிடம், “நீங்கள் பொய்யுரைக்கிறீர்கள்; அல்லாஹ்வுக்கு மனைவியோ மக்களோ இருக்கவில்லை” என்று கூறப்பட்டபின் “நீங்கள் என்ன விரும்புகிறீர்கள்?” என்று கேட்கப்படும். அதற்கு அவர்கள், “நீ எங்களுக்கு (நீர்) புகட்டுவதையே நாங்கள் விரும்புகிறோம்” என்று பதிலளிப்பார்கள். அப்போது அவர்களிடம் (கானலைப் போன்று காட்சி தரும் நரகத்தைக் காட்டி) “குடியுங்கள்!” என்று கூறப்படும். அப்போது நரகத்தில் அவர்களும் விழுந்துவிடுவார்கள். இறுதியில் அல்லாஹ்வை வழிபட் டுக்(கொண்டு நன்மைகளும் புரிந்து) கொண்டிருந்த நல்லோர், அல்லது (அல்லாஹ்வையும் வழிபட்டுக்கொண்டு பாவங்களும் புரிந்துவந்த) தீயோர் மட்டும் எஞ்சியிருப்பர். அவர்களிடம் “மக்கள் (அனைவரும் தத்தம் தெய்வங்களுக்குப் பின்னால்) சென்றுவிட்டார்களே! நீங்கள் மட்டும் ஏன் இங்கேயே இருந்துகொண்டிருக்கிறீர்கள்?” என்று கேட்கப்படும். அதற்கு அவர்கள், “(உலகத்தில்) நாங்கள் (வாழ்க்கையின் தேவைகளைப் பூர்த்தி செய்துகொள்வதற்காக) இந்த மக்களிடம் அதிக அளவில் தேவையுள்ளவர்களாக இருந்தும் (அவர்களுடன் ஒட்டி உறவாடிக்கொண்டிராமல்) அவர்களைப் பிரிந்திருந்தோம். (இப்போது மட்டும் அவர்கள் பின்னால் நாங்கள் செல்வோமா?) இங்கு ஓர் அழைப்பாளர், “ஒவ்வொரு சமுதாயத்தாரும் (உலக வாழ்வில்) தாம் வழிபட்டுக்கொண்டிருந்தவர்களுடன் சேர்ந்துகொள்ளட்டும் என்று அழைக்கக் கேட்டோம். நாங்கள் (வழிபட்டுக்கொண்டிருந்த) எங்கள் இறைவனையே நாங்கள் (இத்தருணத்தில்) எதிர்பார்த்துக்கொண்டிருக்கிறோம்” என்று கூறுவார்கள். அப்போது சர்வ வல்லமை படைத்தவ(னான இறைவ)ன், அவனைப் பற்றி அவர்கள் எண்ணிவைத்திருந்த தோற்றம் அல்லாத வேறொரு தோற்றத்தில் அவர்களிடம் முதல் தடவையாக வந்து, “நானே உங்கள் இறைவன்” என்று கூறுவான். அதற்கு இறைநம்பிக்கையாளர்கள், “நீயே எங்கள் இறைவன்” என்று சொல்வார்கள். அப்போது இறைவனிடம் இறைத்தூதர்களைத் தவிர வேறெவரும் பேச மாட்டார்கள். அப்போது, “அவனை இனங்கண்டு கொள்ள உங்களுக்கும் அவனுக்குமிடையே ஏதேனும் அடையாளம் உண்டா?” என்று (ஒருவர்) கேட்பார். அதற்கு இறைநம்பிக்கையாளர்கள், ‘(இறைவனின்) கால் (பாதம்)தான்” என்று கூறுவார்கள். உடனே அல்லாஹ் தனது காலை வெளிப்படுத்துவான். இறைநம்பிக்கையாளர்கள் யாவரும் அவனுக்குச் சிரவணக்கம் (சஜ்தா) செய்வார்கள். முகஸ்துதிக்காகவும் பாராட்டுக்காகவும் அல்லாஹ்வுக்கு சிரம்பணிந்து (தொழுது)கொண்டிருந்த வர்கள் மட்டுமே அப்போது எஞ்சியிருப் பார்கள்; அவர்கள் சிரவணக்கம் செய்ய முற்படுவார்கள். ஆனால், அவர்களின் முதுகு (குனிய முடியாதவாறு) ஒரே பலகையைப் போன்று மாறிவிடும். (அவர்களால் சிரவணக்கம் செய்ய முடியாது).78 பிறகு பாலம் கொண்டுவரப்பட்டு, நரகத்தின் மேலே வைக்கப்படும். (இவ்வாறு நபி (ஸல்) அவர்கள் சொன்னபோது,) நாங்கள், “அல்லாஹ்வின் தூதரே! அது என்ன பாலம்?” என்று கேட்டோம். நபி (ஸல்) அவர்கள், “அது (கால்கள்) வழுக்குமிடம்; சறுக்குமிடம்; அதன்மீது இரும்புக் கொக்கிகளும் அகன்ற நீண்ட முட்களும் இருக்கும். அந்த முட்கள் வளைந்திருக்கும். ‘நஜ்த்’ பகுதியில் முளைக்கும் அவை ‘கருவேலமர முட்கள்’ எனப்படும்” என்று சொன்னார்கள். (தொடர்ந்து கூறினார்கள்:) இறைநம்பிக்கையாளர் அந்தப் பாலத்தை கண் சிமிட்டலைப் போன்றும், மின்னலைப் போன்றும், காற்றைப் போன்றும், பந்தயக் குதிரைகள் மற்றும் ஒட்டகங்களைப் போன்றும் (விரைவாகக்) கடந்துவிடுவார். எந்தக் காயமுமின்றி தப்பிவிடுவோரும் உண்டு. காயத்துடன் தப்புவோரும் உண்டு. மூர்ச்சையாகி நரக நெருப்பில் விழுவோரும் உண்டு. இறுதியில் அவர்களில் கடைசி ஆள் கடுமையாக இழுத்துச்செல்லப்படுவார். பின்னர், தாம் தப்பித்துவிட்டோம் என்பதை இறைநம்பிக்கையாளர்கள் காணும்போது தம் சகோதரர்களுக்காக சர்வ அதிகாரமும் படைத்த (இறை)வனிடம் அன்று அவர்கள் கடுமையாக மன்றாடுவார்கள். அந்த அளவிற்கு (இம்மையில்) உங்களுக்குத் தெளிவாகி விட்ட உரிமைக்காகக்கூட நீங்கள் என்னிடம் வலியுறுத்திக் கேட்டிருக்கமாட்டீர்கள். அப்போது அவர்கள், “எங்கள் இறைவா! (இவர்கள்) எங்களுடன் தொழுது கொண்டிருந்தார்கள்; எங்களுடன் நோன்பு நோற்றார்கள்; எங்களுடன் (மற்ற) நல்லறங்கள் புரிந்துகொண்டிருந்தார்கள் (எனவே இவர்களை நீ காப்பாற்றுவாயாக)” என்று வேண்டுவார்கள். அப்போது உயர்ந்தோன் அல்லாஹ், “நீங்கள் சென்று, எவருடைய உள்ளத்தில் ஒரு பொற்காசு (தீனார்) அளவுக்கு இறைநம்பிக்கை இருக்கக் காண்கின்றீர்களோ அவர்களை (நரகத்திலிருந்து) வெளியேற்றுங்கள்” என்று கூறுவான். அவ்வாறே அவர்களும் (நரகவாசி களிடம்) செல்வார்கள். அவர்களின் முகங்களைக் கரிக்கக் கூடாதென நரகத்திற்கு அல்லாஹ் தடை விதித்துவிடுவான். அப்போது (அந்த நரகவாசிகளில்) சிலர் தமது பாதம் நரகத்திற்குள் மறையும் அளவிற்கு, பாதி கால்கள் மறையும் அளவிற்கு நரகினுள் கிடப்பார்கள். உடனே அவர்கள் தமக்கு அறிமுகமானவர்களை (நரகத்திலிருந்து) வெளியேற்றுவார்கள். பிறகு மீண்டும் (இறைவனிடம்) செல்வார்கள். “எவரது உள்ளத்தில் பாதி பொற்காசு அளவுக்கு இறைநம்பிக்கை உள்ளதெனக் காண்கிறீர்களோ அவர்களையும் வெளியேற்றுங்கள்” என்பான். அவ்வாறே அவர்கள் தமக்குத் தெரிந்தவர்களை வெளியேற்றிவிட்டு மறுபடியும் (இறைவனிடம்) வருவார்கள். அப்போது அவன், “எவரது உள்ளத்தில் கடுகளவு இறைநம்பிக்கை இருக்கக் கண்டீர்களோ அவர்களையும் (நரகத்திலிருந்து) வெளியேற்றுங்கள்” என்று சொல்வான். அவ்வாறே அவர்கள் (வந்து) தமக்கு அறிமுகமானவர்களை (அதிலிருந்து) வெளியேற்றுவார்கள். இதன் அறிவிப்பாளரான அபூசயீத் (ரலி) அவர்கள் கூறுகிறார்கள்: (இதை) நீங்கள் நம்பாவிட்டால், “நிச்சயமாக அல்லாஹ் எவருக்கும் அணுவளவுகூட அநீதி இழைக்கமாட் டான். அணுவளவு நன்மை செய்திருந் தாலும் அதை இரட்டிப்பாக்குவான்” எனும் (4:40ஆவது) இறைவசனத்தை ஓதிக் கொள்ளுங்கள். இவ்வாறு இறைத்தூதர்கள், வானவர் கள், இறைநம்பிக்கையாளர்கள் ஆகியோர் (தத்தமது தகுதிக்கேற்ப) பரிந்துரை செய்வார்கள். அப்போது சர்வ அதிகாரம் படைத்த (இறை)வன் “(இனி) என் பரிந்துரை (மட்டுமே) எஞ்சியிருக்கிறது” என்று கூறிவிட்டு, நரகத்திலிருந்து ஒரு கைப்பிடி அளவு மக்களை அள்ளியெடுத்து அவர்களை வெளியேற்றுவான். அவர்கள் கரிந்துபோயிருப்பார்கள். ஆகவே, சொர்க்க வாயிலிலுள்ள ஒரு நதியில் அவர்கள் போடப்படுவார்கள் அதற்கு ‘ஜீவ நீர்’ (‘மாஉல் ஹயாத்’) என்று பெயர். உடனே அவர்கள் சேற்று வெள்ளத்தில் விதைப்பயிர் முளைப்பதைப் போன்று நதியின் இருமருங்கிலும் முளைத்து (நிறம் மாறி)விடுவார்கள். பாறையின் ஓரத்திலும் மரத்தின் ஓரத்திலும் இந்தப் பயிரை நீங்கள் பார்த்திருப்பீர்கள். அதில் வெயில் பக்கமாக இருப்பது பச்சையாகவும், நிழல் பக்கமாக இருப்பது வெள்ளையாகவும் இருக்கும். ஆக, அவர்கள் (அந்த நதியிலிருந்து) வெளியேறும்போது முத்தைப் போன்று (புதுப் பொலிவுடன்) வெளியேறுவார்கள். அவர்களது கழுத்தில் (நரகத்திலிருந்து விடுதலை பெற்றவர்கள் என்பதற்கான) முத்திரை பதிக்கப்படும். பிறகு அவர்கள் சொர்க்கத்தினுள் நுழைவார்கள். அப்போது சொர்க்கவாசிகள் (இவர்களைப் பார்த்து), “இவர்கள் பேரருளாளனால் விடுதலை செய்யப்பட்டவர்கள்; இவர்கள் எந்த நற்செயலும் புரியாமல், எந்த நன்மையும் ஏற்கெனவே செய்திராமல் அவனே இவர்களைச் சொர்க்கத்தினுள் பிரவேசிக்கச்செய்தான்” என்று கூறுவர். பிறகு (அவர்களிடம்) நீங்கள் காண்கிறீர்களே இதுவும் உங்களுக்கு உண்டு; இதைப் போன்று இன்னொரு மடங்கும் உங்களுக்கு உண்டு” என்று (நற்செய்தி) சொல்லப்படும்.79 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7440,
			"arabicnumber": 7440,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் இறைநம்பிக்கையாளர் கள் கவலைப்படும் அளவுக்கு நிறுத்தி வைக்கப்படுவார்கள். அப்போது அவர்கள், “(அதி பயங்கரமான) இந்த இடத்திலிருந்து நம்மை விடுவிக்க நம் இறைவனிடம் பரிந்துரைக்கும்படி (யாரையாவது) நாம் கேட்டுக்கொண்டால் என்ன?” என்று பேசிக்கொள்வார்கள். பிறகு அவர்கள் ஆதம் (அலை) அவர்களிடம் சென்று, “நீங்கள் மனிதர்களின் தந்தை ஆதம் ஆவீர்; அல்லாஹ் தனது கையால் உங்களைப் படைத்தான்; தனது சொர்க்கத்தில் உங்களை குடியிருக்கச் செய்தான்; தன்னுடைய வானவர்களை உங்களுக்குச் சிரம்பணியச் செய்தான்; எல்லாப் பொருட்களின் பெயர்களையும் உங்களுக்கு அவன் கற்பித்தான். (எனவே,) இந்த(ச் சோதனையான) கட்டத்திலிருந்து எங்களை விடுவிப்பதற்காக உங்கள் இறைவனிடத்தில் எங்களுக்காகப் பரிந்துரை செய்யுங்கள்” என்று கோருவர். அதற்கு ஆதம் (அலை) அவர்கள், “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று கூறிவிட்டு, உண்ணக் கூடாதெனத் தடை விதிக்கப்பட்டிருந்த மரத்திலிருந்து புசித்துவிட்டதால் தாம் புரிந்த தவற்றினை அவர்கள் எடுத்துக் கூறுவார்கள். “(எனக்குப் பின்) பூமியிலுள்ளவர்களுக்கு இறைவனால் நியமிக்கப்பட்ட (முக்கியமான) இறைத்தூதர்களில் முதலாமவரான நூஹ் (அலை) அவர்களிடம் செல்லுங்கள்” என்று கூறுவார்கள். உடனே இறைநம்பிக்கையாளர்கள் நூஹ் (அலை) அவர்களிடம் செல்வார்கள். அப்போது அன்னாரும் “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று கூறி, அறியாமல் தம் இறைவனிடம் வேண்டியதால் ஏற்பட்ட தமது தவற்றினை அவர்கள் நினைவு கூர்வார்கள். பிறகு, “நீங்கள் பேரருளாள(ன் இறைவ)னின் உற்றநண்பர் இப்ராஹீம் (அலை) அவர்களிடம் செல்லுங்கள்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் இப்ராஹீம் (அலை) அவர்களிடம் செல்வார்கள். அப்போது அவர்களும், “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று சொல்லிவிட்டு, தாம் (உலக வாழ்வில்) சொன்ன மூன்று பொய்களை எடுத்துக்கூறுவார்கள். பிறகு, “நீங்கள் மூசா (அலை) அவர்களிடம் செல்லுங்கள். அவருக்கு அல்லாஹ் தவ்ராத் (வேதத்)தை வழங்கி, அவருடன் உரையாடி, தன்னுடன் கலந்துரையாடும் அளவுக்கு நெருக்கம் அளித்த அடியார் ஆவார் அவர்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் மூசா (அலை) அவர்களிடம் செல்வார்கள். அப்போது அன்னாரும், “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று சொல்லிவிட்டு, (உலகில்) ஒருவரைக் கொலை செய்துவிட்டதால் தாம் செய்த குற்றத்தை எடுத்துக்கூறுவார்கள். பிறகு “நீங்கள் அல்லாஹ்வின் அடியாரும் தூதருமான, அவனது ஆவியும் வார்த்தையுமான ஈசா (அலை) அவர்களிடம் செல்லுங்கள்” என்று மூசா கூறுவார்கள். உடனே இறைநம்பிக்கையாளர்கள் ஈசா (அலை) அவர்களிடம் செல்வார்கள். அவர்களும் “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை; இறைவனால் முன்பின் பாவங்கள் மன்னிக்கப்பட்ட அடியாரான முஹம்மத் (ஸல்) அவர்களிடம் செல்லுங்கள்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் என்னிடம் வருவார்கள். அப்போது நான் என் இறைவனை அவனது இல்ல(மான சொர்க்க)த்தில் சந்திக்க அனுமதி கோருவேன். எனக்கு அதற்கான அனுமதி வழங்கப்படும். நான் என் இறைவனைக் காணும்போது சஜ்தாவில் விழுந்துவிடுவேன். தான் நாடிய வரை அல்லாஹ் என்னை (அப்படியே) விட்டுவிடுவான். பிறகு அவன், “எழுங்கள், முஹம்மதே! சொல்லுங்கள்; செவியேற்கப்படும். பரிந்துரை செய்யுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும். கேளுங்கள்; உங்களுக்குத் தரப்படும்” என்று கூறுவான். அப்போது நான் எனது தலையை உயர்த்தி இறைவன் எனக்குக் கற்றுத்தரும் புகழ் மொழிகளைக் கூறி என் இறைவனைப் போற்றிப் புகழ்வேன். பிறகு நான் பரிந்துரை செய்வேன். அப்போது இறைவன் (நான் யார் யாருக்குப் பரிந்துரை செய்யலாம் என்பதை வரையறுத்து) எனக்கு வரம்பு விதிப்பான். பின்னர் நான் (அவனது இல்லத்திலிருந்து) வெளியேறி அவர்களைச் சொர்க்கத்திற்கு அனுப்பிவைப்பேன். -கத்தாதா (ரஹ்) அவர்கள் கூறினார்கள்: “பின்னர் நான் (அவனது இல்லத்திலிருந்து) புறப்பட்டுச் சென்று (நரகத்திலிருந்து) அவர்களை வெளியேற்றி, சொர்க்கத்திற்குள் அனுப்பிவைப்பேன்” என்றும் அனஸ் (ரலி) அவர்கள் கூற நான் கேட்டேன்.- பிறகு மீண்டும் (இரண்டாம் முறையாக) என் இறைவனை அவனது இல்லத்தில் சந்திக்க நான் அனுமதி கோருவேன். எனக்கு அதற்கான அனுமதி வழங்கப்படும். நான் இறைவனைக் காணும்போது சஜ்தாவில் விழுவேன். தான் நாடிய வரை அல்லாஹ் என்னை (அப்படியே) விட்டுவிடுவான். பின்னர் “முஹம்மதே! எழுங்கள். சொல்லுங்கள்; செவியேற்கப்படும். பரிந்துரை செய்யுங்கள்; ஏற்கப்படும். கேளுங்கள்; தரப்படும்” என்று கூறுவான். அப்போது நான் எனது தலையைத் தூக்கி, இறைவன் எனக்குக் கற்றுத்தரும் புகழ்மாலைகளைக் கூறி அவனைப் போற்றிப் புகழ்வேன். பின்னர் நான் பரிந்துரைப்பேன். (நான் யார்யாருக்குப் பரிந்துரை செய்ய வேண்டுமென) எனக்கு அவன் வரம்பு விதிப்பான். அப்போது நான் (அவனது இல்லத்திலிருந்து) வெளியேறிச் சென்று அவர்களை சொர்க்கத்திற்கு அனுப்பி வைப்பேன். -”நான் வெளியேறிச் சென்று, அவர் களை நரகத்திலிருந்து வெளியேற்றி சொர்க்கத்திற்கு அனுப்பிவைப்பேன் என்று அனஸ் (ரலி) அவர்கள் அறிவித்ததை நான் கேட்டேன்” என கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்.- பின்னர் மூன்றாம் முறையாக மறுபடி யும் என் இறைவனை அவனது இல்லத் தில் சந்திக்க நான் அனுமதி கேட்பேன். எனக்கு அந்த அனுமதி வழங்கப்படும். இறைவனை நான் காணும்போது சிரவணக்கத்தில் விழுவேன். தான் நாடிய வரை (அப்படியே) என்னை அல்லாஹ் விட்டுவிடுவான். பிறகு “முஹம்மதே! எழுங்கள். சொல்க; செவியேற்கப்படும். பரிந்துரை செய்க; ஏற்கப்படும். கோருக; அது தரப்படும்” என இறைவன் கூறுவான். அப்போது நான் எழுந்து, என் இறைவன் எனக்குக் கற்றுத்தரும் புகழ்மாலைகளைக் கூறி அவனைப் போற்றிப் புகழ்வேன். பின்னர் பரிந்துரைப்பேன். அவன் எனக்கு வரம்பு விதிப்பான். நான் வெளியேறிச் சென்று, அவர்களைச் சொர்க்கத்திற்கு அனுப்பிவைப்பேன். -”நான் வெளியேறிச் சென்று அவர்களை நரகத்திலிருந்து வெளியேற்றி சொர்க்கத்திற்கு அனுப்பிவைப்பேன் என்று கூறியதை நான் கேட்டேன்” என கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்.- “இறுதியில் குர்ஆன் தடுத்துவிட்ட, அதாவது நிரந்தர நரகம் கட்டாயமாகிவிட்டவர்களைத் தவிர வேறு யாரும் நரகத்தில் இருக்கமாட்டார்கள்” என்று (நபி (ஸல்) அவர்கள்) கூறிவிட்டு, “(நபியே!) உம் இறைவன் உம்மை (‘மகாமும் மஹ்மூத்’ எனும்) உயர் தகுதிக்கு அனுப்பலாம்” எனும் (17:79 ஆவது வசனத்தை) ஓதினார்கள். பிறகு இந்த ‘மகாமும் மஹ்மூத்’ எனும் இடம் உங்கள் நபிக்காக வாக்களிக்கப்பட்ட இடமாகும்” என்று கூறினார்கள்.80 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7441,
			"arabicnumber": 7441,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்சாரிகளிடம் ஆளனுப்பி அவர்களை ஒரு கூடாரத்தினுள் ஒன்றுதிரட்டினார்கள். அவர்களிடம், “அல்லாஹ்வையும் அவனுடைய தூதரையும் (மறுமையில்) நீங்கள் சந்திக்கும்வரை பொறுமையைக் கைகொள்ளுங்கள். ஏனெனில், நான் (அந்நாளில்) ‘கவ்ஸர்’ தடாகத்தின் அருகே இருப்பேன்” என்று சொன்னார்கள்.81 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7442,
			"arabicnumber": 7442,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இரவு நேரத்தில் தஹஜ்ஜுத் தொழுகை தொழும்போது (பின்வருமாறு) பிரார்த்திப்பார்கள்: இறைவா! எங்கள் அதிபதியே! உனக்கே புகழ் அனைத்தும். நீயே வானங்கள் மற்றும் பூமியின் நிர்வாகி ஆவாய். உனக்கே புகழ் அனைத்தும். நீயே வானங்கள், பூமி மற்றும் அவற்றில் உள்ளவர்களின் இறைவன் ஆவாய். உனக்கே புகழ் அனைத்தும். நீயே வானங்கள், பூமி மற்றும் அவற்றில் உள்ளவர்களின் ஒளியும் ஆவாய். நீயே உண்மை. உன் சொல் உண்மை. உன் வாக்கு உண்மை. உன் சந்திப்பு உண்மை. சொர்க்கம் உண்மை. நரகம் உண்மை. மறுமை நாள் உண்மை. இறைவா! உனக்கே நான் கீழ்ப்படிந் தேன். உன்மீதே நம்பிக்கை கொண்டேன். உன்னையே சார்ந்துள்ளேன். உன்னிடமே என் வழக்குகளைக் கொண்டுவந்தேன். உன்னிடமே நீதி கேட்பேன். ஆகவே, நான் முந்திச் செய்த, பிந்திச் செய்கின்ற, இரகசியமாகச் செய்த, பகிரங்கமாகச் செய்த பாவங்களையும், என்னைவிட எதை நீ நன்கு அறிந்துள்ளாயோ அதையும் மன்னித்தருள்வாயாக. உன்னைத் தவிர வேறு இறைவனில்லை.82 (மேற்கண்ட ஹதீஸில் ‘நிர்வாகி’ என்ப தைக் குறிக்க ‘கய்யிம்’ எனும் சொல் ஆளப்பட்டுள்ளது.) வேறுசில அறிவிப்பு களில் ‘கய்யாம்’ மற்றும் ‘கய்யூம்’ ஆகிய சொற்கள் பயன்படுத்தப்பட்டுள்ளன. ‘அனைத்தையும் கண்காணிப்பவன்’ என்பது பொருள். உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் (2:255ஆவது வசனத்தின் மூலத்திலுள்ள ‘அல்கய்யூம்’ என்பதை) ‘அல்கய்யாம்’ என ஓதியுள்ளார்கள். இரண்டுமே புகழைக் குறிக்கும் (மிகைச்) சொற்கள்தான். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7443,
			"arabicnumber": 7443,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒவ்வொருவருடனும் அல்லாஹ் (மறுமை நாளில் தனித்தனியாகப்) பேசாமலிருக்கமாட்டான். அப்போது அல்லாஹ்வுக்கும் உங்களுக்கும் இடையே மொழிபெயர்ப்பாளரும் இருக்கமாட்டார்; தடுக்கின்ற திரையும் இருக்காது. இதை அதீ பின் ஹாத்திம் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.83 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7444,
			"arabicnumber": 7444,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இரு சொர்க்கங்கள் உண்டு. அவற்றின் பாத்திரங்களும் இதரப் பொருட்களும் வெள்ளியால் ஆனவை; (வேறு) இரு சொர்க்கங்களும் உள்ளன. அவற்றின் பாத்திரங்களும் இதரப் பொருட்களும் பொன்னால் ஆனவையாகும். ‘அத்ன்’ எனும் சொர்க்கத்தில் இருப்பவர்கள் தங்கள் இறைவனைக் காண்பதற்கு, அவன் மேலுள்ள ‘பெருமை’ எனும் மேலாடை தவிர வேறெந்தத் தடையும் இராது. இதை அபூமூசா அப்துல்லாஹ் பின் கைஸ் (ரலி) அவர்கள் அறிவிக்கிறார் கள்.84 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7445,
			"arabicnumber": 7445,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “யார் பொய்ச் சத்தியத்தின் மூலம் ஒரு முஸ்லிமின் செல்வத்தைப் பறித்துக்கொள் கிறாரோ அவர்மீது அல்லாஹ் கோபம் கொண்ட நிலையிலேயே அவனை அவர் சந்திப்பார்” என்று கூறினார்கள். பிறகு இதை உண்மைப்படுத்துகின்ற இறை வசனத்தை ஓதினார்கள்: எவர் அல்லாஹ்வின் உடன்படிக்கைக்கும் தம் சத்தியங்களுக்கும் பதிலாக அற்ப விலையைப் பெறுகின்றார்களோ அவர்களுக்கு மறுமையில் எந்த நற்பேறும் கிடையாது; அவர்களிடம் அல்லாஹ் பேசமாட்டான் (3:77).85 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7446,
			"arabicnumber": 7446,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் மறுமை நாளில் மூன்று பேரிடம் பேசமாட்டான்; அவர்களை ஏறெடுத்துப் பார்க்கவுமாட்டான். ஒருவர் (தமது) விற்பனைப் பொரு ளுக்கு (அதைக் கொள்முதல் செய்தபோது உண்மையில்) தாம் கொடுத்த விலையை விட அதிக விலை கொடுத்ததாகப் பொய்ச் சத்தியம் செய்கிறார். மற்றொருவர், ஒரு முஸ்லிமின் செல்வத்தை அபகரிப்பதற்காக அஸ்ர் தொழுகைக்குப் பிறகு (மக்கள் ஒன்றுகூடும் நேரத்தில்) பொய்ச் சத்தியம் செய்கிறார். வேறொருவர், தமது தேவைக்குப் போக மிஞ்சிய தண்ணீரை (வழிப் போக்கருக்குத் தராமல்) தடுக்கின்றார். (அவரிடம்) அல்லாஹ் மறுமை நாளில் “நீ தேடிச் சம்பாதிக்காத பொருளை (நீரை) நீ தர மறுத்ததைப் போன்று இன்று என் அருளை உனக்கு வழங்க மறுக்கிறேன்” என்று கூறுவான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.86 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7447,
			"arabicnumber": 7447,
			"text": "அபூபக்ரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், “வானங்களும் பூமியும் படைக்கப்பட்ட நாளில் இருந்த (பழைய) நிலைக்குக் காலம் திரும்பி விட்டது. ஆண்டு என்பது பன்னிரண்டு மாதங்களாகும். அவற்றில் நான்கு மாதங்கள் புனிதமானவை. (அவற்றில்) மூன்று மாதங்கள் தொடர்ந்து வரக்கூடியவை. அவை துல்கஅதா, துல்ஹிஜ்ஜா மற்றும் முஹர்ரம் ஆகியனவாகும். (மற்றொன்று) ஜுமாதல் ஆகிராவுக்கும் ஷஅபான் மாதத்திற்கும் இடையிலுள்ள ‘முளர்’ குலத்தாரின் ரஜப் மாதமாகும்” என்று கூறிவிட்டு, “இது எந்த மாதம்?” என்று கேட்டார்கள். நாங்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிவர்” என்றோம். அப்போது அவர்கள் அதற்கு வேறு பெயர் சூட்டுவார்களோ என்று நாங்கள் எண்ணுமளவுக்கு மௌனமாக இருந்துவிட்டு, “இது துல்ஹிஜ்ஜா மாதம் அல்லவா?” என்று கேட்டார்கள். நாங்கள் ‘ஆம்’ என்றோம். “இது எந்த நகரம்?” என்று கேட்டார்கள். நாங்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிவர்” என்றோம். அப்போது அவர்கள் அதற்கு வேறு பெயர் சூட்டுவார்களோ என்று நாங்கள் எண்ணுமளவுக்கு மௌனமாக இருந்துவிட்டு, “இது (புனித) நகரமல்லவா?” எனக் கேட்க, நாங்கள், ‘ஆம்’ என்று பதிலளித்தோம். “இது எந்த நாள்?” என்று அவர்கள் கேட்டார்கள். நாங்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிவர்” என்று சொன்னோம். அப்போதும் அவர்கள், அதற்கு வேறு பெயர் சூட்டுவார்களோ என்று நாங்கள் எண்ணுமளவிற்கு மௌனமாக இருந்துவிட்டு, “இது நஹ்ருடைய (துல்ஹிஜ்ஜா பத்தாம்) நாள் அல்லவா?” எனக் கேட்டார்கள். நாங்கள், “ஆம்” என்றோம். (பிறகு,) “உங்களது புனிதமிக்க இந்நகரத்தில் உங்களுடைய புனிதமிக்க இம்மாதத்தில் இன்றைய தினம் எந்த அளவு புனிதமானதோ அந்த அளவிற்கு உங்கள் உயிர்களும் உங்கள் உடைமைகளும் -உங்கள் மானமும்- உங்களுக்குப் புனிதமானவையாகும். நீங்கள் (மறுமையில்) உங்கள் இறைவனைச் சந்திப்பீர் கள். அப்போது அவன் உங்களிடம் உங்கள் செயல்கள் குறித்து விசாரணை செய்வான். அறிந்துகொள்ளுங்கள்: எனக்குப் பிறகு ஒருவர் மற்றவரின் கழுத்தை வெட்டி மாய்த்துக்கொள்ளும் வழிகேடர்களாக நீங்கள் மாறிவிடாதீர்கள். இதோ! இங்கு வந்தவர்கள் வராதவர்களுக்கு (நான் சொன்ன கட்டளைகளை) அறிவித்துவிடுங்கள். ஏனெனில், இந்தச் செய்தி எவரிடம் தெரிவிக்கப்படுகிறதோ அவர், தாம் யாரிடமிருந்து இதைக் கேட்டாரோ அவர்களில் சிலரைவிட (அதாவது தமக்கு இதைச் சொன்னவரைவிட) நன்கு (புரிந்து) பாதுகாப்பவராயிருக்கலாம்” என்று கூறினார்கள். -இதன் அறிவிப்பாளர்களில் ஒருவரான முஹம்மத் பின் சீரீன் (ரஹ்) அவர்கள் இதை அறிவிக்கும்போது, “நபி (ஸல்) அவர்கள் உண்மை சொன்னார்கள்” என்று கூறுவார்கள்.- பிறகு, நபி (ஸல்) அவர்கள் “நான் (உங்களிடம் இறைச்செய்திகள் அனைத்தையும்) சேர்த்துவிட்டேனா? நான் (உங்களிடம் இறைச்செய்திகள் அனைத்தையும்) சேர்த்துவிட்டேனா? என்று (இரண்டு முறை) கேட்டார்கள்.87 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7448,
			"arabicnumber": 7448,
			"text": "உசாமா பின் ஸைத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களின் புதல்வியரில் ஒருவருடைய மகன் இறக்கும் தறுவாயில் இருந்தார். ஆகவே, நபி (ஸல்) அவர்கள் தம்மிடம் வந்து சேரும்படி அந்தப் புதல்வியார் சொல்லியனுப்பினார். அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ் எடுத்துக்கொண்டதும் கொடுத்ததும் அவனுக்கே உரியதாகும். ஒவ்வொன்றுக்கும் ஒரு குறிப்பிட்ட தவணை உண்டு. ஆகவே, பொறுமையைக் கைகொள்வீராக; நன்மையை எதிர்பார்ப்பீராக” என்று சொல்லியனுப்பினார்கள். (மீண்டும்) அவர் அல்லாஹ்வின் மீது ஆணையிட்டுக் (கட்டாயம் தம்மிடம் வர வேண்டுமெனக்) கூறியனுப்பினார். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் புதல்வியின் வீட்டுக்குச் செல்ல) எழுந்தார்கள். நானும், முஆத் பின் ஜபல் (ரலி), உபை பின் கஅப் (ரலி), உபாதா பின் அஸ்ஸாமித் (ரலி) ஆகியோரும் அவர்களுடன் எழுந்தோம். நாங்கள் (வீட்டுக்குள்) நுழைந்தவுடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அந்தச் சிறுவரைக் கொடுத்தார்கள். அந்தச் சிறுவரின் மூச்சு (சுவாசிக்க முடியாமல்) நெஞ்சுக்குள் திணறிக்கொண்டிருந்தது. -அது தோல் துருத்தியைப் போன்று (ஏறி இறங்கிக்கொண்டு) இருந்தது என்று அறிவிப்பாளர் கூறியதாக நான் (அபூ உஸ்மான் அந்நஹ்தீ) எண்ணுகிறேன்.- (இதைக் கண்ணுற்ற) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழுதார்கள். அப்போது (அங்கிருந்த) சஅத் பின் உபாதா (ரலி) அவர்கள், “(அல்லாஹ்வின் தூதரே!) நீங்கள் அழுகின்றீர்களா?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “அல்லாஹ் தன் அடியார்களில் இரக்கமுடையவர்க்கே இரக்கம் காட்டுகிறான்” என்று சொன்னார்கள்.88 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7449,
			"arabicnumber": 7449,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: சொர்க்கமும் நரகமும் தம் இறைவனிடம் வாக்குவாதம் செய்தன. அப்போது சொர்க்கம், “என் இறைவா! எனக்கென்ன ஆயிற்று? மக்களில் பலவீனர்களும் சாமானியர்களும்தானே எனக்குள் நுழைகின்றார்கள்!” என்று கேட்டது. நரகம் “நான் தற்பெருமைக்காரர்களுக்கு மட்டுமே உரியவனாகிவிட்டேனே!” என்று முறையிட்டது. அப்போது அல்லாஹ் சொர்க்கத்தி டம், “நீ என் கருணை(யின் பரிசு) ஆவாய்” என்று சொன்னான். நரகத்திடம் நீ நான் அளிக்கும் வேதனை ஆவாய். நான் விரும்புகின்றவர்களை உன் மூலம் தண்டிக்கிறேன்” என்று சொல்லிவிட்டு -இரண்டையும் நோக்கி- “உங்கள் ஒவ்வொருவரையும் நிரப்புபவர்கள் (மக்களிடையே) உள்ளனர்” என்று கூறுவான். மேலும், நபி (ஸல்) அவர்கள் கூறினார்கள்: சொர்க்கம் இருக்கிறதே (அதில் தகுதியானோர் நுழைவார்கள்). அல்லாஹ் தன் படைப்புகளில் யாருக்கும் அநீதி இழைப்பதில்லை. அவன், தான் நாடியவர்களை நரகத்திற்காகப் படைக்கின்றான். நரகத்தில் அவர்கள் போடப்படும்போது, “இன்னும் இருக்கிறதா?” என அது மும்முறை கேட்கும். இறுதியில் இறைவன் அதில் தனது பாதத்தை வைக்க, அது நிரம்பிவிடும்; அதன் ஒரு பகுதி மற்றொரு பகுதியுடன் இணைக்கப்படும். போதும்; போதும்; போதும் என அது கூறும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.89 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7450,
			"arabicnumber": 7450,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மக்கள் சிலர் தாங்கள் செய்த பாவங்களுக்குத் தண்டனையாக நரக நெருப்பால் தீண்டப்பட்டு, அவர்களது சருமத்தின் நிறமே மாறிவிடும். பிறகு அவர்களை அல்லாஹ், தன் தனிக் கருணையால் சொர்க்கத்தில் அனுமதிப்பான். அவர்களுக்கு ‘ஜஹன்னமிய்யூன்’ (நரக விடுதலைபெற்றோர்) என்று சொல்லப்படும். இதை அனஸ் (ரலி) அவர்கள் அறி விக்கிறார்கள்.90 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7451,
			"arabicnumber": 7451,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: யூதப் பாதிரியார் ஒருவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, “முஹம்மதே! மறுமை நாளில் அல்லாஹ் வானத்தை ஒரு விரலிலும் பூமியை ஒரு விரலிலும் மலைகளை ஒரு விரலிலும் மரம் மற்றும் நதிகளை ஒரு விரலிலும் இதர படைப்புகள் அனைத்தையும் ஒரு விரலிலும் (நிறுத்தி) வைத்துக்கொண்டு தனது கரத்தால் (சைகை செய்தவாறு) ‘நானே அரசன்’ எனக் கூறுவான்” என்று சொன்னார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சிரித்துவிட்டு, “அவர்கள் (யூதர்கள்) அல்லாஹ்வை எப்படி மதிக்க வேண்டுமோ அப்படி மதிக்கவில்லை” எனும் (6:91ஆவது) வசனத்தைக் கூறினார்கள்.91 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7452,
			"arabicnumber": 7452,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் (என் சிறிய தாயாரும் நபியவர்களின் துணைவியாருமான) மைமூனா (ரலி) அவர்களது இல்லத்தில், இரவில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது தொழுகை எவ்வாறுள்ளது என்பதைப் பார்ப்பதற்காக (ஒருநாள்) இரவு தங்கினேன். அப்போது மைமூனா அவர்களிடம் நபி (ஸல்) அவர்கள் தங்கியிருந்தார்கள். நபி (ஸல்) அவர்கள் தம் துணைவியாருடன் சிறிது நேரம் பேசிவிட்டுத் தூங்கிவிட்டார்கள். ‘இரவின் இறுதி மூன்றில் ஒரு பகுதி வந்தபோது’ அல்லது அதன் ‘ஒரு பகுதி வந்தபோது’ அவர்கள் (எழுந்து) அமர்ந்துகொண்டு வானத்தை நோக்கியவாறு “நிச்சயமாக வானங்கள் மற்றும் பூமியின் படைப்பிலும், இரவு- பகல் மாறி மாறிவருவதிலும் அறிவுடையோருக்குப் பல சான்றுகள் உள்ளன” எனும் (3:190 ஆவது) வசனத்தை ஓதினார்கள். பிறகு எழுந்து அங்கத் தூய்மை (உளூ) செய்தார்கள்; பல் துலக்கினார்கள். பிறகு, பதினொன்று ரக்அத்கள் தொழுதார்கள். பின்னர் பிலால் (ரலி) அவர்கள் ஃபஜ்ர் தொழுகைக்கு அழைப்புக்கொடுத்தார்கள். உடனே இரண்டு ரக்அத்கள் (ஃபஜ்ருடைய சுன்னத்) தொழுதுவிட்டுப் புறப்பட்டு பள்ளிவாசலுக்குச் சென்று மக்களுக்கு சுப்ஹ் தொழுவித்தார்கள்.92 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7453,
			"arabicnumber": 7453,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் படைப்புகளை படைத்த போது தன்னிடமுள்ள அரியணையின் (அர்ஷின்) மேலே ‘என் கருணை என் கோபத்தை முந்திவிட்டது’ என்று தன்னிடம் எழுதி வைத்துக் கொண்டான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.93 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7454,
			"arabicnumber": 7454,
			"text": "உண்மையே பேசியவரும் உண்மையே அறிவிக்கப்பட்டவருமான அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவரது கரு தம் தாயின் வயிற்றில் நாற்பது ‘பகல்’ அல்லது ‘இரவு’ சேமிக்கப்படுகிறது. பிறகு அதைப் போன்றே (நாற்பது நாட்கள்) அது (அட்டை போன்று கருப்பையின் சுவரைப் பற்றிப் பிடித்துத் தொங்கும்) ஒரு கருக்கட்டியாக மாறுகிறது. பிறகு அதைப் போன்றே (மேலும் நாற்பது நாட்கள் மெல்லப்பட்ட சக்கை போன்ற) ஒரு சதைப்பிண்டமாக மாறுகிறது. பிறகு அதனிடம் ஒரு வானவர் அனுப்பப்படுகிறார். அந்த வானவருக்கு நான்கு கட்டளைகள் பிறப்பிக்கப்படு கின்றன: அவர், (கருவாக இருக்கும்) அந்த மனிதனின் வாழ்வாதாரத்தையும், அவனது வாழ்நாளையும், செயல்பாட்டையும், அவன் (இறுதிக் கட்டத்தில்) நற்பேறற்றவரா; அல்லது நற்பேறுபெற்றவரா என்பதையும் (இறைவனின் கட்டளைப்படி) பதிவு செய்கிறார். பிறகு அவனுள் உயிர் ஊதப்படுகிறது. இதனால்தான், உங்களில் ஒருவர் சொர்க்கவாசிகளின் (நற்)செயல்களை செய்துகொண்டேயிருப்பார். இறுதியில் சொர்க்கத்திற்கும் அவருக்குமிடையே ஒரு முழம் (இடைவெளி)தான் இருக்கும். அதற்குள் அவரது விதி அவரை முந்திக்கொள்ள அவர் நரகவாசிகளின் செயலைச் செய்து, அதன் விளைவாக நரகம் புகுந்துவிடுவார். (இதைப் போன்றே) உங்களில் ஒருவர் நரகவாசிகளின் செயலை செய்து கொண்டேயிருப்பார். இறுதியில் நரகத்திற்கும் அவருக்குமிடையே ஒரு முழம் இடைவெளிதான் இருக்கும். அதற்குள் அவரது விதி அவரை முந்திக்கொள்ளும். அவர் சொர்க்கத்திற்குரியவர்களின் (நற்)செயல்களைச் செய்து, அதன் விளைவாக சொர்க்கம் புகுவார். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.94 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7455,
			"arabicnumber": 7455,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (வானவர் ஜிப்ரீல் (அலை) அவர்களிடம்), “ஜிப்ரீலே! நீங்கள் இப்போது எம்மைச் சந்திப்பதைவிட அதிகமாகச் சந்திக்கத் தடையாக இருப்பதென்ன?” என்று கேட்டார்கள். அப்போதுதான், “(நபியே!) உங்கள் இறைவனின் உத்தரவுபடியே தவிர (வானவர்களாகிய) நாங்கள் இறங்குவ தில்லை. எங்களுக்கு முன்னிருப்பவையும், பின்னிருப்பவையும், இரண்டுக்குமிடையே இருப்பவையும் அவனுக்குச் சொந்தமான வையே! (இதில் எதையும்) உங்கள் இறைவன் மறப்பவன் அல்லன்” எனும் (19:64ஆவது) இறைவசனம் அருளப் பெற்றது. இதுவே முஹம்மத் (ஸல்) அவர் களு(டைய கேள்வி)க்குப் பதிலாக அமைந்தது.95 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7456,
			"arabicnumber": 7456,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நான் மதீனாவிலுள்ள ஒரு வேளாண் பூமியில் (பேரீச்சந் தோப்பில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் நடந்து (போய்க்)கொண்டிருந்தேன். அப்போது நபி (ஸல்) அவர்கள் பேரீச்சமட்டை ஒன்றை ஊன்றியவாறு யூதர்கள் சிலரைக் கடந்துசென்றார்கள். அப்போது அவர்களில் ஒருவர் மற்றொருவரிடம், (நபியவர்களைச் சுட்டிக்காட்டி,) “இவரிடம் ‘உயிர்’ (ரூஹ்) பற்றிக் கேளுங்கள்!” என்றார். இன்னொருவர், “இவரிடம் கேட்காதீர்கள்! (நாம் விரும்பாத பதிலை அவர் சொல்லிவிடலாம்)” என்றார். பின்னர் அவர்கள் (அனைவரும் சேர்ந்து) நபி (ஸல்) அவர்களிடம் ‘ரூஹ்’ பற்றிக் கேட்டனர். எனவே, நபி (ஸல்) அவர்கள் பேரீச்சமட்டையை ஊன்றியவர்களாக எழுந்தார்கள். அப்போது அவர்களுக்குப் பின்னாலிருந்த நான், நபி (ஸல்) அவர்களுக்கு வேதஅறிவிப்பு (வஹீ) வருகிறது என அறிந்துகொண்டேன். பிறகு அவர்கள், “(நபியே!) உயிரைப் பற்றி அவர்கள் உம்மிடம் கேட்கின்றனர். கூறுக: உயிர் என்பது என் இறைவனின் கட்டளையால் உருவானது. உங்களுக்குச் சிறிதளவு அறிவே கொடுக்கப்பட்டுள்ளது” எனும் (17:85ஆவது) வசனத்தைக் கூறினார்கள். அப்போது அந்த யூதர்கள் ஒருவர் மற்றவரிடம் “அவரிடம் கேட்க வேண்டாமென உங்களிடம் முன்பே கூறினோமே!” என்றார்கள்.96 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7457,
			"arabicnumber": 7457,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் பாதையில் போராடு வதற்காகவும் அவனுடைய வாக்குகளை உண்மையென நிரூபிப்பதற்காகவும் மட்டுமே வெளியே புறப்பட்டு, அவனது பாதையில் போராடியவரை சொர்க்கத்தில் அனுப்புவதற்கு அல்லாஹ் பொறுப் பேற்றுக்கொண்டுள்ளான்; அல்லது அவர் பெற்ற நன்மையுடன், அல்லது (அந்த நன்மையுடன் சேர்த்து) போரில் கிடைத்த செல்வத்துடன் அவரை வீட்டிற்குத் திரும்பக் கொண்டுவர அல்லாஹ் பொறுப்பேற்றுக்கொண்டுள்ளான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.97 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7458,
			"arabicnumber": 7458,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் ஒரு மனிதர் வந்து, “அல்லாஹ்வின் தூதரே! ஒரு மனிதர் இன மாச்சரியத்திற்காகப் போரிடுகிறார். ஒருவர் வீரத்தை வெளிக்காட்டப் போரிடுகிறார். இன்னொருவர் பிறருக்குக் காட்டிக்கொள்வதற்காகப் போரிடுகிறார். இவர்களில் இறைவழியில் போரிடுகின்றவர் யார்?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “எவர் அல்லாஹ்வின் வாக்கே மேலோங்கியதாய் இருக்க வேண்டும் என்பதற்காகப் போரிடுகிறாரோ அவர்தான் அல்லாஹ்வின் பாதையில் போரிடுபவர் ஆவார்” என்று பதிலளித்தார்கள்.98 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7459,
			"arabicnumber": 7459,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் கட்டளை(யான மறுமை நாள்) வரும்வரை என் சமுதாயத்தாரில் ஒரு குழுவினர், (உண்மையை எதிர்க்கும்) மக்கள்மீது மேலாண்மை கொண்டவர்களாகவே இருந்துகொண்டிருப்பார்கள். இதை முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.99 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7460,
			"arabicnumber": 7460,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் கட்டளையை நிலைநிறுத்தும் ஒரு குழுவினர் என் சமுதாயத்தாரிடையே இருந்துகொண்டேயிருப்பர். அவர்களை நம்ப மறுப்பவர்களும் சரி, அவர்களுக்குத் துரோகம் இழைப்பவர்களும் சரி அவர்களுக்குத் தீங்கு செய்ய முடியாது. இறுதியில் அவர்கள் இதே நிலையில் இருந்துகொண்டிருக்க அல்லாஹ்வின் கட்டளை (மறுமை நாள்) வந்துவிடும். இதை முஆவியா (ரலி) அவர்கள் அறிவித்தபோது அங்கிருந்த மாலிக் பின் யுகாமிர் (ரஹ்) அவர்கள், “முஆத் பின் ஜபல் (ரலி) அவர்கள், ‘இந்தக் குழுவினர் ஷாம் நாட்டில் இருப்பார்கள்’ என்று சொல்ல நான் கேட்டேன்” என்று கூற, முஆவியா (ரலி) அவர்கள், “இதோ, இந்த மாலிக் ‘இந்தக் குழுவினர் ஷாம் நாட்டிலிருப்பார்கள்’ என்று முஆத் அவர்கள் சொன்னதாகக் கூறுகிறார்” என்றார்கள்.100 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7461,
			"arabicnumber": 7461,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தம் தோழர்கள் புடைசூழ (தன்னை நபி என வாதிட்ட மகா பொய்யன்) முசைலிமாவுக்கு அருகே நின்றார்கள். அப்போது (தலைமைப் பதவியை உங்களுக்குப்பின் எனக்குத் தர வேண்டும் என அவன் கேட்டான். அதற்கு) நபி (ஸல்) அவர்கள், “நீ இந்தப் பேரீச்சமட்டையின் துண்டை என்னிடம் கேட்டாலும் நான் அதை உனக்குத் தரமாட்டேன். அல்லாஹ் உன் விஷயத் தில் விதித்துள்ள கட்டளையை உன்னால் தாண்டிச் சென்றுவிட முடியாது. நீ (எனக்குக் கீழ்ப்படிய மறுத்து) முதுகைக் காட்டினால், அல்லாஹ் உன்னை அழித்துவிடுவான்” என்று சொன்னார்கள்.101 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7462,
			"arabicnumber": 7462,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் மதீனாவில் உள்ள ஒரு வேளாண் பூமியில் (பேரீச்சந் தோட்டத்தில்) நடந்து சென்றுகொண்டிருந்தபோது யூதர்கள் சிலரை நாங்கள் கடந்துசென்றோம். அப்போது நபி (ஸல்) அவர்கள் பேரீச்சமட்டை ஒன்றை ஊன்றியபடி வந்துகொண்டிருந்தார்கள். அப்போது யூதர்களில் ஒருவர் மற்றொருவரிடம் “அவரிடம் உயிர் (ரூஹ்) பற்றிக் கேளுங்கள்” என்று சொன்னார். அதற்கு மற்றவர் “அவரிடம் கேட்காதீர்கள்; இது தொடர்பாக நீங்கள் விரும்பாத பதிலை அவர் தந்துவிடக்கூடும்” என்று சொல்ல, மற்றவர்கள் “நாம் அவரிடம் நிச்சயம் கேட்போம்” என்று சொன்னார்கள். அப்போது அவர்களில் ஒருவர் நபி (ஸல்) அவர்களிடம் எழுந்து (வந்து), “அபுல் காசிமே! உயிர் (ரூஹ்) என்பதென்ன?” என்று கேட்டார். அப்போது நபி (ஸல்) அவர்கள் (அவருக்குப் பதில் எதுவும் சொல்லாமல்) மௌனமாக இருந்தார்கள். நான் நபி (ஸல்) அவர்களுக்கு வேதஅறிவிப்பு (வஹீ) அருளப்பெறுகின்றது என்று அறிந்துகொண்டேன். “(நபியே!) உம்மிடம் அவர்கள் உயிர் பற்றிக் கேட்கின்றார்கள். உயிர் என்பது என் இறைவனின் கட்டளையால் உருவானது. அவர்களுக்குச் சிறிதளவு அறிவே வழங்கப்பட்டுள்ளது” எனும் (17:85ஆவது) இறைவசனத்தை எடுத்துரைத்தார்கள்.102 அறிவிப்பாளர்களில் ஒருவரான அஃமஷ் (ரஹ்) கூறுகிறார்கள்: (‘உங்களுக்கு’ சிறிதளவு ஞானமே வழங்கப்பட்டுள்ளது என்பதற்குப் பதிலாக) ‘அவர்களுக்கு’ என்றுதான் எங்களது ஓதலில் உள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7463,
			"arabicnumber": 7463,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் பாதையில் போராடுவதற்காகவும் அவனுடைய வாக்குகளை உண்மையென நிரூபிப்பதற்காகவும் மட்டுமே தமது வீட்டைவிட்டுப் புறப்பட்டு, அவனது பாதையில் போராடியவரை சொர்க்கத்தில் அனுப்புவதற்கு அல்லாஹ் பொறுப்பேற்றுக்கொண்டுள்ளான்; அல்லது அவர் அடைந்துகொண்ட நன்மையுடன் அல்லது (அந்த நன்மையுடன் சேர்த்து) போரில் கிடைத்த செல்வத்துடன் அவரை வீட்டிற்குத் திரும்பக் கொண்டுவர அல்லாஹ் பொறுப்பேற்றுக்கொண்டுள்ளான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.103 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7464,
			"arabicnumber": 7464,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்விடம் நீங்கள் பிரார்த்தனை புரியும்போது வலியுறுத்திக் கேளுங்கள். நீ விரும்பினால் எனக்குக் கொடு என்று கேட்காதீர்கள். (வலியுறுத்திக் கேட்பது இறைவனை நிர்ப்பந்திப்பதாகாது.) ஏனெனில், அல்லாஹ்வை நிர்பந்திப்ப வர் எவருமில்லை. இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.106 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7465,
			"arabicnumber": 7465,
			"text": "அலீ பின் அபீதாலிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடமும் தம் புதல்வி ஃபாத்திமா (ரலி) அவர்களிடமும் ஒரு(நாள்) இரவு நேரத்தில் வந்தார்கள். எங்களிடம், “நீங்கள் (தஹஜ்ஜுத்) தொழவில்லையா?” என்று கேட்டார்கள். நான், “அல்லாஹ்வின் தூதரே! எங்கள் உயிர்களெல்லாம் அல்லாஹ்வின் கரத்தில்தானே இருக்கின்றன! அவன் எங்களை (தூக்கத்திலிருந்து) எழுப்ப நாடினால் எங்களை எழுப்பிவிடுவான்” என்று சொன்னேன். நான் இவ்வாறு சொன்னபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எனக்கு எந்த மறுமொழியும் கூறாமல் திரும்பிச் சென்றுவிட்டார்கள். திரும்பிச் சென்ற நபி (ஸல்) அவர்கள் தமது தொடையில் தட்டிக்கொண்டே “மனிதன் அதிகம் தர்க்கம் செய்பவனாக இருக்கின்றான்” என்று சொல்லிக்கொண்டிருந்ததை நான் கேட்டேன்.107 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7466,
			"arabicnumber": 7466,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஓர் இறைநம்பிக்கையாளரின் நிலையானது, நாணல் போன்றதாகும். காற்றடிக்கும் திசையில் அதன் இலை சாயும். காற்று (அடிப்பது) நின்றுவிட்டால் நேராக நிற்கும். இவ்வாறுதான் இறைநம்பிக் கையாளரும் சோதனைகளின்போது அலைக்கழிக்கப்படுகிறார். (எனினும், அவர் பொறுமை காப்பார்.) இறைமறுப்பாளனின் நிலையானது உறுதியாக நிமிர்ந்து நிற்கும் தேவதாரு மரத்தைப் போன்றதாகும். தான் நாடும்போது அதை அல்லாஹ் (ஒரேயடியாக) உடைத்து (சாய்த்து) விடுகின்றான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.108 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7467,
			"arabicnumber": 7467,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொற்பொழிவு மேடை (மிம்பர்) மீதிருந்து (உரையாற்றியபோது) சொன்னார்கள்: உங்களுக்குமுன் சென்ற சமுதாயத்தாருடன் நீங்கள் வாழும் காலத்தை ஒப்பிடும்போது நீங்கள் (இவ்வுலகில்) வாழ்வது அஸ்ர் தொழுகைக்கும் சூரியன் மறைவதற்கும் இடையிலான (குறுகிய) கால அளவேயாகும். ‘தவ்ராத்’ வேதக்காரர்களுக்கு அந்த வேதம் வழங்கப்பட்டது. அவர்கள் (காலை முதல்) நண்பகல்வரை அதன்படி செயல்பட்டார்கள்; பின்னர் சக்தி இழந்து விட்டார்கள். (கூலியாக) ஒவ்வொரு வருக்கும் ஒரு ‘கீராத்’ வழங்கப்பெற்றது. பின்னர் ‘இன்ஜீல்’ வேதக்காரர்களுக்கு அந்த வேதம் வழங்கப்பெற்றது. அவர்கள் (நண்பகல் முதல்) அஸ்ர் தொழுகைவரை அதன்படி செயல்பட்டுவிட்டுப் பின்னர் சக்தி இழந்துவிட்டார்கள். (கூலியாக) அவர்களுக்கும் ஒவ்வொரு ‘கீராத்’ வழங்கப்பெற்றது. பிறகு உங்களுக்கு குர்ஆன் வழங்கப்பெற்றது. நீங்கள் (அஸ்ர் முதல்) சூரியன் மறையும்வரை அதன்படி செயல்புரிந்தீர்கள். உங்களுக்கு இரண்டிரண்டு கீராத்கள் (கூலியாக) வழங்கப்பட்டன. (அப்போது) ‘தவ்ராத்’ வேதக்காரர்கள் “எங்கள் இறைவா! இவர்கள் வேலை செய்ததோ குறைந்த நேரம். கூலியோ அதிகம்!” என்று சொன்னார்கள். அல்லாஹ், “நான் உங்களுக்குரிய கூலியில் சிறிதேனும் (குறைத்து) அநீதியிழைத்தேனா?” என்று கேட்க, அவர்கள் ‘இல்லை’ என்று பதிலளித்தார்கள். அல்லாஹ் “அ(வ்வாறு முஸ்லிம்களுக்கு அதிகமாகக் கொடுத்த)து என் அருளாகும். நான் நாடியவர்களுக்கு அதைத் தருகிறேன்” என்று சொன்னான்.109 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7468,
			"arabicnumber": 7468,
			"text": "உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நான் ஒரு குழுவினரோடு உறுதி மொழியளித்தேன். அப்போது நபி (ஸல்) அவர்கள் (பின்வருமாறு) எங்களிடம் உறுதிமொழி வாங்கினார்கள்: நீங்கள் அல்லாஹ்வுக்கு எதையும் இணைகற்பிக்கக் கூடாது; நீங்கள் திருடக் கூடாது; நீங்கள் விபசாரம் செய்யக் கூடாது; உங்கள் குழந்தைகளைக் கொல்லக் கூடாது; நீங்கள் எவர்மீதும் அவதூறை இட்டுக்கட்டி உங்களிடையே பரப்பக் கூடாது; நல்ல காரியத்தில் நீங்கள் எனக்கு மாறு செய்யக் கூடாது. உங்களில் எவர் இவற்றை எல்லாம் நிறைவேற்றுகிறாரோ அவருக்குப் பிரதிபலன் அளிப்பது அல்லாஹ்வின் பொறுப்பாகும். இந்தக் குற்றங்களில் ஏதேனும் ஒன்றை ஒருவர் செய்து, அதற்காக அவர் இம்மையிலேயே தண்டிக்கப்பட்டுவிட்டால், அது அவருக்குப் பரிகாரமும் (அவரைத்) தூய்மைப்படுத்தக்கூடியதும் ஆகும். அல்லாஹ் எவரது குற்றத்தை மறைத்துவிடுகின்றானோ அவரது விவகாரம் அல்லாஹ்விடமே ஒப்படைக்கப்படும். அவன் நாடினால் அவரை வேதனைப்படுத்துவான். நாடினால் அவருக்கு மன்னிப்பளிப் பான்.110 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7469,
			"arabicnumber": 7469,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்:) இறைத்தூதர் சுலைமான் (அலை) அவர்களுக்கு அறுபது துணைவியர் இருந்தார்கள். சுலைமான் அவர்கள் (ஒருமுறை), “இன்றிரவு நான் என் துணைவியர் அனைவரிடமும் தாம்பத்திய உறவு கொள்ளச் செல்வேன். ஒவ்வோரு துணைவியாரும் கர்ப்பமுற்று அல்லாஹ்வின் பாதையில் போரிடுகின்ற குதிரை வீரனைப் பெற்றெடுக்கட்டும்” என்று சொல்லிவிட்டுத் தம் துணைவியரிடம் சென்றார்கள். ஆனால், அவர்களில் ஒரேயொரு மனைவிதான் குழந்தை பெற்றெடுத்தார். அவரும் பாதி (உடல் சிதைந்த) குழந்தையைத்தான் பெற்றெடுத்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: சுலைமான் (அலை) அவர்கள், ‘இன்ஷா அல்லாஹ்’ (இறைவன் நாடினால்) என்று (சேர்த்துக்) கூறியிருந்தால், அவர்களுடைய துணைவியரில் ஒவ்வொருவரும் கர்ப்பம் தரித்து, அல்லாஹ்வின் பாதையில் போரிடும் குதிரை வீரன் ஒருவனைப் பெற்றெடுத்திருப்பார்.111 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7470,
			"arabicnumber": 7470,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நோயுற்றிருந்த) கிராமவாசி ஒருவரை உடல்நலம் விசாரிக்கச் சென்றார்கள். “கவலைப்படாதீர்கள்! (உமது நோய்) அல்லாஹ் நாடினால் (உங்கள் பாவத்தை நீக்கி உங்களைத்) தூய்மைப்படுத்தும்” என்று சொன்னார்கள். அந்தக் கிராமவாசி “தூய்மைப்படுத்துமா? (இல்லை.) மாறாக, வயதான கிழவனைப் பீடிக்கின்ற கொதிக்கும் காய்ச்சல் ஆகும். அந்தக் காய்ச்சல் இவனை மண்ணறைகளைச் சந்திக்க வைத்துவிடும்” என்று சொன்னார். நபி (ஸல்) அவர்கள், “அப்படியென்றால் சரி (அவ்வாறுதான் ஆகும்)” என்று சொன்னார்கள்.112 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7471,
			"arabicnumber": 7471,
			"text": "அபூகத்தாதா (ரலி) அவர்கள் கூறியதாவது: ஒருமுறை நாங்கள் தொழாமல் உறங்கிவிட்டபோது நபி (ஸல்) அவர்கள், “அல்லாஹ், தான் நாடியபோது உங்கள் உயிர்களைக் கைப்பற்றி, தான் நாடியபோது அவற்றைத் திருப்பி அனுப்புகின்றான்” என்று சொன்னார்கள். பிறகு மக்கள் தங்கள் இயற்கைக் கடன்களை நிறைவு செய்துகொண்டு அங்கத் தூய்மை (உளூ) செய்துகொண்டார்கள். அதற்குள் சூரியன் உதயமாகி வெளுத்துவிட்டிருந்தது. பிறகு நபி (ஸல்) அவர்கள் எழுந்து (தவறிப்போன ஃபஜ்ர் தொழுகையை மக்களுடன்) தொழுதார்கள்.113 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 7472,
			"arabicnumber": 7472,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு முஸ்லிமும் ஒரு யூதரும் ஒருவரையொருவர் திட்டிக்கொண்டனர். அந்த முஸ்லிம், “உலகத்தார் அனைவரை விடவும் முஹம்மத் (ஸல்) அவர்களுக்கு மேன்மை அளித்தவன்மீது சத்தியமாக!” என்று ஏதோ ஒரு விஷயத்தில் சத்தியமிட்டுப் பேசினார். அதற்கு அந்த யூதர், “உலகத்தார் அனைவரைவிடவும் மூசாவுக்கு மேன்மை அளித்தவன்மீது சத்தியமாக!” என்று (பதிலுக்குக்) கூறினார். அதைக் கேட்டு (கோபம் கொண்ட) அந்த முஸ்லிம் கையை ஓங்கி யூதரின் முகத்தில் அறைந்துவிட்டார். உடனே அந்த யூதர், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து தமக்கும் அந்த முஸ்லிமுக்கும் இடையே நடந்தவற்றைத் தெரிவித்தார். நபி (ஸல்) அவர்கள் (அந்த முஸ்லிமை அழைத்து வரச்சொல்லி) “மூசாவைவிட என்னைச் சிறப்பாக்கி (முதலிடம் தந்து உயர்த்தி)விடாதீர்கள். ஏனெனில், மக்கள் அனைவரும் மறுமை நாளில் மூர்ச்சையாகிவிடுவார்கள். நானே முதலாவதாக மயக்கம் தெளிந்து எழுவேன். அப்போது மூசா (அலை) அவர்கள் (அல்லாஹ்வுடைய) அரியணையின் ஓரத்தைப் பிடித்துக்கொண்டிருப்பார்கள். மக்களோடு சேர்ந்து அவரும் மூர்ச்சை யாகி, பிறகு எனக்கு முன்பாகவே மயக்கம் தெளிந்துவிட்டிருப்பாரா? அல்லது அவருக்கு மட்டும் (மூர்ச்சையடையத் தேவையில்லையென்று) அல்லாஹ் விதிவிலக்கு அளித்திருப்பானா? என்பது எனக்குத் தெரியாது” என்று கூறி னார்கள்.114 இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 7473,
			"arabicnumber": 7473,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மதீனாவிற்கு தஜ்ஜால் வருவான். வானவர்கள் மதீனாவைக் காவல் காத்துக்கொண்டிருப்பதைக் காண்பான். ஆகவே, தஜ்ஜாலும் கொள்ளைநோயும் அல்லாஹ் நாடினால் மதீனாவை நெருங்க முடியாது. இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.115 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 7474,
			"arabicnumber": 7474,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒவ்வோர் இறைத்தூதருக்கும் (தம் சமுதாயத்தாருக்காகப் பிரார்த்தித்துக்கொள்ள அங்கீகரிக்கப்பெற்ற) ஒரு பிரார்த்தனை உண்டு. அல்லாஹ் நாடினால் என் பிரார்த்தனையை மறுமை நாளில் என் சமுதாயத்தாருக்காகப் பரிந்துரைக்க பத்திரப்படுத்திவைக்க நான் விரும்பு கின்றேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.116 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 7475,
			"arabicnumber": 7475,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நான் உறங்கிக்கொண்டிருந்தபோது (கனவில்) என்னை நான் ஒரு கிணற்றின் அருகே கண்டேன். (அதிலிருந்து) நான் இறைக்க வேண்டுமென அல்லாஹ் நாடிய அளவுக்கு(த் தண்ணீர்) இறைத்தேன். பிறகு அபூகுஹாஃபாவின் புதல்வர் (அபூபக்ர் (ரலி) அவர்கள்) அதை (வாளியை) எடுத்துக்கொண்டு (அதிலிருந்து) ‘ஒரு வாளி நீரை’ அல்லது ‘இரண்டு வாளிகள் நீரை’ இறைத்தார். அவர் (சிறிது நேரம்) இறைத்தபோது சோர்வு தெரிந்தது. அல்லாஹ் (அவரது சோர்வை) அவருக்கு மன்னிப்பானாக! பிறகு அதை உமர் எடுத்தார். அப்போது அது மிகப் பெரிய வாளியாக மாறிவிட்டிருந்தது. அவரைப் போன்று சீராகவும் உறுதியாகவும் செயல்படுகின்ற புத்திசாலியான (அபூர்வத்) தலைவர் ஒருவரை மக்களில் நான் பார்த்ததில்லை. மக்கள் (தங்கள் ஒட்டகங்களுக்கு நீர் புகட்டி,) உமர் அவர்களைச் சுற்றிலும் ஒட்டகங்கள் ஓய்வெடுக்கும் அளவிற்கு (அவர் நீர் இறைத்தார்).117 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 7476,
			"arabicnumber": 7476,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தம்மிடம் ‘யாசகம் கேட்பவர்’ அல்லது ‘தேவையுடையவர்’ யாரேனும் வந்தால் (தம் தோழர்களை நோக்கி), “(இவருக்காக என்னிடம்) பரிந்துரை செய்யுங்கள். அதனால் உங்களுக்கும் நற்பலன் அளிக்கப்படும். அல்லாஹ் தன் தூதரின் நாவால் தான் நாடியதை நிறை வேற்றுகின்றான்” என்று கூறுவார்கள்.118 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 7477,
			"arabicnumber": 7477,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: “இறைவா! நீ நாடினால் எனக்கு மன்னிப்பளிப்பாயாக! நீ நாடினால் எனக்குக் கருணை புரிவாயாக! நீ நாடினால் எனக்கு வாழ்வாதாரம் அளிப்பாயாக!” என்று நீங்கள் பிரார்த்தனை செய்யாதீர்கள். கேட்பதை அவனிடம் வலியுறுத்திக் கேளுங்கள். தான் விரும்பியதையே அவன் செய்வான். அவனை நிர்ப்பந்தப்படுத்துபவர் எவருமில்லை. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.119 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 7478,
			"arabicnumber": 7478,
			"text": "உபைதுல்லாஹ் பின் அப்தில் லாஹ் (ரஹ்) அவர்கள் கூறியதாவது: ‘மூசா (அலை) (அவர்கள் கல்வி கற்பதற்காக ஓர் அடியாரைத் தேடிச் சென்றதாக அல்லாஹ் குறிப்பிடுகின்ற) அவர்களுடைய அந்தத் தோழர் யார்? அவர் ‘களிர்’ அவர்கள்தானா?’ என்பது தொடர்பாக இப்னு அப்பாஸ் (ரலி) அவர்களும் ஹுர்ரு பின் கைஸ் அல் ஃபஸாரிய்யு என்பாரும் கருத்து வேறுபாடு கொண்டு தர்க்கித்துக்கொண்டார்கள். அப்போது உபை பின் கஅப் (ரலி) அவர்கள் அவ்வழியாகச் சென்றார்கள். அன்னாரை இப்னு அப்பாஸ் (ரலி) அவர்கள் அழைத்து, “நானும் என்னுடைய இந்தத் தோழரும் மூசா (அலை) அவர்கள் எவரைச் சந்திக்கச் செல்வதற்கு இறைவனிடம் வழி கேட்டார்களோ அந்தத் தோழர் யார் என்பது தொடர்பாகத் தர்க்கித்துக் கொண்டோம். அவரது நிலை குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொல்ல நீங்கள் கேட்டிருக்கிறீர்களா?” என்று வினவினார்கள். உபை பின் கஅப் (ரலி) அவர்கள் (பின்வருமாறு) பதிலளித் தார்கள்: ஆம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொல்ல நான் கேட்டிருக்கிறேன்: இஸ்ரவேலர்களில் ஒரு கூட்டத்தாரிடையே மூசா (அலை) அவர்கள் இருந்தபோது ஒரு மனிதர் வந்து “உங்களைவிட அறிந்தவர் எவரும் இருப்பது உங்களுக்குத் தெரியுமா?” என்று கேட்க, மூசா (அலை) அவர்கள், “இல்லை (என்னைவிட அறிந்தவர் எவரும் இருப்பதாகத் தெரிய வில்லை)” என்று சொன்னார்கள். உடனே மூசா (அலை) அவர்களுக்கு, “இருக்கிறார். அவர்தான் நம் அடியார் ‘களிர்’ ஆவார்” என்று வஹீ அறிவிக்கப்பட்டது. அப்போது மூசா (அலை) அவர்கள் களிர் அவர்களைச் சந்திக்கச் செல்லும் வழியைக் கேட்டார்கள். அப்போது அல்லாஹ் மீன் ஒன்றை அவர்களுக்கு அடையாளமாக ஆக்கினான். அவர்களிடம், “நீங்கள் எந்த இடத்தில் மீனைத் தொலைக்கிறீர்களோ அந்த இடத்திலிருந்து (வந்த வழியே) திரும்பச் செல்லுங்கள். அங்கு களிர் அவர்களைச் சந்திப்பீர்கள்” என்று கூறப்பட்டது. அவ்வாறே மூசா (அலை) அவர்கள் கடலில் மீனின் சுவட்டைப் பின்பற்றியபடியே சென்றுகொண்டிருந்தார்கள். அப்போது மூசா (அலை) அவர்களுடைய பணியாள் மூசா (அலை) அவர்களிடம், “நாம் அந்தப் பாறையின் பக்கம் (ஓய்வெடுக்க) ஒதுங்கினோமே பார்த்தீர்களா? அங்கேதான் நான் மீனை மறந்துவிட்டேன். அதை (உங்களுக்கு)க் கூறவிடாமல் ஷைத்தான்தான் எனக்கு மறதியைத் தந்துவிட்டான்; அது (அவ்விடத்தில் கடலில் செல்ல) விந்தையான விதத்தில் தனது வழியை அமைத்துக்கொண்டது” என்று சொன்னார். மூசா (அலை) அவர்கள், “அதுதான் நாம் தேடி வந்த இடம்” என்று சொல்ல, இருவருமாகத் தாம் வந்த வழியை நோக்கித் திரும்பிச் சென்றார்கள். அங்கே களிர் (அலை) அவர்களைக் கண்டார்கள் (18:63-65). பிறகு அவ்விருவர் தொடர்பாக அல்லாஹ் எடுத்துரைத்த நிகழ்ச்சிகள் நடைபெற்றன.120 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 7479,
			"arabicnumber": 7479,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மக்கா வெற்றிக்குப்பின் ஹுனைன் செல்ல திட்டமிட்டபோது) “அல்லாஹ் நாடினால் நாளை நாம் பனூ கினானா பள்ளத்தாக்கின் அருகே தங்குவோம். அந்த இடத்தில்தான் குறைஷியர் ‘நாங்கள் இறைமறுப்பில் நிலைத்திருப்போம்’ என்று சூளுரைத்தார்கள்” என்று முஹஸ்ஸப் பள்ளத்தாக்கைக் கருத்தில் கொண்டு கூறினார்கள்.121 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 7480,
			"arabicnumber": 7480,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தாயிஃப் நகர மக்களை முற்றுகையிட்டார்கள். ஆனால், அதை அவர்கள் வெற்றி கொள்ளவில்லை. “அல்லாஹ் நாடினால் நாளை நாம் (மதீனாவுக்குத்) திரும்பிச் சென்றுவிடுவோம்” என்று சொன்னார்கள். முஸ்லிம்கள், “நாம் (கோட்டையை) வெற்றி கொள்ளாமலேயே திரும்பிச் செல்வதா?” என்று கேட்டார்கள். உடனே நபி (ஸல்) அவர்கள், “அப்படியென்றால் (உங்கள் விருப்பம்). முற்பகலிலேயே போருக்குச் செல்லுங் கள்” என்று சொன்னார்கள். மக்களும் அவ்வாறே போருக்குச் செல்ல அவர்களுக்குக் காயங்கள் பல ஏற்பட்டன. நபி (ஸல்) அவர்கள் (அச்சமயம்) “அல்லாஹ் நாடினால் நாளை நாம் (மதீனாவுக்குத்) திரும்பிச் செல்வோம்” என்று சொன்னார்கள். அது மக்களுக்கு மகிழ்ச்சியூட்டியது போன்றிருந்தது. உடனே நபி (ஸல்) அவர்கள் புன்முறுவல் பூத்தார்கள்.122 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 7481,
			"arabicnumber": 7481,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் ஒரு விஷயத்தை வானத்தில் தீர்மானித்துவிட்டால் வானவர்கள் இறைக் கட்டளைக்குப் பணிந்தவர்களாகத் தம் சிறகுகளை அடித்துக்கொள்வார்கள். (அல்லாஹ்வின் அந்தக் கட்டளையை,) பாறைமேல் சங்கிலியை அடிப்பதால் எழும் ஓசையைப் போன்று (வானவர்கள் கேட்பார்கள்). மற்றோர் அறிவிப்பில் காணப்படுவ தாவது: அந்த ஓசை அவர்களைப் போய்ச் சேரும். (அப்போது வானவர்கள் பீதியடை கிறார்கள்.) பின்னர் அவர்களின் இதயங் களிலிருந்து பீதி அகற்றப்படும்போது “உங்கள் இறைவன் என்ன சொன்னான்?” என்று வினவுகிறார்கள். “உண்மையே சொன்னான். அவன் உயர்ந்தவன்; பெரியவன்” என்று கூறுவர். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.124 இக்ரிமா (ரஹ்) அவர்களது ஓர் அறி விப்பில் (பின்வருமாறு) காணப்படுகிறது: மேற்கண்ட (34:23ஆவது) வசனத்தின் மூலத்தில் ‘ஃபுஸ்ஸிஅ’ (அச்சம் அகற்றப் படும்போது) என்பதை ‘ஃபுர்ரிஃக’ (அகற்றப்படும்போது) என ஓதினார்கள். சுஃப்யான் (ரஹ்) அவர்கள் கூறுகிறார் கள்: இதுவே எங்களது ஓதல் முறையாகும். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 7482,
			"arabicnumber": 7482,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், தன் தூதர் இனிய குரலில் குர்ஆனை ஓதும்போது அதை செவிகொடுத்துக் கேட்டதைப் போன்று வேறு எதையும் அவன் செவிமடுத்துக் கேட்டதில்லை. இதை அபூஹுரைரா அவர்கள் அறிவிக்கிறார்கள். அபூஹுரைரா (ரலி) அவர்களின் தோழர் ஒருவர், “இது குரலெடுத்து (இனிமையாகக்) குர்ஆன் ஓதுவதைக் குறிக்கின்றது” என்கிறார்.125 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 7483,
			"arabicnumber": 7483,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், (மறுமை நாளில் ஆதி மனிதரை நோக்கி), ‘ஆதமே!’ என்று அழைப்பான். ஆதம் (அலை) அவர்கள், “இதோ வந்துவிட்டேன்; கட்டளையிடு! காத்திருக்கிறேன்” என்று சொல்வார்கள். அப்போது உரத்த குரலில், “உங்கள் சந்ததியினரிலிருந்து நரகத்திற்கு அனுப்பப்பட இருப்பவர்களை (மற்றவர்களிóருந்து) தனியாகப் பிரித்திடுமாறு அல்லாஹ் உங்களுக்குக் கட்டளையிடுகின்றான்” என அறிவிக்கப்படும். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.126 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 7484,
			"arabicnumber": 7484,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: கதீஜா (ரலி) அவர்கள்மீது நான் ரோஷப்பட்டதைப் போன்று வேறெந்தப் பெண்மீதும் நான் ரோஷப்பட்டதில்லை. நபி (ஸல்) அவர்களுடைய இறைவன் கதீஜா அவர்களுக்கு சொர்க்கத்தில் (முத்து) மாளிகை ஒன்று இருப்பதாக நற்செய்தி அறிவிக்கச் சொன்னான். இதை உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள்.127 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 7485,
			"arabicnumber": 7485,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உயர்வும் வளமும் மிக்க அல்லாஹ் ஓர் அடியாரை நேசிக்கும்போது (வானவர்) ஜிப்ரீல் (அலை) அவர்களை அழைத்து, “அல்லாஹ் இன்னாரை நேசிக்கிறான். நீங்களும் அவரை நேசியுங்கள்” என்று கூறுவான். அவ்வாறே ஜிப்ரீல் (அலை) அவர்கள் அவரை நேசிப்பார். பிறகு ஜிப்ரீல் (அலை) அவர்கள் வானத்தில், “அல்லாஹ் இன்னாரை நேசிக்கிறான். ஆகவே, நீங்களும் அவரை நேசியுங்கள்” என்று குரல் கொடுப்பார்கள். அவ்வாறே விண்ணகத்தாரும் அவரை நேசிப்பார்கள். மண்ணகத்தாரிடையேயும் அவருக்கு அங்கீகாரம் வழங்கப்படும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.128 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 7486,
			"arabicnumber": 7486,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரவில் சில வானவர்களும் பகலில் சில வானவர்களும் உங்களிடையே அடுத்தடுத்து வருகிறார்கள். அவர்கள் அஸ்ர் தொழுகையிலும் ஃபஜ்ர் தொழுகையிலும் ஒன்றுசேர்கிறார்கள். பிறகு உங்களிடையே இரவு தங்கியிருந்தவர்கள் வானத்திற்கு ஏறிச் செல்வார்கள். அங்கு அவர்களிடம் அல்லாஹ், “என் அடியார்களை எந்த நிலையில் விட்டுவிட்டு வந்தீர்கள்?” என்று -அவர்களைப் பற்றி அவன் நன்கறித்த நிலையிலேயே- கேட்பான். அதற்கு வானவர்கள், “அவர்கள் தொழுதுகொண்டிருந்த நிலையில் அவர்களை விட்டுவிட்டு வந்தோம். அவர்கள் தொழுதுகொண்டிருந்த நிலையிலேயே அவர்களிடம் சென்றோம்” என்று பதிலளிப்பார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.129 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 7487,
			"arabicnumber": 7487,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: என்னிடம் (வானவர்) ஜிப்ரீல் வந்து, “அல்லாஹ்வுக்கு எதையும் இணை கற்பிக்காமல் இறந்துவிட்டவர் சொர்க்கம் செல்வார் எனும் நற்செய்தியைத் தெரிவித்தார். “அவர் திருடினாலும் விபசாரம் புரிந்தாலுமா?” என்று நான் கேட்க, ஜிப்ரீல் “ஆம். அவர் திருடினாலும் விபசாரம் புரிந்தாலும் சரியே” என்று பதிலளித்தார்கள். இதை அபூதர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.130 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 7488,
			"arabicnumber": 7488,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னை நோக்கி, “இன்னாரே! நீங்கள் உங்கள் படுக்கைக்குச் செல்லும்போது ‘இறைவா! நான் என்னை உன்னிடம் ஒப்படைக்கின்றேன். என் முகத்தை உன்னிடமே திருப்பினேன். என் காரியத்தை உன்னிடமே ஒப்படைத்தேன். என் விவகாரங்கள் அனைத்திலும் உன்னையே சார்ந்திருக்கின்றேன். உன்மீதுள்ள ஆவலிலும் அச்சத்திலும்தான் (இவற்றை நான் செய்தேன்). உன்னிடமிருந்து தப்பிக்கவும் ஒதுங்கிடவும் உன்னைத் தவிர வேறு போக்கிடம் இல்லை. நீ அருளிய உன் வேதத்தையும் நீ அனுப்பிவைத்த உன் தூதரையும் நான் நம்பினேன்’ என்று பிரார்த்தியுங்கள். ஏனெனில், (இவ்விதம் பிரார்த்தித்து) அன்றைய இரவில் நீங்கள் இறந்து விட்டால் (இஸ்லாம் எனும்) இயற்கை மரபில் இறந்தவராவீர்கள். காலையில் (உயிருடன் விழித்து) எழுந்தால் இந்தப் பிரார்த்தனைக்கான நற்பலனைப் பெற்றுக்கொள்வீர்கள்” என்று சொன்னார்கள்.131 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 7489,
			"arabicnumber": 7489,
			"text": "அப்துல்லாஹ் பின் அபீஅவ்ஃபா (ரலி) அவர்கள் கூறியதாவது: (அரபுக் குலங்கள் அனைத்தும் திரண்டுவந்த அகழ்ப் போரான) ‘அஹ்ஸாப்’ போர் நாளில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இறைவா! வேதம் அருளியவனே! விரைவாகக் கணக்கு வாங்குபவனே! இந்தக் கூட்டுப்படைகளைத் தோற்கடிப்பாயாக! அவர்களை நடுக்கத்திற் குள்ளாக்குவாயாக!” என்று பிரார்த்தனை புரிந்தார்கள்.132 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 7490,
			"arabicnumber": 7490,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: “(நபியே!) உமது தொழுகையில் நீர் குரலை மிகவும் உயர்த்தவும் வேண்டாம்; மிகவும் தாழ்த்தவும் வேண்டாம்” எனும் (17:110ஆவது) இறைவசனம் (பின்வரும் சூழ்நிலையில்) அருளப்பெற்றது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இஸ்லாத்தின் ஆரம்பக் காலத்தில் எதிரிகளின் தொல்லைகளைக் கருத்தில் கொண்டு) மக்காவில் மறைவாக(த் தொழுதுகொண்டு) இருந்தார்கள். (அவ்வாறு தோழர்களுடன் சேர்ந்து தொழும்போது) குரலை உயர்த்(தி குர்ஆனை ஓ)துவார் கள். அதை இணைவைப்பாளர்கள் கேட்டு விடும்போது குர்ஆனையும் அதை அருளிய (இறை)வனையும் அதை (மக்கள்முன்) கொண்டுவந்த (நபிய)வர்களையும் ஏசுவார்கள். ஆகவே, உயர்ந்தோனாகிய அல்லாஹ் “(நபியே!) நீர் உமது தொழுகையில் இணைவைப்பாளர்களின் காதில் விழும் அளவுக்குக் குரலை உயர்த்தாதீர். (அதற்காக உடன் தொழுகின்ற) உம் முடைய தோழர்களுக்கே கேட்காதவாறு (ஒரேயடியாய்) குரலைத் தாழ்த்தியும் விடாதீர். அவர்களுக்குக் கேட்டால்தான் உம்மிடமிருந்து அவர்கள் குர்ஆனைக் கற்பார்கள். ஆகவே, இவ்விரண்டிற்கும் இடையே மிதமான போக்கைக் கையாள் வீராக!” எனக் கட்டளையிட்டான்.133 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 7491,
			"arabicnumber": 7491,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: “ஆதமின் மகன் (மனிதன்) என்னைப் புண்படுத்துகின்றான். அவன் காலத்தை ஏசுகின்றான். நானே காலம் (படைத்தவன்) ஆவேன். என் கரத்திலேயே அதிகார மனைத்தும் உள்ளன. நானே இரவையும் பகலையும் மாற்றி மாற்றிக் கொண்டு வருகின்றேன்” என்று உயர்ந்தோன் அல்லாஹ் கூறுகின்றான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.134 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 7492,
			"arabicnumber": 7492,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ‘நோன்பு எனக்குரியது. நானே அதற்குப் பிரதிபலன் வழங்குவேன். நோன்பாளி தன் இச்சைகளையும் தன் உணவையும் பானத்தையும் எனக்காகவே விட்டுவிடுகின்றார்’ என்று அல்லாஹ் கூறுகின்றான். நோன்பு ஒரு கேடயமாகும். நோன் பாளிக்கு இரண்டு மகிழ்ச்சிகள் உள்ளன. நோன்புத் துறக்கும் வேளையில் கிடைக் கின்ற ஒரு மகிழ்ச்சியும், மறுமையில் தம் இறைவனை அவர் சந்திக்கும் வேளையில் கிடைக்கின்ற ஒரு மகிழ்ச்சியும்தான் அவை. நோன்பாளியின் வாயிலிருந்து வீசும் வாடை கஸ்தூரி வாசனையைவிட அல்லாஹ்விடம் மணமிக்கதாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.135 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 7493,
			"arabicnumber": 7493,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (இறைத்தூதர்) அய்யூப் (அலை) அவர்கள் திறந்தமேனியுடன் குளித்துக் கொண்டிருந்தபோது தங்கத்தாலான வெட்டுக்கிளியின் கால் அவர்கள்மீது வந்து விழுந்தது. உடனே அவர்கள் தமது ஆடையில் அள்ளத்தொடங்கினார்கள். அப்போது அவர்களுடைய இறைவன் அவர்களை அழைத்து, “அய்யூப்! நீர் பார்க்கின்ற இந்தத் தங்கக் கால் உமக்குத் தேவைப்படாத அளவுக்கு உம்மை நான் செல்வராக ஆக்கியிருக்கவில்லையா?” என்று கேட்க, அவர்கள் “ஆம். என் இறைவா! ஆயினும், உன் அருள்வளம் (பரக்கத்) எனக்குத் தேவைப்படுகிறதே!” என்று பதிலளித்தார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.136 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 7494,
			"arabicnumber": 7494,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உயர்வும் வளமும் மிக்கவனான நம் இறைவன் ஒவ்வோர் இரவிலும் இரவின் இறுதி மூன்றிலொரு பங்கு இருக்கும்போது கீழ்வானிற்கு இறங்கி வந்து, “என்னிடம் யாரேனும் பிரார்த்தித்தால் அவரது பிரார்த்தனையை நான் ஏற்கிறேன். என்னிடம் யாரேனும் கேட்டால் அவருக்கு நான் கொடுக்கிறேன். என்னிடம் யாரேனும் பாவமன்னிப்புக் கோரினால் அவரை நான் மன்னிக்கிறேன்” என்று கூறுகின்றான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.137 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 7496,
			"arabicnumber": 7496,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 7497,
			"arabicnumber": 7497,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (நபி (ஸல்) அவர்களிடம் வானவர் ஜிப்ரீல் (அலை) அவர்கள்) “இதோ கதீஜா உங்களி டம் ‘உணவுப் பாத்திரத்தை’ அல்லது ‘பானமுள்ள பாத்திரத்தை’ கொண்டுவந்து கொண்டிருக்கிறார். அவருக்கு அவரு டைய இறைவனிடமிருந்து சலாம் எடுத்துரையுங்கள். கூச்சலோ களைப்போ இல்லாத முத்து மாளிகையொன்று அவருக்கு (சொர்க்கத்தில்) கிடைக்கும் என்று நற்செய்தி அளியுங்கள்” என்று சொன்னார்கள்.139 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 7498,
			"arabicnumber": 7498,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: “என் நல்லடியார்களுக்காக எந்தக் கண்ணும் பார்த்திராத, எந்தக் காதும் கேட்டிராத, எந்த மனிதரின் உள்ளத்திலும் தோன்றியிராத இன்பங்களைச் சொர்க்கத்தில் நான் தயார்படுத்தி வைத்துள்ளேன்” என்று அல்லாஹ் கூறுகின்றான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.140 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 7499,
			"arabicnumber": 7499,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறினார்கள்: நபி (ஸல்) அவர்கள் இரவில் ‘தஹஜ்ஜுத்’ தொழும்போது (பின்வருமாறு) பிரார்த்திப்பார்கள்: இறைவா! உனக்கே புகழனைத்தும். நீயே வானங்கள் மற்றும் பூமியின் ஒளி ஆவாய். உனக்கே புகழனைத்தும். நீயே வானங்கள் மற்றும் பூமியின் நிர்வாகி ஆவாய். உனக்கே புகழனைத்தும். நீயே வானங்கள், பூமி மற்றும் அவற்றில் உள்ளவர்களின் இறைவன் ஆவாய்! நீயே உண்மை. உன் வாக்குறுதியே உண்மை. உன் சொல்லே சத்தியம். உன் சந்திப்பே உண்மை. சொர்க்கம் உண்மை. நரகம் உண்மை. நபிமார்கள் (அனுப்பப்பட்டதும்) உண்மை. மறுமை நாள் (நிகழப்போவது) உண்மை. இறைவா! உனக்கே கீழ்ப்படிந்தேன். உன்னையே நம்பினேன். உன்னையே சார்ந்துள்ளேன். உன் பக்கமே திரும்பு கிறேன். உன்னிடமே என் வழக்குகளைக் கொண்டுவந்தேன். உன்னிடமே நீதி கேட்டேன். ஆகவே, நான் முந்திச் செய்த, பிந்திச் செய்கின்ற, இரகசியமாகச் செய்த, பகிரங்கமாகச் செய்த பாவங்கள் அனைத்தையும் மன்னிப்பாயாக! நீயே என் இறைவன். உன்னைத் தவிர வேறு இறைவனில்லை.141 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 7500,
			"arabicnumber": 7500,
			"text": "ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் குறித்து அவதூறு கிளப்பியவர்கள் அவர்கள்மீது அவதூறு பேசியபோது, ஆயிஷா (ரலி) அவர்கள் குற்றமற்றவர்கள் என்று கூறி அவர்கள் சொன்ன அவதூறிலிருந்து அவர்களை அல்லாஹ் விடுவித்துவிட்டான். இச்செய்தி குறித்து நான் உர்வா பின் அஸ்ஸுபைர் (ரஹ்), சயீத் பின் அல்முசய்யப் (ரஹ்), அல்கமா பின் அபீவக்காஸ் (ரஹ்), உபைதுல்லாஹ் பின் அப்தில்லாஹ் (ரஹ்) ஆகியோரிடமிருந்து (பின்வருமாறு) செவியுற்றேன். அவர்கள் ஒவ்வொருவரும் இந்தச் சம்பவத்தின் ஒரு பகுதியை ஆயிஷா (ரலி) அவர்களிடமிருந்து எனக்கு அறிவித்தார்கள்: ...ஆயினும், அல்லாஹ்வின் மீதாணை யாக! அல்லாஹ் என்னைக் குற்றமற்றவள் என்று அறிவிக்க, ஓதப்படுகின்ற வேத அறிவிப்பை அருளுவான் என்று நான் நினைத்தும் பார்த்திருக்கவில்லை. ஓதப்படுகின்ற வசனம் ஒன்றில் என் தொடர்பாக அல்லாஹ் பேசுகின்ற அளவுக்கு நான் உயர்ந்தவள் அல்லள் என்பதே என் மனத்தில் என்னைப் பற்றிய முடிவாக இருந்தது. மாறாக, என்னைக் குற்றமற்றவள் என அறிவிக்கும் ஒரு கனவை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உறக்கத்தில் காண்பார்கள் என்றே நான் எதிர்பார்த்திருந்தேன். ஆனால், உயர்ந்தோன் அல்லாஹ் (நான் தூய்மையானவள் என்பது குறித்து) “அவதூறு கற்பித்தவர்கள் உங்களில் ஒரு குழுவினர்தான்...” என்று தொடங்கும் (24ஆவது அத்தியாயத்தின்) பத்து வசனங்களை அருளினான்.142 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 7501,
			"arabicnumber": 7501,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் (வானவர்களிடம்) கூறுகின்றான்: என் அடியான் ஒரு தீமையைச் செய்ய நாடினால் அதை அவன் செய்யாத வரை அவனுக்கெதிராக அதைப் பதிவு செய்யாதீர்கள். அதை அவன் செய்துவிட்டால் செய்த குற்றத்தை மட்டுமே பதிவு செய்யுங்கள். அதை அவன் எனக்காக விட்டுவிட்டால் அதை அவனுக்கு ஒரு நன்மையாகப் பதிவு செய்யுங்கள். அவன் ஒரு நன்மை புரிய எண்ணிவிட்டாலே அதைச் செய்யா விட்டாலும்கூட அவனுக்கு ஒரு நன்மையை எழுதுங்கள். அதை அவன் செய்துவிட்டாலோ அதை அவனுக்குப் பத்து நன்மைகளிலிருந்து எழுநூறு நன்மைகளாக எழுதுங்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.143 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 7502,
			"arabicnumber": 7502,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் படைப்பினங்களைப் படைத்து முடித்தபோது, உறவானது எழுந்து (இறை அரியணையின் கால்களைப் பற்றிக்கொண்டு) நின்றது. அல்லாஹ் “சற்று பொறு” என்றான். “உறவுகளைத் துண்டிப்பதிலிருந்து உன்னிடம் பாதுகாப்புக் கோரியே இப்படி நிற்கிறேன்” என்றது உறவு. உடனே அல்லாஹ் “(உறவே!) உன்னைப் பேணி நடந்துகொள்பவனுடன் நானும் நல்ல முறையில் நடந்துகொள்வேன்; உன்னைத் துண்டித்துவிடுபவனை நானும் துண்டித்து விடுவேன் என்பது உனக்குத் திருப்தியளிக்கவில்லையா?” என்று கேட்டான். அதற்கு “ஆம் (திருப்தியே) என் இறைவா!” என்றது உறவு. “இது உனக்காக நடக்கும்” என்றான் அல்லாஹ். (இந்த ஹதீஸை அறிவித்த) பிறகு அபூஹுரைரா (ரலி) அவர்கள், “(நயவஞ்சகர்களே!) நீங்கள் (போருக்கு வராமல்) பின்வாங்கிக்கொண்டு பூமியில் குழப்பம் விளைவிக்கவும் உங்கள் உறவுகளைத் துண்டிக்கவும் முனைகிறீர்களா?” எனும் (47:22 ஆவது) இறைவசனத்தைக் கூறினார்கள்.144 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 7503,
			"arabicnumber": 7503,
			"text": "ஸைத் பின் காலித் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களின் காலத்தில் (ஒருநாள்) மழை பொழிந்தது. அப்போது அவர்கள், “என் அடியார்களில் என்னை நிராகரிப்பவனும் இருக்கின்றான்; என்னை நம்புகிறவனும் இருக்கின்றான் என அல்லாஹ் கூறுகின்றான்” என்று சொன்னார்கள்.145 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 7504,
			"arabicnumber": 7504,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் கூறுகின்றான்: என் அடியான் என்னைச் சந்திக்க விரும்பி னால் நானும் அவனைச் சந்திக்க விரும்பு கிறேன். அவன் என்னைச் சந்திப்பதை வெறுத்தால் நானும் அவனைச் சந்திப்பதை வெறுக்கிறேன்.146 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 7505,
			"arabicnumber": 7505,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் கூறுகின்றான்: என் அடியான் என்னைப் பற்றி என்ன நினைக்கிறானோ அதற்கேற்ப அவனிடம் நான் நடந்துகொள்வேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.147 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 7506,
			"arabicnumber": 7506,
			"text": "அல்லாஹ்வின் தூதர்(ஸல்) அவர்கள் கூறினார்கள்: (முந்தைய காலத்தில்) நன்மை எதையும் அறவே செய்யாத ஒரு மனிதர், “நான் இறந்துவிட்டால் என்னை எரித்து, அந்தச் சாம்பலில் பாதியைத் தரையிலும் பாதியைக் கடலிலும் தூவிவிடுங்கள். ஏனெனில், இறைவன் மீதாணையாக! என்மீது இறைவனுக்குச் சக்தி ஏற்பட்டால், உலக மக்களில் யாருக்கும் அளிக்காத வேதனையை அவன் எனக்கு அளித்து விடுவான்” என்று சொல்லி(விட்டு இறந்து) விட்டார். (அவ்வாறே அவர் உடல் எரிக்கப்பட்டு, சாம்பல் தூவப்பட்டது.) பிறகு, அல்லாஹ் கடலுக்கு ஆணை யிட்டு அதிலிருந்த அவரது உடலை ஒன்றுதிரட்டினான். தரைக்கு ஆணை யிட்டு அதிலிருந்தும் அவரது உடலை ஒன்று திரட்டினான். பிறகு, “நீ எதற்காக இப்படிச் செய்தாய்?” என்று கேட்டான். அதற்கு அவர், “உன் அச்சத்தால்தான். நீ நன்கறிந்தவன்” என்று சொல்ல, அவரை அல்லாஹ் மன்னித்துவிட்டான்.148 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 7507,
			"arabicnumber": 7507,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஓர் அடியார் ஒரு பாவம் செய்துவிட்டார். பிறகு ‘இறைவா! நான் ஒரு பாவம் செய்துவிட்டேன். ஆகவே, என்னை மன்னித்துவிடுவாயாக’ என்று பிரார்த்தித்தார். உடனே அவருடைய இறைவன், “என் அடியான் தனக்கோர் இறைவன் இருக்கின்றான் என்றும், அவன் பாவங்களை மன்னிப்பான்; (அல்லது) அதற்காகத் தண்டிப்பான் என்றும் அறிந்துள்ளானா? (நன்று.) நான் என் அடியானை மன்னித்துவிட்டேன்” என்று சொன்னான். பிறகு அந்த அடியார் (சிறிது காலம்) அல்லாஹ் நாடிய வரை அப்படியே இருந்தார். பிறகு மீண்டும் ஒரு பாவத்தைச் செய்தார். அப்போது அந்த மனிதர் (மீண்டும்) “என் இறைவா! நான் மற்றொரு பாவம் செய்துவிட்டேன். ஆகவே, என்னை மன்னித்துவிடுவாயாக” என்று பிரார்த்தித்தார். உடனே இறைவன் (இம்முறையும்) “என் அடியான் தனக்கோர் இறைவன் இருக்கின்றான் என்றும், அவன் பாவங்களை மன்னிப்பான்; (அல்லது) அதற்காகத் தண்டிப்பான் என்றும் அறிந்துள்ளானா? (நல்லது.) நான் என் அடியானை மன்னித்துவிட்டேன்” என்று சொன்னான். பிறகு அல்லாஹ் நாடிய வரை அந்த மனிதர் அப்படியே (சிறிது காலம்) இருந்தார். பிறகும் (மற்றொரு) பாவம் செய்தார். (இப்போதும் முன்பு போலவே) “என் இறைவா! நான் இன்னொரு பாவம் செய்துவிட்டேன். எனக்காக அதை மன்னித்துவிடுவாயாக” என்று பிரார்த்தித்தார். அதற்கு அல்லாஹ் “என் அடியான் தனக்கோர் இறைவன் இருக்கின்றான் என்றும், அவன் பாவங்களை மன்னிப்பான்; (அல்லது) அதற்காகத் தண்டிப்பான் என்றும் அறிந்துள்ளானா? (அப்படியானால்) நான் என் அடியானை மூன்று முறையும் மன்னித்துவிட்டேன். இனி அவன் நாடியதைச் செய்துகொள்ளட்டும்” என்று சொன்னான். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 7508,
			"arabicnumber": 7508,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ‘முன்சென்ற’ அல்லது ‘உங்களுக்குமுன் வாழ்ந்த’ ஒரு மனிதரைப் பற்றி ஒரு விஷயத்தைக் குறிப்பிட்டார்கள்: அல்லாஹ் அந்த மனிதருக்குச் செல்வத்தையும் பிள்ளைகளையும் வழங்கியிருந்தான். அவருக்கு இறப்பு நெருங்கியபோது அவர் தம் மக்களிடம் “நான் உங்களுக்கு எப்படிப்பட்ட தந்தையாக இருந்தேன்?” என்று கேட்க, அவர்கள் “நல்ல தந்தையாக இருந்தீர்கள்” என்று சொன்னார்கள். ஆனால், அவரோ தம(து மறுமை)க்காக அல்லாஹ்விடம் எந்த நன்மையையும் ‘தயார் செய்திருக்கவில்லை’. அல்லது ‘சேமித்திருக்கவில்லை’. தம்மீது அல்லாஹ்வுக்குச் சக்தி ஏற்பட்டால் தம்மை அவன் வேதனை செய்வான் என அவர் அஞ்சினார். ஆகவே, (அவர் தம் மக்களிடம்) “நன்றாகக் கவனியுங்கள். நான் இறந்துவிட்டால் என்னைப் பொசுக்கி விடுங்கள். நான் (வெந்து) கரியாக மாறிய பின் என்னைப் பொடிப்பொடியாக்கி, சூறாவளிக் காற்று வீசும் நாளில் காற்றில் என்னைத் தூவிவிடுங்கள்” என்று சொன்னார். நபி (ஸல்) அவர்கள் தொடர்ந்து கூறினார்கள்: இவ்வாறு அம்மனிதர் தம் மக்களிடம் அதற்கான உறுதிமொழிகளைப் பெற்றுக்கொண்டார். என் இறைவன் மீதாணையாக! (அவர் இறந்தவுடன்) அவர்கள் அவ்வாறே செய்தார்கள். பிறகு அவரது சாம்பலைச் சூறாவளிக் காற்று வீசிய ஒரு நாளில் தூவிவிட்டார்கள். அப்போது வல்லமையும் மாண்புமிக்க அல்லாஹ், “(பழையபடி முழு மனிதராக) ஆகிவிடு” என்று சொல்ல, அந்த மனிதர் (உயிர் பெற்று) எழுந்தார். அல்லாஹ் “என் அடியானே! நீ இவ்வாறு செய்யக் காரணமென்ன?” என்று கேட்டான். அம்மனிதர் “உன் அச்சத்தின் காரணத்தால்தான்” என்று பதிலளித்தார். அவரை அந்த நேரத்தில் அல்லாஹ்வின் கருணைதான் காப்பாற்றியது. இதே ஹதீஸ் சல்மான் பின் அல்இஸ்லாம் (ரலி) அவர்களிடமிருந்தும் அறிவிக்கப்பட்டுள்ளது. அதில், “கடலில் தூவிவிடுங்கள்” என அம்மனிதர் கூறினார் என்று கூடுதலாகக் காணப்படுகிறது. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் மூசா பின் இஸ்மாயீல் (ரஹ்) அவர்களது அறிவிப்பில், (தயார் செய்திருக்கவில்லை) ‘லம் யப்தஇர்’ என்றே காணப்படுகிறது. கலீஃபா பின் கய்யாத் (ரஹ்) அவர்களது அறிவிப்பில், (சேமிக்கவில்லை) ‘லம் யப்தயிஸ்’ என்று கூறப்படுகிறது. இச்சொல்லுக்கு கத்தாதா (ரஹ்) அவர்கள் ‘சேமித்து வைக்கவில்லை’ என்று விளக்கம் தருகிறார்கள்.149 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 7509,
			"arabicnumber": 7509,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாள் வரும்போது என் சமுதாயத்தாருக்காகப் பரிந்துரை செய்ய எனக்கு அனுமதியளிக்கப்படும். நான் “என் இறைவா! எவரது உள்ளத்தில் கடுகளவு (இறைநம்பிக்கை) உள்ளதோ அவர்களைச் சொர்க்கத்தில் அனுமதிப்பாயாக!” என்று கூறுவேன். அவர்கள் அவ்வாறே சொர்க்கம் செல்வார்கள். பிறகு நான் “எவரது உள்ளத்தில் சிறிதளவேனும் (இறைநம்பிக்கை) உள்ளதோ அவர்களைச் சொர்க்கத்தில் அனுமதிப்பாயாக” என்று மீண்டும் பிரார்த்திப்பேன். இதை அறிவித்த அனஸ் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (‘சிறிதளவேனும்’ என்று கூறியபோது) விரல்நுனியைக் காட்டியதை நான் இப்போதும் பார்ப்பதைப் போன்றுள்ளது” என்று கூறினார்கள்.150 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 7510,
			"arabicnumber": 7510,
			"text": "மஅபத் பின் ஹிலால் அல்அனஸீ (ரஹ்) அவர்கள் கூறியதாவது: பஸ்ராவாசிகளில் சிலர் (ஓரிடத்தில்) ஒன்றுகூடினோம். பிறகு நாங்கள் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம் சென்றோம். அனஸ் (ரலி) அவர்களிடம் பரிந்துரை (ஷஃபாஅத்) பற்றிய நபிமொழியைக் கேட்பதற்காக எங்களுடன் ஸாபித் அல்புனானீ (ரஹ்) அவர்களையும் அழைத்துச் சென்றோம். அனஸ் (ரலி) அவர்கள் தமது கோட்டையில் ‘ளுஹா’ தொழுதுகொண்டிருக்கையில் நாங்கள் அவர்களிடம் போய்ச்சேர்ந்தோம். பிறகு நாங்கள் உள்ளே செல்ல அனுமதி கேட்க, எங்களை அவர்கள் (உள்ளே நுழைய) அனுமதித்தார்கள். அப்போது அவர்கள் தமது விரிப்பில் அமர்ந்து கொண்டிருந்தார்கள். நாங்கள் ஸாபித் (ரஹ்) அவர்களிடம், “பரிந்துரை பற்றிய நபிமொழிக்கு முன்னால் வேறு எதைப் பற்றியும் கேட்காதீர்கள்” என்று சொன்னோம். உடனே ஸாபித் (ரஹ்) அவர்கள், “அபூஹம்ஸா! (அனஸ்!) இதோ இவர்கள் பஸ்ராவாசிகளான உங்கள் சகோதரர்கள் ஆவர். பரிந்துரை (ஷஃபாஅத்) பற்றிய நபிமொழியை உங்களிடம் கேட்பதற்காக இங்கு வந்திருக்கிறார்கள்” என்று சொன்னார்கள். அப்போது அனஸ் (ரலி) அவர்கள் கூறினார்கள்: முஹம்மத் (ஸல்) அவர்கள் எங்களிடம் தெரிவித்தார்கள்: (பீதி மிகுந்த) மறுமை நாள் நிகழும்போது மக்கள் சிலர் சிலரோடு அலைமோதுவார்கள். அவர்கள் (ஆதி மனிதர்) ஆதம் (அலை) அவர்களிடம் சென்று, “(இந்தச் சோதனையான கட்டத்திலிருந்து எங்களைக் காக்க) எங்களுக்காக உங்கள் இறைவனிடம் பரிந்துரை செய்யுங்கள்” என்று சொல்வார்கள். அதற்கு ஆதம் (அலை) அவர்கள், “அந்தத் தகுதி எனக்கு இல்லை; நீங்கள் இப்ராஹீம் (அலை) அவர்களைப் போய்ப் பாருங்கள். ஏனென்றால், அவர் அளவிலா அருளாள(னான இறைவ)னின் உற்ற நண்பர் ஆவார்” என்று கூறுவார்கள். உடனே மக்கள் இப்ராஹீம் (அலை) அவர்களிடம் செல்வார்கள். அப்போது இப்ராஹீம் (அலை) அவர்களும், “அந்தத் தகுதி எனக்கு இல்லை; நீங்கள் மூசாவிடம் செல்லுங்கள். ஏனென்றால், அவர் அல்லாஹ்வுடன் உரையாடியவர் ஆவார்” என்று சொல்வார்கள். உடனே, மக்கள் மூசா (அலை) அவர்களிடம் செல்வார்கள். அப்போது மூசா (அலை) அவர்களும் அதற்கு(த் தகுதியானவன்) நான் அல்லன்; நீங்கள் ஈசாவைப் போய்ப்பாருங்கள். ஏனென்றால், அவர் அல்லாஹ்வின் ஆவியும் அவனுடைய வார்த்தையும் ஆவார்” என்று சொல்வார்கள். உடனே மக்கள் ஈசா (அலை) அவர்களிடம் செல்வார்கள். அப்போது ஈசா (அலை) அவர்களும் அதற்கு(த் தகுதியானவன்) நான் அல்லன்; நீங்கள் முஹம்மத் (ஸல்) அவர்களைப் போய்ப்பாருங்கள்” என்று சொல்வார்கள். உடனே மக்கள் என்னிடம் வருவார்கள். அப்போது நான், “நான் அதற்குரிய வன்தான்” என்று சொல்லிவிட்டு, (மக்களுக்காகப் பரிந்துரைக்க) என் இறைவனிடம் அனுமதி கேட்பேன். அப்போது எனக்கு அனுமதியளிக்கப்படும். தற்போது எனக்குத் தோன்றாத புகழ்மாலைகளையெல்லாம் அப்போது நான் இறைவனைப் போற்றிப் புகழும் வகையில் எனக்கு அவன் எனது எண்ணத்தில் உதயமாக்குவான். அந்தப் புகழ்மாலைகளால் நான் அவனைப் (போற்றிப்) புகழ்வேன். அவனுக்காக (அவன் முன்) நான் சஜ்தாவில் (சிரவணக்கத்தில்) விழுவேன். அப்போது (இறைவனின் தரப்பிலிருந்து), “முஹம்மதே! உங்கள் தலையை உயர்த்துங்கள்! சொல்லுங்கள்; உங்களுக் காகச் செவியேற்கப்படும். கேளுங்கள்; தரப்படும். பரிந்துரை செய்யுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும்” என்று சொல்லப்படும். அப்போது நான், “என் இறைவா! என் சமுதாயம்; என் சமுதாயம்” என்பேன். அப்போது, “செல்லுங்கள்; எவரது உள்ளத்தில் தொலி நீக்கப் படாத கோதுமையின் எடையளவு இறைநம்பிக்கை இருந்ததோ அவரை நரகத்திலிருந்து அப்புறப்படுத்துங்கள்” என்று சொல்லப்படும். ஆகவே, நான் சென்று அவ்வாறே செய்வேன். பிறகு திரும்பி வந்து, அதே புகழ் மாலைகளைக் கூறி (மீண்டும்) அவனை நான் போற்றிப் புகழ்வேன். பிறகு அவனுக்காக சஜ்தாவில் நான் விழுவேன். அப்போதும், “முஹம்மதே! தலையை உயர்த்துங்கள்! சொல்லுங்கள்; உங்கள் சொல் செவியேற்கப்படும். கேளுங்கள்; தரப்படும். பரிந்துரை செய்யுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும்” என்று கூறப்படும். அப்போது நான், “என் இறைவா! என் சமுதாயம்; என் சமுதாயம்” என்று சொல்வேன். அப்போது “செல்லுங்கள்; யாருடைய உள்ளத்தில் ‘அணுவளவு’ அல்லது ‘கடுகளவு’ இறைநம்பிக்கை இருந்ததோ அவர்களை நரகத்திலிருந்து வெளியேற்றுங்கள்” என்று சொல்லப்படும். நான் சென்று, அவ்வாறே செய்துவிட்டு, மீண்டும் திரும்பி வந்து அதே புகழ்மாலைகளைக் கூறி அவனைப் போற்றிப் புகழ்வேன். பிறகு அவனுக்காக சஜ்தாவில் விழுவேன். அப்போதும், “முஹம்மதே! உங்கள் தலையை உயர்த்துங்கள்! சொல்லுங்கள்; உங்கள் சொல் செவியேற்கப்படும். கேளுங்கள்; தரப்படும். பரிந்துரை செய்யுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும்” என்று (இறைவனின் தரப்பிலிருந்து) சொல்லப்படும். அப்போது நான், “என் இறைவா! என் சமுதாயம்; என் சமுதாயம்” என்பேன். அதற்கு அவன், “செல்லுங்கள்: எவரது உள்ளத்தில் கடுகு மணியைவிட மிக மிகச் சிறிய அளவில் இறைநம்பிக்கை இருக்கிறதோ அவரை நரகத்திலிருந்து வெளியேற்றுங்கள்” என்று சொல்வான். அவ்வாறே நான் சென்று அ(த்தகைய)வரை நரகத்திலிருந்து வெளியேற்றுவேன் (என்று நபி (ஸல்) அவர்கள் கூறியதாக அனஸ் (ரலி) அவர்கள் சொன்னார்கள்.) அனஸ் (ரலி) அவர்களிடமிருந்து நாங்கள் விடைபெற்றபோது நான் என் நண்பர்கள் சிலரிடம், “(ஹஜ்ஜாஜ் பின் யூசுஃபிடமிருந்து தப்புவதற்காக) அபூகலீஃபாவின் இல்லத்தில் ஒளிந்துகொண்டிருக்கும் ஹசன் அல்பளி (ரஹ்) அவர்களை நாம் கடந்து சென்றால், அனஸ் பின் மாலிக் (ரலி) அவர்கள் நமக்கு அறிவித்த (பரிந்துரை பற்றிய விஷயத்)தை அவர்களிடம் கூறினால் நன்றாயிருக்கும்!” என்று சொன்னேன். அவ்வாறே நாங்கள் ஹசன் (ரஹ்) அவர்களிடம் சென்று (அனுமதி கேட்கும் முகமாக) சலாம் (முகமன்) சொன்னோம். அவர்கள் எங்களுக்கு அனுமதி அளித்தார்கள். நாங்கள் அவரிடம், “அபூசயீதே! உங்கள் சகோதரர் அனஸ் பின் மாலிக் (ரலி) அவர்களிடமிருந்து நாங்கள் உங்களிடம் வந்துள்ளோம். பரிந்துரை பற்றி அவர்கள் அறிவித்த ஹதீஸைப் போன்று (வேறு யாரும் சொல்ல) நாங்கள் கண்டதில்லை” என்று கூறினோம். அதற்கு ஹசன் (ரஹ்) அவர்கள், “அதை என்னிடம் கூறுங்கள்” என்றார்கள். அந்த நபிமொழியை நாங்கள் அவர்களிடம் சொல்óக்கொண்டே இந்த இடம் (மூன்றாவது முறை பரிந்துரை செய்ய அனுமதிகோரி நான் என் இறைவனிடம் சென்றேன் என்பது)வரை வந்தபோது ஹசன் (ரஹ்) அவர்கள், “இன்னும் சொல்லுங்கள்” என்றார்கள். அதற்கு நாங்கள் “இதைவிடக் கூடுதலாக எங்களிடம் அனஸ் அவர்கள் கூறவில்லை” என்று சொன்னோம். அதற்கு ஹசன் (ரஹ்) அவர்கள், “இருபது ஆண்டுகளுக்கு முன்னால் (நினைவாற்றல் மாறாத) இளமையில் அனஸ் இருந்தபோது (இந்த நபிமொழியை இன்னும் விரிவாக) எனக்கு அறிவித்தார்கள். (அந்தக் கூடுதலான விஷயத்தைக் கூற) அவர்கள் மறந்துவிட்டார்களா? அல்லது நீங்கள் (நபிகளாரின் பரிந்துரைமீது அபரிமிதமான நம்பிக்கை வைத்துக் கொண்டு நல்லறங்களில்) நாட்டமில்லாமல் இருந்துவிடுவீர்கள் என்பதால் கூறவில் லையா என்பது எனக்குத் தெரியவில்லை” என்றார்கள். உடனே நாங்கள், “அபூசயீதே! அவ்வாறாயின் அதை நீங்கள் எங்களுக் குச் சொல்லுங்கள்!” என்றோம். (இதைக் கேட்டவுடன்) ஹசன் (ரஹ்) அவர்கள் சிரித்துவிட்டு, “அவசரக்கார னாகவே மனிதன் படைக்கப்பட்டுள்ளான். என்னிடம் அனஸ் (ரலி) அவர்கள் எப்படி இந்த நபிமொழியைக் கூறினார்களோ அதைப் போன்றே உங்களிடம் நான் அந்த நபிமொழியைச் சொல்ல வேண்டும் என்பதற்காகவே நான் இவ்வாறு குறிப்பிட்டேன்” என்று (சொல்லிவிட்டு, அந்த நபிமொழியின் கூடுதல் விஷயத்தையும்) கூறினார்கள். (நபி (ஸல்) அவர்கள் சொன்னார்கள்:) பிறகு, நான்காம் தடவையாக நான் இறைவனிடம் சென்று அதே (புகழ்மாலை களைக்) கூறி இறைவனைப் போற்றிப் புகழ்வேன். பிறகு அவனுக்காக சஜ்தாவில் விழுவேன். அப்போது, “முஹம்மதே! உங்கள் தலையை உயர்த்துங்கள்! சொல்லுங்கள்; செவியேற்கப்படும். கேளுங்கள்; அது உங்களுக்குத் தரப்படும். பரிந்துரை செய்யுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும்” என்று (இறைவனின் தரப்பிலிருந்து) சொல்லப்படும். அப்போது நான், “என் இறைவா! (உலகில்) லா இலாஹ இல்லல்லாஹ் (அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை) என்று சொன்னவர்கள் விஷயத்தில் (பரிந்துரை செய்ய) எனக்கு அனுமதி வழங்குவாயாக” என்று நான் கேட்பேன். அதற்கு இறைவன், என் கண்ணியத்தின் மீதும், மகத்துவத்தின் மீதும், பெருமையின் மீதும் ஆணையாக! ‘லா இலாஹ இல்லல்லாஹ்’ என்று சொன்னவர்களை நான் நரகத்திலிருந்து நிச்சயமாக வெளியேற்றுவேன்” என்று சொல்வான்.151 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 7511,
			"arabicnumber": 7511,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: சொர்க்கவாசிகளில் இறுதியாகச் சொர்க் கத்தில் நுழைபவரும் நரகவாசிகளில் இறுதியாக நரகத்திலிருந்து வெளியேறு பவரும் யாரென்றால், தவழ்ந்தபடி வெளி யேறுகின்ற ஒரு மனிதராவார். அப்போது அவருடைய இறைவன் ‘சொர்க்கத்தில் நுழைந்துகொள்’ என்று அவரிடம் சொல்வான். அதற்கு அவர் ‘என் இறைவா! சொர்க்கம் நிரம்பிவிட்டது’ என்று பதில் சொல்வார். இவ்வாறு அவரிடம் மூன்று முறை இறைவன் சொல்வான். ஒவ்வொரு முறையும் அம்மனிதர் சொர்க்கம் நிரம்பிவிட்டது என்றே அல்லாஹ் விடம் கூறுவார். பின்னர் அல்லாஹ் ‘உலகத்தைப் போன்று பத்து மடங்கு இடம் (சொர்க்கத்தில்) உனக்கு உண்டு’ என்று சொல்வான். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.152 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 7512,
			"arabicnumber": 7512,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (மறுமையில்) உங்களில் ஒவ்வொருவருடனும் அல்லாஹ் உரையாடுவான். அப்போது அவனுக்கும் உங்களுக்குமிடையே மொழிபெயர்ப்பாளர் எவரும் இருக்கமாட்டார். நீங்கள் உங்கள் வலப் பக்கம் பார்ப்பீர்கள். அங்கு நீங்கள் முன்பே செய்து அனுப்பிய செயல்களையே காண்பீர்கள். உங்கள் இடப் பக்கம் பார்ப்பீர்கள். அங்கும் நீங்கள் முன்பே செய்து அனுப்பிய செயல்களையே காண்பீர்கள். உங்கள் முன்னால் பார்ப்பீர்கள். உங்கள் முகத்துக்கு எதிரே நரகத்தையே காண்பீர்கள். ஆகவே, ஒரு பேரீச்சம் பழத்துண்டை (தர்மமாக)க் கொடுத்தாவது நரகத்திலிருந்து தப்பித்துக் கொள்ளுங்கள். இதை அதீ பின் ஹாத்திம் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில், ‘ஒரு நற்சொல்லைக் கொண்டாவது’ என்று காணப்படுகிறது.153 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 7513,
			"arabicnumber": 7513,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: யூதப் பாதிரியார் ஒருவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து “மறுமை நாள் ஏற்படும்போது அல்லாஹ் வானங்களை ஒரு விரலிலும் பூமிகளை ஒரு விரலிலும் தண்ணீரையும் ஈர மண்ணையும் ஒரு விரலிலும் மற்றப் படைப்புகளை ஒரு விரலிலும் வைத்துக்கொண்டு பிறகு அவற்றை அசைப்பான். பின்னர் ‘நானே அரசன்; நானே அரசன்’ என்று சொல்வான்” எனக் கூறினார். அவர் சொன்னதைக் கேட்டு ஆச்சரியத்தாலும், அதை ஆமோதிக்கும் வகையிலும் நபி (ஸல்) அவர்கள் தம் கடைவாய்ப்பற்கள் வெளியே தெரியும் அளவுக்குச் சிரிப்பதை நான் கண்டேன். பிறகு நபி (ஸல்) அவர்கள், “அல்லாஹ்வை எப்படி மதிக்க வேண்டுமோ அப்படி அவர்கள் மதிக்கவில்லை” எனும் (6:91 ஆவது) இறைவசனத்தைக் கூறினார்கள்.154 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 7514,
			"arabicnumber": 7514,
			"text": "ஸஃப்வான் பின் முஹ்ரிஸ் (ரஹ்) அவர்கள் கூறியதாவது: ஒரு மனிதர் இப்னு உமர் (ரலி) அவர்களிடம், “(மறுமை நாளில் அல்லாஹ்வுக்கும் அவனுடைய அடியார்களுக்குமிடையே நடக்கும்) இரகசிய உரையாடல் தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் என்ன செவியுற்றீர்கள்?” என்று வினவினார். அதற்கு இப்னு உமர் (ரலி) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தம்முடைய இறைவனை நெருங்குவார். இறைவன் தனது திரையை அவர்மீது போட்டு (அவரை மறைத்து)விடுவான். பின்னர் (அவரிடம்) இறைவன், “நீ (உலகத்தில்) இன்னின்ன (பாவச்) செயல்களைச் செய்தாயா?” என்று கேட்பான். அவர் ‘ஆம்’ என்பார். இறைவன் (மறுபடியும்) “இன்னின்ன (பாவச்) செயல்களைச் செய்தாயா?” என்று கேட்பான். அப்போதும் அவர் ‘ஆம்’ என்று கூறி தமது குற்றத்தை ஒப்புக்கொள்வார். பிறகு “நான் (உன் குற்றங்களை) உலகில் (மற்றவருக்குத் தெரியாமல்) மறைத்தேன்; இன்று நான் அவற்றையெல்லாம் உனக்காக மன்னித்துவிடுகின்றேன்” என்று சொல்வான். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது.155 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 7515,
			"arabicnumber": 7515,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஆதம் (அலை) அவர்களும் மூசா (அலை) அவர்களும் தர்க்கம் செய்துகொண்டார்கள். அப்போது மூசா (அலை) அவர்கள், “நீங்கள்தானே உங்கள் சந்ததிகளைச் சொர்க்கத்திலிருந்து வெளியேற்றிய ஆதம்?” என்று கேட்டார்கள். அதற்கு ஆதம் (அலை) அவர்கள், “அல்லாஹ் தன் தூதுச் செய்திகளை அனுப்பவும் தன்னுடன் உரையாடவும் தேர்ந்தெடுத்துக்கொண்ட மூசா நீங்கள்தானே! அப்படிப்பட்ட நீங்களா, நான் படைக்கப்படுவதற்கு முன்பே என்மீது விதிக்கப்பட்டுவிட்ட ஒரு விஷயத்திற்காக என்னைக் குறை சொல்கின்றீர்கள்?” என்று கேட்டார்கள். (இந்தப் பதில் மூலம்) ஆதம் (அலை) அவர்கள் மூசா (அலை) அவர்களை வென்றுவிட்டார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.156 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 7516,
			"arabicnumber": 7516,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளர்கள் மறுமை நாளில் ஒன்றுதிரட்டப்படுவார்கள். அப்போது அவர்கள், “(அதி பயங்கரமான) இந்த இடத்திலிருந்து நம்மை விடுவிக்க நம் இறைவனிடம் பரிந்துரைக்கும்படி (யாரையாவது) நாம் கேட்டுக்கொண்டால் என்ன?” என்று பேசிக்கொள்வார்கள். அதன்படி அவர்கள் ஆதம் (அலை) அவர்களிடம் சென்று அவர்களிடம், “நீங்கள் மனிதர்களின் தந்தை ஆதம் ஆவீர்; அல்லாஹ் உங்களைத் தனது கரத்தால் படைத்தான். வானவர்களை உங்களுக்குச் சிரம்பணியச் செய்தான். மேலும், உங்களுக்கு எல்லாப் பொருள்களின் பெயர்களையும் கற்பித்தான். ஆகவே, எங்கள் இறைவன் எங்களை (இந்தச் சோதனையிலிருந்து) விடுவிக்க எங்களுக்காக அவனிடம் பரிந்துரை செய்யுங்கள்” என்று கேட்டுக் கொள்வார்கள். அதற்கு ஆதம் (அலை) அவர்கள், “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று அவர்களிடம் சொல்லி, தாம் செய்த தவற்றை அவர்களிடம் எடுத்துரைப்பார்கள். இந்த ஹதீஸை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.157 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 7517,
			"arabicnumber": 7517,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கஅபா பள்ளிவாசலிலிருந்து (விண் பயணத்திற்கு) இரவில் அழைத்துச் செல்லப்பட்டது பற்றி அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்கு (சட்டங்கள் தொடர்பாக) வேதஅறிவிப்பு (வஹீ) வருவதற்கு முன்பு (ஒருநாள் இரவு) அவர்கள் புனித (கஅபா) பள்ளிவாசலில் உறங்கிக்கொண்டிருந்தார்கள். அப்போது அவர்களிடம் (வானவர்கள்) மூன்று பேர் வந்தனர். அவர்களில் முதலாமவர், (அங்கு படுத்திருந்த ஹம்ஸா (ரலி), முஹம்மத் (ஸல்), ஜஅஃபர் (ரலி) ஆகியோரை நோக்கி) “இவர்களில் அவர் (முஹம்மத்-ஸல்) யார்?” என்று கேட்டார். அதற்கு நடுவிலிருந்த (வான)வர் “இவர்களில் (நடுவில் படுத்திருக்கும்) சிறந்தவரே அவர்” என்று பதிலளித்தார். அப்போது அம்மூவரில் மூன்றாமவர், “இவர்களில் சிறந்தவரை (விண் பயணத்திற்காக) எடுத்துவாருங்கள்” என்று கூறினார். அன்றிரவு இவ்வளவுதான் நடந்தது. அடுத்த (நாள்) இரவில் நபி (ஸல்) அவர்கள் தமது உள்ளம் பார்க்கின்ற நிலையில் (உறக்க நிலையில்) அம்மூவரும் வந்தபோதுதான் அவர்களைக் கண்டார்கள். நபி (ஸல்) அவர்களின் கண் மட்டுமே உறங்கும்; அவர்களது உள்ளம் உறங்குவதில்லை. -இறைத்தூதர்கள் நிலை இவ்வாறுதான்; அவர்களின் கண்கள் மட்டுமே உறங்கும்; அவர்களின் உள்ளங்கள் உறங்கா.- பிறகு அந்த வானவர்கள் நபி (ஸல்) அவர்களிடம் ஏதும் பேசாமல் அவர்களைத் தூக்கிக் கொண்டு வந்து ‘ஸம்ஸம்’ கிணற்றின் அருகில் இறக்கினர். அவர்களிடமிருந்து நபி (ஸல்) அவர்களின் பொறுப்பை (வானவர்) ஜிப்ரீல் (அலை) ஏற்றுக்கொண்டார்கள்.158 அவர் நபி (ஸல்) அவர்களின் காறை யெலும்பிருந்து நெஞ்சின் நடுப்பகுதிவரை பிளந்து, நெஞ்சிலிருந்தவற்றையும் வயிற்றி லிருந்தவற்றையும் அகற்றினார். பின்னர் தமது கையால் நபியவர்களின் இருத யத்தை ‘ஸம்ஸம்’ நீரால் கழுவி, அவர்களது வயிற்றைச் சுத்தப்படுத்தினார். பிறகு தங்கத் தட்டு ஒன்று கொண்டுவரப்பட்டது. அதில் தங்கக் கோப்பை ஒன்று இருந்தது. அது இறைநம்பிக்கையாலும் ஞானத்தாலும் நிரப்பப்பட்டிருந்தது. அதை நபியவர் களின் இருதயத்திலும் தொண்டை நாளங் களிலும் இட்டு நிரப்பினார் ஜிப்ரீல்; பின்னர் இருதயத்தை மூடிவிட்டார். (பிறகு ‘புராக்’ வாகனம் கொண்டு வரப்பட்டு அதில் ஏற்றப்பட்ட நபியவர்கள் பைத்துல் முகத்தஸை அடைந்தார்கள். அங்கிருந்து) நபி (ஸல்) அவர்களை அழைத்துக்கொண்டு அவர் முதல் வானத்திற்கு உயர்ந்தார். அந்த வானத்தின் கதவுகளில் ஒன்றை அவர் தட்டினார். அப்போது அந்த வானத்திலிருந்த (வான)வர்கள், “யார் அவர்?” என்று கேட்டார்கள். அதற்கு அவர், ‘ஜிப்ரீல்’ என்று பதிலளித்தார். “உங்களுடன் வந்திருப்பவர் யார்?” என்று கேட்டார்கள். அதற்கு அவர், “என்னுடனிருப்பவர் முஹம்மத்” என்று பதிலளித்தார். “(அவரை அழைத்துவரச் சொல்லி) ஆள் அனுப்பப்பட்டிருந்ததா?” என்று கேட்டனர். அதற்கு ஜிப்ரீல் (அலை) ‘ஆம்’ என்றார்கள். “அவரது வரவு நல்வரவாகட்டும்! வாழ்த்துகள்!” என்று கூறினர். நபியவர்களின் வருகையால் வானில் இருப்போர் மகிழ்ச்சியடைகிறார்கள். பூமியில் அல்லாஹ் எதை (நிகழச்செய்ய) நினைக்கிறானோ அதை அவனாக வானவர்களிடம் அறிவிக்காத வரை வானவர்கள் அதை அறிந்துகொள்ளமாட்டார்கள். அந்த முதல் வானத்தில் நபி (ஸல்) அவர்கள் (ஆதி மனிதர்) ஆதம் (அலை) அவர்களைக் கண்டார்கள். அப்போது ஜிப்ரீல் (அலை) அவர்கள் நபி (ஸல்) அவர்களிடம், “இவர்தான் உங்கள் தந்தை. இவருக்கு நீங்கள் சலாம் (முகமன்) கூறுங்கள்” என்று சொன்னார்கள். அவ்வாறே அவருக்கு நபி (ஸல்) அவர்கள் முகமன் கூற, அதற்கு ஆதம் (அலை) அவர்கள் பதில் (முகமன்) சொல்லிவிட்டு, “அருமை மகனே! வருக! வருக! நீரே நல்ல புதல்வர். (உங்கள் வரவிற்கு) வாழ்த்துகள்” என்று கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள் அந்த முதல் வானத்தில் பாய்ந்தோடும் இரு நதிகளைக் கண்டார்கள். உடனே “ஜிப்ரீலே! இவை எந்த நதிகள்?” என்று கேட்டார்கள். அதற்கு ஜிப்ரீல் (அலை) அவர்கள், “இவையிரண்டும் நைல் மற்றும் யூப்ரடீஸ் நதியின் மூலங்கள்” என்று பதிலளித்தார்கள். பிறகு நபி (ஸல்) அவர்களை அழைத்துக்கொண்டு அந்த வானத்தில் சென்றுகொண்டிருந்தபோது இன்னொரு நதியையும் கண்டார்கள். அதன் மீது முத்துகளாலும் பச்சை மரகதத்தாலும் ஆன மாளிகை ஒன்று இருந்தது. (அந்த நதியில்) நபி (ஸல்) அவர்கள் தமது கையால் அடித்தார்கள். அ(தன் மண்ணான)து உயர்ந்த நறுமணமிக்க கஸ்தூரியாக இருந்தது. நபி (ஸல்) அவர்கள், “இது என்ன நதி ஜிப்ரீலே?” என்று கேட்டார்கள். ஜிப்ரீல் (அலை) அவர்கள், “இது உங்களுக்காக உங்கள் இறைவன் ஒதுக்கிவைத்துள்ள ‘கவ்ஸர்’ (எனும் நதி) ஆகும்” என்று பதிலளித்தார்கள். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் இரண்டாம் வானத்திற்கு உயர்ந்தார். அப்போது அவரிடம் முதல் வானத்திலிருந்த வானவர்கள் கேட்டதைப் போன்றே (இந்த வானத்திலிருந்த) வானவர்களும், “யார் அவர்?” என்று கேட்டனர். அதற்கு ஜிப்ரீல் (அலை) அவர்கள் ‘ஜிப்ரீல்’ என்று பதிலளித்தார்கள். வானவர்கள், “உம்முடன் இருப்பவர் யார்?” என்று கேட்டார்கள். ஜிப்ரீல் (அலை) அவர்கள், ‘முஹம்மத் (ஸல்) அவர்கள்’ என்று பதிலளித்தார்கள். “அவருக்கு ஆளனுப்பப்பட்டிருந்ததா?” என்று வானவர்கள் கேட்டார்கள். ஜிப்ரீல் (அலை) அவர்கள், ‘ஆம்’ என்றார்கள். அப்போது அவ்வானவர்கள், “அவரது வரவு நல்வரவாகட்டும்! வாழ்த்துகள்” என்று கூறினர். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் மூன்றாம் வானத்திற்கு உயர்ந்தார்கள். அ(வ்வானத்திலிருந்த வான)வர்களும் முதலாவது மற்றும் இரண்டாவது வானத்திலிருந்தவர்கள் கூறியதைப் போன்றே கூறினார்கள். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் நான்காம் வானத்திற்கு உயர்ந்தார்கள். அங்கிருந்த (வான)வர் களும் அதைப் போன்றே கூறினர். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் ஐந்தாம் வானிற்கு உயர்ந்தார்கள். அ(ங்கிருந்த வான)வர்களும் அதைப் போன்றே கூறினர். பின்னர் நபியவர்களுடன் ஆறாம் வானிற்கு உயர்ந்தார்கள். அவர்களும் அவ்வாறே கூறினார்கள். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் ஏழாம் வானிற்கு உயர்ந்தார்கள். அப்போது அங்கிருந்த (வான)வர்களும் அவரிடம் முன்போலவே கூறினர். ஒவ்வொரு வானத்திலும் இறைத்தூதர்கள் இருந்ததாகக் கூறிய நபி (ஸல்) அவர்கள் அவர்களுடைய பெயர்களையும் குறிப்பிட்டார்கள். இத்ரீஸ் (அலை) அவர்கள் இரண்டாம் வானிலும், ஹாரூன் (அலை) அவர்கள் நான்காம் வானிலும், இன்னொருவர் ஐந்தாம் வானிலும், -அவருடைய பெயர் நினைவில்லை-. இப்ராஹீம் (அலை) அவர்கள் ஆறாம் வானிலும், மூசா (அலை) அவர்கள், அல்லாஹ்வுடன் உரையாடியவர் என்ற சிறப்பின் அடிப்படையில் ஏழாம் வானிலும் இருந்ததாக நான் மனனமிட்டுள்ளேன். அப்போது மூசா (அலை) அவர்கள், “என் இறைவா! எனக்குமேலே வேறொருவர் உயர்த்தப்படுவார் என்று நான் எண்ணியிருக்கவில்லை” என்று கூறினார்கள். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் அதற்கு மேலேயும் ஏறினார். -அல்லாஹ்வுக்கு மட்டுமே அதன் நிலை தெரியும். -இறுதியாக (வான் எல்லையிலுள்ள இலந்தை மரமான) ‘சித்ரத்துல் முன்தஹா’விற்குச் சென்றார்கள். அங்கு சர்வ வல்லமை படைத்தவனும் கண்ணியத்தின் அதிபதியுமான (இறை) வன், வில்லின் இரு முனையளவு அல்லது அதைவிட மிக அருகில் நெருங்கி வந்தான். அப்போது அல்லாஹ் நபி (ஸல்) அவர்களுக்கு அறிவித்தவற்றில், “நாள் ஒன்றுக்கு ஐம்பது நேரத் தொழுகைகள் உங்கள் சமுதாயத்தார்மீது (கடமையாக் கப்பட்டு) உள்ளது” என்பதும் அடங்கும். பிறகு நபி (ஸல்) அவர்கள் (அங்கிருந்து) இறங்கி மூசா (அலை) அவர்களிடம் வந்துசேர்ந்தார்கள். அப்போது நபி (ஸல்) அவர்களைத் தடுத்து நிறுத்திய மூசா (அலை) அவர்கள், “முஹம்மதே! உங்கள் இறைவன் உங்களிடம் என்ன உறுதிமொழி வாங்கினான்?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “நாள் ஒன்றுக்கு ஐம்பது நேரத் தொழுகைகளை (நான் கட்டாயம் தொழ வேண்டுமென) அவன் என்னிடம் உறுதிமொழி வாங்கினான்” என்று பதிலளித்தார்கள். மூசா (அலை) அவர்கள், “உங்கள் சமுதாயத்தாரால் அதை நிறைவேற்ற முடியாது. ஆகவே, நீங்கள் திரும்பிச் சென்று, உங்கள் இறைவனிடம் உங்களுக்கும் (உங்கள் சமுதாயத்தாரான) அவர்களுக்கும் (தொழுகைகளின் எண்ணிக்கையை) குறைக்குமாறு கேளுங்கள்” என்று கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள் அது தொடர்பாக ஆலோசனை கேட்பதைப் போன்று ஜிப்ரீல் (அலை) அவர்களைத் திரும்பிப் பார்த்தார்கள். ‘நீர் விரும்பினால் ஆகட்டும்’ என்று கூறுவதைப் போன்று ஜிப்ரீல் (அலை) அவர்கள் நபி (ஸல்) அவர்களிடம் சைகை செய்தார்கள். ஆகவே, நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் சர்வ வல்லமை படைத்த(வனான இறைவ)னிடம் உயர்ந்தார்கள். (முதலில் தாம் நின்றிருந்த) அதே இடத்தில் நின்றவாறு நபி (ஸல்) அவர்கள், “என் இறைவா! எங்களுக்காக (தொழுகைகளின் எண்ணிக்கையை) குறைத்திடுவாயாக! ஏனெனில், என் சமுதாயத்தாரால் இதை நிறைவேற்ற இயலாது” என்று சொன்னார்கள். அப்போது அல்லாஹ் அவர்களுக்குப் பத்து தொழுகைகளைக் குறைத்தான். பிறகு நபி (ஸல்) அவர்கள் மூசா (அலை) அவர்களிடம் திரும்பிவந்தார்கள். மீண்டும் அவர்கள் நபி (ஸல்) அவர்களைத் தடுத்து நிறுத்தினார்கள். அவ்வாறே மீண்டும் மீண்டும் நபி (ஸல்) அவர்களை இறைவனிடம் மூசா (அலை) அவர்கள் திருப்பி அனுப்பிக்கொண்டேயிருந்தார்கள். முடிவில் அந்த (ஐம்பது) தொழுகை (நாள் ஒன்றுக்கு) ஐந்து தொழுகைகளாக மாறியது. ஐந்துக்கு வந்தபோதும் மூசா (அலை) அவர்கள் நபி (ஸல்) அவர்களைத் தடுத்து நிறுத்தி, “முஹம்மதே! அல்லாஹ்வின் மீது சத்தியமாக! நான் என் சமுதாயத்தாரான பனூ இஸ்ராயீல்களுக்கு இதைவிடக் குறைந்த அளவிலான தொழுகையையே கோரிப்பெற்றேன். ஆனால், அவர்கள் (அதைக்கூட நிறைவேற்றாது) பலவீனமடைந்து கை விட்டுவிட்டார்கள். உங்கள் சமுதாயத்தாரோ உடலாலும் உள்ளத்தாலும் மேனியாலும் பார்வையாலும் கேள்வியாலும் பலவீனமானவர்கள். ஆகவே, திரும்பச் சென்று உங்களுக்காக (உங்கள் ஐநேரத் தொழுகைகளின் எண்ணிக்கையை) குறைத்துக் கேளுங்கள்” என்று கூறினார்கள். ஒவ்வொரு தடவையும் நபி (ஸல்) அவர்கள் ஜிப்ரீல் (அலை) அவர்களிடம் யோசனை பெறுவதற்காக அவர் பக்கம் திரும்பிப்பார்த்துக்கொண்டிருந்தார்கள். அவரும் அதை வெறுக்கவில்லை. ஐந்தாவது தடவை ஜிப்ரீல் (அலை) அவர்கள் நபிகளாரை மேலே அழைத்துச் சென்றபோது நபி (ஸல்) அவர்கள், “என் இறைவா! என் சமுதாயத்தார் உடலாலும் உள்ளத்தாலும் கேள்வியாலும் பார்வையாலும் மேனியாலும் பலவீனமானவர்கள். ஆகவே, (தொழுகைகளை) குறைத்திடு வாயாக!” என்று கோரினார்கள். அதற்கு சர்வ வல்லமை படைத்தவ(னானஇறைவ)ன், “முஹம்மதே!” என்று அழைத்தான். அதற்கு “இதோ இறைவா! நான் காத்திருக்கிறேன்; கட்டளையிடு” என்று பதிலளித்தார்கள். அதற்கு அல்லாஹ், “(ஒருமுறை சொல்லப்பட்ட) சொல் என்னிடம் மாற்றப் படுவதில்லை; அதை (-ஐவேளைத் தொழுகையை) நான் உங்கள்மீது ‘லவ்ஹுல் மஹ்ஃபூல்’ எனும் பாதுகாக்கப்பெற்ற பதிவேட்டில் கடமையாக(ப் பதிவு) ஆக்கி விட்டேன். மேலும், ஒரு நற்செயலுக்குப் பத்து நன்மைகள் உண்டு. ஆகவே, அவை உங்களுக்கு ஐந்து நேரத் தொழுகைகளாக இருப்பினும், பாதுகாக்கப்பெற்ற பதிவேட்டில் அவை ஐம்பது நேரத் தொழுகைகள் (உடைய நன்மைக்கு நிகர்) ஆகும்” என்று சொன்னான். பின்னர் நபி (ஸல்) அவர்கள், மூசா (அலை) அவர்களிடம் திரும்பிவந்தார்கள். அப்போது “என்ன செய்தீர்?” என்று மூசா (அலை) அவர்கள் கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள் எங்களுக்கு (ஐம்பதாயிருந்த தொழுகைகளின் எண்ணிக்கையை ஐந்தாக) அவன் குறைத்தான். ஒவ்வொரு நற்செயலுக்கும் அதைப் போன்ற பத்து மடங்கு நன்மைகளை வழங்கினான்” என்று சொன்னார்கள். அதற்கு மூசா (அலை) அவர்கள், “அல்லாஹ்வின் மீது சத்தியமாக! இதைவிடக் குறைவான எண்ணிக்கையையே பனூ இஸ்ராயீல்களுக்கு நான் (இறைவனிடம்) கோரிப்பெற்றேன். அப்படியிருந்தும் அதைக்கூட அவர்கள் கைவிட்டார்கள். நீங்கள் உங்கள் இறைவனிடம் திரும்பிச் சென்று இன்னும் உங்களுக்காகக் குறைக்கும்படி கேளுங்கள்” என்றார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “மூசாவே! அல்லாஹ்வின் மீது சத்தியமாக! திரும்பத் திரும்ப இறைவனிடம் நான் சென்றுவிட்டதால் (மீண்டும் செல்ல) வெட்கப்படுகிறேன்” என்றார்கள். அப்போது ஜிப்ரீல் (அலை) அவர்கள், “(நபியே!) அல்லாஹ்வின் திருப்பெயரால் (பூமிக்கு) இறங்குங்கள்” என்றார்கள். அப்போது நபி (ஸல்) அவர்கள் விழித்தெழுந்தார்கள்; மஸ்ஜிதுல் ஹராம் புனிதப் பள்ளிவாசலில் இருந்தார்கள்.159 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 7518,
			"arabicnumber": 7518,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் (மறுமையில்) சொர்க்கவாசி களை நோக்கி “சொர்க்கவாசிகளே!” என்று அழைப்பான். அவர்கள் “எங்கள் அதிபதியே! இதோ கீழ்ப்படியக் காத்திருக்கிறோம். நன்மை அனைத்தும் உன் கரங்களிலேயே உள்ளது” என்று பதிலளிப்பார்கள். அப்போது அல்லாஹ் ‘நீங்கள் திருப்தியடைந்தீர்களா?’ என்று கேட்பான். மக்கள் “எங்கள் அதிபதியே! நாங்கள் திருப்தியடையாமலிருக்க எங்களுக்கு என்ன? நீ உன் படைப்புகளில் எவருக்கும் வழங்கியிராதவற்றை எங்களுக்கு வழங்கியிருக்கின்றாயே!” என்று பதிலளிப்பார்கள். அதற்கு அல்லாஹ், “இதைவிடவும் சிறந்ததை நான் உங்களுக்கு வழங்கட்டுமா?” என்று கேட்பான். சொர்க்கவாசிகள், “எங்கள் அதிபதியே! இதைவிடச் சிறந்தது எது?” என்று கேட்பார்கள். அதற்கு அல்லாஹ், “உங்கள்மீது என் அன்பைப் பொழிகின்றேன். இனி என்றுமே உங்கள் மீது நான் கோபப்படமாட்டேன்” என்று சொல்வான். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.160 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 7519,
			"arabicnumber": 7519,
			"text": "நபி (ஸல்) அவர்கள், தம்மிடம் கிராமவாசி ஒருவர் இருக்க ஒருநாள் (பின்வருமாறு) அறிவித்துக் கொண்டிருந்தார்கள்: சொர்க்கவாசிகளில் ஒருவர் தம் இறைவனிடம் பயிர்செய்ய அனுமதி கேட்பார். இறைவன், “(இங்கு) நீ விரும்பிய நிலையில் வாழ்ந்துகொண்டி ருக்கவில்லையா?” என்று கேட்பான். அதற்கு அவர், “ஆம். எனினும், நான் பயிர்செய்ய விரும்புகின்றேன்” என்று பதிலளிப்பார். உடனே அவர் விரைந்து சென்று விதைகளைத் தூவிவிடுவார். கண் இமைக்கும் நேரத்திற்குள் அது முளைத்து பயிராகி கதிர் முற்றி அறுவடை செய்யப்பட்டு மலை போன்று களத்தில் குவிக்கப்பட்டுவிடும். அப்போது உயர்ந்தோன் அல்லாஹ், “ஆதமின் மகனே! எடுத்துக்கொள். ஏனென்றால், எதனாலும் உன் வயிற்றை நிரப்ப முடியாது” என்று சொல்வான். இதைக் கேட்டுக்கொண்டிருந்த கிராமவாசி உடனே, “அல்லாஹ்வின் தூதரே! இந்த மனிதர் குறைஷியாகவோ அன்சாரியாகவோதான் இருப்பார். ஏனெனில், அவர்கள்தான் விவசாயிகள். நாங்களோ விவசாயிகள் அல்லர்” என்று சொன்னார். இதைக் கேட்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சிரித்தார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.161 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 7520,
			"arabicnumber": 7520,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நான், “அல்லாஹ்விடம் மிகப்பெரிய பாவம் எது?” என்று கேட்டேன். அதற்கு அவர்கள், “அல்லாஹ் உன்னைப் படைத்திருக்க, நீ அவனுக்கு இணைகற்பிப்பதாகும்” என்று பதிலளித்தார்கள். நான், “நிச்சயமாக அது பெரும் பாவம்தான்” என்று சொல்லிவிட்டு, “பின்னர் எது?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “உன் குழந்தை உன்னுடன் உணவு உண்ணும் என்றஞ்சி அதை நீ கொன்றுவிடுவதாகும்” என்று சொன்னார்கள். நான், “பிறகு எது?” என்று கேட்க, நபி (ஸல்) அவர்கள், “பிறகு உன் அண்டை வீட்டாரின் மனைவியுடன் நீ விபசாரம் புரிவதாகும்” என்று பதிலளித்தார்கள்.162 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 7521,
			"arabicnumber": 7521,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (புனித கஅபா) ஆலயத்தின் அருகே ‘ஸகஃபீ குலத்தார் இருவரும் குறைஷி ஒருவரும்’ அல்லது ‘குறைஷியர் இருவரும் ஸகஃபீ ஒருவரும்’ ஒன்றுகூடினார்கள். அவர்களுக்கு வயிற்றில் சதை (தொந்தி) அதிகமாகப்போட்டிருந்தது. (ஆனால்,) அவர்களது உள்ளத்தில் புரிந்துகொள்ளும் ஆற்றல் குறைவாக இருந்தது. அவர்களில் ஒருவர், “அல்லாஹ் நாம் சொல்வதைக் கேட்கின்றான் என்று நீங்கள் கருதுகிறீர்களா?” என்று கேட்க, மற்றொருவர், “நாம் உரக்கப் பேசினால் அவன் கேட்பான்; நாம் மெதுவாகப் பேசினால் கேட்கமாட்டான்” என்று சொன்னார். இன்னொருவர், “நாம் உரக்கப் பேசும்போது அவன் கேட்கின்றான் என்றால், நாம் மெதுவாகப் பேசும்போதும் அவன் நிச்சயம் கேட்பான்” என்று சொன்னார். அப்போதுதான் உயர்ந்தோன் அல்லாஹ், “(உலகில் நீங்கள் குற்றங் களைச் செய்தபோது) உங்களின் காதுகளும் கண்களும் தோல்களும் உங்களுக்கெதிராகச் சாட்சியம் அளிக்கும் என்பதை அஞ்சிக்கூட (குற்றங்களைத்) தவிர்ப்பவர்களாக நீங்கள் இருக்கவில்லை” எனும் (41:22ஆவது) வசனத்தை அருளி னான்.163 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 7522,
			"arabicnumber": 7522,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வால் அருளப்பெற்ற வேதங் களிலேயே அண்மைக் காலத்தில் (புதிதாக) அருளப்பெற்ற இறைவேதம் (குர்ஆன்) உங்களிடம் இருக்க, (முந்தைய) வேதக்காரர்களிடம் அவர்களுடைய வேதங்கள் தொடர்பாக நீங்கள் ஏன் கேட்கிறீர்கள்? அ(ந்தப் புதிய வேதத்)தைநீங்கள் கலப்படமின்றி தூய்மையான வடிவில் ஓதிக்கொண்டிருக்கிறீர்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 7523,
			"arabicnumber": 7523,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: முஸ்லிம் மக்களே! வேதக்காரர்களிடம் நீங்கள் எதைப் பற்றியும் ஏன் கேட்கிறீர் கள்? உங்கள் நபி (ஸல்) அவர்களுக்கு அல்லாஹ் அருளியுள்ள வேதம்தான் இறைச்செய்திகளிலேயே புதியதும் கலப்படமில்லாத தூய்மையானதும் ஆகும். வேதக்காரர்களோ இறைவேதங்களை மாற்றி, திரித்து, தம் கரங்களால் எழுதிக் கொண்ட ஏடுகளை அல்லாஹ்விடமிருந்து வந்தவை என, அதன்மூலம் அற்ப விலையைப் பெறுவதற்காகக் கூறுகிறார்கள் என்று அல்லாஹ் உங்களுக்கு அறிவித் துள்ளான். உங்களுக்குக் கிடைத்துள்ள ஞானம், வேதக்காரர்களிடம் கேட்டுத் தெரிவதிலிருந்து உங்களைத் தடுக்க வில்லையா? (அதே நேரத்தில்) அல்லாஹ்வின் மீதாணையாக! அந்த வேதக்காரர்களில் ஒருவர்கூட உங்களுக்கு அருளப்பெற்றுள்ள (வேதத்)தைப் பற்றிக் கேட்பதை நாம் கண்டதில்லை. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 7524,
			"arabicnumber": 7524,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: இப்னு அப்பாஸ் (ரலி) அவர்கள், “(நபியே!) இந்த வஹீயை அவசரம் அவசரமாக மனனம் செய்வதற்காக உமது நாவை அசைக்காதீர்” எனும் (75:16ஆவது) இறைவசனம் குறித்து விளக்கும்போது, “நபி (ஸல்) அவர்கள் தமக்கு வஹீ அருளப்பெறும்போது கடும் சிரத்தை எடுத்துக்கொள்வார்கள். (எங்கே வசனங்கள் மறந்துவிடுமோ என்ற அச்சத்தால்) தம் உதடுகளை அசைத்துக்கொண்டிருப்பார்கள்” என்று கூறினார்கள். -இப்னு அப்பாஸ் (ரலி) அவர்கள் இதைப் பற்றி என்னிடம் அறிவிக்கையில் “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் உதடுகளை அசைத்ததைப் போன்று உங்களுக்கு நான் அசைத்துக் காட்டுகிறேன்” என்று கூறி (தம் உதடுகளை அசைத்துக் காட்டி)னார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள் அசைத்துக் காட்டியதைப் போன்று நானும் அசைத்துக் காட்டுகிறேன் (பாருங்கள்).- அப்போதுதான் அல்லாஹ், “(நபியே!) இந்த வஹீயை (வேதஅறிவிப்பை) அவசர அவசரமாக மனனம் செய்வதற்காக உமது நாவை அசைக்காதீர். அதை (உமது மனத்தில்) ஒன்றுசேர்த்து, அதை (நீர்) ஓதும்படி செய்வது எமது பொறுப்பாகும்” எனும் (75:16,17) வசனங்களை அருளினான். மேலும், “நாம் இதை ஓதிவிட்டோமாயின், நீர் ஓதுவதைத் தொடர்வீராக!” எனும் (75:18) வசனத்தையும் அருளினான். அதாவது அதை நீர் காதுதாழ்த்தி மௌனமாக இருந்து கேட்பீராக! “பின்னர் உம்மை ஓதச்செய்வது நமது பொறுப்பாகும்”. (இதன்பின்) ஜிப்ரீல் (அலை) அவர்கள் தம்மிடம் வந்தால் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் காது தாழ்த்திக் கேட்பார்கள். ஜிப்ரீல் சென்ற பின்னால், அவர் ஓதிக்காட்டியதைப் போன்றே ஓதுவார்கள்.164 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 7525,
			"arabicnumber": 7525,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: இப்னு அப்பாஸ் (ரலி) அவர்கள், “(நபியே!) உமது தொழுகையில் நீர் குரலை மிகவும் உயர்த்தவும் வேண்டாம்; மிகவும் தாழ்த்தவும் வேண்டாம்” எனும் (17:110ஆவது) வசனம் தொடர்பாக(ப் பின்வருமாறு) கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இஸ்லாத்தின் ஆரம்பக் காலத்தில் எதிரிகளின் தொல்லைகளைக் கருத்தில் கொண்டு) மக்காவில் மறைவாக(த் தொழுதுகொண்டு) இருந்தார்கள். தம் தோழர்களுடன் தொழும்போது உரத்த குரலில் குர்ஆனை ஓதுவார்கள். அதை இணைவைப்பாளர்கள் கேட்டுவிடும்போது குர்ஆனையும் அதை அருளிய (இறை) வனையும் அதை (மக்கள்முன்) கொண்டு வந்த (நபிய)வர்களையும் ஏசுவார்கள். ஆகவே, அல்லாஹ் தன் தூதர் (ஸல்) அவர்களுக்கு, “நீர் உமது தொழுகையில் குரலை உயர்த்தி ஓதாதீர்! -ஏனெனில், அதைக் கேட்கும் இணை வைப்பாளர்கள் குர்ஆனை ஏசுவார்கள். அதற்காக (உடன் தொழுகின்ற) உம்முடைய நண்பர்களுக்கே கேட்காத அளவுக்கு- (ஒரேயடியாய்) குரலைத் தாழ்த்தவும் வேண்டாம். இரண்டுக்குமிடையே மிதமான போக்கைக் கையாள்வீராக!” எனக் கட்டளையிட்டான்.165 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 7526,
			"arabicnumber": 7526,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: “(நபியே!) உமது தொழுகையில் நீர் குரலை மிகவும் உயர்த்தவும் வேண்டாம்; மிகவும் தாழ்த்தவும் வேண்டாம்” எனும் இந்த (17:110ஆவது) வசனம் பிரார்த்தனை (துஆ) தொடர்பாக அருளப்பெற்றது. இதை உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள்.166 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 7527,
			"arabicnumber": 7527,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனை (முறைப்படி) இராகத்துடன் (இனிய குரலில்) ஓதாதவர் நம்மைச் சார்ந்தவர் அல்லர். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். மற்றோர் அறிவிப்பில், ‘இராகமிட்டு உரத்த குரலில் ஓதாதவர்’ எனக் கூடுதலாக வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 7528,
			"arabicnumber": 7528,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரண்டு விஷயங்களில் தவிர வேறெதற்காகவும் பொறாமைப்படக் கூடாது. 1. ஒரு மனிதருக்கு அல்லாஹ் குர்ஆனின் ஞானத்தை வழங்கினான். அதை அவர் அல்லும்பகலும் ஓதி (அதன்படி செயல்பட்டு)வருகிறார். (இதைக் கண்ட) மற்றொருவர், “இவருக்கு வழங்கப்பட்டதைப் போன்றே எனக்கும் வழங்கப்படுமானால் இவரைப் போன்றே நானும் செயல்படுவேனே!” என்று (ஆதங்கத்துடன்) கூறினார். 2. மற்றொரு மனிதருக்கு அல்லாஹ் செல்வத்தை வழங்கினான். அதை அவர் உரிய வழியில் செலவிடுகிறார். (இதைக் காணும்) மற்றொருவர், “இவருக்கு வழங்கப்பட்ட (செல்வத்)தைப் போன்று எனக்கும் வழங்கப்பட்டால், இவரைப் போன்றே நானும் செயல்படுவேன்” என்கிறார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.167 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 7529,
			"arabicnumber": 7529,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இரண்டில் தவிர வேறெதிலும் பொறாமை கூடாது. 1. ஒரு மனிதருக்கு அல்லாஹ் குர்ஆன் ஞானத்தை அருள, அவர் அதை அல்லும்பகலும் ஓதி (அதன்படி செயல்பட்டு)வருகிறார். 2. இன்னொரு மனிதருக்கு அல்லாஹ் செல்வத்தை வழங்க, அவர் அதை அல்லும்பகலும் தானம் செய்கிறார். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.168 (இதன் அறிவிப்பாளர்) அலீ பின் அப்தில்லாஹ் (ரஹ்) அவர்கள் கூறு கிறார்கள்: நான் சுஃப்யான் பின் உயைனா (ரஹ்) அவர்களிடம் பலமுறை (ஹதீஸ்களைக்) கேட்டுள்ளேன். ஆனால், ‘எனக்கு இன்னார் அறிவித்தார்’ (அக்பரனா அல்லது ஹத்தஸனா) என்று அவர் சொன்னதில்லை. (இன்னார் கூறினார் (கால) என்றே சொல்வார்.) அப்படியிருந்தாலும், அது அவரது ஆதாரபூர்வமான அறிவிப்புதான். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 7530,
			"arabicnumber": 7530,
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: நம் இறைத்தூதர் (ஸல்) அவர்கள், “நம்மில் எவர் (இறைவழியில்) கொல்லப் படுகின்றாரோ அவர் சொர்க்கத்திற்குச் செல்கின்றார்” எனும் தம் இறைவனின் செய்தியை எங்களுக்குத் தெரிவித்தார்கள்.169 இதை ஜுபைர் பின் ஹய்யா (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 7531,
			"arabicnumber": 7531,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: இறைத்தூதர் முஹம்மத் (ஸல்) அவர்கள் (தமக்கு அருளப்பெற்ற) வேத அறிவிப்பிலிருந்து எதையும் மறைத்தார்கள் என உங்களிடம் யாரேனும் சொன்னால் அவரை நீங்கள் நம்பாதீர்கள். ஏனெனில், அல்லாஹ், “(எம்) தூதரே! உம்முடைய இறைவனிடமிருந்து உமக்கு அருளப்பெற்ற (வேதத்)தை (மக்களுக்கு) எடுத்துரைத்துவிடுவீராக! அவ்வாறு நீர் செய்யாவிட்டால், அவனது தூதை நீர் எடுத்துரைக்கவில்லை என்றாகிவிடும்” எனக் கூறுகின்றான் (5:67).170 இதை மஸ்ரூக் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 7532,
			"arabicnumber": 7532,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (நபி (ஸல்) அவர்களிடம்) “அல்லாஹ்வின் தூதரே! உயர்ந்தோன் அல்லாஹ் விடம் மிகப் பெரிய பாவம் எது?” என்று ஒருவர் கேட்டார். நபி (ஸல்) அவர்கள், “அல்லாஹ் உன்னைப் படைத்திருக்க, அவனுக்கு நீ இணைகற்பித்து வழிபடுவ தாகும்” என்று பதிலளித்தார்கள். அவர், “பிறகு எது?” என்று கேட்க, நபி (ஸல்) அவர்கள், “பிறகு உன் குழந்தை உன்னுடன் உணவு உண்பதை அஞ்சி அதை நீ கொன்றுவிடுவதாகும்” என்று பதிலளித்தார்கள். அவர், “பிறகு எது?” என்று கேட்க, நபியவர்கள் “உன் அண்டை வீட்டாரின் மனைவியுடன் நீ விபசாரம் புரிவதாகும்” என்று பதிலளித்தார்கள். அப்போது நபி (ஸல்) அவர்களின் இந்தக் கூற்றை உறுதிப்படுத்தும் வகையில் அல்லாஹ், “அவர்கள் அல்லாஹ்வுடன் வேறெந்தத் தெய்வத்தையும் அழைக்கமாட்டார்கள். அல்லாஹ் தடை விதித்துள்ள எந்த உயிரையும் நியாயமின்றி அவர்கள் கொலை செய்யமாட்டார்கள்; விபசாரம் செய்யமாட்டார்கள். யாரேனும் இச்செயல்களைச் செய்தால் அதற்குரிய தண்டனையைப் பெற்றே தீருவார். மறுமை நாளில் அவருக்கு இரட்டிப்பு வேதனை அளிக்கப்படும்” எனும் வசனத்தை (25:68) அருளினான்.171 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 7533,
			"arabicnumber": 7533,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களுக்கு முன் சென்ற சமுதாயத்துடன் நீங்கள் வாழும் காலத்தை ஒப்பிடும்போது நீங்கள் (இவ்வுலகில்) வாழ்வது அஸ்ர் தொழுகைக்கும் சூரியன் மறைவதற்கும் இடையிலான (குறுகிய) கால அளவேயாகும். ‘தவ்ராத்’ வேதக்காரர்களுக்கு அந்த வேதம் வழங்கப்பெற்றது. அவர்கள் (காலை முதல்) நண்பகல்வரை அதன்படி செயல்பட்டார்கள். பின்னர் சக்தி இழந்துவிட்டார்கள். அவர்களுக்கு(க் கூலியாக) ஒவ்வொருவருக்கும் ஒரு ‘கீராத்’ வழங்கப்பெற்றது. பின்னர் ‘இன்ஜீல்’ வேதக்காரர்களுக்கு அந்த வேதம் வழங்கப்பெற்றது. அவர்கள் (நண்பகல் முதல்) அஸ்ர் தொழுகைவரை அதன்படி செயல்பட்டார்கள். பின்னர் சக்தி இழந்துவிட்டார்கள். அவர்களுக்கு(க் கூலியாக) ஒவ்வொரு ‘கீராத்’ வழங்கப் பெற்றது. பிறகு உங்களுக்கு குர்ஆன் வழங்கப்பெற்றது. நீங்கள் (அஸ்ர் முதல்) சூரியன் மறையும்வரை அதன்படி செயல்பட்டீர்கள். உங்களுக்கு(க் கூலியாக) இரண்டிரண்டு “கீராத்’கள் வழங்கப்பட்டன. அப்போது வேதக்காரர்கள், “இவர்கள் வேலை செய்ததோ நம்மைவிடக் குறைந்த நேரம்; கூலியோ அதிகம்” என்று கூறினர். அதற்கு அல்லாஹ், “நான் உங்களுக்குரிய உரிமை (கூலி)யில் சிறிதேனும் (குறைத்து) அநீதியிழைத்தேனா?” என்று கேட்க, அவர்கள் ‘இல்லை’ என்று பதிலளித்தார்கள். அல்லாஹ், “அது (முஸ்லிம்களுக்கு அதிகக் கூலி கொடுத்தது) என் அருளாகும். நான் நாடியவர்களுக்கு அதைத் தருகிறேன்” என்று சொன்னான்.174 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 7534,
			"arabicnumber": 7534,
			"text": "இப்னு மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம், “நற்செயல்களில் சிறந்தது எது?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “தொழுகையை அதற்குரிய நேரத்தில் நிறைவேற்றுவதும், பெற்றோருக்கு நன்மை புரிவதும், பின்னர் அல்லாஹ்வின் பாதையில் அறப்போர் புரிவதும் ஆகும்” என்று பதிலளித்தார்கள்.175 இதை அபூஅம்ர் அஷ்ஷைபானீ (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 7535,
			"arabicnumber": 7535,
			"text": "அம்ர் பின் தஃக்லிப் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் ஒரு செல்வம் வந்தது. அதை அவர்கள் சிலருக்குக் கொடுத்தார்கள். வேறுசிலருக்குக் கொடுக்கவில்லை. (பங்கு கிடைக்காத) அந்த மற்ற வர்கள் தம்மைக் குறைகூறுவதாக நபி (ஸல்) அவர்களுக்குச் செய்தி எட்டியது. அப்போது அவர்கள், “நான் ஒருவருக் குக் கொடுக்கின்றேன். மற்றொருவரை விட்டுவிடுகின்றேன். நான் எவருக்குக் கொடுக்கின்றேனோ அவரைவிட நான் எவரை விட்டுவிடுகின்றானோ அவர்தான் எனக்கு மிகவும் பிரியமானவர் ஆவார். பதற்றமுள்ள மனம் படைத்தோருக்கு நான் கொடுக்கின்றேன். இன்னும் சிலருக்கு, அவர்களது உள்ளத்தில் அல்லாஹ் விதைத்துள்ள நன்மையையும் தன்னிறைவான (போதுமென்ற) பண்பையும் நம்பிக் கொடுக்காமல் விட்டுவிடுகின்றேன். அத்தகைய (உயர் பண்புடைய)வர்களில் ஒருவர்தான் அம்ர் பின் தஃக்லிப்” என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னைப் பற்றி இவ்வாறு (புகழ்ந்து) கூறியதற்குப் பதிலாக (விலையுயர்ந்த செல்வமான) சிவப்பு ஒட்டகங்கள் எனக்குக் கிடைப்பதாக இருந்தாலும் நான் அவற்றை விரும்பியிருக்கமாட்டேன்.176 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 7536,
			"arabicnumber": 7536,
			"text": "நபி (ஸல்) அவர்கள் தம் இறைவனிடமிருந்து அறிவிக்கிறார்கள்: (என்) அடியான் என்னை ஒரு சாண் அளவுக்கு நெருங்கினால் நான் அவனை ஒரு முழம் அளவுக்கு நெருங்குகிறேன். அவன் என்னிடம் ஒரு முழம் அளவுக்கு நெருங்கினால் நான் அவனிடம் (விரித்த) இரு கைகளின் நீள அளவுக்கு நெருங்குகிறேன். அவன் என்னிடம் நடந்துவந்தால் நான் அவனிடம் ஓடிச்செல்கிறேன். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 7537,
			"arabicnumber": 7537,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: “அடியான் என்னிடம் ஒரு சாண் அளவுக்கு நெருங்கினால் நான் அவனிடம் ஒரு முழம் நெருங்குகிறேன். அவன் என்னிடம் ஒரு முழம் நெருங்கினால் நான் அவனிடம் (விரித்த) இரு கைகளின் நீள அளவுக்கு நெருங்குகிறேன்” என்று அல்லாஹ் கூறுவதாக ஒருமுறை நபி (ஸல்) அவர்கள் கூறினார்கள்.177 இதே ஹதீஸ் அனஸ் (ரலி) அவர் களிடமிருந்து “நபி (ஸல்) அவர்கள் வல்லமையும் மாண்புமிக்க தம் இறைவனிடமிருந்து அறிவித்தார்கள்” என அறிவிக்கப்பட்டுள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 7538,
			"arabicnumber": 7538,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் உங்கள் இறைவனி டமிருந்து அறிவித்தார்கள்: இறைவன் கூறுகின்றான்: ஒவ்வொரு (தீய) செயலுக்கும் ஒரு பரிகாரம் உண்டு. நோன்பு எனக்காகவே நிறைவேற்றப்படுவதாகும். நானே அதற்குப் பிரதிபலன் வழங்குவேன். நோன்பாளியின் வாயிலிருந்து வீசும் வாடை கஸ்தூரி வாசனையைவிட அல்லாஹ்விடம் மணமிக்கதாகும்.178 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 7539,
			"arabicnumber": 7539,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தம் இறைவனிட மிருந்து அறிவித்துள்ள ஒன்றுதான் இதுவும்: எந்த அடியாரும், தான் (இறைத்தூதர்) யூனுஸ் பின் மத்தா அவர்களைவிடவும் சிறந்தவர் என்று சொல்வது அவருக்குத் தகாது. இவ்வாறு (யூனுஸ் பின் மத்தா - மத்தாவின் புதல்வர் யூனுஸ் என) அவர்களை அவர்களுடைய தந்தையுடன் இணைத்துக் கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது.179 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 7540,
			"arabicnumber": 7540,
			"text": "ஷுஅபா பின் அல்ஹஜ்ஜாஜ் (ரஹ்) அவர்கள் கூறியதாவது: முஆவியா பின் குர்ரா (ரஹ்) அவர்கள், மக்கா வெற்றி தினத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது ஒட்டகம் ஒன்றின்மீது இருந்தபடி, ‘அல்ஃபத்ஹ் எனும் (48ஆவது) அத்தியாயத்தை’ அல்லது ‘அல்ஃபத்ஹ் அத்தியாயத்தில் ஒரு பகுதியை’ ஓதிக்கொண்டிருக்கக் கண்டேன். அப்போது நபி (ஸல்) அவர்கள் ‘தர்ஜீஉ’ எனும் ஓசை நயத்துடன் (இழுத்து) ஓதிக்கொண்டிருந்தார்கள் என்று எனக்கு அப்துல்லாஹ் பின் முகஃப்பல் அல்முஸனீ (ரலி) அவர்கள் அறிவித்தார்கள்” எனக் கூறிவிட்டு, இப்னு முகஃப்பல் (ரலி) அவர்கள் ஓதியதைப் போன்று அப்படியே ஓதிக்காட்டினார்கள். பிறகு, “உங்களைச் சுற்றி மக்கள் கூடிவிடுவார்கள் எனும் அச்சம் எனக்கில்லா விட்டால் நபி (ஸல்) அவர்கள் ஓதிய விதத்தை இப்னு முகஃப்பல் (ரலி) அவர்கள் ஓசை நயத்துடன் (இழுத்து) ஓதிக்காட்டியதைப் போன்றே நானும் ஓதிக்காட்டியிருப்பேன்” என்று சொன்னார்கள். நான், முஆவியா (ரஹ்) அவர்களிடம், “அவர்கள் ஓசை நயத்துடன் ஓதிய முறை எப்படி?” என்று கேட்க, (‘ஆ’ எனும் இடத்தில்) ‘ஆ...ஆ...ஆ...’ என்று மும்முறை (இழுத்து) அவர்கள் ஓதினார்கள்” என்று சொன்னார்கள்.180 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 7541,
			"arabicnumber": 7541,
			"text": "அபூசுஃப்யான் பின் ஹர்ப் (ரலி) அவர்கள் கூறியதாவது: (கிழக்கு ரோமானியப் பேரரசர்) ஹிரக்ளீயஸ் தம் மொழிபெயர்ப்பாளரை அழைத்துவரச் சொன்னார். பின்னர் நபி (ஸல்) அவர்களின் கடிதத்தைக் கொண்டுவரச்சொல்லி அதைப் படி(க்குமாறு ஆணைபிறப்பி)த்தார். (அதில் பின்வருமாறு எழுதப்பட்டிருந்தது:) அளவிலா அருளாளன் நிகரிலா அன்புடையோன் அல்லாஹ்வின் திருப் பெயரால்... இது அல்லாஹ்வின் அடியாரும், அவனுடைய தூதருமான முஹம் மதிடமிருந்து (மன்னர்) ஹிரக்ளீயஸுக்கு எழுதப்பட்ட கடிதம்: வேதக்காரர்களே! எங்களுக்கும் உங்களுக்கும் இடையே உள்ள பொதுவான ஒரு விஷயத்திற்கு வாருங்கள்.181 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 7542,
			"arabicnumber": 7542,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: வேதக்காரர்(களான யூதர்)கள் தவ்ராத் வேதத்தை ஹீப்ரூ (எபிரேயு) மொழியில் ஓதி, அதை அரபு மொழியில் இஸ்லாமியர் களுக்கு விளக்கியும்வந்தார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: வேதக்காரர்களை (அவர்கள் சொல்வதெல்லாம் உண்மை என) நம்பவும் வேண்டாம்; (பொய் என) மறுக்கவும் வேண்டாம். (மாறாக, முஸ்லிம்களே!) கூறுங்கள்: அல்லாஹ்வையும் எங்களுக்கு அருளப் பட்டதையும் இப்ராஹீம், இஸ்மாயீல், இஸ்ஹாக், யஅகூப் ஆகியோருக்கும் யஅகூபின் சந்ததியினருக்கும் அருளப் பட்டதையும் மற்றும் மூசாவுக்கும் ஈசாவுக்கும் வழங்கப்பட்டதையும், மற்றும் நபிமார்கள் அனைவருக்கும், அவர்களின் இறைவனிடமிருந்து வழங்கப்பட்டவை அனைத்தையும் நாங்கள் நம்புகின்றோம். (2:136)182 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 7543,
			"arabicnumber": 7543,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: விபசாரம் செய்துவிட்ட ஒரு யூத ஆணும் ஒரு யூதப் பெண்ணும் நபி (ஸல்) அவர்களிடம் கொண்டுவரப்பட்டனர். நபி ஸல்) அவர்கள் யூதர்களிடம், “நீங்கள் விபசாரிகளை என்ன செய்வீர்கள்?” என்று கேட்க, அவர்கள் “இருவரின் முகங்களிலும் கரும்புள்ளியிட்டு இருவரையும் கேவலப்படுத்திவிடுவோம்” என்று பதிலளித்தார்கள். நபி (ஸல்) அவர்கள், “நீங்கள் உண்மையாளர்களாயிருந்தால் தவ்ராத்தைக் கொண்டுவந்து ஓதிக்காட்டுங்கள்” என்றார்கள். அவ்வாறே அவர்கள் அதைக் கொண்டுவந்து தாங்கள் விரும்பிய ஓர் (ஒற்றைக் கண்) மனிதரிடம், “ஒற்றைக் கண்ணரே! ஓதுவீராக!” என்று கூறினார்கள். அவர் ஓதிக்கொண்டே சென்றார். அதில் ஓரிடத்தை அடைந்ததும் அந்த இடத்தில் தனது கையை வைத்து (மறைத்து)க் கொண்டார். நபி (ஸல்) அவர்கள், “கையை எடுங்கள்” என்று கூற, அவர் தமது கையை எடுத்தார். அப்போது அங்கே கல்லெறி தண்டனை (ரஜ்ம்) தொடர்பான வசனம் ‘பளிச்’சென்று தெரிந்தது. அந்த மனிதர் “முஹம்மதே! இந்த இருவரையும் கல்லால் அடித்துக் கொல்ல வேண்டும். ஆயினும், நாங்கள் அதை எங்களுக்கிடையே பரஸ்பரம் மறைத்துக்கொண்டிருந்தோம்” என்று சொன்னார். உடனே நபி (ஸல்) அவர்கள் அவ்விருவரையும் கல்லால் அடித்துக் கொல்லும்படி கட்டளையிட, அவ்வாறே அவ்விருவரும் கல்லெறிந்து கொல்லப்பட்டனர். (தண்டனை நிறைவேற்றப்பட்டபோது) அந்த ஆண் அப்பெண்ணின் மீது (கவிழ்ந்து அவள் மீது) கல் விழாமல் பாதுகாக்க முயல்வதை நான் கண்டேன்.183 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 7544,
			"arabicnumber": 7544,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், தன் தூதர் ஒருவர் இனிய குரலில் குர்ஆனை உரக்க ஓதும்போது அதைச் செவிகொடுத்துக் கேட்டதைப் போன்று, வேறு எதையும் அவன் செவி கொடுத்துக் கேட்டதில்லை. இதை அபூஹுரைரா அவர்கள் அறிவிக்கிறார்கள்.184 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 7545,
			"arabicnumber": 7545,
			"text": "இப்னு ஷிஹாப் (முஹம்மத் பின் முஸ்லிம் அஸ்ஸுஹ்ரீ-ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்கள் குறித்து அவதூறு கிளப்பியவர்கள் அவர்கள்மீது அவதூறு பேசிய நிகழ்ச்சி தொடர்பாக உர்வா பின் அஸ்ஸுபைர் (ரஹ்), சயீத் பின் அல்முசய்யப் (ரஹ்), அல்கமா பின் வக்காஸ் (ரஹ்), உபைதுல்லாஹ் பின் அப்தில்லாஹ் (ரஹ்) ஆகியோர் என்னிடம் தெரிவித்தனர். அவர்களில் ஒவ்வொருவரும் அந்தச் சம்பவத்தின் ஒரு பகுதியை எனக்கு அறிவித்தார்கள். ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: நான் (உடல்நலம் குன்றி) படுக்கை யில் கிடந்தேன். நான் குற்றமற்றவள் என்பதையும் அல்லாஹ் என்னைக் குற்றமற்றவள் என்று அறிவிப்பான் என்பதையும் அப்போதே நான் அறிவேன். ஆயினும், அல்லாஹ்வின் மீதாணையாக! அல்லாஹ் என் விஷயத்தில் (என்னைக் களங்கமற்றவள் என்று எடுத்துரைக்க காலங்காலமாக) ஓதப்படுகின்ற வேதஅறிவிப்பு ஒன்றை அருள்வான் என்று நான் எண்ணிப்பார்க்கவில்லை. ஓதப்படுகின்ற வசனம் ஒன்றில் என் தொடர்பாக அல்லாஹ் பேசுகின்ற அளவுக்கு நான் உயர்ந்தவள் அல்லள் என்பதே என் மனத்தில் என்னைப் பற்றிய முடிவாக இருந்தது. ஆனால், வல்லமையும் மாண்புமிக்க அல்லாஹ், “அவதூறு கற்பித்தவர்கள் உங்களில் ஒரு குழுவினர்தான்” என்று தொடங்கும் (24ஆவது அத்தியாயத்தின்) பத்து வசனங்களை அருளினான்.185 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 7546,
			"arabicnumber": 7546,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் இஷா தொழு கையில் ‘வத்தீனீ வஸ்ஸைத்தூனி...’ எனும் (95ஆவது) அத்தியாயத்தை ஓதுவதை நான் கேட்டேன். நபி (ஸல்) அவர்களை விடவும் ‘அழகிய குரலுடையவரை’ அல்லது ‘அழகாக ஓதுபவரை’ நான் கண்டதில்லை.186 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 7547,
			"arabicnumber": 7547,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (இஸ்லாத்தின் தொடக்க காலத்தில் எதிரிகளின் தொல்லைகளைக் கருத்தில் கொண்டு) மக்காவில் மறைவாக(த் தொழுதுகொண்டு) இருந்தார்கள். (தொழுகையில்) தமது குரலை உயர்த்தி (குர்ஆனை ஓதி)வந்தார்கள். இணைவைப்பாளர்கள் கேட்கும்போது குர்ஆனையும், அதை (மக்கள்முன்) கொண்டுவந்த (நபிய)வர்களையும் ஏசுவார்கள். இதனால், அல்லாஹ் தன் தூதருக்கு “நீர் உமது தொழுகையில் குரலை உயர்த்தவும் வேண்டாம்; (ஒரேயடியாய்) தாழ்த்தவும் வேண்டாம்” (17:110) எனக் கட்டளையிட்டான்.187 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 7548,
			"arabicnumber": 7548,
			"text": "அப்துல்லாஹ் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் என்னிடம், “நீங்கள் ஆடுகளையும் (அவற்றை மேய்த்திட) பாலைவனத்தையும் நேசிப்பதை நான் பார்க்கின்றேன். நீங்கள் உங்கள் ஆடுகளுடன்’ அல்லது ‘உங்கள் பாலைவனத்தில்’ இருக்கும்போது தொழு கைக்காக பாங்கு சொன்னால் உங்கள் குரலை உயர்த்தி அழையுங்கள். ஏனெனில், பாங்கு சொல்பவரின் குரலை வழிநெடுகிலும் கேட்கின்ற ஜின்னாக இருந்தாலும் மனிதனாக இருந்தாலும் வேறு எதுவாக இருந்தாலும் அவர்கள் அவருக்காக மறுமை நாளில் நிச்சயம் சாட்சியம் அளிப்பார்கள்” என்று சொல்லிவிட்டு, “இதை நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்றேன்” என்று சொன்னார்கள்.188 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 7549,
			"arabicnumber": 7549,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், நான் மாதவிடாயு டன் இருந்தபோது என் மடியில் தமது தலையை வைத்தபடி குர்ஆனை ஓதிக் கொண்டிருந்தார்கள்.189 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 7550,
			"arabicnumber": 7550,
			"text": "உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது வாழ்நாளில் ஹிஷாம் பின் ஹகீம் (ரலி) அவர்கள் அல்ஃபுர்கான் எனும் (25ஆவது) அத்தியாயத்தை (தொழுகையில்) ஓதுவதை நான் செவியுற்றேன். நான் அவரது ஓதுதலை செவிதாழ்த்திக் கேட்ட போது, எனக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓதிக்காண்பிக்காத பல (வட்டார) மொழிவழக்குகளில் அதை அவர் ஓதிக்கொண்டிருந்தார். ஆகவே, தொழுகையில் வைத்தே அவரைத் தண்டிக்க நான் முனைந்தேன். பிறகு (யோசித்து) அவர் (தொழுது முடித்து) சலாம் கொடுக்கும்வரை பொறுமையாயிருந் தேன். (அவர் சலாம் கொடுத்தவுடன்) அவரது மேல்துண்டைக் கழுத்தில் போட்டுப் பிடித்து, “நீர் ஓதியபோது நான் செவியுற்ற இந்த அத்தியாயத்தை உமக்கு ஓதிக்காட்டியது யார்?” என்று கேட்டேன். அவர், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்தான் எனக்கு இதை ஓதிக் காட்டினார்கள்” என்று சொன்னார். நான் “நீர் சொல்வது பொய். நீர் ஓதியதற்கு மாறாகவே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எனக்கு ஓதிக்காட்டினார்கள்” என்று சொல்லி, அவரை இழுத்துக்கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றேன். “இவர் அல்ஃபுர்கான் அத்தியாயத்தை தாங்கள் எனக்கு ஓதிக்காட்டாத வேறு முறைகளின்படி ஓதுவதை நான் செவியுற்றேன்” என்று சொன்னேன். நபி (ஸல்) அவர்கள், “அவரை விடுங்கள்” என்று சொல்லிவிட்டு, “ஹிஷாமே! ஓதுங்கள்!” என்றார்கள். நான் செவியுற்ற அதே முறைப்படி அவர் ஓதினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இவ்வாறுதான் இந்த அத்தியாயம் அருளப்பெற்றது” என்று கூறிவிட்டு, “உமரே! நீங்கள் ஓதுங்கள்!” என்றார்கள். நானும் நபி (ஸல்) அவர்கள் எனக்கு ஓதிக் காட்டியபடி ஓதினேன். அதைக் கேட்ட நபி (ஸல்) அவர்கள் “இவ்வாறுதான் இது அருளப்பெற்றது. இந்த குர்ஆன் ஏழு முறைப்படி அருளப்பெற்றுள்ளது. ஆகவே, இதிலிருந்து உங்களுக்கு எளிதானது எதுவோ அதை ஓதிக்கொள்ளுங்கள்” என்று சொன்னார்கள்.190 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 7551,
			"arabicnumber": 7551,
			"text": "இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள் கூறியதாவது: நான், “அல்லாஹ்வின் தூதரே! நற்செயல் புரிபவர்கள் எதற்காக நற்செயல் புரிய வேண்டும்? (இன்னார் சொர்க்கவாசி, இன்னார் நரகவாசி என்பது முன்பே தீர்மானிக்கப்பட்டுவிட்டதே?)” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “ஒவ்வொரு வரும் எ(தை அடைவ)தற்காகப் படைக்கப்பட்டார்களோ அதற்கு வாய்ப்பளிக்கப்படுகிறார்கள்” என்று பதிலளித்தார்கள்.191 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 7552,
			"arabicnumber": 7552,
			"text": "அலீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஒரு ஜனாஸாவில் (நல்லடக்கத்தில்) கலந்துகொண்டார்கள். அப்போது குச்சியொன்றை எடுத்து தரையில் குத்தலானார்கள். மேலும், “சொர்க்கத்திலோ நரகத்திலோ தமது இருப்பிடம் எழுதப்பட்டிராத எவருமே உங்களிடையே இல்லை” என்று சொன் னார்கள். உடனே மக்கள் “நாங்கள் (இதன் மீதே) நம்பிக்கை கொண்டு, (நற்செயல்கள் புரியாமல்) இருந்துவிடமாட்டோமா?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “நீங்கள் செயலாற்றுங்கள். (நல்லார், பொல்லார்) எல்லாருக்கும் (அவரவர் செல்லும் வழி) எளிதாக்கப்பட்டுள்ளது” என்று சொல்லிவிட்டு, “எவர் (இறைவழியில்) வழங்கி, (இறைவனை) அஞ்சி வாழ்ந்து நல்லறங்களை மெய்ப்பிக்கிறாரோ அவர் (சொர்க்கத்தின்) நல்வழியில் செல்வதை நாம் எளிதாக்குவோம்” எனும் (92:5-10ஆகிய) இறைவசனங்களைக் கூறினார்கள்.192 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 7553,
			"arabicnumber": 7553,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் (படைப்புகளைப்) படைக்கும் பணியை நிறைவு செய்தபோது தன்னிடமுள்ள அரியணைக்குமேலே ‘என் கோபத்தை என் கருணை வென்றுவிட்டது’ அல்லது ‘முந்திவிட்டது’ என்றொரு விதியை எழுதினான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.193 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 7554,
			"arabicnumber": 7554,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் படைப்புகளைப் படைப்ப தற்கு முன்பாக தனக்குத்தானே விதி யொன்றை எழுதிக்கொண்டான். ‘என் கருணை என் கோபத்தை முந்திவிட்டது’ என்பதுதான் அந்த விதி. அது அவனிட முள்ள அரியணைக்கு மேலேயே எழுதப்பட்டுள்ளது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 7555,
			"arabicnumber": 7555,
			"text": "ஸஹ்தம் பின் முளர்ரிப் அல்ஜர்மீ (ரஹ்) அவர்கள் கூறியதாவது: ஜர்ம் குலத்தாரைச் சேர்ந்த இந்தக் குடும்பத்தாருக்கும் அஷ்அரீ குலத்துக்கு மிடையே நேசமும் சகோதரத்துவ உறவும் இருந்துவந்தது. நாங்கள் அபூமூசா அல் அஷ்அரீ (ரலி) அவர்களிடம் இருந்தோம். அப்போது அவர்களுக்குக் கோழி இறைச்சியுடன் உணவு பரிமாறப்பட்டது. அன்னாருடன் பனூ தைமுல்லாஹ் குலத்தைச் சேர்ந்த ஒரு மனிதரும் இருந்தார். அவர் விடுதலை செய்யப்பட்ட அடிமைகளில் ஒருவர் போன்றிருந்தார். அவரை அபூமூசா (ரலி) அவர்கள் உணவுண்ண அழைத்தார்கள். அப்போது அவர், “இந்தக் கோழி (இனம், அசுத்தம்) எதையோ தின்பதைக் கண்டு அதனால் அருவருப்படைந்து அதை உண்ணமாட்டேன் என நான் சத்தியம் செய்துவிட்டேன்” என்று கூறினார். அதைக் கேட்ட அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறினார்கள்: இங்கே வா! நான் உனக்கு இதைப் பற்றி (விவரமாக)த் தெரிவிக்கின்றேன். நான் நபி (ஸல்) அவர்களிடம் (என்) அஷ்அரீ குலத்தார் சிலருடன் வாகனம் கேட்டுச் சென்றேன். அதற்கு நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நான் உங்களை வாகனம் எதிலும் ஏற்றியனுப்பமாட்டேன். உங்களை ஏற்றியனுப்ப என்னிடம் வாகனம் எதுவுமில்லை” என்று சொன்னார்கள். பின்னர் நபி (ஸல்) அவர்களிடம் போரில் கிடைத்த ஒட்டகங்கள் சில கொண்டுவரப்பட்டன. அப்போது நபி (ஸல்) அவர்கள் எங்களைப் பற்றி “அஷ்அரீ குலத்து ஆட்கள் எங்கே?” என்று கேட்டுவிட்டு, “வெள்ளைத் திமில்கள் கொண்ட ஐந்து ஒட்டக மந்தைகளை எங்களுக்கு வழங்கும்படி உத்தரவிட்டார்கள். பிறகு நாங்கள் சென்றுவிட்டோம். (என்றாலும்,) “நாம் என்ன காரியம் செய்துவிட்டோம்? அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், நம்மை வாகனத்தில் ஏற்றி அனுப்ப மாட்டேன் என்றும், தம்மிடம் நமக்கு வழங்க வாகனம் இல்லை என்றும் சத்தியம் செய்தார்கள். பிறகு நமக்கு வாகனம் வழங்கிவிட்டார்களே! நாம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை, அவர்களது சத்தியத்திலிருந்து கவனத்தைத் திருப்பிவிட்டோம். அல்லாஹ்வின் மீதாணையாக! நாம் ஒருபோதும் வெற்றியடையமாட்டோம்” என்று எங்க ளுக்குள் பேசிக்கொண்டோம். பிறகு நபி (ஸல்) அவர்களிடம் திரும்பிச் சென்று இதைப் பற்றிக் கூறினோம். அதற்கு அவர்கள் “உங்களை நான் (வாகனத்தில்) ஏற்றியனுப்ப வில்லை; உங்களை அல்லாஹ்வே ஏற்றியனுப்பினான். அல்லாஹ்வின் மீதாணையாக! நான் ஒரு சத்தியம் செய்து அஃதல்லாத வேறொன்று அந்தச் சத்தியத்தைவிடச் சிறந்ததாக எனக்குத் தென்பட்டால், அந்த வெறோன்றையே செய்வேன். சத்தியத்தை முறித்து, அதற் காகப் பரிகாரமும் செய்துவிடுவேன்” என்று சொன்னார்கள்.194 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 7556,
			"arabicnumber": 7556,
			"text": "அபூஜம்ரா அள்ளுபஈ (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் (அப்துல் கைஸ் குலத்தாரின் நிகழ்ச்சி பற்றிக்) கேட்டேன். அவர்கள் சொன்னார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அப்துல் கைஸ் குலத்தாரின் தூதுக் குழுவினர் வந்து “எங்களுக்கும் உங்களுக்குமிடையே ‘முளர்’ குலத்து இணை வைப்பாளர்கள் (தடையாக) உள்ளனர். ஆகவே, (போர் தடை செய்யப்பட்ட) புனித மாதங்களில் மட்டும்தான் நாங்கள் உங்களை வந்தடைய முடியும். எனவே, சில கட்டளைகளை எங்களுக்கு அளியுங்கள். நாங்கள் அவற்றின்படி செயல்பட்டால் சொர்க்கம் செல்லவும், எங்களுக்குப் பின்னால் இருப்பவர்களை அவற்றின்படி நடக்க நாங்கள் அழைக்கவும் ஏதுவாக இருக்கும். (அத்தகைய கட்டளைகள் சிலவற்றை நீங்கள் எங்களுக்கு இடுங்கள்)” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள், “நான் உங்க ளுக்கு நான்கு விஷயங்களைக் கட்டளை யிடுகின்றேன். நான்கு விஷயங்களைத் தடை செய்கின்றேன். (நான் கட்டளையிடும் நான்கு விஷயங்கள் இவைதான்:) அல்லாஹ்வை நம்பிக்கை (ஈமான்)கொள்ளும்படி உங்களுக்கு நான் கட்டளையிடுகின்றேன். அல்லாஹ்வை நம்பிக்கை (ஈமான்) கொள்வது என்றால் என்ன என்று உங்களுக்குத் தெரியுமா? லா இலாஹ இல்லல்லாஹ் (அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை) என்று சான்றுபகர்வதும் தொழுகையை நிலைநாட்டுவதும் ஸகாத் கொடுப்பதும் போர்ச் செல்வங்களில் ஐந்தில் ஒரு பங்கை (அரசு பொது நிதிக்கு) வழங்குவதும் ஆகும். நான் நான்கு விஷயங்களை உங்களுக்குத் தடை செய்கின்றேன். (மது பாத்திரங்களான) சுரைக்காய்க் குடுவை, (பேரீச்சமரத்தின் அடிப்பாகத்தைக் குடைந்து தயாரிக்கப்பட்ட) மரப் பீப்பாய், தார் பூசப்பட்ட பாத்திரங்கள் மற்றும் மண் சாடிகளில் நீங்கள் (எதையும்) அருந்தாதீர்கள்” என்று சொன்னார்கள்.195 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 7557,
			"arabicnumber": 7557,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இந்த (உயிரினங்களின்) உருவங்களைப் படைப்போர் மறுமை நாளில் வேதனை செய்யப்படுவார்கள். அவர்களிடம், ‘நீங்கள் படைத்தவற்றுக்கு உயிர் கொடுங்கள் (பார்க்கலாம்)’ என்று சொல்லப்படும். இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.196 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 7558,
			"arabicnumber": 7558,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இந்த (உயிரினங்களின்) உருவங் களைப் படைத்தோர் மறுமை நாளில் வேதனை செய்யப்படுவார்கள். அவர்களி டம், ‘நீங்கள் படைத்தவற்றுக்கு உயிர் கொடுங்கள் (பார்க்கலாம்)’ என்று சொல்லப்படும். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள்.197 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 7559,
			"arabicnumber": 7559,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: வல்லமையும் மாண்புமிக்க அல்லாஹ் கூறுகின்றான்: என் படைப்பைப் போன்று படைக்க எண்ணுபவனைவிடப் பெரிய அக்கிர மக்காரன் யார் இருக்க முடியும்? இவர்கள் ஓர் அணுவைப் படைத்துக் காட்டட்டும். அல்லது ஒரு தானிய வித்தையேனும் அல்லது ஒரு தீட்டப்படாத கோதுமையையேனும் படைத்துக் காட்டட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.198 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 7560,
			"arabicnumber": 7560,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனை ஓதுகின்ற இறைநம்பிக்கை யாளரின் நிலையானது, நாரத்தைப் பழம் போன்றதாகும். அதன் சுவையும் நன்று. அதன் மணமும் நன்று. குர்ஆனை ஓதாத (இறைநம்பிக்கையாளரான ஒரு)வரின் நிலையானது, பேரீச்சம் பழத்தைப் போன்றதாகும். அதன் சுவை நன்று; (ஆனால்,) அதற்கு மணம் கிடையாது. குர்ஆனை ஓதுகின்ற பாவியின் நிலை, துளசிச் செடியின் நிலையைப் போன்றதாகும். அதன் மணம் நன்று; அதன் சுவையோ கசப்பானது. குர்ஆனை ஓதாத பாவியின் நிலை, குமட்டிக்காயின் நிலையை ஒத்திருக்கிறது. அதன் சுவையும் கசப்பானது. அதற்கு மணமும் கிடையாது. இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள்.199 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 7561,
			"arabicnumber": 7561,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் சிலர் சோதிடர் களைப் பற்றிக் கேட்டனர். நபி (ஸல்) அவர்கள், “அவர்கள் (பொருட்படுத்தத் தக்க) ஒரு பொருள் அல்லர்” என்று சொன்னார்கள். மக்கள், “அல்லாஹ்வின் தூதரே! இந்தச் சோதிடர்கள் (சில வேளைகளில்) ஒன்றை அறிவிக்கிறார்கள்; அது உண்மையாகி விடுகின்றதே!” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “அந்த உண்மை யான சொல், (வானவர்களிடமிருந்து) ஜின் எடுத்துக்கொண்டதாகும். அது தன் (சோதிட) நண்பனின் காதில் கோழி கொக்கரிப்பதைப் போன்று கொக்கரிக்க, அவன் அதனுடன் நூற்றுக்கும் அதிகமான பொய்களைக் கலந்துவிடுகின்றான்” என்று பதிலளித்தார்கள்.200 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 7562,
			"arabicnumber": 7562,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், “கிழக்குத் திசையிலிருந்து (இராக்கிலிருந்து) சிலர் புறப்படுவார்கள். அவர்கள் குர்ஆனை ஓதுவார்கள்; ஆனால், அது அவர்களின் நெஞ்செலும்புகளைத் தாண்டிச் செல்லாது. (வேட்டைக்காரனின்) அம்பு வேட்டை யாடப்பட்ட பிராணியின் உடலிலிருந்து (மறுபக்கமாக) வெளியேறிவிடுவதைப் போன்று அவர்கள் மார்க்கத்திலிருந்து வெறியேறிவிடுவார்கள். பிறகு அம்பானது வில்லின் நாண் உள்ள பகுதிக்கு (தானாக)த் திரும்பாதவரை அவர்களும் மார்க்கத்திற்குத் திரும்பி வரவேமாட்டார்கள்” என்று சொன்னார்கள். “அவர்களின் அடையாளம் என்ன?” என்று வினவப்பட்டது. அதற்கு நபி (ஸல்) அவர்கள், “மொட்டை போடுவ(தை ஒரு மரபாகவும் வழிபாடாகவும் கொண்டிருப்ப)துதான் (அவர்களின் அடையாளம்)” என்று பதில் சொன்னார்கள். அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 7563,
			"arabicnumber": 7563,
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 188
			}
		}
	]
}