{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"10": "The Book of Leading the Prayer (Al-Imamah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 777,
			"arabicnumber": 777,
			"text": "Telah mengkabarkan kepada kami [Ishaq bin Ibrahim] dan [Hannad bin As-Sari] dari [Husain bin 'Ali] dari [Zaidah] dari ['Ashim] dari [Zirr] dari [Abdullah] dia berkata; \"Tatkala Rasulullah Shallallahu'alaihi wasallam wafat. orang-orang Anshar berkata, 'Dari kami ada pemimpin dan dari kalian (Muhajirin) juga ada pemimpin'. [Umar] segera mendatangi mereka dan berkata, 'Bukankah kalian tahu bahwa Rasulullah Shallallahu'alaihi wasallam menyuruh Abu Bakar menjadi imam dalam shalat mereka? Siapa di antara kalian yang hatinya ingin mendahului Abu Bakar? ' Mereka berkata, 'Kami berlindung kepada Allah dari mendahului Abu Bakar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": 778,
			"text": "Telah mengkabarkan kepada kami [Ziyad bin Ayyub] dia berkata; telah mengabarkan kepada kami [Ismail bin 'Ulayyah] dia berkata; telah menceritakan kepada kami [Ayyub] dari [Abu Al Aliyah Al Barra], dia berkata; \"Ziyad mengakhirkan shalat, maka [Ibnu Shamit] mendatangiku. Lalu aku persilakan untuk duduk di kursi. dan dia pun duduk. Kemudian segera kuceritakan perbuatan Ziyad. lalu dia menggigit kedua bibirnya dan memukul pahaku, dan berkata, 'Aku pernah bertanya kepada [Abu Dzar] seperti yang kamu tanyakan kepadaku, dan ia (Abu Dzar) memukul pahaku seperti aku memukul pahamu. Dia (Abu Dzar) berkata, \"Aku pernah bertanya kepada Rasulullah Shallallahu'alaihi wasallam sebagaimana yang kamu tanyakan kepadaku, lantas beliau Shallallahu'alaihi wasallam memukul pahaku seperti aku memukul pahamu! Lantas beliau Shallallahu'alaihi wasallam bersabda, 'Shalatlah pada waktunya. Jika kamu mendapatkan shalat bersama mereka (penguasa/imam yang jahat), maka shalatlah bersama mereka dan jangan kamu berkata.\"Aku sudah shalat maka aku tidak akan shalat (lagi)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": 779,
			"text": "Telah mengkabarkan kepada kami ['Ubaidullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari ['Ashim] dari [Zirr] dari [Abdullah] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda, \"Mungkin kalian akan menjumpai suatu kaum yang mengerjakan shalat tidak pada waktunya. Jika kalian mendapati mereka, maka shalatlah pada waktunya, kemudian ikutlah shalat bersama mereka dan anggaplah itu sebagai shalat sunnah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": 780,
			"text": "Telah mengkabarkan kepada kami [Qutaibah] dia berkata; telah memberitakan kepada kami [Fudhail bin 'Iyadh] dari [Al A'masy] dari [Isma'il bin Raja'] dari [Aus bin Dham'aj] dari [Abu Mas'ud] dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, orang yang menjadi imam untuk suatu kaum adalah yang paling menguasai AI Qur'an. Jika bacaan mereka sama, maka yang jadi imam adalah orang yang lebih dulu hijrah. Jika dalam hijrah mereka sama. maka yang jadi imam adalah orang yang paling mengetahui tlenlang Sunnah. Jika pengetahuan mereka tentang Sunnah sama, maka yang jadi imam adalah orang yang paling tua di antara mereka. Janganlah kamu mengimami seseorang di tempat yang menjadi wewenangnya dan janganlah duduk di atas tempat kemuliaannya kecuali seizinnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": 781,
			"text": "Telah mengkabarkan kepada kami [Hajib bin Sulaiman Al Manbiji] dari [Waki'] dari [Sufyan] dari [Khalid Al Hadza'] dari [Abu Qibalah] dari [Malik bin Al Huwairits] dia berkata; \"Aku pernah datang kepada Rasulullah Shallallahu'alaihi wasallam bersama anak pamanku -pada kesempatan lain ia berkata, \"bersama temanku\"- lantas Nabi Shallallahu'alaihi wasallam bersabda, 'Jika kalian berdua melakukan perjalanan, maka adzan dan iqamahlah, dan hendaknya yang paling tua menjadi imam bagi yang lain",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": 782,
			"text": "Telah mengkabarkan kepada kami ['Ubaidullah bin Sa'id] dari [Yahya] dari [Hisyam] dia berkata; telah menceritakan kepada kami [Qatadah] dari [Abu Nadhrah] dari [Abu Sa'id] dari Nabi Shallallahu'alaihi wasallam, beliau bersabda, \"Bila mereka bertiga, maka salah satunya menjadi imam, dan yang lebih berhak adalah yang paling bagus bacaannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": 783,
			"text": "Telah mengkabarkan kepada kami [Ibrahim bin Muhammad At Taimi] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] dari [Isma'il bin Raja'] dari [Aus bin Dham'aj] dari [Abu Mas'ud] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda, \"Janganlah seseorang menjadi imam di tempat yang menjadi wewenangnya dan janganlah duduk diatas tempat kemuliaannya, kecuali seizinnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": 784,
			"text": "Telah mengkabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Ya'qub bin 'Abdurrahman] dari [Abu Hazim] dari [Sahl bin Sa'd] bahwa telah sampai kabar kepada Rasulullah Shallallahu'alaihi wasallam bahwa Bani Amru bin Auf mempunyai suatu masalah. Rasulullah Shallallahu'alaihi wasallam dan beberapa orang lalu datang mendamaikan mereka. Rasulullah Shallallahu'alaihi wasallam tertahan (oleh urusan mereka) sampai tibalah waktu shalat pertama (Zhuhur). Kemudian Bilal datang kepada Abu Bakar dan berkata, \"Wahai Abu Bakar, Rasulullah Shallallahu'alaihi wasallam tertahan sedangkan waktu shalat sudah tiba. Apakah engkau sudi menjadi imam bagi orang-orang?\" la menjawab, \"Ya, jika kamu mau.\" Lalu Bilal menyerukan iqamah dan Abu Bakar maju lantas bertakbir bersama kaum muslim. Kemudian datang Rasulullah Shallallahu'alaihi wasallam di celah-celah barisan shalat hingga beliau Shallallahu'alaihi wasallam berdiri di barisan shalat. Orang-orang lalu mulai menepukkan tangannya, tetapi Abu Bakar tidak menoleh dalam shalatnya. Setelah orang-orang banyak yang menepukkan tangannya (sebagai isyarat), Abu Bakar menoleh dan mendapati Rasulullah Shallallahu'alaihi wasallam, maka Rasulullah Shallallahu'alaihi wasallam mengisyaratkan kepadanya untuk terus melanjutkan shalatnya, namun Abu Bakar mengangkat kedua tangannya dan memuji Allah Azza wa Jalla lantas mundur ke belakang hingga berdiri pada barisan makmum. Rasulullah Shallallahu'alaihi wasallam lalu maju untuk menjadi imam. Setelah selesai beliau Shallallahu'alaihi wasallam menghadap kepada orang-orang dan bersabda, \"Wahai manusia sekalian, Kenapa kalian ketika shalat bertepuk tangan? Tepuk langan hanya untuk perempuan. Barangsiapa mendapati sesuatu yang kurang beres pada shalalnya, maka ucapkan. 'Subhanallah (Maha Suci Allah), karena tidak seorangpun yang mendengar ketika ada yang mengucapkan subhanallah (Maha Suci Allah) kecuali pasli menolehnya. Wahai Abu Bakar, apakah yang menghalangimu untuk shalat menjadi imam bagi orang-orang saat kuisyaratkan demikian?\" Abu Bakar berkata, \"Tidaklah panlas bagi Ibnu Quhafah untuk shalat -menjadi imam- di depan Rasulullah Shallallahu'alaihi wasallam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": 785,
			"text": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Humaid] dari [Anas] dia berkata; \"Shalat terakhir Rasulullah Shallallahu'alaihi wasallam yang dikerjakan bersama para sahabat adalah shalat yang beliau kerjakan dengan mengenakan baju yang kasar di belakang Abu Bakar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": 786,
			"text": "Telah mengkabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Bakr bin 'Isa] -sahabat Al Bashri- dia berkata; aku mendengar [Syu'bah] menyebutkan dari [Nu'aim bin Abu Hind] dari [Abu Wa'il] dari [Masruq] dari ['Aisyah] Radliyallahu'anha, bahwa Abu Bakar pernah shalat mengimami orang-orang dan Rasulullah Shallallahu'alaihi wasallam berada di barisan shalat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": 787,
			"text": "Telah mengkabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami [Abdullah] dari [Aban bin Yazid] dia berkata; telah menceritakan kepada kami [Badil bin Maisarah] dia berkata; telah menceritakan kepada kami [Abu 'Athiyyah] -budak kami- dari [Malik bin Al Huwairits] dia berkata; \"Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda, 'Jika salah seorang dari kalian berkunjung ke suatu kaum, maka janganlah menjadi imam bagi mereka",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": 788,
			"text": "Telah mengkabarkan kepada kami [Harun bin Abdullah] dia berkata; telah menceritakan kepada kami [Ma'an] dia berkata; telah menceritakan kepada kami [Malik] dia berkata; dan telah menceritakan kepada kami [Al Harits bin Miskin] dalam bentuk bacaan kepadanya dan saya mendengar lafazhnya dari dia dari [Ibnul Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari [Mahmud bin Ar-Rabi'] bahwasanya ['Itban bin Malik] pernah menjadi imam bagi kaumnya, padahal dia buta. Dia berkata kepada Rasulullah Shallallahu'alaihi wasallam, \"Saat ini gelap, turun hujan, serta banjir, sementara aku orang buta, maka shalatlah di rumahku yang telah kujadikan masjid wahai Rasulullah Shallallahu'alaihi wasallam.\" Rasulullah Shallallahu'alaihi wasallam lalu berkata, \"Di mana yang kamu inginkan agar aku shalat bersamamu?\" la menunjukkan tempat yang ada di rumahnya, lalu Rasulullah Shallallahu'alaihi wasallam shalat di sana",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": 789,
			"text": "Telah mengkabarkan kepada kami [Musa bin 'Abdurrahman Al Masruqi], telah menceritakan kepada kami [Husain bin 'Ali] dari [Zaidah] dari [Sufyan] dari [Ayyub] dia berkata; telah menceritakan kepada kami ['Amr bin Salamah Al Jarmi] dia berkata; \"Suatu rombongan melewati kami, dan kami belajar Al Qur'an kepada mereka. Lalu ayahku datang kepada Nabi Shallallahu'alaihi wasallam, dan beliau Shallallahu'alaihi wasallam bersabda, 'Orang yang menjadi imam bagi kalian adalah yang paling banyak hapal Al Qur 'an'. Maka [ayahku] datang dan mengatakan bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, 'Orang yang menjadi imam bagi kalian adalah yang paling banyak hapal Al Qur'an'. Lantas mereka saling memandang siapakah yang paling banyak hapal Al Qur'an, dan ternyata aku orang yang paling banyak hapal Al Qur'an, maka aku menjadi imam bagi mereka, padahal umurku saat itu delapan tahun",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": 790,
			"text": "Telah mengkabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Husyaim] dari [Hisyam bin Abu Abdullah] dan [Hajjaj bin Abu 'Utsman] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [bapaknya], dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda, \"Jika shalat telah diserukan, maka janganlah kalian berdiri hingga melihatku",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": 791,
			"text": "Telah mengkabarkan kepada kami [Ziyad bin Ayyub] dia berkata; telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Abdul 'Aziz] dari [Anas] dia berkata; \"Tatkala iqamah dikumandangkan, Rasulullah Shallallahu'alaihi wasallam berbicara dengan seseorang yang membutuhkannya, maka beliau menunda shalat hingga orang-orang tertidur",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": 792,
			"text": "Telah mengkabarkan kepada kami ['Amr bin 'Utsman bin Sa'id bin Katsir] dia berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Az-Zubaidi] dari [Az-Zuhri] dan [Al Walid] dari [Al Auza'i] dari [Az-Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; \"Setelah iqamah dikumandangkan, orang-orang segera merapikan barisan mereka, kemudian Rasulullah Shallallahu'alaihi wasallam keluar hingga tatkala beliau sampai di tempat shalatnya beliau ingat bahwa dirinya belum mandi. Lantas beliau Shallallahu'alaihi wasallam bersabda kepada jamaah, 'Tolong tetaplah kalian di tempat\". Rasulullah Shallallahu'alaihi wasallam segera kembali ke rumahnya dan keluar lagi kepada kami dalam keadaan rambut yang masih basah, saat beliau mandi kami tetap dalam barisan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": 793,
			"text": "Telah mengkabarkan kepada kami [Ahmad bin 'Abdah] dari [Hammad bin Zaid] kemudian dia menyebutkan kalimat yang maknanya, dia berkata; telah menceritakan kepada kami [Abu Hazim] dia berkata; berkata [Sahl bin Sa'd] Bahwa Bani Amru bin Auf mempunyai suatu masalah, lalu hal ini sampai kepada Rasulullah Shallallahu'alaihi wasallam, maka beliau Shallallahu'alaihi wasallam shalat Zhuhur kemudian mendatangi mereka untuk mendamaikan mereka. Rasulullah Shallallahu'alaihi wasallam bersabda kepada Bilal, \"Wahai Bilal, jika tiba waktu shalat Ashar sedangkan aku belum datang, maka suruh Abu Bakar (menjadi imam) shalat bersama kaum muslim.\"Tatkala datang waktu Ashar, maka Bilal segera adzan dan dilanjutkan dengan iqamah. Lantas Bilal berkata kepada Abu Bakar Rabi'ah, \"Majulah (jadi imam).\" maka Abu Bakar maju menjadi imam shalat. Saat itu Rasulullah Shallallahu'alaihi wasallam datang, beliau Shallallahu'alaihi wasallam segera masuk lewat celah-celah barisan shalat hingga beliau berdiri di belakang Abu Bakar. Orang-orang mulai menepukkan tangannya, dan Abu Bakar bila telah memulai shalat biasanya ia tidak menoleh dalam shalatnya. Setelah Abu Bakar melihat banyaknya orang-orang yang bertepuk tangan, maka Abu Bakar tidak mampu menahan untuk tidak menoleh, sehingga ia mendapati Rasulullah Shallallahu'alaihi wasallam, dan beliau Shallallahu'alaihi wasallam memberikan isyarat dengan tangannya kepada Abu Bakar, namun Abu Bakar memuji Allah Azza wa Jalla atas perintah beliau Shallallahu'alaihi wasallam kepada dirinya, \"Lanjutkan saja.\" Lalu Abu Bakar kembali ke belakang dengan mundur, dan Rasulullah Shallallahu'alaihi wasallam segera maju untuk menjadi imam dan shalat bersama kaum muslim. Setelah selesai, beliau Shallallahu'alaihi wasallam menghadap ke jemaah dan bersabda, \"Wahai Abu Bakar, apakah yang menghalangimu untuk shalat menjadi imam bagi para jemaah saat kuisyaratkan demikian.\" Abu Bakar berkata, \"Tidaklah pantas bagi Ibnu Quhafah untuk shalat menjadi imam bagi Rasulullah Shallallahu'alaihi wasallam.\" Beliau Shallallahu'alaihi wasallam lalu bersabda kepada kaum muslim, \"Jika kalian mengalami sesuatu -dalam shalat- maka hendaknya bagi orang laki-laki untuk bertasbih dan bagi orang perempuan untuk bertepuk tangan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 794,
			"arabicnumber": 794,
			"text": "Telah mengkabarkan kepada kami [Hannad bin As-Sari] dari [Ibnu 'Uyainah] dari [Az-Zuhri] dari [Anas] bahwa Rasulullah Shallallahu'alaihi wasallam pernah jatuh dari kudanya dan badan bagian kanan beliau terluka, maka para sahabat segera membesuknya, lalu tibalah waktu shalat. Setelah selesai shalat, beliau Shallallahu'alaihi wasallam bersabda, \"Sesungguhnya seorang imam itu dijadikan untuk diikuti. Bila dia ruku' maka rukulah kalian, bila ia mengangkat kepalanya maka hendaklah kalian mengangkat kepala, jika ia sujud maka sujudlah kalian, dan jika ia mengucapkan 'Sami 'alluhu liman hamidah (Allah Maha Mendengar terhadap semua yang memuji-Nya) ' maka ucapkan, 'Rabbana lakal hamdu (Ya Allah, hanya kepada Engkau kami memuji)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": 795,
			"text": "Telah mengkabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami [Abdullah bin Al Mubarak] dari [Ja'far bin Hayyan] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri] bahwa Rasulullah Shallallahu'alaihi wasallam pernah melihat sahabatnya terlambat, maka dia bersabda, \"Majulah kalian dan shalatlah di belakangku. Sedangkan orang yang terlambat maka bermakmumlah kepada orang yang di belakang kalian. Sesungguhnya suatu kaum senantiasa terlambat hingga Allah Azza wa Jalla mengakhirkan mereka.\" Sedang telah mengabarkan kepada kami [Suwaid bin Nashr] mengatakan, telah mengabarkan kepada kami [Abdullah] dari [Aljurairi] dari [Abi Nadhrah] semisalnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": 796,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": 797,
			"text": "Telah mengkabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepadaku [Abu Dawud] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Musa bin Abu 'Aisyah] dia berkata; aku mendengar ['Ubaidullah bin Abdullah] menceritakan dari ['Aisyah] Radliyallahu'anha, bahwa Rasulullah Shallallahu'alaihi wasallam menyuruh Abu Bakar shalat mengimami orang-orang (sahabat). Aisyah lalu berkata; \"Nabi Shallallahu'alaihi wasallam pernah shalat sambil duduk di depan Abu Bakar, sedangkan Abu Bakar shalat bersama orang-orang, dan mereka shalat di belakang Abu Bakar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": 798,
			"text": "Telah mengkabarkan kepada kami ['Ubaidullah bin Fadhalah bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; telah menceritakan kepada kami [Humaid bin 'Abdurrahman bin Humaid Ar-Ruwasi] dari [bapaknya] dari [Abu Az Zubair] dari [Jabir] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam shalat Zhuhur bersama kami dan Abu Bakar berada di belakang beliau. Bila Rasulullah Shallallahu'alaihi wasallam bertakbir, maka Abu Bakar ikut bertakbir untuk memperdengarkan (takbir Rasulullah Shallallahu'alaihi wasallam) kepada kami",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": 799,
			"text": "Telah mengkabarkan kepada kami [Muhammad bin 'Ubaid Al Kufi] dari [Muhammad bin Fudhail] dari [Harun bin 'Antarah] dari ['Abdurrahman bin Al Aswad] dari [Al Aswad] dan ['Alqamah] mereka berdua berkata; Pernah kami menemui [Abdullah] pada pertengahan siang, lalu ia berkata; 'Akan ada penguasa yang lalai waktu shalat, maka shalatlah kalian pada waktunya'. Kemudian ia berdiri dan mengerjakan shalat di antara aku dan temanku, lalu berkata, 'Beginilah aku melihat Rasulullah Shallallahu'alaihiwasallam melakukannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": 800,
			"text": "Telah mengabarkan kepada kami ['Abdah bin Abdullah] dia berkata; telah menceritakan kepada kami [Zaid bin Al Hubab] dia berkata; telah menceritakan kepada kami [Aflah bin Sa'id] dia berkata; telah menceritakan kepada kami [Buraidah bin Sufyan bin Farwah Al Aslami] dari seorang cucu kakeknya yang bernama [Mas'ud] dia berkata; Rasulullah Shalallahu 'Alaihi Wa sallam dan Abu Bakr melewatiku. Lalu Abu Bakar berkata kepadaku; Wahai Mas'ud, panggil Abu Tamim (yaitu budaknya) dan katakan kepadanya agar ia bersedia membawa kami dengan Untanya dan membawakan bekal perjalanan untuk kami sekaligus menjadi petunjuk jalan. Maka aku pun menemui budakku dan mengabarkan kepadanya. Kemudian aku kembali dengan membawa unta dan sekantong susu. Lalu Aku membawa keduanya melalui jalan yang belum mereka kenal, tiba-tiba datang waktu shalat, maka Rasulullah Shalallahu 'Alaihi Wa sallam berdiri untuk shalat dan Abu Bakr berdiri di sebelah kanannya. Waktu itu aku sudah masuk Islam, akupun berdiri dibelakang mereka berdua, kemudian Rasulullah Shalallahu 'Alaihi Wa sallam mendorong dada Abu Bakar kebelakang hingga kami berdua shalat dibelakangnya. Abu Abdurrahman berkata; 'Buraidah orangnya lemah dalam meriwayatkan Hadis",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": 801,
			"text": "Telah mengkabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwasanya neneknya Mulaikah pernah mengundang Rasulullah Shallallahu'alaihi wasallam untuk jamuan makan yang telah ia buat khusus untuk Rasulullah Shallallahu'alaihi wasallam, dan Rasulullah Shallallahu'alaihi wasallam menyantap jamuan tersebut. Kemudian beliau Shallallahu'alaihi wasallam bersabda, \"Berdirilah kalian, aku akan shalat bersama kalian.\" Anas berkata; \"Lalu aku berdiri di tikar kami yang sudah berubah warnanya jadi hitam karena lama tidak dipakai, maka aku menyiramnya dengan air. Rasulullah Shallallahu'alaihi wasallam segera berdiri dan aku berbaris dengan seorang anak yatim di belakangnya serta seorang perempuan tua (Mulaikah) di belakang kami. Beliau shalat dua rakaat kemudian pergi",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": 802,
			"text": "Telah mengkabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami [Abdullah bin Al Mubarak] dari [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Anas] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam datang ke tempat kami dan beliau hanya bersama aku, ibuku, seorang anak yatim, serta Ummu Hiram (bibiku). Rasulullah Shallallahu'alaihi wasallam kemudian bersabda, 'Berdirilah kalian, aku akan shalat bersama kalian.\" Anas berkata, \"(Hal ini) diluar waktu shalat.\" la juga menambahkan, \"Rasulullah Shallallahu'alaihi wasallam lalu shalat bersama kami",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 803,
			"arabicnumber": 803,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; aku mendengar [Abdullah bin Mukhtar] menceritakan dari [Musa bin Anas] dari [Anas] bahwa suatu saat ia bersama Rasulullah Shallallahu'alaihi wasallam, ibunya, dan bibinya. Rasulullah Shallallahu'alaihi wasallam lalu melakukan shalat, beliau menyuruh Anas (berdiri) di sebelah kanannya dan ibu serta bibinya di belakangnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 804,
			"arabicnumber": 804,
			"text": "Telah mengkabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] dia berkata; telah menceritakan kepada kami [Hajjaj] dia berkata; [Ibnu Juraij] berkata; telah mengkabarkan kepadaku [Ziyad] bahwasanya [Qaza'ah] -budak 'Abdu Qais- mengkabarkan kepadanya bahwasanya dia mendengar ['Ikrimah] -budak Ibnu 'Abbas- berkata; [Ibnu 'Abbas] berkata; \"Aku pernah shalat di samping Rasulullah Shallallahu'alaihi wasallam dan Aisyah juga ikut shalat bersama kami di belakang, adapun aku di samping Rasulullah Shallallahu'alaihi wasallam shalat bersama beliau Shallallahu'alaihi wasallam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 805,
			"arabicnumber": 805,
			"text": "Telah mengkabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abdullah bin Al Mukhtar] dari [Musa bin Anas] dari [Anas] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam shalat bersamaku dan seorang perempuan dari keluargaku. Beliau meletakkan kami di sebelah kanannya dan perempuan di belakang kami",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 806,
			"arabicnumber": 806,
			"text": "Telah mengkabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah] dari [Ayyub] dari [Abdullah bin Sa'id bin Jubair] dari [bapaknya] dari [Ibnu 'Abbas] dia berkata; \"Aku pernah menginap di tempat bibiku (Maimunah). Ketika Rasulullah Shallallahu'alaihi wasallam bangun untuk shalat malam, aku berdiri di sebelah kirinya. Beliau Shallallahu'alaihi wasallam lalu berkata kepadaku, 'Begini*. lalu beliau Shallallahu'alaihi wasallam memegang kepalaku dan menyuruhku berdiri di sebelah kanannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 807,
			"arabicnumber": 807,
			"text": "Telah mengkabarkan kepada kami [Hannad bin As-Sari] dari [Abu Mu'awiyah] dari [Al A'masy] dari ['Umarah bin 'Umair] dari [Abu Ma'mar] dari [Abu Mas'ud] dia berkata; \"Dahulu Rasulullah Shallallahu'alaihi wasallam mengusap bahu-bahu kami sebelum shalat sambil bersabda, janganlah kalian berselisih, karena (Jika kalian berselisih) maka hati kalian akan berselisih. Hendaklah yang berdiri di belakangku adalah orang-orang yang bijak dan berilmu, kemudian setelah mereka adalah orang yang kapasitasnya kurang dari mereka, dan begitu selanjutnya.\" Abu Mas'ud berkata; \"Sesungguhnya kalian pada hari ini sangat sering berselisih. Abu Abdurrahaman berkata; nama Abu Ma'mar adalah Abdullah bin Sakhbarah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 808,
			"arabicnumber": 808,
			"text": "Telah mengkabarkan kepada kami [Muhammad bin 'Umar bin 'Ali bin Muqaddam] dia berkata; telah menceritakan kepada kami [Yusuf bin Ya'qub] dia berkata; telah mengkabarkan kepadaku [At-Taimi] dari [Abu Mijlaz] dari [Qais bin 'Ubad] dia berkata; \"Tatkala aku shalat di masjid pada shaf terdepan, tiba-tiba seorang laki-Iaki menarikku dari belakang dan menyingkirkanku, lalu ia berdiri di tempatku tadi berdiri. Demi Allah, aku tidak faham dengan shalatku ini. Setelah selesai shalat, ternyata dia adalah [Ubay bin Ka'ab]. Kemudian ia berkata, 'Hai pemuda, semoga Allah tidak menjelekkanmu. Ini adalah ajaran (wasiat) Rasulullah Shallallahu'alaihi wasallam kepada kita, agar kami berdiri di belakangnya'. Lalu ia menghadap ke kiblat dan berkata, 'Demi Allah, celakalah Ahlul 'Aqdi' -ia ucapkan tiga kali- Kemudian ia berkata, 'Demi Allah, aku tidak sedih kepada mereka, tetapi aku sedih kepada orang yang menyesatkan'. Aku berkata, 'Wahai Abu Ya'qub, siapa yang di maksud dengan Ahlul 'Aqdi? ' Ia menjawab, 'Para penguasa",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 809,
			"arabicnumber": 809,
			"text": "Telah mengkabarkan kepadaku [Muhammad bin Salamah] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Abu Salamah bin 'Abdurrahman] bahwasanya ia mendengar [Abu Hurairah] berkata; \"Setelah iqamah dikumandangkan kami segera bangkit dan barisan telah lurus sebelum Rasulullah Shallallahu'alaihi wasallam keluar kepada kami. Lalu datanglah Rasulullah Shallallahu'alaihi wasallam kepada kami dan beliau berdiri di tempatnya untuk shalat. Sebelum takbir beliau pergi sambil berkata, 'Tetaplah di tempat kalian'. Kami menunggunya sambil berdiri hingga Rasulullah Shallallahu'alaihi wasallam datang, (ternyata) beliau baru mandi dan kepalanya masih meneteskan air. Setelah itu beliau bertakbir dan mengerjakan shalat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": 810,
			"text": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah memberitakan kepada kami [Abu Al Ahwash] dari [Simak] dari [An Nu'man bin Basyir] dia berkata; \"Dahulu Rasulullah Shallallahu'alaihi wasallam meluruskan barisan seperti meluruskan anak panah. Jika Rasulullah Shallallahu'alaihi wasallam melihat dada seseorang keluar dari barisan, maka aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda, 'Luruskan barisan kalian, atau Allah akan menyelisihkan wajah-wajah kalian",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": 811,
			"text": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Manshur] dari [Thalhah bin Musharrif] dari [Abdurrahman bin 'Ausajah] dari [Al Barra' bin 'Azib] dia berkata; \"Dahulu Rasulullah Shallallahu'alaihi wasallam memeriksa barisan shalat dari satu sisi ke sisi lain dan mengusap pundak serta dada kami, lalu bersabda, \"Janganlah kalian berbeda (bengkok, tidak lurus) sehingga hati kalian akan berselisih'. Beliau Shallallahu'alaihi wasallam juga bersabda, \"Allah dan para malaikat bershalawat (mendoakan) kepada orang yang berada dibarisan terdepan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": 812,
			"text": "Telah mengabarkan kepada kami [Bisyr bin Khalid Al 'Askari] dia berkata; telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Sulaiman] dari ['Umarah bin 'Umair] dari [Abu Ma'mar] dari [Abu Mas'ud] dia berkata; \"Dulu Rasulullah Shallallahu'alaihi wasallam mengusap bahu kami sambil berkata, \"Luruskan dan jangan berbeda (bengkok), jika kalian berbeda maka hati akan berselisih. Orang yang berdiri setelahku adalah orang yang bijak dan berilmu, kemudian setelah mereka adalah orang yang kapasitasnya kurang, dan begitu selanjutnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": 813,
			"text": "Telah mengabarkan kepada kami [Abu Bakr bin Nafi'] dia berkata; telah menceritakan kepada kami [Bahz bin Asad] dia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] bahwa Nabi Shallallahu'alaihi wasallam bersabda: \"Luruskan, luruskan, luruskan. Demi Dzat yang jiwaku ada di tangan-Nya, aku melihat kalian dari belakang sebagaimana aku melihat kalian dari depan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": 814,
			"text": "Telah mengabarkan kepada kami ['Ali bin Hujr]; telah memberitakan kepada kami [Isma'il] dari [Humaid] dari [Anas] Radliyallahu'anhu, dia berkata; \"Rasulullah Shallallahu'alaihi wasallam menghadap kepada kami dengan wajahnya ketika iqamah telah dikumandangkan sebelum beliau Shallallahu'alaihi wasallam bertakbir, lalu bersabda: \"Luruskan barisan kalian dan rapatkanlah. Aku melihat kalian dari balik punggungku",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": 815,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Mubarak Al Mukharrimi] dia berkata; telah menceritakan kepada kami [Abu Hisyam] dia berkata; telah menceritakan kepada kami [Aban] dia berkata; telah menceritakan kepada kami [Qatadah] dia berkata; telah menceritakan kepada kami [Anas] dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"luruskan barisan kalian, saling mendekatlah di antara barisan, dan sejajarkan antara bahu dengan bahu. Demi Dzat yang jiwa Muhammad ada di tangan-Nya, aku melihat setan masuk dari celah-celah barisan laksana kambing kecil",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": 816,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Fudhail bin 'Iyadh] dari [Al A'masy] dari [Al Musayyab bin Rafi'] dari [Tamim bin Tharafah] dari [Jabir bin Samu Radliyallahu'anha] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam keluar kepada kami sambil bersabda: \"Tidakkah kalian berbaris seperti barisan para malaikat di sisi Rabb mereka? ' Para sahabat bertanya, 'Bagaimanakah cara malaikat berbaris di sisi Rabb mereka? ' Beliau Shallallahu'alaihi wasallam menjawab, 'Mereka menyempurnakan barisan pertama dahulu, kemudian merapatkan barisan tersebut",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": 817,
			"text": "Telah mengabarkan kepadaku [Yahya bin 'Utsman Al Himshi] dia berkata; telah menceritakan kepada kami [Baqiyyah] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Jubair bin Nufair] dari [Al 'Irbadh bin Sariyah] dari Rasulullah Shallallahu'alihiwasallam bahwa beliau mendoa'akan (Rahmat dan ampunan) barisan pertama tiga kali, lalu mendo'akan barisan kedua satu kali",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": 818,
			"text": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dari [Khalid] dia berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Sempurnakan barisan pertama kemudian barisan selanjutnya, dan jika kekurangan tempat, hendaknya barisan terakhir",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": 819,
			"text": "Telah mengabarkan kepada kami ['Isa bin Ibrahim bin Matsrud] dia berkata; telah menceritakan kepada kami [Abdullah bin Wahb] dari [Mu'awiyah bin Shalih] dari [Abu Az Zahiriyyah] dari [Katsir bin Murrah] dari [Abdullah bin 'Umar] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa menyambung barisan Allah menyambung-nya, dan barang siapa memutus barisan Allah Azza wa Jalla memutusnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": 820,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Jarir] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Sebaik-baik barisan laki-laki adalah barisan pertama, dan yang paling jelek adalah barisan paling belakang. Sedangkan barisan perempuan yang baik adalah barisan paling belakang, dan barisan yang paling jelek adalah barisan yang paling depan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": 821,
			"text": "Telah mengabarkan kepada kami ['Amr bin Manshur] dia berkata; telah menceritakan kepada kami [Abu Nu'aim] dari [Sufyan] dari [Yahya bin Hani'] dari [Abdul Hamid bin Mahmud] dia berkata; \"Aku dan Anas pernah shalat bersama salah seorang penguasa, dan karena mereka mendorong kami hingga kami berdiri dan shalat di antara dua tiang, maka [Anas] tergeser ke belakang. Lantas ia berkata, 'Kami menghindari tiang ini pada masa Rasulullah Shallallahu'alaihi wasallam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": 822,
			"text": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami [Abdullah] dari [Mis'ar] dari [Tsabit bin 'Ubaid] dari [Ibnul Barra'] dari [Al Barra'] dia berkata; \"Kami dahulu bila shalat di belakang Rasulullah Shallallahu'alihiwasallam aku suka berada di sebelah kanannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": 823,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi Shallallahu'alihiwasallam beliau bersabda: \"Bila seorang dari kalian melakukan shalat bersama orang-orang (menjadi imam), maka ringankanlah. karena di kalangan mereka ada yang sakit, yang lemah, dan yang sudah tua. Tetapi jika salah seorang dari kalian shalat sendirian, maka ia boleh memperpanjang sekehendaknya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": 824,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] bahwa Nabi Shallallahu'alaihi wasallam adalah orang yang paling ringan shalatnya namun sempurna",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": 825,
			"text": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah menceritakan kepada kami [Abdullah] dari [Al Auza'i] dia berkata; telah menceritakan kepadaku [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [bapaknya] dari Nabi Shallallahu'alihiwasallam beliau Shallallahu'alaihi wasallam bersabda: \"Aku sedang berdiri saat shalat, lalu kudengar tangis anak kecil, maka aku pendekkan shalatku. karena aku tidak suka memberatkan (menyusahkan) ibunya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": 826,
			"text": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid bin Al Harits] dari [Ibnu Abu Dzi'b] dia berkata; telah mengabarkan kepadaku [Al Harits bin 'Abdurrahman] dari [Salim bin Abdullah] dari [Abdullah bin 'Umar] dia berkata; \"Dahulu Rasulullah Shallallahu'alaihi wasallam memerintahkan untuk meringankan shalat. Beliau juga mengimami kami dengan membaca surat Ash-Shaffat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": 827,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Utsman bin Abu Sulaiman] dari ['Amir bin Abdullah bin Az Zubair] dari ['Amr bin Sulaim Az Zuraqi] dari [Abu Qatadah] dia berkata; \"Aku melihat Rasulullah Shallallahu'alaihi wasallam mengimami orang-orang sedangkan beliau membawa Umamah binti Abu Ash di atas pundaknya. Rasulullah Shallallahu'alaihi wasallam meletakkannya ketika ruku dan menggendongnya ketika bangun dari sujud",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Muhammad bin Ziyad] dari [Abu Hurairah] dia berkata; \"Nabi Muhammad Shallallahu'alaihi wasallam bersabda: \"Apakah orang yang mengangkat kepalanya -saat shalat- sebelum imam tidak takut kalau Allah merubah kepalanya dengan kepala keledai?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": 829,
			"text": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Abu Ishaq] dia berkata; aku mendengar [Abdullah bin Yazid] berkhutbah, dia berkata; telah menceritakan kepada kami [Al Barra'] -dia bukan pendusta-: Bila mereka (para sahabat) mengerjakan shalat bersama Rasulullah Shallallahu'alihiwasallam dan Rasulullah Shallallahu'alaihi wasallam mengangkat kepalanya dari ruku', maka mereka tetap berdiri hingga mereka melihat Rasulullah Shallallahu'alaihi wasallam dalam keadaan sujud, kemudian setelah itu mereka sujud",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": 830,
			"text": "Telah mengabarkan kepada kami [Muammal bin Hisyam] dia berkata; telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Sa'id] dari [Qatadah] dari [Yunus bin Jubair] dari [Hiththan bin Abdullah] dia berkata; \"Kami shalat bersama Abu Musa, setelah ia duduk seorang laki-laki dari kaumnya datang dan berkata, 'Shalat telah ditetapkan dengan kebaikan dan zakat'. Sesudah Abu Musa salam, ia menghadap kepada kaumnya sambil berkata, Tadi siapa yang mengatakan hal tersebut? ' Kaumnya terdiam semua, lantas ia bertanya, 'Hai Hiththan, mungkin kamu tadi yang mengucapkannya? ' la menjawab, 'Tidak. Aku khawatir kalau engkau akan mencelaku dengan hal ini'. Kemudian [Abu Musa] berkata, 'Rasulullah Shallallahu'alaihi wasallam mengajarkan shalat dan Sunnah-sunnah kepada kami, beliau Shallallahu'alaihi wasallam bersabda, \"Imam itu untuk diikuti. Bila ia bertakbir maka bertakbirlah dan bila imam mengucapkan, 'Ghairil maghdhubi 'alaihim walaadh-dhaalliin (Bukan orang-orang yang dimurkai bukan pula orang-orang yang sesat) ' maka ucapkan, 'Aamiin'. Semoga Allah mengabulkan kalian. Jika imam rukuk maka rukuklah dan jika mengangkat (kepala dari ruku') dengan mengucapkan 'Sami'allaahu liman hamidah (Allah mendengar orang yang memujinya) ' maka ucapkan, 'Rabbanaa lakal hamdu (Wahai Rabb kami, untuk-Mu segala pujian) ' Semoga Allah mendengar kalian. Bila, imam sujud maka ikutlah sujud dan jika ia mengangkat (kepala dari sujud) maka angkatlah. Imam sujud sebelum kalian dan mengangkat (kepala dari sujud) sebelum kalian.\" Lantas Rasulullah Shallallahu'alaihi wasallam bersabda -demikianlah tata cara yang harus dilakukan antara imam dengan makmum-, \" Masing-masing gerakan itu, kalian ikuti sesudahnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": 831,
			"text": "Telah mengabarkan kepada kami [Washil bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Ibnu Fudhail] dari [Al A'masy] dari [Muharib bin Ditsar] dan [Abu Shalih] dari [Jabir] dia berkata; \"Seorang laki-laki Anshar datang, dan iqamah shalat sudah dikumandangkan. Lalu ia masuk ke masjid dan shalat di belakang Mua'dz. la memperlama shalatnya bersama jamaah, maka laki-laki tadi keluar dari jamaah dan shalat di pojok masjid kemudian pergi. Setelah Mua'dz selesai shalat, ia diberitahu, 'Si Fulan berbuat begini dan begitu'. Lalu Mua'dz berkata, 'Besok pagi akan aku ceritakan hal ini kepada Rasulullah Shallallahu'alihiwasallam. Maka Mua'dz segera datang kepada Rasulullah Shallallahu'alaihi wasallam dan menceritakan hal tersebut. Rasulullah Shallallahu'alaihi wasallam kemudian mengutus seseorang kepadanya (untuk memanggilnya), lalu beliau Shallallahu'alaihi wasallam bertanya kepadanya, ' 'Apakah yang mendorongmu berbuat demikian? ' la menjawab. 'Wahai Rasulullah Shallallahu'alihiwasallam aku pekerja keras di siang hari dan aku datang sedangkan iqamah shalat sudah dikumandangkan. Lalu aku segera masuk masjid dan shalat bersamanya, dan ia membaca surat ini dan surat itu. la memperlama shalatnya, maka aku keluar dan mengerjakan shalat di pojok masjid'. Kemudian Rasulullah Shallallahu'alaihi wasallam bersabda, 'Wahai Mua'dz, apakah engkau hendak menjadi orang yang menimbulkan fitnah? Wahai Mua 'dz, apakah engkau hendak menjadi orang yang menimbulkan fitnah? Wahai Mua 'dz, apakah engkau hendak menjadi orang yang menimbulkan fitnah?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": 832,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari [Anas bin Malik] bahwa Rasulullah Shallallahu'alaihi wasallam pernah naik kuda dan beliau terjatuh dari kudanya, maka bagian kanan badannya terluka. Kemudian beliau shalat sambil duduk. dan kami juga shalat di belakangnya sambil duduk. Setelah selesai shalat, Beliau Shallallahu'alaihi wasallam bersabda, \"Tidaklah seorang imam itu dijadikan melainkan untuk diikuti. Jika dia shalat dengan berdiri maka shalatlah kalian dengan berdiri, dan jika ia rukuk, maka rukuklah kalian, dan jika ia mengucapkan 'Sami'allahuliman hamidah (Allah Maha Mendengar siapa yang memujinya) maka ucapkan, 'Rabbana lakal hamdu (Ya Allah, untuk-Mu segala pujian) dan bila ia shalat dengan duduk maka shalatlah kalian dengan duduk",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": 833,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala] dia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] Radliyallahu'anha dia berkata; \"Tatkala Rasulullah Shallallahu'alaihi wasallam merasa berat (sakitnya), Bilal datang kepada beliau untuk memberitahukan tentang (datangnya waktu) shalat, maka beliau Shallallahu'alaihi wasallam bersabda 'Perintahkan Abu Bakar untuk shalat mengimami orang-orang'. Aku berkata, 'Wahai Rasulullah Shallallahu'alihiwasallam Abu Bakar orang yang berhati lembut, jadi jika ia menggantikan posisi engkau maka orang-orang tidak bisa mendengar suaranya. Bagaimana jika engkau menyuruh Umar?\" Beliau Shallallahu'alaihi wasallam tetap berkata, 'Perintahkan Abu Bakar untuk shalat mengimami orang-orang'. Lalu aku berkata kepada Hafshah, 'Katakan kepada beliau Shallallahu'alaihi wasallam (agar beliau menyuruh Umar) '. Kemudian Hafshah berkata kepada Rasulullah Shallallahu'alaihi wasallam tentang hal itu, dan beliau Shallallahu'alaihi wasallam bersabda, Kalian (para wanita seperti) saudara Yusuf, maka perintahkan Abu Bakar untuk Shalat bersama kaum muslim.\" Aisyah berkata; \"Lalu orang-orang menyuruh Abu Bakar. Setelah Abu Bakar memulai shalat, Rasulullah Shallallahu'alaihi wasallam merasakan badannya ringan.\" Aisyah meneruskan ceritanya, \"Lantas Rasulullah Shallallahu'alaihi wasallam bangkit dengan dipapah oleh dua orang laki-laki, sedangkan kedua kakinya menggores di tanah. Sesampainya di dalam masjid, Abu Bakar masih mendengar nafasnya yang terengah-engah, maka ia berusaha untuk mundur, tetapi Rasulullah Shallallahu'alaihi wasallam mengisyaratkan kepadanya agar tetap di tempatnya. Rasulullah lalu duduk di sebelah Abu Bakar. Beliau shalat mengimami kaum muslimin dengan duduk dan Abu Bakar shalat berdiri dengan mengikuti Rasulullah Shallallahu'alihiwasallam sedangkan kaum muslimin mengikuti shalat Abu Bakar Radliyallahu'anhu",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": 834,
			"text": "Telah mengabarkan kepada kami [Al 'Abbas bin Abdul 'Azhim Al 'Anbari] dia berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] dia berkata; telah menceritakan kepada kami [Zaidah] dari [Musa bin Abu 'Aisyah] dari ['Ubaidullah bin Abdullah] dia berkata; aku masuk menemui 'Aisyah, maka aku berkata; Sudilah kiranya engkau memberitahukanku sakitnya Rasulullah Shallallahu'alihiwasallam. [Aisyah] menjawab. 'Ketika Rasulullah Shallallahu'alaihi wasallam sakit berat, beliau Shallallahu'alaihi wasallam bersabda.\"Apakah orang-orang telah shalat?\" Kami menjawab, \"Belum wahai Rasulullah Shallallahu'alihiwasallam, mereka menunggu engkau.\" Beliau bersabda, \"Letakkan air untukku di dalam bak\": Aisyah berkata, 'Lantas kami mengerjakannya. Lalu beliau mandi, kemudian bangkit dengan susah payah. Tiba-tiba beliau Shallallahu'alaihi wasallam pingsan 'dan tersadar kembali, lalu beliau Shallallahu'alaihi wasallam bersabda: \"Apakah orang-orang sudah shalat?\" Kami menjawab, \"Belum wahai Rasulullah Shallallahu'alihiwasallam mereka menunggu engkau.\" Beliau bersabda; \"Letakkan air untukku di dalam bak\": Aisyah berkata, 'Lantas kami mengerjakannya. Beliau lalu mandi dan bangkit dengan susah payah. Tiba-tiba beliau Shallallahu'alaihi wasallam pingsan dan tersadar kembali lalu bersabda.\"Apakah orang-orang sudah shalat?\" Kami menjawab, \"Belum wahai Rasulullah Shallallahu'alihiwasallam mereka menunggu engkau.\" Kemudian beliau berkata yang ketiga kalinya seperti perkataan tadi. Orang-orang tinggal di masjid untuk menunggu Nabi Shallallahu'alaihi wasallam untuk shalat Isya Kemudian Rasulullah Shallallahu'alaihi wasallam mengutus seseorang kepada Abu Bakar agar menyuruh dia untuk shalat mengimami orang-orang. Ketika utusan Rasulullah Shallallahu'alaihi wasallam datang kepada Abu Bakar, ia berkata, \"Rasulullah Shallallahu'alaihi wasallam memerintahkanmu untuk shalat bersama (mengimami) kaum orang-orang.\" Abu Bakar adalah orang yang sangat lembut hatinya (mudah menangis), maka ia berkata kepada Umar, \"Wahai Umar, shalatlah bersama (mengimami) orang-orang.\" Umar menjawab, \"Kamu lebih berhak untuk itu.\" Kemudian Abu Bakar shalat bersama (megimami) kaum muslim pada hari-hari itu. Kemudian Rasulullah Shallallahu'alaihi wasallam merasa enak badan, maka beliau Shallallahu'alaihi wasallam datang dengan dipapah oleh dua orang laki-laki -salah satunya adalah Abbas- untuk shalat Zhuhur. Tatkala Abu Bakar melihat beliau, ia segera mundur, tetapi Rasulullah Shallallahu'alaihi wasallam mengisyaratkan kepadanya agar tidak mundur. Rasulullah Shallallahu'alaihi wasallam memerintahkan dua orang yang memapahnya untuk mendudukkannya di samping Abu Bakar. Kemudian Abu Bakar shalat sambil berdiri dan oreng-orang shalat dengan mengikuti shalatnya Abu Bakar, sedangkan Rasulullah Shallallahu'alaihi wasallam shalat dengan duduk.' Kemudian aku masuk ke tempat Ibnu Abbas dan aku katakan kepadanya, 'Maukah aku ceritakan kepadamu apa yang diceritakan oleh Aisyah kepadaku tentang sakit Rasulullah Shallallahu'alaihi wasallam? ' [Ibnu Abbas] menjawab, 'Ya'. Maka aku memaparkan cerita Aisyah tadi, dan ia tidak mengingkari sedikitpun. la bertanya kepadaku, 'Apakah ia menyebutkan nama laki-laki yang bersama Abbas? ' Aku menjawab, Tidak'. Ibnu Abbas berkata, 'Dia adalah Ali bin Abu Thalib",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": 835,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr] dia berkata; aku mendengar [Jabir bin Abdullah] dia berkata; \"Mua'dz shalat bersama Nabi Shallallahu'alihiwasallam, kemudian ia kembali kepada kaumnya dan mengimami shalat mereka di malam hari dan ia (Mua'dz) memanjangkan shalatnya. Kemudian Muadz shalat bersama Rasulullah, lalu ia kembali kepada kaumnya dan mengimami shalat mereka, dan ia membaca surat Al Baqarah. Ketika salah seorang kaumnya mendengar Muadz lama dalam shalat, ia keluar dari shalat dan shalat sendiri, maka kaumnya berkata kepadanya, 'Kamu munafik wahai fulan'. Orang itu menjawab, 'Demi Allah, aku tidak munafik. Aku akan mendatangi dan menceritakan hal ini pada Nabi Shallallahu'alihiwasallam. Lalu orang itu mendatangi Nabi Shallallahu'alaihi wasallam dan berkata, 'Wahai Rasulullah, Muadz shalat bersama Anda. kemudian ia kembali dan mengimami shalat kami. Anda melamakan shalat kemarin malam, lalu Muadz shalat dengan Anda, kemudian dia kembali dan mengimami kami, dan ia memulai shalat dengan membaca surat Albaqarah. Ketika aku mendengarnya membaca surat Albaqarah. maka aku mundur dan shalat sendiri, karena kami pekerja keras yang bekerja dengan tangan kami. Rasulullah Shallallahu'alaihi wasallam lalu bersabda, 'Wahai Muadz, apakah kamu ingin menimbulkan fitnah? Bacalah surat ini dan surat ini (maksudnya surat yang pendek)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": 836,
			"text": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dari [Asy'ats] dari [Al Hasan] dari [Abu Bakar] dari Rasulullah Shallallahu'alihiwasallam bahwa ia pernah shalat Khauf (shalat saat perang). Beliau shalat dengan -jamaah- yang di belakangnya dua rakaat dan shalat dengan -jamaah- yang datang kemudian dua rakaat. Nabi Shallallahu'alaihi wasallam shalat empat rakaat sedangkan para jamaahnya shalat dua rakaat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 837,
			"arabicnumber": 837,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Ibnu 'Umar] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, \"Shalat berjamaah lebih utama daripada shalat sendirian, dengan kelebihan dua puluh tujuh derajat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 838,
			"arabicnumber": 838,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, \"Shalat berjamaah lebih utama daripada shalat salah seorang dari kalian sendirian dengan kelebihan dua puluh lima bagian",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 839,
			"arabicnumber": 839,
			"text": "Telah mengabarkan kepada kami ['Ubaidullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Abdurrahman bin 'Ammar] dia berkata; telah menceritakan kepadaku [Al Qasim bin Muhammad] dari ['Aisyah] dari Nabi Shallallahu'alihiwasallam beliau bersabda: \"Shalat berjamaah (pahalanya) melebihi atas shalat sendirian sebanyak dua puluh lima derajat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 840,
			"arabicnumber": 840,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Abu Nadhrah] dari [Abu Sa'id] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bila mereka bertiga, maka salah seorang dari mereka menjadi imam bagi yang lain, dan yang paling berhak menjadi imam adalah yang paling banyak hapalannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 841,
			"arabicnumber": 841,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ib Radliyallahu'anha im] dia berkata; telah menceritakan kepada kami [Hajjaj] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Ziyad] bahwasanya [Qaza'ah] -seorang budak Abdul Qais- mengabarkan kepadanya bahwasanya ia mendengar ['Ikrimah] berkata; [Ibnu 'Abbas] berkata; \"Aku pernah shalat di samping Rasulullah Shallallahu'alihiwasallam. Aisyah juga shalat bersama kami di belakang, sedangkan aku di samping Rasulullah Shallallahu'alaihi wasallam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 842,
			"arabicnumber": 842,
			"text": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah menceritakan kepada kami [Abdullah] dari [Abdul Malik bin Abu Sulaiman] dari ['Atha] dari [Ibnu 'Abbas] dia berkata; \"Aku shalat bersama Rasulullah Shallallahu'alihiwasallam dan aku berdiri di sebelah kiri beliau. Tetapi beliau memegangku dengan tangan kirinya dan memposisikan diriku di sebelah kanannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 843,
			"arabicnumber": 843,
			"text": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid bin Al Harits] dari [Syu'bah] dari [Abu Ishaq] bahwasanya ia mengabarkan kepada mereka, dari [Abdullah bin Abu Bashir] dari [bapaknya], [Syu'bah] berkata; dan berkata [Abu Ishaq] dan aku telah mendengarnya darinya dari [Bapaknya], dia berkata; aku mendengar [Ubay bin Ka'b] berkata; \"Suatu hari Rasulullah Shallallahu'alaihi wasallam mengerjakan shalat Subuh, lantas beliau bersabda, Apakah kamu melihat Fulan ikut shalat berjamaah? ' Para sahabat menjawab, 'Tidak'. Rasulullah Shallallahu'alaihi wasallam bertanya lagi, ' Apakah si Fulan (orang lain lagi) ikut shalat berjamaah? ' Sahabat menjawab, Tidak, Beliau Shallallahu'alaihi wasallam lalu bersabda: 'Dua shalat ini sangat berat bagi orang munafiq. Andaikan mereka mengetahui (pahala) nya, mereka pasti mendatanginya, walau dengan merangkak. Barisan pertama laksana barisan para malaikat, seandainya mereka mengetahui keutamaannya mereka pasti bersegera menuju barisan pertama. Shalatnya seseorang bersama orang lain lebih utama baginya daripada shalat sendirian, dan shalat seseorang bersama dua orang lebih utama daripada shalat bersama satu orang. Kalau mereka bertambah banyak. Allah Azza wa Jalla lebih mencintainya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 844,
			"arabicnumber": 844,
			"text": "Telah mengabarkan kepada kami [Nashr bin 'Ali] dia berkata; telah memberitakan kepada kami [Abdul A'la] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Mahmud] dari ['Itban bin Malik] bahwasanya dia berkata; \"Wahai Rasulullah Shallallahu'alihiwasallam banjir, menghalangi kami dengan masjid kaumku. Maka aku senang jika engkau shalat di suatu tempat di rumahku yang aku jadikan masjid.\" Rasulullah Shallallahu'alaihi wasallam menjawab, \"Akan aku lakukan.\" Setelah Rasulullah Shallallahu'alaihi wasallam masuk ke rumahnya, beliau bertanya, \"Di sebelah mana kamu ingin aku shalat?\" Lalu dia ditunjukkan ke arah pojok rumah. Kemudian Rasulullah Shallallahu'alaihi wasallam berdiri dan mereka berbaris di belakang beliau, lalu beliau Shallallahu'alaihi wasallam shalat bersama kami dua rakaat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 845,
			"arabicnumber": 845,
			"text": "Telah memberitakan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Isma'il] dari [Humaid] dari [Anas] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam menghadap kepada kami dengan wajahnya ketika berdiri sebelum beliau Shallallahu'alaihi wasallam bertakbir, lalu beliau bersabda: \"Luruskan barisan kalian dan rapatkanlah. Karena aku melihat kalian dari balik punggungku",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 846,
			"arabicnumber": 846,
			"text": "Telah mengabarkan kepada kami [Hannad bin As Sari] dia berkata; telah menceritakan kepada kami [Abu Zubaid 'Abtsar bin Al Qasim] dari [Hushain] dari [Abdullah bin Abu Qatadah] dari [Bapaknya], dia berkata; \"Kami bersama Rasulullah Shallallahu'alaihi wasallam lalu ada sebagian orang yang berkata, 'Wahai Rasulullah Shallallahu'alihiwasallam seandainya engkau shalat bersama kami pada akhir malam (pasti itu lebih baik) '. Kemudian beliau bersabda, 'Aku khawatir kalian tertidur sehingga tidak shalat'. Bilal berkata, 'Aku akan menjaga kalian\". Lalu mereka berbaring dan terlelap dalam tidurnya. Sedang Bilal menyandarkan punggungnya ke untanya. Rasulullah Shallallahu'alaihi wasallam terbangun ketika matahari sudah terbit, maka beliau bersabda, 'Wahai Bilal. mana yang kamu katakan? ' la menjawab,; Aku belum pernah tertidur selelap ini'. Rasulullah Shallallahu'alaihi wasallam bersabda, \"Allah Azza wa Jalla menggenggam nyawa kalian ketika menghendaki dan mengembalikannya lagi ketika Dia menghendakinya. Hai Bilal, adzanlah untuk shalat'. Lalu Bilal bangkit (dan mengumandangkan adzan, lantas orang-orang segera berwudhu - yakni saat matahari sudah mulai tinggi- kemudian beliau Shallallahu'alaihi wasallam shalat bersama mereka)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 847,
			"arabicnumber": 847,
			"text": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami [Abdullah bin Al Mubarak] dari [Zaidah bin Qudamah] dia berkata; telah menceritakan kepada kami [As-Saib bin Hubaisy Al Kala'i] dari [Ma'dan bin Abu Thalhah Al Ya'muri] dia berkata; [Abu Ad Darda] bertanya kepadaku 'Di mana rumahmu? ' Aku menjawab, 'Di Desa Duwain Himsha\". Lalu ia berkata, 'Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda, \"Tiga orang yang tinggal di suatu desa atau pegunungan tanpa menegakkan shalat berjamaah, pasti setan menguasai mereka. Hendaklah kalian melaksanakan shalat jamaah, karena serigala memangsa kambing yang sendirian.\" As Saib (perawi) berkata, \"Yang dimaksud dengan jamaah di sini adalah jamaah shalat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 848,
			"arabicnumber": 848,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, \"Demi Dzat yang jiwaku berada di tangan-Nya, aku ingin sekali memerintahkan untuk mengumpulkan kayu bakar, lalu aku perintahkan untuk shalat dengan dikumandangkan adzan, lantas aku juga menyuruh seseorang untuk menjadi imam shalat orang-orang. Sedangkan aku akan mendatangi orang-orang (yang tidak ikut berjamaah) dan membakar rumah mereka. Demi Dzat yang jiwaku ada di tangan-Nya, kalau saja salah seorang dari mereka mengetahui bahwa dia akan mendapatkan daging gemuk atau dua potong daging bagian punggung yang bagus, ia pasti mendatangi shalat Isya berjamaah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 849,
			"arabicnumber": 849,
			"text": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami [Abdullah bin Al Mubarak] dari [Al Mas'udi] dari ['Ali bin Al Aqmar] dari [Abul Ahwash] dari [Abdullah] bahwasanya ia pernah berkata; \"Barangsiapa ingin berjumpa dengan Allah Azza wa Jalla dalam keadaan muslim, jagalah shalat lima waktu tatkala diseru untuk mengerjakannya. Allah Azza wa Jalla telah mensyariatkan jalan-jalan petunjuk kepada Nabi Shallallahu'alaihi wasallam. Dan shalat lima waktu termasuk jalan petunjuk itu. Aku tidak menaksir salah seorang dari kalian kecuali pasti memiliki masjid dalam rumahnya yang digunakan untuk shalat. Ingat, andaikan engkau shalat di rumah kalian dan meninggalkan masjid kalian, berarti kalian meninggalkan sunnah Nabi kalian. Seandainya kalian meninggalkan Sunnah nabi kalian, kalian pasti tersesat. Tidak ada orang muslim yang berwudhu' dan memperbaiki wudhunya kemudian pergi ke masjid, kecuali Allah Azza wa Jalla menuliskan satu kebaikan bagi setiap langkahnya atau mengangkatnya satu derajat, atau menghapus satu kesalahan darinya dengan langkah tersebut. Aku menyaksikan diri kami merapatkan langkahnya dan Aku bersaksi bahwa tidak ada yang ketinggalan dari shalat berjamaah kecuali orang munafik yang sudah populer kemunafikannya. Aku juga menyaksikan seorang laki-laki yang dipapah oleh dua orang hingga ia berdiri di shaf (barisan) shalat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 850,
			"arabicnumber": 850,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Marwan bin Mu'awiyah] dia berkata; telah menceritakan kepada kami ['Ubaidullah bin Abdullah bin Al Asham] dari pamannya [Yazid bin Al Asham] dari [Abu Hurairah] dia berkata; \"Seorang laki-laki buta datang kepada Rasulullah Shallallahu'alaihi wasallam lalu berkata, 'Aku tidak mempunyai penuntun untuk menuntunku ke masjid'. Kemudian ia meminta keringanan untuk shalat di rumahnya, dan beliau Shallallahu'alaihi wasallam mengizinkannya. Namun setelah dia pergi Rasulullah Shallallahu'alaihi wasallam segera memanggilnya dan bertanya, \"Apakah engkau mendengar panggilan shalat? ' la menjawab, 'Kalau adzan sih mendengar'. Rasulullah Shallallahu'alaihi wasallam lalu bersabda; 'Kamu wajib mendatanginya (shalat berjamaah)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 851,
			"arabicnumber": 851,
			"text": "Telah mengabarkan kepada kami [Harun bin Zaid bin Abu Az Zarqa] dia berkata; [Bapakku] telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami [Sufyan] dan telah mengabarkan kepadaku [Abdullah bin Muhammad bin Ishaq] dia berkata; telah menceritakan kepada kami [Qasim bin Yazid] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Abdurrahman bin 'Abis] dari [Abdurrahman bin Abu Laila] dari [Ibnu Ummi Maktum] bahwasanya dia berkata; \"Wahai Rasulullah Shallallahu'alihiwasallam di Madinah banyak hewan melata dan hewan buas.\" Rasulullah Shallallahu'alaihi wasallam menjawab, \"Apakah kamu mendengar seruan, 'Hayya 'alash-shalah, hayya 'alal falah? '\" la menjawab, \"Ya.\" Kemudian Rasulullah Shallallahu'alaihi wasallam bersabda, \"Maka marilah menyambutnya.\" Beliau Shallallahu'alaihi wasallam tidak memberi keringanan kepadanya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 852,
			"arabicnumber": 852,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Hisyam bin 'Urwah] dari [Bapaknya], bahwasanya [Abdullah bin Arqam] pernah menjadi Imam shalat bagi para sahabatnya, suatu hari ketika tiba waktu shalat, dia pergi untuk buang air besar, lalu kembali untuk mengimami. Dia berkata; \"Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \" Apabila kalian hendak buang air besar, ketika -tiba waktu shalat-, maka hendaklah ia mendahulukannya sebelum melaksanakan shalat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 853,
			"arabicnumber": 853,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Anas] dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika makan malam telah disediakan, sedangkan iqamah shalat telah dilakukan, maka santaplah terlebih dahulu",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 854,
			"arabicnumber": 854,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abul Malih] dari [bapaknya], dia berkata; \"Kami pernah bersama Rasulullah Shallallahu'alaihi wasallam pada perang Hunain, lalu kami diguyur hujan, maka Muadzin Rasulullah Shallallahu'alaihi wasallam menyeru, SHALLUU FII RIHAALIKUM 'Shalatlah kalian di tempat (kendaraan) masing-masing kalian",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 855,
			"arabicnumber": 855,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Abdul 'Aziz bin Muhammad] dari [Ibnu Thalha'] dari [Muhshin bin 'Ali Al Fihri] dari ['Auf bin Al Harits] dari [Abu Hurairah] dari Rasulullah Shallallahu'alaihi wasallam beliau bersabda: \"Barang siapa berwudhu dan memperbaiki wudhunya kemudian keluar dengan sengaja menuju masjid, lalu mendapati orang-orang sudah mengerjakan shalat, Allah menuliskan pahala baginya seperti pahala orang yang menghadirinya, dan hal itu tidak mengurangi pahala mereka sedikitpun",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 856,
			"arabicnumber": 856,
			"text": "Telah mengabarkan kepada kami [Sulaiman bin Dawud] dari [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku ['Amr bin Al Harits] bahwasanya [Al Hukaim bin Abdullah Al Quraisyi] menceritakan kepadanya bahwasanya [Nafi' bin Jubair] dan [Abdullah bin Abu Salamah] menceritakan kepadanya bahwasanya [Mu'adz bin 'Abdurrahman] menceritakan kepadanya dari [Humran] -budak 'Utsman bin 'Affan- dari ['Utsman bin 'Affan] dia berkata, \"Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa berwudhu untuk shalat dan menyempurnakan wudhunya, kemudian ia berangkat untuk shalat wajib dan ia mengerjakannya bersama orang-orang atau bersama jamaah, atau shalat di masjid, Allah mengampuni dosa-dosanya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 857,
			"arabicnumber": 857,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Zaid bin Aslam] dari seorang lelaki dari Bani Ad Dil yang dipanggil [Busr bin Mihjan] dari [Mihjan] bahwasanya ia pernah berada dalam suatu majelis bersama Rasulullah Shallallahu'alihiwasallam lalu dikumandangkan adzan untuk shalat, maka Rasulullah Shallallahu'alaihi wasallam segera bangkit kemudian kembali, sedangkan Mihjan masih di majelisnya. Rasulullah Shallallahu'alaihi wasallam lalu berkata kepadanya: \"Apakah yang menghalangimu untuk shalat? Bukankah kamu seorang muslim?\" la menjawab, \"Tentu, tetapi aku sudah shalat bersama keluargaku.\" Kemudian Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bila kamu datang (ke masjid) maka shalatlah bersama orang-orang, walaupun kamu telah menunaikannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 858,
			"arabicnumber": 858,
			"text": "Telah mengabarkan kepada kami [Ziyad bin Ayyub] dia berkata; telah menceritakan kepada kami [Husyaim] dia berkata; telah menceritakan kepada kami [Ya'la bin 'Atha] dia berkata; telah menceritakan kepada kami [Jabir bin Yazid bin Al Aswad Al 'Amiri] dari [bapaknya], dia berkata; \"Aku ikut shalat Subuh berjamaah di masjid Al Khaif bersama Rasulullah Shallallahu'alihiwasallam dan setelah selesai shalat tiba-tiba ada dua orang di barisan paling belakang tidak ikut shalat bersama beliau Shallallahu'alihiwasallam. Rasulullah Shallallahu'alaihi wasallam lalu bersabda: \"Bawa dua orang tersebut kepadaku\". Kedua orang tersebut kemudian segera dibawa kepada beliau dalam keadaan gemetar sendi-sendinya, lantas beliau bersabda: \"Apakah yang menghalangi kalian berdua untuk shalat bersama kami? ' Keduanya menjawab, 'Wahai Rasulullah Shallallahu'alihiwasallam kami telah shalat di rumah kami'. Rasulullah Shallallahu'alaihi wasallam berkata: \"Jangan kamu lakukan hal itu (meninggalkan shalat berjamaah). Jika kalian berdua telah shalat di rumah kalian, kemudian kalian datang ke masjid yang sedang shalat berjamaah, maka shalatlah bersama mereka, karena bagi kalian hal itu adalah Sunnah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 859,
			"arabicnumber": 859,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dan [Muhammad bin Ibrahim bin Shudran] -dan lafadz ini baginya- dari [Khalid bin Al Harits] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Budail] dia berkata; aku mendengar [Abul 'Aliyah] menceritakan dari [Abdullah bin Ash Shamit] dari [Abu Dzarr] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam pernah bersabda kepadaku - sambil menepuk pahaku -: \"Bagaimana jika engkau tinggal pada suatu kaum yang terbiasa mengakhirkan shalat dari waktunya? ' la berkata, 'Apa yang engkau perintahkan? ' Beliau Shallallahu'alaihi wasallam bersabda, 'Shalatlah pada waktunya kemudian pergilah untuk mengurusi urusanmu. Jika ditegakkan shalat dan kamu di dalam masjid, maka ikut shalatlah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 860,
			"arabicnumber": 860,
			"text": "Telah mengabarkan kepada kami [Ibrahim bin Muhammad At Taimi] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Husain Al Mu'allim] dari ['Amr bin Syu'aib] dari [Sulaiman] -budak Maimunah- dia berkata; \"Aku melihat [Ibnu 'Umar] duduk di lantai, padahal orang-orang sedang mengerjakan shalat. Aku lalu bertanya kepadanya, 'Wahai Abu Abdur Rahman, kenapa kamu tidak shalat? ' la menjawab, 'Aku sudah shalat dan aku pernah mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jangan mengulangi shalat dua kali dalam satu hari",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 861,
			"arabicnumber": 861,
			"text": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin 'Abdurrahman Az Zuhri] dia berkata; telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika kalian mendatangi shalat, jangan dengan lari tergesa-gesa. Datangilah dengan berjalan dan tenang. Apa yang kalian dapati, shalatlah, dan yang ketinggalan maka sempurnakanlah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 862,
			"arabicnumber": 862,
			"text": "Telah mengabarkan kepada kami ['Amr bin Sawwad bin Al Aswad bin 'Amr] dia berkata; Telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah memberitakan kepada kami [Ibnu Juraij] dari [Manbudz] dari [Al Fadhl bin 'Ubaidullah] dari [Abu Rafi'] dia berkata; \"Dahulu jika Rasulullah Shallallahu'alaihi wasallam telah shalat Ashar maka beliau pergi ke Bani Abdul Asyhal, lalu bercakap-cakap hingga hampir Maghrib.\" Abu Rafi' berkata; \"Tatkala Nabi Shallallahu'alaihi wasallam terburu-buru mendatangi shalat Maghrib, kami melewati kuburan Baqi', maka Rasulullah Shallallahu'alaihi wasallam bersabda: Celaka kamu, celaka kamu (Beliau maksudkan untuk penghuni kubur). Ucapan nabi shallallahu 'alaihi wasallam itu menjadikanku khawatir, maka aku menghentikan jalanku, karena aku mengira beliau tujukan ucapannya kepadaku. Lantas beliau bersabda: 'Ada apa dengan kamu? Berjalanlah'. Aku berkata, 'Anda baru saja berbicara sesuatu'. Beliau berkata, 'Apa itu? Aku menjawab, 'Anda mengatakan kepadaku celaka kamu celaka kamu'. Beliau menimpalinya, 'Tidak, Ucapan itu bukan kumaksudkan untukmu, tetapi aku pernah mengutus penghuni kuburan ini kepada Bani Fulan untuk menarik zakat, namun ia berkhianat dengan mencuri kain wool, maka ia sekarang sedang dipakaikan pakaian sejenisnya dari api neraka.\" Telah mengabarkan kepada kami [Harun bin Abdullah] ia berkata, telah menceritakan kepada kami [Mu'awiyah bin 'Amru] ia berkata, telah menceritakan kepada kami [Abu Ishaq] dari [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Manbudz] -ia dari keluarga Abu Rafi'- dari [Al Fadhl bin 'Ubaidillah bin Abu Rafi'] dari [Abu Rafi'] dengan hadits yang senada",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 863,
			"arabicnumber": 863,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 864,
			"arabicnumber": 864,
			"text": "Telah mengabarkan kepada kami [Ahmad bin Muhammad bin Al Mughirah] dia berkata; telah menceritakan kepada kami ['Utsman] dari [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Abu Salamah bin 'Abdurrahman] dan [Abu Abdullah Al Agharr] bahwasanya [Abu Hurairah] menceritakan kepada keduanya bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Perumpamaan orang yang bersegera ke masjid seperti orang yang berkurban seekor unta, kemudian yang datang selanjutnya seperti orang yang berkurban sapi, orang lain yang datang setelahnya seperti orang yang berkurban kambing, dan yang datang selanjutnya seperti orang yang berkurban ayam, kemudian yang datang setelahnya seperti orang yang berkurban telur",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 865,
			"arabicnumber": 865,
			"text": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami [Abdullah bin Al Mubarak] dari [Zakaria] dia berkata; telah menceritakan kepadaku ['Amr bin Dinar] dia berkata; Aku mendengar ['Atha bin Yasar] menceritakan dari [Abu Hurairah] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bila iqamah telah dikumandangkan, tidak ada shalat kecuali shalat wajib",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 866,
			"arabicnumber": 866,
			"text": "Telah mengabarkan kepada kami [Ahmad bin Abdullah bin Al Hakim] dan [Muhammad bin Basysyar] mereka berkata, telah menceritakan kepada kami [Muhammad] dari [Syu'bah] dari [Warqa' bin 'Umar] dari ['Amr bin Dinar] dari ['Atha bin Yasar] dari [Abu Hurairah] dari Nabi Shallallahu'alihiwasallam beliau Shallallahu'alaihi wasallam bersabda: \"Bila iqamah telah dikumandangkan, tidak ada shalat kecuali shalat wajib",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 867,
			"arabicnumber": 867,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Sa'ad bin Ibrahim] dari [Hafsh bin 'Ashim] dari [Ibnu Buhainah] dia berkata; \"Ketika shalat Subuh dan iqamah sudah dikumandangkan, Rasulullah Shallallahu'alaihi wasallam melihat seorang laki-laki sedang shalat, padahal muadzin sedang iqamah, maka beliau Shallallahu'alaihi wasallam menegurnya; 'Apakah kamu shalat subuh empat rakaat?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 868,
			"arabicnumber": 868,
			"text": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabi] dia berkata; telah menceritakan kepada kami [Hammad] dia berkata; telah menceritakan kepada kami ['Ashim] dari [Abdullah bin Sarjis] dia berkata; \"Seorang laki-laki datang, dan Rasulullah Shallallahu'alaihi wasallam saat itu sedang shalat Subuh. Lalu orang tersebut shalat dua rakaat. kemudian mengikuti shalat beliau. Setelah Rasulullah Shallallahu'alaihi wasallam selesai shalat, beliau Shallallahu'alaihi wasallam bersabda: 'Wahai Fulan, yang manakah shalat subuhmu? Shalat bersama kami (shalat Subuh berjamaah) atau shalat untuk dirimu sendiri (shalat sunnah)?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 869,
			"arabicnumber": 869,
			"text": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin 'Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepadaku [Ishaq bin Abdullah] dia berkata; Aku mendengar [Anas] Radliyallahu'anhu berkata; \"Rasulullah Shallallahu'alaihi wasallam datang ke rumah kami, lalu aku shalat bersama anak yatim di belakang beliau. Sementara Ummu Sulaim shalat di belakang kami",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 870,
			"arabicnumber": 870,
			"text": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Nuh bin Qais] dari ['Amr bin Malik] dari [Abu Al Jauza'] dari [Ibnu 'Abbas] dia berkata; \"Ada seorang perempuan cantik menawan shalat di belakang Rasulullah Shallallahu'alaihi wasallam.\" Ibnu Abbas berkata lagi, \"Sebagian orang ada yang maju ke barisan terdepan agar tidak melihatnya, namun sebagian lagi justru ada yang berdiri di barisan terakhir, agar ketika ruku' ia bisa melihatnya dari balik ketiaknya. Kemudian Allah Azza wa Jalla menurunkan ayat, 'Dan sesungguhnya Kami telah mengetahui orang-orang yang meminta di barisan depan dan sesungguhnya Kami mengetahui pula orang-orang yang meminta di barisan belakang (Qs. Al Hijr (15): 24",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 871,
			"arabicnumber": 871,
			"text": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Sa'id] dari [Ziyad Al A'lam] dia berkata; telah menceritakan kepada kami [Al Hasan] bahwasanya [Abu Bakar] menceritakan kepadanya, bahwa ia pernah masuk ke dalam masjid sedangkan Nabi Shallallahu'alaihi wasallam sedang ruku', maka ia ikut ruku' sebelum sampai ke barisan shalat. Lalu Rasulullah Shallallahu'alaihi wasallam bersabda: \"Semoga Allah menambah semangatmu, namun jangan kamu ulangi lagi",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 872,
			"arabicnumber": 872,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepadaku [Abu Usamah] dia berkata; telah menceritakan kepadaku [Al Walid bin Katsir] dari [Sa'id bin Abu Sa'id] dari [bapaknya] dari [Abu Hurairah] dia berkata; \"Suatu hari Rasulullah Shallallahu'alaihi wasallam mengerjakan shalat, dan setelah selesai beliau Shallallahu'alaihi wasallam bersabda: 'Wahai Fulan, kenapa engkau tidak membaguskan shalatmu? Kenapa orang yang shalat itu tidak mau intropeksi bagaimana ia mengerjakan shalat untuk dirinya? Sesungguhnya aku mampu melihat dari belakangku seperti aku melihat melalui depanku",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 873,
			"arabicnumber": 873,
			"text": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Nafi'] dari [Ibnu 'Umar] bahwa Rasulullah Shallallahu'alaihi wasallam shalat dua rakaat sebelum Zhuhur, dan dua rakaat setelahnya. Beliau Shallallahu'alaihi wasallam juga shalat dua rakaat setelah Maghrib di rumahnya dan shalat dua rakaat setelah Isya. Beliau Shallallahu'alaihi wasallam tidak shalat setelah shalat Jum'at hingga pulang, kemudian beliau Shallallahu'alaihi wasallam mengerjakan shalat dua rakaat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 874,
			"arabicnumber": 874,
			"text": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; Telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari ['Ashim bin Dhamrah] dia berkata; \"Kami bertanya kepada Ali tentang shalatnya Rasulullah Shallallahu'alaihi wasallam lalu [Ali] berkata; 'Siapakah di antara kalian yang mampu mengerjakannya? ' Kami menjawab; 'Jika kami tidak mampu, maka kami telah mendengarnya'. ia pun berkata; 'Bila matahari ada di sini seperti keadaannya saat di sini - yakni saat waktu Ashar- maka beliau Shallallahu'alaihi wasallam mengerjakan shalat dua rakaat. Bila matahari ada di sini seperti keadaannya saat di sini -yakni saat waktu Zhuhur- maka beliau Shallallahu'alaihi wasallam shalat empat rakaat, dan shalat dua rakaat setelahnya. Beliau juga shalat empat rakaat sebelum Ashar dengan memisahkan tiap dua rakaat dengan salam. Salam tersebut ditujukan untuk para malaikat yang dekat (dengan Allah), para nabi, serta orang-orang yang mengikuti mereka dari kaum Mukminin dan Muslimin",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 875,
			"arabicnumber": 875,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Muhammad bin 'Abdurrahman] dia berkata; telah menceritakan kepada kami [Hushain bin 'Abdurrahman] dari [Abu Ishaq] dari ['Ashim bin Dhamrah] dia berkata; \"Aku bertanya kepada [Ali bin Abu Thalib] tentang shalat Nabi Shallallahu'alaihi wasallam pada siang hari sebelum mengerjakan shalat wajib dan ia menjawab, 'Siapa yang mampu mengerjakannya? ' Kemudian ia berkata, 'Rasulullah Shallallahu'alaihi wasallam mengerjakan shalat dua rakaat ketika matahari telah naik dan shalat empat rakaat sebelum matahari sampai ke pertengahan siang, dan beliau mengucapkan salam diakhir shalat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 99
			}
		}
	]
}