{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"29": "The Book of Endowments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3594,
			"arabicnumber": 3594,
			"text": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari ['Amru bin Al Harits] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak meninggalkan dinar dan dirham, sahaya laki-laki dan perempuan kecuali bighalnya yang berwarna abu-abu biasa beliau kendarai, senjata dan tanah yang beliau berikan di jalan Allah.\" Dalam kesempatan lain Qutaibah menyebutkan, \"Sebagai sedekah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3595,
			"arabicnumber": 3595,
			"text": "Telah mengabarkan kepada kami ['Amru bin Ali] berkata; telah menceritakan kepada kami [Yahya bin Sa'id] berkata; telah menceritakan kepada kami [Sufyan] telah menceritakan kepadaku [Abu Ishaq] berkata; aku mendengar ['Amru bin Al Harits] berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak meninggalkan kecuali bighalnya yang putih, senjata dan tanah yang beliau tinggalkan sebagai sedekah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3596,
			"arabicnumber": 3596,
			"text": "Telah mengabarkan kepada kami ['Amru bin Ali] berkata; telah menceritakan kepada kami [Abu Bakr Al Hanafi] berkata; telah menceritakan kepada kami [Yunus bin Abu Ishaq] dari [ayahnya] ia berkata; aku mendengar ['Amru bin Al Harits] berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam tidak meninggalkan sesuatu kecuali bighalnya yang berwarna abu-abu, pedang dan tanah yang beliau tinggalkan sebagai sedekah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3597,
			"arabicnumber": 3597,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] ia berkata; telah memberitakan kepada kami [Abu Daud Al Hafari Umar bin Sa'd] dari [Sufyan Atsauri] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] dari [Umar] ia berkata, \"Aku mendapatkan lahan dari lahan Khaibar, kemudian aku mendatangi Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Aku mendapatkan lahan dan tidak ada lahan yang paling aku sukai kecuali lahan tersebut.\" Beliau bersabda: \"Apabila engkau menghendaki maka engkau bisa mensedekahkannya.\" Kemudian ia mensedekahkannya dengan syarat tidak dijual dan tidak dihibahkan untuk orang-orang fakir, kerabat rasul, tamu, dan ibnu sabil. Dan tidak mengapa bagi orang yang mengurusnya untuk memakan dengan cara yang baik tanpa mengembangkan harta dan memberikan makan orang lain.\" Telah mengabarkan kepadaku [Harun bin Abdullah] berkata; telah menceritakan kepada kami [Mu'awiyah bin 'Amru] dari [Abu Ishaq Al Fazari] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam seperti itu",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3598,
			"arabicnumber": 3598,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3599,
			"arabicnumber": 3599,
			"text": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] berkata; telah menceritakan kepada kami [Yazid] -yaitu Ibnu Zurai'- berkata; telah menceritakan kepada kami [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] berkata; Umar telah mendapatkan lahan di Khaibar, kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam dan berkata, \"Aku telah mendapatkan lahan yang tidak ada harta sama sekali yang aku dapatkan yang lebih berharga bagi aku daripada lahan tersebut, maka apa yang anda perintahkan? Beliau bersabda: \"Apabila engkau menghendaki maka engkau dapat menahan pokoknya dan bersedekah dengannya.\" Maka ia pun bersedekah dengan syarat tidak dijual, tidak dihibahkan, tidak diwariskan untuk orang-orang fakir, kerabat rasul, hamba sahaya, di jalan Allah, tamu, dan ibnu sabil. Tidak mengapa bagi orang yang mengurusnya untuk makan darinya dengan cara yang baik, memberi makan teman tanpa mengembangkannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3600,
			"arabicnumber": 3600,
			"text": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] ia berkata; telah menceritakan kepada kami [Bisyr] dari [Ibnu 'Aun]. Dan telah memberitakan kepada kami [Humaid bin Mas'adah] berkata; telah menceritakan kepada kami [Bisyr] berkata; telah menceritakan kepada kami [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Umar mendapatkan lahan di Khaibar kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam dan meminta pendapatnya mengenai lahan tersebut. Ia berkata, \"Sesungguhnya aku telah mendapatkan lahan yang banyak, aku belum pernah mendapatkan harta sama sekali yang lebih berharga bagiku daripada lahan tersebut. Apakah yang anda perintahkan mengenai lahan tersebut? Beliau bersabda: \"Apabila engkau menghendaki maka engkau bisa menahan pokoknya, dan bersedekah dengannya dengan syarat tidak dijual dan tidak dihibahkan.\" Kemudian ia mensedekahkanya untuk orang-orang fakir, kerabat Nabi, hamba sahaya, di jalan Allah, ibnu Sabil, serta tamu. Dan tidak mengapa bagi orang yang mengurusnya untuk makan atau memberi makan teman tanpa mengembangkan.\" Lafazh hadits tersebut adalah lafazh Isma'il",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3601,
			"arabicnumber": 3601,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] berkata; telah menceritakan kepada kami [Azhar As Samman] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar], bahwa Umar mendapatkan lahan di Khaibar kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam meminta petunjuk mengenai lahan tersebut. Maka beliau bersabda: \"Apabila engkau menghendaki maka engkau bisa menahan pokoknya dan bersedekah dengannya.\" Kemudian ia menahan pokoknya dengan syarat tidak dijual, dan tidak dihibahkan serta tidak diwariskan. Dan ia bersedekah dengannya kepada orang-orang fakir, kerabat Nabi, para hamba sahaya, orang-orang miskin, ibnu sabil, dan tamu. Dan tidak mengapa bagi orang yang mengurusnya untuk makan sebagian darinya dengan cara yang baik atau memberi makan temannya tanpa mengembangkannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3602,
			"arabicnumber": 3602,
			"text": "Telah mengabarkan kepada kami [Abu Bakr bin Nafi'] berkata; telah menceritakan kepada kami [Bahz] berkata; telah menceritakan kepada kami [Hammad] berkata; telah menceritakan kepada kami [Tsabit] dari [Anas] berkata, \"Tatkala turun ayat ini: '(Kamu sekali-kali tidak sampai kepada kebajikan (yang sempurna), sebelum kamu menafkahkan sebagian harta yang kamu cintai) ' (Qs. Ali Imran: 92), maka Abu Thalhah berkata, \"Sungguh, tuhan kita akan bertanya kepada kita mengenai harta-harta kita. Maka aku meminta persaksianmu wahai Rasulullah, bahwa aku telah menjadikan lahanku untuk Allah.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jadikanlah lahan tersebut untuk para kerabatmu, yaitu Hasan bin Tsabit dan Ubay bin Ka'b",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3603,
			"arabicnumber": 3603,
			"text": "Telah mengabarkan kepada kami [Sa'id bin 'Abdurrahman] berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] berkata, \"Umar berkata kepada Nabi shallallahu 'alaihi wasallam, 'Sungguh, aku belum pernah mendapatkan harta yang lebih aku cintai dari seratus saham yang aku dapat di Khaibar. Dan aku berkeinginan untuk bersedekah dengannya.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Tahanlah pokoknya dan jadikan buahnya di jalan Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3604,
			"arabicnumber": 3604,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Abdullah Al Khalanji] di Baitul Maqdis, ia berkata; telah menceritakan kepada kami [Sufyan] dari ['Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] dari [Umar] radliallahu 'anhu, ia berkata, \"Umar datang kepada Rasulullah shallallahu 'alaihi wasallam kemudian berkata, \"Wahai Rasulullah, sungguh aku mendapatkan harta yang belum pernah aku dapatkan yang semisalnya. Aku memiliki seratus budak, kemudian aku membeli dengannya seratus saham Khaibar dari pemiliknya, dan aku ingin mendekatkan diri dengannya kepada Allah 'azza wajalla.\" Maka beliau bersabda: \"Tahan pokoknya dan jadikan buahnya di jalan Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3605,
			"arabicnumber": 3605,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Mushaffa bin Bahlul] berkata; telah menceritakan kepada kami [Baqiyyah] dari [Sa'id bin Salim Al Makki] dari ['Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] dari [Umar] berkata, \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai lahanku di Tsamgh, beliau bersabda: \"Tahanlah pokoknya dan jadikan buahnya di jalan Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3606,
			"arabicnumber": 3606,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] berkata; telah memberitakan kepada kami [Al Mu'tamir bin Sulaiman] berkata; aku mendengar [ayahku] menceritakan dari [Hushain bin 'Abdurrahman] dari [Umar bin Jawan] seorang laki-laki dari Bani Tamim, aku berkata kepadanya, \"Bagaimana pendapatmu mengenai sebab [Al Ahnaf] menyingkir dari apa yang telah terjadi?\" Ia menjawab, \"Aku mendengar Al Ahnaf berkata, 'Aku datang ke Madinah dan aku sedang melakukan haji, ketika kami berada di rumah kami dan menambatkan kendaraan kami, tiba-tiba datang seseorang kepada kami seraya berkata, 'Sesungguhnya orang-orang telah berkumpul di Masjid! ' Kemudian aku lihat ternyata orang-orang sedang berkumpul, dan ternyata di antara orang-orang yang duduk itu ada [Ali bin Abu Thalib], [Az Zubair], [Thalhah] dan [Sa'd bin Abu Waqqash], semoga rahmat Allah terlimpahkan kepada mereka. Saat aku berdiri menuju mereka, maka dikatakan, 'Ini [Utsman bin Affan] telah tiba'.\" Al Ahnaf berkata, \"Ia datang memakai baju kurung kuning. Kemudian aku katakan kepada sahabatku, 'Tetaplah di tempatmu hingga aku melihat apa yang ia bawa.' Kemudian Utsman berkata, \"Apakah di sini ada Ali? Apakah di sini ada Az Zubair? Apakah di sini ada Thalhah? Apakah di sini ada Sa'd?\" Mereka menjawab, 'Ya.\" Utsman lalu berkata, \"Sungguh, aku bertanya kepada kalian dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa membeli tempat penambatan unta milik Bani Fulan, maka Allah akan mengampuninya.\" Maka aku membelinya kemudian datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata kepadanya, \"Sesungguhnya aku telah membeli tempat penambatan unta milik Bani Fulan. Lalu beliau bersabda: \"Jadikanlah berada di masjid kita, dan pahalanya untukmu.\" Mereka mengatakan, \"Ya.\" Utsman berkata, \"Aku bertanya dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa membeli sumur Rumah, maka Allah akan mengampuninya.\" Kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan mengatakan, \"Aku telah membelinya.\" Lalu beliau bersabda: \"Jadikanlah untuk memberi minum orang-orang muslim dan pahalanya untukmu.\" Mereka mengatakan, \"Ya.\" Utsman berkata lagi, \"Aku bertanya dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa mempersiapkan pasukan Al 'Usrah maka Allah akan mengampuninya.\" Maka aku mempersiapkan mereka hingga mereka tidak kehilangan satu tali unta dan satu tali kendali pun.\" Maka mereka menjawab, \"Ya.\" Utsman lalu berkata, \"Ya Allah, saksikanlah. Ya Allah saksikanlah. Ya Allah saksikanlah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3607,
			"arabicnumber": 3607,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] berkata; telah memberitakan kepada kami [Abdullah bin Idris] berkata; aku pernah mendengar [Hushain bin 'Abdurrahman] menceritakan dari [Umar bin Jawan] dari [Al Ahnaf bin Qais] berkata, \"Kami pernah keluar untuk melakukan haji, lalu kami datang ke Madinah dan kami ingin melakukan haji. Ketika kami berada di rumah kami dan menambatkan kendaraan kami, tiba-tiba datang seseorang kepada kami seraya berkata, \"Sesungguhnya orang-orang telah berkumpul di Masjid dan mereka merasa kaget.\" Maka kami berangkat ke masjid, ternyata orang-orang sedang berkumpul mengelilingi beberapa orang yang berada di tengah masjid, dan ternyata mereka adalah [Ali], [Az Zubair], [Thalhah] dan [Sa'd bin Abu Waqqash]. Sungguh, saat dalam kondisi seperti itu tiba-tiba [Utsman bin 'Affan] datang memakai baju kurung kuning, dan menutup kepalanya dengan baju tersebut, ia lalu berkata, \"Apakah di sini ada Ali? Apakah di sini ada Thalhah? Apakah di sini ada Az Zubair? Apakah di sini ada Sa'd?\" Mereka berkata, \"Ya.\" Utsman lalu berkata, \"Sungguh, aku bertanya kepada kalian dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa membeli tempat penambatan unta milik Bani Fulan, maka Allah akan mengampuninya.\" Maka aku membelinya dengan harga dua puluh ribu atau dua puluh lima ribu, kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan mengabarkan kepadanya. Lalu beliau bersabda: \"Jadikanlah berada di masjid kita, dan pahalanya untukmu.\" Mereka mengatakan, \"Ya.\" Utsman berkata lagi, \"Aku bertanya dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa membeli sumur Rumah, maka Allah akan mengampuninya.\" Maka aku membelinya dengan harga sekian dan sekian, kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan mengatakan, \"Aku telah membelinya dengan harga sekian dan sekian.\" Lalu beliau bersabda: \"Jadikanlah untuk memberi minum orang-orang muslim dan pahalanya untukmu.\" Mereka mengatakan, \"Ya.\" Utsman berkata lagi, \"Aku bertanya dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah melihat ke wajah beberapa orang lalu bersabda: \"Barangsiapa mempersiapkan mereka, maka Allah akan mengampuninya.\" -Yaitu pasukan Al 'Usrah- Maka aku mempersiapkan mereka hingga mereka tidak kehilangan satu tali unta dan satu tali kendalipun. Maka mereka berkata, \"Ya.\" Utsman lalu berkata, \"Ya Allah, saksikanlah. Ya Allah, saksikanlah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3608,
			"arabicnumber": 3608,
			"text": "Telah mengabarkan kepada kami [Ziyad bin Ayyub] berkata; telah menceritakan kepada kami [Sa'id bin 'Amir] dari [Yahya bin Abu Al Hajjaj] dari [Sa'id Al Jurairi] dari [Tsumamah bin Hazn Al Qusyairi] ia berkata, \"Aku sedang berada di dalam rumah saat [Utsman] menampakkan kemuliannya kepada para sahabat, ia berkata, \"Aku bertanya kepada kalian dan bersumpah dengan nama Allah dan Islam, apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam datang ke Madinah dan tidak ada padanya air segar selain sumur Rumah, kemudian beliau bersabda: \"Barangsiapa membeli sumur Rumah kemudian meletakkan padanya embernya bersama dengan ember orang-orang muslim dengan kebaikan darinya, maka ia akan berada dalam Surga.\" Lalu aku membelinya dari hartaku secara murni, kemudian aku meletakkan padanya emberku dari ember orang-orang Muslim, dan kalian melarangku minum darinya hingga aku minum dari air laut? Mereka mengatakan, \"Ya Allah, benar.\" Utsman berkata, \"Aku bertanya kepada kalian dan bersumpah dengan nama Allah dan Islam, apakah kalian mengetahui bahwa aku telah mempersiapkan pasukan Al 'Usrah dari hartaku? Mereka berkata, \"Ya Allah, benar.\" Utsman berkata lagi, \"Aku bertanya kepada kalian dan bersumpah dengan nama Allah dan Islam, apakah kalian mengetahui bahwa masjid telah sesak dengan penghuninya, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapakah yang membeli lahan keluarga Fulan kemudian menambahkannya di masjid lalu ia akan mendapatkan kebaikan di surga?\" Lalu aku membelinya dari hartaku secara murni, kemudian aku tambahkan di dalam masjid dan kalian melarangku untuk melakukan shalat dua rakaat di dalamnya?\" Mereka menjawab, \"Ya Allah, benar.\" Utsman berkata lagi, \"Aku bertanya kepada kalian dan bersumpah dengan nama Allah dan Islam, apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah berada di atas bukit Makkah bersama Abu Bakr, Umar dan aku. Kemudian gunung itu bergerak sehingga Rasulullah shallallahu 'alaihi wasallam menjejaknya kakinya seraya bersabda: \"Diamlah hai bukit! Sesungguhnya di atasmu terdapat seorang nabi, shiddiq, dan dua orang syahid.\" Mereka berkata, \"Ya Allah, benar.\" Utsman lalu berkata, \"Allahu akbar! Mereka telah bersaksi demi Tuhan Ka'bah, bahwa aku adalah orang yang syahid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3609,
			"arabicnumber": 3609,
			"text": "Telah mengabarkan kepada kami [Imran bin Bakkar bin Rasyid] berkata; telah menceritakan kepada kami [Khaththab bin Utsman] berkata; telah menceritakan kepada kami [Isa bin Yunus] berkata; telah menceritakan kepadaku [ayahku] dari [Abu Ishaq] dari [Abu Salamah bin 'Abdurrahman] bahwa [Utsman] menampakkan kemuliannya kepada mereka saat mereka mengepungnya, Ia katakan, \"Aku bersumpah dengan nama Allah atas seseorang yang telah mendengar dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau bersabda pada hari gunung, yaitu ketika gunung tersebut bergoncang kemudian beliau menjejak kakinya seraya bersabda: 'Diamlah! Sesungguhnya tidak ada yang berada di atasmu kecuali seorang nabi atau shiddiq atau dua orang syahid'. Dan aku bersama beliau? Lalu orang-orang memujinya. Kemudian Utsman berkata, \"Aku bersumpah dengan nama Allah dan bertanya kepada atas seseorang yang menyaksikan Rasulullah shallallahu 'alaihi wasallam pada saat bai'at Ridlwan, beliau bersabda: \"Ini adalah tangan Allah, dan ini tangan Utsman.\" Lalu orang-orang memujinya. Kemudian Utsman berkata, \"Aku bersumpah dengan nama Allah atas seseorang yang telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda pada hari (peristiwa) pasukan Al 'Usrah, beliau bersabda: 'Barangsiapa memberikan infak yang diterima? ' Maka aku mempersiapkan setengah pasukan dari hartaku.\" Lalu orang-orang memujinya. Kemudian Utsman berkata lagi, \"Aku bersumpah dengan nama Allah atas seseorang yang telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa menambahkan ke dalam masjid ini dengan sebuah rumah di Surga? ' Maka aku membelinya dari hartaku.\" Lalu orang-orang memujinya. Kemudian Utsman berkata lagi, \"Aku bersumpah dengan nama Allah atas seseorang yang telah menyaksikan sumur Rumah dijual, kemudian aku membelinya dari hartaku?\" Lalu orang-orang memujinya.\" Telah mengabarkan kepadaku [Muhammad bin Wahb] berkata; telah menceritakan kepadaku [Muhammad bin Salamah] berkata; telah menceritakan kepadaku [Abu Abdurrahim] berkata; telah menceritakan kepadaku [Zaid bin Abi Unais] dari [Abu Ishaq] dari [Abu 'Abdurrahman As Salami] ia berkata, \"Tatkala Utsman dikepung di rumahnya, orang-orang berkumpul di sekitar rumahnya.\" Ia berkata, \"Kemudian [Utsman] menampakkan kemuliannya kepada mereka…dan ia menyebutkan hadits tersebut",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3610,
			"arabicnumber": 3610,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		}
	]
}