{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ بَيْنَمَا نَحْنُ جُلُوسٌ فِي الْمَسْجِدِ دَخَلَ رَجُلٌ عَلَى رَحْلٍ فَأَنَاخَهُ فِي الْمَسْجِدِ ثُمَّ عَقَلَهُ ثُمَّ قَالَ لَهُمْ أَيُّكُمْ مُحَمَّدٌ وَرَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مُتَّكِئٌ بَيْنَ ظَهْرَانَيْهِمْ ‏.‏ قَالَ فَقَالُوا هَذَا الرَّجُلُ الأَبْيَضُ الْمُتَّكِئُ ‏.‏ فَقَالَ لَهُ الرَّجُلُ يَا ابْنَ عَبْدِ الْمُطَّلِبِ ‏.‏ فَقَالَ لَهُ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ قَدْ أَجَبْتُكَ ‏\"‏ ‏.‏ فَقَالَ لَهُ الرَّجُلُ يَا مُحَمَّدُ إِنِّي سَائِلُكَ وَمُشَدِّدٌ عَلَيْكَ فِي الْمَسْأَلَةِ فَلاَ تَجِدَنَّ عَلَىَّ فِي نَفْسِكَ ‏.‏ فَقَالَ ‏\"‏ سَلْ مَا بَدَا لَكَ ‏\"‏ ‏.‏ قَالَ لَهُ الرَّجُلُ نَشَدْتُكَ بِرَبِّكَ وَرَبِّ مَنْ قَبْلَكَ آللَّهُ أَرْسَلَكَ إِلَى النَّاسِ كُلِّهِمْ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَأَنْشُدُكَ بِاللَّهِ آللَّهُ أَمَرَكَ أَنْ تُصَلِّيَ الصَّلَوَاتِ الْخَمْسَ فِي الْيَوْمِ وَاللَّيْلَةِ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَأَنْشُدُكَ بِاللَّهِ آللَّهُ أَمَرَكَ أَنْ تَصُومَ هَذَا الشَّهْرَ مِنَ السَّنَةِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَأَنْشُدُكَ بِاللَّهِ آللَّهُ أَمَرَكَ أَنْ تَأْخُذَ هَذِهِ الصَّدَقَةَ مِنْ أَغْنِيَائِنَا فَتَقْسِمَهَا عَلَى فُقَرَائِنَا فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ آمَنْتُ بِمَا جِئْتَ بِهِ وَأَنَا رَسُولُ مَنْ وَرَائِي مِنْ قَوْمِي ‏.‏ وَأَنَا ضِمَامُ بْنُ ثَعْلَبَةَ أَخُو بَنِي سَعْدِ بْنِ بَكْرٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 600
			}
		}
	]
}