{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"10": "The Chapters on Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2062,
			"arabicnumber": 2062,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ سَلَمَةَ بْنِ صَخْرٍ الْبَيَاضِيِّ، قَالَ كُنْتُ امْرَأً أَسْتَكْثِرُ مِنَ النِّسَاءِ لاَ أُرَى رَجُلاً كَانَ يُصِيبُ مِنْ ذَلِكَ مَا أُصِيبُ فَلَمَّا دَخَلَ رَمَضَانُ ظَاهَرْتُ مِنِ امْرَأَتِي حَتَّى يَنْسَلِخَ رَمَضَانُ فَبَيْنَمَا هِيَ تُحَدِّثُنِي ذَاتَ لَيْلَةٍ انْكَشَفَ لِي مِنْهَا شَىْءٌ فَوَثَبْتُ عَلَيْهَا فَوَاقَعْتُهَا فَلَمَّا أَصْبَحْتُ غَدَوْتُ عَلَى قَوْمِي فَأَخْبَرْتُهُمْ خَبَرِي وَقُلْتُ لَهُمْ سَلُوا لِي رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَقَالُوا مَا كُنَّا لِنَفْعَلَ إِذًا يُنْزِلَ اللَّهُ فِينَا كِتَابًا أَوْ يَكُونَ فِينَا مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَوْلٌ فَيَبْقَى عَلَيْنَا عَارُهُ وَلَكِنْ سَوْفَ نُسَلِّمُكَ لِجَرِيرَتِكَ اذْهَبْ أَنْتَ فَاذْكُرْ شَأْنَكَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ فَخَرَجْتُ حَتَّى جِئْتُهُ فَأَخْبَرْتُهُ الْخَبَرَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَنْتَ بِذَاكَ ‏\"‏ ‏.‏ فَقُلْتُ أَنَا بِذَاكَ وَهَا أَنَا يَا رَسُولَ اللَّهِ صَابِرٌ لِحُكْمِ اللَّهِ عَلَىَّ ‏.‏ قَالَ ‏\"‏ فَأَعْتِقْ رَقَبَةً ‏\"‏ ‏.‏ قَالَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَصْبَحْتُ أَمْلِكُ إِلاَّ رَقَبَتِي هَذِهِ ‏.‏ قَالَ ‏\"‏ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ وَهَلْ دَخَلَ عَلَىَّ مَا دَخَلَ مِنَ الْبَلاَءِ إِلاَّ بِالصَّوْمِ قَالَ ‏\"‏ فَتَصَدَّقْ وَأَطْعِمْ سِتِّينَ مِسْكِينًا ‏\"‏ ‏.‏ قَالَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَقَدْ بِتْنَا لَيْلَتَنَا هَذِهِ مَا لَنَا عَشَاءٌ ‏.‏ قَالَ ‏\"‏ فَاذْهَبْ إِلَى صَاحِبِ صَدَقَةِ بَنِي زُرَيْقٍ فَقُلْ لَهُ فَلْيَدْفَعْهَا إِلَيْكَ وَأَطْعِمْ سِتِّينَ مِسْكِينًا وَانْتَفِعْ بِبَقِيَّتِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 47
			}
		}
	]
}