{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"24": "The Chapters on Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2781,
			"arabicnumber": 2781,
			"text": "حَدَّثَنَا أَبُو يُوسُفَ، مُحَمَّدُ بْنُ أَحْمَدَ الرَّقِّيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْحَرَّانِيُّ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ طَلْحَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ مُعَاوِيَةَ بْنِ جَاهِمَةَ السُّلَمِيِّ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ أَرَدْتُ الْجِهَادَ مَعَكَ أَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ وَالدَّارَ الآخِرَةَ ‏.‏ قَالَ ‏\"‏ وَيْحَكَ أَحَيَّةٌ أُمُّكَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ ارْجِعْ فَبَرَّهَا ‏\"‏ ‏.‏ ثُمَّ أَتَيْتُهُ مِنَ الْجَانِبِ الآخَرِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ أَرَدْتُ الْجِهَادَ مَعَكَ أَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ وَالدَّارَ الآخِرَةَ ‏.‏ قَالَ ‏\"‏ وَيْحَكَ أَحَيَّةٌ أُمُّكَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ فَارْجِعْ إِلَيْهَا فَبَرَّهَا ‏\"‏ ‏.‏ ثُمَّ أَتَيْتُهُ مِنْ أَمَامِهِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ أَرَدْتُ الْجِهَادَ مَعَكَ أَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ وَالدَّارَ الآخِرَةَ ‏.‏ قَالَ ‏\"‏ وَيْحَكَ أَحَيَّةٌ أُمُّكَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ وَيْحَكَ الْزَمْ رِجْلَهَا فَثَمَّ الْجَنَّةُ ‏\"‏ ‏.‏ حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُحَمَّدُ بْنُ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ أَبِيهِ، طَلْحَةَ عَنْ مُعَاوِيَةَ بْنِ جَاهِمَةَ السُّلَمِيِّ، أَنَّ جَاهِمَةَ، أَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ نَحْوَهُ ‏. ‏قَالَ أَبُو عَبْدِ اللَّهِ بْنُ مَاجَهْ هَذَا جَاهِمَةُ بْنُ عَبَّاسِ بْنِ مِرْدَاسٍ السُّلَمِيُّ الَّذِي عَاتَبَ النَّبِيَّ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		}
	]
}