{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"35": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى الأَشْيَبُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، قَالَ قَدِمْتُ الْمَدِينَةَ فَجَلَسْتُ إِلَى أَشْيِخَةٍ فِي مَسْجِدِ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَجَاءَ شَيْخٌ يَتَوَكَّأُ عَلَى عَصًا لَهُ فَقَالَ الْقَوْمُ مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا ‏.‏ فَقَامَ خَلْفَ سَارِيَةٍ فَصَلَّى رَكْعَتَيْنِ فَقُمْتُ إِلَيْهِ فَقُلْتُ لَهُ قَالَ بَعْضُ الْقَوْمِ كَذَا وَكَذَا ‏.‏ قَالَ الْحَمْدُ لِلَّهِ الْجَنَّةُ لِلَّهِ يُدْخِلُهَا مَنْ يَشَاءُ وَإِنِّي رَأَيْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ رُؤْيَا رَأَيْتُ كَأَنَّ رَجُلاً أَتَانِي فَقَالَ لِيَ انْطَلِقْ ‏.‏ فَذَهَبْتُ مَعَهُ فَسَلَكَ بِي فِي مَنْهَجٍ عَظِيمٍ فَعُرِضَتْ عَلَىَّ طَرِيقٌ عَلَى يَسَارِي فَأَرَدْتُ أَنْ أَسْلُكَهَا فَقَالَ إِنَّكَ لَسْتَ مِنْ أَهْلِهَا ‏.‏ ثُمَّ عُرِضَتْ عَلَىَّ طَرِيقٌ عَنْ يَمِينِي فَسَلَكْتُهَا حَتَّى إِذَا انْتَهَيْتُ إِلَى جَبَلٍ زَلَقٍ فَأَخَذَ بِيَدِي فَزَجَلَ بِي فَإِذَا أَنَا عَلَى ذُرْوَتِهِ فَلَمْ أَتَقَارَّ وَلَمْ أَتَمَاسَكْ وَإِذَا عَمُودٌ مِنْ حَدِيدٍ فِي ذُرْوَتِهِ حَلْقَةٌ مِنْ ذَهَبٍ فَأَخَذَ بِيَدِي فَزَجَّلَ بِي حَتَّى أَخَذْتُ بِالْعُرْوَةِ فَقَالَ اسْتَمْسَكْتَ قُلْتُ نَعَمْ فَضَرَبَ الْعَمُودَ بِرِجْلِهِ ‏.‏ فَاسْتَمْسَكْتُ بِالْعُرْوَةِ ‏.‏ فَقَالَ قَصَصْتُهَا عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ ‏ \"‏ رَأَيْتَ خَيْرًا أَمَّا الْمَنْهَجُ الْعَظِيمُ فَالْمَحْشَرُ وَأَمَّا الطَّرِيقُ الَّتِي عُرِضَتْ عَنْ يَسَارِكَ فَطَرِيقُ أَهْلِ النَّارِ وَلَسْتَ مِنْ أَهْلِهَا وَأَمَّا الطَّرِيقُ الَّتِي عُرِضَتْ عَنْ يَمِينِكَ فَطَرِيقُ أَهْلِ الْجَنَّةِ وَأَمَّا الْجَبَلُ الزَّلَقُ فَمَنْزِلُ الشُّهَدَاءِ وَأَمَّا الْعُرْوَةُ الَّتِي اسْتَمْسَكْتَ بِهَا فَعُرْوَةُ الإِسْلاَمِ فَاسْتَمْسِكْ بِهَا حَتَّى تَمُوتَ ‏\"‏ ‏.‏ فَأَنَا أَرْجُو أَنْ أَكُونَ مِنْ أَهْلِ الْجَنَّةِ فَإِذَا هُوَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 28
			}
		}
	]
}