{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"35": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3925,
			"arabicnumber": 3925,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، أَنَّ رَجُلَيْنِ، مِنْ بَلِيٍّ قَدِمَا عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَكَانَ إِسْلاَمُهُمَا جَمِيعًا فَكَانَ أَحَدُهُمَا أَشَدَّ اجْتِهَادًا مِنَ الآخَرِ فَغَزَا الْمُجْتَهِدُ مِنْهُمَا فَاسْتُشْهِدَ ثُمَّ مَكَثَ الآخَرُ بَعْدَهُ سَنَةً ثُمَّ تُوُفِّيَ ‏.‏ قَالَ طَلْحَةُ فَرَأَيْتُ فِي الْمَنَامِ بَيْنَا أَنَا عِنْدَ بَابِ الْجَنَّةِ إِذَا أَنَا بِهِمَا فَخَرَجَ خَارِجٌ مِنَ الْجَنَّةِ فَأَذِنَ لِلَّذِي تُوُفِّيَ الآخِرَ مِنْهُمَا ثُمَّ خَرَجَ فَأَذِنَ لِلَّذِي اسْتُشْهِدَ ثُمَّ رَجَعَ إِلَىَّ فَقَالَ ارْجِعْ فَإِنَّكَ لَمْ يَأْنِ لَكَ بَعْدُ ‏.‏ فَأَصْبَحَ طَلْحَةُ يُحَدِّثُ بِهِ النَّاسَ فَعَجِبُوا لِذَلِكَ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ وَحَدَّثُوهُ الْحَدِيثَ فَقَالَ ‏\"‏ مِنْ أَىِّ ذَلِكَ تَعْجَبُونَ ‏\"‏ فَقَالُوا يَا رَسُولَ اللَّهِ هَذَا كَانَ أَشَدَّ الرَّجُلَيْنِ اجْتِهَادًا ثُمَّ اسْتُشْهِدَ وَدَخَلَ هَذَا الآخِرُ الْجَنَّةَ قَبْلَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَلَيْسَ قَدْ مَكَثَ هَذَا بَعْدَهُ سَنَةً ‏\"‏ ‏.‏ قَالُوا بَلَى ‏.‏ قَالَ ‏\"‏ وَأَدْرَكَ رَمَضَانَ فَصَامَهُ وَصَلَّى كَذَا وَكَذَا مِنْ سَجْدَةٍ فِي السَّنَةِ ‏\"‏ ‏.‏ قَالُوا بَلَى قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ فَمَا بَيْنَهُمَا أَبْعَدُ مِمَّا بَيْنَ السَّمَاءِ وَالأَرْضِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 33
			}
		}
	]
}