{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4074,
			"arabicnumber": 4074,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ مُجَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَتْ صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ذَاتَ يَوْمٍ وَصَعِدَ الْمِنْبَرَ وَكَانَ لاَ يَصْعَدُ عَلَيْهِ قَبْلَ ذَلِكَ إِلاَّ يَوْمَ الْجُمُعَةِ فَاشْتَدَّ ذَلِكَ عَلَى النَّاسِ فَمِنْ بَيْنِ قَائِمٍ وَجَالِسٍ فَأَشَارَ إِلَيْهِمْ بِيَدِهِ أَنِ اقْعُدُوا ‏\"‏ فَإِنِّي وَاللَّهِ مَا قُمْتُ مَقَامِي هَذَا لأَمْرٍ يَنْفَعُكُمْ لِرَغْبَةٍ وَلاَ لِرَهْبَةٍ وَلَكِنَّ تَمِيمًا الدَّارِيَّ أَتَانِي فَأَخْبَرَنِي خَبَرًا مَنَعَنِي الْقَيْلُولَةَ مِنَ الْفَرَحِ وَقُرَّةِ الْعَيْنِ فَأَحْبَبْتُ أَنْ أَنْشُرَ عَلَيْكُمْ فَرَحَ نَبِيِّكُمْ أَلاَ إِنَّ ابْنَ عَمٍّ لَتَمِيمٍ الدَّارِيِّ أَخْبَرَنِي أَنَّ الرِّيحَ أَلْجَأَتْهُمْ إِلَى جَزِيرَةٍ لاَ يَعْرِفُونَهَا فَقَعَدُوا فِي قَوَارِبِ السَّفِينَةِ فَخَرَجُوا فِيهَا فَإِذَا هُمْ بِشَىْءٍ أَهْدَبَ أَسْوَدَ قَالُوا لَهُ مَا أَنْتَ قَالَ أَنَا الْجَسَّاسَةُ ‏.‏ قَالُوا أَخْبِرِينَا ‏.‏ قَالَتْ مَا أَنَا بِمُخْبِرَتِكُمْ شَيْئًا وَلاَ سَائِلَتِكُمْ وَلَكِنْ هَذَا الدَّيْرُ قَدْ رَمَقْتُمُوهُ فَأْتُوهُ فَإِنَّ فِيهِ رَجُلاً بِالأَشْوَاقِ إِلَى أَنْ تُخْبِرُوهُ وَيُخْبِرَكُمْ فَأَتَوْهُ فَدَخَلُوا عَلَيْهِ فَإِذَا هُمْ بِشَيْخٍ مُوثَقٍ شَدِيدِ الْوَثَاقِ يُظْهِرُ الْحُزْنَ شَدِيدِ التَّشَكِّي فَقَالَ لَهُمْ مِنْ أَيْنَ قَالُوا مِنَ الشَّامِ ‏.‏ قَالَ مَا فَعَلَتِ الْعَرَبُ قَالُوا نَحْنُ قَوْمٌ مِنَ الْعَرَبِ عَمَّ تَسْأَلُ قَالَ مَا فَعَلَ هَذَا الرَّجُلُ الَّذِي خَرَجَ فِيكُمْ قَالُوا خَيْرًا نَاوَى قَوْمًا فَأَظْهَرَهُ اللَّهُ عَلَيْهِمْ فَأَمْرُهُمُ الْيَوْمَ جَمِيعٌ إِلَهُهُمْ وَاحِدٌ وَدِينُهُمْ وَاحِدٌ قَالَ مَا فَعَلَتْ عَيْنُ زُغَرَ قَالُوا خَيْرًا يَسْقُونَ مِنْهَا زُرُوعَهُمْ وَيَسْتَقُونَ مِنْهَا لِسَقْيِهِمْ قَالَ فَمَا فَعَلَ نَخْلٌ بَيْنَ عَمَّانَ وَبَيْسَانَ قَالُوا يُطْعِمُ ثَمَرَهُ كُلَّ عَامٍ ‏.‏ قَالَ فَمَا فَعَلَتْ بُحَيْرَةُ الطَّبَرِيَّةِ قَالُوا تَدَفَّقُ جَنَبَاتُهَا مِنْ كَثْرَةِ الْمَاءِ ‏.‏ قَالَ فَزَفَرَ ثَلاَثَ زَفَرَاتٍ ثُمَّ قَالَ لَوِ انْفَلَتُّ مِنْ وَثَاقِي هَذَا لَمْ أَدَعْ أَرْضًا إِلاَّ وَطِئْتُهَا بِرِجْلَىَّ هَاتَيْنِ إِلاَّ طَيْبَةَ لَيْسَ لِي عَلَيْهَا سَبِيلٌ ‏\"‏ ‏.‏ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ إِلَى هَذَا يَنْتَهِي فَرَحِي هَذِهِ طَيْبَةُ وَالَّذِي نَفْسِي بِيَدِهِ مَا فِيهَا طَرِيقٌ ضَيِّقٌ وَلاَ وَاسِعٌ وَلاَ سَهْلٌ وَلاَ جَبَلٌ إِلاَّ وَعَلَيْهِ مَلَكٌ شَاهِرٌ سَيْفَهُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Matn"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 149
			}
		}
	]
}