{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4077,
			"arabicnumber": 4077,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ، عَنْ إِسْمَاعِيلَ بْنِ رَافِعٍ أَبِي رَافِعٍ، عَنْ أَبِي زُرْعَةَ السَّيْبَانِيِّ، يَحْيَى بْنِ أَبِي عَمْرٍو عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَكَانَ أَكْثَرُ خُطْبَتِهِ حَدِيثًا حَدَّثَنَاهُ عَنِ الدَّجَّالِ وَحَذَّرَنَاهُ فَكَانَ مِنْ قَوْلِهِ أَنْ قَالَ ‏\"‏ إِنَّهُ لَمْ تَكُنْ فِتْنَةٌ فِي الأَرْضِ مُنْذُ ذَرَأَ اللَّهُ ذُرِّيَّةَ آدَمَ أَعْظَمَ مِنْ فِتْنَةِ الدَّجَّالِ وَإِنَّ اللَّهَ لَمْ يَبْعَثْ نَبِيًّا إِلاَّ حَذَّرَ أُمَّتَهُ الدَّجَّالَ وَأَنَا آخِرُ الأَنْبِيَاءِ وَأَنْتُمْ آخِرُ الأُمَمِ وَهُوَ خَارِجٌ فِيكُمْ لاَ مَحَالَةَ وَإِنْ يَخْرُجْ وَأَنَا بَيْنَ ظَهْرَانَيْكُمْ فَأَنَا حَجِيجٌ لِكُلِّ مُسْلِمٍ وَإِنْ يَخْرُجْ مِنْ بَعْدِي فَكُلُّ امْرِئٍ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ وَإِنَّهُ يَخْرُجُ مِنْ خَلَّةٍ بَيْنَ الشَّامِ وَالْعِرَاقِ فَيَعِيثُ يَمِينًا وَيَعِيثُ شِمَالاً ‏.‏ يَا عِبَادَ اللَّهِ أَيُّهَا النَّاسُ فَاثْبُتُوا فَإِنِّي سَأَصِفُهُ لَكُمْ صِفَةً لَمْ يَصِفْهَا إِيَّاهُ نَبِيٌّ قَبْلِي إِنَّهُ يَبْدَأُ فَيَقُولُ أَنَا نَبِيٌّ وَلاَ نَبِيَّ بَعْدِي ثُمَّ يُثَنِّي فَيَقُولُ أَنَا رَبُّكُمْ ‏.‏ وَلاَ تَرَوْنَ رَبَّكُمْ حَتَّى تَمُوتُوا وَإِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ وَإِنَّهُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ يَقْرَؤُهُ كُلُّ مُؤْمِنٍ كَاتِبٍ أَوْ غَيْرِ كَاتِبٍ وَإِنَّ مِنْ فِتْنَتِهِ أَنَّ مَعَهُ جَنَّةً وَنَارًا فَنَارُهُ جَنَّةٌ وَجَنَّتُهُ نَارٌ فَمَنِ ابْتُلِيَ بِنَارِهِ فَلْيَسْتَغِثْ بِاللَّهِ وَلْيَقْرَأْ فَوَاتِحَ الْكَهْفِ فَتَكُونَ عَلَيْهِ بَرْدًا وَسَلاَمًا كَمَا كَانَتِ النَّارُ عَلَى إِبْرَاهِيمَ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يَقُولَ لأَعْرَابِيٍّ أَرَأَيْتَ إِنْ بَعَثْتُ لَكَ أَبَاكَ وَأُمَّكَ أَتَشْهَدُ أَنِّي رَبُّكَ فَيَقُولُ نَعَمْ ‏.‏ فَيَتَمَثَّلُ لَهُ شَيْطَانَانِ فِي صُورَةِ أَبِيهِ وَأُمِّهِ فَيَقُولاَنِ يَا بُنَىَّ اتَّبِعْهُ فَإِنَّهُ رَبُّكَ ‏.‏ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يُسَلَّطَ عَلَى نَفْسٍ وَاحِدَةٍ فَيَقْتُلَهَا وَيَنْشُرَهَا بِالْمِنْشَارِ حَتَّى يُلْقَى شِقَّتَيْنِ ثُمَّ يَقُولُ انْظُرُوا إِلَى عَبْدِي هَذَا فَإِنِّي أَبْعَثُهُ الآنَ ثُمَّ يَزْعُمُ أَنَّ لَهُ رَبًّا غَيْرِي ‏.‏ فَيَبْعَثُهُ اللَّهُ وَيَقُولُ لَهُ الْخَبِيثُ مَنْ رَبُّكَ فَيَقُولُ رَبِّيَ اللَّهُ وَأَنْتَ عَدُوُّ اللَّهِ أَنْتَ الدَّجَّالُ وَاللَّهِ مَا كُنْتُ بَعْدُ أَشَدَّ بَصِيرَةً بِكَ مِنِّي الْيَوْمَ ‏\"‏ ‏.‏ قَالَ أَبُو الْحَسَنِ الطَّنَافِسِيُّ فَحَدَّثَنَا الْمُحَارِبِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْوَلِيدِ الْوَصَّافِيُّ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ ذَلِكَ الرَّجُلُ أَرْفَعُ أُمَّتِي دَرَجَةً فِي الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ قَالَ أَبُو سَعِيدٍ وَاللَّهِ مَا كُنَّا نُرَى ذَلِكَ الرَّجُلَ إِلاَّ عُمَرَ بْنَ الْخَطَّابِ حَتَّى مَضَى لِسَبِيلِهِ ‏.‏ قَالَ الْمُحَارِبِيُّ ثُمَّ رَجَعْنَا إِلَى حَدِيثِ أَبِي رَافِعٍ قَالَ ‏\"‏ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يَأْمُرَ السَّمَاءَ أَنْ تُمْطِرَ فَتُمْطِرَ وَيَأْمُرَ الأَرْضَ أَنْ تُنْبِتَ فَتُنْبِتَ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يَمُرَّ بِالْحَىِّ فَيُكَذِّبُونَهُ فَلاَ تَبْقَى لَهُمْ سَائِمَةٌ إِلاَّ هَلَكَتْ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يَمُرَّ بِالْحَىِّ فَيُصَدِّقُونَهُ فَيَأْمُرَ السَّمَاءَ أَنْ تُمْطِرَ فَتُمْطِرَ وَيَأْمُرَ الأَرْضَ أَنْ تُنْبِتَ فَتُنْبِتَ حَتَّى تَرُوحَ مَوَاشِيهِمْ مِنْ يَوْمِهِمْ ذَلِكَ أَسْمَنَ مَا كَانَتْ وَأَعْظَمَهُ وَأَمَدَّهُ خَوَاصِرَ وَأَدَرَّهُ ضُرُوعًا وَإِنَّهُ لاَ يَبْقَى شَىْءٌ مِنَ الأَرْضِ إِلاَّ وَطِئَهُ وَظَهَرَ عَلَيْهِ إِلاَّ مَكَّةَ وَالْمَدِينَةَ لاَ يَأْتِيهِمَا مِنْ نَقْبٍ مِنْ نِقَابِهِمَا إِلاَّ لَقِيَتْهُ الْمَلاَئِكَةُ بِالسُّيُوفِ صَلْتَةً حَتَّى يَنْزِلَ عِنْدَ الظُّرَيْبِ الأَحْمَرِ عِنْدَ مُنْقَطَعِ السَّبَخَةِ فَتَرْجُفُ الْمَدِينَةُ بِأَهْلِهَا ثَلاَثَ رَجَفَاتٍ فَلاَ يَبْقَى مُنَافِقٌ وَلاَ مُنَافِقَةٌ إِلاَّ خَرَجَ إِلَيْهِ فَتَنْفِي الْخَبَثَ مِنْهَا كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ وَيُدْعَى ذَلِكَ الْيَوْمُ يَوْمَ الْخَلاَصِ ‏\"‏ ‏.‏ فَقَالَتْ أُمُّ شَرِيكٍ بِنْتُ أَبِي الْعُكَرِ يَا رَسُولَ اللَّهِ فَأَيْنَ الْعَرَبُ يَوْمَئِذٍ قَالَ ‏\"‏ هُمْ يَوْمَئِذٍ قَلِيلٌ وَجُلُّهُمْ بِبَيْتِ الْمَقْدِسِ وَإِمَامُهُمْ رَجُلٌ صَالِحٌ فَبَيْنَمَا إِمَامُهُمْ قَدْ تَقَدَّمَ يُصَلِّي بِهِمُ الصُّبْحَ إِذْ نَزَلَ عَلَيْهِمْ عِيسَى ابْنُ مَرْيَمَ الصُّبْحَ فَرَجَعَ ذَلِكَ الإِمَامُ يَنْكُصُ يَمْشِي الْقَهْقَرَى لِيَتَقَدَّمَ عِيسَى يُصَلِّي بِالنَّاسِ فَيَضَعُ عِيسَى يَدَهُ بَيْنَ كَتِفَيْهِ ثُمَّ يَقُولُ لَهُ تَقَدَّمْ فَصَلِّ فَإِنَّهَا لَكَ أُقِيمَتْ ‏.‏ فَيُصَلِّي بِهِمْ إِمَامُهُمْ فَإِذَا انْصَرَفَ قَالَ عِيسَى عَلَيْهِ السَّلاَمُ افْتَحُوا الْبَابَ ‏.‏ فَيُفْتَحُ وَوَرَاءَهُ الدَّجَّالُ مَعَهُ سَبْعُونَ أَلْفِ يَهُودِيٍّ كُلُّهُمْ ذُو سَيْفٍ مُحَلًّى وَسَاجٍ فَإِذَا نَظَرَ إِلَيْهِ الدَّجَّالُ ذَابَ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ وَيَنْطَلِقُ هَارِبًا وَيَقُولُ عِيسَى عَلَيْهِ السَّلاَمُ إِنَّ لِي فِيكَ ضَرْبَةً لَنْ تَسْبِقَنِي بِهَا ‏.‏ فَيُدْرِكُهُ عِنْدَ بَابِ اللُّدِّ الشَّرْقِيِّ فَيَقْتُلُهُ فَيَهْزِمُ اللَّهُ الْيَهُودَ فَلاَ يَبْقَى شَىْءٌ مِمَّا خَلَقَ اللَّهُ يَتَوَارَى بِهِ يَهُودِيٌّ إِلاَّ أَنْطَقَ اللَّهُ ذَلِكَ الشَّىْءَ لاَ حَجَرَ وَلاَ شَجَرَ وَلاَ حَائِطَ وَلاَ دَابَّةَ - إِلاَّ الْغَرْقَدَةَ فَإِنَّهَا مِنْ شَجَرِهِمْ لاَ تَنْطِقُ - إِلاَّ قَالَ يَا عَبْدَ اللَّهِ الْمُسْلِمَ هَذَا يَهُودِيٌّ فَتَعَالَ اقْتُلْهُ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ وَإِنَّ أَيَّامَهُ أَرْبَعُونَ سَنَةً السَّنَةُ كَنِصْفِ السَّنَةِ وَالسَّنَةُ كَالشَّهْرِ وَالشَّهْرُ كَالْجُمُعَةِ وَآخِرُ أَيَّامِهِ كَالشَّرَرَةِ يُصْبِحُ أَحَدُكُمْ عَلَى بَابِ الْمَدِينَةِ فَلاَ يَبْلُغُ بَابَهَا الآخَرَ حَتَّى يُمْسِيَ ‏\"‏ ‏.‏ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي فِي تِلْكَ الأَيَّامِ الْقِصَارِ قَالَ ‏\"‏ تَقْدُرُونَ فِيهَا الصَّلاَةَ كَمَا تَقْدُرُونَهَا فِي هَذِهِ الأَيَّامِ الطِّوَالِ ثُمَّ صَلُّوا ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ فَيَكُونُ عِيسَى ابْنُ مَرْيَمَ عَلَيْهِ السَّلاَمُ فِي أُمَّتِي حَكَمًا عَدْلاً وَإِمَامًا مُقْسِطًا يَدُقُّ الصَّلِيبَ وَيَذْبَحُ الْخِنْزِيرَ وَيَضَعُ الْجِزْيَةَ وَيَتْرُكُ الصَّدَقَةَ فَلاَ يُسْعَى عَلَى شَاةٍ وَلاَ بَعِيرٍ وَتُرْفَعُ الشَّحْنَاءُ وَالتَّبَاغُضُ وَتُنْزَعُ حُمَةُ كُلِّ ذَاتِ حُمَةٍ حَتَّى يُدْخِلَ الْوَلِيدُ يَدَهُ فِي فِي الْحَيَّةِ فَلاَ تَضُرَّهُ وَتُفِرُّ الْوَلِيدَةُ الأَسَدَ فَلاَ يَضُرُّهَا وَيَكُونُ الذِّئْبُ فِي الْغَنَمِ كَأَنَّهُ كَلْبُهَا وَتُمْلأُ الأَرْضُ مِنَ السِّلْمِ كَمَا يُمْلأُ الإِنَاءُ مِنَ الْمَاءِ وَتَكُونُ الْكَلِمَةُ وَاحِدَةً فَلاَ يُعْبَدُ إِلاَّ اللَّهُ وَتَضَعُ الْحَرْبُ أَوْزَارَهَا وَتُسْلَبُ قُرَيْشٌ مُلْكَهَا وَتَكُونُ الأَرْضُ كَفَاثُورِ الْفِضَّةِ تُنْبِتُ نَبَاتَهَا بِعَهْدِ آدَمَ حَتَّى يَجْتَمِعَ النَّفَرُ عَلَى الْقِطْفِ مِنَ الْعِنَبِ فَيُشْبِعَهُمْ وَيَجْتَمِعَ النَّفَرُ عَلَى الرُّمَّانَةِ فَتُشْبِعَهُمْ وَيَكُونَ الثَّوْرُ بِكَذَا وَكَذَا مِنَ الْمَالِ وَتَكُونَ الْفَرَسُ بِالدُّرَيْهِمَاتِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا يُرْخِصُ الْفَرَسَ قَالَ ‏\"‏ لاَ تُرْكَبُ لِحَرْبٍ أَبَدًا ‏\"‏ ‏.‏ قِيلَ لَهُ فَمَا يُغْلِي الثَّوْرَ قَالَ ‏\"‏ تُحْرَثُ الأَرْضُ كُلُّهَا وَإِنَّ قَبْلَ خُرُوجِ الدَّجَّالِ ثَلاَثَ سَنَوَاتٍ شِدَادٍ يُصِيبُ النَّاسَ فِيهَا جُوعٌ شَدِيدٌ يَأْمُرُ اللَّهُ السَّمَاءَ فِي السَّنَةِ الأُولَى أَنْ تَحْبِسَ ثُلُثَ مَطَرِهَا وَيَأْمُرُ الأَرْضَ فَتَحْبِسُ ثُلُثَ نَبَاتِهَا ثُمَّ يَأْمُرُ السَّمَاءَ فِي السَّنَةِ الثَّانِيَةِ فَتَحْبِسُ ثُلُثَىْ مَطَرِهَا وَيَأْمُرُ الأَرْضَ فَتَحْبِسُ ثُلُثَىْ نَبَاتِهَا ثُمَّ يَأْمُرُ اللَّهُ السَّمَاءَ فِي السَّنَةِ الثَّالِثَةِ فَتَحْبِسُ مَطَرَهَا كُلَّهُ فَلاَ تَقْطُرُ قَطْرَةٌ وَيَأْمُرُ الأَرْضَ فَتَحْبِسُ نَبَاتَهَا كُلَّهُ فَلاَ تُنْبِتُ خَضْرَاءَ فَلاَ تَبْقَى ذَاتُ ظِلْفٍ إِلاَّ هَلَكَتْ إِلاَّ مَا شَاءَ اللَّهُ ‏\"‏ ‏.‏ قِيلَ فَمَا يُعِيشُ النَّاسَ فِي ذَلِكَ الزَّمَانِ قَالَ ‏\"‏ التَّهْلِيلُ وَالتَّكْبِيرُ وَالتَّسْبِيحُ وَالتَّحْمِيدُ وَيُجْرَى ذَلِكَ عَلَيْهِمْ مَجْرَى الطَّعَامِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ سَمِعْتُ أَبَا الْحَسَنِ الطَّنَافِسِيَّ يَقُولُ سَمِعْتُ عَبْدَ الرَّحْمَنِ الْمُحَارِبِيَّ يَقُولُ يَنْبَغِي أَنْ يُدْفَعَ هَذَا الْحَدِيثُ إِلَى الْمُؤَدِّبِ حَتَّى يُعَلِّمَهُ الصِّبْيَانَ فِي الْكُتَّابِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 152
			}
		}
	]
}