{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4127,
			"arabicnumber": 4127,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ، حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ الْعَنْقَزِيُّ، حَدَّثَنَا أَسْبَاطُ بْنُ نَصْرٍ، عَنِ السُّدِّيِّ، عَنْ أَبِي سَعْدٍ الأَزْدِيِّ، وَكَانَ، قَارِئَ الأَزْدِ عَنْ أَبِي الْكَنُودِ، عَنْ خَبَّابٍ، فِي قَوْلِهِ تَعَالَى ‏{وَلاَ تَطْرُدِ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ}‏ إِلَى قَوْلِهِ ‏{فَتَكُونَ مِنَ الظَّالِمِينَ}‏ قَالَ جَاءَ الأَقْرَعُ بْنُ حَابِسٍ التَّمِيمِيُّ وَعُيَيْنَةُ بْنُ حِصْنٍ الْفَزَارِيُّ فَوَجَدُوا رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَعَ صُهَيْبٍ وَبِلاَلٍ وَعَمَّارٍ وَخَبَّابٍ قَاعِدًا فِي نَاسٍ مِنَ الضُّعَفَاءِ مِنَ الْمُؤْمِنِينَ فَلَمَّا رَأَوْهُمْ حَوْلَ النَّبِيِّ ـ صلى الله عليه وسلم ـ حَقَرُوهُمْ فَأَتَوْهُ فَخَلَوْا بِهِ وَقَالُوا إِنَّا نُرِيدُ أَنْ تَجْعَلَ لَنَا مِنْكَ مَجْلِسًا تَعْرِفُ لَنَا بِهِ الْعَرَبُ فَضْلَنَا فَإِنَّ وُفُودَ الْعَرَبِ تَأْتِيكَ فَنَسْتَحْيِي أَنْ تَرَانَا الْعَرَبُ مَعَ هَذِهِ الأَعْبُدِ فَإِذَا نَحْنُ جِئْنَاكَ فَأَقِمْهُمْ عَنْكَ فَإِذَا نَحْنُ فَرَغْنَا فَاقْعُدْ مَعَهُمْ إِنْ شِئْتَ ‏.‏ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالُوا فَاكْتُبْ لَنَا عَلَيْكَ كِتَابًا ‏.‏ قَالَ فَدَعَا بِصَحِيفَةٍ وَدَعَا عَلِيًّا لِيَكْتُبَ وَنَحْنُ قُعُودٌ فِي نَاحِيَةٍ فَنَزَلَ جِبْرَائِيلُ عَلَيْهِ السَّلاَمُ فَقَالَ ‏{وَلاَ تَطْرُدِ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ مَا عَلَيْكَ مِنْ حِسَابِهِمْ مِنْ شَىْءٍ وَمَا مِنْ حِسَابِكَ عَلَيْهِمْ مِنْ شَىْءٍ فَتَطْرُدَهُمْ فَتَكُونَ مِنَ الظَّالِمِينَ}‏ ثُمَّ ذَكَرَ الأَقْرَعَ بْنَ حَابِسٍ وَعُيَيْنَةَ بْنَ حِصْنٍ فَقَالَ ‏{وَكَذَلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِيَقُولُوا أَهَؤُلاَءِ مَنَّ اللَّهُ عَلَيْهِمْ مِنْ بَيْنِنَا أَلَيْسَ اللَّهُ بِأَعْلَمَ بِالشَّاكِرِينَ}‏ ‏.‏ ثُمَّ قَالَ ‏{وَإِذَا جَاءَكَ الَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا فَقُلْ سَلاَمٌ عَلَيْكُمْ كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ }‏ ‏.‏ قَالَ فَدَنَوْنَا مِنْهُ حَتَّى وَضَعْنَا رُكَبَنَا عَلَى رُكْبَتِهِ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَجْلِسُ مَعَنَا فَإِذَا أَرَادَ أَنْ يَقُومُ قَامَ وَتَرَكَنَا فَأَنْزَلَ اللَّهُ ‏{وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ وَلاَ تَعْدُ عَيْنَاكَ عَنْهُمْ}‏ وَلاَ تُجَالِسِ الأَشْرَافَ ‏{تُرِيدُ زِينَةَ الْحَيَاةِ الدُّنْيَا وَلاَ تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُ عَنْ ذِكْرِنَا}‏ - يَعْنِي عُيَيْنَةَ وَالأَقْرَعَ - ‏{وَاتَّبَعَ هَوَاهُ وَكَانَ أَمْرُهُ فُرُطًا }‏ - قَالَ هَلاَكًا - قَالَ أَمْرُ عُيَيْنَةَ وَالأَقْرَعِ ‏.‏ ثُمَّ ضَرَبَ لَهُمْ مَثَلَ الرَّجُلَيْنِ وَمَثَلَ الْحَيَاةِ الدُّنْيَا ‏.‏ قَالَ خَبَّابٌ فَكُنَّا نَقْعُدُ مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَإِذَا بَلَغْنَا السَّاعَةَ الَّتِي يَقُومُ فِيهَا قُمْنَا وَتَرَكْنَاهُ حَتَّى يَقُومَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		}
	]
}