{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 63,
			"arabicnumber": 63,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ كَهْمَسِ بْنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَجَاءَ رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ شَدِيدُ سَوَادِ شَعَرِ الرَّأْسِ لاَ يُرَى عَلَيْهِ أَثَرُ السَّفَرِ وَلاَ يَعْرِفُهُ مِنَّا أَحَدٌ ‏.‏ قَالَ فَجَلَسَ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَأَسْنَدَ رُكْبَتَهُ إِلَى رُكْبَتِهِ وَوَضَعَ يَدَيْهِ عَلَى فَخِذَيْهِ ‏.‏ ثُمَّ قَالَ يَا مُحَمَّدُ مَا الإِسْلاَمُ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ وَإِقَامُ الصَّلاَةِ وَإِيتَاءُ الزَّكَاةِ وَصَوْمُ رَمَضَانَ وَحَجُّ الْبَيْتِ ‏\"‏ ‏.‏ قَالَ صَدَقْتَ ‏.‏ فَعَجِبْنَا مِنْهُ يَسْأَلُهُ وَيُصَدِّقُهُ ‏.‏ ثُمَّ قَالَ يَا مُحَمَّدُ مَا الإِيمَانُ قَالَ ‏\"‏ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَرُسُلِهِ وَكُتُبِهِ وَالْيَوْمِ الآخِرِ وَالْقَدَرِ خَيْرِهِ وَشَرِّهِ ‏\"‏ ‏.‏ قَالَ صَدَقْتَ ‏.‏ فَعَجِبْنَا مِنْهُ يَسْأَلُهُ وَيُصَدِّقُهُ ‏.‏ ثُمَّ قَالَ يَا مُحَمَّدُ مَا الإِحْسَانُ قَالَ ‏\"‏ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنَّكَ إِنْ لاَ تَرَاهُ فَإِنَّهُ يَرَاكَ ‏\"‏ ‏.‏ قَالَ فَمَتَى السَّاعَةُ قَالَ ‏\"‏ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ ‏\"‏ ‏.‏ قَالَ فَمَا أَمَارَتُهَا قَالَ ‏\"‏ أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا ‏\"‏ ‏.‏ قَالَ وَكِيعٌ يَعْنِي تَلِدُ الْعَجَمُ الْعَرَبَ ‏\"‏ وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبِنَاءِ ‏\"‏ ‏.‏ قَالَ ثُمَّ قَالَ فَلَقِيَنِي النَّبِيُّ ـ صلى الله عليه وسلم ـ بَعْدَ ثَلاَثٍ فَقَالَ ‏\"‏ أَتَدْرِي مَنِ الرَّجُلُ ‏\"‏ ‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ ذَاكَ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ مَعَالِمَ دِينِكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 63
			}
		}
	]
}