{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1,
			"arabicnumber": 1,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، ح وَحَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُقْبَلُ صَلاَةٌ بِغَيْرِ طُهُورٍ وَلاَ صَدَقَةٌ مِنْ غُلُولٍ ‏\"‏ ‏.‏ قَالَ هَنَّادٌ فِي حَدِيثِهِ ‏\"‏ إِلاَّ بِطُهُورٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا الْحَدِيثُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِ وَأَبِي هُرَيْرَةَ وَأَنَسٍ ‏.‏ وَأَبُو الْمَلِيحِ بْنُ أُسَامَةَ اسْمُهُ عَامِرٌ وَيُقَالُ زَيْدُ بْنُ أُسَامَةَ بْنِ عُمَيْرٍ الْهُذَلِيُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى الْقَزَّازُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ح وَحَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ أَوِ الْمُؤْمِنُ فَغَسَلَ وَجْهَهُ خَرَجَتْ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ أَوْ نَحْوِ هَذَا وَإِذَا غَسَلَ يَدَيْهِ خَرَجَتْ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ حَتَّى يَخْرُجَ نَقِيًّا مِنَ الذُّنُوبِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهُوَ حَدِيثُ مَالِكٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ وَأَبُو صَالِحٍ وَالِدُ سُهَيْلٍ هُوَ أَبُو صَالِحٍ السَّمَّانُ وَاسْمُهُ ذَكْوَانُ ‏.‏ وَأَبُو هُرَيْرَةَ اخْتُلِفَ فِي اسْمِهِ فَقَالُوا عَبْدُ شَمْسٍ وَقَالُوا عَبْدُ اللَّهِ بْنُ عَمْرٍو وَهَكَذَا قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ وَهُوَ الأَصَحُّ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عُثْمَانَ بْنِ عَفَّانَ وَثَوْبَانَ وَالصُّنَابِحِيِّ وَعَمْرِو بْنِ عَبَسَةَ وَسَلْمَانَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ وَالصُّنَابِحِيُّ الَّذِي رَوَى عَنْ أَبِي بَكْرٍ الصِّدِّيقِ لَيْسَ لَهُ سَمَاعٌ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ عُسَيْلَةَ وَيُكْنَى أَبَا عَبْدِ اللَّهِ رَحَلَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُبِضَ النَّبِيُّ صلى الله عليه وسلم وَهُوَ فِي الطَّرِيقِ وَقَدْ رَوَى عَنِ النَّبِيِّ صلى الله عليه وسلم أَحَادِيثَ ‏.‏ وَالصُّنَابِحُ بْنُ الأَعْسَرِ الأَحْمَسِيُّ صَاحِبُ النَّبِيِّ صلى الله عليه وسلم يُقَالُ لَهُ الصُّنَابِحِيُّ أَيْضًا وَإِنَّمَا حَدِيثُهُ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنِّي مُكَاثِرٌ بِكُمُ الأُمَمَ فَلاَ تَقْتَتِلُنَّ بَعْدِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3,
			"arabicnumber": 3,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالُوا حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مِفْتَاحُ الصَّلاَةِ الطُّهُورُ وَتَحْرِيمُهَا التَّكْبِيرُ وَتَحْلِيلُهَا التَّسْلِيمُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا الْحَدِيثُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ ‏.‏ وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ هُوَ صَدُوقٌ وَقَدْ تَكَلَّمَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يَقُولُ كَانَ أَحْمَدُ بْنُ حَنْبَلٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَالْحُمَيْدِيُّ يَحْتَجُّونَ بِحَدِيثِ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ ‏.‏ قَالَ مُحَمَّدٌ وَهُوَ مُقَارِبُ الْحَدِيثِ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ جَابِرٍ وَأَبِي سَعِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4,
			"arabicnumber": 4,
			"text": "حَدَّثَنَا أَبُو بَكْرٍ، مُحَمَّدُ بْنُ زَنْجَوَيْهِ الْبَغْدَادِيُّ وَغَيْرُ وَاحِدٍ قَالَ حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ قَرْمٍ، عَنْ أَبِي يَحْيَى الْقَتَّاتِ، عَنْ مُجَاهِدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهما قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مِفْتَاحُ الْجَنَّةِ الصَّلاَةُ وَمِفْتَاحُ الصَّلاَةِ الْوُضُوءُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5,
			"arabicnumber": 5,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ الْخَلاَءَ قَالَ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ قَالَ شُعْبَةُ وَقَدْ قَالَ مَرَّةً أُخْرَى أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبِيثِ أَوِ الْخُبُثِ وَالْخَبَائِثِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عَلِيٍّ وَزَيْدِ بْنِ أَرْقَمَ وَجَابِرٍ وَابْنِ مَسْعُودٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ ‏.‏ وَحَدِيثُ زَيْدِ بْنِ أَرْقَمَ فِي إِسْنَادِهِ اضْطِرَابٌ رَوَى هِشَامٌ الدَّسْتَوَائِيُّ وَسَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ فَقَالَ سَعِيدٌ عَنِ الْقَاسِمِ بْنِ عَوْفٍ الشَّيْبَانِيِّ عَنْ زَيْدِ بْنِ أَرْقَمَ ‏.‏ وَقَالَ هِشَامٌ الدَّسْتَوَائِيُّ عَنْ قَتَادَةَ عَنْ زَيْدِ بْنِ أَرْقَمَ ‏.‏ وَرَوَاهُ شُعْبَةُ وَمَعْمَرٌ عَنْ قَتَادَةَ عَنِ النَّضْرِ بْنِ أَنَسٍ فَقَالَ شُعْبَةُ عَنْ زَيْدِ بْنِ أَرْقَمَ ‏.‏ وَقَالَ مَعْمَرٌ عَنِ النَّضْرِ بْنِ أَنَسٍ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى سَأَلْتُ مُحَمَّدًا عَنْ هَذَا فَقَالَ يُحْتَمَلُ أَنْ يَكُونَ قَتَادَةُ رَوَى عَنْهُمَا جَمِيعًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6,
			"arabicnumber": 6,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا دَخَلَ الْخَلاَءَ قَالَ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7,
			"arabicnumber": 7,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، عَنْ إِسْرَائِيلَ بْنِ يُونُسَ، عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا خَرَجَ مِنَ الْخَلاَءِ قَالَ ‏ \"‏ غُفْرَانَكَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ إِسْرَائِيلَ عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ ‏.‏ وَأَبُو بُرْدَةَ بْنُ أَبِي مُوسَى اسْمُهُ عَامِرُ بْنُ عَبْدِ اللَّهِ بْنِ قَيْسٍ الأَشْعَرِيُّ ‏.‏ وَلاَ نَعْرِفُ فِي هَذَا الْبَابِ إِلاَّ حَدِيثَ عَائِشَةَ رضى الله عنها عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 8,
			"arabicnumber": 8,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا أَتَيْتُمُ الْغَائِطَ فَلاَ تَسْتَقْبِلُوا الْقِبْلَةَ بِغَائِطٍ وَلاَ بَوْلٍ وَلاَ تَسْتَدْبِرُوهَا وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا ‏\"‏ ‏.‏ فَقَالَ أَبُو أَيُّوبَ فَقَدِمْنَا الشَّأْمَ فَوَجَدْنَا مَرَاحِيضَ قَدْ بُنِيَتْ مُسْتَقْبَلَ الْقِبْلَةِ فَنَنْحَرِفُ عَنْهَا وَنَسْتَغْفِرُ اللَّهَ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيِّ وَمَعْقِلِ بْنِ أَبِي الْهَيْثَمِ وَيُقَالُ مَعْقِلُ بْنُ أَبِي مَعْقِلٍ وَأَبِي أُمَامَةَ وَأَبِي هُرَيْرَةَ وَسَهْلِ بْنِ حُنَيْفٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي أَيُّوبَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ ‏.‏ وَأَبُو أَيُّوبَ اسْمُهُ خَالِدُ بْنُ زَيْدٍ ‏.‏ وَالزُّهْرِيُّ اسْمُهُ مُحَمَّدُ بْنُ مُسْلِمِ بْنِ عُبَيْدِ اللَّهِ بْنِ شِهَابٍ الزُّهْرِيُّ وَكُنْيَتُهُ أَبُو بَكْرٍ ‏.‏ قَالَ أَبُو الْوَلِيدِ الْمَكِّيُّ قَالَ أَبُو عَبْدِ اللَّهِ مُحَمَّدُ بْنُ إِدْرِيسَ الشَّافِعِيُّ إِنَّمَا مَعْنَى قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لاَ تَسْتَقْبِلُوا الْقِبْلَةَ بِغَائِطٍ وَلاَ بِبَوْلٍ وَلاَ تَسْتَدْبِرُوهَا ‏\"‏ ‏.‏ إِنَّمَا هَذَا فِي الْفَيَافِي وَأَمَّا فِي الْكُنُفِ الْمَبْنِيَّةِ لَهُ رُخْصَةٌ فِي أَنْ يَسْتَقْبِلَهَا ‏.‏ وَهَكَذَا قَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ ‏.‏ وَقَالَ أَحْمَدُ بْنُ حَنْبَلٍ رَحِمَهُ اللَّهُ إِنَّمَا الرُّخْصَةُ مِنَ النَّبِيِّ صلى الله عليه وسلم فِي اسْتِدْبَارِ الْقِبْلَةِ بِغَائِطٍ أَوْ بَوْلٍ وَأَمَّا اسْتِقْبَالُ الْقِبْلَةِ فَلاَ يَسْتَقْبِلُهَا ‏.‏ كَأَنَّهُ لَمْ يَرَ فِي الصَّحْرَاءِ وَلاَ فِي الْكُنُفِ أَنْ يَسْتَقْبِلَ الْقِبْلَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 9,
			"arabicnumber": 9,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ أَبَانَ بْنِ صَالِحٍ، عَنْ مُجَاهِدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ نَسْتَقْبِلَ الْقِبْلَةَ بِبَوْلٍ فَرَأَيْتُهُ قَبْلَ أَنْ يُقْبَضَ بِعَامٍ يَسْتَقْبِلُهَا ‏.‏ وَفِي الْبَابِ عَنْ أَبِي قَتَادَةَ وَعَائِشَةَ وَعَمَّارِ بْنِ يَاسِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 10,
			"arabicnumber": 10,
			"text": "وَقَدْ رَوَى هَذَا الْحَدِيثَ ابْنُ لَهِيعَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ أَبِي قَتَادَةَ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم يَبُولُ مُسْتَقْبِلَ الْقِبْلَةِ ‏.‏ حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ ‏.‏ وَحَدِيثُ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَصَحُّ مِنْ حَدِيثِ ابْنِ لَهِيعَةَ ‏.‏ وَابْنُ لَهِيعَةَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ ضَعَّفَهُ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ وَغَيْرُهُ مِنْ قِبَلِ حِفْظِهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 11,
			"arabicnumber": 11,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، عَنِ ابْنِ عُمَرَ، قَالَ رَقِيتُ يَوْمًا عَلَى بَيْتِ حَفْصَةَ فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى حَاجَتِهِ مُسْتَقْبِلَ الشَّأْمِ مُسْتَدْبِرَ الْكَعْبَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 12,
			"arabicnumber": 12,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ مَنْ حَدَّثَكُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَبُولُ قَائِمًا فَلاَ تُصَدِّقُوهُ مَا كَانَ يَبُولُ إِلاَّ قَاعِدًا ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ وَبُرَيْدَةَ وَعَبْدِ الرَّحْمَنِ بْنِ حَسَنَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ ‏.‏ وَحَدِيثُ عُمَرَ إِنَّمَا رُوِيَ مِنْ حَدِيثِ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنْ عُمَرَ قَالَ رَآنِي النَّبِيُّ صلى الله عليه وسلم وَأَنَا أَبُولُ قَائِمًا فَقَالَ ‏ \"‏ يَا عُمَرُ لاَ تَبُلْ قَائِمًا ‏\"‏ ‏.‏ فَمَا بُلْتُ قَائِمًا بَعْدُ ‏.‏ قَالَ أَبُو عِيسَى وَإِنَّمَا رَفَعَ هَذَا الْحَدِيثَ عَبْدُ الْكَرِيمِ بْنُ أَبِي الْمُخَارِقِ وَهُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ ضَعَّفَهُ أَيُّوبُ السَّخْتِيَانِيُّ وَتَكَلَّمَ فِيهِ ‏.‏ وَرَوَى عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ قَالَ عُمَرُ رضى الله عنه مَا بُلْتُ قَائِمًا مُنْذُ أَسْلَمْتُ ‏.‏ وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَبْدِ الْكَرِيمِ وَحَدِيثُ بُرَيْدَةَ فِي هَذَا غَيْرُ مَحْفُوظٍ ‏.‏ وَمَعْنَى النَّهْىِ عَنِ الْبَوْلِ قَائِمًا عَلَى التَّأْدِيبِ لاَ عَلَى التَّحْرِيمِ ‏.‏ وَقَدْ رُوِيَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ إِنَّ مِنَ الْجَفَاءِ أَنْ تَبُولَ وَأَنْتَ قَائِمٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 13,
			"arabicnumber": 13,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَتَى سُبَاطَةَ قَوْمٍ فَبَالَ عَلَيْهَا قَائِمًا فَأَتَيْتُهُ بِوَضُوءٍ فَذَهَبْتُ لأَتَأَخَّرَ عَنْهُ فَدَعَانِي حَتَّى كُنْتُ عِنْدَ عَقِبَيْهِ فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ الْجَارُودَ يَقُولُ سَمِعْتُ وَكِيعًا يُحَدِّثُ بِهَذَا الْحَدِيثِ عَنِ الأَعْمَشِ ‏.‏ ثُمَّ قَالَ وَكِيعٌ هَذَا أَصَحُّ حَدِيثٍ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْمَسْحِ ‏.‏ وَسَمِعْتُ أَبَا عَمَّارٍ الْحُسَيْنَ بْنَ حُرَيْثٍ يَقُولُ سَمِعْتُ وَكِيعًا فَذَكَرَ نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى وَهَكَذَا رَوَى مَنْصُورٌ وَعُبَيْدَةُ الضَّبِّيُّ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ مِثْلَ رِوَايَةِ الأَعْمَشِ ‏.‏ وَرَوَى حَمَّادُ بْنُ أَبِي سُلَيْمَانَ وَعَاصِمُ بْنُ بَهْدَلَةَ عَنْ أَبِي وَائِلٍ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَحَدِيثُ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ أَصَحُّ ‏.‏ وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ فِي الْبَوْلِ قَائِمًا ‏.‏ قَالَ أَبُو عِيسَى وَعَبِيدَةُ بْنُ عَمْرٍو السَّلْمَانِيُّ رَوَى عَنْهُ إِبْرَاهِيمُ النَّخَعِيُّ ‏.‏ وَعَبِيدَةُ مِنْ كِبَارِ التَّابِعِينَ يُرْوَى عَنْ عَبِيدَةَ أَنَّهُ قَالَ أَسْلَمْتُ قَبْلَ وَفَاةِ النَّبِيِّ صلى الله عليه وسلم بِسَنَتَيْنِ ‏.‏ وَعُبَيْدَةُ الضَّبِّيُّ صَاحِبُ إِبْرَاهِيمَ هُوَ عُبَيْدَةُ بْنُ مُعَتِّبٍ الضَّبِّيُّ وَيُكْنَى أَبَا عَبْدِ الْكَرِيمِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 14,
			"arabicnumber": 14,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ حَرْبٍ الْمُلاَئِيُّ، عَنِ الأَعْمَشِ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ الْحَاجَةَ لَمْ يَرْفَعْ ثَوْبَهُ حَتَّى يَدْنُوَ مِنَ الأَرْضِ ‏.‏ قَالَ أَبُو عِيسَى هَكَذَا رَوَى مُحَمَّدُ بْنُ رَبِيعَةَ عَنِ الأَعْمَشِ عَنْ أَنَسٍ هَذَا الْحَدِيثَ ‏.‏ وَرَوَى وَكِيعٌ وَأَبُو يَحْيَى الْحِمَّانِيُّ عَنِ الأَعْمَشِ قَالَ قَالَ ابْنُ عُمَرَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ الْحَاجَةَ لَمْ يَرْفَعْ ثَوْبَهُ حَتَّى يَدْنُوَ مِنَ الأَرْضِ ‏.‏ وَكِلاَ الْحَدِيثَيْنِ مُرْسَلٌ ‏.‏ وَيُقَالُ لَمْ يَسْمَعِ الأَعْمَشُ مِنْ أَنَسٍ وَلاَ مِنْ أَحَدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَقَدْ نَظَرَ إِلَى أَنَسِ بْنِ مَالِكٍ قَالَ رَأَيْتُهُ يُصَلِّي ‏.‏ فَذَكَرَ عَنْهُ حِكَايَةً فِي الصَّلاَةِ ‏.‏ وَالأَعْمَشُ اسْمُهُ سُلَيْمَانُ بْنُ مِهْرَانَ أَبُو مُحَمَّدٍ الْكَاهِلِيُّ وَهُوَ مَوْلًى لَهُمْ ‏.‏ قَالَ الأَعْمَشُ كَانَ أَبِي حَمِيلاً فَوَرَّثَهُ مَسْرُوقٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 15,
			"arabicnumber": 15,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مَعْمَرٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَمَسَّ الرَّجُلُ ذَكَرَهُ بِيَمِينِهِ ‏.‏ وَفِي هَذَا الْبَابِ عَنْ عَائِشَةَ وَسَلْمَانَ وَأَبِي هُرَيْرَةَ وَسَهْلِ بْنِ حُنَيْفٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو قَتَادَةَ الأَنْصَارِيُّ اسْمُهُ الْحَارِثُ بْنُ رِبْعِيٍّ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ كَرِهُوا الاِسْتِنْجَاءَ بِالْيَمِينِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 16,
			"arabicnumber": 16,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ قِيلَ لِسَلْمَانَ قَدْ عَلَّمَكُمْ نَبِيُّكُمْ صلى الله عليه وسلم كُلَّ شَيْءٍ حَتَّى الْخِرَاءَةَ فَقَالَ سَلْمَانُ أَجَلْ نَهَانَا أَنْ نَسْتَقْبِلَ الْقِبْلَةَ بِغَائِطٍ أَوْ بَوْلٍ وَأَنْ نَسْتَنْجِيَ بِالْيَمِينِ أَوْ أَنْ يَسْتَنْجِيَ أَحَدُنَا بِأَقَلَّ مِنْ ثَلاَثَةِ أَحْجَارٍ أَوْ أَنْ نَسْتَنْجِيَ بِرَجِيعٍ أَوْ بِعَظْمٍ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عَائِشَةَ وَخُزَيْمَةَ بْنِ ثَابِتٍ وَجَابِرٍ وَخَلاَّدِ بْنِ السَّائِبِ عَنْ أَبِيهِ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ سَلْمَانَ فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَمَنْ بَعْدَهُمْ رَأَوْا أَنَّ الاِسْتِنْجَاءَ بِالْحِجَارَةِ يُجْزِئُ وَإِنْ لَمْ يَسْتَنْجِ بِالْمَاءِ إِذَا أَنْقَى أَثَرَ الْغَائِطِ وَالْبَوْلِ وَبِهِ يَقُولُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 17,
			"arabicnumber": 17,
			"text": "حَدَّثَنَا هَنَّادٌ، وَقُتَيْبَةُ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم لِحَاجَتِهِ فَقَالَ ‏\"‏ الْتَمِسْ لِي ثَلاَثَةَ أَحْجَارٍ ‏\"‏ ‏.‏ قَالَ فَأَتَيْتُهُ بِحَجَرَيْنِ وَرَوْثَةٍ فَأَخَذَ الْحَجَرَيْنِ وَأَلْقَى الرَّوْثَةَ وَقَالَ ‏\"‏ إِنَّهَا رِكْسٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَكَذَا رَوَى قَيْسُ بْنُ الرَّبِيعِ هَذَا الْحَدِيثَ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ نَحْوَ حَدِيثِ إِسْرَائِيلَ ‏.‏ وَرَوَى مَعْمَرٌ وَعَمَّارُ بْنُ رُزَيْقٍ عَنْ أَبِي إِسْحَاقَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ ‏.‏ وَرَوَى زُهَيْرٌ عَنْ أَبِي إِسْحَاقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ عَنْ أَبِيهِ الأَسْوَدِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ ‏.‏ وَرَوَى زَكَرِيَّا بْنُ أَبِي زَائِدَةَ عَنْ أَبِي إِسْحَاقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنِ الأَسْوَدِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ ‏.‏ وَهَذَا حَدِيثٌ فِيهِ اضْطِرَابٌ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ الْعَبْدِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَأَلْتُ أَبَا عُبَيْدَةَ بْنَ عَبْدِ اللَّهِ هَلْ تَذْكُرُ مِنْ عَبْدِ اللَّهِ شَيْئًا قَالَ لاَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 18,
			"arabicnumber": 18,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنِ الشَّعْبِيِّ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَسْتَنْجُوا بِالرَّوْثِ وَلاَ بِالْعِظَامِ فَإِنَّهُ زَادُ إِخْوَانِكُمْ مِنَ الْجِنِّ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَسَلْمَانَ وَجَابِرٍ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَوَى هَذَا الْحَدِيثَ إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ وَغَيْرُهُ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنِ الشَّعْبِيِّ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّهُ كَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم لَيْلَةَ الْجِنِّ - الْحَدِيثَ بِطُولِهِ - فَقَالَ الشَّعْبِيُّ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَسْتَنْجُوا بِالرَّوْثِ وَلاَ بِالْعِظَامِ فَإِنَّهُ زَادُ إِخْوَانِكُمْ مِنَ الْجِنِّ ‏\"‏ ‏.‏ وَكَأَنَّ رِوَايَةَ إِسْمَاعِيلَ أَصَحُّ مِنْ رِوَايَةِ حَفْصِ بْنِ غِيَاثٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ ‏.‏ وَفِي الْبَابِ عَنْ جَابِرٍ وَابْنِ عُمَرَ رضى الله عنهما ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 19,
			"arabicnumber": 19,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ الْبَصْرِيُّ، قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ مُعَاذَةَ، عَنْ عَائِشَةَ، قَالَتْ مُرْنَ أَزْوَاجَكُنَّ أَنْ يَسْتَطِيبُوا، بِالْمَاءِ فَإِنِّي أَسْتَحْيِيهِمْ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَفْعَلُهُ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ وَأَنَسٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَعَلَيْهِ الْعَمَلُ عِنْدَ أَهْلِ الْعِلْمِ يَخْتَارُونَ الاِسْتِنْجَاءَ بِالْمَاءِ وَإِنْ كَانَ الاِسْتِنْجَاءُ بِالْحِجَارَةِ يُجْزِئُ عِنْدَهُمْ فَإِنَّهُمُ اسْتَحَبُّوا الاِسْتِنْجَاءَ بِالْمَاءِ وَرَأَوْهُ أَفْضَلَ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 20,
			"arabicnumber": 20,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَأَتَى النَّبِيُّ صلى الله عليه وسلم حَاجَتَهُ فَأَبْعَدَ فِي الْمَذْهَبِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي قُرَادٍ وَأَبِي قَتَادَةَ وَجَابِرٍ وَيَحْيَى بْنِ عُبَيْدٍ عَنْ أَبِيهِ وَأَبِي مُوسَى وَابْنِ عَبَّاسٍ وَبِلاَلِ بْنِ الْحَارِثِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَيُرْوَى عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَرْتَادُ لِبَوْلِهِ مَكَانًا كَمَا يَرْتَادُ مَنْزِلاً ‏.‏ وَأَبُو سَلَمَةَ اسْمُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ الزُّهْرِيُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 21,
			"arabicnumber": 21,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، وَأَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى، مَرْدَوَيْهِ قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنْ أَشْعَثَ بْنِ عَبْدِ اللَّهِ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَبُولَ الرَّجُلُ فِي مُسْتَحَمِّهِ ‏.‏ وَقَالَ ‏ \"‏ إِنَّ عَامَّةَ الْوَسْوَاسِ مِنْهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ مَرْفُوعًا إِلاَّ مِنْ حَدِيثِ أَشْعَثَ بْنِ عَبْدِ اللَّهِ وَيُقَالُ لَهُ أَشْعَثُ الأَعْمَى ‏.‏ وَقَدْ كَرِهَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ الْبَوْلَ فِي الْمُغْتَسَلِ وَقَالُوا عَامَّةُ الْوَسْوَاسِ مِنْهُ ‏.‏ وَرَخَّصَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْهُمُ ابْنُ سِيرِينَ وَقِيلَ لَهُ إِنَّهُ يُقَالُ إِنَّ عَامَّةَ الْوَسْوَاسِ مِنْهُ فَقَالَ رَبُّنَا اللَّهُ لاَ شَرِيكَ لَهُ ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ قَدْ وُسِّعَ فِي الْبَوْلِ فِي الْمُغْتَسَلِ إِذَا جَرَى فِيهِ الْمَاءُ ‏.‏ قَالَ أَبُو عِيسَى حَدَّثَنَا بِذَلِكَ أَحْمَدُ بْنُ عَبْدَةَ الآمُلِيُّ عَنْ حِبَّانَ عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 22,
			"arabicnumber": 22,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلاَةٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَوَى هَذَا الْحَدِيثَ مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ زَيْدِ بْنِ خَالِدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَحَدِيثُ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم كِلاَهُمَا عِنْدِي صَحِيحٌ لأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم هَذَا الْحَدِيثُ ‏.‏ وَحَدِيثُ أَبِي هُرَيْرَةَ إِنَّمَا صَحَّ لأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ ‏.‏ وَأَمَّا مُحَمَّدُ بْنُ إِسْمَاعِيلَ فَزَعَمَ أَنَّ حَدِيثَ أَبِي سَلَمَةَ عَنْ زَيْدِ بْنِ خَالِدٍ أَصَحُّ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ وَعَلِيٍّ وَعَائِشَةَ وَابْنِ عَبَّاسٍ وَحُذَيْفَةَ وَزَيْدِ بْنِ خَالِدٍ وَأَنَسٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عُمَرَ وَأُمِّ حَبِيبَةَ وَأَبِي أُمَامَةَ وَأَبِي أَيُّوبَ وَتَمَّامِ بْنِ عَبَّاسٍ وَعَبْدِ اللَّهِ بْنِ حَنْظَلَةَ وَأُمِّ سَلَمَةَ وَوَاثِلَةَ بْنِ الأَسْقَعِ وَأَبِي مُوسَى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 23,
			"arabicnumber": 23,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلاَةٍ وَلأَخَّرْتُ صَلاَةَ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِ ‏\"‏ ‏.‏ قَالَ فَكَانَ زَيْدُ بْنُ خَالِدٍ يَشْهَدُ الصَّلَوَاتِ فِي الْمَسْجِدِ وَسِوَاكُهُ عَلَى أُذُنِهِ مَوْضِعَ الْقَلَمِ مِنْ أُذُنِ الْكَاتِبِ لاَ يَقُومُ إِلَى الصَّلاَةِ إِلاَّ اسْتَنَّ ثُمَّ رَدَّهُ إِلَى مَوْضِعِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 24,
			"arabicnumber": 24,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ، أَحْمَدُ بْنُ بَكَّارٍ الدِّمَشْقِيُّ - يُقَالُ هُوَ مِنْ وَلَدِ بُسْرِ بْنِ أَرْطَاةَ صَاحِبِ النَّبِيِّ صلى الله عليه وسلم حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنِ الأَوْزَاعِيِّ عَنِ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنَ اللَّيْلِ فَلاَ يُدْخِلْ يَدَهُ فِي الإِنَاءِ حَتَّى يُفْرِغَ عَلَيْهَا مَرَّتَيْنِ أَوْ ثَلاَثًا فَإِنَّهُ لاَ يَدْرِي أَيْنَ بَاتَتْ يَدُهُ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَجَابِرٍ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ الشَّافِعِيُّ وَأُحِبُّ لِكُلِّ مَنِ اسْتَيْقَظَ مِنَ النَّوْمِ قَائِلَةً كَانَتْ أَوْ غَيْرَهَا أَنْ لاَ يُدْخِلَ يَدَهُ فِي وَضُوئِهِ حَتَّى يَغْسِلَهَا فَإِنْ أَدْخَلَ يَدَهُ قَبْلَ أَنْ يَغْسِلَهَا كَرِهْتُ ذَلِكَ لَهُ وَلَمْ يُفْسِدْ ذَلِكَ الْمَاءَ إِذَا لَمْ يَكُنْ عَلَى يَدِهِ نَجَاسَةٌ ‏.‏ وَقَالَ أَحْمَدُ بْنُ حَنْبَلٍ إِذَا اسْتَيْقَظَ مِنَ النَّوْمِ مِنَ اللَّيْلِ فَأَدْخَلَ يَدَهُ فِي وَضُوئِهِ قَبْلَ أَنْ يَغْسِلَهَا فَأَعْجَبُ إِلَىَّ أَنْ يُهَرِيقَ الْمَاءَ ‏.‏ وَقَالَ إِسْحَاقُ إِذَا اسْتَيْقَظَ مِنَ النَّوْمِ بِاللَّيْلِ أَوْ بِالنَّهَارِ فَلاَ يُدْخِلْ يَدَهُ فِي وَضُوئِهِ حَتَّى يَغْسِلَهَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 25,
			"arabicnumber": 25,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَبِشْرُ بْنُ مُعَاذٍ الْعَقَدِيُّ، قَالاَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، عَنْ أَبِي ثِفَالٍ الْمُرِّيِّ، عَنْ رَبَاحِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سُفْيَانَ بْنِ حُوَيْطِبٍ، عَنْ جَدَّتِهِ، عَنْ أَبِيهَا، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ وُضُوءَ لِمَنْ لَمْ يَذْكُرِ اسْمَ اللَّهِ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَأَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ وَسَهْلِ بْنِ سَعْدٍ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى قَالَ أَحْمَدُ بْنُ حَنْبَلٍ لاَ أَعْلَمُ فِي هَذَا الْبَابِ حَدِيثًا لَهُ إِسْنَادٌ جَيِّدٌ ‏.‏ وَقَالَ إِسْحَاقُ إِنْ تَرَكَ التَّسْمِيَةَ عَامِدًا أَعَادَ الْوُضُوءَ وَإِنْ كَانَ نَاسِيًا أَوْ مُتَأَوِّلاً أَجْزَأَهُ ‏.‏ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ حَدِيثُ رَبَاحِ بْنِ عَبْدِ الرَّحْمَنِ ‏.‏ قَالَ أَبُو عِيسَى وَرَبَاحُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ جَدَّتِهِ عَنْ أَبِيهَا ‏.‏ وَأَبُوهَا سَعِيدُ بْنُ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ ‏.‏ وَأَبُو ثِفَالٍ الْمُرِّيُّ اسْمُهُ ثُمَامَةُ بْنُ حُصَيْنٍ ‏.‏ وَرَبَاحُ بْنُ عَبْدِ الرَّحْمَنِ هُوَ أَبُو بَكْرِ بْنُ حُوَيْطِبٍ ‏.‏ مِنْهُمْ مَنْ رَوَى هَذَا الْحَدِيثَ فَقَالَ عَنْ أَبِي بَكْرِ بْنِ حُوَيْطِبٍ فَنَسَبَهُ إِلَى جَدِّهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 26,
			"arabicnumber": 26,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ يَزِيدَ بْنِ عِيَاضٍ، عَنْ أَبِي ثِفَالٍ الْمُرِّيِّ، عَنْ رَبَاحِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سُفْيَانَ بْنِ حُوَيْطِبٍ، عَنْ جَدَّتِهِ بِنْتِ سَعِيدِ بْنِ زَيْدٍ، عَنْ أَبِيهَا، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، وَجَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ سَلَمَةَ بْنِ قَيْسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا تَوَضَّأْتَ فَانْتَثِرْ وَإِذَا اسْتَجْمَرْتَ فَأَوْتِرْ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُثْمَانَ وَلَقِيطِ بْنِ صَبِرَةَ وَابْنِ عَبَّاسٍ وَالْمِقْدَامِ بْنِ مَعْدِيكَرِبَ وَوَائِلِ بْنِ حُجْرٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ سَلَمَةَ بْنِ قَيْسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِيمَنْ تَرَكَ الْمَضْمَضَةَ وَالاِسْتِنْشَاقَ فَقَالَتْ طَائِفَةٌ مِنْهُمْ إِذَا تَرَكَهُمَا فِي الْوُضُوءِ حَتَّى صَلَّى أَعَادَ الصَّلاَةَ وَرَأَوْا ذَلِكَ فِي الْوُضُوءِ وَالْجَنَابَةِ سَوَاءً ‏.‏ وَبِهِ يَقُولُ ابْنُ أَبِي لَيْلَى وَعَبْدُ اللَّهِ بْنُ الْمُبَارَكِ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ أَحْمَدُ الاِسْتِنْشَاقُ أَوْكَدُ مِنَ الْمَضْمَضَةِ ‏.‏ قَالَ أَبُو عِيسَى وَقَالَتْ طَائِفَةٌ مِنْ أَهْلِ الْعِلْمِ يُعِيدُ فِي الْجَنَابَةِ وَلاَ يُعِيدُ فِي الْوُضُوءِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَبَعْضِ أَهْلِ الْكُوفَةِ ‏.‏ وَقَالَتْ طَائِفَةٌ لاَ يُعِيدُ فِي الْوُضُوءِ وَلاَ فِي الْجَنَابَةِ لأَنَّهُمَا سُنَّةٌ مِنَ النَّبِيِّ صلى الله عليه وسلم فَلاَ تَجِبُ الإِعَادَةُ عَلَى مَنْ تَرَكَهُمَا فِي الْوُضُوءِ وَلاَ فِي الْجَنَابَةِ ‏.‏ وَهُوَ قَوْلُ مَالِكٍ وَالشَّافِعِيِّ فِي آخِرَةٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 28,
			"arabicnumber": 28,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مَضْمَضَ وَاسْتَنْشَقَ مِنْ كَفٍّ وَاحِدٍ فَعَلَ ذَلِكَ ثَلاَثًا ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ عَبْدِ اللَّهِ بْنِ زَيْدٍ حَسَنٌ غَرِيبٌ ‏.‏ وَقَدْ رَوَى مَالِكٌ وَابْنُ عُيَيْنَةَ وَغَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ عَمْرِو بْنِ يَحْيَى وَلَمْ يَذْكُرُوا هَذَا الْحَرْفَ أَنَّ النَّبِيَّ صلى الله عليه وسلم مَضْمَضَ وَاسْتَنْشَقَ مِنْ كَفٍّ وَاحِدٍ ‏.‏ وَإِنَّمَا ذَكَرَهُ خَالِدُ بْنُ عَبْدِ اللَّهِ ‏.‏ وَخَالِدُ بْنُ عَبْدِ اللَّهِ ثِقَةٌ حَافِظٌ عِنْدَ أَهْلِ الْحَدِيثِ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ الْمَضْمَضَةُ وَالاِسْتِنْشَاقُ مِنْ كَفٍّ وَاحِدٍ يُجْزِئُ وَقَالَ بَعْضُهُمْ تَفْرِيقُهُمَا أَحَبُّ إِلَيْنَا ‏.‏ وَقَالَ الشَّافِعِيُّ إِنْ جَمَعَهُمَا فِي كَفٍّ وَاحِدٍ فَهُوَ جَائِزٌ وَإِنْ فَرَّقَهُمَا فَهُوَ أَحَبُّ إِلَيْنَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 29,
			"arabicnumber": 29,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ أَبِي أُمَيَّةَ، عَنْ حَسَّانَ بْنِ بِلاَلٍ، قَالَ رَأَيْتُ عَمَّارَ بْنَ يَاسِرٍ تَوَضَّأَ فَخَلَّلَ لِحْيَتَهُ فَقِيلَ لَهُ أَوْ قَالَ فَقُلْتُ لَهُ أَتُخَلِّلُ لِحْيَتَكَ قَالَ وَمَا يَمْنَعُنِي وَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُخَلِّلُ لِحْيَتَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 30,
			"arabicnumber": 30,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ حَسَّانَ بْنِ بِلاَلٍ، عَنْ عَمَّارٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عُثْمَانَ وَعَائِشَةَ وَأُمِّ سَلَمَةَ وَأَنَسٍ وَابْنِ أَبِي أَوْفَى وَأَبِي أَيُّوبَ ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ إِسْحَاقَ بْنَ مَنْصُورٍ يَقُولُ قَالَ أَحْمَدُ بْنُ حَنْبَلٍ قَالَ ابْنُ عُيَيْنَةَ لَمْ يَسْمَعْ عَبْدُ الْكَرِيمِ مِنْ حَسَّانَ بْنِ بِلاَلٍ حَدِيثَ التَّخْلِيلِ ‏.‏ وَقَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ حَدِيثُ عَامِرِ بْنِ شَقِيقٍ عَنْ أَبِي وَائِلٍ عَنْ عُثْمَانَ ‏.‏ قَالَ أَبُو عِيسَى وَقَالَ بِهَذَا أَكْثَرُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَمَنْ بَعْدَهُمْ رَأَوْا تَخْلِيلَ اللِّحْيَةِ ‏.‏ وَبِهِ يَقُولُ الشَّافِعِيُّ ‏.‏ وَقَالَ أَحْمَدُ إِنْ سَهَا عَنْ تَخْلِيلِ اللِّحْيَةِ فَهُوَ جَائِزٌ ‏.‏ وَقَالَ إِسْحَاقُ إِنْ تَرَكَهُ نَاسِيًا أَوْ مُتَأَوِّلاً أَجْزَأَهُ وَإِنْ تَرَكَهُ عَامِدًا أَعَادَ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 31,
			"arabicnumber": 31,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ إِسْرَائِيلَ، عَنْ عَامِرِ بْنِ شَقِيقٍ، عَنْ أَبِي وَائِلٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُخَلِّلُ لِحْيَتَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 32,
			"arabicnumber": 32,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى الْقَزَّازُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَسَحَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ بَدَأَ بِمُقَدَّمِ رَأْسِهِ ثُمَّ ذَهَبَ بِهِمَا إِلَى قَفَاهُ ثُمَّ رَدَّهُمَا حَتَّى رَجَعَ إِلَى الْمَكَانِ الَّذِي بَدَأَ مِنْهُ ثُمَّ غَسَلَ رِجْلَيْهِ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ مُعَاوِيَةَ وَالْمِقْدَامِ بْنِ مَعْدِيكَرِبَ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ زَيْدٍ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 33,
			"arabicnumber": 33,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ بْنِ عَفْرَاءَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَسَحَ بِرَأْسِهِ مَرَّتَيْنِ بَدَأَ بِمُؤَخَّرِ رَأْسِهِ ثُمَّ بِمُقَدَّمِهِ وَبِأُذُنَيْهِ كِلْتَيْهِمَا ظُهُورِهِمَا وَبُطُونِهِمَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَحَدِيثُ عَبْدِ اللَّهِ بْنِ زَيْدٍ أَصَحُّ مِنْ هَذَا وَأَجْوَدُ إِسْنَادًا ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْكُوفَةِ إِلَى هَذَا الْحَدِيثِ مِنْهُمْ وَكِيعُ بْنُ الْجَرَّاحِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 34,
			"arabicnumber": 34,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا بَكْرُ بْنُ مُضَرَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ بْنِ عَفْرَاءَ، أَنَّهَا رَأَتِ النَّبِيَّ صلى الله عليه وسلم يَتَوَضَّأُ قَالَتْ مَسَحَ رَأْسَهُ وَمَسَحَ مَا أَقْبَلَ مِنْهُ وَمَا أَدْبَرَ وَصُدْغَيْهِ وَأُذُنَيْهِ مَرَّةً وَاحِدَةً ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَجَدِّ طَلْحَةَ بْنِ مُصَرِّفِ بْنِ عَمْرٍو ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ الرُّبَيِّعِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ مَسَحَ بِرَأْسِهِ مَرَّةً ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَمَنْ بَعْدَهُمْ ‏.‏ وَبِهِ يَقُولُ جَعْفَرُ بْنُ مُحَمَّدٍ وَسُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ رَأَوْا مَسْحَ الرَّأْسِ مَرَّةً وَاحِدَةً ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الْمَكِّيُّ قَالَ سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ يَقُولُ سَأَلْتُ جَعْفَرَ بْنَ مُحَمَّدٍ عَنْ مَسْحِ الرَّأْسِ أَيُجْزِئُ مَرَّةً فَقَالَ إِي وَاللَّهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 35,
			"arabicnumber": 35,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، عَنْ حَبَّانَ بْنِ وَاسِعٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ وَأَنَّهُ مَسَحَ رَأْسَهُ بِمَاءٍ غَيْرِ فَضْلِ يَدَيْهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى ابْنُ لَهِيعَةَ هَذَا الْحَدِيثَ عَنْ حَبَّانَ بْنِ وَاسِعٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ وَأَنَّهُ مَسَحَ رَأْسَهُ بِمَاءٍ غَبَرَ مِنْ فَضْلِ يَدَيْهِ ‏\"‏ ‏.‏ وَرِوَايَةُ عَمْرِو بْنِ الْحَارِثِ عَنْ حَبَّانَ أَصَحُّ لأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ هَذَا الْحَدِيثُ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ وَغَيْرِهِ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَخَذَ لِرَأْسِهِ مَاءً جَدِيدًا ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ رَأَوْا أَنْ يَأْخُذَ لِرَأْسِهِ مَاءً جَدِيدًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 36,
			"arabicnumber": 36,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَسَحَ بِرَأْسِهِ وَأُذُنَيْهِ ظَاهِرِهِمَا وَبَاطِنِهِمَا ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنِ الرُّبَيِّعِ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَرَوْنَ مَسْحَ الأُذُنَيْنِ ظُهُورِهِمَا وَبُطُونِهِمَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 37,
			"arabicnumber": 37,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ سِنَانِ بْنِ رَبِيعَةَ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي أُمَامَةَ، قَالَ تَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم فَغَسَلَ وَجْهَهُ ثَلاَثًا وَيَدَيْهِ ثَلاَثًا وَمَسَحَ بِرَأْسِهِ وَقَالَ ‏ \"‏ الأُذُنَانِ مِنَ الرَّأْسِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى قَالَ قُتَيْبَةُ قَالَ حَمَّادٌ لاَ أَدْرِي هَذَا مِنْ قَوْلِ النَّبِيِّ صلى الله عليه وسلم أَوْ مِنْ قَوْلِ أَبِي أُمَامَةَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ لَيْسَ إِسْنَادُهُ بِذَاكَ الْقَائِمِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَمَنْ بَعْدَهُمْ أَنَّ الأُذُنَيْنِ مِنَ الرَّأْسِ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مَا أَقْبَلَ مِنَ الأُذُنَيْنِ فَمِنَ الْوَجْهِ وَمَا أَدْبَرَ فَمِنَ الرَّأْسِ ‏.‏ قَالَ إِسْحَاقُ وَأَخْتَارُ أَنْ يَمْسَحَ مُقَدَّمَهُمَا مَعَ الْوَجْهِ وَمُؤَخَّرَهُمَا مَعَ رَأْسِهِ ‏.‏ وَقَالَ الشَّافِعِيُّ هُمَا سُنَّةٌ عَلَى حِيَالِهِمَا يَمْسَحُهُمَا بِمَاءٍ جَدِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 38,
			"arabicnumber": 38,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي هَاشِمٍ، عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبِرَةَ، عَنْ أَبِيهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا تَوَضَّأْتَ فَخَلِّلِ الأَصَابِعَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَالْمُسْتَوْرِدِ وَهُوَ ابْنُ شَدَّادٍ الْفِهْرِيُّ وَأَبِي أَيُّوبَ الأَنْصَارِيِّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُ يُخَلِّلُ أَصَابِعَ رِجْلَيْهِ فِي الْوُضُوءِ ‏.‏ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ إِسْحَاقُ يُخَلِّلُ أَصَابِعَ يَدَيْهِ وَرِجْلَيْهِ فِي الْوُضُوءِ ‏.‏ وَأَبُو هَاشِمٍ اسْمُهُ إِسْمَاعِيلُ بْنُ كَثِيرٍ الْمَكِّيُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 39,
			"arabicnumber": 39,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ، هُوَ الْجَوْهَرِيُّ حَدَّثَنَا سَعْدُ بْنُ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ صَالِحٍ، مَوْلَى التَّوْأَمَةِ عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا تَوَضَّأْتَ فَخَلِّلْ بَيْنَ أَصَابِعِ يَدَيْكَ وَرِجْلَيْكَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 40,
			"arabicnumber": 40,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ يَزِيدَ بْنِ عَمْرٍو، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنِ الْمُسْتَوْرِدِ بْنِ شَدَّادٍ الْفِهْرِيِّ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا تَوَضَّأَ دَلَكَ أَصَابِعَ رِجْلَيْهِ بِخِنْصَرِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ ابْنِ لَهِيعَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 41,
			"arabicnumber": 41,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَعَائِشَةَ وَجَابِرٍ وَعَبْدِ اللَّهِ بْنِ الْحَارِثِ هُوَ ابْنُ جَزْءٍ الزُّبَيْدِيُّ وَمُعَيْقِيبٍ وَخَالِدِ بْنِ الْوَلِيدِ وَشُرَحْبِيلَ بْنِ حَسَنَةَ وَعَمْرِو بْنِ الْعَاصِ وَيَزِيدَ بْنِ أَبِي سُفْيَانَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ وَيْلٌ لِلأَعْقَابِ وَبُطُونِ الأَقْدَامِ مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ وَفِقْهُ هَذَا الْحَدِيثِ أَنَّهُ لاَ يَجُوزُ الْمَسْحُ عَلَى الْقَدَمَيْنِ إِذَا لَمْ يَكُنْ عَلَيْهِمَا خُفَّانِ أَوْ جَوْرَبَانِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 42,
			"arabicnumber": 42,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَهَنَّادٌ، وَقُتَيْبَةُ، قَالُوا حَدَّثَنَا وِكِيعٌ، عَنْ سُفْيَانَ، ح قَالَ وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ مَرَّةً مَرَّةً ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عُمَرَ وَجَابِرٍ وَبُرَيْدَةَ وَأَبِي رَافِعٍ وَابْنِ الْفَاكِهِ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ ابْنِ عَبَّاسٍ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ ‏.‏ وَرَوَى رِشْدِينُ بْنُ سَعْدٍ وَغَيْرُهُ هَذَا الْحَدِيثَ عَنِ الضَّحَّاكِ بْنِ شُرَحْبِيلَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ الْخَطَّابِ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ مَرَّةً مَرَّةً ‏.‏ قَالَ وَلَيْسَ هَذَا بِشَيْءٍ وَالصَّحِيحُ مَا رَوَى ابْنُ عَجْلاَنَ وَهِشَامُ بْنُ سَعْدٍ وَسُفْيَانُ الثَّوْرِيُّ وَعَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 43,
			"arabicnumber": 43,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ ثَابِتِ بْنِ ثَوْبَانَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْفَضْلِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، هُوَ الأَعْرَجُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ مَرَّتَيْنِ مَرَّتَيْنِ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ ابْنِ ثَوْبَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ وَهُوَ إِسْنَادٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَوَى هَمَّامٌ عَنْ عَامِرٍ الأَحْوَلِ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ ثَلاَثًا ثَلاَثًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 44,
			"arabicnumber": 44,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي حَيَّةَ، عَنْ عَلِيٍّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ ثَلاَثًا ثَلاَثًا ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عُثْمَانَ وَعَائِشَةَ وَالرُّبَيِّعِ وَابْنِ عُمَرَ وَأَبِي أُمَامَةَ وَأَبِي رَافِعٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَمُعَاوِيَةَ وَأَبِي هُرَيْرَةَ وَجَابِرٍ وَعَبْدِ اللَّهِ بْنِ زَيْدٍ وَأُبَىِّ بْنِ كَعْبٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ لأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عَلِيٍّ رِضْوَانُ اللَّهِ عَلَيْهِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ أَنَّ الْوُضُوءَ يُجْزِئُ مَرَّةً مَرَّةً وَمَرَّتَيْنِ أَفْضَلُ وَأَفْضَلُهُ ثَلاَثٌ وَلَيْسَ بَعْدَهُ شَيْءٌ ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ لاَ آمَنُ إِذَا زَادَ فِي الْوُضُوءِ عَلَى الثَّلاَثِ أَنْ يَأْثَمَ ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ لاَ يَزِيدُ عَلَى الثَّلاَثِ إِلاَّ رَجُلٌ مُبْتَلًى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 45,
			"arabicnumber": 45,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى الْفَزَارِيُّ، حَدَّثَنَا شَرِيكٌ، عَنْ ثَابِتِ بْنِ أَبِي صَفِيَّةَ، قَالَ قُلْتُ لأَبِي جَعْفَرٍ حَدَّثَكَ جَابِرٌ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ مَرَّةً مَرَّةً وَمَرَّتَيْنِ مَرَّتَيْنِ وَثَلاَثًا ثَلاَثًا قَالَ نَعَمْ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 46,
			"arabicnumber": 46,
			"text": "قَالَ أَبُو عِيسَى وَرَوَى وَكِيعٌ، هَذَا الْحَدِيثَ عَنْ ثَابِتِ بْنِ أَبِي صَفِيَّةَ، قَالَ قُلْتُ لأَبِي جَعْفَرٍ حَدَّثَكَ جَابِرٌ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ مَرَّةً مَرَّةً قَالَ نَعَمْ ‏.‏ حَدَّثَنَا بِذَلِكَ هَنَّادٌ وَقُتَيْبَةُ قَالاَ حَدَّثَنَا وَكِيعٌ عَنْ ثَابِتِ بْنِ أَبِي صَفِيَّةَ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ مِنْ حَدِيثِ شَرِيكٍ لأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ هَذَا عَنْ ثَابِتٍ نَحْوَ رِوَايَةِ وَكِيعٍ ‏.‏ وَشَرِيكٌ كَثِيرُ الْغَلَطِ وَثَابِتُ بْنُ أَبِي صَفِيَّةَ هُوَ أَبُو حَمْزَةَ الثُّمَالِيُّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 47,
			"arabicnumber": 47,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ فَغَسَلَ وَجْهَهُ ثَلاَثًا وَغَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ وَمَسَحَ بِرَأْسِهِ وَغَسَلَ رِجْلَيْهِ مَرَّتَيْنِ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ ذُكِرَ فِي غَيْرِ حَدِيثٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ بَعْضَ وُضُوئِهِ مَرَّةً وَبَعْضَهُ ثَلاَثًا ‏.‏ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي ذَلِكَ لَمْ يَرَوْا بَأْسًا أَنْ يَتَوَضَّأَ الرَّجْلُ بَعْضَ وُضُوئِهِ ثَلاَثًا وَبَعْضَهُ مَرَّتَيْنِ أَوْ مَرَّةً ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 48,
			"arabicnumber": 48,
			"text": "حَدَّثَنَا هَنَّادٌ، وَقُتَيْبَةُ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي حَيَّةَ، قَالَ رَأَيْتُ عَلِيًّا تَوَضَّأَ فَغَسَلَ كَفَّيْهِ حَتَّى أَنْقَاهُمَا ثُمَّ مَضْمَضَ ثَلاَثًا وَاسْتَنْشَقَ ثَلاَثًا وَغَسَلَ وَجْهَهُ ثَلاَثًا وَذِرَاعَيْهِ ثَلاَثًا وَمَسَحَ بِرَأْسِهِ مَرَّةً ثُمَّ غَسَلَ قَدَمَيْهِ إِلَى الْكَعْبَيْنِ ثُمَّ قَامَ فَأَخَذَ فَضْلَ طَهُورِهِ فَشَرِبَهُ وَهُوَ قَائِمٌ ثُمَّ قَالَ أَحْبَبْتُ أَنْ أُرِيَكُمْ كَيْفَ كَانَ طُهُورُ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عُثْمَانَ وَعَبْدِ اللَّهِ بْنِ زَيْدٍ وَابْنِ عَبَّاسٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَالرُّبَيِّعِ وَعَبْدِ اللَّهِ بْنِ أُنَيْسٍ وَعَائِشَةَ رِضْوَانُ اللَّهِ عَلَيْهِمْ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 49,
			"arabicnumber": 49,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ خَيْرٍ، ذَكَرَ عَنْ عَلِيٍّ، مِثْلَ حَدِيثِ أَبِي حَيَّةَ إِلاَّ أَنَّ عَبْدَ خَيْرٍ، قَالَ كَانَ إِذَا فَرَغَ مِنْ طُهُورِهِ أَخَذَ مِنْ فَضْلِ طَهُورِهِ بِكَفِّهِ فَشَرِبَهُ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ رَوَاهُ أَبُو إِسْحَاقَ الْهَمْدَانِيُّ عَنْ أَبِي حَيَّةَ وَعَبْدِ خَيْرٍ وَالْحَارِثِ عَنْ عَلِيٍّ وَقَدْ رَوَى زَائِدَةُ بْنُ قُدَامَةَ وَغَيْرُ وَاحِدٍ عَنْ خَالِدِ بْنِ عَلْقَمَةَ عَنْ عَبْدِ خَيْرٍ عَنْ عَلِيٍّ رضى الله عنه حَدِيثَ الْوُضُوءِ بِطُولِهِ ‏.‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ خَالِدِ بْنِ عَلْقَمَةَ فَأَخْطَأَ فِي اسْمِهِ وَاسْمِ أَبِيهِ فَقَالَ مَالِكُ بْنُ عُرْفُطَةَ عَنْ عَبْدِ خَيْرٍ عَنْ عَلِيٍّ ‏.‏ قَالَ وَرُوِيَ عَنْ أَبِي عَوَانَةَ عَنْ خَالِدِ بْنِ عَلْقَمَةَ عَنْ عَبْدِ خَيْرٍ عَنْ عَلِيٍّ ‏.‏ قَالَ وَرُوِيَ عَنْهُ عَنْ مَالِكِ بْنِ عُرْفُطَةَ مِثْلَ رِوَايَةِ شُعْبَةَ وَالصَّحِيحُ خَالِدُ بْنُ عَلْقَمَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 50,
			"arabicnumber": 50,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَأَحْمَدُ بْنُ أَبِي عُبَيْدِ اللَّهِ السَّلِيمِيُّ الْبَصْرِيُّ، قَالاَ حَدَّثَنَا أَبُو قُتَيْبَةَ، سَلْمُ بْنُ قُتَيْبَةَ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْهَاشِمِيِّ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ جَاءَنِي جِبْرِيلُ فَقَالَ يَا مُحَمَّدُ إِذَا تَوَضَّأْتَ فَانْتَضِحْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ قَالَ وَسَمِعْتُ مُحَمَّدًا يَقُولُ الْحَسَنُ بْنُ عَلِيٍّ الْهَاشِمِيُّ مُنْكَرُ الْحَدِيثِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي الْحَكَمِ بْنِ سُفْيَانَ وَابْنِ عَبَّاسٍ وَزَيْدِ بْنِ حَارِثَةَ وَأَبِي سَعِيدٍ الْخُدْرِيِّ ‏.‏ وَقَالَ بَعْضُهُمْ سُفْيَانُ بْنُ الْحَكَمِ أَوِ الْحَكَمُ بْنُ سُفْيَانَ وَاضْطَرَبُوا فِي هَذَا الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 51,
			"arabicnumber": 51,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنِ جَعْفَرٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَلاَ أَدُلُّكُمْ عَلَى مَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ ‏\"‏ ‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ وَانْتِظَارُ الصَّلاَةِ بَعْدَ الصَّلاَةِ فَذَلِكُمُ الرِّبَاطُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 52,
			"arabicnumber": 52,
			"text": "وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنِ الْعَلاَءِ، نَحْوَهُ ‏.‏ وَقَالَ قُتَيْبَةُ فِي حَدِيثِهِ ‏ \"‏ فَذَلِكُمُ الرِّبَاطُ فَذَلِكُمُ الرِّبَاطُ فَذَلِكُمُ الرِّبَاطُ ‏\"‏ ‏.‏ ثَلاَثًا ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عَلِيٍّ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عَبَّاسٍ وَعَبِيدَةَ وَيُقَالُ عُبَيْدَةُ بْنِ عَمْرٍو وَعَائِشَةَ وَعَبْدِ الرَّحْمَنِ بْنِ عَائِشٍ الْحَضْرَمِيِّ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ أَبِي هُرَيْرَةَ فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَلاَءُ بْنُ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ يَعْقُوبَ الْجُهَنِيُّ الْحُرَقِيُّ وَهُوَ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 53,
			"arabicnumber": 53,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعِ بْنِ الْجَرَّاحِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ زَيْدِ بْنِ حُبَابٍ، عَنْ أَبِي مُعَاذٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم خِرْقَةٌ يُنَشِّفُ بِهَا بَعْدَ الْوُضُوءِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ لَيْسَ بِالْقَائِمِ وَلاَ يَصِحُّ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا الْبَابِ شَيْءٌ ‏.‏ وَأَبُو مُعَاذٍ يَقُولُونَ هُوَ سُلَيْمَانُ بْنُ أَرْقَمَ وَهُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ مُعَاذِ بْنِ جَبَلٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 54,
			"arabicnumber": 54,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادِ بْنِ أَنْعُمٍ، عَنْ عُتْبَةَ بْنِ حُمَيْدٍ، عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا تَوَضَّأَ مَسَحَ وَجْهَهُ بِطَرَفِ ثَوْبِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَإِسْنَادُهُ ضَعِيفٌ ‏.‏ وَرِشْدِينُ بْنُ سَعْدٍ وَعَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمٍ الإِفْرِيقِيُّ يُضَعَّفَانِ فِي الْحَدِيثِ ‏.‏ وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَمَنْ بَعْدَهُمْ فِي التَّمَنْدُلِ بَعْدَ الْوُضُوءِ وَمَنْ كَرِهَهُ إِنَّمَا كَرِهَهُ مِنْ قِبَلِ أَنَّهُ قِيلَ إِنَّ الْوَضُوءَ يُوزَنُ ‏.‏ وَرُوِيَ ذَلِكَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَالزُّهْرِيِّ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا جَرِيرٌ قَالَ حَدَّثَنِيهِ عَلِيُّ بْنُ مُجَاهِدٍ عَنِّي وَهُوَ عِنْدِي ثِقَةٌ عَنْ ثَعْلَبَةَ عَنِ الزُّهْرِيِّ قَالَ إِنَّمَا كُرِهَ الْمِنْدِيلُ بَعْدَ الْوُضُوءِ لأَنَّ الْوَضُوءَ يُوزَنُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 55,
			"arabicnumber": 55,
			"text": "حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ عِمْرَانَ الثَّعْلَبِيُّ الْكُوفِيُّ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ الدِّمَشْقِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، وَأَبِي، عُثْمَانَ عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ فُتِحَتْ لَهُ ثَمَانِيَةُ أَبْوَابِ الْجَنَّةِ يَدْخُلُ مِنْ أَيِّهَا شَاءَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ أَنَسٍ وَعُقْبَةَ بْنِ عَامِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عُمَرَ قَدْ خُولِفَ زَيْدُ بْنُ حُبَابٍ فِي هَذَا الْحَدِيثِ ‏.‏ قَالَ وَرَوَى عَبْدُ اللَّهِ بْنُ صَالِحٍ وَغَيْرُهُ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ رَبِيعَةَ بْنِ يَزِيدَ عَنْ أَبِي إِدْرِيسَ عَنْ عُقْبَةَ بْنِ عَامِرٍ عَنْ عُمَرَ ‏.‏ وَعَنْ رَبِيعَةَ عَنْ أَبِي عُثْمَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ عُمَرَ ‏.‏ وَهَذَا حَدِيثٌ فِي إِسْنَادِهِ اضْطِرَابٌ وَلاَ يَصِحُّ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا الْبَابِ كَبِيرُ شَيْءٍ ‏.‏ قَالَ مُحَمَّدٌ وَأَبُو إِدْرِيسَ لَمْ يَسْمَعْ مِنْ عُمَرَ شَيْئًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 56,
			"arabicnumber": 56,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ أَبِي رَيْحَانَةَ، عَنْ سَفِينَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَوَضَّأُ بِالْمُدِّ وَيَغْتَسِلُ بِالصَّاعِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَجَابِرٍ وَأَنَسِ بْنِ مَالِكٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ سَفِينَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو رَيْحَانَةَ اسْمُهُ عَبْدُ اللَّهِ بْنُ مَطَرٍ ‏.‏ وَهَكَذَا رَأَى بَعْضُ أَهْلِ الْعِلْمِ الْوُضُوءَ بِالْمُدِّ وَالْغُسْلَ بِالصَّاعِ ‏.‏ وَقَالَ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ لَيْسَ مَعْنَى هَذَا الْحَدِيثِ عَلَى التَّوْقِيتِ أَنَّهُ لاَ يَجُوزُ أَكْثَرُ مِنْهُ وَلاَ أَقَلُّ مِنْهُ وَهُوَ قَدْرُ مَا يَكْفِي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 57,
			"arabicnumber": 57,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا خَارِجَةُ بْنُ مُصْعَبٍ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنِ الْحَسَنِ، عَنْ عُتَىِّ بْنِ ضَمْرَةَ السَّعْدِيِّ، عَنْ أُبَىِّ بْنِ كَعْبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ لِلْوُضُوءِ شَيْطَانًا يُقَالُ لَهُ الْوَلْهَانُ فَاتَّقُوا وَسْوَاسَ الْمَاءِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَعَبْدِ اللَّهِ بْنِ مُغَفَّلٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أُبَىِّ بْنِ كَعْبٍ حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ وَالصَّحِيحِ عِنْدَ أَهْلِ الْحَدِيثِ لأَنَّا لاَ نَعْلَمُ أَحَدًا أَسْنَدَهُ غَيْرَ خَارِجَةَ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنِ الْحَسَنِ قَوْلَهُ وَلاَ يَصِحُّ فِي هَذَا الْبَابِ عَنِ النَّبِيِّ صلى الله عليه وسلم شَيْءٌ ‏.‏ وَخَارِجَةُ لَيْسَ بِالْقَوِيِّ عِنْدَ أَصْحَابِنَا وَضَعَّفَهُ ابْنُ الْمُبَارَكِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 58,
			"arabicnumber": 58,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَوَضَّأُ لِكُلِّ صَلاَةٍ طَاهِرًا أَوْ غَيْرَ طَاهِرٍ ‏.‏ قَالَ قُلْتُ لأَنَسٍ فَكَيْفَ كُنْتُمْ تَصْنَعُونَ أَنْتُمْ قَالَ كُنَّا نَتَوَضَّأُ وُضُوءًا وَاحِدًا ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ حُمَيْدٍ عَنْ أَنَسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَالْمَشْهُورُ عِنْدَ أَهْلِ الْحَدِيثِ حَدِيثُ عَمْرِو بْنِ عَامِرٍ الأَنْصَارِيِّ عَنْ أَنَسٍ ‏.‏ وَقَدْ كَانَ بَعْضُ أَهْلِ الْعِلْمِ يَرَى الْوُضُوءَ لِكُلِّ صَلاَةٍ اسْتِحْبَابًا لاَ عَلَى الْوُجُوبِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 59,
			"arabicnumber": 59,
			"text": "وَقَدْ رُوِيَ فِي، حَدِيثٍ عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ مَنْ تَوَضَّأَ عَلَى طُهْرٍ كَتَبَ اللَّهُ لَهُ بِهِ عَشْرَ حَسَنَاتٍ ‏\"‏ ‏.‏ قَالَ وَرَوَى هَذَا الْحَدِيثَ الإِفْرِيقِيُّ عَنْ أَبِي غُطَيْفٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ حَدَّثَنَا بِذَلِكَ الْحُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ الْوَاسِطِيُّ عَنِ الإِفْرِيقِيِّ ‏.‏ وَهُوَ إِسْنَادٌ ضَعِيفٌ ‏.‏ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ ذُكِرَ لِهِشَامِ بْنِ عُرْوَةَ هَذَا الْحَدِيثُ فَقَالَ هَذَا إِسْنَادٌ مَشْرِقِيٌّ ‏.‏ قَالَ سَمِعْتُ أَحْمَدَ بْنَ الْحَسَنِ يَقُولُ سَمِعْتُ أَحْمَدَ بْنَ حَنْبَلٍ يَقُولُ مَا رَأَيْتُ بِعَيْنِي مِثْلَ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 60,
			"arabicnumber": 60,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ، هُوَ ابْنُ مَهْدِيٍّ قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ، عَنْ عَمْرِو بْنِ عَامِرٍ الأَنْصَارِيِّ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَوَضَّأُ عِنْدَ كُلِّ صَلاَةٍ ‏.‏ قُلْتُ فَأَنْتُمْ مَا كُنْتُمْ تَصْنَعُونَ قَالَ كُنَّا نُصَلِّي الصَّلَوَاتِ كُلَّهَا بِوُضُوءٍ وَاحِدٍ مَا لَمْ نُحْدِثْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 61,
			"arabicnumber": 61,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَوَضَّأُ لِكُلِّ صَلاَةٍ فَلَمَّا كَانَ عَامُ الْفَتْحِ صَلَّى الصَّلَوَاتِ كُلَّهَا بِوُضُوءٍ وَاحِدٍ وَمَسَحَ عَلَى خُفَّيْهِ ‏.‏ فَقَالَ عُمَرُ إِنَّكَ فَعَلْتَ شَيْئًا لَمْ تَكُنْ فَعَلْتَهُ ‏.‏ قَالَ ‏\"‏ عَمْدًا فَعَلْتُهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى هَذَا الْحَدِيثَ عَلِيُّ بْنُ قَادِمٍ عَنْ سُفْيَانَ الثَّوْرِيِّ وَزَادَ فِيهِ ‏\"‏ تَوَضَّأَ مَرَّةً مَرَّةً ‏\"‏ ‏.‏ قَالَ وَرَوَى سُفْيَانُ الثَّوْرِيُّ هَذَا الْحَدِيثَ أَيْضًا عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَوَضَّأُ لِكُلِّ صَلاَةٍ ‏.‏ وَرَوَاهُ وَكِيعٌ عَنْ سُفْيَانَ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ ‏.‏ قَالَ وَرَوَاهُ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَغَيْرُهُ عَنْ سُفْيَانَ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً وَهَذَا أَصَحُّ مِنْ حَدِيثِ وَكِيعٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُ يُصَلِّي الصَّلَوَاتِ بِوُضُوءٍ وَاحِدٍ مَا لَمْ يُحْدِثْ وَكَانَ بَعْضُهُمْ يَتَوَضَّأُ لِكُلِّ صَلاَةٍ اسْتِحْبَابًا وَإِرَادَةَ الْفَضْلِ ‏.‏ وَيُرْوَى عَنِ الإِفْرِيقِيِّ عَنْ أَبِي غُطَيْفٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَوَضَّأَ عَلَى طُهْرٍ كَتَبَ اللَّهُ لَهُ بِهِ عَشْرَ حَسَنَاتٍ ‏\"‏ ‏.‏ وَهَذَا إِسْنَادٌ ضَعِيفٌ ‏.‏ وَفِي الْبَابِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى الظُّهْرَ وَالْعَصْرَ بِوُضُوءٍ وَاحِدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 62,
			"arabicnumber": 62,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الشَّعْثَاءِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حَدَّثَتْنِي مَيْمُونَةُ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ مِنَ الْجَنَابَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ عَامَّةِ الْفُقَهَاءِ أَنْ لاَ بَأْسَ أَنْ يَغْتَسِلَ الرَّجُلُ وَالْمَرْأَةُ مِنْ إِنَاءٍ وَاحِدٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَعَائِشَةَ وَأَنَسٍ وَأُمِّ هَانِئٍ وَأُمِّ صُبَيَّةَ الْجُهَنِيَّةِ وَأُمِّ سَلَمَةَ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى وَأَبُو الشَّعْثَاءِ اسْمُهُ جَابِرُ بْنُ زَيْدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 63,
			"arabicnumber": 63,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي حَاجِبٍ، عَنْ رَجُلٍ، مِنْ بَنِي غِفَارٍ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ فَضْلِ طَهُورِ الْمَرْأَةِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ ‏.‏ قَالَ أَبُو عِيسَى وَكَرِهَ بَعْضُ الْفُقَهَاءِ الْوُضُوءَ بِفَضْلِ طَهُورِ الْمَرْأَةِ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ كَرِهَا فَضْلَ طَهُورِهَا وَلَمْ يَرَيَا بِفَضْلِ سُؤْرِهَا بَأْسًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 64,
			"arabicnumber": 64,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالاَ حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنْ عَاصِمٍ، قَالَ سَمِعْتُ أَبَا حَاجِبٍ، يُحَدِّثُ عَنِ الْحَكَمِ بْنِ عَمْرٍو الْغِفَارِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَتَوَضَّأَ الرَّجُلُ بِفَضْلِ طَهُورِ الْمَرْأَةِ ‏.‏ أَوْ قَالَ ‏ \"‏ بِسُؤْرِهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَأَبُو حَاجِبٍ اسْمُهُ سَوَادَةُ بْنُ عَاصِمٍ ‏.‏ وَقَالَ مُحَمَّدُ بْنُ بَشَّارٍ فِي حَدِيثِهِ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَتَوَضَّأَ الرَّجُلُ بِفَضْلِ طَهُورِ الْمَرْأَةِ ‏.‏ وَلَمْ يَشُكَّ فِيهِ مُحَمَّدُ بْنُ بَشَّارٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 65,
			"arabicnumber": 65,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ اغْتَسَلَ بَعْضُ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فِي جَفْنَةٍ فَأَرَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَتَوَضَّأَ مِنْهُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ جُنُبًا ‏.‏ فَقَالَ ‏ \"‏ إِنَّ الْمَاءَ لاَ يُجْنِبُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكٍ وَالشَّافِعِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 66,
			"arabicnumber": 66,
			"text": "حَدَّثَنَا هَنَّادٌ، وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ رَافِعِ بْنِ خَدِيجٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ أَنَتَوَضَّأُ مِنْ بِئْرِ بُضَاعَةَ وَهِيَ بِئْرٌ يُلْقَى فِيهَا الْحِيَضُ وَلُحُومُ الْكِلاَبِ وَالنَّتْنُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الْمَاءَ طَهُورٌ لاَ يُنَجِّسُهُ شَيْءٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ جَوَّدَ أَبُو أُسَامَةَ هَذَا الْحَدِيثَ فَلَمْ يَرْوِ أَحَدٌ حَدِيثَ أَبِي سَعِيدٍ فِي بِئْرِ بُضَاعَةَ أَحْسَنَ مِمَّا رَوَى أَبُو أُسَامَةَ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي سَعِيدٍ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَعَائِشَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 67,
			"arabicnumber": 67,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يُسْأَلُ عَنِ الْمَاءِ يَكُونُ فِي الْفَلاَةِ مِنَ الأَرْضِ وَمَا يَنُوبُهُ مِنَ السِّبَاعِ وَالدَّوَابِّ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا كَانَ الْمَاءُ قُلَّتَيْنِ لَمْ يَحْمِلِ الْخَبَثَ ‏\"‏ ‏.‏ قَالَ عَبْدَةُ قَالَ مُحَمَّدُ بْنُ إِسْحَاقَ الْقُلَّةُ هِيَ الْجِرَارُ وَالْقُلَّةُ الَّتِي يُسْتَقَى فِيهَا ‏.‏ قَالَ أَبُو عِيسَى وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ قَالُوا إِذَا كَانَ الْمَاءُ قُلَّتَيْنِ لَمْ يُنَجِّسْهُ شَيْءٌ مَا لَمْ يَتَغَيَّرْ رِيحُهُ أَوْ طَعْمُهُ وَقَالُوا يَكُونُ نَحْوًا مِنْ خَمْسِ قِرَبٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 68,
			"arabicnumber": 68,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ ثُمَّ يَتَوَضَّأُ مِنْهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 69,
			"arabicnumber": 69,
			"text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، ح وَحَدَّثَنَا الأَنْصَارِيُّ، إِسْحَاقُ بْنُ مُوسَى حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ سَعِيدِ بْنِ سَلَمَةَ، مِنْ آلِ ابْنِ الأَزْرَقِ أَنَّ الْمُغِيرَةَ بْنَ أَبِي بُرْدَةَ، وَهُوَ مِنْ بَنِي عَبْدِ الدَّارِ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا نَرْكَبُ الْبَحْرَ وَنَحْمِلُ مَعَنَا الْقَلِيلَ مِنَ الْمَاءِ فَإِنْ تَوَضَّأْنَا بِهِ عَطِشْنَا أَفَنَتَوَضَّأُ مِنْ مَاءِ الْبَحْرِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَالْفِرَاسِيِّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ أَكْثَرِ الْفُقَهَاءِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ أَبُو بَكْرٍ وَعُمَرُ وَابْنُ عَبَّاسٍ لَمْ يَرَوْا بَأْسًا بِمَاءِ الْبَحْرِ ‏.‏ وَقَدْ كَرِهَ بَعْضُ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم الْوُضُوءَ بِمَاءِ الْبَحْرِ مِنْهُمُ ابْنُ عُمَرَ وَعَبْدُ اللَّهِ بْنُ عَمْرٍو ‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو هُوَ نَارٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 70,
			"arabicnumber": 70,
			"text": "حَدَّثَنَا هَنَّادٌ، وَقُتَيْبَةُ، وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ مُجَاهِدًا، يُحَدِّثُ عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ عَلَى قَبْرَيْنِ فَقَالَ ‏ \"‏ إِنَّهُمَا يُعَذَّبَانِ وَمَا يُعَذَّبَانِ فِي كَبِيرٍ أَمَّا هَذَا فَكَانَ لاَ يَسْتَتِرُ مِنْ بَوْلِهِ وَأَمَّا هَذَا فَكَانَ يَمْشِي بِالنَّمِيمَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَأَبِي مُوسَى وَعَبْدِ الرَّحْمَنِ ابْنِ حَسَنَةَ وَزَيْدِ بْنِ ثَابِتٍ وَأَبِي بَكْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى مَنْصُورٌ هَذَا الْحَدِيثَ عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ وَلَمْ يَذْكُرْ فِيهِ عَنْ طَاوُسٍ ‏.‏ وَرِوَايَةُ الأَعْمَشِ أَصَحُّ ‏.‏ قَالَ وَسَمِعْتُ أَبَا بَكْرٍ مُحَمَّدَ بْنَ أَبَانَ الْبَلْخِيَّ مُسْتَمْلِي وَكِيعٍ يَقُولُ سَمِعْتُ وَكِيعًا يَقُولُ الأَعْمَشُ أَحْفَظُ لإِسْنَادِ إِبْرَاهِيمَ مِنْ مَنْصُورٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 71,
			"arabicnumber": 71,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَأَحْمَدُ بْنُ مَنِيعٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، قَالَتْ دَخَلْتُ بِابْنٍ لِي عَلَى النَّبِيِّ صلى الله عليه وسلم لَمْ يَأْكُلِ الطَّعَامَ فَبَالَ عَلَيْهِ فَدَعَا بِمَاءٍ فَرَشَّهُ عَلَيْهِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَعَائِشَةَ وَزَيْنَبَ وَلُبَابَةَ بِنْتِ الْحَارِثِ وَهِيَ أُمُّ الْفَضْلِ بْنِ عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ وَأَبِي السَّمْحِ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي لَيْلَى وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِثْلِ أَحْمَدَ وَإِسْحَاقَ قَالُوا يُنْضَحُ بَوْلُ الْغُلاَمِ وَيُغْسَلُ بَوْلُ الْجَارِيَةِ وَهَذَا مَا لَمْ يَطْعَمَا فَإِذَا طَعِمَا غُسِلاَ جَمِيعًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 72,
			"arabicnumber": 72,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا حُمَيْدٌ، وَقَتَادَةُ، وَثَابِتٌ، عَنْ أَنَسٍ، أَنَّ نَاسًا، مِنْ عُرَيْنَةَ قَدِمُوا الْمَدِينَةَ فَاجْتَوَوْهَا فَبَعَثَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي إِبِلِ الصَّدَقَةِ وَقَالَ ‏ \"‏ اشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا ‏\"‏ ‏.‏ فَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاسْتَاقُوا الإِبِلَ وَارْتَدُّوا عَنِ الإِسْلاَمِ فَأُتِيَ بِهِمُ النَّبِيُّ صلى الله عليه وسلم فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ مِنْ خِلاَفٍ وَسَمَرَ أَعْيُنَهُمْ وَأَلْقَاهُمْ بِالْحَرَّةِ ‏.‏ قَالَ أَنَسٌ فَكُنْتُ أَرَى أَحَدَهُمْ يَكُدُّ الأَرْضَ بِفِيهِ حَتَّى مَاتُوا ‏.‏ وَرُبَّمَا قَالَ حَمَّادٌ يَكْدُمُ الأَرْضَ بِفِيهِ حَتَّى مَاتُوا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَنَسٍ ‏.‏ وَهُوَ قَوْلُ أَكْثَرِ أَهْلِ الْعِلْمِ قَالُوا لاَ بَأْسَ بِبَوْلِ مَا يُؤْكَلُ لَحْمُهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 73,
			"arabicnumber": 73,
			"text": "حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ الأَعْرَجُ الْبَغْدَادِيُّ، حَدَّثَنَا يَحْيَى بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ إِنَّمَا سَمَلَ النَّبِيُّ صلى الله عليه وسلم أَعْيُنَهُمْ لأَنَّهُمْ سَمَلُوا أَعْيُنَ الرُّعَاةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْلَمُ أَحَدًا ذَكَرَهُ غَيْرَ هَذَا الشَّيْخِ عَنْ يَزِيدَ بْنِ زُرَيْعٍ ‏.‏ وَهُوَ مَعْنَى قَوْلِهِ ‏:‏ ‏(‏ وَالْجُرُوحَ قِصَاصٌ ‏)‏ ‏.‏ وَقَدْ رُوِيَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَ إِنَّمَا فَعَلَ بِهِمُ النَّبِيُّ صلى الله عليه وسلم هَذَا قَبْلَ أَنْ تَنْزِلَ الْحُدُودُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 74,
			"arabicnumber": 74,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ وُضُوءَ إِلاَّ مِنْ صَوْتٍ أَوْ رِيحٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 75,
			"arabicnumber": 75,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا كَانَ أَحَدُكُمْ فِي الْمَسْجِدِ فَوَجَدَ رِيحًا بَيْنَ أَلْيَتَيْهِ فَلاَ يَخْرُجْ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ وَعَلِيِّ بْنِ طَلْقٍ وَعَائِشَةَ وَابْنِ عَبَّاسٍ وَابْنِ مَسْعُودٍ وَأَبِي سَعِيدٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ الْعُلَمَاءِ أَنْ لاَ يَجِبَ عَلَيْهِ الْوُضُوءُ إِلاَّ مِنْ حَدَثٍ يَسْمَعُ صَوْتًا أَوْ يَجِدُ رِيحًا ‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ إِذَا شَكَّ فِي الْحَدَثِ فَإِنَّهُ لاَ يَجِبُ عَلَيْهِ الْوُضُوءُ حَتَّى يَسْتَيْقِنَ اسْتِيقَانًا يَقْدِرُ أَنْ يَحْلِفَ عَلَيْهِ ‏.‏ وَقَالَ إِذَا خَرَجَ مِنْ قُبُلِ الْمَرْأَةِ الرِّيحُ وَجَبَ عَلَيْهَا الْوُضُوءُ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَإِسْحَاقَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 76,
			"arabicnumber": 76,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ لاَ يَقْبَلُ صَلاَةَ أَحَدِكُمْ إِذَا أَحْدَثَ حَتَّى يَتَوَضَّأَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 77,
			"arabicnumber": 77,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى، - كُوفِيٌّ - وَهَنَّادٌ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ الْمَعْنَى وَاحِدٌ قَالُوا حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ حَرْبٍ الْمُلاَئِيُّ، عَنْ أَبِي خَالِدٍ الدَّالاَنِيِّ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم نَامَ وَهُوَ سَاجِدٌ حَتَّى غَطَّ أَوْ نَفَخَ ثُمَّ قَامَ يُصَلِّي ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ قَدْ نِمْتَ قَالَ ‏ \"‏ إِنَّ الْوُضُوءَ لاَ يَجِبُ إِلاَّ عَلَى مَنْ نَامَ مُضْطَجِعًا فَإِنَّهُ إِذَا اضْطَجَعَ اسْتَرْخَتْ مَفَاصِلُهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَأَبُو خَالِدٍ اسْمُهُ يَزِيدُ بْنُ عَبْدِ الرَّحْمَنِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 78,
			"arabicnumber": 78,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَنَامُونَ ثُمَّ يَقُومُونَ فَيُصَلُّونَ وَلاَ يَتَوَضَّئُونَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ وَسَمِعْتُ صَالِحَ بْنَ عَبْدِ اللَّهِ يَقُولُ سَأَلْتُ عَبْدَ اللَّهِ بْنَ الْمُبَارَكِ عَمَّنْ نَامَ قَاعِدًا مُعْتَمِدًا فَقَالَ لاَ وُضُوءَ عَلَيْهِ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَوَى حَدِيثَ ابْنِ عَبَّاسٍ سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنِ ابْنِ عَبَّاسٍ قَوْلَهُ وَلَمْ يَذْكُرْ فِيهِ أَبَا الْعَالِيَةِ وَلَمْ يَرْفَعْهُ ‏.‏ وَاخْتَلَفَ الْعُلَمَاءُ فِي الْوُضُوءِ مِنَ النَّوْمِ فَرَأَى أَكْثَرُهُمْ أَنْ لاَ يَجِبَ عَلَيْهِ الْوُضُوءُ إِذَا نَامَ قَاعِدًا أَوْ قَائِمًا حَتَّى يَنَامَ مُضْطَجِعًا ‏.‏ وَبِهِ يَقُولُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَأَحْمَدُ ‏.‏ قَالَ وَقَالَ بَعْضُهُمْ إِذَا نَامَ حَتَّى غُلِبَ عَلَى عَقْلِهِ وَجَبَ عَلَيْهِ الْوُضُوءُ وَبِهِ يَقُولُ إِسْحَاقُ ‏.‏ وَقَالَ الشَّافِعِيُّ مَنْ نَامَ قَاعِدًا فَرَأَى رُؤْيَا أَوْ زَالَتْ مَقْعَدَتُهُ لِوَسَنِ النَّوْمِ فَعَلَيْهِ الْوُضُوءُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 79,
			"arabicnumber": 79,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْوُضُوءُ مِمَّا مَسَّتِ النَّارُ وَلَوْ مِنْ ثَوْرِ أَقِطٍ ‏\"‏ ‏.‏ قَالَ فَقَالَ لَهُ ابْنُ عَبَّاسٍ يَا أَبَا هُرَيْرَةَ أَنَتَوَضَّأُ مِنَ الدُّهْنِ أَنَتَوَضَّأُ مِنَ الْحَمِيمِ قَالَ فَقَالَ أَبُو هُرَيْرَةَ يَا ابْنَ أَخِي إِذَا سَمِعْتَ حَدِيثًا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلاَ تَضْرِبْ لَهُ مَثَلاً ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُمِّ حَبِيبَةَ وَأُمِّ سَلَمَةَ وَزَيْدِ بْنِ ثَابِتٍ وَأَبِي طَلْحَةَ وَأَبِي أَيُّوبَ وَأَبِي مُوسَى ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَأَى بَعْضُ أَهْلِ الْعِلْمِ الْوُضُوءَ مِمَّا غَيَّرَتِ النَّارُ وَأَكْثَرُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ عَلَى تَرْكِ الْوُضُوءِ مِمَّا غَيَّرَتِ النَّارُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 80,
			"arabicnumber": 80,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ، سَمِعَ جَابِرًا، ‏.‏ قَالَ سُفْيَانُ وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا مَعَهُ فَدَخَلَ عَلَى امْرَأَةٍ مِنَ الأَنْصَارِ فَذَبَحَتْ لَهُ شَاةً فَأَكَلَ وَأَتَتْهُ بِقِنَاعٍ مِنْ رُطَبٍ فَأَكَلَ مِنْهُ ثُمَّ تَوَضَّأَ لِلظُّهْرِ وَصَلَّى ثُمَّ انْصَرَفَ فَأَتَتْهُ بِعُلاَلَةٍ مِنْ عُلاَلَةِ الشَّاةِ فَأَكَلَ ثُمَّ صَلَّى الْعَصْرَ وَلَمْ يَتَوَضَّأْ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَابْنِ مَسْعُودٍ وَأَبِي رَافِعٍ وَأُمِّ الْحَكَمِ وَعَمْرِو بْنِ أُمَيَّةَ وَأُمِّ عَامِرٍ وَسُوَيْدِ بْنِ النُّعْمَانِ وَأُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى وَلاَ يَصِحُّ حَدِيثُ أَبِي بَكْرٍ فِي هَذَا الْبَابِ مِنْ قِبَلِ إِسْنَادِهِ إِنَّمَا رَوَاهُ حُسَامُ بْنُ مِصَكٍّ عَنِ ابْنِ سِيرِينَ عَنِ ابْنِ عَبَّاسٍ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَالصَّحِيحُ إِنَّمَا هُوَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ هَكَذَا رَوَى الْحُفَّاظُ ‏.‏ قَالَ أَبُو عِيسَى وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ رَأَوْا تَرْكَ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ ‏.‏ وَهَذَا آخِرُ الأَمْرَيْنِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَكَأَنَّ هَذَا الْحَدِيثَ نَاسِخٌ لِلْحَدِيثِ الأَوَّلِ حَدِيثِ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 81,
			"arabicnumber": 81,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الرَّازِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْوُضُوءِ مِنْ لُحُومِ الإِبِلِ فَقَالَ ‏\"‏ تَوَضَّئُوا مِنْهَا ‏\"‏ ‏.‏ وَسُئِلَ عَنِ الْوُضُوءِ مِنْ لُحُومِ الْغَنَمِ فَقَالَ ‏\"‏ لاَ تَتَوَضَّئُوا مِنْهَا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرِ بْنِ سَمُرَةَ وَأُسَيْدِ بْنِ حُضَيْرٍ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَوَى الْحَجَّاجُ بْنُ أَرْطَاةَ هَذَا الْحَدِيثَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أُسَيْدِ بْنِ حُضَيْرٍ ‏.‏ وَالصَّحِيحُ حَدِيثُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنِ الْبَرَاءِ بْنِ عَازِبٍ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ وَقَدْ رُوِيَ عَنْ بَعْضِ أَهْلِ الْعِلْمِ مِنَ التَّابِعِينَ وَغَيْرِهِمْ أَنَّهُمْ لَمْ يَرَوُا الْوُضُوءَ مِنْ لُحُومِ الإِبِلِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 82,
			"arabicnumber": 82,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ أَخْبَرَنِي أَبِي، عَنْ بُسْرَةَ بِنْتِ صَفْوَانَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ مَسَّ ذَكَرَهُ فَلاَ يُصَلِّ حَتَّى يَتَوَضَّأَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُمِّ حَبِيبَةَ وَأَبِي أَيُّوبَ وَأَبِي هُرَيْرَةَ وَأَرْوَى ابْنَةِ أُنَيْسٍ وَعَائِشَةَ وَجَابِرٍ وَزَيْدِ بْنِ خَالِدٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ هَكَذَا رَوَاهُ غَيْرُ وَاحِدٍ مِثْلَ هَذَا عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ بُسْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 83,
			"arabicnumber": 83,
			"text": "وَرَوَى أَبُو أُسَامَةَ، وَغَيْرُ، وَاحِدٍ، هَذَا الْحَدِيثَ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ مَرْوَانَ، عَنْ بُسْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ حَدَّثَنَا بِذَلِكَ، إِسْحَاقُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو أُسَامَةَ، بِهَذَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 84,
			"arabicnumber": 84,
			"text": "وَرَوَى هَذَا الْحَدِيثَ أَبُو الزِّنَادِ، عَنْ عُرْوَةَ، عَنْ بُسْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ حَدَّثَنَا بِذَلِكَ، عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ بُسْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَبِهِ يَقُولُ الأَوْزَاعِيُّ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏ قَالَ مُحَمَّدٌ وَأَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ حَدِيثُ بُسْرَةَ ‏.‏ وَقَالَ أَبُو زُرْعَةَ حَدِيثُ أُمِّ حَبِيبَةَ فِي هَذَا الْبَابِ صَحِيحٌ وَهُوَ حَدِيثُ الْعَلاَءِ بْنِ الْحَارِثِ عَنْ مَكْحُولٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ ‏.‏ وَقَالَ مُحَمَّدٌ لَمْ يَسْمَعْ مَكْحُولٌ مِنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ وَرَوَى مَكْحُولٌ عَنْ رَجُلٍ عَنْ عَنْبَسَةَ غَيْرَ هَذَا الْحَدِيثِ ‏.‏ وَكَأَنَّهُ لَمْ يَرَ هَذَا الْحَدِيثَ صَحِيحًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 85,
			"arabicnumber": 85,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا مُلاَزِمُ بْنُ عَمْرٍو، عَنْ عَبْدِ اللَّهِ بْنِ بَدْرٍ، عَنْ قَيْسِ بْنِ طَلْقِ بْنِ عَلِيٍّ، هُوَ الْحَنَفِيُّ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَهَلْ هُوَ إِلاَّ مُضْغَةٌ مِنْهُ أَوْ بَضْعَةٌ مِنْهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي أُمَامَةَ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَبَعْضِ التَّابِعِينَ أَنَّهُمْ لَمْ يَرَوُا الْوُضُوءَ مِنْ مَسِّ الذَّكَرِ وَهُوَ قَوْلُ أَهْلِ الْكُوفَةِ وَابْنِ الْمُبَارَكِ ‏.‏ وَهَذَا الْحَدِيثُ أَحْسَنُ شَيْءٍ رُوِيَ فِي هَذَا الْبَابِ ‏.‏ وَقَدْ رَوَى هَذَا الْحَدِيثَ أَيُّوبُ بْنُ عُتْبَةَ وَمُحَمَّدُ بْنُ جَابِرٍ عَنْ قَيْسِ بْنِ طَلْقٍ عَنْ أَبِيهِ ‏.‏ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْحَدِيثِ فِي مُحَمَّدِ بْنِ جَابِرٍ وَأَيُّوبَ بْنِ عُتْبَةَ ‏.‏ وَحَدِيثُ مُلاَزِمِ بْنِ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ بَدْرٍ أَصَحُّ وَأَحْسَنُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 86,
			"arabicnumber": 86,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، وَأَبُو كُرَيْبٍ وَأَحْمَدُ بْنُ مَنِيعٍ وَمَحْمُودُ بْنُ غَيْلاَنَ وَأَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ قَالُوا حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَبَّلَ بَعْضَ نِسَائِهِ ثُمَّ خَرَجَ إِلَى الصَّلاَةِ وَلَمْ يَتَوَضَّأْ ‏.‏ قَالَ قُلْتُ مَنْ هِيَ إِلاَّ أَنْتِ قَالَ فَضَحِكَتْ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ نَحْوُ هَذَا عَنْ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ قَالُوا لَيْسَ فِي الْقُبْلَةِ وُضُوءٌ ‏.‏ وَقَالَ مَالِكُ بْنُ أَنَسٍ وَالأَوْزَاعِيُّ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ فِي الْقُبْلَةِ وُضُوءٌ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ ‏.‏ وَإِنَّمَا تَرَكَ أَصْحَابُنَا حَدِيثَ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا لأَنَّهُ لاَ يَصِحُّ عِنْدَهُمْ لِحَالِ الإِسْنَادِ ‏.‏ قَالَ وَسَمِعْتُ أَبَا بَكْرٍ الْعَطَّارَ الْبَصْرِيَّ يَذْكُرُ عَنْ عَلِيِّ بْنِ الْمَدِينِيِّ قَالَ ضَعَّفَ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ هَذَا الْحَدِيثَ جِدًّا ‏.‏ وَقَالَ هُوَ شِبْهُ لاَ شَىْءَ ‏.‏ قَالَ وَسَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يُضَعِّفُ هَذَا الْحَدِيثَ وَقَالَ حَبِيبُ بْنُ أَبِي ثَابِتٍ لَمْ يَسْمَعْ مِنْ عُرْوَةَ ‏.‏ وَقَدْ رُوِيَ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَبَّلَهَا وَلَمْ يَتَوَضَّأْ ‏.‏ وَهَذَا لاَ يَصِحُّ أَيْضًا ‏.‏ وَلاَ نَعْرِفُ لإِبْرَاهِيمَ التَّيْمِيِّ سَمَاعًا مِنْ عَائِشَةَ ‏.‏ وَلَيْسَ يَصِحُّ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا الْبَابِ شَيْءٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 87,
			"arabicnumber": 87,
			"text": "حَدَّثَنَا أَبُو عُبَيْدَةَ بْنُ أَبِي السَّفَرِ، - وَهُوَ أَحْمَدُ بْنُ عَبْدِ اللَّهِ الْهَمْدَانِيُّ الْكُوفِيُّ وَإِسْحَاقُ بْنُ مَنْصُورٍ قَالَ أَبُو عُبَيْدَةَ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنِي أَبِي، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الأَوْزَاعِيُّ، عَنْ يَعِيشَ بْنِ الْوَلِيدِ الْمَخْزُومِيِّ، عَنْ أَبِيهِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِي الدَّرْدَاءِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَاءَ فَأَفْطَرَ فَتَوَضَّأَ ‏.‏ فَلَقِيتُ ثَوْبَانَ فِي مَسْجِدِ دِمَشْقَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ صَدَقَ أَنَا صَبَبْتُ لَهُ وَضُوءَهُ ‏.‏ قَالَ أَبُو عِيسَى وَقَالَ إِسْحَاقُ بْنُ مَنْصُورٍ مَعْدَانُ بْنُ طَلْحَةَ ‏.‏ قَالَ أَبُو عِيسَى وَابْنُ أَبِي طَلْحَةَ أَصَحُّ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَأَى غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ مِنَ التَّابِعِينَ الْوُضُوءَ مِنَ الْقَىْءِ وَالرُّعَافِ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لَيْسَ فِي الْقَىْءِ وَالرُّعَافِ وُضُوءٌ ‏.‏ وَهُوَ قَوْلُ مَالِكٍ وَالشَّافِعِيِّ ‏.‏ وَقَدْ جَوَّدَ حُسَيْنٌ الْمُعَلِّمُ هَذَا الْحَدِيثَ ‏.‏ وَحَدِيثُ حُسَيْنٍ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ ‏.‏ وَرَوَى مَعْمَرٌ هَذَا الْحَدِيثَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ فَأَخْطَأَ فِيهِ فَقَالَ عَنْ يَعِيشَ بْنِ الْوَلِيدِ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ أَبِي الدَّرْدَاءِ وَلَمْ يَذْكُرْ فِيهِ الأَوْزَاعِيَّ وَقَالَ عَنْ خَالِدِ بْنِ مَعْدَانَ وَإِنَّمَا هُوَ مَعْدَانُ بْنُ أَبِي طَلْحَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 88,
			"arabicnumber": 88,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي فَزَارَةَ، عَنْ أَبِي زَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ سَأَلَنِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا فِي إِدَاوَتِكَ ‏\"‏ ‏.‏ فَقُلْتُ نَبِيذٌ ‏.‏ فَقَالَ ‏\"‏ تَمْرَةٌ طَيِّبَةٌ وَمَاءٌ طَهُورٌ ‏\"‏ ‏.‏ قَالَ فَتَوَضَّأَ مِنْهُ ‏.‏ قَالَ أَبُو عِيسَى وَإِنَّمَا رُوِيَ هَذَا الْحَدِيثُ عَنْ أَبِي زَيْدٍ عَنْ عَبْدِ اللَّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَأَبُو زَيْدٍ رَجُلٌ مَجْهُولٌ عِنْدَ أَهْلِ الْحَدِيثِ لاَ يُعْرَفُ لَهُ رِوَايَةٌ غَيْرُ هَذَا الْحَدِيثِ ‏.‏ وَقَدْ رَأَى بَعْضُ أَهْلِ الْعِلْمِ الْوُضُوءَ بِالنَّبِيذِ مِنْهُمْ سُفْيَانُ الثَّوْرِيُّ وَغَيْرُهُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لاَ يُتَوَضَّأُ بِالنَّبِيذِ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ إِسْحَاقُ إِنِ ابْتُلِيَ رَجُلٌ بِهَذَا فَتَوَضَّأَ بِالنَّبِيذِ وَتَيَمَّمَ أَحَبُّ إِلَىَّ ‏.‏ قَالَ أَبُو عِيسَى وَقَوْلُ مَنْ يَقُولُ لاَ يُتَوَضَّأُ بِالنَّبِيذِ أَقْرَبُ إِلَى الْكِتَابِ وَأَشْبَهُ لأَنَّ اللَّهَ تَعَالَى قَالَ‏:‏ ‏\"‏فإِن لَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 89,
			"arabicnumber": 89,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم شَرِبَ لَبَنًا فَدَعَا بِمَاءٍ فَمَضْمَضَ وَقَالَ ‏ \"‏ إِنَّ لَهُ دَسَمًا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ وَأُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَأَى بَعْضُ أَهْلِ الْعِلْمِ الْمَضْمَضَةَ مِنَ اللَّبَنِ وَهَذَا عِنْدَنَا عَلَى الاِسْتِحْبَابِ وَلَمْ يَرَ بَعْضُهُمُ الْمَضْمَضَةَ مِنَ اللَّبَنِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 90,
			"arabicnumber": 90,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا أَبُو أَحْمَدَ، مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الزُّبَيْرِيُّ عَنْ سُفْيَانَ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، سَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَبُولُ فَلَمْ يَرُدَّ عَلَيْهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَإِنَّمَا يُكْرَهُ هَذَا عِنْدَنَا إِذَا كَانَ عَلَى الْغَائِطِ وَالْبَوْلِ ‏.‏ وَقَدْ فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ ذَلِكَ ‏.‏ وَهَذَا أَحْسَنُ شَيْءٍ رُوِيَ فِي هَذَا الْبَابِ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنِ الْمُهَاجِرِ بْنِ قُنْفُذٍ وَعَبْدِ اللَّهِ بْنِ حَنْظَلَةَ وَعَلْقَمَةَ بْنِ الْفَغْوَاءِ وَجَابِرٍ وَالْبَرَاءِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 91,
			"arabicnumber": 91,
			"text": "حَدَّثَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ الْعَنْبَرِيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَيُّوبَ، يُحَدِّثُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ يُغْسَلُ الإِنَاءُ إِذَا وَلَغَ فِيهِ الْكَلْبُ سَبْعَ مَرَّاتٍ أُولاَهُنَّ أَوْ أُخْرَاهُنَّ بِالتُّرَابِ وَإِذَا وَلَغَتْ فِيهِ الْهِرَّةُ غُسِلَ مَرَّةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ هَذَا وَلَمْ يُذْكَرْ فِيهِ ‏\"‏ إِذَا وَلَغَتْ فِيهِ الْهِرَّةُ غُسِلَ مَرَّةً ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 92,
			"arabicnumber": 92,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ حُمَيْدَةَ بِنْتِ عُبَيْدِ بْنِ رِفَاعَةَ، عَنْ كَبْشَةَ بِنْتِ كَعْبِ بْنِ مَالِكٍ، وَكَانَتْ، عِنْدَ ابْنِ أَبِي قَتَادَةَ أَنَّ أَبَا قَتَادَةَ، دَخَلَ عَلَيْهَا ‏.‏ قَالَتْ فَسَكَبْتُ لَهُ وَضُوءًا قَالَتْ فَجَاءَتْ هِرَّةٌ تَشْرَبُ فَأَصْغَى لَهَا الإِنَاءَ حَتَّى شَرِبَتْ قَالَتْ كَبْشَةُ فَرَآنِي أَنْظُرُ إِلَيْهِ فَقَالَ أَتَعْجَبِينَ يَا بِنْتَ أَخِي فَقُلْتُ نَعَمْ ‏.‏ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّهَا لَيْسَتْ بِنَجَسٍ إِنَّمَا هِيَ مِنَ الطَّوَّافِينَ عَلَيْكُمْ أَوِ الطَّوَّافَاتِ ‏\"‏ ‏.‏ وَهُوَ قَوْلُ أَكْثَرِ الْعُلَمَاءِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِثْلِ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ لَمْ يَرَوْا بِسُؤْرِ الْهِرَّةِ بَأْسًا ‏.‏ وَهَذَا أَحَسَنُ شَيْءٍ رُوِيَ فِي هَذَا الْبَابِ ‏.‏ وَقَدْ جَوَّدَ مَالِكٌ هَذَا الْحَدِيثَ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ وَلَمْ يَأْتِ بِهِ أَحَدٌ أَتَمَّ مِنْ مَالِكٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 93,
			"arabicnumber": 93,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، قَالَ بَالَ جَرِيرُ بْنُ عَبْدِ اللَّهِ ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ فَقِيلَ لَهُ أَتَفْعَلُ هَذَا قَالَ وَمَا يَمْنَعُنِي وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَفْعَلُهُ ‏.‏ قَالَ إِبْرَاهِيمُ وَكَانَ يُعْجِبُهُمْ حَدِيثُ جَرِيرٍ لأَنَّ إِسْلاَمَهُ كَانَ بَعْدَ نُزُولِ الْمَائِدَةِ ‏.‏ هَذَا قَوْلُ إِبْرَاهِيمَ يَعْنِي كَانَ يُعْجِبُهُمْ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ وَعَلِيٍّ وَحُذَيْفَةَ وَالْمُغِيرَةِ وَبِلاَلٍ وَسَعْدٍ وَأَبِي أَيُّوبَ وَسَلْمَانَ وَبُرَيْدَةَ وَعَمْرِو بْنِ أُمَيَّةَ وَأَنَسٍ وَسَهْلِ بْنِ سَعْدٍ وَيَعْلَى بْنِ مُرَّةَ وَعُبَادَةَ بْنِ الصَّامِتِ وَأُسَامَةَ بْنِ شَرِيكٍ وَأَبِي أُمَامَةَ وَجَابِرٍ وَأُسَامَةَ بْنِ زَيْدٍ وَابْنِ عُبَادَةَ وَيُقَالُ ابْنُ عِمَارَةَ وَأُبَىُّ بْنُ عِمَارَةَ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ جَرِيرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 94,
			"arabicnumber": 94,
			"text": "وَيُرْوَى عَنْ شَهْرِ بْنِ حَوْشَبٍ، قَالَ رَأَيْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ تَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ فَقُلْتُ لَهُ فِي ذَلِكَ فَقَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ ‏.‏ فَقُلْتُ لَهُ أَقَبْلَ الْمَائِدَةِ أَمْ بَعْدَ الْمَائِدَةِ فَقَالَ مَا أَسْلَمْتُ إِلاَّ بَعْدَ الْمَائِدَةِ ‏.‏ حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ حَدَّثَنَا خَالِدُ بْنُ زِيَادٍ التِّرْمِذِيُّ عَنْ مُقَاتِلِ بْنِ حَيَّانَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ جَرِيرٍ ‏.‏ قَالَ وَرَوَى بَقِيَّةُ عَنْ إِبْرَاهِيمَ بْنِ أَدْهَمَ عَنْ مُقَاتِلِ بْنِ حَيَّانَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ جَرِيرٍ ‏.‏ وَهَذَا حَدِيثٌ مُفَسِّرٌ لأَنَّ بَعْضَ مَنْ أَنْكَرَ الْمَسْحَ عَلَى الْخُفَّيْنِ تَأَوَّلَ أَنَّ مَسْحَ النَّبِيِّ صلى الله عليه وسلم عَلَى الْخُفَّيْنِ كَانَ قَبْلَ نُزُولِ الْمَائِدَةِ وَذَكَرَ جَرِيرٌ فِي حَدِيثِهِ أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم مَسَحَ عَلَى الْخُفَّيْنِ بَعْدَ نُزُولِ الْمَائِدَةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 95,
			"arabicnumber": 95,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ أَبِي عَبْدِ اللَّهِ الْجَدَلِيِّ، عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ سُئِلَ عَنِ الْمَسْحِ عَلَى الْخُفَّيْنِ فَقَالَ ‏ \"‏ لِلْمُسَافِرِ ثَلاَثَةٌ وَلِلْمُقِيمِ يَوْمٌ ‏\"‏ ‏.‏ وَذُكِرَ عَنْ يَحْيَى بْنِ مَعِينٍ أَنَّهُ صَحَّحَ حَدِيثَ خُزَيْمَةَ بْنِ ثَابِتٍ فِي الْمَسْحِ ‏.‏ وَأَبُو عَبْدِ اللَّهِ الْجَدَلِيُّ اسْمُهُ عَبْدُ بْنُ عَبْدٍ وَيُقَالُ عَبْدُ الرَّحْمَنِ بْنُ عَبْدٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ عَلِيٍّ وَأَبِي بَكْرَةَ وَأَبِي هُرَيْرَةَ وَصَفْوَانَ بْنِ عَسَّالٍ وَعَوْفِ بْنِ مَالِكٍ وَابْنِ عُمَرَ وَجَرِيرٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 96,
			"arabicnumber": 96,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ، عَنْ زِرِّ بْنِ حُبَيْشٍ، عَنْ صَفْوَانَ بْنِ عَسَّالٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا إِذَا كُنَّا سَفْرًا أَنْ لاَ نَنْزِعَ خِفَافَنَا ثَلاَثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ إِلاَّ مِنْ جَنَابَةٍ وَلَكِنْ مِنْ غَائِطٍ وَبَوْلٍ وَنَوْمٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَى الْحَكَمُ بْنُ عُتَيْبَةَ وَحَمَّادٌ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ عَنْ أَبِي عَبْدِ اللَّهِ الْجَدَلِيِّ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ وَلاَ يَصِحُّ ‏.‏ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى بْنُ سَعِيدٍ قَالَ شُعْبَةُ لَمْ يَسْمَعْ إِبْرَاهِيمُ النَّخَعِيُّ مِنْ أَبِي عَبْدِ اللَّهِ الْجَدَلِيِّ حَدِيثَ الْمَسْحِ ‏.‏ وَقَالَ زَائِدَةُ عَنْ مَنْصُورٍ كُنَّا فِي حُجْرَةِ إِبْرَاهِيمَ التَّيْمِيِّ وَمَعَنَا إِبْرَاهِيمُ النَّخَعِيُّ فَحَدَّثَنَا إِبْرَاهِيمُ التَّيْمِيُّ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ أَبِي عَبْدِ اللَّهِ الْجَدَلِيِّ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْمَسْحِ عَلَى الْخُفَّيْنِ ‏.‏ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ حَدِيثُ صَفْوَانَ بْنِ عَسَّالٍ الْمُرَادِيِّ ‏.‏ قَالَ أَبُو عِيسَى وَهُوَ قَوْلُ أَكْثَرِ الْعُلَمَاءِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِنَ الْفُقَهَاءِ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ قَالُوا يَمْسَحُ الْمُقِيمُ يَوْمًا وَلَيْلَةً وَالْمُسَافِرُ ثَلاَثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ عَنْ بَعْضِ أَهْلِ الْعِلْمِ أَنَّهُمْ لَمْ يُوَقِّتُوا فِي الْمَسْحِ عَلَى الْخُفَّيْنِ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى وَالتَّوْقِيتُ أَصَحُّ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ صَفْوَانَ بْنِ عَسَّالٍ أَيْضًا مِنْ غَيْرِ حَدِيثِ عَاصِمٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 97,
			"arabicnumber": 97,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، أَخْبَرَنِي ثَوْرُ بْنُ يَزِيدَ، عَنْ رَجَاءِ بْنِ حَيْوَةَ، عَنْ كَاتِبِ الْمُغِيرَةِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَسَحَ أَعْلَى الْخُفِّ وَأَسْفَلَهُ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِنَ الْفُقَهَاءِ وَبِهِ يَقُولُ مَالِكٌ وَالشَّافِعِيُّ وَإِسْحَاقُ ‏.‏ وَهَذَا حَدِيثٌ مَعْلُولٌ لَمْ يُسْنِدْهُ عَنْ ثَوْرِ بْنِ يَزِيدَ غَيْرُ الْوَلِيدِ بْنِ مُسْلِمٍ ‏.‏ قَالَ أَبُو عِيسَى وَسَأَلْتُ أَبَا زُرْعَةَ وَمُحَمَّدَ بْنَ إِسْمَاعِيلَ عَنْ هَذَا الْحَدِيثِ فَقَالاَ لَيْسَ بِصَحِيحٍ لأَنَّ ابْنَ الْمُبَارَكِ رَوَى هَذَا عَنْ ثَوْرٍ عَنْ رَجَاءِ بْنِ حَيْوَةَ قَالَ حُدِّثْتُ عَنْ كَاتِبِ الْمُغِيرَةِ مُرْسَلٌ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرْ فِيهِ الْمُغِيرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 98,
			"arabicnumber": 98,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَمْسَحُ عَلَى الْخُفَّيْنِ عَلَى ظَاهِرِهِمَا ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْمُغِيرَةِ حَدِيثٌ حَسَنٌ وَهُوَ حَدِيثُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُرْوَةَ عَنِ الْمُغِيرَةِ وَلاَ نَعْلَمُ أَحَدًا يَذْكُرُ عَنْ عُرْوَةَ عَنِ الْمُغِيرَةِ ‏ \"‏ عَلَى ظَاهِرِهِمَا ‏\"‏ ‏.‏ غَيْرَهُ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَأَحْمَدُ ‏.‏ قَالَ مُحَمَّدٌ وَكَانَ مَالِكُ بْنُ أَنَسٍ يُشِيرُ بِعَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 99,
			"arabicnumber": 99,
			"text": "حَدَّثَنَا هَنَّادٌ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلِ بْنِ شُرَحْبِيلَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ تَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم وَمَسَحَ عَلَى الْجَوْرَبَيْنِ وَالنَّعْلَيْنِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ قَالُوا يَمْسَحُ عَلَى الْجَوْرَبَيْنِ وَإِنْ لَمْ تَكُنْ نَعْلَيْنِ إِذَا كَانَا ثَخِينَيْنِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي مُوسَى ‏.‏ قَالَ أَبُو عِيسَى سَمِعْتُ صَالِحَ بْنَ مُحَمَّدٍ التِّرْمِذِيَّ قَالَ سَمِعْتُ أَبَا مُقَاتِلٍ السَّمَرْقَنْدِيَّ يَقُولُ دَخَلْتُ عَلَى أَبِي حَنِيفَةَ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ فَدَعَا بِمَاءٍ فَتَوَضَّأَ وَعَلَيْهِ جَوْرَبَانِ فَمَسَحَ عَلَيْهِمَا ثُمَّ قَالَ فَعَلْتُ الْيَوْمَ شَيْئًا لَمْ أَكُنْ أَفْعَلُهُ مَسَحْتُ عَلَى الْجَوْرَبَيْنِ وَهُمَا غَيْرُ مُنَعَّلَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 100,
			"arabicnumber": 100,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ، عَنِ الْحَسَنِ، عَنِ ابْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ أَبِيهِ، قَالَ تَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم وَمَسَحَ عَلَى الْخُفَّيْنِ وَالْعِمَامَةِ ‏.‏ قَالَ بَكْرٌ وَقَدْ سَمِعْتُ مِنِ ابْنِ الْمُغِيرَةِ ‏.‏ قَالَ وَذَكَرَ مُحَمَّدُ بْنُ بَشَّارٍ فِي هَذَا الْحَدِيثِ فِي مَوْضِعٍ آخَرَ أَنَّهُ مَسَحَ عَلَى نَاصِيَتِهِ وَعِمَامَتِهِ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ ذَكَرَ بَعْضُهُمُ الْمَسْحَ عَلَى النَّاصِيَةِ وَالْعِمَامَةِ وَلَمْ يَذْكُرْ بَعْضُهُمُ النَّاصِيَةَ ‏.‏ وَسَمِعْتُ أَحْمَدَ بْنَ الْحَسَنِ يَقُولُ سَمِعْتُ أَحْمَدَ بْنَ حَنْبَلٍ يَقُولُ مَا رَأَيْتُ بِعَيْنِي مِثْلَ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَمْرِو بْنِ أُمَيَّةَ وَسَلْمَانَ وَثَوْبَانَ وَأَبِي أُمَامَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْمُغِيرَةِ بْنِ شُعْبَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ أَبُو بَكْرٍ وَعُمَرُ وَأَنَسٌ ‏.‏ وَبِهِ يَقُولُ الأَوْزَاعِيُّ وَأَحْمَدُ وَإِسْحَاقُ قَالُوا يَمْسَحُ عَلَى الْعِمَامَةِ ‏.‏ وَقَالَ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ لاَ يَمْسَحُ عَلَى الْعِمَامَةِ إِلاَّ أَنْ يَمْسَحَ بِرَأْسِهِ مَعَ الْعِمَامَةِ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ الْجَارُودَ بْنَ مُعَاذٍ يَقُولُ سَمِعْتُ وَكِيعَ بْنَ الْجَرَّاحِ يَقُولُ إِنْ مَسَحَ عَلَى الْعِمَامَةِ يُجْزِئُهُ لِلأَثَرِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 101,
			"arabicnumber": 101,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، عَنْ بِلاَلٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَسَحَ عَلَى الْخُفَّيْنِ وَالْخِمَارِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 102,
			"arabicnumber": 102,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، هُوَ الْقُرَشِيُّ عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ، قَالَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنِ الْمَسْحِ، عَلَى الْخُفَّيْنِ فَقَالَ السُّنَّةُ يَا ابْنَ أَخِي ‏.‏ قَالَ وَسَأَلْتُهُ عَنِ الْمَسْحِ، عَلَى الْعِمَامَةِ فَقَالَ أَمِسَّ الشَّعَرَ الْمَاءَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 103,
			"arabicnumber": 103,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ خَالَتِهِ، مَيْمُونَةَ قَالَتْ وَضَعْتُ لِلنَّبِيِّ صلى الله عليه وسلم غُسْلاً فَاغْتَسَلَ مِنَ الْجَنَابَةِ فَأَكْفَأَ الإِنَاءَ بِشِمَالِهِ عَلَى يَمِينِهِ فَغَسَلَ كَفَّيْهِ ثُمَّ أَدْخَلَ يَدَهُ فِي الإِنَاءِ فَأَفَاضَ عَلَى فَرْجِهِ ثُمَّ دَلَكَ بِيَدِهِ الْحَائِطَ أَوِ الأَرْضَ ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ ثُمَّ أَفَاضَ عَلَى رَأْسِهِ ثَلاَثًا ثُمَّ أَفَاضَ عَلَى سَائِرِ جَسَدِهِ ثُمَّ تَنَحَّى فَغَسَلَ رِجْلَيْهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ أُمِّ سَلَمَةَ وَجَابِرٍ وَأَبِي سَعِيدٍ وَجُبَيْرِ بْنِ مُطْعِمٍ وَأَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 104,
			"arabicnumber": 104,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَغْتَسِلَ مِنَ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ قَبْلَ أَنْ يُدْخِلَهُمَا الإِنَاءَ ثُمَّ غَسَلَ فَرْجَهُ وَيَتَوَضَّأُ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ يُشَرِّبُ شَعْرَهُ الْمَاءَ ثُمَّ يَحْثِي عَلَى رَأْسِهِ ثَلاَثَ حَثَيَاتٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ الَّذِي اخْتَارَهُ أَهْلُ الْعِلْمِ فِي الْغُسْلِ مِنَ الْجَنَابَةِ أَنَّهُ يَتَوَضَّأُ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ يُفْرِغُ عَلَى رَأْسِهِ ثَلاَثَ مَرَّاتٍ ثُمَّ يُفِيضُ الْمَاءَ عَلَى سَائِرِ جَسَدِهِ ثُمَّ يَغْسِلُ قَدَمَيْهِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَقَالُوا إِنِ انْغَمَسَ الْجُنُبُ فِي الْمَاءِ وَلَمْ يَتَوَضَّأْ أَجْزَأَهُ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 105,
			"arabicnumber": 105,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أَشُدُّ ضَفْرَ رَأْسِي أَفَأَنْقُضُهُ لِغُسْلِ الْجَنَابَةِ قَالَ ‏\"‏ لاَ إِنَّمَا يَكْفِيكِ أَنْ تَحْثِينَ عَلَى رَأْسِكِ ثَلاَثَ حَثَيَاتٍ مِنْ مَاءٍ ثُمَّ تُفِيضِينَ عَلَى سَائِرِ جَسَدِكِ الْمَاءَ فَتَطْهُرِينَ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ فَإِذَا أَنْتِ قَدْ تَطَهَّرْتِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّ الْمَرْأَةَ إِذَا اغْتَسَلَتْ مِنَ الْجَنَابَةِ فَلَمْ تَنْقُضْ شَعْرَهَا أَنَّ ذَلِكَ يُجْزِئُهَا بَعْدَ أَنْ تُفِيضَ الْمَاءَ عَلَى رَأْسِهَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 106,
			"arabicnumber": 106,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا الْحَارِثُ بْنُ وَجِيهٍ، قَالَ حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تَحْتَ كُلِّ شَعْرَةٍ جَنَابَةٌ فَاغْسِلُوا الشَّعَرَ وَأَنْقُوا الْبَشَرَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْحَارِثِ بْنِ وَجِيهٍ حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِهِ وَهُوَ شَيْخٌ لَيْسَ بِذَاكَ وَقَدْ رَوَى عَنْهُ غَيْرُ وَاحِدٍ مِنَ الأَئِمَّةِ ‏.‏ وَقَدْ تَفَرَّدَ بِهَذَا الْحَدِيثِ عَنْ مَالِكِ بْنِ دِينَارٍ وَيُقَالُ الْحَارِثُ بْنُ وَجِيهٍ وَيُقَالُ ابْنُ وَجْبَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 107,
			"arabicnumber": 107,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى، حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَتَوَضَّأُ بَعْدَ الْغُسْلِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ أَنْ لاَ يَتَوَضَّأَ بَعْدَ الْغُسْلِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 108,
			"arabicnumber": 108,
			"text": "حَدَّثَنَا أَبُو مُوسَى، مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الأَوْزَاعِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ فَعَلْتُهُ أَنَا وَرَسُولُ اللَّهِ صلى الله عليه وسلم فَاغْتَسَلْنَا ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَرَافِعِ بْنِ خَدِيجٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 109,
			"arabicnumber": 109,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ وَجَبَ الْغُسْلُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مِنْ غَيْرِ وَجْهٍ ‏\"‏ إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏\"‏ ‏.‏ وَهُوَ قَوْلُ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَعَلِيٌّ وَعَائِشَةُ وَالْفُقَهَاءِ مِنَ التَّابِعِينَ وَمَنْ بَعْدَهُمْ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ قَالُوا إِذَا الْتَقَى الْخِتَانَانِ وَجَبَ الْغُسْلُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 110,
			"arabicnumber": 110,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ، عَنِ الزُّهْرِيِّ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ إِنَّمَا كَانَ الْمَاءُ مِنَ الْمَاءِ رُخْصَةً فِي أَوَّلِ الإِسْلاَمِ ثُمَّ نُهِيَ عَنْهَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 111,
			"arabicnumber": 111,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَإِنَّمَا كَانَ الْمَاءُ مِنَ الْمَاءِ فِي أَوَّلِ الإِسْلاَمِ ثُمَّ نُسِخَ بَعْدَ ذَلِكَ ‏.‏ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ أُبَىُّ بْنُ كَعْبٍ وَرَافِعُ بْنُ خَدِيجٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ عَلَى أَنَّهُ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ فِي الْفَرْجِ وَجَبَ عَلَيْهِمَا الْغُسْلُ وَإِنْ لَمْ يُنْزِلاَ ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 112,
			"arabicnumber": 112,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ أَبِي الْجَحَّافِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّمَا الْمَاءُ مِنَ الْمَاءِ فِي الاِحْتِلاَمِ ‏.‏ قَالَ أَبُو عِيسَى سَمِعْتُ الْجَارُودَ يَقُولُ سَمِعْتُ وَكِيعًا يَقُولُ لَمْ نَجِدْ هَذَا الْحَدِيثَ إِلاَّ عِنْدَ شَرِيكٍ ‏.‏ قَالَ أَبُو عِيسَى وَأَبُو الْجَحَّافِ اسْمُهُ دَاوُدُ بْنُ أَبِي عَوْفٍ ‏.‏ وَيُرْوَى عَنْ سُفْيَانَ الثَّوْرِيِّ قَالَ حَدَّثَنَا أَبُو الْجَحَّافِ وَكَانَ مَرْضِيًّا ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عُثْمَانَ بْنِ عَفَّانَ وَعَلِيِّ بْنِ أَبِي طَالِبٍ وَالزُّبَيْرِ وَطَلْحَةَ وَأَبِي أَيُّوبَ وَأَبِي سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ الْمَاءُ مِنَ الْمَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 113,
			"arabicnumber": 113,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، هُوَ الْعُمَرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الرَّجُلِ يَجِدُ الْبَلَلَ وَلاَ يَذْكُرُ احْتِلاَمًا قَالَ ‏\"‏ يَغْتَسِلُ ‏\"‏ ‏.‏ وَعَنِ الرَّجُلِ يَرَى أَنَّهُ قَدِ احْتَلَمَ وَلَمْ يَجِدْ بَلَلاً قَالَ ‏\"‏ لاَ غُسْلَ عَلَيْهِ ‏\"‏ ‏.‏ قَالَتْ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ هَلْ عَلَى الْمَرْأَةِ تَرَى ذَلِكَ غُسْلٌ قَالَ ‏\"‏ نَعَمْ إِنَّ النِّسَاءَ شَقَائِقُ الرِّجَالِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَإِنَّمَا رَوَى هَذَا الْحَدِيثَ عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ حَدِيثَ عَائِشَةَ فِي الرَّجُلِ يَجِدُ الْبَلَلَ وَلاَ يَذْكُرُ احْتِلاَمًا ‏.‏ وَعَبْدُ اللَّهِ بْنُ عُمَرَ ضَعَّفَهُ يَحْيَى بْنُ سَعِيدٍ مِنْ قِبَلِ حِفْظِهِ فِي الْحَدِيثِ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ إِذَا اسْتَيْقَظَ الرَّجُلُ فَرَأَى بِلَّةً أَنَّهُ يَغْتَسِلُ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَحْمَدَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنَ التَّابِعِينَ إِنَّمَا يَجِبُ عَلَيْهِ الْغُسْلُ إِذَا كَانَتِ الْبِلَّةُ بِلَّةَ نُطْفَةٍ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَإِسْحَاقَ ‏.‏ وَإِذَا رَأَى احْتِلاَمًا وَلَمْ يَرَ بِلَّةً فَلاَ غُسْلَ عَلَيْهِ عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 114,
			"arabicnumber": 114,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو السَّوَّاقُ الْبَلْخِيُّ، حَدَّثَنَا هُشَيْمٌ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، ح قَالَ وَحَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنِ الْمَذْىِ فَقَالَ ‏\"‏ مِنَ الْمَذْىِ الْوُضُوءُ وَمِنَ الْمَنِيِّ الْغُسْلُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ الْمِقْدَادِ بْنِ الأَسْوَدِ وَأُبَىِّ بْنِ كَعْبٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِنْ غَيْرِ وَجْهٍ ‏\"‏ مِنَ الْمَذْىِ الْوُضُوءُ وَمِنَ الْمَنِيِّ الْغُسْلُ ‏\"‏ ‏.‏ وَهُوَ قَوْلُ عَامَّةِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ وَبِهِ يَقُولُ سُفْيَانُ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 115,
			"arabicnumber": 115,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ سَعِيدِ بْنِ عُبَيْدٍ، هُوَ ابْنُ السَّبَّاقِ عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ حُنَيْفٍ، قَالَ كُنْتُ أَلْقَى مِنَ الْمَذْىِ شِدَّةً وَعَنَاءً فَكُنْتُ أُكْثِرُ مِنْهُ الْغُسْلَ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَسَأَلْتُهُ عَنْهُ فَقَالَ ‏\"‏ إِنَّمَا يُجْزِئُكَ مِنْ ذَلِكَ الْوُضُوءُ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ بِمَا يُصِيبُ ثَوْبِي مِنْهُ قَالَ ‏\"‏ يَكْفِيكَ أَنْ تَأْخُذَ كَفًّا مِنْ مَاءٍ فَتَنْضَحَ بِهِ ثَوْبَكَ حَيْثُ تَرَى أَنَّهُ أَصَابَ مِنْهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَلاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ مُحَمَّدِ بْنِ إِسْحَاقَ فِي الْمَذْىِ مِثْلَ هَذَا ‏.‏ وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي الْمَذْىِ يُصِيبُ الثَّوْبَ فَقَالَ بَعْضُهُمْ لاَ يُجْزِئُ إِلاَّ الْغَسْلُ وَهُوَ قَوْلُ الشَّافِعِيِّ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُهُمْ يُجْزِئُهُ النَّضْحُ ‏.‏ وَقَالَ أَحْمَدُ أَرْجُو أَنْ يُجْزِئَهُ النَّضْحُ بِالْمَاءِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 116,
			"arabicnumber": 116,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، قَالَ ضَافَ عَائِشَةَ ضَيْفٌ فَأَمَرَتْ لَهُ بِمِلْحَفَةٍ صَفْرَاءَ فَنَامَ فِيهَا فَاحْتَلَمَ فَاسْتَحْيَا أَنْ يُرْسِلَ بِهَا وَبِهَا أَثَرُ الاِحْتِلاَمِ فَغَمَسَهَا فِي الْمَاءِ ثُمَّ أَرْسَلَ بِهَا فَقَالَتْ عَائِشَةُ لِمَ أَفْسَدَ عَلَيْنَا ثَوْبَنَا إِنَّمَا كَانَ يَكْفِيهِ أَنْ يَفْرُكَهُ بِأَصَابِعِهِ وَرُبَّمَا فَرَكْتُهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِأَصَابِعِي ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِنَ الْفُقَهَاءِ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ قَالُوا فِي الْمَنِيِّ يُصِيبُ الثَّوْبَ يُجْزِئُهُ الْفَرْكُ وَإِنْ لَمْ يُغْسَلْ ‏.‏ وَهَكَذَا رُوِيَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ عَنْ عَائِشَةَ مِثْلَ رِوَايَةِ الأَعْمَشِ ‏.‏ وَرَوَى أَبُو مَعْشَرٍ هَذَا الْحَدِيثَ عَنْ إِبْرَاهِيمَ عَنِ الأَسْوَدِ عَنْ عَائِشَةَ وَحَدِيثُ الأَعْمَشِ أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 117,
			"arabicnumber": 117,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَمْرِو بْنِ مَيْمُونِ بْنِ مِهْرَانَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ، أَنَّهَا غَسَلَتْ مَنِيًّا مِنْ ثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ وَحَدِيثُ عَائِشَةَ أَنَّهَا غَسَلَتْ مَنِيًّا مِنْ ثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم - لَيْسَ بِمُخَالِفٍ لِحَدِيثِ الْفَرْكِ لأَنَّهُ وَإِنْ كَانَ الْفَرْكُ يُجْزِئُ فَقَدْ يُسْتَحَبُّ لِلرَّجُلِ أَنْ لاَ يُرَى عَلَى ثَوْبِهِ أَثَرُهُ ‏.‏ قَالَ ابْنُ عَبَّاسٍ الْمَنِيُّ بِمَنْزِلَةِ الْمُخَاطِ فَأَمِطْهُ عَنْكَ وَلَوْ بِإِذْخِرَةٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 118,
			"arabicnumber": 118,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنَامُ وَهُوَ جُنُبٌ وَلاَ يَمَسُّ مَاءً ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 119,
			"arabicnumber": 119,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا قَوْلُ سَعِيدِ بْنِ الْمُسَيَّبِ وَغَيْرِهِ ‏.‏ وَقَدْ رَوَى غَيْرُ، وَاحِدٍ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَتَوَضَّأُ قَبْلَ أَنْ يَنَامَ ‏.‏ وَهَذَا أَصَحُّ مِنْ حَدِيثِ أَبِي إِسْحَاقَ عَنِ الأَسْوَدِ ‏.‏ وَقَدْ رَوَى عَنْ أَبِي إِسْحَاقَ هَذَا الْحَدِيثَ شُعْبَةُ وَالثَّوْرِيُّ وَغَيْرُ وَاحِدٍ ‏.‏ وَيَرَوْنَ أَنَّ هَذَا غَلَطٌ مِنْ أَبِي إِسْحَاقَ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 120,
			"arabicnumber": 120,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، أَنَّهُ سَأَلَ النَّبِيَّ صلى الله عليه وسلم أَيَنَامُ أَحَدُنَا وَهُوَ جُنُبٌ قَالَ ‏ \"‏ نَعَمْ إِذَا تَوَضَّأَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَمَّارٍ وَعَائِشَةَ وَجَابِرٍ وَأَبِي سَعِيدٍ وَأُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عُمَرَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ قَالُوا إِذَا أَرَادَ الْجُنُبُ أَنْ يَنَامَ تَوَضَّأَ قَبْلَ أَنْ يَنَامَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 121,
			"arabicnumber": 121,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَقِيَهُ وَهُوَ جُنُبٌ قَالَ فَانْبَجَسْتُ أَىْ فَانْخَنَسْتُ فَاغْتَسَلْتُ ثُمَّ جِئْتُ فَقَالَ ‏\"‏ أَيْنَ كُنْتَ أَوْ أَيْنَ ذَهَبْتَ ‏\"‏ ‏.‏ قُلْتُ إِنِّي كُنْتُ جُنُبًا ‏.‏ قَالَ ‏\"‏ إِنَّ الْمُسْلِمَ لاَ يَنْجُسُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ حُذَيْفَةَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ أَبِي هُرَيْرَةَ أَنَّهُ لَقِيَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ جُنُبٌ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَخَّصَ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ فِي مُصَافَحَةِ الْجُنُبِ وَلَمْ يَرَوْا بِعَرَقِ الْجُنُبِ وَالْحَائِضِ بَأْسًا ‏.‏ وَمَعْنَى قَوْلِهِ فَانْخَنَسْتُ يَعْنِي تَنَحَّيْتُ عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 122,
			"arabicnumber": 122,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ بِنْتُ مِلْحَانَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ فَهَلْ عَلَى الْمَرْأَةِ تَعْنِي غُسْلاً إِذَا هِيَ رَأَتْ فِي الْمَنَامِ مِثْلَ مَا يَرَى الرَّجُلُ قَالَ ‏ \"‏ نَعَمْ إِذَا هِيَ رَأَتِ الْمَاءَ فَلْتَغْتَسِلْ ‏\"‏ ‏.‏ قَالَتْ أُمُّ سَلَمَةَ قُلْتُ لَهَا فَضَحْتِ النِّسَاءَ يَا أُمَّ سُلَيْمٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ عَامَّةِ الْفُقَهَاءِ أَنَّ الْمَرْأَةَ إِذَا رَأَتْ فِي الْمَنَامِ مِثْلَ مَا يَرَى الرَّجُلُ فَأَنْزَلَتْ أَنَّ عَلَيْهَا الْغُسْلَ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَالشَّافِعِيُّ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُمِّ سُلَيْمٍ وَخَوْلَةَ وَعَائِشَةَ وَأَنَسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 123,
			"arabicnumber": 123,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ حُرَيْثٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ رُبَّمَا اغْتَسَلَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْجَنَابَةِ ثُمَّ جَاءَ فَاسْتَدْفَأَ بِي فَضَمَمْتُهُ إِلَىَّ وَلَمْ أَغْتَسِلْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ بِإِسْنَادِهِ بَأْسٌ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ أَنَّ الرَّجُلَ إِذَا اغْتَسَلَ فَلاَ بَأْسَ بِأَنْ يَسْتَدْفِئَ بِامْرَأَتِهِ وَيَنَامَ مَعَهَا قَبْلَ أَنْ تَغْتَسِلَ الْمَرْأَةُ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 124,
			"arabicnumber": 124,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالاَ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَمْرِو بْنِ بُجْدَانَ، عَنْ أَبِي ذَرٍّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الصَّعِيدَ الطَّيِّبَ طَهُورُ الْمُسْلِمِ وَإِنْ لَمْ يَجِدِ الْمَاءَ عَشْرَ سِنِينَ فَإِذَا وَجَدَ الْمَاءَ فَلْيُمِسَّهُ بَشَرَتَهُ فَإِنَّ ذَلِكَ خَيْرٌ ‏\"‏ ‏.‏ وَقَالَ مَحْمُودٌ فِي حَدِيثِهِ ‏\"‏ إِنَّ الصَّعِيدَ الطَّيِّبَ وَضُوءُ الْمُسْلِمِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَعِمْرَانَ بْنِ حُصَيْنٍ ‏.‏ قَالَ أَبُو عِيسَى وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلاَبَةَ عَنْ عَمْرِو بْنِ بُجْدَانَ عَنْ أَبِي ذَرٍّ ‏.‏ وَقَدْ رَوَى هَذَا الْحَدِيثَ أَيُّوبُ عَنْ أَبِي قِلاَبَةَ عَنْ رَجُلٍ مِنْ بَنِي عَامِرٍ عَنْ أَبِي ذَرٍّ وَلَمْ يُسَمِّهِ ‏.‏ قَالَ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ عَامَّةِ الْفُقَهَاءِ أَنَّ الْجُنُبَ وَالْحَائِضَ إِذَا لَمْ يَجِدَا الْمَاءَ تَيَمَّمَا وَصَلَّيَا ‏.‏ وَيُرْوَى عَنِ ابْنِ مَسْعُودٍ أَنَّهُ كَانَ لاَ يَرَى التَّيَمُّمَ لِلْجُنُبِ وَإِنْ لَمْ يَجِدِ الْمَاءَ ‏.‏ وَيُرْوَى عَنْهُ أَنَّهُ رَجَعَ عَنْ قَوْلِهِ فَقَالَ يَتَيَمَّمُ إِذَا لَمْ يَجِدِ الْمَاءَ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَمَالِكٌ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 125,
			"arabicnumber": 125,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، وَعَبْدَةُ، وَأَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ قَالَ ‏\"‏ لاَ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلاَةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي ‏\"‏ ‏.‏ قَالَ أَبُو مُعَاوِيَةَ فِي حَدِيثِهِ وَقَالَ ‏\"‏ تَوَضَّئِي لِكُلِّ صَلاَةٍ حَتَّى يَجِيءَ ذَلِكَ الْوَقْتُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ جَاءَتْ فَاطِمَةُ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَمَالِكٌ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ أَنَّ الْمُسْتَحَاضَةَ إِذَا جَاوَزَتْ أَيَّامَ أَقْرَائِهَا اغْتَسَلَتْ وَتَوَضَّأَتْ لِكُلِّ صَلاَةٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 126,
			"arabicnumber": 126,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي الْيَقْظَانِ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ فِي الْمُسْتَحَاضَةِ ‏ \"‏ تَدَعُ الصَّلاَةَ أَيَّامَ أَقْرَائِهَا الَّتِي كَانَتْ تَحِيضُ فِيهَا ثُمَّ تَغْتَسِلُ وَتَتَوَضَّأُ عِنْدَ كُلِّ صَلاَةٍ وَتَصُومُ وَتُصَلِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 127,
			"arabicnumber": 127,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، نَحْوَهُ بِمَعْنَاهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ قَدْ تَفَرَّدَ بِهِ شَرِيكٌ عَنْ أَبِي الْيَقْظَانِ ‏.‏ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَقُلْتُ عَدِيُّ بْنُ ثَابِتٍ عَنْ أَبِيهِ عَنْ جَدِّهِ جَدُّ عَدِيٍّ مَا اسْمُهُ فَلَمْ يَعْرِفْ مُحَمَّدٌ اسْمَهُ وَذَكَرْتُ لِمُحَمَّدٍ قَوْلَ يَحْيَى بْنِ مَعِينٍ أَنَّ اسْمَهُ دِينَارٌ فَلَمْ يَعْبَأْ بِهِ ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ فِي الْمُسْتَحَاضَةِ إِنِ اغْتَسَلَتْ لِكُلِّ صَلاَةٍ هُوَ أَحْوَطُ لَهَا وَإِنْ تَوَضَّأَتْ لِكُلِّ صَلاَةٍ أَجْزَأَهَا وَإِنْ جَمَعَتْ بَيْنَ الصَّلاَتَيْنِ بِغُسْلٍ وَاحِدٍ أَجْزَأَهَا ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 128,
			"arabicnumber": 128,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ، عَنْ عَمِّهِ، عِمْرَانَ بْنِ طَلْحَةَ عَنْ أُمِّهِ، حَمْنَةَ بِنْتِ جَحْشٍ قَالَتْ كُنْتُ أُسْتَحَاضُ حَيْضَةً كَثِيرَةً شَدِيدَةً فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم أَسْتَفْتِيهِ وَأُخْبِرُهُ فَوَجَدْتُهُ فِي بَيْتِ أُخْتِي زَيْنَبَ بِنْتِ جَحْشٍ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ حَيْضَةً كَثِيرَةً شَدِيدَةً فَمَا تَأْمُرُنِي فِيهَا قَدْ مَنَعَتْنِي الصِّيَامَ وَالصَّلاَةَ قَالَ ‏\"‏ أَنْعَتُ لَكِ الْكُرْسُفَ فَإِنَّهُ يُذْهِبُ الدَّمَ ‏\"‏ ‏.‏ قَالَتْ هُوَ أَكْثَرُ مِنْ ذَلِكَ قَالَ ‏\"‏ فَتَلَجَّمِي ‏\"‏ ‏.‏ قَالَتْ هُوَ أَكْثَرُ مِنْ ذَلِكَ قَالَ ‏\"‏ فَاتَّخِذِي ثَوْبًا ‏\"‏ ‏.‏ قَالَتْ هُوَ أَكْثَرُ مِنْ ذَلِكَ إِنَّمَا أَثُجُّ ثَجًّا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ سَآمُرُكِ بِأَمْرَيْنِ أَيَّهُمَا صَنَعْتِ أَجْزَأَ عَنْكِ فَإِنْ قَوِيتِ عَلَيْهِمَا فَأَنْتِ أَعْلَمُ ‏\"‏ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا هِيَ رَكْضَةٌ مِنَ الشَّيْطَانِ فَتَحَيَّضِي سِتَّةَ أَيَّامٍ أَوْ سَبْعَةَ أَيَّامٍ فِي عِلْمِ اللَّهِ ثُمَّ اغْتَسِلِي فَإِذَا رَأَيْتِ أَنَّكِ قَدْ طَهُرْتِ وَاسْتَنْقَأْتِ فَصَلِّي أَرْبَعًا وَعِشْرِينَ لَيْلَةً أَوْ ثَلاَثًا وَعِشْرِينَ لَيْلَةً وَأَيَّامَهَا وَصُومِي وَصَلِّي فَإِنَّ ذَلِكِ يُجْزِئُكِ وَكَذَلِكِ فَافْعَلِي كَمَا تَحِيضُ النِّسَاءُ وَكَمَا يَطْهُرْنَ لِمِيقَاتِ حَيْضِهِنَّ وَطُهْرِهِنَّ فَإِنْ قَوِيتِ عَلَى أَنْ تُؤَخِّرِي الظُّهْرَ وَتُعَجِّلِي الْعَصْرَ ثُمَّ تَغْتَسِلِينَ حِينَ تَطْهُرِينَ وَتُصَلِّينَ الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ تُؤَخِّرِينَ الْمَغْرِبَ وَتُعَجِّلِينَ الْعِشَاءَ ثُمَّ تَغْتَسِلِينَ وَتَجْمَعِينَ بَيْنَ الصَّلاَتَيْنِ فَافْعَلِي وَتَغْتَسِلِينَ مَعَ الصُّبْحِ وَتُصَلِّينَ وَكَذَلِكِ فَافْعَلِي وَصُومِي إِنْ قَوِيتِ عَلَى ذَلِكِ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَهُوَ أَعْجَبُ الأَمْرَيْنِ إِلَىَّ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَاهُ عُبَيْدُ اللَّهِ بْنُ عَمْرٍو الرَّقِّيُّ وَابْنُ جُرَيْجٍ وَشَرِيكٌ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ عَنْ عَمِّهِ عِمْرَانَ عَنْ أُمِّهِ حَمْنَةَ إِلاَّ أَنَّ ابْنَ جُرَيْجٍ يَقُولُ عُمَرُ بْنُ طَلْحَةَ وَالصَّحِيحُ عِمْرَانُ بْنُ طَلْحَةَ ‏.‏ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَقَالَ هُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهَكَذَا قَالَ أَحْمَدُ بْنُ حَنْبَلٍ هُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ فِي الْمُسْتَحَاضَةِ إِذَا كَانَتْ تَعْرِفُ حَيْضَهَا بِإِقْبَالِ الدَّمِ وَإِدْبَارِهِ وَإِقْبَالُهُ أَنْ يَكُونَ أَسْوَدَ ‏.‏ وَإِدْبَارُهُ أَنْ يَتَغَيَّرَ إِلَى الصُّفْرَةِ فَالْحُكْمُ لَهَا عَلَى حَدِيثِ فَاطِمَةَ بِنْتِ أَبِي حُبَيْشٍ وَإِنْ كَانَتِ الْمُسْتَحَاضَةُ لَهَا أَيَّامٌ مَعْرُوفَةٌ قَبْلَ أَنْ تُسْتَحَاضَ فَإِنَّهَا تَدَعُ الصَّلاَةَ أَيَّامَ أَقْرَائِهَا ثُمَّ تَغْتَسِلُ وَتَتَوَضَّأُ لِكُلِّ صَلاَةٍ وَتُصَلِّي وَإِذَا اسْتَمَرَّ بِهَا الدَّمُ وَلَمْ يَكُنْ لَهَا أَيَّامٌ مَعْرُوفَةٌ وَلَمْ تَعْرِفِ الْحَيْضَ بِإِقْبَالِ الدَّمِ وَإِدْبَارِهِ فَالْحُكْمُ لَهَا عَلَى حَدِيثِ حَمْنَةَ بِنْتِ جَحْشٍ ‏.‏ وَكَذَلِكَ قَالَ أَبُو عُبَيْدٍ ‏.‏ وَقَالَ الشَّافِعِيُّ الْمُسْتَحَاضَةُ إِذَا اسْتَمَرَّ بِهَا الدَّمُ فِي أَوَّلِ مَا رَأَتْ فَدَامَتْ عَلَى ذَلِكَ فَإِنَّهَا تَدَعُ الصَّلاَةَ مَا بَيْنَهَا وَبَيْنَ خَمْسَةَ عَشَرَ يَوْمًا فَإِذَا طَهُرَتْ فِي خَمْسَةَ عَشَرَ يَوْمًا أَوْ قَبْلَ ذَلِكَ فَإِنَّهَا أَيَّامُ حَيْضٍ فَإِذَا رَأَتِ الدَّمَ أَكْثَرَ مِنْ خَمْسَةَ عَشَرَ يَوْمًا فَإِنَّهَا تَقْضِي صَلاَةَ أَرْبَعَةَ عَشَرَ يَوْمًا ثُمَّ تَدَعُ الصَّلاَةَ بَعْدَ ذَلِكَ أَقَلَّ مَا تَحِيضُ النِّسَاءُ وَهُوَ يَوْمٌ وَلَيْلَةٌ ‏.‏ قَالَ أَبُو عِيسَى وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي أَقَلِّ الْحَيْضِ وَأَكْثَرِهِ فَقَالَ بَعْضُ أَهْلِ الْعِلْمِ أَقَلُّ الْحَيْضِ ثَلاَثَةٌ وَأَكْثَرُهُ عَشَرَةٌ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ وَبِهِ يَأْخُذُ ابْنُ الْمُبَارَكِ وَرُوِيَ عَنْهُ خِلاَفُ هَذَا ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْهُمْ عَطَاءُ بْنُ أَبِي رَبَاحٍ أَقَلُّ الْحَيْضِ يَوْمٌ وَلَيْلَةٌ وَأَكْثَرُهُ خَمْسَةَ عَشَرَ يَوْمًا ‏.‏ وَهُوَ قَوْلُ مَالِكٍ وَالأَوْزَاعِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ وَأَبِي عُبَيْدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 129,
			"arabicnumber": 129,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتِ اسْتَفْتَتْ أُمُّ حَبِيبَةَ ابْنَةُ جَحْشٍ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي أُسْتَحَاضُ فَلاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ فَقَالَ ‏ \"‏ لاَ إِنَّمَا ذَلِكِ عِرْقٌ فَاغْتَسِلِي ثُمَّ صَلِّي ‏\"‏ ‏.‏ فَكَانَتْ تَغْتَسِلُ لِكُلِّ صَلاَةٍ ‏.‏ قَالَ قُتَيْبَةُ قَالَ اللَّيْثُ لَمْ يَذْكُرِ ابْنُ شِهَابٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أُمَّ حَبِيبَةَ أَنْ تَغْتَسِلَ عِنْدَ كُلِّ صَلاَةٍ وَلَكِنَّهُ شَيْءٌ فَعَلَتْهُ هِيَ ‏.‏ قَالَ أَبُو عِيسَى وَيُرْوَى هَذَا الْحَدِيثُ عَنِ الزُّهْرِيِّ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتِ اسْتَفْتَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ وَقَدْ قَالَ بَعْضُ أَهْلِ الْعِلْمِ الْمُسْتَحَاضَةُ تَغْتَسِلُ عِنْدَ كُلِّ صَلاَةٍ ‏.‏ وَرَوَى الأَوْزَاعِيُّ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ وَعَمْرَةَ عَنْ عَائِشَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 130,
			"arabicnumber": 130,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ مُعَاذَةَ، أَنَّ امْرَأَةً، سَأَلَتْ عَائِشَةَ قَالَتْ أَتَقْضِي إِحْدَانَا صَلاَتَهَا أَيَّامَ مَحِيضِهَا فَقَالَتْ أَحَرُورِيَّةٌ أَنْتِ قَدْ كَانَتْ إِحْدَانَا تَحِيضُ فَلاَ تُؤْمَرُ بِقَضَاءٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ عَنْ عَائِشَةَ مِنْ غَيْرِ وَجْهٍ أَنَّ الْحَائِضَ لاَ تَقْضِي الصَّلاَةَ ‏.‏ وَهُوَ قَوْلُ عَامَّةِ الْفُقَهَاءِ لاَ اخْتِلاَفَ بَيْنَهُمْ فِي أَنَّ الْحَائِضَ تَقْضِي الصَّوْمَ وَلاَ تَقْضِي الصَّلاَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 131,
			"arabicnumber": 131,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، وَالْحَسَنُ بْنُ عَرَفَةَ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقْرَإِ الْحَائِضُ وَلاَ الْجُنُبُ شَيْئًا مِنَ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ إِسْمَاعِيلَ بْنِ عَيَّاشٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَقْرَإِ الْجُنُبُ وَلاَ الْحَائِضُ ‏\"‏ ‏.‏ وَهُوَ قَوْلُ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ قَالُوا لاَ تَقْرَأُ الْحَائِضُ وَلاَ الْجُنُبُ مِنَ الْقُرْآنِ شَيْئًا إِلاَّ طَرَفَ الآيَةِ وَالْحَرْفَ وَنَحْوَ ذَلِكَ وَرَخَّصُوا لِلْجُنُبِ وَالْحَائِضِ فِي التَّسْبِيحِ وَالتَّهْلِيلِ ‏.‏ قَالَ وَسَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يَقُولُ إِنَّ إِسْمَاعِيلَ بْنَ عَيَّاشٍ يَرْوِي عَنْ أَهْلِ الْحِجَازِ وَأَهْلِ الْعِرَاقِ أَحَادِيثَ مَنَاكِيرَ ‏.‏ كَأَنَّهُ ضَعَّفَ رِوَايَتَهُ عَنْهُمْ فِيمَا يَنْفَرِدُ بِهِ ‏.‏ وَقَالَ إِنَّمَا حَدِيثُ إِسْمَاعِيلَ بْنِ عَيَّاشٍ عَنْ أَهْلِ الشَّأْمِ ‏.‏ وَقَالَ أَحْمَدُ بْنُ حَنْبَلٍ إِسْمَاعِيلُ بْنُ عَيَّاشٍ أَصْلَحُ مِنْ بَقِيَّةَ وَلِبَقِيَّةَ أَحَادِيثُ مَنَاكِيرُ عَنِ الثِّقَاتِ ‏.‏ قَالَ أَبُو عِيسَى حَدَّثَنِي أَحْمَدُ بْنُ الْحَسَنِ قَالَ سَمِعْتُ أَحْمَدَ بْنَ حَنْبَلٍ يَقُولُ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 132,
			"arabicnumber": 132,
			"text": "حَدَّثَنَا بُنْدَارٌ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا حِضْتُ يَأْمُرُنِي أَنْ أَتَّزِرَ ثُمَّ يُبَاشِرُنِي ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُمِّ سَلَمَةَ وَمَيْمُونَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 133,
			"arabicnumber": 133,
			"text": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنِ الْعَلاَءِ بْنِ الْحَارِثِ، عَنْ حَرَامِ بْنِ مُعَاوِيَةَ، عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنْ مُوَاكَلَةِ الْحَائِضِ فَقَالَ ‏ \"‏ وَاكِلْهَا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ سَعْدٍ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَهُوَ قَوْلُ عَامَّةِ أَهْلِ الْعِلْمِ لَمْ يَرَوْا بِمُوَاكَلَةِ الْحَائِضِ بَأْسًا ‏.‏ وَاخْتَلَفُوا فِي فَضْلِ وَضُوئِهَا فَرَخَّصَ فِي ذَلِكَ بَعْضُهُمْ وَكَرِهَ بَعْضُهُمْ فَضْلَ طَهُورِهَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 134,
			"arabicnumber": 134,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنِ الأَعْمَشِ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، قَالَ قَالَتْ لِي عَائِشَةُ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَاوِلِينِي الْخُمْرَةَ مِنَ الْمَسْجِدِ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ إِنِّي حَائِضٌ ‏.‏ قَالَ ‏\"‏ إِنَّ حَيْضَتَكِ لَيْسَتْ فِي يَدِكِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ عَامَّةِ أَهْلِ الْعِلْمِ لاَ نَعْلَمُ بَيْنَهُمُ اخْتِلاَفًا فِي ذَلِكَ بِأَنْ لاَ بَأْسَ أَنْ تَتَنَاوَلَ الْحَائِضُ شَيْئًا مِنَ الْمَسْجِدِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 135,
			"arabicnumber": 135,
			"text": "حَدَّثَنَا بُنْدَارٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَبَهْزُ بْنُ أَسَدٍ، قَالُوا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حَكِيمٍ الأَثْرَمِ، عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَتَى حَائِضًا أَوِ امْرَأَةً فِي دُبُرِهَا أَوْ كَاهِنًا فَقَدْ كَفَرَ بِمَا أُنْزِلَ عَلَى مُحَمَّدٍ صلى الله عليه وسلم ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى لاَ نَعْرِفُ هَذَا الْحَدِيثَ إِلاَّ مِنْ حَدِيثِ حَكِيمٍ الأَثْرَمِ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَنْ أَبِي هُرَيْرَةَ ‏.‏ وَإِنَّمَا مَعْنَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ عَلَى التَّغْلِيظِ ‏.‏ وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَتَى حَائِضًا فَلْيَتَصَدَّقْ بِدِينَارٍ ‏\"‏ ‏.‏ فَلَوْ كَانَ إِتْيَانُ الْحَائِضِ كُفْرًا لَمْ يُؤْمَرْ فِيهِ بِالْكَفَّارَةِ ‏.‏ وَضَعَّفَ مُحَمَّدٌ هَذَا الْحَدِيثَ مِنْ قِبَلِ إِسْنَادِهِ ‏.‏ وَأَبُو تَمِيمَةَ الْهُجَيْمِيُّ اسْمُهُ طَرِيفُ بْنُ مُجَالِدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 136,
			"arabicnumber": 136,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ خُصَيْفٍ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الرَّجُلِ يَقَعُ عَلَى امْرَأَتِهِ وَهِيَ حَائِضٌ قَالَ ‏ \"‏ يَتَصَدَّقُ بِنِصْفِ دِينَارٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 137,
			"arabicnumber": 137,
			"text": "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ أَبِي حَمْزَةَ السُّكَّرِيِّ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا كَانَ دَمًا أَحْمَرَ فَدِينَارٌ وَإِذَا كَانَ دَمًا أَصْفَرَ فَنِصْفُ دِينَارٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْكَفَّارَةِ فِي إِتْيَانِ الْحَائِضِ قَدْ رُوِيَ عَنِ ابْنِ عَبَّاسٍ مَوْقُوفًا وَمَرْفُوعًا ‏.‏ وَهُوَ قَوْلُ بَعْضِ أَهْلِ الْعِلْمِ ‏.‏ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ يَسْتَغْفِرُ رَبَّهُ وَلاَ كَفَّارَةَ عَلَيْهِ ‏.‏ وَقَدْ رُوِيَ نَحْوُ قَوْلِ ابْنِ الْمُبَارَكِ عَنْ بَعْضِ التَّابِعِينَ مِنْهُمْ سَعِيدُ بْنُ جُبَيْرٍ وَإِبْرَاهِيمُ النَّخَعِيُّ وَهُوَ قَوْلُ عَامَّةِ عُلَمَاءِ الأَمْصَارِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 138,
			"arabicnumber": 138,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّ امْرَأَةً، سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم عَنِ الثَّوْبِ يُصِيبُهُ الدَّمُ مِنَ الْحَيْضَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ حُتِّيهِ ثُمَّ اقْرُصِيهِ بِالْمَاءِ ثُمَّ رُشِّيهِ وَصَلِّي فِيهِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَأُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَسْمَاءَ فِي غَسْلِ الدَّمِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي الدَّمِ يَكُونُ عَلَى الثَّوْبِ فَيُصَلِّي فِيهِ قَبْلَ أَنْ يَغْسِلَهُ قَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنَ التَّابِعِينَ إِذَا كَانَ الدَّمُ مِقْدَارَ الدِّرْهَمِ فَلَمْ يَغْسِلْهُ وَصَلَّى فِيهِ أَعَادَ الصَّلاَةَ ‏.‏ وَقَالَ بَعْضُهُمْ إِذَا كَانَ الدَّمُ أَكْثَرَ مِنْ قَدْرِ الدِّرْهَمِ أَعَادَ الصَّلاَةَ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ ‏.‏ وَلَمْ يُوجِبْ بَعْضُ أَهْلِ الْعِلْمِ مِنَ التَّابِعِينَ وَغَيْرِهِمْ عَلَيْهِ الإِعَادَةَ وَإِنْ كَانَ أَكْثَرَ مِنْ قَدْرِ الدِّرْهَمِ ‏.‏ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ الشَّافِعِيُّ يَجِبُ عَلَيْهِ الْغَسْلُ وَإِنْ كَانَ أَقَلَّ مِنْ قَدْرِ الدِّرْهَمِ وَشَدَّدَ فِي ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 139,
			"arabicnumber": 139,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ أَبُو بَدْرٍ، عَنْ عَلِيِّ بْنِ عَبْدِ الأَعْلَى، عَنْ أَبِي سَهْلٍ، عَنْ مُسَّةَ الأَزْدِيَّةِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَتِ النُّفَسَاءُ تَجْلِسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَرْبَعِينَ يَوْمًا فَكُنَّا نَطْلِي وُجُوهَنَا بِالْوَرْسِ مِنَ الْكَلَفِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ أَبِي سَهْلٍ عَنْ مُسَّةَ الأَزْدِيَّةِ عَنْ أُمِّ سَلَمَةَ ‏.‏ وَاسْمُ أَبِي سَهْلٍ كَثِيرُ بْنُ زِيَادٍ ‏.‏ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَلِيُّ بْنُ عَبْدِ الأَعْلَى ثِقَةٌ وَأَبُو سَهْلٍ ثِقَةٌ ‏.‏ وَلَمْ يَعْرِفْ مُحَمَّدٌ هَذَا الْحَدِيثَ إِلاَّ مِنْ حَدِيثِ أَبِي سَهْلٍ ‏.‏ وَقَدْ أَجْمَعَ أَهْلُ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ عَلَى أَنَّ النُّفَسَاءَ تَدَعُ الصَّلاَةَ أَرْبَعِينَ يَوْمًا إِلاَّ أَنْ تَرَى الطُّهْرَ قَبْلَ ذَلِكَ فَإِنَّهَا تَغْتَسِلُ وَتُصَلِّي ‏.‏ فَإِذَا رَأَتِ الدَّمَ بَعْدَ الأَرْبَعِينَ فَإِنَّ أَكْثَرَ أَهْلِ الْعِلْمِ قَالُوا لاَ تَدَعُ الصَّلاَةَ بَعْدَ الأَرْبَعِينَ وَهُوَ قَوْلُ أَكْثَرِ الْفُقَهَاءِ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏ وَيُرْوَى عَنِ الْحَسَنِ الْبَصْرِيِّ أَنَّهُ قَالَ إِنَّهَا تَدَعُ الصَّلاَةَ خَمْسِينَ يَوْمًا إِذَا لَمْ تَرَ الطُّهْرَ ‏.‏ وَيُرْوَى عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ وَالشَّعْبِيِّ سِتِّينَ يَوْمًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 140,
			"arabicnumber": 140,
			"text": "حَدَّثَنَا بُنْدَارٌ، مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَعْمَرٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي غُسْلٍ وَاحِدٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي رَافِعٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ بِغُسْلٍ وَاحِدٍ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْهُمُ الْحَسَنُ الْبَصْرِيُّ أَنْ لاَ بَأْسَ أَنْ يَعُودَ قَبْلَ أَنْ يَتَوَضَّأَ ‏.‏ وَقَدْ رَوَى مُحَمَّدُ بْنُ يُوسُفَ هَذَا عَنْ سُفْيَانَ فَقَالَ عَنْ أَبِي عُرْوَةَ عَنْ أَبِي الْخَطَّابِ عَنْ أَنَسٍ ‏.‏ وَأَبُو عُرْوَةَ هُوَ مَعْمَرُ بْنُ رَاشِدٍ ‏.‏ وَأَبُو الْخَطَّابِ قَتَادَةُ بْنُ دِعَامَةَ ‏.‏ قَالَ أَبُو عِيسَى وَرَوَاهُ بَعْضُهُمْ عَنْ مُحَمَّدِ بْنِ يُوسُفَ عَنْ سُفْيَانَ عَنِ ابْنِ أَبِي عُرْوَةَ عَنْ أَبِي الْخَطَّابِ ‏.‏ وَهُوَ خَطَأٌ وَالصَّحِيحُ عَنْ أَبِي عُرْوَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 141,
			"arabicnumber": 141,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ ثُمَّ أَرَادَ أَنْ يَعُودَ فَلْيَتَوَضَّأْ بَيْنَهُمَا وُضُوءًا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي سَعِيدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ عُمَرَ بْنِ الْخَطَّابِ وَقَالَ بِهِ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ قَالُوا إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ ثُمَّ أَرَادَ أَنْ يَعُودَ فَلْيَتَوَضَّأْ قَبْلَ أَنْ يَعُودَ ‏.‏ وَأَبُو الْمُتَوَكِّلِ اسْمُهُ عَلِيُّ بْنُ دَاوُدَ ‏.‏ وَأَبُو سَعِيدٍ الْخُدْرِيُّ اسْمُهُ سَعْدُ بْنُ مَالِكِ بْنِ سِنَانٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الأَرْقَمِ، قَالَ أُقِيمَتِ الصَّلاَةُ فَأَخَذَ بِيَدِ رَجُلٍ فَقَدَّمَهُ وَكَانَ إِمَامَ قَوْمِهِ وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا أُقِيمَتِ الصَّلاَةُ وَوَجَدَ أَحَدُكُمُ الْخَلاَءَ فَلْيَبْدَأْ بِالْخَلاَءِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَأَبِي هُرَيْرَةَ وَثَوْبَانَ وَأَبِي أُمَامَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ الأَرْقَمِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ هَكَذَا رَوَى مَالِكُ بْنُ أَنَسٍ وَيَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ وَغَيْرُ وَاحِدٍ مِنَ الْحُفَّاظِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الأَرْقَمِ ‏.‏ وَرَوَى وُهَيْبٌ وَغَيْرُهُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ رَجُلٍ عَنْ عَبْدِ اللَّهِ بْنِ الأَرْقَمِ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ ‏.‏ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ قَالاَ لاَ يَقُومُ إِلَى الصَّلاَةِ وَهُوَ يَجِدُ شَيْئًا مِنَ الْغَائِطِ وَالْبَوْلِ ‏.‏ وَقَالاَ إِنْ دَخَلَ فِي الصَّلاَةِ فَوَجَدَ شَيْئًا مِنْ ذَلِكَ فَلاَ يَنْصَرِفْ مَا لَمْ يَشْغَلْهُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لاَ بَأْسَ أَنْ يُصَلِّيَ وَبِهِ غَائِطٌ أَوْ بَوْلٌ مَا لَمْ يَشْغَلْهُ ذَلِكَ عَنِ الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 143,
			"arabicnumber": 143,
			"text": "حَدَّثَنَا أَبُو رَجَاءٍ، قُتَيْبَةُ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ مُحَمَّدِ بْنِ عُمَارَةَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أُمِّ وَلَدٍ، لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَتْ قُلْتُ لأُمِّ سَلَمَةَ إِنِّي امْرَأَةٌ أُطِيلُ ذَيْلِي وَأَمْشِي فِي الْمَكَانِ الْقَذِرِ فَقَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُطَهِّرُهُ مَا بَعْدَهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ نَتَوَضَّأُ مِنَ الْمَوْطَإِ ‏.‏ قَالَ أَبُو عِيسَى وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ قَالُوا إِذَا وَطِئَ الرَّجُلُ عَلَى الْمَكَانِ الْقَذِرِ أَنَّهُ لاَ يَجِبُ عَلَيْهِ غَسْلُ الْقَدَمِ إِلاَّ أَنْ يَكُونَ رَطْبًا فَيَغْسِلَ مَا أَصَابَهُ ‏.‏ قَالَ أَبُو عِيسَى وَرَوَى عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ هَذَا الْحَدِيثَ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ مُحَمَّدِ بْنِ عُمَارَةَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أُمِّ وَلَدٍ لِهُودِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أُمِّ سَلَمَةَ ‏.‏ وَهُوَ وَهَمٌ وَلَيْسَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ ابْنٌ يُقَالُ لَهُ هُودٌ وَإِنَّمَا هُوَ عَنْ أُمِّ وَلَدٍ لإِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أُمِّ سَلَمَةَ ‏.‏ وَهَذَا الصَّحِيحُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 144,
			"arabicnumber": 144,
			"text": "حَدَّثَنَا أَبُو حَفْصٍ، عَمْرُو بْنُ عَلِيٍّ الْفَلاَّسُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنْ عَمَّارِ بْنِ يَاسِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ بِالتَّيَمُّمِ لِلْوَجْهِ وَالْكَفَّيْنِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَمَّارٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ عَنْ عَمَّارٍ مِنْ غَيْرِ وَجْهٍ ‏.‏ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ عَلِيٌّ وَعَمَّارٌ وَابْنُ عَبَّاسٍ وَغَيْرِ وَاحِدٍ مِنَ التَّابِعِينَ مِنْهُمُ الشَّعْبِيُّ وَعَطَاءٌ وَمَكْحُولٌ قَالُوا التَّيَمُّمُ ضَرْبَةٌ لِلْوَجْهِ وَالْكَفَّيْنِ ‏.‏ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْهُمُ ابْنُ عُمَرَ وَجَابِرٌ وَإِبْرَاهِيمُ وَالْحَسَنُ قَالُوا التَّيَمُّمُ ضَرْبَةٌ لِلْوَجْهِ وَضَرْبَةٌ لِلْيَدَيْنِ إِلَى الْمِرْفَقَيْنِ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَمَالِكٌ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَمَّارٍ فِي التَّيَمُّمِ أَنَّهُ قَالَ لِلْوَجْهِ وَالْكَفَّيْنِ مِنْ غَيْرِ وَجْهٍ ‏.‏ وَقَدْ رُوِيَ عَنْ عَمَّارٍ أَنَّهُ قَالَ تَيَمَّمْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَنَاكِبِ وَالآبَاطِ ‏.‏ فَضَعَّفَ بَعْضُ أَهْلِ الْعِلْمِ حَدِيثَ عَمَّارٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي التَّيَمُّمِ لِلْوَجْهِ وَالْكَفَّيْنِ لَمَّا رُوِيَ عَنْهُ حَدِيثُ الْمَنَاكِبِ وَالآبَاطِ ‏.‏ قَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ مَخْلَدٍ الْحَنْظَلِيُّ حَدِيثُ عَمَّارٍ فِي التَّيَمُّمِ لِلْوَجْهِ وَالْكَفَّيْنِ هُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَحَدِيثُ عَمَّارٍ تَيَمَّمْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَنَاكِبِ وَالآبَاطِ لَيْسَ هُوَ بِمُخَالِفٍ لِحَدِيثِ الْوَجْهِ وَالْكَفَّيْنِ لأَنَّ عَمَّارًا لَمْ يَذْكُرْ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُمْ بِذَلِكَ وَإِنَّمَا قَالَ فَعَلْنَا كَذَا وَكَذَا فَلَمَّا سَأَلَ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ بِالْوَجْهِ وَالْكَفَّيْنِ فَانْتَهَى إِلَى مَا عَلَّمَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم الْوَجْهِ وَالْكَفَّيْنِ وَالدَّلِيلُ عَلَى ذَلِكَ مَا أَفْتَى بِهِ عَمَّارٌ بَعْدَ النَّبِيِّ صلى الله عليه وسلم فِي التَّيَمُّمِ أَنَّهُ قَالَ الْوَجْهِ وَالْكَفَّيْنِ فَفِي هَذَا دَلاَلَةٌ أَنَّهُ انْتَهَى إِلَى مَا عَلَّمَهُ النَّبِيُّ صلى الله عليه وسلم فَعَلَّمَهُ إِلَى الْوَجْهِ وَالْكَفَّيْنِ ‏.‏ قَالَ وَسَمِعْتُ أَبَا زُرْعَةَ عُبَيْدَ اللَّهِ بْنَ عَبْدِ الْكَرِيمِ يَقُولُ لَمْ أَرَ بِالْبَصْرَةِ أَحْفَظَ مِنْ هَؤُلاَءِ الثَّلاَثَةِ عَلِيِّ بْنِ الْمَدِينِيِّ وَابْنِ الشَّاذَكُونِيِّ وَعَمْرِو بْنِ عَلِيٍّ الْفَلاَّسِ ‏.‏ قَالَ أَبُو زُرْعَةَ وَرَوَى عَفَّانُ بْنُ مُسْلِمٍ عَنْ عَمْرِو بْنِ عَلِيٍّ حَدِيثًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 145,
			"arabicnumber": 145,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هُشَيْمٌ، عَنْ مُحَمَّدِ بْنِ خَالِدٍ الْقُرَشِيِّ، عَنْ دَاوُدَ بْنِ حُصَيْنٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ سُئِلَ عَنِ التَّيَمُّمِ، فَقَالَ إِنَّ اللَّهَ قَالَ فِي كِتَابِهِ حِينَ ذَكَرَ الْوُضُوءَ‏:‏ ‏(‏فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إلى المَرَافِقِ‏)‏، وَقَالَ في التَّيَمُّمِ‏:‏ ‏(‏فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ‏)‏ وَقَالَ‏:‏ ‏(‏وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوا أَيْدِيِهْمَا‏)‏ فَكَانَتِ السُّنَّةُ في القَطْعِ الكَفَّينِ، إِنَّمَا هُوَ الوَجْهُ وَالكَفَّانِ، يَعْنِي التَّيَمُّمَ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 146,
			"arabicnumber": 146,
			"text": "حَدَّثَنَا أَبُو سَعِيدٍ عَبْدُ اللَّهِ بْنُ سَعِيدٍ الأَشَجُّ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، وَعُقْبَةُ بْنُ خَالِدٍ، قَالاَ حَدَّثَنَا الأَعْمَشُ، وَابْنُ أَبِي لَيْلَى، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ سَلِمَةَ، عَنْ عَلِيٍّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقْرِئُنَا الْقُرْآنَ عَلَى كُلِّ حَالٍ مَا لَمْ يَكُنْ جُنُبًا ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَبِهِ قَالَ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ ‏.‏ قَالُوا يَقْرَأُ الرَّجُلُ الْقُرْآنَ عَلَى غَيْرِ وُضُوءٍ وَلاَ يَقْرَأُ فِي الْمُصْحَفِ إِلاَّ وَهُوَ طَاهِرٌ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 147,
			"arabicnumber": 147,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ دَخَلَ أَعْرَابِيٌّ الْمَسْجِدَ وَالنَّبِيُّ صلى الله عليه وسلم جَالِسٌ فَصَلَّى فَلَمَّا فَرَغَ قَالَ اللَّهُمَّ ارْحَمْنِي وَمُحَمَّدًا وَلاَ تَرْحَمْ مَعَنَا أَحَدًا ‏.‏ فَالْتَفَتَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَقَدْ تَحَجَّرْتَ وَاسِعًا ‏\"‏ ‏.‏ فَلَمْ يَلْبَثْ أَنْ بَالَ فِي الْمَسْجِدِ فَأَسْرَعَ إِلَيْهِ النَّاسُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَهْرِيقُوا عَلَيْ��ِ سَجْلاً مِنْ مَاءٍ أَوْ دَلْوًا مِنْ مَاءٍ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّمَا بُعِثْتُمْ مُيَسِّرِينَ وَلَمْ تُبْعَثُوا مُعَسِّرِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 148,
			"arabicnumber": 148,
			"text": "قَالَ سَعِيدٌ قَالَ سُفْيَانُ وَحَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، نَحْوَ هَذَا ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، وَابْنِ، عَبَّاسٍ وَوَاثِلَةَ بْنِ الأَسْقَعِ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَدْ رَوَى يُونُسُ هَذَا الْحَدِيثَ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 148
			}
		}
	]
}