{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"10": "The Book on Jana''iz (Funerals)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يُصِيبُ الْمُؤْمِنَ شَوْكَةٌ فَمَا فَوْقَهَا إِلاَّ رَفَعَهُ اللَّهُ بِهَا دَرَجَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةً ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ وَأَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ وَأَبِي هُرَيْرَةَ وَأَبِي أُمَامَةَ وَأَبِي سَعِيدٍ وَأَنَسٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَسَدِ بْنِ كُرْزٍ وَجَابِرِ بْنِ عَبْدِ اللَّهِ وَعَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ وَأَبِي مُوسَى ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبِي، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ شَيْءٍ يُصِيبُ الْمُؤْمِنَ مِنْ نَصَبٍ وَلاَ حَزَنٍ وَلاَ وَصَبٍ حَتَّى الْهَمُّ يَهُمُّهُ إِلاَّ يُكَفِّرُ اللَّهُ بِهِ عَنْهُ سَيِّئَاتِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ فِي هَذَا الْبَابِ ‏.‏ قَالَ وَسَمِعْتُ الْجَارُودَ يَقُولُ سَمِعْتُ وَكِيعًا يَقُولُ لَمْ يُسْمَعْ فِي الْهَمِّ أَنَّهُ يَكُونُ كَفَّارَةً إِلاَّ فِي هَذَا الْحَدِيثِ ‏.‏ قَالَ وَقَدْ رَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ رضى الله عنه عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الْمُسْلِمَ إِذَا عَادَ أَخَاهُ الْمُسْلِمَ لَمْ يَزَلْ فِي خُرْفَةِ الْجَنَّةِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ عَلِيٍّ وَأَبِي مُوسَى وَالْبَرَاءِ وَأَبِي هُرَيْرَةَ وَأَنَسٍ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ثَوْبَانَ حَدِيثٌ حَسَنٌ ‏.‏ وَرَوَى أَبُو غِفَارٍ وَعَاصِمٌ الأَحْوَلُ هَذَا الْحَدِيثَ عَنْ أَبِي قِلاَبَةَ عَنْ أَبِي الأَشْعَثِ عَنْ أَبِي أَسْمَاءَ عَنْ ثَوْبَانَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ وَسَمِعْتُ مُحَمَّدًا يَقُولُ مَنْ رَوَى هَذَا الْحَدِيثَ عَنْ أَبِي الأَشْعَثِ عَنْ أَبِي أَسْمَاءَ فَهُوَ أَصَحُّ ‏.‏ قَالَ مُحَمَّدٌ وَأَحَادِيثُ أَبِي قِلاَبَةَ إِنَّمَا هِيَ عَنْ أَبِي أَسْمَاءَ إِلاَّ هَذَا الْحَدِيثَ فَهُوَ عِنْدِي عَنْ أَبِي الأَشْعَثِ عَنْ أَبِي أَسْمَاءَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ وَزِيرٍ الْوَاسِطِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ وَزَادَ فِيهِ قِيلَ مَا خُرْفَةُ الْجَنَّةِ قَالَ ‏ \"‏ جَنَاهَا ‏\"‏ ‏.‏ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ خَالِدٍ ‏.‏ وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِي الأَشْعَثِ ‏.‏ قَالَ أَبُو عِيسَى وَرَوَاهُ بَعْضُهُمْ عَنْ حَمَّادِ بْنِ زَيْدٍ وَلَمْ يَرْفَعْهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ ثُوَيْرٍ، هُوَ ابْنُ أَبِي فَاخِتَةَ عَنْ أَبِيهِ، قَالَ أَخَذَ عَلِيٌّ بِيَدِي قَالَ انْطَلِقْ بِنَا إِلَى الْحَسَنِ نَعُودُهُ ‏.‏ فَوَجَدْنَا عِنْدَهُ أَبَا مُوسَى فَقَالَ عَلِيٌّ عَلَيْهِ السَّلاَمُ أَعَائِدًا جِئْتَ يَا أَبَا مُوسَى أَمْ زَائِرًا فَقَالَ لاَ بَلْ عَائِدًا ‏.‏ فَقَالَ عَلِيٌّ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنْ مُسْلِمٍ يَعُودُ مُسْلِمًا غُدْوَةً إِلاَّ صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُمْسِيَ وَإِنْ عَادَهُ عَشِيَّةً إِلاَّ صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُصْبِحَ وَكَانَ لَهُ خَرِيفٌ فِي الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَقَدْ رُوِيَ عَنْ عَلِيٍّ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ مِنْهُمْ مَنْ وَقَفَهُ وَلَمْ يَرْفَعْهُ ‏.‏ وَأَبُو فَاخِتَةَ اسْمُهُ سَعِيدُ بْنُ عِلاَقَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ، قَالَ دَخَلْتُ عَلَى خَبَّابٍ وَقَدِ اكْتَوَى فِي بَطْنِهِ فَقَالَ مَا أَعْلَمُ أَحَدًا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم لَقِيَ مِنَ الْبَلاَءِ مَا لَقِيتُ لَقَدْ كُنْتُ وَمَا أَجِدُ دِرْهَمًا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَفِي نَاحِيَةٍ مِنْ بَيْتِي أَرْبَعُونَ أَلْفًا وَلَوْلاَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا - أَوْ نَهَى - أَنْ نَتَمَنَّى الْمَوْتَ لَتَمَنَّيْتُ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَأَبِي هُرَيْرَةَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ خَبَّابٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ لِضُرٍّ نَزَلَ بِهِ وَلْيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏.\"‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "حَدَّثَنَا بِذَلِكَ عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِذَلِكَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الْبَصْرِيُّ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ جِبْرِيلَ، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا مُحَمَّدُ اشْتَكَيْتَ قَالَ ‏ \"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ بِاسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ مِنْ شَرِّ كُلِّ نَفْسٍ وَعَيْنِ حَاسِدٍ بِاسْمِ اللَّهِ أَرْقِيكَ وَاللَّهُ يَشْفِيكَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، قَالَ دَخَلْتُ أَنَا وَثَابِتٌ الْبُنَانِيُّ، عَلَى أَنَسِ بْنِ مَالِكٍ فَقَالَ ثَابِتٌ يَا أَبَا حَمْزَةَ اشْتَكَيْتُ ‏.‏ فَقَالَ أَنَسٌ أَفَلاَ أَرْقِيكَ بِرُقْيَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ بَلَى ‏.‏ قَالَ ‏ \"‏ اللَّهُمَّ رَبَّ النَّاسِ مُذْهِبَ الْبَاسِ اشْفِ أَنْتَ الشَّافِي لاَ شَافِيَ إِلاَّ أَنْتَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي سَعِيدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَسَأَلْتُ أَبَا زُرْعَةَ عَنْ هَذَا الْحَدِيثِ فَقُلْتُ لَهُ رِوَايَةُ عَبْدِ الْعَزِيزِ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ أَصَحُّ أَوْ حَدِيثُ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ قَالَ كِلاَهُمَا صَحِيحٌ ‏.‏ وَرَوَى عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ عَنْ أَبِيهِ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ وَعَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ يَبِيتُ لَيْلَتَيْنِ وَلَهُ شَيْءٌ يُوصِي فِيهِ إِلاَّ وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ أَبِي أَوْفَى ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ سَعْدِ بْنِ مَالِكٍ، قَالَ عَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا مَرِيضٌ فَقَالَ ‏\"‏ أَوْصَيْتَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ بِكَمْ ‏\"‏ ‏.‏ قُلْتُ بِمَالِي كُلِّهِ فِي سَبِيلِ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَمَا تَرَكْتَ لِوَلَدِكَ ‏\"‏ ‏.‏ قُلْتُ هُمْ أَغْنِيَاءُ بِخَيْرٍ ‏.‏ قَالَ ‏\"‏ أَوْصِ بِالْعُشْرِ ‏\"‏ ‏.‏ فَمَا زِلْتُ أُنَاقِصُهُ حَتَّى قَالَ ‏\"‏ أَوْصِ بِالثُّلُثِ وَالثُّلُثُ كَثِيرٌ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَنَحْنُ نَسْتَحِبُّ أَنْ يَنْقُصَ مِنَ الثُّلُثِ لِقَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالثُّلُثُ كَثِيرٌ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ سَعْدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ وَقَدْ رُوِيَ عَنْهُ ‏\"‏ وَالثُّلُثُ كَبِيرٌ ‏\"‏ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لاَ يَرَوْنَ أَنْ يُوصِيَ الرَّجُلُ بِأَكْثَرَ مِنَ الثُّلُثِ وَيَسْتَحِبُّونَ أَنْ يَنْقُصَ مِنَ الثُّلُثِ ‏.‏ قَالَ سُفْيَانُ الثَّوْرِيُّ كَانُوا يَسْتَحِبُّونَ فِي الْوَصِيَّةِ الْخُمُسَ دُونَ الرُّبُعِ وَالرُّبُعَ دُونَ الثُّلُثِ وَمَنْ أَوْصَى بِالثُّلُثِ فَلَمْ يَتْرُكْ شَيْئًا وَلاَ يَجُوزُ لَهُ إِلاَّ الثُّلُثُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ الْبَصْرِيُّ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ يَحْيَى بْنِ عُمَارَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَأُمِّ سَلَمَةَ وَعَائِشَةَ وَجَابِرٍ وَسُعْدَى الْمُرِّيَّةِ وَهِيَ امْرَأَةُ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي سَعِيدٍ حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا حَضَرْتُمُ الْمَرِيضَ أَوِ الْمَيِّتَ فَقُولُوا خَيْرًا فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا مَاتَ أَبُو سَلَمَةَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سَلَمَةَ مَاتَ ‏.‏ قَالَ ‏\"‏ فَقُولِي اللَّهُمَّ اغْفِرْ لِي وَلَهُ وَأَعْقِبْنِي مِنْهُ عُقْبَى حَسَنَةً ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ فَأَعْقَبَنِي اللَّهُ مِنْهُ مَنْ هُوَ خَيْرٌ مِنْهُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى شَقِيقٌ هُوَ ابْنُ سَلَمَةَ أَبُو وَائِلٍ الأَسَدِيُّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أُمِّ سَلَمَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ كَانَ يُسْتَحَبُّ أَنْ يُلَقَّنَ الْمَرِيضُ عِنْدَ الْمَوْتِ قَوْلَ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا قَالَ ذَلِكَ مَرَّةً فَمَا لَمْ يَتَكَلَّمْ بَعْدَ ذَلِكَ فَلاَ يَنْبَغِي أَنْ يُلَقَّنَ وَلاَ يُكْثَرَ عَلَيْهِ فِي هَذَا ‏.‏ وَرُوِيَ عَنِ ابْنِ الْمُبَارَكِ أَنَّهُ لَمَّا حَضَرَتْهُ الْوَفَاةُ جَعَلَ رَجُلٌ يُلَقِّنُهُ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَكْثَرَ عَلَيْهِ فَقَالَ لَهُ عَبْدُ اللَّهِ إِذَا قُلْتُ مَرَّةً فَأَنَا عَلَى ذَلِكَ مَا لَمْ أَتَكَلَّمْ بِكَلاَمٍ ‏.‏ وَإِنَّمَا مَعْنَى قَوْلِ عَبْدِ اللَّهِ إِنَّمَا أَرَادَ مَا رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ آخِرُ قَوْلِهِ لاَ إِلَهَ إِلاَّ اللَّهُ دَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ مُوسَى بْنِ سَرْجِسَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ بِالْمَوْتِ وَعِنْدَهُ قَدَحٌ فِيهِ مَاءٌ وَهُوَ يُدْخِلُ يَدَهُ فِي الْقَدَحِ ثُمَّ يَمْسَحُ وَجْهَهُ بِالْمَاءِ ثُمَّ يَقُولُ ‏\"‏ اللَّهُمَّ أَعِنِّي عَلَى غَمَرَاتِ الْمَوْتِ ‏\"‏ ‏.‏ أَوْ ‏\"‏ سَكَرَاتِ الْمَوْتِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَغْدَادِيُّ، حَدَّثَنَا مُبَشِّرُ بْنُ إِسْمَاعِيلَ الْحَلَبِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنْ عَائِشَةَ، قَالَتْ مَا أَغْبِطُ أَحَدًا بِهَوْنِ مَوْتٍ بَعْدَ الَّذِي رَأَيْتُ مِنْ شِدَّةِ مَوْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ سَأَلْتُ أَبَا زُرْعَةَ عَنْ هَذَا الْحَدِيثِ وَقُلْتُ لَهُ مَنْ عَبْدُ الرَّحْمَنِ بْنُ الْعَلاَءِ فَقَالَ هُوَ ابْنُ الْعَلاَءِ بْنِ اللَّجْلاَجِ ‏.‏ وَإِنَّمَا عَرَّفَهُ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا حُسَامُ بْنُ الْمِصَكِّ، قَالَ حَدَّثَنَا أَبُو مَعْشَرٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ نَفْسَ الْمُؤْمِنِ تَخْرُجُ رَشْحًا وَلاَ أُحِبُّ مَوْتًا كَمَوْتِ الْحِمَارِ ‏\"‏ ‏.‏ قِيلَ وَمَا مَوْتُ الْحِمَارِ قَالَ ‏\"‏ مَوْتُ الْفَجْأَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا مُبَشِّرُ بْنُ إِسْمَاعِيلَ الْحَلَبِيُّ، عَنْ تَمَّامِ بْنِ نَجِيحٍ، عَنِ الْحَسَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ حَافِظَيْنِ رَفَعَا إِلَى اللَّهِ مَا حَفِظَا مِنْ لَيْلٍ أَوْ نَهَارٍ فَيَجِدُ اللَّهُ فِي أَوَّلِ الصَّحِيفَةِ وَفِي آخِرِ الصَّحِيفَةِ خَيْرًا إِلاَّ قَالَ اللَّهُ تَعَالَى أُشْهِدُكُمْ أَنِّي قَدْ غَفَرْتُ لِعَبْدِي مَا بَيْنَ طَرَفَىِ الصَّحِيفَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمُؤْمِنُ يَمُوتُ بِعَرَقِ الْجَبِينِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ قَالَ بَعْضُ أَهْلِ الْعِلْمِ لا نَعْرِفُ لِقَتَادَةَ سَمَاعًا مِنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ الْكُوفِيُّ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْبَزَّازُ الْبَغْدَادِيُّ، قَالاَ حَدَّثَنَا سَيَّارٌ، هُوَ ابْنُ حَاتِمٍ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى شَابٍّ وَهُوَ فِي الْمَوْتِ فَقَالَ ‏\"‏ كَيْفَ تَجِدُكَ ‏\"‏ ‏.‏ قَالَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنِّي أَرْجُو اللَّهَ وَإِنِّي أَخَافُ ذُنُوبِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَجْتَمِعَانِ فِي قَلْبِ عَبْدٍ فِي مِثْلِ هَذَا الْمَوْطِنِ إِلاَّ أَعْطَاهُ اللَّهُ مَا يَرْجُو وَآمَنَهُ مِمَّا يَخَافُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَقَدْ رَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ ثَابِتٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ، وَهَارُونُ بْنُ الْمُغِيرَةِ، عَنْ عَنْبَسَةَ، عَنْ أَبِي حَمْزَةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِيَّاكُمْ وَالنَّعْىَ فَإِنَّ النَّعْىَ مِنْ عَمَلِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ وَالنَّعْىُ أَذَانٌ بِالْمَيِّتِ ‏.‏ وَفِي الْبَابِ عَنْ حُذَيْفَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْوَلِيدِ الْعَدَنِيُّ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ أَبِي حَمْزَةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، نَحْوَهُ وَلَمْ يَرْفَعْهُ وَلَمْ يَذْكُرْ فِيهِ وَالنَّعْىُ أَذَانٌ بِالْمَيِّتِ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَنْبَسَةَ عَنْ أَبِي حَمْزَةَ ‏.‏ وَأَبُو حَمْزَةَ هُوَ مَيْمُونٌ الأَعْوَرُ وَلَيْسَ هُوَ بِالْقَوِيِّ عِنْدَ أَهْلِ الْحَدِيثِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَقَدْ كَرِهَ بَعْضُ أَهْلِ الْعِلْمِ النَّعْىَ وَالنَّعْىُ عِنْدَهُمْ أَنْ يُنَادَى فِي النَّاسِ أَنَّ فُلاَنًا مَاتَ لِيَشْهَدُوا جَنَازَتَهُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لاَ بَأْسَ أَنْ يُعْلِمَ أَهْلَ قَرَابَتِهِ وَإِخْوَانَهُ ‏.‏ وَرُوِيَ عَنْ إِبْرَاهِيمَ أَنَّهُ قَالَ لاَ بَأْسَ بِأَنْ يُعْلِمَ الرَّجُلُ قَرَابَتَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ بَكْرِ بْنِ خُنَيْسٍ، حَدَّثَنَا حَبِيبُ بْنُ سُلَيْمٍ الْعَبْسِيُّ، عَنْ بِلاَلِ بْنِ يَحْيَى الْعَبْسِيِّ، عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ، قَالَ إِذَا مِتُّ فَلاَ تُؤْذِنُوا بِي أَحَدًا إِنِّي أَخَافُ أَنْ يَكُونَ نَعْيًا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنِ النَّعْىِ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 987,
			"arabicnumber": 987,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سَعْدِ بْنِ سِنَانٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الصَّبْرُ فِي الصَّدْمَةِ الأُولَى ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَبَّلَ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ وَهُوَ يَبْكِي ‏.‏ أَوْ قَالَ عَيْنَاهُ تَذْرِفَانِ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَجَابِرٍ وَعَائِشَةَ قَالُوا إِنَّ أَبَا بَكْرٍ قَبَّلَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ مَيِّتٌ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا خَالِدٌ، وَمَنْصُورٌ، وَهِشَامٌ، فَأَمَّا خَالِدٌ وَهِشَامٌ فَقَالاَ عَنْ مُحَمَّدٍ وَحَفْصَةَ وَقَالَ مَنْصُورٌ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اغْسِلْنَهَا وِتْرًا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ وَاغْسِلْنَهَا بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا بِهِ ‏\"‏ ‏.‏ قَالَ هُشَيْمٌ وَفِي حَدِيثِ غَيْرِ هَؤُلاَءِ وَلاَ أَدْرِي وَلَعَلَّ هِشَامًا مِنْهُمْ قَالَتْ وَضَفَّرْنَا شَعْرَهَا ثَلاَثَةَ قُرُونٍ ‏.‏ قَالَ هُشَيْمٌ أَظُنُّهُ قَالَ فَأَلْقَيْنَاهُ خَلْفَهَا ‏.‏ قَالَ هُشَيْمٌ فَحَدَّثَنَا خَالِدٌ مِنْ بَيْنِ الْقَوْمِ عَنْ حَفْصَةَ وَمُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْ وَقَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أُمِّ سُلَيْمٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أُمِّ عَطِيَّةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ ‏.‏ وَقَدْ رُوِيَ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ أَنَّهُ قَالَ غُسْلُ الْمَيِّتِ كَالْغُسْلِ مِنَ الْجَنَابَةِ ‏.‏ وَقَالَ مَالِكُ بْنُ أَنَسٍ لَيْسَ لِغُسْلِ الْمَيِّتِ عِنْدَنَا حَدٌّ مُؤَقَّتٌ وَلَيْسَ لِذَلِكَ صِفَةٌ مَعْلُومَةٌ وَلَكِنْ يُطَهَّرُ ‏.‏ وَقَالَ الشَّافِعِيُّ إِنَّمَا قَالَ مَالِكٌ قَوْلاً مُجْمَلاً يُغَسَّلُ وَيُنْقَى وَإِذَا أُنْقِيَ الْمَيِّتُ بِمَاءٍ قَرَاحٍ أَوْ مَاءٍ غَيْرِهِ أَجْزَأَ ذَلِكَ مِنْ غُسْلِهِ وَلَكِنْ أَحَبُّ إِلَىَّ أَنْ يُغْسَلَ ثَلاَثًا فَصَاعِدًا لاَ يُنْقَصُ عَنْ ثَلاَثٍ لِمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا ‏\"‏ ‏.‏ وَإِنْ أَنْقَوْا فِي أَقَلَّ مِنْ ثَلاَثِ مَرَّاتٍ أَجْزَأَ وَلاَ يَرَى أَنَّ قَوْلَ النَّبِيِّ صلى الله عليه وسلم إِنَّمَا هُوَ عَلَى مَعْنَى الإِنْقَاءِ ثَلاَثًا أَوْ خَمْسًا وَلَمْ يُؤَقِّتْ ‏.‏ وَكَذَلِكَ قَالَ الْفُقَهَاءُ وَهُمْ أَعْلَمُ بِمَعَانِي الْحَدِيثِ ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ وَتَكُونُ الْغَسَلاَتُ بِمَاءٍ وَسِدْرٍ وَيَكُونُ فِي الآخِرَةِ شَيْءٌ مِنْ كَافُورٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، وَشَبَابَةُ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ خُلَيْدِ بْنِ جَعْفَرٍ، سَمِعَ أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَطْيَبُ الطِّيبِ الْمِسْكُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبِي، عَنْ شُعْبَةَ، عَنْ خُلَيْدِ بْنِ جَعْفَرٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنِ الْمِسْكِ فَقَالَ ‏ \"‏ هُوَ أَطْيَبُ طِيبِكُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ وَقَدْ كَرِهَ بَعْضُ أَهْلِ الْعِلْمِ الْمِسْكَ لِلْمَيِّتِ ‏.‏ قَالَ وَقَدْ رَوَاهُ الْمُسْتَمِرُّ بْنُ الرَّيَّانِ أَيْضًا عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ عَلِيٌّ قَالَ يَحْيَى بْنُ سَعِيدٍ الْمُسْتَمِرُّ بْنُ الرَّيَّانِ ثِقَةٌ ‏.‏ قَالَ يَحْيَى خُلَيْدُ بْنُ جَعْفَرٍ ثِقَةٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنْ غُسْلِهِ الْغُسْلُ وَمِنْ حَمْلِهِ الْوُضُوءُ ‏\"‏ ‏.‏ يَعْنِي الْمَيِّتَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ مَوْقُوفًا ‏.‏ وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي الَّذِي يُغَسِّلُ الْمَيِّتَ فَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ إِذَا غَسَّلَ مَيِّتًا فَعَلَيْهِ الْغُسْلُ ‏.‏ وَقَالَ بَعْضُهُمْ عَلَيْهِ الْوُضُوءُ ‏.‏ وَقَالَ مَالِكُ بْنُ أَنَسٍ أَسْتَحِبُّ الْغُسْلَ مِنْ غُسْلِ الْمَيِّتِ وَلاَ أَرَى ذَلِكَ وَاجِبًا ‏.‏ وَهَكَذَا قَالَ الشَّافِعِيُّ ‏.‏ وَقَالَ أَحْمَدُ مَنْ غَسَّلَ مَيِّتًا أَرْجُو أَنْ لاَ يَجِبَ عَلَيْهِ الْغُسْلُ وَأَمَّا الْوُضُوءُ فَأَقَلُّ مَا قِيلَ فِيهِ ‏.‏ وَقَالَ إِسْحَاقُ لاَ بُدَّ مِنَ الْوُضُوءِ ‏.‏ قَالَ وَقَدْ رُوِيَ عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ أَنَّهُ قَالَ لاَ بَأْسَ أَنْ لاَ يَغْتَسِلَ وَلاَ يَتَوَضَّأَ مَنْ غَسَّلَ الْمَيِّتَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْبَسُوا مِنْ ثِيَابِكُمُ الْبَيَاضَ فَإِنَّهَا مِنْ خَيْرِ ثِيَابِكُمْ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ سَمُرَةَ وَابْنِ عُمَرَ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ الَّذِي يَسْتَحِبُّهُ أَهْلُ الْعِلْمِ ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ أَحَبُّ إِلَىَّ أَنْ يُكَفَّنَ فِي ثِيَابِهِ الَّتِي كَانَ يُصَلِّي فِيهَا ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ أَحَبُّ الثِّيَابِ إِلَيْنَا أَنْ يُكَفَّنَ فِيهَا الْبَيَاضُ وَيُسْتَحَبُّ حُسْنُ الْكَفَنِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا وَلِيَ أَحَدُكُمْ أَخَاهُ فَلْيُحَسِّنْ كَفَنَهُ ‏\"‏ ‏.‏ وَفِيهِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ قَالَ سَلاَّمُ بْنُ أَبِي مُطِيعٍ فِي قَوْلِهِ ‏\"‏ وَلْيُحَسِّنْ أَحَدُكُمْ كَفَنَ أَخِيهِ ‏\"‏ قَالَ هُوَ الصِّفَاقُ لَيْسَ بِالْمُرْتَفِعِ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُفِّنَ النَّبِيُّ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ يَمَانِيَةٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ ‏.‏ قَالَ فَذَكَرُوا لِعَائِشَةَ قَوْلَهُمْ فِي ثَوْبَيْنِ وَبُرْدِ حِبَرَةٍ ‏.‏ فَقَالَتْ قَدْ أُتِيَ بِالْبُرْدِ وَلَكِنَّهُمْ رَدُّوهُ وَلَمْ يُكَفِّنُوهُ فِيهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَفَّنَ حَمْزَةَ بْنَ عَبْدِ الْمُطَّلِبِ فِي نَمِرَةٍ فِي ثَوْبٍ وَاحِدٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَابْنِ عَبَّاسٍ وَعَبْدِ اللَّهِ بْنِ مُغَفَّلٍ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ فِي كَفَنِ النَّبِيِّ صلى الله عليه وسلم رِوَايَاتٌ مُخْتَلِفَةٌ وَحَدِيثُ عَائِشَةَ أَصَحُّ الأَحَادِيثِ الَّتِي رُوِيَتْ فِي كَفَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَالْعَمَلُ عَلَى حَدِيثِ عَائِشَةَ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ ‏.‏ قَالَ سُفْيَانُ الثَّوْرِيُّ يُكَفَّنُ الرَّجُلُ فِي ثَلاَثِ أَثْوَابٍ إِنْ شِئْتَ فِي قَمِيصٍ وَلِفَافَتَيْنِ وَإِنْ شِئْتَ فِي ثَلاَثِ لَفَائِفَ وَيُجْزِئُ ثَوْبٌ وَاحِدٌ إِنْ لَمْ يَجِدُوا ثَوْبَيْنِ وَالثَّوْبَانِ يُجْزِيَانِ وَالثَّلاَثَةُ لِمَنْ وَجَدَهَا أَحَبُّ إِلَيْهِمْ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ قَالُوا تُكَفَّنُ الْمَرْأَةُ فِي خَمْسَةِ أَثْوَابٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ جَعْفَرِ بْنِ خَالِدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ لَمَّا جَاءَ نَعْىُ جَعْفَرٍ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اصْنَعُوا لأَهْلِ جَعْفَرٍ طَعَامًا فَإِنَّهُ قَدْ جَاءَهُمْ مَا يَشْغَلُهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ كَانَ بَعْضُ أَهْلِ الْعِلْمِ يَسْتَحِبُّ أَنْ يُوَجَّهَ إِلَى أَهْلِ الْمَيِّتِ شَيْءٌ لِشُغْلِهِمْ بِالْمُصِيبَةِ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏ قَالَ أَبُو عِيسَى وَجَعْفَرُ بْنُ خَالِدٍ هُوَ ابْنُ سَارَةَ وَهُوَ ثِقَةٌ رَوَى عَنْهُ ابْنُ جُرَيْجٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي زُبَيْدٌ الأَيَامِيُّ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ مِنَّا مَنْ شَقَّ الْجُيُوبَ وَضَرَبَ الْخُدُودَ وَدَعَا بِدَعْوَةِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا قُرَّانُ بْنُ تَمَّامٍ الأَسَدِيُّ، وَمَرْوَانُ بْنُ مُعَاوِيَةَ، وَيَزِيدُ بْنُ هَارُونَ، عَنْ سَعِيدِ بْنِ عُبَيْدٍ الطَّائِيِّ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ الأَسَدِيِّ، قَالَ مَاتَ رَجُلٌ مِنَ الأَنْصَارِ يُقَالُ لَهُ قَرَظَةُ بْنُ كَعْبٍ فَنِيحَ عَلَيْهِ فَجَاءَ الْمُغِيرَةُ بْنُ شُعْبَةُ فَصَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ مَا بَالُ النَّوْحِ فِي الإِسْلاَمِ أَمَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ نِيحَ عَلَيْهِ عُذِّبَ بِمَا نِيحَ عَلَيْهِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ عُمَرَ وَعَلِيٍّ وَأَبِي مُوسَى وَقَيْسِ بْنِ عَاصِمٍ وَأَبِي هُرَيْرَةَ وَجُنَادَةَ بْنِ مَالِكٍ وَأَنَسٍ وَأُمِّ عَطِيَّةَ وَسَمُرَةَ وَأَبِي مَالِكٍ الأَشْعَرِيِّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْمُغِيرَةِ حَدِيثٌ غَرِيبٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، أَنْبَأَنَا شُعْبَةُ، وَالْمَسْعُودِيُّ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ أَبِي الرَّبِيعِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَرْبَعٌ فِي أُمَّتِي مِنْ أَمْرِ الْجَاهِلِيَّةِ لَنْ يَدَعَهُنَّ النَّاسُ النِّيَاحَةُ وَالطَّعْنُ فِي الأَحْسَابِ وَالْعَدْوَى أَجْرَبَ بَعِيرٌ فَأَجْرَبَ مِائَةَ بَعِيرٍ مَنْ أَجْرَبَ الْبَعِيرَ الأَوَّلَ وَالأَنْوَاءُ مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَعِمْرَانَ بْنِ حُصَيْنٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ كَرِهَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ الْبُكَاءَ عَلَى الْمَيِّتِ قَالُوا الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏.‏ وَذَهَبُوا إِلَى هَذَا الْحَدِيثِ ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ أَرْجُو إِنْ كَانَ يَنْهَاهُمْ فِي حَيَاتِهِ أَنْ لاَ يَكُونَ عَلَيْهِ مِنْ ذَلِكَ شَيْءٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ عَمَّارٍ، حَدَّثَنِي أَسِيدُ بْنُ أَبِي أَسِيدٍ، أَنَّ مُوسَى بْنَ أَبِي مُوسَى الأَشْعَرِيِّ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا مِنْ مَيِّتٍ يَمُوتُ فَيَقُومُ بَاكِيهِ فَيَقُولُ وَاجَبَلاَهُ وَاسَيِّدَاهُ أَوْ نَحْوَ ذَلِكَ إِلاَّ وُكِّلَ بِهِ مَلَكَانِ يَلْهَزَانِهِ أَهَكَذَا كُنْتَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ يَرْحَمُهُ اللَّهُ لَمْ يَكْذِبْ وَلَكِنَّهُ وَهِمَ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ مَاتَ يَهُودِيًّا ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ وَإِنَّ أَهْلَهُ لَيَبْكُونَ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَقَرَظَةَ بْنِ كَعْبٍ وَأَبِي هُرَيْرَةَ وَابْنِ مَسْعُودٍ وَأُسَامَةَ بْنِ زَيْدٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عَائِشَةَ ‏.‏ وَقَدْ ذَهَبَ أَهْلُ الْعِلْمِ إِلَى هَذَا وَتَأَوَّلُوا هَذِهِ الآيَةَ (ألَّا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى ‏)‏ وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أَخَذَ النَّبِيُّ صلى الله عليه وسلم بِيَدِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فَانْطَلَقَ بِهِ إِلَى ابْنِهِ إِبْرَاهِيمَ فَوَجَدَهُ يَجُودُ بِنَفْسِهِ فَأَخَذَهُ النَّبِيُّ صلى الله عليه وسلم فَوَضَعَهُ فِي حِجْرِهِ فَبَكَى فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ أَتَبْكِي أَوَلَمْ تَكُنْ نَهَيْتَ عَنِ الْبُكَاءِ قَالَ ‏ \"‏ لاَ وَلَكِنْ نَهَيْتُ عَنْ صَوْتَيْنِ أَحْمَقَيْنِ فَاجِرَيْنِ صَوْتٍ عِنْدَ مُصِيبَةٍ خَمْشِ وُجُوهٍ وَشَقِّ جُيُوبٍ وَرَنَّةِ شَيْطَانٍ ‏\"‏ ‏.‏ وَفِي الْحَدِيثِ كَلاَمٌ أَكْثَرُ مِنْ هَذَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ، أَنَّهَا أَخْبَرَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ، وَذُكِرَ، لَهَا أَنَّ ابْنَ عُمَرَ، يَقُولُ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ عَلَيْهِ ‏.‏ فَقَالَتْ عَائِشَةُ غَفَرَ اللَّهُ لأَبِي عَبْدِ الرَّحْمَنِ أَمَا إِنَّهُ لَمْ يَكْذِبْ وَلَكِنَّهُ نَسِيَ أَوْ أَخْطَأَ إِنَّمَا مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى يَهُودِيَّةٍ يُبْكَى عَلَيْهَا فَقَالَ ‏ \"‏ إِنَّهُمْ لَيَبْكُونَ عَلَيْهَا وَإِنَّهَا لَتُعَذَّبُ فِي قَبْرِهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَحْمَدُ بْنُ مَنِيعٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجَنَازَةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1008,
			"arabicnumber": 1008,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، عَنْ هَمَّامٍ، عَنْ مَنْصُورٍ، وَبَكْرٍ الْكُوفِيِّ، وَزِيَادٍ، وَسُفْيَانَ، كُلُّهُمْ يَذْكُرُ أَنَّهُ سَمِعَهُ مِنَ الزُّهْرِيِّ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجَنَازَةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1009,
			"arabicnumber": 1009,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ يَمْشُونَ أَمَامَ الْجَنَازَةِ ‏.‏ قَالَ الزُّهْرِيُّ وَأَخْبَرَنِي سَالِمٌ أَنَّ أَبَاهُ كَانَ يَمْشِي أَمَامَ الْجَنَازَةِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ هَكَذَا رَوَاهُ ابْنُ جُرَيْجٍ وَزِيَادُ بْنُ سَعْدٍ وَغَيْرُ وَاحِدٍ عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ نَحْوَ حَدِيثِ ابْنِ عُيَيْنَةَ ‏.‏ وَرَوَى مَعْمَرٌ وَيُونُسُ بْنُ يَزِيدَ وَمَالِكٌ وَغَيْرُ وَاحِدٍ مِنَ الْحُفَّاظِ عَنِ الزُّهْرِيِّ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَمْشِي أَمَامَ الْجَنَازَةِ ‏.‏ قَالَ الزُّهْرِيُّ وَأَخْبَرَنِي سَالِمٌ أَنَّ أَبَاهُ كَانَ يَمْشِي أَمَامَ الْجَنَازَةِ ‏.‏ وَأَهْلُ الْحَدِيثِ كُلُّهُمْ يَرَوْنَ أَنَّ الْحَدِيثَ الْمُرْسَلَ فِي ذَلِكَ أَصَحُّ ‏.‏ قَالَ أَبُو عِيسَى سَمِعْتُ يَحْيَى بْنَ مُوسَى يَقُولُ قَالَ عَبْدُ الرَّزَّاقِ قَالَ ابْنُ الْمُبَارَكِ حَدِيثُ الزُّهْرِيِّ فِي هَذَا مُرْسَلٌ أَصَحُّ مِنْ حَدِيثِ ابْنِ عُيَيْنَةَ ‏.‏ قَالَ ابْنُ الْمُبَارَكِ وَأَرَى ابْنَ جُرَيْجٍ أَخَذَهُ عَنِ ابْنِ عُيَيْنَةَ ‏.‏ قَالَ أَبُو عِيسَى وَرَوَى هَمَّامُ بْنُ يَحْيَى هَذَا الْحَدِيثَ عَنْ زِيَادٍ وَهُوَ ابْنُ سَعْدٍ وَمَنْصُورٍ وَبَكْرٍ وَسُفْيَانَ عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ ‏.‏ وَإِنَّمَا هُوَ سُفْيَانُ بْنُ عُيَيْنَةَ رَوَى عَنْهُ هَمَّامٌ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي الْمَشْىِ أَمَامَ الْجَنَازَةِ فَرَأَى بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّ الْمَشْىَ أَمَامَهَا أَفْضَلُ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ ‏.‏ قَالَ وَحَدِيثُ أَنَسٍ فِي هَذَا الْبَابِ غَيْرُ مَحْفُوظٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1010,
			"arabicnumber": 1010,
			"text": "حَدَّثَنَا أَبُو مُوسَى، مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ كَانُوا يَمْشُونَ أَمَامَ الْجَنَازَةِ ‏.‏ قَالَ أَبُو عِيسَى سَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَقَالَ هَذَا حَدِيثٌ خَطَأٌ أَخْطَأَ فِيهِ مُحَمَّدُ بْنُ بَكْرٍ وَإِنَّمَا يُرْوَى هَذَا الْحَدِيثُ عَنْ يُونُسَ عَنِ الزُّهْرِيِّ أَنَّ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا يَمْشُونَ أَمَامَ الْجَنَازَةِ ‏.‏ قَالَ الزُّهْرِيُّ وَأَخْبَرَنِي سَالِمٌ أَنَّ أَبَاهُ كَانَ يَمْشِي أَمَامَ الْجَنَازَةِ ‏.‏ قَالَ مُحَمَّدٌ وَهَذَا أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1011,
			"arabicnumber": 1011,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، عَنْ شُعْبَةَ، عَنْ يَحْيَى، إِمَامِ بَنِي تَيْمِ اللَّهِ عَنْ أَبِي مَاجِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ سَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْمَشْىِ خَلْفَ الْجَنَازَةِ فَقَالَ ‏ \"‏ مَا دُونَ الْخَبَبِ فَإِنْ كَانَ خَيْرًا عَجَّلْتُمُوهُ وَإِنْ كَانَ شَرًّا فَلاَ يُبَعَّدُ إِلاَّ أَهْلُ النَّارِ الْجَنَازَةُ مَتْبُوعَةٌ وَلاَ تَتْبَعُ وَلَيْسَ مِنْهَا مَنْ تَقَدَّمَهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ يُعْرَفُ مِنْ حَدِيثِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يُضَعِّفُ حَدِيثَ أَبِي مَاجِدٍ هَذَا ‏.‏ وَقَالَ مُحَمَّدٌ قَالَ الْحُمَيْدِيُّ قَالَ ابْنُ عُيَيْنَةَ قِيلَ لِيَحْيَى مَنْ أَبُو مَاجِدٍ هَذَا قَالَ طَائِرٌ طَارَ فَحَدَّثَنَا ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ إِلَى هَذَا رَأَوْا أَنَّ الْمَشْىَ خَلْفَهَا أَفْضَلُ ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَإِسْحَاقُ ‏.‏ قَالَ إِنَّ أَبَا مَاجِدٍ رَجُلٌ مَجْهُولٌ لاَ يُعْرَفُ إِنَّمَا يُرْوَى عَنْهُ حَدِيثَانِ عَنِ ابْنِ مَسْعُودٍ ‏.‏ وَيَحْيَى إِمَامُ بَنِي تَيْمِ اللَّهِ ثِقَةٌ يُكْنَى أَبَا الْحَارِثِ وَيُقَالُ لَهُ يَحْيَى الْجَابِرُ وَيُقَالُ لَهُ يَحْيَى الْمُجْبِرُ أَيْضًا وَهُوَ كُوفِيٌّ رَوَى لَهُ شُعْبَةُ وَسُفْيَانُ الثَّوْرِيُّ وَأَبُو الأَحْوَصِ وَسُفْيَانُ بْنُ عُيَيْنَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1012,
			"arabicnumber": 1012,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ، عَنْ رَاشِدِ بْنِ سَعْدٍ، عَنْ ثَوْبَانَ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي جَنَازَةٍ فَرَأَى نَاسًا رُكْبَانًا فَقَالَ ‏ \"‏ أَلاَ تَسْتَحْيُونَ إِنَّ مَلاَئِكَةَ اللَّهِ عَلَى أَقْدَامِهِمْ وَأَنْتُمْ عَلَى ظُهُورِ الدَّوَابِّ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ وَجَابِرِ بْنِ سَمُرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ثَوْبَانَ قَدْ رُوِيَ عَنْهُ مَوْقُوفًا قَالَ مُحَمَّدٌ الْمَوْقُوفُ مِنْهُ أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، يَقُولُ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي جَنَازَةِ أَبِي الدَّحْدَاحِ وَهُوَ عَلَى فَرَسٍ لَهُ يَسْعَى وَنَحْنُ حَوْلَهُ وَهُوَ يَتَوَقَّصُ بِهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ، حَدَّثَنَا أَبُو قُتَيْبَةَ، عَنِ الْجَرَّاحِ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اتَّبَعَ جَنَازَةَ أَبِي الدَّحْدَاحِ مَاشِيًا وَرَجَعَ عَلَى فَرَسٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1015,
			"arabicnumber": 1015,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ يَكُنْ خَيْرًا تُقَدِّمُوهَا إِلَيْهِ وَإِنْ يَكُنْ شَرًّا تَضَعُوهُ عَنْ رِقَابِكُمْ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي بَكْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى حَمْزَةَ يَوْمَ أُحُدٍ فَوَقَفَ عَلَيْهِ فَرَآهُ قَدْ مُثِّلَ بِهِ فَقَالَ ‏\"‏ لَوْلاَ أَنْ تَجِدَ صَفِيَّةُ فِي نَفْسِهَا لَتَرَكْتُهُ حَتَّى تَأْكُلَهُ الْعَافِيَةُ حَتَّى يُحْشَرَ يَوْمَ الْقِيَامَةِ مِنْ بُطُونِهَا ‏\"‏ ‏.‏ قَالَ ثُمَّ دَعَا بِنَمِرَةٍ فَكَفَّنَهُ فِيهَا فَكَانَتْ إِذَا مُدَّتْ عَلَى رَأْسِهِ بَدَتْ رِجْلاَهُ وَإِذَا مُدَّتْ عَلَى رِجْلَيْهِ بَدَا رَأْسُهُ ‏.‏ قَالَ فَكَثُرَ الْقَتْلَى وَقَلَّتِ الثِّيَابُ ‏.‏ قَالَ فَكُفِّنَ الرَّجُلُ وَالرَّجُلاَنِ وَالثَّلاَثَةُ فِي الثَّوْبِ الْوَاحِدِ ثُمَّ يُدْفَنُونَ فِي قَبْرٍ وَاحِدٍ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْأَلُ عَنْهُمْ ‏\"‏ أَيُّهُمْ أَكْثَرُ قُرْآنًا ‏\"‏ ‏.‏ فَيُقَدِّمُهُ إِلَى الْقِبْلَةِ ‏.‏ قَالَ فَدَفَنَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ يُصَلِّ عَلَيْهِمْ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ أَنَسٍ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ النَّمِرَةُ الْكِسَاءُ الْخَلَقُ ‏.‏ وَقَدْ خُولِفَ أُسَامَةُ بْنُ زَيْدٍ فِي رِوَايَةِ هَذَا الْحَدِيثِ فَرَوَى اللَّيْثُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ‏.‏ وَرَوَى مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ عَنْ جَابِرٍ ‏.‏ وَلاَ نَعْلَمُ أَحَدًا ذَكَرَهُ عَنِ الزُّهْرِيِّ عَنْ أَنَسٍ إِلاَّ أُسَامَةَ بْنَ زَيْدٍ ‏.‏ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَقَالَ حَدِيثُ اللَّيْثِ عَنِ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ جَابِرٍ أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1017,
			"arabicnumber": 1017,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُسْلِمٍ الأَعْوَرِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُ الْمَرِيضَ وَيَشْهَدُ الْجَنَازَةَ وَيَرْكَبُ الْحِمَارَ وَيُجِيبُ دَعْوَةَ الْعَبْدِ وَكَانَ يَوْمَ بَنِي قُرَيْظَةَ عَلَى حِمَارٍ مَخْطُومٍ بِحَبْلٍ مِنْ لِيفٍ عَلَيْهِ إِكَافُ لِيفٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ مُسْلِمٍ عَنْ أَنَسٍ ‏.‏ وَمُسْلِمٌ الأَعْوَرُ يُضَعَّفُ وَهُوَ مُسْلِمُ بْنُ كَيْسَانَ الْمُلاَئِيُّ تُكُلِّمَ فِيهِ وَقَدْ رَوَى عَنْهُ شُعْبَةُ وَسُفْيَانُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1018,
			"arabicnumber": 1018,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم اخْتَلَفُوا فِي دَفْنِهِ فَقَالَ أَبُو بَكْرٍ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم شَيْئًا مَا نَسِيتُهُ قَالَ ‏ \"‏ مَا قَبَضَ اللَّهُ نَبِيًّا إِلاَّ فِي الْمَوْضِعِ الَّذِي يُحِبُّ أَنْ يُدْفَنَ فِيهِ ‏\"‏ ‏.‏ ادْفِنُوهُ فِي مَوْضِعِ فِرَاشِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَعَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ الْمُلَيْكِيُّ يُضَعَّفُ مِنْ قِبَلِ حِفْظِهِ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ فَرَوَاهُ ابْنُ عَبَّاسٍ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ عَنِ النَّبِيِّ صلى الله عليه وسلم أَيْضًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1019,
			"arabicnumber": 1019,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ عِمْرَانَ بْنِ أَنَسٍ الْمَكِّيِّ، عَنْ عَطَاءٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ اذْكُرُوا مَحَاسِنَ مَوْتَاكُمْ وَكُفُّوا عَنْ مَسَاوِيهِمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ سَمِعْتُ مُحَمَّدًا يَقُولُ عِمْرَانُ بْنُ أَنَسٍ الْمَكِّيُّ مُنْكَرُ الْحَدِيثِ وَرَوَى بَعْضُهُمْ عَنْ عَطَاءٍ عَنْ عَائِشَةَ ‏.‏ قَالَ وَعِمْرَانُ بْنُ أَبِي أَنَسٍ مِصْرِيٌّ أَقْدَمُ وَأَثْبَتُ مِنْ عِمْرَانَ بْنِ أَنَسٍ الْمَكِّيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1020,
			"arabicnumber": 1020,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، عَنْ بِشْرِ بْنِ رَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ بْنِ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اتَّبَعَ الْجَنَازَةَ لَمْ يَقْعُدْ حَتَّى تُوضَعَ فِي اللَّحْدِ فَعَرَضَ لَهُ حَبْرٌ فَقَالَ هَكَذَا نَصْنَعُ يَا مُحَمَّدُ ‏.‏ قَالَ فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏ \"‏ خَالِفُوهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَبِشْرُ بْنُ رَافِعٍ لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1021,
			"arabicnumber": 1021,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ أَبِي سِنَانٍ، قَالَ دَفَنْتُ ابْنِي سِنَانًا وَأَبُو طَلْحَةَ الْخَوْلاَنِيُّ جَالِسٌ عَلَى شَفِيرِ الْقَبْرِ فَلَمَّا أَرَدْتُ الْخُرُوجَ أَخَذَ بِيَدِي فَقَالَ أَلاَ أُبَشِّرُكَ يَا أَبَا سِنَانٍ ‏.‏ قُلْتُ بَلَى ‏.‏ فَقَالَ حَدَّثَنِي الضَّحَّاكُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَرْزَبٍ عَنْ أَبِي مُوسَى الأَشْعَرِيِّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا مَاتَ وَلَدُ الْعَبْدِ قَالَ اللَّهُ لِمَلاَئِكَتِهِ قَبَضْتُمْ وَلَدَ عَبْدِي ‏.‏ فَيَقُولُونَ نَعَمْ ‏.‏ فَيَقُولُ قَبَضْتُمْ ثَمَرَةَ فُؤَادِهِ ‏.‏ فَيَقُولُونَ نَعَمْ ‏.‏ فَيَقُولُ مَاذَا قَالَ عَبْدِي فَيَقُولُونَ حَمِدَكَ وَاسْتَرْجَعَ ‏.‏ فَيَقُولُ اللَّهُ ابْنُوا لِعَبْدِي بَيْتًا فِي الْجَنَّةِ وَسَمُّوهُ بَيْتَ الْحَمْدِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1022,
			"arabicnumber": 1022,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى النَّجَاشِيِّ فَكَبَّرَ أَرْبَعًا ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَابْنِ أَبِي أَوْفَى وَجَابِرٍ وَيَزِيدَ بْنِ ثَابِتٍ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى وَيَزِيدُ بْنُ ثَابِتٍ هُوَ أَخُو زَيْدِ بْنِ ثَابِتٍ وَهُوَ أَكْبَرُ مِنْهُ شَهِدَ بَدْرًا وَزَيْدٌ لَمْ يَشْهَدْ بَدْرًا ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَرَوْنَ التَّكْبِيرَ عَلَى الْجَنَازَةِ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1023,
			"arabicnumber": 1023,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، قَالَ كَانَ زَيْدُ بْنُ أَرْقَمَ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَإِنَّهُ كَبَّرَ عَلَى جَنَازَةٍ خَمْسًا فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكَبِّرُهَا ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ زَيْدِ بْنِ أَرْقَمَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ رَأَوُا التَّكْبِيرَ عَلَى الْجَنَازَةِ خَمْسًا ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ إِذَا كَبَّرَ الإِمَامُ عَلَى الْجَنَازَةِ خَمْسًا فَإِنَّهُ يُتَّبَعُ الإِمَامُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا هِقْلُ بْنُ زِيَادٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو إِبْرَاهِيمَ الأَشْهَلِيُّ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى عَلَى الْجَنَازَةِ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا ‏\"‏ ‏.‏ قَالَ يَحْيَى وَحَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ ذَلِكَ وَزَادَ فِيهِ ‏\"‏ اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلاَمِ وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيمَانِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَعَائِشَةَ وَأَبِي قَتَادَةَ وَعَوْفِ بْنِ مَالِكٍ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ وَالِدِ أَبِي إِبْرَاهِيمَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى هِشَامٌ الدَّسْتَوَائِيُّ وَعَلِيُّ بْنُ الْمُبَارَكِ هَذَا الْحَدِيثَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏.‏ وَرَوَى عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَحَدِيثُ عِكْرِمَةَ بْنِ عَمَّارٍ غَيْرُ مَحْفُوظٍ وَعِكْرِمَةُ رُبَّمَا يَهِمُ فِي حَدِيثِ يَحْيَى ‏.‏ وَرُوِيَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ مُحَمَّدًا يَقُولُ أَصَحُّ الرِّوَايَاتِ فِي هَذَا حَدِيثُ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي إِبْرَاهِيمَ الأَشْهَلِيِّ عَنْ أَبِيهِ ‏.‏ وَسَأَلْتُهُ عَنِ اسْمِ أَبِي إِبْرَاهِيمَ فَلَمْ يَعْرِفْهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1025,
			"arabicnumber": 1025,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى مَيِّتٍ فَفَهِمْتُ مِنْ صَلاَتِهِ عَلَيْهِ ‏ \"‏ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَاغْسِلْهُ بِالْبَرَدِ وَاغْسِلْهُ كَمَا يُغْسَلُ الثَّوْبُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ هَذَا الْحَدِيثُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1026,
			"arabicnumber": 1026,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَرَأَ عَلَى الْجَنَازَةِ بِفَاتِحَةِ الْكِتَابِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُمِّ شَرِيكٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ لَيْسَ إِسْنَادُهُ بِذَلِكَ الْقَوِيِّ ‏.‏ إِبْرَاهِيمُ بْنُ عُثْمَانَ هُوَ أَبُو شَيْبَةَ الْوَاسِطِيُّ مُنْكَرُ الْحَدِيثِ ‏.‏ وَالصَّحِيحُ عَنِ ابْنِ عَبَّاسٍ قَوْلُهُ مِنَ السُّنَّةِ الْقِرَاءَةُ عَلَى الْجَنَازَةِ بِفَاتِحَةِ الْكِتَابِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ طَلْحَةَ بْنِ عَوْفٍ، أَنَّ ابْنَ عَبَّاسٍ، صَلَّى عَلَى جَنَازَةٍ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ فَقُلْتُ لَهُ فَقَالَ إِنَّهُ مِنَ السُّنَّةِ أَوْ مِنْ تَمَامِ السُّنَّةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَخْتَارُونَ أَنْ يُقْرَأَ بِفَاتِحَةِ الْكِتَابِ بَعْدَ التَّكْبِيرَةِ الأُولَى ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لاَ يُقْرَأُ فِي الصَّلاَةِ عَلَى الْجَنَازَةِ إِنَّمَا هُوَ ثَنَاءٌ عَلَى اللَّهِ وَالصَّلاَةُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَالدُّعَاءُ لِلْمَيِّتِ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَغَيْرِهِ مِنْ أَهْلِ الْكُوفَةِ ‏.‏ وَطَلْحَةُ بْنُ عَبْدِ اللَّهِ بْنِ عَوْفٍ هُوَ ابْنُ أَخِي عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ رَوَى عَنْهُ الزُّهْرِيُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1028,
			"arabicnumber": 1028,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، وَيُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ، قَالَ كَانَ مَالِكُ بْنُ هُبَيْرَةَ إِذَا صَلَّى عَلَى جَنَازَةٍ فَتَقَالَّ النَّاسَ عَلَيْهَا جَزَّأَهُمْ ثَلاَثَةَ أَجْزَاءٍ ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ صَلَّى عَلَيْهِ ثَلاَثَةُ صُفُوفٍ فَقَدْ أَوْجَبَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَأُمِّ حَبِيبَةَ وَأَبِي هُرَيْرَةَ وَمَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ مَالِكِ بْنِ هُبَيْرَةَ حَدِيثٌ حَسَنٌ هَكَذَا رَوَاهُ غَيْرُ وَاحِدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ ‏.‏ وَرَوَى إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ هَذَا الْحَدِيثَ وَأَدْخَلَ بَيْنَ مَرْثَدٍ وَمَالِكِ بْنِ هُبَيْرَةَ رَجُلاً ‏.‏ وَرِوَايَةُ هَؤُلاَءِ أَصَحُّ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1029,
			"arabicnumber": 1029,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، ‏.‏ وَحَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، رَضِيعٌ كَانَ لِعَائِشَةَ - عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ أَحَدٌ مِنَ الْمُسْلِمِينَ فَتُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ الْمُسْلِمِينَ يَبْلُغُونَ أَنْ يَكُونُوا مِائَةً فَيَشْفَعُوا لَهُ إِلاَّ شُفِّعُوا فِيهِ ‏\"‏ ‏.‏ وَقَالَ عَلِيُّ بْنُ حُجْرٍ فِي حَدِيثِهِ ‏\"‏ مِائَةً فَمَا فَوْقَهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ أَوْقَفَهُ بَعْضُهُمْ وَلَمْ يَرْفَعْهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1030,
			"arabicnumber": 1030,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ مُوسَى بْنِ عُلَىِّ بْنِ رَبَاحٍ، عَنْ أَبِيهِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ ثَلاَثُ سَاعَاتٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْهَانَا أَنْ نُصَلِّيَ فِيهِنَّ أَوْ نَقْبُرَ فِيهِنَّ مَوْتَانَا حِينَ تَطْلُعُ الشَّمْسُ بَازِغَةً حَتَّى تَرْتَفِعَ وَحِينَ يَقُومُ قَائِمُ الظَّهِيرَةِ حَتَّى تَمِيلَ وَحِينَ تَضَيَّفُ الشَّمْسُ لِلْغُرُوبِ حَتَّى تَغْرُبَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَكْرَهُونَ الصَّلاَةَ عَلَى الْجَنَازَةِ فِي هَذِهِ السَّاعَاتِ ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ مَعْنَى هَذَا الْحَدِيثِ أَنْ نَقْبُرَ فِيهِنَّ مَوْتَانَا ‏.‏ يَعْنِي الصَّلاَةَ عَلَى الْجَنَازَةِ ‏.‏ وَكَرِهَ الصَّلاَةَ عَلَى الْجَنَازَةِ عِنْدَ طُلُوعِ الشَّمْسِ وَعِنْدَ غُرُوبِهَا وَإِذَا انْتَصَفَ النَّهَارُ حَتَّى تَزُولَ الشَّمْسُ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ قَالَ الشَّافِعِيُّ لاَ بَأْسَ بِالصَّلاَةِ عَلَى الْجَنَازَةِ فِي السَّاعَاتِ الَّتِي تُكْرَهُ فِيهِنَّ الصَّلاَةُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1031,
			"arabicnumber": 1031,
			"text": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ ابْنُ بِنْتِ أَزْهَرَ السَّمَّانِ الْبَصْرِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ سَعِيدِ بْنِ عُبَيْدِ اللَّهِ، حَدَّثَنَا أَبِي، عَنْ زِيَادِ بْنِ جُبَيْرِ بْنِ حَيَّةَ، عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ رَوَاهُ إِسْرَائِيلُ وَغَيْرُ وَاحِدٍ عَنْ سَعِيدِ بْنِ عُبَيْدِ اللَّهِ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ قَالُوا يُصَلَّى عَلَى الطِّفْلِ وَإِنْ لَمْ يَسْتَهِلَّ بَعْدَ أَنْ يُعْلَمَ أَنَّهُ خُلِقَ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1032,
			"arabicnumber": 1032,
			"text": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ الْوَاسِطِيُّ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ الْمَكِّيِّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الطِّفْلُ لاَ يُصَلَّى عَلَيْهِ وَلاَ يَرِثُ وَلاَ يُورَثُ حَتَّى يَسْتَهِلَّ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ قَدِ اضْطَرَبَ النَّاسُ فِيهِ فَرَوَاهُ بَعْضُهُمْ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مَرْفُوعًا ‏.‏ وَرَوَى أَشْعَثُ بْنُ سَوَّارٍ وَغَيْرُ وَاحِدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ مَوْقُوفًا ‏.‏ وَرَوَى مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرٍ مَوْقُوفًا ‏.‏ وَكَأَنَّ هَذَا أَصَحُّ مِنَ الْحَدِيثِ الْمَرْفُوعِ ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا قَالُوا لاَ يُصَلَّى عَلَى الطِّفْلِ حَتَّى يَسْتَهِلَّ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1033,
			"arabicnumber": 1033,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ فِي الْمَسْجِدِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ ‏.‏ قَالَ الشَّافِعِيُّ قَالَ مَالِكٌ لاَ يُصَلَّى عَلَى الْمَيِّتِ فِي الْمَسْجِدِ ‏.‏ وَقَالَ الشَّافِعِيُّ يُصَلَّى عَلَى الْمَيِّتِ فِي الْمَسْجِدِ ‏.‏ وَاحْتَجَّ بِهَذَا الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1034,
			"arabicnumber": 1034,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، عَنْ سَعِيدِ بْنِ عَامِرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي غَالِبٍ، قَالَ صَلَّيْتُ مَعَ أَنَسِ بْنِ مَالِكٍ عَلَى جَنَازَةِ رَجُلٍ فَقَامَ حِيَالَ رَأْسِهِ ثُمَّ جَاءُوا بِجَنَازَةِ امْرَأَةٍ مِنْ قُرَيْشٍ فَقَالُوا يَا أَبَا حَمْزَةَ صَلِّ عَلَيْهَا ‏.‏ فَقَامَ حِيَالَ وَسَطِ السَّرِيرِ ‏.‏ فَقَالَ لَهُ الْعَلاَءُ بْنُ زِيَادٍ هَكَذَا رَأَيْتَ النَّبِيَّ صلى الله عليه وسلم قَامَ عَلَى الْجَنَازَةِ مُقَامَكَ مِنْهَا وَمِنَ الرَّجُلِ مُقَامَكَ مِنْهُ قَالَ نَعَمْ ‏.‏ فَلَمَّا فَرَغَ قَالَ احْفَظُوا ‏.‏ وَفِي الْبَابِ عَنْ سَمُرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ هَمَّامٍ مِثْلَ هَذَا ‏.‏ وَرَوَى وَكِيعٌ هَذَا الْحَدِيثَ عَنْ هَمَّامٍ فَوَهِمَ فِيهِ فَقَالَ عَنْ غَالِبٍ عَنْ أَنَسٍ ‏.‏ وَالصَّحِيحُ عَنْ أَبِي غَالِبٍ ‏.‏ وَقَدْ رَوَى هَذَا الْحَدِيثَ عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ وَغَيْرُ وَاحِدٍ عَنْ أَبِي غَالِبٍ مِثْلَ رِوَايَةِ هَمَّامٍ ‏.‏ وَاخْتَلَفُوا فِي اسْمِ أَبِي غَالِبٍ هَذَا فَقَالَ بَعْضُهُمْ يُقَالُ اسْمُهُ نَافِعٌ وَيُقَالُ رَافِعٌ ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1035,
			"arabicnumber": 1035,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، وَالْفَضْلُ بْنُ مُوسَى، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى امْرَأَةٍ فَقَامَ وَسَطَهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ شُعْبَةُ عَنْ حُسَيْنٍ الْمُعَلِّمِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1036,
			"arabicnumber": 1036,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي الثَّوْبِ الْوَاحِدِ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمَا أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏ ‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ وَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ وَأَمَرَ بِدَفْنِهِمْ فِي دِمَائِهِمْ وَلَمْ يُصَلِّ عَلَيْهِمْ وَلَمْ يُغَسَّلُوا ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسِ بْنِ مَالِكٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنِ الزُّهْرِيِّ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرُوِيَ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ بْنِ أَبِي صُعَيْرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَمِنْهُمْ مَنْ ذَكَرَهُ عَنْ جَابِرٍ ‏.‏ وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي الصَّلاَةِ عَلَى الشَّهِيدِ فَقَالَ بَعْضُهُمْ لاَ يُصَلَّى عَلَى الشَّهِيدِ ‏.‏ وَهُوَ قَوْلُ أَهْلِ الْمَدِينَةِ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ ‏.‏ وَقَالَ بَعْضُهُمْ يُصَلَّى عَلَى الشَّهِيدِ ‏.‏ وَاحْتَجُّوا بِحَدِيثِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى عَلَى حَمْزَةَ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ وَبِهِ يَقُولُ إِسْحَاقُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1037,
			"arabicnumber": 1037,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا الشَّيْبَانِيُّ، حَدَّثَنَا الشَّعْبِيُّ، أَخْبَرَنِي مَنْ، رَأَى النَّبِيَّ صلى الله عليه وسلم وَرَأَى قَبْرًا مُنْتَبِذًا فَصَفَّ أَصْحَابَهُ خَلْفَهُ فَصَلَّى عَلَيْهِ فَقِيلَ لَهُ مَنْ أَخْبَرَكَهُ فَقَالَ ابْنُ عَبَّاسٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَبُرَيْدَةَ وَيَزِيدَ بْنِ ثَابِتٍ وَأَبِي هُرَيْرَةَ وَعَامِرِ بْنِ رَبِيعَةَ وَأَبِي قَتَادَةَ وَسَهْلِ بْنِ حُنَيْفٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لاَ يُصَلَّى عَلَى الْقَبْرِ ‏.‏ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ ‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ إِذَا دُفِنَ الْمَيِّتُ وَلَمْ يُصَلَّ عَلَيْهِ صُلِّيَ عَلَى الْقَبْرِ ‏.‏ وَرَأَى ابْنُ الْمُبَارَكِ الصَّلاَةَ عَلَى الْقَبْرِ ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ يُصَلَّى عَلَى الْقَبْرِ إِلَى شَهْرٍ ‏.‏ وَقَالاَ أَكْثَرُ مَا سَمِعْنَا عَنِ ابْنِ الْمُسَيَّبِ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى قَبْرِ أُمِّ سَعْدِ بْنِ عُبَادَةَ بَعْدَ شَهْرٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1038,
			"arabicnumber": 1038,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أُمَّ سَعْدٍ، مَاتَتْ وَالنَّبِيُّ صلى الله عليه وسلم غَائِبٌ فَلَمَّا قَدِمَ صَلَّى عَلَيْهَا وَقَدْ مَضَى لِذَلِكَ شَهْرٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1039,
			"arabicnumber": 1039,
			"text": "حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ وَحُمَيْدُ بْنُ مَسْعَدَةَ قَالاَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَخَاكُمُ النَّجَاشِيَّ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَقُمْنَا فَصَفَفْنَا كَمَا يُصَفُّ عَلَى الْمَيِّتِ وَصَلَّيْنَا عَلَيْهِ كَمَا يُصَلَّى عَلَى الْمَيِّتِ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَجَابِرِ بْنِ عَبْدِ اللَّهِ وَأَبِي سَعِيدٍ وَحُذَيْفَةَ بْنِ أَسِيدٍ وَجَرِيرِ بْنِ عَبْدِ اللَّهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ رَوَاهُ أَبُو قِلاَبَةَ عَنْ عَمِّهِ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏ وَأَبُو الْمُهَلَّبِ اسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو وَيُقَالُ مُعَاوِيَةُ بْنُ عَمْرٍو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1040,
			"arabicnumber": 1040,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ وَمَنْ تَبِعَهَا حَتَّى يُقْضَى دَفْنُهَا فَلَهُ قِيرَاطَانِ أَحَدُهُمَا أَوْ أَصْغَرُهُمَا مِثْلُ أُحُدٍ ‏\"‏ ‏.‏ فَذَكَرْتُ ذَلِكَ لاِبْنِ عُمَرَ فَأَرْسَلَ إِلَى عَائِشَةَ فَسَأَلَهَا عَنْ ذَلِكَ فَقَالَتْ صَدَقَ أَبُو هُرَيْرَةَ ‏.‏ فَقَالَ ابْنُ عُمَرَ لَقَدْ فَرَّطْنَا فِي قَرَارِيطَ كَثِيرَةٍ ‏.‏ وَفِي الْبَابِ عَنِ الْبَرَاءِ وَعَبْدِ اللَّهِ بْنِ مُغَفَّلٍ وَعَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَأَبِي سَعِيدٍ وَأُبَىِّ بْنِ كَعْبٍ وَابْنِ عُمَرَ وَثَوْبَانَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَدْ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، قَالَ سَمِعْتُ أَبَا الْمُهَزَّمِ، قَالَ صَحِبْتُ أَبَا هُرَيْرَةَ عَشْرَ سِنِينَ فَسَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ تَبِعَ جَنَازَةً وَحَمَلَهَا ثَلاَثَ مَرَّاتٍ فَقَدْ قَضَى مَا عَلَيْهِ مِنْ حَقِّهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَرَوَاهُ بَعْضُهُمْ بِهَذَا الإِسْنَادِ وَلَمْ يَرْفَعْهُ ‏.‏ وَأَبُو الْمُهَزَّمِ اسْمُهُ يَزِيدُ بْنُ سُفْيَانَ وَضَعَّفَهُ شُعْبَةُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1042,
			"arabicnumber": 1042,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا لَهَا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي سَعِيدٍ وَجَابِرٍ وَسَهْلِ بْنِ حُنَيْفٍ وَقَيْسِ بْنِ سَعْدٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَامِرِ بْنِ رَبِيعَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1043,
			"arabicnumber": 1043,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ الْحُلْوَانِيُّ، قَالاَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا لَهَا فَمَنْ تَبِعَهَا فَلاَ يَقْعُدَنَّ حَتَّى تُوضَعَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي سَعِيدٍ فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ قَالاَ مَنْ تَبِعَ جَنَازَةً فَلاَ يَقْعُدَنَّ حَتَّى تُوضَعَ عَنْ أَعْنَاقِ الرِّجَالِ ‏.‏ وَقَدْ رُوِيَ عَنْ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّهُمْ كَانُوا يَتَقَدَّمُونَ الْجَنَازَةَ فَيَقْعُدُونَ قَبْلَ أَنْ تَنْتَهِيَ إِلَيْهِمُ الْجَنَازَةُ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1044,
			"arabicnumber": 1044,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ وَاقِدٍ، وَهُوَ ابْنُ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ مَسْعُودِ بْنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّهُ ذُكِرَ الْقِيَامُ فِي الْجَنَائِزِ حَتَّى تُوضَعَ فَقَالَ عَلِيٌّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَعَدَ ‏.‏ وَفِي الْبَابِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِيهِ رِوَايَةُ أَرْبَعَةٍ مِنَ التَّابِعِينَ بَعْضُهُمْ عَنْ بَعْضٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ ‏.‏ قَالَ الشَّافِعِيُّ وَهَذَا أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ ‏.‏ وَهَذَا الْحَدِيثُ نَاسِخٌ لِلْحَدِيثِ الأَوَّلِ ‏ \"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا ‏\"‏ ‏.‏ وَقَالَ أَحْمَدُ إِنْ شَاءَ قَامَ وَإِنْ شَاءَ لَمْ يَقُمْ ‏.‏ وَاحْتَجَّ بِأَنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ رُوِيَ عَنْهُ أَنَّهُ قَامَ ثُمَّ قَعَدَ ‏.‏ وَهَكَذَا قَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ ‏.‏ قَالَ أَبُو عِيسَى مَعْنَى قَوْلِ عَلِيٍّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْجَنَازَةِ ثُمَّ قَعَدَ ‏.‏ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا رَأَى الْجَنَازَةَ قَامَ ثُمَّ تَرَكَ ذَلِكَ بَعْدُ فَكَانَ لاَ يَقُومُ إِذَا رَأَى الْجَنَازَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1045,
			"arabicnumber": 1045,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَنَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ، وَيُوسُفُ بْنُ مُوسَى الْقَطَّانُ الْبَغْدَادِيُّ، قَالُوا حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ، عَنْ عَلِيِّ بْنِ عَبْدِ الأَعْلَى، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَا ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ وَعَائِشَةَ وَابْنِ عُمَرَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، حَدَّثَنَا الْحَجَّاجُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أُدْخِلَ الْمَيِّتُ الْقَبْرَ - وَقَالَ أَبُو خَالِدٍ مَرَّةً إِذَا وُضِعَ الْمَيِّتُ فِي لَحْدِهِ قَالَ مَرَّةً ‏\"‏ بِسْمِ اللَّهِ وَبِاللَّهِ وَعَلَى مِلَّةِ رَسُولِ اللَّهِ ‏\"‏ ‏.‏ وَقَالَ مَرَّةً ‏\"‏ بِسْمِ اللَّهِ وَبِاللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرَوَاهُ أَبُو الصِّدِّيقِ النَّاجِيُّ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَدْ رُوِيَ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنِ ابْنِ عُمَرَ مَوْقُوفًا أَيْضًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1047,
			"arabicnumber": 1047,
			"text": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ الطَّائِيُّ الْبَصْرِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ فَرْقَدٍ، قَالَ سَمِعْتُ جَعْفَرَ بْنَ مُحَمَّدٍ، عَنْ أَبِيهِ، قَالَ الَّذِي أَلْحَدَ قَبْرَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَبُو طَلْحَةَ وَالَّذِي أَلْقَى الْقَطِيفَةَ تَحْتَهُ شُقْرَانُ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ جَعْفَرٌ وَأَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي رَافِعٍ قَالَ سَمِعْتُ شُقْرَانَ يَقُولُ أَنَا وَاللَّهِ طَرَحْتُ الْقَطِيفَةَ تَحْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْقَبْرِ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ شُقْرَانَ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَرَوَى عَلِيُّ بْنُ الْمَدِينِيِّ عَنْ عُثْمَانَ بْنِ فَرْقَدٍ هَذَا الْحَدِيثَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1048,
			"arabicnumber": 1048,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، عَنْ أَبِي حَمْزَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جُعِلَ فِي قَبْرِ النَّبِيِّ صلى الله عليه وسلم قَطِيفَةٌ حَمْرَاءُ ‏.‏ قَالَ وَقَالَ مُحَمَّدُ بْنُ بَشَّارٍ فِي مَوْضِعٍ آخَرَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَيَحْيَى، عَنْ شُعْبَةَ، عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، ‏.‏ وَهَذَا أَصَحُّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَى شُعْبَةُ، عَنْ أَبِي حَمْزَةَ الْقَصَّابِ، وَاسْمُهُ، عِمْرَانُ بْنُ أَبِي عَطَاءٍ وَرُوِيَ عَنْ أَبِي جَمْرَةَ الضُّبَعِيِّ، وَاسْمُهُ، نَصْرُ بْنُ عِمْرَانَ وَكِلاَهُمَا مِنْ أَصْحَابِ ابْنِ عَبَّاسٍ ‏.‏ وَقَدْ رُوِيَ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ كَرِهَ أَنْ يُلْقَى، تَحْتَ الْمَيِّتِ فِي الْقَبْرِ شَيْءٌ ‏.‏ وَإِلَى هَذَا ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1049,
			"arabicnumber": 1049,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي وَائِلٍ، أَنَّ عَلِيًّا، قَالَ لأَبِي الْهَيَّاجِ الأَسَدِيِّ أَبْعَثُكَ عَلَى مَا بَعَثَنِي بِهِ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَنْ لا�� تَدَعَ قَبْرًا مُشْرِفًا إِلاَّ سَوَّيْتَهُ وَلاَ تِمْثَالاً إِلاَّ طَمَسْتَهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ يَكْرَهُونَ أَنْ يُرْفَعَ الْقَبْرُ فَوْقَ الأَرْضِ ‏.‏ قَالَ الشَّافِعِيُّ أَكْرَهُ أَنْ يُرْفَعَ الْقَبْرُ إِلاَّ بِقَدْرِ مَا يُعْرَفُ أَنَّهُ قَبْرٌ لِكَيْلاَ يُوطَأَ وَلاَ يُجْلَسَ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1050,
			"arabicnumber": 1050,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَجْلِسُوا عَلَى الْقُبُورِ وَلاَ تُصَلُّوا إِلَيْهَا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَعَمْرِو بْنِ حَزْمٍ وَبَشِيرِ ابْنِ الْخَصَاصِيَةِ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، وَأَبُو عَمَّارٍ قَالاَ أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ وَلَيْسَ فِيهِ عَنْ أَبِي إِدْرِيسَ وَهَذَا الصَّحِيحُ ‏.‏ قَالَ أَبُو عِيسَى قَالَ مُحَمَّدٌ وَحَدِيثُ ابْنِ الْمُبَارَكِ خَطَأٌ أَخْطَأَ فِيهِ ابْنُ الْمُبَارَكِ وَزَادَ فِيهِ عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ وَإِنَّمَا هُوَ بُسْرُ بْنُ عُبَيْدِ اللَّهِ عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ هَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ وَلَيْسَ فِيهِ عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ وَبُسْرُ بْنُ عُبَيْدِ اللَّهِ قَدْ سَمِعَ مِنْ وَاثِلَةَ بْنِ الأَسْقَعِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ أَبُو عَمْرٍو الْبَصْرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُجَصَّصَ الْقُبُورُ وَأَنْ يُكْتَبَ عَلَيْهَا وَأَنْ يُبْنَى عَلَيْهَا وَأَنْ تُوطَأَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرٍ ‏.‏ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ مِنْهُمُ الْحَسَنُ الْبَصْرِيُّ فِي تَطْيِينِ الْقُبُورِ ‏.‏ وَقَالَ الشَّافِعِيُّ لاَ بَأْسَ أَنْ يُطَيَّنَ الْقَبْرُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ، عَنْ أَبِي كُدَيْنَةَ، عَنْ قَابُوسِ بْنِ أَبِي ظَبْيَانَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقُبُورِ الْمَدِينَةِ فَأَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ ‏ \"‏ السَّلاَمُ عَلَيْكُمْ يَا أَهْلَ الْقُبُورِ يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ أَنْتُمْ سَلَفُنَا وَنَحْنُ بِالأَثَرِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ بُرَيْدَةَ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَأَبُو كُدَيْنَةَ اسْمُهُ يَحْيَى بْنُ الْمُهَلَّبِ وَأَبُو ظَبْيَانَ اسْمُهُ حُصَيْنُ بْنُ جُنْدُبٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، قَالُوا حَدَّثَنَا أَبُو عَاصِمٍ النَّبِيلُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قَدْ كُنْتُ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَقَدْ أُذِنَ لِمُحَمَّدٍ فِي زِيَارَةِ قَبْرِ أُمِّهِ فَزُورُوهَا فَإِنَّهَا تُذَكِّرُ الآخِرَةَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي سَعِيدٍ وَابْنِ مَسْعُودٍ وَأَنَسٍ وَأَبِي هُرَيْرَةَ وَأُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ بُرَيْدَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لاَ يَرَوْنَ بِزِيَارَةِ الْقُبُورِ بَأْسًا ‏.‏ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1055,
			"arabicnumber": 1055,
			"text": "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ تُوُفِّيَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ بِحُبْشِيٍّ ‏.‏ قَالَ فَحُمِلَ إِلَى مَكَّةَ فَدُفِنَ فِيهَا فَلَمَّا قَدِمَتْ عَائِشَةُ أَتَتْ قَبْرَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ فَقَالَتْ وَكُنَّا كَنَدْمَانَىْ جَذِيمَةَ حِقْبَةً مِنَ الدَّهْرِ حَتَّى قِيلَ لَنْ يَتَصَدَّعَا فَلَمَّا تَفَرَّقْنَا كَأَنِّي وَمَالِكًا لِطُولِ اجْتِمَاعٍ لَمْ نَبِتْ لَيْلَةً مَعَا ثُمَّ قَالَتْ وَاللَّهِ لَوْ حَضَرْتُكَ مَا دُفِنْتَ إِلاَّ حَيْثُ مُتَّ وَلَوْ شَهِدْتُكَ مَا زُرْتُكَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَعَنَ زَوَّارَاتِ الْقُبُورِ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَحَسَّانَ بْنِ ثَابِتٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَأَى بَعْضُ أَهْلِ الْعِلْمِ أَنَّ هَذَا كَانَ قَبْلَ أَنْ يُرَخِّصَ النَّبِيُّ صلى الله عليه وسلم فِي زِيَارَةِ الْقُبُورِ فَلَمَّا رَخَّصَ دَخَلَ فِي رُخْصَتِهِ الرِّجَالُ وَالنِّسَاءُ ‏.‏ وَقَالَ بَعْضُهُمْ إِنَّمَا كُرِهَ زِيَارَةُ الْقُبُورِ لِلنِّسَاءِ لِقِلَّةِ صَبْرِهِنَّ وَكَثْرَةِ جَزَعِهِنَّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَمُحَمَّدُ بْنُ عَمْرٍو السَّوَّاقُ، قَالاَ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ، عَنِ الْمِنْهَالِ بْنِ خَلِيفَةَ، عَنِ الْحَجَّاجِ بْنِ أَرْطَاةَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ قَبْرًا لَيْلاً فَأُسْرِجَ لَهُ سِرَاجٌ فَأَخَذَهُ مِنْ قِبَلِ الْقِبْلَةِ وَقَالَ ‏ \"‏ رَحِمَكَ اللَّهُ إِنْ كُنْتَ لأَوَّاهًا تَلاَّءً لِلْقُرْآنِ ‏\"‏ ‏.‏ وَكَبَّرَ عَلَيْهِ أَرْبَعًا ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَيَزِيدَ بْنِ ثَابِتٍ وَهُوَ أَخُو زَيْدِ بْنِ ثَابِتٍ أَكْبَرُ مِنْهُ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا وَقَالُوا يُدْخَلُ الْمَيِّتُ الْقَبْرَ مِنْ قِبَلِ الْقِبْلَةِ ‏.‏ وَقَالَ بَعْضُهُمْ يُسَلُّ سَلاًّ ‏.‏ وَرَخَّصَ أَكْثَرُ أَهْلِ الْعِلْمِ فِي الدَّفْنِ بِاللَّيْلِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ مُرَّ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِجَنَازَةٍ فَأَثْنَوْا عَلَيْهَا خَيْرًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ وَكَعْبِ بْنِ عُجْرَةَ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْبَزَّازُ، قَالاَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي الْفُرَاتِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ أَبِي الأَسْوَدِ الدِّيلِيِّ، قَالَ قَدِمْتُ الْمَدِينَةَ فَجَلَسْتُ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَمَرُّوا بِجَنَازَةٍ فَأَثْنَوْا عَلَيْهَا خَيْرًا فَقَالَ عُمَرُ وَجَبَتْ ‏.‏ فَقُلْتُ لِعُمَرَ وَمَا وَجَبَتْ قَالَ أَقُولُ كَمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ مُسْلِمٍ يَشْهَدُ لَهُ ثَلاَثَةٌ إِلاَّ وَجَبَتْ لَهُ الْجَنَّةُ ‏\"‏ ‏.‏ قَالَ قُلْنَا وَاثْنَانِ قَالَ ‏\"‏ وَاثْنَانِ ‏\"‏ ‏.‏ قَالَ وَلَمْ نَسْأَلْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْوَاحِدِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو الأَسْوَدِ الدِّيلِيُّ اسْمُهُ ظَالِمُ بْنُ عَمْرِو بْنِ سُفْيَانَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكِ بْنِ أَنَسٍ، ح وَحَدَّثَنَا الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ فَتَمَسَّهُ النَّارُ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ وَمُعَاذٍ وَكَعْبِ بْنِ مَالِكٍ وَعُتْبَةَ بْنِ عَبْدٍ وَأُمِّ سُلَيْمٍ وَجَابِرٍ وَأَنَسٍ وَأَبِي ذَرٍّ وَابْنِ مَسْعُودٍ وَأَبِي ثَعْلَبَةَ الأَشْجَعِيِّ وَابْنِ عَبَّاسٍ وَعُقْبَةَ بْنِ عَامِرٍ وَأَبِي سَعِيدٍ وَقُرَّةَ بْنِ إِيَاسٍ الْمُزَنِيِّ ‏.‏ قَالَ وَأَبُو ثَعْلَبَةَ الأَشْجَعِيُّ لَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم حَدِيثٌ وَاحِدٌ هُوَ هَذَا الْحَدِيثُ وَلَيْسَ هُوَ الْخُشَنِيَّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، حَدَّثَنَا الْعَوَّامُ بْنُ حَوْشَبٍ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ عَنْ أَبِي عُبَيْدَةَ بْنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَدَّمَ ثَلاَثَةً لَمْ يَبْلُغُوا الْحُلُمَ كَانُوا لَهُ حِصْنًا حَصِينًا مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو ذَرٍّ قَدَّمْتُ اثْنَيْنِ ‏.‏ قَالَ ‏\"‏ وَاثْنَيْنِ ‏\"‏ ‏.‏ فَقَالَ أُبَىُّ بْنُ كَعْبٍ سَيِّدُ الْقُرَّاءِ قَدَّمْتُ وَاحِدًا قَالَ ‏\"‏ وَوَاحِدًا وَلَكِنْ إِنَّمَا ذَاكَ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَأَبُو عُبَيْدَةَ لَمْ يَسْمَعْ مِنْ أَبِيهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَأَبُو الْخَطَّابِ، زِيَادُ بْنُ يَحْيَى الْبَصْرِيُّ قَالاَ حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ بَارِقٍ الْحَنَفِيُّ، قَالَ سَمِعْتُ جَدِّي أَبَا أُمِّي، سِمَاكَ بْنَ الْوَلِيدِ الْحَنَفِيَّ يُحَدِّثُ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يُحَدِّثُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ كَانَ لَهُ فَرَطَانِ مِنْ أُمَّتِي أَدْخَلَهُ اللَّهُ بِهِمَا الْجَنَّةَ ‏\"‏ ‏.‏ فَقَالَتْ لَهُ عَائِشَةُ فَمَنْ كَانَ لَهُ فَرَطٌ مِنْ أُمَّتِكَ قَالَ ‏\"‏ وَمَنْ كَانَ لَهُ فَرَطٌ يَا مُوَفَّقَةُ ‏\"‏ ‏.‏ قَالَتْ فَمَنْ لَمْ يَكُنْ لَهُ فَرَطٌ مِنْ أُمَّتِكَ قَالَ ‏\"‏ فَأَنَا فَرَطُ أُمَّتِي لَنْ يُصَابُوا بِمِثْلِي ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عَبْدِ رَبِّهِ بْنِ بَارِقٍ وَقَدْ رَوَى عَنْهُ غَيْرُ وَاحِدٍ مِنَ الأَئِمَّةِ ‏.‏ حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْمُرَابِطِيُّ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ، أَنْبَأَنَا عَبْدُ رَبِّهِ بْنُ بَارِقٍ، فَذَكَرَ نَحْوَهُ ‏.‏ وَسِمَاكُ بْنُ الْوَلِيدِ هُوَ أَبُو زُمَيْلٍ الْحَنَفِيُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "حَدَّثَنَا الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الشُّهَدَاءُ خَمْسٌ الْمَطْعُونُ وَالْمَبْطُونُ وَالْغَرِقُ وَصَاحِبُ الْهَدْمِ وَالشَّهِيدُ فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَصَفْوَانَ بْنِ أُمَيَّةَ وَجَابِرِ بْنِ عَتِيكٍ وَخَالِدِ بْنِ عُرْفُطَةَ وَسُلَيْمَانَ بْنِ صُرَدٍ وَأَبِي مُوسَى وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ الْكُوفِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو سِنَانٍ الشَّيْبَانِيُّ، عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ، قَالَ قَالَ سُلَيْمَانُ بْنُ صُرَدٍ لِخَالِدِ بْنِ عُرْفُطَةَ أَوْ خَالِدٌ لِسُلَيْمَانَ أَمَا سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ قَتَلَهُ بَطْنُهُ لَمْ يُعَذَّبْ فِي قَبْرِهِ ‏\"‏ ‏.‏ فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ نَعَمْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ فِي هَذَا الْبَابِ وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1065,
			"arabicnumber": 1065,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ذَكَرَ الطَّاعُونَ فَقَالَ ‏ \"‏ بَقِيَّةُ رِجْزٍ - أَوْ عَذَابٍ أُرْسِلَ عَلَى طَائِفَةٍ مِنْ بَنِي إِسْرَائِيلَ فَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا مِنْهَا وَإِذَا وَقَعَ بِأَرْضٍ وَلَسْتُمْ بِهَا فَلاَ تَهْبِطُوا عَلَيْهَا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ سَعْدٍ وَخُزَيْمَةَ بْنِ ثَابِتٍ وَعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَجَابِرٍ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أُسَامَةَ بْنِ زَيْدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مِقْدَامٍ أَبُو الأَشْعَثِ الْعِجْلِيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي مُوسَى وَأَبِي هُرَيْرَةَ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عُبَادَةَ بْنِ الصَّامِتِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1067,
			"arabicnumber": 1067,
			"text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ح قَالَ وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، أَنَّهَا ذَكَرَتْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ كُلُّنَا نَكْرَهُ الْمَوْتَ ‏.‏ قَالَ ‏\"‏ لَيْسَ ذَلِكَ وَلَكِنَّ الْمُؤْمِنَ إِذَا بُشِّرَ بِرَحْمَةِ اللَّهِ وَرِضْوَانِهِ وَجَنَّتِهِ أَحَبَّ لِقَاءَ اللَّهِ وَأَحَبَّ اللَّهُ لِقَاءَهُ وَإِنَّ الْكَافِرَ إِذَا بُشِّرَ بِعَذَابِ اللَّهِ وَسَخَطِهِ كَرِهَ لِقَاءَ اللَّهِ وَكَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1068,
			"arabicnumber": 1068,
			"text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْرَائِيلُ، وَشَرِيكٌ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، أَنَّ رَجُلاً، قَتَلَ نَفْسَهُ فَلَمْ يُصَلِّ عَلَيْهِ النَّبِيُّ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا فَقَالَ بَعْضُهُمْ يُصَلَّى عَلَى كُلِّ مَنْ صَلَّى إِلَى الْقِبْلَةِ وَعَلَى قَاتِلِ النَّفْسِ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَإِسْحَاقَ ‏.‏ وَقَالَ أَحْمَدُ لاَ يُصَلِّي الإِمَامُ عَلَى قَاتِلِ النَّفْسِ وَيُصَلِّي عَلَيْهِ غَيْرُ الإِمَامِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1069,
			"arabicnumber": 1069,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي قَتَادَةَ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِرَجُلٍ لِيُصَلِّيَ عَلَيْهِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ فَإِنَّ عَلَيْهِ دَيْنًا ‏\"‏ ‏.‏ قَالَ أَبُو قَتَادَةَ هُوَ عَلَىَّ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِالْوَفَاءِ ‏\"‏ ‏.‏ قَالَ بِالْوَفَاءِ ‏.‏ فَصَلَّى عَلَيْهِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَسَلَمَةَ بْنِ الأَكْوَعِ وَأَسْمَاءَ بِنْتِ يَزِيدَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي قَتَادَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1070,
			"arabicnumber": 1070,
			"text": "حَدَّثَنَا أَبُو الْفَضْلِ، مَكْتُومُ بْنُ الْعَبَّاسِ التِّرْمِذِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُؤْتَى بِالرَّجُلِ الْمُتَوَفَّى عَلَيْهِ الدَّيْنُ فَيَقُولُ ‏\"‏ هَلْ تَرَكَ لِدَيْنِهِ مِنْ قَضَاءٍ ‏\"‏ ‏.‏ فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ وَفَاءً صَلَّى عَلَيْهِ وَإِلاَّ قَالَ لِلْمُسْلِمِينَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏ ‏.‏ فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْفُتُوحَ قَامَ فَقَالَ ‏\"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَمَنْ تُوُفِّيَ مِنَ الْمُسْلِمِينَ فَتَرَكَ دَيْنًا عَلَىَّ قَضَاؤُهُ وَمَنْ تَرَكَ مَالاً فَهُوَ لِوَرَثَتِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ يَحْيَى بْنُ بُكَيْرٍ وَغَيْرُ وَاحِدٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ نَحْوَ حَدِيثِ عَبْدِ اللَّهِ بْنِ صَالِحٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1071,
			"arabicnumber": 1071,
			"text": "حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا قُبِرَ الْمَيِّتُ - أَوْ قَالَ أَحَدُكُمْ أَتَاهُ مَلَكَانِ أَسْوَدَانِ أَزْرَقَانِ يُقَالُ لأَحَدِهِمَا الْمُنْكَرُ وَالآخَرُ النَّكِيرُ فَيَقُولاَنِ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَيَقُولُ مَا كَانَ يَقُولُ هُوَ عَبْدُ اللَّهِ وَرَسُولُهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ‏.‏ فَيَقُولاَنِ قَدْ كُنَّا نَعْلَمُ أَنَّكَ تَقُولُ هَذَا ‏.‏ ثُمَّ يُفْسَحُ لَهُ فِي قَبْرِهِ سَبْعُونَ ذِرَاعًا فِي سَبْعِينَ ثُمَّ يُنَوَّرُ لَهُ فِيهِ ثُمَّ يُقَالُ لَهُ نَمْ ‏.‏ فَيَقُولُ أَرْجِعُ إِلَى أَهْلِي فَأُخْبِرُهُمْ فَيَقُولاَنِ نَمْ كَنَوْمَةِ الْعَرُوسِ الَّذِي لاَ يُوقِظُهُ إِلاَّ أَحَبُّ أَهْلِهِ إِلَيْهِ ‏.‏ حَتَّى يَبْعَثَهُ اللَّهُ مِنْ مَضْجَعِهِ ذَلِكَ ‏.‏ وَإِنْ كَانَ مُنَافِقًا قَالَ سَمِعْتُ النَّاسَ يَقُولُونَ فَقُلْتُ مِثْلَهُ لاَ أَدْرِي ‏.‏ فَيَقُولاَنِ قَدْ كُنَّا نَعْلَمُ أَنَّكَ تَقُولُ ذَلِكَ ‏.‏ فَيُقَالُ لِلأَرْضِ الْتَئِمِي عَلَيْهِ ‏.‏ فَتَلْتَئِمُ عَلَيْهِ ‏.‏ فَتَخْتَلِفُ فِيهَا أَضْلاَعُهُ فَلاَ يَزَالُ فِيهَا مُعَذَّبًا حَتَّى يَبْعَثَهُ اللَّهُ مِنْ مَضْجَعِهِ ذَلِكَ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ عَلِيٍّ وَزَيْدِ بْنِ ثَابِتٍ وَابْنِ عَبَّاسٍ وَالْبَرَاءِ بْنِ عَازِبٍ وَأَبِي أَيُّوبَ وَأَنَسٍ وَجَابِرٍ وَعَائِشَةَ وَأَبِي سَعِيدٍ كُلُّهُمْ رَوَوْا عَنِ النَّبِيِّ صلى الله عليه وسلم فِي عَذَابِ الْقَبْرِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1072,
			"arabicnumber": 1072,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا مَاتَ الْمَيِّتُ عُرِضَ عَلَيْهِ مَقْعَدُهُ بِالْغَدَاةِ وَالْعَشِيِّ فَإِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ ثُمَّ يُقَالُ هَذَا مَقْعَدُكَ حَتَّى يَبْعَثَكَ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1073,
			"arabicnumber": 1073,
			"text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ، قَالَ حَدَّثَنَا وَاللَّهِ، مُحَمَّدُ بْنُ سُوقَةَ عَنْ إِبَرْاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ عَزَّى مُصَابًا فَلَهُ مِثْلُ أَجْرِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ مَرْفُوعًا إِلاَّ مِنْ حَدِيثِ عَلِيِّ بْنِ عَاصِمٍ ‏.‏ وَرَوَى بَعْضُهُمْ عَنْ مُحَمَّدِ بْنِ سُوقَةَ بِهَذَا الإِسْنَادِ مِثْلَهُ مَوْقُوفًا وَلَمْ يَرْفَعْهُ ‏.‏ وَيُقَالُ أَكْثَرُ مَا ابْتُلِيَ بِهِ عَلِيُّ بْنُ عَاصِمٍ بِهَذَا الْحَدِيثِ نَقَمُوا عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1074,
			"arabicnumber": 1074,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَأَبُو عَامِرٍ الْعَقَدِيُّ قَالاَ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ رَبِيعَةَ بْنِ سَيْفٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ مُسْلِمٍ يَمُوتُ يَوْمَ الْجُمُعَةِ أَوْ لَيْلَةَ الْجُمُعَةِ إِلاَّ وَقَاهُ اللَّهُ فِتْنَةَ الْقَبْرِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ ‏.‏ رَبِيعَةُ بْنُ سَيْفٍ إِنَّمَا يَرْوِي عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَلاَ نَعْرِفُ لِرَبِيعَةَ بْنِ سَيْفٍ سَمَاعًا مِنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1075,
			"arabicnumber": 1075,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ، عَنْ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُ ‏ \"‏ يَا عَلِيُّ ثَلاَثٌ لاَ تُؤَخِّرْهَا الصَّلاَةُ إِذَا آنَتْ وَالْجَنَازَةُ إِذَا حَضَرَتْ وَالأَيِّمُ إِذَا وَجَدْتَ لَهَا كُفْؤًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَمَا أَرَى إِسْنَادَهُ بِمُتَّصِلٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُؤَدِّبُ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَتْنَا أُمُّ الأَسْوَدِ، عَنْ مُنْيَةَ بِنْتِ عُبَيْدِ بْنِ أَبِي بَرْزَةَ، عَنْ جَدِّهَا أَبِي بَرْزَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ عَزَّى ثَكْلَى كُسِيَ بُرْدًا فِي الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1077,
			"arabicnumber": 1077,
			"text": "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ الْوَرَّاقُ، عَنْ يَحْيَى بْنِ يَعْلَى الأَسْلَمِيِّ، عَنْ أَبِي فَرْوَةَ، يَزِيدَ بْنِ سِنَانٍ عَنْ زَيْدٍ، وَهُوَ ابْنُ أَبِي أُنَيْسَةَ عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهُ صلى الله عليه وسلم كَبَّرَ عَلَى جَنَازَةٍ فَرَفَعَ يَدَيْهِ فِي أَوَّلِ تَكْبِيرَةٍ وَوَضَعَ الْيُمْنَى عَلَى الْيُسْرَى ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا فَرَأَى أَكْثَرُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنْ يَرْفَعَ الرَّجُلُ يَدَيْهِ فِي كُلِّ تَكْبِيرَةٍ عَلَى الْجَنَازَةِ ‏.‏ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لاَ يَرْفَعُ يَدَيْهِ إِلاَّ فِي أَوَّلِ مَرَّةٍ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ ‏.‏ وَذُكِرَ عَنِ ابْنِ الْمُبَارَكِ أَنَّهُ قَالَ فِي الصَّلاَةِ عَلَى الْجَنَازَةِ لاَ يَقْبِضُ يَمِينَهُ عَلَى شِمَالِهِ ‏.‏ وَرَأَى بَعْضُ أَهْلِ الْعِلْمِ أَنْ يَقْبِضَ بِيَمِينِهِ عَلَى شِمَالِهِ كَمَا يَفْعَلُ فِي الصَّلاَةِ ‏.‏ قَالَ أَبُو عِيسَى يَقْبِضُ أَحَبُّ إِلَىَّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1078,
			"arabicnumber": 1078,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَفْسُ الْمُؤْمِنِ مُعَلَّقَةٌ بِدَيْنِهِ حَتَّى يُقْضَى عَنْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1079,
			"arabicnumber": 1079,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ نَفْسُ الْمُؤْمِنِ مُعَلَّقَةٌ بِدَيْنِهِ حَتَّى يُقْضَى عَنْهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَهُوَ أَصَحُّ مِنَ الأَوَّلِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 115
			}
		}
	]
}