{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2415,
			"arabicnumber": 2415,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْكُمْ مِنْ رَجُلٍ إِلاَّ سَيُكَلِّمُهُ رَبُّهُ يَوْمَ الْقِيَامَةِ وَلَيْسَ بَيْنَهُ وَبَيْنَهُ تَرْجُمَانٌ فَيَنْظُرُ أَيْمَنَ مِنْهُ فَلاَ يَرَى شَيْئًا إِلاَّ شَيْئًا قَدَّمَهُ ثُمَّ يَنْظُرُ أَشْأَمَ مِنْهُ فَلاَ يَرَى شَيْئًا إِلاَّ شَيْئًا قَدَّمَهُ ثُمَّ يَنْظُرُ تِلْقَاءَ وَجْهِهِ فَتَسْتَقْبِلُهُ النَّارُ ‏\". ‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَقِيَ وَجْهَهُ حَرَّ النَّارِ وَلَوْ بِشِقِّ تَمْرَةٍ فَلْيَفْعَلْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا أَبُو السَّائِبِ، حَدَّثَنَا وَكِيعٌ، يَوْمًا بِهَذَا الْحَدِيثِ عَنِ الأَعْمَشِ، فَلَمَّا فَرَغَ وَكِيعٌ مِنْ هَذَا الْحَدِيثِ قَالَ مَنْ كَانَ هَا هُنَا مِنْ أَهْلِ خُرَاسَانَ فَلْيَحْتَسِبْ فِي إِظْهَارِ هَذَا الْحَدِيثِ بِخُرَاسَانَ لأَنَّ الْجَهْمِيَّةَ يُنْكِرُونَ هَذَا ‏.‏ اسْمُ أَبِي السَّائِبِ سَلْمُ بْنُ جُنَادَةَ بْنِ سَلْمِ بْنِ خَالِدِ بْنِ جَابِرِ بْنِ سَمُرَةَ الْكُوفِيُّ ‏.‏هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2416,
			"arabicnumber": 2416,
			"text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا حُصَيْنُ بْنُ نُمَيْرٍ أَبُو مِحْصَنٍ، حَدَّثَنَا حُسَيْنُ بْنُ قَيْسٍ الرَّحَبِيُّ، حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنِ ابْنِ عُمَرَ، عَنِ ابْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَزُولُ قَدَمَا ابْنِ آدَمَ يَوْمَ الْقِيَامَةِ مِنْ عِنْدِ رَبِّهِ حَتَّى يُسْأَلَ عَنْ خَمْسٍ عَنْ عُمْرِهِ فِيمَا أَفْنَاهُ وَعَنْ شَبَابِهِ فِيمَا أَبْلاَهُ وَمَالِهِ مِنْ أَيْنَ اكْتَسَبَهُ وَفِيمَ أَنْفَقَهُ وَمَاذَا عَمِلَ فِيمَا عَلِمَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ ابْنِ مَسْعُودٍ عَنِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ مِنْ حَدِيثِ الْحُسَيْنِ بْنِ قَيْسٍ ‏.‏ وَحُسَيْنُ بْنُ قَيْسٍ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي بَرْزَةَ وَأَبِي سَعِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2417,
			"arabicnumber": 2417,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا الأَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنِ الأَعْمَشِ، عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ بْنِ جُرَيْجٍ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَزُولُ قَدَمَا عَبْدٍ يَوْمَ الْقِيَامَةِ حَتَّى يُسْأَلَ عَنْ عُمْرِهِ فِيمَا أَفْنَاهُ وَعَنْ عِلْمِهِ فِيمَا فَعَلَ وَعَنْ مَالِهِ مِنْ أَيْنَ اكْتَسَبَهُ وَفِيمَا أَنْفَقَهُ وَعَنْ جِسْمِهِ فِيمَا أَبْلاَهُ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَسَعِيدُ بْنُ عَبْدِ اللَّهِ بْنِ جُرَيْجٍ هُوَ بَصْرِيٌّ وَهُوَ مَوْلَى أَبِي بَرْزَةَ وَأَبُو بَرْزَةَ اسْمُهُ نَضْلَةُ بْنُ عُبَيْدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2418,
			"arabicnumber": 2418,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَتَدْرُونَ مَا الْمُفْلِسُ ‏\"‏ ‏.‏ قَالُوا الْمُفْلِسُ فِينَا يَا رَسُولَ اللَّهِ مَنْ لاَ دِرْهَمَ لَهُ وَلاَ مَتَاعَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُفْلِسُ مِنْ أُمَّتِي مَنْ يَأْتِي يَوْمَ الْقِيَامَةِ بِصَلاَتِهِ وَصِيَامِهِ وَزَكَاتِهِ وَيَأْتِي قَدْ شَتَمَ هَذَا وَقَذَفَ هَذَا وَأَكَلَ مَالَ هَذَا وَسَفَكَ دَمَ هَذَا وَضَرَبَ هَذَا فَيَقْعُدُ فَيَقْتَصُّ هَذَا مِنْ حَسَنَاتِهِ وَهَذَا مِنْ حَسَنَاتِهِ فَإِنْ فَنِيَتْ حَسَنَاتُهُ قَبْلَ أَنْ يُقْتَصَّ مَا عَلَيْهِ مِنَ الْخَطَايَا أُخِذَ مِنْ خَطَايَاهُمْ فَطُرِحَ عَلَيْهِ ثُمَّ طُرِحَ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2419,
			"arabicnumber": 2419,
			"text": "حَدَّثَنَا هَنَّادٌ، وَنَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ، قَالَ حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ أَبِي خَالِدٍ، يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ رَحِمَ اللَّهُ عَبْدًا كَانَتْ لأَخِيهِ عِنْدَهُ مَظْلَمَةٌ فِي عِرْضٍ أَوْ مَالٍ فَجَاءَهُ فَاسْتَحَلَّهُ قَبْلَ أَنْ يُؤْخَذَ وَلَيْسَ ثَمَّ دِينَارٌ وَلاَ دِرْهَمٌ فَإِنْ كَانَتْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ حَسَنَاتِهِ وَإِنْ لَمْ تَكُنْ لَهُ حَسَنَاتٌ حَمَّلُوا عَلَيْهِ مِنْ سَيِّئَاتِهِمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ سَعِيدٍ الْمَقْبُرِيِّ ‏.‏ وَقَدْ رَوَاهُ مَالِكُ بْنُ أَنَسٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2420,
			"arabicnumber": 2420,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَتُؤَدَّنَّ الْحُقُوقُ إِلَى أَهْلِهَا حَتَّى يُقَادَ لِلشَّاةِ الْجَلْحَاءِ مِنَ الشَّاةِ الْقَرْنَاءِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي ذَرٍّ وَعَبْدِ اللَّهِ بْنِ أُنَيْسٍ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2421,
			"arabicnumber": 2421,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ، حَدَّثَنَا الْمِقْدَادُ، صَاحِبُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أُدْنِيَتِ الشَّمْسُ مِنَ الْعِبَادِ حَتَّى تَكُونَ قِيدَ مِيلٍ أَوِ اثْنَيْنِ ‏\"‏ ‏.‏ قَالَ سُلَيْمٌ لاَ أَدْرِي أَىَّ الْمِيلَيْنِ عَنَى أَمَسَافَةَ الأَرْضِ أَمِ الْمِيلَ الَّذِي تُكْتَحَلُ بِهِ الْعَيْنُ قَالَ ‏\"‏ فَتَصْهَرُهُمُ الشَّمْسُ فَيَكُونُونَ فِي الْعَرَقِ بِقَدْرِ أَعْمَالِهِمْ فَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى عَقِبَيْهِ وَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى رُكْبَتَيْهِ وَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى حَقْوَيْهِ وَمِنْهُمْ مَنْ يُلْجِمُهُ إِلْجَامًا ‏\"‏ ‏.‏ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُشِيرُ بِيَدِهِ إِلَى فِيهِ أَىْ يُلْجِمُهُ إِلْجَامًا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي سَعِيدٍ وَابْنِ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2422,
			"arabicnumber": 2422,
			"text": "حَدَّثَنَا أَبُو زَكَرِيَّا، يَحْيَى بْنُ دُرُسْتَ الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ حَمَّادٌ وَهُوَ عِنْدَنَا مَرْفُوعٌ ‏(‏يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ ‏)‏ قَالَ يَقُومُونَ فِي الرَّشْحِ إِلَى أَنْصَافِ آذَانِهِمْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2423,
			"arabicnumber": 2423,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ حُفَاةً عُرَاةً غُرْلاً كَمَا خُلِقُوا ثُمَّ قَرَأََ ‏(‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ ‏)‏ وَأَوَّلُ مَنْ يُكْسَى مِنَ الْخَلاَئِقِ إِبْرَاهِيمُ وَيُؤْخَذُ مِنْ أَصْحَابِي بِرِجَالٍ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ فَأَقُولُ يَا رَبِّ أَصْحَابِي ‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُْ‏:‏ ‏(‏إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ‏)‏ ‏\"‏‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، بِهَذَا الإِسْنَادِ فَذَكَرَ نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2424,
			"arabicnumber": 2424,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّكُمْ مَحْشُورُونَ رِجَالاً وَرُكْبَانًا وَتُجَرُّونَ عَلَى وُجُوهِكُمْ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2425,
			"arabicnumber": 2425,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ عَلِيٍّ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُعْرَضُ النَّاسُ يَوْمَ الْقِيَامَةِ ثَلاَثَ عَرَضَاتٍ فَأَمَّا عَرْضَتَانِ فَجِدَالٌ وَمَعَاذِيرُ وَأَمَّا الْعَرْضَةُ الثَّالِثَةُ فَعِنْدَ ذَلِكَ تَطِيرُ الصُّحُفُ فِي الأَيْدِي فَآخِذٌ بِيَمِينِهِ وَآخِذٌ بِشِمَالِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَلاَ يَصِحُّ هَذَا الْحَدِيثُ مِنْ قِبَلِ أَنَّ الْحَسَنَ لَمْ يَسْمَعْ مِنْ أَبِي هُرَيْرَةَ ‏.‏ وَقَدْ رَوَاهُ بَعْضُهُمْ عَنْ عَلِيِّ بْنِ عَلِيٍّ الرِّفَاعِيِّ عَنِ الْحَسَنِ عَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى وَلاَ يَصِحُّ هَذَا الْحَدِيثُ مِنْ قِبَلِ أَنَّ الْحَسَنَ لَمْ يَسْمَعْ مِنْ أَبِي مُوسَى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2426,
			"arabicnumber": 2426,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ نُوقِشَ الْحِسَابَ هَلَكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ تَعَالَى يَقُولَُ‏:‏ ‏(‏فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ * فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ‏)‏ قَالَ ‏\"‏ ذَلِكَ الْعَرْضُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ وَرَوَاهُ أَيُّوبُ أَيْضًا عَنِ ابْنِ أَبِي مُلَيْكَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2427,
			"arabicnumber": 2427,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مُسْلِمٍ، عَنِ الْحَسَنِ، وَقَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُجَاءُ بِابْنِ آدَمَ يَوْمَ الْقِيَامَةِ كَأَنَّهُ بَذَجٌ فَيُوقَفُ بَيْنَ يَدَىِ اللَّهِ فَيَقُولُ اللَّهُ لَهُ أَعْطَيْتُكَ وَخَوَّلْتُكَ وَأَنْعَمْتُ عَلَيْكَ فَمَاذَا صَنَعْتَ ‏.‏ فَيَقُولُ يَا رَبِّ جَمَعْتُهُ وَثَمَّرْتُهُ فَتَرَكْتُهُ أَكْثَرَ مَا كَانَ فَارْجِعْنِي آتِكَ بِهِ ‏.‏ فَيَقُولُ لَهُ أَرِنِي مَا قَدَّمْتَ ‏.‏ فَيَقُولُ يَا رَبِّ جَمَعْتُهُ وَثَمَّرْتُهُ فَتَرَكْتُهُ أَكْثَرَ مَا كَانَ فَارْجِعْنِي آتِكَ بِهِ ‏.‏ فَإِذَا عَبْدٌ لَمْ يُقَدِّمْ خَيْرًا فَيُمْضَى بِهِ إِلَى النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ عَنِ الْحَسَنِ قَوْلَهُ وَلَمْ يُسْنِدُوهُ ‏.‏ وَإِسْمَاعِيلُ بْنُ مُسْلِمٍ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ الْخُدْرِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2428,
			"arabicnumber": 2428,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ الْبَصْرِيُّ، حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ أَبُو مُحَمَّدٍ التَّمِيمِيُّ الْكُوفِيُّ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، وَعَنْ أَبِي سَعِيدٍ، قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُؤْتَى بِالْعَبْدِ يَوْمَ الْقِيَامَةِ فَيَقُولُ اللَّهُ لَهُ أَلَمْ أَجْعَلْ لَكَ سَمْعًا وَبَصَرًا وَمَالاً وَوَلَدًا وَسَخَّرْتُ لَكَ الأَنْعَامَ وَالْحَرْثَ وَتَرَكْتُكَ تَرْأَسُ وَتَرْبَعُ فَكُنْتَ تَظُنُّ أَنَّكَ مُلاَقِيَّ يَوْمَكَ هَذَا قَالَ فَيَقُولُ لاَ ‏.‏ فَيَقُولُ لَهُ الْيَوْمَ أَنْسَاكَ كَمَا نَسِيتَنِي ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ ‏.‏ وَمَعْنَى قَوْلِهِ ‏\"‏ الْيَوْمَ أَنْسَاكَ ‏\"‏ ‏.‏ يَقُولُ الْيَوْمَ أَتْرُكُكَ فِي الْعَذَابِ ‏.‏ هَكَذَا فَسَّرُوهُ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ هَذِهِ الآيَةَ‏:‏ ‏(‏ الْيَوْمَ نَنْسَاهُمْ ‏)‏ قَالُوا إِنَّمَا مَعْنَاهُ الْيَوْمَ نَتْرُكُهُمْ فِي الْعَذَابِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2429,
			"arabicnumber": 2429,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي سُلَيْمَانَ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلمْ ‏(‏يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا ‏)‏ قَالَ ‏\"‏ أَتَدْرُونَ مَا أَخْبَارُهَا ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّ أَخْبَارَهَا أَنْ تَشْهَدَ عَلَى كُلِّ عَبْدٍ أَوْ أَمَةٍ بِمَا عَمِلَ عَلَى ظَهْرِهَا أَنْ تَقُولَ عَمِلَ كَذَا وَكَذَا يَوْمَ كَذَا وَكَذَا قَالَ فَهَذِهِ أَخْبَارُهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2430,
			"arabicnumber": 2430,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَسْلَمَ الْعِجْلِيِّ، عَنْ بِشْرِ بْنِ شَغَافٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِي، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ مَا الصُّورُ قَالَ ‏ \"‏ قَرْنٌ يُنْفَخُ فِيهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ سُلَيْمَانَ التَّيْمِيِّ وَلاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2431,
			"arabicnumber": 2431,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا خَالِدٌ أَبُو الْعَلاَءِ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَيْفَ أَنْعَمُ وَصَاحِبُ الْقَرْنِ قَدِ الْتَقَمَ الْقَرْنَ وَاسْتَمَعَ الإِذْنَ مَتَى يُؤْمَرُ بِالنَّفْخِ فَيَنْفُخُ ‏\"‏ ‏.‏ فَكَأَنَّ ذَلِكَ ثَقُلَ عَلَى أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهُمْ ‏\"‏ قُولُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ عَلَى اللَّهِ تَوَكَّلْنَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ هَذَا الْحَدِيثُ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2432,
			"arabicnumber": 2432,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ سَعْدٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ شِعَارُ الْمُؤْمِنِ عَلَى الصِّرَاطِ رَبِّ سَلِّمْ سَلِّمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ الْمُغِيرَةِ بْنِ شُعْبَةَ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2433,
			"arabicnumber": 2433,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ، حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، حَدَّثَنَا حَرْبُ بْنُ مَيْمُونٍ الأَنْصَارِيُّ أَبُو الْخَطَّابِ، حَدَّثَنَا النَّضْرُ بْنُ أَنَسِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم أَنْ يَشْفَعَ لِي يَوْمَ الْقِيَامَةِ فَقَالَ ‏\"‏ أَنَا فَاعِلٌ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ فَأَيْنَ أَطْلُبُكَ قَالَ ‏\"‏ اطْلُبْنِي أَوَّلَ مَا تَطْلُبُنِي عَلَى الصِّرَاطِ ‏\"‏ ‏.‏ قَالَ قُلْتُ فَإِنْ لَمْ أَلْقَكَ عَلَى الصِّرَاطِ قَالَ ‏\"‏ فَاطْلُبْنِي عِنْدَ الْمِيزَانِ ‏\"‏ ‏.‏ قُلْتُ فَإِنْ لَمْ أَلْقَكَ عِنْدَ الْمِيزَانِ قَالَ ‏\"‏ فَاطْلُبْنِي عِنْدَ الْحَوْضِ فَإِنِّي لاَ أُخْطِئُ هَذِهِ الثَّلاَثَ الْمَوَاطِنَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا أَبُو حَيَّانَ التَّيْمِيُّ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِلَحْمٍ فَرُفِعَ إِلَيْهِ الذِّرَاعُ فَأَكَلَهُ وَكَانَتْ تُعْجِبُهُ فَنَهَسَ مِنْهَا نَهْسَةً ثُمَّ قَالَ ‏ \"‏ أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ هَلْ تَدْرُونَ لِمَ ذَاكَ يَجْمَعُ اللَّهُ النَّاسَ الأَوَّلِينَ وَالآخِرِينَ فِي صَعِيدٍ وَاحِدٍ فَيُسْمِعُهُمُ الدَّاعِي وَيَنْفُذُهُمُ الْبَصَرُ وَتَدْنُو الشَّمْسُ مِنْهُمْ فَيَبْلُغُ النَّاسُ مِنَ الْغَمِّ وَالْكَرْبِ مَا لاَ يُطِيقُونَ وَلاَ يَحْتَمِلُونَ فَيَقُولُ النَّاسُ بَعْضُهُمْ لِبَعْضٍ أَلاَ تَرَوْنَ مَا قَدْ بَلَغَكُمْ أَلاَ تَنْظُرُونَ مَنْ يَشْفَعُ لَكُمْ إِلَى رَبِّكُمْ فَيَقُولُ النَّاسُ بَعْضُهُمْ لِبَعْضٍ عَلَيْكُمْ بِآدَمَ ‏.‏ فَيَأْتُونَ آدَمَ فَيَقُولُونَ أَنْتَ أَبُو الْبَشَرِ خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ وَأَمَرَ الْمَلاَئِكَةَ فَسَجَدُوا لَكَ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلاَ تَرَى مَا نَحْنُ فِيهِ أَلاَ تَرَى مَا قَدْ بَلَغَنَا فَيَقُولُ لَهُمْ آدَمُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنَّهُ قَدْ نَهَانِي عَنِ الشَّجَرَةِ فَعَصَيْتُ نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى نُوحٍ ‏.‏ فَيَأْتُونَ نُوحًا فَيَقُولُونَ يَا نُوحُ أَنْتَ أَوَّلُ الرُّسُلِ إِلَى أَهْلِ الأَرْضِ وَقَدْ سَمَّاكَ اللَّهُ عَبْدًا شَكُورًا اشْفَعْ لَنَا إِلَى رَبِّكَ أَلاَ تَرَى مَا نَحْنُ فِيهِ أَلاَ تَرَى مَا قَدْ بَلَغَنَا فَيَقُولُ لَهُمْ نُوحٌ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنَّهُ قَدْ كَانَ لِي دَعْوَةٌ دَعَوْتُهَا عَلَى قَوْمِي نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى إِبْرَاهِيمَ ‏.‏ فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُونَ يَا إِبْرَاهِيمُ أَنْتَ نَبِيُّ اللَّهِ وَخَلِيلُهُ مِنْ أَهْلِ الأَرْضِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلاَ تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنِّي قَدْ كَذَبْتُ ثَلاَثَ كَذَبَاتٍ فَذَكَرَهُنَّ أَبُو حَيَّانَ فِي الْحَدِيثِ نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى مُوسَى ‏.‏ فَيَأْتُونَ مُوسَى فَيَقُولُونَ يَا مُوسَى أَنْتَ رَسُولُ اللَّهِ فَضَّلَكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلاَمِهِ عَلَى الْبَشَرِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلاَ تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنِّي قَدْ قَتَلْتُ نَفْسًا لَمْ أُومَرْ بِقَتْلِهَا نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى عِيسَى ‏.‏ فَيَأْتُونَ عِيسَى فَيَقُولُونَ يَا عِيسَى أَنْتَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ وَكَلَّمْتَ النَّاسَ فِي الْمَهْدِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلاَ تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ عِيسَى إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَلَمْ يَذْكُرْ ذَنْبًا نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى مُحَمَّدٍ ‏.‏ قَالَ فَيَأْتُونَ مُحَمَّدًا فَيَقُولُونَ يَا مُحَمَّدُ أَنْتَ رَسُولُ اللَّهِ وَخَاتَمُ الأَنْبِيَاءِ وَقَدْ غُفِرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلاَ تَرَى مَا نَحْنُ فِيهِ فَأَنْطَلِقُ فَآتِي تَحْتَ الْعَرْشِ فَأَخِرُّ سَاجِدًا لِرَبِّي ثُمَّ يَفْتَحُ اللَّهُ عَلَىَّ مِنْ مَحَامِدِهِ وَحُسْنِ الثَّنَاءِ عَلَيْهِ شَيْئًا لَمْ يَفْتَحْهُ عَلَى أَحَدٍ قَبْلِي ثُمَّ يُقَالُ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ سَلْ تُعْطَهُ وَاشْفَعْ تُشَفَّعْ ‏.‏ فَأَرْفَعُ رَأْسِي فَأَقُولُ يَا رَبِّ أُمَّتِي يَا رَبِّ أُمَّتِي يَا رَبِّ أُمَّتِي ‏.‏ فَيَقُولُ يَا مُحَمَّدُ أَدْخِلْ مِنْ أُمَّتِكَ مَنْ لاَ حِسَابَ عَلَيْهِ مِنَ الْبَابِ الأَيْمَنِ مِنْ أَبْوَابِ الْجَنَّةِ وَهُمْ شُرَكَاءُ النَّاسِ فِيمَا سِوَى ذَلِكَ مِنَ الأَبْوَابِ ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ مَا بَيْنَ الْمِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ كَمَا بَيْنَ مَكَّةَ وَهَجَرَ وَكَمَا بَيْنَ مَكَّةَ وَبُصْرَى ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ وَأَنَسٍ وَعُقْبَةَ بْنِ عَامِرٍ وَأَبِي سَعِيدٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو حَيَّانَ التَّيْمِيُّ اسْمُهُ يَحْيَى بْنُ سَعِيدِ بْنِ حَيَّانَ كُوفِيٌّ وَهُوَ ثِقَةٌ وَأَبُو زُرْعَةَ بْنُ عَمْرِو بْنِ جَرِيرٍ اسْمُهُ هَرِمٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2435,
			"arabicnumber": 2435,
			"text": "حَدَّثَنَا الْعَبَّاسُ الْعَنْبَرِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ شَفَاعَتِي لأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِي ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2436,
			"arabicnumber": 2436,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، عَنْ مُحَمَّدِ بْنِ ثَابِتٍ الْبُنَانِيِّ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ شَفَاعَتِي لأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِي ‏\"‏ ‏.‏ قَالَ مُحَمَّدُ بْنُ عَلِيٍّ فَقَالَ لِي جَابِرٌ يَا مُحَمَّدُ مَنْ لَمْ يَكُنْ مِنْ أَهْلِ الْكَبَائِرِ فَمَا لَهُ وَلِلشَّفَاعَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ يُسْتَغْرَبُ مِنْ حَدِيثِ جَعْفَرِ بْنِ مُحَمَّدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2437,
			"arabicnumber": 2437,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ الأَلْهَانِيِّ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ وَعَدَنِي رَبِّي أَنْ يُدْخِلَ الْجَنَّةَ مِنْ أُمَّتِي سَبْعِينَ أَلْفًا لاَ حِسَابَ عَلَيْهِمْ وَلاَ عَذَابَ مَعَ كُلِّ أَلْفٍ سَبْعُونَ أَلْفًا وَثَلاَثُ حَثَيَاتٍ مِنْ حَثَيَاتِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2438,
			"arabicnumber": 2438,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ كُنْتُ مَعَ رَهْطٍ بِإِيلِيَاءَ فَقَالَ رَجُلٌ مِنْهُمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَدْخُلُ الْجَنَّةَ بِشَفَاعَةِ رَجُلٍ مِنْ أُمَّتِي أَكْثَرُ مِنْ بَنِي تَمِيمٍ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ سِوَاكَ قَالَ ‏\"‏ سِوَاىَ ‏\"‏ ‏.‏ فَلَمَّا قَامَ قُلْتُ مَنْ هَذَا قَالُوا هَذَا ابْنُ أَبِي الْجَذْعَاءِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏ وَابْنُ أَبِي الْجَذْعَاءِ هُوَ عَبْدُ اللَّهِ وَإِنَّمَا يُعْرَفُ لَهُ هَذَا الْحَدِيثُ الْوَاحِدُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2439,
			"arabicnumber": 2439,
			"text": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ، مُحَمَّدُ بْنُ يَزِيدَ الْكُوفِيُّ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ، عَنْ جِسْرٍ أَبِي جَعْفَرٍ، عَنِ الْحَسَنِ الْبَصْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَشْفَعُ عُثْمَانُ بْنُ عَفَّانَ يَوْمَ الْقِيَامَةِ فِي مِثْلِ رَبِيعَةَ وَمُضَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2440,
			"arabicnumber": 2440,
			"text": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ مِنْ أُمَّتِي مَنْ يَشْفَعُ لِلْفِئَامِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْقَبِيلَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْعُصْبَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلرَّجُلِ حَتَّى يَدْخُلُوا الْجَنَّةَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2441,
			"arabicnumber": 2441,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ، عَنْ عَوْفِ بْنِ مَالِكٍ الأَشْجَعِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَتَانِي آتٍ مِنْ عِنْدِ رَبِّي فَخَيَّرَنِي بَيْنَ أَنْ يُدْخِلَ نِصْفَ أُمَّتِي الْجَنَّةَ وَبَيْنَ الشَّفَاعَةِ فَاخْتَرْتُ الشَّفَاعَةَ وَهِيَ لِمَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا ‏\"‏ ‏.‏ وَقَدْ رُوِيَ عَنْ أَبِي الْمَلِيحِ عَنْ رَجُلٍ آخَرَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرْ عَنْ عَوْفِ بْنِ مَالِكٍ وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ ‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ، عَنْ عَوْفِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2442,
			"arabicnumber": 2442,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا بِشْرُ بْنُ شُعَيْبِ بْنِ أَبِي حَمْزَةَ، حَدَّثَنِي أَبِي، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ فِي حَوْضِي مِنَ الأَبَارِيقِ بِعَدَدِ نُجُومِ السَّمَاءِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2443,
			"arabicnumber": 2443,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عَلِيِّ بْنِ نِيزَكَ الْبَغْدَادِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ الدِّمَشْقِيُّ، حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِكُلِّ نَبِيٍّ حَوْضًا وَإِنَّهُمْ يَتَبَاهَوْنَ أَيُّهُمْ أَكْثَرُ وَارِدَةً وَإِنِّي أَرْجُو أَنْ أَكُونَ أَكْثَرَهُمْ وَارِدَةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَقَدْ رَوَى الأَشْعَثُ بْنُ عَبْدِ الْمَلِكِ هَذَا الْحَدِيثَ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً وَلَمْ يَذْكُرْ فِيهِ عَنْ سَمُرَةَ وَهُوَ أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2444,
			"arabicnumber": 2444,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ، عَنِ الْعَبَّاسِ، عَنْ أَبِي سَلاَّمٍ الْحَبَشِيِّ، قَالَ بَعَثَ إِلَىَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَحُمِلْتُ عَلَى الْبَرِيدِ ‏.‏ قَالَ فَلَمَّا دَخَلَ عَلَيْهِ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ لَقَدْ شَقَّ عَلَى مَرْكَبِي الْبَرِيدُ ‏.‏ فَقَالَ يَا أَبَا سَلاَّمٍ مَا أَرَدْتُ أَنْ أَشُقَّ عَلَيْكَ وَلَكِنْ بَلَغَنِي عَنْكَ حَدِيثٌ تُحَدِّثُهُ عَنْ ثَوْبَانَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْحَوْضِ فَأَحْبَبْتُ أَنْ تُشَافِهَنِي بِهِ ‏.‏ قَالَ أَبُو سَلاَّمٍ حَدَّثَنِي ثَوْبَانُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ حَوْضِي مِنْ عَدَنَ إِلَى عَمَّانَ الْبَلْقَاءِ مَاؤُهُ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ وَأَكَاوِيبُهُ عَدَدُ نُجُومِ السَّمَاءِ مَنْ شَرِبَ مِنْهُ شَرْبَةً لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا أَوَّلُ النَّاسِ وُرُودًا عَلَيْهِ فُقَرَاءُ الْمُهَاجِرِينَ الشُّعْثُ رُءُوسًا الدُّنْسُ ثِيَابًا الَّذِينَ لاَ يَنْكِحُونَ الْمُتَنَعِّمَاتِ وَلاَ تُفْتَحُ لَهُمُ السُّدَدُ ‏\"‏ ‏.‏ قَالَ عُمَرُ لَكِنِّي نَكَحْتُ الْمُتَنَعِّمَاتِ وَفُتِحَ لِيَ السُّدَدُ وَنَكَحْتُ فَاطِمَةَ بِنْتَ عَبْدِ الْمَلِكِ لاَ جَرَمَ أَنِّي لاَ أَغْسِلُ رَأْسِي حَتَّى يَشْعَثَ وَلاَ أَغْسِلُ ثَوْبِي الَّذِي يَلِي جَسَدِي حَتَّى يَتَّسِخَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ ثَوْبَانَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَأَبُو سَلاَّمٍ الْحَبَشِيُّ اسْمُهُ مَمْطُورٌ وَهُوَ شَامِيٌّ ثِقَةٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2445,
			"arabicnumber": 2445,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ الْعَمِّيُّ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا آنِيَةُ الْحَوْضِ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ نُجُومِ السَّمَاءِ وَكَوَاكِبِهَا فِي لَيْلَةٍ مُظْلِمَةٍ مُصْحِيَةٍ مِنْ آنِيَةِ الْجَنَّةِ مَنْ شَرِبَ مِنْهَا شَرْبَةً لَمْ يَظْمَأْ آخِرَ مَا عَلَيْهِ عَرْضُهُ مِثْلُ طُولِهِ مَا بَيْنَ عَمَّانَ إِلَى أَيْلَةَ مَاؤُهُ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏ وَفِي الْبَابِ عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي بَرْزَةَ الأَسْلَمِيِّ وَابْنِ عُمَرَ وَحَارِثَةَ بْنِ وَهْبٍ وَالْمُسْتَوْرِدِ بْنِ شَدَّادٍ ‏.‏ - وَرُوِيَ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ حَوْضِي كَمَا بَيْنَ الْكُوفَةِ إِلَى الْحَجَرِ الأَسْوَدِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "حَدَّثَنَا أَبُو حَصِينٍ عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ يُونُسَ، كُوفِيٌّ حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ، حَدَّثَنَا حُصَيْنٌ، هُوَ ابْنُ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا أُسْرِيَ بِالنَّبِيِّ صلى الله عليه وسلم جَعَلَ يَمُرُّ بِالنَّبِيِّ وَالنَّبِيَّيْنِ وَمَعَهُمُ الْقَوْمُ وَالنَّبِيِّ وَالنَّبِيَّيْنِ وَمَعَهُمُ الرَّهْطُ وَالنَّبِيِّ وَالنَّبِيِّينَ وَلَيْسَ مَعَهُمْ أَحَدٌ حَتَّى مَرَّ بِسَوَادٍ عَظِيمٍ فَقُلْتُ مَنْ هَذَا قِيلَ مُوسَى وَقَوْمُهُ وَلَكِنِ ارْفَعْ رَأْسَكَ فَانْظُرْ ‏.‏ قَالَ فَإِذَا سَوَادٌ عَظِيمٌ قَدْ سَدَّ الأُفُقَ مِنْ ذَا الْجَانِبِ وَمِنْ ذَا الْجَانِبِ فَقِيلَ هَؤُلاَءِ أُمَّتُكَ وَسِوَى هَؤُلاَءِ مِنْ أُمَّتِكَ سَبْعُونَ أَلْفًا يَدْخُلُونَ الْجَنَّةَ بِغَيْرِ حِسَابٍ ‏.‏ فَدَخَلَ وَلَمْ يَسْأَلُوهُ وَلَمْ يُفَسِّرْ لَهُمْ فَقَالُوا نَحْنُ هُمْ ‏.‏ وَقَالَ قَائِلُونَ هُمْ أَبْنَاؤُنَا الَّذِينَ وُلِدُوا عَلَى الْفِطْرَةِ وَالإِسْلاَمِ ‏.‏ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ هُمُ الَّذِينَ لاَ يَكْتَوُونَ وَلاَ يَسْتَرْقُونَ وَلاَ يَتَطَيَّرُونَ وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ‏\"‏ ‏.‏ فَقَامَ عُكَّاشَةُ بْنُ مِحْصَنٍ فَقَالَ أَنَا مِنْهُمْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ ثُمَّ قَامَ آخَرُ فَقَالَ أَنَا مِنْهُمْ فَقَالَ ‏\"‏ سَبَقَكَ بِهَا عُكَّاشَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا أَعْرِفُ شَيْئًا مِمَّا كُنَّا عَلَيْهِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقُلْتُ أَيْنَ الصَّلاَةُ قَالَ أَوَلَمْ تَصْنَعُوا فِي صَلاَتِكُمْ مَا قَدْ عَلِمْتُمْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَبِي عِمْرَانَ الْجَوْنِيِّ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَنَسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2448,
			"arabicnumber": 2448,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الأَزْدِيُّ الْبَصْرِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا هَاشِمٌ، وَهُوَ ابْنُ سَعِيدٍ الْكُوفِيُّ حَدَّثَنِي زَيْدٌ الْخَثْعَمِيُّ، عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ الْخَثْعَمِيَّةِ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بِئْسَ الْعَبْدُ عَبْدٌ تَخَيَّلَ وَاخْتَالَ وَنَسِيَ الْكَبِيرَ الْمُتَعَالِ بِئْسَ الْعَبْدُ عَبْدٌ تَجَبَّرَ وَاعْتَدَى وَنَسِيَ الْجَبَّارَ الأَعْلَى بِئْسَ الْعَبْدُ عَبْدٌ سَهَا وَلَهَا وَنَسِيَ الْمَقَابِرَ وَالْبِلَى بِئْسَ الْعَبْدُ عَبْدٌ عَتَا وَطَغَى وَنَسِيَ الْمُبْتَدَا وَالْمُنْتَهَى بِئْسَ الْعَبْدُ عَبْدٌ يَخْتِلُ الدُّنْيَا بِالدِّينِ بِئْسَ الْعَبْدُ عَبْدٌ يَخْتِلُ الدِّينَ بِالشُّبُهَاتِ بِئْسَ الْعَبْدُ عَبْدٌ طَمَعٌ يَقُودُهُ بِئْسَ الْعَبْدُ عَبْدٌ هَوًى يُضِلُّهُ بِئْسَ الْعَبْدُ عَبْدٌ رَغَبٌ يُذِلُّهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2449,
			"arabicnumber": 2449,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُؤَدِّبُ، حَدَّثَنَا عَمَّارُ بْنُ مُحَمَّدِ ابْنُ أُخْتِ، سُفْيَانَ الثَّوْرِيِّ حَدَّثَنَا أَبُو الْجَارُودِ الأَعْمَى، وَاسْمُهُ، زِيَادُ بْنُ الْمُنْذِرِ الْهَمْدَانِيُّ عَنْ عَطِيَّةَ الْعَوْفِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا مُؤْمِنٍ أَطْعَمَ مُؤْمِنًا عَلَى جُوعٍ أَطْعَمَهُ اللَّهُ يَوْمَ الْقِيَامَةِ مِنْ ثِمَارِ الْجَنَّةِ وَأَيُّمَا مُؤْمِنٍ سَقَى مُؤْمِنًا عَلَى ظَمَإٍ سَقَاهُ اللَّهُ يَوْمَ الْقِيَامَةِ مِنَ الرَّحِيقِ الْمَخْتُومِ وَأَيُّمَا مُؤْمِنٍ كَسَا مُؤْمِنًا عَلَى عُرْىٍ كَسَاهُ اللَّهُ مِنْ خُضْرِ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ رُوِيَ هَذَا عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ مَوْقُوفٌ وَهُوَ أَصَحُّ عِنْدَنَا وَأَشْبَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2450,
			"arabicnumber": 2450,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو عَقِيلٍ الثَّقَفِيُّ، حَدَّثَنَا أَبُو فَرْوَةَ، يَزِيدُ بْنُ سِنَانٍ التَّمِيمِيُّ حَدَّثَنِي بُكَيْرُ بْنُ فَيْرُوزَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ خَافَ أَدْلَجَ وَمَنْ أَدْلَجَ بَلَغَ الْمَنْزِلَ أَلاَ إِنَّ سِلْعَةَ اللَّهِ غَالِيَةٌ أَلاَ إِنَّ سِلْعَةَ اللَّهِ الْجَنَّةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ أَبِي النَّضْرِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2451,
			"arabicnumber": 2451,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو عَقِيلٍ الثَّقَفِيُّ عَبْدُ اللَّهِ بْنُ عَقِيلٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ، وَعَطِيَّةُ بْنُ قَيْسٍ، عَنْ عَطِيَّةَ السَّعْدِيِّ، وَكَانَ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَبْلُغُ الْعَبْدُ أَنْ يَكُونَ مِنَ الْمُتَّقِينَ حَتَّى يَدَعَ مَا لاَ بَأْسَ بِهِ حَذَرًا لِمَا بِهِ الْبَأْسُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2452,
			"arabicnumber": 2452,
			"text": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا عِمْرَانُ الْقَطَّانُ، عَنْ قَتَادَةَ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ حَنْظَلَةَ الأُسَيْدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّكُمْ تَكُونُونَ كَمَا تَكُونُونَ عِنْدِي لأَظَلَّتْكُمُ الْمَلاَئِكَةُ بِأَجْنِحَتِهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ حَنْظَلَةَ الأُسَيْدِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2453,
			"arabicnumber": 2453,
			"text": "حَدَّثَنَا يُوسُفُ بْنُ سَلْمَانَ أَبُو عُمَرَ الْبَصْرِيُّ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنِ ابْنِ عَجْلاَنَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ لِكُلِّ شَيْءٍ شِرَّةً وَلِكُلِّ شِرَّةٍ فَتْرَةً فَإِنْ كَانَ صَاحِبُهَا سَدَّدَ وَقَارَبَ فَارْجُوهُ وَإِنْ أُشِيرَ إِلَيْهِ بِالأَصَابِعِ فَلاَ تَعُدُّوهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ - وَقَدْ رُوِيَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ بِحَسْبِ امْرِئٍ مِنَ الشَّرِّ أَنْ يُشَارَ إِلَيْهِ بِالأَصَابِعِ فِي دِينٍ أَوْ دُنْيَا إِلاَّ مَنْ عَصَمَهُ اللَّهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2454,
			"arabicnumber": 2454,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِيهِ، عَنْ أَبِي يَعْلَى، عَنِ الرَّبِيعِ بْنِ خُثَيْمٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ خَطَّ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم خَطًّا مُرَبَّعًا وَخَطَّ فِي وَسَطِ الْخَطِّ خَطًّا وَخَطَّ خَارِجًا مِنَ الْخَطِّ خَطًّا وَحَوْلَ الَّذِي فِي الْوَسَطِ خُطُوطًا فَقَالَ ‏ \"‏ هَذَا ابْنُ آدَمَ وَهَذَا أَجَلُهُ مُحِيطٌ بِهِ وَهَذَا الَّذِي فِي الْوَسَطِ الإِنْسَانُ وَهَذِهِ الْخُطُوطُ عُرُوضُهُ إِنْ نَجَا مِنْ هَذَا يَنْهَشُهُ هَذَا وَالْخَطُّ الْخَارِجُ الأَمَلُ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2455,
			"arabicnumber": 2455,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَهْرَمُ ابْنُ آدَمَ وَيَشِبُّ مِنْهُ اثْنَانِ الْحِرْصُ عَلَى الْمَالِ وَالْحِرْصُ عَلَى الْعُمُرِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2456,
			"arabicnumber": 2456,
			"text": "حَدَّثَنَا أَبُو هُرَيْرَةَ، مُحَمَّدُ بْنُ فِرَاسٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو قُتَيْبَةَ، سَلْمُ بْنُ قُتَيْبَةَ حَدَّثَنَا أَبُو الْعَوَّامِ، وَهُوَ عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مُثَلَ ابْنِ آدَمَ وَإِلَى جَنْبِهِ تِسْعَةٌ وَتِسْعُونَ مَنِيَّةً إِنْ أَخْطَأَتْهُ الْمَنَايَا وَقَعَ فِي الْهَرَمِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2457,
			"arabicnumber": 2457,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا قَبِيصَةُ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنِ الطُّفَيْلِ بْنِ أُبَىِّ بْنِ كَعْبٍ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا ذَهَبَ ثُلُثَا اللَّيْلِ قَامَ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ اذْكُرُوا اللَّهَ اذْكُرُوا اللَّهَ جَاءَتِ الرَّاجِفَةُ تَتْبَعُهَا الرَّادِفَةُ جَاءَ الْمَوْتُ بِمَا فِيهِ جَاءَ الْمَوْتُ بِمَا فِيهِ ‏\"‏ ‏.‏ قَالَ أُبَىٌّ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُكْثِرُ الصَّلاَةَ عَلَيْكَ فَكَمْ أَجْعَلُ لَكَ مِنْ صَلاَتِي فَقَالَ ‏\"‏ مَا شِئْتَ ‏\"‏ ‏.‏ قَالَ قُلْتُ الرُّبُعَ ‏.‏ قَالَ ‏\"‏ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ ‏\"‏ ‏.‏ قُلْتُ النِّصْفَ ‏.‏ قَالَ ‏\"‏ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ فَالثُّلُثَيْنِ ‏.‏ قَالَ ‏\"‏ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ ‏\"‏ ‏.‏ قُلْتُ أَجْعَلُ لَكَ صَلاَتِي كُلَّهَا ‏.‏ قَالَ ‏\"‏ إِذًا تُكْفَى هَمَّكَ وَيُغْفَرُ لَكَ ذَنْبُكَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2458,
			"arabicnumber": 2458,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ أَبَانَ بْنِ إِسْحَاقَ، عَنِ الصَّبَّاحِ بْنِ مُحَمَّدٍ، عَنْ مُرَّةَ الْهَمْدَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَحْيُوا مِنَ اللَّهِ حَقَّ الْحَيَاءِ ‏\"‏ ‏.‏ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّا لَنَسْتَحْيِي وَالْحَمْدُ لِلَّهِ ‏.‏ قَالَ ‏\"‏ لَيْسَ ذَاكَ وَلَكِنَّ الاِسْتِحْيَاءَ مِنَ اللَّهِ حَقَّ الْحَيَاءِ أَنْ تَحْفَظَ الرَّأْسَ وَمَا وَعَى وَتَحْفَظَ الْبَطْنَ وَمَا حَوَى وَتَتَذَكَّرَ الْمَوْتَ وَالْبِلَى وَمَنْ أَرَادَ الآخِرَةَ تَرَكَ زِينَةَ الدُّنْيَا فَمَنْ فَعَلَ ذَلِكَ فَقَدِ اسْتَحْيَا مِنَ اللَّهِ حَقَّ الْحَيَاءِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَبَانَ بْنِ إِسْحَاقَ عَنِ الصَّبَّاحِ بْنِ مُحَمَّدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2459,
			"arabicnumber": 2459,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ، عَنْ ضَمْرَةَ بْنِ حَبِيبٍ، عَنْ شَدَّادِ بْنِ أَوْسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْكَيِّسُ مَنْ دَانَ نَفْسَهُ وَعَمِلَ لِمَا بَعْدَ الْمَوْتِ وَالْعَاجِزُ مَنْ أَتْبَعَ نَفْسَهُ هَوَاهَا وَتَمَنَّى عَلَى اللَّهِ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ ‏.‏ قَالَ وَمَعْنَى قَوْلِهِ ‏\"‏ مَنْ دَانَ نَفْسَهُ ‏\"‏ ‏.‏ يَقُولُ حَاسَبَ نَفْسَهُ فِي الدُّنْيَا قَبْلَ أَنْ يُحَاسَبَ يَوْمَ الْقِيَامَةِ ‏.‏ وَيُرْوَى عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ حَاسِبُوا أَنْفُسَكُمْ قَبْلَ أَنْ تُحَاسَبُوا وَتَزَيَّنُوا لِلْعَرْضِ الأَكْبَرِ وَإِنَّمَا يَخِفُّ الْحِسَابُ يَوْمَ الْقِيَامَةِ عَلَى مَنْ حَاسَبَ نَفْسَهُ فِي الدُّنْيَا ‏.‏ وَيُرْوَى عَنْ مَيْمُونِ بْنِ مِهْرَانَ قَالَ لاَ يَكُونُ الْعَبْدُ تَقِيًّا حَتَّى يُحَاسِبَ نَفْسَهُ كَمَا يُحَاسِبُ شَرِيكَهُ مِنْ أَيْنَ مَطْعَمُهُ وَمَلْبَسُهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنُ مَدُّويَهْ التِّرْمِذِيُّ، حَدَّثَنَا الْقَاسِمُ بْنُ الْحَكَمِ الْعُرَنِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْوَلِيدِ الْوَصَّافِيُّ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُصَلاَّهُ فَرَأَى نَاسًا كَأَنَّهُمْ يَكْتَشِرُونَ قَالَ ‏\"‏ أَمَا إِنَّكُمْ لَوْ أَكْثَرْتُمْ ذِكْرَ هَاذِمِ اللَّذَّاتِ لَشَغَلَكُمْ عَمَّا أَرَى فَأَكْثِرُوا مِنْ ذِكْرِ هَاذِمِ اللَّذَّاتِ الْمَوْتِ فَإِنَّهُ لَمْ يَأْتِ عَلَى الْقَبْرِ يَوْمٌ إِلاَّ تَكَلَّمَ فِيهِ فَيَقُولُ أَنَا بَيْتُ الْغُرْبَةِ وَأَنَا بَيْتُ الْوَحْدَةِ وَأَنَا بَيْتُ التُّرَابِ وَأَنَا بَيْتُ الدُّودِ ‏.‏ فَإِذَا دُفِنَ الْعَبْدُ الْمُؤْمِنُ قَالَ لَهُ الْقَبْرُ مَرْحَبًا وَأَهْلاً أَمَا إِنْ كُنْتَ لأَحَبَّ مَنْ يَمْشِي عَلَى ظَهْرِي إِلَىَّ فَإِذْ وُلِّيتُكَ الْيَوْمَ وَصِرْتَ إِلَىَّ فَسَتَرَى صَنِيعِي بِكَ ‏.‏ قَالَ فَيَتَّسِعُ لَهُ مَدَّ بَصَرِهِ وَيُفْتَحُ لَهُ بَابٌ إِلَى الْجَنَّةِ ‏.‏ وَإِذَا دُفِنَ الْعَبْدُ الْفَاجِرُ أَوِ الْكَافِرُ قَالَ لَهُ الْقَبْرُ لاَ مَرْحَبًا وَلاَ أَهْلاً أَمَا إِنْ كُنْتَ لأَبْغَضَ مَنْ يَمْشِي عَلَى ظَهْرِي إِلَىَّ فَإِذْ وُلِّيتُكَ الْيَوْمَ وَصِرْتَ إِلَىَّ فَسَتَرَى صَنِيعِي بِكَ ‏.‏ قَالَ فَيَلْتَئِمُ عَلَيْهِ حَتَّى تَلْتَقِيَ عَلَيْهِ وَتَخْتَلِفَ أَضْلاَعُهُ ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَصَابِعِهِ فَأَدْخَلَ بَعْضَهَا فِي جَوْفِ بَعْضٍ قَالَ ‏\"‏ وَيُقَيِّضُ اللَّهُ لَهُ سَبْعِينَ تِنِّينًا لَوْ أَنَّ وَاحِدًا مِنْهَا نَفَخَ فِي الأَرْضِ مَا أَنْبَتَتْ شَيْئًا مَا بَقِيَتِ الدُّنْيَا فَيَنْهَشْنَهُ وَيَخْدِشْنَهُ حَتَّى يُفْضَى بِهِ إِلَى الْحِسَابِ ‏\"‏ ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا الْقَبْرُ رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ أَوْ حُفْرَةٌ مِنْ حُفَرِ النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2461,
			"arabicnumber": 2461,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ أَخْبَرَنِي عُمَرُ بْنُ الْخَطَّابِ، قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ مُتَّكِئٌ عَلَى رَمْلِ حَصِيرٍ فَرَأَيْتُ أَثَرَهُ فِي جَنْبِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2462,
			"arabicnumber": 2462,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، وَيُونُسَ، عَنِ الزُّهْرِيِّ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، أَخْبَرَهُ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ أَخْبَرَهُ أَنَّ عَمْرَو بْنَ عَوْفٍ وَهُوَ حَلِيفُ بَنِي عَامِرِ بْنِ لُؤَىٍّ وَكَانَ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم - أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ فَقَدِمَ بِمَالٍ مِنَ الْبَحْرَيْنِ وَسَمِعَتِ الأَنْصَارُ بِقُدُومِ أَبِي عُبَيْدَةَ فَوَافَوْا صَلاَةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم انْصَرَفَ فَتَعَرَّضُوا لَهُ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ رَآهُمْ ثُمَّ قَالَ ‏\"‏ أَظُنُّكُمْ سَمِعْتُمْ أَنَّ أَبَا عُبَيْدَةَ قَدِمَ بِشَيْءٍ ‏\"‏ ‏.‏ قَالُوا أَجَلْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَأَبْشِرُوا وَأَمِّلُوا مَا يَسُرُّكُمْ فَوَاللَّهِ مَا الْفَقْرَ أَخْشَى عَلَيْكُمْ وَلَكِنِّي أَخْشَى أَنْ تُبْسَطَ الدُّنْيَا عَلَيْكُمْ كَمَا بُسِطَتْ عَلَى مَنْ قَبْلَكُمْ فَتَنَافَسُوهَا كَمَا تَنَافَسُوهَا فَتُهْلِكَكُمْ كَمَا أَهْلَكَتْهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2463,
			"arabicnumber": 2463,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَابْنِ الْمُسَيَّبِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ ‏ \"‏ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏ ‏.‏ فَقَالَ حَكِيمٌ فَقُلْتُ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ أَرْزَأُ أَحَدًا بَعْدَكَ شَيْئًا حَتَّى أُفَارِقَ الدُّنْيَا ‏.‏ فَكَانَ أَبُو بَكْرٍ يَدْعُو حَكِيمًا إِلَى الْعَطَاءِ فَيَأْبَى أَنْ يَقْبَلَهُ ثُمَّ إِنَّ عُمَرَ دَعَاهُ لِيُعْطِيَهُ فَأَبَى أَنْ يَقْبَلَ مِنْهُ شَيْئًا فَقَالَ عُمَرُ إِنِّي أُشْهِدُكُمْ يَا مَعْشَرَ الْمُسْلِمِينَ عَلَى حَكِيمٍ أَنِّي أَعْرِضُ عَلَيْهِ حَقَّهُ مِنْ هَذَا الْفَىْءِ فَيَأْبَى أَنْ يَأْخُذَهُ ‏.‏ فَلَمْ يَرْزَأْ حَكِيمٌ أَحَدًا مِنَ النَّاسِ شَيْئًا بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى تُوُفِّيَ ‏.‏ قَالَ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2464,
			"arabicnumber": 2464,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ ابْتُلِينَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالضَّرَّاءِ فَصَبَرْنَا ثُمَّ ابْتُلِينَا بِالسَّرَّاءِ بَعْدَهُ فَلَمْ نَصْبِرْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2465,
			"arabicnumber": 2465,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنِ الرَّبِيعِ بْنِ صَبِيحٍ، عَنْ يَزِيدَ بْنِ أَبَانَ، وَهُوَ الرَّقَاشِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَتِ الآخِرَةُ هَمَّهُ جَعَلَ اللَّهُ غِنَاهُ فِي قَلْبِهِ وَجَمَعَ لَهُ شَمْلَهُ وَأَتَتْهُ الدُّنْيَا وَهِيَ رَاغِمَةٌ وَمَنْ كَانَتِ الدُّنْيَا هَمَّهُ جَعَلَ اللَّهُ فَقْرَهُ بَيْنَ عَيْنَيْهِ وَفَرَّقَ عَلَيْهِ شَمْلَهَ وَلَمْ يَأْتِهِ مِنَ الدُّنْيَا إِلاَّ مَا قُدِّرَ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2466,
			"arabicnumber": 2466,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ عِمْرَانَ بْنِ زَائِدَةَ بْنِ نَشِيطٍ، عَنْ أَبِيهِ، عَنْ أَبِي خَالِدٍ الْوَالِبِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ تَعَالَى يَقُولُ يَا ابْنَ آدَمَ تَفَرَّغْ لِعِبَادَتِي أَمْلأْ صَدْرَكَ غِنًى وَأَسُدَّ فَقْرَكَ وَإِلاَّ تَفْعَلْ مَلأْتُ يَدَيْكَ شُغْلاً وَلَمْ أَسُدَّ فَقْرَكَ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَأَبُو خَالِدٍ الْوَالِبِيُّ اسْمُهُ هُرْمُزُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2467,
			"arabicnumber": 2467,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدَنَا شَطْرٌ مِنْ شَعِيرٍ فَأَكَلْنَا مِنْهُ مَا شَاءَ اللَّهُ ثُمَّ قُلْتُ لِلْجَارِيَةِ كِيلِيهِ فَكَالَتْهُ فَلَمْ يَلْبَثْ أَنْ فَنِيَ ‏.‏ قَالَتْ فَلَوْ كُنَّا تَرَكْنَاهُ لأَكَلْنَا مِنْهُ أَكْثَرَ مِنْ ذَلِكَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَمَعْنَى قَوْلِهَا شَطْرٌ تَعْنِي شَيْئًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ عَزْرَةَ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ لَنَا قِرَامُ سِتْرٍ فِيهِ تَمَاثِيلُ عَلَى بَابِي فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ انْزِعِيهِ فَإِنَّهُ يُذَكِّرُنِي الدُّنْيَا ‏\"‏ ‏.‏ قَالَتْ وَكَانَ لَنَا سَمَلُ قَطِيفَةٍ عَلَمُهَا مِنْ حَرِيرٍ كُنَّا نَلْبَسُهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2469,
			"arabicnumber": 2469,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَتْ وِسَادَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي يَضْطَجِعُ عَلَيْهَا مِنْ أَدَمٍ حَشْوُهَا لِيفٌ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2470,
			"arabicnumber": 2470,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي مَيْسَرَةَ، عَنْ عَائِشَةَ، أَنَّهُمْ ذَبَحُوا شَاةً فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا بَقِيَ مِنْهَا ‏\"‏ ‏.‏ قَالَتْ مَا بَقِيَ مِنْهَا إِلاَّ كَتِفُهَا ‏.‏ قَالَ ‏\"‏ بَقِيَ كُلُّهَا غَيْرَ كَتِفِهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَأَبُو مَيْسَرَةَ هُوَ الْهَمْدَانِيُّ اسْمُهُ عَمْرُو بْنُ شُرَحْبِيلَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2471,
			"arabicnumber": 2471,
			"text": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِنْ كُنَّا آلَ مُحَمَّدٍ نَمْكُثُ شَهْرًا مَا نَسْتَوْقِدُ بِنَارٍ إِنْ هُوَ إِلاَّ الْمَاءُ وَالتَّمْرُ ‏.‏ قَالَ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2472,
			"arabicnumber": 2472,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا رَوْحُ بْنُ أَسْلَمَ أَبُو حَاتِمٍ الْبَصْرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَقَدْ أُخِفْتُ فِي اللَّهِ وَمَا يُخَافُ أَحَدٌ وَلَقَدْ أُوذِيتُ فِي اللَّهِ وَمَا يُؤْذَى أَحَدٌ وَلَقَدْ أَتَتْ عَلَىَّ ثَلاَثُونَ مِنْ بَيْنِ يَوْمٍ وَلَيْلَةٍ وَمَا لِي وَلِبِلاَلٍ طَعَامٌ يَأْكُلُهُ ذُو كَبِدٍ إِلاَّ شَيْءٌ يُوَارِيهِ إِبْطُ بِلاَلٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ - وَمَعْنَى هَذَا الْحَدِيثِ حِينَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فَارًّا مِنْ مَكَّةَ وَمَعَهُ بِلاَلٌ إِنَّمَا كَانَ مَعَ بِلاَلٍ مِنَ الطَّعَامِ مَا يَحْمِلُهُ تَحْتَ إِبْطِهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2473,
			"arabicnumber": 2473,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنَا يَزِيدُ بْنُ زِيَادٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ، حَدَّثَنِي مَنْ، سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ خَرَجْتُ فِي يَوْمٍ شَاتٍ مِنْ بَيْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ أَخَذْتُ إِهَابًا مَعْطُونًا فَحَوَّلْتُ وَسَطَهُ فَأَدْخَلْتُهُ عُنُقِي وَشَدَدْتُ وَسَطِي فَحَزَمْتُهُ بِخُوصِ النَّخْلِ وَإِنِّي لَشَدِيدُ الْجُوعِ وَلَوْ كَانَ فِي بَيْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم طَعَامٌ لَطَعِمْتُ مِنْهُ فَخَرَجْتُ أَلْتَمِسُ شَيْئًا فَمَرَرْتُ بِيَهُودِيٍّ فِي مَالٍ لَهُ وَهُوَ يَسْقِي بِبَكَرَةٍ لَهُ فَاطَّلَعْتُ عَلَيْهِ مِنْ ثُلْمَةٍ فِي الْحَائِطِ فَقَالَ مَا لَكَ يَا أَعْرَابِيُّ هَلْ لَكَ فِي كُلِّ دَلْوٍ بِتَمْرَةٍ قُلْتُ نَعَمْ فَافْتَحِ الْبَابَ حَتَّى أَدْخُلَ فَفَتَحَ فَدَخَلْتُ فَأَعْطَانِي دَلْوَهُ فَكُلَّمَا نَزَعْتُ دَلْوًا أَعْطَانِي تَمْرَةً حَتَّى إِذَا امْتَلأَتْ كَفِّي أَرْسَلْتُ دَلْوَهُ وَقُلْتُ حَسْبِي فَأَكَلْتُهَا ثُمَّ جَرَعْتُ مِنَ الْمَاءِ فَشَرِبْتُ ثُمَّ جِئْتُ الْمَسْجِدَ فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِيهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2474,
			"arabicnumber": 2474,
			"text": "حَدَّثَنَا أَبُو حَفْصٍ، عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ أَصَابَهُمْ جُوعٌ فَأَعْطَاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم تَمْرَةً تَمْرَةً ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2475,
			"arabicnumber": 2475,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ ثَلاَثُمِائَةٍ نَحْمِلُ زَادَنَا عَلَى رِقَابِنَا فَفَنِيَ زَادُنَا حَتَّى إِنْ كَانَ يَكُونُ لِلرَّجُلِ مِنَّا كُلَّ يَوْمٍ تَمْرَةٌ ‏.‏ فَقِيلَ لَهُ يَا أَبَا عَبْدِ اللَّهِ وَأَيْنَ كَانَتْ تَقَعُ التَّمْرَةُ مِنَ الرَّجُلِ فَقَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَقَدْنَاهَا وَأَتَيْنَا الْبَحْرَ فَإِذَا نَحْنُ بِحُوتٍ قَدْ قَذَفَهُ الْبَحْرُ فَأَكَلْنَا مِنْهُ ثَمَانِيَةَ عَشَرَ يَوْمًا مَا أَحْبَبْنَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ‏.‏ وَرَوَاهُ مَالِكُ بْنُ أَنَسٍ عَنْ وَهْبِ بْنِ كَيْسَانَ أَتَمَّ مِنْ هَذَا وَأَطْوَلَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2476,
			"arabicnumber": 2476,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي يَزِيدُ بْنُ زِيَادٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ، حَدَّثَنِي مَنْ، سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ إِنَّا لَجُلُوسٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ إِذْ طَلَعَ عَلَيْنَا مُصْعَبُ بْنُ عُمَيْرٍ مَا عَلَيْهِ إِلاَّ بُرْدَةٌ لَهُ مَرْقُوعَةٌ بِفَرْوٍ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بَكَى لِلَّذِي كَانَ فِيهِ مِنَ النِّعْمَةِ وَالَّذِي هُوَ الْيَوْمَ فِيهِ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَيْفَ بِكُمْ إِذَا غَدَا أَحَدُكُمْ فِي حُلَّةٍ وَرَاحَ فِي حُلَّةٍ وَوُضِعَتْ بَيْنَ يَدَيْهِ صَحْفَةٌ وَرُفِعَتْ أُخْرَى وَسَتَرْتُمْ بُيُوتَكُمْ كَمَا تُسْتَرُ الْكَعْبَةُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ نَحْنُ يَوْمَئِذٍ خَيْرٌ مِنَّا الْيَوْمَ نَتَفَرَّغُ لِلْعِبَادَةِ وَنُكْفَى الْمُؤْنَةَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لأَنْتُمُ الْيَوْمَ خَيْرٌ مِنْكُمْ يَوْمَئِذٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَيَزِيدُ بْنُ زِيَادٍ هُوَ ابْنُ مَيْسَرَةَ وَهُوَ مَدَنِيٌّ وَقَدْ رَوَى عَنْهُ مَالِكُ بْنُ أَنَسٍ وَغَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ وَيَزِيدُ بْنُ زِيَادٍ الدِّمَشْقِيُّ الَّذِي رَوَى عَنِ الزُّهْرِيِّ رَوَى عَنْهُ وَكِيعٌ وَمَرْوَانُ بْنُ مُعَاوِيَةَ وَيَزِيدُ بْنُ أَبِي زِيَادٍ كُوفِيٌّ رَوَى عَنْهُ سُفْيَانُ وَشُعْبَةُ وَابْنُ عُيَيْنَةَ وَغَيْرُ وَاحِدٍ مِنَ الأَئِمَّةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، حَدَّثَنِي عُمَرُ بْنُ ذَرٍّ، حَدَّثَنَا مُجَاهِدٌ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ أَهْلُ الصُّفَّةِ أَضْيَافَ أَهْلِ الإِسْلاَمِ لاَ يَأْوُونَ عَلَى أَهْلٍ وَلاَ مَالٍ وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ إِنْ كُنْتُ لأَعْتَمِدُ بِكَبِدِي عَلَى الأَرْضِ مِنَ الْجُوعِ وَأَشُدُّ الْحَجَرَ عَلَى بَطْنِي مِنَ الْجُوعِ وَلَقَدْ قَعَدْتُ يَوْمًا عَلَى طَرِيقِهِمُ الَّذِي يَخْرُجُونَ فِيهِ فَمَرَّ بِي أَبُو بَكْرٍ فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ مَا سَأَلْتُهُ إِلاَّ لِيَسْتَتْبِعَنِي فَمَرَّ وَلَمْ يَفْعَلْ ثُمَّ مَرَّ بِي عُمَرُ فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ مَا أَسْأَلُهُ إِلاَّ لِيَسْتَتْبِعَنِي فَمَرَّ وَلَمْ يَفْعَلْ ثُمَّ مَرَّ بِي أَبُو الْقَاسِمِ صلى الله عليه وسلم فَتَبَسَّمَ حِينَ رَآنِي وَقَالَ ‏\"‏ أَبَا هُرَيْرَةَ ‏\"‏ ‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ الْحَقْ ‏\"‏ ‏.‏ وَمَضَى فَاتَّبَعْتُهُ وَدَخَلَ مَنْزِلَهُ فَاسْتَأْذَنْتُ فَأَذِنَ لِي فَوَجَدَ قَدَحًا مِنْ لَبَنٍ فَقَالَ ‏\"‏ مِنْ أَيْنَ هَذَا اللَّبَنُ لَكُمْ ‏\"‏ ‏.‏ قِيلَ أَهْدَاهُ لَنَا فُلاَنٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَبَا هُرَيْرَةَ ‏\"‏ ‏.‏ قُلْتُ لَبَّيْكَ ‏.‏ فَقَالَ ‏\"‏ الْحَقْ إِلَى أَهْلِ الصُّفَّةِ فَادْعُهُمْ ‏\"‏ ‏.‏ وَهُمْ أَضْيَافُ أَهْلِ الإِسْلاَمِ لاَ يَأْوُونَ عَلَى أَهْلٍ وَلاَ مَالٍ إِذَا أَتَتْهُ صَدَقَةٌ بَعَثَ بِهَا إِلَيْهِمْ وَلَمْ يَتَنَاوَلْ مِنْهَا شَيْئًا وَإِذَا أَتَتْهُ هَدِيَّةٌ أَرْسَلَ إِلَيْهِمْ فَأَصَابَ مِنْهَا وَأَشْرَكَهُمْ فِيهَا فَسَاءَنِي ذَلِكَ وَقُلْتُ مَا هَذَا الْقَدَحُ بَيْنَ أَهْلِ الصُّفَّةِ وَأَنَا رَسُولُهُ إِلَيْهِمْ فَسَيَأْمُرُنِي أَنْ أُدِيرَهُ عَلَيْهِمْ فَمَا عَسَى أَنْ يُصِيبَنِي مِنْهُ وَقَدْ كُنْتُ أَرْجُو أَنْ أُصِيبَ مِنْهُ مَا يُغْنِينِي وَلَمْ يَكُنْ بُدٌّ مِنْ طَاعَةِ اللَّهِ وَطَاعَةِ رَسُولِهِ فَأَتَيْتُهُمْ فَدَعَوْتُهُمْ فَلَمَّا دَخَلُوا عَلَيْهِ فَأَخَذُوا مَجَالِسَهُمْ فَقَالَ ‏\"‏ أَبَا هُرَيْرَةَ خُذِ الْقَدَحَ وَأَعْطِهِمْ ‏\"‏ ‏.‏ فَأَخَذْتُ الْقَدَحَ فَجَعَلْتُ أُنَاوِلُهُ الرَّجُلَ فَيَشْرَبُ حَتَّى يُرْوَى ثُمَّ يَرُدُّهُ فَأُنَاوِلُهُ الآخَرَ حَتَّى انْتَهَيْتُ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ رَوِيَ الْقَوْمُ كُلُّهُمْ فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْقَدَحَ فَوَضَعَهُ عَلَى يَدَيْهِ ثُمَّ رَفَعَ رَأْسَهُ فَتَبَسَّمَ فَقَالَ ‏\"‏ أَبَا هُرَيْرَةَ اشْرَبْ ‏\"‏ ‏.‏ فَشَرِبْتُ ثُمَّ قَالَ ‏\"‏ اشْرَبْ ‏\"‏ ‏.‏ فَلَمْ أَزَلْ أَشْرَبُ وَيَقُولُ ‏\"‏ اشْرَبْ ‏\"‏ ‏.‏ حَتَّى قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَجِدُ لَهُ مَسْلَكًا فَأَخَذَ الْقَدَحَ فَحَمِدَ اللَّهَ وَسَمَّى ثُمَّ شَرِبَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2478,
			"arabicnumber": 2478,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْقُرَشِيُّ، حَدَّثَنَا يَحْيَى الْبَكَّاءُ، عَنِ ابْنِ عُمَرَ، قَالَ تَجَشَّأَ رَجُلٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ كُفَّ عَنَّا جُشَاءَكَ فَإِنَّ أَكْثَرَهُمْ شِبَعًا فِي الدُّنْيَا أَطْوَلُهُمْ جُوعًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي جُحَيْفَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2479,
			"arabicnumber": 2479,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، قَالَ يَا بُنَىَّ لَوْ رَأَيْتَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَصَابَتْنَا السَّمَاءُ لَحَسِبْتَ أَنَّ رِيحَنَا رِيحُ الضَّأْنِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَمَعْنَى هَذَا الْحَدِيثِ أَنَّهُ كَانَ ثِيَابَهُمُ الصُّوفُ فَكَانَ إِذَا أَصَابَهُمُ الْمَطَرُ يَجِيءُ مِنْ ثِيَابِهِمْ رِيحُ الضَّأْنِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2480,
			"arabicnumber": 2480,
			"text": "حَدَّثَنَا الْجَارُودُ بْنُ مُعَاذٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ أَبِي حَمْزَةَ، عَنْ إِبْرَاهِيمَ النَّخَعِيِّ، قَالَ الْبِنَاءُ كُلُّهُ وَبَالٌ قُلْتُ أَرَأَيْتَ مَا لاَ بُدَّ مِنْهُ قَالَ لاَ أَجْرَ وَلاَ وِزْرَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2481,
			"arabicnumber": 2481,
			"text": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ أَبِي مَرْحُومٍ عَبْدِ الرَّحِيمِ بْنِ مَيْمُونٍ، عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَرَكَ اللِّبَاسِ تَوَاضُعًا لِلَّهِ وَهُوَ يَقْدِرُ عَلَيْهِ دَعَاهُ اللَّهُ يَوْمَ الْقِيَامَةِ عَلَى رُءُوسِ الْخَلاَئِقِ حَتَّى يُخَيِّرَهُ مِنْ أَىِّ حُلَلِ الإِيمَانِ شَاءَ يَلْبَسُهَا ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَمَعْنَى قَوْلِهِ ‏\"‏ حُلَلِ الإِيمَانِ ‏\"‏ ‏.‏ يَعْنِي مَا يُعْطَى أَهْلُ الإِيمَانِ مِنْ حُلَلِ الْجَنَّةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2482,
			"arabicnumber": 2482,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، حَدَّثَنَا زَافِرُ بْنُ سُلَيْمَانَ، عَنْ إِسْرَائِيلَ، عَنْ شَبِيبِ بْنِ بَشِيرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ النَّفَقَةُ كُلُّهَا فِي سَبِيلِ اللَّهِ إِلاَّ الْبِنَاءَ فَلاَ خَيْرَ فِيهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ هَكَذَا قَالَ مُحَمَّدُ بْنُ حُمَيْدٍ شَبِيبُ بْنُ بَشِيرٍ وَإِنَّمَا هُوَ شَبِيبُ بْنُ بِشْرٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2483,
			"arabicnumber": 2483,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ، قَالَ أَتَيْنَا خَبَّابًا نَعُودُهُ وَقَدِ اكْتَوَى سَبْعَ كَيَّاتٍ فَقَالَ لَقَدْ تَطَاوَلَ مَرَضِي وَلَوْلاَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تَمَنَّوُا الْمَوْتَ ‏\"‏ ‏.‏ لَتَمَنَّيْتُ وَقَالَ ‏\"‏ يُؤْجَرُ الرَّجُلُ فِي نَفَقَتِهِ كُلِّهَا إِلاَّ التُّرَابَ أَوْ قَالَ فِي الْبِنَاءِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2484,
			"arabicnumber": 2484,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا خَالِدُ بْنُ طَهْمَانَ أَبُو الْعَلاَءِ، حَدَّثَنَا حُصَيْنٌ، قَالَ جَاءَ سَائِلٌ فَسَأَلَ ابْنَ عَبَّاسٍ فَقَالَ ابْنُ عَبَّاسٍ لِلسَّائِلِ أَتَشْهَدُ أَنْ لاَ، إِلَهَ إِلاَّ اللَّهُ قَالَ نَعَمْ ‏.‏ قَالَ أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ قَالَ نَعَمْ ‏.‏ قَالَ وَتَصُومُ رَمَضَانَ قَالَ نَعَمْ ‏.‏ قَالَ سَأَلْتَ وَلِلسَّائِلِ حَقٌّ إِنَّهُ لَحَقٌّ عَلَيْنَا أَنْ نَصِلَكَ ‏.‏ فَأَعْطَاهُ ثَوْبًا ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنْ مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا إِلاَّ كَانَ فِي حِفْظِ اللَّهِ مَا دَامَ مِنْهُ عَلَيْهِ خِرْقَةٌ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2485,
			"arabicnumber": 2485,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، وَابْنُ أَبِي عَدِيٍّ، وَيَحْيَى بْنُ سَعِيدٍ، عَنْ عَوْفِ بْنِ أَبِي جَمِيلَةَ الأَعْرَابِيِّ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عَبْدِ اللَّهِ بْنِ سَلاَمٍ، قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ انْجَفَلَ النَّاسُ إِلَيْهِ وَقِيلَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجِئْتُ فِي النَّاسِ لأَنْظُرَ إِلَيْهِ فَلَمَّا اسْتَبَنْتُ وَجْهَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَرَفْتُ أَنَّ وَجْهَهُ لَيْسَ بِوَجْهِ كَذَّابٍ وَكَانَ أَوَّلَ شَيْءٍ تَكَلَّمَ بِهِ أَنْ قَالَ ‏ \"‏ أَيُّهَا النَّاسُ أَفْشُوا السَّلاَمَ وَأَطْعِمُوا الطَّعَامَ وَصَلُّوا وَالنَّاسُ نِيَامٌ تَدْخُلُونَ الْجَنَّةَ بِسَلاَمٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2486,
			"arabicnumber": 2486,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ الْمَدَنِيُّ الْغِفَارِيُّ، حَدَّثَنِي أَبِي، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الطَّاعِمُ الشَّاكِرُ بِمَنْزِلَةِ الصَّائِمِ الصَّابِرِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2487,
			"arabicnumber": 2487,
			"text": "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ، بِمَكَّةَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ أَتَاهُ الْمُهَاجِرُونَ فَقَالُوا يَا رَسُولَ اللَّهِ مَا رَأَيْنَا قَوْمًا أَبْذَلَ مِنْ كَثِيرٍ وَلاَ أَحْسَنَ مُوَاسَاةً مِنْ قَلِيلٍ مِنْ قَوْمٍ نَزَلْنَا بَيْنَ أَظْهُرِهِمْ لَقَدْ كَفَوْنَا الْمُؤْنَةَ وَأَشْرَكُونَا فِي الْمَهْنَإِ حَتَّى خِفْنَا أَنْ يَذْهَبُوا بِالأَجْرِ كُلِّهِ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ مَا دَعَوْتُمُ اللَّهَ لَهُمْ وَأَثْنَيْتُمْ عَلَيْهِمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2488,
			"arabicnumber": 2488,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو الأَوْدِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلاَ أُخْبِرُكُمْ بِمَنْ يَحْرُمُ عَلَى النَّارِ أَوْ بِمَنْ تَحْرُمُ عَلَيْهِ النَّارُ عَلَى كُلِّ قَرِيبٍ هَيِّنٍ لَيِّنٍ سَهْلٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2489,
			"arabicnumber": 2489,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، قَالَ قُلْتُ لِعَائِشَةَ أَىُّ شَيْءٍ كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ إِذَا دَخَلَ بَيْتَهُ قَالَتْ كَانَ يَكُونُ فِي مِهْنَةِ أَهْلِهِ فَإِذَا حَضَرَتِ الصَّلاَةُ قَامَ فَصَلَّى ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2490,
			"arabicnumber": 2490,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عِمْرَانَ بْنِ زَيْدٍ التَّغْلِبِيِّ، عَنْ زَيْدٍ الْعَمِّيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا اسْتَقْبَلَهُ الرَّجُلُ فَصَافَحَهُ لاَ يَنْزِعُ يَدَهُ مِنْ يَدِهِ حَتَّى يَكُونَ الرَّجُلُ الَّذِي يَنْزِعُ وَلاَ يَصْرِفُ وَجْهَهُ عَنْ وَجْهِهِ حَتَّى يَكُونَ الرَّجُلُ هُوَ الَّذِي يَصْرِفُهُ وَلَمْ يُرَ مُقَدِّمًا رُكْبَتَيْهِ بَيْنَ يَدَىْ جَلِيسٍ لَهُ ‏.‏ قَالَ هَذَا حَدِيثٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2491,
			"arabicnumber": 2491,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ خَرَجَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ فِي حُلَّةٍ لَهُ يَخْتَالُ فِيهَا فَأَمَرَ اللَّهُ الأَرْضَ فَأَخَذَتْهُ فَهُوَ يَتَجَلْجَلُ فِيهَا أَوْ قَالَ يَتَلَجْلَجُ فِيهَا إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2492,
			"arabicnumber": 2492,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُحْشَرُ الْمُتَكَبِّرُونَ يَوْمَ الْقِيَامَةِ أَمْثَالَ الذَّرِّ فِي صُوَرِ الرِّجَالِ يَغْشَاهُمُ الذُّلُّ مِنْ كُلِّ مَكَانٍ فَيُسَاقُونَ إِلَى سِجْنٍ فِي جَهَنَّمَ يُسَمَّى بُولَسَ تَعْلُوهُمْ نَارُ الأَنْيَارِ يُسْقَوْنَ مِنْ عُصَارَةِ أَهْلِ النَّارِ طِينَةِ الْخَبَالِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2493,
			"arabicnumber": 2493,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، وَعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، حَدَّثَنِي أَبُو مَرْحُومٍ عَبْدُ الرَّحِيمِ بْنُ مَيْمُونٍ، عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَظَمَ غَيْظًا وَهُوَ يَقْدِرُ عَلَى أَنْ يُنَفِّذَهُ دَعَاهُ اللَّهُ عَلَى رُءُوسِ الْخَلاَئِقِ يَوْمَ الْقِيَامَةِ حَتَّى يُخَيِّرَهُ فِي أَىِّ الْحُورِ شَاءَ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ الْغِفَارِيُّ الْمَدَنِيُّ، حَدَّثَنِي أَبِي، عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ثَلاَثٌ مَنْ كُنَّ فِيهِ نَشَرَ اللَّهُ عَلَيْهِ كَنَفَهُ وَأَدْخَلَهُ جَنَّتَهُ رِفْقٌ بِالضَّعِيفِ وَشَفَقَةٌ عَلَى الْوَالِدَيْنِ وَإِحْسَانٌ إِلَى الْمَمْلُوكِ ‏\"‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَأَبُو بَكْرِ بْنُ الْمُنْكَدِرِ هُوَ أَخُو مُحَمَّدِ بْنِ الْمُنْكَدِرِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2495,
			"arabicnumber": 2495,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ لَيْثٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَقُولُ اللَّهُ تَعَالَى يَا عِبَادِي كُلُّكُمْ ضَالٌّ إِلاَّ مَنْ هَدَيْتُهُ فَسَلُونِي الْهُدَى أَهْدِكُمْ وَكُلُّكُمْ فَقِيرٌ إِلاَّ مَنْ أَغْنَيْتُ فَسَلُونِي أَرْزُقْكُمْ وَكُلُّكُمْ مُذْنِبٌ إِلاَّ مَنْ عَافَيْتُ فَمَنْ عَلِمَ مِنْكُمْ أَنِّي ذُو قُدْرَةٍ عَلَى الْمَغْفِرَةِ فَاسْتَغْفَرَنِي غَفَرْتُ لَهُ وَلاَ أُبَالِي وَلَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمُ اجْتَمَعُوا عَلَى أَتْقَى قَلْبِ عَبْدٍ مِنْ عِبَادِي مَا زَادَ ذَلِكَ فِي مُلْكِي جَنَاحَ بَعُوضَةٍ وَلَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمُ اجْتَمَعُوا عَلَى أَشْقَى قَلْبِ عَبْدٍ مِنْ عِبَادِي مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي جَنَاحَ بَعُوضَةٍ وَلَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمُ اجْتَمَعُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلَ كُلُّ إِنْسَانٍ مِنْكُمْ مَا بَلَغَتْ أُمْنِيَّتُهُ فَأَعْطَيْتُ كُلَّ سَائِلٍ مِنْكُمْ مَا سَأَلَ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي إِلاَّ كَمَا لَوْ أَنَّ أَحَدَكُمْ مَرَّ بِالْبَحْرِ فَغَمَسَ فِيهِ إِبْرَةً ثُمَّ رَفَعَهَا إِلَيْهِ ذَلِكَ بِأَنِّي جَوَادٌ مَاجِدٌ أَفْعَلُ مَا أُرِيدُ عَطَائِي كَلاَمٌ وَعَذَابِي كَلاَمٌ إِنَّمَا أَمْرِي لِشَيْءٍ إِذَا أَرَدْتُهُ أَنْ أَقُولَ لَهُ كُنْ فَيَكُونُ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ مَعْدِيكَرِبَ عَنْ أَبِي ذَرٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2496,
			"arabicnumber": 2496,
			"text": "حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الرَّازِيِّ، عَنْ سَعْدٍ، مَوْلَى طَلْحَةَ عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يُحَدِّثُ حَدِيثًا لَوْ لَمْ أَسْمَعْهُ إِلاَّ مَرَّةً أَوْ مَرَّتَيْنِ حَتَّى عَدَّ سَبْعَ مَرَّاتٍ وَلَكِنِّي سَمِعْتُهُ أَكْثَرَ مِنْ ذَلِكَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ كَانَ الْكِفْلُ مِنْ بَنِي إِسْرَائِيلَ لاَ يَتَوَرَّعُ مِنْ ذَنْبٍ عَمِلَهُ فَأَتَتْهُ امْرَأَةٌ فَأَعْطَاهَا سِتِّينَ دِينَارًا عَلَى أَنْ يَطَأَهَا فَلَمَّا قَعَدَ مِنْهَا مَقْعَدَ الرَّجُلِ مِنِ امْرَأَتِهِ أُرْعِدَتْ وَبَكَتْ فَقَالَ مَا يُبْكِيكِ أَأَكْرَهْتُكِ قَالَتْ لاَ وَلَكِنَّهُ عَمَلٌ مَا عَمِلْتُهُ قَطُّ وَمَا حَمَلَنِي عَلَيْهِ إِلاَّ الْحَاجَةُ فَقَالَ تَفْعَلِينَ أَنْتِ هَذَا وَمَا فَعَلْتِهِ اذْهَبِي فَهِيَ لَكِ ‏.‏ وَقَالَ لاَ وَاللَّهِ لاَ أَعْصِي اللَّهَ بَعْدَهَا أَبَدًا ‏.‏ فَمَاتَ مِنْ لَيْلَتِهِ فَأَصْبَحَ مَكْتُوبًا عَلَى بَابِهِ إِنَّ اللَّهَ قَدْ غَفَرَ لِلْكِفْلِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ قَدْ رَوَاهُ شَيْبَانُ وَغَيْرُ وَاحِدٍ عَنِ الأَعْمَشِ نَحْوَ هَذَا وَرَفَعُوهُ وَرَوَى بَعْضُهُمْ عَنِ الأَعْمَشِ فَلَمْ يَرْفَعْهُ ‏.‏ وَرَوَى أَبُو بَكْرِ بْنُ عَيَّاشٍ هَذَا الْحَدِيثَ عَنِ الأَعْمَشِ فَأَخْطَأَ فِيهِ وَقَالَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عُمَرَ وَهُوَ غَيْرُ مَحْفُوظٍ وَعَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ الرَّازِيُّ هُوَ كُوفِيٌّ وَكَانَتْ جَدَّتُهُ سُرِّيَّةً لِعَلِيِّ بْنِ أَبِي طَالِبٍ وَرَوَى عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الرَّازِيِّ عُبَيْدَةُ الضَّبِّيُّ وَالْحَجَّاجُ بْنُ أَرْطَاةَ وَغَيْرُ وَاحِدٍ مِنْ كِبَارِ أَهْلِ الْعِلْمِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2497,
			"arabicnumber": 2497,
			"text": "حَدَّثَنَا هَنَّادٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ، بِحَدِيثَيْنِ أَحَدُهُمَا عَنْ نَفْسِهِ، وَالآخَرُ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ عَبْدُ اللَّهِ إِنَّ الْمُؤْمِنَ يَرَى ذُنُوبَهُ كَأَنَّهُ فِي أَصْلِ جَبَلٍ يَخَافُ أَنْ يَقَعَ عَلَيْهِ وَإِنَّ الْفَاجِرَ يَرَى ذُنُوبَهُ كَذُبَابٍ وَقَعَ عَلَى أَنْفِهِ قَالَ بِهِ هَكَذَا فَطَارَ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2498,
			"arabicnumber": 2498,
			"text": "وَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَلَّهُ أَفْرَحُ بِتَوْبَةِ أَحَدِكُمْ مِنْ رَجُلٍ بِأَرْضٍ دَوِيَّةٍ مُهْلِكَةٍ مَعَهُ رَاحِلَتُه�� عَلَيْهَا زَادُهُ وَطَعَامُهُ وَشَرَابُهُ وَمَا يُصْلِحُهُ فَأَضَلَّهَا فَخَرَجَ فِي طَلَبِهَا حَتَّى إِذَا أَدْرَكَهُ الْمَوْتُ قَالَ أَرْجِعُ إِلَى مَكَانِي الَّذِي أَضْلَلْتُهَا فِيهِ فَأَمُوتُ فِيهِ فَرَجَعَ إِلَى مَكَانِهِ فَغَلَبَتْهُ عَيْنُهُ فَاسْتَيْقَظَ فَإِذَا رَاحِلَتُهُ عِنْدَ رَأْسِهِ عَلَيْهَا طَعَامُهُ وَشَرَابُهُ وَمَا يُصْلِحُهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِيهِ عَنْ أَبِي هُرَيْرَةَ وَالنُّعْمَانِ بْنِ بَشِيرٍ وَأَنَسِ بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2499,
			"arabicnumber": 2499,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، حَدَّثَنَا عَلِيُّ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ ابْنِ آدَمَ خَطَّاءٌ وَخَيْرُ الْخَطَّائِينَ التَّوَّابُونَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عَلِيِّ بْنِ مَسْعَدَةَ عَنْ قَتَادَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2500,
			"arabicnumber": 2500,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ عَائِشَةَ وَأَنَسٍ وَأَبِي شُرَيْحٍ الْعَدَوِيِّ الْكَعْبِيِّ الْخُزَاعِيِّ وَاسْمُهُ خُوَيْلِدُ بْنُ عَمْرٍو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2501,
			"arabicnumber": 2501,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ يَزِيدَ بْنِ عَمْرٍو الْمُعَافِرِيِّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ صَمَتَ نَجَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ ابْنِ لَهِيعَةَ ‏.‏ وَأَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ هُوَ عَبْدُ اللَّهِ بْنُ يَزِيدَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2502,
			"arabicnumber": 2502,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي حُذَيْفَةَ، وَكَانَ، مِنْ أَصْحَابِ ابْنِ مَسْعُودٍ عَنْ عَائِشَةَ، قَالَتْ حَكَيْتُ لِلنَّبِيِّ صلى الله عليه وسلم رَجُلاً فَقَالَ ‏\"‏ مَا يَسُرُّنِي أَنِّي حَكَيْتُ رَجُلاً وَأَنَّ لِي كَذَا وَكَذَا ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ صَفِيَّةَ امْرَأَةٌ وَقَالَتْ بِيَدِهَا هَكَذَا كَأَنَّهَا تَعْنِي قَصِيرَةً ‏.‏ فَقَالَ ‏\"‏ لَقَدْ مَزَجْتِ بِكَلِمَةٍ لَوْ مَزَجْتِ بِهَا مَاءَ الْبَحْرِ لَمُزِجَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": 2503,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي حُذَيْفَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا أُحِبُّ أَنِّي حَكَيْتُ أَحَدًا وَأَنَّ لِي كَذَا وَكَذَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو حُذَيْفَةَ هُوَ كُوفِيٌّ مِنْ أَصْحَابِ ابْنِ مَسْعُودٍ وَيُقَالُ اسْمُهُ سَلَمَةُ بْنُ صُهَيْبَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": 2504,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا بُرَيْدُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَىُّ الْمُسْلِمِينَ أَفْضَلُ قَالَ ‏ \"‏ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَبِي مُوسَى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2505,
			"arabicnumber": 2505,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ بْنِ أَبِي يَزِيدَ الْهَمْدَانِيُّ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ عَيَّرَ أَخَاهُ بِذَنْبٍ لَمْ يَمُتْ حَتَّى يَعْمَلَهُ ‏\"‏ ‏.‏ قَالَ أَحْمَدُ مِنْ ذَنْبٍ قَدْ تَابَ مِنْهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ ‏.‏ وَخَالِدُ بْنُ مَعْدَانَ لَمْ يُدْرِكْ مُعَاذَ بْنَ جَبَلٍ وَرُوِيَ عَنْ خَالِدِ بْنِ مَعْدَانَ أَنَّهُ أَدْرَكَ سَبْعِينَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَمَاتَ مُعَاذُ بْنُ جَبَلٍ فِي خِلاَفَةِ عُمَرَ بْنِ الْخَطَّابِ وَخَالِدُ بْنُ مَعْدَانَ رَوَى عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ مُعَاذٍ عَنْ مُعَاذٍ غَيْرَ حَدِيثٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": 2506,
			"text": "حَدَّثَنَا عُمَرُ بْنُ إِسْمَاعِيلَ بْنِ مُجَالِدِ بْنِ سَعِيدٍ الْهَمْدَانِيُّ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ح قَالَ وَأَخْبَرَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا أُمَيَّةُ بْنُ الْقَاسِمِ الْحَذَّاءُ الْبَصْرِيُّ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ بُرْدِ بْنِ سِنَانٍ، عَنْ مَكْحُولٍ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُظْهِرِ الشَّمَاتَةَ لأَخِيكَ فَيَرْحَمُهُ اللَّهُ وَيَبْتَلِيكَ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَمَكْحُولٌ قَدْ سَمِعَ مِنْ وَاثِلَةَ بْنِ الأَسْقَعِ وَأَنَسِ بْنِ مَالِكٍ وَأَبِي هِنْدٍ الدَّارِيِّ وَيُقَالُ إِنَّهُ لَمْ يَسْمَعْ مِنْ أَحَدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ مِنْ هَؤُلاَءِ الثَّلاَثَةِ ‏.‏ وَمَكْحُولٌ شَامِيٌّ يُكْنَى أَبَا عَبْدِ اللَّهِ وَكَانَ عَبْدًا فَأُعْتِقَ وَمَكْحُولٌ الأَزْدِيُّ بَصْرِيٌّ سَمِعَ مِنْ عَبْدِ اللَّهِ بْنِ عُمَرَ يَرْوِي عَنْهُ عُمَارَةُ بْنُ زَاذَانَ ‏.‏ حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ تَمِيمِ بْنِ عَطِيَّةَ، قَالَ كَثِيرًا مَا كُنْتُ أَسْمَعُ مَكْحُولاً يُسْأَلُ فَيَقُولُ نَدَانَمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "حَدَّثَنَا أَبُو مُوسَى، مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ الأَعْمَشِ، عَنْ يَحْيَى بْنِ وَثَّابٍ، عَنْ شَيْخٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏الْمُسْلِمَ إِذَا كَانَ يُخَالِطَ النَّاسَ وَيَصْبِرُ عَلَى أَذَاهُمْ خَيْرٌ مِنَ الْمُسْلِمِ الَّذِي لاَ يُخَالِطُ النَّاسَ وَلاَ يَصْبِرُ عَلَى أَذَاهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو مُوسَى قَالَ ابْنُ أَبِي عَدِيٍّ كَانَ شُعْبَةُ يَرَى أَنَّهُ ابْنُ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2508,
			"arabicnumber": 2508,
			"text": "حَدَّثَنَا أَبُو يَحْيَى، مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ الْبَغْدَادِيُّ حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَخْرَمِيُّ، هُوَ مِنْ وَلَدِ الْمِسْوَرِ بْنِ مَخْرَمَةَ عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ الأَخْنَسِيِّ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَسُوءَ ذَاتِ الْبَيْنِ فَإِنَّهَا الْحَالِقَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَمَعْنَى قَوْلِهِ ‏\"‏ وَسُوءَ ذَاتِ الْبَيْنِ ‏\"‏ ‏.‏ إِنَّمَا يَعْنِي الْعَدَاوَةَ وَالْبَغْضَاءَ وَقَوْلُهُ ‏\"‏ الْحَالِقَةُ ‏\"‏ ‏.‏ يَقُولُ إِنَّهَا تَحْلِقُ الدِّينَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2509,
			"arabicnumber": 2509,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ أُخْبِرُكُمْ بِأَفْضَلَ مِنْ دَرَجَةِ الصِّيَامِ وَالصَّلاَةِ وَالصَّدَقَةِ ‏\"‏ ‏.‏ قَالُوا بَلَى ‏.‏ قَالَ ‏\"‏ صَلاَحُ ذَاتِ الْبَيْنِ فَإِنَّ فَسَادَ ذَاتِ الْبَيْنِ هِيَ الْحَالِقَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَيُرْوَى عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ هِيَ الْحَالِقَةُ لاَ أَقُولُ تَحْلِقُ الشَّعْرَ وَلَكِنْ تَحْلِقُ الدِّينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2510,
			"arabicnumber": 2510,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ حَرْبِ بْنِ شَدَّادٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ يَعِيشَ بْنِ الْوَلِيدِ، أَنَّ مَوْلَى الزُّبَيْرِ، حَدَّثَهُ أَنَّ الزُّبَيْرَ بْنَ الْعَوَّامِ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ دَبَّ إِلَيْكُمْ دَاءُ الأُمَمِ قَبْلَكُمُ الْحَسَدُ وَالْبَغْضَاءُ هِيَ الْحَالِقَةُ لاَ أَقُولُ تَحْلِقُ الشَّعْرَ وَلَكِنْ تَحْلِقُ الدِّينَ وَالَّذِي نَفْسِي بِيَدِهِ لاَ تَدْخُلُوا الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلاَ تُؤْمِنُوا حَتَّى تَحَابُّوا أَفَلاَ أُنَبِّئُكُمْ بِمَا يُثَبِّتُ ذَاكُمْ لَكُمْ أَفْشُوا السَّلاَمَ بَيْنَكُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ قَدِ اخْتَلَفُوا فِي رِوَايَتِهِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ فَرَوَى بَعْضُهُمْ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ يَعِيشَ بْنِ الْوَلِيدِ عَنْ مَوْلَى الزُّبَيْرِ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرُوا فِيهِ عَنِ الزُّبَيْرِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2511,
			"arabicnumber": 2511,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ ذَنْبٍ أَجْدَرُ أَنْ يُعَجِّلَ اللَّهُ لِصَاحِبِهِ الْعُقُوبَةَ فِي الدُّنْيَا مَعَ مَا يَدَّخِرُ لَهُ فِي الآخِرَةِ مِنَ الْبَغْىِ وَقَطِيعَةِ الرَّحِمِ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2512,
			"arabicnumber": 2512,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنِ الْمُثَنَّى بْنِ الصَّبَّاحِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ خَصْلَتَانِ مَنْ كَانَتَا فِيهِ كَتَبَهُ اللَّهُ شَاكِرًا صَابِرًا وَمَنْ لَمْ تَكُونَا فِيهِ لَمْ يَكْتُبْهُ اللَّهُ شَاكِرًا وَلاَ صَابِرًا مَنْ نَظَرَ فِي دِينِهِ إِلَى مَنْ هُوَ فَوْقَهُ فَاقْتَدَى بِهِ وَنَظَرَ فِي دُنْيَاهُ إِلَى مَنْ هُوَ دُونَهُ فَحَمِدَ اللَّهَ عَلَى مَا فَضَّلَهُ بِهِ عَلَيْهِ كَتَبَهُ اللَّهُ شَاكِرًا صَابِرًا وَمَنْ نَظَرَ فِي دِينِهِ إِلَى مَنْ هُوَ دُونَهُ وَنَظَرَ فِي دُنْيَاهُ إِلَى مَنْ هُوَ فَوْقَهُ فَأَسِفَ عَلَى مَا فَاتَهُ مِنْهُ لَمْ يَكْتُبْهُ اللَّهُ شَاكِرًا وَلاَ صَابِرًا ‏\"‏ ‏.‏ أَخْبَرَنَا مُوسَى بْنُ حِزَامٍ الرَّجُلُ الصَّالِحُ، حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا الْمُثَنَّى بْنُ الصَّبَّاحِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَلَمْ يَذْكُرْ سُوَيْدُ بْنُ نَصْرٍ فِي حَدِيثِهِ عَنْ أَبِيهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2513,
			"arabicnumber": 2513,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ انْظُرُوا إِلَى مَنْ هُوَ أَسْفَلَ مِنْكُمْ وَلاَ تَنْظُرُوا إِلَى مَنْ هُوَ فَوْقَكُمْ فَإِنَّهُ أَجْدَرُ أَنْ لاَ تَزْدَرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2514,
			"arabicnumber": 2514,
			"text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الْبَصْرِيُّ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، ح قَالَ وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْبَزَّازُ، حَدَّثَنَا سَيَّارٌ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ الْمَعْنَى، وَاحِدٌ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ حَنْظَلَةَ الأُسَيْدِيِّ، وَكَانَ، مِنْ كُتَّابِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ مَرَّ بِأَبِي بَكْرٍ وَهُوَ يَبْكِي فَقَالَ مَا لَكَ يَا حَنْظَلَةُ قَالَ نَافَقَ حَنْظَلَةُ يَا أَبَا بَكْرٍ نَكُونُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم يُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ كَأَنَّا رَأْىَ عَيْنٍ فَإِذَا رَجَعْنَا إِلَى الأَزْوَاجِ وَالضَّيْعَةِ نَسِينَا كَثِيرًا ‏.‏ قَالَ فَوَاللَّهِ إِنَّا لَكَذَلِكَ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَانْطَلَقْنَا فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا لَكَ يَا حَنْظَلَةُ ‏\"‏ ‏.‏ قَالَ نَافَقَ حَنْظَلَةُ يَا رَسُولَ اللَّهِ نَكُونُ عِنْدَكَ تُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ كَأَنَّا رَأْىَ عَيْنٍ فَإِذَا رَجَعْنَا عَافَسْنَا الأَزْوَاجَ وَالضَّيْعَةَ وَنَسِينَا كَثِيرًا ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ تَدُومُونَ عَلَى الْحَالِ الَّذِي تَقُومُونَ بِهَا مِنْ عِنْدِي لَصَافَحَتْكُمُ الْمَلاَئِكَةُ فِي مَجَالِسِكُمْ وَفِي طُرُقِكُمْ وَعَلَى فُرُشِكُمْ وَلَكِنْ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً وَسَاعَةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2515,
			"arabicnumber": 2515,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2516,
			"arabicnumber": 2516,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا لَيْثُ بْنُ سَعْدٍ، وَابْنُ، لَهِيعَةَ عَنْ قَيْسِ بْنِ الْحَجَّاجِ، قَالَ وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ، حَدَّثَنِي قَيْسُ بْنُ الْحَجَّاجِ الْمَعْنَى، وَاحِدٌ، عَنْ حَنَشٍ الصَّنْعَانِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُنْتُ خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمًا فَقَالَ ‏ \"‏ يَا غُلاَمُ إِنِّي أُعَلِّمُكَ كَلِمَاتٍ احْفَظِ اللَّهَ يَحْفَظْكَ احْفَظِ اللَّهَ تَجِدْهُ تُجَاهَكَ إِذَا سَأَلْتَ فَاسْأَلِ اللَّهَ وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ وَاعْلَمْ أَنَّ الأُمَّةَ لَوِ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إِلاَّ بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَكَ وَلَوِ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلاَّ بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْكَ رُفِعَتِ الأَقْلاَمُ وَجَفَّتِ الصُّحُفُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2517,
			"arabicnumber": 2517,
			"text": "حَدَّثَنَا أَبُو حَفْصٍ، عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ أَبِي قُرَّةَ السَّدُوسِيُّ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَعْقِلُهَا وَأَتَوَكَّلُ أَوْ أُطْلِقُهَا وَأَتَوَكَّلُ قَالَ ‏ \"‏ اعْقِلْهَا وَتَوَكَّلْ ‏\"‏ ‏.‏ قَالَ عَمْرُو بْنُ عَلِيٍّ قَالَ يَحْيَى وَهَذَا عِنْدِي حَدِيثٌ مُنْكَرٌ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أَنَسٍ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ عَنْ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوُ هَذَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2518,
			"arabicnumber": 2518,
			"text": "حَدَّثَنَا أَبُو مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، حَدَّثَنَا شُعْبَةُ، عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي الْحَوْرَاءِ السَّعْدِيِّ، قَالَ قُلْتُ لِلْحَسَنِ بْنِ عَلِيٍّ مَا حَفِظْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ حَفِظْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَعْ مَا يَرِيبُكَ إِلَى مَا لاَ يَرِيبُكَ فَإِنَّ الصِّدْقَ طُمَأْنِينَةٌ وَإِنَّ الْكَذِبَ رِيبَةٌ ‏\"‏ ‏.‏ وَفِي الْحَدِيثِ قِصَّةٌ ‏.‏ قَالَ وَأَبُو الْحَوْرَاءِ السَّعْدِيُّ اسْمُهُ رَبِيعَةُ بْنُ شَيْبَانَ ‏.‏ قَالَ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا بُنْدَارٌ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ بُرَيْدٍ، فَذَكَرَ نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2519,
			"arabicnumber": 2519,
			"text": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ الطَّائِيُّ الْبَصْرِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَخْرَمِيُّ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نُبَيْهٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ ذُكِرَ رَجُلٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم بِعِبَادَةٍ وَاجْتِهَادٍ وَذُكِرَ عِنْدَهُ آخَرُ بِرِعَةٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَعْدِلْ بِالرِّعَةِ ‏\"‏ ‏.‏ وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ هُوَ مِنْ وَلَدِ الْمِسْوَرِ بْنِ مَخْرَمَةَ وَهُوَ مَدَنِيٌّ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2520,
			"arabicnumber": 2520,
			"text": "حَدَّثَنَا هَنَّادٌ، وَأَبُو زُرْعَةَ وَغَيْرُ وَاحِدٍ قَالُوا أَخْبَرَنَا قَبِيصَةُ، عَنْ إِسْرَائِيلَ، عَنْ هِلاَلِ بْنِ مِقْلاَصٍ الصَّيْرَفِيِّ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَكَلَ طَيِّبًا وَعَمِلَ فِي سُنَّةٍ وَأَمِنَ النَّاسُ بَوَائِقَهُ دَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّ هَذَا الْيَوْمَ فِي النَّاسِ لَكَثِيرٌ ‏.‏ قَالَ ‏\"‏ وَسَيَكُونُ فِي قُرُونٍ بَعْدِي ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ إِسْرَائِيلَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2522,
			"arabicnumber": 2522,
			"text": "حَدَّثَنَا العَبَّاسُ الدُّورِيُّ حَدَّثَنَا عُبيْدُ اللهِ بْنُ مُوسَى أََخْبَرَنَا شَيْبَانُُ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الخُدْرِيِّ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : \" أَوَّلُ زُمْرَةٍ تَدْخُلُ الجَنَّةَ عَلَى صُورَةِ القَمَرِ لَيْلَةَ البَدْرِ ، وَالثَّانِيَةُ عَلَى لَوْنِ أَحْسَنِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ ، لِكُلِّ رَجُلٍ مِنْهُمْ زَوْجَتَانِ عَلَى كُلِّ زَوْجَةٍ سَبْعُونَ حُلَّةً يَبْدُو مُخُّ سَاقِهَا مِنْ وَرَائِهَا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 108
			}
		}
	]
}