{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2523,
			"arabicnumber": 2523,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَنَسٍ وَأَبِي سَعِيدٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2524,
			"arabicnumber": 2524,
			"text": "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ فِرَاسٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ فِي الْجَنَّةِ شَجَرَةٌ يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لاَ يَقْطَعُهَا وَقَالَ ذَلِكَ الظِّلُّ الْمَمْدُودُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي سَعِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2525,
			"arabicnumber": 2525,
			"text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا زِيَادُ بْنُ الْحَسَنِ بْنِ الْفُرَاتِ الْقَزَّازُ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا فِي الْجَنَّةِ شَجَرَةٌ إِلاَّ وَسَاقُهَا مِنْ ذَهَبٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي سَعِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2526,
			"arabicnumber": 2526,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ حَمْزَةَ الزَّيَّاتِ، عَنْ زِيَادٍ الطَّائِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ مَا لَنَا إِذَا كُنَّا عِنْدَكَ رَقَّتْ قُلُوبُنَا وَزَهِدْنَا فِي الدُّنْيَا وَكُنَّا مِنْ أَهْلِ الآخِرَةِ فَإِذَا خَرَجْنَا مِنْ عِنْدِكَ فَآنَسْنَا أَهَالِيَنَا وَشَمَمْنَا أَوْلاَدَنَا أَنْكَرْنَا أَنْفُسَنَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ أَنَّكُمْ تَكُونُونَ إِذَا خَرَجْتُمْ مِنْ عِنْدِي كُنْتُمْ عَلَى حَالِكُمْ ذَلِكَ لَزَارَتْكُمُ الْمَلاَئِكَةُ فِي بُيُوتِكُمْ وَلَوْ لَمْ تُذْنِبُوا لَجَاءَ اللَّهُ بِخَلْقٍ جَدِيدٍ كَىْ يُذْنِبُوا فَيَغْفِرَ لَهُمْ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مِمَّ خُلِقَ الْخَلْقُ قَالَ ‏\"‏ مِنَ الْمَاءِ ‏\"‏ ‏.‏ قُلْنَا الْجَنَّةُ مَا بِنَاؤُهَا قَالَ ‏\"‏ لَبِنَةٌ مِنْ فِضَّةٍ وَلَبِنَةٌ مِنْ ذَهَبٍ وَمِلاَطُهَا الْمِسْكُ الأَذْفَرُ وَحَصْبَاؤُهَا اللُّؤْلُؤُ وَالْيَاقُوتُ وَتُرْبَتُهَا الزَّعْفَرَانُ مَنْ يَدْخُلْهَا يَنْعَمْ وَلاَ يَبْأَسْ وَيُخَلَّدْ وَلاَ يَمُوتْ لاَ تَبْلَى ثِيَابُهُمْ وَلاَ يَفْنَى شَبَابُهُمْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ ثَلاَثَةٌ لاَ تُرَدُّ دَعْوَتُهُمُ الإِمَامُ الْعَادِلُ وَالصَّائِمُ حِينَ يُفْطِرُ وَدَعْوَةُ الْمَظْلُومِ يَرْفَعُهَا فَوْقَ الْغَمَامِ وَتُفَتَّحُ لَهَا أَبْوَابُ السَّمَاءِ وَيَقُولُ الرَّبُّ عَزَّ وَجَلَّ وَعِزَّتِي لأَنْصُرَنَّكِ وَلَوْ بَعْدَ حِينٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِذَاكَ الْقَوِيِّ وَلَيْسَ هُوَ عِنْدِي بِمُتَّصِلٍ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ بِإِسْنَادٍ آخَرَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2527,
			"arabicnumber": 2527,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ سَعْدٍ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ فِي الْجَنَّةِ لَغُرَفًا يُرَى ظُهُورُهَا مِنْ بُطُونِهَا وَبُطُونُهَا مِنْ ظُهُورِهَا ‏\"‏ ‏.‏ فَقَامَ إِلَيْهِ أَعْرَابِيٌّ فَقَالَ لِمَنْ هِيَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هِيَ لِمَنْ أَطَابَ الْكَلاَمَ وَأَطْعَمَ الطَّعَامَ وَأَدَامَ الصِّيَامَ وَصَلَّى لِلَّهِ بِاللَّيْلِ وَالنَّاسُ نِيَامٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ هَذَا مِنْ قِبَلِ حِفْظِهِ وَهُوَ كُوفِيٌّ وَعَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ الْقُرَشِيُّ مَدَنِيٌّ وَهُوَ أَثْبَتُ مِنْ هَذَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2528,
			"arabicnumber": 2528,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ أَبُو عَبْدِ الصَّمَدِ الْعَمِّيُّ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجَنَّةِ جَنَّتَيْنِ آنِيَتُهُمَا وَمَا فِيهِمَا مِنْ فِضَّةٍ وَجَنَّتَيْنِ آنِيَتُهُمَا وَمَا فِيهِمَا مِنْ ذَهَبٍ وَمَا بَيْنَ الْقَوْمِ وَبَيْنَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلاَّ رِدَاءُ الْكِبْرِيَاءِ عَلَى وَجْهِهِ فِي جَنَّةِ عَدْنٍ ‏\"‏ ‏.‏ وَبِهَذَا الإِسْنَادِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجَنَّةِ لَخَيْمَةً مِنْ دُرَّةٍ مُجَوَّفَةٍ عَرْضُهَا سِتُّونَ مِيلاً فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ مَا يَرَوْنَ الآخَرِينَ يَطُوفُ عَلَيْهِمُ الْمُؤْمِنُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَأَبُو عِمْرَانَ الْجَوْنِيُّ اسْمُهُ عَبْدُ الْمَلِكِ بْنُ حَبِيبٍ وَأَبُو بَكْرِ بْنُ أَبِي مُوسَى قَالَ أَحْمَدُ بْنُ حَنْبَلٍ لاَ يُعْرَفُ اسْمُهُ ‏.‏ وَأَبُو مُوسَى الأَشْعَرِيُّ اسْمُهُ عَبْدُ اللَّهِ بْنُ قَيْسٍ وَأَبُو مَالِكٍ الأَشْعَرِيُّ اسْمُهُ سَعْدُ بْنُ طَارِقِ بْنِ أَشْيَمَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2529,
			"arabicnumber": 2529,
			"text": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا شَرِيكٌ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ مِائَةُ عَامٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2530,
			"arabicnumber": 2530,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ، قَالاَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ صَامَ رَمَضَانَ وَصَلَّى الصَّلَوَاتِ وَحَجَّ الْبَيْتَ لاَ أَدْرِي أَذَكَرَ الزَّكَاةَ أَمْ لاَ إِلاَّ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يَغْفِرَ لَهُ إِنْ هَاجَرَ فِي سَبِيلِ اللَّهِ أَوْ مَكَثَ بِأَرْضِهِ الَّتِي وُلِدَ بِهَا ‏\"‏ ‏.‏ قَالَ مُعَاذٌ أَلاَ أُخْبِرُ بِهَذَا النَّاسَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَرِ النَّاسَ يَعْمَلُونَ فَإِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالأَرْضِ وَالْفِرْدَوْسُ أَعْلَى الْجَنَّةِ وَأَوْسَطُهَا وَفَوْقَ ذَلِكَ عَرْشُ الرَّحْمَنِ وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ فَإِذَا سَأَلْتُمُ اللَّهَ فَسَلُوهُ الْفِرْدَوْسَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَكَذَا رُوِيَ هَذَا الْحَدِيثُ عَنْ هِشَامِ بْنِ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاذِ بْنِ جَبَلٍ وَهَذَا عِنْدِي أَصَحُّ مِنْ حَدِيثِ هَمَّامٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ ‏.‏ وَعَطَاءٌ لَمْ يُدْرِكْ مُعَاذَ بْنَ جَبَلٍ وَمُعَاذٌ قَدِيمُ الْمَوْتِ مَاتَ فِي خِلاَفَةِ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2531,
			"arabicnumber": 2531,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هَمَّامٌ، حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالأَرْضِ وَالْفِرْدَوْسُ أَعْلاَهَا دَرَجَةً وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ الأَرْبَعَةُ وَمِنْ فَوْقِهَا يَكُونُ الْعَرْشُ فَإِذَا سَأَلْتُمُ اللَّهَ فَسَلُوهُ الْفِرْدَوْسَ ‏\"‏ ‏.‏ حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا هَمَّامٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2532,
			"arabicnumber": 2532,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ دَرَّاجٍ أَبِي السَّمْحِ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ لَوْ أَنَّ الْعَالَمِينَ اجْتَمَعُوا فِي إِحْدَاهُنَّ لَوَسِعَتْهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2533,
			"arabicnumber": 2533,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، أَخْبَرَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمَرْأَةَ مِنْ نِسَاءِ أَهْلِ الْجَنَّةِ لَيُرَى بَيَاضُ سَاقِهَا مِنْ وَرَاءِ سَبْعِينَ حُلَّةً حَتَّى يُرَى مُخُّهَا وَذَلِكَ بِأَنَّ اللَّهَ يَقُولُ‏:‏ ‏(‏كَأََنَّهُنَّ الْيَاقُوتُ وَالْمَرْجَانُ ‏)‏ فَأَمَّا الْيَاقُوتُ فَإِنَّهُ حَجَرٌ لَوْ أَدْخَلْتَ فِيهِ سِلْكًا ثُمَّ اسْتَصْفَيْتَهُ لأُرِيتَهُ مِنْ وَرَائِهِ ‏\"‏ ‏.‏ حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2534,
			"arabicnumber": 2534,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، نَحْوَهُ بِمَعْنَاهُ وَلَمْ يَرْفَعْهُ ‏.‏ وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَبِيدَةَ بْنِ حُمَيْدٍ وَهَكَذَا رَوَى جَرِيرٌ وَغَيْرُ وَاحِدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ وَلَمْ يَرْفَعُوهُ ‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، نَحْوَ حَدِيثِ أَبِي الأَحْوَصِ وَلَمْ يَرْفَعْهُ أَصْحَابُ عَطَاءٍ وَهَذَا أَصَحُّ ‏.‏ ‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2536,
			"arabicnumber": 2536,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالاَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، عَنْ عِمْرَانَ الْقَطَّانِ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يُعْطَى الْمُؤْمِنُ فِي الْجَنَّةِ قُوَّةَ كَذَا وَكَذَا مِنَ الْجِمَاعِ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ أَوَيُطِيقُ ذَلِكَ قَالَ ‏\"‏ يُعْطَى قُوَّةَ مِائَةٍ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ زَيْدِ بْنِ أَرْقَمَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ قَتَادَةَ عَنْ أَنَسٍ إِلاَّ مِنْ حَدِيثِ عِمْرَانَ الْقَطَّانِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2537,
			"arabicnumber": 2537,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَوَّلُ زُمْرَةٍ تَلِجُ الْجَنَّةَ صُورَتُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ لاَ يَبْصُقُونَ فِيهَا وَلاَ يَمْتَخِطُونَ وَلاَ يَتَغَوَّطُونَ آنِيَتُهُمْ فِيهَا الذَّهَبُ وَأَمْشَاطُهُمْ مِنَ الذَّهَبِ وَالْفِضَّةِ وَمَجَامِرُهُمْ مِنَ الأَلُوَّةِ وَرَشْحُهُمُ الْمِسْكُ وَلِكُلِّ وَاحِدٍ مِنْهُمْ زَوْجَتَانِ يُرَى مُخُّ سُوقِهِمَا مِنْ وَرَاءِ اللَّحْمِ مِنَ الْحُسْنِ لاَ اخْتِلاَفَ بَيْنَهُمْ وَلاَ تَبَاغُضَ قُلُوبُهُمْ قَلْبُ رَجُلٍ وَاحِدٍ يُسَبِّحُونَ اللَّهَ بُكْرَةً وَعَشِيًّا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَالأَلُوَّةُ هُوَ الْعُودُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2538,
			"arabicnumber": 2538,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا ابْنُ لَهِيعَةَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ دَاوُدَ بْنِ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ أَنَّ مَا يُقِلُّ ظُفُرٌ مِمَّا فِي الْجَنَّةِ بَدَا لَتَزَخْرَفَتْ لَهُ مَا بَيْنَ خَوَافِقِ السَّمَوَاتِ وَالأَرْضِ وَلَوْ أَنَّ رَجُلاً مِنْ أَهْلِ الْجَنَّةِ اطَّلَعَ فَبَدَا أَسَاوِرُهُ لَطَمَسَ ضَوْءَ الشَّمْسِ كَمَا تَطْمِسُ الشَّمْسُ ضَوْءَ النُّجُومِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ بِهَذَا الإِسْنَادِ إِلاَّ مِنْ حَدِيثِ ابْنِ لَهِيعَةَ ‏.‏ وَقَدْ رَوَى يَحْيَى بْنُ أَيُّوبَ هَذَا الْحَدِيثَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ وَقَالَ عَنْ عُمَرَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2539,
			"arabicnumber": 2539,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَأَبُو هِشَامٍ الرِّفَاعِيُّ قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَامِرٍ الأَحْوَلِ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَهْلُ الْجَنَّةِ جُرْدٌ مُرْدٌ كُحْلٌ لاَ يَفْنَى شَبَابُهُمْ وَلاَ تَبْلَى ثِيَابُهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2540,
			"arabicnumber": 2540,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ دَرَّاجٍ أَبِي السَّمْحِ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي قَوْلِهِ‏:‏ ‏(‏وَفُرُشٍ مَرْفُوعَةٍ ‏)‏ قَالَ ‏\"‏ ارْتِفَاعُهَا لَكَمَا بَيْنَ السَّمَاءِ وَالأَرْضِ مَسِيرَةَ خَمْسِمِائَةِ سَنَةٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ فِي تَفْسِيرِ هَذَا الْحَدِيثِ إِنَّ مَعْنَاهُ الْفُرُشَ فِي الدَّرَجَاتِ وَبَيْنَ الدَّرَجَاتِ كَمَا بَيْنَ السَّمَاءِ وَالأَرْضِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2541,
			"arabicnumber": 2541,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ وَذُكِرَ لَهُ سِدْرَةُ الْمُنْتَهَى قَالَ ‏ \"‏ يَسِيرُ الرَّاكِبُ فِي ظِلِّ الْفَنَنِ مِنْهَا مِائَةَ سَنَةٍ أَوْ يَسْتَظِلُّ بِظِلِّهَا مِائَةُ رَاكِبٍ شَكَّ يَحْيَى فِيهَا فَرَاشُ الذَّهَبِ كَأَنَّ ثَمَرَهَا الْقِلاَلُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2542,
			"arabicnumber": 2542,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ، عَنْ أَبِيهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا الْكَوْثَرُ قَالَ ‏\"‏ ذَاكَ نَهْرٌ أَعْطَانِيهِ اللَّهُ يَعْنِي فِي الْجَنَّةِ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ فِيهَا طَيْرٌ أَعْنَاقُهَا كَأَعْنَاقِ الْجُزُرِ ‏\"‏ ‏.‏ قَالَ عُمَرُ إِنَّ هَذِهِ لَنَاعِمَةٌ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكَلَتُهَا أَنْعَمُ مِنْهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ هُوَ ابْنُ أَخِي ابْنِ شِهَابٍ الزُّهْرِيِّ وَعَبْدُ اللَّهِ بْنُ مُسْلِمٍ قَدْ رَوَى عَنِ ابْنِ عُمَرَ وَأَنَسِ بْنِ مَالِكٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2543,
			"arabicnumber": 2543,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ أَخْبَرَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا الْمَسْعُودِيُّ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ هَلْ فِي الْجَنَّةِ مِنْ خَيْلٍ قَالَ ‏\"‏ إِنِ اللَّهُ أَدْخَلَكَ الْجَنَّةَ فَلاَ تَشَاءُ أَنْ تُحْمَلَ فِيهَا عَلَى فَرَسٍ مِنْ يَاقُوتَةٍ حَمْرَاءَ يَطِيرُ بِكَ فِي الْجَنَّةِ حَيْثُ شِئْتَ إِلاَّ فَعَلْتَ ‏\"‏ ‏.‏ قَالَ وَسَأَلَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَلْ فِي الْجَنَّةِ مِنْ إِبِلٍ قَالَ فَلَمْ يَقُلْ لَهُ مِثْلَ مَا قَالَ لِصَاحِبِهِ قَالَ ‏\"‏ إِنْ يُدْخِلْكَ اللَّهُ الْجَنَّةَ يَكُنْ لَكَ فِيهَا مَا اشْتَهَتْ نَفْسُكَ وَلَذَّتْ عَيْنُكَ ‏\"‏ ‏.‏ حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ بِمَعْنَاهُ وَهَذَا أَصَحُّ مِنْ حَدِيثِ الْمَسْعُودِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2544,
			"arabicnumber": 2544,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ سَمُرَةَ الأَحْمَسِيُّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ وَاصِلٍ، هُوَ ابْنُ السَّائِبِ عَنْ أَبِي سَوْرَةَ، عَنْ أَبِي أَيُّوبَ، قَالَ أَتَى النَّبِيَّ صلى الله عليه وسلم أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ الْخَيْلَ أَفِي الْجَنَّةِ خَيْلٌ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنْ أُدْخِلْتَ الْجَنَّةَ أُتِيتَ بِفَرَسٍ مِنْ يَاقُوتَةٍ لَهُ جَنَاحَانِ فَحُمِلْتَ عَلَيْهِ ثُمَّ طَارَ بِكَ حَيْثُ شِئْتَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ وَلاَ نَعْرِفُهُ مِنْ حَدِيثِ أَبِي أَيُّوبَ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَأَبُو سَوْرَةَ هُوَ ابْنُ أَخِي أَبِي أَيُّوبَ يُضَعَّفُ فِي الْحَدِيثِ ضَعَّفَهُ يَحْيَى بْنُ مَعِينٍ جِدًّا قَالَ وَسَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يَقُولُ أَبُو سَوْرَةَ هَذَا مُنْكَرُ الْحَدِيثِ يَرْوِي مَنَاكِيرَ عَنْ أَبِي أَيُّوبَ لاَ يُتَابَعُ عَلَيْهَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2545,
			"arabicnumber": 2545,
			"text": "حَدَّثَنَا أَبُو هُرَيْرَةَ، مُحَمَّدُ بْنُ فِرَاسٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا عِمْرَانُ أَبُو الْعَوَّامِ، عَنْ قَتَادَةَ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَدْخُلُ أَهْلُ الْجَنَّةِ الْجَنَّةَ جُرْدًا مُرْدًا مُكَحَّلِينَ أَبْنَاءَ ثَلاَثِينَ أَوْ ثَلاَثٍ وَثَلاَثِينَ سَنَةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَبَعْضُ أَصْحَابِ قَتَادَةَ رَوَوْا هَذَا عَنْ قَتَادَةَ مُرْسَلاً وَلَمْ يُسْنِدُوهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2546,
			"arabicnumber": 2546,
			"text": "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الطَّحَّانُ الْكُوفِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ ضِرَارِ بْنِ مُرَّةَ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَهْلُ الْجَنَّةِ عِشْرُونَ وَمِائَةُ صَفٍّ ثَمَانُونَ مِنْهَا مِنْ هَذِهِ الأُمَّةِ وَأَرْبَعُونَ مِنْ سَائِرِ الأُمَمِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً وَمِنْهُمْ مَنْ قَالَ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ وَحَدِيثُ أَبِي سِنَانٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ حَسَنٌ ‏.‏ وَأَبُو سِنَانٍ اسْمُهُ ضِرَارُ بْنُ مُرَّةَ وَأَبُو سِنَانٍ الشَّيْبَانِيُّ اسْمُهُ سَعِيدُ بْنُ سِنَانٍ وَهُوَ بَصْرِيٌّ وَأَبُو سِنَانٍ الشَّامِيُّ اسْمُهُ عِيسَى بْنُ سِنَانٍ هُوَ الْقَسْمَلِيُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2547,
			"arabicnumber": 2547,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، أَنْبَأَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي قُبَّةٍ نَحْوًا مِنْ أَرْبَعِينَ فَقَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ إِنَّ الْجَنَّةَ لاَ يَدْخُلُهَا إِلاَّ نَفْسٌ مُسْلِمَةٌ مَا أَنْتُمْ فِي الشِّرْكِ إِلاَّ كَالشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ أَوْ كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ الثَّوْرِ الأَحْمَرِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَأَبِي سَعِيدٍ الْخُدْرِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2548,
			"arabicnumber": 2548,
			"text": "حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ الْبَغْدَادِيُّ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى الْقَزَّازُ، عَنْ خَالِدِ بْنِ أَبِي بَكْرٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَابُ أُمَّتِي الَّذِي يَدْخُلُونَ مِنْهُ الْجَنَّةَ عَرْضُهُ مَسِيرَةُ الرَّاكِبِ الْجَوَادَ ثَلاَثًا ثُمَّ إِنَّهُمْ لَيُضْغَطُونَ عَلَيْهِ حَتَّى تَكَادُ مَنَاكِبُهُمْ تَزُولُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ قَالَ سَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ وَقَالَ لِخَالِدِ بْنِ أَبِي بَكْرٍ مَنَاكِيرُ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبِ بْنِ أَبِي الْعِشْرِينَ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنَا حَسَّانُ بْنُ عَطِيَّةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ لَقِيَ أَبَا هُرَيْرَةَ فَقَالَ أَبُو هُرَيْرَةَ أَسْأَلُ اللَّهَ أَنْ يَجْمَعَ، بَيْنِي وَبَيْنَكَ فِي سُوقِ الْجَنَّةِ ‏.‏ فَقَالَ سَعِيدٌ أَفِيهَا سُوقٌ قَالَ نَعَمْ أَخْبَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَنَّ أَهْلَ الْجَنَّةِ إِذَا دَخَلُوهَا نَزَلُوا فِيهَا بِفَضْلِ أَعْمَالِهِمْ ثُمَّ يُؤْذَنُ فِي مِقْدَارِ يَوْمِ الْجُمُعَةِ مِنْ أَيَّامِ الدُّنْيَا فَيَزُورُونَ رَبَّهُمْ وَيُبْرِزُ لَهُمْ عَرْشَهُ وَيَتَبَدَّى لَهُمْ فِي رَوْضَةٍ مِنْ رِيَاضِ الْجَنَّةِ فَتُوضَعُ لَهُمْ مَنَابِرُ مِنْ نُورٍ وَمَنَابِرُ مِنْ لُؤْلُؤٍ وَمَنَابِرُ مِنْ يَاقُوتٍ وَمَنَابِرُ مِنْ زَبَرْجَدٍ وَمَنَابِرُ مِنْ ذَهَبٍ وَمَنَابِرُ مِنْ فِضَّةٍ وَيَجْلِسُ أَدْنَاهُمْ وَمَا فِيهِمْ مِنْ دَنِيٍّ عَلَى كُثْبَانِ الْمِسْكِ وَالْكَافُورِ وَمَا يُرَوْنَ أَنَّ أَصْحَابَ الْكَرَاسِيِّ بِأَفْضَلَ مِنْهُمْ مَجْلِسًا ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ قُلْتُ يَا رَسُولَ اللَّهِ وَهَلْ نَرَى رَبَّنَا قَالَ ‏\"‏ نَعَمْ قَالَ هَلْ تَتَمَارَوْنَ فِي رُؤْيَةِ الشَّمْسِ وَالْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏ ‏.‏ قُلْنَا لاَ ‏.‏ قَالَ ‏\"‏ كَذَلِكَ لاَ تَتَمَارَوْنَ فِي رُؤْيَةِ رَبِّكُمْ وَلاَ يَبْقَى فِي ذَلِكَ الْمَجْلِسِ رَجُلٌ إِلاَّ حَاضَرَهُ اللَّهُ مُحَاضَرَةً حَتَّى يَقُولَ لِلرَّجُلِ مِنْهُمْ يَا فُلاَنُ ابْنَ فُلاَنٍ أَتَذْكُرُ يَوْمَ قُلْتَ كَذَا وَكَذَا فَيُذَكِّرُهُ بِبَعْضِ غَدَرَاتِهِ فِي الدُّنْيَا فَيَقُولُ يَا رَبِّ أَفَلَمْ تَغْفِرْ لِي فَيَقُولُ بَلَى فَبِسِعَةِ مَغْفِرَتِي بَلَغْتَ مَنْزِلَتَكَ هَذِهِ ‏.‏ فَبَيْنَمَا هُمْ عَلَى ذَلِكَ غَشِيَتْهُمْ سَحَابَةٌ مِنْ فَوْقِهِمْ فَأَمْطَرَتْ عَلَيْهِمْ طِيبًا لَمْ يَجِدُوا مِثْلَ رِيحِهِ شَيْئًا قَطُّ وَيَقُولُ رَبُّنَا تَبَارَكَ وَتَعَالَى قُومُوا إِلَى مَا أَعْدَدْتُ لَكُمْ مِنَ الْكَرَامَةِ فَخُذُوا مَا اشْتَهَيْتُمْ ‏.‏ قَالَ فَنَأْتِي سُوقًا قَدْ حَفَّتْ بِهِ الْمَلاَئِكَةُ فِيهِ مَا لَمْ تَنْظُرِ الْعُيُونُ إِلَى مِثْلِهِ وَلَمْ تَسْمَعِ الآذَانُ وَلَمْ يَخْطُرْ عَلَى الْقُلُوبِ فَيُحْمَلُ لَنَا مَا اشْتَهَيْنَا لَيْسَ يُبَاعُ فِيهَا وَلاَ يُشْتَرَى وَفِي ذَلِكَ السُّوقِ يَلْقَى أَهْلُ الْجَنَّةِ بَعْضُهُمْ بَعْضًا قَالَ فَيُقْبِلُ الرَّجُلُ ذُو الْمَنْزِلَةِ الْمُرْتَفِعَةِ فَيَلْقَى مَنْ هُوَ دُونَهُ وَمَا فِيهِمْ دَنِيٌّ فَيَرُوعُهُ مَا يَرَى عَلَيْهِ مِنَ اللِّبَاسِ فَمَا يَنْقَضِي آخِرُ حَدِيثِهِ حَتَّى يَتَخَيَّلَ إِلَيْهِ مَا هُوَ أَحْسَنُ مِنْهُ وَذَلِكَ أَنَّهُ لاَ يَنْبَغِي لأَحَدٍ أَنْ يَحْزَنَ فِيهَا ثُمَّ نَنْصَرِفُ إِلَى مَنَازِلِنَا فَتَتَلَقَّانَا أَزْوَاجُنَا فَيَقُلْنَ مَرْحَبًا وَأَهْلاً لَقَدْ جِئْتَ وَإِنَّ بِكَ مِنَ الْجَمَالِ أَفْضَلَ مِمَّا فَارَقْتَنَا عَلَيْهِ ‏.‏ فَنَقُولُ إِنَّا جَالَسْنَا الْيَوْمَ رَبَّنَا الْجَبَّارَ وَيَحِقُّنَا أَنْ نَنْقَلِبَ بِمِثْلِ مَا انْقَلَبْنَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ وَقَدْ رَوَى سُوَيْدُ بْنُ عَمْرٍو عَنِ الأَوْزَاعِيِّ شَيْئًا مِنْ هَذَا الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2550,
			"arabicnumber": 2550,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَهَنَّادٌ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ سَعْدٍ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ فِي الْجَنَّةِ لَسُوقًا مَا فِيهَا شِرَاءٌ وَلاَ بَيْعٌ إِلاَّ الصُّوَرَ مِنَ الرِّجَالِ وَالنِّسَاءِ فَإِذَا اشْتَهَى الرَّجُلُ صُورَةً دَخَلَ فِيهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2551,
			"arabicnumber": 2551,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ، قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَنَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ فَقَالَ ‏\"‏ إِنَّكُمْ سَتُعْرَضُونَ عَلَى رَبِّكُمْ فَتَرَوْنَهُ كَمَا تَرَوْنَ هَذَا الْقَمَرَ لاَ تُضَامُونَ فِي رُؤْيَتِهِ فَإِنِ اسْتَطَعْتُمْ أَنْ لاَ تُغْلَبُوا عَلَى صَلاَةٍ قَبْلَ طُلُوعِ الشَّمْسِ وَصَلاَةٍ قَبْلَ غُرُوبِهَا فَافْعَلُوا ‏\"‏ ‏.‏ ثُمَّ قَرَأََ‏:‏ ‏(‏سَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ ‏)‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2552,
			"arabicnumber": 2552,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ صُهَيْبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي قَوْلِه‏:‏ ‏(‏لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ ‏)‏ قَالَ ‏\"‏ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ نَادَى مُنَادٍ إِنَّ لَكُمْ عِنْدَ اللَّهِ مَوْعِدًا ‏.‏ قَالُوا أَلَمْ يُبَيِّضْ وُجُوهَنَا وَيُنَجِّنَا مِنَ النَّارِ وَيُدْخِلْنَا الْجَنَّةَ قَالُوا بَلَى ‏.‏ قَالَ فَيُكْشَفُ الْحِجَابُ قَالَ فَوَاللَّهِ مَا أَعْطَاهُمْ شَيْئًا أَحَبَّ إِلَيْهِمْ مِنَ النَّظَرِ إِلَيْهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا أَسْنَدَهُ حَمَّادُ بْنُ سَلَمَةَ وَرَفَعَهُ ‏.‏ وَرَوَى سُلَيْمَانُ بْنُ الْمُغِيرَةِ وَحَمَّادُ بْنُ زَيْدٍ هَذَا الْحَدِيثَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَوْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2553,
			"arabicnumber": 2553,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنِي شَبَابَةُ، عَنْ إِسْرَائِيلَ، عَنْ ثُوَيْرٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً لَمَنْ يَنْظُرُ إِلَى جِنَانِهِ وَأَزْوَاجِهِ وَنَعِيمِهِ وَخَدَمِهِ وَسُرُرِهِ مَسِيرَةَ أَلْفِ سَنَةٍ وَأَكْرَمَهُمْ عَلَى اللَّهِ مَنْ يَنْظُرُ إِلَى وَجْهِهِ غُدْوَةً وَعَشِيَّةً ‏\"‏ ‏.‏ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏:‏ ‏(‏وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ * إِلَى رَبِّهَا نَاظِرَةٌ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ إِسْرَائِيلَ عَنْ ثُوَيْرٍ عَنِ ابْنِ عُمَرَ مَرْفُوعٌ ‏.‏ وَرَوَاهُ عَبْدُ الْمَلِكِ بْنُ أَبْجَرَ عَنْ ثُوَيْرٍ عَنِ ابْنِ عُمَرَ مَوْقُوفٌ ‏.‏ وَرَوَى عُبَيْدُ اللَّهِ الأَشْجَعِيُّ، عَنْ سُفْيَانَ، عَنْ ثُوَيْرٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَوْلَهُ وَلَمْ يَرْفَعْهُ حَدَّثَنَا بِذَلِكَ أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا عُبَيْدُ اللَّهِ الأَشْجَعِيُّ، عَنْ سُفْيَانَ، عَنْ ثُوَيْرٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، نَحْوَهُ وَلَمْ يَرْفَعْهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2554,
			"arabicnumber": 2554,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ الْكُوفِيُّ، حَدَّثَنَا جَابِرُ بْنُ نُوحٍ الْحِمَّانِيُّ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تُضَامُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَتُضَامُّونَ فِي رُؤْيَةِ الشَّمْسِ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَإِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ الْقَمَرَ لَيْلَةَ الْبَدْرِ لاَ تُضَامُّونَ فِي رُؤْيَتِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏ وَهَكَذَا رَوَى يَحْيَى بْنُ عِيسَى الرَّمْلِيُّ وَغَيْرُ وَاحِدٍ عَنِ الأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرَوَى عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنِ الأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَحَدِيثُ ابْنِ إِدْرِيسَ عَنِ الأَعْمَشِ غَيْرُ مَحْفُوظٍ وَحَدِيثُ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَصَحُّ وَهَكَذَا رَوَاهُ سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَقَدْ رُوِيَ عَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِنْ غَيْرِ هَذَا الْوَجْهِ مِثْلُ هَذَا الْحَدِيثِ وَهُوَ حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2555,
			"arabicnumber": 2555,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ يَقُولُ لأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ ‏.‏ فَيَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ ‏.‏ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ مَا لَنَا لاَ نَرْضَى وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ ‏.‏ فَيَقُولُ أَنَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ ‏.‏ قَالُوا وَأَىُّ شَيْءٍ أَفْضَلُ مِنْ ذَلِكَ قَالَ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلاَ أَسْخَطُ عَلَيْكُمْ أَبَدًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2556,
			"arabicnumber": 2556,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ هِلاَلِ بْنِ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ فِي الْغُرْفَةِ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ الشَّرْقِيَّ أَوِ الْكَوْكَبَ الْغَرْبِيَّ الْغَارِبَ فِي الأُفُقِ أَوِ الطَّالِعَ فِي تَفَاضُلِ الدَّرَجَاتِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أُولَئِكَ النَّبِيُّونَ ‏.‏ قَالَ ‏\"‏ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ وَأَقْوَامٌ آمَنُوا بِاللَّهِ وَرَسُولِهِ وَصَدَّقُوا الْمُرْسَلِينَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يَجْمَعُ اللَّهُ النَّاسَ يَوْمَ الْقِيَامَةِ فِي صَعِيدٍ وَاحِدٍ ثُمَّ يَطَّلِعُ عَلَيْهِمْ رَبُّ الْعَالَمِينَ فَيَقُولُ أَلاَ يَتْبَعُ كُلُّ إِنْسَانٍ مَا كَانُوا يَعْبُدُونَهُ ‏.‏ فَيُمَثَّلُ لِصَاحِبِ الصَّلِيبِ صَلِيبُهُ وَلِصَاحِبِ التَّصَاوِيرِ تَصَاوِيرُهُ وَلِصَاحِبِ النَّارِ نَارُهُ فَيَتْبَعُونَ مَا كَانُوا يَعْبُدُونَ وَيَبْقَى الْمُسْلِمُونَ فَيَطَّلِعُ عَلَيْهِمْ رَبُّ الْعَالَمِينَ فَيَقُولُ أَلاَ تَتَّبِعُونَ النَّاسَ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ نَعُوذُ بِاللَّهِ مِنْكَ اللَّهُ رَبُّنَا هَذَا مَكَانُنَا حَتَّى نَرَى رَبَّنَا ‏.‏ وَهُوَ يَأْمُرُهُمْ وَيُثَبِّتُهُمْ ثُمَّ يَتَوَارَى ثُمَّ يَطَّلِعُ فَيَقُولُ أَلاَ تَتَّبِعُونَ النَّاسَ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ نَعُوذُ بِاللَّهِ مِنْكَ اللَّهُ رَبُّنَا وَهَذَا مَكَانُنَا حَتَّى نَرَى رَبَّنَا ‏.‏ وَهُوَ يَأْمُرُهُمْ وَيُثَبِّتُهُمْ ‏\"‏ ‏.‏ قَالُوا وَهَلْ نَرَاهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَهَلْ تُضَارُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏ ‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنَّكُمْ لاَ تُضَارُّونَ فِي رُؤْيَتِهِ تِلْكَ السَّاعَةَ ثُمَّ يَتَوَارَى ثُمَّ يَطَّلِعُ فَيُعَرِّفُهُمْ نَفْسَهُ ثُمَّ يَقُولُ أَنَا رَبُّكُمْ فَاتَّبِعُونِي ‏.‏ فَيَقُومُ الْمُسْلِمُونَ وَيُوضَعُ الصِّرَاطُ فَيَمُرُّونَ عَلَيْهِ مِثْلَ جِيَادِ الْخَيْلِ وَالرِّكَابِ وَقَوْلُهُمْ عَلَيْهِ سَلِّمْ سَلِّمْ ‏.‏ وَيَبْقَى أَهْلُ النَّارِ فَيُطْرَحُ مِنْهُمْ فِيهَا فَوْجٌ ثُمَّ يُقَالُ هَلِ امْتَلأْتِ فَتَقُولُ هَلْ مِنْ مَزِيدٍ ‏.‏ ثُمَّ يُطْرَحُ فِيهَا فَوْجٌ فَيُقَالُ هَلِ امْتَلأْتِ ‏.‏ فَتَقُولُ هَلْ مِنْ مَزِيدٍ ‏.‏ حَتَّى إِذَا أُوعِبُوا فِيهَا وَضَعَ الرَّحْمَنُ قَدَمَهُ فِيهَا وَأُزْوِيَ بَعْضُهَا إِلَى بَعْضٍ ثُمَّ قَالَ قَطْ قَالَتْ قَطْ قَطْ فَإِذَا أَدْخَلَ اللَّهُ أَهْلَ الْجَنَّةِ الْجَنَّةَ وَأَهْلَ النَّارِ النَّارَ قَالَ أُتِيَ بِالْمَوْتِ مُلَبَّبًا فَيُوقَفُ عَلَى السُّورِ الَّذِي بَيْنَ أَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ ‏.‏ فَيَطَّلِعُونَ خَائِفِينَ ثُمَّ يُقَالُ يَا أَهْلَ النَّارِ ‏.‏ فَيَطَّلِعُونَ مُسْتَبْشِرِينَ يَرْجُونَ الشَّفَاعَةَ فَيُقَالُ لأَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ هَلْ تَعْرِفُونَ هَذَا فَيَقُولُونَ هَؤُلاَءِ وَهَؤُلاَءِ قَدْ عَرَفْنَاهُ هُوَ الْمَوْتُ الَّذِي وُكِّلَ بِنَا ‏.‏ فَيُضْجَعُ فَيُذْبَحُ ذَبْحًا عَلَى السُّورِ الَّذِي بَيْنَ الْجَنَّةِ وَالنَّارِ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ خُلُودٌ لاَ مَوْتَ وَيَا أَهْلَ النَّارِ خُلُودٌ لاَ مَوْتَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ - وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم رِوَايَاتٌ كَثِيرَةٌ مِثْلُ هَذَا مَا يُذْكَرُ فِيهِ أَمْرُ الرُّؤْيَةِ أَنَّ النَّاسَ يَرَوْنَ رَبَّهُمْ وَذِكْرُ الْقَدَمِ وَمَا أَشْبَهَ هَذِهِ الأَشْيَاءَ وَالْمَذْهَبُ فِي هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنَ الأَئِمَّةِ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَابْنِ الْمُبَارَكِ وَابْنِ عُيَيْنَةَ وَوَكِيعٍ وَغَيْرِهِمْ أَنَّهُمْ رَوَوْا هَذِهِ الأَشْيَاءَ ثُمَّ قَالُوا تُرْوَى هَذِهِ الأَحَادِيثُ وَنُؤْمِنُ بِهَا وَلاَ يُقَالُ كَيْفَ وَهَذَا الَّذِي اخْتَارَهُ أَهْلُ الْحَدِيثِ أَنْ تُرْوَى هَذِهِ الأَشْيَاءُ كَمَا جَاءَتْ وَيُؤْمَنُ بِهَا وَلاَ تُفَسَّرُ وَلاَ تُتَوَهَّمُ وَلاَ يُقَالُ كَيْفَ وَهَذَا أَمْرُ أَهْلِ الْعِلْمِ الَّذِي اخْتَارُوهُ وَذَهَبُوا إِلَيْهِ ‏.‏ وَمَعْنَى قَوْلِهِ فِي الْحَدِيثِ ‏\"‏ فَيُعَرِّفُهُمْ نَفْسَهُ ‏\"‏ ‏.‏ يَعْنِي يَتَجَلَّى لَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2558,
			"arabicnumber": 2558,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبِي، عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، يَرْفَعُهُ قَالَ ‏ \"‏ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أُتِيَ بِالْمَوْتِ كَالْكَبْشِ الأَمْلَحِ فَيُوقَفُ بَيْنَ الْجَنَّةِ وَالنَّارِ فَيُذْبَحُ وَهُمْ يَنْظُرُونَ فَلَوْ أَنَّ أَحَدًا مَاتَ فَرَحًا لَمَاتَ أَهْلُ الْجَنَّةِ وَلَوْ أَنَّ أَحَدًا مَاتَ حَزَنًا لَمَاتَ أَهْلُ النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2559,
			"arabicnumber": 2559,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا عَمْرُو بْنُ عَاصِمٍ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حُمَيْدٍ، وَثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ حُفَّتِ الْجَنَّةُ بِالْمَكَارِهِ وَحُفَّتِ النَّارُ بِالشَّهَوَاتِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2560,
			"arabicnumber": 2560,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ وَالنَّارَ أَرْسَلَ جِبْرِيلَ إِلَى الْجَنَّةِ فَقَالَ انْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لأَهْلِهَا فِيهَا قَالَ فَجَاءَهَا وَنَظَرَ إِلَيْهَا وَإِلَى مَا أَعَدَّ اللَّهُ لأَهْلِهَا فِيهَا قَالَ فَرَجَعَ إِلَيْهِ قَالَ فَوَعِزَّتِكَ لاَ يَسْمَعُ بِهَا أَحَدٌ إِلاَّ دَخَلَهَا ‏.‏ فَأَمَرَ بِهَا فَحُفَّتْ بِالْمَكَارِهِ فَقَالَ ارْجِعْ إِلَيْهَا فَانْظُرْ إِلَى مَا أَعْدَدْتُ لأَهْلِهَا فِيهَا قَالَ فَرَجَعَ إِلَيْهَا فَإِذَا هِيَ قَدْ حُفَّتْ بِالْمَكَارِهِ فَرَجَعَ إِلَيْهِ فَقَالَ وَعِزَّتِكَ لَقَدْ خِفْتُ أَنْ لاَ يَدْخُلَهَا أَحَدٌ ‏.‏ قَالَ اذْهَبْ إِلَى النَّارِ فَانْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لأَهْلِهَا فِيهَا ‏.‏ فَإِذَا هِيَ يَرْكَبُ بَعْضُهَا بَعْضًا فَرَجَعَ إِلَيْهِ فَقَالَ وَعِزَّتِكَ لاَ يَسْمَعُ بِهَا أَحَدٌ فَيَدْخُلُهَا ‏.‏ فَأَمَرَ بِهَا فَحُفَّتْ بِالشَّهَوَاتِ فَقَالَ ارْجِعْ إِلَيْهَا ‏.‏ فَرَجَعَ إِلَيْهَا فَقَالَ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لاَ يَنْجُوَ مِنْهَا أَحَدٌ إِلاَّ دَخَلَهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2561,
			"arabicnumber": 2561,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ احْتَجَّتِ الْجَنَّةُ وَالنَّارُ فَقَالَتِ الْجَنَّةُ يَدْخُلُنِي الضُّعَفَاءُ وَالْمَسَاكِينُ ‏.‏ وَقَالَتِ النَّارُ يَدْخُلُنِي الْجَبَّارُونَ وَالْمُتَكَبِّرُونَ ‏.‏ فَقَالَ لِلنَّارِ أَنْتِ عَذَابِي أَنْتَقِمُ بِكِ مِمَّنْ شِئْتُ ‏.‏ وَقَالَ لِلْجَنَّةِ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ شِئْتُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2562,
			"arabicnumber": 2562,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ، حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَدْنَى أَهْلِ الْجَنَّةِ الَّذِي لَهُ ثَمَانُونَ أَلْفَ خَادِمٍ وَاثْنَتَانِ وَسَبْعُونَ زَوْجَةً وَتُنْصَبُ لَهُ قُبَّةٌ مِنْ لُؤْلُؤٍ وَزَبَرْجَدٍ وَيَاقُوتٍ كَمَا بَيْنَ الْجَابِيَةِ إِلَى صَنْعَاءَ ‏\"‏ ‏.‏ وَبِهَذَا الإِسْنَادِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ مَاتَ مِنْ أَهْلِ الْجَنَّةِ مِنْ صَغِيرٍ أَوْ كَبِيرٍ يُرَدُّونَ بَنِي ثَلاَثِينَ فِي الْجَنَّةِ لاَ يَزِيدُونَ عَلَيْهَا أَبَدًا وَكَذَلِكَ أَهْلُ النَّارِ ‏\"‏ ‏.‏ وَبِهَذَا الإِسْنَادِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ عَلَيْهِمُ التِّيجَانَ إِنَّ أَدْنَى لُؤْلُؤَةٍ مِنْهَا لَتُضِيءُ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2563,
			"arabicnumber": 2563,
			"text": "حَدَّثَنَا بُنْدَارٌ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ عَامِرٍ الأَحْوَلِ، عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُؤْمِنُ إِذَا اشْتَهَى الْوَلَدَ فِي الْجَنَّةِ كَانَ حَمْلُهُ وَوَضْعُهُ وَسِنُّهُ فِي سَاعَةٍ كَمَا يَشْتَهِي ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا فَقَالَ بَعْضُهُمْ فِي الْجَنَّةِ جِمَاعٌ وَلاَ يَكُونُ وَلَدٌ ‏.‏ هَكَذَا رُوِيَ عَنْ طَاوُسٍ وَمُجَاهِدٍ وَإِبْرَاهِيمَ النَّخَعِيِّ ‏.‏ وَقَالَ مُحَمَّدٌ قَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ فِي حَدِيثِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ إِذَا اشْتَهَى الْمُؤْمِنُ الْوَلَدَ فِي الْجَنَّةِ كَانَ فِي سَاعَةٍ وَاحِدَةٍ كَمَا يَشْتَهِي ‏\"‏ ‏.‏ وَلَكِنْ لاَ يَشْتَهِي ‏.‏ قَالَ مُحَمَّدٌ وَقَدْ رُوِيَ عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ أَهْلَ الْجَنَّةِ لاَ يَكُونُ لَهُمْ فِيهَا وَلَدٌ ‏\"‏ ‏.‏ وَأَبُو الصِّدِّيقِ النَّاجِيُّ اسْمُهُ بَكْرُ بْنُ عَمْرٍو وَيُقَالُ بَكْرُ بْنُ قَيْسٍ أَيْضًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2564,
			"arabicnumber": 2564,
			"text": "حَدَّثَنَا هَنَّادٌ، وَأَحْمَدُ بْنُ مَنِيعٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ سَعْدٍ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ فِي الْجَنَّةِ لَمُجْتَمَعًا لِلْحُورِ الْعِينِ يُرَفِّعْنَ بِأَصْوَاتٍ لَمْ يَسْمَعِ الْخَلاَئِقُ مِثْلَهَا قَالَ يَقُلْنَ نَحْنُ الْخَالِدَاتُ فَلاَ نَبِيدُ وَنَحْنُ النَّاعِمَاتُ فَلاَ نَبْأَسُ وَنَحْنُ الرَّاضِيَاتُ فَلاَ نَسْخَطُ طُوبَى لِمَنْ كَانَ لَنَا وَكُنَّا لَهُ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2565,
			"arabicnumber": 2565,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ‏:‏ ‏(‏فَهُمْ فِي رَوْضَةٍ يُحْبَرُونَ ‏)‏ قَالَ السَّمَّاعُ ‏.‏ وَمَعْنَى السَّمَّاعِ مِثْلَ مَا وَرَدَ فِي الْحَدِيثِ أَنَّ الْحُورَ الْعِينَ يُرَفِّعْنَ بِأَصْوَاتِهِنَّ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2566,
			"arabicnumber": 2566,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي الْيَقْظَانِ، عَنْ زَاذَانَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ثَلاَثَةٌ عَلَى كُثْبَانِ الْمِسْكِ - أُرَاهُ قَالَ يَوْمَ الْقِيَامَةِ يَغْبِطُهُمُ الأَوَّلُونَ وَالآخِرُونَ رَجُلٌ يُنَادِي بِالصَّلَوَاتِ الْخَمْسِ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ وَرَجُلٌ يَؤُمُّ قَوْمًا وَهُمْ بِهِ رَاضُونَ وَعَبْدٌ أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ سُفْيَانَ الثَّوْرِيِّ ‏.‏ وَأَبُو الْيَقْظَانِ اسْمُهُ عُثْمَانُ بْنُ عُمَيْرٍ وَيُقَالُ ابْنُ قَيْسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2567,
			"arabicnumber": 2567,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنِ الأَعْمَشِ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، يَرْفَعُهُ قَالَ ‏ \"‏ ثَلاَثَةٌ يُحِبُّهُمُ اللَّهُ رَجُلٌ قَامَ مِنَ اللَّيْلِ يَتْلُو كِتَابَ اللَّهِ وَرَجُلٌ تَصَدَّقَ صَدَقَةً بِيَمِينِهِ يُخْفِيهَا أُرَاهُ قَالَ مِنْ شِمَالِهِ وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَانْهَزَمَ أَصْحَابُهُ فَاسْتَقْبَلَ الْعَدُوَّ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَهُوَ غَيْرُ مَحْفُوظٍ ‏.‏ وَالصَّحِيحُ مَا رَوَى شُعْبَةُ وَغَيْرُهُ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ زَيْدِ بْنِ ظَبْيَانَ عَنْ أَبِي ذَرٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَأَبُو بَكْرِ بْنُ عَيَّاشٍ كَثِيرُ الْغَلَطِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2568,
			"arabicnumber": 2568,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ، قَالَ سَمِعْتُ رِبْعِيَّ بْنَ حِرَاشٍ، يُحَدِّثُ عَنْ زَيْدِ بْنِ ظَبْيَانَ، يَرْفَعُهُ إِلَى أَبِي ذَرٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ ثَلاَثَةٌ يُحِبُّهُمُ اللَّهُ وَثَلاَثَةٌ يَبْغَضُهُمُ اللَّهُ فَأَمَّا الَّذِينَ يُحِبُّهُمُ اللَّهُ فَرَجُلٌ أَتَى قَوْمًا فَسَأَلَهُمْ بِاللَّهِ وَلَمْ يَسْأَلْهُمْ بِقَرَابَةٍ بَيْنَهُ وَبَيْنَهُمْ فَمَنَعُوهُ فَتَخَلَّفَ رَجُلٌ بِأَعْقَابِهِمْ فَأَعْطَاهُ سِرًّا لاَ يَعْلَمُ بِعَطِيَّتِهِ إِلاَّ اللَّهُ وَالَّذِي أَعْطَاهُ وَقَوْمٌ سَارُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ النَّوْمُ أَحَبَّ إِلَيْهِمْ مِمَّا يُعْدَلُ بِهِ نَزَلُوا فَوَضَعُوا رُءُوسَهُمْ فَقَامَ أَحَدُهُمْ يَتَمَلَّقُنِي وَيَتْلُو آيَاتِي وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَلَقِيَ الْعَدُوَّ فَهُزِمُوا وَأَقْبَلَ بِصَدْرِهِ حَتَّى يُقْتَلَ أَوْ يُفْتَحَ لَهُ ‏.‏ وَالثَّلاَثَةُ الَّذِينَ يَبْغَضُهُمُ اللَّهُ الشَّيْخُ الزَّانِي وَالْفَقِيرُ الْمُخْتَالُ وَالْغَنِيُّ الظَّلُومُ ‏\"‏ ‏.‏ حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، عَنْ شُعْبَةَ، نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَهَكَذَا رَوَى شَيْبَانُ، عَنْ مَنْصُورٍ، نَحْوَ هَذَا وَهَذَا أَصَحُّ مِنْ حَدِيثِ أَبِي بَكْرِ بْنِ عَيَّاشٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2569,
			"arabicnumber": 2569,
			"text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَدِّهِ، حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُوشِكُ الْفُرَاتُ يَحْسِرُ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلاَ يَأْخُذْ مِنْهُ شَيْئًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2570,
			"arabicnumber": 2570,
			"text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ إِلاَّ أَنَّهُ قَالَ ‏ \"‏ يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2571,
			"arabicnumber": 2571,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا الْجُرَيْرِيُّ، عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ فِي الْجَنَّةِ بَحْرَ الْمَاءِ وَبَحْرَ الْعَسَلِ وَبَحْرَ اللَّبَنِ وَبَحْرَ الْخَمْرِ ثُمَّ تُشَقَّقُ الأَنْهَارُ بَعْدُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَحَكِيمُ بْنُ مُعَاوِيَةَ هُوَ وَالِدُ بَهْزِ بْنِ حَكِيمٍ وَالْجُرَيْرِيُّ يُكْنَى أَبَا مَسْعُودٍ وَاسْمُهُ سَعِيدُ بْنُ إِيَاسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2572,
			"arabicnumber": 2572,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ سَأَلَ اللَّهَ الْجَنَّةَ ثَلاَثَ مَرَّاتٍ قَالَتِ الْجَنَّةُ اللَّهُمَّ أَدْخِلْهُ الْجَنَّةَ ‏.‏ وَمَنِ اسْتَجَارَ مِنَ النَّارِ ثَلاَثَ مَرَّاتٍ قَالَتِ النَّارُ اللَّهُمَّ أَجِرْهُ مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ هَكَذَا رَوَى يُونُسُ بْنُ أَبِي إِسْحَاقَ عَنْ أَبِي إِسْحَاقَ هَذَا الْحَدِيثَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ وَقَدْ رُوِيَ عَنْ أَبِي إِسْحَاقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسِ بْنِ مَالِكٍ مَوْقُوفًا أَيْضًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2735,
			"arabicnumber": 2735,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا مُوسَى بْنُ مَسْعُودٍ أَبُو حُذَيْفَةَ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ عِكْرِمَةَ بْنِ أَبِي جَهْلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ جِئْتُهُ ‏ \"‏ مَرْحَبًا بِالرَّاكِبِ الْمُهَاجِرِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ بُرَيْدَةَ وَابْنِ عَبَّاسٍ وَأَبِي جُحَيْفَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِصَحِيحٍ لاَ نَعْرِفُهُ مِثْلَ هَذَا إِلاَّ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ مُوسَى بْنِ مَسْعُودٍ عَنْ سُفْيَانَ ‏.‏ وَمُوسَى بْنُ مَسْعُودٍ ضَعِيفٌ فِي الْحَدِيثِ ‏.‏ وَرَوَى هَذَا الْحَدِيثَ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَاقَ مُرْسَلاً وَلَمْ يَذْكُرْ فِيهِ عَنْ مُصْعَبِ بْنِ سَعْدٍ ‏.‏ وَهَذَا أَصَحُّ ‏.‏ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ بَشَّارٍ يَقُولُ مُوسَى بْنُ مَسْعُودٍ ضَعِيفٌ فِي الْحَدِيثِ ‏.‏ قَالَ مُحَمَّدُ بْنُ بَشَّارٍ وَكَتَبْتُ كَثِيرًا عَنْ مُوسَى بْنِ مَسْعُودٍ ثُمَّ تَرَكْتُهُ ‏.‏ كَمُلَ كِتَابُ الاِسْتِئْذَانِ وَيَتْلُوهُ كِتَابُ الأَدَبِ",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 13
			}
		}
	]
}