{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"43": "Chapters on Manners"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2736,
			"arabicnumber": 2736,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ بِالْمَعْرُوفِ يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَعُودُهُ إِذَا مَرِضَ وَيَتْبَعُ جَنَازَتَهُ إِذَا مَاتَ وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَأَبِي أَيُّوبَ وَالْبَرَاءِ وَأَبِي مَسْعُودٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَقَدْ تَكَلَّمَ بَعْضُهُمْ فِي الْحَارِثِ الأَعْوَرِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْمَخْزُومِيُّ الْمَدَنِيُّ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِلْمُؤْمِنِ عَلَى الْمُؤْمِنِ سِتُّ خِصَالٍ يَعُودُهُ إِذَا مَرِضَ وَيَشْهَدُهُ إِذَا مَاتَ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَنْصَحُ لَهُ إِذَا غَابَ أَوْ شَهِدَ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَمُحَمَّدُ بْنُ مُوسَى الْمَخْزُومِيُّ الْمَدَنِيُّ ثِقَةٌ رَوَى عَنْهُ عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ وَابْنُ أَبِي فُدَيْكٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2738,
			"arabicnumber": 2738,
			"text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ، حَدَّثَنَا حَضْرَمِيٌّ، مَوْلَى آلِ الْجَارُودِ عَنْ نَافِعٍ، أَنَّ رَجُلاً، عَطَسَ إِلَى جَنْبِ ابْنِ عُمَرَ فَقَالَ الْحَمْدُ لِلَّهِ وَالسَّلاَمُ عَلَى رَسُولِ اللَّهِ ‏.‏ قَالَ ابْنُ عُمَرَ وَأَنَا أَقُولُ الْحَمْدُ لِلَّهِ وَالسَّلاَمُ عَلَى رَسُولِ اللَّهِ وَلَيْسَ هَكَذَا عَلَّمَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَّمَنَا أَنْ نَقُولَ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ زِيَادِ بْنِ الرَّبِيعِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2739,
			"arabicnumber": 2739,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ حَكِيمِ بْنِ دَيْلَمَ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِي مُوسَى، قَالَ كَانَ الْيَهُودُ يَتَعَاطَسُونَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم يَرْجُونَ أَنْ يَقُولَ لَهُمْ يَرْحَمُكُمُ اللَّهُ ‏.‏ فَيَقُولُ ‏ \"‏ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ عَلِيٍّ وَأَبِي أَيُّوبَ وَسَالِمِ بْنِ عُبَيْدٍ وَعَبْدِ اللَّهِ بْنِ جَعْفَرٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2740,
			"arabicnumber": 2740,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ سَالِمِ بْنِ عُبَيْدٍ، أَنَّهُ كَانَ مَعَ الْقَوْمِ فِي سَفَرٍ فَعَطَسَ رَجُلٌ مِنَ الْقَوْمِ فَقَالَ السَّلاَمُ عَلَيْكُمْ ‏.‏ فَقَالَ عَلَيْكَ وَعَلَى أُمِّكَ فَكَأَنَّ الرَّجُلَ وَجِدَ فِي نَفْسِهِ فَقَالَ أَمَا إِنِّي لَمْ أَقُلْ إِلاَّ مَا قَالَ النَّبِيُّ صلى الله عليه وسلم عَطَسَ رَجُلٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ السَّلاَمُ عَلَيْكُمْ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ عَلَيْكَ وَعَلَى أُمِّكَ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَلْيَقُلْ لَهُ مَنْ يَرُدُّ عَلَيْهِ يَرْحَمُكَ اللَّهُ وَلْيَقُلْ يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ اخْتَلَفُوا فِي رِوَايَتِهِ عَنْ مَنْصُورٍ وَقَدْ أَدْخَلُوا بَيْنَ هِلاَلِ بْنِ يِسَافٍ وَسَالِمٍ رَجُلاً ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2741,
			"arabicnumber": 2741,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، أَخْبَرَنِي ابْنُ أَبِي لَيْلَى، عَنْ أَخِيهِ، عِيسَى بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أَبِي أَيُّوبَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ وَلْيَقُلِ الَّذِي يَرُدُّ عَلَيْهِ يَرْحَمُكَ اللَّهُ وَلْيَقُلْ هُوَ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2742,
			"arabicnumber": 2742,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلَيْنِ، عَطَسَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَشَمَّتَ أَحَدَهُمَا وَلَمْ يُشَمِّتِ الآخَرَ فَقَالَ الَّذِي لَمْ يُشَمِّتْهُ يَا رَسُولَ اللَّهِ شَمَّتَّ هَذَا وَلَمْ تُشَمِّتْنِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّهُ حَمِدَ اللَّهَ وَإِنَّكَ لَمْ تَحْمَدِ اللَّهَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2743,
			"arabicnumber": 2743,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الأَكْوَعِ، عَنْ أَبِيهِ، قَالَ عَطَسَ رَجُلٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا شَاهِدٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَرْحَمُكَ اللَّهُ ‏\"‏ ‏.‏ ثُمَّ عَطَسَ الثَّانِيَةَ وَالثَّالِثَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا رَجُلٌ مَزْكُومٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2744,
			"arabicnumber": 2744,
			"text": "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ السَّلُولِيُّ الْكُوفِيُّ، عَنْ عَبْدِ السَّلاَمِ بْنِ حَرْبٍ، عَنْ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ أَبِي خَالِدٍ الدَّالاَنِيِّ، عَنْ عُمَرَ بْنِ إِسْحَاقَ بْنِ أَبِي طَلْحَةَ، عَنْ أُمِّهِ، عَنْ أَبِيهَا، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُشَمَّتُ الْعَاطِسُ ثَلاَثًا فَإِنْ زَادَ فَإِنْ شِئْتَ فَشَمِّتْهُ وَإِنْ شِئْتَ فَلاَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَإِسْنَادُهُ مَجْهُولٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2745,
			"arabicnumber": 2745,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ وَزِيرٍ الْوَاسِطِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا عَطَسَ غَطَّى وَجْهَهُ بِيَدِهِ أَوْ بِثَوْبِهِ وَغَضَّ بِهَا صَوْتَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2746,
			"arabicnumber": 2746,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ عَجْلاَنَ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعُطَاسُ مِنَ اللَّهِ وَالتَّثَاؤُبُ مِنَ الشَّيْطَانِ فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَضَعْ يَدَهُ عَلَى فِيهِ وَإِذَا قَالَ آهْ آهْ فَإِنَّ الشَّيْطَانَ يَضْحَكُ مِنْ جَوْفِهِ وَإِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ وَيَكْرَهُ التَّثَاؤُبَ فَإِذَا قَالَ الرَّجُلُ آهْ آهْ إِذَا تَثَاءَبَ فَإِنَّ الشَّيْطَانَ يَضْحَكُ فِي جَوْفِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2747,
			"arabicnumber": 2747,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ وَيَكْرَهُ التَّثَاؤُبَ فَإِذَا عَطَسَ أَحَدُكُمْ فَقَالَ الْحَمْدُ لِلَّهِ فَحَقٌّ عَلَى كُلِّ مَنْ سَمِعَهُ أَنْ يَقُولَ يَرْحَمُكَ اللَّهُ وَأَمَّا التَّثَاؤُبُ فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَرُدَّهُ مَا اسْتَطَاعَ وَلاَ يَقُولَنَّ هَاهْ هَاهْ فَإِنَّمَا ذَلِكَ مِنَ الشَّيْطَانِ يَضْحَكُ مِنْهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَهَذَا أَصَحُّ مِنْ حَدِيثِ ابْنِ عَجْلاَنَ ‏.‏ وَابْنُ أَبِي ذِئْبٍ أَحْفَظُ لِحَدِيثِ سَعِيدٍ الْمَقْبُرِيِّ وَأَثْبَتُ مِنْ مُحَمَّدِ بْنِ عَجْلاَنَ ‏.‏ قَالَ سَمِعْتُ أَبَا بَكْرٍ الْعَطَّارَ الْبَصْرِيَّ يَذْكُرُ عَنْ عَلِيِّ بْنِ الْمَدِينِيِّ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ قَالَ مُحَمَّدُ بْنُ عَجْلاَنَ أَحَادِيثُ سَعِيدٍ الْمَقْبُرِيِّ رَوَى بَعْضَهَا سَعِيدٌ عَنْ أَبِي هُرَيْرَةَ وَرَوَى بَعْضَهَا سَعِيدٌ عَنْ رَجُلٍ عَنْ أَبِي هُرَيْرَةَ فَاخْتَلَطَتْ عَلَىَّ فَجَعَلْتُهَا عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2748,
			"arabicnumber": 2748,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ أَبِي الْيَقْظَانِ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، رَفَعَهُ قَالَ ‏ \"‏ الْعُطَاسُ وَالنُّعَاسُ وَالتَّثَاؤُبُ فِي الصَّلاَةِ وَالْحَيْضُ وَالْقَىْءُ وَالرُّعَافُ مِنَ الشَّيْطَانِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ شَرِيكٍ عَنْ أَبِي الْيَقْظَانِ ‏.‏ قَالَ وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قُلْتُ لَهُ مَا اسْمُ جَدِّ عَدِيٍّ قَالَ لاَ أَدْرِي ‏.‏ وَذُكِرَ عَنْ يَحْيَى بْنِ مَعِينٍ قَالَ اسْمُهُ دِينَارٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2749,
			"arabicnumber": 2749,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُقِمْ أَحَدُكُمْ أَخَاهُ مِنْ مَجْلِسِهِ ثُمَّ يَجْلِسُ فِيهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2750,
			"arabicnumber": 2750,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يُقِمْ أَحَدُكُمْ أَخَاهُ مِنْ مَجْلِسِهِ ثُمَّ يَجْلِسُ فِيهِ ‏\"‏ ‏.‏ قَالَ وَكَانَ الرَّجُلُ يَقُومُ لاِبْنِ عُمَرَ فَلاَ يَجْلِسُ فِيهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2751,
			"arabicnumber": 2751,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، عَنْ وَهْبِ بْنِ حُذَيْفَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الرَّجُلُ أَحَقُّ بِمَجْلِسِهِ وَإِنْ خَرَجَ لِحَاجَتِهِ ثُمَّ عَادَ فَهُوَ أَحَقُّ بِمَجْلِسِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي بَكْرَةَ وَأَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2752,
			"arabicnumber": 2752,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا أُسَامَةُ بْنُ زَيْدٍ، حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحِلُّ لِلرَّجُلِ أَنْ يُفَرِّقَ بَيْنَ اثْنَيْنِ إِلاَّ بِإِذْنِهِمَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ عَامِرٌ الأَحْوَلُ عَنْ عَمْرِو بْنِ شُعَيْبٍ أَيْضًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2753,
			"arabicnumber": 2753,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي مِجْلَزٍ، أَنَّ رَجُلاً، قَعَدَ وَسْطَ حَلْقَةٍ فَقَالَ حُذَيْفَةُ مَلْعُونٌ عَلَى لِسَانِ مُحَمَّدٍ أَوْ لَعَنَ اللَّهُ عَلَى لِسَانِ مُحَمَّدٍ صلى الله عليه وسلم - مَنْ قَعَدَ وَسْطَ الْحَلْقَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو مِجْلَزٍ اسْمُهُ لاَحِقُ بْنُ حُمَيْدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2754,
			"arabicnumber": 2754,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا عَفَّانُ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ لَمْ يَكُنْ شَخْصٌ أَحَبَّ إِلَيْهِمْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ وَكَانُوا إِذَا رَأَوْهُ لَمْ يَقُومُوا لِمَا يَعْلَمُونَ مِنْ كَرَاهِيَتِهِ لِذَلِكَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2755,
			"arabicnumber": 2755,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنْ أَبِي مِجْلَزٍ، قَالَ خَرَجَ مُعَاوِيَةُ فَقَامَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ وَابْنُ صَفْوَانَ حِينَ رَأَوْهُ ‏.‏ فَقَالَ اجْلِسَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ سَرَّهُ أَنْ يَتَمَثَّلَ لَهُ الرِّجَالُ قِيَامًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي أُمَامَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنْ أَبِي مِجْلَزٍ، عَنْ مُعَاوِيَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2756,
			"arabicnumber": 2756,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ الْخَلاَّلُ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خَمْسٌ مِنَ الْفِطْرَةِ الاِسْتِحْدَادُ وَالْخِتَانُ وَقَصُّ الشَّارِبِ وَنَتْفُ الإِبْطِ وَتَقْلِيمُ الأَظْفَارِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2757,
			"arabicnumber": 2757,
			"text": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ مُصْعَبِ بْنِ شَيْبَةَ، عَنْ طَلْقِ بْنِ حَبِيبٍ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ عَشْرٌ مِنَ الْفِطْرَةِ قَصُّ الشَّارِبِ وَإِعْفَاءُ اللِّحْيَةِ وَالسِّوَاكُ وَالاِسْتِنْشَاقُ وَقَصُّ الأَظْفَارِ وَغَسْلُ الْبَرَاجِمِ وَنَتْفُ الإِبْطِ وَحَلْقُ الْعَانَةِ وَانْتِقَاصُ الْمَاءِ ‏\"‏ ‏.‏ قَالَ زَكَرِيَّا قَالَ مُصْعَبٌ وَنَسِيتُ الْعَاشِرَةَ إِلاَّ أَنْ تَكُونَ الْمَضْمَضَةَ ‏.‏ قَالَ أَبُو عُبَيْدٍ انْتِقَاصُ الْمَاءِ الاِسْتِنْجَاءُ بِالْمَاءِ ‏.‏ وَفِي الْبَابِ عَنْ عَمَّارِ بْنِ يَاسِرٍ وَابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2758,
			"arabicnumber": 2758,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى أَبُو مُحَمَّدٍ، صَاحِبُ الدَّقِيقِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ وَقَّتَ لَهُمْ فِي كُلِّ أَرْبَعِينَ لَيْلَةً تَقْلِيمَ الأَظْفَارِ وَأَخْذَ الشَّارِبِ وَحَلْقَ الْعَانَةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2759,
			"arabicnumber": 2759,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ وَقَّتَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي قَصِّ الشَّارِبِ وَتَقْلِيمِ الأَظْفَارِ وَحَلْقِ الْعَانَةِ وَنَتْفِ الإِبْطِ أَنْ لاَ نَتْرُكَ أَكْثَرَ مِنْ أَرْبَعِينَ يَوْمًا ‏.‏ قَالَ هَذَا أَصَحُّ مِنْ حَدِيثِ الأَوَّلِ ‏.‏ وَصَدَقَةُ بْنُ مُوسَى لَيْسَ عِنْدَهُمْ بِالْحَافِظِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2760,
			"arabicnumber": 2760,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُصُّ أَوْ يَأْخُذُ مِنْ شَارِبِهِ وَكَانَ إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ يَفْعَلُهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2761,
			"arabicnumber": 2761,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ يُوسُفَ بْنِ صُهَيْبٍ، عَنْ حَبِيبِ بْنِ يَسَارٍ، عَنْ زَيْدِ بْنِ أَرْقَمَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ لَمْ يَأْخُذْ مِنْ شَارِبِهِ فَلَيْسَ مِنَّا ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ يُوسُفَ بْنِ صُهَيْبٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2762,
			"arabicnumber": 2762,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عُمَرُ بْنُ هَارُونَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَأْخُذُ مِنْ لِحْيَتِهِ مِنْ عَرْضِهَا وَطُولِهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَسَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يَقُولُ عُمَرُ بْنُ هَارُونَ مُقَارِبُ الْحَدِيثِ لاَ أَعْرِفُ لَهُ حَدِيثًا لَيْسَ إِسْنَادُهُ أَصْلاً أَوْ قَالَ يَنْفَرِدُ بِهِ إِلاَّ هَذَا الْحَدِيثَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْخُذُ مِنْ لِحْيَتِهِ مِنْ عَرْضِهَا وَطُولِهَا ‏.‏ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عُمَرَ بْنِ هَارُونَ وَرَأَيْتُهُ حَسَنَ الرَّأْىِ فِي عُمَرَ بْنِ هَارُونَ ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ قُتَيْبَةَ يَقُولُ عُمَرُ بْنُ هَارُونَ كَانَ صَاحِبَ حَدِيثٍ وَكَانَ يَقُولُ الإِيمَانُ قَوْلٌ وَعَمَلٌ ‏.‏ قَالَ سَمِعْتُ قُتَيْبَةَ، حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ، عَنْ رَجُلٍ، عَنْ ثَوْرِ بْنِ يَزِيدَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَصَبَ الْمَنْجَنِيقَ عَلَى أَهْلِ الطَّائِفِ ‏.‏ قَالَ قُتَيْبَةُ قُلْتُ لِوَكِيعٍ مَنْ هَذَا قَالَ صَاحِبُكُمْ عُمَرُ بْنُ هَارُونَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2763,
			"arabicnumber": 2763,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَحْفُوا الشَّوَارِبَ وَأَعْفُوا اللِّحَى ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2764,
			"arabicnumber": 2764,
			"text": "حَدَّثَنَا الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَنَا بِإِحْفَاءِ الشَّوَارِبِ وَإِعْفَاءِ اللِّحَى ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو بَكْرِ بْنُ نَافِعٍ هُوَ مَوْلَى ابْنِ عُمَرَ ثِقَةٌ وَعُمَرُ بْنُ نَافِعٍ ثِقَةٌ وَعَبْدُ اللَّهِ بْنُ نَافِعٍ مَوْلَى ابْنِ عُمَرَ يُضَعَّفُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2765,
			"arabicnumber": 2765,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عن عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَعَمُّ عَبَّادِ بْنِ تَمِيمٍ هُوَ عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ الْمَازِنِيُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2766,
			"arabicnumber": 2766,
			"text": "حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ خِدَاشٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا اسْتَلْقَى أَحَدُكُمْ عَلَى ظَهْرِهِ فَلاَ يَضَعْ إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى ‏\"‏ ‏.‏ هَذَا حَدِيثٌ رَوَاهُ غَيْرُ وَاحِدٍ عَنْ سُلَيْمَانَ التَّيْمِيِّ ‏.‏ وَلاَ يُعْرَفُ خِدَاشٌ هَذَا مَنْ هُوَ وَقَدْ رَوَى لَهُ سُلَيْمَانُ التَّيْمِيُّ غَيْرَ حَدِيثٍ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2767,
			"arabicnumber": 2767,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ اشْتِمَالِ الصَّمَّاءِ وَالاِحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ وَأَنْ يَرْفَعَ الرَّجُلُ إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى وَهُوَ مُسْتَلْقٍ عَلَى ظَهْرِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2768,
			"arabicnumber": 2768,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَعَبْدُ الرَّحِيمِ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً مُضْطَجِعًا عَلَى بَطْنِهِ فَقَالَ ‏ \"‏ إِنَّ هَذِهِ ضَجْعَةٌ لاَ يُحِبُّهَا اللَّهُ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ طِهْفَةَ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى وَرَوَى يَحْيَى بْنُ أَبِي كَثِيرٍ هَذَا الْحَدِيثَ عَنْ أَبِي سَلَمَةَ عَنْ يَعِيشَ بْنِ طِهْفَةَ عَنْ أَبِيهِ وَيُقَالُ طِخْفَةُ وَالصَّحِيحُ طِهْفَةُ ‏.‏ وَقَالَ بَعْضُ الْحُفَّاظِ الصَّحِيحُ طِخْفَةُ وَيُقَالُ طِغْفَةُ ‏.‏ يَعِيشُ هُوَ مِنَ الصَّحَابَةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2769,
			"arabicnumber": 2769,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ ‏\"‏ احْفَظْ عَوْرَتَكَ إِلاَّ مِنْ زَوْجَتِكَ أَوْ مِمَّا مَلَكَتْ يَمِينُكَ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ يَكُونُ مَعَ الرَّجُلِ قَالَ ‏\"‏ إِنِ اسْتَطَعْتَ أَنْ لاَ يَرَاهَا أَحَدٌ فَافْعَلْ ‏\"‏ ‏.‏ قُلْتُ وَالرَّجُلُ يَكُونُ خَالِيًا ‏.‏ قَالَ ‏\"‏ فَاللَّهُ أَحَقُّ أَنْ يُسْتَحْيَا مِنْهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَجَدُّ بَهْزٍ اسْمُهُ مُعَاوِيَةُ بْنُ حَيْدَةَ الْقُشَيْرِيُّ وَقَدْ رَوَى الْجُرَيْرِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ وَهُوَ وَالِدُ بَهْزٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2770,
			"arabicnumber": 2770,
			"text": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ الْبَغْدَادِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ الْكُوفِيُّ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مُتَّكِئًا عَلَى وِسَادَةٍ عَلَى يَسَارِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مُتَّكِئًا عَلَى وِسَادَةٍ ‏.‏ وَلَمْ يَذْكُرْ عَلَى يَسَارِهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2771,
			"arabicnumber": 2771,
			"text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مُتَّكِئًا عَلَى وِسَادَةٍ ‏.‏ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2772,
			"arabicnumber": 2772,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، عَنْ أَوْسِ بْنِ ضَمْعَجٍ، عَنْ أَبِي مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُؤَمُّ الرَّجُلُ فِي سُلْطَانِهِ وَلاَ يُجْلَسُ عَلَى تَكْرِمَتِهِ فِي بَيْتِهِ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2773,
			"arabicnumber": 2773,
			"text": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، حَدَّثَنِي أَبِي، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، قَالَ سَمِعْتُ أَبِي بُرَيْدَةَ، يَقُولُ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم يَمْشِي إِذْ جَاءَهُ رَجُلٌ وَمَعَهُ حِمَارٌ فَقَالَ يَا رَسُولَ اللَّهِ ارْكَبْ ‏.‏ وَتَأَخَّرَ الرَّجُلُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لأَنْتَ أَحَقُّ بِصَدْرِ دَابَّتِكَ إِلاَّ أَنْ تَجْعَلَهُ لِي ‏\"‏ ‏.‏ قَالَ قَدْ جَعَلْتُهُ لَكَ ‏.‏ قَالَ فَرَكِبَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَفِي الْبَابِ عَنْ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2774,
			"arabicnumber": 2774,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكُمْ أَنْمَاطٌ ‏\"‏ ‏.‏ قُلْتُ وَأَنَّى تَكُونُ لَنَا أَنْمَاطٌ قَالَ ‏\"‏ أَمَا إِنَّهَا سَتَكُونُ لَكُمْ أَنْمَاطٌ ‏\"‏ ‏.‏ قَالَ فَأَنَا أَقُولُ لاِمْرَأَتِي أَخِّرِي عَنِّي أَنْمَاطَكِ فَتَقُولُ أَلَمْ يَقُلِ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهَا سَتَكُونُ لَكُمْ أَنْمَاطٌ ‏\"‏ ‏.‏ قَالَ فَأَدَعُهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2775,
			"arabicnumber": 2775,
			"text": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ بْنُ عَبْدِ الْعَظِيمِ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، هُوَ الْجُرَشِيُّ الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، قَالَ لَقَدْ قُدْتُ نَبِيَّ اللَّهِ صلى الله عليه وسلم وَالْحَسَنَ وَالْحُسَيْنَ عَلَى بَغْلَتِهِ الشَّهْبَاءِ حَتَّى أَدْخَلْتُهُ حُجْرَةَ النَّبِيِّ صلى الله عليه وسلم هَذَا قُدَّامُهُ وَهَذَا خَلْفُهُ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَعَبْدِ اللَّهِ بْنِ جَعْفَرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2776,
			"arabicnumber": 2776,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ نَظْرَةِ الْفَجْأَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِي ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو زُرْعَةَ بْنُ عَمْرٍو اسْمُهُ هَرِمٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2777,
			"arabicnumber": 2777,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ أَبِي رَبِيعَةَ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، رَفَعَهُ قَالَ ‏ \"‏ يَا عَلِيُّ لاَ تُتْبِعِ النَّظْرَةَ النَّظْرَةَ فَإِنَّ لَكَ الأُولَى وَلَيْسَتْ لَكَ الآخِرَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ شَرِيكٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2778,
			"arabicnumber": 2778,
			"text": "حَدَّثَنَا سُوَيْدٌ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ نَبْهَانَ، مَوْلَى أُمِّ سَلَمَةَ أَنَّهُ حَدَّثَهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهُ أَنَّهَا، كَانَتْ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَيْمُونَةُ قَالَتْ فَبَيْنَا نَحْنُ عِنْدَهُ أَقْبَلَ ابْنُ أُمِّ مَكْتُومٍ فَدَخَلَ عَلَيْهِ وَذَلِكَ بَعْدَ مَا أُمِرْنَا بِالْحِجَابِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجِبَا مِنْهُ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلَيْسَ هُوَ أَعْمَى لاَ يُبْصِرُنَا وَلاَ يَعْرِفُنَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفَعَمْيَاوَانِ أَنْتُمَا أَلَسْتُمَا تُبْصِرَانِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2779,
			"arabicnumber": 2779,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ ذَكْوَانَ، عَنْ مَوْلَى، عَمْرِو بْنِ الْعَاصِي أَنَّ عَمْرَو بْنَ الْعَاصِي، أَرْسَلَهُ إِلَى عَلِيٍّ يَسْتَأْذِنُهُ عَلَى أَسْمَاءَ بِنْتِ عُمَيْسٍ فَأَذِنَ لَهُ حَتَّى إِذَا فَرَغَ مِنْ حَاجَتِهِ سَأَلَ الْمَوْلَى عَمْرَو بْنَ الْعَاصِي عَنْ ذَلِكَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا أَنْ نَدْخُلَ عَلَى النِّسَاءِ بِغَيْرِ إِذْنِ أَزْوَاجِهِنَّ ‏.‏ وَفِي الْبَابِ عَنْ عُقْبَةَ بْنِ عَامِرٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2780,
			"arabicnumber": 2780,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، وَسَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا تَرَكْتُ بَعْدِي فِي النَّاسِ فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ مِنَ الثِّقَاتِ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرُوا فِيهِ عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ وَلاَ نَعْلَمُ أَحَدًا قَالَ عَنْ أُسَامَةَ بْنِ زَيْدٍ وَسَعِيدِ بْنِ زَيْدٍ غَيْرَ الْمُعْتَمِرِ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي سَعِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2781,
			"arabicnumber": 2781,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ مُعَاوِيَةَ، بِالْمَدِينَةِ يَخْطُبُ يَقُولُ أَيْنَ عُلَمَاؤُكُمْ يَا أَهْلَ الْمَدِينَةِ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ هَذِهِ الْقُصَّةِ وَيَقُولُ ‏ \"‏ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَهَا نِسَاؤُهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ مُعَاوِيَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2782,
			"arabicnumber": 2782,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَعَنَ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ وَالْمُتَنَمِّصَاتِ مُبْتَغِيَاتٍ لِلْحُسْنِ مُغَيِّرَاتٍ خَلْقَ اللَّهِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ شُعْبَةُ وَغَيْرُ وَاحِدٍ مِنَ الأَئِمَّةِ عَنْ مَنْصُورٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2783,
			"arabicnumber": 2783,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ ‏\"‏ ‏.‏ قَالَ نَافِعٌ الْوَشْمُ فِي اللِّثَةِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ عَائِشَةَ وَمَعْقِلِ بْنِ يَسَارٍ وَأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ وَابْنِ عَبَّاسٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2784,
			"arabicnumber": 2784,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، وَهَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُتَشَبِّهَاتِ بِالرِّجَالِ مِنَ النِّسَاءِ وَالْمُتَشَبِّهِينَ بِالنِّسَاءِ مِنَ الرِّجَالِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2785,
			"arabicnumber": 2785,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، وَأَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُخَنَّثِينَ مِنَ الرِّجَالِ وَالْمُتَرَجِّلاَتِ مِنَ النِّسَاءِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ عَائِشَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2786,
			"arabicnumber": 2786,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ ثَابِتِ بْنِ عِمَارَةَ الْحَنَفِيِّ، عَنْ غُنَيْمِ بْنِ قَيْسٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ عَيْنٍ زَانِيَةٌ وَالْمَرْأَةُ إِذَا اسْتَعْطَرَتْ فَمَرَّتْ بِالْمَجْلِسِ فَهِيَ كَذَا وَكَذَا يَعْنِي زَانِيَةً ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2787,
			"arabicnumber": 2787,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ رَجُلٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ خَيْرَ طِيبِ الرَّجُلِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَخَيْرَ طِيبِ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ ‏\"‏ ‏.‏ وَنَهَى عَنْ مِيثَرَةِ الأُرْجُوَانِ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2789,
			"arabicnumber": 2789,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ، عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ أَنَسٌ لاَ يَرُدُّ الطِّيبَ ‏.‏ وَقَالَ أَنَسٌ إِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَرُدُّ الطِّيبَ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": 2790,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ثَلاَثٌ لاَ تُرَدُّ الْوَسَائِدُ وَالدُّهْنُ وَاللَّبَنُ ‏\"‏ ‏.‏ الدُّهْنُ يَعْنِي بِهِ الطِّيبَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَعَبْدُ اللَّهِ هُوَ ابْنُ مُسْلِمِ بْنِ جُنْدَبٍ وَهُوَ مَدَنِيٌّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2791,
			"arabicnumber": 2791,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلِيفَةَ أَبُو عَبْدِ اللَّهِ، - بَصْرِيٌّ - وَعَمْرُو بْنُ عَلِيٍّ قَالاَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ حَجَّاجٍ الصَّوَّافِ، عَنْ حَنَانٍ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أُعْطِيَ أَحَدُكُمُ الرَّيْحَانَ فَلاَ يَرُدَّهُ فَإِنَّهُ خَرَجَ مِنَ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَلاَ نَعْرِفُ حَنَانًا إِلاَّ فِي هَذَا الْحَدِيثِ وَأَبُو عُثْمَانَ النَّهْدِيُّ اسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ مُلٍّ وَقَدْ أَدْرَكَ زَمَنَ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَرَهُ وَلَمْ يَسْمَعْ مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2792,
			"arabicnumber": 2792,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ حَتَّى تَصِفَهَا لِزَوْجِهَا كَأَنَّمَا يَنْظُرُ إِلَيْهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2793,
			"arabicnumber": 2793,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، أَخْبَرَنِي الضَّحَّاكُ بْنُ عُثْمَانَ، أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَنْظُرُ الرَّجُلُ إِلَى عَوْرَةِ الرَّجُلِ وَلاَ تَنْظُرُ الْمَرْأَةُ إِلَى عَوْرَةِ الْمَرْأَةِ وَلاَ يُفْضِي الرَّجُلُ إِلَى الرَّجُلِ فِي الثَّوْبِ الْوَاحِدِ وَلاَ تُفْضِي الْمَرْأَةُ إِلَى الْمَرْأَةِ فِي الثَّوْبِ الْوَاحِدِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2794,
			"arabicnumber": 2794,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، وَيَزِيدُ بْنُ هَارُونَ، قَالاَ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ ‏\"‏ احْفَظْ عَوْرَتَكَ إِلاَّ مِنْ زَوْجَتِكَ أَوْ مَا مَلَكَتْ يَمِينُكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِذَا كَانَ الْقَوْمُ بَعْضُهُمْ فِي بَعْضٍ قَالَ ‏\"‏ إِنِ اسْتَطَعْتَ أَنْ لاَ يَرَاهَا أَحَدٌ فَلاَ يَرَيَنَّهَا ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ إِذَا كَانَ أَحَدُنَا خَالِيًا قَالَ ‏\"‏ فَاللَّهُ أَحَقُّ أَنْ يَسْتَحْيِيَ مِنْهُ النَّاسُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2796,
			"arabicnumber": 2796,
			"text": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى الْكُوفِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْفَخِذُ عَوْرَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2797,
			"arabicnumber": 2797,
			"text": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنِ الْحَسَنِ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ عَبْدِ اللَّهِ بْنِ جَرْهَدٍ الأَسْلَمِيِّ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْفَخِذُ عَوْرَةٌ ‏\"‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَفِي الْبَابِ عَنْ عَلِيٍّ وَمُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍ وَلِعَبْدِ اللَّهِ بْنِ جَحْشٍ صُحْبَةٌ وَلاِبْنِهِ مُحَمَّدٍ صُحْبَةٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2798,
			"arabicnumber": 2798,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَبِي الزِّنَادِ، أَخْبَرَنِي ابْنُ جَرْهَدٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِهِ وَهُوَ كَاشِفٌ عَنْ فَخِذِهِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ غَطِّ فَخِذَكَ فَإِنَّهَا مِنَ الْعَوْرَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2799,
			"arabicnumber": 2799,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا خَالِدُ بْنُ إِلْيَاسَ، وَيُقَالُ ابْنُ إِيَاسٍ، عَنْ صَالِحِ بْنِ أَبِي حَسَّانَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ إِنَّ اللَّهَ طَيِّبٌ يُحِبُّ الطَّيِّبَ نَظِيفٌ يُحِبُّ النَّظَافَةَ كَرِيمٌ يُحِبُّ الْكَرَمَ جَوَادٌ يُحِبُّ الْجُودَ فَنَظِّفُوا أُرَاهُ قَالَ أَفْنِيَتَكُمْ وَلاَ تَشَبَّهُوا بِالْيَهُودِ ‏.‏ قَالَ فَذَكَرْتُ ذَلِكَ لِمُهَاجِرِ بْنِ مِسْمَارٍ فَقَالَ حَدَّثَنِيهِ عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ إِلاَّ أَنَّهُ قَالَ نَظِّفُوا أَفْنِيَتَكُمْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَخَالِدُ بْنُ إِلْيَاسَ يُضَعَّفُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2800,
			"arabicnumber": 2800,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ نِيْزَكَ الْبَغْدَادِيُّ، حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا أَبُو مُحَيَّاةَ، عَنْ لَيْثٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِيَّاكُمْ وَالتَّعَرِّي فَإِنَّ مَعَكُمْ مَنْ لاَ يُفَارِقُكُمْ إِلاَّ عِنْدَ الْغَائِطِ وَحِينَ يُفْضِي الرَّجُلُ إِلَى أَهْلِهِ فَاسْتَحْيُوهُمْ وَأَكْرِمُوهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ وَأَبُو مُحَيَّاةَ اسْمُهُ يَحْيَى بْنُ يَعْلَى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2801,
			"arabicnumber": 2801,
			"text": "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ، حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ، عَنِ الْحَسَنِ بْنِ صَالِحٍ، عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ، عَنْ طَاوُسٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَدْخُلِ الْحَمَّامَ بِغَيْرِ إِزَارٍ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يُدْخِلْ حَلِيلَتَهُ الْحَمَّامَ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَجْلِسْ عَلَى مَائِدَةٍ يُدَارُ عَلَيْهَا بِالْخَمْرِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ طَاوُسٍ عَنْ جَابِرٍ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ لَيْثُ بْنُ أَبِي سُلَيْمٍ صَدُوقٌ وَرُبَّمَا يَهِمُ فِي الشَّىْءِ ‏.‏ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ وَقَالَ أَحْمَدُ بْنُ حَنْبَلٍ لَيْثٌ لاَ يُفْرَحُ بِحَدِيثِهِ كَانَ لَيْثٌ يَرْفَعُ أَشْيَاءَ لاَ يَرْفَعُهَا غَيْرُهُ فَلِذَلِكَ ضَعَّفُوهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2802,
			"arabicnumber": 2802,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ الأَعْرَجِ، عَنْ أَبِي عُذْرَةَ، وَكَانَ، قَدْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى الرِّجَالَ وَالنِّسَاءَ عَنِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ فِي الْمَيَازِرِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ وَإِسْنَادُهُ لَيْسَ بِذَاكَ الْقَائِمِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2803,
			"arabicnumber": 2803,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، أَنْبَأَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، قَالَ سَمِعْتُ سَالِمَ بْنَ أَبِي الْجَعْدِ، يُحَدِّثُ عَنْ أَبِي الْمَلِيحِ الْهُذَلِيِّ، أَنَّ نِسَاءً، مِنْ أَهْلِ حِمْصَ أَوْ مِنْ أَهْلِ الشَّامِ دَخَلْنَ عَلَى عَائِشَةَ فَقَالَتْ أَنْتُنَّ اللاَّتِي يَدْخُلْنَ نِسَاؤُكُنَّ الْحَمَّامَاتِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنِ امْرَأَةٍ تَضَعُ ثِيَابَهَا فِي غَيْرِ بَيْتِ زَوْجِهَا إِلاَّ هَتَكَتِ السِّتْرَ بَيْنَهَا وَبَيْنَ رَبِّهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2804,
			"arabicnumber": 2804,
			"text": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، وَعَبْدُ بْنُ حُمَيْدٍ، وَغَيْرُ، وَاحِدٍ، وَاللَّفْظُ، لِلْحَسَنِ بْنِ عَلِيٍّ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ سَمِعْتُ أَبَا طَلْحَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةُ تَمَاثِيلَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2805,
			"arabicnumber": 2805,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ رَافِعَ بْنَ إِسْحَاقَ، أَخْبَرَهُ قَالَ دَخَلْتُ أَنَا وَعَبْدُ اللَّهِ بْنُ أَبِي طَلْحَةَ، عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ نَعُودُهُ فَقَالَ أَبُو سَعِيدٍ أَخْبَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ تَمَاثِيلُ أَوْ صُورَةٌ ‏.‏ شَكَّ إِسْحَاقُ لاَ يَدْرِي أَيُّهُمَا قَالَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2806,
			"arabicnumber": 2806,
			"text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، حَدَّثَنَا مُجَاهِدٌ، قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَتَانِي جِبْرِيلُ فَقَالَ إِنِّي كُنْتُ أَتَيْتُكَ الْبَارِحَةَ فَلَمْ يَمْنَعْنِي أَنْ أَكُونَ دَخَلْتُ عَلَيْكَ الْبَيْتَ الَّذِي كُنْتَ فِيهِ إِلاَّ أَنَّهُ كَانَ فِي بَابِ الْبَيْتِ تِمْثَالُ الرِّجَالِ وَكَانَ فِي الْبَيْتِ قِرَامُ سِتْرٍ فِيهِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ كَلْبٌ فَمُرْ بِرَأْسِ التِّمْثَالِ الَّذِي بِالْبَابِ فَلْيُقْطَعْ فَيَصِيرَ كَهَيْئَةِ الشَّجَرَةِ وَمُرْ بِالسِّتْرِ فَلْيُقْطَعْ وَيُجْعَلْ مِنْهُ وِسَادَتَيْنِ مُنْتَبَذَتَيْنِ يُوَطَآنِ وَمُرْ بِالْكَلْبِ فَيُخْرَجْ ‏\"‏ ‏.‏ فَفَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ ذَلِكَ الْكَلْبُ جَرْوًا لِلْحَسَنِ أَوِ الْحُسَيْنِ تَحْتَ نَضَدٍ لَهُ فَأَمَرَ بِهِ فَأُخْرِجَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ عَائِشَةَ وَأَبِي طَلْحَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2807,
			"arabicnumber": 2807,
			"text": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الْبَغْدَادِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ مَرَّ رَجُلٌ وَعَلَيْهِ ثَوْبَانِ أَحْمَرَانِ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَلَمْ يَرُدَّ النَّبِيُّ صلى الله عليه وسلم عَلَيْهِ السَّلاَمَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَمَعْنَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُمْ كَرِهُوا لُبْسَ الْمُعَصْفَرِ وَرَأَوْا أَنَّ مَا صُبِغَ بِالْحُمْرَةِ بِالْمَدَرِ أَوْ غَيْرِ ذَلِكَ فَلاَ بَأْسَ بِهِ إِذَا لَمْ يَكُنْ مُعَصْفَرًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2808,
			"arabicnumber": 2808,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ هُبَيْرَةَ بْنِ يَرِيمَ، قَالَ قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ خَاتِمِ الذَّهَبِ وَعَنِ الْقَسِّيِّ وَعَنِ الْمِيثَرَةِ وَعَنِ الْجَعَةِ ‏.‏ قَالَ أَبُو الأَحْوَصِ وَهُوَ شَرَابٌ يُتَّخَذُ بِمِصْرَ مِنَ الشَّعِيرِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Matn"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2809,
			"arabicnumber": 2809,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِاتِّبَاعِ الْجَنَازَةِ وَعِيَادَةِ الْمَرِيضِ وَتَشْمِيتِ الْعَاطِسِ وَإِجَابَةِ الدَّاعِي وَنَصْرِ الْمَظْلُومِ وَإِبْرَارِ الْقَسَمِ وَرَدِّ السَّلاَمِ وَنَهَانَا عَنْ سَبْعٍ عَنْ خَاتِمِ الذَّهَبِ أَوْ حَلْقَةِ الذَّهَبِ وَآنِيَةِ الْفِضَّةِ وَلُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَالإِسْتَبْرَقِ وَالْقَسِّيِّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَشْعَثُ بْنُ سُلَيْمٍ هُوَ أَشْعَثُ بْنُ أَبِي الشَّعْثَاءِ وَأَبُو الشَّعْثَاءِ اسْمُهُ سُلَيْمُ بْنُ الأَسْوَدِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2810,
			"arabicnumber": 2810,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْبَسُوا الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَابْنِ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2811,
			"arabicnumber": 2811,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ، عَنِ الأَشْعَثِ، وَهُوَ ابْنُ سَوَّارٍ عَنْ أَبِي إِسْحَاقَ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي لَيْلَةٍ إِضْحِيَانٍ فَجَعَلْتُ أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِلَى الْقَمَرِ وَعَلَيْهِ حُلَّةٌ حَمْرَاءُ فَإِذَا هُوَ عِنْدِي أَحْسَنُ مِنَ الْقَمَرِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ الأَشْعَثِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2812,
			"arabicnumber": 2812,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِيهِ، عَنْ أَبِي رِمْثَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ إِيَادٍ ‏.‏ وَأَبُو رِمْثَةَ التَّيْمِيُّ يُقَالُ اسْمُهُ حَبِيبُ بْنُ حَيَّانَ وَيُقَالُ اسْمُهُ رِفَاعَةُ بْنُ يَثْرِبِيٍّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2813,
			"arabicnumber": 2813,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، أَخْبَرَنِي أَبِي، عَنْ مُصْعَبِ بْنِ شَيْبَةَ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، قَالَتْ خَرَجَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ غَدَاةٍ وَعَلَيْهِ مِرْطٌ مِنْ شَعَرٍ أَسْوَدَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2814,
			"arabicnumber": 2814,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ الصَّفَّارُ أَبُو عُثْمَانَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حَسَّانَ، أَنَّهُ حَدَّثَتْهُ جَدَّتَاهُ، صَفِيَّةُ بِنْتُ عُلَيْبَةَ وَدُحَيْبَةُ بِنْتُ عُلَيْبَةَ حَدَّثَتَاهُ عَنْ قَيْلَةَ بِنْتِ مَخْرَمَةَ، وَكَانَتَا، رَبِيبَتَيْهَا وَقَيْلَةُ جَدَّةُ أَبِيهِمَا أُمُّ أُمِّهِ أَنَّهَا قَالَتْ قَدِمْنَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَتِ الْحَدِيثَ بِطُولِهِ حَتَّى جَاءَ رَجُلٌ وَقَدِ ارْتَفَعَتِ الشَّمْسُ فَقَالَ السَّلاَمُ عَلَيْكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ وَعَلَيْكَ السَّلاَمُ وَرَحْمَةُ اللَّهِ ‏\"‏ ‏.‏ وَعَلَيْهِ تَعْنِي النَّبِيَّ صلى الله عليه وسلم - أَسْمَالُ مُلَيَّتَيْنِ كَانَتَا بِزَعْفَرَانٍ وَقَدْ نَفَضَتَا وَمَعَ النَّبِيِّ صلى الله عليه وسلم عُسَيْبُ نَخْلَةٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ قَيْلَةَ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عَبْدِ اللَّهِ بْنِ حَسَّانَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2816,
			"arabicnumber": 2816,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، عَنْ شُعْبَةَ، عَنْ عَطَاءِ بْنِ السَّائِبِ، قَالَ سَمِعْتُ أَبَا حَفْصِ بْنَ عُمَرَ، يُحَدِّثُ عَنْ يَعْلَى بْنِ مُرَّةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَبْصَرَ رَجُلاً مُتَخَلِّقًا قَالَ ‏ \"‏ اذْهَبْ فَاغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ لاَ تَعُدْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدِ اخْتَلَفَ بَعْضُهُمْ فِي هَذَا الإِسْنَادِ عَنْ عَطَاءِ بْنِ السَّائِبِ ‏.‏ قَالَ عَلِيٌّ قَالَ يَحْيَى بْنُ سَعِيدٍ مَنْ سَمِعَ مِنْ عَطَاءِ بْنِ السَّائِبِ قَدِيمًا فَسَمَاعُهُ صَحِيحٌ وَسَمَاعُ شُعْبَةَ وَسُفْيَانَ مِنْ عَطَاءِ بْنِ السَّائِبِ صَحِيحٌ إِلاَّ حَدِيثَيْنِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ زَاذَانَ قَالَ شُعْبَةُ سَمِعْتُهُمَا مِنْهُ بِأَخَرَةٍ ‏.‏ قَالَ أَبُو عِيسَى يُقَالُ إِنَّ عَطَاءَ بْنَ السَّائِبِ كَانَ فِي آخِرِ أَمْرِهِ قَدْ سَاءَ حِفْظُهُ ‏.‏ وَفِي الْبَابِ عَنْ عَمَّارٍ وَأَبِي مُوسَى وَأَنَسٍ وَأَبُو حَفْصٍ هُوَ أَبُو حَفْصِ بْنُ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2817,
			"arabicnumber": 2817,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، حَدَّثَنِي مَوْلَى، أَسْمَاءَ عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ، يَذْكُرُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ عَلِيٍّ وَحُذَيْفَةَ وَأَنَسٍ وَغَيْرِ وَاحِدٍ وَقَدْ ذَكَرْنَاهُ فِي كِتَابِ اللِّبَاسِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عُمَرَ ‏.‏ وَمَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ اسْمُهُ عَبْدُ اللَّهِ وَيُكْنَى أَبَا عُمَرَ وَقَدْ رَوَى عَنْهُ عَطَاءُ بْنُ أَبِي رَبَاحٍ وَعَمْرُو بْنُ دِينَارٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2818,
			"arabicnumber": 2818,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَسَمَ أَقْبِيَةً وَلَمْ يُعْطِ مَخْرَمَةَ شَيْئًا فَقَالَ مَخْرَمَةُ يَا بُنَىَّ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَانْطَلَقْتُ مَعَهُ قَالَ ادْخُلْ فَادْعُهُ لِي فَدَعَوْتُهُ لَهُ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم وَعَلَيْهِ قِبَاءٌ مِنْهَا فَقَالَ ‏\"‏ خَبَأْتُ لَكَ هَذَا ‏\"‏ ‏.‏ قَالَ فَنَظَرَ إِلَيْهِ فَقَالَ ‏\"‏ رَضِيَ مَخْرَمَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَابْنُ أَبِي مُلَيْكَةَ اسْمُهُ عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2819,
			"arabicnumber": 2819,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ يُحِبَّ أَنْ يُرَى أَثَرُ نِعْمَتِهِ عَلَى عَبْدِهِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي الأَحْوَصِ عَنْ أَبِيهِ وَعِمْرَانَ بْنِ حُصَيْنٍ وَابْنِ مَسْعُودٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2820,
			"arabicnumber": 2820,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ دَلْهَمِ بْنِ صَالِحٍ، عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّجَاشِيَّ، أَهْدَى إِلَى النَّبِيِّ صلى الله عليه وسلم خُفَّيْنِ أَسْوَدَيْنِ سَاذَجَيْنِ فَلَبِسَهُمَا ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَيْهِمَا ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ دَلْهَمٍ وَقَدْ رَوَاهُ مُحَمَّدُ بْنُ رَبِيعَةَ عَنْ دَلْهَمٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2821,
			"arabicnumber": 2821,
			"text": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، حَدَّثَنَا عَبْدَةُ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ نَتْفِ الشَّيْبِ وَقَالَ ‏ \"‏ إِنَّهُ نُورُ الْمُسْلِمِ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ قَدْ رُوِيَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ وَغَيْرِ وَاحِدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2822,
			"arabicnumber": 2822,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْمُسْتَشَارُ مُؤْتَمَنٌ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ شَيْبَانَ بْنِ عَبْدِ الرَّحْمَنِ النَّحْوِيِّ وَشَيْبَانُ هُوَ صَاحِبُ كِتَابٍ وَهُوَ صَحِيحُ الْحَدِيثِ وَيُكْنَى أَبَا مُعَاوِيَةَ ‏.‏ حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ الْعَطَّارُ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ قَالَ عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ إِنِّي لأُحَدِّثُ الْحَدِيثَ فَمَا أَدَعُ مِنْهُ حَرْفًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2823,
			"arabicnumber": 2823,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ دَاوُدَ بْنِ أَبِي عَبْدِ اللَّهِ، عَنِ ابْنِ جُدْعَانَ، عَنْ جَدَّتِهِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْمُسْتَشَارُ مُؤْتَمَنٌ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أُمِّ سَلَمَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2825,
			"arabicnumber": 2825,
			"text": "حَدَّثَنَا هَنَّادٌ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، ح قَالَ وَحَدَّثَنِي ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا كُنْتُمْ ثَلاَثَةً فَلاَ يَتَنَاجَى اثْنَانِ دُونَ صَاحِبِهِمَا ‏\"‏ ‏.‏ وَقَالَ سُفْيَانُ فِي حَدِيثِهِ ‏\"‏ لاَ يَتَنَاجَى اثْنَانِ دُونَ الثَّالِثِ فَإِنَّ ذَلِكَ يُحْزِنُهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ - وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لاَ يَتَنَاجَى اثْنَانِ دُونَ وَاحِدٍ فَإِنَّ ذَلِكَ يُؤْذِي الْمُؤْمِنَ وَاللَّهُ عَزَّ وَجَلَّ يَكْرَهُ أَذَى الْمُؤْمِنِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ وَابْنِ عَبَّاسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2826,
			"arabicnumber": 2826,
			"text": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى الْكُوفِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَبْيَضَ قَدْ شَابَ وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ وَأَمَرَ لَنَا بِثَلاَثَةَ عَشَرَ قَلُوصًا فَذَهَبْنَا نَقْبِضُهَا فَأَتَانَا مَوْتُهُ فَلَمْ يُعْطُونَا شَيْئًا فَلَمَّا قَامَ أَبُو بَكْرٍ قَالَ مَنْ كَانَتْ لَهُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم عِدَةٌ فَلْيَجِئْ ‏.‏ فَقُمْتُ إِلَيْهِ فَأَخْبَرْتُهُ فَأَمَرَ لَنَا بِهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَى مَرْوَانُ بْنُ مُعَاوِيَةَ هَذَا الْحَدِيثَ بِإِسْنَادٍ لَهُ عَنْ أَبِي جُحَيْفَةَ نَحْوَ هَذَا ‏.‏ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ عَنْ أَبِي جُحَيْفَةَ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ وَلَمْ يَزِيدُوا عَلَى هَذَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2827,
			"arabicnumber": 2827,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، حَدَّثَنَا أَبُو جُحَيْفَةَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ ‏.‏ قَالَ أَبُو عِيسَى وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ نَحْوَ هَذَا ‏.‏ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ وَأَبُو جُحَيْفَةَ اسْمُهُ وَهْبٌ السُّوَائِيُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2828,
			"arabicnumber": 2828,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَلِيٍّ، قَالَ مَا سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم جَمَعَ أَبَوَيْهِ لأَحَدٍ غَيْرَ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2829,
			"arabicnumber": 2829,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّارُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُدْعَانَ، وَيَحْيَى بْنِ سَعِيدٍ، سَمِعَا سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَالَ عَلِيٌّ مَا جَمَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَاهُ وَأُمَّهُ لأَحَدٍ إِلاَّ لِسَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ لَهُ يَوْمَ أُحُدٍ ‏\"‏ ارْمِ فِدَاكَ أَبِي وَأُمِّي ‏\"‏ ‏.‏ وَقَالَ لَهُ ‏\"‏ ارْمِ أَيُّهَا الْغُلاَمُ الْحَزَوَّرُ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ الزُّبَيْرِ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عَلِيٍّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2830,
			"arabicnumber": 2830,
			"text": "وَقَدْ رَوَى غَيْرُ، وَاحِدٍ، هَذَا الْحَدِيثَ عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ جَمَعَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَوَيْهِ يَوْمَ أُحُدٍ قَالَ ‏ \"‏ ارْمِ فِدَاكَ أَبِي وَأُمِّي ‏\"‏ ‏.‏ حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ وَعَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ جَمَعَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَوَيْهِ يَوْمَ أُحُدٍ ‏.‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَكِلاَ الْحَدِيثَيْنِ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2831,
			"arabicnumber": 2831,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا أَبُو عُثْمَانَ، شَيْخٌ لَهُ عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ ‏ \"‏ يَا بُنَىَّ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ الْمُغِيرَةِ وَعُمَرَ بْنِ أَبِي سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ أَنَسٍ ‏.‏ وَأَبُو عُثْمَانَ هَذَا شَيْخٌ ثِقَةٌ وَهُوَ الْجَعْدُ بْنُ عُثْمَانَ وَيُقَالُ ابْنُ دِينَارٍ وَهُوَ بَصْرِيٌّ وَقَدْ رَوَى عَنْهُ يُونُسُ بْنُ عُبَيْدٍ وَغَيْرُ وَاحِدٍ مِنَ الأَئِمَّةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2832,
			"arabicnumber": 2832,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، حَدَّثَنِي عَمِّي، يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا شَرِيكٌ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِتَسْمِيَةِ الْمَوْلُودِ يَوْمَ سَابِعِهِ وَوَضْعِ الأَذَى عَنْهُ وَالْعَقِّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2833,
			"arabicnumber": 2833,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ أَبُو عَمْرٍو الْوَرَّاقُ الْبَصْرِيُّ، حَدَّثَنَا مَعْمَرُ بْنُ سُلَيْمَانَ الرَّقِّيُّ، عَنْ عَلِيِّ بْنِ صَالِحٍ الْمَكِّيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَحَبُّ الأَسْمَاءِ إِلَى اللَّهِ عَزَّ وَجَلَّ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2834,
			"arabicnumber": 2834,
			"text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ الْبَصْرِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ الْعُمَرِيِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَحَبَّ الأَسْمَاءِ إِلَى اللَّهِ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2835,
			"arabicnumber": 2835,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لأَنْهَيَنَّ أَنْ يُسَمَّى رَافِعٌ وَبَرَكَةُ وَيَسَارٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ هَكَذَا رَوَاهُ أَبُو أَحْمَدَ عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ عُمَرَ وَرَوَاهُ غَيْرُهُ عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَأَبُو أَحْمَدَ ثِقَةٌ حَافِظٌ وَالْمَشْهُورُ عِنْدَ النَّاسِ هَذَا الْحَدِيثُ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَيْسَ فِيهِ عَنْ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2836,
			"arabicnumber": 2836,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنِ الرَّبِيعِ بْنِ عُمَيْلَةَ الْفَزَارِيِّ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُسَمِّي غُلاَمَكَ رَبَاحٌ وَلاَ أَفْلَحُ وَلاَ يَسَارٌ وَلاَ نَجِيحٌ يُقَالُ أَثَمَّ هُوَ فَيُقَالُ لاَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2837,
			"arabicnumber": 2837,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَخْنَعُ اسْمٍ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ رَجُلٌ تَسَمَّى بِمَلِكِ الأَمْلاَكِ ‏\"‏ ‏.‏ قَالَ سُفْيَانُ شَاهَانْ شَاهْ وَأَخْنَعُ يَعْنِي أَقْبَحَ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2838,
			"arabicnumber": 2838,
			"text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَأَبُو بَكْرٍ مُحَمَّدُ بْنُ بَشَّارٍ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم غَيَّرَ اسْمَ عَاصِيَةَ وَقَالَ ‏ \"‏ أَنْتِ جَمِيلَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَإِنَّمَا أَسْنَدَهُ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ وَرَوَى بَعْضُهُمْ هَذَا عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ أَنَّ عُمَرَ ‏.‏ وَفِي الْبَابِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَعَبْدِ اللَّهِ بْنِ سَلاَمٍ وَعَبْدِ اللَّهِ بْنِ مُطِيعٍ وَعَائِشَةَ وَالْحَكَمِ بْنِ سَعْدٍ وَمُسْلِمٍ وَأُسَامَةَ بْنِ أَخْدَرِيٍّ وَشُرَيْحِ بْنِ هَانِئٍ عَنْ أَبِيهِ وَخَيْثَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2839,
			"arabicnumber": 2839,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ الْبَصْرِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُغَيِّرُ الاِسْمَ الْقَبِيحَ ‏.‏ قَالَ أَبُو بَكْرِ بْنُ نَافِعٍ وَرُبَّمَا قَالَ عُمَرُ بْنُ عَلِيٍّ فِي هَذَا الْحَدِيثِ هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلٌ وَلَمْ يَذْكُرْ فِيهِ عَنْ عَائِشَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2840,
			"arabicnumber": 2840,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِي أَسْمَاءً أَنَا مُحَمَّدٌ وَأَنَا أَحْمَدُ وَأَنَا الْمَاحِي الَّذِي يَمْحُو اللَّهُ بِيَ الْكُفْرَ وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى قَدَمِي وَأَنَا الْعَاقِبُ الَّذِي لَيْسَ بَعْدِي نَبِيٌّ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ حُذَيْفَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2841,
			"arabicnumber": 2841,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَجْمَعَ أَحَدٌ بَيْنَ اسْمِهِ وَكُنْيَتِهِ وَيُسَمَّى مُحَمَّدًا أَبَا الْقَاسِمِ ‏.‏ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ كَرِهَ بَعْضُ أَهْلِ الْعِلْمِ أَنْ يَجْمَعَ الرَّجُلُ بَيْنَ اسْمِ النَّبِيِّ صلى الله عليه وسلم وَكُنْيَتِهِ وَقَدْ فَعَلَ ذَلِكَ بَعْضُهُمْ ‏.‏ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ سَمِعَ رَجُلاً، فِي السُّوقِ يُنَادِي يَا أَبَا الْقَاسِمِ فَالْتَفَتَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ لَمْ أَعْنِكَ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏ ‏.‏ حَدَّثَنَا بِذَلِكَ الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا ‏.‏ وَفِي هَذَا الْحَدِيثِ مَا يَدُلُّ عَلَى كَرَاهِيَةِ أَنْ يُكْنَى أَبَا الْقَاسِمِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا سَمَّيْتُمْ بِاسْمِي فَلاَ تَكْتَنُوا بِي ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2843,
			"arabicnumber": 2843,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا فِطْرُ بْنُ خَلِيفَةَ، حَدَّثَنِي مُنْذِرٌ، وَهُوَ الثَّوْرِيُّ عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ وُلِدَ لِي بَعْدَكَ أُسَمِّيهِ مُحَمَّدًا وَأُكْنِيهِ بِكُنْيَتِكَ قَالَ ‏ \"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَكَانَتْ رُخْصَةً لِي ‏.‏ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2844,
			"arabicnumber": 2844,
			"text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي غَنِيَّةَ، حَدَّثَنِي أَبِي، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ مِنَ الشِّعْرِ حِكْمَةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ إِنَّمَا رَفَعَهُ أَبُو سَعِيدٍ الأَشَجُّ عَنِ ابْنِ أَبِي غَنِيَّةَ ‏.‏ وَرَوَى غَيْرُهُ عَنِ ابْنِ أَبِي غَنِيَّةَ هَذَا الْحَدِيثَ مَوْقُوفًا ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَفِي الْبَابِ عَنْ أُبَىِّ بْنِ كَعْبٍ وَابْنِ عَبَّاسٍ وَعَائِشَةَ وَبُرَيْدَةَ وَكَثِيرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2845,
			"arabicnumber": 2845,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ مِنَ الشِّعْرِ حُكْمًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2846,
			"arabicnumber": 2846,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى الْفَزَارِيُّ، وَعَلِيُّ بْنُ حُجْرٍ الْمَعْنَى، وَاحِدٌ، قَالاَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَضَعُ لِحَسَّانَ مِنْبَرًا فِي الْمَسْجِدِ يَقُومُ عَلَيْهِ قَائِمًا يُفَاخِرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم - أَوْ قَالَ يُنَافِحُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم - وَيَقُولُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ يُؤَيِّدُ حَسَّانَ بِرُوحِ الْقُدُسِ مَا يُفَاخِرُ أَوْ يُنَافِحُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2847,
			"arabicnumber": 2847,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ فِي عُمْرَةِ الْقَضَاءِ وَعَبْدُ اللَّهِ بْنُ رَوَاحَةَ بَيْنَ يَدَيْهِ يَمْشِي وَهُوَ يَقُولُ خَلُّوا بَنِي الْكُفَّارِ عَنْ سَبِيلِهِ الْيَوْمَ نَضْرِبْكُمْ عَلَى تَنْزِيلِهِ ضَرْبًا يُزِيلُ الْهَامَ عَنْ مَقِيلِهِ وَيُذْهِلُ الْخَلِيلَ عَنْ خَلِيلِهِ فَقَالَ لَهُ عُمَرُ يَا ابْنَ رَوَاحَةَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي حَرَمِ اللَّهِ تَقُولُ الشِّعْرَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ خَلِّ عَنْهُ يَا عُمَرُ فَلَهِيَ أَسْرَعُ فِيهِمْ مِنْ نَضْحِ النَّبْلِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ رَوَى عَبْدُ الرَّزَّاقِ هَذَا الْحَدِيثَ أَيْضًا عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ أَنَسٍ نَحْوَ هَذَا وَرُوِيَ فِي غَيْرِ هَذَا الْحَدِيثِ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ فِي عُمْرَةِ الْقَضَاءِ وَكَعْبُ بْنُ مَالِكٍ بَيْنَ يَدَيْهِ وَهَذَا أَصَحُّ عِنْدَ بَعْضِ أَهْلِ الْحَدِيثِ لأَنَّ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ قُتِلَ يَوْمَ مُؤْتَةَ وَإِنَّمَا كَانَتْ عُمْرَةُ الْقَضَاءِ بَعْدَ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2848,
			"arabicnumber": 2848,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَ قِيلَ لَهَا هَلْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَمَثَّلُ بِشَيْءٍ مِنَ الشِّعْرِ قَالَتْ كَانَ يَتَمَثَّلُ بِشِعْرِ ابْنِ رَوَاحَةَ وَيَتَمَثَّلُ وَيَقُولُ ‏ \"‏ وَيَأْتِيكَ بِالأَخْبَارِ مَنْ لَمْ تُزَوِّدِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2849,
			"arabicnumber": 2849,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَشْعَرُ كَلِمَةٍ تَكَلَّمَتْ بِهَا الْعَرَبُ كَلِمَةُ لَبِيدٍ أَلاَ كُلُّ شَيْءٍ مَا خَلاَ اللَّهَ بَاطِلُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ الثَّوْرِيُّ وَغَيْرُهُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2850,
			"arabicnumber": 2850,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ جَالَسْتُ النَّبِيَّ صلى الله عليه وسلم أَكْثَرَ مِنْ مِائَةِ مَرَّةٍ فَكَانَ أَصْحَابُهُ يَتَنَاشَدُونَ الشِّعْرَ وَيَتَذَاكَرُونَ أَشْيَاءَ مِنْ أَمْرِ الْجَاهِلِيَّةِ وَهُوَ سَاكِتٌ فَرُبَّمَا تَبَسَّمَ مَعَهُمْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ زُهَيْرٌ عَنْ سِمَاكٍ أَيْضًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2851,
			"arabicnumber": 2851,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2852,
			"arabicnumber": 2852,
			"text": "حَدَّثَنَا عِيسَى بْنُ عُثْمَانَ بْنِ عِيسَى الرَّمْلِيُّ، حَدَّثَنَا عَمِّي، يَحْيَى بْنُ عِيسَى الرَّمْلِيُّ عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا يَرِيهُ خَيْرٌ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ سَعْدٍ وَابْنِ عُمَرَ وَأَبِي الدَّرْدَاءِ وَأَبِي سَعِيدٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2853,
			"arabicnumber": 2853,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ، عَنْ بِشْرِ بْنِ عَاصِمٍ، سَمِعَهُ يُحَدِّثُ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ يُبْغِضُ الْبَلِيغَ مِنَ الرِّجَالِ الَّذِي يَتَخَلَّلُ بِلِسَانِهِ كَمَا تَتَخَلَّلُ الْبَقَرَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَفِي الْبَابِ عَنْ سَعْدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2854,
			"arabicnumber": 2854,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَبْدِ الْجَبَّارِ بْنِ عُمَرَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَنَامَ الرَّجُلُ عَلَى سَطْحٍ لَيْسَ بِمَحْجُورٍ عَلَيْهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَعَبْدُ الْجَبَّارِ بْنُ عُمَرَ الأَيْلِيُّ يُضَعَّفُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2855,
			"arabicnumber": 2855,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ مَخَافَةَ السَّآمَةِ عَلَيْنَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2856,
			"arabicnumber": 2856,
			"text": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، قَالَ سُئِلَتْ عَائِشَةُ وَأُمُّ سَلَمَةَ أَىُّ الْعَمَلِ كَانَ أَحَبَّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتَا مَا دِيمَ عَلَيْهِ وَإِنْ قَلَّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2857,
			"arabicnumber": 2857,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ كَثِيرِ بْنِ شِنْظِيرٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خَمِّرُوا الآنِيَةَ وَأَوْكُوا الأَسْقِيَةَ وَأَجِيفُوا الأَبْوَابَ وَأَطْفِئُوا الْمَصَابِيحَ فَإِنَّ الْفُوَيْسِقَةَ رُبَّمَا جَرَّتِ الْفَتِيلَةَ فَأَحْرَقَتْ أَهْلَ الْبَيْتِ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا سَافَرْتُمْ فِي الْخِصْبِ فَأَعْطُوا الإِبِلَ حَظَّهَا مِنَ الأَرْضِ وَإِذَا سَافَرْتُمْ فِي السَّنَةِ فَبَادِرُوا بِنِقْيِهَا وَإِذَا عَرَّسْتُمْ فَاجْتَنِبُوا الطَّرِيقَ فَإِنَّهَا طُرُقُ الدَّوَابِّ وَمَأْوَى الْهَوَامِّ بِاللَّيْلِ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ جَابِرٍ وَأَنَسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3093,
			"arabicnumber": 3093,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا رَأَيْتُمُ الرَّجُلَ يَعْتَادُ الْمَسْجِدَ فَاشْهَدُوا لَهُ بِالإِيمَانِ ‏.‏ قَالَ اللَّهُ تَعَالَى ‏:‏ ‏(‏ إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الآخِرِ ‏)‏ ‏.‏ ‏\"‏ ‏.‏ حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ إِلاَّ أَنَّهُ قَالَ ‏\"‏ يَتَعَاهَدُ الْمَسْجِدَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَأَبُو الْهَيْثَمِ اسْمُهُ سُلَيْمَانُ بْنُ عَمْرِو بْنِ عَبْدٍ الْعُتْوَارِيُّ وَكَانَ يَتِيمًا فِي حَجْرِ أَبِي سَعِيدٍ الْخُدْرِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 131
			}
		}
	]
}