{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"44": "Chapters on Parables"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2859,
			"arabicnumber": 2859,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، قَالَ‏ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنِ النَّوَّاسِ بْنِ سَمْعَانَ الْكِلاَبِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ ضَرَبَ مَثَلاً صِرَاطًا مُسْتَقِيمًا عَلَى كَنَفَىِ الصِّرَاطِ سُورَانِ لَهُمَا أَبْوَابٌ مُفَتَّحَةٌ عَلَى الأَبْوَابِ سُتُورٌ وَدَاعٍ يَدْعُو عَلَى رَأْسِ الصِّرَاطِ وَدَاعٍ يَدْعُو فَوْقَهُ‏:‏ ‏(‏وَاللَّهُ يَدْعُو إِلَى دَارِ السَّلاَمِ وَيَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ‏)‏ وَالأَبْوَابُ الَّتِي عَلَى كَنَفَىِ الصِّرَاطِ حُدُودُ اللَّهِ فَلاَ يَقَعُ أَحَدٌ فِي حُدُودِ اللَّهِ حَتَّى يُكْشَفَ السِّتْرُ وَالَّذِي يَدْعُو مِنْ فَوْقِهِ وَاعِظُ رَبِّهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ سَمِعْتُ زَكَرِيَّا بْنَ عَدِيٍّ يَقُولُ قَالَ أَبُو إِسْحَاقَ الْفَزَارِيُّ خُذُوا عَنْ بَقِيَّةَ مَا حَدَّثَكُمْ عَنِ الثِّقَاتِ وَلاَ تَأْخُذُوا عَنْ إِسْمَاعِيلَ بْنِ عَيَّاشٍ مَا حَدَّثَكُمْ عَنِ الثِّقَاتِ وَلاَ غَيْرِ الثِّقَاتِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2860,
			"arabicnumber": 2860,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ‏ حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا فَقَالَ ‏ \"‏ إِنِّي رَأَيْتُ فِي الْمَنَامِ كَأَنَّ جِبْرِيلَ عِنْدَ رَأْسِي وَمِيكَائِيلَ عِنْدَ رِجْلَىَّ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ اضْرِبْ لَهُ مَثَلاً ‏.‏ فَقَالَ اسْمَعْ سَمِعَتْ أُذُنُكَ وَاعْقِلْ عَقَلَ قَلْبُكَ إِنَّمَا مَثَلُكَ وَمَثَلُ أُمَّتِكَ كَمَثَلِ مَلِكٍ اتَّخَذَ دَارًا ثُمَّ بَنَى فِيهَا بَيْتًا ثُمَّ جَعَلَ فِيهَا مَائِدَةً ثُمَّ بَعَثَ رَسُولاً يَدْعُو النَّاسَ إِلَى طَعَامِهِ فَمِنْهُمْ مَنْ أَجَابَ الرَّسُولَ وَمِنْهُمْ مَنْ تَرَكَهُ فَاللَّهُ هُوَ الْمَلِكُ وَالدَّارُ الإِسْلاَمُ وَالْبَيْتُ الْجَنَّةُ وَأَنْتَ يَا مُحَمَّدُ رَسُولٌ فَمَنْ أَجَابَكَ دَخَلَ الإِسْلاَمَ وَمَنْ دَخَلَ الإِسْلاَمَ دَخَلَ الْجَنَّةَ وَمَنْ دَخَلَ الْجَنَّةَ أَكَلَ مَا فِيهَا ‏\"‏ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِإِسْنَادٍ أَصَحَّ مِنْ هَذَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ مُرْسَلٌ ‏.‏ سَعِيدُ بْنُ أَبِي هِلاَلٍ لَمْ يُدْرِكْ جَابِرَ بْنَ عَبْدِ اللَّهِ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ جَعْفَرِ بْنِ مَيْمُونٍ، عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ، عَنْ أَبِي عُثْمَانَ، عَنِ ابْنِ مَسْعُودٍ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الْعِشَاءَ ثُمَّ انْصَرَفَ فَأَخَذَ بِيَدِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ حَتَّى خَرَجَ بِهِ إِلَى بَطْحَاءِ مَكَّةَ فَأَجْلَسَهُ ثُمَّ خَطَّ عَلَيْهِ خَطًّا ثُمَّ قَالَ ‏\"‏ لاَ تَبْرَحَنَّ خَطَّكَ فَإِنَّهُ سَيَنْتَهِي إِلَيْكَ رِجَالٌ فَلاَ تُكَلِّمْهُمْ فَإِنَّهُمْ لاَ يُكَلِّمُونَكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم حَيْثُ أَرَادَ فَبَيْنَا أَنَا جَالِسٌ فِي خَطِّي إِذْ أَتَانِي رِجَالٌ كَأَنَّهُمُ الزُّطُّ أَشْعَارُهُمْ وَأَجْسَامُهُمْ لاَ أَرَى عَوْرَةً وَلاَ أَرَى قِشْرًا وَيَنْتَهُونَ إِلَىَّ لاَ يُجَاوِزُونَ الْخَطَّ ثُمَّ يَصْدُرُونَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ لَكِنْ رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ جَاءَنِي وَأَنَا جَالِسٌ فَقَالَ ‏\"‏ لَقَدْ أَرَانِي مُنْذُ اللَّيْلَةَ ‏\"‏ ‏.‏ ثُمَّ دَخَلَ عَلَىَّ فِي خَطِّي فَتَوَسَّدَ فَخِذِي فَرَقَدَ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا رَقَدَ نَفَخَ فَبَيْنَا أَنَا قَاعِدٌ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُتَوَسِّدٌ فَخِذِي إِذَا أَنَا بِرِجَالٍ عَلَيْهِمْ ثِيَابٌ بِيضٌ اللَّهُ أَعْلَمُ مَا بِهِمْ مِنَ الْجَمَالِ فَانْتَهَوْا إِلَىَّ فَجَلَسَ طَائِفَةٌ مِنْهُمْ عِنْدَ رَأْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَطَائِفَةٌ مِنْهُمْ عِنْدَ رِجْلَيْهِ ثُمَّ قَالُوا بَيْنَهُمْ مَا رَأَيْنَا عَبْدًا قَطُّ أُوتِيَ مِثْلَ مَا أُوتِيَ هَذَا النَّبِيُّ إِنَّ عَيْنَيْهِ تَنَامَانِ وَقَلْبُهُ يَقْظَانُ اضْرِبُوا لَهُ مَثَلاً مَثَلُ سَيِّدٍ بَنَى قَصْرًا ثُمَّ جَعَلَ مَأْدُبَةً فَدَعَا النَّاسَ إِلَى طَعَامِهِ وَشَرَابِهِ فَمَنْ أَجَابَهُ أَكَلَ مِنْ طَعَامِهِ وَشَرِبَ مِنْ شَرَابِهِ وَمَنْ لَمْ يُجِبْهُ عَاقَبَهُ أَوْ قَالَ عَذَّبَهُ - ثُمَّ ارْتَفَعُوا وَاسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ فَقَالَ ‏\"‏ سَمِعْتَ مَا قَالَ هَؤُلاَءِ وَهَلْ تَدْرِي مَنْ هَؤُلاَءِ ‏\"‏ ‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ هُمُ الْمَلاَئِكَةُ فَتَدْرِي مَا الْمَثَلُ الَّذِي ضَرَبُوا ‏\"‏ ‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ الْمَثَلُ الَّذِي ضَرَبُوا الرَّحْمَنُ تَبَارَكَ وَتَعَالَى بَنَى الْجَنَّةَ وَدَعَا إِلَيْهَا عِبَادَهُ فَمَنْ أَجَابَهُ دَخَلَ الْجَنَّةَ وَمَنْ لَمْ يُجِبْهُ عَاقَبَهُ أَوْ عَذَّبَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَأَبُو تَمِيمَةَ هُوَ الْهُجَيْمِيُّ وَاسْمُهُ طَرِيفُ بْنُ مُجَالِدٍ وَأَبُو عُثْمَانَ النَّهْدِيُّ اسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ مُلٍّ وَسُلَيْمَانُ التَّيْمِيُّ قَدْ رَوَى هَذَا الْحَدِيثَ عَنْهُ مُعْتَمِرٌ وَهُوَ سُلَيْمَانُ بْنُ طَرْخَانَ وَلَمْ يَكُنْ تَيْمِيًّا وَإِنَّمَا كَانَ يَنْزِلُ بَنِي تَيْمٍ فَنُسِبَ إِلَيْهِمْ ‏.‏ قَالَ عَلِيٌّ قَالَ يَحْيَى بْنُ سَعِيدٍ مَا رَأَيْتُ أَخْوَفَ لِلَّهِ تَعَالَى مِنْ سُلَيْمَانَ التَّيْمِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2862,
			"arabicnumber": 2862,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ‏ حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ‏ حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ بَصْرِيٌّ، قَالَ‏ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا مَثَلِي وَمَثَلُ الأَنْبِيَاءِ قَبْلِي كَرَجُلٍ بَنَى دَارًا فَأَكْمَلَهَا وَأَحْسَنَهَا إِلاَّ مَوْضِعَ لَبِنَةٍ فَجَعَلَ النَّاسُ يَدْخُلُونَهَا وَيَتَعَجَّبُونَ مِنْهَا وَيَقُولُونَ لَوْلاَ مَوْضِعُ اللَّبِنَةِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أُبَىِّ بْنِ كَعْبٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ‏ حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، قَالَ‏ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ زَيْدِ بْنِ سَلاَّمٍ، أَنَّ أَبَا سَلاَّمٍ، حَدَّثَهُ أَنَّ الْحَارِثَ الأَشْعَرِيَّ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ أَمَرَ يَحْيَى بْنَ زَكَرِيَّا بِخَمْسِ كَلِمَاتٍ أَنْ يَعْمَلَ بِهَا وَيَأْمُرَ بَنِي إِسْرَائِيلَ أَنْ يَعْمَلُوا بِهَا وَإِنَّهُ كَادَ أَنْ يُبْطِئَ بِهَا فَقَالَ عِيسَى إِنَّ اللَّهَ أَمَرَكَ بِخَمْسِ كَلِمَاتٍ لِتَعْمَلَ بِهَا وَتَأْمُرَ بَنِي إِسْرَائِيلَ أَنْ يَعْمَلُوا بِهَا فَإِمَّا أَنْ تَأْمُرَهُمْ وَإِمَّا أَنَا آمُرُهُمْ ‏.‏ فَقَالَ يَحْيَى أَخْشَى إِنْ سَبَقْتَنِي بِهَا أَنْ يُخْسَفَ بِي أَوْ أُعَذَّبَ فَجَمَعَ النَّاسَ فِي بَيْتِ الْمَقْدِسِ فَامْتَلأَ الْمَسْجِدُ وَقَعَدُوا عَلَى الشُّرَفِ فَقَالَ إِنَّ اللَّهَ أَمَرَنِي بِخَمْسِ كَلِمَاتٍ أَنْ أَعْمَلَ بِهِنَّ وَآمُرَكُمْ أَنْ تَعْمَلُوا بِهِنَّ أَوَّلُهُنَّ أَنْ تَعْبُدُوا اللَّهَ وَلاَ تُشْرِكُوا بِهِ شَيْئًا وَإِنَّ مَثَلَ مَنْ أَشْرَكَ بِاللَّهِ كَمَثَلِ رَجُلٍ اشْتَرَى عَبْدًا مِنْ خَالِصِ مَالِهِ بِذَهَبٍ أَوْ وَرِقٍ فَقَالَ هَذِهِ دَارِي وَهَذَا عَمَلِي فَاعْمَلْ وَأَدِّ إِلَىَّ فَكَانَ يَعْمَلُ وَيُؤَدِّي إِلَى غَيْرِ سَيِّدِهِ فَأَيُّكُمْ يَرْضَى أَنْ يَكُونَ عَبْدُهُ كَذَلِكَ وَإِنَّ اللَّهَ أَمَرَكُمْ بِالصَّلاَةِ فَإِذَا صَلَّيْتُمْ فَلاَ تَلْتَفِتُوا فَإِنَّ اللَّهَ يَنْصِبُ وَجْهَهُ لِوَجْهِ عَبْدِهِ فِي صَلاَتِهِ مَا لَمْ يَلْتَفِتْ وَآمُرُكُمْ بِالصِّيَامِ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ فِي عِصَابَةٍ مَعَهُ صُرَّةٌ فِيهَا مِسْكٌ فَكُلُّهُمْ يَعْجَبُ أَوْ يُعْجِبُهُ رِيحُهَا وَإِنَّ رِيحَ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ وَآمُرُكُمْ بِالصَّدَقَةِ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ أَسَرَهُ الْعَدُوُّ فَأَوْثَقُوا يَدَهُ إِلَى عُنُقِهِ وَقَدَّمُوهُ لِيَضْرِبُوا عُنُقَهُ فَقَالَ أَنَا أَفْدِيهِ مِنْكُمْ بِالْقَلِيلِ وَالْكَثِيرِ ‏.‏ فَفَدَى نَفْسَهُ مِنْهُمْ وَآمُرُكُمْ أَنْ تَذْكُرُوا اللَّهَ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ خَرَجَ الْعَدُوُّ فِي أَثَرِهِ سِرَاعًا حَتَّى إِذَا أَتَى عَلَى حِصْنٍ حَصِينٍ فَأَحْرَزَ نَفْسَهُ مِنْهُمْ كَذَلِكَ الْعَبْدُ لاَ يُحْرِزُ نَفْسَهُ مِنَ الشَّيْطَانِ إِلاَّ بِذِكْرِ اللَّهِ ‏\"‏ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَأَنَا آمُرُكُمْ بِخَمْسٍ اللَّهُ أَمَرَنِي بِهِنَّ السَّمْعُ وَالطَّاعَةُ وَالْجِهَادُ وَالْهِجْرَةُ وَالْجَمَاعَةُ فَإِنَّهُ مَنْ فَارَقَ الْجَمَاعَةَ قِيدَ شِبْرٍ فَقَدْ خَلَعَ رِبْقَةَ الإِسْلاَمِ مِنْ عُنُقِهِ إِلاَّ أَنْ يَرْجِعَ وَمَنِ ادَّعَى دَعْوَى الْجَاهِلِيَّةِ فَإِنَّهُ مِنْ جُثَا جَهَنَّمَ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ وَإِنْ صَلَّى وَصَامَ قَالَ ‏\"‏ وَإِنْ صَلَّى وَصَامَ فَادْعُوا بِدَعْوَى اللَّهِ الَّذِي سَمَّاكُمُ الْمُسْلِمِينَ الْمُؤْمِنِينَ عِبَادَ اللَّهِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ الْحَارِثُ الأَشْعَرِيُّ لَهُ صُحْبَةٌ وَلَهُ غَيْرُ هَذَا الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2864,
			"arabicnumber": 2864,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ‏ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ زَيْدِ بْنِ سَلاَّمٍ، عَنْ أَبِي سَلاَّمٍ، عَنِ الْحَارِثِ الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ بِمَعْنَاهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏ وَأَبُو سَلاَّمٍ الْحَبَشِيُّ اسْمُهُ مَمْطُورٌ وَقَدْ رَوَاهُ عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2865,
			"arabicnumber": 2865,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ التَّمْرَةِ لاَ رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْمُنَافِقِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ رِيحُهَا مُرٌّ وَطَعْمُهَا مُرٌّ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ شُعْبَةُ عَنْ قَتَادَةَ أَيْضًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2866,
			"arabicnumber": 2866,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الزَّرْعِ لاَ تَزَالُ الرِّيَاحُ تُفِيئُهُ وَلاَ يَزَالُ الْمُؤْمِنُ يُصِيبُهُ بَلاَءٌ وَمَثَلُ الْمُنَافِقِ كَمَثَلِ الشَّجَرَةِ الأَرْزِ لاَ تَهْتَزُّ حَتَّى تُسْتَحْصَدَ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2867,
			"arabicnumber": 2867,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالَ‏ حَدَّثَنَا مَعْنٌ، قَالَ‏ حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا وَهِيَ مَثَلُ الْمُؤْمِنِ حَدِّثُونِي مَا هِيَ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏ ‏.‏ فَاسْتَحْيَيْتُ أَنْ أَقُولَ قَالَ عَبْدُ اللَّهِ فَحَدَّثْتُ عُمَرَ بِالَّذِي وَقَعَ فِي نَفْسِي ‏.‏ فَقَالَ لأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَىَّ مِنْ أَنْ يَكُونَ لِي كَذَا وَكَذَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2868,
			"arabicnumber": 2868,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ‏ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَرَأَيْتُمْ لَوْ أَنَّ نَهْرًا بِبَابِ أَحَدِكُمْ يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ هَلْ يَبْقَى مِنْ دَرَنِهِ شَيْءٌ ‏\"‏ ‏.‏ قَالُوا لاَ يَبْقَى مِنْ دَرَنِهِ شَيْءٌ ‏.‏ قَالَ ‏\"‏ فَذَلِكَ مَثَلُ الصَّلَوَاتِ الْخَمْسِ يَمْحُو اللَّهُ بِهِنَّ الْخَطَايَا ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2869,
			"arabicnumber": 2869,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ‏ حَدَّثَنَا حَمَّادُ بْنُ يَحْيَى الأَبَحُّ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَثَلُ أُمَّتِي مَثَلُ الْمَطَرِ لاَ يُدْرَى أَوَّلُهُ خَيْرٌ أَمْ آخِرُهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَمَّارٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عُمَرَ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَرُوِيَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ أَنَّهُ كَانَ يُثَبِّتُ حَمَّادَ بْنَ يَحْيَى الأَبَحَّ وَكَانَ يَقُولُ هُوَ مِنْ شُيُوخِنَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2870,
			"arabicnumber": 2870,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ‏ حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ‏ حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ، قَالَ‏ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ تَدْرُونَ مَا هَذِهِ وَمَا هَذِهِ ‏\"‏ ‏.‏ وَرَمَى بِحَصَاتَيْنِ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ هَذَاكَ الأَمَلُ وَهَذَاكَ الأَجَلُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2871,
			"arabicnumber": 2871,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى، قَالَ‏ حَدَّثَنَا مَعْنٌ، قَالَ‏ حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا أَجَلُكُمْ فِيمَا خَلاَ مِنَ الأُمَمِ كَمَا بَيْنَ صَلاَةِ الْعَصْرِ إِلَى مَغَارِبِ الشَّمْسِ وَإِنَّمَا مَثَلُكُمْ وَمَثَلُ الْيَهُودِ وَالنَّصَارَى كَرَجُلٍ اسْتَعْمَلَ عُمَّالاً فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ عَلَى قِيرَاطٍ قِيرَاطٍ فَقَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى الْعَصْرِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتِ النَّصَارَى عَلَى قِيرَاطٍ قِيرَاطٍ ثُمَّ أَنْتُمْ تَعْمَلُونَ مِنْ صَلاَةِ الْعَصْرِ إِلَى مَغَارِبِ الشَّمْسِ عَلَى قِيرَاطَيْنِ قِيرَاطَيْنِ فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى وَقَالُوا نَحْنُ أَكْثَرُ عَمَلاً وَأَقَلُّ عَطَاءً ‏.‏ قَالَ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ شَيْئًا قَالُوا لاَ ‏.‏ قَالَ فَإِنَّهُ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2872,
			"arabicnumber": 2872,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ وَغَيْرُ وَاحِدٍ، قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا النَّاسُ كَإِبِلٍ مِائَةٍ لاَ يَجِدُ الرَّجُلُ فِيهَا رَاحِلَةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2873,
			"arabicnumber": 2873,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، قَالَ‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ وَقَالَ لاَ تَجِدُ فِيهَا رَاحِلَةً أَوْ قَالَ لاَ تَجِدُ فِيهَا إِلاَّ رَاحِلَةً ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2874,
			"arabicnumber": 2874,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ‏ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا مَثَلِي وَمَثَلُ أُمَّتِي كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا فَجَعَلَتِ الذُّبَابُ وَالْفَرَاشُ يَقَعْنَ فِيهَا وَأَنَا آخُذُ بِحُجَزِكُمْ وَأَنْتُمْ تَقَحَّمُونَ فِيهَا ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 17
			}
		}
	]
}