{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ عَلَى أُبَىِّ بْنِ كَعْبٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أُبَىُّ ‏\"‏ ‏.‏ وَهُوَ يُصَلِّي فَالْتَفَتَ أُبَىٌّ وَلَمْ يُجِبْهُ وَصَلَّى أُبَىٌّ فَخَفَّفَ ثُمَّ انْصَرَفَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ السَّلاَمُ عَلَيْكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَعَلَيْكَ السَّلاَمُ مَا مَنَعَكَ يَا أُبَىُّ أَنْ تُجِيبَنِي إِذْ دَعَوْتُكَ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ فِي الصَّلاَةِ ‏.‏ قَالَ ‏\"‏ أَفَلَمْ تَجِدْ فِيمَا أَوْحَى اللَّهُ إِلَىَّ أَنِ ‏(‏استَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ ‏)‏ ‏\"‏ ‏.‏ قَالَ بَلَى وَلاَ أَعُودُ إِنْ شَاءَ اللَّهُ ‏.‏ قَالَ ‏\"‏ تُحِبُّ أَنْ أُعَلِّمَكَ سُورَةً لَمْ يَنْزِلْ فِي التَّوْرَاةِ وَلاَ فِي الإِنْجِيلِ وَلاَ فِي الزَّبُورِ وَلاَ فِي الْفُرْقَانِ مِثْلُهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَيْفَ تَقْرَأُ فِي الصَّلاَةِ ‏\"‏ ‏.‏ قَالَ فَقَرَأَ أُمَّ الْقُرْآنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ مَا أُنْزِلَتْ فِي التَّوْرَاةِ وَلاَ فِي الإِنْجِيلِ وَلاَ فِي الزَّبُورِ وَلاَ فِي الْفُرْقَانِ مِثْلُهَا وَإِنَّهَا سَبْعٌ مِنَ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُعْطِيتُهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ أَنَسِ بْنِ مَالِكٍ وَفِيهِ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2876,
			"arabicnumber": 2876,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ الْحُلْوَانِيُّ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَطَاءٍ، مَوْلَى أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا وَهُمْ ذُو عَدَدٍ فَاسْتَقْرَأَهُمْ فَاسْتَقْرَأَ كُلَّ رَجُلٍ مِنْهُمْ مَا مَعَهُ مِنَ الْقُرْآنِ فَأَتَى عَلَى رَجُلٍ مِنْهُمْ مِنْ أَحْدَثِهِمْ سِنًّا فَقَالَ ‏\"‏ مَا مَعَكَ يَا فُلاَنُ ‏\"‏ ‏.‏ قَالَ مَعِي كَذَا وَكَذَا وَسُورَةُ الْبَقَرَةِ ‏.‏ قَالَ ‏\"‏ أَمَعَكَ سُورَةُ الْبَقَرَةِ ‏\"‏ ‏.‏ فَقَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَاذْهَبْ فَأَنْتَ أَمِيرُهُمْ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِنْ أَشْرَافِهِمْ وَاللَّهِ يَا رَسُولَ اللَّهِ مَا مَنَعَنِي أَنْ أَتَعَلَّمَ سُورَةَ الْبَقَرَةِ إِلاَّ خَشْيَةَ أَلاَّ أَقُومَ بِهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَعَلَّمُوا الْقُرْآنَ فَاقْرَءُوهُ وَأَقْرِئُوهُ فَإِنَّ مَثَلَ الْقُرْآنِ لِمَنْ تَعَلَّمَهُ فَقَرَأَهُ وَقَامَ بِهِ كَمَثَلِ جِرَابٍ مَحْشُوٍّ مِسْكًا يَفُوحُ بِرِيحِهِ كُلُّ مَكَانٍ وَمَثَلُ مَنْ تَعَلَّمَهُ فَيَرْقُدُ وَهُوَ فِي جَوْفِهِ كَمَثَلِ جِرَابٍ وُكِئَ عَلَى مِسْكٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَاهُ اللَّيْثُ بْنُ سَعْدٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَطَاءٍ، مَوْلَى أَبِي أَحْمَدَ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ حَدَّثَنَا قُتَيْبَةُ عَنِ اللَّيْثِ فَذَكَرَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2877,
			"arabicnumber": 2877,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَجْعَلُوا بُيُوتَكُمْ مَقَابِرَ وَإِنَّ الْبَيْتَ الَّذِي تُقْرَأُ فِيهِ الْبَقَرَةُ لاَ يَدْخُلُهُ الشَّيْطَانُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2878,
			"arabicnumber": 2878,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ حَكِيمِ بْنِ جُبَيْرٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِكُلِّ شَيْءٍ سَنَامٌ وَإِنَّ سَنَامَ الْقُرْآنِ سُورَةُ الْبَقَرَةِ وَفِيهَا آيَةٌ هِيَ سَيِّدَةُ آىِ الْقُرْآنِ هِيَ آيَةُ الْكُرْسِيِّ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ حَكِيمِ بْنِ جُبَيْرٍ ‏.‏ وَقَدْ تَكَلَّمَ شُعْبَةُ فِي حَكِيمِ بْنِ جُبَيْرٍ وَضَعَّفَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2879,
			"arabicnumber": 2879,
			"text": "حَدَّثَنَا يَحْيَى بْنُ الْمُغِيرَةِ أَبُو سَلَمَةَ الْمَخْزُومِيُّ الْمَدَنِيُّ، قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الْمُلَيْكِيِّ، عَنْ زُرَارَةَ بْنِ مُصْعَبٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَرَأَ حم الْمُؤْمِنَ إِلَى ‏:‏ ‏(‏إِلَيْهِ الْمَصِيرُ ‏)‏ وَآيَةَ الْكُرْسِيِّ حِينَ يُصْبِحُ حُفِظَ بِهِمَا حَتَّى يُمْسِيَ وَمَنْ قَرَأَهُمَا حِينَ يُمْسِيَ حُفِظَ بِهِمَا حَتَّى يُصْبِحَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرِ بْنِ أَبِي مُلَيْكَةَ الْمُلَيْكِيِّ مِنْ قِبَلِ حِفْظِهِ ‏.‏ وَزُرَارَةُ بْنُ مُصْعَبٍ هُوَ ابْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَهُوَ جَدُّ أَبِي مُصْعَبٍ الْمَدَنِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2880,
			"arabicnumber": 2880,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ أَخِيهِ، عِيسَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّهُ كَانَتْ لَهُ سَهْوَةٌ فِيهَا تَمْرٌ فَكَانَتْ تَجِيءُ الْغُولُ فَتَأْخُذُ مِنْهُ قَالَ فَشَكَا ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ فَاذْهَبْ فَإِذَا رَأَيْتَهَا فَقُلْ بِسْمِ اللَّهِ أَجِيبِي رَسُولَ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏.‏ قَالَ فَأَخَذَهَا فَحَلَفَتْ أَنْ لاَ تَعُودَ فَأَرْسَلَهَا فَجَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا فَعَلَ أَسِيرُكَ ‏\"‏ ‏.‏ قَالَ حَلَفَتْ أَنْ لاَ تَعُودَ فَقَالَ ‏\"‏ كَذَبَتْ وَهِيَ مُعَاوِدَةٌ لِلْكَذِبِ ‏\"‏ ‏.‏ قَالَ فَأَخَذَهَا مَرَّةً أُخْرَى فَحَلَفَتْ أَنْ لاَ تَعُودَ فَأَرْسَلَهَا فَجَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا فَعَلَ أَسِيرُكَ ‏\"‏ ‏.‏ قَالَ حَلَفَتْ أَنْ لاَ تَعُودَ ‏.‏ فَقَالَ ‏\"‏ كَذَبَتْ وَهِيَ مُعَاوِدَةٌ لِلْكَذِبِ ‏\"‏ ‏.‏ فَأَخَذَهَا فَقَالَ مَا أَنَا بِتَارِكِكِ حَتَّى أَذْهَبَ بِكِ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَتْ إِنِّي ذَاكِرَةٌ لَكَ شَيْئًا آيَةَ الْكُرْسِيِّ اقْرَأْهَا فِي بَيْتِكَ فَلاَ يَقْرَبُكَ شَيْطَانٌ وَلاَ غَيْرُهُ ‏.‏ قَالَ فَجَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا فَعَلَ أَسِيرُكَ ‏\"‏ ‏.‏ قَالَ فَأَخْبَرَهُ بِمَا قَالَتْ ‏.‏ قَالَ ‏\"‏ صَدَقَتْ وَهِيَ كَذُوبٌ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَفِي الْبَابِ عَنْ أُبَىِّ بْنِ كَعْبٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2881,
			"arabicnumber": 2881,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ، عَنْ إِبْرَاهِيمَ بنِ يَزِيدَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ قَرَأَ الآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2882,
			"arabicnumber": 2882,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَشْعَثَ بْنِ عَبْدِ الرَّحْمَنِ الْجَرْمِيِّ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ الْجَرْمِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ كَتَبَ كِتَابًا قَبْلَ أَنْ يَخْلُقَ السَّمَاوَاتِ وَالأَرْضَ بِأَلْفَىْ عَامٍ أَنْزَلَ مِنْهُ آيَتَيْنِ خَتَمَ بِهِمَا سُورَةَ الْبَقَرَةِ وَلاَ يُقْرَآنِ فِي دَارٍ ثَلاَثَ لَيَالٍ فَيَقْرَبُهَا شَيْطَانٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2883,
			"arabicnumber": 2883,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ أَخْبَرَنَا هِشَامُ بْنُ إِسْمَاعِيلَ أَبُو عَبْدِ الْمَلِكِ الْعَطَّارِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُلَيْمَانَ، عَنِ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ حَدَّثَهُمْ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ نَوَّاسِ بْنِ سَمْعَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَأْتِي الْقُرْآنُ وَأَهْلُهُ الَّذِينَ يَعْمَلُونَ بِهِ فِي الدُّنْيَا تَقْدُمُهُ سُورَةُ الْبَقَرَةِ وَآلُ عِمْرَانَ ‏\"‏ ‏.‏ قَالَ نَوَّاسٌ وَضَرَبَ لَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَةَ أَمْثَالٍ مَا نَسِيتُهُنَّ بَعْدُ قَالَ ‏\"‏ تَأْتِيَانِ كَأَنَّهُمَا غَيَابَتَانِ وَبَيْنَهُمَا شَرْقٌ أَوْ كَأَنَّهُمَا غَمَامَتَانِ سَوْدَاوَانِ أَوْ كَأَنَّهُمَا ظُلَّةٌ مِنْ طَيْرٍ صَوَافَّ تُجَادِلاَنِ عَنْ صَاحِبِهِمَا ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ بُرَيْدَةَ وَأَبِي أُمَامَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَمَعْنَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُ يَجِيءُ ثَوَابُ قِرَاءَتِهِ كَذَا فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ هَذَا الْحَدِيثَ وَمَا يُشْبِهُ هَذَا مِنَ الأَحَادِيثِ أَنَّهُ يَجِيءُ ثَوَابُ قِرَاءَةِ الْقُرْآنِ ‏.‏ وَفِي حَدِيثِ النَّوَّاسِ عَنِ النَّبِيِّ صلى الله عليه وسلم مَا يَدُلُّ عَلَى مَا فَسَّرُوا إِذْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَأَهْلُهُ الَّذِينَ يَعْمَلُونَ بِهِ فِي الدُّنْيَا ‏\"‏ ‏.‏ فَفِي هَذَا دَلاَلَةٌ أَنَّهُ يَجِيءُ ثَوَابُ الْعَمَلِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2884,
			"arabicnumber": 2884,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، فِي تَفْسِيرِ حَدِيثِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ مَا خَلَقَ اللَّهُ مِنْ سَمَاءٍ وَلاَ أَرْضٍ أَعْظَمَ مِنْ آيَةِ الْكُرْسِيِّ ‏.‏ قَالَ سُفْيَانُ لأَنَّ آيَةَ الْكُرْسِيِّ هُوَ كَلاَمُ اللَّهِ وَكَلاَمُ اللَّهِ أَعْظَمُ مِنْ خَلْقِ اللَّهِ مِنَ السَّمَاءِ وَالأَرْضِ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُ بَيْنَمَا رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ إِذْ رَأَى دَابَّتَهُ تَرْكُضُ فَنَظَرَ فَإِذَا مِثْلُ الْغَمَامَةِ أَوِ السَّحَابَةِ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ تِلْكَ السَّكِينَةُ نَزَلَتْ مَعَ الْقُرْآنِ أَوْ نَزَلَتْ عَلَى الْقُرْآنِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَرَأَ ثَلاَثَ آيَاتٍ مِنْ أَوَّلِ الْكَهْفِ عُصِمَ مِنْ فِتْنَةِ الدَّجَّالِ ‏\"‏ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "حَدَّثَنَا قُتَيْبَةُ وَسُفْيَانُ بْنُ وَكِيعٍ، قَالاَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّؤَاسِيُّ، عَنِ الْحَسَنِ بْنِ صَالِحٍ، عَنْ هَارُونَ أَبِي مُحَمَّدٍ، عَنْ مُقَاتِلِ بْنِ حَيَّانَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِكُلِّ شَيْءٍ قَلْبًا وَقَلْبُ الْقُرْآنِ يس وَمَنْ قَرَأَ يس كَتَبَ اللَّهُ لَهُ بِقِرَاءَتِهَا قِرَاءَةَ الْقُرْآنِ عَشْرَ مَرَّاتٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ وَبِالْبَصْرَةِ لاَ يَعْرِفُونَ مِنْ حَدِيثِ قَتَادَةَ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَهَارُونُ أَبُو مُحَمَّدٍ شَيْخٌ مَجْهُولٌ ‏.‏ حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، قَالَ حَدَّثَنَا قُتَيْبَةُ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، بِهَذَا ‏.‏ وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، وَلاَ يَصِحُّ مِنْ قِبَلِ إِسْنَادِهِ إِسْنَادُهُ ضَعِيفٌ ‏.‏ وَ فِي البَابِ عَنْ أَبِي هُرَيرَةَ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، قَالَ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، عَنْ عُمَرَ بْنِ أَبِي خَثْعَمٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ قَرَأَ حم الدُّخَانَ فِي لَيْلَةٍ أَصْبَحَ يَسْتَغْفِرُ لَهُ سَبْعُونَ أَلْفَ مَلَكٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَعُمَرُ بْنُ أَبِي خَثْعَمٍ يُضَعَّفُ ‏.‏ قَالَ مُحَمَّدٌ وَهُوَ مُنْكَرُ الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ، قَالَ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، عَنْ هِشَامٍ أَبِي الْمِقْدَامِ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ قَرَأَ حم الدُّخَانَ فِي لَيْلَةِ الْجُمُعَةِ غُفِرَ لَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَهِشَامٌ أَبُو الْمِقْدَامِ يُضَعَّفُ وَلَمْ يَسْمَعِ الْحَسَنُ مِنْ أَبِي هُرَيْرَةَ هَكَذَا قَالَ أَيُّوبُ وَيُونُسُ بْنُ عُبَيْدٍ وَعَلِيُّ بْنُ زَيْدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ عَمْرِو بْنِ مَالِكٍ النُّكْرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي الْجَوْزَاءِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ضَرَبَ بَعْضُ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم خِبَاءَهُ عَلَى قَبْرٍ وَهُوَ لاَ يَحْسِبُ أَنَّهُ قَبْرٌ فَإِذَا فِيهِ إِنْسَانٌ يَقْرَأُ سُورَةَ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ حَتَّى خَتَمَهَا فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي ضَرَبْتُ خِبَائِي عَلَى قَبْرٍ وَأَنَا لاَ أَحْسِبُ أَنَّهُ قَبْرٌ فَإِذَا فِيهِ إِنْسَانٌ يَقْرَأُ سُورَةَ تَبَارَكَ الْمُلْكُ حَتَّى خَتَمَهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ هِيَ الْمَانِعَةُ هِيَ الْمُنْجِيَةُ تُنْجِيهِ مِنْ عَذَابِ الْقَبْرِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عَبَّاسٍ الْجُشَمِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ سُورَةً مِنَ الْقُرْآنِ ثَلاَثُونَ آيَةً شَفَعَتْ لِرَجُلٍ حَتَّى غُفِرَ لَهُ وَهِيَ سُورَةُ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "حَدَّثَنَا هُرَيْمُ بْنُ مِسْعَرٍ، - تِرْمِذِيٌّ - قَالَ حَدَّثَنَا الْفُضَيْلُ بْنُ عِيَاضٍ، عَنْ لَيْثٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَنَامُ حَتَّى يَقْرَأَ ‏:‏ ‏(‏الم * تَنْزِيلُ ‏)‏ وَ ‏(‏ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ رَوَاهُ غَيْرُ وَاحِدٍ عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ مِثْلَ هَذَا ‏.‏ وَرَوَاهُ مُغِيرَةُ بْنُ مُسْلِمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ هَذَا ‏.‏ وَرَوَى زُهَيْرٌ قَالَ قُلْتُ لأَبِي الزُّبَيْرِ سَمِعْتَ مِنْ جَابِرٍ يَذْكُرُ هَذَا الْحَدِيثَ ‏.‏ فَقَالَ أَبُو الزُّبَيْرِ إِنَّمَا أَخْبَرَنِيهِ صَفْوَانُ أَوِ ابْنُ صَفْوَانَ وَكَأَنَّ زُهَيْرًا أَنْكَرَ أَنْ يَكُونَ هَذَا الْحَدِيثَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ ‏.‏ حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ لَيْثٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ حَدَّثَنَا هُرَيْمٌ بن مِسْعَرٍ، قَالَ حَدَّثَنَا فُضَيْلٌ، عَنْ لَيْثٍ، عَنْ طَاوُسٍ، قَالَ تَفْضُلاَنِ عَلَى كُلِّ سُورَةٍ مِنَ الْقُرْآنِ بِسَبْعِينَ حَسَنَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "(حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْحَرَشِيُّ الْبَصْرِيُّ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ سَلْمِ بْنِ صَالِحٍ الْعِجْلِيُّ، قَالَ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ قَرَأَ إِذَا زُلْزِلَتِ عُدِلَتْ لَهُ بِنِصْفِ الْقُرْآنِ وَمَنْ قَرَأَْ قُلْ يَا أَيُّهَا الْكَافِرُونَ ‏)‏ عُدِلَتْ لَهُ بِرُبْعِ الْقُرْآنِ وَمَنْ قَرَأَْ قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ عُدِلَتْ لَهُ بِثُلُثِ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ هَذَا الشَّيْخِ الْحَسَنِ بْنِ سَلْمٍ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَخْبَرَنَا يَمَانُ بْنُ الْمُغِيرَةِ الْعَنَزِيُّ، حَدَّثَنَا عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا زُلْزِلَتِ تَعْدِلُ نِصْفَ الْقُرْآنِ وَقُلْ هُوَ اللَّهُ أَحَدٌ تَعْدِلُ ثُلُثَ الْقُرْآنِ وَ قُلْْ يَا أَيُّهَا الْكَافِرُونَ تَعْدِلُ رُبُعَ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ يَمَانِ بْنِ الْمُغِيرَةِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2895,
			"arabicnumber": 2895,
			"text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ الْبَصْرِيُّ، قَالَ حَدَّثَنِي ابْنُ أَبِي فُدَيْكٍ، قَالَ أَخْبَرَنَا سَلَمَةُ بْنُ وَرْدَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَجُلٍ مِنْ أَصْحَابِهِ ‏\"‏ هَلْ تَزَوَّجْتَ يَا فُلاَنُ ‏\"‏ ‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ وَلاَ عِنْدِي مَا أَتَزَوَّجُ بِهِ ‏.‏ قَالَ ‏\"‏ أَلَيْسَ مَعَكَ ‏(‏قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ ‏\"‏ ‏.‏ قَالَ بَلَى ‏.‏ قَالَ ‏\"‏ ثُلُثُ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ أَلَيْسَ مَعَكَ ‏(‏ إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ ‏)‏ ‏\"‏ ‏.‏ قَالَ بَلَى ‏.‏ قَالَ ‏\"‏ رُبُعُ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ أَلَيْسَ مَعَكَ قُلْ يَا أَيُّهَا الْكَافِرُونَ ‏\"‏ ‏.‏ قَالَ بَلَى قَالَ ‏\"‏ رُبُعُ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ أَلَيْسَ مَعَكَ ‏(‏إِذَا زُلْزِلَتِ الأَرْضُ ‏)‏ ‏\"‏ ‏.‏ قَالَ بَلَى ‏.‏ قَالَ ‏\"‏ رُبُعُ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ تَزَوَّجْ تَزَوَّجْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "حَدَّثَنَا قُتَيْبَةُ وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ رَبِيعِ بْنِ خُثَيْمٍ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ امْرَأَةٍ، وَهِيَ امْرَأَةُ أَبِي أَيُّوبَ عَنْ أَبِي أَيُّوبَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَيَعْجَزُ أَحَدُكُمْ أَنْ يَقْرَأَ فِي لَيْلَةٍ ثُلُثَ الْقُرْآنِ مَنْ قَرَأَ اللَّهُ الْوَاحِدُ الصَّمَدُ فَقَدْ قَرَأَ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي الدَّرْدَاءِ وَأَبِي سَعِيدٍ وَقَتَادَةَ بْنِ النُّعْمَانِ وَأَبِي هُرَيْرَةَ وَأَنَسٍ وَابْنِ عُمَرَ وَأَبِي مَسْعُودٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَلاَ نَعْرِفُ أَحَدًا رَوَى هَذَا الْحَدِيثَ أَحْسَنَ مِنْ رِوَايَةِ زَائِدَةَ وَتَابَعَهُ عَلَى رِوَايَتِهِ إِسْرَائِيلُ وَالْفُضَيْلُ بْنُ عِيَاضٍ وَقَدْ رَوَى شُعْبَةُ وَغَيْرُ وَاحِدٍ مِنَ الثِّقَاتِ هَذَا الْحَدِيثَ عَنْ مَنْصُورٍ وَاضْطَرَبُوا فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، عَنِ ابْنِ حُنَيْنٍ، مَوْلًى لآلِ زَيْدِ بْنِ الْخَطَّابِ أَوْ مَوْلَى زَيْدِ بْنِ الْخَطَّابِ عَنْ أَبِي هُرَيْرَةَ، قَالَ أَقْبَلْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَمِعَ رَجُلاً يَقْرَأُْ ‏(‏قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ ‏)‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ قُلْتُ وَمَا وَجَبَتْ قَالَ ‏\"‏ الْجَنَّةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ مَالِكِ بْنِ أَنَسٍ وَابْنُ حُنَيْنٍ هُوَ عُبَيْدُ بْنُ حُنَيْنٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَرْزُوقٍ الْبَصْرِيُّ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ مَيْمُونٍ أَبُو سَهْلٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَرَأَ كُلَّ يَوْمٍ مِائَتَىْ مَرَّةٍ ‏(‏قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ مُحِيَ عَنْهُ ذُنُوبُ خَمْسِينَ سَنَةً إِلاَّ أَنْ يَكُونَ عَلَيْهِ دَيْنٌ ‏\"‏ ‏.‏ وَبِهَذَا الإِسْنَادِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَرَادَ أَنْ يَنَامَ عَلَى فِرَاشِهِ فَنَامَ عَلَى يَمِينِهِ ثُمَّ قَرَأَْ ‏(‏قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ مِئَةَ مَرَّةٍ فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ يَقُولُ لَهُ الرَّبُّ يَا عَبْدِي ادْخُلْ عَلَى يَمِينِكَ الْجَنَّةَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ ثَابِتٍ عَنْ أَنَسٍ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ أَيْضًا عَنْ ثَابِتٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "حَدَّثَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏(‏قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ تَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، قَالَ حَدَّثَنَا أَبُو حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْشِدُوا فَإِنِّي سَأَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ فَحَشَدَ مَنْ حَشَدَ ثُمَّ خَرَجَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَقَرَأَْ ‏(‏قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ ثُمَّ دَخَلَ فَقَالَ بَعْضُنَا لِبَعْضٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنِّي سَأَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏ إِنِّي لأُرَى هَذَا خَبَرٌ جَاءَهُ مِنَ السَّمَاءِ ثُمَّ خَرَجَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنِّي قُلْتُ سَأَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ أَلاَ وَإِنَّهَا تَعْدِلُ بثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَأَبُو حَازِمٍ الأَشْجَعِيُّ اسْمُهُ سَلْمَانُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَجُلٌ مِنَ الأَنْصَارِ يَؤُمُّهُمْ فِي مَسْجِدِ قُبَاءَ فَكَانَ كُلَّمَا افْتَتَحَ سُورَةً يَقْرَأُ لَهُمْ فِي الصَّلاَةِ يَقْرَأَ بِهَا افْتَتَحَ بِـ ‏(‏قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ حَتَّى يَفْرُغَ مِنْهَا ثُمَّ يَقْرَأُ بِسُورَةٍ مَعَهَا وَكَانَ يَصْنَعُ ذَلِكَ فِي كُلِّ رَكْعَةٍ فَكَلَّمَهُ أَصْحَابُهُ فَقَالُوا إِنَّكَ تَقْرَأُ بِهَذِهِ السُّورَةِ ثُمَّ لاَ تَرَى أَنَّهَا تُجْزِيكَ حَتَّى تَقْرَأَ بِسُورَةٍ أُخْرَى فَإِمَّا أَنْ تَقْرَأَ بِهَا وَإِمَّا أَنْ تَدَعَهَا وَتَقْرَأَ بِسُورَةٍ أُخْرَى ‏.‏ قَالَ مَا أَنَا بِتَارِكِهَا إِنْ أَحْبَبْتُمْ أَنْ أَؤُمَّكُمْ بِهَا فَعَلْتُ وَإِنْ كَرِهْتُمْ تَرَكْتُكُمْ ‏.‏ وَكَانُوا يَرَوْنَهُ أَفْضَلَهُمْ وَكَرِهُوا أَنْ يَؤُمَّهُمْ غَيْرُهُ فَلَمَّا أَتَاهُمُ النَّبِيُّ صلى الله عليه وسلم أَخْبَرُوهُ الْخَبَرَ فَقَالَ ‏\"‏ يَا فُلاَنُ مَا يَمْنَعُكَ مِمَّا يَأْمُرُ بِهِ أَصْحَابُكَ وَمَا يَحْمِلُكَ أَنْ تَقْرَأَ هَذِهِ السُّورَةَ فِي كُلِّ رَكْعَةٍ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ حُبَّهَا أَدْخَلَكَ الْجَنَّةَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ ثَابِتٍ ‏البُنَانِيُّ وَ قد رَوَى مُبَارَكُ بْنُ فَضَالَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ هَذِهِ السُّورَةَْ ‏(‏قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ فَقَالَ ‏\"‏ إِنَّ حُبَّكَ إِيَّاهَا يُدْخِلُكَ الْجَنَّةَ ‏\"‏ ‏.‏ حَدَّثَنَا بِذَلِكَ أَبُو دَاوُدَ سُلَيْمَانُ بْنُ الأَشْعَثِ قَالَ حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ بِهَذَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ أَخْبَرَنِي قَيْسُ بْنُ أَبِي حَازِمٍ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قَدْ أَنْزَلَ اللَّهُ عَلَىَّ آيَاتٍ لَمْ يُرَ مِثْلُهُنَّ ‏(‏قُلْ أَعُوذُ بِرَبِّ النَّاسِ ‏)‏ إِلَى آخِرِ السُّورَةِ وَ ‏(‏قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ‏)‏ إِلَى آخِرِ السُّورَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عُلَىِّ بْنِ رَبَاحٍ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَقْرَأَ بِالْمُعَوِّذَتَيْنِ فِي دُبُرِ كُلِّ صَلاَةٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ حَدَّثَنَا شُعْبَةُ، وَهِشَامٌ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الَّذِي يَقْرَأُ الْقُرْآنَ وَهُوَ مَاهِرٌ بِهِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَؤُهُ قَالَ هِشَامٌ وَهُوَ شَدِيدٌ عَلَيْهِ قَالَ شُعْبَةُ وَهُوَ عَلَيْهِ شَاقٌّ فَلَهُ أَجْرَانِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَخْبَرَنَا حَفْصُ بْنُ سُلَيْمَانَ، عَنْ كَثِيرِ بْنِ زَاذَانَ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ قَرَأَ الْقُرْآنَ وَاسْتَظْهَرَهُ فَأَحَلَّ حَلاَلَهُ وَحَرَّمَ حَرَامَهُ أَدْخَلَهُ اللَّهُ بِهِ الْجَنَّةَ وَشَفَّعَهُ فِي عَشَرَةٍ مِنْ أَهْلِ بَيْتِهِ كُلُّهُمْ وَجَبَتْ لَهُ النَّارُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادٌ صَحِيحٍ ‏.‏ وَحَفْصُ بْنُ سُلَيْمَانَ أَبُو عُمَرَ بَزَّازٌ كُوفِيٌّ يُضَعَّفُ فِي الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ، قَالَ سَمِعْتُ حَمْزَةَ الزَّيَّاتَ، عَنْ أَبِي الْمُخْتَارِ الطَّائِيِّ، عَنِ ابْنِ أَخِي الْحَارِثِ الأَعْوَرِ، عَنِ الْحَارِثِ، قَالَ مَرَرْتُ فِي الْمَسْجِدِ فَإِذَا النَّاسُ يَخُوضُونَ فِي الأَحَادِيثِ فَدَخَلْتُ عَلَى عَلِيٍّ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ أَلاَ تَرَى أَنَّ النَّاسَ قَدْ خَاضُوا فِي الأَحَادِيثِ ‏.‏ قَالَ أَوَقَدْ فَعَلُوهَا قُلْتُ نَعَمْ ‏.‏ قَالَ أَمَا إِنِّي قَدْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَلاَ إِنَّهَا سَتَكُونُ فِتْنَةٌ ‏\"‏ ‏.‏ فَقُلْتُ مَا الْمَخْرَجُ مِنْهَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ كِتَابُ اللَّهِ فِيهِ نَبَأُ مَا كَانَ قَبْلَكُمْ وَخَبَرُ مَا بَعْدَكُمْ وَحُكْمُ مَا بَيْنَكُمْ هُوَ الْفَصْلُ لَيْسَ بِالْهَزْلِ مَنْ تَرَكَهُ مِنْ جَبَّارٍ قَصَمَهُ اللَّهُ وَمَنِ ابْتَغَى الْهُدَى فِي غَيْرِهِ أَضَلَّهُ اللَّهُ وَهُوَ حَبْلُ اللَّهِ الْمَتِينُ وَهُوَ الذِّكْرُ الْحَكِيمُ وَهُوَ الصِّرَاطُ الْمُسْتَقِيمُ هُوَ الَّذِي لاَ تَزِيغُ بِهِ الأَهْوَاءُ وَلاَ تَلْتَبِسُ بِهِ الأَلْسِنَةُ وَلاَ يَشْبَعُ مِنْهُ الْعُلَمَاءُ وَلاَ يَخْلَقُ عَلَى كَثْرَةِ الرَّدِّ وَلاَ تَنْقَضِي عَجَائِبُهُ هُوَ الَّذِي لَمْ تَنْتَهِ الْجِنُّ إِذْ سَمِعَتْهُ حَتَّى قَالُوا ‏(‏إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا * يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ‏)‏ مَنْ قَالَ بِهِ صَدَقَ وَمَنْ عَمِلَ بِهِ أُجِرَ وَمَنْ حَكَمَ بِهِ عَدَلَ وَمَنْ دَعَا إِلَيْهِ هُدِيَ إِلَى صِرَاطٍ مُسْتَقِيمٍ ‏\"‏ ‏.‏ خُذْهَا إِلَيْكَ يَا أَعْوَرُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ حَمْزَةَ الزًّيَّاتِ وَإِسْنَادُهُ مَجْهُولٌ ‏.‏ وَفِي حَدِيثِ الْحَارِثِ مَقَالٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، أَنْبَأَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَلْقَمَةُ بْنُ مَرْثَدٍ، قَالَ سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ، يُحَدِّثُ عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ فَذَاكَ الَّذِي أَقْعَدَنِي مَقْعَدِي هَذَا ‏.‏ وَعَلَّمَ الْقُرْآنَ فِي زَمَنِ عُثْمَانَ حَتَّى بَلَغَ الْحَجَّاجَ بْنَ يُوسُفَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خَيْرُكُمْ - أَوْ أَفْضَلُكُمْ - مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهَكَذَا رَوَى عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَغَيْرُ وَاحِدٍ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عُثْمَانَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَسُفْيَانُ لاَ يَذْكُرُ فِيهِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ ‏.‏ وَقَدْ رَوَى يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، هَذَا الْحَدِيثَ عَنْ سُفْيَانَ، وَشُعْبَةَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عُثْمَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم. حَدَّثَنَا بِذَلِكَ، مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ وَشُعْبَةَ ‏.‏ قَالَ مُحَمَّدُ بْنُ بَشَّارٍ وَهَكَذَا ذَكَرَهُ يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ، وَشُعْبَةَ، غَيْرَ مَرَّةٍ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عُثْمَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ مُحَمَّدُ بْنُ بَشَّارٍ وَأَصْحَابُ سُفْيَانَ لاَ يَذْكُرُونَ فِيهِ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ عُبَيْدَةَ ‏.‏ قَالَ مُحَمَّدُ بْنُ بَشَّارٍ وَهُوَ أَصَحُّ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ زَادَ شُعْبَةُ فِي إِسْنَادِ هَذَا الْحَدِيثِ سَعْدَ بْنَ عُبَيْدَةَ وَكَأَنَّ حَدِيثَ سُفْيَانَ أَشْبَهُ ‏.‏ قَالَ عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ يَحْيَى بْنُ سَعِيدٍ مَا أَحَدٌ يَعْدِلُ عِنْدِي شُعْبَةَ وَإِذَا خَالَفَهُ سُفْيَانُ أَخَذْتُ بِقَوْلِ سُفْيَانَ ‏.‏ قَالَ أَبُو عِيسَى سَمِعْتُ أَبَا عَمَّارٍ يَذْكُرُ عَنْ وَكِيعٍ قَالَ قَالَ شُعْبَةُ سُفْيَانُ أَحْفَظُ مِنِّي وَمَا حَدَّثَنِي سُفْيَانُ عَنْ أَحَدٍ بِشَيْءٍ فَسَأَلْتُهُ إِلاَّ وَجَدْتُهُ كَمَا حَدَّثَنِي ‏.‏ وَفِي الْبَابِ عَنْ عَلِيٍّ وَسَعْدٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ سَعْدٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ ‏\"‏ ‏.‏ وَهَذَا حَدِيثٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ عَلِيٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، قَالَ حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ، عَنْ أَيُّوبَ بْنِ مُوسَى، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ كَعْبٍ الْقُرَظِيَّ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا لاَ أَقُولُ الم حَرْفٌ وَلَكِنْ أَلِفٌ حَرْفٌ وَلاَمٌ حَرْفٌ وَمِيمٌ حَرْفٌ ‏\"‏ ‏.‏ وَيُرْوَى هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنِ ابْنِ مَسْعُودٍ وَرَوَاهُ أَبُو الأَحْوَصِ عَنِ ابْنِ مَسْعُودٍ رَفَعَهُ بَعْضُهُمْ وَوَقَفَهُ بَعْضُهُمْ عَنِ ابْنِ مَسْعُودٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ سَمِعْتُ قُتَيْبَةَ بْنَ سَعِيدٍ يَقُولُ بَلَغَنِي أَنَّ مُحَمَّدَ بْنَ كَعْبٍ الْقُرَظِيَّ وُلِدَ فِي حَيَاةِ النَّبِيِّ صلى الله عليه وسلم وَمُحَمَّدُ بْنُ كَعْبٍ يُكْنَى أَبَا حَمْزَةَ ‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ حَدَّثَنَا أَبُو النَّضْرِ، قَالَ حَدَّثَنَا بَكْرُ بْنُ خُنَيْسٍ، عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ، عَنْ زَيْدِ بْنِ أَرْطَاةَ، عَنْ أَبِي أُمَامَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَا أَذِنَ اللَّهُ لِعَبْدٍ فِي شَيْءٍ أَفْضَلَ مِنْ رَكْعَتَيْنِ يُصَلِّيهِمَا وَإِنَّ الْبِرَّ لَيُذَرُّ عَلَى رَأْسِ الْعَبْدِ مَا دَامَ فِي صَلاَتِهِ وَمَا تَقَرَّبَ الْعِبَادُ إِلَى اللَّهِ بِمِثْلِ مَا خَرَجَ مِنْهُ ‏\"‏ ‏.‏ قَالَ أَبُو النَّضْرِ يَعْنِي الْقُرْآنَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَبَكْرُ بْنُ خُنَيْسٍ قَدْ تَكَلَّمَ فِيهِ ابْنُ الْمُبَارَكِ وَتَرَكَهُ فِي آخِرِ أَمْرِهِ ‏. وَقَدْ رُوِيَ هَذَا الْحَدِيثُ، عَنْ زَيْدِ بْنِ أَرْطَاةَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلٌ ‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "حَدَّثَنَا بِذَلِكَ إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ، عَنِ الْعَلاَءِ بْنِ الْحَارِثِ، عَنْ زَيْدِ بْنِ أَرْطَاةَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّكُمْ لَنْ تَرْجِعُوا إِلَى اللَّهِ بِأَفْضَلَ مِمَّا خَرَجَ مِنْهُ ‏\"‏ ‏.‏ يَعْنِي الْقُرْآنَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ قَابُوسِ بْنِ أَبِي ظَبْيَانَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الَّذِي لَيْسَ فِي جَوْفِهِ شَيْءٌ مِنَ الْقُرْآنِ كَالْبَيْتِ الْخَرِبِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ وَأَبُو نُعَيْمٍ، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُقَالُ يَعْنِي لِصَاحِبِ الْقُرْآنِ اقْرَأْ وَارْتَقِ وَرَتِّلْ كَمَا كُنْتَ تُرَتِّلُ فِي الدُّنْيَا فَإِنَّ مَنْزِلَتَكَ عِنْدَ آخِرِ آيَةٍ تَقْرَأُ بِهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا بُنْدَارٌ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عَاصِمٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ عَاصِمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَجِيءُ الْقُرْآنُ يَوْمَ الْقِيَامَةِ فَيَقُولُ يَا رَبِّ حَلِّهِ فَيُلْبَسَ تَاجَ الْكَرَامَةِ ثُمَّ يَقُولُ يَا رَبِّ زِدْهُ فَيُلْبَسَ حُلَّةَ الْكَرَامَةِ ثُمَّ يَقُولُ يَا رَبِّ ارْضَ عَنْهُ فَيَرْضَى عَنْهُ فَيُقَالُ لَهُ اقْرَأْ وَارْقَ وَيُزَادُ بِكُلِّ آيَةٍ حَسَنَةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَهُ وَلَمْ يَرْفَعْهُ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ عِنْدَنَا مِنْ حَدِيثِ عَبْدِ الصَّمَدِ عَنْ شُعْبَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الْحَكَمِ الْوَرَّاقُ الْبَغْدَادِيُّ، قَالَ حَدَّثَنَا عَبْدُ الْمَجِيدِ بْنُ عَبْدِ الْعَزِيزِ، عَنِ ابْنِ جُرَيْجٍ، عَنِ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ عُرِضَتْ عَلَىَّ أُجُورُ أُمَّتِي حَتَّى الْقَذَاةِ يُخْرِجُهَا الرَّجُلُ مِنَ الْمَسْجِدِ وَعُرِضَتْ عَلَىَّ ذُنُوبُ أَمَّتِي فَلَمْ أَرَ ذَنْبًا أَعْظَمَ مِنْ سُورَةٍ مِنَ الْقُرْآنِ أَوْ آيَةٍ أُوتِيهَا رَجُلٌ ثُمَّ نَسِيَهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ قَالَ وَذَاكَرْتُ بِهِ مُحَمَّدَ بْنَ إِسْمَاعِيلَ فَلَمْ يَعْرِفْهُ وَاسْتَغْرَبَهُ ‏.‏ قَالَ مُحَمَّدٌ وَلاَ أَعْرِفُ لِلْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ سَمَاعًا مِنْ أَحَدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ قَوْلَهُ حَدَّثَنِي مَنْ شَهِدَ خُطْبَةَ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ وَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ لاَ نَعْرِفُ لِلْمُطَّلِبِ سَمَاعًا مِنْ أَحَدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ عَبْدُ اللَّهِ وَأَنْكَرَ عَلِيُّ بْنُ الْمَدِينِيِّ أَنْ يَكُونَ الْمُطَّلِبُ سَمِعَ مِنْ أَنَسٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ خَيْثَمَةَ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّهُ مَرَّ عَلَى قَارِىءٍ يَقْرَأُ ثُمَّ سَأَلَ فَاسْتَرْجَعَ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ قَرَأَ الْقُرْآنَ فَلْيَسْأَلِ اللَّهَ بِهِ فَإِنَّهُ سَيَجِيءُ أَقْوَامٌ يَقْرَءُونَ الْقُرْآنَ يَسْأَلُونَ بِهِ النَّاسَ ‏\"‏ ‏.‏ وَقَالَ مَحْمُودٌ هَذَا خَيْثَمَةُ الْبَصْرِيُّ الَّذِي رَوَى عَنْهُ جَابِرٌ الْجُعْفِيُّ وَلَيْسَ هُوَ خَيْثَمَةَ بْنَ عَبْدِ الرَّحْمَنِ وَخَيْثَمَةُ هَذَا شَيْخٌ بَصْرِيٌّ يُكْنَى أَبَا نَصْرٍ قَدْ رَوَى عَنْ أَنَسِ بْنِ مَالِكٍ أَحَادِيثَ وَقَدْ رَوَى جَابِرٌ الْجُعْفِيُّ عَنْ خَيْثَمَةَ هَذَا أَيْضًا أَحَادِيثَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ لَيْسَ إِسْنَادُهُ بِذَاكَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ الْوَاسِطِيُّ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا أَبُو فَرْوَةَ، يَزِيدُ بْنُ سِنَانٍ عَنْ أَبِي الْمُبَارَكِ، عَنْ صُهَيْبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا آمَنَ بِالْقُرْآنِ مَنِ اسْتَحَلَّ مَحَارِمَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ وَقَدْ خُولِفَ وَكِيعٌ فِي رِوَايَتِهِ ‏.‏ وَقَالَ مُحَمَّدٌ أَبُو فَرْوَةَ يَزِيدُ بْنُ سِنَانٍ الرُّهَاوِيُّ لَيْسَ بِحَدِيثِهِ بَأْسٌ إِلاَّ رِوَايَةَ ابْنِهِ مُحَمَّدٍ عَنْهُ فَإِنَّهُ يَرْوِي عَنْهُ مَنَاكِيرَ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَوَى مُحَمَّدُ بْنُ يَزِيدَ بْنِ سِنَانٍ عَنْ أَبِيهِ هَذَا الْحَدِيثَ فَزَادَ فِي هَذَا الإِسْنَادِ عَنْ مُجَاهِدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ صُهَيْبٍ وَلاَ يُتَابَعُ مُحَمَّدُ بْنُ يَزِيدَ عَلَى رِوَايَتِهِ وَهُوَ ضَعِيفٌ وَأَبُو الْمُبَارَكِ رَجُلٌ مَجْهُولٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْجَاهِرُ بِالْقُرْآنِ كَالْجَاهِرِ بِالصَّدَقَةِ وَالْمُسِرُّ بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَمَعْنَى هَذَا الْحَدِيثِ أَنَّ الَّذِي يُسِرُّ بِقِرَاءَةِ الْقُرْآنِ أَفْضَلُ مِنَ الَّذِي يَجْهَرُ بِقِرَاءَةِ الْقُرْآنِ لأَنَّ صَدَقَةَ السِّرِّ أَفْضَلُ عِنْدَ أَهْلِ الْعِلْمِ مِنْ صَدَقَةِ الْعَلاَنِيَةِ وَإِنَّمَا مَعْنَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لِكَىْ يَأْمَنَ الرَّجُلُ مِنَ الْعُجُبِ لأَنَّ الَّذِي يُسِرُّ الْعَمَلَ لاَ يُخَافُ عَلَيْهِ الْعُجْبُ مَا يُخَافُ عَلَيْهِ مِنْ عَلاَنِيَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَبِي لُبَابَةَ، قَالَ قَالَتْ عَائِشَةُ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَنَامُ حَتَّى يَقْرَأَ بَنِي إِسْرَائِيلَ وَالزُّمَرَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَأَبُو لُبَابَةَ شَيْخٌ بَصْرِيٌّ قَدْ رَوَى عَنْهُ حَمَّادُ بْنُ زَيْدٍ غَيْرَ حَدِيثٍ وَيُقَالُ اسْمُهُ مَرْوَانُ ‏.‏ أَخْبَرَنِي بِذَلِكَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ فِي كِتَابِ التَّارِيخِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَخْبَرَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بِلاَلٍ، عَنْ عِرْبَاضِ بْنِ سَارِيَةَ، أَنَّهُ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ الْمُسَبِّحَاتِ قَبْلَ أَنْ يَرْقُدَ وَيَقُولُ ‏ \"‏ إِنَّ فِيهِنَّ آيَةً خَيْرٌ مِنْ أَلْفِ آيَةٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ طَهْمَانَ أَبُو الْعَلاَءِ الْخَفَّافُ، قَالَ حَدَّثَنِي نَافِعُ بْنُ أَبِي نَافِعٍ، عَنْ مَعْقِلِ بْنِ يَسَارٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَالَ حِينَ يُصْبِحُ ثَلاَثَ مَرَّاتٍ أَعُوذُ بِاللَّهِ السَّمِيعِ الْعَلِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ وَقَرَأَ ثَلاَثَ آيَاتٍ مِنْ آخِرِ سُورَةِ الْحَشْرِ وَكَّلَ اللَّهُ بِهِ سَبْعِينَ أَلْفَ مَلَكٍ يُصَلُّونَ عَلَيْهِ حَتَّى يُمْسِيَ وَإِنْ مَاتَ فِي ذَلِكَ الْيَوْمِ مَاتَ شَهِيدًا وَمَنْ قَالَهَا حِينَ يُمْسِي كَانَ بِتِلْكَ الْمَنْزِلَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ يَعْلَى بْنِ مَمْلَكٍ، أَنَّهُ سَأَلَ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم عَنْ قِرَاءَةِ النَّبِيِّ صلى الله عليه وسلم وَصَلاَتِهِ فَقَالَتْ مَا لَكُمْ وَصَلاَتَهُ كَانَ يُصَلِّي ثُمَّ يَنَامُ قَدْرَ مَا صَلَّى ثُمَّ يُصَلِّي قَدْرَ مَا نَامَ ثُمَّ يَنَامُ قَدْرَ مَا صَلَّى حَتَّى يُصْبِحَ ثُمَّ نَعَتَتْ قِرَاءَتَهُ فَإِذَا هِيَ تَنْعَتُ قِرَاءَةً مُفَسَّرَةً حَرْفًا حَرْفًا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ لَيْثِ بْنِ سَعْدٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ يَعْلَى بْنِ مَمْلَكٍ عَنْ أُمِّ سَلَمَةَ ‏.‏ وَقَدْ رَوَى ابْنُ جُرَيْجٍ هَذَا الْحَدِيثَ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُقَطِّعُ قِرَاءَتَهُ ‏.‏ وَحَدِيثُ لَيْثِ أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، هُوَ رَجُلٌ بَصْرِيٌّ قَالَ سَأَلْتُ عَائِشَةَ عَنْ وِتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَيْفَ كَانَ يُوتِرُ مِنْ أَوَّلِ اللَّيْلِ أَوْ مِنْ آخِرِهِ فَقَالَتْ كُلُّ ذَلِكَ قَدْ كَانَ يَصْنَعُ رُبَّمَا أَوْتَرَ مِنْ أَوَّلِ اللَّيْلِ وَرُبَّمَا أَوْتَرَ مِنْ آخِرِهِ ‏.‏ فَقُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الأَمْرِ سَعَةً فَقُلْتُ كَيْفَ كَانَتْ قِرَاءَتُهُ أَكَانَ يُسِرُّ بِالْقِرَاءَةِ أَمْ يَجْهَرُ قَالَتْ كُلُّ ذَلِكَ كَانَ يَفْعَلُ قَدْ كَانَ رُبَّمَا أَسَرَّ وَرُبَّمَا جَهَرَ قَالَ فَقُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الأَمْرِ سَعَةً قَالَ قُلْتُ فَكَيْفَ كَانَ يَصْنَعُ فِي الْجَنَابَةِ أَكَانَ يَغْتَسِلُ قَبْلَ أَنْ يَنَامَ أَمْ يَنَامُ قَبْلَ أَنْ يَغْتَسِلَ قَالَتْ كُلُّ ذَلِكَ قَدْ كَانَ يَفْعَلُ فَرُبَّمَا اغْتَسَلَ فَنَامَ وَرُبَّمَا تَوَضَّأَ فَنَامَ قُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الأَمْرِ سَعَةً ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا إِسْرَائِيلُ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ الْمُغِيرَةِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْرِضُ نَفْسَهُ بِالْمَوْقِفِ فَقَالَ ‏ \"‏ أَلاَ رَجُلٌ يَحْمِلُنِي إِلَى قَوْمِهِ فَإِنَّ قُرَيْشًا قَدْ مَنَعُونِي أَنْ أُبَلِّغَ كَلاَمَ رَبِّي ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ الْعَبْدِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ بْنِ أَبِي يَزِيدَ الْهَمْدَانِيُّ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَقُولُ الرَّبُّ عَزَّ وَجَلَّ مَنْ شَغَلَهُ الْقُرْآنُ عَنْ ذِكْرِي وَ مَسْأَلَتِي أَعْطَيْتُهُ أَفْضَلَ مَا أُعْطِي السَّائِلِينَ وَفَضْلُ كَلاَمِ اللَّهِ عَلَى سَائِرِ الْكَلاَمِ كَفَضْلِ اللَّهِ عَلَى خَلْقِهِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 52
			}
		}
	]
}