{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"12": "The Book of The At-Tatbiq (Clasping One's Hands Together)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ، أَنَّهُ حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا مُوسَى، قَالَ إِنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم خَطَبَنَا وَبَيَّنَ لَنَا سُنَّتَنَا وَعَلَّمَنَا صَلاَتَنَا فَقَالَ ‏\"‏ إِذَا صَلَّيْتُمْ فَأَقِيمُوا صُفُوفَكُمْ ثُمَّ لْيَؤُمَّكُمْ أَحَدُكُمْ فَإِذَا كَبَّرَ الإِمَامُ فَكَبِّرُوا وَإِذَا قَرَأَ ‏{‏ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ ‏}‏ فَقُولُوا آمِينَ يُجِبْكُمُ اللَّهُ وَإِذَا كَبَّرَ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا فَإِنَّ الإِمَامَ يَرْكَعُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ ‏\"‏ ‏.‏ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتِلْكَ بِتِلْكَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ يَسْمَعِ اللَّهُ لَكُمْ فَإِنَّ اللَّهَ قَالَ عَلَى لِسَانِ نَبِيِّهِ صلى الله عليه وسلم سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَإِذَا كَبَّرَ وَسَجَدَ فَكَبِّرُو وَاسْجُدُوا فَإِنَّ الإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتِلْكَ بِتِلْكَ فَإِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ أَوَّلِ قَوْلِ أَحَدِكُمُ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ سَلاَمٌ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ سَلاَمٌ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ سَبْعَ كَلِمَاتٍ وَهِيَ تَحِيَّةُ الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 36
			}
		}
	]
}