{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"14": "The Book of Jumu'ah (Friday Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَيْتُ الطُّورَ فَوَجَدْتُ ثَمَّ كَعْبًا فَمَكَثْتُ أَنَا وَهُوَ يَوْمًا أُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَيُحَدِّثُنِي عَنِ التَّوْرَاةِ فَقُلْتُ لَهُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ قُبِضَ وَفِيهِ تَقُومُ السَّاعَةُ مَا عَلَى الأَرْضِ مِنْ دَابَّةٍ إِلاَّ وَهِيَ تُصْبِحُ يَوْمَ الْجُمُعَةِ مُصِيخَةً حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنَ السَّاعَةِ إِلاَّ ابْنَ آدَمَ وَفِيهِ سَاعَةٌ لاَ يُصَادِفُهَا مُؤْمِنٌ وَهُوَ فِي الصَّلاَةِ يَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ فَقَالَ كَعْبٌ ذَلِكَ يَوْمٌ فِي كُلِّ سَنَةٍ ‏.‏ فَقُلْتُ بَلْ هِيَ فِي كُلِّ جُمُعَةٍ ‏.‏ فَقَرَأَ كَعْبٌ التَّوْرَاةَ ثُمَّ قَالَ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ فِي كُلِّ جُمُعَةٍ ‏.‏ فَخَرَجْتُ فَلَقِيتُ بَصْرَةَ بْنَ أَبِي بَصْرَةَ الْغِفَارِيَّ فَقَالَ مِنْ أَيْنَ جِئْتَ قُلْتُ مِنَ الطُّورِ ‏.‏ قَالَ لَوْ لَقِيتُكَ مِنْ قَبْلِ أَنْ تَأْتِيَهُ لَمْ تَأْتِهِ ‏.‏ قُلْتُ لَهُ وَلِمَ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُعْمَلُ الْمَطِيُّ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ الْمَسْجِدِ الْحَرَامِ وَمَسْجِدِي وَمَسْجِدِ بَيْتِ الْمَقْدِسِ ‏\"‏ ‏.‏ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ سَلاَمٍ فَقُلْتُ لَوْ رَأَيْتَنِي خَرَجْتُ إِلَى الطُّورِ فَلَقِيتُ كَعْبًا فَمَكَثْتُ أَنَا وَهُوَ يَوْمًا أُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَيُحَدِّثُنِي عَنِ التَّوْرَاةِ فَقُلْتُ لَهُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ قُبِضَ وَفِيهِ تَقُومُ السَّاعَةُ مَا عَلَى الأَرْضِ مِنْ دَابَّةٍ إِلاَّ وَهِيَ تُصْبِحُ يَوْمَ الْجُمُعَةِ مُصِيخَةً حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنَ السَّاعَةِ إِلاَّ ابْنَ آدَمَ وَفِيهِ سَاعَةٌ لاَ يُصَادِفُهَا عَبْدٌ مُؤْمِنٌ وَهُوَ فِي الصَّلاَةِ يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ قَالَ كَعْبٌ ذَلِكَ يَوْمٌ فِي كُلِّ سَنَةٍ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ كَذَبَ كَعْبٌ ‏.‏ قُلْتُ ثُمَّ قَرَأَ كَعْبٌ فَقَالَ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ فِي كُلِّ جُمُعَةٍ ‏.‏ فَقَالَ عَبْدُ اللَّهِ صَدَقَ كَعْبٌ إِنِّي لأَعْلَمُ تِلْكَ السَّاعَةَ فَقُلْتُ يَا أَخِي حَدِّثْنِي بِهَا ‏.‏ قَالَ هِيَ آخِرُ سَاعَةٍ مِنْ يَوْمِ الْجُمُعَةِ قَبْلَ أَنْ تَغِيبَ الشَّمْسُ فَقُلْتُ أَلَيْسَ قَدْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يُصَادِفُهَا مُؤْمِنٌ وَهُوَ فِي الصَّلاَةِ ‏\"‏ ‏.‏ وَلَيْسَتْ تِلْكَ السَّاعَةَ صَلاَةٌ قَالَ أَلَيْسَ قَدْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ صَلَّى وَجَلَسَ يَنْتَظِرُ الصَّلاَةَ لَمْ يَزَلْ فِي صَلاَتِهِ حَتَّى تَأْتِيَهُ الصَّلاَةُ الَّتِي تُلاَقِيهَا ‏\"‏ ‏.‏ قُلْتُ بَلَى ‏.‏ قَالَ فَهُوَ كَذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 67
			}
		}
	]
}