{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"20": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ سَعْدِ بْنِ هِشَامٍ، أَنَّهُ لَقِيَ ابْنَ عَبَّاسٍ فَسَأَلَهُ عَنِ الْوَتْرِ، فَقَالَ أَلاَ أُنَبِّئُكَ بِأَعْلَمِ أَهْلِ الأَرْضِ بِوِتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ ‏.‏ قَالَ عَائِشَةُ ائْتِهَا فَسَلْهَا ثُمَّ ارْجِعْ إِلَىَّ فَأَخْبِرْنِي بِرَدِّهَا عَلَيْكَ فَأَتَيْتُ عَلَى حَكِيمِ بْنِ أَفْلَحَ فَاسْتَلْحَقْتُهُ إِلَيْهَا فَقَالَ مَا أَنَا بِقَارِبِهَا إِنِّي نَهَيْتُهَا أَنْ تَقُولَ فِي هَاتَيْنِ الشِّيعَتَيْنِ شَيْئًا فَأَبَتْ فِيهَا إِلاَّ مُضِيًّا ‏.‏ فَأَقْسَمْتُ عَلَيْهِ فَجَاءَ مَعِي فَدَخَلَ عَلَيْهَا فَقَالَتْ لِحَكِيمٍ مَنْ هَذَا مَعَكَ قُلْتُ سَعْدُ بْنُ هِشَامٍ ‏.‏ قَالَتْ مَنْ هِشَامٌ قُلْتُ ابْنُ عَامِرٍ ‏.‏ فَتَرَحَّمَتْ عَلَيْهِ وَقَالَتْ نِعْمَ الْمَرْءُ كَانَ عَامِرًا ‏.‏ قَالَ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ خُلُقِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ أَلَيْسَ تَقْرَأُ الْقُرْآنَ قَالَ قُلْتُ بَلَى ‏.‏ قَالَتْ فَإِنَّ خُلُقَ نَبِيِّ اللَّهِ صلى الله عليه وسلم الْقُرْآنُ ‏.‏ فَهَمَمْتُ أَنْ أَقُومَ فَبَدَا لِي قِيَامُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ قِيَامِ نَبِيِّ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ أَلَيْسَ تَقْرَأُ هَذِهِ السُّورَةَ ‏{‏ يَا أَيُّهَا الْمُزَّمِّلُ ‏}‏ قُلْتُ بَلَى ‏.‏ قَالَتْ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ افْتَرَضَ قِيَامَ اللَّيْلِ فِي أَوَّلِ هَذِهِ السُّورَةِ فَقَامَ نَبِيُّ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ حَوْلاً حَتَّى انْتَفَخَتْ أَقْدَامُهُمْ وَأَمْسَكَ اللَّهُ عَزَّ وَجَلَّ خَاتِمَتَهَا اثْنَىْ عَشَرَ شَهْرًا ثُمَّ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ التَّخْفِيفَ فِي آخِرِ هَذِهِ السُّورَةِ فَصَارَ قِيَامُ اللَّيْلِ تَطَوُّعًا بَعْدَ أَنْ كَانَ فَرِيضَةً فَهَمَمْتُ أَنْ أَقُومَ فَبَدَا لِي وِتْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ وِتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ كُنَّا نُعِدُّ لَهُ سِوَاكَهُ وَطَهُورَهُ فَيَبْعَثُهُ اللَّهُ عَزَّ وَجَلَّ لِمَا شَاءَ أَنْ يَبْعَثَهُ مِنَ اللَّيْلِ فَيَتَسَوَّكُ وَيَتَوَضَّأُ وَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ لاَ يَجْلِسُ فِيهِنَّ إِلاَّ عِنْدَ الثَّامِنَةِ يَجْلِسُ فَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَيَدْعُو ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا يُسَلِّمُ ثُمَّ يُصَلِّي رَكْعَةً فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَىَّ فَلَمَّا أَسَنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعٍ وَصَلَّى رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا سَلَّمَ فَتِلْكَ تِسْعُ رَكَعَاتٍ يَا بُنَىَّ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى صَلاَةً أَحَبَّ أَنْ يَدُومَ عَلَيْهَا وَكَانَ إِذَا شَغَلَهُ عَنْ قِيَامِ اللَّيْلِ نَوْمٌ أَوْ مَرَضٌ أَوْ وَجَعٌ صَلَّى مِنَ النَّهَارِ اثْنَتَىْ عَشْرَةَ رَكْعَةً وَلاَ أَعْلَمُ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلاَ قَامَ لَيْلَةً كَامِلَةً حَتَّى الصَّبَاحِ وَلاَ صَامَ شَهْرًا كَامِلاً غَيْرَ رَمَضَانَ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَحَدَّثْتُهُ بِحَدِيثِهَا فَقَالَ صَدَقَتْ أَمَا أَنِّي لَوْ كُنْتُ أَدْخُلُ عَلَيْهَا لأَتَيْتُهَا حَتَّى تُشَافِهَنِي مُشَافَهَةً ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ كَذَا وَقَعَ فِي كِتَابِي وَلاَ أَدْرِي مِمَّنِ الْخَطَأُ فِي مَوْضِعِ وِتْرِهِ عَلَيْهِ السَّلاَمُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		}
	]
}