{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"22": "The Book of Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2092,
			"arabicnumber": 2092,
			"text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، عَنِ اللَّيْثِ، عَنْ سَعِيدٍ، عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ بَيْنَا نَحْنُ جُلُوسٌ فِي الْمَسْجِدِ جَاءَ رَجُلٌ عَلَى جَمَلٍ فَأَنَاخَهُ فِي الْمَسْجِدِ ثُمَّ عَقَلَهُ فَقَالَ لَهُمْ أَيُّكُمْ مُحَمَّدٌ - وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُتَّكِئٌ بَيْنَ ظَهْرَانَيْهِمْ - قُلْنَا لَهُ هَذَا الرَّجُلُ الأَبْيَضُ الْمُتَّكِئُ فَقَالَ لَهُ الرَّجُلُ يَا ابْنَ عَبْدِ الْمُطَّلِبِ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَجَبْتُكَ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ إِنِّي سَائِلُكَ يَا مُحَمَّدُ فَمُشَدِّدٌ عَلَيْكَ فِي الْمَسْأَلَةِ فَلاَ تَجِدَنَّ فِي نَفْسِكَ ‏.‏ قَالَ ‏\"‏ سَلْ مَا بَدَا لَكَ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ نَشَدْتُكَ بِرَبِّكَ وَرَبِّ مَنْ قَبْلَكَ آللَّهُ أَرْسَلَكَ إِلَى النَّاسِ كُلِّهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَأَنْشُدُكَ اللَّهَ آللَّهُ أَمَرَكَ أَنْ تُصَلِّيَ الصَّلَوَاتِ الْخَمْسَ فِي الْيَوْمِ وَاللَّيْلَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَأَنْشُدُكَ اللَّهَ آللَّهُ أَمَرَكَ أَنْ تَصُومَ هَذَا الشَّهْرَ مِنَ السَّنَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَأَنْشُدُكَ اللَّهَ آللَّهُ أَمَرَكَ أَنْ تَأْخُذَ هَذِهِ الصَّدَقَةَ مِنْ أَغْنِيَائِنَا فَتَقْسِمَهَا عَلَى فُقَرَائِنَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ آمَنْتُ بِمَا جِئْتَ بِهِ وَأَنَا رَسُولُ مَنْ وَرَائِي مِنْ قَوْمِي وَأَنَا ضِمَامُ بْنُ ثَعْلَبَةَ أَخُو بَنِي سَعْدِ بْنِ بَكْرٍ ‏.‏ خَالَفَهُ يَعْقُوبُ بْنُ إِبْرَاهِيمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 3
			}
		}
	]
}