{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"22": "The Book of Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، مِنْ كِتَابِهِ قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنَا ابْنُ عَجْلاَنَ، وَغَيْرُهُ، مِنْ إِخْوَانِنَا عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم جُلُوسٌ فِي الْمَسْجِدِ دَخَلَ رَجُلٌ عَلَى جَمَلٍ فَأَنَاخَهُ فِي الْمَسْجِدِ ثُمَّ عَقَلَهُ ثُمَّ قَالَ أَيُّكُمْ مُحَمَّدٌ - وَهُوَ مُتَّكِئٌ بَيْنَ ظَهْرَانَيْهِمْ - فَقُلْنَا لَهُ هَذَا الرَّجُلُ الأَبْيَضُ الْمُتَّكِئُ فَقَالَ لَهُ الرَّجُلُ يَا ابْنَ عَبْدِ الْمُطَّلِبِ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَجَبْتُكَ ‏\"‏ ‏.‏ قَالَ الرَّجُلُ يَا مُحَمَّدُ إِنِّي سَائِلُكَ فَمُشَدِّدٌ عَلَيْكَ فِي الْمَسْأَلَةِ ‏.‏ قَالَ ‏\"‏ سَلْ عَمَّا بَدَا لَكَ ‏\"‏ ‏.‏ قَالَ أَنْشُدُكَ بِرَبِّكَ وَرَبِّ مَنْ قَبْلَكَ آللَّهُ أَرْسَلَكَ إِلَى النَّاسِ كُلِّهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَأَنْشُدُكَ اللَّهَ آللَّهُ أَمَرَكَ أَنْ تَصُومَ هَذَا الشَّهْرَ مِنَ السَّنَةِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَأَنْشُدُكَ اللَّهَ آللَّهُ أَمَرَكَ أَنْ تَأْخُذَ هَذِهِ الصَّدَقَةَ مِنْ أَغْنِيَائِنَا فَتَقْسِمَهَا عَلَى فُقَرَائِنَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ إِنِّي آمَنْتُ بِمَا جِئْتَ بِهِ وَأَنَا رَسُولُ مَنْ وَرَائِي مِنْ قَوْمِي وَأَنَا ضِمَامُ بْنُ ثَعْلَبَةَ أَخُو بَنِي سَعْدِ بْنِ بَكْرٍ ‏.‏ خَالَفَهُ عُبَيْدُ اللَّهِ بْنُ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		}
	]
}