{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"26": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3222,
			"arabicnumber": 3222,
			"text": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ عُثْمَانَ، طَلَّقَ وَهُوَ غُلاَمٌ شَابٌّ فِي إِمَارَةِ مَرْوَانَ ابْنَةَ سَعِيدِ بْنِ زَيْدٍ وَأُمُّهَا بِنْتُ قَيْسٍ الْبَتَّةَ فَأَرْسَلَتْ إِلِيْهَا خَالَتُهَا فَاطِمَةُ بِنْتُ قَيْسٍ تَأْمُرُهَا بِالاِنْتِقَالِ مِنْ بَيْتِ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَسَمِعَ بِذَلِكَ مَرْوَانُ فَأَرْسَلَ إِلَى ابْنَةِ سَعِيدٍ فَأَمَرَهَا أَنْ تَرْجِعَ إِلَى مَسْكَنِهَا وَسَأَلَهَا مَا حَمَلَهَا عَلَى الاِنْتِقَالِ مِنْ قَبْلِ أَنْ تَعْتَدَّ فِي مَسْكَنِهَا حَتَّى تَنْقَضِيَ عِدَّتُهَا فَأَرْسَلَتْ إِلَيْهِ تُخْبِرُهُ أَنَّ خَالَتَهَا أَمَرَتْهَا بِذَلِكَ فَزَعَمَتْ فَاطِمَةُ بِنْتُ قَيْسٍ أَنَّهَا كَانَتْ تَحْتَ أَبِي عَمْرِو بْنِ حَفْصٍ فَلَمَّا أَمَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِيَّ بْنَ أَبِي طَالِبٍ عَلَى الْيَمَنِ خَرَجَ مَعَهُ وَأَرْسَلَ إِلَيْهَا بِتَطْلِيقَةٍ هِيَ بَقِيَّةُ طَلاَقِهَا وَأَمَرَ لَهَا الْحَارِثَ بْنَ هِشَامٍ وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ بِنَفَقَتِهَا فَأَرْسَلَتْ - زَعَمَتْ - إِلَى الْحَارِثِ وَعَيَّاشٍ تَسْأَلُهُمَا الَّذِي أَمَرَ لَهَا بِهِ زَوْجُهَا فَقَالاَ وَاللَّهِ مَا لَهَا عِنْدَنَا نَفَقَةٌ إِلاَّ أَنْ تَكُونَ حَامِلاً وَمَا لَهَا أَنْ تَكُونَ فِي مَسْكَنِنَا إِلاَّ بِإِذْنِنَا فَزَعَمَتْ أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ فَصَدَّقَهُمَا ‏.‏ قَالَتْ فَاطِمَةُ فَأَيْنَ أَنْتَقِلُ يَا رَسُولَ اللَّهِ قَالَ ‏ \"‏ انْتَقِلِي عِنْدَ ابْنِ أُمِّ مَكْتُومٍ الأَعْمَى الَّذِي سَمَّاهُ اللَّهُ عَزَّ وَجَلَّ فِي كِتَابِهِ ‏\"‏ ‏.‏ قَالَتْ فَاطِمَةُ فَاعْتَدَدْتُ عِنْدَهُ وَكَانَ رَجُلاً قَدْ ذَهَبَ بَصَرُهُ فَكُنْتُ أَضَعُ ثِيَابِي عِنْدَهُ حَتَّى أَنْكَحَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أُسَامَةَ بْنَ زَيْدٍ فَأَنْكَرَ ذَلِكَ عَلَيْهَا مَرْوَانُ وَقَالَ لَمْ أَسْمَعْ هَذَا الْحَدِيثَ مِنْ أَحَدٍ قَبْلَكِ وَسَآخُذُ بِالْقَضِيَّةِ الَّتِي وَجَدْنَا النَّاسَ عَلَيْهَا ‏.‏ مُخْتَصَرٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 27
			}
		}
	]
}