{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3451,
			"arabicnumber": 3451,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَاتَبَتْ بَرِيرَةُ عَلَى نَفْسِهَا بِتِسْعِ أَوَاقٍ فِي كُلِّ سَنَةٍ بِأُوقِيَّةٍ فَأَتَتْ عَائِشَةَ تَسْتَعِينُهَا فَقَالَتْ لاَ إِلاَّ أَنْ يَشَاءُوا أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً وَيَكُونُ الْوَلاَءُ لِي ‏.‏ فَذَهَبَتْ بَرِيرَةُ فَكَلَّمَتْ فِي ذَلِكَ أَهْلَهَا فَأَبَوْا عَلَيْهَا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ فَجَاءَتْ إِلَى عَائِشَةَ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ فَقَالَتْ لَهَا مَا قَالَ أَهْلُهَا فَقَالَتْ لاَهَا اللَّهِ إِذًا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ بَرِيرَةَ أَتَتْنِي تَسْتَعِينُ بِي عَلَى كِتَابَتِهَا فَقُلْتُ لاَ إِلاَّ أَنْ يَشَاءُوا أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً وَيَكُونُ الْوَلاَءُ لِي فَذَكَرَتْ ذَلِكَ لأَهْلِهَا فَأَبَوْا عَلَيْهَا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْتَاعِيهَا وَاشْتَرِطِي لَهُمُ الْوَلاَءَ فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ ثُمَّ قَامَ فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ مَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ يَقُولُونَ أَعْتِقْ فُلاَنًا وَالْوَلاَءُ لِي كِتَابُ اللَّهِ عَزَّ وَجَلَّ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَكُلُّ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ ‏\"‏ ‏.‏ فَخَيَّرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ زَوْجِهَا وَكَانَ عَبْدًا فَاخْتَارَتْ نَفْسَهَا ‏.‏ قَالَ عُرْوَةُ فَلَوْ كَانَ حُرًّا مَا خَيَّرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 63
			}
		}
	]
}