{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"45": "The Book of Oaths (qasamah), Retaliation and Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4727,
			"arabicnumber": 4727,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حَاتِمٌ، عَنْ سِمَاكٍ، ذَكَرَ أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّهُ كَانَ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ بِنِسْعَةٍ فَقَالَ يَا رَسُولَ اللَّهِ قَتَلَ هَذَا أَخِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَقَتَلْتَهُ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ لَمْ يَعْتَرِفْ أَقَمْتُ عَلَيْهِ الْبَيِّنَةَ ‏.‏ قَالَ نَعَمْ قَتَلْتُهُ ‏.‏ قَالَ ‏\"‏ كَيْفَ قَتَلْتَهُ ‏\"‏ ‏.‏ قَالَ كُنْتُ أَنَا وَهُوَ نَحْتَطِبُ مِنْ شَجَرَةٍ فَسَبَّنِي فَأَغْضَبَنِي فَضَرَبْتُ بِالْفَأْسِ عَلَى قَرْنِهِ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ مِنْ مَالٍ تُؤَدِّيهِ عَنْ نَفْسِكَ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي إِلاَّ فَأْسِي وَكِسَائِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتُرَى قَوْمَكَ يَشْتَرُونَكَ ‏\"‏ ‏.‏ قَالَ أَنَا أَهْوَنُ عَلَى قَوْمِي مِنْ ذَاكَ ‏.‏ فَرَمَى بِالنِّسْعَةِ إِلَى الرَّجُلِ فَقَالَ ‏\"‏ دُونَكَ صَاحِبَكَ ‏\"‏ ‏.‏ فَلَمَّا وَلَّى قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ فَأَدْرَكُوا الرَّجُلَ فَقَالُوا وَيْلَكَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ فَرَجَعَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ حُدِّثْتُ أَنَّكَ قُلْتَ ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ وَهَلْ أَخَذْتُهُ إِلاَّ بِأَمْرِكَ فَقَالَ ‏\"‏ مَا تُرِيدُ أَنْ يَبُوءَ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ ‏\"‏ ‏.‏ قَالَ بَلَى ‏.‏ قَالَ ‏\"‏ فَإِنْ ذَاكَ ‏\"‏ ‏.‏ قَالَ ذَلِكَ كَذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 22
			}
		}
	]
}