{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"47": "The Book Of Faith and its Signs"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4991,
			"arabicnumber": 4991,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ أَبِي فَرْوَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، وَأَبِي، ذَرٍّ قَالاَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْلِسُ بَيْنَ ظَهْرَانَىْ أَصْحَابِهِ فَيَجِيءُ الْغَرِيبُ فَلاَ يَدْرِي أَيُّهُمْ هُوَ حَتَّى يَسْأَلَ فَطَلَبْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ نَجْعَلَ لَهُ مَجْلِسًا يَعْرِفُهُ الْغَرِيبُ إِذَا أَتَاهُ فَبَنَيْنَا لَهُ دُكَّانًا مِنْ طِينٍ كَانَ يَجْلِسُ عَلَيْهِ وَإِنَّا لَجُلُوسٌ وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَجْلِسِهِ إِذْ أَقْبَلَ رَجُلٌ أَحْسَنُ النَّاسِ وَجْهًا وَأَطْيَبُ النَّاسِ رِيحًا كَأَنَّ ثِيَابَهُ لَمْ يَمَسَّهَا دَنَسٌ حَتَّى سَلَّمَ فِي طَرَفِ الْبِسَاطِ فَقَالَ السَّلاَمُ عَلَيْكَ يَا مُحَمَّدُ ‏.‏ فَرَدَّ عَلَيْهِ السَّلاَمَ قَالَ أَدْنُو يَا مُحَمَّدُ قَالَ ‏\"‏ ادْنُهْ ‏\"‏ ‏.‏ فَمَا زَالَ يَقُولُ أَدْنُو مِرَارًا وَيَقُولُ لَهُ ‏\"‏ ادْنُ ‏\"‏ ‏.‏ حَتَّى وَضَعَ يَدَهُ عَلَى رُكْبَتَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ يَا مُحَمَّدُ أَخْبِرْنِي مَا الإِسْلاَمُ قَالَ ‏\"‏ الإِسْلاَمُ أَنْ تَعْبُدَ اللَّهَ وَلاَ تُشْرِكَ بِهِ شَيْئًا وَتُقِيمَ الصَّلاَةَ وَتُؤْتِيَ الزَّكَاةَ وَتَحُجَّ الْبَيْتَ وَتَصُومَ رَمَضَانَ ‏\"‏ ‏.‏ قَالَ إِذَا فَعَلْتُ ذَلِكَ فَقَدْ أَسْلَمْتُ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ صَدَقْتَ ‏.‏ فَلَمَّا سَمِعْنَا قَوْلَ الرَّجُلِ صَدَقْتَ أَنْكَرْنَاهُ قَالَ يَا مُحَمَّدُ أَخْبِرْنِي مَا الإِيمَانُ قَالَ ‏\"‏ الإِيمَانُ بِاللَّهِ وَمَلاَئِكَتِهِ وَالْكِتَابِ وَالنَّبِيِّينَ وَتُؤْمِنُ بِالْقَدَرِ ‏\"‏ ‏.‏ قَالَ فَإِذَا فَعَلْتُ ذَلِكَ فَقَدْ آمَنْتُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ صَدَقْتَ ‏.‏ قَالَ يَا مُحَمَّدُ أَخْبِرْنِي مَا الإِحْسَانُ قَالَ ‏\"‏ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ‏\"‏ ‏.‏ قَالَ صَدَقْتَ ‏.‏ قَالَ يَا مُحَمَّدُ أَخْبِرْنِي مَتَى السَّاعَةُ قَالَ فَنَكَسَ فَلَمْ يُجِبْهُ شَيْئًا ثُمَّ أَعَادَ فَلَمْ يُجِبْهُ شَيْئًا ثُمَّ أَعَادَ فَلَمْ يُجِبْهُ شَيْئًا وَرَفَعَ رَأْسَهُ فَقَالَ ‏\"‏ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ وَلَكِنْ لَهَا عَلاَمَاتٌ تُعْرَفُ بِهَا إِذَا رَأَيْتَ الرِّعَاءَ الْبُهُمَ يَتَطَاوَلُونَ فِي الْبُنْيَانِ وَرَأَيْتَ الْحُفَاةَ الْعُرَاةَ مُلُوكَ الأَرْضِ وَرَأَيْتَ الْمَرْأَةَ تَلِدُ رَبَّهَا خَمْسٌ لاَ يَعْلَمُهَا إِلاَّ اللَّهُ ‏{‏ إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ ‏}‏ إِلَى قَوْلِهِ ‏{‏ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ ‏}‏ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ لاَ وَالَّذِي بَعَثَ مُحَمَّدًا بِالْحَقِّ هُدًى وَبَشِيرًا مَا كُنْتُ بِأَعْلَمَ بِهِ مِنْ رَجُلٍ مِنْكُمْ وَإِنَّهُ لَجِبْرِيلُ عَلَيْهِ السَّلاَمُ نَزَلَ فِي صُورَةِ دِحْيَةَ الْكَلْبِيِّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		}
	]
}