{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"11": "The Book of the Commencement of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"text": "It was narrated that Ibn Umar said:I saw the Messenger of Allah (ﷺ) when he said the opening Takbir of the prayer, raise his hands until they were level with his shoulders. When he said the Takbir before bowing he did likewise, and when he said: 'Sami Allahu liman hamidah (Allah hears those who praise Him),' he did likewise, then he said: 'Rabbana wa lakal-hamd (Our Lord, to You be praise).' But he did not do that when he prostrated or when he raised his head from prostration",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "It was narrated that Ibn Umar said:\"I saw the Messenger of Allah (ﷺ), when he stood to pray, raise his hands until they were in level with his shoulders, then he said the takbir. He did that when he said the Takbir before bowing, and he did that when he raised his head from bowing and said: 'Sami Allahu liman hamidah (Allah hears those who praise Him).' Bu he did not do that during the prostration",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "It was narrated from Abdullah bin Umar :that when the Messenger of Allah (ﷺ) started to pray, he would raise his hands in level with his shoulders, and when he bowed and when he raised his head from bowing, he would raise them likewise and say \"Sami Allahu liman hamidah, Rabbana wa lakal-hamd (Allah hears those who praise Him, our Lord, to You be praise.\" And he did not do that when he prostrated)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "It was narrated from Abdul-Jabbar bin Wa'il that his father said:\"I prayed behind the Messenger of Allah (ﷺ) and when he started to pray he said the Takbir and raised his hands until they were in level with his ears. Then he recited the Opening of the Book, and when he had finished he said 'Amin' and raised his voice with it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"text": "It was narrated from Malik bin Al-Huwairith- who was one of the companions of the Prophet (ﷺ)- that:When the Messenger of Allah (ﷺ) prayed he would raise his hands-when he said the Takbir- until they were parallel to his ears, and when he wanted to bow and when he raised his head from bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "It was narrated from Malik bin Al-Huwairith said:\"I saw the Messenger of Allah (ﷺ), when he started to pray, raise his hands, and when he bowed, and when he raised his head from bowing, until they were parallel with the top of his ears",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "It was narrated from Abdul-Jabbar bin Wa'il, from his father, that:He saw the Prophet (ﷺ), when he started to pray, raise his hands until his thumbs were almost level with his earlobes",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "Sa'eed bin Sam'an said Abu Hurairah came to the Masjid of Banu Zuraiq and said:\"There are three things that the Messenger of Allah (ﷺ) used to do and the people have abandoned; he used to raise his hands extended when praying, and he would fall silent briefly, and say takbir when he prostrated and when he sat up",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) entered the Masjid, then a man entered and prayed, then he came and greeted the Messenger of Allah (ﷺ) with Salam. The Messenger of Allah (ﷺ) returned his greeting and said: Go back and pray, for you have not prayed.\" So he went back and prayed as he has prayed before, then he came to the Prophet (ﷺ) and greeted him with Salam, and the Messenger of Allah (ﷺ) said to him: \"Wa alaika as-salam (and upon you be peace). Go back and pray for you have not prayed.\" He did that three times, then the man said: \"By the One Who sent you with the truth, I cannot do any better than that; teach me.\" He said: \"When you stand to pray, say the Takbir, then recite whatever is easy for you of Quran. Then bow until you have tranquility in your bowing, then stand up until you are standing straight. Then prostrate until you have tranquility in your prostration, then sit up until you have tranquility in your sitting. Then do that throughout your entire prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "It was narrated from Abdullah bin Umar that:A man stood behind the Prophet of Allah (ﷺ) and said: \"Allahu Akbaru kabira wal-hamdu Lillahi kathira, wa subhan-Allahi bukratan was asila (Allah is Most Great and much praise be to Allah and glorified be Allah at the beginning and end of the day).\" The Prophet of Allah (ﷺ) said: \"Who spoke these words?\" A man said: \"I did, O Prophet of Allah (SWT).\" He said: \"Twelve angels rushed (to take them up)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "It was narrated that Ibn Umar said:\"While we were praying with the Messenger of Allah (ﷺ), a man among the people said: 'Allahu Akbaru kabira, wal-hamdu Lillahi kathira, wa subhan-Allahi bukratan was asila (Allah is Most Great and much praise be to Allah and glorified be Allah at the beginning and end of the day).' The Messenger of Allah (ﷺ) said: 'Who is the one who said such and such?' A man among the people said: 'I did, O Messenger of Allah.' He said: ' I like it,' and he said words to the effect that the gates of the Heavens had been opened for it.\" Ibn Umar said: \"I never stopped saying it since I heard the Messenger of Allah (ﷺ) say that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "It was narrated that Musa bin Umair Al-Anbari and Qais bin Sulaim Al-Anbari said:\"Alqamah bin Wa'il told us that his father said: \"I saw the Messenger of Allah (ﷺ), when he was standing in prayer, holding his left hand with his right",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "It was narrated that Al Hajjaj bin Abi Zainab said:X\"I heard Abu Uthman narrate that Ibn Mas'ud said: 'The Prophet (ﷺ) saw me when I had placed my left hand on my right in prayer. He took hold of my right hand and placed it on my left",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "Wa'il bin Hujr said:\"I said: 'I am going to watch how the Messenger of Allah (ﷺ) prays.' So I watched him and he stood and said the takbir, and raised his hands until they were in the level with his ears, then he placed his right hand over his left hand, wrist and lower forearm. When he wanted to bow he raised his hands likewise. Then he prostrated and placed his hands in level with his ears. Then he sat up and placed his left leg under him; he put his left hand on his left thigh and knee, and he put the edge of his right elbow on his right thigh, then he held two of his fingers together and made a circle, and raised his forefinger, and I saw him moving it and supplicating with it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "It was narrated from Abu Hurairah that:The Prophet (ﷺ) forbade praying with one's hands on one's waist",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "It was narrated that Ziyad bin Subaih said:\"I prayed beside Ibn Umar and put my hand on my waist, and he did this to me-knocked it with his hand. When I had finished praying I said to a man: 'Who is this?' He said: \"Abdullah bin Umar.' I said: 'O Abu Abdur-Rahman, why are you angry with me?' He said: 'This is the posture of crucifixion, and the Mesenger of Allah (ﷺ) forbade us to do this",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"text": "It was narrated from Abu Ubaidah that:Abdullah saw a man who was praying with his feet together. He said: \"He is going against the Sunnah; if he shifted his weight from one to the other that would be better",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"text": "It was narrated from Abdullah that:He saw a man praying with his feet together. He said: \"He is not following the Sunnah. If he were to shift his weight from one to the other I would like that better",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) used to pause briefly when he had started to pray",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "It was narrated that Abu Hurairah said:\"When the Messenger of Allah (ﷺ) started to pray he would pause briefly. I said: 'May my father and mother be ransomed for you, O Messenger of Allah, what do you say when you pause briefly between the takbir and reciation?' He said: 'I say: Allahuma ba'id bayni wa bayna khatayaya kama ba'adta bayna al-mashriqi wal-maghrib; Allahumma naqqini min khatayaya kama yunaqqa ath-thawb al-abyad min ad-danas; Allahumma ighsilni min khatayaya bil ma'i wa ath-thalji wal-barad. (O Allah, put a great distance between me and my sins, as great as the distance You have made between the East and the West; O Allah, cleanse me of my sins as a white garment is cleansed from filth; O Allah, wash away my sins with water and snow and hail)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 896,
			"arabicnumber": 896,
			"text": "It was narrated that Jabir bin Abdullah said:\"When the Prophet (ﷺ) started to pray, he would say the takbir, then say: 'Inna salati wa nusuki wa mahyaya wa mamati lillahi rabbil-alamin, la sharika lahu, wa bidhalika umirtu wa ana min al-muslimin. Allahummahdini liahsanil-amali wa ahsanil-akhlaqi la yahdi li ahsaniha illa anta wa qini sayy'al-a'mali wa sayy'al-ahaqi la yaqi sayy'aha illa ant. (Indeed my salah (prayer), my sacrifice, my living, and my dying are for Allah, the Lord of all that exists. He has no partner. And of this I have been commanded, and I am one of the Muslims. O Allah, guide me to the best of deeds and the best of manners, for none can guide to the best of them but You. And protect me from bad deeds and bad manners, for none can protect against them but You",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"text": "It was narrated from Ali, may Allah be pleased with him, that:When the Messenger of Allah (ﷺ) started to pray, he would say Takbir, then say: \"Wajahtu wajhi lilladhi fataras-samawatiwal-arda hanifan wa ma ana minal-mushrikin. Inna salati wa nusuki wa mahyaya wa mamati lillahi rabbil-alamin, la sharika lahu, wa bidhalika umirtu wa ana min al-muslimin. Allahumma! Antal-maliku la ilaha illa ant, ana abduka zalamtu nafsi wa'taraftu bidhanbi faghfirli dhunubi jami'an, la yaghfirudhunuba illa anta, wahdini lihasanil-ahklaqi, la yahdi li ahsaniha illa anta wasrif anni sayy'aha la yasrifu anni sayy'aha illa anta, labaika wa sa'daika, wal-khairu kulluhu fi yadaika wash-sharru laisa ilaika ana bika wa ilaika ana bika wa ilaika tabarkta wa ta'alaita astaghfiruka wa atubu ilaik. (Verily, I have turned my face toward Him who created the Heavens and the Earth hanifa (worhsipping none but Allah Alone), and I am not of the idolaters. Verily, my salah, my sacrifice, my living, and my dying are for Allah, the Lord of the all that exists. He has no partner. And of this I have been commanded, and I am one of the Muslims. O Allah, You are the Sovereign and there is none worthy of worship but You. I am Your slave, I have wronged myself and I acknowledge my sin. Forgive me all my sins for no one forgives sins but You. Guide me to the best of manners for none can guide to the best of them but You. Protect me from bad manners for none can protect against them but You. I am at Your service, all goodness is in Your hands, and evil is not attributed to You. I rely on You and turn to You, blessed and exalted are You, I seek Your forgiveness and repent to You",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "It was narrated from Muhammad bin Maslamah that:When the Messenger of Allah (ﷺ) stood to offer a voluntary prayer he would say: \" Allahu Akbar Wajahtu wajhi lilladhi fataras-samawatiwal-arda hanifan musliman wa ma ana minal-mushrikin. Inna salati wa nusuki wa mahyaya wa mamati lillahi rabbil-alamin, la sharika lahu, wa bidhalika umirtu wa ana awwalul-muslimin. Allahumma antal-maliku la ilaha illa anta subhanaka wa bihamdik (Allah is Most Great. Verily, I have turned my face toward Him who created the Heavens and the Earth hanifa (worhsipping none but Allah Alone), as a Muslim, and I am not of the idolaters. Verily, my Salah, my sacrifice, my living, and my dying are for Allah, the Lord of the all that exists. He has no partner. And of this I have been commanded, and I am the first of the Muslims. O Allah, You are the Sovereign and there is none worthy of worship but You, glory and praise be to You.)\" Then he would recite",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "It was narrated from Abu Sa'eed that:When the Prophet (ﷺ) started to pray he would say: \"Subhanakallahumma, wa bihamdika tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuk (Glory and praise be to You, O Allah. Blessed be Your name and exalted be Your majesty, there is none worthy of worship except You)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "It was narrated that Abu Sa'eed said:\"When the Messenger of Allah (ﷺ) started to pray, he would say: 'Subhanakallahumma, wa bihamdika tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuk (Glory and praise be to You, O Allah. Blessed be Your name and exalted be Your majesty, there is none worthy of worship except You)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "It was narrated that Anas said:\"The Messenger of Allah (ﷺ) was leading us in prayer when a man came and entered the masjid, and he was out of breath. He said: 'Allahu Akbar, al-hamdulillahi hamdan kathiran tayiban mubarakan fih. (Allah is Most Great, praise be to Allah, much good and blessed praise.)' When the Messenger of Allah (ﷺ) had finished his prayer he said: 'Which of you is the one who spoke these words?' The people kept quiet. He said: 'He did not say anything bad.' The man said: 'I did, O Messenger of Allah. I came and I was out of breath, and I said it.' The Prophet (ﷺ) said: 'I saw twelve angels rushing to see which of them would take it up",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "It was narrated from Anas that:The Prophet (ﷺ), Abu Bakr, and Umar, may Allah be pleased with them both, would start their recitation with: \"All the praise and thanks be to Allah, the Lord of all that exists",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "It was narrated from Anas:\"I prayed with the Prophet (ﷺ) and with Abu Bakr and Umar, may Allah be pleased with them both, and they started with \"All the praise and thanks be to Allah, the Lord of all that exists",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "It was narrated that Anas in Malik said:\"One day when he-the Prophet (ﷺ)- was still among us, he took a nap, then he raised his head, smiling. We said to him: 'Why are you smiling, O Messenger of Allah?' He said: 'Just now this Surah was revealed to me: In the Name of Allah, the Most Gracious, the Most Merciful. Verily, We have granted you (O Muahmmad) Al-Kawthar. Therefore turn in prayer to your Lord and sacrifice (to Him only). For he who hates you, he will be cut off.' Then he said: 'Do you know what Al-Kawthar is?' We said: 'Allah and His Messenger know best.' He said: 'It is a river that my Lord has promised me in Paradise. Its vessels are more than the number of the stars. My Ummah will come to me, then a man among them will be pulled away and I will say: \"O Lord, he is one of my Ummah\" and He will say to me: 'You do not know what he did after you were gone",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"text": "It was narrated that Nu'aim Al-Mujmir said:\"I prayed behind Abu Hurairah and he recited: In the Name of Allah, the Most Gracious, the Most Merciful, then he recited Umm Al-Qur'an (Al Fatihah), and when he reached: not (the way) of those who earned Your anger, nor of those who went astray, he said: 'Amin and the people said 'Amin. And every time he prostrated he said: 'Allahu Akbar and when he stood up from sitting after two Rak'ahs he said: 'Allahu Akbar'. And after he had said the Salam he said: 'By the One in Whose Hand is my soul! My prayer most closely remembers the prayer of the Messenger of Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "It was narrated that Anas bin Malik said:\"The Messenger of Allah (ﷺ) led us in prayer, and we did not hear him recite: In the Name of Allah, the Most Gracious, the Most Merciful. And Abu Bakr and Umar led us in prayer and we did not hear it from them either",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "It was narrated that Anas said:\"I prayed behind the Messenger of Allah (ﷺ), Abu Bakr, Umar and Uthman, may Allah be pleased with them, and I did not hear any of them say out loud: In the Name of Allah, The Most Gracious, The Most Merciful",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "Ibn Abdullah bin Mughaffal said:\"If Abdullah bin Mughaffal heard any one of us recite: 'In the Name of Allah, the Most Gracious, the Most Merciful', he would say: 'I prayed behind the Messenger of Allah (ﷺ) and behind Abu Bakr and behind Umar-may Allah be pleased with them both- and I did not hear any of them recite: 'In the Name of Allah, the Most Gracious, the Most Merciful",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "Abu As-Sa'ib- the freed slave of Hisham bin Zuhrah-said:\"I heard Abu Hurairah say: 'The Messenger of Allah (ﷺ) said: \"Whoever offers a prayer in which he does not recite Umm Al-Quran (Al Fatihah), it is deficient, it is deficient, it is deficient, incomplete.\" I (Abu As-Sa'ib) said: 'O Abu Hurairah, sometimes I am behind the Imam.' He poked me in the arm and said: 'Recite it to yourself, O Persian! For I heard the Messenger of Allah (ﷺ) say: \"Allah says: \"I have divided prayer between Myself and My slave into two halves, and My slave shall have what he has asked for.'\" The Messenger of Allah (ﷺ) said: \"Recite, for when the slave says: All the praises and thanks be to Allah, the Lord of all that exists, Allah says: 'My slave has praised Me.' And when he says: The Most Gracious, the Most Merciful, Allah says: 'My slave has extolled Me.' And when he says: The Only Owner (and the Only Ruling Judge) of the Day of Recompense (i.e. the Day of Resurrection), Allah says: 'My slave has glorified Me' . And when he says: You (alone) we worship, and You (alone) we ask for help (for each and everything), He says: 'This is between Me and My slave, and My slave shall have what he has asked for.' And when he says: 'Guide us to the straight way, the way of those on whom You have bestowed Your grace, not (the way) of those who earned Your anger, nor of those who went astray, He says: 'This is for My slave, and My slave shall have what he asked for",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "It was narrated from Ubadah bin As-Samit that :The Prophet (ﷺ) said: \"There is no Salah for one who does not recite Fatihatil-Kitab",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "It was narrated that Ubadah bin As-Samit said:\"The Messenger of Allah (ﷺ) said: \"There is no Salah for one who does not recite Fatihatil-Kitab or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "It was narrated that Ibn Abbas said:\"When Jibril was with the Messenger of Allah (ﷺ), he heard a sound from above like a door opening. Jibril, peace be upon him, looked up toward the sky and said: 'This is a gate in Heaven that has been opened, but it was never opened before.\" He said: \"An Angel came down from it and came to the Prophet (ﷺ) and said: 'Receive the glad tidings of two lights that have been given to you and were never given to any prophet before you: The Opening of the Book (Al-Fatihah) and the last verses of Surat Al-Baqarah. You will never recite a single letter of them but you will be granted it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "It was narrated from Abu Sa'eed bin Al-Mu'alla that:The Prophet (ﷺ) passed by him when he was praying, and called him. He said: \"I finished praying, then I came to him, and he said: 'What kept you from answering me?' He said: 'I was praying.' He said: 'Does not Allah say: O you who believe! Answer Allah (by obeying Him) and (His) Messenger when he calls you to that which will give you life? Shall I not teach you the greatest surah before I leave the masjid?' Then he went to leave, and I said: 'O Messenger of Allah, what about what you said?' He said: \"All praise and thanks be to Allah, Lord of all that exists. These are the seven oft-recited that I have been given, and the Grand Quran",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "It was narrated that Ubayy bin Ka'b said:\"The Messenger of Allah (ﷺ) said: 'Allah, the Mighty and Sublime, did not reveal in the Tawrah or the Injil anything like Umm Al-Quran (Al-Fatihah), which is the seven oft-recited, and (Allah said) it is divided between Myself and My slave will have what he asked for",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "It was narrated that Ibn Abbas said:\"The Prophet (ﷺ) was given seven oft-recited; the seven long ones",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "It was narrated that Ibn Abbas said:Concerning the words of Allah, the Mighty and Sublime: \"Seven of Al-Mathani (seven repeatedly-recited): \"The seven long ones",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "It was narrated that Imran bin Hussain said:\"The Prophet (ﷺ) prayed Zuhr and a man behind him recited: Glorify the Name of your Lord, the Most High. When he had finished praying, he said: 'Who recited: Glorify the Name of your Lord, the Most High?\" A man said: 'I did.' He said: 'I realized that some of you were disputing with me over it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "It was narrated from Imran bin Husain that:The Prophet (ﷺ) prayed Zuhr or Asr, and a man was reciting behind him. When he had finished he said: \"Which one of you recited: Glorify the Name of your Lord, the Most High?\" A man among the people said: \"I did, but I did not intend anything but good.\" The Prophet (ﷺ) said: \"I realized that some of you were disputing with me over it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "It was narrated from Abu Hurairah:\"The Messenger of Allah (ﷺ) finished a prayer in which he recited out loud, then he said: 'Did any one of you recite with me just now?' A man said: 'Yes, O Messenger of Allah.' He said: 'I was wondering what was distracting me in reciting Quran.'\" So the people stopped reciting in prayers in which the Messenger of Allah (ﷺ) recited out loud when they heard that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "It was narrated that Ubadah bin As-Samit said:\"The Messenger of Allah (ﷺ) led us in one of the prayers in which the recitation is done out loud, and he said: 'None of you should recite when I recite out loud, apart from the Umm Al_quran (Al Fatihah)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'The Imam is appointed to be followed, so when he says the takbir, say the takbir, and when he recites, be silent, and when he says: \"Sami' Allahu liman hamidah (Allah hears those who praise Him),\" say: \"Allahumma rabbana lakal-hamd (Our Lord, to You be praise)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'The Imam is appointed to be followed, so when he says the takbir, say the takbir, and when he recites, be silent",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "Kathir bin Murrah Al-Hadrami narrated that :He heard Abu Ad-Darda say: \"The Messenger of Allah (ﷺ) was asked: 'Is there recitation in every prayer?' He said: 'Yes.' A man among the Ansar said: 'Is that obligatory?' He (Abu Ad-Darda) turned to me (Kathir), as I was closest of the people to him, and said: 'I think that if the Imam leads the people, that is sufficient for them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "It was narrated that Ibn Abi Awfa said:\"A man came to the Prophet (ﷺ) and said: 'I cannot learn anything of the Quran; teach me something that I can say instead of reciting the Quran.' He said: 'Say: SubhanAllah, wal-hamdulilah, wa la illaha ill-Allah, wa Allahu Akbar, wa la hawla wa la quwwata illa Billahil-aliy al-azim (Glory be to Allah, praise be to Allah, there is none worthy of worship except Allah, Allah is Most Great, and there is no power and no strength except with Allah the Exalted and Magnificent)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'When the reciter says Amin, then say: \"Amin\" too, for the angels say Amin and if a person's Amin coincides with the Amin of the angels, Allah will forgive his previous sins",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"text": "It was narrated from Abu Hurairah that:The Prophet (ﷺ) said: \"When the reciter says Amin, then say: \"Amin\" too, for the angels say Amin and if a person's Amin coincides with the Amin of the angels, Allah will forgive his previous sins",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 927,
			"arabicnumber": 927,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'When the Imam says: Not (the way) of those who earned Your anger, nor of those who went astray, say: 'Amin' for the angels say Amin and the Imam says Amin, and if a person's Amin coincides with the Amin of the angels, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) said: \"When the Imam says Amin, say Amin, for if a person's Amin coincides with the Amin of the angels, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "It was narrated that Abu Hurairah, may Allah be pleased with him, that:The Messenger of Allah (ﷺ) said: \"When the Imam says: Not (the way) of those who earned Your anger, nor of those who went astray, say: 'Amin,' for if a person's Amin coincides with the Amin of the angels, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) said: \"If any one of you says: 'Amin' and the angels in Heaven say Amin, and the one coincides with the other, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "It was narrated from Mu'adh bin Rifa'ah bin Rafi' that :His father said: \"I prayed behind the Prophet (ﷺ) and I sneezed and said: 'Al-hamdu lillahi, hamdan kathiran tayiban mubarakan fih, mubarakan'alaihi, kama yuhibbu rabbuna wa yarda (Praise be to Allah, much good and blessed praise as our Lord loves and is pleased with.)' When he finished praying, the Messenger of Allah (ﷺ) said: 'Who is the one who spoke during the prayer?' But no one said anything. Then he said it a second time: 'Who is the one who spoke during the prayer?' So Rifa'ah bin Rafi bin Afrah said: 'It was me, O Messenger of Allah.' He said: 'I said: \"Praise be to Allah, much good and blessed praise as our Lord loves and is pleased with.'\" The Prophet (ﷺ) said: 'By the One in Whose hand is my soul, thirty-odd angels hastened to see which of them would take it up",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "It was narrated from Abdul-Jabbar bin Wa'il that :His father said: \"I prayed behind the Messenger of Allah (ﷺ) and when he said the takbir, he raised his hands to the bottom of his ears. When he recited: Not (the way) of those who earned Your anger, nor of those who went astray), he said: 'Amin,' and I could hear him although I was behind him. The Messenger of Allah (ﷺ) heard a man saying: 'Al-hamdu lillahi, hamdan kathiran tayiban mubarakan fih, (Praise be to Allah, much good and blessed praise.)' When the Prophet (ﷺ) said the salam and finished his prayer, he said: 'Who spoke those words during the prayer?' The man said: 'I did, O Messenger of Allah, but I did not mean anything bad thereby.' The Prophet (ﷺ) said: \"Twelve angels hastened (to take it) and nothing is stopping it going all the way to the Throne",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "It was narrated that Aishah said:\"Al-Harith bin Hisham asked the Messenger of Allah (ﷺ): 'How does the Revelation come to you?' He said: 'Like the ringing of a bell, and when it departs I remember what he (the Angel) said, and this is the hardest on me. And sometimes he (the Angel) comes to me in the form of a man and gives it to me",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "It was narrated from Aishah that:Al-Harith bin Hisham asked the Messenger of Allah (ﷺ): 'How does the Revelation come to you?' He said: 'Like the ringing of a bell, and this is the hardest on me. When it departs I remember what he said. And sometimes the Angel appears to me in the form of a man and speaks to me, and I remember what he said.\" Aishah said: \"I saw him when the Revelation came to him on a very cold day, and his forhead was dripping with sweat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "It was narrated that Ibn Abbas said:Concerning the saying of Allah, the Mighty and Sublime: \"Move not your tongue concerning to make haste therewith. It is for Us to collect it and to give you the ability to recite it- \"The Prophet (ﷺ) used to suffer a great deal of hardship when the Revelation came to him, and he used to move his lips. Allah said: Move not your tongue concerning to make haste therewith. It is for Us to collect it and to give you the ability to recite it.\" He said: \" (This means) He will gather it in your heart, then you will recite it,\" And when We have recited it to you, then follow the recitation. He said: \"So listen to it and remain silent. So when Jibril came to him, the Messenger of Allah (ﷺ) listened, and when he left, he would recite it as he had taught him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "It was narrated from Ibn Makhramah that:Umar bin Al-Khattab, may Allah be pleased with him, said: \"I heard Hisham bin Hakim bin Hizam reciting: Surat Al-Furqan, in a way that the Prophet of Allah (ﷺ) had not taught me. I said: 'Who taught you this Surah?' He said: 'The Messenger of Allah (ﷺ).' I said: 'You are lying; the Messenger of Allah (ﷺ) did not teach you like that. 'I took him by the hand and brought him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, you taught me Surat Al-Furqan, but I heard this man reciting it in a way that you did not teach me.' The Messenger of Allah (ﷺ) said: 'Recite, O Hisham.' So he recited it as he had recited it (before). The Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then he said: 'Recite, O Umar.' So I recited it, and he said: 'It was revealed like this.' Then the Messenger of Allah (ﷺ) said: 'The Quran was revealed to be recited in seven different modes",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "It was narrated that AbdurRahman bin Abdul-Qari said:\"I heard Umar bin Al-Khattab, may Allah be pleased with him, say: 'I heard Hisham bin Hakim bin Hizam reciting Surat Al-Furqan, in a way that I had not been taught, and the Messenger of Allah (ﷺ) had taught me. I was about to interrupt him (in his prayer), but I left him alone until he had finished. Then I grabbed him by his garment and brought him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, I heard this man reciting Surat Al-Furqan in a way that you did not teach me.' The Messenger of Allah (ﷺ) said to him: 'Recite.' So he recited it in the way that I had heard him recite. Then the Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then he said to me: 'Recite.' So I recited it and he said: 'It was revealed like this. This Quran has been revealed in seven different modes, so recite as much of the Quran as may be easy for you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"text": "Urwah bin Az-Zubair narrated that Al-Miswar bin Makhramah and AbdurRahman bin Abdul-Qari told him that:They heard Umar bin Al-Khattab say: \"I heard Hisham bin Hakim bin Hizam reciting Surat Al-Furqan during the lifetime of the Messenger of Allah (ﷺ), so I listened to his recitation and he was reciting it in a way that the Messenger of Allah (ﷺ) had not taught me. I was about to jump on him while he was praying, but I waited patiently until he said the Salam (at the end of the prayer). When he had said the Salam I grabbed him by his garment and said: 'Who taught you this Surah that I heard you reciting?' He said: 'The Messenger of Allah (ﷺ) taught me it. I said: 'You are lying, by Allah! The Messenger of Allah (ﷺ) is the one who taught me this Surah that I heard you reciting.' I took him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, I heard this man reciting Surat Al-Furqan in a way that you did not teach me, but you taught me Surat Al-Furqan.' The Messenger of Allah (ﷺ) said:' Let him go, O Umar. Recite, O Hisham.' So I recited it to him in the way that I had heard him recite. The Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then the Messenger of Allah (ﷺ) said: 'Recite, O Umar.' So I recited it in the way that he had taught me. The Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then the Messenger of Allah (ﷺ) said: 'This Quran has been revealed to be recited in seven different modes, so recite as much of the Quran as may be easy for you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "It was narrated from Ubayy bin Ka'b that:The Messenger of Allah (ﷺ) was by a pond belonging to Banu Ghifar when Jibril, peace be upon him, came to him and said: \"Allah commands you to teach your Ummah the Quran with one way of recitation.\" He said: \"I ask my Lord for protection and forgiveness, my Ummah cannot bear that.\" Then he came to him a second time and said: \"Allah commands you to teach your Ummah the Quran with two ways of recitation.\" He said: \"\"I ask my Lord for protection and forgiveness, my Ummah cannot bear that.\" Then he came to him a third time and said: \"Allah commands you to teach your Ummah the Quran with three ways of recitation.\" He said: \"I ask my Lord for protection and forgiveness, my Ummah cannot bear that.\" Then he came to him a fourth time and said: \"Allah commands you to teach your Ummah the Quran with seven ways of recitation, and whichever the way they recite it will be correct",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "It was narrated that Ubayy bin Ka'b said:\"The Messenger of Allah (ﷺ) taught me a surah, and when I was sitting in the masjid I heard a man reciting it in a way that was different from mine. I said to him: 'Who taught you this surah?' He said: 'The Messenger of Allah (ﷺ).' I said: 'Stay with me until we go to the Messenger of Allah (ﷺ).' So we came to him and I said: 'O Messenger of Allah, this man recites a surah that you taught me differently.' The Messenger of Allah (ﷺ) said: 'Recite, O Ubayy.' So I recited it, and the Messenger of Allah (ﷺ) said to me: 'You have done well.' Then he said to the man: 'Recite.' So he recited it and it was different to my recitation. The Messenger of Allah (ﷺ) said to him: 'You have done well.' Then the Messenger of Allah (ﷺ) said: 'O Ubayy, the Quran has been revealed with seven different modes of reciation, all of which are good and sound",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "It was narrated that Ubayy said:\"I had no confusion in my mind from that time I embraced Islam, except when I recited a verse and another man recited it differently. I said: 'The Messenger of Allah (ﷺ) taught me this.' And the other man said: 'The Messenger of Allah (ﷺ) taught me too.' So I went to the Prophet (ﷺ) and said: 'O Prophet of Allah, did you not teach me such and such a verse?' He said: 'Yes.' The other man said: 'Did you not teach me such and such a verse?' He said: 'Yes. Jibril and Mika'il, peace be upon them, came to me, and Jibril sat on my right and Mika'il on my left. Jibril, peace be upon him, said: \"Recite the Quran with one way of recitation.' Mika'il said: 'Teach him more, teach him more- until there were seven modes of recitation, each of which is good and sound",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "It was narrated from Ibn Umar that:The Messenger of Allah (ﷺ) said: \"The one who learns the Quran is like the owner of a hobbled camel. If he pays attention to it, he will keep it, but if he releases it, it will go away",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "It was narrated from Abdullah that:The Prophet (ﷺ) said: \"It is not right for any one of you to say: 'I have forgotten such and such a verse.' Rather, he has been caused to forget. Study the Qur'an, for it escapes from the heart of man faster than a camel escapes from its fetter",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "Ibn Abbad narrated that:The Messenger of Allah (ﷺ) used to recite in teh first rak'ah of Fajr \"Say: We believe in Allah and that which has been sent down to us\" to the end verse, and in the second rak'ah, \"We believe in Allah, and bear witness that we are Muslims",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) recited: \"Say: O you disbelievers\" and \"Say: He is Allah, (the) One\" in the two rak'ahs of Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "It was narrated that Aishah said:\"I would see the Messenger of Allah (ﷺ) praying two rak'ahs of Fajr and making them so brief that I said: 'Did he recite the Umm Al-Kitab in them?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "It was narrated from Shabib Abi Rawh, from a man among the companions of the Prophet (ﷺ), that:He prayed Subh and recited Ar-Rum, but he stumbled in his recitation. When he had finished praying he said: 'What is the matter with people who pray with us without purifying themselves properly? Those people make us stumble in reciting Quran",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "It was narrated from Abu Barzah that:The Messenger of Allah (ﷺ) used to recite between sixty and one hundred verses in Al-Ghadah (Subh) prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 949,
			"arabicnumber": 949,
			"text": "It was narrated that Umm Hisham bint Harithah bin An-Nu'man said:\"I only learned :Qaf. By the Glorious Quran.' Behind the Messenger of Allah (ﷺ); he used to recite it in Subh",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"text": "It was narrated that Ziyad bin Ilaqah said:\"I heard my paternal uncle say: 'I prayed Subh with the Messenger of Allah (ﷺ), and in one of the rak'ahs he recited: \"And tall date palms, with ranged clusters",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 951,
			"arabicnumber": 951,
			"text": "It was narrated that Amr bin Huraith said:\"I heard the Prophet (ﷺ) reciting: 'When the sun is wound round.' in fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "It was narrated from Uqbah bin Amr that:He asked the Prophet (ﷺ) about Al-Mua'awwidhatain. Uqbah said: \"The Messenger of Allah (ﷺ) led us in praying Fajr and recited them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "It was narrated that Uqbah bin Amr said:\"I followed the Messenger of Allah (ﷺ) when he was riding, and I placed my hand on his foot and said : O Messenger of Allah, teach me Surah Hud and Surah Yusuf. He said: 'You will never recite anything greater before Allah than: \"Say: I seek refuge with (Allah), the Lord of the daybreak.\" And \"Say: I seek refuge with (Allah) the Lord of mankind",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "It was narrated that Uqbah bin Amr said:The Messenger of Allah (ﷺ) said: 'Some verses were revealed to me tonight, the likes of which have never been seen: \"Say: I seek refuge with (Allah), the Lord of the daybreak.\" [Surat al-Falaq:1] and \"Say: I seek refuge with (Allah) the Lord of mankind.\" [Surat an-Naas:1]",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) used to recite: \"Alif-Lam-Mim. The revelation of the Book\" and: \"Has there not been over man\" in Subh prayer on Friday",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "It was narrated from Ibn Abbas that:The Prophet (ﷺ) used to recite: The revelation of the Book and; 'Has there not been over man.' in Subh prayer on Friday",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"text": "It was narrated from Ibn Abbas that:The Prophet (ﷺ) prostrated in Sad and said: \"Dawud did this prostration in repentance and we do it in thanksgiving",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 958,
			"arabicnumber": 958,
			"text": "It was narrated from Ja'far bin Al-Muttalib bin Abi Wada'ah that:His father said: \"The Messenger of Allah (ﷺ) recited Surat An-Najm in Makkah and prostrated, and those who were with him prostrated. I raised my head and refused to prostrate.\" At that time Al-Muttalib had not yet accepted Islam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "It was narrated from Abdullah that:The Messenger of Allah (ﷺ) recited An-Najm and prostrated during it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "It was narrated from Ata' bin Yasar that:He asked Zaid bin Thabit about reciting with the Imam. He said: \"There is no recitation with the Imam in anything.\" And he claimed that he had recited: \"By the star when it goes down (or vanishes)\" to the Messenger of Allah (ﷺ) and he did not prostrate",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "It was narrated from Abu Salamah bin Abdur- Rahman that:Abu Hurairah (led them in prayer and) recited: \"When the heaven is split asunder.\" and prostrated during it. When he had finished praying, he told them that the Messenger of Allah (ﷺ) had prostrated during it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) prostrated during: 'When the heaven is split asunder",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "It was narrated that Abu Hurairah said:\"We prostrated with the Messenger of Allah (ﷺ) during: When the heaven is split asunder and Read! In the Name of your Lord",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "Narrated from Abu Hurairah:(Another chain) from Abu Hurairah, with similar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "It was narrated that Abu Hurairah said:\"Abu Bakr and Umar prostrated during: 'When the heaven is split asunder,' as did the one who was better than them (the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "It was narrated that Abu Hurairah said:\"Abu Bakr and Umar, may Allah be pleased with them both, and the one who was better than them prostrated during 'When the heaven is split asunder' and 'Read! In the name of your Lord",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "It was narrated that Abu Hurairah said:\"I prostrated with the Messenger of Allah (ﷺ) during; 'When the heaven is split asunder' and 'Read! In the Name of your Lord",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "It was narrated that Abu Rafi' said:\"I prayed Isha' prayer- meaning Al-'Atamah behind Abu Hurairah and he recited: 'When the heaven is split asunder' and prostrated during it. When he had finished praying, I said: 'O Abu Hurairah, (this is) a prostration that we are not used to.' He said: 'Abu Al-Qasim (ﷺ) did this prostration and I was (praying) behind him, and I will continue to do this prostration until I meet Abu Al-Qasim",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "It was narrated that 'Ata said:\"Abu Hurairah said: \"In should be recitation in every prayer. What the Messenger of Allah (ﷺ) made us hear (by reciting out loud) we make you hear, and what he hid from us (by reciting silently) we hide from you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "It was narrated that Abu Hurairah said:\"In every prayer there is recitation. What the Messenger of Allah (ﷺ) made us hear (by reciting out loud) we make you hear, and what he hid from us (by reciting silently) we hide from you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "It was narrated that Al-Bara' said:\"We used to pray Zuhr behind the Prophet (ﷺ) and we heard some of the verses from Surah Luqman and Adh-Dhariyat from him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "Abu Bakr bin An-Nadr said:\"We were in At-Taff with Anas, and he led them in praying Zuhr. When he had finished, he said: 'I prayed Zuhr with the Messenger of Allah (ﷺ) and he recited two surahs for us in the two rak'ahs: \"Glorify the Name of your Lord, the Most High' and 'Has there come to you the narration of the over-whelming (i.e. The Day of Resurrection)?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "It was narrated that Abu Sa'eed Al-Khudri said:\"The Iqamah for Zuhr prayer would be said, and a person could go to the Al-Baqi', relieve himself, perform wudhu, and come (to the masjid), and the Messenger of Allah (ﷺ) would still be in the first rak'ah, making it lengthy",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "Abdullah bin Abi Qatadah narrated that:His father said: \"The Messenger of Allah (ﷺ) used to lead us in prayer, and he would recite in the first two rak'ahs and make us hear some verses. And he would make the (first) Rak'ah lengthy in Zuhr, and also the first rak'ah.\" Meaning in Subh",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "Abdullah bin Abi Qatadah said:\"My father told us that the Messenger of Allah (ﷺ) used to recite Umm Al-Quran and two surahs in the first two rak'ahs of Zuhr and 'Asr, and he would make us hear a verse sometimes, and he used to make the first rak'ah lengthy",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "Abdullah bin Abi Qatadah narrated that:His father told him: \"The Messenger of Allah (ﷺ) used to recite for us in the first two rak'ahs of Zuhr prayer, and he would make us hear a verse sometimes. He would make the first rak'ah longer and the second shorter. And he used to do that in Subh too, make the first rak'ah longer and the second shorter. And he used to recite in the first two rak'ahs of 'Asr prayer, making the first rak'ah longer and the second shorter",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "It was narrated from Abdullah bin Abi Qatadah that his father said:\"The Messenger of Allah (ﷺ) used to recite the Umm Al-Quran and two surahs in the first two rak'ahs of Zuhr and 'Asr, and in the last two with Umm Al-Quran, and he would make us hear a verse sometimes, and he used to make the first rak'ah lengthy",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "It was narrated that Abu Salamah said:\"The Messenger of Allah (ﷺ) used to recite the Umm Al-Quran and two surahs in the first two rak'ahs of Zuhr and 'Asr, and he would make us hear a verse sometimes, and he used to make the first rak'ah of zuhr lengthy, and he did likewise in Subh",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "It was narrated from Jabir bin Samurah that :The Prophet (ﷺ) used to recite \"By the heaven holding the big stars\" and: \"By the heaven, and At-Tariq (the night-comer, i.e. the bright star)\" and similar surahs in Zuhr and 'Asr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "It was narrated that Jabir bin Samurah said:\"The Prophet (ﷺ) used to recite \"By the night as it envelops\" in Zuhr and something similar in 'Asr, and he would recite something longer than that in subh",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "It was narrated that Zaid bin Aslam said:\"We entered upon Anas bin Malik and he said: 'Have you prayed?' We said: 'Yes.' He asid: 'O slave girl, bring me water for Wudhu! I have never prayed behind any Imam whose prayer more closely resembles the prayer of the Messenger of Allah (ﷺ) than this Imam of yours.'\" Zaid said: \"Umar bin Abdul Aziz used to complete the bowing and prostration (without rushing) and lighten the standing and sitting",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "It was narrated that Abu Hurairah said:\"I have never prayed behind anyone whose prayer more closely resembled that of the Messenger of Allah (ﷺ) than so-and-so.\" (The narrator) Sulaiman siad: \"He used to make the first two rak'ahs of Zuhr lengthy and the last two shorter, and he would make 'Asr shorter; in Maghrib he would recite the short Mufassal surahs, in Isha' the medium-length Mufassal surahs and in Subh the long Mufassal surahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "It was narrated that Abu Hurairah said:\"I have never prayed behind anyone whose prayer more closely resembled that of the Messenger of Allah (ﷺ) than so-and-so. We prayed behind that person and he used to make the first two rak'ahs of Zuhr lengthy and the last two shorter, and he would make 'Asr shorter; in Maghrib he would recite the short Mufassal surahs. In Isha' he recited: 'By the sun and its brightness and similar surahs, and in subh he recited two lengthy surahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "It was narrated that Jabir said:\"A man from among the Ansar passed Mu'adh leading two camels, when he (Mu'adh) was praying maghrib, and he was starting to recite Al-Baqarah. So that man prayed then went away. News of that reached the Prophet (ﷺ) and he said: 'Do you want to cause hardship to the people, O Mu'adh; do you want to cause hardship to the people, O Mu'adh? Why don't you recite: 'Glorify the Name of your Lord, the Most High' and 'By the sun and its brightness' and the like?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "It was narrated from Anas that Umm Al-Fadl bint Al-Harith said:\" The Messenger of Allah (ﷺ) led us in praying maghrib in his house and he recited Al-Mursalat, then after that, he never offered any prayer until he died",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "It was narrated from Ibn Abbas from his mother that:She heard the Prophet (ﷺ) recite Al-Mursalat in Maghrib",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 987,
			"arabicnumber": 987,
			"text": "It was narrated from Muhammad bin Jubair bin Mut'im that:His father said: \"I heard the Prophet (ﷺ) recite At-Tur in Maghrib",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "Mu'awiyah bin Abdullah bin Ja'far narrated that Abdullah bin 'Utbah bin Mas'ud told him that:The Messenger of Allah (ﷺ) recited 'Ha- Mim Ad-Dukhan' in Maghrib",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "It was narrated from Zaid bin Thabit that :He said to Marwan: \"O Abu Abdul-Malik, do you recite: 'Say: He is Allah, (the) One' and 'Verily, We have granted you Al-Kawthar' in maghrib?\" He said: \"Yes.\" He (Zaid) said: \"I swear by Allah, I saw the Messenger of Allah (ﷺ) reciting the longer of the two long surahs in it: 'Alif-Lam-Mim-Sad",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "Marwan bin Al-Hakam narrated that:Zaid bin Thabit said: \"Why do I see you reciting short surahs in Maghrib when I saw the Messenger of Allah (ﷺ) reciting the longer of the two long surahs in it?\" I said: \"O Abu Abdullah, what is the longer of the two long surahs?\" He said: \"Al-A'raf",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"text": "It was narrated from Aishah that:The Messenger of Allah (ﷺ) recited Surat Al-A'raf in maghrib and split it between two rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"text": "It was narrated that Ibn Umar said:\"I watched the Messenger of Allah (ﷺ)- twenty times- reciting in the two rak'ahs after maghrib 'Say: O you disbelievers' and 'Say: He is Allah, (the) One",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "It was narrated from Aishah that:The Messenger of Allah (ﷺ) sent a man on a campaign, and he used to recite to his companions when leading them in prayer, and would conclude with 'Say: He is Allah, (the) One.' When they returned, they told the Messenger of Allah (ﷺ) about that. He said: \"Ask them why he did that.\" So they asked him and he said: \"Because it is a description of the Most Merciful, the Mighty and Sublime, and I love to recite it.\" The Messenger of Allah (ﷺ) said: \"Tell him that Allah (SWT), the Mighty and Sublime, loves him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "It was narrated that Ubaid bin Hunain, the freed slave of the family of Zaib bin Al-Khattab, said:\"I heard Abu Hurairah say: 'I came back (from a journey) with the Messenger of Allah (ﷺ) and he heard a man reciting 'Say: He is Allah, (the) One, Allah-us-Samad (the Self-Sufficient Master). He begets not, nor was He begotten. And there is none equal or comparable unto Him.' The Messenger of Allah (ﷺ) said: 'It is guaranteed.' We asked him: 'What, O Messenger of Allah?' He said: 'Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "It was narrated from Abu Sa'eed Al Khudri that:A man heard another man reciting \"Say: He is Allah, (the) One\" and repeating it. When morning came he went to the Messenger of Allah (ﷺ) and told him about that. The Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is my soul, it is equal to one-third of the Quran",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "It was narrated from Abu Ayyub that:The Prophet (ﷺ) said: \"Say: He is Allah, (the) One\" is one-third of the Quran",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "It was narrated that Jabir said:\"Muadh stood up and prayed Isha', and made it lengthy. The Prophet (ﷺ) said: 'Do you want to cause hardship to the people, O Mu'adh; do you want to cause hardship to the people O Mu'adh? Why didn't you recite 'Glorify the Name of your Lord Most High' or Ad-Duha or; 'When the heaven is cleft asunder?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "It was narrated that Jabir said:\"Mu'adh bin Jabal led his companions in praying Isha' and he made it lengthy. A man left, and Mu'adh was told about that, and he said: 'He is a hypocrite.' When news of that reached the man, he went to the Prophet (ﷺ) and told him what Mu'adh had said. The Prophet (ﷺ) said to him: 'Do you want to be a cause of hardship, O Mu'adh? When you lead the people in prayer, recite 'By the sun and its brightness' and 'Glorify the Name of your Lord, the Most High' and 'By the night as it envelops'and 'Read! In the Name of your Lord",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "It was narrated from Abdullah bin Buraidah, from his father, that:The Messenger of Allah (ﷺ) used to recite 'By the sun and its brightness' and similar surahs in Isha",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "It was narrated that Al-Bara' bin Azib said:\"I prayed Al-'Atamah (Isha') with the Messenger of Allah (ﷺ) and he recited 'By the gif and the olive' in it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "It was narrated that Al-Bara' bin Azib said:\"The Messenger of Allah (ﷺ) was on a journey and he recited: 'By the fig and the olive' in the first rak'ah of isha",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "Abu 'Awn said:\"I heard Jabir bin Samurah say: 'Umar said to Sa'eed': \"The people are complaining about everything about you, even about your prayer.\" Sa'd said: \"I take my time in the first two rak'ahs and I make the other two shorter. I do my best to follow the example of the Messenger of Allah (ﷺ) in prayer.\" 'Umar said: 'That is what I thought about you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"text": "It was narrated that Jabir bin Samurah said:\"Some of the peole of Al-Khufah complained about Sa'd to 'Umar. They said: 'By Allah, he does not pray properly.' He said: 'I lead them in prayer as the Messenger of Allah (ﷺ) did, and I do not deviate from that. I take my time in the first two rak'ahs and make the other two shorter.' He (Umar) said: 'That is what I thought about you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "It was narrated that 'Abdullah said:I know the similar surahs that the Messenger of Allah (ﷺ) used to recite, twenty surahs in ten rak'ahs.\" Then he took 'Alqamah's hand and went in, then 'Alqamah came out and we asked him and he told us what they were",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "It was narrated that 'Amr bin Murrah said:\"I heard Abu Wa'il say: \"A man said in the presence of Abdullah: 'I recited Al-Mufassal in one rak'ah.' He said: 'That is like reciting poetry. I know the similar surahs that the Messenger of Allah (ﷺ) used to recite together.' And he mentioned twenty surahs from Al-Mufassal, two by two in each rak'ah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "It was narrated from 'Abdullah that:A man came to him and said: \"Last night I recited Al-Mufassal in one rak'ah.\" He said: \"That is like reciting poetry. But the Messenger of Allah (ﷺ) used to recite similar surahs, twenty surahs from Al-Mufassal, those that start with Ha-Mim",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "It was narrated that Abdullah bin As-Sa'ib said:\"I was with the Messenger of Allah (ﷺ) on the day of the Conquest (of Makkah). He prayed in front of the Ka'bah. He took off his shoes and placed them to his left, and he started to recite Surat Al-Mu'minun. When he reached the passage that mentions Musa and 'Eisa, peace be upon them both, he started coughing, then he bowed",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1008,
			"arabicnumber": 1008,
			"text": "It was narrated from Hudhaifah that:He prayed beside the Prophet (ﷺ) one night. He recited, and when he came to a verse that mentioned punishment, he would pause and seek refuge with Allah; if he came to a verse that mentioned mercy, he would pause for mercy. In his bowing he would say: 'Subhana Rabbil-Azim (Glory be to my Lord Almighty)' and in his prostration he would say: 'Subhan Rabbil-A'la (Glory be to my Lord the Most High)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1009,
			"arabicnumber": 1009,
			"text": "It was narrated from Hudhaifah that:The Prophet (ﷺ) recited Surat Al-Baqarah, Al 'Imran and An-Nisa' in one rak'ah, and he did not reach any verse that spoke of mercy but he asked Allah for it, nor any verse that spoke of punishment but he asked Allah for protection therefrom",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1010,
			"arabicnumber": 1010,
			"text": "Jasrah bint Dijajah said:\"I heard Abu Dharr say: 'The Prophet (ﷺ) stayed up all night repeating one verse. The verse was: 'If You punish them, they are Your slaves, and if You forgive them, verily, You, only You, are the All-Mighty, the All-Wise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1011,
			"arabicnumber": 1011,
			"text": "It was narrated that Ibn 'Abbas said:Concerning the saying of Allah, the Mighty and Sublime: \"And offer your salah (prayer) neither aloud nor in a low voice\"- It was revealed when the Messenger of Allah (ﷺ) was still (preaching) in secret in Makkah. When he led his companions in prayer, he would raise his voice\" -(One of the narrators) Ibn Mani' said: He would recite the Quran out loud\"- \"And when the idolators heard his voice they would insult the Quran, and the One Who revealed it, and the one who brought it. So Allah, the Mighty and Sublime, said to His Prophet (ﷺ): And offer your salah (prayer) neither aloud that is, such that the idolators can hear your recitation and insult the Quran; nor in a low voice, so that your companions cannot hear; but follow a way between",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1012,
			"arabicnumber": 1012,
			"text": "It was narrated that Ibn Abbas said:\"The Prophet (ﷺ) used to raise his voice when reciting Quran, and when the idolaters heard his voice they would insult the Quran and the one who had brought it. So the Prophet (ﷺ) began to lower his voice such that his companions would not hear him. Then Allah (SWT), the Mighty and Sublime, revealed: 'And offer your salah (prayer) neither aloud nor in a low voice, but follow a way between",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "Umm Hani said:\"I used to listen to the Prophet (ﷺ) reciting Quran when I was on my roof",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "It was narrated that Qatadah said:\"I asked Anas: 'How did the Messenger of Allah (ﷺ) recite Quran?' He said: 'He used to elongate the sounds",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1015,
			"arabicnumber": 1015,
			"text": "It was narrated that Abu Bara' said:\"The Messenger of Allah (ﷺ) said: 'Make your voices beautiful when you recite Quran",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "It was narrated that Al-Bara' bin Azib said:\"The Messenger of Allah (ﷺ) said: 'Make your voices beautiful when you recite Quran",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1017,
			"arabicnumber": 1017,
			"text": "It was narrated from Abu Hurairah that:He heard the Messenger of Allah (ﷺ) say: \"Allah never listens to anything as He listens to a Prophet with a beautiful voice chanting the Quran aloud",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1018,
			"arabicnumber": 1018,
			"text": "It was narrated from Abu Hurairah that:The Prophet (ﷺ) said: \"Allah, the Mighty and Sublime, never listens to anything as He listens to a Prophet chanting the Quran",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1019,
			"arabicnumber": 1019,
			"text": "Abu Hurairah narrated that:The Messenger of Allah (ﷺ) heard the recitation of Abu Musa and said: He has been given a Mizmar among the Mazamir of the family of Dawud, peace be upon him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1020,
			"arabicnumber": 1020,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) heard the recitation of Abu Musa and said: 'This man has been given a Mizmar among the Mazamir of the family of Dawud, peace be upon him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1021,
			"arabicnumber": 1021,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) heard the recitation of Abu Musa and said: 'This man has been given a Mizmar among the Mazamir of the family of Dawud, peace be upon him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1022,
			"arabicnumber": 1022,
			"text": "It was narrated from Ya'la bin Mamlak that :He asked Umm Salamah about the recitation and prayer of the Messenger of Allah (ﷺ) and she said: \"Why do you want to know about his prayer?\" Then she described his recitation and as being so measured and clear that each letter could be distinguished",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1023,
			"arabicnumber": 1023,
			"text": "It was narrated from Abu Salamah bin Abdur-Rahman that:Marwan appointed Abu Hurairah as governor of Al-Madinah. When he stood to offer an obligatory prayer, he would say the takbir, then he said the takbir when he bowed, and when he raised his head from bowing he said: \"Sami' Allahu liman hamidah, Rabbana wa lakal-hamd (Allah hears those who praise Him; our Lord, and to You be the praise).\" Then he would say the takbir when he went down in prostration, then he said the takbir when he stood up after two rak'ahs, after saying the Tashahhud, and he did that until he had finished the prayer. When he had finished his prayer and said the Salam, he turned to the people in the masjid and said: \"By the One in Whose Hand is my soul, I am the one among you whose prayer most closely resembles that of the Messenger of Allah (ﷺ)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "It was narrated that Malik bin Al-Huwairith said:\"I saw the Messenger of Allah (ﷺ) raise his hands until they reached the highest part of his ears, when he said the takbir, when he bowed and when he raised his head from bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1025,
			"arabicnumber": 1025,
			"text": "It was narrated from Salim that:His father said: \"I saw the Messenger of Allah (ﷺ) when he started to pray, raise his hands until they were parallel to his shoulders, (and he did that) when he bowed and when he raised his head from bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1026,
			"arabicnumber": 1026,
			"text": "It was narrated from 'Alqamah, that Abdullah said:\"Shall I not tell you about the prayer of the Messenger of Allah (ﷺ)? He stood and raised his hands the first time and then he did not do that again",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "It was narrated that Abu Mas'ud said:\"The Messenger of Allah (ﷺ) said: 'The prayer is not valid if a man does not bring his backbone to rest while bowing and prostrating",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1028,
			"arabicnumber": 1028,
			"text": "It was narrated from Anas that the Messenger of Allah (ﷺ) said:\"Be moderate in bowing and prostration, and do not rest your forearms along the ground like a dog",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 153
			}
		}
	]
}