{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"12": "The Book of The At-Tatbiq (Clasping One's Hands Together)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1029,
			"arabicnumber": 1029,
			"text": "It was narrated from 'Alqamah and Al-Aswad that:They were with 'Abdullah in his house and he said: \"Have these people prayed?\" We said: \"Yes.\" So he led them in prayer and stood between them, with no Adhan and no Iqamah, and said: \"If you are three then do this, and if you are more than that then let one of you lead the others in prayer, and let him lay his hands on his thighs. It is as if I can see the fingers of the Messenger of Allah (ﷺ), interlaced",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1030,
			"arabicnumber": 1030,
			"text": "It was narrated that 'Alqamah and Al-Aswad said:\"We prayed with Abdullah bin Mas'ud in his house. He stood between us and we placed our hands on our knees, but he took them off and made us interlace our fingers, and said: \"I saw the Messenger of Allah (ﷺ) do that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1031,
			"arabicnumber": 1031,
			"text": "It was narrated that Abdullah said:\"The Messenger of Allah (ﷺ) taught us the prayer. He stood up and said the takbir, and when he wanted to bow, he put his hands together and put his hands between his knees and bowed.\" News of that reached Sa'd and he said: \"My brother has spoken the truth. We used to do that, then we were commanded to do this,\" meaning to hold the knees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1032,
			"arabicnumber": 1032,
			"text": "It was narrated that Mus'ab bin Sa'd said:\"I prayed beside my father and I put my hands between my knees, and he told me: 'Put your hands on your knees.' Then I did that again and he struck my hands and said: 'We were forbidden to do that, and we were commanded to put our hands on our knees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1033,
			"arabicnumber": 1033,
			"text": "It was narrated that Mus'ab bin Sa'd said:\"I bowed and put my hands together, and my father said: 'This is something that we used to do, then we brought them up to our knees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1034,
			"arabicnumber": 1034,
			"text": "It was narrated that 'Umar said:\"It is established for you to hold the knees, so hold the knees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1035,
			"arabicnumber": 1035,
			"text": "It was narrated that 'Abdur-Rahman As-Sulami said:\" 'Umar said: 'The Sunnah is to hold the knees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1036,
			"arabicnumber": 1036,
			"text": "It was narrated that Salim said:\"We came to Abu Mas'ud and said to him: 'Tell us about the prayer of the Messenger of Allah (ﷺ).' He stood in front of us and said the takbir, then when he bowed he placed his palms on his knees and put his fingers lower than that, and he held his elbows out from his sides until every part of him had settled. Then he said: Sami' Allahu liman hamidah, Rabbana wa lakal-hamd (Allah hears those who praise Him, our Lord, and to You be the praise), then he stood up until every part of him had settled",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1037,
			"arabicnumber": 1037,
			"text": "It was narrated that 'Uqbah bin 'Amir said:\"Shall I not show you how I saw the Messenger of Allah (ﷺ) pray?\" We said: \"Yes.\" So he stood up and when he bowed, he placed his palms on his knees and put his fingers behind his knees, and held his arms out from his sides, until every part of him settled. Then he raised his head and stood up until every part of him settled. Then he prostrated and held his arms out from his sides, until every part of him settled. Then he sat up until every part of him settled. Then he prostrated again until every part of him settled. Then he did four rak'ahs like that. Then he said: \"This is how I saw the Messenger of Allah (ﷺ) pray, and this is how he used to lead us in prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1038,
			"arabicnumber": 1038,
			"text": "It was narrated that Salim Al- Barrad said:\"Abu Mus'ad said: 'Shall I not show you how the Messenger of Allah (ﷺ) prayed?' We said: 'Yes.' So he stood up and said the takbir, and when he bowed, he held his arms out from his sides until, when every part of him settled, he raised his head. He prayed four rak'ahs like that, and said: 'This is how I saw the Messenger of Allah (ﷺ) praying",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1039,
			"arabicnumber": 1039,
			"text": "It was narrated that Abu Humaid As-Sa'idi said:\"When the Prophet (ﷺ) bowed he was balanced, he did not make his head higher or lower than his back, and he put his hands on his knees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1040,
			"arabicnumber": 1040,
			"text": "It was narrated that 'Ali said:\"The Prophet (ﷺ) forbade me from wearing A-Qassi and silk, and gold rings, and from reciting Qur'an when bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "It was narrated that 'Ali said:\"The Prophet (ﷺ) forbade me from wearing gold rings, from reciting the Qur'an when bowing, and from wearing Al-Qassi, and clothes dyed with safflower",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1042,
			"arabicnumber": 1042,
			"text": "It was narrated that Ali said:\"The Messenger of Allah (ﷺ) forbade me-but I do not say he forbade you- from wearing gold rings, Al-Qassi, and from wearing Al-Mufaddam, and from wearing clothes dyed with safflower, and from reciting Qur'an when bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1043,
			"arabicnumber": 1043,
			"text": "It was narrated that 'Ali said:\"The Messenger of Allah (ﷺ) forbade me from wearing gold rings, and Al-Qassi, and clothes dyed with safflower, and reciting Qur'an while I am bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1044,
			"arabicnumber": 1044,
			"text": "It was narrated that Ali said:\"The Messenger of Allah (ﷺ) forbade me from wearing Al-Qassi, and clothes dyed from safflower, and from wearing gold rings, and from reciting Qura'n while bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1045,
			"arabicnumber": 1045,
			"text": "It was narrated that Ibn 'Abbas said:\"The Prophet (ﷺ) drew back the curtain when the people were in rows behind Abu Bakr, may Allah be pleased with him, and said: 'O people, there is nothing left of the features of Prophethood except a good dream that a Muslim sees or is seen by others for him.' Then he said: 'Verily, I have been forbidden from reciting the Qur'an when bowing or prostrating. As for bowing, glorify the Lord therein, and as for prostration, strive hard in supplication for it is more deserving of a response",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "It was narrated that Hudhaifah said:\"I prayed with the Messenger of Allah (ﷺ), and he bowed and said when bowing: 'Subhana Rabbial-azim (Glory be to my Lord Almighty).' And when prostrating: 'Subhana Rabbial-'Ala (Glory be to my Lord Most High)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1047,
			"arabicnumber": 1047,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) often used to say when bowing and prostrating: 'Subhanaka Rabbana wa bi Hamdika, Allahumm aghfirli (Glorfy and praise be to You, our Lord. O Allah, forgive me)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1048,
			"arabicnumber": 1048,
			"text": "It was narrated that Aishah said:\"The Messenger of Allah (ﷺ) used to say when bowing: 'Subbuhun Quddusun Rabbul-mala'ikati war-ruh (Perfect, Most Holy, is the Lord of the angels and the spirit)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1049,
			"arabicnumber": 1049,
			"text": "Asim bin Humaid said:\"I heard 'Awf bin Malik say: 'I prayed Qiyam with the Messenger of Allah (ﷺ) one night, and when he bowed, he stayed as long as it takes to recite Surat Al-Baqarah, saying: \"Subhana Dhil-jabaruti wal-malakuti wal-kibriya' wal-'azamah (Glory be to the One Who has all power, sovereignty, magnificence and might)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1050,
			"arabicnumber": 1050,
			"text": "It was narrated from Ali bin Abi Talib that:When the Messenger of Allah (ﷺ) bowed, he said: \"Allahumma laka rak`atu was laka aslamtu wa bika amantu, khasha`a laka sam`i wa basri wa `izami wa mukhi wa `asabi (O Allah, to You I have bowed and to You I have submitted and in You I have believed. My hearing, sight, bones, brain and sinews are humbled before You)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "It was narrated from Jabir bin 'Abdullah that:When the Prophet (ﷺ) bowed, he said: \"Allahumma laka rak'atu wa bika amantu wa laka aslamtu wa alayka tawwakaltu, anta Rabbi, khasha'a sam'i wa basri wa dammi wa lahmi wa 'azmi wa 'asabi Lillahi Rabbil-'Alamin ( O Allah, to You I have bowed, in You I believe, to You I have submitted and in You I put my trust. You are my Lord. My hearing, my sight, my blood, my flesh, my bones and sinews are humbled before Allah, the Lord of the Worlds)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "It was narrated from Muhammad bin Maslamah that:When the Messenger of Allah (ﷺ) stood to offer a voluntary prayer, he would say when he bowed: \"Allahumma laka rak'atu wa bika amantu wa laka aslamtu wa alayka tawwakaltu, anta Rabbi, khasha'a sam'i wa basri wa lahmi wa dammi wa mukhi wa 'asabi Lillahi Rabbil-'Alamin ( O Allah, to You I have bowed, in You I believe, to You I have submitted and in You I put my trust. You are my Lord. My hearing, my sight, my flesh, my blood, my brain and my sinews are humbled before Allah, the Lord of the Worlds)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "It was narrated that Rifa'ah bin Rafi'- who had been present at Badr- said:\"We were with the Messenger of Allah (ﷺ) when a man entered the Masjid and prayed. The Messenger of Allah (ﷺ) watched him without him realizing, then he finished, came to the Messenger of Allah (ﷺ) and greeted him with salam. He returned the salam and said: \"Go back and pray, for you have not prayed.'\" He (the narrator) said: \"I do not know if it was the second or third time,- \"(the man) said: 'By the One Who revealed the Book to you, I have tried my best. Teach me and show me.' He said: 'When you want to pray, perform wudu' and do it well, then stand up and face the qiblah. Then say the takbir, then recite, then bow until you are at ease in bowing. Then stand up until you are standing up straight. Then prostrate until you are at ease in prostration, then raise your head until you are at ease in sitting, then prostrate until you are at ease in prostration. If you do that then you will have done your prayer properly, and whatever you failed to do properly is going to detract from your prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "It was narrated that Qatadah said:\"I heard Anas narrate that the Prophet (ﷺ) said: \"Bow and prostrate properly when you bow and prostrate",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1055,
			"arabicnumber": 1055,
			"text": "Alqamah bin Wa'il said:\"My father told me: 'I prayed behind the Messenger of Allah (ﷺ) and I saw him raise his hands when he started to pray, and when he bowed, and when he said: Sami' Allahu liman hamidah (Allah hears the one who praises Him)\" like this.'\" And (one of the narrators) Qais pointed towards his ears",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"text": "It was narrated from Malik bin Al-Huwairith that:He saw the Prophet (ﷺ) raise his hands when he bowed, and when he raised his head from bowing, until they were in level with the highest part of his ears",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "It was narrated from Salim, from his father, that:The Messenger of Allah (ﷺ) used to raise his hands until they were in level with his shoulders when he started to pray, and when he raised his head from bowing he did likewise, and when he said: Sami' Allahu liman hamidah (Allah hears the one who praises Him)\" he said: \"Rabbana wa lakal-hamd (Our Lord, to You be praise)\" and he did not raise his hands between the two prostrations",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "It was narrated from Abdullah that he said:\"Shall I not show you how the Messenger of Allah (ﷺ) prayed?\" So he prayed, and he only raised his hands once",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "It was narrated from Ibn 'Umar that:When the Messenger of Allah (ﷺ) started to pray, he raised his hands until they were in level with his shoulders, and when he said the takbir before bowing, and when he raised his head from bowing he raised (his hands) likewise, and said: \"Sami Allahu liman hamidah Rabbana wa lakal-hamd (Allah hears the one who praises Him; Our Lord, and to You be praise),\" and he did not do that when prostrating",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "It was narrated that Abu Hurairah said:\"When the Prophet (ﷺ) raised his head from bowing, he said: 'Allahumma Rabbana wa lakal-hamd (O Allah, our Lord and to You be the praise)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "It was narrated from Anas that:The Prophet (ﷺ) fell from a horse onto his right side, and they entered upon him to visit him. The time for prayer came, and when he had finished praying he said: \"The Imam is appointed to be followed, so when he bows, then bow, and when he stands up, then stand up, and when he says: 'Sami' Allahu liman hamidah (Allah hears the one who praises Him)' then say: 'Rabbana wa lakal-hamd (Our Lord, and to You be the praise)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "It was narrated that Rifa'ah bin Rafi said:\"We were praying behind the Messenger of Allah (ﷺ) one day and when he raised his head from bowing he said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him).' A man behind him said: 'Rabbana wa lakal-hamd, hamdan kathiran tayyiban mubarakan fih. (O our Lord, and to You be praise, much blessed and pure praise.)' When the Messenger of Allah (ﷺ) had finished, he said: \"Who is the one who spoke just now?\" The man said: 'I did, O Messenger of Allah.' The Messenger of Allah (ﷺ) said: 'I saw thirty-some angels rushing to see which of them would write it down first",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) said: \"When the Imam says: 'Sami Allahu liman hamidah (Allah hears the one who praises Him),' then say: 'Rabbana wa lakal-hamd,' (Our Lord, and to You be the praise).' Whoever says that and it coincides with the angels saying it, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "It was narrated from Hittan bin 'Abdullah that:He heard Abu Musa say: \"The Prophet of Allah (ﷺ) addressed us and taught us our Sunnah and our prayer. He said: 'When you pray, make your rows straight and let one of you lead you in prayer. When the Imam says the takbir, then say the takbir. When he recites 'Not (the way) of those who earned Your anger, nor those who went astray' then say: \"Amin\" and Allah will answer you. When he says the takbir and bows, then say the takbir and bow. The Imam bows before you do and stands up before you do.' The Prophet of Allah (ﷺ) said: 'This makes up for that. And when he says: \"'Sami Allahu liman hamidah (Allah hears the one who praises Him),' then say: \"Allahumma Rabbana wa lakal-hamd (O Allah, our Lord, and to You be the praise), \" Allah will hear you, for Allah has said on the lips of His Prophet (ﷺ): \"Allah hears the one who praises Him.\" And when he (the Imam) says the takbir and prostrates, then say the takbir and prostrate. The Imam prostrates before you do and sits up before you do.' The Prophet of Allah (ﷺ) said: 'This makes up for that. And when he is sitting, let the first thing that any one of you says be: At-tahiyaatut-tayyibatus-salawatuLillah, salamun 'alayka ayyuhanabiyyu wa rahmatullahi wa barakatuhu, salamun 'alayna wa 'ala 'ibadillahis-salihin, ashhadu an la ilaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluh (All compliments, good words and prayers are due to Allah, peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah. I bear witness that there is none worthy of worship except Allah and I bear witness that Muhammad is His slave and Messenger)- seven phrases which are the greeting of the prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1065,
			"arabicnumber": 1065,
			"text": "It was narrated from Al-Bara' bin 'Azib that:The bowing of the Messenger of Allah (ﷺ), and when he raised his head from bowing, and his prostration, and the time between the two prostration, were almost equal in length",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "It was narrated from Ibn 'Abbas that:When the Prophet (ﷺ) said: \"Sami Allahu liman hamidah (Allah hears the one who praises Him),' he said: \"Allahumma Rabbana wa lakal-hamd, mil'as-samawati wa mil'al-ardi wa mil'ama shi'ta min shai'in ba'd ( O Allah, our Lord, to You be the Praise, filling the heavens, filling the Earth, and filling whatever else You will)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1067,
			"arabicnumber": 1067,
			"text": "It was narrated from Ibn 'Abbas that:When the Prophet (ﷺ) wanted to prostrate after bowing, he would say: \"Allahumma, Rabbana wa lakal-hamd, mil'as-samawati wa mil'al-ardi wa mil'ama shi'ta min shai'in ba'd ( O Allah, our Lord, to You be the Praise, filling the heavens, filling the Earth, and filling whatever else You will)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1068,
			"arabicnumber": 1068,
			"text": "It was narrated from Abu Sa'eed that:The Messenger of Allah (ﷺ) used to say: \"Sami Allahu liman hamidah, Rabbana wa lakal-hamd, mil'as-samawati wa mil'al-ardi wa mil'ama shi'ta min shai'in ba'd. Athlath-thana'i wal-majdi khairu ma qalal-'abdu wa kulluna laka 'abdun la mani'a lima a'taita wa la yanfa'u dhal-jaddi minkal-jadd (Allah hears the one who praises Him; Our Lord, to You be the Praise, filling the heavens, filling the Earth, and filling whatever else You will, Lord of Glory and Majesty, the truest thing a slave had said, and we are all slaves to You. None can withhold what You grant, nor can the possession of an owner benefit him before You)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1069,
			"arabicnumber": 1069,
			"text": "It was narrated from Hudhaifah that:He prayed with the Messenger of Allah (ﷺ) one night and he heard him say when he said the takbir: \"Allahu Akbara dhal-jabaruti wal-malakuti wal-kibriya'i wal-'azamah (Allah is Most Great, the One Who has all power, sovereignty, magnificence and might.)\" When bowing he would say: \"Subhana Rabbial-'Azim (Glory be to my Lord Almighty).\" When he raised his head from bowing he would say: \"Lirabbil-hamd, Lirabbil-hamd (To my Lord be praise, to my Lord be praise).\" And when he prostrated (he said): \"Subhana Rabbial-A'la (Glory be to my Lord Most High).\" And between the two prostrations (he said): \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me).\" His standing, his bowing, when he raised his head from bowing, his prostration and the time between the two prostrations, were almost the same",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1070,
			"arabicnumber": 1070,
			"text": "It was narrated that Anas bin Malik said:\"The Messenger of Allah (ﷺ) prayed (saying the) Qunut after bowing for a month, supplicating against Ri'l, Dhakwan and 'Usayyah who had disobeyed Allah and His Messenger.\" (Sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1071,
			"arabicnumber": 1071,
			"text": "It was narrated that Anas bin Malik was asked:\"Did the Messenger of Allah (ﷺ) say the Qunut in Subh prayer?\" He said: \"Yes.\" He was asked: \"Was that before bowing or after?\" He said: \"After bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1072,
			"arabicnumber": 1072,
			"text": "It was narrated that Ibn Sirin said:\"Some of those who prayed the Subh prayer with the Messenger of Allah (ﷺ) narrated to me that when he said: Sami'Allahu liman hamidah (Allah hears those who praise Him)' in the second rak'ah, he stood for a while",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1073,
			"arabicnumber": 1073,
			"text": "It was narrated that Abu Hurairah said:\"When the Messenger of Allah (ﷺ) raised his head in the second rak'ah of the subh prayer, he said: 'O Allah, save Al-Walid bin Al-Walid and Salamah bin Hisham and 'Ayyshah bin Abi Rabi'ah and those who are weak and oppressed in Makkah. O Allah, intensify Your punishment in Mudar and give them years (of famine) like the years of Yusuf",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1074,
			"arabicnumber": 1074,
			"text": "Abu Hurairah narrated that :The Messenger of Allah (ﷺ) used to supplicate in prayer when he said: \"Sami' Allahu liman hamidah, Rabbana wa lakal-hamd (Allah hears those who praise Him; O our Lord, and to You be praise),\"then he said while standing, before he prostrated: \"O Allah, save Al-Walid bin Al-Walid and Salamah bin Hisham and 'Ayyshah bin Abi Rabi'ah and those who are weak and oppressed in Makkah. O Allah, intensify Your punishment in Mudar and give them years (of famine) like the years of Yusuf.\" Then he would say: \"Allah is Most Great\" and then he prostrated. The people of Mudar and their environs were opposed to the Messenger of Allah (ﷺ) at the time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1075,
			"arabicnumber": 1075,
			"text": "It was narrated from Abu Salamah, that Abu Hurairah said:\"I shall explain to you the prayer of the Messenger of Allah (ﷺ).\" He said: \"Abu Hurairah used to say the Qunut in the last rak'ah of the Zuhr prayer, and the later Isha' prayer, and the Subh, after saying 'Sami Allahu liman hamidah.' He would pray for the believers and curse the disbelievers",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "It was narrated from Al-Bara' bin 'Azib that:The Prophet (ﷺ) used to say the Qunut in Subh and Maghrib. (One of the narrators) 'Ubaidullah said: \"Allah's Messenger (ﷺ) used to",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1077,
			"arabicnumber": 1077,
			"text": "It was narrated from Anas:\"The Messenger of Allah (ﷺ) said the Qunut for a month.\"- (One of the narrators) Shu'bah said: \"He cursed some men.\" Hisham said: \"He supplicated against some of the tribes of Arabs.\"-\"Then he stopped doing that after bowing.\" This is what Hisham said. Shu'bah said, narrating from Qatadah, from Anas that the Prophet (ﷺ) said the Qunut for a month, cursing Ri'l, Dhawkan and Lihyan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1078,
			"arabicnumber": 1078,
			"text": "It was narrated from Salim, from his father, that:He heard the Prophet (ﷺ), when he raised his head in the last rak'ah of the subh prayer, say: \"O Allah, curse so-and-so and so-and-so,\" supplicating against some of the hypocrites. Then Allah revealed the words: \"Not for you is the decision; whether He turns in mercy to (pardon) them or punishes them; verily, they are the wrongdoers",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1079,
			"arabicnumber": 1079,
			"text": "It was narrated from Anas that:The Messenger of Allah (ﷺ) said the Qunut for one month, supplicating against one of the 'Arab tribes, then he stopped doing that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "It was narrated from Abu Malik Al-Ashja'i that his father said:\"I prayed behind the Messenger of Allah (ﷺ) and he did not say the Qunut, and I prayed behind Abu Bakr and he did not say the Qunut, and I prayed behind Umar and he did not say the Qunut, and I prayed behind Uthman and he did not say the Qunut, and I prayed behind Ali and he did not say the Qunut.\" Then he said: \"O my son, this is an innovation",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1081,
			"arabicnumber": 1081,
			"text": "It was narrated that Jabir bin 'Abdullah said:\"We used to pray Zuhr with the Messenger of Allah (ﷺ) and I would take a handful of pebbles in my hand to cool them down, then I would pass them from one hand to the other, and when I prostrated I would put them down to lay my forehead on them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1082,
			"arabicnumber": 1082,
			"text": "It was narrated that Mutarrif said:\"Imran bin Husain and I prayed behind Ali bin Abi Talib. When he prostrated he said the Takbir, and when he raised his head from prostration he said the takbir, and when he stood up following two rak'ahs he said the takbir, and when he had finished praying, 'Imran took my hand and said: 'This reminded me of- he said a word meaning- the prayer of Muhammad (ﷺ)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1083,
			"arabicnumber": 1083,
			"text": "It was narrated that Abdullah bin Mas'ud said:\"The Messenger of Allah (ﷺ) used to say the takbir every time he went down and came up, and he would say the Salam to his right and his left. And Abu Bakr and 'Umar used to do likewise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1084,
			"arabicnumber": 1084,
			"text": "It was narrated that Abu Bushr said:\"I heard Yusuf-meaning Ibn Mahak- narrating that Hakim said: 'I gave my pledge of allegiance to the Messenger of Allah (ﷺ), pledging that I would go down (in prostration) only after standing up from bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1085,
			"arabicnumber": 1085,
			"text": "It was narrated from Malik bin Al-Huwairith that:He saw the Prophet (ﷺ) raise his hands when praying, when he bowed, when he raised his head from bowing, when he prostrated and when he raised his head from prostrating, until they were in level with the top part of his ears",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1086,
			"arabicnumber": 1086,
			"text": "It was narrated from Malik bin Al-Huwairith that:He saw the Prophet (ﷺ) raise his hands, a similar report",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1087,
			"arabicnumber": 1087,
			"text": "It was narrated from Malik bin Al-Huwairith that:He saw the Prophet of Allah (ﷺ) raise his hands when he started to pray, and he narrated a similar report and added: \"When he bowed he did likewise, and when he raised his head from bowing he did likewise, and when he raised his head from prostration he did likewise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1088,
			"arabicnumber": 1088,
			"text": "It was narrated that Ibn 'Umar said:\"The Messenger of Allah (ﷺ) used to raise his hands when he started to pray, and when he bowed, and when he stood up, but he did not do that when he prostrated",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1089,
			"arabicnumber": 1089,
			"text": "It was narrated that Wa'il bin Hujr said:\"I saw the Messenger of Allah (ﷺ) when he prostrated, he lowered his knees before his hands, and when he came up he raised his hands before his knees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1090,
			"arabicnumber": 1090,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'Is there any one of you who kneel as a camel kneels when praying?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'When one of you prostrates, let him put his hands down before his knees, and not kneel like a camel",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "It was narrated from Ibn 'Umar in a Marfu' report that:The hands prostrate as the face prostrates, so when one of you puts his face down he should put his hands down, and when he raises (the face) he should raise (the hands) too",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "It was narrated that Ibn 'Abbas said:\"The Prophet (ﷺ) was commanded to prostrate on seven parts of his body and not to tuck up his hair or his garment",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "It was narrated from Al 'Abbas bin 'Abdul-Muttalib that :He heard the Messenger of Allah (ﷺ) say: \"When a person prostrates, seven parts of his body prostrate: his face, his two palms, his two knees and his two feet",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "It was narrated that Abu Sa'eed Al-Khudri said:\"My two eyes saw the traces of water and mud on the forehead and nose of the Messenger of Allah (ﷺ), from his praying Qiyam on the night of the twenty-first",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "It was narrated from Ibn 'Abbas that :The Messenger of Allah (ﷺ) said: \"I have been commanded to prostrate on seven, and not to tuck up my hair nor my garment: the forehead, the nose, the hands, the knees and the feet",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "It was narrated from Ibn 'Abbas that:The Prophet (ﷺ) said: \"I have been commanded to prostrate on seven bones: on the forehead\"- and he pointed with his hand- \"on the nose, the hands, the knees and the ends of the feet",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "It was narrated from Ibn 'Abbas:\"The Prophet (ﷺ) was commanded to prostrate on seven-and he was forbidden to tuck up his hair and garment-on his hands, his knees, the edges of his feet.\" Sufyan said: \"Ibn Tawus said to us: 'He put his hand on his forehead and moved it down to his nose and said: This one thing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "It was narrated from 'Abbas bin 'Abdul-Muttalib that:He heard the Messenger of Allah (ﷺ) say: \"When a person prostrates, seven parts of his body prostrate with him: his forehead, his two hands, his two knees and his two feet",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "It was narrated that 'Aishah said:\"I noticed the Messenger of Allah (ﷺ) was missing one night, and I found him when he was prostrating with his feet held upright, and he was saying: 'Allahumma, inni a'udhu biridaka min sakhatik, wa bimu'afatika min 'uqubatik, wa bika minka la uhsi thana'an 'alaika anta kama athnaita 'ala nafsik (O Allah, I seek refuge with Your pleasure from Your wrath, in Your forgiveness from Your punishment and in You from You. I cannot praise You enough, You are as You have praised Yourself)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "It was narrated that Abu Humaid As-Sa'idi said:\"When the Prophet (ﷺ) fell to the ground during prostration, he held his arms away from his sides and bent his toes",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "It was narrated that Wa'il bin Hujr said:\"I came to Al-Madinah and said: 'I am going to watch the Messenger of Allah (ﷺ) pray. He said the takbir and raised his hands until I saw his thumbs near his ears. When he wanted to bow, he said the takbir and raised his hands. Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him).' Then he said the takbir and prostrated, and his hands were in the same position in relation to his ears as when he started the prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "It was narrated from Anas that:The Messenger of Allah (ﷺ) said: \"Do not rest your forearms on the ground like a dog when prostrating",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "It was narrated that Abu Ishaq said:\"Al-Bara' described the prostration to us. He places his hands on the ground and raised his posterior and said: 'This is what I saw the Messenger of Allah (ﷺ) doing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "It was narrated from Al-Bara' that:When the Messenger of Allah (ﷺ) prayed he would Jakhkha",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "It was narrated from Abdullah bin Malik bin Buhainah that:When the Messenger of Allah (ﷺ) prayed he held his arms out so much that the whiteness of his armpits appeared",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "It was narrated that Abu Hurairah said:\"If I were in front of the Messenger of Allah (ﷺ) I would be able to see the whiteness of his armpits.\" (One of the narrators) Abu Mijlaz said: \"It is as if he said that because he was praying",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "It was narrated from 'Ubaidullah bin Abdullah bin Aqram that his father said:\"I prayed with the Messenger of Allah (ﷺ) and I used to see the whiteness of his armpits when he prostrated",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "It was narrated from Maimunah that:When the Prophet (ﷺ) prostrated he would hold his arms out from his sides so that if a lamb wanted to pass beneath his arms it would be able to do so",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "It was narrated that Qatadah said:\"I heard Anas (narrate) that the Messenger of Allah (ﷺ) said: 'Be moderate in prostration and do not rest your forearms along the ground like a dog",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "It was narrated that Abu Mas'ud said:\"The Messenger of Allah (ﷺ) said: 'No prayer is valid in which a man does not maintain his back (at ease) when bowing and prostrating",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "Abdur-Rahman bin Shibl said:The Messenger of Allah (ﷺ) forbade three things: \"Pecking like a crow, resting one's forearms on the ground like a predator, and allocating the same place for prayer like a camel gets used to a certain place",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "It was narrated from Ibn 'Abbas that :The Messenger of Allah (ﷺ) said: \"I have been commanded to prostrate on seven and not to tuck up my hair or garment",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "It was narrated from 'Abdullah bin 'Abbas that:He saw 'Abdullah bin Al-Harith praying with his hair bound behind him. He stopped and started to undo it. When he finished he turned to Ibn 'Abbas and said: \"What were you doing to my head?\" He said: \"I heard the Messenger of Allah (ﷺ) say: 'The likeness of this is that of one who prays with his hands tie behind his neck",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "It was narrated that Ibn 'Abbas said:\"The Prophet (ﷺ) was commanded to prostrate on seven bones and was forbidden to tuck up his hair and garment",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "It was narrated that Anas said:\"When he prayed Zuhr behind the Messenger of Allah (ﷺ) we would prostrate on our garments because of the heat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "It was narrated from Anas that:The Messenger of Allah (ﷺ) said: \"Bow and prostrate properly, for by Allah (SWT) I can see you from behind my back when you bow and prostrate",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "It was narrated that 'Ali bin Abi Talib said:\"My beloved (ﷺ) forbade me from doing three things, but I do not say that he forbade the people. He forbade me from wearing gold rings, wearing Qassi, wearing clothes dyed with safflower Mufaddamah, and from reciting the Quran when prostrating or bowing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "Ali said:\"The Messenger of Allah (ﷺ) forbade me from reciting the Quran when bowing or prostrating",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "It was narrated that 'Abdullah bin 'Abbas said:\"The Messenger of Allah (ﷺ) drew aside the curtain when he had a cloth wrapped around his head during his final illness, and said: 'O Allah, I have conveyed (the Message)' three times. 'There is nothing left of the features of Prophethood except a good dream that a person sees or is seen by others for him. But I have been forbidden to recite the Qur'an when bowing and prostrating, so when you bow, then glorify your Lord and when you prostrate, then strive hard in supplication, for it is more deserving of a response",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "It was narrated that Ibn 'Abbas said:\"I stayed overnight with my maternal aunt Maimunah bin Al-Harith, and the Messenger of Allah (ﷺ) stayed overnight with her. I saw him get up to relieve himself and he went to the waterskin and undid its string, then he performed wudu and that was moderate (in the amount of water used). Then he went to his bed and slept. Then he got up again and went to the waterskin and undid its string, and performed wudu again, like the first time. Then he stood and prayed, and when he prostrated he said: 'Allahummaj'al fi qalbi nuran waj'al fi sami' nuran waj'al fi basri nuran, waj'al min tahti nuran waj'al min fawqi nuran, wa 'an yamii nuran wa 'an yasari nuran waj'al amami nuran, waj'al khalfi nuran wa a'zimli nura (O Allah, place light in my heart, and place light in my hearing, and place light in my seeing, and place light beneath me, and place light above me, and light on my right, and light on my left, and place light behind me, and make the light greater for me.') Then he slept until he started to snore, then Bilal came and woke him up for the prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) used to say when bowing and prostrating: 'Subhanakallahumma, Rabbana wa bihamdik. Allahumma-ghfirli (Glory be to You O Allah, Our Lord, and praise. O Allah, forgive me,\" following the command of the Quran)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) used to say when bowing and prostrating: 'Subhanaka Allahumma, Rabbana wa bihamdik. Allahumma-ghfirli (Glory be to You O Allah, Our Lord, and praise. O Allah, forgive me,\" following the command of the Quran)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "Aishah said:\"I noticed that the Messenger of Allah (ﷺ) was missing from bed, so I started to look for him, and I thought that he had gone to one of his concubines. Then my hand fell on him when he was prostrating and saying: \"Allahummaghfirli ma asrartu wa ma a'lant (O Allah, forgive me for what (sin) I have concealed and what I have done openly",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "It was narrated that Aishah said:\"I noticed that the Messenger of Allah (ﷺ) was missing and I thought he had gone to visit one of his concubines, so I looked for him and found him prostrating and saying: 'Rabbighfirli ma asrartu wa ma a'lant (O Allah, forgive me for what (sin) I have concealed and what I have done openly",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "It was narrated from 'Ali that:When the Messenger of Allah (ﷺ) prostrated he would say: \"Allahumma laka sajadtu wa laka aslamtu wa bika amantu sajada wajhi lilladhi khalaqahu wa sawwarahu fa ahsana suratahu wa shaqqa sam'ahu wa basarahu, tabarak Allahu ahsanul-khaliqin ( O Allah, to You I have prostrated and to You I have submitted, and in You I have believed. My face has prostrated to the One Who created it and shaped it and shaped it well, and brought forth its hearing and sight. Blessed be Allah the best of Creators)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "It was narrated from Jabir bin 'Abdullah that:The Prophet (ﷺ) used to say when prostrating: \"Allahumma laka sajadtu wa laka aslamtu wa anta Rabbi, sajada wajhi lilladhi khalaqahu wa sawwarahu wa shaqqa sam'ahu wa basarahu, tabarak Allahu ahsanul-khaliqin ( O Allah, to You I have prostrated and in You I have believed and to You I have submitted, and You are my Lord. My face has prostrated to the One Who created it and formed it, and brought forth its hearing and sight. Blessed be Allah the best of Creators)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "It was narrated from Muhammad bin Maslamah that:When the Messenger of Allah (ﷺ) got up to offer voluntary prayers at night, he would say when he prostrated: \"Allahumma laka sajadtu wa bika amantu wa laka aslamtu, Allahumma anta Rabbi, sajada wajhi lilladhi khalaqahu wa sawwarahu wa shaqqa sam'ahu wa basarahu, tabarak Allahu ahsanul-khaliqin ( O Allah, to You I have prostrated and in You I have believed and to You I have submitted. O Allah, You are my Lord. My face has prostrated to the One Who created it and formed it, and brought forth its hearing and sight. Blessed be Allah the best of Creators)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "It was narrated from Aishah that:The Prophet (ﷺ) used to say, when he did a prostration that was required when reciting Quran at night: \"Sajada wajhi lilladhi khalaqahu wa sawwarahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatih (My face has prostrated to the One Who created it and formed it, and brought forth its hearing and sight by His power and strength)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "It was narrated that 'Aishah said:\"I noticed the Messenger of Allah (ﷺ) was missing one night and I found him prostrating with the tops of his feet facing toward the Qiblah. I heard him saying: 'A'udhu biridaka min sakhatika, wa a'udhu bimu 'afatika min 'uqubatika wa a'udhu bika minka la uhsi thana'an 'alaika anta kama athnaita 'ala nafsik (I seek refuge in Your pleasure from Your wrath; I seek refuge in Your forgiveness from Your punishment; I seek refuge in You from You. I cannot praise You enough, You are as You have praised Yourself)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "It was narrated that 'Aishah said:\"I noticed that the Messenger of Allah (ﷺ) was missing one night, and I thought he had gone to one of his other wives. I tried to feel for him, and I found him bowing or prostrating and saying: 'SubhanakAllahumma wa bihamdika la ilaha ila ant (Glory and praise be to You, O Allah, there is none worthy of worship but You.)'\" She said: \"May my father and mother be ransomed for you. I thought you were doing one thing and you were doing something else altogether",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "Awf bin Malik said:\"I prayed Qiyam with the Prophet (ﷺ). He started by using the Siwak and performing wudu, then he stood and prayed. He started reciting Al-Baqarah and he did not come to any verse that spoke of mercy but he paused and asked for mercy, and he did not come to any verse that spoke of punishment but he paused (and sought refuge with Allah from that). Then he bowed and he stayed bowing for as long as he had stood,a nd he said while bowing: 'Subhanaka Dhil-jabaraut wal-malakut wal-kibriya' wal-'azamah (Glory be to the One Who has all power, sovereignty, magnificence and might.)' Then he prostrated for as long as he had bowed, saying while prostrating: 'Subhana Dhil-jabarut wal-malakut wal-kibriya' wal-'azamah (Glory be to the One Who has all power, sovereignty, magnificence and might.)' Then he recited Al Imran, then another surah and another, doing that each time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "It was narrated that Hudhaifah said:\"I prayed with the Messenger of Allah (ﷺ) one night. He started reciting Surat Al-Baqarah and he recited one hundred verses, then did not bow, rather he continued. I thought: 'He will complete it in two rak'ahs, but he continued.' I thought: 'He will complete it and then bow,' but he continued until he recited Surat An-Nisa', then Al Imran. Then he bowed for almost as long as he had stood, saying while bowing: 'Subhan Rabbial-azim, Subhan Rabbial-azim, Subhan Rabbial-azim ( Glory be to my Lord Almighty, Glory be to my Lord Almighty, Glory be to my Lord Almighty).' Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him). Then he prostrated and made his prostration lengthy, saying: \"Subhan Rabbial-A'la, Subhan Rabbial-A'la, Subhan Rabbial-A'la (Glory be to my Lord Most High, Glory be to my Lord Most High, Glory be to my Lord Most High). And he did not come to any verse that spoke of fear or glorifying Allah, the Mighty and Sublime, but he said something appropriate",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) said when bowing and prostrating: 'Subbuhun Quddusun Rabbul-mala'ikati war'ruh (Perfect, Most Holy, Lord of the Angels and the Spirit)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "Anas bin Malik said:\"I have never seen anyone whose prayer more closely resembles the prayer of the Messenger of Allah (ﷺ) than this young man- meaning 'Umar bin Abdul-aziz. And we estimated that when bowing he said the Tasbih ten times and when prostrating he said the Tasbih ten times",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "It was narrated that Rifa'ah bin Rafi' said:\"While the Messenger of Allah (ﷺ) was sitting with us around him, a man came in, turned towards the Qiblah and prayed. When he had finished his prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with Salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' So he went and prayed, and the Messenger of Allah (ﷺ) started watching him, and he (the man) did not know what was wrong with it. When he had finished the prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' He repeated it two or three times, then the man said: 'O Messenger of Allah, what is wrong with my prayer?' The Messenger of Allah (ﷺ) said: 'The prayer of any of you is not complete unless he performs wudu properly as enjoined by Allah, the Mighty and Sublime. So he should wash his face, his arms up to the elbows, and wipe his head, and (wash) his feet up to the ankles. Then he should magnify Allah (SWT) and praise Him and glorify Him.'\" - (One of the narrators) Hammam said: \"I heard him say: 'He should praise Allah and glorify Him and magnify Him.\" He said: \"I heard both of them.\" -\"He (the Prophet (ﷺ)) said: 'He should recite whatever is easy for him of the Quran that Allah has taught him and permitted him in it (the prayer). Then he should say the Takbir and bow until his joints settle and he is relaxed. Then he should say: 'Sami Allahu liman hamidah (Allah hears the one who praises Him)' and stand up straight until his backbone is straight (and at ease). Then he should say Takbir and prostrate until he has placed his face firmly on the ground.\" \"I heard him say: his forehead, until his joints settle and he is relaxed. Then he should say the Takbir and sit up until his backbone is straight (and at ease). Then he should prostrate until he has placed his face firmly on the ground and he is relaxed. If he does not do that then he has not completed his prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) said: \"The closest that a person can be to his Lord, the Mighty and Sublime, is when he is prostrating, so increase in supplication then",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "Rabi'ah bin Ka'b Al-Aslami said:\"I used to bring to the Messenger of Allah (ﷺ) water for wudu and serve him. He said: 'Ask of me.' I said: 'I want to be with you in Paradise.' He said: 'Is there anything else?' I said: 'That is all.' He said: 'Help me to fulfill your wish by prostrating a great deal",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "Ma'dan bin Talha Al-Ya'muri said:\"I met Thawban, the freed slave of the Messenger of Allah (ﷺ) and said: \"Tell me of an action that will benefit me or gain me admittance to Paradise.' He remained silent for a while, then he turned to me and said: 'You should prostrate, because I heard the Messenger of Allah (ﷺ) say: \"There is no one who prostrated once to Allah, the Mighty and Sublime, except that Allah will raise him one degree in status thereby, and erase one sin thereby.\" Ma'dan said: \"Then I met Abu Ad-Darda' and asked him the same question I had asked Thawban.\" He said to me: \"You should prostrate, for I heard the Messenger of Allah (ﷺ) say: \"There is no one who prostrates once to Allah (SWT), but Allah (SWT) will raise him one degree thereby and erase one sin thereby",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "It was narrated that 'Ata bin Yazid said:\"I was sitting with Abu Hurairah and Abu Sa'eed. One of them narrated the hadith about intercession and the other was listening. He said: 'Then the angels will come and intercede, and the messengers will intercede.' And he mentioned the Sirat, and said: \"The Messenger of Allah (ﷺ) said: 'I will be the first one to cross it, and when Allah has finished passing judgment among His creation, and has brought forth from the Fire those whom He wants to bring forth, Allah will command the angels and the messengers to intercede, and they will be recognized by their signs, for the Fire will consume all of the son of Adam apart from the place of prostration. Then the water of life will be poured on them, and they will grow like seeds on the banks of a rainwater stream",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "It was narrated from 'Abdullah bin Shaddad, this his father said:\"The Messenger of Allah (ﷺ) came out to us for one of the nighttime prayers, and he was carrying Hasan or Husain. The Messenger of Allah (ﷺ) came forward and put him down, then he said the Takbir and started to pray. He prostrated during his prayer, and made the prostration lengthy.\" My father said: \"I raised my head and saw the child on the back of the Messenger of Allah (ﷺ) while he was prostrating so I went back to my prostration. When the Messenger of Allah (ﷺ) finished praying, the people said: \"O Messenger of Allah (ﷺ), you prostrated during the prayer for so long that we thought that something had happened or that you were receiving a revelation.' He said: 'No such thing happened. But my son was riding on my back and I did not like to disturb him until he had enough",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "It was narrated from 'Abdur-Rahman bin Al-Aswad from his father-and Alqamah-that:Abdullah said: \"I saw the Messenger of Allah (ﷺ) say the Takbir every time he went down and got up, or stood or sat; he said the Salam on his right and his left: 'As-salamu alaykum wa rahmatulah (peace be upon you and the mercy of Allah ),' until the whiteness of his cheek could be seen.\" He said: \"And I saw Abu Bakr and 'Umar, may Allah (SWT) be pleased with them both, doing the same",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "It was narrated from Malik bin Al-Huwairith that:When the Prophet of Allah (ﷺ) started to pray, he raised his hands, and when he bowed, he did likewise, and when he raised his head from bowing he did likewise, and when he raised his head from prostration, he did likewise, meaning he raised his hands",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "It was narrated from Salim that his father said:\"When the Prophet (ﷺ) started to pray he said the takbir and raised his hands, and when he bowed, and after bowing, but he did not raise them between the two prostrations",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "A man from (the tribe of) 'Abs narrated from Hudhaifah that:He came to the Prophet (ﷺ) and stood by his side, and he said: \"Allahu Akbar Dhul-malakut wal-jabarut wal-kibriya' wal 'azamah (Allah is Most Great, the One Who has all sovereignty, power, magnificence, and might.)\" Then he recited Al-Baqarah, then he bowed, and his bowing lasted almost as long as his standing, and he said when bowing: 'Subahana Rabbial-'azim, Subhana Rabbial-'azim (Glory be to my Lord Almighty, Glory be to my Lord Almighty).\" When he raised his head he said: \"Li Rabbial-hamd, Li Rabbial-hamd (To my Lord be praise, to my Lord be praise).\" And when he prostrated he said: \"Subahana Rabbial-A'la, Subahna Rabbial-A'la (Glory be to my Lord Most High, glory be to my Lord Most High).\" And between the two prostrations he would say: \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "An-Nadr bin Kathir Abu Sahl Al-Aszidi said:\"Abdullah bin Tawus prayed beside me at Mina, in Masjid Al-Khaif, and when he made the first prostration he raised his head and raised his hands up to his face. I found that strange and I said to Wuhaib bin Khalid: \"This man does something that I have never seen anyone do.\" Wuhaib said to him: 'You do something that I have never seen anyone do.' Abdullah bin Tawus said: 'I saw my father do it, and my father said: \"I saw Ibn 'Abbas do it and 'Abullah bin Abbas said: 'I saw the Messenger of Allah (ﷺ) doing it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "It was narrated that Maimunah said:\"When the Messenger of Allah (ﷺ) prostrated, he would hold his arms out to his sides, so that the whiteness of his armpits could be seen from behind. And when he sat he rested on his left thigh",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "It was narrated that Al-Bara' said:\"In the prayer of the Messenger of Allah (ﷺ), his bowing, his prostration, standing after he raised his head from bowing and (sitting) between the two prostrations, were almost the same",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "It was narrated that Abdullah said:\"The Messenger of Allah (ﷺ) used to say the takbir every time he got up, went down, stood and sat. Abu Bakr, 'Umar, and 'Uthman (did likewise)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1150,
			"arabicnumber": 1150,
			"text": "Abu Hurairah said:\"When the Messenger of Allah (ﷺ) stood to pray, he said the takbir, when he (started), then he said the takbir when he bowed, then he said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him)', when he stood up from bowing. Then he said when he was standing: 'Rabbana lakal-hamd.' Then he said the takbir when he went down in prostration, then he said the takbir when he raised his head, and he did that throughout the entire prayer until he finished it, and he said the takbir when he stood up after the first two rak'ahs, after sitting",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"text": "It was narrated that Abi Qibalah said:\"Abu Sulaiman Malik bin Al-Huwairith came to our masjid and said: \"I want to show you how I saw the Messenger of Allah (ﷺ) pray.'\" He said: \"He sat during the first Rak'ah when he raised his head from the second prostration",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1152,
			"arabicnumber": 1152,
			"text": "It was narrated that Malik bin Al-Huwairith said:\"I saw the Messenger of Allah (ﷺ) pray, and when he was in an odd-numbered rak'ah, he did not get up until he had settled in a sitting position",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1153,
			"arabicnumber": 1153,
			"text": "It was narrated that Abu Qibalah said:\"Malik bin Al-Huwairith used to come to us and say: \"Shall I not tell you about the prayer of the Messenger of Allah (ﷺ)?\" He was praying at a time other than the time of prayer, and when he raised his head from the second prostration in the first rak'ah, he settled in a seated position, then he stood up, and he supported himself on the ground (while doing so)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1154,
			"arabicnumber": 1154,
			"text": "It was narrated that Wa'il bin Hujr said:'I saw the Messenger of Allah (ﷺ) when he prostrated, place his knees on the ground before his hands, and when he got up, he lifted his hands before his knees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1155,
			"arabicnumber": 1155,
			"text": "It was narrated from Abu Salamah :That Abu Hurairah used to lead them in prayer, and he said the takbir when he went down and came up. When he had finished he said: 'By Allah (SWT), I am the one among you whose prayer most closely resembles that of the Messenger of Allah (ﷺ)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1156,
			"arabicnumber": 1156,
			"text": "It was narrated from Abu Bakr bin 'Abdur-Rahman and from Abu Salamah bin 'Abdur-Rahman that:They prayed behind Abu Hurairah, may Allah (SWT) be pleased with him, and he when he bowed, he said the Takbir, when he raised his head he said: 'Sami Allahu liman hamidah, Rabbana wa lakal-hamd. Then he prostrated and said the takbir, then he raised his head and said the takbir, then he said the takbir when he stood up following that Rak'ah. Then he said: 'By the One in Whose Hand is my soul, I am the one among you whose prayer most closely resembles that of the Messenger of Allah (ﷺ). And this is how he continued to pray until he left this world",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1157,
			"arabicnumber": 1157,
			"text": "It was narrated from 'Abdullah bin 'Abdullah bin 'Umar that his father said:\"One of the sunnahs of the prayer is to spread your left foot beneath you, and hold your right foot upright",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1158,
			"arabicnumber": 1158,
			"text": "It was narrated from Al-Qasim who narrated from 'Abdullah-he is Ibn Abdullah bin 'Umar- that:His father (Ibn 'Umar) said: \"One of the sunnahs of the prayer is to hold the right foot upright and point its toes toward the Qiblah, and to sit on the left foot",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1159,
			"arabicnumber": 1159,
			"text": "It was narrated that Wa'il bin Hujr said:\"I came to the Messenger of Allah (ﷺ) and I saw him raising his hands when he started to pray until they were in level with his shoulders, and when he wanted to bow. When he sat following the first two rak'ahs, he sat on his left foot and held the right foot upright. He placed his right hand on his right thigh and raised his finger for the supplication, and he placed his left hand on his left thigh.\" He said: \"Then I came the following year and I saw them raising their hands inside their Baranis",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1160,
			"arabicnumber": 1160,
			"text": "It was narrated from 'Abdullah bin 'Umar that:He saw a man moving pebbles with his hand while praying. When he finished, 'Abdullah said to him: \"Do not move the pebbles while you are praying, for that is from Shaitan. Rather do what the Messenger of Allah (ﷺ) used to do.\" He said: \"What did he used to do?\" He said: \"He would put his right hand on his right thigh, and point with the finger that is next to the thumb toward the Qiblah, and he would look at it, or thereabouts.\" Then he said: \"This is what I saw the Messenger of Allah (ﷺ) doing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "Amr bin 'Abdullah bin Az-Zubair narrated that:His father said: \"When the Messenger of Allah (ﷺ) sat in the second or fourth rak'ah, he would place his hands on his knees and point with his finger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "It was narrated that 'Abdullah said:\"The Messenger of Allah (ﷺ) taught us to say when we sat following two rak'ahs: 'At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "It was narrated that 'Abdullah said:\"We used not to know what we should say in each rak'ah apart from glorifying, magnifying and praising our Lord. But Muhammad (ﷺ) taught us everything about what is good. He said: \"When you sit following every two rak'ahs, then say: At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger), then choose any supplication that you like and call upon Allah the Mighty and Sublime with it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "It was narrated that 'Abdullah said:\"The Messenger of Allah (ﷺ) taught us the tashahhud for prayer and the tashahhud for Al-Hajah. The tashahhud for prayer is: At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).' (to the end of the tashahhud)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"text": "Yahya-Ibn Adam- said:\"I heard Sufyan reciting this tashahhud in the obligatory and voluntary prayers, and he said: 'Abu Ishaq narrated to us from Abu Al-Ahwas from Abdullah, from the Prophet (ﷺ).'\" And Mansur and Hammad narrated to us from Abu Wa'il, from Abdullah, from the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "It was narrated from Al-Aswad and 'Alqamah, that Abdullah bin Mas'ud said:\"We were with the Messenger of Allah (ﷺ) and we did not know anything, then the Messenger of Allah (ﷺ) said to us: \"Every time you sit (in prayer), say: At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "It was narrated from 'Alqamah bin Qais that 'Abdullah said:\"We used not to know what to say when we prayed, then the Messenger of Allah (ﷺ) taught us some eloquent and concise words. He said to us: 'Say: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\" (One of the narrators) 'Ubaidullah said: \"Zaid bin Hammad said, narrating from Ibrahim, that 'Alqamah said: 'I saw Ibn Mas'ud teaching us these words just as he taught us the Quran",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "It was narrated that Ibn Mas'ud said:\"When we prayed with the Messenger of Allah (ﷺ), we used to say: \"Peace (As-Salam) be upon Allah (SWT), peace be upon Jibril, peace be upon Mika'il.' The Messenger of Allah (ﷺ) said: 'Do not say \"Peace (As-Salam) be upon Allah, for Allah is As-Salam.\" Rather say: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "It was narrated that Ibn Mas'ud said:\"We used to pray with the Messenger of Allah (ﷺ) and we would say: \"Peace (As-Salam) be upon Allah (SWT), peace be upon Jibril, peace be upon Mika'il.' The Messenger of Allah (ﷺ) said: 'Do not say \"Peace (As-Salam) be upon Allah, for Allah is As-Salam.\" Rather say: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "It was narrated from 'Abdullah that :The Prophet (ﷺ) said in the tashahhud: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": 1171,
			"text": "Abdullah said:\"The Messenger of Allah (ﷺ) taught us the tashahhud just as he taught us a surah from the Quran: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": 1172,
			"text": "It was narrated from Hittan bin 'Abdullah that Al-Ash'ari said:\"The Messenger of Allah (ﷺ) addressed us and taught us our Sunnahs and our prayer. He said: 'Make your rows straight, then let one of you lead the others. When he says the takbir, then say the takbir; when he says: \"Wa lad-dallin\" then say \"Amin\" and Allah (SWT) will answer you. When the Imam says the takbir and bows, then say the takbir and bow, for the Imam bows before you and stands up before you.' The Prophet of Allah (ﷺ) said: 'This makes up for that. When he says: 'Sami Allahu liman hamidah (Allah hears the one who praises Him), say: \"Rabbana wa lakal-hamd (Our Lord, to You be praise),\" Allah (SWT) will hear you, for indeed Allah, the Mighty and Sublime, has said on the tongue of His Prophet (ﷺ): \"Allah hears the one who praises Him.\" Then when the Imam says the takbir and prostrates, say the takbir and prostrate, for the Imam prostrates before you and rises before you.' The Prophet of Allah (ﷺ) said: 'This makes up for that. Then when you are sitting, let the first thing that any one of you says be: At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "It was narrated from Hittan bin Abdullah that:They prayed with Abu Musa and he said: \"The Messenger of Allah (ﷺ) said: 'When you are sitting then let the first words that any of you says be: At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah (ﷺ) used to teach us the tashahhud as he taught us the Quran, and he used to say: : 'At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa barakatuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ash-hadu an la ilaha ill-Allah wa ash-hadu anna Muhammadan 'abduhu wa rasuluhu (All compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1175,
			"arabicnumber": 1175,
			"text": "It was narrated that Jabir said:\"The Messenger of Allah (ﷺ) used to teach us the tashahhud just as he would teach us a surah of the Quran: \"Bismillah, wa billahi. At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu. A'sal Allahal-jannah wa a'udhu Billahi min an-nar (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger. I ask Allah for Paradise and I seek refuge with Allah from the Fire",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1176,
			"arabicnumber": 1176,
			"text": "It was narrated that 'Abdullah bin Mas'ud said:\"In the first two rak'ahs the Prophet (ﷺ) was as if he were on stones heated by fire",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": 1177,
			"text": "It was narrated from Ibn Buhainah that:The Prophet (ﷺ) prayed, then he stood up after two rak'ahs while he was supposed to sit, and he continued his prayer. Then at the end of his prayer, he performed two prostrations before the Salam, then he said the Salam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "It was narrated from Ibn Buhainah that:The Prophet (ﷺ) prayed and stood up following the first two rak'ahs, and they said (SubhanAllah). He carried on, then when he finished his prayer he performed two prostrations, then he said the Salam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 150
			}
		}
	]
}