{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"19": "The Book of the Prayer for the Two 'Eids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "It was narrated that Anas bin Malik said:\"The people of the Jahiliyyah had two days each year when they would play. When the Messenger of Allah (ﷺ) came to Al-Madinah he said: 'You had two days when you would play, but Allah (SWT) has given Muslims something instead that is better than them: the day of Al-Fitr and the day of Al-Adha",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "It was narrated from 'Umair bin Anas from his paternal uncles, that :Some people saw the crescent moon and came to the Prophet (ﷺ), and he told them to break their fast after the sun has risen and to go out for 'Eid the (morning of the) following day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "It was narrated that Hafsah said:\"Umm 'Atiyyah would never mention the Messenger of Allah (ﷺ) without saying: 'May my father be ransomed for him.' I said: 'Did you hear the Messenger of Allah (ﷺ) say such-and-such?' And she said: 'Yes, may my father be ransomed for him.' He said: Let the adolescent girls, women in seclusion and menstruating women come out and attend the 'Eid and supplications of the Muslims, but let the menstruating women keep away from the prayer place",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "It was narrated that Muhammad said:\"I met Umm 'Atiyyah and said to her: 'Did you hear the Messenger of Allah (ﷺ) say (anything)?' When she mentioned him, she would say: 'May my father be ransomed for him.' (He said) 'Bring out the adolescent girls and the women in seclusion and let them witness goodness and the supplication of the Muslims, but let the menstruating women keep away from the place where the people pray",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "It was narrated from Salim that:His father said: \"Umar bin A-Khattab, may Allah be pleased with him, found a Hullah of Istibraq in the market. He took it and brought it to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah (ﷺ), why don't you buy this and adorn yourself with it for the two 'Eids and when (meeting) the delegations?' The Messenger of Allah (ﷺ) said: 'This is the clothing of one who has no share in the Hereafter,' or: 'This is worn by one who has no share in the Hereafter.' Then as much time passed as Allah (SWT) willed, then the Messenger of Allah (ﷺ) sent to Umar a garment made of Dibaj. He brought it to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, you said that this is the clothing of one who has no share in the Hereafter, then you sent this to me?' The Messenger of Allah (ﷺ) said: 'Sell it and use the money for whatever you need",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "It was narrated from Tha'labah bin Zahdam that:'Ali appointed Abu Mas'ud over the people, then went out on the day of 'Eid and said: 'O people, it is not part of the sunnah to pray before the imam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "It was narrated that Jabir said:\"The Messenger of Allah (ﷺ) led us in praying on 'Eid before the Khutbah, with no Adhan and no Iqamah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "Al-Bara' bin 'Azib narrated to us by one of the pillars of the masjid:\"The Prophet (ﷺ) delivered a Khutbah on the day of An-Nahr and said: 'The first thing we start with on this day of ours is the prayer, then we offer sacrifice. Whoever does that, he has followed our sunnah, but whoever slaughtered (his sacrifice) before the (prayer), that is just meat that he gave to his family. Abu Burdah bin Niyar had slaughtered his sacrifice and he said: 'O Messenger of Allah (ﷺ), I have a Jadha'ah that is better than a Musinnah.' He said: 'Slaughter it (as a sacrifice), but that will not be sufficient for anyone else (as a sacrifice) after you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "It was narrated from Ibn 'Umar that:The Messenger of Allah (ﷺ), Abu Bakr, 'Umar, may Allah (SWT) be pleased with them, used to offer the 'Eid prayer before the Khutbah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "It was narrated from Ibn 'Umar that:The Messenger of Allah (ﷺ) used to take out an 'Anazah (a short spear) on the day of Al-Fitr and the day of Al-Adha, plant it in the ground, and pray facing toward it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "It was narrated that 'Umar bin Al-Khattab said:\"The prayer of Al-Adha is two rak'ahs, the prayer of Al-Fitr is two rak'ahs, the prayer of the traveler is two rak'ahs and the jumu'ah prayer is two rak'ahs, complete and not shortened, upon the tongue of the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "It was narrated that 'Ubaidullah bin 'Abdullah said:\"Umar, may Allah (SWT) be pleased with him, went out on the day of 'Eid and asked Abu Waqid Al-Laithi: 'What did the Prophet (ﷺ) recite on this day?' He said: 'Qaf' and '(The Hour) has drawn near",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "It was narrated from An-Nu'man bin Bashir that:The Messenger of Allah (ﷺ) used to recite on the two 'Eids and on Friday: \"GLorify the Name of Your Lord, the Most High\" and \"Has there come to you the narration of The Overwhelming?\" Sometimes the two ('Eid and Jumu'ah) occurred on the same day, and he would recite them (these two Surahs)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "It was narrated that 'Ata said:\"I heard Ibn 'Abbas say: 'I bear witness that I attended 'Eid with the Messenger of Allah (ﷺ); he started with the prayer before the Khutbah, then he delivered the Khutbah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "It was narrated that Al-Bara' bin 'Azib said:\"The Messenger of Allah (ﷺ) addressed us on the day of An-Nahr after the prayer.\" (Sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "It was narrated from 'Abdullah bin As-SA'ib that:The Prophet (ﷺ) offered the 'Eid prayer and said: 'Whoever would like to leave, let him leave, and whoever would like to stay for the Khutbah, let him stay",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "It was narrated that Abu Rimthah said:\"I saw the Prophet (ﷺ) delivering the Khutbah, wearing two green Burds",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "It was narrated that Abu Khalil Al-Ahmasi said:\"I saw the Prophet (ﷺ) delivering the Khutbah atop a she-camel and an Ethiopian was holding on to the camel's reins",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "It was narrated that Simak said:\"I asked Jabir: 'Did the Messenger of Allah (ﷺ) deliver the Khutbah standing?' He said: 'The Messenger of Allah (ﷺ) used to deliver the Khutbah standing, then he would sit for a while, then stand up again",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "It was narrated that Jabir said:\"I attended the prayer with the Messenger of Allah (ﷺ) on the day of 'Eid. He started with the prayer before the Khutbah, with no Adhan and no Iqamah. When he finished the prayer, he stood leaning on Bilal, and he praised and glorified Allah (SWT) and exhorted the people, reminding them and urging them to obey Allah (SWT). Then he moved away and went to the women, and Bilal was with him. He commanded them to fear Allah (SWT) and exhorted them and reminded them. He praised and glorified Allah, then he urged them to obey Allah, then he said: 'Give charity, for most of you are the fuel of Hell.' A lowly woman with dark cheeks said: 'Why, O Messenger of Allah?' He said: 'You complain a great deal and are ungrateful to your husbands.' They started taking off their necklaces, earrings and rings, throwing them into Bilal's garment, giving them in charity",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "It was narrated from Abu Sa'eed Al-Khudri that:The Messenger of Allah (ﷺ) used to go out to the prayer place on the day of Al-Fitr and the day of Al-Adha and lead the people in prayer. When he sat during the second rak'ah and said the taslim, he stood up and turned to face the people while the people were sitting. If he needed to mention something concerning the dispatch of an army he would tell the people, otherwise he would enjoin the people to give charity. He said: \"Give charity\" three times, and among those who gave the most charity were the women",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) said: \"If you say to your companion: 'Be quiet and listen' when the imam is delivering the Khutbah, you have engaged in idle speech",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "It was narrated that Jabir bin 'Abdullah said:\"In his Khutbah the Messenger of Allah (ﷺ) used to praise Allah as He deserves to be praised, then he would say: 'Whomsoever Allah (SWT) guides, none can lead him astray, and whomsoever Allah sends astray, none can guide. The truest of word is the Book of Allah and best of guidance is the guidance of Muhammad. The worst of things are those that are newly invented; every newly-invented thing is an innovation and every innovation is going astray, and every going astray is in the Fire.' Then he said: 'The Hour and I have been sent like these two.' Whenever he mentioned the Hour, his cheeks would turn red, and he would raise his voice and become angry, as if he were warning of an approaching army and saying: 'An army is coming to attack you in the morning, or in the evening!' (Then he said): 'Whoever leaves behind wealth, it is for his family, and whoever leaves behind a debt or dependents, then these are my responsibility, and I am the most entitled to take care of the believers",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "It was narrated from Abu Sa'eed that:The Messenger of Allah (ﷺ) used to go out on the day of 'Eid and pray two rak'ahs, then he would deliver the Khutbah and enjoin giving charity, and the ones who gave most charity were the women. If he had any exigency or he needed to send an army he would speak of that, if not, he would go back",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "It was narrated from Al-Hasan that :Ibn 'Abbas gave a Khutbah in Al-Basrah and said: \"Pay the zakah of your fasting.\" The people started looking at one another. He said: \"Whoever there is here from the people of Al-Madinah, get up and teach your brothers, for they do not know that the Messenger of Allah (ﷺ) enjoined sadaqat al-fitr on the young and the old, the free and the slave, the male and the female; half a sa' of wheat or a sa' of dried dates or barley",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "It was narrated that Al-Bara' said:\"The Messenger of Allah (ﷺ) addressed us on the day of An-Nahr after the prayer, then he said: 'Whoever prays and offers the sacrifice as we do, his ritual is complete, and whoever offers the sacrifice before the prayer, that is just ordinary meat.' Abu Burdah bin Niyar said: 'O Messenger of Allah (ﷺ), by Allah, we offered the sacrifice before I came out to the prayer, because I knew that today is the day of eating and drinking, so I hastened to do it and I ate of it and fed it to my family and neighbors.' The Messenger of Allah (ﷺ) said: 'That is just a sheep for meat.' He said: 'I have a jadha'ah that is better than two meaty sheep, will that be sufficient (as a sacrifice) for me?' He said: 'Yes, but it will not be sufficient for anyone after you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "It was narrated that Jabir bin Samurah said:\"I used to pray with the Prophet (ﷺ) and his prayer was moderate in length and his Khutbah was moderate in length",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "It was narrated that Jabir bin Samurah said:\"I saw the Messenger of Allah (ﷺ) delivering the Khutbah standing up, then he sat down for a while and did not speak, then he stood up and delivered another Khutbah. Whoever tells you that the Prophet (ﷺ) delivered a Khutbah sitting do not believe him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "It was narrated that Jabir bin Samurah said:\"The Prophet (ﷺ) used to deliver the Khutbah standing, then he would sit down, then he would stand up and recite some verses and remember Allah (SWT). And his Khutbah was moderate in length, and his prayer was moderate in length",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "It was narrated from Ibn Buraidah that:His father said: \"While the Messenger of Allah (ﷺ) was on the minbar, Al-Hasan and Al-Husain came,wearing red shirts, walking and stumbling. He came down and picked them up, then said: 'Allah has spoken the truth: Your wealth and your children are only a trial.' I saw these two walking and stumbling in their shirts, and I could not be patient until I went down and picked them up",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "Abdur-Rahman bin 'Abbas said:\"I heard 'Abbas when a man said to him: 'Did you go out (to the Eid prayer) with the Messenger of Allah?' He said: 'Yes, and were it not for my kinship (position) with him I would not have done so'\"-meaning due to him being so young- \"He (the Prophet (ﷺ)) went to the mark near the house of Kathir bin As-Salt and prayed, then delivered a Khutbah. Then he went to the women. He exhorted them and reminded them and told them to give charity. So a woman would bring her hand near her neck and take off her necklace and put it in the garment of Bilal",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "It was narrated from Ibn 'Abbas that:The Prophet (ﷺ) went out on the day of 'Eid and prayed two rak'ahs, and he did not pray before or after them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "It was narrated that Anas bin Malik said:\"The Messenger of Allah (ﷺ) addressed us on the day of Al-Adha and went to two black and white rams and slaughtered them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "It was narrated from Nafi that:Abdullah (bin Umar) told him that the Messenger of Allah (ﷺ) used to offer sacrifice in the prayer place",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "It was narrated that An-Nu'man bin Bashir said:\"The Messenger of Allah (ﷺ) used to recite: 'Glorify the Name of your Lord, the Most High' and \"Has there come to you the narration of The Overwhelming?', on Friday and on 'Eid, and when Friday and 'Eid converged, he would recite them both",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "It was narrated that Iyas bin Abi Ramlah said:\"I heard Mu'awiyah asking Zaid bin Arqam: 'Did you attend two 'Eids with the Messenger of Allah (ﷺ)?' He said: 'Yes; he prayed 'Eid at the beginning of the day then he granted a concession with regard to jumu'ah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "Wahb bin Kaisan said:\"Eid and Jumu'ah fell on the same day during the time of Ibn Az-Zubair, so he delayed going out until the sun had risen quite high. Then he went out and delivered a Khutbah, and he made the Khutbah lengthy. Then he came down and prayed, and he did not lead the people in praying jumu'ah that day. Mention of that was made to Ibn 'Abbas and he said: 'He has followed the sunnah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "It was narrated from 'Aishah that:The Messenger of Allah (ﷺ) entered upon her and there were two girls with her who were beating the duff. Abu Bakr scolded them, but the Prophet (ﷺ) said: \"Leave them, for every people has an 'Eid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "It was narrated that 'Aishah said:\"The black people came and played in front of the Prophet (ﷺ) on the day of 'Eid. He called me and I watched them from over his shoulder, and I continued to watch them until I was the one who moved away",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "It was narrated that 'Aishah said:\"I remember the Messenger of Allah (ﷺ) covering me with his Rida' while I was watching the Ethiopians playing in the masjid, until I got bored. So you should understand the keenness of young girls to play",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "It was narrated that Abu Hurairah said:\"Umar came in when the Ethiopians were playing in the masjid. Umar, may Allah (SWT) be pleased with him, rebuked them, but the Messenger of Allah (ﷺ) said: 'Let them be there, O Umar, for they are Banu Arfidah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": 1597,
			"text": "It was narrated from 'Urwah that he narrated from Aishah that Abu Bakr As-Siddiq :Entered upon her and there were two girls with her beating the duff and singing, and the Messenger of Allah (ﷺ) was covered with his garment. He uncovered his face and said: \"Let them be there, O Abu Bakr, for these are the days of 'Eid.\" Those were the days of Mina and the Messenger of Allah (ﷺ) was in Al-Madinah on that day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 42
			}
		}
	]
}