{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"20": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "It was narrated from Nafi' that Abdullah bin Umar said:\"Pray in your houses and do not make them like graves",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "It was narrated from Zaid bin Thabit that :The Prophet (ﷺ) used some palm fiber mats to section off a small area in the masjid. And the Messenger of Allah (ﷺ) prayed in it for several nights until the people gathered around him. Then, one night they did not hear his voice, and they thought that he was sleeping, so they cleared their throats to make him come out to them. He said: 'You kept doing that until I feared that it would be made obligatory for you, and if it were made obligatory, you would not be able to do it. O people, pray in your houses, for the best prayer a person offers is in his house, apart from the prescribed (obligatory) prayers",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "It was narrated from Sa'd bin Ishaq bin Ka'b bin Ujrah, from his father, that:His grandfather said: \"The Messenger of Allah (ﷺ) prayed Maghrib in the masjid of Banu 'Abdul-Ashhal, and when he finished praying some people stood up and offered Nafl prayers. The Prophet (ﷺ) said: 'You should offer this prayer in your houses",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "It was narrated from Sa'd bin Hisham that:He met Ibn 'Abbas and asked him about Witr. He said: \"Shall I not lead you to one who knows best among the people of the world about the witr of the Messenger of Allah (ﷺ)?\" He said: \"Yes.\" (Ibn Abbas) said: \"It is 'Aishah. So go to her and ask her (about witr) and then come back to me and tell me the answer that she gives you.\" So I went to Hakim bin Aflah and asked him to go accompany me to her. He said: \"I shall not go to her, for I told her not to say anything about these two (conflicting) groups, but she refused (to accept my advice) and went on (to participate in the conflict).\" I swore an oath, beseeching him (to take me to her). So he came with me and went unto her. She said to Hakim: \"Who is this with you?\" He said: \"He is Sa'd bin Hisham.\" She said: \"Which Hisham?\" He said: \"Ibn Amir.\" She supplicated for mercy for him and said: \"What a good man Amir was.\" He said: \"O Mother of the Believers, tell me about the character of the Messenger of Allah.\" She said: \"Don't you read the Qur'an?\" I said: \"Yes.\" She said \"The character of the Messenger of Allah (ﷺ) was the Qur'an.\" He said: \"I wanted to get up (and leave), then I thought of the Qiyam (night prayer) of the Messenger of Allah (ﷺ) and said: \"Tell me about the Qiyam of the Messenger of Allah (ﷺ).\" She said: \"Do you not recite this surah: \"O you wrapped in garments?\" I said: \"Yes.\" She said: \"Allah, the Mighty and Sublime, made Qiyam Al-Lail obligatory at the beginning of this surah, so the Messenger of Allah (ﷺ) and his companions prayed Qiyam Al-Lail for one year. Allah (SWT) withheld the latter part of this surah for twelve months, then he revealed the lessening (of this duty) at the end of this surah, so Qiyam Al-Lail became voluntary after it had been obligatory.\" I felt inclined to stand up (and not ask anything further), then I thought of the witr of the Messenger of Allah (ﷺ). I said: \"O Mother of the Believers, tell me about the witr of the Messenger of Allah (ﷺ).\" She said: \"We used to prepare his siwak and water for his ablution, and Allah (SWT) would wake him when He wished during the night. He would use the siwak, perform ablution, and then pray eight rak'ahs in which he would not sit until he reached the eighth one. Then he would sit and remember Allah (SWT) and supplicate, then he would say the taslim that we could hear. Then he would pray two rak'as sitting after uttering the taslim, then he would pray one rak'ah, and that made eleven rak'ahs, O my son! When the Messenger of Allah (ﷺ) grew older and put on weight, he prayed witr with seven rak'ahs, then he prayed two rak'ahs sitting down after saying the taslim, and that made nine rak'ahs. O my son, when the Messenger of Allah (ﷺ)offered a prayer, he liked to continue to offer it, and when sleep, sickness, or pain distracted him from praying Qiyam Al-Lail, he would pray twelve rak'ahs during the day. I am not aware of the Prophet of Allah (ﷺ) having recited the whole Qur'an during a single night, or praying through the whole night until morning, or fasting a complete month, except Ramadan.\" I went to Ibn 'Abbas and told him what she had said, and he said: \"She has spoken the truth. If I could go to her (and meet her face to face) I would so that she could tell me all of that verbally",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) said: \"Whoever prays Qiyam during Ramadan out of faith and in the hope of reward, he will be forgiven his previous sins",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah (ﷺ) said: \"Whoever prays Qiyam during Ramadan out of faith and in the hope of reward, he will be forgiven his previous sins",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "It was narrated from 'Aishah that:The Messenger of Allah (ﷺ) prayed in the masjid one night, and some people followed his prayer. Then he prayed the following night and more people came. Then they gathered on the third or fourth night and the Messenger of Allah (ﷺ) did not come out to them. When morning came he said: \"I saw what you did, and nothing prevented me from coming out to you but the fact that I feared that this would be made obligatory for you,\" and that was in Ramadan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "It was narrated that Abu Dharr said:\"We fasted with the Messenger of Allah (ﷺ) in Ramadan and he did not lead us in praying Qiyam until there were seven days left in the month, when he led us in praying Qiyam until one-third of the night had passed. Then he did not lead us in praying Qiyam when there were six days left. Then he led us praying Qiyam when there were five days left until one-half of the night had passed. I said: \"O Messenger of Allah! What if we spend the rest of this night praying Nafl?\" He said: \"Whoever prays Qiyam with the Imam until he finishes, Allah (SWT) will record for him the Qiyam of a (whole) night.\" Then he did not lead us in prayer or pray Qiyam until there were three days of the month left. Then he led us in praying Qiyam when there were three days left. He gathered his family and wives (and led us in prayer) until we feared that we would miss Al-Falah. I (one of the narrators) said: \"What is Al-Falah?\" He said: \"The suhur",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "Nu'aim bin Ziyad Abu Talhah said:\"I heard An-Nu'man bin Bashir on the minbar in Hims saying: \"We prayed Qiyam with the Messenger of Allah (ﷺ) during Ramadan on the night of the twenty-third until one-third of the night had passed, then we prayed Qiyam with him on the night of the twenty-fifth until one-half of the night had passed, then we prayed Qiyam with him on the night of the twenty-seventh until we thought that we would miss Al-Falah- that is what they used to call suhur",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "It was narrated that Abu Hurairah said:The Messenger of Allah (ﷺ) said: 'When any one of you goes to sleep, the Shaitan ties three knots on his head, saying each time: \"(Sleep) a long night.\" If he wakes up and remembers Allah (SWT), one knot is undone. If he performs wudu', another knot is undone. If he prays, all the knots are undone and he starts his day in a good mood and feeling energetic. Otherwise he starts his day in a bad mood and feeling lethargic",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "It was narrated that Abdullah said:\"Mention was made in the presence of the Messenger of Allah (ﷺ) about a man who slept all night until morning. He said: 'That is a man in whose ear the Shaitan has urinated",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "It was narrated that Abdullah said:\"A man said: 'O Messenger of Allah (ﷺ). So-and-so slept and missed the prayer yesterday until morning came.' He said: 'The Shaitan has urinated in that one's ears",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'May Allah (SWT) have mercy on a man who gets up at night and prays, then he wakes his wife and she prays, and if she refuses he sprinkles water in her face. And may Allah (SWT) have mercy on a woman who gets up at night and prays, then she wakes her husband and prays, and if he refuses she sprinkles water in his face",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "It was narrated from 'Ali bin Abi Talib that:The Prophet (ﷺ) came to him and Fatimah at night and said: \"Won't you pray?\" I said: \"O Messenger of Allah (ﷺ), our souls are in the hand of Allah and if He wants to make us get up, He will make us get up.\" The Messenger of Allah (ﷺ) went away when I said that to him. Then as he was leaving I heard him striking his thigh and saying: But, man is ever more quarrelsome than anything",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "It was narrated from Ali bin Husain, from his father, that:Hs grandfather Ali bin Abi Talib said: \"The Messenger of Allah (ﷺ) came in to Fatimah and I, one night and woke us up to pray, then he went back to his house and prayed for part of the night, and he did not hear any movement from us. He came back to us and woke us up, and said: 'Get up and pray.' I sat up, rubbing my eyes, and said: 'By Allah, we will only pray that which has decreed for us; our souls are in the hand of Allah (SWT) and if He wants to make us get up, He will make us get up.' The Messenger of Allah (ﷺ) turned away, striking his hand on his thigh, saying: 'We will only pray that which Allah (SWT) has decreed for us! But man is ever more quarrelsome than anything",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "It was narrated from Humaid bin 'Abdur-Rahman- that is Ibn 'Awf, that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'The best fasting after the month of Ramadan is the month of Allah, Al-Muharram, and the best prayer is prayer at night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "It was narrated from Abu Bishr Ja'far bin Abi Wahshiyyah that:He heard Humaid bin 'Abdur-Rahman say: \"The Messenger of Allah (ﷺ) said: 'The best prayer after the obligatory (fard) prayers is prayer at night and the best fasting after the month of Ramadan is Al-Muharram.'\" Shu'bah bin Al-Hajjaj narrated it in Mursal form",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "It was narrated from Zaid bin Zabyan who attributed it to Abu Dharr that:The Prophet (ﷺ) said: \"There are three whom Allah (SWT) loves: A man who comes to some people and asks (to be given something) for the sake of Allah and not for the sake of their relationship, but they do not give him, so a man stayed behind and gave it to him in secret, and no one knew of his giving except Allah (SWT) and the one to whom he gave it. People who travel all night until sleep becomes dearer to them than anything equated with it, so they lay down their heads (and slept), then a man among them got up and started praying to Me and beseeching Me, reciting My Verses. And a man who was on a campaign and met the enemy and they fled, but he went forward (pursuing them) until he was killed or victory was granted",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "It was narrated that Masruq said:\"I said to 'Aishah: 'Which deed was most beloved to the Messenger of Allah (ﷺ)?' She said: 'That which was done persistently.' I said: 'At what part of the night did he pray Qiyam?' She said: 'When he heard the rooster",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "It was narrated that 'Asim bin Humaid said:\"I asked 'Aishah with what did he- meaning the Prophet (ﷺ)- start Qiyam Al-Lail? She said: 'You have asked me something which no one before you has asked. The Messenger of Allah (ﷺ) used to say the takbir ten times, the tahmid ten times, the tasbih ten times, and the tahlil ten times, and pray for forgiveness ten times, and say: Allahummaghfirli, wahdini, warzuqni wa 'afini. A'udhu billahi min diqil-maqami yawmal-qiyamah (O Allah, forgive me, guide me, grant me provision and good health. I seek refuge with Allah from the difficulty of standing on the Day of Resurrection)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "It was narrated that Rabi'ah bin Ka'b Al-Aslami said:\"I used to stay overnight at the Prophet's (ﷺ) apartment and I used to hear him when he prayed Qiyam at night saying: 'Subhan Allahi Rabil-Alamin (Glory be to Allah, the Lord of the worlds)' for a long time, then he said: 'Subhan Allah wa bi hamdih (Glory and praise be to Allah) for a long time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "It was narrated that Ibn 'Abbas said:\"When the Prophet (ﷺ) got up at night to pray Tahajjud, he said: Allahumma, lakal-hamdu anta nurus-samawati wal-ardi wa man fihinna wa lakal-hamdu anta qayyamus-samawati wal ardi wa man fihinna wa lakal-hamdu, anta haqqun wa wa'duka haqqun wal jannatu haqqun wan-nuru haqqun wan-nabiyyuna haqqun wa Muhammadan haqqun, laka aslant wa 'alaika tawakkaltu wa bika amant. ( O Allah, to You be praise, You are the Light of the heavens and earth and whoever is in them. To You be praise, You are the Sustainer of the Heavens and the earth and whoever is in them. To You be praise, You are the Sovereign of the heavens and earth and whoever is in them. To You be praise; You are True, Your promise is true, Paradise is true, Hell is true, the Hour is true, the Prophets are true and Muhammad is true. To You have I submitted, in You I put my trust and in You I have believed.'\" Then (one of the narrators) Qutaibah mentioned some words the meaning of which was: \"Wa bika khasamtu wa ilaika hakamtu, ighfirli ma quadrate wa ma akhkhartu wa ma a'lantu antal-muqaddimu wa antal-mu'khkhir, la ilaha illa anta wa la hawla wa la quwwata illa billah (And with Your help I argue [with my opponents, the non-believers], and I take You as a judge [to judge between us]. Forgive me my past and future sins and those that I commit openly. You are the One who puts [some people] back and bring [others] forward. There is no God but You and there is no power and no strength except with Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "It was narrated from Kuraib that 'Abdullah bin 'Abbas told him:He slept at the house of Maimunah the wife of the Prophet (ﷺ), who was his maternal aunt. He said: \"I laid down across the mattress an the Messenger of Allah (ﷺ) and his wife lay along it. The Prophet (ﷺ) slept until midnight, or a little before or a little after. The Prophet (ﷺ) woke up and began to rub the sleep from his face with his hand. Then he recited the last ten verses of Surah Al Imran. Then he got up and went to a water skin that was hanging up and performed wudu from it, and he performed wudu well, then he stood up and prayed.\" Abdullah bin 'Abbas said: \"I stood up and did what he had done, then I went and stood beside him. The Messenger of Allah (ﷺ) put his right hand on my neck, and took old of my right hand and tweaked it. Then he prayed two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then he prayed witr.Then he lay down until the Mu'adhdhin came to him and he prayed two brief rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "It was narrated from Hudhaifah that:When the Prophet (ﷺ) got up to pray at night, he would brush his teeth with the siwak",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "It was narrated that Hudhaifah said:\"When the Messenger of Allah (ﷺ) got up to pray tahajjud at night, he would brush his teeth with the siwak",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "It was narrated that Hudhaifah said:\"We were commanded to use the siwak when we got up to pray at night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "It was narrated that Shaqiq said:\"We were commanded, when we got up to pray at night, to clean our mouths with the siwak",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "Abu Salamah bin 'Abdur-Rahman said:\"I asked 'Aishah: 'With what did the Prophet (ﷺ) start his prayer?' She said: 'When he got up to pray at night he would start his prayer with the words: Allahumma Rabba Jibril wa Maika'il wa Israfil; Fatirus-samawati wal-ard, 'alim al-ghaybi wash-shahadah, anta tahkumu bayna 'ibadika fima kanu fihi yakhtalifun, Allahumma ihdini limakktulifa fihi min al-haqq innaka tahdi man tasha'ila siratin mustaqim (O Allah, Lord of Jibril, Mika'il and Israfil, Creator of the heavens and the earth, Knower of the unseen and the seen, You judge between Your slaves concerning wherein they differ. O Allah, guide me to the disputed matters of truth for You are the One Who guides to the Straight Path)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "It was narrated that Ibn Shihaab said:\"Humaid bin Abdur-Rahman bin 'Awf told me that a man from among the companions of the Prophet (ﷺ) said: 'I said, when I was on a journey with the Messenger of Allah (ﷺ): By Allah (SWT), I am going to watch the prayer of the Messenger of Allah (ﷺ) and see what he does. When he prayed 'Isha, he lay down for a long time. Then he woke up and looked toward the horizon and said: \"Our Lord! You have not created (all) this without purpose\" until he reached: \"for You never break (Your) Promise.\" Then the Messenger of Allah (ﷺ) reached across his bed and took a siwak from it, then he poured water from a vessel and cleaned his teeth. Then he stood and prayed until I said: He has prayed for as long as he has slept. Then he lay down until I said: He has slept as long as he prayed. Then he woke up and did the same as he had done the first time and said the same as he had said. The Messenger of Allah (ﷺ) did that three times before Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "It was narrated that Anas said:\"Every time we wanted to see the Messenger of Allah (ﷺ) praying at night we saw him, and every time we wanted to see him sleeping, we saw him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "Ya'la bin Mamlak said that he asked Umm Salamah about the prayer of the Messenger of Allah (ﷺ) and she said:\"He used to pray 'Isha, then he would recite tasbih, then after that he would pray whatever Allah (SWT) willed (he should pray) of night prayer. Then he would go and sleep for as long as he had prayed. Then he would get up from sleep and pray for as long as he had slept, and this last prayer of his would continue until dawn",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "It was narrated from Ya'la bin Mamlak that he asked Umm Salamah, the wife of the Prophet (ﷺ) about the recitation and prayer of the Messenger of Allah (ﷺ). She said:\"What do you want to know about his prayer (I.e., you can never match it)? He used to pray, then sleep for as long as he had prayed, then he would pray as long as he had slept, then he would sleep as long as he had prayed, until dawn came.\" Then she described to him his recitation, and she described a clear recitation in which every letter was distinct",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "It was narrated from 'Amr bin Aws that he heard Abdullah bin Amr bin Al-'As say:\"The Messenger of Allah (ﷺ) said: 'The most beloved of fasting to Allah is the fasting of Dawud, peace be upon him. He used to fast one day and not the next. And the most beloved of prayer to Allah (SWT) is the prayer of Dawud. He used to sleep half the night, spend one-third of the night in prayer and sleep for one-sixth of it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "It was narrated from Anas bin Malik that:The Messenger of Allah (ﷺ) said: \"On the night on which I was taken on the Night Journey (Al-Isra') I came to Musa, peace be upon him, at the red dune, and he was standing, praying in his grave",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "It was narrated from Anas that :The Messenger of Allah (ﷺ) said: \"I came to Musa at the red dune and he was standing and praying",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "It was narrated from Anas that:The Prophet (ﷺ) said: \"I passed by the grave of Musa, peace be upon him, and he was praying in his grave",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "It was narrated that Anas bin Malik said:\"The Messenger of Allah (ﷺ) said: 'On the night on which I was taken on the Night Journey, I passed by Musa, peace be upon him, and he was praying in his grave",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "It was narrated from Anas that:On the night on which he was taken on the Night Journey, the Prophet (ﷺ) passed by Musa, peace be upon him, and he was praying in his grave",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "Mu'tamir said:\"I heard my father say: I heard Anas say: 'One of the companions of the Prophet (ﷺ) told me that on the Night Journey, the Prophet (ﷺ) passed by Musa, peace be upon him, and he was praying in his grave",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "It was narrated from Anas, from on of the companions of the Prophet (ﷺ), that:The Prophet (ﷺ) said: 'On the night on which I was taken on the Night Journey, I passed by Musa and he was praying in his grave",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "It was narrated from 'Abdullah bin Khabbab bin Al-Aratt, from his father who had been present at Badr with the Messenger of Allah (ﷺ), that:He watched the Messenger of Allah (ﷺ) one night when he prayed all night until Fajr time. When the Messenger of Allah (ﷺ) said the taslim at the end of his prayer, Khabbab said to him: 'May my father and mother be ransomed for you O Messenger of Allah, last night you offered a prayer the like of which I have never seen you offer.\" The Messenger of Allah (ﷺ) said: \"Yes indeed. This is a prayer of hope and fear in which I asked my Lord, the Mighty and Sublime, for three things, of which He gave me two and did not grant me one. I asked my Lord not to destroy us with which he destroyed the nations before us, and He granted me that. And I asked my Lord not to let an enemy from without prevail over us, and He granted me that. And I asked my Lord not to divide us into warring factions and He did not grant me that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "It was narrated that Masruq said:\"Aishah may Allah (SWT) be pleased with her, said: ' When the last ten nights of Ramadan began, the Messenger of Allah (ﷺ) stayed up at night (for prayer) and he woke his family up and tightened his waist-wrap",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "It was narrated that Abu Ishaq said:\"I came to Al-Aswad bin Yazid, who was a close friend of mine and said: 'O Abu 'Amr, tell me what the Mother of the Believers told you about the prayer of the Messenger of Allah (ﷺ).' He said: 'She said: \"He used to sleep for the first part of the night and stay up for the latter part",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "It was narrated that 'Aishah, may Allah (SWT) be pleased with her, said:\"I do not know that the Messenger of Allah (ﷺ) recited the whole Qur'an in one night, or spent a whole night in worship until dawn, or that he ever fasted an entire month apart from Ramadan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "It was narrated from Aishah that:The Prophet (ﷺ) came in to her and there was a woman with her. He said: \"Who is this?\" She said: \"So-and-so, and she does not sleep.\" And she told him about how she prayed a great deal. He said: \"Stop praising her. You should do what you can, for by Allah (SWT), Allah never gets tired (of giving reward) until you get tired. And the most beloved of religious actions to Him is that in which a person persists",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "It was narrated from Anas bin Malik that:The Messenger of Allah (ﷺ) entered the masjid and saw a rope tied between two pillars. He said: \"What is this?\" They said: \"It is for Zainab when she prays; if she gets tired she holds on to it.\" The Prophet (ﷺ) said: \"Untie it. Let any one of you pray as long as he has energy, and if he gets tired let him sit down",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "It was narrated that Ziyad bin Ilaqah said:\"I heard Al-Mughirah bin Shu'bah say: 'The Prophet (ﷺ) stood (in prayer at night) until his feet swelled up, and it was said to him: Allah has forgiven your past and future sins. He said: \"Should I not be a thankful slave?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) used to pray until he developed fissures in his feet",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) used to pray for a long time at night. If he started to pray standing, he would bow standing and if he started to pray sitting, he would bow sitting",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "It was narrated hat Aishah said:\"The Messenger of Allah (ﷺ) used to pray standing and sitting. If he started to pray standing, he would bow standing and if he started to pray sitting, he would bow sitting",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "It was narrated from Aishah that :The Prophet (ﷺ) used to pray when he was sitting. He would recite while sitting, then when there were thirty or forty verses left, he would stand up and recite while standing, then he bowed and prostrated, then he would do likewise in the second rak'ah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "It was narrated that Aishah said:\"I never saw the Messenger of Allah (ﷺ) pray sitting down until he grew old. Then he would pray sitting down and when there were thirty or forty verses left, he would stand up and recite them, then bow",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "It was narrated that Aishah said:\"The Messenger of Allah (ﷺ) used to recite sitting, and when he wanted to bow he would stand up for as long as it takes a person to recite forty verses",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "It was narrated that Sa'd bin Hisham bin 'Amir said:\" I came to Al-Madinah and entered upon Aishah, may Allah (SWT) be pleased with her. She said: 'Who are you?' I said: 'I am Sa'd bin Hisham bin 'Amir.' She said: 'May Allah have mercy on your father.' I said: 'Tell me about the prayer of the Messenger of Allah (ﷺ).' She said: 'The Messenger of Allah (ﷺ) did such and such.' I said: 'Yes indeed.' She said: 'The Messenger of Allah (ﷺ) used to pray Isha' at night, then he would go to his bed and sleep. In the middle of the night, he would get up to relieve himself and go to his water for purification and perform wudu. Then he went into the Masjid and prayed eight rak'ahs. I think he made the recitation, bowing and prostration equal in length. Then he prayed one rak'ah of witr, then he prayed two rak'ahs sitting down. Then he lay down on his side. Sometimes Bilal would come and tell him that it was time to pray before he napped, and sometimes he napped. And sometimes I was not sure if he had napped or not before he told him that it was time to pray. This is how the Messenger of Allah (ﷺ) used to pray until he grew older and gained weight\"- and she mentioned whatever Allah (SWT) willed about his gaining weight. She said: \"And the Prophet (ﷺ) used to lead the people in praying witr, then he would go to his bed. In the middle of the night, he would get up and go to water for purification, and to relieve himself, then he would perform wudu. Then he would go into the masjid and pray six rak'ahs, and I think he made the recitation, bowing, and prostration equal in length. Then he prayed one rak'ah of witr, then he prayed two rak'ahs sitting down. Then he lay down on his side. Sometimes Bilal would come and tell him that it was time to pray before he napped, and sometimes he napped. And sometimes I was not sure if he had napped or not before he told him that it was time to pray.\" She said: \"And this is how the Messenger of Allah (ﷺ) continued to pray",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "It was narrated that Aishah said:\"The Messenger of Allah (ﷺ) did not refrain from (kissing) my forehead when he was fasting, and he did not die until most of his prayers were offered sitting down.\" Then she said something to the effect that (referred to the prayers) other than the obligatory prayers. \"And the dearest of actions to him was that in which a person persists, even if it is little",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "It was narrated from Al-Aswad, that Umm Salamah said:\"The Messenger of Allah (ﷺ) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "It was narrated from Abu Salamah, that Umm Salamah said:\"The Messenger of Allah (ﷺ) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers, and the dearest of actions to him were those which were done persistently, even if they were few",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "It was narrated from Abu Salamah, that Umm Salamah said:\"By the One in Whose Hand is my soul. The Messenger of Allah (ﷺ) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers, and the dearest of actions to him were those which were done persistently, even if they were few",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "Abu Salamah narrated that Aishah told him:\"The Prophet (ﷺ) did not die until most of his prayers were offered sitting down",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "It was narrated that Abdullah bin Shaqiq said:\"I said to Aishah: 'Did the Messenger of Allah (ﷺ) pray sitting down?' She said: 'Yes, after the people had worn him out",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "It was narrated that Hafsah said:\"I never saw the Messenger of Allah (ﷺ) offer his voluntary prayers sitting down until one year before his death. Then he used to pray sitting down, reciting the surah so slowly that it seemed to be longer than a surah that is longer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "It was narrated that 'Abdullah bin 'Amr said:\"I saw the Prophet (ﷺ) praying sitting down and I said: 'I was told that you said that the prayer of one who is sitting down is worth half of the prayer of the one who is standing up.' He said: 'Yes indeed, but I am not like any one of you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "It was narrated that 'Imran bin Husain said:\"I asked the Prophet (ﷺ) about one who prays sitting down. He said: 'Whoever prays standing up is better, and one who prays sitting down will have half the reward of one who prays standing up. And whoever prays lying down will have half the reward of one who prays sitting down",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "It was narrated that 'Aishah said:\"I saw the Prophet (ﷺ) praying while sitting cross-legged",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "It was narrated that Abdullah bin Abi Qais said:\"I asked Aishah: \"How did the Messenger of Allah (ﷺ) recite at night- did he recite loudly or silently?\" She said: 'He used to do both; sometimes he recited loudly and sometimes he recited silently",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "It was narrated from Kathir bin Murrah that 'Uqbah bin 'Amir told them that:The Messenger of Allah (ﷺ) said: 'The one who recites the Qur'an loudly is like one who gives charity openly, and the one who recites the Qur'an silently is like the one who gives charity in secret",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "It was narrated that Hudhaifah said:\"I prayed with the Prophet (ﷺ) one night. He started to recite Al-Baqarah and I thought, 'he will bow when he reaches one hundred,' but he carried on. I thought, 'he is going to recite the whole surah in one rak'ah,' but he carried on. He started to recite An-Nisa' and recited (the whole surah), then he started to recite Al Imran and recited (the whole surah), reciting slowly. When he reached a verse that spoke of glorifying Allah (SWT), he glorified Him. When he reached a verse that spoke of supplication, he made supplication. When he reached a verse that spoke of seeking refuge with Allah, he sought refuge with Him. Then he bowed and said: 'Subhana Rabbiyal-Azim.(Glory be to my Lord Almighty)', and he bowed for almost as long as he had stood. Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears those who praise Him)', and he stood for almost as long as he had bowed. Then he prostrated and started to say: Subhana Rabbiyal-'Ala (Glory be to my Lord Most High),' and he prostrated for almost as long as he had bowed",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "It was narrated from Hudhaifah that:He prayed with the Messenger of Allah during Ramadan. He bowed and said: \"Subhana Rabbiyal-Azim while bowing, for as long as he had stood. Then he sat down and said: \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me),\" for as long as he had stood. Then he prostrated and said: \"Subhana Rabbiyal-'Ala for as long as he had stood And he prayed no more than four rak'ahs when Bilal came for Al-Ghadah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "It was narrated from Ya'la bin Ata that he heard Ali Al-Azdi (say) that he heard Ibn Umar narrate that:The Prophet (ﷺ) said: \"The prayers of the night and day are two by two",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "It was narrated that Tawus said:\"Ibn Umar said: \"A man asked the Messenger of Allah (ﷺ) about prayer at night. He said: \"Two by two, and if you fear that dawn will come, then one",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "It was narrated from Salim, from his father, that :The Prophet (ﷺ) said: \"Prayers at night are two by two, then if you fear that dawn will come, pray witr with one rak'ah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "It was narrated that Ibn Umar said:\"I heard the Messenger of Allah (ﷺ) on the minbar, when he was asked about prayers at night, say: \"Two by two, then if you fear that dawn will come, pray witr with one rak'ah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "Ibn Umar told them that :A man asked the Messenger of Allah (ﷺ)about prayers at night, and he said: \"Two by two, then if one of you fears that dawn will come, let him pray witr with one",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "It was narrated from Ibn Umar that:The Prophet (ﷺ) said: \"prayers at night are (offered) two by two, then if you fear that dawn will come, pray witr with one",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "It was narrated that Ibn Umar said:\"A man from among the Muslims asked the Messenger of Allah (ﷺ): 'How are prayers at night to be done?' He said: 'prayers at night are (offered) two by two, then if you fear that dawn will come, pray witr with one",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "It was narrated that Abdullah bin Umar said that:A man asked the Messenger of Allah (ﷺ) about prayers at night. The Messenger of Allah (ﷺ) said: \"prayers at night are (offered) two by two, then if you fear that dawn will come, pray witr with one",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "It was narrated that Abdullah bin Umar said:\"A man stood up and said: 'O Messenger of Allah (ﷺ), how are the prayers at night to be done?' The Messenger of Allah (ﷺ) said: 'Prayers at night are (offered) two by two, then if you fear that dawn will come, pray witr with one",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "It was narrated that Ali, may Allah (SWT) be pleased with him, said:\"The Messenger of Allah (ﷺ) said: \"O people of the Qur'an, pray witr, for Allah, the Mighty and Sublime, is Witr (One) and loves Al-Witr (the odd numbered)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "It was narrated that Ali, may Allah (SWT) be pleased with him, said:\"Witr is not essential like the obligatory prayers, but it is the sunnah of the Messenger of Allah (ﷺ)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "It was narrated that Abu Hurairah said:\"My dearest friend advised me (to do) three things: 'To sleep after praying Witr, to fast three days each month, and to pray two rak'ahs of Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "It was narrated that Abu Hurairah said:\"My closest friend advised me to do three things: 'To pray witr at the beginning of the night, to pray two rak'ahs of Fajr and to fast three days of each month",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "It was narrated that Qais bin Talq said:\"My father, Talq bin 'Ali visited me one day in Ramadan and stayed with us until the evening. He led us in praying Qiyam that night and prayed witr with us. Then he went down to a masjid and led his companions in prayer until only witr was left. Then he told a man to go forward and said to him: 'Lead them in praying witr, for I heard the Messenger of Allah (ﷺ) say: There should not be two witrs in one night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "It was narrated that Al-Aswad bin Yazid said:\"I asked 'Aishah about the prayer of the Messenger of Allah (ﷺ). She said: 'He used to sleep during the first part of the night, then get up during the time before dawn and pray witr. Then he would go to his bed and if he needed to be intimate he would go to his wife. Then when he heard the Adhan he would get up, and if he was junub he would pour water over himself, otherwise he would perform wudu, then he would go out to the prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "It was narrated that Aishah said:\"The Messenger of Allah (ﷺ) prayed witr at the beginning (of the night) and at the end, and in the middle. And toward the end of his life, he settled on performing witr at the end of the night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "It was narrated that Ibn 'Umar said:\"Whoever prays during the night, let him make the last of his prayers at night witr, because the Messenger of Allah (ﷺ) used to enjoin that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "Abu Nadrah Al-'Awaqi narrated that he heard Abu Sa'eed Al-Khudri say:\"The Messenger of Allah (ﷺ) was asked about witr and he said: 'Pray witr before dawn (Subh)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "It was narrated from Au Sa'eed that :The Prophet (ﷺ) said: \"Pray witr before dawn(fajr)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "It was narrated from Ibrahim bin Muhammad Al-Muntashir, from his father, that:He was in the masjid of 'Amr bin Shurahbil and the iqamah for prayer was said, and they were waiting. He came and said: \"I was praying witr.\" Abdullah was asked: \"Is there any witr after the adhan?\" He said: \"Yes, and after the Iqamah.\" And he narrated that the Prophet (ﷺ) once slept and missed the prayer until the sun had risen, then he prayed",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "It was narrated from Ibn Umar that:The Messenger of Allah (ﷺ) used to pray witr on his mount",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": 1687,
			"text": "It was narrated from Nafi' that :Ibn Umar used to pray witr on his camel and he mentioned that the Prophet (ﷺ) used to do that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "It was narrated that Sa'eed bin Yasir said:\"Ibn Umar said to me that the Messenger of Allah (ﷺ) used to pray witr on a camel",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "It was narrated fom Ibn Umar that:The Prophet (ﷺ) said: \"Witr is one rak'ah at the end of the night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "It was narrated from Ibn Umar that:The Prophet (ﷺ) said: \"Witr is one rak'ah at the end of the night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "It was narrated from Ibn 'Umar that:A man from among the people of the desert asked the Messenger of Allah (ﷺ) about prayer at night. He said:\"(It is) two by two, and Witr is one rak'ah at the end of the night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "It was narrated from 'Abdullah bin 'Umar that:The Messenger of Allah (ﷺ) said: \"Prayer at night is two by two, then when you want to finish, pray one rak'h which will make the total number that you prayed odd",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "It was narrated that Ibn Umar said:\"The Messenger of Allah (ﷺ) said: 'Prayer at night is two by two, and witr is one rak'ah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "It was narrated from Abdullah bin 'Umar that:A man asked the Messenger of Allah (ﷺ) about prayer at night and the Messenger of Allah (ﷺ) said: \"Prayer at night is two by two, then if one of you fears that dawn will break, pray one rak'ah to make the total number that he prayed odd",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": 1695,
			"text": "It was narrated from Ibn 'Umar that:He heard the Messenger of Allah (ﷺ) say: \"Prayer at night is two rak'ahs by two rak'ahs, then when you fear tat dawn will break, pray witr with one rak'ah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "It was narrated from 'Aishah that:The Prophet (ﷺ) used to pray eleven rak'ahs at night, ending them with one rak'ah of witr, then he would lie down on his right side",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "It was narrated from Abu Salamah bin Abdur-Rahman that :He asked Aishah, the Mother of the Believers, about how the Messenger of Allah (ﷺ) used to pray in Ramadan. She said: \"The Messenger of Allah (ﷺ) did not pray more than eleven rak'ahs during Ramadan or at any other time. He would pray four, and do not ask how beautiful or how long they were. Then he would pray four, and do not ask how beautiful or how long they were. Then he would pray three.\" Aishah said: \"I said: 'O Messenger of Allah, do you sleep before you pray witr?' He said: 'O Aishah, my eyes sleep but my heart does not",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "It was narrated from Sa'd bin Hisham, that:Aishah told him: \"The Messenger of Allah (ﷺ) would not say the taslim for two rak'ahs during witr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "It was narrated from Ubayy bin Ka'b that:The Messenger of Allah (ﷺ) used to pray witr with three rak'ahs. In the first he would recite: \"Glorify the Name of Your Lord, the Most High\" in the second: \"Say: O you disbelievers!\", and in the third: \"Say: He is Allah, (the) One\". And he would say the Qunut before bowing, and when he finished he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating the words the last time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "It was narrated that Ubayy bin Ka'b said:\"In the first rak'ah of witr, the Messenger of Allah (ﷺ) used to recite: \"GLorify the Name of your Lord, the Most High;\" in the second; \"Say: O you disbelievers!\" and in the third; \"Say: He is Allah, (the) One",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": 1701,
			"text": "It was narrated that Ubayy bin Ka'b said:\"The Messenger of Allah (ﷺ) used to recite: \"Glorify the Name of Your Lord, the Most High;\" in witr, in the second rak'ah he would recite: \"Say: O you disbelievers!\"; and in the third \"Say: He is Allah, (the) One\". And he only said the taslim at the end, and he would say- meaning after the taslim: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy)' three times",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": 1702,
			"text": "Zakariyya bin Abi Za'idah narrated from Abu Ishaq, from Sa'id bin Jubair, that Ibn Abbas said:\"The Messenger of Allah (ﷺ) used to pray witr with three rak'ahs. In the first he would recite \"Glorify the Name of Your Lord, the Most High;\" in the second: \"Say: O You disbelievers!\" and in the third: \"Say: He is Allah, (the) One",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": 1703,
			"text": "Zuhair narrated from Abu Ishaq, from Sa'eed bin Jubair, :Ibn Abbas used to pray witr with three (units) with (the Surahs): \"Glorify the Name of Your Lord, the Most High\" (Surah Al-A'la), \"Say: O You disbelievers\" (Surah Al-Kafirun), and \"Say: He is Allah, (the) One\" (Surah Al-Ikhlas)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "Sufyan narrated from Habib bin Abi Thabit, from Muhammad bin Ali, from his father, from his grandfather, that:The Prophet (ﷺ) got up at night and cleaned his teeth, then he prayed two rak'ahs, then he slept. Then he got up and cleaned his teeth, then he performed wudu and prayed two rak'ahs, until he had prayed six. Then he prayed witr with three rak'ahs, and prayed two rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": 1705,
			"text": "Husain narrated from Habib bin Abi Thabit, from Muhammad bin 'Ali bin 'Abdullah bin Abbas, from his father, that his grandfather said:\"I was with the Prophet (ﷺ) and he got up and performed wudu, cleaned his teeth while reciting this verse until he finished: 'Verily, in the creation of the heavens and the Earth, and in the alternation of night and day, there are indeed signs for men of understanding.' Then he prayed two rak'ahs, then he went back and slept until I heard him breathing deeply. Then he got up and performed wudu and cleaned his teeth. Then he prayed two rak'ahs, then he slept, then he got up and performed wudu and cleaned his teeth and prayed two rak'ahs and prayed witr with three rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": 1706,
			"text": "Ubaidullah bin'Amr bin Zaid narrated from Habib bin Abi Thabit, from Muhammad bin Ali that Ibn 'Abbas said:\"The Messenger of Allah (ﷺ) woke up and cleaned his teeth,' and he quoted the hadith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": 1707,
			"text": "Abu Bakr An-Nahshali narrated from Habib bin Abi Thabit, from Yahya bin Al-Jazzar, that Ibn 'Abbas said:\"The Messenger of Allah (ﷺ) used to pray eight rak'ahs at night and pray witr with three, and pray two rak'ahs before Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": 1708,
			"text": "It was narrated that Umm Salamah said:\"The Messenger of Allah (ﷺ) used to pray witr with thirteen rak'ahs, and when he grew older and weaker he prayed witr with nine",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": 1709,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) used to pray nine (rak'ahs) at night, then when he grew older and put on weight he prayed seven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": 1710,
			"text": "Duwaid bin Nafi' said:\" Ibn Shihab informed me, saying: 'Ata bin Yazid narrated to me from Abu Ayyub: That the Prophet (ﷺ) said: 'Witr is a duty, and whoever wants to pray witr with seven (rak'ahs), let him do so; whoever wants to pray witr with five, let him do so, whoever wants to pray witr with three, let him do so; and whoever wants to pray witr with one, let him do so",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "Al-Awza'I said:\"Az-Zuhri narrated to me, he said: 'Ata bin Yazid, from Abu Ayyub: The Messenger of Allah (ﷺ) said: 'Witr is a duty, and whoever wants to pray witr with seven (rak'ahs), let him do so; whoever wants to pray witr with five, let him do so, whoever wants to pray witr with three, let him do so; and whoever wants to pray witr with one, let him do so",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "Abu Mu'aid narrated from Az-Zuhri, who said:\"Ata' bin Yazid narrated to me that he heard Abu Ayyub Al-Ansari say: 'Witr is a duty, so whoever wants to pray witr with five rak'ahs let him do so, whoever wants to pray witr with three, let him do so; and whoever wants to pray witr with one, let him do so",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "Sufyan narrated from Az-Zuhri, from 'Ata bin Yazid, from Abu Ayyub, who said:\"Whoever wants to pray witr with seven (rak'ahs) let him do so, and whoever wants to pray witr with five (rak'ahs) let him do so, and whoever wants to pray witr with three rak'ahs, let him do so; and whoever wants to pray witr with one rak'ah, let him do so, and wants to do so gesturing, let him do so",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "Mansur reported from Al-Hakam, from Miqsam, that Umm Salamah said:\"The Messenger of Allah (ﷺ) used to pray witr with five and seven rak'ahs which he did not separate with any taslim nor talk",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "Mansur reported from Al-Hakam, from Miqsam, from Ibn 'Abbas that Umm Salamah said:\"The Messenger of Allah (ﷺ) used to pray witr with seven or five (rak'ahs), not separating between them with the taslim",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "Sufyan bin Al-Husain narrated from Al-Hakam that Miqsam said:\"Witr is seven and no less than five.\" I mentioned that to Ibrahim and he said: \"From whom did he quote that?\" I said: \"I do not know.\" Al-Hakam said: \"Then I performed Hajj and I met Miqsam and said to him: 'From whom (did you narrate that)?' He said: 'From the trustworthy one, from Aishah and from Maimunah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Maqtu"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "Hisham bin Urwah narrated from his father, from Aishah, that:The Prophet (ﷺ) used to pray witr with five and he did not sit except in the last (rak'ah) of them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "Shu'bah narrated from Qatadah, from Zurarahbin Awfa, from Sa'd bin Hisham, that:Aishah said: \"When the Messenger of Allah (ﷺ) grew old and put on weight, he prayed seven rak'ahs and only sat in the last of them, and he prayed two rak'ahs while sitting after saying the taslim, and that was nine, O my son! And when the Messenger of Allah (ﷺ) offered any prayer he liked to persist in doing so",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "Mu'adh bin Hisham said:\"My father narrated to me, from Qatadah, from Zurarah bin Awfa, from Sa'd bin Hisham, that Aishah said: 'When the Messenger of Allah (ﷺ) prayed witr with nine rak'ahs, he did not sit until the eighth rak'ah. Then he would praise Allah (SWT) and remember Him and supplicate, then he would get up and he wouldn't say the taslim, then he prayed the ninth, then he sat and remembered Allah (SWT) and supplicated. Then he said a taslim that we could hear. Then he prayed two rak'ahs sitting down. When he grew older and weaker, he prayed witr with seven rak'ahs and did not sit until the sixth. Then he got up and did not say the taslim, and prayed the seventh, then he said the taslim, then he prayed two rak'ahs sitting down",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "It was narrated from Sa'd bin Hisham that Aishah said:\"We used to prepare siwak and water for wudu for the Messenger of Allah (ﷺ). Allah (SWT) would wake him when He willed to wake him at night, then he would clean his teeth and make wudu, and pray nine rak'ahs, not sitting until the eighth, when he would praise Allah (SWT) and send blessings upon His Prophet and supplicate between them, but he did not say the taslim. Then he prayed the ninth and sat, and said something similar, praising Allah (SWT) and sending blessings upon His Prophet (ﷺ), then he said a taslim that we could hear, then he prayed two rak'ahs sitting down",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "It was narrated from Zurarah bin Awfa:\"When Sa'd bin Hisham bin Amir came to visit us, he told us that he came to Ibn Abbas and asked him about the witr of the Messenger of Allah (ﷺ). He said: 'Shall I not tell you of the most knowledgeable person on Earth about the witr of the Messenger of Allah (ﷺ)?' I said: 'Who?' He said: 'Aishah.' So we went to her and greeted her with Salam and entered and asked her. I said: 'Tell me about the witr of the Messenger of Allah (ﷺ).' She said: 'We used to prepare for him his siwak and water for wudu, then Allah (SWT) would wake him when He willed to wake him at night. He would clean his teeth and perform wudu, then he would pray nine rak'ahs, during which he would not sit until the eighth. Then he would praise Allah (SWT) and remember Him and supplicate, then he would get up and not say the taslim. Then he would pray the ninth, then sit and praise Allah (SWT) and remember Him and supplicate, then he would say a taslim that we could hear. Then he prayed two rak'ahs sitting, and that was eleven rak'ahs, O my son. When the Messenger of Allah (ﷺ) grew older and put on weight, he prayed witr with seven, then he prayed two rak'ahs sitting after saying the taslim, and that was nine, O my son. And when the Messenger of Allah (ﷺ) offered a prayer, he liked to persist in offering it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "It was narrated that Aishah said:\"The Messenger of Allah (ﷺ) used to pray witr with nine rak'ahs, then he would pray two rak'ahs sitting down. When he grew weaker he prayed witr with seven rak'ahs, then he prayed two rak'ahs sitting down",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "It was narrated from Aishah that:The Messenger of Allah (ﷺ) used to pray witr with nine and pray two rak'ahs sitting down",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "It was narrated from Sa'd bin Hisham:That he came to the Mother of the Believers Aishah and asked her about the prayers of the Messenger of Allah (ﷺ). She said: \"He used to pray eight rak'ahs at night and pray witr with the ninth, then he would pray two rak'ahs sitting down",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "It was narrated that Aishah said:\"The Messenger of Allah (ﷺ) used to pray nine rak'ahs at night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "It was narrated from Aishah that:The Prophet (ﷺ) used to pray eleven rak'ahs at night, of which one was witr, then he would lie down on his right side",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "It was narrated that Umm Salamah said:\"The Messenger of Allah (ﷺ) used to pray witr with thirteen rak'ahs, but when he grew older and weaker he prayed witr with nine",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "It was narrated from Abu Mijlaz that:Abu Musa was between Makkah and Al-Madinah. He prayed 'Isha with two rak'ahs, then he stood and prayed one rak'ah of witr in which he recited one hundred verses from An-Nisa'. Then he said: \"I tried my best to place my feet where the Messenger of Allah (ﷺ) placed his, and to recite what the Messenger of Allah (ﷺ) recited",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "Sa'eed bin 'Abdur-Rahman bin Abza narrated from his father, that:Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "Sa'eed bin Abdur-Rahman bin Abza narrated from his father, that:Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "It was narrated from Ibn Abdur-Rahman bin Abza from his father that:The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "Bahz bin Asad, said:\"Shu'bah narrated to us, from Salamah and Zubaid, from Dharr, from Ibn Abdur-Rahman bin Abza from his father that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice the third time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "Khalid said:\"Shu'bah narrated to us, he said: Salamah and Zubaid informed me, from Dharr, from Ibn 'Abdur-Rahman bn Abza from Abdur-Rahman, that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with Subhanal-Malikil-Quddus the third time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "Mansur reported from Salamah bin Kuhail, from Sa'eed bin Abdur-Rahman bin Abza, from his father, who said:\"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating his words the third time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "Abdul-Malik bin Abi Sulaiman reported from Zubaid, from Sa'eed bin Abdur-Rahman bin Abza, from his father, who said:\"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "Muhammad bin Juhadah reported from Zubaid, Sa'eed bin 'Abdur-Rahman bin Abza, from his father, who said:\"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he had finished praying, he said: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "Shu'aib bin Harb reported from Malik, from Zubaid, from Ibn Abza, from his father, who said:\"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "Ahmad bin Sulaiman informed us, he said:\"Yahya bin Adam narrated to us, he said: \"Malik narrated to us from Zubaid, from Dharr, from Ibn Abza",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "Ata bin As-Sa'ib reported from Sa'eed bin Abdur-Rahman bin Abza from his father:That the Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "Muhammad bin Bashshar informed us, he said:\"Abu Dawud narrated to us from Shu'bah, from Qatadah, who said: I heard 'Azarah narrating from Sa'eed bin 'Abdur-Rahman Ibn Abza, from his father That the Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he had finished praying, he said: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "Ishawq bin Mansur informed us, he said:\"Abu Dawud narrated to us, he said: Shu'ba narrated to us, from Qatadah, from Abdur-Rahman bin Abza, that The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating his words the third time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "Muhammad bin Al-Muthanna informed us, he said \"Muhammad said:Shu'bah narrated to us, he said: I heard Qatadah narrating from Zurarah, from Abdur-Rahman bin Abza, that The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "(With that chain) from Imran bin Husain that:The Prophet (ﷺ) recited in Witr: Glorify the Name of your Lord, the Most High",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "Muhammad bin Al-Muthanna informed us, he said:\"Yahya bin Sa'eed narrated to us from Shu'bah, from Qatadah, from Zurarah, from Imran bin Husain, who said The Messenger of Allah (ﷺ) prayed Zuhr, and a man recited 'Glorify the Name of your Lord, the Most High.' When he finished praying, he said: 'Who recited: 'Glorify the Name of Your Lord, the Most High?' A man said: 'I did.' He said: 'I knew that someone was competing with me in it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "It was narrated that Abu Al-Jawza said:\"Al-Hasan said: \"The Messenger of Allah (ﷺ) taught me some words to say in witr in Qunut: Allahumma ihdini fiman hadayta wa 'afini fiman afayta wa tawallani fiman tawallayta wa barik li fima a'tayta, wa qini sharra ma qadayta, fa innaka taqdi wa la yuqda 'alayk, wa innahu la yadhilluman walayta, tabarakta Rabbana wa at'alayt (O Allah, guide me among those whom You have guided, pardon me among those You have pardoned, turn to me in friendship among those on whom You have turned in friendship, and bless me in what You have bestowed, and save me from the evil of what You have decreed. For verily You decree and none can influence You; and he is not humiliated whom You have befriended. Blessed are You, O Lord, and Exalted)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "It was narrated that Al-Hasan bin Ali said:\"The Messenger of Allah (ﷺ) taught me these words in witr. He said: Say: Allahumma ihdini fiman hadayta wa 'afini fiman afayta wa tawallani fiman tawallayta wa barik li fima a'tayta, wa qini sharra ma qadayta, fa innaka taqdi wa la yuqda 'alayk, wa innahu la yadhilluman walayta, tabarakta Rabbana wa at'alayt. Wa salla Allahu ala al-Nabi Muhammad (O Allah, guide me among those whom You have guided, pardon me among those You have pardoned, turn to me in friendship among those on whom You have turned in friendship, and bless me in what You have bestowed, and save me from the evil of what You have decreed. For verily You decree and none can influence You; and he is not humiliated whom You have befriended. Blessed are You, O Lord, and Exalted. And may Allah (SWT) send salah upon the Prophet Muhammad",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": 1747,
			"text": "It was narrated from Ali bin Abi Talib that:The Prophet (ﷺ) used to say at the end of witr: Allahumma inni audhu bi ridaka min sakhatika wa bi mu'afatika min uqubatika, wa audhu bika minka la uhsi thana'an 'alayka, anta kama athwart ala nafsik ( O Allah, I seek refuge in Your pleasure from Your wrath and in Your forgiveness from Your punishment. And I seek refuge in You from You; I cannot praise You enough; You are as You have praised Yourself)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": 1748,
			"text": "It was narrated that Anas said:\"The Prophet (ﷺ) would not raise his hands in any of his supplications except when praying for rain (Al-Istisqa').\" (One of the narrators) Shu'bah said: \"I said to Thabit: 'Did you hear it from Anas?' He said: 'Subhan Allah!' I said: 'Did you hear it?' He said: 'Subhan Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": 1749,
			"text": "It was narrated that Aishah said:\"The Messenger of Allah (ﷺ) used to pray eleven rak'ahs at night between finishing Isha' prayer and Fajr, apart from the two rak'ahs of Fajr, and he would prostrate for as long as it takes one of you to recite fifty verses",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": 1750,
			"text": "It was narrated from Ibn Abdur-Rahman bin Abza from his father that:The Messenger of Allah (ﷺ) used to recite in witr: \"Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) raising his voice the third time",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": 1751,
			"text": "It was narrated from Sa'eed bin Abdur-Rahman bin Abza that:His father said: \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": 1752,
			"text": "It was narrated from Ibn Abdur-Rahman bin Abza that his father said:\"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": 1753,
			"text": "It was narrated from Sa'eed bin Abdur-Rahman bin Abza that his father said:\"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating the words the third time, then raising it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": 1754,
			"text": "It was narrated from Ibn Abdur-Rahman bin Abza from his father that:The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": 1755,
			"text": "It was narrated from Sa'eed bin Abdur-Rahman bin Abza that:The Prophet (ﷺ) used to recite in witr and he quoted the same hadith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "Abu Salamah bin Abdur-Rahman narrated that :He asked Aishah about the prayer of the Messenger of Allah (ﷺ) at night. She said: \"He used to pray thirteen rak'ahs: nine rak'ahs standing, one of which was witr, and two rak'ahs sitting. When he wanted to bow he would stand up, and bow and prostrate, and he did that after witr. Then when he heard the call for Subh, he stood up and prayed two brief rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "It was narrated from Aishah that:The Prophet (ﷺ) would not omit four rak'ahs before Zuhr and two rak'ahs before Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "It was narrated from Ibrahim bin Muhammad that:He heard his father narrating that he heard Aishah say: \"The Messenger of Allah (ﷺ) would not omit four rak'ahs before Zuhr and two rak'ahs before Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "It was narrated from Aishah that :The Prophet (ﷺ) said: \"The two rak'ahs (before) Fajr are better than this world and everything in it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "It was narrated from Hafsah that:When the call for Subh prayer was given, the Messenger of Allah (ﷺ) would pray two brief rak'ahs before going to the prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "It was narrated that Ibn Umar said:\"Hafsah told me that when dawn glowed, the Prophet (ﷺ) would pray two rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "It was narrated that Aishah said:\"When the Muaddhin fell silent after the Adhan for the beginning of Fajr, he would pray two brief rak'ahs, then he would lie down on his right side",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "It was narrated that Abdullah bin 'Amr said:\"The Messenger of Allah (ﷺ) said to me: 'Do not be like so-and-so; he used to pray Qiyam Al-Lail then he stopped",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "It was narrated that 'Abdullah bin 'Amr said:\"The Messenger of Allah (ﷺ) said to me: 'O Abdullah do not be like so-and-so; he used to pray Qiyam Al-Lail and then he stopped",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "It was narrated from Hafsah that:The Prophet (ﷺ) used to pray the two rak'ahs of Fajr, two brief rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "Ibn 'Umar said:\"Hafsah told me that The Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the call (the Adhan) and the Iqamah for Fajr prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "It was narrated from Ibn 'Umar that Hafsah said:\"The Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the call (the Adhan) and the prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "It was narrated from Abu Salamah and Nafi', from Ibn Umar, from Hafsah that:The Prophet (ﷺ) used to pray two brief rak'ahs between the call (The adhan) and the Iqamah, the two rak'ahs of Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "Ibn Umar narrated that Hafsah had told him that the:Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the adhan and the Iqamah of Subh prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "It was narrated that Ibn 'Umar said:\"Hafsah told me that the Messenger of Allah (ﷺ) used to pray two rak'ahs beore Subh",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": 1771,
			"text": "It was narrated from Ibn 'Umar that Hafsah told him:\"When he was called to Subh prayer, the Messenger of Allah (ﷺ) would do two prostrations before Subh prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "It was narrated from Ibn 'Umar that Hafsah, the Mother of the Believers, :Told him that when the Muaddhin fell silent, Allah's Messenger (ﷺ) would pray two brief rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "It was narrated from 'Abdullah bin Umar that Hafsah, the Mother of the Believers, told him:that when the Muaddhin fell silent following the call to Subh prayer and dawn had broken, he would pray two brief rak'ahs before getting up to pray",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "It was narrated that Abdullah said:\"My sister Hafsah told me that he used to pray two brief rak'ahs before Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": 1775,
			"text": "It was narrated from Abdullah bin Umar, from Hafsah, that:The Messenger of Allah (ﷺ) used to pray two rak'ahs when dawn had broken",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "It was narrated from Ibn Umar that Hafsah said:\"When dawn came, the Messenger of Allah (ﷺ) would not pray anything but two brief rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "It was narrated from Ibn Umar, from Hafsah, that:When the call to Subh prayer was given, the Messenger of Allah (ﷺ) would pray two brief rak'ahs before going to pray",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "Ibn Umar said:\"Hafsah told me that the Messenger of Allah (ﷺ) used to pray two brief rak'ahs before Fajr, and that was after dawn had broken",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "It was narrated from Salim that his father said:\"Hafsah told me that when dawn glowed, the Messenger of Allah (ﷺ) would pray two rak'ahs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "It was narrated from Aishah that:The Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the Adhan and Iqamah for Fajr prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "It was narrated from Abu Salamah that :He asked Aishah about the prayer of the Messenger of Allah (ﷺ) at night. She said: \"He used to pray thirteen rak'ahs. He would pray eight rak'ahs then pray witr, then pray two rak'ahs sitting down. When he wanted to bow he would stand and bow, and he prayed two rak'ahs between the adhan and iqamah of subh prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "It was narrated that Ibn 'Abbas said:\"The Prophet (ﷺ) used to pray two rak'ahs of Fajr when he heard the Adhan and he made them brief",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "It was narrated that Az-Zuhri said:\"As-Sa'ib bin Yazid told me that Shuraih Al-Hadrami was mentioned in the presence of the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) said: \"He does not sleep on the Qur'an",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "It was narrated from Sa'eed bin Jubair, from a man who he thought was good, that :Aishah, may Allah (SWT) be pleased with her, told him that the Messenger of Allah (ﷺ) said: \"There is no man who habitually prays at night, then sleep overwhelms him, but Allah (SWT) will record for him the reward of his prayer, and his sleep is a charity given to him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "It was narrated from Sa'd bin Jubair, from Al-Aswad bin Yazid, that Aishah said:\"The Messenger of Allah (ﷺ) said: 'Whoever has the habit of praying at night but he sleeps and misses it, that is a charity that Allah (SWT) has given to him, and the reward of his prayer will be recorded for him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "It was narrated from Sa'eed bin Jubair, from Aishah, that:The Messenger of Allah (ﷺ) said: and he mentioned something similar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "It was narrated from Abu Ad-Darda' who attributed it to the Prophet (ﷺ):\"Whoever goes to his bed intending to get up and pray qiyam at night, then sleep overwhelms him until morning, will have recorded that which he intended and his sleep is a charity given to him by his Lord, the Mighty and Sublime",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "It was narrated from Sufyan, that 'Abdah said:\"I heard Suwaid bin Ghaflah (narrate it) from Abu Dharr and Abu Ad-Darda",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "It was narrated from Aishah that:When the Messenger of Allah (ﷺ) did not pray at night because he was prevented from doing so by sleep- meaning, sleep overwhelmed him- or by pain, he would pray twelve rak'ahs during the day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "Abdur-Rahman bin Abdul-Qari said:\"I heard Umar bin Al-Khattab say: 'The Messenger of Allah (ﷺ) said: Whoever sleeps and misses his portion (of Qur'an) or part of it, and then reads it between Fajr and Zuhr prayers, it will be recorded for him as if he had read it at night.'\" (Sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "It was narrated from Abdur-Rahman bin Abdul-Qari that:Umar bin Al-Khattab said: \"(The Messenger of Allah (ﷺ) said): \"Whoever sleeps and misses his nightly portion, and reads it between Subh and Zuhr prayers, it is as if he read it at night",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "It was narrated from Abdur-Rahman bin Abdul-Qari that Umar bin Al-Khattab said:\"Whoever misses his nightly portion and recites it from the time when the sun passes its zenith until Zuhr prayer, then he did not miss it, or it is as if he caught up with it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "It was narrated that Humaid bin Abdur-Rahman said:\"Whoever misses his Wird at night, let him recite it during prayer before Zuhr, and that will be equivalent to night prayers",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "It was narrated that Aishah said:\"The Messenger of Allah (ﷺ) said: 'Whoever persists in praying twelve rak'ahs each day and night will enter Paradise: Four before Zuhr and two after, two rak'ahs after Maghrib, two rak'ahs after Isha' and two rak'ahs before Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "It was narrated from Aishah that:The Messenger of Allah (ﷺ) said: \"Whoever persists in praying twelve rak'ahs each day and night, Allah, the Mighty and Sublime, will build for him a house in Paradise: Four before Zuhr and two after Zuhr, two rak'ahs after Maghrib, two rak'ahs after Isha' and two rak'ahs of Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "It was narrated that 'Ata said:\"I was told that Umm Habibah bin Abi Sufyan said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever prays twelve rak'ahs during the day and night, apart from the prescribed prayers, Allah (SWT) will build for him a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "Ibn Juraij said:\"I said to Ata: 'I heard that you pray twelve rak'ahs before Jumu'ah. What did you hear concerning that?' He said: 'I was told that Umm Habibah bin Abi Sufyan said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever prays twelve rak'ahs during the day and night, apart from the prescribed prayers, Allah (SWT), the Mighty and Sublime, will build for him a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "It was narrated from 'Ata from Anbasah bin Abi Sufyan, that Umm Habibah said:\"I heard the Messenger of Allah (ﷺ) say: 'Whoever prays twelve rak'ahs a day, Allah (SWT), the Mighty and Sublime, will build for him a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "It was narrated that Ya'la bin Umayyah said:\"I came to At-Ta'if and entered upon Anbasah bin Abi Sufyan when he was dying. I saw that he was afraid so I said: 'You will be fine.' He said: 'My sister Umm Habibah told me that the Messenger of Allah (ﷺ) said: Whoever prays twelve rak'ahs by day or by night, Allah, the Mighty and Sublime, will build for him a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "It was narrated that Umm Habibah bint Abi Sufyan said:\"Whoever prays twelve rak'ahs in a day and prays before Zuhr, Allah (SWT) will build for him a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "It was narrated from Umm Habibah that:The Messenger of Allah (ﷺ) said: \"Twelve rak'ahs, whoever prays them Allah will build for him a house in Paradise: four rak'ahs before Zuhr and two rak'ahs after Zuhr, two rak'ahs before Asr, two rak'ahs after Maghrib and two rak'ahs before Subh prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "It was narrated that Umm Habibah said:\"The Messenger of Allah (ﷺ) said: 'Whoever prays twelve rak'ahs, Allah (SWT) will build for him a house in paradise: four before Zuhr and two after, two before Asr, two after Maghrib, and two before Subh",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "It was narrated that Umm Habibah said:\"Whoever prays twelve rak'ahs during the night and day other than the prescribed prayers, a house will be built for him in Paradise: four before Zuhr and two rak'ahs afterward, two before Asr, two after Maghrib and two before Fajr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "It was narrated from Umm Habibah that:The Prophet (ﷺ) said: \"Whoever prays twelve rak'ahs during the day and night, a house will be built for him in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "It was narrated that Umm Habibah said:\"Whoever prays twelve rak'ahs during the night and day apart from the prescribed prayers, a house will be built for him in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "It was narrated that Umm Habibah said:\"Whoever prays twelve rak'ahs during the night and day apart from the prescribed prayers, Allah (SWT), the Mighty and Sublime, will build for him a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "Anbasah bin Abi Sufyan narrated that:Umm Habibah told him: \"Whoever prays twelve rak'ahs, a house will be built for him in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "It was narrated that Umm Habibah said:\"The Messenger of Allah (ﷺ) said: 'Whoever prays twelve rak'ahs in a day apart from the obligatory prayers, Allah (SWT) will build for him, or there will be built for him, a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "It was narrated from Umm Habibah that:The Messenger of Allah (ﷺ) said: \"Whoever prays twelve rak'ahs a day and night, Allah (SWT) will build for him a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "It was narrated that Umm Habibah said:\"Whoever prays twelve rak'ahs in a day, a house will be built for him in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "It was narrated from Abu Hurairah that:The Prophet (ﷺ) said: \"Whoever prays twelve rak'ahs in a day apart from the obligatory prayers, Allah (SWT) will build for him a house in Paradise",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "It was narrated that Hassan bin 'Atiyyah said:\"When 'Anbasah was dying, he started to groan in pain. The people spoke to him and he said: 'I heard Umm Habibah, the wife of the Prophet (ﷺ) narrating that the Prophet (ﷺ) said: Whoever prays four rak'ahs before Zuhr and four after, Allah, the Mighty and Sublime, will forbid his flesh for the Fire. And I never stopped praying them from the time I heard that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "It was narrated that 'Anbasah bin Abi Sufyan said:\"My sister Umm Habibah, the wife of the Prophet (ﷺ), told me that her beloved Abu Al-Qasim (ﷺ) told her: 'There is no believing slave who prays four rak'ahs after Zuhr whose face will ever be touched by the Fire, if Allah, the Mighty and Sublime, wills",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "It was narrated from Umm Habibah that:The Messenger of Allah (ﷺ) used to say: \"Whoever prays four rak'ahs before Zuhr and four after, Allah, the Mighty and Sublime, will forbid him from the Fire",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "It was narrated from Umm Habibah-and when this was narrated to Sa'eed from Umm Habibah from the Prophet (ﷺ), he would approve it and not deny it but when he narrated it to us, he did not attribute it to the Prophet (ﷺ)- she said:\"Whoever prays four rak'ahs before Zuhr and four after it, Allah (SWT) will forbid him from the Fire",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "Sulaiman bin Musa narrated that:When Muhammad bin Abi Sufyan was dying, he was greatly distressed and said: \"My sister Umm Habibah bint Abi Sufyan said: 'The Messenger of Allah (ﷺ) said: Whoever maintains four rak'ahs before Zuhr and four after, Allah (SWT) will forbid him from the Fire",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "It was narrated from Umm Habibah that:The Prophet (ﷺ) said: \"Whoever prays four rak'ahs before Zuhr and four after, the Fire will not touch him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 220
			}
		}
	]
}