{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"31": "The Book of Presents"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3672,
			"arabicnumber": 3672,
			"text": "It was narrated from An-Nu'man bin Bashir that his father gave him a slave as a present, then he came to the Prophet to ask him to bear witness (to that). He said:\"Have you given a present to all of your children?\" He said: \"No.\" He said: \"Then take it back.\" This wording is that of (one of the narrators) Muhammad",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3673,
			"arabicnumber": 3673,
			"text": "It was narrated from An-Nu'man bin Bashir that his father brought him to the Messenger of Allah and said:\"I have given my son a slave of mine as a present.\" The Messenger of Allah said: \"Have you given a present to all of your children?\" He said: \"No.\" The Messenger of Allah said: \"Then take (your present) back",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "It was narrated from An-Nu'man bin Bashir that his father Bashir bin Sa'd brought An-Nu'man with him and said:\"O Messenger of Allah, I have given this son of mine a slave who belonged to me as a present.\" The Messenger of Allah said: \"Have you given a present to all your children?\" He said: \"No.\" He said: \"Then take (your present) back",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3675,
			"arabicnumber": 3675,
			"text": "It was narrated from Bashir bin Sa'd that he brought An-Nu'man to the Prophet and said:\"I want to give this son of mine a slave as a present, and if you think that I should go ahead with it, I will go ahead.\" The Messenger of Allah said: \"Have you given a present to all your children?\" He said: \"No.\" He said: \"Then take (your present) back",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3676,
			"arabicnumber": 3676,
			"text": "It was narrated from An-Nu'man bin Bashir that his father gave him a present, and his mother said:\"Ask the Prophet to bear witness to what you have given to my son.\" So he came to the Prophet and told him about that, and the Prophet did not want to bear witness to it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3677,
			"arabicnumber": 3677,
			"text": "It was narrated from Bashir that he gave his son a slave as a present, then he came to the Prophet and he wanted the Prophet to bear witness to that. He said:\"Have you given a similar present to all of your children?\" He said: \"No.\" He said: \"Then take (your present) back",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3678,
			"arabicnumber": 3678,
			"text": "It was narrated from Hisham bin 'Urwah, from his father, that Bashir came to the Prophet and said:\"O Prophet of Allah, I have given An-Nu'man a present.\" He said: \"Have you given something to his brothers?\" He said: \"No.\" He said: \"Then take it back",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3679,
			"arabicnumber": 3679,
			"text": "It was narrated that An-Nu'man said that his father took him to the Prophet and said:\"Bear witness that I have given An-Nu'man such and such of my wealth as a gift.\" He said: \"Have you given all your children a present like that which you have given to An-Nu'man?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3680,
			"arabicnumber": 3680,
			"text": "It was narrated from An-Nu'man that his father brought him to the Prophet to bear witness to a present that he gave to him. He said:\"Have you given all your children a present like that which you have given to him?\" He said: \"No.\" He said: \"I will not bear witness to anything. Will it not please you if they were all to treat you with equal respect?\" He said: \"Of course.\" He said: \"Then no (I will not do it)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3681,
			"arabicnumber": 3681,
			"text": "An-Nu'man bin Bashir Al-Ansari narrated that his mother, the daughter of Rawahah, asked his father to give some of his wealth to her son. He deferred that for a year, then he decided to give it to him. She said:\"I will not be pleased until you ask the Messenger of Allah to bear witness.\" He said: \"O Messenger of Allah, the mother of this boy, the daughter of Rawahah, insisted that I give a gift to him.\" The Messenger of Allah said: \"O Bashir, do you have any other children besides this one?\" He said: \"Yes.\" The Messenger of Allah said: \"Have you given all of them a gift like that which you have given to this son of yours?\" He said: \"No.\" The Messenger of Allah said: \"Then do not ask me to bear witness, for I will not bear witness to unfairness",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3682,
			"arabicnumber": 3682,
			"text": "It was narrated that An-Nu'man said:\"My mother asked my father for a gift and he gave it to me. She said: 'I will not be contented until you ask the Messenger of Allah to bear witness.' So my father took me by the hand, as I was still a boy, and went to the Messenger of Allah. He said: 'O Messenger of Allah, the mother of this boy, the daughter of Rawahah, asked me for a gift, and she wanted me to ask you to bear witness to that.' He said: 'O Bashir, do you have any other child apart from this one?' He said: 'Yes.' He said: 'Have you given him gifts like that which you have given to this one?' He said: 'No.' He said: 'Then do not ask me to bear witness, for I will not bear witness to unfairness",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3683,
			"arabicnumber": 3683,
			"text": "It was narrated that 'Amir said:\"I was told that Bashir bin Sa'd came to the Messenger of Allah and said: 'O Messenger of Allah, my wife 'Amrah bint Rawahah told me to give a gift to her son Nu'man, and she told me to ask you to bear witness to that.' The Prophet said: 'Do you have any other children?' He said: 'Yes.' He said: 'Have you given them something like that which you have given to this one?' He said: 'No.' He said: 'Then do not ask me to bear witness to unfairness",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3684,
			"arabicnumber": 3684,
			"text": "It was narrated from 'Abdullah bin 'Utbah bin Mas'ud that a man came to the Prophet and said:\"I have given a gift to my son, so bear witness.\" He said: \"Do you have any other children?\" He said: \"Yes.\" He said: \"Have you given them something like that which you have given him?\" He said: \"No.\" He said: \"Shall I bear witness to unfairness?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3685,
			"arabicnumber": 3685,
			"text": "An-Nu'man bin Bashir said:\"My father took me to the Prophet to ask him to bear witness to something that he had given to me. He said: 'Do you have any other children?' He said: 'Yes.' He gestured with his hand held horizontally like this, (saying): 'Why don't you treat them all equally?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3686,
			"arabicnumber": 3686,
			"text": "An-Nu'man said, when he was delivering a Khutbah:\"My father took me to the Messenger of Allah to ask him to bear witness to a gift that he had given me. He said: 'Do you have any other children besides him?' He said: 'Yes.' He said: 'Treat them equally",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3687,
			"arabicnumber": 3687,
			"text": "An-Nu'man bin Bashir delivered a Khutbah and said:\"The Messenger of Allah said: 'Treat your children fairly, treat your children fairly",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 16
			}
		}
	]
}