{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"42": "The Book of Hunting and Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4263,
			"arabicnumber": 4263,
			"text": "It was narrated from 'Adiyy bin Hatim that:he asked the Messenger of Allah about hunting. He said: \"When you release your dog, mention the name of Allah over him, and if you catch up with him and he has not killed (the game), then slaughter it and mention the name of Allah over it. If you catch up with him and he has killed (the game) but has not eaten any of it, then eat, for he caught it for you. If you find that the has eaten some of it, then do not eat any of it for he caught it for himself. If there are other dogs with your dog and they have killed (the game) but have not eaten any of it, then do not eat any of it, because you do not know which of them killed it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": 4264,
			"text": "It was narrated that `Adiyy bin Abi Hatim said:\"I asked the Messenger of Allah about hunting with a Mi`rad. He said: 'If you strike (the game) with its sharp point, then eat, but if you strike it with its broad side, then the animal has been killed with a blow.' I asked him about dogs and he said: 'If you release your dog and he catches (the game) but does not eat it, then eat, because his catching it is its slaughter. If you find another dog with your dog and you fear that it caught (the game) with him and killed it, then do not eat, for you said the name of Allah over your dog, but you did not say His name over the other one",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": 4265,
			"text": "It was Narrated from 'Adiyy bin Hatim the he asked the Messenger of Allah :\"I release my trained dog and he catches (game).\" He said: \"If you release the trained dog and you say the name of Allah over him, and he catches (something), then eat.\" I said: \"Even if he kills it?\" He said: shoot with the Mirad.\" He said: \"If it hits (the game) with its sharp point, then eat, but if it hits it with its broad side, then do not eat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": 4266,
			"text": "Abu Tha'labah Al-Khushani said:\"I said: 'O Messenger of Allah, we live in a land where people hunt, and I hunt with my bow and with my trained dog, and with trained dog, and with my dog which ins not trained.' He said: 'whatever you catch with your bow, mention the name of Allah over it and eat. Whatever you catch with the trained dog, mention the name of Allah over it and eat. Whatever you catch with your untrained dog and you reach it while it is still alive, then slaughter it, and eat.\"\"( Sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": 4267,
			"text": "It was narrated that 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, I release my trained dogs and they catch (game) for me; can I eat It? He said: 'When you release your trained dogs and they catch (game) for you, then eat.' I said: 'Even if they kill it.' He said: 'So long as no other dogs have joined them.\" I said: 'I shoot with the Mirad. And they penetrate (the game).' He said 'If they penetrate it, then eat, but if the broad said strikes it, then do not eat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": 4268,
			"text": "It was narrated from 'Adiyy bin Hatim that he asked the Messenger of Allah about hunting and he said:\"If you release your dog and other dogs over with you have not mentioned the name of Allah join him, then do not eat (what they catch), because you do not know which of them killed it (the game)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": 4269,
			"text": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah about dogs and he said: 'If you release your dog and say the name of Allah, then eat, but if you find another dog with your dog then do not eat, for you only said the name of Allah over your dog, not any other",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": 4270,
			"text": "It was narrated from Ash-Sha bi that; \"Adiyy bin Hatim who was neighbor, Dakhilan and Rabitan at An-Nahrain narrated that he asked the Prophet Saying:'I releaser my dog and I find another dog with my dog, and I do not know which of them caught (the game).' He said: 'Do not eat, for your only said the name of Allah over your dog, and not over any other dog",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": 4271,
			"text": "It was narrated from 'Adiyy bin Hatim:A similar report was narrated from 'Adiyy bin Hatim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": 4272,
			"text": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah: 'I release my dog. He said: 'If you release your dog and mention the name of Allah, then eat. But it he has eaten some of it, the do not eats, for the caught it for himself. If you release your dog then you find another dog with it, then do not eat, for you said the name of Allah over your dog, and not over any other",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": 4273,
			"text": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah: 'I release my dog, and I find another dog with mine, and I do not know which mine, and I do not know which of them caught (the game).' He said: 'do not eat it, for you said the name of Allah over your dog, but not over any other",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah about hunting with the Mirad. He said: 'whatever is struck with the sharp edge, eat, and whatever is hit with its broad side, it is an animal killed by a blow. \"\" He said: \"And I asked him about hunting dogs. He said: 'If you release your dog and mention the name of Allah over it, then eat.,' I said: 'Even it he kills it?' He said: 'Even if he kills it?\" He said: 'Even if he kills it. But if he has eaten some of it, then do not eat. And if you find another dog with your dog and he has killed (the game), then do not eat, for you only said the name of Allah over your dog, not over your dog, not over any other",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": 4275,
			"text": "It was narrated from 'Adiyy bin Hatim At-Tai that he asked the Messenger of Allah about hunting. He said:\"If you release your dog and mention the name of Allah over him, and he kills (the game), but does not eat any of it, then eat. But if he has eaten from it, then do not eat, for he caught it for himself, and not for you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": 4276,
			"text": "It was narrated that Az-Zuhri said:\"Ibn As-Sabbaq said: \"Maimunah told me that Jibril, peace be upon him, said to the Messenger of Allah 'We (Angles) do not enter a house in which there is a dog or a picture, The next day the Messenger of Allah commanded that all dogs be killed, even small dogs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": 4277,
			"text": "It was narrated from Ibn 'Umar that:the Messenger of Allah commanded that dogs be killed, except those which were exempted",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": 4278,
			"text": "Salim bin 'Abdullah narrated that his father said:\"I heard the Messenger of Allah raise his voice with the command to kill dogs. All dogs were to be killed except dogs used for hunting or herding livestock",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4279,
			"arabicnumber": 4279,
			"text": "It was narrated from Ibn 'Umar that:The Messenger of Allah commanded that all dogs be killed except dogs used for hunting or herding livestock",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4280,
			"arabicnumber": 4280,
			"text": "It was narrated from 'Abdullah bin Mughaffal that the Messenger of Allah said:\"Were it not that dogs form one of the communities (or nations - of creatures), I would have commanded that they be killed. But kill those that are all black. Any people who keep a dog, except for dogs used for farming, hunting or herding livestock, one Qirat will be deducted from their reward each day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4281,
			"arabicnumber": 4281,
			"text": "It was narrated from 'Ali bin Abi Talib that the Prophet said:\"The angels do not enter a house in which there is a picture, a dog or a person who is Junub",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": 4282,
			"text": "It was narrated that Abu Talhah said:\"The Messenger of Allah said: '; The angels do not enter a house in which there is a dog or a picture",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4283,
			"arabicnumber": 4283,
			"text": "Maimunah, the wife of the Prophet narrated:\"The Messenger of Allah was upset one morning and Maimunah said to him: \"O Messenger of Allah, you look upset today., He said: 'Jibril, peace be upon him, had promised to meet me last night but he did not come, and by Allah, he never failed to keep an appointment,; The day passed, then he thought of a puppy that was beneath a table of ours. He ordered that it be taken out, and then he took some water In his hand and sprinkled it over the place where it had been. That evening, Jibril, peace be upon him, came and met him. The Messenger of Allah said to him: 'You [promised to meet me last night,; He said: 'Yes, but we do not enter a house in which there is a dog or a picture,; the next day the Messenger of Allah Commanded that dogs be killed]",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4284,
			"arabicnumber": 4284,
			"text": "It was narrated that Ibn'Umar said:\"The Messenger of Allah said: 'whoever keeps a dog, two Qirats will be detracted from his reward each day, except a trained hunting dog, or a dog for herding livestock",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4285,
			"arabicnumber": 4285,
			"text": "As-Saib bin Yazid narrated that Surfyan bin Abi Zuhair Ash-Shanai I came to visit them and said:\"The Messenger of Allah said: 'Whoever keeps a dog which he does not need for farming or livestock, one Qirt will be deducted from his (good) deeds each day.' It was said to him: 'did you hear this from the Messenger of Allah He said: 'Yes, by the Lord of this Masjid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4286,
			"arabicnumber": 4286,
			"text": "It was narrated that Ibn 'Umar said:\"The Messenger of Allah said:' whoever keeps a dog except one that is trained for hunting or a dog for herding livestock, two Qirats will be deducted from his reward each day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4287,
			"arabicnumber": 4287,
			"text": "It was narrated from Salim, from his father, that the Messenger of Allah said:\"Whoever keeps a dog. Except a dog for hunting or herding livestock, two Qirats will be deducted from his reward each day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4288,
			"arabicnumber": 4288,
			"text": "It was narrated from 'Abdullah bin Mughaffal that the Prophet said:\"Whoever keeps a dog, except a dog for hunting, herding livestock or farming, one Qurat will be deducted from his reward each day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4289,
			"arabicnumber": 4289,
			"text": "It was narrated from Abu Hurairah that the Messenger of Allah said:\"Whoever keep s dog except a dog for hunting, farming or herding livestock, on e Qurat will be deducted from his good deeds each day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4290,
			"arabicnumber": 4290,
			"text": "It was narrated from Abu Hurairah that the Messenger of Allah said:\"Whoever keeps a dog that is not a dog used for hunting, herding livestock or guarding land, two qirats will be deducted from his reward each day",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4291,
			"arabicnumber": 4291,
			"text": "It was narrated from Salim bin 'Abdullah that his father said:\"The Messenger of Allah said: \"Whoever keeps a dog, except a dog for herding livestock or a dog for hunting, one Qirat will be deducted from his reward each day.\" 'Abdullah said: \"Abu Hurairah said: 'Or a dog for farming",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4292,
			"arabicnumber": 4292,
			"text": "It was narrated from Abu Bakr bin 'Abdur-Rahman bin Al-Harith bin Hisham that her heard Abu Mas ud 'Uqbah say:\"The Messenger of Allah forbade the price of a dog, the gift of a female fornicator and the fees of a fortuneteller.\"( Sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4293,
			"arabicnumber": 4293,
			"text": "Abu Hurairah said:\"The Prophet said: 'The price of a dog, the fees of a fortuneteller and the gift of a female fornicator are not permissible",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4294,
			"arabicnumber": 4294,
			"text": "It was narrated that Waqi bin Khadij said:\"The Messenger of Allah said: 'The worst of earnings arte the gift of a female fornicator, the price of a dog and the earnings of a cupper",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4295,
			"arabicnumber": 4295,
			"text": "It was narrated from Jabir that:the Prophet forbade the price of cats and dogs, except hunting. (Da if) Abu Abdur-Rahman (An-Nasa I) said: The Hadith of Hajjaj from Hammad bin Salamah is not authentic:",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4296,
			"arabicnumber": 4296,
			"text": "It was narrated from 'Arm bin Shu'aib, from his father, from his grandfather, that:a man came to the Prophet and said: \"O Messenger of Allah, I have trained dogs; advise me concerning them.\" He said: \"Whatever your dogs catch for you, eat,\" I side: \"Even if they kill it?\" He said: \"Even if they kill it. \" He said: \"Advise me about my bow. \"He said: \"Whatever your arrow returns to you, eat.\" He said: \"Even if it gets away from you, so long as you do not find the mark of an arrow other than yours on it, or you find that it has gone rotten.\"(Another chain)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4297,
			"arabicnumber": 4297,
			"text": "It was narrated that Rafi bin Khadij said:\"While we were with the Messenger of Allah at Dhul-Hulaifah in Tihamanb, they acquired some camels and sheep (as spoils of war). The Messenger of Allah was among the last of the people, and the first of them hastened to slaughter (the animals) and set up pots (For cooking the meat). The Messenger of Allah came and ordered that the pots be came and ordered that the pots be overturned, then he divided it making ten sheep equivalent to one camel. While they were like that, a camel ran away. The people had only a few horses, so they went after fit and it and it got away from them. A man shot an arrow at it and stopped it. The Messenger of Allah said: 'Some of these animals arte untamed like wild animals, so if one of them goes out of your control, do the same",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4298,
			"arabicnumber": 4298,
			"text": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah about hunting and he said: 'When you shoot your arrow, mention the name of Allah, and if you find that it (the game) has been killed, the eat it, unless you find that it fell into some water, and you do not know whether the water killed it or your arrow",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4299,
			"arabicnumber": 4299,
			"text": "It was narrated from 'Adiyy bin Hatim that he asked the Messenger of Allah about hunting and he said:\"When you release your arrow or your dog, mention the name of Allah, and when your arrow kills (the game), then eat.\" He said: \"What if it gets away from me for a night, O Messenger of Allah?\" He said: \"If you find your arrow and you do not find the mark of anything else, then eat it. But if it falls into the water, do not eat it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4300,
			"arabicnumber": 4300,
			"text": "It was narrated tht 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, we are a people who hunt, and one of us may shoot his arrow but (the game) gets way from him for a night or two. What if he follows its tracks, and finds it dead with his arrow in it?\" He said: \"If you find the arrow in it, and you do not find any sign of predators, and you know that your arrow killed it, then eat it.\" (Sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4301,
			"arabicnumber": 4301,
			"text": "It was narrated from 'Adiyy bin Hatim that the Messenger of Allah said:\"If you see your arrow in it. And you do not see any other mark, and you know that (Your arrow) killed it, then eat it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4302,
			"arabicnumber": 4302,
			"text": "it was narrated that 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, I shoot game and I follow its tracks after of night. He said: 'If you find your arrow in it, and no predator has eaten from it, then eat it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4303,
			"arabicnumber": 4303,
			"text": "It was narrated from Abu Tha'labah from the Prophet that:the one who catches up with the game (he shot) after three days may eat from it, unless it has turned rotten",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4304,
			"arabicnumber": 4304,
			"text": "t was narrated that 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, I release my dog and he catches the game, but I cannot find anything with which to slaughter it, so I slaughter it with a sharp-edged stone or a stick.' He said: 'Shed the blood with whatever you want, and mention the name of Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": 4305,
			"text": "t was narrated that 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, I release my trained dogs and they catch (the game) for me - should I eat of it?\" he said: 'If you release your trained dogs, and mention the name of Allah, and they catch it for your, then eat.' I said: 'Even if they kill it?' He said:\" 'Even if they kill it, so long as another, strange dog has not joined them 'I said: 'And I shoot the game with the Mirad and I hit it - should I eat?' He said: ''If you shoot the and it penetrates (the target), then eat, but if it hits it with its broad edge, then do not6 eat it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4306,
			"arabicnumber": 4306,
			"text": "(It was narrated that Ash-Sha bi said:\" I heard 'Adiyy bin Hatim say: 'I asked the Messenger of Allah about the Mirad and he said: \"If the sharp point hits 9the game) then eat, bu",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": 4307,
			"text": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah about hunting with the Mirad and the said: 'If the sharp edge hits (the game), then eat, but if the broad edge of it strikes it, do not eat it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4308,
			"arabicnumber": 4308,
			"text": "It was narrated that 'Adiyy bin Htim said:\"I asked the Messenger of Allah about hunting with Mirad and he said: 'If the sharp edge hits (the game), then eat, but if the broad edge of it strikes it, then it has been killed by a blow",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4309,
			"arabicnumber": 4309,
			"text": "It was narrated from Ibn 'Abbas that the Prophet said:\"Whoever lives in the desert, he becomes hard-hearted, and whoever follows game becomes preoccupied with it (and neglectful toward other duties), and whoever follows the ruler will put himself through trial.\"(Sahih) The wording is of Ibn Al-Muthanna",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4310,
			"arabicnumber": 4310,
			"text": "It was narrated that Abu Hurairah said:\"A Bedouin brought a rabbit to the Messenger of Allah that he had grilled and placed it before him. The messenger of Allah refrained from eating but he told the people to eat. The Bedouin also refrained from eating, and the Messenger of Allah said to him: 'What is keeping you from eating?' He said: 'I fast three days of each month.' He Said: \"If you are going to fast, then fast the bright days (Al-Ghurr)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4311,
			"arabicnumber": 4311,
			"text": "It was narrated that Ibn Al- Hawtakiyyah said:\"Umar, May Allah be pleased with us on the day when we stopped at Al-Qaha?' Abu Dharr said: 'I was. A rabbit was brought to the Messenger Allah and the man who brought it said: I saw it bleeding (menstruating). The Prophet did not eat, then he said: \"Eat.\" A man said: \"I am fasting.\" He said: \"What fast are you observing?\" He said: \"Three days each month\" He said: \"Why don't yo",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4312,
			"arabicnumber": 4312,
			"text": "Anas said:\"We disturbed a rabbit in Marr Az-Zahran so I caught it, and brought it to Abu Talhah who slaughtered it, and sent me with its thighs and haunches to the Prophet and he accepted it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4313,
			"arabicnumber": 4313,
			"text": "It was narrated that Ibn Safwan said:\"I caught two rabbits but I could not find anything with which to slaughter then, so I slaughtered them with a sharp-edged stone. I asked the Prophet about that and he commanded me to eat them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4314,
			"arabicnumber": 4314,
			"text": "It was narrated from Ibn 'Umar that:the Messenger of Allah was asked about mastigures when he was on the Minbar and he said? \"I do not eat them, but I do not say that they are Haram",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4315,
			"arabicnumber": 4315,
			"text": "It was narrated from Ibn 'Umar that a man said:\"O Messenger of Allah what do you think about mastigures?\" He said: \"I do not eat them but I do not say that they arte Haram",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4316,
			"arabicnumber": 4316,
			"text": "It was narrated from Khalid bin Al-Walid that:A grilled mastigure was brought to the Messenger of Allah and was placed near to him. He reached out his hand to eat it, and someone who was present said: \"O Messenger of Allah, it is the meat of a mastigure.\" He withdrew his hand and Khalid bin Al-Walid said to him: \"O Messenger of Allah, is mastigure Haram?\" He said: \"No, but it is not found in the land of my people, and I find it distasteful.\" He said: \"Then Khalid bent over the mastigure and ate some of it, and the Messenger of Allah was looking at him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4317,
			"arabicnumber": 4317,
			"text": "It was narrated from Ibn ' Abbas that:Khalid bin Al-Walid said that he entered upon Maimunah bint Al-Harith, who was his maternal aunt, with the Messenger of Allah, and some meat of a mastigure was offered to the Messenger of Allah The Messenger of Allah would not eat anything until he knew what it was. One of the women said: \"Why don't you tell the Messenger of Allah what he is eating?\" So she told him that it was the meat of a mastigure, and he stopped eating. Khalid said: \"I asked the Messenger of Allah 'Is it Haram?' He said: \"No but it is a food that is no",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": 4318,
			"text": "It was narrated that Ibn 'Abbas said:\"My maternal aunt gave some cottage cheese, cooking fat, and mastigures to the Messenger of Allah He ate some of the cottage cheese and cooking fat, and left the mastigures, as he found them distasteful. But they were eaten upon the table-spread of the Messenger of Allah and if they were Haram they would not have been eaten upon the table-spread of the Messenger of Allah and he would not have told others to eat them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4319,
			"arabicnumber": 4319,
			"text": "It was narrated from Ibn 'Abbas that:he was asked about eating mastigures. He said: \"Umm Hufaid gave some cooking fat, cottage cheese, and mastigures to the Messenger of Allah and the ate some of the cooking fat and cottage cheese, but he did not eat the mastigures because he found them distasteful. If they were Haram they would not have been eaten at the table-spread of the Messenger of Allah and the would not have told others to eat them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4320,
			"arabicnumber": 4320,
			"text": "It was narrated that Thabit bin Yazid Al-Ansari said:\"We were with the Prophet on a journey. We stopped to camp and the people caught some mastigures. I took a mastigure and grilled it, and brought it to the Prophet. He took a palm stalk, and started counting his fingers with it, and said: 'A nation from among the children of Israel was turned into beasts of the Earth, and I do not know what kind of animals they were, I said: 'O Messenger of Allah, the people have eaten some of them.' He did not tell them to eat it, and he did not forbid them from eating it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4321,
			"arabicnumber": 4321,
			"text": "It was narrated that Thabit bin Wadi ah said:\"A man brought a mastigure to the Messenger of Allah and he started looking at it, and turning it over. He said: 'A nation was transformed, it is not known what they did, and I do not know if this is one of them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4322,
			"arabicnumber": 4322,
			"text": "It was narrated from al-Bara bin Azib, from Thabnit bin Wadiah, that:a man brought a mastigure to the Prophet and he said? \"A nation was transformed, and Allah knows best",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "It was narrated that Ibn Abi 'Ammar said:\"I asked Jabir bin 'Abdullah about hyenas and he told me to eat them. I said: 'Are they game (that can be hunted)? He said: 'Yes,' I said: 'Did you hear that from the Messenger of Allah?' He said: 'Yes",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4324,
			"arabicnumber": 4324,
			"text": "It was narrated from Abu Hurairah that the prophet said:'Every predator possessing fangs is forbidden to eat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4325,
			"arabicnumber": 4325,
			"text": "It was narrated from Abu Tha labah Al-Khushani that:the Prophet forbade eating any predator that has fangs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "It was narrated that Abu Tha'labah said:\"The Messenger of Allah said: 'Wealth taken by force is (not permissible), any predator that has fangs is not permissible, and any animal used for target practice is not permissible",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4327,
			"arabicnumber": 4327,
			"text": "It was narrated that Jabir said:\"On the Day of Khaibar, the Messenger of Allah forbade the flesh of donkeys but he permitted the flesh of horses",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4328,
			"arabicnumber": 4328,
			"text": "It was narrated that Jabir said:\"The Messenger of Allah allowed us to eat the flesh of horses but he forbade the flesh of donkeys",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4329,
			"arabicnumber": 4329,
			"text": "It was narrated that Jabir said:\" On the Day of Khaibar, the Messenger of Allah (ﷺ) allowed us to eat the flesh of horses but he forbade us from the flesh of donkeys",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4330,
			"arabicnumber": 4330,
			"text": "It was narrated that Jabir said:\"We used to eat horse meat during the time of the Messenger of Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4331,
			"arabicnumber": 4331,
			"text": "It was narrated from Khalid bin al-walid that he heard the Messe4nger of Allah say:\"It is not permissible to eat the flesh of horses, mules or donkeys",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4332,
			"arabicnumber": 4332,
			"text": "It was narrated from Khalid bin Al-Walid that:the Messenger of Allah forbade eating the flesh of horses, mules and donkeys, and any predator that has fangs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4333,
			"arabicnumber": 4333,
			"text": "It was narrated from 'Ata, that Jabir said:\"we used to eat horseflesh. \": I said: \"And mules?\" He said: \"No",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4334,
			"arabicnumber": 4334,
			"text": "It was narrated from Al- Hasan bin Muhammad, and 'Abdullah bin Muhammad that their father said:\"Ali said to Ibn'Abbas, may Allah be please with them both: The Prophet forbade Mut'ah marriage, and the flesh of domesticated donkeys on the Day of Khaibar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4335,
			"arabicnumber": 4335,
			"text": "It was narrated from Al-Hasan bin Muhammad, and 'Abdullah bin Muhammad, from their father, that 'Ali bin Abi Talib may Allah be please with him, said:\"The Messenger of Allah forbade Mut'ah and the flesh of domesticated donkeys on the Day of Khaibar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "It was narrated from Ibn 'Umar that:the Messenger of Allah forbade (the flesh of) domesticated donkeys on the Day of Khaibar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4337,
			"arabicnumber": 4337,
			"text": "Narrated from Ibn 'Umar:A similar report was narrated from Ibn 'Umar, but he did not mention Khaibar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4338,
			"arabicnumber": 4338,
			"text": "It was narrated that Al-Bara said:\"On the Day of Khaibar, the Messenger of Allah forbade the flesh of domesticated donkeys, cooked or raw",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4339,
			"arabicnumber": 4339,
			"text": "It was narrated that 'Abdullah bin Awfa said:\"On the Day of khaiber we caught some donkeys outside the village and we cooked them. Then the caller of the Prophet called out: 'The Messenger of Allah has forbidden the flesh of donkeys, so turn over your cooking pots with whatever is in them.' So we turned them over",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4340,
			"arabicnumber": 4340,
			"text": "It was narrated that Anas said:\"The Messenger of Allah reached Khaibar in the morning, and they came out to us carrying their shovels. When they saw us they said: 'Muhammad and the army!' And they rushed back inot the fortress. The Messenger of Allah raised his hands, then he said: ' Allahu Akbar, Allahu Akbar, Khaibar is destroyed. Verily, when we descend in field of a people (i.e. near to them), evil will be the morning for those who had been warned! Acquired some donkeys there and we cooked the., Then the caller of the Prophet called out: 'Allah and His Messenger forbid you to eat the flesh of donkeys, for it is an abomination",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": 4341,
			"text": "It was narrated from Abu Tha''Aabah Al-Khushani that:they went on a military campaign with the Messenger of Allah to Khaibar, and the people were starving. They found some domesticated donkeys there, so the people slaughtered some of them. The Prophet was told about that, and he ordered 'Abdur-rahman bin 'Awf to announce to the people: \"The flesh of domesticated donkeys is not permissible for the one who testifies that I am the Messenger of Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4342,
			"arabicnumber": 4342,
			"text": "It was narrated from Abu Tha'labah Al-khushani that:the Messenger of Allah forbade eating any -predator with fangs, and the flesh of domesticated donkeys",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4343,
			"arabicnumber": 4343,
			"text": "It was narrated that Jabir said:\"On the Day of Khaibar we ate the flesh of horses, and onagers, but the Prophet forbade us (from eating) donkeys.\"(sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4344,
			"arabicnumber": 4344,
			"text": "It was narrated that 'Umair bin Salamah Ad-Damri said:\"While we were traveling with the Prophet in part of Athaya Ar-Rawha and they were in Ihram, we saw a wounded onager, the Messenger of Allah said: \"Leave it, for soon the one who wounded it will come,' then a man from Bahz came, and he was the one who had wounded the onager. He said: 'O Messenger of Allah, it is up to you what you do with this onager,' The Messenger of Allah ordered Abu Bakr to distribute it among the people",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4345,
			"arabicnumber": 4345,
			"text": "It was narrated that from Ibn Abi Qatadah, from Abu Qatadah, that:he caught an onager and brought it to his companion's who were in Ihram whereas he was not, and they ate from it. Then they said to one another: \"Let us ask the Messenger of Allah about it,\" So we asked him and he said:\" You did well\" Then he said to us: \"Do you have anything left of it?\" We said: \"Yes.\" He said: \"Give us some \"So we brought him some, and he ate from it, while he was in Ihram",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4346,
			"arabicnumber": 4346,
			"text": "It was narrated from Zahdam that:Some chicken was brought to Abu Musa and a man moved away from the people. He said: \"What is the matter with you?\" He said: \"I saw it eating something that I consider filthy, and I swore I would not eat it.\" Abu Musa said: \"Come and eat, for I saw the Messenger of Allah eating it.\" And he told him to offer an expiation for his vow (Kafarat Al-Yamin)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4347,
			"arabicnumber": 4347,
			"text": "It was narrated that Zahadam Al-Jarmi said:\"We were with Abu Musa and His food was brought, including chicken. Among the people there was a man from banu Taimullah who had reddish complexion, as if he were a freed slave. He did not come close and Abu Musa said: \"Come (and eat) for I saw the Messenger of All eating it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4348,
			"arabicnumber": 4348,
			"text": "It was narrated from Ibn 'Abbas that:on the Day of Khaibar, the Prophet of Allah forbade eating any birds with talons and any predators with fangs. (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4349,
			"arabicnumber": 4349,
			"text": "It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah said:\"There is no person who kills a small bird or anything larger for no just reason, but Allah, the Mighty and Sublime, will ask him about it.\" It was said: \"O Messenger of Allah, what does just reason;' mean?\" Her said: \"That you slaughter it and eat it, and do not cut off its head and throw it aside",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4350,
			"arabicnumber": 4350,
			"text": "It was narrated from Abu Hurairah, that the Prophet (said), concerning the water of the sea:\"Its water is pure (and Purification) and its 'dead meat' is permissible (to eat)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4351,
			"arabicnumber": 4351,
			"text": "It was narrated that Jabir bin 'Abdulah saida:\"The Prophet sent us, a group of three hundred, and we carried our provision on our mounts. Our supplies ran our until each man of us had one date per day.\" It was said to him: \"O Abu'Abdullah , what good is one date for a man?\" he said: \"When we ran out of dates it became very difficult for us. Then we found a whale that had been cast ashore by the sea. And we ate from it for eight days",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4352,
			"arabicnumber": 4352,
			"text": "It was narrated that 'Amr said:\"I heard Jabir say: 'The Messenger of Allah sent us, three hundred riders led by Abu 'Ubaidah bin al-Jarrah, to lie in wait for the caravan of the Quraish. We stayed on the coast and became very hungry, so much so that we ate Khabat. Then the sea cast ashore a beast called (Al-'Anbar), and we ate from it for half a month, and daubed our bodies with its fat, and our health was restored. Abu 'Ubaidah took one it its ribs and looked for the tallest camel and the tallest man in the army, and he passed beneath it. Then they got hungry again and a man slaughtered three camels, then they got hungry and a man slaughtered three camels, then they got hungry and a man slaughtered three camels, then they got hungry and a man slaughtered three camels. Then Abu 'Ubaidah told him not to do that.\" (One of the narrators) Sufyan said: \"Abu Az-Zubair said, narrating from Jabir: \"We asked the Prophet and he said: 'Do you have anything left of it?\"' he said; \"We took out, such-and -such an amount of a fat from its (the whale's) eyes, and four men could fit into its eye socket. Abu 'Ubaidah had a sack of dates and he used to give them out by the handful, then he started to give one date at a time, and when we ran out of dates it became very difficult for us",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4353,
			"arabicnumber": 4353,
			"text": "It was narrated that Jabir said:\"The Prophet sent us with Abu 'Ubaidah on a campaign. Our supplies ran out. Then we passed by a whale that had been cast ashore by the sea. We wanted to eat from it, but Abu 'Ubaidah told us not to. Then he said: 'We are the envoys of the Messenger of Allah for the sake of Allah, so eat. So we ate from it for several days. When we came to the messenger of Allah we told him about that and he said: 'If you have anything left of it then send it to us",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4354,
			"arabicnumber": 4354,
			"text": "(It was narrated that Jabir said:\"The Messenger of Allah sent us with Abu Ubaidah and we numbered over three hundred men. He supplied us with a sack of dates and gave them out by the handful. When he ran short, he gave us one date at a time, until we used to suck on it like an infant, and we would drink water with it. When we ran out of them it became very difficult for us. We used to hit the Khabat leaves with our bows to knock them down) and swallow them, then drink water with it. We became known as Jaish Al-Khabat (the Khabat army). Then, when we were about to turn inland, we saw a beast like a hill, caloled Al-'Anbar. Abu 'Ubaidah said: 'It is dead meat, do not eat it.' Then he said: 'The army of the Messenger of Allah in the cause of Allah, the Mighty and Sublime, and we are forced by necessity; eat in the name of Allah. 'So we arte from it and we made some if it into jerked meat. Thirteen men could sit in its eye-socket. Abu Ubaidah took one of its ribs and seated a man on the biggest camel that the people had, and they passed beneath it. When we came to the Messenger of Allah, he said: 'What kept you so long?' We said: The Quraish' and we told him about the beast. He said: 'That is provision that Allah granted to you. Do you have anything of it with you? \"We said: ' Yes",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4355,
			"arabicnumber": 4355,
			"text": "It was narrated from 'Abdur-Rahman bin 'Uthman that:a physician made mention of the use of frogs in a remedy in the presence of the Messenger of Allah and the Messengher of Allah forbade killing them. (sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4356,
			"arabicnumber": 4356,
			"text": "It was narrated from Abu Ya fur that he heard 'Abdullah bin Abi Awfa says:\"We went on seven campaigns with the Messenger of Allah and we used to eat locusts",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4357,
			"arabicnumber": 4357,
			"text": "It was narrated that Abuy ya fur said:\"I asked 'Abdullah bin Abu Awfa about killing locusts and he said: I went on six campaigns with the Messenger of Allah hand we ate locusts",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4358,
			"arabicnumber": 4358,
			"text": "Was narrated from Abu Hurairah from the Messenger of Allah:\"An ant bit one of the prophets, and he ordered that the ant nest be burned. Then Allah revealed to him: \"One ant bit you, and you destroyed one of the nations that glorify Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4359,
			"arabicnumber": 4359,
			"text": "It was narrated from al-Hasan:\"One of the prophets stopped beneath a tree and an ant bit him, so he gave instructions that their nest be burned with all the ants inside it. Then Allah revealed to him\" 'Why did you not punish just one ant?\" Al-Ash' ath said: \"A similar report was narrated from Ibn Sirin, from Abu Hurairah, from the Prophet, in which were added the words: 'for they glorify Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4360,
			"arabicnumber": 4360,
			"text": "Narrated from Abu Hurairah:A similar report was narrated from Abu Hurairah, but was not attributed to the Prophet",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 98
			}
		}
	]
}