{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"45": "The Book of Oaths (qasamah), Retaliation and Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4706,
			"arabicnumber": 4706,
			"text": "It was narrated that Ibn 'Abbas said:\"The first instance of Qasamah during the Jahiliyyah involved a man from Banu Hashim who was employed by a man from Quraish, from another branch of the tribe. He went out with him, driving his camels and another man from Banu Hashim passed by them. The leather rope of that man's bag broke, so he said (to the hired worker): 'Help me by giving me a rope with which to tie the handle of my bag, lest the camels run away from me. 'So he gave him a rope and he tied his gab with it. When they halted, all the camels' legs were hobbled except one camel. The one who had hired him said: 'Why is his camel, out of all of them, not hobbled? He said: 'There is no rope for it. He said: 'Where is its rope? He said: A man from Banu Hashim passed by and the leather rope of his bag had broken, and he asked me to help him; he said: \"Help me by giving me a rope with which to tie the handle of my bag lest the camels run away from me, so I gave him a rope . \" He struck him with a stick, which led to his death.Then a man from Yemen passed by him (the man from Banu Hashim, (the man from Banu Hashim, just before he died) and he (the Hashimi man) said: 'Are you going to attend the Pilgrimage? He said: 'I do not think I will attend it, but perhaps I will attend it.' He said: 'Will you convey a message from me once in your lifetime? He said: 'Yes. 'He said: 'If you attend the pilgrimage, then call out, O family of Quraish! If they respond, then call out, O family of Hashim! If they respond, then ask for Abu Talib, and tell him that so and so killed me for a rope.' Then the hired worker died. When the one who had hired him cam, Abu Talib went to him and said: 'What happened to our companion? He said: 'He fell sick and I took good care of him, but he died, so I stopped and buried him.' He said: 'He deserved that from you. 'Some time passed, then the Yemeni man who had been asked to convey the message arrived at the time of the pilgrimage. He said: 'O family of Quraish! And they said: 'Here is Quraish.' He said: 'O family of Banu Hashim! They said: 'Here is Banu Hashim.' He said\" 'Where is Abu Talib? He said: 'Here is Abu Talib.' He said: 'so and so asked me to convey a message to you, that so and so killed him for a camel's rope.' Abu Talib went to him and said\" 'Choose one of three alternatives that we are offering you. If you wish, you may give us one hundred camels, because you killed our companion by mistake: or if you wish, fifty of your men may swear an oath that you did not kill him; or if you wish, we will kill you in retaliation. 'He went to his people and told them about that, and they said: 'We will swear the oath.' Then a woman from Banu Hashim, who was married to one of their men and had born him a child, came to Abu Talib and said:' O Abu Talib, I wish that my son, who is one of these fifty men, should be excused from having to take the oath., So the excused him. Then one of the men came to him and said: 'O Abu Talib, you want fifty men to take the oath in lieu of one hundred camels, which means that each man may give two camels instead, so here are two camels; take them from me, and do not make me take the oath.' So he accepted them, and did not make him take the oath. Then forty-eight men came and took the oath.\" Ibn 'Abbas said: \"By the One in Whose hand is my soul, by the time a year has passed, none of those forty-eight men remained alive",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4707,
			"arabicnumber": 4707,
			"text": "Abu Salamah and Sulaiman bin Yasar narrated from one of the Companions of the Messenger of Allah, one of the Ansar, that:the Messenger or Allah approved of Qasamah as it had been during the Jahiliyyah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4708,
			"arabicnumber": 4708,
			"text": "it was narrated from Abu Salamah and Sulaiman bin Yasar, from some of the Companions of the Messenger of Allah, that:Qasamah existed during the Jahiliyyah and the Messenger of Allah approved of it as it had been during the Jahiliyyah, and he ruled accordingly among some of the Ansar concerning a victim whom they claimed the Jews of Khaibar had Killed. (Sahih) Ma'mar contradicted the two of them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4709,
			"arabicnumber": 4709,
			"text": "It was narrated that Ibn Al-Musayyab said:\"Qasamah existed during the Jahiliyyah, then the Messenger of Allah confirmed it in the case of an Ansari who was found slain in the dry well of the jews, and Ansar said: \"The Jews kill our companion",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4710,
			"arabicnumber": 4710,
			"text": "It was narrated from Sahl bin Abi Hathmah that:'Abdullah bin Sahl and Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah and he told him that 'Abdullah bin Sahl had been Killed and thrown into a pit, or a well. He came to the Jews and said: \"By Allah, you killed him. \" They said: \"By Allah, we did not kill him.\"Then he went back to the Messenger of Allah and told him about that. Then he and Huwayysah - his brother who was older than him - and 'Abdur-Rahman bin Sahl, came (to the Prophet). Muhayysah, who was the one who had been at Khaibar, began to speak, but the messenger of Allah said: \"Let the elder speak first,\" So Huwayysah elder speaks first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your comanion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah said to Huwayysah. Muhayysah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the jews swear an oath for you? They said: \"They are not Muslims.\" So the Messenger of Allah paid (the Diyah) himself, and he sent one hundred she-camels to their abodes. Sahl said: \"A red she-camel from among them kicked me",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4711,
			"arabicnumber": 4711,
			"text": "It was narrated from Abu Laila bin 'Abdullah bin 'Abdur-Rahman bin Sahl, from Sahl bin Abi Hathmah, that:he informed him, ans some men among the elders of his people, that \"Abdullah bin Sahl and Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah, and he told him that 'Abdullah bin Sahl had been killed and thrown into a pit or well. He came to the Jews and said: \"By Allah, you killed him.\" They said: \"By Allah, we did not kill him.\" Then he went baack to his people and told them about that. Then he and his brother Huwayysah, who was older than him, and 'Abdur-Rahman bin Sahl, came (to the prophet). Muhayysah, who was the one who had been at Khaibar, bnegan to speak, but the Messenger of Allah said: \"Let the elder speak first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your companion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the Jews swear an oath for you?\" They said: \"They are not Muslims.\" So the Messenger of Allah paid it himself, and he sent one hundred she-camels to their abodes. Sahl said: \"A red she-camel from among them kicked me",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4712,
			"arabicnumber": 4712,
			"text": "It was narrated from Yahya, from Bushair bin Yasa, from Sahl bin Abi Hathmah who said - and I think he said:and from Rafi bin Khadij, the two of them said - :\"Abdullah bin Sahl bin Zaid and Muhayysah bin Mas'ud went out until when they reached Khaibar, they went their separate ways. Then Muhayysah found 'Abdullah bin Sahl slain, so he buried him. Then he came to the Mesenger of Allah, along with Huwayysah bin Mas'ud and 'Abdur-Rahman bin Sahl, who was the youngest of them, 'Abdur-Rahman started to speak before his two companions, but the Messenger of Allah said to him: \"Let the clear speak first.\" So he fell silent and his two companions spoke, then he spoke with them. They told the Messenger of Allah about the killing of 'Abdullah bin Sahl, and he said to them: \"Will you swear fifty oaths, then you will receive compensation, or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness what happened?\" he said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"How can we accept the oath of a disbelieving people?\" When the Messenger of Allah saw that, he paid the blood money (himself)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4713,
			"arabicnumber": 4713,
			"text": "(It was narrated from Sahl bin Ab Hathmah and Rafi bin Khadij that:Muhayysah bin Mas'ud and 'Abdullah bin Sahl went to Khaibar for some need they had there, and they parted among the palm trees. 'Abdullah bin Sahl was killed, and 'Abdullah bin Sahl was killed, and his brother 'Abdur-Rahman bin Shl, and Huwayysah, and Musayysah, his paternal cousins, came to the Messenger of Allah. 'Abdur-Rahan spoke about his brother's case, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So they spoke about their companions, and the Messenger of Allah said: Let fifty of your swear an oath.\" The said: \"O Messenger of Allah, it is something that we did not witness: how can we swear an oath?\" He said: \"Then let the Jews swear fifty oaths to their innocence.\" They said: \"O Messenger of Allah, they area) a disbelieving people,\" So the Messenger of Allah paid the blood money himself Sahl said: \"I entered a Mirbad of theirs, and one of those camels kicked me",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4714,
			"arabicnumber": 4714,
			"text": "It was narrated from Sahi bin Abi Hathmah that:'Abdullah bin SAahi and Nubayysah bin Mas'ud bin Zaid went o Khaibar, and at that time there was peace treaty. They went their separate ways to about their business, then Muhayysah came upon 'Abdullah in Sahl lying dead in a pool of blood. He buried him, then he came to AL-Madinah. 'Abdur-Rahman bin Sahi. Huwayysah, and Muhayysah came to the Messenger of Allah, and 'Abdur-Rehman started to speak, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we swear an oath when we did not witness, and did not see (what happened)?\" He said: \"The n can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4715,
			"arabicnumber": 4715,
			"text": "It was narratd that Sahl bin Abi Hatmah said:\"Abdullah bin Sahl and Muhayysah bin Mas'ud bin Zaid went to Khaibar, and at that time there was a peace treaty. They went their separatea ways to go about their business, then Muhayysah came upon 'Abdullah bin Sahl lying dead in a pool of blood. He buried him, then he camae to Al-Madinah. 'Abdur-Rahman bin Sahl and Huwhayysah, and Muhayysah, the tow sons of Nas'ud, came to the Messenger of Allah, and \"Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first,\" for he was the youngest of them. So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you sear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we a wear and oath when we did not witness and did not see (what happened)\" He said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4716,
			"arabicnumber": 4716,
			"text": "It was narrated from Sahl bin Abi Hathmah that:'Abdullah bin Sahi Al-Anasri and Muhayysah bin Mas'ud went out to Khaibar and went their separate ways to go about their business. 'Abdullah bin Sahl Al-Anasari was killed and Muhayysah. 'Abdur-Rahman, who was the brother of the victim, and Huwayysah, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the prophert said to him: \"Let the elders speak first.\" So Muhayysah and Huwayysah spoke and told him about the case of 'Abdullah bin Sahl. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness (what happened) and we were not there?\" The Messenger of Allah said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself. (One of the narrators) Bushair said: 'One of those camels kicked me in a Mirbad of ours",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4717,
			"arabicnumber": 4717,
			"text": "It was narrated that Sahl bin Abi Hathmah said:\"Abdullah bin Sahl was found slain, and his brother, and two paternal uncles, Huwayysah and Huwayisaah, who were the paternal uncles of 'Abdullah bin Sahl, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first.\" They said: \"O Messenger of Allah, we found 'Abdullah bin Sahl slain in one of the dry wells of Khaibar.\" The prophet said: \"Whom do you suspect? They said: \"We suspect the Jews.\" He said: \"Will you swear fifty oaths saying that the Jews killed him?\" They said: \"How can we swear an oath about something that we did not see?\" He said: \"Then can the Jews swear fifty oaths declaring that they did not kill him?\" They said:\"How can we accept their oaths, when they are Mushrikun?\" So the Messenger of Allah paid the blood money himself. (Sahih) Malik narrated this in Mursal from",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4718,
			"arabicnumber": 4718,
			"text": "It was narrated from Bushair bin Yasar that:'Abdullah bin Sahl Al-Ansari and Muhayysah bin Mas'ud went out to Khaibar, where they went their separate ways to go about their business. 'Abdullah bin Sahl was killed, and Muhayysah came (to Madinah) and went with his brother Huwayysah and 'Abdur-Rahman bin Sahl to the Messenger of Allah. 'Abdur-Rahaman started to speak, because of his position as brother (of the slain man) but the Messenger of Allah said: \"Let the elders speak first.\" So Huyysah and Muhayysah spoken, and told him about what happened to 'Abdullah bin Sahl. The Messenger of Allah said to them: \"Will you sewer fifty oaths, then you will receive compensation or be entitled to retaliate?\" (In his narration) Malik said: \"Yahya said: 'Bushair said that the Messenger of Allah paid the blood money himself, but Sa'eed bin 'Ubaid At-Ta'l disagreed with them (in reporting that)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4719,
			"arabicnumber": 4719,
			"text": "It was narrated from Sa'eed bin 'Ubaid At-Ta'l from Bushair bin Yasar who said:\"A man from among the Ansar who was called Sahl bin Abi Hathmah told him that some of his people went to Khaibar, where they went their separate ways. Then they found one of their numbers slain. They said to those in whose land they found him: 'You killed our companion!' They said: 'We did not kill him and we do not know who killed him.' They went to the prophet of Allah and said: 'O Prophet of Allah, we went to Khaibar and we found one of our number slain.' The Messenger of Allah said: 'Let the elders speak first.' And he said to them: 'Bring proof of the one whom you suspect killed him.' They said: 'We do not have any proof.' He said: \"Then let them swear an oath to you.' They said\" 'We will not accept the oath of the Jews.' The Messenger of Allah did not want his blood to have been shed with no Justice done, so he paid a Diyah of one hundred camels from the Sadaqah.\" 'Amr bin Shu'aib differed with them",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4720,
			"arabicnumber": 4720,
			"text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:the younger son of Muhayysah was found slain one morning at the gate of one morning at the gates of Khaibar. The Messenger of Allah said: \"Bring two witnesses to (say) who killed him, and he will hand him over to you.\" He said: \"O Messenger of Allah, where shall I get two witnesses? He was found slain in the morning at their gates.\" He said: \"Will you swear fifty oaths?\" He said: \"O Messenger of Allah, how can I swear concerning something I do not know?\" The Messenger of Allah said: \"Then will you accept fifty oaths from them?\" He said: \"O Messenger of Allah, how can we accept their oaths when they are Jews?\" So the Messenger of Allah told them (the Jews) to pay the Diyah and he would help them with half",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4721,
			"arabicnumber": 4721,
			"text": "It was narrated from 'Abdullah that the Messenger of Allah said:\"It is not permissible to shed the blood of a Muslim except in one of three cases: A soul for a soul, a adulterer who has been married, and one who separates leaving his religion",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4722,
			"arabicnumber": 4722,
			"text": "It was narrated that Abu Hurairah said:\"A man was killed during the time of the Messenger of Allah, and the Killer was brought to the Prophet. He handed him over to the heir of the victim, but the killer said: 'O Messenger of Allah, by Allah I did not means to kill him.' The Messenger of Allah said to the next of kin: 'If he is telling the truth and you kill him, you will go to the Fire.' So he let him go. He had been tied with a string and he went out dragging his string, so he became known as Dhul-Nis'ah (the one with the string)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4723,
			"arabicnumber": 4723,
			"text": "It was narrated from 'Alqamah binWa'il Al-Hadrami that his farther said:A man who had killed someone was brought to the Messenger of Allah, and he was brought by the heir of the victim. The Messenger of Allah said to him. 'Will you forgive him? He said: No.' He said: 'Will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he went away, he called him back and said: will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah? He said: 'No.' He said: 'will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he had gone he said: If you forgive him, he will carry your sin and the sin of your companion (the victim).\" So he forgave him and let him go.\" He said: \"And I saw him dragging his string",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4724,
			"arabicnumber": 4724,
			"text": "It was narrated that Wa'il said:\"I saw the Messenger of Allah when the heir of a victim brought the killer, leading him by a string. The Messenger of Allah said to the heir of the victim: Will you forgive him?' He said: 'No., He said: 'Will you accept Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said\" 'Take him away (to kill him).' When he took him and turned away, he turned to those who were with him, and called him back, and said to him: 'Will you forgive him?' He said: No.' He said: 'Will you accept Diyah?' He said: No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' Then the Messenger of Allah said: 'If you forgive him, he will carry your sin and the sin of your companion (the victim).' So he forgave him and left him, and I was him dragging his string",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4725,
			"arabicnumber": 4725,
			"text": "A similar report was narrated from 'Alqamah bin Wa'il from his father, from the Prophet. Yahya (one of the narrators) said:\"He is better than him.\" [1]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "It was narrated from 'Alqamah bin Wa'il that his father said:\"I was sitting with the Messenger of Allah when a man came with a string around his neck and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, Killing him. 'The Prophet said: 'Forgive him,' but he refused and said: 'O Prophet of Allah, this man and my brother were digging a whole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused, then he stood up and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused. He (the prophet) said: 'Go, but if you kill him, you will be like him. So he took him out, and they called out to him: Didn't you hear what the Messenger of Allah said?' So he came back and he said: 'If I kill him will I be like him?' He said: 'Yes. Forgive him.' Then he went out, dragging his string, until he disappeared from our view",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4727,
			"arabicnumber": 4727,
			"text": "Alqamah bin Wa'il narrated from his father that he was sitting with the Messenger of Allah when a man came leading another man by a string. He said:\"O Messenger of Allah, this man killed my brother.\" The Messenger of Allah said to him: \"Did you kill him?\" He said: \"O Messenger of Allah even if he did not confess I would have brought proof against him.\" He said: \"Yes, I killed him.\" He said: \"How did you kill him?\" He said: \"He and I were chopping firewood from a tree and he insulted me, so I got angry and struck him with the ax on the forehead.\" The Messenger of Allah said: \"Do you have any wealth with which you can pay the Diyah to save yourself?\" He said: \"O Messenger of Allah, I do not have anything but my ax and my clothes.\" The Messenger of Allah said to him: \"Do you think your people will pay to save you?\" He said: \"I am too insignificant to them for that.\" He threw the string to the man and said: \"Here, thank him.\" When he turned to go, the Messenger of Allah said: \"If he kills him, he will be like him. \"They caught up with the man, and said: \"Woe to you! The Messenger of Allah said: 'If he kills him, he will be like him. \"So he went back to the Messenger of Allah and said: \"O Messenger of Allah, I have been told that you said: 'if he kills him, he will be like him. 'But I only took him because you told me to. He said: 'Don't you want him to carry your sin and the sin of your companion (the victim)?' He said: 'Yes, if that is the case.' He said: 'And that is how it is",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4728,
			"arabicnumber": 4728,
			"text": "It was narrated from Simak bin Harb that 'Alqamah bin Wa'il told him that his father said:\"I was sitting with the Messenger of Allah when a man came leading another\" (and he narrated) a similar report",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4729,
			"arabicnumber": 4729,
			"text": "It was narrated from 'Alqamah bin Wa'il that:his father told them that a man who had killed another man was brought to the Prophet and he handed him over to their of the victim to kill him. Then the Prophet said to those who were sitting with him: \"The killer and the slain will both be in Fire. \"A man went after him and told him that, and when he told him that, he left him (let him go). He (the narrator) said: \"I saw him dragging his string when he let him go. I mentioned that the Habib and he said: 'Sa'eed bin Ashwa' told me that the Prophet commanded the man to forgive him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4730,
			"arabicnumber": 4730,
			"text": "It was narrated from Ans bin Malik that a man brought the killer of his kinsman to the Messenger of Allah and the Prophet said:\"Forgive him.\" But he refused. He said: \"Take the Diyah,\" but he refused. He said: \"Go and kill him then, for you are just like him.\" So he went away, but some people caught up with the man and told him that the Messenger of Allah had said: \"Messenger of Allah had said: \"Kill him for you are just like him.\" So he let him go, and the man passed by me dragging his string",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4731,
			"arabicnumber": 4731,
			"text": "It was narrated from 'Abdullah bin Buraidah, from the father, that a man came to the Prophet and said:\"This man killed my brother.\" He said: \"Go and kill him as he killed your brother.\" The man said to him: \"Fear Allah and let me go, for that will bring you a greater reward and will be better for you and your brother on the Day of Resurrection.\" So he let him go. The Prophet was told about that, so he asked him about it, and he told him what he had said. He said: \"Pardoning him would be better for you than what he would have done for you on the Day of Resurrection when he said: 'O Lord, ask him why he killed me",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4732,
			"arabicnumber": 4732,
			"text": "It was narrated from Simak, from 'Ikrimah, that Ibn 'Abbas said:\"There were (the two tribes of) Quraizah and An-Nadir, and An-Nadir was nobler than Quraiaah. If a man of Quraizah Killed a man of An-Nadir, he would be killed in return, but if a man of An-Nadir killed a man of Quraizah, he would pay a Diyah of one hundred Wasqs of dates. When An-Nadir killed a man of Quraizah, and they said: 'Hand him over to us and we will kill him.' They said: 'Between us and you (as judge) is the Prophet.' So they came to him, then the following was revealed: \"And if you judge, judge with justice between them.\"[3] Al-Qisl (justice) means a soul for a soul. Then the following was revealed: \"Do they then seek the judgment of (the days of) Ignorance?\"[4]",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4733,
			"arabicnumber": 4733,
			"text": "It was narrated from Dawud hin Al-Husain, from 'Ikrimah, from Ibn 'Abbas, that the Verses in AL-Ma'idah, in which Allah, the Mighty and Sublime, says:\"Either judge between them, or turn away from them. If you turn away from then up to: those who act justly.\"[1] - were revealed concerning the matter of blood money between An-Nadir and Quraizah. That was because the slain of An-Nadir were of noble status, so the blood money would be paid in full for them, but for Banu Quraizah only half of the blood money would be paid. They referred the matter to the Messenger of Allah for judgment, then Allah, the Mighty and Sublime, revealed that concerning them, so the Messenger of Allah told them to do the right thing and he made the blood money equal",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4734,
			"arabicnumber": 4734,
			"text": "It was narrated that Qais bin 'Ubad said:\"Al-Ashtar and I went to 'Ali, may Allah be pleased with him, and said: Did the Prophet of Allah tell you anything that he did not tell to all the people?' He said: 'No, except what is in this letter of mine.' He brought out a letter from the sheath of his sword and it said therein: \"The lives of the believers are equal in value, and they are one against others, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his convenant is in effect. Whoever commits an offense then the blame is on himself, and whoever gives sanctuary to an offender, then upon him will be the curse of Allah, the angels and all the people",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4735,
			"arabicnumber": 4735,
			"text": "It was narrated from 'Ali, may Allah be please with him that the Prophet said:\"The lives of the believers are equal in value, and they are one against others, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4736,
			"arabicnumber": 4736,
			"text": "It was narrated from Samurah that the Messenger of Allah said:\"Whoever kills his slave, we will kill him: whoever mutilates (his slave). We will mutilate him, and whoever castrates (his slave), we will castrate him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4737,
			"arabicnumber": 4737,
			"text": "It was narrated from Samurah that the Prophet said:\"Whoever kills his slave, we will kill him, and whoever mutilates his slave, we will mutilate him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4738,
			"arabicnumber": 4738,
			"text": "It was narrated that Samurah said:\"The Prophet said: 'Whoever kills his slave, we will kill him, and whoever mutilates his slave, we will mutilate him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4739,
			"arabicnumber": 4739,
			"text": "Amr bin Dinar narrated that:he heard Tawus narrate from Ibn 'Abbas, from 'Umar, may Allah be pleased with him, that he asked about the ruling of the Messenger of Allah concerning that. Hamal bin Malik stood up and said: \"I was married to two women, and one of them struck the other with a tent pole and killed her and her fetus. The Prophet ruled that a slave be given (as Diyah) for her fetus and that she be killed (for killing the other woman)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4740,
			"arabicnumber": 4740,
			"text": "It was narrated from Anas that:a Jew killed a young girl for her jewelry, so the Messenger of Allah killed him in retaliation for her",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4741,
			"arabicnumber": 4741,
			"text": "It was narrated from Anas bin Malik that:a Jew took some jewelry from a girl, then he crushed her head between two rocks. They found her as she was breathing her last, and they took her around among the people (saying); \"Was it this one? Was it this one?\" (When) she said yes, the Messenger of Allah ordered that his head be crushed between two rocks",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4742,
			"arabicnumber": 4742,
			"text": "It was narrated that Anas bin Malik said:\"A girl went out wearing some jewelry and a Jew caught her, crushed her head between two rocks and took the jewelry that she was wearing. She was found as she was breathing her last, and she was brought to the Messenger of Allah who said: 'Who killed you? Was it so and so?' She gestured no with her head, and he continued asking until he named the Jew, and she gestured yes with her head. He was caught and he confessed (to his crime), then the Messenger of Allah ordered that his head be crushed between two rocks",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4743,
			"arabicnumber": 4743,
			"text": "It was narrated from 'Aishah, the Mother of the Believers, that the Messenger of Allah said:\"It is not permissible to kill a Muslim except in one of three cases: A adulterer who has been married, who is to be stoned; a man who kills a Muslim deliberately; and a man who leaves Islam and wages war against Allah, the Mighty and Sublime, and His Messenger, who is to be killed, crucified or banished from the land",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4744,
			"arabicnumber": 4744,
			"text": "It was narrated that Ash-Sha'bi said:\"I heard Abu Juhaifah say: 'We asked 'Ali: \"Do you have anything from the Messenger of Allah apart from the Qur'an?\" He said: \"No, by the One who splits the seeds and creates the soul, unless Allah gives a slave understanding of His Book, or except this sheet.\" I said: \"What is in the sheet?\" He said: \"In it are (the regulations concerning) blood money and the freeing of captives and (the rule) that no Muslim should be killed for killing a disbeliever",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4745,
			"arabicnumber": 4745,
			"text": "It was narrated that Abi Hassan said:\"Ali said: 'The Messenger of Allah did not tell me anything that he did not tell the people, except what is in a sheet in the sheath of my word.' They did not leave him alone until he brought out the sheet, and in it (were the words): 'The lives of the believers are equal in value, and they hasten to support the asylum granted by the least of them, and they are one against others. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4746,
			"arabicnumber": 4746,
			"text": "It was narrataed from Al-Ashtar that he said to 'Ali:\"What the people have been hearing from you has become widespread. If the Messenger of Allah told you anything, then tell us,\" He said: \"The Messenger of Allah did not tell me anything that he did not tell the people, except that in the sheath of my sword there is a sheet, in which it says: 'The lives of the believers are equal in value, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect.\"' It is an abridgement of it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4747,
			"arabicnumber": 4747,
			"text": "Abu Bakrah said:\"The Messenger of Allah said: 'Whoever kills a Mu'ahad with no justification, Allah will forbid Paradise to him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4748,
			"arabicnumber": 4748,
			"text": "It was narrated that Abu Bakrah said:The Messenger of Allah said: \"Whoever kills a Mu'ahad with no justification, Allah will forbid Paradise to him and he will not even smell its fragrance",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4749,
			"arabicnumber": 4749,
			"text": "It was narrated from Al-Qasim bin Al-Mukhaimirah, from a man among the Companions of the Prophet, that the Prophet said:\"Whoever kills a man from among Ahl Adh-Dhimmah.[2] he will not smell the fragrance of Paradise, and its fragrance may be detected from a distance of seventy years",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4750,
			"arabicnumber": 4750,
			"text": "It was narrated that 'Abdullah bin 'Amr said:\"The Messenger of Allah said: 'Whoever kills a person from among Ahl Adh-Dhimmah, he will not smell the fragrance of Paradise, and its fragrance may be detected from a distance of forty years",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4751,
			"arabicnumber": 4751,
			"text": "It was narrated from 'Imran bin Hussain that:a slave belonging to some poor people cut off the ear of a slave belonging to some rich people. They came to the Prophet but he did not give them anything",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4752,
			"arabicnumber": 4752,
			"text": "It was narrated from Anas that:the Messenger of Allah ruled that Qisas should be given for a tooth. The Messenger of Allah said: \"The Messenger of Allah said: \"What Allah has decreed is retaliation",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4753,
			"arabicnumber": 4753,
			"text": "It was narrated from Samurah that the Messenger of Allah said:\"Whoever kills his slave, we will kill him, and whoever mutilates his slave, we will mutilate him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4754,
			"arabicnumber": 4754,
			"text": "It was narrated from Samurah that the Prophet of Allah said:\"Whoever castrates his slave, we will castrate him, and whoever mutilates his slave, we will mutilate him.\" This is the wording of Ibn Bashshar (one of the narrators)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4755,
			"arabicnumber": 4755,
			"text": "It was narrated from Anas that:the sister of Ar-Rubai' Umm Harithah injured a person and they referred the dispute to the Messenger of Allah. The Messenger of Allah said: \"Retaliation, retaliation (Qisas).\" Umm Ar-Rabi said: 'O Messenger of Allah, how could retaliation be carried out against so and so? No, by Allah, retaliation willnever be carried out against her!' The Messenger of Allah said: \"Subhan Allah, O Umm Ar-Rabi'! decreed by Allah.\" She said: \"No, by Allah, retaliation will never be carried out against her!\" And she carried on until they accepted Diyah (blood money). He (the prophet) said: \"There are among the slaves of Allah who, if they swear by Allah, Allah fulfills their oath",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4756,
			"arabicnumber": 4756,
			"text": "Anas narrated that:his paternal aunt broke the front tooth of a girl and the Prophet of Allah decreed retaliation. Her brother, Anas bin An-Nadr, said: \"Will you break the front tooth of so and so? No, by the One Who sent you with the truth, the front tooth of so and so will not be broken!\" Before that, they had asked her family for forgiveness and blood money. When her brother - who was the paternal uncle of Anas and was martyred at Uhud - swore that oath, the people agreed to forgive. The Prophet said: \"There are among the slaves of Allah who, if they swear by Allah, Allah fulfills their oath",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4757,
			"arabicnumber": 4757,
			"text": "It was narrated that Anas said:\"Ar-Rubai broke the front tooth of a girls, and they asked them (her people) to forgive her, but they refused. They offered them blood money, but they refused. Then they went to the Prophet and he decreed relation. Anas Bin An-Nadr said: \"O Messenger of Allah, will you break the front tooth of Ar-Rubai'? No, by the One Who sent you with the truth, it will not be broken!\" He said: \"O Anas, what Allah has decreed is retaliation.\" But the people agreed to forgive her. He (the Prophet) said: \"There are among the slaves of Allah who, if they swear by Allah, Allah fulfills their oath",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4758,
			"arabicnumber": 4758,
			"text": "It was narrated from 'Imran bin Hussain that:a man bit the hand of another man, who pulled his hand away, and the man's front tooth (or from teeth) fell out. He complained about that to the Messenger of Allah, and the Messenger of Allah said: \"What do you want? Do you want me to tell him to put his hand in your mouth, so that you can bite it like a stallion bites? Or, do you want to give him your hand so that he may bite it, then you can pull it away if you want?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4759,
			"arabicnumber": 4759,
			"text": "It was narrated from 'Imran bin Husain that a man bit another man on the forearm:he pulled it away and a front tooth fell out. The matter was referred to the Messenger of Allah and he canceled (the Diyah) and said: \"Did you want to bite your brother's flesh as a stallion bites?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4760,
			"arabicnumber": 4760,
			"text": "It was narrated that 'Imran bin Husain said:\"Ya'la fought with a man, and one of them bit the other, who pulled his hand away from his mouth, and a front tooth fell out. They referred their dispute to the Messenger of Allah and he said: 'Would one of you bite his brother as a stallion bites? There is no Diyah for that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4761,
			"arabicnumber": 4761,
			"text": "It was narrated from 'Imran bin Husain that:Ya'la said, concerning the one who bit (another), and his front tooth fell out, that the Prophet said: \"There is no Diyah for you.\" (Sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4762,
			"arabicnumber": 4762,
			"text": "It was narrated from 'Imran bin Husain that:a man bit another man in the forearm, and his front tooth fell out, so he went to the Prophet and told him about that. He said: \"Do you want to bite your brother's forearm as a stallion bites?\" And he judged it to be invalid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4763,
			"arabicnumber": 4763,
			"text": "It was narrated from Ya'la bin Munyah that:he fought a man and one of them bit the other, who pulled his forearm away from his mouth, and a front tooth fell out. The matter was referred to the Prophet and he said: \"Would one of you bite his brother as a young camel bites?\" And judged it to be invalid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4764,
			"arabicnumber": 4764,
			"text": "It was narrated from Ya'la bin Munyah that:a man from Banu Tamim fought with another man, and he bit his hand, so he pulled it away and a front tooth fell out. They referred the dispute to the Messenger of Allah, who said: \"Would one of you bite his brother as a young camel bites?\" and he thwarted it, meaning he judged it to be invalid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4765,
			"arabicnumber": 4765,
			"text": "It was narrated from Safwan bin 'Abdullah that his two paternal uncles, Salamah and Ya'la, the sons of Umayyah, said:\"We went out with the Messenger of Allah on the campaign of Tabuk, and there was a friend of ours with us, who fought with a man from among the Muslims. The man bit him on the forearm, so he pulled it away from his mouth and a tooth fell out. The man came to the Prophet, seeking blood money, but his brother and bite him like a stallion bites, then come and demand blood money? There is no blood money for that.\" And the Messenger of Allah juddgedit to be invalid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4766,
			"arabicnumber": 4766,
			"text": "It was narrated from Safwan bin Ya'la, from his father, that:a man bit the hand of another man and his front tooth fell out. He came to the Prophet but he considered it in vain",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4767,
			"arabicnumber": 4767,
			"text": "It was narrated from Ya'la that:he hired a worker who fought with a man and bit his hand, and his from tooth fell out. So he referred the dispute to the Prophet who said: \"Do you want to bite his hand as a stallion bites?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4768,
			"arabicnumber": 4768,
			"text": "It was narrated from Safwan bin Ya'la that his father said:\"I went on the campaign to Tabuk with the Messenger of Allah, and I hired a worker. My hired man fought with another man. The other one bit him, and his front tooth fell out. He went to the Prophet and told him about that, but the Prophet considered it to bin vain",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4769,
			"arabicnumber": 4769,
			"text": "It was narrated that Ya'la bin Umayyah said:\"I went on a campaign with the Messenger of Allah in the Army of Hardship, and this was the deed of which I was most sure. I had a hired man who fought with another person. One of them bit the finger of the other, who pulled his finger away and a front tooth fell out. He went to the Prophet who considered the tooth to be in vain, and said: \"Would he put his hand in your mouth for you to bite it?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4770,
			"arabicnumber": 4770,
			"text": "A similar report to that of the one who bit (another man) and his from tooth fell out was narrated from Ibn Ya'la from his father, in which the Prophet said:\"There is no Diyah for you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4771,
			"arabicnumber": 4771,
			"text": "It was narrated from Safwan bin Ya'la bin Munyah that:a hired man of Ya'la bin Munyah was bitten by another on his forearm and he pulled it away from his mouth. The matter was referred to the Prophet, as his front tooth had fallen out, but the Messenger of Allah considered it an invalid claim, and said: \"No,; should he put (his forearm) in your mouth for you to bite it as a stallion bites?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4772,
			"arabicnumber": 4772,
			"text": "It was narrated from Safwan bin Ya'la that:his father wen on the campaign of Tabuk with the Messenger of Allah, and he hired a man who fought with another man. The man bit his forearm, and when it hurt him, he pulled it away, and the man's front tooth fell out. The matter was referred to the Messenger of Allah who said: \"Would one of you deliberately bit his brother as a stallion bites?\" And he judged it to be invalid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4773,
			"arabicnumber": 4773,
			"text": "It was narrated that Abu Aa'eed Al-Khudri daid:\"While the Messenger of Allah was distributing something, a man came and leaned over him, and the Messenger of Allah hit him with a stick that he had with him. The man went tout, and the Messenger of Allah said: 'Come and ask for retaliation. 'He said: 'No. I ask for retaliation.' He said: 'No, I pardon you, O Messenger of Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4774,
			"arabicnumber": 4774,
			"text": "It was narrated the Abu Sa'eed Al-Khudri said:\"While the Messenger of Allah was distributing something, a man came and leaned over him, and the Messenger of Allah hit him with a stick that head with him. The man shouted, and the Messenger of Allah said: 'Come and ask for retaliation. He said: 'No, I pardon you, O Messenger of Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4775,
			"arabicnumber": 4775,
			"text": "Ibn 'Abbad narrated that:a man slandered one of his forefathers from the time of the Jahiliyyah, and Al-'Abbas slapped him. His people came and said: \"Let him slap him as he slapped him,\" and they prepared for quarrel. News of that reached the Prophet, and he ascended the Minbar and said: \"O People, which of the people of the Earth do you know to be the most noble before Allah?\" They said: \"You.\" He said: \"Al-Abbas belongs to me and I to him. Do not defame our dead or offend our living.\" Those people came and said: \"O Messenger of Allah, we seek refuge with Allah from your anger; pray to give us",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4776,
			"arabicnumber": 4776,
			"text": "It was narrated that Abu Hurairah said:\"We would sit with the Messenger of Allah in the Masjid and when he stood up, we would stand up too, Only day he stood up and we stood up with him, and when he reached the middle of the Masjid, a man caught up with him and pulled roughly on his Rida' (upper-warp) from behind. His Rida 'was of rough material, and that left a red mark on his neck. He said: 'O Muhammad! Load up these two camels of mine, for you are not giving me anything from your wealth or the wealth of your father!' The Messenger of Allah said: 'The Messenger of Allah said: 'No, and I pray for Allah's forgiveness. I will not load anything (onto your camels) untily you let me retaliate for your pulling roughly (on my cloak and leaving a mark on) my neck.' The Bedouin said: 'No, by Allah, I will not let you retaliate., The Messenger of Allah said that three times, and each time the man said: 'No, by Allah, I will not let you retaliate., When we heard what the Bedouin said, we turned toward him quickly. The Messenger of Allah turned to us and said; 'I urge anyone who hears me not to leave his place until give him permission. Then the Messenger of Allah said: 'O so and so, load one of his camels with barley and the other with dates.' Then the Messenger of Allah said: 'Leave",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4777,
			"arabicnumber": 4777,
			"text": "It was narrated from Abu Firas that \"Umar said:\"I saw the Messenger of Allah allowing others to seek retaliation against him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4778,
			"arabicnumber": 4778,
			"text": "It was narrated from 'Aishah that:the Messenger of Allah sent Abu Jahm bin Hudhaifah to collect Zakah and a man argued with him about his Sadaqah, so Abu Jahm struck him. They came to the prophet and he said: \"Diyah, O Messenger of Allah.\" He said: \"You will have such and such,\" but they did not accept it. The Messenger of Allah said: \"You will have such and such,\" and they accepted it. The Messenger of Allah said: \"I am going to address the people and tell them that you accepted it.\" They said: \"Yes.\" So the Prophet addressed (the people) and said: \"Those people came to me seeking compensation, and I offered them such as such, and they accepted.\" They said: \"No.\" The Muhajirun wanted to attack them, but the Messenger of Allah ordered them to refrain, so they refrained. Then he called them and said: \"Do you accept?\" They said:\" Yes.\" He said: \"I and going to address the people and tell them that you accepted it.\" They said: \"Yes.\" So the Prophet addressed (the people), then he said: \"Do you accept?\" They said: \"Yes",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4779,
			"arabicnumber": 4779,
			"text": "It was narrated from Anas, that:a Jew saw some jewelry on a girl, so he killed her with a rock. She was brought to the Prophet as she was breathing her last, and he said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head, to show that she had gestured no. - He said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head to show that she had gestured no. - He said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head to show that she had gestured yes. - So the Messenger of Allah called for him, and killed him with two rocks",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4780,
			"arabicnumber": 4780,
			"text": "It was narrated from Anas that:the Messenger of Allah sent a detachment jof troops to some people of Khath'am, who sought to protect themselves by prostrating (to demonstrate that they were Muslims), but they were killed. The Messenger of Allah ruled that half the Diyah should be paid, and said: \"I am innocent of any Muslim who (lives with) a Mushrik.' Then the Messenger of Allah said: \"Their fires should not be visible to one another",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4781,
			"arabicnumber": 4781,
			"text": "It was narrated that Ibn 'Abbas said:\"There was Qisas among the Children of Israel, but Diyah was unknown among them. Then Allah, the Mighty and Sublime, revealed: \"Al-Qisas (the law of equality in punishment) is prescribed for your in case of murder: the free for the free, the slave for the slave, and the female for the female.\" Up to His saying: \"But if the killer is forgiven by the brother 9or the relatives) of the killed against blood money, then adhering to it with fairness and payment of the blood money to the heir should be made in fairness.\"[2] Forgiveness means accepting the Diyah in the case of deliberate killing. Adhering to it in fairness means asking him to pay the Diyah in a fair manner, and payment in fairness means giving the Diyah in a fair manner. This is and alleviation and a mercy from you Lord,[1] means: This is easier thanthat which was prescribed for those who came before you, which was Qisas and not Diyah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4782,
			"arabicnumber": 4782,
			"text": "It was narrated that Mujahid said:\"Al-Qisas (the Law of Equality in punishment) is prescribed for you in case of murder: the free for the free[2] The rule for the Children of Israel was Qisas, and not Diyah. Then Allah, the Mighty and Sublime, revealed the Diyah to them, and He revealed this ruling to this Ummah as an alleviation of the ruling that applied to the Children of Israel",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4783,
			"arabicnumber": 4783,
			"text": "It was narrated that Anas said:\"A case requiring Qisas was brought to the Messenger of Allah and he enjoined them to pardon",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4784,
			"arabicnumber": 4784,
			"text": "It was narrated that Anas bin Malik said:\"No case requiring Qisas was ever brought to the Messenger of Allah but he would enjoin pardoning",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4785,
			"arabicnumber": 4785,
			"text": "Abu Hurairah said:\"The Messenger of Allah said: 'If a person's relative is killed, he has the choice of two things: Either he may retaliate, or he may take the ransom",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4786,
			"arabicnumber": 4786,
			"text": "Abu Hurairah said:\"The Messenger of Allah said: 'If a person's relative is killed, he has the choice of two things: Either he may retaliate, or he may take the ransom",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4787,
			"arabicnumber": 4787,
			"text": "Abu Salamah narrated that the Messenger of Allah said:\"If a person's relative is killed.\" In Mursal form. (Shah)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4788,
			"arabicnumber": 4788,
			"text": "It was narrated from 'Aishah that the Messenger of Allah said:\"And it is upon those (relatives) of the killed one to block (any punishment) the first (in line) then the first, even if that one is a woman",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4789,
			"arabicnumber": 4789,
			"text": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah said: 'Whoever is killed in the blind or by something thrown, while between them is a rock, a wipe, or a stick, then the blood money of be paid for him is the blood money for accidental killing. Whoever kills deliberately, then retaliation is upon him, and whoever tries to prevent that, upon him is the curse of Allah, the Angels, and all the people, and neither Sarf nor Adl will be accepted from him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4790,
			"arabicnumber": 4790,
			"text": "It was narrated that Ibn 'Abbad, who attributed it to the prophet, said:\"Whoever is killed in the blind or by something thrown, with a rock, a whip, or a stick, then the blood money to be paid for him is the blood money for accidental killing. Whoever kills deliberately, then retaliation is upon him, and whoever tries to prevent that, upon him is the curse of Allah, the Angels and all the people, and Allah will not accept any Sarf nor 'Adl from him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4791,
			"arabicnumber": 4791,
			"text": "It was narrated from Al-Qasim bin Rabi'ah, from 'Abdullah bin 'Amr, the Prophet said:\"The accidental killing, which seems intentional, with a whip or stick, (the Diyah) is one hundred camels, of which forty should be (she-camels) which their young in their wombs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4792,
			"arabicnumber": 4792,
			"text": "It was narrated from Al-Qasim bin Rabi'ah that:the Messenger of Allah delivered a speech on the Day of the Conquest. (And he mentioned it) in Mursal from",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4793,
			"arabicnumber": 4793,
			"text": "It was narrated from Abdullah bin 'Amr that the prophet said:\"Indeed the accidental killing, which seems intentional, with a whip or a stick, (the Diyah) is one hundred camels, of which forty should be (she-camels) with their young in their wombs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4794,
			"arabicnumber": 4794,
			"text": "It was narrated from 'Uqbah bin Aws, that:a man from among the Companions of the Prophet delivered a speech on the Day of the Conquest of Makkah and said: 'Indeed the accidental killing, which seems international, with a whip, a stick, or a rock, (the Diyah) is one hundred camels, of which forty should be pregnant she-camels between the ages of six and nine years old, all in the middle of their pregnancies",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4795,
			"arabicnumber": 4795,
			"text": "It was narrated from 'Uqbah bin 'Aws, that the Mssenger of Allah said:\"Indeed the accidental killing, the killing with a whip or stick, for it (the Diyah) is one hundred camels - a severe penalty - of which forty should be (she-camels) with their young in their wombs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4796,
			"arabicnumber": 4796,
			"text": "It was narrated from Ya'qub bin Aws, from a man among the Companions of the Prophet that:when the Messenger of Allah entered Makkah on the Day of the Conquest, he said: \"Indeed, every accidental killing on purpose, or resembling on purpose - killing with a whip or stick, for it are forty (she-camels) which their young in their wombs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4797,
			"arabicnumber": 4797,
			"text": "It was narrated from Ya'qub bin Aws that:a man from among the Companions of the Prophet told him, that when the Messenger of Allah came to Makkah, in the Year of the Conquest, he said: \"Indeed, accidental killing on purpose, is killing with a whip or stick, for which forty (she-camels) with their young in their wombs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4798,
			"arabicnumber": 4798,
			"text": "It was narrated from Ya'qub bin Aws that:a man from among the Companions of the Prophet narrated to him that the Prophet entered Makkah during the Year of the Conquest, and said: 'Indeed, accidental killing on purpose, is killing with a whip or stick, for which forty (she-camels) with their young in their wombs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4799,
			"arabicnumber": 4799,
			"text": "It was narrated that Ibn 'Umar said:\"The Messenger of Allah stood up on the Day of the Conquest of Makkah, on the steps of Ka'bah. He praised and glorified Allah, then he said: 'Praise be to Allah who has fulfilled His slave and defeated the confederates alone. The one who is killed purposefully by mistake, with a whip or a stick, resembling on purpose, for that (the Diyah) is one hundred camels-a severe penalty-of which forty should be pregnant she-camels with their young in their wombs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4800,
			"arabicnumber": 4800,
			"text": "It was narrated from Al- Qasim bin Rabi'ah that the Messenger jof Allah said:\"The accident that resembles on purpose, meaning (killing) with a stick or a whip, (for which the Diyah is) one hundred camels, of which forty should be (pregnant she-camels), with their young in their wombs",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4801,
			"arabicnumber": 4801,
			"text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah said:\"Whoever is killed by mistake, his ransom is one hundred camels: Thirty Bint Makkah, thirty Bint Labun, thirty Hiqqah and ten Bin Labun. \"[1] The Messenger of Allah used to fix the value (of the Diayah for accidental killing) among town-dwellers at four hundred Dinars or the equivalent value in silver. When he calculated the price in terms of people with camels (for Bedouin), it would vary from one time to another. When prices rose, the value in Dinars would rise, and when prices fell the value in Dinars would fall. At the time of the Messenger of Allah the value was between four hundred and eight hundred Dinars, or the equivalent value in silver, eight thousand Dirhams. And the Messenger of Allah ruled that if a person's blood money was paid in cattle, among those who kept cattle, the amount was two hundred cows; and if a person's blood money was paid in sheep, among this who kept sheep, the value was two thousand sheep. The Messenger of Allah ruled that the blood money is part of the estate, to be divided among the heirs of the victim according to their allotted shares, and whatever is left over is for the 'Asabah. And the Messenger of Allah ruled that if a woman commits urder then he 'Asahah, whoever they may be, must pay the blood money, but they do not inherit anything except that which is left over from her heirs; if a woman is killed then her blood money is to be shared among her heirs, and they may kill her killer. (Hasah)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4802,
			"arabicnumber": 4802,
			"text": "In Mas'ud said:\"The Messenger of Allah ruled that the Diyah for accidental killing is twenty Bint Makhad, twenty Bin Makhad, twenty Bint Labur, twenty Jadh'ah, and twenty Hiqqah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4803,
			"arabicnumber": 4803,
			"text": "It was narrated that Ibn 'Abbas said:\"A man killed another man during the time of the Messenger of Allah, and the Prophet set the Diyah at twelve thousand. And he mentioned His saying: And they could not find any cause to do so except that Allah and His Messenger had enriched them of His Bounty. concerning them taking the Dyah.\" (Hasan) This is the wording of Abu Dawud",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4804,
			"arabicnumber": 4804,
			"text": "It was narrated from Ibn 'Abbas that:the Prophet ruled that twelve thousand (should be given) as Diyah. (Hahan)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4805,
			"arabicnumber": 4805,
			"text": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:\"The Messenger of Allah said: 'The blood money of a woman (in the event of injury) is like the blood money of a man, up to one-third of the Diyah (for her life)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4806,
			"arabicnumber": 4806,
			"text": "It was narrated from 'Amr Bin Shu'aib, from his father, that his grandfather said:\"The Messenger of Allah said: 'The blood money for Ahl Adh-Dhimmah is half that of the blood money for the Muslims, and they are the Jews and Christians",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4807,
			"arabicnumber": 4807,
			"text": "It was narrated from 'Amr bin Shu'aib, from his father, from 'Abdullah bin 'Amr, that the Messenger of Allah said:\"The blood money for a disbeliever is half the blood money for the believer.\" (Hassan)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4808,
			"arabicnumber": 4808,
			"text": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah ruled that the Diyah for a Mukatab who is killed should be (equivalent) to the Diyah for a free mand, proportionate to the amount be had paid off (toward buying his freedom)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4809,
			"arabicnumber": 4809,
			"text": "It was narrated from Ibn 'Abbas that:the Prophet of Allah ruled that the Diyah for a Mukatab should be (equivalent) to the Diyah for a free man, proportionate to the amount he had paid off (toward buying his freedom)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4810,
			"arabicnumber": 4810,
			"text": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah ruled that in the case of a Mukatab, the Diyah should be (equivalent) to the Diyah for a free man, proportionate to the amount he had paid off (towards buying his freedom).\" (Dar'if)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4811,
			"arabicnumber": 4811,
			"text": "It was narrated from Ibn 'Abbas tht the Prophet said:\"The Mukatab is free to the extent that the has paid off (toward buying his freedom); he Hadd punishment should be carried out on him proportionate to the amount he has paid off (toward buying his freedom); and he inherits proportionate to the amount he has paid off (toward buying his freedom)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4812,
			"arabicnumber": 4812,
			"text": "It was narrated from Ibn 'Abbas that:a Mukatab was killed at the time of the Messenger of Allah and he commanded that the Diyah be paid (equivalent) to the Diyah for a free man, (proportionate to the amount he had paid off towards buying his freedom)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4813,
			"arabicnumber": 4813,
			"text": "It was narrated from 'Abdullah bin Buraidah, from his father, that:a woman threw some pebbles and stuck another woman, and she miscarried. The Messenger of Allah stipulated (a Diyah of ) fifty sheep for her child. And on that day, he forbade throwing pebbles",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4814,
			"arabicnumber": 4814,
			"text": "Abdullah bin Buraidah narrated that:a woman threw pebbles at another woman and the woman who was struck miscarried. The matter was referred to the prophet and he set the blood money for her child at five hundred sheep. And on that day, he forbade throwing pebbles. (Sahih) Abu 'Abdur-Rahman (An-Nasa'i) said: This is an error, and it must be that the intent was one hundred camels. And the prohibition of throwing pebbles has been related from 'Abdullah bin Buraidah, from 'Abdullah bin Mughaffal",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4815,
			"arabicnumber": 4815,
			"text": "It was narrated from 'Abdullah bin Mughaffal that he saw a man throwing pebbles and he said:\"Do not throw pebbles, for the Prophet of Allah forbade throwing pebbles,\" or \"he disliked the throwing of pebbles.\" Kahmas (one of the narrators) was not sure",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4816,
			"arabicnumber": 4816,
			"text": "Hamal bin Malik said:\"The Messenger of Allah ruled that a slave (should be given as Diyah) for a fetus.\" Tawus said: \"A horse would do in place of a slave",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4817,
			"arabicnumber": 4817,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah ruled that a male or female slave should be given (as Diyah) to a woman of Banu Lihyah whosw child was miscarried and died. Then the woman to whom he had decreed that the slave should be given died, and the Messenger of Allah ruled that her estate belonged to the children and husband, and that the blood money was to be paid by her 'Asabah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4818,
			"arabicnumber": 4818,
			"text": "It was narrated that Abu Hurairah said:\"Two women of Hudhail had a fight, and one of them threw a rock at the other and killed her and the child in her womb. They referred the dispute to the Messenger of Allah, and the Messenger of Allah ruled that the Diyah for her fetus was a male or female slave, and that the Diyah of the woman be paid by her 'Aqilah (male relatives on the father's side). And he made her children and those who were with them her heirs. Hamal bin Malik bin An-Nabighah Al-Hudhali said: \"O Messenger of Allah, how can I pay blood money for one who neither ate nor drank, or shouted such a one should be over looked.\" The Messenger of Allah said: \"This is one of the brothers of the soothsayers\" because of the rhyming way in which he spoke",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4819,
			"arabicnumber": 4819,
			"text": "It was narrated from Abu Hurairah that:there were two women of Hudhail during the time of the Messenger of Allah, one of whom threw something at the other and caused her to miscarry. The Messenger of Allah ruled that (Diyah of ) a male or female slave be paid for that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4820,
			"arabicnumber": 4820,
			"text": "It was narrated from Sa'eed bin Al-Musayyab that:the Messenger of Allah ruled that for a fetus which is killed in the mother's womb, a male or female slave be given (as Diyah). The one against whom he passed this ruling said: \"How can I pay blood money for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.\" The Messenger of Allah said: \"This is one of the soothsayers",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4821,
			"arabicnumber": 4821,
			"text": "It was narrated from Al-Mughirah bin Shu'bah that:a woman struck her co-wife with a tent pole and killed her, and she (the slain woman) was pregnant. She was brought to the Prophet, and the Messenger of Allah ruled that the 'Asabah of the killer should pay the Diyah , and a slavae (should be paid) for the fetus. Her 'Asabah said: \"Should Diyah be paid for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.\" The prophet said: \"Rhyming verse like the verse of the Bedouins",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4822,
			"arabicnumber": 4822,
			"text": "It was narrated that Al-Mughirah bin Shu'bah said:\"A woman struck her co-wife, who was pregnant, with a tent pole and Killed her, The Messenger of Allah ruled that the 'Asahab of the Killer was to pay the Diyah and to give a slave (as Diyah for ) the child in her womb. One of the'Asabah of the killer said: 'Am I to pay blood money for one whom neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked. The Messenger of Allah said: 'Rhyming verse like the verse of the Bedouin?' and he made them pay the Diyah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4823,
			"arabicnumber": 4823,
			"text": "It was narrated from Al-Mughirah bin shu'bah that:there were two co-wives, one of whom struck the other with a tent people and killed her. The Messenger of Allah ruled that the Diyah was to be paid by the 'Asabah of the killer, and that a slave should be given (as diyah) for the child in her womb. The Bedouin Said: \"Are you penalizing me for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked/\" He said: \"Rhyming verse like the verse of the Jahiliyyah,\" and he ruled that a slave should e given (as Diyah) for the child in her womb",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4824,
			"arabicnumber": 4824,
			"text": "It was narrated that Al-Muhgirah bin Shu'bah said:\"A woman of Banu Lihyan struck her co-wife with a tent pole and killed her, and the slain woman was pregnant. The Messenger of Allah ruled that the Diyah was to be paid by the'Asbah of the killer, and that a slave should be given (as Diyah) for the child in her womb",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4825,
			"arabicnumber": 4825,
			"text": "It was narrated from Al-Muhgirah b in Shu'bad that:two woman were married to a man of Hudhail, and one of them threw tent pole at the other and caused her to miscarry. They referred the dispute to the Prophet and they said: \"how can we pay the Diyah for one who neither shouted nor cried (at the moment of birth), or ate or drank? Such a one should be overlooked.\" He said: \"Rhyming verse like the verse of the Bedouins?\" And the ruled that the 'Aqilah of the women should give a slave 9asdiyah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4826,
			"arabicnumber": 4826,
			"text": "It was narrated form Al-Mughirahbin shu'bah that:a man of Hudhail had two wives, and one of them threw a tent pole at the o0ther and caused her to miscarry. It was said: \"What do you think of one who neither ate nor drank, or shouted nor cried (at the moment of birth)?\" he said: (Rhyming verse like the verse of the Bedouins. \"And the Messenger of Allah ruled that a make or female slave shouted be given (as dihahj) for him (the unborn child), to be paid but the'Aqila h of the woman",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4827,
			"arabicnumber": 4827,
			"text": "It was narrated from al-a'mash from Ibrahim who said:\"I woman struck her co-wife, who was pregnant, with a rock and killed her Messenger of Allah ruled that a slave should be given (as Diyah) for the child in her woman, and that her Diyah should be paid by her 'Asabah. They said:' should we be penalized for one who neither after nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.' He said: 'Rhyming vase like the vase of the Bedouisn? It is what I say to (sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4828,
			"arabicnumber": 4828,
			"text": "It was narrated that Ibn 'Abbas said; \"There were two women neighbors between whom there was some trouble. One of them threw a rock at the other a she miscarried a boy - whose hair had already grown -0 who was or dead, and the woman died too. He ruled that the 'Aqilah had to pay the Diyah. Her paternal uncle said:'O Messenger of Allah, she miscarried a boy whose hair had grown.' The father of the killer said: \"He is lying. By Allah he never cried or shouted (at the moment of birth), nor drank nor ate. Such a one should be overlooked.' The Prophet said: 'rhyming verse like the verse of the Jahiliyyah and of its soothsayers? A slave must be given (as Diyah) for the boy, ''' Ibn 'Abbes said; \"One of then was Mulaikah and the other was Umm Ghatif",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4829,
			"arabicnumber": 4829,
			"text": "Jabir said:\"The Messenger of Allah ruled that every clan should take part in paying the blood money, and it is not permissible for a freed slave to take a Muslim (other than the one who freed him) as his Mawla (Patron) without the permission (of his former master who set him free)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4830,
			"arabicnumber": 4830,
			"text": "It was narrated from'Amrbin shu'aib, from his father that his grandfather said:\"the Messenger of Allah said: 'Whoever practices medicine when he is not known for that, he is liable.(Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4831,
			"arabicnumber": 4831,
			"text": "Narrator mentioned in hadith:A similar report was narrated from 'Amr bin shu'aib, from his father, from his grandfather. (Daif)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4832,
			"arabicnumber": 4832,
			"text": "It was narrated that Abu Rimthah said; \"I came to the Prophet with my father and he said:'Who is this with you?' He said:' my son, I bear witness (that he is my son). He said: 'You cannot be affected by his sin or he by yours",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4833,
			"arabicnumber": 4833,
			"text": "It was narrated that Tha'labah bin Zahdam said:\"some people from Banu Tha'labah came to the Prophet when he was delivering a speech and a man said; \"O Messenger of Allah, these are Banu Tha'labah bin Yarbu' who killed so and so' - one of the Companions of the Prophet The Prophet said: \"No soul is affected by the sin of another",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4834,
			"arabicnumber": 4834,
			"text": "It was narrated that Tha'1abah bin Zahdam said:\"Some people from Banu Tha'labah came to the Prophet () when he was delivering a speech and a man said: 'O Messenger of Allah, these are Banu Tha'labah bin Yarbu' who killed so and so' - one of the Companions of the Prophet (). The Prophet () said: 'No soul is affected by the sin of another",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4835,
			"arabicnumber": 4835,
			"text": "It was narrated that Ash'ath bin Abi Ash-Sha'tha, said:\"I heard Al-Aswad bin Hilal narrate from a man of Banu Tha'labah bin Yarbu' that some people from Banu Tah'labah came to the Prophet and a man said: \"O Messenger of Allah, these are Banu Tha'labah bin Yarbu'who killed so and so' - a man from among the companions of the Prophet. The Prophet said: 'No soul is affected by the sin of another",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4836,
			"arabicnumber": 4836,
			"text": "It was narrated from Al-Aswad bin Hilal - who met the Prophet - from a man from Banu Tha'labah bin Yarbu, that:some people from Banu Tha'labah killed a man from among the companions of the Messenger of Allah. A man from among the companions of the Messenger of the Allah said: \"O Messenger of Allah, these are Banu Tha'labah who killed so and so.\" The Messenger said: \"No soul is affected by the sin of another.\" Shu'bah (one of the narrators) said: \"That means: No soul is responsible for the sin of anothe4r, and Allah knows best",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4837,
			"arabicnumber": 4837,
			"text": "It was narrated from Al-Ash'ath bin sulaim, from his father that a man from among Banu Tha'labah bin Yarbu' said:\"I came to the Prophet when he was speaking, and a man said: 'O Messenger of Allah, these are Banu Tha'labah bin Yarbu' who killed so and so.' The Messenger of Allah said: 'No,' meaning no soul is affected by the sin of another",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4838,
			"arabicnumber": 4838,
			"text": "It was narrated from Ash'ath, from his father that a man from among Banu Tha'labah bin Yarbu' said:\"We came to the Messenger of Allah when he was speaking to the people, and some people stood up and said: 'O Messenger of Allah, these are Banu Tha'labah who killed so and so.' The Messenger of Allah said: 'No soul is affected by the sin of another",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4839,
			"arabicnumber": 4839,
			"text": "It was narrated from Tariq and Muharibi that a manh said:\"O Messenger of Allah, these are Banu Tha'labah who killed so and so during the Jahiliyyah: avenger us! He raised his arms until the whiteness of his armpits could be seen and said: \"No mother's sin can affect her child,\" twice. (Shaih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4840,
			"arabicnumber": 4840,
			"text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:the Messenger of Allah ruled that one-third of the Diyah should be paid for a sightless eye that looks fine, if it is destroyed; one-third of the Diyah should be paid for a paralyzed hand if it is cut off; and one-third of the Diyah should be paid for a black tooth if it is knocked out",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4841,
			"arabicnumber": 4841,
			"text": "It was narrated from'Amr bin Shu'aib, from his father that his grandfather said; the Messenger of Allah said:\"For teeth (the Diyah is) five camels",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4842,
			"arabicnumber": 4842,
			"text": "It was narrated from 'Amr bin shu'aib, from his father, that his grandfather said:The Messenger of Allah said: \"For teeth (the Diyah is ) the same, five camels for each",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4843,
			"arabicnumber": 4843,
			"text": "It was narrated fromabu MUsa that the Prophet said:\"For fingers (the Diyah is ) ten (camels) each",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4844,
			"arabicnumber": 4844,
			"text": "It was narrated from Abu Musa Al-Asha'ari that the Prophet of Allah said:\"Fingers are the same, (the Diyah is) ten (camel)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4845,
			"arabicnumber": 4845,
			"text": "It was narrated that Abu Musa said:\"The Messenger of Allah ruled that the fingers are the same and (the Diyah is ) ten camels for each",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4846,
			"arabicnumber": 4846,
			"text": "It was narrated from Sa'eed bin al-Musayyab that:when the letter was found that was with the family of 'Amr bin Hazm, which they said the Messenger of Allah had written to them, they found in it, with regard to fingers, that the Diyahwas ten (Camels) for each",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4847,
			"arabicnumber": 4847,
			"text": "It was narrated from Ibn 'Abbas that the Propher said:\"this and this are the same,\": meaning the little finger and the thumb",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4848,
			"arabicnumber": 4848,
			"text": "It was narrated from Ibn 'Abbas:\"This and this are the same: The little finger and the thumb (sahih)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4849,
			"arabicnumber": 4849,
			"text": "It was narrated that Ibn 'abbas said:\"The (Diyah for) fingers are ten each",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4850,
			"arabicnumber": 4850,
			"text": "It was narrated that 'Abdullah bin 'Amr said:\"When the Messenger of Allah conquered Makkah, he said in his Khutbah: \"(The Diyah) for fingers is ten each",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4851,
			"arabicnumber": 4851,
			"text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah () said in his khutbah, while he was leaning with his back against the Ka'bah:\"The fingers are the same",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4852,
			"arabicnumber": 4852,
			"text": "It was narrated from 'Amr bin Shu'aib that his father told him that 'Abdullah bin 'Amr said:\"When the Messenger of Allah () conquered Makkah , he said in his Khutbah: 'For any wound that exposes the bone, the diyah is five (camels) each",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4853,
			"arabicnumber": 4853,
			"text": "It was narrated from Abu Bakr bin Muhammad bin 'Amr bin Hazm, from his father from his grandfather, that:the Messenger of Allah wrote a letter to the people of Yemen, included in which were the rules of inheritance, the sunan and the (rules concerning) blood money. He sent it with 'Arm bin Hazm and it was read to the people of Yemen, Its contents were as follows: \"From Muhammad the Prophet to Shurahbil bin 'Abd Kulal, Nu'aim bin 'Abd Kulal, Al-Harith bin' Abd Kulal, Qail dhil-Ru'ain, Mu'afir and Hamdan. To precede\" - And in this letter it said that whoevewrkills a believer for no just reason is to be killed in return, unless the heirs of the victim agree to pardon him. For killing a person, the Diyah is one hundred camels. For the nose, if it is cut off completely, diyah must be paid, for the tongue, diyah must be paid; for the lips, Diyah must be paid; for the testicles, Diyah must be paid; for the ends, Diyah must be paid; for the backbone, Dynamist be paid; for the eyes, Diyah must be paid; for one leg, half the Diyah must be paid; for a blow to the head that reaches the brain, one-third of thediyah must be paid; for a stab wound that penetrates deeply into the body, one-third of the diyah must be paid; for a blow that breaks the bone, fifteen camels must be given; for every digit of the hands or feet, ten camels must be given; for a tooth five camels must be given; for an injury that exposes the bone, five camels must be given. A man may be killed in return for (killing) a woman and those who deal in gold must pay one thousand dinars. (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4854,
			"arabicnumber": 4854,
			"text": "It was narrated from Abi Bakr bin Muhammad bin 'Amr bin Hazm, from his father, from his grandfather, that:the Messenger of Allah wrote a letter to the people of Yemen included in which were the rules of inheritance, the sunan and the (rules concerning) blood money. He sent it with 'Amr bin Hazm and it was read to the people of Yemen. This is a copy of it. And he mentioned something similar, except that he said: \"And for one eye, half the Diyah must be paid; for one hand, half thediyah must be paid; for one foot, half the diyah must be paid. \" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4855,
			"arabicnumber": 4855,
			"text": "It was narrated that Ibn shihab said:\"I read the letter of the Messenger of allah which he wrote for 'Amr bin Hazm when he sent him to govern Najran. The letter was with Abu Bakr bin Hazm. The Messenger of Allah wrote this; 'A statement from Allah and His Messenger; O you who believe! Fulfill (your) obligations, and he wrote the Verses until he reached. Verily, Allah is Swift in reckoning. Then he wrote: 'this is the book if retaliation: For a soul, one hundred camels, '''' and so on",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4856,
			"arabicnumber": 4856,
			"text": "It was narrate that Az-Zuhri said:\"Abu Bakr bin Hazm brought me a letter on a piece of leather (which was ) from the Messenger of Allah: 'This is a statement from Allah and His Messenger: 'O you who believe! Fulfill (your obligations. And he quoted some Verses from it. Then he said: 'For a soul, one hundred camels; for an eye, fifty camels; for a hand, fifty; for a foot, fifty; for a blow to the head that reaches the brain, one-third of the Diyah: for a hand, fifty; for a stab wound that penetrates deeply, one-third of the Diyah; for a blow that breaks a bone, fifteen camels; for fingers, ten each; for teeth, five each; for a wound that exposes the bone, five. (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4857,
			"arabicnumber": 4857,
			"text": "It was narrated from' Abdullah bin Abi Bakr bin Muhammad bin 'Amr bin Hazm that his rather said:\"The letter which the Messenger of Allah wrote to 'Amr bin Hazm concerning blood money: 'For a soul, one hundred camels; for the nose if it is cut off completely, one hundred camels, for a blow to thread that reaches the brain, one third of the Diyah for a soul; for a stab wound that penetrates deeply, likewise; for a hand fifty; for an eye, fifty, for a foot, fifty; for every fingers, Ten camels for a tooth, five; and for a wound that exposes the bone, five",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4858,
			"arabicnumber": 4858,
			"text": "It was narrated form Anas bin Malik that:a Bedouin came to the door of the prophet and put his eye to the crack. The Prophet saw him and intended to put his eye out with a sword or a stick. When he saw him , he stopped, and the Prophet said to hi: \"If you had persisted, I would have put your eye out",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4859,
			"arabicnumber": 4859,
			"text": "It was narrated from Sahl bin Sa'd As-Saidi that:a man looked through a hole in the door of the Prophet, who had with him a kind of comb with which he was scratching his head, When the Messenger of Allah saw him he said: \"If I had known that you were watching me, I would have stabbed you in the eye with this. This rule of asking permission has been ordained so that one may not look unlawfully (into people's houses)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4860,
			"arabicnumber": 4860,
			"text": "It was narrated from Abu Hurairah that the Prophet said:\"Whoever looks into a house without the permission of the occupants and they put out his eye, he has no right to blood money or retaliation",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4861,
			"arabicnumber": 4861,
			"text": "It was narrated from Abu Hurairah that the Prophet said:\"If a person were to look at you without permission and you were to throw a stone at him and put out his eye, there would be no blame on you",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4862,
			"arabicnumber": 4862,
			"text": "It was narrated from Abu Sa'eed Al-Khudri that:he was praying and a son a Marwan wanted to pass in front of him. He tried to stop him but he did not go back, so he hit him. The boy went the boy went out crying and went to Marwan and told him (what had happened). Marwan said to Abu Sa'eed: \"Why did you hit your brother's son?\" He said: \"I did not hit him, rater I hit the Saitan. I heard the Messenger of Allah say: 'If one of you is praying and someone wants to pass in front of him, let him troy to stop him as much as he can, and if he persists then let him fight him, for he is a devil",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4863,
			"arabicnumber": 4863,
			"text": "It was narrated that Sa'eed bin Jubair said:\"Abdur-Rahman bin Abi Laila told me to ask Ibn 'Abbas about two Verses: 'And whoever kills a believe",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4864,
			"arabicnumber": 4864,
			"text": "It was narrated that Sa'eed bin Jabair said:\"The people of Al-Kufah differed concerning this verse: 'And whoever kills a believer intentionally. So I went to Ibn 'Abbas and asked him, and he said: 'It was revealed among the last of what was revealed, and nothing of it was abrogated after that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4865,
			"arabicnumber": 4865,
			"text": "It was narrated that Sa'eed bin Jubair said:\"I said to Ibn Abbas . 'Can a person who killed a believer intentionally repent?' He said: 'No.' Irecited the Verse from Al-Furqan to him: And those who invoke not any other ilah (god) along with Allah, nor kill such person a Allah has forbidden, except but right. He said: 'This Verse was revealed in Makkah and was abrogated by a verse that was revealed in Al-Madinah: And whoever kills a believer intentionally, his recompense is Hell",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4866,
			"arabicnumber": 4866,
			"text": "It was narrated from Salim bin abi Ja'd that:Ibn 'Abbas was asked about someone who killed a believer deliberately then he repented, believed and did righteous deeds, and followed true guidance. Ibn 'Abbas said: \"There is no way he could repent! I heard your Prophet say; He (the victim) will come hanging onto his killer with his jugular veins flowing with blood and saying: \"Ask him why he killed me.\" Then he said: \"by Allah, Allah revealed it and never abrogated anything of it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4867,
			"arabicnumber": 4867,
			"text": "It was narrated that 'Ubaidullah bin abi Bakr said:\"I heard Ana's say: 'The Messenger of Allah said: 'the major sins are; associating others with Allah (shirk), disobeying one's parents, killing a soul (murder) and speaking falsely",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4868,
			"arabicnumber": 4868,
			"text": "It was narrated from 'Abdullah bin 'Amr that the Prophet said:\"The major sins are: associating others with Allah, disobeying parents, killing a souls (murder) and swearing a false oath knowingly",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4869,
			"arabicnumber": 4869,
			"text": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah said: 'No one who commits Zina is a believer at the moment when he is committing Zina, and no one who drinks wine is a believer at the moment when he is drinking it, and no thief is a believer at the moment when he is stealing, and no killer is a believer at the moment he is killing",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 164
			}
		}
	]
}