{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"46": "The Book of Cutting off the Hand of the Thief"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4870,
			"arabicnumber": 4870,
			"text": "It was narrated from abu Hurairah that the Messenger of Allah said:\"No one who commits Zina is a believer at the moment when he is committing Zina; no one who steals is a believe at the moment when he is stealing; no one who drinks wine is a believer at the moment when he is drinking it; and no robber is a believer at the moment when he is robbing and the people are looking on",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4871,
			"arabicnumber": 4871,
			"text": "It was narrated from abu Hurairah that the Prophet - and Ahmad said in his Hadith:\"The Messenger of Allah said: 'No one who commits Zina is a believer at the moment when he is committing Zina; no one who steals is a believer at the moment when he is stealing; no one who drinks wine is a believer at the moment when he is drinking it; but repentance is available to him after that",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4872,
			"arabicnumber": 4872,
			"text": "It was narrated that Abu Hurairah said:\"No one who commits Zina is a believer at the moment when he is committing Zina; no one who steals is a believer at the moment when he is stealing; no one who drinks wine is a believer at the moment when he is drinking it.\" - And he mentioned a fourth but I (the narrator) have forgotten it - \"When he does that the yoke of Islam is shed from his neck, but if he repents, Allah accepts his repentance",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4873,
			"arabicnumber": 4873,
			"text": "It was narrated that Abu Hurairah, may Allah be pleased with him, said:\"The Messenger of Allah said; 'Allah curses the thief who steals an egg and had his hand cut off, and who steals a rope and has his hand cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4874,
			"arabicnumber": 4874,
			"text": "It was narrated from An-Nu'man bin Bashir that:a group of the Kala'iyin complaned to him about some people who had stolen some goods, shoe detained them for several days, and then he let them go. They came and said: \"You let them go without any pressure (to make them admit to their crime) or beating?\" An-Nu'man said: \"What do you want? If you wish, I will beat them, and if Allah brings back your goods thereby, all well and good. Otherwise I will take retaliation from your backs (by beating you) likewise.\" They said: \"is this your ruling?\" He said: \"This is the ruling of Allah and His Messenger \"(Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4875,
			"arabicnumber": 4875,
			"text": "It was narrated from Bahz bin Hakim, from his father, from his grandfather, that:the Messenger of Allah detained some people who were under suspicion",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4876,
			"arabicnumber": 4876,
			"text": "It was narrated from Bahz bin Hakim, from his father, from his grandfather, that:the Messenger of Allah detained a man who was under suspicion, and then he let him go. (Hssan)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4877,
			"arabicnumber": 4877,
			"text": "It was narrated from abu Umayah Al-Makhzumi that:a thief who confused to a crime but with whom no stolen goods has been found, was brought to the Messenger of Allah. The Messenger of Allah said to him: \"I do not think that you stole anything.\"He He said: \"Yes I did.\" He said: \"Take him and cut off his hands, then bring him here, \"So they cut off his hand then they brought him to him. He said to him; \"Say: I seek the forgiveness of Allah and I repent to Him.\" He said: \"I seek the forgiveness of Allah and I repent to Him.\" He said:: \"O Allah, accept his repentance.\"(Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4878,
			"arabicnumber": 4878,
			"text": "It was narrated from Safwan bin Umayyah, that:a man stole a Burdah of his, so he brought him before the Messenger of Allah, who ordered that his hand be cut off. He said: \"O Messenger of Allah, I will let him have it.\" He said: \"Abu Wahb! Why didn't you do that before you brought him to us?\" And the Messenger of Allah had (the man's) hand cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4879,
			"arabicnumber": 4879,
			"text": "It was narrated from Safwan bin Umayyah that:a man stole his Burdah, so he brought him before the Prophet, who ordered that his hand be cut off. He said: \"O Messenger of Allah, I will let him have it.\" He said: \"O Abu Wahb! Why didn't you do that before you brought him to me?\" And the Messenger of Allah had (the man's) hand cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4880,
			"arabicnumber": 4880,
			"text": "Ata' bin Abi Rabah narrated that:a man stole a garment, and was brought before the Messenger of Allah, who order that his hand be cut off. The man said: \"O Messenger of Allah, he can keep it.\" He said: \"Why (did you not say that) before now?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4881,
			"arabicnumber": 4881,
			"text": "It was narrated from Safwan bin Umayyah that:he circumambulated theKa'bah and prayed, then he rolled up a Rid' of his and placed it beneath his head, and slept. A thief came and slid it out from beneath his head and took it. He brought him to the Prophet and said: \"This man stole my Rida. The Prophet said to him: Did you steal this man's Rida?\" He said: \"Yes.\" He said: \"Take him away and cut his hand off.\" Safwan said: \"I* did not want to have his hand cut off for my Rida'.\" He said: \"Why (did you not say that) before now?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4882,
			"arabicnumber": 4882,
			"text": "It narrated that Ibn 'Abbas said:\"Safwina was slleping in the Masjid with his Rida' beneath him, and it was stolen. He got up, and the man had gone, but he caught up with him, and took him to the prophet, who ordered that his hand be cut off. Safwan said; 'O Messenger of Allah, my Rida 'is not worth cutting off a man's hand for. 'He said 'Why did you not say that before you brought him to me",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4883,
			"arabicnumber": 4883,
			"text": "It was knarrated that Safwan bin Umayyah said:\"I was sleeping in the Masjid on a Khmaishah of mine that was worth thirty dirhams, and a man came and stole it from me. The man was caught and taken to the Prophet, who ordered that his hand be cut off. I came to him and said: \"Will you cut off his hand for the sake of only thirty Dirhams? I will sell it to him on credit.\" He said:\" Why did you not say this before you brought him to me?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4884,
			"arabicnumber": 4884,
			"text": "It was narrated from Safwan bin Umayyah that:a Khamisah was stolen from beneath his head while he slept in the Masjid of the Prophet. He caught there thief and brought him to the Prophet, who ordered that his hand be cut off. Safwan said: \"Are you going to cut off his hand?\" He said \"Why didn't you let him go before you b brought him to me?\" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4885,
			"arabicnumber": 4885,
			"text": "It was narrated form 'Amr bin Shu'ainb, from his father, from his grandfather, that the Prophet said:\"Pardon matters that may deserve a Hadd punishment before you bring it to my attention, for whatever is brought to my attention, the Hadd punishment becomes binding.\" (Saif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4886,
			"arabicnumber": 4886,
			"text": "It was narrated from 'Amr bin Shu'aib from his father, from' Abdullah bin 'Amr that the Messenger of Allah said:\"Pardon matters among yourselves that may deserve a Hadd punishment, for whatever is brought to my attention, the Hadd punishment b becomes binding.\" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4887,
			"arabicnumber": 4887,
			"text": "It was narrated from Ibn 'Umar, may Allah be pleased with them both, that a Makhzumi woman used to borrow things then deny that she had borrowed them, so the Prophet (ﷺ) ordered that her hand be cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4888,
			"arabicnumber": 4888,
			"text": "It was narrated that Ibn 'Umar, may Allah be pleased with them said:\"There was a Makhzumi woman who used to borrow things, saying that her neighbors needed the, then she would deny that she had borrowed the, so the Messenger of Allah ordered that her hand be cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4889,
			"arabicnumber": 4889,
			"text": "It was narrated from Ibn 'Umar, may Allah be pleased with them both, that:a woman used, to borrow jewelry from people then keep it. The Messenger of Allah said: \"Let this woman repent to Allah and His Messenger and give back to people what she has taken.\" Then the Messenge of Allah said \"Get up, O Bilal, take her hand and cut it off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4890,
			"arabicnumber": 4890,
			"text": "It was narrated from Nafi that:a woman used to borrow jewelry during the time of the Messenger of Allah. She borrowed some jewelry, collected it and kept it. The Messenger of Allah said: \"Let this woman repent and give back what she has,\" several times, but she did not do that, so he ordered that her hand be cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4891,
			"arabicnumber": 4891,
			"text": "It was narrated from Jabir that:a woman from Banu Makhzum stole (something), and she was brought to the Prophet. She sought the protection of Umm Salamah, but the Prophet said: \"If Fatimah bint Muhammad were to steal, I would cut off her hand.\" And he ordered that her hand be cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4892,
			"arabicnumber": 4892,
			"text": "It was narrated from Saeed bin AL-Musayyab that:a woman from Banu Makhzum borrowed some jewelry, asking on behalf of others, then she denied (having done) that, and the Prophet ordered that her hand be cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4893,
			"arabicnumber": 4893,
			"text": "It was narrated from Dawud bin Abi Asim that:Saeed bin Al-Musayyb narrated something similar to that",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4894,
			"arabicnumber": 4894,
			"text": "Sufyan said:\"There was a Makhzumi woman who used to borrow things then deny that. She was brought to the Messenger of Allah and he was told about her. He said: 'If it were Fatimah (who stole), I would cut off her hand.\"' It was said to Sufyan: \"Who told you that?\" He said: \"Ayyub bin Musa, from Az-Zuhri, from 'Urwah, from 'Aishah, if Allah the mighty and Sublime, wills",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4895,
			"arabicnumber": 4895,
			"text": "It was narrated from `A'ishah that:A woman stole (something) and she was brought to the Prophet. They said: \"Who would dare to speak to the Messenger of Allah except Usamah.\" So they spoke to Usamah and he spoke to (the Prophet). The Prophet said: \"O Usamah, the Children of Israel were destroyed because whenever a noble person among them committed a crime, for which a Hadd punishment was deserved, they would let him go. But if a low-class person among them committed such a crime, they would carry out the punishment on him. If Fatimah bint Muhammad were to steal, I would cut off her hand",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4896,
			"arabicnumber": 4896,
			"text": "It was narrated that 'Aishah said:\"A thief was brought to the hand.\" They said: \"We did not think that you would take it so far.\" He said: \"If it were Fatimah (who stole), I would cut off her hand",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4897,
			"arabicnumber": 4897,
			"text": "It was narrated from 'Aishah that:a woman stole at the time of Messenger of Allah and they said: \"We cannot speak to him concerning her; there is no one who can speak to him except his beloved, Usamah.\" So he spoke to him, and he said\"O Usamah, the Children of Israel were destroyed for such a thing. Whenever a noble person among them stole, they would let him go, but if a low-class person among them stole, they would cut off his hand. If it were Fatimah bint Muhammad (who stole), I would cut off her hand",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4898,
			"arabicnumber": 4898,
			"text": "It was narrated that 'Aishah said:\"A woman borrowed some jewelry, saying that other people whose names were known but hers was not then she sold it and kept the money. She was brought to the Messenger of Allah, and her people went to Usamah bin Zaid, who spoke to the Messenger of Allah concerning her. The face of ht Messenger of Allah changed color while he was speaking to him. Then the Messenger of Allah said to him: 'Are you interceding with me concerning one of ht Hadd punishments decreed by Allah?' Usamah said: 'Pray for forgiveness for me, O Messenger of Allah! Then the Messenger of Allah stood up that evening, he praised and glorified Allah, the mighty and sublime, as he deserves, then he said: 'The people who came before you were destroyed because, whenever a noble person among them stole, they let him go. But if a low-class person stole, they would carry out the punishment on him. By the One in whose hand is the soul of Muhammad, if Fatimah bint Muhammad were to steal, I would cut off her hand.' Then he cut off that woman",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4899,
			"arabicnumber": 4899,
			"text": "It was narrated from 'Aishah that Quraish were worried about the Mkahzumi woman who had stolen. They said; Who will speak to the Messenger of Allah concerning her?\" They said:\"Who would dare to do that except Usamah bin Zaid, the beloved of the Messenger of Allah?\" so Usamah spoke to him and the Messenger of Allah said: \"Are you interceding concerning one of the Hadd punishments decreed by Allah?\" Then he stood up and addressed (the people) and said: \"Those who came before you were destroyed because, whenever a noble person among them stole, they would let him go. But if a person who was weak stole, they would carry out the punishment on him. By Allah, if Fatimah the daughter of Muhammad were to steal, I would cut off her hnad",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4900,
			"arabicnumber": 4900,
			"text": "It was narrated that 'Aishah said:\"A woman of Quraish, from banu Makhzum, stole, and she was brought to the Prophet. They said: 'Who will speak to him concerning her?' They said: 'Usamah bin Zaid.' So he came to the Prophet and spoke to him. But he rebuked him, and he said; 'Among the Children of Israel, if a noble person stole, they would let him go. But if a low-class person stole, they would cut off his hand. By the One in whose hand is the soul of Muhammad, if Fatimah bint Muhammad were to steal, I would cut off her hand",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4901,
			"arabicnumber": 4901,
			"text": "It was narrated from 'Aishah the Quraish were worried about the case of the Makhzumi woman who stole, and they said:\"Who will speak concerning her?\" They said: \"Who would dare to do that except Usamah bin Zaid, the beloved of the Messenger of Allah?\" said: \"Those who came before you were destroyed because whenever a noble person among them stole they would let him go. But if a person who was weak stole, they would carry out the Hadd punishment. By Allah, if Fatimah, the daughter of Muhammad, were to steal, I would ct off her hand",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4902,
			"arabicnumber": 4902,
			"text": "It was narrated from 'Aishah that:a woman stole at the time of the Messenger of Allah, during the Conquest, and she was brought to the Messenger of Allah. Usamah bin Zaid spoke to him concerning her. But when he spoke to him, the face of the Messenger of Allah changed color, and the Messenger of Allah said: \"Are you interceding concerning one of the Hadd punishment decreed by Allah?\" Isa,aj said to him: \"O Messenger of Allah ask Allah to forgive me!\" When evening came, the Messenger of Allah stood up and praised and glorified Allah, the mighty and sublime, as He deserves, then he said: \"The people who came before you were destroyed because whenever a noble person among them stole, they would let him go. But if one who was weak stole, they would carry out the Hadd punishment on him.\" Then he said: \"By the One in whose hand is my soul, if Fatimah bint Muhammad were to steal, I would cut off her hand",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4903,
			"arabicnumber": 4903,
			"text": "It was narrated that Az-Zuhri said:\"Urwah bin Az-Zubair told me that a woman stole at the time of the Messenger of Allah, during the Conquest. Her people went to Uswamah bin Zaid, to ask him to intercede.\" 'Urwah said: \"When Usamah spoke to him concerning her, the face of the Messenger of Allah changed color and he said: 'Are you speaking to me concerning one of the Hadd punishments of Allah?\" Usamah said: 'Pray to Allah for forgiveness for me, O Messenger of Allah.' When evening came, the Messenger of Allah stood up to deliver a speech. He praised Allah as He deserves, then he said: 'The people who came before you were destroyed because, whenever a noble person among them stole, they would carry out the Hadd punishment on him. By the One in whose hand is my soul, if Fatimah bint Muhammad were to steal, I would cut off her hand.' Then the Messenger of Allah ordered that the hand of that woman be cut off. After that she repented sincerely, and 'Aishah said: 'She used to come to me after that, and I would convey her needs to the Messenger of Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4904,
			"arabicnumber": 4904,
			"text": "Abu Hurairah said:\"The Messenger of Allah said: 'A Hadd punishment that is carried out on earth is better for the people of earth than if it were to rain for thirty mornings.\"' (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4905,
			"arabicnumber": 4905,
			"text": "It was narrated that Abu Zurah said:\"Abu Hurairah said: 'Carrying out a Hadd punishment in a land is better for its people than if it were to rain for forty nights.\" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4906,
			"arabicnumber": 4906,
			"text": "Abdullah bin 'Amr said:\"The Messenger of Allah cut off (a thief's hand) for a shield which was worth five Durham's.\" This is how he (the narrator) said it. (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4907,
			"arabicnumber": 4907,
			"text": "Abdullah bin 'Umar said:\"The Messenger of Allah cut off (a thief's hand) for a shield which was worth three Dirham.\" (Sahih) Abu 'Abdur-Rahman (An-Nasai) said: This is correct",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4908,
			"arabicnumber": 4908,
			"text": "It was narrated from Ibn 'Umar that:the Messenger of Allah cut off (a thief's hand) for a shield which cost three Dirhams",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4909,
			"arabicnumber": 4909,
			"text": "Abdullah bin 'Umar narrated that:the Prophet cut off the hand of a thief, who stole a shield, from a portico allocated to women, the price of which was three Dirhams",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4910,
			"arabicnumber": 4910,
			"text": "It was narrated from Ibn 'Umar that:the Messenger of Allah cut off (a thief's hand) for a shield that was worth three Dirhams",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4911,
			"arabicnumber": 4911,
			"text": "It was narrated from Anas bin Malik that:the Messenger of Allah cut off (a thief's hand) for a shield. (Sahih) Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4912,
			"arabicnumber": 4912,
			"text": "It was narrated that Anas said:\"Abu Bakr, may Allah be pleased with him, cut off (a thief's hand) for a shield that was worth five Dirhams",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4913,
			"arabicnumber": 4913,
			"text": "It was narrated that Qatadah said:\"I heard Anas say: 'A man stole a shield during the time of Abu Bakr, the value of which was five Dirhams, and he cut off his hand",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4914,
			"arabicnumber": 4914,
			"text": "It was narrated from 'Aishah, may Allah be pleased with her, that:the Messenger of Allah cut off (a thief's hand) for one quarter of a Dinar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4915,
			"arabicnumber": 4915,
			"text": "It was narrated from 'Aishah that the Messenger of Allah said:\"(The thief's hand) is not to be cut off except for the price of a shield, one-third of a Dinar or half of Dinar, or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4916,
			"arabicnumber": 4916,
			"text": "It was narrated that Az-Zuhri said:\"Amrah said, narrating from 'Aishah, may Allah be pleased with her, that the Messenger of Allah cut off the hand of a thief for a quarter of a Dinar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4917,
			"arabicnumber": 4917,
			"text": "It was narrated from 'Aishah that the Messenger of Allah said:\"The hand of the thief is to be cut off for a quarter of a Dinar, or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4918,
			"arabicnumber": 4918,
			"text": "It was narrated from 'Aishah that the Prophet said:\"The hand of the thief is to be cut off for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4919,
			"arabicnumber": 4919,
			"text": "It was narrated from 'Aishah that the Messenger of Allah said:\"The hand of the thief is to be cut off for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4920,
			"arabicnumber": 4920,
			"text": "It was narrated from 'Aishah that the Messenger of Allah said:\"The hand of the thief is to be cut off for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4921,
			"arabicnumber": 4921,
			"text": "It was narrated from 'Aishah that the Messenger of Allah\" (one of the narrators) Qutaibah said:'Used to cut off the hand of the thief for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4922,
			"arabicnumber": 4922,
			"text": "It was narrated from 'Aishah, from the Prophet:\"The hand of the thief is to be cut off for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4923,
			"arabicnumber": 4923,
			"text": "It was narrated from 'Aishah, from the Prophet:\"The hand of the thief is to be cut off for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4924,
			"arabicnumber": 4924,
			"text": "It was narrated from 'Amrah that she heard 'Aishah say:\"The hand of the thief is to be cut off for one-quarter of a Dinar or more.\" (Sahih) Abu 'Abdur-Rahman (An-Nasai) said: This is the correct version of the narration of Yahya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4925,
			"arabicnumber": 4925,
			"text": "It was narrated from 'Amrah that she heard 'Aishah say:\"The hand of the thief is to be cut off for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4926,
			"arabicnumber": 4926,
			"text": "It was narrated from 'Amrah that 'Aishah said:\"Cutting off (the hand of the thief) is for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4927,
			"arabicnumber": 4927,
			"text": "It was narrated that 'Aishah said:\"It has not been too long and I have not forgotten yet. Cutting off (the hand of the thief) is for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4928,
			"arabicnumber": 4928,
			"text": "It was narrated from 'Aishah that:she heard the Messenger of Allah say: \"The hand of the thief is not be cut off except for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4929,
			"arabicnumber": 4929,
			"text": "Narrator mentioned in hadith:A similar report was narrated from 'Aishah from the Messenger of Allah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4930,
			"arabicnumber": 4930,
			"text": "It was narrated that 'Amrah said:\"Aishah said: 'Cutting off (the hand of the thief) is for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4931,
			"arabicnumber": 4931,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah said: 'The hand of the thief is to be cut off for the price of a shield, and the price of a shield is one-quarter of a Dinar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4932,
			"arabicnumber": 4932,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah used to cut off the (thief's) hand for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4933,
			"arabicnumber": 4933,
			"text": "It was narrated that 'Aishah said:\"The Messenger of Allah said: 'The hand (of the thief) is not to be cut off except for one-quarter of a Dinar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4934,
			"arabicnumber": 4934,
			"text": "Aishah, the mother of the believers, narrated that the Messenger of Allah said:\"The hand (of the thief) is not to be cut off for a shield",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4935,
			"arabicnumber": 4935,
			"text": "Aishah said:The Messenger of Allah said: 'The hand of the thief is not to be cut off for anything less than a shield.\"' It was said to 'Aishah: 'What is the price of a shield?\" She said: \"One-quarter of a Dinar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4936,
			"arabicnumber": 4936,
			"text": "It was narrated from 'Aishah that she heard the Messenger of Allah say:\"The hand of a thief is not to be cut off except for one-quarter of a Dinar or more",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4937,
			"arabicnumber": 4937,
			"text": "Makhramah narrated that his father said:\"I heard 'Uthman bin Abi AL-Walid, the freed slave of the Akhnasiyin, say: 'I heard 'Urwah bin Az-Zubair say;'Aishah used to narrated that the Prophet said: \"The hand (of the htief) should notbe cut off for anything but a shield or its equivalent in value",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4939,
			"arabicnumber": 4939,
			"text": "",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4940,
			"arabicnumber": 4940,
			"text": "It was narrated that sulaiman bin Yasar said:\"Five (fingers i.e., the hand) should not be cut off except for five.\" Hammam said: \"I met 'Abdullah Ad-Danaj and he narrated to me that Sulaiman bin Yasar said: \"Five should not be cut off except for five.\" (Sahih Maqtu)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4941,
			"arabicnumber": 4941,
			"text": "It was narrated that 'Aishah said:\"The hand of the thief should not be cut off for anything less than a Hajafah or a Turs (two kinds of shields),\" each of which was worth a (decent) price",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4942,
			"arabicnumber": 4942,
			"text": "It was narrated from 'Abdullah that:the Prophet cut off (the thief's hand) for (something) that was worth five Dirhams. (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4943,
			"arabicnumber": 4943,
			"text": "It was narrated that Ayman said:\"The Prophet did not cut off the (hand of) the thief except for the value of a shield, and the value of a shield in those days was a Dinar.\" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4944,
			"arabicnumber": 4944,
			"text": "It was narrated that Ayman said:\"The hand of a thief would not be cut off during the time of the Messenger of Allah except for the value of a shield, which in those days was a Dinar.\" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4945,
			"arabicnumber": 4945,
			"text": "It was narrated that Ayman said:\"The hand of a thief was not be cut off during the time of the Messenger of Allah except for the value of a shield, and the value of a shield in those days was a Dinar.\" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4946,
			"arabicnumber": 4946,
			"text": "It was narrated that Ayman said:\"The hand of a thief was not be cut off during the time of the Messenger of Allah except for the price of a shield, which in those days was a Dinar.\" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4947,
			"arabicnumber": 4947,
			"text": "It was narrated that Ayman said:\"The (hand of) a thief is to be cut off for the price of a shield, and the price of a shield during the time of the Messenger of Allah was a Dinar, or ten Dirhams.\" (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4948,
			"arabicnumber": 4948,
			"text": "It was narrated that Ayman bin Umm Ayman who attributed it to the Prophet said:\"The (hand of) a thief is not to be cut off except for the price of a shield, and in those days the price of a shield was a Dinar",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4949,
			"arabicnumber": 4949,
			"text": "It was narrated that Ayman said:\"The (hand of) a thief is not to be cut off for less than the price of a shield.\" (Daif Mawquf)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4950,
			"arabicnumber": 4950,
			"text": "Ata, bin Abi Rabah narrated that 'Abdullah bin 'Abbas used to say:\"Its price in those days was ten Dirhams",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4951,
			"arabicnumber": 4951,
			"text": "Narrated Ibn 'Abbas:A similar report was narrated from Ibn 'Abbas. The price of a shield at the time of the Messenger of Allah was estimated to be ten Dirhams",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4952,
			"arabicnumber": 4952,
			"text": "Narrated from Ayyub bin Musa:(A similar report) was narrated from Ayyub bin Musa, from 'Ata, in Mursal form",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4953,
			"arabicnumber": 4953,
			"text": "It was narrated that 'Ata' said:\"The least for which the hand of a thief is to be cut off is the price of a shield. And the price of a shield in those days was ten Dirhams.\" (Hasan) Abu 'Abdur-Rahman (An-Nasai) said: Ayman, the one whose narrations preceded, I do not think he was a Companion, and another Hadith has been related from him which proves what we have said:",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4954,
			"arabicnumber": 4954,
			"text": "It was narrated that Ka'b said:\"Whoever performs wudu and performs wudu, well, then prays ('Abdur-Rahman said: and prays Isha), then prays after that four Rakahs and does them well (Sawwar said: and understands what he is reciting (Sawwar said: and recites therein), they will be equivalent to (praying) Lailat Al-Qadr for him\". (Hasan Maqtu)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4955,
			"arabicnumber": 4955,
			"text": "It was narrated that Ka'b said:\"Whoever performs Wudu and performs Wudu well, then attends Isha prayer in congregation, then prays four similar Rakahs after that, reciting therein and bowing and prostrating perfectly, that will bring him a reward like that of (praying) Lailat Al-Qadar.\" (Hasan Maqtu)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4956,
			"arabicnumber": 4956,
			"text": "It was narrated from 'Amr bin Shuaib, from his father, that his grandfather said:\"The price of a shield at the time of the Messenger of Allah was ten Dirhams",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4957,
			"arabicnumber": 4957,
			"text": "It was narrated from 'Amr bin Shuaib, from his father, that his grandfather said:\"The Messenger of Allah was asked: 'For how much is the hand (of the thief) to be cut off?' He said: 'The hand (of the thief) is not to be cut off for (stealing) fruit on the tree, but if (the fruit) has been taken to the place where it is stored to dry, then the (thief's) hand is to be cut off (if what is stolen is equivalent to) the price of a shield. The (thief's) hand is not to be cut off for a sheep (stolen) from the grazing land, but if it had been put in the pen, then the (thief's) hand is to be cut off (if what is stolen is equivalent to) the price of a shield",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4958,
			"arabicnumber": 4958,
			"text": "It was narrated from 'Amr bin Shuaib, from his father, that his grandfather 'Abdullah bin 'Amr, that the Messenger of Allah wsa asked about fruit on the tree. He said:\"Whatever a needy person takes without putting any in his pocket (and taking it away), there is no penalty on him. But whoever takes anything away, he must pay a penalty of twice its value, and be punished. Whoever steals something after it has been stored properly, and its value is equal to that of a shield, his hand must be cut off. Whoever steals something worth less than that, he must pay a penalty of twice its value and be punished",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4959,
			"arabicnumber": 4959,
			"text": "It was narrated from 'Amr bin Shuaib, from his father, that his grandfather 'Abdullah bin 'Amr, that a man from Muzainah came to the Messenger of Allah and said:'O Messenger of Allah, what do you think about a sheep stolen from the pasture?\" He said: \"(The thief must pay) double and be punished. There is no cutting off of the hand for (stealing) livestock, except what which has been put in the pen, if its value is equal to that of a shield, in which case the (thief's) hand is to be cut off. If its value is not equal to that of a shield, then he should pay a penalty of twice its value and be flogged as a punishment.\" He said: \"O Messenger of Allah! What do you think about fruit on the tree?\" He said: \"(The thief must pay) double and be punished. There is no cutting off of the hand for (stealing) fruit on the tree, except for that which has been stored properly if its value is equal to that of a shield, in which case the (thief's) hand is not equal to that of a shield, then he should pay a penalty of twice its value and be flogged as a punishment",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4960,
			"arabicnumber": 4960,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4961,
			"arabicnumber": 4961,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4962,
			"arabicnumber": 4962,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4963,
			"arabicnumber": 4963,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4964,
			"arabicnumber": 4964,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4965,
			"arabicnumber": 4965,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4966,
			"arabicnumber": 4966,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4967,
			"arabicnumber": 4967,
			"text": "Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4968,
			"arabicnumber": 4968,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"' (Sahih) Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake, and I do not know who Abu Maimun (one of the narrators) is",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4969,
			"arabicnumber": 4969,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4970,
			"arabicnumber": 4970,
			"text": "It was narrated that Rafi bin Khadij said:\"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4971,
			"arabicnumber": 4971,
			"text": "It was narrated from Sufyan, from Abu Az-Zubair, from Jabir that:the Messenger of Allah robber and pilferer is not to be cut off.\" (Sahih) Sufyan did not hear it from Abu Az-Zubair",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4972,
			"arabicnumber": 4972,
			"text": "It was narrated from Sufyan, from Abu Az-Zubair, that Jabir said:\"The Messenger of Allah said: 'The pilferer is not to be cut off.\"' (Sahih) Ibn Juraij also did not hear it from Abu Az-Zubair. Ibn Juraij also did not hear it from Abu Az-Zubair",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4973,
			"arabicnumber": 4973,
			"text": "It was narrated from Jabir that the Messenger of Allah said:\"The hand of the pilferer is not to be cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4974,
			"arabicnumber": 4974,
			"text": "It was narrated from Hajjaj from Ibn Juraij from Abu Az-Zubair, that Jabir said:\"The hands of the traitor is not to be cut off.\" (Sahih) Abu 'Abdur-Rahman (An-Nasai) said: This Hadith had been reported from Ibn Juraij by 'Isa bin Yunus, Al-Fadl bin Musa, Ibn Wahb, Muhammad bin Rabiah, Makhlad bin Yazid, and Salamah bin Saeed from Al-Basrah, who is trustworthy and Ibn Abi Safwan said: \"He was the best of the people of his time\" and not one of them said: \"Abu Az-Zubair narrated to me\" and I do not think that he heard it from Abu Az-Zubair, and Allah knows best",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4975,
			"arabicnumber": 4975,
			"text": "It was narrated that Jabir said:\"The Messenger of Allah said: 'The hand of the pilferer, robber and traitor is not to be cut off",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4976,
			"arabicnumber": 4976,
			"text": "It was narrated that Jabir said:\"The hand of the traitor is not to be cut off.\" (Sahih) Abu 'Abdur-Rahman (An-Nasai) said: Ashath bin Sawwar (one of its narrators) is weak",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4977,
			"arabicnumber": 4977,
			"text": "It was narrated from Al-Harith bin Hatib that a thief was brought to the Messenger of Allah and he said:\"Kill him.\" They said: \"O Messenger of Allah, he only stole (something).\" He said: \"Kill him.\" They said: \"O Messenger of Allah, he only stole (something).\" He said: \"Cut off his hand.\" Then he stole again, and his foot was cut off. Then he stole at the time of Abu Bakr, untilo all his extremities had been cut off. Then he stole a fifth time, and Abu Bakr, may Allah be pleased with him, said: \"The Messenger of Allah knew better about him when he said: 'Kill him.\"' Then he handed him over to some young men of Quraish to kill him, among whom was 'Abdullah bin Az-Zubair who liked to be in a position of leadership. He said: \"Put me in charge of them,\" so they put him in charge of them and when he struck him, they would strike him, until they killed him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4978,
			"arabicnumber": 4978,
			"text": "It was narrated that Jabir bin 'Abdullah said:\"A thief was brought to the Messenger of Allah and he said: 'Kill him.' They said: 'O Messenger of Allah, he only stole.' He said: 'Cut off (his hand).' So his hand was cut off. Then he was brought a second time and he said: 'Kill him.' They said; 'O Messenger of Allah, he only stole.' He said: 'Cut off (his foot).' So his foot was cut off. He was brought to him a third time and he said: 'Kill him.' They said: 'O Messenger of Allah, he only stole. He said: 'Cut off (his other hand).' Then he was brought to him a fourth time and he said: Kill him.' They said: 'O Messenger of Allah, he only stole.' He said: 'Cut off (his other foot).' He was brought to him a fifth time and he said: \"So we took him to an animal pen and attacked him. He lay down on his back then waved his arms and legs (in the air), and the camels ran away. Then they attacked him a second time and he did the same thing, then they attacked him a third time, and we threw stones at him and killed him, then we threw him into a well and threw stones on top of him.\" (Hasan) Abu 'Abdur-Rahman (An-Nasai) said: This Hadith is Munkar, Musab bin Thabit is not strong in Hadith",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4979,
			"arabicnumber": 4979,
			"text": "It was narrated that Junadah bin Abi Umayyah said:\"I heard Busr bin Abi Artah say: 'I heard the Messenger of Allah say: Hand should not be cut off while traveling",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4980,
			"arabicnumber": 4980,
			"text": "It was narrated from Abu Hurairah that the Prophet said:\"If a slave steals, then sell him, even for half price.\" (Hasan) Abu 'Abdur-Rahman (An-Nasai) said: 'Umar bin Abi Salamah is not strong in Hadith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4981,
			"arabicnumber": 4981,
			"text": "It was narrated that 'Atiyyah said:'I was among the prisoners of Quraizah; we were examined, and whoever had grown (pubic) hair was killed, and whoever had not grown hair, he was allowed to live and was not killed",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4982,
			"arabicnumber": 4982,
			"text": "It was narrated that Ibn Muhairiz said; \"I asked Fadalah bin 'Ubaid about hanging the hand (of the thief) from his neck, and he said:'It is Sunnah. The Messenger of Allah cut off a thief's hand then hung it from his neck.\"'(Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4983,
			"arabicnumber": 4983,
			"text": "It was narrated that 'Abdur-Rahman bin Muhairiz said:\"I said to Fadalah bin 'Ubaid: 'Do you think that hanging the hand from the thief's neck is Sunnah?' He said: 'Yes; a thief was brought to the Messenger of Allah and he cut off his hand and hung it from his neck.\"' (Daif) Abu 'Abdur-Rahman (An-Nasai) said; Al-Hajjaj bin Artah is weak, his narrations are not used as proof",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4984,
			"arabicnumber": 4984,
			"text": "It was narrated from 'Abdur-Rahman bin 'Awf that the Messenger of Allah said:\"The thief is not to be penalized (financially) if the Hadd punishment is carried out on him.\" (Daif) Abu 'Abdur-Rahman (An-Nasai) said: This is Mursal and it is not confirmed",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 114
			}
		}
	]
}