{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"47": "The Book Of Faith and its Signs"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4985,
			"arabicnumber": 4985,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah [SAW] was asked: \"Which deed is best?\" \"He said: Faith in Allah [SWT] and His messenger [SAW]",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4986,
			"arabicnumber": 4986,
			"text": "It was narrated from Abdullah bin Hubshi Al-Khath'ami that:The Prophet [SAW] was asked: \"Which deed is best?\" He said: \"Faith in which there is no doubt, Jihad in which there is no Ghulul, and Hajjatun Mabrur",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4987,
			"arabicnumber": 4987,
			"text": "It was narrated that Anas bin Malik said:\"The messenger of Allah [SAW] said: 'There are three things, whoever attains them will find therein the sweetness of faith: When Allah [SWT], the Mighty and Sublime, and His Messenger [SAW] are dearer to him than all else; when he loves for the sake of Allah [SWT] and hates for the sake of Allah [SWT]; and when a huge fire be lit and he fall into it, than associate anything with Allah [SWT]",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4988,
			"arabicnumber": 4988,
			"text": "It was narrated that Qatadah said:\"I heard Anas bin Malik narrating that the Prophet [SAW] said: 'There are three things, whoever attains them will find therein a sweetness of faith: When he loves a person, and only loves him for the sake of Allah [SWT]; when Allah [SWT] and His Messenger [SAW] are dearer to him than all else; and when he would prefer to be thrown into the fire rather to go back to the disbelief from which Allah [SWT] has saved him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4989,
			"arabicnumber": 4989,
			"text": "It was narrated from Anas that :The Prophet [SAW] said: \"There are three things, whoever attains them will find therein the sweetness of Islam: When Allah [SWT] and His Messenger [SAW] are dearer to him than all else; when he loves a person and only loves him for the sake of Allah [SWT]; and when he would hate to go back to disbelief as much as he would hate to be thrown into the fire",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4990,
			"arabicnumber": 4990,
			"text": "Abdullah bin 'Umar said:\"Umar bin Al-Khattab told me: 'While we were with the Messenger of Allah [SAW] one day, a man appeared before us whose clothes were exceedingly white and whose hair was exceedingly black. We could see no signs of travel on him, but none of us knew him. He came and sat before the Messenger of Allah [SAW], putting his knees against his, and placing his hands on his thighs, then he said: \"O Muhammad, tell me about Islam.\" He said: \"It is to bear witness that there is none worthy of worship except Allah [SWT] and that Muhammad [SAW] is the Messenger of Allah, to establish the Salah, to give Zakah, to fast Ramadan, and to perform Hajj to the House if you are able to bear the journey.\" He said: \"You have spoken the truth.\" And we were amazed by his asking him, and then saying, \"You have spoken the truth\". Then he said: \"Tell me about Faith.\" He said: \"It is to believe in Allah [SWT] , His Angels, His Books, His Messengers, the Last Day, and in the Divine Decree, its good and its bad.\" He said: \"You have spoken the truth.\" He said: \"Tell me about Al-Ihsan.\" He said: \"It is to worship Allah [SWT] as if you can see Him, for although you cannot see Him, He can see you.\" He said: \"Tell me about the Hour.\" He said: \"The one who is asked about it does not know more about it than the one who is asking.\" He said: \"Then tell me about its signs.\" He said: \"When a slave woman gives birth to her mistress, when you see the barefoot, naked, destitute shepherds competing in making tall buildings.'\" 'Umar said: 'Three (days) passed, then the Messenger of Allah [SAW] said to me: \"O 'Umar, do you know who the questioner was?\" I said: \"Allah and His Messenger know best.\" He said: \"That was Jibril, peace be upon him, who came to you to teach you your religion",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4991,
			"arabicnumber": 4991,
			"text": "It was narrated that Abu Hurairah and Abu Dharr said:\"The Messenger of Allah [SAW] would sit among his Companions and if a stranger came, he would not know which of them was he (the Prophet [SAW]) until he asked. So we suggested to the Messenger of Allah [SAW] that we should make a dais for him so that any stranger would know him if he came to him. So we built for him a bench made of clay on which he used to sit. (One day) we were sitting and the Messenger of Allah [SAW] was sitting in his spot, when a man came along who was the most handsome and good-smelling of all people, and it was as if no dirt had ever touched his garments. He came near the edge of the rug and greeted him, saying: 'Peace be upon you, O Muhammad!' He returned the greeting, and he said: 'Shall I come closer, O Muhammad?' He came a little closer, and he kept telling him to come closer, until he put his hands on the knees of the Messenger of Allah [SAW]. He said: 'O Muhammad, tell me, what is Islam?' He said: 'Islam means to worship Allah and not associate anything with Him; to establish Salah, to pay Zakah, to perform Hajj to the House, and to fast Ramadan.' He said: 'If I do that, will I have submitted (be a Muslim)?' He said: 'Yes.' He said: 'You have spoken the truth,' we found it odd. He said: 'O Muhammad, tell me, what is faith?' He said: 'To believe in Allah [SWT], His Angels, the Book, the Prophets, and to believe in the Divine Decree.' He said: 'If I do that, will I have believed?' The Messenger of Allah [SAW] said: 'Yes.' He said: 'You have spoken the truth.' He said: 'O Muhammad, tell me, what is Al-Ihsan?' He said: 'To worship Allah [SWT] as if you can see Him, for although you cannot see Him, He can see you.' He said: 'You have spoken the truth.' He said: 'O Muhammad, tell me about the Hour.' He lowered his head and did not answer. Then he repeated the question, and he did not answer. Then he repeated the question (a third time) and he did not answer. Then he raised his head and said: 'The one who is being asked does not know more than the one who is asking. But it has signs, by which it may be known. When you see the herdsmen competing in building tall buildings, when you see the barefoot and naked ruling the Earth, when you see a woman giving birth to her mistress. Five things which no one knows except Allah [SWT]. Verily, Allah, with Him (alone) is the knowledge of the Hour up to His saying: 'Verily, Allah is All-Knower, All-Aware (of things).' Then he said: 'No, by the One who sent Muhammad with the truth, with guidance and glad tidings, I did not know him more than any man among you. That was Jibril, peace be upon you, who came down in the form of Dihyah Al-Kalbi",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4992,
			"arabicnumber": 4992,
			"text": "It was narrated from 'Amir bin Sa'd bin Abi Waqqas that his father said:\"The Prophet [SAW] gave a share (of some spoils of war) to some men and not to others. Sa'd said: 'O Messenger of Allah [SAW], you gave to so-and-so and so-and-so, but you did not give anything to so-and-so, and he is a believer.' The Prophet [SAW] said: 'Or a Muslim,' until Sa'd had repeated it three times, and the Prophet [SAW] said: 'I give to some men, and leave those who are dearer to me, without giving them anything, lest (the former) be thrown into Hell on their faces",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4993,
			"arabicnumber": 4993,
			"text": "It was narrated from Sa'd that :The Messenger of Allah [SAW] distributed (some spoils of war) and gave to some people but withheld from others. I said: \"O Messenger of Allah, you gave to so-and-so and so-and-so, and you withheld from so-and-so, who is a beliver.\" He said: \"Do not say 'a believer,' say 'a Muslim.'\" Ibn Shihab (one of the narrators) said: The Bedouins say: \"We believe",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4994,
			"arabicnumber": 4994,
			"text": "It was narrated from Bishr bin Suhaim that:The Prophet [SAW] commanded him to call out on the days of At-Tashriq that no one would enter Paradise except a believer, and that these were the days of eating and drinking",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4995,
			"arabicnumber": 4995,
			"text": "It was narrated from Abu Hurairah that:The Messenger of Allah [SAW] said: \"The Muslim is the one from whose tongue and hand the people are safe, and the believer is the one from whom the people's lives and wealth are safe",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4996,
			"arabicnumber": 4996,
			"text": "It was narrated that 'Abdullah bin 'Amr said:\"I heard the Messenger of Allah [SAW] say: \"The Muslim is the one from whose tongue and hand the Muslims are safe, and the Muhajir is the one who forsakes (Hajara) that which Allah has forbidden to him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4997,
			"arabicnumber": 4997,
			"text": "It was narrated that Anas said:\"The Messenger of Allah [SAW] said: 'Whoever prays as we pray, turns to face the same Qiblah as us and eats our slaughtered animals, that is a Muslim",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4998,
			"arabicnumber": 4998,
			"text": "It was narrated that Abu Sa'eed Al-Khudri said:\"The Messenger of Allah [SAW] said: 'If a person accepts Islam, such that his Islam is good, Allah will decree reward for every good deed that he did before, and every bad deed that he did before will be erased. Then after that will come the reckoning; each good deed will be rewarded ten times up to seven hundred times. And each bad deed will be recorded as it is, unless Allah, the Mighty and Sublime, forgives it",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4999,
			"arabicnumber": 4999,
			"text": "It was narrated that Abu Musa said:\"I said: 'O Messenger of Allah, whose Islam is most virtuous?' He said: 'The one from whose tongue and hand the Muslims are safe",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5000,
			"arabicnumber": 5000,
			"text": "It was narrated from 'Abdullah bin 'Amr that:A man asked the Messenger of Allah [SAW]: \"What quality of Islam is best?\" He said: \"To feed (the poor) and to say the Salam to whomever one knows and whomever one does not know",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5001,
			"arabicnumber": 5001,
			"text": "It was narrated from Ibn 'Umar that:A man said to him: \"Why don't you go out and fight?\" He said: \"I heard the Messenger of Allah [SAW] say: 'Islam is built on five (pillars): Testimony that there is none worthy of worship except Allah, establishing Salah, giving Zakah, Hajj, and fasting Ramadan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5002,
			"arabicnumber": 5002,
			"text": "It was narrated that 'Ubadah bin As-Samit said:\"We were with the Prophet [SAW] in a gathering and he said: 'Give me your pledge that you will not associate anything with Allah, you will not steal and you will not have unlawful sexual relations'- and then he recited the Verse to them. 'Whoever among you fulfills this pledge, his reward will be with Allah, and whoever commits any of those actions and Allah, the Mighty and Sublime, conceals him, it is up to Allah: If He wills, He will punish him, and if He wills, He will forgive him",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5003,
			"arabicnumber": 5003,
			"text": "It was narrated from Anas bin Malik that:The Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they bear witness that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah. If they bear witness that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah, they turn to face the same Qiblah as us, they eat our slaughtered animals, and they pray as we pray; then their blood and their wealth are forbidden to us, except for a right that is due, and they have the same rights and duties as the Muslims",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5004,
			"arabicnumber": 5004,
			"text": "It was narrated from Abu Hurairah that:The Prophet (ﷺ) said: \"Faith has seventy odd branches and modesty (Al-Haya') is a branch of faith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5005,
			"arabicnumber": 5005,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah [SAW] said: 'Faith has seventy-odd branches, the most virtuous of which is La ilaha illallah (there is none worthy of worship except Allah) and the least of which is removing something harmful from the road. And modesty (Al-Haya') is a branch of faith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5006,
			"arabicnumber": 5006,
			"text": "It was narrated from Abu Hurairah that:The Prophet [SAW] said: \"Modesty (Al-Haya') is a branch of Faith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5007,
			"arabicnumber": 5007,
			"text": "It was narrated from 'Amr bin Shurahbil,:That one of the Companions of the Prophet [SAW] said: \"The Messenger of Allah [SAW] said: 'Ammar's heart overflows with Faith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5008,
			"arabicnumber": 5008,
			"text": "Abu Sa'eed said:\"I heard the Messenger of Allah [SAW] say: 'Whoever among you sees an evil, let him change it with his hand; if he cannot, then with his tongue; if he cannot, then with his heart- and that is the weakest of Faith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5009,
			"arabicnumber": 5009,
			"text": "It was narrated that Tariq bin Shihab said:\"Abu Sa'eed Al-Khudri said: 'I heard the Messenger of Allah [SAW] say: Whoever among you sees an evil and changes it with his hand, then he has done his duty. Whoever is unable to do that, but changes it with his tongue, then he has done his duty. Whoever is unable to do that, but changes it with his heart, then he has done his duty, and that is the weakest of Faith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5010,
			"arabicnumber": 5010,
			"text": "It was narrated that Abu Sa'eed Al-Khudri said:\"The Messenger of Allah [SAW] said: 'No one of you disputes more intensely for something that is rightly his in this world, than the believers will dispute with their Lord for their brothers who have entered the Fire. They will say: 'Our Lord, our brothers used to pray with us and fast with us, and perform Hajj with us, and you have caused them to enter the Fire?' He will say: 'Go and bring forth whomever you recognize among them.' So they will go to them, and will recognize them by their appearances. Among them will be those who have been seized by the Fire up to the middle of their shins, and some among them those whom it has taken up to his ankles. They will bring them forth, then they will say: 'Our Lord, we have brought forth those whom You commanded us (to bring forth).' He will say: 'Bring forth everyone in whose heart is faith the weight of a Dinar.' Then He will say: 'Everyone in whose heart is faith the weight of half a Dinar,' until He will say: 'In whose heart is faith the weight of the smallest speck.'\" Abu Sa'eed said: \"Whoever does not believe this, let him read the Verse: 'Verily, Allah forgives not that partners should be set up with Him (in worship), but He forgives except that (anything else) to whom He wills up to a tremendous (sin)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5011,
			"arabicnumber": 5011,
			"text": "Abu Sa'eed Al-Khudri said:\"The Messenger of Allah [SAW] said: 'While I was sleeping, I saw the people being shown to me, and they were wearing shirts. Some reached the breast and some reached lower than that. And 'Umar bin Al-Khattab was shown to me, and he was wearing a shirt that he was dragging;' They said: 'How do you interpret that, O Messenger of Allah?' He said: 'The religion",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5012,
			"arabicnumber": 5012,
			"text": "It was narrated that Tariq bin Shihab said:\"A Jewish man came to 'Umar bin Al-Khattab and said: 'O Commander of the Believers! There is a Verse in your Book which you recite; if it had been revealed to us Jews we would have taken that day as a festival.' He said: 'Which Verse is that?' He said: 'This day, I have perfected your religion for you, completed My favor upon you, and have chosen for you Islam as your religion.' 'Umar said: 'I know the place where it was revealed and the day on which it was revealed. It was revealed to the Messenger of Allah [SAW] at 'Arafat, on a Friday",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5013,
			"arabicnumber": 5013,
			"text": "It was narrated from Qatadah that:He heard Anas say: \"The Messenger of Allah [SAW] said: 'None of you has believed until I am dearer to him than his son, his father and all the people",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5014,
			"arabicnumber": 5014,
			"text": "It was narrated that Anas said:\"The Messenger of Allah [SAW] said: 'None of you has believed until I am dearer to him than his family, his wealth and all the people",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5015,
			"arabicnumber": 5015,
			"text": "Abu Hurairah narrated that:The Messenger of Allah [SAW] said: \"By the One in Whose hand is my soul, none of you has believed until I am dearer to him than his son or his father",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5016,
			"arabicnumber": 5016,
			"text": "It was narrated that Qatadah said:\"I heard Anas say: 'The Messenger of Allah [SAW] said (Humaid bin Mas'dah said in his Hadith: 'The Prophet of Allah [SAW] said): None of you has believed until he loves for his brother what he loves for himself",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5017,
			"arabicnumber": 5017,
			"text": "It was narrated from Anas that :The Messenger of Allah [SAW] said: \"By the One in Whose hand is the soul of Muhammad, none of you has believed until he loves for his brother what he loves for himself of goodness",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5018,
			"arabicnumber": 5018,
			"text": "It was narrated that Zirr said:'Ali said: \"The Unlettered Prophet [SAW] made a covenant with me, that none but a believer would love me, and none but a hypocrite would hate me",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5019,
			"arabicnumber": 5019,
			"text": "It was narrated from Anas that:The Prophet [SAW] said: \"Love for Ansar is a sign of Faith, and hatred for Ansar is a sign of hypocrisy",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5020,
			"arabicnumber": 5020,
			"text": "It was narrated from 'Abdullah bin 'Amr that:The Prophet [SAW] said: \"There are four (traits), whoever has them is a hypocrite and whoever has one of them, then has one of the traits of hypocrisy, until he gives it up: When he speaks, he lies; when he makes a promise, he breaks it; when he makes a covenant, he betrays it; and when he argues, he resorts to foul language",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5021,
			"arabicnumber": 5021,
			"text": "It was narrated from Abu Hurairah that :The Messenger of Allah [SAW] said: \"The signs of the hypocrite are three: When he speaks, he lies; when he makes a promise he breaks it; and when he is entrusted with something, he betrays (that trust)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5022,
			"arabicnumber": 5022,
			"text": "It was narrated that 'Ali said:\"The Prophet [SAW] made a covenant with me that none would love me but a believer, and none would hate me but a hypocrite",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5023,
			"arabicnumber": 5023,
			"text": "It was narrated that Abu Wa'il said:\"Abdullah said: 'There are three (traits), whoever has them is a hypocrite: When he speaks, he lies; when he is entrusted with something, he betrays that trust; and when he makes a promise, he breaks it. Whoever has one of these (traits) then a trait of hypocrisy has not ceased in him, until he leaves it.'\" (Sahih Mawquf)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5024,
			"arabicnumber": 5024,
			"text": "It was narrated from Abu Hurairah that :The Messenger of Allah [SAW] said: \"Whoever stands (in he voluntary night prayer of) the Ramadan out of faith and in the hope of reward, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5025,
			"arabicnumber": 5025,
			"text": "It was narrated from Abu Hurairah that :The Prophet [SAW] said: \"Whoever stands (in the voluntary night prayer of) Ramadan out of faith and in hope of reward, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5026,
			"arabicnumber": 5026,
			"text": "It was narrated from Abu Hurairah that:The Prophet [SAW] said: \"Whoever stands (in the voluntary night prayer of) Ramadan out of faith and in the hope of reward, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5027,
			"arabicnumber": 5027,
			"text": "Abu Hurairah narrated that:The Messenger of Allah [SAW] said: \"Whoever stands (in the voluntary night prayer of) Ramadan out of faith and in the hope of reward, his previous sins will be forgiven. And whoever spends the night of Lailat Al-Qadr in prayer out of faith and in the hope of reward, his previous sins will be forgiven",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5028,
			"arabicnumber": 5028,
			"text": "Abu Suhail narrated from his father,:That he heard Talhah bin 'Ubaidullah say: \"A man from Najd with unkempt hair came to the Messenger of Allah [SAW]; he was speaking loudly but his speech could not be understood until he came close. He was asking about Islam. The Messenger of Allah [SAW] said: 'Five prayers every day and night.' He said: 'Do I have to do any more than that? He said: 'No, not unless you do it voluntarily.' The Messenger of Allah [SAW] said: 'Fasting the month of Ramadan.' He said: 'Do I have to do any more than that?' He said: 'No, not unless you do it voluntarily.' Then the Messenger of Allah [SAW] told him about Zakah. He said: 'Do I have to do any more than that?' He said: 'No, not unless you do it voluntarily.' The man left saying, 'I will not do any more than that or any less.' The Messenger of Allah [SAW] said: 'He will succeed, if he is telling the truth",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5029,
			"arabicnumber": 5029,
			"text": "Abu Hurairah said:\"I heard the Messenger of Allah [SAW] say: 'Allah has promised the one who goes out in His cause 'and does not go out except with faith in Me and for Jihad in My cause,' that he is guaranteed to enter Paradise no matter how, either he is killed, or he dies, or he will be brought back to his home from which he departed having acquired whatever he acquired of reward or spoils of war",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5030,
			"arabicnumber": 5030,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah [SAW] said: 'Allah, the Mighty and Sublime, has guaranteed to the one who goes out in His cause, 'and he does not go out for any other purpose except Jihad in My cause and faith in Me, believing in My Messengers, but he is guaranteed that I will admit him to Paradise or I will send him back to his dwelling from which he set out, having acquired whatever he acquired of reward or spoils of war",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5031,
			"arabicnumber": 5031,
			"text": "It was narrated that Ibn 'Abbas said:\"The delegation of 'Abdul-Qais came to the Messenger of Allah [SAW] and said: 'We are a group of people from (the tribe of) Rabi'ah, and we can only reach you during the sacred month. Tell us something that we can take from you and to which we may call those who are behind us.' He said: 'I command you to do four things and I forbid you from four: Faith in Allah'- and he explained that to them- 'bearing witness that there is none worthy of worship except Allah, establishing Salah, paying Zakah, and giving me one-fifth (the Khumus) of the spoils of war you acquire. And I forbid you from Ad-Dubba', Al-Hantam, Al-Muqayyir, and Al-Muzaffat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5032,
			"arabicnumber": 5032,
			"text": "It was narrated from Abu Hurairah that:The Prophet [SAW] said: \"Whoever follows the funeral procession of a Muslim out of faith and in the hope of reward, then offers the funeral prayer for him and waits until he is placed in his grave, then he will have two Qirats, each of which is like Mount Uhud. Whoever offers the funeral prayer for him then returns, he will have one Qirat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5033,
			"arabicnumber": 5033,
			"text": "It was narrated from Salim, from his father, that:The Messenger of Allah [SAW] passed by a man who was censuring his brother about modesty. He said: \"Let him be, for modesty is part of faith",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5034,
			"arabicnumber": 5034,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah said: 'Indeed, this religion is easy, and no one will ever overburden himself in religion, except that it will overcome him. So seek what is appropriate, and come as close as you can, and receive the glad tidings (that you will be rewarded), and take it easy; and gain strength by worshipping in the mornings, afternoons, and during the last hours of the nights",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5035,
			"arabicnumber": 5035,
			"text": "It was narrated from 'Aishah that:The Prophet [SAW] entered upon her and there was a woman with her. He said: \"Who is this?\" She said: \"So-and-so; she does not sleep\"- she mentioned her excessive praying. The Prophet [SAW] said: \"Keep quiet. You should do what you are able to, for by Allah, Allah, the Mighty and Sublime, does not get tired. The most beloved religion to Him is that in which a person persists",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5036,
			"arabicnumber": 5036,
			"text": "It was narrated that Abu Sa'eed Al-Khudri said:\"The Messenger of Allah [SAW] said: 'Soon the best wealth of a Muslim will be the sheep which follows in the mountain peaks and places where rainfall is to be found, fleeing with his religion from the tribulations",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5037,
			"arabicnumber": 5037,
			"text": "It was narrated from Ibn 'Umar that :The Messenger of Allah [SAW] said: \"The parable of the hypocrite is that of a sheep that hesitates between two flocks, sometimes following one, and sometimes following another, not knowing which to follow",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5038,
			"arabicnumber": 5038,
			"text": "Abu Musa Al-Ash'ari said:\"The Prophet [SAW] said: 'The parable of the believer who recites the Qur'an is that of a citron, the taste and smell of which are good. The parable of a believer who does not read the Qur'an is that of a date, the taste of which is good but it has no smell. The parable of a hypocrite who reads the Qur'an is that of basil, the smell of which is good but its taste is bitter. And the parable of a hypocrite who does not read the Qur'an is that of a colocynth (bitter-apple), the taste of which is bitter and it has no smell",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5039,
			"arabicnumber": 5039,
			"text": "It was narrated from Anas bin Malik that:The Prophet [SAW] said: \"None of you has believed until he loves for his brother what he loves for himself",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 55
			}
		}
	]
}