{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1930,
			"arabicnumber": "832",
			"text": "حَدَّثَنِي أَحْمَدُ بْنُ جَعْفَرٍ الْمَعْقِرِيُّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا شَدَّادُ بْنُ عَبْدِ اللَّهِ أَبُو عَمَّارٍ، وَيَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي أُمَامَةَ، - قَالَ عِكْرِمَةُ وَلَقِيَ شَدَّادٌ أَبَا أُمَامَةَ وَوَاثِلَةَ وَصَحِبَ أَنَسًا إِلَى الشَّامِ وَأَثْنَى عَلَيْهِ فَضْلاً وَخَيْرًا - عَنْ أَبِي أُمَامَةَ قَالَ قَالَ عَمْرُو بْنُ عَبَسَةَ السُّلَمِيُّ كُنْتُ وَأَنَا فِي الْجَاهِلِيَّةِ أَظُنُّ أَنَّ النَّاسَ عَلَى ضَلاَلَةٍ وَأَنَّهُمْ لَيْسُوا عَلَى شَىْءٍ وَهُمْ يَعْبُدُونَ الأَوْثَانَ فَسَمِعْتُ بِرَجُلٍ بِمَكَّةَ يُخْبِرُ أَخْبَارًا فَقَعَدْتُ عَلَى رَاحِلَتِي فَقَدِمْتُ عَلَيْهِ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُسْتَخْفِيًا جُرَءَاءُ عَلَيْهِ قَوْمُهُ فَتَلَطَّفْتُ حَتَّى دَخَلْتُ عَلَيْهِ بِمَكَّةَ فَقُلْتُ لَهُ مَا أَنْتَ قَالَ ‏\"‏ أَنَا نَبِيٌّ ‏\"‏ ‏.‏ فَقُلْتُ وَمَا نَبِيٌّ قَالَ ‏\"‏ أَرْسَلَنِي اللَّهُ ‏\"‏ ‏.‏ فَقُلْتُ وَبِأَىِّ شَىْءٍ أَرْسَلَكَ قَالَ ‏\"‏ أَرْسَلَنِي بِصِلَةِ الأَرْحَامِ وَكَسْرِ الأَوْثَانِ وَأَنْ يُوَحَّدَ اللَّهُ لاَ يُشْرَكُ بِهِ شَىْءٌ ‏\"‏ ‏.‏ قُلْتُ لَهُ فَمَنْ مَعَكَ عَلَى هَذَا قَالَ ‏\"‏ حُرٌّ وَعَبْدٌ ‏\"‏ ‏.‏ قَالَ وَمَعَهُ يَوْمَئِذٍ أَبُو بَكْرٍ وَبِلاَلٌ مِمَّنْ آمَنَ بِهِ ‏.‏ فَقُلْتُ إِنِّي مُتَّبِعُكَ ‏.‏ قَالَ ‏\"‏ إِنَّكَ لاَ تَسْتَطِيعُ ذَلِكَ يَوْمَكَ هَذَا أَلاَ تَرَى حَالِي وَحَالَ النَّاسِ وَلَكِنِ ارْجِعْ إِلَى أَهْلِكَ فَإِذَا سَمِعْتَ بِي قَدْ ظَهَرْتُ فَأْتِنِي ‏\"‏ ‏.‏ قَالَ فَذَهَبْتُ إِلَى أَهْلِي وَقَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وَكُنْتُ فِي أَهْلِي فَجَعَلْتُ أَتَخَبَّرُ الأَخْبَارَ وَأَسْأَلُ النَّاسَ حِينَ قَدِمَ الْمَدِينَةَ حَتَّى قَدِمَ عَلَىَّ نَفَرٌ مِنْ أَهْلِ يَثْرِبَ مِنْ أَهْلِ الْمَدِينَةِ فَقُلْتُ مَا فَعَلَ هَذَا الرَّجُلُ الَّذِي قَدِمَ الْمَدِينَةَ فَقَالُوا النَّاسُ إِلَيْهِ سِرَاعٌ وَقَدْ أَرَادَ قَوْمُهُ قَتْلَهُ فَلَمْ يَسْتَطِيعُوا ذَلِكَ ‏.‏ فَقَدِمْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَعْرِفُنِي قَالَ ‏\"‏ نَعَمْ أَنْتَ الَّذِي لَقِيتَنِي بِمَكَّةَ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ بَلَى ‏.‏ فَقُلْتُ يَا نَبِيَّ اللَّهِ أَخْبِرْنِي عَمَّا عَلَّمَكَ اللَّهُ وَأَجْهَلُهُ ‏.‏ أَخْبِرْنِي عَنِ الصَّلاَةِ قَالَ ‏\"‏ صَلِّ صَلاَةَ الصُّبْحِ ثُمَّ أَقْصِرْ عَنِ الصَّلاَةِ حَتَّى تَطْلُعَ الشَّمْسُ حَتَّى تَرْتَفِعَ فَإِنَّهَا تَطْلُعُ حِينَ تَطْلُعُ بَيْنَ قَرْنَىْ شَيْطَانٍ وَحِينَئِذٍ يَسْجُدُ لَهَا الْكُفَّارُ ثُمَّ صَلِّ فَإِنَّ الصَّلاَةَ مَشْهُودَةٌ مَحْضُورَةٌ حَتَّى يَسْتَقِلَّ الظِّلُّ بِالرُّمْحِ ثُمَّ أَقْصِرْ عَنِ الصَّلاَةِ فَإِنَّ حِينَئِذٍ تُسْجَرُ جَهَنَّمُ فَإِذَا أَقْبَلَ الْفَىْءُ فَصَلِّ فَإِنَّ الصَّلاَةَ مَشْهُودَةٌ مَحْضُورَةٌ حَتَّى تُصَلِّيَ الْعَصْرَ ثُمَّ أَقْصِرْ عَنِ الصَّلاَةِ حَتَّى تَغْرُبَ الشَّمْسُ فَإِنَّهَا تَغْرُبُ بَيْنَ قَرْنَىْ شَيْطَانٍ وَحِينَئِذٍ يَسْجُدُ لَهَا الْكُفَّارُ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ يَا نَبِيَّ اللَّهِ فَالْوُضُوءُ حَدِّثْنِي عَنْهُ قَالَ ‏\"‏ مَا مِنْكُمْ رَجُلٌ يُقَرِّبُ وَضُوءَهُ فَيَتَمَضْمَضُ وَيَسْتَنْشِقُ فَيَنْتَثِرُ إِلاَّ خَرَّتْ خَطَايَا وَجْهِهِ وَفِيهِ وَخَيَاشِيمِهِ ثُمَّ إِذَا غَسَلَ وَجْهَهُ كَمَا أَمَرَهُ اللَّهُ إِلاَّ خَرَّتْ خَطَايَا وَجْهِهِ مِنْ أَطْرَافِ لِحْيَتِهِ مَعَ الْمَاءِ ثُمَّ يَغْسِلُ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ إِلاَّ خَرَّتْ خَطَايَا يَدَيْهِ مِنْ أَنَامِلِهِ مَعَ الْمَاءِ ثُمَّ يَمْسَحُ رَأْسَهُ إِلاَّ خَرَّتْ خَطَايَا رَأْسِهِ مِنْ أَطْرَافِ شَعْرِهِ مَعَ الْمَاءِ ثُمَّ يَغْسِلُ قَدَمَيْهِ إِلَى الْكَعْبَيْنِ إِلاَّ خَرَّتْ خَطَايَا رِجْلَيْهِ مِنْ أَنَامِلِهِ مَعَ الْمَاءِ فَإِنْ هُوَ قَامَ فَصَلَّى فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَمَجَّدَهُ بِالَّذِي هُوَ لَهُ أَهْلٌ وَفَرَّغَ قَلْبَهُ لِلَّهِ إِلاَّ انْصَرَفَ مِنْ خَطِيئَتِهِ كَهَيْئَتِهِ يَوْمَ وَلَدَتْهُ أُمُّهُ ‏\"‏ ‏.‏ فَحَدَّثَ عَمْرُو بْنُ عَبَسَةَ بِهَذَا الْحَدِيثِ أَبَا أُمَامَةَ صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ أَبُو أُمَامَةَ يَا عَمْرَو بْنَ عَبَسَةَ انْظُرْ مَا تَقُولُ فِي مَقَامٍ وَاحِدٍ يُعْطَى هَذَا الرَّجُلُ فَقَالَ عَمْرٌو يَا أَبَا أُمَامَةَ لَقَدْ كَبِرَتْ سِنِّي وَرَقَّ عَظْمِي وَاقْتَرَبَ أَجَلِي وَمَا بِي حَاجَةٌ أَنْ أَكْذِبَ عَلَى اللَّهِ وَلاَ عَلَى رَسُولِ اللَّهِ لَوْ لَمْ أَسْمَعْهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ مَرَّةً أَوْ مَرَّتَيْنِ أَوْ ثَلاَثًا - حَتَّى عَدَّ سَبْعَ مَرَّاتٍ - مَا حَدَّثْتُ بِهِ أَبَدًا وَلَكِنِّي سَمِعْتُهُ أَكْثَرَ مِنْ ذَلِكَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 358
			}
		}
	]
}