{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2256,
			"arabicnumber": "974.02",
			"text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرِ بْنِ الْمُطَّلِبِ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ قَيْسٍ، يَقُولُ سَمِعْتُ عَائِشَةَ، تُحَدِّثُ فَقَالَتْ أَلاَ أُحَدِّثُكُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم وَعَنِّي ‏.‏ قُلْنَا بَلَى ح. وَحَدَّثَنِي مَنْ، سَمِعَ حَجَّاجًا الأَعْوَرَ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ اللَّهِ، - رَجُلٌ مِنْ قُرَيْشٍ - عَنْ مُحَمَّدِ بْنِ قَيْسِ بْنِ مَخْرَمَةَ، بْنِ الْمُطَّلِبِ أَنَّهُ قَالَ يَوْمًا أَلاَ أُحَدِّثُكُمْ عَنِّي وَعَنْ أُمِّي قَالَ فَظَنَنَّا أَنَّهُ يُرِيدُ أُمَّهُ الَّتِي وَلَدَتْهُ ‏.‏ قَالَ قَالَتْ عَائِشَةُ أَلاَ أُحَدِّثُكُمْ عَنِّي وَعَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قُلْنَا بَلَى ‏.‏ قَالَ قَالَتْ لَمَّا كَانَتْ لَيْلَتِيَ الَّتِي كَانَ النَّبِيُّ صلى الله عليه وسلم فِيهَا عِنْدِي انْقَلَبَ فَوَضَعَ رِدَاءَهُ وَخَلَعَ نَعْلَيْهِ فَوَضَعَهُمَا عِنْدَ رِجْلَيْهِ وَبَسَطَ طَرَفَ إِزَارِهِ عَلَى فِرَاشِهِ فَاضْطَجَعَ فَلَمْ يَلْبَثْ إِلاَّ رَيْثَمَا ظَنَّ أَنْ قَدْ رَقَدْتُ فَأَخَذَ رِدَاءَهُ رُوَيْدًا وَانْتَعَلَ رُوَيْدًا وَفَتَحَ الْبَابَ فَخَرَجَ ثُمَّ أَجَافَهُ رُوَيْدًا فَجَعَلْتُ دِرْعِي فِي رَأْسِي وَاخْتَمَرْتُ وَتَقَنَّعْتُ إِزَارِي ثُمَّ انْطَلَقْتُ عَلَى إِثْرِهِ حَتَّى جَاءَ الْبَقِيعَ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَفَعَ يَدَيْهِ ثَلاَثَ مَرَّاتٍ ثُمَّ انْحَرَفَ فَانْحَرَفْتُ فَأَسْرَعَ فَأَسْرَعْتُ فَهَرْوَلَ فَهَرْوَلْتُ فَأَحْضَرَ فَأَحْضَرْتُ فَسَبَقْتُهُ فَدَخَلْتُ فَلَيْسَ إِلاَّ أَنِ اضْطَجَعْتُ فَدَخَلَ فَقَالَ ‏\"‏ مَا لَكِ يَا عَائِشُ حَشْيَا رَابِيَةً ‏\"‏ ‏.‏ قَالَتْ قُلْتُ لاَ شَىْءَ ‏.‏ قَالَ ‏\"‏ لَتُخْبِرِينِي أَوْ لَيُخْبِرَنِّي اللَّطِيفُ الْخَبِيرُ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي ‏.‏ فَأَخْبَرْتُهُ قَالَ ‏\"‏ فَأَنْتِ السَّوَادُ الَّذِي رَأَيْتُ أَمَامِي ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ فَلَهَدَنِي فِي صَدْرِي لَهْدَةً أَوْجَعَتْنِي ثُمَّ قَالَ ‏\"‏ أَظَنَنْتِ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ ‏\"‏ ‏.‏ قَالَتْ مَهْمَا يَكْتُمِ النَّاسُ يَعْلَمْهُ اللَّهُ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَإِنَّ جِبْرِيلَ أَتَانِي حِينَ رَأَيْتِ فَنَادَانِي فَأَخْفَاهُ مِنْكِ فَأَجَبْتُهُ فَأَخْفَيْتُهُ مِنْكِ وَلَمْ يَكُنْ يَدْخُلُ عَلَيْكِ وَقَدْ وَضَعْتِ ثِيَابَكِ وَظَنَنْتُ أَنْ قَدْ رَقَدْتِ فَكَرِهْتُ أَنْ أُوقِظَكِ وَخَشِيتُ أَنْ تَسْتَوْحِشِي فَقَالَ إِنَّ رَبَّكَ يَأْمُرُكَ أَنْ تَأْتِيَ أَهْلَ الْبَقِيعِ فَتَسْتَغْفِرَ لَهُمْ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ كَيْفَ أَقُولُ لَهُمْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ قُولِي السَّلاَمُ عَلَى أَهْلِ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَيَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَلاَحِقُونَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		}
	]
}