{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2292,
			"arabicnumber": "987.03",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الأُمَوِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا سُهَيْلُ، بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ صَاحِبِ كَنْزٍ لاَ يُؤَدِّي زَكَاتَهُ إِلاَّ أُحْمِيَ عَلَيْهِ فِي نَارِ جَهَنَّمَ فَيُجْعَلُ صَفَائِحَ فَيُكْوَى بِهَا جَنْبَاهُ وَجَبِينُهُ حَتَّى يَحْكُمَ اللَّهُ بَيْنَ عِبَادِهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ ثُمَّ يُرَى سَبِيلَهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ وَمَا مِنْ صَاحِبِ إِبِلٍ لاَ يُؤَدِّي زَكَاتَهَا إِلاَّ بُطِحَ لَهَا بِقَاعٍ قَرْقَرٍ كَأَوْفَرِ مَا كَانَتْ تَسْتَنُّ عَلَيْهِ كُلَّمَا مَضَى عَلَيْهِ أُخْرَاهَا رُدَّتْ عَلَيْهِ أُولاَهَا حَتَّى يَحْكُمَ اللَّهُ بَيْنَ عِبَادِهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ ثُمَّ يُرَى سَبِيلَهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ وَمَا مِنْ صَاحِبِ غَنَمٍ لاَ يُؤَدِّي زَكَاتَهَا إِلاَّ بُطِحَ لَهَا بِقَاعٍ قَرْقَرٍ كَأَوْفَرِ مَا كَانَتْ فَتَطَؤُهُ بِأَظْلاَفِهَا وَتَنْطِحُهُ بِقُرُونِهَا لَيْسَ فِيهَا عَقْصَاءُ وَلاَ جَلْحَاءُ كُلَّمَا مَضَى عَلَيْهِ أُخْرَاهَا رُدَّتْ عَلَيْهِ أُولاَهَا حَتَّى يَحْكُمَ اللَّهُ بَيْنَ عِبَادِهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ ثُمَّ يُرَى سَبِيلَهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ ‏\"‏ ‏.‏ قَالَ سُهَيْلٌ فَلاَ أَدْرِي أَذَكَرَ الْبَقَرَ أَمْ لاَ ‏.‏ قَالُوا فَالْخَيْلُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْخَيْلُ فِي نَوَاصِيهَا - أَوْ قَالَ - الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا - قَالَ سُهَيْلٌ أَنَا أَشُكُّ - الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْخَيْلُ ثَلاَثَةٌ فَهْىَ لِرَجُلٍ أَجْرٌ وَلِرَجُلٍ سِتْرٌ وَلِرَجُلٍ وِزْرٌ فَأَمَّا الَّتِي هِيَ لَهُ أَجْرٌ فَالرَّجُلُ يَتَّخِذُهَا فِي سَبِيلِ اللَّهِ وَيُعِدُّهَا لَهُ فَلاَ تُغَيِّبُ شَيْئًا فِي بُطُونِهَا إِلاَّ كَتَبَ اللَّهُ لَهُ أَجْرًا وَلَوْ رَعَاهَا فِي مَرْجٍ مَا أَكَلَتْ مِنْ شَىْءٍ إِلاَّ كَتَبَ اللَّهُ لَهُ بِهَا أَجْرًا وَلَوْ سَقَاهَا مِنْ نَهْرٍ كَانَ لَهُ بِكُلِّ قَطْرَةٍ تُغَيِّبُهَا فِي بُطُونِهَا أَجْرٌ - حَتَّى ذَكَرَ الأَجْرَ فِي أَبْوَالِهَا وَأَرْوَاثِهَا - وَلَوِ اسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كُتِبَ لَهُ بِكُلِّ خَطْوَةٍ تَخْطُوهَا أَجْرٌ وَأَمَّا الَّذِي هِيَ لَهُ سِتْرٌ فَالرَّجُلُ يَتَّخِذُهَا تَكَرُّمًا وَتَجَمُّلاً وَلاَ يَنْسَى حَقَّ ظُهُورِهَا وَبُطُونِهَا فِي عُسْرِهَا وَيُسْرِهَا وَأَمَّا الَّذِي عَلَيْهِ وِزْرٌ فَالَّذِي يَتَّخِذُهَا أَشَرًا وَبَطَرًا وَبَذَخًا وَرِيَاءَ النَّاسِ فَذَاكَ الَّذِي هِيَ عَلَيْهِ وِزْرٌ ‏\"‏ ‏.‏ قَالُوا فَالْحُمُرُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ مَا أَنْزَلَ اللَّهُ عَلَىَّ فِيهَا شَيْئًا إِلاَّ هَذِهِ الآيَةَ الْجَامِعَةَ الْفَاذَّةَ ‏{‏ فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ * وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ‏}‏ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		}
	]
}