{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2467,
			"arabicnumber": "1066.06",
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ، حَدَّثَنِي زَيْدُ بْنُ وَهْبٍ الْجُهَنِيُّ، أَنَّهُ كَانَ فِي الْجَيْشِ الَّذِينَ كَانُوا مَعَ عَلِيٍّ - رضى الله عنه - الَّذِينَ سَارُوا إِلَى الْخَوَارِجِ فَقَالَ عَلِيٌّ رضى الله عنه أَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَخْرُجُ قَوْمٌ مِنْ أُمَّتِي يَقْرَءُونَ الْقُرْآنَ لَيْسَ قِرَاءَتُكُمْ إِلَى قِرَاءَتِهِمْ بِشَىْءٍ وَلاَ صَلاَتُكُمْ إِلَى صَلاَتِهِمْ بِشَىْءٍ وَلاَ صِيَامُكُمْ إِلَى صِيَامِهِمْ بِشَىْءٍ يَقْرَءُونَ الْقُرْآنَ يَحْسِبُونَ أَنَّهُ لَهُمْ وَهُوَ عَلَيْهِمْ لاَ تُجَاوِزُ صَلاَتُهُمْ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ ‏\"‏ ‏.‏ لَوْ يَعْلَمُ الْجَيْشُ الَّذِينَ يُصِيبُونَهُمْ مَا قُضِيَ لَهُمْ عَلَى لِسَانِ نَبِيِّهِمْ صلى الله عليه وسلم لاَتَّكَلُوا عَنِ الْعَمَلِ وَآيَةُ ذَلِكَ أَنَّ فِيهِمْ رَجُلاً لَهُ عَضُدٌ وَلَيْسَ لَهُ ذِرَاعٌ عَلَى رَأْسِ عَضُدِهِ مِثْلُ حَلَمَةِ الثَّدْىِ عَلَيْهِ شَعَرَاتٌ بِيضٌ فَتَذْهَبُونَ إِلَى مُعَاوِيَةَ وَأَهْلِ الشَّامِ وَتَتْرُكُونَ هَؤُلاَءِ يَخْلُفُونَكُمْ فِي ذَرَارِيِّكُمْ وَأَمْوَالِكُمْ وَاللَّهِ إِنِّي لأَرْجُو أَنْ يَكُونُوا هَؤُلاَءِ الْقَوْمَ فَإِنَّهُمْ قَدْ سَفَكُوا الدَّمَ الْحَرَامَ وَأَغَارُوا فِي سَرْحِ النَّاسِ فَسِيرُوا عَلَى اسْمِ اللَّهِ ‏.‏ قَالَ سَلَمَةُ بْنُ كُهَيْلٍ فَنَزَّلَنِي زَيْدُ بْنُ وَهْبٍ مَنْزِلاً حَتَّى قَالَ مَرَرْنَا عَلَى قَنْطَرَةٍ فَلَمَّا الْتَقَيْنَا وَعَلَى الْخَوَارِجِ يَوْمَئِذٍ عَبْدُ اللَّهِ بْنُ وَهْبٍ الرَّاسِبِيُّ فَقَالَ لَهُمْ أَلْقُوا الرِّمَاحَ وَسُلُّوا سُيُوفَكُمْ مِنْ جُفُونِهَا فَإِنِّي أَخَافُ أَنْ يُنَاشِدُوكُمْ كَمَا نَاشَدُوكُمْ يَوْمَ حَرُورَاءَ ‏.‏ فَرَجَعُوا فَوَحَّشُوا بِرِمَاحِهِمْ وَسَلُّوا السُّيُوفَ وَشَجَرَهُمُ النَّاسُ بِرِمَاحِهِمْ - قَالَ - وَقُتِلَ بَعْضُهُمْ عَلَى بَعْضٍ وَمَا أُصِيبَ مِنَ النَّاسِ يَوْمَئِذٍ إِلاَّ رَجُلاَنِ فَقَالَ عَلِيٌّ رضى الله عنه الْتَمِسُوا فِيهِمُ الْمُخْدَجَ ‏.‏ فَالْتَمَسُوهُ فَلَمْ يَجِدُوهُ فَقَامَ عَلِيٌّ - رضى الله عنه - بِنَفْسِهِ حَتَّى أَتَى نَاسًا قَدْ قُتِلَ بَعْضُهُمْ عَلَى بَعْضٍ قَالَ أَخِّرُوهُمْ ‏.‏ فَوَجَدُوهُ مِمَّا يَلِي الأَرْضَ فَكَبَّرَ ثُمَّ قَالَ صَدَقَ اللَّهُ وَبَلَّغَ رَسُولُهُ - قَالَ - فَقَامَ إِلَيْهِ عَبِيدَةُ السَّلْمَانِيُّ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ اللَّهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ لَسَمِعْتَ هَذَا الْحَدِيثَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِي وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ ‏.‏ حَتَّى اسْتَحْلَفَهُ ثَلاَثًا وَهُوَ يَحْلِفُ لَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 204
			}
		}
	]
}