{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 279,
			"arabicnumber": "97",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، أَنَّ خَالِدًا الأَثْبَجَ ابْنَ أَخِي، صَفْوَانَ بْنِ مُحْرِزٍ حَدَّثَ عَنْ صَفْوَانَ بْنِ مُحْرِزٍ، أَنَّهُ حَدَّثَ أَنَّ جُنْدَبَ بْنَ عَبْدِ اللَّهِ الْبَجَلِيَّ بَعَثَ إِلَى عَسْعَسِ بْنِ سَلاَمَةَ زَمَنَ فِتْنَةِ ابْنِ الزُّبَيْرِ فَقَالَ اجْمَعْ لِي نَفَرًا مِنْ إِخْوَانِكَ حَتَّى أُحَدِّثَهُمْ ‏.‏ فَبَعَثَ رَسُولاً إِلَيْهِمْ فَلَمَّا اجْتَمَعُوا جَاءَ جُنْدَبٌ وَعَلَيْهِ بُرْنُسٌ أَصْفَرُ فَقَالَ تَحَدَّثُوا بِمَا كُنْتُمْ تَحَدَّثُونَ بِهِ ‏.‏ حَتَّى دَارَ الْحَدِيثُ فَلَمَّا دَارَ الْحَدِيثُ إِلَيْهِ حَسَرَ الْبُرْنُسَ عَنْ رَأْسِهِ فَقَالَ إِنِّي أَتَيْتُكُمْ وَلاَ أُرِيدُ أَنْ أُخْبِرَكُمْ عَنْ نَبِيِّكُمْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بَعْثًا مِنَ الْمُسْلِمِينَ إِلَى قَوْمٍ مِنَ الْمُشْرِكِينَ وَإِنَّهُمُ الْتَقَوْا فَكَانَ رَجُلٌ مِنَ الْمُشْرِكِينَ إِذَا شَاءَ أَنْ يَقْصِدَ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ قَصَدَ لَهُ فَقَتَلَهُ وَإِنَّ رَجُلاً مِنَ الْمُسْلِمِينَ قَصَدَ غَفْلَتَهُ قَالَ وَكُنَّا نُحَدَّثُ أَنَّهُ أُسَامَةُ بْنُ زَيْدٍ فَلَمَّا رَفَعَ عَلَيْهِ السَّيْفَ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ فَقَتَلَهُ فَجَاءَ الْبَشِيرُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَأَلَهُ فَأَخْبَرَهُ حَتَّى أَخْبَرَهُ خَبَرَ الرَّجُلِ كَيْفَ صَنَعَ فَدَعَاهُ فَسَأَلَهُ فَقَالَ ‏\"‏ لِمَ قَتَلْتَهُ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهَ أَوْجَعَ فِي الْمُسْلِمِينَ وَقَتَلَ فُلاَنًا وَفُلاَنًا - وَسَمَّى لَهُ نَفَرًا - وَإِنِّي حَمَلْتُ عَلَيْهِ فَلَمَّا رَأَى السَّيْفَ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَقَتَلْتَهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَكَيْفَ تَصْنَعُ بِلاَ إِلَهَ إِلاَّ اللَّهُ إِذَا جَاءَتْ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي ‏.‏ قَالَ ‏\"‏ وَكَيْفَ تَصْنَعُ بِلاَ إِلَهَ إِلاَّ اللَّهُ إِذَا جَاءَتْ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ فَجَعَلَ لاَ يَزِيدُهُ عَلَى أَنْ يَقُولَ ‏\"‏ كَيْفَ تَصْنَعُ بِلاَ إِلَهَ إِلاَّ اللَّهُ إِذَا جَاءَتْ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 185
			}
		}
	]
}