{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3679,
			"arabicnumber": "1474.02",
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ فَكَانَ إِذَا صَلَّى الْعَصْرَ دَارَ عَلَى نِسَائِهِ فَيَدْنُو مِنْهُنَّ فَدَخَلَ عَلَى حَفْصَةَ فَاحْتَبَسَ عِنْدَهَا أَكْثَرَ مِمَّا كَانَ يَحْتَبِسُ فَسَأَلْتُ عَنْ ذَلِكَ فَقِيلَ لِي أَهْدَتْ لَهَا امْرَأَةٌ مِنْ قَوْمِهَا عُكَّةً مِنْ عَسَلٍ فَسَقَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْهُ شَرْبَةً فَقُلْتُ أَمَا وَاللَّهِ لَنَحْتَالَنَّ لَهُ ‏.‏ فَذَكَرْتُ ذَلِكَ لِسَوْدَةَ وَقُلْتُ إِذَا دَخَلَ عَلَيْكِ فَإِنَّهُ سَيَدْنُو مِنْكِ فَقُولِي لَهُ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ فَإِنَّهُ سَيَقُولُ لَكِ لاَ ‏.‏ فَقُولِي لَهُ مَا هَذِهِ الرِّيحُ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَشْتَدُّ عَلَيْهِ أَنْ يُوجَدَ مِنْهُ الرِّيحُ - فَإِنَّهُ سَيَقُولُ لَكِ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ ‏.‏ فَقُولِي لَهُ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ وَسَأَقُولُ ذَلِكَ لَهُ وَقُولِيهِ أَنْتِ يَا صَفِيَّةُ فَلَمَّا دَخَلَ عَلَى سَوْدَةَ قَالَتْ تَقُولُ سَوْدَةُ وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ لَقَدْ كِدْتُ أَنْ أُبَادِئَهُ بِالَّذِي قُلْتِ لِي وَإِنَّهُ لَعَلَى الْبَابِ فَرَقًا مِنْكِ فَلَمَّا دَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ قَالَتْ فَمَا هَذِهِ الرِّيحُ قَالَ ‏\"‏ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ ‏\"‏ ‏.‏ قَالَتْ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ ‏.‏ فَلَمَّا دَخَلَ عَلَىَّ قُلْتُ لَهُ مِثْلَ ذَلِكَ ثُمَّ دَخَلَ عَلَى صَفِيَّةَ فَقَالَتْ بِمِثْلِ ذَلِكَ فَلَمَّا دَخَلَ عَلَى حَفْصَةَ قَالَتْ يَا رَسُولَ اللَّهِ أَلاَ أَسْقِيكَ مِنْهُ قَالَ ‏\"‏ لاَ حَاجَةَ لِي بِهِ ‏\"‏ ‏.‏ قَالَتْ تَقُولُ سَوْدَةُ سُبْحَانَ اللَّهِ وَاللَّهِ لَقَدْ حَرَمْنَاهُ ‏.‏ قَالَتْ قُلْتُ لَهَا اسْكُتِي ‏.‏",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 28
			}
		}
	]
}