{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3695,
			"text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، - وَتَقَارَبَا فِي لَفْظِ الْحَدِيثِ - قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمْ أَزَلْ حَرِيصًا أَنْأَسْأَلَ عُمَرَ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَيْنِ قَالَ اللَّهُ تَعَالَى ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ حَتَّى حَجَّ عُمَرُ وَحَجَجْتُ مَعَهُ فَلَمَّا كُنَّا بِبَعْضِ الطَّرِيقِ عَدَلَ عُمَرُ وَعَدَلْتُ مَعَهُ بِالإِدَاوَةِ فَتَبَرَّزَ ثُمَّ أَتَانِي فَسَكَبْتُ عَلَى يَدَيْهِ فَتَوَضَّأَ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَانِ قَالَ اللَّهُ عَزَّ وَجَلَّ لَهُمَا ‏{‏ إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ قَالَ عُمَرُ وَاعَجَبًا لَكَ يَا ابْنَ عَبَّاسٍ - قَالَ الزُّهْرِيُّ كَرِهَ وَاللَّهِ مَا سَأَلَهُ عَنْهُ وَلَمْ يَكْتُمْهُ - قَالَ هِيَ حَفْصَةُ وَعَائِشَةُ ‏.‏ ثُمَّ أَخَذَ يَسُوقُ الْحَدِيثَ قَالَ كُنَّا مَعْشَرَ قُرَيْشٍ قَوْمًا نَغْلِبُ النِّسَاءَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ وَجَدْنَا قَوْمًا تَغْلِبُهُمْ نِسَاؤُهُمْ فَطَفِقَ نِسَاؤُنَا يَتَعَلَّمْنَ مِنْ نِسَائِهِمْ - قَالَ - وَكَانَ مَنْزِلِي فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ بِالْعَوَالِي فَتَغَضَّبْتُ يَوْمًا عَلَى امْرَأَتِي فَإِذَا هِيَ تُرَاجِعُنِي فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي ‏.‏ فَقَالَتْ مَا تُنْكِرُ أَنْ أُرَاجِعَكَ فَوَاللَّهِ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم لَيُرَاجِعْنَهُ وَتَهْجُرُهُ إِحْدَاهُنَّ الْيَوْمَ إِلَى اللَّيْلِ ‏.‏ فَانْطَلَقْتُ فَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ أَتُرَاجِعِينَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ نَعَمْ ‏.‏ فَقُلْتُ أَتَهْجُرُهُ إِحْدَاكُنَّ الْيَوْمَ إِلَى اللَّيْلِ قَالَتْ نَعَمْ ‏.‏ قُلْتُ قَدْ خَابَ مَنْ فَعَلَ ذَلِكَ مِنْكُنَّ وَخَسِرَ أَفَتَأْمَنُ إِحْدَاكُنَّ أَنْ يَغْضَبَ اللَّهُ عَلَيْهَا لِغَضَبِ رَسُولِهِ صلى الله عليه وسلم فَإِذَا هِيَ قَدْ هَلَكَتْ لاَ تُرَاجِعِي رَسُولَ اللَّهِ صلى الله عليه وسلم وَلاَ تَسْأَلِيهِ شَيْئًا وَسَلِينِي مَا بَدَا لَكِ وَلاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ هِيَ أَوْسَمَ وَأَحَبَّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْكِ - يُرِيدُ عَائِشَةَ - قَالَ وَكَانَ لِي جَارٌ مِنَ الأَنْصَارِ فَكُنَّا نَتَنَاوَبُ النُّزُولَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا فَيَأْتِينِي بِخَبَرِ الْوَحْىِ وَغَيْرِهِ وَآتِيهِ بِمِثْلِ ذَلِكَ وَكُنَّا نَتَحَدَّثُ أَنَّ غَسَّانَ تُنْعِلُ الْخَيْلَ لِتَغْزُوَنَا فَنَزَلَ صَاحِبِي ثُمَّ أَتَانِي عِشَاءً فَضَرَبَ بَابِي ثُمَّ نَادَانِي فَخَرَجْتُ إِلَيْهِ فَقَالَ حَدَثَ أَمْرٌ عَظِيمٌ ‏.‏ قُلْتُ مَاذَا أَجَاءَتْ غَسَّانُ قَالَ لاَ بَلْ أَعْظَمُ مِنْ ذَلِكَ وَأَطْوَلُ طَلَّقَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ ‏.‏ فَقُلْتُ قَدْ خَابَتْ حَفْصَةُ وَخَسِرَتْ قَدْ كُنْتُ أَظُنُّ هَذَا كَائِنًا حَتَّى إِذَا صَلَّيْتُ الصُّبْحَ شَدَدْتُ عَلَىَّ ثِيَابِي ثُمَّ نَزَلْتُ فَدَخَلْتُ عَلَى حَفْصَةَ وَهْىَ تَبْكِي فَقُلْتُ أَطَلَّقَكُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَتْ لاَ أَدْرِي هَا هُوَ ذَا مُعْتَزِلٌ فِي هَذِهِ الْمَشْرُبَةِ ‏.‏ فَأَتَيْتُ غُلاَمًا لَهُ أَسْوَدَ فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ ‏.‏ فَدَخَلَ ثُمَّ خَرَجَ إِلَىَّ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ فَانْطَلَقْتُ حَتَّى انْتَهَيْتُ إِلَى الْمِنْبَرِ فَجَلَسْتُ فَإِذَا عِنْدَهُ رَهْطٌ جُلُوسٌ يَبْكِي بَعْضُهُمْ فَجَلَسْتُ قَلِيلاً ثُمَّ غَلَبَنِي مَا أَجِدُ ثُمَّ أَتَيْتُ الْغُلاَمَ فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ ‏.‏ فَدَخَلَ ثُمَّ خَرَجَ إِلَىَّ ‏.‏ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ ‏.‏ فَوَلَّيْتُ مُدْبِرًا فَإِذَا الْغُلاَمُ يَدْعُونِي فَقَالَ ادْخُلْ فَقَدْ أَذِنَ لَكَ فَدَخَلْتُ فَسَلَّمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ مُتَّكِئٌ عَلَى رَمْلِ حَصِيرٍ قَدْ أَثَّرَ فِي جَنْبِهِ فَقُلْتُ أَطَلَّقْتَ يَا رَسُولَ اللَّهِ نِسَاءَكَ فَرَفَعَ رَأْسَهُ إِلَىَّ وَقَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ فَقُلْتُ اللَّهُ أَكْبَرُ لَوْ رَأَيْتَنَا يَا رَسُولَ اللَّهِ وَكُنَّا مَعْشَرَ قُرَيْشٍ قَوْمًا نَغْلِبُ النِّسَاءَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ وَجَدْنَا قَوْمًا تَغْلِبُهُمْ نِسَاؤُهُمْ فَطَفِقَ نِسَاؤُنَا يَتَعَلَّمْنَ مِنْ نِسَائِهِمْ فَتَغَضَّبْتُ عَلَى امْرَأَتِي يَوْمًا فَإِذَا هِيَ تُرَاجِعُنِي فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي ‏.‏ فَقَالَتْ مَا تُنْكِرُ أَنْ أُرَاجِعَكَ فَوَاللَّهِ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم لَيُرَاجِعْنَهُ وَتَهْجُرُهُ إِحْدَاهُنَّ الْيَوْمَ إِلَى اللَّيْلِ ‏.‏ فَقُلْتُ قَدْ خَابَ مَنْ فَعَلَ ذَلِكَ مِنْهُنَّ وَخَسِرَ أَفَتَأْمَنُ إِحْدَاهُنَّ أَنْ يَغْضَبَ اللَّهُ عَلَيْهَا لِغَضَبِ رَسُولِهِ صلى الله عليه وسلم فَإِذَا هِيَ قَدْ هَلَكَتْ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ دَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ لاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ هِيَ أَوْسَمُ مِنْكِ وَأَحَبُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْكِ ‏.‏ فَتَبَسَّمَ أُخْرَى فَقُلْتُ أَسْتَأْنِسُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ فَجَلَسْتُ فَرَفَعْتُ رَأْسِي فِي الْبَيْتِ فَوَاللَّهِ مَا رَأَيْتُ فِيهِ شَيْئًا يَرُدُّ الْبَصَرَ إِلاَّ أُهُبًا ثَلاَثَةً فَقُلْتُ ادْعُ اللَّهَ يَا رَسُولَ اللَّهِ أَنْ يُوَسِّعَ عَلَى أُمَّتِكَ فَقَدْ وَسَّعَ عَلَى فَارِسَ وَالرُّومِ وَهُمْ لاَ يَعْبُدُونَ اللَّهَ فَاسْتَوَى جَالِسًا ثُمَّ قَالَ ‏\"‏ أَفِي شَكٍّ أَنْتَ يَا ابْنَ الْخَطَّابِ أُولَئِكَ قَوْمٌ عُجِّلَتْ لَهُمْ طَيِّبَاتُهُمْ فِي الْحَيَاةِ الدُّنْيَا ‏\"‏ ‏.‏ فَقُلْتُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ ‏.‏ وَكَانَ أَقْسَمَ أَنْ لاَ يَدْخُلَ عَلَيْهِنَّ شَهْرًا مِنْ شِدَّةِ مَوْجِدَتِهِ عَلَيْهِنَّ ‏.‏ حَتَّى عَاتَبَهُ اللَّهُ عَزَّ وَجَلَّ ‏.‏ قَالَ الزُّهْرِيُّ فَأَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا مَضَى تِسْعٌ وَعِشْرُونَ لَيْلَةً دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بَدَأَ بِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ أَقْسَمْتَ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا وَإِنَّكَ دَخَلْتَ مِنْ تِسْعٍ وَعِشْرِينَ أَعُدُّهُنَّ ‏.‏ فَقَالَ ‏\"‏ إِنَّ الشَّهْرَ تِسْعٌ وَعِشْرُونَ - ثُمَّ قَالَ - يَا عَائِشَةُ إِنِّي ذَاكِرٌ لَكِ أَمْرًا فَلاَ عَلَيْكِ أَنْ لاَ تَعْجَلِي فِيهِ حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ عَلَىَّ الآيَةَ ‏{‏ يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ‏}‏ حَتَّى بَلَغَ ‏{‏ أَجْرًا عَظِيمًا‏}‏ قَالَتْ عَائِشَةُ قَدْ عَلِمَ وَاللَّهِ أَنَّ أَبَوَىَّ لَمْ يَكُونَا لِيَأْمُرَانِي بِفِرَاقِهِ قَالَتْ فَقُلْتُ أَوَفِي هَذَا أَسْتَأْمِرُ أَبَوَىَّ فَإِنِّي أُرِيدُ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ ‏.‏ قَالَ مَعْمَرٌ فَأَخْبَرَنِي أَيُّوبُ أَنَّ عَائِشَةَ قَالَتْ لاَ تُخْبِرْ نِسَاءَكَ أَنِّي اخْتَرْتُكَ فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ أَرْسَلَنِي مُبَلِّغًا وَلَمْ يُرْسِلْنِي مُتَعَنِّتًا ‏\"‏ ‏.‏ قَالَ قَتَادَةُ صَغَتْ قُلُوبُكُمَا مَالَتْ قُلُوبُكُمَا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}