{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4100,
			"arabicnumber": "715.15",
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَلاَحَقَ بِي وَتَحْتِي نَاضِحٌ لِي قَدْ أَعْيَا وَلاَ يَكَادُ يَسِيرُ قَالَ فَقَالَ لِي ‏\"‏ مَا لِبَعِيرِكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ عَلِيلٌ - قَالَ - فَتَخَلَّفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَزَجَرَهُ وَدَعَا لَهُ فَمَازَالَ بَيْنَ يَدَىِ الإِبِلِ قُدَّامَهَا يَسِيرُ ‏.‏ قَالَ فَقَالَ لِي ‏\"‏ كَيْفَ تَرَى بَعِيرَكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ بِخَيْرٍ قَدْ أَصَابَتْهُ بَرَكَتُكَ ‏.‏ قَالَ ‏\"‏ أَفَتَبِيعُنِيهِ ‏\"‏ ‏.‏ فَاسْتَحْيَيْتُ وَلَمْ يَكُنْ لَنَا نَاضِحٌ غَيْرُهُ قَالَ فَقُلْتُ نَعَمْ ‏.‏ فَبِعْتُهُ إِيَّاهُ عَلَى أَنَّ لِي فَقَارَ ظَهْرِهِ حَتَّى أَبْلُغَ الْمَدِينَةَ - قَالَ - فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ إِنِّي عَرُوسٌ فَاسْتَأْذَنْتُهُ فَأَذِنَ لِي فَتَقَدَّمْتُ النَّاسَ إِلَى الْمَدِينَةِ حَتَّى انْتَهَيْتُ فَلَقِيَنِي خَالِي فَسَأَلَنِي عَنِ الْبَعِيرِ فَأَخْبَرْتُهُ بِمَا صَنَعْتُ فِيهِ فَلاَمَنِي فِيهِ - قَالَ - وَقَدْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ لِي حِينَ اسْتَأْذَنْتُهُ ‏\"‏ مَا تَزَوَّجْتَ أَبِكْرًا أَمْ ثَيِّبًا ‏\"‏ ‏.‏ فَقُلْتُ لَهُ تَزَوَّجْتُ ثَيِّبًا ‏.‏ قَالَ ‏\"‏ أَفَلاَ تَزَوَّجْتَ بِكْرًا تُلاَعِبُكَ وَتُلاَعِبُهَا ‏\"‏ ‏.‏ فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ تُوُفِّيَ وَالِدِي - أَوِ اسْتُشْهِدَ - وَلِي أَخَوَاتٌ صِغَارٌ فَكَرِهْتُ أَنْ أَتَزَوَّجَ إِلَيْهِنَّ مِثْلَهُنَّ فَلاَ تُؤَدِّبُهُنَّ وَلاَ تَقُومُ عَلَيْهِنَّ فَتَزَوَّجْتُ ثَيِّبًا لِتَقُومَ عَلَيْهِنَّ وَتُؤَدِّبَهُنَّ - قَالَ - فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ غَدَوْتُ إِلَيْهِ بِالْبَعِيرِ فَأَعْطَانِي ثَمَنَهُ وَرَدَّهُ عَلَىَّ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 139
			}
		}
	]
}