{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4431,
			"arabicnumber": "1695.01",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، حَدَّثَنَا يَحْيَى بْنُ يَعْلَى، - وَهُوَ ابْنُ الْحَارِثِ الْمُحَارِبِيُّ - عَنْ غَيْلاَنَ، - وَهُوَ ابْنُ جَامِعٍ الْمُحَارِبِيُّ - عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ، بْنِ بُرَيْدَةَ عَنْ أَبِيهِ، قَالَ جَاءَ مَاعِزُ بْنُ مَالِكٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِي ‏.‏ فَقَالَ ‏\"‏ وَيْحَكَ ارْجِعْ فَاسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ ‏\"‏ ‏.‏ قَالَ فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَيْحَكَ ارْجِعْ فَاسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ ‏\"‏ ‏.‏ قَالَ فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِي ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم مِثْلَ ذَلِكَ حَتَّى إِذَا كَانَتِ الرَّابِعَةُ قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِيمَ أُطَهِّرُكَ ‏\"‏ ‏.‏ فَقَالَ مِنَ الزِّنَى ‏.‏ فَسَأَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَبِهِ جُنُونٌ ‏\"‏ ‏.‏ فَأُخْبِرَ أَنَّهُ لَيْسَ بِمَجْنُونٍ ‏.‏ فَقَالَ ‏\"‏ أَشَرِبَ خَمْرًا ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَاسْتَنْكَهَهُ فَلَمْ يَجِدْ مِنْهُ رِيحَ خَمْرٍ ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَزَنَيْتَ ‏\"‏ ‏.‏ فَقَالَ نَعَمْ ‏.‏ فَأَمَرَ بِهِ فَرُجِمَ فَكَانَ النَّاسُ فِيهِ فِرْقَتَيْنِ قَائِلٌ يَقُولُ لَقَدْ هَلَكَ لَقَدْ أَحَاطَتْ بِهِ خَطِيئَتُهُ وَقَائِلٌ يَقُولُ مَا تَوْبَةٌ أَفْضَلَ مِنْ تَوْبَةِ مَاعِزٍ أَنَّهُ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَوَضَعَ يَدَهُ فِي يَدِهِ ثُمَّ قَالَ اقْتُلْنِي بِالْحِجَارَةِ - قَالَ - فَلَبِثُوا بِذَلِكَ يَوْمَيْنِ أَوْ ثَلاَثَةً ثُمَّ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُمْ جُلُوسٌ فَسَلَّمَ ثُمَّ جَلَسَ فَقَالَ ‏\"‏ اسْتَغْفِرُوا لِمَاعِزِ بْنِ مَالِكٍ ‏\"‏ ‏.‏ قَالَ فَقَالُوا غَفَرَ اللَّهُ لِمَاعِزِ بْنِ مَالِكٍ ‏.‏ - قَالَ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدْ تَابَ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ أُمَّةٍ لَوَسِعَتْهُمْ ‏\"‏ ‏.‏ قَالَ ثُمَّ جَاءَتْهُ امْرَأَةٌ مِنْ غَامِدٍ مِنَ الأَزْدِ فَقَالَتْ يَا رَسُولَ اللَّهِ طَهِّرْنِي ‏.‏ فَقَالَ ‏\"‏ وَيْحَكِ ارْجِعِي فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ ‏\"‏ ‏.‏ فَقَالَتْ أَرَاكَ تُرِيدُ أَنْ تُرَدِّدَنِي كَمَا رَدَّدْتَ مَاعِزَ بْنَ مَالِكٍ ‏.‏ قَالَ ‏\"‏ وَمَا ذَاكِ ‏\"‏ ‏.‏ قَالَتْ إِنَّهَا حُبْلَى مِنَ الزِّنَا ‏.‏ فَقَالَ ‏\"‏ آنْتِ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ فَقَالَ لَهَا ‏\"‏ حَتَّى تَضَعِي مَا فِي بَطْنِكِ ‏\"‏ ‏.‏ قَالَ فَكَفَلَهَا رَجُلٌ مِنَ الأَنْصَارِ حَتَّى وَضَعَتْ قَالَ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ قَدْ وَضَعَتِ الْغَامِدِيَّةُ ‏.‏ فَقَالَ ‏\"‏ إِذًا لاَ نَرْجُمَهَا وَنَدَعَ وَلَدَهَا صَغِيرًا لَيْسَ لَهُ مَنْ يُرْضِعُهُ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ إِلَىَّ رَضَاعُهُ يَا نَبِيَّ اللَّهِ ‏.‏ قَالَ فَرَجَمَهَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 34
			}
		}
	]
}