{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4440,
			"arabicnumber": "1700.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ كِلاَهُمَا عَنْ أَبِي مُعَاوِيَةَ، قَالَ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ مُرَّ عَلَى النَّبِيِّ صلى الله عليه وسلم بِيَهُودِيٍّ مُحَمَّمًا مَجْلُودًا فَدَعَاهُمْ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَكَذَا تَجِدُونَ حَدَّ الزَّانِي فِي كِتَابِكُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَدَعَا رَجُلاً مِنْ عُلَمَائِهِمْ فَقَالَ ‏\"‏ أَنْشُدُكَ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى أَهَكَذَا تَجِدُونَ حَدَّ الزَّانِي فِي كِتَابِكُمْ ‏\"‏ ‏.‏ قَالَ لاَ وَلَوْلاَ أَنَّكَ نَشَدْتَنِي بِهَذَا لَمْ أُخْبِرْكَ نَجِدُهُ الرَّجْمَ وَلَكِنَّهُ كَثُرَ فِي أَشْرَافِنَا فَكُنَّا إِذَا أَخَذْنَا الشَّرِيفَ تَرَكْنَاهُ وَإِذَا أَخَذْنَا الضَّعِيفَ أَقَمْنَا عَلَيْهِ الْحَدَّ قُلْنَا تَعَالَوْا فَلْنَجْتَمِعْ عَلَى شَىْءٍ نُقِيمُهُ عَلَى الشَّرِيفِ وَالْوَضِيعِ فَجَعَلْنَا التَّحْمِيمَ وَالْجَلْدَ مَكَانَ الرَّجْمِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ إِنِّي أَوَّلُ مَنْ أَحْيَا أَمْرَكَ إِذْ أَمَاتُوهُ ‏\"‏ ‏.‏ فَأَمَرَ بِهِ فَرُجِمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ يَا أَيُّهَا الرَّسُولُ لاَ يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ‏}‏ إِلَى قَوْلِهِ ‏{‏ إِنْ أُوتِيتُمْ هَذَا فَخُذُوهُ‏}‏ يَقُولُ ائْتُوا مُحَمَّدًا صلى الله عليه وسلم فَإِنْ أَمَرَكُمْ بِالتَّحْمِيمِ وَالْجَلْدِ فَخُذُوهُ وَإِنْ أَفْتَاكُمْ بِالرَّجْمِ فَاحْذَرُوا ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْكَافِرُونَ‏}‏ ‏{‏ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الظَّالِمُونَ‏}‏ ‏{‏ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْفَاسِقُونَ‏}‏ فِي الْكُفَّارِ كُلُّهَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 43
			}
		}
	]
}