{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 475,
			"arabicnumber": "193.01",
			"text": "حَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَجْمَعُ اللَّهُ النَّاسَ يَوْمَ الْقِيَامَةِ فَيَهْتَمُّونَ لِذَلِكَ - وَقَالَ ابْنُ عُبَيْدٍ فَيُلْهَمُونَ لِذَلِكَ - فَيَقُولُونَ لَوِ اسْتَشْفَعْنَا عَلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا - قَالَ - فَيَأْتُونَ آدَمَ صلى الله عليه وسلم فَيَقُولُونَ أَنْتَ آدَمُ أَبُو الْخَلْقِ خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ وَأَمَرَ الْمَلاَئِكَةَ فَسَجَدُوا لَكَ اشْفَعْ لَنَا عِنْدَ رَبِّكَ حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا ‏.‏ فَيَقُولُ لَسْتُ هُنَاكُمْ - فَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ فَيَسْتَحْيِي رَبَّهُ مِنْهَا - وَلَكِنِ ائْتُوا نُوحًا أَوَّلَ رَسُولٍ بَعَثَهُ اللَّهُ - قَالَ - فَيَأْتُونَ نُوحًا صلى الله عليه وسلم فَيَقُولُ لَسْتُ هُنَاكُمْ - فَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ فَيَسْتَحْيِي رَبَّهُ مِنْهَا - وَلَكِنِ ائْتُوا إِبْرَاهِيمَ صلى الله عليه وسلم الَّذِي اتَّخَذَهُ اللَّهُ خَلِيلاً ‏.‏ فَيَأْتُونَ إِبْرَاهِيمَ صلى الله عليه وسلم فَيَقُولُ لَسْتُ هُنَاكُمْ - وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ فَيَسْتَحْيِي رَبَّهُ مِنْهَا - وَلَكِنِ ائْتُوا مُوسَى صلى الله عليه وسلم الَّذِي كَلَّمَهُ اللَّهُ وَأَعْطَاهُ التَّوْرَاةَ ‏.‏ قَالَ فَيَأْتُونَ مُوسَى - عَلَيْهِ السَّلاَمُ - فَيَقُولُ لَسْتُ هُنَاكُمْ - وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ فَيَسْتَحْيِي رَبَّهُ مِنْهَا - وَلَكِنِ ائْتُوا عِيسَى رُوحَ اللَّهِ وَكَلِمَتَهُ ‏.‏ فَيَأْتُونَ عِيسَى رُوحَ اللَّهِ وَكَلِمَتَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ ‏.‏ وَلَكِنِ ائْتُوا مُحَمَّدًا صلى الله عليه وسلم عَبْدًا قَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ ‏\"‏ ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَيَأْتُونِي فَأَسْتَأْذِنُ عَلَى رَبِّي فَيُؤْذَنُ لِي فَإِذَا أَنَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ فَيُقَالُ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ قُلْ تُسْمَعْ سَلْ تُعْطَهْ اشْفَعْ تُشَفَّعْ ‏.‏ فَأَرْفَعُ رَأْسِي فَأَحْمَدُ رَبِّي بِتَحْمِيدٍ يُعَلِّمُنِيهِ رَبِّي ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأُخْرِجُهُمْ مِنَ النَّارِ وَأُدْخِلُهُمُ الْجَنَّةَ ثُمَّ أَعُودُ فَأَقَعُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ ارْفَعْ رَأْسَكَ يَا مُحَمَّدُ قُلْ تُسْمَعْ سَلْ تُعْطَهْ اشْفَعْ تُشَفَّعْ ‏.‏ فَأَرْفَعُ رَأْسِي فَأَحْمَدُ رَبِّي بِتَحْمِيدٍ يُعَلِّمُنِيهِ ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأُخْرِجُهُمْ مِنَ النَّارِ وَأُدْخِلُهُمُ الْجَنَّةَ - قَالَ فَلاَ أَدْرِي فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ قَالَ - فَأَقُولُ يَا رَبِّ مَا بَقِيَ فِي النَّارِ إِلاَّ مَنْ حَبَسَهُ الْقُرْآنُ أَىْ وَجَبَ عَلَيْهِ الْخُلُودُ ‏\"‏ ‏.‏ - قَالَ ابْنُ عُبَيْدٍ فِي رِوَايَتِهِ قَالَ قَتَادَةُ أَىْ وَجَبَ عَلَيْهِ الْخُلُودُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 381
			}
		}
	]
}