{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"34": "The Book of Hunting, Slaughter, and what may be Eaten"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4998,
			"arabicnumber": "1935.01",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، ح وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَمَّرَ عَلَيْنَا أَبَا عُبَيْدَةَ نَتَلَقَّى عِيرًا لِقُرَيْشٍ وَزَوَّدَنَا جِرَابًا مِنْ تَمْرٍ لَمْ يَجِدْ لَنَا غَيْرَهُ فَكَانَ أَبُو عُبَيْدَةَ يُعْطِينَا تَمْرَةً تَمْرَةً - قَالَ - فَقُلْتُ كَيْفَ كُنْتُمْ تَصْنَعُونَ بِهَا قَالَ نَمَصُّهَا كَمَا يَمَصُّ الصَّبِيُّ ثُمَّ نَشْرَبُ عَلَيْهَا مِنَ الْمَاءِ فَتَكْفِينَا يَوْمَنَا إِلَى اللَّيْلِ وَكُنَّا نَضْرِبُ بِعِصِيِّنَا الْخَبَطَ ثُمَّ نَبُلُّهُ بِالْمَاءِ فَنَأْكُلُهُ قَالَ وَانْطَلَقْنَا عَلَى سَاحِلِ الْبَحْرِ فَرُفِعَ لَنَا عَلَى سَاحِلِ الْبَحْرِ كَهَيْئَةِ الْكَثِيبِ الضَّخْمِ فَأَتَيْنَاهُ فَإِذَا هِيَ دَابَّةٌ تُدْعَى الْعَنْبَرَ قَالَ قَالَ أَبُو عُبَيْدَةَ مَيْتَةٌ ثُمَّ قَالَ لاَ بَلْ نَحْنُ رُسُلُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي سَبِيلِ اللَّهِ وَقَدِ اضْطُرِرْتُمْ فَكُلُوا قَالَ فَأَقَمْنَا عَلَيْهِ شَهْرًا وَنَحْنُ ثَلاَثُ مِائَةٍ حَتَّى سَمِنَّا قَالَ وَلَقَدْ رَأَيْتُنَا نَغْتَرِفُ مِنْ وَقْبِ عَيْنِهِ بِالْقِلاَلِ الدُّهْنَ وَنَقْتَطِعُ مِنْهُ الْفِدَرَ كَالثَّوْرِ - أَوْ كَقَدْرِ الثَّوْرِ - فَلَقَدْ أَخَذَ مِنَّا أَبُو عُبَيْدَةَ ثَلاَثَةَ عَشَرَ رَجُلاً فَأَقْعَدَهُمْ فِي وَقْبِ عَيْنِهِ وَأَخَذَ ضِلَعًا مِنْ أَضْلاَعِهِ فَأَقَامَهَا ثُمَّ رَحَلَ أَعْظَمَ بَعِيرٍ مَعَنَا فَمَرَّ مِنْ تَحْتِهَا وَتَزَوَّدْنَا مِنْ لَحْمِهِ وَشَائِقَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْنَا ذَلِكَ لَهُ فَقَالَ ‏ \"‏ هُوَ رِزْقٌ أَخْرَجَهُ اللَّهُ لَكُمْ فَهَلْ مَعَكُمْ مِنْ لَحْمِهِ شَىْءٌ فَتُطْعِمُونَا ‏\"‏ ‏.‏ قَالَ فَأَرْسَلْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْهُ فَأَكَلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 27
			}
		}
	]
}