{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5948,
			"arabicnumber": "1392.02",
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنْ أَبِي حُمَيْدٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم غَزْوَةَ تَبُوكَ فَأَتَيْنَا وَادِيَ الْقُرَى عَلَى حَدِيقَةٍ لاِمْرَأَةٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اخْرُصُوهَا ‏\"‏ ‏.‏ فَخَرَصْنَاهَا وَخَرَصَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَشْرَةَ أَوْسُقٍ وَقَالَ ‏\"‏ أَحْصِيهَا حَتَّى نَرْجِعَ إِلَيْكِ إِنْ شَاءَ اللَّهُ ‏\"‏ ‏.‏ وَانْطَلَقْنَا حَتَّى قَدِمْنَا تَبُوكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَتَهُبُّ عَلَيْكُمُ اللَّيْلَةَ رِيحٌ شَدِيدَةٌ فَلاَ يَقُمْ فِيهَا أَحَدٌ مِنْكُمْ فَمَنْ كَانَ لَهُ بَعِيرٌ فَلْيَشُدَّ عِقَالَهُ ‏\"‏ ‏.‏ فَهَبَّتْ رِيحٌ شَدِيدَةٌ فَقَامَ رَجُلٌ فَحَمَلَتْهُ الرِّيحُ حَتَّى أَلْقَتْهُ بِجَبَلَىْ طَيِّئٍ وَجَاءَ رَسُولُ ابْنِ الْعَلْمَاءِ صَاحِبِ أَيْلَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِكِتَابٍ وَأَهْدَى لَهُ بَغْلَةً بَيْضَاءَ فَكَتَبَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْدَى لَهُ بُرْدًا ثُمَّ أَقْبَلْنَا حَتَّى قَدِمْنَا وَادِيَ الْقُرَى فَسَأَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَرْأَةَ عَنْ حَدِيقَتِهَا ‏\"‏ كَمْ بَلَغَ ثَمَرُهَا ‏\"‏ ‏.‏ فَقَالَتْ عَشَرَةَ أَوْسُقٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي مُسْرِعٌ فَمَنْ شَاءَ مِنْكُمْ فَلْيُسْرِعْ مَعِيَ وَمَنْ شَاءَ فَلْيَمْكُثْ ‏\"‏ ‏.‏ فَخَرَجْنَا حَتَّى أَشْرَفْنَا عَلَى الْمَدِينَةِ فَقَالَ ‏\"‏ هَذِهِ طَابَةُ وَهَذَا أُحُدٌ وَهُوَ جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ خَيْرَ دُورِ الأَنْصَارِ دَارُ بَنِي النَّجَّارِ ثُمَّ دَارُ بَنِي عَبْدِ الأَشْهَلِ ثُمَّ دَارُ بَنِي عَبْدِ الْحَارِثِ بْنِ الْخَزْرَجِ ثُمَّ دَارُ بَنِي سَاعِدَةَ وَفِي كُلِّ دُورِ الأَنْصَارِ خَيْرٌ ‏\"‏ ‏.‏ فَلَحِقَنَا سَعْدُ بْنُ عُبَادَةَ فَقَالَ أَبُو أُسَيْدٍ أَلَمْ تَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَيَّرَ دُورَ الأَنْصَارِ فَجَعَلَنَا آخِرًا ‏.‏ فَأَدْرَكَ سَعْدٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ خَيَّرْتَ دُورَ الأَنْصَارِ فَجَعَلْتَنَا آخِرًا ‏.‏ فَقَالَ ‏\"‏ أَوَلَيْسَ بِحَسْبِكُمْ أَنْ تَكُونُوا مِنَ الْخِيَارِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 11
			}
		}
	]
}