{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6145,
			"arabicnumber": "2371",
			"text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَمْ يَكْذِبْ إِبْرَاهِيمُ النَّبِيُّ عَلَيْهِ السَّلاَمُ قَطُّ إِلاَّ ثَلاَثَ كَذَبَاتٍ ثِنْتَيْنِ فِي ذَاتِ اللَّهِ قَوْلُهُ ‏{‏ إِنِّي سَقِيمٌ‏}‏ ‏.‏ وَقَوْلُهُ ‏{‏ بَلْ فَعَلَهُ كَبِيرُهُمْ هَذَا‏}‏ وَوَاحِدَةً فِي شَأْنِ سَارَةَ فَإِنَّهُ قَدِمَ أَرْضَ جَبَّارٍ وَمَعَهُ سَارَةُ وَكَانَتْ أَحْسَنَ النَّاسِ فَقَالَ لَهَا إِنَّ هَذَا الْجَبَّارَ إِنْ يَعْلَمْ أَنَّكِ امْرَأَتِي يَغْلِبْنِي عَلَيْكِ فَإِنْ سَأَلَكِ فَأَخْبِرِيهِ أَنَّكِ أُخْتِي فَإِنَّكِ أُخْتِي فِي الإِسْلاَمِ فَإِنِّي لاَ أَعْلَمُ فِي الأَرْضِ مُسْلِمًا غَيْرِي وَغَيْرَكِ فَلَمَّا دَخَلَ أَرْضَهُ رَآهَا بَعْضُ أَهْلِ الْجَبَّارِ أَتَاهُ فَقَالَ لَهُ لَقَدْ قَدِمَ أَرْضَكَ امْرَأَةٌ لاَ يَنْبَغِي لَهَا أَنْ تَكُونَ إِلاَّ لَكَ ‏.‏ فَأَرْسَلَ إِلَيْهَا فَأُتِيَ بِهَا فَقَامَ إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ إِلَى الصَّلاَةِ فَلَمَّا دَخَلَتْ عَلَيْهِ لَمْ يَتَمَالَكْ أَنْ بَسَطَ يَدَهُ إِلَيْهَا فَقُبِضَتْ يَدُهُ قَبْضَةً شَدِيدَةً فَقَالَ لَهَا ادْعِي اللَّهَ أَنْ يُطْلِقَ يَدِي وَلاَ أَضُرُّكِ ‏.‏ فَفَعَلَتْ فَعَادَ فَقُبِضَتْ أَشَدَّ مِنَ الْقَبْضَةِ الأُولَى فَقَالَ لَهَا مِثْلَ ذَلِكَ فَفَعَلَتْ فَعَادَ فَقُبِضَتْ أَشَدَّ مِنَ الْقَبْضَتَيْنِ الأُولَيَيْنِ فَقَالَ ادْعِي اللَّهَ أَنْ يُطْلِقَ يَدِي فَلَكِ اللَّهَ أَنْ لاَ أَضُرَّكِ ‏.‏ فَفَعَلَتْ وَأُطْلِقَتْ يَدُهُ وَدَعَا الَّذِي جَاءَ بِهَا فَقَالَ لَهُ إِنَّكَ إِنَّمَا أَتَيْتَنِي بِشَيْطَانٍ وَلَمْ تَأْتِنِي بِإِنْسَانٍ فَأَخْرِجْهَا مِنْ أَرْضِي وَأَعْطِهَا هَاجَرَ ‏.‏ قَالَ فَأَقْبَلَتْ تَمْشِي فَلَمَّا رَآهَا إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ انْصَرَفَ فَقَالَ لَهَا مَهْيَمْ قَالَتْ خَيْرًا كَفَّ اللَّهُ يَدَ الْفَاجِرِ وَأَخْدَمَ خَادِمًا ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَتِلْكَ أُمُّكُمْ يَا بَنِي مَاءِ السَّمَاءِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 203
			}
		}
	]
}