{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6290,
			"arabicnumber": "2442.01",
			"text": "حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَأَبُو بَكْرِ بْنُ النَّضْرِ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ حَدَّثَنِي وَقَالَ الآخَرَانِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ، شِهَابٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَأْذَنَتْ عَلَيْهِ وَهُوَ مُضْطَجِعٌ مَعِي فِي مِرْطِي فَأَذِنَ لَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَزْوَاجَكَ أَرْسَلْنَنِي إِلَيْكَ يَسْأَلْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ وَأَنَا سَاكِتَةٌ - قَالَتْ - فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَىْ بُنَيَّةُ أَلَسْتِ تُحِبِّينَ مَا أُحِبُّ ‏\"‏ ‏.‏ فَقَالَتْ بَلَى ‏.‏ قَالَ ‏\"‏ فَأَحِبِّي هَذِهِ ‏\"‏ ‏.‏ قَالَتْ فَقَامَتْ فَاطِمَةُ حِينَ سَمِعَتْ ذَلِكَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَجَعَتْ إِلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَتْهُنَّ بِالَّذِي قَالَتْ وَبِالَّذِي قَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْنَ لَهَا مَا نُرَاكِ أَغْنَيْتِ عَنَّا مِنْ شَىْءٍ فَارْجِعِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُولِي لَهُ إِنَّ أَزْوَاجَكَ يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ ‏.‏ فَقَالَتْ فَاطِمَةُ وَاللَّهِ لاَ أُكَلِّمُهُ فِيهَا أَبَدًا ‏.‏ قَالَتْ عَائِشَةُ فَأَرْسَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم زَيْنَبَ بِنْتَ جَحْشٍ زَوْجَ النَّبِيِّ صلى الله عليه وسلم وَهِيَ الَّتِي كَانَتْ تُسَامِينِي مِنْهُنَّ فِي الْمَنْزِلَةِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَمْ أَرَ امْرَأَةً قَطُّ خَيْرًا فِي الدِّينِ مِنْ زَيْنَبَ وَأَتْقَى لِلَّهِ وَأَصْدَقَ حَدِيثًا وَأَوْصَلَ لِلرَّحِمِ وَأَعْظَمَ صَدَقَةً وَأَشَدَّ ابْتِذَالاً لِنَفْسِهَا فِي الْعَمَلِ الَّذِي تَصَدَّقُ بِهِ وَتَقَرَّبُ بِهِ إِلَى اللَّهِ تَعَالَى مَا عَدَا سَوْرَةً مِنْ حَدٍّ كَانَتْ فِيهَا تُسْرِعُ مِنْهَا الْفَيْئَةَ قَالَتْ فَاسْتَأْذَنَتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ عَائِشَةَ فِي مِرْطِهَا عَلَى الْحَالَةِ الَّتِي دَخَلَتْ فَاطِمَةُ عَلَيْهَا وَهُوَ بِهَا فَأَذِنَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَزْوَاجَكَ أَرْسَلْنَنِي إِلَيْكَ يَسْأَلْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ ‏.‏ قَالَتْ ثُمَّ وَقَعَتْ بِي فَاسْتَطَالَتْ عَلَىَّ وَأَنَا أَرْقُبُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَرْقُبُ طَرْفَهُ هَلْ يَأْذَنُ لِي فِيهَا - قَالَتْ - فَلَمْ تَبْرَحْ زَيْنَبُ حَتَّى عَرَفْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لاَ يَكْرَهُ أَنْ أَنْتَصِرَ - قَالَتْ - فَلَمَّا وَقَعْتُ بِهَا لَمْ أَنْشَبْهَا حِينَ أَنْحَيْتُ عَلَيْهَا - قَالَتْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَتَبَسَّمَ ‏\"‏ إِنَّهَا ابْنَةُ أَبِي بَكْرٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 120
			}
		}
	]
}