{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6362,
			"arabicnumber": "2474",
			"text": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنُ عَرْعَرَةَ السَّامِيُّ، وَمُحَمَّدُ بْنُ حَاتِمٍ، - وَتَقَارَبَا فِي سِيَاقِ الْحَدِيثِ وَاللَّفْظُ لاِبْنِ حَاتِمٍ - قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ عَنْ أَبِي جَمْرَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ لَمَّا بَلَغَ أَبَا ذَرٍّ مَبْعَثُ النَّبِيِّ صلى الله عليه وسلم بِمَكَّةَ قَالَ لأَخِيهِ ارْكَبْ إِلَى هَذَا الْوَادِي فَاعْلَمْ لِي عِلْمَ هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ يَأْتِيهِ الْخَبَرُ مِنَ السَّمَاءِ فَاسْمَعْ مِنْ قَوْلِهِ ثُمَّ ائْتِنِي ‏.‏ فَانْطَلَقَ الآخَرُ حَتَّى قَدِمَ مَكَّةَ وَسَمِعَ مِنْ قَوْلِهِ ثُمَّ رَجَعَ إِلَى أَبِي ذَرٍّ فَقَالَ رَأَيْتُهُ يَأْمُرُ بِمَكَارِمِ الأَخْلاَقِ وَكَلاَمًا مَا هُوَ بِالشِّعْرِ ‏.‏ فَقَالَ مَا شَفَيْتَنِي فِيمَا أَرَدْتُ ‏.‏ فَتَزَوَّدَ وَحَمَلَ شَنَّةً لَهُ فِيهَا مَاءٌ حَتَّى قَدِمَ مَكَّةَ فَأَتَى الْمَسْجِدَ فَالْتَمَسَ النَّبِيَّ صلى الله عليه وسلم وَلاَ يَعْرِفُهُ وَكَرِهَ أَنْ يَسْأَلَ عَنْهُ حَتَّى أَدْرَكَهُ - يَعْنِي اللَّيْلَ - فَاضْطَجَعَ فَرَآهُ عَلِيٌّ فَعَرَفَ أَنَّهُ غَرِيبٌ فَلَمَّا رَآهُ تَبِعَهُ فَلَمْ يَسْأَلْ وَاحِدٌ مِنْهُمَا صَاحِبَهُ عَنْ شَىْءٍ حَتَّى أَصْبَحَ ثُمَّ احْتَمَلَ قُرَيْبَتَهُ وَزَادَهُ إِلَى الْمَسْجِدِ فَظَلَّ ذَلِكَ الْيَوْمَ وَلاَ يَرَى النَّبِيَّ صلى الله عليه وسلم حَتَّى أَمْسَى فَعَادَ إِلَى مَضْجَعِهِ فَمَرَّ بِهِ عَلِيٌّ فَقَالَ مَا أَنَى لِلرَّجُلِ أَنْ يَعْلَمَ مَنْزِلَهُ فَأَقَامَهُ فَذَهَبَ بِهِ مَعَهُ وَلاَ يَسْأَلُ وَاحِدٌ مِنْهُمَا صَاحِبَهُ عَنْ شَىْءٍ حَتَّى إِذَا كَانَ يَوْمُ الثَّالِثِ فَعَلَ مِثْلَ ذَلِكَ فَأَقَامَهُ عَلِيٌّ مَعَهُ ثُمَّ قَالَ لَهُ أَلاَ تُحَدِّثُنِي مَا الَّذِي أَقْدَمَكَ هَذَا الْبَلَدَ قَالَ إِنْ أَعْطَيْتَنِي عَهْدًا وَمِيثَاقًا لَتُرْشِدَنِّي فَعَلْتُ ‏.‏ فَفَعَلَ فَأَخْبَرَهُ فَقَالَ فَإِنَّهُ حَقٌّ وَهُوَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَإِذَا أَصْبَحْتَ فَاتَّبِعْنِي فَإِنِّي إِنْ رَأَيْتُ شَيْئًا أَخَافُ عَلَيْكَ قُمْتُ كَأَنِّي أُرِيقُ الْمَاءَ فَإِنْ مَضَيْتُ فَاتَّبِعْنِي حَتَّى تَدْخُلَ مَدْخَلِي ‏.‏ فَفَعَلَ فَانْطَلَقَ يَقْفُوهُ حَتَّى دَخَلَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَدَخَلَ مَعَهُ فَسَمِعَ مِنْ قَوْلِهِ وَأَسْلَمَ مَكَانَهُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ ارْجِعْ إِلَى قَوْمِكَ فَأَخْبِرْهُمْ حَتَّى يَأْتِيَكَ أَمْرِي ‏\"‏ ‏.‏ فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ لأَصْرُخَنَّ بِهَا بَيْنَ ظَهْرَانَيْهِمْ ‏.‏ فَخَرَجَ حَتَّى أَتَى الْمَسْجِدَ فَنَادَى بِأَعْلَى صَوْتِهِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏.‏ وَثَارَ الْقَوْمُ فَضَرَبُوهُ حَتَّى أَضْجَعُوهُ فَأَتَى الْعَبَّاسُ فَأَكَبَّ عَلَيْهِ فَقَالَ وَيْلَكُمْ أَلَسْتُمْ تَعْلَمُونَ أَنَّهُ مِنْ غِفَارٍ وَأَنَّ طَرِيقَ تُجَّارِكُمْ إِلَى الشَّامِ عَلَيْهِمْ ‏.‏ فَأَنْقَذَهُ مِنْهُمْ ثُمَّ عَادَ مِنَ الْغَدِ بِمِثْلِهَا وَثَارُوا إِلَيْهِ فَضَرَبُوهُ فَأَكَبَّ عَلَيْهِ الْعَبَّاسُ فَأَنْقَذَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 192
			}
		}
	]
}