{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6496,
			"arabicnumber": "2545",
			"text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ إِسْحَاقَ الْحَضْرَمِيَّ - أَخْبَرَنَا الأَسْوَدُ بْنُ شَيْبَانَ، عَنْ أَبِي نَوْفَلٍ، رَأَيْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ عَلَى عَقَبَةِ الْمَدِينَةِ - قَالَ - فَجَعَلَتْ قُرَيْشٌ تَمُرُّ عَلَيْهِ وَالنَّاسُ حَتَّى مَرَّ عَلَيْهِ عَبْدُ اللَّهِ بْنُ عُمَرَ فَوَقَفَ عَلَيْهِ فَقَالَ السَّلاَمُ عَلَيْكَ أَبَا خُبَيْبٍ السَّلاَمُ عَلَيْكَ أَبَا خُبَيْبٍ السَّلاَمُ عَلَيْكَ أَبَا خُبَيْبٍ أَمَا وَاللَّهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا أَمَا وَاللَّهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا أَمَا وَاللَّهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا أَمَا وَاللَّهِ إِنْ كُنْتَ مَا عَلِمْتُ صَوَّامًا قَوَّامًا وَصُولاً لِلرَّحِمِ أَمَا وَاللَّهِ لأُمَّةٌ أَنْتَ أَشَرُّهَا لأُمَّةٌ خَيْرٌ ‏.‏ ثُمَّ نَفَذَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَبَلَغَ الْحَجَّاجَ مَوْقِفُ عَبْدِ اللَّهِ وَقَوْلُهُ فَأَرْسَلَ إِلَيْهِ فَأُنْزِلَ عَنْ جِذْعِهِ فَأُلْقِيَ فِي قُبُورِ الْيَهُودِ ثُمَّ أَرْسَلَ إِلَى أُمِّهِ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ فَأَبَتْ أَنْ تَأْتِيَهُ فَأَعَادَ عَلَيْهَا الرَّسُولَ لَتَأْتِيَنِّي أَوْ لأَبْعَثَنَّ إِلَيْكِ مِنْ يَسْحَبُكِ بِقُرُونِكِ - قَالَ - فَأَبَتْ وَقَالَتْ وَاللَّهِ لاَ آتِيكَ حَتَّى تَبْعَثَ إِلَىَّ مَنْ يَسْحَبُنِي بِقُرُونِي - قَالَ - فَقَالَ أَرُونِي سِبْتَىَّ ‏.‏ فَأَخَذَ نَعْلَيْهِ ثُمَّ انْطَلَقَ يَتَوَذَّفُ حَتَّى دَخَلَ عَلَيْهَا فَقَالَ كَيْفَ رَأَيْتِنِي صَنَعْتُ بِعَدُوِّ اللَّهِ قَالَتْ رَأَيْتُكَ أَفْسَدْتَ عَلَيْهِ دُنْيَاهُ وَأَفْسَدَ عَلَيْكَ آخِرَتَكَ بَلَغَنِي أَنَّكَ تَقُولُ لَهُ يَا ابْنَ ذَاتِ النِّطَاقَيْنِ أَنَا وَاللَّهِ ذَاتُ النِّطَاقَيْنِ أَمَّا أَحَدُهُمَا فَكُنْتُ أَرْفَعُ بِهِ طَعَامَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَطَعَامَ أَبِي بَكْرٍ مِنَ الدَّوَابِّ وَأَمَّا الآخَرُ فَنِطَاقُ الْمَرْأَةِ الَّتِي لاَ تَسْتَغْنِي عَنْهُ أَمَا إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَدَّثَنَا ‏ \"‏ أَنَّ فِي ثَقِيفٍ كَذَّابًا وَمُبِيرًا ‏\"‏ ‏.‏ فَأَمَّا الْكَذَّابُ فَرَأَيْنَاهُ وَأَمَّا الْمُبِيرُ فَلاَ إِخَالُكَ إِلاَّ إِيَّاهُ - قَالَ - فَقَامَ عَنْهَا وَلَمْ يُرَاجِعْهَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 325
			}
		}
	]
}