{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6508,
			"arabicnumber": "2550.01",
			"text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ كَانَ جُرَيْجٌ يَتَعَبَّدُ فِي صَوْمَعَةٍ فَجَاءَتْ أُمُّهُ ‏.‏ قَالَ حُمَيْدٌ فَوَصَفَ لَنَا أَبُو رَافِعٍ صِفَةَ أَبِي هُرَيْرَةَ لِصِفَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم أُمَّهُ حِينَ دَعَتْهُ كَيْفَ جَعَلَتْ كَفَّهَا فَوْقَ حَاجِبِهَا ثُمَّ رَفَعَتْ رَأْسَهَا إِلَيْهِ تَدْعُوهُ فَقَالَتْ يَا جُرَيْجُ أَنَا أُمُّكَ كَلِّمْنِي ‏.‏ فَصَادَفَتْهُ يُصَلِّي فَقَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي ‏.‏ فَاخْتَارَ صَلاَتَهُ فَرَجَعَتْ ثُمَّ عَادَتْ فِي الثَّانِيَةِ فَقَالَتْ يَا جُرَيْجُ أَنَا أُمُّكَ فَكَلِّمْنِي ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي ‏.‏ فَاخْتَارَ صَلاَتَهُ فَقَالَتِ اللَّهُمَّ إِنَّ هَذَا جُرَيْجٌ وَهُوَ ابْنِي وَإِنِّي كَلَّمْتُهُ فَأَبَى أَنْ يُكَلِّمَنِي اللَّهُمَّ فَلاَ تُمِتْهُ حَتَّى تُرِيَهُ الْمُومِسَاتِ ‏.‏ قَالَ وَلَوْ دَعَتْ عَلَيْهِ أَنْ يُفْتَنَ لَفُتِنَ ‏.‏ قَالَ وَكَانَ رَاعِي ضَأْنٍ يَأْوِي إِلَى دَيْرِهِ - قَالَ - فَخَرَجَتِ امْرَأَةٌ مِنَ الْقَرْيَةِ فَوَقَعَ عَلَيْهَا الرَّاعِي فَحَمَلَتْ فَوَلَدَتْ غُلاَمًا فَقِيلَ لَهَا مَا هَذَا قَالَتْ مِنْ صَاحِبِ هَذَا الدَّيْرِ ‏.‏ قَالَ فَجَاءُوا بِفُئُوسِهِمْ وَمَسَاحِيهِمْ فَنَادَوْهُ فَصَادَفُوهُ يُصَلِّي فَلَمْ يُكَلِّمْهُمْ - قَالَ - فَأَخَذُوا يَهْدِمُونَ دَيْرَهُ فَلَمَّا رَأَى ذَلِكَ نَزَلَ إِلَيْهِمْ فَقَالُوا لَهُ سَلْ هَذِهِ - قَالَ - فَتَبَسَّمَ ثُمَّ مَسَحَ رَأْسَ الصَّبِيِّ فَقَالَ مَنْ أَبُوكَ قَالَ أَبِي رَاعِي الضَّأْنِ ‏.‏ فَلَمَّا سَمِعُوا ذَلِكَ مِنْهُ قَالُوا نَبْنِي مَا هَدَمْنَا مِنْ دَيْرِكَ بِالذَّهَبِ وَالْفِضَّةِ ‏.‏ قَالَ لاَ وَلَكِنْ أَعِيدُوهُ تُرَابًا كَمَا كَانَ ثُمَّ عَلاَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		}
	]
}