{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7207,
			"arabicnumber": "2865.01",
			"text": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارِ بْنِ عُثْمَانَ، - وَاللَّفْظُ لأَبِي غَسَّانَ وَابْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ عِيَاضِ بْنِ حِمَارٍ الْمُجَاشِعِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَاتَ يَوْمٍ فِي خُطْبَتِهِ ‏\"‏ أَلاَ إِنَّ رَبِّي أَمَرَنِي أَنْ أُعَلِّمَكُمْ مَا جَهِلْتُمْ مِمَّا عَلَّمَنِي يَوْمِي هَذَا كُلُّ مَالٍ نَحَلْتُهُ عَبْدًا حَلاَلٌ وَإِنِّي خَلَقْتُ عِبَادِي حُنَفَاءَ كُلَّهُمْ وَإِنَّهُمْ أَتَتْهُمُ الشَّيَاطِينُ فَاجْتَالَتْهُمْ عَنْ دِينِهِمْ وَحَرَّمَتْ عَلَيْهِمْ مَا أَحْلَلْتُ لَهُمْ وَأَمَرَتْهُمْ أَنْ يُشْرِكُوا بِي مَا لَمْ أُنْزِلْ بِهِ سُلْطَانًا وَإِنَّ اللَّهَ نَظَرَ إِلَى أَهْلِ الأَرْضِ فَمَقَتَهُمْ عَرَبَهُمْ وَعَجَمَهُمْ إِلاَّ بَقَايَا مِنْ أَهْلِ الْكِتَابِ وَقَالَ إِنَّمَا بَعَثْتُكَ لأَبْتَلِيَكَ وَأَبْتَلِيَ بِكَ وَأَنْزَلْتُ عَلَيْكَ كِتَابًا لاَ يَغْسِلُهُ الْمَاءُ تَقْرَؤُهُ نَائِمًا وَيَقْظَانَ وَإِنَّ اللَّهَ أَمَرَنِي أَنْ أُحَرِّقَ قُرَيْشًا فَقُلْتُ رَبِّ إِذًا يَثْلَغُوا رَأْسِي فَيَدَعُوهُ خُبْزَةً قَالَ اسْتَخْرِجْهُمْ كَمَا اسْتَخْرَجُوكَ وَاغْزُهُمْ نُغْزِكَ وَأَنْفِقْ فَسَنُنْفِقَ عَلَيْكَ وَابْعَثْ جَيْشًا نَبْعَثْ خَمْسَةً مِثْلَهُ وَقَاتِلْ بِمَنْ أَطَاعَكَ مَنْ عَصَاكَ ‏.‏ قَالَ وَأَهْلُ الْجَنَّةِ ثَلاَثَةٌ ذُو سُلْطَانٍ مُقْسِطٌ مُتَصَدِّقٌ مُوَفَّقٌ وَرَجُلٌ رَحِيمٌ رَقِيقُ الْقَلْبِ لِكُلِّ ذِي قُرْبَى وَمُسْلِمٍ وَعَفِيفٌ مُتَعَفِّفٌ ذُو عِيَالٍ - قَالَ - وَأَهْلُ النَّارِ خَمْسَةٌ الضَّعِيفُ الَّذِي لاَ زَبْرَ لَهُ الَّذِينَ هُمْ فِيكُمْ تَبَعًا لاَ يَتْبَعُونَ أَهْلاً وَلاَ مَالاً وَالْخَائِنُ الَّذِي لاَ يَخْفَى لَهُ طَمَعٌ وَإِنْ دَقَّ إِلاَّ خَانَهُ وَرَجُلٌ لاَ يُصْبِحُ وَلاَ يُمْسِي إِلاَّ وَهُوَ يُخَادِعُكَ عَنْ أَهْلِكَ وَمَالِكَ ‏\"‏ ‏.‏ وَذَكَرَ الْبُخْلَ أَوِ الْكَذِبَ ‏\"‏ وَالشِّنْظِيرُ الْفَحَّاشُ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ أَبُو غَسَّانَ فِي حَدِيثِهِ ‏\"‏ وَأَنْفِقْ فَسَنُنْفِقَ عَلَيْكَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 76
			}
		}
	]
}