{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7281,
			"arabicnumber": "2899.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ حُجْرٍ، كِلاَهُمَا عَنِ ابْنِ عُلَيَّةَ، - وَاللَّفْظُ لاِبْنِ حُجْرٍ - حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي قَتَادَةَ، الْعَدَوِيِّ عَنْ يُسَيْرِ بْنِ جَابِرٍ، قَالَ هَاجَتْ رِيحٌ حَمْرَاءُ بِالْكُوفَةِ فَجَاءَ رَجُلٌ لَيْسَ لَهُ هِجِّيرَى إِلاَّ يَا عَبْدَ اللَّهِ بْنَ مَسْعُودٍ جَاءَتِ السَّاعَةُ ‏.‏ قَالَ فَقَعَدَ وَكَانَ مُتَّكِئًا فَقَالَ إِنَّ السَّاعَةَ لاَ تَقُومُ حَتَّى لاَ يُقْسَمَ مِيرَاثٌ وَلاَ يُفْرَحَ بِغَنِيمَةٍ ‏.‏ ثُمَّ قَالَ بِيَدِهِ هَكَذَا - وَنَحَّاهَا نَحْوَ الشَّأْمِ - فَقَالَ عَدُوٌّ يَجْمَعُونَ لأَهْلِ الإِسْلاَمِ وَيَجْمَعُ لَهُمْ أَهْلُ الإِسْلاَمِ ‏.‏ قُلْتُ الرُّومَ تَعْنِي قَالَ نَعَمْ وَتَكُونُ عِنْدَ ذَاكُمُ الْقِتَالِ رَدَّةٌ شَدِيدَةٌ فَيَشْتَرِطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لاَ تَرْجِعُ إِلاَّ غَالِبَةً فَيَقْتَتِلُونَ حَتَّى يَحْجُزَ بَيْنَهُمُ اللَّيْلُ فَيَفِيءُ هَؤُلاَءِ وَهَؤُلاَءِ كُلٌّ غَيْرُ غَالِبٍ وَتَفْنَى الشُّرْطَةُ ثُمَّ يَشْتَرِطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لاَ تَرْجِعُ إِلاَّ غَالِبَةً فَيَقْتَتِلُونَ حَتَّى يَحْجُزَ بَيْنَهُمُ اللَّيْلُ فَيَفِيءُ هَؤُلاَءِ وَهَؤُلاَءِ كُلٌّ غَيْرُ غَالِبٍ وَتَفْنَى الشُّرْطَةُ ثُمَّ يَشْتَرِطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لاَ تَرْجِعُ إِلاَّ غَالِبَةً فَيَقْتَتِلُونَ حَتَّى يُمْسُوا فَيَفِيءُ هَؤُلاَءِ وَهَؤُلاَءِ كُلٌّ غَيْرُ غَالِبٍ وَتَفْنَى الشُّرْطَةُ فَإِذَا كَانَ يَوْمُ الرَّابِعِ نَهَدَ إِلَيْهِمْ بَقِيَّةُ أَهْلِ الإِسْلاَمِ فَيَجْعَلُ اللَّهُ الدَّبْرَةَ عَلَيْهِمْ فَيَقْتُلُونَ مَقْتَلَةً - إِمَّا قَالَ لاَ يُرَى مِثْلُهَا وَإِمَّا قَالَ لَمْ يُرَ مِثْلُهَا - حَتَّى إِنَّ الطَّائِرَ لَيَمُرُّ بِجَنَبَاتِهِمْ فَمَا يُخَلِّفُهُمْ حَتَّى يَخِرَّ مَيْتًا فَيَتَعَادُّ بَنُو الأَبِ كَانُوا مِائَةً فَلاَ يَجِدُونَهُ بَقِيَ مِنْهُمْ إِلاَّ الرَّجُلُ الْوَاحِدُ فَبِأَىِّ غَنِيمَةٍ يُفْرَحُ أَوْ أَىُّ مِيرَاثٍ يُقَاسَمُ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ سَمِعُوا بِبَأْسٍ هُوَ أَكْبَرُ مِنْ ذَلِكَ فَجَاءَهُمُ الصَّرِيخُ إِنَّ الدَّجَّالَ قَدْ خَلَفَهُمْ فِي ذَرَارِيِّهِمْ فَيَرْفُضُونَ مَا فِي أَيْدِيهِمْ وَيُقْبِلُونَ فَيَبْعَثُونَ عَشَرَةَ فَوَارِسَ طَلِيعَةً ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنِّي لأَعْرِفُ أَسْمَاءَهُمْ وَأَسْمَاءَ آبَائِهِمْ وَأَلْوَانَ خُيُولِهِمْ هُمْ خَيْرُ فَوَارِسَ عَلَى ظَهْرِ الأَرْضِ يَوْمَئِذٍ أَوْ مِنْ خَيْرِ فَوَارِسَ عَلَى ظَهْرِ الأَرْضِ يَوْمَئِذٍ ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي شَيْبَةَ فِي رِوَايَتِهِ عَنْ أُسَيْرِ بْنِ جَابِرٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 47
			}
		}
	]
}