{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ عَبَّاسٍ السَّاعِدِيِّ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، قَالَ غَزَوْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم غَزْوَةَ تَبُوكَ فَلَمَّا جَاءَ وَادِيَ الْقُرَى إِذَا امْرَأَةٌ فِي حَدِيقَةٍ لَهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ اخْرُصُوا ‏\"‏‏.‏ وَخَرَصَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَشَرَةَ أَوْسُقٍ فَقَالَ لَهَا ‏\"‏ أَحْصِي مَا يَخْرُجُ مِنْهَا ‏\"‏‏.‏ فَلَمَّا أَتَيْنَا تَبُوكَ قَالَ ‏\"‏ أَمَا إِنَّهَا سَتَهُبُّ اللَّيْلَةَ رِيحٌ شَدِيدَةٌ فَلاَ يَقُومَنَّ أَحَدٌ، وَمَنْ كَانَ مَعَهُ بَعِيرٌ فَلْيَعْقِلْهُ ‏\"‏‏.‏ فَعَقَلْنَاهَا وَهَبَّتْ رِيحٌ شَدِيدَةٌ فَقَامَ رَجُلٌ فَأَلْقَتْهُ بِجَبَلِ طَيِّئٍ ـ وَأَهْدَى مَلِكُ أَيْلَةَ لِلنَّبِيِّ صلى الله عليه وسلم بَغْلَةً بَيْضَاءَ، وَكَسَاهُ بُرْدًا وَكَتَبَ لَهُ بِبَحْرِهِمْ ـ فَلَمَّا أَتَى وَادِيَ الْقُرَى قَالَ لِلْمَرْأَةِ ‏\"‏ كَمْ جَاءَ حَدِيقَتُكِ ‏\"‏‏.‏ قَالَتْ عَشَرَةَ أَوْسُقٍ خَرْصَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي مُتَعَجِّلٌ إِلَى الْمَدِينَةِ، فَمَنْ أَرَادَ مِنْكُمْ أَنْ يَتَعَجَّلَ مَعِي فَلْيَتَعَجَّلْ ‏\"‏‏.‏ فَلَمَّا ـ قَالَ ابْنُ بَكَّارٍ كَلِمَةً مَعْنَاهَا ـ أَشْرَفَ عَلَى الْمَدِينَةِ قَالَ ‏\"‏ هَذِهِ طَابَةُ ‏\"‏‏.‏ فَلَمَّا رَأَى أُحُدًا قَالَ ‏\"‏ هَذَا جُبَيْلٌ يُحِبُّنَا وَنُحِبُّهُ، أَلاَ أُخْبِرُكُمْ بِخَيْرِ دُورِ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ دُورُ بَنِي النَّجَّارِ، ثُمَّ دُورُ بَنِي عَبْدِ الأَشْهَلِ، ثُمَّ دُورُ بَنِي سَاعِدَةَ، أَوْ دُورُ بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ، وَفِي كُلِّ دُورِ الأَنْصَارِ ـ يَعْنِي ـ خَيْرًا ‏\"‏‏.‏ وَقَالَ سُلَيْمَانُ بْنُ بِلاَلٍ حَدَّثَنِي عَمْرٌو، ‏\"‏ ثُمَّ دَارُ بَنِي الْحَارِثِ، ثُمَّ بَنِي سَاعِدَةَ ‏\"‏‏.‏ وَقَالَ سُلَيْمَانُ عَنْ سَعْدِ بْنِ سَعِيدٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ عَبَّاسٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أُحُدٌ جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ كُلُّ بُسْتَانٍ عَلَيْهِ حَائِطٌ فَهْوَ حَدِيقَةٌ، وَمَا لَمْ يَكُنْ عَلَيْهِ حَائِطٌ لَمْ يَقُلْ حَدِيقَةٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}