{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنِي أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ، سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي أَشْهُرِ الْحَجِّ، وَلَيَالِي الْحَجِّ وَحُرُمِ الْحَجِّ، فَنَزَلْنَا بِسَرِفَ قَالَتْ فَخَرَجَ إِلَى أَصْحَابِهِ فَقَالَ ‏\"‏ مَنْ لَمْ يَكُنْ مِنْكُمْ مَعَهُ هَدْىٌ فَأَحَبَّ أَنْ يَجْعَلَهَا عُمْرَةً فَلْيَفْعَلْ، وَمَنْ كَانَ مَعَهُ الْهَدْىُ فَلاَ ‏\"‏‏.‏ قَالَتْ فَالآخِذُ بِهَا وَالتَّارِكُ لَهَا مِنْ أَصْحَابِهِ قَالَتْ فَأَمَّا رَسُولُ اللَّهِ صلى الله عليه وسلم وَرِجَالٌ مِنْ أَصْحَابِهِ فَكَانُوا أَهْلَ قُوَّةٍ، وَكَانَ مَعَهُمُ الْهَدْىُ، فَلَمْ يَقْدِرُوا عَلَى الْعُمْرَةِ قَالَتْ فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَبْكِي فَقَالَ ‏\"‏ مَا يُبْكِيكِ يَا هَنْتَاهْ ‏\"‏‏.‏ قُلْتُ سَمِعْتُ قَوْلَكَ لأَصْحَابِكَ فَمُنِعْتُ الْعُمْرَةَ‏.‏ قَالَ ‏\"‏ وَمَا شَأْنُكِ ‏\"‏‏.‏ قُلْتُ لاَ أُصَلِّي‏.‏ قَالَ ‏\"‏ فَلاَ يَضِيرُكِ، إِنَّمَا أَنْتِ امْرَأَةٌ مِنْ بَنَاتِ آدَمَ كَتَبَ اللَّهُ عَلَيْكِ مَا كَتَبَ عَلَيْهِنَّ، فَكُونِي فِي حَجَّتِكِ، فَعَسَى اللَّهُ أَنْ يَرْزُقَكِيهَا ‏\"‏‏.‏ قَالَتْ فَخَرَجْنَا فِي حَجَّتِهِ حَتَّى قَدِمْنَا مِنًى فَطَهَرْتُ، ثُمَّ خَرَجْتُ مِنْ مِنًى فَأَفَضْتُ بِالْبَيْتِ قَالَتْ ثُمَّ خَرَجَتْ مَعَهُ فِي النَّفْرِ الآخِرِ حَتَّى نَزَلَ الْمُحَصَّبَ، وَنَزَلْنَا مَعَهُ فَدَعَا عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَقَالَ ‏\"‏ اخْرُجْ بِأُخْتِكَ مِنَ الْحَرَمِ، فَلْتُهِلَّ بِعُمْرَةٍ ثُمَّ افْرُغَا، ثُمَّ ائْتِيَا هَا هُنَا، فَإِنِّي أَنْظُرُكُمَا حَتَّى تَأْتِيَانِي ‏\"‏‏.‏ ـ قَالَتْ ـ فَخَرَجْنَا حَتَّى إِذَا فَرَغْتُ، وَفَرَغْتُ مِنَ الطَّوَافِ ثُمَّ جِئْتُهُ بِسَحَرَ فَقَالَ ‏\"‏ هَلْ فَرَغْتُمْ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَآذَنَ بِالرَّحِيلِ فِي أَصْحَابِهِ، فَارْتَحَلَ النَّاسُ فَمَرَّ مُتَوَجِّهًا إِلَى الْمَدِينَةِ‏.‏ ضَيْرُ مِنْ ضَارَ يَضِيرُ ضَيْرًا، وَيُقَالُ ضَارَ يَضُورُ ضَوْرًا وَضَرَّ يَضُرُّ ضَرًّا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		}
	]
}