{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"51": "Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ نِسَاءَ، رَسُولِ اللَّهِ صلى الله عليه وسلم كُنَّ حِزْبَيْنِ فَحِزْبٌ فِيهِ عَائِشَةُ وَحَفْصَةُ وَصَفِيَّةُ وَسَوْدَةُ، وَالْحِزْبُ الآخَرُ أُمُّ سَلَمَةَ وَسَائِرُ نِسَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَكَانَ الْمُسْلِمُونَ قَدْ عَلِمُوا حُبَّ رَسُولِ اللَّهِ صلى الله عليه وسلم عَائِشَةَ، فَإِذَا كَانَتْ عِنْدَ أَحَدِهِمْ هَدِيَّةٌ يُرِيدُ أَنْ يُهْدِيَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَخَّرَهَا، حَتَّى إِذَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِ عَائِشَةَ بَعَثَ صَاحِبُ الْهَدِيَّةِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَيْتِ عَائِشَةَ، فَكَلَّمَ حِزْبُ أُمِّ سَلَمَةَ، فَقُلْنَ لَهَا كَلِّمِي رَسُولَ اللَّهِ صلى الله عليه وسلم يُكَلِّمُ النَّاسَ، فَيَقُولُ مَنْ أَرَادَ أَنْ يُهْدِيَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم هَدِيَّةً فَلْيُهْدِهِ إِلَيْهِ حَيْثُ كَانَ مِنْ بُيُوتِ نِسَائِهِ، فَكَلَّمَتْهُ أُمُّ سَلَمَةَ بِمَا قُلْنَ، فَلَمْ يَقُلْ لَهَا شَيْئًا، فَسَأَلْنَهَا‏.‏ فَقَالَتْ مَا قَالَ لِي شَيْئًا‏.‏ فَقُلْنَ لَهَا فَكَلِّمِيهِ‏.‏ قَالَتْ فَكَلَّمَتْهُ حِينَ دَارَ إِلَيْهَا أَيْضًا، فَلَمْ يَقُلْ لَهَا شَيْئًا، فَسَأَلْنَهَا‏.‏ فَقَالَتْ مَا قَالَ لِي شَيْئًا‏.‏ فَقُلْنَ لَهَا كَلِّمِيهِ حَتَّى يُكَلِّمَكِ‏.‏ فَدَارَ إِلَيْهَا فَكَلَّمَتْهُ‏.‏ فَقَالَ لَهَا ‏\"‏ لاَ تُؤْذِينِي فِي عَائِشَةَ، فَإِنَّ الْوَحْىَ لَمْ يَأْتِنِي، وَأَنَا فِي ثَوْبِ امْرَأَةٍ إِلاَّ عَائِشَةَ ‏\"‏‏.‏ قَالَتْ فَقَالَتْ أَتُوبُ إِلَى اللَّهِ مِنْ أَذَاكَ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ إِنَّهُنَّ دَعَوْنَ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَرْسَلْنَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم تَقُولُ إِنَّ نِسَاءَكَ يَنْشُدْنَكَ اللَّهَ الْعَدْلَ فِي بِنْتِ أَبِي بَكْرٍ‏.‏ فَكَلَّمَتْهُ‏.‏ فَقَالَ ‏\"‏ يَا بُنَيَّةُ، أَلاَ تُحِبِّينَ مَا أُحِبُّ ‏\"‏‏.‏ قَالَتْ بَلَى‏.‏ فَرَجَعَتْ إِلَيْهِنَّ، فَأَخْبَرَتْهُنَّ‏.‏ فَقُلْنَ ارْجِعِي إِلَيْهِ‏.‏ فَأَبَتْ أَنْ تَرْجِعَ، فَأَرْسَلْنَ زَيْنَبَ بِنْتَ جَحْشٍ، فَأَتَتْهُ فَأَغْلَظَتْ، وَقَالَتْ إِنَّ نِسَاءَكَ يَنْشُدْنَكَ اللَّهَ الْعَدْلَ فِي بِنْتِ ابْنِ أَبِي قُحَافَةَ‏.‏ فَرَفَعَتْ صَوْتَهَا، حَتَّى تَنَاوَلَتْ عَائِشَةَ‏.‏ وَهْىَ قَاعِدَةٌ، فَسَبَّتْهَا حَتَّى إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَيَنْظُرُ إِلَى عَائِشَةَ هَلْ تَكَلَّمُ قَالَ فَتَكَلَّمَتْ عَائِشَةُ تَرُدُّ عَلَى زَيْنَبَ، حَتَّى أَسْكَتَتْهَا‏.‏ قَالَتْ فَنَظَرَ النَّبِيُّ صلى الله عليه وسلم إِلَى عَائِشَةَ، وَقَالَ ‏\"‏ إِنَّهَا بِنْتُ أَبِي بَكْرٍ ‏\"‏‏.‏ قَالَ الْبُخَارِيُّ الْكَلاَمُ الأَخِيرُ قِصَّةُ فَاطِمَةَ يُذْكَرُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ رَجُلٍ عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ‏.‏ وَقَالَ أَبُو مَرْوَانَ عَنْ هِشَامٍ عَنْ عُرْوَةَ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ‏.‏ وَعَنْ هِشَامٍ عَنْ رَجُلٍ مِنْ قُرَيْشٍ، وَرَجُلٍ مِنَ الْمَوَالِي، عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ قَالَتْ عَائِشَةُ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَاسْتَأْذَنَتْ فَاطِمَةُ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		}
	]
}