{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ،، وَكَانَ، مُحَمَّدُ بْنُ جُبَيْرٍ ذَكَرَ لِي ذِكْرًا مِنْ حَدِيثِهِ ذَلِكَ، فَانْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى مَالِكِ بْنِ أَوْسٍ، فَسَأَلْتُهُ عَنْ ذَلِكَ الْحَدِيثِ فَقَالَ مَالِكٌ بَيْنَا أَنَا جَالِسٌ فِي أَهْلِي حِينَ مَتَعَ النَّهَارُ، إِذَا رَسُولُ عُمَرَ بْنِ الْخَطَّابِ يَأْتِينِي فَقَالَ أَجِبْ أَمِيرَ الْمُؤْمِنِينَ‏.‏ فَانْطَلَقْتُ مَعَهُ حَتَّى أَدْخُلَ عَلَى عُمَرَ، فَإِذَا هُوَ جَالِسٌ عَلَى رِمَالِ سَرِيرٍ، لَيْسَ بَيْنَهُ وَبَيْنَهُ فِرَاشٌ مُتَّكِئٌ عَلَى وِسَادَةٍ مِنْ أَدَمٍ، فَسَلَّمْتُ عَلَيْهِ ثُمَّ جَلَسْتُ فَقَالَ يَا مَالِ، إِنَّهُ قَدِمَ عَلَيْنَا مِنْ قَوْمِكَ أَهْلُ أَبْيَاتٍ، وَقَدْ أَمَرْتُ فِيهِمْ بِرَضْخٍ فَاقْبِضْهُ فَاقْسِمْهُ بَيْنَهُمْ‏.‏ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ، لَوْ أَمَرْتَ بِهِ غَيْرِي‏.‏ قَالَ اقْبِضْهُ أَيُّهَا الْمَرْءُ‏.‏ فَبَيْنَا أَنَا جَالِسٌ عِنْدَهُ أَتَاهُ حَاجِبُهُ يَرْفَا فَقَالَ هَلْ لَكَ فِي عُثْمَانَ وَعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَالزُّبَيْرِ وَسَعْدِ بْنِ أَبِي وَقَّاصٍ يَسْتَأْذِنُونَ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمْ فَدَخَلُوا فَسَلَّمُوا وَجَلَسُوا، ثُمَّ جَلَسَ يَرْفَا يَسِيرًا ثُمَّ قَالَ هَلْ لَكَ فِي عَلِيٍّ وَعَبَّاسٍ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمَا، فَدَخَلاَ فَسَلَّمَا فَجَلَسَا، فَقَالَ عَبَّاسٌ يَا أَمِيرَ الْمُؤْمِنِينَ، اقْضِ بَيْنِي وَبَيْنَ هَذَا‏.‏ وَهُمَا يَخْتَصِمَانِ فِيمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم مِنْ بَنِي النَّضِيرِ‏.‏ فَقَالَ الرَّهْطُ عُثْمَانُ وَأَصْحَابُهُ يَا أَمِيرَ الْمُؤْمِنِينَ، اقْضِ بَيْنَهُمَا وَأَرِحْ أَحَدَهُمَا مِنَ الآخَرِ‏.‏ قَالَ عُمَرُ تَيْدَكُمْ، أَنْشُدُكُمْ بِاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم نَفْسَهُ‏.‏ قَالَ الرَّهْطُ قَدْ قَالَ ذَلِكَ‏.‏ فَأَقْبَلَ عُمَرُ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ أَنْشُدُكُمَا اللَّهَ، أَتَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ قَالَ ذَلِكَ قَالاَ قَدْ قَالَ ذَلِكَ‏.‏ قَالَ عُمَرُ فَإِنِّي أُحَدِّثُكُمْ عَنْ هَذَا الأَمْرِ، إِنَّ اللَّهَ قَدْ خَصَّ رَسُولَهُ صلى الله عليه وسلم فِي هَذَا الْفَىْءِ بِشَىْءٍ لَمْ يُعْطِهِ أَحَدًا غَيْرَهُ ـ ثُمَّ قَرَأَ ‏{‏وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدِيرٌ‏}‏ ـ فَكَانَتْ هَذِهِ خَالِصَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ، وَلاَ اسْتَأْثَرَ بِهَا عَلَيْكُمْ قَدْ أَعْطَاكُمُوهُ، وَبَثَّهَا فِيكُمْ حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ، فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَتِهِمْ مِنْ هَذَا الْمَالِ، ثُمَّ يَأْخُذُ مَا بَقِيَ فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ، فَعَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَلِكَ حَيَاتَهُ، أَنْشُدُكُمْ بِاللَّهِ هَلْ تَعْلَمُونَ ذَلِكَ قَالُوا نَعَمْ‏.‏ ثُمَّ قَالَ لِعَلِيٍّ وَعَبَّاسٍ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ ذَلِكَ قَالَ عُمَرُ ثُمَّ تَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَبَضَهَا أَبُو بَكْرٍ، فَعَمِلَ فِيهَا بِمَا عَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم، وَاللَّهُ يَعْلَمُ إِنَّهُ فِيهَا لَصَادِقٌ بَارٌّ رَاشِدٌ تَابِعٌ لِلْحَقِّ، ثُمَّ تَوَفَّى اللَّهُ أَبَا بَكْرٍ، فَكُنْتُ أَنَا وَلِيَّ أَبِي بَكْرٍ، فَقَبَضْتُهَا سَنَتَيْنِ مِنْ إِمَارَتِي، أَعْمَلُ فِيهَا بِمَا عَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَا عَمِلَ فِيهَا أَبُو بَكْرٍ، وَاللَّهُ يَعْلَمُ إِنِّي فِيهَا لَصَادِقٌ بَارٌّ رَاشِدٌ تَابِعٌ لِلْحَقِّ، ثُمَّ جِئْتُمَانِي تُكَلِّمَانِي وَكَلِمَتُكُمَا وَاحِدَةٌ، وَأَمْرُكُمَا وَاحِدٌ، جِئْتَنِي يَا عَبَّاسُ تَسْأَلُنِي نَصِيبَكَ مِنِ ابْنِ أَخِيكَ، وَجَاءَنِي هَذَا ـ يُرِيدُ عَلِيًّا ـ يُرِيدُ نَصِيبَ امْرَأَتِهِ مِنْ أَبِيهَا، فَقُلْتُ لَكُمَا إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ فَلَمَّا بَدَا لِي أَنْ أَدْفَعَهُ إِلَيْكُمَا قُلْتُ إِنْ شِئْتُمَا دَفَعْتُهَا إِلَيْكُمَا عَلَى أَنَّ عَلَيْكُمَا عَهْدَ اللَّهِ وَمِيثَاقَهُ لَتَعْمَلاَنِ فِيهَا بِمَا عَمِلَ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم، وَبِمَا عَمِلَ فِيهَا أَبُو بَكْرٍ، وَبِمَا عَمِلْتُ فِيهَا مُنْذُ وَلِيتُهَا، فَقُلْتُمَا ادْفَعْهَا إِلَيْنَا‏.‏ فَبِذَلِكَ دَفَعْتُهَا إِلَيْكُمَا، فَأَنْشُدُكُمْ بِاللَّهِ، هَلْ دَفَعْتُهَا إِلَيْهِمَا بِذَلِكَ قَالَ الرَّهْطُ نَعَمْ‏.‏ ثُمَّ أَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ أَنْشُدُكُمَا بِاللَّهِ هَلْ دَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ قَالاَ نَعَمْ‏.‏ قَالَ فَتَلْتَمِسَانِ مِنِّي قَضَاءً غَيْرَ ذَلِكَ فَوَاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، لاَ أَقْضِي فِيهَا قَضَاءً غَيْرَ ذَلِكَ، فَإِنْ عَجَزْتُمَا عَنْهَا فَادْفَعَاهَا إِلَىَّ، فَإِنِّي أَكْفِيكُمَاهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 3
			}
		}
	]
}