{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3571,
			"arabicnumber": 3571,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا سَلْمُ بْنُ زَرِيرٍ، سَمِعْتُ أَبَا رَجَاءٍ، قَالَ حَدَّثَنَا عِمْرَانُ بْنُ حُصَيْنٍ، أَنَّهُمْ كَانُوا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي مَسِيرٍ، فَأَدْلَجُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ وَجْهُ الصُّبْحِ عَرَّسُوا فَغَلَبَتْهُمْ أَعْيُنُهُمْ حَتَّى ارْتَفَعَتِ الشَّمْسُ، فَكَانَ أَوَّلَ مَنِ اسْتَيْقَظَ مِنْ مَنَامِهِ أَبُو بَكْرٍ، وَكَانَ لاَ يُوقَظُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ مَنَامِهِ حَتَّى يَسْتَيْقِظَ، فَاسْتَيْقَظَ عُمَرُ فَقَعَدَ أَبُو بَكْرٍ عِنْدَ رَأْسِهِ فَجَعَلَ يُكَبِّرُ وَيَرْفَعُ صَوْتَهُ، حَتَّى اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم فَنَزَلَ وَصَلَّى بِنَا الْغَدَاةَ، فَاعْتَزَلَ رَجُلٌ مِنَ الْقَوْمِ لَمْ يُصَلِّ مَعَنَا فَلَمَّا انْصَرَفَ قَالَ ‏\"‏ يَا فُلاَنُ مَا يَمْنَعُكَ أَنْ تُصَلِّيَ مَعَنَا ‏\"‏‏.‏ قَالَ أَصَابَتْنِي جَنَابَةٌ‏.‏ فَأَمَرَهُ أَنْ يَتَيَمَّمَ بِالصَّعِيدِ، ثُمَّ صَلَّى وَجَعَلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَكُوبٍ بَيْنَ يَدَيْهِ، وَقَدْ عَطِشْنَا عَطَشًا شَدِيدًا فَبَيْنَمَا نَحْنُ نَسِيرُ إِذَا نَحْنُ بِامْرَأَةٍ سَادِلَةٍ رِجْلَيْهَا بَيْنَ مَزَادَتَيْنِ، فَقُلْنَا لَهَا أَيْنَ الْمَاءُ فَقَالَتْ إِنَّهُ لاَ مَاءَ‏.‏ فَقُلْنَا كَمْ بَيْنَ أَهْلِكِ وَبَيْنَ الْمَاءِ قَالَتْ يَوْمٌ وَلَيْلَةٌ‏.‏ فَقُلْنَا انْطَلِقِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَتْ وَمَا رَسُولُ اللَّهِ فَلَمْ نُمَلِّكْهَا مِنْ أَمْرِهَا حَتَّى اسْتَقْبَلْنَا بِهَا النَّبِيَّ صلى الله عليه وسلم، فَحَدَّثَتْهُ بِمِثْلِ الَّذِي حَدَّثَتْنَا غَيْرَ أَنَّهَا حَدَّثَتْهُ أَنَّهَا مُؤْتِمَةٌ، فَأَمَرَ بِمَزَادَتَيْهَا فَمَسَحَ فِي الْعَزْلاَوَيْنِ، فَشَرِبْنَا عِطَاشًا أَرْبَعِينَ رَجُلاً حَتَّى رَوِينَا، فَمَلأْنَا كُلَّ قِرْبَةٍ مَعَنَا وَإِدَاوَةٍ، غَيْرَ أَنَّهُ لَمْ نَسْقِ بَعِيرًا وَهْىَ تَكَادُ تَنِضُّ مِنَ الْمِلْءِ ثُمَّ قَالَ ‏\"‏ هَاتُوا مَا عِنْدَكُمْ ‏\"‏‏.‏ فَجُمِعَ لَهَا مِنَ الْكِسَرِ وَالتَّمْرِ، حَتَّى أَتَتْ أَهْلَهَا قَالَتْ لَقِيتُ أَسْحَرَ النَّاسِ، أَوْ هُوَ نَبِيٌّ كَمَا زَعَمُوا، فَهَدَى اللَّهُ ذَاكَ الصِّرْمَ بِتِلْكَ الْمَرْأَةِ فَأَسْلَمَتْ وَأَسْلَمُوا‏.‏",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 80
			}
		}
	]
}