{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3615,
			"arabicnumber": 3615,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا أَحْمَدُ بْنُ يَزِيدَ بْنِ إِبْرَاهِيمَ أَبُو الْحَسَنِ الْحَرَّانِيُّ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا أَبُو إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، يَقُولُ جَاءَ أَبُو بَكْرٍ ـ رضى الله عنه ـ إِلَى أَبِي فِي مَنْزِلِهِ، فَاشْتَرَى مِنْهُ رَحْلاً فَقَالَ لِعَازِبٍ ابْعَثِ ابْنَكَ يَحْمِلْهُ مَعِي‏.‏ قَالَ فَحَمَلْتُهُ مَعَهُ، وَخَرَجَ أَبِي يَنْتَقِدُ ثَمَنَهُ، فَقَالَ لَهُ أَبِي يَا أَبَا بَكْرٍ حَدِّثْنِي كَيْفَ صَنَعْتُمَا حِينَ سَرَيْتَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ أَسْرَيْنَا لَيْلَتَنَا، وَمِنَ الْغَدِ حَتَّى قَامَ قَائِمُ الظَّهِيرَةِ، وَخَلاَ الطَّرِيقُ لاَ يَمُرُّ فِيهِ أَحَدٌ، فَرُفِعَتْ لَنَا صَخْرَةٌ طَوِيلَةٌ، لَهَا ظِلٌّ لَمْ تَأْتِ عَلَيْهِ الشَّمْسُ فَنَزَلْنَا عِنْدَهُ، وَسَوَّيْتُ لِلنَّبِيِّ صلى الله عليه وسلم مَكَانًا بِيَدِي يَنَامُ عَلَيْهِ، وَبَسَطْتُ فِيهِ فَرْوَةً، وَقُلْتُ نَمْ يَا رَسُولَ اللَّهِ، وَأَنَا أَنْفُضُ لَكَ مَا حَوْلَكَ‏.‏ فَنَامَ وَخَرَجْتُ أَنْفُضُ مَا حَوْلَهُ، فَإِذَا أَنَا بِرَاعٍ مُقْبِلٍ بِغَنَمِهِ إِلَى الصَّخْرَةِ يُرِيدُ مِنْهَا مِثْلَ الَّذِي أَرَدْنَا فَقُلْتُ لِمَنْ أَنْتَ يَا غُلاَمُ فَقَالَ لِرَجُلٍ مِنْ أَهْلِ الْمَدِينَةِ أَوْ مَكَّةَ‏.‏ قُلْتُ أَفِي غَنَمِكَ لَبَنٌ قَالَ نَعَمُ‏.‏ قُلْتُ أَفَتَحْلُبُ قَالَ نَعَمْ‏.‏ فَأَخَذَ شَاةً‏.‏ فَقُلْتُ انْفُضِ الضَّرْعَ مِنَ التُّرَابِ وَالشَّعَرِ وَالْقَذَى‏.‏ قَالَ فَرَأَيْتُ الْبَرَاءَ يَضْرِبُ إِحْدَى يَدَيْهِ عَلَى الأُخْرَى يَنْفُضُ، فَحَلَبَ فِي قَعْبٍ كُثْبَةً مِنْ لَبَنٍ، وَمَعِي إِدَاوَةٌ حَمَلْتُهَا لِلنَّبِيِّ صلى الله عليه وسلم يَرْتَوِي مِنْهَا، يَشْرَبُ وَيَتَوَضَّأُ، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَكَرِهْتُ أَنْ أُوقِظَهُ، فَوَافَقْتُهُ حِينَ اسْتَيْقَظَ، فَصَبَبْتُ مِنَ الْمَاءِ عَلَى اللَّبَنِ حَتَّى بَرَدَ أَسْفَلُهُ، فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ ـ قَالَ ـ فَشَرِبَ، حَتَّى رَضِيتُ ثُمَّ قَالَ ‏\"‏ أَلَمْ يَأْنِ لِلرَّحِيلِ ‏\"‏‏.‏ قُلْتُ بَلَى ـ قَالَ ـ فَارْتَحَلْنَا بَعْدَ مَا مَالَتِ الشَّمْشُ، وَاتَّبَعَنَا سُرَاقَةُ بْنُ مَالِكٍ، فَقُلْتُ أُتِينَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ لاَ تَحْزَنْ، إِنَّ اللَّهَ مَعَنَا ‏\"‏‏.‏ فَدَعَا عَلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَارْتَطَمَتْ بِهِ فَرَسُهُ إِلَى بَطْنِهَا ـ أُرَى فِي جَلَدٍ مِنَ الأَرْضِ، شَكَّ زُهَيْرٌ ـ فَقَالَ إِنِّي أُرَاكُمَا قَدْ دَعَوْتُمَا عَلَىَّ فَادْعُوَا لِي، فَاللَّهُ لَكُمَا أَنْ أَرُدَّ عَنْكُمَا الطَّلَبَ‏.‏ فَدَعَا لَهُ النَّبِيُّ صلى الله عليه وسلم فَنَجَا فَجَعَلَ لاَ يَلْقَى أَحَدًا إِلاَّ قَالَ كَفَيْتُكُمْ مَا هُنَا‏.‏ فَلاَ يَلْقَى أَحَدًا إِلاَّ رَدَّهُ‏.‏ قَالَ وَوَفَى لَنَا‏.‏",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 122
			}
		}
	]
}