{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3667,
			"arabicnumber": 3667,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَاتَ وَأَبُو بَكْرٍ بِالسُّنْحِ ـ قَالَ إِسْمَاعِيلُ يَعْنِي بِالْعَالِيَةِ ـ فَقَامَ عُمَرُ يَقُولُ وَاللَّهِ مَا مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَتْ وَقَالَ عُمَرُ وَاللَّهِ مَا كَانَ يَقَعُ فِي نَفْسِي إِلاَّ ذَاكَ وَلَيَبْعَثَنَّهُ اللَّهُ فَلَيَقْطَعَنَّ أَيْدِيَ رِجَالٍ وَأَرْجُلَهُمْ‏.‏ فَجَاءَ أَبُو بَكْرٍ فَكَشَفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَّلَهُ قَالَ بِأَبِي أَنْتَ وَأُمِّي طِبْتَ حَيًّا وَمَيِّتًا، وَالَّذِي نَفْسِي بِيَدِهِ لاَ يُذِيقُكَ اللَّهُ الْمَوْتَتَيْنِ أَبَدًا‏.‏ ثُمَّ خَرَجَ فَقَالَ أَيُّهَا الْحَالِفُ عَلَى رِسْلِكَ‏.‏ فَلَمَّا تَكَلَّمَ أَبُو بَكْرٍ جَلَسَ عُمَرُ‏.‏ فَحَمِدَ اللَّهَ أَبُو بَكْرٍ وَأَثْنَى عَلَيْهِ وَقَالَ أَلاَ مَنْ كَانَ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ‏.‏ وَقَالَ ‏{‏إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ‏}‏ وَقَالَ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ‏}‏ قَالَ فَنَشَجَ النَّاسُ يَبْكُونَ ـ قَالَ ـ وَاجْتَمَعَتِ الأَنْصَارُ إِلَى سَعْدِ بْنِ عُبَادَةَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ فَقَالُوا مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ، فَذَهَبَ إِلَيْهِمْ أَبُو بَكْرٍ وَعُمَرُ بْنُ الْخَطَّابِ وَأَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ، فَذَهَبَ عُمَرُ يَتَكَلَّمُ فَأَسْكَتَهُ أَبُو بَكْرٍ، وَكَانَ عُمَرُ يَقُولُ وَاللَّهِ مَا أَرَدْتُ بِذَلِكَ إِلاَّ أَنِّي قَدْ هَيَّأْتُ كَلاَمًا قَدْ أَعْجَبَنِي خَشِيتُ أَنْ لاَ يَبْلُغَهُ أَبُو بَكْرٍ، ثُمَّ تَكَلَّمَ أَبُو بَكْرٍ فَتَكَلَّمَ أَبْلَغَ النَّاسِ فَقَالَ فِي كَلاَمِهِ نَحْنُ الأُمَرَاءُ وَأَنْتُمُ الْوُزَرَاءُ‏.‏ فَقَالَ حُبَابُ بْنُ الْمُنْذِرِ لاَ وَاللَّهِ لاَ نَفْعَلُ، مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ‏.‏ فَقَالَ أَبُو بَكْرٍ لاَ، وَلَكِنَّا الأُمَرَاءُ وَأَنْتُمُ الْوُزَرَاءُ هُمْ أَوْسَطُ الْعَرَبِ دَارًا، وَأَعْرَبُهُمْ أَحْسَابًا فَبَايِعُوا عُمَرَ أَوْ أَبَا عُبَيْدَةَ‏.‏ فَقَالَ عُمَرُ بَلْ نُبَايِعُكَ أَنْتَ، فَأَنْتَ سَيِّدُنَا وَخَيْرُنَا وَأَحَبُّنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَخَذَ عُمَرُ بِيَدِهِ فَبَايَعَهُ، وَبَايَعَهُ النَّاسُ، فَقَالَ قَائِلٌ قَتَلْتُمْ سَعْدَ بْنَ عُبَادَةَ‏.‏ فَقَالَ عُمَرُ قَتَلَهُ اللَّهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}