{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا قَطَنٌ أَبُو الْهَيْثَمِ، حَدَّثَنَا أَبُو يَزِيدَ الْمَدَنِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِنَّ أَوَّلَ قَسَامَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ لَفِينَا بَنِي هَاشِمٍ، كَانَ رَجُلٌ مِنْ بَنِي هَاشِمٍ اسْتَأْجَرَهُ رَجُلٌ مِنْ قُرَيْشٍ مِنْ فَخِذٍ أُخْرَى، فَانْطَلَقَ مَعَهُ فِي إِبِلِهِ، فَمَرَّ رَجُلٌ بِهِ مِنْ بَنِي هَاشِمٍ قَدِ انْقَطَعَتْ عُرْوَةُ جُوَالِقِهِ فَقَالَ أَغِثْنِي بِعِقَالٍ أَشُدُّ بِهِ عُرْوَةَ جُوَالِقِي، لاَ تَنْفِرُ الإِبِلُ‏.‏ فَأَعْطَاهُ عِقَالاً، فَشَدَّ بِهِ عُرْوَةَ جُوَالِقِهِ، فَلَمَّا نَزَلُوا عُقِلَتِ الإِبِلُ إِلاَّ بَعِيرًا وَاحِدًا، فَقَالَ الَّذِي اسْتَأْجَرَهُ مَا شَأْنُ هَذَا الْبَعِيرِ لَمْ يُعْقَلْ مِنْ بَيْنِ الإِبِلِ قَالَ لَيْسَ لَهُ عِقَالٌ‏.‏ قَالَ فَأَيْنَ عِقَالُهُ قَالَ فَحَذَفَهُ بِعَصًا كَانَ فِيهَا أَجَلُهُ، فَمَرَّ بِهِ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ، فَقَالَ أَتَشْهَدُ الْمَوْسِمَ قَالَ مَا أَشْهَدُ، وَرُبَّمَا شَهِدْتُهُ‏.‏ قَالَ هَلْ أَنْتَ مُبْلِغٌ عَنِّي رِسَالَةً مَرَّةً مِنَ الدَّهْرِ قَالَ نَعَمْ‏.‏ قَالَ فَكُنْتَ إِذَا أَنْتَ شَهِدْتَ الْمَوْسِمَ فَنَادِ يَا آلَ قُرَيْشٍ‏.‏ فَإِذَا أَجَابُوكَ، فَنَادِ يَا آلَ بَنِي هَاشِمٍ‏.‏ فَإِنْ أَجَابُوكَ فَسَلْ عَنْ أَبِي طَالِبٍ، فَأَخْبِرْهُ أَنَّ فُلاَنًا قَتَلَنِي فِي عِقَالٍ، وَمَاتَ الْمُسْتَأْجَرُ، فَلَمَّا قَدِمَ الَّذِي اسْتَأْجَرَهُ أَتَاهُ أَبُو طَالِبٍ فَقَالَ مَا فَعَلَ صَاحِبُنَا قَالَ مَرِضَ، فَأَحْسَنْتُ الْقِيَامَ عَلَيْهِ، فَوَلِيتُ دَفْنَهُ‏.‏ قَالَ قَدْ كَانَ أَهْلَ ذَاكَ مِنْكَ‏.‏ فَمَكُثَ حِينًا، ثُمَّ إِنَّ الرَّجُلَ الَّذِي أَوْصَى إِلَيْهِ أَنْ يُبْلِغَ عَنْهُ وَافَى الْمَوْسِمَ فَقَالَ يَا آلَ قُرَيْشٍ‏.‏ قَالُوا هَذِهِ قُرَيْشٌ‏.‏ قَالَ يَا آلَ بَنِي هَاشِمٍ‏.‏ قَالُوا هَذِهِ بَنُو هَاشِمٍ‏.‏ قَالَ أَيْنَ أَبُو طَالِبٍ قَالُوا هَذَا أَبُو طَالِبٍ‏.‏ قَالَ أَمَرَنِي فُلاَنٌ أَنْ أُبْلِغَكَ رِسَالَةً أَنَّ فُلاَنًا قَتَلَهُ فِي عِقَالٍ‏.‏ فَأَتَاهُ أَبُو طَالِبٍ فَقَالَ لَهُ اخْتَرْ مِنَّا إِحْدَى ثَلاَثٍ، إِنْ شِئْتَ أَنْ تُؤَدِّيَ مِائَةً مِنَ الإِبِلِ، فَإِنَّكَ قَتَلْتَ صَاحِبَنَا، وَإِنْ شِئْتَ حَلَفَ خَمْسُونَ مِنْ قَوْمِكَ أَنَّكَ لَمْ تَقْتُلْهُ، فَإِنْ أَبَيْتَ قَتَلْنَاكَ بِهِ فَأَتَى قَوْمَهُ، فَقَالُوا نَحْلِفُ‏.‏ فَأَتَتْهُ امْرَأَةٌ مِنْ بَنِي هَاشِمٍ كَانَتْ تَحْتَ رَجُلٍ مِنْهُمْ قَدْ وَلَدَتْ لَهُ‏.‏ فَقَالَتْ يَا أَبَا طَالِبٍ أُحِبُّ أَنْ تُجِيزَ ابْنِي هَذَا بِرَجُلٍ مِنَ الْخَمْسِينَ وَلاَ تَصْبُرْ يَمِينَهُ حَيْثُ تُصْبَرُ الأَيْمَانُ‏.‏ فَفَعَلَ فَأَتَاهُ رَجُلٌ مِنْهُمْ فَقَالَ يَا أَبَا طَالِبٍ، أَرَدْتَ خَمْسِينَ رَجُلاً أَنْ يَحْلِفُوا مَكَانَ مِائَةٍ مِنَ الإِبِلِ، يُصِيبُ كُلَّ رَجُلٍ بَعِيرَانِ، هَذَانِ بَعِيرَانِ فَاقْبَلْهُمَا عَنِّي وَلاَ تَصْبُرْ يَمِينِي حَيْثُ تُصْبِرُ الأَيْمَانُ‏.‏ فَقَبِلَهُمَا، وَجَاءَ ثَمَانِيةٌ وَأَرْبَعُونَ فَحَلَفُوا‏.‏ قَالَ ابْنُ عَبَّاسٍ فَوَالَّذِي نَفْسِي بِيَدِهِ، مَا حَالَ الْحَوْلُ وَمِنَ الثَّمَانِيَةِ وَأَرْبَعِينَ عَيْنٌ تَطْرِفُ‏.‏",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 70
			}
		}
	]
}