{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْخِيَارِ، أَخْبَرَهُ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ قَالاَ لَهُ مَا يَمْنَعُكَ أَنْ تُكَلِّمَ خَالَكَ عُثْمَانَ فِي أَخِيهِ الْوَلِيدِ بْنِ عُقْبَةَ وَكَانَ أَكْثَرَ النَّاسُ فِيمَا فَعَلَ بِهِ‏.‏ قَالَ عُبَيْدُ اللَّهِ فَانْتَصَبْتُ لِعُثْمَانَ حِينَ خَرَجَ إِلَى الصَّلاَةِ فَقُلْتُ لَهُ إِنَّ لِي إِلَيْكَ حَاجَةً وَهْىَ نَصِيحَةٌ‏.‏ فَقَالَ أَيُّهَا الْمَرْءُ، أَعُوذُ بِاللَّهِ مِنْكَ، فَانْصَرَفْتُ، فَلَمَّا قَضَيْتُ الصَّلاَةَ جَلَسْتُ إِلَى الْمِسْوَرِ وَإِلَى ابْنِ عَبْدِ يَغُوثَ، فَحَدَّثْتُهُمَا بِالَّذِي قُلْتُ لِعُثْمَانَ وَقَالَ لِي‏.‏ فَقَالاَ قَدْ قَضَيْتَ الَّذِي كَانَ عَلَيْكَ‏.‏ فَبَيْنَمَا أَنَا جَالِسٌ مَعَهُمَا، إِذْ جَاءَنِي رَسُولُ عُثْمَانَ، فَقَالاَ لِي قَدِ ابْتَلاَكَ اللَّهُ‏.‏ فَانْطَلَقْتُ حَتَّى دَخَلْتُ عَلَيْهِ، فَقَالَ مَا نَصِيحَتُكَ الَّتِي ذَكَرْتَ آنِفًا قَالَ فَتَشَهَّدْتُ ثُمَّ قُلْتُ إِنَّ اللَّهَ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم وَأَنْزَلَ عَلَيْهِ الْكِتَابَ، وَكُنْتَ مِمَّنِ اسْتَجَابَ لِلَّهِ وَرَسُولِهِ صلى الله عليه وسلم وَآمَنْتَ بِهِ، وَهَاجَرْتَ الْهِجْرَتَيْنِ الأُولَيَيْنِ، وَصَحِبْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَرَأَيْتَ هَدْيَهُ، وَقَدْ أَكْثَرَ النَّاسُ فِي شَأْنِ الْوَلِيدِ بْنِ عُقْبَةَ، فَحَقٌّ عَلَيْكَ أَنْ تُقِيمَ عَلَيْهِ الْحَدَّ‏.‏ فَقَالَ لِي يَا ابْنَ أَخِي أَدْرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ قُلْتُ لاَ، وَلَكِنْ قَدْ خَلَصَ إِلَىَّ مِنْ عِلْمِهِ مَا خَلَصَ إِلَى الْعَذْرَاءِ فِي سِتْرِهَا‏.‏ قَالَ فَتَشَهَّدَ عُثْمَانُ فَقَالَ إِنَّ اللَّهَ قَدْ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ، وَكُنْتُ مِمَّنِ اسْتَجَابَ لِلَّهِ وَرَسُولِهِ صلى الله عليه وسلم وَآمَنْتُ بِمَا بُعِثَ بِهِ مُحَمَّدٌ صلى الله عليه وسلم‏.‏ وَهَاجَرْتُ الْهِجْرَتَيْنِ الأُولَيَيْنِ كَمَا قُلْتَ، وَصَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَبَايَعْتُهُ، وَاللَّهِ مَا عَصَيْتُهُ وَلاَ غَشَشْتُهُ حَتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ اسْتَخْلَفَ اللَّهُ أَبَا بَكْرٍ فَوَاللَّهِ مَا عَصَيْتُهُ وَلاَ غَشَشْتُهُ، ثُمَّ اسْتُخْلِفَ عُمَرُ، فَوَاللَّهِ مَا عَصَيْتُهُ وَلاَ غَشَشْتُهُ، ثُمَّ اسْتُخْلِفْتُ، أَفَلَيْسَ لِي عَلَيْكُمْ مِثْلُ الَّذِي كَانَ لَهُمْ عَلَىَّ قَالَ بَلَى‏.‏ قَالَ فَمَا هَذِهِ الأَحَادِيثُ الَّتِي تَبْلُغُنِي عَنْكُمْ فَأَمَّا مَا ذَكَرْتَ مِنْ شَأْنِ الْوَلِيدِ بْنِ عُقْبَةَ، فَسَنَأْخُذُ فِيهِ إِنْ شَاءَ اللَّهُ بِالْحَقِّ قَالَ فَجَلَدَ الْوَلِيدَ أَرْبَعِينَ جَلْدَةً، وَأَمَرَ عَلِيًّا أَنْ يَجْلِدَهُ، وَكَانَ هُوَ يَجْلِدُهُ‏.‏ وَقَالَ يُونُسُ وَابْنُ أَخِي الزُّهْرِيِّ عَنِ الزُّهْرِيِّ أَفَلَيْسَ لِي عَلَيْكُمْ مِنَ الْحَقِّ مِثْلُ الَّذِي كَانَ لَهُمْ‏.‏ قَالَ أَبُو عَبْد اللَّهِ بَلَاءٌ مِنْ رَبِّكُمْ مَا ابْتُلِيتُمْ بِهِ مِنْ شِدَّةٍ وَفِي مَوْضِعٍ الْبَلَاءُ الِابْتِلَاءُ وَالتَّمْحِيصُ مَنْ بَلَوْتُهُ وَمَحَّصْتُهُ أَيْ اسْتَخْرَجْتُ مَا عِنْدَهُ يَبْلُو يَخْتَبِرُ مُبْتَلِيكُمْ مُخْتَبِرُكُمْ وَأَمَّا قَوْلُهُ بَلَاءٌ عَظِيمٌ النِّعَمُ وَهِيَ مِنْ أَبْلَيْتُهُ وَتِلْكَ مِنْ ابْتَلَيْتُهُ",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 97
			}
		}
	]
}