{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4037,
			"arabicnumber": 4037,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ لِكَعْبِ بْنِ الأَشْرَفِ فَإِنَّهُ قَدْ آذَى اللَّهَ وَرَسُولَهُ ‏\"‏‏.‏ فَقَامَ مُحَمَّدُ بْنُ مَسْلَمَةَ فَقَالَ يَا رَسُولَ اللَّهِ أَتُحِبُّ أَنْ أَقْتُلَهُ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَأْذَنْ لِي أَنْ أَقُولَ شَيْئًا‏.‏ قَالَ ‏\"‏ قُلْ ‏\"‏‏.‏ فَأَتَاهُ مُحَمَّدُ بْنُ مَسْلَمَةَ فَقَالَ إِنَّ هَذَا الرَّجُلَ قَدْ سَأَلَنَا صَدَقَةً، وَإِنَّهُ قَدْ عَنَّانَا، وَإِنِّي قَدْ أَتَيْتُكَ أَسْتَسْلِفُكَ‏.‏ قَالَ وَأَيْضًا وَاللَّهِ لَتَمَلُّنَّهُ قَالَ إِنَّا قَدِ اتَّبَعْنَاهُ فَلاَ نُحِبُّ أَنْ نَدَعَهُ حَتَّى نَنْظُرَ إِلَى أَىِّ شَىْءٍ يَصِيرُ شَأْنُهُ، وَقَدْ أَرَدْنَا أَنْ تُسْلِفَنَا وَسْقًا، أَوْ وَسْقَيْنِ ـ وَحَدَّثَنَا عَمْرٌو غَيْرَ مَرَّةٍ، فَلَمْ يَذْكُرْ وَسْقًا أَوْ وَسْقَيْنِ أَوْ فَقُلْتُ لَهُ فِيهِ وَسْقًا أَوْ وَسْقَيْنِ فَقَالَ أُرَى فِيهِ وَسْقًا أَوْ وَسْقَيْنِ ـ فَقَالَ نَعَمِ ارْهَنُونِي‏.‏ قَالُوا أَىَّ شَىْءٍ تُرِيدُ قَالَ فَارْهَنُونِي نِسَاءَكُمْ‏.‏ قَالُوا كَيْفَ نَرْهَنُكَ نِسَاءَنَا وَأَنْتَ أَجْمَلُ الْعَرَبِ قَالَ فَارْهَنُونِي أَبْنَاءَكُمْ‏.‏ قَالُوا كَيْفَ نَرْهَنُكَ أَبْنَاءَنَا فَيُسَبُّ أَحَدُهُمْ، فَيُقَالُ رُهِنَ بِوَسْقٍ أَوْ وَسْقَيْنِ‏.‏ هَذَا عَارٌ عَلَيْنَا، وَلَكِنَّا نَرْهَنُكَ اللأْمَةَ ـ قَالَ سُفْيَانُ يَعْنِي السِّلاَحَ ـ فَوَاعَدَهُ أَنْ يَأْتِيَهُ، فَجَاءَهُ لَيْلاً وَمَعَهُ أَبُو نَائِلَةَ وَهْوَ أَخُو كَعْبٍ مِنَ الرَّضَاعَةِ، فَدَعَاهُمْ إِلَى الْحِصْنِ، فَنَزَلَ إِلَيْهِمْ فَقَالَتْ لَهُ امْرَأَتُهُ أَيْنَ تَخْرُجُ هَذِهِ السَّاعَةَ فَقَالَ إِنَّمَا هُوَ مُحَمَّدُ بْنُ مَسْلَمَةَ، وَأَخِي أَبُو نَائِلَةَ ـ وَقَالَ غَيْرُ عَمْرٍو قَالَتْ أَسْمَعُ صَوْتًا كَأَنَّهُ يَقْطُرُ مِنْهُ الدَّمُ‏.‏ قَالَ إِنَّمَا هُوَ أَخِي مُحَمَّدُ بْنُ مَسْلَمَةَ وَرَضِيعِي أَبُو نَائِلَةَ ـ إِنَّ الْكَرِيمَ لَوْ دُعِيَ إِلَى طَعْنَةٍ بِلَيْلٍ لأَجَابَ قَالَ وَيُدْخِلُ مُحَمَّدُ بْنُ مَسْلَمَةَ مَعَهُ رَجُلَيْنِ ـ قِيلَ لِسُفْيَانَ سَمَّاهُمْ عَمْرٌو قَالَ سَمَّى بَعْضَهُمْ قَالَ عَمْرٌو جَاءَ مَعَهُ بِرَجُلَيْنِ وَقَالَ غَيْرُ عَمْرٍو أَبُو عَبْسِ بْنُ جَبْرٍ، وَالْحَارِثُ بْنُ أَوْسٍ وَعَبَّادُ بْنُ بِشْرٍ قَالَ عَمْرٌو وَجَاءَ مَعَهُ بِرَجُلَيْنِ ـ فَقَالَ إِذَا مَا جَاءَ فَإِنِّي قَائِلٌ بِشَعَرِهِ فَأَشَمُّهُ، فَإِذَا رَأَيْتُمُونِي اسْتَمْكَنْتُ مِنْ رَأْسِهِ فَدُونَكُمْ فَاضْرِبُوهُ‏.‏ وَقَالَ مَرَّةً ثُمَّ أُشِمُّكُمْ‏.‏ فَنَزَلَ إِلَيْهِمْ مُتَوَشِّحًا وَهْوَ يَنْفَحُ مِنْهُ رِيحُ الطِّيبِ، فَقَالَ مَا رَأَيْتُ كَالْيَوْمِ رِيحًا ـ أَىْ أَطْيَبَ ـ وَقَالَ غَيْرُ عَمْرٍو قَالَ عِنْدِي أَعْطَرُ نِسَاءِ الْعَرَبِ وَأَكْمَلُ الْعَرَبِ قَالَ عَمْرٌو فَقَالَ أَتَأْذَنُ لِي أَنْ أَشَمَّ رَأْسَكَ قَالَ نَعَمْ، فَشَمَّهُ، ثُمَّ أَشَمَّ أَصْحَابَهُ ثُمَّ قَالَ أَتَأْذَنُ لِي قَالَ نَعَمْ‏.‏ فَلَمَّا اسْتَمْكَنَ مِنْهُ قَالَ دُونَكُمْ‏.‏ فَقَتَلُوهُ ثُمَّ أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرُوهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 84
			}
		}
	]
}