{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4039,
			"arabicnumber": 4039,
			"text": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَبِي رَافِعٍ الْيَهُودِيِّ رِجَالاً مِنَ الأَنْصَارِ، فَأَمَّرَ عَلَيْهِمْ عَبْدَ اللَّهِ بْنَ عَتِيكٍ، وَكَانَ أَبُو رَافِعٍ يُؤْذِي رَسُولَ اللَّهِ صلى الله عليه وسلم وَيُعِينُ عَلَيْهِ، وَكَانَ فِي حِصْنٍ لَهُ بِأَرْضِ الْحِجَازِ، فَلَمَّا دَنَوْا مِنْهُ، وَقَدْ غَرَبَتِ الشَّمْسُ، وَرَاحَ النَّاسُ بِسَرْحِهِمْ فَقَالَ عَبْدُ اللَّهِ لأَصْحَابِهِ اجْلِسُوا مَكَانَكُمْ، فَإِنِّي مُنْطَلِقٌ، وَمُتَلَطِّفٌ لِلْبَوَّابِ، لَعَلِّي أَنْ أَدْخُلَ‏.‏ فَأَقْبَلَ حَتَّى دَنَا مِنَ الْبَابِ ثُمَّ تَقَنَّعَ بِثَوْبِهِ كَأَنَّهُ يَقْضِي حَاجَةً، وَقَدْ دَخَلَ النَّاسُ، فَهَتَفَ بِهِ الْبَوَّابُ يَا عَبْدَ اللَّهِ إِنْ كُنْتَ تُرِيدُ أَنْ تَدْخُلَ فَادْخُلْ، فَإِنِّي أُرِيدُ أَنْ أُغْلِقَ الْبَابَ‏.‏ فَدَخَلْتُ فَكَمَنْتُ، فَلَمَّا دَخَلَ النَّاسُ أَغْلَقَ الْبَابَ، ثُمَّ عَلَّقَ الأَغَالِيقَ عَلَى وَتَدٍ قَالَ فَقُمْتُ إِلَى الأَقَالِيدِ، فَأَخَذْتُهَا فَفَتَحْتُ الْبَابَ، وَكَانَ أَبُو رَافِعٍ يُسْمَرُ عِنْدَهُ، وَكَانَ فِي عَلاَلِيَّ لَهُ، فَلَمَّا ذَهَبَ عَنْهُ أَهْلُ سَمَرِهِ صَعِدْتُ إِلَيْهِ، فَجَعَلْتُ كُلَّمَا فَتَحْتُ بَابًا أَغْلَقْتُ عَلَىَّ مِنْ دَاخِلٍ، قُلْتُ إِنِ الْقَوْمُ نَذِرُوا بِي لَمْ يَخْلُصُوا إِلَىَّ حَتَّى أَقْتُلَهُ‏.‏ فَانْتَهَيْتُ إِلَيْهِ، فَإِذَا هُوَ فِي بَيْتٍ مُظْلِمٍ وَسْطَ عِيَالِهِ، لاَ أَدْرِي أَيْنَ هُوَ مِنَ الْبَيْتِ فَقُلْتُ يَا أَبَا رَافِعٍ‏.‏ قَالَ مَنْ هَذَا فَأَهْوَيْتُ نَحْوَ الصَّوْتِ، فَأَضْرِبُهُ ضَرْبَةً بِالسَّيْفِ، وَأَنَا دَهِشٌ فَمَا أَغْنَيْتُ شَيْئًا، وَصَاحَ فَخَرَجْتُ مِنَ الْبَيْتِ، فَأَمْكُثُ غَيْرَ بَعِيدٍ ثُمَّ دَخَلْتُ إِلَيْهِ فَقُلْتُ مَا هَذَا الصَّوْتُ يَا أَبَا رَافِعٍ‏.‏ فَقَالَ لأُمِّكَ الْوَيْلُ، إِنَّ رَجُلاً فِي الْبَيْتِ ضَرَبَنِي قَبْلُ بِالسَّيْفِ، قَالَ فَأَضْرِبُهُ ضَرْبَةً أَثْخَنَتْهُ وَلَمْ أَقْتُلْهُ، ثُمَّ وَضَعْتُ ظُبَةَ السَّيْفِ فِي بَطْنِهِ حَتَّى أَخَذَ فِي ظَهْرِهِ، فَعَرَفْتُ أَنِّي قَتَلْتُهُ، فَجَعَلْتُ أَفْتَحُ الأَبْوَابَ بَابًا بَابًا حَتَّى انْتَهَيْتُ إِلَى دَرَجَةٍ لَهُ، فَوَضَعْتُ رِجْلِي وَأَنَا أُرَى أَنِّي قَدِ انْتَهَيْتُ إِلَى الأَرْضِ فَوَقَعْتُ فِي لَيْلَةٍ مُقْمِرَةٍ، فَانْكَسَرَتْ سَاقِي، فَعَصَبْتُهَا بِعِمَامَةٍ، ثُمَّ انْطَلَقْتُ حَتَّى جَلَسْتُ عَلَى الْبَابِ فَقُلْتُ لاَ أَخْرُجُ اللَّيْلَةَ حَتَّى أَعْلَمَ أَقَتَلْتُهُ فَلَمَّا صَاحَ الدِّيكُ قَامَ النَّاعِي عَلَى السُّورِ فَقَالَ أَنْعَى أَبَا رَافِعٍ تَاجِرَ أَهْلِ الْحِجَازِ‏.‏ فَانْطَلَقْتُ إِلَى أَصْحَابِي فَقُلْتُ النَّجَاءَ، فَقَدْ قَتَلَ اللَّهُ أَبَا رَافِعٍ‏.‏ فَانْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَحَدَّثْتُهُ فَقَالَ ‏ \"‏ ابْسُطْ رِجْلَكَ ‏\"‏‏.‏ فَبَسَطْتُ رِجْلِي، فَمَسَحَهَا، فَكَأَنَّهَا لَمْ أَشْتَكِهَا قَطُّ‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 86
			}
		}
	]
}