{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4072,
			"arabicnumber": 4072,
			"text": "حَدَّثَنِي أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، قَالَ خَرَجْتُ مَعَ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ، فَلَمَّا قَدِمْنَا حِمْصَ قَالَ لِي عُبَيْدُ اللَّهِ هَلْ لَكَ فِي وَحْشِيٍّ نَسْأَلُهُ عَنْ قَتْلِ حَمْزَةَ قُلْتُ نَعَمْ‏.‏ وَكَانَ وَحْشِيٌّ يَسْكُنُ حِمْصَ فَسَأَلْنَا عَنْهُ فَقِيلَ لَنَا هُوَ ذَاكَ فِي ظِلِّ قَصْرِهِ، كَأَنَّهُ حَمِيتٌ‏.‏ قَالَ فَجِئْنَا حَتَّى وَقَفْنَا عَلَيْهِ بِيَسِيرٍ، فَسَلَّمْنَا، فَرَدَّ السَّلاَمَ، قَالَ وَعُبَيْدُ اللَّهِ مُعْتَجِرٌ بِعِمَامَتِهِ، مَا يَرَى وَحْشِيٌّ إِلاَّ عَيْنَيْهِ وَرِجْلَيْهِ، فَقَالَ عُبَيْدُ اللَّهِ يَا وَحْشِيُّ أَتَعْرِفُنِي قَالَ فَنَظَرَ إِلَيْهِ ثُمَّ قَالَ لاَ وَاللَّهِ إِلاَّ أَنِّي أَعْلَمُ أَنَّ عَدِيَّ بْنَ الْخِيَارِ تَزَوَّجَ امْرَأَةً يُقَالُ لَهَا أُمُّ قِتَالٍ بِنْتُ أَبِي الْعِيصِ، فَوَلَدَتْ لَهُ غُلاَمًا بِمَكَّةَ، فَكُنْتُ أَسْتَرْضِعُ لَهُ، فَحَمَلْتُ ذَلِكَ الْغُلاَمَ مَعَ أُمِّهِ، فَنَاوَلْتُهَا إِيَّاهُ، فَلَكَأَنِّي نَظَرْتُ إِلَى قَدَمَيْكَ‏.‏ قَالَ فَكَشَفَ عُبَيْدُ اللَّهِ عَنْ وَجْهِهِ ثُمَّ قَالَ أَلاَ تُخْبِرُنَا بِقَتْلِ حَمْزَةَ قَالَ نَعَمْ، إِنَّ حَمْزَةَ قَتَلَ طُعَيْمَةَ بْنَ عَدِيِّ بْنِ الْخِيَارِ بِبَدْرٍ، فَقَالَ لِي مَوْلاَىَ جُبَيْرُ بْنُ مُطْعِمٍ إِنْ قَتَلْتَ حَمْزَةَ بِعَمِّي فَأَنْتَ حُرٌّ، قَالَ فَلَمَّا أَنْ خَرَجَ النَّاسُ عَامَ عَيْنَيْنِ ـ وَعَيْنَيْنِ جَبَلٌ بِحِيَالِ أُحُدٍ، بَيْنَهُ وَبَيْنَهُ وَادٍ ـ خَرَجْتُ مَعَ النَّاسِ إِلَى الْقِتَالِ، فَلَمَّا اصْطَفُّوا لِلْقِتَالِ خَرَجَ سِبَاعٌ فَقَالَ هَلْ مِنْ مُبَارِزٍ قَالَ فَخَرَجَ إِلَيْهِ حَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ فَقَالَ يَا سِبَاعُ يَا ابْنَ أُمِّ أَنْمَارٍ مُقَطِّعَةِ الْبُظُورِ، أَتُحَادُّ اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم قَالَ ثُمَّ شَدَّ عَلَيْهِ فَكَانَ كَأَمْسِ الذَّاهِبِ ـ قَالَ ـ وَكَمَنْتُ لِحَمْزَةَ تَحْتَ صَخْرَةٍ فَلَمَّا دَنَا مِنِّي رَمَيْتُهُ بِحَرْبَتِي، فَأَضَعُهَا فِي ثُنَّتِهِ حَتَّى خَرَجَتْ مِنْ بَيْنِ وَرِكَيْهِ ـ قَالَ ـ فَكَانَ ذَاكَ الْعَهْدَ بِهِ، فَلَمَّا رَجَعَ النَّاسُ رَجَعْتُ مَعَهُمْ فَأَقَمْتُ بِمَكَّةَ، حَتَّى فَشَا فِيهَا الإِسْلاَمُ، ثُمَّ خَرَجْتُ إِلَى الطَّائِفِ، فَأَرْسَلُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم رَسُولاً، فَقِيلَ لِي إِنَّهُ لاَ يَهِيجُ الرُّسُلَ ـ قَالَ ـ فَخَرَجْتُ مَعَهُمْ حَتَّى قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَآنِي قَالَ ‏\"‏ آنْتَ وَحْشِيٌّ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ أَنْتَ قَتَلْتَ حَمْزَةَ ‏\"‏‏.‏ قُلْتُ قَدْ كَانَ مِنَ الأَمْرِ مَا بَلَغَكَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تُغَيِّبَ وَجْهَكَ عَنِّي ‏\"‏‏.‏ قَالَ فَخَرَجْتُ، فَلَمَّا قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَرَجَ مُسَيْلِمَةُ الْكَذَّابُ قُلْتُ لأَخْرُجَنَّ إِلَى مُسَيْلِمَةَ لَعَلِّي أَقْتُلُهُ فَأُكَافِئَ بِهِ حَمْزَةَ ـ قَالَ ـ فَخَرَجْتُ مَعَ النَّاسِ، فَكَانَ مِنْ أَمْرِهِ مَا كَانَ ـ قَالَ ـ فَإِذَا رَجُلٌ قَائِمٌ فِي ثَلْمَةِ جِدَارٍ، كَأَنَّهُ جَمَلٌ أَوْرَقُ ثَائِرُ الرَّأْسِ ـ قَالَ ـ فَرَمَيْتُهُ بِحَرْبَتِي، فَأَضَعُهَا بَيْنَ ثَدْيَيْهِ حَتَّى خَرَجَتْ مِنْ بَيْنِ كَتِفَيْهِ ـ قَالَ ـ وَوَثَبَ إِلَيْهِ رَجُلٌ مِنَ الأَنْصَارِ، فَضَرَبَهُ بِالسَّيْفِ عَلَى هَامَتِهِ‏.‏ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ الْفَضْلِ فَأَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ فَقَالَتْ جَارِيَةٌ عَلَى ظَهْرِ بَيْتٍ وَا أَمِيرَ الْمُؤْمِنِينَ، قَتَلَهُ الْعَبْدُ الأَسْوَدُ‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 117
			}
		}
	]
}