{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4086,
			"arabicnumber": 4086,
			"text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عَمْرِو بْنِ أَبِي سُفْيَانَ الثَّقَفِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَرِيَّةً عَيْنًا، وَأَمَّرَ عَلَيْهِمْ عَاصِمَ بْنَ ثَابِتٍ ـ وَهْوَ جَدُّ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ ـ فَانْطَلَقُوا حَتَّى إِذَا كَانَ بَيْنَ عُسْفَانَ وَمَكَّةَ ذُكِرُوا لَحِيٍّ مِنْ هُذَيْلٍ، يُقَالُ لَهُمْ بَنُو لَحْيَانَ، فَتَبِعُوهُمْ بِقَرِيبٍ مِنْ مِائَةِ رَامٍ، فَاقْتَصُّوا آثَارَهُمْ حَتَّى أَتَوْا مَنْزِلاً نَزَلُوهُ فَوَجَدُوا فِيهِ نَوَى تَمْرٍ تَزَوَّدُوهُ مِنَ الْمَدِينَةِ فَقَالُوا هَذَا تَمْرُ يَثْرِبَ‏.‏ فَتَبِعُوا آثَارَهُمْ حَتَّى لَحِقُوهُمْ، فَلَمَّا انْتَهَى عَاصِمٌ وَأَصْحَابُهُ لَجَئُوا إِلَى فَدْفَدٍ، وَجَاءَ الْقَوْمُ فَأَحَاطُوا بِهِمْ، فَقَالُوا لَكُمُ الْعَهْدُ وَالْمِيثَاقُ إِنْ نَزَلْتُمْ إِلَيْنَا أَنْ لاَ نَقْتُلَ مِنْكُمْ رَجُلاً‏.‏ فَقَالَ عَاصِمٌ أَمَّا أَنَا فَلاَ أَنْزِلُ فِي ذِمَّةِ كَافِرٍ، اللَّهُمَّ أَخْبِرْ عَنَّا نَبِيَّكَ‏.‏ فَقَاتَلُوهُمْ حَتَّى قَتَلُوا عَاصِمًا فِي سَبْعَةِ نَفَرٍ بِالنَّبْلِ، وَبَقِيَ خُبَيْبٌ، وَزَيْدٌ وَرَجُلٌ آخَرُ، فَأَعْطَوْهُمُ الْعَهْدَ وَالْمِيثَاقَ، فَلَمَّا أَعْطَوْهُمُ الْعَهْدَ وَالْمِيثَاقَ نَزَلُوا إِلَيْهِمْ، فَلَمَّا اسْتَمْكَنُوا مِنْهُمْ حَلُّوا أَوْتَارَ قِسِيِّهِمْ فَرَبَطُوهُمْ بِهَا‏.‏ فَقَالَ الرَّجُلُ الثَّالِثُ الَّذِي مَعَهُمَا هَذَا أَوَّلُ الْغَدْرِ‏.‏ فَأَبَى أَنْ يَصْحَبَهُمْ فَجَرَّرُوهُ وَعَالَجُوهُ عَلَى أَنْ يَصْحَبَهُمْ، فَلَمْ يَفْعَلْ، فَقَتَلُوهُ، وَانْطَلَقُوا بِخُبَيْبٍ وَزَيْدٍ حَتَّى بَاعُوهُمَا بِمَكَّةَ، فَاشْتَرَى خُبَيْبًا بَنُو الْحَارِثِ بْنِ عَامِرِ بْنِ نَوْفَلٍ، وَكَانَ خُبَيْبٌ هُوَ قَتَلَ الْحَارِثَ يَوْمَ بَدْرٍ، فَمَكَثَ عِنْدَهُمْ أَسِيرًا حَتَّى إِذَا أَجْمَعُوا قَتْلَهُ اسْتَعَارَ مُوسَى مِنْ بَعْضِ بَنَاتِ الْحَارِثِ أَسْتَحِدَّ بِهَا فَأَعَارَتْهُ، قَالَتْ فَغَفَلْتُ عَنْ صَبِيٍّ لِي فَدَرَجَ إِلَيْهِ حَتَّى أَتَاهُ، فَوَضَعَهُ عَلَى فَخِذِهِ، فَلَمَّا رَأَيْتُهُ فَزِعْتُ فَزْعَةً عَرَفَ ذَاكَ مِنِّي، وَفِي يَدِهِ الْمُوسَى فَقَالَ أَتَخْشَيْنَ أَنْ أَقْتُلَهُ مَا كُنْتُ لأَفْعَلَ ذَاكِ إِنْ شَاءَ اللَّهُ‏.‏ وَكَانَتْ تَقُولُ مَا رَأَيْتُ أَسِيرًا قَطُّ خَيْرًا مِنْ خُبَيْبٍ، لَقَدْ رَأَيْتُهُ يَأْكُلُ مِنْ قِطْفِ عِنَبٍ، وَمَا بِمَكَّةَ يَوْمَئِذٍ ثَمَرَةٌ، وَإِنَّهُ لَمُوثَقٌ فِي الْحَدِيدِ، وَمَا كَانَ إِلاَّ رِزْقٌ رَزَقَهُ اللَّهُ، فَخَرَجُوا بِهِ مِنَ الْحَرَمِ، لِيَقْتُلُوهُ فَقَالَ دَعُونِي أُصَلِّي رَكْعَتَيْنِ‏.‏ ثُمَّ انْصَرَفَ إِلَيْهِمْ فَقَالَ لَوْلاَ أَنْ تَرَوْا أَنَّ مَا بِي جَزَعٌ مِنَ الْمَوْتِ، لَزِدْتُ‏.‏ فَكَانَ أَوَّلَ مَنْ سَنَّ الرَّكْعَتَيْنِ عِنْدَ الْقَتْلِ هُوَ، ثُمَّ قَالَ اللَّهُمَّ أَحْصِهِمْ عَدَدًا ثُمَّ قَالَ مَا أُبَالِي حِينَ أُقْتَلُ مُسْلِمًا عَلَى أَىِّ شِقٍّ كَانَ لِلَّهِ مَصْرَعِي وَذَلِكَ فِي ذَاتِ الإِلَهِ وَإِنْ يَشَأْ يُبَارِكْ عَلَى أَوْصَالِ شِلْوٍ مُمَزَّعِ ثُمَّ قَامَ إِلَيْهِ عُقْبَةُ بْنُ الْحَارِثِ فَقَتَلَهُ، وَبَعَثَ قُرَيْشٌ إِلَى عَاصِمٍ لِيُؤْتَوْا بِشَىْءٍ مِنْ جَسَدِهِ يَعْرِفُونَهُ، وَكَانَ عَاصِمٌ قَتَلَ عَظِيمًا مِنْ عُظَمَائِهِمْ يَوْمَ بَدْرٍ، فَبَعَثَ اللَّهُ عَلَيْهِ مِثْلَ الظُّلَّةِ مِنَ الدَّبْرِ، فَحَمَتْهُ مِنْ رُسُلِهِمْ، فَلَمْ يَقْدِرُوا مِنْهُ عَلَى شَىْءٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 130
			}
		}
	]
}