{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4102,
			"arabicnumber": 4102,
			"text": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، أَخْبَرَنَا سَعِيدُ بْنُ مِينَاءَ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ لَمَّا حُفِرَ الْخَنْدَقُ رَأَيْتُ بِالنَّبِيِّ صلى الله عليه وسلم خَمَصًا شَدِيدًا، فَانْكَفَأْتُ إِلَى امْرَأَتِي فَقُلْتُ هَلْ عِنْدَكِ شَىْءٌ فَإِنِّي رَأَيْتُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم خَمَصًا شَدِيدًا‏.‏ فَأَخْرَجَتْ إِلَىَّ جِرَابًا فِيهِ صَاعٌ مِنْ شَعِيرٍ، وَلَنَا بُهَيْمَةٌ دَاجِنٌ فَذَبَحْتُهَا، وَطَحَنَتِ الشَّعِيرَ فَفَرَغَتْ إِلَى فَرَاغِي، وَقَطَّعْتُهَا فِي بُرْمَتِهَا، ثُمَّ وَلَّيْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ لاَ تَفْضَحْنِي بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِمَنْ مَعَهُ‏.‏ فَجِئْتُهُ فَسَارَرْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ ذَبَحْنَا بُهَيْمَةً لَنَا وَطَحَنَّا صَاعًا مِنْ شَعِيرٍ كَانَ عِنْدَنَا، فَتَعَالَ أَنْتَ وَنَفَرٌ مَعَكَ‏.‏ فَصَاحَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَا أَهْلَ الْخَنْدَقِ، إِنَّ جَابِرًا قَدْ صَنَعَ سُورًا فَحَىَّ هَلاً بِكُمْ ‏\"‏‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُنْزِلُنَّ بُرْمَتَكُمْ، وَلاَ تَخْبِزُنَّ عَجِينَكُمْ حَتَّى أَجِيءَ ‏\"‏‏.‏ فَجِئْتُ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْدُمُ النَّاسَ حَتَّى جِئْتُ امْرَأَتِي، فَقَالَتْ بِكَ وَبِكَ‏.‏ فَقُلْتُ قَدْ فَعَلْتُ الَّذِي قُلْتِ‏.‏ فَأَخْرَجَتْ لَهُ عَجِينًا، فَبَصَقَ فِيهِ وَبَارَكَ، ثُمَّ عَمَدَ إِلَى بُرْمَتِنَا فَبَصَقَ وَبَارَكَ ثُمَّ قَالَ ‏\"‏ ادْعُ خَابِزَةً فَلْتَخْبِزْ مَعِي وَاقْدَحِي مِنْ بُرْمَتِكُمْ وَلاَ تُنْزِلُوهَا‏\"‏، وَهُمْ أَلْفٌ، فَأُقْسِمُ بِاللَّهِ لَقَدْ أَكَلُوا حَتَّى تَرَكُوهُ وَانْحَرَفُوا، وَإِنَّ بُرْمَتَنَا لَتَغِطُّ كَمَا هِيَ، وَإِنَّ عَجِينَنَا لَيُخْبَزُ كَمَا هُوَ‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 146
			}
		}
	]
}