{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4251,
			"arabicnumber": 4251,
			"text": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ لَمَّا اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ، فَأَبَى أَهْلُ مَكَّةَ أَنْ يَدَعُوهُ يَدْخُلُ مَكَّةَ، حَتَّى قَاضَاهُمْ عَلَى أَنْ يُقِيمَ بِهَا ثَلاَثَةَ أَيَّامٍ، فَلَمَّا كَتَبُوا الْكِتَابَ كَتَبُوا، هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ قَالُوا لاَ نُقِرُّ بِهَذَا، لَوْ نَعْلَمُ أَنَّكَ رَسُولُ اللَّهِ مَا مَنَعْنَاكَ شَيْئًا، وَلَكِنْ أَنْتَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ‏.‏ فَقَالَ ‏\"‏ أَنَا رَسُولُ اللَّهِ، وَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ‏\"‏‏.‏ ثُمَّ قَالَ لِعَلِيٍّ ‏\"‏ امْحُ رَسُولَ اللَّهِ ‏\"‏‏.‏ قَالَ عَلِيٌّ لاَ وَاللَّهِ لاَ أَمْحُوكَ أَبَدًا‏.‏ فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْكِتَابَ، وَلَيْسَ يُحْسِنُ يَكْتُبُ، فَكَتَبَ هَذَا مَا قَاضَى مُحَمَّدُ بْنُ عَبْدِ اللَّهِ لاَ يُدْخِلُ مَكَّةَ السِّلاَحَ، إِلاَّ السَّيْفَ فِي الْقِرَابِ، وَأَنْ لاَ يَخْرُجَ مِنْ أَهْلِهَا بِأَحَدٍ، إِنْ أَرَادَ أَنْ يَتْبَعَهُ، وَأَنْ لاَ يَمْنَعَ مِنْ أَصْحَابِهِ أَحَدًا، إِنْ أَرَادَ أَنْ يُقِيمَ بِهَا‏.‏ فَلَمَّا دَخَلَهَا وَمَضَى الأَجَلُ أَتَوْا عَلِيًّا فَقَالُوا قُلْ لِصَاحِبِكَ اخْرُجْ عَنَّا، فَقَدْ مَضَى الأَجَلُ‏.‏ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَتَبِعَتْهُ ابْنَةُ حَمْزَةَ تُنَادِي يَا عَمِّ يَا عَمِّ‏.‏ فَتَنَاوَلَهَا عَلِيٌّ، فَأَخَذَ بِيَدِهَا وَقَالَ لِفَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ دُونَكِ ابْنَةَ عَمِّكِ‏.‏ حَمَلَتْهَا فَاخْتَصَمَ فِيهَا عَلِيٌّ وَزَيْدٌ وَجَعْفَرٌ‏.‏ قَالَ عَلِيٌّ أَنَا أَخَذْتُهَا وَهْىَ بِنْتُ عَمِّي‏.‏ وَقَالَ جَعْفَرٌ ابْنَةُ عَمِّي وَخَالَتُهَا تَحْتِي‏.‏ وَقَالَ زَيْدٌ ابْنَةُ أَخِي‏.‏ فَقَضَى بِهَا النَّبِيُّ صلى الله عليه وسلم لِخَالَتِهَا وَقَالَ ‏\"‏ الْخَالَةُ بِمَنْزِلَةِ الأُمِّ ‏\"‏‏.‏ وَقَالَ لِعَلِيٍّ ‏\"‏ أَنْتَ مِنِّي وَأَنَا مِنْكَ ‏\"‏‏.‏ وَقَالَ لِجَعْفَرٍ ‏\"‏ أَشْبَهْتَ خَلْقِي وَخُلُقِي ‏\"‏‏.‏ وَقَالَ لِزَيْدٍ ‏\"‏ أَنْتَ أَخُونَا وَمَوْلاَنَا ‏\"‏‏.‏ وَقَالَ عَلِيٌّ أَلاَ تَتَزَوَّجُ بِنْتَ حَمْزَةَ‏.‏ قَالَ ‏\"‏ إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 286
			}
		}
	]
}