{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4701,
			"arabicnumber": 4701,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قَضَى اللَّهُ الأَمْرَ فِي السَّمَاءِ ضَرَبَتِ الْمَلاَئِكَةُ بِأَجْنِحَتِهَا خُضْعَانًا لِقَوْلِهِ كَالسِّلْسِلَةِ عَلَى صَفْوَانٍ ـ قَالَ عَلِيٌّ وَقَالَ غَيْرُهُ صَفْوَانٍ ـ يَنْفُذُهُمْ ذَلِكَ فَإِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ، قَالُوا لِلَّذِي قَالَ الْحَقَّ وَهْوَ الْعَلِيُّ الْكَبِيرُ، فَيَسْمَعُهَا مُسْتَرِقُو السَّمْعِ، وَمُسْتَرِقُو السَّمْعِ هَكَذَا وَاحِدٌ فَوْقَ آخَرَ ـ وَوَصَفَ سُفْيَانُ بِيَدِهِ، وَفَرَّجَ بَيْنَ أَصَابِعِ يَدِهِ الْيُمْنَى، نَصَبَهَا بَعْضَهَا فَوْقَ بَعْضٍ ـ فَرُبَّمَا أَدْرَكَ الشِّهَابُ الْمُسْتَمِعَ، قَبْلَ أَنْ يَرْمِيَ بِهَا إِلَى صَاحِبِهِ، فَيُحْرِقَهُ وَرُبَّمَا لَمْ يُدْرِكْهُ حَتَّى يَرْمِيَ بِهَا إِلَى الَّذِي يَلِيهِ إِلَى الَّذِي هُوَ أَسْفَلُ مِنْهُ حَتَّى يُلْقُوهَا إِلَى الأَرْضِ ـ وَرُبَّمَا قَالَ سُفْيَانُ حَتَّى تَنْتَهِيَ إِلَى الأَرْضِ ـ فَتُلْقَى عَلَى فَمِ السَّاحِرِ، فَيَكْذِبُ مَعَهَا مِائَةَ كَذْبَةٍ فَيَصْدُقُ، فَيَقُولُونَ أَلَمْ يُخْبِرْنَا يَوْمَ كَذَا وَكَذَا يَكُونُ كَذَا وَكَذَا، فَوَجَدْنَاهُ حَقًّا لِلْكَلِمَةِ الَّتِي سُمِعَتْ مِنَ السَّمَاءِ ‏\"‏‏.‏ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، إِذَا قَضَى اللَّهُ الأَمْرَ‏.‏ وَزَادَ الْكَاهِنِ‏.‏ وَحَدَّثَنَا سُفْيَانُ فَقَالَ قَالَ عَمْرٌو سَمِعْتُ عِكْرِمَةَ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَ إِذَا قَضَى اللَّهُ الأَمْرَ وَقَالَ عَلَى فَمِ السَّاحِرِ‏.‏ قُلْتُ لِسُفْيَانَ قَالَ سَمِعْتُ عِكْرِمَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ‏.‏ قَالَ نَعَمْ‏.‏ قُلْتُ لِسُفْيَانَ إِنَّ إِنْسَانًا رَوَى عَنْكَ عَنْ عَمْرٍو عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ وَيَرْفَعُهُ أَنَّهُ قَرَأَ فُزِّعَ‏.‏ قَالَ سُفْيَانُ هَكَذَا قَرَأَ عَمْرٌو‏.‏ فَلاَ أَدْرِي سَمِعَهُ هَكَذَا أَمْ لاَ‏.‏ قَالَ سُفْيَانُ وَهْىَ قِرَاءَتُنَا‏.‏",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 223
			}
		}
	]
}