{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، وَعَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ وَغَيْرَهُمَا قَدْ سَمِعْتُهُ يُحَدِّثُهُ عَنْ سَعِيدٍ قَالَ إِنَّا لَعِنْدَ ابْنِ عَبَّاسٍ فِي بَيْتِهِ، إِذْ قَالَ سَلُونِي قُلْتُ أَىْ أَبَا عَبَّاسٍ ـ جَعَلَنِي اللَّهُ فِدَاكَ ـ بِالْكُوفَةِ رَجُلٌ قَاصٌّ يُقَالُ لَهُ نَوْفٌ، يَزْعُمُ أَنَّهُ لَيْسَ بِمُوسَى بَنِي إِسْرَائِيلَ، أَمَّا عَمْرٌو فَقَالَ لِي قَالَ قَدْ كَذَبَ عَدُوُّ اللَّهِ، وَأَمَّا يَعْلَى فَقَالَ لِي قَالَ ابْنُ عَبَّاسٍ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مُوسَى رَسُولُ اللَّهِ ـ عَلَيْهِ السَّلاَمُ ـ قَالَ ذَكَّرَ النَّاسَ يَوْمًا حَتَّى إِذَا فَاضَتِ الْعُيُونُ، وَرَقَّتِ الْقُلُوبُ وَلَّى، فَأَدْرَكَهُ رَجُلٌ، فَقَالَ أَىْ رَسُولَ اللَّهِ هَلْ فِي الأَرْضِ أَحَدٌ أَعْلَمُ مِنْكَ قَالَ لاَ، فَعَتَبَ عَلَيْهِ إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَى اللَّهِ قِيلَ بَلَى قَالَ أَىْ رَبِّ فَأَيْنَ قَالَ بِمَجْمَعِ الْبَحْرَيْنِ قَالَ أَىْ رَبِّ اجْعَلْ لِي عَلَمًا أَعْلَمُ ذَلِكَ بِهِ ‏\"‏‏.‏ فَقَالَ لِي عَمْرٌو قَالَ ‏\"‏ حَيْثُ يُفَارِقُكَ الْحُوتُ ‏\"‏‏.‏ وَقَالَ لِي يَعْلَى قَالَ ‏\"‏ خُذْ نُونًا مَيِّتًا حَيْثُ يُنْفَخُ فِيهِ الرُّوحُ، فَأَخَذَ حُوتًا فَجَعَلَهُ فِي مِكْتَلٍ فَقَالَ لِفَتَاهُ لاَ أُكَلِّفُكَ إِلاَّ أَنْ تُخْبِرَنِي بِحَيْثُ يُفَارِقُكَ الْحُوتُ‏.‏ قَالَ مَا كَلَّفْتَ كَثِيرًا فَذَلِكَ قَوْلُهُ جَلَّ ذِكْرُهُ ‏{‏وَإِذْ قَالَ مُوسَى لِفَتَاهُ‏}‏ يُوشَعَ بْنِ نُونٍ ـ لَيْسَتْ عَنْ سَعِيدٍ ـ قَالَ فَبَيْنَمَا هُوَ فِي ظِلِّ صَخْرَةٍ فِي مَكَانٍ ثَرْيَانَ، إِذْ تَضَرَّبَ الْحُوتُ، وَمُوسَى نَائِمٌ، فَقَالَ فَتَاهُ لاَ أُوقِظُهُ حَتَّى إِذَا اسْتَيْقَظَ نَسِيَ أَنْ يُخْبِرَهُ، وَتَضَرَّبَ الْحُوتُ، حَتَّى دَخَلَ الْبَحْرَ فَأَمْسَكَ اللَّهُ عَنْهُ جِرْيَةَ الْبَحْرِ حَتَّى كَأَنَّ أَثَرَهُ فِي حَجَرٍ ـ قَالَ لِي عَمْرٌو هَكَذَا كَأَنَّ أَثَرَهُ فِي حَجَرٍ، وَحَلَّقَ بَيْنَ إِبْهَامَيْهِ وَاللَّتَيْنِ تَلِيانِهِمَا ـ لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا قَالَ قَدْ قَطَعَ اللَّهُ عَنْكَ النَّصَبَ ـ لَيْسَتْ هَذِهِ عَنْ سَعِيدٍ ـ أَخْبَرَهُ، فَرَجَعَا فَوَجَدَا خَضِرًا ـ قَالَ لِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ ـ عَلَى طِنْفِسَةٍ خَضْرَاءَ عَلَى كَبِدِ الْبَحْرِ ـ قَالَ سَعِيدُ بْنُ جُبَيْرٍ ـ مُسَجًّى بِثَوْبِهِ قَدْ جَعَلَ طَرَفَهُ تَحْتَ رِجْلَيْهِ، وَطَرَفَهُ تَحْتَ رَأْسِهِ، فَسَلَّمَ عَلَيْهِ مُوسَى، فَكَشَفَ عَنْ وَجْهِهِ، وَقَالَ هَلْ بِأَرْضِي مِنْ سَلاَمٍ مَنْ أَنْتَ قَالَ أَنَا مُوسَى‏.‏ قَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ‏.‏ قَالَ فَمَا شَأْنُكَ قَالَ جِئْتُ لِتُعَلِّمَنِي مِمَّا عُلِّمْتَ رَشَدًا‏.‏ قَالَ أَمَا يَكْفِيكَ أَنَّ التَّوْرَاةَ بِيَدَيْكَ، وَأَنَّ الْوَحْىَ يَأْتِيكَ، يَا مُوسَى إِنَّ لِي عِلْمًا لاَ يَنْبَغِي لَكَ أَنْ تَعْلَمَهُ وَإِنَّ لَكَ عِلْمًا لاَ يَنْبَغِي لِي أَنْ أَعْلَمَهُ، فَأَخَذَ طَائِرٌ بِمِنْقَارِهِ مِنَ الْبَحْرِ وَقَالَ وَاللَّهِ مَا عِلْمِي وَمَا عِلْمُكَ فِي جَنْبِ عِلْمِ اللَّهِ إِلاَّ كَمَا أَخَذَ هَذَا الطَّائِرُ بِمِنْقَارِهِ مِنَ الْبَحْرِ، حَتَّى إِذَا رَكِبَا فِي السَّفِينَةِ وَجَدَا مَعَابِرَ صِغَارًا تَحْمِلُ أَهْلَ هَذَا السَّاحِلِ إِلَى أَهْلِ هَذَا السَّاحِلِ الآخَرِ عَرَفُوهُ، فَقَالُوا عَبْدُ اللَّهِ الصَّالِحُ ـ قَالَ قُلْنَا لِسَعِيدٍ خَضِرٌ قَالَ نَعَمْ ـ لاَ نَحْمِلُهُ بِأَجْرٍ، فَخَرَقَهَا وَوَتَدَ فِيهَا وَتِدًا‏.‏ قَالَ مُوسَى أَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ شَيْئًا إِمْرًا ـ قَالَ مُجَاهِدٌ مُنْكَرًا ـ قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِي صَبْرًا كَانَتِ الأُولَى نِسْيَانًا وَالْوُسْطَى شَرْطًا وَالثَّالِثَةُ عَمْدًا قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا، لَقِيَا غُلاَمًا فَقَتَلَهُ ـ قَالَ يَعْلَى قَالَ سَعِيدٌ ـ وَجَدَ غِلْمَانًا يَلْعَبُونَ، فَأَخَذَ غُلاَمًا كَافِرًا ظَرِيفًا فَأَضْجَعَهُ، ثُمَّ ذَبَحَهُ بِالسِّكِّينِ‏.‏ قَالَ أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ لَمْ تَعْمَلْ بِالْحِنْثِ ـ وَكَانَ ابْنُ عَبَّاسٍ قَرَأَهَا زَكِيَّةً زَاكِيَةً مُسْلِمَةً كَقَوْلِكَ غُلاَمًا زَكِيًّا ـ فَانْطَلَقَا، فَوَجَدَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ ـ قَالَ سَعِيدٌ بِيَدِهِ هَكَذَا ـ وَرَفَعَ يَدَهُ فَاسْتَقَامَ ـ قَالَ يَعْلَى ـ حَسِبْتُ أَنَّ سَعِيدًا قَالَ فَمَسَحَهُ بِيَدِهِ فَاسْتَقَامَ، لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا ـ قَالَ سَعِيدٌ أَجْرًا نَأْكُلُهُ ـ وَكَانَ وَرَاءَهُمْ، وَكَانَ أَمَامَهُمْ ـ قَرَأَهَا ابْنُ عَبَّاسٍ أَمَامَهُمْ مَلِكٌ ـ يَزْعُمُونَ عَنْ غَيْرِ سَعِيدٍ أَنَّهُ هُدَدُ بْنُ بُدَدٍ، وَالْغُلاَمُ الْمَقْتُولُ، اسْمُهُ يَزْعُمُونَ جَيْسُورٌ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ غَصْبًا، فَأَرَدْتُ إِذَا هِيَ مَرَّتْ بِهِ أَنْ يَدَعَهَا لِعَيْبِهَا، فَإِذَا جَاوَزُوا أَصْلَحُوهَا فَانْتَفَعُوا بِهَا وَمِنْهُمْ مَنْ يَقُولُ سَدُّوهَا بِقَارُورَةٍ وَمِنْهُمْ مَنْ يَقُولُ بِالْقَارِ، كَانَ أَبَوَاهُ مُؤْمِنَيْنِ، وَكَانَ كَافِرًا فَخَشِينَا أَنْ يُرْهِقَهُمَا طُغْيَانًا وَكُفْرًا، أَنْ يَحْمِلَهُمَا حُبُّهُ عَلَى أَنْ يُتَابِعَاهُ عَلَى دِينِهِ فَأَرَدْنَا أَنْ يُبَدِّلَهُمَا رَبُّهُمَا خَيْرًا مِنْهُ زَكَاةً لِقَوْلِهِ أَقَتَلْتَ نَفْسًا زَكِيَّةً وَأَقْرَبَ رُحْمًا هُمَا بِهِ أَرْحَمُ مِنْهُمَا بِالأَوَّلِ، الَّذِي قَتَلَ خَضِرٌ وَزَعَمَ غَيْرُ سَعِيدٍ أَنَّهُمَا أُبْدِلاَ جَارِيَةً، وأَمَّا دَاوُدُ بْنُ أَبِي عَاصِمٍ فَقَالَ عَنْ غَيْرِ وَاحِدٍ إِنَّهَا جَارِيَةٌ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 248
			}
		}
	]
}