{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4745,
			"arabicnumber": 4745,
			"text": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ عُوَيْمِرًا، أَتَى عَاصِمَ بْنَ عَدِيٍّ وَكَانَ سَيِّدَ بَنِي عَجْلاَنَ فَقَالَ كَيْفَ تَقُولُونَ فِي رَجُلٍ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَصْنَعُ سَلْ لِي رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَتَى عَاصِمٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ، فَسَأَلَهُ عُوَيْمِرٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَرِهَ الْمَسَائِلَ وَعَابَهَا، قَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَجَاءَ عُوَيْمِرٌ فَقَالَ يَا رَسُولَ اللَّهِ رَجُلٌ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَصْنَعُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَنْزَلَ اللَّهُ الْقُرْآنَ فِيكَ وَفِي صَاحِبَتِكَ ‏\"‏‏.‏ فَأَمَرَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمُلاَعَنَةِ بِمَا سَمَّى اللَّهُ فِي كِتَابِهِ، فَلاَعَنَهَا ثُمَّ قَالَ يَا رَسُولَ اللَّهِ، إِنْ حَبَسْتُهَا فَقَدْ ظَلَمْتُهَا، فَطَلَّقَهَا، فَكَانَتْ سُنَّةً لِمَنْ كَانَ بَعْدَهُمَا فِي الْمُتَلاَعِنَيْنِ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرُوا فَإِنْ جَاءَتْ بِهِ أَسْحَمَ أَدْعَجَ الْعَيْنَيْنِ عَظِيمَ الأَلْيَتَيْنِ خَدَلَّجَ السَّاقَيْنِ فَلاَ أَحْسِبُ عُوَيْمِرًا إِلاَّ قَدْ صَدَقَ عَلَيْهَا، وَإِنْ جَاءَتْ بِهِ أُحَيْمِرَ كَأَنَّهُ وَحَرَةٌ فَلاَ أَحْسِبُ عُوَيْمِرًا، إِلاَّ قَدْ كَذَبَ عَلَيْهَا ‏\"‏‏.‏ فَجَاءَتْ بِهِ عَلَى النَّعْتِ الَّذِي نَعَتَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ تَصْدِيقِ عُوَيْمِرٍ، فَكَانَ بَعْدُ يُنْسَبُ إِلَى أُمِّهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 267
			}
		}
	]
}