{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4772,
			"arabicnumber": 4772,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ لَمَّا حَضَرَتْ أَبَا طَالِبٍ الْوَفَاةُ جَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَوَجَدَ عِنْدَهِ أَبَا جَهْلٍ وَعَبْدَ اللَّهِ بْنَ أَبِي أُمَيَّةَ بْنِ الْمُغِيرَةِ، فَقَالَ ‏\"‏ أَىْ عَمِّ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ، كَلِمَةً أُحَاجُّ لَكَ بِهَا عِنْدَ اللَّهِ ‏\"‏‏.‏ فَقَالَ أَبُو جَهْلٍ وَعَبْدُ اللَّهِ بْنُ أَبِي أُمَيَّةَ أَتَرْغَبُ عَنْ مِلَّةِ عَبْدِ الْمُطَّلِبِ فَلَمْ يَزَلْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْرِضُهَا عَلَيْهِ، وَيُعِيدَانِهِ بِتِلْكَ الْمَقَالَةِ حَتَّى قَالَ أَبُو طَالِبٍ آخِرَ مَا كَلَّمَهُمْ عَلَى مِلَّةِ عَبْدِ الْمُطَّلِبِ، وَأَبَى أَنْ يَقُولُ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَاللَّهِ لأَسْتَغْفِرَنَّ لَكَ مَا لَمْ أُنْهَ عَنْكَ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ‏}‏ وَأَنْزَلَ اللَّهُ فِي أَبِي طَالِبٍ، فَقَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏{‏إِنَّكَ لاَ تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ‏}‏‏.‏ قَالَ ابْنُ عَبَّاسٍ ‏{‏أُولِي الْقُوَّةِ‏}‏ لاَ يَرْفَعُهَا الْعُصْبَةُ مِنَ الرِّجَالِ‏.‏ ‏{‏لَتَنُوءُ‏}‏ لَتُثْقِلُ‏.‏ ‏{‏فَارِغًا‏}‏ إِلاَّ مِنْ ذِكْرِ مُوسَى‏.‏ ‏{‏الْفَرِحِينَ‏}‏ الْمَرِحِينَ‏.‏ ‏{‏قُصِّيهِ‏}‏ اتَّبِعِي أَثَرَهُ، وَقَدْ يَكُونُ أَنْ يَقُصَّ الْكَلاَمَ ‏{‏نَحْنُ نَقُصُّ عَلَيْكَ‏}‏‏.‏ ‏{‏عَنْ جُنُبٍ‏}‏ عَنْ بُعْدٍ عَنْ جَنَابَةٍ وَاحِدٌ، وَعَنِ اجْتِنَابٍ أَيْضًا، يَبْطِشُ وَيَبْطُشُ‏.‏ ‏{‏يَأْتَمِرُونَ‏}‏ يَتَشَاوَرُونَ‏.‏ الْعُدْوَانُ وَالْعَدَاءُ وَالتَّعَدِّي وَاحِدٌ‏.‏ ‏{‏آنَسَ‏}‏ أَبْصَرَ‏.‏ الْجِذْوَةُ قِطْعَةٌ غَلِيظَةٌ مِنَ الْخَشَبِ، لَيْسَ فِيهَا لَهَبٌ، وَالشِّهَابُ فِيهِ لَهَبٌ‏.‏ وَالْحَيَّاتُ أَجْنَاسٌ الْجَانُّ وَالأَفَاعِي وَالأَسَاوِدُ‏.‏ ‏{‏رِدْءًا‏}‏ مُعِينًا‏.‏ قَالَ ابْنُ عَبَّاسٍ ‏{‏يُصَدِّقُنِي‏}‏ وَقَالَ غَيْرُهُ ‏{‏سَنَشُدُّ‏}‏ سَنُعِينُكَ كُلَّمَا عَزَّزْتَ شَيْئًا فَقَدْ جَعَلْتَ لَهُ عَضُدًا‏.‏ مَقْبُوحِينَ مُهْلَكِينَ‏.‏ ‏{‏وَصَّلْنَا‏}‏ بَيَّنَّاهُ وَأَتْمَمْنَاهُ‏.‏ ‏{‏يُجْبَى‏}‏ يُجْلَبُ ‏.‏‏{‏بَطِرَتْ‏}‏ أَشِرَتْ‏.‏ ‏{‏فِي أُمِّهَا رَسُولاً‏}‏ أُمُّ الْقُرَى مَكَّةُ وَمَا حَوْلَهَا‏.‏ ‏{‏تُكِنُّ‏}‏ تُخْفِي‏.‏ أَكْنَنْتُ الشَّىْءَ أَخْفَيْتُهُ، وَكَنَنْتُهُ أَخْفَيْتُهُ وَأَظْهَرْتُهُ‏.‏ ‏{‏وَيْكَأَنَّ اللَّهَ‏}‏ مِثْلُ أَلَمْ تَرَ أَنَّ اللَّهَ ‏{‏يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ‏}‏ يُوَسِّعُ عَلَيْهِ وَيُضَيِّقُ عَلَيْهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 294
			}
		}
	]
}