{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4890,
			"arabicnumber": 4890,
			"text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ حَدَّثَنِي الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، أَنَّهُ سَمِعَ عُبَيْدَ اللَّهِ بْنَ أَبِي رَافِعٍ، كَاتِبَ عَلِيٍّ يَقُولُ سَمِعْتُ عَلِيًّا ـ رضى الله عنه ـ يَقُولُ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَا وَالزُّبَيْرَ وَالْمِقْدَادَ فَقَالَ ‏\"‏ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ خَاخٍ فَإِنَّ بِهَا ظَعِينَةً مَعَهَا كِتَابٌ فَخُذُوهُ مِنْهَا ‏\"‏‏.‏ فَذَهَبْنَا تَعَادَى بِنَا خَيْلُنَا حَتَّى أَتَيْنَا الرَّوْضَةَ فَإِذَا نَحْنُ بِالظَّعِينَةِ فَقُلْنَا أَخْرِجِي الْكِتَابَ فَقَالَتْ مَا مَعِي مِنْ كِتَابٍ‏.‏ فَقُلْنَا لَتُخْرِجِنَّ الْكِتَابَ أَوْ لَنُلْقِيَنَّ الثِّيَابَ‏.‏ فَأَخْرَجَتْهُ مِنْ عِقَاصِهَا فَأَتَيْنَا بِهِ النَّبِيَّ صلى الله عليه وسلم فَإِذَا فِيهِ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى أُنَاسٍ مِنَ الْمُشْرِكِينَ مِمَّنْ بِمَكَّةَ يُخْبِرُهُمْ بِبَعْضِ أَمْرِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا هَذَا يَا حَاطِبُ ‏\"‏‏.‏ قَالَ لاَ تَعْجَلْ عَلَىَّ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ امْرَأً مِنْ قُرَيْشٍ وَلَمْ أَكُنْ مِنْ أَنْفُسِهِمْ وَكَانَ مَنْ مَعَكَ مِنَ الْمُهَاجِرِينَ لَهُمْ قَرَابَاتٌ يَحْمُونَ بِهَا أَهْلِيهِمْ وَأَمْوَالَهُمْ بِمَكَّةَ فَأَحْبَبْتُ إِذْ فَاتَنِي مِنَ النَّسَبِ فِيهِمْ أَنْ أَصْطَنِعَ إِلَيْهِمْ يَدًا يَحْمُونَ قَرَابَتِي وَمَا فَعَلْتُ ذَلِكَ كُفْرًا وَلاَ ارْتِدَادًا عَنْ دِينِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهُ قَدْ صَدَقَكُمْ ‏\"‏‏.‏ فَقَالَ عُمَرُ دَعْنِي يَا رَسُولَ اللَّهِ فَأَضْرِبَ عُنُقَهُ‏.‏ فَقَالَ ‏\"‏ إِنَّهُ شَهِدَ بَدْرًا وَمَا يُدْرِيكَ لَعَلَّ اللَّهَ ـ عَزَّ وَجَلَّ ـ اطَّلَعَ عَلَى أَهْلِ بَدْرٍ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ غَفَرْتُ لَكُمْ ‏\"‏‏.‏ قَالَ عَمْرٌو وَنَزَلَتْ فِيهِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ‏}‏ قَالَ لاَ أَدْرِي الآيَةَ فِي الْحَدِيثِ أَوْ قَوْلُ عَمْرٍو‏.‏ حَدَّثَنَا عَلِيٌّ قِيلَ لِسُفْيَانَ فِي هَذَا فَنَزَلَتْ ‏{‏لاَ تَتَّخِذُوا عَدُوِّي‏}‏ قَالَ سُفْيَانُ هَذَا فِي حَدِيثِ النَّاسِ حَفِظْتُهُ مِنْ عَمْرٍو وَمَا تَرَكْتُ مِنْهُ حَرْفًا وَمَا أُرَى أَحَدًا حَفِظَهُ غَيْرِي‏.‏",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 410
			}
		}
	]
}