{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5191,
			"arabicnumber": 5191,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمْ أَزَلْ حَرِيصًا أَنْ أَسْأَلَ عُمَرَ بْنَ الْخَطَّابِ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَيْنِ قَالَ اللَّهُ تَعَالَى ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ حَتَّى حَجَّ وَحَجَجْتُ مَعَهُ، وَعَدَلَ وَعَدَلْتُ مَعَهُ بِإِدَاوَةٍ، فَتَبَرَّزَ، ثُمَّ جَاءَ فَسَكَبْتُ عَلَى يَدَيْهِ مِنْهَا فَتَوَضَّأَ فَقُلْتُ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَانِ قَالَ اللَّهُ تَعَالَى ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ قَالَ وَاعَجَبًا لَكَ يَا ابْنَ عَبَّاسٍ، هُمَا عَائِشَةُ وَحَفْصَةُ‏.‏ ثُمَّ اسْتَقْبَلَ عُمَرُ الْحَدِيثَ يَسُوقُهُ قَالَ كُنْتُ أَنَا وَجَارٌ لِي مِنَ الأَنْصَارِ فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ، وَهُمْ مِنْ عَوَالِي الْمَدِينَةِ، وَكُنَّا نَتَنَاوَبُ النُّزُولَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَيَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا، فَإِذَا نَزَلْتُ جِئْتُهُ بِمَا حَدَثَ مِنْ خَبَرِ ذَلِكَ الْيَوْمِ مِنَ الْوَحْىِ أَوْ غَيْرِهِ، وَإِذَا نَزَلَ فَعَلَ مِثْلَ ذَلِكَ، وَكُنَّا مَعْشَرَ قُرَيْشٍ نَغْلِبُ النِّسَاءَ، فَلَمَّا قَدِمْنَا عَلَى الأَنْصَارِ إِذَا قَوْمٌ تَغْلِبُهُمْ نِسَاؤُهُمْ، فَطَفِقَ نِسَاؤُنَا يَأْخُذْنَ مِنْ أَدَبِ نِسَاءِ الأَنْصَارِ، فَصَخِبْتُ عَلَى امْرَأَتِي فَرَاجَعَتْنِي فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي قَالَتْ وَلِمَ تُنْكِرُ أَنْ أُرَاجِعَكَ فَوَاللَّهِ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم لَيُرَاجِعْنَهُ، وَإِنَّ إِحْدَاهُنَّ لَتَهْجُرُهُ الْيَوْمَ حَتَّى اللَّيْلِ‏.‏ فَأَفْزَعَنِي ذَلِكَ وَقُلْتُ لَهَا وَقَدْ خَابَ مَنْ فَعَلَ ذَلِكَ مِنْهُنَّ‏.‏ ثُمَّ جَمَعْتُ عَلَىَّ ثِيَابِي فَنَزَلْتُ فَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ لَهَا أَىْ حَفْصَةُ أَتُغَاضِبُ إِحْدَاكُنَّ النَّبِيَّ صلى الله عليه وسلم الْيَوْمَ حَتَّى اللَّيْلِ قَالَتْ نَعَمْ‏.‏ فَقُلْتُ قَدْ خِبْتِ وَخَسِرْتِ، أَفَتَأْمَنِينَ أَنْ يَغْضَبَ اللَّهُ لِغَضَبِ رَسُولِهِ صلى الله عليه وسلم فَتَهْلِكِي لاَ تَسْتَكْثِرِي النَّبِيَّ صلى الله عليه وسلم وَلاَ تُرَاجِعِيهِ فِي شَىْءٍ، وَلاَ تَهْجُرِيهِ، وَسَلِينِي مَا بَدَا لَكِ، وَلاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ أَوْضَأَ مِنْكِ، وَأَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم ـ يُرِيدُ عَائِشَةَ ـ قَالَ عُمَرُ وَكُنَّا قَدْ تَحَدَّثْنَا أَنَّ غَسَّانَ تُنْعِلُ الْخَيْلَ لِغَزْوِنَا، فَنَزَلَ صَاحِبِي الأَنْصَارِيُّ يَوْمَ نَوْبَتِهِ، فَرَجَعَ إِلَيْنَا عِشَاءً فَضَرَبَ بَابِي ضَرْبًا شَدِيدًا وَقَالَ أَثَمَّ هُوَ فَفَزِعْتُ فَخَرَجْتُ إِلَيْهِ، فَقَالَ قَدْ حَدَثَ الْيَوْمَ أَمْرٌ عَظِيمٌ‏.‏ قُلْتُ مَا هُوَ، أَجَاءَ غَسَّانُ قَالَ لاَ بَلْ أَعْظَمُ مِنْ ذَلِكَ وَأَهْوَلُ، طَلَّقَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ‏.‏ فَقُلْتُ خَابَتْ حَفْصَةُ وَخَسِرَتْ، قَدْ كُنْتُ أَظُنُّ هَذَا يُوشِكُ أَنْ يَكُونَ، فَجَمَعْتُ عَلَىَّ ثِيَابِي فَصَلَّيْتُ صَلاَةَ الْفَجْرِ مَعَ النَّبِيِّ صلى الله عليه وسلم فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم مَشْرُبَةً لَهُ، فَاعْتَزَلَ فِيهَا، وَدَخَلْتُ عَلَى حَفْصَةَ فَإِذَا هِيَ تَبْكِي فَقُلْتُ مَا يُبْكِيكِ أَلَمْ أَكُنْ حَذَّرْتُكِ هَذَا أَطَلَّقَكُنَّ النَّبِيُّ صلى الله عليه وسلم قَالَتْ لاَ أَدْرِي هَا هُوَ ذَا مُعْتَزِلٌ فِي الْمَشْرُبَةِ‏.‏ فَخَرَجْتُ فَجِئْتُ إِلَى الْمِنْبَرِ فَإِذَا حَوْلَهُ رَهْطٌ يَبْكِي بَعْضُهُمْ، فَجَلَسْتُ مَعَهُمْ قَلِيلاً ثُمَّ غَلَبَنِي مَا أَجِدُ، فَجِئْتُ الْمَشْرُبَةَ الَّتِي فِيهَا النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ لِغُلاَمٍ لَهُ أَسْوَدَ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ الْغُلاَمُ فَكَلَّمَ النَّبِيَّ صلى الله عليه وسلم ثُمَّ رَجَعَ فَقَالَ كَلَّمْتُ النَّبِيَّ صلى الله عليه وسلم وَذَكَرْتُكَ لَهُ، فَصَمَتَ‏.‏ فَانْصَرَفْتُ حَتَّى جَلَسْتُ مَعَ الرَّهْطِ الَّذِينَ عِنْدَ الْمِنْبَرِ، ثُمَّ غَلَبَنِي مَا أَجِدُ فَجِئْتُ فَقُلْتُ لِلْغُلاَمِ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ ثُمَّ رَجَعَ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ‏.‏ فَرَجَعْتُ فَجَلَسْتُ مَعَ الرَّهْطِ الَّذِينَ عِنْدَ الْمِنْبَرِ، ثُمَّ غَلَبَنِي مَا أَجِدُ فَجِئْتُ الْغُلاَمَ فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ ثُمَّ رَجَعَ إِلَىَّ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ‏.‏ فَلَمَّا وَلَّيْتُ مُنْصَرِفًا ـ قَالَ ـ إِذَا الْغُلاَمُ يَدْعُونِي فَقَالَ قَدْ أَذِنَ لَكَ النَّبِيُّ صلى الله عليه وسلم فَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ مُضْطَجِعٌ عَلَى رِمَالِ حَصِيرٍ، لَيْسَ بَيْنَهُ وَبَيْنَهُ فِرَاشٌ، قَدْ أَثَّرَ الرِّمَالُ بِجَنْبِهِ مُتَّكِئًا عَلَى وِسَادَةٍ مِنْ أَدَمٍ حَشْوُهَا لِيفٌ، فَسَلَّمْتُ عَلَيْهِ ثُمَّ قُلْتُ وَأَنَا قَائِمٌ يَا رَسُولَ اللَّهِ أَطَلَّقْتَ نِسَاءَكَ‏.‏ فَرَفَعَ إِلَىَّ بَصَرَهُ فَقَالَ ‏\"‏ لاَ ‏\"‏‏.‏ فَقُلْتُ اللَّهُ أَكْبَرُ‏.‏ ثُمَّ قُلْتُ وَأَنَا قَائِمٌ أَسْتَأْنِسُ يَا رَسُولَ اللَّهِ لَوْ رَأَيْتَنِي، وَكُنَّا مَعْشَرَ قُرَيْشٍ نَغْلِبُ النِّسَاءَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ إِذَا قَوْمٌ تَغْلِبُهُمْ نِسَاؤُهُمْ، فَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قُلْتُ يَا رَسُولَ اللَّهِ لَوْ رَأَيْتَنِي وَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ لَهَا لاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ أَوْضَأَ مِنْكِ وَأَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم يُرِيدُ عَائِشَةَ فَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم تَبَسُّمَةً أُخْرَى، فَجَلَسْتُ حِينَ رَأَيْتُهُ تَبَسَّمَ، فَرَفَعْتُ بَصَرِي فِي بَيْتِهِ، فَوَاللَّهِ مَا رَأَيْتُ فِي بَيْتِهِ شَيْئًا يَرُدُّ الْبَصَرَ غَيْرَ أَهَبَةٍ ثَلاَثَةٍ، فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ فَلْيُوَسِّعْ عَلَى أُمَّتِكَ، فَإِنَّ فَارِسًا وَالرُّومَ قَدْ وُسِّعَ عَلَيْهِمْ، وَأُعْطُوا الدُّنْيَا وَهُمْ لاَ يَعْبُدُونَ اللَّهَ‏.‏ فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم وَكَانَ مُتَّكِئًا‏.‏ فَقَالَ ‏\"‏ أَوَفِي هَذَا أَنْتَ يَا ابْنَ الْخَطَّابِ، إِنَّ أُولَئِكَ قَوْمٌ عُجِّلُوا طَيِّبَاتِهِمْ فِي الْحَيَاةِ الدُّنْيَا ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي‏.‏ فَاعْتَزَلَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ مِنْ أَجْلِ ذَلِكَ الْحَدِيثِ حِينَ أَفْشَتْهُ حَفْصَةُ إِلَى عَائِشَةَ تِسْعًا وَعِشْرِينَ لَيْلَةً وَكَانَ قَالَ ‏\"‏ مَا أَنَا بِدَاخِلٍ عَلَيْهِنَّ شَهْرًا ‏\"‏‏.‏ مِنْ شِدَّةِ مَوْجِدَتِهِ عَلَيْهِنَّ حِينَ عَاتَبَهُ اللَّهُ، فَلَمَّا مَضَتْ تِسْعٌ وَعِشْرُونَ لَيْلَةً دَخَلَ عَلَى عَائِشَةَ فَبَدَأَ بِهَا فَقَالَتْ لَهُ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّكَ كُنْتَ قَدْ أَقْسَمْتَ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا، وَإِنَّمَا أَصْبَحْتَ مِنْ تِسْعٍ وَعِشْرِينَ لَيْلَةً أَعُدُّهَا عَدًّا‏.‏ فَقَالَ ‏\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏‏.‏ فَكَانَ ذَلِكَ الشَّهْرُ تِسْعًا وَعِشْرِينَ لَيْلَةً‏.‏ قَالَتْ عَائِشَةُ ثُمَّ أَنْزَلَ اللَّهُ تَعَالَى آيَةَ التَّخَيُّرِ فَبَدَأَ بِي أَوَّلَ امْرَأَةٍ مِنْ نِسَائِهِ فَاخْتَرْتُهُ، ثُمَّ خَيَّرَ نِسَاءَهُ كُلَّهُنَّ فَقُلْنَ مِثْلَ مَا قَالَتْ عَائِشَةُ‏.‏",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 125
			}
		}
	]
}