{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6452,
			"arabicnumber": 6452,
			"text": "حَدَّثَنِي أَبُو نُعَيْمٍ، بِنَحْوٍ مِنْ نِصْفِ هَذَا الْحَدِيثِ حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ، حَدَّثَنَا مُجَاهِدٌ، أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ آللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ إِنْ كُنْتُ لأَعْتَمِدُ بِكَبِدِي عَلَى الأَرْضِ مِنَ الْجُوعِ، وَإِنْ كُنْتُ لأَشُدُّ الْحَجَرَ عَلَى بَطْنِي مِنَ الْجُوعِ، وَلَقَدْ قَعَدْتُ يَوْمًا عَلَى طَرِيقِهِمُ الَّذِي يَخْرُجُونَ مِنْهُ، فَمَرَّ أَبُو بَكْرٍ، فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ، مَا سَأَلْتُهُ إِلاَّ لِيُشْبِعَنِي، فَمَرَّ وَلَمْ يَفْعَلْ، ثُمَّ مَرَّ بِي عُمَرُ فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ، مَا سَأَلْتُهُ إِلاَّ لِيُشْبِعَنِي، فَمَرَّ فَلَمْ يَفْعَلْ، ثُمَّ مَرَّ بِي أَبُو الْقَاسِمِ صلى الله عليه وسلم فَتَبَسَّمَ حِينَ رَآنِي وَعَرَفَ، مَا فِي نَفْسِي وَمَا فِي وَجْهِي ثُمَّ قَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الْحَقْ ‏\"‏‏.‏ وَمَضَى فَتَبِعْتُهُ، فَدَخَلَ فَاسْتَأْذَنَ، فَأَذِنَ لِي، فَدَخَلَ فَوَجَدَ لَبَنًا فِي قَدَحٍ فَقَالَ ‏\"‏ مِنْ أَيْنَ هَذَا اللَّبَنُ ‏\"‏‏.‏ قَالُوا أَهْدَاهُ لَكَ فُلاَنٌ أَوْ فُلاَنَةُ‏.‏ قَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الْحَقْ إِلَى أَهْلِ الصُّفَّةِ فَادْعُهُمْ لِي ‏\"‏‏.‏ قَالَ وَأَهْلُ الصُّفَّةِ أَضْيَافُ الإِسْلاَمِ، لاَ يَأْوُونَ إِلَى أَهْلٍ وَلاَ مَالٍ، وَلاَ عَلَى أَحَدٍ، إِذَا أَتَتْهُ صَدَقَةٌ بَعَثَ بِهَا إِلَيْهِمْ، وَلَمْ يَتَنَاوَلْ مِنْهَا شَيْئًا، وَإِذَا أَتَتْهُ هَدِيَّةٌ أَرْسَلَ إِلَيْهِمْ، وَأَصَابَ مِنْهَا وَأَشْرَكَهُمْ فِيهَا، فَسَاءَنِي ذَلِكَ فَقُلْتُ وَمَا هَذَا اللَّبَنُ فِي أَهْلِ الصُّفَّةِ كُنْتُ أَحَقُّ أَنَا أَنْ أُصِيبَ مِنْ هَذَا اللَّبَنِ شَرْبَةً أَتَقَوَّى بِهَا، فَإِذَا جَاءَ أَمَرَنِي فَكُنْتُ أَنَا أُعْطِيهِمْ، وَمَا عَسَى أَنْ يَبْلُغَنِي مِنْ هَذَا اللَّبَنِ، وَلَمْ يَكُنْ مِنْ طَاعَةِ اللَّهِ وَطَاعَةِ رَسُولِهِ صلى الله عليه وسلم بُدٌّ، فَأَتَيْتُهُمْ فَدَعَوْتُهُمْ فَأَقْبَلُوا، فَاسْتَأْذَنُوا فَأَذِنَ لَهُمْ، وَأَخَذُوا مَجَالِسَهُمْ مِنَ الْبَيْتِ قَالَ ‏\"‏ يَا أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ خُذْ فَأَعْطِهِمْ ‏\"‏‏.‏ قَالَ فَأَخَذْتُ الْقَدَحَ فَجَعَلْتُ أُعْطِيهِ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ، فَأُعْطِيهِ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ، حَتَّى انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ رَوِيَ الْقَوْمُ كُلُّهُمْ، فَأَخَذَ الْقَدَحَ فَوَضَعَهُ عَلَى يَدِهِ فَنَظَرَ إِلَىَّ فَتَبَسَّمَ فَقَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَقِيتُ أَنَا وَأَنْتَ ‏\"‏‏.‏ قُلْتُ صَدَقْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ اقْعُدْ فَاشْرَبْ ‏\"‏‏.‏ فَقَعَدْتُ فَشَرِبْتُ‏.‏ فَقَالَ ‏\"‏ اشْرَبْ ‏\"‏‏.‏ فَشَرِبْتُ، فَمَا زَالَ يَقُولُ ‏\"‏ اشْرَبْ ‏\"‏‏.‏ حَتَّى قُلْتُ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ، مَا أَجِدُ لَهُ مَسْلَكًا‏.‏ قَالَ ‏\"‏ فَأَرِنِي ‏\"‏‏.‏ فَأَعْطَيْتُهُ الْقَدَحَ فَحَمِدَ اللَّهَ وَسَمَّى، وَشَرِبَ الْفَضْلَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 41
			}
		}
	]
}