{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 687,
			"arabicnumber": 687,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَقُلْتُ أَلاَ تُحَدِّثِينِي عَنْ مَرَضِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ بَلَى، ثَقُلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏‏.‏ قُلْنَا لاَ، هُمْ يَنْتَظِرُونَكَ‏.‏ قَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏‏.‏ قَالَتْ فَفَعَلْنَا فَاغْتَسَلَ فَذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ، ثُمَّ أَفَاقَ فَقَالَ صلى الله عليه وسلم ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏‏.‏ قُلْنَا لاَ، هُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏‏.‏ قَالَتْ فَقَعَدَ فَاغْتَسَلَ، ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ، ثُمَّ أَفَاقَ فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏‏.‏ قُلْنَا لاَ، هُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏، فَقَعَدَ فَاغْتَسَلَ، ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ، ثُمَّ أَفَاقَ فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏‏.‏ فَقُلْنَا لاَ، هُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ ـ وَالنَّاسُ عُكُوفٌ فِي الْمَسْجِدِ يَنْتَظِرُونَ النَّبِيَّ عَلَيْهِ السَّلاَمُ لِصَلاَةِ الْعِشَاءِ الآخِرَةِ ـ فَأَرْسَلَ النَّبِيُّ صلى الله عليه وسلم إِلَى أَبِي بَكْرٍ بِأَنْ يُصَلِّيَ بِالنَّاسِ، فَأَتَاهُ الرَّسُولُ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ أَنْ تُصَلِّيَ بِالنَّاسِ‏.‏ فَقَالَ أَبُو بَكْرٍ ـ وَكَانَ رَجُلاً رَقِيقًا ـ يَا عُمَرُ صَلِّ بِالنَّاسِ‏.‏ فَقَالَ لَهُ عُمَرُ أَنْتَ أَحَقُّ بِذَلِكَ‏.‏ فَصَلَّى أَبُو بَكْرٍ تِلْكَ الأَيَّامَ، ثُمَّ إِنَّ النَّبِيَّ صلى الله عليه وسلم وَجَدَ مِنْ نَفْسِهِ خِفَّةً فَخَرَجَ بَيْنَ رَجُلَيْنِ أَحَدُهُمَا الْعَبَّاسُ لِصَلاَةِ الظُّهْرِ، وَأَبُو بَكْرٍ يُصَلِّي بِالنَّاسِ، فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ لِيَتَأَخَّرَ فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم بِأَنْ لاَ يَتَأَخَّرَ‏.‏ قَالَ ‏\"‏ أَجْلِسَانِي إِلَى جَنْبِهِ ‏\"‏‏.‏ فَأَجْلَسَاهُ إِلَى جَنْبِ أَبِي بَكْرٍ‏.‏ قَالَ فَجَعَلَ أَبُو بَكْرٍ يُصَلِّي وَهْوَ يَأْتَمُّ بِصَلاَةِ النَّبِيِّ صلى الله عليه وسلم وَالنَّاسُ بِصَلاَةِ أَبِي بَكْرٍ، وَالنَّبِيُّ صلى الله عليه وسلم قَاعِدٌ‏.‏ قَالَ عُبَيْدُ اللَّهِ فَدَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقُلْتُ لَهُ أَلاَ أَعْرِضُ عَلَيْكَ مَا حَدَّثَتْنِي عَائِشَةُ عَنْ مَرَضِ النَّبِيِّ صلى الله عليه وسلم قَالَ هَاتِ‏.‏ فَعَرَضْتُ عَلَيْهِ حَدِيثَهَا، فَمَا أَنْكَرَ مِنْهُ شَيْئًا، غَيْرَ أَنَّهُ قَالَ أَسَمَّتْ لَكَ الرَّجُلَ الَّذِي كَانَ مَعَ الْعَبَّاسِ قُلْتُ لاَ‏.‏ قَالَ هُوَ عَلِيٌّ‏.‏",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 81
			}
		}
	]
}