{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7047,
			"arabicnumber": 7047,
			"text": "حَدَّثَنِي مُؤَمَّلُ بْنُ هِشَامٍ أَبُو هِشَامٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَوْفٌ، حَدَّثَنَا أَبُو رَجَاءٍ، حَدَّثَنَا سَمُرَةُ بْنُ جُنْدَبٍ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِمَّا يُكْثِرُ أَنْ يَقُولَ لأَصْحَابِهِ ‏\"‏ هَلْ رَأَى أَحَدٌ مِنْكُمْ مِنْ رُؤْيَا ‏\"‏‏.‏ قَالَ فَيَقُصُّ عَلَيْهِ مَنْ شَاءَ اللَّهُ أَنْ يَقُصَّ، وَإِنَّهُ قَالَ ذَاتَ غَدَاةٍ ‏\"‏ إِنَّهُ أَتَانِي اللَّيْلَةَ آتِيَانِ، وَإِنَّهُمَا ابْتَعَثَانِي، وَإِنَّهُمَا قَالاَ لِي انْطَلِقْ‏.‏ وَإِنِّي انْطَلَقْتُ مَعَهُمَا، وَإِنَّا أَتَيْنَا عَلَى رَجُلٍ مُضْطَجِعٍ، وَإِذَا آخَرُ قَائِمٌ عَلَيْهِ بِصَخْرَةٍ، وَإِذَا هُوَ يَهْوِي بِالصَّخْرَةِ لِرَأْسِهِ، فَيَثْلَغُ رَأْسَهُ فَيَتَهَدْهَدُ الْحَجَرُ هَا هُنَا، فَيَتْبَعُ الْحَجَرَ فَيَأْخُذُهُ، فَلاَ يَرْجِعُ إِلَيْهِ حَتَّى يَصِحَّ رَأْسُهُ كَمَا كَانَ، ثُمَّ يَعُودُ عَلَيْهِ، فَيَفْعَلُ بِهِ مِثْلَ مَا فَعَلَ الْمَرَّةَ الأُولَى‏.‏ قَالَ قُلْتُ لَهُمَا سُبْحَانَ اللَّهِ مَا هَذَانِ قَالَ قَالاَ لِي انْطَلِقْ ـ قَالَ ـ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَجُلٍ مُسْتَلْقٍ لِقَفَاهُ، وَإِذَا آخَرُ قَائِمٌ عَلَيْهِ بِكَلُّوبٍ مِنْ حَدِيدٍ، وَإِذَا هُوَ يَأْتِي أَحَدَ شِقَّىْ وَجْهِهِ فَيُشَرْشِرُ شِدْقَهُ إِلَى قَفَاهُ، وَمَنْخِرَهُ إِلَى قَفَاهُ وَعَيْنَهُ إِلَى قَفَاهُ ـ قَالَ وَرُبَّمَا قَالَ أَبُو رَجَاءٍ فَيَشُقُّ ـ قَالَ ثُمَّ يَتَحَوَّلُ إِلَى الْجَانِبِ الآخَرِ، فَيَفْعَلُ بِهِ مِثْلَ مَا فَعَلَ بِالْجَانِبِ الأَوَّلِ، فَمَا يَفْرُغُ مِنْ ذَلِكَ الْجَانِبِ حَتَّى يَصِحَّ ذَلِكَ الْجَانِبُ كَمَا كَانَ، ثُمَّ يَعُودُ عَلَيْهِ فَيَفْعَلُ مِثْلَ مَا فَعَلَ الْمَرَّةَ الأُولَى‏.‏ قَالَ قُلْتُ سُبْحَانَ اللَّهِ مَا هَذَانِ قَالَ قَالاَ لِي انْطَلِقْ‏.‏ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى مِثْلِ التَّنُّورِ ـ قَالَ فَأَحْسِبُ أَنَّهُ كَانَ يَقُولُ ـ فَإِذَا فِيهِ لَغَطٌ وَأَصْوَاتٌ ـ قَالَ ـ فَاطَّلَعْنَا فِيهِ، فَإِذَا فِيهِ رِجَالٌ وَنِسَاءٌ عُرَاةٌ، وَإِذَا هُمْ يَأْتِيهِمْ لَهَبٌ مِنْ أَسْفَلَ مِنْهُمْ، فَإِذَا أَتَاهُمْ ذَلِكَ اللَّهَبُ ضَوْضَوْا ـ قَالَ ـ قُلْتُ لَهُمَا مَا هَؤُلاَءِ قَالَ قَالاَ لِي انْطَلِقِ انْطَلِقْ‏.‏ قَالَ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى نَهَرٍ ـ حَسِبْتُ أَنَّهُ كَانَ يَقُولُ ـ أَحْمَرَ مِثْلِ الدَّمِ، وَإِذَا فِي النَّهَرِ رَجُلٌ سَابِحٌ يَسْبَحُ، وَإِذَا عَلَى شَطِّ النَّهَرِ رَجُلٌ قَدْ جَمَعَ عِنْدَهُ حِجَارَةً كَثِيرَةً، وَإِذَا ذَلِكَ السَّابِحُ يَسْبَحُ مَا يَسْبَحُ، ثُمَّ يَأْتِي ذَلِكَ الَّذِي قَدْ جَمَعَ عِنْدَهُ الْحِجَارَةَ فَيَفْغَرُ لَهُ فَاهُ فَيُلْقِمُهُ حَجَرًا فَيَنْطَلِقُ يَسْبَحُ، ثُمَّ يَرْجِعُ إِلَيْهِ، كُلَّمَا رَجَعَ إِلَيْهِ فَغَرَ لَهُ فَاهُ فَأَلْقَمَهُ حَجَرًا ـ قَالَ ـ قُلْتُ لَهُمَا مَا هَذَانِ قَالَ قَالاَ لِي انْطَلِقِ انْطَلِقْ‏.‏ قَالَ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَجُلٍ كَرِيهِ الْمَرْآةِ كَأَكْرَهِ مَا أَنْتَ رَاءٍ رَجُلاً مَرْآةً، وَإِذَا عِنْدَهُ نَارٌ يَحُشُّهَا وَيَسْعَى حَوْلَهَا ـ قَالَ ـ قُلْتُ لَهُمَا مَا هَذَا قَالَ قَالاَ لِي انْطَلِقِ انْطَلِقْ‏.‏ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَوْضَةٍ مُعْتَمَّةٍ فِيهَا مِنْ كُلِّ نَوْرِ الرَّبِيعِ، وَإِذَا بَيْنَ ظَهْرَىِ الرَّوْضَةِ رَجُلٌ طَوِيلٌ لاَ أَكَادُ أَرَى رَأْسَهُ طُولاً فِي السَّمَاءِ، وَإِذَا حَوْلَ الرَّجُلِ مِنْ أَكْثَرِ وِلْدَانٍ رَأَيْتُهُمْ قَطُّ ـ قَالَ ـ قُلْتُ لَهُمَا مَا هَذَا مَا هَؤُلاَءِ قَالَ قَالاَ لِي انْطَلِقِ انْطَلِقْ‏.‏ ـ قَالَ ـ فَانْطَلَقْنَا فَانْتَهَيْنَا إِلَى رَوْضَةٍ عَظِيمَةٍ لَمْ أَرَ رَوْضَةً قَطُّ أَعْظَمَ مِنْهَا وَلاَ أَحْسَنَ‏.‏ ـ قَالَ ـ قَالاَ لِي ارْقَ فِيهَا‏.‏ قَالَ فَارْتَقَيْنَا فِيهَا فَانْتَهَيْنَا إِلَى مَدِينَةٍ مَبْنِيَّةٍ بِلَبِنِ ذَهَبٍ وَلَبِنِ فِضَّةٍ، فَأَتَيْنَا باب الْمَدِينَةِ فَاسْتَفْتَحْنَا فَفُتِحَ لَنَا، فَدَخَلْنَاهَا فَتَلَقَّانَا فِيهَا رِجَالٌ شَطْرٌ مِنْ خَلْقِهِمْ كَأَحْسَنِ مَا أَنْتَ رَاءٍ، وَشَطْرٌ كَأَقْبَحِ مَا أَنْتَ رَاءٍ ـ قَالَ ـ قَالاَ لَهُمُ اذْهَبُوا فَقَعُوا فِي ذَلِكَ النَّهَرِ‏.‏ قَالَ وَإِذَا نَهَرٌ مُعْتَرِضٌ يَجْرِي كَأَنَّ مَاءَهُ الْمَحْضُ فِي الْبَيَاضِ، فَذَهَبُوا فَوَقَعُوا فِيهِ، ثُمَّ رَجَعُوا إِلَيْنَا قَدْ ذَهَبَ ذَلِكَ السُّوءُ عَنْهُمْ، فَصَارُوا فِي أَحْسَنِ صُورَةٍ ـ قَالَ ـ قَالاَ لِي هَذِهِ جَنَّةُ عَدْنٍ، وَهَذَاكَ مَنْزِلُكَ‏.‏ قَالَ فَسَمَا بَصَرِي صُعُدًا، فَإِذَا قَصْرٌ مِثْلُ الرَّبَابَةِ الْبَيْضَاءِ ـ قَالَ ـ قَالاَ هَذَاكَ مَنْزِلُكَ‏.‏ قَالَ قُلْتُ لَهُمَا بَارَكَ اللَّهُ فِيكُمَا، ذَرَانِي فَأَدْخُلَهُ‏.‏ قَالاَ أَمَّا الآنَ فَلاَ وَأَنْتَ دَاخِلُهُ‏.‏ قَالَ قُلْتُ لَهُمَا فَإِنِّي قَدْ رَأَيْتُ مُنْذُ اللَّيْلَةِ عَجَبًا، فَمَا هَذَا الَّذِي رَأَيْتُ قَالَ قَالاَ لِي أَمَا إِنَّا سَنُخْبِرُكَ، أَمَّا الرَّجُلُ الأَوَّلُ الَّذِي أَتَيْتَ عَلَيْهِ يُثْلَغُ رَأْسُهُ بِالْحَجَرِ، فَإِنَّهُ الرَّجُلُ يَأْخُذُ الْقُرْآنَ فَيَرْفُضُهُ وَيَنَامُ عَنِ الصَّلاَةِ الْمَكْتُوبَةِ، وَأَمَّا الرَّجُلُ الَّذِي أَتَيْتَ عَلَيْهِ يُشَرْشَرُ شِدْقُهُ إِلَى قَفَاهُ، وَمَنْخِرُهُ إِلَى قَفَاهُ، وَعَيْنُهُ إِلَى قَفَاهُ، فَإِنَّهُ الرَّجُلُ يَغْدُو مِنْ بَيْتِهِ فَيَكْذِبُ الْكَذْبَةَ تَبْلُغُ الآفَاقَ، وَأَمَّا الرِّجَالُ وَالنِّسَاءُ الْعُرَاةُ الَّذِينَ فِي مِثْلِ بِنَاءِ التَّنُّورِ فَإِنَّهُمُ الزُّنَاةُ وَالزَّوَانِي‏.‏ وَأَمَّا الرَّجُلُ الَّذِي أَتَيْتَ عَلَيْهِ يَسْبَحُ فِي النَّهَرِ وَيُلْقَمُ الْحَجَرَ، فَإِنَّهُ آكِلُ الرِّبَا، وَأَمَّا الرَّجُلُ الْكَرِيهُ الْمَرْآةِ الَّذِي عِنْدَ النَّارِ يَحُشُّهَا وَيَسْعَى حَوْلَهَا، فَإِنَّهُ مَالِكٌ خَازِنُ جَهَنَّمَ، وَأَمَّا الرَّجُلُ الطَّوِيلُ الَّذِي فِي الرَّوْضَةِ فَإِنَّهُ إِبْرَاهِيمُ صلى الله عليه وسلم وَأَمَّا الْوِلْدَانُ الَّذِينَ حَوْلَهُ فَكُلُّ مَوْلُودٍ مَاتَ عَلَى الْفِطْرَةِ ‏\"‏‏.‏ قَالَ فَقَالَ بَعْضُ الْمُسْلِمِينَ يَا رَسُولَ اللَّهِ وَأَوْلاَدُ الْمُشْرِكِينَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَوْلاَدُ الْمُشْرِكِينَ‏.‏ وَأَمَّا الْقَوْمُ الَّذِينَ كَانُوا شَطْرٌ مِنْهُمْ حَسَنًا وَشَطَرٌ مِنْهُمْ قَبِيحًا، فَإِنَّهُمْ قَوْمٌ خَلَطُوا عَمَلاً صَالِحًا وَآخَرَ سَيِّئًا، تَجَاوَزَ اللَّهُ عَنْهُمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 61
			}
		}
	]
}