{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7410,
			"arabicnumber": 7410,
			"text": "حَدَّثَنِي مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ يَجْمَعُ اللَّهُ الْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ كَذَلِكَ فَيَقُولُونَ لَوِ اسْتَشْفَعْنَا إِلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا‏.‏ فَيَأْتُونَ آدَمَ فَيَقُولُونَ يَا آدَمُ أَمَا تَرَى النَّاسَ خَلَقَكَ اللَّهُ بِيَدِهِ وَأَسْجَدَ لَكَ مَلاَئِكَتَهُ وَعَلَّمَكَ أَسْمَاءَ كُلِّ شَىْءٍ، شَفِّعْ لَنَا إِلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا‏.‏ فَيَقُولُ لَسْتُ هُنَاكَ ـ وَيَذْكُرُ لَهُمْ خَطِيئَتَهُ الَّتِي أَصَابَ ـ وَلَكِنِ ائْتُوا نُوحًا، فَإِنَّهُ أَوَّلُ رَسُولٍ بَعَثَهُ اللَّهُ إِلَى أَهْلِ الأَرْضِ‏.‏ فَيَأْتُونَ نُوحًا فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ ـ وَلَكِنِ ائْتُوا إِبْرَاهِيمَ خَلِيلَ الرَّحْمَنِ‏.‏ فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ لَهُمْ خَطَايَاهُ الَّتِي أَصَابَهَا ـ وَلَكِنِ ائْتُوا مُوسَى عَبْدًا أَتَاهُ اللَّهُ التَّوْرَاةَ وَكَلَّمَهُ تَكْلِيمًا ـ فَيَأْتُونَ مُوسَى فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ لَهُمْ خَطِيئَتَهُ الَّتِي أَصَابَ ـ وَلَكِنِ ائْتُوا عِيسَى عَبْدَ اللَّهِ وَرَسُولَهُ وَكَلِمَتَهُ وَرُوحَهُ‏.‏ فَيَأْتُونَ عِيسَى فَيَقُولُ لَسْتُ هُنَاكُمْ وَلَكِنِ ائْتُوا مُحَمَّدًا صلى الله عليه وسلم عَبْدًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ‏.‏ فَيَأْتُونِي فَأَنْطَلِقُ فَأَسْتَأْذِنُ عَلَى رَبِّي فَيُؤْذَنُ لِي عَلَيْهِ، فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ لَهُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ لِي ارْفَعْ مُحَمَّدُ، وَقُلْ يُسْمَعْ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ‏.‏ فَأَحْمَدُ رَبِّي بِمَحَامِدَ عَلَّمَنِيهَا، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَرْجِعُ فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ ارْفَعْ مُحَمَّدُ، وَقُلْ يُسْمَعْ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ، فَأَحْمَدُ رَبِّي بِمَحَامِدَ عَلَّمَنِيهَا رَبِّي ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَرْجِعُ فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ ارْفَعْ مُحَمَّدُ، قُلْ يُسْمَعْ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ، فَأَحْمَدُ رَبِّي بِمَحَامِدَ عَلَّمَنِيهَا، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَرْجِعُ فَأَقُولُ يَا رَبِّ مَا بَقِيَ فِي النَّارِ إِلاَّ مَنْ حَبَسَهُ الْقُرْآنُ وَوَجَبَ عَلَيْهِ الْخُلُودُ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ شَعِيرَةً، ثُمَّ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ بُرَّةً، ثُمَّ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَكَانَ فِي قَلْبِهِ مَا يَزِنُ مِنَ الْخَيْرِ ذَرَّةً ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 39
			}
		}
	]
}