{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 806,
			"arabicnumber": 806,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَعَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا أَنَّ النَّاسَ قَالُوا يَا رَسُولَ اللَّهِ، هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ قَالَ ‏\"‏ هَلْ تُمَارُونَ فِي الْقَمَرِ لَيْلَةَ الْبَدْرِ لَيْسَ دُونَهُ سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَهَلْ تُمَارُونَ فِي الشَّمْسِ لَيْسَ دُونَهَا سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ فَإِنَّكُمْ تَرَوْنَهُ كَذَلِكَ، يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ، فَيَقُولُ مَنْ كَانَ يَعْبُدُ شَيْئًا فَلْيَتَّبِعْ‏.‏ فَمِنْهُمْ مَنْ يَتَّبِعُ الشَّمْسَ، وَمِنْهُمْ مَنْ يَتَّبِعُ الْقَمَرَ وَمِنْهُمْ مَنْ يَتَّبِعُ الطَّوَاغِيتَ، وَتَبْقَى هَذِهِ الأُمَّةُ فِيهَا مُنَافِقُوهَا، فَيَأْتِيهِمُ اللَّهُ فَيَقُولُ أَنَا رَبُّكُمْ فَيَقُولُونَ هَذَا مَكَانُنَا حَتَّى يَأْتِيَنَا رَبُّنَا، فَإِذَا جَاءَ رَبُّنَا عَرَفْنَاهُ‏.‏ فَيَأْتِيهِمُ اللَّهُ فَيَقُولُ أَنَا رَبُّكُمْ‏.‏ فَيَقُولُونَ أَنْتَ رَبُّنَا‏.‏ فَيَدْعُوهُمْ فَيُضْرَبُ الصِّرَاطُ بَيْنَ ظَهْرَانَىْ جَهَنَّمَ، فَأَكُونُ أَوَّلَ مَنْ يَجُوزُ مِنَ الرُّسُلِ بِأُمَّتِهِ، وَلاَ يَتَكَلَّمُ يَوْمَئِذٍ أَحَدٌ إِلاَّ الرُّسُلُ، وَكَلاَمُ الرُّسُلِ يَوْمَئِذٍ اللَّهُمَّ سَلِّمْ سَلِّمْ‏.‏ وَفِي جَهَنَّمَ كَلاَلِيبُ مِثْلُ شَوْكِ السَّعْدَانِ، هَلْ رَأَيْتُمْ شَوْكَ السَّعْدَانِ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا مِثْلُ شَوْكِ السَّعْدَانِ، غَيْرَ أَنَّهُ لاَ يَعْلَمُ قَدْرَ عِظَمِهَا إِلاَّ اللَّهُ، تَخْطَفُ النَّاسَ بِأَعْمَالِهِمْ، فَمِنْهُمْ مَنْ يُوبَقُ بِعَمَلِهِ، وَمِنْهُمْ مَنْ يُخَرْدَلُ ثُمَّ يَنْجُو، حَتَّى إِذَا أَرَادَ اللَّهُ رَحْمَةَ مَنْ أَرَادَ مِنْ أَهْلِ النَّارِ، أَمَرَ اللَّهُ الْمَلاَئِكَةَ أَنْ يُخْرِجُوا مَنْ كَانَ يَعْبُدُ اللَّهَ، فَيُخْرِجُونَهُمْ وَيَعْرِفُونَهُمْ بِآثَارِ السُّجُودِ، وَحَرَّمَ اللَّهُ عَلَى النَّارِ أَنْ تَأْكُلَ أَثَرَ السُّجُودِ فَيَخْرُجُونَ مِنَ النَّارِ، فَكُلُّ ابْنِ آدَمَ تَأْكُلُهُ النَّارُ إِلاَّ أَثَرَ السُّجُودِ، فَيَخْرُجُونَ مِنَ النَّارِ قَدِ امْتَحَشُوا، فَيُصَبُّ عَلَيْهِمْ مَاءُ الْحَيَاةِ، فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ، ثُمَّ يَفْرُغُ اللَّهُ مِنَ الْقَضَاءِ بَيْنَ الْعِبَادِ، وَيَبْقَى رَجُلٌ بَيْنَ الْجَنَّةِ وَالنَّارِ، وَهْوَ آخِرُ أَهْلِ النَّارِ دُخُولاً الْجَنَّةَ، مُقْبِلٌ بِوَجْهِهِ قِبَلَ النَّارِ فَيَقُولُ يَا رَبِّ اصْرِفْ وَجْهِي عَنِ النَّارِ، قَدْ قَشَبَنِي رِيحُهَا، وَأَحْرَقَنِي ذَكَاؤُهَا‏.‏ فَيَقُولُ هَلْ عَسَيْتَ إِنْ فُعِلَ ذَلِكَ بِكَ أَنْ تَسْأَلَ غَيْرَ ذَلِكَ فَيَقُولُ لاَ وَعِزَّتِكَ‏.‏ فَيُعْطِي اللَّهَ مَا يَشَاءُ مِنْ عَهْدٍ وَمِيثَاقٍ، فَيَصْرِفُ اللَّهُ وَجْهَهُ عَنِ النَّارِ، فَإِذَا أَقْبَلَ بِهِ عَلَى الْجَنَّةِ رَأَى بَهْجَتَهَا سَكَتَ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ، ثُمَّ قَالَ يَا رَبِّ قَدِّمْنِي عِنْدَ باب الْجَنَّةِ‏.‏ فَيَقُولُ اللَّهُ لَهُ أَلَيْسَ قَدْ أَعْطَيْتَ الْعُهُودَ وَالْمَوَاثِيقَ أَنْ لاَ تَسْأَلَ غَيْرَ الَّذِي كُنْتَ سَأَلْتَ فَيَقُولُ يَا رَبِّ لاَ أَكُونُ أَشْقَى خَلْقِكَ‏.‏ فَيَقُولُ فَمَا عَسَيْتَ إِنْ أُعْطِيتَ ذَلِكَ أَنْ لاَ تَسْأَلَ غَيْرَهُ فَيَقُولُ لاَ وَعِزَّتِكَ لاَ أَسْأَلُ غَيْرَ ذَلِكَ‏.‏ فَيُعْطِي رَبَّهُ مَا شَاءَ مِنْ عَهْدٍ وَمِيثَاقٍ، فَيُقَدِّمُهُ إِلَى باب الْجَنَّةِ، فَإِذَا بَلَغَ بَابَهَا، فَرَأَى زَهْرَتَهَا وَمَا فِيهَا مِنَ النَّضْرَةِ وَالسُّرُورِ، فَيَسْكُتُ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ، فَيَقُولُ يَا رَبِّ أَدْخِلْنِي الْجَنَّةَ‏.‏ فَيَقُولُ اللَّهُ وَيْحَكَ يَا ابْنَ آدَمَ مَا أَغْدَرَكَ، أَلَيْسَ قَدْ أَعْطَيْتَ الْعَهْدَ وَالْمِيثَاقَ أَنْ لاَ تَسْأَلَ غَيْرَ الَّذِي أُعْطِيتَ فَيَقُولُ يَا رَبِّ لاَ تَجْعَلْنِي أَشْقَى خَلْقِكَ‏.‏ فَيَضْحَكُ اللَّهُ ـ عَزَّ وَجَلَّ ـ مِنْهُ، ثُمَّ يَأْذَنُ لَهُ فِي دُخُولِ الْجَنَّةِ فَيَقُولُ تَمَنَّ‏.‏ فَيَتَمَنَّى حَتَّى إِذَا انْقَطَعَتْ أُمْنِيَّتُهُ قَالَ اللَّهُ عَزَّ وَجَلَّ تَمَنَّ كَذَا وَكَذَا‏.‏ أَقْبَلَ يُذَكِّرُهُ رَبُّهُ، حَتَّى إِذَا انْتَهَتْ بِهِ الأَمَانِيُّ قَالَ اللَّهُ تَعَالَى لَكَ ذَلِكَ وَمِثْلُهُ مَعَهُ ‏\"‏‏.‏ قَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ لأَبِي هُرَيْرَةَ ـ رضى الله عنهما ـ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ قَالَ اللَّهُ لَكَ ذَلِكَ وَعَشَرَةُ أَمْثَالِهِ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ لَمْ أَحْفَظْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ قَوْلَهُ ‏\"‏ لَكَ ذَلِكَ وَمِثْلُهُ مَعَهُ ‏\"‏‏.‏ قَالَ أَبُو سَعِيدٍ إِنِّي سَمِعْتُهُ يَقُولُ ‏\"‏ ذَلِكَ لَكَ وَعَشَرَةُ أَمْثَالِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 201
			}
		}
	]
}