{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"10": "The Book of Lost and Found Items"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1701,
			"arabicnumber": 1701,
			"text": "Süveyd b. Gafele'den; demiştirki: Zeyd b. Sûhan ve Selmân İbn Rabia ile birlikte savaşa çıkmıştım. (Yolda) bir kamçı buldum. Bana, \"onu (aldığın yere) at (çünkü başkasına aittir)\" dediler. Ben de \"Hayır (onu atmayacağım) fakat eğer sahibini bulursam (ona teslim edeceğim) yoksa ondan kendim yararlanacağım\" dedim. Sonra hacc farizasını edâ edip Medine'ye uğradım. (Bulmuş olduğum yitik kamçının hükmünü) Übeyy b. Kab'a sordum. Şöyle cevap verdi: Ben de (bir gün) içinde yüz dinar bulunan bir kese bulmuş Peygamber (s.a.)'e getirmiştim de (bana): \"Onu bir sene ilân et\" demişti. Bunun üzerine ben onu bir sene ilân ettim. Sonra (sahibi çıkmadığı için yine) Peygamber (s.a.)'e vardım. (Bana tekrar): \"Onu bir sene ilân et\" dedi. Ben onu bir sene daha ilan ettim. Sahibi çıkmayınca durumu haber vermek üzere (tekrar) Peygamber (s.a.)'in huzuruna vardım. (Bana aynı şekilde); \"Onu bir sene (daha) ilân et\" buyurdu. Bunun üzerine onu bir sene daha ilân ettim, sonra (tekrar) yanına vardım ve; \"Onu tanıyan bir kimse bulamadım\" dedim. Bunun üzerine: \"Bu paranın sayısını, kesesini ve ağız bağını muhafaza et! Eğer sahibi gelirse (kendisine teslim edersin); gelmezse, ondan kendin yararlanırsın\" buyurdu. (Râvi Seleme'b. Küheyl) dedi ki: (Süveyd İbn Gafele) \"Onu (bir sene) ilân et.\" sözünü üç (defa) mı yoksa bir (defa) mı naklettiğini (iyice) bilemiyorum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": 1702,
			"text": "Şu'be'den önceki (1701.) hadisin mânâsı rivayet edilmiştir. (Şu'be'nin bu rivayetine göre hocası Seleme b. Küheyl önceki hadisi, Resûlullah üç defa, \"onu bir yıl (boyunca) ilan et.\" buyurdu şeklinde rivayet etmiş, (sonra da) şöyle demiştir. \"Resûlullah (s.a.v.), Ubey b. Ka'b'a bu üç defa tekrarlama işini bir sene içerisinde mi, yoksa üç sene içinde mi, yerine getirmesini emretmiş, iyice bilemiyorum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": 1703,
			"text": "Mûsâ b. İsmail, Hammâd kanalıyla Seleme b. Kuheyl'den aynı sened ve manada bir Önceki 1701 no'lu hadisi rivayet etmiştir. (Râvi Seleme buluntu malın) ilânı hakkında (yaptığı bu riva­yette) şöyle dedi: (Süveyd b. Gafele bana buluntu bir malın) \"İki yahutta üç yıl\" (bekletilmesi gerektiğini) söyledi. (Ve Hz. Nebi Ubeyy b. Kab r.a.'a; \"Bulduğun kesenin (içinde bulunan paraların) sayısını ve (kesenin) ağız bağını tesbit et\" buyurdu\" (Bu hadisin râvilerinden Hammâd kendi rivayetinde hadise şunları da) ilâve etti: \"Eğer sahibi gelir de (buluntu kesenin içindeki paraların) miktarını ve (kesenin) ağız bağını bilecek olursa, keseyi ona ver\". Ebû Dâvûd dedi ki: bu \"miktarını bilecek olursa\" sözünü bu hadîste Hammâd'dan başka rivayet eden olmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "Zeyd b. Hâlid el-Cühenî'den (rivayet edildiğine göre) Bir adam Resûlullah (S.A.V.)'e, buluntu mal'ın hükmünü sormuş O (S.A.V.)'de; \"Onu bir sene ilan et! Sonra ağız bağıyla çıkınını iyice tespit et ve harca. Eğer sahibi gelirse, o'na verirsin\" buyurmuş. Bunun üzerine (adam): Ey Allah'ın Resulü, ya yitik davar (nasıl bir muameleye tabi tutulacak?) demiş, (Hz. Nebi de:) \"Onu da al, çünkü o ya senindir ya da (bir din) kardeşinindir. Yahut da kurdundur\" buyurmuştur. (Bunun üzerine adam:) Ey Allah'ın Resulü ya yitik develer (nasıl bir mualeye tabî tutulurlar) demiş. Resûlullah (S.A.V.) de yanakları ya da yüzü kızaracak kadar öfkelenip: “Sahibi gelinceye kadar onun ayakkabısı da su kırbası da beraberindedir. Onlardan sana ne?\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": 1705,
			"text": "Önceki (1704.) hadisin mânâsı aynı senetle (bir de) Mâlik (b. Enes)'den rivayet edilmiştir (ve bu rivayette onların) \"su tulumu beraberindedir (bu sayede onlar) suya gelirler, ağaçlan otlarlar\" (sözünü) ekledi, (fakat önceki hadiste) yitik koyunlar hakkında (geçen) \"onu al (çünkü ya senindir, ya din kardeşinindir, yahut da kurdundur\" sözünü) rivayet etmedi. Yitik mal hakkında da (şunları) rivayet etti: \"Onu bir sene ilan et, eğer sahibi gelirse (teslim edersin), gelmezse onu nasıl istersen yap\" (Fakat önceki hadiste geçen \"onu kendin için sarfet\" sözünü rivayet etmedi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": 1706,
			"text": "Zeyd b. Hâlid el-Cühenî'den rivayet edildiğine göre, Resûlullah (S.A.V.)'e buluntu mal(ın nasıl bir muameleye tabi tutulacağı) sorulmuş, o (S.A.V.)'da şöyle cevap vermiş: \"Onu bir sene ilân et. Eğer arayıcısı gelirse, ona ver. Eğer gelmezse, onun kabını ve ağız bağını tesbit et, onu malına kat. Eğer (onu harcadıktan sonra bir gün onun) arayıcısı çıkıp gelecek olursa, onu(n değerini) kendisine veriver",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": 1707,
			"text": "Zeyd b. Hâlid el-Cühenî'den rivayet edilmiştir. Dedi ki: Resûlullah (S.A.V.)'e lukata soruldu da... Bundan sonra (1704 no'lu) Rabia hadisinin bir benzerini rivayet etti. (Abdullah b. Yezîd bu hadisi) şöyle rivayet etti: (Hz. Peygamber'e) buluntu mal(ın nasıl bir işleme tabi tutulacağı) soruldu da, O, (S.A.V.), şöyle cevap verdi: \"Onu bir sene ilan edersin, eğer sahibi gelirse onu kendisine teslim edersin. Gelmezse, ağız bağını ve çıkınını belirlersin sonra onu kendi malına katarsın. Eğer bir süre sonra sahibi gelecek olursa bunu ona veriverirsin",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": 1708,
			"text": "Bir önceki (1707.) hadisin) manası (bir de 1704 numaralı) Kuteybe (b. Abdurrahman) hadisinin senediyle yani Rabia b. Ebî Abdurrahman yoluyla (rivayet edilmiştir. Şu farkla ki Hammâd b. Seleme) bu rivayete şu cümleyi de eklemiştir: \"Eğer arayıcısı gelir de (malın) çıkınını ve miktarını bilirse, onu ona verîver\". (Bu hadisin) bir benzerini de yine Hammâd, Ubeydullah b. Ömer, Amr b. Şuayb, onun babası ve dedesi yoluyla Peygamber (S.A.V.)'den rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": 1709,
			"text": "İyad b. Hımâr'dan; demiştir ki: Resûlullah sallallahu aleyhi ve sellem şöyle buyurmuştur: \"Kim bir yitik mal bulursa bir veya iki adaletli kimseyi (bu malı emânetine aldığına dâir) şâhid tutsun, gizlemesin ve kaybetmesin. Eğer sahibi çıkarsa ona versin, eğer çıkmazsa, o zaman o aziz ve celîl olan Allah'ındır, onu istediğine verir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": 1710,
			"text": "Abdullah b. Amr b. el-As'dan rivayet edildiğine göre, Resûlullah (S.A.V.)'e ağaçta bulunan meyveden (alıp yemenin hükmü) sorulmuş da: \"Her kim o'nu ihtiyacından dolayı ağzıyla alıp yer de eteğini doldurmazsa, (bundan dolayı) ona bir ceza lâzım gelmez. Ondan bir şey koparır (da başka yere taşır)sa, onun değerinin iki mislini ödemek onun üzerine borç olmakla beraber (ta'zir) cezasına da çarptırılır. Kim de meyveyi meyve kurutulan yere konduktan sonra çalar da (çalınan bu meyvenin) değeri, bir kalkan değeri olursa, ona (el) kesme (cezası) lâzım gelir,\" buyurmuş ve (Abdullah b. Amr, rivayetine devam ederek) başkalarının rivayet ettiği şekilde yitik deve ve koyun hakkında rivayette bulunmuş (bu rivayetinde) şöyle demiş. (Hz. Nebi'ye) yitik maldan soruldu da şöyle cevap verdi: \"İşlek bir yolda ya da ma'mür olan bir köyde bulduğun bir malı bir sene ilan et. Eğer (bu süre içerisinde) sahibi gelirse ona ver, eğer gelmezse senindir. Harab olan bir yerde bulunan bir malda ve rikâzda beşte bir (Vergi) vardır. (Gerisi bulana kalır)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "Şu (önceki 1710) hadisi (yine) Amr b. Şuayb (önceki) senediyle rivayet etti. (Bu rivayete göre Abdullah b. (Amr ya da Velid b. Kesir) yitik koyun hakkında şöyle demiştir: (Resûlullah sallallahu aleyhi ve sellem kendisine yitik koyun hakkında soru soran kimseye): \"Onu al (yanında) iyi muhafaza et\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "Şu (1710 numaralı) hadisi Amr b. Şuayb aynı senedle (üçüncü defa olmak üzere bir defa daha) rivayet etti. (Bu rivayete göre Resulullah sallallahu aleyhi ve sellem) yitik koyun hakkında sadece: \"O ya senindir, ya (din) kardeşinindir, ya da kurdundur. Öyleyse onu al.\" buyurmuştur. Aynı şekilde Eyyûb (es-Sahtiyânî) ile Yakub b. Ata, Amr b. Şuayb kanalıyla Peygamber (S.A.V.)'den (sözü geçen hadisi rivayet etmişler ve) bu rivayetlerinde (Hz. Peygamberin sadece); \"On'u (sahibine vermek üzere yanına) al.\" buyurduğunu nakletmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "Şu (1710 numaralı) hadisi Amr b. Şuayb, babası Şuayb ve dedesi Abdullah b. Amr b. el-As yoluyla Mebi (S.A.V.)'den bir de (Muhammed) îbn İshak rivayet etmiştir: (Bu rivayete göre: Hz. Nebi) yitik koyun hakkında şöyle buyurmuştur: \"Onu al, arayıcısı gelinceye kadar (yanında muhafaza et)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "Ebû Saîd (el-Hudrî)'den (rivayet edildiğine göre) Ali b. Ebî Tâlib bir dinar bulup Hz. Fatıma'ya getirmiş, (Hz. Fatıma da) Onu (harcamanın haram olup olmayacağını) Resûlullah (S.A.V.)'e sormuş (Nebi (S.A.V.): \"Allah'ın rızkıdır\" buyurmuş. Sonra ondan Resûlullah (S.A.V.) de yemiş, Hz. Ali ile Fatıma da yemiş. Sonra Hz. Ali'ye, onu arayan bir kadın çıkmış gelmiş. Bunun üzerine Peygamber (S.A.V.): \"Ey Ali, dinarı (ona geri) ver\" buyurmuş, (Hz. Ali de geri vermiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "Ali (r.a.)'dan (rivayet edildiğine göre), Kendisi (bir gün) bir dinar bulup onunla bir miktar un satın almış (fakat) hemen o anda un sahibi onu tanıyıp (kendisine ikram için) dinarı geri vermiş. Bunun üzerine Ali (r.a.) dinarı alıp ondan iki kıratını ayırmış ve onunla et satın almıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "Sehl b. Sa'd'dan rivayet edildiğine göre, Ali b. Ebî Tâlib (bir gün) Fâtıma' (r.anha)'nın yanına girmiş. Hz. Hasan ile Hüseyin ağlıyorlarmış. \"Bunları ağlatan nedir?\" diye sormuş. O da: Açlıktır, demiş. Bunun üzerine Ali (r.a.) (dışarı) çıkmış çarşıda bir dinar bulmuş. Hemen gidip onu Fâtıma'ya haber vermiş. Fâtıma da: Falanca yahudiye git (ondan) bize bir miktar un al, demiş. Bunun üzerine Hz. Ali gidip o dinarla bir miktar un satın almış. O anda Yahudi (onu tanıyarak): Sen kendisinin Allah'ın elçisi olduğunu iddia eden kimsenin damadı değil misin demiş (Ali); \"Evet\" cevabım vermiş. (Bunun üzerine Yahudi); Sen dinarını al, un da senin olsun, demiş. Ali hemen (unu alıp dükkandan dışarı) çıkmış ve unu Fâtıma'ya getirmiş olayı da kendisine haber vermiş. Hz. Fâtıma da (O'na); Falan kasaba git (bu paradan ayıracağın) bir dirhemle bize et satın al, gel demiş. Ali et için harcayacağı dirhem karşılığında (elindeki) dinarı rehin vermiş ve (bu dirhemle satın aldığı) eti Fâtıma'ya getirmiş, (Fâtıma da unu) yoğurmuş ve (içinde eti pişirmek üzere ateş üzerine bir tencere) koymuş. (Hamuru da) ekmek yapmış ve (yanlarına gelmesi için) babasına (haber) göndermiştir. Biraz sonra da (babası) yanlarına gelmiş. Bunun üzerine (babasına hitaben): Ey Allah'ın Resulü, (durumu) sana anlatacağım. Eğer onu (bizim için) helâl görürsen onu yiyeceğiz ve bizimle beraber sen de yiyeceksin. Onun durumu şöyle şöyledir, demiş. (Bunları dinleyen) Nebi (S.A.V.): \"Allah'ın adıyla (onu) yeyiniz.\" buyurmuş ve (ve Nebi ile birlikte orada bulunan Hz. Ali Fâtıma ve çocukları o ekmeği) yemişler. Onlar yerlerinde (oturup dururlar) iken bir de ne görsünler, biri \"Allah aşkına ve İslâm aşkına\" diyerek dinarı arıyormuş. Resûlullah (S.A.V.) derhal (orada bulunan birisine) o gencin çağırılıp getirilmesini emretmiş. Bunun üzerine genç, Nebi (S.A.V.)'in huzuruna çağırılmış. (Nebi huzuruna gelen)bu genc'e (aradığı dinarın vasıflarını ve miktarını) sormuş. (Genç de dinar'ın vasıflarını ve miktarını söyledikten sonra): \"Çarşıda benden düştü,\" demiş. Nebi (S.A.V.) de: \"Ey Ali, kasaba git, ona, Resûlullah sana \"dinarı bana gönder, dirhemin de bendedir” diyor de.\" buyurmuş. Bunun üzerine (kasab) dinarı göndermiş Resûlullah (S.A.V.)'de dinarı o genc'e (geri) vermiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "Câbir, b. Abdillah'dan; demiştir ki: Resûlullah (S.A.V.) bize (fakir olan) kişinin bulduğu baston, ip, kamçı ve benzeri (kıymetsiz) şeylerden yararlanmasına izin verdi. Beyhakî, es-Sünnenü'l-kübrâ, VI, 195. Ebû Dâvûd dedi ki: Bu hadisi bir de en-Numan b. Abdisselâm, el-Mugîre Ebi Seleme'den, senedi (olan ez-Zübeyr el-Mekkî yolu) ile rivayet etti. (Ayrıca) Şebâbe de Muğîre b. Müslim, Ebû'z Zübeyr yoluyla Câbir'den \"Ashâb böyle idiler\" dedi ve bu hadisi Şebâbe'ye riva­yet eden Şeyhlerin hiçbirisi rivayetlerinde) Peygamber (S.A.V.)'i anma­dılar. (Yani hadisi mevkuf olarak rivayet ettiler)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre, Nebi (S.A.V.) şöyle buyurmuştur: \"(Bulunduğu halde ilân edilmeyip) saklanan yitik deve(nin saklanmasının) mâli cezası kıymetinin ödenmesidir, ve onunla birlikte (kıymetinin) bir mislinin daha (verilmesidir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "Abdurrahman b. Osman et-Teymî'den rivayet edildiğine göre, Resûlullah (S.A.V.) hacının kaybettiği mal'ı (almayı) yasaklamıştır. Müslim, lukata; Dârimî, buyu'; Ahmed b. Hanbel, III, 499; Beyhaki, es-Sünenü'l-kübrâ, VI, 199. Ebû Davud'a bu hadisi rivayet eden iki şeyhden biri olan Ahmed (b. Salih) dedi ki: İbn Vehb hacının kaybettiği mal hakkında (şöyle) dedi: \"(Hacının malını bulan kimse ona dokunmaz onu (ol­duğu yerde) bırakır. Nihayet sahibi (gelip) onu (orada) bulur.)\" Ebû Davud'un şeyhi Ahmed b. Salih bu hadisi, \"bana Âmir haber verdi\" diyerek ihbar bildiren kelimelerle rivayet ettiği halde, diğer şeyhi) İbn Mevhib (bana); \"Amr'dan (rivayet edildi diyerek an'ane yoluyla) rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "el-Münzir b. Cerîr'den; demiştir ki: Ben (bir gün babam) Cerîr'le birlikte idim. (Babamın sığırlarını güden) çoban sığır sürüsünü (yanımıza) getirdi. İçlerinde sürüden olmayan bir sığır vardı, (babam) Cerîr çoban'a: Bu da nedir? diye sordu. (Çoban:) Sürüye karışmış kimin olduğunu bilmiyorum, dedi. Bunun üzerine Cerîr: Onu (sürüden) çıkar. (Çünkü ben) Resûlullah (S.A.V.)'i \"Sapık(olanlar)dan başkası yitik bir hayvanı (kendi sürüsüne) katmaz\" buyururken işittim, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 20
			}
		}
	]
}