{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"19": "Shares of Inheritance (Kitab Al-Fara'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "Abdullah b. Amr b. el-As'dan demiştir ki: Rasûlullah (s.a.v.): (Dini) İlim(lerin aslı) üçtür: Bunların dışındaki ilim(ler) fazladandır). Muhkem âyet(ler) sabit sünnet (miras taksiminde) adaletli fariza (ilmi) buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "İbn el-Münkedir, Cabir'i (şöyle) derken işitmiş; \"Ben hastalanmıştım. Baygın bulunduğum bir sırada Peygamber (s.a.v.): Ebû Bekir'le birlikte yaya olarak beni ziyarete gelmiş ben (baygınlığım sebebiyle) kendisiyle konuşamayınca bir abdest alıp (abdest suyunu) üzerime serpmiş, bunun üzerine ben ayıldım. (Rasûl-i Ekrem'in yanımda olduğunu görünce): \"Ey Allah'ın Rasûlü malım hakkında nasıl bir işlem yapayım. Benim (geride kalacak) kız kardeşlerim de var\" dedim. Hemen o anda \"senden fetva istiyorlar de ki, Allah sizi babasız ve çocuksuz kişinin mirası hakkında hükmünü (şöyle) açıklıyor...\"[Nisa 176] (mealindeki) miras âyet-i kerimesi indirildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "Câbir (r.a)'den demiştir ki: (Bir defasında) \"Hastalanmıştım. Yanımda yedi kızkardeşim vardı. (Bir gün bayılmışım) RasûluUah (s.a.v.) yanıma gelip yüzüme üfürmüş de kendime geldim ve: \"Ey Allah'ın Rasûlü. (ben ölünce) kızkardeşlerime (kalacak olan malımın) üçte ikisini vasiyet edemez miyim?, dedim. (Kız kardeşlerine) iyi davran buyurdu. (Bu malın) yarısı(m vasiyet etsem olmaz mı?) dedim. (Yine kızkardeşlerine) iyi davran buyurdu. Sonra beni bırakıp çıktı. (Çıkıp giderken) \"Ey Cabir! Bu hastalığından dolayı öleceğini sanmıyorum, şübhesiz ki (yüce) Allah (Kurân-ı Kerim'inde miras âyetini) indirdi ve kız­kardeşlerine düşecek olan payı da açıkladı. Onlara üçte iki pay ayırdı.\" buyurdu. (Bu hadisi Cabir'den nakleden Ebû Zübeyr) dedi ki Cabir \"Senden fetva istiyorlar, de ki: Allah sîze babasız ve çocuksuz kişinin mirası hakkına hükmünü açıklıyor.[Nisa 176] Âyeti benim hakkımda indirdi, derdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "el-Bera b. Azib'den demiştir ki: Kelale (geride baba ve çocuk bırakmadan ölen kimse) hakkında inen en son âyet \"senden fetva istiyorlar.De ki Allah size babasız ve çocuksuz kişinin mirası hakkında hükmünü şöyle açıklıyor:”[Nisa 176] âyet-i kerimesidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "Bera b. Azib'den demiştir ki: Bir adam Nebi (s.a.v.)'e gelerek \"Ey Allah'ın Rasûlü kelale hakkında senden fetva istiyorlar\" (âyetindeki) kelâle nedir? Dedi.(Peygamber (s.a.v.) de): \"Sana (bu hususta) \"yaz âyeti yeter\" buyurdu. (Ravî Ebû Bekir) dedi ki \"Ben Ebû İshak'a -kelâle (arkasında) çocuk ve baba bırakmadan ölen kimsedir- dedim. O da -öyledir ve (başkaları da) öyle olduğuna hükmettiler- cevabım verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "Hüzeyl b. Şürahbil el-Evdî'den demiştir ki: Ebû Musa el-Eş'arî ile Selman b. Rabia'ya bir adam gelerek onlara kız(ın mirası) ile oğlun kızı ve anne-baba bir kızkardeş(in mirasını) sordu. Onlar da (bir kimsenin mirasının) \"yarısı kızma yarısı da anne-baba bir kızkardeşine düşer\" (dediler). Oğlun kızına mirastan hiçbir şey düşürmediler. (ve) Bir de (bu soruyu soran kimseye) \"İbn Mes'ud'a git. (O'na da sor) kuşkusuz (bu hususta) o da bize uyacaktır\" (dediler). Bunun üzerine o adam İbn Mes'ud'a varıp (bu meseleyi) ona da sordu ve ona Ebû Musa el-Eşârî ile Selman b. Rabia (r.a.)'ın sözlerini de nakletti. İbn Mes'ud da \"Eğer ben bu (hususta) onlara uyacak olursam (haktan) sapmış olurum ve hidayete erenlerden olmam. Fakat ben (bu meselede) Rasûlullah (s.a.v.)'in verdiği hükümle hükmedeceğim (şöyle ki mirasın) yarısı (ölenin) kızı içindir. Üçte ikisinin tamlayıcısı olan altıda bir pay da (ölünün) oğlunun kızına, geriye kalanı da anne-baba bir kızkardeşe aittir.\" cevabını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "Câbir b. Abdullah'dan demiştir ki: (Bir gün) Rasûlullah (s.a.v.)'le birlikte çıkmıştık. Medine'nin hareminde ensardan bir kadının yanına vardık. Kadın (yanımıza) kendisine ait olan iki kız çocuğu getirdi ve: \"Ey Allah'ın Rasûlü bunlar Uhud (savaşı) günü senin yanında savaşırken şehid edilen Sabit b. Kays'm kızlarıdır. Bunların amcaları mallarının ve miraslarının tümünü (ellerinden) aldı ve onlara hiçbir şey bırakmadı. Ey Allah'ın Rasûlü (bu hususta) ne buyurursun? Allah'a yemin ederim ki bunlar malları olmadıkça asla evlenemezler.\" dedi. Rasûlullah (s.a.v.) de (Hele sabredin bakalım) \"Allah bu hususta bir hüküm verir\" buyurdu. Ve (bir süre sonra) Nisa suresinin \"Allah size çocuklarınızın alacağı miras) hakkında erkeğe kadının payının iki mislini tavsiye eder\"[Nisa 11] âyeti nazil oldu. Bunun üzerine Rasûlullah (s.a.v.) \"O kadınla, şikayetçi olduğu adamı çağırınız\" dedi. (ve bu emir yerine getirildi kızların) amcasına (mirasın) \"üçte ikisini kızlara, sekizde birini annelerine ver, kalanı da senindir.\" buyurdu. Ebû Dâvûd der ki (bu hadisi rivayet) eden Bişr el-Mufaddal hata etmiştir. Bu kızlar Sa'd b. er-Rabi'in kızlarıdır. Sabit b. Kays ise (Uhud savaşında değil) Yemâme gününde şehid edilmiştir.[34]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "Câbir b. Abdillah'dan demiştir ki: Sa'd b. er-Rebi’in karısı (Hz. Peygamber'e gelerek) \"Ey Allah'ın Rasûlü, Sa'd şehid oldu (ve geride) iki de kız bıraktı\" (bu kızların hali ne olacak?) demiş. Ebû Dâvûd der ki bu (hadisin Sa'd b. er-Rebi’ ile ilgili kısmı bir önceki 2891. hadiste geçen Sabit b. Kays'la ilgili kısımdan) daha sağlamdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "Esved b. Yezid'den demiştir ki: Muaz b. Cebel Yemen'de (vali) iken (bir ölü'nün) bir kız(ı) ile bir kızkardeş(in)e miras bölüştürmüş de bunlardan her birine (mirasın) yarasını) vermiş. O zaman Peygamber (s.a.v.) de hayatta imiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "Kabaysa b. Züeyb'den demiştir ki: Bir nine Ebû Bekr es-Sıddîk’a gelerek miras(tan kendisine düşecek olan pay)ını sordu. (Hz. Ebû Bekir de bu hususta): \"Senin için Allah'ın kitabında bir hüküm yok. Allah'ın Peygamberi'nin sünnetinde de (bu hususta) seninle ilgili bir hüküm bilmiyorum. Binaenaleyh sen git de ben (bunu) halka bir sorayım\" cevabını vermiş ve halka sormuş. Bunun üzerine Mugîre b. Şube \"Ben Rasûlullah (s.a.v.) bir nineye altıda bir (pay) verirken yanında bulundum.\" demiş. Hz. Ebû Bekir de (Ona) \"Senin yanında başka birisi daha var mıydı? diye sorunca Muhammed b. Mesleme ayağa kalkıp Mugîre b. Şube'nin söylediklerini aynen tekrarlamış. Bunun üzerine Hz. Ebû Bekir o nineye bu hükmü uygulamış. Sonra başka bir nine de Ömer b. ei-Hattâb (r.a.)'ya gelerek ona miras(tan alacağı pay)ını sormuş o da \"yüce Allah'ın kitabında seninle ilgili bir hüküm yok, (bu hususta daha önce) verilmiş olan hüküm ise senden başkasına (yani senden başka bir nineye) ait olan (özel) bir hükümdür. Ben (Allah tarafından Kur'ân-ı Kerim'de belirlenen) paylara (bir pay) ilave edecek değilim. Fakat (sahih) ninenin miras pay'ı şu (Ebû Bekr'in kendi devrindeki nineye vermiş olduğu) altıda bir paydır. Artık bu hissede ikiniz birden bulunacak olursanız, bu hisse ikiniz arasındadır. İkinizden hangisi tek başına bu hisseye mirasçı olursa bu hisse onundur\" cevabım vermiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2895,
			"arabicnumber": 2895,
			"text": "(İbn Büreyde'nin) babasından rivayet ettiğine göre: Nebi (s.a.v.) daha aşağısında ana olmamak şartıyla nine için (mirastan) altıdabir (pay) tahsis etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "İmrân b. Husayn'dan demiştir ki: Bir adam Nebi (s.a.v.)'e gelip: Oğlumun oğlu vefat etti. Onun mirasından benim (payıma düşecek olan) nedir?\" diye sormuş (Hz. Peygamber de),: \"Senin (payın) altıda birdir\" cevabını vermiş ve (adam gitmek üzere) sırtını dönünce onu çağırıp \"Senin için altıdabirden başka bir (hisse) daha var\" demiş. (Adam gitmek üzere) sırtını dönünce onu tekrar çağırıp (beriki) \"altıdabir (hisse) sana (esas hissenin dışında asabe hakkı olarak verilen) bir rıziktır\" buyurmuş. (Bu hadisin ravisi) Katade dedi ki: \"Sahabe-i kiram Peygamber efendimizin bu (zatı) beriki altıdabir hissesinden dolayı vâris kıldığını bilmiyorlardı (işin aslı şudur ki). Altıdabir hisse, dedenin mirastan aldığı payın en azıdır. (Bazan dede asabe olarak ilk altıda bir hisseden başka ikinci bir altıdabir daha alabilir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "Hasen (eİ-Basrî)den rivayet olunduğuna göre) Ömer (b. Hattab) (r.a.) bir gün ashab-ı kirama hitaben \"Rasûlullah (s.a.v.)'in dedeye miras'tan ne kadar bir pay verdiğini (içinizden) hanginiz biliyor?\" demiş de Ma'kıl b. Yesar: Ben (biliyorum) Rasûlullah (s.a.v.) dedeye altıda bir pay verdi\" cevabını vermiş (Bunun üzerine Hz. Ömer' de) \"Kiminle beraber (bulunduğu zaman Hz. Peygamber ona bu payı verdi?) demiş (Hz. Ma'kıl da) \"Bilmiyorum\" cevabını vermiş (bu cevabı alan Hz. Ömer de) \"Öyleyse (senin yukarıdaki cevabın bizim meselemize) bir çözüm getirmez.\" karşılığını vermiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "İbn Abbâs'dan demiştir ki: Rasûlullah (s.a.v.) (şöyle) buyurdu. (Ölü'nün geride bıraktığı) \"mal'ı belirli pay sahipleri arasında Allah'ın kitabına göre bölüştürünüz., Belirli hisselerden arta kalanı da (ölüye) en yakın olan erkeğe veriniz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "el-Mikdam'dan demiştir ki: Rasûlullah (s.a.v.) (şöyle) buyurdu: \"Kim bir yük (yani bakıma muhtaç aile ve borç) bırakırsa (o yük) bana aittir. (Hz. Peygamber efendimiz) bazan da (o yük) \"Allah'a ve Rasûlüne aittir\" buyurmuştur. (Hz. Peygamber sözlerine şöyle devam etmiştir:) \"Kim bir mal bırakırsa mirasçılarına aittir. Ben mirasçısı bulunmayan kimsenin mirasçısı olurum. Onun diyetini öderim ve ona varis olurum. Dayı da mirasçısı bulunmayan kimsenin mirasçısıdır. Onun diyetini öder ve ona varis olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "el-Mikdam b. el Kindî'den demiştir ki: Rasûlullah (s.a.v.) şöyle buyurdu: “Ben her müslümana kendisinden daha yakınım binaenaleyh kim bir borç ya da bakmaya muhtaç bir aile bırakırsa (bunların sorumluluğu) bana aittir. Kim de bir mal bırakırsa (bu mal) varislerine aittir. Ben varisi olmayan bîr kimsenin de varisiyim. Ona varis olurum ben onun bağını çözerim, dayı da varisi bulunmayan kimsenin varisidir. Onun malına varis olur. Ve onun bağını çözer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "(Salih b. Yahya b. el-Mikdam'ın) dedesinden (rivayet olunmuştur:) dedi ki: \"Ben Rasûlullah (s.a.v.) \"Ben varisi olmayan kimsenin varisiyim. Onun bağını çözerim ve malına vâris olurum. Dayı da varisi olmayan kimsenin varisidir. Onun bağını çözer ve malına vâris olur.\" dediğini işittim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "Aişe (r.anha)'dan demiştir ki: Nebi (s.a.v.) efendimizin hürriyetine kavuşturduğu bir köle hiçbir mal, çocuk ve akraba bırakmadan ölmüştü de Rasûlullah (s.a.v.): \"Onun mirasını kendi köyü halkından bir adam'a veriniz\" buyurdu. Ebû Dâvûd der ki (bu hadis bana birisi Müsedded yoluyla, diğeri de Sufyân yoluyla olmak üzere iki yoldan gelmiştir) Müsedded'in rivayeti daha geniştir. Müsedded (ise bu hadisi şöyle) rivayet etmiştir: Peygamber (s.a.v.) (azatlı kölesi ölünce orada bulunanlara) \"Burada onun memleketi halkından bir kimse var mı? diye sordu (onlar da) \"Evet\" cevabını verdiler\" (bunun üzerine) (Öyleyse bunun) mirasını ona veriniz.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "(Abdullah b. Büreyd'in) babasından demiştir ki: Nebi (s.a.v.)'e bir adam gelip: Bende Ezd (kabilesin)den bir kişi'nin mirası vardır. Onu kendisine vereceğim. Ezd kabilesine mensub bir kimse bulamadım, (ne yapayım?) dedi, (Peygamber efendimiz de): \"Git bir sene daha Ezd'li birini ara(maya devam et) buyurdu (Adam) bir sene sonra Hz. Peygamber'e gelip: Ey Allah'ın Rasûlü ben bu mirası kendisine vereceğim Ezdli bîr kimse bulamadım\" dedi. (Hz. Peygamber de:) \"Öyleyse git* kendisiyle karşılaşacağın ilk Huzua'lıya bak bunu ona ver, buyurdu. (Bu adam) dönüp gidince Hz. Peygamber: \"Bu adamı bana geri getirin,\" buyurdu. Biraz sonra adam huzuruna geldi. (Bu sefer ona) Huzaa kabilesinden en yaşlı olan kimseye bak bu mirası ona ver, buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "(Abdullah b. Büreyde'nin) babasından demiştir: Huzaa kabilesinden bir adam öldü de mirası Peygamber (s.a.v.)'e getirildi. Bunun üzerine (Hz. Peygamber): \"Onun varis (leri)ni yahut da yakın(lar)ını arayıp bulunuz\" buyurdu. (Fakat sahabiler) \"Ona ait bir varis yahutta bir akraba bulamadılar.\" Rasûlullah (s.a.v.) de: \"Bu mirası Huzaa'nın en yaşlısına veriniz.\" buyurdu. (Ravi Yah­ya b. Muin) dedi ki: Ben Mürre'nin bu hadisi bir defasında da (şöyle) rivayet ettiğini işittim: \"Huzaa kabilesinin en yaşlı adamını arayınız",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "İbn Abbas'dan demiştir ki Bir adam hürriyetine kavuşturduğu bir kölesinden başka hiçbir varis bırakmadan ölmüş de Rasûlullah (s.a.v.): “Bu adam'ın herhangi bir (varisi) var mıdır?\" diye sormuş (orada bulunanlar da): \"Hayır (yoktur). Ancak hürriyetine kavuşturduğu bir kölesi vardır\" demişler. Bunun üzerine Rasûlullah (s.a.v.): Mirasını o köleye veriniz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "Vâsıla b. el-Eska'dan demiştir ki: Nebi (s.a.v.) (şöyle) buyurmuştur: \"Kadın üç miras'a varis olur: Hürriyetine kavuşturduğu kölesinin mirasına) yol üstüne atılmış olarak bulup da büyüttüğü kimse (nin mirasına) üzerinde (kocasıyla) lanetleştiği çocuğu(nun mirasın)a",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "Mekhûl'den demiştir ki: Rasûlullah (s.a.v.) üzerinde lian yapılan çocuğun mirasını annesine verdi, annesinin olmaması halinde de annesinin varislerine verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "(Abdullah b. Amr b. As'ın) dedesinden (rivayet olunduğuna göre bir önceki 2907. hadisin) bir benzerini de peygamber (s.a.v.)'den (Amr b. Şuayb b. Muhammed b. Abdillah b. Amr b. As'ın) dedesi (rivayet etmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "Üsame b. Zeyd'den demiştir ki: Nebi (s.a.v.): \"Müslüman kafire, kâfir de müslümana mirasçı olamaz\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "Üsame b. Zeyd'den demiştir ki: Ben (Nebi s.a.v.'e veda) haccı sırasında (Mina'dan Mekke'ye gelirken): \"Ey Allah'ın Rasûlü yarın nerede konaklayacaksın? Diye sor­dum da: (amcam oğlu) \"Akil bize (konaklayacağımız) bir yer mi bıraktı ki?\" cevabını verdi. Sonra Muhassab (denilen yer)i kasdederek: (Yarın) - \"Beni Kinâne hayfında, Kureyş'in küfür üzerinde (kalmak üzere) anlaştığı yere ineceğiz\" buyurdu. Bu (anlaşma) Kinâne oğullarının Hâşimoğulları ile evlenmemek, onları aralarında barındırmamak ve onlarla alış-veriş yapmamak üzere Kureyşle yaptığı anlaşmadır. (Bu hadisin râvilerinden) Zührî dedi ki (Beni Kinâne) Hayf (ından maksat) Muhassab denilen vadidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "Abdullah b. Amr'dan demiştir ki: Rasûlullah (s.a.v.) \"İki (ayrı) dinin mensupları birbirlerine mirasçı olamazlar. buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "Abdullah b. Büreyde'den demiştir ki: (Birisi) Yahudi ve (diğeri de) Müslüman (olan) iki kardeş (ölen babaları için) Yahya b. Yamer'e başvurdular (Yahya'da).onlardan muslümanı mirasçı kıldı. (Diğerini de mirastan mahrum etti ve bu verdiği hükme delil olmak üzere şöyle) dedi: “Ebû Esved'in bana haber verdiğine göre; bir adam ona (şöyle) demiş -Muaz b. Cebel dedi ki: -Ben Rasûlullah (s.a.v.)'i \"İslam artar eksilmez\" derken işittim. (Muaz bu sözü söyledikten) hemen sonra müslümanı varis kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "Ebû'l Esved ed-Dîlî'den demiştir ki; Muaz (b. Cebel)'a, kendisine (bir yahudi ile) bir müslümanın varis olduğu bir yahudinin mirası getirilmiş. (Hz. Muaz da) Peygamber (s.a.v.)'den (rivayet edilen bir önceki 2912. hadisin) manasına (sarılarak o müslümanı bu mirasa varis kılmış)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "İbn Abbas'dan demiştir ki: Nebi (s.a.v.) (şöyle) buyurdu: \"Cahiliyye döneminden önce paylaştırılan her miras, paylaştırılmış olduğu şekilde (geçerli)dir. İslamiyetin yetişmiş olduğu bir miras İslam taksimi üzere (taksime tabii)dir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "İbn Ömer'den (r.a)- (rivayet olunduğuna göre) Mü'minlerin annesi Aişe (r.anha) hürriyetine kavuşturmak için bir câriye satın almak istemiş de (cariyenin) sahihleri \"Biz Onu sana ancak velâsı bize ait olmak üzere satarız\" demişler. Hz. Aişe bunu Rasülullah (s.a.v.)'e anlatmış. Hz. Peygamber de \" Bu sana mâni değildir. Çünkü velâsı âzad edene aittir.\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "Hz. Aişe'den demiştir ki: Rasûlullah (s.a.v.) (şöyle) buyurdu: \"Velâ (köley'i hürriyetine kavuşturmak için gereken) fiyatı veren ve (hürriyete kavuşturmak) nimet(in)e sahip olan kimseye aittir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "Amr b. Şuayb'ın dedesinden (rivayet olunduğuna göre) Riâb b. Huzeyfe bir kadınla evlenmiş de kadın ondan üç erkek çocuk dünyaya getirmiş, sonra çocukların annesi ölmüş. Çocuklar da annelerinin ve hürriyetine kavuşturduğu kölelerinin velâ hakkına vâris oldular. Amr b. As da (bu kadının) oğullarının asabesi idi. Onları Şam'a götürdü (çocuklar orada) öldüler. Bunun üzerine Amr b. As geri geldi ve (o sırada) kadının hürriyetine kavuşturduğu bir kölesi (geriye) bir miktar mal bırakarak öldü. (Amr b. As da hem çocukların hem de bu köle'nin mallarına vâris olarak el koydu) Bunun üzerine (ölen kadının hayatta bulunan erkek kardeşleri) Amr'ı Ömer b. el-Hattab'a şikayet ettiler. Ömer de -RasÛlullah sallallahu aleyhivesellem: \"Çocuğun yahutta babanın kazandığı mal onun (hayatta) olan asabesinindir.\" buyurdu.- dedi. (Ve Amr b. As lehine hüküm verdi). Bu hadisi rivayet eden Abdullah b. Amr rivayetine devamla dedi ki: (Ömer b. Hattâb) Amr b. As'a (hitaben bu meseleyle ilgili olarak): içinde Abdurrahman b. Avf ile Zeyd b. Sabit'in ve diğer bir adamın şahitliği bulunan bir de mektub yazdı. Nihayet Abdülmelik halifelik makamına getirilince (Hz. Ömer'in hükmüne uyulmadığı için ölen kadının erkek kardeşleri) Hişam b. İsrfıail'e -yahutta İsmail b. Hişam'a-şikâyette bulundular. (Hişam b. İsmail de) onlar(ın davasını) Abdülmelik'e havale etti. (Abdülmelik, Hz. Ömer'in mektubunu ve bu meseledeki hükmünü okuyunca: (Hz. Ömer'in verdiği) bu hüküm, benim de uygun gördüğüm paylaştığım hükümdür, dedi. Ömer b. Hattâb'ın mektubuna göre o da lehimize hüküm verdi. \"Biz şu ana kadar bu hükme göre amel edegeldik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "Hisam (b. Ammar) ile Yezid (b. Halid)'in haber verdiklerine göre; (Temim-ed-Dâri, Fahr-i kainat efendimiz'e); \"Ey Allah'ın Rasûlü, müslüman bir kimsenin telkiniyle onun huzurunda müslüman olan bir kişi hakkında şer'î hüküm nedir?\" diye sormuş. (Nebi s.a.v.): \"O (müslüman, müslümanlığına vesile olduğu kişiyi) sağlığında ve ölümünde insanların en yakın olanıdır.\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "İbn Ömer (r.a.) demiştir ki: \"Rasûlullah (s.a.v.) velâ (hakkı)nın satılmasını ve bağışlanmasını yasakladı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "Ebû Hureyre'den demiştir ki; Nebi (s.a.v.) (şöyle) buyurmuştur: \"Yeni doğan bir çocuk (işitecek kadar yüksek) bir ses çıkaracak olursa vâris kılınır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "İbn Abbas'dan demiştir kir \"Yeminlerinizin bağladığı kimselere hisselerini verin..[Nisâ 33] (âyet-i kerimesi inince müslümanlardan) birisi diğeri ile anlaşıyor ve aralarında bir kan bağı olmadığı halde (anlaşma sebebiyle bu iki kişi'den) biri ötekine varis oluyordu. Sonra Enfâl (âyeti) bunu yürürlükten kaldırdo. Yüce Allah (Enfâl âyetinde şöyle) buyurdu: \"Rahim sahihleri (hısımlar) Allah'ın kitabına göre birbirlerine (varis olmağa) daha yakındırlar.[Enfal 75]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "İbn Abbâs'dan \"Yeminlerinizin bağladığı kimselere hisselerini veriniz\"[Nisa 33] âyeti hakkında (şöyle) dediği (rivayet olunmuştur): \"Muhacirler Medine'ye geldikleri zaman Rasûlullah (s.a.v.)'in ensarla muhacirler arasında kurmuş olduğu kardeşlikten dolayı (muhacirler) ensara (bir ensarlının) akrabasından önce (mirasçı kılınırlardı). (Bu âyet bu tatbikatla ilgiliydi. Bir süre sonra) \"Ana babanın ve akraba'nın bıraktıklarından her birine varisler kıldık...[Nisa 33] (mealindeki âyet-i kerime) inince bu âyet öbür âyeti neshetti. Binaenaleyh) \"yeminlerinizin bağladığı kimselere hisselerinizi veriniz\"[Nisa 33] (âyet-i kerimesinde yeminlerin bağladığı kimselere verilmesi emredilen hisseden maksat) yardım, nasihat ve onlara yapılacak vasiyettir. (îşte bu şekil­de muhacirlerin ensarın malı üzerindeki) miras (hakları) yürürlükten kalktı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "Davûd b. el-Husayn'dan demiştir ki: Ben Ümmü Sa'd bnt er-Rabi'a (kur'an) okuyordum. (Ümmü Sa'd) Ebû Bekir'in himayesinde kalmış yetim bir kız idi. (ben kendisine) \"yeminlerinizin bağladığı kimselere hisselerini verin...[Nisa 33], (âyetini) okuyunca - (bu âyeti) ........ (şeklinde) okuma (da şeklinde oku).Çünkü bu âyet Ebû Bekir'le İslamı kabul etmeyen oğlu Abdurrahman hakkında inmişti, (oğlunun müslümanhğı reddettiğini gören) Hz. Ebû Bekir de onu varis kılmayacağına yemin etmişti. (Abdurrahman) müslüman olunca yüce Allah, onun hissesini vermesini Peygamberine emretti. (Râvi) Abdülaziz (bu rivayete şunu da) ilave etti: (Abdurrahman) kılıçla İslama zorlanıncaya kadar müslümanhğa girmedi. Ebû Dâvud der ki (bu âyeti) ..... (şeklinde) okuyan bir kimse bu akdi (tek taraflı) bir yemin kılmış olur. ........ (şeklinde) okuyan da bu akdi karşılıklı yemin kılmış olur..' Doğrusu ise Talha'nın rivayeti (olan) (şeklindeki kıraat)tir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "İbn Abbâs (r.a.)'den demiştir ki: “Onlar ki inandılar ve hicret ettiler...[Enfâl 72] (âyet-i kerimesi inince (Hicret etmemiş olan müslüman) bir arab (yakınlarından olan) bir muhacire mirasçı olamadığı gibi bir muhacirde ona mirasçı olamazdı. \"... Rahim sahihleri (akraba olanlar) biribirlerine (mirasçı olmağa) daha uygundurlar...\"[Enfâl 75] (âyet-i kerimesi) bu âyeti neshetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "Cübeyr b. Müt'im'den demiştir ki: Rasûlullah (s.a.v.) (şöyle) buyurdu: İslâmiyet'te (kötülükte yardımlaşmak üzere) antlaşma yoktur. Cahiliye döneminde (hayırlı işlerde yardımlaşmak üzere yapılmış olan) antlaşmaları ise İslamiyet sadece kuvvetlendirir..\" Ayrıca bu hadis'i Buhârî, kefale, edeb; Müslim, fedailüssahabe6; Tirmizî siyer; Darimî, siyer; Ahmed b. Hanbel 1-190, 317, 329,11-180, 205, 207, 213, 215, III-162, 281, IV-V-61. de tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "Asım el-Ahvel'den demiştir ki: Ben Enes b. Malik'i Rasûlullah (s.a.v.) bizim evlerimizde muhacirlerle ensar arasında (kardeşlik) antlaşması yaptı\" derken işittim. (Enes bunu söyleyince) kendisine: Rasûlullah (s.a.v.) \"İslamda antlaşma yoktur\" buyurmamış mıydı?- denildi (Oda) iki yahut da üç defa \"Rasûlullah (s.a.v.) bizim evlerimiz de muhacirlerle ensar arasında (kardeşlik) antlaşma(sı),yaptı.\" cevabını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2927,
			"arabicnumber": 2927,
			"text": "Said (b. Müseyyeb (r.a.))'den demiştir ki: Ömer b. Hattab \"diyet akilenindir, kadın kocasının diyetine varis olamaz\" derdi. Nihayet kendisine ed-Dahhak b. Sufyân: \"Eşyem ed-Dibâbî'nin hanımına kocasının diyetinden miras payı vermem için Rasûlullah (s.a.v.) bana mektup yazmıştı.\" dedi de. Hz. Ömer bu görüşünden döndü. Ahmed b. Salih dediki bize bu hadisi Abdurrezzâk Ma'mer'den, O da Zührî'den, O da Said'den rivayet etti ve bu rivayetinde şöyle dedi: (Hz. Peygamber Dahhak b. Süfyan'ı Arablara zekat tahsildarı olarak görevlendirmişti)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 43
			}
		}
	]
}