{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2928,
			"arabicnumber": 2928,
			"text": "Abdullah b. Ömer'den demiştir ki: Rasûlullah (S.A.V.) (şöyle) buyurmuştur. \"Dikkatli olunuz hepiniz çobansınız ve hepiniz idareniz altındakilerden sorumludur. Halkın başında bulunan yönetici bir çobandır ve emri allındakilerden sorumludur. Erkek ev halkı üzerinde bir çobandır ve eli altındakilerden sorumludur. Kadın kocasının evi ve çocuğu üzerinde bir çobandır ve bunlardan sorumludur. Köle efendisinin malı üzerinde bir çobandır ve o maldan sorumludur. Hepiniz çobansınız. Hepiniz idaresi altındakilerden sorumlusunuz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2929,
			"arabicnumber": 2929,
			"text": "Abdurrahman b. Semûre'den demiştir ki: Rasûlullah (S.A.V.) bana (şöyle) buyurdu: \"Ey Semûre'nin oğlu Abdurrahman, yöneticilik isteme, çünkü bu istemeden dolayı sana yöneticilik verilirse onunla başbaşa bırakılırsın. Eğer yöneticilik sana istemeden verilecek olursa bu işte (Allah tarafından) sana yardım edilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2930,
			"arabicnumber": 2930,
			"text": "Ebû Musa (el Eş’ari)'den demiştir ki: İki kişiyle birlikte Peygamber (S.A.V.)'e gitmiştim. Onlardan biri söz aldı ve (Ey Allah'ın Rasulü) Senin işinde (görev alabilmemiz hususunda) bize yardımcı olmanız için (buraya) geldik\" dedi. Diğeri arkadaşının (bu) sözünün aynısını söyledi. Rasûlullah (S.A.V.) de: \"Sizin en haininiz (devlet dairesinden) iş isteyendir.\" buyurdu. Bunun üzerine Ebû Musa Peygamber (S.A.V.)'den özür dileyerek: Ben onların niçin geldiklerini bilmiyordum, dedi ve döndü gitti de bir daha onlara hiçbir iş(lerin)de yardımcı olmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2931,
			"arabicnumber": 2931,
			"text": "Enes'den demiştir ki: Nebi (S.A.V.) İbn Ümmü Mektum'u (a'ma olduğu halde) iki defa Medine'de yerine vekil bırakmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2932,
			"arabicnumber": 2932,
			"text": "Hz. Aişe'den demiştir ki: Rasûlullah (S.A.V.) (şöyle) buyurdu. \"Allah bir devlet başkanı hakkında hayır dilediği zaman o'na doğru (konuşan ve doğru iş yapan)) bir yardımcı verir. Eğer o (başkan yapılması gereken bir işi) unutursa (bu yardımcı, unutulan işi) ona hatırlatır. Eğer başkan bu işi kendisi hatırlarsa (o zaman da bu yardımcı o işin yapılması hususunda) başkana yardımcı olur. Eğer Allah onun hakkında başka birşey dilemişse ona kötü (huylu) bir yardımcı verir. Eğer (yapılması gereken bir işi) unutursa (vezir bu işi) ona hatırlatmaz. Eğer (başkan bu işi kendiliğinden) hatırlarsa (o zaman da bu yardımcı o işin yapılmasında) ona yardımcı olmaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2933,
			"arabicnumber": 2933,
			"text": "el-Mikdâm b. Madîkerib'den demiştir ki: Rasûlullah (S.A.V.) onun omuzlarına dokunarak: \"Ey Mikdamcığım ne mutlu sana eğer ölürsen (halkın başında) bir idareci de değilsin, (bir idarecinin) kâtib(i) de değilsin, haklarında bilgi toplayıp halifeye sunmak üzere halk arasında görevli bir kimse de değilsin.” buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "(bir adamın) dedesinden (rivayet olunduğuna göre aileleri) \"Yol üzerinde bulunan sulardan bir su üzerine (görevli) bulunuyorlarmış. İslam(ın doğuşu) onlar(ın kabilesin)e ulaşınca (sözü geçen adam'ın dedesi ve) suyun sahibi olan zat İslamiyeti kabul etmeleri şartıyla kavmine yüz deve va'detti. Onlar da (bu şartla) müslümanlığı kabul ettiler. (Suyun sahibi de) develeri onlara bölüştürdü. (Ancak kısa bir süre sonra) develeri onlardan geri alması (zarureti) ortaya çıktı. Bunun üzerine oğlunu Peygamber (S.A.V.)'e göndererek ona: Peygamber (S.A.V.)'e var da ona \"Babam sana selam söylüyor kendisi kavmine müslüman olmalaıî şartıyla yüz deve vâdetmişti. Onlar da müslüman oldular. Bunun üzerine babam (bu) develeri onlardan geri alması (durumu) ortaya çıktı. Develere (sahib olmakta) babam mı daha haklı, yoksa onlar mı? (daha haklı) de. Eğer sana \"evet\" (baban daha haklıdır) yahutta \"hayır\" (onlar babandan) daha haklı (dırlar) cevabını verecek olursa (o zaman) kendisine \"Babam yaşlı bir adamdır. Aynı zamanda suyun idaresiyle de görevlidir. Kendi (ölümü)nden sonra su idareciliği görevini bana vermeni istiyor\" de. dedi. Bunun üzerine (o adam'ın oğlu) Hz. Peygamber'e varıp: “Babam sana selam söylüyor\" dedi (Hz. Peygamber de): (Allah'ın) \"selamı senin ve babanın üzerine olsun\" dedi sonra; \"Babam müslümanlığı kabul etmeleri şartıyla kavmine yüz deve bağışlamayı vâ'd etmişti. Onlar müslüman oldular. Müslümanlıkları da (çok) güzel oldu. (Fakat bir süre) sonra develeri onlardan geri alması (lüzumu) ortaya çıktı. Şimdi bu develere babam mı daha müstehak, yoksa onlar mı? dedi. (Hz. Peygamber de): \"Eğer baban'ın develeri onlara teslim etmesi (kendisine daha uygun) görünüyorsa, develeri onlara teslim etsin. Eğer kendisine develeri geri almak (daha uygun) görünüyorsa (şunu iyi bilsin ki) kendisi bu develere onlardan daha müstehaktır. Eğer onlar îslam'ı kabullenmişlerse, müslümanlıkları kendilerinindir. Eğer müslümanlığı kabul etmemişlerse müslümanlığı kabul edinceye kadar kendileriyle savaşılır*' buyurdu (bu defa çocuk): Babam yaşlı bir adamdır. Aynı zamanda suyun idaresi ile de görevlidir. Kendi (ölümü)nden sonra su idareciliği görevini bana vermeni istiyor.\" dedi. (Nebi efendimiz de): \"İdarecilik görevi hakdır. Elbette halk için bu görevi üstlenen kimselere ihtiyaç vardır. Fakat bu görevi yüklenenler (mesuliyeti! bir görevi yüklendikleri için) cehennemlik (olma tehlikesiyle karşı karşıya)dırlar.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2935,
			"arabicnumber": 2935,
			"text": "İbn Abbâs'dan demiştir ki: es-Sicillü (diye anılan sahabî) Nebi (Sallallahu aleyhi ve Sellem)'ın katibi idi. Diğer tahric: Nesai s-kübra (11272)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2936,
			"arabicnumber": 2936,
			"text": "Râfi' b. Hadic'den demiştir ki: Ben Rasûlullah (S.A.V.)'i (şöyle) buyururken işittim: \"Hakkıyla (görev yapan) zekât memuru evine dönünceye kadar, Allah yolunda (savaşan) gazi gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2937,
			"arabicnumber": 2937,
			"text": "Ukbe b. Amir'den demiştir ki; Rasûlullah (S.A.V.)'ı (şöyle) buyururken işittim: \"Meks (denilen haksız vergiyi) alan bir kimse cennete giremez",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2938,
			"arabicnumber": 2938,
			"text": "İbn ishak'dan demiştir ki: (Bir önceki 2937. hadisi şerifte geçen) \"Meks\" alan kimse (sözün)den maksat halktan (mallarının onda birini) toplayan kimsedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2939,
			"arabicnumber": 2939,
			"text": "İbn Ömer'den demiştir ki: (Babam) Ömer (r.a) dedi ki: \"Eğer ben yerime birini halife tayin etmezsem (bu sünnete uygun bîr hareket olur.) Çünkü Rasûlullah (S.A.V.) yerine bir halife tayin etmemiştir. Eğer, yerime bir halife tayin edersem (bu da caizdir.) Çünkü Ebû Bekir (r.a.) yerine bir halife tayin etmiştir. (İbn Ömer, rivayetine devam ederek) dedi ki: Allah'a yemin olsun ki (Hz. Ömer'in bu mevzuda tutmuş olduğu yol) Rasûlullah (s.a.v.)'Ie, Hz. Ebu Bekir'in (uygulamalarını) hatırlama­sından (ve onlara uymasından) başka bir şey değildir. (Babamın Rasûlü Ekrem'in bu mevzudaki tatbikatını göz önüne getirdiğini görünce) Onun kimseyi Rasûlullah (S.A.V.)'e denk tutmadığını ve yerine kimseyi tayin etmeyeceğini kesinlikle anladım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2940,
			"arabicnumber": 2940,
			"text": "İbn Ömer'den demiştir ki: Biz, Rasûlullah (S.A.V.)'e (emirlerini) dinlemek ve itaat etmek üzere söz verirdik (de, Rasûl-ü Ekrem efendimiz) bize “Gücünün yettiği şeylere (söz ver)\" diye telkinde bulunurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2941,
			"arabicnumber": 2941,
			"text": "Urve (r.a.)'den demiştir ki: Hz. Aişe, Rasûlullah'ın kadınlarla biatleşmesını şöyle anlatmıştır: Rasûlullah (S.A.V.) (biatleşirken) hiçbir kadın'ın eline dokunmadı. Ancak herbir kadın'dan (biati sözle) aldı. Bir kadın'dan (sözü) aldı da kadın da (söz) verdi mi “Git! senin biatini aldım\" buyururdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2942,
			"arabicnumber": 2942,
			"text": "Nebi (S.A.V.)'e yetişen Abdullah ibn Hişâm'dan (rivayet olunduğuna göre) annesi Zeyneb bint Humeyd, onu Rasûlullah (S.A.V.)'e götürüp \"Ey Allah'ın Rasûlü bununla biatleş\" demiş, Rasûlullah (S.A.V.) de \"- O (daha) küçüktür/' demiş ve onun başını okşamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2943,
			"arabicnumber": 2943,
			"text": "Bûreyde'den demiştir ki: Nebi (s.a.v.) (şöyle) buyurmuştur. \"Biz kimi (devlet) iş(in)de çalıştırırda kendisine maaş verirsek, onun bu maaştan fazla (olarak devlet hazinesinden) aldığı şey (devlete) hıyanettir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2944,
			"arabicnumber": 2944,
			"text": "İbn Saîdi'den demiştir ki: Ömer (b. Hattab) beni zekat memuru tayin etmişti. Ben bu görevi yerine getirince, bana ücret (ve­rilmesini) emretti. Ben de \"Ben sadece Allah (rızası) için çalıştım\" dedim. (Bunun üzerine Hz. Ömer) “Sana verileni al. Çünkü ben Rasûlullah (S.A.V.) zamanında görevli olarak çalışmıştım da (Allah'ın Rasûlü bu hizmetim karşılığında) bana ücret vermişti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2945,
			"arabicnumber": 2945,
			"text": "el-Müstevrid b. Şeddâd'dan demiştir ki: Ben Nebi (s.a.v.)'i (şöyle) buyururken işittim. “Kim bizim emrimizde görevli ise (hanımı yoksa) evlensin, hizmetçisi yoksa, bir hizmetçi tutsun, evi yoksa ev alsın. (Musa b. Mervan) dedi ki: Ebû Bekir (Yahya b. İshâk şöyle) dedi: Bana haber verildiği(ne göre) Peygamber (s.a.v.)'i \"Kim bundan başka bir servet edinirse, O kimse haindir\" -yahut ta hırsızdır- derken işittim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2946,
			"arabicnumber": 2946,
			"text": "Ebû Humeyd-es-Saîdi'den demiştir ki: Nebi (S.A.V.) Ezd kabilesinden îbn Lütbiyye adında bir adamı zekat memuru olarak tayin etmiş -ki Îbn'üs-Serh (bu zat'ın isminin) Îbnü'l-Ütebiyye olduğunu söylemiştir- Bir süre sonra (adam zekat toplama işini bitirip) gelmiş ve... \"Şu (mallar) sizindir. Şu(nlar da) bana hediye edildi.\" demiş. Bunun üzerine Nebi (S.A.V.) minbere çıkıp Allah'a hamd-ü sena ettikten sonra (şöyle) buyurmuş: \"Benim görevlendirdiğim bir memur'a ne oluyor da -Bu sizin bu da bana hediye edildi- diyor. Annesinin yahutta babasının evinde olsaydı da (bir) baksaydı, kendisine bir hediye verilirmiydi, yoksa verilmezmiydi? Sizden zekat mallarından (haksız yere) bir şey alan kıyamet gününde, o malı da (omuzunda) getirir. Eğer o mal deve ise onun feryadı, inekse böğürmesi koyunsa acı bir melemesi vardır.\" Sonra ellerini kaldırdı. Hatta biz koltuklarının altını gördük. Sonra \"Allah'ım tebliğ ettim mi? Allah'ım tebliğ ettim mi?\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2947,
			"arabicnumber": 2947,
			"text": "Ebû Mes'ûd el-Ensârî'den demiştir ki: \"Nebi (S.A.V.) (bir gün) beni (zekat) tahsildar(ı) olarak görevlendirdi ve \"Ey Ebû Mes'ûd! (Bu görev'e) git. (Fakat dikkat et, sakın) seni kıyamet gününde omuzunun üzerinde, çalmış olduğun (ve korkunç) böğürtüsü olan zekat devesiyle gelir bir halde bulmayayım.\" buyurdu. (Ebû Mes'ûd sözlerine devam ederek şöyle) dedi. (Bunun üzerine ben de; Ey Allah'ın Rasûlü) \"Öyleyse ben (bu göreve) git(mek iste)miyorum\" dedim. (Hz. Nebi de) “Öyleyse ben de seni zorlamıyorum\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2948,
			"arabicnumber": 2948,
			"text": "Ebû Meryem el-Ezdî dedi ki: Ben (birgün) Hz. Muaviye'nin yanına girmiştim. <Bana) \"Ey falan'ın babası seni (buraya) getiren nedir?\" dedi. Bu kelimeyi araplar (bir kimsenin gelmesiyle çok sevindikleri zaman) söylerler. Ben de (Rasûlullah (S.A.V.)'den) \"Bir hadis duymuştum da sana o'nu haber vereceğim.\" dedim. Rasûlullah (S.A.V.)'i (şöyle) \"buyururken işit(miş)tim. \"Aziz ve Celil olan Allah, müslümanlann idaresini bir kimsenin eline verir de, O kimse müslümanların ihtiyaçlarını sıkıntılarını ve zaruretlerini dinlemekten geri durursa, Allah da onun ihtiyacını, sıkıntısını ve zaruretini dinlemekten geri durur.\" (Hz. Muaviye bundan bu hadisi duyduktan sonra) halkın ihtiyaçlarını dinleyip tesbit etmek) üzere bir adam görevlendirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2949,
			"arabicnumber": 2949,
			"text": "Hemmân b. Münebbih'den demiştir ki: Ebû Hureyre, Rasûlullah (S.A.V.)'in (şöyle) buyurduğunu söylemiştir: \"Ben size bir şeyi ne verebilirim ne de onu size vermeyebilirim. Ben (sadece) bir bekçiyim, emr olunduğum şekilde hareket ederim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2950,
			"arabicnumber": 2950,
			"text": "Malik b. Evs. b. el-Hedesan'dan demiştir ki: Ömer b. Hattâb bir gün (düşmandan harpsiz olarak alınan) ganimet(ler)den bahsederek dedi ki: \"Ben şu ganimet'e hiç birinizden daha müstehak değilim. Biz'den hiçbir kimse de buna diğer bir kimseden daha müstehak değildir. Ancak bizim (bu ganimetleri alma hususunda) Aziz ve Celil olan Allah'ın Kitabı ve Rasûlünün taksimince (belirlenmiş olan) bir yerimiz vardır. (Buna göre) kişi(ye ganimetten pay verilirken İslâmiyetteki) kıdemi, savaşlarda gösterdiği kahramanlıkları ve ihtiyacı (gözönünde bulundurulur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2951,
			"arabicnumber": 2951,
			"text": "Zeyd b. Eslem'den demiştir ki: Abdullah b. Ömer (birgün) Hz. Muaviye'nin yanına girmişti. (Hz. Muaviye O'na) \"Ey Abdurrahman'ın babası, ihtiyacın (nedir anlat?) demiş, (İbn Ömer de harpsiz olarak ele geçen mallardan) hürriyetlerine yeni kavuşan kölelere (verilmesi gereken) bağışlar için geldim. Çünkü ben RasûluUah'ın kendine gelen mallar(ın dağıtımın)da, önce hürriyetine (yeni) kavuşmuş olan kölelerden başladığını gördüm\" cevabını vermiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2952,
			"arabicnumber": 2952,
			"text": "Aişe (r.a.)'dan demiştir ki: Nebi (S.A.V.)'e içinde (kıymetli) boncuklar bulunan küçük bir torba getirilmiş de onu hür kadınlarla cariyeler arasında paylaştırmış. (Hz. Aişe dedi ki: \"Babam (Ebû Bekir) (bu gibi hediyeleri) hür erkekler ile erkek köleler arasında bölüştürürdü",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2953,
			"arabicnumber": 2953,
			"text": "Avf b. Malik'den demiştir ki: \"Rasûlullah (S.A.V.)'e savaşsız olarak ele geçen bir ganimet geldiği zaman o'nu geldiği gün taksim eder, evlilere iki, bekarlara bir pay verirmiş\" (Ravi) Îbnü'l-Musaffâ (bu rivayete şu cümleleri de) ilave etti. -(Avf b. Mâlik dedi ki) \"Biz (yine birgün savaşsız olarak ele geçen ganimetlerden hissemizi almak üzere) çağrıldık. Ben Ammâr'dan önce çağrıldım. (Hz. Nebi) bana iki hisse verdi. (Çünkü) ben evliydim. Benden sonra Ammâr b. Yâsir çağırıldı. Ona bir hisse verildi\" (çünkü o evli değildi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2954,
			"arabicnumber": 2954,
			"text": "Câbir b. Abdillah (r.a.)'den: Rasûlullah (S.A.V.) (şöyle) buyurdu: \"Ben müslümanlara kendilerinden daha yakınım (Binâenaleyh) \"Kim (arkasında) bir mal bırakırsa (o mal) mirasçılarınındır. Kim de (arkasında) bir borç ya da (küçük) çocuk bırakırsa (o çocuğa bakmak) bana aittir ve (o borç ta) benim üzerimedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2955,
			"arabicnumber": 2955,
			"text": "Ebû Hureyre'den demiştir ki: Rasûlullah (S.A.V.) şöyle buyurdu: \"Kim (ölür de geriye bir) mal bırakırsa, o varislerinindir. Kim de geriye borç ve bakıma muhtaç çocuk bırakırsa o bizedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2956,
			"arabicnumber": 2956,
			"text": "Cabir b. Abdillah’dan demiştir ki Nebi (S.A.V.) (şöyle) buyururmuş: “Ben bir müslüman'a kendisinden daha yakınım. (müslüman) bir kişi (arkasında) borç bırakarak ölürse (onu ödemek ) bana (düşer.Müslümanlardan) bir kimse (arkasında) mal bırakacak olursa (o mal da onun) mirasçılarına aittir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2957,
			"arabicnumber": 2957,
			"text": "İbn Ömer'den demiştir ki; Kendisi Uhut savaşı günü Peygamber (S.A.V.)'e gösterilmiş ve (o gün) kendisi ondört yaşında imiş. (Râsûl-i Ekrem) onu (harbe) kabul etmemiş. Hendek savaşı günü de gösterilmiş (o gün ise) on beş yaşındaymış ve (Rasûl-ü Ekrem) onu (harbe) kabul etmiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2958,
			"arabicnumber": 2958,
			"text": "Vadi'l-kurâ halkından Süleym b. Mutayr (isimli) bir ihtiyar, dedi ki: Babam Mutayr (in) bana haber verdi(ğine göre) Kendisi (bir gün) hacca (gitmek üzere yol'a) çıkmış ve Süveydo'da ilaç ve huzâz aramak için gelmişe benzeyen bir adamla karşılaşıvermiş ve (o adam şöyle) demiş: Veda haccında Rasûlullah (S.A.V.)'i halk'a vaaz edip onları (iyiliğe) çağırıp (kötülükten) sakındırırken işiten bir adam dedi ki: Rasûlullah (S.A.V.) (şöyle) buyurdu. \"Ey insanlar! bağışı, bağış olduğu müddetçe alınız. (Fakat) \"Kureyş saltanatı ele geçirme yarışına girişip te bağış (size) dininiz karşılığında (verilir bir hale gelince) onu (almayı) bırakınız. Ebû Dâvud der ki: Bu hadisi ibni Mübarek Muhammed b. Ysar'dan (o da) Süleym b. Mutayr'den rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2959,
			"arabicnumber": 2959,
			"text": "Vadi'l-kura halkından olan Süleym b. Mutayr'dan (rivayet olunduğuna göre) babası O'na (şöyle) demiştir: Ben Rasûlullah (S.A.V.)'i veda hutbesinde dinledim. Halkı (iyiliğe) çağırıp (kötülükten) sakındırdı. Sonra da: \"Ey Allah'ım tebliğ ettim mi?\" dedi. (orada bulunan sahabiler) \"Evet Allah için\" (tebliğ ettin) karşılığını verdiler. Sonra (Peygamber efendimiz tekrar): \"Ey Allah'ım tebliğ ettim mi?\" dedi (onlar da tekrar) \"Allah için evet\" dediler. Sonra (Nebi efendimiz): \"- Kureyş kendi aralarında saltanatı ele geçirme yarışına girdikleri ve bağış da rüşvete dönüştüğü zaman onu (almayı) bırakınız\". (Bu hadisi nakleden zat hakkında) \"bu (zat) kimdir?\" diye (bilenlere) sorulduğunda (onlar) \"Bu (zât) Rasûlullah (s.a.v.)'in arkadaşı Zü'z-Zevâid'dir. Cevabını verdiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2960,
			"arabicnumber": 2960,
			"text": "Abdullah b. Ka'b b. Malik el-Ensari'den (rivayet olun­duğuna göre, Hz. Ömer'in halifeliği sırasında); Ensardan (oluşan) bir askeri birlik kumandanlarıyla birlikte iran topraklarında (bulunuyordu. Aslında) Hz. Ömer (düşman sınırında bulunan askerlerden nöbeti teslim almaları için) her sene arkadan -bir ordu gönderdiği halde o sene onlarla meşgul ol(maya fırsat bul)amamış (ve dolayısıyle arkalarından bir ordu gönderememiş)ti. (nöbet değişimi için) vakit (gelip) geçince bu sınırda bulunan askeri birlik dönüp geldi.- Bunun üzerine (Hz. Ömer) onlara sert bir şekilde çıkıştı ve onları tehdid etti. (Bu birliği teşkil eden) kimseler Rasûlullah (S.A.V.)'in sahabileri idiler. “Ey Ömer sen bize ilgisiz kaldın ve Rasûlullah (S.A.V.)'in bizim hakkımızdaki (sınırda bulunan) gazilerin arkasından (nöbet teslim almak üzere) başka bir askeri birlik gönderileceğine dair emrini terkettin\" dediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2961,
			"arabicnumber": 2961,
			"text": "İbn Adiyy b. Adiyy el-Kindî*(nin) haber venii(ğine) göre; Ömer b. Abdi'l-Aziz (memurlarına şu mealde bir) mektup yazmıştır. \"Her kim harpsiz olarak ele geçen ganimetlerin nereye sarf edildiğini soracak olursa (şunu iyi bilsin ki) bu ganimetlerin sarf yeri, Ömer b. el-Hattab'ın kararlaştırıp müslümanlann da Nebi (s.a.v.j'in -Allah hakkı Ömer (r.â.)'ın dili ve kalbi üzerine koymuştur- sözüne uyarak adalet'e uygun bulduğu yerlerdir. (Hz. Ömer savaşsız olarak ele geçen ganimetlerden müslümanlara) bağış verilmesine hükmetmiş, (yahudi, hıristiyan ve mecusi gibi) din sahiplerine de kendilerinden alınacak Cizye karşılığında eman verilmesini kararlaştırmış, (ve bu cizyeden Allah'a Rasûlüne, Hz. Nebi'ye yakınlığı bulunanlara, yetimlere, yoksullara, yolda kalan yolculara verilmek üzere ganimet mallarından alınan) beşte bir vergiyi almamış (geriye kalan dörtte birini de gaziler için) ganimet kılmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2962,
			"arabicnumber": 2962,
			"text": "Ebû Zer'den demiştir ki: Ben Rasûlullah-(S.A.V.)'i (şöyle) buyururken işittim: “Gerçekten Allah, hakkı Ömer'in dili üzerine koymuştur.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "Malik b. Evs. b. el-Hadesan'dan demiştir ki: Ömer (b. el-Hattab birgün) güneşin yükseldiği bir sırada bana (bir haber) gönderdi. Bunun Üzerine yanına vardım ve kendisini (mindersiz olarak) doğrudan doğruya bir karyolanın ağaç kısmı üzerine oturmuş halde buldum. Yanma girince bana; \"Ey Malik (senin) kavminden bir kaç aile koşarak geldi. Ben de onlara (ganimet mallarından) bir şeyler verilmesini emrettim, (bu atiyyeleri) onlara sen bölüştürüver\" dedi. Ben de: “Bunu sen başka birisine emretsen\" (daha iyi olurdu) dedim. O sırada (Hz. Ömer'in hizmetçisi) Yerfa' (çıkıp) geldi ve Ey mu'minler'in emiri Osman b. Afvân'la Abdurrahman b. Avf. Zübeyr b. el-Awam ve Sa'd b. Ebî Vakkas'ın yanınıza girmelerine izin verir misiniz? dedi. (Hz. Ömer de); \"Evet\" cevabını verdi, (ve yanına girmeleri için) onlara izin verdi (onlarda) girdiler. Sonra Yerfa' (tekrar) geldi ve; Ey Mu'minlerin emiri yanına Abbas ile Ali'nin girmelerine de izin verirmisin? dedi. (o da); . \"Evet\" dedi (ve yanına girmeleri için) onlara da izin verdi, (onlar da) girdiler. Biraz sonra Hz. Abbâs (söz aldı ve); \"Ey mu'minlerin emiri benimle şu Ali arasında bir hüküm ver\" dedi. Orada bulunanlardan biri de; \"Evet ey mu'minlerin emiri onlar arasında bir hüküm ver ve ikisine de merhametli ol\" dedi. Malik b. Evs (sözlerine devamla şöyle) dedi: Bana öyle geldi ki (Hz. Abbas'la Ali, Hz. Osman'la Hz. Abdurrahman, ez-Zübeyr ve Sa'd'den oluşan) bu Cemaati bir iş için (şefaatçi olmaları gayesiyle) önden göndermişlerdi. Hz. Ömer de acele etmeyin dedi. Sonra o topluluğa dönüp; \"Göğün ve yerin izniyle durduğu Allah aşkına size soruyorum Rasûlullah (S.A.V.)'in - Biz miras bırakmayız, bizim bıraktığımız sadakadır- buyurduğunu biliyor musunuz?\" dedi. (onlar da); \"Evet\" dediler. Sonra Hz. Ali ile Abbas'a dönüp \"Göğün ve yerin izniyle durduğu Allah aşkına (söyleyiniz) siz, Rasûlullah (S.A.V.)'in - Biz miras bırakmayız. Bizim (arkamızda) bıraktığımız (mal) sadakadır- buyurduğunu biliyor musunuz?\" dedi (onlar da); \"Evet\" cevabını verdiler. (Bunun üzerine Hz. Ömer şöyle) dedi. \"Şüphesiz ki Allah Rasûlünü hiç bir kimseye vermediği bir özellikle tahsis etti de (Kur'ân-ı Kerîm'inde şöyle) buyurdu: \"Allah'ın onlardan Nebiine verdiği ganimetlere gelince söz (onu elde etmek için) onun üzerine ne at ne de deve sürdünüz fakat Allah Nebilerini dilediği kimselerin üzerine salar (onlara üstün getirir) Allah her şey'e kadirdir.\"[Haşr 6] Allah Nadiroğullarını (mallarını) Rasûlüne fey olarak verdi. Allah'a yemin olsun ki: (Hz. Nebi) bu mallar(ın paylaştırılmasın)da (kendini) size (asla) tercih etmedi. Kendisi onları alıp ta size vermezlik te etmedi. Rasûlullah (S.A.V.) (Nadir-oğullarından fey olarak ele geçen) bu mallardan bir senelik nafaka -yahut nafakasını, yada ailesinin bir senelik nafakasını- alırdı. (Bu ifadedeki tereddüt raviye aittir.) Kalanı da (hazinedeki) mallar arasına koyardı. Sonra (Hz. Ömer) bu cemate yönelip: \"Göğün ve yerin izniyle durduğu Allah aşkına size soruyorum. Bunu biliyor musunuz?\" dedi. (Onlar da): \"Evet\" dediler. Sonra Hz. Abbas ile Ali (r.a.)'e yönelip: \"Göğün ve yerin kendi izniyle durduğu Allah aşkına size soruyorum bunu biliyor musunuz?\" dedi. (Onlar da): \"Evet\" cevabını verdiler, (sonra Hz. Ömer konuşmasına şöyle devam etti.) \"Rasûlullah (S.A.V.) vefat edince Ebû Bekir (r.a.): \"Ben Rasûlullah'm halifesiyim dedi. (Hz. Ömer konuşmasına şöyle devam etti.) Bunun üzerine sen (ey Abbas) şu (karşımda duran) Ali ile birlikte Ebû Bekir'e varıp kardeşinin oğlundan (yani Hz. Nebi'den hissene düşecek olan) mirasını istedin. Bu da karısı (Fatıma)'nın mirasını babası (Hz. Muhammed'in malı)ndan istiyordu. Hz. Ebû Bekir (r.a) de size (şöyle) cevap verdi: \"Rasûlullah (S.A.V.); \"Biz miras bırakmayız. Bizim bıraktığımız sadakadır.\" buyurdu. Allah bilir ya Ebû Bekir doğru sözlüdür. Allah'ın emirlerine hakkıyla uyucudur. Doğru yoldadır ve hakka tabidir. (Bu yüzden de) Hz. Nebi'den kalan bu mallar(ın idaresi) Ebû Bekr'e verildi. Ebû Bekir vefat edince de ben; \"Rasûlullah (S.A.V.)'in ve Ebû Bekir'in halifesi benim\" dedim ve Allah'ın mütevelli olmamı dilediği an'a kadar bu mallara mütevelli oldu. Derken sen ve şu (Ali) ikinizin de işi bir olduğu halde beraberce (karşıma) gelip benden bu malları istediniz. Ben de (size) eğer bu malları size vermemi istiyorsanız O malları Rasûlullah (S.A.V.)'in sarf ettiği yerlere sarf edeceğinize dair Allah'a söz vermeniz şartıyla (onları size verebilirim) dedim. Bu şartlar altında bu malı benden aldınız. Sonra aranızda bunun dışında bir hüküm vermem için (kalkıp tekrar) bana geldiniz. Allah'a yemin olsun ki: Kıyamet kopuncaya kadar aranızda bundan başka bir hüküm vermem, eğer bu şartlar(ı yerine getirmekken aciz kalırsanız. Onları bana geri veriniz. Ebû Dâvud der ki: (Hz. Abbas'la Hz. Ali, Hz. Ömer'den) O malları ikisi arasında yarıya bölmesini (ve idare ve tasarruf hakkının kendilerine verilmesini) istediler. Yoksa onlar Nebi (s.a.v.j'in \"biz miras bırakmayız* Bizim bıraktığımız sadakadır,\" dediğini bilmiyor değillerdi. Onlar doğru olandan başka bir şey istemiyorlardı. Nitekim Hz. Ömerde \"Ben bu mal'a taksim ismini koydurmam onu olduğu gibi bırakırım** (demek suretiyle bu duruma işaret etmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2964,
			"arabicnumber": 2964,
			"text": "Şu (bir önceki 2963. hadiste geçen) olay Malik b. Evs'den de (rivayet olundu) Dedi ki: \"Hz. Ali ile Abbas (r.a) Allah'ın Rasûlüne fey olarak ihsan etmiş olduğu Nadiroğullarının malları üzerinde mahkemelik olmuşlardı.\" Ebû Dâvud der ki; Hz. Ömer bu mallar üzerine taksim isminin konmamasını istedi (ve öyle yaptı). Bu hadisle ilgili açıklama bir önceki 2963. hadisin şerhinde geçmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2965,
			"arabicnumber": 2965,
			"text": "Hz. Ömer'den demiştir ki: Nadiroğulları'nın malları, müslümanların, üzerine at ve deve sürmeden Allah'ın Rasûlüne vermiş olduğu ganimetlerdendi ve (bu mallar) sırf Rasûlullah (S.A.V.)'e aitti. (Hz. Nebi bu malları) ev halkının geçimine sarfederdi. (Musannif Ebû Davud'un şeyhi) îbn Abde (bu cümleyi) \"ailesinin senelik rızkına sarf ederdi\" diye rivayet etmiştir. Geri kalanını da (harp için gerekli olan) atların temininde ve Allah yolunda (yapılacak savaş uğrunda) harcardı. îbn Abde (bu son cümleyi) \"At ve silah (temini) uğrunda (sarf ederdi)” diye rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2966,
			"arabicnumber": 2966,
			"text": "Zühri den, Ömer (r.a) şöyle demiştir: Allah (c.c): \"Allah'ın onların mallarından Nebiine verdiği ganimetler için, siz at ve deveye binip onlar'ı sürmüş değilsiniz...\" (Haşr, 6) buyurdu. Zühri: Hz. Ömer (r.a)'ın: \"Bu; Urayne köyleri, Fedek ve şurası şurası sırf Rasulullah'a aittir\" dediğim söyledi. (Âyeti kerimelerde şöyle buyurulur): \"Allah'ın fethedilen ülkeler halkının mallarından Nebisine verdiği ganimetler Allah, Peygamber, yakınları, yetimler yoksullar ve yolda kalmışlar içindir... (Haşr 7) \"Allah'ın verdiği bu ganimet malları yurtlarından ve mallarından çıkarılan... fakirler içindir\" (Haşr, 8) \"Daha önceden Medineyi yurt edinmiş ve kalblerine imanı yerleştirmiş olanlar...\" (Haşr, 9) \"Ve onların arkasından gelenler...\"(Haşr, 10) (Hz. Ömer daha sonra şöyle dedi): \"Bu âyet tüm insanları kapsadı. Müslümanlardan, ganimette hakkı -Eyyûb; nasibi dedi- olmayan, malik olduğunuz bazı kölelerden başka kimse kalmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2967,
			"arabicnumber": 2967,
			"text": "Mâlik b. Evs b. eI-Hadesan'dan demiştir ki: Hz. Ömer (r.a.) (fey gelirlerinin) Hz. Nebi'e ait bir gelir olup başkalarına verilemeyeceği' (hususundaki) görüşünü delillendirirken (şöyle) derdi. \"Rasûİullah (S.A.V.)'in üç safâyâsı vardı. Nadiroğulları(nın toprakları), Hayber (arazisinin bir kısmı) ve Fedek (arazisinin yarısı) Nadiroğulları(nın toprakları)na gelince (onlar) Hz. Nebi'in ihtiyaçları için (kendi elinde) tutulmakta idiler. Fedek'se (yolda kalmış) yolcular için tutulmakta idi. Hayber'e gelince, Rasûlullah (S.A.V.) o'nu ikisini müslümanlar arasında (harcamak) birini de kendi ailesinin geçimine (sarfetmek üzere) üçe bölmüştü. Ailesinin geçimin(e ayırdığı hisse)den artanı da muhacirlerin fakirlerine (verirdi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2968,
			"arabicnumber": 2968,
			"text": "Urve b. Zübeyr'den demiştir ki: Nebi (s. a.v.)'in hanımı Aişe, O'na (şöyle) demiştir: \"Rasûlullah (S.A.V.)'in kızı Fatıma, Ebû Bekir es-Sıddık (r.a.)'a bir haber göndererek ondan Allah'ın Medine'de ve Fedek'te Rasûlullah'a vermiş olduğu fey'den (payına düşecek olan) mirasını istedi de Ebû Bekir -şüphe yok ki Rasûlullah (S.A.V.): \"Biz miras bırakmayız. Bizim bıraktığımız sadakadır. Muhammed'in aile fertleri ancak şu maldan yiyebilirler.'* buyurdu. Allah'a yemin olsun ki, Ben Rasûlullah (S.A.V.)'in (arkada bıraktığı) sadakasından hiçbir şey'i kendi zamanındaki halinden (başka bir hale) değiştiremem. Binaenaleyh, bu mallar hakkında Rasûlullah ne yapmışsa ben de onu yapacağım, cevabını verdi. Ve Fatıma aleyhisselama bir şey vermekten kaçındı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2969,
			"arabicnumber": 2969,
			"text": "Zührî'den Urve b. Zübeyr şu (bir önceki 2968.) hadisi Peygamber (S.A.V.)'in hanımı Aişe'nin kendisine anlattığını söylemiş ve (Zührî rivayetine devamla şöyle) demiştir: Fatıma (r.a.), o zaman Rasûlullah (S.A.V.)'in (arkasında bırakmış olduğu) Medine ve Fedek'teki sadakası ile Hayber'in beşte birinden kalan (mallar)ı istemiş. Hz. Aişe (sözlerine devam ederek şöyle) demiş - Ebü Bekir de ona -Rasûlullah (S.A.V.): \"Biz miras bırakmayız. Bizim bıraktığımız sadakadır. Muhammed'in ailesi ancak şu maldan yani Allah'ın (onlara fey olarak verdiği) malından yerler onların yiyecek (ve giyecek giderlerini daha fazla artırmaya hakları yoktur buyurdu” cevabını verdi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2970,
			"arabicnumber": 2970,
			"text": "İbn Şihab'dan elemiştir ki: Urve şu (bir önceki2969.) hadisi Hz. Aişe'nin kendisine haber verdiğini söylemiş. (Urve) bu rivayetinde (şöyle) demiştir: \"Ebû Bekir, Fatıma'nın bu teklifini kabul etmedi ve; \"Ben Rasûlullah (S.A.V.)'in yapmış olduğu bir uygulamayı terkedecek değilim. Onu mutlaka yerine getireceğim, onun bu (mevzuda) yapmış olduğu bir işi terk ettiğim takdirde doğru yoldan sapacağımdan korkarım.\" dedi. (Hz. Nebi'nin) Medine'deki sadakasına gelince onu Hz. Ömer, Hz . Ali ile Abbâs'a verdi. Sonra Hz. Ali Onu Abbas'ın elinden aldı. Hayber (toprakları) ile Fedek (arazisin)e gelince; Hz. Ömer \"Bunlar Rasûlullah (S.A.V.)'in karşılayacağı önemli ihtiyaçlarına sarf edilecek sadaka(Iar)dır.\" diyerek onu elinde tuttu. \"Bunların İdaresi (benim yerime geçip te) idareyi ele alacak kimseye aittir.\" dedi. Onlar bugüne kadar bu şekilde (idare edilegeldi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2971,
			"arabicnumber": 2971,
			"text": "Siz (onu elde etmek için) onun üzerine ne at ne de deve sürdünüz...\"[Haşr 6] âyeti hakkında Zühri'nin (şöyle) dedi(ği rivayet olunmuştur.): \"Nebi (S.A.V.) Fedek ve (bir takım) köylerin halkı ile barış yaptı. (Ma'mer der ki: -şeyhim Zührî bu köylerin) isimlerini söyledi ama ben hatırımda tutamadım.- (o sırada) Hz. Nebi bir başka kavmi de kuşatmıştı. (Muhasara altında olan bu kavim) Hz. Nebi'ye haber göndererek sulh teklifinde bulundular. (Çünkü Cenab-ı Hak onların kalplerine korku düşürmüştü. Rasûl-ü Ekrem de onların bu teklifini kabul etti. Bunun üzerine yüce Allah indirmiş olduğu bir âyet-i kerimesinde şöyle) buyurdu: \"Siz (onu elde etmek için) onun üzerine ne at ne de deve sürdünüz\"[Haşr 6] (Yüce Allah bu sözüyle bu malların) savaşsız olarak (elegeçtiğini) ifade buyurmak istiyor. Zührî dedi ki: (Ele geçen) Nadiroğullarının (bu) mallan sırf Nebi (s.a.v.)'e ait oldu. (Çünkü müslümanlar) onları zorla ele geçirmediler. (Bilakis) onları barış yoluyle, ele geçirdiler. Bu yüzden de Nebi (s.a.v.) onları Muhacirler arasında bölüştürdü. Muhtaç durumda olan iki kişi hariç olmak üzere onlardan Ensara hiç bir şey vermedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "Muğire'den demiştir ki: Ömer b. Abdülaziz, Halife seçildiği zaman, (Hz. Nebiin mülkü olan topraklar, ellerinde bulunan) Mervan oğullarını toplayıp (şöyle) dedi: \"Şüphe yok ki Fedek (arazisi) Rasûlullah (S.A.V.)'indi. Onun bir kısmını (kendi ailesine) infak ederdi. Bir kısmım da Haşim oğullarının küçüklerine ihsan ederdi. Bir kısmıyla da bekarları evlendirirdi. (Kızı) Fatıma ondan Fedek arazisinin kendisine verilmesini istedi de (onun bu isteğini) kabul etmedi. (Fedek arazisinin) Rasûlullah (S.A.V.)'in sağlığındaki durumu bu idi. Nihayet vefat edip Hz. Ebû Bekir halife seçilince, O'da -vefat edinceye kadar Fedek arazisinde Hz. Nebinin yaptığı işlemi(n aynısını) yaptı. Ömer halife seçilince O da hayatı boyunca Fedek arazisi hakkında (Hz. Nebi ile Hz. Ebû Bekir'in) yaptıkları işlemin aynısı­nı yaptı. Sonra (dedem) Mervan onu ikta (yoluyla kendi yakınlarına tahsis) etti. Nihayet (Fedek arazisinin idaresi yahutta halifelik, ben) Ömer b. Abdülaziz'e geçti. Yani Abdülaziz'in oğluna (geçti). Ben de (kendimi Nebi (S.A.V.)'in Hz. Fatıma'yı bile men ettiği bir iş(in içinde gördüm. Benim buna asla hakkım yoktur. Onu Rasûlullah (S.A.V.) zamanındaki haline döndürüyorum. Ve sizi (buna) şahid tutuyorum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2973,
			"arabicnumber": 2973,
			"text": "Ebû Tufeyl'den demiştir ki: Fatıma (r.a.) Ebû Bekir (r.a)'a vararak Nebi (s.a.v.)'den (kendine düşecek) mirasını istedi. Ebû Bekir (r.a) de (şöyle) cevap verdi: Ben Rasûlullah (S.A.V.)'i \"Şüphesiz ki: Aziz ve Celi) olan Allah bir Nebiye herhangi bir geçim kaynağı verdiği zaman o kaynak (Peygamber'in vefatından) sonra yerine geçen kimsenin olur.\" derken işittim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2974,
			"arabicnumber": 2974,
			"text": "Ebû Hureyre'den demiştir ki: Nebi (s.a.v.) (şöyle) buyurmuştur: \"Benim mirasçılarım (benim bırakacağım) bir dinarı bile bölüşemezler, hanımlarımın nafakasından ve halifemin masrafından başka ne bırakmışsam sadakadır. Ebû Dâvud dedi ki: \"mü'neti amili\" (sözüyle) toprağı (mı) sü­renler (in ücreti) denmek istenmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2975,
			"arabicnumber": 2975,
			"text": "Ebû Buhterî'den demiştir ki: Adam'ın birinden bir hadis işitmiştim de çok hoşuma gitmişti. Bunun üzerine (ona) \"Bu hadisi bana bir yazıver\" demiştim. O da bu hadisi (bana) açıkça yazılmış bir halde getir (ip ver)di. (Hadis şöyleydi, Bir gün) \"Abbas'la Ali (r.a) Hz. Ömer'in yanına girdiler. (Ömer'in yanında Talha ile Zübeyr, Abdurrahman ve Sa'd vardı. Abbas ile Ali ise (biribirlerinden) davacı idiler. Derken Ömer (r.a) Talha ile Zübeyr, Abdurrahman ve Sa'd'a: \"Siz Rasûlullah (S.A.V.)'in \"Ailesinin yiyeceği ve içeceği dışında Nebinin bütün malı sadakadır. Bizim malımıza mirasçı olunamaz.\" dediğini biliyor musunuz? dedi. (Onlar da): \"Evet\" (biliyoruz) dediler. (Sonra Hz. Ömer sözlerine devam ederek: \"Rasûlullah (s.a.v.) malını ailesine harcardı. Kalanı da sadaka olarak dağıtırdı. Sonra Rasûlullah (s.a.v.) vefat etti. Bunun üzerine halifeliği iki sene Ebû Bekir (r.a) yürüttü, Rasûlullah (s.a.v.)'in yaptığını (aynen) o da yapıyordu..\" dedi. Sonra (Ebû Buhterî, 2963 numaralı) Malik b. Evs. hadisinden bir kısmım daha zikretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2976,
			"arabicnumber": 2976,
			"text": "Hz. Aişe'den demiştir ki: Rasûlullah (s.a.v.) vefat edince, hanımları Hz. Osman'ı Ebû Bekir Sıddık'e göndererek O'ndan, Nebi (s.a.v.)'in malının sekizde bi­rini (kendilerine) isteyivermesini kararlaştırmışlar. Bunun üzerine Hz. Aişe onlara Rasûlullah (s.a.v.) \"Bizim malımıza varis olunmaz. Bizim bıraktığımız sadakadır-\" buyurmadı mı?- demiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2977,
			"arabicnumber": 2977,
			"text": "(İbn Şihab'ın yine Urve kanalıyla Aişe'den rivayet ettiğine göre: Hz. Aişe şöyle demiştir.) Ben (Hz. Nebi'nin malından miras isteyen hanımlarına): \"Siz Aliah'dan korkmaz mısınız? Siz Rasûlullah (s.a.v.)'i \"Bizim malımıza mirasçı olunmaz. Bizim bıraktığımız sa­dakadır. Ancak şu mal Muhammed'in ailesinin ihtiyaçları için ve misafirlerinin ağırlanması) içindir. Ben ölünce (ailemin ihtiyaçlarına tahsis ettiklerimin dışında kalan) malım benden sonra halifeliği üstlenecek olan kimseye aittir.\" derken işitmediniz mi dedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2978,
			"arabicnumber": 2978,
			"text": "Cübeyr b. Mutim(in) haber verdi(ğine göre) Kendisi, Osman b. Affan (r.a) ile birlikte (Hz. Nebi'nin) humus'tan (ayırdığı bir payı) Haşim oğullarıyla, Muttalib oğulları arasında paylaştırdığını konuşarak Rasûlullah'ın huzuruna varmışlar. (Cubeyr b. Mutim sözlerine şöyle devam etmiştir) \"Ben: Ey Allah'ın Rasûlü (sen humus'un bir kısmını) kardeşlerimiz Muttalib oğullarına dağıttın da bize (ondan) hiçbir şey vermedin. Oysa bizim sana olan yakınlığımızla onların yakınlığı aynıdır\" dedim. Nebi (s.a.v.) de: \"Haşim oğullarıyla, Muttalib oğulları aynı şey (gibi) dir\" buyurdu. Cübeyr (rivayetine devam­la şöyle) dedi: (Hz. Nebi) bu humus'tan Haşim oğullarıyla Muttalib oğullarına verdiği gibi, Abdüşems ve Nevfel oğullarına vermedi. (Zührî) dedi ki: Ebû Bekir humus'u aynen Rasûlullah (s.a.v.) gibi bölüştürürdü, fakat Rasûlullah (s.a.v.)'in (kendi) yakınlarına vermiş olduğu hisseyi, onlara vermezdi. Ömer b. el-Hattab, humus'tan onlara hisse verirdi. Hz. Ömer'den sonra Osman da (onlara humustan pay verirdi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2979,
			"arabicnumber": 2979,
			"text": "Said b. El-Müseyyeb'den demiştir ki: Cübeyr b. Mutim (şöyle) demiştir: Rasûlullah (s.a.v.) (ganimet mallarının) beşte bir(in)den Haşim oğullarıyla, Muttalib oğullarına hisse ayırdığı gibi Abdişşems oğullarıyla Nevfel oğullarına ayırmadı. (Zührî) dedi ki, Ebû Bekir (ganimet mallarından ayrılan) beşte bir hisseyi (hak sahipleri arasında) aynen Rasûlullah (s.a.v.)'in taksimi gibi taksim ederdi. Fakat (bu hisse'den) Rasûlullah'ın verdiği gibi o'nun yakınlarına (bir pay) vermezdi. Ömer de onlara (bir hisse) verirdi. Ondan sonra (halife) olan (Hz. Osman) da, O humus'tan (onlara bir pay) verirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2980,
			"arabicnumber": 2980,
			"text": "Said b. el-Müseyyeb'den demiştir ki: Cübeyr b. Mutım O'na (şöyle) demiştir: Hayber günü olunca Rasûlullah (s.a.v.) (kendi) yakınlarının humustaki) hissesini Haşim oğullarıyla Nevfel oğullarına verdi. (Hz. Cübeyr sözlerine devam ederek şöyle dedi.) Ben de Osman b. Affan'la beraber yola koyuldum nihayet Nebi (s.a.v.)'e vardık ve, \"Ey Allah'ın Rasûlü, bunlar Haşim oğullarıdır. Allah'ın seni onların içerisine yerleştirmiş olması sebebiyle onların (bize nisbetle olan) üstünlüklerini inkâr etmiyoruz, (fakat) kardeşlerimiz Muttalib oğullarının durumu nedir de bizi bıraktığın halde onlara (hisse) verdin. Oysa (onlarla) bizim (sana olan) yakınlığımız birdir?\" dedik. Rasûlullah (s.a.v.) de: \"Muttalib oğullarıyla biz cahiliyye (döneminde de) İslâmiyet döneminde de (hiç) ayrılmadık. Biz ve onlar bir şey (gibiy)iz.\" buyurdu ve parmaklarını biribirine geçirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2981,
			"arabicnumber": 2981,
			"text": "es-Süddi'den (Allah'ın Rasûlü ile) akrabalığı bulunan (lar) hakkında \"Onlar Abdülmuttalib oğullarıdır.\" dedi(ği rivayet olunmuştur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2982,
			"arabicnumber": 2982,
			"text": "Yezid b. Hûrmûz (şöyle) demiştir: Necdet-ûl Harûrî İbn Zübeyr'in (Haccac-ı zalimle olan) savaşı sırasında Hacca gitmişti de İbn Abbâs'a (birini) göndererek (Hz. Nebi'nin) yakınlann(ın) payını sordu ve (şimdi) bu pay'ın kime ait olduğu görüşünidesin? dedi. İbn Abbas (r.a) da: (Ben bu pay'ın yine) Rasûlullah (s.a.v.)'in (sağlığında) bu hisseyi kendilerine verdiği yakınlarına ait (olduğu inancındayım) Nitekim Hz. Ömer'de bu hisse'den (Hz. Nebi'nin yakını olarak) bize (bir pay) vermişti. (Fakat) biz (Hz. Ömer'in verdiği) bu payı hakkımızdan az bulduğumuz için kendisine geri verdik ve almaktan kaçındık",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2983,
			"arabicnumber": 2983,
			"text": "Abdurrahman b. Ebî Leyla'dan demiştir ki: Ben Hz. Ali (r.a)’i (şöyle) derken işittim. \"Rasûlullah (s.a.v.) humus'un beşte birini (hak sahiplerine dağıtmak üzere) beni görevlendirmişti. Bende onu Rasûlullah (s.a.v.)'le Hz. Ebû Bekir ve Ömer devrinde (verilmesi gereken) yerlerine verdim. (Bir gün) bana (Hz. Ömer tarafından) bir mal getirildi. (Hz. Ömer) beni çağırdı ve: \"O'nu (Hz. Nebi'nin yakını olarak) Sen al\" (Ve yine eskiden olduğu gibi dağıtılması gereken, yerlere dağıt) dedi. (Bende): \"Ben (o'nun idaresini üzerime almak) istemiyorum.\" dedim. O'da (onun idarisini) \"Sen al çünkü siz (Nebi'nin yakınları olarak) O'na daha çok müstehaksınız\" dedi. Bende: \"Bizim o'na ihtiyacımız yoktur.\" dedim. Bunun üzerine (götürdü) o'nu hazineye koydu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2984,
			"arabicnumber": 2984,
			"text": "Abdurrahman'dan demiştir ki: Ali (r.a)'ı (şöyle) derken işittim. “Ben, Abbas, Fatıma ve Zeyd b. Hariseyle Hz. Nebi (S.A.V.)'in yanında bir araya gelmiştik. (Hz. Nebi'ye hitaben): \"Ey Allah'ın Rasûlü, Aziz ve Celil olan Allah'ın kitabında (ganimet mallarından ayrılıp dağıtılmasını emrettiği) humus'tan (bize düşecek olan) hakkımızı (pay sahiplerine dağıtma görevini) bana versende (ileride) senden sonra her hangi bir kimsenin bu mevzuda benimle anlaşmazlığa düşmemesi için senin sağlığında bu geliri (hak sahiplerine) ben dağıtsam (çok isabetli olur, uygun buluyorsan bunu) yap\" dedim. (Rasül-i Ekrem Efendimiz de) bunu yaptı. Ve (humus gelirlerindeki Hz. Nebi'nin yakınlarına ait) bu hakkı, Rasûlullah (s.a.v.)'in sağlığında (hak sahiplerine) ben dağıttım. Sonra Hz. Ebû Bekir de bu görevi bana verdi. Nihayet Hz. Ömer'in (halifelik) yıllarının son yılına kadar (bu görevi yürüttüm fakat Hz. Ömer'in halifeliğinin son yılında bu görevi bıraktım) Çünkü (o sene) O'na (ganimetlerden) bir çok mal geldi. O'da bizim hakkımızı ayırdı. Sonra bana (bir haber) gönder(erek varıp onu hak sahiplerine bölüştürmemi iste)di. Ben de: \"Bizim bu sene ona ihtiyacımız yoktur, (fakat Hz. Nebi'nin yakınları olan bizlerin dışındaki) müslümanların ona ihtiyacı vardır. Sen bunu onlara ver!\" cevabını verdim. O da (bizim hissemize düşecek olan) bu malı fakir müslümanlara verdi. Hz. Ömer'den sonra kimse bana bunu teklif etmedi. Hz. Ömer'in yanından çıktıktan sonra Hz. Abbas'la karşılaş(mış)tımda (Bana) \"Ey Ali. Bu gün sen bizi (büyük bir) gelirden mahrum ettin, bir daha bu mal ebediyyen bize verilmez. \" de(miş)di. (Gerçekten Abbas) çok zeki bir adamdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2985,
			"arabicnumber": 2985,
			"text": "Abdûlmuttalib b. Rabia b. El-Haris b. Abdûlmuttalib(in) haber verdi(ğine göre), Rabia b. El-Haris ile Abbas . Abdil Muttalib, Abdulmuttalib b. Rabia ile Fadl b. Abbas'a -siz Rasûlullah (s.a.v.)'e varınız ve kendisine : \"Ey Allah'ın Rasûlü gördüğün gibi biz (evlenecek) bir yaş'a geldik. Ve.evlenmek istiyoruz. Ey Allah'ın Rasûlü, sen insanların Allah'a en bağlı olanı akrabalık haklarına en çok riayet edenisin. Anne ve babalarımızda ise bizim için mehir olarak verebilecekleri bir şey yoktur. Binaenaleyh bizi zekatları toplamak üzere memur tayin ette, zekat memurlarının sana verdikleri gelirleri bizde verelim ve (buna karşılık) sadakalar(ı toplamanın ücretin)den (ve sadakaların dışında elde edeceğimiz hasılattan) biz de yararlanalım.\" demişler. (Abdulmuttalib b. Rabia, sözlerine devam ederek) dedi ki: Biz (babalarınızla) bu şekilde (konuşur) iken Ali b. Ebû Talib geliverdi. Bize - Hayır vallahi Rasûlullah (s.a.v.) sizden hiç bir kimse zekat memuru olarak tayin edilemez\" buyurmuştu - dedi. Bunun üzerine (babam) Rabia Hz. Ali'ye \"Bu da senin kıskançlığındandır. Sen Rasûlullah (s.a.v.)'in damatlığını elde ettin de biz bunu senden kıskanmadık\" (sen ise bize kıskançlık yapıyorsun) dedi. Ali üzerine cübbesini alıp onun üzerine yattı ve: \"Ben Hasan'ın babasıyım (kavmi içerisinde) tecrübeli bir kimseyim\" Allah'a yemin olsun ki, çocuklarınız, kendilerini Nebi (s.a.v.)'e sormak üzere göndereceğiniz meselenin cevabını getirmedikçe (burada yatmaya) devam edeceğim, dedi. Abdulmuttalib (sözlerine devam ederek şöyle) dedi. \"Bunun üzerine ben (bu meseleyi Hz. Pey­gambere sormak üzere) Fadl'la beraber yola koyuldum. (Hz. Peygamber'e tam) öğle namazında tesadüf ettik. Namaz başlamıştı. Namazı cemaatla kıldık. Sonra Fadl'la beraber Nebi (s.a.v.)'ın odasının kapısına koştum. Kendisi o gün Zeyneb bint Çahş'ın yanında (kalıyor) idi. Kapıda beklemeye başladık. Nihayet Rasûlullah (s.a.v.) geldi. Benim ve Fadl'ın kulağından tuttu ve: (Ağzınızda) \"sakladığınızı çıkarın\" (bakalım) dedi ve (içeri) girdi. Fadl'la benim de içeri girmemize izin verdi. Bir süre(Fadl'la ben) sözü (almayı) birbirimizden bekleştik. Sonra Hz. Nebi ile ben konuştum yahutta Fadl konuştu. (Ravi İbn Şihâb-Ez-Zühri dedi ki, bu hadisi bana nakleden) Abdullah bunda tereddüt etti. -(yani söze hangisinin başladığını kesin olarak hatirlayamadı. Abdulmuttalib sözlerine devam ederek şöyle) dedi. (Fadl) babalarımızın bize (sormamızı) emrettikleri meseleyi Hz. Nebi'ye anlattı. Rasûlullah (s.a.v.)'de gözünü tavana dikerek bir süre sustu. (Bu sükût) bize öyle uzun geldi ki biz hiç bir cevap vermeyecek zannettik. Nihayet bize perde arkasından eliyle işaret eden Zeyneb (validemiz)i gördük. (Bu işaretiyle bize) acele etmeyiniz (demek) istiyordu. Ve Rasûlullah (s.a.v.)'in bizim işimizle meşgul olduğunu (anlatmak) istiyordu. Sonra Rasûlullah (s.a.v.) başını indirdi ve bize \"Bu zekât insanların\"(malının) kiridir. Muhammed'e ve onun ailesine zekat almak helâl değildir. Bana Nevfel b. el-Haris'i çağırınız' dedi. Nevfel b. El-Haris çağrıldı ve (O'na dönerek) \"Ey Nevfel Abdulmuttalib'i (kızınla) evlendir\" dedi. Bunun üzerine Nevfel beni (kızıyla) evlendirdi, sonra Nebi (S.A.V.): \"Bana Mahmıyye b. Cûz'ü çağırın\" dedi. Mahmıyye Zübeyd oğullarından bir adamdı. Ve Rasûlullah (s.a.v.) onu humusları toplamak üzere tahsildar tayin etmişti. Rasûlullah (s.a.v.) Mahmıyye'ye \"Fadl'ı (kızınla) evlendir.\" buyurdu. Mahmıyye'de Fadl'ı (kızıyla) evlendirdi. Sonra Rasûlullah (s.a.v.) (Mahmıyye'ye) \"Kalk humus (gelirin)den şu iki genc'e şu kadar mehir (masrafı) ver\" dedi. (Ravi İbn Şihab) dedi ki, \"Abdullah b. Haris bana mehrin mikdarını söylemedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2986,
			"arabicnumber": 2986,
			"text": "Ali b. EbîTalib (şöyle) demiştir: Benim Bedir günü alınan ganimetlerden payıma düşen yaşlı bir devem vardı. O gün Rasûlullah (s.a.v.) ganimetin beşte birinden yaşlı bir deve (daha) vermişti. Ben Rasûlullah (s.a.v.)'in kızı Fatıma ile evlenmek istediğim zaman Kaynuka oğullarından kuyumcu bir adam'dan benimle geleceğine dair söz almıştım. Boya otu getirecektik. Bu otu kuyumculara satarak düğün ziyafetimde ondan yararlanmak istiyorum. Develerim için semer, çuval ve iplerden oluşan eşyayı toplarken, develerim ensardan bir adamın evinin yanına çökmüşlerdi. Ben toplayacağımı toplayınca (develerime doğru) yönelmiştim. Bir de ne göreyim, onların hörgüçleri kesilmiş, böğürleri delinmiş, ciğerlerinden bir kısmı alınmış. Bu manzarayı görünce göz yaşlarıma sahip olamadım. Ve \"Bunu kim yaptı\" diye feryat ettim, (orada bulunanlar) \"Her halde bunu yapan Hamza b. Abdülmuttalib'dir. Kendisi (şimdi) şu evde ensardan bazı içkiciler arasında bulunmaktadır. O'na ve arkadaşlarına bir cariye şarkı söyledi şarkısında -Ey Hamza! semiz develere dikkat- diye (başlayan bir şarkı okudu). Bunun üzerine Hamza hemen kılıca sarıldı, develerin hörgüçlerini kesti ve böğürlerini deldi, ciğerlerinin bir kısmını aldı.\" dediler. (Hz. Ali sözlerine devam ederek şöyle) dedi: Bunun üzerine ben de yol'a koyuldum. Nihayet Rasûlullah (s.a.v.)'in yanına girdim. Yanında Zeyd b. Harise vardı. Rasûlullah (s.a.v.) benim başıma geleni hemen anladı ve \"Sana ne oldu?\" dedi; Ben de: \"Ey Allah'ın Rasûlü bu günkü gibisini hiç görmedim. Hamza benim iki deveme saldırarak hörgüçlerini kesmiş ve böğürlerini delmiş. İşte kendisi içkicilerle beraber şu evde bulunuyor.\" dedim. Rasûlullah (s.a.v.) kaftanını isteyip onü örtündü. Sonra (yol'a çıkıp) yürümeye başladı. Ben de Zeyd b. Harise ile birlikte kendisini takib ettim. Nihayet Hamza'nın bulunduğu eve geldi. (Girmek için) izin is­tedi. Kendisine derhal izin verildi, (içeriye girince) birde ne görelim, hem içkiciler (orada), Rasûlullah (s.a.v.) yaptığı işten dolayı Hamza'yı azarlamaya başladı. Hamza da sarhoştu. Gözleri kızarmıştı. Hamza, Rasûlullah (s.a.v.)'e gözlerini.dikti sonra gözlerini kaldırdı (Hz. Peygamber'in) delerine dikti. Sonra (daha da kaldırarak) yüzüne baktı. Sonra \"Siz benim babamın kölelerinden başka birşey değilsiniz\" dedi. Rasûluüah (s.a.v.) onun sarhoş olduğunu (artık iyice) anlamıştı. Hemen gerisin geriye giderek dışap çıktı. Onunla beraber büzde çıktık",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2987,
			"arabicnumber": 2987,
			"text": "Zübeyr b. Abdülmuttalib'in ümmü-l-Hakem-yahut ta Dubâa isimli kızların biri (şöyle) demiştir: Rasûlullah (s.a.v.) (bir savaşta) bir takım cariyeler elde etmiştir. Ben, kız kardeşim ve Rasülullah (s.a.v.)'in kızı Fatıma ile birlikte, Hz. Nebi'nin huzuruna gittim. Kendisine içinde bulunduğumuz durumdan şikayet ettik ve (işlerimizde bize yardımcı olması için) esir cariyelerden bize de vermesini istedik. Rasülullah (s.a.v.): Bedir(savaşında hayatlarını kaybeden şehitlerin) yetimleri sizin önünüze geçtiler. Fakat ben size bundan daha hayırlısını göstereyim mi? Her namaz'ın arkasında otuz üç defa Allahu ekber otuz üç defa sübhanellah, otuz üç defa elhamdulillah ve(bir defa da) Lâ ilâhe illallâhu vahdehu Lâ Şerike leh (dersiniz.\"buyurdu. (Ravi-)Ayyâş (b. Ukbe) dedi ki: \"Bu iki kadın Nebi (s.a.v.)'in amcasının kızlarıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2988,
			"arabicnumber": 2988,
			"text": "İbn A'büd'den demiştir ki: Ali (r.a.) bana: \"Sana kendimden ve Rasûlullah (s.a.v.)'in ailesi içerisinde kendine sevgili olan kızı Fatıma'dan bahsedeyim mi?\" dedi. Ben \" Evet\" (bahset) dedim. (Bunun üzerine bana şunları) söyledi.: \"Gerçekten Fatıma (elleriyle) değirmen çekerdi. Öyle ki (değirmen) el(ler)inde iz bırakmıştı. Su tulumuyla su taşırdı (tulum da) göğsünde iz yapmıştı, (süpürge ile) ev süpürmekten üstübaşı tozlanmıştı. (birgün) Nebi (S.A.V.)'e hizmetçiler gelmişti. (Ben de Fatıma'ya) \"Babana gitsen de ondan (işlerinde kullanmak üzere) hizmetçi (bir köle) istesen!\" dedim. Bunun üzerine Hz. Nebi'nin huzuruna çıktı. Fakat onun yanında konuşmakta olan bir takım kimselerin bulunduğunu görüp geri döndü. Ertesi gün Hz. Nebi O'nun yanına geldi ve: \"İhtiyacın neydi?\" dedi (Fatıma) sükut etti. Bunun üzerine (Ben söz alıp) \"Ey Allah'ın Rasûlü (Bunu) sana ben anlatacağım\" dedim (ve şunları söyledim. Fatıma elleriyle) su çeke çeke ellerinde izler meydana getirdi. Su taşıya taşıya bağrında izler bıraktı. Sana hizmetçi (koleler gelince ben kendisine sana varıp (senden) kendisini içinde bulunduğu sıkıntıdan kurtaracak bir hizmetçi istemesini emretmiştim\" dedim. Hz. Nebi de: Ey Fatıma Allah'dan kork, Rabbının emrini yerine getir, efendi'nin hizmetini gör. Yatağına yatınca otuz üç defa sübhanallah, otuz üç defa elhamdülillah, otuz dört defa da Allahu ekber de. Hepsi yüz eder. Bu senin için hizmetçiden daha hayırlıdır.\" buyurdu. (Fatıma da): \"Ben Allah'dan da, Rasûlünden de razıyım\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2989,
			"arabicnumber": 2989,
			"text": "(Bir önceki 2988. hadis-i şerifte anlatılan) hadise Ali b. Hüseyin'den de (rivayet olunmuştur. Ali b. Hüseyin bu rivayetinde) şöyle demiştir: Rasûlullah (s.a.v.) \"Hz. Fatıma'ya hizmetçi vermedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2990,
			"arabicnumber": 2990,
			"text": "Müccâa (b. Nirare el-Hanefî el-Yemamî)den (rivayet olunduğuna göre) Kendisi (birgün) Nebi (s.a.v.)'e varıp, Zühl oğullarından (olan) Sedüs oğullarının öldürdüğü kardeşinin diyetini istemiş, Nebi (s.a.v.) de: \"Eğer ben müşrik(ler) için diyet öder olsaydım kardeşin için de öderdim. Fakat ben sana kardeşin için başka bir şey vereceğim\" demiş ve (o anda müslümanların kendileriyle çarpışmakta olduğu) Zühl oğullarının müşriklerinden (ele geçen mevcut ganimetlerden) ayrılacak olan ilk humus (beşte bir pay)dan yüz deve verilmesi için eline bir mektup vermiş ve (henüz ele geçmiş olan mevcut ganimetlerden bu develerin bir kısmını almış(sada ganimetler yeterli olmadığı için develerin hepsini alamamış bir süre sonra da) Zühl oğulları müslüman olmuş. (Artık müslümanlar onların mallarına dokunmamışlar) Daha sonra (Müccâa, kalan) bu develeri Ebû Bekir'den istemiş ve kendisine Peygamber (s.a.v.)'in mektubunu vermişti. Hz. Ebû Bekir de ona dört bin (sa') buğday, dörtbin (sa') arpa, dörtbin (sa') hurma (olmak üzere) Yemame zekatlarından on iki bin sa', (tahıl) verdi. Nebi (s.a.v.)'in Muccâa'ye (verdiği) mektubunda (şu sözler) vardı. \"Rahman ve Rahım olan Allah'ın adıyla (başlıyorum) Bu mektub Nebi Muhammed (s.a.v.) tarafından (yazılıp) Sülma oğullarından Müccâa b. Mirare'ye (verilmiştir.) Ben, ona, Zühl oğullarının müşriklerinden ayrılacak humusdan yüz deveyi kardeşinin (diyeti) yerine verdim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2991,
			"arabicnumber": 2991,
			"text": "Amir eş-Şa'bi'den demiştir ki: Nebi (s.a.v.)'in (ganimetlerde) sayfiyye denilen bir hakkı vardı. (Bu hakka dayanarak) isterse bir köleyi, isterse bir cariyeyi ya da bir atı (seçerek alabilirdi) bunu (ganimetlerden) humus (ayrılmaz)dan önce seçip alırdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2992,
			"arabicnumber": 2992,
			"text": "İbn Avn' dedi ki: Ben Muhammed (b. Sîrîn)'e Peygamber (s.a.v.)'in (ganimetlerdeki) hissesi ile \"Safiyy\" (denilen hissesin)i sordum da bana, \"Eğer savaşta bulunmamışsa bile kendisine (harbe giren) müslümanlarla beraber bir hisse verilirdi, bir de herşeyden önce humustan (seçerek alabileceği) bir adet (köle -ya da câriye- ile at ve kılıç) verilirdi,\" cevabını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2993,
			"arabicnumber": 2993,
			"text": "Katâde'den demiştir ki: Rasûlullah (s.a.v.)'in savaşa katıldığı zaman, (ganimet mallarının tümü içerisinde onlardan) dilediğini seçip alabileceği özel bir payı vardı. İşte Safiyye (denilen pay) bu pay idi. (Fakat) Eğer savaşa bizzat katılmazsa, kendisine (sadece müslüman bir fert olarak ganimetlerdeki) payı verilirdi. (Fakat özel hakkı olan safiyy payı) seçilip te kendisine verilmezdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2994,
			"arabicnumber": 2994,
			"text": "Aişe (r.a) dan demiştir ki: Hz. Safiyye, (Hz. Nebi'nin payına) Safiyy (denen özel hisseden (düşmüş) idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2995,
			"arabicnumber": 2995,
			"text": "Enes b. Malik'den demiştir ki: Hayber'e vardık. (Çetin bir savaştan sonra) Yüce Allah (bize) (Kâmas isimli) kaleyi (de) Fethetmeyi nasib edince, Huyeyy'in kızı Safiyye'nin güzelliği Hz.Nebi'ye haber verildi. Kocası (savaş esnasında) öldürülmüşte (kendisi de daha yeni) gelin (olmuş) idi. Rasûlullah (s.a.v.) o'nu kendine seçti. (Medine'ye dönüşümüzde Hz. Nebi yola) onunla çıktı. Ve Süddessahbâ denilen yere vardığında Safiyye hayızdan kurtuldu. Hz. Nebi de onunla zifaf'a girdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2996,
			"arabicnumber": 2996,
			"text": "Enes b. Malik'ten elemiştir ki: Safiyye (ganimetlerin taksimi neticesinde) Dihye El-Kelbiyye (r.a)'ın (cariyesi) olmuştu. Sonra Rasûlullah (s.a.v.)'in (cariyesi) oldu. Bu hadisi ayrıca; Buhârî, cihâd, Bey; Müslim, nikâh; Ibn Mâce, nikâh ta tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2997,
			"arabicnumber": 2997,
			"text": "Enes'den demiştir ki: Dıhye'nin payına (hayber ganimetlerinden) güzel bir câriye düşmüştü de Rasûlullah (s.a.v.) onu (Dıhye'den) yedi baş (esir) karşılığında geri aldı. Sonra onu süslemesi ve (zifaf'a) hazırlaması için Ümmü Süleym'e verdi. (Râvi) Hammad dedi ki (öyle) zannediyorum ki (bu hadisi bana rivayet eden Sabit şöyle) dedi \"ve evinde istibra yapması için (onu Ümmü Süleym'e verdi işte bu câriye) Safiyye bint-i Huyeyy(dir) Bu hadis'i Müslim, nikâh ta tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2998,
			"arabicnumber": 2998,
			"text": "Hz. Enes'den demiştir ki: Hayber'de esirler toplanınca Hz. Dıhye gelip, \"Ey Allah'ın Rasûlü! Bana esirlerden bir câriye ver\" dedi (Hz. Nebi de): \"Git (esirler arasından kendine) bir câriye al\" buyurdu. Bunun üzerine (Hz. Dihye esirler arasından kendisine) Hz. Safiyye bînti Huyeyy'i (seçip) aldı. Derken bir adam Nebi (s.a.v.)e gelip \"Ey Allah'ın Nebisi sen Küreyza ve Nadır'ın ulusu olan (bu câriyey)i Dıhye'ye mi verdin\" dedi: (Râvi) Ya'kub (b. İbrahim sözü geçen adam'ın). \"Ey Allah'ın Rasûlü! Kureyza ve Nadir (oğullarının ulusu olan) Safiyye binti Huyeyy'i Dıhye'ye mi verdin?' (dediğini) rivayet etti. (Hadis'in bundan sonraki kısmında, onu Musannif Ebû Davud'a nakleden Davud b. Muazla Ya'kub b. ibrahim rivayetlerinde) birlenerek şöyle de)diler. (Bu adam sözlerine devam ederek Hz. Nebi'ye) \"O ancak sana yaraşır\" (dedi. Hz. Nebi de): \"Onu çağırın (bana) cariyeyi getirsin\" buyurdu. (Hz. Peygamber Safiyye'yi görünce Hz. Dıhye'ye: “Sen esirlerden (kendine) başka bir câriye al\" dedi ve safiyye'yi hürriyetine kavuşturup onunla evlendi. Bu hadis'i ayrıca; Buhârî, cihâd, nikâh, Salat; Müslim; Nesâî, Nikâh, Ahmed b. Hanbel III-102. de tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2999,
			"arabicnumber": 2999,
			"text": "Yezid b. Abdullah (şöyle) dedi: Biz (Basra'daki) Mirbed (mahallesin)de idik. Elinde bir deri parçası bulunan saçı başı dağınık bir adam geldi. (Kendisine) \"Sen çöl halkından birine benziyorsun. Elindeki bu deri parçasını bize ver\" dedik. O da O'nu bize verdi, onu okuduk. Bir de ne görelim o deri parçasına \"Allah'ın Rasûlü Muhammed (s.a.v.)den Züheyr b. Ukayş oğullarına, eğer siz Allah'dan başka bir ilah olmadığına ve Muhammed'in Allah'ın elçisi olduğuna şahitlik eder, namazı kılar, zekatı verir humusu da ganimetlerden (ayırıp hak sahiplerine) verir ve Nebi (s.a.v.)'in (bir müslüman olarak ganimetlerde bulunan) payı ile (bir Nebi olarak yine ganimetlerde bulunan) safiyy (hissesin)i (kendisine) öderseniz, siz kesinlikle Allah'ın ve Rasûlünün emanıyla emniyettesiniz.\" (sözleri) yazılıydı. \"Bu mektubu sana kim yazdı?\" dedik \" Rasûlullah Sallallahu Aleyhi ve Sellem\" (yazdı). Cevabını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3000,
			"arabicnumber": 3000,
			"text": "(Abdurrahman b. Abdullah b. Ka'b b. Malik'in) babasından (rivayet olunmuştur. Ve Ka'b b. Mâlik) tevbeleri kabul edilen üç kişiden biri idi. (Ka'b b. Malik dedi ki:) Ka'b b. Eşref, Nebi (s.a.v.)'i hicveder, Kureyş kafirlerini de onun aleyhine kışkırtırdı. Peygamber (s.a.v.) Medine'ye yeni gelmişti. O sırada Medine halkı müslümanlardan, put'a tapan müşriklerden ve yahudilerden oluşan karma bir topluluktu. (Yahudiler ise) Nebi (s.a.v.)'le onun sahabilerini incitiyorlardı. Aziz ve celil olan Allah da Nebisine sabır ve hoş görü tavsiye ediyordu. Derken (yüce) Allah onların hakkında \"... kendilerine kitap verilenlerden -çok incitici sözler- işiteceksiniz...\"[Ali İmrân 186] (mealindeki) âyeti indirdi. Ka'b b. Eşref (yine de) Nebi (s.a.v.)'e eziyyet'ten el çekmeyince Nebi (s.a.v.) Sa'd b. Muaz'a Ka'b'ı öldürmek üzere küçük bir kuvvet göndermesini emretti. Bunun üzerine (Hz. Sad ashab'dan bazı kimselerle birlikte) Muhammed b. Mesleme'yi (Eşref'in üzerine) gönderdi. (Râvi) Ka'b b. Malik sözlerine devamla Eşrefin öldürülmesini (şöyle) anlattı. (Hz. Sa'd'in gönderdiği müslüman askerler) Eşrefi öldürünce Yahudilerle müşrikler korkuya düştüler ve öğleden önce Nebi (s.a.v.)'e geldiler ve \"Geceleyin bir arkadaşımızın kapısına yüklenilerek zorla evine girilip öldürüldü\" dediler. Bunun üzerine Nebi (s.a.v.) (Kab'ın kendisi hakkında) söylemiş olduğu (hicvedici) sözleri onlara hatırlattı.,Ve kendilerini (aralarında bir anlaşmazlık çıkması halinde) başvurmaları için yazacağı bir antlaşmaya davet etti. (Onların bu daveti kabul etmesi üzerine) Nebi (s.a.v.) kendisiyle onların ve tüm müslümanların arasında (geçerli olmak üzere) bir sahifelik anlaşma yazdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3001,
			"arabicnumber": 3001,
			"text": "İbn Abbâs'dan demiştir ki: Rasûlullah (s.a.v.) Bedir (savaşı) günü Kureyş'i hezimete uğratıp Medine'ye gelince, Yahudileri Kaynuka oğullan çarşısında toplayıp \"Ey yahudi cemaatı Kureyş'in başına gelenler sizin de başınıza gelmeden önce müslüman olunuz!'* dedi. (Onlar ise): \"Ey Muhammed ! Kureyş'ten savaş bilmeyen tecrübesiz bir toplumla savaşman seni aldatmasın. Eğer sen bizimle savaşsaydın, Bizim nasıl yiğit bir topluluk olduğumuzu ve bizim gibi bir cemaatle hiç karşılaşmamış olduğunu anlayacaktın.\" dediler. Bunun üzerine yüce Allah \"înkâr edenlere de ki yenileceksiniz...\"[Al-i İmrân 12] (âyet-i kerimesini) indirdi. Râvi Musarraf (bu hadisi rivayet ederken sözü geçen âyeti) -Bedir'de- \"...bir topluluk Allah yolunda çarpışıyordu. Öteki de inkarcı...\" (idi) âyetine kadar okudu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3002,
			"arabicnumber": 3002,
			"text": "Muhayyısa'dan (rivayet olunduğuna göre), Rasûlullah (s.a.v.): \"Yahudilerin erkeklerinden ele geçirdiğinizi öldürünüz!\" buyurmuş. Bunun üzerine Muhayyısa (isimli sahabi) yahudi tüccarlarından olup onlarla ilişkisi bulunan gencecik bir adam'ın üzerine sıçrayıp, o'nu öldürmüş (Muhayyısâ'nın kardeşi) Huvayyısa (ise) o gün henüz müslüman değilmiş ve Muhayyısa'dan daha yaşlı imiş Muhayyısa o yahudi genci öldürünce Huvayyısa da: \" Ey Allah'ın düşmanı Allah'a yemin olsun karnındaki yağ(lar)ın pek çoğu onun malındandır\" diyerek (kardeşi) Muhayyısa'ya vurmaya başlamış",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3003,
			"arabicnumber": 3003,
			"text": "Ebû Hureyre'den elemiştir ki: Bir gün biz mescidde iken Rasûlullah (s.a.v.) aniden (yanımıza çıkageldi) ve: \"Haydi yahudilere gidelim!\" dedi. Onunla birlikte biz de çıktık ve yahudilere vardık. Derken Rasûlullah (s.a.v.) ayağa kalkarak onlara seslendi ve: \"Ey yahudiler cemaati, müslüman olun, kurtulun!\" buyurdu. Onlar! \"Tebliğ ettin yâ Ebâ'l-Kaasîm! dediler. Rasûlullah (s.a.v.) onlara: \"Bunu murad ediyorum!\" dedi ve üçüncü defasında onlara şunu söyledi. \"Bilmiş olun ki, bu yer Allah'ın ve Rasûlünündür. Ben de sizi bu yerden sürgün etmek istiyorum. Siz'den kim malına karşılık bir şey bulursa onu hemen satsın! Yoksa bilin ki, bu yer Allah'ın ve Rasûlünündür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3004,
			"arabicnumber": 3004,
			"text": "Nebi (s.a.v.)'in sahabilerinin birinden (rivayet olunduğuna göre), Bedir savaşından önce ve Rasûlullah (s.a.v.)'in Medine'de bulunduğu bir günde, Kureyş kâfirleri (Medine'deki münafıkların reisi Abdullah) b. Übeyy (b. Selûl) ile beraberindeki Evs ve Hazrec'den olan putperestlere: \"Şurası muhakkak ki: Siz bizim-bir vatandaşımıza kendinize sığınma hakkı tanıdınız. Allah'a yemin ediyoruz ki: Onu ya öldürürsünüz, ya da (memleketinizden) çıkarırsınız. Aksi takdirde hepimiz birden sizin üzerinize yürür, nihayet sizi ölüm yerlerinizde öldürür kadınlarınızı (kendimize) helâl kılarız.\" mealinde bir mektup yazmışlardır. Bu (mektup) Abdullah b. Ubeyy ile yanındaki putperestlere ulaşınca Nebi (s.a.v.)'le savaşmak üzere bir aray'a geldiler. Cupeyş'in Abdullah'a mektup göndermesi haberi Nebi (s.a.v.)'e erişince, (gidip) Abdullah ile onun etrafında bulunan putperestlerin yanına vardı ve: \"Kureyş'in tehdidi size son derece tesir etti. (Kureyş'in bu tehdidiyle) size vereceği zarar (sizin bizimle harbe kalkışmak suretiyle) kendinize vermek istediğiniz zarardan daha fazla değildir. (Çünkü siz kendi öz) oğullarınız ve kardeşlerinizle savaşmak istiyorsunuz.\" dedi. Peygamber (s.a.v.)'den bunu duyunca, dağıldılar. Kendilerine bu haber ulaşan Kureyş kâfirleri Bedir savaşından sonra yahudilere, \"Siz silah ve kale sahibi (olan bir cemaatisiniz. (Binaenaleyh) siz ya bizim vatandaşımız (olan Muhammed)le savaşırsınız ya da biz size şöyle şöyle yaparız. Ve (o zaman) bizimle sizin kadınlarınızın halhalları arasına hiç­bir engel giremez.\" diye bir mektup yazdı. Kureyş kâfirlerinin (yahudilere bu ikinci) mektubunu (göndermeleri haberi) Nebi (s.a.v.)'e erişince, Nâdir oğulları (Hz. Nebi'ye) sû-i kast yapmaya karar verdiler. Rasûlullah (s.a.v.)'e \"Sahabilerinden otuz kişiyle birlikte (karşımıza) çık, bizden de otuz din adamı çıksın orta yerde karşılaşalım. (Sen konuş alimlerimiz de) seni dinlesinler. Eğer seni tasdik edip inanacak olurlarsa, sana biz de inanacağız\" diye bir haber gönderdiler. (Râvi ez-Zührî, Kureyza oğullarının Hz. Nebi'le geçen bu) hadiselerini bütün ayrıntılarıyla) anlattı. (Hz. Nebi'nin sahabisi sözlerine devamla şunları söyledi:) Ertesi gün sabahleyin Rasûlullah (s.a.v.) (askeri) bir kuvvetle Nâdir oğullarının üzerine yürüdü ve onları kuşatıp \"Vallahi siz benimle bir antlaşma yapmadıkça ben size güvenenem!\" dedi. Onlar da Hz. Nebi'yle antlaşmaya yanaşmadılar. Bunun üzerine o gün onlarla savaş'a başladı. Sonra ertesi gün sabahleyin Nâdir oğullarını (yerlerinde) bırakıp (askeri) bir kuvvetle Kureyza oğullarının üzerine yürüdü ve onları sulh'a da'vet etti. Kureyza oğulları sulhu kabul edince onlar (la savaşmak)dan vazgeçti ve askeri bir kuvvetle (tekrar) Nâdir oğulları üzerine yürüdü. Nihayet onlar (kuşatmaya dayanamayıp) vatanlarını terketmek şartıyla (kalelerinden) indiler. Develerinin) taşıyabileceği mallarından ve evlerinin kapı ve tahtalarından (ne varsa hepsini) alarak vatanlarından çıkıp gittiler. (Bunun üzerine) Nâdir oğullarının hurmalığı Rasûlullah (s.a.v.)'in özel mülkü oldu. Allah bunu ona verdi. Bunu ona tahsis etti. (Kur'ân-ı Keriminde de şöyle) buyurdu: \"Allah'ın onlardan Nebisine verdiği ganimetle­re gelince, siz (onu elde etmek için) onun üzerine ne at, ne de deve koşturdunuz...\"[Haşr 6] (yüce Allah bu sözüyle) harpsiz olarak (ele geçirdiniz) demek istiyor. Nebi (s.a.v.) ise (bu malı) muhacirlere verdi. Onlara bölüştürüverdi. Birazını da ensardan ihtiyaç sahibi olan iki kişiye verdi. Bu ikisinden başka ensardan kimseye bir pay vermedi. Bunlardan, Hz. Fatıma (r.a)'nın oğullarının elinde bulunan Rasûlullah'ın malları ise baki kaldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3005,
			"arabicnumber": 3005,
			"text": "İbn Ömer'den demiştir ki: Nâdir oğulları yahudileriyle Kureyza oğulları Rasûlullah (s.a.v.)'le savaş'a girmişlerdi. Rasûlullah (s.a.v.) Nâdir oğullarını (Medine'den) sürüp çıkarmış, Kureyzayı ise yerlerinde bırakmış ve onlardan herhangi bir vergi de almamıştı. Nihayet zamanla Kureyza (müslümanlarla) savaş'a başlayınca (Hz. Nebi onların) erkeklerini öldürmüş, kadınlarını ve mallarını da müslümanlara paylaştırmış. Ancak (onlardan) bazıları Rasûlullah (s.a.v.)'e sığınmışlar. (Hz. Nebi de) onlara emân vermiş (Böylece) Rasûlullah (s.a.v.) (pek azı müstesna olmak üzere) Medine yahudilerinin hepsini sürgün etmiş, Abdullah b. Selam'ın kavmi olan Kaynuka oğullarını, Harise oğullan yahudilerini ve Medine'deki her yahudiyi (Medine'den çıkarmış)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3006,
			"arabicnumber": 3006,
			"text": "İbn Ömer'den demiştir ki: Nebi (s.a.v.) Hayber halkına savaş açtı (onların elinde bulunan) hurmalıkları ve toprakları el'e geçirdi. Kendilerini de şatolarına sığınmaya mecbur etti. Bunun üzerine onlar, altınlarla gümüş ve silahların Rasûlullah (s.a.v.)'e, develerinin yükleneceği (diğer) malların da kendilerine ait olmak (ve mallarından) hiçbir şeyi (Hz. Nebi'den saklamamak ve gizlememek, eğer şartlara aykırı olan bu işlerden birini) yapacak olurlarsa kendileri için hiçbir anlaşma ve antlaşma kalmamak üzere Hz. Nebi ile barış yaptılar. Fakat Huyeyy b. Ahtab'a ait olan (içi altın ve gümüş dolu) bir deri'yi sakladılar. (Huyeyy b. Ahtab) Hayber (savaşın)dan önce öldürülmüştü. Kendisi bu deriyi Nâdir oğulları (savaşı) günü (yani) Nâdir oğulları sürgün edildiği zaman (onların malları arasından seçerek alıp) yanında götürmüştü, içerisinde Nâdir oğullarının (gümüş ve altın) zinetleri vardı. Nebi (s.a.v.) (Huyeyy b. Ahtab'ın amcası olan) Saye'ye: “Huyeyy b. Ahtab'ın derisi nerede?\" diye sordu. O da: \"- Savaş ve (halkın geçimi için yapılan) harcamalar onu tüketti.\" diye cevap verdi. (Fakat daha fazla saklayamadıklarından) Deriyi (sakladıkları yer'den) bulup getirdiler. Bunun üzerine (Kinane) b. Ebûl-hukayk öldürüldü ve (Ebûl-hukayk oğullarının) kadınları ile çocukları da esir edildi. Hz. Nebi onları da sürgün etmek istemişti (fakat) onlar: \"Ey Muhammed bizi bırak ta bu topraklarda çalışalım, çıkan mahsulün yarısı bizim yarısı da sizin olsun.\" dediler. Rasûlullah (s.a.v.) de (onların bu teklifini kabul etti) ve (her sene) onların kadınlarından her birine seksen vesk hurma, yirmi vesk arpa veriyordu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "Abdullah b. Ömer'den demiştir ki: Ömer (b. Hattâb (r.a), halk'a hitaben yaptığı bir konuşmasında) \"Ey İnsanlar! Rasûlullah (s.a.v.) Hayber yahudilerine onları dilediğimiz zaman (Hayber'den) çıkarabilmemiz şartıyla (bir) işlem yapmıştı. Binaenaleyh (bahçe veya tarla olarak Hayber'de yahudilerinin elinde) kimin bir malı varsa (gelsin) onu alsın\" demiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3008,
			"arabicnumber": 3008,
			"text": "Abdullah b. Ömer'den (demiştir ki:) Hayber fethedilince, yahudiler, Rasûlullah (s.a.v.)'den Hayber topraklarından çıkacak mahsulün yarısı(nın kendilerinin olması) şartıyla kendilerini orada bırakmasını istediler. Rasûlullah (s.a.v.) de \"Sizi bu şartla; orada dilediğimiz zamana kadar bırakıyorum.\" buyurdu (Hz. Nebi'nin sağlığında ve Hz. Ebû Bekir'in halifeliği döneminde) bu şartla (orada yaşamakta) idiler Hayber'in yarı gelirinden (elde edilen) hurma ikiye bölünür ve (bunun) beşte birini Rasûlullah (s.a.v.) alır. (almış olduğu) beşte bir hisse'den yüz vesak hurma ile yirmi vesak arpayı hanımlarına yedirirdi. (babam) Ömer (r.a), yahudileri Hayber'den çıkarmak isteyince, Nebi (S.A.V.)'in hanımlarına haber gönderip onlara: \"Sizden kim kendisine tahmini olarak yüz vesaklık bir hurmalığı vermemi isterse oranın ağacı da toprağı da suyu da onun olsun. Kim de kendisine tahminen yirmi vesaklık bir arpa tarlasını hisse olarak vermemi istiyorsa (onu da) yaparız. Kim de buradaki hissesini (ölçerek) ayırmamızı istiyorsa o şekilde hareket ederiz\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3009,
			"arabicnumber": 3009,
			"text": "Enes b. Mâlik'den demiştir ki: Rasûlullah (s.a.v.) Hayber'e savaş açtı. Orayı savaş zoruyla ele geçirdik, (orada bir mikdar) esir ele geçirildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3010,
			"arabicnumber": 3010,
			"text": "Selh b. Ebî Hasne'den demiştir ki: Rasûlullah (s.a.v.) yarısı ani ihtiyaçlarına ve geçimine, yarısı da müslümanlara olmak üzere Hayber (arazisin)i ikiye böldü. Müslümanların hissesini de onsekiz pay'a ayırdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3011,
			"arabicnumber": 3011,
			"text": "Bûşeyr b. Yesâr'dan (rivayet olunduğuna göre): Kendisi Nebi (s.a.v.)'in sahabilerden bir cemaatı (şöyle) derlerken işitmiş: (Büşeyr burada işittiklerini naklederken aynen) şu (bir önceki 3010.) hadisi zikretmiş ve (Hayber gelirinin) \"yarısı müslümanların ve RasûluIIah (s.a.v.)'in idi. (kalan) yarısını da müslümanların karşılaşacağı işler ve ani ihtiyaçlar için ayırmıştı\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3012,
			"arabicnumber": 3012,
			"text": "Nebi (s.a.v.)'in sahabilerinden (olan bir) erkekler (cemaatin)den (rivayet olunduğuna göre); RasûluIIah (s.a.v.) Hayber'i fethedince, oranın toprağını her biri yüz hisseyi ihtiva eden otuz altı kısma böldü. Bunun yansı RasûluIIah (s.a.v.) ve müslümanlara aitti. Kalan yarısını da kendisine gelecek olan elçiler (in ağırlanması) ile (müslümanları ilgilendiren önemli) işler ve halk'ın karşılaşacağı bazı zorluklarının halli) için ayırdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3013,
			"arabicnumber": 3013,
			"text": "Buşeyr b. Yesâr'dan demiştir ki: Allah (C.C.) Hayber'i Peygamberine fey olarak verince (Hz. Nebi) Hayber'i her biri yüz sehim ihtiva eden otuzaltı parçaya ayırdı. Bunun yarısını karşılaşacağı hâdiselerin halli) ve kendisine gelecek (elçi)ler (ve ihtiyaçlar) için ayırdı. Yani el-Vatiha (kalesi) ile Küteybe (ismi verilen köyleri) ve bu iki yer'e tabi olan yerleri (sözü geçen ihtiyaçlar için ayırdı) öbür yarısını da müslümanlar arasında paylaştırdı, (bu da) Şakk (denilen kale) ile Netat (denilen topraklar) ve bu iki yer'e tabi olan yerlerdir. Rasûlullah (s.a.v.)'in (bir Nebi olması itibariyle humus payı olarak ve müslüman bir mücahid olması sebebiyle de ganimet payı olarak bu ikinci kısımdan aldığı) hisse (Şakk ve Netat) kalelerine bağlı olan kısımda idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3014,
			"arabicnumber": 3014,
			"text": "Bûşeyr b. Yesâr'dan rivayet olunduğuna göre, Rasûlullah (s.a.v.), Allah kendisine Hayber'i fey olarak nasibedince onun tümünü otuz altı paya böldü. (Bunların) yarısını (yani her birî yüz sehim ihtiva eden onsekiz payı müslüman (mücahid)lere ayırdı. Peygamber (s.a.v.)'in de (müslüman bir mücahid olarak bu onsekiz pay içinde) müslümanlarla birlikte onlardan biri (nin hissesi) kadar hisse (almak hakkı) vardı. Rasûlullah (s.a.v.) (geriye kalan) onsekiz payı da , ki bu (tüm Hayber arazisinin) yarısıdır. Karşılaşacağı hâdiseler ve müslümanların işleriyle ilgili olarak ortaya çıkacak meseleler için (harcamak üzere) ayırdı. Bu da el-vatıh (kalesi) ile Küteybe (denilen köyler) ve Selâlim (kalesi) ve buralara tabi olan yerlerdir. (Buralar) Nebi (s.a.v.) ile müslümanların eline geçtiği sırada, müslümanların oraların işine yetecek kadar işçileri yoktu. Bunun üzerine Rasûlullah (s.a.v.) yahudileri çağırdı (mahsulün yarısı müslümanlara yarısı da yahudilere olmak üzere oraları) onlara ortağa verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3015,
			"arabicnumber": 3015,
			"text": "Kur'ân okuyucularından biri olan Mücemmi b. Cariye el-Ensâri'den (şöyle) dedi(ği rivayet olunmuştur.) Hayber (ganimetleri ve topraklan) Hudeybiye mücahidlerine bölüştürüldü. Rasûlullah (s.a.v.) o'nu onsekiz hisseyi ayırdı. Ve Asker(in sayısı) binbeşyüz idi. İçlerinde üçyüz atlı vardı. (Hz. Nebi atlı'ya iki yayaya bir hisse verdi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3016,
			"arabicnumber": 3016,
			"text": "ez-Zühri ile Abdullah b. Ebû Bekir ve Muhammed b. Mesleme'nin çocuklarının birinden (rivayet olunmuştur. Bu kimseler) dediler ki: (Hayber'de bulunan) bazı kaleler Hayber halkından (alınamamış onların elinde) kalmıştı. (Hayber halkı bu) kalelere sığınmışlardı (derken) Rasûlullah (s.a.v.) den kanlarını bağışlayarak kendilerini sürgün etmesini istediler (Hz. Nebi de öyle) yaptı. Bunu işiten Fedek halkı da bu şartlarla kalelerinden indiler. (Ve teslim oldular. Bunun üzerine Fedek arazisi) sadece Rasûlullah (s.a.v.)'e ait oldu. Çünkü (Müslümanlar, fethetmek için) oraya ne at ne de deve koşturmuşlardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3017,
			"arabicnumber": 3017,
			"text": "ez-Zühri’den rivayet olunduğuna göre; Said b. el-Müseyyeb o'na Rasûlullah (s.a.v.) Hayber'in bir kısmını savaş zoruyla fethetti\" demiştir. Ebû Dâvûd der ki: Harib b. Miskine ( aşağıdaki şu hadis) gözümün önünde okundu (ben) ibn Vehb size haber veriyor(um) ki Mâlik, İbnu Şihab'dan (naklen) bana (şöyle) dedi: \"Hayber'in bir kısmı harp zoruyla bir kısmı da barış yoluyla (fethedilmiş) idi. Kuteybe ise, içerisinde sulh yoluyla (fethedilmiş kısımlar bulunmakla) beraber ekserisi savaş zoruyla\" (fethedildi. Ben Malik*e \"el-Küteybe'(nin durumu) nasıldır? diye sordum. (Orası da) Hayber arazisi (içerisine dahil)dir. Hayber arazisi (içerisinde) kırk bin hurma ağacı\" (vardır) dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3018,
			"arabicnumber": 3018,
			"text": "İbn Şihab'dan demiştir ki: Bana erişti(ğine) göre, Hayber, savaş zoruyla fethedilmiş ve (yine) savaş sonunda Hayber halkından sürgün edilmek şartıyla (kalelerinden) inenler inmiş(savaş esnasında can verenlerse orada kalmış)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3019,
			"arabicnumber": 3019,
			"text": "İbn Şihab'dan demiştir ki: Rasûlullah, Hayber (ganimetlerin)in beşte birini (En-Am sûresinin kırk birinci âyetinde belirlenen hak sahiplerine vermek üzere,) ayırdı, kalan(ın yansın)ı da Hudeybiye mücahidlerinden (Hayber savaşında) bulunanlara ve bulunmayanlara paylaştırdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3020,
			"arabicnumber": 3020,
			"text": "Ömer (b. Hattab (r.a) dan (şöyle) dedi(ği) rivayet olunmuştur.) \"Müslümanların sonradan gelecek olan nesilleri (söz konusu) olmasaydı ben her fethettiğim köy'ü Rasûlullah (s.a.v.)'in Hayber'i paylaştırdığı gibi paylaştırırdım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3021,
			"arabicnumber": 3021,
			"text": "İbn-i Abbâs'dan demiştir ki: Fetih yılında Abbâs b. Abdulmuttalib, Mehrizzahran (denilen yer) de Ebû Süfyan b. Harb'i Rasûlullah (s.a.v.)'e getirmiş. (Ebû Süfyan da orada) müslüman olmuş. Bunun üzerine Hz. Abbâs, Hz. Nebi'ye: \"Ey Allah'ın Rasûlü, Ebû Süfyân şu (dünyalık) övünmeyi seven bir kişidir. Binaenaleyh O'na da (kendisiyle övünebileceği) bir şey versen\" (çok iyi olur.) demiş. (Bunun üzerine Hz. Nebi de) \"Evet. Ebû Süfyân'ın evine giren emniyettedir. (Kendi evine girip de) kapısını (üzerine) kapayan kimse de emniyettedir.\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3022,
			"arabicnumber": 3022,
			"text": "İbn-i Abbas'dan demiştir ki: Rasûlullah (s.a.v.) (ordusuyla beraber gecelemek üzere) Mehrizzahran (denilen yer) e inince, (kendi kendine) -Allah'a yemin olsun ki: Eğer Rasûlullah (s.a.v.) Mekkeli'ler kendisine gelip de emân istemelerinden önce Mekke'ye zorla girecek olursa, bu Kureyş'in helaki (olur)- dedim, Rasûlullah (s.a.v.)'ın katırı­nın üzerine oturdum ve (yine kendi kendine) \"Herhalde Mekke'ye giden (ve yolu buradan geçen) iş-güç sahibi birini bulurum da (Mekke'ye varınca) (Kureyşlilerin) Hz. Nebi (in karşısın)a çıkmaları ve ondan emân istemeleri için Rasûlullah (s.a.v.)'in (şu) durumunu onlara haber verir\" dedim. (Bu maksatla) yürüyordum ki birden bire Ebû Süfyan'la Budeyl b. Verka'nın ses(ler)ini işittim, ve “Ey Ebû'l-Hanzala ! diye seslendim. Sesimi hemen tanıdı ve: “Ebu'l-Fadl'mısın?\" dedi. \"Evet!\" cevabını verdim. \"Anam, babam sana feda olsun! Bu ne hal böyle?\" dedi (bende): “Bu, Rasûlullah (s.a.v.) ve (şu askerlerde ona tabi olan) insanlardır.\" dedim. (Bunların hücumundan kurtulmak için) \"Çâre ne nedir?\" diye sordu ve arkama bindi. Arkadaşı (ise Mekke'ye) dönüp gitti. Sabah olunca o'nu Rasûlullah (s.a.v.)'in huzuruna götürdüm. (Orada) müslüman oldu. (Ben de): \"Ey Allah'ın Rasûlu muhakkak ki Ebû Süfyân şu (dünyalık) övünmeyi seven bir kişidir. O'na da (övünebileceği) birşey ver!\" dedim. (Hz. Peygamber de): \"Evet Ebû Süfyân'ın evine giren emniyettedir, (kendi) Evini (n kapısını kendi) üzerine kapayan kimse de emniyettedir. Mescid'e giren emniyettedir\" buyurdu. Halk evlerine ve mescid'e (girmek üzere dağıldılar)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3023,
			"arabicnumber": 3023,
			"text": "Vehb. b. Münebbih'den demiştir ki: Cabir'e \"Fetih günü (gaziler) ganimet alarak birşey aldılar mı?! diye sordum da \"Hayır!\" (almadılar) diye cevap verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3024,
			"arabicnumber": 3024,
			"text": "Ebû Hureyre'den demiştir ki: Nebi (s.a.v.) Mekke'ye gir(meye karar ver) ince Zübeyr b. el-Avvâm ile Ebû Ubeyde b. Cerrah ve Halid b. Velid'i at üzerinde Mekke'ye gönderdi ve “Ey Ebû Hureyre! Ensâr'a seslen!\" (de toplansınlar) dedi. (Ben Ensar'ı çağırdım, bunun üzerine Ensar Hz. Nebi'nin huzurunda toplandılar. Hz. Nebi de onlara hitaben): \"Şu yol'u takib ediniz. Sizi (Kureyş'ten) hiçbir kimse görmesin. Görecek olursa onu öldürürsünüz\" dedi. (Mekke'ye girilince) birisi: \"Bu günden sonra artık Kureyş yoktur!\" diye bağırıverdi. Rasûlullah (s.a.v.) de: (Ebû Süfyân'ın) \"ev (in) e giren emniyettedir. Silâhı (nı elinden) atan emniyettedir.\" buyurdu. Kureyiş'in ileri gelenleri gidip Kâ'be'ye girdiler, Nebi (s.a.v.) Kâ'be'yi makamı (İbrahim'i)n arkasından (geçerek) tavaf etti\". Sonra (Kâ'be'nin) kapı(sı)nın sövelerini tuttu (Kureyş'in ileri gelenleri de Kâ'be'den) çıktılar ve Nebi (s.a.v.)'e İslâm üzere (kalacaklarına dair) biat ettiler. Ebû Dâvûd der ki; Ahmed b. Hanbel'e bir adam'ın Mekke harple mi (fethedildi?) diye sorduğunu işittim. (Ahmed b. Hanbel de ona); Her nasıl olursa sana zararı var mı? cevabını verdi. (Adam); Peki ya sulh (yoluyla mı alındı?) deyince \"Hayır\" karşılığını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3025,
			"arabicnumber": 3025,
			"text": "Vehb (ibn Münebbih)'den demiştir ki: Câbir'e Sakif (kabilesin)in durumunu sordum. Çünkü (onlar müslüman olduklarına dair Hz. Nebi'ye) biat etmişlerdi. Câbir de- (Onlar) Nebi (s.a.v.)'e kendilerine zekat ve cihâd (mükellefiyetlerinin) olmamasını şart koştular- cevabını verdi. (Câbir) daha sonra -Nebi (s.a.v.)i (onlar ileride tam manâsıyla) \"müslüman oldukları vakit (kendiliklerinden) zekat da verecekler cihâd da edecekler.\" derken işitmiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3026,
			"arabicnumber": 3026,
			"text": "Osman b. Ebi'l-As'dan demiştir ki: Sakif (kabilesin)in heyeti (müslümanlığı kabul etmek gayesiyle) Rasûlullah (s.a.v.)'e geldikleri vakit, (Nebi Efendimiz) onları kalplerinin daha da incelmesi (ve hassaslaşması) için mescide indirmiş. (Onlar müslümanlığı kabul edebilmeleri için) cihâdla öşürle ve namazla mükellef tutulmamalarını hz. Nebi'ye şart koşmuşlar. Rasûlullah (s.a.v.) de: \"Size (muvakkaten) cihâd'a çağrılmama ve öşür'den muaf tutulma (hakkı tanıyorum. Fakat) namaz bulunmayan dinde hayır yoktur.\" Bu bakımdan geçici olarak dahi olsa sizi namaz'dan muaf tutamam buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3027,
			"arabicnumber": 3027,
			"text": "Amir b. Şehr'den demiştir ki: Rasûluliah (s.a.v.) (bir Nebi olarak ortaya çıkınca (benim mensup olduğum, Yemen'deki) Hemdân (kavmi) bana: \"Sen bize bir öncü olarak şu (Nebi olduğu söylenen) adam'a gider misin? Eğer sen bizim için ondan hoşlanacak bir durum görürsen (gelip bize haber verirsin) onu(n Nebiliğini) biz de kabul ederiz. Fakat (onda) hoşlanmadığın bir durum görürsen, ondan bizde hoşlanmayız!\" dedi(ler). Ben de: \"Evet giderim\" dedim ve Rasûlullah (s.a.v.)'in huzuruna vardım. Ve (onun) dinini beğendim (gelip kavmime haber verdim) kavmim de müslüman oldu. (Bunun üzerine) Rasûlullah (s.a.v.) (orada bulunan) Umeyr Zû Merrân'a şu mektub'u yazdı... Malik b. Merare er-Rehavî'yi de tüm (Yemen halkına elçi olmak üzere) Yemen'e gönderdi, (onu gönderince) Akk Zû-Hayvan (isimli şahıs) da müslüman oludu. Akk (ismindeki bu zat)a \"Rasûlullah (s.a.v.)'e git de köyün ve malın için ondan bir emân al !\" denildi. (O da) bunun üzerine (yola çıkıp Hz. Nebi'ye) vardı. Rasûlullah (s.a.v.) de (şu mektubun) o'na yazıl(ıp verilmesini emretti: \"Bismillahirrahmanirrahim (ile başlarım) Allah'ın Rasûlü Muhammed'den Akk Zû Hayvan'a. Eğer (Akk Zû Hayvan isimli bu adam) toprağı, malı ve kölesi üzerindeki (hak iddiasında gerçekten) doğru söylüyorsa, emân ve Allah'ın zimmetiyle Rasûlü Muhammed'in zimmeti o'na aittir.\" ve (bu mektubu) Halid b. Said b. el-As yazdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3028,
			"arabicnumber": 3028,
			"text": "Ebyaz b. Hammal'dan (rivayet olunduğuna göre) Kendisi elçi olarak vardığı zaman Rasûlullah (s.a.v.)'le zekat hakkında konuşmuş da (Hz. Nebi): \"Ey Seba'nın kardeşi zekât (vermek) elbette lazımdır\" buyurmuş. Bunun üzerine Ebyaz: \"Ey Allah'ın Rasûlü! Biz pamuğu ektik. (Fakat bir süre sonra) Sebe (halkından herbiri bir tarafa) dağıldı gitti. Onlardan Mearibde bulunan az bir cemaatın dışında kimse kalmadı.\" demiş. Bunun üzerine Nebi (s.a.v.) Mearib'de Seba' (halkın)dan kalanlarla her sene (öşür olarak) meafir kumaşı kıymetinde bir kumaştan yetmiş takım elbise üzerinde anlaşma yaptı. Seba (halkı) Rasûlullah (s.a.v.) vefat edinceye kadar (bu elbiseleri vermeye) devam ettiler. Rasûlullah'ın vefatından sonra tahsildarlar Ebyaz b. Hammal'la Rasûlullah (s.a.v.) in yapmış oldukları (öşür olarak senelik) yetmiş elbise üzerindeki anlaşmayı (Yemen halkının) aleyhine (olacak şekilde) bozdular. Ebû Bekir (r.a) bunu (tekrar) Rasûlullah (s.a.v.)'in koymuş olduğu hâle çevirdi. (Bu hal) Ebû Bekir vefat edinceye kadar (devam etti) ölünce bu anlaşma bozuldu (ödenmesi gereken kıymet kitap ve sünnetle belirlenmiş olan) zekat (mikdarı) üzerinden (tesbit edilmiş) oldu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3029,
			"arabicnumber": 3029,
			"text": "İbn Abbâs'dan (rivayet olunduğuna göre), Nebi (s.a.v.) (vefatı esnasında) üç şey'i vasiyet ederek: \"Müşrikleri arap (yarım) adasından çıkarınız, gelen heyetlere benim yaptığım gibi ikramda bulununuz../' dedi. İbn-i Abbas dedi ki: \"üçüncüyü söylemedi -yahutta-onu (söyledi de) ben unuttum\" (Humeydi (nin) Süfyan'dan naklettiğine göre Süleyman \"Said üçüncüyü de söyledi mi, söylemedimi (pek iyi) hatırlayamıyorum\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3030,
			"arabicnumber": 3030,
			"text": "Ömer b. el-Hattab (r.a), Rasûlullah (s.a.v.)'ı şöyle buyururken işittiğini söylemiştir. \"Yahudileri ve Hıristiyanları Arap (yarım) adasından mutlaka çıkaracağım. Orada müslümandan başka birisini bırakmayacağım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3031,
			"arabicnumber": 3031,
			"text": "Hz. Ömer'den demiştir ki: Rasûlüllah (s.a.v.) (şöyle) buyurdu. (Hz. Ömer bu rivayetinde aynen bir önceki 3030. hadisin) manâsını (rivayet etti. Ancak) bir önceki (hadis) daha uzundur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3032,
			"arabicnumber": 3032,
			"text": "İbn Abbâs'dan demiştir ki: Rasûlullah (s.a.v.) \" Bir ülkede iki kıble olamaz\" buyurdu. Ayrıca, bu hadis'i Tirmizi, zekat, Ahmed b. Hanbel 1-223, 285. de tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3033,
			"arabicnumber": 3033,
			"text": "Said b. Abdulaziz dedi ki: Arap (yarım) adası (bir taraftan) vadi (el-kura ile) Yemenin sonuna (diğer taraftan da) Irak sınırından denize (kadar uzanan yerlerin) arasıdır. Dâvûdder ki: Mâlik (şöyle) dedi: Ömer (radıyallahü anh) Necran halkım (Necran'dan) sürgün etti. (Teyma halkı ise) Teyma'dar? sürgün edilmediler. Çünkü Teyma Arap ülkelerinden değildir. Vad-i el-Kura (ya gelince Hazret-i Ömer) orada bulunan yahudileri sürgün etmedi. Zira (ashab-ı kiram) orayı Arap topraklarından saymıyorlardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3034,
			"arabicnumber": 3034,
			"text": "(yine İmam) Malik, dedi ki: Hz. Ömer gerçekten Necran ve Fedek yahudilerini (Necran ve Fedek'ten) sürüp çıkardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3035,
			"arabicnumber": 3035,
			"text": "Ebû Hureyre'den demiştir ki: Rasûlüllah (Sallallahu aleyhi ve Sellem): \"Irak; kafîzini ve dirhemini, Şam; Müddünü ve dinarını, Mısır'da; irdebbini ve dinarını vermeyecektir. Sonra başladığınız yere döneceksiniz\" buyurdu. (Şeyhim Ahmed b. Abdullah b. Yunus dedi ki: Bu hadisi bana nakleden) Züheyr son cümleyi üç defa tekrarladı- (Ebû Hureyre sözlerini şöyle bitirdi) \"Buna Ebû Hureyre'nin eti ve kanı da şahiddir.\" Diğer tahric: Müslim (2896) ve Müsned (28421) rivayet ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3036,
			"arabicnumber": 3036,
			"text": "Ebü Hureyre Rasûlullah (s.a.v.)'in (şöyle) buyurduğunu haber vermiştir: \"Herhangi bir memleket'e varır da orada ikamet ederseniz, hisseniz oradadır. Hangi belde de Allah'a ve Rasûlüne isyan ederse o beldenin beştebiri Allah'a ve Nebi'ye aittir. Sonra o (geri kalanı da) sizindir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3037,
			"arabicnumber": 3037,
			"text": "Osman b. Ebû Süleyman'dan (rivayet olunduğuna göre); Nebi (s.a.v.) (Tebük savaşından sonra) Halid b. Velid'i Devmet (-ül-Cendel)de (bulunan) Ukeydir üzerine göndermiş (Hz. Halid'le emrindeki müslümanlar tarafından) yakalanmış ve (o'nu Hz. Peygamber'in huzuruna) getirmişler, (Hz. Nebi de) onun kanını bağışlamış ve cizye (vermesi) şartıyla onunla anlaşmış",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3038,
			"arabicnumber": 3038,
			"text": "Muaz (r.a) den (rivayet olunduğuna göre) Nebi (s.a.v.) kendisini Yemen'e vali olarak gönderince, buluğ çağına gelmiş olan her erkekten (cizye olarak) bir dinar, yahutta Yemen'deki meafir denilen kumaştan bir dinar değerinde -bir elbise- almasını emretmiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3039,
			"arabicnumber": 3039,
			"text": "(Bir önceki 3038. hadisin aynısı) Hz. Muaz'dan birde Mesruk kanalıyla (rivayet olunmuştur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3040,
			"arabicnumber": 3040,
			"text": "Ziyâd b. Hudayr'dan (rivayet olunduğuna göre) Ali (r.a) (şöyle) demiştir. Ömrüm olursa Tağlib oğulları (denilen) Hristiyanlarla mutlaka savaşacağım ve çoluk çocuklarını esir edeceğim çünkü ben Rasûlullah'la onlar arasında çocuklarını hıristiyanlaştırmayacaklarına dair ahidname yazmıştım. (Onlar bu ahdi bozdular) Ebû Dâvud der ki: Bu hadis münkerdir. Bana erişen haber'e göre Ahmed (b. Hanbel)de bu hadisi münker sayarmış. Bazılarına göre bu hadis metruk hadise benzemektedir. (Bu sebeple) bu hadisi Abdurrahman b. Hani'nin rivayet etmesinin mümkün olamayacağını söylediler. (Ebû Dâyud'un talebesi) Ebû Ali der ki: Ebû Dâvud (bana bu Sünen'i) ikinci defa arz edişinde bu hadisi okumadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3041,
			"arabicnumber": 3041,
			"text": "İbn Ahbâs'dan demiştir ki: Rasûlullah (s.a.v.) Necrân halkı ile (her sene) müslümanlara (cizye olarak) yarısını Safer ayında kalanını da Recep ayında ikiyüz (takım) elbise ödemeleri ve Yemen'de (müslümanlara) ihanet için düzenlenmiş bir harbin çıkması halinde de emanet olarak, otuz zırh, otuz at, otuz deve ve her çeşit silahdan otuz silahı emanet olarak vermeleri ve müslümanların bu silahları onlara geri verinceye kadar (bu silahların değerini) onlara borçlu olmaları (harp'ten sonra da) Necrânlılar'a geri vermeleri, buna karşılıkta (Necrânlılar'ın) bir hadis'e çıkarmadıkları yahutta faiz yemedikleri müddetçe kiliselerinin yıkılmayacağı, din alimlerinin (memleketlerinden) sürülüp çıkarılmayacağı şartıyla bir sulh (antlaşması) yaptı. (Râvi) İsmail (İbn Abdurrahman-el-Kureşi şu sözleri de) rivayet etti. \"Fakat (Necrân halkı) faiz yediler. Ebû Dâvud der ki (Necrân halkı) ileri sürülen şartların bazılarını bozunca bir hâdise çıkarmış duruma düştüler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3042,
			"arabicnumber": 3042,
			"text": "İbn Abbas'dan (şöyle) dedi(ği rivayet olunmuştur:) Fars halkı (kitap ehli idi.) Nebileri vefat edince İblis onlara din olarak mecûsiliği kabul ettirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3043,
			"arabicnumber": 3043,
			"text": "Bççâle (îbn Abede et-Temimi-el-Anberi el-Basrî) dedi ki: Ben, el Ahnef b. Kays'ın amcası Cez b. Muâviye'nin katibi idim (O'na) ölümünden bir yıl önce, Hz. Ömer'in bir mektubu geldi. (Bu mektupta): \"Her sihirbazı öldürünüz mecusilerden kendisine nikah düşmeyen birisiyle evlenmiş olan her çifti biri birinden ayırınız ve onları (yemeğe başlarken) fısıltı ile söyledikleri sözü söylemekten men ediniz\" (diye yazılıydı). Bunun üzerine biz, bir günde üç sihirbaz öldürdük ve mecusîlerden Allah'ın kitabına göre kendisine haram olanlarla evli olan her erkeği (eşinden) ayırdık. (Cez' b. Muaviye) bolca yemek hazırlayıp mecusileri davet etti. Ve kılıcı da enine olmak üzere uyluğunun üzerine koydu. (Geldiler) fısıltı halinde söylemekte oldukları sözü söylemeden (yemeği) yediler: (Yemekten sonra eski adetlerini ifâ etmelerine izin verilmesi ümidiyle Cez b. Muaviye'nin önüne) bir veya iki katır yükü gümüş (çöp) attılar. Abdurrahman b. Avf'ın Rasûlullah (s.a.v.) Hecer mecûsilerinden cizye aldı. diye şahitlik etmesine kadar Hz. Ömer mecûsilerden cizye almıyordu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3044,
			"arabicnumber": 3044,
			"text": "İbn Abbas'dan demiştir: Bahreyn'den ve Elesbez şehri halkından ve Hecer mecûsilerinden olan bir adam Rasûlullah (s.a.v.)'e geldi. (Yanında bir süre durduktan) sonra çıktı. Kendisine \"Rasûlullah (s.a.v.) sizin hakkınızda hangi hükmü verdi?\" diye sordum. “Şer\" (li bir hüküm) cevabını verdi. (Ben de o'na:) \"Sus!\" dedim. (Bunun üzerine) \"İslâm ya da ölüm\" (bunlardan birini seçmemize hükmetti) diye cevap verdi. (İbn Abbas sözlerine devam ederek şöyle) dedi: \"Abdurrahman b. Avf (Rasûlullah (s.a.v.)'in mecûsilerden cizyeyi kabul etti (ğini) söyledi. Halk da Abdurrahman'ın (bu) sözüne sarılıp benim Esbezli (kişi)'den işittiğim (hadisin hükmünü) bıraktılar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3045,
			"arabicnumber": 3045,
			"text": "Urve b. ez-Zübeyr'den (rivayet olunduğuna göre), Hişam b. Hakim (b. Hizam) Hımıs'ta iken acem fellahlarından bir takım insanları cizye ödemek için güneşte tutan bir adam bulmuşda: \"Bu da ne?\" diye sormuş ve ben Rasûlullah (s.a.v.)'i \"Şüphesiz ki aziz ve Celil olan Allah dünyada insanlara işkence yapan kimselere azab eder.\" derken işittim demiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3046,
			"arabicnumber": 3046,
			"text": "Harb b. Ubeydullah'(ın anne cihetinden dedesi olan şahsın) babasından (şöyle) dedi(ği rivayet olunmuştur). Rasûlullah (s.a.v.) (şöyle) buyurmuştur: \" Ondabir vergiler ancak yahudiler ve Hıristiyanlar üzerinedir. Müslümanlar üzerinde ondabir vergi yoktur.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3047,
			"arabicnumber": 3047,
			"text": "Harb b. Ubeydullah, (birde, bir önceki 3046. hadisin) manâsını Nebi (s.a.v.)'den (rivayet etmiştir. Ancak bu rivayetinde) \"ondabir vergiler\" kelimesi yerine haraç kelimesini rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3048,
			"arabicnumber": 3048,
			"text": "Bekr b. Vail (kabilesin)deri bir adam'ın dayısından (şöyle) dedi(ği rivayet edilmiştir. Ben Rasûlullah (s.a.v.)'e “Ey Allah'ın Rasûlü! Kavmimden ondabir vergi toplayayım mı?\" diye sordum da: \"Ondabir vergiler, ancak yahudiler ve hırıstıyanlar üzerinedir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3049,
			"arabicnumber": 3049,
			"text": "Harb b. Ubeydillah b. Umeyr es-Sakafi'nin Tağlib oğullarından olan dedesinden (şöyle) dedi(ği rivayet olunmuştur.) Nebi (s.a.v.)'e gelip selam verdim, bana İslâm'ı ve kavmimden müslüman olanlardan zekatı nasıl toplayacağımı öğretti. (Yanım'dan ayrıldıktan) sonra (tekrar) kendisine dönüp. “Ey Allah'ın Rasûlü! Ben zekatın dışında bana öğrettiklerinin hepsini iyice belledim. Kavmimden müslüman olanlardan ondabir vergi de toplayayım mı?\" diye sordum. \"Hayır onda bir vergi ancak hıristiyanlar ve yahudiler üzerinedir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3050,
			"arabicnumber": 3050,
			"text": "İrbad b. Sariye es-Sülemi'den demiştir ki: Nebi (S.A.V.) le birlikte Hayber'e inmiştik. Yanında da ashabından (o gün) beraberinde bulunan kimseler vardı. Hayber'in başkanı inatçı ve kurnaz bir adamdı. Nebi (s.a.v.)'e dönerek \"Ey Muhammed sizin, bizim eşeklerimizi kesmeniz, meyvelerimizi yemeniz ve kadınlarımıza saldırmanız caiz midir?\" dedi. Bunun üzerine Nebi (s.a.v.) öfkelenip: “Ey Avf'ın oğlu atına bin ve -Haberiniz olsun! Cennet (e girmek) mu'min'den başkasına helal değildir. Namaz için toplanınız- diye haykır.\" buyurdu. (Avf'ın oğlu da bu emri yerine getirdi). Bunun üzerine (ashab-ı kiram bu da'vet'e uyarak) toplandılar. Nebi (s.a.v.) onlara (imam olup) namazı kıldırdı. (Namaz kılındıktan) sonra ayağa kalkıp: \"Sizden biriniz koltuğuna yaslanarak Allah'ın şu Kur'ân'daki yasakladığı şeylerden başka hiç bir şeyi yasaklamadığını mı zannediyor? Şunu iyi bilin ki: Vallahi ben (hem) öğüt verdim (hem bazı şeyleri) emrettim, (bazı şeyleri de) yasakladım. (Benim emrettiğim ve yasakladığım bu) şeyler Kur'ân (daki yasaklar) kadar vardır. Yahutta ondan daha fazladır. Yüce Allah sizin izinsiz olarak kitap ehlinin evlerine girmenizi helal kılmadığı gibi üzerlerinde olan vergiyi ödedikleri zaman karılarına saldırmanızı ve meyvelerinizi yemenizi de helal kılmadı\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3051,
			"arabicnumber": 3051,
			"text": "Cüheyne (kabilesin) den (ve Hz. Nebi'nin sahabilerinden olan) bir adamdan (rivayet olunmuştur.) Dedi ki: Rasûlullah (s.a.v.j (şöyle) buyurdu: \"Muhakkak kî siz bir kavimle savaşacak ve onlara galib geleceksiniz, canlarını ve çocuklarını siz'e karşr mallarıyla korumaya çalışacaklar. (Bu hadisin diğer ravisi) Said (İbn Mansur ise rivayetinde Müsedded'den fazla olarak şunları da) söyledi -sizinle bir anlaşma üzerinde barış yaparlar- (bu cümle'den sonra her iki ravide rivayetlerinde) birleş(ip Hz. Nebi'nin sözlerine devamle şöyle de)diler. Onlardan bu anlaşma (da belirlenen vergi mikdarın) dan fazla birşey almayınız. Bu size yakışmaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3052,
			"arabicnumber": 3052,
			"text": "Rasûlullah (s.a.v.)'in sahabilerinden bir cemaat akraba olan babalarından Rasûlullah (s.a.v.)'in (şöyle) buyurduğunu (rivayet ettiler) \"Dikkatli olun. Kim bir zımmî'ye zulm ederse yahut onu(n hakkını) kısarsa, veya o'na gücünün yetmiyeceği bir vergi yüklerse, ya da gönülsüz olarak ondan birşey alırsa, kıyamet gününde onun hasmı benim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3053,
			"arabicnumber": 3053,
			"text": "İbn Abbâs'dan demiştir ki: Rasûlüllah (s.a.v.) \"Müslüman'a cizye yoktur\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3054,
			"arabicnumber": 3054,
			"text": "Muhammed b. Kesir dedi ki: Süfyan'a şu (bir önceki 3053. ) hadis'in tefsîri soruldu da (bir zımmî) \"müslüman olunca o'na cizye (vermesi) gerekmez\" cevabını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3055,
			"arabicnumber": 3055,
			"text": "Abdullah el-Hevzenî dedi ki: Rasûlüllah (s.a.v.)'in müezzini Bilal'Ie Haleb'de karşılaştım da \"Ey Bilal! Rasûlullah (s.a.v.)'in geçimi nasıldı bana anlat\" dedim. (Şöyle) cevab verdi: \"Yüce Allah'ın onu (Nebi olarak) gönderdiği günden beri nesi varsa, onları kendisi hesabına harcama yetkisi bana aitti. (Bu yetki bende) Rasûlullah (s.a.v.)'in vefatına kadar (devam etti) Kendisine bir müslüman gelirde o'nu(n) çıplak (olduğunu) görürse -git borç para bulda (onunla) şu adam'a bir elbise alıp giydir ve kendisini doyur- diye bana emir verirdi. Hatta (bir defasında) müşriklerden biri karşıma gelip \"Ey Bilal benim imkanım vardır. Benden başka kimse'den borç isteme\" dedi. Bende (öyle) yaptım (yine) bir gün abdest almış namaz için ezan okumak üzere kalkmıştım. Bir de baktım ki, o müşrik tacirlerden oluşan bir cemaat içersinde (bana doğru) yönelmiş (geliyor) Beni görünce: \"Ey Habeş'li\" diye seslendi. Ben de \"Buyurun!\" diye cevap verdim. Beni asık bir suratla karşıladı ve bana ağır bir söz sarfedip \"Seninle ay(ın sonu) arasında kaç (gün) kaldı biliyor musun?\" dedi Bende: (Ayın sonu): \"Yakındır\" dedim. \"Seninle onun arasında dört (gün) var. (Ayın sonu gelince seni) üzerindeki borca karşılık yakalayıp (köle olarak) göndereceğim. Daha önceki gibi yine davar güdeceksin insanların içini kaplayan (üzüntü o anda benim de) içimi kapladı. Nihayet yatsı namazını kıldım, Rasûlullah (s.a.v.) ailesinin yanına döndü. Yanına (girmek için) izin istedim, izin verdi. (Yanına girince): \"Ey Allah'ın Rasûlü anam ve babam sana feda olsun, kendisinden borç almış olduğum bir müşrik bana şöyle şöyle söyledi. Bunu benim hesabıma ödeyecek senin yanında da benim yanımda da bir mal yok. bu işse benim kepaze bir duruma düşmem demektir. Binaenaleyh Allah'ın, Rasûlüne (s.a.v.) benim borcumu ödeyecek (kadar) bir mal ihsan etmesine kadar şu müslüman olmuş kabilelerden birine kaçmama izin ver!\" dedim. Ve (yanından) çıktım. Nihayet evime geldim. Kılıcımı, (kılıcımla kınını içerisine koyduğum) torbamı, ayakkabılarımı ve kalkan»mi (alıp ertesi gün çıkacağım yolculukta yanımda götürmek üzere) yanıbaşıma koydum. Nihayet (fecr-i sadık denilen) ilk sabah'ın dikey (aydınlığı) doğunca artık yola çıkmaya karar vermiştim. Bir de baktım ki: Bir adam “Ey Bilal! Rasûlullah (s.a.v.) seni çağırıyor\" diye (bana doğru) koşuor. Bunun üzerine yola düşüp Rasûlullah (s.a.v.)'e vardım ve (orada) yükleri üzerinde çöktürülmüş, dört deve gördüm. (Konuşmak için) izin istedim, Rasûlullah (s.a.v.): \"Müjde yüce Allah sana borcunu ödeyecek imkânı gönderdi\" dedi. sonra \"çöktürülmüş dört deveyi görmedin mi?\" dedi. Bende: \"Evet\" cevabını verdim. Bunun üzerine \"Onların da, üzerlerindekilerde senindir. Üzerlerinde giyecek ve yiyecek var. Onları bana Fedek başkanı hediye etti. (Şimdi) onları al ve borcunu öde!\" buyurdu. Bende öyle yaptım. (Hz. Bilal sözlerine devam ederek) hadisi(n geri kalan kısmını şöyle) anlattı. (Bir süre) \"sonra mescid'e gittim. Birde baktım Rasûlullah (s.a.v.) mescidde oturuyor. Kendisine selam verdim: \"Üzerindeki (borç) ne oldu?\" dedi \"Yüce Allah, Rasûlullah (s.a.v.)'in üzerinde bulunan herşeyi ödedi, (ödenmedik) bir şey kalmadı\" cevabını verdim. (Gelen mallardan borç ödendikten sonra) \"Bir şey arttı mı?\" diye sordu. \"Evet\" dedim. \"Beni on(u elimizde tutmanın sıkıntısın)dan kurtarmaya bak. Çünkü sen beni bundan kurtarıncaya kadar aile halkımdan hiçbirinin yanına giremem\" buyurdu. Rasûlullah (s.a.v.) yatsı namazını kılınca beni çağırdı ve: \"Yanındaki mal ne oldu?\" diye sordu. Ben de \"O, (hala) yanımdadır. Çünkü yanıma o'nu kendisine verebileceğim ihtiyaç sahibi) bir kimse gelmedi\" dedim. Rasûlullah (s.a.v.)de geceyi mescidde geçirdi. \"Evine gitmedi\" Hz. Bilal sözlerine devam ederek) hadisi(n kalan kısmını şöyle) anlattı. Ertesi gün yatsı namazını kılınca beni (yine) çağırdı \"Yanındaki mal ne oldu?\" diye sordu. Ben de: “Ey Allah'ın Rasûlü Allah seni on(un sıkıntısın)dan kurtardı.' dedini. Bunun üzerine bu mal yanında iken kendisine ölümün yetişmesi korkusundan (kurtulmasından) dolayı \"Allahu ekber Elhamdu­lillah!\" dedi. Sonra (oradan uzaklaştı) Bende kendisini takibe koyuldum. Nihayet hanımlarının yanına varıp her birine ayrı ayrı selam verdi ve yatağına vardı. İşte senin (benden) sorduğun (Rasûl-i Ekrem'in nafakası) bundan ibarettir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3056,
			"arabicnumber": 3056,
			"text": "(Bir önceki 3055.) Ebû Tevbe hadîsi manâ olarak ve yine aynı senetle bir de Hz. Muaviye'den (rivayet olunmuştur. Şu farkla ki bir önceki hadiste geçen -Allah'ın Rasûlüne)- benim borcumu ödeyecek...\" (kadar bir mal ihsan etmesine kadar) sözünün yanında (Hz. Bilal'ın) \"Rasûlullah (s.a.v.) benim bu isteğime sükutla cevap verdi. Ben de sükuttan pek memnun kalmamıştım.\" dedi(ği rivayeti de yer almaktadır)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3057,
			"arabicnumber": 3057,
			"text": "Iyâd b. Hımâr'dan demiştir ki: Nebi (s.a.v.)'e bir deve hediye et(mek iste)miştim. Bunun üzerine (bana): \"Sen müslüman oldun mu?\" diye sordu. Ben: \"Hayır\" cevabını verdim. Nebi (s.a.v.) de: \"Ben müşriklerin bağışlarını kabul) den men edildim\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3058,
			"arabicnumber": 3058,
			"text": "Alkame b. Vâil(in, babasından rivayet olduğuna göre) Nebi (s.a.v.) Hadramevt'te bulunan bir araziyi parselleyerek kendisine vermiştir. Ayrıca bu hadis'i Tirmizi, ahkâm, Ahmed b. Hanbel VI-399. da da tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "(Bir önceki 3058. hadisin) bir benzeri de aynı senetle (yine) Alkame'den (rivayet olunmuştur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3060,
			"arabicnumber": 3060,
			"text": "Amr. b. Hureys'den demiştir ki: Rasûlullah (s.a.v.) (elindeki) yayla bana Medine'de bir ev (yeri) çizdi ve: \"Sana daha da vereceğim, sana daha da fazlasını vereceğim\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3061,
			"arabicnumber": 3061,
			"text": "Rabia b. Ebî Abdurrahman bir'den fazla kimselerden (rivayet olunduğuna göre) Rasûlullah (s.a.v.) Für'(denilen yer)in nahiyelerinden (biri olan) Kabeliyye (nahiyesi)nin madenlerini Bilâl b. el-Hâris el-Müzeni'ye bağışlamıştır. Bu madenlerden bugün'e kadar zekâtın dışında hiçbir (vergi) alınmıyor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3062,
			"arabicnumber": 3062,
			"text": "Kesir b. Abdillah b. Amr b. Avf in (dedesi Amr)den (rivayet ettiğine göre): Nebi (s.a.v.) el-Kabeliyye (denilen nahiye)nin madenlerini deresiyle tepesiyle Bilal b. el-Haris el-Müzeni'ye bağışlamıştır. (Bu hadisi) Abbâs'ın dışında bir râvi de -(şöyle) rivayet etti- (Hz. Nebi el-Kabeliyye'nin madenlerini) deresiyle tepesiyle (Bilal'e verdi.) Ayrıca (o'na) Kuds (denilen dağ)dan ziraat'e elverişli olan yerleri de (verdi. Fakat bunları verirken) o'na hiçbir müslümanın hakkını vermedi. (Bir de) o'na -Bismilllahirrahmanirrahim şu Allah'ın Rasûlü Muhammed'in, Bilal b. Haris el-Mu'zeni'ye verdiği (yerleri bildiren bir vesikadır. el-Kabeliyye (isimli nahiye)yi deresiyle tepesiyle o'na bağışlamıştır.- (Bu olayı) Bir başkasıda (şöyle) rivayet etti. (Hz. Nebi el-Kabeliyye'nin madenlerini) deresiyle tepesiyle (Bilal'e verdi) Ayrıca (O'na) Kuds (denilen dağ)dan ziraate elverişli olan yerleri verdi. Fakat bunları verirken o'na hiç bir müslüman'ın hakkını vermedi- (Bu hadisin) bir benzerinide Ebu Uveys, Edeyi b. Bekr b. Kinane oğullarının azatlı kölesi Sevr b. Zeyd ve îkrime kanalıyla ibn Abbâs'dan rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3063,
			"arabicnumber": 3063,
			"text": "(Kesir b. Abdillah b. Amr b. Avf'ın) dedesinden (rivayet olunduğuna göre) Nebi (s.a.v.) el-Kabeliyye (denilen nahiye)nin madenlerini deresiyle tepesiyle Bilal b. el-Haris el-Müzeni'ye bağışladı. (Râvi b. en-Nadr bu hadis'e ilave olarak şunları da) rivayet etti. -(Hz. Nebi ona oranın) Cers (denilen bir çeşit arazi)si ile Zatü'n-nüsub (isimli araziy)i de (bağışladı. Hadisin bundan) sonra (ki kısmında îbrahim el-Humeyni, Hüseyin b. Muhammed isimli râviler rivayetlerinde) birleş(erek şöylede) dediler. \"Kuds (denilen dağ)dan ziraate elverişli olan kısımları da (o'na bağışladı)- (Fakat bunları verirken) o'na hiçbir müslümanın hakkını vermedi. Ebu Uveyş dedi ki: Sevr b. Zeyd, İkrime ve îbn Abbas zinciriyle bana (bir önceki hadisin) aynısını nakletti. İbn Nadr (Bu hadise şunları da) ilave etti. (Hz. Nebi'nin buraları Hz. Bilal İbn el-Haris'e bağışladığını tescil eden belgeyi) Ubeyy b. Ka'b yazdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3064,
			"arabicnumber": 3064,
			"text": "Ebyaz b. Hammel'den (rivayet olunduğuna göre) Kendisi Rasûlullah (s.a.v.)'e gelmiş ve (ondan) tuzlayı, kendisine bağışlamasını istemiş İbn Mütevekkil (burasını) Mearib deki tuzla diye rivayet etti. (Hz. Nebi de) tuzlayı ona bağışlamış (Ebyaz dönüp gidince) meclisden bir adam \"Ona neyi bağışladın biliyor musun? hazır ve kesilmeyen suyu bağışladın!” demiş, Bunun üzerine (o tuzlayı) Ebyaz'dan geri almış (Ebyaz bu defa) Hz. Nebiden erak ağaçlarından oluşan Ma'mur arazinin kendisine bağışlanmasını istemiş (Hz. Nebi de) deve) ayakların(ın) erişmediği yerleri\" (verebilirim) buyurmuş İbn Mütevekkil (ise bu kısmı) \"deve ayakları\" (nın değmediği uzak yerler şeklinde) rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3065,
			"arabicnumber": 3065,
			"text": "Muhammed b. el-Hasen el-Mahzumî (bir önceki 3064. hadisi şöyle) rivayet etti. (Ben sana) deve ayaklarının erişemediği yerleri (ikta yoluyla verebilirim. Hz. Nebi bu sözüyle) demek istiyor ki: Develer başlarının erişebildiği yerler(dek)i (otları) yerler. Başlarının yukarısı mahfuz kalır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3066,
			"arabicnumber": 3066,
			"text": "Ebyâz b. Hammardan (rivayet olunduğuna göre). Kendisi Rasûlullah (s.a.v.)den erak (denilen misvak ağaçlarının hükmünü sormuş Rasûlullah (s.a.v.): \"Erak (ağaçların) da özel mülkiyet olamaz\" buyurmuş. Bunun üzerine (Ebyâz b. Hammal) “Özel mülkiyet sınırların içerisinde bulunan erak ağacı\" (nın hükmünü soruyorum) demiş. Nebi (s.a.v.)de (tekrar) \"Erak (ağaçların)da özel mülkiyet olamaz\" buyurmuş. (Râvi) Ferac (b. Said bu hadisle ilgili olarak) dedi ki: (Ebyâz) \"Özel mülkiyet sınırlarım içerisinde kalan\" (sözü) ile \"etrafı çevrili ve ekili toprağı ifade etmek istemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3067,
			"arabicnumber": 3067,
			"text": "Sahr'den (rivayet olunduğuna göre), Rasûlullah (s.a.v.) savaş için Sakıf (kabilesi) üzerine yürümüş, Sahr (r.a) bunu işitince, Peygamber (s.a.v.)'e yardım etmek için atına bin(ip bir süvari topluluğu ile birlikte yol'a çık)mıştı (fakat) Nebi (s.a.v.)'in (Taifî) fethedemeden dönüp gitmiş olduğunu gördü ve o gün (Sakiflılar) Rasûlullah (s.a.v.)'in hükmüne boyun eğmedikçe (onların sığındıkları) şu şatodan ayrılmayacağına dair Allah'a söz verdi. Gerçekten de Hz. Sahr, Onlar, Rasûlullah (s.a.v.)in hükmünü kabul edinceye kadar onlarla savaşı bırakmadı. (Onlar Hz. Nebi'nin hükmünü kabul'e yanaşınca) Hz. Sahr Peygamber (s.a.v.)'e (şöyle bir) mektup yazdı. \"Gelelim mevzuya, Ey Allah'ın Rasûlü Sakif (kabilesi) sen'in hükmünü kabul etti. Şimdi ben onların karşısında bulunuyorum onlarda at üzerinde\" (karşımda duruyorlar) Rasûlullah (s.a.v.) (mektubu alır almaz) namaz'ın cemaatle kılınmasını emretti ve (cemaat namaz için toplanınca Hz. Sahr'in bu) kahraman (kabilesi) için \"Ey Allah'ım bu kavm'in atlısına, yayasına bereket ihsan eyle!'' diye on (defa) dua etti. (Bir süre sonra) Sakif kabilesi Hz. Nebi'nin huzuruna geldi. (İçlerinden) El-Muğire b. Şu'be söz aldı ve \"Ey Allah'ın Rasûlü Sahr, halamı esir aldı. Oysa müslümanların girdiği dine halam da girmişti/' dedi. Bunun üzerine Rasûlullah (s.a.v.) Sahr'ı çağırıp O'na \"Ey Sahr ! Bir kavim miislümanlığa girdiği zaman kanlarını ve mallarını güvence altına almış olurlar. Binaenaleyh sen Muğıre'ye halasını geri ver\" buyurdu. Sahr'da (halasını) o'na iade etti. Ve (söz alıp) Nebi (s.a.v.)'den Süleym oğullarının İslâm'dan kaçarken bırakıp gittikleri su'yu istedi: “Ey Allah'ın Nebisi bu su'yu benim ve kavmimin hürmetine ver!\" dedi (Hz. Nebi de) \"Evet\" (bu su'yu siz'e veriyorum) dedi ve (su'yu) onlara verdi. Bunun üzerine Sûleym kabilesi de müslüman olup Hz. Sahr'ın yanına geldiler ve ondan su'yu kendilerine geri vermesini istediler. (Sahr, bu su'yu kendilerine vermekten) kaçınınca Nebi (s.a.v.)'e varıp: “Ey Allah'ın Nebisi müslüman olduk ve suyumuzu bize geri vermesi için Sahr'a vardık (fakat o bu'na) yanaşmadı.\" diye şikâyette bulundular. (Hz. Nebi de) Sahr'ı çağırıp \"Ey Sahr! Bir kavim müslümanlığı kabul ettiği zaman, mallarını ve kanlarını güvence altı a almış olurlar. Binaenaleyh sen bu kavm'e sularını geri ver\" buyurdu. (Sahr da) \"Başüstüne Ey Allah'ın Nebi'i\" karşılığını verdi. Ben (bu sırada) Rasûlullah (s.a.v.)'in Hz. Sahr'dan Cariyeyi ve su'yu geri almadan (duyduğu) utançtan dolayı yüzünün kızardığını gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3068,
			"arabicnumber": 3068,
			"text": "Sebre b. Abdülaziz b. er-Rabî' el-Cühenî'nin dedesinden (rivayet olunduğuna göre), Nebi (s.a.v.) (Tebük seferine çıkarken ilk defa bu günkü Zû huşub vadisindeki) devme ağacının altında bulunan mescid'in yerine inmiş, orada üç gün kaldıktan sonra Tebük'e (doğru yol'a) çıkmış ve geniş bir arazide kendisine katılan Cüheyne' kabilesine \"Zül merve halkı kimlerdir?\" diye sormuş (Cüheyne'lilerin) \"onlar Cüheyne kabilesinden Rifââ oğullarıdır'' demeleri üzerine \"Zûl-merve köyünü \"onlara verdim” buyurmuş. Bunun üzerine (Zül merve) köylüleri orayı (kendi aralarında) bölüşmüşler. Onlardan kimisi (hissesini) satmış kimisi de (elinde) tutup işletmiş. (Ravi İbn Vehb sözlerine şöyle devam etti.) Sonra ben bu hadisi (Sebre'nın babası) Abdulaziz'e sordum, bana bir kısmını haber verdi. (Fakat) hepsini haber vermedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3069,
			"arabicnumber": 3069,
			"text": "Esma bint Ebû Bekir'den (rivayet olunduğuna göre) Rasûlullah (s.a.v.) Hz. Zübeyr'e bir hurmalık vermiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3070,
			"arabicnumber": 3070,
			"text": "Safiyye bint Uleybe ile Duheybe bint Uleybe'nin haber verdiklerine göre, babalarının ninesi olan, Kayle bint Mahreme kendilerine (şöyle) demiştir: \"Rasûlullah (s.a.v.)'in yanına gelmiştik. Bekr b. Vail (oğulların)ın elçisi (olan) arkadaşım Hureys b. Hassan öne geçip îslârniyet(e bağlı kalmak üzere) kendi ve kavmi adına Rasûlullah (s.a.v.)'e biat etti. Sonra \"Ey Allah'ın Rasûlü! Bizimle Temim oğulları arasında Dehna (mevkii) hakkında (yani) onlardan yolcuların ya da (oradan mecburen) geçenlerin dışında hiçbir kimsenin oraya girmeyeceğine dair (bir belge) yaz\" (ılmasım emret) dedi. Bunun üzerine Hz. Nebi katiplerinden birisine emr edip \"Ey Oğul! Hureys için Dehna hakkında (bir belge) yaz\" dedi. Ben (Hz. Nebi'in) Dehna hakkında Hureys'(in arzusuna uygun bir şekilde idare edilmesi) için emrettiğini görünce, oranın kendi memleketim ve ülkem olması cihetiyle beni bir üzüntü kapladı bunun üzerine \"Ey Allah'ın Rasûlü o sen'den istediği zaman (bu) yerlerden adaletli bir istekte bulunmadı, işte bu Dehna senin yakınında bulunuyor, (orası) Develerin ve koyunların merasıdır. Temim oğullarının kadınları ve oğulları da hemen o'nun arkasındadır\" Deyiverdim. (Hz. Peygamber de) \"Ey oğul! (bu anlaşma metnini yazmaktan) vazgeç (çünkü bu) kadıncağız doğru söyledi, müslüman müslüman'ın kardeşidir. Dehna'da (bulunan) su ve ağaç her ikisi için de müşterektir, (orada) fitnecilere karşı yardımlaşırlar\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3071,
			"arabicnumber": 3071,
			"text": "Esmer b. Mudarres'den demiştir ki: Ben Nebi (s.a.v.)'in yanına varıp kendisine biat etmiştim. \"Her kim herhangi bir müslüman'ın kendisinden önce varamadığı bir su'ya ilk önce varıpta oraya sahipleni)irse, o su o'na aittir.\" buyurdu. Bunun üzerine halk (sahipsiz suları) işaretlemek üzere koşarak (yollara) çıktılar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3072,
			"arabicnumber": 3072,
			"text": "İbn Ömer'den (rivayet olunduğuna göre), Nebi (s.a.v.) ez-Zübeyr'e atının bir defa koşması (neticesinde kat edeceği mesafe) kadar bir araziyi vermiş. (Hz. Zübeyr de orada) atını koşturmuş nihayet (atın gücü ve arazinin sınırı bittiği için hayvan koşamayıp olduğu yerde) durmuş. Bunun üzerine (Hz. Zübeyr elinde bulunan) kamçısını (ileri doğru) atmış. Bunun üzerine (Hz. Nebi) \"Bu araziyi kamçısının eriştiği yere kadar Zübeyr'e verin!\" bu­yurmuş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3073,
			"arabicnumber": 3073,
			"text": "Said b. Zeyd'den (rivayet olunduğuna göre), Nebi (s.a.v.) (şöyle) buyurmuştur: \"Kim ölü bir toprağı canlandırırsa o toprak onundur. Zalim damar (sahibin)e hakk yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "Yahya b. Ureve'nin babasından (rivayet olunduğuna göre) Rasûlullah (s.a.v.) \"Kim ölü bir toprağı diriltirse, ölü toprak onundur.\" buyurmuş (Yahya b. Urve bu rivayetine devam ederek bir önceki hadisin sonunda bulunan cümlenin) aynısını zikretmiştir. (Yine Urve sözlerine devamla şöyle) demiştir. Bu hadisi rivayet eden kimse bana (şunları da) söyledi; iki adam mahkeme olmak üzere Rasûlullah (s.a.v.)'e müracaat etmişlerdi. Bunlardan birisi diğerinin toprağına hurma ekmişti. (Hz. Nebi bunları dinledikten sonra toprağın sahibine verilmesine, hükmetti. Hurma sahibine de hurmasını oradan sökmesini emretti. Ben o hurmaların (sökülmeleri için) köklerine balta ile vurulurken gördüm. Onlar uzun hurmalardı. Nihayet oradan sökülüp çıkarıldılar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3075,
			"arabicnumber": 3075,
			"text": "İbn İshak'dan (bir önceki 3074. hadisin) manası (yine bir önceki hadisin) senediyle (yani Urve vasıtasıyla rivayet olundu). Ancak (şu farkla ki Urve, bir önceki hadiste geçen) \"Bu hadisi bana haber veren kimse...\" sözü yerine (burada, Bu hadisi bana rivayet eden kimse) \"Nebi (s.a.v.)'in ashabından bir adamdı. Kuvvetle ihtimal veriyorum ki Ebû Said-el-Hudri idi. Ve ben o adamı hurmaların köküne (balta) vururken gördüm sözünü kullandı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3076,
			"arabicnumber": 3076,
			"text": "Urve' (r.a)'den demiştir ki: \"Ben, Rasûlullah (s.a.v.)'in -toprağın, Allah'ın toprağı, kulların da Allah'ın kulu olduğuna\" ve \"ölü bir toprağı imâr eden bir kimsenin ona (sahip olmaya herkes'ten) daha fazla müstehak olduğuna (dair) hükmettiğine şahitlik ederim. (Çünkü) bu hükmü bize Nebi (s.a.v.)'den (uygulamalarıyla, bilfiil) getiren(ler bize) ondan namazları getiren kimselerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3077,
			"arabicnumber": 3077,
			"text": "Semure (r.a)'den (rivayet olunduğuna göre), Nebi (s.a.v.): \"Kim bir toprağın etrafını duvarla çevirirse o toprak onundur.” buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3078,
			"arabicnumber": 3078,
			"text": "Hişam (b. Urve) dedi ki: \"Haksız damar(dan maksat) Bir kimsenin, bir başkasının toprağına ağaç dikip ona sahip olmaya kalkmasıdır.\" îmam Malik de \"Haksız damar(dan maksat) haksız olarak kazılan her kuyu ve (haksız olarak) dikilen her ağaçtır\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3079,
			"arabicnumber": 3079,
			"text": "Ebû Hamayd-es-Saîdî'den demiştir ki: Rasûlullah (s.a.v.)'le birlikte Tebuk savaşına çıkmıştım. (Hz. Nebi) Vadi'l-kura'ya geldiği zaman bahçesinde (duran) bir kadınla karşılaştı. Bunun üzerine sahabilerine (Bu kadının bahçesinden kalkacak olan hurmanın miktarını) \"tahmin edin\" (bakalım) buyurdu ve kendisi (onu) on kile (olarak) tahmin etti, kadına da: \"Buradan çıkacak olan (hurma mikdarın)i iyi belle!\" dedi. Sonra (yola koyulduk ve) Tebük'e geldik. (Orada) Eyle hükümdarı Rasûlullah (s.a.v.)'e beyaz bir katır hediye etti. Rasûlullah (s.a.v.) de o hükümdara bir cübbe giydirdi. Ve O'na yani memleketi (halkı)'na (cizye karşılığında eski topraklarında kalacaklarına dair bir eman) yaz(dır)dı. (Bu seferden dönüşümüz esnasında) Vadi'l-kura'ya geldiğimizde (Hz. Nebi daha önce bahçesinde rastlamış olduğumuz) kadına \"Bahçende ne kadar (hurma) oldu?\" diye sordu. (Kadın) da: \"On kile\" dedi (yani) Rasûlullah (s.a.v.)'in tahmini(ni söyledi). Bunun üzerine Rasûlullah (s.a.v.) \"Ben Medine'ye (gitmekte) acele ediyorum. Benimle beraber acele (Medineye gitmek) isteyen acele etsin\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3080,
			"arabicnumber": 3080,
			"text": "Hz. Nebi'in hanımı Zeyneb'den (rivayet olunduğuna göre) Kendisi (bir gün) Rasûlullah (s.a.v.)'in başını tararken (Hz. Peygamber'in) yanında Osman b. Affan'ın hanımı ile muhacirlerden bazı kadınlarda varmış. Bunlar, (Hz. Nebi'e, varislerin çokluğundan dolayı) evlerinin kendilerine dar gelmeye başladığından ve (yakında) oradan çıkarılacaklarından şikayet etmişler. Bunun üzerine Rasûlullah (s.a.v.) muhacirlerin evlerine (onların) hanımlarının) mirasçı kılınmasını emretmiş (derken) Abdullah b. Mesud vefat etmiş karısı da Medine'de (ona ait olan) bir ev'e mirasçı olmuş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3081,
			"arabicnumber": 3081,
			"text": "Muaz (b. Cebel) (r.a)'den demiştir ki: Kim (sahip olduğu bir haraç arazisinin vergisini vermemek suretiyle) haraç (vergisinin günahın)i boynuna geçirirse o kimse Rasûlullah (s.a.v.)'in üzerinde bulunduğu yoldan uzaklaşmış olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3082,
			"arabicnumber": 3082,
			"text": "Ebû Derda (r.a) dedi ki: Rasûlullah (s.a.v.) (şöyle) buyurdu. \"Kim bir toprağı haracıyla birlik satın alırsa, hicretini bozmuş olur. Kim de bir kâfirin (haraç ödeme zilletini onun) boynundan çıkarıp kendi boynuna geçirecek olursa sırtını İslam'a dönmüş olur.\" (Ravi Sinan b. Kays) dedi ki; Halid İbn Ma'dan bu hadisi benden işitince bana: (Bunu) \"Sana Şebi) mi haber verdi?\" diye sordu. Ben de \"Evet\" cevabını verdim. (Bunun üzerine) (sen onun yanına) \"Vardığın zaman (bu hadisi) ondan iste bana yazıversin\" dedi. (Ravi Sinan sözlerine devam ederek şöyle) dedi. (Nihayet bir gün Şebib'in yanına varmıştım. Kendisinden bu hadisi Halid b. Ma'dan'a yazıvermesini rica ettim de, hadisi) O'na yazıverdi. (Halid'in yanına) döndüğüm zaman Halid b. Ma'dan benden (getireceğini va'dettiğim, hadisin yazılı plduğu) kâğıdı istedi. Ben de onu (kendisine) verdim. Hadisi okuyunca içindekini işitir işitmez. Elinde bulunan (haraç) toprağı(nı) bıraktı. Ebû Dâvud dedi ki: (Senette geçen) bu (Yezid b. Humeyr isimli ravi) Yezid b. Humeyr-el-Yezeni’dir. Şu'be'nin arkadaşı olan (Yezid el-Hemdânî) değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3083,
			"arabicnumber": 3083,
			"text": "İbn. Cessâme'den (rivayet olunduğuna göre) Rasûlullah sallallahu aleyhi ve sellem,(Bir yeri)\"koru (ilan etme hakkı) ancak Allah'- ve Rasûlü'ne aittir.\" buyurmuştur, lbn-i Şihab der ki: Bana ulaştığına göre Rasûlullah (s.a.v.)Ennaki denilen yeri koru ilan etmiştir. Ayrıca bu hadis'i Buhârî, cihad, müsakât; Ahmed b. Hanbel IV.38, 71-73. te de tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3084,
			"arabicnumber": 3084,
			"text": "İbn. Cessâme'den demiştir ki: Nebi (s.a.v.) \"Nakı\" denilen yeri koru ilan etmiş ve: \"Koru (ilan etme hakkı) ancak aziz ve celil olan Allah'a aittir.” buyurmuş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3085,
			"arabicnumber": 3085,
			"text": "Ebû Hureyre (r.a), Nebi (s.a.v.)'in. \"rikaz^da beşte bir vardır.\" dediğini, söylemiştir. Ayrıca bu hadis'i Buhârî, musakât, zekât; Müslim, hudûd; Ebû Dâvud, diyât; Tirmizi, ahkam; îbn Mace, lukata, Muvatta, zekat 9, akul 12. dede tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "El Hasen'den \"Rikaz Ad kavm'ine ait hazine(ler)dir.\" dedi(ği rivayet olunmuştur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3087,
			"arabicnumber": 3087,
			"text": "Dubaa bint. Zübeyr b. Abdulmüttalib b. Hişam dedi ki: El-Mikdad, (birgün) abdest bozmak için Bakiü'l-Habhabe denilen yere gitmişti. (Orada) bir delikten bir altın çıkaran iri bir erkek fare görmüş, (fare) altınları teker teker çıkarmaya devam etmiş. Nihayet (o delikten toplam) on-yedi dinar çıkarmış. En sonunda içinde bir altın bulunan kırmızı bir bez parçası çıkarmış. (Bununla altınların sayısı) onsekiz olmuş. Bunun üzerine (el-Mikdad) bu altınları (alıp) Nebi (s.a.v.)'e götürmüş, durumu kendisine anlatmış ve (bunun) zekatını al demiş. Nebi (s.a.v.) de ona (bunları, elini) \"Deliğe uzattın (da) mı?\" (aldın?) diye sormuş. (el-Mikdad)da “Hayır\" cevabını vermiş. Bunun üzerine Rasûlullah (s.a.v.) (Bunun zekatı olmaz. Sen bunları götür) \"Allah bunu sana mübarek eylesin\" diye O'na dua etmiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3088,
			"arabicnumber": 3088,
			"text": "Abdullah b. Amr demiştir. Ben Rasûlullah (s.a.v.)'le birlikte taif (seferin)e çıktığımızda bir kabre uğramıştık. (O zaman Hz. Pey­gamber): \"Bu (Kabir) Ebû Rigal'in kabridir. Kendisi şu harem (i şerif) de idi (Haremde iken harem) onu (üzerine gelecek belalardan) korurdu. (Harem'den) çıkınca (daha önce) kavmine isabet etmiş olan bela şu (gördüğümüz) yerde ona da isabet etti. Ve buraya gömüldü. Bu (kabrin ona ait oluşu)nun alameti kendisiyle birlikte buraya altından bir dalın da gömülmüş olmasıdır. Eğer siz burayı deşerseniz bu dalı onun yanında bulursunuz\" buyurdu. Bunun üzerine halk kabre üşüştüler ve (o altın) dalı çıkardılar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 161
			}
		}
	]
}