{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"28": "Foods (Kitab Al-At'imah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3736,
			"arabicnumber": 3736,
			"text": "Abdullah b. Ömer (r.a)'den rivayet olunduğuna göre, Rasûlullah (s.a.v.): \"Biriniz bir velime’ye çağrıldığı zaman, hemen ona gitsin\" buyurmuştur. Ayrıca bu hadis'i; Buhari, nikâh; Müslim, nikâh; İbn Mâce, nikâh; Dârimî, nikâh; Muvatta, nikâh ; Ahmed b. Hanbel, II, 20, 22, 37. de tahric ettiler. Mahir: Velime: Düğün yemeğidir. İzah, 3742 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3737,
			"arabicnumber": 3737,
			"text": "İbn Ömer (r.a)'den rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.), (bir önceki 3736. hadisin) manasını (ifade eden bir cümle) söyledi. (Hz. Nebi bu cümleye): \"Eğer oruçlu değilse (orada ikram edilen) yemeği yesin. Oruçlu ise (yemek veren kimsenin ev halkı için) dua etsin.\" (sözlerini de) ilâve etti. Ayrıca bu hadis'i; Müslim, nikâh; İbn Mâce, nikâh ta tahric etti. İzah, 3742 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3738,
			"arabicnumber": 3738,
			"text": "İbn Ömer (r.a)'den Rasûlullah (s.a.v.)'in şöyle buyurduğu rivayet olunmuştur: \"Biriniz (din) kardeşini (bir ziyafete) çağırdığı zaman (çağrılan kişi bu davete) hemen icabet etsin. (Çağırılan şey ister) velime (yemeği) olsun, ya da benzeri bir şey olsun (farketmez).\" İzah, 3742 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3739,
			"arabicnumber": 3739,
			"text": "İbn Ömer'den (yine Eyyub) vasıtasıyla (bir önceki 3738. hadis'in) bir de manası (rivayet olunmuştur). İzah, 3742 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3740,
			"arabicnumber": 3740,
			"text": "Câbir (r.a)'den Rasûlullah (s.a.v.)'in şöyle buyurduğu rivayet olunmuştur: \"(Bir ziyafete) çağrılan kimse hemen icabet eylesin. Artık dilerse yer, dilerse yemez.\" Ayrıca bu hadis'i; Müslim, nikâh; İbn Mâce, sıyâm da tahric etti. İzah, 3742 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3741,
			"arabicnumber": 3741,
			"text": "Nâfi'den rivayet olunduğuna göre; Abdullah b. Ömer, Rasûlullah (s.a.v.)'n şöyle buyurduğunu söylemiştir: \"Bir (ziyafete) çağrılıp da icabet etmeyen kimse Allah'a ve Rasûlüne isyan etmiştir. Çağrılmaksızın (bir ziyafet yerine) giren kimse de hırsız olarak girmiş ve çapulcu olarak çıkmıştır.\" Ebû Dâvûd dedi ki: (Bu hadisin raviierinden) Ebân b. Tarık'(ın kimliği) belirsizdir. İzah, 3742 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3742,
			"arabicnumber": 3742,
			"text": "el-A'rac'dan rivayet olunduğuna göre; Ebû Hureyre (r.a) şöyle dermiş: Yemeğin en kötüsü (kendisine) zenginlerin çağrılıp da, fakirlerin çağrılmadığı davet yemeğidir. Davete gelmeyen kimse muhakkak ki Allah'a ve Rasûlüne karşı gelmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3743,
			"arabicnumber": 3743,
			"text": "Sâbit'den rivayet olunduğuna göre; Enes b. Mâlik'in yanında Zeyneb binti Cahş'ın (Hz. Peygamber'le) evlenmesinden söz edilince, şöyle demiştir: Rasûlullah (s.a.v.)'in onun için verdiği düğün yemeği kadar hanımlarından birine düğün yemeği verdiğini görmedim. (Onun düğününde) bir dişi koyun ziyafeti verdi. Ayrıca bu hadis'i; Buharî, nikâh; Müslim, nikâh; İbn Mâce, nikâh; Ahmed b. Hanbel, III, 172, 227. de tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3744,
			"arabicnumber": 3744,
			"text": "Enes b. Mâlik (r.a)'den rivayet olunduğuna göre; Nebi (Sallallahu aleyhi ve Sellem) Safiyye için bir kavut ve kuru hurma ziyafeti verdi. Diğer tahric. Tirmizi, nikah; İbni Mace, nikah (1909) AÇIKLAMA Ulema, evlenme münasebetiyle verilen yemeğin vaktinde ih­tilâf etmişlerdir. Bazıları bu yemeğin nikâhtan önce verilece­ğini söylerken bazıları da nikâhtan sonra verilebileceğini söylemişlerdir. Zi­faftan önce ve zifaftan sonra verilebileceğine dair görüşler de vardır.[el-İhtiyar li talilil Muhtar, IV-176.] Nikâh öncesinden itibaren zifaf sonrasına kadar olan geniş süre içeri­sinde herhangi bir zamanda verilebileceğini söyleyenler de olmuştur. Günü­müzde genellikle bu genişlikten yararlanılarak bu yemek, nikâh ile zifaf ara­sında verilmektedir, Mişkât'ta rivayet edilen bir hadis-i şerifte, Fahr-i Kâinat Efendimiz'in Hz. Safiyye'nin nikâhı münasebetiyle hays denilen bir yemek ziyafeti verdi­ği ifade edilmektedir. Mişkât'ta rivayet edilen diğer bir hadis-i şerifte de Hz. Nebidin bu ziyafette kuru hurma, yağ ve yoğurt kurusundan yapılan bir yemek verdiği rivayet edilmektedir. Aliyyü'l-Kârî'ye göre, bu iki rivayet­te anlatılmak istenen yemeklerin ikisi de aynı yemektir. Aralarında bir fark yoktur. Çünkü \"hays\" yemeği içinde de kuru hurma, kuru peynir ve yağ bulunur. Tıybî de netice itibariyle aynı şeyleri söylemiştir. Hz. Nebi, Hz. Zeyneb validemizin nikâhı münasebetiyle ise bir koyun ziyafeti vermiştir. Bu durum Hz. Nebi'in bazı ailelerinin dü­ğünlerinde etli bazı ailelerinin düğünlerinde ise etsiz ziyafet verdiğini ortaya koymaktadır. Hadis-i şeriflerde ekmekten hiç bahsedilmediğine göre etsiz ve ekmeksiz düğün ziyafeti vermek caizdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3745,
			"arabicnumber": 3745,
			"text": "Sakîf (kabilesin)den (devamlı) iyilikle anılan, yani hayırlı işlerinden dolayı devamlı övülen tek gözlü bir adamdan rivayet olunduğuna göre; (ki, ravi Hasan Basrî bu adam hakkında şöyle diyor): \"Eğer onun ismi Züheyr b. Osman değilse, isminin ne olduğunu bilmiyorum.\" Nebi (s.a.v.): \"Birinci gün düğün yemeği (vermek) bir görevdir. İkinci gün ise bir iyiliktir. Üçüncü gün (vermek ise) bir süm'a ve riyadır\" buyurmuştur. Katâde dedi ki: Bir adam bana, Saîd b. el-Müseyyeb'in birinci günü (verilen bir düğün yemeğine) çağırüıp gittiğini, ikinci gün yine çağrılıp gittiğini, üçüncü gün de çağrıldığını (fakat) gitmediğini ve: (Bu yemeği üçüncü günde verenler) süm 'a ve riya sahibi kimselerdir, dediğini haber verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3746,
			"arabicnumber": 3746,
			"text": "Şu (bir önceki 3745. hadisin sonunda anlatılan) olayda (yine) Katâde yoluyla Sâid b. el-Müseyyeb'den (şu şekilde de rivayet olunmuştur: Katâde) dedi ki: (Saîd) üçüncü gün de çağrıldı (fakat gitmedi) ve (gelen) davetçiyi taşladı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3747,
			"arabicnumber": 3747,
			"text": "Câbir (r.a)'den rivayet olunmuştur; dedi ki: Nebi (s.a.v.) Medine'ye gelince bir deve yahut da bir sığır kesti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3748,
			"arabicnumber": 3748,
			"text": "Ebû Şurayh el-Kâ'bî'den rivayet olunduğuna göre; Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Kim Allah'a inanıyorsa misafirine ikram etsin. (Misafirin, bu ziyaretine karşılık dünyada hakettiği) hediyesi, (ev sahibinin hediyele­ri ile geçen) günü ve gecesidir. Misafirlik üç gündür. Bundan fazlası ise (misafire) bir sadakadır. Misafirin ev sahibinin yanında onu bıktırıncaya kadar oturması caiz değildir.\" Ebû Dâvûd dedi ki: (Bu hadis) Haris b. Miskîn 'e okundu, ben de (orada) hazır bulundum. (Hadis ona okunan şekliyle şöyle idi): Eşheb dedi ki: (îmam) Mâlik'e, Nebi (s.a.v.)'in \"Onun hediyesi bir gün ve gecedir\" sözünün manası soruldu da şöyle cevap verdi: (Yani) ona bir gün bir gece ikram eder, iyilikte bulunur ve onu barındırır: (Onun) üç gün misafir olma (hakkı) vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3749,
			"arabicnumber": 3749,
			"text": "Ebû Hureyre (r,a)'den rivayet olunduğuna göre; Nebi (s.a.v.): ''Misafirlik üç gündür. Üç günden fazla olan misafirlik ise (ev sahibi için misafire) bir sadakadır\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3750,
			"arabicnumber": 3750,
			"text": "Ebû Kerime (r.a)'den Rasûlullah (s.a.v.)'in şöyle buyurduğu rivayet olunmuştur: \"Misafirin (birinci) gecesinde (onu ağırlamak) her müslüman (ev sahibi) üzerine (düşen) bir görevdir. Her kim (misafir olarak bir kimsenin) evinin önünde sabahlayacak olursa, bu kimse (ye ikram etmek) o ev sahibi üzerine bir borçtur. İsterse (borcunu) öder, (borcundan kurtulur), isterse (borcunu ödemeyi) terkeder (borçlu olarak kalır)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3751,
			"arabicnumber": 3751,
			"text": "el-Mikdâm Ebû Kerîme (r.a)'den rivayet olunduğuna gö­re; Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Herhangi bir kimse bir kavme misafir olur da (orada ikramdan ve ağırlanmaktan) mahrum olarak sabahlarsa, (bu misafirin en azından) bir gecelik yiyecek hakkını alacak kadar ona tahılından ve (diğer) mal(lar)ından yardım etmek (orada bulunan) her müslüman üzerine (düşen) bir görevdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3752,
			"arabicnumber": 3752,
			"text": "Ukbe b. Âmir (r.a)'den rivayet olunmuştur; dedi ki: (Biz Hz. Nebie): Ey Allah'ın Rasûlü, sen bizi (bazen bir yere) gönderiyorsun, biz de bir kavme misafir oluyoruz. (Fakat) onlar bizi ağırlamıyorlar. (Bu hususta) ne buyurursun? diye sorduk. Rasûlullah (s.a.v.) bize şöyle buyurdu: \"Eğer bir kavme misafir olur da sizin için (yapılması gereken ikram ve ağırlama ile ilgili) işleri(n yapılmasını hizmetçilerine) emrederlerse bunu kabul edin. (Bunu) yapmazlarsa kendilerine yaraşan misafir hakkını onlardan alın.\" Ebû Dâvûd dedi ki: Bu (hadis, bîr kimsenin hakkı olan bir şeyi alabileceğine dair kuvvetli bir delildir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3753,
			"arabicnumber": 3753,
			"text": "İbn Abbas (r.a)'dan rivayet olunmuştur; dedi ki: Şu \"Ey iman edenler, mallarınızı aranızda bâtılla (doğru olmayan yollarla haksız yere) yemeyin. Kendi rızanızla yaptığınız ticaret olursa başka...\"[Nisa 29] âyet-i kerimesi indikten sonra halka, bir kimsenin evinde yemek yemek zor gelmeye başlamıştı. Derken bu âyeti Nûr süresindeki (61 numaralı) âyet neshetti. (Bu âyette yüce Allah kullarına şöyle) buyurdu: \"...Size de kendi evlerinizden başka evlerde yemenizde bir güçlük yoktur..\"[Nûr 61] (Yüce Allah'ın bu meseleyle ilgili buyruğu); \"toplu olarak ve) ayrı ayrı... (yemenizde de üzerinize bir günah yoktur)\" sözüne kadar (sürmektedir). (Bu âyet inmeden önce) zengin bir adam yakınlarından birini yemeğe çağırıldığında (çağırılan kimse), \"Ben ondan yemeyi günah görüyorum\" derdi; -et-Tecennuh, bir şeyin günah olduğuna inanmak anlamına gelir- ve \"fakir bu davete benden daha müstehaktır\" diye konuşurdu. Bu âyet(in inmesi) ile (müslümanların, bu âyette zikredilen kimselerin birine ait olan ve) üzerine Besmele çekilen yemekleri yemeleri ve bir de kitap ehlinin yemekleri helâl kılınmış oldu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3754,
			"arabicnumber": 3754,
			"text": "İbn Abbas (r.a)'ın şöyle dediği rivayet edilmiştir: Nebi (s.a.v.), üstünlüklerini ortaya koyabilmek için yarışan kimselerin yemeklerinin yenmesini yasaklamıştır. Ebû Dâvud dedi ki; Bu hadisi, Cerîr (b. Hazm) 'den rivayet edenlerin ekserisi rivayetlerinin senedinde îbn Abbas (r.a)'ın ismini zikretmediler. (Ancak îkrime'nin rivayet ettiği) bu hadiste olduğu gibi Harun en-Nahvî de (bu hadisi rivayet ederken) îbn Abbasfin ismini zik­retti. Hammâd b. Zeyd ise İbn Abbas'in ismini zikretmedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3755,
			"arabicnumber": 3755,
			"text": "Sefine Ebû Abdurrahman'dan rivayet olunduğuna göre; Bir adam Ali b. Ebî Tâlib'i misafir etmiş ve ona bir yemek hazırlamış. (Orada hazır bulunan) Fatıma (r. anha) da: \"Keşke, Rasûlul-lah (s.a.v.)'i çağırsaydık. (Gelir) bizimle beraber (bu yemekten) o da yerdi\" demiş. Bunun üzerine Hz. Nebi'i de (o ziyafete) çağırmışlar. Hz. Nebi de (oraya) gelmiş. Elini kapının (iki tarafındaki) sövelerine koyunca, evin bir köşesine yerleştirilmiş olan yünden yapılmış renkli nakışlarla süslü ve üzerinde rakamlar bulunan ince bir kumaş görüp hemen geri dönerek gitmiş. Hz. Fâtıma da Hz. Ali'ye: Git, ona yetiş bak (bakalım) onun geri dönmesine sebep neymiş? demiş, Hz. Ali de onun peşinden gitmiş. (Hz. Ali Hz. Peygamber'e kavuşunca aralarında geçen konuşmayı şöyle anlatmış. Ben Hz. Nebi'e): Ey Allah'ın Rasûlü, seni geri çeviren sebep nedir? diye sordum. \"Benim için yahut da herhangi bir Nebi için nakışlarla süslü bir eve girmek yoktur\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3756,
			"arabicnumber": 3756,
			"text": "Nebi (s.a.v.)'in sahâbîlerinin birinden rivayet olunduğuna göre; Nebi (s.a.v.) şöyle buyurmuştur: \"İki kişi birden (seni) davet edecek olursa sen kapısı en yakın olan(ın daveti)ne icabet et. Çünkü kapısı en yakın olan en yakın komşu olandır. Eğer (davet eden bu iki kişiden birisi diğerinden) daha önce davet etmişse, önce davet edenin davetine icabet et",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3757,
			"arabicnumber": 3757,
			"text": "İbn Ömer (r.a)'den rivayet olunduğuna göre; Nebi (s.a.v.) şöyle buyurmuştur: “Birinizin akşam yemeği (sofraya) konduğu sırada namaza da başlanmış olursa (o kimse yemek yeme işini) bitirinceye kadar namaz'a kalkmaz.\" (Bu hadisin ravilerinden Müsedded, rivayetine şunları da) ilâve etti: \"Abdullah (b. Ömer), akşam yemeği (sofraya) konunca -yahut ta akşam yemeği (sofraya) gelince- ikameti de işitse, imamın okuyuşunu da işitse (yine de yemeğini) bitirinceye kadar (namaza) kalkmazdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3758,
			"arabicnumber": 3758,
			"text": "Câbir b. Abdillah (r.a)'dan Rasûlullah (s.a.v.)'in şöyle buyurduğu rivayet olunmuştur: “Yemekten veya başka bir şeyden dolayı o namaz geciktiril(e)mez.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3759,
			"arabicnumber": 3759,
			"text": "Abdullah b. Ubeyd b. Umeyr'den rivayet olunmuştur; dedi ki: İbn Zübeyr zamanında babamla birlikte Abdullah b. Ömer'in yanında (bulunuyor) idim. Abbâd b. Abdillah b. Zübeyr; \"Biz, (kılınması için ezan okunup kamet getirilen akşam) namaz(ın)dan önce (ortaya konulmuş olan) akşam yemeğine başlanabileceğini işittik\" dedi. Abdullah b. Ömer de \"Vah sana! Sen (Hz. Nebi'in sahâbîleri olan) o kimselerin akşam yemeklerinin nasıl olduğunu (biliyormusun)? (Onların akşam yemeklerinin) babanın akşam yemeği gibi (zengin) olduğunu mu zannediyorsun?\" diye karşılık verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3760,
			"arabicnumber": 3760,
			"text": "Abdullah b. Abbâs'dan şöyle rivayet olunmuştur: Bir gün Rasûlullah (s.a.v.) hela'dan çıkmış. (Orada bulunan sahâbîler) kendisine yemek getirmişler ve: Ey Allah'ın Rasûlü, (yemekten önce abdest alman için) sana abdest suyu da getirelim mi? demişler. (Hz. Nebi de): \"Ben ancak namaza kalktığım zaman abdest almakla emrolundum\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3761,
			"arabicnumber": 3761,
			"text": "Selman (r.a)'den şöyle rivayet olunmuştur; dedi ki: Ben Tevrat'ta, \"Yemeğin bereketi, yemekten önce elleri ve ağzı yıkamaktır\" (sözünü) okumuştum. Bunu Nebi (s.a.v.)'e anlattım. Bunun üzerine (Hz. Peygamber s.a.v.); \"Yemeğin bereketi yemekten önce elleri, yemekten sonra da elleri ve ağzı yıkamaktır\" buyurdu. Süfyân (es-Sevrî), yemekten önce elleri yıkamayı mekruh görürdü. Ebû Dâvûd dedi ki: Bu hadis zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3762,
			"arabicnumber": 3762,
			"text": "Câbir b. Abdillah (r.a)'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) (bir gün) abdest bozmuş olarak bir dağ geçidinden (bize doğru) geldi. Bizim önümüzde (bulunan) \"tirs\" yahut da \"hacefe\" (denilen bir kalkan) üzerinde hurma vardı. Kendisini davet ettik. (Gelip) bizimle birlikte (hurmadan) yedi ve elini suyla yıkamadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3763,
			"arabicnumber": 3763,
			"text": "Ebû Hureyre (r.a)'den şöyle dediği rivayet olunmuştur: Rasûlullah (s.a.v.) hiçbir zaman bir yemeği kötülememiştir. (Önüne gelen bir) yemekten hoşlanırsa onu yerdi, hoşlanmazsa yemezdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3764,
			"arabicnumber": 3764,
			"text": "Vahşî b. Harb (b. Vahşî b. Harb)'in dedesinden rivayet olunmuştur: Nebi (s.a.v.)'in sahâbîleri (Hz. Nebi'e): Ey Allah'ın Rasûlü, biz (yemek) yiyoruz, fakat doymuyoruz, demişler. (Hz. Nebi de onlara): \"Her halde siz (yemeği) ayrı ayrı (kaplarda) yiyorsunuzdur (değil mi)?\" demiş. (Onlar da): Evet, cevabını verrnişler. (Bunun üzerine Hz. Nebi): \"Yemeği toplu halde yeyiniz ve üzerine Besmele çekiniz. (O zaman) Allah o yemekte sizin için bereket halk eder (de karnınız doyar)\" buyurmuş. Ebû Dâvûd dedi ki: Bir düğün yemeğine gider de (önüne) akşam yemeği konacak olursa, ev sahibi izin verinceye kadar (o yemekten) yeme",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3765,
			"arabicnumber": 3765,
			"text": "Ebu'z-Zübeyr'den rivayet olunduğuna göre, Câbir b. Abdullah (r.a.) Nebi (s.a.v.)'i şöyle derken işitmiştir: “Bir adam evine girerken Besmele çekerek girerse ve yemek yerken de (Besmele çekerek yerse), şeytan (arkadaşlarına): (Burada) sizin için gecelemek (imkânı da) yok, akşam yemeği de yok, der. Eğer (adam evine) girerken Allah'ı anmadan girerse şeytan (arkadaşlarına: Burada) gecelemek (imkânın)a kavuştunuz, der. Eğer yemeği yerken de Allah'ın adını anmamışsa (şeytan arkadaşlarına: Burada) geceleme ve akşam yemeği (yeme imkânı)na kavuştunuz, der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3766,
			"arabicnumber": 3766,
			"text": "Huzeyfe (r.a)'den rivayet olunmuştur; dedi ki: Biz Rasûlullah (s.a.v.) ile birlikte bir yemekte bulunmuştuk. Rasûlullah (s.a.v.) ile birlikte sofrada hazır bulunduğunuz halde içimizden hiçbir kimse ondan önce elini sofraya uzatmadı. Derken bir bedevi sanki (arkasından yemeğe doğru) itilmiş gibi (hızla) gelip elini daldırmak üzere yemeğe götürdü. Rasûlullah (s.a.v.) da hemen onun elini tuttu. Sonra bir cariye sanki (arkasından) itiliyormuş gibi (hızla) gelip yemeğe sokmak üzere elini uzattı. Rasûlullah (s.a.v.) onun elini de tuttu ve şöyle buyurdu: \"Gerçekten şeytan, üzerine Allah'ın ismi anılmayan (Besmele çekilmeyen) yemeği yemeye imkân bulur. (O bu yemeği kendisine) helâl kılmak için önce kendisine âlet edebileceği şu bedeviyi getirdi. Ben de onun elini tuttum, (şeytana imkân vermedim). Sonra (bu yemeği kendisine) helâl kılmaya âlet etmek üzere bu cariyeyi getirdi. Ben (onun da) elini tuttum. Varlığım elinde olan Zât'a yemin olsun ki, şeytan'ın eli bedevi ve cariyenin eli ile birlikte benim elimdedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3767,
			"arabicnumber": 3767,
			"text": "Âişe (r. anha)'dan rivayet olunduğuna göre; Rasûlullah (s.a.v.) şöyle buyurmuştur: “Biriniz ye(mek yemek iste)diği zaman (yemeğe başlarken) yüce Allah'ın ismini ansın. Eğer (yemeğin) başında yüce Allah'ın ismini anmayı unutursa 'Bismillâhi evvelehü ve âhirehu: Başında da sonunda Allah'ın ismiyle başlarım' desin.\" Ayrıca bu hadis'i Tirmizî, et'ime; İbn Mâce, et'ime; Dârimî, et'ime; Ahmed b. Hanbel, VI, 143 208, 246, 265. te tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3768,
			"arabicnumber": 3768,
			"text": "Rasûlullah (s.a.v.)'in sahâbîlerinden Ümeyye b. Mahşî (r.a)'den şöyle rivayet olunmuştur: Rasûlullah (s.a.v.) oturuyordu. Bir adam da (orada) yemek yiyordu. (Adam yemek yerken) Besmele çekmedi. Yemekten sadece bir lokma kalmıştı. (Adam) o lokmayı ağzına kaldırdığı sırada, 'Bismillâhi evvelehü ve âhirehu' dedi. Bunun üze­rine Nebi (s.a.v.) gülmeye başladı. Sonra: \"Şeytan bu adamla beraber yemeye devam ediyordu. (Adam) Aziz ve Celîl olan Allah'ın ismini anınca (şeytan yediği yemekten) karnında ne varsa (hepsini) kustu' buyurdu. Ebû Dâvûd dedi ki: (Bu hadisin râvilerinden olan) Câbir b. Subh, Süleyman b. Harb'in anne cihetinden dedesidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3769,
			"arabicnumber": 3769,
			"text": "Ali b. el-Akmer'den rivayet olunduğuna göre; Ebû Cuhayfe, Rasûlullah (s.a.v.)'in şöyle buyurduğunu nakletmiştir: \"Ben (yemeğimi) dayanarak yemem!\" Ayrıca bu hadis'i Buhari, et'ime; Tirmizî, et'ime; İbn Mâce, et'ime; Dârimî, et'ime; Ahmed b. Hanbel, IV, 508, 309. da tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3770,
			"arabicnumber": 3770,
			"text": "(Şuayb b. Muhammed b. Abdillah b. Amr'ın) babasından şöyle dediği rivayet olunmuştur: Rasûlullah (s.a.v.)'in hiçbir zaman (bir yere) dayanarak (yemek) yediği görülmemiştir. Arkasında iki adam'ın yürüdüğü de görülmemiştir. Ayrıca bu hadis'i Buhari, ahkâm; İbn Mâce, mukaddime; Ahmed b. Hanbel, II, 125, 127. de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3771,
			"arabicnumber": 3771,
			"text": "Mus'ab b. Süleym'den şöyle dediği rivayet olunmuştur; Ben Enes'i (şöyle) derken işittim: Nebi (s.a.v.) beni (bir yer'e) göndermişti. Döndüğüm zaman kendisini geriye yaslanmış halde hurma yerken buldum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3772,
			"arabicnumber": 3772,
			"text": "İbn Abbas (r.a)'dan rivayet olunduğuna göre; Nebi (s.a.v.): \"Biriniz yemek yerken tabağın ortasından yemesin, fakat kenarından yesin. Çünkü bereket tabağın ortasına iner\" buyurmuştur. Ayrıca bu hadis'i Tirmizî, et'ime; Ibn Mâce, et'ime; Dârimî, et'ime; Ahmed b. Hanbel, I, 270, 343, 345, 364, III, 490. de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3773,
			"arabicnumber": 3773,
			"text": "Abdullah b. Büsr dedi ki: Nebi (s.a.v.)'in \"el-Garrâ\" isimli bir yemek kabı vardı ki onu (ancak) dört kişi taşıyabilirdi. (Müslümanlar) kurban bayramı gününe girip de kurban bayramı namazını kıldıkları vakit, bu kab içine tirit konmuş olduğu halde getirildi. (Halk) hemen onun etrafında toplandı. (Yemeğin etrafında toplanan halk) çoğalınca Rasûlullah (s.a.v.) da diz çöküp oturdu. Bunun üzerine (orada bulunan) bir bedevi (Hz. Nebi'e): Bu şekilde oturuş(un manası) nedir? diye sordu. (Hz. Nebi de): \"Şüphesiz ki Allah beni mütevazi bir kul olarak yetiştirdi. Zalim ve inatçı (bir insan) olarak yetiştirmedi.\" cevabını verdi. Sonra; \"(Haydi, yemeğin) kenarlarından yeyiniz. Bereketin üzerine indiği tepesin(den yemey)i bırakınız\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3774,
			"arabicnumber": 3774,
			"text": "Salim'in babası (Abdullah b. Ömer)'in şöyle dediği rivayet olunmuştur: Rasûlullah (s.a.v.) (ümmetine) iki yemeği yasaklamıştır: 1- Üzerinde şarap içilen bir sofrada otur(arak yemek ye)meyi, 2- Kişinin karnı üzerine (yüzü koyun) yatarak (yemek) yemesini. Ebû Dâvûd dedi ki: Bu hadisi Cafer b. Burkan, Zühri'den işitmemiştir. Dolayısıyla bu hadis münkerdir. Ayrıca bu hadis'i İbn Mâce, et'ime de tahric etti. İzah 3775 te { 0ku}",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3775,
			"arabicnumber": 3775,
			"text": "Harun b. Zeyd b. Ebi'z-Zerkâ'nın, babasından naklettiği rivayete göre; Cafer (b. Bürkân), bu 3774.hadisi ez-Zührî'den aldığını söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3776,
			"arabicnumber": 3776,
			"text": "Abdullah b. Ömer (r.a)'den rivayet olunduğuna göre; Nebi (s.a.v.): \"Biriniz (yemek) yediği zaman sağıyla yesin, (bir şey) içtiği za­man da (yine) sağıyla içsin. Çünkü şeytan soluyla yer ve soluyla içer\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3777,
			"arabicnumber": 3777,
			"text": "Ömer b. Ebî Seleme'den rivayet olunduğuna göre; Nebi (s.a.v.): \"Ey oğulcuğum; yaklaş, Besmele çek, sağ elinle ve önünden ye\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3778,
			"arabicnumber": 3778,
			"text": "Âişe (r.anhâ)'dan rivayet olunduğuna göre; Rasûlullah (s.a.v.): \"Eti bıçakla kesmeyiniz. Çünkü bu ecnebilerin işidir. Onu siz dişlerinizle kopararak yeyiniz. Çünkü böylesi daha lezzetli ve hazmı daha kolaydır\" buyurmuştur. Ebû Dâvûd dedi ki: Bu hadis sahih değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3779,
			"arabicnumber": 3779,
			"text": "Safvân b. Ümeyye'den, şöyle dediği rivayet olunmuştur: Nebi (s.a.v.) ile birlikte (et) yiyiyordum. Eti kemikten elimle (sıyırıp) alıyordum. Bunun üzerine; \"Kemiği ağzına yaklaştır, (etini dişlerinle) kopararak ye. Çünkü böylesi daha tatlı ve daha yarayışlıdır\" buyurdu. Ebû Dâvûd dedi ki: (Bu hadisin ravilerinden) Osman (b. Ebî Süleyman) Safvân 'dan (hadis) işitmemiştir; (binaenaleyh) bu hadis mürseldir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3780,
			"arabicnumber": 3780,
			"text": "Abdullah b. Me'sûd (r.a)'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.)'in en sevdiği kemik koyun kemiğiydi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3781,
			"arabicnumber": 3781,
			"text": "(Abdullah b. Mes'ûd) dedi ki: (Hayvanın) kol kısımları Nebi (s.a.v.)'in hoşuna giderdi. Yahudilerin kendisini bir ön butla zehirlediklerine inanırdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3782,
			"arabicnumber": 3782,
			"text": "İshak b. Abdillah b. Ebî Talha'dan (rivayet olunduğuna göre; Enes b. Mâlik'i şöyle derken işitmiştir: Bir terzi Rasûlullah (s.a.v.)'i hazırlamış olduğu bir yemeğe çağırmıştı. Bu yemeğe Rasûlullah (s.a.v.) ile birlikte ben de gittim. Rasûlullah (s.a.v.) bir arpa ekmeğiyle içinde kabak ve pastırma bulunan bir çorbayı benim önüme yaklaştırdı. Ben (yemek esnasında) Rasûlullah (s.a.v.)'in, (yemek içerisinde bulunan) kabakları araştırmakta olduğunu gördüm. O günden itibaren kabağa olan sevgim devam etmektedir. Ayrıca bu hadis'i Buhari, et'ime, buyu'; Müslim, eşribe; Dârimî, et'ime; Tirmizî, et'ime de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3783,
			"arabicnumber": 3783,
			"text": "İbn Abbas'dan şöyle dediği rivayet olunmuştur: Rasûlullah (s.a.v.)'in ekmekten (yapılan) yemekler içerisinde en sevdiği tirit idi. Tirit; hurma ve keş, yağ, un karışımı yemeklerdendir. Ebû Dâvûd der ki: Bu hadis zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3784,
			"arabicnumber": 3784,
			"text": "(Kabîsa b. Hülb'ün) babasından rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.)’i, \"Yemeklerin bazılarını (yemek)ten (kalbimde) bir endişe hissediyorum\" diyen bir adama (şöyle) cevap verirken işittim: “Gönlünde hiçbir endişe doğmasın. (Eğer helâlliği şer'î deliller­le sabit olan bir yemeğin yenip yenmeyeceği hususunda gönlünde doğan bir şüphe üzerine o yemeği yemeyi terkedecek olursan) bu konuda hiristiyanlara benzemiş olursun",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3785,
			"arabicnumber": 3785,
			"text": "İbn Ömer (r.a)'den rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.), pislik yemeyi alışkanlık haline getirmiş olan hayvanın etini) yemeyi ve sütlerini (içmeyi) yasakladı. Ayrıca bu hadis'i Ebû Dâvûd, cihad, et'ime, eşribe; Tirmizî, et'ime; Nesâî, dahâyâ; İbn Mâce, zebâih; Muvatta, edâhi; Ahmed b. Hanbel, 1,219,226, 241,253,321, 339. da tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3786,
			"arabicnumber": 3786,
			"text": "İbn Abbas (r.a)'dan rivayet olunduğuna göre; Nebi (s.a.v.), pislik yemeyi alışkanlık haline getirmiş olan hayvan'ın sütünü (içmeyi) yasaklamıştır. Ayrıca bu hadis'i Ebû Dâvûd, cihad, et'ime, eşribe; Tirmizî, el'ime; Nesâî, dahâyâ; İbn Mâce, zebâih; Muvatta, edâhi; Ahmed b. Hanbel, I, 219, 226,241,253, 321, 339. da tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3787,
			"arabicnumber": 3787,
			"text": "İbn Ömer (r.a)'den rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) pislik yemeyi alışkanlık haline getirmiş olan develere binmeyi ve sütlerinden içmeyi yasaklamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3788,
			"arabicnumber": 3788,
			"text": "Câbir b. Abdillah'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.), Hayber günü bize (ehlî) eşek etini (yemeyi) yasakladı, at etini yememize izin verdi. Ayrıca bu hadis'i Buhari, zebâih, hums, meğâzi, nikâh; Müslim, nikâh, sayd; Tirmizî, nikâh, sayd, et'ime 6; Nesâî, nikâh, sayd; İbn Mâce, zebâih; Dârimî, edâhi, nikâh; Ahmed b. Hanbel, II, 21, 102, 143, 144, 219, IV, 48, 89, 90, 127, 193-195, 301, 355, 383. te tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3789,
			"arabicnumber": 3789,
			"text": "Câbir b. Abdillah'dan rivayet olunmuştur; dedi ki: Biz Hayber (savaşı) günü bir takım atları, katırları ve (ehlî) eşekleri kesmiştik. Rasûlullah (s.a.v.), bize katırlarla eşekleri(n etlerini yemeyi) yasakladı, (fakat) atları(n etini yemeyi) yasaklamadı. Ayrıca bu hadis'i Müslim, sayd da tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3790,
			"arabicnumber": 3790,
			"text": "Halid b. Velîd'den rivayet olunduğuna göre; Rasûlullah (s.a.v.), atların, katırların ve eşeklerin etlerini yemeyi yasaklamıştır. (Bu hadisi rivayet edenlerden) Hayve, (rivayetine şu sözleri de) ilâve etti: \"Köpek dişi olan yırtıcı hayvanların tümünü(n etlerini) de (yasakladı).\" Ebû Dâvûd dedi ki: Bu (hadisin ifade ettiği hüküm îmam) Mâlik'in görüşüdür. (Aslında) at etîeri(nin yenmesinde bir sakınca yoktur; ve amel bu hadis üzerinde değildir. (Çünkü) bu (hadis) neshedil-miştir ve Nebi (s.a.v.)'in sahâbîlerinden bir cemaat at etlerini ye­miştir, îbn Zübeyr, Fedâle b. Ubeyd, Enes b. Mâlik, Esma binti Ebi Bekr, Süveyd b. Gafele ve Alkame bunlardandır. Rasûlullah (s.a.v.) zamanında Kureyşliler atları keserlerdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3791,
			"arabicnumber": 3791,
			"text": "Enes b. Mâlik'den rivayet olunduğuna göre; dedi ki: Ben ergenlik çağma yaklaşmış becerikli bir çocuktum. (Bir gün) bir tavşan avlayıp onu kızarttım. Ebû Talha, (bu tavşan'ın) arka tarafını benimle Nebi (s.a.v.)'e gönderdi. Ben onu Peygamber (s.a.v.)'e getirdim, (Hz. Nebi de) onu kabul etti. Ayrıca bu hadis'i Buhari, hibe, zebâih; Müslim, sayd; Tirmizî, et'ime; Nesâî, sayd; İbn Mâce, sayd; Dârimî, sayd; Ahmed b. Hanbel, III, 118, 171, 232, 291. de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3792,
			"arabicnumber": 3792,
			"text": "Muhammed b. Halid dedi ki: Ben babam Halid b. el-Huveyris'i (şöyle) derken işittim: Abdullah b Âmr, Sıfah (denilen yer) de bulunuyordu. -Muhammed (b. Halid, Sıfah denilen bu yerin) Mekke'de (bulunan) bir yer olduğunu söyler.- Bir adam bir tavşan avlamıştı. (Bu adam Abdullah b. Amr'a): Ey Abdullah b. Amr, (sen tavşan hakkında) ne dersin? dedi. (Abdullah da şöyle) cevap verdi: (Bir gün) Rasûlullah (s.a.v.)'e bir tavşan getirilmişti. Ben de (orada) oturuyordum. (Hz. Nebi) onu yemedi, (fakat) yenmesini de yasaklamadı ve o'nun (o anda) hayız görmekte olduğunu söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3793,
			"arabicnumber": 3793,
			"text": "İbn Abbas'dan rivayet olunduğuna göre; dedi ki: (İbn Abbas'ın) teyzesi, Rasûlullah (s.a.v.)'e yağ, birkaç keler ve kurumuş peynir hediye etmiş. (Hz. Nebi de) yağ ile peyniri yemiş, (fakat) tiksindiğinden dolayı kelerleri bırakmış. (İbn Abbas'a göre), eğer (keler eti yemek) haram olsaydı Rasûlullah (s.a.v.)'in sofrasında (keler) yenmezdi. Ayrıca bu hadis'i Buhari, hibe, et'ime, megâzî, i'tisam; Müslim, sayd; Nesâî, sayd, nikâh; Ahmed b. Hanbel, I, 225, 259, 366, II, 329, 340, 347, IV, 4. te tahric etti. İzah; 3796 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3794,
			"arabicnumber": 3794,
			"text": "Hâlid b. Velid'den rivayet olunduğuna göre: Kendisi (bir gün) Rasûlullah (s.a.v.) ile birlikte Meymûne'nin evine girmiş. (O sırada Rasûlullah (s.a.v.)'e kızartılmış bir keler getirilmiş. Rasûlullah (s.a.v.) de (alıp yemek üzere) ona elini uzatmış. Bunun üzerine (o sırada) Meymûne'nin evinde bulunan bazı kadınlar; \"Nebi (s.a.v.)'e yemek istediği şeyin ne olduğunu haber yerin\" demişler. Orada bulunanlar da: \"Bu kelerdir\" demişler. Rasûlullah (s.a.v.) de hemen elini çekmiş. (Halid b. Velid sözlerine devamla şöyle) dedi: Ben (kendisine): Ey Allah'ın Rasûlü, bu (kelerin etini yemek) haram mıdır? diye sordum./ \"Hayır (haram değildir), fakat o benim kavmimin toprağında bulunmaz ve ben ondan tiksinti hissediyorum\" buyurdu. Bunun üzerine ben kızarmış keleri (önüme) çektim ve Rasûlullah (s.a.v.)'in gözünün önünde yedim. Ayrıca bu hadis'i Buharî, zebâih; Müslim, sayd; Nesâi, sayd; İbn Mâce, sayd; Muvatta, İsti'zân ; Ahmed b. Hanbel, IV, 89. da tahric etti. İzah; 3796 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3795,
			"arabicnumber": 3795,
			"text": "Sabit b. Vedîa'dan şöyle dediği rivayet olunmuştur: Rasûlullah (s.a.v.) ile beraber bir askeri birlik içerisinde bulunuyordum. Derken birkaç keler yakaladık. Ben onlardan birini kızartıp Rasûlullah (s.a.v.)'e getirdim ve önüne koydum. (Hz. Nebi) bir çöp alıp onunla (kelerin) parmaklarını saymaya başladı; sonra: \"İsrail oğullarından bir topluluk yerde yürüyen hayvanlar şekline çevrilmiştir. Ancak ben (onların çevrildiği) bu hayvanın hangi hayvan olduğunu bilmiyorum\" buyurdu ve (bu keleri) yemedi, (yenmesini de) yasaklamadı. Ayrıca bu hadis'i Nesâî, sayd; İbn Mâce, sayd da tahric etti. İzah; 3796 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3796,
			"arabicnumber": 3796,
			"text": "Abdurrahman b. Şibl'den rivayet olunduğuna göre; Rasûlullah (s.a.v.) keler etini yemeyi yasaklamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3797,
			"arabicnumber": 3797,
			"text": "(Büreyh b. Ömer b. Sefîne'nin) dedesinden şöyle dediği rivayet olunmuştur: Ben Rasûlullah (s.a.v.) ile beraber toy kuşu eti yedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3798,
			"arabicnumber": 3798,
			"text": "(Milkâm b. Telibb'in) babasından rivayet olunmuştur; dedi ki: Ben Nebi (s.a.v.) ile (uzun süre) birlikte bulundum. (Ondan) küçük canlıların haram olduğuna dair (hiçbir söz) duymadım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3799,
			"arabicnumber": 3799,
			"text": "(İsa b. Nümeyle'nin) babasından rivayet olunmuştur; dedi ki: Bir gün ben İbn Ömer'in yanında iken, kendisine kirpi (eti) yeme(nin hükmü) soruldu da (bu soruya cevap olmak üzere); \"De ki: Bana vahyolunanda (bu haram dediklerinizi) yiyen kimse için haram edilmiş bir şey bulamıyorum..”[En'am 145] (mealindeki) âyeti okudu. (Orada İbn Ömer'in) yanında (bulunan) yaşlı bir zat şöyle dedi: (Ama) ben Ebû Hureyre'yi: Nebi (s.a.v.)'in yanında kirpiden söz edildi de (Hz. Peygamber): \"O pis hayvanlardan biridir\" buyurdu, derken işittim. Bunun üzerine İbn Ömer; \"Eğer Rasûlullah (s.a.v.) bunu söylemişse o onun dediği gibidir; demek ben bilmiyormuşum\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3800,
			"arabicnumber": 3800,
			"text": "İbn Abbas'dan şöyle dediği rivayet olunmuştur: Cahiliyye (dönemi) halkı bazı şeyleri yerlerdi, bazı şeyleri de tiksindiklerinden dolayı yemezlerdi. Derken yüce Allah, Nebiini (s.a.v.) gönderdi ve Kitab'ını indirdi. Helâlini ve haramını açıkladı. Artık o'nun haram kıldığı haramdır, helâl kıldığı da helâldir. Hakkında açıklama yapmadığı ise affedilmiştir. Sonra, \"De ki: Bana vahyolunanda (bu haram dediklerinizi) yiyen kimse için haram edilmiş bir şey bulamıyorum\"[En'am 145] âyetini sonuna kadar okudu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3801,
			"arabicnumber": 3801,
			"text": "Câbir b. Abdullah (r.a)'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.)'e sırtlan (etin)i sordum. \"O bir av (hayvanı)dır ve onu avlayan ihramlıya (keffaret olarak) bir koç (kurban etme cezası) konmuştur\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3802,
			"arabicnumber": 3802,
			"text": "Ebu Sa’labe el- Huşeni ‘den rivayet olduğuna göre; Rasulullah (s.a.v.) köpek dişi olan yırtıcı hayvanlar(ın etlerini) yemeyi yasaklamıştır. Ayrıca bu hadis'i Buhari, zebaih, tıbb; Müslim, sayd; Tirmizi, sayd, et’ime, siyer; Ebu Davud, et’ime; Nesai, buyu', sayd; İbn Mace, sayd; Darimi, edahi, Muvatta, sayd; Ahmed b. Hanbel, I, 244, 289, 302, 326, 327, 333, 339, 373, II, 236, 366, 418, III, 323, IV, 89, 90, 131, 132, VI, 445. te tahric etti. İzah; 3807 dedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3803,
			"arabicnumber": 3803,
			"text": "İbn Abbas’dan rivayet olunmuştur; Rasulullah (s.a.v.), yırtıcı hayvanlardan köpek dişli olanları(n etini yemeyi) ve kuşlardanda pençeli olanları(n etini yemeyi) yasaklamıştır. Ayrıca bu hadis'i Müslim, sayd; Tirmizi, sayd; Nesai, sayd; İbn Mace, sayd; Darimi, edahi; Ahmed b. Hanbel, I, 147, 244, 289, 302, 327, 332, 339, 373, III, 323, IV, 89, 90, 127. de tahric etti. İzah; 3807 dedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3804,
			"arabicnumber": 3804,
			"text": "Mikdam b. Ma’di keirb’den rivayet olduğuna göre; Rasulullah (s.a.v.) şöyle buyurmuştur: “Dikkatli olunuz! Yırtıcı hayvanlardan köpek dişli olanları(n etini yemek) helal değildir. Ehli eşek (eti ile) anlaşmalı ecnebilerin kendilerine ihtiyaç duyulan buluntu malları da helal değildir. Herhangi bir adam bir kavme misafir olur da (o kavim) onu ağırlamazsa bu misafir için yarın ahirete olanlardan bu misafirlik hakkının alma hakkı vardır. İzah; 3807 dedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3805,
			"arabicnumber": 3805,
			"text": "İbn Abbas'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.), Hayber (savaşı) günü yırtıcı hayvanlardan köpek dişli olan her hayvan'ın, kuşlardan da pençeli olan her kuşun (etinin) yenmesini yasakladı. Ayrıca bu hadis'i Müslim, sayd; Tirmizi, sayd; Nesâî, sayd; İbn Mâce, sayd; Dârimî, edâhi; Ahmed b. Hanbel, I, 137, 244, 289, 302, 327, 332, 339, 373, III, 323, IV, 89, 90, 127. de tahric etti. İzah; 3807 dedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3806,
			"arabicnumber": 3806,
			"text": "Halid b. Velid (r.a)'den rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) ile birlikte Hayber savaşına katılmıştım. (Orada) yahudiler gelip, (müslüman) halkın (yahudilerin koyunlarını yağma etmek üzere yahudilerin) ağıllarına koşuştuklarını (Hz. Nebi'e) şikâyet ettiler. Rasûlullah (s.a.v.) da (müslümanlara hitaben): \"Dikkatli olun! Anlaşmalı olarak müslüman topraklarında yaşayan gayri müslimlerin malları(nı) haksız yere (ellerinden almak) helâl olmaz. Ehli eşek (eti) size haram olduğu gibi at ve katır da haramdır. Yırtıcı hayvanlardan her köpek dişli (hayvan) ile kuşlardan her pençeli (kuş) da (haramdır)\" buyurdu. Ayrıca bu hadis'i Nesâi, sayd; İbn Mâce, zebâih de tahric etti. İzah; 3807 dedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3807,
			"arabicnumber": 3807,
			"text": "Câbir b. Abdullah'dan rivayet olunduğuna göre; Nebi (s.a.v.) kedi parasını yasaklamıştır. (Muhammed) İbn Abdilmelik (ise bu cümleyi): \"Kedi (etini) ve (kedi) parasını yemeyi yasakladı\" (şeklinde) rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3808,
			"arabicnumber": 3808,
			"text": "Câbir b. Abdillah'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) bize (ehli) eşek eti yemeyi yasakladı ve at eti yememizi tavsiye etti. (Bu hadisin ravilerinden) Amr (b. Dînâr, bu hadis hakkında şöyle) dedi: Ben bu hadisi Ebû Şa'sâ'ya anlattım, (bana) şu cevabı verdi: \"Bizim içimizde (bulunan) el-Hakem el-Gıfârî de bu hadisten bahsederdi. (Ancak) Bahr bunu kabul etmezdi\", (Ebû Şa'sâ, deniz manasına gelen Bahr sözüyle) İbn Abbas'ı kastediyordu. İzah; 3811 dedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3809,
			"arabicnumber": 3809,
			"text": "Gâlib b. Ebcer'den rivayet olunmuştur; dedi ki: Bize bir kıtlık (yılı) gelmişti. (Elimde bulunan) malın içerisinde (ehli) eşeklerden başka âileme yedirebiîeceğim bir şey yoktu. Rasûlullah (s.a.v.) de ehli eşek etlerini yasakladı. Nebi (s.a.v.)'e varıp; Ey Allah'ın Rasûlü, bize bir kıtlık (yılı) gelip çattı. Benim mal(lar)ım içerisinde semiz eşeklerden başka aile halkına yedirebiîeceğim bir şey yok; sen ise ehli eşek etini yasaklamış bulunuyorsun, diye şikâyette bulundum. \"Sen aile halkına semiz eşek!er(in etin)den yedir. Çünkü ben onları(n etlerini) sadece pislik yiyen hayvanlar oldukları için yasaklamıştım.\" buyurdu. Yani (bu hayvanları etlerini) cellâle (oldukları için yasaklandığını anlatmak istiyordu). Ebû Dâvûd dedi ki: (Hadisin senedinde bulunan) Abdurrahman, (Abdurrahman) b. Ma'kil'dir. Yine Ebû Dâvûd dedi ki: Bu hadisi ayrıca Şu'be de Ubeyd Ebu'l-Hasen'den, Abdurrahman b. Ma'kil'den, o da Abdurrahman b. Bişr'den Müzeyne (kabilesin)den bazı kimselerden rivayet edilmiştir. (Bu rivayete göre) Müzeyne'nin efendisi olan Ebcer yahutta Ebcer'in oğlu, Nebi (s.a.v.)'e (ehli eşek eti yemenin hükmünü) sormuştur. İzah; 3811 dedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3810,
			"arabicnumber": 3810,
			"text": "Şu'be'den rivayet olunduğuna göre; bu (3809.) hadisi bir de) Müzeyne kabilesine mensup iki adam'dan biri diğerinden (rivayet etmiştir. Yani) Müzeyneü Abdullah b. Amr b. Avim, Müzeyneli Gâlib b. el-Ebcer'den rivayet etmiştir. (Bu hadisin senedinde bulunan) Mis'ar (şöyle) demiştir: \"Nebi (s.a.v.)'e gelen kimsenin Gâlib (b. Ebcer) olduğunu zannediyorum.\" (Ravi) şu (bir numara önce geçen 3809.) hadisi (nakletti). İzah; 3811 dedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3811,
			"arabicnumber": 3811,
			"text": "Amr b. Şuayb (b. Muhammed b. Abdullah b. Amr b. Âs)'ın dedesinden rivayet olmuştur; dedi ki: Rasûlullah (s.a.v.) Hayber (Savaşı) günü, ehli eşek ile pislik yiyen hayvanların yenilmesini ve (üzerine) binilmesini yasakladı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3812,
			"arabicnumber": 3812,
			"text": "Ebû Ya'fûr'dan şöyle dediği rivayet olunmuştur: İbn Ebî Evfâ'ya çekirge (yeme)yi sordum da; Ben Rasûlullah (s.a.v.) ile birlikte altı ya da yedi savaşa katıldım. Biz (bu savaşlarda) kendisiyle birlikte çekirge yerdik, cevabını verdi. Ayrıca bu hadis'i Buharî, zebâih; Müslim, sayd; Tirmizî, et'ime; Nesâî, sayd; Dârimî; Ahmed b. Hanbel, IV, 353, 357, 380. de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3813,
			"arabicnumber": 3813,
			"text": "Selmân (r.a)'dan rivayet olunmuştur; dedi ki: Nebi (s.a.v.)'e çekirge(nin yenilip yenilmeyeceği) soruldu. \"(Çekirge) Allah'ın ordularının en çoğu(nu teşkil etmekte)dir. Ben onu yemem ve haram da kılmam” buyurdu. Ebû Dâvûd dedi ki: Bu hadisi (bir de) Mu'temir, babası ve Ebû Osman kanalıyla Nebi (s.a.v)'den rivayet etti (fakat) Selman'ı anmadı. Ayrıca bu hadis'i İbn Mâce, sayd da tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3814,
			"arabicnumber": 3814,
			"text": "Selmân (r.a)'dan rivayet olunduğuna göre; Rasûlullah (s.a.v.)'e (çekirgenin yenilip yenilmeyeceği) sorulmuş, (bir önceki 3813. hadiste geçen) cevabının aynısını vermiş: \"(Çekirge) Allah ordularının en çoğu (nu oluşturmaktadır\" demiş. (Musannif Ebû Davud'un şeyhi) Ali (b. Abdillah) dedi ki: Ebû Avvâm'ın (ismi) Fâid'dir. Ebû Dâvûd dedi ki: Bu hadis'i (bir de) Hammâd b. Seleme, Ebû’l-Avvâm'dan, o Ebû Osman'an, o da Nebi (s.a.v.)'den rivayet etti. (Hammâd bu rivayetinde) Selmân'ı anmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3815,
			"arabicnumber": 3815,
			"text": "Câbir b. Abdullah' dan, Rasûlullah (s.a.v.)'in şöyle buyurduğu rivayet olunmuştur: \"Denizin (sahile) attığı veya (deniz sularını) kendisinden geri çektiği (için açıkta kalan) şeyleri yeyiniz. (Fakat) denizde (kendiliğinden zahiri bir sebep olmaksızın ölüp de) su yüzüne çıkan şeyleri yemeyiniz.\" Ebû Dâvûd dedi ki: Süfyan es-Sevrî, Eyyub ve Hammâd da hadisi Ebu'z-Ziibeyr'den rivayet ettiler ve bunların üçü de rivayet zincirini) Câbir üzerinde durdurdular, (Hz. Nebi'e kadar uzandıramadılar). Bazen bu hadis (in rivayet zinciri) zayıf bir şekilde îbn Ebî Zi'b, Ebu'z-Zübeyr ve Câbir yoluyla Hz. Nebi (s.a.v.)'e dayandırılarak rivayet edilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3816,
			"arabicnumber": 3816,
			"text": "Câbir b. Semüre'den rivayet olunmuştur; dedi ki: Bir adam (Medine'de, siyah taşlarıyla meşhur olan) Hârre isimli yere ailesi ve çocuğu ile birlikte konakladı. (Orada bulanan) başka bir adam (ona), \"Benim (burada) devem kayboldu, eğer bulursan onu yakala\" dedi. Kısa bir süre sonra (o kimse bu) deveyi buldu. (Fakat devenin) sahibi bulunamadı. Derken (elinde kalan) deve hastalandı..Karısı ona \"Bunu kes\" dediyse de adam kabul etmedi. Deve öldü. (Bu sefer kadın kocasına), \"Bunu kes, yağını ve etini pastırma yapar yeriz. (Çünkü biz çok açız, zaruret halindeyiz)\"- dedi. (Adam): \"(Hayır), Rasûlullah (s.a.v.)'e danışıncaya kadar (bunu kabul edemem)\" dedi. Sonra Rasûlullah (s.a.v.)'e gelip bunu sordu. (Hz. Nebi de): \"Senin yanında seni buna muhtaç olmaktan kurtaracak (bir şey) var mı?\" diye sordu. (Adam) \"Hayır\" cevabını verdi, (Bunun üzerine); \"(Öyleyse) onu yeyiniz\" buyurdu. (Tam o sırada devenin) sahibi çıkageldi. (Adam da başından geçen) olayı anlattı. (Devenin sahibi olayı öğrenince adama), \"Onu kesseydin ya!\" dedi. (Adam da),' \"Senden utandım (da kesemedim)\" karşılığını verdi. İzah 3816 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3817,
			"arabicnumber": 3817,
			"text": "el-Fücey' el-Âmirî'den rivayet olunduğuna göre; Kendisi Rasûlullah (s.a.v.)'e gelip; (Ey Allah'ın Rasûlu), bize ölü (hayvan eti) helâl kılınmadı mı? demiş. (Hz. Nebi de ona): \"Sizin yemeğiniz nedir.\" diye sormuş, (el-Fücey’de): \"Akşamleyin bir bardak, sabahleyin de bir bardak süt içeriz\" cevabını vermiş. (Musannifin hadis rivayet ettiği kimselerden olan) Ebû Nuaym (künyesiyle tanınan el-Fazl b. Dükeyn) dedi ki: Ukbe (b. Vehb) bana (metinde geçen) \"İğtibâk\" kelimesini, sabahleyin bir bardak (süt içmek); \"el-ıstıbah\" kelimesini de akşamleyin bir bardak (süt içmek) diye açıkladı.- (Hz. Nebi de): \"Yemin olsun ki (bu hal) açlıktır. (İçilen bu kadarcık süt açlığı gidermeye yetmez)\" buyurmuş ve (bu halleri devam ettiği sürece, ölmeyecek kadar) o leşi (yemelerini) onlara helâl kılmış. Ebû Dâvûd dedi ki: (Metinde geçen kelimesinin kökü olan) \"el-ğabûk\", gündüzün son vakit(ler)idir. kelimesinin kökü olan) \"sabûh\" ise, gündüzün ilk anlarıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3818,
			"arabicnumber": 3818,
			"text": "İbn Ömer'den rivayet olduğuna göre; Rasûlullah (s.a.v.): \"(Şu anda) Önümde esmer buğday (unun)dan (yapılmış); yağ ve sütle karışık beyaz bir ekmek olmasını ne kadar arzu ederdim\" demiş. Bunun üzerine (orada bulunan) cemaatten biri kalkıp bu ekmeği hazırlayıp (Hz. Nebi'in önüne) getirmiş. (Hz. Nebi ekmeği görünce onu getiren zata): \"Bu (yağ) neyin içerisinde (bulunuyor) idi?\" diye sorunca; Keler (derisin)den (yapılmış) bir kap içerisindeydi, diye cevap vermiş. (Bunu işiten Hz. Nebi): \"Onu (derhal önümden) kaldır\" buyurmuş. Ebû Dâvûd dedi ki: Bu hadis münkerdir. Yine Ebû Davûd dedi ki: (Senedinde bulunan) Eyyub, (Eyyub) es-Sahtiyânî değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3819,
			"arabicnumber": 3819,
			"text": "İbn Ömer'den rivayet olunmuştur; dedi ki: Nebi (s.a.v.)'e Tebük (seferin)de bir (parça) peynir getirildi. (Hz. Nebi de) bir bıçak istedi, sonra Besmele çekip (bıçakla peyniri) kesti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3820,
			"arabicnumber": 3820,
			"text": "Câbir (r.a)'den rivayet olunduğuna göre; Nebi (s.a.v.): “Sirke ne güzel katıktır” buyurmuştur. Ayrıca bu hadis'i Müslim, eşribe; Ebû Dâvûd, eşribe; Tirmizî, et'ime; Nesâî, eymân, eşribe; İbn Mâce, et'ime; Dârimî, et'ime de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3821,
			"arabicnumber": 3821,
			"text": "Câbir (r.a)'den rivayet olunduğuna göre; Nebi (s.a.v.): \"Sirke ne güzel katıktır\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3822,
			"arabicnumber": 3822,
			"text": "Câbir b. Abdillah (r.a) Rasûlullah (s.a.v.)'in; \"Sarımsak veya soğan yiyen kimse bizden uzak dursun. -Yahutta mescidimizden uzak dursun- ve evinde otursun\" buyurduğunu söyledi.(Yine Câbir şöyle dedi): Hz. Nebi (s.a.v.)'e (bir gün) içinde taze sebze bulunan bir tabak getirildi de onda (çirkin) bir koku duydu, (bu kokunun ne olduğunu) sordu. (Bunun üzerine) tabakta bulunan sebzelerin neler olduğu kendisine haber verildi. (Tabaktaki sebzelerin neler olduğunu anlayınca) yanında bulunan sahâbîlerden birine (işarette bulunarak); \"Bu sebzeleri şuna götürünüz\" buyurdu. (O sahâbî de, Nebi (s.a.v.)'in bu hareketini) görünce (bu sebzeleri) yemek istemedi. (Nebi s.a.v.): \"Sen ye, (benim yemediğime bakma). Çünkü ben senin konuşmadığın kimselerle konuşuyorum\" buyurdu. (Ravi Ahrned b. Salih) dedi ki: İbn Vehb, (metinde geçen) \"bedr\" kelimesini \"tabak\" diye tefsir etti. Ayrıca bu hadis'i Buhari, ezan, et'ime, i'tisam; Müslim, mesâcid; Tirmizî, et'ime; Nesâî, mesâcid; Ahmed b. Hanbel, III, 65, 85, 374, 387, 400, IV, 194. te tahric etti. İzah; 3829 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3823,
			"arabicnumber": 3823,
			"text": "Ebû Saîd el-Hudrî şöyle dedi: Rasûlullah (s.a.v.)'in yanında sarmısak ve soğandan bahsedildi ve; Ey Allah'ın Rasûlü, bunların hepsinin (içinde kokusu) en fazla olanı sarımsaktır. (Artık) sen onu bize haram kılıyor musun? diye soruldu. Nebi (s.a.v.) de; “Onu yiyiniz, (fakat) onu yiyen kimse kokusu kendisinden gidinceye kadar şu mescide yaklaşmasın\" buyurdu. İzah; 3829 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3824,
			"arabicnumber": 3824,
			"text": "Huzeyfe'den rivayet olunduğuna göre; Rasûlullah (s.a.v.) üç defa şöyle buyurmuştur: \"Kıbleye tüküren kimse kıyamet gününde (Allah'ın huzuruna) tükürüğü iki gözünün arasında olarak gelir. Kim de şu pis (kokulu) sebzeyi yerse (bizim) mescidimize yaklaşmasın.\" İzah; 3829 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3825,
			"arabicnumber": 3825,
			"text": "İbn Ömer (r.a)'den rivayet olunduğuna göre; Nebi (s.a.v.): \"Şu bitkiden yiyen kimse mescidlere yaklaşmasın\" buyurmuştur. İzah; 3829 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3826,
			"arabicnumber": 3826,
			"text": "Muğîre b. Şu'be'den rivayet olunmuştur: Bir gün sarımsak yiyip (namaz kılmak üzere) Nebi (s.a.v.)'in mescidine varmıştım, (Ben) mescide girince Nebi (s.a.v.) (herhalde benden) bir koku hissetti(ki), namazını bitirince; \"Her kim şu (sarmısak ismi verilen) bitkiyi yerse kokusu (kendisinden iyice) gidinceye kadar (mescidimize) yaklaşmasın\" buyurdu. Namazı tamamlayınca yanına varıp; Ey Allah'ın Rasûlü, Allah için elini bana vereceksin, dedim. (Elini lütfedip bana verdi, ben de) elini (tutup) yenimin arasından göğsüme götürdüm. O sırada ben göğsü sarılı idim. (Göğsümün sarılı olduğunu anlayınca); \"Senin özrün var\" buyurdu. İzah; 3829 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3827,
			"arabicnumber": 3827,
			"text": "(Muaviye b. Kurre'nin) babasından rivayet olunduğuna göre; Nebi (s.a.v.) (sarmısak ve soğan diye bildiğimiz) şu iki bitkiyi yasaklamış ve şöyle buyurmuştur: \"Bunları yiyen mescidlerime yaklaşmasın. Eğer mutlaka yemeniz gerekiyorsa pişirmek suretiyle onlar (da bulunan ağır kokular) i gideriniz (de ondan sonra yiyiniz).\" (Bu hadisin ravisi Muaviye) dedi ki: (Hz. Nebi, \"iki bitki\" kelimesiyle) soğan ve sarmısağı kasdetmiştir. İzah; 3829 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3828,
			"arabicnumber": 3828,
			"text": "Şüreyk (b. Hanbel)'den rivayet olunduğuna göre; Ali (a.s): \"Pişirilmiş olması dışında sarımsağın yenmesi yasaklanmıştır\" buyurmuştur. Ebû Dâvûd dedi ki: (Senette ismi geçen) Şüreyk '(ten maksat, Şüreyk) b. Hanbel'dir. İzah; 3829 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3829,
			"arabicnumber": 3829,
			"text": "Ebû Ziyâd Hıyar b. Seleme'den rivayet olunduğuna göre; Kendisi Âişe (r.anha)'ya soğanı sormuş da (Hz. Âişe): \"Rasûlullah (s.a.v.)'in yediği son yemek, içinde soğan olan bir yemekti\" cevabını vermiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3830,
			"arabicnumber": 3830,
			"text": "Yusuf b. Abdullah b. Selâm'dan şöyle dediği rivayet olun­muştur; Ben Nebi (s.a.v.)'i, bir ekmek parçası alıp üzerine de bir hurma koymuş (olduğu) halde: \"Bu bunun katığıdır\" derken gördüm. Bu hadis Ebu Davud, eymân ve'n-nuzurdada geçmişti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3831,
			"arabicnumber": 3831,
			"text": "Âişe (r.anha)'dan rivayet olunduğuna göre; Nebi (s.a.v.): “İçinde hurma bulunmayan bir evin halkı açtır\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3832,
			"arabicnumber": 3832,
			"text": "Enes b. Mâlik (r.a)'den rivayet olunmuştur; dedi ki: Nebi (s.a.v.)'e (geçen seneden kalma) ekşimiş bir hurma getirildi de (içinde bulunan kurtları) çıkar(ip at)mak üzere bu hurmayı iyice bir gözden geçirmeye başladı. Ayrıca İbn Mâce, et'ime de de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3833,
			"arabicnumber": 3833,
			"text": "İshak b. Abdillah b. Ebî Talha'dan rivayet olunduğuna göre; Nebi (s.a.v.)'e (bazen) içinde kurt bulunan hurmalar getiriirdi de... (Ravi İshak sözlerine devam ederek bir önceki hadisin manasını (ifade eden sözler) söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3834,
			"arabicnumber": 3834,
			"text": "İbn Ömer'den rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.), (iki hurmayı) birleştirerek yeme) yi yasakladı ve: , \"Ancak (sofrada bulunan yemek) arkadaşlarının izin vermeleri müstesnadır\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3835,
			"arabicnumber": 3835,
			"text": "Abdullah b. Ca'fer'den rivayet olunduğuna göre; Nebi (s.a.v.), hıyar ile yaş hurmayı birlikte yermiş. Ayrıca bu hadis'i Buhari, et'ime; Müslim, eşribe; Tirmizî, et'ime; İbn Mâce, et'ime; Dârimî, et'ime; Ahmed b. Hanbel, I, 203. te tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3836,
			"arabicnumber": 3836,
			"text": "Âişe (r.anha)'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) karpuzla yaş hurmayı birlikte yerdi ve; \"Şunun sıcağını şunun soğuğuyla, şunun soğuğunu da şunun sıcağıyla kırıyoruz\" buyururdu. Ayrıca bu hadis'i Tirmizî, et'ime; İbn Mâce, et'ime de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3837,
			"arabicnumber": 3837,
			"text": "Büsr'ün Sülem kabilesine mensub (Abdullah ve Atiyye isimlerindeki) iki oğlundan rivayet olunmuştur; dediler ki: Rasûlullah (s.a.v.) (bir gün) yanımıza geldi. (Kendisine) tereyağı ve kuru hurma ikram ettik. Tereyağı ile kuru hurmayı (birlikte yemeyi çok) severdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3838,
			"arabicnumber": 3838,
			"text": "Câbir (r.a)'den şöyle dediği rivayet olunmuştur: Rasûlullah (s.a.v.) ile birlikte savaşa çıkar (ve savaşta) müşriklerin (yemek) kaplarından ve su kaplarından bazılarını ele geçirirdik. (Yemek pişirirken ve su içerken) onlardan yararlandık. Bu hareketimizden dolayı (Hz. Nebi) bizleri hiç ayıplamadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3839,
			"arabicnumber": 3839,
			"text": "Ebû Sa'lebe el-Huşenî'den rivayet olunduğuna göre; Kendisi Rasûlullah (s.a.v.)'e: Biz (bazen) ehl-i kitapla karşılaşıyoruz, tencerelerinde domuz (eti) pişiriyorlar, bardaklarında şarap içiyorlar. (Bu durumda bizim onların kaplarını kullanmamız caiz olur mu)? diye sormuş. Rasûlullah (s.a.v.) de: \"Eğer onlardan başka kaplar bulursanız bulduğunuz kaplarda yiyiniz içiniz. Fakat başka kaplar bulamazsanız onların kaplarını suyla yıkayınız ve (onlarda) yiyiniz, içiniz\" buyurmuş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3840,
			"arabicnumber": 3840,
			"text": "Câbir (r.a)'den rivayet olmuştur; dedi ki: Rasûlullah (s.a.v.) bizi (Habat gazasına) göndermişti. Ebû Ubeyde b. el-Cerrah'i da başımıza komutan tayin etmişti. Kureyş'in bir kervanı ile karşılacaktık. Bir dağarcık hurmayı bize azık olarak vermiş, verecek başka bir şey de bulamamıştı. Ebû Ubeyde b. el-Cerrah, her birimize bu hurmalardan (sadece) birer tane veriyordu. Biz de onu çocuğun meme emdiği gibi emiyorduk, sonra da üzerine bir su içiyorduk. Bu bize o gün geceye kadar yetiyordu. Bir de sopalarımızla (selem) ağac(ınm) yaprağına vuruyorduk; (düşen) yaprağı su ile ıslatıp yiyorduk. (Nihayet) denizin kenarına vardık. (Denizin kıyısında) kum yığını gibi büyük bir cisim yükselmeye başladı. Yanına vardığımız zaman bir de ne görelim, anber denilen balıkmış. Ebû Ubeyde (onu görünce); \"Bu bir leştir ve bize helâl değildir\" dedi. Sonra, \"Hayır, biz Rasûlullah (s.a.v.)'in elçileriyiz ve Allah yolunda (sefere çıkmış durumda)yız; ve siz buna şiddetle muhtaçsınız. Binaenaleyh (bunu) yiyiniz\" dedi. Biz orada bir ay kadar kaldık. Üç yüz kişi idik. Hatta bu balıktan yiye yiye semizleşmiştik. (Rasûlullah) (s.a.v.)'e dönünce bu durumu ona anlattık. \"O Allah'ın sizin için çıkardığı bir rızıktır. Yanınızda onun etinden biraz var mı ki ondan bize de yediresiniz\" buyurdu. Bunun üzerine biz (ondan bir kısmını) gönderdik, (Hz. Peygamber de onu) yedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3841,
			"arabicnumber": 3841,
			"text": "Meymûne (r.anha)'den rivayet olunduğuna göre; Bir fare yağ içine düşmüş ve (hâdise) Nebi (s.a.v.)'e haber verilmiş. Bunun üzerine (Rasûlullah); \"(Fareyi ve) etrafını atınız ve (kalan kısmı) yiyiniz\" buyurmuştur. Ayrıca bu hadisi Buharî, zebâih, vudu; Tirmizî, et'ime; Nesâî, fer'; Dârimî, vudû; Muvatta, isti'zan; Ahmed b. Hanbel, II, 233, 265, 490, VI, 329, 330, 335. te tahric etti. İzah; 3943 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3842,
			"arabicnumber": 3842,
			"text": "Ebû Hureyre (r.a)'den Rasûlulllah (s.a.v.)'in şöyle dediği rivayet olunmuştur: \"Yağ içine bir fare düştüğü zaman (bakınız) eğer (yağ) sıvı ise ona yaklaşmayınız.\" (Bu hadisin ravisi) Hasen (b. Ali) dedi ki: Abdürrezzak (şöyle) dedi: \"Bu hadisi genellikle Ma'mer Zühri'den o da Ubey b. Abdullah'dan o da Meymûne (r.anha)'dan o da Nebi (s.a.v.)'den rivayet etmiştir.” İzah; 3943 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3843,
			"arabicnumber": 3843,
			"text": "İbnü'I-Müseyyeb'den rivayet edilen bir önceki (3842 nolu) Zührî hadisinin bir benzerini de Ahmed b. Salih ile Abdürrezzak (şu senetle) rivayet ettiler: Abdurrahman b. Bûzeveyh, Ma'mer, ez-Zührî, Ubeydullah b. Abdullah, İbn Abbas, Meymûne, Nebi (s.a.v)",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3844,
			"arabicnumber": 3844,
			"text": "Ebû Hureyre (r.a)'den rivayet olunduğuna göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Birinizin (içinde sulu yemek bulunan) kabına kara sinek düştüğü vakit onu (tamamen yemeğin içine) batırınız. Çünkü onun bir kanadında hastalık (yapan mikrop), diğerinde de şifa vardır ve o (tehlikelerden) içinde hastalık bulunan kanadıyla korunur. (Bu nedenle yemeğe bu kanadıyla düşer, diğer kanadı ise dışarda kalır). Binaenaleyh (şifalı kanadındaki şifayı yemeğe bırakarak öbür kanadıyla bıraktığı hastalığı tesirsiz hale getirmek için) onun her tarafını (yemeğe) batırınız",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "Enes b. Mâlik (r.a)'den rivayet edildiğine göre; Rasûlullah (s.a.v.) yemek yediği zaman parmaklarını üç defa yalar ve şöyle buyururdu: \"Biriniz lokması (yere) düştüğü zaman (bulaşan toz, toprağı) ondan gidersin ve onu yesin. Şeytan'a bırakmasın.\" Sonra bize yemek kabını silmeyi emrederek şöyle buyurdu: \"Şurası bir gerçek ki, hiç biriniz yemeğinin neresinin kendisi için bereketli olduğunu bilemez",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3846,
			"arabicnumber": 3846,
			"text": "Ebû Hureyre (r.a)'den rivayet olunduğuna göre, Rasûlul-lah (s.a.v.) şöyle buyurmuştur: \"Birinizin hizmetçisi, dumanına ve sıcağına katlanarak kendisine bir yemek hazırlayıp getirecek olursa (yemeği kendisi ile birlikte) yemesi için onu yanına oturtsun. Şayet yemek az olursa eline bir yada iki lokma koyuversin",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3847,
			"arabicnumber": 3847,
			"text": "İbn Abbas (r.a)'dan rivayet olunduğuna göre; Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Biriniz (yemeğini) yediği zaman elini yalamadıkça yahutta yalatmadıkça mendille silmesin.\" Ayrıca bu hadis'i Buharî, et'ime; Müslim, eşribe; Tirmizî, et'ime; İbn Mâce, et'ime; Dârimî, et'ime; Ahmed b. Hanbel, I, 221, 293, 346, 370, II, 341, 415, III, 301, 331, 337, 366, 394, VI, 386. da tahric etti. İzah; 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3848,
			"arabicnumber": 3848,
			"text": "(Abdurrahman b. Kâ'b b. Mâlik'in) babasından rivayet olunduğuna göre; Rasûlullah (s.a.v.), (yemeğini) üç parmakla yermiş ve yalamadıkça elini silmezmiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3849,
			"arabicnumber": 3849,
			"text": "Ebû Ümame (r.a)'den rivayet olunmuştur; dedi ki: Sofra (üzerinde bulunan yemekler yenip kaplar) kaldırılınca, Ra­sûlullah (s.a.v.); \"Çok samimi, bereketli, (bizim kusurumuzdan dolayı da) yetersiz (olan), bırakılamayan ve kendisine ihtiyaçtan kurtulmak mümkün olmayan hamd Allah'adır, (ey) Allah(ım)\" diye dua edermiş. Ayrıca bu hadisi Buharî, et'ime; Tirmizî, da'vât; İbn Mâce, et'ime; Dârimî, et'ime; Ahmed b. Hanbel, V, 252, 256, 261, 267. de tahric etti. İzah; 3951 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3850,
			"arabicnumber": 3850,
			"text": "Ebû Saîd el-Hudrî'den rivayet olunduğuna göre; Nebi (s.a.v.) yemeğini bitirince şöyle dua edermiş: \"Bizi doyuran, bize içiren ve bizim müslümanlardan olmamızı sağlayan Allah'a hamdolsun.\" İzah; 3951 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3851,
			"arabicnumber": 3851,
			"text": "Ebû Eyyub eî-Ensârî'den rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) (bir şey) yediği veya içtiği zaman; \"Yediren, içiren ve yedirip içirdiği şeyi kolaylıkla boğazdan geçirip hazmettiren ve artıkları için bir çıkış yolu yaratmış olan Allah'a hamdolsım\" diye dua ederdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3852,
			"arabicnumber": 3852,
			"text": "Ebû Hureyre (r.a)'den rivayet olunduğuna göre; Rasûlul­lah (s.a.v.) şöyle buyurmuştur: \"Elinde yemek artığı ve kokusu varken onu yıkamadan uyuyup da (uykusu esnasında) kendisine zararlı bir böcek ilişen kimse, (başına gelenden dolayı) kendisinden başka kimseyi suçlamasın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3853,
			"arabicnumber": 3853,
			"text": "Câbir b. Abdullah'dan rivayet olunmuştur; dedi ki: Ebu'i-Heysem b. et-Teyyihân, Nebi (s.a.v.) için bir yemek hazırlamıştı. Nebi (s.a.v.) ile sahâbîlerini (bu yemeğe) çağırdı. (Yemeği) bitirdikleri zaman (Hz. Nebi sahâbîlerine): \"Kardeşinizi (bu ziyafetten dolayı) mükâfatlandırınız\" buyurdu. (Sahâbîler): Ey Allah'ın Rasûlü, onu mükâfatlandırmak nasıl olur? dediler. (Hz. Nebi de): \"Bir adam'ın evine gidilir, yemeği yenir, içeceği içilir; sonra (yiyip içen kimseler) ona dua ederlerse, işte bu onu mükâfatlandırmaktır\" buyurdu. İzah; 3954 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3854,
			"arabicnumber": 3854,
			"text": "Enes (r.a)'den rivayet olduğuna göre; Nebi (s.a.v.), Sa'd b. Ubâde'ye (misafir olarak) gelmiş. (Sa'd da) kendisine ekmek ve zeytinyağı ikram etmiş. Nebi (s.a.v.) (bunları) yedi(kten) sonra: “Sizin yanınızda oruçlular iftar ettiler. Yemeğinizi salih kimseler yedi ve melekler de sizin için dua ettiler\" buyurmuş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 119
			}
		}
	]
}