{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"3": "The Book Of The Prayer For Rain (Kitab al-Istisqa')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "Abbâd b. Temîm, amcası (Abdullah b. Zeyd b. Âsim -r.a.-)'dan rivayet ettiğine göre; Resûlullah (S.A.V.) ashabı ile birlikte (namazgah'a) yağmur duasına çıkıp onlara iki rekat namaz kıldırdı. Bu rekatlerde kıbleye karşı durdu açıktan okudu, ridâsını ters çevirdi. Ellerini kaldırıp duâ etti ve yağmur istedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "Abbâd b. Temîm el-Mâzinî'den rivayet edildiğine göre; ashâbdan olan amcasını şöyle derken işitmiş: Bir gün Resûlullah (S.A.V.) yağmur duasına çıktı. Allah (c,c.)’ya duâ eder(ken), insanlara sırtını çevirerek -Süleyman b. Davud'un dedi(ğine göre), kıbleye döndü- elbisesini ters çevirdi. Sonra da iki rekat namaz kıldı. izah: Müslim, istiskâ; Tahâvî, Şerhu Meâni'l-âsâr, I, 324. Îbn Ebi Zi'b(rivayetinde) \"Resûlullah bu rekatlarde okudu\" de­di. Îbnu's-Serh de (İbn Ebi Zi'b'in bununla) \"açıktan okumayı\" kast ettiğini ilâve etti.[11] Hadisin senedine bakıldığı takdirde râvîlerin bazı tabakalarda birden fazla olduğu görülür. Bu durum, hadisin naklinde bazı farklılıkların ortaya çıkmasına sebeb olmuştur. Metindeki \"kıbleye döndü\" cümlesi müellifin şeyhlerinden Süleyman b. Davud'un rivayetinde olduğu hal­de, Îbnu's-Serh'in rivayetinde yer almamıştır. Hadisi îbn Şihâb'dan duyan râvîlerden Yûnus, H'z. Peygamberin istiska duâsındaki namazda birşey oku­duğuna dair hiçbir nakilde bulunmamış: İbn Ebî Zi'b ise, Efendimizin na­mazda okuduğunu haber vermiştir. tbnu's-Serh bu kıraatin cehri olduğunu söylemiştir. Hadis-i şerifin Müslim'deki rivayetinde de kıraatten hiç söz edilmemek­tedir. Geride kalan kısımda, oradaki ifadelerle, Ebü Dâvûd'daki ifadeler ara­sında pek fark göze çarpmamaktadır. Hz. Peygamber'in dua ederken sırtını insanlara döndü,meşine sebep kıb­leyi önüne alma arzusudur. Anlaşıldığına göre Efendimizin durduğu yer, ce­maatle kıblenin arasına düşüyordu. Onun için Resûlullah namazda olduğu gibi sırtını cemaate çevirmek zorunda kaldı. Hadiste \"sırtını cemaate verdi\" ifâdesinin yanında, \"kıbleye döndü\" sözünün zaid olduğu hatıra gelebilir. Ama İbn Hacer'in beyânına göre, bunlar arasında fark vardır. Sırtım cema­ate verdiği halde, tam kıbleye yönelmemesi bunun için de yönünü biraz da­ha çevirmiş olması muhtemeldir. Hz. Peygamberin bu hareketi, duâ esnasında kıbleye karşı durmanın sünnet olduğunu gösterir. Metinde de görüldüğü üzere, bu rivâyetde Fahr-i Kâinat Efendimizin çıktığı bir yağmur duasında duanın yanı sıra elbisesini ters çevirdiği ve iki rek'at namaz kıldığı haber verilmektedir. Bu hususlar hakkında bir önceki hadiste yeterli bilgi verilmiştir. Ancak yukarıdaki rivayette önce namaz da­ha sonra da dua zikredilmişti. Burada ise, Efendimizin evvelâ dua edip son­ra namaz kıldıkları beyân edilmektedir. Fakat bu farklılık hadisler arasında bir tezat olduğunu göstermez. Çünkü Resûlullah'm birden çok yağmur dua­sına çıkıp her iki rivayette belirtilen şekilleri uygulamış olması mümkündür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "(Muhammed b. Velîd) ez-Zübeydî, bu (önce geçen 1162.) hadisi, Muhammed b. Müslim'den aynı senedle rivayet etmiş, namazı (Resûlullah'ın namaz kıldığını) zikretmemiştir. (Zübeydî rivayetinde) şöyle dedi: Resûlullah (S.A.V.) ridâsını çevirip, sağ tarafını sol omuzu üzerine, sol tarafını da sağ omuzu üzerine koydu. Sonra Azîz ve Ccelîl olan ALLAH'A dua etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "Abdullah b. Zeyd (r.a.)'den; demiştir ki: Resûlullah (S.A.V.) üzerinde Hamîsa denilen siyah elbisesi olduğu halde yağmur duasına çıktı. Resûlullah (önce) elbisesinin aşağısını yukarıya koymak istedi. Fakat ağır gelince, sağ tarafını sol, sol tarafını da sağ omuzu üzerine koydu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"text": "İshak b. Abdullah b. Kinâne'den; demiştir ki: Velid b. Utbe -Osman'ın dediğine göre Velid b. Ukbe- Medine valisi iken, beni Resûlullah (S.A.V.)'in yağmur duasında (kıldığı) namazını sormam için İbn Abbâs (r.anhumâ)'ya gönderdi. (Gidib İbn Abbâs'a sordum) o da şöyle dedi: Resûlullah (S.A.V.) iş (eski) elbisesini giymiş, mütevâzı bir vaziyette tezarru içinde musallaya kadar geldi. -Osman, \"Minberin üzerine çıktı\" cümlesini ilâve etti- sizin şu hutbeniz gibi hutbe okumadı. Fakat dua, tazarru ve tekbire devam etti. Sonra bayramda kıldığı gibi iki rekat namaz kıldı. Ebû Dâvûd dedi ki: Seneddeki (İshâk b. Abdullah'ın söylediği) ifâdesi, Nufeyli’ye aittir. Doğrusu îbn Ukbe değil, İbn Utbe’dir. Diğer tahric: Tirmizî, cuma; Nesaî, istiskâ; ibn Mâce, ikâme; Ahmed b. Hanbel, I, 23, 269, 355; Dârekutnî, Sünen II, 68; Beyhakî, es-Sünenu'l-kubrâ, III, 347; Hâkim, el-Musiedrek, I, 327",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "Abdullah b. Zeyd (r.a.)'in haber verdiğine göre; Resûlullah (S.A.V.) yağmur duası için musallaya çıktı, duâ etmek isteyince kıbleye döndü sonra da ridâsım ters çevirdi. Ayrıca bakınız: 1161 numaralı hadisin kaynakları",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "Abdullah b. Zeyd el-Mâzinî şöyle der: Resûlullah (S.A.V.) musallaya çıkıp yağmur duası yaptı. Kıbleye döndüğü zaman ridâ (cübbe)sini ters çevirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "Ben-i Âbî'l-Lahm'ın azadlısı Umeyr'den; Resûlullah (S.A.V.)'i Ahcaru'z-zeyt'de Zevrâ'ya yakın bir yerde ayakta durarak ellerini başına kadar yükseltmeden yüzüne doğru kaldırmış bir vaziyette yağmur için dua ederken gördüğü rivayet edilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "Cabir b. Abdillah (r.a.)'den; demiştir ki: Nebiyyi zîşan (S.A.V.)'e ağlayan kadınlar geldiler (başlarına gelen kuraklığın sona ermesi için duâ etmesini istediler). Bunun üzerine Resûl-i Ekrem (Sallallahu aleyhi ve Sellem): \"Allah'ım! Bize yardım eden, bereketli otu bol, zararlı değil yararlı, vadeli değil acele yağmur ihsan et\" diye duâ etti. Akabinde gökyüzü kat kat oldu (bulutlarla doldu)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "Enes (r.a.)’den rivayet edildiğine göre; Resûlullah (S.A.V.) istiskanın haricindeki hiçbir duada ellerini kaldırmazdı. (İstiskâda ise) koltuklarının beyazı görününceye kadar (ellerini) kaldırırdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": 1171,
			"text": "Enes (r.a.)'den rivayet edildiğine göre (demiş ki); Resûlullah (S.A.V.) şöyle yağmur duası yapardı. (Yani) ellerini ben koltuklarının beyazını görünceye kadar uzatır, kaldırır avuçlarını yere doğru tutardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": 1172,
			"text": "Muhammed b. İbrahim şöyle der: Birisi Resûlullah (S.A.V.)'i Ahcâru'z-zeyt'te avuçlarını yayarak duâ\" ettiğini gördüğünü bana haber verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "Aişe (r.anhâ)'dan; demiştir ki: İnsanlar Resûlullah (S.A.V.)'e kuraklıktan şikâyet ettiler. Bunun üzerine Efendimiz, bir minber konulmasını emretti ve musallaya kendisi için bir minber konuldu. Yağmur duasına çıkacağı günü ahaliye bildirdi. (Kararlaştırılan gün gelince) Peygamber (S.A.V.) güneşin kaşı (ilk ışınları) görününce gidip minberin üzerine çıktı. Tekbir aldı. Allah azze ve celleye hamdetti, sonra; \"Siz memleketinizin kuraklığından ve yağmurun ilk zamanından geciktiğinden şikâyet ettiniz. Halbuki Allah azze ve Celle size, kendisine duâ etmenizi emretti ve duanızı kabul edeceğini vâdetti\" buyurdu. Sonra da şöyle devam etti: \"Hamd âlemlerin rabbi, rahim ve rahman, kıyamet gününün tek hâkimi olan Allah'a mahsustur. Allah'tan başka ilâh yoktur. O dilediğini yapar. \"Ey Rabbim! Sen Allahsın, senden başka ilâh yok. Sen zenginsin biz muhtacız, bize yağmur indir. İndirdiğini bize kuvvet ve bir zamana ulaştıracak azık kıl.” Sonra Resûlullah (S.A.V.) ellerini kaldırdı, bu kaldırışa koltuklarının beyazı görününceye kadar devam etti. Bilâhere sırtını cemaate döndü, cübbesini ters çevirdi. Bunları yaparken elleri hâlâ kalkıktı. Daha sonra insanlara doğru döndü, minberden inip iki rekat namaz kıldırdı. Hemen akabinde Allah bir bulut meydana getirdi bunun peşinden gök gürledi, şimşek çaktı, sonra Allah'ın izni ile yağmur yağdı. Peygamber (yollardan) seller akmcaya kadar mescidine gelmedi. İnsanların (yağmurdan korunmak için) kuytuya koştuğunu görünce azı dişleri görünceye kadar güldü ve şöyle buyurdu: \"Şehâdet ederim ki Allah, herşeye kadirdir, ben de Allah'ın kulu ve resulüyüm.\" Ebu Davud dediki: Bu, isnadı güzel, garib bir hadistir. Medineliler okurlar. Bu hadis onlar için bir hüccettir. Diğer tahric: Hâkim el-Miistedrek, I, 328. Hakim Hadisin Şeybânın şartlarına uyduğunu söyler. Beyhakî, es-Sünenüi-kiibrâ, III, 349",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "Enes (r.a.)'den; demiştir ki: Resûlullah (S.A.V.) zamanında Medine'lilere kıtlık isabet etti. Efendimiz bir cuma günü bize hutbe irad ederken aniden bir adam kılkıp: Yâ Resulallah! Beygir sürüleri, koyunlar helak oldu. Bize yağmur yağdırması için Allah'a dua ediver, dedi. Bunun üzerine Hz. Peygamber ellerini uzattı (kaldırdı) ve duâ etti. -Enes (devamla) dedi ki:-(O esnada) gökyüzü cam gibi (parlak) idi. Bir rüzgâr esti, bir bulut meydana getirdi. Sonra bulutlar bir araya toplandı ve semâ ağzını açıverdi. (Yağdırdıkça yağdırdı). Biz (mescitten) çıktık evlerimize gelinceye kadar suyun içinde yürüdük. Sonraki cumaya kadar yağmur yağmaya devam etti. Bu sefer yine aynı adam veya bir başkası kalkıp; - Ya Resûlullah! Evler yıkıldı. Allah'a dua ediversen de yağmuru durdursa, dedi, Efendimiz gülümsedi, sonra; \"üstümüze değil, etrafımıza\" dedi. Akabinde bulutlara baktım, sanki bir tâç gibi Medine'nin etrafına doğru yayılıyordu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1175,
			"arabicnumber": 1175,
			"text": "Şerîk b. Abdullah b. Ebî Nemir, Enes (r.a.)'i (bir önceki 1174.) Abdülaziz hadisinin benzerini söylerken işittiğini bildirdi. (Farklı olarak Şerîk) şöyle dedi; Resûlullah (S.A.V.) ellerini yüzünün hizasına kadar kaldırıp; \"Ey Allah'ım!... Bize yağmur yağdır...\" diye dua etti. Şerîk (bundan sonra) Abdülazîz hadisinin benzerini nakletti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1176,
			"arabicnumber": 1176,
			"text": "Amr b. Şuayb babası (Şuayb) vasıtasıyla dedesi (Abdullah b. Amr b. el-As)'ın şöyle dediğini haber verdi: Resûlullah (S.A.V.) yağmur duası yaptığı zaman: \"Ya Rabbi! Kullarını ve hayvanlarını sula (yağmur ver), rahmetini yay ve ölü memleketini ihya et\" derdi. Bu lâfız (râvî) Mâlik'in rivayetidir. Hadis-i şerif, müellife iki ayrı yoldan İntikal etmiştir. Bunlar Yahya b. Said'de birleşmekle beraber, Yahya'dan sonra Mâlik ve Sufyan olmak üzere ayrılıyorlar. Bu metin, Mâlik'in rivayet eîtiği oluyor. Diğer tahric: Muvatta', istiskâ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": 1177,
			"text": "Âişe (r.anha)'den; demiştir ki: Resûlullah (S.A.V.) zamanında güneş tutuldu. Bunun üzerine Efendimiz uzun müddet kıyamda kaldı. (Namaz kıldı) insanlara da kıyam yaptırıyor, sonra rükûa varıp doğruluyor, sonra tekrar rükû'a varıp yine doğruluyor, sonunda tekrar rükû'a varıp -her rekatte üç rükû olmak ve üçüncü rükûdan sonra secdeye varmak suretiyle- iki rekat na­maz kıl(ıyor)dı. Hatta o gün kıyamın uzunluğundan dolayı (bazı) insanlar bayılır da üzerlerine su kovaları dökülürdü. Resûl-i Ekrem (bu namazda) rükû'a vardığı zaman \"Allahu Ekber\", doğrulduğu zaman da \"Semiallahü Iimen hamideh\" derdi. Hz. Peygamber'in bu namazı güneş açılıncaya kadar devam etti. Sonunda Efendimiz şöyle buyururdu: \"Şüphesiz güneş ve ay bir kimsenin ölümü ya da hayatı (doğumu) için tutulmazlar. Ama onlar Allah azze ve celle'nin âyet (alametlerinden iki âyettirler. Allah onlarla kullarım korkutur. O halde ay ve güneş tutulursa hemen namaza sığınınız)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "Câbir b. Abdillah'den; demiştir ki: Resûlullah (S.A.V.) zamanında güneş tutuldu. Bu, Peygamber (S.A.V.)'in oğlu İbrahim öldüğü gün olmuştu. İnsanlar, \"Güneş ancak İbrahim öldüğü için tutuldu\" dediler. Bunun üzerine Peygamber (S.A.V.) kalkıp cemaate dört secdede (iki rekatte) altı rükû' ile namaz kıldırdı. (Bu namazda) önce tekbir aldı, sonra (Kur'ân) okuyup kıraati uzattı. Sonra rükû'a eğilip kıyamda kaldığı kadar rüku'da kaldı. Bilâhere başını kaldırıp önceki kıraatten biraz daha az okudu. Tekrar rükû'a va­rıp kıyamdaki kadar kaldı. Sonra yine başını kaldırıp ikincisinden az olmak üzere üçüncü defa okudu. Yine başını kaldırıp secdeye kapandı. İki kere secde yapıp ayağa kalktı. (İkinci rekatte de) secde etmeden önce üç defa rükû' yaptı. Bu rükûların her biri kendisinden sonraki rükûdan daha uzundu. Ancak bunlar, kıyamı kadarlardı. Resûlullah (bundan) sonra namazda olduğu yerinden biraz geriledi. Bunu gören cemaat de onunla birlikte geriledi. Sonra ilerleyip yine eski yerine durdu. Bunun üzerine saflar (cemaat) da ilerlediler. Resûlullah, güneş doğarken namazını tamamlayarak (cemaate) şöyle hitab etti: \"Ey insanlar! Şüphesiz güneş ve ay Allah'ın kudretine (delâlet eden) âyetlerinden iki âyettirler. Bir beşerin ölümünden dolayı tutulmazlar. O halde siz bunu (güneş veya ay tutulmasını) gördüğünüz za­man (açılıncaya kadar) namaz kılınız.\" (Râvi Ahmed b. Hanbel) bundan sonra hadisin kalanını söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1179,
			"arabicnumber": 1179,
			"text": "Cabir (r.a.)'den; demiştir ki: Resûlullah (S.A.V.) zamanımda çok sıcak bir günde güneş tutuldu. Bunun üzerine Resûlullah (S.A.V.) ashabına namaz kıldırdı. Kıyamı o kadar uzattı ki sahabîler (yere) düşmeye başladılar. Sonra rükû' edip (onu da) uzattı. Sonra doğrulup uzun süre durdu. Sonra yine rüku edib uzun süre (rükû'da) kaldı. Bilâhere yine doğrulup onu da uzattı. Daha sonra iki defa secde edip kalktı ve bunların (ilk rekatte yaptıklarının) aynısını yaptı. (Böylece) Hz. Peygamberin namazı dört rükû ve dört secde (olmuş) oldu. (Ravi bundan) sonra hadisin devamını zikretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1180,
			"arabicnumber": 1180,
			"text": "Nebi (S.A.V.)'in hanımı Âişe (r.anha)'dan; demiştir ki: Resûlullah (S.A.V.)'in sağlığında güneş tutuldu. Efendimiz hemen mescide gidib (namaza) durdu ve tekbir aldı. İnsanlar da onun peşinde saf tuttular. Hz. Peygamber uzun uzun okudu, sonra tekbir alıp rükû'a vardı (ve) uzun zaman rükû'da kaldı. Sonra başını kaldırıp \"Semiallahu limen-hamideh, Rabbena ve leke'I-hamd\" dedi ve kıyama durdu. Yine uzun uzun okudu, (ama) bu ilk kıraatten daha az idi. Bilâhere tekrar tekbir alıp uzun bir rükû' yaptı. Bu rükû evvelkinden daha kısa idi. Sonra \"Semiallahu limen hamideh Rabbena ve leke'I-hamd\" dedi. Diğer rekâtte de bunlar (ilk rekattakiler) gibi yapıp dört rükû ve dört secdeye tamamladı. Resûlullah namazdan ayrılmadan önce güneş açıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1181,
			"arabicnumber": 1181,
			"text": "Abdullah b. Abbâs (r.anhumâ), Resûlullah (S.A.V.)'in güneş tutulduğunda namaz kıldığını haber verirdi. (Abdullah) Urve'nin, Hz. Âişe'den onun da Peygamber (S.A.V.)'den rivayet ettiği hadis gibi Resûlullah (S.A.V.)'in her rekatte iki rükû’ olmak üzere, iki rekat namaz kıldığını bildirirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1182,
			"arabicnumber": 1182,
			"text": "Ubeyy b. Ka'b (r.a.)'dan; demiştir ki: Resûlullah (S.A.V.) zamanında güneş tutuldu. Efendimiz cemaate namaz kaldırarak uzun sûrelerden birini okudu ve beş defa rükû yaptı, îki kere secde etti ve ikinci rekate kalkıp yine uzunlardan bir sûre okudu ve yine beş defa rükû yaptı, iki kere secde etti, sonra güneşin tutulması açılıncaya kadar duâ ederek olduğu halde kıbleye karşı oturdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1183,
			"arabicnumber": 1183,
			"text": "İbn Abbâs (r.anhumâ); Resıuullah (s.a.v:) güneş tutulduğunda namazı kıldı. Bu namazda, (Kur'ân'dan) okudu.Sonra rükû' yaptı sonra yine okudu ve yine rükû’ yaptı, sonra tekrar okuyup rükû' yaptı, sonra yine okudu ve rükû'a vardı. Daha sonra da secdeye kapandı. İkinci rekatı de aynen böyle kıldı., demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1184,
			"arabicnumber": 1184,
			"text": "Semure b. Cündüb (r.a.)'den; demiştir kî: Ben ve Ensârdan bir çocuk hedeflerimize ok atarken güneş bakanın gözünde iki veya üç mızrak kadar olunca, Tennûme bitkisi gibi oluncaya kadar karardı. Birimiz arkadaşına; \"Haydi mescide gidelim. Vallahi güneşin şu hali, Resûlullah (S.A.V.) de ümmeti hakkında yeni bir şey meydana getirecek\" dedi ve koşarak gittik. Bir de gördük ki Resûlullah (S.A.V.) mescide çıkmış. Efendimiz öne geçip namaz kıldırdı. Bizi daha önceki namazlarındaki en uzun kıyamı gibi kıyamda tuttu. Sesini işitmiyorduk. Sonra bize önceki namazlarındaki en uzun secdesi gibi secde ettirdi. (Burada da) sesini işitmedik. Diğer rekatte de aynen bunun gibi yaptı. Güneşin açılması ikinci rekattaki oturuşuna denk geldi. Sonra selam verdi. Daha sonra kalkıp Allah'a hamd ve sena etti. Allah'tan başka ilâh olmadığına ve kendisinin O'nun kulu ve Resulü olduğuna şehâdet etti. Bundan sonra Ahmed b. Yûnus, Resûlullah (s.a.v.)'in hutbesini zikretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "Kabîsa el-Hilâlî'den; demiştir ki: Resulullah (S.A.V.) zamanında güneş tutuldu. Bunun üzerine Hz. Peygamber (S.A.V.) telaşla ve sür'atle çıktı. O gün ben de Medine'de onunla beraberdim- iki rekat namaz kıldırıp ikisinde de kıyamı uzattı. Sonra (namazdan) ayrıldı ve güneş açıldı. Akabinde Efendimiz şöyle buyurdu: \"Bunlar (güneş ve ay tutulmaları) ancak Allah'ın kendileri ile korkuttuğu alâmetlerdir. Onları gördüğünüz zaman en yeni (son) kıldığınız farz namaz gibi namaz kılınız",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1186,
			"arabicnumber": 1186,
			"text": "Kabisa el-Hiiali, \"Şüphesiz güneş tutuldu\" (diye başlayıp) Musa (b. İsmail) hadîsinin manasını rivâyet etti. (Ahmed b. İbrahim bu rivâtette); \"Resûluilah devrinde güneş tutuldu) o kadar ki, yıldızlar göründü” demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1187,
			"arabicnumber": 1187,
			"text": "Âişe (r.anhâ)'den; demiştir ki: Resûlullah (S.A.V.) zamanında güneş tutuldu. Bunun üzerine Peygamber (mescide) çıkıp cemaate namaz kıldırdı. (Bu namazda) kıyama durdu. (Kıyamdaki) kıraatini tahmîn ettim. Bakara Sûresi (kadarı)nı okuduğunu zannettim. Râvi hadisi sevkedip şöyle devam etti: Sonra iki defa secde yaptı, sonra kalkıp kıraati yine uzattı. Onun buradaki okuyuşunu da tahmin ettim. Âl-i İmran Suresi (kadarı)nı okuduğunu zannettim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "Âişe (r.anha)'den rivayet edildiğine göre; Resûlullah (S.A.V.) (küsûf namazında) kıraati uzun tutmuş ve açıktan okumuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "İbn Abbâs (r.a.)'dan; demiştir ki: Güneş tutuldu. Bunun üzerine Resûlullah (S.A.V.) insanlarla birlikte namaz kıldı. (Bu namazda) kalkıp uzun (müddet) ayakta durdu. (Bu duruş) Bakara Suresi(ni okuyacak) kadardı. Sonra rükû yaptı. Râvî (bundan sonra) hadisin kalanını aktardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": 1190,
			"text": "Âişe (r.anhâ)'den; demiştir ki: Güneş tutuldu, bunun üzerine Resûlullah (S.A.V.) bir adam'a emretti, o da, \"şüphesiz namaz toplayıcıdır\" diye nida etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1191,
			"arabicnumber": 1191,
			"text": "Âişe (r.anhâ)'den; rivayet edildiğine göre, Nebi (S.A.V.) şöyle buyurmuştur: \"Güneş ve ay, bir kimsenin ölümü veya hayatı için tutulmazlar. O halele tutulduklarını gördüğünüz zaman Allah azze ve celle'ye dua ediniz, tekbir getiriniz ve sadaka veriniz.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": 1192,
			"text": "Esma (bint Ebî Bekir)'den; demiştir ki: Resûlullah (S.A.V.) küsûf namazı ile birlikte köle azad edilmesini emr ederdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": 1193,
			"text": "en-Nu'mân b. Beşîr'den; demiştir ki: Resûlullah (S.A.V.) zamanında güneş tutuldu. Bunun üzerine, Hz. Peygamber güneş açılıncaya kadar iki rekat, iki rekat namaz kılmaya başladı. (Her iki rekatın bitiminde) güneşin açılıp açılmadığını (cemaate) soruyor(du)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": 1194,
			"text": "Abdullah b. Amr (b. el-Âs)'den; demiştir ki: Resûlullah (S.A.V.) zamanında güneş tutuldu. Bunun üzerine Efendimiz (namaza) durdu. (Kıyamı o kadar uzattı ki) nerdeyse rükû'a eğilmeyecekti. Sonra sanki doğrulmayacakmış gibi (uzun) bir rükû yaptı. Daha sonra başım kaldırdı (ve) secdeye varmayacakmış gibi (ayakta kaldı). Sonunda secdeye kapandı, bunu da sanki başını kaldırmayacakmış gibi uzattı. Sonra (secdeden) kalkıp aynı şekilde uzun zaman oturarak kaldı. Akabinde (ikinci) secdeyi yapıp, kafasını kaldırmayacakmış gibi bunu da uzattı. Sonra doğruldu. (İkinci rekate kalktı) diğer (ikinci) rekatte de aynen böyle yaptı ve secdesinin sonunda \"Üf üf” diye üfledi. Sonra da; \"Ey Rabbim! Sen, ben aralarında iken onlara azab etmeyeceğini va'detmedin mi? Onlar istiğfara devam ettikçe kendilerine âzab etmeyeceğini va'd etmedin mî?\" deyip namazını bitirdi. Bu esnada güneş de açılmıştı. Bundan sonra (Saib b. Mâlik) hadisin kalan, kısmını zikretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": 1195,
			"text": "Abdurrahman b. Semure (r.a.)'den; demiştir ki: Resûlullah (S.A.V.)'in sağlığında ben ok atarken birden bire güneş tutuldu. Hemen okları (yere) attım ve (kendi kendime) \"güneş tutulması bugün Resûlullah (S.A.V.)'e neler yaptıracak bakacağım\" deyip doğru ona gittim. Peygamber (S.A.V.) ellerini kaldırmış tesbih, tahmid ediyor, tehlîl getiriyor ve dua ediyordu. Bu, güneş açılıncaya kadar devam et­ti. (Efendimiz) iki sûre okudu ve iki rekat namaz kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": 1196,
			"text": "Ubeydullah b. Nadr, babası (Nadr)'ın şöyle dediğini rivayet etmiştir: Enes b. Mâlik zamanında (şiddetli) bir karanlık oldu. Bunun üzerine Enes'e gelip: Ya Ebâ Hamza [Ebu Hamza Enes r.a.'tır] Resûlullah (S.A.V.) zamanında böyle birşey başınıza gelir miydi?, dedim. Allah korusun. (Bazan) rüzgâr şiddetlenirdi de kıyametin (kopacağı) korkusuyla mescide koşardık, karşılığını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": 1197,
			"text": "İkrime'den; demiştir ki: İbn Abbâs (r.anhümâ)'ya; \"Resûl-i Ekrem'in hanımlarından falan öldü\" denildi. Bunun üzerine hemen secdeye kapandı. Kendisine: Şu saatte secde mi yapıyorsun? denildi. Şu karşılığı verdi: Resûlullah (Sallallahu aleyhi ve Sellem), \"Önemli bir hâdise gördüğünüz zaman secde ediniz\" buyurdu. Resul-i Ekrem'in hanımlarının gitmesinden daha büyük hangi hadise vardır?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 37
			}
		}
	]
}