{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"30": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3904,
			"arabicnumber": 3904,
			"text": "Ebû Hureyre (r.a)'den rivayet olunduğuna göre; Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Kim (gaipten haber almak gayesiyle) bir kâhine giderse\" Musa (b. İsmail, şu cümleyi de) nakletti: \"Ve onun söylediğini tasdik ederse\" -(Hadisin bundan) sonra (ki kısmında Müsedded ile Musa) birleşerek şu sözü rivayet ettiler: \"Kim de (cinsi münasebet için) bir kadın'a varırsa\", (-Ancak burada) Müsedded, \"karısına hayızlı iken ve dübüründen (yaklaşırsa)\" demiştir.- (Hadis şöyle sona eriyor): \"O kimse Allah'ın Muhammed'e indirdiği (dinin dairesi)nden dışarı çıkmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3905,
			"arabicnumber": 3905,
			"text": "İbn Abbas'dan rivayet olunduğuna göre; Rasûlullah (s.a.v.): \"- Yıldızlardan bir ilim alan kimse sihirden bir bölüm almış olur. (Yıldızlardan aldığı bilgiler) arttıkça (sihirle olan ilgisi de) artmış olur\" buyurmuştur. Bu hadis İbn Mâce, edeb; Ahmed b. Hanbel, I, 227, 311. de de var. İzah, 3906 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "Zeyd b. Halid el-Cühenî'den rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) Hudeybiye'de geceleyin (yağan) bir yağmurdan sonra bize sabah namazını kıldırdı. (Namaz) bitince halka dönüp: \"Rabbinizin ne dediğini biliyor musunuz?\" dedi. (Orada bulunan halk): Allah ve Rasûlü daha iyi bilir, dediler. (Bunun üzerine Hz. Peygamber şöyle) buyurdu: \"(Rabbiniz buyuruyor ki:) Kullarımdan bir kısmı bana iman edici, bir kısmı da (beni) inkâr edici olarak sabahladı. 'Allah'ın fazlı ve rahmeti ile (bu gece) bize yağmur yağdı' diyenler bana iman etmiştir. Yıldızları da inkâr edicidir. Fakat, 'şu veya bu yıldız'ın hareketi sayesinde bize yağmur yağdı' diyenler ise beni inkâr etmiş, yıldızlar'a iman etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3907,
			"arabicnumber": 3907,
			"text": "(Katan b. Kabîsa'nın) babası dedi ki: Ben Rasûlullah (s.a.v.)'i şöyle buyururken işittim: \"Kuş uçur(arak, bu uçuştan hüküm çıkar)mak, uğursuzluğa inanmak, çakıl taşları ile fal açmak put'a tapıcılıktandır.\" (Musannif Ebû Dâvûd dedi ki: Bu hadiste geçen) \"Tark\" (kelimesi, kuş) uçurmak; \"el-ıyâfe\" (kelimesi de; kum üzerine) çizgi çizmek anlamına gelir. Bu hadis Ahmed b. Hanbel, III, 447. de geçer. İzah, 3909 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3908,
			"arabicnumber": 3908,
			"text": "Avf (el-Arabî); \"el-Iyâfe, kuş uçur(tarak kuşun uçuşundan istikbale ait manalar çıkar) maktır. Tark da, yere çizilen çizgidir\" demiştir. İzah, 3909 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3909,
			"arabicnumber": 3909,
			"text": "Muaviye b. el-Hakem es-Sülemî'den rivayet olunmuştur; dedi ki: Ben (Nebi s.a.v.'e hitaben); Ey Allah'ın Rasûlü, bizden bir takım adamlar da (istikbale dair bilgiler keşfetmek için) çizgi çiziyorlar, dedim. (Nebi (s.a.v.) de:) \"Nebilerden biri (böyle) çizgi çizerdi. Her kim (çizgisini onun) çizgisine uygun düşürürse, o kimse (gerçeğe isabet etmiş olur)\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3910,
			"arabicnumber": 3910,
			"text": "Abdullah b. Mes'ud'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) üç defa, \"Uğursuzluğa inanmak şirktir, uğursuzluğa inanmak şirktir\" buyurdu. Oysa bizden (kalbinde bu düşünce geçmeyen bir kimse) yoktur. Fakat Allah bu duyguyu tevekkülle giderir. Ayrıca bu hadis Tirmizî siyer; İbn Mâce, tıb; Ahmed b. Hanbel, I, 389, 438, 440. ta da var. İzah, 3916 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "Ebû Hureyre (r.a)'den rivayet olunduğuna göre; Resulullah (s.a.v.): “Hastalık bulaşması, uğursuzluk, (karında bulunan yılan gibi bir hayvanın hareketinden doğan bir) karın ağrısı ve (uğursuzluk getiren bir) baykuş yoktur\" buyurmuş. Bunun üzerine (orada bulunan) bir bedevi: (Ey Allah'ın Rasûlü), peki kumda geyik gibi (sıhhatli) oldukları halde (içlerine) karışıp da kendilerini uyuzlaştırdığı uyuz devlerin hali nedir? dedi. (Hz. Nebi de ona): \"Ya birinciye kim bulaştırdı?\" karşılığını verdi. Mâ'mer'in Zührî'den, (Zührî'nin de) bir adamdan rivayet ettiğine göre, Ebû Hureyre; Rasûlullah (s.a.v.)'i: **Deveterı hasta olan kimseler (develerini), develeri sağlam alan kimseler(in develerinin yanın)a götürmesinler\" derken işittiğini söylemiş. Bunun üzerine (bu sözü Ebû Hureyre'den dinleyen) adam Ebû Hureyre'ye dönüp: Sen bize (daha önce) Nebi (s.a.v.)'in, \"Hastalık bulaşması da yoktur, (karında bulunan bir yılan hareketinden doğan bir) karın ağrısı da yoktur, (uğursuzluk getiren bir) baykuş da yoktur.\" dediğini söylememiş miydin? demiş. Ebû Hureyre de: \"Bunu size ben söylemedim\" karşılığını vermiş. Zührî dedi ki: Ebû Seleme, \"Ebû Hureyre'nin bu hadisi rivayet ettiğini\" (söyledi) ve: \"Ben Ebû Hureyre'nin bu hadisten başka (rivayet ettiği) bir hadisi unuttuğunu duymadım.\" dedi. Ayrıca bu hadis Buhari, tıb; Müslim, selâm; İbn Mâce, tıb, mukaddime de var. İzah, 3916 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3912,
			"arabicnumber": 3912,
			"text": "Ebû Hureyre'den rivayet olunduğuna göre; Rasûlullah (s.a.v.): \"Hastalığın(sebepsiz olarak) bulaşması, (uğursuzluk getiren) baykuş, (insanların kaderine hükmeden bir) yıldız batması, (karında bulunan bir yılanın hareketlerinden doğan ve başkalarına bulaşan bir) karın ağrısı yoktur\" buyurdu. Ayrıca bu hadis Buharî, tıb; Müslim, selâm; İbn Mâce, mukaddime, tıb; Ahmed b. Hanbel, I, 174, 180, 269, 328, II, 25, 153, 222, 266, 267, 406,420,434,453,487,507,524, III, il8, 130, 154, 173, 178,251,276,278,293,312. de var. İzah, 3916 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3913,
			"arabicnumber": 3913,
			"text": "Ebû Hureyre'den rivayet olunduğuna göre; Rasûlullah (s.a.v.): “(Kırlarda çeşitli kılıklara girerek insanların yolunu kaybettirebilecek güce sahip bir) cin taifesi yoktur\" buyurmuştur. Ayrıca bu hadis Müslim, selâm; Ahmed b. Hanbel, III, 293, 312, 382. de var. İzah, 3916 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3914,
			"arabicnumber": 3914,
			"text": "Ebû Dâvûd dedi ki: Eşheb (şöyle) dedi: (İmam) Mâlik'e, \"lâ safere\" sözü(nün manası) soruldu da; \"Cahiliye halkı Safer ayını helâl (aylardan) sayarlardı. (Sonradan) onu bir sene helâl, bir sene de haram saymaya başladılar. Hz. Nebi (s.a.v. de onların bu âdetini kaldırmak için); \"(Böyle bir sene helâl, bir sen< de haram sayılan) bir Safer (ayı) yoktur\" buyurdu\" cevabını verdi. Ayrıca bu hadis Buharî, tıb; Müslim, selâm; Tirmizî, kader; İbn Mâce, tıb; Muvatta, ayn; Ahmed b. Hanbel, I, 269, 338, 400, II, 268, 327, 397, III, 382, 450. de var. İzah, 3916 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3915,
			"arabicnumber": 3915,
			"text": "Bakiyye dedi ki: Ben Muhammed b. Râşid'e hadisteki \"hâm = baykuş\" kelimesini sordum da;\" Cahiliye dönemi (halkı) 'Ölüp de defnedildikten sonra bir baykuş olarak mezarından çıkmayan kimse yoktur' derlerdi, (işte hâm budur)\" diye cevap verdi. (Bunun üzerine): \"Pekâla Safer nedir?\" dedim. (Muhammed b. Râşid de): İşittiğime göre cahiliye halkı Safer ayını uğursuz sayarlarmış da Nebi (s.a.v.):\"Safer ayında (bir uğursuzluk) yoktur\" buyurmuş\" dedi. (Muhammed b. Râşid sözlerine devam ederek şöyle) dedi: \"Biz 'Safer, karında tutan bir ağrıdır' diyeni de işittik. (Bu görüşte olan cahiliye halkı) 'bu ağrı (başkasına da) bulaşır' derlerdi. Bunun üzerine (Hz. Nebi), \"Safer (denilen böyle bir ağrı) yoktur\" buyurdu.\" Ayrıca bu hadis Ahmed b. Hanbel, 1, 269, III, 382. de var. İzah, 3916 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3916,
			"arabicnumber": 3916,
			"text": "Enes (ra.)'den rivayet olunduğuna göre; Nebi (s.a.v.): \"Hastalık bulaşması da yoktur, uğursuzluk da yoktur. Ben yararlı olan hayırlı ve uğurlu saymadan hoşlanırım. Yararlı olan hayırlı ve uğurlu saymak ise, güzel söz(lerle yapılan hayırlı yorumlar)dır\" bu­yurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3917,
			"arabicnumber": 3917,
			"text": "Ebû Hureyre (r.a)'den rivayet olunduğuna göre; Rasûlullah (s.a.v.), hoşuna giden bir söz işitmiş de (bu sözü söyleyen kimseye): \"Senin uğurunu ağzından aldık\" buyurmuş. İzah, 3925 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3918,
			"arabicnumber": 3918,
			"text": "Atâ (r.a)'dan rivayet olunmuştur; dedi ki: \"Halk; Safer, karında tutan bir ağrıdır, diyor.\" (Bu hadisi Atâ'-dan rivayet eden İbn Cüreyc dedi ki); Ben(de Atâ'ya); \"Pekâlâ) bay­kuş nedir? diye sordum. (Atâ şöyle) cevap verdi: Halk, (evlerin üzerine konup da acı acı) öten baykuş, halk bay­kuşudur, diyor. (Aslında bu baykuş ölünün kemiğinden ya da başın­dan çıkıp da baykuş şekline giren ve sady ismi olan) insan baykuşu değildir. (Senin sorduğun) baykuş, sadece (bildiğimiz) bir hayvandır. İzah, 3925 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3919,
			"arabicnumber": 3919,
			"text": "Urve b. Amr el-Kureşî dedi ki: Nebi (s.a.v.)'in yanında (bir şeyle karşılaşmayı iyiye veya) kötüye yorma(nın hükmünden) bahsedildi de Nebi (s.a.v.) şöyle buyurdu: \"Bu yorumların en iyisi iyiye yormaktır. (Aslında bir şeyi kötüye yorumlamak bile) bir müslümanı (yapılması gereken bir işi yapmaktan) geri çeviremez. (Binaenaleyh) sizden biriniz hoşlanmadığı bir şey'i görünce; 'Ey Allah'ım, güzellikleri senden başkası veremez. Kötülükleri de senden başkası önleyemez. Binaenaleyh, (kötülüğü önlemek için gerekli olan) güç de (güzelliği elde etmek için gerekli olan) kuvvet de ancak senindir* diye dua ediniz.” İzah, 3925 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "Ebû Büreyde(nin) babasından rivayet olunduğuna göre; Nebi (s.a.v.) hiç bir şeyi uğursuz saymazmış. (Bir yere) bir tahsildar göndereceği zaman (önce) ismini sorarmış, eğer (onun) ismini beğenirse bu isimden memnun olurmuş ve bu sevinç yüzünde görülürmüş. Eğer beğenmezse bu hoşnutsuzluk yüzünde görülürmüş, (fakat böyle hoşa gitmeyen bir isimle karşılaşmayı kötüye yormazmış). Bir köye girdiği zaman da (yine köyün ismini sorarmış, eğer (köy'ün) ismini beğenirse sevinirmiş ve bu sevinç(in belirtileri yüzünde görülürmüş). Eğer (köyün) ismini beğenmezse bu hoşnutsuzluk yüzünde görülürmüş, (fakat böyle hoşa gitmeyen bir isimle karşılaşmayı kötüye yormazmış). Ayrıca bu hadis Ahıned b. Hanbel, I, 257, 304, 319, V, 347. de var. İzah, 3925 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3921,
			"arabicnumber": 3921,
			"text": "Said b. Mâlik'den (rivayet olduğuna göre; Rasûlullah (s.a.v.); \"(Uğursuzluk getiren bir) baykuş da yoktur, (kendiliğinden zuhur eden bir) hastalık bulaşması da yoktur, uğursuzluk da yoktur. Eğer bir şeyde uğursuzluk olursa (o da sert başlı) atta, (isyankâr) kadında ve (dar) evde olur\" buyurmuş. Ayrıca bu hadis Ahmed b. Hanbel, II, 289, VI, 150, 240, 246. da var. İzah, 3925 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3922,
			"arabicnumber": 3922,
			"text": "Abdullah b. Ömer'den rivayet olduğuna göre; Rasûlullah (s.a.v.): \"Uğursuzluk (dar) evde, (isyankâr) kadında, (sert başlı) attadır\" buyurmuştur. Ebû DâvOd dedi ki: (Bu hadis) Haris b. Miskîn'e okundu, ben de orada idim. Kendisine: (Bunu) sana İönü '/-Kasım haber verdi mi? diye soruldu. (Haris b. Miskin de şöyle) dedi: Kadındaki ve evdeki uğursuzluk (İmam) Mâlik 'e soruldu da, \"Nice evler var ki onlarda oturan insan/ar helak oldular. Sonra onlara başkaları oturdu, (onlar da) helak oldular. Bizim görüşümüze göre bu (durum, bu hadisin) tefsiri­dir. Allah daha iyi bilir\" cevabını verdi. Yine Ebû Davûd dedi ki: Ömer (r.a); evdeki bir hasır çocuk dünyaya getirmeyen bir kadından daha hayırlıdır\" buyurdu. Ayrıca bu hadis Buharî, cihad, nikâh, tıb; Müslim, selâm; Tirmizi, edeb; Nesâî, hayl; İbn Mâce, nikâh; Muvatta, isti'zan; Ahmed b. Hanbel, II, X, 36, 115, 126.da var. İzah, 3925 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3923,
			"arabicnumber": 3923,
			"text": "Ferve b. Müseyk'den rivayet olmuştur; dediki: Ben (Nebi (s.a.v.)'e; Ey Allah'ın Rasûlü, bizim elimizde \"Ebyen\" denilen bir arazi var. Bu bizim çiftliğimizin ve ziraat mahsullerimizin arazisidir; ve bu arazide veba hastalığı vardır. -Yahutla buranın vebası çok şiddetlidir.-(Ne yapmamı tavsiye edersiniz)? diye sordum. \"Orayı terket. Çünkü ölüm (böyle bulaşıcı hastalıklara) yakın durmaktan ileri gelir\" buyurdu. İzah, 3925 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3924,
			"arabicnumber": 3924,
			"text": "Enes b. Mâlik (r.a)'den rivayet olunduğuna göre; Bir adam Hz. Nebi'e gelerek); Ey Allah'ın Rasûlü, biz bir evde yaşıyorduk; orada (iken) sayımız ve mallarımız çoktu. Derken başka bir eve göç ettik, orada ise sayımız da azaldı mallarımız da, demiş. Rasûlullah (s.a.v.) de: “Kölü bir yer olduğu için orayı terkediniz\" buyurmuş. İzah, 3925 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3925,
			"arabicnumber": 3925,
			"text": "Câbir (r.a)'den rivayet olunduğuna göre: Rasûlullah (s.a.v.); bir cüzzamlının elini tutarak onu kendi (eli) ile birlikte (yemek) kab(m)a koymuş ve; \"Allah’a güvenerek (benimle birlikte) ye, ben de Allah'a güveniyorum\" buyurmuş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 22
			}
		}
	]
}