{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"31": "The Book of Manumission of Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3926,
			"arabicnumber": 3926,
			"text": "Amr b. Şuayb'ın dedesinden rivayet olunduğuna göre, Nebi (s.a.v.) \"Hürriyetine kavuşmak için efendisine belli bir para ya da mal vermek üzere) kitabet anlaşması yapan bir köle, vermeyi vaad ettiği şeyden üzerinde (ödenmedik) bir dirhem kaldığı sürece (yine) köledir.\" buyurmuştur. Diğer tahric: Tirmizî buyu' muvatta, mükateb",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3927,
			"arabicnumber": 3927,
			"text": "Amr b. Şuayb'ın dedesinden rivayet olunduğuna göre; Nebi (s.a.v.) şöyle buyurmuştur: \"Hürriyetini geri almak için efendisiyle yüz ukiyye (vermek) üzere kitabet akdi yapan bir köle bunu öder de (üzerinde ödenmedik) sadece on ukkıye kalırsa o (yine) köledir. Yüz dinar üzerine anlaşıp da on dinarı ödemeyen köle de yine köledir.\" Ebu Davud dedi ki: (Bu hadisin senedinde bulunan Abbas el-Cüreyri o, (gerçekten) Abbas el-Cüreyri olamaz. (Hadis alimleri) bunun bir yanlışlık olduğunu ve başka bir ravi olabileceğini söylediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3928,
			"arabicnumber": 3928,
			"text": "Ümmü Seleme'nin mukateb kölesi Nebhân'dan rivayet olunduğuna göre; kendisi, Ümmü Seleme'ye şöyle derken işitmiş: Resulullah (s.a.v.) bize dedi ki: \"(Ey kadınlar topluluğu), birinizin bir mukateb kölesi varsa ve bu kölenin yanında (size olan borcunu) ödeyecek kadar da mal varsa artık o bu köleye karşı (çarşafıyla) örtülü bulunsun",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "Aişe (ranha)'nın Urve'ye verdiği haber'e göre: (Bir gün) Berire (efendisiyle imzalamış olduğu) ve (henüz) borcundan bir şey ödemediği kitabet anlaşmasında kendisine yardımcı olmasını rica etmek üzere Aişe'ye gelmiş. Aişe de ona, \"Efendilerine dön, eğer senin velâ (y-ı ıtak)'ın bana ait olmak üzere (senin bu) borcunu senin yerine ödememe razı olurlarsa (bunu) yaparım\" demiş. (Bunun üzerine) Berire (gidip) efendilerine bunu anlatmış, (fakat onlar bunu) kabul etmemişler ve, \"Sana (yapacağı bu işin sevabını Allah'dan) umarak vela (hakkı) da bizim olmak üzere (yaparsa) yapsın\" demişler. Bunun üzerine (Hz. Aişe) durumu Resulullah (s.a.v.)'e arzetmiş. Resulullah (s.a.v.) da ona: \"Sen (bu cariyeyi) satın al ve hürriyetine kavuştur. Onların ileri sürdüğü şartların hiçbir önemi ve geçerliliği yoktur. (Çünkü) vela ancak hürriyete kavuşturan kimseye aittir.\" buyurmuş. Sonra (ayağa) kalkarak şöyle demiş: \"Bu insanlara ne oluyor da Allah'ın Kitabında olmayan birtakım şartlar ileri sürüyorlar. Allah'ın Kitab'ında bulunmayan bir şartı ileri sürmek suretiyle bir akit yap)miş olan kimse için (Bu şart'a uyulmasını isteme hakkı) yoktur. İsterse bu şartı yüz defa kabul ettirmiş olsun. (Çünkü Kur'an-ı Kerim'de bulunan) Allah'ın şartları hakkın ve sağlamlığın ta kendisidir.\" Ayrıca bu hadis; Buharî, salat, şurût, et'ime, ferâiz, talâk, keffaret, nikah. zekât, mükâteb, buyu': Müslim, ıtk: Ebû Dâvûd, ferâiz; Tirmizi, fersiz. vesaya. velâ; Nesâî, zekât , talâk, buyu'; îbn Mace, talâk. ilk; Ahmed b. Hanbel, I, 281,321. 11,28. 100, 113, 144, 153, 156, VI. 33, 42, 46, 82,103. 121, 135. 161, 172, 175, 178, 180. 186. 190. 213. 272. de de var. İzah, 3930 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "Urve (r.a.)'dan rivayet olduğuna göre; Aişe (r.anha) şöyle demiştir: Berire kitabet anlaşmasında (kendisine) yardım istemek üzere (yanıma) geldi ve, \"Ben (kendilerine) her sene bir okka (kırk dirhem gümüş, ödemek şartıyla) dokuz okkaya kitabet anlaşması yaptım, bana yardım et\" dedi. (Hz. Âişe sözlerine devam ederek) dedi ki: (Ben de kendisine) : \"Eğer efendilerin (senin taksitlerini) bir defada ödememe ve (Senin) velân bana ait olmak üzere seni hürriyetine kavuşturmama razı olurlarsa (ben bu işi yaparım\" (cevabını verdim). Bunun üzerine efendilerine gitti. (Ebu Davud der ki: Hadisin bundan sonraki kısmında ravi Hişam bir Önceki İbn Şihab ez-Zühri hadisinin aynısını rivayet etti. (Ancak bir ön­ceki hadiste geçen) Nebi (s.a.v.)'in sözünün sonuna ilâveten şunları rivayet etti: \"(Bu insanlara ne oluyor da birisi (kalkıp kendi kafasın­dan)'^ falanca (bu köleyi azad etmekten doğan) velâ (hakkı) bana aittir, diyebiliyorlar.Velâ (hakkı köleyi bizzat) hürriyete kavuşturan kimseye aittir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "Urve d. ez-Zübeyrden rivayet olunduğuna göre;; Aışe (r, anha) şöyle demiştir: Cüveyriye bin el-Haris b. el-Mustalik, (Beni Mustalik gazvesi sonunda) Sabit b. Kays. b. Şemmas'ın yahutta (Sabit'in) amcası oğlunun hissesine düşmüş ve (onunla) kendi üzerine bir kitabet anlaşması yapmıştır. (Cüveyriye) gözlerin kendisine takılıp kaldığı çok güzel bir kadındı. Aişe (r, anha) (sözlerine devam ederek) dedi ki: (Cüveyriye, yaptığı) kitabet anlaşmasında (yardım) istemek üzere Resulullah (s.a.v.)'e geldi. Kapı (ya kadar gelip de ora) da durunca kendisini gördüm. Fevkalade gü­zelliği ile Hz. Nebiin dikkatini çekeceğini düşünerek) durumundan hoşlandım. (Benim onda) gördüğümü Resulullah (s.a.v.)'inde göreceğini anladım. Cüveyriye, Hz. Nebie hitaben: Ey Allah'ın Resulü, ben (esir aldığın Mustalik oğullarının başkanı) Haris'in kızı Cüveyriye'yim. Benim (şu andaki) durumum sana gizli değildir. Ben Sabit b. Kays b. Şemmas'ın hissesine düştüm. Kendi hakkımda bir kitabet anlaşması yaptım. Sana (bu) anlaşmada (bana yardımcı olmanı) istemek için geldim, dedi. Resulullah (s..a.v.) de: \"Senin için bundan daha hayırlısına (bir istek) var mıdır?\" karşılığını verdi. (Cüveyriye): \"O nedir ey Allah'ın Resulü? diye sordu. (Hz. Nebi de): \"Senin kitabetini (n bedelini) öderim, (sonra azad edip) seninle evlenirim.\" cevabını verdi. (Cüveyriye de), \"Kabul ettim\" dedi. (Hz. Aişe sözlerine devamla şöyle) dedi: Halk Resulullah (s.a.v.)'in Cüveyriye ile evlendiğini işittiler. Bunun üzerine, ellerinde bulunan esirleri serbest bırakmaya başladılar, onları azad ettiler, ve; \"(Bunlar) Resulullah (s.a.v.)'in hanımı tarafından yakınıdırlar, demeye başladılar. \"Biz kavmi için Cüveyriye'den daha yararlı bir kadın görmedik. Onun sayesinde Mustalik oğullarından yüz (kadar) halkı hürriyetine kavuşturuldu. Ebû Davud dedi ki; Bu hadis velinin (velisi olduğu kızı) kendisi ile evlendirebileceğine dair kuvvetli bir delildir. Diğer tahric: Ahmed (hno:13599) İbnu'l-Carud (705), İbn Hibban (4054) vve Hakim (4/26) rivayet ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3932,
			"arabicnumber": 3932,
			"text": "Sefine (r.a)'dan rivayet olunmuştur; dedi ki: Ben Ümmü Seleme'nin kölesi idim. (Bir gün bana); Seni azad etmek isterim. (Fakat) yaşadığın sürece Resulullah (s.a.v.)'e hizmet edeceksin; dedi. Ben de: Sen bana (bunu) şart koşmasan bile ben (yine de) yaşadığım sürece Resulullah (s.a.v.)'e (hizmet) den ayrılmam; cevabını verdim. Bunun üzerine beni azad etti. Ve (Hz. Nebi'e, yaşadığım sürece hizmet etmemi de) bana şart koştu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3933,
			"arabicnumber": 3933,
			"text": "(Ebu'l- Velîd'in) babası Üsâme b. Umeyr'den rivayet olunduğuna göre Bir adam bir köle üzerindeki payını azad etmiş ve bu durum Peygamber (s.a.v.)'e haber verilmiş. (Bu haberi işiten Nebi); \"Allah'ın ortağı yoktur.\" buyurarak kölenin tüm vücudunun hürriyete kavuştuğunu bildirmiş. (Bu hadisin diğer ravisi Muhammed) İbn Kesir, rivaye­tine (şu cümleyi de) ilave etti: \"Nebi (s.a.v.) de (o'nun) hürriyetine kavuşturulmasını geçerli saydı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3934,
			"arabicnumber": 3934,
			"text": "Ebû Hureyre (r.a) 'den rivayet olunduğuna göre;; Bir adam bir köle üzerindeki hissesini azad etmiş. Bunun üzerine Peygamber (s.a.v.), (Onun bu) azad işlemini geçerli kılmış ve onu (kölenin) kıymetinin geri kalan kısmınıda ödemekle mükellef kılmıştır. Ayrıca bu hadis Ahmed b. Hanbel 11,347. dede var. İzah, 3936 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3935,
			"arabicnumber": 3935,
			"text": "(Yine Ebu Hureyre'den) rivayet olunduğuna göre;; Nebi (s.a.v.) şöyle buyurmuştur: \"Kim kendisiyle başkası arasında ortak bir köleyi (hissesi nisbetinde) azad ederse (onun vücudunun tamamını kölelikten) kurtarmak ta ona düşer.\" (Hadisteki) cümle (lerin rivayeti) İbn Süveyd'e aittir. İzah, 3936 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "(Yine Ehu Hureyre'den) rivayet olunduğuna göre; Nebi (s.a.v.) şöyle buyurmuştur: \"Her kim bir köle üzerindeki hissesini azad ederse, eğer malı varsa (kalan kısmın bedelini de) kendi malından (ödemek suretiyle kölenin vücudunun tümünü) hürriyetine kavuşturur.\" (Bu hadisin senedinde bulunan) ravi İbnül-Müsenna, en-Nadr b. Enes'den söz etmemiştir. (Hadisteki) cümle(lerin rivayeti) İbn Süveyd'e aittir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3937,
			"arabicnumber": 3937,
			"text": "Ebu Hureyre (r.a)'dan rivayet olunduğuna göre; Nebi (s.a.v.) şöyle buyurdu: \"Bir kimse kölesinin bir kısmını azad ederse eğer (yeterli) malı varsa (kölenin) bütün (vücud) unu azad etmek onu üzerine borç olur. Eğer (yeterli malı) yoksa, meşakkat vermemek şartıyla (köle) çalıştırılır.\" Ayrıca bu hadis; Buhârî, ıtk; Müslim, ıtk, Eymân; İbn Mace, ıtk: Dârimi, Feraiz: Ahmet b. Hanbel, 255,426. 472. dede var. İzah 3939 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3938,
			"arabicnumber": 3938,
			"text": "Ebu Hureyre (r.a)'dan rivayet olunduğuna göre; Nebi (s.a.v.) şöyle buyurmuştur: \"Bir kimse bir köle üzerinde bulunan hissesini yahut kendisine düşen payını azad ederse, eğer malı varsa (bu) malıyla köleyi (tamamen) azad etmek onun üzerine borç olur. Eğer malı yoksa köle(nin kıymeti) doğru bir şekilde takdir edilir. (Bu kıymeti kazanıp da öbür ) sahibine (ödemesi için) Fazla meşakkat vermemek şartıyla köle çalıştırılır. \"Ebu Dâvûd dedi ki: (Yezid b. Zurey ile Nasr b. Ali'nin) ikisinin hadisinde de \"meşakkat vermemek üzere çalıştırılır\" (sözü) vardır, (fakat) \"bu kölenin kıymeti doğru olarak takdir edilir\" sözü yoktur. İzah 3939 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3939,
			"arabicnumber": 3939,
			"text": "(bir önceki 3938. hadis yine Katâde) senediyle ve mana olarak Said b. Ebî Arube)'den (rivayet olunmuştur. Said'den İbn Ebî Ediyy ile Yahya b. Saîd rivayet etmişlerdir.) Yahya ile İbn Ebî Adiyy'den de Muhammed b. Beşşar rivayet etmiştir. Ebu Davud dedi ki: Bu hadisi Ravh b. Ubâde de Said b. Ebî Arûbe'den rivayet etti, (fakat kölenin) çalıştırılabileceğinden bahsetmedi. Cerir b. Hâzim ile Musa b. Halef de beraberce Yezid b. Zurey' yoluyla Katâde' den (hadisin) manası rivayet etti ve bu rivayette \"kölenin çalıştırıl­ması\" (kelimesi)ni de zikrettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": 3940,
			"text": "Abdullah b. Ömer'den rivayet edildiğine göre; Resulullah (s.a.v.) şöyle buyurmuştur: \"Her kim kölesi üzerinde bulunan hissesini azad ederse bu kimse için (kölenin kalan kısmına) adaletli bir kıymet takdiri yapılır. (Yapılan bu takdire göre) ortaklarına (köle üzerindeki) paylarını verir ve (tümüyle onun adına azad edilmiş olur. Eğer (onun, kölenin kalan kısmını azad etmeye yetecek kadar malı) yoksa o zaman (köleden sadece) azatlanan kısmı azad edilmiş olur. (Ortaklarının hissesi yine köle olarak kalır).\" Ayrıca bu hadis; Buharî, ıtk. Şirket; Müslim, ilk, eymân; Tirmizî, ahkâm; îbn Mace, ilk: Ahmet! b. Hanbel, II. 15,77. 116, 142, 156. dada var. İzah 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": 3941,
			"text": "İbn Ömer (r.a)'dan (bir de bir önceki 3940. hadisin) manayı (rivayet olundu. Ancak bu rivayetin ravilerinden olan Eyyub) dedi ki: Nafı' (bu hadisi rivayet ederken, Yoksa köleden) azadlanan kısım azad edilmiş olur\" sözünü bazan söyledi, bazan da söylemedi. İzah 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": 3942,
			"text": "Şu (bir önceki) hadis İbn Ömer (r.a)'dan (rivayet olunmuştur. Şu farkla ki, bu rivayette) Eyyub (şöyle) demiştir: (Ancak bir önceki hadiste geçen) \"Yoksa köleden sadece azadlanan kısım azad edilmiş olur\" sözünün (gerçekten) hadisten mi yahutta Nafi'nin söylediği (kendine ait) bir söz mü olduğunu bilmiyorum. Ayrıca bu hadis; Buharî, ilk; Müslim. ıtk, eymân; Tirmizî, ahkâm; ibn Mâce. ilk; Ahmed- b, Hanbel, II. 15, 77, 116.143, 156. dada var. İzah 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": 3943,
			"text": "İbn Ömer'den rivayet olunduğuna göre;; Resulullah (s.a.v.) şöyle buyurmuştur: \"Her kim kölesi üzerinde bulunan hissesini azad ederse, eğer (kölenin kalan kısmının) bedeline yetecek kadar malı varsa (bu malıda ortaklarına vermek suretiyle kölenin) tümünü azad etmek de ona düşer. (Eğer kendisinde buna yetecek kadar) mal yoksa (köleden sadece onun) hissesi (kadarı) azad olur. (Ortaklarının hissesi yine köle olarak kalır.)\" Ayrıca bu hadis; Buharî, ilk: Müslim. eyman; Ahmed b. Hanbel, II. 53, 142. dede var. İzah 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": 3944,
			"text": "İbn Ömer (r.a)'dan (bir de bir önceki 3943.) İbrahim b. Musa (hadisi)'nin manası (rivayet olunmuştur). İzah 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": 3945,
			"text": "İbn Ömer (r.a)'dan (bir de 3940 numaralı) Malik (hadisin)'in manası (rivayet olunmuştur. Ancak bu hadisin senedinde bulunan Cüveyriye, Malik hadisinde bulunan), \"Eğer (malı) yoksa (köleden sadece) azadlanan kısım azad edilmiş olur.\" cümlesini rivayet etmemiştir, (ibn Ömer'in) bu rivayeti (Malik hadisinin) manasına uygun olarak (devam et­mekte) ve \"köle onun adına azad edilmiş olur.\" cümlesiyle sona ermektedir. İzah 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": 3946,
			"text": "İbn Ömer'den rivayet olunduğuna göre; Nebi (s.a.v.) şöy­le buyurmuştur: \"Her kim kölesi üzerinde bulunan hissesini azad ederse; eğer onun kölenin (kalan kısmının) fiyatına yetecek kadar malı varsa kölenin kalan kısmı da onun malı üzerinden azad edilmiş olur.\" Ayrıca bu hadis; Buhari. ıtk; Müslim, eymân, ıtk I; İbn Mâce, ıtk: Ahmed b, Hanbel, I. 57, II. 531. dede var. İzah 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": 3947,
			"text": "Abdullah b. Ömer'den rivayet olurduğuna göre; Nebi (s.a.v.) ona şöyle demiştir: \"Bir köle iki (kişi) arasında (ortak) olur da ortaklardan biri hissesini azad ederse, (bakılır); eğer zenginse (değerinden) eksik ve ziyade olmamak üzere onun hesabına köleye bir kıymet biçilir, sonra azad edilir.\" Ayrıca bu hadis; Müslim, ıtk, eyman; Tirmizi, ahkâm; Ahmed b. Hanbel, II, 11, 122. 468. dede var. İzah 3948 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": 3948,
			"text": "İbn et-telîbb'in babasından rivayet olunduğuna gör; Bir adam, kölesi üzerinde bulunan hissesini azad etmiş de Nebi (s.a.v.) ona (kölenin kalan kısmının değerini) ödetmemiş. Ahmet (b. Hanbel ravi) el-Telibb'i kasdederek, dedi ki: O' (nun ismi) ta iledir. Şu'be peltek olduğu için ta ile sa harfini ayırdedememiş (ve bir­birine karıştırmış)tır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3949,
			"arabicnumber": 3949,
			"text": "Semüre (İbn Cündüp)'den rivayet olunduğuna göre; Resulullah (s.a.v.) şöyle buyurmuştur: \"Kim (kendine nikahı) haram olan bir yakın (ın)a sahip olursa (şunu bilsin ki yakını olan) o (köle) hürdür.\" Ebu Davud dedi ki: Bu hadis'in bir benzerini de Hammâd b. Seleme, Katâde ve Âsim, el-Hasen yoluyla Muhammed b. el-Bekr el-Birsani riva­yet etmiştir. Yine Ebu Davud dedi ki: (Ravilerden) Hammâd b. Seleme'den başka bu hadisi, (bana) \"bunu fa­lanca söyledi\" sözünü kullanarak rivayet eden olmamıştır. (Bu bakımdan) bu hadis (in sıhhatin) de şüphe vardır. Ayrıca bu hadis; Tirmizî. Ahkâm; İbn-i Mâce. ıtk ta da var. İzah 3952 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3950,
			"arabicnumber": 3950,
			"text": "Katâde'den rivayet olunduğuna göre; Ömer İbn el-Hattab şöyle buyurmuştur: \"Her kim (kendisine nikahı) haram olan bir yakın (ın)a sahip olursa (yakını olan) o (köle) hürdür.\" Ayrıca bu hadis; Tirmizî. Ahkâm; İbn-i Mâce. ıtk ta da var. İzah 3952 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3951,
			"arabicnumber": 3951,
			"text": "Katâde'den rivayet olunduğuna göre; el-Hasan (el-Basri) şöyle demiştir: \"Kim (nikahı kendisine) haram olan yakın (ın)a sahip olursa (yakın olan köle) hürdür.\" Ayrıca bu hadis; Tirmizî. Ahkâm; İbn-i Mâce. ıtk ta da var. İzah 3952 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3952,
			"arabicnumber": 3952,
			"text": "(Bir önceki 3951. hadisin) bir benzeri de el-Hasen (el-Basrî) ile Câbir b. Zeyd'den de rivayet olunmuştur. Ebu Davud dedi ki: \"Saîd'in hafızası Hammâd'dan daha güçlüdür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3953,
			"arabicnumber": 3953,
			"text": "Selame binti Ma'kıl'den rivayet olunmuştur; dedi ki: Cahiliye döneminde amcam beni getirip Ebul-Yeser İbn Amr'ın kardeşi Hubab b. Amr'a sattı. Ben ondan Abdurrahman b. el-Hubab'ı dünyaya getirdim. Sonra (Hubab) vefat etti. Bunun üzerine hanımı, \"vallahi şimdi (Hubab'ın) borcu karşılığında (bu cariyeyi) satacaksınız\" dedi. Ben Resulullah (s.a.v.)'e varıp; Ey Allah'ın Resulü, ben Hârice Kays Aylan (kabilesin) den bir kadınım. Amcam beni cahiliye döneminde Medine'ye getirip Ebu'l-Yeser İbn Amr'ın kardeşi Hubâb b. Amr'a sattı. Ben ondan Abdurrahman b. el-Hubâb'ı dünyaya getirdim. (Şimdi de Hubab ölünce) karısı, Vallahi şimdi (bu cariyeyi Hubab'ın) borcu karşılığında satacaksınız diyor, dedim. Resürullah (s.a.v.): \"Htibâb'ın velisi kimdir?\" diye sordu. \"Kardeşi Ebu'l-Yeser İbn Amr'dır. \" diye cevap verildi. Ona (birisini) gönder (ip yanına çağır) dı, (gelince ona); \"Bu cariyeyi azad ediniz. Bana (ganimet olarak) bir kölenin geldiğini duyduğunuz vakit bana geliniz; bu cariye karşılımda size (o köleyi) vereceğim\" buyurdu. Bunun üzerine beni azad ettiler ve (bir süre sonra) Resulullah (s.a.v.)'e (birtakım) köle(ler) geldi. Benim yerime onlara bir köle verdi. İzah 3954 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3954,
			"arabicnumber": 3954,
			"text": "Cabir b. Abdullah'dan rivayet edilmiştir; dedi ki: Biz Resulullah (s.a.v.) ile Ebu Bekir (r.a) dönemlerinde \"Ümmühatü'l-evlâd\" (denilen, bizden bir çocuğu olan cariyeler)! sattık. Ömer (r.a) (halife) olunca bize (bunu) yasakladı, biz de vazgeçtik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3955,
			"arabicnumber": 3955,
			"text": "Câbir b. Abdullah'dan rivayet edildiğine göre; Bir adam kendi ölümünden sonra geçerli olmak üzere kölesini azad etmiş ve o köleden başka bir malı da yokmuş. Bunun üzenine Nebi (s.a.v.) (orada bulunanlara) o köleyi (getirmelerini) emretmiş, (köle getirilince) yedi yüz yahutta dokuzyüz (dirhem)e satılmış. Bu hadis; Buhari; ahkâm, buyu', ırk; Müslim, zekat, eyman; Nesâî, zekat. buyu', kudât : İbn Mâce. ıtk. buyu', vesâyâ: Muvatta. ramadan: Ahmed b. Hanbel III. 305, 368-371. dede var. İzah 3957 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3956,
			"arabicnumber": 3956,
			"text": "Şu bir önceki (3955.) hadis, Câbir b. Abdillah'dan (bir başka yolla daha rivayet edilmiştir. Şu farkla ki, Câbir burada bir önceki hadise şu cüm­eleri de) ilave etmiştir. Nebi (s.a.v.) buyurdu ki: \" Sen (bu kölenin) değerin (i aimay)a (herkesten) daha müstehaksin. Allah'ın da ona ihtiyacı yoktur.\" İzah 3957 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3957,
			"arabicnumber": 3957,
			"text": "Câbir (r.a) den rivayet olunduğuna göre; Ensar'dan Ebu Mezkur diye anılan birisi Yakub adındaki kölesini kendi ölümünden sonra geçerli olmak üzere azad etmiş ve o köleden başka bir malı da yokmuş. (Bir gün Resnlullah (s.a.v.) o köleyi çağırmış ve (orada hazır bulunan kimselere): Bunu kim satın alır?\" diyerek satılığa çıkarmış. Bunun üzerine Nuaym b. Abdullah b. en-Nahhâm onu sekizyüz dirheme satın almış ve bu dirhemleri o kölenin sahibine vermiş. Sonra (Resulullah) şöyle buyurmuş: \"Sizden birisi fakir olduğu zaman (eline geçen maddi imkanlardan yararlanmak hususunda) önce kendisinden başlasın. Eğer (eline geçen bu) maddi imkanda (kendi ihtiyacından artan) bir fazlalık varsa onu da ailesine, eğer (daha) fazlalık varsa onu da yakınlarına hısımlarına, fazlalık daha da varsa onu da şuraya buraya (versin)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3958,
			"arabicnumber": 3958,
			"text": "İmrân b. Husayn'dan rivayet olunduğuna göre; Bir adam ölürken altı kölesini azad etmiş ve onlardan başka malı yokmuş. Bu (haber) Nebi (s.a.v.)'e ulaşınca o kimse için ağır sözler söylemiş, sonra köleleri çağırıp onları üçe bölerek aralarında kur'a çekmiş. (Kur'a sonucu bunlardan) ikisini azad etmiş ve dördünü de köle olarak bırakmıştır. Bu hadis; Müslim: Eyman; Nesai; cenâiz; İbn-i Mâce ahkâm; Ahmed IV -426. 431, 438, 440. V -341 ahkâm da da var. İzah 3961 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3959,
			"arabicnumber": 3959,
			"text": "(Bir önceki 3958. hadisin) manası (yine aynı) senediyle Ebû Kılâbe'den de rivayet olunmuştur. Şu farkla ki, Ebû Kılâbe (oradan geçen) \"O kimse için ağır sözler söyledi\" cümlesini rivayet etmemiştir. İzah 3961 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3960,
			"arabicnumber": 3960,
			"text": "(Bir önceki hadisin ) manası Ebû Zeyd'den de rivayet olunmuştur. Ancak bu rivayette bir önceki hadisten fazla olarak şu cümleler de bulunmaktadır): Bu adan ensardan biriydi. Nebi (s.a.v) (bu haberi duyunca); \"Eğer ben bu adamı defnedilmeden önce görseydim , (müslüman mezarlığına gömülmesine izin vermezdim ve) müslüman mezarlığına gömülmezdi\" buyurdu. Bu hadis Nesâî. cenâiz de de var. İzah 3961 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3961,
			"arabicnumber": 3961,
			"text": "İmrân b. Husayn'dan rivayet olunduğuna göre: Bir adam ölürken altı kölesini azad etmiş ve (kendisinin) bu kölelerden başka bir malı da yokmuş. Bu (haber) Nebi (s.a.v )'e yetişince köleler arasında kur'a çekmiş, (kur'a sonucu onlardan) ikisini azad etmiş, dördünü de köle olarak bırakmış",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3962,
			"arabicnumber": 3962,
			"text": "Abdullah b. Ömer'den rivayet olunduğuna göre; Resulullah (s.a.v) şöyle buyurmuştur: \"Her kim bir köleyi azad eder ve o kölenin de malı olursa, kölenin malı onun (efendisinin) olur. Ancak efendinin o malı(n köleye ait olmasını) şart koşması (bu hükümden) hariçtir.\" Diğer tahric: Buhârî, şurb; İbn-i Mace, ıtk",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3963,
			"arabicnumber": 3963,
			"text": "Ebû Hureyre'den rivayet edildiğine göre; Resulullah (s.a.v) şöyle buyurmuştur: \"Zina çocuğu üç kişinin en şerIisidir. Ebû Hureyre dediki: Allah yolunda (savaşa çıkan bir kimseye) bir kamçı vermem, bana bir zina çocuğunu azad etmemden daha hoştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3964,
			"arabicnumber": 3964,
			"text": "Garîf b. ed-Deylemîden rivayet edilmiştir; dedi ki: Biz Vasile b. el-Eska'a vardık ve, \"Bize içerisinde fazlalık ve eksiklik bulunmayan bir hadis rivayet et\" dedik. (Bize) öfkelendi: Kuşkusuz sizin her biriniz evinde asılı duran Kur'an-ı Kerim'i okuyor (ve yanlışlıkla ona bazı) ilave(ler) yapıyor, (bazı kelimeleri de okurken) eksiltiyor; karşılığını verdi. Biz de: Bize Resulullah (s.a.v)'den olan işittiğin bir hadis-i (bize nakleder misin?) demek istiyoruz; dedik. (Bunun üzerine şu hadisi) rivayet etti: Katil sebebiyle ateşe girmeyi hak eden bir arkadaşımız (ın nasıl kurtulabileceği) hakkında (bilgi almak üzere) Resulullah (s.a.v)'e varmıştık. \"Bu katilden dolayı köle azad ediniz, (çünkü) Allah, köle'nin her organına, karşılık, katil'in bir organını cehennemden azad eder.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3965,
			"arabicnumber": 3965,
			"text": "Ebû Necîh es-Sülemi'den rivayet olunmuştur; dedi ki: Resulullah (s.a.v) ile birlikte Taif köşkünü kuşatmıştık. Muaz (b. Hişam ise bu cümleyi) \"Babam (Hişam)'ı (şöyle) derken işitmiştim: (Resulullah (s.a.v) ile birlikte Taif kalesindeki Taif köşkünü (kuşatmıştık)\" şeklinde rivayet etti. (Daha sonra) her ikisi de (hadisin geri kalan kısmını da); \"Kim Aziz ve Celil olan Allah yolunda düşman (ın cesedine)e bir ok isabet ettirirse onun için (Allah katında büyük) bir derece vardır\" (şeklinde rivayet ettiler, Ravi Ebû Necîh), hadisi(n geri kalan kısmını da şöyle) nakletti: Resulullah (s.a.v) şöyle buyururken işittim: \"Herhangi bir müslüman erkek, bir müslüman köleyi azad ederse, muhakkak ki Aziz ve Celil olan Allah (o kölenin) kemiklerinin her birini, onu azad eden kişinin bir kemiğini ateşten koruyan bir kalkan haline koyar. Herhangi bir müslüman kadın da müslüman bir kadını azad ederse, kuşkusuz (yüce) AIIah, kıyamet gününde (azad edilen kadının) kemiklerinden herbirini onu azad eden kadının bir kemiğini ateşten koruyan bir kalkan haline koyar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3966,
			"arabicnumber": 3966,
			"text": "Şurahbil b. es-Sımt'tan rivayet olunduğuna göre; kendisi Amr b. Abse'ye: \"Bize Resulullah (s.a.v)'dan duyduğun bir hadisi naklet\" demiş, (o da) Ben Resulullah (s.a.v)'i şöyle buyururken şittim karşılığını vermiş: \"Kim imanlı bir köleyi azad ederse (o köle, azad eden kimsenin) ateşten kurtulması için fidye olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3967,
			"arabicnumber": 3967,
			"text": "Şurahbil b. es-Sımt'tan rivayet olunduğuna göre; kendisi Kab b. Mürre'ye, yahutta Mürre b. Ka'ba: Bize Resulullah (s.a.v)'den işittiğin bir hadisi naklet, demiş. (Ka'b, yahutta Mürre, 3965 numaralı) Muaz hadisi­nin, \"Herhangi bir müslüman erkek, müslüman bir erkek köleyi azad ederse... Herhangi bir müslüman kadın da müslüman bir kadını azad ederse\" sözüne kadar rivayet etmiş, (sonra sözü geçen hadise) ilave (ten şunları da rivayet etmiş: \"Herhangi bir (Müslüman) erkek, iki müslüman kadını (kölelikten) azad ederse (onlar, o kimsenin) ateşten kurtarıcısı olurlar, onların her iki kemiği onun kemiklerinden biri yerine geçer.\" Ebu Davud dedi ki: (Bu hadisin ravilerinden) Salim, Şurahbil'den (ha­dis) işitmemişlerdir. Çünkü Şurahbil, Sıffm (savaşın)da ölmüştür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3968,
			"arabicnumber": 3968,
			"text": "Ebu'd Derdâ (r.a)'dan rivayet olunmuştur; dedi ki: Resulullah (s.a.v) şöyle buyurdu: \"Ölürken köle azad eden kimse (nin hali),döyunca (yemek) ikram eden kimse (nin hali) gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 43
			}
		}
	]
}