{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"38": "The Promised Deliverer (Kitab Al-Mahdi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4279,
			"arabicnumber": 4279,
			"text": "Câbir b. Semure (r.a) şöyle demiştir: Rasûlullah (s.a.v.)'i, şöyle buyururken işittim: \"Size etrafında (tüm) ümmetin toplanacağı on iki halife gelinceye kadar, bu din ayakta kalmaya devam edecektir.\" (Bu arada) Rasûlullah (s.a.v.)'den bir söz duydum ama anlamadım, babama: Rasûlullah ne diyor?\" dedim. \"Hepsi Kureyş'den\" (buyurdu) dedi. Bu hadis'i ayrıca; Tirmizî, Fiten de tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4280,
			"arabicnumber": 4280,
			"text": "Cabir b. Semûre (r.a) şöyle demiştir. Rasûlullah (s.a.v.)'i şunları söylerken işittim. \"On iki halife (gelince)ye kadar bu din aziz olarak devam edecektir.\" Bunun üzerine insanlar, tekbir getirdiler, feryad ettiler. Sonra Rasûlullah sessizce bir şey söyledi, Babam'a: \"Babacığım, Rasûlullah ne dedi?\" dedim \"Hepsi Kureyş'ten (buyurdu) dedi. Bu hadis'i ayrıca; Müslîm. İmare; Ahmed b. Hanbel V-90,93. te rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4281,
			"arabicnumber": 4281,
			"text": "Esveb. Saîd el Hemedânî, Cabir b. Semûre (r.a)'den bu (önceki 4280.) hadisi rivayet etti ve şunu ilâve etti: Rasûlullah evine dönünce, Kureyşliler o'na gelip \"Sonra ne olacak?'' dediler. \"Fitne ve iç savaş\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": 4282,
			"text": "Bize Müsedded haber verdi, Onlara Ömer b. Abîd haber vermiş. Bize Ebû Bekir, yani İbn-i Ayaş haber verdi. (H), Bize Müsedded haber verdi, bize Sûfyân'dan Yahya haber verdi (H). Bize Ahmed b. İbrahim haber verdi. Bize Ubeyduilah b. Musa haber verdi. Bize Zaide haber verdi. (H) Bize Ahmed b. İbrahim haber verdi, bana Ubeyduilah b. Mûsa Fıtri'dan haber verdi, dedi. (Rivâyetlerdeki) mânâ aynıdır. Bunların hepsi Asım'dan, Asım, Zir'den o da Abdullah (b.Mes'ûd (r.a) vasıtasıyla Rasûfullah (s.a.v.)'den rivayet etmiştir; Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Dünyada sadece bir gün kalsa, -Zaîde, hadisinde şöyle dedi - Allah o gün'ü uzatır da - sonra bütün râvîler ittifak ettiler.[şek râvî'dendir,] -O günde Benden veya ehli beytimden, adı adıma, babasının adı da babamın adına uyan bir adam gönderir\" Fitr hadisinde şu ilâve vardır: O şahıs \"dünyayı, zulümle dolduğu gibi, adaletle dolduracaktır\" Süfyân hadisinde şöyle dedi. , Araplara, adı adıma uyan ehl-i beytimden biri hakim olmadıkça dünya son bulmayacak, - Veya gitmeyecektir -[Şek râvîdendir.] Ebû Davûd der ki, Ömer ve Ebu Bekr'in (rivayetleri) Süfyân'ın (rivayetinin) aynıdır, (yani son ilâve, bunların rivayetinde de vardır)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4283,
			"arabicnumber": 4283,
			"text": "Ali (b. Ebî Talib) (r.a)'dan; Rasûlullah (s.a.v.)'in şöyle buyurduğu rivayet edilmiştir. Dünyanın ömründen sadece birgün kalsa bile, Allah (C.C.) benim ehl-i beytimden bir adam gönderecektir. O dünyayı, (daha önce) zulümle olduğu gibi, Adaletle dolduracaktır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4284,
			"arabicnumber": 4284,
			"text": "Ümmü seleme (r.a) şöyle demiştir: Rasûlullah (s.a.v.)'i şöyle buyururken işittim: \"Mehdî [\"Mühdi\" şeklinde okumak mümkündür] benim ailemden, Fatima'nın oğullarındandır.\" Abdullah b. Cafer şöyle demiştir: Ebûl Melh'i, Ali b. Nüfeyl'i överken ve onun iyiliğini söylerken dinledim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4285,
			"arabicnumber": 4285,
			"text": "Ebû Saîd El Hudrî (r.a)'dan rivâyt edildiğine göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Mehdî ben (im neslim) dendir. O açık alınlı ve ince burunludur. Dünyayı zulümle dolduğu gibi adaletle dolduracak ve yedi sene hüküm sürecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4286,
			"arabicnumber": 4286,
			"text": "Rasûlullah (s.a.v.)'in hanımı Ümmü Seleme (r.a)'dan Rasûlullah'ın şöyle buyurduğu rivayet edilmiştir. \"Bir halife öldüğünde kargaşa çıkacak. Medineliler'den birisi, Medine'den çıkıp, Mekke'ye kaçacak. (Ama) Mekke'lilerden bazı insanlar, onu (bulunduğu yerden) çıkarıp, istemediği halde (Kabe'de) Rükün ile Makam-ı İbrahim arasında ona bîat edecekler. Şam'lilarda Onun üzerine bir ordu gönderilecek, ama o ordu Mekke ile Medine arasındaki Beydâ denilen yerde yere batacak. İnsanlar bunu görünce, Şam'ın ebdâli ve Iraklıların asâîbi (şam ve Irak'ın hayırlı salih kulları) ona gelip, bîat edecek. Sonra Kureyş'ten, dayıları Kelp (kabilesinden) olan bir adam çıkıp, o biat edenler üzerine bir ordu gönderecek. Fakat bîat edenler, Ben-î Kelb'linin gönderdiği orduya galip gelecekler. Bu ordu Kelb'in gönderdiği ordudur, (o zaman) Kelb'in ganimetinde hazır bulunmayana yazık!... Halife olan zat (Mehdî) malı taksim edecek. İnsanlardan bir kısmı, Nebilerinin Sünneti ile amel edecek, İslâmiyet yeryüzüne tamamen yerleşecek. (Mehdî) yedi sene kalıp, sonra vefat edecek ve Müslümanlar o'nun namazını kılacak\" Ebû Davûd derki: \"Bazıları Hişâm'dan rivayetle, dokuz sene\" bazıları da \"yedi sene\" dedi. Bu Hadis'i ayrıca Büyük İmam Ahmed Müsnedinde 6/316 da tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4287,
			"arabicnumber": 4287,
			"text": "Bize Harun b. Abdullah haber verdi, bize Hemmam'dan naklen Abdüssamed haber verdi. Hemmam'da katâde'den bu (4286 nolu) hadisi rivayet etti. Hemmam rivayetinde \"dokuz sene\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4288,
			"arabicnumber": 4288,
			"text": "Bize İbnü'l Müsenna haber verdi, Bize Amr b. Asım haber verdi. Bize Ebûl Avam haber verdi.Bize Katâde Ebûl Halil'den, O Abdullah b. Halis'ten , o da Ümmü Seleme (r.a) vasıtasıyla Rasûlullah (s.a.v.)'den bu (yukardaki 4287.) hadisi rivayet etti. Muâz'ın hadisi daha mükemmeldir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4289,
			"arabicnumber": 4289,
			"text": "Ümmü Seleme (r.a) Rasûlullah (s.a.v.)'den (Mekke ile Medine arasında) batırılacak olanların kıssasını haber verip (şöyle devam etti): \"Ya Rasûlullah, bu orduya istemeyerek zorla götürülen ne olacak? dedim. Rasûlullah (s.a.v.): Öbürleriyle birlikte o da batırılacak, ama Kıyamet Günü niyetine göre diriltilir, buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4290,
			"arabicnumber": 4290,
			"text": "Ebû İshak'tan rivayet edildiğine göre; Ali (r.a) oğlu Hasan'a bakıp şöyle demiştir: \"Benim şu oğlum Rasûlullah (s.a.v.)'in isimlendiği gibi seyyiddir. Onun sulbünden, adı Nebimizin adından olan, ona yaratılışta değil, huyda benzeyen bir adam gelecektir.\" Hz. Ali kıssayı zikretti, \"Dünyayı Adaletle dolduracak...\" dedi. Harun şöyle dedi: Bize Amr b. Abi Kays Mutarrıf b. Tariften o Ebî Hasen'den, o'da Hilâl b. Amr'dan şöyle dediğini rivayet etti: Maverâünnenehir'de el-Haris b. Harras adında bir adam çıkacak. Onun (ordusunun) önünde Mansur denilen birisi bulunacak, Kureyş'in Rasûlullah'a imkan verdiği gibi âl-i Muhammed'e (Hilâfetine) imkân verecek - veya hazırlayacak.[Şek ravîdendir.] Her mü'minin ona yardım etmesi veya onun davetini kabul etmesi vaciptir.[Şek râvîdendir]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 12
			}
		}
	]
}