{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"39": "Battles (Kitab Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4291,
			"arabicnumber": 4291,
			"text": "Ebû Alkame; Bildiğime göre, Ebû Hureyre (radıyallahü anh) Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu rivâyet etti\" dedi. (celle celâluhu) bu ümmete her yüz yılın başında dinini yenileyecek birisini (bir müceddid) gönderecektir\" Dâvûd diyor ki: Abdurrahman b. Şüreyh el - İskenderanî hadisi Şerâhil'i aşmadan (Ebû Alkame ve Ebû Hureyre'yi anmadan) rivâyet etti. hadis iki yoldan rivâyet edilmiştir. Birisi metinde olduğu gibi müsneddir. Öbüründe ise Abdurrahman b. Şüreyb, Ebû Alkame ve Ebû Hureyre'yi anmadan, sanki Şerahîl Rasullullah'tan duymuş gibi rivâyet etmiştir. Bu şekilde aynı yerde iki veya daha çok ravi düşürülerek rivâyet edilen hadislere Mu'dal Hadis denilir. Ancak Abdurrahman sika bîr ravidir. Buhari ve Müslim onunla ihticac etmişlerdir. Bu hadisi sadece Ebû Dâvûd rivâyet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4292,
			"arabicnumber": 4292,
			"text": "Hassan b. Atıyye şöyle demiştir; Mekhûl, İbn Ebi Zekeriyya ve ben Halid b. Mi'dan'a gittik. Halid bize Cübeyr b. Nüfeyr'den naklen, (müslümanlarla Rumlar arasındaki) sulhu haber verdi. Cübeyr; Resûlüllah'ın ashabından olan Zî Mihber'e Bir nüshada, \" veya Zi mıhmer\" şeklindedir. Şüphe Mûsânnif Ebû Dâvûd'a aittir. Zî Mihber Peygamberimizin hizmetçisi İbn Ebin-Necaşi'dir. Cübeyr b. Nüfeyr ve başkaları kendisinden hadis rivâyet dinişlerdir. Şamlılardan sayılmaktadır, İbn Mâcede de Ebû Dâvûd'un bir nüshasında şüpheli olarak belirttiği Zi Mıhmer şeklinde varid olmuştur. gidelim\" dedi. Ona geldik Cübeyr (müslümanlarla Rumlar arasındaki) sulhu sordu. Zü’l- Mihber şöyle dedi: (sallallahü aleyhi ve sellem) şunları söylerken dinledim:\" Rumlarla güvenilir bir sulh yapacaksınız. Onlar ve siz arkanızdaki bir düşmanla savaşacaksınız. Zafer kazanacak, ganimet elde edecek ve (tehlikeden) salim olacaksınız. Sonra dönüp, tepecikleri olan bir otlakta konaklayacaksınız. Rumlardan birisi salibi (haçı) kaldırıp, salib kazandı diyecek. Müslümanlardan bir adam buna öfkelenip salibi kıracak. İşte o zaman Rumlar ahdi bozup savaş için toplanacaklar. Mace, fiten, 35",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4293,
			"arabicnumber": 4293,
			"text": "Bize Müemmel b. Fadl el-Harranî haber verdi ve şöyle dedi: Bize Velid haber verdi. Velid; bize bu hadisi Hassan b. Atıyye'den Ebû Amr haber verdi dedi. Hassan hadisinde şunu ilave etti:\" - ve müslümanlar silahlarına sarılıp Rumlarla savaşırlar. O birliğe Allah (celle celâluhu) şehitliği ikram eder.\" Velid hadisi, \" Cübeyr'den o da Zi Mihber vasıtasıyla Resûlüllah'dan\" diye rivâyet etti. Davûd der ki: Hadisi Ravh, Yahya b. Hamze ve Bişr b. Bekr Evzai'den Îsa'nın dediği gibi rivâyet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4294,
			"arabicnumber": 4294,
			"text": "Muaz İbn Cebel (radıyallahü anh) Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu söylemiştir: Beytu’l-Makdis\" in imarı, Medine’nin harabına, Medine'nin harabı büyük savaşın çıkışına, büyük savaşın çıkışı İstanbul'un fethine, İstanbul'un fethi de Deccal'in çıkışına alâmettir.\" Resûlüllah (sallallahü aleyhi ve sellem) eli ile konuştuğu kişinin (Muaz b. Cebel'ın) dizine, veya omuzuna (omuzlarına) Şüphe ravilerden birisine aittir., vurdu ve; Bu (dediklerim) şüphesiz senin burada oluşun gibi - veya senin burada oturduğun gibi - haktır\" buyurdu. b. Hanbel V, 222,245",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4295,
			"arabicnumber": 4295,
			"text": "Muaz b. Cebel (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: savaş, İstanbul'un fethi ve Deccal'in çıkışı yedi ay içerisinde olacaktır.\" filen 58: İbn Mace. filen 35; Ahmet b. Hanbel V, 234",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4296,
			"arabicnumber": 4296,
			"text": "Abdullah b. Busr (radıyallahü anh) demiştir ki; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Savaş ile İstanbul'un fethi arasında altı sene vardır. Yedinci senede Mesihu'd - Deccal çıkacaktır.\" Dâvûd der ki: hadis, Îsa'nın hadisinden (önceki hadisten) daha sahihtir. Mace, fîten 35",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4297,
			"arabicnumber": 4297,
			"text": "Sevban (radıyallahü anh)’den rivâyet edildiğine göre Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Yakında milletler yemek yiyenlerin (başkalarını) çanaklarına (sofralarına) davet ettikleri gibi Bu terceme Avnü'l-Ma'bud'un izahına göre yapılmıştır. Bezlü'l-Mechûd'daki izaha göre \" yemek yiyenlerin cırnakları etrafında toplandıklar) gibi\" şeklinde olur. size karşı (savaşmak için) biribirlerini davet edecekler.\" Bu o gün bizim azlığımızdan dolayı mı olacak?\" dedi. (sallallahü aleyhi ve sellem) ; Hayır, aksine siz o gün kalabalık fakat selin önündeki çörçöp gibi zayıf olacaksınız. Allah düşmanlarınızın gönlünden sizden korkma hissini soyup alacak sizin gönlünüze de vehn atacak\" buyurdu. Yine bir adam: nedir? Ya Resûlallah diye sorunca, Vehn, dünyayı (fazlaca) sevmek ve ölümü kötü görmektir\" II, 259; V. 278. buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4298,
			"arabicnumber": 4298,
			"text": "Ebû'd - Derda (radıyallahü anh)’den, Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğu rivâyet edilmiştir: Büyük savaş gününde müslümanların çadırı (kalesi) Şam'ın en hayırlı şehirlerinden olan Dimeşk adındaki şehir tarafındaki Guta da olacaktır. b. Hanbel VI, 25",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4299,
			"arabicnumber": 4299,
			"text": "Ebû Dâvûd der ki: Bana İbn Vehb'den haber verildi, O dedi ki bana Cerir b. Hazim Ubeydullah b. Amr'den Ona Nafi İbn Ömer (radıyallahü anh)'den; Resûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu haber vermiş: Yakında müslümanlar (Dımeşk) şehrinde muhasara edilecekler. Öyle ki onların en uzak karakolu Selah olacak\" hadis, Aynü'l Ma'bud ve Bezlü’l -Mechûd'da önceki hadisin devamı olarak yer almıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4300,
			"arabicnumber": 4300,
			"text": "Zührî, \" Selah Hayber'e yakın bir yerdir\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4301,
			"arabicnumber": 4301,
			"text": "Afv b. Mâlik (radıyallahü anh); Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu söylemiştir: Allah (celle celâluhu) bu ümmetin üzerinde, biri kendisinden birisi de düşmanından olan iki kılıcı birleştirmeyecektir.\" b. Hanbel. VI, 26",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4302,
			"arabicnumber": 4302,
			"text": "Ashâb-ı kiramdan birisi, Resûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu rivâyet etmiştir. Size dokunmadıkları müddetçe siz de Habeşlere dokunmayın. Sizi terkettikleri müddetçe siz de Türkleri terkedin. Onlara sataşmayın.\" Cihâd 42",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4303,
			"arabicnumber": 4303,
			"text": "Ebû Hureyre (radıyallahü anh)'den Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğu rivâyet edilmiştir: Müslümanlar, yüzleri kat kat deri ile kaplı kalkan gibi olan, kıldan elbise giyen Türklerle savaşmadıkça kıyamet kopmaz.\" fiten 62. 63. 65, Nesai, cihad 42",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4304,
			"arabicnumber": 4304,
			"text": "Ebû Hureyre (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Siz pabuçları kıldan olan bir milletle savaşmadıkça kıyamet kopmayacaktır. Siz, gözleri küçük, burunları yassı ve yüzleri kat kat deri ile kaplı kalkan gibi olan bir milletle sayâşmadıkça kıyamet kopmayacaktır.\" cihad 95. 96: Menalîb, 26; Müslim, filen 64. 66: İbn Mace, filen 36: Tirmizi, filen 40: Ahmed Hanbel 11,530",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": 4305,
			"text": "Abdullah b. Büreyde, babasından, Resûlüllah'ın şöyle buyurduğunu rivâyet etmiştir: Sizinle gözleri küçük bir kavm -yani Türkler Bu tefsir sahabi veya tabiî râviye aittir. - savaşacaktır. onları Arap Yarımadasına katıncaya kadar üç kerre süreceksiniz, ilk sürüşte onlardan kaçanlar kurtulacak, ikincisinde bir kısmı helak olup, kimisi kurtulacak, üçüncüsünde ise kökleri kazınacak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4306,
			"arabicnumber": 4306,
			"text": "Müslim b. Ebi Bekre, babasından rivâyet etti ki; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu. (bazı) insanlar, üzerinde köprü olan, Dicle denilen nehrin yanında, Basra adını verecekleri çukur bir yere yerleşecekler. Oranın ahalisi çoğalacak ve o şehir Muhacirlerin şehirlerinden olacak. - İbn Yahya, Ebû Ma'mer'in; müslümanların şehirlerinden olacak dediğini söyledi - Ahir zaman gelince geniş yüzlü küçük gözlü Kantura oğulları gelip, nehir kısıyısma kadar inecekler (o zaman) şehir halkı üç gruba ayrılacak; bir grup öküzlerin kuyruğuna ve arıziye sarılacak (çiftçiliğe yönelecek) ve helak olacak, bir grup kendi canlarını tercih edip (düşmandan aman dileyip) kâfir olacak, bir grup da çocuklarını arkalarına alıp düşmanla savaşacaktır. İşte onlar şehidlerdir. Ebû Davûd rivâyet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": 4307,
			"text": "Enes b. Mâlik (radıyallahü anh) demiştir ki; Resûlüllah (sallallahü aleyhi ve sellem) kendisine şöyle buyurmuştur: Ya Enes! şüphesiz insanlar birtakım şehirler kuracaklar. Onlar içerisinde Basra -veya Busayra- denilen bir şehir olacak. Eğer oraya uğrarsan - veya girersen- tuzlu yerlerden, iskelesinden, çarşısından ve emirlerinin kapısından uzak dur. Kenarlarına git. Şüphesiz orada yer çöküntüsü, taş yağması ve zelzele olacak. Bir kavim, akşam yatacak ve sabahleyin maymunlar ve domuzlar olarak kalkacaktır.\" sadece Ebû Davûd rivâyet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4308,
			"arabicnumber": 4308,
			"text": "İbrahim b. salih b. Dirhem, babasından şöyle duyduğunu haber vermiştir: gidiyorduk, bir adam (Ebû Hureyre) bize: tarafta el-Übbele denilen bir köy var mı? dedi. dedik. üzerine şöyle dedi: benim için, Aşşar mescidinde iki veya dört rekat namaz kılıp \" Bu, Ebû hureyre içindir\" demeyi tekeffül eder (söz verir)? Ben, Habibim Ebû'l - Kasım (sallallahü aleyhi ve sellem)'i \" Şüphesiz Allah (celle celâluhu) kıyamet gününde Aşşar mescidinden şehitler diriltecek. Bedir şehitleri ile birlikte onlardan başka hiç bir şehit kalmayacak.\" derken işittim. Ebû Dâvûd rivâyet etmiştir. Dâvûd \" Bu mescid nehrin (Fıratm) yanındadır.\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4309,
			"arabicnumber": 4309,
			"text": "Abdullah b. Amr (radıyallahü anh) demiştir ki; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Sizi terkettikleri müddetçe siz de Habeşlileri terkedinîz. Şüphesiz Kâ'be'nin definesini, Habeşlilerden iki cılız bacaklı birisinden başkası çıkarmayacaktır. Hac 49: Müslim, fiten 57. 58, 59; Ahmet b. Hanbel V, 371",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4310,
			"arabicnumber": 4310,
			"text": "Ebû Züra şöyle demiştir: Mervan'a bir grup geldi. Onu, kıyametin alametlerinden İlkin'in Deccal'in çıkması olduğunu söylerken dinlediler. Ben ayrılıp, Abdullah b. Amr (radıyallahü anh)'ya geldim ve olanı haber verdim. Çıkış itibariyle alametlerin üki güneşin batıdan doğması veya kuşluk vakti Dabbe'nin Hayvan demektir. Bundan sonra gelecek olan hadisle izah edilecektir. insanlar arasına çıkışıdır. Bunlardan hangisi daha önce olursa diğeri hemen peşinden gelir.\" Zür'a derki: -ki o kitapları okurdu. \" Zannediyorum o ikisinden daha önce çıkacak olan; güneşin batıdan doğmasıdır.\" dedi. fiten 118; İbn Mâce. fiten 32",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4311,
			"arabicnumber": 4311,
			"text": "Huzeyfe b. Esîd el-Ğıfari demiştir ki; Resûlüllah'a ait bir çardağın gölgesinde oturmuş konuşuyorduk. Kıyameti söz konusu ettik, seslerimiz yükseldi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): kendisinden önce (şu) on alamet çıkıncaya kadar kopmaz - veya olmaz-: Güneşin battığı yerden doğması, Dabbe'nin çıkması, Ye'cuc ve Me'cuc'un çıkmaları, Deccal, Îsa b. Meryem, duman, biri doğudan biri batıdan, biri de Arap Yarımadasında olmak üzere üç yerin batması, bunların sonuncusu da Yemen'den; Aden'in en aşağısından bir ateşin çıkmasıdır. Bu, insanları mahşere sevk eder.\" buyurdu. Fiten 39, 40; Tirmizi, filen 21: İbn Mâce, filen 25. 28",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4312,
			"arabicnumber": 4312,
			"text": "Ebû Hureyre (radıyallahü anh) Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu rivâyet etmiştir: Güneş battığı yerden doğmadıkça kıyamet kopmaz. Doğup da insanlar onu gördüğü zaman, yeryüzünde olan herkes iman edecek. İşte bu: .- Daha önceden iman etmiş veya imanında bir hayır kazanmış olmayan hiçbir kimseye (o günkü) imanı fayda vermez- \" En'am 6, 158. (ayetinin işaret ettiği) zamandır. filen 26: Müslim, iman 248; İbn mace. filen 32: Nesaî, cuma 35",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4313,
			"arabicnumber": 4313,
			"text": "Ebû Hüreyre (radıyallahü anh)'den Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğu rivâyet edilmiştir: Fırat'ın, altından bir defineyi açığa çıkarması yakındır. Kim ( o zaman) orada bulunursa ondan bir şey almasın.\" fiten 25; Müslim, fiten 30; Tirmizi, Sıfatü'l-cenne, 26; İbn mace, Filen 25",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4314,
			"arabicnumber": 4314,
			"text": "Abdullah b. Said el-Kindî, (Abdullah'a) Ukbe - yani İbn Halid- (Ukbe'ye) Abdullah haber verdi; Ebû'z-Zinad'dan, Ebûz'z-Zinad A'rec'den o da Ebû Hureyre kanalıyla Resûlüllah (sallallahü aleyhi ve sellem)'den önceki hadisin mislini rivâyet etti. Ancak O (ravi) \" Altından bir dağ üzerinden açılır.\" dedi. fiten 31; Tirmizi, sıfatu'l- cenne, 26; Buhari fiten 25",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4315,
			"arabicnumber": 4315,
			"text": "Rabi b. Hıraş şöyle demiştir: Huzeyfe (b. el-Yeman) ve Ebû Mes'ud (el-Ensarî) bir araya geldiler. Huzeyfe şöyle dedi: Şüphesiz Deccal ile birlikte olan şeyi ben ondan \" Ondan\" kelimesinin. Deccal’in yerine kullanılmış olması da, Ebû Mes'ud'un yerine kullanılmış olması da muhtemeldir. daha iyi bilirim; şüphesiz Deccal'in yanında sudan bir deniz ateşten bir nehir olacaktır. Sizin su(dan) zannetiğiniz aslında ateş, ateş olarak gördüğünüz de sudur. Sizden her kim buna erişir de (su isterse) ateş olarak gördüğünden içsin. Çünkü o onu su (olarak) bulacaktır.\" Mes'ud el-Bedri: Resûlüllah (sallallahü aleyhi ve sellem)'den aynen böyle derken işittim\" dedi. fiten 27; Müslim, fiten 108",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4316,
			"arabicnumber": 4316,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4317,
			"arabicnumber": 4317,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": 4318,
			"text": "",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4319,
			"arabicnumber": 4319,
			"text": "İmran b. Husayn (radıyallahü anh) Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu söylemiştir. \" Deccal'i işiten kişi ondan uzaklâşsın. Vallahi insan onu mü’min zannederek ona gelir ve içine düştüğü (ölüleri diriltmesi gibi) şüphelerden dolayı İçine düştüğü şüphelerden maksat; Sihir, ölüleri diriltme ve benzeri istidrac olaylarıdır. - veya içine düştüğü şüpheler için- Şek bir raviye aittir. Bundan sonra o ravi \" Şeyhim şek ile böyle dedi\" demiştir. ona tabi olur. b. Hanbel. IV, 431, 441",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4320,
			"arabicnumber": 4320,
			"text": "Ubade b. Samit (radıyallahü anh) Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu söylemiştir: Şüphesiz ben size Deccal'den (çok) bahsettim, (ama yine de) anlayamamış olmanızdan korktum. Şüphesiz Mesihud Deccal kısa boylu, eğri bacaklı, (yürürken bacaklarının arası açık) kıvırcık saçlı, tek gözlüdür. Gözü siliktir, kabarık da çukur da değildir. Eğer durumu size karışık gelirse biliniz ki Rabbiniz tek gözlü değildir.\" Dâvûd: Amr b. Esved kadılığa tayin edildi\" dedi. b. Hanbel, V. 324",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4321,
			"arabicnumber": 4321,
			"text": "Nevvas b. Sem'an el-Kilabî (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) Deccal'i anıp şöyle demiştir: Şayet ben aranızda iken çıkarsa, sizin önünüzde onun hasmı (mağlup edicisi) benim. Eğer ben aranızda yokken çıkarsa herkes kendisinin savunucusu (galip gelicisi) dur. Her müslüman hakkında Allah benim halifemdir. Sizden her kim ona erişirse, ona karşı Kehf (suresinin baş tarafını) okusun. Şüphesiz o fitneye karşı sizin için emandır.\" Nevvas der ki): Biz (Resûlüllah'a): ne kadar kalacak? dedik. Kırk gün; bîr gün bir sene gibi, bir gün bir ay gibi, bir gün bir hafta gibi diğer günleri de sizin (normal) günleriniz gibidir\" buyurdu. Resûlallah bu bir sene gibi olan günde bir günlük namaz bize yeter mi? dedik; Hayır, onun için günü takdir ediniz.\" Dımeşk (şam)'in doğusundaki beyaz minarenin yanına Îsa b. Meryem (aleyhis-selâm) inecek, Deccal'e yetişip Lüt kapısının yanında onu öldürecek\" buyurdu. fıten 110; İbn Mâce, fiten 33 Tirmizî, fiten 59; Ahmet b. Hanbel, III. 420, IV. 226",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4322,
			"arabicnumber": 4322,
			"text": "Bize Îsa b. Muhammed haber verdi, bize Damure haber verdi. O Şeybanî'den, Şeybanî Amr b. Abdullah'dan, Amr Ebû Ümame'den o da Resûlüllah (sallallahü aleyhi ve sellem)'den önceki hadisin benzerini rivâyet etti. Namazları da o hadisteki aynı mananın benzeri ile zikretti. Mâce, fiten 33",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "Ebû'd-Derda (radıyallahü anh) Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu rivâyet etmiştir: Bir kimse Kehf suresinin başından on ayet ezberlerse, Deccal'in fitnesinden korunur.\" Davûd şöyle dedi: Hişam ed-Düstûraî de Katade'den aynen böyle rivâyet etmiştir. Ancak hişam: Kim Kehf suresinin sonlarından ezberlerse\" demiştir. Şu'be ise Katade'den: Kehf in sonundan.\" demiştir. salatü'l-müsafirun, 257; Tirmizi, sevabu'l-Kur'an, 6: Ahmed, b. Hanbel V, 196",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4324,
			"arabicnumber": 4324,
			"text": "Ebû Hureyre (radıyallahü anh)'den rivâyet edildiğine göre: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Benimle onun -yani Îsa (aleyhis-selâm)'in- arasında peygamber yoktur ve o mutlaka inecektir. Onu gördüğünüz zaman, tanıyınız; o, orta boylu, kırmızıya çalan beyaz benizli, bir adamdır. Sarımtırak renkte iki elbise içerisinde olacaktır. Başına bir ıslaklık değmese de (sanki yıkanmış gibi) damlali olacaktır, (başından sular damlayacaktır) İslâm adına insanlarla savaşacak, Haç'i kıracak domuzu öldürecek ve cizyeyi kaldıracaktır. Onun zamanında Allah islamın dışındaki tüm dinleri ibtal eder. Îsa (aleyhis-selâm) Mesih Deccal'i öldürecek ve yeryüzünde kırk sene kalacaktır. Sonra vefat edecek ve müslümanlar namazını kılacaklardır. Ebû Dâvûd rivâyet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4325,
			"arabicnumber": 4325,
			"text": "Fatıma binti Kays (radıyallahü anhâ) şöyle demiştir: Bir gece Resûlüllah (sallallahü aleyhi ve sellem) yatsı namazını geciktirdi sonra çıkıp şöyle dedi: Beni, Temimu'd - Dari'nin adalardan, birindeki bir adamdan verdiği haber geciktirdi. (Temim dedi ki) Ben saçlarını yerde sürüyen (uzun saçlı) bir kadınla karşılaştım. kimsin? dedi(m) Cessase'yim, şu köşke git, dedi. Oraya gittim, bir de ne göreyim. Saçlarını sürüyen (uzun saçlı) bukağılara bağlı, yerle gök arasında sıçrayan bir adam! kimsin? dedim Deccal'im, ümmîlerin peygamberi çıktı mı? dedi. dedim. itaat mı ettiler, isyan mı? dedi ettiler, dedim. onlar için hayırlıdır, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "Fatıma b. Kays (radıyallahü anhâ) şöyle demiştir: Resûlüllah'ın müezzininin \" Namaz toplayıcıdır\" diye seslendiğini duydum ve çıktım. Resûlüllah (sallallahü aleyhi ve sellem) ile birlikte namazı kıldım. Resûlüllah (sallallahü aleyhi ve sellem) namazını bitirince gülümseyerek minbere oturdu. \" Herkes yerinde kalsın\" dedi. Sonra: Sizi niçin topladım biliyormusunuz?\" dedi. ve Rasulü daha iyi bilir, dediler. buyurdu: sizi bir korku ve rağbet (bir şeyden korkutmak veya hoşlanacağınız bir şey söylemek) için toplam adım, şu haber için topladım: bristiyan bir adamdı (Bize) gelip bi'at etti ve müslüman oldu. Bana, Deccal konusunda size anlattığım şeylere uyan şeylerden bahsetti. Anlattığına göre; o, Lahm ve Cüzam kabilelerinden otuz kişi ile birlikte bir deniz gemisine (büyük bir gemiye) binmiş. Dalga onlarla denizde bir ay oynamış ve güneşin battığı yerdeki bir adaya yanaşmışlar. Geminin kayıklarına binip adaya girmişler. Onları çok kıllı bir hayvan karşılamış. sana! sen kimsin? demişler, Cessâse'yim, şu manastırdaki adama gidin, çünkü o sizin haberinize müştakdır, demiş. dedi ki: Bize adamın adını söyleyince onun şeytan olmasından korktuk ve koşarak gittik. Manastıra girince bir de ne görelim, o zamana kadar hiç görmediğimiz iri cüsseli, elleri boynuna sıkı sıkıya bağlanmış bir adam..\" Ravi hadisi zikretti; Ravi hadisi uzun uzadıya anlatmış, ancak Ebû Dâvûd ihtisar diniştir. Hadîsin tamamı Sahih-i Müslim'de mevcuttur, bu fazlalığa Açıklama bölümünde işaret edilecektir. onlara; Beysan hurmalığını, Zûar pınarını ve Ümmî nebiyi sordu (sonra) \" Şüphesiz ben Mesih Deccal'im, benim çıkmama yakında izin verilecektir\" dedi. (sallallahü aleyhi ve sellem) şöyle buyurdu; O Deccal Şam denizinden - veya Yemen denizinden, - hayır aksine doğu tarafından evet doğu tarafından çıkacaktır.\" dedi. Resûlüllah (bunu söylerken) doğu tarafına işaret etti. binti Kays: Bunu Resûlüllah'tan ezberledim\" dedi. hadisi şevketti. fiten 119",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4327,
			"arabicnumber": 4327,
			"text": "Fatıma binti Kays (radıyallahü anhâ) şöyle dedi. Nebi (sallallahü aleyhi ve sellem) öğle namazım kıldı sonra minbere çıktı. Halbuki o daha önce minbere sadece Cuma günü çıkardı... Amir sonra bu (bir önceki hadisteki) kıssayı aıılatn. Davûd derki: Sadran Basralıdır. İbn Mısver ile birlikte denizde battı. Ondan başka hiç kimse kurtulamadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4328,
			"arabicnumber": 4328,
			"text": "Ebû Seleme b. Abdurrahman’ın, rivâyetine göre Cabir (radıyallahü anh) demiştir ki: (sallallahü aleyhi ve sellem) bir gün minber üzerinde şunları söyledi: Bazı insanlar denizde giderlerken yiyecekleri bitti. Karşılarına bir ada çıktı. Ekmek aramak üzere nüshalarda, haber istemek üzere\" şeklindedir. adaya çıktılar. Onları Cessase karşıladı.\" b. Abdullah der ki:) Seleme'ye; Cessase nedir? dedim. kıllarını ve saçlarını sürüyen (saçı ve vücudunun kılları uzun) bir kadın dedi. sözüne devamla şöyle dedi:) Cesase: Şu köşkte (biri var....)\" dedi. Hadisi zikretti köşkteki (Deccal) Beysan hurmalığını ve Zuğar pınarını sordu. Ebû Seleme: O Mesihud Deccal'dir\" dedi. b. Abdullah şöyle dedi: Ebû Seleme'nin oğlu bana bu hadiste bir şey var ama onu hatırımda tutamadım\" dedi. Ebû Seleme şöyle dedi: Cabir onun (Deccal'in) İbn Sayyad Bazı nüshalarda’\" İbn Said\" lir. Aşağıda gelecek oları haberde de İbn Said'fir. Biz izahla metne bakarak İbn Sayyad dedik. olduğuna yemin etti.\" kendisine: o öldü, dedim; de olsa o, dedi, müslüman oldu, dedim. olsa da dedi, Medine'ye girdi, dedim. girmiş olsa bile, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4329,
			"arabicnumber": 4329,
			"text": "İbn Ömer (radıyallahü anhümâ)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) içlerinde Ömer b. el-Hattab'ın da bulunduğu; ashabından bir grup ile birlikte İbn Said'e uğradı. O çocuktu ve Benî Mağale kalesi yanında erkek çocuklarla oynuyordu. İbn Said (Resûlüllah’ın geldiğini) farketmemişti. Resûlüllah (sallallahü aleyhi ve sellem) eliyle onun sırtına vurdu, sonra: Benim, Allah'ın Rasulü olduğuma şehadet ediyor musun?\" dedi. Said (Sayyad) Resûlüllah'a bakıp ümmîlerin nebisi olduğuna şehadet ediyorum, sen de benim Allah'ın Rasûlü olduğuma şehadet eder misin? dedi. (sallallahü aleyhi ve sellem) (onun sorusuna kulak asmadan): Ben Allah'a ve Rasûllerine iman ettim,\" buyurdu: İbn Said'e: Sana ne (ler) geliyor?\" diye sordu. soru Buhari ve Müslim'deki rivâyetlerde: Senneler görüyorsun?\" şeklindedir. Said: gerçek haberler de gelir, yalan haberler de diye cevap verdi. Resûlüllah: Öyleyse senin işin çok karıştıktır,\" buyurdu. Sonra da ona: Haydi gönlümde senin için bir şey sakladım.\" Semanın açık bir duman getirdiği gün\" saklamıştı - (Onu bil bakalım) buyurdu. - Sayyad: düh (duman)dur, dedi. Resûlüllah (sallallahü aleyhi ve sellem) Defol git Bu tabir köpeği kovmak için kullanılan bir tabirdir. sen kaderini asla aşamayacaksın,\" buyurdu. Ömer (radıyallahü anh) : Ya Resûlallah, bana izin ver onun boynunu vurayım\" dedi. Resûlüllah (sallallahü aleyhi ve sellem) Eğer o -Deccal- ise ona asla Mûsâllat olunamayacaktır. Deccal değilse onu öldürmekte hayır yok\" buyurdu. cenaiz 80; cihad 173; Müslim, fiten 95; Tirmizi, fiten 63",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4330,
			"arabicnumber": 4330,
			"text": "Nafi demiştir ki; İbn Ömer (radıyallahü anh): Vallahi mesihud-Deccalin İbn Sayyad olduğunda asla şüphe etmiyorum\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4331,
			"arabicnumber": 4331,
			"text": "Muhammed b. Münkedir dedi ki: b. Abdullah'ı, İbn Said'in Deccal olduğuna yemin ederken gördüm. Kendisine: yemin mi ediyorsun?! dedim. Ömer (radıyallahü anh)'i Resûlüllah (sallallahü aleyhi ve sellem)’in yanında böyle yemin ederken işittim. Resûlüllah da onu inkar etmedi, dedi. İ'tisâm 22; Müslim, fiten, 94",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4332,
			"arabicnumber": 4332,
			"text": "Cabir (radıyallahü anh) şöyle demiştir: Biz İbn Sayyad'ı Hana gününde kaybettik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4333,
			"arabicnumber": 4333,
			"text": "Ebû Hureyre (radıyallahü anh)'den rivâyet edildiğine göre Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Kıyamet, otuz tane Deccal çıkıncaya kadar kopmayacaktır. Bunların her biri kendisinin Allah'ın Rasûlü olduğunu iddia eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4334,
			"arabicnumber": 4334,
			"text": "Ebû Hureyre (radıyallahü anh)': Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu rivâyet etmiştir: Otuz tane yalana Deccal çıkıncaya kadar kıyamet kopmaz. Onların hepsi Allah'a ve Rasulüne iftira ederler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4335,
			"arabicnumber": 4335,
			"text": "Abide es-Selmanî bu haberi rivâyet edip, (önceki hadisteki sözlerin) benzerini zikretti. talebesi İbrahim der ki:) \" Ona şu Muhtar (es-sakafî) hakkında ne dersin? O da mehdî mi?\" dedim. Abide: liderlerindendir, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4337,
			"arabicnumber": 4337,
			"text": "Ebû Ubeyde, İbn Mes'ud kanalıyla Resûlüllah (sallallahü aleyhi ve sellem)’dan önceki hadisin benzerini rivâyet etti. Ravi şunu da ilave etti: ......Ya da Allah bazınızın kalbini bazılarınınkine karıştırır. Sonra da onlara lanet ettiği gibi size de lanet eder.\" Dâvûd şöyle dedi: Muharibi, Ala b. Müseyyeb'ten, O Abdullah b. Amr b. Mürre'den, O Salim el-eflas'tan, O Ebû Ubeyde'den, Ebû Ubeyde de Abdullah'dan rivâyet etti. Halid et-Tahhan, A’la'dan o da Amr b. Mürre vasıtasıyla Ebû Ubeyde'den rivâyet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4338,
			"arabicnumber": 4338,
			"text": "Bize Vehb b. Bakıyye Halid'ten, Amr b. Avn'de Hüseyn'den aynı manâ ile haber verdiler. Halid ile Hüseyn İsmail'den, o da Kayş'tan nakletti, Kays şöyle demiştir: Hindiyye, V, 352, 353. Bekr (radıyallahü anh) Alah'a hamd ve sena ettikten sonra şunları söyledi: Ey insanlar şüphesiz siz şu, \" Siz kendinize bakınız, siz hidayet yolunda olduğunuzda sapıtan size zarar vermez\" (Maidd VL105). âyetini yanlış anlıyorsunuz.\" Vehb b. Bakıyye Halid'den: Bekir'in şöyle dediğini nakletti: Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle derken işittik: Şüphesiz insanlar zulmü gördükleri zaman, güçleri yettiği halde ona mani olmazlarsa, Allah'ın azabının hepsi üzerine inmesi pek yakındır.\" Hüseyin'den Ebû Bekr'in şunları söylediğini nakletti: Resûlüllah'i şöyle derken işittim: Bir millet ki aralarında kötülük işlenir, sonra onlar o kötülüğü değiştirmeye güçleri yettiği halde değiştirmezlerse, Allah yakın bir zamanda mutlaka onlara genel bir azab verir.\" Davûd şöyle demiştir: hadisi, Halid'in dediği şekilde Ebû Usâme ve bir cemaat rivâyet etti. O rivâyette Şu'be böyle dedi: Bir kavim ki aralarında kötülükler işlenir, sayılan onu işleyenlerden çok olduğu halde ona mani olmazlarsa.....\" Tefsîru'l - Kur'an, 5,6.7; filen 8; İbn Mace, fiten 20",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4339,
			"arabicnumber": 4339,
			"text": "Cerir (b. Abdullah el-Beceli) (radıyallahü anh) şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)'ı şöyle buyururken işittim: Bir kimse bir toplum içerisinde bulunur ve o toplumda günahlar işlenir de, ona mani olmaya güçleri yettiği halde mani olmazlarsa, onlar ölmeden önce Allah mutlaka azabını gönderir.\" mâce, fıten 20; Ahmet b. Hanbel IV, 361, 363. 364, 366",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4340,
			"arabicnumber": 4340,
			"text": "Ebû Said el-Hudri demiştir ki; (sallallahü aleyhi ve sellem)'i: Kim bir kötülük görür de onu eli ile değiştirmeye gücü yeterse eli ile değiştirsin (mani olsun)...\" buyururken işittim. hadisin geri kalanının kesti, İbn A'la Hennad ve Ebû'l A'la, Ebû Dâvûd'un hadisi rivâyet ettiği üstadlardır. Hennad hadisi kısa kesmiş. Ebû'l Ala tamamını rivâyet etmiştir. ise şu şekilde tamamladı.\" (eli ile değiştirmeye) gücü yetmezse, dili ile (değiştirsin) Dili ile (değiştirmeye) gücü yetmezse kalbi ile (değiştirsin) Bu sonuncusu ise, imanın en zayıfıdır.\" el-İyman 78: Timizi, fıten 11; İbn Mace, fiten 21; Nesai, iyman 17",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": 4341,
			"text": "Ebû Ümeyye eş-Şa'banî şöyle demiştir; Sa'lebe el-Huşeni'ye: Ebû Sa'lebe! Şu, \" Siz kendinize düşeni yapın.\" (Maide 105) ayeti hakkında ne dersiniz?\" dedim. Şu karşılığı verdi: sen onu iyi bilen birisine sordun. Ben de onu Resûlüllah (sallallahü aleyhi ve sellem)'a sormuştum. Şu cevabı verdi: Biribirinize iyiliği tavsiye ediniz. Kötülükten men ediniz. Aynu’l-Ma'budlaki bir izaha göre mana \" İyiliğe imtisal ediniz, kötülükten kaçınınız\" şeklindedir. Öyle ki itaat edilen bir cimrilik, tabi olunan nefsi arzular (ahirete) tercih edilen dünya ve her görüş sahibinin kendi görüşünü beğendiğini görürsen kendine düşeni yap. Halkı terket şüphesiz sizin ardınızda sabır günleri var. O günde sabretmek avuçta kor tutmak gibidir. O günlerde bir iyi amel işleyene, onun yaptığının benzerini yapan elli kişinin sevabı vardır.\" başkası benim soruma ilaveten: Ya Resûlallah elli kişinin ecri mi?! dedi. Resûlüllah (sallallahü aleyhi ve sellem), \" Sizden elli kişinin ecri\" buyurdu. tefsir 6; İbn Mâce, fiten 21",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4342,
			"arabicnumber": 4342,
			"text": "Abdullah b. Amr b. el-As (radıyallahü anhümâ)’dan; Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğu rivâyet edilmiştir: İnsanların eleneceği (iyilerin gidip) kötülerin kalacağı, ahid ve emanetlerinin bozulacağı ve ihtilafa düşüp şöylece- parmaklarını biri biri arasına soktu olacakları zamanın gelmesi yakındır. - veya geldiği zaman haliniz ne olur?\" şek raviye aittir. zaman) Biz ne yapalım, Ya Resûlallah (sallallahü aleyhi ve sellem)? dediler, Resûlüllah İyi bildiğinizi alır, kötü gördüğünüzü bırakırsınız. Kendinize ait işlere yönelir, umuma ait işleri terkedersiniz. Mâce, filen 10; Ahmed b. Hanbel II, 220, 221. Davûd der ki: Abdullah b. Amr vasıtasıyla tek vecihten böylece rivâyet edildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4343,
			"arabicnumber": 4343,
			"text": "Abdullah b. Amr b. el-As (radıyallahü anhümâ) şöyle demiştir; Resûlüllah (sallallahü aleyhi ve sellem)'in etrafında (toplanmış) oturuyor iken (o) fitneden bahsedip şöyle buyurdu: İnsanları; ahidleri karışmış, emanetleri azalmış ve şöylece - parmaklarını biribirine soktu- olmuş bir halde gördüğünüz zaman...\" kalkıp: Allah beni sana feda kılsın o zaman ne yapayım?\" dedim: Evine kapan, dilini tut, hak bildiğini al, kötü gördüğünü bırak. Kendine ait işlere sarıl, ammeye ait işleri terk et.\" buyurdu. Mace, filen. 10; Ahmed b. Hanbel II, 162, 212, 220, 221",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4344,
			"arabicnumber": 4344,
			"text": "Ebû Said el-Hudri şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem) \"En efdal cihad, zalim sultanın -veya zalim emirin- Şüphe ravilerden birisine aittir. yanında adaleti söylemektir.\" Buyurdu. fiten 13: İbn Mace, filen 20; Nesai, biat 37; Ahmed b. Hanbel III, 19, 61; IV, 314, 315",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4345,
			"arabicnumber": 4345,
			"text": "Urs b. Amira el-Kindi (radıyallahü anh)'den rivâyet edildiğine göre: (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Yeryüzünde günah işlendiği (bir kötülük yapıldığı) zaman birisi ona şahit olur da çirkin görürse -bir seferinde de inkar ederse demiştir - o kötülükten uzakta olan kişi gibidir. Kötülükten uzakta olup da ona razı olan ise ona şahid olan (birlikte olan) kimse gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4346,
			"arabicnumber": 4346,
			"text": "Adiyy b. Adiyy, Resûlüllah (sallallahü aleyhi ve sellem)'dan önceki hadisin benzerini rivâyet etti Bu rivâyette Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Bir kimse kötülüğe şahit olur da onu çirkin görürse, ondan uzakta olan kimse gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4347,
			"arabicnumber": 4347,
			"text": "Ebû'l Bahteri demiştir ki; Resûlüllah (sallallahü aleyhi ve sellem)'den işiten birisi, -Süleyman Resûlüllah'ın ashabından bir adam dedi- Hadisi Ebû Dâvûd'a Süleyman b. Harb ve Hafs b. Ömer rivâyet etmişlerdir. Birinci rivâyet Hafs'a, ikincisi de Süleyman'a aittir. bana, Resûlüllah (sallallahü aleyhi ve sellem)'in şöyle buyurduğunu haber verdi: İnsanlar, günahları ve ayıpları çoğalıncaya kadar helak olmayacaklardır.\" b. Hanbel IV, 260; V, 293",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4348,
			"arabicnumber": 4348,
			"text": "Abdullah b. Ömer (radıyallahü anhümâ) şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem) ömrünün sonunda bir gece bize yatsı namazını kıldırdı. Selâm verince ayağa kalktı ve \" Bu geceyi görüyorsunuz ya, işte bu geceden itibaren yüz sene sonra (bu gün) yeryüzünde olanlardan hiç kimse kalmayacaktır.\" buyurdu. Ömer şöyle dedi: İnsanlar Resûlüllah (sallallahü aleyhi ve sellem)'ın bu sözünü (anlamakta) hataya düştüler. Halbuki Resûlüllah (sallallahü aleyhi ve sellem) Bu gün yeryüzünde olanlardan hiç kimse kalmayacaktır, buyurmuş, bu müddetin bu asırda yaşayanları mahvedeceğini (haber vermek) istemiştir\" ilim 41; Mevâkit Salât 40; Muslim. fedâilu's-sahabe, 216; Tirmizi, fiten 64; Ahmed b. Hanbel, II, 88",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4349,
			"arabicnumber": 4349,
			"text": "Ebû Sa'lebe el-Huşenî (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Allah (celle celâluhu) bu ümmete yarım gün (mühlet vermek) den aciz değildir.\" b. Hanbel, IV, 193",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4350,
			"arabicnumber": 4350,
			"text": "Sa'd b. Ebi Vakkas (radıyallahü anh)'den; (sallallahü aleyhi ve sellem)'in şöyle buyurduğu rivâyet edilmiştir: Şüphesiz ben ümmetimin Rableri katında, onlara yarım gün geciktirmesinden aciz olmadığını umarım.\" Yarım gün ne kadardır?\" denildi Sa'd: Beş yüz sene\" cevabını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 60
			}
		}
	]
}