{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4351,
			"arabicnumber": 4351,
			"text": "İkrime (r.a)'den rivayet edildiğine göre: Hz. Ali (r.a) dinden çıkan bir takım insanları ateşte yaktı. Bu (haber) Abdullah b. Abbas'a ulaştığında Abdullah (r.a) şöyle dedi: (Ben olsaydım) Onları ateşte yakmazdım. Çünkü Rasulullah (sallallahu aleyhi ve sellem) \"Allah'ın azabı ile cezalandırmayınız\" buyurdu. Ama, Rasulullah'ın sözü sebebiyle onları öldürürdüm. Çünkü Rasulullah (s.a.v.) \"Kim dinini değiştirirse onu hemen öldürünüz\" buyurdu. Bu sözler Hz. Ali'ye ulaşınca; \"Vah îbn Abbas!\" dedi. Diğer tahric: Buhari, cihad; Tirmizi, hudud; Nesaî, Tahrîmu'd-dem; İbn Mace hudud; Ahmed b. Hanbel, I, 217, 220",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4352,
			"arabicnumber": 4352,
			"text": "Abdullah (b. Mes'ud) (r.a) şöyle demiştir : Rasulullah (s.a.v.) şöyle buyurdu: \"Allah'tan başka ilah olmadığına, benim Allah'ın Rasûlü olduğuma şehadet eden müslünıan bir kişinin kanı ancak üç şeyden birisi ile helal olur; Zina eden Seyyib, cana karşı can ve dinini terkedip cemaatten ayrılan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4353,
			"arabicnumber": 4353,
			"text": "Aişe (radiyallahü anha'dan; rivayet edildiğine göre; Rasulullah (s.a.v.) şöyle buyurmuştur: \"Allah'tan başka ilah olmadığına ve Muham-med'in Allah'ın Rasulü olduğuna şehadet eden müslüman birisinin kanı helal olmaz. Ancak şu üç husustan birisi dolayısıyla olması müstesna: 1) İhsandan sonra zina eden adam; o recmedilir, 2) Allah'a ve Rasulüne karşı savaşa çıkan adam; o, öldürülür veya salbedilir ya da ülkeden sürgün edilir. 3) Bir insanı öldüren; o da öldürdüğü kişiye karşılık öldürülür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4354,
			"arabicnumber": 4354,
			"text": "Ebu Mûsâ (r.a), şöyle demiştir: Yanımda Eş'arilerden iki adamla birlikte Rasulullah (s.a.v.)'e geldim. Adamlardan birisi sağımda birisi solumda idi. Her ikisi de Rasulullah'tan görev istediler. Rasulullah susmakta idi. Bunun üzerine: \" Ne diyorsun ya Ebu Musa? veya: Ya Abdullah b. Kays?\" dedi. Seni hak (din) ile gönderen Allah'a yemin ederim ki, gönüllerindekini bana söylemediler ve onların görev isteyeceklerinin farkına dahi varmadım, dedim. Sanki ben şu anda Rasulullah'ın dudağı altında misvakinin yükseldiğini görür gibiyim. Rasulullah (s.a.v.): \"Biz işimize asla onu isteyeni tayin etmeyeceğiz - veya onu isteyeni ta­yin etmeyiz [Şek ravinindir] - ama, ey Ebu Musa - yada Abdullah b. Kays- sen git\" buyurdu ve onu Yemen'e gönderdi. Sonra peşinden Muaz b. Cebel (r.a)'i de gönderdi.Râvi der ki: Muaz, Ebu Musa'nın yanına varınca Ebu Musa, \"in\" (buyur) dedi ve onun için bir minder serdi. Muaz, Ebu Musa'nın yanında bağlı bir adam gördü ve: Bu ne? dedi Ebu Musa: Bu yahidi idi, müslüman oldu, sonra tekrar dinine; kötü dinine döndü, de­di. Muaz: O öldürülmedikçe oturmam. Bu, Allah'ın ve Rasulünün hükmüdür, dedi. Ebu Musa: Otur, evet, dedi. Muaz üç kere: O Öldürülünceye kadar oturmam. Bu Allah'ın ve Rasulünün hükmüdür, dedi. Bunun üzerine Ebû Musa emretti ve adam öldürüldü. Sonra bu iki sahabe gece namazını tartıştılar. Muaz: \"Ben uyurum da, namaz da kılarım; veya: namaz da kılarım uyurum da.[Şek ravinindir] Namazımda umduğumu (sevabı) uykum halinde de umarım\" dedi. Diğer tahric edenler: Buhari. istitabetü'l-mürteddin; Müslim, imare; Ahmed b. Hanbel, IV, 409. Hadisin izahı 4357 no'lu hadisten sonra gelecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4355,
			"arabicnumber": 4355,
			"text": "Ebû Mûsâ (r.a) şöyle demiştir: \"Ben Yemen'de iken Muaz yanıma geldi. Yahudi olan bir adam müslüman olmuş, sonra tekrar İslamdan çıkmıştı. Muaz gelince; \"O öldürülmedikçe hayvanımdan inmem\" dedi. Bunun üzerine adam öldürüldü. Râviler (Talha b. Yahya ve Büreyd b. Abdullah b. Ebi Bürde) den birisi: \"Adam daha önce tevbeye davet edilmişti\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4356,
			"arabicnumber": 4356,
			"text": "Eş-Şeybânî (Ebû îshak, Süleyman b. Feyrûz) Ebû Bürde'den yukarıdaki kıssayı rivayet etti.Ravî dedi ki: \"Ebû Musa (r.a)'ya İslamdan çıkan bir adam getirildi. Ebu Musa adamı yirmi gece veya ona yakın bir müddet (İslam'a) davet etti. Sonra Muaz geldi, o da (İslama) davet etti. Ama adam kabul etmedi. Bunun üzerine boynu vuruldu. (Muaz boynunu vurdurdu).\" Ebû Davûd der ki: \"Bu hadisi Ebu Bürde'den Abdülmelik b. Umeyr de rivayet etti, ama tevbeye davet meselesini zikretmedi. Ayrıca İbn Fuzayl Şeybani'den, o, Said b. Ebi Bürde'den o da babası vasıtasıyla Ebû Musa'dan rivayet etti, ama tevbeye da'veti anmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4357,
			"arabicnumber": 4357,
			"text": "Bize Mes'ûdî (Abdurrahman b. Abdullah b. Utbe b. Abdullah b. Mes'ud) Kasım (İbn Abdurrahman b. Abdullah b. Mesûd)dan bu kıssayı haber verip şöyle dedi: \"Onun boynu vuruluncaya kadar Muaz hayvanından inmedi ve onu tevbeye de davet etmedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4358,
			"arabicnumber": 4358,
			"text": "İbn Abbas (r.a.) şöyle demiştir: Abdullah b. Sa'd b. Ebi Şerh, Rasulullah (s.a.v.)'e (vahiy) kâtiplik (i) yapardı. Şeytan onu saptırdı. (İslamdan çıkıp) kafirlere iltihak etti. Bunun üzerine Rasulullah (s.a.v.) onun Fetih günü öldürülmesini emretti. (Ancak) Osman b. Affan (r.a) onun için eman istedi. Rasulullah {s.a.v.) de eman verdi. Tahric edenler: Nesai, tahrim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4359,
			"arabicnumber": 4359,
			"text": "Sa'd (b.Ebi Vakkas) (r.a) demiştir ki; Mekke'nin fethi gününde Abdullah b. Sa'd b. Ebi Şerh, Osman b. Affan'a sığındı. Osman onu getirip Rasulullah'ın huzurunda durdurttu. ve; Ya Rasulullah Abdullah'ın biatini kabul et (eman ver), dedi. Rasulullah (s.a.v.) başını kaldırıp ona baktı. (Osman r.a bunu) üç kere tekrar etti, Rasulullah (s.a.v.) her seferinde eman vermekten kaçınıyordu. Nihayet üçüncü müracaatından sonra biatini kabul buyurdu (eman verdi). Sonra ashabına dönüp; \"İçinizde, ben onun biatından kaçındığımda kalkıp onu öldürecek anlayışlı birisi yok muydu?\" buyurdu. Sahabiler: \"Ya Rasulullah senin gönlündekini biz bilmiyoruz, gözlerinle bize işaret etseydin ya\" dediler. Rasulullah (s.a.v.): \"Bir Nebiin hain gözlü olması yakışmaz\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4360,
			"arabicnumber": 4360,
			"text": "Cerir (b. Abdullah el-Beceli) (r.a)'den Rasulullah (s.a.v.)'i şöyle buyururken işittim: \"Köle (darı) şirke kaçtığı zaman, kanı helal olmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4361,
			"arabicnumber": 4361,
			"text": "İbn Abbas (radıyallahü anh) şöyle haber verdi: \"Â'mâ bir adam'ın bir ümmü veledi vardı, Rasâlullah'a küfreder, onun hakkında yakışıksız şeyler söylerdi. Â'mâ onu bundan nehyeder, fakat kadın vazgeçmez, â'ma yine onu men eder ama dinlemezdi. Kadın bir gece Rasulullah (s.a.v.) hakkında yakışıksız şeyler söylemeye, o'na küfretmeye başladı. Bunun üzerine â'mâ hançeri aldı kadın'ın karnına sapladı ve üzerine yüklenip onu öldürdü. Ayakları arasına bir çocuk düştü. Kadın orasını (yatağı) kana buladı. Sabah olunca olay Rasulullah'a anlatıldı. Rasulullah (s.a.v.) halkı toplayıp şöyle dedi: \"Bu işi yapan şahsı Allah'a havale ediyorum (Allah adına yemin vererek arıyorum). Şüphesiz onun üzerinde benim hakkım var, (bana itaat etmesi vacip) ama ayağa kalkarsa müstesna.\" Bunun üzerine â'mâ kalktı, safları yararak ve sallanarak (gelip) Rasûlullah (s.a.v.)'in önüne gelip oturdu ve: \"Ya Rasulullah! Ben o kadın'ın sahibiyim. Sana küfreder ve hakkında çirkin sözler söylerdi. Onu nehyederdim dinlemez, menederdim vazgeçmezdi. Benim ondan inci tanesi gibi iki oğlum var. O bana karşı da yumuşaktı. Dün gece yine sana sövmeye ve hakkında çirkin sözler söylemeye başladı. Ben de hançeri alıp karnına sapladım, üzerine yüklenip onu öldürdüm.!' dedi. Rasulullah (s.a.v.): \"Dikkat edin! Şahid olunuz ki o kadının kanı hederdir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4362,
			"arabicnumber": 4362,
			"text": "Ali (r.a) şöyle demiştir; \"Bir yahudi kadın, Rasulullah (s.a.v.)'e küfreder ve o'nun hakkında çirkin şeyler söylerdi. Bir adam o kadın'ı boynundan yakaladı ve basarak öldürdü. Rasulullah (s.a.v.) kadın'ın kanını iptal etti (heder saydı)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4363,
			"arabicnumber": 4363,
			"text": "Ebu Berze (r.a) der ki: Ebu Bekir (r.a)'in yanında idim, bir adam'a öfkelendi ve o'na sert davrandı. Ben kendisine: Ey Rasulullah'ın halifesi, izin verirsen boynunu vurayım, dedim. Benim bu sözüm Ebu Bekir'in öfkesini dindirdi. Kalkıp (odasına girdi). Sonra bana (birisini) gönderip; Az önce dediğin ne idi? dedi Bana izin ver, boynunu vurayım, dedim. Şayet emredersem yapar mısın? Evet. Hayır, vallahi Muhammed Sallallahu aleyhi ve sellem'den sonra buna kimsenin hakkı yok, dedi. Ebu Davud: \"Bu Yezid'in lafzıdır\" dedi. Ahmed b. Hanbel şöyle dedi: \"Yani Ebubekirin Rasulullah'ın söylediği su üç şeyin haricinde hiç kim­seyi öldürmeye hakkı yoktur. İmandan sonra küfür, ihsandan sonra zina veya birisini kıssasın dışında öldürmek. Rasulullah' in bunlardan birisi olmadan da öldürmeye yetkisi vardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4364,
			"arabicnumber": 4364,
			"text": "Enes b. Malik (r.a) den rivayet edildi ki; Ukl veya Urayne'den bir grup Rasulullah (s.a.v.)'e geldi. Ama Medine'nin havasına uyum sağlayamadılar. Rasulullah (s.a.v.) onlara sağmal develeri tavsiye edip idrarlarından ve sütlerinden içmelerini emretti. Onlar da gittiler ve iyileşince Rasulullah'ın çobanını öldürdüler, develeri de sürüp götürdüler. Onların bu yaptıklarının haberi daha günün başında Rasulullah'a ulaştı. Efendimiz de peşlerinden (adam) gönderdi. Günün ilerlemiş bir vaktinde (yakalanarak) Rasulullah'a getirildiler. Rasulullah emretti ve adamların elleri ayakları kesildi, gözlerine mil çekildi ve Harra'ya atıldılar. Su istiyorlar fakat kendilerine su verilmiyordu. Ebu Kılâbe der ki: \"Bunlar, çalan, öldüren, imandan sonra kafir olan, Allah ve Rasûlüne karşı muharebe eden bir kavimdir.\" Tahric edenler: Buhari, zekat; cihad; tıp; hudud; Müslim, kasâme; İman; Tirmizi vudû'; et'ime ; tıb; İbn Mace, hudûd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4365,
			"arabicnumber": 4365,
			"text": "Vüheyb, Eyyûb'dan bu (önceki 4364.) hadisi, aynı isnadla rivayet edip şöyle dedi: Rasulullah (s.a.v.) çiviler istedi, onlar kızartıldı ve gözlerine çekti, ellerini ve ayaklarını kestirdi ve onları (kanlarının kesilmesi için damarlarını ateşle) dağlamadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4366,
			"arabicnumber": 4366,
			"text": "Velid bize Evzai'den, Evzai Yahya-yani İbn Ebi Kesir'den o da Ebu Kılabe vasıtasıyla Enes b. Malik'den bu (önceki 4365.) hadisi rivayet etti; ravi (bu rivayette şöyle) dedi: \"Rasulullah (s.a.v.) onları bulmak için iz sürücüler (arayıcılar) gönderdi. Onlar yakalanıp getirildiler. Bunun üzerine Allah tebareke ve tealâ: \"Şüphesiz Allah ve Rasûlü ile savaşanların ve yeryüzünde fesad çıkaranların cezası... (Öldürülmeleri veya asılmaları ya da ellerinin ve ayaklarının çaprazlama kesilmesi veya yerlerinden sürülmeleridir. Bu onlara dünyada bir rezilliktir. Onlara âhirette de büyük azap vardır.)[Maide 33] âyetini indirdi. Ayetle ilgili: Parantez içindeki kısım, ayetin hadis metninde olmayan bölümü­nün mealidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4367,
			"arabicnumber": 4367,
			"text": "Sabit, Katade ve Humeyd, Enes b. Malik'den bu (4364, 4365nolu) hadisi rivayet ettiler. Bu rivayette Enes (r.a) şöyle dedi: \"Onlardan birisini, susuzluktan, ağzıyla toprağı ısırırken gördüm. İşte böylece ölüp gittiler.\" Tahric edenler: Buhari, tıp; Tirmizi, taharet; Nesâî, tahrim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4368,
			"arabicnumber": 4368,
			"text": "Hişam, Katade vasıtasıyla Enes b. Malik (r.a)'den bu (4364, 4365 nolu) hadisin benzerini rivayet etti. Râvî şunu ilave etti: \"Rasulullah (s.a.v.) sonra Musle (adamların kulak, burnun, dudak gibi organlarını kesmek)'den nehyetti.\" Bu rivayette \"Çaprazlamasına\" sözünü zikretmedi. Şu'be; Katade ve Selam b. Miskin'den, onlar da Sabit'ten hepsi Enes'den bu hadisi rivayet ettiler, Katade ve Selam: \"Çaprazlamasına\" sözünü zikretmediler. Ben, Hammad b. Seleme'nin dışında onların hiçbirinin rivayetinde \"Ellerinin ve ayaklarının çaprazlamasına kesildiği'' ifadesini bulamadım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4369,
			"arabicnumber": 4369,
			"text": "İbn Ömer (radıyallahu anh), dedi ki: Bazı insanlar, Rasûlullah'ın develerini yağma edip sürüp götürdüler, İslam'dan döndüler, Rasûlullah (s.a.v.)'in mu'min olan çoban'ını öldürdüler. Bunun üzerine Rasûlullah peşlerinden (adamlar) gönderdi. Hırsızlar yakalandı. Efendimiz ellerini ve ayaklarını kesti, gözlerini oydu. Onlar hakkında, muharebe ayeti (Maide, 33) nazil oldu. Haccac sorduğu zaman, Enes b. Malik'in bildirdiği kişiler onlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4370,
			"arabicnumber": 4370,
			"text": "Ebu'z-Zinâd şöyle, demiştir: \"Rasulullah (s.a.v.) sağmal develerini çalanların (ellerini ayaklarını) kesip, ateşle gözlerini oyunca onun dikkatini çekmek için Allah (c.c): \"Allah ve Rasûlü ile savaşanların ve yeryüzünde fesad çıkaranların cezası, öldürülmeleri veya asılmaları...\"[Mâide 33] ayetini indirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4371,
			"arabicnumber": 4371,
			"text": "Muhammed b. Sirin demiştir ki: \"Bu, yani (4364, 4365) Enes hadisi hadler indirilmeden (meşru kılınmadan) önce idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4372,
			"arabicnumber": 4372,
			"text": "İbn Abbas (r.a.) şöyle demiştir: \"Allah ve Rasülü ile savaşanların ve yeryüzünde fesat çıkaranların cezası öldürülmeleri veya asılmaları ya da ellerinin ve ayaklarının çaprazlama kesilmesi veya yerlerinden sürülmeleridir... Bu onlara dünyada bir rezilliktir. Onlara ahirette de büyük azab vardır. Ancak onları yakalamanızdan önce tevbe edenler bunun dışındadır. Biliniz ki Allah bağışlar ve merhamet eder.\" ayeti müşrikler hakkında nazil oldu. Onlardan her kim yakalanmadan önce tevbe ederse bu kendilerine lâzım olan haddin uygulanmasına mâni olamaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4373,
			"arabicnumber": 4373,
			"text": "Aişe radıyallahu anha şöyle; demiştir Mahzume kabilesine mensup, hırsızlık yapan bir kadının durumu Kureyş'i üzdü. \"Onun hakkında Resulullah ile kim konuşur\" denildi. \"Buna Rasûlullah'ın çok sevdiği Usâme b. Zeyd'den başka kim cesaret edebilir?\" dediler. Usâme Rasulullah (s.a.v.) ile konuştu. Bunun üzerine Rasulullah (s.a.v.); \"Ya Üsame! Allah'ın hadlerinden bir hadde şefaat mı ediyorsun?\" buyurdu. Sonra kalkıp halk'a hitaben şöyle dedi: \"Şüphesiz sizden öncekiler, içlerinde itibarlı birisi hırsızlık yaptığı zaman bırakıverdikleri, zayıf birisi hırsızlık yaptığında ise kendisine had uyguladıkları için helak oldular. Allah'a yemin ederim ki eğer Muhammed'in kızı Fatima (bile) hırsızlık yapsa elini keserim.\" Tahric edenler: Buhârî, hudud; enbiya; Müslim, hudud; Tirmizi, hudûd; İbn Mâce, hudud; Nesâi, sarik; Darimi. hudûd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4374,
			"arabicnumber": 4374,
			"text": "Ma'mer; Zühri'den, Zührî; Urve'den o da Hz. Aişe'den rivayet etmiştir. Aişe (r.anha) şöyle dedi: \"Mahzum kabilesinden bir kadın iyreti eşya alır -ve onu inkâr ederdi. Rasulullah (s.a.v.)'de o kadın'ın elinin kesilmesini emretti.\" Ravî, Leys'in (önceki 4373.) hadisinin benzerini anlattı, \"Rasulullah (s.a.v.) kadın'ın elini kesti\" dedi. Ebû Davûd der ki: Ibn Vehb bu hadisi, Yunus vasıtasıyla Zühri'den ri­vayet edip Leyş'in dediği gibi söyle dedi: \"Rasulullah (s.a.v.) zamanında, Feth (Mekke fethi) gazvesinde hırsızlık yaptı....\" Leys, Ibn Şihab'dan aynı isnadla rivayet edip \"Bir kadın iyreti aldı... \" dedi. Mes'ud b. el-Esved de Rasulullah (s.a.v.)'den bu haberin benzerini rivayet etti ve \"Rasulullah'in evinden bir kadife çaldı...\" dedi. Ebu'z-Zübeyr, Cabir'den, bir kadının hırsızlık yapıp Rasulullah (s.a.v.)'in kızı Zeyneb'e sığındığını rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4375,
			"arabicnumber": 4375,
			"text": "Aişe radıyallahu anha'dan; rivayet edildiğine göre, Rasulullah (s.a.v.) şöyle buyurmuştur: \"İyi haslet sahiplerinin haddi gerektirenler dışındaki hatalarını bağışlayın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4376,
			"arabicnumber": 4376,
			"text": "Abdullah b. Amr b. el-As (r.a.)'dan; Rasulullah (s.a.v.)'in şöyle buyurduğu rivayet edilmiştir: \"Hadleri aranızda bağışlayınız. Bana ulaşan hadd (in uygulanması) ise vacib olmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4377,
			"arabicnumber": 4377,
			"text": "Yezid b. Nuaym, babası (Nuaym)'dan şöyle rivayet etti: Mâiz (r.a) Rasulullah (s.a.v.)'e gelip dört defa (zina ettiğini) ikrar etti. bunun üzerine Rasulullah (s.a.v.) recmedilmesini emretti ve Hazzâl'e; \"Eğer onu elbisenle gizleseydin senin için daha hayırlı olurdu\" dedi. İzahı 4378 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4378,
			"arabicnumber": 4378,
			"text": "İbnü'l Münkedir şöyle demiştir: Hezzâl, Mâız'a; Resûlüllah'a gidip haber vermesini emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4379,
			"arabicnumber": 4379,
			"text": "Alkame b. Vail babasından, şöyle rivayet etmiştir: Rasulullah (s.a.v.) devrinde bir kadın namaza gitmek üzere çıkmıştı. Karşısına bir adam çıkıp kadın'ın elbisesini başına örttü ve tecavüz etti. Kadın bağırdı ve adam da gitti. O anda yanından geçen başka birisine ; Kadın: \"İşte şu adam bana şöyle şöyle yaptı\" dedi. Muhacirlerden bir gruba uğrayıp yine, \"Şu adam bana şöyle şöyle yaptı\" dedi. O grup gidip kadın'ın kendisine tecavüz ettiğini zannettiği adam'ı yakaladılar, kadın'a getirdiler. Kadın: \"Evet bu, o\" dedi. Bunun üzerine adam'ı alıp Rasulullah (s.a.v.)'e götürdüler. Rasulullah (s.a.v.) adam'ın (recmedilmesini) emredince, kadın'a tecavüz eden adam ayağa kalktı ve: \"Ya Rasulullah, ona tecavüz eden benim\" dedi. Rasulullah kadına döndü ve; \"Git seni Allah bağışladı\" buyurdu. (Getirilen) adam'a iyi sözler söyledi. Ebû Dâvûd dedi ki; Yani (iyi sözler tik) tutuklanan adam içindi. Kadına tecavüz eden adam için de: \"Onu recmediniz. Şüphesiz o öyle bir tevbe etti ki eğer tüm Medine halkı o tevbeyi etseydi hepsinden kabul olunurdu. buyurdu. Ebû Davûd: \"Şu hadisi Esbal b. Nasr da Sımak'dan rivayet etti.\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4380,
			"arabicnumber": 4380,
			"text": "Ebu Ümeyye el-Mahzûmi (r.a) şöyle demiştir: Rasulullah (s.a.v.)'e (çaldığmı) kesin bir dille itiraf eden bir hırsız getirildi (ama) yanında mal bulunmuyordu. Efendimiz: \"Senin (birşey) çaldığını zannetmiyorum\" buyurdu. Adam: \"Evet çaldım\" dedi ve bu sözü iki veya üç [Şek ravilerdendir], defa tekrarladı. Bunun üzerine Rasulullah (s.a.v.) emretti, adam'(ın eli) kesildi ve Rasulullah'a (tekrar) getirildi. Rasulullah: \"Allah'tan bağış dile ve ona tevbe et\" buyurdu. Adam: Estağfirullâhe ve etûbû ileyh: Allah'tan bağış diler ve ona tevbe ederim\" dedi. Rasulullah (s.a.v.) üç kerre: \"Allah'ım, onun tevbesini kabul et\" dedi. Ebû Davûd der ki: \"Bu hadisi Amr b. Asım, Hemmam'dan, o İshak b. Abdullah'dan riva­yet eni. ishak: Ensar'dan birisi olan Ebû Ümeyye Rasulullah' dan (riva­yet etti), dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4381,
			"arabicnumber": 4381,
			"text": "Ebû Ümâme (r.a) haber verdi ki: Bir adam Rasulullah'a gelip: Ya Rasulullah ben haddi gerektiren bir suç işledim. Bana haddi uygula, dedi. Rasulullah: \"-Geleceğin zaman abdest aldın mı?\" dedi. Evet, \"Biz namaz kıldığımızda, bizimle birlikte namaz kıldın mı?\" Evet \"Haydi git, Allah seni affetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4382,
			"arabicnumber": 4382,
			"text": "Ezher b. Abdullah el-Harâzî şöyle haber verdi: Kelâ kabilesinden bir grubun malları çalındı. Dokumacılardan bazı insanları itham edip onları Rasulullah'ın sahabesinden olan Nu'man b. Beşir'e getirdiler. Nu'man onları bir kaç gün hapsetti, sonra salıverdi. Kelâ'lılar Nu'man'a gelip: \"Onları dövmeden ve işkence etmeden salıverdin?\" dediler. Nu'man: Nasıl isterseniz. İsterseniz onları döveyim. Şayet mallarınız (onlardan) çıkarsa mesele yok, ama çıkmazsa onların sırtına vurduğum kadar size de vururum\" dedi. Kela'lılar: Bu senin hükmün mü? dediler. Nu'man: Bu, Allah'ın ve Rasulullah (s.a.v.)'in hükmüdür, dedi. Ebû Davûd der ki: \"Nu'man bu sözü ile Kela'lılan korkut (mak istemiş) ti. Yani dayak ancak itiraftan sonra icâbeder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4383,
			"arabicnumber": 4383,
			"text": "Âişe (r.anha) şöyle demiştir: Rasulullah (s.a.v.) çeyrek dinar ve daha çoğunda (hırsızın elini) keserdi Tahric edenler: Müslim, hudûd; Tirmizi, hudûd; Nesai, katu's-sarık; Ahmed, b. Hanbel, VI, 36. İzah 4387 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4384,
			"arabicnumber": 4384,
			"text": "Aişe (r.anha)'dan, rivayet edildiğine göre: Rasulullah (s.a.v.) şöyle buyurmuştur: \"Hırsızın eli çeyrek dinar ve daha fazlasında kesilir.\" ----------- Hadisi Ebu Davud'a Ahmed b. Salih ve Vehb b. Beyân nakletmelerdir. Bu kısım Ahmet b. Salih'in rivayetidir. ----------- Ahmed b. Salih: \"Kesmek, çeyrek dinar ve daha fazlasındadır\" dedi. Tahric edenler: Buhârî, hudûd: Müslim, hudûd; Nesâî. Katu’s-Sarık; İbn Mâce, hudûd; Ahmed b. Hanbel II, 36, 41, 80, 126. 163. İzah 4387 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4385,
			"arabicnumber": 4385,
			"text": "İbn Ömer (r.a)'dan rivayet edildiğine göre: Rasulullah (s.a.v.) fiatı üç dirhem (gümüş) olan bir kaîkan (ı çalan hırsızın elini) kesti. Tahric edenler: Buhâri, hudûd; Müslim, hudûd; Nesâi, katu's-sarık; İbn Mâce hudûd; Tirmi­zi, hudûd; Malik, hudûd; Darimi, hudûd; Ahmed b. Hanbel, II. 6, 54, 64. İzah 4387 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4386,
			"arabicnumber": 4386,
			"text": "Abdullah b. Ömer (r.a) demiştir ki: \"Rasulullah (s.a.v.); kadınlar sofasından fiatı üç dirhem gümüş olan bir kalkan çalan adamın elini kes­ti.\" Tahric edenler: Nesâi, sarık; Ahmed b. Hanbel II. 145. İzah 4387 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4387,
			"arabicnumber": 4387,
			"text": "İbn Abbas (r.a) demiştir ki: \"Rasulullah (s.a.v.) kıymeti bir dinar (altın) veya on dirhem (gümüş) olan bir kalkan (çalan) adamı (n elini) kesti\" Ebû Davûd der ki: Bu hadisi Muhammed b. Seleme ve Sa'dân b. Yahya ibni İshak'tan ay­nı isnadla rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4388,
			"arabicnumber": 4388,
			"text": "Muhammed b. Yahya b. Habban, şöyle demiştir: Bir köle, birisinin bahçesinden bir hurma fidanı çaldı ve onu efendisinin bahçesine dikti. Fidan sahibi, fidanını aramaya başladı ve onu buldu. Köleyi, o zaman Medine emiri olan Mervan b. Hakem'e şikayet etti. Mervan köleyi hapsetti ve elini kesmek istedi. Köle'nin sahibi, Râfi, b. Hadîc (r.a)'e gidip bu mes'eleyi sordu. Râfi, ona, Rasulullah (s.a.v.)'i: \"Meyveden ve hurmadan dolayı el kesilmez\" buyururken işittiğini haber verdi. Adam: \"Şüphesiz Mervan kölemi yakaladı, elini kesmek istiyor. Ben senin, benimle birlikte ona gidip Rasulullah (s.a.v.)'den duyduğun bu sözleri haber vermeni istiyorum\" dedi. Râfi'b. Hadîc adamla birlikte yürüyüp Mervan b. Hakem'e geldi. Mervan'a: \"Ben Rasulullah'ı, meyve ve hurma yağında el kesilmez, buyururken işittim.\" dedi. Bunun üzerine Mervan kölenin salıverilmesini emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4389,
			"arabicnumber": 4389,
			"text": "Muhammed b, Ubeyd, Hammad'dan (o), Yahya'dan (o), Muhammed b. Yahya b. Habban'dan bu (4388.) hadisi rivayet etti. Ravi şöyle dedi: \"Mervan o köleye birkaç sopa vurdu ve serbest bıraktı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4390,
			"arabicnumber": 4390,
			"text": "Abdullah b. Amr b. el-Âs (r.a) şöyle demiştir: Rasulullah (s.a.v.)'e; ağaçtaki meyve (nin hükmü) soruldu. Rasulullah (s.a.v.) şöyle buyurdu: \"İhtiyaç içinde olan birisi, yanında bir şey götürmeksizin sadece yerse ona birşey gerekmez. Ondan birşey götüren kimseye ise aldığının iki katı (bir katı) ödetilir ve ceza gerekir. Her kim harman yerine getirildikten sonra meyveden bir şey çalar ve çaldığı, bir kalkan fiatına ulaşırsa eli kesilir. (Bundan daha azını çalana ise çaldığının iki katı­nı ödeme zorunluluğu ve ceza vardır.)\" Ebu Davûd: \"Çerin (harman yeri) hurma kurutulan yerdir\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4391,
			"arabicnumber": 4391,
			"text": "Câbir b. Abdullah (r.a) demiştir ki; Rasûlullah (s.a.v.) şöyle buyurmuştur: \"(Birisinin malını) açıktan zorla alan'ın (müntehibin) eli kesilmez. Açıkta olan bir malı zorla olan bizden değildir.\" Tahric edenler: Nesai, nikah; hıyel; sarık; Tirmizi, hudûd; îbn Mace, hudûd, fiten; Ahmed b. Hanbel III, 140, 197, 390",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4392,
			"arabicnumber": 4392,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4393,
			"arabicnumber": 4393,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4394,
			"arabicnumber": 4394,
			"text": "Safvan b. Ümeyye (r.a) şöyle demiştir: Üzerimde otuz dirhem değerinde bir abam bulunduğu halde Mescidde uyuyamazdım. Bir adam gelip onu benden çaldı. Adam yakalanıp Rasûlullah (s.a.v.)'e getirildi ve Rasulullah (onun elinin) kesilmesini emretti. Ben efendimize gidip: \"Otuz dirhem yüzünden onu(n elini) kesecek misin? Ben abayı ona satıyorum ve parasına da vade veriyorum\" dedim. Rasulullah: \"Adamı bana getirmeden önce bunu yapsaydın olmaz mıydı? buyurdu. Ebû Dâvûd der ki: \"Bu hadisi Zaide, Simak'ten, o da Cuayd b. Huceyr'den rivayet edip; \"Safvan uyudu\" dedi. Mücahid ve Tavus,\" O uyumakta idi. Bir hırsız gelip başının altından bir desenli aba çaldı\" diye rivayet ettiler. Ebû Seleme b. Abdurrahman ise rivayetinde: \"Abayı başının altından çekti, Safvan uyanıp bağırdı ve adam yakalandı\" dedi. Zührı de Safvan b. Abdullah'dan şöyle ri­vayet etti: \"'Safvan ridasını başının altına yastık yaparak mescidde uyudu. Bir hırsız gelip ridayt çaldı. Hırsız yakalanıp Rasülullah (s.a.v.) 'a getirildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4395,
			"arabicnumber": 4395,
			"text": "İbn Ömer (r.a) demiştir ki; Mahzûm kabilesinden bir kadın, eşya ariyet alır ve onu inkâr ederdi. Rasulullah (s.a.v.) emretti ve kadının eli kesildi. Bu Hadisi Müslim, hudud’da tahric etti. Ebû Dâvûd der ki: \"Bu hadisi Cüveyriye, Nafi'den o da İbn Ömer veya Safiyye binti Ebu Ubeyd'den rivayet etti, Ravi bu rivayette şunları da ilave etti: Rasulullah (s.a.v.) hitab için kalkıp şöyle buyurdu: \"Allah'a tevbe eden, Rasulullah'dan özür dileyen bir kadın var mı?\" Rasulullah bu sözü üç kez tekrarladı. Kadın da orada hazır olduğu halde kalkıp konuşmadı. Bu hadisi ibn Qanc, Nafi'den o da Safıyye binti Ebû Ubeyd'den riva­yet etti. Bu rivayette: \"(Rasulullah) kadın’ın aleyhine şahitlikte bulundu.\" dedi. İZAH 4397 DE",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4396,
			"arabicnumber": 4396,
			"text": "Aişe radıyallahu anha şöyle demiştir: Bir kadın kendisi tanınmadığı halde (halk arasında) tanınan bazı insanların adına -zînet eşyası - ariyet aldı. Ama o eşyayı sattı. Yakalanıp Rasûlullah (s.a.v.)'e getirildi. Rasulullah (s.a.v.) elinin kesilmesini emretti. Bu kadın, hakkında Üsame'nin şefaatçi olup Rasulullah'ın, bilinen sözleri (yani Allah'ın hadlerinden birinde şefaat mı ediyorsun? Sizden öncekiler içlerinde hatırlı birisi çaldığında onu terk ederler, zayıf birisi çaldığında ise haddi uyguladıkları için helak oldular. Allah'a yemin ederim ki eğer Muhammed'in kızı Faüma'da çalsa elini keserim) söylediği kadındır. Diğer Tahric eden: Nesai, sarik İZAH 4397 DE",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4397,
			"arabicnumber": 4397,
			"text": "Aişe radıyallahu anha şöyle demiştir: Mahzum kabilesinden bir kadın eşya ariyet alır ve onu inkar ederdi. Rasulullah (s.a.v.) elinin kesilmesini emretti. Ravi Abbas, Kuteybe'nin Leys kanalıyla İbn Şihab'dan rivayet ettiği (4373 numaradaki) hadisin aynısını rivayet edip: \"Rasulullah kadının elini kesti\" sözünü ilave etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4398,
			"arabicnumber": 4398,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre, Rasulullah (s.a.v.) şöyle buyurmuştur: \"Üç gruptan kalem kaldırılmıştır: Uyanıncaya kadar uyuyandan, iyileşinceye kadar cinnet getirenden ve büyüyünceye kadar çocuktan\" Tahric edenler: İbn Mace. talak; Ahmed b. Hanbel, I, 155, 158, VI, 144",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4399,
			"arabicnumber": 4399,
			"text": "İbn Abbas radıyallahu anhüma şöyle demiştir: Ömer (r.a)'e zina etmiş olan akıl hastası bir kadın getirildi. Hz. Ömer, onun hakkında insanlarla istişarede bulundu ve recmedilmesini emretti. Ali b. Ebi Talib (r.a) kadına rastladı (bir diğer nüshaya göre: Kadını Ali b. Ebî Talib'in bulunduğu bir yerden götürdüler) ve; Bunun hali ne? dedi. Bu falan oğullarının delisidir. Zina etti, Ömer de recmedilmesini emreddi, dediler. Ali: Onu geri götürünüz, dedi, sonra da Ömer'e gelip:, Ey mü'minlerin emiri! (Rasûlullah'ın:) \"Üç gruptan; iyileşinceye kadar deliden, uyanıncaya kadar uyuyandan ve aklı erinceye (baliğ oluncaya) kadar da çocuktan kalem kaldırılmıştır\" (diye) buyurduğunu bilmiyor musunuz? dedi. Ömer (r.a): Evet biliyorum, O halde bu kadının durumu nedir, neden recmedüiyor? Bir şey yok. Onu salıver, İbn Abbas: Ömer (r.a) kadını salıverdi ve tekbir getirmeye başladı, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4400,
			"arabicnumber": 4400,
			"text": "Vekî, A'meş'ten naklen bu (4399.) hadisin benzerini rivayet etti. Önceki hadiste olduğu gibi: \"Çocuk, aklı erinceye kadar ve akıl hastası da ifakat buluncaya (ayılıncaya) kadar....\" sonra da Ömer tekbir getirmeye başladı, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4401,
			"arabicnumber": 4401,
			"text": "İbn Abbas (r.a) demiştirki: \"Ali b. Ebi Talib radıyallahu anh bana uğradı... \" Ravi, Osman'ın hadisinin manasım rivayet etti ve şöyle dedi:(Ali:) \"Rasulullah (s..a.v.)'in, \"kalem üç gruptan kaldırıldı; aklı başından gitmiş akıl hastasından, uyanıncaya kadar uyuyandan ve baliğ oluncaya kadar çocuktan \" buyurduğunu hatırlamıyor musun? dedi. Ömer: Doğru söyledin, dedi. İbn Abbas: \"Ömer kadını serbest bıraktı\" dedi. Tahric edenler: Buhari. hudûd; Ahmed. b. Hanbel, I, 140, 154, 155",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4402,
			"arabicnumber": 4402,
			"text": "Ebu Zabyan Hennad'ın dediğine göre el Cenbî- şöyle dedi: Ömer (r.a)'e zina etmiş olan bir kadın getirildi. Ömer de recmedümesini emretti. Ali (r.a) (kadına) rastladı, onu alıp serbest bıraktı. Bu, Ömer'e haber verildi. Ömer (r.a). Ali'yi bana çağırın, dedi. Ali (r.a) gelip: Ey Mü'minlerin emiri biliyorsun ki \"Rasulullah (s.a.v.); \"üç gruptan kalem kaldırıldı; buluğa erinceye kadar çocuktan, uyanıncaya kadar uyuyandan ve iyileşinceye kadar bunaktan\" buyurdu. Şüphesiz bu kadın falan oğullarının bunağıdır. Her halde ona tecavüz eden ona cinnet halinde iken tecavüz etmiş\" dedi. Ömer: \"Bilmiyorum\" Ali: \"Ben de bilmiyorum\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4403,
			"arabicnumber": 4403,
			"text": "Ali (r.a)'den; rivayet edildiğine göre; Rasulullah (s.a.v.) şöyle buyurmuştur: \"Üç gruptan kalem kaldırılmıştır; uyanıncaya kadar uyuyandan, buluğa erinceye kadar çocuktan ve akıllanıncaya kadar akıl hastasından.\" Ebû Davûd der ki: Bu hadisi Ibn Cerir Kasım b. Yezid'den, o da Ali (r.a) vasıtasıyla Ra-sulullah'tan (rivayet etti ve) ona \"ve bunaklıktan..\" sözünü ilave etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4404,
			"arabicnumber": 4404,
			"text": "Atıyye el-Kurazı (r.a.) şöyle demiştir: \"Ben Ben-i Kureyza esirlerindendim. Müslümanlar bakıyorlar, (eteğinde) kıl bitenleri öldürüyorlar, bitmeyenleri öldürmüyorlardı. Ben kıl bitmeyenlerdendim.\" Tahric edenler: Tirmizi, siyer; îbn Mace, hudûd; Darimi, siyer; Ahmed b. Hanbel IV, 310, V, 312. İzah 4407 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4405,
			"arabicnumber": 4405,
			"text": "Ebu Avane bu (4404.) hadisi Abdülmelik b Umeyr'den rivayet etmiştir.Atıye el-Kurazi şöyle dedi: “Eteğimi açtılar, kıl bitmemiş olduğunu görünce beni esir saydılar.” İzah 4407 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4406,
			"arabicnumber": 4406,
			"text": "İbn Ömer Radıyallahu anhuma'dan rivayet edildiğine göre; O, Uhud savaşı gününde on dört yaşında iken Rasulullah'a arzedildi. Rasulullah ona icazet vermedi. Hendek gününde onbeş yaşında iken arzedildi, izin verdi. Tahric edenler: Buhari, meğazî; şehâdât; Müslim, imara; İbn Mace, hudûd; Ahmed b. Hanbel II, 17. İzah 4407 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4407,
			"arabicnumber": 4407,
			"text": "Nafi şöyle demiştir: Bu (4406.) hadisi Ömer b. Abdi'l-Aziz'e haber verdim \"Şüphesiz bu, küçükle büyük arasındaki sınırdır\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4408,
			"arabicnumber": 4408,
			"text": "Cünâde b. Ebi Ümeyye şöyle demiştir; Büsr b. Ertat ile birlikte denizde (yolculuğunda) idik. Büsr'e Mısdar adında birisi getirildi. Dişi bir deve çalmıştı. Büsr: \"Rasulullah (s.a.v.)'in \"Yolculuk esnasında eller kesilmez\" buyurduğunu işittim. Eğer bunu duymasaydım elini keserdim\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4409,
			"arabicnumber": 4409,
			"text": "Ebû Zer (r.a) şöyle demiştir: Rasulullah (s.a.v.) bana: Ya Ebû Zer'! dedi. Buyur Ya Rasulullah, emret, dedim. \"İnsanlar (topluca) ölüp evin -yani kabrin- bir köle fiatına olduğu zaman ne yaparsın (halin ne olur)?\" buyurdu. Allah ve Rasulü bilir - ya da Allah ve rasûlü (benim için) ne seçerse- dedim.[Şek ravidendir] \"Sabr'a sarıl -veya sabretmeye çalış-\"[Şek ravidendir] buyurdu. Ebu Davud der ki: Hammad b. Süleyman: \"Kefen soyucunun eli kesilir, çünkü o ölünün evine girmiştir\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4410,
			"arabicnumber": 4410,
			"text": "Cabir b. Abdullah (r.a.) şöyle dedi: Rasûhıllah (s.a.v.)'e bir hırsız getirildi. Efendimiz: \"Onu öldürün\" buyurdu. Sahabîler: Ya Rasulullah, o sadece hırsızlık yaptı, dediler. Rasulullah: \"Onun (elini) kesiniz\" buyurdu ve kesildi. Sonra adam ikinci kez getirildi, Rasulullah (s.a.v.) yine: \"Onu öldürünüz\" buyurdu. Oradakiler: Ya Rasulullah o sadece hırsızlık yaptı, dediler. Bunun üzerine efendimiz: \"Onu (n ayağını) kesiniz\" buyurdu ve kesildi. Sonra üçüncü defa getirildi, Rasulullah (s.a.v.) yine: \" Onu öldürünüz\" buyurdu. Sahabeler; \"Ya Rasulullah, o sadece çaldı,\" dediler. Bu sefer efendimiz yine; \"Onu (n sol elini) kesiniz\" buyurdu. Aynı adam dördüncü kez getirildi, Rasulullah (s.a.v.); \"Onu öldürünüz\" buyurdu. Sahabîler: Ya Rasulullah o sadece çaldı, dediler Rasulullah (s.a.v.) \"Onu (n sol ayağını) kesiniz,\" buyurdu. Adam beşinci kez getirildi bu sefer de Rasulullah (s.a.v.) Onu öldürünüz, buyurdu Cabir der ki: Biz adamı götürdük ve öldürdük, sonra sürüyüp bir kuyuya attık ve üzerine taş attık",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4411,
			"arabicnumber": 4411,
			"text": "Abdurrahman b. Muhayrîz şöyle demiştir: Fadale b. Ubeyd'e hırsızın elini boynuna asmanın sünnetten mi olduğunu sorduk; \"Rasûlulîah (s.a.v.)'e bir hırsız getirildi, eli kesildi, sonra Rasulullah'ın emri ile kesik eli boynuna asıldı.\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4412,
			"arabicnumber": 4412,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre: Rasulullah (s.a.v.) şöyle buyurmuştur: \"Köle hırsızlık yaparsa, bir neş (yirmi dirhem) karşılığında bile olsa sat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4413,
			"arabicnumber": 4413,
			"text": "İbn Abbas radiyallanu anhüma; demiştir ki: Allah (C.C): \"Kadınlarınızdan zina edenlere, bunu isbat edecek aranızdan dört şahit getirin, şahitlik ederlerse ölünceye veya Allah onlar için bir yol açıncaya kadar evlerde tutunuz.\"[Nisa 15] ayetinde kadından sonra erkeği zikretti, sonra ikisini birleştirip \"İçinizden zina eden iki kişiye eziyet edin. Eğer tevbe edip düzelirlerse onları bırakın.\"[Nisa 16] bu­yurdu. Allah (c.c) bu ayeti de, Celd ayeti ile neshedip şöyle buyurdu: \"Zina eden kadın ve zina eden erkekten her birine yüz değnek vurunuz.\"[Nur 2]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4414,
			"arabicnumber": 4414,
			"text": "Mücahid demiştir ki; \"(Ayetteki) yol, haddir.\" Süfyan da şöyle dedi: \" O ikisine eziyet edin\" sözünden maksat; bekarlar, \"Evlerde tutun\" .... sözündeki maksat da dul kadındır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4415,
			"arabicnumber": 4415,
			"text": "Ubade b. es-Samit (r.a)'den, demiştir ki; Rasulullah (s,a.); \"Benden öğrenin, benden öğrenin, şüphesiz Allah (c.c) o kadınlar hakkında bir yol açtı. Evlenmiş olan evlenmiş olanla (zina ederse onlara) yüz sopa ve taşlarla recm (cezası vardır); bekar bekarla zina ederse yüz sopa ve bir sene sürgün\" buyurdu. Diğer Tahric edenler: Müslim, hudud 3; Tirmizi, hudud 8; lbn Mace, hudud 7",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4416,
			"arabicnumber": 4416,
			"text": "Bakıyye ve Muhammed b. Sabbah b. Süfyân, Hüseyin'den, O Mansur'dan, Mansûr'da Hasen'den önceki (4415.) hadisi, Yahya'nın isnâd ve manâsıyla rivayet edip; \"Yüz sopa ve recm\" dediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4417,
			"arabicnumber": 4417,
			"text": "Seleme b. el-Muhabbak'tan; Ubâde b. Sâmit (r.a.), Rasulullah sallallahu aleyhi ve sellem'den, bu hadisi rivayet etti. Bunun üzerine insanlar Sa'd b. Ubâde (r.a.)'a; \"Ey Ebâ Sabit ! Şüphesiz hadler indi. Şayet sen, karınla birlikte bir adam bulsan ne yapardın?\" dediler, Said (r.a.); \"Onlar susuncaya (ölünceye) kadar, kılıçla vururdum. ( O durumda) gidip de dört tane şahit mi toplayayım?! O zamana kadar zaten iş biter\" dedi. (Oradakiler) gidip, Rasulullah (s.a.v.)'in yanında toplandılar ve ; \" Ya Rasulullah ! Ebû Sâbit'e baksana ! Şöyle şöyle dedi\" dediler. Rasulullah (s.a.v.): \"Şahit olarak kılınç yeter\" buyurdu, sonradan da; \"Hayır hayır ben o konuda kindarların ve kıskançların aceleyle kötülük yapmalarından korkarım\" dedi. İbn Mâce, hudûd da tahric etti bunu. Ebû Davud der ki: Baş tarafını, Vekî, Fazl b. Delhem'den, O haseriden, Hasen, Kabisa b. Hureys'ten, O da Seleme b. Muhabbık vasıtasıyla Rasulullah (s.a.v.) den rivayet etmiştir. Bu, İbnul-Muhabhık' in isnadı (onda) \"Bir adam, karısının cariyesi ile temasta bulundu\" şeklindedir. Ebû Davud: \"Fail b. Delhem \"Hafız\" değildir. Vâsıf da kasaptı\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4418,
			"arabicnumber": 4418,
			"text": "Abdullah b. Abbas radıyallahu anhuma şöyle demiştir: Ömer (b. el-Hattâb) (r.a) halk'a hitâb edip şöyle dedi: \"Şüphesiz Allah (C.C.) Muhammed (s.a.v.)'i hak ile gönderdi, ona Kitabı indirdi. Recm âyeti ona indirilenler içindedir. Biz onu, okuduk ve ezberledik. Rasulullah (s.a.v.) recmetti, ondan sonra biz de recmettik. İnsanlar üzerinden uzun zaman geçerse, birisinin; biz Allah'ın Kitabında recm âyetini bulamıyoruz, demesinden ve Allah'ın indirdiği bir farzı terketmek suretiyle sapıtmalarından korkarım. Muhsan olduğu ve beyyine ya da hamilelik ve itiraf bulunduğu zaman erkeklerden ve kadınlardan zina edene recm haktır (sabittir). Allah'a yemin ederim ki eğer insanlar, Ömer Allah'ın kitabına ilâvede bulundu, demeyecek olsalardı, recm âyetini yazardım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4419,
			"arabicnumber": 4419,
			"text": "Nuaym b. Hezzâl, babasını (Hezzâl)'ın, şöyle dediğini rivayet etmiştir: Mâ'iz b. Mâlik babamın yanında kalan bir yetimdi. Mahalleden bir Cariyeyle cinsî ilişki kurdu. Babam kendisine: \"Rasulullah (s.a.v.)'e git, yaptığını haber ver. Belki senin için (Allah'tan) bağış diler\" dedi. Bunu, Mâiz için bir çıkış yolu bulunur umuduyla istemişti. Mâiz, Râsûlullah'a gelip: \"Yâ Rasulullah! ben zina ettim. Bana Allah'ın Kitabını (n hükmünü) uygula\" dedi. Rasulullah ondan yüz çevirdi. Mâiz dönüp tekrar; \" Yâ Rasulullah! Ben zina ettim. Bana Allah'ın kitabını (n hükmünü) uygula\" dedi. Rasulullah yine ondan yüz çevirdi. Ama Mâiz tekrar dönüp: \"Yâ Rasûlullah ! Ben zina ettim. Bana Allah'ın Kitabını uygula dedi.\" Nihayet bunu dört kez söyleyince, Rasulullah (s.a.v.): \"Sen bunu dört kez söyledin. Kiminle zina ettin?\" dedi. Mâiz: \" Falan kadınla\" Onunla birlikte yattın mı? -Evet Derin onun derisine değdi mi? -Evet Onunla cinsel ilişkide bulundun mu? -Evet Bunun üzerine Rasulullah (s.a.v.) recmedilmesini emretti. Mâiz, Harre'ye götürüldü. Recmedilip de (recmedilmeye başlanıp da) taşın acısını hissedince sabredemedi, (recmedildiği yerden) çıkıp kaçtı. Arkadaşları yetişemediği halde Abdulah b. Üneys yetişip, bir deve inciği aldı ona atıp Öldürdü. Sonra Rasulullah (s.a.v.)'e geldi ve bunu kendisine haber verdi. Rasulullah (s.a.v.): \"Keşke bıraksaydınız. Belki tevbe ederdi de, Allah tevbesini kabul ederdi\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4420,
			"arabicnumber": 4420,
			"text": "Muhammed b. İshak şöyle demiştir: Asım b. Umer b. Katâde'ye Mâiz b. Mâlik kıssasını haber verdim. O da bana şöyle dedi: Bana Hasen b. Muhammed b. Ali b. Ebû Talib (r.a.) şöyle haber verdi: Rasulullah'ın ; \"Keşke onu bıraksaydınız\" sözünü bana Eslem kabilesinden, hiç itham edemeyeceğim, istediğin (kadar) kişi haber verdi. Ben bu hadisi (sözü veya hadisin tümünü) bilmiyordum. Cabir b. Abdullah'a gidip: \"Şüphesiz, Eşlem kabilesinden bazı adamlar, Rasulullah'a, Mâız'in taşlar değmeye başlayınca sabredemediğini söyleyince efendimizin, kendilerine; \"Onu bıraksaydınız ya!\" dediğini söylüyorlar.Oysa ben bunu bilmiyorum\" dedim. Câbir şöyle dedi:, Ey kardeşimin oğlu! Ben bu hadisi insanların en iyi bileniyim. Ben, o zat'ı recmedenler arasındaydım. Biz onu (Mâiz'i) çıkarıp da recm etmeye başlayınca taşın acısını duydu ve bize: \"Ey kavmim! beni Rasulullah'a geri götüranüz, şüphesiz kavmim beni öldürdü ve beni aldattı. Bana Rasûlullah'ın , beni öldürmeyeceğini haber vermişlerdi\" diye feryâd etti. Ama biz onu olduğu yerden çıkarmadık ve onu öldürdük. Rasulullah (s.a.v.)'e dönüp de, olayı haber verdiğimizde: \"Onu serbest bırakıp da bana getirseydiniz ya !\" buyurdu. Rasulullah bunu, durumu iyice anlamak (tevbe ettirmek) için söyledi. Haddi terketmek için hiç değil. Hasen der ki: (İşte o zaman) Hadisin vechini anladım. Diğer Tahric edenler: Buhari, hudûd; Müslim, hudûd İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4421,
			"arabicnumber": 4421,
			"text": "İbn Abbas radıyallâhu anhumâ; şöyle demiştir: Mâız b. Mâlik, Rasulullah (s.a.v.)'e gelip, zina ettiğini söyledi. Rasûlul­lah (s.a.v.) ondan yüz çevirdi. Mâız defalarca tekrarladı, Rasulullah da (her seferinde) yüz çevirdi. Nihayet, Mâiz'in kavmine O akıl hastası mı? diye sordu. -Hayır o normal, dediler. Bu sefer de Mâız'a: Onu yaptın mı ? dedi., Mâiz : \"Evet\" dedi. Bunun üzerine, onun recmedilmesini emretti. Mâiz götürüldü ve recmedildi. Rasulullah onun namazını kılmadı. İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4422,
			"arabicnumber": 4422,
			"text": "Câbir b. Semure (r.a.) şöyle dedi: Mâiz b. Mâlik'i,Rasulullah (s.a.v.)'e getirildiği zaman gördüm. Kısa boylu, dolgun (iri kaslı) bir adamdı. Üzerinde gömleği yoktu.Zinâ ettiğine dair kendi aleyhine dört kez şahitlik etti. Rasulullah (s.a.v.)' kendisine : \"Herhalde sen onu öptün\" dedi. Mâiz ; “Hayır, Vallahi O alçak zina etti \" dedi.Bunun üzerine Rasulullah onu recmedip (recmettirip) halka hitaben şöyle dedi: \"Dikkat edin !.. Biz Allah azze ve celle yolunda her savaşa gidişimizde, teke melemesi gibi meleyen birisi arkada kalır. Kadınlardan birisine az bir süt verir (ve O kadınla zina eder). Dikkat edin, Eğer Allah onlardan birisini elime düşürürse onu mutlak cezalandırırım.\" Diğer Tahric edenler: Müslim, Hudûd; Dârimi, hudûd; Ahmed b. Hanbel V, 86,87,102,103. İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4423,
			"arabicnumber": 4423,
			"text": "Simâk şöyle demiştir: Bu (4422.) hadisi, Câbir b. Semure'den işittim. Önceki daha mükemmeldir. Câbir; \"Rasulullah (s.a.v.)' Mâiz'i iki kerre geri çevirdi\" dedi. Simak dedi ki: Bunu Said b. Cübeyr'e haber verdim, \"Rasulullah onu dört kerre geri çevirdi\" dedi. İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4424,
			"arabicnumber": 4424,
			"text": "Şû'be şöyle demiştir;Simak'e; \"Küsbe\" nin ne olduğunu sordum. \"Az süt\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4425,
			"arabicnumber": 4425,
			"text": "İbn Abbas (r.anhumâ): şöyle demiştir: Rasulullah (s.a.v.), Mâiz b. Malik'e: \"Senden bana gelen haber gerçek mî?\" diye sordu. Maiz: \"Benden sana ne ulaştı?\" “Bana, senin filân oğullarının cariyesi ile cinsi temasta bulunduğun haberi geldi.\" Mâiz: \"Evet \" dedi ve dört kez şahitlik etti. Bunun üzerine, Rasulullah (s.a.v.) emretti ve Mâız recmedildi. Diğer Tahric edenler: Müslim, hudud; Tirmizi, hudûd İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4426,
			"arabicnumber": 4426,
			"text": "îbn. Abbas (r.anhumâ) şöyle dedi: Mâiz b. Mâlik, Rasulullah (s.a.v.)'e gelip zina ettiğini iki kez itiraf etti. Rasulullah (s.a.v.) onu kovdu. Sonra tekrar gelip iki kez daha itiraf etti. Bunun üzerine Rasulullah (s.a.v.); \"Dört defa aleyhine şahitlik ettin, Onu götürün ve recmedin\" buyurdu. İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4427,
			"arabicnumber": 4427,
			"text": "İbn. Abbas (r.anhumâ) şöyle demiştir: Rasulullah (s.a.v.), Mâız b. Mâlik'e: \"Herhalde sen onu öptün veya dokundun ya da baktın\" dedi. Mâiz \"Hayır\" dedi. Rasulullah (s.a.v.): \"Onunla birleştin mi?\" \"Mâiz:\" \"Evet\" dedi. Bunun üzerine Rasulullah (s.a.v.) Mâiz'in recmedilmesini emretti. (Ravi) Musa; \"İbn Abbas'tan\" demedi. Bu, Vehb'in (rivayet ettiği) lâfızdır. Diğer Tahric edenler: Buharî, hudûd; Ahmed b. Hanbel, I, 280, 289, 325. İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4428,
			"arabicnumber": 4428,
			"text": "Ebû Hureyre (r.a) şöyle demiştir: el-Eslemî (Mâiz b. Mâlik) Rasulullah (s.a.v.)'e gelip, bir kadınla haram ilişkide bulunduğuna dört kez şehadette bulundu. Her seferinde Rasûlullah ondan yüz çeviriyordu. Beşinci seferde ona döndü ve: \"Onunla birleştin mi?\" dedi. Mâiz: Evet Rasulullah (s.a.v.); Sendeki şu (âlet) ondakinde kayboluncaya kadar mı? Evet Mil, sürme kabında ve kova ipi kuyuda kaybolduğu gibi mi? Evet Zinanın ne olduğunu biliyor musun? Evet, insanın hanımı ile helâl olarak yaptığını ben onunla haram olarak yaptım. Bu sözle ne demek istiyorsun? Beni temizlemeni istiyorum. Bunun üzerine Rasulullah emretti ve (Mâiz) recmedildi. Rasulullah (s.a.v.), ashabından iki kişiden birisinin öbürüne; \"şu adama bak! Allah onu gizlemişken nefsi onu bırakmadı da köpek taşlanır gibi taşlandı (recmedildi)\" dediğini duydu. Hiç ses çıkarmadı, sonra bir müddet yürüdü ve ayağını dikmiş bir eşek leşine rastladı. \"Falan ve falan neredeler?\" dedi. Onlar Biziz Yâ Rasulullah! dediler \" İniniz ve şu eşeğin leşinden yeyiniz\" buyurdu. Adamlar: \"Ey Allahirî nebisi! Bundan kim yiyebilir ki?\" dediler. Rasulullah: \"Sizin az önce kardeşinizin ırzına sataşmanız, bunu yemekten daha şiddetlidir. Bana sahip olan (Allah')a yemin ederim ki o şimdi Cennet nehirlerine dalmaktadır\" buyurdu. İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4429,
			"arabicnumber": 4429,
			"text": "Bize Ebû Âsim haber verdi, bize İbn Cüreyc haber verdi, bize Ebû'z-Zübeyr haber verdi. O, Ebû Hureyre'den bu (4428. hadisin) benzerini rivayet etti ve şunu ilâve etti: Bana farklı şeyler söylediler; Bazıları; \"Mâiz ağaca bağlandı\", bazıları da; \"ayakta durduruldu\" dediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4430,
			"arabicnumber": 4430,
			"text": "Câbir b. Abdullah (r.a)'den rivayet edildi ki: Eslem kabilesinden bir adam (Mâiz b. Malik) Rasulullah (s.a.v.)'e gelip zina ettiğini itiraf etti. Rasulullah (s.a.v.) ondan yüz çevirdi. Adam sonra tekrar itiraf etti, Rasulullah (s.a.v.) yine yüz çevirdi. Bu hal, kendisi aleyhine dört defa şahitlik edinceye kadar (sürdü) Nihayet Rasulullah (s.a.v.) ona; \" Sen de bir akıl rahatsızlığı var mı?\" dedi. Adam: \"Hayır\", Rasulullah (s.a.v.): \" Muhsan mısın?\" Adam: \"Evet\" dedi. Bunun üzerine Rasulullah (s.a.v.) emretti ve o zat, musallada recmedildi. Taşlar kendisini acıtınca kaçtı. Ama yakalandı ve ölünceye kadar recme­dildi. Rasulullah (s.a.v.) onun hakkında hayırla konuştu, cenaze namazını kılmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4431,
			"arabicnumber": 4431,
			"text": "Ebû Saîd (r.a) şöyle dedi: Rasulullah (s.a.v.) Mâız b. Mâlik'in recmedilmesini emredince, onu Bakî'a çıkardık, Vallahi onu bağlamadık. O ayakta durdu. Ebû Kâmil'in rivayetine göre Ravî devamla şöyle dedi: Biz ona kemik, toprak tezeği ve tuğla parçaları attık. Bunun üzerine Mâiz kaçtı, biz de peşinden koştuk. Harra'nın yanına varınca karşımızda durdu. Biz de ona, ölünceye kadar Harra'nın kayalarını attık. Rasulullah (s.a.v.) Onun için istiğfarda bulunmadı, hakkında kötü konuşmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4432,
			"arabicnumber": 4432,
			"text": "Ebû Nadra şöyle demiştir: Rasulullah (s.a.v.)'e bir adam geldi. Râvi Önceki (4431.) hadis'in benzerini rivayet etti, ama tamamını değiI. (Sonra) ravi şöyle dedi; Sahabeler onun hakkında kötü konuşmaya başladılar, Rasulullah (s.a.v.) onları nehyetti.O'nun için bağış dilemeye başladılar, onu da nehyetti, ve: \" O günah işleyen bir adamdır. Ona Allah kâfidir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4433,
			"arabicnumber": 4433,
			"text": "İbn Büreyde, babasından şöyle rivayet etmiştir: Rasulullah (s.a.v.)'Mâiz'in ağzını kokladı. Diğer Tahric edenler: Müslim, hudud. Rasulullah Mâiz'in sarhoş olup olmadığını anlamak için ağzını koklamıştır. Kalan İzah 4434 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4434,
			"arabicnumber": 4434,
			"text": "Abdullah b. Büreyde, babasından şöyle dediğini rivayet etti: Biz, Rasulullah'ın sahabeleri, aramızda; \"Ğamidli kadın ve Mâiz eğer itiraflarından sonra dönselerdi- veya itiraflarından sonra Rasûlullah'ın yanına dönmeselerdi- Rasulullah (s.a.v.) onları istemezdi.\"diye konu-şurduk. Onları ancak dördüncü itirafta recmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4435,
			"arabicnumber": 4435,
			"text": "Hâlid b. Leclâc, babası Leclâc'ın şöyle haber verdiğini rivayet etmiştir: O (Leclâc) çarşıda kendi kendine oturduğu yerde çalışıyordu. Kucağında bir çocuk taşıyan bir kadın geçti. (Leclâc der ki): İnsanlar onunla birlikte koşuştular, ben de yürüdüm. Rasulullah (s.a.v.)'in yanına vardım. Rasulullah (s.a.v.): \"Bunun babası kim?\" buyurdu. Kadın sustu (karşılık vermedi). Kadın'ın hizasında duran bir genç; \"Onun babası benim, Yâ Rasulullah!\" dedi. Rasulullah, kadına dönüp; \"Yanındaki bu çocuğun babası kim?\" buyurdu. Genç yine: \"Onun babası benim, Yâ Rasulullah !\" dedi. Rasulullah (s.a.v.) etrafında duran bazılarına baktı. Onlara gencin durumunu soruyordu. Onlar \"Biz onun hakkında hayırdan başka bir şey bilmeyiz\" dediler. Bunun üzerine Hz. Nebi (s.a.v.) gence: \"Muhsan mısın?\" dedi: Genç: \"Evet\" dedi. Rasulullah (s.a.v.) onun recmedilmesini emretti. Genci çıkardık, onun için, bize recm imkânı verecek kadar bir çukur kazdık, sonra hareketsiz kalıncaya (ölünceye) kadar ona taş attık. Recmedilen genci soran bir adam geldi. Onu alıp, Rasulullah'a götürdük ve: \"Bu adam o habisi sormaya geldi\" dedik. Rasulullah (s.a.v.): \"Şüphesiz o Allah katında misk kokusundan daha güzeldir\" buyurdu. Bir de gördük ki, o adam gencin babası imiş. Genci; yıkamakta, kefenlemekte ve defnetmekte adama yardım ettik.\" Râvi diyor ki; \"Namazda\" dedi mi, demedi mi bilmiyorum.\" Bu Abde'nin hadisidir ve bu daha tamdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4436,
			"arabicnumber": 4436,
			"text": "Mesleme b. Abdullah el-Cühenî, Halid b. El-Leclâc'dan, o babası vasıtasıyla Rasulullah (s.a.v.)'den bu (Önceki 4435.) hadisin bir kısmını rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4437,
			"arabicnumber": 4437,
			"text": "Sehl b. Said (r.a)'den şöyle rivayet etmiştir: Bir adam, Rasulullah (s.a.v.)'e gelip, onun yanında, adını vererek bir kadınla zina ettiğini ikrar etti. Rasulullah (s.a.v.) o kadına haber gönderip bunu sordu. Kadın zina ettiğini inkâr etti. Bunun üzerine Rasulullah (s.a.v.) adam'a had (sopa) vurdu, kadını bıraktı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4438,
			"arabicnumber": 4438,
			"text": "Câbir (r.a)'den rivayet edildi ki: Bir adam, bir kadınla zina etti. Rasulullah (s.a.v.) emretti ve adam'a celd haddi uygulandı. Sonra Efendimize onun muhsan olduğu haber verildi. Bunun üzerine Rasulullah (s.a.v.) recmedilmesini emretti. Ebû davud der ki: Bu hadisi Muhammed b. Bekr el-Bursânî, Ibn Cü-reyc'îen Câbir' e mevkuf olarak rivayet etti. Ebû Asım da, İbn Cüreyc'ten Ibn Vehb'in hadisinin benzerini rivayet etti, Rasulullah'ı anmadan; Bir adam zina etti, muhsan olduğu bilinmedi ve celd uygulandı (sopa vurul­du). Sonra muhsan olduğu anlaşıldı ve recmedildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4439,
			"arabicnumber": 4439,
			"text": "Bize Muhammed b. Abdurrahim Ebû Yahya el-Bezzâz haber verdi, bize Ebû Asım, İbn Cüreyc'den, o da Ebû Zübeyr vasıtasıyla. Câbir'den rivayet etti ki: Bir adam, bir kadınla zina etti, onun muhsan olduğu bilinemedi ve celd uygulandı (yüz sopa vuruldu). Sonra onun muhsan olduğu anlaşıldı ve recmedildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4440,
			"arabicnumber": 4440,
			"text": "İmrân b. Husayn (r.a) den rivayet edildi ki: Bir kadın, - Ebân'ın hadisinde denildiğine göre, Cüheyneli bir kadın Rasulullah (s.a.v.)'e gelip, zina ettiğini ve gebe olduğunu söyledi. Rasûlullah (s.a.v.) kadının bir velisini çağırdı ve: \"Ona iyi davran, çocuğunu doğurunca getir\" buyurdu. Kadın çocuğunu doğurunca (velisi onu Rasulullah'a) getirdi. Rasûlullah (s.a.v.) emir buyurdu ve elbisesi üzerine bağlandı. Sonra da efendimizin emri ile recmedildi. Sonra yine emretti ve ashap cenazesini kıldı. Ömer (r.a); Yâ Rasulullah! O zina etmiş olduğu halde, namazını kılıyor musun?!...\" dedi. Rasulullah (s.a.v.): \"Canım elinde olan Allah'a yemin ederim ki, o öyle bir tevbe etti ki, eğer tevbesi Medinelilerden yetmiş kişiye taksim edilse yeterdi. Sen bu kadın'ın canını feda etmesinden daha üstününü buldun mu?\" buyurdu. Ravi Müslim, Ebân'dan olan rivayetde; \"Elbisesi üzerine bağlandı\" demedi. Diğer Tahric edenler: Müslim, hudûd; Tirmizi, hudûd; Nesâi, cenâiz; İbn Mâce, hudûd; Dârimî, hudûd; Ahmed b. Hanbel, IV, 430, 435, 437, 440",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4441,
			"arabicnumber": 4441,
			"text": "Evzâî şöyle demiştir: \"Fe şükket aleyhâ şiyabuhâ\" sözünün manâsı \"elbisesi üzerine bağlandı\" demektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4442,
			"arabicnumber": 4442,
			"text": "Abdullah b. Büreyde, babasın (Büreyde)'dan şöyle rivayet etmiştir: Bir kadın-yâni Gamid'den - Rasulullah (s.a.v.)'e gelip: \"Ben suç işledim (zina ettim)\" dedi. Rasulullah (s.a.v.): \"Dön git,\" buyurdu. Kadın dönüp gitti, Ertesi gün tekrar geldi ve; \"Herhalde sen, Mâiz'i geri çevirdiğin gibi, beni de geri çeviriyorsun, Oysa Vallahi ben gebeyim\" dedi. Rasûîullah (s.a.v.) yine; \"Dön git\" buyurdu. Kadıa ertesi gün tekrar geldi, Efendimiz bu sefer: \"Dön git, onu doğuruncaya kadar (bekle)\" buyurdu. Kadın çocuğu doğurunca, Rasulullah'a gelip; \"işte, onu doğurdum\"dedi. Rasulullah (s.a.v.); \"Git, onu emzir, sütten kesinceye kadar (dur)\" buyurdu. Kadın (bilâhare) çocuğunu sütten kesmiş, çocuk elinde bir şey yer bir vaziyette geldi. Rasulullah (s.a.v.) çocuğun, müslümanlardan birisine verilmesini emretti. Efendimizin emri ile kadın için bir çukur kazıldı ve recmedildi. Hâlid de, kadını recmedenlerdendi.Ona bir taş attı, kadının kanından bir damla şakağına bulaştı. Bunun üzerine ona kötü söz söyledi. Rasûluîlah (s.a.v.) Halid'e: \"Yavaş ol ey Halid ! Canım elinde olan Allah'a yemin ederim ki, o öyle bir tevbe etti ki, eğer halktan haksız yere toplanan vergilere el koyan birisi öyle tevbe etse affedilirdi\" buyurdu. Rasulullah (s.a.v.) emretti; kadının namazı kılındı ve defnedildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4443,
			"arabicnumber": 4443,
			"text": "İmran'ın babası Zekeriyya şöyle dedi : Ebû Bekre'den haber veren bir şeyhten işittim; Ebû Bekre babasından şöyl\". rivayet etmiş: \"Rasûlullah (s.a.v.) bir kadını recmet (tir)miş, o kadın için göğsü (hizasına) kadar çukur kazılmış.\" Ebû Davud der ki:(Bunu ) bana, Osman'dan, bir adam belletti. (Yine Ebû Davud şöyle der: Gassânî: \"Cüheyne, Ğamid ve Bârık aynıdii\"dedi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4444,
			"arabicnumber": 4444,
			"text": "Ebû Davud şöyle dedi: Bina Abdussamed b. Abdil-Vâris'den anlatıldı. Bize Zekeriyyâ b. Süleym. aynı isnâdla yukarıdaki (4443.) hadisin benzerini rivayet etti. Rivayetinde şunu ilâve etti. (Rasulullah); Sonra o kadın'a, nohut gibi taşlar attı! Sonra da: \"atınız, yüzden sakınınız\" dedi, Kadın ölünce de namazını kıldı. Tevbe konusunda da, Bureyde hadisindeki gibi söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4445,
			"arabicnumber": 4445,
			"text": "Ebû Hureyre ve Zeyd b. Halid el-Cüheni (radıyallahu anhûmâ)'dan; şöyle haber vermişlerdir: İki adam, Rasulullah'a dâvalarını getirdiler, (dâvâlaştılar). Birisi: \"Yâ Rasulullah! Aramızda Allah'ın kitabı ile hükmet\" dedi. Öbür hasım: -O ikisinin daha anlayışlısı idi-. \"Evet, yâ Rasulullah! Aramızda Allah'ın Kitabı ile hükmet. Bana da izin ver konuşayım\" dedi. Rasulullah : \"Haydi konuş\" buyurdu. Adam şöyle dedi: \" Oğlum bu adam'ın yanında ücretli (işçi) idi. Karısı ile zina etti. Bana, oğlumun recmedilceğini söylediler. Ben de, yüz koyun ve bir de câriye vererek oğlumu kurtardım. Sonra ilim adamlarına sordum. Onlar, oğluma yüz değnek had ve bir yıl sürgün gerektiğini, sadece onun karısının recmedileceğini söylediler. Resûlullah (s.av); \"Canım elinde olan Allah'a yemin ederim ki, aranızda, Allah'ın Kitabı ile hükmedeceğim. Koyunların ve cariyen sana geri verilecektir\" buyurdu. Adamın oğluna yüz deynek vurdu. Ve bir yıl sürgün etti. Üneys el-Eslemî'ye de, diğerinin karısına gitmesini, eğer itiraf ederse recmetmesini emretti: Kadın îtirâf etti, Üneys de recmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4446,
			"arabicnumber": 4446,
			"text": "İbn. Ömer radıyallâhu anhûmâ şöyle demiştir: Yahudiler Rasulullah (s.a.v.)'e gelip, içlerinden bir erkekle kadın'ın zina ettiğini söylediler. Rasulullah (s.a.v.) kendilerine: \"Zina hakkında Tevrat'ta ne buluyorsunuz?\" dedi. \"Onu teşhir ederiz ve deynekle dövülür\" dediler. Bunun üzerine Abdullah b. Selâm \" Yalan söylediniz. Onda recim var\" dedi. Tevratı getirip, koydular. Yahudilerden birisi, elini recm ayetinin üstüne koydu, sonra onun öncesini ve sonrasını okumaya başladı. Abdullah b. Selâm Ona: \"Elini kaldır\" dedi. Adam elini kaldırdı, recm ayeti görünüverdi. Bunun üzerine Yahudiler: \"Doğru söyledi. Yâ Muhammedi Tevratta recm âyeti var\" dediler. Rasûlullah da onların recmedilmelerini emretti ve recmedildiler. Abdullah b. Ömer: \"Adamı, taşlardan korumak için kadın'ın üzerine abandığını gördüm\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4447,
			"arabicnumber": 4447,
			"text": "Berâ b. Âzib r.a şöyle demiştir: Rasulullah (s.a.v.)'e yüz'ü kömürle karartılmış vaziyette dolaştırılan bir Yahudi getirdiler. Rasulullah (s.a.v.) Yahudilere Allah adı vererek, kitaplarındaki zina haddinin ne olduğunu sordu. Efendimizi, içlerinden birisine havale ettiler. Bu sefer Rasulullah o adama yemin vererek, \"kitabınızda-ki zina haddi nedir?\" diye sordu. Adam: şu karşılığı verdi: \"Recmdir. Ama zina bizim eşrafımız arasında yayıldı. Biz eşrafın bırakılıp da, alt tabakada olana had uygulanmasını çirkin gördük ve bunu (recm cezasını) aramızdan kaldırdık.'1 Bunun üzerine Rasulullah (s.a.v.) emretti ve zinâkâr recmedildi. Efendimiz de: \"Ey Allahım! Ben senin kitabından kaldırdıklarını ilk ihya edenim\" buyurdu. Diğer Tahric edenler: Müslüm. hudûd; İbn Mace. hudûd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4448,
			"arabicnumber": 4448,
			"text": "Berâ b. Âzib (r.a)'den; şöyle demiştir: Rasûlullah (s.a.v.)'e (yüzü) kömürle karartılmış (deynekle dövülmüş) bir Yahudi getirildi. Efendimiz, onları (Yahudileri) çağırıp: \"Zina haddini (kitabınızda) böyle mi buluyor sunuz?\" dedi. \"Evet\" dediler. Rasûlullah. bilginlerinden bir adam çağırıp: \"Tevrat'ı Musa'ya indiren Allah aşkına şöyle, kitabınızda zina haddini (cezasını) böyle mi buluyorsunuz?\" dedi. Adam şu cevabı verdi: \"Vallahi hayır. Eğer sen bunu bana böyle sormuş olmasaydın, haber vermezdim. Biz kitabımızda zina cezası olarak recmi buluyoruz. Ancak zina bizim eşrafımız arasında çoğaldı. Biz eşraftan bir adamı yakaladığımızda bırakıverir, zayıf bir adamı yakaladığımızda ise ona haddi tatbik ederdik. Bunun üzerine gelin, hem zayıflarımız hem de ileri gelenlerimize uygulayacağımız bir şeyde birleşelim dedik ve kömürle boyama ve deynek vurma üzerinde birleştik. Recmi terkettik.\" Rasûlullah (s.a.v.): \"Ey Allahım! Ben, senin emrini kaldırdıklarında ilk ihya edenim\" buyurdu, zinâkârın recmedilmesini emretti ve adam recmedildi. Allah (c.c) de: \"Ey Nebi! Kalpleri inanmamışken ağızlarıyla inandık diyen Yahudilerden yalana kulak verenler ve başka bir topluluk hesâbına casusluk edenlerden inkâra koşanlar seni üzmesin. Sözleri asıl yerlerinden değiştirirler de; böyle bir fetva size verilirse alın, verilmezse, kaçının derler. Allah'ın fitneye düşmesini dilediği kimse için Allah'a karşı senin elinden bir şey gelmez. İşte onlar Allah'ın kalplerini arıtmak istemediği kimselerdir. Dünyada rezillik onlaradır. Onlara âhirette de büyük azâb vardır.\" ayetini, yahûdiler hakkındaki: \"Allah'ın indirdiği ile hükmetmeyenler, kâfirlerin de kendileridir...\" âyetine kadar, yine yahûdiler hakkındaki \"Allah'ın indirdiği ile hükmet­meyenler zâlimlerin ta kendileridir\" ayetine kadar ve aynı şekilde Yahudiler hakkında olan \"Allah'ın indirdiği ile hükmetmeyenler, fâsıklann ta kendileridir\"[Mâide 41-47] ayetine kadar indirdi. Râvi der ki: Bunlar, yani bu ayetler, tüm kâfirler hakkındadır. Diğer tahric: Müslim, hudûd; İbn Mâce. Bu babın ilk hadisinde geçen olay kastedilmektedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4449,
			"arabicnumber": 4449,
			"text": "İbn. Ömer radıyallâhu anhumâ şöyle demiştir: Yahudilerden bir grup gelip Rasûluİlah'i Kuf denilen yere davet ettiler. Rasûlullah okuma evinde onlara geldi. Yahûdiler: \"Ya Ebe'l-Kasım! Bizden bir adam bir kadınla zina etti. (Aralarında) hükmet\" dediler. Rasulullah (s.a.v.) için bir yastık koydular. Efendimiz onun üzerine oturdu, sonra;. \"Bana Tevrat'ı getiriniz\" buyurdu. Tevrat getirildi. Efendimiz, altındaki yastığı aldı ve üzerine tevrâtı koydu. Sonra: \"Sana ve seni indirene imân ettim\" dedi. Daha sonra: \"En bilgininizi getirin\" buyurdu. Bir genç getirildi. Ravi sonra, recm hâdisesini; Mâlik'in Nâfi'den rivayet ettiği gibi zikretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4450,
			"arabicnumber": 4450,
			"text": "Ebû Hureyre (r.a) -Bu Ma'mer'in hadisidir ve daha tamdır- şöyle demiştir. Yahudilerden bir adamla bir kadın zina ettiler. Birbirlerine: \"Şu Nebi'e gidelim. Şüphesiz o hafifletmek üzere gönderilen bir nebidir. Eğer bize recimden başka bir fetva verirse kabul ederiz. Onunla Allah katında ihticâc eder ve senin Nebilerinden birisinin fetvası, deriz\" dediler. Rasulullah (s.a.v.) mescidde sahabeleri arasında otururken geldiler, ve: \"Ya Ebe'l-Kasım! Zina eden erkek ve kadın hakkında ne dersin?\" dediler. Rasulullah onların okuma evine gelinceye kadar, kendileri ile bir kelime konuşmadı. (Oraya gelince) kapının yanında durdu: \"Size, Tevratı indiren Allah adı ile soruyorum. Zina eden birisi muhsan olduğu zaınan, onun hakkında Tevratta ne ceza buluyorsunuz?\" dedi. \"Yüzü kömürle boyanır, tecbih edilir ve deynekle dövülür.\" dediler. Tecbih: Zina edenlerin sırt sırta gelecek şekilde bir eşeğe bindirilip, dolaştırılmalarıdır. Ama onlardan bir genç sustu. Rasulullah (s.a.v.) onun sustuğunu görünce ona yemin vermekte ısrar etti. Genç: \"Sen bize yemin verdiğin için söylüyorum: Biz Tevrat'ta recmi buluyoruz\" dedi. Rasulullah (s.a.v.): \"Âliah'ın emrini yumuşatıp kolaylaştırdığınız ilk olay nedir?\" dedi. Genç: \"Kırallanmızdan birisinin bir akrabası zina etti. Kıral onu recmetmeyi geciktirdi. Sonra, halktan bir aileden birisi zina etti, onu recmetmek istedi. Bunun üzerine tebaası karşısına dikildi ve \"Senin akraban getirilip de recmedilmedikçe bizim arkadaşımız recmedileniez\" dediler. Neticede, aralarında bu ceza üzerinde anlaştılar, dedi. Rasulullah (s.a.v.): \"Şüphesiz ben, Tevrattaki ile hükmedeceğim\" buyurdu, recmedilmelerini emretti ve recmedüdiler. (Ravilerden) Zühri şöyle dedi: \"Şüphesiz biz, yol gösterici ve nur olarak Tevrâtı indirdik. Kendisini Allah'a teslim eden Nebiler onunla hükmeder.....\"[Mâide 44] ayetinin bu yahudiler hakkında indiği haberi bize ulaştı. Rasulullah (s.a.v.) de (onunla hükmeden) Nebilerdendir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4451,
			"arabicnumber": 4451,
			"text": "Ebû Hureyre (r.a) şöyle demiştir: Rasulullah (s.a.v.), Medine'ye geldiğinde, Yahudilerden, muhsan olan bir erkekle bir kadın zina ettiler. Tevrat'ta onlara recm emredilmişti. Onu terkettiler ve eşeğe ters bindirme cezasını koydular, zina edene, kara sakızla boyanmış bir iple yüz kez vurulur ve yüzü eşeğin arkasına gelecek şekilde eşeğe bindirilirdi. Yahudilerin bilginlerinden bazıları toplanıp, başka bir gurubu Rasûlullah'a gönderdiler \"Ona zina haddini sorun...\" dediler. Ravî (Ebû Hureyre) hadisin devamını zikretti ve \"Onlar, Rasulullah'ın dinine mensup değildiler ki onlar arasında hükmetsin. Onun için Rasûlullah muhayyer bırakıldı.\" dedi. Cenâb-ı Allah şöyle buyurdu: \"Eğer sana gelirlerse, ister aralarında hükmet, ister onlardan yüz çevir.\"[Mâide 42]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4452,
			"arabicnumber": 4452,
			"text": "Câbir b. Abdullah (r.a)'den; şöyle dedi: Yahudiler, kendilerinden zina eden bir erkekle bir kadın getirdiler. Rasûlullah (s.a.v.): \"Sizden, en bilgin iki adam getirin\" buyurdu. Sûrîyâ'nın iki oğlunu getirdiler. Rasulullah onlara yemin vererek: \"Bu ikisinin işini Tevratta nasıl bulursunuz?\" diye sordu. \"Tevratta şöyledir: Dört kişi, erkeğin âletini - Sürmelikteki mil gibi kadının âleti içinde gördüklerine şahitlik ederlerse kadın da erkek de recmedilir\" dediler. Rasulullah (s.a.v.): \"Onları recmetmenize engel olan ne?\" dedi. \"Hakimiyet ve gücümüz gitti. O yüzden öldürmeyi hoş görînedik\" dediler. Rasulullah (s.a.v.) şahitleri çağırdı. Dört tane şahit getirdiler. Onlar adam'ın âletini - sürmelikteki mil gibi - kadının âleti içinde gördüklerine şahitlik ettiler. Rasulullah (s.a.v.) de, zinakârların recmedilmelerini emretti. Sened: îsnadda mechûl bir adam var",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4453,
			"arabicnumber": 4453,
			"text": "Bize Vehb. b. Bakiyye haber verdi, o Hüşeym'den, Hüşeym Muğire'den o da İbrahim ve Şa'bî vasıtasıyla Rasulullah'tan yukarıdaki (4452.) hadisin benzerini rivayet etti. \"Rasulullah şahitleri çağırdı, şahitlik ettiler...\" sözünü zikretmedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4454,
			"arabicnumber": 4454,
			"text": "Bize. Hüşeym'den, Vehb b. Bakıyye rivayet etti. Hüşeym, İbn. Şiibıüme'den, O Şa'bî'den, Şa'bi de Rasulullah.'tan önceki (4453.) hadisin benzerini rivayet etti. 4453 4454 mürseldir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4455,
			"arabicnumber": 4455,
			"text": "Bize İbn Cüreyc haber verdi; O, Ebu'z Zübeyr'den işitmiş. Ebu'z-Ziibeyr'de Câbir b. Abdullah'dan, şöyle derken işitmiş: \"Rasûlullah (s.a.v.) Yahudilerden, zina eden bir erkekle bir kadını recmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4456,
			"arabicnumber": 4456,
			"text": "Berâ b. Azib (r.a) şöyle demiştir: Kaybolan bir kölemi ararken, yanlarında bayrak olan atlı bir (bedevi) toplulukla karşılaştım. Bedeviler, Rasulullah'ın yanındaki mevkiimden dolayı etrafımı kuşatmaya başladılar. Derken bir kubbeye (kubbe şeklindeki bir çadıra) geldiler. Oradan bir adam çıkarıp, boynunu vurdular. Onun sebebini sordum. \"Babasının karısı ile nikahlandı\" dediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4457,
			"arabicnumber": 4457,
			"text": "Yezid b. el-Berâ, babasının şöyle dediğini rivayet etmiştir. Amcamla karşılaştım. Beraberinde bir bayrak vardı. Ona: \" Nereye gidiyorsun?\" dedim. \"Rasulullah (s.a.v.) beni, babasının karısı ile nikahlanan bir adama gönderdi. Bana, onun boynunu vurmamı ve malını almamı emretti.\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4458,
			"arabicnumber": 4458,
			"text": "Hubeyb b. Salim şöyle demiştir: Abdurrahman b. Huneyn adında bir adam, karısının cariyesi ile cinsel ilişkide bulundu. Hadise, Kufe Emiri olan Nûmân b. Beşir (r.a)'a götürüldü.Nûman: \"Senin hakkında, Rasulullah (s.a.v.)'in hükmü ile hükmedeceğim; Eğer karın o cariyeyi sana helâl kılmışsa sana yüz değnek vuracağım, Onu sana helal kılmamışsa (izin vermemişse) taşlarla recmedeceğim\" dedi. Kadın'ın kocasına izin verdiğini öğrendiler. Bunun üzerine adama yüz deynek vurdu. Katâde der ki: \"Bu mes'eleyi Hubeyb b. Sâlim'e yazdım, o da bana böyle yazdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4459,
			"arabicnumber": 4459,
			"text": "Nu’man b. Beşir (r.a), karısının cariyesi ile cinsi ilişkide bulunan kişi hakkında Rasulullah (s.a.v.)'in şöyle buyurduğunu haber vermiştir: \"Eğer karısı, cariyesini kocasına helâl etmişse (onunla cinsî ilişkide bulunmasına izin vermişse) yüz değnek vurulur. Helâl etmemişse recmederim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4460,
			"arabicnumber": 4460,
			"text": "Seleme b. el-Muhabbak'tan rivayet edildiğine göre; Rasulullah (s.a.v.), karısının cariyesi ile cinsî ilişki kuran kişi hakkında şöyle hüküm vermiştir: Eğer adam cariyeyi zorlamışsa, câriye hürdür. Adam, cariyenin sahibine (karısına) o câriye'nin mislini borçlanmış olur. Eğer câriye gönüllü ise, câriye adam'ın olur, sahibine onun mislini öder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4461,
			"arabicnumber": 4461,
			"text": "Hasen, Seleme b. el-Muhabbak'tan, O da Rasûluilah (s.a.v.)'den önceki (4460.) hadisin benzerini rivayet etmiştir. Ancak, bu rivayete göre Rasûlullah: \"Eğer kadın gönüllü ise, hem cariye hem de adam'ın malından, onun misli, cariyenin sahibine (kadına) verilir\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4462,
			"arabicnumber": 4462,
			"text": "İbn Abbas radıyallahu anhuma'dan; Rasulullah Salallahu aleyhi ve sellemin şöyle buyurduğu rivayet edilmiştir: \"Lût kavminin yaptığını yapan birisini bulursanız (bilirseniz), yapanı da yapılanı da öldürünüz.\" Ebû Davud der ki: \"Bu hadîsin benzerini, Süleyman b. Bilâl, Amr b. Ebî Amr'den rivayet etmiştir. Abbad b. Mansûr da, İkrime vasıtasıyla İbn Abbas'tan merfu’ olarak rivayet etmiştir. Ayrıca, İbn Cüreyc, ibrahim'den, ibrahim, Davud b. el-Husayn'dan. o İkrime'den, İkrime de ibn Abbas'tan, merfu’ olarak rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4463,
			"arabicnumber": 4463,
			"text": "Said b. Cübeyr ve Mücahid, İbn Abbas radıyallahu anhumâdan; Livâta ederken yakalanan bekâr hakkında: \"Recmedilir\" dediğini rivayet etmişlerdir. Ebû Davud şöyle dedi: \"Asımın hadîsi, Amr b. Ebî Amfin hadîsini zayıflatıyor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4464,
			"arabicnumber": 4464,
			"text": "İbn Abbas (radıyallâhu anhûmâ)'dan rivayet edildiğine göre; Rasulullah (s.a.v.) şöyle buyurmuştur: \"Bir kimse, bir hayvana cinsel temasda bulunursa, hem o adamı hem de hayvanı öldürünüz\" (Râvî) İklime der ki: İbn Abbas'a: \"Hayvanın suçu ne?\" dedim. \"Zannediyorum, Rasulullah bunu ancak kendisine böyle bir şey yapılmışken o hayvanın etinin yenilmesini kerih gördüğü için söylemiştir.\" dedi. Ebu Davud; \"Bu hadis kuvvetli değildir\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4465,
			"arabicnumber": 4465,
			"text": "İbn Abbas (r.â.) şöyle demiştir: \"Hayvana ilişkide bulunana had yoktur.\" Ebu Davud der ki: Ata da böyle dedi. Hakem: \"Onun değnekle dövülmesini ama bunun had miktarına varmamasını uygun bulurum\" dedi. Hasen ise \"O zina menzil e sindedir\" demiştir. Ebu Davud: \"Âsim in hadisi, Amr b. Amr'ın hadisini zayıflatmakta­dır\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4466,
			"arabicnumber": 4466,
			"text": "Sehl b. Sa'd (r.a) demiştir ki: Bîr adam Rasûlııllah (s.a.v.)'e gelip huzurunda adını vererek bir kadınla zina ettiğini ikrar etti. Rasulullah (s.a.v.) kadına birisini gönderip, bunu sordu. Kadın zina ettiğini inkâr etti. Bunun üzerine Rasulullah (s.a.v.) adam'a celd haddini uyguladı (yüz değnek vurdurdu), kadını bıraktı. İzah 4467 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4467,
			"arabicnumber": 4467,
			"text": "İbn Abbas (radıyallahu anhüma)'dan rivayet edildi ki: Bekr b. Leys'den,bir adam Rasulullah (s.a.v.)'e gelip bir kadınla zina ettiğini dört kez ikrar etti. Rasulullah ona yüz değnek vurdu. (Çünkü) adam bekârdı. Sonra kadın aleyhine beyyine istedi. (Adam getiremedi) Kadın: \"Vallahi yalan söyledi, ya Rasulullah\" dedi. Bunun üzerine Rasulullah (s.a.v.) adama kazf cezası olarak da seksen değnek vurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4468,
			"arabicnumber": 4468,
			"text": "Abdullah (b. Mes'ud r.a) şöyle demiştir: Bir adam Nebî (s.a.v.)'e gelerek şöyle dedi: \"Ya Rasulullah ben Medine'nin kenarında bir kadınla oynaştım. Ona cinsi temastan başka herşeyi yaptım. İşte ben huzurundayım. Bana dilediğin haddi uygula, dedi. Hz. Ömer (r.a) \"Allah seni (n suçunu) gizledi. Sen de gizleseydin (iyi olurdu)\" dedi. Rasulullah (s.a.v.) hiç bir cevap vermedi. Adam gitti. Rasulullah (s.a.v.) peşinden bir adam gönderip onu (geri) çağırdı ve şu ayet-i kerimeyi okudu: \"Gündüzün iki tarafında ve gecenin gündüze yakın saatlerinde namazı kıl....\" [Hud 114] Halktan birisi: \"Ya Rasulullah bu sadece onun için midir? Yoksa tüm insanlar için midir?\" dedi. Rasulullah (s.a.v.): \"Tüm insanlar için\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4469,
			"arabicnumber": 4469,
			"text": "Ebu Hureyre ve Zeyd b. Halid el-Cühenî (r.a) dan rivayet edildi ki: Rasulullah (s.a.v.)'e muhsan olmayan bir cariye zina etse hükmünün ne olduğu soruldu. Rasulullah (s.a.v.): \"Eğer zina ederse (celd) değnek vurunuz, sonra tekrar zina ederse yine değnek vurunuz, Sonra tekrar zina ederse bir ip mukabilinde bile olsa onu satınız\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4470,
			"arabicnumber": 4470,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre: Rasulullah (s.a.v.) şöyle buyurdu: \"Birinizin cariyesi zina ederse, ona had uygulasın, hakaret edip başa kakmasın. Rasulullah (s.a.v.) bunu üç kez tekrarladı, eğer dördüncü defa yine tekrarlarsa kıl bir ip mukabilinde bile olsa onu satsın.\" Diğer Tahric edenler: Müslim hudud; İbn Mace; Ahmed b. Hanbel II, 376",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4471,
			"arabicnumber": 4471,
			"text": "İbn Nufeyl Muhammed b. Seleme, Muhammed b. İshak, Said b. Ebi Said el-Makburî ve onun babası kanalıyla bu (önceki 4470.) hadisi Ebu Hureyre'den rivayet etti. Buna göre (Rasulullah) Her seferinde: \"Ona sopa vursun. (Bu) Allah'ın Kitabıdır (farz kıldığı hükümdür). Ona hakaret etmesin.\" Dördüncüsüne de: \"Tekrar yaparsa ona sopa vursun. (Bu) Allah'ın Kitabıdır (farz kıldığı hükümdür); sonra da kıldan yapılmış bir ip karşılığında bile olsa satsın\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4472,
			"arabicnumber": 4472,
			"text": "Ebu Ümame b. Seni b. Huneyf Ensar'dan Rasulullah'ın bir sahabisinden şöyle rivayet etmiştir: Ensardan bir adam hastalandı, öyle ki bitkin düşüp bir deri bir kemik haline geldi. Ensardan birisinin cariyesi adamın yanına girdi; adam onu arzulayıp cinsel ilişki kurdu. Kavminden bazı adamlar ziyaret için yanına girdiklerinde olup biteni onlara anlattı ve: \"Ben yanıma giren bir cariye ile ilişki kurdum. Benim için Rasulullah (s.a.v.)'e bunun hükmünü bir soruverin\" dedi. Adamlar bunu Rasulullah'a haber verdiler ve: \"İnsanlardan onun kadar sıkıntıda olan birini görmedik. Eğer onu yüklenip sana getirseydik kemikleri dökülürdü. O sadece bir deri bir kemik\" dediler. Bunun üzerine Hz. Nebi (s.a.v.) yüz tane hurma salkımı sapı almalarını ve ona bir defa vurmalarını emretti. İzah 4473 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4473,
			"arabicnumber": 4473,
			"text": "Ali (r.a) demiştir ki: Rasulullah'ın ailesine ait bir cariye zina etmişti. Rasulullah (s.a.v.): \"Ya Ali git ona haddi tatbik et\" buyurdu. Gittim bir de ne göreyim! Kadından devamlı kan gidiyor. Rasulullah'a geldim. Efendimiz: \"İşi bitirdin mi ya Ali?\" dedi. \"Kadına gittim, kendisinden kan gidiyordu\" dedim. Rasulullah (s.a.v.): \"Onu kanı kesilinceye kadar bırak, sonra haddi uygula. Sahibi olduğunuz kölelere (ve cariyelere) hadleri uygulayınız\" buyurdu. Ebıı Davûd şöyle dedi: Ebu l-Ahvas da Adü'l - A'la1 dan aynen bu şe­kilde rivayet eni. Şu'be, Abdu'Vdan rivayet edip şöyle dedi: Rasulullah: \"Doğuruncaya kadar ona vurma\" buyurdu. Ancak birincisi daha sahihtir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4474,
			"arabicnumber": 4474,
			"text": "Âişe radıyallahu anha'dan şöyle demiştir: \"Özrüme (suçsuzluğuma dair âyetler) inince, Rasulullah (s.a.v.) minbere çıktı ve bunu (masumiyetimi) anlattı, Kur'ân'ı (suçsuzluğum ile ilgili âyetleri) okudu. Minberden inince iki adam ve bir kadın hakkında emir buyurdu, hadleri vuruldu. Diğer Tahric edenler: Tirmizi, tefsir; İbn Mace. hudud; Ahmed b. Hanbel, VI, 30,35",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4475,
			"arabicnumber": 4475,
			"text": "Bize Nufeyli anlattı. Muhammed b. Seleme, Muhammed b. Ishak'tan rivayet etti. Muhammed b. îshak, Âişe'yi zikretmeden şöyle dedi: Rasulullah (s.a.v.) iki adam ve bir kadına kazf haddi uygulanmasını emretti. Hassan b. Sabit ve Mistah b. Üsâse o kötü sözleri konuşanlardandırlar. Nüfeylî: \"O kadının da Hamne bint Cahş olduğunu söylüyorlar\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4476,
			"arabicnumber": 4476,
			"text": "İbn Abbas (radıyallahu anhüma) dan rivayet edildiğine göre; Rasulullah (s.a.v.) şarap içen için (belirli sayıda) bir had tayin etmedi. İbn Abbas şöyle dedi: \"Bir adam içki içip sarhoş oldu. Yolda yalpa yaparken görüldü. Rasûlullah (s.a.v.)'e götürülmek üzere yakalandı. Abbas'ın evinin hizasına gelince ellerinden kurtuldu. Abbas'ın yanına girip, ona sığındı. Bu, Rasulullah'a anlatıldı. Rasulullah (s.a.v.) güldü ve \"Demek öyle yaptı?\" buyurdu. Onun hakkında bir şey (ceza) emretmedi. Ebu Davud şöyle der: \"Hasen b. Ali'nin bu hadisi, sadece Medine'illerin rivayet ettikleri hadislerdendir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4477,
			"arabicnumber": 4477,
			"text": "Ebu Hureyre (r.a) şöyle demiştir: Rasulullah (Sallallahu aleyhi ve Sellem)'e içki içmiş olan bir adam getirildi. Rasulullah (Sallallahu aleyhi ve Sellem): \"Ona vurunuz\" buyurdu. Ebu Hureyre (r.a) der ki: “Bizden kimi eli, kimi ayakkabısı, kimi de elbisesi ile vurdu. Ayrılınca (dövme işi bitince) topluluktan birisi: \"Allah seni rezil rüsvay etsin\" dedi. Bunun üzerine Rasulullah (Sallallahu aleyhi ve Sellem): \"Öyle demeyiniz, ona karşı şeytana yardım etmeyiniz\" buyurdu. Diğer Tahric edenler: Buhari, hudud; Ahmed, b. Hanbel, II, 300, 350",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4478,
			"arabicnumber": 4478,
			"text": "Bize Muhammed b. Davud b. Ebi Naciye el- İskenderanî haber verdi, bize İbn Vehb haber verdi. Ona Yahya b. Eyyub, Hayve b. Şüreyh ve İbn Lehîa, İbnü'l- Hadi'den önceki (4477.) hadisi aynı isnad ve ma'na ile rivayet edip, dövme olayını anlattıktan sonra şöyle dedi: Sonra Rasulullah (s.a.v.) ashabına: \"Onu kınayınız\" buyurdu. Sahabelerde : \"Allah'tan çekinmedin mi?, Allah'tan korkmadm mı? Rasulullah'tan utanmadın mı?\" diyerek ona yöneldiler, sonra salıverdiler. Ravi rivayetin sonunda (Rasulullah'ın şöyle dediğini) söyledi: \"Allah'ım onu bağışla! Allah'ım ona merhamet et\" deyiniz.\" Bazı raviler bu (Allah'ın onu bağışla) sözü ve benzerini ilave ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4479,
			"arabicnumber": 4479,
			"text": "Enes b. Malik (r.a) den şöyle rivayet edilmiştir: Rasûlulîah (s.a.v.) içki içmekten dolayı hurma dalı ve ayakkabılarla dövdü. Ebu Bekir (r.a) kırk değnek vurdu. Ömer (r.a) idareye gelince halkı davet etti ve onlara: \"Şüphesiz insanlar bitek arazilere yaklaştılar; - Müsedded; köylere ve bitek arazilere, der- içki haddi konusunda ne düşünürsünüz?\" diye sordu. Abdurrahman b. Avf: \"Onu, hadlerin en hafifi gibi yapmanı uygun buluruz\" dedi. Hz. Ömer de içki haddi olarak seksen değnek vurdu. Ebu Davud der ki: Bu hadisi İbn Ebi Arûbe Katade'den, o da Rasulullah (s.a.v.)'den rivayet etti. Bu rivayete göre; Rasulullah (\"s,a) yaprağı soyulmuş hurma dalı ve (ayakkabılarla) kırk (kez) vurmuştur. Şu'be ise bunu Katade'den o da Enes (r.a) vasıtasıyla Rasulullah'tan rivayet etti. Enes şöyle dedi: \"Rasulullah iki hurma dalı ile kırk tane kadar vurdu.\" Diğer tahric edenler: Müslim, hudud; İbn Mace, hudud, Ahmed b. Hanbel, III, 115, 180",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4480,
			"arabicnumber": 4480,
			"text": "Hudayn b. el-Münzir er- Rakâşî, - Sasan'in babasıdır - şöyle demiştir: Osman b. Affan (r.a)'ın yanında idim. Velid b. Ukba getirildi. Humran ve başka bir adam onun aleyhinde şahidîik ettiler. Birisi onu şarap içerken, Öteki de onu (şarabı) kusarken gördüğünü söyledi. Osman (r.a); Eğer o şarabı içmeseydi kusmazdı, dedi. Hz. Ali (r.a)'ye: Ona haddi uygula, dedi. Ali de (oğlu) Hasen'e: Ona haddi uygula, dedi. Hasen (r.a): Onun (hilafetin) cefasını, sefasını sürene yükle, dedi. Bunun üzerine Hz. Ali (r.a) Abdullah b. Cafer'e: Ona haddi uygula, dedi. Abdullah kamçıyı alıp vurdu. Ali sayıyordu. Kamçı sayısı kırka varınca Ali: \"Yeter, Rasulullah (s.a.v.) kırk sopa vurdu\" dedi. Ravi diyor ki: \"Zannediyorum Ali şöyle dedi: \"Ebu Bekir de kırk değnek vurdu, Ömer ise seksen değnek vurdu. Bunların hepsi sünnettir. Ama bence bu (kırk) daha iyidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4481,
			"arabicnumber": 4481,
			"text": "Ali (r.a) şöyle demiştir: İçki (haddin)'de Rasulullah (s.a.v.) ve Ebu Bekir (r.a) kırk değnek vurdular. Ömer ise bunu seksene çıkardı. Bunların hepsi sünnettir. Ebu Davud der ki: Esmaî: \"Velli hârrahâ men tevellâ kaarrahâ\"[323] Cümlesinin manası, onun (ha­lifeliğin) sıkıntısını, nimetlerine nail olana yükle, demektir.\" der. Ebu Davûd şöyle demiştir: \"Hudayn h. Münıir Ebu Sasan[324] kavminin seyyididîr",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4482,
			"arabicnumber": 4482,
			"text": "Muaviye b. Ebi Süfyan (r.a.) demiştir ki: Rasûlullah (s.a.v.): \"İçki içtikleri zaman onlara dayak atınız. Sonra yine içerlerse dövünüz, sonra tekrar içerlerse, yine dövünüz, sonra yine içerlerse öldürünüz.\" buyurdu. Diğer tahric edenler: Tirmizi, hudud; îbn Mace, hudud; Nesai, eşribe",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4483,
			"arabicnumber": 4483,
			"text": "Nafi, İbn Ömer radıyallahü anh vasıtasıyla Rasûlullah (s.a.v.)'den bu (önceki 4482.) hadisi manası ile rivayet etmiştir. Ravi (bu rivayette) şöyle demiştir: Zannediyorum, (şeyhim) beşincisinde: \"Eğer (yine) içerse onu öldürünüz\" buyurdu. Ebu Dayud der ki: \"Ebu Gutayfın hadisinde de; \"beşincisinde\" şeklindedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4484,
			"arabicnumber": 4484,
			"text": "Ebu Hureyre (r.a)'den, Rasulullah (s.a.v.)'in şöyle buyurduğu rivayet edilmiştir: \"(Bir kimse) sarhoş olduğu zaman ona dayak atınız, sonra (yine) sarhoş olursa (yine) dayak atınız, sonra sarhoş olursa yine dövünüz, dördüncü defa tekrarlarsa onu öldürünüz.\" Ebu Davud şöyle demiştir: \"Ömer b. Ehi Seleme nin babasından, onun da Ebu hureyre (r.a) va­sıtasıyla Rasulullah (s.a.v.) 'den rivayet ettiği hadis te aynıdır. (Bu rivayet­te) Rasulullah söyle buyurmuştur: \"Şarap içtiği zaman ona dayak atınız. Dördüncü kez tekrarlarsa öldürünüz\" Yine Ebu Davud şöyle der: Süheyl'in Ebu Salih'ten onun da Ebu Hureyre vasıtasıyla Rasulullah i s.a)'den rivayeti aynı şekilde şöyledir: \"Dördüncü defa içerlerse onları öldürünüz-\" ibn Ebi Num'un ibn Ömer vasıtasıyla Rasulullah'tan, Abdullah b, Amr'ın Rasulullah (s.a.v.) den ve Şeıid'in Rasulullah'tan rivayet ettikleri hadisler de aynıdır. el-Cedelî (Abd b. Abdi'nin Muaviye vasıtasıyla Rasulullah (s.a.v.) 'den rivayet ettiği hadiste ise Efendimiz: \"Üçüncü veya dördüncüde tekrarlarsa onu öldürünüz\" buyurdu. Diğer tahric edenler: İbn Mace, hudud; Nesai. eşribe",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4485,
			"arabicnumber": 4485,
			"text": "Kabîsa b. Züeyb (r.a.)'den rivayet edildi ki: Rasulullah (s.a.v.): \"Bir kimse şarap İçerse ona dayak atınız, tekrarlarsa yine dayak atınız. Yine tekrarlarsa üçüncüsünde veya dördüncüsünde onu öldürünüz\" buyurdu. Rasulullah'a içki içmiş olan bir adam getirildi, ona dayak attı, sonra (yine) getirildi, yine dayak attı. Sonra (tekrar) getirildi, (tekrar) dayak attı. Sonra (tekrar) getirildi, yine dayak attı öldürmedi, (bu) bir ruhsattı. Süfyan şöyle dedi: \"Zühri bu hadisi, yanında Mahsur b. el-Mu'temir ve Muhavvel b. Raşid varken rivayet etti ve onlara: \"Bu hadis ile Iraklıların elçileri olunuz. dedi. Ehu Davud şöyle demiştir: Bu hadisi Şenel b. Süveyd, Şiirahbil b. Evs, Abdullah b. Amr, Abdullah b. Ömer, Ebu Gutayf el Kindi ve Ebıt Seleme b. Ahdurrahman, Ebu Hureyre (r.a)'den rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4486,
			"arabicnumber": 4486,
			"text": "Ali b. Ebi Talib (r.a) şöyle demiştir: Ben, içki içenden başka kendisine had vurduğum (dan ötürü ölen) hiç kimse için fidye vermem. (Çünkü) Rasülullah (s.a.v.) onun (içkinin) hakkında (belli) bir şey bırakmadı. O had (din miktarı) bizim koyduğumuz bir şeydir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4487,
			"arabicnumber": 4487,
			"text": "Abdurrahman b. Ezher (r.a) şöyle demiştir; \"Sanki ben şu anda Rasulullah (s.a.v.)'e bakar gibiyim; O, evler arasında Halid b. Velid'in evini aramaktaydı. Rasulullah (s.a.v.)'e bu vaziyette iken şarap içmiş olan bir adam getirildi. Efendimiz insanlara: \"Ona dayak atınız\" buyurdu, bunun üzerine onlardan kimi ayakka­bılarla, kimi sopa ile kimi de mîteha (hurma dalı) ile vurdu -İbn Vehb: O şey hurma dalıdır, dedi-. Sonra Rasulullah (s.a.v.) yerden toprak alıp adam'ın yüzüne attı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4488,
			"arabicnumber": 4488,
			"text": "Abdullah b. Abdurrahman b. el-Ezher babasının şöyle dediğini haber vermiştir: Rasulullah (s.a.v.) Huneyn'de iken kendisine şarap içmiş olan birisi getirildi. Efendimiz adam'ın yüzüne toprak serpti. Sonra ashabına (ona vurmalarını) emretti. Sahabeler adama ayakkabıları ile ve ellerinde olan şeylerle vurdular. Nihayet Rasulullah onlara \"yeter\" dedi, onlar da bıraktılar. Rasulullah (s.a.v.) vefat etti, sonra Ebu Bekir (r.a) şaraptan dolayı kırk değnek vurdu. Hilafetinin ilk döneminde Hz. Ömer (r.a)'de kırk değnek vurdu. Hilafetinin sonunda ise seksen değnek vurdu. Osman (r.a) her iki haddi de; hem kırk hem de seksen değnek vurdu. Nihayet Muaviye içki K-.ıHHini Sftksftn nhınık temhir otıi haddini seksen olarak tesbit etli",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4489,
			"arabicnumber": 4489,
			"text": "Abdurrahman b. Ezher (r.a) şöyle dedi: Mekke fethinin ertesi günü Rasulullah (s.a.v.)'i insanlar arasında dolaşıp Halid b. Velid\"in evini sorarken gördüm. O esnada ben bir delikanlı idim. Rasulullah (s.a.v.)'e içki içmiş olan birisi getirildi. Efendimiz sahabelere (ona dayak atmalarını) emretti. Onlar da ellerinde olan şeylerle vurdular; kimisi kamçı ile kimisi sopa ile kimisi de ayakkabısı ile vurdu. Rasûlullah (s.a.v.) de adama toprak serpti. Ebu Bekir halife olunca, kendisine içki içen birisi getirildi. Ebu Bekir (r.a) sahabelere, Rasulullah'ın içki içene vurduğu haddi sordu. Onu kırk değnek diye zabt (muhafaza) ettiler. Ebu Bekir de kırk değnek vurdu. Ömer halife olunca Halid b. Velid kendisine, insanların içki içmeye düşkünlük gösterdiklerini, haddi ve cezayı küçümsediklerini yazıp; \"(Sahabeler) Senin yanında - ilk muhacirler Hz. Ömer'in yanında idiler - onlara sor\" dedi. Ömer de onlarla istişare etti. Seksen değnek vurması için icma' eltiler. Ali (r.a) \"İnsan içliği zaman iftira eder. Onu iftira (kazf) haddi gibi takdir etmeyi uygun görürüm.\" dedi. Ebu Davıul şöyle der: \"Ukayl b. Halici bu hadiste Zührî ile Ibm'i 'l-Eiher arasına Abdullah b, Abdurrahman b. Ezhert sokmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4490,
			"arabicnumber": 4490,
			"text": "Hakîm b. Hizam (r.a) şöyle demiştir: \"Rasûiullah (s.a.v.). camide kısas istenmesinden, kayıp ilanından ve hadleri uygulamadan nehyetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4491,
			"arabicnumber": 4491,
			"text": "Ebu Bürde (r.a.) şöyle demiştir: Rasûiullah (s.a.v.): \"Allah azze ve celle'nin hadlerinden bir hsıddin dışında, on değnekten fazla vurulmaz\" buyururdu. Diğer tahric edenler: Buhari. hudûd; Müslim, hudüd; Tirmizi. hudud, İbn Mace, hudûd; Darimî. hudûd: Ahmed b. Hanbel. 111. 466; IV, 45. İzah 4492 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4492,
			"arabicnumber": 4492,
			"text": "Bize Ahmed b. Salih haber verdi, bize İbn Vehh haber verdi, bana \\mr haber verdi, ona Bükeyr b. el-Eşec haber vermiş, o Süleyman b. Yrsar'dan şöyle haber verdi: Bana Abdurrahman b. Cabir, babasının şöyle haber verdiğini söyledi: \"O Ebû Bürde el-Ensari'yi şöyle derken işitmiş: \"Rasûlullah (s.a}'i.....derken işittim.\"' Ravi o önceki (4491.) hadisin manasını zikretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4493,
			"arabicnumber": 4493,
			"text": "Ebu Hureyre (ta)'den demiştirki: Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Biriniz vurduğu /aman yüzden sakınsın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 143
			}
		}
	]
}