{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4494,
			"arabicnumber": 4494,
			"text": "İbn Abbas radıyallâhu anhümâ'dan; Şöyle demiştir: Kurayza ve Nadir (iki Yahudi kabilesi) idi. Nadir, Kureyza'dan daha güçlü idi. Kureyza'dan birisi, Nadir'den birini öldürürse, onun karşılığında öldürülürdü. Nadir'den bir adam, Kurayzalı birini Öldürdüğü zaman ise yüz vesk hurma fidye karşılığında serbest bırakılırdı. Rasûlullah (s.a.v) gönderildiğinde, Nadîr'den bir adam Kureyza'dan birisini öldürdü. Nadiriiler: \"Onu bize veriniz, öldürelim\" dediler. Kurayzalılar ise: \"Aramızda Nebi var\" dediler. Hep birlikte, Rasûlullah'a geldiler. Bunun üzerine: \"Hükmettiğin zaman, onlar arasında adaletle hükmet...\"[Mâide 42] ayeti nazil oldu. -İbn Abbas der ki: Kist (adalet); cana mukabil candır- Sonra da; \"Onlar (Yahudiler) cahiliyye'nin hükmünü mü istiyorlar.?”[Mâide 50] ayeti indi. Ebû Davud şöyle der: \"Kureyza ve Nadir'in hepsi Harun (A.S.)'ın evlâdındandır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4495,
			"arabicnumber": 4495,
			"text": "Ebû Rimse (r.a) den; şöyle demiştir: Babamla birlikte Rasûlullah sallallâhu aleyhi ve sellem'in yanına gittik. Rasûlullah (s.a.v) babama: \"Bu senin oğlun mu?\" dedi. Babam: \"Ka'be'nin Rabbine yemin ederim ki evet. Gerçekten, ona şehâdet ederim\" dedi. Rasûlullah (s.a.v) benim babam'a benzerliğimden ve babam'ın benim üzerime yemin etmesinden dolayı güldü. Sonra; “Şüphesiz o senin suçun sebebiyle muaheze edilmez, sen de onun suçu yüzünden sorumlu tutulmazsın\" buyurdu ve: \"Bir günah işleyen, başka birisinin günahını yüklenmez..\" ayetini okudu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4496,
			"arabicnumber": 4496,
			"text": "Şüreyh el-Huzâi (r.a) den; Resûlullah (s.a.v) şöyle buyurmuştur: \"Bir kimse öldürülme veya yaralanmaya maruz kalırsa o (ölen'in varisi) şu üç şeyden birisini seçer: Ya kısas yapar, ya affeder ya­da diyet alır. Eğer dördüncü bir şey isterse onu engelleyin. Kimde bundan (bu üç şeyden birini seçtikten) sonra haddi aşar (başka birşey isterse) onun için acı verici bir azâb vardır.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4497,
			"arabicnumber": 4497,
			"text": "Enes b. Mâlik (r.a) den; şöyle demiştir: Rasûlullah (s.a.v.)'e kısası gerektiren bir suç (lu) getirildiğinde, onun ancak affı emr (tavsiye) ettiğini gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4498,
			"arabicnumber": 4498,
			"text": "Ebû Hureyre (r.a)'den; şöyle demiştir: Rasûlullah (s.a.v) zamanında bir adam öldürüldü. Dava Rasûlullah'a getirildi. Rasûlullah (s.a.v) katili, maktulün velisine teslim etti. Katil: \"Ya Rasûlullah! Vallahi ben onu öldürmeyi istemedim\" dedi. Bunun üzerine Rasûlullah (s.a.v) maktulün velisine: \"Haberin olsun, eğer o doğru söylüyorsa (ve buna rağmen) sen onu öldürürsen cehenneme girersin\" buyurdu. Adam da katili serbest bıraktı. Katilin elleri arkadan enli bir kayışla bağlı idi, kayışını sürüyerek çıktı. Bu yüzden adam \"zû nis'a = kayışlı\" diye adlandırıldı. Diğer tahric edenler: Tirmizi, diyât, Nesâi, Kasâme, İbn Mâce, diyât",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4499,
			"arabicnumber": 4499,
			"text": "Vâil b. Hucr (r.a) şöyle demiştir: Rasûlullah (s.a.v)'in yanında idim. Boynunda kayış bağlı bir katil getirildi. Rasûlullah (s.a.v) maktulün velisini çağırdı ve: \"Onu affediyor musun?\" dedi. Adam: Hayır, cevâbını verdi. Rasûlullah (s.a.v): \"Ondan diyet mi alıyorsun?\" buyurdu. Adam: Hayır, dedi. Rasûlullah (s.a.v): \"Onu öldürecek misin?\" diye sordu. Adam: Evet, dedi. Rasûlullah (s.a.v): \"Al onu götür\" dedi. Dördüncü seferinde: \"Haberin olsun, eğer sen onu affedersen, o hem kendi günahını hem de öldürdüğü kişinin günâhı ile döner\" buyurdu. Ravi derki: Bunun üzerine maktulün velisi katili affetti. Ben onu, kayışını sürürken gördüm. Diğer tahric edenler: Müslim, Kasame; Nesâi. kasâme",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4500,
			"arabicnumber": 4500,
			"text": "Bize Ubeydullah Ömer b. Meysere haber verdi, bize Yahya b. Said haber verdi, \"Bana Cami b. Metar haber verdi\" dedi. Bana Alkame b. Vâil (önceki 4499. hadisi) aynı isnâd ve manâ ile rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4501,
			"arabicnumber": 4501,
			"text": "Alkame b. Vâil (r.a)'in babası (Vâil) den rivayet etti (ğine gö­re); Vâil şöyle dedi: \"Bir adam Habeşli birisini Rasûlullah (s.a.v) e getirip: Bu adam kardeşimi öldürdü, dedi. Rasûlullah (s.a.v) Habeşliye: Onu nasıl öldürdün? diye sordu Habeşli: Kafasına balta vurdum, maksadım onu öldürmek değildi, karşılığını verdi. Rasûlullah (s.a.v.): Onun diyetini ödeyecek malın var mı? Habeşli: Hayır Rasûlullah: Seni göndersem de, insanlardan isteyerek onun diyetini toplasan olur mu? buna ne dersin? Habeşli: Hayır. Rasûlullah (s.a.v): Mevlâların (efendilerin) sana onun diyetini verirler mi? Habeşli: Hayır. Bunun üzerine Rasûlullah (s.a.v) adam'a (maktulün velisine): \"Onu al\" buyurdu. Adam, öldürmek için katili çıkardı. (Peşinden) Rasûlullah (s.a.v): \"Şüphesiz eğer adam onu öldürürse aynen onun gibidir\" buyurdu. Bunun üzerine maktulün velisi katili, Rasûlullah'm sözünü işiteceği bir yere götürdü ve şöyle dedi: \"(Ya Rasûlullah !) İşte adam, onun hakkında dilediğini emret\" dedi. Rasûlullah (s.a.v): Onu salıver, arkadaşının (maktulün) ve onun günahı ile döner, (yüklenir) de Cehennemliklerden olur buyurdu. Adam da katili salıverdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4502,
			"arabicnumber": 4502,
			"text": "Ebû Ümâme b. Sehl (r.a) den; şöyle demiştir: Osman (r.a) evde mahsur iken, biz onunla birlikte idik. Evde bir giriş vardı. Oradan giren Belattakilerin sözünü işitirdi. Osman (r.a) oraya girdi ve rengi değişmiş bir vaziyette yanımıza çıkıp şöyle dedi: \"Onlar az önce beni, öldürmekle tehdid ediyorlardı.\" Biz; \"Yâ emire'l-mu'minin onlara karşı Allah sana yeter\" dedik. \"Beni niçin öldür(mek ist)iyorlar?! Rasûlullah (s.a.v)i: \"Bir müslüman'ın kanı şu üç şeyden birisi dışında helâl değildir: Müslüman olduktan sonra küfre düşmek, İhsandan sonra zina ve bir can mukabili olmadan birisini öldürmek\" diye buyururken dinledim. (Hz. Osman devamla şöyle dedi): ''Vallahi ben Câhiliyyc devrinde de İslâm dönemin­de de hiç zina etmedim, Allah beni hidâyete erdireli beri, onun yerine benim için başka bir din olmasını istemedim ve hiçbir kimseyi öldürmedim. Beni ne sebeple öldürecekler?!..\" Ebû Davüd şöyle der: Ebûbekir ve Osman (r. anhüma) şarab'ı cahiliye devrinde terkettiler. Diğer tahric: Belât: Sözlükle bir çeşit taştır. Ancak, Medinedeki bir mevkiye ad olmuştur. Burada mak­sat orasıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4503,
			"arabicnumber": 4503,
			"text": "Urve b. Zübeyr, babasından; Musa; ve dedesinden de, ikisi de Rasûlullah (s.a.v) ile birlikte Huneyn gazvesine iştirak ettiler dedi.- Şimdi tekrar Vehb rivayetine dönüyoruz: şöyle rivayet etmiştir: Muhallim b. Cessâme el-Leysî, İslâm döneminde, Eşca' boyundan bir adam'ı öldürdü. -Bu, Rasûlullah (s.a.v)'in hükmettiği ilk diyettir- -Uyeyne, el-Eşcaî'nin katli konusunda konuştu. Çünkü o, (öldürülen Eşcaî gibi) Gatafan kabilesindendi. Ekra' b. Habis de Muhallim'in tarafından konuştu. Çünkü o da (Muhallim gibi) Hmdef kabilesindendi. Bu esnada sesler yükseldi, husûmet ve gürültü çoğaldı. Rasûlullah (s.a.v): \"Ya Uyeyne ! Diyeti kabul etmiyor musun?\" dedi. Uyeyne: O'nun kadınları benim kadınlarımın düştüğü keder ve sıkıntıya düşünceye kadar, hayır (kabul etmem) vallahi, dedi. Sonra sesler (yine) yükseldi, husûmet ve gürültü çoğaldı. Rasûlullah (s.a.v) tekrar: \"Yâ Uyeyne! diyeti kabul etmiyor musun?\" buyurdu. Uyeyne yine önceki söylediğini tekrarladı. Nihayet Beni Leys kabilesinden, üzerinde zırh ve elinde silâh olan Mükeytil adındaki adam ayağa kalkıp: Ya Rasûlullah! Ben bunun, İslâm'ın şu ilk günlerinde yaptığı şeye bir koyun sürüsünden başka bir mesel bulamıyorum; şöyle ki: Sürü suya vardığın­da öndekiler taşlanırsa arkadakiler kaçar. Bugün (kısas konusundaki) sünnetini işle. istersen yarın değiştir, dedi. Rasûlullah (s.a.v): \"Şimdi hemen elli (deve). Medineye döndüğümüz zaman elli (deve)\" buyurdu. Bu olay, Rasûlullah'ın seferlerinden birisinde oldu. Muhallim (katil) uzun boylu esmer bir adamdı. O insanlar tarafından sevilirdi. İnsanlar, o kurtuluncaya kadar (yardım etmeye) devam ettiler. Rasûlullah'ın huzurunda Muhallim'in gözlerinden yaşlar boşanıyordu \"Yâ Rasûlellah! Ben. sana gelen bu işi işledim, Allah'a tevbe ediyorum. Yâ Rasûlullah! Benim için Allah'tan af dile\" dedi. Rasûlullah (s.a.v): \"Sen onu İslâm'ın daha ilk günlerinde silâhınla öldürdün demek!\" Yüksek sesle: \"Allah'ım, Muhallim'i bağışlama\" dedi. Ebû Seleme şunu da ilâve etti: \"Muhallim, elbisesinin ucu ile gözyaşlarını silerek kalktı.\" İbn İshak şöyle dedi: \"Onun kavmi, bundan sonra Rasûlullah'ın onun için bağışlanma dilediğini iddia ettiler.\" Ebû Dâvud şöyle der: Nadr b. Şümeyi: \"e!-ğıyer; diyettir\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4504,
			"arabicnumber": 4504,
			"text": "Ebû Şûreyh el-Ka'bî (r.a) den (şöyle) dedi (ği rivayet edilmiştir): Rasûlullah (s.a.v) şöyle buyurmuştur; \"Dikkat edin, ey Huzâa topluluğu! Siz, Huzeyl'den şu maktulü öldürdünüz. Ben onun diyetini ödemekteyim. Benim şu sözlerimden sonra kimin bir adamı öldürülürse onun ailesi diyet almak yada katili (kısas olarak) öldürmek arasında muhayyerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4505,
			"arabicnumber": 4505,
			"text": "Ebû Hureyre (r.a) şöyle demiştir: Mekke fethedilince Rasûlullah (s.a.v) ayağa kalkıp: \"Kim'in bir adamı öldürülürse o iki şey arasında muhayyerdir; ya diyet ödenmesi yada kısas yapılması\" buyurdu. Yemenlilerden, Ebû Şâh denilen bir adam kalktı ve \"Ya Rasûlellah! Benim için yaz; - Abbas; benim için yazın, dedi dedi. Bunun üzerine Rasûlullah (s.a.v) \"Ebû Şâh için yazınız\" buyurdu. Bu, (ravilerden) Ahmed'in hadisinin lâfzıdır. Ebû Dâvud dedi ki: \"Benim için yazın \"; Rasûlullah'ın hutbesini benim için yazın, demektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4506,
			"arabicnumber": 4506,
			"text": "Amr b. Şuayb, babası vasıtasıyla, dedesinden, o da Rasûlulah (s.a.v)'den, şöyle buyurduğunu rivayet etmiştir: \"Bir rnu'min, kâfir'e karşılık öldürülmez. Kim bir mu'mini teammüden öldürürse, maktulün velîsine teslim edilir. Onlar isterlerse katili öldürürler, isterlerse diyet alırlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4507,
			"arabicnumber": 4507,
			"text": "Câbir b. Abdillah (r.a) den (şöyle) dedi(ği rivayet edilmiştir): Rasûlullah (s.a.v) şöyle buyurmuştur \"Diyet aldıktan sonra (katili) öldüren bolluk görmesin",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4508,
			"arabicnumber": 4508,
			"text": "Hişam b. Zeyd'in rivayet ettiğine göre; Enes b. Mâlik (r.a) (şöyle demiştir): Yahudi bir kadın, Rasûlullah (s.a.v)'e zehirli bir koyun getirdi, Rasûlullah ondan yedi. (Bilâhere) kadın getirildi. Rasûlullah (s.a.v) kadın'a bunu niçin yaptığını sordu. Seni öldürmek istedim, dedi. Rasûlullah (s.a.v): \"Allah seni bu işe -veya: benim üzerime-[Şek râvidendir] musallat etmez\" buyurdu. Sahabeler: Onu öldürmeyelim mi? dediler. Rasûlullah (s.a.v): \"Hayır\" cevâbını verdi. Enes derki: Ben onu (zehrin alametini) Rasûlullah'ın boğazının sonundaki etlerde gördüm durdum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4509,
			"arabicnumber": 4509,
			"text": "Ebû Hureyre (r.a) den; şöyle de (diği rivayet edil) mistir: \"Yahudilerden bir kadın, Rasûlullah (s.a.v)'e zehirli koyun hediye etti. Rasûlullah, (s.a.v) kadın'a hiçbir ceza vermedi.\" Ebu Davud dediki; Rasulullah sallallahu aleyhi ve sellem'i zehirleyen bu yahudi kadın, Merhab'ın kız kardeşidir. İzah 4514 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4510,
			"arabicnumber": 4510,
			"text": "Câbir b. Abdillah (r.a.) şöyle anlatırdı: Hayberlilerden Yahudi bir kadın, ateşte kızartılmış bir koyuna zehir koydu. Sonra onu Rasulullah (s.a.v)'e hediye etti. Rasulûlullah (s.a.v) (koyunun) kolunun (ön bacağını) aldı ve ondan yedi. Onunla birlikte ashabından bir gurup da yedi. Sonra Rasûlullah onlara: . \"Ellerinizi kaldırın (yemeyi bırakın)\" dedi. Yahudi kadın'a haber gönderip çağırdı ve ona: \"Bu koyun'a zehir mi koydun?\" diye sordu. Kadın: \"Sana kim haber verdi?\" dedi. Rasûlullah (s.a.v): (elindeki) kolu göstererek: \"Şu elimdeki haber verdi\" dedi. Kadın: \"Evet\" Nebi (sallallahu aleyhi ve sellem); \"Bununla ne (yapmak) istedin?\" Kadın: \"Eğer Nebise ona zarar vermez, Nebi değilse ondan kurtuluruz dedim.\" Nebi (s.a.v) kadını affetti, cezalandırmadı. (Ama) Rasûlullah'ın ashabından, koyundan yiyenlerden birisi öldü. Rasûlullah (s.a.v) yediği etten dolayı kürekleri arasından kan aldırdı. Ondan, Ebû Hind boynuz ve bıçakla kan aldı. Ebû Hind, Ensardan Benû Beyâda'nın azatlısı idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4511,
			"arabicnumber": 4511,
			"text": "Ebû Seleme (r.a)'den, şöyle (dediği) rivayet edilmiştir: Hayberde, yahûdi bir kadın Rasûiullah (s.a.v)'e ateşte kızartılmış bir koyun hediye etti. Râvi (yukarıdaki 4510.) Câbir hadisinin bir benzerini söyleyip şöyle dedi: Bişr b. Berâ b. Ma'rûr el-Ensâri öldü. Bunun üzerine Rasûlufiah Yahûdi kadın'a haber gönderip (çağırdı). Ona: \"Niçin böyle birşey yaptın?\" dedi. -Ravi yine Câbir (4510.) hadîsinin benzerini söyledi.- Rasûhıllah emretti ve kadın öldürüldü. (Bu hadisin) Ravî (si) kan aldırma mes'elesini anmadı. Bu hadîs mürseldir. İzah 4514 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4512,
			"arabicnumber": 4512,
			"text": "Ebû Seleme (radıyallahü anh)’den, şöyle (dediği) rivâyet edilmiştir: yahûdi bir kadın Resûlüllah (sallallahü aleyhi ve sellem)’e ateşte kızartılmış bir koyun hediye etti. Râvi (yukarıdaki) Câbir hadisinin bir benzerini söyleyip şöyle dedi: Bişr b. Berâ b. Ma'rûr el-Ensâri öldü. Bunun üzerine Resûlüllah Yahûdi kadına haber gönderip (çağırdı). Ona: Niçin böyle birşey yaptın?\" dedi. yine Câbir hadîsinin benzerini söyledi.- emretti ve kadın öldürüldü. hadisin) Ravî (si) kan aldırma mes'elesini anmadı. Bu hadîs mürseldir. Ebû Hûreyre (radıyallahü anh)'den; şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem) hediyeyi kabul eder, sadaka yemezdi.\" hadis Bezlu'l-Mechud nüshasında mevcut değildir. Avnü'l-Ma'bud’da da bir sonraki. hadisle birlikte anılmıştır. Mûsânnıfın hadisi. Resûlüllah'ın zehirlenmek istediğini anlatan hadisler arasına alışı Resûlüllah'ın kendisine hediye edilen koyunu kabûl etmesi yönündendir. (Ravilerden) Muhammed b. Amr; Ebû Seleme’den (diyerek) -Ebû Hureyre'yi zikretmedi- şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem) hediyeyi kabul eder, sadaka kabul etmezdi.\" -Ravî (Ebû Seleme) şunları da ilâve etti: -Yahûdi bir kadın, Hayber'-de ona ateşte kızartılmış, içine zehir koyduğu bir koyun hediye etti. Resûlüllah ve halk ondan yediler. Resûlüllah (sallallahü aleyhi ve sellem): Ellerinizi çekiniz! O bana, zehirli olduğunu haber verdi\" buyurdu. Bişr b. el-Berâ b. Ma'rûr el-Ensâri öldü. Resûlüllah kadına haber gönderdi (getirtti ve ona): Niçin böyle birşey yaptın?\" dedi. Eğer sen peygambersen yaptığım şey sana zarar vermez. Eğer kralsan insanları senden kurtarırım (diye düşündüm)\" dedi. Bunun üzerine Resûlüllah’ın emri ile kadın öldürüldü. Peygamber (sallallahü aleyhi ve sellem) vefat ettiği hastalığı esnasında şöyle buyurdu: Hayber'de yediğim lokmanın tesirini devamlı hissedip durdum. Şu an, damarlarımı \" Damarlar diye terceme elliğimi, \" ebher kelime sırttaki iki damar, kalbin içindeki damar, kollardaki damarlar gibi manâlara gelir. kestiği andır.\" meğazi X3; Darimi. Mukaddime 11; Ahmed, VI: 18",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4513,
			"arabicnumber": 4513,
			"text": "Ka'b b. Mâlik (r.a)'in oğlu, babasından şöyle (dediğini) rivayet etmiştir: Mübeşşir'in annesi (Ümmii Mübeşşir), Rasûlullah (s.a.v)'e, vefat etmiş olduğu hastalığı esnasında: \"Hastalığına sebebin ne olduğunu zannediyorsun? Yâ Rasûlellah! Ben oğlum hakkında da, (hastalığına) seninle birlikte yediği zehirli koyundan başka bir şey sebep olduğunu zannetmiyorum\" dedi. Rasûlullah (s.a.v) de: \"Bende kendim için bundan başka bir sebep bulamıyorum. Bu, benim damarlarımı kestiği zamandır\" buyurdu. Ehû Davud şöyle dedi: Abdurrezzak bu hadisi bazan Ma'mer ve Zuhrî isnadıyla Rasûlullah'dan mürsel olarak rivayet etti. Bazan da onu Zuhrî ve Abdurrahman b. Kâ'h b. Mâlik isnadı ile rivayet etti. Abdurrezzak' in bildirdiğine göre; Ma'mer, hadisi kendilerine bir sefe­rinde mürsel olarak haber verip, onların da, onu öylece yazdıklarını, bir seferinde de müsned olarak rivayet ettiğini ve onların da öylece yazdıklarını söyledi. Bize göre. bunların hepsi sahihtir. Abdurrezzak şöyle dedi: İbnü1 l-Mübârek Mamer'in yanına geldiğin­de, Ma'mer mevkuf olarak rivayet etmiş olduğu hadisleri ona müsned (yani senedlerinde kopukluk olmaksızın) olarak rivayet etti. İzah 4514 te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4514,
			"arabicnumber": 4514,
			"text": "Abdurrahman b. Abdullah b. Ka'b b. Mâlik annesi Ümmü Mübeşşir'den, -Ebû Saîd b. el-A'rabî: \"Böylece annesinden dedi, doğrusu babasından, o da Uuimü Mübeşşir'den demeliydi\" deyip- rivayet etti ki; O (Ümmü Mübeşşir) Rasûlullah (s.a.v)'in yanına girdi... (Ravî), Mihled b. Hâlid'in hadisini Câbir'in (4510.) hadisi gibi rivayet etti ve şöyle dedi: Bişr b. el-Berâ b. Ma'rûr öldü. Rasûlullah (s.a.v) Yahudi kadına haber gönderdi (getirtti) ve ona: \"Seni yaptığın bu şeye sevkeden ne?\" diye sordu. Ravi, Câbir'in (4510.) hadisinin benzerini rivayet etti, ve şunu da zikretti: \"Rasûlullah (s.a.v) emretti ve kadın öldürüldü.\" Kan aldırma mes'elesini anmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4515,
			"arabicnumber": 4515,
			"text": "Semure (r.a) den, Rasûlullah (s.a.v) şöyle buyurmuştur: \"Kim kölesini öldürürse biz de onu öldürürüz. Kim kölesinin uzuvlarını keserse biz de onun uzuvlarını keseriz. Diğer Tahric edenler: Tirmizî. diyât; Nesâî. kasâme; İbn Mace. diyât; Dârimi, diyât; Ahme b. Hanbel. V. 10.11.12.18:20. İzah 4519 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4516,
			"arabicnumber": 4516,
			"text": "Katâde (r.a.)'den yukarıdaki (4515.) hadis aynı isnâd ve metinle rivayet edilmiştir. Ravî (bu rivayette) şöyle dedi: Rasûlullah (s.a.v): \"Kim kölesini iğdiş ederse (hadım ederse) biz de onu iğdiş ederiz.\" buyurdu. Ravi sonra Şu'be ve Hammâd'ın hadisinin benzerini söyledi. Ebû Davud der ki: Bu hadisi, Ebû Davud et-Tayâlisî Hişâm'dan Muaz in hadisi gibi rivayet etti. Diğer Tahric eden: Nesâi, kasâme İzah 4519 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4517,
			"arabicnumber": 4517,
			"text": "Katâde'den, Şu'be'nin isnadı ile o'nun hadisinin bir benzeri rivayet edildi. Ravi bu rivayette şunu da ilâve etti: \"Sonra Hasen (ilk hadisin tabii râvisi olan Hasenü'l-Basrî) bu hadisi unuttu. O sebeple \"hür, köle mukabilinde öldürülmez\" derdi. İzah 4519 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4518,
			"arabicnumber": 4518,
			"text": "Bize Müslim b. İbrahim haber verdi, bize Hişâm, Katâde'den o da Hasen'den haber verdi; Hasen (ül-Basri); \"Hürre köle mukabilinde kısas uygulanmaz' dedi. İzah 4519 da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4519,
			"arabicnumber": 4519,
			"text": "Amr b. Şuayb babası vasıtasıyla dedesinden, şöyle dediğini rivayet etmiştir: Yardım isteyen bir adam Rasûlullah (s.a.v)'e gelip: \"O'nun cariyesi yâ Rasûlellah! (efendim kendisine ait bir câriye yüzünden bana eziyet etti, yâ Rasûlellah!)\" dedi. Rasûlullah (s.a.v): \"Vah vah! yazık, sana ne oldu?\" dedi. Adam: \"Felâket! efendisine ait bir cariyeyi gördü, o da gayrete gelip cinsel organını kesti\" dedi. Rasûlullah (s.a.v): “Bana adamı getirin\" buyurdu. Adam arandı ama getirilemedi. Bunun üzerine Rasûlullah (s.a.v): \"Git sen hürsün\" dedi. Adam: \"Ya Rasûlellah! bana kim yardım edecek (bana yardım kime vazife)?\" dedi: Rasûlullah (s.a.v.): \"Bütün mü'mînlere\" veya \"bütün müslümanlara\"[Şek râvidendir] buyurdu. Ebû Davud şöyle dedi: Azâd edilenin adı Ravh b. Dinar'dır, onun cinsel organını kesen Zinba'dır\" Yine Ebû Davud şöyle dedi: O Ravh'ın babası Zinba dır. Köle'nin Mevlâsı idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4520,
			"arabicnumber": 4520,
			"text": "Selıl b. Ebî Has'ame ve Râfi b. Hadîc (radıyallâhu anhumâ) dan, şöyle (dedikleri) rivayet edilmiştir: Muhayyısa b. Mes'ûd ve Abdullah b. Sehl Hayber tarafına gitmişler ve hurmalıkta biribirlerinden ayrılmışlardı. Abdullah b. Sehl öldüiüldü. Yahudileri itham ettiler. Kardeşi Abdurrahman b. Sehl ve amcasının oğulları Huveyyisa ve Mühayyisa, Rasûlullah (s.a.v)'in huzuruna geldiler. Onların küçüğü olduğu halde, kardeşinin başına gelen şey konusunda Abdurrahman konuştu. Rasûlullah (s.a.v) \"Büyük konuşsun, büyük\" -veya: \"büyük olan başlasın\"[şek, râvidendir]-buyurdu. Bunun üzerine arkadaşlarının (amca oğullarının durumu) hakkında ikisi birden (Huveyyisa ve Mühayyisa) konuştular. Rasûlullah (s.a.v): \"Sizden elli kişi onlardan bir adam aleyhine yemin ederse onun ipi (size) verilir\" buyurdu. Onlar; \"Görmediğimiz bir şeye nasıl yemin ederiz?!\" dediler. Rasûlullah (s.a.v): \"O halde yahûdiler kendilerinden elli kişinin yemini ile size karşı temize çıkarlar\" buyurdu. Onlar: \"Yâ Rasûlullah! onlar kâfirdirler. (Onların yeminine nasıl güvenilir?) dediler. Bunun üzerine Rasûlullah (s.a.v) o maktulün diyetini kendisi verdi. Sehl (b. Ebî Hasme) der ki: \"Birgün onların deve ağılına girdim, develerden birisi bana tekme attı.\" Hammâd bunu veya benzerini söyledi. Tahric eden diğer imamlar: Buhâri, edeb, cizye; Müslim, kasâme; Tirmizi, diyât; Nesai, kasâme; İbn Mace, diyat: Ahme b. Hanbel, IV, 2.3. Ehû Davud şöyle dedi: Bu hadisi Bişr b. el-Mufaddal ve Mâlik, Yah­ya b. Said'den rivayet ettiler. Yahya bu rivayette Rasûlullah1 in söyle de­diğini söyledi: \"Elli defa yemin edip arkadaşınızın veya katilinizin kanını hak eder misiniz?\" Bişr, \"kan’ı\" anmadı. Abde, Yahya'dan, Hammâd'ın dediği gibi nakletti. Bu hadisi İbn Uyeyne, Yahya'dan rivayet etti. Rivayetine Rasûlul­lah s.a.v.'in şu sözü ile başladı: \"Yahudiler, edecekleri elli yemin ile size karşı temize çıkarlar\" Yahya \"kanı hak etmeyi\" anmadı. Ebu Davud, \"Bu ibn Uyeyne'den bir vehmdir\" der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4521,
			"arabicnumber": 4521,
			"text": "Sehl b. Ebi Hasme ve kavminin büyüklerinden (bazı) adamlar haber verdiler ki: Abdullah b. Sehl ve Muhayyisa başlarına gelen bir kıtlık yüzünden Hayber'e doğru yol'a çıktılar. Muhayyisa'ya gelinip, Abdullah b. Sehl'in öldürüldüğü ve bir kuyuya veya çukura atıldığı haber verildi. Muhayyisa Yahudilere gelip: \"Vallahi onu siz öldürdünüz\" dedi. Yahudiler de: \"Vallahi biz öldürmedik\" dediler. Bunun üzerine döndü ve kendi kavmine geldi. Olup biteni onlara haber verdi. Sonra da kendisinden büyük olan kardeşi Huveyyisa ve Abdurrahman b. Sehl ile birlikte geldiler. Muhayyisa -Hayberde olan o idi- konuşmak için (Rasûlullah'a) gitti. Rasûlullah (s.a.v) yaşı kasderek \"büyült, büyült (büyüğünüz konuşsun)\" buyurdu. Bunun üzerine, Huveyyisa konuştu, sonra Muhayyisa konuştu. Rasûlullah (s.a.v): \"(Yahudiler) ya arkadaşınızın diyetini verirler yada (Allah ve Rasûlüne) harb açtıklarını bildirirler\" buyurdu. Ayrıca bunu Yahudilere yazdı. Yahudiler de: \"Vallahi onu biz öldürmedik\" diye yazdılar. Rasûlullah (s.a.v): Huveyyisa, Muhayyisa ve Abdurrahman'a: \"Yemin eder ve arkadaşınızın kanını hak eder misiniz?\" dedi. \"Hayır\" dediler. Rasûlullah: \"Sizin için Yahudiler yemin etsinler mi?\" buyurdu. \"Onlar müslüman değiller\" dediler. Bunun üzerine, Rasûlullah onun diyetini kendi yanından verdi. Onlara, yüz dişi deve gönderdi. O kadar ki, develer evlerine kadar sokuldu. Ravi Sehl şöyle dedi: \"O develerden kırmızı bir deve beni tepti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4522,
			"arabicnumber": 4522,
			"text": "Amr b. Şuayb (r.a) den rivayet edildi ki: Rasûlullah (s.a.v) Liyyetu'l-Bahrâ kenarındaki Bahratu'r-Ruğa (denilen yer) de Benî Nasr b. Mâlik'ten bir adamı kasâme yoluyla öldürdü. Râvî: \"katil de maktulde onlardan (beni Nasr b. Mâîik'ten) idi\" der. Bu, Mahmûd'ıın lâfzıdır. \"Liyye kenarındaki Bahra\" sözünü sâdece Mahmûd zikretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4523,
			"arabicnumber": 4523,
			"text": "Beşir b. Yesâr'dan; O, Ensar'dan adının Sehl b. Ebî Has'ame olduğunu zannetiği bir adam'ın kendisine şöyle haber verdiğini söyledi: Kavminden (Sehl b. Has'ame'nin) bir gurup Hayber'e gitmişlerdi. Orada birbirlerinden ayrıldılar. Bilâhere içlerinden birisini öldürülmüş olarak buldular. Arkadaşlarını yanlarında buldukları kavme; \"Arkadaşımızı siz öldürdünüz\" dediler. Onlar: \"Onu biz öldürmedik ve öldüreni de bilmiyoruz\" dediler. Bunun üzerine Rasûlullah (s.a.v)'e gittik. Rasûlullah (s.a.v) onlara: \"Bunu kimin öldürdüğüne dâir bana beyyine getirebilir misiniz?\" dedi. Onlar: “Bizde beyyine yok\" dediler. Rasûlullah (s.a.v): \"(Yahudiler) sizin için yemin etsinler mi?\" Maktulün velileri: \"Yahudilerin yeminine razı olmayız\" dediler. Allah Rasûlü, maktulün kanını heder etmeyi hoş görmedi ve sadaka (zekât) develerinden yüz tanesi ile onun diyetini verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4524,
			"arabicnumber": 4524,
			"text": "Rafı' b. Hadîc (r.a) den; şöyle demiştir: Ensârdan bir adam, Hayber'de öldürülmüş olarak bulundu. Maktulün velileri, Rasûlullah (s.a.v)'e gittiler ve olayı kendisine anlattılar. Rasûlullah (s.a.v): \"Arkadaşınızın öldürüldüğüne şahidlik edecek iki şahidiniz var mı?\" diye sordu. Onlar; \"Ya Rasûlellah! Orada müsiümanlardan kimse yoktu. Onlar yahûdi; bundan daha büyük şeylere cüret ederler\" cevâbını verdiler. Rasûlullah (s.a.v): \"Onlardan (yahudilerden) elli kişi seçip yemin ettiriniz\" buyurdu. Maktulün velileri buna yanaşmadılar. Bunun üzerine Hz, Nebi (s.a.v) kendi yanından, maktulün diyetini ödedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4525,
			"arabicnumber": 4525,
			"text": "Abdurrahman b. Büceyd (r.a) den; Muhammed b. İbrahim; \"Vallahi Sehl (b. Has'ame) hadiste vehme kapıldı\" dedi. Şüphesiz Rasûlullah (s.a.v) Yahudilere: \"Aranızda öldürülmüş birisi bulundu, onun diyetini veriniz\" diye yazdı. Onlar da; elli kez: \"Onu biz öldürmedik ve öldüreni de bilmiyoruz\" diye Allah'a yemin ederek (cevap) yazdılar. Râvî der ki: Rasûlullah (s.a.v) kendi yanından yüz deve ile maktulün diyetini verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4526,
			"arabicnumber": 4526,
			"text": "Ebû Seleme b. Abdurrahman ile Süleyman b. Yesâr, Ensâr'dan bazı zâtlardan şöyle (dediklerini) rivayet ettiler: Rasûlullah (s.a.v) Yahudilere, onlardan başlayarak şöyle dedi: \"Sizden elli erkek yemin etsin.\" Yahudiler buna yanaşmadılar. O zaman Ensâra: \"Hakkınızı (yemin ederek) kazanınız (arkadaşınızın kanını hak ediniz)\" dedi. Onlar da: \"Görmediğimiz şeye yemin mi edelim? Ya Rasûlellah!\" dediler. Bunun üzerine Rasûlullah Yahudiler aleyhine diyete hükmetti. Çünkü maktul onların arasında bulunmuştu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4527,
			"arabicnumber": 4527,
			"text": "Enes b. Mâlik (r.a) den; şöyle demiştir: Kafası iki taş arasında ezilmiş bir câriye bulundu. Kendisine: \"Bunu sana kim yaptı? Falan mı, falan mı?\" diye soruldu. (Bu) bir Yahûdinin ismi söyleninceye kadar (sürdü), (yahûdinin ismi anılınca) başı ile (evet diye) işaret etti. Yahudi yakalandı ve suçunu itiraf etti. Rasûlullah (s.a.v) yahûdi'nin başının da taşla ezilmesini emretti. Diğer tahric edenler: Buhâri, vesâyâ, diyât; Müslim, kasâme; Tirmizi, diyât; İbn Mâce, diyât; Nesâî, kasâme; Dârimi, diyât",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4528,
			"arabicnumber": 4528,
			"text": "Enes (r.a) den; (şöyle dediği) rivayet edilmiştir; Bir Yahudi, ensârdan bir cariyeyi ondaki bir zinetten dolayı öldürdü; sonra bir kuyuya attı. Kadın'ın başını taşla ezmişti. Yahudi yakalandı ve Rasûlullah'a getirildi. Rasûlullah adam'ın ölünceye kadar taşlanmasını emretti ve ölünceye kadar taşlandı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4529,
			"arabicnumber": 4529,
			"text": "Enes (r.a) den; (şöyle dediği) rivayet edilmiştir: Bir Yahudi üzerinde zinet bulunan bir câriye'nin başını taşla ezdi. Ra­sûlullah (s.â.v) câriye ölmek üzere iken yanına girdi. Ona: \"Seni kim öldürdü? Falan mı öldürdü?\" diye sordu. Kadın başı ile \"hayır\" diye işaret etti. Rasûlullah tekrar: \"Falan mı öldürdü?\" dedi. Kadın bu sefer başı ile \"evet\" diye işaret etti. Bunun üzerine, Rasûlullah (s.a.v) emretti ve katilin başı iki taş arasında ezildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4530,
			"arabicnumber": 4530,
			"text": "Kays b. Ubâd (r.a) den; şöyle de(diği rivayet edil)miştir: Eşler le birlikte Hz. Ali (r.a)'in yanına gidip: \"Rasûlullah (s.a.v) tüm insanlara vasiyet etmediği bir şeyi sana tavsiye etti mi? dedik. Ali (r.a): \"Hayır, ancak benim şu kitabımdaki müstesna...\" dedi. Müsedded; \"bir kitap çıkardı\" dedi. Ahmed ise; \"kılıcının torbasından bir kitap çıkardı\" dedi. O mektupta şunlar vardı: Müslümanların kanları eşittir. Başkalarına karşı onlar tek bir el gibidirler. En alt seviyedekînden de olsa, emânlarını tanırlar. Haberiniz olsun! Bir mu'min bir kâfire karşılık ve ahd sahibi (bir gayr-i müslim de) ahdi esnasında, kâfire karşılık (kısas yoluyla) öldürülmez. Bir kimse bir şey ihdas ederse cezası sadece kendisinedir. Her kim birşey ihdas eder veya ihdas edeni barındırırsa Allah'ın, meleklerin ve tüm insanların laneti onun üzerine olsun. Müsedded, ibn Ebî Arûbe'den (naklen) \"bir kitap çıkardı\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4531,
			"arabicnumber": 4531,
			"text": "Amr b. Şuayb, babası vâsıtasıyle dedesinden, şöyle rivayet etmiştir: Rasûlullah (s.a.v) buyurdu, deyip yukarıdaki (4430.) Hz. Ali hadisinin benzerini zikretti. Amr, rivayetinde şunları da ilâve etti: \"Onların (müslümanlann) en alt seviyesindeki kişi hepsi adına eman verebilir, en güçlüleri (aldığı ganimetten) zayıflarına da verir, savaşa giren mücâhitler, katılmayan askerlere de (ganimet) verirler.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4532,
			"arabicnumber": 4532,
			"text": "Ebu Hureyre (r.a) den; şöyle de(diği rivayet edil) miştir: Sa'd b. Ubâde (r.a): \"Ya Rasûlellah! Hanımı yanında bir erkek bulan kişi, onu öldürebilir mi?\" dedi. Rasulullah (s.a.v): \"Hayır\" buyurdu. Sa'd : \"Sana hak ile ikram eden Allah'a yemin ederim ki, evet dedi. Rasulullah (s.a.v) şöyle buyurdu: \"Şu seyyidinizin (reisinizin) dediğine kulak veriniz\" Abdul-Vehhab; \"Sa'd'ın dediğine\" dedi. buyurdu. Diğer tahric edenler: Buhari Salat, tefsir sure, talak; Müslim, Hân; İbn Mace, hudûd; Nesâî, talak; Dârimi, nikâh; Ahme b. Hanbel, V:336, 339",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4533,
			"arabicnumber": 4533,
			"text": "Ebu Hureyre (r.a) den; şöyle dedi: Sa'd b. Ubâde, Rasûlullah (s.a.v)'e; \"Hanımımla birlikte bir erkek bulsam, dört şahit getirinceye kadar ona mühlet mi vermeliyim? (Ne dersin?)\" dedi. Rasûlullah (s.a.v): \"Evet\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4534,
			"arabicnumber": 4534,
			"text": "Âişe radıyallâhu anhâ'dan; şöyle demiştir: Rasûlullah (s.a.v) Ebû Cehm b. Huzeyfe'yi zekât toplayıcı olarak gönderdi. (Gittiği yerde) bir adam, malının zekâtı konusunda onunla tartıştı. Ebû Cehm, adama vurup başını yardı. (Yaralının velîleri) Rasûlullah'a gelip: \"Kısas isteriz yâ Rasûlallah!\" dediler. Rasûlullah (s.a.v): \"Size şu kadar mal var (kısas'tan vazgeçin)\" dedi. Razı olmadılar. Rasûlullah tekrar; (artırarak); \"Size şu kadar mal\" buyurdu, yine razı olmadılar. Hz. Nebi (s.a.v) (üçüncü defa ve artırarak): \"Size şu kadar mal var, (kısas'tan vazgeçin)\" buyurdu. Bu sefer razı oldular. Nebi (s.a.v): \"Öğle'den sonra halka hitâbedip, razı olduğunuzu haber vereceğim\" buyurdu. Onlar da: \"Evet\" dediler. Rasûlullah (s.a.v) halk'a hitabederek şöyle dedi: “Leysliler bana, kısas istemeye geldiler. Ben de onlara şu kadar mal (en son teklif edip de onların razı oldukları malı söyledi) teklif ettim, razı oldular, (halka duyurmak için) razı oldunuz mu?\" buyurdu. \"Hayır\" dediler. Muhacirler, üzerlerine atılmak istediler, Rasûlullah vazgeçmelerini emretti. Onlar da bıraktılar. Rasûlullah sonra davacıları çağırıp, malı artırdı ve: \"Razı oldunuz mu?\" dedi. \"Evet\" dediler. Rasûlullah (s.a.v): \"Ben halka hitâbedip sizin razı olduğunuzu haber vereceğim\" buyurdu. \"Evet\" dediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4535,
			"arabicnumber": 4535,
			"text": "Enes b. Mâlik (r.a) den; şöyle demiştir: Bir câriye, kafası iki taş arasında ezilmiş bir halde bulundu. Ona: \"Bunu sana kim yaptı? Falan mı? Falan mı?\" diye soruldu. Bu hal, bir Yahûdi'nin ismi anılıncaya kadar devam etti. (Yahûdinin adı anılınca) başı ile işaret etti. Yahudi yakalandı ve suçunu itiraf etti. Bunun üzerine Hz. Peygamber (s.a.v) Yahûdinin başının da taşla ezilmesini emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4536,
			"arabicnumber": 4536,
			"text": "Ebû Saîd el-Hudri (r.a) den; şöyle demiştir: Rasûlullah (s.a.v) mal (ganimet) taksim ederken bir adam gelip üzerine abandı. Rasûlullah (s.a.v), yanındaki hurma salkımı sapından olan kamçıyı adama vurdu. Adam'ın yüzü yaralandı. Rasûlullah (s.a.v) adam'a: \"Gel sen de kısas yap (bana vur)\" dedi. Adam: “Affettim yâ Resûlallah!\" dedi. Diğer tahric edenler: Nesâî. kasame; Ahme b. Hanbel, III, 56-65",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4537,
			"arabicnumber": 4537,
			"text": "Ebû Firâs'dan şöyle demiştir: Ömer b. el-Hattab (r.a) bize hitâbedip şöyle dedi: \"Ben âmillerimi (memurlarımı) sizin bedenleriniz vursunlar ve mallarınızı alsınlar diye göndermedim. Kime böyle bir şey yapıldıysa bana müracaat etsin, ona kısas yapayım.\" Arnr b. el-As: \"Eğer birisi maiyetinden birisini te'dib etse ona da kısas yapar mısın, (ceza verir misin)?\" dedi. Ömer (r.a): \"Evet, canım elinde olan Allah'a yemin ederim ki ona kısas uygularım (Yaptığının aynı ile ceza veririm). Rasûlullah (s.a.v) i kendisine kısas uygulatırken gördüm\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4538,
			"arabicnumber": 4538,
			"text": "Âişe radiyellâhu anhâ'dan; Rasûlullah (s.a.v) şöyle buyurmuştur: \"Maktulün kısas isteyen velilerinin, bundan vazgeçme hakları vardır. Bu, kadın bile olsa maktule yakınlık sırasına göredir.\" Ebû Davud şöyle dedi: Yani velilerden birisi oldukları zaman kadınların katildeki afları caiz­dir. Bana Ebû Ubeyd'in; \"ondan vazgeçmeleri\" sözü, \"kısastan vazgeç­meleri\" anlamına geldiği (ne dair açıklaması) ulaştı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4539,
			"arabicnumber": 4539,
			"text": "Tâvûs'tan (Rasûlullah fs.a.v) şöyle buyurmuştur): \"Biribirlerî ile ... bir ölü bulunsa...\" (diye) rivayet edilmiştir. İbn Ubyed ise: Rasûlullah (s.a.v) buyurdu ki: ... dedi. (Hadisin devamı Tâvûs'un ve İbn Ubeyd'in rivayetiyle şöyledir); \"Biribirleri ile taş kamçı ve sopalarla dövüşen bir topluluk içersinde kim tarafından ve nasıl öldürüldüğü bilinmeyen bir ölü bulunsa bu, hatâ (hükmünde) dir. Diyeti, hatâen öldürmenin diyetidir. (Bu durumda) teammüden öldürülen kişi içinse kısas gerekir.\" İbn Ubeyd (burada): \"Elin kısası\" dedi. Sonra râviler ittifak ederek şöyle dediler. (Rasûlullah devamla şöyle buyurdu): \"Her kim kısasa mâni olursa, Allah'ın lanet ve gazabı onun üzerine olsun. Ondan ne farz ne de nafile (yahut da; ne tevbe ne de fidye) kabul edilmesin.\" Sûfyân'ın (İbn Serh'in kendisinden rivayeti) hadisi daha tamdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4540,
			"arabicnumber": 4540,
			"text": "Bize Muhammed b. Ebî Ğalib haber verdi, bize Saîd b. Süleyman, Süleyman b. Kesir'den naklen haber verdi, bize Amr b. Dinar haber verdi. O Tavûs'tan, Tavus da İbn Abbas vasıtasıyla Rasûlullah'tan haber verdi (deyip); ravi Siifyân (4539.) hadisinin mânâsını zikretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4541,
			"arabicnumber": 4541,
			"text": "Amr b. Şuayb, babası vasıtasıyla dedesinden şöyle rivâyet etmiştir: Rasûlullah (s.a.v) hatâen öldürülenin diyetinin; otuz bintü mehaz (iki yaşına girmiş dişi deve) otuz binti lebûn (üç yaşına girmiş dişi deve), otuz hıkka (dört yaşına girmiş dişi deve) on da ibni lebûn (üç yaşına girmiş erkek deve) olmak üzere yüz deve olduğuna hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4542,
			"arabicnumber": 4542,
			"text": "Amr b. Şuayb, babası vasıtasıyla dedesinden şöyle rivayet etmiştir: Rasûlullah (s.a.v) devrinde diyetin (yüz devenin) kıymeti sekizyüz dinar altın veya sekiz bin dirhem gümüştü. Ehl-i kitab'ın diyeti de o zaman müslümanların diyetinin yarısı idi. Bu hal Ömer (r.a) halîfe oluncaya kadar devam etti. Hz. Ömer (halife olunca) ayağa kalkıp halka hitaben: \"Biliryorsunuz ki deve pahalandı...\" dedi. Ömer diyeti altın sahipleri için bin dinar, gümüş sahipleri için on iki bin dirhem, sığır sahipleri için iki yüz sığır, koyun sahipleri için iki bin koyun, elbise sahipleri için de iki yüz elbise olarak tesbit etti. Zimmîlerin diyetini olduğu gibi bıraktı, normal diyette yaptığı gibi onu yükseltmedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4543,
			"arabicnumber": 4543,
			"text": "Ata b. Ebî Rabâh'dan rivayet ettiğine göre; Rasûlullah (s.a.v) diyeti; deve sahiplerine yüz deve, sığır sahiplerine ikiyüz sığır, koyun sahiplerine ikibin koyun, elbise sahiplerine de iki yüz elbise olarak tâyin etti. Buğday sahiplerine de bir şey tâyin etti ama (rivayeti Atâ'dan aktaran) Muhammed (b. İshâk) onu aklında tutamadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4544,
			"arabicnumber": 4544,
			"text": "Atâ b. Ebî Rabah, Câbir b. Abdillah (r.a) den, şöyle dediğini rivayet etmiştir: \"Rasûlulîah (s.a.v) diyeti... takdir etti\" Râvî, (bir önceki 4543. hadisi Ebû Davud'a nakleden) Musa'nın (rivayet ettiği) hadisinin mislini zikretti ve: \"Buğday sahiplerine de birşey takdir etti, ama ben aklımda tutamadım\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4545,
			"arabicnumber": 4545,
			"text": "Abdullah b. Mes'ud (r.a) den; Rasûlullah (s.a.v) şöyle buyurmuştur: \"Hatâen öldürmenin diyeti; yirmi tane dört yaşına, yirmi tane beş yaşına, yirmi tane iki yaşma, yirmi tane üç yaşına girmiş dişi deve ve yirmi tane de iki yaşına girmiş erkek devedir.\" (Abdullah'ın görüşü de budur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4546,
			"arabicnumber": 4546,
			"text": "İbn Abbas (r.a) den rivayet edildi ki: Beni Adiy'den bir adam öldürüldü. Rasulullah (s.a.v) onun diyetini on iki bin dirhem takdir etti. Ebû Davııd dedi ki: Bu hadisi İbn Uyeyne Amr'dan o da İkrime vasıtasıyla Nebi s.a.v.'den rivayet etti, İbn Abbas'ı anmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4547,
			"arabicnumber": 4547,
			"text": "Abdullah b. Amr (r.a) den; Müsedded dedi ki- Rasûlullah (s.a.v) Fetih günü Mekke'de (halka) hitabetti. Üç kerre tekbir getirdi sonra \"Va'dini yerine getiren, kuluna yardım eden ve kâfirleri tek başına hezimete uğratan tek Allah'tan başka ilâh yoktur.\" ------------- Musannif hadisi. Müsedded ve Süleyman b. Harb'ien içilmiştir. Buradan itibaren musan­nifin belirteceği yere kadarki kısmı sadece Müsedded rivayet etmiştir. Bundan sonraki bölüm ise Müsedded'le Süleyman'ın müşterek rivayetidir. ------------- (Ebû Davud der ki): Buraya kadarını Müsedded'ten ezber ettim. Sonra ikisi de (yani hocaları Süleyman b. Harb ile Müsedded) ittifakla Rasûlullah'm şöyle buyurduğunu söylediler. \"Haberiniz olsun!.. Mal veya kandan, Câhiliyye devrinde anılıp zikredilen tüm övünme vesilesi olan şeyler ayaklarımın altındadır. Sadece Hacılara su vermek (sikâyetu'l-hac) ve Kabe hizmeti (Sidânetû'l-Beyf) bundan müstesnadır. \"Haberiniz olsun!.. Şüphesiz, kamçı ve sopa ile olan amde benzeyen hatâen öldürmenin diyeti yüz devedir. Bunlardan kırkının karınlarında yavruları olacaktır.\" Müsedded'in hadisi daha tamdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4548,
			"arabicnumber": 4548,
			"text": "Bize Musa b. İsmail haber verdi. Bize Vüheyb, Halid'den bu (4547.) hadisi aynı isnâd ve benzeri bir mânâ ile rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4549,
			"arabicnumber": 4549,
			"text": "Bize Müsedded haber verdi, bize Ali b. Zeyd'den naklen Abdulvâris haber verdi. Ali b. Zeyd, Kasım b. Rabîa vasıtasıyla İbn Ömer'den o da Rasûlullah (s.a.v) den önceki (4547.) hadisi aynı mânâda rivayet etti. Ravi şöyle dedi: \"Rasûlullah fs.a.v) feth günü -veya Mekke fethi günü- Beyt-i şerifin veya Kabe'nin- merdiven basamağında halka hitabetti.\" Ebû Davud der ki: Bu hadisi İbn Üyeyne de; Ali h. Zeyd'den. o Kasım b. Rabîa dan, o da İbn Ömer vasıtasıyla Rasûlullah (s.a.v) den rivayet etti. Ayrıca, Eyyûb es-Sahtiyânî, Kasım b. Rabîa vasıtasıyla Abdullah b. Amr'den Hâlid'in ha­disinin benzerini rivayet etti. Hammad b. Seleme de Ali b. Zeyd kanalıyla Ya'kub es-Sedûsî'den, o da Abdullah b. Amr vasıtasıyla Rasûlullah'dan rivayet etti. Zeyd ve Ebû Musa'nın sözleri, Rasûlullah'in hadisi ve Ömer (r.a) m haberi gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4550,
			"arabicnumber": 4550,
			"text": "Mücâhid'den; şöyle demiştir: \"Ömer (r.a) amde benzeyen öldürmede, otuz hıkka (dört yaşına girmiş dişi deve) otuz cezea (beş yaşına girmiş dişi deve) ve kırk da altı yaşı ile dokuz yaş arasında hâmile deve ile hükmetti.\" Sened: Mücâhid Hz. Ömer'den hadis duymamıştır. Onun için hadis munkatı’dır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4551,
			"arabicnumber": 4551,
			"text": "Âsim b. Damra, Hz. Ali (r.a) den, şöyle dediğini rivayet etmiştir: \"Amde benzeyen öldürmede diyet üç türde üçde bir orandadır: Bunlar; Otuz üç dört yaşına giren dişi deve, otuz dört de altı yaş ile dokuz yaş arasında dişi devedir. Bunların hepsi hamile olacaktır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4552,
			"arabicnumber": 4552,
			"text": "Abdullah (b. Mes'ud) (r.a) şöyle demiştir: Amde benzeyen öldürme(nin diyeti): Yirmibeş tane dört yaşına girmiş dişi deve, yirmibeş tane beş yaşına girmiş dişi deve, yirmibeş tane üç yaşına girmiş dişi deve, yirmibeş de iki yaşına girmiş dişi devedir. Hanefiler Abdullah b. Mes'ud'un bu haberi ile amel etmektedirler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4553,
			"arabicnumber": 4553,
			"text": "Asım b. Damra. Hz. Ali (r.a)'in şöyle dediğini rivayet etmiştir: Hatâen öldürmenin diyeti dört sınıftan dörtte birer oranladır; Yirmibeş tane dört yaşına girmiş dişi deve, yirmibeş tane beş yaşına girmiş dişi deve, yirmibeş tane üç yaşına girmiş dişi deve ve yirmibeş tane de iki yaşına girmiş dişi deve. Hanefiler hatâen öldürmede, metindeki dört .sınıflan ve bir de iki yaşma girmiş erkek deveden yirmişer adet diyet hükmederler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4554,
			"arabicnumber": 4554,
			"text": "Osman b. Affan ve Zeyd b. Sâbit'ten (Allah ikisinden de razı olsun) şöyle rivayet edilmiştir: Muğallezada (amde benzeyen öldürmede) diyet; kırk tane beş yaşına girmiş hamile deve, otuz tane dört yaşına girmiş dişi deve, otuz da üç yaşına girmiş dişi devedir. Hatâen öldürmede diyet de: Otuz tane dört yaşına girmiş dişi deve, otuz tane üç yaşına girmiş dişi deve, yirmi tane üç yaşına girmiş erkek deve, yirmi de iki yaşına girmiş dişi devedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4555,
			"arabicnumber": 4555,
			"text": "Sâid b. Müseyyeb, Zeyd b. Sâbit'ten muğallaza diyet (Şibh-i amd diyeti) konusunda rivayette bulundu ve önceki (4554.) haberin benzerini, her guruptan eşit miktarlarla rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4556,
			"arabicnumber": 4556,
			"text": "Ebû Musa (el-Eş'arî) (r.a) den; Rasûlullah fs.a.v) şöyle buyurmuştur: \"Parmaklar eşittir. (Onların) herbirinin (diyeti) onar devedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4557,
			"arabicnumber": 4557,
			"text": "Ebû Mûse'l-Eş'âri (r.a) den; Şöyle dedi: Rasûlullah (s.a.v): \"Parmaklar eşittir\" buyurdu. \"Onar onar mı?\" dedim. \"Evet\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4558,
			"arabicnumber": 4558,
			"text": "İbn Abbas (r.a) den; Rasûlullah (s.a.v); baş parmakla küçük parmağı kastederek; \"Bu ve bu eşittir\" buyurdu. Diğer tahric edenler: Buharî. diyât: Tirmizî, diyât; Nesâî, kasâme; İbn Mâce, diyet; Ahme b. Hanbel, 1,227, 339",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4559,
			"arabicnumber": 4559,
			"text": "İbn Abbas (r.a) dan; Rasûlullah (s.a.v) şöyle buyurmuştur: \"Parmaklar (in diyeti) eşittir. Dişler (in diyeti) eşittir. Ön diş ve azı dişi (n diyeti) eşittir. Şu ve şu (baş parmakla serçe parmak) eşittir.\" Ebû Davııd şöyle der: Bu hadisi Nadr b. Şumeyl Şubeden, Ahdüssamed'in (rivayetinin) ma­nâsıyla rivayet etti. Ebû Dâvûd dedi ki: Bize bunu Dârimi, Nadr (b. Şumeyl) den rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4560,
			"arabicnumber": 4560,
			"text": "İbn Abbas (r.a) dan: Rasûlullah (s.a.v): \"Dişler (in diyeti) eşittir, parmaklar (ın diyeti) eşittir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4561,
			"arabicnumber": 4561,
			"text": "İbn Abbas (r.a) den; şöyle demiştir: Rasûlullah (s.a.v) ellerin ve ayakların parmaklarını (n diyetlerini) eşit tuttu. Diğer tahric edenler: Buhari, diyât: Tirmizî, diyat; Nesâî. kasâme; İbn Mâce, diyât",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4562,
			"arabicnumber": 4562,
			"text": "Amr b. Şuayb, babası vasıtasıyla dedesinden şöyle rivayet etti: Rasûlullah (s.a.v) sırtını Ka'be'ye dayamış bir vaziyette irad buyurduğu hutbesinde: \"Parmaklarda onar (deve diyet) vardır\" buyurdu. Diğer tahric edenler: Nesâi, Kasâme; İbn Mace, diyet",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4563,
			"arabicnumber": 4563,
			"text": "Amr b. Şuayb, babası kanalıyla dedesinden, Rasûlullah (s.a.v) şöyle buyurmuştur: \"Dişlerde beşer (deve diyet) vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4564,
			"arabicnumber": 4564,
			"text": "Ebü Davud şöyle der: (Şu rivayeti) Şeyban'dan yazdığım kitabımda bulduğum halde kendisinden işitmedim. Onu bize güvenilir bir dostumuz olan Ebû Bekir haber verdi. O şöyle dedi: Bize Şeyban haber verdi, bize Muhammed -yani îbn Raşid- Süleyman'dan- yani İbn Musa'dan- haber verdi. O, Amr b. Şuayb'dan, Amr de babası vasıtasıyla dedesinden şöyle rivayet etti: \"Rasûlullah (s.â.v) hatâen öldürmenin diyetini köylülere dört yüz dinar altın veya ona mukabil gümüş olarak takdir ederdi. Onu takdir ederken deve fiyatlarını esas alırdı. Deve pahalanınca diyeti (altın ve gümüş olarak) artırır, ucuzladığında da azaltırdı. Rasûlullah zamanında (deve fiyatları) dört yüz dinarla sekizyüz dinar arasında oynuyordu. Onun gümüşten karşılığı da sekizbin dirhemdi. Rasûlullah (s.a.v) sığır sahiplerine (tam diyeti) ikiyüz sığır olarak takdir etti. Diyeti koyundan ödeyenler de iki bin koyun verirler. Rasûlullah (s.a.v.) \"Diyet, maktulün varisleri arasında, yakınlık derecesine göre mirastır. Artan olursa (farz sahiplerinden artarsa) o asabeye aittir.\" buyurdu. Rasûlullah (s.a.v) burunda; tamamı kesildiği zaman tam diyet, ucu veya bir tarafı kesildiğinde yarım diyet'e hükmetti ki o da; elli deve veya onun mukabili altın yahut gümüş yada yüz sığır veya bin koyundur. El kesildiğinde yarım diyete, ayak kesildiğinde yarım diyete me'mûme (et kesilip beyin ile kemik arasındaki zarı meydana çıkaran yaralama, buna âmme de denilir) de otuz üç tam ve üçte bir deve veya onun kıymetinde altın, gümüş, sığır yada koyuna, câife (karın boşluğuna kadar ulaşan yara) de de aynısına hükmetti. Parmaklarda herbir parmak için on deve, dişlerde de herbir diş için beş deve diyet vardır. Rasûlullah (s.a.v) kadın'ın diyetinin, (farz sahipleri olan) varislerinden artandan başka miras alamayan asabesi ayasında ortak olduğuna hükmetti. (Bir kadın bir cinayet işlerse, cinayet'in diyetini asabesi öder.) Eğer bir kadın öldürülürse onun diyeti varisleri arasında taksim edilir. Onlar, katillerini (kısas olarak) öldürür (Ölümünü isleyebilirler. Rasûlullah (s.a.v): \"Maktulün vârisi yoksa bile katil on (un mirasından veya diyetin) den birşey alamaz. Onun varisi, insanların kendisine en yakın olanıdır. Katil, (öldürdüğü kişiden) hiçbir şeye varis olamaz\" buyurdu. Muhammed (b. Raşid) şöyle dedi: Bunun tamamını bana Süleyman b. Musa Amr b. Şuayb'tan, o baba­sından o da kendi babası vasıtasıyla Rasûlullah'tan haber verdi. Ebû Davud der ki: Muhammed b. Raşid Dimeşk (Şam) lıdır. Katilden, Basraya kaçmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4565,
			"arabicnumber": 4565,
			"text": "Amr b. Şuayb, babası vasıtasıyla dedesinden, Rasûlullah (s.a.v)'in şöyle buyurduğunu rivayet etti: \"Amde benzeyen öldürmenin diyeti, teammüden öldürmenin diyeti gibi muğallaza (katı) dır. Onda, sahibi (katil) öldürülmez.\" (Ebû Davud şöyle) dedi: Halil bize İbn Raşid'den naklen, (Rasûîul-lah'in) şu sözleri (ni) de ilâve etti: \"Bu, şeytanın insanlar arasına sıçramasıdır. Hiçbir kin ve silah ol­madan körü körüne farkına varılmadan akan kandır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4566,
			"arabicnumber": 4566,
			"text": "Abdullah b. Amr (r.a) den; Rasûlullah (s.a.v) şöyle buyurmuştur: \"Mudıhalarda (kemiğe varan yaralarda) diyet beş devedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4567,
			"arabicnumber": 4567,
			"text": "Amr bin Şuayb babasından o da dedesinden naklen dediki: Rasulullah (s.a.v) Yerinden çıkmayan (ama görme hassasını kaybeden) gözde üçte bir diyete hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4568,
			"arabicnumber": 4568,
			"text": "Muğira b. Şû'be (r.a) den; şöyle demiştir: Hüzeyl kabilesinden bir adam'ın nikâhı altında iki kadın vardı. Bunlardan birisi öbürüne bir direk (kalın bir sopa) ile vurdu ve onu öldürdü. Taraflar mes'eleyi Rasûlullah'a getirdiler. Adamlardan birisi: \"Bağırmayan, yemeyen, içmeyen ve ağlamayan bir kimse (cenin) için nasıl olur da diyet öderiz?!..” dedi. Rasûlullah (s.a.v): \"Bedevilerin secîli konuşmaları gibi mi konuşuyorsun?!\" buyurup Gurreye hükmetti ve onu kadının âkılesine yükledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4569,
			"arabicnumber": 4569,
			"text": "Bize Osman b. Ebî Şeybe haber verdi, bize Cerir haber verdi. O, Mansûr'dan aynı isnâd ve mânâ ile nakledip şunu da ilâve etti. \"Rasûlullah (s.a.v), öldürülen kadının diyetini katilin âkilesine yükledi ve karnındaki cenin için de ğurre'ye hükmetti. Ebû Davud: \"Bu hadisi aynen bu şekilde Hakim, Mücâhid' den o da Muğira' dan rivayet etti\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4570,
			"arabicnumber": 4570,
			"text": "(Misver b. Mahreme'den; şöyle demiştir: Ömer fr.a) halkla, kadın'ın çocuk düşürmesi konusunu istişare etti. Muğira b. Şu'be: \"Rasûîullah'ın onun için ğurreye; bir köle veya cariyeye hükmettiğine şâhid oldum\" dedi. Ömer: \"Sana şahitlik edecek birisini getir\" dedi. Urve de Muhammed b. Mesleme'yi getirdi. Harun: \"Onun için- yani adam'ın karısının karnına vurduğuna-[tefsirdir] şâhitlik etti\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4571,
			"arabicnumber": 4571,
			"text": "Bize Mûsâ b. İsmail haber verdi, bize Vuheyb haber verdi. O, Hişâm'dan, Hişâm babasından, o Muğîra'dan Muğîra da Ömer (r.a) den (yukarıdaki (4570.) hadisi) mânâ olarak rivayet etti. Ebû Davud şöyle der: \"Bu hadisi, Hammad b. Zeyd ve Hammad b. Seleme Hişâm h. Urve'den, o babasından \"Ömer şöyle dedi...\" diye rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4572,
			"arabicnumber": 4572,
			"text": "İbn Abbas (r.a) dan rivayet edildi ki: Ömer (r.a) Rasûlullah (s.a.v)'in, cenin düşürme konusundaki hükmünü sordu. Hamel b. Mâlik b. Nâbiğa ayağa kalkıp: \"Ben iki kadın'ın arasındaydım; birisi öbürüne çadır direğıyle vurdu. Hem onu hem de karnındaki bebeği öldürdü. Rasûlullah (s.a.v) maktulün cenininde gurreye ve katil kadın'ın öldürülmesine hükmetti.\" Dedi. Ebû Davud şöyle der: Nadr b. Şûmeyl, \"Miştah; fırından ekmek çıkartılan kürektir\" dedi. Ebû Ubeyd ise: \"Mistah; çadır direklerinden birisidir\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4573,
			"arabicnumber": 4573,
			"text": "Tâvûs şöyle demiştir: \"Ömer (r.a) minbere çıktı...\" Ravi önceki (4572.) hadisi mânâ olarak anlattı, ama ondaki \"kadının öldürülmesine\" cümlesini zikretmedi. Gurre kelimesine \"bir köle veya câriye\" kelimelerini ilâve etti ve şöyle dedi: Ömer (r.a): \"Allahu Ekber. Eğer bunu duymasaydım, başka bir şeye hükmederdik\" dedi. Diğer tahric edenler: Nesâî, kasâme. Bu hadis munkatı'dır. Çünkü Tavus Ömer'den hadis işitmemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4574,
			"arabicnumber": 4574,
			"text": "İbn Abbas (r.a) dan; Hamel b. Mâlik kıssası hakkında şöyle dedi: \"Kadın, saçı bitmiş bir cenini düşürdü, (öbür) kadın öldü. Rasûlullah (s.a.v) katilin âkılesine diyeti hükmetti. Öldürülen kadının amcası: \"Yâ Rasûlellah! O, saçı bitmiş bir çocuğu düşürdü\" dedi. Bunun üzerine katilin babası: \"O yalancıdır. Vallahi o ses vermedi, yemedi, içmedi. Onun gibiler hederdir (karşılığı yoktur)\" dedi. Rasûlullah (s.a.v): \"Câhiliyye döneminin seçili sözleri ve kâhinlikleri gibi mi konuşuyorsun?!.. Çocuk için de gurre ver\" buyurdu. İbn Abbas: \"Kadınlardan birisinin adı Müleyke öbürünün adı Ümmü Gutayf ti\" der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4575,
			"arabicnumber": 4575,
			"text": "Câbir b. Abdillah (r.a) den; şöyle demiştir: Huzeyl kabilesinden iki kadından birisi öbürünü öldürdü. Her birinin kocası ve çocuğu vardı. Rasûlullah (s.a.v) öldürülen kadın'ın diyetini, öldürenin âkılesine yükledi. Kocasını ve oğlunu muaf tuttu. öldürülenin âkılesi: \"Onun mirası bizim mi?\" dediler. Rasûlullah (s.a.v): \"Hayır, onun mirası kocasının ve oğlunun olur\" buyurdu. Diğer tahric eden: İbn Mâce, diyet",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4576,
			"arabicnumber": 4576,
			"text": "Ebû Hureyre (r.a) den; şöyle demiştir: Huzeyl kabilesinden iki kadın dövüştüler. Birisi öbürüne bir taş atıp öldürdü. Taraflar meseleyi Rasûlullah'a getirdiler. Rasûlullah (s.a.v) ölen kadın'ın karnındaki bebeğinin diyetini bir köle veya cariye olarak gurre; kadının diyetini de, katilin âkılesine hükmetti. Öldürülen kadının mirasını oğluna ve onunla birlikte olanlara verdi. Bunun üzerine, Hamel b. Mâlik b. Nâbiğa el-Hûzelî: \"Yâ Rasûlellah! Yemeyen, içmeyen, konuşmayan, ağlamayan bir cenin'in diyetini nasıl öderim?! Böyleleri heder sayılır\" dedi. Rasûlullah (s.a.v): Onun seçili konuşmasından dolayı: \"Bu kâhinlerin kardeşlerindendir\" buyurdu. Diğer tahric edenler: Buharî, diyât; Müslim, kasâme; Nesâî, kasâme",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4577,
			"arabicnumber": 4577,
			"text": "Ebû Hureyre (r.a) bu (4576 daki) kıssa hakkında şöyle dedi: \"Sonra, aleyhine ğurre hükmedilen kadın öldü. Rasûlullah (s.a.v); onun mirasının oğullarına, diyetin de asabesine olduğuna hükmetti.\" Diğer tahric edenler: Buharî feraiz; Müslim, kasâme; Tirmizi, diyet; Nesâî, kasâme; Ahmed b. Hanbel, II, 539",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4578,
			"arabicnumber": 4578,
			"text": "Abdullah b. Büreyde, babasından şöyle rivayet etti: Bir kadın başka birisine taş atıp (karnındaki bebeği) düşürdü. Mesele Rasûlullah (s.a.v)'e arzedildi. Rasûlullah (s.a.v) çocuk için beşyüz koyun'a hükmetti ve o gün taş atmayı yasak etti. Ebû Davud şöyle der: Hadis böyle, \"beşyüz koyun\" şeklindedir. Ama doğrusuyuz koyundur. Abbas böyle (beşyüz koyun) dedi. O bir vehmdir. Diğer tahric eden: Nesâî, kasâme",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4579,
			"arabicnumber": 4579,
			"text": "Ebû Hureyre (r.a) den; şöyle demiştir: Rasûlullah (s.a.v) Cenin hakkında gurre; köle, cariye, at veya katır ile hükmetti. Ebû Davud şöyle der: Bu hadisi Hammad b. Seleme ve Halid b. Abdullah, Muhammed b. Amr'dan rivayet etmişler, \"at veya katır\" kelimelerini zikretmemişlerdir. Beyhaki de, at ve katır sözlerinin mahfuz olmadığını söyler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4580,
			"arabicnumber": 4580,
			"text": "Şâ'bî'den şöyle dediği rivayet edilmiştir: \"Gurre beşyüz dirhem gümüştür.\" Ebû Davud derki: Rabîa: \"Gurre elli dinar altındır\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4581,
			"arabicnumber": 4581,
			"text": "İbn Abbas (r.a) dan; şöyle demiştir: Rasûlullah (s.a.v) Öldürülen mükâteb'in diyeti konusunda hüküm verdi. Buna göre; mükâteb'e akdinden ötürü ödediği oranda hür diyeti, kalandan da köle diyeti ödenir. Diğer tahric edenler: Nesâî, kasâme; Ahme b. Hanbel I, 363",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4582,
			"arabicnumber": 4582,
			"text": "İbn Abbas (r.a) dan; Rasûlullah (s.a.v) şöyle buyurmuştur: \"Bir mükâteb diyeti hak ederse veya mirasa vâris olursa, hürriyetini elde ettiği oranda varis olur.\" Ebû Davud şöyle der: Bu hadisi, Vüheyb, Eyyüb'tan, o îkrime'den, o da Ali vasıtasıyla Rasû­lullah'tan rivayet etmiştir. Hammad h. Zeyd ve İsmail ise, Eyyüb'tan o da Ikrime tarikıyla Rasûlullah'tan mürsel olarak rivayet etmişlerdir. İsmail h. Uleyye bunu, İkrime'nin sözü kabul etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4583,
			"arabicnumber": 4583,
			"text": "Amr b. Şuayb, babası vasıtasıyla dedesinden Rasûlullah (s.a.v)'in şöyle buyurduğunu rivayet etmiştir: \"Muâhid (zimmî) in diyeti, hür (müslümanın) diyetinin yarısıdır.\" Ebû Davıtd şöyle der: Bu hadisin benzerini Üsâme b. Zeyd el-Leysî ve Abdurrahman b. Haris, Amr b. Şuayb'tan rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4584,
			"arabicnumber": 4584,
			"text": "Safvan b. Ya'Iâ, babası (Ya'lâ) dan, şöyle dediğini rivayet etmiştir: Benim işçim bir adamla dövüşüp elini ısırdı. Adam elini çekti ve işçinin ön dişi düştü. Adam Rasûlullah (s.a.v)'e geldi. Rasûlullah dişi heder etti (diyet takdir etmedi.) ve: \"Onunda elini senin ağzına koymasını ve senin onu erkek deve gibi kemirmeni mi istiyorsun?\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4585,
			"arabicnumber": 4585,
			"text": "Abdülmelik Atâ'dan, o da Ya'Iâ b. Ümeyye'den bu (4584.) hadisi rivayet etti ve şunu ilâve etti: Sonra (Rasûlullah s.a.v) ısırana: \"İstersen elini ağzına koy, o elini isırsin sonra ağzından çek\" buyurdu ve dişlerinin diyetini iptal etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4586,
			"arabicnumber": 4586,
			"text": "Amr b. Şuayb, babası kanalıyla dedesinden Rasûlullah (s.a.v)'in şöyle buyurduğunu rivayet etmiştir: \"Bir kimse, kendisinden tıp bilinmediği (ehil olmadığı) halde tabiplik yapmağa kalkar (ve hastaya zarar verir) sa, dâmindir.\" Nasr (b. Asım), Velîd b. Müslim'in; \"Bana İbn Cüreyc haber verdi\" dediğini söyler. Musannifin diğer üslûtlı Muhammed b. Sabbah; Velid'in; \"'İbn Cüreyc'den...\" diye rivâyet etmiştir. Ebû Davud: \"Bu hadisi Velîd'den başkası rivayet etmedi. Onun sahih olup olmadığını bilmiyoruz,\" dedi. Nesâî, kasâme; İbn Mâce, tıb",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4587,
			"arabicnumber": 4587,
			"text": "Abdûl-Aziz b. Ömer b. Abdil-Azîz şöyle dedi: Babama gelen heyetlerden birisi, Rasûlullah (s.a.v)'in şöyle buyurduğunu söyledi: \"Daha önceden tabiplik yaptığı bilinmeyen birisi bir kavme doktorluk yapmaya kalkar da hastaya zarar verirse damindir.\" Abdül-Aziz: \"Ama dikkat edilmeli ki o, tedaviyi tarifle değildir. O ancak damarları kesmek, yarayı yarmak ve yakmaktır\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4588,
			"arabicnumber": 4588,
			"text": "Abdullah b. Amr (r.a) den; Rasûlullah (s.a.v) -Müsedded; Mekke fethi günü hitabetti dedi- şöyle buyurdu: \"Haberiniz olsun! Mal veya kandan câhiliye döneminde anılıp zikredilen tüm övünme vesilesi olan şeyler ayaklarımın altındadır. Sadece, Sikayetu'l-hâc (hacılara su vermek) ve Sidânetu'I-Ka'be (Kabe hizmeti) bundan müstesnadır. Haberiniz olsun!.. Şüphesiz kamçı ve sopa ile olan amde benzeyen hatâen öldürmenin diyeti yüz devedir. Bunlardan kırkının karınlarında yavruları olacaktır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4589,
			"arabicnumber": 4589,
			"text": "Bize bu (4588.) hadisi aynı isnadla ve benzer mânâ ile Halid'den Mu­sa b. İsmail ve Vüheyb de haber verdiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4590,
			"arabicnumber": 4590,
			"text": "İmran b. Husayn (r.a) den rivayet edildi ki: Fakirlere ait bir köle, zengin birilerine ait bir kölenin kulağını kopardı. Bunun üzerine kulağı koparanın sahipleri Rasûlullah'a gelip: \"Ya Rasûlallah! biz fakir insanlarız\" dediler. Rasûlullah (s.a.v) de onlara hiçbir şey (ceza) yüklemedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4591,
			"arabicnumber": 4591,
			"text": "İbn Abbas (r.a) dan; Rasûlullah (s.a.v) şöyle buyurmuştur: \"Biribirleri ile taş ve kamçı ile dövüşen bir topluluk içersinde kim tarafından ve nasıl öldürüldüğü bilinmeyen bir ölü bulunsa, onun diyeti hatâen öldürmenin diyetidir. Teammüden öldürülen kişi için ellerinin kısas (için bağlanmas) ı vardır. Onunla kısas arasına giren Allah'ın, meleklerin ve bütün insanların lanetine uğrasın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4592,
			"arabicnumber": 4592,
			"text": "Ebu Hureyre (r.a) den; Rasûlullah (s.a.v): \"Ayak (ın tepip vurduğu) hederdir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4593,
			"arabicnumber": 4593,
			"text": "Ebû Hureyre (r.a) Rasûlullah (s.a.v)'den, şöyle buyurduğunu rivayet etmiştir: \"Hayvan'ın yaralaması hederdir. Mâden (de uğranılan zarar) hederdir. Kuyu (da uğranılan zarar) hederdir, Rikâz da beşte bir vardır.” Ebû Davud: Açma (hayvan); yanında kimse bulunmayan salıverilmiş başıboş hayvandır. Bu da gündüz olur, gece olmaz, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4594,
			"arabicnumber": 4594,
			"text": "Ebû Hureyre (r.a)'den; Rasûlullah (s.a.v); \"Ateş hederdir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4595,
			"arabicnumber": 4595,
			"text": "Enes b. Mâlik (r.a) den; şöyle demiştir: Enes b. Nadr'ın kızkardeşi Rubeyyi' bir kadın'ın ön dişini kırdı. Hep birlikte Rasûlullah'a geldiler. O da Allah'ın kitabı ile kısasa hükmetti. Enes b. Nadr: \"Seni hak ile gönderen Allah'a yemin ederim ki, bugün onun (kardeşimin) dişi kırılmaz\" dedi. Rasûlullah (s.a.v): \"Yâ Enes! Allah'ın kitabı (hükmü) kısastır\" buyurdu. Bilâhere dişi kırılan kadının tarafı diyete razı olup, aldılar. Rasûlullah (s.a.v) buna şaştı ve: \"Şüphesiz, Allah'ın kulları arasında öyleleri var ki Allah'a yemin etse onu yerine getirir\" buyurdu. Ebû Davud şöyle der: Ahmed b. Hanbel'den işittim ki; kendisine: \"diş­te nasıl kısas yapılır\" denilmiş o da \"törpülenir\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 102
			}
		}
	]
}