{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "Ebû Hureyre (r.a.)'den; demiştir ki: Resulullah (s.a.v.) vefat edip de ondan sonra Ebû Bekir (r.a.) halife seçildiği ve araplardan bazıları dinden döndüğü zaman Ömer b. Hattâb, Hbü Bekr'e: Resûllah (s.a.v.); \"İnsanlar, Allah'tan başka ilâh yoktur deyinceye kadar onlarla savaşmakla emrolundum. Kim \"Allah'tan başka ilâh yoktur\" derse, malım ve canını benden korumuş olur. Ancak İslâm'ın hakkı müstesna, Onun asıl hesabı ise Allah'a kalmıştır\" buyurduğu hâlde nasıl olur da sen insanlarla savaşırsın? dedi. Ebû Bekir: Allah'a yemin ederim ki namazla zekâtın arasını ayıranlarla mutlaka savaşacağım. Çünkü zekât, malî bir haktır. Allah'a yemin ederim ki, Resulullah (s.a.v.)'e vermiş oldukları bir (deve) yuları(nı) bile bana vermezlerse, vermemelerinden dolayı onlarla muhakkak 'savaşırım, dedi. Bunun üzerine Ömer b. Hattâb: Allah'a yemin ederim, iyice anladım ki Aziz ve celil olan Allah, Ebû Bekir'in gönlünü savaş için genişletmiş ve (yine) anladım ki, onun görüşü haktır, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "Yunus Zührî'den (bu 1556. hadisi) naklederken onun şöyle dediğim rivayet etmiştir: Ebû Bekir: İslâm'ın haklarından birisi de zekât vermektir dedi. Yine Yunus, Zührî'nin (\"anâk\" değil) \"İkâl\" dediğini haber vermiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "Ebû Saîd el-Hudrî (r.a.)den; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"Beşten az olan devede zekât yoktur. Beş ukiyye'den az olan \"gümüş\"de zekât yoktur. Beş veskten az olan (hurma, üzüm ve hububat) da zekât yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "Ebû Saîd el-Hudrî'nin merfu' olarak rivayet ettiğine göre, Nebi (s.a.v.): \"Beş vesk'ten az olan (hurma, üzüm ve hubûbat)da zekât yoktur.Bir vesk damgalanmış altmış sa'dır\" buyurmuştur. İbn Mâce, zekât; Dârimî, zekât; Ahmed b. Hanbel, 111-59. Ebu Davud dediki: Hadisin senedinde geçen Ebu'l-Bahteri, Ebu Saîd'den hadis duymamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "Muğîre (b. Mıksem)'den rivayet edildiğine göre İbrahim (en-Nehai) şöyle demiştir: Bir vesk, -Haccâc sa'ıyle- damgalanmış altmış sa'dır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "Habîb el-Mâlikî'den; demiştir ki: Bir adam, İmrân b. Husayn'a; Ya Ebâ'n-Necîd! Siz bize bir takım hadisler rivayet ediyorsunuz. (Halbuki) biz onlara Kur'ân'dan asıl bulamıyoruz? dedi. Bunun üzerine İmrân kızdı ve adama şöyle dedi: Her kırk dirhemde bir dirhem (zekât) olduğunu Kur'ân'da buldunuz mu? Her şu kadar koyundan bir koyun, her şu kadar deveden şu kadar deve (verileceğini) Kur'ân'da buldunuz mu? Adam: Hayır, dedi. İmrân: Kimden öğrendiniz bunları? Bizden öğrendiniz, biz de Resulullah (s.a.v.)'den öğrendik; ve buna benzer (daha bazı) şeyler söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "Semure b. Cündüb (r.a.)'ten; demiştir ki: İmdi şüphesiz Resûlullah (s.a.v.) satış için hazırladığımız (eşyâ)'dan zekât vermemizi emrederdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "Amr b. Şu'ayb'ın babası vasıtasıyla dedesinden rivayet ettiğine göre, Bir kadın, kızı ile beraber Resûlullah (s.a.v.)'e geldi. Kızının kolunda kalın iki tane altın bilezik vardı. Resûlullah (s.a.v.) kadına: \"Bunun zekâtını veriyor musun?\" buyurdu. Kadın: Hayır, dedi. Resûlullah (s.a.v.): \"Kıyamet gününde Allah'ın onların yerine sana ateşten iki bilezik taktırması hoşuna gider mi?\" deyince, kadın hemen onları çıkarıp Peygamber (s.a.v.)'e uzattı ve şöyle dedi: İkisi de aziz ve celil olan Allah'a ve Resulüne (ait)'dir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "Ümmü Seleme (r.anhâ)'dan; demiştir ki: Altından işlenmiş bir ziynet takınmıştım da: Ya Resûlullah! Bu, kenz midir? diye sordum. Resûlullah (s.a.v.): \"Bir şey zekâtı verilecek miktara ulaşır, zekâtı da verilirse, kenz değildir,\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "Abdullah b. Şeddâd b. el-Hâdî'den rivayet edildiğine göre o, şöyle demiştir: Nebi (s.a.v.)'in hanımı Âişe'nin huzuruna girdik. Âişe dedi ki: Resûlullah (s.a.v.) yanıma girdi. Eller (parmaklar)imde büyük gümüş yüzükler gördü de: \"Bu nedir? ya Âişe!\" dedi. Ben de: Onları senin için süsleneyim diye yaptım, ya Resûlullah! dedim. Resûlullah (S.A.V.): \"Onların zekâtını veriyor musun?\" diye sordu. Ben de: Hayır (dadim) veya Allah'ın dilediği bir şey söyledim. O da: \"O ateş(e girmen) için sana yeter\", buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "Ömer b. Ya'lâ bu hadisi yüzük (1565.) hadisi gibi anlatmıştır. Süfyân'a: Onun zekatını o (kadın) nasıl verir? denildi. O da: Onu başkasına ekler, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Hammâd (b. Seleme)'dan demiştir ki: Sümâme b. Abdullah b. Enes'ten, Ebû Bekr'in Enes'i zekât toplamak için gönderdiği zaman yazdığını ve üzerinde Resûlullah (s.a.v.)'in mührü olduğunu söylediği bir mektup aldım. O mektupta şunlar vardı: \"Bu, Allah'ın, Peygamberine emrettiği ve Resûlullah (s.a.v.)'in müslümanlara takdir ve tayin ettiği zekât farizası (hükümlerini beyân eden bir mektup)dur. Hangi müslümandan buna uygun olarak zekât istenirse, onu versin; kimden de ondan fazlası istenirse vermesin. Yirmi beş deveden aşağısında (zekât olarak) davar verilir. Her beş devede bir koyun verilir. Deve sayısı yirmi beşe ulaştığında otuz beşe ulaşıncaya kadar bir yaşını bitirip iki yaşına basmış bir dişi deve verilir. Eğer onların içinde bir yaşını bitirip iki yaşına basmış dişi deve yoksa iki yaşını bitirip üç yaşına basmış bir erkek deve . verilir. Otuz altıya ulaştığında kırk beşe kadar iki yaşını bitirip üç yaşına basmış bir dişi deve verilir. Kırk altıya ulaştığında altmışa kadar erkek deveye çekilen üç yaşını bitirip dört yaşına basmış dişi deve verilir. Altmış bire ulaştığında yetmiş beşe kadar dört yaşını bitirip beş yaşma basmış bir dişi deve verilir. Yetmiş altıya ulaştığında doksana kadar iki yaşını bitirip üç yaşına basmış iki dişi deve verilir. Doksan bire ulaştığında yüz yirmiye kadar erkek deveye çekilen üç yaşını bitirip dört yaşına basmış iki dişi deve verilir. Yüz yirmiden fazla olduğunda her kırk devede iki yaşını bitirip üç yaşına basmış bir dişi deve ve her elli devede üç yaşını bitirip dört yaşına basmış bir dişi deve verilir. Kimin yanındaki (develerin) zekâtı dört yaşını bitirip beş yaşına basmış bir dişi deveye ulaşır ve onun yanında bu yaşta bir devesi bulunmaz da üç yaşını bitirip dört yaşına basmış bir dişi deve bulunursa, o (mal sahibi)nden (zekât olarak) bu deve kabul edilir. Bir de (yaş farkının telâfisi için) yanında varsa onunla beraber iki koyun veya yirmi dirhem (gümüş) verir. Kimin yanındaki (develerin) zekâtı üç yaşını bitirip dört yaşına basmış bir dişi deveye ulaşır, yanında böyle bir devesi bulunmaz da dört yaşını bitirip beş yaşına basmış bir dişi devesi bulunursa, ondan o (deve) kabul edilir. Zekât memuru da ona ya yirmi dirhem (gümüş) ya da iki koyun verir. Kimin de (develerinin) zekâtı üç yaşını bitirip dört yaşına basmış bir dişi deveye ulaşır ve onun yanında böyle bir devesi bulunmaz da iki yaşını bitirip üç yaşına basmış bir dişi deve bulunursa, ondan o (deve) kabul edilir. Ebû Dâvud: \"buradan itibaren hadisi Musa'dan arzuladığım gibi zapt edemedim.\" dedi. Ve ayrıca yanında varsa onunla beraber iki koyun veya yirmi dirhem (gümüş) verir. Kimin (develerinin) zekâtı iki yaşım bitirip üç yaşına basmış bir dişi deveye ulaşır da yanında yalnız üç yaşını bitirip dört yaşına basmış bir dişi devesi bulunursa, ondan o deve kabul edilir. Ebû Dâvûd, \"hadisin buraya kadarını iyi zapt edemedim, sonrasını ise, iyi zapt ettim. \" dedi. Ve zekât memuru ona yirmi dirhem (gümüş) veya iki koyun verir. Kimin (develerinin) zekâtı iki yaşını bitirip üç yaşına basmış bir dişi deveye ulaşır da yanında yalnız bir yaşını bitirip iki yaşına basmış bir dişi devesi bulunursa, ondan o deve ile iki koyun veya yirmi dirhem kabul edilir. Kimin yanındaki (develerin) zekâtı, bir yaşını bitirip iki yaşına basmış bir dişi deveye ulaşırsa ve yanında yalnız iki yaşım bitirip üç yaşına basmış bir erkek devesi bulunursa ondan o (deve) kabul edilir. Onunla beraber başka bir şey (almak) yoktur. Kimin yanında yalnız dört devesi varsa onlara zekât yoktur. Ancak sahibi isterse (verebilir.) Otlaklarda beslenen davarda ise kırktan yüz yirmiye kadarında bir koyun, yüzyirmiden fazla olursa, iki yüze ulaşıncaya kadar iki koyun, ikiyüz birden üç yüze ulaşıncaya kadar üç koyun, üçyüzbirden fazla olduğunda her yüz koyunda bir koyun (zekât) vardır. Zekâtta ne yaşlı ne ayıplı davar ne de (koç ve teke gibi) döl hayvanı alınmaz. Ancak zekât memuru dilerse, bunları alabilir. Zekât (artar veya eksilir) korkusuyla mufterik (ayrı olan mal), bir araya toplatılmaz. Toplu olan (mal)da tefrik edilmez. İki halîtin (ortak) malından alınan zekât hususunda ikisi aralarında hisselerine göre hesaplaşırlar. Adamın otlaklarda beslenen koyunları kırka ulaşmıyorsa, onlarda (zekât olarak) hiçbir şey yoktur. Ancak sahibi isterse, verebilir. Gümüşte kırkta bir zekât vardır. Eğer gümüş yalnız yüz doksan (dirhem) ise, onda zekât yoktur. Ancak sahibi isterse verebilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "Salim, babasının şöyle dediğini rivayet etmiştir: Resûlullah (s.a.v.) zekât mektubunu yazdırdı ve vefat edene kadar onu zekât memurlarına vermeyip kılıcının yanında bıraktı. Ebû Bekir, vefat edene kadar onunla amel etti. Sonra da Ömer, vefat edene kadar onunla amel etti. o mektupta şunlar vardı: \"Beş devede bir koyun; on devede iki koyun, onbeş devede üç koyun, yirmide dört koyun (zekât) vardır. Yirmi beşten otuz beş .deveye kadar bir yaşını bitirip iki yaşına basmış bir dişi deve; otuz beşi bir tane geçerse, kırk beşe kadar iki yaşını bitirip üç yaşına basmış bir dişi deve; kırk beşi bir tane geçtiğinde altmışa kadar üç yaşını bitirip dört yaşına basmış bir dişi deve; altmışı bir tane geçtiğinde yetmiş beşe kadar dört yaşını bitirip beş yaşma basmış bir dişi deve; yetmiş beşi bir tane geçtiğinde doksana kadar iki yaşını bitirip üç yaşına basmış iki dişi deve; doksanı bir tane geçtiğinde yüz yirmiye kadar üç yaşını bitirip dört yaşına basmış iki dişi deve (zekât)vardır. Eğer develer bundan da fazla olursa, her elli (deve) de üç yaşını bitirip dört yaşına basmış bir dişi deve ve her kırkta iki yaşını bitirip üç yaşına basmış bir dişi deve (zekât) vardır. Davarda kırk koyundan yüz yirmiye kadar bir koyun, yüz yirmiden bir tane fazla olunca iki yüze kadar iki koyun, İki yüzden bir tane fazla olursa, üç yüze kadar üç koyun (zekât) vardır. Davar, bundan da fazla olursa, her yüz koyunda bir koyun (zekât) vardır. Yüze varmadıkça,zekâtı yoktur. Zekât (artar veya eksilir) korkusuya toplu olan (mal), ayrılmaz, ayrı olan da bir araya toplatılmaz. İki halitin (ortak) malından alınan zekât hususunda ikisi aralarında hisselerine göre hesaplaşırlar. Zekâtta ne yaşlı ne de ayıplı (hayvan) alınmaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "Muhammed. b. Yezid el-Vâsıtî demiştir ki; Süfyan b. Hüseyn, (1568 ile) aynı senetle aynı manayı bize naklederek; \"bir yaşını bitirip iki yaşına basmış dişi deve yoksa, iki yaşını bitirip üç yaşına basmış erkek deve (verilir)\" dedi. Muhammed b. Yezid, Zührî'nin (sürünün üç'e taksim edileceği ile ilgili) sözünü de zikretmedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "Yûnus b. Yezid İbn Şihâb'(ez-Zührî)'dan şöyle dediğini rivayet eder: Bu, Resûlullah (s.a.v.)'ın zekât hakkında yazdırdığı mektubun bir nüshasıdır ki, (O'nun aslı) Ömer b. Hattâb ailesinin yanındadır. İbn Şihâb (devam ederek): Onu bana Salim b. Abdullah b. Ömer okuttu da olduğu gibi hepsini belledim. O, Ömer b. Abdülaziz'in Abdullah b. Abdul­lah b. Ömer'le Salim b. Abdullah b. Ömer'den nakledilmesini emrettiği nüshadır, dedi ve hadisi nakledip (devamında): \"Develer, yüz yirmi bir olduğunda yüz yirmi dokuza ulaşıncaya kadar iki yaşını bitirip üç yaşına basmış üç dişi deve (zekâtı) vardır. Yüz otuz olduğunda yüz otuz dokuza varıncaya kadar iki yaşını bitirip üç yaşına basmış iki dişi deve ile üç yaşını bitirip dört yaşına basmış bir dişi deve (zekâtı) vardır. Yüz kırk olduğunda yüz kırk dokuza varıncaya kadar üç yaşını bitirip dört yaşına basmış iki dişi deve ile iki yaşını bitirip üç yaşına basmış bir dişi deve (zekâtı) vardır. Yüz elli olduğunda yüz elli dokuca kadar üç yaşını bitirip dört yaşına basmış üç dişi deve (zekâtı) vardır. Yüz altmış olduğunda yüz altmış dokuza varıncaya kadar iki yaşını bitirip üç yaşına basmış dört dişi deve (zekâtı) vardır. Yüz yetmiş olduğunda yüz yetmiş dokuza ulaşıncaya kadar iki yaşını bitirip üç yaşına basmış üç dişi deve ile üç yaşım bitirip dört yaşına basmış bir dişi deve (zekâtı) vardır. Yük seksen olduğunda yüz seksen dokuza ulaşıncaya kadar üç yaşını bitirip dört yaşına basmış iki dişi deve ile iki yaşını bitirip üç yaşına basmış iki dişi deve (zekâtı) vardır. Yüz doksan olduğunda yüz doksan dokuza ulaşıncaya kadar üç yaşını bitirip dört yaşına basmış üç dişi deve ile iki yaşını bitirip üç yaşına basmış bir dişi deve (zekâtı) vardır. İki yüz olduğunda üç yaşını bitirip dört yaşına basmış dört dişi deve veya iki yaşını bitirip üç yaşına basmış beş dişi deve (zekâtı) vardır. (Ey zekât memuru) bu iki şeyden hangisini bulursan alırsın. Otlaklarda yayılan davarda ise...\" dedi ve (Yunus b. Yezid) Süfyan b. Hüseyin'in (rivayet ettiği) hadisinin benzerini nakletti. Onda şu vardı: \"Zekâtta ne yaşlı ne ayıplı ne de (koç ve teke gibi) döl hayvanı alınmaz. Ancak zekât memuru dilerse, alabilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "Mâlik dedi ki: Ömer b. Hattâb'ın; \"ayrı olan (mal) bir araya toplatılmaz toplu olan da, ayrılmaz\"' sözünün anlamı şudur: Her adamın kırk koyunu olup da zekât memurunun gelmesi yaklaştığında onlarda yalnız bir koyun (zekât vâcib) olsun diye onları bir araya toplarlar. \"Toplu olan ayrılmaz\" (sözünün anlamı) ise, iki halîtten her birinin yüz bir koyunu olduğunda onlarda ikisinin üzerine üç koyun (zekât vâcib) olur. Zekât memurunun onlara gelmesi yaklaştığında ikisi koyunlarını ayırırlar. Böylece ikisinden her birine yalnız bir koyun (zekât vâcib) olur. Bu konuda, duydu­ğum budur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "Ali (r.a.)'den şöyle rivayet edilmiştir. (Râvi) Züheyr der ki: Zannederim o da onu Peygamber (s.a.v.)'den rivayet etmiş şöyle demiştir: \"(Gümüşten) kırkta birleri (zekât olarak) veriniz, her kırk dirhemden bir dirhem, iki yüz dirheme varmadıkça sizin üzerinize (zekât olarak) hiçbir şey yoktur. İki yüz dirhem olduğunda beş dirhem (zekâtı) vardır. (Bundan) fazlası hesabına göredir. Davarda her kırk koyunda bir koyun (zekat) vardır. Yalnız otuz dokuz koyun(un) varsa, senin üzerine onda (zekat olarak) hiçbirşey yoktur\" (deyip Ebû İshâk) davarın zekâtım Zührî gibi nakletti ve; \"Sığırda her otuz (tane) de bir yaşını bitirip iki yaşına basmış bir erkek sığır (zekât) vardır. Kırk (sığır)da ise, iki yaşını bitirip üç yaşına basmış bir dişi sığır (zekât) vardır. Avâmil olan (çalıştırılan)lara (zekât olarak) bir şey yoktur. Develerde ise..\" deyip onların zekâtını Zührî'nin zikrettiği gibi nakletti ve; \"Yirmi beş devede beş koyun, (zekât) vardır. (Bundan) bir tane fazla olursa, otuz beşe kadarı için bir yaşını bitirip iki 'yaşına basmış bir dişi deve (zekât) vardır. Eğer bir yaşını bitirip iki yaşına basmış dişi deve olmazsa iki yaşını bitirip üç yaşına basmış bir erkek deve (verilir.) Bundan bir tane fazla olunca kırk beşe kadar iki yaşını bitirip üç yaşına basmış bir dişi deve (zekât) vardır. Bir tane fazla olunca altmışa kadar onda erkek deveye çekilobileri üç yaşını bitirip dört yaşına basmış bir dişi deve (zekât) vardır\" dedi. Sonra da Zührî'nin hadisinin benzerini nakletti ve: \"Bir tane fazla yani doksan bir olunca yüz yirmiye kadar onda erkek deve e çekilebilen üç yaşını bitirip dört yaşına basmış iki dişi deve (zekât) vardır. Şayet develer bundan çok olursa, her elli devede üç yaşını bitirip dört yaşına basmış bir dişi deve (zekât) vardır. Zekât (artar veya eksilir) korkusuyla toplu olan (mal) ayrılmaz. Ayrı olan da bir araya toplatılmaz. Zekâtta ne yaşlı ne ayıplı ne de döl hayvanı alınmaz. Ancak zekât memuru dilerse (alabilir.) Irmakların suladıkları veya yağmurun suladığı bitkilerde öşür vardır. Büyük kovalarla sulananlarda ise, öşrün yarısı vardır.\" Âsim ve el-Hâris'in hadisinde suda vardır: \"Zekât, her sene (vâcib)dir\" Züheyr dedi ki: \"Zannederim (Ebû İshak \"zekât\" her sene) bir defa (vâcibtir)\" dedi. Âsım'ın hadisinde şu vardı: \"Develerin arasında ne bir yaşını bitirip iki yaşına basmış dişi deve ne de iki yaşını bitirip üç yaşına basmış erkek deve olmadığı zaman on dirhem (gümüş) veya iki koyun (verilir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "Ali (r.a.), Peygamber (s.a.v.)'den (bir önceki 1572.) hadisin baş tarafını rivayet etmiş ve şöyle demiştir: \"İki yüz dirhemin olup da üzerinden bir yıl geçmişse, onda beş dirhem (zekât) vardır. Yirmi dinarın olmadıkça senin üzerine -altında- (zekât olarak) bir şey yoktur. Yirmi dinarın olup da üzerinden bir sene geçerse onda yarım dinar (zekât) vardır. Fazlası(nın zekâtı), hesabına göredir.\" (Râvi) Ebû İshâk dedi ki: \"Hesabına göredir\" sözünü Ali mi söylüyor, yoksa onu Peygamber (s.a.v.)'e mi isnad etti, bilmiyorum. \" Üzerinden bir yıl geçmedikçe hiçbir malda (zekât) yoktur.\" İbn Vehb dedi ki: Ancak (şu kadar var ki) Cerîr, Peygamber (s.a.v.)'den rivayet edilen (bu) hadise \"üzerinden bir yi! geçmedikçe hiçbir malda (zekât) yoktur.\" (cümlesini de) ekliyor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "Ali (r.a.)'den; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"At ve köle zekâtından (sizi) affettim. Binaenaleyh gümüşün zekâtını veriniz. Her kırk dirhemden bir dirhem, yüz doksan dirhemde (zekât olarak) bir şey yoktur. İki yüze ulaşınca onda beş dirhem (zekât) vardır.\" Tirmizi, zekât; Nesâî, zekât; İbn Mâce, zekât; Muvaatta, zekât, cihad; Ahmed b. Hanbel, 1-18, 92, 113, 121, 132, 145. Ebû Davûd dedi ki: Bu hadis-i şerifi -Ebû Avane'nin dediği gibi- A'meş, Ebû İshak'tan rivayet etmiştir. Şeybân, Ebu Muâviye ile İbrahim b. Tahmân da onun benzerini Ebû İshak'tan, o da el-Hâris'ten, O'da Ali'den, O'da Peygamber (s.a.v.)'den rivayet et­mişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "Behz b. Hakîm'in, dedesinden rivayet ettiğine göre, Resûlullah (s.a.v.) şöyle buyurmuştur: \"Kırlarda otlayarak beslenen her kırk devede iki yaşını bitirip üç yaşına basmış bir dişi deve (zekât) vardır. (Ortak) develerin hesabı ayrı yapılmaz. Zekâtı, kim sevap umarak verirse.\" İbn el-Alâ; \"karşılığında sevab umarak” diye söyledi: \"O'na sevabı vardır. Kim de onu vermezse Azîz ve celîl olan Rabbimizin haklarından bir hak olarak onu ve malının yarısını muhakkak alırız. Muhammed (s.a.v.) soyuna ondan bir şey yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "Ebû Vâil, Müâz'dan rivayet ettiğine göre, Nebi (s.a.v.) Onu Yemen'e (vali olarak) göndereceği zaman, \"her otuz sığırdan bir yaşını bitirip iki yaşına basmış bîr erkek veya dişi sığır, her kırk sığırdan da iki yaşını bitirip üç yaşına basmış bir dişi sığır ve her baliğ yani bulûğ çağına erenden bir dinar veya onun değerinde Me'âfir (elbisesi) almasını\" emretmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "Mesrûk, Mu'âz'dan, O'da Peygamber (s.a.v.)'den (bir önceki 1576. hadisin) benzerini rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "Mesrûk'un Muâz b. Cebel'den rivayet ettiğine göre, \"Nebi (s.a.v.) O'nu Yemen'e gönderdi...\" deyip (daha önce geçen 1576. hadisin) benzerini zikretti. (Râvî, Süfyân) Ne \"Yemen'deki elbiselerine de \"yani bulûğ çağına eren\" sözünü zikretmedi. Ebû Dâvud dedi ki: \"Bu hadisi Cerir, Ya'la, Ma'mer, Şu'be, Ebû Avâne ve Yahya b. Saîd, A'meş'ten, O'da Ebû Vâil'den, O'da Mesrûk'tan; Ya'lâ ve Ma'mer Muâz'dan\" diyerek benzerini rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "Meysere, Ebû Salih'ten, O'da Süveyd b. Gâfele'den rivayet ettiğine göre, Süveyd (ya) \"ben gittim\" dedi ya da şöyle söyledi: \"Bana Peygamber (s.a.v.)'in zekât memuruyla giden bir kişi haber verdi. Resûlullah (s.a.v.)'in (zekât) mektubunda şu vardı. \"Süt emen (veya sütlü) hayvanı alma, ayrı olan (mallar)ı bir araya toplama, toplu olanı da birbirinden ayırma\" Davar, subaşına geldiği zaman zekât memuru da gelir ve (sahiplerine): \"Mallarınızın zekâtlarını ödeyin\" derdi. (Süveyd veya zekât memuruyla giden kişi söze devam ederek) dedi ki: \"Onlardan biri Kevmâ' olan bir dişi deveyi vermek istedi. Hilâl b. Habbâb (Meysere'ye) dedi ki: Ey Ebâ Salih! Kevmâ nedir? dedim. O'da. Hörgücü büyük olan (deve)dir, dedi. Zekât memuru onu kabul etmedi. Mal sahibi: Develerimin iyisini almanı arzuluyorum, dedi. Zekât memuru onu da kabul etmedi. Mal sahibi (değerce) ondan düşük olan bir diğer deveyi onun için yularladı (ve öne sürdü), onu da kabul etmedi. Sonra (değerce) ondan daha düşük olan bir diğerini yularladı da onu kabul etti ve şöyle dedi: Ben bunu alıyorum. Ama yine de Resûlullah (s.a.v.)'in, \"Gittin de adamın en iyi devesini aldın\" deyip bana kızmasından korkarım. Nesâî, zekât, Ahmed b. Hanbel, IV-315; Ebu Davud dedi ki: Bunun benzerini Huşeym, Hilal b. Hab-bâb'tan rivayet etmiştir. Ancak şu var ki (\"ayırma\" kelimesi yeri­ne) \"ayırmasın\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "Süveyd b. Gafele'den; demiştir ki: Peygamber (s.a.v.)'in zekât memuru bize geldi, onun elini tuttum (onunla tokalaştım) ve onun (zekât) mektubunda şunu okudum: \"Zekât (artar veya eksilir) korkusuyla ayrı olan (mallar) biraraya toplatılmaz, toplu olan (mal) da ayırılmaz\" (Ama Râvi Ebû Leylâ el-Kindî) \"Süt emen (veya sütlü) hayvan\" sözünü zikretmedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "Müslim b. Sefine el-Yeşkurî'den... (Ebû Davud'un hocası) el-Hasen dedi ki: \"Râvh ise (Müslim b. Sefine yerine) Müslim b. Şu'be, diyor.\" dedi ki: Nâfi' b. Alkame, babamı kavminin reisliğine tayin etti de onların zekâtlarını toplamasını emretti. Bunun üzerine babam beni onlardan bir gruba gön4erdi. Ben de Sa'r denen bir ihtiyara geldim: Babam beni sana zekâtını almam için gönderdi dedim. O'da: Yeğenim, (hangisini) nasıl alıyorsunuz? dedi. Ben: Koyunların memelerini araştırıp yokladıktan sonra iyisini seçer alırız, dedim. O'da: Yeğenim! Sana anlatayım! Ben Resûlullah (s.a.v.) zamanında şu vadilerden bir vadide koyunlarımın başında idim. Deve üzerinde iki adam geldi ve bana: Koyunlarının zekâtını ödemen için biz Resûlullah (s.a.v.)'in sana (gönderilmiş) elçileriyiz, dediler. Ne vermem gerekir? dedim. Bir koyun, dediler. Bunun üzerine, iyi süt ve yağ dolu olduğunu bildiğim bir koyuna yöneldim ve hemen onu (tutup) onlara getirdim. Bu kuzusu olan bir koyundur. Halbuki Resûlullah (s.a.v.) kuzusu olan koyunu almamızı yasakladı, dediler. Peki nasıl-birşey alırsınız? dedim. Takriben bir yaşındaki dişi oğlak veya bir yaşını bitirip iki yaşına basmış davar, dediler. Ben de Mu'tât bir dişi oğlağa yönelip -Mu'tât : Doğurma çağı geldiği halde doğurmayan hayvandır onu (tutarak) kendilerine getirdim. Ver dediler ve onu (alıp) yanlarına devenin üzerine koydular. Sonra da gittiler. Nesâî, zekât Ebu Davud dediki: Bu hadisi Ebu Asim, Zekeriyya'dan riva­yet etti ve Ravh'ın dediği gibi o da \"Müslim b. Şu'be\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "Bize Muhammed b. Yûnus en-Nesaî rivâyet etti (dedi ki:) Bize Ravh rivâyet etti (dedi ki:) Bize Zekeriyya b. İshak, bu hadisi aynı senetle’'Müslim b. Şu'be\" diye nakletti ve; Şâfi', karnında yavrusu olan (hayvan) dır.\" dedi. Dâvûd buyurdu ki: Humus'ta Amr b. el-Hâris el-Himsî ailesinin yanındaki Abdullah b. Salim'in -Zübeydî'den rivâyet ettiği- mektubunda şöyle dediğini okudum: Yahya b. Câbir, Cübeyr b. Nüfeyr'den naklen rivâyet etti. O'da \" Kays Gâdırâs-ı\" kabilesinden olan Abdullah b. Muâviye el-Gâdırı'den şöyle dediğini rivâyet etmiştir. Peygamber (sallallahü aleyhi ve sellem): Üç şey var ki onları yapan kimse, imanın tadını (lezzetini) tadmış (almış) olur. Kişinin tek olan Allah'a kulluk edip de O'ndan başka ilâh olmadığına inanması, gönül hoşnutluğuyla malının zekâtım seve seve her sene vermesi, ne yaşlı, ne uyuzlu, ne hasta ve ne de âdî olan (hayvanı zekât olarak) vermemesidir. (Zekâtınızı) mallarınızın orta hallisinden (verin). Zira Allah, sizden malınızın iyisini istememiş ve âdisini de (vermenizi) emretmemiştir.\" sitte müelliflerinden sadece Ebû Dâvûd rivâyet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "Ubey b. Ka'b (r.a.)dan; demiştir ki: Resûlullah (s.a.v.) beni zekât memuru olarak gönderdi de (develeri olan) bir adama uğradım. Malını benim için biraraya toplayınca o malda ona ancak bir yaşını bitirip iki yaşına basmış bir dişi deve (zekât vâcib) olduğu kanaatine vardım. Bunun üzerine ona: (Zekât olarak) bir yaşını bitirip iki yaşına basmış bir dişi deve ver, dedim. Onun ne sütü var ne de (taşımaya elverişli olan bir) sırtı. Ama bu genç biri ve semiz bir dişi devedir. Binaenaleyh bunu al, dedi. Ona: Emr olunmadığım şeyi almam. İşte Resûlullah (s.a.v.) yakınında. Ona gidip bana takdim ettiğini O'na takdim etmeyi arzu edersen bunu yap! Eğer O, senden bunu kabul ederse, ben de ederim. Şayet kabul etmezse, ben de kabul etmem, dedim. Tamam, yaparım dedi. Hemen bana takdim ettiği deveyi getirdi ve benimle beraber çıkıp Resûlullah (s.a.v.)'a geldik. O'na: Ey Allah'ın Peygamberi Malımın zekâtını benden almak için bana (şu) elçin geldi. -Allah'a yemin ederim ki, daha önce ne Resûlullah (s.a.v.) ne de onun elçisi benim malımın arasında bulunmadı (malımı görmedi)- Malımı onun için bir araya topladım da onda benim üzerime (vâcib) olan şeyin, bir yaşını bitirip iki yaşına basmış bir dişi deve olduğunu söyledi. Halbuki onun ne sütü var ne de (taşımaya elverişli olan bir) sırtı. Alması için ona iri ve genç bir dişi deveyi takdim ettim de bende.n almadı. İşte o (takdim ettiğim deve) budur. O'nu sana getirdim ya Resûlullah (buyurun) al, dedi. Resûlullah (s.a.v.) O'na: \"Sana (vâcib) olan odur. Ama (ondan daha) iyisini tatavvu olarak verirsen, Allah sana onun sevabını verir. Biz de onu senden kabul ederiz,\" buyurdu. O'da: İşte o, budur ya Resûlullah! Onu sana getirdim (buyrun) al, dedi. Bunun üzerine Resûlullah (s.a.v.) de onun teslim alınmasını emretti ve o adama malının bereketi (çoğalması) için duâ etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "İbn Abbâs (r.a.)'dan rivayet edildiğine göre, Resûlullah (s.a.v.) Muâz'ı Yemen'e gönderirken ona şöyle buyurdu: \"Şüphesiz sen, ehl-i kitap olan bir kavme gidiyorsun. Onları Allah'tan başka ilâh olmadığına ve benim de Allah'ın Resulü olduğuma şehâdet etmeye davet et. Eğer onlar bunda sana itaat ederlerse, Allah'ın onlara her gün ve gecede beş vakit namaz farz kıldığını kendilerine bildir. Eğer onlar bunda da sana itaat ederlerse, Allah'ın onlara mallarında zenginlerinden alınıp da fakirlerine verilen zekâtı farz kıldığını kendilerine bildir. Şayet onlar bunda da sana itaat ederlerse, mallarının iyilerini almaktan sakın. Mazlumun bedduasından da korun. Çünkü onunla Allah arasında hiçbir perde yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "Enes b, Mâlik'den rivayet edildiğine göre, Resûlullah (s.a.v.) şöyle buyurmuştur: \"Zekâtta haksız davranan, onu vermeyen gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "Beşîr b. el-Hasâsiyye'den; İbn Ubeyd kendi hadisinde \"Onun adı (aslında Beşir değildi. Resûlullah (s.a.v.) ona Beşir adını verdi der. Rivayet edildiğine göre O, şöyle demiştir: Biz (Resûlullah (s.a.v.)'a: Zekât memurları (vâcibten fazla zekât almakla) bize haksızlık ediyorlar. Bundan dolayı onların bize yaptıkları haksızlık kadarını mallarımızdan gizleyebilir miyiz? dedik. O' (s.a.v.) da: \"Hayır\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "Ma'mer (b. Râşid) bir önceki (1586.) hadisi Eyyûb'dan aynı isnâd ve mana ile rîvâyet etmiştir. Ancak o (şöyle demiştir): (Beşir) dedi ki: \"Ya Resûlullah, şüphesiz zekât memurları (haksızlık yapıyorlar)...\" dedik. Sadece Ebû Dâvûd rivayet etmiştir. Ebu Davud dediki: Abdurrezzak onu Ma'mer'den merfu ola­rak rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "Abdurrahman b. Câbir b. Atık, babası (Câbir b. Atik)'den rivayet ettiğine göre, Resûlullah (s.a.v.) şöyle buyurmuştur: \"(Tarafınızdan kendilerine) buğzedilen binittiler yakında size gelecek. Size geldiklerinde onlara \"hoş geldiniz\" deyin ve kendilerini almak istedikleri şeylerle başbaşa bırakın. Şayet âdil davranırlarsa, kendi lehlerinedir; zulmederlerse, kendi aleyhlerinedir. Onları memnun edin. Zira zekât (sevabı)nızın tam oluşu, onların rızası (nı almanıza bağlı)dır. Onlar da size dua etsinler. Beyhaki, es-Sünnenu'l-kübrâ, IV, 114 Ebu Davud dediki: Ebu'l-Gusn, Sabit b. Kays b. Gusn'dur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "Cerîr b. Abdullah (r.a.)'dan; demiştir ki: Resûlullah (s.a.v.)'e -bedevilerden- bir takım insanlar gelerek: Zekât memurlarından bazı kimseler bize gelip zulmediyorlar, dediler. O (s.a.v.) da: \"Zekât memurlarınızı memnun edin\" buyurdu. Ya Resûlullah! Bize zulmetseler de mi? dediler. (Tekrar:) \"Zekât memurlarınızı memnun edin\" buyurdu. (Râvi) Osman: \"... (Zanmnızca) zulmedüirseniz de\" sözünü ilâve etmiştir. Ebû Kâmil, hadisinde dedi ki: Cerîr, \"bunu Resûlullah (s.a.v.)'dan işittikten sonra hiç bir zekât memuru benden memnun olmadan ayrılmamıştır\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "Abdullah b. Ebû Evfâ (r.a)'dan; demiştir ki: Babam (Rıdvan) ağacı altında (bey'atta) bulunanlardandı. Bir topluluk zekâtını Resûlullah (s.a.v.)'e getirdiklerinde; \"Allah'ım! Falan aileye rahmet ve mağfiret et\" buyurdu. Babam da O'na zekâtım getirdi de Resûlullah (s.a.v.): \"Allah'ım Ebû Evfâ ailesine rahmet ve mağfiret eyle\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "Amr b. Şuayb, babası vasıtasıyla dedesinden rivayet ettiğine göre, Nebi (s.a.v.) şöyle buyurmuştur: \"(Malı) getirtmek de yok, uzaklaştırmak da yok. (Mal sahiblerinin) zekâtları ancak meskenlerinde alınır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "Muhammed b. İshâk'tan \"(malı) getirtmek de yoktur, uzaklaştırmak da\" sözü(nün anlamı) hakkında onun şöyle dediği rivayet edilmiştir: Hayvanların zekâtı bulundukları yerlerde alınır. Zekât memuruna getirilmez. \"Uzaklaştırmak da yok\" (sözü) de yine bu su­retledir ki, sahipleri hayvanları uzaklaştırmamalı. İbn İshâk (devamla) diyor ki; zekât memuru mal sahiplerinin bulundukları yerlerden uzakta olup mallar ona getirilmemeli zekât­ları mal sahibinin bulunduğu yerde alınmalıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "Abdullah b. Ömer (r.a)'dan rivayet edildiğine göre, Ömer b. el-Hattâb (r.a.) bir atını Allah yolunda tasadduk etmiş sonra onu satılırken görmüş de onu satın almak istemiş. Resûlullah (s.a.v.)'e onu sormuş, Resûlullah (s.a.v.): \"Onu satın alma, sadakana da dönme*' buyurmuş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (s.a.v.) şöyle buyurmuştur: \"Kölenin fıtır sadakası hariç, at ve kölede zekât yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "Ebû Hureyre'den rivayet edildiğine göre, Resûlullah (s.a.v.): \"Müslümana kölesinden ve atından dolayı zekât yoktur\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "Salim b. Abdullah, babası Abdullah'ın şöyle dediğini rivayet etmiştir:.Resûlullah (s.a.v.); \"Yağmur, nehirler ve pınarların suladığı veya ba'l olanda (yani sulanmayıp, damarları ile yer altından su emenlerde) öşür vardır. Kovalarla veya deve ile sulananda yarım öşür ardır\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": 1597,
			"text": "Câbir b. Abdullah (r.a.)'tan rivayet edildiğine göre, Resûlullah (s.a.v.) şöyle buyurmuştur: \"Nehirlerle pınarların suladığı mahsullerde öşür, kova (veya hayvanlarla sulananlarda da yarım öşür vardır)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "Vekî' demiştir ki: Ba'l yağmur suyundan biten bir bitkidir. (Ravî) İbnül-Esved de: Yahya b. Âdem'in; \"Ebu İyâs el-Esedî'ye \"ba'l'ı sordum da \"yağmur suyu ile sulanandır, dedi\" dediğini haber verdi. en-Nadr b. Şumeyl \"ba'l, yağmur suyudur,\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "Muâz b. Cebel (r.a.)'den rivayet edildiğine göre, Resûlullah (s.a.v.) onu Yemen'e gönderdiği zaman ona şöyle demiştir. \"(Zekât olarak) hububattan hububat, davardan koyun veya keçi, develerden deve ve sığırlardan sığır al.\" İbn Mâce, zekât; Hâkim, el-Müstedrek, I, 388; Dârekutnî, es-Sünen, II, 100. Ebû Dâvûd dedi ki: Mısır'da bir acûr'u karışladım, on üç karış geldi. Bir de devenin üzerinde ikiye bölünmüş ve iki denk olarak yüklenmiş bir ağaç kavunu gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "Amr b.Şu'ayb, babası vasıtasıyla dedesinin şöyle dediğini rivayet etti: Mut'ân oğullarından olan Hilâl, Resûlullah (s.a.v.)'e arılarının (bal'ının) öşrünü getirdi ve Selebe denen vadiyi kendisine koru olarak tahsis etmesini istedi. Resûlullah (s.a.v.)da o vadiyi ona koru olarak tahsis etti. Ömer b. el-Hattâb halife olunca, Süfyan b. Vehb Ömer b. el-Hattâb'a o vadinin durumunu sormak için mektup yazdı. Ömer de (cevaben) şunları yazdı: \"Resûlullah (s.a.v.)'e arılarının (balının) öşrünü ödediği gibi sana da öderse, Selebe'yi ona koru olarak tahsis et! Aksi takdirde o (arılar), yağmur(la biten bitkilerden geçinen) sinek gibi (sahipsiz)dir. İsteyen onların balını yer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "Abdurrahman b. el-Hâris el-Mahzûmî; \"Babam bana Amr b. Şuayb'dan o da babası vasıtasıyla dedesinden; Şebâbe'nin, Fehm kabilesinin bir kolu olduğunu rivayet etti\" dedi ve bir önceki (1600.) hadisin benzerini zikretti. Ayrıca dedi ki: \"Her on tulumdan bir tulum (zekât verilecek)\" bir de (Süfyan b. Vehb yerine) Süfyan b. Abdillah es-Sakafî, dedi. \"(Ömer bi el-Hattâb) onlara iki vadi himaye ediyordu\" dedi ve şunu ilâve etti: \"Resûlullah (s.a.v.)'e ödediklerini Ömer b. el-Hattâb'a ödediler. O da onlara o iki vadilerini himaye etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "Usâme b. Zeyd'in Amr b. Şuayb'dan, O'nun da babası vasıtasıyla dedesinden rivayet ettiğine göre \"Fehm kabilesinden bir kol...\" (Usâme b. Zeyd bunu bir önceki 1601.) el-Muğîre'nin (Abdurrahman b. el-Hâris'ten rivayet ettiği hadisin) mânâsında (rivayet etti) ve dedi ki: \"On tulumdan bir tulum (zekât verilecek)\" bir de \"onlara iki vadiyi (himaye ediyordu)\" dedi",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "Attâb b. Esîc'den; demiştir ki: Resûlullah (s.a.v.) ağaçtaki hurma tahmin edildiği gibi asmadaki üzümün de tahmin edilmesini ve ağaçtaki hurmanın zekâtı kuru hurma olarak alındığı gibi üzümün zekâtının da kuru üzüm olarak alınmasını emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "Muhammed b. Salih et-Temmâr, İbn Şihâb'dan aynı senet ve mana ile (bir önceki 1603. hadisi ) rivayet etti. Ebû Dâvûd dedi ki: Saîd (b. el-Museyyeb) Attâb'dan herhangi bir şey duymamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "Abdurrahman b. Mesûd'dan; demiştir ki: Sehl b. Ebî Hasme meclisimize geldi ve şöyle dedi: Resûlullah (s.a.v.) bize şunu emretti: \"(Ağaçlardaki meyvelerin miktarını) takdir ettiğiniz zaman (olgunlaştıktan sonra onları) toplayın ve üçte birini bırakın. Eğer üçte birini bırakmazsanız veya (onu bırakmayı uygun) bulamazsanız, dörtte birini bırakın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "Âişe (r.a.)'den; Hayber'in durumunu anlatırken şöyle demiştir: Resûlullah (s.a.v.) Abdullah b. Revâha'yı yahudüere gönderirdi de o, hurma olgunlaşınca ondan yenmeden önce miktarını tahmin ederdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "Ebu Ümâme b. Sehl, babasının şöyle dediğini haber vermiştir: Resûlullah (s.a.v.) zekâtta âdi ve ufak hurmaların alınmasını yasakladı. Zührî dedi ki: Peygamber (s.a.v.)'in yasakladığı bu hurmalar Medine hurmasının iki çeşididir. Ebû Dâvûd dedi ki: Bu hadisi Ebu'l-Velîd, Süleyman b. Kesir -Zuhri senediyle merfu' olarak rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "Avf b. Mâlik'ten; demiştir ki: Resûlullah (s.a.v.) elinde bir asâ ile yanımıza mescide girdi. Bizden bir adam (zekât olarak getirdiği) âdi bir kuru hurma salkımı asmıştı. Resûlullah (s.a.v.) asâ ile hurma salkımını dürttü ve şöyle buyurdu: ''Bu zekâtın sahibi dileseydi, bundan iyisini zekât olarak verebilirdi. Bu zekâtın sahibi kıyamet günü âdi kuru hurma yiyecektir.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "İbn Abbâs (r.a.)'dan; demiştir ki: Resûlullah (s.a.v.) fıtır sadakasını oruçluyu faydasız ve müstehcen söz ve fiillerden temizleyici, fakirlere de yiyecek olmak üzere farz kıldı. Kim onu bayram namazından önce verirse, o kabul olunmuş bir zekâttır. Kim de onu bayram namazından sonra verirse, o sadakalardan bir sadakadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "İbn Ömer (r.a.) den; demiştir ki: Resûlullah (s.a.v.) bize fıtır sadakasının, halk bayram namazına çıkmadan önce verilmesini emretti. Nâfi' dedi ki: İbn Ömer onu bayramdan bir veya iki gün önce verirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "İbn Ömer (r.a.)'den rivayet edildiğine göre, Resûlullah (s.a) fıtır sadakasını farz kıldı... Abdullah b. Mesleme, Mâlik'den kıraat yoluyla aldığı rivayette şöyle dedi: \"Fıtır sadakası Ramazanda müslümanlardan her hür veya köle, erkek veya kadın üzerine bir sâ' kuru hurma veya bir sâ' arpadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "Abdullah b. Ömer'den demiştir ki: Resûlullah (s.a.v.) fıtır sadakasını bir sâ' olarak farz kıldı. (Râvi) Ömer b.Nâfi', Mâlik'in (rivayet ettiği bir önceki 1611. hadisin) mânâsını zikretti ve \"küçüğe ve büyüğe\" (sözüyle) \"halk bayram namazına çıkmadan önce verilmesini emretti\" (sözünü) ilâve etti. Ebû Dâvûd dedi ki: Abdullah el-Umerî'nin Nâfi'den yaptığı rivayette \"her müslümana\" demiştir. Said el-Cümehî'nin Ubeydullah'tan, O'nun da Nâfi'den yaptığı rivayette ise Nafi' \"müslümanlardan\" demiştir. Ubeydullah'tan meşhur olan rivayette \"müslümanlardan\" (sözü) yoktur. Bu Hadis-i şerif’i Ebu Davud dışında şu kitaplarda tahric etti: Buhari, zekât; Müslim, zekât; Nesaî, zekât",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "Abdullah b. Ömer'den rivayet edildiğine göre; Resûlullah (s.a.v.) fıtır sadakasını küçüğe, büyüğe, hür ve köleye arpa ve kuru hurmadan bir sâ'olarak farz kılmıştır. (Râvî) Musa (b. İsmail, buna) \"erkeğe ve kadına\" kelimelerini ilâve etti. Ebû Dâvûd dedi ki: Eyyûb ve Abdullah el-Umerî de Nâfi'den rivayet ettikleri bu hadiste * 'erkeğe ve kadına\" (sözünü/zikrettiler. Bu Hadis-i şerif’i Ebu Davud dışında şu kitaplarda tahric etti: Buhârî, zekât; Müslim, zekât)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "Abdullah b. Ömer'den; demiştir ki: Halk, Resülullah (s.a.v.) zamanında fıtır sadakasını arpa, kuru hurma, Peygamber arpası ve kuru üzümden bir sâ' olarak verirlerdi. Nâfi' dedi ki: Abdullah b. Ömer: \"Ömer, (Halife) olup buğday çoğalınca yarım sâ' buğdayı o şeylerden bir sâ yerine (bedel) kıldı\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "Nâfi'den; demiştir ki Abdullah b. Ömer: \"Halk, daha sonra yarım sâ' buğdayı (o şeylerden bir sa'a) denk tuttular\" dedi. Nâfi' dedi ki: Abdullah b. Ömer kuru hurma verirdi. Bir sene (beliren hurma kıtlığından dolayı) Medine'liler kuru hurma bulamadılar da arpa verdiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "Ebû Saidi'l-Hudrî (r.a.)den; demiştir ki: Resûlullah (s,a.) aramızda iken biz fıtır sadakasını her küçük, büyük hür ve köle için yiyecekten bir sâ' veya keşten bir sâ' yahut arpadan bir sâ' ya da kuru hurmadan bir sâ veya kuru üzümden bir sâ' olarak verirdik. Bunu (halife) Muâviye hac veya umre yapmak için (Medine'ye) gelip de minberden halka konuşma yapıncaya kadar böyle vermeye devam ettik. Onun halka yaptığı konuşmada şu söz de vardı: Ben, şam buğdayından iki müddün, bir sâ' kuru hurmaya denk olduğu görüşündeyim. Bunun üzerine halk, bunu (esas) aldı. Ebû Said dedi ki: Bana gelince yaşadığım müddetçe (hayatımın) sonuna kadar onu (eskisi gibi) vermeye devam edeceğim. Buhârî, zekât; Müslim, zekât; Tirmizî, zekât; Nesaî, zekât; îbn Mace, zekât; Ahmed b. Hanbel, 111-23. Ebu Davud dediki: Bu hadisi İbn Uleyye, Abde ve başkaları İbn İshak'tan, o da Abdullah b. Abdullah b. Osman b. Hâkim b. Hizam'dan, o da İyaz'dan, O da Ebû Said'den aynı ma’na da rivayet etti. Ve onda bir adam İbn Uleyye'den yaptığı rivayette: \"veya bir sa* buğday\" (sözünü) söyledi ki o söz, mahfuz değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "Müsedded'in İsmail'den yaptığı rivayette \"buğday\" sözü edilmedi. Ebu Dâvûd dedi ki: Muâviye b. Hişam bu hadisin -Sevrî'den o da Zeyd b. Eslem 'den, o da îyad'dan o da Ebû Said'den yaptığı rivâyetinde (\"yiyecekten bir sâ\" yerine) \"buğdaydan yarım sâ\" (sözünü) zikretti. Halbuki bu söz, Muâviye b. Hişam'dan veya ondan rivayet edenden (meydana gelen) bir hatadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "İyad (b. Abdillah) dedi ki: Ebû Saîd el-Hudrî'yi şöyle derken işittim: Ben asla bir sâ' 'dan başkasını vermem. Zira Resulullah (s.a.v.) zamanında biz kuru hurma veya arpa veya keş veya kuru üzümden bir sâ' verirdik. Bu, Yahya'nın hadisidir. Süfyan b. Uyeyne ise, (yaptığı rivayette bu sayılanlara) \"veya undan bir sâ\" sözünü ilâve etti. Hâmid b. Yahya dedi ki: (Muhaddisler) bu ilâveden dolayı Süfyan'ı kınadılar da ondan vazgeçti. Ebû Dâvûd dedi ki: Bu ilâve, îbn Uyeyne'nin hatasıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "Abdullah b. Sa'lebe veya Sa'lebe b. Abdullah b. Ebî Suayr, babasının şöyle dediğini rivayet etmiştir. Resûlullah (s.a.v.) şöyle buyurdu: \"(Fıtır sadakası) küçük veya büyük, hür veya köle, erkek veya kadın her iki kişiye buğdaydan bir sâ'dır. (Fıtır sadakası veren) zengininizi Allah (günahlardan arıtıp malını) temizler. Fakirinize gelince de (fıtır sadakası olarak) verdiğinden Allah, ona daha fazlasını verir.\" Süleyman (b. Dâvûd) hadisinde, \"zengin veya fakır\" sözünü ilâve etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "Abdullah b. Sa'lebe b. Suayr, babasından rivayet ettiğine göre babası şöyle demiştir: Resûlullah (s.a.v.) ayakta hutbe okudu da fıtır sadakasının her şahıs için bir sâ' hurma veya bir sâ' arpa verilmesini emretti. Ali b. Hasan, hadisinde \"veya iki kişi için bir sâ buğday\" (sözünü) ilâve etti. Sonra (Ali b. Hasan ile Muhammed b. Yahya) \"her küçük ve büyük, hür ve köle için... (verilmesini emretti)\" sözünde ittifak ettiler. Bu hadis’i şunlar da tahric etti: Dârekutnî, es-Sünen, II, 148; Hâkim, el-Müstedrek, III, 279",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "Abdullah b. Sa'lebe el-Uzrî şöyle demiştir: Resûlullah (s.a.v.) Ramazan bayramından iki gün önce halka hitap etti. Ahmed b. Salih diyor ki: Sonra râvi bir önceki (1620 nolu) el-Mukrî hadisinin mânâsım rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "Hasan el-Basrî'den; demiştir ki: İbn Abbâs bir Ramazanın sonunda Basra minberinden hutbe okudu da; \"Orucunuzun sadakasını veriniz,\" dedi. Sanki halk daha önce (bunu) bilmiyordu. Sonra İbn Abbas: \"Burada Medine halkından kimler var? Kalkınız kardeşlerinize (fıtır sadakasını) öğretiniz. Çünkü onlar Resûlullah (s.a.v.)'in bu sadakayı her hür veya köleye erkek veya kadına, küçük veya büyüğe kuru hurma veya arpadan bir sâ', buğdaydan da yarım sâ' olarak farz kıldığını bilmiyorlar\" dedi. Ali, (Basra'ya) gelip de fiyatların ucuzluğunu görünce: \"Allah size (nimetini) bollaştırdı. Artık fıtır sadakasını her şeyden bir sâ yapsanız\" dedi. Hümeyd dedi ki: Hasan' el-Basrî fıtır sadakasının sadece oruç tutanlara gerektiği görüşündeydi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "Ebu Hureyre (r.a.)'den; demiştir ki: Nebi (s.a.v.) Ömer b. el-Hattâb'ı zekât toplamaya gönderdi de İbn Cemil, Hâlid b. el-Velid ve el-Abbas (zekat) vermediler. Bunun üzerine Resûlullah (s.a.v.): \"-İbn Cemîl, fakirdi de Allah onu zengin ettiği için zekâtını vermiyor (nankörlük ediyor), Halid b. el-Velîd'e gelince, siz Halid'e zulmediyorsunuz. O zırhlarını ve harp aletlerini Allah yoluna vakfetti. Resûlulah (s.a.v.)'in amcası el-Abbâs ise, onun zekâtı ve bir misli bana aittir\" buyurdu. Sonra (sözüne devamla): \"Adamın amcasının, babası gibi olduğunu bilmez misin?\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "Ali (r.a.)'den rivayet edildiğine göre Abbâs (r.a.), zekâtın vaktinden önce verilmesini Peygamber (s.a.v.)'e sordu da Resûlullah (s.a.v.) ona bu hususta ruhsat verdi, -bir rivayette- Ali, \"ona bu hususta izin verdi\" dedi. Ebû Dâvûd dedi ki: Bu hadisi Hüşeym, Mansur b. Zâzân'dan, O'da Hakem'den, o da el-Hasan b. Müslim'den, o da Peygamber (s.a.v.)'den rivayet etmiştir. Hüşeym'in hadisi daha sahihtir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "İmrân b. Husayn'ın azatlısı İbrahim b. Atâ, babasından rivayet ettiğine göre, Ziyad veya emirlerden birisi, İmrân b. Husayn'ı zekât toplamaya gönderdi de dönünce İmrân'a: (Topladığın) mal nerede? diye sordu. O da: Beni mal (getirmek) için mi gönderdin? Biz onu Resûlullah (s.a.v.) zamanında aldığımız yerlerde aldık ve yine Resûlullah (s.a.v.) zamanında bıraktığımız yerlere bıraktık, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "Abdullah (b. Mesûd (r.a.) )'dan; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"Kendisine yetecek malı olduğu halde dilenen kimsenin (aldığı şeyler) kıyamet gününde yüzünde tırmık izi ve yara olarak gelir.\" Ya Resûlullah! Zenginliğin ölçüsü nedir? diye soruldu. Resûlullah (s.a.v.): \"Elli dirhem gümüş veya bunun değerinde altın\" buyurdu. (Râvi) Yahya (b. Âdem) dedi ki: Abdullah b. Osman, Süfyan'a: \"Hatırladığıma göre Şu'be, Hakim b. Cübeyr'den (hadis) rivayet etmez\" dedi. Süfyân da: \"Bu hadisi bize Muhammed b. Abdirrahman b. Yezid'den, Zübeyd rivayet etti\" cevabını verdi. Diğer tahric: Tirmizî, zekât; Nesaî, zekât; İbn Mâce, zekât; Ahmed, b. Hanbel, ı, 388, 441; IV-181",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "Atâ b. Yesâr, Esed oğullarından bir adamın şöyle dediğini rivayet etmiştir: Ben ve ailem Bakî el-Garkad'a inmiştik. Ailem bana: \"Resûlullah (s.a.v.)'e git de ondan yiyecek bir şey iste\" dedi ve ihtiyaçlarını saymaya başladı. Bunun üzerine Resûlullah (s.a.v.)'e gittim. Yanında kendisinden (bir şeyler) isteyen bir adam gördüm. Resûlullah (s.a.v.), ona: \"Sana verecek bir şey bulamıyorum\" diyordu. Bunun üzerine şöyle söyleyerek kızgın bir halde döndü. Hayatıma yemin ederim ki sen, dilediklerine veriyorsun. Resûlullah (s.a.v.): \"Ona verecek bir şey bulamadığım için bana kızıyor. Sizden biriniz bir okiyye gümüşü veya bu değerde malı olduğu halde dilenirse, haddi aşarak dilenmiş olur\" buyurdu. Esed'li (adam devamla) şöyle dedi: Kendi kendime, sütlü devemiz bir okiyyeden daha değerlidir, dedim ve hiçbir şey istemeden geri döndüm. Bir okiyye, kırk dirhem gümüştür.Ondan sonra Resûlullah (s.a.v.)'e arpa ve kuru üzüm geldi de Aziz ve Celîl olan Allah, bizi zengin edene kadar gelenlerden Resûlullah (s.a.v.) bize pay ayırdı. Ebû Dâvûd dedi ki: Mâlik'in dediği gibi, (Süfyan) Sevrî de bu hadisi böyle rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "Ebü Saidi'l-Hudrî'den; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"Kim bir okiyye değerinde malı olduğu halde dilenirse haddi aşmış olur.” Bunun üzerine kendi kendime; Yakute adlı dişi devem bir okiyyeden daha değerlidir, dedim. (Hadisin râvilerinden olan) Hişâm, \"bir okiyyeden daha değerlidir\" sözü yerine \"kırk dirhemden daha değerlidir\" dedi- ve ondan hiçbir şey istemeden geri döndüm. Hişâm, rivayetinde buna \"Resûlullah (s.a.v.) zamanında bir okiyye, kırk dirhemdi.\" sözünü ilâve etti. Nesâî, zekât; Ahmed b. Hanbel III, 7, 9; IV, 36; V, 430",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "Sehl b. el-Hanzeliyye'den; demiştir ki: Uyeyne b. Hısn ile el-Akra b. Habis Resûlullah (s.a.v.)'e geldiler ve ondan (bir şeyler) istediler. Bunun üzerine Resûlullah (s.a.v.) onlara istedikleri şeylerin verilmesini emretti. Muâviye'ye (onlara istedikleri şeylerin verilmesi için oturdukları yerlerin zekât memurlarına yazmasını) emretti. O da onlara istedikleri şeyleri yazdı. Akra mektubunu aldı, sarığının içine sardı ve gitti. Uyeyne ise, mektubunu aldı, Resûlullah (s.a.v.)'in yanına geldi ve (kendi kendine) dedi ki: \"Ya Muhammed ! Benim, Mütelemmis'in sayfası (mektubu) gibi içinde ne olduğunu bilmediğim bir mektubu, kavmime götüreceğimi mi zannediyorsun?\" Bunun üzerine Muaviye, onun bu sözünü Resûlullah (s.a.v.)'e haber verdi, Resûlullah (s.a.v.): \"Kimin yanında kendisine yetecek malı olduğu halde dilenirse, kendisini ateşe götürecek şeyi çoğaltmış olur\" buyurdu. Nüfeylî bir diğer rivayette (\"ateş\" sözü yerine) \"cehennemin kor ateşi\", dedi, Ordakiler: Ya Resûlullah! Kişiye yetecek malın miktarı nedir? dediler. -Nufeylî bir diğer rivayette, bunun yerine \"varlığıyla beraber dilenmek uygun olmayan zenginliğin miktarı nedir? dedi. \"Ona öğle ve akşam yemeğinde yetecek miktardır\" buyurdu. Nufeylî bir diğer rivayette bunun yerine, \"Onu bir gün bir gece veya bir gece bir gün doyuracak yiyeceğinin olmasıdır\" dedi ve bize bunu zikredilen bu sözlerle kısa olarak rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "Ziyâd b. el-Hâris es-Sudâî'den; demiştir ki: Resûlullah (s.a.v.)'e geldim ve ona bey'at ettim. Uzun bir hadis zikretti. (Bu arada şunları söyledi): \"... Resûllah (s.a.v.)'e bir adam geldi ve \"bana zekât ver\" dedi. Resûlulîah (s.a.v.)' ona: \"Yüce Allah zekât (taksimi) hususunda ne bir peygamberin ne de başkasının hükmüne razı olmadı ki, onunla ilgili hükmü kendisi verdi, onu sekiz sınıfa taksim etti. Eğer o sınıflardan isen sana hakkını veririm.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "Ebû Hureyre (r.a.)'den; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"Miskin, bir iki hurma veya bir-iki lokma ile geri çevrilen (dilenci) değildir. (Asıl) Miskin, insanlardan bir şey istemeyen ve onlar tarafından hali bilinmediği için kendisine (bir şey) verilmeyen kimsedir.\" Diğer tahric: Buhari, zekât; Müslim, zekât; Nesaî, zekât; Ahmed b. Hanbel, I, 384, 446; II, 260, 316, 445, 506",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "Ebû Hureyre'den, demiştir ki: Resûlullah (s.a.v.) (bir önceki 1631. hadisin) benzerini buyurdu. (Ebû Seleme devamla dedi ki:) \"Miskin, utanıp istemeyen ve muhtaç olduğu bilinmediği için kendisine sadaka verilmeyen kimsedir. İşte o (âyette sözü edilip de sadakadan) mahrum olandır\". Müsedded rivayet ettiği hadiste buna, \"Kendisine yetecek malı olmayan\" sözünü ilâve etti. Ancak \"utanıp istemeyen\" sözünü söylemedi. Ebu Davud dediki: Muhammed b. Sevr ile Abdurrezzak bu hadisi Ma'mer'den rivayet ettiler ve \"Mahrum\" sözünü Zührî'nin sözü saydılar ki, bu daha doğrudur. Diğer tahric: Nesai, zekat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "Ubeydullah b. Adiyy b. el-Hıyâr'dan rivayet edildiğine göre şöyle demiştir: İki adam bana bildirdiklerine göre, Veda haccında zekât taksim ederken Peygamber (s.a.v.)'e gelmişler ve o zekâttan kendileri de istemişler. (O iki adam dedi ki:) Bunun üzerine Resûlullah (s.a.v.) gözlerini kaldırıp bize baktı ve indirdi, bizi güçlü-kuvvetli gördü: “Dilerseniz size de veririm. Ancak zengin ile kazanabildi güçlünün bunda hakkı yoktur,\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "Abdullah b. Amr'dan rivayet edildiğine göre, Nebi (s.a.v.) şöyle buyurmuştur: \"Zengin'e, kuvvetli ve sağlam olana zekâl (almak) helâl olmaz.\" Tirmizî, zekât; Nesâî, zekât; İbn Mâce, zekât; Ahmed b. Hanbel, II, 164, 192, 377; V, 375; Dârimî, zekât; Darekutnî, es-Sünen, II, 118; Hâkim, el-Müstedrek, I, 407. Ebu Davud dediki: Süfyan bunu Said b. İbrahim'den İbra­him'in dediği gibi rivayet etti. Şu'be, de bunu Saîd'den rivayet etti. Ancak \"kuvvetli ve sağlam\" yerine \"kuvvetli ve güçlü\" dedi. Nebi (s.a.v.)'den (bu konuda) rivayet edilen diğer hadisle­rin bir kısmı \"kuvvetli ve güçlü\" diğer bir kısmı da \"kuvvetli ve sağlam\" şeklindedir. Ata b. Züheyr, Abdullah b. Amr'ia karşılaştığını ve (Abdul­lah'ın) \"zekât (almak) kuvvetliye de sağlam olana da helâl olmaz\" dediğini söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "Atâ b. Yesâr'dan rivayet edildiğine göre, Resûlullah (s.a.v.) şöyle buyurmuştur: \"Şu beş kişinin dışında hiçbir zengine zekât (almak) helâl değildir. Allah yolunda cihâd eden zekât memuru, (müslümanların arasını bulmak için) borçlanan, zekât malını kendi malı (parası) ile satın alan kişi ve fakir komşunun kendisine verilen zekatı hediye ettiği (zengin) kişi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "Ebû Said el-Hudrî'den \"Resûlullah (s.a.v.) şöyle buyurdu\" dediği ve önceki (1635.) hadisi zikrettiği rivayet edilmiştir. İbn Mace, zekât; Ahmed b. Hanbel, III, 56. Ebu Davud dediki: Onu İbn Uyeyne de Zeyd'den Malik'in rivayeti gibi rivayet etmiştir. Sevri onu Zeyd'den rivayet etmiş, Zeyd şöyle demiştir: Güveni­lir bir kişi\"[Yani Atâ b. Yesar.] bana Nebi (s.a.v.)'den şunu rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "Ebû Said'den; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"Zengine zekât helâl değildir. Ancak Allah yolunda (cihâd eden) yolcu veya kendisine zekât verilip de onu sana (zengin olduğun halde) hediye eden veya seni ona davet eden fakir komşun (un sana ikram ettiği helâl olur.) Ahmed b. Hanbel, III, 97. Ebu Davud dediki: Firas ile İbn Ebi Leyla Atiyye'den o da Ebu Saîd'den O'da Nebi (s.ajden benzerini rivayet etmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "Buşeyr b. Yesâr'dan rivayet edildiğine göre; Ensârdan Sehl b. Ebî Hasme denilen biri \"Peygamber (s.a.v.)'in Hayber'de öldürülen Ensarî'nin diyeti olarak kendi kavmine zekât develerinden yüz tane verdiğini\" haber vermiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "Semure r.a. Nebi sallallahu aleyhi ve sellem’den şöyle demiştir: \"Dilenmeler, tırmalamalardır, kişi onlarla yüzünde iz yapar. Dileyen yüzünü korur dileyen de korumaz. Ancak kişinin yetki sahibinden veya kaçınılmaz bir iş için (başkasından) istemesi hariç",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "Kabise b. Muhârik el-Hilâlî'den; demiştir ki: Bir anlaşmazlıkta ortalığı yatıştırmak üzere kefil olmuştum da Peygamber (s.a.v.)'e geldim. Bana: \"Kabisa, bekle de bize zekât gelsin, onun sana verilmesini emredelim,\" dedi. Sonra şöyle buyurdu: \"Kabîsa, dilenmek ancak şu üç kişiden birine helâl olur: Kefalet altına giren kişinin o meblağı elde edinceye kadar dilenmesi helâldir. Sonra bundan vazgeçer. Malını helak eden bir felâkete maruz kalan, kişinin geçimini temin edinceye kadar dilenmesi helâldir. Kavminden aklı başında üç kişi \"gerçekten falan fakir düştü\" deyip de şehâdette bulundukları kişinin geçimini te'min edinceye kadar dilenmesi helâldir. Sonra bundan vazgeçer. Kabisa! Bunların dışında dilenmek haramdır. Dilenen, haram yemiş olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "Enes b. Mâlik'ten rivayet edildiğine göre, Ensar'dan bir adam Peygamber (s.a.v.)'e dilenmeye geldi. Bunun üzerine Peygamber (s.a.v.): \"Evinde hiç bir şeyin yok mu?\" diye sordu. Adam: Hayır (bir şeyim yok ancak) bir çul var ki, bir kısmını giyiyor, diğer kısmını da (altımıza) seriyoruz. Bir de su içtiğimiz bir bardak var, dedi. Peygamber (s.a.v.): \"Onları bana getir\" dedi. Adam da getirdi. Resûlullah (s.a.v.) onları eline aldı ve: \"Bunları kim satın alır?\" dedi. Bir adam: Ben onları bir dirheme alırım, dedi. Peygamber (s.a.v.) iki veya üç defa: \"Kim bir dirhemden fazla verir\" dedi. Bir başka adam: Onları ben iki dirheme alırım, dedi. Bunun üzerine Peygamber (s.a.v.); o adama verdi ve iki dirhemi aldı. Ensârî'ye verdi ve şöyle buyurdu: \"Birisiyle yiyecek satın al da ailene götür ver. Diğer dirhem ile de bir keser satın alıp bana getir.\" Ensârî keseri getirdi. Resûlullah (s.a.v.) Ona eliyle bir sap takdı ve Ensârî'ye dedi ki: \"Git, odun topla ve sat. Seni on beş güne kadar görmeyeyim.\" Adam gitti odun toplayıp sattı. (On beş gün sonra) on dirhem biriktirmiş olarak geldi. Onun bir kısmı ile elbise, bir kısmı ile de yiyecek satın aldı. Bunun üzerine Resûlullah (s.a.v.): \"Bu senin için kıyamet gününde yüzünde dilencilik lekesi ile gelmenden hayırlıdır. Dilencilik ancak şu üç kişi için caiz olabilir: Şiddetli fakirlik çeken, çok ağır bir borç altında bulunan, can yakıcı kan diyetini ödemeyi yüklenen\" Diğer tahric: Tirmizî, buyu; Nesai, buyu'; İbn Mace, ticarat; Ahmed b. Hanbel, III, 114",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "Avf b. Mâlik'ten; demiştir ki: Biz yedi veya sekiz ya da dokuz kişi Resûlullah (s.a.v.)'in yanında idik, Resûlullah (s.a.v.): \"Allah'ın elçisine bey'at etmezmisiniz?\" buyurdu. Halbuki biz yeni bey'at etmiştik. Biz de: Sana bey'at etmiştik, dedik. Resûlullah (s.a) aynı şeyi üç sefer söyledi. Bunun üzerine ellerimizi uzattık ve ona bey'at ettik. Bu arada biri: Ya Resûlullah! Biz şüphesiz size bey'at etmiştik. Şimdi sana ne üzerine bey'at ediyoruz? diye sordu. Resûlullah (s.a.v.): \"Allah'a kulluk etmeniz, O'na hiç bir şeyi ortak koşmamanız, beş vakit namazı dosdoğru kılmanız, (söz) dinleyip itaat etmeniz ve -sesini alçaltarak gizlice- Halktan hiç bir şey istememeniz üzerine\" buyurdu. Avf dedi ki: And olsun (durum öyle oldu ki), o cemaatten birinin kamçısı yere düşüyordu da hiç bir kimseden onu vermesini istemiyordu. Müslim, zekât; Nesaî, salât: Ibn Mâce, cihâd Ebu Davud dedi ki: Hişam'ın hadisini Saîd'den başka bir kimse rivayet etmemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "Resûlullah (s.a.v.)'in azatlısı Sevbân'dan; demiştir ki: Resûlullah (s.a.v.): Halktan bir şey istemeyeceğine kim bana söz verir ki, ona cenneti garanti edeyim\" buyurdu. Sevbân: \"Ben\" dedi. Gerçekten de hiç kimseden bir daha hiç bir şey istemedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "Ebu Said el-Hudrî'den rivayet edildiğine göre, Ensâr'dan bazı kişiler Resûlullah (s.a.v.)'dan (bir şeyler) istediler. O da onlara verdi. Sonra tekrar istediler yine verdi. Yanındaki tükenince: \"Yanımdaki malı sizden asla gizlemem. Kim iffetli olmak is­terse, Allah onu iffetli yapar. Kim de elindeki ile yetinirse, Allah onu zengin yapar. Sabretmeye gayret edene Allah sabır ihsan eder. Hiç bir kimseye sabırdan daha geniş bir ihsanda bulunuİmamıştır\" buyurdu. Bu Hadis'i şunlar da tahric etti: Buharî, zekât; Müslim, zekât; Tirmizî, birr; Nesaî, zekât; Ahmed b. Hanbel, III, 12, 44, 93, 403",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "İbn Mes'ûd'dan; demiştir ki: Resûlullah (s.a.v.): \"Kime yokluk isabet eder de (halinden şikâyet ederek) onu halka arz eder (onlardan bir şeyler ister)se yokluğu giderilmez. Kim de onu Allah'a arz ederse, Allah onu çabuk zengin eder. Ya çabuk ölümle veya çabuk zenginlikle.\" diye buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "Îbnu'l-Firâsî'den rivayet edildiğine göre, el-Firâsî, Resûlullah (s.a.v.)'e: Dileneyimmi, ya Resûlullah? dedi. Peygamber (s.a.v.): \"*Hayır, eğer mutlaka bir şey istemen gerekirse, salih kişilerden iste!\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "İbnü's Sâidî'den; demiştir ki: Ömer (r.a.) beni zekât toplamak üzere görevlendirdi. İşimi bitirip topladığım zekâtları kendisine teslim edince, bana ücret verilmesini emretti. Bunun üzerine: \"Ben bu işi Allah rızası için yaptım, mükâfatım Allah'a aittir\" dedim. O şöyle cevap verdi: Sana verileni al, zira ben de Resûlullah (s.a.v.) zamanında (bu işte) çalıştım. Bana ücret verdi ben de söylediğin gibi söyledim. Resûlullah bana: \"İstemeden sana bir şey verildiği zaman onu (al) ye ve tasadduk et.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "Abdullah b. Ömer'den rivayet edildiğine göre Resûlullah (s.a.v.) minberde zekâttan, haya edip onu almamaktan ve dilenmekten söz ederken şöyle buyurdu: \"Yüksek el, alçak elden daha hayırlıdır. Yüksek el, veren (el), alçak el de dilenen (el)dir.\" Buhârî, zekât; vesâyâ: Rikâk; Müslim, zekât; Nesaî, zekât; Ahmet b. Hanbel, II, 4, 98, 319; III, 330. Ebu Davud dediki: Bu hadisteki Eyyub'un Nafi'den rivayeti konusunda ihtilaf edilmiştir. Abdulvâris: \"Yüksek el, haya edip almayandır\" demişse de ravilerin çoğu Hammad b. Zeyd'den, o da Eyyub'dan rivayetine göre: \"Yüksek el, veren eldir\" Hammad'dan rivayet edenlerden biriside: \"haya edip almayandır\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "Mâlik b. Nadla'dan; demiştir ki: Resülullah (s.a.v.) şöyle buyurdu: “Eller üç kısımdır: Allah'ın Yed-i Ulyâ'sı (zatına mahsus ve sıfatına lâyık Eli), ondan sonra verenin eli ve dilenenin alçak eli, fazla olanı ver ve nefsine yenilme",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "İbn Ebî Râfi, (babası) Ebû Râfi'den rivayet ettiğine göre, Nebi (s.a.v.) Mahzûm oğullarından bir adamı zekât toplamaya gönderdi. O adam Ebu Râfi'e: Bana arkadaş ol ki, ondan pay alasın, dedi. Ebu Râfi'de: Peygamber (S.A.V.)'e gidip sormadıkça (seninle gelmem), dedi ve Peygamber (s.a.v.)'e gidip sordu. Peygamber (s.a.v.): “Kavmin azatlı kölesi onların aile fertlerinden sayılır, bize sadaka helâl değildir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "Enes (r.a.)'ten rivayet edildiğine göre, Nebi (s.a.v.) sahibi bilinmeyen, yere düşmüş bir hurmaya rast gelirdi de zekât olması korkusundan başka bir şey onu almaktan menetmezdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "Enes (r.a.)'den rivayet edildiğine göre, Nebi (s.a.v.) (yerde) bir hurma buldu da: \"Zekât olmasından korkmasaydım, onu yerdim\" buyurdu. Buhari, buyu', lukata; Müslim, zekât; Ahmed b. Hanbel II, 317; III, 132, 193, 292. Ebû Dâvûd dedi ki: Hişâm bunu Katâde'den böyle rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "İbn Abbas'tan; demiştir ki: Babam, Peygamber (s.a.v.)'in kendisine zekâttan vermiş olduğu deve için beni ona gönderdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "İbn Abbâs'tan önceki (1653.) hadisin benzeri rivayet edilmiştir, (ancak Salim, rivayetinde) \"develeri değiştirmesi için\" ifâdesini eklemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "Enes (r.a.)'ten rivayet edildiğine göre, Nebi (s.a.v.)'e et getirildi. \"Bu nedir?\" diye sordu. Berîre'ye -sadaka olarak verilmiş bir şey, diye cevap verdiler. Bunun üzerine Peygamber (s.a.v.): \"Bu onun için sadaka, bizim için ise hediyedir\", buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "Bureyde'den rivayet edildiğine göre, Bir kadın, Resûlullah (s.a.v.)'e geldi ve şöyle dedi. Anneme sadaka olarak bir câriye vermiştim. Annem öldü ve o cariyeyi miras olarak bıraktı. (Acaba durum ne olacak?) Nebi (s.a.v.): \"0 sadakanın mükâfatına hak kazandın ve o sana miras olarak geri döndü\" buyurdu. Diğer tahric: Müslim, sıyâm; Tirmizî, zekât; Ahmed b. Hanbel V, 349, 351, 361",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "Abdullah (b. Mes'ûd)'dan; demiştir ki: Resûlullah (s.a.v.) zamanında mâûnu, kova ve tencerenin ödünç olarak verilmesi sayardık",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "Ebu Hureyre'den rivayet edildiğine göre, Resûlullah (s.a.v.) şöyle buyurmuştur: \"Servetinin zekâtını vermeyen hiçbir mal sahibi yoktur ki Allah, kıyamet günü cehennem ateşinde o malı kızdırtmamış olsun ve miktarı sizin saydığınız günlerden elli bin sene olan bir günde Allah, kullarının arasında hükmedinceye kadar- o malla sahibinin yüzü, yanları ve sırtı dağlanmasın. Sonra ya cennet'e ya da cehennem'e (giden) yolu kendisine gösterilir. Zekâtını vermeyen hiç bir koyun sürüsü sahibi yoktur ki, kıyamet günü o koyunlar, olduğundan fazla gelmesin ve sahibi düz ve geniş bir yer'e onların önüne yatırılarak onu boynuzlan ile süsmesin, tırnakları ile çiğnemesinler ki, aralarında ne yamuk boynuzlu ve ne de boynuzsuz yoktur. Miktarı sizin saydığınız günlerden elli bin sene olan bir günde Allah, kullarının arasında hükmedinceye kadar sürünün sonundakiler, onun üzerinden geçtikçe Öndekiler bir daha üzerine gönderilir. Sonra ya cennet'e ya da cehennem'e (giden) yol'u kendisine gösterilir. Zekâtını vermeyen hiç bir deve sahibi yoktur ki kıyamet günü o develer olduğundan fazla gelmesin ve sahibi düz ve geniş bir yer'e onların önüne yatırılarak ayaklarıyla çiğnemesinler. Miktarı sizin saydığımz günlerden elli bin sene olan bir günde Allah, kullarının arasında hükmedinceye kadar sondakiler, onun üzerinden geçtikçe öndekiler bir daha üzerine gönderilir. Sonra ya cennet'e ya da cehennem'e (giden) yol'u kendisine gösterilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "Ebû Hureyre Nebi (s.a.v.)'den bir önceki (1658.) hadisin benzerini rivayet etmiştir: (Hadisin senedindeki) Zeyd b. Eslem, deve ile ilgili bölümde \"onların hakkını (zekâtını) vermeyen\" sözünden sonra, \"su başına geldikleri günde sağılmaları haklarındandır\" sözünü söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "Ebû Hureyre (r.a.)'den; demiştir ki: Resûlullah (s.a.v.)'den önceki (1658 deki) kıssanın benzerini işittim. Birisi, Ebû Hureyre'ye; Develerin hakkı nedir? diye sordu. Ebû Hureyre: İyisini verirsin, bol sütlü olanını sütü sağılıp sana geri verilmek üzere verirsin, (bir başkasını) binilip sana iade edilmek üzere verirsin. Erkeğini dişileri aşılayıp sana iade edilmek üzere verirsin, sütlerinden içirirsin, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "Ubeyd b. Umeyr'den; demiştir ki: Bir adam: Ya Resûlellah! Develerin hakkı nedir? diye sordu. Râvî önceki (1660.) hadisin benzerini zikretti ve buna \"develerin kova larını ariyet olarak verirsin\" sözünü ekledi. Bu Hadis'i Müslim de zekât bahsinde tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "Câbir b. Abdullah'tan rivayet edildiğine göre, Nebi (s.a.v.) ağacından koparılmış her on vesk hurmadan fakirler için mescidde bir salkım asılmasını emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "Ebû Said el-Hudrî (r.a.)'den; demiştir ki: Resûlullah (s.a.v.) ile bir seferde iken bir adam devesinin üzerinde geldi de onu sağa sola çevirmeye başladı. Bunun üzerine Resûlullah (s.a.v.): \"Kimin yanında fazla binit varsa onu biniti olmayana versin. Kimin yanında fazla azık varsa onu azığı olmayana versin\" buyurdu. Öyle oldu ki hiç birimizin (sahip olduğu) fazla (mal) da hiç bir hakkının olmadığını zannettik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "îbn Abbas'tan; demiştir ki: \"Altın ve gümüşü biriktirenler...\" âyeti [Tevbe 33] inince durum müslümânların ağırına gitti. Bunun üzerine Ömer: Ben sizi rahatlatırım, diyerek Resûlullah (s.a.v.)'e gitti ve: Ey Allah'ın Nebisii! Bu âyet ashabının ağırına gitti, dedi. Bunun üzerine Resûlullah (s.a.v.): \"Allah zekâtı ancak mallarınızdan kalanı temizlemek için farz kıldı, Mirasları da sizden sonrakilere kalması için farz kıldı\" buyurdu. Ömer, tekbîr getirdi sonra Resûlullah (s.a.v.) ona: \"Kişinin biriktirdiği en hayırlı şeyi haber vereyim mi? Saliha olan kadın ki, kocası ona baktığı zaman kocasını sevindirir, kocası emrettiği zaman itaat eder, kocası yanında olmadığı zaman onun haklarını korur\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "Hüseyin b. Ali (r.a.)'den; demiştir ki: Resulullah (s.a.v.): \"At üzerinde gelse bile, dilenenin hakkı vardır.\" buyurdu. Diğer tahric: Ahmed b. Hanbel, I, 201",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "Ali (r.a.), Nebi (s.a.v.)'den önceki (1665) hadisin benzerini rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "Resûlullah (s.a.v.)'e bey'at edenlerden biri olan Ümmü Büceyd'den rivayet edildiğine göre, Resûlullah'a şöyle demiştir: Ya Resûlullah! Allah'ın salât-ü selamı üzerine olsun- fakir, (gelip) kapımın önünde duruyor da ona verecek bir şey bulamıyorum. Bunun üzerine Resûlullah (s.a.v.) ona şöyle dedi: \"Bir koyunun yanmış tırnağından başka ona verecek bir şey bulamazsan, (hiç olmazsa) onu eline ver",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "Esma (r.a.)'dan; demiştir ki: Kureyş'in (Hudeybiye) antlaşması zamanında annem, İslâm'dan yüz çeviren bir müşrik olduğu halde (kendisine yardım etmemi) arzulayarak bana geldi de Resûlullah (s.a.v.)'e: Ya Resûlellah! Annem İslâm'dan yüz çeviren bir müşrik olduğu halde bana geldi. Ona yardımda bulunayım mı?\" dedim. O da: \"Evet, annene yardımda bulun.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "Babasından rivayette bulunan ve kendisine Buheyse denilen bir kadından rivayet edildiğine göre şöyle demiştir: Babam, Peygamber (s.a.v.)'den izin alarak (başını) onun gömleğinin altına soktu da öpüp sarılmaya başladı. Sonra: Ya Resûlullah! (başkasından) esirgenmesi helâl olmayan şey nedir? diye sordu. Peygamber (s.a.v.): \"Sudur\" diye cevap verdi. Babam tekrar: Ey Allah'ın Peygamberi! (Başkasından) esirgenmesi helâl olmayan şey nedir\" diye sordu. Peygamber (s.a.v.): \"Tuzdur\" cevâbını verdi. Babam yine: Ey Allah'ın Peygamberi! (Başkasından) esirgenmesi helâl olmayan şey nedir? diye sordu. Peygamber (s.a.v.): \"Hayrı işlemen, senin için hayırlıdır.\" cevâbını verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "Abdurrahman b. Ebî Bekr’den; demiştir ki: Resûlullah (s.a.v.): \"İçinizde bugün fakir doyuran kimse var mı?\" diye sordu da Ebû Bekir (r.a.): Camiye girdiğimde dilenen bir dilenci gördüm de (oğlum) Abdurrahman'ın elinde bir parça ekmek buldum. Ondan alıp o fakire verdim, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "Cabir' (r.a.)'den; demiştir ki: Resûlullah (s.a.v.): \"Allah'ın zâtı için ancak cennet istenir.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "Abdullah b. Ömer (r.a.)'den; demiştir ki, Resûlullah (s.a.v.): \"Allah için size sığınan kimseye yardım edin. Allah için isteyen kimseye verin. Sizi davet edenin dâvetine icabet edin, size iyilik yapanı mükâfatlandırın. Eğer onu mükâfatlandıracak bir şey bulamazsanız, -karşılıkta bulunduğunuza kanaat getirinceye kadar- ona dua edin\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "Cabir b. Abdullah el-Ensari (r.a.)'den; demiştir ki: Resulullah (s.a.v.)'in yanındaydık, bir adam yumurta kadar bir altın getirip şöyle dedi: Ya Resulullah! Bunu maden ocağında buldum. Al, bu sadakadır. Bundan başka bir şeyim yok. Resulullah (s.a.v.), ondan yüz çevirdi. Sonra o adam,. Resulullah (s.a.v.)'e sağ tarafından geldi, aynı şeyleri söyledi. Resulullah (s.a.v.) yine ondan yüz çevirdi. Sonra ona sol tarafından geldi. Resulullah (s.a.v.) yine ondan yüz çevirdi. Sonunda arkasından geldi bu sefer Resulullah (s.a.v.), onu aldı ve adama attı. Eğer ona değseydi incitirdi veya yaralardı. Arkasından Resulullah (s.a.v.) şöyle buyurdu: \"Biriniz, sahib olduğu şeyi getirip: \"-Bu sadakadır\" diyor, sonra da oturup insanlara avuç açıyor. Sadakanın en faziletlisi, fazla maldan verilenidir.” Diğer tahric: İbn-i Hibban zvd, h.no:857; Hakim, el-Müstedrek, I, 413",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "Bir önceki (1673.) hadisi Abdullah b. İdris, Muhammed b. İshak'tan aynı sened ve mana ile rivayet etmiş ve (Resûlullah'ın sözüne): \"Bizden malını al, bizim ona ihtiyacımız yok\" ibaresini ilâve etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "Abdullah b. Sa'd'dan rivayet edildiğine göre Ebû Said el-Hudrî'yi şöyle söylerken işitmiştir: Bir adam mescid'e girdi. Resûlullah (s.a.v.) oradakilere elbise tasadduk etmelerini emretti. Onlar da tasaddukta bulundular. Bunun üzerine Resûlullah (s.a.v.), o adama onlardan ikisinin verilmesini emretti, sonra sadaka vermeye teşvik etti. O adam da gelip iki elbiseden birini tesadduk etti. Resûlullah (s.a.v.) ona bağırdı ve: \"Elbiseni al\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "Ebû Hureyre'den; demiştir ki: Resûlullah (s.a.v.): \"Sadakanın en hayırlısı, geride zenginlik bırakan -veya bol maldan verilen- sadakadır. Tasadduka, bakmakla yükümlü olduğun kimselerden başla.\" diye buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "Ebû Hureyre'den rivayet edildiğine göre o, şöyle demiştir. Resûlullah (s.a.v.)'e: Ya Resûlullah; Hangi sadaka daha faziletlidir? dedim. O (s.a.v.) da: \"Fakirin gücünün yettiğidir. Bakmakla yükümlü olduğun kimselerden başla\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "Eslem (r.a.)'den; demiştir ki: Ömer b. el-Hattâb'ı şöyle söylerken işittim: Resûlullah (s.a.v.) bir gün bize sadaka vermemizi emretti. Bu (emir) bende mal bulunan bir zamana rastladı. (Kendi kendime) \"bir gün Ebû Bekr'i geçersem işte bugün geçerim\" dedim ve malımın yarısını getirdim. Resûlullah (s.a.v.): \"Ailene ne bıraktın?\" dedi. Ben de: Bu kadarını, dedim. Ebû Bekir de malının hepsini getirdi, sonra Resûlullah (s.a.v.) O'na: \"Ailene ne bıraktın?\" dedi. O da: Onlara Allah ve Resulünü bıraktım dedi. (O'na); Bundan sonra seninle hiçbir şeyde asla yarışmam, dedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "Said' (b. el-Müseyyeb)'den rivayet edildiğine göre, Sa'd (b. Ubâde) Peygamber (s.a.v.)'e geldi ve O (s.a.v.)'na: Hangi sadaka (çeşidi) sana daha sevimlidir? dedi. Resûlullah (s.a.v.): \"Su'dur\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "Bir önceki (1679.) hadisin aynısını Katâde, Said b. Müseyyeb ile Hasan el-Basrî'den onlar da Sa'd b. Ubâde'den rivayet etmiş­lerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "Sa'd b. Ubâde'den rivayet edildiğine göre O, şöyle demiştir: Ya Resûlullah! Sa'd'ın annesi öldü. Hangi sadaka (çeşidi) daha faziletlidir? Resûlullah (s.a.v.): \"Su\" buyurdu. Râvi dedi ki: Sa'd bir kuyu kazdırdı ve \"bu kuyu Sa'd'in annesinin kuyusudur.\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "Ebû Said'den rivayet edildiğine göre, Nebi (s.a.v.) şöyle buyurmuştur: \"Hangi müslüman elbise ihtiyacı olan başka bir müslümana bir elbise giydirirse, Allah da ona cennetin yeşil elbiselerinden giydirir. Hangi müslüman aç bir Müslüman doyurursa, Allah da onu cennet meyvelerinden doyurur. Hangi müslüman susamış bir müslümana su verirse, Allah da ona (kabı) mühürlü hâlis cennet şarâbı içirir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Batil"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "Ebû Kebşe es-Selûlî'den; demiştir ki: Abdullah b. Amr'ı işittim, şöyle diyordu: Resûlullah (s.a.v.): \"Kırk haslet vardır ki bunların en üstünü (sütünden faydalanmak üzere verilen) keçi ariyetidir. Bunlardan bir hasleti, -sevabını umarak ve ona va'dedilen şeyi tasdik ederek- işleyen kimseyi, bu sayede Allah cennete koyar\" buyurdu. Buhari, hibe; Ahmea b. Hanbel, II, 160. Ebu Dâvud dediki: Müsedded'in hadisinde Hassan dediki: \"Keçi ariyetinden başka, selâm almak, aksırana dua etmek, geçen­lere eziyet veren şeyleri yoldan kaldırmak ve benzeri hasletleri de saydık onbeş haslete varamadık",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "Ebû Musa'dan; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"Verilmesi emredilen şeyi (sadakayı) gönül hoşluğuyla emrolunan kişiye (fakire) eksiksiz, tam olarak verinceye kadar (koruyan) emin kasadar, sadaka veren iki kişiden biridir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "Âişe (r.anhâ)'dan; demiştir ki: Resülullah (s.a.v.) şöyle buyurdu: \"Kadın kocasının evinden kötülük kastetmeksizin infak ederse, ona infakın sevabı, kocasına da kazanmasının sevabı verilir. Hizmetçisine de o kadar sevab verilir. Onlardan birisi diğerlerinin sevabını eksiltmez",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "Sa'd'dan rivayet edildiğine göre O, şöyle demiştir: Resûlullah (s.a.v.) kadınlardan bey'at aldığı zaman Mudar kabilesi kadınlarından olduğu zannedilen cüsseli bir kadın kalktı ve: Ey Allah'ın Resulü! Biz babalarımıza ve oğullarımıza yüküz Ebû Dâvûd: \"zannediyorum hadiste \"kocalarımıza\" ilâvesi de vardır\" dedi- onların malından (izinsiz) bize neler helâl olur? dedi. Resûlullah (s.a.v.) de: \"Ratb, onu hem yer, hem de hediye edersiniz,\" buyurdu. Ebû Dâvûd: Ratb, ekmek, sebze ve yaş hurmadır, dedi. Ebû Dâvûd dedi ki: Bu hadisi (Süfyan) Sevrî de, Yûnus'tan rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": 1687,
			"text": "Hemmâm b. Münebbîh dedi ki; Ebû Hureyre'yi şöyle derken işittim: Resûlullah (s.a.v.): \"Kadın izin almaksızın kocasının kazancından infak ederse, ona kocasının ecrinin yarısı vardır,\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "Ata'nın, Ebû Hureyre'den rivayet ettiğine göre, kadının, kocasının evindeki (maldan) sadaka verip veremeyeceği konusunda o, şöyle demiştir: Hayır, kadın ancak kendi nafakasından (tasadduk eder) sevap da karı ile koca arasında ortaktır. Kadının kocasının malından sadaka vermesi, ancak onun izniyle helâl olur. Ebû Dâvûd dedi ki: Bu hadis Hemmâm'ın hadisini zayıflatır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "Enes (r.a.)'den; demiştir ki: \"Siz sevdiğiniz şeylerden (Allah yolunda) vermedikçe asla iyiliğe ermiş olamazsınız,\"[Âl-i îmran 92.] âyeti inince Ebû Talha: Ya Resûlallah! Galiba Rabbimiz, mallarımızdan bir kısmını (yolunda vermemizi) istiyor. Sizi şâhid tutarım ki Bârîhâ adındaki yerimi Allah için verdim, dedi. Resulullah (s.a.v.) O'na: \"O yeri akrabana ver\" buyurdu. Bunun üzerine Ebû Talha, Onu Hassan b. Sabit ile Ubeyy b. Ka'b arasında taksim etti. Buhârî, vesâyâ; Müslim, zekât; Tirmizî, Tefsirü Sûre; Nesâî, ihbâs; Ahmed b. Hanbel, III, 184, 262, 285. Ebû Dâv'ûd dedi ki: Bana Muhammed b. Abdullah el-Ensârî'nin şöyle dediği ulaştı: Ebû Talha (Zeyd b. Sehl b. el-Esved b. Haram b. Amr b. Zeyd Menât b. Adiyy b. Amr b. Mâlik b. en-Neccâr) ile Hassan (b. Sabit b. el-Münzır b. Haram) üçüncü dedeleri olan Haram 'da birleşiyorlar. Ubeyy (b. Ka'b b. Kays b. Atik b. Zeyd b. Muaviye b. Amr b. Malik b. en-Neccâr'dır). Böylece Amr, Hassan, Ebû Talha ve Ubeyy'i birleştiren ataları­dır. el-Ensari dediki: \"Ubeyy ile Ebû Talha arasında altı ata vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "Nebi (s.a.v.)'in hanımı Meymûne'den rivayet edildiğine göre şöyle demiştir; Bir cariyem vardı O'nu âzad ettim. Peygamber (s.a.v.) yanıma girdi. O'na bunu haber verdim. Bunun üzerine şöyle buyurdu: “Allah sana ecrini versin. Gerçekten sen onu dayılarına verseydin, savabın daha büyük olurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "Ebû Hureyre'den; demiştir ki: Nebi (s.a.v.) sadaka verilmesini emretti de bir adam: Ya Resûlsllah, yanımda bir dinar var, dedi. Resûlullah (s.a.v.): \"Onu kendine tasadduk et (harca)\" dedi. Adam: Yanımda bir dinar daha var, dedi. Resûlullah (s.a.v.): \"Onu da çocuğuna tasadduk et (harca)\" dedi. Adam: Yanımda bir dinar daha var, dedi. Resûlullah (s.a.v.): \"Onu da hanımına tasadduk et (harca)\" dedi. Adam: Yanımda bir dinar daha var, dedi. Resûlullah (s.a.v.): \"Onu da hizmetçine tasadduk et\" dedi. Adam: Yanımda bir dinar daha1 var, dedi. Resûlullah (s.a.v.): \"(Sadaka verme usûlünü sana açıkladıktan sonra) sen (durumunu) daha iyi bilirsin.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "Abdullah b. Amr'den; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"Bakmakla yükümlü olduğu kimseleri ihmal etmesi, kişiye günâh olarak yeter",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "Enes (r.a.)'den; demiştir ki: Resûlullah (s.a.v.): \"Kimi rızkının genişletilmesi ve Ömrünün uzatılması sevindirirse, akrabasına iyilik yapsın\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "Abdurrahman b. Avf (r.a.) demiştir ki: Resûllah (s.a.v.)'ı şöyle buyururken işittim: \"-Allah buyurdu ki: \"Ben Rahmanım, o (akrabalık) da rahimdir. Ona kendi ismimden bir isim verdim. Kim ona iyilik yaparsa, ben de ona iyilik yaparım, kim ona iyilik yapmayı terk ederse bende ona iyiliği terk ederim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": 1695,
			"text": "Abdurrahman b. Avf dan rivayet edildiğine göre, Resûlullah (s.a.v.)'den yukarıdaki (1694.) hadisin mânâsında bir hadis işitmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "Cubeyr b. Mut'im'den merfû' olarak rivayet edildiğine göre, Nebi (s.a.v.): \"Akrabalık alakasını kesen, cennet'e giremez\" buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "Abdullah b. Amr (r.a.)'dan; demiştir ki: Resûlullah (s.a.v.) şöyle buyurdu: \"Sıla-i rahim yapan kimse, (akrabasından gördüğü iyiliğe) karşılık veren kimse değildir. O, akrabası kendisine iyiliği kestiği zaman onlara iyilik yapandır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "Abdullah b. Amr (r.a.)'den; demiştir ki: Resûlullah (s.a.v.) bir hitabesinde şöyle buyurdu: \"Cimrilikten sakının, çünkü sizden öncekiler cimrilik sebebiy­le helak oldular. Cimrilik onları, vermemeye şevketti de vermediler, akrabaya iyiliği kesmeye sevketti de kestiler, (mal toplamak için) günah işlemeye sevk etti de günah işlediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "Esma bint Ebî Bekr (r.anhâ); demiştir ki, Resûlullah (s.a.v.)'e dedim ki: Ya Resûllallah! Benim, (kocam) Zübeyr'in evine getirdiğinden başka hiç bir şeyim yok, ondan vereyim mi? Resûlullah (s.a.v.): \"Ver, saklama, yoksa senden de saklanır.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "Abdullah b. Ebî Müleyke'den rivayet edildiğine göre Âişe (r.anhâ), Resûlullah (s.a.v.)'a bazı fakirlerden söz etti. Ebû Dâvûd dedi ki: Veya Abdullah b. Ebî Müleyke'den başkalarının rivayetine göre \"bazı sadakalardan söz etti\" Resûllah (s.a.v.) ona: \"Ver, sayma, yoksa sana da sayıyla verilir\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 145
			}
		}
	]
}