{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2089,
			"arabicnumber": "901.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எழுந்து (மக்களுடன்) தொழுதார்கள். அதில் நன்கு நீண்ட நேரம் நிலையில் நின்றார்கள். பிறகு ருகூஉச் செய்தார்கள். அந்த ருகூஉவை நன்கு நீண்ட நேரம் செய்தார்கள். பிறகு (ருகூஉவிலிருந்து) தலையை உயர்த்தி நன்கு நீண்ட நேரம் நிலையில் நின்றார்கள். இ(ந்த நிலையான)து முதல் நிலையைவிடக் குறைவாகவே இருந்தது. பிறகு (மீண்டும்) ருகூஉச் செய்தார்கள். அந்த ருகூஉவையும் நன்கு நீண்ட நேரம் செய்தார்கள். இ(ந்த ருகூஉவான)து முதல் ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு சஜ்தா (சிரவணக்கம்) செய்தார்கள். பிறகு எழுந்து நீண்ட நேரம் நிலையில் நின்றார்கள். இ(ந்த நிலையான)து, இதற்கு முந்தைய நிலையை விடக் குறைவாகவே இருந்தது. பிறகு ருகூஉச் செய்தார்கள். அந்த ருகூஉவையும் நீண்ட நேரம் செய்தார்கள். இ(ந்த ருகூஉவான)து இதற்கு முந்தைய ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு (ருகூஉவிலிருந்து) தலையை உயர்த்தி, நிலையில் நின்றார்கள். அந்த நிலையிலும் நீண்ட நேரம் நின்றார்கள். இ(ந்த நிலையான)து இதற்கு முந்தைய நிலையைவிடக் குறைவாகவே இருந்தது. பிறகு (மீண்டும்) ருகூஉச் செய்தார்கள். அந்த ருகூஉ வையும் நீண்ட நேரம் செய்தார்கள். இ(ந்த ருகூஉவான)து இதற்கு முந்தைய ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு சஜ்தாச் செய்தார்கள். பின்னர் (கிரகணம் விலகி) சூரிய வெளிச்சம் வந்துவிட்டிருந்த நிலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையை முடித்தார்கள். பிறகு மக்களுக்கு உரையாற்றினார்கள். அவர்கள் அல்லாஹ்வைப் போற்றிப் புகழ்ந்து விட்டுப் பின்வருமாறு கூறினார்கள்: சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் உள்ளவையாகும். எவரது இறப்புக்காகவும் எவரது பிறப்புக்காகவும் கிரகணம் ஏற்படுவதில்லை. கிரகணம் ஏற்படுவதை நீங்கள் கண்டால் \"தக்பீர்\" (அல்லாஹு அக்பர்) கூறுங்கள்; அல்லாஹ்விடம் பிரார்த்தியுங்கள்; தொழுங்கள்; தானதர்மம் செய்யுங்கள். முஹம்மதின் சமுதாயத்தாரே! தன் அடியார்களில் ஆணோ பெண்ணோ யார் விபசாரத்தில் ஈடுபட்டாலும் (அதைக் கண்டு) கடுமையாக ரோஷம் கொள்பவர் அல்லாஹ்வைவிட வேறெவருமிலர். முஹம்மதின் சமுதாயத்தாரே! அல்லாஹ்வின் மீதாணையாக! நான் அறிவதையெல்லாம் நீங்களும் அறிந்தால் குறைவாகச் சிரிப்பீர்கள்; அதிகமாக அழுவீர்கள். நான் (சொல்ல வேண்டியதைச்) சொல்லிவிட்டேன் அல்லவா? இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் மாலிக் பின் அனஸ் (ரஹ்) அவர்களது அறிவிப்பில் \"சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும்\" என இடம்பெற்றுள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2090,
			"arabicnumber": "901.02",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2091,
			"arabicnumber": "901.03",
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உயிரோடிருந்த காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. உடனே அவர்கள் பள்ளிவாசலுக்குச் சென்று (தொழுகையில்) நின்று \"தக்பீர்\" கூறினார்கள். மக்கள் அவர்களுக்குப் பின்னால் அணிவகுத்து நின்றனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நிலையில்) நீண்ட நேரம் (குர்ஆன்) ஓதினார்கள். பிறகு \"தக்பீர்\" கூறி நீண்ட நேரம் ருகூஉச் செய்தார்கள். பிறகு (ருகூஉவிலிருந்து) தலையை உயர்த்தி \"சமி அல்லாஹு லிமன் ஹமிதஹ். ரப்பனா வ ல(க்)கல் ஹம்து\" (அல்லாஹ் தன்னைப் புகழ்வோரின் புகழுரையை ஏற்றுக்கொள்கிறான். எங்கள் இறைவா! புகழனைத்தும் உனக்கே உரியது) என்று கூறினார்கள். பிறகு நின்ற வண்ணம் நீண்ட நேரம் (குர்ஆன்) ஓதினார்கள். இ(ப்போது அவர்கள் ஓதிய)து முந்தைய ஓதலைவிடக் குறைவாகவே இருந்தது. பிறகு \"தக்பீர்\" கூறி, நீண்ட நேரம் ருகூஉச் செய்தார்கள். இ(ந்த ருகூஉவான)து முந்தைய ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு \"சமிஅல்லாஹு லிமன் ஹமிதஹ். ரப்பனா வ ல(க்)கல் ஹம்து\" எனக் கூறி (நிலையில் நின்று)விட்டு, பிறகு சஜ்தாச் செய்தார்கள். (அபுத்தாஹிர் (ரஹ்) அவர்களது அறிவிப்பில் \"பின்னர் சஜ்தாச் செய்தார்கள்\" எனும் வாசகம் இடம்பெறவில்லை.) பிறகு முந்தைய ரக்அத்தில் செய்ததைப் போன்றே இரண்டாவது ரக்அத்திலும் செய்தார்கள். அவர்கள் (இரண்டு ரக்அத்களில்) நான்கு ருகூஉகளும் நான்கு சஜ்தாக்களும் பூர்த்தி செய்தார்கள். அவர்கள் தொழுகையை முடிப்பதற்கு முன் சூரிய வெளிச்சம் வந்து விட்டிருந்தது. பிறகு எழுந்து நின்று மக்களுக்கு உரையாற்றினார்கள். அல்லாஹ்வை அவனது தகுதிக்கேற்ப போற்றிப் புகழ்ந்து விட்டு, \"சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். எவரது இறப்புக்காகவும் எவரது பிறப்புக்காகவும் அவற்றுக்குக் கிரகணம் ஏற்படுவதில்லை. ஆகவே, அவற்றை நீங்கள் கண்டால் தொழுகைக்கு விரையுங்கள்\" என்றும், \"உங்களைவிட்டு அவற்றை அல்லாஹ் அகற்றும்வரை தொழுங்கள்\" என்றும் கூறினார்கள். மேலும் \"நான் இந்த இடத்தில் (தொழுகையில் நின்றிருந்தபோது) உங்களுக்கு வாக்களிக்கப் பட்டுள்ள அனைத்தையும் கண்டேன். (தொழுகையிலிருந்தபோது) நான் முன்னே செல்வதைப் போன்று நீங்கள் கண்டீர்களே, அப்போது சொர்க்கத்தின் பழக்குலை ஒன்றைப் பறிக்க நான் நாடினேன். பின்னர் நான் பின்வாங்குவதைக் கண்டீர்களே, அப்போது நான் நரகத்தைக் கண்டேன். அதன் ஒரு பகுதி மற்றொரு பகுதியை அழித்து (உக்கிரமாக எரிந்து)கொண்டிருந்தது. மேலும், நரகத்தில் (அம்ர்) இப்னு லுஹை என்பாரைக் கண்டேன். அவர்தாம் முதன்முதலில் கடவுள் சிலைக்காக ஒட்டகத்தை (சாயிபா) நேர்ந்து விட்டவர் ஆவார்\" என்றும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில், அபுத்தாஹிர் (ரஹ்) அவர்களது அறிவிப்பு \"தொழுகைக்கு விரையுங்கள்\" என்பதோடு முடிந்துவிடுகிறது; அதற்குப் பிறகுள்ள குறிப்புகள் அவரது அறிவிப்பில் இடம் பெறவில்லை. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2092,
			"arabicnumber": "901.04",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2094,
			"arabicnumber": "902.01",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2095,
			"arabicnumber": "902.02",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2096,
			"arabicnumber": "901.06",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2097,
			"arabicnumber": "901.07",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2098,
			"arabicnumber": "903.01",
			"text": "அம்ரா பின்த் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: ஒரு யூதப் பெண் ஆயிஷா (ரலி) அவர்களிடம் யாசகம் கேட்டு வந்தாள். அப்போது அவள் ஆயிஷாவிடம் ‘மண்ணறை (கப்று) வேதனையிலிருந்து உம்மை இறைவன் காப்பாற்றுவானாக!\" என்று கூறினாள். ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: ஆகவே,நான் (இதுபற்றி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கூறி) \"அல்லாஹ்வின் தூதரே! மனிதர்கள் மண்ணறைகளில் வேதனை செய்யப்படுகிறார்களா?\" எனக் கேட்டேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"(மண்ணறை வேதனையிலிருந்து) நானும் அல்லாஹ்விடம் பாதுகாப்புக் கோருகிறேன்\" என்று கூறினார்கள். பிறகு (ஒரு நாள்) காலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் புதல்வர் இப்ராஹீமின் இறப்புச் செய்தி கேட்டு) வாகனத்தில் ஏறிப் பயணமானார்கள். அப்போது சூரிய கிரகணம் ஏற்பட்டு விடவே, நான் சில பெண்களுடன் சேர்ந்து அறைகளின் பின்புற வழியாகப் பள்ளிவாசலுக்குப் புறப்பட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பயணத்தை ரத்துச் செய்துவிட்டு) தமது வாகனத்திலிருந்து இறங்கி, தாம் வழக்கமாக நின்று தொழுவித்துவந்த இடத்திற்குச் சென்று நின்றார்கள். மக்களும் அவர்களுக்குப் பின்னால் நின்றனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தொழுகையில்) நீண்ட நேரம் நிலையில் நின்றுவிட்டுப் பிறகு ருகூஉச் செய்தார்கள். அந்த ருகூஉவில் நீண்ட நேரம் இருந்தார்கள். பிறகு (ருகூஉவிலிருந்து) நிமிர்ந்து நீண்ட நேரம் நிலையில் நின்றார்கள். இ(ந்த நிலையான)து இதற்கு முந்தைய நிலையை விடக் குறைவாகவே இருந்தது. பிறகு ருகூஉச் செய்தார்கள். அந்த ருகூஉவையும் நீண்ட நேரம் செய்தார்கள். இ(ந்த ருகூஉவான)து இதற்கு முந்தைய ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு (ருகூஉவிலிருந்து தலையை) உயர்த்தியபோது, சூரிய வெளிச்சம் வந்துவிட்டிருந்தது. பின்னர் (அவர்கள் ஆற்றிய உரையில்) \"நீங்கள் கப்றுகளில் தஜ்ஜாலின் குழப்பத்தைப் போன்ற குழப்பத்துக்கு உள்ளாக்கப்படுவதை நான் கண்டேன்\" என்று குறிப்பிட்டார்கள். இதன் அறிவிப்பாளரான அம்ரா பின்த் அப்திர் ரஹ்மான் பின் சஅத் (ரஹ்) அவர்கள் கூறினார்கள்: இதன் பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நரகநெருப்பின் வேதனையிலிருந்தும் மண்ணறை (கப்று) வேதனையிலிருந்தும் (இறைவனிடம் அதிகமாகப்) பாதுகாப்புக்கோரி வந்ததை நான் செவியுற்றேன் என ஆயிஷா (ரலி) அவர்கள் கூறினார்கள். - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2099,
			"arabicnumber": "903.02",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2102,
			"arabicnumber": "904.03",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய புதல்வர் இப்ராஹீம் (ரலி) அவர்கள் இறந்த நாளில் சூரிய கிரகணம் ஏற்பட்டது. அப்போது மக்கள் \"இப்ராஹீம் இறந்ததனால் தான் கிரகணம் ஏற்பட்டது\" என்று கூறினர். (இந்தச் செய்தி எட்டியதும்) நபி (ஸல்) அவர்கள் எழுந்து (இரண்டு ரக்அத்களில்) ஆறு ருகூஉகளும் நான்கு சஜ்தாக்களும் செய்தார்கள். அவர்கள் முதலில் \"தக்பீர்\" (தஹ்ரீம்) கூறினார்கள். பின்னர் நீண்ட நேரம் (குர்ஆன் வசனங்களை) ஓதினார்கள். பிறகு ஏறக்குறைய நிலையில் நின்றிருந்த அளவிற்கு ருகூஉச் செய்தார்கள். பிறகு ருகூஉவிலிருந்து தலையை உயர்த்தி முன்பு ஓதியதைவிடக் குறைவாக (குர்ஆனை) ஓதினார்கள். பிறகு ஏறக்குறைய முன்பு நிலையில் நின்றிருந்த அளவிற்கு ருகூஉச் செய்தார்கள். பிறகு ருகூஉவிலிருந்து தலையை உயர்த்தி இரண்டாவது முறை (குர்ஆனை) ஓதினார்கள். அது முதலாவது முறை ஓதியதைவிடக் குறைவாக இருந்தது. பிறகு ஏறக்குறைய முன்பு நிலையில் நின்றிருந்த அளவிற்கு ருகூஉச் செய்தார்கள். பிறகு ருகூஉவிலிருந்து தலையை உயர்த்தினார்கள். பிறகு (பூமியில்) சரிந்து இரண்டு சஜ்தாக்கள் செய்தார்கள். பிறகு (இரண்டாவது ரக்அத்திற்காக) எழுந்து (முந்தைய ரக்அத்தில் செய்ததைப் போன்றே) மீண்டும் மூன்று ருகூஉகள் செய்தார்கள். அவர்கள் ஒரு ருகூஉச் செய்தால் அது அதற்கு முந்தைய ருகூஉவைவிடக் குறைவாகவே இருந்தது. அவர்களது ருகூஉ ஏறக்குறைய அவர்களது சஜ்தாவின் அளவிற்கே அமைந்திருந்தது. பிறகு அவர்கள் (தாம் நின்று தொழுவித்த இடத்திலிருந்து) பின்வாங்கினார்கள். அவர்களுக்குப் பின்னாலிருந்த வரிசைகளும் அவர்களுடன் பின்வாங்கின. இறுதியில் நாங்கள் நின்ற இடத்திற்கே நபியவர்கள் வந்துவிட்டார்கள். (அறிவிப்பாளர் அபூபக்ர் கூறுகிறார்கள்: பெண்கள் நின்றிருந்த இடத்திற்கு வந்துசேர்ந்தார்கள்.) பிறகு நபி (ஸல்) அவர்கள் முன்னோக்கி நகர அவர்களுடன் சேர்ந்து மக்களும் முன்னோக்கி நகர்ந்து, முன்பு நின்றிருந்த இடத்தில் நின்றனர். (கிரகணம் விலகி) சூரியன் தனது பழைய நிலைக்குத் திரும்பிய வேளையில் தொழுகையை முடித்தார்கள். பிறகு (உரையாற்றினார்கள். அதில் பின்வருமாறு) குறிப்பிட்டார்கள்: மக்களே, சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். மக்களில் எவரது இறப்புக்காகவும் (அறிவிப்பாளர் அபூபக்ர் கூறுகிறார்கள்: எந்த மனிதரின் இறப்புக்காகவும்) அவற்றுக்குக் கிரகணம் ஏற்படுவதில்லை. இவற்றில் எதையேனும் நீங்கள் கண்டால் சூரிய வெளிச்சம் வரும்வரை நீங்கள் தொழுங்கள். உங்களுக்கு வாக்களிக்கப் பட்டுள்ள (சொர்க்கம் மற்றும் நரகம் உள்ளிட்ட) அனைத்தையும் நான் இத்தொழுகையில் இருந்தபோது கண்டேன். நரகம் என் (கண்)முன்னே கொண்டுவரப்பட்டது. அதன் தீச்சுவாலை என்னைத் தாக்கிவிடுமோ என நான் அஞ்சினேன். அதன் காரணமாகவே நான் பின்வாங்கியதை நீங்கள் கண்டீர்கள். அ(ந்த நரகத்)தில் முனை வளைந்த கைத்தடி வைத்திருந்த ஒருவன் தனது குடலை இழுத்தபடி நரகத்தில் சென்றுகொண்டிருந்ததைக் கண்டேன். அவன் கைத்தடியின் முனையால் ஹஜ் பயணிகளிடம் திருடிவந்தான். திருட்டு அம்பலமாகிவிட்டால் \"எனது கைத்தடியில் (எப்படியோ இந்தப் பொருள்) மாட்டிக்கொண்டது\" என்று கூறுவான். யாருக்கும் தெரியாவிட்டால் அதைக் கொண்டு சென்றுவிடுவான். மேலும், நரகத்தில் நான், பூனை வளர்த்த பெண்ணையும் கண்டேன். அவள் அதற்குத் தீனி போடாமல் கட்டிப்போட்டு வைத்திருந்தாள். அவள் அதை பூமியிலுள்ள புழுப்பூச்சிகளைத் தின்ன (அவிழ்த்து)விடவுமில்லை. அது பசியாலேயே செத்துப்போய்விட்டது. பிறகு என் (கண்) முன்னே சொர்க்கம் கொண்டுவரப்பட்டது. நான் இந்த இடத்திற்கு மீண்டும் முன்னேறி வந்ததை நீங்கள் பார்த்தீர்களே அதற்குக் காரணம் அதுதான். நீங்கள் பார்க்க வேண்டும் என்பதற்காகவே நான் சொர்க்கத்தின் கனிகளைப் பறிக்க எனது கையை நீட்டினேன். பிறகு அவ்வாறு செய்யலாகாது என்று எனக்குத் தோன்றியது (ஆகவே, அதிலிருந்து பின்வாங்கி விட்டேன்). உங்களுக்கு வாக்களிக்கப்பட்டுள்ள அனைத்தையும் இந்தத் தொழுகையில் இருந்தபோது நான் கண்டுகொண்டேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2103,
			"arabicnumber": "905.01",
			"text": "ஃபாத்திமா பின்த் அல்முன்திர் (ரஹ்) அவர்கள் கூறியதாவது: அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. அப்போது நான் (என் சகோதரி) ஆயிஷா (ரலி) அவர்களிடம் சென்றேன். அவர் தொழுதுகொண்டிருந்தார். நான் ஆயிஷாவிடம் \"மக்களுக்கு என்னவாயிற்று? ஏன் (இந்தநேரத்தில்) தொழுதுகொண்டிருக்கிறார்கள்?\" என்று கேட்டேன். அதற்கு ஆயிஷா தமது தலையால் வானை நோக்கிச் சைகை செய்தார்கள். நான் \"ஏதேனும் அடையாளமா?\" என்று கேட்டேன். அதற்கு ஆயிஷா \"ஆம்\" என (சைகையால்) விடையளித்தார். (நானும் தொழுகையில் நின்று கொண்டேன்.) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெகுநேரம் நிலையில் நின்றதால் எனக்குத் தலைச் சுற்றலே வந்துவிட்டது. எனக்குப் பக்கத்திலிருந்த தோல் பாத்திரத்திலிருந்து தண்ணீர் எடுத்து ‘எனது தலைமீது\" அல்லது ‘முகத்தின் மீது\" தெளித்தேன். சூரிய வெளிச்சம் வந்து விட்டிருந்த நிலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையை முடித்தார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அல்லாஹ்வைப் போற்றிப் புகழ்ந்து மக்களுக்கு உரையாற்றினார்கள். \"இறைவாழ்த்துக்குப் பின்! நான் இந்த இடத்தில் (தொழுதவாறு) நின்றபோது சொர்க்கம் மற்றும் நரகம் உட்பட இதுவரை நான் பார்த்திராத அனைத்தையும் கண்டேன். நீங்கள் உங்கள் மண்ணறைகளில் (கப்றுகளில்), மகாக்குழப்பவாதியான மஸீஹுத் தஜ்ஜாலின் \"குழப்பத்தைப் போன்ற\" அல்லது \"அதற்கு நிகரான\" குழப்பத்துக்கு உள்ளாக்கப்படுவீர்கள் என எனக்கு வஹீ (இறைச்செய்தி) அறிவிக்கப்பட்டது. - (\"குழப்பத்தைப் போன்ற\" அல்லது \"அதற்கு நிகரான\" என்பதில் எதை அஸ்மா (ரலி) அவர்கள் கூறினார்கள் என எனக்குத் தெரியவில்லை) - (நீங்கள் மண்ணறையில் (கப்று) இருக்கும்போது) உங்களில் ஒருவரிடம் (என்னைக் காட்டி) \"இம் மனிதரைப் பற்றி நீ என்ன அறிந்துள்ளாய்?\" என வினவப்படும். அதற்கு \"இறைநம்பிக்கையாளர்\" அல்லது \"(இறுதித்தூதரின் மீது) உறுதிகொண்டிருந்தவர்\" (இந்த இரண்டில் எதை அஸ்மா (ரலி) அவர்கள் கூறினார்கள் என எனக்குத் தெரியவில்லை.) \"இவர் அல்லாஹ்வின் தூதர் முஹம்மத் (ஸல்) ஆவார்கள்; எங்களிடம் தெளிவான சான்றுகளையும் நேர்வழியையும் கொண்டுவந்தார்கள். நாங்கள் அவர்களது அழைப்பை ஏற்றோம்; இணங்கினோம்\" என்று மூன்று முறை கூறுவார். அப்போது அவரிடம், \"உறங்குவீராக! நீர் அவரை நம்பிக்கை கொண்டிருந்தீர் என நாங்கள் அறிவோம். எனவே, நலமாக உறங்குவீராக\" என்று கூறப்படும். ஆனால், \"நயவஞ்சகன்\" அல்லது \"சந்தேகத்துடன் இருந்தவன்\" \"(அவரை) எனக்குத் தெரியாது. மக்கள் ஏதோ சொல்லிக்கொண்டிருந்தார்கள். அதைக் கேட்டு நானும் அதையே சொன்னேன்\" என்று பதிலளிப்பான். (நயவஞ்சகன்,சந்தேகத்துடன் இருந்தவன் ஆகிய இவ்விரண்டில் எதை அஸ்மா (ரலி) அவர்கள் கூறினார்கள் என எனக்குத் தெரியவில்லை.) அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2106,
			"arabicnumber": "906.01",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2107,
			"arabicnumber": "906.02",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2108,
			"arabicnumber": "906.03",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2109,
			"arabicnumber": "907.01",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2110,
			"arabicnumber": "907.02",
			"text": "மேற்கண்ட ஹதீஸ் அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"அவர்கள் நிற்பதும் பிறகு ருகூஉச் செய்வதுமாக நீண்ட நேரம் நின்றிருந்தார்கள்\" என்றும், \"நான் என்னைவிட வயதில் மூத்த ஒரு பெண்ணையும், என்னைவிட உடல் நலிவுற்ற மற்றோர் பெண்ணையும் பார்க்கலானேன். (எனவே உட்கார்ந்து விடலாமா என்ற எனது எண்ணத்தை நான் மாற்றிக்கொண்டேன்)\" என்றும் அஸ்மா (ரலி) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2111,
			"arabicnumber": "908",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சூரியகிரகணம் ஏற்பட்டபோது (ரக்அத்திற்கு நான்கு ருகூஉகள்; இரண்டு சஜ்தாக்கள் வீதம்) எட்டு ருகூஉகளும் நான்கு சஜ்தாக்களும் செய்(து இரு ரக்அத்கள் தொழு)தார்கள். அலீ பின் அபீதாலிப் (ரலி) அவர்களிடமிருந்தும் இவ்வாறே அறிவிக்கப்பட்டுள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2112,
			"arabicnumber": "909",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2113,
			"arabicnumber": "910",
			"text": "அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் சூரியகிரகணம் ஏற்பட்டபோது \"(இன்னஸ்) ஸலாத்த ஜாமிஆ\" (தொழுகை நடக்கப்போகிறது) என (மக்களுக்கு) அறிவிப்புச் செய்யப்பட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு ரக்அத்தில் இரண்டு ருகூஉகள் செய்தார்கள். பிறகு (அடுத்த ரக்அத்திற்கு) எழுந்து (மீண்டும்) ஒரு ரக்அத்தில் இரண்டு ருகூஉகள் செய்தார்கள். (அவர்கள் தொழுகையை முடிக்கும்போது கிரகணமும் விலகி) சூரிய வெளிச்சம் வந்துவிட்டிருந்தது. ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: அதை விட நீண்ட ருகூஉவை ஒருபோதும் நான் செய்ததேயில்லை; நீண்ட சஜ்தாவையும் ஒரு போதும் நான் செய்ததேயில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2114,
			"arabicnumber": "911.01",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2115,
			"arabicnumber": "911.02",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2116,
			"arabicnumber": "911.03",
			"text": "மேற்கண்ட ஹதீஸ் மேலும் ஏழு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் சுஃப்யான் (ரஹ்) மற்றும் வகீஉ (ரஹ்) ஆகியோரது அறிவிப்பில், \"(நபி (ஸல்) அவர்களின் புதல்வர்) இப்ராஹீம் (ரலி) இறந்த நாளில் சூரிய கிரகணம் ஏற்பட்டது. அப்போது மக்கள் \"இப்ராஹீமின் இறப்புக்காகவே கிரகணம் ஏற்பட்டது\" என்று கூறினர்\" என (அபூமஸ்ஊத் (ரலி) அவர்கள் கூறியதாக) இடம்பெற்றுள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2117,
			"arabicnumber": "912",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மனிதர்களில் எவரது இறப்புக்காகவும் சூரிய மற்றும் சந்திர கிரகணங்கள் ஏற்படுவதில்லை. மாறாக, அவ்விரண்டும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும். ஆகவே, கிரகணத்தை நீங்கள் கண்டால் எழுந்து தொழுங்கள். இதை அபூமஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2118,
			"arabicnumber": "913.01",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2119,
			"arabicnumber": "913.02",
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. நபி (ஸல்) அவர்கள் யுக முடிவு நாள் வந்துவிட்டதோ என அஞ்சி(யதைப் போன்று) பதற்றமடைந்தவர்களாக எழுந்து பள்ளிவாசலுக்குச் சென்றார்கள். அங்கு நின்று தொழுதார்கள். நிலை,குனிதல், சிரவணக்கம் ஆகியவற்றை நீண்ட நேரம் செய்(து தொழு)தார்கள். அவர்கள் ஒருபோதும் இவ்வாறு எந்தத் தொழுகையிலும் செய்வதை நான் கண்டதில்லை. பிறகு, \"அல்லாஹ் அனுப்பிவைக்கும் இந்த அடையாளங்கள் எவரது இறப்புக்காகவும் பிறப்புக்காகவும் ஏற்படுபவை அல்ல. எனினும், அல்லாஹ் தன் அடியார்களை இவற்றின் மூலம் எச்சரிக்கவே செய்கிறான். இவற்றில் ஏதேனும் ஒன்றை நீங்கள் கண்டால் அவனை நினைவு கூர்வதிலும் அவனிடம் பிரார்த்திப்பதிலும் அவனிடம் பாவமன்னிப்புக் கோருவதிலும் விரைந்து ஈடுபடுங்கள்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. \"(சூரிய கிரகணம் ஏற்பட்டது\" என்பதைக் குறிக்க இந்த ஹதீஸின் மூலத்தில் ஆளப்பட்டுள்ள \"ஃகசஃபத்திஷ் ஷம்சு\" எனும் சொல்) முஹம்மத் பின் அல்அலா (ரஹ்) அவர்களது அறிவிப்பில் \"கசஃபத்திஷ் ஷம்சு\" என்று ஆளப்பட்டுள்ளது. (\"தன் அடியார்களை எச்சரிக்கவே செய்கிறான்\" என்பதன் மூலச்சொல் \"யுகவ்விஃபு பிஹா இபாதஹு” என்பதற்கு மாறாக) \"யுகவ்விஃபு இபாதஹு” என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2120,
			"arabicnumber": "913.03",
			"text": "மேற்கண்ட ஹதீஸ் அப்துர் ரஹ்மான் பின் சமுரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் நான் என் அம்புகளை எய்வதில் ஈடுபட்டிருந்தேன்\" என்று ஹதீஸ் தொடங்குகிறது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2121,
			"arabicnumber": "914",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: சூரியனும் சந்திரனும் யாருடைய இறப்புக்காகவோ பிறப்புக்காகவோ கிரகணம் காண்பதில்லை. உண்மையில் அவை இரண்டும் இறைவனின் சான்றுகளில் உள்ளவை ஆகும். ஆகவே, கிரகணங்களை நீங்கள் கண்டால் (இறைவனைத்) தொழுங்கள். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2122,
			"arabicnumber": "915",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 31
			}
		}
	]
}