{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3962,
			"arabicnumber": "1551.01",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கைபரில் உள்ள மரங்களையும் நிலங்களையும் \"அவற்றின் விளைச்சலான பழங்கள் மற்றும் தானியங்களில் பாதியை (இஸ்லாமிய அரசுக்கு)க் கொடுத்துவிட வேண்டும்\" எனும் நிபந்தனையின் பேரில் கைபர்வாசிகளுடன் ஒப்பந்தம் செய்து கொண்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3963,
			"arabicnumber": "1551.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3964,
			"arabicnumber": "1551.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3965,
			"arabicnumber": "1551.04",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: கைபர் வெற்றி கொள்ளப்பட்டபோது, யூதர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் \"நாங்கள் இங்கேயே தங்கி,இந்த நிலத்தில் பயிரிட்டு உழைக்கிறோம். இவற்றின் விளைச்சலான பழங்கள், தானியங்கள் ஆகியவற்றில் பாதியைப் பெற்றுக்கொள்கிறோம் (மீதிப்பாதியை அரசுக்குத் தந்துவிடுகிறோம்); இதற்கு எங்களை அனுமதிக்க வேண்டும்\" என்று கேட்டுக் கொண்டார்கள். அவ்வாறே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதன்படி நாம் விரும்பும் (காலம்)வரை நீங்கள் இங்கேயே தங்கிப் பயிரிட அனுமதிக்கிறோம்\" என்று கூறினார்கள். மற்ற விவரங்கள் மேற்கண்ட இரு ஹதீஸ்களில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. மேலும், இந்த அறிவிப்பில், \"கைபர் விளைச்சலில் கிடைத்த பழங்கள் (ஐந்து பாகங்களாகப் பிரிக்கப்பட்டு, போர்வீரர்களின்) பங்குகளுக்கேற்ப பங்கிடப்பட்டுவந்தன. ஐந்தில் ஒரு பாகத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எடுத்துவந்தார்கள்\" எனும் தகவல் கூடுதலாக இடம் பெற்றுள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3966,
			"arabicnumber": "1551.05",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: (கைபர் வெற்றிக்குப் பின்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், கைபர் வாழ் யூதர்களிடம் \"அவர்கள் தம் நிலங்களில் தமது சொந்தச் செலவில் பயிரிட்டு உழைக்க வேண்டும்; விளையும் கனிகளில் பாதியை அல்லாஹ்வின் தூதரிடம் (பொது நிதியத்துக்காக) வழங்க வேண்டும்\" எனும் நிபந்தனையின் பேரில் கைபரின் பேரீச்சமரங்களையும் நிலங்களையும் ஒப்படைத்தார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3967,
			"arabicnumber": "1551.06",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (கலீஃபா) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் யூதர்களையும் கிறித்தவர்களையும் \"ஹிஜாஸ்\" மாநிலத்திலிருந்து நாடு கடத்தினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கைபரை வெற்றி கொண்டபோதே அங்கிருந்த யூதர்களை வெளியேற்றிவிட விரும்பினார்கள். ஏனெனில், அந்தப் பிரதேசம் வெற்றிகொள்ளப்பட்ட பின் அது அல்லாஹ்வுக்கும் அவன் தூதருக்கும் முஸ்லிம்களுக்கும் உரியதாகிவிட்டிருந்தது. ஆகவேதான், யூதர்களை அங்கிருந்து வெளியேற்ற விரும்பினார்கள். இந்நிலையில், யூதர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், \"நாங்கள் இங்கேயே தங்கி, இந்த நிலங்களில் பயிரிட்டு உழைக்கும் பொறுப்பை ஏற்கிறோம். இவற்றின் விளைச்சலில் பாதியைப் பெற்றுக் கொள்கிறோம் (மீதியை மதீனா அரசுக்குச் செலுத்திவிடுகிறோம்); இதற்கு எங்களை அனுமதிக்க வேண்டும்\" என்று கேட்டுக்கொண்டார்கள். அவ்வாறே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதன்படி நாம் விரும்பும்வரை நீங்கள் இங்கே தங்கிப் பயிரிட அனுமதிக்கிறோம்\" என்று கூறினார்கள். ஆகவே, உமர் (ரலி) அவர்கள் தமது ஆட்சிக் காலத்தில் அந்த யூதர்களை \"தைமா\" \"அரீஹா\" (ஜெரிக்கோ) ஆகிய பகுதிகளுக்கு நாடுகடத்தி அனுப்பும்வரை அவர்கள் அங்கேயே (நிலங்களைப் பயிரிட்டு, வரி செலுத்தி) வசித்துவந்தார்கள். - இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3968,
			"arabicnumber": "1552.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: முஸ்லிம் ஒருவர் ஒரு மரத்தை நட்டு வைத்து, அதிலிருந்து (அதன் இலைகள், கனிகள் ஆகியவை பறவைகளாலும் கால் நடைகளாலும்) உண்ணப்பட்டால், அதுவும் அவருக்கு ஒரு தர்மமாக அமையாமல் இருப்பதில்லை. அதிலிருந்து களவாடப்பட்டதும் அவருக்கு ஒரு தர்மமாக அமையும்; அதிலிருந்து வன விலங்குகள் உண்பதும் அவருக்கு ஒரு தர்மமாகவே அமையும். அதிலிருந்து பறவைகள் கொத்தித் தின்றதும் அவருக்கு ஒரு தர்மமாகவே அமையும்; அதில் எவரேனும் சேதம் விளைவித்தால் அதுவும் அவருக்கு ஒரு தர்மமாகவே அமையும். - இதை ஜாபிர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3969,
			"arabicnumber": "1552.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3970,
			"arabicnumber": "1552.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3971,
			"arabicnumber": "1552.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3972,
			"arabicnumber": "1552.05",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3973,
			"arabicnumber": "1553.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3974,
			"arabicnumber": "1553.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3975,
			"arabicnumber": "1554.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நீ உன் சகோதரரிடம் (உனது மரத்திலுள்ள) பழங்களை விற்றுவிட, (அவர் பழங்களைப் பறிப்பதற்கு முன்) அவற்றுக்குச் சேதம் ஏதும் ஏற்பட்டால், அவரிடமிருந்து (கிரயம்) எதையும் பெறுவதற்கு உனக்கு அனுமதி இல்லை;எந்த உரிமையுமின்றி உன் சகோதரரின் பொருளை நீ எந்த அடிப்படையில் எடுத்துக்கொள்ள முடியும்? இதை ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஜாபிர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3976,
			"arabicnumber": "1554.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3977,
			"arabicnumber": "1555.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3978,
			"arabicnumber": "1555.02",
			"text": "ஹுமைத் பின் அபீஹுமைத் (ரஹ்) அவர்கள் கூறியதாவது: அனஸ் (ரலி) அவர்கள், \"நபி (ஸல்) அவர்கள், மரத்திலுள்ள பேரீச்சங்கனிகள் பக்குவம் அடையாதவரை அவற்றை விற்பதற்குத் தடை விதித்தார்கள்\" என்று கூறினார்கள். நாங்கள் அனஸ் (ரலி) அவர்களிடம் \"பக்குவமடைதல் என்றால் என்ன?\" என்று கேட்டோம். \"அது சிவப்பு நிறத்தையும் மஞ்சள் நிறத்தையும் அடைவதாகும்\" என்று கூறிவிட்டு, \"அல்லாஹ் மரத்திலுள்ள கனிகளைத் தடுத்துவிட்டால், நீ எந்த அடிப்படையில் உன் சகோதரரின் பொருளை எடுத்துக்கொள்ள முடியும் சொல்\" என்றார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், மரத்திலுள்ள கனிகள் பக்குவமடையாத வரை அவற்றை விற்பதற்குத் தடை விதித்தார்கள். மக்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், \"பக்குவமடைதல் என்றால் என்ன?\" என்று கேட்டார்கள். \"அது சிவப்பு நிறத்தை அடைவதாகும்\" என்றார்கள். மேலும், \"அல்லாஹ் மரத்திலுள்ள கனிகளைத் தடுத்துவிட்டால், உன் சகோதரரின் பொருள் எந்த அடிப்படையில் உனக்கு அனுமதிக்கப்பட்டதாக ஆகும்?\" என்று கேட்டார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3979,
			"arabicnumber": "1555.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3980,
			"arabicnumber": "1554.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3981,
			"arabicnumber": "1556.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3982,
			"arabicnumber": "1556.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3983,
			"arabicnumber": "1557",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தமது வீட்டின்) வாசலருகே சச்சரவிட்டுக்கொள்ளும் (இருவரின்) சப்தத்தைக் கேட்டார்கள். அவ்விருவரின் குரல்கள் உயர்ந்தன. ஒருவர் மற்றவரிடம் ஏதோ ஒரு (கடன்) விஷயத்தில் தள்ளுபடி செய்யுமாறும் மென்மையாக நடந்துகொள்ளுமாறும் கேட்டுக்கொண்டிருந்தார். அதற்கு மற்றவர், \"அல்லாஹ்வின் மீதாணையாக! நான் (அவ்வாறு) செய்யமாட்டேன்\" என்று கூறிக் கொண்டிருந்தார். அவர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் புறப்பட்டு வந்து, \"நல்லறத்தைச் செய்யமாட்டேன் என அல்லாஹ்வின் மீது ஆணையிட்டுச் சொன்னவர் எங்கே?\" என்று கேட்டார்கள். அந்த மனிதர், \"நான்தான் அல்லாஹ்வின் தூதரே! (நான் என் சத்தியத்தைத் திரும்பப் பெற்றுக் கொள்கிறேன்;) அவர் விரும்பியது எதுவானாலும் (அது) அவருக்குக் கிடைக்கும்\" என்று கூறினார். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3984,
			"arabicnumber": "1558.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3985,
			"arabicnumber": "1558.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3986,
			"arabicnumber": "1558.03",
			"text": "மேற்கண்ட ஹதீஸ் கஅப் பின் மாலிக் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"எனக்கு இப்னு அபீஹத்ரத் (ரலி) அவர்கள் தர வேண்டிய கடனைத் திருப்பிச் செலுத்தும்படி கேட்டேன்\" என்று ஹதீஸ் ஆரம்பமாகிறது. - கஅப் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் அபீஹத்ரத் அல் அஸ்லமீ (ரலி) அவர்கள் எனக்குப் பணம் தர வேண்டியிருந்தது. எனவே, அவரைச் சந்தித்து அவரை (நகரவிடாமல்) பிடித்துக் கொண்டேன். எங்கள் குரல்கள் உயரும் அளவிற்கு நாங்கள் பேசிக்கொண்டோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களைக் கடந்து சென்றார்கள். அப்போது அவர்கள் \"கஅபே!\" என்று என்னை அழைத்து, பாதிக்கடனைத் தள்ளுபடி செய்துவிடு என்பதைப் போன்று தமது கரத்தால் சைகை செய்தார்கள். ஆகவே, அவர் தர வேண்டியிருந்த கடனில் பாதியை மட்டும் பெற்றுக்கொண்டு, மீதிப்பாதியை (தள்ளுபடி செய்து)விட்டேன். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3987,
			"arabicnumber": "1559.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3988,
			"arabicnumber": "1559.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3989,
			"arabicnumber": "1559.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3990,
			"arabicnumber": "1559.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3991,
			"arabicnumber": "1559.05",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3992,
			"arabicnumber": "1559.06",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3993,
			"arabicnumber": "1560.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3994,
			"arabicnumber": "1560.02",
			"text": "ரிப்ஈ பின் ஹிராஷ் (ரஹ்) அவர்கள் கூறியதாவது: (நபித்தோழர்களான) ஹுதைஃபா (ரலி) அவர்களும் அபூமஸ்ஊத் (ரலி) அவர்களும் ஓரிடத்தில் சந்தித்துக்கொண்டனர். அப்போது ஹுதைஃபா (ரலி) அவர்கள், \"(முந்தைய காலத்தில் வாழ்ந்த) ஒரு மனிதர் (இறந்த பின்) தம் இறைவனைச் சந்தித்தார். அப்போது அவரிடம் இறைவன், \"நீ (ஏதேனும்) நற்செயல் புரிந்திருக்கிறாயா?\" என்று கேட்டான். அவர் \"எந்த நல்லறமும் செய்ய வில்லை. எனினும், நான் பொருளாதார வசதியுடைய ஒரு மனிதனாக இருந்தேன். எனவே, (மக்களுக்கு நான் கொடுத்துவந்த) பணத்தை (திருப்பித் தருமாறு) மக்களிடம் கோருவேன். அப்போது (என்னிடமிருந்து கடன் வாங்கியவர் கொடுக்கும், அவரால்) இயன்ற தொகையைப் பெற்றுக்கொள்வேன்; இயலாத தொகையைத் தள்ளுபடி செய்துவிடுவேன்\" என்று கூறினார். உடனே இறைவன், \"என் அடியானின் தவறுகளைத் தள்ளுபடி செய்துவிடுங்கள்\" என்று (வானவர்களிடம்) கூறினான்\"என்றார்கள். அதற்கு அபூமஸ்ஊத் (ரலி) அவர்கள் \"இவ்வாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3995,
			"arabicnumber": "1560.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3996,
			"arabicnumber": "1560.04",
			"text": "ஹுதைஃபா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் அடியார்களில் ஒருவர் (இறந்த பின்) அல்லாஹ்விடம் கொண்டு வரப்பட்டார். அவரிடம் அல்லாஹ், \"உலகத்தில் நீ என்ன நற்செயல் புரிந்தாய்?\" என்று கேட்டான். (அல்லாஹ்விடம் அவர்கள் எந்தச் செய்தியையும் மறைக்க முடியாது.) அதற்கு அந்த அடியார், \"இறைவா! உன் செல்வத்தை எனக்கு நீ வழங்கினாய். அதை வைத்து நான் மக்களிடம் கொடுக்கல் வாங்கல் செய்துவந்தேன். அப்போது பெருந்தன்மையுடன் நடந்து கொள்வதே எனது இயல்பாக இருந்தது. வசதியுடையவரிடம் மென்மையாக நடந்து கொள்வேன்: சிரமப்படுபவருக்கு அவகாசம் அளிப்பேன்\" என்று சொன்னார். அதற்கு அல்லாஹ், \"இ(வ்வாறு பெருந்தன்மையுடன் நடப்ப)தற்கு உன்னைவிட நானே மிகவும் தகுதியுடையவன். (எனவே,) என் அடியானின் தவறுகளைத் தள்ளுபடி செய்யுங்கள்\" என்று (வானவர்களிடம்) கூறினான். (ஹுதைஃபா (ரலி) அவர்கள் இவ்வாறு கூறியதைக் கேட்ட) உக்பா பின் ஆமிர் அல்ஜுஹனீ (ரலி) அவர்களும் அபூமஸ்ஊத் அல்அன்சாரி (ரலி) அவர்களும், \"இவ்வாறே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் வாயிலிருந்து நாங்கள் செவியுற்றோம்\" என்று கூறினர். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3997,
			"arabicnumber": "1561",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3998,
			"arabicnumber": "1562.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3999,
			"arabicnumber": "1562.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4000,
			"arabicnumber": "1563.01",
			"text": "அப்துல்லாஹ் பின் அபீகத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: (என் தந்தை) அபூகத்தாதா (ரலி) அவர்கள், தமக்குக் கடன் தர வேண்டிய ஒருவரைத் தேடினார்கள். அவர் தலைமறைவாகிவிட்டார். பின்னர் அவரைக் கண்டபோது அவர், \"நான் (வசதியின்றி) சிரமப்படுபவன்\" என்று கூறினார். அதற்கு அபூகத்தாதா (ரலி) அவர்கள், \"அல்லாஹ்வின் மீது சத்தியமாகவா?\" என்று கேட்டார்கள். அவர் \"அல்லாஹ்வின் மீது சத்தியமாகத்தான்\" என்றார். அபூகத்தாதா (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"மறுமை நாளின் துயரங்களிலிருந்து அல்லாஹ் தம்மைக் காப்பாற்ற வேண்டுமென விரும்புகின்றவர், (கடனை அடைக்க முடியாமல்) சிரமப்படுபவருக்கு அவகாசம் அளிக்கட்டும். அல்லது கடனைத் தள்ளுபடி செய்துவிடட்டும்\" என்று கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4001,
			"arabicnumber": "1563.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4002,
			"arabicnumber": "1564.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4003,
			"arabicnumber": "1564.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4004,
			"arabicnumber": "1565.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4005,
			"arabicnumber": "1565.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4006,
			"arabicnumber": "1566.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4007,
			"arabicnumber": "1566.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4008,
			"arabicnumber": "1566.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4009,
			"arabicnumber": "1567.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4010,
			"arabicnumber": "1567.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4011,
			"arabicnumber": "1568.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4012,
			"arabicnumber": "1568.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4013,
			"arabicnumber": "1568.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4014,
			"arabicnumber": "1568.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4015,
			"arabicnumber": "1569",
			"text": "அபுஸ்ஸுபைர் முஹம்மத் பின் முஸ்லிம் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஜாபிர் (ரலி) அவர்களிடம் நாய் மற்றும் பூனை விற்ற காசைப் பற்றிக் கேட்டேன். அதற்கு அவர்கள் \"நபி (ஸல்) அவர்கள் அவற்றைக் கண்டித்தார்கள்\" என விடையளித்தார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4016,
			"arabicnumber": "1570.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4017,
			"arabicnumber": "1570.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4018,
			"arabicnumber": "1570.03",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நாய்களைக் கொல்லும்படி உத்தரவிட்டார்கள்; உடனே நாங்கள் மதீனாவிற்குள்ளேயும் அதன் சுற்று வட்டாரங்களிலும் பரவிச் சென்று, ஒரு நாயையும் விடாமல் அனைத்தையும் கொன்றோம். கிராமவாசிப் பெண்ணைப் பின்தொடர்ந்து செல்லும் நாயையும் நாங்கள் கொன்றோம். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4019,
			"arabicnumber": "1571",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4020,
			"arabicnumber": "1572",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நாய்களைக் கொல்லும்படி எங்களுக்கு உத்தரவிட்டார்கள். அதையடுத்து,கிராமத்திலிருந்து ஒரு பெண் (மதீனாவை நோக்கி) தனது நாயுடன் வந்தால், அதையும் நாங்கள் கொன்றோம். பின்னர் நபி (ஸல்) அவர்கள் நாய்களைக் கொல்வதற்குத் தடை விதித்தார்கள். மேலும், \"கண்களுக்கு மேலே இரு வெண் புள்ளிகள் உள்ள கன்னங்கரிய நாயை (மட்டும்) கொல்லுங்கள். ஏனெனில், அது ஷைத்தான் ஆகும்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4021,
			"arabicnumber": "1573.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4022,
			"arabicnumber": "1573.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4023,
			"arabicnumber": "1574.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4024,
			"arabicnumber": "1574.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4025,
			"arabicnumber": "1574.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4026,
			"arabicnumber": "1574.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4027,
			"arabicnumber": "1574.05",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4028,
			"arabicnumber": "1574.06",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4029,
			"arabicnumber": "1574.07",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4030,
			"arabicnumber": "1575.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4031,
			"arabicnumber": "1575.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4032,
			"arabicnumber": "1575.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4033,
			"arabicnumber": "1575.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4034,
			"arabicnumber": "1575.05",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4035,
			"arabicnumber": "1575.06",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4036,
			"arabicnumber": "1576.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4037,
			"arabicnumber": "1576.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4038,
			"arabicnumber": "1577.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4039,
			"arabicnumber": "1577.02",
			"text": "மேற்கண்ட ஹதீஸ் ஹுமைத் அத்தவீல் (ரஹ்) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"அனஸ் (ரலி) அவர்களிடம் குருதி உறிஞ்சி எடுப்பவரின் வருமானம் பற்றிக் கேட்கப் பட்டது\" என்று ஹதீஸ் ஆரம்பமாகி, \"மேலும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"நீங்கள் எவற்றால் சிகிச்சை பெறுகிறீர்களோ அவற்றிலெல்லாம் சிறந்தது குருதி உறிஞ்சி எடுப்பதும் வெண்கோஷ்டமும்தான். உங்கள் குழந்தைகளை (அவர்களது அடிநாக்கு அழற்சியைப் போக்க தொண்டையில்) குத்தித் துன்புறுத்தாதீர்கள் என்று கூறினார்கள்\" என ஹதீஸ் முடிகிறது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4040,
			"arabicnumber": "1577.03",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் குருதி உறிஞ்சி எடுக்கும் எங்கள் அடிமை (ஊழியர்) ஒருவரை அழைத்து வரச்செய்து, தமக்குக் குருதி உறிஞ்சி எடுக்கச் செய்தார்கள். அவருக்கு ஒரு \"ஸாஉ\" அல்லது ஒரு \"முத்\"து அல்லது இரண்டு \"முத்\"து (அளவுக்கு உணவுப் பொருட்களை ஊதியமாகக்) கொடுக்குமாறு உத்தரவிட்டார்கள்; அவர் சம்பந்தமாக (அவருடைய உரிமையாளர்களிடம்) பேசினார்கள். அதையடுத்து அவர் செலுத்த வேண்டியிருந்த வரி குறைக்கப்பட்டது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4041,
			"arabicnumber": "1202.02",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குருதி உறிஞ்சி எடுத்துக்கொண்டார்கள். குருதி உறிஞ்சி எடுப்பவருக்கு அவருடைய ஊதியத்தைக் கொடுத்தார்கள். மேலும், தமது மூக்கில் (சொட்டு) மருந்து விட்டுக்கொண்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4042,
			"arabicnumber": "1202.03",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: \"பனூ பயாளா\" குலத்தாரின் அடிமை ஒருவர் நபி (ஸல்) அவர்களுக்குக் குருதி உறிஞ்சி எடுத்தார். அவருக்குரிய ஊதியத்தை நபி (ஸல்) அவர்கள் கொடுத்தார்கள். அவருடைய உரிமையாளரிடம் பேசி, அவர் செலுத்த வேண்டியிருந்த வரியையும் குறைக்கச் செய்தார்கள். அது (அதாவது குருதி உறிஞ்சி எடுப்பதற்குக் கூலி பெறுவது), தடை செய்யப்பட்டதாக இருந்தால், அவருக்கு நபி (ஸல்) அவர்கள் (ஊதியம்) கொடுத்திருக்கமாட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4043,
			"arabicnumber": "1578",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4044,
			"arabicnumber": "1579.01",
			"text": "ஸைத் பின் அஸ்லம் (ரஹ்) அவர்கள் கூறியதாவது: எகிப்தியரான அப்துல்லாஹ் பின் வஅலா அஸ்ஸபயீ (ரஹ்) அவர்கள் அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்களிடம் (வந்து), திராட்சையிலிருந்து பிழியப்படும் (மது)பானம் குறித்துக் கேட்டார். அதற்கு அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் (பின்வருமாறு) விடையளித்தார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு ஒரு தோல்பை (நிரம்ப) மதுவை அன்பளிப்பாக வழங்கினார் ஒருவர். அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ் மதுவைத் தடை செய்துவிட்டது உமக்குத் தெரியுமா?\"என்று கேட்டார்கள். அதற்கு அவர், \"இல்லை\" என்று கூறிவிட்டு, பிறகு (தம் அருகிலிருந்த) ஒரு மனிதரிடம் இரகசியமாக ஏதோ சொன்னார். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவரிடம் இரகசியமாக என்ன சொன்னீர்?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர், \"அதை விற்றுவிடச் சொன் னேன்\" என்றார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"மதுவை அருந்துவதற்குத் தடை விதித்த (இறை)வனே அதை விற்பதற்கும் தடை விதித்துள்ளான்\" என்றார்கள். உடனே அம்மனிதர் தோல்பையைத் திறந்துவிட, அதிலுள்ளது (வழிந்தோடிப்) போனது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4045,
			"arabicnumber": "1579.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4046,
			"arabicnumber": "1580.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4047,
			"arabicnumber": "1580.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4048,
			"arabicnumber": "1581.01",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்கா வெற்றியின்போது மக்காவில் வைத்து \"அல்லாஹ்வும் அவனுடைய தூதரும் மதுபானம், செத்தவை, பன்றி மற்றும் சிலைகள் ஆகியவற்றை விற்பனை செய்வதைத் தடை செய்துள்ளனர்\"என்று கூறினார்கள். அப்போது, \"அல்லாஹ்வின் தூதரே! செத்தவற்றின் கொழுப்புகள் பற்றி என்ன சொல்கிறீர்கள்?அவை கப்பல்களுக்குப் பூசப்படுகின்றன; தோல்களுக்கு அவற்றின் மூலம் மெருகேற்றப்படுகிறது; மக்கள் விளக்கெரிக்க அவற்றைப் பயன்படுத்துகின்றனரே?\" என்று கேட்கப்பட்டது. அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இல்லை; அது தடை செய்யப்பட்டதுதான்\" எனக் கூறிவிட்டு, \"அல்லாஹ் யூதர்களைத் தனது அருளிலிருந்து அப்புறப்படுத்துவானாக! அல்லாஹ் யூதர்களுக்குச் செத்தவற்றின் கொழுப்பைத் தடை செய்தபோது, அவர்கள் அதை உருக்கி விற்று, அதன் கிரயத்தை உண்டார்கள்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4049,
			"arabicnumber": "1581.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4050,
			"arabicnumber": "1582.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4051,
			"arabicnumber": "1582.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4052,
			"arabicnumber": "1583.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4053,
			"arabicnumber": "1583.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4054,
			"arabicnumber": "1584.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4055,
			"arabicnumber": "1584.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4056,
			"arabicnumber": "1584.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4057,
			"arabicnumber": "1584.04",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: எடைக்கு எடையாகவே தவிர, அளவுக்கு அளவாகவே தவிர, சரிக்குச் சரியாகவே தவிர தங்கத்தைத் தங்கத்திற்கு விற்காதீர்கள்; வெள்ளியை வெள்ளிக்கு விற்காதீர்கள். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4058,
			"arabicnumber": "1585",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு தங்க நாணயத்தை இரண்டு தங்க நாணயங்களுக்கு (ஒரு தீனாரை இரு தீனார்களுக்கு) விற்காதீர்கள்; ஒரு வெள்ளி நாணயத்தை இரண்டு வெள்ளி நாணயங்களுக்கு (ஒரு திர்ஹமை இரு திர்ஹங்களுக்கு) விற்காதீர்கள். இதை உஸ்மான் பின் அஃப்பான் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4059,
			"arabicnumber": "1586.01",
			"text": "மாலிக் பின் அவ்ஸ் பின் அல்ஹதஸான் (ரஹ்) அவர்கள் கூறியதாவது: நான் \"(எம்மிடமுள்ள தங்கத்தை) வெள்ளி நாணயத்திற்கு மாற்றித் தருபவர் யார்?\" என்று கேட்டபடி வந்தேன். அப்போது உமர் பின் அல்கத்தாப் (ரலி) அவர்களுக்கு அருகிலிருந்த தல்ஹா பின் உபைதில்லாஹ் (ரலி) அவர்கள், \"(எங்கே) உமது தங்கத்தைக் காட்டும். அதைக் கொண்டுவாரும்! எம் ஊழியர் (வெளியூரிலிருந்து) வந்ததும் அதற்குரிய வெள்ளியைத் தருகிறோம்\" என்று கூறினார்கள். அப்போது உமர் பின் அல்கத்தாப் (ரலி) அவர்கள், \"இல்லை; அல்லாஹ்வின் மீதாணையாக! அவருக்கு வெள்ளியை (உடனடியாக)க் கொடுத்துவிடு. அல்லது அவரது தங்கத்தை அவரிடமே திருப்பிக் கொடுத்துவிடு. ஏனெனில்,அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உடனுக்குடன் அல்லாமல் (தவணை முறையில்) தங்கத்திற்கு வெள்ளியை மாற்றிக் கொள்வது வட்டியாகும்; உடனுக்குடன் அல்லாமல் (தவணை முறையில்) தொலி நீக்கப்பட்ட கோதுமைக்குத் தொலி நீக்கப்பட்ட கோதுமையை மாற்றிக் கொள்வதும் வட்டியாகும்; உடனுக்குடன் அல்லாமல் (தவணை முறையில்) தொலி நீக்கப்படாத கோதுமைக்குத் தொலி நீக்கப்படாத கோதுமையை மாற்றிக்கொள்வதும் வட்டியாகும்; உடனுக்குடன் அல்லாமல் (தவணை முறையில்) பேரீச்சம் பழத்திற்குப் பேரீச்சம் பழத்தை மாற்றிக்கொள்வதும் வட்டியாகும்\" என்று கூறினார்கள்\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4060,
			"arabicnumber": "1586.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4061,
			"arabicnumber": "1587.01",
			"text": "அபூகிலாபா அப்துல்லாஹ் பின் ஸைத் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஷாம் (சிரியா) நாட்டில் ஓர் அவையில் இருந்தேன். அங்கு முஸ்லிம் பின் யசார் (ரஹ்) அவர்களும் இருந்தார்கள். அப்போது அபுல் அஷ்அஸ் (ரஹ்) அவர்கள் வந்தார்கள். மக்கள், \"அபுல் அஷ்அஸ் (வந்துவிட்டார்) அபுல் அஷ்அஸ் (வந்துவிட்டார்)\" என்றனர். அவர்கள் (வந்து) அமர்ந்ததும் அவர்களிடம் நான், \"எங்கள் சகோதர(ர் முஸ்லிம் பின் யசா)ருக்கு உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் அறிவித்த ஹதீஸைச் சொல்லுங்கள்\" என்றேன். அதற்கு அவர்கள், \"ஆம்\" எனக் கூறிவிட்டுப் பின்வருமாறு அறிவித்தார்கள்: நாங்கள் ஒரு போருக்காகச் சென்றிருந்தோம். (அப்போரில்) மக்களுக்கு முஆவியா (ரலி) அவர்கள் தளபதியாக இருந்தார்கள். போரின் முடிவில் நாங்கள் ஏராளமான போர்ச் செல்வங்களைப் பெற்றோம். நாங்கள் பெற்ற போர்ச்செல்வத்தில் ஒரு வெள்ளிப் பாத்திரமும் இருந்தது. மக்கள் போர்ச்செல்வங்களைப் பெறுவதற்காக வரும் நாள்வரை (தவணை சொல்லி, வெள்ளி நாணயங்களுக்குப் பதிலாக) அ(ந்தப் பாத்திரத்)தை விற்று விடுமாறு முஆவியா (ரலி) அவர்கள் கூறினார்கள். மக்கள் அதைப் பெறுவதற்காக விரைந்தனர். இச்செய்தி உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்களுக்கு எட்டியபோது அவர்கள் எழுந்து, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"தங்கத்தைத் தங்கத்திற்கு விற்பதையும் வெள்ளியை வெள்ளிக்கும், தொலி நீக்கப்பட்ட கோதுமையைத் தொலி நீக்கப்பட்ட கோதுமைக்கும், தொலி நீக்கப்படாத கோதுமையைத் தொலி நீக்கப்படாத கோதுமைக்கும், பேரீச்சம் பழத்தைப் பேரீச்சம் பழத்திற்கும், உப்பை உப்பிற்கும் விற்பதைத் தடை செய்தார்கள்; உடனுக்குடன் சரிக்குச் சரியாக மாற்றிக்கொண்டால் தவிர. யார் அதைவிடக் கூடுதலாகக் கொடுக்கிறாரோ அல்லது கூடுதலாகக் கேட்கிறாரோ அவர் வட்டியைப் பெற்றவர் ஆவார் என்று கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள். உடனே மக்கள் தாம் பெற்றதை திருப்பிக் கொடுத்துவிட்டனர். இச்செய்தி முஆவியா (ரலி) அவர்களுக்கு எட்டியபோது,அவர்கள் (மக்களிடையே) நின்று உரையாற்றினார்கள். அப்போது, \"சிலருக்கு என்ன நேர்ந்தது? அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள் என அவர்கள் பல ஹதீஸ்களை அறிவிக்கின்றனர். நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் அவர்களது தோழமையில் இருந்திருக்கிறோம். ஆனால், இத்தகைய ஹதீஸ்களை அவர்களிடமிருந்து நாங்கள் கேட்டதில்லை\" என்றார்கள். உடனே உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் எழுந்து, மீண்டும் அந்த ஹதீஸைக் கூறினார்கள். பிறகு \"முஆவியா அவர்கள் வெறுத்தாலும் சரி; (அல்லது அவரது மூக்கு மண்ணைக் கவ்வினாலும் சரி) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்றதை நிச்சயமாக நாம் அறிவிப்போம். இருள் கப்பிய ஓர் இரவில் முஆவியா அவர்களது படையில் அவர்களுடன் நான் இல்லாமற்போவது குறித்து நான் பொருட்படுத்தவில்லை\" என்று சொன்னார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான ஹம்மாத் பின் ஸைத் (ரஹ்) அவர்கள் \"இவ்வாறுதான் அய்யூப் (ரஹ்) அவர்கள் அறிவித்தார்கள்; அல்லது இதைப் போன்று அறிவித்தார்கள்\" என (தன்னடக்கத்துடன்) கூறினார்கள். - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4062,
			"arabicnumber": "1587.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4063,
			"arabicnumber": "1587.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தங்கத்தைத் தங்கத்திற்கும், வெள்ளியை வெள்ளிக்கும், தொலி நீக்கப்பட்ட கோதுமையைத் தொலி நீக்கப்பட்ட கோதுமைக்கும், தொலி நீக்கப்படாத கோதுமையைத் தொலி நீக்கப்படாத கோதுமைக்கும், பேரீச்சம் பழத்தைப் பேரீச்சம் பழத்திற்கும், உப்பை உப்பிற்கும் சரிக்குச் சரியாக உடனுக்குடன் விற்கலாம். இந்த இனங்கள் மாறுபட்டிருக்கும்போது உடனுக்குடன் மாற்றிக்கொண்டால் நீங்கள் விரும்பியபடி விற்றுக்கொள்ளுங்கள். இதை உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4064,
			"arabicnumber": "1584.05",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தங்கத்தைத் தங்கத்திற்கும், வெள்ளியை வெள்ளிக்கும், தொலி நீக்கப்பட்ட கோதுமையைத் தொலி நீக்கப்பட்ட கோதுமைக்கும், தொலி நீக்கப்படாத கோதுமையைத் தொலி நீக்கப்படாத கோதுமைக்கும், பேரீச்சம் பழத்தைப் பேரீச்சம் பழத்திற்கும், உப்பை உப்புக்கும் சரிக்குச் சரியாக உடனுக்குடன் விற்கலாம். யாரேனும் கூடுதலாகக் கொடுத்தாலோ, அல்லது கூடுதலாகக் கேட்டாலோ அவர் வட்டி வாங்கிவிட்டார். இ(ந்தப் பாவத்)தில் வாங்கிய வரும் கொடுத்தவரும் சமமானவர்கள் ஆவர். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அபூசயீத் அல்குத்ரீ (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், \"தங்கத்தைத் தங்கத்திற்குச் சரிக்குச் சரியாக விற்கலாம்\" என ஹதீஸ் ஆரம்பமாகிறது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4065,
			"arabicnumber": "1584.06",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4066,
			"arabicnumber": "1588.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: பேரீச்சம் பழத்தைப் பேரீச்சம் பழத்திற்கும், தொலி நீக்கப்பட்ட கோதுமையைத் தொலி நீக்கப்பட்ட கோதுமைக்கும்,தொலி நீக்கப்படாத கோதுமையைத் தொலி நீக்கப்படாத கோதுமைக்கும், உப்பை உப்புக்கும் சரிக்குச் சரியாக உடனுக்குடன் விற்கலாம். யாரேனும் கூடுதலாகக் கொடுத்தாலோ, அல்லது கூடுதலாகக் கேட்டாலோ அவர் வட்டி வாங்கி விட்டார். அவற்றின் இனங்கள் வேறுபட்டிருந்தால் தவிர. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"உடனுக்குடன்\" எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4067,
			"arabicnumber": "1588.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4068,
			"arabicnumber": "1588.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தங்கத்தைத் தங்கத்திற்குச் சரிக்குச் சரியான எடைக்கு (விற்கலாம்). வெள்ளியை வெள்ளிக்குச் சரிக்குச் சரியான எடைக்கு (விற்கலாம்). ஒருவர் கூடுதலாகக் கொடுத்தாலோ, அல்லது கூடுதலாகக் கேட்டாலோ அது வட்டியாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4069,
			"arabicnumber": "1588.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4070,
			"arabicnumber": "1588.05",
			"text": "அபுல் மின்ஹால் அப்துர் ரஹ்மான் பின் முத்இம் (ரஹ்) அவர்கள் கூறியதாவது: என் கூட்டாளி ஒருவர், (தங்கத்திற்கு) வெள்ளியை ஹஜ் பருவம்வரை கடனாகச் சொல்லி (நாணயமாற்று முறையில்)விற்றார். பின்னர் என்னிடம் வந்து அதைப் பற்றித் தெரிவித்தார். நான், \"இது தகாத செயலாகும்\" என்றேன். அவர், \"அவ்வாறாயின் நான் கடைத் தெருவில் அதை விற்றபோது என்னிடம் யாரும் ஆட்சேபம் தெரிவிக்கவில்லையே?\"என்று கேட்டார். ஆகவே, நான் பராஉ பின் ஆஸிப் (ரலி) அவர்களிடம் சென்று அதைப் பற்றிக் கேட்டேன். அவர்கள், \"நபி (ஸல்) அவர்கள் (நாடு துறந்து) மதீனாவுக்கு வந்தபோது, நாங்கள் இந்த வியாபாரம் செய்து கொண்டிருந்தோம். அப்போது அவர்கள், \"உடனுக்குடன் (நாணயமாற்று) ஏற்பட்டால் அதனால் குற்றமில்லை; கடனாக (தங்கத்தை வெள்ளிக்கோ, வெள்ளியைத் தங்கத்திற்கோ) மாற்றினால்தான் அது வட்டியாகும்\" என்று கூறினார்கள். நீர் ஸைத் பின் அர்கம் (ரலி) அவர்களிடம் போ(ய் இதைப் பற்றி வினா எழுப்பு)வீராக! ஏனெனில், அவர் என்னைவிட பெரிய வணிகர் ஆவார்\" என்றார்கள். அவ்வாறே நான் ஸைத் பின் அர்கம் (ரலி) அவர்களிடம் சென்று கேட்டபோது, பராஉ (ரலி) அவர்கள் கூறியதைப் போன்றே அவர்களும் கூறினார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4071,
			"arabicnumber": "1589.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4072,
			"arabicnumber": "1589.02",
			"text": "அபுல் மின்ஹால் அப்துர் ரஹ்மான் பின் முத்இம் (ரஹ்) அவர்கள் கூறியதாவது: நான் பராஉ பின் ஆஸிப் (ரலி) அவர்களிடம் நாணயமாற்று வியாபாரம் குறித்துக் கேட்டேன். அவர்கள், \"நீர் ஸைத் பின் அர்கம் (ரலி) அவர்களிடம் கேளும். அவர் (என்னைவிட) நன்கு அறிந்தவர்\" என்றார்கள். அவ்வாறே நான் ஸைத் பின் அர்கம் (ரலி) அவர்களிடம் கேட்டதற்கு அவர்கள், \"நீர் பராஉ (ரலி) அவர்களிடமே கேளும். அவரே (என்னை விட) நன்கு அறிந்தவர்\" என்றார்கள். பின்னர் இருவரும், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தங்கத்திற்கு வெள்ளியைக் கடனாக விற்பதற்குத் தடை விதித்தார்கள்\" என்று கூறினர். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4073,
			"arabicnumber": "1590.01",
			"text": "அபூபக்ரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெள்ளிக்கு வெள்ளியை, தங்கத்திற்குத் தங்கத்தைச் சரிக்குச் சரியாகவே தவிர (வேறு முறையில்) விற்கக் கூடாது எனத் தடை விதித்தார்கள். தங்கத்திற்கு வெள்ளியை நாங்கள் விரும்பியவாறு வாங்குவதற்கும், வெள்ளிக்குத் தங்கத்தை நாங்கள் விரும்பியவாறு வாங்குவதற்கும் அனுமதித்தார்கள். இந்த ஹதீஸை அபூபக்ரா (ரலி) அவர்கள் அறிவித்தபோது அவர்களிடம் ஒரு மனிதர், \"உடனுக்குடன் (மாற்றிக்கொண்டால்தானே)!\" என்று கேட்டார். அதற்கு அபூபக்ரா (ரலி) அவர்கள் \"அவ்வாறே நான் செவியுற்றேன்\"என்றார்கள். - மேற்கண்ட ஹதீஸ் அபூபக்ரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"..... எங்களுக்குத் தடை விதித்தார்கள்\" என இடம்பெற்றுள்ளது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4074,
			"arabicnumber": "1590.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4075,
			"arabicnumber": "1591.01",
			"text": "ஃபளாலா பின் உபைத் அல்அன்சாரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கைபரில் இருந்தபோது, அவர்களிடம் கழுத்து மாலை ஒன்று கொண்டுவரப்பட்டது. அதில் பொன்னும் மணியும் இருந்தன. அது போர்ச் செல்வங்களுடன் விற்கப்பட்டது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்த மாலையில் இருந்த பொன்னைத் தனியே கழற்றி எடுத்துவிடுமாறு உத்தரவிட்டார்கள். பிறகு மக்களிடம் \"எடைக்கு எடை தங்கத்தைத் தங்கத்திற்கு விற்கலாம்\" என்றார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4076,
			"arabicnumber": "1591.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4077,
			"arabicnumber": "1591.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4078,
			"arabicnumber": "1591.04",
			"text": "ஃபளாலா பின் உபைத் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் கைபர்போர் நாளில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் இருந்தபோது, (பொன்னும் மணியும் சேர்க்கப்பட்டிருந்த) தங்க \"ஊக்கியா\"வை இரண்டு மூன்று பொற்காசு (தீனார்)களுக்கு யூதர்களிடம் விற்றோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"எடைக்கு எடை சரியாகவே தவிர (வேறு முறையில்) தங்கத்திற்குத் தங்கத்தை விற்காதீர்கள்\" என்று கூறினார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4079,
			"arabicnumber": "1591.05",
			"text": "ஹனஷ் பின் அப்தில்லாஹ் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் ஃபளாலா பின் உபைத் (ரலி) அவர்களுடன் ஒரு போரில் இருந்தோம். எனக்கும் என் தோழர்களுக்கும் (போர்ச் செல்வத்தின் பங்காக) மாலை ஒன்று கிடைத்தது. அதில் பொன், வெள்ளி, முத்து ஆகியன சேர்க்கப்பட்டிருந்தன. அதை நான் விலைக்கு வாங்க விரும்பினேன். எனவே, ஃபளாலா பின் உபைத் (ரலி) அவர்களிடம் அதைப் பற்றிக் கேட்டேன். அப்போது அவர்கள், மாலையிலுள்ள தங்கத்தைத் தனியே எடுத்து, அதைத் தராசின் ஒரு தட்டிலும், உனது தங்கத்தை மற்றொரு தட்டிலும் வைப்பீராக. பிறகு சரிக்குச் சரியாகவே தவிர (வேறு முறையில்) நீ (தங்கத்தைத் தங்கத்திற்கு) பெற்றுக்கொள்ள வேண்டாம். ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அல்லாஹ்வையும் மறுமை நாளையும் நம்பிக்கை கொண்டவர் சரிக்குச் சரியாகவே தவிர (வேறு முறையில் தங்கத்தைத் தங்கத்திற்கும் வெள்ளியை வெள்ளிக்கும்) பெற வேண்டாம்\" என்று கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4080,
			"arabicnumber": "1592",
			"text": "புஸ்ர் பின் சயீத் (ரஹ்) அவர்கள் கூறியதாவது: மஅமர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் ஒரு \"ஸாஉ\" தொலி நீக்கப்பட்ட கோதுமையைத் தம் அடிமையிடம் கொடுத்து, \"இதை விற்றுவிட்டு அந்தக் காசைக் கொண்டு தொலி நீக்கப்படாத கோதுமை வாங்கி வா\" என்று அனுப்பினார்கள். அந்த அடிமை சென்று, அதைக் கொடுத்து ஒரு \"ஸாஉ\" கோதுமையும் சற்று கூடுதலாகவும் பெற்றுவந்தார். அவர் மஅமர் (ரலி) அவர்களிடம் வந்து நடந்ததைத் தெரிவித்தார். அதற்கு மஅமர் (ரலி) அவர்கள், \"ஏன் அவ்வாறு செய்தாய்? நீ சென்று அதைத் திருப்பிக் கொடுத்துவிடு. சரிக்குச் சரியாகவே தவிர (வேறு முறையில் உணவுப் பொருளை) வாங்காதே. ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"சரிக்குச் சரியாகவே உணவுப் பொருளை உணவுப் பொருளுக்கு (விற்கப்படும்)\" என்று கூறியதை நான் செவியுற்றுள்ளேன்\" என்றார்கள். மேலும் மஅமர் (ரலி) அவர்கள், \"அன்றைய நாளில் தொலி நீக்கப்படாத கோதுமையே எங்கள் உணவாக இருந்தது\"என்று கூறினார்கள். அப்போது அவர்களிடம் \"இது (தொலி நீக்கப்படாத கோதுமை), அதைப் போன்று (தொலி நீக்கப்பட்ட கோது மையைப் போன்று ஒரே இனமாக) இல்லையே?\" என்று கேட்கப்பட்டது. அதற்கு அவர்கள், \"அது ஒன்றுக்கொன்று ஒப்பானதாக இருக்குமோ என நான் அஞ்சுகிறேன்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4081,
			"arabicnumber": "1593.01",
			"text": "அபூஹுரைரா (ரலி) மற்றும் அபூசயீத் அல்குத்ரீ (ரலி) ஆகியோர் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பனூ அதீ அல்அன்சாரீ குலத்தைச் சேர்ந்த ஒருவரை கைபர் பகுதியின் அதிகாரியாக நியமித்து அனுப்பிவைத்தார்கள். அவர் (சென்றுவிட்டு கைபரிலிருந்து) உயர் ரகப் பேரீச்சம் பழங்களைக் கொண்டுவந்தார். அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"கைபரின் பேரீச்சம் பழங்கள் அனைத்துமே இப்படித்தான் (உயர் ரகமானதாக) இருக்குமா?\" என்று கேட்டார்கள். அதற்கு அவர், \"இல்லை; அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதரே! நாங்கள் மட்டமான பேரீச்சம் பழத்தில் இரண்டு \"ஸாஉ\"களைக் கொடுத்து விட்டு, (இந்த உயர்ரகப் பேரீச்சம் பழத்தில்) ஒரு \"ஸாஉ\" வாங்குவோம்\" என்று சொன்னார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவ்வாறு செய்யாதீர்கள். (உணவுப் பொருளை) சரிக்குச் சமமாகவே வாங்குங்கள். அல்லது (உங்களிடமுள்ள) இந்த (மட்டமான) பேரீச்சம் பழத்தை விற்றுவிட்டு, அந்தத் தொகைக்கு அ(ந்த உயர்ரகப் பேரீச்சம் பழத்)தை வாங்குங்கள். இவ்வாறுதான் நிறுக்கப்படும் பொருட்களின் சட்டமும்\" என்று சொன்னார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4082,
			"arabicnumber": "1593.02",
			"text": "அபூஹுரைரா (ரலி) மற்றும் அபூசயீத் அல்குத்ரீ (ரலி) ஆகியோர் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு மனிதரை கைபர் பகுதியின் அதிகாரியாக நியமித்(து அனுப்பிவைத்)தார்கள். அவர் (சென்றுவிட்டு) உயர்ரகப் பேரீச்சம் பழங்களைக் கொண்டுவந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"கைபரின் பேரீச்சம் பழங்கள் எல்லாமே இப்படித்தான் (உயர் ரகமானதாக) இருக்குமா?\" என்று கேட்டார்கள். அவர், \"இல்லை; அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதரே! நாங்கள் மட்டரகப் பேரீச்சம் பழங்களில் இரண்டு \"ஸாஉ\"கள் கொடுத்து ஒரு \"ஸாஉ\" இந்த (உயர் ரகப் பேரீச்சம்) பழம் வாங்குகிறோம்; அல்லது மட்டரகப் பேரீச்சம் பழங்களில் மூன்று \"ஸாஉ\"கள் கொடுத்து, (இந்த உயர்ரகப் பேரீச்சம் பழங்களில்) இரண்டு \"ஸாஉ\"கள் வாங்குகிறோம்\" என்று கூறினார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவ்வாறு செய்யாதீர்! மட்டரகமான பேரீச்சம் பழங்களை வெள்ளிக் காசுகளுக்கு விற்றுவிட்டு, அந்த வெள்ளிக் காசுகளுக்கு உயர் ரகப் பேரீச்சம் பழங்களை வாங்குவீராக!\" என்று சொன்னார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4083,
			"arabicnumber": "1594.01",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: பிலால் (ரலி) அவர்கள் (\"பர்னீ\" எனப்படும்) உயர்ரகப் பேரீச்சம் பழங்களுடன் வந்தார்கள். அவர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இது எங்கிருந்து கிடைத்தது?\" என்று கேட்டார்கள். அதற்கு பிலால் (ரலி) அவர்கள், \"என்னிடம் மட்ட ரகப் பேரீச்சம் பழங்கள் இருந்தன; நபி (ஸல்) அவர்களின் உணவுக்காக அதில் இரண்டு \"ஸாஉ\"கள் கொடுத்து இ(ந்த உயர் ரகப் பேரீச்சம் பழத்)தில் ஒரு \"ஸாஉ\" வாங்கினேன்\" என்றார். அந்த நேரத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஆ! இது வட்டியேதான்! இவ்வாறு செய்யாதீர்கள். நீங்கள் இந்த (உயர் ரக)ப் பேரீச்சம் பழத்தை வாங்க விரும்பினால் உங்களிடமுள்ள அ(ந்த மட்டரகப் பேரீச்சம் பழத்)தைத் தனியாக விற்றுவிட்டு, பிறகு அந்தத் தொகையின் மூலம் (உயர் ரகப் பேரீச்சம் பழத்தை) வாங்கிக்கொள்ளுங்கள்\" என்றார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் முஹம்மத் பின் சஹ்ல் அத்தமீமீ (ரஹ்) அவர்களது அறிவிப்பில் \"அந்த நேரத்தில்\" எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4084,
			"arabicnumber": "1594.02",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் பேரீச்சம் பழங்கள் கொண்டுவரப்பட்டன. அப்போது அவர்கள், \"இது என்ன?நம் பேரீச்சம் பழங்களுக்கு வேறுபடுகிறதே!\" என்று கேட்டார்கள். அதற்கு (பேரீச்சம் பழங்களைக் கொண்டுவந்த) அந்த மனிதர், \"அல்லாஹ்வின் தூதரே! நம் பேரீச்சம் பழங்களில் இரண்டு \"ஸாஉ\"கள் கொடுத்துவிட்டு, இ(ந்த உயர் ரகப் பேரீச்சம் பழத்)தில் ஒரு \"ஸாஉ\" வாங்கினோம்\" என்றார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதுதான் வட்டியாகும். இதைத் திருப்பிக் கொடுத்துவிடுங்கள்; பிறகு நமது பேரீச்சம் பழத்தை (தனியே) விற்றுவிட்டு, (அந்தத் தொகையின் மூலம்) நமக்காக இந்த (உயர் ரகப்) பேரீச்சம் பழத்தை வாங்குங்கள்\" என்று கூறினார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4085,
			"arabicnumber": "1595",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் மட்டரகப் பேரீச்சம் பழங்கள் எங்களுக்கு வழங்கப்படும். அவை கலப்புப் பேரீச்சம் பழங்களாகும். அவற்றில் இரண்டு \"ஸாஉ\"களுக்கு ஒரு \"ஸாஉ\" (உயர் ரகப் பேரீச்சம்பழம்) என்ற அடிப்படையில் நாங்கள் விற்பனை செய்து வந்தோம். இச்செய்தி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு எட்டியபோது, \"ஒரு \"ஸாஉ\"க்கு இரண்டு \"ஸாஉ\"கள் பேரீச்சம் பழங்கள் கூடாது; ஒரு ஸாஉக்கு இரண்டு \"ஸாஉ\"கள் தொலி நீக்கப்பட்ட கோதுமையும் கூடாது; இரண்டு வெள்ளி திர்ஹங்களுக்கு ஒரு வெள்ளி திர்ஹமும் கூடாது\" என்று கூறினார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4086,
			"arabicnumber": "1594.03",
			"text": "அபூநள்ரா முன்திர் பின் மாலிக் (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் நாணயமாற்று வணிகம் பற்றி வினவினேன். அப்போது அவர்கள் \"உடனுக்குடன் மாற்றிக்கொள்கிறீர்களா?\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். அதற்கு அவர்கள், \"அவ்வாறாயின் குற்றமில்லை\" என்றார்கள். பிறகு அபூசயீத் (ரலி) அவர்களிடம் நான் இதைத் தெரிவித்தேன்; \"நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் நாணயமாற்று வணிகம் குறித்துக் கேட்டேன். அவர்கள் \"உடனுக்குடன் மாற்றிக்கொள்கிறீர்களா\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். அவ்வாறாயின் குற்றமில்லை\" என்று அவர்கள் கூறினார்கள்\" என்றேன். அபூசயீத் (ரலி) அவர்கள், \"அவ்வாறா சொன்னார்கள். நாம் அவருக்குக் கடிதம் எழுதுகிறோம். இனி அவ்வாறு உங்களுக்குத் தீர்ப்பளிக்கமாட்டார்\" என்று கூறிவிட்டுப் பின்வருமாறு தெரிவித்தார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் ஊழியர்களில் ஒருவர், ஒருவகைப் பேரீச்சம் பழத்தைக் கொண்டுவந்தார். அந்தப் பழங்களை அந்நியமாகக் கண்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இது நமது மண்ணில் விளையும் பேரீச்சம் பழங்கள் இல்லை போலிருக்கிறதே?\" என்று கேட்டார்கள். அவர், \"இந்த ஆண்டு நமது மண்ணில் அல்லது நமது பேரீச்சம் பழங்களில் சில (மட்டரகமான பழங்கள்) இருந்தன. எனவே, அவற்றையும் அவற்றுடன் இன்னும் சிறிதளவு கூடுதல் பழத்தையும் கொடுத்து, இ(வ்வகைப் பேரீச்சம் பழத்)தைப் பெற்றேன்\" என்று கூறினார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"கூடுதலாகக் கொடுத்துவிட்டாய்; வட்டியாக்கிவிட்டாய். இதை நமக்கு அருகில் கொண்டுவர வேண்டாம். உம்முடைய பேரீச்சம் பழங்களில் ஒன்று உமக்குச் சந்தேகத்தை ஏற்படுத்தினால் அதை விற்றுவிட்டு, பின்னர் (அந்தத் தொகையை வைத்து) நீ விரும்புகின்ற (பேரீச்சம் பழ இனத்)தை வாங்கிக்கொள்\"என்று கூறினார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4087,
			"arabicnumber": "1594.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4088,
			"arabicnumber": "1596.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4089,
			"arabicnumber": "1596.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: வட்டி என்பதே கடனில்தான். இதை உசாமா பின் ஸைத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4090,
			"arabicnumber": "1596.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உடனுக்குடன் நிகழ்ந்த (நாணயமாற்று வணிகத்)தில் வட்டி கிடையாது. இதை உசாமா பின் ஸைத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4091,
			"arabicnumber": "1596.04",
			"text": "அதாஉ பின் அபீரபாஹ் (ரஹ்) அவர்கள் கூறியதாவது: அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் இப்னு அப்பாஸ் (ரலி) அவர்களைச் சந்தித்து, \"நாணயமாற்று விஷயத்தில் தாங்கள் சொல்லிவருவதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து நீங்கள் செவியுற்றீர்களா? அல்லது இறைவேதத்தில் கண்டதைக் கூறுகிறார்களா?\" என்று கேட்டார்கள். அதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள், \"இல்லை; அவ்வாறு நான் சொல்லவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பற்றி நீங்கள் நன்கு அறிவீர்கள். அல்லாஹ்வின் வேதத்தில் உள்ளதாகவும் எனக்குத் தெரியவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அறிக; வட்டி என்பதே கடனில்தான்\" என்று கூறினார்கள் என உசாமா பின் ஸைத் (ரலி) அவர்கள்தாம் என்னிடம் சொன்னார்கள்\" என்று விடையளித்தார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4092,
			"arabicnumber": "1597",
			"text": "அல்கமா பின் கைஸ் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வட்டி வாங்குபவரையும் வட்டி கொடுப்பவரையும் சபித்தார்கள்\" என்று கூறினார்கள். நான் \"அதற்குக் கணக்கு எழுதுபவரையும் அதன் இரு சாட்சிகளையும் (சபித்தார்கள் என்று சேர்த்துக் கூறுங்கள்)\" என்றேன். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"நாம் (அல்லாஹ்வின் தூதரிடமிருந்து) செவியுற்றதையே அறிவிக்கிறோம்\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4093,
			"arabicnumber": "1598",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், வட்டி வாங்குபவரையும் வட்டி கொடுப்பவரையும், அதற்குக் கணக்கு எழுதுபவரையும் அதன் இரு சாட்சிகளையும் சபித்தார்கள். மேலும், \"இவர்கள் அனைவரும் (பாவத்தில்) சமமானவர்கள் ஆவர்\" என்று கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4094,
			"arabicnumber": "1599.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அனுமதிக்கப்பட்டதும் (ஹலால்) தெளிவானது; தடை செய்யப்பட்டதும் (ஹராம்) தெளிவானது. இவ்விரண்டிற்கும் இடையில் சந்தேகத்திற்கிடமானவையும் (முஷ்தபிஹாத்) இருக்கின்றன. மக்களில் பெரும்பாலோர் அவற்றை அறியமாட்டார்கள். எனவே, யார் சந்தேகத்திற்கிடமானவற்றைத் தவிர்த்துக்கொள்கிறாரோ அவர் தமது மார்க்கத்தையும் தமது மானத்தையும் காப்பாற்றிக்கொள்கிறார். யார் சந்தேகத்திற்கிடமானவற்றில் தலையிடுகிறாரோ அவர் அனுமதிக்கபடாதவற்றில் தலையிடுகிறார். வேலியோரங்களில் (கால்நடைகளை) மேய்ப்பவர், வேலிக்குள்ளேயே (கால்நடைகளை) மேயவிட நேரும். அறிக! ஒவ்வொரு மன்னனுக்கும் ஓர் எல்லை உண்டு. அல்லாஹ்வின் எல்லை அவனால் தடை விதிக்கப்பெற்றவையே. அறிக! உடலில் ஒரு சதைத் துண்டு இருக்கிறது. அது சீரடைந்துவிட்டால் உடல் முழுவதும் சீரடைந்துவிடும். அது சீரழிந்துவிட்டால் முழு உடலும் சீரழிந்துவிடும். அறிக! அதுவே இதயம். இதை நுஅமான் பின் பஷீர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இதை அவர்கள் அறிவிக்கும்போது தம்மிரு காதுகளை நோக்கி இரு விரல்களால் சைகை செய்து (இந்தக் காதுகளால்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மேற்கண்டவாறு) கூறியதைக் கேட்டேன் என்றார்கள். - மேற்கண்ட ஹதீஸ் நுஅமான் பின் பஷீர் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. ஆயினும், மேற்கண்ட ஹதீஸே மற்றதை விட முழுமையானதும் பெரியதும் ஆகும். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4095,
			"arabicnumber": "1599.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4096,
			"arabicnumber": "1599.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4097,
			"arabicnumber": "1599.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4098,
			"arabicnumber": "715.13",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் (ஒரு பயணத்திலிருந்து திரும்பு கையில்) நன்றாக இயங்காதிருந்த எனது ஒட்டகத்தில் சென்றுகொண்டிருந்தேன். அதற்கு ஓய்வு கொடுக்க நான் எண்ணியிருந்தேன். அப்போது என்னிடம் வந்து சேர்ந்த நபி (ஸல்) அவர்கள் எனக்காகப் பிரார்த்தித்தார்கள்; எனது ஒட்டகத்தை அடித்தார்கள். அது முன்னெப்போதும் இல்லாத அளவுக்கு (மிக வேகமாக) ஓடியது. பிறகு நபி (ஸல்) அவர்கள் \"இ(ந்த ஒட்டகத்)தை ஓர் \"ஊக்கியா\"வுக்கு எனக்கு விற்றுவிடு\" என்று கேட்டார்கள். நான் \"இல்லை\" என்றேன். பிறகு (மீண்டும்) \"இதை எனக்கு விற்றுவிடு\" என்று கேட்டார்கள். நான் ஓர் \"ஊக்கியா\"வுக்கு அதை விற்றேன்; ஆனால், என் வீட்டாரிடம் போய்ச் சேரும்வரை அதில் பயணம் செய்துகொள்வதற்கு என்னை அனுமதிக்க வேண்டும் என்று நிபந்தனையிட்டேன். (அவர்களும் அந்த நிபந்தனையை ஏற்றார்கள்.) நான் (மதீனாவுக்கு) வந்து சேர்ந்தபோது, அந்த ஒட்டகத்தை நபி (ஸல்) அவர்களிடம் (ஒப்படைக்க) கொண்டுசென்றேன். அவர்கள் அதன் விலையை எனக்குக் கொடுத்தார்கள். பிறகு நான் திரும்பிச் சென்றபோது, எனக்குப் பின்னாலேயே நபி (ஸல்) அவர்கள் ஆளனுப்பி (என்னை மீண்டும் அழைத்து), \"உனது ஒட்டகத்தை நான் எடுத்துக்கொள்வதற்காக அதன் விலையை நான் குறைத்து விடுவேன் என நீ எண்ணிக்கொண்டாயா? (என்னிடம் தர வேண்டிய) உனது ஒட்டகத்தையும், உனக்குச் சேர வேண்டிய வெள்ளிக் காசுகளையும் நீயே எடுத்துக்கொள். அது உனக்குரியதுதான்\"என்றார்கள். - மேற்கண்ட ஹதீஸ் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4099,
			"arabicnumber": "715.14",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4100,
			"arabicnumber": "715.15",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஓர் அறப்போருக்குச் சென்றேன். நன்றாக இயங்காதிருந்த, நடக்க முடியாமல் நடந்துகொண்டிருந்த, தண்ணீர் சுமக்கும் எனது ஒட்டகம் ஒன்றின் மீது அமர்ந்து நான் சென்றுகொண்டிருந்தபோது (வழியில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னை வந்தடைந்தார்கள். என்னிடம், \"உனது ஒட்டகத்திற்கு என்ன நேர்ந்தது?\" என்று கேட்டார்கள். நான் \"நோய் கண்டுள்ளது\" என்றேன். அதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சற்று பின்வாங்கி அதை அதட்டினார்கள்; அதற்காகப் பிரார்த்தனையும் செய்தார்கள். உடனே அது (வேகமாக ஓடி) எல்லா ஒட்டகங்களுக்கும் முன்னே சென்றுகொண்டிருந்தது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம், \"உனது ஒட்டகத்தை (இப்போது) எப்படிக் காண்கிறாய்?\" என்று கேட்டார்கள். நான் \"நல்ல நிலையில் காண்கிறேன். தங்களது (பிரார்த்தனையின்) வளம் அதற்குக் கிடைத்து விட்டது\" என்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீ அதை எனக்கு விற்றுவிடுகிறாயா?\" என்று கேட்டார்கள். நான் (நபியவர்களுக்கு விலைக்கு விற்க) வெட்கப்பட்டேன். (அத் துடன்) எங்களிடம் அதைத் தவிர தண்ணீர் சுமக்கும் ஒட்டகம் வேறெதுவும் இருக்க வில்லை. பின்னர் நான், \"சரி (விற்றுவிடுகிறேன்) என்றேன். ஆயினும், மதீனா சென்றடையும்வரை அதன் மீது பயணம் செய்துகொள்ள என்னை அனுமதிக்க வேண்டும் எனும் நிபந்தனையின் பேரில் அவர்களுக்கு அந்த ஒட்டகத்தை விற்றுவிட்டேன். பின்னர், \"அல்லாஹ்வின் தூதரே! நான் புது மாப்பிள்ளை\" என்று சொல்லி (ஊருக்கு விரைவாகச் செல்ல) அனுமதி கேட்டேன். அவர்கள் எனக்கு அனுமதியளித்தார்கள். ஆகவே, நான் மக்களைவிட முன்னதாகச் சென்று மதீனாவை அடைந்துவிட்டேன். அப்போது என் தாய் மாமன் (ஜத்து பின் கைஸ் அவர்கள் என்னைச்) சந்தித்து ஒட்டகத்தைப் பற்றிக் கேட்டார். நான் அதை என்ன செய்தேன் என்பதை அவரிடம் தெரிவித்தேன். அதற்காக அவர் என்னைக் கடிந்துகொண்டார். நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (நான் புது மாப்பிள்ளை என்று சொல்லி) மதீனாவுக்கு விரைவாக செல்ல அனுமதி கேட்டபோது அவர்கள் என்னிடம், \"நீ யாரை மணந்து கொண்டாய்? கன்னிப் பெண்ணையா, கன்னி கழிந்த பெண்ணையா?\" என்று கேட்டார்கள். நான், \"கன்னி கழிந்த பெண்ணைத்தான் மணந்துகொண்டேன்\" என்றேன். \"கன்னிப் பெண்ணை மணந்து கொண்டு, அவளோடு நீயும் உன்னோடு அவளுமாகக் கூடிக்குலவி மகிழ்ந்திருக்கலாமே?\"என்று கூறினார்கள். நான், \"அல்லாஹ்வின் தூதரே! எனக்குச் சிறு வயது சகோதரிகள் பலர் இருக்கும் நிலையில் என் தந்தை (உஹுதுப் போரில்) \"இறந்துவிட்டார்கள்\" அல்லது \"கொல்லப்பட்டு விட்டார்கள்\". ஆகவே, அவர்களுக்கு ஒழுக்கம் கற்பிக்கவோ,அவர்களைப் பராமரிக்கவோ முன்வராத, அவர்களைப் போன்றே (அனுபவமற்ற இளவயதுப் பெண்) ஒருத்தியை மணந்து, அவர்களிடம் அழைத்துச் செல்ல நான் விரும்பவில்லை. ஆகவே, அவர்களைப் பராமரிப்பதற்காகவும் அவர்களுக்கு ஒழுக்கம் கற்பிப்பதற்காகவும் (வாழ்ந்து பக்குவப்பட்ட) கன்னி கழிந்த ஒரு பெண்ணையே நான் மணந்துகொண்டேன்\" என்று விடையளித்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவுக்கு வந்து சேர்ந்தபோது, காலையில் ஒட்டகத்துடன் அவர்களிடம் சென்றேன். எனக்கு அதன் விலையைக் கொடுத்தார்கள். பிறகு அந்த ஒட்டகத்தையும் என்னிடமே திருப்பிக் கொடுத்துவிட்டார்கள் (அன்பளிப்பாக). இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4101,
			"arabicnumber": "715.16",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4102,
			"arabicnumber": "715.17",
			"text": "மேற்கண்ட ஹதீஸ் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"நாங்கள் ஒரு பயணத்தில் நபி (ஸல்) அவர்களுடன் இருந்தோம். அப்போது எனது ஒட்டகம் பின்தங்கிவிட்டது...\"என ஹதீஸ் ஆரம்பமாகிறது. அதில், \"பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அ(ந்த ஒட்டகத்)தைக் குத்தினார்கள். பிறகு என்னிடம், அல்லாஹ்வின் பெயரால் இதில் ஏறிச்செல் என்றார்கள்\" என்றும் இடம்பெற்றுள்ளது. மேலும், \"எனக்கு அதிகமாகக் கொடுத்துக்கொண்டே \"அல்லாஹ் உன்னை மன்னிப்பானாக!\" எனப் பிரார்த்தித்துக் கொண்டிருந்தார்கள்\" என அதிகப்படியாக இடம்பெற்றுள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4103,
			"arabicnumber": "715.18",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: (பயணத்தில்) எனது ஒட்டகம் நன்றாக இயங்காதிருந்த நிலையில் நபி (ஸல்) அவர்கள் என்னிடம் வந்தார்கள். பிறகு எனது ஒட்டகத்தைக் குத்தினார்கள். அது குதித்தோடலாயிற்று. பின்னர் நபி (ஸல்) அவர்கள் சொல்வதைக் கேட்பதற்காக அதன் கடிவாளத்தைப் பிடித்து அதன் வேகத்தை மட்டுப்படுத்திக்கொண்டிருந்தேன். ஆனால், என்னால் முடியவில்லை. பிறகு நபி (ஸல்) அவர்கள் என்னை வந்தடைந்த போது, \"அதை எனக்கு விற்றுவிடு\" என்றார்கள். நான் அதை ஐந்து \"ஊக்கியா\"க்களுக்கு அவர்களுக்கு விற்றுவிட்டேன். அப்போது \"மதீனா சென்றடையும்வரை அதன் மீது பயணம் செய்துகொள்ள என்னை அனுமதிக்க வேண்டும் எனும் நிபந்தனையின்பேரில்\" என்று சொன்னேன். நபி (ஸல்) அவர்கள் \"மதீனா சென்றடையும்வரை அதன் மீது நீ பயணம் செய்துகொள்ளலாம்\" என்றார்கள். நான் மதீனா வந்து சேர்ந்தபோது, அந்த ஒட்டகத்தை அவர்களிடம் (ஒப்படைக்க) கொண்டுசென்றேன். (அதன் விலையையும்) கூடுதலாக ஓர் \"ஊக்கியா\"வும் அவர்கள் எனக்குக் கொடுத்தார்கள். பின்னர் அந்த ஒட்டகத்தையும் எனக்கு அன்பளிப்பாகத் தந்துவிட்டார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4104,
			"arabicnumber": "715.19",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஒரு பயணத்தில் -(\"அறப்போர் வீரனாக\" என்றும் கூறினார்கள் என்றே எண்ணுகிறேன்)- கலந்துகொண்டேன். மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. மேலும், பின்வருமாறு கூடுதலாகவும் இடம்பெற்றுள்ளது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஜாபிர்! (ஒட்டகத்தின்) விலை முழுவதையும் பெற்றுக் கொண்டாயா?\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"விலையும் உனக்கே உரியது; ஒட்டகமும் உனக்கே உரியது. விலையும் உனக்கே உரியது; ஒட்டகமும் உனக்கே உரியது\" என்றார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4105,
			"arabicnumber": "715.20",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஒரு முறை) இரண்டு \"ஊக்கியா\"க்களுடன் ஒரு திர்ஹம் அல்லது இரண்டு திர்ஹங்களைக் கொடுத்து என்னிடமிருந்து ஓர் ஒட்டகத்தை வாங்கினார்கள். (மதீனாவிற்கு அருகிலுள்ள) \"ஸிரார்\"எனுமிடத்திற்கு அவர்கள் வந்தபோது, ஒரு மாட்டை அறுக்கும்படி உத்தரவிட்டார்கள். அதன்படி அறு(த்து சமை)க்கப்பட்டது. அதை அனைவரும் உண்டார்கள். மதீனாவுக்கு வந்தபோது, பள்ளிவாசலுக்குச் சென்று இரண்டு ரக்அத்கள் தொழும்படி எனக்கு உத்தரவிட்டார்கள். (பின்னர்) ஒட்டகத்தின் விலையை எனக்குக் கொடுத்தார்கள். சற்று தாராளமாகவே நிறுத்தார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4106,
			"arabicnumber": "715.21",
			"text": "மேற்கண்ட ஹதீஸ் ஜாபிர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. ஆயினும் அதில், \"ஒரு தொகையைக் குறிப்பிட்டு என்னிடமிருந்து அ(ந்த ஒட்டகத்)தை வாங்கிக்கொண்டார்கள்\" என்று இடம்பெற்றுள்ளது. இரண்டு \"ஊக்கியா\"க்களுடன் ஒரு திர்ஹம் அல்லது இரண்டு திர்ஹங்களைக் கொடுத்து எனும் (ஐயப்பாட்டுடனான) குறிப்பு இல்லை. மேலும் அதில், \"ஒரு மாட்டை அறுக்கும்படி உத்தரவிட்டார்கள். அவ்வாறே அது அறுக்கப்பட்டது. பின்னர் அதன் இறைச்சியைப் பங்கிட்டார்கள்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4107,
			"arabicnumber": "715.22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4108,
			"arabicnumber": "1600.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4109,
			"arabicnumber": "1600.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4110,
			"arabicnumber": "1601.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4111,
			"arabicnumber": "1601.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4112,
			"arabicnumber": "1601.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4113,
			"arabicnumber": "1602",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: ஓர் அடிமை நபி (ஸல்) அவர்களிடம் வந்து, நாடு துறந்து (ஹிஜ்ரத்) செல்ல உறுதிமொழி அளித்தார். அவர் ஓர் அடிமை என்பது நபி (ஸல்) அவர்களுக்குத் தெரிந்திருக்கவில்லை. பின்னர் அவருடைய உரிமையாளர் நபி (ஸல்) அவர்களைத் தேடிவந்(து, அது பற்றி முறையீடு செய்)தார். நபி (ஸல்) அவர்கள் அவரிடம், \"அவரை எனக்கு விற்றுவிடு\"என்று கூறி விட்டு, இரு கறுப்பு அடிமைகளைக் கொடுத்து அவரை வாங்கிக் கொண்டார்கள். பின்னர் \"ஒருவர் அடிமையா?\" என்று கேட்காத வரை (தம்மிடம் உறுதிமொழி அளிக்க வருபவர்) எவரிடமும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உறுதிமொழி பெறவில்லை. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4114,
			"arabicnumber": "1603.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு யூதரிடமிருந்து உணவுப் பொருளை (கடனாக) வாங்கினார்கள். (அதற்காக) இரும்புக் கவசத்தை அடகு வைத்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4115,
			"arabicnumber": "1603.02",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு யூதரிடமிருந்து உணவுப் பொருளைக் கடனாக வாங்கினார்கள். அதற்காகத் தமது (இரும்புக்) கவசத்தை அவரிடம் அடகு வைத்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4116,
			"arabicnumber": "1603.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4117,
			"arabicnumber": "1603.04",
			"text": "சுலைமான் பின் மிஹ்ரான் அல் அஃமஷ் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்களிடம் முன்பண வணிகத்தில் (சலம்) அடைமானம் பற்றிப் பேசினோம். அப்போது இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் யூதர் ஒருவரிடமிருந்து ஒரு குறிப்பிட்ட தவணைக்கு உணவுப் பொருளை (கடனாக) வாங்கினார்கள்; அதற்காகத் தமது இரும்புக் கவசத்தை அடைமானம் வைத்தார்கள் என்று ஆயிஷா (ரலி) அவர்கள் கூறினார்கள் என நமக்கு அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் அறிவித்தார்கள்\" என்று சொன்னார்கள். - மேற்கண்ட ஹதீஸ் ஆயிஷா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. - அதில், \"இரும்பு\" எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4118,
			"arabicnumber": "1604.01",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவுக்கு வந்த போது, மக்கள் ஓராண்டு அல்லது ஈராண்டுகளில் பெற்றுக்கொள்வதாகக் கூறி,பேரீச்சம் பழத்திற்காக முன்பணம் கொடுத்துவந்தனர். நபி(ஸல்) அவர்கள், \"ஒருவர் (இவ்வாறு) பின்னால் பெற்றுக்கொள்வதாகக் கூறி, பேரீச்சம் பழத்திற்காக முன்பணம் கொடுப்பதானால், குறிப்பிட்ட எடைக்காகவும் அளவுக்காகவும் குறிப்பிட்ட தவணைக்கு மட்டுமே கொடுக்கட்டும்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4119,
			"arabicnumber": "1604.02",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மதீனாவுக்கு) வந்தபோது, (பின்னர் பொருளைப் பெற்றுக்கொள்வதாகக் கூறி) மக்கள் முன்பணம் செலுத்திவந்தனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(பொருளைப் பின்னர் பெற்றுக் கொள்வதாகக் கூறி) முன்பணம் கொடுப்பவர், குறிப்பிட்ட அளவுக்காகவும் குறிப்பிட்ட எடைக்காகவுமே முன்பணம் கொடுக்கட்டும்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் இப்னு அப்பாஸ் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"குறிப்பிட்ட தவணைக்கு\" எனும் குறிப்பு இல்லை. - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"குறிப்பிட்ட தவணைக்கு\" எனும் குறிப்பு இடம்பெற்றுள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4120,
			"arabicnumber": "1604.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4121,
			"arabicnumber": "1604.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4122,
			"arabicnumber": "1605.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4123,
			"arabicnumber": "1605.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4124,
			"arabicnumber": "1605.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4125,
			"arabicnumber": "1606",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4126,
			"arabicnumber": "1607",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4127,
			"arabicnumber": "1608.01",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4128,
			"arabicnumber": "1608.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4129,
			"arabicnumber": "1608.03",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4130,
			"arabicnumber": "1609.01",
			"text": "அப்துர் ரஹ்மான் பின் ஹுர்முஸ் அல்அஃரஜ் (ரஹ்) அவர்கள் கூறியதாவது: அபூஹுரைரா (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"ஒருவர் தமது வீட்டுச் சுவரில் தம் அண்டை வீட்டுக்காரர் மரக்கட்டை (சாரம்) பதிப்பதைத் தடுக்க வேண்டாம்\" என்று கூறினார்கள்\" என்று சொல்லிவிட்டு, \"என்ன இது? (நபியவர்களின்) இ(ந்த உபதேசத்)தைப் புறக்கணிப்பவர்களாகவே உங்களை நான் காண்கிறேனே! அல்லாஹ்வின் மீதாணையாக! (உங்களுக்குப் பிடிக்காவிட்டாலும்) இதை நான் உங்களுக்கு வலியுறுத்திக் கொண்டுதான் இருப்பேன்\"என்று கூறுவார்கள். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4131,
			"arabicnumber": "1609.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4132,
			"arabicnumber": "1610.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் ஒரு சாண் அளவு நிலத்தை அநியாயமாக அபகரிக்கிறாரோ, அவரது கழுத்தில் அல்லாஹ் மறுமை நாளில் அந்த நிலத்தி(ன் மேற்பகுதியி)லிருந்து ஏழு பூமிகள்வரை (செல்லும் பகுதியை) மாலையாக மாட்டுவான். இதை சயீத் பின் ஸைத் பின் அம்ர் பின் நுஃபைல் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4133,
			"arabicnumber": "1610.02",
			"text": "சயீத் பின் ஸைத் பின் அம்ர் பின் நுஃபைல் (ரலி) அவர்கள் கூறியதாவது: அர்வா பின்த் உவைஸ் என்ற பெண், எனக்குரிய வீட்டின் ஒரு பகுதி தொடர்பாக வழக்காடினாள். அப்போது நான், \"அவளையும் அந்த வீட்டையும் விட்டுவிடுங்கள். ஏனெனில், \"யார் நியாயமின்றி (பிறருக்குச் சொந்தமான) ஒரு சாண் நிலத்தைக் கைப்பற்றிக் கொள்கிறாரோ, அவரது கழுத்தில் மறுமை நாளில் அந்த நிலத்தி(ன் மேற்பகுதியி)லிருந்து ஏழு பூமிகள்வரை (செல்லும் பகுதி) மாலையாக மாட்டப்படும்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை நான் கேட்டுள்ளேன். இறைவா! அவள் (தனது வாதத்தில்) பொய் சொல்பவளாக இருந்தால், அவளது பார்வையைப் பறித்துவிடு. அவளது சவக்குழியை அந்த வீட்டிலேயே அமைத்துவிடு\" என்று கூறினேன். இந்த ஹதீஸை சயீத் பின் ஸைத் (ரலி) அவர்களிடமிருந்து அறிவிக்கும் முஹம்மத் பின் ஸைத் பின் அப்தில்லாஹ் பின் உமர் (ரஹ்) அவர்கள் கூறுகிறார்கள்: பின்னர் நான் அந்தப் பெண்ணைப் பார்வையற்றவளாகப் பார்த்தேன். அவள் சுவர்களைத் தடவிக்கொண்டு இருந்தாள். \"சயீத் பின் ஸைதின் பிரார்த்தனை எனது விஷயத்தில் பலித்துவிட்டது\" என்று கூறுவாள். இந்நிலையில் அவள் (ஒரு நாள்) தனது வீட்டில் நடந்துகொண்டிருந்தபோது, வீட்டுக்குள்ளிருந்த கிணறு ஒன்றை அவள் கடந்து சென்றாள். அப்போது அதில் அவள் (தவறி) விழுந்துவிட்டாள். அதுவே அவளது சவக்குழியாக அமைந்தது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4134,
			"arabicnumber": "1610.03",
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: சயீத் பின் ஸைத் (ரலி) அவர்கள் தமது நிலத்தில் ஒரு பகுதியை ஆக்கிரமித்துக் கொண்டார் என அர்வா பின்த் உவைஸ் (அல்லது உனைஸ்) என்ற பெண் குற்றம் சாட்டினார். (அப்போதைய மதீனாவின் ஆளுநர்) மர்வான் பின் அல்ஹகமிடம் சயீதுக்கு எதிராக அவர் வழக்குத் தொடுத்தார். (விசாரணையின்போது) சயீத் பின் ஸைத் (ரலி) அவர்கள், \"நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து (ஒரு ஹதீஸை) செவியுற்ற பிறகும் அவளது நிலத்தில் ஒரு பகுதியை அபகரிப்பேனா?\" என்று கேட்டார்கள். அதற்கு மர்வான் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து நீங்கள் என்ன செவியுற்றீர்கள்?\" என்று கேட்டார்கள். அதற்கு சயீத் (ரலி) அவர்கள், \"யார் ஒரு சாண் நிலத்தை அநியாயமாகக் கைப்பற்றிக்கொள்கிறாரோ அவரது கழுத்தில் அந்த நிலத்தி(ன் மேற்பகுதியி)லிருந்து ஏழு பூமிகள்வரை (செல்லும் பகுதி) மாலையாக மாட்டப்படும் என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள்.அதற்கு மர்வான், \"இதற்குப் பின் உங்களிடம் நான் ஆதாரம் கேட்கமாட்டேன்\" என்றார்கள். அப்போது சயீத் பின் ஸைத் (ரலி) அவர்கள் \"இறைவா! இவள் பொய் சொல்லியிருந்தால் அவளது பார்வையைப் பறித்துவிடு. அந்த நிலத்திலேயே அவளைக் கொன்றுவிடு\" என்று பிரார்த்தித்தார்கள். பிறகு பார்வை பறிபோனவளாகவே அவள் இறந்தாள். அவள் தனது நிலத்தில் நடந்து கொண்டிருந்தபோது ஒரு குழியில் (தவறி) விழுந்து மாண்டுபோனாள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4135,
			"arabicnumber": "1610.04",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4136,
			"arabicnumber": "1611",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4137,
			"arabicnumber": "1612.01",
			"text": "அபூசலமா அப்துல்லாஹ் பின் அப்திர் ரஹ்மான் பின் அவ்ஃப் (ரஹ்) அவர்கள் கூறியதாவது: எனக்கும் என் கூட்டத்தாருக்குமிடையே ஒரு நிலம் தொடர்பாகத் தகராறு இருந்துவந்தது. நான் ஆயிஷா (ரலி) அவர்களிடம் சென்று அதைப் பற்றிக் கூறினேன். ஆயிஷா (ரலி) அவர்கள், \"அபூசலமா! மண்ணாசையைத் தவிர்த்துக் கொள்க! ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"யார் அநியாயமாக ஒரு சாண் அளவு நிலத்தை ஆக்கிரமித்துக் கொள்கிறாரோ அவரது கழுத்தில் அந்த நிலத்தி(ன் மேற்பகுதியி)லிருந்து ஏழு பூமிகள்வரை (செல்லும் பகுதி) மாலையாக மாட்டப்படும்\" என்று கூறியுள்ளார்கள்\" என்றார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4138,
			"arabicnumber": "1612.02",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4139,
			"arabicnumber": "1613",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 178
			}
		}
	]
}