{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"25": "The Book of Wills"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4204,
			"arabicnumber": "1627.01",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4205,
			"arabicnumber": "1627.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4206,
			"arabicnumber": "1627.03",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4207,
			"arabicnumber": "1627.04",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிமான மனிதர் இறுதி விருப்பம் தெரிவிக்க ஏதேனும் ஒரு பொருளைப் பெற்றிருந்தால், அவர் தமது இறுதி விருப்பத்தை எழுதித் தம்மிடம் வைத்திருக்காமல் மூன்று இரவுகளைக்கூடக் கழிப்பதற்கு அனுமதியில்லை. இதன் அறிவிப்பாளரான அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறுகிறார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து இதைச் செவியுற்றதிலிருந்து எனது இறுதி விருப்பத்தை எழுதி என்னிடம் வைத்திருக்காமல் ஓர் இரவைக்கூட நான் கழித்ததில்லை. - மேற்கண்ட ஹதீஸ் மேலும் ஐந்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4208,
			"arabicnumber": "1627.05",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4209,
			"arabicnumber": "1628.01",
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"விடைபெறும்\" ஹஜ்ஜின்போது (நான் மக்காவிலிருந்த சமயம் எனக்கு ஏற்பட்ட) ஒரு நோய்க்காக என்னை உடல்நலம் விசாரிக்க வந்தார்கள். அந்த நோயின் காரணத்தால் நான் மரணத்தை எதிர்நோக்கியிருந்தேன். அப்போது நான், \"அல்லாஹ்வின் தூதரே! செல்வந்தனாகிய எனக்கு, என் ஒரே மகளைத் தவிர வேறு வாரிசு எவரும் இல்லாத நிலையில், நீங்கள் காணும் நோய் என்னைப் பீடித்துள்ளது. ஆகவே, நான் என் செல்வத்தில் மூன்றில் இரண்டு பாகங்களைத் தர்மம் செய்துவிடட்டுமா?\" என்று கேட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"வேண்டாம்\" என்றார்கள். நான், \"அவ்வாறாயின், என் சொத்தில் பாதியைத் தர்மம் செய்யட்டுமா?\" என்று கேட்டேன். அதற்கும் \"வேண்டாம்\" என்று சொன்ன அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"மூன்றில் ஒரு பாகம் (வேண்டுமானால் தர்மம் செய்யலாம்). மூன்றில் ஒரு பாகமேகூட அதிகம்தான். நீங்கள் உங்களுடைய வாரிசுகளை மக்களிடம் கையேந்தும் நிலையில் விட்டுச்செல்வதைவிட அவர்களைத் தன்னிறைவுடையவர்களாக விட்டுச்செல்வதே சிறந்ததாகும். நீங்கள் அல்லாஹ்வின் திருப்தியை விரும்பிச் செய்கின்ற தர்மம் எதுவாயினும் அதற்குப் பதிலாக உங்களுக்குப் பிரதிபலன் வழங்கப்படும். எந்த அளவிற்கென்றால், நீங்கள் உங்கள் மனைவியின் வாய்க்குள் இடுகின்ற ஒரு கவளம் உணவுக்கும்கூட (உங்களுக்குப் பிரதிபலன் அளிக்கப்படும்)\"என்று கூறினார்கள். நான், \"அல்லாஹ்வின் தூதரே! (என் தோழர்கள் அனைவரும் மதீனாவுக்குச் சென்று விடுவார்கள்) நான் மட்டும் இங்கு (மக்காவில்) என் தோழர்களைவிட்டுப் பின்தங்கியவனாக ஆகி விடுவேனா?\" என்று கேட்டேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீங்கள் இங்கு இருந்தபோதிலும் அல்லாஹ்வின் உவப்பை நாடி நல்லறங்கள் செய்து கொண்டே இருந்தால் உங்கள் தகுதியும் மேன்மையும் அதிகரித்துக்கொண்டேயிருக்கும்\" எனக் கூறிவிட்டு, \"உங்களை வைத்துச் சில கூட்டத்தார் நன்மையடைவதற்காகவும் வேறுசிலர் துன்பமடைவதற்காகவும் நீங்கள் இங்கேயே தங்க வைக்கப்படலாம்\" என்று கூறினார்கள். மேலும், \"இறைவா! என் தோழர்களின் ஹிஜ்ரத்தை முழுமையாக்குவாயாக! தங்கள் அடிச்சுவடுகளின் வழியே (முந்திய இணை வைக்கும் மார்க்கத்திற்கே) இவர்களைத் திரும்பிச் செல்லும்படி செய்துவிடாதே\" எனப் பிரார்த்தித்தார்கள். (நோயாளியாயிருந்த மற்றொருவரான) சஅத் பின் கவ்லா (ரலி) அவர்கள் மக்காவிலேயே இறந்து விட்டதற்காக, \"பாவம் சஅத் பின் கவ்லா! (அவர் மீண்டும் ஹிஜ்ரத் பூமிக்கே திரும்பிச் செல்ல விரும்பினார். ஆனால்,நடக்கவில்லை)\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அனுதாபம் தெரிவித்தார்கள். - மேற்கண்ட ஹதீஸ் சஅத் பின் அபீவக்காஸ் (ரலி) அவர்களிடமிருந்தே மேலும் ஆறு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. - மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் மேற்கண்ட ஹதீஸ் வந்துள்ளது. அதில், \"என்னை உடல்நலம் விசாரிப்பதற்காக என்னிடம் நபி (ஸல்) அவர்கள் வந்தார்கள்\" என ஹதீஸ் ஆரம்பமாகிறது. அதில் சஅத் பின் கவ்லா (ரலி) அவர்கள் தொடர்பாக நபி (ஸல்) அவர்கள் தெரிவித்த அனுதாபம் இடம்பெறவில்லை. ஆயினும் அதில், \"நான் எந்த மண்ணை விட்டு நாடு துறந்து சென்றேனோ அதே மண்ணிலேயே இறப்பதை வெறுத்தேன்\" என்று சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது. அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4210,
			"arabicnumber": "1628.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4211,
			"arabicnumber": "1628.03",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4212,
			"arabicnumber": "1628.04",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4213,
			"arabicnumber": "1628.05",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4214,
			"arabicnumber": "1628.06",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4215,
			"arabicnumber": "1628.07",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4216,
			"arabicnumber": "1628.08",
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர் களின் மூன்று புதல்வர்கள் கூறியதாவது: (எங்கள் தந்தை) சஅத் (ரலி) அவர்கள் மக்காவில் உடல் நலிவுற்றிருந்தபோது அவர்களை உடல்நலம் விசாரிப்பதற்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்தார்கள். மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. - மேற்கண்ட தகவல் சஅத் பின் அபீவக் காஸ் (ரலி) அவர்களின் மூன்று புதல்வர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4217,
			"arabicnumber": "1628.09",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4218,
			"arabicnumber": "1629",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: மக்கள் (தமது இறுதி விருப்பங்களை) மூன்றில் ஒரு பாகத்திலிருந்து நான்கில் ஒரு பாகமாகக் குறைத்துக்கொண்டால் நன்றாயிருக்கும். ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"மூன்றில் ஒரு பாகமா? மூன்றில் ஒரு பாகமே அதிகம்தான்\" என்று கூறியுள்ளார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் வகீஉ (ரஹ்) அவர்களது அறிவிப்பில் \"மூன்றில் ஒரு பாகமே பெரிதுதான் அல்லது அதிகம்தான்\" என (ஐயப்பாட்டுடன்) இடம்பெற்றுள்ளது. அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4219,
			"arabicnumber": "1630",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4220,
			"arabicnumber": "1004.03",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4221,
			"arabicnumber": "1004.04",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம், \"என் தாயார் திடீரென இறந்துவிட்டார். அவர் (இறப்பதற்கு முன்பு) பேச முடிந்திருந்தால் தர்மம் செய்(யச் சொல்லியிருந்)திருப்பார் என்று நான் கருதுகிறேன். அவருக்காக நான் தர்மம் செய்தால் எனக்கு நன்மை உண்டா?\" என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள் \"ஆம்\" என்று விடையளித்தார்கள். - ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! இறுதி விருப்பம் தெரிவிக்காமலேயே என் தாயார் திடீரென இறந்துவிட்டார். அவர் (இறப்பதற்கு முன்பு) பேச முடிந்திருந்தால் தர்மம் செய்(யச் சொல்லியிருந்)திருப்பார் என்று நான் கருதுகிறேன். அவர் சார்பாக நான் தர்மம் செய்தால் அவருக்கு நன்மை உண்டா?\"என்று கேட்டார். நபி (ஸல்) அவர்கள் \"ஆம்\" என்றார்கள். அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4222,
			"arabicnumber": "1004.05",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4223,
			"arabicnumber": "1631",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4224,
			"arabicnumber": "1632.01",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை) உமர் (ரலி) அவர்கள் கைபரில் (\"ஸம்ஃக்\" எனும்) ஒரு நிலத்தைப் பெற்றிருந்தார்கள். அந்த நிலம் தொடர்பாக ஆலோசனை பெறுவதற்காக நபி (ஸல்) அவர்களிடம் சென்றார்கள். \"அல்லாஹ்வின் தூதரே! நான் கைபரில் ஒரு நிலத்தைப் பெற்றுள்ளேன். அதைவிடச் சிறந்த ஒரு செல்வத்தை (இதுவரை) நான் அடைந்ததே இல்லை. ஆகவே, அதை நான் என்ன செய்ய வேண்டும் என்று தாங்கள் கட்டளையிடுகிறீர்கள்?\" என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், \"நீங்கள் விரும்பினால் அந்த நிலத்தை (அசலை) நீங்களே வைத்துக்கொண்டு, அதன் விளைச்சலை தர்மம் செய்துவிடுங்கள்\" என்று கூறினார்கள். அவ்வாறே உமர் (ரலி) அவர்கள் \"அந்த நிலம் விற்கப்படக் கூடாது; வாங்கப்படவும் கூடாது; வாரிசுரிமையாக்கப்படாது;அன்பளிப்பாக வழங்கப்படக் கூடாது\" என்ற நிபந்தனைகளை விதித்து அறக்கொடையாக (வக்ஃபாக) வழங்கினார்கள். (அதன் வருமானத்தை) ஏழைகளுக்கும், (தம்) உறவினர்களுக்கும், அடிமைகளை விடுதலை செய்வதற்கும், அல்லாஹ்வின் பாதையி(ல் அறப்போர் புரிவோர் வகையி)லும், வழிப்போக்கருக்கும், விருந்தினர்களுக்கும் உரியதாக்கித் தர்மம் (வக்ஃப்) செய்தார்கள். அதைப் பராமரிக்கும் பொறுப்பேற்றிருப்பவர், (அதிலிருந்து எடுத்துத் தமக்கென்று) சேமித்து வைக்காமல் நியாயமான அளவில் உண்பதும் தம் தோழருக்கு உணவளிப்பதிலும் குற்றமில்லை (என்றும் எழுதிவைத்தார்கள்). அறிவிப்பாளர்களில் ஒருவரான அப்துல்லாஹ் பின் அவ்ன் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நாஃபிஉ (ரஹ்) அவர்கள் அறிவித்த இந்த ஹதீஸை நான் முஹம்மத் பின் சீரீன் (ரஹ்) அவர்களிடம் சொன்னேன். \"(அதிலிருந்து எடுத்துத் தமக்கென்று) சேமித்து வைக்காமல்\" எனும் இடத்தை நான் அடைந்ததும் \"அதைத் தமது சொத்தாக ஆக்கிக் கொள்ளாமல்\" என்று (திருத்திக்) கூறினார்கள். மேலும், இது தொடர்பாக எழுதப்பட்ட ஓர் ஆவணத்தை வாசித்த ஒருவர் \"அதைத் தமது சொத்தாக ஆக்கிக்கொள்ளாமல் என்றே காணப்பட்டது\" என்று கூறினார். - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் இப்னு அபீஸாயிதா (ரஹ்) மற்றும் அஸ்ஹர் அஸ்ஸம்மான் (ரஹ்) ஆகியோரது அறிவிப்பில், \"(அதிலிருந்து எடுத்துத் தமக்கென்று) சேமித்து வைக்காமல் தம் தோழருக்கு உணவளிப்பதில்\" என்பதோடு ஹதீஸ் முடிவடைகிறது. அதற்குப் பின்னுள்ள குறிப்புகள் இடம்பெறவில்லை. இப்னு அபீஅதீ (ரஹ்) அவர்களது அறிவிப்பில் மேற்கண்ட ஹதீஸில் இடம்பெற்றுள்ள \"இந்த ஹதீஸை நான் முஹம்மத் பின் சீரீன் (ரஹ்) அவர்களிடம் சொன்னேன்...\" எனத் தொடங்கும் குறிப்பு இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"நான் கைபர் பகுதியில் ஒரு நிலத்தைப் பெற்றிருந்தேன். நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று \"நான் கைபரில் ஒரு நிலத்தைப் பெற்றுள்ளேன். அதைவிட மிக விருப்பமானதையோ, அதைவிட மிகச் சிறந்ததையோ நான் அடைந்து கொண்டதேயில்லை...\" என்று உமர் (ரலி) அவர்கள் கூறினார்கள்\" என ஹதீஸ் ஆரம்பமாகிறது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே தொடருகின்றன. இந்த அறிவிப்பில், அப்துல்லாஹ் பின் அவ்ன் (ரஹ்) அவர்கள் முஹம்மத் பின் சீரீன் (ரஹ்) அவர்களிடம் இந்த ஹதீஸைச் சொன்னதைப் பற்றியும் அதற்குப் பின்னுள்ள தகவலும் இடம்பெறவில்லை. அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4225,
			"arabicnumber": "1632.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4226,
			"arabicnumber": "1633",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4227,
			"arabicnumber": "1634.01",
			"text": "தல்ஹா பின் முஸர்ரிஃப் (ரஹ்) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் அபீஅவ்ஃபா (ரலி) அவர்களிடம், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறுதி விருப்பம் (வஸிய்யத்) தெரிவித்தார்களா?\" என்று கேட்டேன். அவர்கள் \"இல்லை\" என்று பதிலளித்தார்கள். \"அவ்வாறாயின் இறுதி விருப்பம் முஸ்லிம்களுக்கு ஏன் கடமையாக்கப்பட்டது?\" அல்லது \"அவ்வாறாயின் இறுதி விருப்பம் தெரிவிக்குமாறு மக்கள் ஏன் கட்டளையிடப்பட்டனர்?\" என்று கேட்டேன். அதற்கு அவர்கள், \"வல்லமையும் மாண்பும் மிக்க அல்லாஹ்வின் வேதத்தின்படி செயல்படுமாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அறிவுறுத்தினார்கள்\" என்று பதிலளித்தார்கள். அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4228,
			"arabicnumber": "1634.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4229,
			"arabicnumber": "1635.01",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4230,
			"arabicnumber": "1635.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4231,
			"arabicnumber": "1636",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4232,
			"arabicnumber": "1637.01",
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: (ஒரு முறை) இப்னு அப்பாஸ் (ரலி) அவர்கள் \"(அன்று) வியாழக்கிழமை! எந்த வியாழக்கிழமை (தெரியுமா)?\" என்று கேட்டு விட்டு, சரளைக்கல் பூமியை நனைத்து விடுமளவுக்குக் கண்ணீர்விட்டு அழுதார்கள். நான் \"இப்னு அப்பாஸ் அவர்களே! அது எந்த வியாழக்கிழமை?\" என்று கேட்டேன். இப்னு அப்பாஸ் (ரலி) அவர்கள் (பின்வருமாறு) கூறினார்கள்: (ஒரு வியாழக்கிழமையன்று) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது (நோயின்) வேதனை கடுமையாயிற்று. அப்போது அவர்கள், \"என்னிடம் (ஓர் ஏட்டைக்) கொண்டு வாருங்கள். உங்களுக்கு ஒரு மடலை நான் எழுதித்தருகிறேன். எனக்குப் பிறகு (குறிப்பிட்ட அந்த விஷயங்களில்) நீங்கள் வழி தவறமாட்டீர்கள்\" என்று கூறினார்கள். அப்போது மக்கள் (கருத்து வேறுபாடு கொண்டு) சச்சரவிட்டுக்கொண்டனர். ஆனால், ஓர் இறைத்தூதர் அருகில் சச்சரவிட்டுக்கொள்ளல் தகாதசெயலாகும். மக்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு என்ன நேர்ந்தது? அவர்கள் பலவீனத்தில் பேசுகிறார்களா?அவர்களிடமே விளக்கம் கேளுங்கள்\" என்று கூறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"என்னை விட்டுவிடுங்கள். நான் இப்போதுள்ள நிலையே சிறந்தது\" என்று சொல்லிவிட்டார்கள். (எதையும் எழுதித் தரவில்லை.) மேலும், மூன்று விஷயங்களை நான் எனது இறுதி விருப்பமாக வலியுறுத்துகிறேன்: அரபு தீபகற்பத்திலிருந்து இணைவைப்பாளர்களை அப்புறப்படுத்துங்கள். (அயல் நாடுகள் மற்றும் குலங்களின்) தூதுக் குழுவினருக்கு நான் வழங்கிவந்ததைப் போன்று நீங்களும் பரிசுப்பொருட்களை வழங்குங்கள்\" என்று கூறினார்கள். (எனக்கு இந்த ஹதீஸை அறிவித்த) இப்னு அப்பாஸ் (ரலி) அவர்கள் \"மூன்றாவது விருப்பத்தைச் சொல்லாமல் மௌனமாயிருந்துவிட்டார்கள்\" அல்லது \"அதை அவர்கள் கூறியிருக்க, நான் அதை மறந்துவிட்டேன்\". இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4233,
			"arabicnumber": "1637.02",
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: (ஒரு முறை) இப்னு அப்பாஸ் (ரலி) அவர்கள் \"(அன்று) வியாழக்கிழமை! எந்த வியாழக்கிழமை (தெரியுமா)?\" என்று கேட்டு விட்டுக் கண்ணீர் விட்டு அழலானார்கள். எந்த அளவிற்கென்றால், அவர்களின் கன்னங்களில் முத்துச் சரங்களைப் போன்று (கண்ணீர் திவலைகள் தாரை தாரையாக வழியக்) கண்டேன். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இறுதிப் படுக்கையில் இருந்தபோது) \"எலும்பையும் மைக்கூட்டையும் (அல்லது பலகையையும் மைக்கூட்டையும்) கொண்டுவாருங்கள். உங்களுக்கு நான் ஒரு மடலை எழுதித் தருகிறேன். அதன் பின்னர் (குறிப்பிட்ட அந்த விஷயங்களில்) ஒருபோதும் நீங்கள் வழிதவறவேமாட்டீர்கள்\" என்று கூறினார்கள். அப்போது மக்கள் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பலவீனத்தில் பேசுகிறார்கள்\" என்று கூறினர். அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4234,
			"arabicnumber": "1637.03",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		}
	]
}