{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4254,
			"arabicnumber": "1646.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4255,
			"arabicnumber": "1646.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4256,
			"arabicnumber": "1646.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4257,
			"arabicnumber": "1646.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4258,
			"arabicnumber": "1646.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4259,
			"arabicnumber": "1646.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4260,
			"arabicnumber": "1647.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4261,
			"arabicnumber": "1647.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4262,
			"arabicnumber": "1648",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4263,
			"arabicnumber": "1649.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": "1649.02",
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: என் நண்பர்கள் என்னை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று, தமக்காக (பயண) வாகனம் கேட்கும்படி அனுப்பிவைத்தார்கள். அப்போது அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் சிரமப்போர் படையுடன் செல்லவிருந்தனர். (தபூக் போர்தான் அது) அப்போது நான், \"அல்லாஹ்வின் தூதரே! என் நண்பர்கள் தமக்காக வாகனம் கேட்கும் படி என்னைத் தங்களிடம் அனுப்பிவைத்துள்ளனர்\" என்று சொன்னேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ்வின் மீதாணையாக! உங்களுக்கு எந்த வாகனத்தையும் என்னால் தர இயலாது\" என்று சொன்னார்கள். நான் அங்கு போன நேரத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோபத்திலிருந்தார்கள். (அது) எனக்குத் தெரியவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வாகனம் தர) மறுத்ததாலும் என்மீது அவர்கள் வருத்தம் கொண்டிருப்பார்களோ என்ற அச்சத்தாலும் நான் கவலை கொண்டவனாகத் திரும்பினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை என் நண்பர்களிடம் வந்து தெரிவித்தேன். இது நடந்து சிறிது நேரம் தான் கழிந்திருக்கும். அதற்குள், \"அப்துல்லாஹ் பின் கைஸே!\" என்று பிலால் (ரலி) அவர்கள் (என்னை) அழைப்பதைக் கேட்டேன். உடனே நான் அவரது அழைப்புக்குப் பதிலளித்தேன். அப்போது பிலால் (ரலி) அவர்கள், \"உங்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழைக்கிறார்கள். அவர்களது அழைப்பை ஏற்றுச் செல்லுங்கள்\" என்று சொன்னார்கள். நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றபோது அவர்கள், \"(இணைத்துக் கட்டப்பட்டிருக்கும்) இவ்விரு ஒட்டகங்களையும் இவ்விரு ஒட்டகங்களையும் இவ்விரு ஒட்டகங்களையும்\" என்று ஆறு ஒட்டகங்களைக் காட்டி \"பிடித்துக்கொள்ளுங்கள்\" என்று சொன்னார்கள். அவற்றை அப்போதுதான் சஅத் பின் உபாதா (ரலி) அவர்களிடமிருந்து விலைக்கு வாங்கியிருந்தார்கள். \"உங்கள் நண்பர்களிடம் இவற்றைக் கொண்டுசென்று, \"அல்லாஹ்\" அல்லது \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்\" (அறிவிப்பாளரின் ஐயம்) இந்த ஒட்டகங்களை உங்கள் பயணத்திற்காக அளித்துள்ளார்கள். எனவே, இவற்றில் ஏறிப் புறப்படச் சொன்னார்கள்\" எனத் தெரிவியுங்கள்\" என்றார்கள். அவ்வாறே நான் என் தோழர்களிடம் அவற்றைக் கொண்டுசென்று, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இவற்றில் ஏறிப் பயணம் செல்லும்படி கூறினார்கள். எனினும், அல்லாஹ்வின் மீதாணையாக! உங்களில் சிலர் என்னுடன் வந்து,அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நான் (வாகனம்) கேட்டதையும், முதலில் அவர்கள் அதற்கு மறுப்புத் தெரிவித்ததையும், பின்னர் அவற்றை வழங்கியதையும் அறிந்த மக்களிடம் விசாரிக்கும் வரையில் நான் உங்களை விடமாட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொல்லாத ஒன்றை நான் உங்களிடம் சொல்லி விட்டதாக நீங்கள் நினைத்துவிடக் கூடாது\" என்று சொன்னேன். அதற்கு என் தோழர்கள், \"அல்லாஹ்வின் மீதாணையாக! \"(அதற்கெல்லாம் அவசியமில்லை) உங்களை நாங்கள் உண்மையாளர் என்றே உறுதியாக நம்புகிறோம். (இருப்பினும், நீங்கள் விரும்புகிறீர்கள் என்பதால்) உங்கள் விருப்பப்படி நாங்கள் செய்கிறோம்\" என்று கூறினர். நான் அவர்களில் சிலரை அழைத்துக் கொண்டு \"நான் அவர்களுக்குத் தரமாட்டேன்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (முதலில்) மறுத்ததையும், பிறகு அவர்களே வழங்கியதையும் அறிந்த சிலரிடம் சென்றேன். அப்போது அந்தச் சிலர், நான் மக்களிடம் தெரிவித்ததைப் போன்றே தெரிவித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": "1649.03",
			"text": "ஸஹ்தம் பின் முளர்ரிப் அர்ஜர்மீ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களிடம் இருந்தோம். அப்போது அவர்கள் தமது உணவுத்தட்டைக் கொண்டு வரச்சொன்னார்கள். அதில் கோழி இறைச்சி இருந்தது. அப்போது \"பனூ தைமுல்லாஹ்\" எனும் குலத்தைச் சேர்ந்த சிவப்பான ஒரு மனிதர் உள்ளே வந்தார். அவர் விடுதலை செய்யப்பட்ட அடிமைகளில் ஒருவர் போன்றிருந்தார். அவரை அபூமூசா (ரலி) அவர்கள் \"நீ(யும்) வா (சாப்பிடு)\" என்றழைத்தார்கள். ஆனால், அவர் தயங்கினார். அப்போது அபூமூசா (ரலி) அவர்கள், \"இங்கே வா! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இந்தக் கோழி இறைச்சியை உண்பதை நான் பார்த்திருக்கிறேன்\" என்று கூறினார்கள். அதற்கு அந்த மனிதர் \"இந்தக் கோழி (இனம் அசுத்தம்) எதையோ தின்பதைக் கண்டு அதனால் அருவருப்படைந்து அதை உண்ணமாட்டேன் என்று நான் சத்தியம் செய்துவிட்டேன்\" என்று சொன்னார். இதைக் கேட்ட அபூமூசா (ரலி) அவர்கள் கூறினார்கள்: இங்கே வா! நான் உனக்கு இதைப் பற்றி (விவரமாக)த் தெரிவிக்கிறேன்: நான் என் \"அஷ்அரீ\" குலத்தார் சிலருடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், எங்கள் பயணத்திற்கு வேண்டிய வாகனம் கேட்டுச் சென்றேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ்வின் மீதாணையாக! நான் உங்கள் பயணத்திற்கு வேண்டிய வாகனம் தரமாட்டேன். நீங்கள் பயணம் செய்வதற்கு என்னிடம் வாகனம் ஏதுமில்லை\" என்று கூறிவிட்டார்கள். நாங்கள் அல்லாஹ் நாடிய நேரம்வரை அங்கேயே இருந்தோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் போரில் கிடைத்த ஒட்டகங்கள் சில கொண்டுவரப்பட்டன. உடனே எங்களை அழைத்து, வெள்ளைத் திமில்கள் கொண்ட ஐந்து ஒட்டக மந்தைகளை (ஐந்து ஜோடி ஒட்டகங்களை) எங்களுக்கு வழங்கும்படி உத்தரவிட்டார்கள். நாங்கள் (ஒட்டகங்களை ஓட்டிக்கொண்டு திரும்பிச்) சென்றபோது, நாங்கள் எங்களுக்குள் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை அவர்களது சத்தியத்திலிருந்து கவனத்தைத் திருப்பிவிட்டோம். இதில் நமக்கு வளம் வழங்கப்படாது\" என்று பேசிக்கொண்டோம். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் திரும்பிச்சென்று, \"அல்லாஹ்வின் தூதரே! எங்கள் பயணத்திற்கு வேண்டிய ஒட்டகங்கள் கேட்டு உங்களிடம் நாங்கள் வந்தோம். நீங்கள் ஒட்டகங்கள் தரமாட்டேன் எனச் சத்தியம் செய்தீர்கள். பிறகு எங்களுக்கு ஒட்டகங்கள் வழங்கினீர்கள். (உங்களது சத்தியத்தை) மறந்துவிட்டீர்களா, அல்லாஹ்வின் தூதரே?\" என்று கேட்டோம். அதற்கு அவர்கள், \"அல்லாஹ்வின் மீதாணையாக! அல்லாஹ் நாடினால் நான் ஒரு சத்தியம் செய்து, அஃதல்லாத வேறொன்றை அந்தச் சத்தியத்தைவிடச் சிறந்ததாக நான் கருதினால், அந்த வேறொன்றையே செய்வேன். சத்தியத்தை முறித்து அதற்காகப் பரிகாரமும் செய்து விடுவேன். நீங்கள் செல்லுங்கள். வல்லமையும் மாண்பும் மிக்க அல்லாஹ்வே உங்களுக்கு ஒட்டகங்களை வழங்கினான்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், பின்வருமாறு ஹதீஸ் ஆரம்பமாகிறது: \"ஜர்ம்\" குலத்தைச் சேர்ந்த இந்தக் குடும்பத்தாருக்கும் \"அஷ்அரீ\" குலத்தாருக்குமிடையே நட்பும் சகோதரத்துவமும் இருந்து வந்தது. நாங்கள் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களிடம் இருந்தோம். அப்போது அவர்களுக்குக் கோழி இறைச்சியுடன் உணவு பரிமாறப்பட்டது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. - மேற்கண்ட ஹதீஸ் மேலும் ஆறு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஸஹ்தம் அல்ஜர்மீ (ரஹ்) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் \"நான் அபூமூசா (ரலி) அவர்களிடம் சென்றேன். அப்போது அவர்கள் கோழி இறைச்சி உண்டு கொண்டிருந்தார்கள்\" என ஹதீஸ் ஆரம்பமாகிறது. மேலும் அதில், \"அல்லாஹ்வின் மீதாணையாக! அ(ந்தச் சத்தியத்)தை நான் மறக்கவில்லை\" என நபி (ஸல்) அவர்கள் கூறினார்கள் என்ற தகவல் கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": "1649.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": "1649.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": "1649.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": "1649.07",
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் எங்கள் பயணத்திற்கு வேண்டிய ஒட்டகங்கள் கேட்டுச் சென்றோம். அப்போது அவர்கள், \"உங்களை ஏற்றியனுப்ப என்னிடம் ஒட்டகங்கள் எதுவுமில்லை. அல்லாஹ்வின் மீதாணையாக! உங்கள் பயணத்திற்குரிய ஒட்டகங்களை நான் தரமாட்டேன்\" என்று கூறிவிட்டார்கள். பிறகு எங்களிடம் வெள்ளைத் திமில்கள் கொண்ட மூன்று ஒட்டக மந்தைகளை (மூன்று ஜோடி ஒட்டகங்களை) அனுப்பி வைத்தார்கள். அப்போது நாங்கள் \"நாம் நமது பயணத்திற்குத் தேவையான ஒட்டகங்கள் கேட்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றோம். அவர்கள் நமக்கு ஒட்டகம் தரமாட்டேன் எனச் சத்தியம் செய்தார்களே!\" என்று கூறிவிட்டு, அவர்களிடம் (திரும்பிச் சென்று) அதைப் பற்றித் தெரிவித்தோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நான் ஒரு சத்தியம் செய்து, அஃதல்லாத வேறொன்றை அதைவிடச் சிறந்ததாக நான் கருதினால், அந்த வேறொன்றையே செய்வேன்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் அபூமூசா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"நாங்கள் (தபூக் போரின்போது) நடைப்பயணமாகவே சென்றோம். எனவே, நாங்கள் ஏறிச் செல்ல அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒட்டகம் கேட்டுச் சென்றோம்\" என்று ஹதீஸ் ஆரம்பமாகிறது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": "1649.08",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": "1650.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் இரவு (நேரத் தொழுகையைத் தாமதமாகத் தொழுதுவிட்டு) நீண்ட நேரம் நபி (ஸல்) அவர்களிடம் இருந்து விட்டுப் பிறகு தம் வீட்டாரிடம் திரும்பிச் சென்றார். (காலம் தாழ்ந்து சென்றதால்) குழந்தைகள் அனைவரும் உறங்கிவிட்டிருப்பதைக் கண்டார். அப்போது அவருடைய மனைவி அவருக்கு உணவு கொண்டுவந்தார். அப்போது அவர் உண்ண மாட்டேன் எனச் சத்தியம் செய்துவிட்டார். அவருடைய குழந்தைகள் (உறங்கிவிட்டது)தான் அதற்குக் காரணம். பிறகு அவருக்கு ஏதோ தோன்ற, உணவு உட்கொண்டார். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று அது குறித்துத் தெரிவித்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஒருவர் ஒரு சத்தியம் செய்து விட்டு, அந்தச் சத்தியத்தைவிடச் சிறந்ததாக வேறொன்றைக் கருதினால், அந்த வேறொன்றையே அவர் செய்யட்டும். சத்திய முறிவுக்காகப் பரிகாரமும் செய்யட்டும்\" என்றார்கள். அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": "1650.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": "1650.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": "1650.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": "1651.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": "1651.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவர் ஒரு சத்தியம் செய்துவிட்டு, அஃதல்லாத வேறொன்றை அதைவிடச் சிறந்ததாகக் கருதும்பட்சத்தில் தனது சத்தியத்தை முறித்துப் பரிகாரம் செய்துவிட்டு, (அந்த வேறொன்றையே) செய்யட்டும்! இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": "1651.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": "1651.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4279,
			"arabicnumber": "1651.05",
			"text": "தமீம் பின் தரஃபா அத்தாயீ (ரஹ்) அவர்கள் கூறியதாவது: அதீ பின் ஹாத்திம் (ரலி) அவர்களிடம் ஒரு மனிதர் நூறு திர்ஹங்கள் கேட்டார். அப்போது அதீ பின் ஹாத்திம் (ரலி) அவர்கள் \"ஹாத்திம் அத்தாயீயின் மகனான என்னிடம் (மிகக் குறைந்த தொகையான) நூறு திர்ஹங்கள் கேட்கிறாயே! அல்லாஹ்வின் மீதாணையாக! உமக்கு நான் தரமாட்டேன்\" என்று கூறிவிட்டார்கள். பிறகு (சத்தியத்தை முறித்து அவர் கேட்டதைக் கொடுத்துவிட்டு) \"ஒருவர் ஒரு சத்தியம் செய்துவிட்டு, அஃதல்லாத வேறொன்றை அதைவிடச் சிறந்ததாக அவர் கருதும்பட்சத்தில் அந்தச் சிறந்ததையே அவர் செய்யட்டும்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை நான் கேட்டிராவிட்டால், (நான் எனது சத்தியத்தை முறித்திருக்கமாட்டேன்)\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் தமீம் பின் தரஃபா (ரஹ்) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், \"உமக்கு எனது நன்கொடையில் நானூறு திர்ஹங்கள் கிடைக்கும்\" என்று அதீ பின் ஹாத்திம் (ரலி) அவர்கள் கூறினார்கள் எனக் கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4280,
			"arabicnumber": "1651.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4281,
			"arabicnumber": "1652.01",
			"text": "அப்துர் ரஹ்மான் பின் சமுரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம், \"அப்துர் ரஹ்மான் பின் சமுரா! ஆட்சிப் பொறுப்பை நீயாக (ஆசைப்பட்டு)க் கேட்காதே! ஏனெனில், (நீ) கேட்டதால் அது உனக்கு அளிக்கப்பட்டால், அதோடு நீ (தனிமையில்) விடப்படுவாய் (இறையுதவி கிட்டாது). கேட்காமல் அது உனக்கு அளிக்கப்பட்டால், அந்தப் பொறுப்பில் (இறைவனின்) உதவி நல்கப்படுவாய். நீ ஒரு சத்தியம் செய்து, அஃதல்லாத வேறொன்றை அதை விடச் சிறந்ததாக நீ கண்டால், உனது சத்தியத்(தை முறித்துவிட்டு, முறித்த)துக்கான பரிகாரத்தைச் செய்துவிடு. சிறந்தது எதுவோ அதைச் செயல்படுத்து\" என்று சொன்னார்கள். - மேற்கண்ட ஹதீஸ் மேலும் எட்டு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் முஅதமிர் (ரஹ்) அவர்களது அறிவிப்பில் ஆட்சிப் பொறுப்பு தொடர்பான குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": "1652.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4283,
			"arabicnumber": "1653.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4284,
			"arabicnumber": "1653.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4285,
			"arabicnumber": "1654.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4286,
			"arabicnumber": "1654.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4287,
			"arabicnumber": "1654.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4288,
			"arabicnumber": "1654.04",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (ஒரு முறை) இறைத்தூதர் சுலைமான் பின் தாவூத் (அலை) அவர்கள் \"நான் இன்றிரவு (என்னுடைய) எழுபது துணைவியரிடமும் சென்று (தாம்பத்திய உறவு கொண்டு) வருவேன். அவர்களில் ஒவ்வொருவரும் அல்லாஹ்வின் பாதையில் அறப்போர் புரியும் (குதிரை) வீரன் ஒருவனைப் பெற்றெடுப்பார்கள்\" என்று கூறினார்கள். அப்போது சுலைமான் நபியின் \"தோழர் ஒருவர்\" அல்லது \"வானவர் ஒருவர்\" \"இன்ஷா அல்லாஹ் (அல்லாஹ் நாடினால்,அவ்வாறு பெற்றெடுப்பார்கள்) என்று சொல்லுங்கள்\" என சுலைமான் (அலை) அவர்களிடம் கூறினார். சுலைமான் (அலை) அவர்கள் \"இன்ஷா அல்லாஹ்\" என்று கூற மறந்துவிட்டார்கள். அதனால் அவர்களுடைய துணைவியரில் ஒரே ஒருவரைத் தவிர வேறெவரும் கர்ப்பமடையவில்லை. அந்த ஒருவரும் ஒரு தோளுடைய அரைக் குழந்தையையே பெற்றெடுத்தார். சுலைமான் (அலை) அவர்கள் \"இன்ஷா அல்லாஹ்\" (அல்லாஹ் நாடினால்) என்று கூறியிருந்தால் தமது சத்தியத்தை அடையாமல் இருந்திருக்கமாட்டார்கள்; தமது தேவையைப் பூர்த்தி செய்திருப்பார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4289,
			"arabicnumber": "1654.05",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: (ஒரு முறை) சுலைமான் பின் தாவூத் (அலை) அவர்கள், \"நான் இன்றிரவு (என்னுடைய) தொண்ணூறு துணைவியரிடமும் சென்று (தாம்பத்திய உறவு கொண்டு) வருவேன். அவர்களில் ஒவ்வொருவரும் அல்லாஹ்வின் பாதையில் அறப்போர் புரியும் (குதிரை) வீரன் ஒருவனைப் பெற்றெடுப்பார்கள்\" என்று கூறினார்கள். அப்போது அவர்களுடைய தோழர் ஒருவர், \"இன்ஷா அல்லாஹ் (அல்லாஹ் நாடினால்) எனச் சொல்லுங்கள்\" என்றார். சுலைமான் (அலை) அவர்கள் \"இன்ஷா அல்லாஹ்\" என்று கூறாமல், தம் துணைவியர் அனைவரிடமும் சென்று வந்தார்கள். அவர்களில் ஒரே ஒருவரைத் தவிர வேறெவரும் கர்ப்பமடையவில்லை. அந்த ஒருவரும் ஒரு தோளுடைய (அரை) மனிதரையே பெற்றெடுத்தார். முஹம்மதின் உயிர் எவன் கையிலுள்ளதோ அவன் மீதாணையாக! சுலைமான் (அலை) அவர்கள் \"இன்ஷா அல்லாஹ்\" என்று கூறியிருந்தால், (அவர்கள் ஒவ்வொருவரும் வீரர்களைப் பெற்றெடுத்து) அவர்கள் அனைவரும் அல்லாஹ்வின் பாதையில் குதிரை வீரர்களாக அறப்போர் புரிந்திருப்பார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், \"அவர்கள் ஒவ்வொருவரும் அல்லாஹ்வின் பாதையில் அறப்போர் புரியும் (வீர) மகனைக் கருக்கொண்டிருப்பார்கள்\" என்று (சிறு வித்தியாசத்துடன்) இடம்பெற்றுள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4290,
			"arabicnumber": "1654.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4291,
			"arabicnumber": "1655",
			"text": "ஹம்மாம் பின் முனப்பிஹ் (ரஹ்) அவர்கள் கூறியதாவது: இவை அபூஹுரைரா (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து எங்களுக்கு அறிவித்த ஹதீஸ்களாகும். அவற்றில் இதுவும் ஒன்றாகும்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் மீதாணையாக! உங்களில் ஒருவர் தம் குடும்பத்தார் (துன்புறும் வகையில் அவர்கள்) தொடர்பாகத் தாம் செய்த சத்தியத்தில் பிடிவாதமாக இருப்பதானது, (அந்தச் சத்தியத்தை முறித்துவிட்டு) அதற்காக அவர்மீது அல்லாஹ் கடமையாக்கியுள்ள பரிகாரத்தைச் செய்வதைவிட அல்லாஹ்விடம் பெரிய பாவமாகும். அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4292,
			"arabicnumber": "1656.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4293,
			"arabicnumber": "1656.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4294,
			"arabicnumber": "1656.03",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"தாயிஃப்” போரிலிருந்து திரும்பிய பின் \"அல்ஜிஃரானா\" எனும் இடத்திலிருந்தபோது அவர்களிடம் (என் தந்தை) உமர் பின் அல் கத்தாப் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! அறியாமைக் காலத்தில் (இஸ்லாத்தைத் தழுவும் முன்பு) \"மஸ்ஜிதுல் ஹராம்\" புனிதப் பள்ளிவாசலில் ஒரு நாள் \"இஃதிகாஃப்\" இருப்பதாக நான் நேர்ந்துகொண்டேன். அது பற்றி தாங்கள் என்ன கருதுகிறீர்கள்?\" என்று கேட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீர் சென்று ஒரு நாள் \"இஃதிகாஃப்\" இருப்பீராக!\" என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உமர் (ரலி) அவர்களுக்கு (ஹுனைன் போர்ச் செல்வத்தின்) ஐந்தில் ஒரு பாகம் (கும்ஸ்) நிதியிலிருந்து ஓர் அடிமைப் பெண்ணைக் கொடுத்திருந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்,மக்களிடமிருந்த கைதிகளை விடுதலை செய்தபோது அக்கைதிகள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களிடமிருந்த கைதிகளை விடுதலை செய்துவிட்டார்கள்\" என்று கூறிய சப்தத்தை உமர் (ரலி) அவர்கள் செவியுற்றார்கள். உடனே உமர் (ரலி) அவர்கள், \"என்ன இது?\" என்று கேட்டார்கள். அதற்கு மக்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களிடமிருந்த கைதிகளை விடுதலை செய்து விட்டார்கள்\" என்று கூறினர். ஆகவே, உமர் (ரலி) அவர்கள் (என்னிடம்), \"அப்துல்லாஹ்! அந்த அடிமைப் பெண்ணிடம் சென்று அவளது வழியில் அவளை விட்டுவிடு\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் இப்னு உமர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"நபி (ஸல்) அவர்கள் \"ஹுனைன்\" போரிலிருந்து திரும்பியபோது, (என் தந்தை) உமர் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், தாம் அறியாமைக் காலத்தில் ஒரு பகல் \"இஃதிகாஃப்\" இருப்பதாக நேர்ந்துகொண்டிருந்ததைப் பற்றி வினவினார்கள்\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. - மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் மேற்கண்ட ஹதீஸ் வந்துள்ளது. அதில் பின்வருமாறு ஹதீஸ் ஆரம்பமாகிறது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அல்ஜிஃரானா\" எனுமிடத்திலிருந்து நிறைவேற்றிய உம்ரா பற்றி இப்னு உமர் (ரலி) அவர்கள் முன்னிலையில் பேசப்பட்டது. அப்போது இப்னு உமர் (ரலி) அவர்கள், (அதைப் பற்றி அறியாதிருந்த காரணத்தால்) \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அல்ஜிஃரானா\"விலிருந்து உம்ரா செய்யவில்லை\" என்று விடையளித்தார்கள். மேலும், \"உமர் (ரலி) அவர்கள் அறியாமைக் காலத்தில் ஓர் இரவு \"இஃதிகாஃப்\" மேற்கொள்வதாக நேர்ந்துகொண்டிருந்தார்கள்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அவற்றிலும் \"ஒரு பகல் \"இஃதிகாஃப்\" இருப்பதாக நேர்ந்திருந்தார்கள்\" என்றே இடம் பெற்றுள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4295,
			"arabicnumber": "1656.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4296,
			"arabicnumber": "1656.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4297,
			"arabicnumber": "1656.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4298,
			"arabicnumber": "1657.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4299,
			"arabicnumber": "1657.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4300,
			"arabicnumber": "1657.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4301,
			"arabicnumber": "1658.01",
			"text": "முஆவியா பின் சுவைத் பின் முகர்ரின் (ரஹ்) அவர்கள் கூறியதாவது: நான் எங்களுடைய அடிமை ஒருவரின் கன்னத்தில் அறைந்துவிட்டு ஓடிவிட்டேன். பிறகு \"லுஹர்\" தொழுகைக்கு சற்று நேரத்திற்கு முன்னர் வந்து என் தந்தைக்குப் பின்னால் நின்று தொழுதேன். என் தந்தை அந்த அடிமையையும் என்னையும் அழைத்து, \"இவனிடமிருந்து நீ பழி தீர்த்துக்கொள்\" என்று (அடிமையிடம்) கூறினார்கள். ஆனால், அந்த அடிமை என்னை மன்னித்துவிட்டார். பிறகு என் தந்தை (சுவைத் பின் முகர்ரின் (ரலி) அவர்கள்) கூறினார்கள்: பனூ முகர்ரின் குடும்பத்தாராகிய எங்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் ஒரே ஓர் அடிமைப் பெண் மட்டுமே இருந்தாள். எங்களில் ஒருவர் அவளது கன்னத்தில் அறைந்துவிட்டார். இத்தகவல் நபி (ஸல்) அவர்களுக்கு எட்டியபோது அவர்கள், \"அவளை விடுதலை செய்துவிடுங்கள்\" என்று கூறினார்கள். எங்கள் குடும்பத்தார், \"இவளைத் தவிர வேறு வேலைக்காரிகள் எங்களிடம் இல்லை\" என்று கூறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவளிடமே அவர்கள் வேலை வாங்கிக் கொள்ளட்டும்! அவளிடம் அவர்களுடைய தேவை முடிந்ததும் அவளது வழியில் அவளை (சுதந்திரமாக) விட்டுவிடட்டும்!\" என்று கூறினார்கள்.- இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4302,
			"arabicnumber": "1658.02",
			"text": "ஹிலால் பின் யசாஃப் (ரஹ்) அவர்கள் கூறியதாவது: ஒரு முதியவர் அவசரப்பட்டு தம் அடிமைப் பெண்ணின் முகத்தில் அறைந்துவிட்டார். அவரிடம் சுவைத் பின் முகர்ரின் (ரலி) அவர்கள், \"அடிப்பதற்கு அவளது மென்மையான முகம்தான் கிடைத்ததா? பனூ முகர்ரின் குடும்பத்தின் ஏழு உறுப்பினர்களில் நானும் ஒருவன் ஆவேன். எங்களிடம் ஒரே ஓர் அடிமைப் பெண் மட்டுமே இருந்தாள். அவளை எங்களது குடும்பத்துச் சிறியவர் ஒருவர் அடித்துவிட்டார். அப்போது அவளை விடுதலை செய்துவிடுமாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு உத்தரவிட்டார்கள்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் பின்வருமாறு ஹிலால் பின் யசாஃப் (ரஹ்) அவர்கள் கூறியதாக ஹதீஸ் ஆரம்பமாகிறது: நாங்கள் நுஅமான் பின் முகர்ரின் (ரலி) அவர்களின் சகோதரர் சுவைத் பின் முகர்ரின் (ரலி) அவர்களது வீட்டில் துணி வியாபாரம் செய்துவந்தோம். (ஒரு நாள்) ஓர் அடிமைப் பெண் வந்து எங்களில் ஒருவரிடம் ஏதோ ஒரு (கடுமையான) வார்த்தையைக் கூறினாள். உடனே அவர் அவளது கன்னத்தில் அறைந்துவிட்டார். இதைக் கண்டு சுவைத் பின் முகர்ரின் (ரலி) அவர்கள் கோபப்பட்டார்கள். மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4303,
			"arabicnumber": "1658.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4304,
			"arabicnumber": "1658.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": "1658.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4306,
			"arabicnumber": "1659.01",
			"text": "அபூமஸ்ஊத் அல்அன்சாரீ அல்பத்ரீ (ரலி) அவர்கள் கூறியதாவது: நான் என் அடிமையைச் சாட்டையால் அடித்துக்கொண்டிருந்தேன். அப்போது எனக்குப் பின்னால் யாரோ, \"நினைவிருக்கட்டும், அபூமஸ்ஊத்!\" என்று கூறியதைக் கேட்டேன். அப்போது நான் கோபத்தில் இருந்ததால், அந்தக் குரலை (நன்கு) விளங்கிக்கொள்ளவில்லை. அவர் என்னை நெருங்கி வந்தபோது (பார்த்தால்) அங்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இருந்தார்கள். அப்போது அவர்கள் \"நினைவிருக்கட்டும். அபூமஸ்ஊத்! நினைவிருக்கட்டும். அபூ மஸ்ஊத்!\" என்று சொல்லிக்கொண்டிருந்தார்கள். உடனே நான் என் கையிலிருந்த சாட்டையைக் கீழே போட்டேன். அப்போது அவர்கள் \"நினைவிருக்கட்டும். அபூமஸ்ஊத்! உமக்கு இந்த அடிமையின் மீதிருக்கும் அதிகாரத்தைவிடப் பன்மடங்கு அதிகாரம் உம்மீது அல்லாஹ்வுக்கு இருக்கிறது\" என்று சொன்னார்கள். நான், \"இதன் பின்னர் ஒருபோதும் நான் எந்த அடிமையையும் அடிக்கமாட்டேன்\" என (உறுதி) மொழிந்தேன். - மேற்கண்ட ஹதீஸ் மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ஜரீர் (ரஹ்) அவர்களது அறிவிப்பில், \"அதைக் கேட்டவுடன் அவர்கள்மீது கொண்ட அச்சத்தால் எனது கையிலிருந்த சாட்டை கீழே விழுந்துவிட்டது\" என அபூமஸ்ஊத் (ரலி) அவர்கள் கூறினார்கள் என இடம்பெற்றுள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": "1659.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4308,
			"arabicnumber": "1659.03",
			"text": "அபூமஸ்ஊத் அல்அன்சாரீ (ரலி) அவர்கள் கூறியதாவது: நான் (ஒரு முறை) என் அடிமையை அடித்துக்கொண்டிருந்தேன். அப்போது எனக்குப் பின்னாலிருந்து யாரோ, \"அபூ மஸ்ஊதே நினைவிருக்கட்டும்! இவர்மீது உமக்கிருக்கும் அதிகாரத்தைவிடப் பன்மடங்கு அதிகாரம் உம்மீது அல்லாஹ்வுக்கு இருக்கிறது\" என்று கூறுவதை நான் செவியுற்றேன். நான் திரும்பிப் பார்த்தேன். அங்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இருந்தார்கள். உடனே நான், \"அல்லாஹ்வின் தூதரே! அல்லாஹ்வின் உவப்புக்காக (இவரை நான் விடுதலை செய்துவிட்டேன்) இவர் சுதந்திரமானவர்\" என்று கூறினேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அறிந்துகொள்! நீ இவ்வாறு செய்திருக்காவிட்டால் \"நரகம் உம்மை எரித்திருக்கும்\" அல்லது \"நரகம் உம்மைத் தீண்டியிருக்கும்\" என்று கூறினார்கள். அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4309,
			"arabicnumber": "1659.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4310,
			"arabicnumber": "1659.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4311,
			"arabicnumber": "1660.01",
			"text": "அபுல்காசிம் (முஹம்மத் - ஸல்) அவர்கள் கூறினார்கள்: யார் (நிரபராதியான) தம் அடிமைமீது விபசாரம் புரிந்துவிட்டதாக அவதூறு கூறுகிறாரோ, அவருக்கு மறுமை நாளில் (சாட்டையடி) தண்டனை வழங்கப்படும்; அவர் சொன்னதைப் போன்று அந்த அடிமை இருந்தால் தவிர. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"(மனந்திருந்தி பாவமன்னிப்புக் கோரினாலே போதும்; பாவமன்னிப்புக் கிட்டும் எனும் நற்செய்தியுடன் வந்த) \"தவ்பா\"வின் நபி அபுல்காசிம் (ஸல்) அவர்கள் கூறியதை நான் கேட்டுள்ளேன்\" என ஹதீஸ் ஆரம்பமாகிறது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4312,
			"arabicnumber": "1660.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4313,
			"arabicnumber": "1661.01",
			"text": "மஅரூர் பின் சுவைத் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் (மதீனாவுக்கு அருகிலுள்ள) \"ரபதா\" எனுமிடத்தில் அபூதர் (ரலி) அவர்களைக் கடந்து சென்றோம். அப்போது அவர்கள்மீது ஒரு (புதிய) மேலங்கியும், அவர்களுடைய அடிமையின் மீது அதே போன்ற ஒரு (புதிய) மேலங்கியும் இருந்தன. நாங்கள், \"அபூதர் அவர்களே! (அவர் அணிந்திருக்கும் மேலங்கியையும் வாங்கி) இரண்டையும் சேர்த்து நீங்களே அணிந்து கொண்டால் (உங்களுக்கு) ஒரு ஜோடி (புதிய) ஆடையாக இருக்குமே?\" என்று கேட்டோம். அதற்கு அபூதர் (ரலி) அவர்கள் பின்வருமாறு விடையளித்தார்கள்: எனக்கும் என் சகோதரர்களில் ஒருவருக்குமிடையே வாய்த் தகராறு ஏற்பட்டது. அம்மனிதரின் தாய் அரபுப்பெண் அல்லர். எனவே, நான் அவருடைய தாயைக் குறிப்பிட்டுத் தரக் குறைவாகப் பேசிவிட்டேன். உடனே அம்மனிதர் நபி (ஸல்) அவர்களிடம் (சென்று) என்னைப் பற்றி முறையிட்டார். நான் நபி (ஸல்) அவர்களைச் சந்தித்தபோது, \"அபூதர்ரே! நீர் அறியாமைக் காலத்துக் கலாசாரம் உள்ள மனிதராகவே (இன்னும்) இருக்கின்றீர்\" என்று சொன்னார்கள். நான், \"அல்லாஹ்வின் தூதரே! ஒருவர் மற்ற மனிதர்களை ஏசும்போது பதிலுக்கு அவர்கள் அவருடைய தந்தையையும் தாயையும் ஏசத்தானே செய்கிறார்கள்?\" என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், \"அபூதர்! நீர் அறியாமைக் காலத்துக் கலாசாரம் உள்ள மனிதராகவே (இன்னும்) இருக்கின்றீர்\" என்று கூறிவிட்டு, \"(பணியாளர்களான) அவர்கள் உங்கள் சகோதரர்கள் ஆவர். அவர்களை அல்லாஹ் உங்கள் ஆதிக்கத்தின் கீழ் வைத்துள்ளான். ஆகவே, நீங்கள் உண்பதிலிருந்து அவர்களுக்கு உணவளியுங்கள். நீங்கள் அணிவதிலிருந்து அவர்களுக்கு அணியக் கொடுங்கள். அவர்களது சக்திக்கு மீறிய பணியை அவர்களுக்குக் கொடுத்து அவர்களைச் சிரமப்படுத்தாதீர்கள். அவ்வாறு சக்திக்கு மீறிய பணியை அவர்களுக்குக் கொடுத்தால் அவர்களுக்கு நீங்களும் ஒத்துழைப்புத் தாருங்கள்\" என்று கூறினார்கள். அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4314,
			"arabicnumber": "1661.02",
			"text": "மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், ஸுஹைர் பின் முஆவியா (ரஹ்) மற்றும் அபூமுஆவியா (ரஹ்) ஆகியோரது அறிவிப்பில் \"நீர் அறியாமைக் காலத்துக் கலாசாரம் உள்ள மனிதராகவே (இன்னும்) இருக்கின்றீர்\" என்பதற்குப் பின் \"நான் வயோதிகத்தை அடைந்துவிட்ட இந்தக்கால கட்டத்திலுமா (அறியாமைக்காலக் கலாசாரம் கொண்டவனாய் உள்ளேன்)?\" என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள் \"ஆம்\" என்று கூறினார்கள் என அபூதர் (ரலி) அவர்கள் கூறியதாகக் கூடுதலாக இடம்பெற்றுள்ளது. அபூமுஆவியா (ரஹ்) அவர்களது அறிவிப்பில் (இன்னும் சற்றுக் கூடுதலாக) \"ஆம். நீர் வயோதிகத்தை அடைந்துவிட்ட இந்த காலக்கட்டத்திலும் (அறியாமைக் காலக் கலாசாரம் கொண்டவராய் இருக்கின்றீர்)\" என்று நபி (ஸல்) அவர்கள் கூறினார்கள் எனக் காணப்படுகிறது. ஈசா பின் யூனுஸ் (ரஹ்) அவர்களது அறிவிப்பில், \"அவரது சக்திக்கு மீறிய பணியைக் கொடுத்து அவரைச் சிரமப்படுத்திவிட்டால், (அதற்குப் பரிகாரமாக) அவரை விற்றுவிடட்டும்\" என்று இடம்பெற்றுள்ளது. ஸுஹைர் (ரஹ்) அவர்களது அறிவிப்பில் \"அப்பணியில் அவருக்கு ஒத்துழைக்கட்டும்\" என இடம்பெற்றுள்ளது. அபூமுஆவியா (ரஹ்) அவர்களது அறிவிப்பு, \"அவரது சக்திக்கு மீறிய பணியை அவருக்குக் கொடுத்து அவரைச் சிரமப்படுத்தாதீர்கள்\" என்பதோடு முடிவடைந்துவிடுகிறது. \"அவரை விற்றுவிடட்டும்\" என்பதோ, \"அவருக்கு ஒத்துழைக்கட்டும்\" என்பதோ அவரது அறிவிப்பில் இடம் பெறவில்லை. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4315,
			"arabicnumber": "1661.03",
			"text": "மஅரூர் பின் சுவைத் (ரஹ்) அவர்கள் கூறியதாவது: நான் அபூதர் அல்ஃகிஃபாரீ (ரலி) அவர்கள்மீது ஒரு மேலங்கியும் அவர்களுடைய அடிமை யின் மீது அதே மாதிரியான மேலங்கியும் இருப்பதைக் கண்டேன். நான் அது குறித்து அவர் களிடம் வினவியபோது அவர்கள் (பின்வருமாறு) கூறினார்கள்: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் ஒரு (அடிமை) மனிதரை ஏசும் போது, அவருடைய தாயைக் குறிப்பிட்டு இழிவாகப் பேசிவிட்டேன். உடனே அம்மனிதர் நபி (ஸல்) அவர்களிடம் சென்று அதைப் பற்றிக் கூறினார். அப்போது நபி (ஸல்) அவர்கள் (என்னிடம்), \"நீர் அறியாமைக் காலத்துக் கலாசாரம் உள்ள மனிதராகவே இருக்கின்றீர். (அடிமைகளான) அவர்கள் உங்கள் சகோதரர்களும் ஊழியர்களும் ஆவர். அவர்களை அல்லாஹ் உங்கள் ஆதிக்கத்தின் கீழ் வைத்துள்ளான். யாருடைய ஆதிக்கத்தின் கீழ் அவருடைய சகோதரர் இருக்கிறாரோ அவர் தாம் உண்பதிலிருந்து அவருக்கு உணவளிக்கட்டும். தாம் அணிவதிலிருந்து அவருக்கு அணியத் தரட்டும். அவர்களது சக்திக்கு மீறிய பணியைக் கொடுத்து அவர்களைச் சிரமப்படுத்தாதீர்கள். அவ்வாறு அவர்களது சக்திக்கு மீறிய பணியை அவர்களுக்குக் கொடுத்தால் அப்பணியில் அவர்களுக்கு நீங்களும் ஒத்துழையுங்கள்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4316,
			"arabicnumber": "1662",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4317,
			"arabicnumber": "1663",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவருடைய பணியாளர் வெப்பத்தையும் புகையையும் தாங்கிக்கொண்டு உணவு சமைத்துக் கொண்டுவந்தால், அவரையும் தம்முடன் அமரச் செய்து அவர் உண்ணட்டும். உணவு குறைவானதாக இருந்தால் அதில் ஓரிரு கவளங்களையாவது அவரது கையில் வைக்கட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அறிவிப்பாளர்களில் ஒருவரான தாவூத் பின் கைஸ் (ரஹ்) அவர்கள் கூறுகிறார்கள்: \"ஓரிரு கவளங்கள்\" என்பதைக் குறிக்க ஹதீஸின் மூலத்தில் இடம்பெற்றுள்ள \"உக்லத்தன் அவ் உக்லத்தைனி\" என்பதற்கு \"லுக்மத்தன் அவ் லுக்மத்தைனி\" என்று பொருள். (இரண்டுக்கும் பொருள் ஒன்றே.) அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": "1664.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4319,
			"arabicnumber": "1664.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4320,
			"arabicnumber": "1665.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவருக்குச் சொந்தமான நல்ல அடிமைக்கு இரண்டு நன்மைகள் உண்டு. இதன் அறிவிப்பாளரான அபூஹுரைரா (ரலி) அவர்கள் இந்த ஹதீஸை அறிவித்துவிட்டு, \"அபூஹுரைராவின் உயிர் எவன் கையிலுள்ளதோ அவன் மீதாணையாக! அல்லாஹ்வின் பாதையில் அறப்போர் புரிவதும், ஹஜ்ஜும், என் தாய்க்குச் செய்ய வேண்டிய கடமையும் இல்லாமலிருந்தால் நான் (ஒருவரின்) அடிமையாக இருக்கும் நிலையில் இறப்பதையே விரும்பியிருப்பேன்\" என்றார்கள். சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் கூறினார்கள்: தம் தாயாரு(க்குச் செய்யவேண்டிய கடமைகளை நிறைவேற்ற அவரு)டனேயே இருந்ததால், தாயார் இறக்கும்வரை அபூஹுரைரா (ரலி) அவர்கள் (கூடுதலான) ஹஜ்ஜுக்குக் கூடச் செல்லவில்லை என நமக்குச் செய்தி எட்டியது. இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் அபுத்தாஹிர் அஹ்மத் பின் அம்ர் (ரஹ்) அவர்களது அறிவிப்பில் \"நல்ல அடிமைக்கு\" என்று இடம்பெற்றுள்ளது. \"ஒருவருக்குச் சொந்தமான\" எனும் குறிப்பு இல்லை. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் குறிப்பிட்ட அபூஹுரைரா (ரலி) அவர்களைப் பற்றிய குறிப்பும் அதற்குப் பின்னுள்ளவையும் இடம்பெறவில்லை. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4321,
			"arabicnumber": "1665.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4322,
			"arabicnumber": "1666.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4323,
			"arabicnumber": "1666.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4324,
			"arabicnumber": "1667",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4325,
			"arabicnumber": "1501.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": "1501.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4327,
			"arabicnumber": "1501.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4328,
			"arabicnumber": "1501.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4329,
			"arabicnumber": "1501.07",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4330,
			"arabicnumber": "1501.08",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4331,
			"arabicnumber": "1502.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4332,
			"arabicnumber": "1503.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4333,
			"arabicnumber": "1503.05",
			"text": "மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், ஈசா பின் யூனுஸ் (ரஹ்) அவர்களது அறிவிப்பில், \"அவர் விடுதலையளிக்காத பங்கிற்காக அந்த அடிமை உழைத்துச் சம்பாதிக்க அனுமதிக்கப்பட வேண்டும். அவனுக்கு அதிகச் சிரமத்தை அளித்துவிடக் கூடாது\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4334,
			"arabicnumber": "1503.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4335,
			"arabicnumber": "1668.01",
			"text": "இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் தமது மரணத் தறுவாயில் தமக்குச் சொந்தமான ஆறு அடிமைகளை விடுதலை செய்துவிட்டார். அந்த அடிமைகளைத் தவிர வேறு செல்வங்கள் எதுவும் அவரிடம் இருக்க வில்லை. (இச்செய்தி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு எட்டியபோது) அந்த அடிமைகளை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழைத்து, அவர்களை மூன்றில் ஒரு பாகங்களாகப் பிரித்தார்கள். பின்னர் அவர்களிடையே சீட்டுக் குலுக்கிப் போட்டு, அவர்களில் இருவருக்கு மட்டுமே விடுதலையளித்தார்கள்; நால்வரை அடிமைகளாகவே நீடிக்கச் செய்தார்கள். (இறக்கும் தறுவாயில் ஆறு அடிமைகளையும் விடுதலை செய்த) அந்த மனிதரைப் பற்றிக் கடுமையாக (சாடி)ப் பேசினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4336,
			"arabicnumber": "1668.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4337,
			"arabicnumber": "1668.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4338,
			"arabicnumber": "997.03",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அன்சாரிகளில் ஒருவர் (தம்) அடிமை ஒருவரைத் தமது இறப்புக்குப் பின் விடுதலை பெற்ற வராவார் (முதப்பர்) என்று அறிவித்திருந்தார். அவரிடம் அந்த அடிமையைத் தவிர வேறு செல்வம் எதுவுமிருக்கவுமில்லை. இந்த விஷயம் நபி (ஸல்) அவர்களுக்கு எட்டியபோது, \"என்னிடமிருந்து இந்த அடிமையை (விலைக்கு) வாங்குபவர் யார்?\" என்று கேட்டார்கள். அப்போது அந்த அடிமையை நுஐம் பின் அப்தில் லாஹ் (ரலி) அவர்கள் எண்ணூறு திர்ஹங் களுக்கு (வெள்ளிக் காசுகளுக்கு) வாங்கிக் கொண்டார்கள். அவற்றை நபி (ஸல்) அவர்கள் அந்த அன்சாரியிடம் ஒப்படைத்தார்கள். அறிவிப்பாளர்களில் ஒருவரான அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறுகிறார்கள்: ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் \"அந்த அடிமை (எகிப்து நாட்டு) \"கிப்தீ\" அடிமையாவார். அவர் கடந்த ஆண்டுதான் இறந்தார்\" என்றும் கூறக் கேட்டேன். அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4339,
			"arabicnumber": "997.04",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அன்சாரிகளில் ஒருவர் தம் அடிமை ஒருவரைத் தமது இறப்புக்குப் பின் விடுதலை பெற்றவராவார் (முதப்பர்) என்று அறிவித்திருந்தார். அவரிடம் அந்த அடிமையைத் தவிர வேறு செல்வம் எதுவும் இருக்கவில்லை. (இச்செய்தி அறிந்த) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்த அடிமையை விற்றார்கள். அவரை இப்னு நஹ்ஹாம் (ரலி) அவர்கள் விலைக்கு வாங்கிக் கொண்டார்கள். அவர் (எகிப்து நாட்டு) \"கிப்தீ\" அடிமை ஆவார். அவர் அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்களது ஆட்சியில் கடந்த ஆண்டுதான் இறந்தார். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஜாபிர் (ரலி) அவர்களிடமிருந்தே வேறு இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் ஐந்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4340,
			"arabicnumber": "997.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": "997.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 88
			}
		}
	]
}