{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4342,
			"arabicnumber": "1669.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4343,
			"arabicnumber": "1669.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4344,
			"arabicnumber": "1669.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4345,
			"arabicnumber": "1669.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4346,
			"arabicnumber": "1669.05",
			"text": "புஷைர் பின் யசார் (ரஹ்) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில், அன்சாரிகள் என்றும் பின்னர் பனூ ஹாரிஸா குலத்தார் என்றும் அறியப்பட்டவர்களான அப்துல்லாஹ் பின் சஹ்ல் பின் ஸைத் (ரலி) அவர்களும், முஹய்யிஸா பின் மஸ்ஊத் பின் ஸைத் (ரலி) அவர்களும் கைபரை நோக்கிப் புறப்பட்டார்கள். கைபர், அன்று சமாதான ஒப்பந்தம் கையெழுத்தான பகுதியாயிருந்தது. யூதர்களே அங்கு வசித்துவந்தார்கள். (அங்கு சென்றதும்) அவர்கள் இருவரும் தம் தேவைக்காகத் தனித்தனியே பிரிந்துசென்றனர். அப்போது அப்துல்லாஹ் பின் சஹ்ல் (ரலி) அவர்கள் கொல்லப்பட்டு (அத்தோட் டத்திலுள்ள) ஒரு தண்ணீர் தொட்டியில் கிடப்பதைக் கண்டார்கள். உடனே முஹய் யிஸா (ரலி) அவர்கள் அவரை (எடுத்து) அடக்கம் செய்துவிட்டு, மதீனாவை நோக்கி வந்தார்கள். கொல்லப்பட்டவரின் சகோதரர் அப்துர் ரஹ்மான் பின் சஹ்ல் (ரலி) அவர்களும் (உறவினர்களான) முஹய்யிஸா (ரலி) மற்றும் ஹுவய்யிஸா (ரலி) ஆகியோரும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று அப்துல்லாஹ் (ரலி) அவர்களது நிலை குறித்தும் அவர் கொல்லப்பட்டுக் கிடந்த இடத்தைப் பற்றியும் தெரிவித்தனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(அப்துல்லாஹ்வை இன்ன மனிதர்தாம் கொலை செய்தார் என்று) உங்களில் ஐம்பது பேர் சத்தியம் செய்து, நீங்கள் \"உங்கள் கொலையாளியிடமிருந்து (இழப்பீடு) பெறும் உரிமையை\"அல்லது \"உங்கள் தோழருக்காக (பழிவாங்கும்) உரிமையை\" எடுத்துக்கொள்கிறீர்களா?\" என்று கேட்டார்கள். அதற்கு அவர்கள், \"அல்லாஹ்வின் தூதரே! சம்பவம் நடந்த இடத்தில் நாங்கள் இருக்கவுமில்லை; சம்பவத்தைப் பார்க்கவும் இல்லையே!\" என்று கேட்டார்கள். \"அப்படியானால், யூதர்களில் ஐம்பது பேர் சத்தியம் செய்து, தாம் நிரபராதிகள் என்பதை உங்களிடம் நிரூபிப்பார்கள்\" என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். அதற்கு அவர்கள், \"அல்லாஹ்வின் தூதரே! நிராகரிக்கும் சமுதாயத்தாரின் சத்தியத்தை எப்படி நாங்கள் ஏற்க முடியும்?\" என்று கேட்டார்கள். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தாமே அப்துல்லாஹ்வின் கொலைக்கான உயிரீட்டுத் தொகையை வழங்கினார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4347,
			"arabicnumber": "1669.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4348,
			"arabicnumber": "1669.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4349,
			"arabicnumber": "1669.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4350,
			"arabicnumber": "1670.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4351,
			"arabicnumber": "1670.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4352,
			"arabicnumber": "1670.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4353,
			"arabicnumber": "1671.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: \"உரைனா\" குலத்தைச் சேர்ந்த சிலர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் மதீனாவுக்கு வந்(து தங்கியிருந்)தபோது, அவர்களுக்கு மதீனாவின் தட்பவெப்ப நிலை ஒத்துக் கொள்ளவில்லை. எனவே, அவர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீங்கள் விரும்பினால் தர்ம ஒட்டகங்களிடம் சென்று, அவற்றின் பாலையும் சிறுநீரையும் அருந்தி (நிவாரணமடைந்து) கொள்ளுங்கள்\" என்று கூறினார்கள். அவ்வாறே அவர்கள் செய்து குணமடைந்தனர். பிறகு (நபியவர்களின்) ஒட்டக மேய்ப்பாளர்களைத் தாக்கிக் கொலை செய்தனர்; இஸ்லாத்திலிருந்து வெளியேறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் அந்த ஒட்டக மந்தையை ஓட்டிச் சென்றுவிட்டனர். இச்செய்தி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு எட்டியபோது, உடனே அவர்களைப் பின்தொடர்ந்து (அவர்களைப் பிடித்துவர) ஆட்களை அனுப்பினார்கள். அவர்கள் பிடித்துக் கொண்டுவரப்பட்டதும் (பல கொடுஞ்செயல்கள் புரிந்த) அவர்களது (இடக்) கையையும் (வலக்) காலையும் துண்டித்தார்கள்; அவர்களது கண்களில் சூடிட்டார்கள்; பிறகு சாகும்வரை அவர்களை \"ஹர்ரா\"ப் பகுதியில் போட்டுவிட்டார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4354,
			"arabicnumber": "1671.02",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: \"உக்ல்\" குலத்தைச் சேர்ந்த எட்டுப்பேர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, இஸ்லாத்தை ஏற்றுக்கொண்டதாக உறுதிமொழி அளித்(து மதீனாவில் தங்கியிருந்)தனர். அவர்களுக்கு மதீனாவின் தட்ப வெப்பநிலை ஒத்துக்கொள்ளாமல் அவர்களது உடல் நோய் கண்டது. எனவே, அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அதைப்பற்றி முறையிட்டனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நம் ஒட்டக மேய்ப்பருடன் ஒட்டகங்களிருக்கும் இடத்திற்குச் சென்று, அவற்றின் பாலையும் சிறுநீரையும் பயன்படுத்தி (நிவாரணம் பெற்று)க் கொள்கிறீர்களா?\" என்று கேட்டார்கள். அதற்கு அவர்கள் \"சரி\" என்று கூறி, புறப்பட்டுச் சென்று ஒட்டகங்களின் பாலையும் சிறுநீரையும் அருந்தி நிவாரணம் பெற்றனர். பிறகு அந்த ஒட்டக மேய்ப்பரைக் கொலை செய்துவிட்டு, ஒட்டகங்களை ஓட்டிச் சென்று விட்டனர். இவ்விஷயம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு எட்டியபோது, உடனே அவர்களைப் பின்தொடர்ந்து ஆட்களை அனுப்பினார்கள். அவர்கள் பிடிக்கப்பட்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுவரப்பட்டனர். அப்போது அவர்களின் கை கால்களைத் துண்டித்து, அவர்களின் கண்களில் சூடிடுமாறு நபியவர்கள் உத்தரவிட்டார்கள். பிறகு அவர்கள் சாகும்வரை (\"ஹர்ரா\"ப் பகுதியில்) வெயிலில் போடப்பட்டனர். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் முஹம்மத் பின் அஸ்ஸப்பாஹ் (ரஹ்) அவர்களது அறிவிப்பில், \"கால்நடைகளை அவர்கள் ஓட்டிச் சென்று விட்டனர்; அவர்களின் கண்களுக்குச் சூடிடப்பட்டது\"என இடம்பெற்றுள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4355,
			"arabicnumber": "1671.03",
			"text": "மேற்கண்ட ஹதீஸ் அனஸ் பின் மாலிக் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"உக்ல் மற்றும் உரைனா குலத்தைச் சேர்ந்த சிலர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தனர். அவர்களுக்கு மதீனாவின் தட்பவெப்ப நிலை ஒத்துக் கொள்ளவில்லை. (அவர்கள் உடல் நலிவுற்றனர்.) எனவே,அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், பால் ஒட்டகங்களிடம் சென்று, அவற்றின் பாலையும் சிறுநீரையும் அருந்துமாறு அவர்களுக்குக் கட்டளையிட்டார்கள்\" என ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. இந்த அறிவிப்பில் \"அவர்களின் கண்களுக்குச் சூடு போடப்பட்டு, அவர்கள் \"ஹர்ரா\"ப் பகுதியில் போடப்பட்டனர். அவர்கள் குடிப்பதற்குத் தண்ணீர் கேட்டும் வழங்கப்படவில்லை\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4356,
			"arabicnumber": "1671.04",
			"text": "அபூகிலாபா அப்துல்லாஹ் பின் ஸைத் (ரஹ்) அவர்கள் கூறியதாவது: (ஒரு நாள்) நான் (கலீஃபா) உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்களுக்குப் பின்னால் அமர்ந்திருந்தேன். அப்போது அவர்கள் மக்களிடம், \"அல்கஸாமா சத்தியம் குறித்து என்ன கூறுகிறீர்கள்?\" என்று கேட்டார்கள். அப்போது அன்பஸா பின் சயீத் (ரஹ்) அவர்கள், \"அனஸ் பின் மாலிக் (ரலி) அவர்கள் நம்மிடம் இன்னின்னவாறு கூறினார்கள்\" என்றார்கள். நான், என்னிடமும் அனஸ் (ரலி) அவர்கள் கூறினார்கள் என்று கூறிவிட்டு \"உரைனா\" குலத்தார் பற்றிய ஹதீஸை (மேற்கண்ட ஹதீஸ்களில் உள்ளதைப் போன்று) அறிவித்தேன். நான் அந்த ஹதீஸை அறிவித்து முடித்ததும் அன்பஸா (ரஹ்) அவர்கள், \"அல்லாஹ் தூயவன்!\" என (வியப்புடன்) கூறினார்கள். நான், \"அன்பஸா அவர்களே! என்மீது சந்தேகப் படுகிறீர்களா?\" என்று கேட்டேன். அதற்கு அவர்கள், \"இல்லை; இவ்வாறுதான் எம்மிடமும் அனஸ் (ரலி) அவர்கள் அறிவித்தார்கள்\" என்று கூறிவிட்டு, \"சிரியாவாசிகளே! \"இவர்\" (அபூ கிலாபா) அல்லது \"இவரைப் போன்றவர்\" உங்களிடையே இருக்கும்வரை நீங்கள் நன்மையில் நீடிப்பீர்கள்\"என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் அனஸ் பின் மாலிக் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"உக்ல் குலத்தாரில் எட்டுப்பேர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தார்கள்\" என்று இடம்பெற்றுள்ளது. இந்த அறிவிப்பில் \"அவர்க(ளது காயத்திலிருந்து வழிந்த இரத்தத்தை நிறுத்துவதற்காகக் கை, கால் நரம்புக)ளுக்குச் சூடிடவில்லை\" என்று கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4357,
			"arabicnumber": "1671.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4358,
			"arabicnumber": "1671.06",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: \"உரைனா\" குலத்தைச் சேர்ந்த சிலர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து இஸ்லாத்தை ஏற்று உறுதிமொழியும் அளித்தனர். அப்போது மதீனாவில் நுரையீரல் சவ்வு அழற்சி நோய் ஏற்பட்டிருந்தது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸ்களில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. இந்த அறிவிப்பில், \"அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு அருகில் சுமார் இருபது அன்சாரீ இளைஞர்கள் இருந்தனர். அவர்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"உரைனா\" கூட்டத்தாரைப் பிடித்து வர அனுப்பினார்கள். அவர்களுடன் காலடித் தடங்களை அறியும் தடய நிபுணர் ஒருவரையும் அனுப்பினார்கள்\" என்று அதிகப்படியாக இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ஹம்மாம் பின் யஹ்யா (ரஹ்) அவர்களது அறிவிப்பில், \"உரைனா குலத்தாரில் ஒரு குழுவினர்\" என்று இடம்பெற்றுள்ளது. சயீத் பின் அபீஅரூபா (ரஹ்) அவர்களது அறிவிப்பில், \"உக்ல் மற்றும் உரைனா குலத்தாரில் சிலர்\"என்று காணப்படுகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸ்களில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4359,
			"arabicnumber": "1671.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4360,
			"arabicnumber": "1671.08",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அந்த ஒட்டக மேய்ப்பர்களின் கண்களில் அவர்கள் சூடிட்டதால்தான் அவர்களுடைய கண்களில் நபி (ஸல்) அவர்கள் சூடிடச் செய்தார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4361,
			"arabicnumber": "1672.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: யூதனொருவன் ஒரு சிறுமியை, அவளது வெள்ளி நகைக்காகக் கல் எறிந்து கொன்று விட்டான். உயிர் ஊசலாடிக்கொண்டிருந்த அந்தச் சிறுமி நபி (ஸல்) அவர்களிடம் கொண்டு வரப்பட்டாள். அவளிடம் நபி (ஸல்) அவர்கள், \"இன்ன மனிதரா உன்னைத் தாக்கினார்?\" என்று கேட்டார்கள். அவள் \"இல்லை\" என்று தலையால் சைகை செய்தாள். மீண்டும் அவர்கள், \"இன்ன மனிதரா உன்னைத் தாக்கினார்?\" என்று கேட்டார்கள். அவள் அப்போதும் \"இல்லை\" என்று தலையாட்டினாள். தொடர்ந்து மூன்றாவது முறையாக அவளிடம், \"இன்ன மனிதரா உன்னைத் தாக்கினார்?\" என்று (ஒரு மனிதரது பெயரைக் குறிப்பிட்டுக்) கேட்டபோது அவள் \"ஆம்\" என்று தலையால் சைகை செய்தாள். ஆகவே, அந்த யூதனை (அழைத்து வந்து விசாரித்து, அவன் ஒப்புக்கொண்டதும்) இரு கற்களுக்கிடையே வைத்து அவ(னது தலையி)னை (நசுக்கி)க் கொல்லுமாறு நபி (ஸல்) அவர்கள் உத்தரவிட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் அப்துல்லாஹ் பின் இத்ரீஸ் (ரஹ்) அவர்களது அறிவிப்பில், \"இரு கற்களுக்கிடையே அவனது தலையை வைத்து நசுக்கிக் கொல்லுமாறு உத்தரவிட்டார்கள்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4362,
			"arabicnumber": "1672.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4363,
			"arabicnumber": "1672.03",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: யூதர்களில் ஒருவன் அன்சாரிகளில் ஒரு சிறுமியை, அவள் அணிந்திருந்த நகைக்காகக் கொலை செய்து, அவளை ஒரு பாழடைந்த கிணற்றில் போட்டு, அவளது தலையைக் கல்லால் நசுக்கினான். அவன் பிடிக்கப்பட்டு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுவரப்பட்டான். சாகும்வரை அவனைக் கல்லால் அடிக்குமாறு (மரண தண்டனை விதித்து) அவர்கள் உத்தரவிட்டார்கள். அவ்வாறே அவன் கல்லால் எறிந்து கொல்லப்பட்டான். - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4364,
			"arabicnumber": "1672.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4365,
			"arabicnumber": "1672.05",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஒரு சிறுமி இரு கற்களுக்கிடையே தலை நசுக்கப்பட்ட நிலையில் கிடந்தாள். மக்கள் அவளிடம், \"உன்னை இப்படிச் செய்தவர் யார்? இன்ன மனிதனா? இன்ன மனிதனா?\" என்று கேட்டார்கள். யூதன் ஒருவனின் பெயரை அவர்கள் கூறியதும், அச்சிறுமி (\"ஆம் அவன்தான்\" என்று) தலையால் சைகை செய்தாள். அந்த யூதன் பிடிக்கப்பட்டு (விசாரிக்கப்பட்டதில்), குற்றத்தை ஒப்புக்கொண்டான். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவனது தலையில் கல்லைப் போட்டு நசுக்குமாறு உத்தரவிட்டார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4366,
			"arabicnumber": "1673.01",
			"text": "இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள் கூறியதாவது: யஅலா பின் முன்யா (அல்லது யஅலா பின் உமய்யா - ரலி) அவர்களுக்கும் மற்றொரு மனிதருக்குமிடையே சண்டை ஏற்பட்டது. அப்போது அவர்களில் ஒருவர் இன்னொருவரைக் கடித்தார். அப்போது (கடிபட்டவர்) தமது கையை அவரது வாயிலிருந்து இழுத்தார். இதனால் கடித்தவரின் முன்பல் ஒன்று விழுந்துவிட்டது. இதையொட்டி அவர்கள் இருவரும் நபி (ஸல்) அவர்களிடம் வழக்கைக் கொண்டுவந்தனர். அப்போது நபி (ஸல்) அவர்கள் \"உங்களில் ஒருவர் தம் சகோதரனின் கையைக் கடா ஒட்டகம் கடிப்பதைப் போன்று கடிப்பாரா? (அவர் கடித்துக் கொண்டிருக்கும்வரை கடிபட்டவன் தனது கையை அப்படியே வைத்துக்கொண்டிருப்பானா? \"பல்லிழந்த) இவருக்கு இழப்பீட்டுத் தொகை கிடையாது\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் முஹம்மத் பின் அல்முஸன்னா (ரஹ்) அவர்களது அறிவிப்பில், \"கடித்தவரின் முன்பற்கள் இரண்டு விழுந்துவிட்டன\" என்று இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் யஅலா பின் உமய்யா (ரலி) அவர்கள் வாயிலாக இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4367,
			"arabicnumber": "1673.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4368,
			"arabicnumber": "1673.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4369,
			"arabicnumber": "1674.01",
			"text": "ஸஃப்வான் பின் யஅலா (ரஹ்) அவர்கள் கூறியதாவது: யஅலா பின் உமய்யா (ரலி) அவர்களு டைய ஊழியர் ஒருவரின் முன்கையை ஒரு மனிதர் கடித்துவிட்டார். ஊழியர் தனது கையை இழுக்க, (கடித்த) அந்த மனிதரது முன்பல் ஒன்று (கழன்று) விழுந்துவிட்டது. இவ்வழக்கு நபி (ஸல்) அவர்களிடம் கொண்டு வரப்பட்டபோது, அவ்வழக்கை நபியவர்கள் தள்ளுபடி செய்தார்கள். மேலும், \"கடா ஒட்டகம் கடிப்பதைப் போன்று அவரது கரத்தை நீ கடிக்கப் பார்த்தாய். (எனவே, உனக்கு இழப்பீடு இல்லை)\" என்று கூறினார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4370,
			"arabicnumber": "1673.04",
			"text": "இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் மற்றொரு மனிதரின் கையைக் கடித்தார். அவர் தமது கையை இழுக்க, (கடித்த) அவருடைய \"முன்பல் ஒன்று\" அல்லது \"முன்பற்கள்\" விழுந்துவிட்டன. அவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் உதவியை நாடினார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"என்னை என்ன செய்யச் சொல்கிறாய்? கடா ஒட்டகம் கடிப்பதைப் போன்று நீ கடித்துக் கொண்டிருக்கும்வரை அவர் தமது கையை உனது வாய்க்குள் வைத்திருக்க வேண்டும் என உத்தரவிடச் சொல்கிறாயா? நீ உனது கையை அவர் கடித்து முடிக்கும்வரை அவரது வாய்க்குள் விட்டுவை. பிறகு இழுத்துப் பார் (தெரியும்)\" என்று சொன்னார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4371,
			"arabicnumber": "1674.02",
			"text": "யஅலா பின் முன்யா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் வந்தார். அவர் மற்றொரு மனிதரின் கையைக் கடித்தபோது, (கடிபட்ட) அவர் தமது கையை இழுக்க, அவரது (அதாவது கடித்தவரது) முன்பற்கள் இரண்டு விழுந்து விட்டன. அப்போது நபி (ஸல்) அவர்கள் (இதற்கு இழப்பீடு தரத் தேவையில்லை என) அவரது வழக்கைத் தள்ளுபடி செய்தார்கள். மேலும் \"நீ அவரை, கடா ஒட்டகம் கடிப்பதைப் போன்று கடிக்கப் பார்த்தாய்\" என்றும் கூறினார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4372,
			"arabicnumber": "1674.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4373,
			"arabicnumber": "1674.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4374,
			"arabicnumber": "1675",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ருபய்யிஉ (ரலி) அவர்களின் சகோதரி உம்மு ஹாரிஸா (ரலி) அவர்கள் ஒரு மனிதரை(த் தாக்கி)க் காயப்படுத்திவிட்டார்கள். இதையொட்டி அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வழக்கைக் கொண்டுவந்தனர். (வழக்கை விசாரித்த) நபி (ஸல்) அவர்கள், \"பழிக்குப்பழி (வாங்கிக் கொள்க) பழிக்குப்பழி (வாங்கிக்கொள்க)\" என்று கூறினார்கள். அப்போது உம்முர் ரபீஉ (ரலி) அவர்கள் \"அல்லாஹ்வின் தூதரே! இன்ன பெண் பழி வாங்கப்படுவாரா, அல்லாஹ்வின் மீதாணையாக! அவள் பழிவாங்கப்படக் கூடாது\" என்றார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அல்லாஹ் தூயவன். உம்முர் ரபீஉவே! (காயங்களில்) பழிவாங்குதல் அல்லாஹ்வின் வேத(ச் சட்ட)மாகும்\" என்று சொன்னார்கள். அதற்கு உம்முர் ரபீஉ (ரலி) அவர்கள், \"அப்படி நடக்காது. அல்லாஹ்வின் மீதாணையாக! ஒருபோதும் அவள் பழிவாங்கப்படலாகாது\" என்று கூறினார்கள். அப்படியே பேச்சு தொடர்ந்து, இறுதியில் (பாதிக்கப்பட்டவர்கள் மன்னித்து) இழப்பீட்டுத் தொகையை ஏற்றுக்கொண்டனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ்வின் அடியார்களில் சிலர் உள்ளனர். அவர்கள் அல்லாஹ்வின் மீது சத்தியமிட்டு (எதையேனும் கூறி) விடுவார்களாயின், அதை அல்லாஹ் உண்மையாக்கிவிடுகின்றான்\" என்று கூறினார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4375,
			"arabicnumber": "1676.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4376,
			"arabicnumber": "1676.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4377,
			"arabicnumber": "1676.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4378,
			"arabicnumber": "1676.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4379,
			"arabicnumber": "1677.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4380,
			"arabicnumber": "1677.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4381,
			"arabicnumber": "1678.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் (மனித உரிமைகள் தொடர்பான வழக்குகளில்) முதன் முதலாக மனிதர்களிடையே வழங்கப்படும் தீர்ப்பு, கொலைகள் தொடர்பானதாகவே இருக்கும். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் ஐந்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், சிலரது அறிவிப்பில் (\"தீர்ப்பு வழங்கப்படும்\" என்பதைக் குறிக்க) \"யுக்ளா\" எனும் சொல்லும், வேறுசிலரது அறிவிப்பில் \"யுஹ்கமு\" எனும் சொல்லும் இடம்பெற்றுள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4382,
			"arabicnumber": "1678.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4383,
			"arabicnumber": "1679.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4384,
			"arabicnumber": "1679.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4385,
			"arabicnumber": "1679.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4386,
			"arabicnumber": "1679.04",
			"text": "மேற்கண்ட ஹதீஸ் அபூபக்ரா (ரலி) அவர்களிடமிருந்தே மேலும் ஆறு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நஹ்ருடைய (துல்ஹஜ் பத்தாவது) நாளில் எங்களுக்கு உரையாற்றினார்கள். அப்போது \"இது எந்த நாள்?\" என்று கேட்டார்கள்...\" என ஹதீஸ் ஆரம்பமாகிறது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. ஆயினும், அவற்றில் \"உங்கள் மானம்\" என்பதும் \"பிறகு இரு செம்மறியாட்டு கடாக்களின் பக்கம் திரும்பினார்கள்\" என்பதும் அதற்குப் பின்னுள்ள குறிப்புகளும் இடம் பெறவில்லை. அவற்றில் \"உங்களது புனிதமிக்க இந்த நகரத்தில் உங்களின் புனிதமிக்க இந்த மாதத்தில் இந்த நாள் எந்த அளவுக்குப் புனிதமானதோ அதைப் போன்றே (உங்கள் உயிர்களும் உடைமைகளும்) நீங்கள் உங்கள் இறைவனைச் சந்திக்கும் நாள்வரை உங்களுக்குப் புனிதமானவையாகும்\" என்று கூறிவிட்டு \"நான் (இறைச்செய்திகளை உங்களிடம்) சேர்த்துவிட்டேனா?\" என்று கேட்டார்கள். நாங்கள் \"ஆம்\" என்றோம். அவர்கள் \"இறைவா! நீயே இதற்குச் சாட்சியாக இரு\" என்று கூறினார்கள் என்றும் இடம்பெற்றுள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4387,
			"arabicnumber": "1680.01",
			"text": "வாயில் பின் ஹுஜ்ர் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நான் நபி (ஸல்) அவர்களுடன் அமர்ந்திருந்தேன். அப்போது ஒரு மனிதர் மற்றொரு மனிதரைத் தோல்வாரினால் (கழுத்தில் போட்டு) இழுத்துக்கொண்டு வந்தார். \"அல்லாஹ்வின் தூதரே! இவர் என் சகோதரனைக் கொலை செய்துவிட்டார்\" என்று கூறினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அந்த மனிதரிடம்), \"நீ அவரைக் கொலை செய்தாயா?\" என்று கேட்டார்கள். (அப்போது அவரை இழுத்துக்கொண்டு வந்தவர், இவர் கொலையை ஒப்புக்கொள்ளாவிட்டால் இவருக்கெதிரான ஆதாரத்தை நான் நிலை நிறுத்துவேன்\" என்றும் கூறினார்). அதற்கு அந்த மனிதர், \"ஆம், நான் அவரைக் கொலை செய்தேன்\" என்று (ஒப்புதல் வாக்குமூலம்) சென்னார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"எப்படி (இக்கொலையை) நீ செய்தாய்?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர், \"நானும் அவரும் ஒரு மரத்தில் (தடியால் அடித்து) இலை உதிர்த்துக்கொண்டிருந்தோம். அப்போது அவர் என்னை ஏசினார். எனக்குக் கோபம் ஏற்பட்டது. உடனே நான் (என் கையிலிருந்த) கோடரியால் அவரது உச்சந்தலையில் அடித்துவிட்டேன். அவர் இறந்துவிட்டார். (திட்டமிட்டு இந்தக் கொலையை நான் செய்யவில்லை)\" என்று சொன்னார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவருக்கு இழப்பீடு வழங்க உம்மிடம் ஏதேனும் (பொருள்) உண்டா?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர் \"என்னிடம் எனது போர்வையையும் எனது கோடரியையும் தவிர வேறொன்றுமில்லை\" என்று கூறினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உன்னுடைய கூட்டத்தார் உனக்காக (இழப்பீடு) திரட்டித் தருவார்கள் என்று நீ கருதுகிறாயா?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர், \"நான் என் கூட்டத்தாரிடம் அந்த அளவுக்கு மதிப்புடையவன் அல்லன்\" என்று சொன்னார். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவரது (கழுத்தில் கிடந்த) தோல் வாரை, அ(வரை இழுத்துவ)ந்த மனிதரிடம் தூக்கிப் போட்டு, \"உம்முடைய ஆளைப் பிடித்துக்கொள்க\" என்று சொன்னார்கள். உடனே அந்த மனிதர் அவரை (இழுத்து)க்கொண்டு சென்றார். அவர் திரும்பிச் சென்றதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவரை அவர் கொன்றுவிட்டால், அவரும் இவரைப் போன்றவரே ஆவார்\" என்று கூறினார்கள். அந்த மனிதர் திரும்பிவந்து, \"அல்லாஹ்வின் தூதரே! நீங்கள் \"இவரை அவர் கொன்று விட்டால் அவரும் இவரைப் போன்றவரே ஆவார்\" என்று கூறியதாக எனக்குச் செய்தி எட்டியதே! உங்களது கட்டளைப்படிதானே நான் இவரை பிடித்துச்சென்றேன்\" என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவர் உமது பாவத்துடனும் (கொல்லப்பட்ட) உன் உறவினரின் பாவத்துடனும் திரும்புவதை நீர் விரும்புகிறீரா?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர், \"அல்லாஹ்வின் தூதரே! ஆம். அது அவ்வாறே ஆகட்டும்\" என்று கூறிவிட்டு, அவரது (கழுத்தில் கிடந்த) தோல் வாரைத் தூக்கியெறிந்து, அவரை அவரது வழியிலேயே செல்ல விட்டுவிட்டார். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4388,
			"arabicnumber": "1680.02",
			"text": "வாயில் பின் ஹுஜ்ர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு மனிதர் கொண்டுவரப்பட்டார். அவர் மற்றொரு மனிதரைக் கொலை செய்திருந்தார். அப்போது கொலையுண்டவரின் பொறுப்பாளர் கொலையாளியைப் பழிக்குப்பழி வாங்கிக்கொள்ள அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அனுமதித்தார்கள். அவரும் அக்கொலையாளியின் கழுத்தில் ஒரு தோல் வாரைப் போட்டு இழுத்துக்கொண்டு சென்றார். அவர் திரும்பிச் சென்றபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"கொலையாளியும் கொலையுண்டவரும் நரகவாசிகள் ஆவர்\" என்று சொன்னார்கள். (அதைச் செவியுற்ற) ஒரு மனிதர் (கொலையுண்டவரின்) பொறுப்பாளரிடம் சென்று, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதைத் தெரிவித்தார். எனவே, அவர் அக்கொலையாளியை (மன்னித்து) விட்டுவிட்டார். அறிவிப்பாளர்களில் ஒருவரான இஸ்மாயீல் பின் சாலிம் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் இந்த ஹதீஸை ஹபீப் பின் அபீஸாபித் (ரஹ்) அவர்களிடம் குறிப்பிட்டேன். அப்போது அவர்கள், \"நபி (ஸல்) அவர்கள் (தவறுதலாகக் கொலை செய்த) அவரை மன்னித்துவிடுமாறு (கொலையுண்டவரின்) பொறுப்பாளரிடம் கேட்டார்கள். அவர் மறுத்துவிட்டார். (எனவேதான், அவ்வாறு கூறினார்கள்)\" என்று சயீத் பின் அம்ர் பின் அஷ்வஉ (ரஹ்) அவர்கள் என்னிடம் கூறினார்கள்\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4389,
			"arabicnumber": "1681.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஹுதைல் குலத்தைச் சேர்ந்த இரண்டு பெண்களில் ஒருத்தி மற்றொருத்தியின் மீது கல்லை எறிய, அப்பெண்ணின் (வயிற்றில் பட்டு வயிற்றிலிருந்த) சிசு இறந்து பிறந்தது. இந்த வழக்கில் உயிரீட்டுத் தொகையாக ஓர் ஆண் அடிமையை அல்லது ஒரு பெண் அடிமையைத் தர வேண்டுமென நபி (ஸல்) அவர்கள் தீர்ப்பளித்தார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4390,
			"arabicnumber": "1681.02",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: \"பனூ லஹ்யான்\" (ஹுதைல்) குலத்தைச் சேர்ந்த (கர்ப்பிணி) பெண் ஒருத்தியின் சிசு (மற்றொரு பெண் அடித்ததால்) இறந்து பிறந்தது. அது தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ஓர் ஆண் அடிமையை, அல்லது ஓர் அடிமைப் பெண்ணை (இழப்பீடாக) வழங்க வேண்டுமென்று தீர்ப்பளித்தார்கள். பின்னர், இழப்பீடு வழங்கும்படி தீர்ப்பளிக்கப்பட்ட அ(ந்தக் குற்றவாளி)ப் பெண் இறந்துவிட்டாள். ஆகவே, (அவள் சார்பாக) அவளுடைய தந்தைவழி உறவினர்கள் (அஸபா) இழப்பீடு வழங்க வேண்டுமென்றும், அவளது சொத்து அவளுடைய ஆண் மக்களுக்கும் கணவருக்கும் உரியதென்றும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தீர்ப்பளித்தார்கள். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4391,
			"arabicnumber": "1681.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4392,
			"arabicnumber": "1681.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4393,
			"arabicnumber": "1682.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4394,
			"arabicnumber": "1682.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4395,
			"arabicnumber": "1682.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4396,
			"arabicnumber": "1682.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4397,
			"arabicnumber": "1683",
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 56
			}
		}
	]
}