{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4398,
			"arabicnumber": "1684.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4399,
			"arabicnumber": "1684.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4400,
			"arabicnumber": "1684.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4401,
			"arabicnumber": "1684.04",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், கால் தீனார் (பொற்காசு) அல்லது அதற்கு மேல் திருடியதற்காகத் திருடனின் கையைத் துண்டித்துவந்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஆயிஷா (ரலி) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4402,
			"arabicnumber": "1684.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4403,
			"arabicnumber": "1684.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4404,
			"arabicnumber": "1685.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4405,
			"arabicnumber": "1685.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4406,
			"arabicnumber": "1686.01",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், மூன்று திர்ஹங்கள் விலை மதிப்புள்ள ஒரு தோல் கேடயத்தைத் திருடியவரின் கையைத் துண்டித்தார்கள். - மேற்கண்ட ஹதீஸ் இப்னு உமர் (ரலி) அவர்களிடமிருந்தே மேலும் இருபத்தோரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. இவற்றில், சில அறிவிப்புகளில் \"விலை\" என்பதைக் குறிக்க \"கீமத்” எனும் சொல்லும், வேறுசில அறிவிப்புகளில் \"ஸமன்” எனும் சொல்லும் ஆளப்பட்டுள்ளன. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4407,
			"arabicnumber": "1686.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4408,
			"arabicnumber": "1687.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் சாபம் திருடன்மீது உண்டாகட்டும்! அவன் (விலை மதிப்புள்ள) தலைக் கவசத்தைத் திருடுகிறான்;அதற்காக அவனது கை துண்டிக்கப்படுகிறது. (விலை மலிவான) கயிற்றையும் அவன் திருடுகிறான். அதற்காகவும் அவனது கை துண்டிக்கப்படுகிறது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் அஃமஷ் (ரஹ்) அவர்களது அறிவிப்பில், \"அவன் கயிற்றைத் திருடினாலும் சரி, தலைக்கவசத்தைத் திருடினாலும் சரி (அவனது கை துண்டிக்கப்படுகிறது)\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4409,
			"arabicnumber": "1687.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4410,
			"arabicnumber": "1688.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: \"மக்ஸூமி” குலத்தைச் சேர்ந்த ஒரு பெண் திருடிவிட்டாள் என்ற செய்தி குறைஷியருக்குக் கவலையளித்தது. அப்போது அவர்கள், \"அந்தப் பெண் தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (பேசி, தண்டனையிலிருந்து விலக்கு அளிக்கச்) சொல்வது யார்?\" என்று கேட்டுக்கொண்டார்கள். பிறகு \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் செல்லப் பிள்ளையான உசாமா பின் ஸைதைத் தவிர வேறு யார் துணிந்து பேச முடியும்?\" என்று சொன்னார்கள். அவ்வாறே உசாமா (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (பரிந்து) பேசினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ் விதித்த தண்டனைகளில் ஒன்றின் விஷயத்திலா (அதை நிறைவேற்றாமல் விட்டுவிடுமாறு) நீ பரிந்துரைக்கிறாய்?\" என்று கேட்டுவிட்டுப் பிறகு எழுந்து நின்று பின்வருமாறு உரையாற்றினார்கள்: மக்களே! உங்களுக்கு முன்னால் வாழ்ந்த (பனூ இஸ்ராயீல்) மக்கள் அழிந்துபோனதற்குக் காரணமே, (அவர்களிடையே உள்ள) உயர் குலத்தார் திருடிவிட்டால், அவர்கள் அவரை (தண்டிக்காமல்) விட்டுவிடுவார்கள். அவர்களிலுள்ள பலவீனர்கள் திருடிவிட்டால் அவர்கள்மீது தண்டனையை நடைமுறைப்படுத்துவார்கள். அல்லாஹ்வின் மீதாணையாக! (இந்த) முஹம்மதின் மகள் ஃபாத்திமா திருடியிருந்தாலும், நான் அவரது கையைத் துண்டித்தே இருப்பேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4411,
			"arabicnumber": "1688.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4412,
			"arabicnumber": "1688.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4413,
			"arabicnumber": "1689",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4414,
			"arabicnumber": "1690.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (விபச்சாரக் குற்றத்திற்கான தண்டனைச் சட்டத்தை) என்னிடமிருந்து பெற்றுக் கொள்வீர்; என்னிடமிருந்து பெற்றுக் கொள்வீர். அல்லாஹ் (வாக்களித்திருந்ததைப் போன்று), பெண்களுக்கு ஒரு வழியை ஏற்படுத்திவிட்டான். மணமாகாத பெண்ணுடன் மணமாகாத ஆண் விபச்சாரம் செய்துவிட்டால் நூறு சாட்டையடிகள் வழங்கி, ஓராண்டுக் காலத்திற்கு நாடு கடத்தப்பட வேண்டும். மணமான பெண்ணுடன் மணமான ஆண் விபச்சாரம் செய்துவிட்டால், நூறு சாட்டையடிகள் வழங்கி கல்லெறி தண்டனை வழங்கப்பட வேண்டும். இதை உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4415,
			"arabicnumber": "1690.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4416,
			"arabicnumber": "1690.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4417,
			"arabicnumber": "1690.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4418,
			"arabicnumber": "1691.01",
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (கலீஃபா) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது சொற்பொழிவு மேடை (மிம்பர்) மீதமர்ந்தபடி (பின்வருமாறு) கூறினார்கள்: முஹம்மத் (ஸல்) அவர்களைச் சத்திய (மார்க்க)த்துடன் அல்லாஹ் அனுப்பினான். அவர்களுக்கு (குர்ஆன் எனும்) வேதத்தையும் அருளினான். அல்லாஹ் அருளிய (வேதத்)தில் கல்லெறி தண்டனை (ரஜ்ம்) குறித்த வசனம் இருந்தது. அதை நாங்கள் ஓதியிருக்கிறோம். அதை மனனமிட்டிருக்கிறோம். அதை விளங்கியுமிருக்கிறோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், (மணமானவர்கள் விபச்சாரம் செய்தால் அவர்களுக்குக்) கல்லெறி தண்டனை (ரஜ்ம்) நிறை வேற்றியுள்ளார்கள். அவர்களுக்குப் பிறகு நாமும் அந்தத் தண்டனையை நடைமுறைப்படுத்தினோம். காலப்போக்கில் மக்களில் சிலர் \"இறைவேதத்தில் கல்லெறி தண்டனை குறித்த வசனத்தை நாங்கள் காணவில்லை\" என்று கூறி, இறைவன் அருளிய விதியொன்றைக் கைவிடுவதன் மூலம் வழிதவறிவிடுவார்களோ என நான் அஞ்சுகிறேன். மணமுடித்த ஆணோ, பெண்ணோ விபச்சாரம் செய்து, அதற்குச் சாட்சி இருந்தாலோ, அல்லது கர்ப்பம் ஏற்பட்டாலோ, அல்லது ஒப்புதல் வாக்குமூலம் அளித்தாலோ அவருக்குக் கல்லெறி தண்டனை உண்டு என்பது இறைச்சட்டத்தில் உள்ளதாகும். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4419,
			"arabicnumber": "1691.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4420,
			"arabicnumber": "1691.03",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பள்ளிவாசலில் இருந்தபோது முஸ்லிம்களில் ஒருவர் வந்து அவர்களை அழைத்து, \"அல்லாஹ்வின் தூதரே! நான் விபச்சாரம் செய்துவிட்டேன்\" என்று சொன்னார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது முகத்தை (வேறு பக்கம்) திருப்பிக்கொண்டார்கள். உடனே அவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் முகத்துக்கு நேராக வந்து, \"அல்லாஹ்வின் தூதரே! நான் விபச்சாரம் செய்துவிட்டேன்\" என்று கூறினார். அப்போதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முகத்தை (வேறு பக்கம்) திருப்பிக் கொண்டார்கள். அவர் திரும்பத் திரும்ப அதையே நான்கு தடவை சொல்லித் தமக்கெதிராகத் தாமே ஒப்புதல் வாக்குமூலம் அளித்தபோது, அவரை அழைத்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உமக்குப் பைத்தியமா?\" என்று கேட்டார்கள். அவர், \"(எனக்குப் பைத்தியம்) இல்லை\" என்று சொன்னார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உமக்குத் திருமணமாகிவிட்டதா?\" என்று கேட்டார்கள். அவர், \"ஆம் (திருமணமாகிவிட்டது)\" என்று சொன்னார். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவரைக் கொண்டுசென்று கல்லெறி தண்டனை நிறைவேற்றுங்கள்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. இதன் அறிவிப்பாளர்களில் ஒருவரான இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள், \"அவருக்குக் கல்லெறி தண்டனை வழங்கியவர்களில் நானும் ஒருவனாயிருந்தேன். அப்போது அவரை (பொது மைய வாடியிலுள்ள) தொழுகைத் திடலில் வைத்து நாங்கள் கல்லெறிந்தோம். கற்கள் அவர்மீது விழுந்தபோது, (வலி தாங்க முடியாமல்) அவர் வெருண்டோட ஆரம்பித்தார். அவரை நாங்கள் (விரட்டிச் சென்று பாறைகள் நிறைந்த) \"அல்ஹர்ரா\"ப் பகுதியில் பிடித்து அவருக்குக் கல்லெறி தண்டனை நிறைவேற்றினோம்\" என்று கூறினார்கள் என அவர்களிடம் செவியுற்ற ஒருவர் என்னிடம் தெரிவித்தார். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதிலும் இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் அறிவித்துள்ள குறிப்பு இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4421,
			"arabicnumber": "1691.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4422,
			"arabicnumber": "1691.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4423,
			"arabicnumber": "1691.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4424,
			"arabicnumber": "1692.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4425,
			"arabicnumber": "1692.02",
			"text": "ஜாபிர் பின் சமுரா (ரலி) அவர்கள் கூறியதாவது: மாஇஸ் பின் மாலிக் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம் கொண்டுவரப்பட்ட போது அவர்களை நான் பார்த்தேன். அவர் உயரம் குறைந்த மனிதராகவும் கட்டுடல் கொண்டவராகவும் இருந்தார். அவரது உடலில் மேல்துண்டு இருக்கவில்லை. அவர், தாம் விபச்சாரம் செய்துவிட்டதாகத் தமக்கெதிராகத் தாமே நான்கு முறை சாட்சியம் (ஒப்புதல் வாக்குமூலம்) அளித்தார். அப்போது நபி (ஸல்) அவர்கள், \"நீர் இப்படிச் செய்திருக்கலாம் (முத்தமிட்டிருக்கலாம், அணைத்திருக்கலாம்)\" என்று கூறினார்கள். மாஇஸ் (ரலி) அவர்கள், \"இல்லை; அல்லாஹ்வின் மீதாணையாக! இந்த அற்பன் விபச்சாரம் செய்துவிட்டான்\" என்று கூறினார். ஆகவே, அவருக்குக் கல்லெறி தண்டனை வழங்குமாறு நபி (ஸல்) அவர்கள் கட்டளையிட்டார்கள். பிறகு நபி (ஸல்) அவர்கள் (எங்களிடையே) உரையாற்றுகையில், \"அறிந்துகொள்ளுங்கள். நாம் அல்லாஹ்வின் பாதையில் (அறப்போருக்கு) புறப்படும்போதெல்லாம் மக்களில் சிலர் ஊரிலேயே தங்கிவிடுகின்றனர். அவர்கள் மலை ஆடு (புணரும்போது) சப்தமிடுவதைப் போன்று சப்தமிட்டுக்கொண்டு, (பால் போன்ற) குறைவான பொருளை(ப் பெண்களுக்குக் கெட்ட எண்ணத்துடன்) வழங்குகிறார்கள். அறிந்துகொள்ளுங்கள். அல்லாஹ்வின் மீதாணையாக! அவர்களில் ஒருவர் என்னிடம் அகப்பட்டால் மற்றவர்களுக்குப் பாடமாக அமையும் விதத்தில் (மிகக் கடுமையாக) அவரைத் தண்டிப்பேன்\" என்று கூறினார்கள். அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4426,
			"arabicnumber": "1692.03",
			"text": "ஜாபிர் பின் சமுரா (ரலி) அவர்கள் கூறியதாவது: விபச்சாரம் செய்துவிட்ட ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுவரப்பட்டார். அவர் உயரம் குறைந்தவராகவும் தலைவிரி கோலத்துடனும் கட்டுடலுடனும் காணப்பட்டார். அவரை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரண்டு முறை திருப்பி அனுப்பினார்கள். பிறகு அவருக்குக் கல்லெறி தண்டனை நிறைவேற்றுமாறு உத்தரவிட்டார்கள். அவ்வாறே அவருக்குக் கல்லெறி தண்டனை நிறைவேற்றப்பட்டது. பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நாம் அல்லாஹ்வின் பாதையில் (அறப் போருக்குப்) புறப்படும்போதெல்லாம் உங்களில் சிலர் ஊரிலேயே தங்கிவிடுகின்றனர். அவர்கள் மலை ஆடு (புணரும்போது) சப்தமிடுவதைப் போன்று சப்தமிட்டுக்கொண்டு, (பால் போன்ற) குறைவான பொருளைப் பெண்களில் சிலருக்கு(க் கெட்ட எண்ணத்தோடு) வழங்குகிறார்கள். அவர்களில் யாரையேனும் அல்லாஹ் என்னிடம் அகப்படச் செய்தால் \"அவரை நான் பிறருக்குப் பாடமாக ஆக்கிவிடுவேன்\" அல்லது \"அவரை மற்றவர்களுக்குப் அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4427,
			"arabicnumber": "1693",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மாஇஸ் பின் மாலிக் (ரலி) அவர்களிடம் \"உம்மைப் பற்றி எனக்குக் கிடைத்த செய்தி உண்மையா?\" என்று கேட்டார்கள். மாஇஸ் (ரலி) அவர்கள், \"என்னைப் பற்றி தங்களுக்கு என்ன செய்தி கிட்டியது?\" என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், \"நீர் இன்ன குடும்பத்து இளம் பெண்ணுடன் தவறான உறவு கொண்டுவிட்டதாக எனக்குச் செய்தி எட்டியது\" என்றார்கள். அதற்கு மாஇஸ் (ரலி) அவர்கள், \"ஆம்\" என்று கூறி, தமக்கெதிராக நான்கு முறை சாட்சியம் (கூறி ஒப்புதல் வாக்குமூலம்) அளித்தார்கள். பின்னர் (அவரைக் கொண்டுசென்று கல்லெறி தண்டனை நிறைவேற்றுமாறு) நபி (ஸல்) அவர்கள் கட்டளையிட, அவ்வாறே அவருக்குக் கல்லெறி தண்டனை நிறைவேற்றப்பட்டது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4428,
			"arabicnumber": "1694.01",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: மாஇஸ் பின் மாலிக் எனப்படும் அஸ்லம் குலத்தைச் சேர்ந்த ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"நான் மானக்கேடான ஒரு செயலைச் செய்துவிட்டேன். ஆகவே, எனக்குத் தண்டனையை நிலைநாட்டுங்கள்\"என்று கூறினார். அவரை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பலமுறை திருப்பி அனுப்பினார்கள். பிறகு அவருடைய குலத்தாரிடம் விசாரித்தார்கள். அதற்கு அம்மக்கள், \"அவரைப் பற்றித் தவறாக எதையும் நாங்கள் அறியவில்லை. ஆயினும், அவர் ஒரு செயலைச் செய்துவிட்டு, \"தம்மீது தண்டனை நிறைவேற்றப்பட்டால் தவிர அக்குற்றத்திலிருந்து தம்மால் வெளியேற முடியாது\" என்று கருதுகிறார்\" என்று கூறினர். பிறகு மாஇஸ் (ரலி) அவர்கள் மீண்டும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தார். அப்போது அவருக்குக் கல்லெறி தண்டனையை நிறைவேற்றுமாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு உத்தரவிட்டார்கள். ஆகவே, நாங்கள் அவரை \"பகீஉல் ஃகர்கத்\" பொது மையவாடிக்கு அழைத்துச் சென்றோம். (கல்லெறியும்போது தப்பி ஓடாமலிருப்பதற்காக) அவரை நாங்கள் கட்டி வைக்கவுமில்லை. (அவரை நிறுத்துவதற்காக) நாங்கள் குழியும் தோண்டவில்லை. அவரை எலும்பு, மண் கட்டி, சுட்ட செங்கல் ஆகியவற்றால் அடித்தோம். அடி தாங்க முடியாமல் அவர் ஓடினார். அவருக்குப் பின்னால் நாங்களும் ஓடினோம். இறுதியில் அவர் (பாறைகள் நிறைந்த) \"அல்ஹர்ரா\"ப் பகுதியின் முனைக்குச் சென்று எங்களுக்காக நிமிர்ந்து நின்றார். நாங்கள் அவர்மீது \"ஹர்ரா\"வின் பெருங்கற்களை எறிந்தோம். அவர் அமைதியாகிவிட்டார். பின்னர் அன்று மாலை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எங்களிடையே) நின்று உரையாற்றினார்கள். அப்போது, \"அல்லாஹ்வின் பாதையில் அறப்போருக்காக நாம் புறப்படும்போதெல்லாம் சிலர் (போருக்குச் செல்லாமல்) நம்முடைய குடும்பத்தாரிடையே தங்கிவிடுகின்றனர். அவர்கள் மலை ஆடு (புணரும்போது) சப்தமிடுவதைப் போன்று சப்தமிட்டுக்கொண்டு இருந்துவிடுகிறார்கள். இத்தகைய (இழி)செயலை செய்யும் மனிதர் எவரேனும் என்னிடம் கொண்டுவரப்பட்டால் அவருக்குத் தக்க தண்டனை வழங்குவது என்மீது கடமையாகும்\" என்று கூறினார்கள். (அன்றைய நாளில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மாஇஸ் (ரலி) அவர்களுக்காகப் பாவமன்னிப்புக் கோரவுமில்லை; (தண்டனையை நிறைவேற்றிய பின் அவரை) இழித்துப் பேசவுமில்லை. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4429,
			"arabicnumber": "1694.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4430,
			"arabicnumber": "1694.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4431,
			"arabicnumber": "1695.01",
			"text": "புரைதா பின் அல்ஹசீப் (ரலி) அவர்கள் கூறியதாவது: மாஇஸ் பின் மாலிக் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! (விபச்சாரக் குற்றத்திற்குரிய தண்டனையை நிறைவேற்றி) என்னைத் தூய்மைப் படுத்துங்கள்\" என்று கூறினார்கள். நபி (ஸல்) அவர்கள், \"உமக்குக் கேடுதான்! நீர் திரும்பிச் சென்று அல்லாஹ்விடம் பாவமன்னிப்புக் கோரி அவனிடம் மீளுவாயாக\" என்று கூறினார்கள். அவ்வாறே மாஇஸ் (ரலி) அவர்கள் திரும்பிச் சென்றுவிட்டு, அதிக நாள் தாமதிக்காமல் திரும்பிவந்து, \"அல்லாஹ்வின் தூதரே! என்னைத் தூய்மைப்படுத்துங்கள்\" என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், \"உமக்குக் கேடுதான். நீர் திரும்பிச் சென்று அல்லாஹ்விடம் பாவமன்னிப்புக் கோரி மீளுவீராக\" என்று கூறினார்கள். மாஇஸ் (ரலி) அவர்கள் மறுபடியும் திரும்பிச் சென்றுவிட்டு அதிக நாள் தாமதிக்காமல் திரும்பிவந்து, \"அல்லாஹ்வின் தூதரே! என்னைத் தூய்மைப்படுத்துங்கள்\" என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள் முன்பு போன்றே பதிலுரைத்தார்கள். நான்காவது முறை அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"எதிலிருந்து உம்மைத் தூய்மைப்படுத்த வேண்டும்?\" என்று கேட்டார்கள். அவர், \"விபச்சாரக் குற்றத்திலிருந்து” என்று விடையளித்தார். அப்போது அவர்கள், \"இவருக்குப் பைத்தியம் பிடித்துள்ளதா?\" என்று கேட்டார்கள். அவர் பைத்தியக்காரர் அல்லர் எனத் தெரிவிக்கப்பட்டது. நபி (ஸல்) அவர்கள், \"இவர் மது அருந்தியுள்ளாரா?\" என்று கேட்டார்கள். உடனே ஒரு மனிதர் எழுந்து, அவரது வாயை (ஊதச் சொல்லி) முகர்ந்து பார்த்தார். மதுவின் வாடை வரவில்லை. அப்போது நபி (ஸல்) அவர்கள், \"நீர் விபச்சாரம் செய்தீரா?\" என்று கேட்டார்கள். அவர் \"ஆம்” என்று (வாக்குமூலம்) கூறினார். அவரைக் கொண்டுசென்று கல்லெறி தண்டனை நிறைவேற்றுமாறு உத்தரவிட்டார்கள். அவ்வாறே அவருக்குக் கல்லெறி தண்டனை நிறைவேற்றப்பட்டது. அவர் தொடர்பாக மக்க(ளிடையே கருத்து வேறுபாடு தோன்றி அவர்க)ள் இரு பிரிவினராக ஆயினர். சிலர், \"அவர் அழிந்தார். அவரை அவருடைய குற்றம் சுற்றிவளைத்துக் கொண்டுவிட்டது\" என்று கூறினர். வேறு சிலர், \"மாஇஸின் பாவமன்னிப்பை விஞ்சிய பாவ மன்னிப்பு இல்லை. அவர் நபி (ஸல்) அவர்களிடம் வந்து தமது கையை நபியின் கையில் வைத்து, \"என்னைக் கல்லால் அடித்துக்கொல்லுங்கள்\" என்று கூறினார்\" என்றனர். இவ்வாறே இரண்டு அல்லது மூன்று நாட்கள் நகர்ந்தன. பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அமர்ந்திருந்தபோது மக்கள் வந்து, சலாம் சொல்லிவிட்டு அமர்ந்தார்கள். அப்போது நபி (ஸல்) அவர்கள் (மக்களிடம்) \"மாஇஸ் பின் மாலிக்குக்காக நீங்கள் பாவமன்னிப்புக் கோருங்கள்\" என்று கூறினார்கள். மக்கள், \"அல்லாஹ், மாஇஸ் பின் மாலிக்கின் பிழையைப் பொறுப்பானாக!\" என்று வேண்டினர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவர் அழகிய முறையில் பாவமன்னிப்புக் கோரினார். அது ஒரு சமுதாயத்துக்கே பங்கிடப்பட்டாலும் அவர்கள் அனைவருக்கும் அது போதுமானதாகும்\" என்று கூறினார்கள். பிறகு \"அஸ்த்” குலத்தின் ஒரு கிளையான \"ஃகாமித்” கோத்திரத்தைச் சேர்ந்த ஒரு பெண்மணி வந்து, \"அல்லாஹ்வின் தூதரே! என்னைத் தூய்மைப்படுத்துங்கள்\" என்று கூறினார். நபி (ஸல்) அவர்கள், \"உனக்குக் கேடுதான்! நீ திரும்பிச் சென்று அல்லாஹ்விடம் பாவமன்னிப்புக் கோரி மீளுவாயாக\" என்று கூறினார்கள். அதற்கு அப்பெண், \"மாஇஸ் பின் மாலிக்கைத் திருப்பி அனுப்பியதைப் போன்று என்னையும் திருப்பி அனுப்பப் பார்க்கிறீர்கள் என்றே நான் கருதுகிறேன்\" என்று கூறினார். நபி (ஸல்) அவர்கள் \"என்ன அது?\" என்று கேட்டார்கள். அப்பெண், \"நான் விபச்சாரத்தால் கர்ப்பமுற்றவள்\" என்றார். நபி (ஸல்) அவர்கள், \"நீயா (அது)?\" என்று கேட்டார்கள். அப்பெண் \"ஆம்\" என்றார். நபி (ஸல்) அவர்கள், \"உமது வயிற்றிலுள்ள மகவைப் பெற்றெடுக்கும்வரை (பொறுமையாக இரு; பிறகு வா!)\" என்றார்கள். பிரசவிக்கும்வரை அவளைப் பராமரிக்கும் பொறுப்பை அன்சாரிகளில் ஒருவர் ஏற்றுக்கொண்டார். பிறகு அவர் நபி (ஸல்) அவர்களிடம் வந்து, \"ஃகாமிதிய்யா குலத்தாளுக்குக் குழந்தை பிறந்துவிட்டது\" என்று கூறினார். நபி (ஸல்) அவர்கள், \"நாம் இப்போது அவளுக்குக் கல்லெறி தண்டனை நிறைவேற்றப்போவதில்லை. பாலூட்டும் அன்னையின்றி நிற்கும் சிறு வயதுக் குழந்தையாக அவளது பிள்ளையை விட்டுவிடவும் நாம் விரும்பவில்லை\" என்று கூறினார்கள். அப்போது அன்சாரிகளில் ஒருவர் எழுந்து, \"அவனுக்குப் பாலூட்டும் பொறுப்பு என்னைச் சேர்ந்தது, அல்லாஹ்வின் தூதரே!\" என்றார். பின்னர் அந்தப் பெண்ணுக்குக் கல்லெறி தண்டனை நிறைவேற்றுமாறு நபி (ஸல்) அவர்கள் உத்தரவிட்டார்கள். அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4432,
			"arabicnumber": "1695.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4433,
			"arabicnumber": "1696.01",
			"text": "இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள் கூறியதாவது: விபச்சாரத்தால் கர்ப்பமுற்றிருந்த ஜுஹைனா குலத்தைச் சேர்ந்த ஒரு பெண் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! தண்டனைக்குரிய ஒரு குற்றத்தை நான் செய்துவிட்டேன். என்மீது தண்டனையை நிலைநாட்டுங்கள்\" என்று கூறினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அப்பெண்ணின் காப்பாளரை அழைத்துவரச் செய்து, \"இவளை நல்ல முறையில் கவனித்துவாருங்கள். குழந்தை பிறந்ததும் இவளை என்னிடம் அழைத்து வாருங்கள்\" என்று கூறினார்கள். காப்பாளர் அவ்வாறே செய்தார். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உத்தரவிட அவள்மீது அவளுடைய துணிகள் சுற்றப்பட்டன. பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உத்தரவிட அவளுக்குக் கல்லெறி தண்டனை நிறைவேற்றப்பட்டது. பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவளுக்காக இறுதித் தொழுகை நடத்தினார்கள். அப்போது உமர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! இவளுக்காகத் தாங்கள் தொழவைக்கிறீர்களா? இவள் விபச்சாரம் புரிந்தவள் ஆயிற்றே?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவள் அழகிய முறையில் மன்னிப்புத் தேடிவிட்டாள். மதீனாவாசிகளில் எழுபது பேரிடையே அது பங்கிடப்பட்டாலும் அவர்கள் அனைவருக்கும் போதுமானதாக அமையும். உயர்ந்தோன் அல்லாஹ்வுக்காகத் தன் உயிரையே அர்ப்பணித்த இப்பெண்ணின் பாவமன்னிப்பைவிடச் சிறந்ததை நீர் கண்டுள்ளீரா?\" என்று கேட்டார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4434,
			"arabicnumber": "1696.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4437,
			"arabicnumber": "1699.01",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: விபச்சாரம் புரிந்துவிட்ட ஒரு யூத ஆணும் யூதப் பெண்ணும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுவரப்பட்டனர். யூதர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்து \"விபச்சாரம் செய்துவிட்டவனுக்கு (அளிக்கப்படும் தண்டனை குறித்து) நீங்கள் (உங்களுடைய) \"தவ்ராத்” (வேதத்)தில் என்ன காண்கிறீர்கள்?\" என்று கேட்டார்கள். அதற்கு யூதர்கள், \"அவர்கள் இருவர் முகத்திலும் கரி பூசி, அவர்களிருவரையும் ஒட்டகத்தில் ஏற்றி, முகம் திருப்பி அமரவைப்போம். பின்னர் அவ்விருவரும் (ஊரைச்) சுற்றிக் கொண்டு வரப்படுவர்\" என்றார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீங்கள் உண்மையாளர்களாயின் ‘தவ்ராத்\"தைக் கொண்டுவாருங்கள்\" என்று சொன்னார்கள். அவ்வாறே அவர்கள் ‘தவ்ராத்\"தைக் கொண்டுவந்து வாசித்துக்காட்டினர். கல்லெறி தண்டனை குறித்த வசனம் வந்தபோது, அதை வாசித்துக் கொண்டிருந்த (யூத) இளைஞர் அந்த வசனத்தின் மீது தமது கையை வைத்து (மறைத்து)க் கொண்டு, அதற்கு முன்பும் பின்பும் உள்ள வசனங்களை வாசித்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் (யூதமத அறிஞராயிருந்து இஸ்லாத்தை ஏற்றிருந்த) அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்களும் இருந்தார்கள். அவர்கள், (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம்), \"அவரைக் கையை எடுக்கச் சொல்லுங்கள்\" என்று கூறினார்கள். உடனே அந்த இளைஞர் தமது கையை எடுத்தார். அங்கே (விபச்சாரக் குற்றத்திற்கு) கல்லெறி தண்டனை நிறைவேற்றும்படி கூறும் வசனம் இருந்தது. ஆகவே,அவ்விருவரையும் சாகும்வரை கல்லால் அடிக்கும்படி அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உத்தர விட்டார்கள். அவ்வாறே அவ்விருவருக்கும் கல்லெறி தண்டனை வழங்கப்பட்டது. அவர்கள்மீது கல்லெறிந்தவர்களில் நானும் ஒருவனாயிருந்தேன். அந்தப் பெண்ணைக் கல்லடியிலிருந்து காப்பதற்காக அந்த யூதர் தமது உடலால் அவளை மறைத்துக் கொண்டிருந்ததை நான் பார்த்தேன். அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4438,
			"arabicnumber": "1699.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4439,
			"arabicnumber": "1699.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4440,
			"arabicnumber": "1700.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4441,
			"arabicnumber": "1700.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4442,
			"arabicnumber": "1701.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4443,
			"arabicnumber": "1701.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4444,
			"arabicnumber": "1702",
			"text": "அபூஇஸ்ஹாக் சுலைமான் அஷ் ஷைபானீ (ரஹ்) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் அபீஅவ்ஃபா (ரலி) அவர்களிடம், \"(சாகும்வரை) கல்லால் அடிக்கும் தண்டனையை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நிறைவேற்றினார்களா?\" என்று கேட்டேன். அவர்கள், \"ஆம் (நிறைவேற்றினார்கள்)” என்று பதிலளித்தார்கள். நான், குர்ஆனில் ‘அந்நூர்\" எனும் (24 ஆவது) அத்தியாயம் அருளப்பெறுவதற்கு முன்பா? அல்லது அதற்குப் பின்பா (எப்போது அந்தத் தண்டனையை நிறைவேற்றினார்கள்)?\" என்று கேட்டேன். அவர்கள் \"எனக்குத் தெரியாது\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4445,
			"arabicnumber": "1703.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4446,
			"arabicnumber": "1703.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4447,
			"arabicnumber": "1703.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4448,
			"arabicnumber": "1704.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4449,
			"arabicnumber": "1704.02",
			"text": "மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) மற்றும் ஸைத் பின் காலித் அல்ஜுஹனீ (ரலி) ஆகியோரிடமிருந்து மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"ஓர் அடிமைப் பெண் விபச்சாரம் செய்துவிட்டால் (அவளுக்கு என்ன தண்டனை வழங்க வேண்டும்)? என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கேட்கப்பட்டது\" என ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அவற்றில் \"ளஃபீர்\" என்பதற்கு ‘கயிறு\" என்பது பொருள் என இப்னு ஷிஹாப் (ரஹ்) அவர்கள் கூறிய சொற்பொருள் இடம்பெறவில்லை. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) மற்றும் ஸைத் பின் காலித் அல்ஜுஹனீ (ரலி) ஆகியோர் வழியாக (தலா இரு அறிவிப்பாளர்தொடர்களில்) நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. இந்த அறிவிப்புகளிலும் \"அவளை விற்றுவிட வேண்டும் என்பது, மூன்றாவது தடவைக்குப் பிறகா, அல்லது நான்காவது தடவைக்குப் பிறகா\" என்பதில் ஐயப்பாடு எழுப்பப்பட்டுள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4450,
			"arabicnumber": "1705.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4451,
			"arabicnumber": "1705.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4452,
			"arabicnumber": "1706.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4453,
			"arabicnumber": "1706.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4454,
			"arabicnumber": "1706.03",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: மது அருந்திய குற்றத்திற்குத் தண்டனையாக பேரீச்ச மட்டையாலும் காலணியாலும் அடிக்கும்படி நபி (ஸல்) அவர்கள் உத்தரவிட்டார்கள். அபூபக்ர் (ரலி) அவர்கள் (தமது ஆட்சிக்காலத்தில்) நாற்பது சாட்டையடிகள் கொடு(க்குமாறு உத்தரவு பிறப்பி)த்தார்கள். உமர் (ரலி) அவர்கள் ஆட்சிக்கு வந்த வேளையில், (சிரியா, இராக் போன்ற பகுதிகள் வெற்றி கொள்ளப்பட்டு) மக்கள் கிராமப்புறங்களிலும் செழிப்பான பகுதிகளிலும் குடியேறியபோது (வாழ்க்கை வசதிகள் பெருகி,குடிப்பழக்கம் அதிகரித்தது. அப்போது), \"மது அருந்திய குற்றத்திற்கான தண்டனை விஷயத்தில் நீங்கள் என்ன கருதுகிறீர்கள்?\" என்று மக்களிடம் கேட்டார்கள். அப்போது அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள், \"(குர்ஆனில் கூறப்பட்ட) குற்றவியல் தண்டனைகளிலேயே மிகவும் குறைந்தபட்ச தண்டனையை (எண்பது கசை யடி) அதற்குரிய தண்டனையாக நீங்கள் ஆக்க வேண்டுமென நான் கருதுகிறேன்\" என்றார்கள். இதன்படி உமர் (ரலி) அவர்கள் எண்பது சாட்டையடிகள் வழங்கினார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4455,
			"arabicnumber": "1706.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4456,
			"arabicnumber": "1706.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4457,
			"arabicnumber": "1707.01",
			"text": "அபூசாசான் ஹுளைன் பின் அல்முன்திர் (ரஹ்) அவர்கள் கூறியதாவது: நான் (கலீஃபா) உஸ்மான் பின் அஃப்பான் (ரலி) அவர்களிடம் இருந்தேன். அப்போது வலீத் பின் உக்பா (ரலி) அவர்கள் (அங்கு) கொண்டுவரப்பட்டார். அவர் சுப்ஹுத் தொழுகை இரண்டு ரக்அத் தொழுவித்துவிட்டு, \"உங்களுக்கு நான் இத்தொழுகையைக் கூடுதலாக்கப் போகிறேன்\" என்று கூறியிருந்தார். அப்போது அவருக்கெதிராக இருவர் சாட்சியமளித்தனர். அவர்களில் ஒருவரான ஹும்ரான் பின் அபான், \"அவர் (வலீத்) மது அருந்தியிருந்தார்\" என்று சாட்சியம் அளித்தார். மற்றொருவர் வலீத் வாந்தியெடுத்ததைத் தாம் கண்டதாகச் சாட்சியமளித்தார். உஸ்மான் (ரலி) அவர்கள், \"அவர் மது அருந்தியதாலேயே வாந்தியெடுத்தார்\" என்று கூறிவிட்டு, \"அலீயே! நீங்கள் எழுந்து அவருக்கு (மது அருந்திய குற்றத்திற்காக)ச் சாட்டையடி வழங்குங்கள்\" என்று கூறினார்கள். உடனே அலீ (ரலி) அவர்கள் (தம் புதல்வரிடம்) \"ஹசனே! நீர் எழுந்து அவருக்குச் சாட்டையடி வழங்கு\" என்று கூறினார்கள். அதற்கு ஹசன் (ரலி) அவர்கள், (உஸ்மான் (ரலி) அவர்கள்மீது கோபம் கொண்டவரைப் போன்று) \"ஆட்சியின் குளிர்ச்சிக்குப் பொறுப்பேற்றவர்களையே அதன் வெப்பத்துக்கும் பொறுப்பேற்கச் செய்யுங்கள்\" என்று கூறிவிட்டார்கள். உடனே அலீ (ரலி) அவர்கள் (தம் சகோதரரின் புதல்வரிடம்) \"அப்துல்லாஹ் பின் ஜஅஃபரே! நீர் எழுந்து அவருக்குச் சாட்டையடி வழங்குவீராக\" என்று சொன்னார்கள். அவ்வாறே அப்துல்லாஹ் பின் ஜஅஃபர் அவர்கள், வலீதுக்குச் சாட்டையடி வழங்கினார்கள். அப்போது அலீ (ரலி) அவர்கள் (அப்துல்லாஹ் எத்தனை முறை அடிக்கிறார் என்பதை) எண்ணிக்கொண்டிருந்தார்கள். நாற்பது அடியானதும் \"போதும் நிறுத்து\" என்றார்கள். பிறகு, \"(மது அருந்திய குற்றத்திற்குத் தண்டனையாக) நபி (ஸல்) அவர்கள் நாற்பது சாட்டையடிகள் வழங்கினார்கள். அபூபக்ர் (ரலி) அவர்களும் (தமது ஆட்சிக் காலத்தில்) நாற்பது சாட்டையடிகள் வழங்கினார்கள். உமர் (ரலி) அவர்கள் (தமது ஆட்சிக் காலத்தில்) எண்பது சாட்டையடிகள் வழங்கினார்கள். எல்லாம் (பின்பற்றத் தகுந்த) வழிமுறைகளே. ஆயினும், இ(றைத்தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் வழங்கிய நாற்பது சாட்டையடிகளான)து எனக்கு மிகவும் விருப்பமானதாகும்\" என்று அலீ (ரலி) அவர்கள் கூறினார்கள். மேற்கண்ட ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் அலீ பின் ஹுஜ்ர் (ரஹ்) அவர்களது அறிவிப்பில், \"நான் இந்த ஹதீஸை அப்துல்லாஹ் அத்தானாஜ் (ரஹ்) அவர்களிடமிருந்தே (நேரடியாகக்) கேட்டிருந்தேன். ஆனால், அதை மனனம் செய்ய வில்லை. (பின்னர் இப்னு அபீஅரூபா (ரஹ்) அவர்களிடம் கேட்டே இப்போது அறிவிக்கிறேன்) என இஸ்மாயீல் பின் உலய்யா (ரஹ்) அவர்கள் கூடுதலாகக் கூறினார்கள்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4458,
			"arabicnumber": "1707.02",
			"text": "அலீ பின் அபீதாலிப் (ரலி) அவர்கள் கூறியதாவது: நான் தண்டனை நிறைவேற்றியதால் எவரேனும் இறந்துபோனால் (அதற்காக) நான் கவலை அடையப்போவதில்லை. குடிகாரனைத் தவிர! ஏனெனில், (தண்டனை வழங்கப்பட்டதால்) குடிகாரன் இறந்துபோனால் அவனுக்காக நான் உயிரீட்டுத் தொகை வழங்கிவிடுவேன். இதற்குக் காரணம், (மது அருந்திய குற்றத்திற்குத் தண்டனையாக) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (குறிப்பிட்ட தண்டனை எதையும்) வழிமுறையாக்கவில்லை. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4459,
			"arabicnumber": "1707.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4460,
			"arabicnumber": "1708",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4461,
			"arabicnumber": "1709.01",
			"text": "உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (ஒரு நாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஓர் அவையில் இருந்தோம். அப்போது அவர்கள், \"அல்லாஹ்வுக்கு எதையும் இணை கற்பிப்பதில்லை; விபச்சாரம் செய்வதில்லை; திருடுவதில்லை; கொல்லக் கூடாதென அல்லாஹ் தடை செய்துள்ள எந்த உயிரையும் முறையின்றிக் கொல்வதில்லை\" என்று என்னிடம் உறுதிமொழி அளியுங்கள்\" என்று கூறினார்கள். மேலும், \"இந்த உறுதிமொழியை உங்களில் யார் நிறைவேற்றுகிறாரோ அவருக்குரிய பிரதிபலன் இறைவனிடம் உண்டு. மேற்கூறப்பட்ட (குற்றங்களில்) எதையேனும் ஒருவர் செய்து. அதற்காக அவர் (இவ்வுலகில்) தண்டிக்கப்பட்டுவிட்டால். அது அவருக்குப் பரிகாரமாகிவிடும். மேற்கூறப்பட்டவற்றில் எதையேனும் ஒருவர் செய்து,பின்னர் அல்லாஹ் அதை (யாருக்கும் தெரியாமல்) மறைத்துவிட்டால், அவரது விவகாரம் அல்லாஹ்வின் பொறுப்பில் விடப்படும். அவன் நாடினால் அவரை மன்னிப்பான்; நாடினால் அவரைத் தண்டிப்பான்\" என்று சொன்னார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4462,
			"arabicnumber": "1709.02",
			"text": "மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அவர்கள் அல்லாஹ்வுக்கு எதையும் இணைவைப்பதில்லை...”” எனத்தொடங்கும் பெண்கள் தொடர்பான (60:12ஆவது) இறைவசனத்தை ஓதிக்காட்டினார்கள்\" என்று கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4463,
			"arabicnumber": "1709.03",
			"text": "உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பெண்களிடம் உறுதிமொழி வாங்கியதைப் போன்றே, (ஆண்களாகிய) எங்களிடமும் \"அல்லாஹ்வுக்கு எதையும் இணை கற்பிக்கமாட்டோம்; திருட மாட்டோம்; விபச்சாரம் செய்யமாட்டோம்;எங்கள் குழந்தைகளைக் கொல்லமாட்டோம்; எங்களில் சிலர் வேறுசிலர் மீது அவதூறு கூறமாட்டோம்\" என உறுதிமொழி வாங்கினார்கள். மேலும், \"இந்த உறுதிமொழியை உங்களில் யார் நிறைவேற்றுகின்றாரோ அவருக்குரிய பிரதிபலன் இறைவனிடம் உண்டு. தண்டனைக்குரிய குற்றத்தை உங்களில் எவரேனும் செய்து, அதற்காக அவர் தண்டிக்கப்பட்டால் அது அவருக்குப் பரிகாரமாகிவிடும். யாருடைய குற்றத்தை அல்லாஹ் மறைத்துவிட்டானோ அவர் அல்லாஹ்வின் பொறுப்பில் விடப்படுகிறார். அவன் நாடினால் அவரைத் தண்டிப்பான்; நாடினால் அவரை மன்னிப்பான். அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4464,
			"arabicnumber": "1709.04",
			"text": "உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்கள் கூறியதாவது: \"அல்லாஹ்வுக்கு நாங்கள் எதையும் இணை கற்பிக்கமாட்டோம்; விபச்சாரம் செய்ய மாட்டோம்; திருடமாட்டோம்;கொல்லக்கூடாதென அல்லாஹ் தடைசெய்துள்ள எந்த உயிரையும் முறையின்றி கொலை செய்யமாட்டோம்;கொள்ளையடிக்க மாட்டோம்; (இறைவனுக்கோ இறைத்தூதருக்கோ) மாறுசெய்யமாட்டோம். இவற்றின்படி நாங்கள் செயல்பட்டால் (எங்களுக்கு) சொர்க்கம் உண்டு. இவற்றில் எதையேனும் நாங்கள் செய்து, அதை அல்லாஹ் மூடி மறைத்துவிட்டால், அதைப் பற்றிய தீர்ப்பு அல்லாஹ்விடமே உள்ளது\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் உறுதிமொழி அளித்த தலைவர்களில் நானும் ஒருவன் ஆவேன். அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4465,
			"arabicnumber": "1710.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4466,
			"arabicnumber": "1710.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4467,
			"arabicnumber": "1710.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4468,
			"arabicnumber": "1710.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4469,
			"arabicnumber": "1710.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 72
			}
		}
	]
}