{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"31": "The Book of Lost Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4498,
			"arabicnumber": "1722.01",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4499,
			"arabicnumber": "1722.02",
			"text": "ஸைத் பின் காலித் அல்ஜுஹனீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு மனிதர் கண்டெடுக்கப்பட்ட பொருளைப் பற்றி கேட்டார். நபி (ஸல்) அவர்கள் “ஓராண்டுக் காலத்திற்கு அதைப் பற்றி அறிவிப்புச் செய்துகொண்டேயிரு.. அதன் முடிச்சையும் (மூடியையும்) பையையும் (உறையையும்) அடையாளம் பார்த்து வைத்துக்கொள். அதன் உரிமையாளர் வந்தால் அவரிடம் ஒப்படைத்துவிடு.. (வராவிட்டால்) நீயே செலவழித்துக்கொள்” என்று கூறினார்கள். அந்த மனிதர், “அல்லாஹ்வின் தூதரே! வுழிதவறி வந்த ஆட்டை என்ன செய்வது?” என்று கேட்டார். “அதை நீ பிடித்துக்கொள். ஏனெனில், அது உனக்குரியது அல்லது உன் சகோதரனுக்குரியது அல்லது ஓநாய்க்குரியது” என்று சொன்னார்கள். அந்த மனிதர், “அல்லாஹ்வின் தூதரே! வுழிதவறி வந்த ஒட்டகத்தை என்ன செய்வது?” என்று கேட்டார். இதை கேட்டதும் அல்லாஹ்வின் தூதர் அவர்கள் கோபப்பட்டார்கள். எந்த அளவுக்கென்றால், அவர்களின் ‘இரு கன்னங்களும்’ அல்லது ‘அவர்களது முகம்’ சிவந்து விட்டது. பிறகு ‘உனக்கும் அதற்கும் என்ன தொடர்பு? (நடப்பதற்கு) அதனுடன் கால்குளம்பும் (குடிப்பதற்கு) அதனுடன் தண்ணீர் பையும் (திமிலும்) உள்ளது. அதை அதன் உரிமையாளர் சந்திக்கும்வரை (சுயமாக அது வாழ்ந்துகொள்கிறது)’ என்று சொன்னார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 31",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4500,
			"arabicnumber": "1722.03",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4501,
			"arabicnumber": "1722.04",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4502,
			"arabicnumber": "1722.05",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4503,
			"arabicnumber": "1722.06",
			"text": "மேற்கண்ட ஹதீஸ் ஸைத் பின காலித் அல்ஜுஹனீ (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ‘ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் வழிதவறி வந்த ஒட்டகத்தை பற்றிக் கேட்டார்’ என்று ஹதீஸ் ஆரம்பமாகிறது. அவற்றில் ரபீஆ பின் அபீஅப்திர் ரஹ்மான் அர்ரஃயு (ரஹ்) அவர்களது அறிவிப்பில் ‘இதைக் கேட்டதும் நபி(ஸல்) அவர்கள் தம் கன்னங்கள் சிவக்குமளவுக்குக் கோபப்பட்டார்கள்’ என்று கூடுதலாக இடம்பெற்றுள்ளது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸ்களில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. மேலும், ‘அதன் உரிமையாளர் (அதை தேடிக்கொண்டு) வந்து, (நீ அதன் அடையாளத்தைப் பற்றி கேட்கும்போது) அவர் அதன் பையையும் எண்ணிக்கையையும் முடிச்சையும் (சரியாக) அறிந்திருந்தால் அவரிடம் அதைக் கொடுத்துவிடு. இல்லையேல், அது உனக்கே உரியது’ என்று கூறினார்கள் எனக் கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 31",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4506,
			"arabicnumber": "1723.01",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4507,
			"arabicnumber": "1723.02",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4508,
			"arabicnumber": "1723.03",
			"text": "மேற்கண்ட ஹதீஸ் மேலும் ஐந்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் அனைவருடைய அறிவிப்பிலும் ‘மூன்று ஆண்டுக் காலத்திற்கு அறிவிப்புச் செய்(ய வேண்டும்)’ என இடம்பெறறுள்ளது. ஹம்மாத் பின் சலமா (ரஹ்) அவர்களது அறிவிப்பில் மட்டும் ‘இரண்டு ஆண்டுக் காலத்திற்கு அல்லது மூன்று ஆண்டுக் காலத்திற்கு அறிவிப்புச் செய்ய வேண்டும்’ என்று (ஐயப்பாட்டுடன்) இடம் பெற்றுள்ளது. சுஃப்யான் பின் சயீத் (ரஹ்), ஸைத் பின் அபீஉனைசா (ரஹ்), ஹம்மாத் பின் சலமா (ரஹ்) ஆகியோரின் அறிவிப்புகளில், ‘பின்னர் யாரேனும் ஒருவர் (கண்டெடுக்கப்பட்ட) அப்பொருனின் எண்ணிக்கையையும் பையையும் அதன் முடிச்சையும் தெரிவித்து (உன்னிடம்) வந்தால் அதை அவரிடம் கொடுத்துவிட’ என்று இடம்பெற்றுள்ளது. சுஃப்யான் பின் சயீத் (ரஹ்) அவர்களிடமிருந்து வகீஉ (ரஹ்) அவர்கள் அறிவிக்கும் அறிவிப்பில் அறிவிக்கும் அறிவிப்பில் ‘(அறிவிப்புச் செய்தும் யாரும் வராவிட்டால்) அது உனது செல்வத்தின் வகையைப் போன்றதாகும்’ என்று இடம்பெற்றுள்ளது. சுஃப்யானிடமிருந்து முஹம்மத் பின் அப்தில்லாஹ் பின் நுமைர் (ரஹ்) அவர்கள் அறிவிக்கும் அறிவிப்பில் ‘இல்லையென்றால், அதை நீ பயன்படுத்திக்கொள்’ எனும் வாசகம் இடம்பெற்றுள்ளது. அத்தியாயம் : 31",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4509,
			"arabicnumber": "1724",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4510,
			"arabicnumber": "1725",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4511,
			"arabicnumber": "1726.01",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4512,
			"arabicnumber": "1726.02",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4513,
			"arabicnumber": "48.02",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4514,
			"arabicnumber": "48.03",
			"text": "அபூஷுரைஹ் அல்குஸாயீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"விருந்துபசாரம் மூன்று தினங்களாகும். ஒரு பகல் ஓர் இரவு (விருந்துபசாரம்) அவருடைய கொடையாகும். ஒரு முஸ்லிமான மனிதர், தம் சகோதரரிடம் அவரைப் பாவத்தில் தள்ளும் அளவுக்குத் தங்கியிருப்பதற்கு அனுமதி இல்லை\" என்று கூறினார்கள். மக்கள், \"அவரைப் பாவத்தில் தள்ளுதல் எப்படி, அல்லாஹ்வின் தூதரே?\" என்று கேட்டார்கள். அதற்கு அவர்கள், \"அவ(ர் தம் சகோதர)ரிடம் தங்கி இருப்பார். ஆனால், விருந்துபசாரம் செய்யுமளவுக்கு அவரிடம் எதுவுமே இருக்காது\" என்று கூறினார்கள். அத்தியாயம் : 31",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4515,
			"arabicnumber": "48.04",
			"text": "மேற்கண்ட ஹதீஸ் அபூஷுரைஹ் அல்குஸாயீ (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பேசியபோது என் காதுகளால் கேட்டேன். என் கண்ணால் பார்த்தேன்;எனது உள்ளம் மனனமிட்டது\" என்று ஹதீஸ் ஆரம்பமாகிறது. அதில், \"உங்களில் ஒருவர் தம் சகோதரரைப் பாவத்தில் தள்ளும் அளவுக்குத் தங்கியிருப்பதற்கு அனுமதி இல்லை\" என்று மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்று இடம் பெற்றுள்ளது. அத்தியாயம் : 31",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4516,
			"arabicnumber": "1727",
			"text": "உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (நபியவர்களிடம்), \"அல்லாஹ்வின் தூதரே! நீங்கள் எங்களை ஒரு சமூகத்தாரிடம் அனுப்பிவைக்கிறீர்கள். நாங்கள் (அங்கு) சென்று அவர்களிடம் தங்குகிறோம். ஆனால், அவர்கள் எங்களை உபசரிக்க மறுக்கின்றனர். அவ்வாறெனில் (அது குறித்து) தாங்கள் என்ன கருதுகிறீர்கள்?\" என்று கேட்டோம். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீங்கள் ஒரு சமூகத்தாரிடம் செல்ல, அவர்கள் விருந்தினர்களுக்கு வேண்டிய வசதிகளை உங்களுக்குச் செய்து தர ஏற்பாடு செய்தால், அதை ஏற்றுக்கொள்ளுங்கள். அவர்கள் அப்படிச் செய்யவில்லையென்றால்,அவர்களிடமிருந்து விருந்தினர்க(ளான உங்க)ளுக்குத் தேவை யான விருந்தினர் உரிமையை (நீங்களே) எடுத்துக்கொள்ளுங்கள்\" என்று பதிலளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 31",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4517,
			"arabicnumber": "1728",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4518,
			"arabicnumber": "1729",
			"text": "சலமா பின் அம்ர் பின் அல்அக்வஉ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (\"ஹவாஸின்\" எனும்) ஒரு போருக்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் புறப்பட்டோம். அப்போது எங்களுக்கு உணவுத் தட்டுப்பாடு ஏற்பட்டது. எனவே, நாங்கள் எங்கள் வாகன ஒட்டகங்களில் சிலவற்றை அறுக்க முடிவு செய்தோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடமிருந்த (எஞ்சிய) உணவுப் பொருட்களைத் திரட்டும்படி உத்தரவிட்டார்கள். நாங்கள் அவ்வாறே செய்தோம். அதற்காக நாங்கள் தோல்விரிப்பு ஒன்றை விரித்துப் போட்டோம். அந்த விரிப்பின் மீது மக்கள் உணவுப் பொருட்களைச் சேகரித்தனர். அதில் எந்த அளவு உணவுப் பொருட்கள் சேர்ந்துள்ளன என்பதை மதிப்பிடுவதற்காக நான் எட்டிப் பார்த்தேன். ஓர் ஆடு படுத்திருக்கும் இடம் அளவுக்கு உணவுப் பொருட்கள் குவிந்திருப்பதாக நான் மதிப்பிட்டேன். அப்போது நாங்கள் ஆயிரத்து நானூறு பேர் இருந்தோம். நாங்கள் அனைவரும் வயிறு நிரம்பும் அளவுக்கு அதிலிருந்து உண்டோம். பிறகு எங்கள் தோல் பைகளிலும் நிரப்பிக்கொண்டோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எங்களிடம்), \"அங்கத் தூய்மை (உளூ) செய்வதற்குத் தண்ணீர் உள்ளதா?\" என்று கேட்டார்கள். அப்போது ஒரு மனிதர் தமது நீர்க் குவளையைக் கொண்டுவந்தார். அதில் சிறிதளவு தண்ணீர் இருந்தது. அவர் அதை ஒரு பாத்திரத்தில் ஊற்றினார். அந்தத் தண்ணீரில் நாங்கள் அனைவரும் அங்கத் தூய்மை (உளூ) செய்தோம். நாங்கள் ஆயிரத்து நானூறு பேரும் தாராளமாக ஊற்றிக் கழுவினோம். அதன் பிறகு எட்டுப் பேர் வந்து \"அங்கத் தூய்மை செய்வதற்குத் தண்ணீர் உள்ளதா?\" என்று கேட்டனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"(அங்கத் தூய்மை செய்வதற்குரிய) தண்ணீர் தீர்ந்துவிட்டது\" என்று கூறிவிட்டார்கள். அத்தியாயம் : 31",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 20
			}
		}
	]
}