{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"37": "The Book of Clothes and Adornment"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5385,
			"arabicnumber": "2065.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: பொன் அல்லது வெள்ளிப் பாத்திரத்தில் (பானங்களைப்) பருகியவர், தமது வயிற்றில் மிடறு மிடறாக நரக நெருப்பையே விழுங்குகிறார். இதை உம்மு சலமா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5386,
			"arabicnumber": "2065.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: வெள்ளிப் பாத்திரங்களில் (பானங்களை) அருந்துகின்றவர், தமது வயிற்றில் மிடறு மிடறாக நரக நெருப்பையே விழுங்குகிறார். இதை நபி (ஸல்) அவர்களின் துணைவியார் உம்மு சலமா (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் உம்மு சலமா (ரலி) அவர்களிடமிருந்தே மேலும் ஒன்பது அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் உபைதுல்லாஹ் பின் உமர் பின் ஹஃப்ஸ் (ரஹ்) அவர்களிடமிருந்து அலீ பின் முஸ்ஹிர் (ரஹ்) அவர்கள் அறிவிக்கும் அறிவிப்பில், \"வெள்ளி மற்றும் பொன் பாத்திரங்களில் உண்ணவோ பருகவோ செய்கின்றவர்...\" என்று கூடுதலாக இடம் பெற்றுள்ளது. ஆனால், மற்றவர்களின் அறிவிப்புகளில் \"உண்பது\" தொடர்பாகவோ \"பொன் பாத்திரம்\" பற்றியோ குறிப்பு இல்லை. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5387,
			"arabicnumber": "2065.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5388,
			"arabicnumber": "2066.01",
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஏழு விஷயங்களைக் கடைப்பிடிக்கும்படி எங்களுக்குக் கட்டளையிட்டார்கள். ஏழு செயல்களைச் செய்ய வேண்டாமென எங்களுக்குத் தடை விதித்தார்கள். எங்களுக்கு அவர்கள் கட்டளையிட்ட ஏழு விஷயங்களாவன: 1. நோயாளிகளை நலம் விசாரிப்பது. 2. ஜனாஸாவைப் பின்தொடர்ந்து செல்வது. 3. தும்மிய(வர் \"அல்லாஹ்வுக்கே எல்லாப் புகழும்\" என்று கூறினால் அ)வருக்கு (\"அல்லாஹ், உங்களுக்குக் கருணை புரிவானாக!\" என்று) மறுமொழி கூறுவது. 4. சத்தியத்தை நிறைவேற்றுவது அல்லது (உன்னோடு தொடர்புடைய ஒரு விஷயத்தில்) சத்தியம் செய்தவருக்கு அதை நிறைவேற்ற உதவுவது. 5. அநீதியிழைக்கப்பட்டவருக்கு உதவுவது. 6. விருந்தழைப்பை ஏற்றுக்கொள்வது. 7. (மக்களிடையே) சலாமைப் பரப்புவது. எங்களுக்கு அவர்கள் தடை விதித்த ஏழு விஷயங்களாவன: 1. (ஆண்கள்) \"பொன் மோதிரம் அணிவது\" அல்லது \"மோதிரங்கள் அணிவது\" 2. வெள்ளிப் பாத்திரத்தில் பருகுவது. 3.மென்பட்டுத் திண்டு பயன்படுத்துவது. 4. (ஆண்கள் எகிப்தியப்) பட்டு கலந்த பஞ்சாடை அணிவது. 5. (ஆண்கள்) சாதாரணப் பட்டு அணிவது. 6. (ஆண்கள்) கெட்டிப் பட்டு அணிவது. 7. (ஆண்கள்) அலங்காரப் பட்டு அணிவது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் பராஉ பின் ஆஸிப் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் \"சத்தியத்தை நிறைவேற்றுவது, அல்லது சத்தியம் செய்தவருக்கு அதை நிறைவேற்ற உதவுவது\" என்பது இடம்பெறவில்லை. அதற்குப் பகரமாக \"கண்டெடுக்கப்பட்ட பொருள் பற்றி அறிவிப்புச் செய்வது\" என இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் பராஉ பின் ஆஸிப் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"சத்தியத்தை நிறைவேற்றுவது\" என ஐயப்பாடின்றி அறிவிக்கப்பட்டுள்ளது. மேலும் அவற்றில் \"வெள்ளிப் பாத்திரத்தில் பருகுவது; ஏனெனில், இம்மையில் அதில் பருகியவர் மறுமையில் அதில் பருகமாட்டார்\" என்று கூடுதலாக இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் ஏழு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. இவற்றிலும் மேற்கண்ட ஹதீஸ்களில் உள்ள தகவல்களே இடம்பெற்றுள்ளன. ஆனால், \"(மக்களிடையே) சலாமைப் பரப்புவது\" என்பதற்குப் பகரமாக \"சலாமுக்குப் பதிலுரைப்பது\" என இடம்பெற்றுள்ளது. மேலும் \"(ஆண்கள்) தங்க மோதிரம் அணிவது அல்லது \"தங்க வளையம் அணிவது\" என்று (ஐயத்துடன்) காணப்படுகிறது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"சலாமைப் பரப்புவது\" என்றும் \"தங்க மோதிரம் அணிவது\" என்றும் சந்தேகமின்றி இடம்பெற்றுள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5389,
			"arabicnumber": "2066.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5390,
			"arabicnumber": "2066.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5391,
			"arabicnumber": "2066.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5392,
			"arabicnumber": "2066.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5394,
			"arabicnumber": "2067.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5395,
			"arabicnumber": "2067.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5396,
			"arabicnumber": "2067.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5397,
			"arabicnumber": "2067.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5398,
			"arabicnumber": "2067.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5399,
			"arabicnumber": "2067.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5400,
			"arabicnumber": "2067.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5401,
			"arabicnumber": "2068.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5402,
			"arabicnumber": "2068.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5403,
			"arabicnumber": "2068.03",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: \"தமீம்\" குலத்தைச் சேர்ந்த உத்தாரித் (பின் ஹாஜிப்) என்பவர் கடைத்தெருவில் நின்று, கோடுபோட்ட பட்டு அங்கி விற்பதை உமர் (ரலி) அவர்கள் கண்டார்கள். -உத்தாரித் (பன்னாட்டு) மன்னர்களுடன் தொடர்புள்ளவராகவும், அவர்களிடமிருந்து (பல்வேறு பொருட்களைப்) பெற்றுவருபவராகவும் இருந்தார்.- பிறகு உமர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! கடைத்தெருவில் நின்று, கோடு போட்ட பட்டு அங்கியை உத்தாரித் விற்பதைக்கண்டேன். அதைத் தாங்கள் வாங்கி, அரபுத் தூதுக் குழுக்கள் தங்களிடம் வரும்போது தாங்கள் அணிந்துகொண்டால் நன்றாயிருக்குமே!\" என்று சொன்னார்கள். \"வெள்ளிக்கிழமையின்போதும் அணிந்து கொண்டால் நன்றாயிருக்குமே\" என்றும் அவர்கள் கூறியதாக நான் எண்ணுகிறேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"மறுமையில் எந்த நற்பேறும் இல்லாதவரே இம்மையில் இந்தப் பட்டாடைகளை அணிவார்\" என்று சொன்னார்கள். பின்னர் (ஒரு நாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கோடு போட்ட பட்டாடைகள் சில கொண்டுவரப்பட்டன. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவற்றில் ஓர் பட்டாடையை உமர் (ரலி) அவர்களுக்கும் மற்றொன்றை உசாமா பின் ஸைத் (ரலி) அவர்களுக்கும் அனுப்பி வைத்தார்கள். இன்னொன்றை அலீ பின் அபீதாலிப் (ரலி) அவர்களுக்குக் கொடுத்து, \"இதை முக்காடுகளாக வெட்டி உங்கள் பெண்களிடையே பங்கிட்டுவிடுங்கள்\" என்று கூறினார்கள். உமர் (ரலி) அவர்கள் தமது பட்டாடையை எடுத்துக்கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! இதை எனக்குக் கொடுத்தனுப்பியுள்ளீர்கள். ஆனால், உத்தாரித் விற்ற பட்டாடை குறித்து நேற்று தாங்கள் வேறுவிதமாகக் கூறினீர்களே?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதை நீங்கள் அணிந்துகொள்வதற்காக உங்களுக்கு நான் கொடுத்தனுப்பவில்லை. மாறாக, இதை நீங்கள் (விற்றுப் பணம்) பெறுவதற்காகவே கொடுத்தனுப்பினேன்\" என்று சொன்னார்கள். உசாமா (ரலி) அவர்களோ அதை அணிந்துகொண்டு வந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உசாமாவை உற்றுப் பார்த்தார்கள். (அவர்கள் பார்த்த பார்வையிலிருந்து) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குத் தாம் (இவ்வாறு) செய்தது பிடிக்கவில்லை யென்பதை உசாமா உணர்ந்து கொண்டார். உடனே \"அல்லாஹ்வின் தூதரே! ஏன் (இப்படி) என்னை உற்றுப் பார்க்கிறீர்கள்? தாங்கள் தாமே இதை எனக்குக் கொடுத்தனுப்பினீர்கள்?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதை நீ அணிந்துகொள்வதற்காக உனக்கு நான் கொடுத்தனுப்பவில்லை. மாறாக, இதை முக்காடுகளாக வெட்டி, உன் (வீட்டுப்) பெண்களுக்குப் பங்கிடுவதற்காகவே உனக்குக் கொடுத்தனுப்பினேன்\" என்று சொன்னார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5404,
			"arabicnumber": "2068.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5405,
			"arabicnumber": "2068.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5406,
			"arabicnumber": "2068.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5407,
			"arabicnumber": "2068.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5408,
			"arabicnumber": "2068.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5409,
			"arabicnumber": "2069.01",
			"text": "அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்களின் முன்னாள் அடிமையும் அதாஉ (ரஹ்) அவர்களின் பிள்ளைக்குத் தாய்மாமாவுமான அப்துல்லாஹ் பின் கைசான் (ரஹ்) அவர்கள் கூறியதாவது: அஸ்மா (ரலி) அவர்கள் என்னை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடம் அனுப்பி, \"ஆடைகளில் (சிறிது) பட்டு வேலைப்பாடுகள் உள்ளதையும், சிவப்பு நிற மென்பட்டுத் திண்டுகளை(ப் பயன்படுத்துவதை)யும், ரஜப் மாதம் முழுவதும் நோன்பு நோற்பதையும், தாங்கள் தடை செய்துவருவதாக எனக்குச் செய்தி எட்டியுள்ளதே (அது உண்மையா?)\" என்று கேட்கச் சொன்னார்கள். அதற்கு என்னிடம் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், \"ரஜப் மாதத்தில் நோன்பு நோற்பதைப் பற்றி நீங்கள் குறிப்பிட்டதைப் பொறுத்தவரையில், (நீங்கள் கேள்விப்பட்டது பொய்யாகும்.) எல்லாக் காலங்களிலும் நோன்பு நோற்கும் ஒருவ(னான என்)னைப் பற்றி எப்படி (இதைச் சொல்ல முடியும்)? ஆடைகளில் பட்டு வேலைப்பாடுகள் உள்ளதைப் பொறுத்தவரையில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாக (என் தந்தை) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் \"(மறுமையில்) எந்த நற்பேறும் இல்லாதவர்தாம் (இம்மையில்) பட்டாடை அணிவார்\" என்று கூறியதை நான் கேட்டுள்ளேன். பட்டு வேலைப்பாடுகள் உள்ளதும் இத்தடைக்குள் அடங்கும் என்று நான் அஞ்சினேன். சிவப்பு நிறத்தில் அமைந்த மென்பட்டுத் திண்டைப் பொறுத்தவரையில், இதுதான் அப்துல்லாஹ் பின் உமரின் திண்டாகும். இதுவும் சிவப்பு நிறத்தில் அமைந்த திண்டுதான்\" என்று கூறினார்கள். நான் அஸ்மா (ரலி) அவர்களிடம் திரும்பி வந்து, இப்னு உமர் (ரலி) அவர்கள் கூறியதைத் தெரிவித்தேன். அப்போது அஸ்மா (ரலி) அவர்கள், \"இதுதான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் நீளங்கியாகும்\" எனக் கூறி, கோடுபோட்ட பாரசீக (மன்னர்கள் அணியும்) பட்டு நீளங்கி ஒன்றை வெளியே எடுத்தார்கள். அதன் கழுத்துப் பகுதியில் அலங்காரப் பட்டு வேலைப்பாடு இருந்தது. அதன் முன், பின் திறப்புகள் அலங்காரப் பட்டினால் வேலைப்பாடுகள் செய்யப்பட்டிருந்தன. அஸ்மா (ரலி) அவர்கள், \"இது, ஆயிஷா (ரலி) அவர்களிடம் அவர்கள் இறக்கும்வரை இருந்துவந்தது. அவர்கள் இறந்த பின்னர் அதை நான் எடுத்துவைத்துக்கொண்டேன். இதை நபி (ஸல்) அவர்கள் அணிந்துவந்தார்கள். பின்னர் நாங்கள் (அருள்வளம் கருதி) இதைத் தண்ணீரில் கழுவி, அதைக்கொண்டு நோயாளிகளுக்குச் சிகிச்சை அளித்துவருகிறோம்\" என்று கூறினார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5410,
			"arabicnumber": "2069.02",
			"text": "கலீஃபா பின் கஅப் அபீதிப்யான் (ரஹ்) அவர்கள் கூறியதாவது: (ஒருமுறை) அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்கள் உரை நிகழ்த்துகையில் \"நீங்கள் உங்கள் (வீட்டுப்) பெண்களுக்குப் பட்டாடைகள் அணிவிக்காதீர்கள். ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"பட்டாடை அணியாதீர்கள். யார் இம்மையில் அதை அணிகிறாரோ, அவர் மறுமையில் அதை அணியமாட்டார்\" என்று கூறியதாக உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் சொல்ல நான் கேட்டுள்ளேன்\" என்றார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5411,
			"arabicnumber": "2069.03",
			"text": "அபூஉஸ்மான் அந்நஹ்தீ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் (ஈரானிலுள்ள) ஆதர்பைஜானில் (ஓர் படையில்) இருந்தபோது எங்களுக்கு (வாசித்துக் காட்டுமாறு எங்கள் தளபதி உத்பா (ரலி) அவர்களுக்கு) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் கடிதம் ஒன்று எழுதினார்கள். (அதில் பின்வருமாறு குறிப்பிட்டிருந்தார்கள்:) (தளபதி) உத்பா பின் ஃபர்கதே! இது (உமது பொறுப்பிலுள்ள செல்வம்.) நீர் பாடுபட்டுச் சம்பாதித்ததுமல்ல; உம்முடைய தந்தையோ தாயோ பாடுபட்டுச் சம்பாதித்ததுமல்ல. எனவே, நீர் உமது இருப்பிடத்தில் இருந்துகொண்டு அனுபவிப்பதைப் போன்றே, முஸ்லிம்கள் தம் இருப்பிடங்களில் இருந்தவாறே அனுபவிக்கச் செய்வீராக. உல்லாச வாழ்க்கை, இணைவைப்பாளர்களின் நாகரிகம், பட்டாடை ஆகியவற்றிலிருந்து உங்களை நான் எச்சரிக்கிறேன். ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், பட்டாடைக்குத் தடை விதித்தார்கள்; இந்த அளவைத் தவிர: (அந்த அளவை விவரிக்கையில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது நடு விரலையும் ஆட்காட்டி விரலையும் உயர்த்தி, அவ்விரண்டையும் இணைத்துக் காட்டினார்கள். (அறிவிப்பாளர்களில் ஒருவரான) ஸுஹைர் (ரஹ்) அவர்கள் கூறுகிறார்கள்: \"(கைகளால் சைகை செய்து காட்டியது தொடர்பான) இந்தச் செய்தியும் அந்தக் கடிதத்தில் காணப்பட்டது\" என அறிவிப்பாளர் ஆஸிம் (ரஹ்) அவர்கள் கூறினார்கள். இதைக் கூறுகையில் அறிவிப்பாளர் ஸுஹைர் (ரஹ்) அவர்களும் தம்மிரு விரல்களை உயர்த்திக் காட்டினார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5412,
			"arabicnumber": "2069.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5413,
			"arabicnumber": "2069.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5414,
			"arabicnumber": "2069.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5415,
			"arabicnumber": "2069.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5416,
			"arabicnumber": "2069.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5417,
			"arabicnumber": "2069.09",
			"text": "சுவைத் பின் ஃகஃபலா (ரஹ்) அவர்கள் கூறியதாவது: (கலீஃபா) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் (டமாஸ்கஸிலுள்ள) \"ஜாபியா\" எனுமிடத்தில் உரை நிகழ்த்துகையில், \"நபி (ஸல்) அவர்கள் பட்டு அணிவதைத் தடைசெய்தார்கள்; இரு விரல்கள் அல்லது மூன்று விரல்கள் அல்லது நான்கு விரல்கள் வைக்குமிடத்தின் அளவைத் தவிர\" என்று குறிப்பிட்டார்கள். இந்த ஹதீஸ் ஆறு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5418,
			"arabicnumber": "2069.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5419,
			"arabicnumber": "2070",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் நபி (ஸல்) அவர்கள் தமக்கு அன்பளிப்பாக வழங்கப்பட்ட அலங்காரப் பட்டு நீளங்கி ஒன்றை அணிந்தார்கள். பின்னர் விரைவாக அதைக் கழற்றி உமர் பின் அல்கத்தாப் (ரலி) அவர்களுக்குக் கொடுத்தனுப்பினார்கள். அப்போது அவர்களிடம், \"ஏன் விரைவாக அதைக் கழற்றிவிட்டீர்கள், அல்லாஹ்வின் தூதரே?\" என்று கேட்கப்பட்டது. அதற்கு அவர்கள், \"அதை அணியவேண்டாம் என (வானவர்) ஜிப்ரீல் என்னைத் தடுத்துவிட்டார்\" என்று பதிலளித்தார்கள். பிறகு உமர் (ரலி) அவர்கள் அழுதுகொண்டே வந்து, \"அல்லாஹ்வின் தூதரே! தாங்கள் வெறுத்த ஒன்றை எனக்குக் கொடுத்துள்ளீர்களே? எனக்கு மட்டும் என்னவாம்?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதை நீங்கள் அணிந்து கொள்வதற்காக உங்களுக்கு நான் இதை வழங்கவில்லை. இதை நீங்கள் விற்று(க் காசாக்கி)க் கொள்வதற்காகவே உங்களுக்கு வழங்கினேன்\" என்று சொன்னார்கள். எனவே, அதை உமர் (ரலி) அவர்கள் இரண்டாயிரம் திர்ஹங்களுக்கு விற்று விட்டார்கள்.-இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5420,
			"arabicnumber": "2071.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5421,
			"arabicnumber": "2071.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5422,
			"arabicnumber": "2071.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5423,
			"arabicnumber": "2071.04",
			"text": "அலீ பின் அபீதாலிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோடுபோட்ட பட்டுஅங்கி ஒன்றை எனக்குக் கொடுத்தார்கள். நான் (அதை அணிந்துகொண்டு அவர்களிடம்) புறப்பட்டு வந்தபோது, அவர்களது முகத்தில் கோபத்தை நான் கண்டேன். எனவே,அதை வெட்டி என் (வீட்டுப்) பெண்களிடையே பங்கிட்டுவிட்டேன். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5424,
			"arabicnumber": "2072",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5425,
			"arabicnumber": "2073",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5426,
			"arabicnumber": "2074",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5427,
			"arabicnumber": "2075.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5428,
			"arabicnumber": "2075.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5429,
			"arabicnumber": "2076.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5430,
			"arabicnumber": "2076.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5431,
			"arabicnumber": "2076.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5432,
			"arabicnumber": "2076.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5433,
			"arabicnumber": "2076.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5434,
			"arabicnumber": "2077.01",
			"text": "அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், நான் செம்மஞ்சள் நிறச் சாயமிடப்பட்ட இரு ஆடைகளை அணிந்திருப்பதைக் கண்டபோது, \"இவை இறைமறுப்பாளர்களின் ஆடைகளில் உள்ளவையாகும். எனவே, இதை நீர் அணியாதீர்\" என்று சொன்னார்கள். - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5435,
			"arabicnumber": "2077.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5436,
			"arabicnumber": "2077.03",
			"text": "அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: நான் செம்மஞ்சள் நிறச் சாயமிடப்பட்ட இரு ஆடைகளை அணிந்திருப்பதைக் கண்ட நபி (ஸல்) அவர்கள், \"உன் தாயாரா இவ்வாறு (செம்மஞ்சள் நிறச் சாயமிடுமாறு) உமக்குக் கட்டளையிட்டார்?\" என்று கேட்டார்கள். நான், \"அவ்விரண்டையும் கழுவி (செம்மஞ்சள் நிறச் சாயத்தை அகற்றி)க் கொள்கிறேன்\" என்றேன். நபி (ஸல்) அவர்கள் \"இல்லை, அவ்விரண்டையும் எரித்துவிடு\" என்று சொன்னார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5437,
			"arabicnumber": "2078.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5438,
			"arabicnumber": "2078.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5439,
			"arabicnumber": "2078.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5440,
			"arabicnumber": "2079.01",
			"text": "கத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம் \"எந்த ஆடை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு மிகவும் விருப்பமானதாக இருந்தது?\" என்று கேட்டோம். \"(பருத்தியாலான) யமன் நாட்டுச் சால்வை\" என்று பதிலளித்தார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5441,
			"arabicnumber": "2079.02",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: (பருத்தியாலான) யமன் நாட்டுச் சால்வையே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு மிகவும் பிரியமான துணியாக இருந்தது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5442,
			"arabicnumber": "2080.01",
			"text": "அபூபுர்தா (ரலி) அவர்கள் கூறியதாவது: நான் ஆயிஷா (ரலி) அவர்களிடம் சென்றேன். அவர்கள் எங்களிடம் யமன் நாட்டில் தயாரிக்கப்பட்ட கெட்டியான கீழங்கி ஒன்றையும் \"அல்முலப்பதா\" (ஒட்டாடை) எனப் பெயர் பெற்ற மற்றோர் ஆடையையும் எடுத்துக்காட்டி, \"அல்லாஹ்வின் மீதாணையாக! இந்த இரண்டு ஆடைகளையும் அணிந்திருந்த நிலையில்தான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் உயிர் பிரிந்தது\" என்று சொன்னார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5443,
			"arabicnumber": "2080.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5444,
			"arabicnumber": "2080.03",
			"text": "அபூபுர்தா (ரலி) அவர்கள் கூறியதா வது: ஆயிஷா (ரலி) அவர்கள் எங்களிடம் கீழங்கி ஒன்றையும் (இரண்டை ஒன்றாகச் சேர்த்து) ஒட்டப்பட்ட மற்றொரு கெட்டியான ஆடையையும் எடுத்துக்காட்டி, \"இவற்றை அணிந்திருந்த நிலையில்தான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் உயிர் பிரிந்தது\" என்று சொன்னார்கள்.- இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் முஹம்மத் பின் ஹாத்திம் (ரஹ்) அவர்களது அறிவிப்பில் \"கெட்டியான கீழங்கியொன்றையும்\" என்று இடம்பெற்றுள்ளது.- மேற்கண்ட ஹதீஸ் அபூபுர்தா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"கெட்டியான கீழங்கியொன்றையும்\" என்றே இடம்பெற்றுள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5445,
			"arabicnumber": "2081",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் காலை நபி (ஸல்) அவர்கள், கோடுபோட்ட கறுப்பு முடியாலான ஆடை அணிந்து வெளியே புறப்பட்டார்கள்.இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5446,
			"arabicnumber": "2082.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சாய்ந்துகொள்ளும் தலையணை, பதனிடப்பட்ட தோலால் அமைந்திருந்தது. அது ஈச்ச நாரினால் நிரப்பப்பெற்றிருந்தது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5447,
			"arabicnumber": "2082.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5448,
			"arabicnumber": "2082.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5449,
			"arabicnumber": "2083.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5450,
			"arabicnumber": "2083.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5451,
			"arabicnumber": "2083.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5452,
			"arabicnumber": "2084",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5453,
			"arabicnumber": "2085.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5454,
			"arabicnumber": "2085.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5455,
			"arabicnumber": "2085.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5456,
			"arabicnumber": "2085.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5457,
			"arabicnumber": "2085.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5458,
			"arabicnumber": "2085.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5459,
			"arabicnumber": "2085.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5460,
			"arabicnumber": "2085.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5461,
			"arabicnumber": "2085.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5462,
			"arabicnumber": "2086",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5463,
			"arabicnumber": "2087.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5464,
			"arabicnumber": "2087.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5465,
			"arabicnumber": "2088.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5466,
			"arabicnumber": "2088.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5467,
			"arabicnumber": "2088.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5468,
			"arabicnumber": "2088.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5469,
			"arabicnumber": "2088.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5470,
			"arabicnumber": "2089.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5471,
			"arabicnumber": "2089.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5472,
			"arabicnumber": "2090",
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ஒரு மனிதர் தமது கையில் தங்கமோதிரம் அணிந்திருப்பதைக் கண்டபோது, அதைக் கழற்றச்செய்து தூக்கியெறிந்தார்கள். பிறகு \"உங்களில் ஒருவர் (நரக) நெருப்பின் கங்கை எடுத்து, அதைத் தமது கையில் வைத்துக் கொள்கிறார்\" என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சென்ற பிறகு அந்த மனிதரிடம், \"உமது மோதிரத்தை(க் கழற்றி) எடுத்து நீ (வேறு வகையில்) பயனடைந்துகொள்\" என்று கூறப்பட்டது. அவர், \"இல்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வீசியெறிந்துவிட்டதை அல்லாஹ்வின் மீதாணையாக ஒருபோதும் நான் எடுக்க மாட்டேன்\" என்று சொல்லிவிட்டார். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5473,
			"arabicnumber": "2091.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5474,
			"arabicnumber": "2091.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5475,
			"arabicnumber": "2091.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5476,
			"arabicnumber": "2091.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5477,
			"arabicnumber": "2091.05",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (முதலில்) தங்கமோதிரம் ஒன்றைத் தயாரித்து (அணிந்து) கொண்டார்கள். பிறகு அதை(க் கழற்றி) எறிந்தார்கள். பிறகு வெள்ளி மோதிரம் ஒன்றைத் தயாரித்து (அணிந்து)கொண்டார்கள். அதில் \"முஹம்மதுர் ரசூலுல்லாஹ்\" எனும் இலச்சினை பொறித்தார்கள். மேலும், \"எனது மோதிரத்தில் பொறிக்கப்பட்டிருப்பதைப் போன்று வேறு யாரும் (அரசு) இலச்சினை பொறிக்க வேண்டாம்\" என்று சொன்னார்கள். அவர்கள் அதை அணியும்போது அதன் குமிழ் பகுதி உள்ளங்கை பக்கமாக அமையும்படி அணிவார்கள். அந்த மோதிரம் தான் \"அரீஸ்” எனும் கிணற்றில், முஐகீப் (பின் அபீஃபாத்திமா - ரலி) அவர்களின் கையிலிருந்து விழுந்துவிட்டது. இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. - அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் வெள்ளி மோதிரம் ஒன்றைச் செய்து, அதில் \"முஹம்மதுர் ரசூலுல்லாஹ்\" எனும் இலச்சினை பொறித்தார்கள். மேலும், மக்களிடம் \"நான் வெள்ளி மோதிரம் ஒன்றைச் செய்து, அதில் \"முஹம்மதுர் ரசூலுல்லாஹ்\" எனும் இலச்சினை பொறித்துள்ளேன். ஆகவே, வேறு யாரும் அதைப் போன்று (அரசு) இலச்சினை பொறிக்க வேண்டாம்\" என்று சொன்னார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"முஹம்மதுர் ரசூலுல்லாஹ்\" (எனும் இலச்சினை அமைந்திருந்தது) எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5478,
			"arabicnumber": "2092.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5479,
			"arabicnumber": "2092.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5480,
			"arabicnumber": "2092.03",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பைஸாந்திய) ரோமர்களுக்குக் கடிதம் எழுத விரும்பியபோது மக்கள், \"ரோமர்கள் முத்திரையிடப்படாத எந்தக் கடிதத்தையும் வாசிக்கமாட்டார்கள்\" என்று கூறினர். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெள்ளி மோதிரம் ஒன்றைச் செய்து, அதில் \"முஹம்மதுர் ரசூலுல்லாஹ்\" எனும் இலச்சினை பொறித்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் கையில் (ஒளிர்ந்த) அந்த மோதிரத்தின் வெண்மையை இப்போதும் நான் பார்ப்பதைப் போன்றுள்ளது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5481,
			"arabicnumber": "2092.04",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அரபியர் அல்லாதோருக்குக் கடிதம் எழுத விரும்பியபோது, \"அரபியர் அல்லாதோர் முத்திரை இல்லாத கடிதம் எதையும் ஏற்கமாட்டார்கள்\" என்று அவர்களிடம் கூறப்பட்டது, எனவே,அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெள்ளி மோதிரம் ஒன்றைத் தயார் செய்துகொண்டார்கள். அவர்களது கையில் (ஒளிர்ந்த) அந்த மோதிரத்தின் வெண்மையை இப்போதும் நான் பார்ப்பதைப் போன்றுள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5482,
			"arabicnumber": "2092.05",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் சீசர், குஸ்ரூ, நீகஸ் (கிஸ்ரா, கைசர், நஜாஷீ) ஆகிய மன்னர்களுக்குக் கடிதம் எழுத விரும்பியபோது, \"இ(ம்மன்ன)வர்கள் முத்திரை இல்லாத எந்தக் கடிதத்தையும் ஏற்கமாட்டார்கள்\" என்று கூறப்பட்டது. ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெள்ளி வளைய மோதிரம் ஒன்றை வார்த்து அதில் \"முஹம்மதுர் ரசூலுல்லாஹ்\" எனும் இலச்சினை பொறித்துக்கொண்டார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5483,
			"arabicnumber": "2093.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5484,
			"arabicnumber": "2093.02",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் கையில் வெள்ளி மோதிரத்தைக் கண்டேன். பிறகு மக்களும் வெள்ளி மோதிரங்களை வார்த்து, அவற்றை அணிந்து கொண்டனர். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (முன்பு அணிந்திருந்த) தமது (தங்க) மோதிரத்தை எறிந்துவிட்டார்கள். எனவே, மக்களும் தம் (தங்க) மோதிரங்களை எறிந்துவிட்டனர். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5485,
			"arabicnumber": "2093.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5486,
			"arabicnumber": "2094.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது வெள்ளி மோதிரம் அபிசீனியக் குமிழ் (அல்லது கறுப்புக் கல்) உள்ளதாக இருந்தது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5487,
			"arabicnumber": "2094.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5488,
			"arabicnumber": "2094.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5489,
			"arabicnumber": "2095",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5490,
			"arabicnumber": "2078.04",
			"text": "அபூபுர்தா ஆமிர் பின் அப்தில்லாஹ் (ரஹ்) அவர்கள் கூறியதாவது: அலீ (ரலி) அவர்கள், \"நபி (ஸல்) அவர்கள் இந்த விரலில் அல்லது அதற்கடுத்த விரலில் மோதிரம் அணிய வேண்டாம் என என்னைத் தடை செய்தார்கள்\" என்று கூறினார்கள். -அது எந்த இரு விரல்கள் என அறிவிப்பாளர் ஆஸிம் பின் குலைப் (ரஹ்) அவர்களுக்குத் தெரியவில்லை.- மேலும், \"கஸ்\" வகைத் துணியை அணியவேண்டாம் என்றும் (சிவப்பு) மென்பட்டு விரிப்புகளில் (மீஸரா) அமர வேண்டாமென்றும் எனக்குத் தடை செய்தார்கள். மேலும், அலீ (ரலி) அவர்கள் பின்வருமாறு கூறினார்கள்: \"கஸ்\" வகைத் துணி என்பது, எகிப்து அல்லது சிரியாவிலிருந்து இறக்குமதி செய்யப்பட்ட ஒரு வகைத் துணியாகும். அதில் விலா எலும்புகளைப் போல வரிவரியாகக் கோடுகள் இருக்கும். இன்னவற்றுக்கு அது ஒப்பாயிருக்கும். \"மீஸரா\" என்பது, பெண்கள் தம் கணவர்களுக்காக ஒட்டகச் சேணத்தில் அமைக்கும் சிவப்பு நிற மென்பட்டுத் திண்டுகளைப் போன்ற விரிப்புகளாகும். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"அபூமூசாவின் புதல்வர் (அபூபுர்தா) கூறினார்\" என அறிவிப்பாளர்தொடரில் இடம் பெற்றுள்ளது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"நபி (ஸல்) அவர்கள் தடைசெய்தார்கள். அல்லது நபி (ஸல்) அவர்கள் என்னைத் தடை செய்தார்கள்\" என்று இடம் பெற்றுள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5491,
			"arabicnumber": "2078.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5492,
			"arabicnumber": "2078.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5493,
			"arabicnumber": "2078.07",
			"text": "அபூபுர்தா (ரலி) அவர்கள் கூறியதாவது: அலீ (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இந்த விரலில் அல்லது இந்த விரலில் மோதிரம் அணியவேண்டாம் என்று என்னைத் தடை செய்தார்கள்\" என்று கூறி, நடுவிரலையும் அதற்கடுத்த (ஆட்காட்டி) விரலையும் சுட்டிக் காட்டினார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5494,
			"arabicnumber": "2096",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5495,
			"arabicnumber": "2097.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் காலணி அணியும் போது முதலில் வலக் காலில் அணியட்டும். அதைக் கழற்றும்போது முதலில் இடக் காலில் இருந்து கழற்றட்டும். ஒன்று, இரு காலணிகளையும் ஒருசேர அவர் அணிந்து கொள்ளட்டும். அல்லது இரண்டையும் ஒருசேரக் கழற்றிவிடட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5496,
			"arabicnumber": "2097.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5497,
			"arabicnumber": "2098.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5498,
			"arabicnumber": "2098.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5499,
			"arabicnumber": "2099.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5500,
			"arabicnumber": "2099.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5501,
			"arabicnumber": "2099.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5502,
			"arabicnumber": "2099.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5503,
			"arabicnumber": "2099.05",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ஒரே துணியை உடலில் சுற்றிக்கொண்டு, அதன் ஒரு மூலையை ஒரு தோளில் போட்டுக்கொண்டு மற்றொரு தோளைத் திறந்த நிலையில் விட்டுவிட வேண்டாம் என்றும், ஒரே துணியைப் போர்த்திக்கொண்டு (மர்ம உறுப்பு வெளியே தெரியுமாறு குத்துக்காலிட்டு) அமர வேண்டாம் என்றும், ஒரு மனிதர் மல்லாந்து படுத்திருக்கும்போது கால்மீது கால் போட்டுக்கொள்ள வேண்டாம் என்றும் தடை செய்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5504,
			"arabicnumber": "2100.01",
			"text": "அப்துல்லாஹ் பின் ஸைத் பின் ஆஸிம் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு காலின் மீது மற்றொரு காலைப் போட்டுக்கொண்டு பள்ளிவாசலில் மல்லாந்து படுத்திருப்பதை நான் கண்டேன். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5505,
			"arabicnumber": "2100.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் மல்லாந்து படுத்துக்கொண்டு ஒரு காலை மற்றொரு கால்மீது போட்டுக்கொள்ள வேண்டாம். இதை ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5506,
			"arabicnumber": "2101.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், குங்குமப்பூச் சாயமிட்டுக்கொள்வதைத் தடை செய்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. ஹம்மாத் பின் ஸைத் (ரஹ்) அவர்களது அறிவிப்பில் \"அதாவது ஆண்களுக்குத் தடை செய்தார்கள்\" என (விளக்கத்துடன்) இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் அனஸ் பின் மாலிக் (ரலி) அவர்களிடமிருந்தே மேலும் ஐந்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஆண்கள் குங்குமப்பூச் சாயமிட்டுக் கொள்ளக்கூடாது எனத் தடை விதித்தார்கள்\" என இடம்பெற்றுள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5507,
			"arabicnumber": "2101.02",
			"text": "மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் ஸைத் (ரலி) அவர்களிடமிருந்தே மேலும் ஒன்பது அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5508,
			"arabicnumber": "2102.01",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: (அபூபக்ர் (ரலி) அவர்களின் தந்தை) அபூகுஹாஃபா அவர்கள் மக்கா \"வெற்றி ஆண்டில்\" அல்லது \"வெற்றி நாளில்\" (நபி (ஸல்) அவர்களிடம்) \"வந்தார்கள்\". அல்லது \"கொண்டுவரப் பட்டார்கள்\". அவர்களது தலை முடியும் தாடியும் தும்பைப் பூவைப் போன்று (தூய வெள்ளை நிறத்தில்) இருந்தன. அவருடைய துணைவியரிடம் நபி (ஸல்) அவர்கள், \"இ(ந்த வெள்ளை நிறத்)தை ஏதேனும் (சாயம்) கொண்டு மாற்றுங்கள்\" என்று உத்தரவிட்டார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5509,
			"arabicnumber": "2102.02",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: மக்கா வெற்றி நாளில் (அபூபக்ர் (ரலி) அவர்களின் தந்தை) அபூகுஹாஃபா, (நபி (ஸல்) அவர்களிடம்) கொண்டுவரப்பட்டார். அவரது தலை முடியும் தாடியும் தும்பைப் பூவைப் போன்று வெள்ளை நிறத்தில் இருந்தன. அப்போது நபி (ஸல்) அவர்கள் இ(ந்த வெள்ளை நிறத்)தை ஏதேனும் (சாயம்) கொண்டு மாற்றுங்கள். கறுப்பு நிறத்தை தவிர்த்துக் கொள்ளுங்கள்\" என்று கூறினார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5510,
			"arabicnumber": "2103",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: யூதர்களும் கிறித்தவர்களும் (நரைமுடிக்கு) சாயமிட்டுக்கொள்வதில்லை. ஆகவே, நீங்கள் (உங்கள் நரைமுடிகளுக்குச் சாயமிட்டு) அவர்களுக்கு மாறுசெய்யுங்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5511,
			"arabicnumber": "2104.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு (குறிப்பிட்ட) நேரத்தில் வருவதாக வாக்களித்திருந்தார்கள். ஆனால், அந்த நேரம் வந்தும் ஜிப்ரீல் வரவில்லை. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது கையில் குச்சியொன்று இருந்தது. அதை அவர்கள் தூக்கியெறிந்துவிட்டு, \"அல்லாஹ் தனது வாக்குறுதிக்கு மாறுசெய்யமாட்டான். அவனுடைய தூதர்களும் வாக்குறுதிக்கு மாறுசெய்யமாட்டார்கள்\" என்று கூறினார்கள். பின்னர் திரும்பிப் பார்த்தபோது, தமது கட்டிலுக்குக் கீழே நாய்க்குட்டியொன்று இருப்பதைக் கண்டார்கள். உடனே \"ஆயிஷா! இந்த நாய் இங்கு எப்போது நுழைந்தது?\" என்று கேட்டார்கள். நான், \"அல்லாஹ்வின் மீதாணையாக! எனக்குத் தெரியவில்லை\" என்றேன். உடனே அதை அப்புறப்படுத்துமாறு உத்தரவிட்டார்கள். அவ்வாறே அது அப்புறப்படுத்தப்பட்ட பின் ஜிப்ரீல் (அலை) அவர்கள் வந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீங்கள் வருவதாகச் சொன்னீர்கள். உங்களுக்காக நான் (எதிர்பார்த்து) அமர்ந்திருந்தேன். ஆனால், நீங்கள் வரவில்லையே (ஏன்)?\" என்று கேட்டார்கள். அதற்கு ஜிப்ரீல் (அலை) அவர்கள், \"உங்கள் வீட்டினுள்ளிருந்த நாயே என(து வருகை)க்குத் தடையாக அமைந்துவிட்டது. (வானவர்களாகிய) நாங்கள், நாயும் உருவப்படமும் உள்ள வீட்டிற்குள் நுழையமாட்டோம்\" என்று சொன்னார்கள். - மேற்கண்ட ஹதீஸ் ஆயிஷா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் வருவதாக வாக்களித்திருந்தார்கள்...\" என்று ஹதீஸ் ஆரம்பமாகி (சுருக்கமாக முடிகி)றது. மேற்கண்ட அறிவிப்பில் உள்ளதைப் போன்று விரிவாக இடம்பெறவில்லை. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5512,
			"arabicnumber": "2104.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5513,
			"arabicnumber": "2105",
			"text": "நபி (ஸல்) அவர்களின் துணைவியார்) மைமூனா (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் காலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வழக்கத்திற்கு மாறாகக்) கவலையோடு அமைதியாக இருந்தார்கள். நான், \"அல்லாஹ்வின் தூதரே! இன்றைய தினம் தங்களது தோற்றத்தில் ஏதோ மாற்றத்தை நான் காண்கிறேனே (ஏன்)?\" என்று கேட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(வானவர்) ஜிப்ரீல் இன்றிரவில் என்னை வந்து சந்திப்பதாக வாக்களித்திருந்தார். ஆனால், அவர் வரவில்லை. அல்லாஹ்வின் மீதாணையாக! அவர் என்னிடம் வாக்கு மாறி நடந்ததில்லை\" என்று சொன்னார்கள். அந்நாள் முழுவதும் அதே நிலையிலேயே அவர்கள் காணப்பட்டார்கள். பிறகு அவர்களது மனதில், எங்கள் வீட்டிலிருந்த கூடாரமொன்றுக்குக் கீழே நாய்க்குட்டி இருக்கும் நினைவு வந்தது. உடனே அதை அப்புறப்படுத்துமாறு உத்தரவிட்டார்கள். அவ்வாறே அது அப்புறப்படுத்தப்பட்டவுடன் தமது கையில் தண்ணீர் அள்ளி அந்த இடத்தில் தெளித்து விட்டார்கள். அன்று மாலை நேரமானதும் ஜிப்ரீல் (அலை) அவர்கள் வந்து அவர்களைச் சந்தித்தார்கள். அப்போது \"நீங்கள் நேற்றிரவு என்னிடம் வருவதாக வாக்களித்திருந்தீர்களே?\" என்று நபியவர்கள் கேட்டார்கள். அதற்கு ஜிப்ரீல் (அலை) அவர்கள் \"ஆம். ஆயினும், (வானவர்களாகிய) நாங்கள் நாயும் உருவப்படமும் உள்ள வீட்டில் நுழையமாட்டோம்\" என்று கூறினார்கள்.அன்றைய பொழுது புலர்ந்ததும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், நாய்களைக் கொல்லுமாறு கட்டளையிட்டார்கள். சிறிய தோட்டங்களில் உள்ள நாய்களைக் கொல்லுமாறும் கட்டளையிட்டார்கள். பெரிய தோட்டங்களில் உள்ள நாய்களை விட்டுவிட்டார்கள். (அவற்றைக் கொல்லுமாறு உத்தரவிடவில்லை.) அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5514,
			"arabicnumber": "2106.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நாயும் (உயிரினங்களின்) உருவப்படமும் உள்ள வீட்டில் (அருள்) வானவர்கள் நுழையமாட்டார்கள்.-இதை அபூதல்ஹா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5515,
			"arabicnumber": "2106.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5516,
			"arabicnumber": "2106.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5517,
			"arabicnumber": "2106.04",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தோழர் அபூதல்ஹா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உருவப்படம் உள்ள வீட்டில் (அருள்) வானவர்கள் நுழையமாட்டார்கள்\" என்று கூறினார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான புஸ்ர் பின் சயீத் (ரஹ்) அவர்கள் கூறுகிறார்கள்: (இந்த ஹதீஸை எனக்கு அறிவித்த) ஸைத் பின் காலித் அல்ஜுஹனீ (ரலி) அவர்கள் பின்னர் நோய்வாய்ப்பட்டபோது, அவர்களை உடல்நலம் விசாரிக்க நாங்கள் சென்றோம். அப்போது அவர்களது வீட்டுக் கதவில் உருவப்படம் உள்ள திரைச் சீலையொன்று தொங்கிக்கொண்டிருந்தது. நான் (இந்த ஹதீஸை ஸைத் (ரலி) அவர்கள் எனக்கு அறிவித்தபோது என்னுடனிருந்த) நபி (ஸல்) அவர்களின் துணைவியார் மைமூனா (ரலி) அவர்களின் மடியில் வளர்ந்த உபைதுல்லாஹ் அல்கவ்லானீ (ரஹ்) அவர்களிடம், \"உருவப்படங்களைப் பற்றி முன்பொரு நாள் ஸைத் (ரலி) அவர்கள் நமக்கு (ஒரு ஹதீஸ்) அறிவிக்கவில்லையா?\"என்று கேட்டேன். அதற்கு உபைதுல்லாஹ் (ரஹ்) அவர்கள், \"துணியில் வரையப்பட்ட (உயிரற்றவையின் உருவத்)தைத் தவிர என்று அவர்கள் சொன்னதை நீர் கேட்கவில்லையா?\" என்று கேட்டார்கள்.- இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5518,
			"arabicnumber": "2106.05",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (உயிரினங்களின்) உருவப்படம் உள்ள வீட்டில் (அருள்) வானவர்கள் நுழையமாட்டார்கள். இதை அபூதல்ஹா (ரலி) அவர்கள் அறிவிக்கிறார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) புஸ்ர் பின் சயீத் (ரஹ்) அவர்கள் கூறுகிறார்கள்: (இந்த ஹதீஸை எனக்கு அறிவித்த) ஸைத் பின் காலித் (ரலி) அவர்கள் நோய் வாய்ப்பட்டபோது, நாங்கள் அவர்களை உடல்நலம் விசாரிக்கச் சென்றோம். அங்கு அவர்களது வீட்டி(ன் வாசலி)ல் உருவப்படங்கள் உள்ள திரையை நாங்கள் கண்டோம். நான் (என்னுடனிருந்த) உபைதுல்லாஹ் அல் கவ்லானீ (ரஹ்) அவர்களிடம் \"உருவப் படங்களைப் பற்றி (முன்பு ஒரு நாள்) ஸைத் பின் காலித் (ரலி) அவர்கள் நமக்கு (ஒரு) ஹதீஸ் அறிவிக்கவில்லையா?\" என்று கேட்டேன். அதற்கு உபைதுல்லாஹ் (ரஹ்) அவர்கள், \"துணியில் வரையப்பட்ட (உயிரற்றவையின் படத்)தைத் தவிர என்று அவர்கள் சொன்னதை நீர் செவியேற்கவில்லையா?\" என்று கேட்டார்கள். நான் \"இல்லை\" என்றேன். அதற்கு உபைதுல்லாஹ் அல்கவ்லானீ (ரஹ்) அவர்கள், \"ஆம், அவ்வாறு சொல்லத்தான் செய்தார்கள்\" என்றார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5520,
			"arabicnumber": "2107.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5523,
			"arabicnumber": "2107.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5524,
			"arabicnumber": "2107.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5525,
			"arabicnumber": "2107.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5526,
			"arabicnumber": "2107.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5527,
			"arabicnumber": "2107.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5528,
			"arabicnumber": "2107.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5529,
			"arabicnumber": "2107.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5530,
			"arabicnumber": "2107.11",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5531,
			"arabicnumber": "2107.12",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5532,
			"arabicnumber": "2107.13",
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் (எனது வீட்டில்) உருவப்படங்கள் உள்ள திரைச் சீலையொன்றைத் தொங்க விட்டிருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வீட்டுக்கு) வந்தபோது, அதை அப்புறப்படுத்திவிட்டார்கள். அதை நான் துண்டித்து இரு தலையணை (இருக்கை)களாக ஆக்கிக்கொண்டேன். (இதை அப்துர் ரஹ்மான் பின் அல்காசிம் பின் முஹம்மத் (ரஹ்) அவர்கள் அறிவித்த) அந்த வேளையில், அங்கு அவையில் இருந்த பனூ ஸுஹ்ரா குலத்தாரின் முன்னாள் அடிமையான ரபீஆ பின் அதாஉ (ரஹ்) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவ்விரு தலையணைகளில் தலை சாய்த்துக்கொள்வார்கள் என ஆயிஷா (ரலி) அவர்கள் சொன்னதாக (உங்கள் தந்தை) அபூமுஹம்மத் காசிம் பின் முஹம்மத் (ரஹ்) அவர்கள் கூறியதை நீங்கள் செவியுற்றீர்களா?\" என்று கேட்டார். அதற்கு அப்துர் ரஹ்மான் பின் அல்காசிம் (ரஹ்) அவர்கள் \"இல்லை\" என்று பதிலளித்தார்கள். அந்த மனிதர், \"ஆயினும், காசிம் பின் முஹம்மத் (ரஹ்) அவர்கள் அவ்வாறு கூறியதை நான் செவியுற்றேன்\" என்று கூறினார். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5533,
			"arabicnumber": "2107.14",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நான் (உயிரினங்களின்) உருவப்படங்கள் உள்ள திண்டு ஒன்றை விலைக்கு வாங்கினேன். (வீட்டுக்கு வந்த) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அதைக் கண்டதும் வாசற்படியிலேயே நின்றுவிட்டார்கள்; உள்ளே வரவில்லை. அவர்களது முகத்தில் அதிருப்தியை \"நான் அறிந்துகொண்டேன்\". அல்லது \"அறியப்பட்டது\". உடனே நான், \"அல்லாஹ்வின் தூதரே! நான் அல்லாஹ்விடமும் அவனுடைய தூதரிடமும் மன்னிப்புக் கோருகிறேன். நான் என்ன குற்றம் செய்துவிட்டேன்?\" என்று கேட்டேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இந்தத் திண்டின் நிலை என்ன?\" என்று கேட்டார்கள். நான், \"இதில் தாங்கள் அமர்ந்துகொள்வதற்காகவும் தலை சாய்த்துக் கொள்வதற்காகவும் தங்களுக்காகவே இதை நான் விலைக்கு வாங்கினேன்\" என்றேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இந்த உருவப்படங்களை வரைந்தவர்கள் (மறுமை நாளில்) வேதனை செய்யப்படுவார்கள். மேலும், அவர்களிடம் \"நீங்கள் படைத்தவற்றுக்கு நீங்களே உயிர் கொடுங்கள்\" எனக் கூறப்படும்\" என்று சொல்லிவிட்டு, \"(உயிரினங்களின்) உருவப்படங்கள் உள்ள வீட்டில் (அருள்) வானவர்கள் நுழைவதில்லை\" என்று சொன்னார்கள். - மேற்கண்ட ஹதீஸ் ஆயிஷா (ரலி) அவர்களிடமிருந்தே மேலும் ஆறு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் சிலரது அறிவிப்பைவிட வேறுசிலரது அறிவிப்பு முழுமையானதாக உள்ளது. அவற்றில் அப்துல் அஸீஸ் பின் அப்தில்லாஹ் அல்மாஜிஷூன் (ரஹ்) அவர்களது அறிவிப்பில், \"அதை எடுத்து இரு தலையணைகளாக நான் ஆக்கிக்கொண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வீட்டில் இருக்கும்போது அவற்றில் தலை சாய்த்துக்கொள்வார்கள்\" என்று ஆயிஷா (ரலி) அவர்கள் கூறினார்கள் எனக் கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5534,
			"arabicnumber": "2107.15",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5535,
			"arabicnumber": "2108.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5536,
			"arabicnumber": "2108.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5537,
			"arabicnumber": "2109.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5538,
			"arabicnumber": "2109.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5546,
			"arabicnumber": "2113.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நாயும் மணியோசையும் உள்ள பயணிகளுடன் (அருள்) வானவர்கள் வரமாட்டார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5547,
			"arabicnumber": "2113.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5548,
			"arabicnumber": "2114",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5549,
			"arabicnumber": "2115",
			"text": "அபூபஷீர் கைஸ் பின் உபைத் அல்அன்சாரீ (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மேற்கொண்ட பயணமொன்றில் அவர்களுடன் இருந்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அறிவிப்பாளர் ஒருவரை அனுப்பி, \"எந்த ஒட்டகத்தின் கழுத்திலும் (கண்ணேறு கழிவதற்காகக் கட்டப்படுகின்ற) கயிற்று மாலையோ அல்லது வேறெந்த மாலையோ இருக்கக்கூடாது. இருந்தால் அவை துண்டிக்கப்பட வேண்டும்\" என்று அறிவிக்கச் செய்தார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) அப்துல்லாஹ் பின் அபீபக்ர் (ரஹ்) அவர்கள், \"அப்போது நபித்தோழர்கள் இரவில் ஓய்வெடுக்கும் இடங்களில் இருந்தார்கள்\" என்று அபூபஷீர் (ரலி) அவர்கள் (கூறியதாக அப்பாத் பின் தமீம் (ரஹ்) அவர்கள் என்னிடம்) சொன்னதாகவே நான் கருதுகிறேன். இதன் அறிவிப்பாளர்களில் ஒருவரான மாலிக் பின் அனஸ் (ரஹ்) அவர்கள் கூறுகிறார்கள்: கண் திருஷ்டிக்காக இவ்வாறு கட்டப்படுவதையே (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தடை செய்தார்கள் என) நான் கருதுகிறேன். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5550,
			"arabicnumber": "2116.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5551,
			"arabicnumber": "2116.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5552,
			"arabicnumber": "2117",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5553,
			"arabicnumber": "2118",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5554,
			"arabicnumber": "2119.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5555,
			"arabicnumber": "2119.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5558,
			"arabicnumber": "2119.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5559,
			"arabicnumber": "2120.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5560,
			"arabicnumber": "2120.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5561,
			"arabicnumber": "2120.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5562,
			"arabicnumber": "2120.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5563,
			"arabicnumber": "2121.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5564,
			"arabicnumber": "2121.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5565,
			"arabicnumber": "2122.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5566,
			"arabicnumber": "2122.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5567,
			"arabicnumber": "2122.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5568,
			"arabicnumber": "2123.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அன்சாரிகளில் ஒரு பெண் மணமுடித்தார். பின்னர் அவர் உடல் நலிவுற்றுவிடவே அவரது தலைமுடி கொட்டிவிட்டது. ஆகவே, (அவருடைய குடும்பத்தார்) அவருக்கு ஒட்டுமுடி வைத்துவிட விரும்பினர். எனவே, இது குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வினவினர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ஒட்டுமுடி வைத்துவிடுபவளையும் ஒட்டுமுடி வைத்துக்கொள்பவளையும் சபித்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5573,
			"arabicnumber": "2125.01",
			"text": "அல்கமா (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், \"பச்சை குத்திவிடும் பெண்கள், பச்சை குத்திக் கொள்ளும் பெண்கள், (அழகிற்காக) முகத்தில் முளைத்திருக்கும் முடிகளை அகற்றிவிடும் பெண்கள், முகத்தில் முளைத்திருக்கும் முடிகளை அகற்றக்கோரும் பெண்கள், அழகிற்காக அரத்தால் தேய்த்து, தம் முன்பற்களைப் பிரித்துக்கொள்ளும் பெண்கள், (ஆக) அல்லாஹ்வின் (இயற்கை) படைப்பு முறையை மாற்றிக்கொள்ளும் பெண்கள்மீது அல்லாஹ்வின் சாபம் உண்டாகட்டும்!\" என்று கூறினார்கள். இந்தச் செய்தி பனூ அசத் குலத்தைச் சேர்ந்த \"உம்மு யஅகூப்\" எனப்படும் ஒரு பெண்மணிக்கு எட்டியது. அந்தப் பெண் குர்ஆனை ஓதிய(றிந்த)வராக இருந்தார். அவர் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் வந்து, \"நீங்கள் பச்சை குத்திவிடும் பெண்கள், பச்சைக் குத்திக்கொள்ளும் பெண்கள், முகத்தில் முளைத்திருக்கும் முடிகளை அகற்றக்கோரும் பெண்கள், அழகிற்காக அரத்தால் தேய்த்து தம் முன்பற்களைப் பிரித்துக் கொள்ளும் பெண்கள், அல்லாஹ்வின் (இயற்கையான) படைப்பு முறையை மாற்றிக் கொள்ளும் பெண்களைச் சபித்ததாக எனக்கு எட்டிய செய்தி என்ன (அது உண்மையா)?\" என்று கேட்டார். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் யாரைச் சபித்தார்களோ அவர்களை நான் ஏன் சபிக்கக் கூடாது? அவர்கள் அல்லாஹ்வின் வேதத்திலும் சபிக்கப்பட்டுள்ளனரே?\" என்று கூறினார்கள். அதற்கு அந்தப் பெண், \"குர்ஆன் பிரதியில் இரு அட்டைகளுக்கிடையிலுள்ள அனைத்தையும் நான் வாசித்திருக்கிறேன். அதில் (தாங்கள் குறிப்பிட்டதை) நான் காணவில்லையே?\" என்று கேட்டார். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், \"நீ குர்ஆனை (சரியாக) வாசித்திருந்தால் அதில் (நான் கூறியதை) நீ கண்டிருப்பாய். வல்லமையும் மாண்பும் மிக்க அல்லாஹ் \"இறைத்தூதர் எதை உங்களுக்குக் கொடுத்தாரோ அதைப் பெற்றுக்கொள்ளுங்கள். அவர் எதிலிருந்து உங்களைத் தடுத்தாரோ அதிலிருந்து நீங்கள் விலகி இருங்கள்\" (59:7) என்று கூறுகின்றானா?\" என்றார்கள். அதற்கு அந்தப் பெண், \"இவற்றில் சிலவற்றை தற்போது உங்கள் மனைவியிடமே நான் காண்கிறேனே?\" என்று கேட்டார். அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், \"நீயே சென்று (என் மனைவியைப்) பார்\" என்று கூறினார்கள். அப்பெண் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களின் மனைவியிடம் சென்றார். ஆனால், எதையும் அவர் காணவில்லை. பிறகு அவர் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் (திரும்பி)வந்து \"எதையும் நான் காணவில்லை\" என்று சொன்னார். அப்போது அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், \"கவனி. அவ்வாறு (நீ கூறியபடி ஏதேனும் என் மனைவியிடம்) இருந்திருக்குமானால், அவளுடன் நாம் சேர்ந்து வாழமாட்டோம்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் (\"பச்சை குத்திவிடும் பெண்கள், பச்சை குத்திக்கொள்ளும் பெண்கள்\" என்பதைக் குறிக்க) சுஃப்யான் பின் உயைனா (ரஹ்) அவர்களது அறிவிப்பில் \"அல்வாஷி மாத்தி, வல் முஸ்தவ்ஷிமாத்\" எனும் சொற்றொடரும் முஃபள்ளல் (ரஹ்) அவர்களது அறிவிப்பில் \"அல்வாஷிமாத்தி வல்மவ்ஷூ மாத்தி\" எனும் சொற்றொடரும் ஆளப்பட்டுள்ளன. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் நபி (ஸல்) அவர்களின் கூற்று மட்டுமே இடம்பெற்றுள்ளது. உம்மு யஅகூப் தொடர்பான எந்தச் செய்தியும் இல்லை. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5574,
			"arabicnumber": "2125.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5575,
			"arabicnumber": "2125.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5576,
			"arabicnumber": "2125.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5577,
			"arabicnumber": "2126",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5578,
			"arabicnumber": "2127.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5579,
			"arabicnumber": "2127.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5580,
			"arabicnumber": "2127.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5581,
			"arabicnumber": "2127.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5582,
			"arabicnumber": "2128",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5583,
			"arabicnumber": "2129",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5584,
			"arabicnumber": "2130.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5585,
			"arabicnumber": "2130.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 193
			}
		}
	]
}