{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 384,
			"arabicnumber": "151.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5938,
			"arabicnumber": "2276",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், இஸ்மாயீல் (அலை) அவர்களின் வழித்தோன்றல்களில் \"கினானா\"வைத் தேர்ந்தெடுத்தான்; \"கினானா\"வின் வழித்தோன்றல்களில் குறைஷியரைத் தேர்ந்தெடுத்தான்; குறைஷியரிலிருந்து பனூ ஹாஷிம் குலத்தாரைத் தேர்ந்தெடுத்தான். பனூ ஹாஷிம் குலத்தாரிலிருந்து என்னைத் தேர்ந்தெடுத்தான். இதை வாஸிலா பின் அல்அஸ்கஉ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5939,
			"arabicnumber": "2277",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நான் மக்காவிலுள்ள கல் ஒன்றை அறிவேன். நான் நபியாக நியமிக்கப்படுவதற்கு முன் அது எனக்கு முகமன் (சலாம்) சொல்லி வந்தது. நிச்சயமாக இப்போதும் அதை நான் அறிவேன். இதை ஜாபிர் பின் சமுரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5940,
			"arabicnumber": "2278",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் ஆதமின் மக்கள் (மனிதர்கள்) அனைவருக்கும் தலைவன் நானே. முதன் முதலில் மண்ணறை பிளந்து (உயிர்த்து) எழுபவனும் நானே. முதன்முதலில் பரிந்துரை செய்பவனும் நானே. முதன்முதலில் பரிந்துரை ஏற்கப்படுபவனும் நானே. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5941,
			"arabicnumber": "2279.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நபி (ஸல்) அவர்கள் தண்ணீர் (பாத்திரத்தைக்) கொண்டுவரச் சொன்னபோது, (உட்பகுதி குறுகலான) வாயகன்ற (சிறிய) பாத்திரம் ஒன்று கொண்டுவரப்பட்டது. (நபி (ஸல்) அவர்கள் பாத்திரத்திற்குள் தம் விரல்களை நுழைத்தார்கள்.) மக்கள் அதிலிருந்து அங்கத் தூய்மை (உளூ) செய்யலாயினர். நான் எண்ணிக் கணக்கிட்டுப் பார்த்தேன். அவர்கள் அறுபதிலிருந்து எண்பது பேர் இருந்தனர். அப்போது நபி (ஸல்) அவர்களுடைய விரல் களுக்கிடையிலிருந்து தண்ணீர் சுரப்பதை நான் பார்க்கலானேன். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5942,
			"arabicnumber": "2279.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5943,
			"arabicnumber": "2279.03",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நபி (ஸல்) அவர்களும் அவர்களுடைய தோழர்களும் \"அஸ்ஸவ்ரா\" எனுமிடத்தில் இருந்தார்கள். (அஸ்ஸவ்ரா என்பது மதீனாவின் கடைத்தெருவுக்கும் மஸ்ஜிதுந் நபவீ பள்ளிவாசலுக்கும் அருகில் இருந்த ஓர் இடமாகும்.) அப்போது நபி (ஸல்) அவர்கள் (அங்கத் தூய்மை செய்வதற்காகப்) பாத்திரத்தைக் கொண்டுவரச் சொன்னார்கள். அதில் சிறிது தண்ணீர் இருந்தது. பிறகு அப்பாத்திரத்தினுள் தமது கையை வைத்தார்கள். அப்போது அவர்களுடைய விரல்களுக்கிடையிலிருந்து தண்ணீர் சுரக்கலாயிற்று. (அங்கிருந்த) நபித்தோழர்கள் அனைவரும் அதிலிருந்து அங்கத் தூய்மை (உளூ) செய்தனர். இந்த ஹதீஸின் அறிவிப்பாளரான கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் அனஸ் (ரலி) அவர்களிடம் \"அபூஹம்ஸா அவர்களே! அவர்கள் (மொத்தம்) எத்தனை பேர் இருந்தனர்?\" என்று கேட்டேன். அதற்கு அனஸ் (ரலி) அவர்கள் \"சுமார் முந்நூறு பேர் இருந்தனர்\" என்று பதிலளித்தார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5944,
			"arabicnumber": "2279.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5945,
			"arabicnumber": "2280",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: உம்மு மாலிக் அல்அன்சாரிய்யா (ரலி) அவர்கள், தமது நெய் பை ஒன்றில் நபி (ஸல்) அவர்களுக்கு நெய்யை அன்பளிப்பா(கக் கொடுத்தனுப்புவா)ர். பிறகு அவரிடம் அவருடைய மக்கள் வந்து (ரொட்டிக்காகக்) குழம்பு கேட்பார்கள். அப்போது அவர்களிடம் எதுவும் இருக்காது. உடனே உம்மு மாலிக் (ரலி) அவர்கள், நபி (ஸல்) அவர்களுக்கு நெய் கொடுத்தனுப்பும் (அந்தப் பையில் ஏதேனும் மீதி இருக்கும் என்று எண்ணி) அந்தப் பையை நோக்கிச் செல்வார்கள். அதில் நெய் இருக்கும். இவ்வாறே அவர் அந்தப் பையைப் பிழியும்வரை வீட்டுக்குத் தேவையான குழம்பு அதில் இருந்து கொண்டே இருந்தது. (இறுதியில் அந்தப் பையைப் பிழிந்தபோது நெய் இல்லாமற் போய்விட்டதால்) அவர் நபி (ஸல்) அவர்களிடம் வந்(து நடந்ததைத் தெரிவித்)தார். அப்போது நபி (ஸல்) அவர்கள், \"அந்தப் பையை நீ பிழிந்தாயா?\" என்று கேட்டார்கள். அவர் \"ஆம்\" என்று பதிலளித்தார். அப்போது நபி (ஸல்) அவர்கள், \"அதை அப்படியே நீ விட்டிருந்தால் அதில் எப்போதும் நெய் இருந்துகொண்டே இருந்திருக்கும்\" என்று சொன்னார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5946,
			"arabicnumber": "2281",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் வந்து உணவுப் பொருட்கள் வழங்குமாறு கோரினார். அவரது உணவுக்காக நபி (ஸல்) அவர்கள் அரை \"வஸ்க்\" தொலி நீக்கப்படாத கோதுமை வழங்கினார்கள். அதிலிருந்து அவரும் அவருடைய துணைவியும் அவர்களுடைய விருந்தினரும் உண்டுகொண்டே வந்தனர். இறுதியில் ஒரு நாள் அவர் அந்தக் கோதுமையை நிறுத்துப்பார்த்தார். (பிறகு அதிலிருந்த கோதுமை தீர்ந்துவிட்டது.) ஆகவே, அவர் நபி (ஸல்) அவர்களிடம் வந்(து நடந்ததைத் தெரிவித்)தார். அப்போது நபி (ஸல்) அவர்கள், \"அதை நீ நிறுத்துப் பார்த்திருக்காவிட்டால் அதிலிருந்து நீங்கள் சாப்பிட்டுக்கொண்டே இருந்திருப்பீர்கள். உங்களுக்காக அதில் எப்போதும் கோதுமை இருந்திருக்கும்\" என்று சொன்னார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5947,
			"arabicnumber": "706.03",
			"text": "முஆத் பின் ஜபல் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் \"தபூக்\" போரின்போது புறப்பட்டுச் சென்றோம். அப்போது அவர்கள் (இரு நேரத்) தொழுகைகளை (ஒரே நேரத்தில்) சேர்த்துத் தொழுதுவந்தார்கள்; லுஹ்ரையும் அஸ்ரையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள். மஃக்ரிபையும் இஷாவையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள். பின்பொரு நாள் தொழுகையைத் தாமதப்படுத்திவிட்டு, பிறகு வந்து லுஹ்ரையும் அஸ்ரையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள். பிறகு உள்ளே சென்றுவிட்டுப் பிறகு வந்து மஃக்ரிபையும் இஷாவையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள். பிறகு, \"அல்லாஹ் நாடினால், நாளை நீங்கள் தபூக் ஊற்றுக்குச் செல்வீர்கள். முற்பகலுக்கு முன் நீங்கள் அங்கு சென்றுவிடாதீர்கள். நான் வருவதற்குமுன் உங்களில் எவரும் அங்கு சென்றுவிட்டால், அங்குள்ள தண்ணீரில் கை வைத்துவிட வேண்டாம்\" என்று கூறினார்கள். அவ்வாறே நாங்கள் அங்கு சென்றோம். அப்போது இரு மனிதர்கள் எங்களை முந்திக்கொண்டு அந்த ஊற்றை நோக்கிச் சென்றனர். செருப்பு வார் அளவுக்கு அந்த ஊற்றில் தண்ணீர் சிறிதளவே சுரந்துகொண்டிருந்தது. பிறகு (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்துசேர்ந்தார்கள்.) அவர்கள் இருவரிடமும் \"அதன் தண்ணீரில் கை வைத்தீர்களா?\" என்று கேட்டார்கள். அவர்கள் இருவரும் \"ஆம்\" என்று பதிலளித்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவ்விருவரையும் கண்டித்தார்கள். அவர்கள் சொல்ல வேண்டுமென அல்லாஹ் நாடியதையெல்லாம் அவ்விருவரிடமும் சொன்னார்கள். பிறகு மக்கள் தம் கைகளால் அந்த ஊற்றிலிருந்து சிறிது சிறிதாகத் தண்ணீர் அள்ளி ஓரிடத்தில் சேர்த்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்தத் தண்ணீரில் தமது கையையும் முகத்தையும் கழுவி அந்த ஊற்றிலேயே அந்தத் தண்ணீரை விட்டார்கள். அப்போது ஊற்றிலிருந்து ஏராளமான தண்ணீர் \"பீறிட்டு\" அல்லது \"நிறைந்து\" ஓடியது. (அறிவிப்பாளர் அபூஅலீ (ரஹ்) அவர்களே இவ்வாறு ஐயத்துடன் அறிவிக்கிறார்கள்.) மக்கள் அனைவரும் தண்ணீர் அருந்தினர். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"முஆதே! (எனக்குப் பிறகு) நீங்கள் நீண்ட நாட்கள் வாழ்ந்தால்,இவ்விடத்தில் தோட்டங்கள், குடியிருப்புகள் ஆகியவை நிறைந்திருப்பதைக் காண்பீர்கள்\" என்று (முன்னறிவிப்பாகக்) கூறினார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5948,
			"arabicnumber": "1392.02",
			"text": "அபூஹுமைத் அஸ்ஸாஇதீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தபூக் போருக்குப் புறப்பட்டுச் சென்றோம். அப்பயணத்தில் நாங்கள் \"வாதில் குரா\" எனுமிடத்திலிருந்த ஒரு பெண்மணிக்குச் சொந்தமான ஒரு (பேரீச்சந்)தோட்டத்தை அடைந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"மரத்திலுள்ள கனிகளை மதிப்பிடுங்கள்\" என்று கூறினார்கள். அவ்வாறே நாங்கள் மதிப்பிட்டோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அதில் பத்து \"வஸ்க்\" கனிகள் இருப்பதாக மதிப்பிட்டார்கள். மேலும் அப்பெண்ணிடம், \"இன்ஷாஅல்லாஹ், நாங்கள் திரும்பி வருவதற்குள் இக்கனிகளை நீ எண்ணிவை\" என்று சொன்னார்கள். பிறகு நாங்கள் நடந்து தபூக்கிற்குச் சென்றோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இன்றிரவு உங்கள்மீது கடுமையான காற்று வீசும். அப்போது உங்களில் எவரும் எழுந்திருக்க வேண்டாம். உங்களில் ஒட்டகம் வைத்திருப்பவர் அதைக் கயிற்றால் கட்டிவைக்கட்டும்\" என்று கூறினார்கள். அவ்வாறே அன்றிரவு கடுங்காற்று வீசியது. அப்போது எங்களில் ஒருவர் எழுந்தார். அக்காற்று அவரைத் தூக்கிச் சென்று, \"தய்யி\" குலத்தாரின் (\"அஜா\" மற்றும் \"சல்மா\" ஆகிய) இரு மலைகளுக்கிடையே போட்டுவிட்டது. பின்னர் \"அய்லா\" நாட்டின் அரசர் இப்னுல் அல்மாவின் தூதுவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு கடிதத்துடன் வந்தார். மேலும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு (அய்லா அரசர் சார்பாக) வெள்ளைக் கோவேறு கழுதையொன்றையும் அன்பளிப்பாக வழங்கினார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அய்லா அரசருக்கு) பதில் கடிதம் எழுதினார்கள்; மேலும், போர்வையொன்றை அவருக்கு அன்பளிப்பாகக் கொடுத்த(னுப் பினா)ர்கள். பிறகு நாங்கள் திரும்பி \"வாதில் குரா\" சென்றடைந்தோம். அங்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்தப் பெண்ணிடம் அவளது தோட்டத்திலிருந்த பேரீச்சங்கனிகளைப் பற்றிக் கேட்டார்கள். \"அதில் எவ்வளவு கனிகள் உள்ளன?\" என்று கேட்டார்கள். அதற்கு அப்பெண் \"பத்து வஸ்க்குகள்\" என்று பதிலளித்தாள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், நான் விரைவாக (மதீனாவுக்குச்) செல்லப் போகிறேன். உங்களில் விரும்பியவர் என்னுடன் விரைவாக வரலாம்; விரும்பியவர் இங்கு தங்கியிருக்கலாம்\" என்று சொன்னார்கள். பிறகு நாங்கள் புறப்பட்டு மதீனா அருகில் வந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இது தாபா (தூய நகரம்);இதோ உஹுத் மலை; அது நம்மை நேசிக்கிறது; நாமும் அதை நேசிக்கிறோம்\" என்று கூறினார்கள். பிறகு \"அன்சாரிகளின் கிளைக் குடும்பங்களில் சிறந்தது \"பனுந் நஜ்ஜார்\" குடும்பமாகும். பிறகு \"பனூ அப்தில் அஷ்ஹல்\" குடும்பமாகும். பிறகு \"பனூ அப்தில் ஹாரிஸ் பின் அல்கஸ்ரஜ்\" குடும்பமாகும். பிறகு \"பனூ சாஇதா\"குடும்பமாகும். அன்சாரி கிளைக்குடும்பங்கள் ஒவ்வொன்றிலும் நன்மை உண்டு\" என்று சொன்னார்கள். பிறகு (பனூ சாஇதா குடும்பத்தைச் சேர்ந்த) சஅத் பின் உபாதா (ரலி) அவர்கள் எங்களிடம் வந்தார்கள். அப்போது அபூஉசைத் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்சாரி கிளைக் குடும்பங்கள் ஒவ்வொன்றிலும் நன்மை இருப்பதாகச் சொல்லிவிட்டு, (பனூ சாஇதா குடும்பத்தாரான) நம்மை இறுதியாகவே குறிப்பிட்டுள்ளதை நீங்கள் பார்க்க வில்லையா?\" என்று கேட்டார்கள். உடனே சஅத் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! அன்சாரி கிளைக்குடும்பங்கள் ஒவ்வொன்றிலும் நன்மை இருப்பதாகத் தாங்கள் குறிப்பிட்டுவிட்டு, இறுதியில் எங்களைக் குறிப்பிட்டுள்ளீர்களே?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீங்கள் மிகச் சிறந்(த குடும் பத்)தவர்களில் இடம்பெற்றிருப்பதே உங்களுக்குப் போதுமானதல்லவா?\" என்று கேட்டார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5949,
			"arabicnumber": "1392.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5950,
			"arabicnumber": "843.03",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் (\"தாத்துர் ரிகாஉ\" எனும்) போருக்காக \"நஜ்த்\" நோக்கிப் புறப்பட்டுச் சென்றோம். (போரை முடித்துக்கொண்டு திரும்பும் வழியில்) கருவேல முள்மரங்கள் நிறைந்த ஒரு பள்ளத்தாக்கில் இருந்தபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் வந்துசேர்ந்தார்கள். (மதிய ஓய்வு கொள்ளும் நண்பகல் நேரத்தில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு மரத்திற்குக் கீழே இறங்கி ஓய்வெடுத்தார்கள். அப்போது அவர்கள் தமது வாளை அந்த மரத்தின் கிளையொன்றில் தொங்கவிட்டார்கள். (ஆங்காங்கே இருந்த) மரங்களின் கீழே மக்கள் பிரிந்து சென்று, நிழல் பெற்று (ஓய்வெடுத்து)க்கொண்டிருந்தனர். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எங்களை அழைத்துக்) கூறினார்கள்: நான் உறங்கிக்கொண்டிருந்தபோது, ஒரு மனிதர் என்னிடம் வந்து (எனது) வாளை (தமது கையில்) எடுத்துக்கொண்டார். உடனே நான் விழித்துக்கொண்டேன். அப்போது அவர் என் தலைமாட்டில் நின்றிருந்தார். (உறையிலிருந்து) உருவப்பட்ட வாள் அவரது கையில் இருப்பதை உடனே உணர்ந்தேன். அப்போது அவர், \"என்னிடமிருந்து உன்னைக் காப்பவர் யார்?\" என்று என்னிடம் கேட்டார். நான், \"அல்லாஹ்\" என்று பதிலளித்தேன். பிறகு மீண்டும் அவர், \"என்னிடமிருந்து உன்னைக் காப்பவர் யார்?\" என்று கேட்டார். நான் \"அல்லாஹ்\" என்றேன். உடனே அவர் வாளை உறையிலிட்டுவிட்டார். இதோ அவர் இங்கே அமர்ந்திருக்கிறார். பிறகு அவர் விஷயத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தலையிடவில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5951,
			"arabicnumber": "843.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5952,
			"arabicnumber": "843.05",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5953,
			"arabicnumber": "2282",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் என்னை நல்வழியுடனும் ஞானத்துடனும் அனுப்பியுள்ளதற்கு உதாரணம், நிலத்தில் விழுந்த பெருமழையின் நிலையைப் போன்றதாகும். அவற்றில் சில நிலங்கள், நீரை ஏற்றுக்கொண்டு ஏராளமான புற்பூண்டுகளையும் செடிகொடிகளையும் முளைக்கச் செய்யும் நல்ல நிலங்களாகும். வேறுசில தண்ணீரைத் தேக்கி வைத்துக்கொள்ளும் தரிசு நிலங்களாகும். அதை இறைவன் மக்களுக்குப் பயன்படச்செய்தான். அதிலிருந்து மக்களும் அருந்தினர்; (தம் கால்நடைகளுக்கும்) புகட்டினர்; (பயிரிட்டுக் கால்நடைகளை) மேய்க்கவும் செய்தனர். அந்தப் பெருமழை இன்னொரு வகை நிலத்திலும் விழுந்தது. அது (ஒன்றுக்கும் உதவாத) வெறும் கட்டாந்தரை. அது தண்ணீரைத் தேக்கிவைத்துக்கொள்ளவும் இல்லை; புற்பூண்டுகளை முளைக்கச் செய்யவுமில்லை. இதுதான், இறைமார்க்கத்தில் விளக்கம் பெற்று, நான் கொண்டுவந்த தூதால் பயனடைந்து, கற்றுத் தெரிந்து பிறருக்கும் கற்றுக் கொடுத்தவருக்கும், நான் கொண்டுவந்த தூதை ஏறிட்டுப் பாராமலும் நான் கொண்டுவந்த அல்லாஹ்வின் நல்வழியை ஏற்றுக்கொள்ளாமலும் வாழ்கின்றவனுக்கும் உதாரணமாகும். இதை அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5954,
			"arabicnumber": "2283",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5955,
			"arabicnumber": "2284.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5956,
			"arabicnumber": "2284.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5957,
			"arabicnumber": "2284.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5958,
			"arabicnumber": "2285",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5959,
			"arabicnumber": "2286.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5960,
			"arabicnumber": "2286.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5961,
			"arabicnumber": "2286.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5962,
			"arabicnumber": "2286.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5963,
			"arabicnumber": "2287.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: எனது நிலையும் இதர இறைத்தூதர்களின் நிலையும் ஒரு வீட்டைக் கட்டிய மனிதரின் நிலையை ஒத்திருக்கிறது. அவர் ஒரு செங்கல் அளவிற்குள்ள இடத்தை மட்டும் விட்டுவிட்டு முழுமையாகவும் நிறைவாகவும் அந்த வீட்டைக் கட்டி முடித்தார். மக்கள் அதனுள் நுழைந்து (பார்வையிட்டுவிட்டு) வியப்படைந்து, \"இந்தச் செங்கல்லின் இடம் மட்டும் (காலியாக) இல்லாதிருந்தால் எவ்வளவு நன்றாயிருக்கும்!\" என்று கூறலாயினர். நானே அந்தச் செங்கல்லின் இடத்தில் இருக்கிறேன். நானே நபிமார்களில் இறுதியாக வந்தேன். - இதை ஜாபிர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் ஜாபிர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"முழுமையாகவும்\" என்பதற்குப் பகரமாக \"அழகாகவும்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5964,
			"arabicnumber": "2287.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5965,
			"arabicnumber": "2288",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: வல்லமையும் மாண்பும் உடைய அல்லாஹ் தன் அடியார்களில் ஒரு சமுதாயத்தாருக்கு அருள்புரிய நாடினால்,அதற்கு முன்னரே அதன் தூதரைக் கைப்பற்றி, அவரை அந்தச் சமுதாயத்தாருக்கு முன்பே சென்று (தக்க ஏற்பாடுகளுடன்) காத்திருக்கச் செய்கிறான். அல்லாஹ் ஒரு சமுதாயத்தாரை அழிக்க நாடினால், அந்தச் சமுதாயத்தாரின் தூதர் உயிருடனிருந்து பார்த்துக்கொண்டிருக்கும்போதே அச்சமுதாயத்தாரை வேதனைக்குள்ளாக்கி அழிக்கிறான். அவரை நம்ப மறுத்து அவரது கட்டளைக்கு மாறுசெய்யும்போது, அவர்களை அழிப்பதன் மூலம் அவரைக் கண் குளிர்ச்சி அடையச் செய்கிறான். இதை அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5966,
			"arabicnumber": "2289.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5967,
			"arabicnumber": "2289.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5969,
			"arabicnumber": "2291.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5970,
			"arabicnumber": "2291.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5972,
			"arabicnumber": "2293",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5973,
			"arabicnumber": "2294",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5974,
			"arabicnumber": "2295.01",
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: மக்கள் (\"அல்கவ்ஸர்\" எனும் சிறப்புத்) தடாகம் குறித்துக் கூறுவதை நான் கேள்விப் பட்டுவந்தேன். ஆனால், அதைப் பற்றி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து எதையும் நான் செவியுறவில்லை. இந்நிலையில் ஒரு நாள் என் அடிமைப் பெண் எனக்குத் தலைவாரிக்கொண்டிருந்தாள். அப்போது (பள்ளிவாசலின் சொற்பொழிவு மேடையிலிருந்து) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"மக்களே!\" என்று அழைத்தார்கள். உடனே நான் அந்த அடிமைப் பெண்ணிடம், \" என்னைவிட்டு (சிறிது) விலகிக்கொள்\" என்று சொன்னேன். அதற்கு அவள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஆண்களைத்தான் அழைத்தார்கள். பெண்களை அழைக்கவில்லை\" என்று சொன்னாள். அதற்கு நான் \"நானும் மக்களில் ஒருவரே\" என்றேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நான் (எனது \"அல்கவ்ஸர்\" எனும்) தடாகத்தினருகில் உங்களை எதிர்பார்த்துக் காத்திருப்பேன். அங்கு என்னிடம் வருவோருக்கு ஓர் எச்சரிக்கை! உங்களில் எவரும் வழி தவறிவந்த ஒட்டகம் விரட்டப்படுவதைப் போன்று (என்னை நெருங்கவிடாமல்) என்னிடமிருந்து விரட்டப்பட வேண்டாம். அப்போது நான், \"ஏன் இவ்வாறு (விரட்டுகிறீர்கள்)?\" என்று கேட்பேன். அதற்கு, \"உங்களுக்குப் பின்னால் இவர்கள் புதிது புதிதாக (மார்க்கத்தில்) எதையெல்லாம் உருவாக்கினார்கள் என்பது உங்களுக்குத் தெரியாது\" என்று சொல்லப்படும். அப்போது நான், \"தொலையட்டும்! (அவர்கள்)\" என்பேன். - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் உம்மு சலமா (ரலி) அவர்கள், \"நபி (ஸல்) அவர்கள் சொற்பொழிவு மேடை (மிம்பர்) மீதிருந்தபடி \"மக்களே!\"என்று கூறியதை நான் கேட்டேன். அப்போது நான் தலைவாரிக்கொண்டிருந்தேன். உடனே நான் எனக்குத் தலைவாரிவிட்டுக்கொண்டிருந்த அடிமைப் பெண்ணிடம், தலை முடியைச் சேர்த்து (கொண்டை போட்டு)விடு என்று சொன்னேன்\" என ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5975,
			"arabicnumber": "2295.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5976,
			"arabicnumber": "2296.01",
			"text": "உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு நாள் புறப்பட்டு வந்து இறந்தவர்களுக்காகத் தொழுவிப்பதைப் போன்று உஹுதுப் போர் உயிர்த் தியாகிகளுக்காகத் தொழுதார்கள். பிறகு சொற்பொழிவு மேடை (மிம்பரு)க்குத் திரும்பிவந்து \"உங்களுக்காக நிச்சயம் நான் (மறுமையில்) காத்திருப்பேன். உங்களுக்கு நான் சாட்சியும் ஆவேன். அல்லாஹ்வின் மீதாணையாக! நான் இப்போது (\"அல்கவ்ஸர்\" எனும்) என் தடாகத்தைக் காண்கிறேன். எனக்கு \"பூமியின் கருவூலத் திறவுகோல்கள்\" அல்லது \"பூமியின் திறவுகோல்கள்\" கொடுக்கப் பட்டுள்ளன. அல்லாஹ்வின் மீதாணையாக! எனக்குப் பின்னால் நீங்கள் (ஏக இறைவனுக்கு) இணை கற்பிப்பவர்களாக ஆகிவிடுவீர்களோ என்று நான் அஞ்சவில்லை. ஆனால், உலகச் செல்வங்களுக்காக நீங்கள் ஒருவரோடொருவர் போட்டியிட்டு (மோதி)க்கொள்வீர்களோ என்றுதான் அஞ்சுகிறேன்\" என்று சொன்னார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5977,
			"arabicnumber": "2296.02",
			"text": "உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உஹுதுப் போர் உயிர்த்தியாகிகளுக்காக (ஜனாஸாத் தொழுகை) தொழுவித்தார்கள். பிறகு சொற்பொழிவு மேடை (மிம்பர்) மீதேறி (உரை நிகழ்த்தி)னார்கள். அ(வ்வுரையான)து உயிரோடுள்ளவர்களிடமும் இறந்தவர்களிடமும் (மறுமைப் பயணத்திற்கு) விடைபெறுவது போலிருந்தது. அவ்வுரையில் அவர்கள், \"நான் (\"அல்கவ்ஸர்\" எனும் எனது) தடாகத்தினருகில் உங்களுக்(கு நீர் புகட்டுவதற்)காகக் காத்திருப்பேன். அத்தடாகத்தின் பரப்பளவு \"அய்லா\"விலிருந்து \"ஜுஹ்ஃபா\" வரையுள்ள தொலைதூரத்தைப் போன்றதாகும். எனக்குப் பின்னால் நீங்கள் இணைவைப்பவர்களாக ஆகிவிடுவீர்களோ என்று நான் அஞ்சவில்லை. ஆனால், உலகத்திற்காக நீங்கள் ஒருவரோடொருவர் போட்டியிட்டு, சண்டையிட்டுக்கொண்டு, உங்களுக்கு முன்னிருந்தோர் அழிந்ததைப் போன்று நீங்களும் அழிந்துவிடுவீர்களோ என்றே நான் அஞ்சுகிறேன்\" என்று சொன்னார்கள். இதுவே நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை இறுதியாகச் சொற்பொழிவு மேடை (மிம்பர்)மீது பார்த்த நிகழ்வாக அமைந்தது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5978,
			"arabicnumber": "2297.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5979,
			"arabicnumber": "2297.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5980,
			"arabicnumber": "2297.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5981,
			"arabicnumber": "2297.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5982,
			"arabicnumber": "2298.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5983,
			"arabicnumber": "2298.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5984,
			"arabicnumber": "2299.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5985,
			"arabicnumber": "2299.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5986,
			"arabicnumber": "2299.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5987,
			"arabicnumber": "2299.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5988,
			"arabicnumber": "2299.05",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5989,
			"arabicnumber": "2300",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5992,
			"arabicnumber": "2301.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5993,
			"arabicnumber": "2302.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நான் (\"அல்கவ்ஸர்\" எனும்) எனது தடாகத்தைவிட்டு, ஒட்டகங்களிடமிருந்து அந்நிய ஒட்டகங்களை விரட்டுவதைப் போன்று சில மனிதர்களை விரட்டுவேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5994,
			"arabicnumber": "2302.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6004,
			"arabicnumber": "2306.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6005,
			"arabicnumber": "2306.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6006,
			"arabicnumber": "2307.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6007,
			"arabicnumber": "2307.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6008,
			"arabicnumber": "2307.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6009,
			"arabicnumber": "2308.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6010,
			"arabicnumber": "2308.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6011,
			"arabicnumber": "2309.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குப் பத்து ஆண்டுகள் பணிவிடை செய்தேன். அல்லாஹ்வின் மீதாணையாக! அவர்கள் என்னை (மனம் வேதனைப்படும்படி) \"ச்சீ\" என்றோ \"இதை ஏன் செய்தாய்?\" என்றோ, \"நீ இப்படிச் செய்திருக்கக் கூடாதா?\" என்றோ எதற்காகவும் அவர்கள் (கடிந்து) சொன்னதில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் அபுர்ரபீஉ (ரஹ்) அவர்களது அறிவிப்பில் \"பணிவிடை செய்பவர் செய்ய வேண்டிய ஒரு செயலில் (\"ச்சீ\"என்றோ, \"இதை ஏன் செய்தாய்?\" என்றோ அவர்கள் கேட்டதில்லை)\" என்று கூடுதலாக இடம்பெற்றுள்ளது. மேலும், \"அல்லாஹ்வின் மீதாணையாக!\" எனும் குறிப்பு அதில் இல்லை. - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6012,
			"arabicnumber": "2309.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6013,
			"arabicnumber": "2309.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6014,
			"arabicnumber": "2309.04",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு ஒன்பது ஆண்டுகள் பணிவிடை செய்துள்ளேன். அவர்கள் ஒருபோதும் என்னிடம் \"இன்னின்னதை நீ ஏன் செய்தாய்?\" என்று கேட்டதாக எனக்குத் தெரியவில்லை; அவர்கள் எதற்காகவும் என்னை ஒருபோதும் குறை கூறியதுமில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6016,
			"arabicnumber": "2309.05",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6017,
			"arabicnumber": "2310.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6018,
			"arabicnumber": "2311.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6019,
			"arabicnumber": "2311.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6020,
			"arabicnumber": "2312.01",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் இஸ்லாத்தை முன்வைத்து எது கேட்கப் பட்டாலும் அவர்கள் அதைக் கொடுக்காமல் இருந்ததில்லை. இந்நிலையில் அவர்களிடம் ஒரு மனிதர் வந்து (கேட்டபோது), இரு மலைகளுக்கு இடையே இருக்கும் (அளவுக்கு அதிகமான) ஆடுகளை அவருக்கு வழங்கினார்கள். அந்த மனிதர் தம் சமுதாயத்தாரிடம் திரும்பிச் சென்று, \"என் மக்களே! நீங்கள் இஸ்லாத்தை ஏற்றுக் கொள்ளுங்கள். ஏனெனில், முஹம்மத் வறுமையை அஞ்சாமல் தாராளமாக நன்கொடைகள் வழங்குகிறார்\" என்று சொன்னார். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6021,
			"arabicnumber": "2312.02",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் (வந்து) இரு மலைகளுக்கிடையே இருக்கும் (அளவுக்கு அதிகமான) ஆடுகளை (நன்கொடையாகக்) கேட்டார். நபி (ஸல்) அவர்கள் அவற்றைக் கொடுத்தார்கள். அவர் தம் சமுதாயத்தாரிடம் சென்று, \"என் மக்களே! நீங்கள் இஸ்லாத்தை ஏற்றுக்கொள்ளுங்கள். அல்லாஹ்வின் மீதாணையாக! முஹம்மத் அவர்கள் வறுமையை அஞ்சாமல் தாராளமாக நன்கொடைகள் வழங்குகிறார்\" என்று கூறினார். ஒரு மனிதர் உலக ஆதாயத்திற்காக இஸ்லாத்தை ஏற்றிருந்தாலும், இஸ்லாத்தைத் தழுவிய சிறிது காலத்திற்குள் அவருக்கு இஸ்லாம் இந்த உலகத்தையும் அதிலிருப்பவற்றையும்விட மிகவும் உவப்பானதாக ஆகிவிடும். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6022,
			"arabicnumber": "2313",
			"text": "இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்கா வெற்றிப் போருக்குப் புறப்பட்டுச் சென்றார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்களுடனிருந்த முஸ்லிம்களும் புறப்பட்டுச் சென்று ஹுனைன் எனுமிடத்தில் (\"ஹவாஸின்\" குலத்தாருடன்) போரிட்டனர். அப்போது அல்லாஹ் தனது மார்க்கத்திற்கும் முஸ்லிம்களுக்கும் வெற்றியளித்தான். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்றைய தினத்தில் ஸஃப்வான் பின் உமய்யாவுக்கு (முதலில்) நூறு ஒட்டகங்கள் கொடுத்தார்கள். பிறகு இன்னும் நூறு ஒட்டகங்கள் கொடுத்தார்கள். பிறகு மேலும் நூறு ஒட்டகங்கள் கொடுத்தார்கள். (முந்நூறு ஒட்டகங்களைப் பெற்றுக்கொண்ட) ஸஃப்வான் பின் உமய்யா, \"அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அன்று தாராளமாக) எனக்கு வழங்கினார்கள். அப்போது அவர்கள் எனக்கு மக்களிலேயே மிகவும் வெறுப்பானவர்களாய் இருந்தார்கள். அவர்கள் எனக்கு நன்கொடைகள் வழங்கிக்கொண்டே வந்து மக்களிலேயே எனக்கு மிகவும் உவப்பானவர்களாய் ஆகிவிட்டார்கள்\" என்று கூறியதாக சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் என்னிடம் தெரிவித்தார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6023,
			"arabicnumber": "2314.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6024,
			"arabicnumber": "2314.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6025,
			"arabicnumber": "2315",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"எனக்கு இன்றிரவு ஓர் ஆண் குழந்தை பிறந்தது; அவனுக்கு நான் என் தந்தை இப்ராஹீம் (அலை) அவர்களின் பெயரைச் சூட்டினேன்\" என்று கூறிவிட்டு, அக்குழந்தையை அபூ சைஃப் எனப்படும் கொல்லரின் மனைவியான உம்மு சைஃப் எனும் பெண்மணியிடம் (பாலூட்டுவதற்காக) ஒப்படைத்தார்கள். பின்னர் (குழந்தைக்கு உடல்நலக்குறைவு என அறிந்து அதைப் பார்ப்பதற்காகக்) குழந்தையிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சென்ற போது அவர்களைப் பின்தொடர்ந்து நானும் சென்றேன். அபூசைஃபிடம் நாங்கள் சென்றடைந்த போது, அவர் தமது உலையை ஊதிக்கொண்டிருந்தார். வீடு முழுவதும் புகை நிரம்பியிருந்தது. நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு முன்பாக விரைவாகச் சென்று \"அபூசைஃபே! (உலையை ஊதுவதை) நிறுத்துங்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்துள்ளார்கள்\" என்றேன். உடனே அபூசைஃப் (உலையை ஊதுவதை) நிறுத்திவிட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குழந்தையை வாங்கித் தம்மோடு அணைத்துக்கொண்டுவிட்டு, (பிரார்த்தனைகளில்) அல்லாஹ் நாடிய சிலவற்றைச் சொன்னார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முன்னிலையில் குழந்தை (இப்ராஹீம்) மூச்சு வாங்கிக்கொண்டிருந்ததை நான் கண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் கண்கள் கண்ணீரைச் சொரிந்தன. அப்போது அவர்கள், \"கண் அழுகின்றது; உள்ளம் கவலைப்படுகின்றது. நம் இறைவன் விரும்புவதைத் தவிர வேறெதையும் நாம் கூறமாட்டோம். அல்லாஹ்வின் மீதாணையாக! இப்ராஹீமே! உம(து பிரிவு)க்காக நாம் கவலைப்படுகிறோம்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6026,
			"arabicnumber": "2316",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை விட அதிகமாகத் தம் குடும்பத்தாரை நேசிக்கும் ஒருவரை நான் பார்த்ததில்லை. (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் குழந்தை) இப்ராஹீம் மதீனாவின் மேட்டுப் பாங்கான கிராமப்பகுதியில் பாலூட்டி வளர்க்கப்பட்டு வந்தார். (அங்கிருந்த குழந்தையைப் பார்ப்பதற்காக) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செல்லும் போது அவர்களுடன் நாங்களும் செல்வோம். அவர்கள் வீட்டுக்குள் நுழைவார்கள். அப்போது வீட்டுக்குள் புகை மூட்டப்பட்டிருக்கும். குழந்தையின் பால்குடித் தந்தை (அபூசைஃப்) கொல்லராக இருந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குழந்தையை வாங்கி முத்தமிட்டுவிட்டுத் திரும்புவார்கள். இதன் அறிவிப்பாளரான அம்ர் பின் சயீத் (ரஹ்) அவர்கள் கூறுகிறார்கள்: குழந்தை இப்ராஹீம் இறந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இப்ராஹீம் என் புதல்வர். பால்குடிப் பருவத்திலேயே இறந்துவிட்டார். அவருக்கு அவரது பால்குடித் தவணையை முழுமையாக்கும் செவிலித் தாய்மார்கள் இருவர் சொர்க்கத்தில் இருக்கிறார்கள்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6027,
			"arabicnumber": "2317",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6028,
			"arabicnumber": "2318.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (தம் பேரர்) ஹசன் (ரலி) அவர்களை முத்தமிடுவதைக் கண்ட அக்ரஉ பின் ஹாபிஸ் (ரலி) அவர்கள், \"எனக்குப் பத்து குழந்தைகள் இருக்கிறார்கள். அவர்களில் எவரையும் நான் முத்தமிட்டதில்லை\" என்று சொன்னார்கள். அதற்கு நபி (ஸல்) அவர்கள், \"விஷயம் தெரியுமா? கருணை காட்டாதவன் கருணை காட்டப்படமாட்டான்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6029,
			"arabicnumber": "2318.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6030,
			"arabicnumber": "2319.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மக்கள்மீது கருணை காட்டாதவருக்கு அல்லாஹ் கருணை காட்டமாட்டான். இதை ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஏழு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடமிருந்தே மேலும் ஐந்து அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6031,
			"arabicnumber": "2319.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6032,
			"arabicnumber": "2320",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6033,
			"arabicnumber": "2321.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6034,
			"arabicnumber": "2321.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6035,
			"arabicnumber": "2322",
			"text": "சிமாக் பின் ஹர்ப் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஜாபிர் பின் சமுரா (ரலி) அவர்களிடம், \"நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது அவையில் அமர்ந்திருக்கிறீர்களா?\" என்று கேட்டேன். அதற்கு அவர்கள், \"ஆம்; அதிகமாகவே (அமர்ந்திருக்கிறேன்). அவர்கள் சுப்ஹுத் தொழுகையை முடித்தபின் சூரியன் உதயமாவதற்குமுன் தாம் தொழுத இடத்திலிருந்து எழுந்திருக்கமாட்டார்கள். சூரியன் உதயமான பின்பே (அங்கிருந்து) எழுவார்கள். அப்போது மக்கள் அறியாமைக் காலத்தில் நடந்த விஷயங்கள் பற்றிப் பேசிச் சிரித்துக்கொண்டிருப்பார்கள். (அதைக் கேட்டு) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் புன்னகைத்துக்கொண்டிருப்பார்கள்\" என்று கூறினார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6036,
			"arabicnumber": "2323.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6037,
			"arabicnumber": "2323.02",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: (ஒரு பயணத்தில்) நபி (ஸல்) அவர்கள் தம் துணைவியரிடம் வந்தார்கள். அப்போது \"அன்ஜஷா\" எனப்படும் ஒட்டகவோட்டி ஒருவர், துணைவியர் அமர்ந்திருந்த ஒட்டகங்களை (பாட்டுப்பாடி விரைவாக) ஓடச்செய்து கொண்டிருந்தார். அப்போது நபி (ஸல்) அவர்கள், \"உமக்குக் கேடுதான் அன்ஜஷா! நிதானமாக ஓட்டிச் செல். (ஒட்டகச் சிவிகைக்குள் இருக்கும்) கண்ணாடிக் குடுவைகளை (பெண்களை) உடைத்துவிடாதே\" என்று சொன்னார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான அபூகிலாபா (ரஹ்) அவர்கள் (இராக்வாசிகளிடம்), \"(இங்கு) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு வார்த்தையைக் கூறியுள்ளார்கள். அதையே உங்களில் ஒருவர் சொல்லியிருந்தால்,அதற்காக அவரை நீங்கள் நையாண்டி செய்திருப்பீர்கள்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6038,
			"arabicnumber": "2323.06",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: (என் தாயார்) உம்மு சுலைம் (ரலி) அவர்கள் நபி (ஸல்) அவர்களின் துணைவியருடன் (ஒரு பயணத்தில்) இருந்தார்கள். அப்போது அவர்கள் அமர்ந்திருந்த ஒட்டகங்களை ஒட்டகவோட்டி ஒருவர் (பாட்டுப்பாடி விரைவாக) ஓட்டிக்கொண்டிருந்தார். அப்போது நபி (ஸல்) அவர்கள் (அந்த ஒட்டகவோட்டியிடம்), \"அன்ஜஷா! மெதுவாக ஓட்டிச் செல். கண்ணாடிக் குடுவைகளை (பெண்களை) உடைத்துவிடாதே\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6039,
			"arabicnumber": "2323.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6040,
			"arabicnumber": "2323.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6041,
			"arabicnumber": "2323.05",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6042,
			"arabicnumber": "2324",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அதிகாலைத் தொழுகையை தொழுது முடித்ததும் மதீனாவின் பணியாளர்கள் தண்ணீருள்ள பாத்திரங்களைக் கொண்டுவருவார்கள். கொண்டுவரப்படும் ஒவ்வொரு பாத்திரத்தினுள்ளும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது கையை மூழ்கச் செய்வார்கள். சில வேளைகளில் குளிரான காலை நேரங்களிலும் அதைக் கொண்டு வருவார்கள். அப்போதும் அதனுள்ளே கையை மூழ்கச் செய்வார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6043,
			"arabicnumber": "2325",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6044,
			"arabicnumber": "2326",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6045,
			"arabicnumber": "2327.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6046,
			"arabicnumber": "2327.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6047,
			"arabicnumber": "2327.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6048,
			"arabicnumber": "2327.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6049,
			"arabicnumber": "2327.05",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6050,
			"arabicnumber": "2328.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6051,
			"arabicnumber": "2328.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6052,
			"arabicnumber": "2329",
			"text": "ஜாபிர் பின் சமுரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் முதல்தொழுகை (லுஹ்ர்) தொழுதேன். பிறகு அவர்கள் தம் வீட்டாரிடம் சென்றார்கள். அவர்களுடன் நானும் சென்றேன். அப்போது அவர்களுக்கு எதிரே சிறுவர்கள் சிலர் வந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அச்சிறுவர்களின் கன்னங்களை ஒவ்வொருவராகத் தடவினார்கள். என் கன்னங்களிலும் தடவினார்கள். அவர்களது கரத்திலிருந்து \"குளிர்ச்சியை\" அல்லது \"நறுமணத்தை\" நான் உணர்ந்தேன். அவர்கள் தமது கையை நறுமணப் பையிலிருந்து அப்போதுதான் எடுத்ததைப் போன்றிருந்தது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6053,
			"arabicnumber": "2330.01",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது (உடல்) வாசனையைவிட நறுமணமிக்க \"அம்பரை\"யோ கஸ்தூரியையோ வேறெந்த நறுமணப் பொருளையோ நுகர்ந்ததேயில்லை; அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் உள்ளங்கையைவிட மென்மையான அலங்காரப் பட்டையோ சாதாரணப் பட்டையோ நான் தொட்டதில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6054,
			"arabicnumber": "2330.02",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒளிரும் வெண்ணிறம் கொண்டவர்களாக இருந்தார்கள். அவர்களின் வியர்வைத் துளிகள் முத்துகளைப் போன்றிருந்தன. அவர்கள் நடந்தால் (பள்ளத்தில் இறங்குவதைப் போன்று முன்பக்கம்) சாய்ந்து நடப்பார்கள். அவர்களது உள்ளங்கையைவிட மென்மையான அலங்காரப் பட்டையோ சாதாரணப் பட்டையோ நான் தொட்டதில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது (உடல்) வாசனையைவிட சுகந்தமான கஸ்தூரியையோ \"அம்பரை\"யோ நான் நுகர்ந்ததேயில்லை. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6055,
			"arabicnumber": "2331.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், எங்களது வீட்டுக்கு வந்து மதிய ஓய்வெடுத்தார்கள். அப்போது அவர்களது உடலில் வியர்வை ஏற்பட்டது. என் தாயார் (உம்மு சுலைம் (ரலி)) அவர்கள் ஒரு கண்ணாடிக் குடுவையுடன் வந்து வியர்வைத் துளிகளை அந்தக் குடுவையில் சேகரிக்கலானார்கள். நபி (ஸல்) அவர்கள் உறக்கத்திலிருந்து விழித்தெழுந்து, \"உம்மு சுலைமே! என்ன செய்து கொண்டிருக்கிறாய்?\" என்று கேட்டார்கள். என் தாயார், \"இது தங்களது வியர்வை. இதை எங்கள் நறுமணப் பொருளில் சேர்க்கிறோம். இது நல்ல வாசனைப் பொருட்களில் ஒன்றாகும்\" என்று சொன்னார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6056,
			"arabicnumber": "2331.02",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (என் தாயார்) உம்மு சுலைம் (ரலி) அவர்களின் இல்லத்துக்கு வந்து, அங்கு உம்மு சுலைம் (படுத்து) இராதபோது அவர்களது விரிப்பில் படுத்து உறங்குவார்கள். ஒரு நாள் நபி (ஸல்) அவர்கள் வந்து உம்மு சுலைமின் விரிப்பில் படுத்துறங்கினார்கள். அப்போது அங்கு வந்த உம்மு சுலைம் (ரலி) அவர்களிடம், \"இதோ நபி (ஸல்) அவர்கள் உங்கள் வீட்டில் உங்கள் விரிப்பில் உறங்கிக் கொண்டிருக்கிறார்கள்\" என்று சொல்லப்பட்டது. உடனே உம்மு சுலைம் (ரலி) அவர்கள் வந்(து பார்த்)தார்கள். நபி (ஸல்) அவர்களுக்கு வியர்த்திருந்தது. அவர்களது வியர்வை, படுக்கையில் ஒரு துண்டுத் தோலில் திரண்டிருந்தது. உடனே உம்மு சுலைம், தமது நறுமணப் பெட்டியைத் திறந்து, அந்த வியர்வைத் துளிகளைத் துடைத்து தமது கண்ணாடிக் குடுவையொன்றில் அதைப் பிழிந்து சேகரிக்கலானார்கள். நபி (ஸல்) அவர்கள் திடுக்கிட்டு விழித்து, \"உம்மு சுலைமே! என்ன செய்கிறாய்?\" என்று கேட்டார்கள். அதற்கு அவர், \"அல்லாஹ்வின் தூதரே! அதன் வளத்தை எங்கள் குழந்தைகளுக்காக எதிர்பார்க்கிறோம். (அதனால் தான் அதைச் சேகரிக்கிறோம்)\" என்று கூறினார்கள். நபி (ஸல்) அவர்கள் \"நீ செய்தது சரிதான்\" என்று சொன்னார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6057,
			"arabicnumber": "2332",
			"text": "உம்மு சுலைம் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் எங்கள் வீட்டுக்கு மதிய ஓய்வெடுப்பதற்காக வருவார்கள். அப்போது அவர்களுக்காக நான் தோல் விரிப்பு ஒன்றை விரிப்பேன். அந்த விரிப்பில் நபி (ஸல்) அவர்கள் மதிய ஓய்வெடுப்பார்கள். நபி (ஸல்) அவர்களது உடலில் அதிகமாக வியர்வை ஏற்படும். அப்போது நான் அவர்களது வியர்வைத் துளிகளை எடுத்து வாசனைப் பொருட்களிலும் கண்ணாடிக் குடுவைகளிலும் சேகரிப்பேன். அப்போது நபி (ஸல்) அவர்கள், \"உம்மு சுலைமே! என்ன இது?\" என்று கேட்டார்கள். அதற்கு நான் \"தங்களது வியர்வைத் துளிகளை எனது நறுமணப் பொருளில் சேர்க்கிறேன்\"என்று கூறுவேன். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6058,
			"arabicnumber": "2333.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குக் குளிரான காலை நேரங்களிலும் வேத அறிவிப்பு (வஹீ) அருளப்படும். பிறகு (அவர்களை விட்டு அந்நிலை விலகும்போது) அவர்களது நெற்றியிலிருந்து வியர்வைத் துளிகள் வழியும். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6059,
			"arabicnumber": "2333.02",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஹாரிஸ் பின் ஹிஷாம் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம், \"தங்களுக்கு வேத அறிவிப்பு (வஹீ) எப்படி வருகின்றது?\" என்று கேட்டார். நபி (ஸல்) அவர்கள், \"சில நேரங்களில் மணியோசையைப் போன்று எனக்கு வேத அறிவிப்பு வரும். அவ்வாறு வருவது எனக்கு மிகவும் கடினமாக இருக்கும். பிறகு அச்செய்தியை நான் மனனமிட்டுக்கொண்ட நிலையில் அந்நிலை என்னை விட்டு விலகிவிடும். இன்னும் சில நேரங்களில், வானவர் ஒருவர் மனித உருவில் என்னிடம் வ(ந்து செய்திகளைத் த)ருவார். அவர் கூறுவதை நான் நினைவிலிருத்திக்கொள்வேன்\"என்று பதிலளித்தார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6060,
			"arabicnumber": "2334",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6061,
			"arabicnumber": "2335",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6062,
			"arabicnumber": "2336.01",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: வேதக்காரர்கள் (யூத, கிறித்தவர்கள்) தமது தலைமுடியை (வகிடெடுத்து வாரிவிடாமல் நெற்றியில்) தொங்கவிட்டுவந்தனர். இணைவைப்பாளர்கள் தம் தலைமுடியை வகிடெடுத்துப் பிரித்துவந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமக்கு இறைக்கட்டளை விதிக்கப்படாத விஷயங்களில் வேதக்காரர்களுக்கு ஒத்துப் போவதையே விரும்பி வந்தார்கள். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (முதலில்) முன்தலை முடியை நெற்றியில் தொங்கவிட்டுவந்தார்கள். பிற்காலத்தில் அதை வகிடெடுத்து (வாரி)விட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் இப்னுஅப்பாஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6063,
			"arabicnumber": "2336.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6064,
			"arabicnumber": "2337.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6065,
			"arabicnumber": "2337.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6066,
			"arabicnumber": "2337.03",
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களிலேயே மிக அழகான முகம் உடையவர்களாகவும் அழகான உருவ அமைப்புக் கொண்டவர்களாகவும் இருந்தார்கள். அவர்கள் ஒரேயடியாக உயரமானவராகவும் இருக்கவில்லை;குட்டையானவராகவும் இருக்கவில்லை. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6067,
			"arabicnumber": "2338.01",
			"text": "கத்தாதா (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது தலைமுடி எப்படி இருந்தது?\"என்று கேட்டேன். அதற்கு அவர்கள், \"அவர்களது தலைமுடி, அலையலையானதாக இருந்தது. சுருள் முடியாகவும் இல்லை; படிந்த முடியாகவும் இல்லை. அது அவர்களது காது மடல்களுக்கும் தோளுக்கும் இடையே தொங்கிக்கொண்டிருந்தது\" என்று பதிலளித்தார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6068,
			"arabicnumber": "2338.02",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது தலைமுடி (சில வேளைகளில்) அவர்களின் தோள்களைத் தொட்டுக்கொண்டிருந்தது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6069,
			"arabicnumber": "2338.03",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது தலைமுடி (சில வேளைகளில்) இரு காது மடல்களின் பாதிவரை இருந்தது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6070,
			"arabicnumber": "2339",
			"text": "ஷுஅபா (ரஹ்) அவர்கள் கூறியதாவது: \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் விசாலமான வாயும் விரிந்த கண்ணும் மெலிந்த குதிகால்களும் உடையவர்களாக இருந்தார்கள்\" என்று ஜாபிர் பின் சமுரா (ரலி) அவர்கள் கூறியதைத் தாம் கேட்டதாக சிமாக் பின் ஹர்ப் (ரஹ்) அவர்கள் தெரிவித்தார்கள். நான் சிமாக் (ரஹ்) அவர்களிடம், \"விசாலமான வாய் (\"ளலீஉல் ஃபம்\") என்றால் என்ன?\" என்று கேட்டேன். அவர்கள் \"பெரிய வாய்\" என்றார்கள். \"விரிந்த கண் (\"அஷ்கலுல் ஐன்\") என்றால் என்ன?\" என்று கேட்டதற்கு \"நீளமான கண் பிளவு\" என்றார்கள். \"மெலிந்த குதிகால்கள் (\"மன்ஹூசுல் அகிப்\") என்றால் என்ன?\" என்று கேட்டதற்கு, \"குதிகாலில் சிறிதளவு சதைப்பற்று காணப்படுவது\" என்று பதிலளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6071,
			"arabicnumber": "2340.01",
			"text": "சயீத் பின் இயாஸ் அல்ஜுரைரீ (ரஹ்) அவர்கள் கூறியதாவது: நான் அபுத்துஃபைல் (ரலி) அவர்களிடம், \"நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பார்த்திருக்கிறீர்களா?\"என்று கேட்டேன். அதற்கு அவர்கள், \"ஆம்; அவர்கள் வெண்ணிறம் கொண்டவர்களாகவும் களையான முகமுடையவராகவும் இருந்தார்கள்\" என்று பதிலளித்தார்கள். முஸ்லிம் பின் அல்ஹஜ்ஜாஜ் (ஆகிய நான்) கூறுகிறேன்: அபுத்துஃபைல் (ரலி) அவர்கள் (ஹிஜ்ரீ) நூறாம் ஆண்டில் இறந்தார்கள்; அவர்களே நபித்தோழர்களில் இறுதியாக இறந்தவர் ஆவார். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6072,
			"arabicnumber": "2340.02",
			"text": "சயீத் பின் இயாஸ் அல்ஜுரைரீ (ரஹ்) அவர்கள் கூறியதாவது: (நபித்தோழர்களில் இறுதியாக உயிர் வாழ்ந்த) அபுத்துஃபைல் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை நான் பார்த்திருக்கிறேன்; இந்தப் பூமியின்மீது அவர்களைப் பார்த்தவர் என்னைத் தவிர வேறெந்த மனிதரும் (இப்போது உயிருடன்) இல்லை\" என்று கூறினார்கள். அவர்களிடம் நான், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை எவ்வாறு கண்டீர்கள்?\" என்று கேட்டேன். அதற்கு, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெண்ணிறம் கொண்டவர்களாகவும் கலையான தோற்றமுடையவராகவும் நடுத்தரமான உடல்வாகு கொண்டவராகவும் இருந்தார்கள்\" என்று பதிலளித்தார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6073,
			"arabicnumber": "2341.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6074,
			"arabicnumber": "2341.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6075,
			"arabicnumber": "2341.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6076,
			"arabicnumber": "2341.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6077,
			"arabicnumber": "2341.05",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஒருவர் தம் தலையிலும் தாடியிலும் உள்ள நரைமுடிகளைப் பிடுங்குவது வெறுக்கப்பட்டதாகும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நரைமுடிக்குச்) சாயம் பூசியதில்லை. அவர்களது (கீழுதட்டின் அடியிலுள்ள) குறுந்தாடியிலும் நெற்றிப் பொட்டுகளிலுள்ள முடியிலும்தான் வெண்மை இருந்தது. தலையில் ஆங்காங்கே ஒரு சில முடிகளே நரைத்திருந்தன. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடரிலும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6078,
			"arabicnumber": "2341.06",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6079,
			"arabicnumber": "2341.07",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6080,
			"arabicnumber": "2342",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6081,
			"arabicnumber": "2343.01",
			"text": "அபூஜுஹைஃபா (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பார்த்திருக்கிறேன். அவர்கள் வெண்ணிறமுடையவர்களாகவும் முதுமை அடைந்தவர்களாகவும் இருந்தார்கள். (நபியவர்களின் பேரர்) ஹசன் பின் அலீ (ரலி) அவர்கள், நபி (ஸல்) அவர்களுக்கு (தோற்றத் தில்) ஒத்திருப்பார்கள். - மேற்கண்ட ஹதீஸ் அபூஜுஹைஃபா (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"வெண்ணிறமுடையவர்களாகவும் முதுமை அடைந்தவர்களாகவும் இருந்தார்கள்\" எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6082,
			"arabicnumber": "2343.02",
			"text": "அபூஇஸ்ஹாக் (ரஹ்) அவர்கள் கூறியதாவது: அபூஜுஹைஃபா (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது (முகத்தில்) இந்த இடத்தில் வெள்ளை முடி இருந்ததை நான் கண்டேன்\" என்று கூறினார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) ஸுஹைர் பின் முஆவியா (ரஹ்) அவர்கள் தமது விரல் ஒன்றைத் தமது கீழுதட்டிலுள்ள குறுந்தாடியின் மீது வைத்து சைகை செய்து காட்டினார்கள். அப்போது அவர்களிடம், \"அன்றைய தினம் நீங்கள் யாரைப் போன்று இருந்தீர்கள்? (அன்று உங்களுக்கு என்ன வயதிருக்கும்)?\" என்று கேட்கப்பட்டது. அதற்கு அபூஜுஹைஃபா (ரலி) அவர்கள், \"அப்போது நான் அம்புக்கு இறகு பொருத்துவேன். (இது போன்றவற்றைச் செய்யும் அளவுக்கு விவரமுடைய வயதுள்ளவனாக இருந்தேன்)\" என்று பதிலளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6083,
			"arabicnumber": "2344.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6084,
			"arabicnumber": "2344.02",
			"text": "சிமாக் பின் ஹர்ப் (ரஹ்) அவர்கள் கூறியதாவது: ஜாபிர் பின் சமுரா (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தலை மற்றும் தாடியின் முன்பகுதி பழுப்பேறி (வெண்மையாகி) இருந்தது. அவர்கள் தலைக்கு எண்ணெய் தேய்த்திருந்தால் அந்த வெண்மை தென்படாது. அவர்கள் (எண்ணெய் தேய்க்காமல்) பரட்டை தலையுடன் இருந்தால் அந்த வெண்மை தென்படும். அவர்களது தாடியில் அதிகமான முடிகள் இருந்தன\" என்று கூறினார்கள். அப்போது (அங்கிருந்த) ஒரு மனிதர், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது முகம் வாளைப் போன்று (மின்னிக்கொண்டு நீண்டதாக) இருந்ததா?\" என்று கேட்டார். ஜாபிர் பின் சமுரா (ரலி) அவர்கள் (அதை மறுத்து), \"இல்லை; அவர்களது முகம் சூரியனைப் போன்றும் சந்திரனைப் போன்றும் இருந்தது; வட்டமானதாக இருந்தது. அவர்களது முதுகில் தோள்பட்டை அருகில் நபித்துவ முத்திரையை நான் கண்டேன். அது புறா முட்டை போன்று அவர்களது உடலின் நிறத்திலேயே இருந்தது\" என்று கூறினார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6085,
			"arabicnumber": "2344.03",
			"text": "ஜாபிர் பின் சமுரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது முதுகில் (நபித்துவ) முத்திரை இருந்ததை நான் பார்த்தேன். அது புறா முட்டை போன்று இருந்தது. - மேற்கண்ட ஹதீஸ் ஜாபிர் பின் சமுரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6086,
			"arabicnumber": "2344.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6087,
			"arabicnumber": "2345",
			"text": "சாயிப் பின் யஸீத் (ரலி) அவர்கள் கூறியதாவது: என்னை என் தாயின் சகோதரி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அழைத்துச் சென்று, \"அல்லாஹ்வின் தூதரே! என் சகோதரி மகன் (பாதங்களில்) நோய் கண்டுள்ளான்\" என்று சொன்னார்கள். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அன்புடன்) என் தலையை வருடிக் கொடுத்து, என் வளத்திற்காகப் பிரார்த்தித்தார்கள். பின்னர் அங்கத் தூய்மை (உளூ) செய்தார்கள். அவர்கள் அங்கத் தூய்மை செய்(து மிச்சம் வைத்)த தண்ணீரில் நான் சிறிது குடித்தேன். பிறகு நான் அவர்களுடைய முதுகுக்குப் பின்னே நின்றேன். அப்போது அவர்களுடைய தோள்களுக்கிடையே இருந்த நபித்துவ முத்திரையை நான் பார்த்தேன். அது மணவறைத் திரையில் பொருத்தப்படுகின்ற பித்தானைப் போன்றிருந்தது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6088,
			"arabicnumber": "2346",
			"text": "ஆஸிம் பின் சுலைமான் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் சர்ஜிஸ் (ரலி) அவர்கள், \"நான் நபி (ஸல்) அவர்களைப் பார்த்தேன். அவர்களுடன் \"ரொட்டி இறைச்சி\" அல்லது \"தக்கடி உணவு\" சாப்பிட்டேன்\" என்று கூறினார்கள். அவர்களிடம் நான், \"உங்களுக்காக நபி (ஸல்) அவர்கள் பாவமன்னிப்பு வேண்டிப் பிரார்த்தித்தார்களா?\" என்று கேட்டேன். அதற்கு அப்துல்லாஹ் பின் சர்ஜிஸ் (ரலி) அவர்கள், \"ஆம்; உங்களுக்கும்தான் (பாவமன்னிப்பு வேண்டிப் பிரார்த்தித்தார்கள்)\" என்று கூறிவிட்டு, \"(நபியே!) உம்முடைய பாவத்திற்காகவும் இறைநம்பிக்கை கொண்ட ஆண்களுக்காகவும் பெண்களுக்காகவும் நீர் பாவமன்னிப்புக் கோருவீராக\" (47:19) எனும் இந்த வசனத்தை ஓதிக்காட்டினார்கள். மேலும் கூறினார்கள்: பிறகு நான் நபி (ஸல்) அவர்க(ளுடைய முதுகு)க்குப் பின்னே சுற்றிவந்தேன். அப்போது அவர்களுடைய இரு தோள்பட்டைகளுக்கிடையே இடப் பக்கத் தோளின் மேற்புறத்தில் கை முஷ்டியைப் போன்று (துருத்திக்கொண்டும்) கொப்புளங்களைப் போன்று தழும்பாகவும் உள்ள நபித்துவ முத்திரையைக் கண்டேன். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6089,
			"arabicnumber": "2347.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெளிப்படையாகத் தெரியும் அளவுக்கு மிக உயரமானவர்களாகவும் இல்லை;குட்டையானவர்களாகவும் இல்லை. சுத்த வெள்ளை நிறமுடையவர்களாகவும் இல்லை; மாநிறம் கொண்டவர்களாகவும் இல்லை; கடும் சுருள் முடியுடையவர்களாகவும் இல்லை; (தொங்கலான) படிந்த முடிவுடையவர்களாகவும் இல்லை. நாற்பதாவது வயதின் தொடக்கத்தில் அவர்களை அல்லாஹ் தன் தூதராக அனுப்பினான். அதன் பிறகு, அவர்கள் மக்கா நகரில் பத்து ஆண்டுகளும் மதீனா நகரில் பத்து ஆண்டுகளும் தங்கியிருந்தார்கள். அறுபதாம் வயதின் தொடக்கத்தில் அவர்களை இறைவன் இறக்கச் செய்தான். அப்போது அவர்களுடைய தலையிலும் தாடியிலும் இருபது வெள்ளை முடிகள்கூட இல்லை. - மேற்கண்ட ஹதீஸ் அனஸ் பின் மாலிக் (ரலி) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் \"அவர்கள் ஒளிரக்கூடியவர்களாக இருந்தார்கள்\" என்று கூடுதலாக இடம் பெற்றுள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6090,
			"arabicnumber": "2347.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6091,
			"arabicnumber": "2348",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6092,
			"arabicnumber": "2349.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6093,
			"arabicnumber": "2349.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6094,
			"arabicnumber": "2350.01",
			"text": "அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறியதாவது: நான் உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்களிடம், \"நபி (ஸல்) அவர்கள் (நபியாக்கப்பட்ட பின்னர்) மக்காவில் எத்தனை ஆண்டுகள் தங்கியிருந்தார்கள்?\" என்று கேட்டேன். அதற்கு அவர்கள் \"பத்து ஆண்டுகள்\" என்று பதிலளித்தார்கள். நான், \"ஆனால், பதிமூன்று ஆண்டுகள் தங்கியிருந்தார்கள் என்று இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறுகிறார்கள்\" என்று சொன்னேன். - அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறியதாவது: நான் உர்வா (ரஹ்) அவர்களிடம், \"நபி (ஸல்) அவர்கள் (நபியாக்கப்பட்ட பின்பு) மக்காவில் எத்தனை ஆண்டுகள் தங்கியிருந்தார்கள்?\" என்று கேட்டேன். அதற்கு அவர்கள், \"பத்து ஆண்டுகள்\" என்று பதிலளித்தார்கள். \"ஆனால்,பத்துக்கும் மேற்பட்ட ஆண்டுகள் தங்கியிருந்தார்கள் என்று இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறுகிறார்களே?\" என்று நான் கேட்டேன். அப்போது உர்வா (ரஹ்) அவர்கள், \"அவர்களை அல்லாஹ் மன்னிப்பானாக!\" என்று பாவ மன்னிப்பு வேண்டிப் பிரார்த்தித்துவிட்டு, \"இப்னு அப்பாஸ், அந்த (அபூகைஸ் என்ற) கவிஞரின் வரிகளிலிருந்தே அதை எடுத்துரைக்கிறார்\"என்று சொன்னார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6095,
			"arabicnumber": "2350.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6096,
			"arabicnumber": "2351.01",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்காவில் பதிமூன்று ஆண்டுகள் வாழ்ந்தார்கள். தமது அறுபத்து மூன்றாம் வயதில் இறந்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6097,
			"arabicnumber": "2351.02",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமக்கு வேதஅறிவிப்பு (வஹீ) அருளப்பட்டுக் கொண்டிருந்த நிலையில் மக்காவில் பத்தாண்டுகள் தங்கியிருந்தார்கள். (புலம் பெயர்ந்தபின்) மதீனாவில் பத்தாண்டுகள் இருந்தார்கள். தமது அறுபத்து மூன்றாம் வயதில் இறந்தார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6098,
			"arabicnumber": "2352.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6099,
			"arabicnumber": "2352.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6100,
			"arabicnumber": "2353.01",
			"text": "பனூ ஹாஷிம் குலத்தாரின் முன்னாள் அடிமையான அம்மார் (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறக்கும்போது அவர்களுக்கு எத்தனை வயது நடந்துகொண்டிருந்தது?\" என்று கேட்டேன். \"ஒரு கூட்டத்தில் உள்ள உம்மைப் போன்ற ஒருவருக்கு இந்த விவரம்கூட தெரியாமலிருக்கும் என்று நான் கருதவில்லை\" என்று இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறினார்கள். நான், \"இதைப் பற்றி மக்களிடம் நான் கேட்டு விட்டேன். ஆனால், அவர்கள் மாறுபட்ட கருத்தை என்னிடம் தெரிவித்தார்கள். ஆகவே, அதில் தங்களது கருத்தை அறிய விரும்பினேன்\" என்று சொன்னேன். உடனே இப்னு அப்பாஸ் (ரலி) அவர்கள், \"நீர் எண்ணிக் கணக்கிடுவாயா?\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். \"நாற்பது வயதிலிருந்து தொடங்குவீராக. நாற்பதாவது வயதில் அவர்கள் நபியாக அனுப்பப்பெற்றார்கள். பதினைந்து ஆண்டுகள் மக்காவில் (சில வேளை எதிரிகளைப் பற்றிய) பயமின்றியும் (சில வேளை) பயத்துடனும் இருந்தார்கள். மதீனாவிற்குப் புலம்பெயர்ந்ததிலிருந்து பத்தாண்டுகள் தங்கியிருந்தார்கள்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் இப்னு அப்பாஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6101,
			"arabicnumber": "2353.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6102,
			"arabicnumber": "2353.03",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது அறுபத்து ஐந்தாம் வயதில் இறந்தார்கள். - மேற்கண்ட ஹதீஸ் இப்னு அப்பாஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6103,
			"arabicnumber": "2353.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6104,
			"arabicnumber": "2353.05",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நபித்துவத்துக்குப்பின்) மக்காவில் பதினைந்து ஆண்டுகள் தங்கினார்கள். (அங்கு வானவர்) யாரையும் (நேரடியாகப்) பார்க்காமல் வெறும் (அசரீரி) சப்தத்தைக் கேட்டுக்கொண்டும் (வானவரின்) ஒளியைப் பார்த்துக்கொண்டும் ஏழு ஆண்டுகள் இருந்தார்கள். மேலும், எட்டு ஆண்டுகள் வேதஅறிவிப்பு (குர்ஆன்) அருளப்பட்டுக் கொண்டிருந்த நிலையில் இருந்தார்கள். (புலம்பெயர்ந்தபின்) மதீனாவில் பத்தாண்டுகள் தங்கியிருந்தார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6105,
			"arabicnumber": "2354.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நான் \"முஹம்மத்\" (புகழப்பட்டவர்) ஆவேன். நான் \"அஹ்மத்\" (இறைவனை அதிகமாகப் புகழ்பவர்) ஆவேன். நான் \"மாஹீ\" (அழிப்பவர்) ஆவேன்; என் மூலம் (ஏக) இறைமறுப்பு அழிக்கப்படுகிறது. நான் \"ஹாஷிர்\" (ஒன்றுதிரட்டுபவர்) ஆவேன்; மக்கள் எனக்குப் பின்னால் ஒன்றுதிரட்டப்படுவார்கள். நான் \"ஆகிப்\" (இறுதியானவர்) ஆவேன்; எனக்குப் பின் எந்த இறைத்தூதரும் இல்லை. இதை ஜுபைர் பின் முத்இம் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6106,
			"arabicnumber": "2354.02",
			"text": "ஜுபைர் பின் முத்இம் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"எனக்கு (ஐந்து) பெயர்கள் உள்ளன. நான் \"முஹம்மத்\" (புகழப்பட்டவர்) ஆவேன். நான் \"அஹ்மத்\" (இறைவனை அதிகமாகப் புகழ்பவர்) ஆவேன். நான் \"மாஹீ\" (அழிப்பவர்) ஆவேன்; என் மூலம் அல்லாஹ் (ஏக) இறைமறுப்பை அழிக்கின்றான். நான் \"ஹாஷிர்\" (ஒன்றுதிரட்டுபவர்) ஆவேன்; மக்கள் என் பாதங்களுக்குக் கீழே (என் தலைமையில்) ஒன்றுதிரட்டப்படுவார்கள். நான் \"ஆகிப்\" (இறுதியானவர்) ஆவேன்; எனக்குப் பிறகு வேறெந்த இறைத்தூதரும் இல்லை\" என்று கூறினார்கள். அவர்களுக்கு அல்லாஹ் \"ரஊஃப்\" (பேரன்புடையவர்) என்றும் \"ரஹீம்\" (இரக்கமுடையவர்) என்றும் பெயர் சூட்டியுள்ளான். - மேற்கண்ட ஹதீஸ் ஜுபைர் பின் முத்இம் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் உகைல் பின் காலித் (ரஹ்) அவர்களது அறிவிப்பில், \"நான் ஸுஹ்ரீ (ரஹ்) அவர்களிடம் \"ஆகிப்\" என்றால் என்ன? என்று கேட்டேன். அதற்கு அவர்கள் \"தமக்குப் பிறகு வேறெந்த இறைத்தூதரும் இல்லாதவர்\" என்று பதிலளித்தார்கள்\" என இடம்பெற்றுள்ளது. மஅமர், உகைல் (ரஹ்) ஆகியோரது அறிவிப்பில், \"(என் மூலம் ஏக இறை)மறுப்பாளர்களை (அல்லாஹ் அழிக்கிறான்)\"என்று இடம்பெற்றுள்ளது. ஷுஐப் (ரஹ்) அவர்களது அறிவிப்பில் \"இறைமறுப்பை (அழிக்கிறான்)\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6107,
			"arabicnumber": "2354.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6108,
			"arabicnumber": "2355",
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமக்குப் பல பெயர்கள் இருப்பதாகக் குறிப்பிட்டார்கள். \"நான் \"முஹம்மத்\" (புகழப்பட்டவர்), \"அஹ்மத்\" (இறைவனை அதிகமாகப் போற்றுபவர்), \"முகஃப்பீ\" (இறுதியானவர்), \"ஹாஷிர்\" (ஒன்றுதிரட்டுபவர்), \"நபிய்யுத் தவ்பா\" (பாவமன்னிப்புடன் வந்த தூதர்), \"நபிய்யுர் ரஹ்மத்\" (இரக்கத்துடன் நடந்துகொள்ளுமாறு போதிக்க வந்த தூதர்) ஆவேன்\" என்று கூறினார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6109,
			"arabicnumber": "2356.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6110,
			"arabicnumber": "2356.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6111,
			"arabicnumber": "2356.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6112,
			"arabicnumber": "2357",
			"text": "அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்கள் கூறியதாவது: மதீனாவாசிகள், தம் பேரீச்சந்தோப்புகளுக்கு நீர் பாய்ச்ச பயன்படுத்திவந்த \"ஷிராஜுல் ஹர்ரா\" எனும் கால்வாய் தொடர்பாக அன்சாரிகளில் ஒருவர் (என் தந்தை) ஸுபைர் பின் அல்அவ்வாம் (ரலி) அவர்களுடன் தகராறு செய்தார். அந்த அன்சாரித் தோழர், \"மடையைத் திறந்துவிடுங்கள்; தண்ணீர் பாயட்டும்!\" என்று சொன்னார். ஸுபைர் (ரலி) அவர்கள், (மடையைத் திறந்துவிட) மறுத்து விட்டார்கள். (இதையடுத்து) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வழக்கைக் கொண்டுசென்றனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஸுபைர் (ரலி) அவர்களிடம், \"ஸுபைரே! (உங்கள் தோப்புக்கு) நீர் பாய்ச்சிவிட்டு, பிறகு உங்கள் பக்கத்துத் தோப்புக்காரருக்குத் தண்ணீரைத் திறந்துவிடுங்கள்\" என்று சொன்னார்கள். உடனே அந்த அன்சாரித் தோழர் கோபம் கொண்டு, \"அவர் உங்கள் அத்தை மகன் என்பதாலா (அவர் முதலில் நீர் பாய்ச்சிக்கொண்டு, பிறகு எனக்குத் திறந்துவிடும்படி அவருக்குச் சாதகமாகத் தீர்ப்புக் கூறுகிறீர்கள்)?\" என்று கேட்டார். இதைக் கேட்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் முகம் (கோபத்தால்) நிறம் மாறிவிட்டது. அவர்கள் (என் தந்தையிடம்), \"ஸுபைரே! நீங்கள் உங்கள் மரங்களுக்கு நீர் பாய்ச்சுங்கள். பிறகு வரப்புகள் எட்டும்வரை தண்ணீரை (மடை கட்டி)த் தேக்கி நிறுத்தி விடுங்கள்\" என்று சொன்னார்கள். ஸுபைர் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் மீதாணையாக! \"உம்முடைய இறைவன் மீதாணையாக! அவர்கள் தமக்கிடையே ஏற்பட்ட வழக்கில் உம்மை நீதிபதியாக்கி, பின்னர் நீர் வழங்குகின்ற தீர்ப்பால் தம் உள்ளங்களில் அவர்கள் எந்த அதிருப்தியும் கொள்ளாமல் (அதற்கு) முழுமையாகக் கட்டுப்படாத வரை நம்பிக்கை கொண்டவர்களாக ஆகமாட்டார்கள்\" (4:65) எனும் இறைவசனம் இந்த விவகாரத்தில்தான் அருளப்பெற்றது என்று நான் எண்ணுகிறேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6113,
			"arabicnumber": "1337.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6114,
			"arabicnumber": "1337.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6115,
			"arabicnumber": "1337.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6116,
			"arabicnumber": "2358.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் முஸ்லிம்களுக்குத் தடை விதிக்கப்படாத ஒன்றைப் பற்றி (என்னிடம்) கேள்வி கேட்டு, அவர் கேள்வி கேட்ட காரணத்தாலேயே அது முஸ்லிம்களுக்குத் தடை செய்யப்பட்டு விடுமானால், அவர்தான் முஸ்லிம்களிலேயே முஸ்லிம்களுக்குப் பெரும் குற்றம் இழைத்தவர் ஆவார். இதை சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6117,
			"arabicnumber": "2358.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6118,
			"arabicnumber": "2358.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6119,
			"arabicnumber": "2359.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு, தம் தோழர்கள் (ஒன்றைக் குறித்து அதிருப்தியாகப்) பேசியது தொடர்பாகத் தகவல் கிடைத்தது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உரை நிகழ்த்தினார்கள். (அதில்) அவர்கள், \"(சற்று முன்னர்) எனக்குச் சொர்க்கமும் நரகமும் காட்டப்பட்டன. இந்த நாளைப் போன்று வேறெந்த நாளிலும் நல்லதையும் கெட்டதையும் நான் கண்டதேயில்லை. நான் அறிகின்றவற்றை நீங்கள் அறிந்தால், நீங்கள் குறைவாகச் சிரிப்பீர்கள்;அதிகமாக அழுவீர்கள்\" என்று குறிப்பிட்டார்கள். அதைவிட (மனவேதனை அளித்த) கடினமான ஒரு நாள் நபித்தோழர்களுக்கு வந்ததில்லை. அவர்கள் தம் முகங்களை மூடிக்கொண்டு சப்தமிட்டு அழுதனர். உடனே உமர் (ரலி) அவர்கள் எழுந்து, \"அல்லாஹ்வை (மட்டுமே) இறைவனாகவும் இஸ்லாத்தை மார்க்கமாகவும் முஹம்மத் (ஸல்) அவர்களை இறைத்தூதராகவும் நாங்கள் மனப்பூர்வமாக ஏற்றோம்\" என்று கூறினார்கள். அ(ங்கிரு)ந்த மனிதர் (ஒருவர்) எழுந்து, \"என் தந்தை யார்?\" என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இன்ன மனிதர்தான் உம்முடைய தந்தை\" என்று சொன்னார்கள். அப்போதுதான் \"இறைநம்பிக்கை கொண்டோரே! நீங்கள் சில விஷயங்கள் குறித்துக் கேள்வி எழுப்பாதீர்கள். அவை உங்களுக்கு வெளிப்படுத்தப்பட்டால் உங்களுக்கு வருத்தம் தரும்\" (5:101) எனும் இறைவசனம் அருளப்பெற்றது. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6120,
			"arabicnumber": "2359.02",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர், \"அல்லாஹ்வின் தூதரே! என் தந்தை யார்?\" என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இன்ன மனிதர்தான் உம்முடைய தந்தை\" என்று கூறினார்கள். மேலும், (அதையொட்டியே) \"இறைநம்பிக்கை கொண்டோரே! நீங்கள் சில விஷயங்கள் குறித்துக் கேள்வி எழுப்பாதீர்கள். அவை உங்களுக்கு வெளிப்படுத்தப்பட்டால் உங்களுக்கு வருத்தம் தரும்\" (5:101) எனும் இறைவசனம் முழுமையாக அருளப்பெற்றது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6121,
			"arabicnumber": "2359.03",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) சூரியன் (நடுவானிலிருந்து) சாய்ந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தமது இல்லத்திலிருந்து) புறப்பட்டு வந்து மக்களுக்கு லுஹர் தொழுகை தொழுவித்தார்கள். (தொழுகை முடிந்து) சலாம் கொடுத்ததும் சொற்பொழிவு மேடை (மிம்பர்) மீதேறி யுக முடிவு நாள் பற்றிக் குறிப்பிட்டார்கள். அந்த நாளுக்கு முன்பாக பயங்கரமான சம்பவங்கள் பல நிகழும் என்றும் குறிப்பிட்டார்கள். பிறகு \"எதைப் பற்றியேனும் யாரேனும் என்னிடம் கேட்க விரும்பினால் அவர் என்னிடம் கேட்கலாம். அல்லாஹ்வின் மீதாணையாக! இந்த இடத்தில் நான் இருக்கும்வரை நீங்கள் எதைப் பற்றிக் கேட்டாலும் அதைப் பற்றி உங்களுக்கு நான் தெரிவிக்காமலிருக்கமாட்டேன்\" என்றும் சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இவ்வாறு கூறியதைக் கேட்டு மக்கள் அதிகமாக அழுதனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"கேளுங்கள் என்னிடம்\" என்று அடிக்கடி சொல்லிக்கொண்டிருந்தார்கள். அப்போது அப்துல்லாஹ் பின் ஹுதாஃபா (ரலி) அவர்கள் எழுந்து, \"என் தந்தை, யார்?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"உம்முடைய தந்தை ஹுதாஃபாதான்\" என்று கூறிவிட்டு, \"கேளுங்கள் என்னிடம்\" எனத் திரும்பத் திரும்பச் சொன்னார்கள். (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் இந்நிலையைக் கண்ட) உமர் (ரலி) அவர்கள் மண்டியிட்டு அமர்ந்து, \"அல்லாஹ்வை இறைவனாகவும் இஸ்லாத்தை மார்க்கமாகவும் முஹம்மத் (ஸல்) அவர்களை இறைத்தூதர் எனவும் நாங்கள் மனப்பூர்வமாக ஏற்றோம்\" என்று கூறினார்கள். இவ்வாறு உமர் (ரலி) அவர்கள் கூறியபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மௌனமானார்கள். பின்னர், \"(நீங்கள் விரும்பாதவை நிகழும் நாள்) நெருங்கிவிட்டது. முஹம்மதின் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! சற்று முன்னர் (நான் தொழுதுகொண்டிருந்தபோது) இந்தச் சுவரி(ன் திசையி)ல் எனக்குச் சொர்க்கமும் நரகமும் காட்டப்பட்டன. இந்த நாளைப் போன்று (வேறெந்த நாளிலும்) நல்லதையும் கெட்டதையும் நான் கண்டதேயில்லை\" என்று சொன்னார்கள். உபைதுல்லாஹ் பின் அப்தில்லாஹ் பின் உத்பா (ரஹ்) அவர்கள் தம்மிடம் கூறியதாக இதன் அறிவிப்பாளர்களில் ஒருவரான இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் பின் வருமாறு கூறுகிறார்கள்: அப்துல்லாஹ் பின் ஹுதாஃபா (ரலி) அவர்கள் (தம் தந்தை யார் என்று வினவியதால் அவருடைய) தாயார்,அப்துல்லாஹ் பின் ஹுதாஃபா (ரலி) அவர்களிடம், \"உன்னைவிட பெற்ற தாயைப் புண்படுத்திய ஒரு மகனைப் பற்றி ஒருபோதும் நான் கேள்விப்பட்டதேயில்லை. அறியாமைக் காலப்பெண்கள் செய்யும் பாவச்செயல்களில் ஒன்றை உன் தாயும் செய்திருக்க, அவளை நீ மக்கள்முன் அம்பலப்படுத்தினால் (அவளுக்கு அவமானம் ஏற்படாது என) நீ அச்சமற்று இருப்பாயா?\" என்று கேட்டார்கள். அதற்கு அப்துல்லாஹ் பின் ஹுதாஃபா (ரலி) அவர்கள், \"அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னை ஒரு கறுப்பு அடிமையுடன் இணைத்து (அவர்தான் உன் தந்தை என்று) கூறியிருந்தாலும் நிச்சயமாக அவரோடு என்னை நான் இணைத்துக்கொண்டிருப்பேன். (அவருடைய பிள்ளை என்று என்னைப் பற்றிச் சொல்லிக் கொள்ளவே செய்வேன்)\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6122,
			"arabicnumber": "2359.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6123,
			"arabicnumber": "2359.05",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6124,
			"arabicnumber": "2359.06",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6125,
			"arabicnumber": "2360",
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்குப் பிடிக்காத சில விஷயங்கள் குறித்து அவர்களிடம் வினவப்பட்டது. இவ்வாறு அதிகமாக வினவப்பட்ட போது நபி (ஸல்) அவர்கள் கோபமடைந்து விட்டார்கள். பிறகு மக்களிடம், \"நீங்கள் விரும்பிய எதைப் பற்றி வேண்டுமானாலும் என்னிடம் கேளுங்கள்\" என்று சொன்னார்கள். அப்போது ஒரு மனிதர் \"என் தந்தை யார்?\" என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், \"உம்முடைய தந்தை ஹுதாஃபா தான்\" என்று கூறினார்கள். மற்றொருவர் எழுந்து, \"அல்லாஹ்வின் தூதரே! என் தந்தை யார்?\" என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், \"ஷைபாவின் முன்னாள் அடிமையாயிருந்த சாலிம்தான் உம்முடைய தந்தை\"என்று சொன்னார்கள். (இக்கேள்வியால்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது முகத்தில் தென்பட்ட கோபத்தைக் கண்ட உமர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! நாங்கள் அல்லாஹ்விடம் பாவமன்னிப்புக் கோருகிறோம்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6126,
			"arabicnumber": "2361",
			"text": "தல்ஹா பின் உபைதில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: பேரீச்ச மரங்களின் உச்சியில் இருந்து கொண்டிருந்த (மதீனாவாசிகள்) சிலரைக் கடந்து சென்ற அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் நானும் சென்றேன். அப்போது, \"இவர்கள் என்ன செய்துகொண்டிருக்கிறார்கள்?\" என்று கேட்டார்கள். அதற்கு மக்கள், \"பெண் மரங்களுடன் ஆண் மரங்களை இணைத்து ஒட்டுச் சேர்க்கை செய்து (பெண் மரங்களை) சூல் கொள்ளச் செய்கின்றனர்\" என்று கூறினர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதனால் பயனேதும் ஏற்படும் என்று நான் கருதவில்லை\" என்று சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இவ்வாறு கூறியதைப் பற்றி (மதீனா விவசாயிகளிடம்) தெரிவிக்கப்பட்டபோது,அவர்கள் ஒட்டுச் சேர்க்கை செய்வதை விட்டுவிட்டனர். (அந்த ஆண்டில் அவர்களுக்கு மகசூல் பாதிக்கப்பட்டது.) இது குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தெரிவிக்கப்பட்டது. அப்போது, \"அ(வ்வாறு செய்வ)தனால் அவர்களுக்குப் பயன் ஏற்படுமானால் அவ்வாறு செய்து கொள்ளட்டும். நான் எனது யூகத்தையே தெரிவித்தேன். யூகத்தை தெரிவித்ததை வைத்து என்மீது குற்றம் சாட்டாதீர்கள். ஆயினும், நான் உங்களிடம் அல்லாஹ்வைப் பற்றி ஏதேனும் சொன்னால் அதை நீங்கள் கடைப்பிடியுங்கள். ஏனெனில், நான் வல்லமையும் மாண்பும் உடைய அல்லாஹ்வைப் பற்றி பொய்யுரைக்கமாட்டேன்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6127,
			"arabicnumber": "2362",
			"text": "ராஃபிஉ பின் கதீஜ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மதீனாவுக்கு வந்த போது மதீனாவாசிகள் பேரீச்ச மரங்களை ஒட்டுச் சேர்க்கை செய்துகொண்டிருந்தனர். தாங்கள் பேரீச்ச மரங்களை சூல் கொள்ளச் செய்வதாக அவர்கள் கூறினர். நபி (ஸல்) அவர்கள், \"நீங்கள் என்ன செய்துகொண்டிருக்கிறீர்கள்?\" என்று கேட்டார்கள். மக்கள் \"(வழக்கமாக) இவ்வாறே நாங்கள் செய்துவருகிறோம்\" என்று கூறினர். நபி (ஸல்) அவர்கள், \"நீங்கள் இவ்வாறு செய்யாவிட்டால் நன்றாயிருந்திருக்கலாம்\" என்று சொன்னார்கள். ஆகவே, அவர்கள் அ(வ்வாறு செய்வ)தை விட்டுவிட்டனர். அந்த வருடத்தில் கனிகள் \"உதிர்ந்துவிட்டன\" அல்லது \"குறைந்து விட்டன\". அதைப் பற்றி மக்கள் நபி (ஸல்) அவர்களிடம் தெரிவித்தனர். அப்போது அவர்கள், \"நான் ஒரு மனிதனே; உங்கள் மார்க்க விஷயத்தில் நான் உங்களுக்கு ஏதேனும் கட்டளையிட்டால் அதை நீங்கள் கடைப்பிடியுங்கள். (உலக விவகாரத்தில்) சொந்தக் கருத்தாக உங்களுக்கு நான் ஏதேனும் கட்டளையிட்டால் நானும் ஒரு மனிதனே\" என்று சொன்னார்கள். (இவ்வாறே சொன்னார்கள்) அல்லது இதைப் போன்று சொன்னார்கள் என அறிவிப்பாளர் இக்ரிமா (ரஹ்) அவர்கள் அறிவித்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் அஹ்மத் பின் ஜஅஃபர் அல்மஅகரீ (ரஹ்) அவர்களது அறிவிப்பில், \"ஆகவே, (அந்த ஆண்டில்) கனிகள் உதிர்ந்துவிட்டன\" என்று ஐயப்பாடின்றி உறுதியாக இடம்பெற்றுள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6128,
			"arabicnumber": "2363",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பேரீச்ச மரங்களுக்கு மகரந்தச் சேர்க்கை செய்துகொண்டிருந்த மக்களைக் கடந்து சென்றார்கள். அப்போது, \"நீங்கள் (இவ்வாறு) செய்யாமலிருந்தால் நன்றாயிருக்குமே!\" என்று சொன்னார்கள். ஆகவே, (அவர்கள் மகரந்தச் சேர்க்கை செய்வதை விட்டுவிட்டனர். அதனால் அந்த மகசூலில்) நன்றாகக் கனியாத தாழ்ந்த ரகக் காய்களே காய்த்தன. அப்போது அவர்களைக் கடந்து நபி (ஸல்) அவர்கள் சென்றபோது, \"உங்கள் (பேரீச்ச) மரங்களுக்கு என்ன நேர்ந்தது?\"என்று கேட்டார்கள். மக்கள், \"நீங்கள் இப்படி இப்படிச் சொன்னீர்கள். (அதனால் நாங்கள் மகரந்தச் சேர்க்கை செய்வதை விட்டுவிட்டோம். அதனால் இந்த நிலை ஏற்பட்டுவிட்டது)\" என்று கூறினர். நபி (ஸல்) அவர்கள், \"உங்கள் உலக விவகாரங்கள் பற்றி (என்னைவிட) நீங்களே நன்கு அறிந்தவர்கள்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. இதே ஹதீஸ் ஆயிஷா (ரலி) அவர்கள் வழியாகவும் மேலும் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6129,
			"arabicnumber": "2364",
			"text": "ஹம்மாம் பின் முனப்பிஹ் (ரஹ்) அவர்கள் கூறியதாவது: இவை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து அபூஹுரைரா (ரலி) அவர்கள் எமக்கு அறிவித்த ஹதீஸ்களாகும். அவற்றில் பின்வரும் ஹதீஸும் ஒன்றாகும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: முஹம்மதின் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! நிச்சயமாக உங்களிடம் ஒரு நாள் வரும். (அன்று) என்னை நீங்கள் காண இயலாது. (நான் இறந்துபோயிருப்பேன்.) ஆனால், உங்களில் ஒருவர் (அன்று சிறிது நேரம்) என்னைப் பார்ப்ப(தற்கு வாய்ப்புக் கிடைப்ப)தானது, அவருடைய குடும்பத்தாரையும் செல்வங்கள் அனைத்தையும்விட அவருக்கு மிகவும் விருப்பமானதாக இருக்கும். அபூஇஸ்ஹாக் (ரஹ்) அவர்கள் கூறுகிறார்கள்: என்னைப் பொறுத்தவரை இந்த ஹதீஸின் பொருளாவது: அவர்களுடன் என்னையும் அவர் பார்ப்பதானது, அவருடைய குடும்பத்தாரையும் செல்வங்களையும்விட அவருக்கு மிகவும் விருப்பமானதாக இருக்கும். இந்த ஹதீஸின் வாசகங்கள், முன் பின்னாக இடம்பெற்றுள்ளது என்பதே என் கருத்தாகும். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6130,
			"arabicnumber": "2365.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6131,
			"arabicnumber": "2365.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6132,
			"arabicnumber": "2365.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6133,
			"arabicnumber": "2366.01",
			"text": "சயீத் பின் அல்முசய்யப் (ரஹ்) அவர்கள் கூறியதாவது: \"(புதிதாகப்) பிறக்கும் குழந்தை எதுவாயினும் அதை ஷைத்தான் தீண்டாமல் இருப்பதில்லை. ஷைத்தான் தீண்டுவதால் குழந்தை வீறிட்டழுகிறது; மர்யமின் புதல்வரையும் அவருடைய தாயார் மர்யமையும் தவிர\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாக அபூஹுரைரா (ரலி) அவர்கள் சொன்னார்கள். பிறகு அபூஹுரைரா (ரலி) அவர்கள், \"நீங்கள் விரும்பினால், \"இந்தக் குழந்தையையும் இதன் வழித்தோன்றல்களையும் விரட்டப்பட்ட ஷைத்தானிடமிருந்து பாதுகாக்குமாறு உன்னிடம் நான் கோருகிறேன் (என இம்ரானின் துணைவியார் இறைவனை வேண்டினார்)\" (3:36) எனும் இறைவசனத்தை ஓதிக் கொள்ளுங்கள்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"குழந்தை பிறக்கும்போதே ஷைத்தான் அதைத் தீண்டுகிறான். ஷைத்தான் தீண்டுவதால் குழந்தை வீறிட்டழுகிறது\" என்று (சிறு வித்தியாசத்துடன்) இடம்பெற்றுள்ளது. ஷுஐப் (ரஹ்) அவர்களது அறிவிப்பில் (\"ஷைத்தான் தீண்டுவதால்\" என்பதைக் குறிக்க \"மிம் மஸ்ஸத்திஷ் ஷைத்தான்\"என்பதற்குப் பகரமாக) \"மிம் மஸ்ஸிஷ் ஷைத்தான்\" என்று (சிறிய மாற்றத்துடன்) காணப்படுகிறது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6134,
			"arabicnumber": "2366.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6135,
			"arabicnumber": "2366.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஆதமின் மகன் (மனிதன்) ஒவ்வொருவரையும், தாய் வயிற்றிலிருந்து அவன் பிறக்கும் நாளில் ஷைத்தான் தீண்டவே செய்கிறான்; மர்யமையும் அவருடைய புதல்வரையும் தவிர. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6136,
			"arabicnumber": "2367",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6137,
			"arabicnumber": "2368",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6138,
			"arabicnumber": "2369.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6139,
			"arabicnumber": "2369.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6140,
			"arabicnumber": "2369.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 6141,
			"arabicnumber": "2370",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6142,
			"arabicnumber": "151.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6143,
			"arabicnumber": "151.05",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6145,
			"arabicnumber": "2371",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6146,
			"arabicnumber": "339.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6147,
			"arabicnumber": "339.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6148,
			"arabicnumber": "2372.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6149,
			"arabicnumber": "2372.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 6150,
			"arabicnumber": "2372.03",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6151,
			"arabicnumber": "2373.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: யூதர் ஒருவர் (சந்தையில்) தமது சரக்கை எடுத்துக் காட்டியபோது, அவருக்குப் \"பிடிக்காத\" அல்லது \"அவர் விரும்பாத\" (குறைந்த) விலை அவருக்குக் கொடுக்கப்பட்டது. (அறிவிப்பாளர் அப்துல் அஸீஸ் (ரஹ்) அவர்களின் ஐயம்.) அப்போது அந்த யூதர், \"மனிதர்கள் அனைவரையும்விட (சிறந்தவராக) மூசாவைத் தேர்ந்தெடுத்தவன் மீதாணையாக! இல்லை (இந்த விலை கட்டுப்படியாகாது)\" என்று கூறினார். இதை அன்சாரி (முஸ்லிம்)களில் ஒருவர் கேட்டுவிட்டார். உடனே அந்த யூதரை முகத்தில் அறைந்து, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நமக்கிடையே வாழ்ந்து கொண்டிருக்க, \"மனிதர்கள் அனைவரையும் விட மூசாவைத் தேர்ந்தெடுத்தவன்மீது சத்தியமாக! என்றா நீ கூறுகிறாய்?\" என்று கேட்டார். உடனே அந்த யூதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று, \"அபுல்காசிமே! (சிறுபான்மை மக்களான எங்கள் உயிர், உடைமை, மானத்தைப் பாதுகாப்பதாக எங்களிடம் நீங்கள் வாக்குறுதி அளித்திருக்கும் அடிப்படையில்) எனக்கு நீங்கள் பொறுப்பேற்று ஒப்பந்தம் செய்து தந்திருக்கிறீர்கள். இன்ன மனிதர் எனது முகத்தில் அறைந்துவிட்டார்\" என்று கூறினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அந்த முஸ்லிமிடம்), \"நீ ஏன் இவரது முகத்தில் அறைந்தாய்?\" என்று கேட்டார்கள். \"(அல்லாஹ்வின் தூதரே!), தாங்கள் எங்களிடையே வாழ்ந்து கொண்டிருக்கவே இவர் மனிதர்கள் அனைவரையும்விட மூசாவைத் தேர்ந்தெடுத்தவன் மீதாணையாக!\" என்று (மூசா (அலை) அவர்களைச் சிறப்பித்துக்) கூறினார்\" என்றார். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோபப்பட்டார்கள். எந்த அளவுக்கென்றால், கோபக்குறி அவர்களது முகத்தில் தென்பட்டது. பிறகு கூறினார்கள்: இறைத் தூதர்களுக்கிடையே (\"ஒருவர் மற்றவரைவிடச் சிறந்தவர்\" என்று) ஏற்றத்தாழ்வு பாராட்டாதீர்கள். ஏனெனில், (மறுமை நாளில்) எக்காளம் (\"ஸூர்\") ஊதப்படும். உடனே வானங்களில் இருப்பவர்களும் பூமியில் இருப்பவர்களும் மூர்ச்சையடைந்துவிடுவார்கள்; அல்லாஹ் நாடியவர்களைத் தவிர. பிறகு மற்றொரு முறை எக்காளம் ஊதப்படும். அப்போது (உயிர் கொடுத்து) எழுப்பப்படுபவர்களில் நான்தான் முதல் ஆளாக இருப்பேன். அந்த வேளையில் மூசா (அலை) அவர்கள் இறை அரியணையைப் பிடித்துக்கொண்டிருப்பார்கள். அவர்கள் \"தூர் சினாய்\" (மலையில் இறைவனைச் சந்தித்த) நாளில் மூர்ச்சையாகி விழுந்தது கணக்கி லெடுக்கப்(பட்டு,அங்கு அவருக்கு விதிவிலக்கு அளிக்கப்)பட்டதா? அல்லது எனக்கு முன்பே அவர் (மயக்கம் தெளிவிக்கப்பட்டு) எழுப்பப்பட்டுவிட்டாரா?\" என்பது எனக்குத் தெரியாது. மேலும், யூனுஸ் பின் மத்தா (அலை) அவர்களைவிட ஒருவர் சிறந்தவர் என்று நான் ஒருபோதும் கூற மாட்டேன். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6152,
			"arabicnumber": "2373.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6153,
			"arabicnumber": "2373.03",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு யூதரும் ஒரு முஸ்லிமும் ஒருவரையொருவர் திட்டிக்கொண்டனர். அந்த முஸ்லிம், \"உலகத்தார் அனைவரைவிடவும் முஹம்மத் (ஸல்) அவர்களுக்கு மேன்மை அளித்தவன் மீதாணையாக!\" என்று (ஏதோ ஒரு விஷயத்தில் சத்தியமிட்டுக்) கூறினார். அதற்கு (பதிலாக) அந்த யூதர், \"உலகத்தார் அனைவரைவிடவும் மூசா (அலை) அவர்களுக்கு மேன்மை அளித்தவன் மீதாணையாக!\" என்று கூறினார். அதைக் கேட்டு (கோபம் கொண்ட) அந்த முஸ்லிம் கையை ஓங்கி யூதரின் முகத்தில் அறைந்து விட்டார். உடனே அந்த யூதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, தமக்கும் அந்த முஸ்லிமுக்கும் இடையே நடந்ததைத் தெரிவித்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அந்த முஸ்லிமை வரவழைத்து), \"மூசாவைவிட என்னைச் சிறப்பாக்கி (உயர்த்திப் பேசி)விடாதீர்கள். ஏனெனில், மக்கள் அனைவரும் (மறுமை நாளில்) மூர்ச்சையாகிவிடுவார்கள். நானே முதலாவதாக மயக்கம் தெளிந்து எழுவேன். அப்போது மூசா (அலை) அவர்கள் இறை அரியணையின் ஓரத்தைப் பிடித்துக்கொண்டிருப்பார்கள். மக்களோடு சேர்ந்து அவரும் மூர்ச்சையாகி, பிறகு எனக்கு முன்பாகவே மயக்கம் தெளிந்துவிட்டிருப்பாரா? அல்லது அவருக்கு மட்டும் இறைவன் (மூர்ச்சையடை வதிலிருந்து) விதிவிலக்கு அளித்திருப்பானா என்பது எனக்குத் தெரியாது\" என்று கூறினார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6154,
			"arabicnumber": "2373.04",
			"text": "மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"ஒரு முஸ்லிமும் ஒரு யூதரும் ஒருவரையொருவர் திட்டிக்கொண்டனர்\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6155,
			"arabicnumber": "2374.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6156,
			"arabicnumber": "2374.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இறைத்தூதர்களுக்கிடையே (\"ஒருவர் மற்றவரைவிடச் சிறந்தவர்\" என) ஏற்றத்தாழ்வு கற்பிக்காதீர்கள். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர் களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6157,
			"arabicnumber": "2375.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6158,
			"arabicnumber": "2375.02",
			"text": "மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"நான் மூசா (அலை) அவர்களைக் கடந்து சென்றேன். அப்போது அவர்கள் தமது அடக்கத்தலத்தினுள் தொழுதுகொண்டிருந்தார்கள்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது. ஈசா பின் யூனுஸ் (ரஹ்) அவர்களது அறிவிப்பில், \"நான் (மக்காவிலிருந்து பைத்துல் மக்திஸுக்கு) அழைத்துச்செல்லப்பட்ட இரவில் கடந்து சென்றேன்\" என்று கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6159,
			"arabicnumber": "2376",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: \"என் அடியார் ஒருவர் (தம்மைப் பற்றி) நான் யூனுஸ் பின் மத்தா அவர்களைவிடச் சிறந்தவன் என்று கூறுவது அவருக்குத் தகாது\" என்று அல்லாஹ் கூறினான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 6160,
			"arabicnumber": "2377",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், \"யூனுஸ் பின் மத்தா அவர்களைவிட நான் சிறந்தவன் என்று (என்னைப் பற்றிக் கூறுவது) எந்த அடியாருக்கும் தகாது\" என்று கூறினார்கள். இவ்வாறு யூனுஸ் (அலை) அவர்களை, அவர்களுடைய தந்தையுடன் இணைத்து (மத்தாவின் மகன் யூனுஸ் என்று) நபி (ஸல்) அவர்கள் சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 6161,
			"arabicnumber": "2378",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம், \"அல்லாஹ்வின் தூதரே! மக்களில் மிகவும் கண்ணியத்திற்குரியவர் யார்?\" என்று கேட்கப்பட்டது. நபி (ஸல்) அவர்கள், \"மனிதர்களிலேயே இறைவனை அதிகமாக அஞ்சுபவர்தான்\" என்று பதிலளித்தார்கள். உடனே மக்கள், \"நாங்கள் தங்களிடம் இதைப் பற்றிக் கேட்கவில்லை\" என்று கூறினர். நபி (ஸல்) அவர்கள், \"அப்படியென்றால், இறைவனின் உற்ற நண்பர் (இப்ராஹீம்) உடைய புதல்வரான இறைத்தூதர் (இஸ்ஹாக்) உடைய புதல்வரான இறைத்தூதர் (யஅகூப்) உடைய புதல்வரான இறைத்தூதர் யூசுஃப் (அலை) அவர்கள்தான்\" என்று பதிலளித்தார்கள். மக்கள், \"இதைப் பற்றியும் நாங்கள் தங்களிடம் கேட்கவில்லை\" என்று கூறினர். உடனே நபி (ஸல்) அவர்கள், \"அரபியரின் மூலகங்கள் (எனப்படும் அரபியர் பரம்பரைகள்) குறித்தா என்னிடம் கேட்கிறீர்கள்? அறியாமைக் காலத்தில் மக்களில் சிறந்தவர்களாயிருந்தவர்கள் தான் இஸ்லாத்தை ஏற்ற பின்பும் சிறந்தவர்களாயிருப்பார்கள்; அவர்கள் மார்க்க ஞானத்தைப் பெற்றுக்கொண்டால்\" என்று பதிலளித்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 6162,
			"arabicnumber": "2379",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 6163,
			"arabicnumber": "2380.01",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 6164,
			"arabicnumber": "2380.02",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 6165,
			"arabicnumber": "2380.03",
			"text": "மேற்கண்ட ஹதீஸ் அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் வாயிலாக மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"யூதர் ஒருவர் (ஒரு முஸ்லிமிடம்) முகத்தில் அறை வாங்கிக்கொண்டு நபி (ஸல்) அவர்களிடம் வந்தார்\"என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே காணப்படுகின்றன. ஆயினும், அதில் \"மூர்ச்சையடைந்துவிட்டவர்களில் மூசா (அலை) அவர்கள் (முதலாவதாக) மூர்ச்சை தெளிந்து (எழுந்து)விட்டார்களா? அல்லது தூர்சினாய் மலையில் (இறைவனைப் பார்க்க முற்பட்டபோது) அடைந்த மூர்ச்சைக்குக் பகரமாக அத்தோடு போதுமென விடப்பட்டார்களா என்பது எனக்குத் தெரியாது\" என்று நபி (ஸல்) அவர்கள் கூறியதாக (சிறு வேறுபாட்டுடன்) காணப்படுகிறது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 6166,
			"arabicnumber": "2380.04",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 6167,
			"arabicnumber": "2380.05",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 6168,
			"arabicnumber": "2380.06",
			"text": "உபைதுல்லாஹ் பின் அப்தில்லாஹ் பின் உத்பா பின் மஸ்ஊத் (ரஹ்) அவர்கள் கூறியதாவது: \"மூசா (அலை) (அவர்கள் சில ஞானங்களைக் கற்றுக்கொள்வதற்காக ஓர் அடியாரைத் தேடிச் சென்றார்கள் என அல்லாஹ் குறிப்பிடுகின்ற) அவர்களுடைய அந்தத் தோழர் யார்? அவர் \"களிர்\" அவர்கள்தானா என்பது தொடர்பாக இப்னு அப்பாஸ் (ரலி) அவர்களும் ஹுர்ரு பின் கைஸ் பின் ஹிஸ்ன் அல்ஃபஸாரீ என்பாரும் கருத்து வேறுபாடு கொண்டு வழக்காடிக் கொண்டனர். இப்னு அப்பாஸ் (ரலி) அவர்கள், \"அவர் களிர் (அலை) அவர்கள்தான்\" என்றார்கள். அப்போது உபை பின் கஅப் அல்அன் சாரீ (ரலி) அவர்கள் அவ்வழியாகச் சென்றார்கள். அவர்களை இப்னு அப்பாஸ் (ரலி) அவர்கள் அழைத்து, \"அபுத்துஃபைல் அவர்களே! இங்கே வாருங்கள். நானும் என்னுடைய இந்தத் தோழரும் மூசா (அலை) அவர்கள் யாரைச் சந்திக்கச் செல்வதற்கு இறைவனிடம் வழி கேட்டார்களோ அந்தத் தோழர் யார் என்பது தொடர்பாக வழக்காடிக்கொண்டோம். அவரது நிலை குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொல்ல நீங்கள் கேட்டிருக்கிறீர்களா?\" என்று வினவினார்கள். உபை பின் கஅப் (ரலி) அவர்கள் (பின் வருமாறு) பதிலளித்தார்கள்: (ஆம்;) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொல்ல நான் கேட்டிருக்கிறேன்: பனூ இஸ்ராயீல் மக்களின் ஒரு கூட்டத்தாரிடையே மூசா (அலை) அவர்கள் இருந்தபோது, அவர்களிடம் ஒரு மனிதர் வந்து, \"உங்களைவிட அறிந்தவர் எவரும் இருப்பது உங்களுக்குத் தெரியுமா?\" என்று கேட்க, மூசா (அலை) அவர்கள், \"இல்லை (என்னைவிட அறிந்தவர் எவரும் இருப்பதாகத் தெரியவில்லை)\" என்று சொன்னார்கள். உடனே மூசா (அலை) அவர்களுக்கு, \"இருக்கிறார்; அவர்தான் நம் அடியார் களிர் ஆவார்\" என்று அல்லாஹ் (வஹீ) அறிவித்தான். அப்போது மூசா (அலை) அவர்கள் களிர் அவர்களைச் சந்திக்க வழி கேட்டார்கள். அப்போது அல்லாஹ் மீன் ஒன்றை அவர்களுக்கு அடையாளமாக ஆக்கி, \"நீர் எந்த இடத்தில் மீனைத் தவற விடுகிறீரோ அந்த இடத்திலிருந்து (வந்த வழியே) திரும்பிச் செல்லும். அங்கு களிரைச் சந்திப்பீர்\" என்று அவரிடம் கூறப்பட்டது. அவ்வாறே மூசா (அலை) அவர்கள் அல்லாஹ் நாடிய தூரம்வரை (தம் உதவியாளருடன்) நடந்தார்கள். பிறகு தம் ஊழியரிடம் \"நமது காலை உணவைக் கொண்டுவாரும்\" என்று கூறினார்கள். அதற்கு மூசா (அலை) அவர்களின் உதவியாளர், \"கவனித்தீர்களா! நாம் அந்தப் பாறையில் ஒதுங்கியபோது அந்த மீனை நான் மறந்துவிட்டேன். அதைக் கூறவிடாமல் ஷைத்தான்தான் என்னை மறக்கச் செய்துவிட்டான்\" என்று கூறினார். மூசா (அலை) அவர்கள், \"அதுதான் நாம் தேடிவந்த இடம்\" என்று தம் உதவியாளரிடம் சொல்ல, இருவரும் தம் அடிச்சுவடுகளைப் பின்பற்றி வந்தவழியே திரும்பிச் சென்றார்கள். அங்கே களிர் (அலை) அவர்களைக் கண்டார்கள் (18:63-65). பின்னர் அவ்விருவர் தொடர்பாக அல்லாஹ் தனது வேதத்தில் எடுத்துரைத்த நிகழ்ச்சிகள் நடைபெற்றன. யூனுஸ் (ரஹ்) அவர்களது அறிவிப்பில், \"மூசா (அலை) அவர்கள் கடலில் அந்த மீன் ஏற்படுத்திச் சென்ற வழித்தடத்தைப் பின்தொடர்ந்து சென்றுகொண்டிருந்தார்கள்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 226
			}
		}
	]
}