{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6500,
			"arabicnumber": "2548.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6501,
			"arabicnumber": "2548.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6502,
			"arabicnumber": "2548.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6503,
			"arabicnumber": "2548.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6504,
			"arabicnumber": "2549.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6507,
			"arabicnumber": "2549.04",
			"text": "மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. - அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களை நோக்கி வந்து, \"நான் அல்லாஹ்விடமிருந்து நற்பலனை எதிர்பார்த்துப் புலம்பெயர்ந்து (ஹிஜ்ரத்) செல்வதற்கும் அறப்போர் புரிவதற்கும் தங்களிடம் உறுதிமொழி அளிக்கிறேன்\" என்று கூறினார். நபி (ஸல்) அவர்கள், \"இப்போது உன் தாய் தந்தையரில் யாரேனும் உயிருடன் இருக்கின்றனரா?\" என்று கேட்டார்கள். அதற்கு அம்மனிதர், \"ஆம்; இருவருமே உயிருடன் இருக்கின்றனர்\" என்று பதிலளித்தார். நபி (ஸல்) அவர்கள், \"நீ அல்லாஹ்விடமிருந்து நற்பலனை எதிர்பார்க்கிறாய் (அல்லவா)?\" என்று கேட்டார்கள். அதற்கு அவர், \"ஆம்” என்றார். நபி (ஸல்) அவர்கள், \"அவ்வாறாயின், நீ திரும்பிச்சென்று அவர்கள் இருவரிடமும் அழகிய முறையில் உறவாடு\" என்று சொன்னார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6508,
			"arabicnumber": "2550.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (பனூ இஸ்ராயீல் சமுதாயத்தைச் சேர்ந்த நல்ல மனிதரான) ஜுரைஜ் என்பவர் தமது ஆசிரமத்தில் (இறைவனை) வழிபட்டுக்கொண்டிருந்தார். அப்போது அவரிடம் அவருடைய தாயார் வந்(து அவரை அழைத்)தார். -அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஜுரைஜை அவருடைய தாயார் அழைத்த முறையையும், அப்போது அவர் தமது புருவத்துக்கு மேலே கையை எப்படி வைத்திருந்தார்; பிறகு ஜுரைஜை நோக்கித் தமது தலையை உயர்த்தி எப்படி அழைத்தார் என்பதையும் சைகை செய்துகாட்டினார்கள். அதைப் போன்றே அபூஹுரைரா (ரலி) அவர்கள் சைகை செய்துகாட்ட, அறிவிப்பாளர் அபூ ராஃபிஉ (ரஹ்) அவர்கள் அவ்வாறே சைகை செய்து காட்டினார்கள் என ஹுமைத் பின் ஹிலால் (ரஹ்) அவர்கள் இதை அறிவிக்கும் போது விளக்கினார்கள்.- ஜுரைஜின் தாயார், \"ஜுரைஜே! நான் உன்னுடைய தாய் (அழைக்கிறேன்); என்னிடம் பேசு\" என்று கூறினார். அப்போது ஜுரைஜ் தொழுதுகொண்டிருப்பதைத் தாயார் கண்டார். உடனே ஜுரைஜ், \"இறைவா! என் தாயா? என் தொழுகையா? (எதற்கு நான் முன்னுரிமை கொடுப்பேன்?)\" என்று கூறிவிட்டு, தொழுகையையே தேர்ந்தெடுத்தார். உடனே அவருடைய தாயார் திரும்பிச் சென்றுவிட்டார். பிறகு மறுபடியும் அவரை அழைத்தார். \"ஜுரைஜே! நான் உன் தாய் (அழைக்கிறேன்);என்னிடம் பேசு\" என்று கூறினார். அப்போது(ம் தொழுது கொண்டிருந்த) ஜுரைஜ், \"இறைவா! என் தாயா? எனது தொழுகையா?\" என்று கூறிவிட்டு மீண்டும் தொழுகையையே தேர்ந்தெடுத்தார். அப்போது அவருடைய தாயார், \"இறைவா! இதோ என் மகன் ஜுரைஜிடம் நான் பேசினேன். அவன் என்னிடம் பேச மறுத்துவிட்டான். இறைவா! விபசாரிகளை அவனுக்கு நீ காட்டாமல் அவனுக்கு (ஜுரைஜுக்கு) நீ மரணத்தைத் தந்துவிடாதே\" என்று பிரார்த்தித்தார். (அந்நேரத்தில்) ஜுரைஜுக்கெதிராக அவருடைய தாயார், ஜுரைஜ் வேறு சோதனைக்குள்ளாக்கப்பட வேண்டும் என்று பிரார்த்திருந்தால், அவ்வாறே அவர் சோதனைக்குள்ளாக்கப்பட்டிருப்பார். (ஆனால், விபசாரிகளைக் கண்ணில் படவைக்கும் குறைந்தபட்ச சோதனையையே அவருடைய தாயார் வேண்டினார்.) ஆடு மேய்க்கும் இடையன் ஒருவன் ஜுரைஜின் ஆசிரமத்துக்கு வருவது வழக்கம். (இந்நிலையில் ஒரு நாள்) அந்தக் கிராமத்திலிருந்து (விபசாரியான) பெண்ணொருத்தி வந்தாள். அவளுடன் அந்த இடையன் விபசாரத்தில் ஈடுபட்டான். பிறகு அவள் கர்ப்பமுற்று ஓர் ஆண் மகவைப் பெற்றெடுத்தாள். அவளிடம் \"இது யாருடைய குழந்தை?\" என்று கேட்கப்பட்டது. \"இதோ இந்த ஆசிரமத்தில் இருப்பவரால்தான் (இக்குழந்தை பிறந்தது)\" என்று அவள் கூறினாள். உடனே மக்கள் (வெகுண்டெழுந்து) கோடரிகளையும் மண்வெட்டிகளையும் எடுத்துக்கொண்டு வந்து ஜுரைஜை அழைத்தனர். அப்போது அவர் தொழுதுகொண்டிருந்ததால் அவர்களிடம் அவர் பேசவில்லை. உடனே (கோபம் கொண்ட) அம்மக்கள் அவருடைய ஆசிரமத்தைத் தகர்க்கலாயினர். இதைக் கண்ட ஜுரைஜ் (தம் ஆசிரமத்திலிருந்து) இறங்கி வந்தார். மக்கள், \"இதோ இவள் என்ன சொல்கிறாள் என்பதைக் கேள்\" என்று கூறினர். ஜுரைஜ் புன்னகைத்துவிட்டு, அந்த (விபசாரியின்) குழந்தையின் தலையை தடவிக் கொடுத்தார். பிறகு \"உன் தந்தை யார்?\" என்று கேட்டார். (பேசும் பருவத்தை அடையாதிருந்த) அக்குழந்தை, \"(இன்ன) ஆட்டிடையன்தான் என் தந்தை\" என்று கூறியது. இதை அக்குழந்தையிடமிருந்து செவியுற்ற அம்மக்கள், (தமது தவறை உணர்ந்து) \"நாங்கள் இடித்துத் தகர்த்த உங்கள் ஆசிரமத்தைத் தங்கத்தாலும் வெள்ளியாலும் கட்டித்தருகிறோம்\" என்று (ஜுரைஜிடம்) கூறினர். அதற்கு ஜுரைஜ் \"இல்லை; முன்பிருந்ததைப் போன்று மீண்டும் மண்ணால் கட்டித்தாருங்கள் (அதுவே போதும்)\" என்று கூறிவிட்டு,மேலே ஏறிச் சென்றுவிட்டார். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6509,
			"arabicnumber": "2550.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மூன்று பேரைத் தவிர வேறெவரும் தொட்டிலில் (குழந்தையாக இருந்தபோது) பேசியதில்லை. ஒருவர் மர்யமின் புதல்வர் ஈசா (அலை) அவர்கள்; (மற்றொருவர்) ஜுரைஜின் பிள்ளை (என அவதூறு சொல்லப்பட்ட குழந்தை). ஜுரைஜ் (பனூ இஸ்ராயீல் சமுதாயத்தைச் சேர்ந்த) வணக்கசாலியான மனிதராயிருந்தார். அவர் ஆசிரமம் ஒன்றை அமைத்துக்கொண்டு அதில் இருந்து (வழிபட்டு)வந்தார். (ஒரு முறை) அவர் தொழுதுகொண்டிருந்தபோது அவரிடம் அவருடைய தாயார் வந்து, \"ஜுரைஜே!\" என்று அழைத்தார். அப்போது ஜுரைஜ், \"என் இறைவா! என் தாயா? எனது தொழுகையா?\" (என் தாய்க்குப் பதிலளிப்பதா, அல்லது தொழுகையைத் தொடர்வதா?) என்று (மனதிற்குள்) வினவிக்கொண்டு, தொழுகையில் கவனம் செலுத்தினார். ஆகவே, அவருடைய தாயார் (கோபித்துக்கொண்டு) திரும்பிச்சென்றுவிட்டார். மறுநாளும் அவர் தொழுதுகொண்டிருந்த போது அவரிடம் அவருடைய தாயார் வந்து, \"ஜுரைஜே!\" என்று அழைத்தார். அப்போதும் அவர், \"என் இறைவா! என் தாயா? எனது தொழுகையா?\" என்று (மனதிற்குள்) வினவிக்கொண்டு, தொடர்ந்து தொழுகையில் கவனம் செலுத்தினார். ஆகவே, (அன்றும்) அவருடைய தாயார் (கோபித்துக்கொண்டு) திரும்பிச் சென்றுவிட்டார். அதற்கடுத்த நாளும் அவருடைய தாயார் வந்தார். அப்போதும் அவர் தொழுது கொண்டிருந்தார். அவர், \"ஜுரைஜே!\" என்று அழைத்தார். ஜுரைஜ், \"என் இறைவா! என் தாயா? எனது தொழுகையா?\" என்று (தமக்குள்) வினவிக்கொண்டு தொழுகையில் கவனம் செலுத்தினார். ஆகவே, அவருடைய தாயார் (கோபித்துக்கொண்டு), \"இறைவா! அவனை (ஜுரைஜை) விபசாரிகளின் முகத்தில் விழிக்கச் செய்யாமல் மரணிக்கச் செய்யாதே\" என்று பிரார்த்தித்தார். பனூ இஸ்ராயீல் சமுதாயத்தார் ஜுரைஜைப் பற்றியும் அவருடைய வணக்க வழிபாடுகளைப் பற்றியும் (புகழ்ந்து) பேசிக்கொண்டனர். பனூ இஸ்ராயீலில் அழகுக்குப் பெயர்போன, விபசாரத்தில் ஈடுபட்டுவந்த பெண் ஒருத்தி இருந்தாள். அவள் (பனூ இஸ்ராயீல் மக்களிடம்), \"நீங்கள் விரும்பினால் உங்களுக்காக அவரைக் குழப்பத்தில் ஆழ்த்துகிறேன்\" என்று கூறிவிட்டு, அவரிடம் தன்னை ஒப்படைத்தாள். ஆனால், அவளை ஜுரைஜ் ஏறெடுத்தும் பார்க்கவில்லை. ஆகவே, (அவரைப் பழிவாங்குவதற்காக) அவள் ஓர் ஆட்டு இடையனிடம் சென்றாள். அவன் ஜுரைஜின் ஆசிரமத்துக்கு வருவது வழக்கம். தன்னை அனுபவித்துக்கொள்ள அந்த இடையனுக்கு அவள் வாய்ப்பளித்தாள். அவனும் அவளுடன் (தகாத) உறவில் ஈடுபட்டான். (இதில்) அவள் கர்ப்பமுற்றாள். குழந்தை பிறந்ததும், \"இது ஜுரைஜுக்குப் பிறந்த குழந்தை\" என்று (மக்களிடம்) கூறினாள். எனவே, மக்கள் (வெகுண்டெழுந்து) ஜுரைஜிடம் வந்து அவரைக் கீழே இறங்கிவரச் செய்துவிட்டு, அவரது ஆசிரமத்தை இடித்துத் தகர்த்துவிட்டனர். அவரையும் அடிக்கலாயினர். அப்போது ஜுரைஜ், \"உங்களுக்கு என்ன நேர்ந்தது? (ஏன் இப்படிச் செய்கிறீர்கள்?)\" என்று கேட்டார். மக்கள், \"நீர் இந்த விபசாரியுடன் உறவுகொண்டு அதன் மூலம் அவள் குழந்தை பெற்றெடுத்துவிட்டாள்\" என்று கூறினார். உடனே ஜுரைஜ், \"அந்தக் குழந்தை எங்கே?\" என்று கேட்டார். மக்கள் அந்தக் குழந்தையைக் கொண்டுவந்தனர். அப்போது ஜுரைஜ், \"நான் தொழுது கொள்ளும்வரை என்னை விட்டுவிடுங்கள்\" என்று கூறிவிட்டுத் தொழுதார். தொழுகை முடிந்ததும் அந்தக் குழந்தையிடம் வந்து, அதன் வயிற்றில் (தமது விரலால்) குத்தினார். பிறகு \"குழந்தாய்! உன் தந்தை யார்?\" என்று கேட்டார். அதற்கு அக்குழந்தை, \"இன்ன ஆட்டு இடையன்தான் (என் தந்தை)\" என்று பேசியது. (உண்மையை உணர்ந்துகொண்ட) அம்மக்கள், ஜுரைஜை முன்னோக்கிவந்து அவரை முத்தமிட்டு அவரைத் தொட்டுத்தடவினர். மேலும், \"தங்களது ஆசிரமத்தை நாங்கள் தங்கத்தால் கட்டித்தருகிறோம்\" என்று கூறினார்கள். அதற்கு ஜுரைஜ், \"இல்லை; முன்பிருந்ததைப் போன்று களிமண்ணால் கட்டித்தாருங்கள் (அதுவே போதும்)\" என்று கூறிவிட்டார். அவ்வாறே மக்களும் கட்டித்தந்தனர். (மழலைப் பருவத்தில் பேசிய மூன்றாமவர்:) ஒரு குழந்தை தன் தாயிடம் பாலருந்திக்கொண்டிருந்தது. அப்போது வனப்புமிக்க ஒரு மனிதன் மிடுக்கான வாகனமொன்றில் பயணம் செய்து கொண்டிருந்தான். உடனே அக்குழந்தையின் தாய், \"இறைவா! இதோ இவனைப் போன்று என் மகனையும் ஆக்குவாயாக!\" என்று பிரார்த்தித்தாள். அக்குழந்தை மார்பை விட்டுவிட்டு அப்பயணியைத் திரும்பிப்பார்த்து, \"இறைவா! இவனைப் போல் என்னை ஆக்கிவிடாதே\" என்று பேசியது. பிறகு மறுபடியும் மார்புக்குச் சென்று பால் அருந்தலாயிற்று. -இந்த இடத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அந்தக் குழந்தை பால் குடித்ததை அறிவிக்கும் முகமாக, தமது ஆட்காட்டி விரலை வாயில் வைத்து உறிஞ்சுவதைப் போன்று சைகை செய்து காட்டியதை இப்போதும் நான் பார்ப்பதைப் போன்றுள்ளது. பிறகு தாயும் மகவும் ஓர் அடிமைப் பெண்ணைக் கடந்துசென்றனர். மக்கள் அவளை, \"நீ விபசாரம் செய்தாய்;திருடினாய்\" என்று (இடித்துக்) கூறி அடித்துக்கொண்டிருந்தனர். ஆனால் அவளோ, \"அல்லாஹ்வே எனக்குப் போதுமானவன்; பொறுப்பாளர்களில் அவனே நல்லவன்\" என்று கூறிக்கொண்டிருந்தாள். அப்போது அக்குழந்தையின் தாய், \"இறைவா! என் மகனை இவளைப் போன்று ஆக்கிவிடாதே\" என்று கூறினாள். உடனே அக்குழந்தை பால் அருந்துவதை நிறுத்திவிட்டு அந்த அடிமைப் பெண்ணை நோக்கி(த் திரும்பி), \"இறைவா! என்னை இவளைப் போன்று ஆக்குவாயாக!\" என்று கூறியது. அந்த இடத்தில் தாயும் மகவும் பேசிக் கொண்டனர். தாய் சொன்னாள்: உன் தொண்டை அறுபடட்டும்! அழகிய தோற்றம் கொண்ட மனிதர் ஒருவர் கடந்து சென்றபோது நான், \"இறைவா! இதோ இவனைப் போன்று என் மகனை ஆக்குவாயாக\" என்று கூறினேன். அப்போது நீ \"இறைவா! இவனைப் போன்று என்னை ஆக்கிவிடாதே!\" என்று கூறினாய். பிறகு மக்கள், \"விபச்சாரம் செய்துவிட்டாய்; திருடிவிட்டாய்\" என்று (இடித்துக்)கூறி அடித்துக் கொண்டிருந்த இந்த அடிமைப் பெண்ணைக் கடந்துசென்றபோது நான், \"இறைவா! என் மகனை இவளைப் போன்று ஆக்கிவிடாதே!\" என்று பிரார்த்தித்தேன். அப்போது நீ \"இறைவா! இவளைப் போன்று என்னை ஆக்குவாயாக!\" என்று கூறினாய். (ஏன் அப்படிச் சொன்னாய்? என்று கேட்டாள்.) அதற்கு அக்குழந்தை, \"(வாகனத்தில் சென்ற) அந்த மனிதன் (அடக்குமுறைகளை அவிழ்த்து விடும்) கொடுங்கோலனாக இருந்தான். ஆகவே, நான் \"இறைவா! இவனைப் போன்று என்னை ஆக்கிவிடாதே!\" என்று கூறினேன். \"நீ விபசாரம் செய்துவிட்டாய்\" என்று கூறிக்கொண்டிருந்தனரே அப்பெண் விபசாரம் செய்யவுமில்லை. \"நீ திருடிவிட்டாய்\" என்று அவர்கள் கூறிக்கொண்டிருந்தனர். ஆனால், அவள் திருடவுமில்லை. ஆகவேதான், \"இறைவா! அவளைப் போன்று என்னையும் (நல்லவளாக) ஆக்குவாயாக!\" என்று கூறினேன்\" என்று பதிலளித்தது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6510,
			"arabicnumber": "2551.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6511,
			"arabicnumber": "2551.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6512,
			"arabicnumber": "2551.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6513,
			"arabicnumber": "2552.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6514,
			"arabicnumber": "2552.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6515,
			"arabicnumber": "2552.03",
			"text": "அப்துல்லாஹ் பின் தீனார் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் மக்காவுக்குப் பயணம் மேற்கொண்டால், அவர்களுடன் கழுதையொன்று இருக்கும். ஒட்டக வாகனத்தில் பயணம் செய்து களைத்து விட்டால், அக்கழுதைமீது ஓய்வெடுத்துக்கொள்வார்கள். மேலும், தலைப்பாகையொன்றும் அவர்களிடம் இருந்தது. அதை அவர்கள் தமது தலையில் கட்டிக்கொள்வார்கள். இந்நிலையில் ஒரு நாள் அவர்கள் அந்தக் கழுதையில் (பயணம் செய்துகொண்டு) இருந்தபோது, கிராமவாசி ஒருவர் அவர்களைக் கடந்துசென்றார். உடனே அவரிடம் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், \"நீங்கள் இன்ன மனிதரின் புதல்வரான இன்ன மனிதரல்லவா?\" என்று கேட்டார்கள். அதற்கு அவர் ‘ஆம்\" என்றார். உடனே அப்துல்லாஹ் (ரலி) அவர்கள், தமது கழுதையை அக்கிராமவாசியிடம் கொடுத்து \"இதில் ஏறிக்கொள்ளுங்கள்\" என்றார்கள்; தலைப்பாகையைக் கொடுத்து, \"இதைத் தலையில் கட்டிக்கொள்ளுங்கள்\" என்று கூறினார்கள். அப்போது அவர்களிடம் அவர்களுடைய தோழர்களில் சிலர், \"அல்லாஹ் உங்களை மன்னிப்பானாக! தாங்கள் ஓய்வெடுப்பதற்காக (மாற்று வாகனமாகப்) பயன்படுத்திவந்த கழுதையை இந்தக் கிராமவாசிக்குக் கொடுத்துவிட்டீர்களே? (பயணத்தின்போது) தாங்கள் தலையில் கட்டிக்கொண்டிருந்த தலைப்பாகையையும் கொடுத்துவிட்டீர்களே?\" என்று கேட்டார்கள். அதற்கு அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நல்லறங்களில் மிகவும் சிறந்தது, ஒரு மனிதர் தம் தந்தை மறைந்தபின் அவருடைய அன்புக்குரியவர்களுடன் நல்லுறவு பாராட்டுவதாகும்\" என்று கூறியதை நான் கேட்டுள்ளேன். இந்தக் கிராமவாசியின் தந்தை (என் தந்தை) உமர் (ரலி) அவர்களின் நண்பராக இருந்தார்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6516,
			"arabicnumber": "2553.01",
			"text": "நவ்வாஸ் பின் சம்ஆன் அல்அன்சாரீ (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நன்மை (\"அல்பிர்ரு\") மற்றும் தீமை (\"அல்இஸ்மு\") பற்றிக் கேட்டேன். அதற்கு அவர்கள், \"நன்மை என்பது நற்பண்பாகும். தீமை என்பது எந்தச் செயல் குறித்து உனது உள்ளத்தில் நெருடல் ஏற்படுவதுடன், அதை மக்கள் தெரிந்துகொள்வதை நீ வெறுப்பாயோ அதுவாகும்\" என்று விடையளித்தார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6517,
			"arabicnumber": "2553.02",
			"text": "நவ்வாஸ் பின் சம்ஆன் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் மதீனாவில் ஓராண்டு காலம் தங்கியிருந்தேன். அவர்களிடம் கேள்வி கேட்டு விடை தெரிந்துகொள்வ(து இயலாமல் போய் விடுமோ என்ப)தே ஹிஜ்ரத் செய்(து மதீனாவில் வந்து குடியேறு)வதற்கு எனக்குத் தடையாக இருந்தது. எங்களில் ஒருவர் ஹிஜ்ரத் செய்து (மதீனாவுக்கு வந்து குடியேறி)விட்டால், அவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் எதைப் பற்றியும் கேள்வி கேட்காமலிருந்தார். (வெளியூர்காரர்கள் கேட்கட்டும். அதன் மூலம் நாம் அறிந்து கொள்வோம் என்று இருந்துவிடுவார்.) (இந்த வகையில்,)நான் அவர்களிடம் நன்மையைப் பற்றியும் தீமையைப் பற்றியும் கேட்டேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நன்மை என்பது, நற்பண்பாகும். தீமை என்பது, எந்தச் செயல் குறித்து உனது உள்ளத்தில் நெருடல் ஏற்படுவதுடன், அதைப் பற்றி மக்கள் அறிந்துகொள்வதை நீ வெறுப்பாயோ அதுவாகும்\" என்று விடையளித்தார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6518,
			"arabicnumber": "2554",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6519,
			"arabicnumber": "2555",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6520,
			"arabicnumber": "2556.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6521,
			"arabicnumber": "2556.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6522,
			"arabicnumber": "2556.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6523,
			"arabicnumber": "2557.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6524,
			"arabicnumber": "2557.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6525,
			"arabicnumber": "2558.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6526,
			"arabicnumber": "2558.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவருக்கொருவர் கோபம் கொள்ளாதீர்கள்; பொறாமை கொள்ளாதீர்கள்; பிணங்கிக் கொள்ளாதீர்கள். அல்லாஹ்வின் அடியார்களே! (அன்பு காட்டுவதில்) சகோதரர்களாய் இருங்கள். ஒரு முஸ்லிம் தம் சகோதரருடன் (மனஸ்தாபம் கொண்டு) மூன்று நாட்களுக்கு மேல் பேசாமல் இருப்பது அனுமதிக்கப்பட்ட (ஹலாலான) செயலன்று. இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"உறவை முறித்துக்கொள்ளாதீர்கள்\" என்று கூடுதலாக இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் மஅமர் (ரஹ்) அவர்களிடமிருந்து யஸீத் பின் ஸுரைஉ (ரஹ்) அவர்கள் அறிவிக்கும் அறிவிப்பில் மேற்கண்ட (கோபம், பொறாமை, பிணக்கு, உறவை முறித்தல் ஆகிய) நான்கு குணங்கள் குறித்தும் இடம்பெற்றுள்ளன. அப்துர் ரஸ்ஸாக் (ரஹ்) அவர்கள் (மஅமர் (ரஹ்) அவர்களிடமிருந்து) அறிவிக்கும் அறிவிப்பில், \"ஒருவருக்கொருவர் பொறாமை கொள்ளாதீர்கள்; உறவை முறித்துக் கொள்ளாதீர்கள்; பிணங்கிக்கொள்ளாதீர்கள்\" என்று (மூன்று குணங்கள் மட்டுமே) இடம் பெற்றுள்ளன. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6530,
			"arabicnumber": "2559.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: கோபம் கொள்ளாதீர்கள். பிணங்கிக் கொள்ளாதீர்கள். (நீங்கள் வாழ பிறர் வீழவேண்டுமெனப்) போட்டியிட்டுக்கொள்ளாதீர்கள். அல்லாஹ்வின் அடியார்களே! சகோதரர்களாய் இருங்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6531,
			"arabicnumber": "2559.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6532,
			"arabicnumber": "2560.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6533,
			"arabicnumber": "2560.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6534,
			"arabicnumber": "2561",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6535,
			"arabicnumber": "2562",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6536,
			"arabicnumber": "2563.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6537,
			"arabicnumber": "2563.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6538,
			"arabicnumber": "2563.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6539,
			"arabicnumber": "2563.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6540,
			"arabicnumber": "2563.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6541,
			"arabicnumber": "2564.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6542,
			"arabicnumber": "2564.02",
			"text": "மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகச் சற்று கூடுதல் குறைவுடன் இடம்பெற்றுள்ளது. அதில், \"அல்லாஹ் உங்கள் உடல்களையோ உருவங்களையோ பார்ப்பதில்லை. மாறாக, உங்கள் உள்ளங்களையே பார்க்கின்றான்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறிவிட்டுத் தம் விரல்களால் தமது நெஞ்சை நோக்கி சைகை செய்தார்கள்\" என்று கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6543,
			"arabicnumber": "2564.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6546,
			"arabicnumber": "2565.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6547,
			"arabicnumber": "2565.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6548,
			"arabicnumber": "2566",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் மறுமை நாளில், \"என்னைக் கண்ணியப்படுத்துவதற்காக ஒருவரையொருவர் நேசித்துக்கொண்டவர்கள் எங்கே? எனது நிழலைத் தவிர வேறு நிழலில்லாத இன்றைய தினத்தில் அவர்களுக்கு நான் எனது நிழலில் நிழலளிக்கிறேன்\" என்று கூறுவான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6549,
			"arabicnumber": "2567.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒரு மனிதர் தம் (கொள்கை)ச் சகோதரரைச் சந்திப்பதற்காக வேறோர் ஊருக்குச் சென்றார். அல்லாஹ், அவர் செல்லும் வழியில் அவரை எதிர்பார்த்தபடி வானவர் ஒருவரை அமரச் செய்தான். அந்த மனிதர் அவரிடம் வந்தபோது, \"எங்கே செல்கிறாய்?\" என்று அந்த வானவர் கேட்டார். அதற்கு அந்த மனிதர், \"இந்த ஊரிலுள்ள என் சகோதரர் ஒருவரைச் சந்திப்பதற்காகச் செல்கிறேன்\" என்று கூறினார். அதற்கு அவ்வானவர், \"அவர் உமக்குச் செலுத்த வேண்டிய பிரதியுபகாரம் ஏதேனும் உள்ளதா?\" என்று கேட்டார்.அதற்கு அம்மனிதர், \"இல்லை; எனினும் நான் வல்லமையும் மாண்பும் மிக்க அல்லாஹ்வுக்காக அவரை நேசிக்கிறேன்\" என்று கூறினார். அதற்கு அந்த வானவர், \"நீ அல்லாஹ்வுக்காக அவரை நேசித்ததைப் போன்றே அல்லாஹ்வும் உன்னை நேசிக்கிறான் என்பதைத் தெரிவிக்க அல்லாஹ்வால் உம்மிடம் அனுப்பப்பெற்ற தூதர் ஆவேன் நான்\" என்று சொன்னார். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6550,
			"arabicnumber": "2567.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6551,
			"arabicnumber": "2568.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6552,
			"arabicnumber": "2568.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6553,
			"arabicnumber": "2568.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6554,
			"arabicnumber": "2568.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6555,
			"arabicnumber": "2568.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6556,
			"arabicnumber": "2569",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6557,
			"arabicnumber": "2570.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6558,
			"arabicnumber": "2570.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6559,
			"arabicnumber": "2571.01",
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நோய்வாய்ப்பட்டுக் காய்ச்சலால் சிரமப்பட்டுக் கொண்டிருந்தபோது நான் அவர்களிடம் சென்றேன். அவர்களை(ப் பரிவோடு) எனது கையால் தொட்டு, \"அல்லாஹ்வின் தூதரே! தாங்கள் கடும் காய்ச்சலால் சிரமப்படுகிறீர்களே!\" என்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஆம்; உங்களில் இருவர் காய்ச்சலால் அடையும் துன்பத்தைப் போன்று நான் ஒருவனே சிரமப்படுகிறேன்\" என்றார்கள். நான், \"இத்துன்பத்தின் காரணமாகத் தங்களுக்கு இரு (மடங்கு) நன்மைகள் உண்டு தானே?\" என்று கேட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"ஆம்\" என்று கூறிவிட்டுப் பிறகு, \"ஒரு முஸ்லிமுக்கு ஏற்படும் நோயாயினும்,அது அல்லாத வேறு எந்தத் துன்பமாயினும் (அதற்கு ஈடாக), மரம் தன் இலைகளை உதிர்த்துவிடுவதைப் போன்று அவருடைய பாவங்களை அல்லாஹ் உதிர்க்காமல் இருப்பதில்லை\" என்றார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஸுஹைர் பின் ஹர்ப் (ரஹ்) அவர்களது அறிவிப்பில், \"எனது கையால் அவர்களை(ப் பரிவோடு) தொட்டேன்\" எனும் குறிப்பு இடம்பெறவில்லை. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மேலும் ஐந்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் அபூமுஆவியா (ரஹ்) அவர்களது அறிவிப்பில், \"ஆம்; என் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! பூமியின் மீதுள்ள ஒரு முஸ்லிமுக்கு (ஏற்படும் எந்த நோயாயினும்...)\" என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள் என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6560,
			"arabicnumber": "2571.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6561,
			"arabicnumber": "2572.01",
			"text": "அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்கள் \"மினா\"வில் இருந்தபோது அவர்களிடம் குறைஷிக் குலத்தைச் சேர்ந்த இளைஞர் ஒருவர் வந்தார். அப்போது அ(ங்கிருந்த)வர்கள் சிரித்துக் கொண்டிருந்தார்கள். உடனே ஆயிஷா (ரலி) அவர்கள், \"உங்களுடைய சிரிப்புக்கு என்ன காரணம்?\" என்று கேட்டார்கள். அதற்கு அம் மக்கள், \"இன்ன மனிதர் கூடாரத்தின் கயிற்றில் இடறி விழுந்துவிட்டார். அவரது கழுத்தோ கண்ணோ போயிருக்கும் (நல்லவேளை பிழைத்துக்கொண்டார்)\" என்று கூறினர். அப்போது ஆயிஷா (ரலி) அவர்கள், \"(இதற்கெல்லாம்) சிரிக்காதீர்கள். ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஒரு முஸ்லிமைத் தைக்கும் ஒரு முள்ளாயினும் அதைவிடச் சிறிய துன்பம் எதுவாயினும், அதற்காக அவருக்கு ஓர் அந்தஸ்து பதிவு செய்யப்படுகிறது; அதற்குப் பகரமாக அவருடைய தவறுகளில் ஒன்று துடைக்கப்படுகிறது\" என்று கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6562,
			"arabicnumber": "2572.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6563,
			"arabicnumber": "2572.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6564,
			"arabicnumber": "2572.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6565,
			"arabicnumber": "2572.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6566,
			"arabicnumber": "2572.06",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6567,
			"arabicnumber": "2572.07",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6568,
			"arabicnumber": "2573",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6569,
			"arabicnumber": "2574",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6570,
			"arabicnumber": "2575",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6571,
			"arabicnumber": "2576",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6572,
			"arabicnumber": "2577.01",
			"text": "அபூதர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் வளமும் உயர்வும் மிக்க அல்லாஹ் பின்வருமாறு கூறியதாக அறிவித்தார்கள்: என் அடியார்களே! அநீதியிழைப்பதை எனக்கு நானே தடை செய்துகொண்டேன். அதை உங்களிடையேயும் தடை செய்யப்பட்டதாக ஆக்கிவிட்டேன். ஆகவே, நீங்கள் ஒருவருக்கொருவர் அநீதியிழைக்காதீர்கள். என் அடியார்களே! உங்களில் யாரை நான் நல்வழியில் செலுத்தினேனோ அவர்களைத் தவிர மற்ற அனைவரும் வழி தவறியவர்களே. ஆகவே, என்னிடமே நல்வழியில் செலுத்துமாறு கேளுங்கள். உங்களை நான் நல்வழியில் செலுத்துவேன். என் அடியார்களே! உங்களில் யாருக்கு நான் உணவளித்துள்ளேனோ அவர்களைத் தவிர மற்ற அனைவரும் பசித்திருப்பவர்களே. ஆகவே, என்னிடமே உணவாதாரத்தைக் கேளுங்கள். நான் உங்களுக்கு உணவளிக்கிறேன். என் அடியார்களே! உங்களில் யாருக்கு நான் ஆடையணிவித்துள்ளேனோ அவர்களைத் தவிர மற்ற அனைவரும் நிர்வாணமானவர்களே. ஆகவே, என்னிடமே ஆடை கேளுங்கள். நான் உங்களுக்கு ஆடையணிவிக்கிறேன். என் அடியார்களே! நீங்கள் இரவிலும் பகலிலும் பாவம் செய்கிறீர்கள். நான் அனைத்துப் பாவங்களையும் மறைத்துக் கொண்டிருக்கிறேன். ஆகவே, என்னிடமே பாவமன்னிப்புக் கோருங்கள். நான் உங்கள் பாவங்களை மன்னிக்கிறேன். என் அடியார்களே! உங்களால் எனக்கு எவ்விதத் தீங்கும் அளிக்க முடியாது; மேலும், உங்களால் எனக்கு எவ்விதப் பயனும் அளிக்க முடியாது. என் அடியார்களே! உங்களில் முற்காலத்தார், பிற்காலத்தார், மனிதர்கள், ஜின்கள் ஆகிய அனைவரும் உங்களில் மிகவும் இறையச்சமுடைய ஒரு மனிதரைப் போன்று மாறிவிட்டாலும் அது எனது ஆட்சியில் எதையும் அதிகமாக்கி விடுவதில்லை. என் அடியார்களே! உங்களில் முற்காலத்தார், பிற்காலத்தார், மனிதர்கள், ஜின்கள் ஆகிய அனைவரும் மிகவும் தீய மனிதர் ஒருவரைப் போன்று மாறிவிட்டாலும் அது எனது ஆட்சியில் எதையும் குறைத்துவிடப்போவதில்லை. என் அடியார்களே! உங்களில் முற்காலத்தார், பிற்காலத்தார், மனிதர்கள், ஜின்கள் ஆகிய அனைவரும் சேர்ந்து ஒரே திறந்த வெளியில் நின்று என்னிடத்தில் (தத்தம் தேவைகளைக்) கோரினாலும் ஒவ்வொரு மனிதருக்கும் அவர் கேட்பதை நான் கொடுப்பேன். அது என்னிடத்தில் இருப்பவற்றில் எதையும் குறைத்துவிடுவதில்லை; கடலில் நுழை(த்து எடு)க்கப்பட்ட ஊசி (தண்ணீரைக்) குறைப்பதைப் போன்றே தவிர (குறைக்காது)! என் அடியார்களே! நீங்கள் செய்துவரும் நல்லறங்களை நான் உங்களுக்காக எண்ணிக் கணக்கிடுகிறேன். பிறகு அதன் நற்பலனை நான் முழுமையாக வழங்குவேன். நல்லதைக் கண்டவர் அல்லாஹ்வைப் போற்றிப் புகழட்டும். அல்லதைக் கண்டவர் தம்மையே நொந்துகொள்ளட்டும்! (இதன் அறிவிப்பாளர்களில் ஒருவரான) சயீத் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்கள் கூறுகிறார்கள்: (இந்த ஹதீஸை எனக்கு அறிவித்த) அபூஇத்ரீஸ் அல்கவ்லானீ (ரஹ்) அவர்கள் இந்த ஹதீஸ் குத்சியை அறிவிக்கும்போது, (இந்த இறைச்செய்தியைக் கண்ணியப்படுத்துவதற்காக) முழந்தாளிட்டு நின்றுகொள்வார்கள். - அபூதர் (ரலி) அவர்கள் அறிவிக்கும் மேற்கண்ட ஹதீஸ் அபூமுஸ்ஹிர் (ரஹ்) அவர்கள் வாயிலாக மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. ஆயினும், மர்வான் பின் முஹம்மத் (ரஹ்) அவர்களே அபூமுஸ்ஹிர் (ரஹ்) அவர்களைவிட ஹதீஸ் அறிவிப்பில் முழுமையானவர் ஆவார். - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூதர் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நான் அநீதியிழைப்பதை என்மீதும் தடை செய்துகொண்டேன். என் அடியார்கள் மீதும் தடைசெய்துவிட்டேன். ஆகவே, நீங்கள் ஒருவருக்கொருவர் அநீதி இழைக்காதீர்கள்\" என்று வளமும் உயர்வும் மிக்க தம் இறைவனிடமிருந்து கூறியதாக ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. ஆயினும், அபூஇத்ரீஸ் அல்கவ்லானீ (ரஹ்) அவர்கள் அறிவித்த மேற்கண்ட ஹதீஸே இதைவிட முழுமையானதாகும். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6573,
			"arabicnumber": "2577.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6574,
			"arabicnumber": "2577.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6575,
			"arabicnumber": "2577.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6576,
			"arabicnumber": "2578",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அநீதியிழைப்பதிலிருந்து தவிர்ந்துகொள்ளுங்கள். ஏனெனில் அநீதியானது, மறுமை நாளில் பல இருள்களாகக் காட்சி தரும். கருமித்தனத்திலிருந்து தவிர்ந்துகொள்ளுங்கள். ஏனெனில் கருமித்தனமானது, உங்களுக்கு முன்னிருந்தவர்களை அழித்தது; இரத்தங்களைச் சிந்துவதற்கும் இறைவனால் அவர்களுக்குத் தடை செய்யப்பட்டவற்றை அனுமதிக்கப் பட்டவையாக ஆக்கிக் கொள்வதற்கும் தூண்டுகோலாக இருந்தது. இதை ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6577,
			"arabicnumber": "2579",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அநீதி, மறுமை நாளில் பல இருள்களாகக் காட்சி தரும். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6578,
			"arabicnumber": "2580",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிம் மற்றொரு முஸ்லிமின் சகோதரன் ஆவான். அவனுக்கு அநீதியிழைக்கவுமாட்டார்; (பிறரது அநீதிக்கு அவன் ஆளாகும்படி) அவனைக் கைவிட்டு விடவுமாட்டார். யார் தம் சகோதரனின் தேவையை நிறைவு செய்வதில் ஈடுபட்டிருக்கிறாரோ அவரது தேவையை நிறைவு செய்வதில் அல்லாஹ்வும் ஈடுபட்டிருக்கிறான். யார் ஒரு முஸ்லிமின் ஒரு துன்பத்தை நீக்குகிறாரோ அதற்குப் பகரமாக அவரைவிட்டு அல்லாஹ் மறுமை நாளில் அவருடைய துன்பங்களில் ஒன்றை நீக்குகிறான். யார் ஒரு முஸ்லிமின் குறைகளை மறைக்கிறாரோ அவருடைய குறைகளை மறுமை நாளில் அல்லாஹ்வும் மறைக்கிறான். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6579,
			"arabicnumber": "2581",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மக்களிடம்), \"திவாலாகிப்போனவன் என்றால் யார் என்று உங்களுக்குத் தெரியுமா?\" என்று கேட்டார்கள். மக்கள், \"யாரிடம் வெள்ளிக்காசோ (திர்ஹம்) பொருட்களோ இல்லையோ அவர்தான் எங்களைப் பொறுத்தவரை திவாலானவர்\" என்று பதிலளித்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"என் சமுதாயத்தாரில் திவாலாகிப்போனவர் ஒருவராவார். அவர் மறுமை நாளில் தொழுகை, நோன்பு, ஸகாத் ஆகியவற்றுடன் வருவார். (அதே நேரத்தில்) அவர் ஒருவரைத் திட்டியிருப்பார். ஒருவர்மீது அவதூறு சொல்லியிருப்பார். ஒருவரது பொருளை (முறைகேடாகப்) புசித்திருப்பார். ஒருவரது இரத்தத்தைச் சிந்தியிருப்பார். ஒருவரை அடித்திருப்பார். ஆகவே, அவருடைய நன்மைகளிலிருந்து சில இவருக்குக் கொடுக்கப்படும்;இன்னும் சில அவருக்குக் கொடுக்கப்படும். அவருடைய நன்மைகளிலிருந்து எடுத்துக் கொடுப்பதற்குமுன் நன்மைகள் தீர்ந்துவிட்டால், (அவரால் பாதிக்கப்பட்ட) மக்களின் பாவங்களிலிருந்து சில எடுக்கப்பட்டு, இவர்மீது போடப்படும். பிறகு அவர் நரக நெருப்பில் தூக்கியெறியப்படுவார் (அவரே திவாலாகிப்போனவர்)\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6580,
			"arabicnumber": "2582",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் உரிமைகளை உரியவர்களிடம் நிச்சயமாக நீங்கள் ஒப்படைப்பீர்கள். எந்த அளவுக்கென்றால்,கொம்பில்லாத ஆட்டுக்காக (அதை முட்டிய) கொம்புள்ள ஆட்டிடம் பழிவாங்கப்படும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6581,
			"arabicnumber": "2583",
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ் (இவ்வுலகில்) அநீதி இழைப்பவனுக்கு (விட்டுக்கொடுத்து) அவகாசமளிப்பான். இறுதியில் அவனைப் பிடித்துவிட்டால், அவனைத் தப்பவிடமாட்டான்\" என்று கூறிவிட்டு, \"அநீதி இழைத்த ஊர்(க்காரர்)களைப் பிடிக்கும்போது இவ்வாறே உம்முடைய இறைவன் பிடிக்கிறான். அவனது பிடி வதைக்கக்கூடியது; கடுமையானது\" (11:102) எனும் இறைவசனத்தை ஓதிக்காட்டினார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6582,
			"arabicnumber": "2584.01",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (ஒரு போரின்போது) முஹாஜிர்களில் ஓர் இளைஞரும் அன்சாரிகளில் ஓர் இளைஞரும் சண்டையிட்டுக்கொண்டனர். அப்போது \"அந்த முஹாஜிர்\" அல்லது \"முஹாஜிர்கள்\", \"முஹாஜிர்களே (உதவிக்கு வாருங்கள்)\" என்று அழைத்தார். அந்த அன்சாரி, \"அன்சாரிகளே! (உதவிக்கு வாருங்கள்)!\" என்று அழைத்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் புறப்பட்டு வந்து, \"என்ன இது, அறியாமைக் காலத்தவரின் கூப்பாடு?\" என்று கேட்டார்கள். அதற்கு மக்கள், \"இல்லை; அல்லாஹ்வின் தூதரே! இளைஞர்கள் இருவர் சண்டையிட்டுக்கொண்டனர். அவர்களில் ஒருவர் மற்றவரின் புட்டத்தில் அடித்துவிட்டார்\" என்று கூறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"பிரச்சினை இல்லை. ஒருவர் தம் சகோதரர் அநீதியிழைப்பவராக இருக்கும் நிலையிலும் அநீதிக்குள்ளானவராக இருக்கும் நிலையிலும் அவருக்கு உதவட்டும். (அது எவ்வாறெனில்) அவர் அநீதியிழைப்பவராக இருந்தால், (அநீதியிழைக்கவிடாமல்) அவரைத் தடுக்கட்டும்! அதுவே அவருக்குச் செய்யும் உதவியாகும். அவர் அநீதியிழைக்கப்பட்டவராக இருந்தால், அவருக்கு உதவி செய்யட்டும்\" என்று கூறினார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6583,
			"arabicnumber": "2584.02",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (\"பனூ முஸ்தலிக்\" எனும்) ஓர் அறப்போரில் நபி (ஸல்) அவர்களுடன் இருந்தோம். அப்போது முஹாஜிர்களில் ஒருவர் அன்சாரிகளில் ஒருவரை (விளையாட்டாக)ப் புட்டத்தில் அடித்துவிட்டார். அப்போது (அடி வாங்கிய) அன்சாரி, \"அன்சாரிகளே! (உதவிக்கு வாருங்கள்)\" என்று அழைத்தார். அந்த முஹாஜிர், \"முஹாஜிர்களே! (உதவிக்கு வாருங்கள்)\" என்று அழைத்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வந்து), \"இது என்ன அறியாமைக் காலக் கூப்பாடு?\" என்று கேட்டார்கள். அதற்கு மக்கள், \"அல்லாஹ்வின் தூதரே! முஹாஜிர்களில் ஒருவர் அன்சாரிகளில் ஒருவரைப் புட்டத்தில் அடித்துவிட்டார்\" என்று கூறினர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இத்தகைய கூப்பாடுகளைக் கைவிடுங்கள். (இனமாச்சரியங்களைத் தூண்டுகின்ற) இக்கூப்பாடுகள் நாற்றம் வீசக்கூடியவை\" என்று கூறினார்கள். அப்போது (மதீனாவாசியான நயவஞ்சகர்களின் தலைவர்) அப்துல்லாஹ் பின் உபை இதைக் கேட்டுவிட்டு \"அப்படியா அவர்கள் (முஹாஜிர்கள்) செய்துவிட்டார்கள்? அல்லாஹ்வின் மீதாணையாக! நாங்கள் மதீனாவுக்குத் திரும்பிச்சென்றால் (எங்கள் இனத்தாரான) கண்ணியவான்கள் இழிந்தோ(ராகிய முஹாஜி)ர்களை நிச்சயமாக அங்கிருந்து வெளியேற்றி விடுவர்\" என்று (அன்சாரிகளுக்காகப்) பேசினார். (இச்செய்தி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கும் தோழர்களுக்கும் எட்டியபோது) உமர் (ரலி) அவர்கள் எழுந்து, \"என்னை விடுங்கள். இந்த நயவஞ்சகனின் கழுத்தை வெட்டிவிடுகிறேன்\" என்று கூறினார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவரை விட்டுவிடுங்கள். முஹம்மத் தம் தோழர்களையே கொலை செய்கிறார் என்று மக்கள் பேசிவிடக் கூடாது\" என்று சொன்னார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6584,
			"arabicnumber": "2584.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6585,
			"arabicnumber": "2585",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6586,
			"arabicnumber": "2586.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒருவருக்கொருவர் அன்பு செலுத்துவதிலும் கருணை புரிவதிலும் பரிவு காட்டுவதிலும் இறை நம்பிக்கையாளர்களின் நிலையானது, ஓர் உடலின் நிலையைப் போன்றதாகும். உடலின் ஓர் உறுப்பு சுகவீனமடைந்தால், அதனுடன் மற்ற உறுப்புகளும் (சேர்ந்துகொண்டு) உறங்காமல் விழித்துக்கொண்டிருக்கின்றன. அத்துடன் உடல் முழுவதும் காய்ச்சலும் கண்டுவிடுகிறது. இதை நுஅமான் பின் பஷீர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் நுஅமான் பின் பஷீர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6587,
			"arabicnumber": "2586.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6588,
			"arabicnumber": "2586.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளர்கள் ஒரே மனிதனைப் போன்றவர்கள். அவனுக்குத் தலையில் சுகவீனமேற்பட்டால் உடல் முழுவதும் காய்ச்சல் கண்டுவிடுகிறது. அதனுடன் மற்ற உறுப்புகளும் (சேர்ந்துகொண்டு) உறங்காமல் விழித்திருக்கின்றன. இதை நுஅமான் பின் பஷீர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: முஸ்லிம்கள் ஒரே மனிதனைப் போன்றவர்கள். அவனது கண்ணுக்கு நோய் ஏற்பட்டால், உடல் முழுவதும் நோய்வாய்ப்படுகிறது. அவனது தலைக்கு நோய் ஏற்பட்டால், உடல் முழுவதும் நோய் காண்கிறது. இதை நுஅமான் பின் பஷீர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் நுஅமான் பின் பஷீர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6589,
			"arabicnumber": "2586.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6590,
			"arabicnumber": "2586.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6591,
			"arabicnumber": "2587",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6592,
			"arabicnumber": "2588",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தர்மம் செல்வத்தைக் குறைப்பதில்லை. மன்னிப்பதால் ஓர் அடியாருக்கு அல்லாஹ் கண்ணியத்தையே அதிகப்படுத்துகிறான். அல்லாஹ்வுக்காக ஒருவர் பணிவு காட்டினால் அவரை அல்லாஹ் உயர்த்தாமல் இருப்பதில்லை. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6593,
			"arabicnumber": "2589",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எங்களிடம்), \"புறம் பேசுதல் என்றால் என்னவென்று உங்களுக்குத் தெரியுமா?\" என்று கேட்டார்கள். அதற்கு மக்கள், \"அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்\" என்று பதிலளித்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீர் உம்முடைய சகோதரரைப் பற்றி அவர் விரும்பாத ஒன்றைக் கூறுவதாகும்\" என்று பதிலளித்தார்கள். அப்போது, \"நான் சொல்லும் குறை என் சகோதரரிடம் இருந்தாலுமா? (புறம் பேசுதலாக ஆகும்), கூறுங்கள்\" என்று கேட்கப்பட்டது. அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீர் சொல்லும் குறை உம்முடைய சகோதரரிடம் இருந்தால்தான், நீர் அவரைப் பற்றிப் புறம் பேசினீர் என்றாகும். நீர் சொன்ன குறை அவரிடம் இல்லாவிட்டாலோ, நீர் அவரைப் பற்றி அவதூறு சொன்னவராவீர்\" என்று கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6594,
			"arabicnumber": "2590.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஓர் அடியார் மற்றோர் அடியாரின் குறையை இவ்வுலகில் மறைத்தால், அவருடைய குறையை அல்லாஹ் மறுமை நாளில் மறைக்காமல் இருப்பதில்லை. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6595,
			"arabicnumber": "2590.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6596,
			"arabicnumber": "2591.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6597,
			"arabicnumber": "2591.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6598,
			"arabicnumber": "2592.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6599,
			"arabicnumber": "2592.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6600,
			"arabicnumber": "2592.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6601,
			"arabicnumber": "2593",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6602,
			"arabicnumber": "2594.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6603,
			"arabicnumber": "2594.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6604,
			"arabicnumber": "2595.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6605,
			"arabicnumber": "2595.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6606,
			"arabicnumber": "2596.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6607,
			"arabicnumber": "2596.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6608,
			"arabicnumber": "2597.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6609,
			"arabicnumber": "2597.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6610,
			"arabicnumber": "2598.01",
			"text": "ஸைத் பின் அஸ்லம் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல் மலிக் பின் மர்வான் (தம் விருந்தினராக வந்திருந்த நபித்தோழியரில் ஒருவரான) உம்முத் தர்தா (ரலி) அவர்களுக்குத் தம் சார்பாக வீட்டு அலங்காரப் பொருட்களை அனுப்பிவைத்தார். (உம்முத் தர்தா (ரலி) அவர்களைத் தம் மனைவியரின் இல்லத்திற்கு வரவழைத்து அவரிடம் நபிமொழிகளைக் கேட்பார்.) ஒரு நாள் இரவில் அப்துல் மலிக் எழுந்து தம் ஊழியரை அழைத்தார். அவர் தாமதமாக வந்த போது அவரைச் சபித்தார். காலையானதும் அப்துல் மலிக்கிடம் உம்முத் தர்தா (ரலி) அவர்கள் கூறினார்கள்: இன்றிரவு நீங்கள் உங்கள் ஊழியரை அழைத்தபோது, அவரைச் சபிப்பதை நான் செவியுற்றேன். (என் கணவர்) அபுத்தர்தா (ரலி) அவர்கள் பின்வருமாறு கூறியதை நான் கேட்டுள்ளேன்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அதிகமாகச் சபிப்பவர்கள் மறுமை நாளில் பரிந்துரைப்பவர்களாகவோ சாட்சியமளிப்பவர்களாகவோ இருக்கமாட்டார்கள்\" எனக் கூறினார்கள். - மேற்கண்ட ஹதீஸ் ஸைத் பின் அஸ்லம் (ரஹ்) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6611,
			"arabicnumber": "2598.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6612,
			"arabicnumber": "2598.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6613,
			"arabicnumber": "2599",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6614,
			"arabicnumber": "2600.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் இரண்டு பேர் வந்தார்கள்; நபியவர்களிடம் எதைப் பற்றியோ பேசினார்கள். அவர்கள் என்ன பேசினார்கள் என்பது எனக்குத் தெரியவில்லை. அவர்கள் இருவரும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைக் கோபப்படுத்திவிட்டனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவ்விருவரையும் சபித்து ஏசிவிட்டார்கள். அவர்கள் இருவரும் சென்றதும், நான், \"அல்லாஹ்வின் தூதரே! நன்மைகளில் எதையேனும் யார் அடைந்துகொண்டாலும், இவ்விருவர் (மட்டும்) அதை அடையப்போவதில்லை\" என்று கூறினேன். அதற்கு \"அது எதனால்?\" என்று நபியவர்கள் கேட்டார்கள். நான், \"அவ்விருவரையும் தாங்கள் சபித்தீர்களே? ஏசினீர்களே?\" என்று பதிலளித்தேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நான் என் இறைவனிடம் நிபந்தனையிட்டுக் கூறியுள்ளதை நீ அறியவில்லையா? \"இறைவா! நான் ஒரு மனிதனே! நான் முஸ்லிம்களில் ஒருவரைச் சபித்திருந்தால், அல்லது ஏசியிருந்தால் அதை அவருக்குப் பாவப் பரிகாரமாகவும் நன்மையாகவும் ஆக்கிவிடுவாயாக\" என்று கூறியுள்ளேன்\" என்றார்கள். - மேற்கண்ட ஹதீஸ் மேலும் ஐந்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ஈசா பின் யூனுஸ் (ரஹ்) அவர்களது அறிவிப்பில், \"அவர்கள் இருவரும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தனியாகப் பேசினர். அப்போது அவ்விருவரையும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஏசினார்கள்;சபித்தார்கள். பிறகு அவ்விருவரையும் வெளியேற்றிவிட்டார்கள்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6615,
			"arabicnumber": "2600.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6616,
			"arabicnumber": "2601.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6617,
			"arabicnumber": "2602.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6618,
			"arabicnumber": "2602.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6619,
			"arabicnumber": "2601.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6620,
			"arabicnumber": "2601.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6621,
			"arabicnumber": "2601.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6622,
			"arabicnumber": "2601.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6623,
			"arabicnumber": "2601.06",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6624,
			"arabicnumber": "2601.07",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6627,
			"arabicnumber": "2603",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6628,
			"arabicnumber": "2604.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6629,
			"arabicnumber": "2604.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6630,
			"arabicnumber": "2526.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6631,
			"arabicnumber": "2526.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6632,
			"arabicnumber": "2526.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6633,
			"arabicnumber": "2605.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6634,
			"arabicnumber": "2605.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6635,
			"arabicnumber": "2605.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6636,
			"arabicnumber": "2606",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6637,
			"arabicnumber": "2607.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6638,
			"arabicnumber": "2607.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6639,
			"arabicnumber": "2607.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6640,
			"arabicnumber": "2607.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6641,
			"arabicnumber": "2608.01",
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எங்களிடம்), \"உங்களில் \"சந்ததியிழந்தவன்\" (அர்ரகூப்) என்று யாரைக் கருதுகிறீர்கள்?\" என்று கேட்டார்கள். \"குழந்தைப் பாக்கியமற்றவரையே (நாங்கள் \"அர்ரக்கூப்\" எனக் கருதுகிறோம்)\" என்று பதிலளித்தோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவன் சந்ததியிழந்தவன் அல்லன். மாறாக,தம் குழந்தைகளில் எதுவும் (தமக்கு) முன்பே இறக்காதவனே சந்ததியிழந்தவன் ஆவான்\" என்று கூறினார்கள். பிறகு, \"உங்களில் வீரன் என யாரைக் கருதுகிறீர்கள்?\" என்று கேட்டார்கள். நாங்கள், \"எவராலும் அடித்து வீழ்த்த முடியாதவனே (வீரன் என நாங்கள் கருதுகிறோம்)\" என்று பதிலளித்தோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவன் வீரனல்லன். மாறாக, வீரன் என்பவன், கோபத்தின்போது தன்னைக் கட்டுப்படுத்திக்கொள்பவனே ஆவான்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6642,
			"arabicnumber": "2608.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6643,
			"arabicnumber": "2609.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6644,
			"arabicnumber": "2609.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6645,
			"arabicnumber": "2609.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6646,
			"arabicnumber": "2610.01",
			"text": "சுலைமான் பின் ஸுரத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் அருகில் இரண்டு மனிதர்கள் ஒருவரையொருவர் ஏசிக்கொண்டனர். அவர்களில் ஒருவருடைய கண்கள் (கோபத்தால்) சிவந்து, கழுத்து நரம்புகள் புடைக்கலாயின. நபி (ஸல்) அவர்கள், \"எனக்கு ஒரு (பிரார்த்தனை) வார்த்தை தெரியும். அதை அவர் சொல்வாராயின் அவருக்கு ஏற்பட்டிருக்கக்கூடிய (கோப) உணர்ச்சி விலகிவிடும். \"அஊது பில்லாஹி மினஷ் ஷைத்தானிர் ரஜீம்\" (ஷைத்தானிடமிருந்து காக்குமாறு அல்லாஹ்விடம் வேண்டுகிறேன்) (என்பதே அது)\" என்று கூறினார்கள். (மக்கள் கோபத்திலிருந்த அந்த மனிதரிடம் இதை எடுத்துரைத்தபோது) அந்த மனிதர், \"எனக்குப் பைத்தியம் பிடித்திருப்பதாகத் தெரிகிறதா?\" என்று கேட்டார். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் இப்னுல் அலா (ரஹ்) அவர்களது அறிவிப்பில், \"அந்த மனிதர்\" எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6647,
			"arabicnumber": "2610.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6648,
			"arabicnumber": "2610.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6649,
			"arabicnumber": "2611.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் (முதல் மனிதர்) ஆதம் (அலை) அவர்களைச் சொர்க்கத்தில் (களிமண்ணால்) படைத்து, தான் நாடிய காலம்வரை அப்படியே விட்டுவிட்டான். இப்லீஸ் அதைச் சுற்றி வந்து அது என்னவென்று உற்றுப் பார்க்கலானான். வயிறு உள்ளதாக அதைக் கண்டபோது \"தன்னைத்தானே கட்டுப்படுத்திக்கொள்ள முடியாத (கட்டுப்பாடற்ற) படைப்பாகவே அது படைக்கப்பட்டுள்ளது\" என அவன் அறிந்துகொண்டான். இதை அனஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6650,
			"arabicnumber": "2611.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6651,
			"arabicnumber": "2612.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6652,
			"arabicnumber": "2612.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6653,
			"arabicnumber": "2612.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6654,
			"arabicnumber": "2612.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6655,
			"arabicnumber": "2612.05",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தம் சகோதரரிடம் சண்டையிட்டால், முகத்தில் அடிப்பதைத் தவிர்க்கட்டும். ஏனெனில், அல்லாஹ் (முதல் மனிதர்) ஆதமைத் தனது உருவத்திலேயே படைத்தான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6656,
			"arabicnumber": "2612.06",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தம் சகோதரரிடம் சண்டையிட்டால், முகத்தில் அடிப்பதைத் தவிர்க்கட்டும்! இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6657,
			"arabicnumber": "2613.01",
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: (ஒரு முறை) ஹிஷாம் பின் ஹகீம் பின் ஹிஸாம் (ரலி) அவர்கள் ஷாம் (சிரியா) நாட்டில் மக்களில் சிலரைக் கடந்துசென்றார்கள். அவர்களது தலையில் ஆலிவ் எண்ணெய் ஊற்றப்பட்டு வெயிலில் நிறுத்தி வைக்கப்பட்டிருந்தனர். ஹிஷாம் (ரலி) அவர்கள், \"என்ன இது?\" என்று கேட்டார்கள். \"கராஜ் (வரி செலுத்தாதது) தொடர்பாகத் தண்டிக்கப்படுகின்றனர்\" என்று சொல்லப் பட்டது. அப்போது ஹிஷாம் (ரலி) அவர்கள், \"அறிக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவ்வுலகில் மக்களை (நியாயமின்றி) வேதனை செய்பவர்களை அல்லாஹ் வேதனை செய்வான்” என்று கூறியதை நான் கேட்டுள்ளேன்\"என்றார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6658,
			"arabicnumber": "2613.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6659,
			"arabicnumber": "2613.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6660,
			"arabicnumber": "2613.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6661,
			"arabicnumber": "2614.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6662,
			"arabicnumber": "2614.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6663,
			"arabicnumber": "2614.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6664,
			"arabicnumber": "2615.01",
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உங்களில் ஒருவர் பள்ளிவாசலிலோ அல்லது கடைத்தெருவிலோ தமது கையில் அம்புடன் நடந்துசென்றால், அதன் முனையைப் பிடித்து (மறைத்து)க் கொண்டு செல்லட்டும்; அதன் முனையைப் பிடித்து (மறைத்து)க்கொண்டு செல்லட்டும்; அதன் முனையைப் பிடித்து (மறைத்து)க்கொண்டு செல்லட்டும்!\" என்று (மும்முறை) கூறினார்கள். ஆனால், அல்லாஹ்வின் மீதாணையாக! எங்களில் சிலர் வேறுசிலரின் முகங்களுக்கெதிரே அம்புகளை உயர்த்திப் பிடிக்காத வரையில் நாங்கள் இறக்கவில்லை. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6665,
			"arabicnumber": "2615.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6666,
			"arabicnumber": "2616.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அபுல்காசிம் (முஹம்மத் - ஸல்) அவர்கள், \"ஒருவர் தம் சகோதரரை நோக்கி ஆயுதத்தைக் காட்டி சைகை செய்தால்,அவர் அதைக் கைவிடும்வரை அவரை வானவர்கள் சபிக்கின்றனர். அவர் உடன்பிறந்த சகோதரராய் இருந்தாலும் சரியே\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6667,
			"arabicnumber": "2616.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6668,
			"arabicnumber": "2617",
			"text": "ஹம்மாம் பின் முனப்பிஹ் (ரஹ்) அவர்கள் கூறியதாவது: இவை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து அபூஹுரைரா (ரலி) அவர்கள் எமக்கு அறிவித்த ஹதீஸ்களாகும். அவற்றில் பின்வரும் ஹதீஸும் ஒன்றாகும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நீங்கள் உங்கள் சகோதரரை நோக்கி ஆயுதத்தைக் காட்டி சைகை செய்யவேண்டாம். ஏனெனில், உங்களுக்குத் தெரியாமலேயே ஷைத்தான் உங்கள் கையிலிருந்து அதைப் பறித்து (சகோதரரைத் தாக்கி)விடக்கூடும். அதனால் நீங்கள் நரகப் படுகுழியில் வீழ்ந்து விடுவீர்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6669,
			"arabicnumber": "1914.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு மனிதர் ஒரு சாலை வழியே நடந்து செல்லும்போது பாதையில் முட்கிளையொன்றைக் கண்டார். உடனே அதை (எடுத்து) தள்ளிப்போட்டார். அவரது இந்த நற்செயலை அல்லாஹ் நன்றியுடன் ஏற்று, அவருக்குப் பாவமன்னிப்பு அருளினான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6670,
			"arabicnumber": "1914.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6671,
			"arabicnumber": "1914.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6672,
			"arabicnumber": "1914.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6673,
			"arabicnumber": "2618.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6674,
			"arabicnumber": "2618.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6675,
			"arabicnumber": "2242.04",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: பூனையொன்றைச் சாகும்வரை சிறை வைத்த காரணத்தால் ஒரு பெண் நரகத்தில் நுழைந்தாள். அதை அடைத்து வைத்திருந்தபோது, அவள் அதற்குத் தீனியும் போடவில்லை; குடிப்பதற்கும் (எதுவும்) கொடுக்கவில்லை; பூமியின் புழுப்பூச்சிகளைத் தின்பதற்கு அதை அவள் (திறந்து)விடவுமில்லை. இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6676,
			"arabicnumber": "2242.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6677,
			"arabicnumber": "2242.06",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6678,
			"arabicnumber": "2242.07",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6679,
			"arabicnumber": "2619",
			"text": "ஹம்மாம் பின் முனப்பிஹ் (ரஹ்) அவர்கள் கூறியதாவது: இவை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து அபூஹுரைரா (ரலி) அவர்கள் எமக்கு அறிவித்த ஹதீஸ்களாகும். அவற்றில் பின்வரும் ஹதீஸும் ஒன்றாகும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு பெண், தான் கட்டிவைத்த பூனையொன்றின் காரணத்தால் நரகத்திற்குள் நுழைந்தாள். அவள் அதற்குத் தீனி போடவுமில்லை. பூமியிலுள்ள புழுப்பூச்சிகளைத் தின்று (பிழைத்துக்) கொள்ளட்டும் என்று அதை அவிழ்த்துவிடவுமில்லை. இறுதியில் அது (பட்டினியால்) மெலிந்துபோய் செத்துவிட்டது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6680,
			"arabicnumber": "2620",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6681,
			"arabicnumber": "2621",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6682,
			"arabicnumber": "2622",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6683,
			"arabicnumber": "2623.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6684,
			"arabicnumber": "2623.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6685,
			"arabicnumber": "2624.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6686,
			"arabicnumber": "2624.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6687,
			"arabicnumber": "2625.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6688,
			"arabicnumber": "2625.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6689,
			"arabicnumber": "2625.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6690,
			"arabicnumber": "2626",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6691,
			"arabicnumber": "2627",
			"text": "அபூதர் (ரலி) அவர்கள் கூறியதாவது: என்னிடம் நபி (ஸல்) அவர்கள், \"நல்லறங்களில் எதையும் அற்பமாகக் கருதாதீர்; உம்முடைய சகோதரரை மலர்ந்த முகத்துடன் நீர் சந்திப்பதானாலும் சரியே\" என்று கூறினார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6692,
			"arabicnumber": "2628",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6693,
			"arabicnumber": "2629",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6694,
			"arabicnumber": "2630",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6695,
			"arabicnumber": "2631",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"யார் இரு பெண்குழந்தைகளை, அவர்கள் பருவ வயதடையும் வரை பொறுப்பேற்று கருத்தாக வளர்க்கிறாரோ அவரும் நானும் மறுமை நாளில் இப்படி வருவோம்\" என்று கூறிவிட்டு, தம் விரல்களை இணைத்துக் காட்டினார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6696,
			"arabicnumber": "2632.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6697,
			"arabicnumber": "2632.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: ஒரு முஸ்லிமுடைய பிள்ளைகளில் மூவர் (பருவ வயதுக்கு முன்பே) இறந்துபோனால், அந்த மனிதரை நரகம் தீண்டாது; (\"உங்களில் யாரும் நரகத்தைக் கடக்காமல் செல்ல முடியாது\" என்று அல்லாஹ் செய்துள்ள) சத்தியத்தைச் செயல்படுத்துவதற்காக (நரகத்தின் வழியே செல்வதை)த் தவிர. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் ஐந்து அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் சுஃப்யான் பின் உயைனா (ரஹ்) அவர்களது அறிவிப்பில், \"அந்த மனிதர் நரகத்தில் நுழையமாட்டார்; (\"உங்களில் யாரும் நரகத்தைக் கடக்காமல் செல்ல முடியாது\" என்று அல்லாஹ் செய்துள்ள) சத்தியத்தைச் செயல்படுத்துவதற்காக (நரகத்தின் வழியே செல்வதை)த் தவிர\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6698,
			"arabicnumber": "2632.03",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்சாரிப் பெண்களிடம், \"உங்களில் ஒருவருடைய மூன்று பிள்ளைகள் (பருவ வயதை அடைவதற்குமுன்) இறந்தும் அப்பெண் நன்மையை எதிர்பார்(த்து பொறுமை கா)த்தால்,அவர் சொர்க்கத்தில் நுழையாமல் இருப்பதில்லை\" என்று கூறினார்கள். அப்போது அப்பெண்களில் ஒருவர், \"அல்லாஹ்வின் தூதரே! இரு பிள்ளைகள் இறந்தாலுமா?\" என்று கேட்டார். \"இரு பிள்ளைகள் இறந்தாலும்தான்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் விடையளித்தார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6699,
			"arabicnumber": "2633",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு பெண்மணி வந்து, \"அல்லாஹ்வின் தூதரே! (பெண்கள்) உங்கள் உரைகளை(க் கேட்க முடியாதவாறு) ஆண்களே (அந்த வாய்ப்புகளைத்) தட்டிச் சென்றுவிடுகின்றனர். ஆகவே,எங்களுக்கென ஒரு நாளை நீங்களே நிர்ணயம் செய்யுங்கள். அந்நாளில் நாங்கள் தங்களிடம் வருகிறோம். அல்லாஹ் தங்களுக்குக் கற்றுக் கொடுத்தவற்றிலிருந்து எங்களுக்கு நீங்கள் கற்றுக்கொடுங்கள்\" என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இன்ன இன்ன நாளில் நீங்கள் ஒன்று கூடுங்கள்\" என்று சொன்னார்கள். அவ்வாறே அவர்கள் ஒன்றுகூடினர். அந்த நாட்களில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பெண்களிடம் சென்று தமக்கு அல்லாஹ் கற்றுக் கொடுத்தவற்றிலிருந்து அப்பெண்களுக்குக் கற்றுக்கொடுத்தார்கள். (ஒரு நாள்), \"உங்களில் எந்தப் பெண் தனக்கு (மரணம் வருவதற்கு) முன்பாக, தன் பிள்ளைகளில் மூன்று பேரை இழந்துவிடுகிறாரோ அவருக்கு அப்பிள்ளைகள் நரகத்திலிருந்து காக்கும் திரையாக மாறிவிடுவார்கள்\" என்று சொன்னார்கள். அப்போது அப்பெண்களில் ஒருவர், \"இரண்டு பிள்ளைகளை இழந்துவிட்டாலுமா? இரண்டு பிள்ளைகளை இழந்துவிட்டாலுமா? இரண்டு பிள்ளைகளை இழந்துவிட்டாலுமா?\" என்று (மூன்றுமுறை திரும்பத்திரும்பக்) கேட்க, \"இரண்டு பிள்ளைகளை இழந்துவிட்டாலும்தான்; இரண்டு பிள்ளைகளை இழந்துவிட்டாலும்தான்; இரண்டு பிள்ளைகளை இழந்துவிட்டாலும் தான்\" என்று (மும்முறை) நபியவர்கள் பதிலளித்தார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6700,
			"arabicnumber": "2634",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6703,
			"arabicnumber": "2636.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நபி (ஸல்) அவர்களிடம் ஒரு பெண்மணி தன் குழந்தையுடன் வந்து, \"அல்லாஹ்வின் தூதரே! (உடல் நலமில்லாத) இந்தக் குழந்தைக்காகப் பிரார்த்தியுங்கள். (இதற்குமுன்) நான் மூன்று குழந்தைகளை நல்லடக்கம் செய்துவிட்டேன்\" என்று கூறினார். \"மூன்று குழந்தைகளை நல்லடக்கம் செய்துவிட்டாயா?\" என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அதற்கு அப்பெண், \"ஆம்\" என்றார். நபி (ஸல்) அவர்கள், \"நரக நெருப்பிலிருந்து (உன்னைக் காக்க) நீ பலமான வேலி அமைத்துக்கொண்டுவிட்டாய்\" என்று சொன்னார்கள். மேற்கண்ட ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6704,
			"arabicnumber": "2636.02",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் ஒரு பெண்மணி தன்னுடைய ஆண் குழந்தையுடன் வந்து, \"அல்லாஹ்வின் தூதரே! இவன் உடல் நலிவுற்றுள்ளான். இவனுக்கு ஏதேனும் நேர்ந்து விடுமோ என நான் அஞ்சுகிறேன். (இதற்கு முன்) நான் மூன்று குழந்தைகளை நல்லடக்கம் செய்துவிட்டேன்\" என்று கூறினார். நபி (ஸல்) அவர்கள், \"நரக நெருப்பிலிருந்து (உன்னைக் காக்க) நீ பலமான வேலி அமைத்துக்கொண்டுவிட்டாய்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 6705,
			"arabicnumber": "2637.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் ஓர் அடியாரை நேசிக்கும்போது, (வானவர்) ஜிப்ரீல் (அலை) அவர்களை அழைத்து, \"நான் இன்ன மனிதரை நேசிக்கிறேன். நீரும் நேசிப்பீராக\" என்று கூறுகின்றான். ஆகவே, ஜிப்ரீல் (அலை) அவர்களும் அவரை நேசிப்பார். பிறகு ஜிப்ரீல் (அலை) அவர்கள் வானத்தில், \"அல்லாஹ் இன்ன மனிதரை நேசிக்கிறான். ஆகவே, நீங்களும் அவரை நேசியுங்கள்\" என்று அறிவிப்பார். அவ்வாறே விண்ணகத்தாரும் அவரை நேசிப்பார்கள். பிறகு பூமியில் அவருக்கு அங்கீகாரம் வழங்கப்படும். அவ்வாறே, அல்லாஹ் ஓர் அடியார்மீது கோபம் கொள்ளும்போது, (வானவர்) ஜிப்ரீல் (அலை) அவர்களை அழைத்து, \"நான் இன்ன மனிதர்மீது கோபம் கொண்டுள்ளேன். நீரும் அவர்மீது கோபம் கொள்வீராக\" என்று கூறுகின்றான். ஆகவே, ஜிப்ரீல் (அலை) அவர்களும் அவர்மீது கோபம் கொள்கிறார். பிறகு ஜிப்ரீல் (அலை) அவர்கள்,விண்ணகத்தாரிடையே, \"அல்லாஹ் இன்ன மனிதர்மீது கோபம் கொண்டுள்ளான். ஆகவே, நீங்களும் அவர்மீது கோபம் கொள்ளுங்கள்\" என்று அறிவிப்பார். அவ்வாறே விண்ணகத்தாரும் அவர்மீது கோபம் கொள்வார்கள். பிறகு பூமியில் அவர்மீது கோபம் ஏற்படுத்தப்படுகிறது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் கோபத்தைப் பற்றிய குறிப்பு இல்லை. (நேசத்தைப் பற்றிய குறிப்பு மட்டுமே இடம்பெற்றுள்ளது.) அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6706,
			"arabicnumber": "2637.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6707,
			"arabicnumber": "2637.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6708,
			"arabicnumber": "2638.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6709,
			"arabicnumber": "2638.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6710,
			"arabicnumber": "2639.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6713,
			"arabicnumber": "2639.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6714,
			"arabicnumber": "2639.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6715,
			"arabicnumber": "2639.06",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6716,
			"arabicnumber": "2639.07",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6717,
			"arabicnumber": "2639.08",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6718,
			"arabicnumber": "2640.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6719,
			"arabicnumber": "2640.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6720,
			"arabicnumber": "2641",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6721,
			"arabicnumber": "2642.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6722,
			"arabicnumber": "2642.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 217
			}
		}
	]
}