{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"46": "The Book of Destiny"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6723,
			"arabicnumber": "2643.01",
			"text": "உண்மையே பேசியவரும் உண்மையே அறிவிக்கப்பட்டவருமான அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் தம் தாயின் வயிற்றில் நாற்பது நாட்கள் (கருவாக) சேமிக்கப்படுகிறார். பிறகு வயிற்றிலேயே அதைப் போன்றே (நாற்பது நாட்கள்) அந்தக் கரு (அட்டை போன்று கருப்பையின் சுவரைப் பற்றிப் பிடித்துத் தொங்கும்) ஒரு கருக்கட்டியாக மாறுகிறது. பிறகு வயிற்றில் அதைப் போன்றே (மேலும் நாற்பது நாட்கள் மெல்லப்பட்ட சக்கை போன்ற) ஒரு சதைப் பிண்டமாக மாறிவிடுகிறது. பிறகு அதனிடம் ஒரு வானவர் அனுப்பப்படுகிறார். அவர் அதில் உயிரை ஊதுகிறார். (அதற்கு முன்பே) அந்த மனிதனின் வாழ்வாதாரம், வாழ்நாள், செயல்பாடு, அவன் நற்பேறற்றவனா அல்லது நற்பேறு பெற்றவனா ஆகிய நான்கு விஷயங்களை எழுதுமாறு அவர் பணிக்கப்படுகிறார். எவனைத் தவிர வேறு இறைவன் இல்லையோ அ(ந்த ஓரிறை)வன் மீதாணையாக! உங்களில் ஒருவர் சொர்க்கவாசிகளின் (நற்)செயலைச் செய்துகொண்டே செல்வார். அவருக்கும் சொர்க்கத்துக்குமிடையே ஒரு முழம் இடைவெளிதான் இருக்கும்; அதற்குள் விதி அவரை முந்திக்கொள்ள, அவர் நரகவாசிகளின் செயலைச் செய்து அதன் காரணத்தால் நரகத்தினுள் புகுந்துவிடுவார். (இதைப் போன்றே) உங்களில் ஒருவர் நரகவாசிகளின் (தீய)செயலைச் செய்துகொண்டே செல்வார். இறுதியில் அவருக்கும் நரகத்துக்குமிடையே ஒரு முழம் இடைவெளிதான் இருக்கும்; அதற்குள் அவரது விதி அவரை முந்திக்கொள்ள, அவர் சொர்க்கவாசிகளின் செயலைச் செய்து அதன் விளைவாகச் சொர்க்கத்தில் புகுந்துவிடுவார். இதை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மேலும் ஐந்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் வகீஉ (ரஹ்) அவர்களது அறிவிப்பில், \"உங்களில் ஒருவர் தம் தாயின் வயிற்றில் நாற்பது இரவுகள் (கருவாக) சேமிக்கப்படுகிறார்\" என்று காணப்படுகிறது. ஷுஅபா (ரஹ்) அவர்களிடமிருந்து முஆத் (ரஹ்) அவர்கள் அறிவிக்கும் அறிவிப்பில், \"நாற்பது இரவுகளும் நாற்பது பகல்களும்\" என்று இடம் பெற்றுள்ளது. ஜரீர் மற்றும் ஈசா (ரஹ்) ஆகியோரது அறிவிப்பில் \"நாற்பது நாட்கள்\" என்று உள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6724,
			"arabicnumber": "2643.02",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6725,
			"arabicnumber": "2644",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: விந்துத்துளி தாயின் கருப்பையில் நாற்பது அல்லது நாற்பத்தைந்து நாட்கள் தங்கியிருந்த பின்னர் அந்த விந்துத்துளிக்குள் வானவர் ஒருவர் சென்று, \"இறைவா! இவன் நற்பேறற்றவனா?அல்லது நற்பேறு பெற்றவனா?\" என்று கேட்கிறார். பிறகு (இறைக்கட்டளைக்கேற்ப) அதைக் குறித்து எழுதப்படுகிறது. பிறகு \"இறைவா! இது ஆணா? அல்லது பெண்ணா?\" என்று கேட்டு அதற்கேற்ப எழுதப்படுகிறது. அவனுடைய செயல்பாடு, இயக்கம், வாழ்நாள், வாழ்வாதாரம் ஆகியவையும் எழுதப்படுகின்றன. பிறகு ஏடுகள் சுருட்டப்பட்டுவிடுகின்றன. பிறகு அதில் கூட்டப் படுவதுமில்லை; குறைக்கப்படுவதுமில்லை. இதை ஹுதைஃபா பின் அசீத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6726,
			"arabicnumber": "2645.01",
			"text": "அபுத்துஃபைல் ஆமிர் பின் வாஸிலா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், \"நற்பேறற்றவன் என்பவன், தன் தாயின் வயிற்றிலேயே நற்பேறற்றவனா(கப் பதிவா)கிவிட்டவன் ஆவான்; நற்பேறு பெற்றவன் என்பவன், பிறர் மூலம் அறிவுரை வழங்கப்பட்டவன் ஆவான்\" என்று கூறியதைக் கேட்டேன். உடனே நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தோழர்களில் ஹுதைஃபா பின் அசீத் அல்ஃகிஃபாரீ (ரலி) எனப்படும் ஒருவரிடம் சென்று, அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதைத் தெரிவித்துவிட்டு, \"செயல்படாமலேயே ஒருவன் எவ்வாறு நற்பேறற்றவனாக ஆகமுடியும்?\" என்று கேட்டேன். அதற்கு ஹுதைஃபா பின் அசீத் (ரலி) அவர்கள் கூறினார்கள்: இதைக்கேட்டு நீங்கள் வியப்படைகிறீர்களா? அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பின்வருமாறு) கூறியதை நான் கேட்டுள்ளேன்: விந்து கருப்பைக்குச் சென்று நாற்பத்து இரண்டு இரவுகள் கழிந்ததும் அதனிடம் அல்லாஹ் வானவர் ஒருவரை அனுப்புகிறான். பிறகு (மூன்றாவது நாற்பது கழிந்தபின்) அதற்கு உருவமளித்து, அதற்குச் செவிப்புலனையும் பார்வையையும் தோலையும் சதையையும் எலும்பையும் படைக்கிறான். பிறகு (நாற்பத்து இரண்டு நாட்கள் கழிந்ததும் அனுப்பப்பட்ட) அந்த வானவர், \"இறைவா! இது ஆணா, பெண்ணா?\" என்று கேட்கிறார். அப்போது உம்முடைய இறைவன் தான் நாடியதைத் தீர்ப்பளிக்கிறான். (அவ்வாறே) அந்த வானவரும் எழுதிப் பதிவு செய்கிறார். பிறகு அவர், \"இறைவா! இதன் வாழ்நாள் (எவ்வளவு?)\" என்று கேட்கிறார். அப்போது உம்முடைய இறைவன் தான் நாடியதைச் சொல்கிறான். (அதன்படி) அந்த வானவரும் எழுதிப் பதிவு செய்கிறார். பிறகு அவர், \"இறைவா! இதன் வாழ்வாதாரம் (எவ்வளவு)?\" என்று கேட்கிறார். அப்போது உம்முடைய இறைவன் தான் நாடியதைத் தீர்ப்பளிக்கிறான். (அதன்படி) அந்த வானவரும் எழுதிப் பதிவு செய்துவிட்டுப் பிறகு தமது கையில் அந்த ஏட்டை எடுத்துக்கொண்டு வெளியேறிவிடுகிறார். (தமக்கு) ஆணையிடப்பட்டதைவிட அவர் கூட்டுவதுமில்லை; குறைப்பதுமில்லை. மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6727,
			"arabicnumber": "2645.02",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6728,
			"arabicnumber": "2645.03",
			"text": "அபுத்துஃபைல் ஆமிர் பின் வாஸிலா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நான் அபூசரீஹா ஹுதைஃபா பின் அசீத் அல்ஃகிஃபாரீ (ரலி) அவர்களிடம் சென்றேன். அப்போது அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பின்வருமாறு கூறியதை இந்த என் காதுகளால் கேட்டேன் என்று கூறினார்கள்: விந்துத்துளி தாயின் கருப்பையில் நாற்பது இரவுகள் தங்கியிருக்கிறது. பிறகு அதனுள் வானவர் ஒருவர் ஊடுருவுகிறார் \"அதைப் படைக்கவிருக்கும் வானவர்\" என்று அப்துல்லாஹ் பின் அதாஉ (ரஹ்) அவர்கள் கூறினார்கள் என்றே நான் கருதுகிறேன் என்கிறார் அறிவிப்பாளர் ஸுஹைர் அபூகைஸமா. பிறகு அவ்வானவர் \"இது ஆணா,பெண்ணா?\" என்று கேட்கிறார். அப்போது அல்லாஹ் அதை ஆணாகவோ அல்லது பெண்ணாகவோ ஆக்குகிறான். பிறகு அவ்வானவர், \"இறைவா! இவன் ஊனமற்றவனா? ஊனமுள்ளவனா?\" என்று கேட்கிறார். அப்போது அவனை அல்லாஹ் ஆரோக்கியமானவனாகவோ அல்லது ஆரோக்கியமற்றவனாகவோ ஆக்குகிறான். பிறகு அவ்வானவர், \"இவனது வாழ்வாதாரம் என்ன? இவனது வாழ்நாள் எவ்வளவு? இவனுடைய குணங்கள் என்ன?\" என்று கேட்கிறார். பிறகு அவனை அல்லாஹ் நற்பேறற்றவனாகவோ அல்லது நற்பேறு பெற்றவனாகவோ ஆக்குகிறான். - மேற்கண்ட ஹதீஸ் நபித்தோழர் ஹுதைஃபா பின் அசீத் அல்ஃகிஃபாரீ (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"அல்லாஹ் தனது நாட்டப்படி எதையேனும் படைக்க நாடும்போது, நாற்பதுக்கு மேற்பட்ட இரவுகள் கழிந்தபின் அந்தக் கருப்பைக்கென நியமிக்கப்பட்ட வானவர் ஒருவர்...\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6729,
			"arabicnumber": "2645.04",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6730,
			"arabicnumber": "2646",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: வல்லமையும் மாண்பும் மிக்க அல்லாஹ் தாயின் கருப்பைக்கென வானவர் ஒருவரைப் பொறுப்பாளராக நியமிக்கிறான். அவர், \"இறைவா! இது (ஒரு துளி) விந்து. இறைவா! இது பற்றித் தொங்கும் கரு. இறைவா! இது (மெல்லப்பட்ட சக்கை போன்ற) சதைப் பிண்டம்\" என்று கூறிக்கொண்டிருப்பார். அதை அல்லாஹ் படைத்(து உயிர் தந்)திட நாடும்போது, \"இறைவா! இது ஆணா,பெண்ணா? நற்பேறற்றதா? நற்பேறு பெற்றதா? (இதன்) வாழ்வாதாரம் எவ்வளவு? (இதன்) ஆயுள் எவ்வளவு?\" என்று கேட்பார். (அல்லாஹ்வால் இவையனைத்தும் தெரிவிக்கப்பட்டு) தாய் வயிற்றில் அது இருக்கும் போதே பதிவு செய்யப்படுகின்றன. இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6731,
			"arabicnumber": "2647.01",
			"text": "அலீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் பிரேத நல்லடக்கம் (ஜனாஸா) ஒன்றில் கலந்துகொள்வதற்காக \"பகீஉல் ஃகர்கத்\" பொது மையவாடியில் இருந்தோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் வந்து அமர்ந்தார்கள். நாங்களும் அவர்களைச் சுற்றி அமர்ந்தோம். நபியவர்களுடன் ஓர் ஊன்றுகோல் இருந்தது. அப்போது அவர்கள் (தமது தலையைக்) கவிழ்த்தவாறு ஊன்றுகோலைத் தரையில் குத்திக் கீறியபடி (ஆழ்ந்த கவலையிலும் யோசனையிலும்) இருக்கலானார்கள். பிறகு, \"உங்களில் யாரும், பிறந்துவிட்ட எந்த உயிரும் தமது இருப்பிடம் சொர்க்கத்திலா, அல்லது நரகத்திலா என்று அல்லாஹ்வால் எழுதப்படாமல் இருப்பதில்லை; அது நற்பேறற்றதா, அல்லது நற்பேறு பெற்றதா என்று எழுதப்பட்டிராமல் இல்லை\" என்று சொன்னார்கள். அப்போது ஒரு மனிதர், \"அல்லாஹ்வின் தூதரே! நாங்கள் நல்லறங்கள் செய்யாமல், எங்கள் (தலை) எழுத்தின் மீது (பாரத்தைப் போட்டுவிட்டு) இருந்துவிடமாட்டோமா\" என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"யார் (விதியில்) நற்பேறு பெற்றவராக இருப்பாரோ அவர் நற்பேறு பெற்றவர்களின் செயலுக்கு மாறுவார். யார் (விதியில்) நற்பேறற்றவராக இருப்பாரோ அவர் நற்பேறற்றவர்களின் செயலுக்கு மாறுவார்\" என்று கூறினார்கள். மேலும் அவர்கள், \"நீங்கள் செயலாற்றுங்கள். (நல்லார், பொல்லார்) எல்லாருக்கும் (அவரவர் செல்லும்வழி) எளிதாக்கப்பட்டுள்ளது. நல்லவருக்கு நல்லவர்களின் செயலைச் செய்ய வகை செய்யப்படும். கெட்டவருக்குக் கெட்டவர்களின் செயலைச் செய்ய வகைசெய்யப்படும்\" என்று கூறினார்கள். பிறகு \"யார் (பிறருக்கு) வழங்கி (இறைவனை) அஞ்சி, நல்லவற்றை உண்மைப் படுத்துகிறாரோ அவருக்குச் சுலபமான வழியை எளிதாக்குவோம். யார் கஞ்சத்தனம் செய்து, தேவையற்றவராகத் தன்னைக் கருதி, நல்லதை நம்ப மறுக்கிறாரோ, அவருக்குச் சிரமத்தின் வழியை எளிதாக்குவோம்\" (92:5-10) எனும் வசனங்களை ஓதிக்காட்டினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"குச்சியொன்றை எடுத்தார்கள்\" என்று காணப்படுகிறது. \"ஊன்றுகோல்\" எனும் குறிப்பு இல்லை. \"பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்த வசனங்களை ஓதினார்கள்\" என அபுல்அஹ்வஸ் (ரஹ்) அவர்களது அறிவிப்பில் காணப்படுகிறது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6732,
			"arabicnumber": "2647.02",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6733,
			"arabicnumber": "2647.03",
			"text": "அலீ (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது கையிலிருந்த குச்சியால் தரையைக் குத்திக் கீறியபடி (தலையைக் கவிழ்த்தவாறு) உட்கார்ந்திருந்தார்கள். பிறகு தமது தலையை உயர்த்தி, \"உங்களில் (பிறந்துவிட்ட) எவருக்கும் சொர்க்கத்திலுள்ள, அல்லது நரகத்திலுள்ள அவரது இருப்பிடம் அறியப்படாமல் இருப்பதில்லை\" என்று கூறினார்கள். மக்கள், \"அல்லாஹ்வின் தூதரே! பிறகு எதற்காக நாங்கள் நல்லறங்கள் செய்ய வேண்டும்? நாங்கள் (எங்கள் விதியின் மீது) பாரத்தைப் போட்டுவிட்டு (நல்லறங்கள் ஏதும் செய்யாமல்) இருந்துவிடமாட்டோமா?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இல்லை; நீங்கள் செயலாற்றுங்கள். (நல்லார், பொல்லார்) எல்லாருக்கும் அவரவர் எதற்காகப் படைக்கப்பட்டுள்ளனரோ அது எளிதாக்கப்படும்\" என்று கூறினார்கள். பிறகு, \"யார் (பிறருக்கு) வழங்கி (இறைவனை) அஞ்சி, நல்லவற்றை உண்மைப் படுத்துகிறாரோ...\" என்று தொடங்கி, \"சிரமத்தின் வழியை எளிதாக்குவோம்\" (92:5-10) என்பது வரை ஓதிக்காட்டினார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அலீ (ரலி) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6734,
			"arabicnumber": "2647.04",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6735,
			"arabicnumber": "2648.01",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: (\"விடைபெறும்\" ஹஜ்ஜின்போது) சுராக்கா பின் மாலிக் பின் ஜுஅஷும் (ரலி) அவர்கள் (நபி (ஸல்) அவர்களிடம்) வந்து, \"அல்லாஹ்வின் தூதரே! நாங்கள் இப்போதுதான் படைக்கப்பட்டிருக்கிறோம் என்பதைப் போன்று (எண்ணிக்கொண்டு) எங்களுக்கு எங்களது மார்க்கத்தைத் தெளிவாகச் சொல்லுங்கள். இன்றைக்கு நல்லறங்கள் புரிவது எப்படி? எழுதுகோல்கள் எழுதி முடித்துவிட்ட, (ஏற்கெனவே) நடந்துவிட்ட விதிகளின்படியா? அல்லது (புதிதாக) நாங்களாகவே எதிர்கொள்ளும் (செயல்பாடுகளின்) அடிப்படையிலா?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இல்லை; மாறாக எழுதுகோல்கள் எழுதி முடித்துவிட்ட, (ஏற்கெனவே) நடந்து விட்ட விதிகளின்படிதான்\" என்று கூறினார்கள். சுராக்கா (ரலி) அவர்கள், \"அப்படியானால் நாங்கள் ஏன் நல்லறங்கள் புரிய வேண்டும்?\" என்று கேட்டார்கள். (அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், என்ன கூறினார்கள் என்பதை அறிவித்த) அபுஸ்ஸுபைர் (ரஹ்) அவர்கள் ஏதோ சொன்னார்கள். அதை நான் புரிந்து கொள்ளவில்லை. \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்ன சொன்னார்கள்?\"என்று நான் (ஸுஹைர்) கேட்டேன். அதற்கு அபுஸ்ஸுபைர் (ரஹ்) அவர்கள், \"நீங்கள் செயலாற்றுங்கள். (நல்லார், பொல்லார்) எல்லாருக்கும் அவரவர் செல்லும் பாதை எளிதாக்கப்பட்டுள்ளது\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஜாபிர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"செயலாற்றக்கூடிய ஒவ்வொருவரும் தமது செயலுக்கு வழிவகை செய்யப்படுவார்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6736,
			"arabicnumber": "2648.02",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6737,
			"arabicnumber": "2649.01",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6738,
			"arabicnumber": "2649.02",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6739,
			"arabicnumber": "2650",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6740,
			"arabicnumber": "2651",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு மனிதர் நீண்ட காலம் சொக்கவாசிகளின் (நற்)செயலைச் செய்துகொண்டே வருவார். பிறகு அவரது செயல் நரகவாசிகளின் செயலாக முடிக்கப்படும். ஒரு மனிதர் நீண்ட காலம் நரகவாசிகளின் (தீய)செயலைச் செய்துகொண்டே வருவார். பிறகு அவரது செயல் சொர்க்கவாசிகளின் செயலாக முடிக்கப்படும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6741,
			"arabicnumber": "112.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு மனிதர், மக்களின் பார்வையில் சொர்க்கவாசிகளின் செயலைச் செய்துகொண்டே இருப்பார். (உண்மையில்) அவர் நரகவாசிகளில் ஒருவராய் இருப்பார். ஒரு மனிதர், மக்களின் பார்வையில் நரகவாசிகளின் செயலைச் செய்து கொண்டே இருப்பார். (உண்மையில்) அவர் சொர்க்கவாசிகளில் ஒருவராய் இருப்பார். இதை சஹ்ல் பின் சஅத் அஸ்ஸாஇதீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6742,
			"arabicnumber": "2652.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஆதம் (அலை) அவர்களும் மூசா (அலை) அவர்களும் தர்க்கம் செய்துகொண்டார்கள். மூசா (அலை) அவர்கள், \"ஆதம் அவர்களே! எங்கள் தந்தையான நீங்கள் (உங்கள் பாவத்தின் காரணத்தால்) எங்களை இழப்புக்குள்ளாக்கிவிட்டீர்கள்;சொர்க்கத்திலிருந்து எங்களை வெளியேற்றிவிட்டீர்கள்\" என்று சொன்னார்கள். அதற்கு மூசாவிடம் ஆதம் (அலை) அவர்கள், \"நீர்தான் மூசாவா? அல்லாஹ், தன்னுடன் உரையாடுவதற்கு உம்மையே தேர்ந்தெடுத்தான்; அவன் தனது கையால் உமக்காக (வேதத்தை) எழுதினான். (இத்தகைய) நீங்கள், அல்லாஹ் என்னைப் படைப்பதற்கு நாற்பது ஆண்டுகளுக்கு முன்பே என்மீது அவன் விதித்துவிட்ட ஒரு விஷயத்திற்காக என்னைப் பழிக்கின்றீர்களா?\" என்று கேட்டார்கள். (இந்த பதில் மூலம்) மூசா (அலை) அவர்களை ஆதம் (அலை) அவர்கள் தோற்கடித்து விட்டார்கள்;தோற்கடித்துவிட்டார்கள்\" என (இரண்டு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் இப்னு அபீஉமர் அல்மக்கீ (ரஹ்), அஹ்மத் பின் அப்தா (ரஹ்) ஆகியோரின் அறிவிப்புகளில் ஒன்றில், \"வரைந்தான்\" (\"கத்த\") என இடம்பெற்றுள்ளது. மற்றொன்றில் \"அவன் தனது கரத்தால் உமக்காக \"தவ்ராத்\"தை எழுதினான்\" என்று ஆதம் (அலை) அவர்கள் கூறியதாகக் காணப்படுகிறது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6743,
			"arabicnumber": "2652.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஆதம் (அலை) அவர்களும் மூசா (அலை) அவர்களும் தர்க்கம் செய்தார்கள். (அதில்) மூசா (அலை) அவர்களை ஆதம் (அலை) அவர்கள் தோற்கடித்துவிட்டார்கள். ஆதம் (அலை) அவர்களிடம் மூசா (அலை) அவர்கள், \"நீங்கள்தான் மனிதர்களை வழி தவறச்செய்து, அவர்களைச் சொர்க்கத்திலிருந்து வெளியேற்றிய ஆதமா?\" என்று கேட்டார்கள். அதற்கு ஆதம் (அலை) அவர்கள், \"அல்லாஹ் அனைத்துப் பொருட்களைப் பற்றிய அறிவையும் வழங்கி, தனது தூதுத்துவத்தால் மற்ற மக்களைவிடத் தேர்ந்தெடுத்த மனிதர் நீர்தானே?\" என்று கேட்டார்கள். அதற்கு மூசா (அலை) அவர்கள், \"ஆம்\" என்று கூறினார்கள். \"அவ்வாறாயின், நான் படைக்கப்படுவதற்கு முன்பே என்மீது விதிக்கப்பட்டுவிட்ட ஒரு விஷயத்திற்காக என்னைப் பழிக்கிறீரா?\" என்று கேட்டார்கள். (இந்தக் கேள்வியின் மூலம் மூசா (அலை) அவர்களை ஆதம் (அலை) அவர்கள் தோற்கடித்துவிட்டார்கள்.) இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6744,
			"arabicnumber": "2652.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஆதம் (அலை) அவர்களும் மூசா (அலை) அவர்களும் தம் இறைவன் அருகில் தர்க்கம் செய்தார்கள். அப்போது மூசா (அலை) அவர்களை ஆதம் (அலை) அவர்கள் தோற்கடித்து விட்டார்கள். மூசா (அலை) அவர்கள், \"அல்லாஹ் தனது கையால் உங்களைப் படைத்து, உங்களுக்குள் தனது உயிரை ஊதி, தன் வானவர்களை உங்களுக்குச் சிரம்பணியச் செய்து, உங்களைச் சொர்க்கத்தில் குடியிருக்கச்செய்த ஆதம் நீங்கள்தானே! பிறகு நீங்கள் உங்களது பாவத்தின் மூலம் (உங்கள் வழித் தோன்றல்களான) மனிதர்களை பூமிக்கு இறங்கச் செய்துவிட்டீர்கள்\" என்று கூறினார்கள். அதற்கு ஆதம் (அலை) அவர்கள், \"அல்லாஹ் தன் தூதுத்துவச் செய்திகளை தெரிவிக்கவும் தன்னிடம் உரையாடவும் உம்மைத் தேர்ந்தெடுத்து, அனைத்துப் பொருட்களைப் பற்றிய விளக்கமும் உள்ள பலகைகளை உமக்கு வழங்கி, தன் அருகில் வரச்செய்து இரகசியமாக உரையாடிய மூசா நீர்தானே! நான் படைக்கப்படுவதற்கு எத்தனை ஆண்டுகளுக்கு முன் அல்லாஹ் தவ்ராத்தை எழுதியதாக நீர் கண்டீர்?\" என்று கேட்டார்கள். அதற்கு மூசா (அலை) அவர்கள், \"நாற்பது ஆண்டுகளுக்கு முன்னால்\" என்று பதிலளித்தார்கள். \"அதில், ஆதம் தம் இறைவனுக்கு மாறுசெய்தார். எனவே, அவர் வழி தவறினார் என்று எழுதப்பட்டிருந்ததா?\" என்று கேட்டார். அதற்கு மூசா (அலை) அவர்கள், \"ஆம்\" என்றார்கள். \"அவ்வாறாயின், என்னைப் படைப்பதற்கு நாற்பது ஆண்டுகளுக்கு முன்பே எதை நான் செய்வேன் என்று இறைவன் என்மீது விதியாக்கிவிட்டானோ அதைச் செய்ததற்காக என்னை நீங்கள் பழிக்கிறீரா?\" என்று ஆதம் (அலை) அவர்கள் கேட்டார்கள். (இந்தக் கேள்வியின் மூலம்) மூசா (அலை) அவர்களை ஆதம் (அலை) அவர்கள் தோற்கடித்துவிட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஆதம் (அலை) அவர்களும் மூசா (அலை) அவர்களும் தர்க்கம் செய்தார்கள். அப்போது ஆதம் (அலை) அவர்களிடம் மூசா (அலை) அவர்கள், \"உங்களைச் சொர்க்கத்திலிருந்து வெளியேற்ற உங்கள் தவறே காரணமாக அமைந்ததே அந்த ஆதம் நீங்கள்தானா?\" என்று கேட்டார்கள். அதற்கு ஆதம் (அலை) அவர்கள், \"நீங்கள், அல்லாஹ் தன் தூதுத்துவச் செய்திகளை தெரிவிக்கவும் தன்னுடன் உரையாடவும் தேர்ந்தெடுத்துக்கொண்ட மூசாதானே? அவ்வாறிருந்தும், நான் படைக்கப்படுவதற்கு முன்பே என்மீது விதிக்கப்பட்டுவிட்ட ஒரு விஷயத்திற்காக என்னைப் பழிக்கிறீர்களே (ஏன்)?\" என்று கேட்டார்கள். (இந்தக் கேள்வியின் மூலம்) மூசா (அலை) அவர்களை ஆதம் (அலை) அவர்கள் வென்றுவிட்டார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6745,
			"arabicnumber": "2652.04",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6746,
			"arabicnumber": "2652.05",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6747,
			"arabicnumber": "2652.06",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6748,
			"arabicnumber": "2653.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், வானங்களையும் பூமியையும் படைப்பதற்கு ஐம்பதாயிரம் ஆண்டுகளுக்கு முன்பே, படைப்பினங்களின் விதிகளை எழுதிவிட்டான். (அப்போது) அவனது அரியணை (அர்ஷ்) தண்ணீரின் மேல் இருந்தது. இதை அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"(அப்போது) அவனது அரியணை (அர்ஷ்) தண்ணீரின் மேல் இருந்தது\" எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6749,
			"arabicnumber": "2653.02",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6750,
			"arabicnumber": "2654",
			"text": "அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஆதமின் மக்களின் (மனிதர்களின்) உள்ளங்கள் அனைத்தும் அளவற்ற அருளாளனின் இரு விரல்களுக்கிடையே ஒரேயோர் உள்ளத்தைப் போன்று உள்ளன. அதைத் தான் நாடிய முறையில் அவன் மாற்றுகிறான்\" என்று கூறிவிட்டு, \"இறைவா! உள்ளங்களைத் திருப்புகின்றவனே! எங்கள் உள்ளங்களை உனக்குக் கீழ்ப்படிவதற்குத் திருப்புவாயாக!\" என்று பிரார்த்தித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6751,
			"arabicnumber": "2655",
			"text": "தாவூஸ் பின் கைசான் (ரஹ்) அவர்கள் கூறியதாவது: \"ஒவ்வொன்றும் விதியின்படியே\" என்று கூறிவந்த தோழர்களில் சிலரை நான் சந்தித்திருக்கிறேன். அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், \"ஒவ்வொரு பொருளும் விதியின்படியே.\"இயலாமை, புத்திசாலித்தனம் ஆகியவை உள்பட” அல்லது \"புத்திசாலித்தனம், இயலாமை ஆகியவை உள்பட\" என்று அல்லாஹ்வின் தூதர் (ஸல்) சொன்னார்கள் என்று கூறியதைக் கேட்டுள்ளேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6752,
			"arabicnumber": "2656",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) குறைஷி இணைவைப்பாளர்கள் விதி தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் விவாதிக்க வந்தனர். அப்போது, \"அவர்கள் நரகத்தில் முகம்குப்புற இழுத்துவரப்படும் நாளில் \"நரகத்தின் வேதனையைச் சுவையுங்கள்\" (என்று கூறப்படும்). ஒவ்வொரு பொருளையும் நாம் திட்டமிட்டபடியே படைத்துள்ளோம்\" (54:48,49) எனும் இறைவசனங்கள் அருளப்பெற்றன. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6753,
			"arabicnumber": "2657.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: விபசாரத்தில் ஆதமின் மக(ன் மனித)னுக்குள்ள பங்கை இறைவன் எழுதியுள்ளான். அதை அவன் அடைந்தே தீருவான். (மனிதனின் கண்ணும் நாவும்கூட விபசாரம் செய்கின்றன.) கண்ணின் விபசாரம் (தவறான) பார்வையாகும். நாவின் விபசாரம் (ஆபாசமான) பேச்சாகும். மனம் ஏங்குகிறது; இச்சை கொள்கிறது. மர்ம உறுப்பு இவை அனைத்தையும் உண்மையாக்குகிறது; அல்லது பொய்யாக்குகிறது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இதன் அறிவிப்பாளரான இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறுகிறார்கள்: நபி (ஸல்) அவர்களிடமிருந்து அபூஹுரைரா (ரலி) அவர்கள் அறிவித்துள்ள இந்த ஹதீஸை விடச் சிறு பாவங்களுக்கு எடுத்துக்காட்டாக வேறெதையும் நான் காணவில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6754,
			"arabicnumber": "2657.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: விபசாரத்தில் மனிதனுக்குள்ள பங்கு (விதியில்) எழுதப்பட்டுள்ளது. அதை அவன் அடையக் கூடியவனாகவே உள்ளான். கண்கள் செய்யும் விபசாரம் (தவறான) பார்வையாகும். காதுகள் செய்யும் விபசாரம் (ஆபாசப் பேச்சுகளைச்) செவியுறுவதாகும். நாவு செய்யும் விபசாரம் (ஆபாசப்) பேச்சாகும். கை செய்யும் விபசாரம் (அந்நியப் பெண்ணைப்) பற்றுவதாகும். கால் செய்யும் விபசாரம் (தவறான உறவைத் தேடி) அடியெடுத்து வைப்பதாகும். மனம் இச்சை கொள்கிறது; ஏங்குகிறது. மர்ம உறுப்பு அதை உண்மையாக்குகிறது; அல்லது பொய்யாக்குகிறது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6755,
			"arabicnumber": "2658.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஒரு விலங்கு முழு வளர்ச்சி பெற்ற விலங்கைப் பெற்றெடுப்பதைப் போன்றே, எல்லாக் குழந்தைகளுமே இயற்கையி(ன் மார்க்கத்தி)ல்தான் பிறக்கின்றன. விலங்குகள் நாக்கு, மூக்கு வெட்டப்பட்ட நிலையில் பிறப்பதை நீங்கள் பார்த்திருக்கிறீர்களா? (முழுமையான விலங்கை அங்க சேதப்படுத்துவதைப் போன்று), பெற்றோர்கள்தான் குழந்தைகளை (ஓரிறை மார்க்கத்திலிருந்து திருப்பி) யூதர்களாகவோ, கிறித்தவர்களாகவோ, அக்னி ஆராதனையாளர்களாகவோ ஆக்கிவிடுகின்றனர். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவித்துவிட்டுப் பிறகு, நீங்கள் விரும்பினால், \"இது அல்லாஹ்வின் இயற்கையான மார்க்கம். இதன் மீதே மனிதர்களை அல்லாஹ் படைத்துள்ளான். அல்லாஹ்வின் படைப்பில் எந்த மாற்றலும் இல்லை\" (30:30) எனும் வசனத்தை ஓதிக்கொள்ளுங்கள் என்றார்கள். - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"ஒரு விலங்கு விலங்கைப் பெற்றெடுத்ததைப் போன்றே\" எனும் (வாசகம்) இடம் பெற்றுள்ளது. \"முழு வளர்ச்சி பெற்ற\" எனும் குறிப்பு இடம்பெறவில்லை. - அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"எல்லாக் குழந்தைகளும் இயற்கை(யின் மார்க்கத்தி)ல்தான் பிறக்கின்றன\" என்று கூறினார்கள். நீங்கள் \"இது அல்லாஹ்வின் இயற்கையான மார்க்கம். இதன்மீதே மனிதர்களை அல்லாஹ் படைத்துள்ளான். அல்லாஹ்வின் படைப்பில் எந்த மாற்றலும் இல்லை. இதுவே நேரான மார்க்கம்\" (30:30) எனும் வசனத்தை ஓதிக்கொள்ளுங்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6756,
			"arabicnumber": "2658.02",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6757,
			"arabicnumber": "2658.03",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6758,
			"arabicnumber": "2658.04",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6759,
			"arabicnumber": "2658.05",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6760,
			"arabicnumber": "2658.06",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6761,
			"arabicnumber": "2658.07",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தாயின் வயிற்றிலிருந்து பிறக்கும் ஒவ்வொரு மனிதனும் இயற்கையி(ன் மார்க்கத்தி)ல்தான் பிறக்கிறான். அவனுடைய பெற்றோர்கள்தான் பின்னர் அவனை யூதனாகவோ கிறித்தவனாகவோ அக்னி ஆராதனையாளனாகவோ ஆக்கிவிடுகின்றனர். அவர்கள் இருவரும் முஸ்லிம்களாயிருந்தால், அவனும் முஸ்லிமாகிவிடுகிறான். தாயின் வயிற்றிலிருந்து பிறக்கும் ஒவ்வொரு குழந்தையின் விலாப்புறத்திலும் ஷைத்தான் குத்துகிறான்; மர்யமையும் அவருடைய புதல்வர் (ஈசா) அவர்களையும் தவிர! இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6762,
			"arabicnumber": "2659.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் இணைவைப்பாளர்களின் குழந்தைகள் சிறிய வயதிலேயே இறந்துவிட்டால், அவர்களின் நிலை என்ன என்பது பற்றிக் கேட்கப்பட்டது. அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(உயிருடன் வாழ்ந்தால்) அவர்கள் எவ்வாறு செயல்பட்டிருப்பார்கள் என்பதை அல்லாஹ் நன்கறிவான்\"என்று விடையளித்தார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6763,
			"arabicnumber": "2659.02",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், இணைவைப்போரின் குழந்தைகள் குறித்து (\"அவர்கள் இறந்துவிட்டால் அவர்களின் முடிவு யாது\" என்று) கேட்கப்பட்டது. அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(உயிருடன் வாழ்ந்தால்) அவர்கள் எவ்வாறு செயல்பட்டிருப்பார்கள் என்பதை அல்லாஹ் நன்கறிவான்\" என்று விடையளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ஷுஐப் (ரஹ்), மஅகில் (ரஹ்) ஆகியோரது அறிவிப்பில், \"இணைவைப்பாளர்களின் சந்ததிகள் பற்றிக் கேட்கப்பட்டது\" என்று காணப்படுகிறது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6764,
			"arabicnumber": "2659.03",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6765,
			"arabicnumber": "2660",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: இணைவைப்போரின் குழந்தைகள் (இறந்து விட்டால் அவர்களின் முடிவு யாது என்பது) பற்றி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வினவப்பட்டது. அதற்கு அவர்கள், \"அவர்களை அல்லாஹ் படைத்தபோதே, அவர்கள் (உயிருடன் வாழ்ந்தால்) எவ்வாறு செயல்பட்டிருப்பார்கள் என்பதை நன்கறிவான்\" என்று சொன்னார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6766,
			"arabicnumber": "2661",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: \"களிர்\" அவர்கள் கொன்றுவிட்ட சிறுவன் (இறை)மறுப்பாளனாகவே படைக்கப்பட்டான். அவன் (உயிருடன்) வாழ்ந்திருந்தால் தன் பெற்றோரை வழிகேட்டிலும் (இறை)மறுப்பிலும் தள்ளிவிட்டிருப்பான். இதை உபை பின் கஅப் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6767,
			"arabicnumber": "2662.01",
			"text": "இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில்) ஒரு குழந்தை இறந்துபோனது. அப்போது நான், \"அதற்கு நல்வாழ்த்துகள்! அது சொர்க்கத்தின் சிட்டுக்குருவிகளில் ஒரு சிட்டுக்குருவி\" என்று சொன்னேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உனக்குத் தெரியாதா? அல்லாஹ் சொர்க்கத்தையும் நரகத்தையும் படைத்தபோதே, அதற்கெனச் சிலரையும் இதற்கெனச் சிலரையும் படைத்துவிட்டான்\" என்று சொன்னார்கள். அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6768,
			"arabicnumber": "2662.02",
			"text": "இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அன்சாரிகளில் ஒரு குழந்தை இறந்தபோது, அதன் பிரேத நல்லடக்கத்திற்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழைக்கப்பட்டார்கள். அப்போது நான், \"அல்லாஹ்வின் தூதரே! அக்குழந்தைக்கு நல்வாழ்த்துகள்! அது சொர்க்கத்தின் சிட்டுக் குருவிகளில் ஒரு சிட்டுக்குருவி. அது எந்தத் தீமையையும் செய்யவில்லை. அதற்கான பருவத்தையும் அது அடையவில்லை\" என்று சொன்னேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"வேறு ஏதேனும் உண்டா, ஆயிஷா? அல்லாஹ் சொர்க்கத்திற்கென்றே சிலரைப் படைத்துள்ளான். அவர்கள் தம் பெற்றோரின் முதுகுத்தண்டுகளில் இருந்தபோதே அதற்காகவே அவர்களை அவன் படைத்துவிட்டான்; நரகத்திற்கென்றே சிலரைப் படைத்தான். அவர்கள் தம் பெற்றோரின் முதுகுத்தண்டுகளில் இருந்தபோதே அதற்காகவே அவர்களைப் படைத்துவிட்டான்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் ஆயிஷா (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6769,
			"arabicnumber": "2662.03",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6770,
			"arabicnumber": "2663.01",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6771,
			"arabicnumber": "2663.02",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6772,
			"arabicnumber": "2663.03",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6773,
			"arabicnumber": "2663.04",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6774,
			"arabicnumber": "2664",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: பலமான இறைநம்பிக்கையாளர், பலவீனமான இறைநம்பிக்கையாளரைவிடச் சிறந்தவரும் அல்லாஹ்வுக்கு மிகவும் விருப்பமானவரும் ஆவார். ஆயினும், அனைவரிடமும் நன்மை உள்ளது. உனக்குப் பயனளிப்பதையே நீ ஆசைப்படு. இறைவனிடம் உதவி தேடு. நீ தளர்ந்துவிடாதே. உனக்கு ஏதேனும் துன்பம் ஏற்படும்போது, \"நான் (இப்படிச்) செய்திருந்தால் அப்படி அப்படி ஆயிருக்குமே!\" என்று (அங்கலாய்த்துக்) கூறாதே. மாறாக, \"அல்லாஹ்வின் விதிப்படி நடந்துவிட்டது. அவன் நாடியதைச் செய்துவிட்டான்\" என்று சொல். ஏனெனில், (\"இப்படிச் செய்திருந்தால் நன்றாயிருந்திருக்குமே\" என்பதைச் சுட்டும்) \"லவ்\" எனும் (வியங்கோள் இடைச்)சொல்லானது ஷைத்தானின் செயலுக்கே வழி வகுக்கும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 46",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 52
			}
		}
	]
}