{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"50": "The Book of Repentance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6952,
			"arabicnumber": "2675.08",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: வல்லமையும் மாண்பும் மிக்க அல்லாஹ், \"என்னைக் குறித்து என் அடியான் எப்படி நினைக்கிறானோ அப்படியே நான் அவனிடம் நடந்துகொள்கிறேன். அவன் என்னை நினைவு கூரும்போது அவனுடன் நான் இருப்பேன்\" என்று கூறினான். அல்லாஹ்வின் மீதாணையாக! பாலைவனத்தில் தொலைத்துவிட்ட தமது ஒட்டகத்தைக் கண்டுபிடிக்கும்போது,உங்களில் ஒருவருக்கு ஏற்படும் மகிழ்ச்சியைவிட, தன் அடியான் பாவமன்னிப்புக் கோரி மீட்சி பெறுவதால் அல்லாஹ் அதிகமாக மகிழ்ச்சி அடைகிறான். யார் என்னிடம் ஒரு சாண் அளவு நெருங்குகிறாரோ, நான் அவரிடம் ஒரு முழம் அளவு நெருங்குகிறேன். யார் என்னிடம் ஒரு முழம் நெருங்குகிறாரோ, நான் அவரிடம் (வலம் இடமாக விரிந்த) இரு கை நீட்டளவு நெருங்குகிறேன். அவர் என்னை நோக்கி நடந்து வந்தால், நான் அவரை நோக்கி ஓடிச்செல்கிறேன் (என்று அல்லாஹ் கூறினான்). இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6953,
			"arabicnumber": "2675.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6954,
			"arabicnumber": "2675.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6955,
			"arabicnumber": "2744.01",
			"text": "ஹாரிஸ் பின் சுவைத் (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் நோய்வாய்ப்பட்டிருந்தபோது, அவர்களை உடல் நலம் விசாரிப்பதற்காக நான் சென்றேன். அப்போது அவர்கள் எங்களுக்கு இரு ஹதீஸ்களை அறிவித்தார்கள். அவற்றில் ஒன்றைத் தாமாகக் கூறினார்கள். மற்றொன்றை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாகக் குறிப்பிட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாக அவர்கள் சொன்னதாவது: ஒரு மனிதன் (பயணத்தினிடையே ஓய்வெடுப்பதற்காக) ஆபத்துகள் நிறைந்த (வறண்ட) பாலைவனத்தில் (இறங்கி) உறங்கினான். அவனுடன் அவனது வாகன(மான ஒட்டக)மும் இருந்தது. அதில் அவனுடைய உணவும் நீரும் இருந்தன. அவன் (உறங்கிவிட்டு) விழித்தெழுந்தபோது, அவனது ஒட்டகம் (தப்பியோடிப்) போயிருந்தது. அவன் அதைத் தேடிச் சென்றபோது, அவனுக்குக் கடுமையான தாகம் ஏற்பட்டது. அவன், \"நான் முன்பிருந்த இடத்திற்கே திரும்பிச் சென்று சாகும்வரை உறங்கப்போகிறேன்\" என்று கூறியபடி (அங்கு திரும்பிச் சென்று) தனது கொடுங்கையில் தலை வைத்துச் சாகும்வரை உறங்கப் போனான். பிறகு (திடீரென) அவன் விழித்துப் பார்த்த போது, அவனுக்கருகில் அவனது ஒட்டகம் இருந்தது. அதில் அவனது பயண உணவும் நீரும் இருந்தன. அப்போது அவன் தனது ஒட்டகத்தாலும் உணவாலும் அடைகின்ற மகிழ்ச்சியைவிட,இறைநம்பிக்கையுள்ள அடியார் பாவமன்னிப்புக் கோரி மீட்சி பெறுவதால் அல்லாஹ் அதிகம் மகிழ்கின்றான். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் (\"வறண்ட பாலைவனம்\" என்பதைக் குறிக்க \"தவிய்யத்\" என்பதற்குப் பகரமாக) \"தாவியத்\" எனும் சொல் இடம்பெற்றுள்ளது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6956,
			"arabicnumber": "2744.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6957,
			"arabicnumber": "2744.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6958,
			"arabicnumber": "2745",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6959,
			"arabicnumber": "2746",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6960,
			"arabicnumber": "2747.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் வறண்ட பாலைவனத்தில் ஒட்டகத்தில் பயணம் மேற்கொண்டார். (அவர் ஓரிடத்தில் இறங்கி ஓய்வெடுத்துக் கொண்டிருந்தபோது) அவரது ஒட்டகம் தப்பியோடி விட்டது. அதன் மீதே அவரது உணவும் பானமும் இருந்தன. அவர் (தமது ஒட்டகத்தைத் தேடியலைந்து அதைக் கண்டுபிடிக்க முடியாமல்) நம்பிக்கையிழந்து, ஒரு மரத்திற்கு அருகில் வந்து, அதன் நிழலில் படுத்திருந்தார். தமது ஒட்டகத்தைக் கண்டுபிடிக்க முடியாமல் அதே நிலையில் அவர் நிராசையுடன் இருந்தபோது, அந்த ஒட்டகம் (வந்து) தமக்கு அருகில் நிற்பதை அவர் கண்டார். உடனே அதன் கடிவாளத்தைப் பிடித்துக்கொண்டார். பிறகு மகிழ்ச்சிப் பெருக்கால் அவர், (\"இறைவா! நீ என் இறைவன்; நான் உன் அடிமை\" என்று சொல்வதற்குப் பதிலாக) \"இறைவா! நீ என் அடிமை; நான் உன் இறைவன்\" என்று தவறுதலாகச் சொல்லிவிட்டார். இந்த மனிதரைவிடத் தன் அடியான் பாவமன்னிப்புக் கோரி தன்னிடம் மீளுவதால் அல்லாஹ் அதிகம் மகிழ்ச்சி அடைகிறான். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6963,
			"arabicnumber": "2748.01",
			"text": "அபூஸிர்மா மாலிக் பின் கைஸ் (ரலி) அவர்கள் கூறியதாவது: அபூஅய்யூப் அல்அன்சாரீ (ரலி) அவர்களுக்கு இறப்பு நெருங்கியபோது, \"நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்ற ஒரு செய்தியை உங்களிடம் கூறாமல் மறைத்துவைத்திருந்தேன். (அதை இப்போது உங்களிடம் கூறுகிறேன்:) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீங்கள் பாவம் செய்யாதவர்களாக இருந்து விட்டால், நிச்சயமாகப் பாவம் செய்கின்ற ஒரு படைப்பை அல்லாஹ் உருவாக்கி அவர்களுடைய பாவங்களை அவன் மன்னிக்கவே செய்வான் என்று கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6964,
			"arabicnumber": "2748.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6965,
			"arabicnumber": "2749",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6966,
			"arabicnumber": "2750.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6967,
			"arabicnumber": "2750.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6968,
			"arabicnumber": "2750.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6969,
			"arabicnumber": "2751.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6970,
			"arabicnumber": "2751.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6971,
			"arabicnumber": "2751.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் (படைப்புகளைப்) படைக்கும் பணியை நிறைவு செய்தபோது, தனக்கு அருகில் வைக்கப்பட்டுள்ள தனது பதிவேட்டில் \"என் கருணை என் கோபத்தை வெல்லும்\" என்று (கருணையைத்) தனக்குத் தானே விதியாக்கிக்கொள்ளும் வகையில் எழுதினான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6972,
			"arabicnumber": "2752.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், அன்பை நூறு பாகங்களாகப் படைத்தான். அவற்றில் ஒன்றை தன் படைப்பினங்களிடையே வைத்தான். தொண்ணூற்று ஒன்பது பாகங்களைத் தன்னிடமே பத்திரப்படுத்திக்கொண்டான்.- இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6973,
			"arabicnumber": "2752.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6974,
			"arabicnumber": "2752.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6975,
			"arabicnumber": "2753.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அன்பின் நூறு பாகங்களும் அல்லாஹ்வுக்கே உரியவையாகும். அவற்றில் ஒரு பங்கினால் தான் படைப்பினங்கள் தமக்கிடையே பரிவு காட்டுகின்றன. தொண்ணூற்று ஒன்பது பாகம் அன்பு, மறுமை நாளுக்கு உரியவையாகும். இதை சல்மான் அல்ஃபாரிசீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் சல்மான் அல்ஃபாரிசீ (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6976,
			"arabicnumber": "2753.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6977,
			"arabicnumber": "2753.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் வானங்கள், பூமி ஆகியவற்றைப் படைத்த நாளில் அன்பை நூறு பாகங்களாகப் படைத்தான். அவற்றில் ஒவ்வொரு பாகமும் வானம் பூமிக்கிடையே உள்ள (இடத்)தை அடைத்துக் கொள்ளும் அளவுடையதாகும். அவற்றில் ஒரு பாகத்தையே பூமியில் வைத்தான். அந்த ஒரு பாகத்தினால்தான் தாய் தன் குழந்தைமீது பாசம் கொள்கிறாள். மிருகங்களும் பறவைகளும் ஒன்றன் மீதொன்று அன்பு காட்டுகின்றன. மறுமை நாள் வரும்போது இந்த ஓர் அன்புடன் சேர்த்து அன்பை இறைவன் (நூறாக) முழுமையாக்குவான். இதை சல்மான் அல்ஃபாரிசீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6978,
			"arabicnumber": "2754",
			"text": "உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் கூறியதாவது: (ஹவாஸின் குலத்தைச் சேர்ந்த) கைதிகள் சிலர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுவரப்பட்டார்கள். அந்தக் கைதிகளில் ஒரு பெண் (தனது மார்பில் சுரந்த பாலை ஊட்டுவதற்காகத் தனது குழந்தையைத்) தேடினாள். (குழந்தை கிடைக்கவில்லை. எனவே,) கைதிகளிடையே எந்தக் குழந்தையைக் கண்டாலும் அதை (வாரி) எடுத்து, தனது வயிற்றோடு அணைத்துப் பாலூட்டலானாள். (தனது குழந்தை கிடைத்ததும் அதையும் நெஞ்சணைத்துப் பாலூட்டினாள்.) அப்போது எங்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இந்தப் பெண் தனது குழந்தையைத் தீயில் எறிவாளா,சொல்லுங்கள்?\" என்றார்கள். நாங்கள், \"இல்லை; அல்லாஹ்வின் மீதாணையாக! எந்நிலையிலும் அவளால் எறிய முடியாது\" என்று சொன்னோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இந்தக் குழந்தையின் மீது இவளுக்குள்ள அன்பைவிட அல்லாஹ் தன் அடியார்கள்மீது மிகவும் அன்பு வைத்துள்ளான்\" என்று சொன்னார்கள்.- இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6979,
			"arabicnumber": "2755",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இறைநம்பிக்கையாளர் அல்லாஹ்விடமுள்ள தண்டனையைப் பற்றி நன்கறிவாரானால், (அதிலிருந்து தப்பித்தால் போதும் என்று கருதுவாரே தவிர,) அவனது சொர்க்கத்தின் மீது (இறைநம்பிக்கையாளர்களில்) யாரும் ஆசை கொள்ளமாட்டார்கள். இறைமறுப்பாளர் அல்லாஹ்விடமுள்ள கருணையைப் பற்றி நன்கறிவாரானால், அவனது சொர்க்கத்தைப் பற்றி (இறைமறுப்பாளர்களில்) யாருமே நிராசை கொள்ளமாட்டார்கள். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6980,
			"arabicnumber": "2756.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (முற்காலத்தில்) நன்மை எதையும் அறவே செய்யாத ஒரு மனிதர் தம் குடும்பத்தாரிடம், \"நான் இறந்துவிட்டால் என்னை எரித்து, (சாம்பலாக்கி) அந்தச் சாம்பலில் பாதியைத் தரையிலும் பாதியைக் கடலிலும் தூவி விடுங்கள். அல்லாஹ்வின் மீதாணையாக! என் மீது இறைவனுக்குச் சக்தி ஏற்பட்டால், உலக மக்களில் யாருக்கும் அளிக்காத வேதனையை அவன் எனக்கு அளித்துவிடுவான்\" என்று சொல்லி(விட்டு இறந்து)விட்டார். அவ்வாறே அந்த மனிதர் இறந்ததும் அவர் சொன்னதைப் போன்றே குடும்பத்தார் செய்தனர். பிறகு அல்லாஹ் தரைக்கு ஆணையிட்டு அதிலிருந்த அவரது உடலை ஒன்று திரட்டினான்; கடலுக்கு ஆணையிட்டு அதிலிருந்த அவரது உடலை ஒன்றுதிரட்டினான். பிறகு, \"நீ எதற்காக இப்படிச் செய்தாய்?\" என்று கேட்டான். அதற்கு அவர், \"என் இறைவா! உன்மீதுள்ள அச்சத்தால்தான் (இப்படிச் செய்தேன்). நீ நன்கறிந்தவன்\" என்று சொல்ல, அவரை அல்லாஹ் மன்னித்துவிட்டான்.- இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6982,
			"arabicnumber": "2619.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6983,
			"arabicnumber": "2756.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6984,
			"arabicnumber": "2757.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களுக்குமுன் வாழ்ந்த ஒரு மனிதருக்கு அல்லாஹ் செல்வத்தையும் பிள்ளைகளையும் வழங்கியிருந்தான். (அவருக்கு இறப்பு நெருங்கியபோது) அவர் தம் பிள்ளைகளிடம், \"நான் சொல்வதைப் போன்று நீங்கள் செய்ய வேண்டும். இல்லாவிட்டால், என் சொத்துக்களைப் பிறருக்கு வழங்கிவிடுவேன். நான் இறந்துவிட்டால் என்னை எரித்து, தூளாக்கி விடுங்கள். பிறகு அந்தச் சாம்பலைக் காற்றில் தூற்றுங்கள். ஏனெனில், நான் (எனது மறுமைக்காக) அல்லாஹ்விடம் எந்த நன்மையையும் சேமிக்கவில்லை. அல்லாஹ் என்னைத் தண்டிப்பதற்குச் சக்தி பெற்றே உள்ளான்\" என்று கூறி உறுதிமொழி வாங்கிக்கொண்டார். என் இறைவன் மீதாணையாக! (அவர் இறந்தவுடன்) அவ்வாறே அவர்கள் செய்தார்கள். பிறகு அல்லாஹ் (பழையபடி முழு மனிதராக அவரை எழுப்பி), \"இவ்வாறு நீ செய்யக் காரணம் என்ன?\" என்று கேட்டான். அம்மனிதர் \"உன்மீதான அச்சத்தின் காரணத்தால்தான்\" என்று கூறினார். அவரை (அந்த நேரத்தில் இறையச்சம் தான் காப்பாற்றியது) அதைத் தவிர வேறெதுவும் காப்பாற்றவில்லை. இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6985,
			"arabicnumber": "2757.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6986,
			"arabicnumber": "2758.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6987,
			"arabicnumber": "2758.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6988,
			"arabicnumber": "2758.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6991,
			"arabicnumber": "2760.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6992,
			"arabicnumber": "2760.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6993,
			"arabicnumber": "2760.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6994,
			"arabicnumber": "2760.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6995,
			"arabicnumber": "2761.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6996,
			"arabicnumber": "2762.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6997,
			"arabicnumber": "2761.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6998,
			"arabicnumber": "2762.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6999,
			"arabicnumber": "2761.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7000,
			"arabicnumber": "2761.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7001,
			"arabicnumber": "2763.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7002,
			"arabicnumber": "2763.04",
			"text": "மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் வந்து, தாம் (அந்நியப்) பெண் ஒருத்தியை முத்தமிட்டுவிட்டதாக,அல்லது தொட்டுவிட்டதாக, அல்லது வேறேதோ செய்துவிட்டதாகச் சொன்னார். அவர் அதற்குப் பரிகாரம் கேட்பதைப் போன்றிருந்தது. அப்போது அல்லாஹ் அந்த வசனத்தை (11:114) அருளினான்\" என்றும் அதற்கு பின்னுள்ளவையும் இடம்பெற்றுள்ளன. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7003,
			"arabicnumber": "2763.05",
			"text": "மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"ஒரு மனிதர் (அந்நியப்) பெண் ஒருத்தியிடம் உடலுறவு நீங்கலாக (மற்றச் செயல்) ஒன்றைச் செய்துவிட்டார். பிறகு உமர் பின் அல்கத்தாப் (ரலி) அவர்களிடம் வந்(து அதைப் பற்றித் தெரிவித்)தார். அதைப் பெருங்குற்றமாக உமர் (ரலி) அவர்கள் கருதினார்கள். பிறகு அந்த மனிதர் அபூபக்ர் (ரலி) அவர்களிடம் வந்(து தெரிவித்)தபோது, அவர்களும் அதைப் பெருங்குற்றமாகக் கருதினார்கள். பிறகு அந்த மனிதர் நபி (ஸல்) அவர்களிடம் வந்தார்\" என்றும் மேற்கண்ட ஹதீஸில் உள்ள தகவல்களும் இடம்பெற்றுள்ளன. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7004,
			"arabicnumber": "2763.02",
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! நான் மதீனாவின் புறநகர்ப் பகுதியில் ஒரு பெண்ணிடம் தவறாக நடந்துகொண்டேன். அவளுடன் உடலுறவு கொள்வதைத் தவிர வேறு செயல்களைச் செய்துவிட்டேன். இதோ நான் (இங்கு தயாராக நிற்கிறேன்). என் விஷயத்தில் நீங்கள் நாடியதை நிறைவேற்றுங்கள்\" என்று கூறினார். அவரிடம் உமர் (ரலி) அவர்கள், \"அல்லாஹ்வே உனது குற்றத்தை மறைத்துவிட்டிருக்க, நீ உன் குற்றத்தை மறைத்திருக்கக் கூடாதா?\" என்று கேட்டார்கள். ஆனால், அந்த மனிதருக்கு நபி (ஸல்) அவர்கள் பதிலேதும் கூறவில்லை. பிறகு அந்த மனிதர் எழுந்து சென்றுவிட்டார். பின்னர் நபி (ஸல்) அவர்கள் அவரை அழைத்துவர அவருக்குப் பின்னால் ஆளனுப்பினார்கள். அவரிடம், \"பகலின் இரு ஓரங்களிலும் இரவின் சில பகுதிகளிலும் தொழுகையை நிலைநாட்டுவீராக! நன்மைகள் தீமைகளை அழித்துவிடும். இது படிப்பினை பெறுவோருக்கு ஒரு பாடமாகும்\" (11:114)எனும் இந்த இறைவசனத்தை ஓதிக்காட்டினார்கள். அப்போது அங்கிருந்த மக்களில் ஒருவர், \"அல்லாஹ்வின் தூதரே! இது இவருக்கு மட்டும் உரியதா? (அல்லது அனைவருக்குமா?)\" என்று கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், \"இல்லை; மக்கள் அனைவருக்கும் உரியதுதான்\" என்று பதிலளித்தார்கள். இந்த ஹதீஸ் ஆறு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7005,
			"arabicnumber": "2763.03",
			"text": "மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"முஆத் (ரலி) அவர்கள், அல்லாஹ்வின் தூதரே! இ(ந்தப் பரிகாரமான)து இவருக்கு மட்டும் உரியதா? அல்லது எங்கள் அனைவருக்கும் உரியதா?\" என்று கேட்க, நபி (ஸல்) அவர்கள், \"இல்லை; உங்கள் அனைவருக்கும் உரியதுதான்\" என்று பதிலளித்ததாகக் காணப்படுகிறது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7006,
			"arabicnumber": "2764",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! நான் தண்டனைக்குரிய குற்றமொன்றைச் செய்துவிட்டேன். ஆகவே, என்மீது தண்டனையை நிறைவேற்றுங்கள்\" என்றார். அப்போது தொழுகை நேரம் வந்துவிடவே, அவர் நபி (ஸல்) அவர்களுடன் தொழுதார். தொழுகையை முடித்தபோது, \"அல்லாஹ்வின் தூதரே! நான் தண்டனைக்குரிய குற்றமொன்றைச் செய்துவிட்டேன். ஆகவே, அல்லாஹ்வின் வேதத்தி(லுள்ளபடி தண்ட னையி)னை என்மீது நிறைவேற்றுங்கள்\" என்று கூறினார். நபி (ஸல்) அவர்கள், \"எம்முடன் சேர்ந்து நீர் தொழுதீர் அல்லவா?\" என்று கேட்டார்கள். அவர் \"ஆம் (தொழுதேன்)\"என்றார். நபி (ஸல்) அவர்கள், \"உமது பாவம் மன்னிக்கப்பட்டுவிட்டது\" என்று சொன்னார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7007,
			"arabicnumber": "2765",
			"text": "அபூஉமாமா அல்பாஹிலீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலில் அமர்ந்திருந்தார்கள். அவர்களுடன் நாங்களும் அமர்ந்திருந்தோம். அப்போது ஒரு மனிதர் வந்து, \"அல்லாஹ்வின் தூதரே! நான் தண்டனைக்குரிய குற்றமொன்றைச் செய்துவிட்டேன். ஆகவே, எனக்குத் தண்டனையை நிறைவேற்றுங்கள்\" என்று கூறினார். அவருக்குப் பதிலளிக்காமல் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அமைதியாக இருந்தார்கள். பிறகு (மீண்டும்) அவர், \"அல்லாஹ்வின் தூதரே! நான் தண்டனைக்குரிய குற்றமொன்றைச் செய்து விட்டேன். ஆகவே,எனக்குத் தண்டனையை நிறைவேற்றுங்கள்\" என்று கூறினார். அப்போதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவருக்குப் பதிலளிக்காமல் அமைதியாக இருந்தார்கள். பிறகு தொழுகைக்காக \"இகாமத்\" சொல்லப்பட்டது. தொழுகை முடிந்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் திரும்பிச் சென்றபோது, அந்த மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பின்தொடர்ந்து சென்றார். அவருக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்ன பதிலளிக்கிறார்கள் என்பதைக் காண்பதற்காக அவர்களை நான் பின்தொடர்ந்தேன். அந்த மனிதர், \"அல்லாஹ்வின் தூதரே! நான் தண்டனைக்குரிய குற்றமொன்றைச் செய்துவிட்டேன். ஆகவே, எனக்குரிய தண்டனையை நிறைவேற்றுங்கள்\" என்று கூறினார். அப்போது அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீர் உமது வீட்டிலிருந்து புறப்படும்போது அழகிய முறையில் அங்கத்தூய்மை (உளூ) செய்யவில்லையா?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர் \"ஆம் (செய்தேன்);அல்லாஹ்வின் தூதரே!\" என்றார். \"பிறகு நம்முடன் சேர்ந்து நீர் தொழவில்லையா?\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கேட்டார்கள். அந்த மனிதர் \"ஆம் (தொழுதேன்); அல்லாஹ்வின் தூதரே!\" என்றார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ் \"உமக்குரிய தண்டனையை\" அல்லது \"உமது பாவத்தை\" மன்னித்துவிட்டான்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7008,
			"arabicnumber": "2766.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களுக்குமுன் வாழ்ந்தவர்களில் ஒரு மனிதர் இருந்தார். அவர் தொண்ணூற்று ஒன்பது மனிதர்களைக் கொன்றுவிட்டிருந்தார். பிறகு அவர் அக்கால மக்களில் நன்கறிந்த அறிஞர் யார் என விசாரித்தார். அவருக்கு ஒரு பாதிரியார் காட்டப்பட்டார். அவர் அந்தப் பாதிரியாரிடம் சென்று, \"நான் தொண்ணூற்று ஒன்பது மனிதர்களைக் கொன்றுவிட்டேன். எனக்குப் பாவமன்னிப்புக் கிடைக்குமா?\" என்று கேட்டார். அந்தப் பாதிரியார், \"கிடைக்காது\" என்று கூறவே, அவரையும் அந்த மனிதர் கொன்று, எண்ணிக்கையை நூறாக முழுமையாக்கிவிட்டார். பிறகு மீண்டும் அக்கால மக்களில் நன்கறிந்த அறிஞரைப் பற்றி அவர் விசாரித்தார். அப்போது அறிஞர் ஒருவர் அவருக்குக் காட்டப்பட்டார். (அவரிடம் சென்று) அந்த மனிதர், \"நான் நூறு கொலைகள் செய்துவிட்டேன். எனக்குப் பாவமன்னிப்புக் கிடைக்குமா?\" என்று கேட்டார். அதற்கு அந்த அறிஞர், \"ஆம் (கிடைக்கும்). இறைவனுக்கும் பாவமன்னிப்புக் கோரிக்கைக்கும் இடையே யார் குறுக்கே வந்து நிற்க முடியும்? நீ (நல்லோர் வாழும்) இன்ன ஊருக்குப் போ. அங்கு மக்கள் சிலர் இருப்பார்கள். அவர்கள் இறைவனை வழிபட்டுக் கொண்டிருப்பார்கள். அவர்களுடன் சேர்ந்து நீயும் இறைவனை வழிபடு. நீ உனது ஊருக்குத் திரும்பிச் செல்லாதே! ஏனெனில், அது தீய ஊராகும்\"என்று சொன்னார். அவ்வாறே, அந்த மனிதர் (நல்லோர் வாழும்) அந்த ஊரை நோக்கிச் சென்றுகொண்டிருந்த போது, பாதி வழியில் இறந்துவிட்டார். அப்போது இறையருளைக் கொண்டுவரும் வானவர்களும் இறை தண்டனைகளை நிறைவேற்றும் வானவர்களும் அவர் விஷயத்தில் (அவரை யார் அழைத்துச் செல்வது) என்று சர்ச்சை செய்துகொண்டனர். அப்போது அருளின் வானவர்கள், \"இவர் பாவமன்னிப்புக் கோரி பாவத்திலிருந்து மீண்டு தமது உள்ளத்தால் இறைவனை நோக்கி வந்துகொண்டிருந்தார்\" என்று கூறினர். தண்டனையின் வானவர்கள், \"இவர் சிறிதும் நன்மைகளைச் செய்யாதவர்\" என்று கூறினர். அப்போது மற்றொரு வானவர் மனிதத் தோற்றத்தில் அங்கு வந்தார். அவரை அவ்விரு வானவர்களும் நடுவராக வைத்துக்கொண்டனர். அப்போது அந்த வானவர், \"இவ்விரு ஊர்களுக்குமிடையிலுள்ள தூரத்தைக் கணக்கெடுங்கள். அவற்றில் எந்த ஊருக்கு மிக அருகில் அவரது உடல் இருக்கிறதோ அந்த ஊருக்குரியவராகவே அவர் இருப்பார்\"என்று சொன்னார். அவ்வாறே கணக்கெடுத்தபோது, (அவர் வசித்துவந்த ஊரைவிட) அவர் நாடிவந்த ஊரே அவருக்கு மிகவும் சமீபமாக இருப்பதைக் கண்டனர். ஆகவே, அவரை அருளின் வானவர்கள் கைப்பற்றிக்கொண்டனர். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. இதன் அறிவிப்பாளர்களில் ஒருவரான கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: \"அவர் (இறக்கும் தறுவாயில்) தமது நெஞ்சை (அந்த நல்ல ஊர் இருக்கும் திசை நோக்கி சாய்த்துக்கொண்(டே இறந்துவிட்)டார்\" என்று எங்களிடம் கூறப்பட்டது என ஹசன் அல்பஸ்ரீ (ரஹ்) அவர்கள் கூறினார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7009,
			"arabicnumber": "2766.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7010,
			"arabicnumber": "2766.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7011,
			"arabicnumber": "2767.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: வல்லமையும் மாண்பும் மிக்க அல்லாஹ் மறுமை நாளில் ஒவ்வொரு முஸ்லிமிடமும் ஒரு யூதரையோ அல்லது கிறித்தவரையோ ஒப்படைத்து, \"இவன்தான் உன்னை நரகத்திலிருந்து விடுவித்தான்\" என்று சொல்வான். இதை அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7012,
			"arabicnumber": "2767.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7013,
			"arabicnumber": "2767.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7014,
			"arabicnumber": "2767.04",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் முஸ்லிம்களில் சிலர் மலைகளைப் போன்ற பாவங்களுடன் வருவார்கள். ஆனால், அவற்றை அவர்களுக்கு அல்லாஹ் மன்னித்துவிட்டு, யூதர்கள்மீதும் கிறித்தவர்கள் மீதும் அவற்றை வைத்துவிடுவான்.இவ்வாறே நான் கருதுகிறேன். இதை அபூமூசா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான அபூரவ்ஹ் ஹரமீ பின் உமாரா (ரஹ்) அவர்கள், \"இவ்வாறே நான் கருதுகிறேன் எனும் ஐயப்பாட்டைத் தெரிவித்த அறிவிப்பாளர் யார் என்பது எனக்குத் தெரியவில்லை\" என்று கூறுகிறார்கள். அபூமூசா (ரலி) அவர்களிடமிருந்து இதைச் செவியுற்ற (அவர்களுடைய புதல்வரான) அபூபுர்தா (ரஹ்) அவர்கள் கூறுகிறார்கள்: இந்த ஹதீஸை நான் (கலீஃபா) உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்களிடம் அறிவித்தபோது அவர்கள், \"இதை நபி (ஸல்) அவர்களிடமிருந்தா உம்முடைய தந்தை அறிவித்துள்ளார்கள்?\" என்று கேட்டார்கள். அதற்கு நான் \"ஆம்\" என்றேன். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7015,
			"arabicnumber": "2768",
			"text": "ஸஃப்வான் பின் முஹ்ரிஸ் (ரஹ்) அவர்கள் கூறியதாவது: ஒரு மனிதர் இப்னு உமர் (ரலி) அவர்களிடம், \"(மறுமை நாளில் அல்லாஹ்வுக்கும் அவனுடைய அடியார்களுக்கும் இடையே நடக்கும்) இரகசிய உரையாடல் தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் என்ன செவியுற்றீர்கள்?\" என்று கேட்டார். அதற்கு இப்னு உமர் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் இறை நம்பிக்கையாளர் ஒருவர் வல்லமையும் மாண்பும் மிக்க தம் இறைவனுக்கு அருகில் கொண்டுசெல்லப்படுவார். இறைவன் தனது திரையைப் போட்டு (அவரை மறைத்து)விடுவான். அப்போது அந்த இறைநம்பிக்கையாளர் இறைவனிடம் தம் பாவங்களை ஒப்புக் கொள்வார். \"நீ (உலகத்தில் செய்த இன்னின்ன பாவங்களை) அறிவாயா?\" என்று இறைவன் கேட்பான். அதற்கு அந்த நம்பிக்கையாளர், \"என் இறைவா! நான் (அவற்றை) அறிவேன்\" என்று கூறுவார். அப்போது இறைவன், \"நான் அவற்றை உலகில் (மற்றவருக்குத் தெரியாமல்) மறைத்தேன்; இன்று நான் அவற்றையெல்லாம் உனக்காக மன்னித்துவிடுகிறேன்\" என்று சொல்வான். பின்னர் அவருடைய நன்மைகளின் ஏடு அவரிடம் கொடுக்கப்படும். இறைமறுப்பாளர்களையும் நயவஞ்சகர்களையும் காட்டி, \"இவர்கள்தான் அல்லாஹ்வின் மீது பொய்யுரைத்தவர்கள்\"என்று படைப்பினங்களுக்கிடையே அறிவிக்கப்படும். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7019,
			"arabicnumber": "2769.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7021,
			"arabicnumber": "2770.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7022,
			"arabicnumber": "2770.03",
			"text": "மேற்கண்ட ஹதீஸ் ஆயிஷா (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் பின்வருமாறு இடம்பெற்றுள்ளது: ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: என்னைப் பற்றி அவதூறு பேசப்பட்டபோது, எனக்கு இன்னும் அதைப் பற்றி தெரிந்திராத நிலையில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னைப் பற்றி உரையாற்ற மக்களிடையே) எழுந்து நின்றார்கள். ஏகத்துவ உறுதிமொழி கூறி, அல்லாஹ்வை அவன் தகுதிக்கேற்ப போற்றிப் புகழ்ந்துவிட்டு, \"என் வீட்டார்மீது அபாண்டமாகப் பழி சுமத்தியவர்கள் விஷயத்தில் (அவர்களை என்ன செய்வதென்று) எனக்கு ஆலோசனை கூறுங்கள். அல்லாஹ்வின் மீது சத்தியமாக! என் வீட்டாரிடம் எந்தக் கெட்டப்பழக்கத்தையும் நான் காணவில்லை. அல்லாஹ்வின் மீதாணையாக! எவரிடம் எந்தத் தீய நடத்தையையும் நான் காணவில்லையோ அத்தகைய ஒருவருடன் என் வீட்டாரை இணைத்து அவர்கள் பழி சுமத்தியுள்ளார்கள். நான் இருக்கும்போதே தவிர வேறெப்போதும் அவர் என் வீட்டினுள் நுழைந்ததில்லை. நான் பயணத்தில் வெளியே செல்லும்போதெல்லாம், அவரும் என்னுடனேயே இருப்பார்\" என்று சொன்னார்கள் என ஹதீஸ் ஆரம்பமாகி மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. மேலும், இந்த அறிவிப்புகளில், \"அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என் வீட்டிற்கு வந்திருந்து என் பணிப்பெண்ணிடம் என்னைப் பற்றிக் கேட்டிருந்தார்கள். அவள், \"அல்லாஹ்வின் மீதாணையாக! ஆடு நுழைந்து அவர் \"குழைத்துவைத்த மாவை\" அல்லது \"அவர் பிசைந்துவைத்த மாவை\"த் தின்றுவிட்டுச் செல்லும் அளவுக்கு (மெய்மறந்து) உறங்கி விடுவார் என்பதைத் தவிர வேறு எந்தக் குறையையும் நான் (ஆயிஷாவிடம்) அறிய வில்லை\" என்று சொல்லியிருந்தாள். அப்போது நபி (ஸல்) அவர்களின் தோழர்களில் ஒருவர் அவளை அதட்டி, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் உண்மையைச் சொல்\" என்று அவளிடம் வெளிப்படையாக விஷயத்தை விளக்கினார். அப்போது அவள், \"அல்லாஹ் தூயவன். அல்லாஹ்வின் மீதாணையாக! பொற்கொல்லன், (தூய்மையான) சிவப்புத் தங்கக்கட்டியை எப்படி மாசு மருவற்றதாகக் கருதுவானோ அவ்வாறே நான் அவரைக் கருதுகிறேன்\" என்று சொன்னாள். எந்த மனிதருடன் (என்னை இணைத்து) அவதூறு பேசப்பட்டதோ அந்த மனிதருக்கும் இந்த விஷயம் எட்டியது. அவர் \"சுப்ஹானல்லாஹ் (அல்லாஹ் தூயவன்). நான் ஒருபோதும் எந்த (அந்நியப்) பெண்ணின் ஆடையையும் அகற்றியதில்லையே!\" என்று சொன்னார். பிறகு அவர் அல்லாஹ்வின் பாதையில் (ஓர் அறப்போரில்) வீரமரணம் அடைந்தார். மேலும், ஆயிஷா (ரலி) அவர்கள் இவ்வாறு கூறியதாகக் கூடுதலாக இடம்பெற்றுள்ளது: (முஸ்லிம்களில்) அதைப் பற்றிப் பேசியவர்கள் மிஸ்தஹும் ஹம்னாவும் ஹஸ்ஸானும் ஆவர். நயவஞ்சகன் \"அப்துல்லாஹ் பின் உபை\"தான் (நடக்காத ஒன்றை நடந்ததாக) ஜோடித்து, அதைப் பரப்பிவந்தவன் ஆவான். அவதூறு பரப்பியவர்களில் பெரும்பங்கு வகித்தவனும் அவன்தான்; ஹம்னாவும்கூட. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7023,
			"arabicnumber": "2771",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் அடிமைப் பெண்ணுடன் இணைத்து ஒரு மனிதர் அவதூறு சொல்லப்பட்டார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அலீ (ரலி) அவர்களிடம், \"நீங்கள் சென்று அவருடைய கழுத்தை வெட்டிவிடுங்கள்\" என்று சொன்னார்கள். அவ்வாறே அலீ (ரலி) அவர்கள் சென்ற போது, அவர் (சுற்றுச்சுவர் இல்லாத) ஒரு கிணற்றில் குளித்துக்கொண்டிருந்தார். அவரிடம் அலீ (ரலி) அவர்கள், \"மேலே வா\" என்று தமது கையைக் கொடுத்து அவரை வெளியேற்றினார்கள். அப்போது அவர் இன உறுப்பு துண்டிக்கப்பட்டவராக, இன உறுப்பே அற்றவராக இருந்தார். ஆகவே, அலீ (ரலி) அவர்கள் அவரை(க் கொல்லாமல்) விட்டுவிட்டார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! அவர் இன உறுப்பு துண்டிக்கப்பட்டவர்; இன உறுப்பே அற்றவர் ஆவார்\" என்று சொன்னார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 68
			}
		}
	]
}