{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7235,
			"arabicnumber": "2880.01",
			"text": "ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) நபி (ஸல்) அவர்கள் (திடுக்கிட்டுத்) தூக்கத்திலிருந்து விழித்தெழுந்து, \"அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை. நெருங்கிவிட்ட ஒரு தீமையின் காரணமாக அரபியருக்குக் கேடுதான். இன்று யஃஜூஜ், மஃஜூஜ் கூட்டத்தாரின் தடுப்புச் சுவரிலிருந்து இந்த அளவுக்குத் திறக்கப்பட்டுள்ளது\" என்று கூறினார்கள். -அறிவிப்பாளர் சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் (\"இந்த அளவுக்கு\" என்று கூறியபோது) தம் கைவிரல்களால் (அரபி எண் வடிவில்) 10 என்று மடித்துக் காட்டினார்கள்.- அப்போது நான், \"அல்லாஹ்வின் தூதரே! நல்லவர்கள் நம்மிடையே இருக்கும்போதா நமக்கு அழிவு ஏற்படும்?\" என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், \"ஆம்; தீமை பெருத்து விட்டால்\" என்று பதிலளித்தார்கள். - மேற்கண்ட ஹதீஸ் ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7236,
			"arabicnumber": "2880.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7237,
			"arabicnumber": "2880.03",
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் நபி (ஸல்) அவர்கள் முகம் சிவந்த நிலையில் பதற்றத்துடன் \"அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை. நெருங்கிவிட்ட ஒரு தீமையின் காரணமாக அரபியருக்குக் கேடு தான். இன்று யஃஜூஜ், மஃஜூஜ் கூட்டத்தாரின் தடுப்புச் சுவரிலிருந்து இந்த அளவுக்குத் திறக்கப் பட்டுள்ளது\" என்று கூறியபடி வெளியேறினார்கள். (\"இந்த அளவுக்கு\" என்று கூறியபோது) பெருவிரலையும் அதற்கு அடுத்துள்ள (சுட்டு) விரலையும் வளையமிட்டுக் காட்டினார்கள். அப்போது நான், \"அல்லாஹ்வின் தூதரே! நல்லவர்கள் நம்மிடையே இருக்கும்போதுமா நமக்கு அழிவு ஏற்படும்?\" என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், \"ஆம்; தீமை பெருத்துவிட்டால்\" என்று பதிலளித்தார்கள். - மேற்கண்ட ஹதீஸ் ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7238,
			"arabicnumber": "2880.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7239,
			"arabicnumber": "2881",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7240,
			"arabicnumber": "2882.01",
			"text": "உபைதுல்லாஹ் இப்னு கிப்திய்யா (ரஹ்) அவர்கள் கூறியதாவது: ஹாரிஸ் பின் அபீரபீஆ மற்றும் அப்துல்லாஹ் பின் ஸஃப்வான் (ரஹ்) ஆகியோர் இறைநம்பிக்கையாளர்களின் அன்னை உம்மு சலமா (ரலி) அவர்களிடம் சென்றனர். அப்போது அவ்விருவருடன் நானும் இருந்தேன். அவர்கள் இருவரும் உம்மு சலமா (ரலி) அவர்களிடம், பூமிக்குள் புதைந்துபோகும் படையினரைப் பற்றிக் கேட்டார்கள். -இது அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்களின் காலத்தில் நடைபெற்றது.- அதற்கு உம்மு சலமா (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ஒருவர் இறையில்லம் கஅபா (எல்லை)க்குள் அபயம் தேடி வருவார். அவரை நோக்கிப் படையொன்று அனுப்பப்படும். அப்படையினர் ஒரு சமவெளியில் இருக்கும்போது, பூமிக்குள் புதைந்துபோய் விடுவார்கள்\" என்று சொன்னார்கள். உடனே நான், \"அல்லாஹ்வின் தூதரே! நிர்பந்தமாகப் புறப்பட்டு வந்தவரின் நிலை என்ன?\" என்று கேட்டேன். \"அவர்களுடன் சேர்த்து அவரும் புதைந்துபோவார். எனினும், மறுமை நாளில் அவரது எண்ணத்திற்கேற்ப அவர் எழுப்பப்படுவார்\" என்று கூறினார்கள் என்றார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அறிவிப்பாளர்களில் ஒருவரான அபூஜஅஃபர் (ரஹ்) அவர்கள், \"(\"சமவெளி\" என்பது) மதீனாவிலுள்ள சமவெளி (பைதாஉல் மதீனா) ஆகும்\" என்று கூறினார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7241,
			"arabicnumber": "2882.02",
			"text": "மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் அப்துல் அஸீஸ் பின் ருஃபைஉ (ரஹ்) அவர்கள், \"நான் அபூஜஅஃபர் (ரஹ்) அவர்களைச் சந்தித்தபோது, \"பூமியில் ஒரு சமவெளியில் என்றே உம்மு சலமா (ரலி) அவர்கள் கூறினார்கள்\" என்றேன். அதற்கு அபூஜஅஃபர் (ரஹ்) அவர்கள், \"அவ்வாறில்லை; அல்லாஹ்வின் மீதாணையாக! அது மதீனாவிலுள்ள பைதா(சமவெளி) ஆகும்\" என்று கூறினார்கள்\" என்றார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7242,
			"arabicnumber": "2883.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7243,
			"arabicnumber": "2883.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இந்த இல்லத்தை -அதாவது கஅபாவை- நோக்கி அபயம் தேடி ஒரு கூட்டத்தார் வருவார்கள். அவர்களிடம் ஆதரவுப் படையினரோ ஆட்பலமோ முன்னேற்பாடோ இருக்காது. (அவர்களைத் தாக்குவதற்காக) படை ஒன்று அவர்களிடம் அனுப்பப்படும். அப்படையினர் ஒரு சமவெளியில் இருக்கும்போது அவர்கள் பூமிக்குள் புதைந்து போய்விடுவார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான யூசுஃப் பின் மாஹக் (ரஹ்) அவர்கள் கூறுகிறார்கள்: (இந்த ஹதீஸை அப்துல்லாஹ் பின் ஸஃப் வான் (ரஹ்) அவர்கள் எனக்கு அறிவித்த போது) நான், \"ஷாம் (சிரியா)வாசிகள் அன்றைய நாளில் மக்கா நோக்கிப் பயணம் மேற்கொள்வார்கள்\" என்று சொன்னேன். அதற்கு அப்துல்லாஹ் பின் ஸஃப்வான் (ரஹ்) அவர்கள், \"அறிந்துகொள்ளுங்கள்! அது (பூமிக்குள் புதைந்துபோகும்) இந்தப் படையல்ல\" என்று சொன்னார்கள். இந்த ஹதீஸ் இதன் அறிவிப்பாளர்களில் ஒருவரான ஸைத் பின் அபீஉனைசா (ரஹ்) அவர்கள் வாயிலாக மற்றோர் அறிவிப்பாளர் தொடரிலும் வந்துள்ளது. ஆயினும், அதில் அப்துல்லாஹ் பின் ஸஃப்வான் (ரஹ்) அவர்கள் கூறிய படையினர் பற்றிய குறிப்பு இல்லை. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7244,
			"arabicnumber": "2884",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7245,
			"arabicnumber": "2885.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7246,
			"arabicnumber": "2885.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7247,
			"arabicnumber": "2886.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: விரைவில் குழப்பங்கள் சில தோன்றும். அவற்றுக்கிடையே (மௌனமாகி) அமர்ந்திருப்பவர், (அவற்றுக்காக) எழுந்து நிற்பவரை விடவும், அவற்றுக்கிடையே எழுந்து நிற்பவர், நடப்பவரை விடவும், அவற்றுக்கிடையே நடப்பவர், (அவற்றை நோக்கி) ஓடுபவரைவிடவும் சிறந்தவர் ஆவார். அவற்றில் யார் தம்மை ஈடுபடுத்திக்கொள்கிறாரோ அவரை அழிக்க அவை முற்படும். அப்போது யார் ஒரு புகலிடத்தைப் பெறுகிறாரோ, அவர் அதன் மூலம் தம்மைத் தற்காத்துக் கொள்ளட்டும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் ஆறு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7248,
			"arabicnumber": "2886.02",
			"text": "மேற்கண்ட ஹதீஸ் நவ்ஃபல் பின் முஆவியா பின் உர்வா (ரலி) அவர்கள் வாயிலாக மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் அபூபக்ர் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்களது அறிவிப்பில், \"தொழுகைகளில் ஒன்று (அஸ்ர்) உள்ளது. அதைத் தவறவிட்டவர் தம் குடும்பத்தாரையும் சொத்துக்களையும் விட்டுத் தனிமைப்படுத்தப்பட்டதைப் போன்றவர் ஆவார்\" என்று கூடுதலாக இடம் பெற்றுள்ளது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம் பெற்றுள்ளன. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7249,
			"arabicnumber": "2886.03",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: சில குழப்பங்கள் தோன்றும். அப்போது படுத்து உறங்கிக்கொண்டிருப்பவர் விழித்திருப்பவரை விடவும், விழித்திருப்பவர் (அவற்றுக்காக) எழுந்து நடப்பவரைவிடவும், அவற்றுக்காக எழுந்து நடப்பவர் (அவற்றுக்காக) எழுந்து ஓடுபவரைவிடவும் சிறந்தவர் ஆவார். அப்போது யார் ஒரு புகலிடத்தையோ காப்பிடத்தையோ பெறுகின்றாரோ அவர் (அதன் மூலம்) தம்மைத் தற்காத்துக் கொள்ளட்டும்! இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7250,
			"arabicnumber": "2887.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7251,
			"arabicnumber": "2887.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7252,
			"arabicnumber": "2888.01",
			"text": "அஹ்னஃப் பின் கைஸ் (ரஹ்) அவர்கள் கூறியதாவது: (அலீ (ரலி) அவர்களது காலத்தில் உள்நாட்டு அரசியல் குழப்பம் தலைதூக்கியிருந்த காலகட்டத்தில்) நான் இந்த மனிதரை (அலீ (ரலி) அவர்களை) நாடிப் புறப்பட்டேன். அப்போது என்னை அபூபக்ரா (ரலி) அவர்கள் எதிர்கொண்டு, \"எங்கே செல்கிறீர்?\" என்று கேட்டார்கள். நான், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய பெரிய தந்தையின் மகன் -அதாவது அலீ (ரலி)- அவர்களுக்கு உதவப்போகிறேன்\" என்று சொன்னேன். அப்போது அவர்கள், \"அஹ்னஃபே! திரும்பிச் சென்றுவிடுங்கள். ஏனெனில்,அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இரண்டு முஸ்லிம்கள் தம் வாட்களால் ஒருவரையொருவர் சந்தித்(து சண்டையிட்டு மடிந்)தால் அவர்களில் கொன்றவர், கொல்லப்பட்டவர் ஆகிய இருவருமே நரகத்திற்குச் செல்வார்கள்\"என்று கூறியதை நான் கேட்டேன். அப்போது \"அல்லாஹ்வின் தூதரே! இவர் கொலைகாரர் (தண்டனை பெறுவது சரிதான்); ஆனால், கொல்லப்பட்டவரின் நிலை என்ன?\" என்று கேட்கப்பட்டது. அல்லது நான் கேட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"கொல்லப்பட்டவரும் தம் தோழரைக் கொல்ல வேண்டும் என்ற எண்ணத்துடன்தான் இருந்தார்\" என்று பதிலளித்தார்கள்\" என்றார். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7253,
			"arabicnumber": "2888.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7254,
			"arabicnumber": "2888.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7255,
			"arabicnumber": "2888.04",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இரண்டு முஸ்லிம்கள் பரஸ்பரம் தம் சகோதரருக்கு எதிராக ஆயுதமேந்தும்போது, அவர்கள் இருவருமே நரகத்தின் விளிம்பில் இருக்கிறார்கள். அவர்களில் ஒருவர் மற்றவரைக் கொன்றுவிட்டால், அவர்கள் இருவருமே நரகத்திற்குள் நுழைந்துவிடுகின்றனர். இதை அபூபக்ரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7257,
			"arabicnumber": "157.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7258,
			"arabicnumber": "2889.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் எனக்காகப் பூமியைச் சுருட்டிக் காட்டினான். நான் அதன் கிழக்குப் பகுதிகளையும் மேற்குப் பகுதிகளையும் பார்த்தேன். அதில் எனக்குச் சுருட்டிக் காட்டப்பட்ட அளவுக்கு என் சமுதாயத்தாரின் ஆட்சி விரிவடையும். எனக்குச் சிவப்பு மற்றும் வெள்ளை நிறத்தாலான (தங்கம் மற்றும் வெள்ளியின்) இரு கருவூலங்கள் வழங்கப்பட்டன. நான் என் இறைவனிடம் என் சமுதாயத்தைப் பஞ்சத்தால் ஒட்டுமொத்தமாக அழித்துவிடாதே எனப் பிரார்த்தித்தேன். மேலும், \"அவர்கள்மீது அவர்களிடையே உள்ள எதிரிகளைத் தவிர வெளி எதிரிகளைச் சாட்டி விடாதே. அவ்வாறு நீ சாட்டினால், அவர்களது ஆட்சியும் கண்ணியமும் முற்றாக அழிந்துவிடும்\" என்றும் பிரார்த்தித்தேன். என் இறைவன், \"முஹம்மதே! நான் ஒன்றை முடிவு செய்துவிட்டால் அது மாற்றப்படாது. நான் உம்முடைய சமுதாயத்தைப் பஞ்சத்தால் ஒட்டுமொத்தமாக அழிக்கமாட்டேன் என்பதை உமக்கு (வாக்குறுதியாக) அளிக்கிறேன். மேலும், அவர்களுக்கெதிராக அவர்களிடையேயுள்ள எதிரிகள் அல்லாமல் வெளி எதிரிகளைச் சாட்டி, அவர்களது ஆட்சியை முற்றாக அழிக்கமாட்டேன்; எதிரிகள் பூமியின் அனைத்துப் பகுதிகளிலிருந்தும் அவர்களுக்கு எதிராகத் திரண்டாலும் சரியே! ஆனால், அவர்களிலேயே சிலர் சிலரை அழிப்பார்கள். அவர்களிலேயே சிலர் சிலரைச் சிறைபிடிப்பார்கள்\" என்று கூறினான். இதை ஸவ்பான் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஸவ்பான் (ரலி) அவர்களிடமிருந்தே மேலும் நான்கு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"அல்லாஹ் எனக்காகப் பூமியைச் சுருட்டிக் காட்டினான். நான் அதன் கிழக்குப் பகுதிகளையும் மேற்குப் பகுதிகளையும் பார்த்தேன். மேலும், சிவப்பு மற்றும் வெள்ளை நிறத்தாலான (தங்கம் மற்றும் வெள்ளியாலான) இரு கருவூலங்களை எனக்கு வழங்கினான்...\" என்று நபி (ஸல்) அவர்கள் கூறியதாக ஹதீஸ் ஆரம்பமாகிறது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7259,
			"arabicnumber": "2889.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7260,
			"arabicnumber": "2890.01",
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மதீனா புறநகரில் மேட்டுப் பகுதியான) \"ஆலியா\"விலிருந்து வந்து பனூ முஆவியா பள்ளிவாசலைக் கடந்து சென்றார்கள். அப்போது பள்ளிவாசலுக்குள் நுழைந்து இரண்டு ரக்அத்கள் தொழுதார்கள். அவர்களுடன் நாங்களும் தொழுதோம். பிறகு நீண்ட நேரம் தம் இறைவனிடம் பிரார்த்தித்தார்கள். பிறகு எங்களை நோக்கித் திரும்பி, \"நான் என் இறைவனிடம் மூன்று கோரிக்கைகளை முன்வைத்துப் பிராத்தித்தேன். அவற்றில் இரண்டை எனக்குத் தந்தான்; ஒன்றை மறுத்து விட்டான். நான் என் இறைவனிடம், \"என் சமுதாயத்தாரை (ஒட்டுமொத்தமாக) பஞ்சத்தால் அழித்துவிடாதே\" என்று பிரார்த்தித்தேன். அதை எனக்கு அவன் வழங்கினான். அவனிடம் நான் \"என் சமுதாயத்தாரை வெள்ள நீரில் (ஒட்டுமொத்தமாக) மூழ்கடித்துவிடாதே\" என்று பிரார்த்தித்தேன். அதையும் எனக்கு அவன் வழங்கினான். அவனிடம் நான் \"(என் சமுதாயத்தார்) தமக்கிடையே மோதிக்கொள்ளக்கூடாது\" எனப் பிரார்த்தித்தேன். ஆனால், (அந்தப் பிரார்த்தனையை ஏற்க) அவன் மறுத்துவிட்டான்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7261,
			"arabicnumber": "2890.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7262,
			"arabicnumber": "2891.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7263,
			"arabicnumber": "2891.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7264,
			"arabicnumber": "2891.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7265,
			"arabicnumber": "2891.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7266,
			"arabicnumber": "2891.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7267,
			"arabicnumber": "2892",
			"text": "அபூஸைத் அம்ர் பின் அக்தப் (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு \"ஃபஜ்ர்\" தொழுகை தொழுவித்து விட்டு, சொற்பொழிவு மேடை (மிம்பர்) மீதேறி எங்களுக்கு உரையாற்றினார்கள். இறுதியில் லுஹர் தொழுகை நேரம் வந்தபோது (மேடையிலிருந்து) இறங்கி, தொழுவித்துவிட்டுப் பிறகு மீண்டும் மேடைமீதேறி \"அஸ்ர்\" தொழுகைவரை உரையாற்றினார்கள். பிறகு மேடையிலிருந்து இறங்கி (அஸ்ர் தொழுகை) தொழுவித்து விட்டு பிறகு மறுபடியும் மேடைமீதேறி சூரியன் மறையும்வரை உரையாற்றினார்கள். நடந்தவை, நடக்கவிருப்பவை அனைத்தையும் பற்றி (அன்று) எங்களுக்குத் தெரிவித்தார்கள். எங்களில் நன்கறிந்தவர் (அவற்றை) நன்கு மனனமிட்டவர் ஆவார். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7268,
			"arabicnumber": "144.04",
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (ஒருமுறை கலீஃபா) உமர் (ரலி) அவர்களிடம் இருந்தோம். அப்போது அவர்கள், \"உங்களில் யார் (இனி தலைதூக்கவிருக்கும்) குழப்பங்கள் (ஃபித்னா) பற்றி அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொன்னதை, அவர்கள் சொன்னதைப் போன்றே நினைவில் வைத்திருக்கிறார்?\" என்று கேட்டார்கள். \"நான் (நினைவில் வைத்திருக்கிறேன்)\"என்றேன். அதற்கு உமர் (ரலி) அவர்கள் \"நீர் துணிவு மிக்க மனிதர்தான்\" என்று கூறிவிட்டு, \"எப்படிச் சொன்னார்கள்?\" என்று கேட்டார்கள். நான், \"ஒரு மனிதன் தன் குடும்பத்தார் விஷயத்திலும் (அதாவது அவர்கள்மீது அளவு கடந்த பாசம் வைத்திருப்பதன் மூலமும்), தனது செல்வம் விஷயத்திலும் (அதாவது அது இறைவனைப் பணிந்து வாழும் வாழ்க்கையிலிருந்து திசை திருப்புவதன் மூலமும்), தன் விஷயத்திலும், தன் குழந்தை குட்டிகள் விஷயத்திலும், தன் அண்டை வீட்டார் விஷயத்திலும் (நிறைவேற்ற வேண்டிய உரிமைகளில் குறைவைப்பதன் மூலமும்) சோதனையில் (ஃபித்னா) ஆழ்த்தப்படும்போது தொழுகை, தானதர்மம், நன்மை புரியும்படி ஏவுதல், தீமையிலிருந்து தடுத்தல் ஆகியவை அதற்கான பரிகாரமாக அமையும்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதைக் கேட்டேன் என்றேன். உமர் (ரலி) அவர்கள், \"நான் (சோதனை எனும் பொருள் கொண்ட ஃபித்னாவான) இதைப் பற்றிக் கேட்கவில்லை. கடல் அலையைப் போன்று அடுக்கடுக்காக ஏற்படக்கூடிய (அல்லாஹ்வின் தூதரால் முன்னறிவிப்புச் செய்யப்பட்ட \"குழப்பம்\"எனும் பொருள் கொண்ட ஃபித்னா)வைப் பற்றியே கேட்கிறேன்\" என்று சொன்னார்கள். நான், \"இறைநம்பிக்கையாளர்களின் தலைவரே! உங்களுக்கும் அதற்குமிடையே என்ன தொடர்பு? (அதைப் பற்றி நீங்கள் கவலைப்பட வேண்டியதில்லை.) உங்களுக்கும் அதற்குமிடையே மூடப்பட்ட கதவொன்று உள்ளது (உங்கள் ஆட்சியில் அவற்றில் ஏதும் தலைதூக்கப் போவதில்லை)\" என்று கூறினேன். உமர் (ரலி) அவர்கள், \"அந்தக் கதவு உடைக்கப்படுமா? அல்லது திறக்கப்படுமா?\" என்று கேட்டார்கள். நான், \"இல்லை;அது உடைக்கப்படும்\" என்று பதிலளித்தேன். அதற்கு உமர் (ரலி) அவர்கள், \"(அப்படியானால்) அது ஒருபோதும் மூடப்படாமலிருக்க ஏற்றதே ஆகும்\" என்று சொன்னார்கள். (இதன் அறிவிப்பாளரான) ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறுகிறார்கள்: நாங்கள் ஹுதைஃபா (ரலி) அவர்களிடம், \"உமர் (ரலி) அவர்கள் அந்தக் கதவு (என்பது) யாரைக் குறிக்கும் என அறிந்திருந்தார்களா?\" என்று கேட்டோம். ஹுதைஃபா (ரலி) அவர்கள், \"ஆம்; பகலுக்குமுன் இரவு உண்டு என்பதை அறிவதைப் போன்று உமர் (ரலி) அவர்கள் அதை அறிந்திருந்தார்கள். ஏனெனில், பொய்கள் கலவாத செய்தியையே நான் அவருக்கு அறிவித்தேன்\" என்று பதிலளித்தார்கள். அந்தக் கதவு என்பது யாரைக் குறிக்கிறது என ஹுதைஃபா (ரலி) அவர்களிடம் கேட்க நாங்கள் அஞ்சினோம். எனவே,அவர்களிடம் மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்களைக் கேட்கச் சொன்னோம். அவர் (அந்தக் கதவு என்பது யாரைக் குறிக்கிறது என்று) கேட்டதற்கு ஹுதைஃபா (ரலி) அவர்கள், \"உமர் (ரலி) அவர்கள்தான் அந்தக் கதவு\" என்று பதிலளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7269,
			"arabicnumber": "144.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7270,
			"arabicnumber": "144.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7271,
			"arabicnumber": "2893",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7272,
			"arabicnumber": "2894.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7273,
			"arabicnumber": "2894.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7274,
			"arabicnumber": "2894.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யூப்ரடீஸ் நதியானது வற்றி, தங்கப் புதையல் ஒன்றை வெளிப்படுத்தப்போகிறது. அப்போது அங்கிருப்பவர்கள் அதிலிருந்து எதையும் எடுத்துவிட வேண்டாம். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7275,
			"arabicnumber": "2894.04",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யூப்ரடீஸ் நதியானது வற்றி, தங்கமலை ஒன்றை வெளிப்படுத்தப்போகிறது. அப்போது அங்கிருப்பவர்கள் அதிலிருந்து எதையும் எடுத்துவிட வேண்டாம். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7276,
			"arabicnumber": "2895",
			"text": "அப்துல்லாஹ் பின் அல்ஹாரிஸ் பின் நவ்ஃபல் (ரஹ்) அவர்கள் கூறியதாவது: (ஒரு முறை) நான் உபை பின் கஅப் (ரலி) அவர்களுடன் நின்றுகொண்டிருந்தேன். அப்போது அவர்கள், \"உலகத்தைத் தேடுவதில் மக்கள் தம் கழுத்துகளை நீட்டிக் கொண்டேயிருக்கிறார்கள் (அல்லவா?)\" என்று கூறினார்கள். நான் \"ஆம்\" என்றேன். அதற்கு உபை பின் கஅப் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பின்வருமாறு கூறியதை நான் கேட்டுள்ளேன்: யூப்ரடீஸ் நதியானது வற்றி, தங்கமலை ஒன்றை வெளிப்படுத்தப்போகிறது. அதைப் பற்றி மக்கள் கேள்விப்படும்போது,அதை நோக்கிச் செல்வார்கள். அப்போது அந்த மலை அருகில் இருப்பவர், \"அதிலிருந்து சிறிதளவை எடுத்துக்கொள்ளட்டும் என மக்களை நாம் விட்டு விட்டால், முழுவதுமாகக் கொண்டு போய்விடுவார்கள்\" என்று கூறுவார். எனவே, அதற்காகச் சண்டையிட்டுக்கொள்வார்கள். அப்போது ஒவ்வொரு நூறு பேரிலிருந்தும் தொண்ணூற்றொன்பது பேர் கொல்லப்படுவார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் அபூகாமில் ஃபுளைல் பின் ஹுசைன் (ரஹ்) அவர்களது அறிவிப்பில், \"நானும் உபை பின் கஅப் (ரலி) அவர்களும் ஹஸ்ஸான் கோட்டையின் நிழலில் நின்று கொண்டிருந்தோம்\" என (அப்துல்லாஹ் பின் அல்ஹாரிஸ் பின் நவ்ஃபல் (ரஹ்) அவர்கள் கூறியதாக) ஹதீஸ் ஆரம்பமாகிறது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7277,
			"arabicnumber": "2896",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இராக், தனது (நாணயமான) திர்ஹமையும் (அளவையான) கஃபீஸையும் (தர) மறுக்கும். ஷாம், (சிரியா) தனது (அளவையான) \"முத்யு\"வையும் தீனாரையும் (தர) மறுக்கும். மிஸ்ர் (எகிப்து), தனது (அளவையான) \"இர்தப்பை\"யும் தீனாரையும் (தர) மறுக்கும். ஆரம்ப நிலைக்கே நீங்கள் திரும்பிச் செல்வீர்கள். ஆரம்ப நிலைக்கே நீங்கள் திரும்பிச் செல்வீர்கள். ஆரம்ப நிலைக்கே நீங்கள் திரும்பிச் செல்வீர்கள். இதை அறிவித்த அபூஹுரைரா (ரலி) அவர்கள், \"இதற்கு அபூஹுரைராவின் சதையும் இரத்தமும் சாட்சியமளிக்கின்றன\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7278,
			"arabicnumber": "2897",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ரோம பைஸாந்தியர், அஃமாக் மற்றும் தாபிக் ஆகிய இடங்களில் நிலைகொள்ளாத வரை யுக முடிவு நாள் ஏற்படாது. அவர்களை நோக்கி மதீனாவிலிருந்து ஒரு படை புறப்படும். அன்றைய நாளில் பூமியில் வசிப்போரில் அவர்களே சிறந்தவர்களாயிருப்பர். அவர்கள் அணி வகுத்து நிற்கும்போது ரோமர்கள், எங்களுக்கும் எங்களில் சிறைக்கைதிகளாகப் பிடிக்கப் பட்டோருக்குமிடையே நாங்கள் போர் செய்ய எங்களை விட்டு விடுங்கள்\" என்று கூறுவார்கள். அப்போது முஸ்லிம்கள், \"இல்லை; அல்லாஹ்வின் மீதாணையாக! எங்கள் சகோதரர்கள் மீது போர் தொடுக்க உங்களை நாங்கள் அனுமதிக்கமாட்டோம்\" என்று சொல்வார்கள். ஆகவே, ரோமர்கள் முஸ்லிம்கள் மீது போர் தொடுப்பார்கள். அப்போது முஸ்லிம்களில் மூன்றிலொரு பகுதியினர் தோற்று வெருண்டோடுவார்கள். அவர்களை அல்லாஹ் ஒருபோதும் மன்னிக்கவே மாட்டான். அவர்களில் மூன்றிலொரு பகுதியினர் கொல்லப்படுவார்கள். அவர்கள் அல்லாஹ்விடம் மிகச் சிறந்த உயிர்த்தியாகிகளாவர்; மூன்றிலொரு பகுதியினர் (ரோமர்களை) வெற்றிகொள்வார்கள். அவர்கள் (அதன் பின்னர்) ஒருபோதும் சோதனைக்குள்ளாக்கப் படமாட்டார்கள். இவ்வாறு அவர்கள் கான்ஸ்டாண்டிநோபிளை வெற்றி கொள்வார்கள். அவர்கள் தம் வாட்களை ஆலிவ் மரங்களில் தொங்கவிட்டுப் போர்ச்செல்வங்களை பங்கிட்டுக்கொண்டிருக்கும்போது,அவர்களிடையே ஷைத்தான், \"நீங்கள் புறப்பட்டு வந்த பின் உங்கள் குடும்பத்தாரிடையே மசீஹ் (தஜ்ஜால்) வந்துவிட்டான்\" என்று குரலெழுப்புவான். உடனே அவர்கள் தம் குடும்பத்தாரை நோக்கிப் புறப்பட்டுச் செல்வார்கள். ஆனால், அது பொய்யான செய்தியாயிருக்கும். அவர்கள் ஷாமுக்கு (சிரியா) வரும்போது \"மசீஹ்\" (தஜ்ஜால்) புறப்படுவான். இந்நிலையில் அவர்கள் போருக்காக ஆயத்தமாகி அணிகளைச் சீர் செய்து கொண்டிருக்கும்போது, தொழுகைக்காக இகாமத் சொல்லப்படும். அப்போது மர்யமின் புதல்வர் ஈசா (அலை) அவர்கள் (வானிலிருந்து) இறங்கி வந்து அவர்களுக்குத் தலைமையேற்பார்கள். அவரை அல்லாஹ்வின் விரோதி (தஜ்ஜால்) காணும்போது, தண்ணீரில் உப்பு கரைவதைப் போன்று கரைந்துபோவான். அவனை ஒன்றும் செய்யாமல் விட்டுவிட்டால்கூட அவன் தானாகக் கரைந்து அழிந்துவிடுவான். ஆயினும், ஈசாவின் கரத்தால் அவனை அல்லாஹ் அழிப்பான். அப்போது ஈசா (அலை) அவர்கள் தமது ஈட்டி முனையில் படிந்துள்ள அவனது இரத்தத்தை மக்களுக்குக் காட்டுவார்கள்.இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7279,
			"arabicnumber": "2898.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7280,
			"arabicnumber": "2898.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7281,
			"arabicnumber": "2899.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7282,
			"arabicnumber": "2899.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7283,
			"arabicnumber": "2899.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7284,
			"arabicnumber": "2900",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7285,
			"arabicnumber": "2901.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7286,
			"arabicnumber": "2901.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7287,
			"arabicnumber": "2901.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7288,
			"arabicnumber": "2901.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7289,
			"arabicnumber": "2902",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: ஹிஜாஸ் பகுதியிலிருந்து ஒரு நெருப்பு கிளம்பி, (ஷாம் நாட்டிலுள்ள) \"புஸ்ரா\" (ஹவ்ரான்) எனும் ஊரிலுள்ள ஒட்டகங்களின் பிடரிகளை ஒளிரச் செய்யாத வரை யுகமுடிவு நாள் வராது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7290,
			"arabicnumber": "2903",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (யுக முடிவு நாளுக்குமுன் மதீனாவிலுள்ள) குடியிருப்பு (பகுதி)கள் \"இஹாப்\" அல்லது \"யஹாப்\" எனுமிடத்திற்குச் சென்றுவிடும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான ஸுஹைர் பின் முஆவியா (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் (இந்த ஹதீஸை எனக்கு அறிவித்த) சுஹைல் பின் அபீஸாலிஹ் (ரஹ்) அவர்களிடம், \"இந்த (இஹாப் எனும்) இடம் மதீனாவிலிருந்து எவ்வளவு தொலைவில் உள்ளது?\" என்று கேட்டேன். அவர்கள், \"இவ்வளவு இவ்வளவு மைல் தூரத்தில் உள்ளது\" என்று பதிலளித்தார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7291,
			"arabicnumber": "2904",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மழை பொய்த்துவிடுவதற்குப் பெயர் பஞ்சமன்று. மாறாக, பஞ்சம் என்பது, மழை பெய்து கொண்டேயிருந்தும் பூமியில் (புற்பூண்டுகள்) எதுவும் முளைக்காமலிருப்பதாகும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7292,
			"arabicnumber": "2905.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7293,
			"arabicnumber": "2905.02",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஹஃப்ஸா (ரலி) அவர்களது வீட்டுவாசலில் நின்றுகொண்டு, கிழக்குத் திசையை நோக்கித் தமது கையால் சைகை செய்து, \"குழப்பம், இங்கிருந்துதான் தோன்றும்; ஷைத்தானின் கொம்பு உதயமாகும் இடத்திலிருந்து\" என்று இரண்டு அல்லது மூன்று முறை கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் உபைதுல்லாஹ் பின் சயீத் (ரஹ்) அவர்களது அறிவிப்பில், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஆயிஷா (ரலி) அவர்களது வீட்டுவாசலில் நின்று கொண்டிருந்தார்கள்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7294,
			"arabicnumber": "2905.03",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கிழக்குத்திசையை முன்னோக்கி, \"நினைவில் கொள்ளுங்கள்: குழப்பம் இங்கிருந்துதான் தோன்றும். நினைவில் கொள்ளுங்கள்: குழப்பம் இங்கிருந்துதான் தோன்றும்; நினைவில் கொள்ளுங்கள்: குழப்பம் இங்கிருந்துதான் தோன்றும்; ஷைத்தானின் கொம்பு உதயமாகும் இடத்திலிருந்து\" என்று சொன்னார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7295,
			"arabicnumber": "2905.04",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஆயிஷா (ரலி) அவர்களது வீட்டிலிருந்து புறப்பட்டு வந்து, \"இறைமறுப்பின் தலை (குழப்பம்), இங்கிருந்து -அதாவது கிழக்கிலிருந்து-தான் தோன்றும்; ஷைத்தானின் கொம்பு உதயமாகும் இடத்திலிருந்து\" என்று சொன்னார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7296,
			"arabicnumber": "2905.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7297,
			"arabicnumber": "2905.06",
			"text": "ஃபுளைல் பின் ஃகஸ்வான் (ரஹ்) அவர்கள் கூறியதாவது: சாலிம் பின் அப்தில்லாஹ் பின் உமர் (ரஹ்) அவர்கள் கூறினார்கள்: இராக்வாசிகளே! நீங்கள் பெரும்பாவத்தைச் செய்துகொண்டு, சிறுபாவத்தைப் பற்றிக் கேட்டுக்கொண்டிருப்பது வியப்பையே அளிக்கிறது. என் தந்தை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் பின்வருமாறு கூறியதை நான் கேட்டுள்ளேன்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"கிழக்குத்திசையை நோக்கித் தமது கரத்தால் சைகை செய்தவாறு, குழப்பம் இங்கிருந்துதான் தோன்றும்; ஷைத்தானின் கொம்புகள் உதயமாகும் இடத்திலிருந்து\" என்று கூறியதை நான் கேட்டேன். (இராக்வாசிகளே!) உங்களில் சிலர் சிலரது கழுத்தை வெட்டிக்கொண்டிருக்கிறீர்கள். (அதைப் பற்றிக்கேட்டால் இறைத்தூதர் மூசா, ஃபிர்அவ்னின் குடும்பத்தாரில் ஒருவனைக் கொன்றதைச் சான்றாகக் கூறுவீர்கள்.) மூசா (அலை) அவர்கள் ஃபிர்அவ்னின் குடும்பத்தாரில் ஒருவனைத் தவறுதலாகவே கொன்றார்கள். எனவேதான், வல்லமையும் மாண்பும் மிக்க அல்லாஹ் மூசா (அலை) அவர்களிடம், \"நீர் ஓர் உயிரைக் கொன்றிருந்தீர். உம்மைக் கவலையிலிருந்து நாம் காப்பாற்றினோம். உம்மைப் பல வழிகளில் சோதித்தோம்\" (20:40) என்று கூறினான். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7298,
			"arabicnumber": "2906",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7299,
			"arabicnumber": "2907.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(அறியாமைக்கால கடவுள் சிலைகளான) \"லாத்\"தும் \"உஸ்ஸா\"வும் வழிபாடு செய்யப்படாத வரை இரவும் பகலும் (இல்லாமற்) போகாது\" என்று கூறியதைக் கேட்டேன். நான், \"அல்லாஹ்வின் தூதரே! இணை கற்பிப்போர் வெறுத்தபோதிலும், எல்லா மார்க்கங்களை விட மேலோங்கச் செய்வதற்காக நல்வழியுடனும் உண்மை மார்க்கத்துடனும் அவனே தன் தூதரை அனுப்பினான்\" (9:33; 61:9) என அல்லாஹ் அருளியபோது, இந்த மார்க்கம் முழுமையடையும் என்றே நான் எண்ணிக்கொண்டிருந்தேன். (ஆனால்,தாங்கள் வேறு விதமாகச் சொல்கிறீர்களே!)\" என்று கூறினேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(உண்மைதான்) விரைவில் அல்லாஹ் நாடிய அளவு இது நடக்கும். பிறகு அல்லாஹ் நல்ல காற்று ஒன்றை அனுப்புவான். அது யாரது உள்ளத்தில் கடுகுமணியளவு இறைநம்பிக்கை (ஈமான்) உள்ளதோ அந்த ஒவ்வொருவரையும் கைப்பற்றிக்கொள்ளும். பிறகு எந்த நன்மையும் இல்லாதவர்களே (பூமியில்) எஞ்சியிருப்பர். அவர்கள் தம் மூதாதையரின் மார்க்கத்திற்குத் திரும்பிச் சென்றுவிடுவர்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஆயிஷா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7300,
			"arabicnumber": "2907.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7303,
			"arabicnumber": "2908.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: என் உயிர் எவன் கையிலுள்ளதோ அ(ந்த இறை)வன்மீது சத்தியமாக! மக்களுக்கு ஒரு காலம் நிச்சயமாக வரும். (அப்போது) கொலை செய்தவனுக்குத் தான் எதற்காகக் கொலை செய்தான் என்பது தெரியாது. கொல்லப்பட்டவனுக்குத் தான் எதற்காகக் கொல்லப்பட்டான் என்பது தெரியாது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7304,
			"arabicnumber": "2908.02",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"என் உயிர் எவன் கையிலுள்ளதோ அ(ந்த இறை)வன்மீது சத்தியமாக! மக்களுக்கு ஒருநாள் வராதவரை உலகம் அழியாது. அன்று கொலை செய்தவனுக்குத் தான் எதற்காகக் கொன்றோம் என்பது தெரியாது. கொல்லப்பட்டவனுக்குத் தான் எதற்காகக் கொல்லப்பட்டோம் என்பது தெரியாது\" என்று கூறினார்கள். அப்போது \"அது எவ்வாறு நடக்கும்?\" என்று கேட்கப்பட்டது. அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"கொலை சர்வ சாதாரணமாகிவிடும். கொன்றவனும் கொல்லப்பட்டவனும் நரகத்திற்குச் செல்வார்கள்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7305,
			"arabicnumber": "2909.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அபிசீனியாவைச் சேர்ந்த மெலிந்த கால்கள் உடைய ஒரு மனிதன் கஅபாவை (இடித்து)ப் பாழாக்குவான். - இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7306,
			"arabicnumber": "2909.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அபிசீனியாவைச் சேர்ந்த மெலிந்த கால்கள் உடைய ஒரு மனிதன் கஅபாவை (இடித்து)ப் பாழாக்குவான்.- இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7307,
			"arabicnumber": "2909.03",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அபிசீனியாவைச் சேர்ந்த மெலிந்த கால்கள் உடைய ஒரு மனிதன் வல்லமையும் மாண்பும் மிக்க அல்லாஹ்வின் இல்லத்தை (கஅபாவை இடித்து)ப் பாழாக்குவான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7308,
			"arabicnumber": "2910",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: \"கஹ்தான்\" குலத்திலிருந்து ஒரு மனிதர் தோன்றி, தமது கைத்தடியால் மக்களை வழி நடத்தாத வரை யுக முடிவு நாள் வராது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7309,
			"arabicnumber": "2911",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: \"ஜஹ்ஜாஹ்\" எனப்படும் ஒரு மனிதர் அரசாளாத வரை இரவு பகல் (மாற்றம் நின்று, உலகம் அழிந்து) போகாது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். முஸ்லிம் (பின் அல்ஹஜ்ஜாஜ் ஆகிய நான்) கூறுகிறேன்: ஷரீக், உபைதுல்லாஹ், உமைர், (இந்த ஹதீஸின் அறிவிப்பாளர்களில் ஒருவரான) அப்துல் கபீர் ஆகிய நால்வரும் சகோதர்கள் ஆவர். அப்துல் மஜீத் என்பவரே இந்நால்வரின் தந்தை ஆவார். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7310,
			"arabicnumber": "2912.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7311,
			"arabicnumber": "2912.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7312,
			"arabicnumber": "2912.03",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: முடியாலான காலணிகளை அணியும் ஒரு கூட்டத்தாருடன் நீங்கள் போர் புரியாதவரை யுக முடிவுநாள் வராது. சிறிய கண்களும் சப்பை மூக்குகளும் கொண்ட ஒரு சமுதாயத்தாருடன் நீங்கள் போரிடாத வரை யுக முடிவுநாள் வராது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7313,
			"arabicnumber": "2912.04",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: முடியை (உடையாக) அணிந்து, முடியில் (காலணி தயாரித்து) நடக்கின்ற, தோலால் மூடப்பட்ட கேடயங்களைப் போன்ற முகங்களைக் கொண்ட சமுதாயத்தாரான துருக்கியருடன் முஸ்லிம்கள் போரிடாத வரை யுக முடிவுநாள் வராது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7314,
			"arabicnumber": "2912.05",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யுக முடிவு நாளுக்கு முன், முடியாலான காலணிகளை அணிகின்ற சிவந்த முகமும் சிறிய கண்களும் கொண்ட ஒரு கூட்டத்தாருடன் நீங்கள் போர் செய்வீர்கள். அவர்களின் முகங்கள் தோலால் மூடப்பட்ட கேடயங்களைப் போன்று (அகன்று) இருக்கும். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7315,
			"arabicnumber": "2913.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7316,
			"arabicnumber": "2913.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7317,
			"arabicnumber": "2914.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7318,
			"arabicnumber": "2914",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இறுதிக் காலத்தில் ஒரு கலீஃபா வருவார். அவர் செல்வத்தை (மக்களிடையே) பங்கிட்டுக் கொடுப்பார்; எண்ணிக் கணக்குப் பார்க்க மாட்டார். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்களும் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்களும் அறிவிக்கின்றனர். - மேற்கண்ட ஹதீஸ் அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் வழியாக மற்றோர் அறிவிப்பாளர் தொடரிலும் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7320,
			"arabicnumber": "2915.01",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அம்மார் (ரலி) அவர்கள் அகழ் தோண்டிக்கொண்டும் தமது தலையில் படிந்திருந்த மண்ணைத் துடைத்துக்கொண்டும் இருக்கலானார்கள். இதைக் கண்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அம்மார் (ரலி) அவர்களிடம் \"சுமய்யாவின் மகனுக்கு ஏற்படவுள்ள துன்பமே! (புஃஸ இப்னி சுமய்யா) உம்மை ஒரு கலகக்கூட்டத்தார் கொன்று விடுவார்கள்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7321,
			"arabicnumber": "2915.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7322,
			"arabicnumber": "2916.01",
			"text": "உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அம்மார் (ரலி) அவர்களிடம், \"உம்மைக் கலகக்கார கூட்டத்தார் கொன்றுவிடுவார்கள்\" என்று கூறினார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்து. - மேற்கண்ட ஹதீஸ் உம்மு சலமா (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7323,
			"arabicnumber": "2916.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7324,
			"arabicnumber": "2916.03",
			"text": "உம்மு சலமா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அம்மார் (ரலி) அவர்களைப் பற்றி), \"அம்மாரை ஒரு கலகக்கார கூட்டத்தார் கொன்றுவிடுவர்\" என்று சொன்னார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7326,
			"arabicnumber": "2917",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7327,
			"arabicnumber": "2918.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7328,
			"arabicnumber": "2918.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7344,
			"arabicnumber": "2924.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 7345,
			"arabicnumber": "2924.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 7346,
			"arabicnumber": "2925",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் மற்றும் உமர் (ரலி) ஆகியோரும் மதீனாவின் வீதியொன்றில் அவனை (இப்னு ஸய்யாதை)ச் சந்தித்தார்கள். அவனிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நான் இறைவனின் தூதர் என நீ சாட்சியம் அளிக்கிறாயா?\"என்று கேட்டார்கள். அதற்கு அவன், \"நான் இறைவனின் தூதர் என நீர் சாட்சியம் அளிக்கிறீரா?\" என்று (திருப்பிக்) கேட்டான். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நான் அல்லாஹ்வையும் அவனுடைய வானவர்களையும் அவனுடைய வேதங்களையும் நம்பிக்கை கொண்டேன். நீ என்ன காண்கிறாய்?\" என்று கேட்டார்கள். அதற்கு இப்னு ஸய்யாத், \"தண்ணீரின் மீது சிம்மாசனம் ஒன்றைக் காண்கிறேன்\" என்று சொன்னான். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீ கடல்மீதுள்ள இப்லீஸின் சிம்மாசனத்தையே காண்கிறாய்\" என்று கூறிவிட்டு, \"இன்னும் என்ன காண்கிறாய்?\" என்று கேட்டார்கள். அதற்கு அவன், \"(அல்லாஹ்விடமிருந்து செய்திகளைக் கொண்டுவரும்) இரு உண்மையாளர்களையும் ஒரு பொய்யரையும், அல்லது இரு பொய்யர்களையும் ஓர் உண்மையாளரையும் நான் காண்கிறேன்\" என்று சொன்னான். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவனுக்குக் குழப்பம் ஏற்பட்டுள்ளது. அவனை விட்டுவிடுங்கள்\" என்று கூறினார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 7347,
			"arabicnumber": "2926",
			"text": "மேற்கண்ட ஹதீஸ் ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் வழியாகவும் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. \"நபி (ஸல்) அவர்கள் தம்முடன் அபூபக்ர் (ரலி), உமர் (ரலி) ஆகியோர் இருக்க, இப்னு ஸாயிதைச் சந்தித்தார்கள். அப்போது இப்னு ஸாயித் சிறுவர்களுடன் (விளையாடிக் கொண்டு) இருந்தான்...\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம் பெற்றுள்ளன. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 7348,
			"arabicnumber": "2927.01",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நான் இப்னு ஸாயிதுடன் மக்காவரை பயணம் மேற்கொண்டேன். அப்போது அவன் என்னிடம், \"நான் மக்களில் சிலரைச் சந்தித்தேன். அவர்கள் என்னை \"தஜ்ஜால்\" எனக் கருதுகின்றனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"தஜ்ஜாலுக்குக் குழந்தை இருக்காது\" என்று கூறியதை நீங்கள் கேட்கவில்லையா?\" என்று கேட்டான். நான், \"ஆம் (கேட்டுள்ளேன்)\" என்றேன். அவன், \"எனக்குக் குழந்தை உள்ளது\" என்று கூறிவிட்டு, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"தஜ்ஜால் மதீனாவுக்குள்ளும் மக்காவுக்குள்ளும் நுழையமாட்டான்\" என்று கூறியதை நீங்கள் கேட்டதில்லையா?\" என்றான். நான் \"ஆம் (கேட்டுள்ளேன்)\" என்றேன். அவன், \"நான் மதீனாவில் பிறந்தேன். இதோ நான் மக்காவுக்குச் செல்லப் போகிறேன்\" என்று கூறினான். பிறகு இறுதியாக அவன், \"அறிந்துகொள்க: அல்லாஹ்வின் மீதாணையாக! நான் தஜ்ஜாலின் பிறப்பையும் அவனது வசிப்பிடத்தையும் இப்போது அவன் எங்கே இருக்கிறான் என்பதையும் நன்கறிவேன்\" என்று கூறி, என்னைக் குழப்பிவிட்டான். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 7349,
			"arabicnumber": "2927.02",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: இப்னு ஸாயித் என்னிடம் பேசியபோது, அவனைப் பழிப்பதற்கு எனக்கு வெட்கமாக இருந்தது. அவன், \"(விவரம் தெரியாத காரணத்தால், என்னை \"தஜ்ஜால்\" என்று நினைக்கும்) பொது மக்களை நான் பொருட்படுத்தவில்லை. (ஆனால்,) முஹம்மத் (ஸல்) அவர்களின் தோழர்களே! உங்களுக்கும் எனக்குமிடையே என்ன பிரச்சினை? நபி (ஸல்) அவர்கள், \"அவன் (தஜ்ஜால்) யூதன்\" என்று சொல்லவில்லையா? ஆனால், நானோ இஸ்லாத்தை ஏற்றுவிட்டேன்; \"அவனுக்குக் குழந்தையேதும் பிறக்காது\" என்று நபியவர்கள் சொன்னார்கள். எனக்குக் குழந்தை இருக்கிறது. \"அவன் மக்காவுக்குள் நுழைவதை அல்லாஹ் தடைசெய்துவிட்டான்\" என்று நபியவர்கள் கூறினார்கள். நான் ஹஜ் செய்துவிட்டேன்\" என்று கூறினான். இவ்வாறு அவனது சொல்,என்னில் ஒரு மதிப்பை உண்டாக்கும் அளவுக்கு அவன் பேசிக்கொண்டேயிருந்தான். பிறகு அவன், \"அறிந்துகொள்க: அல்லாஹ்வின் மீதாணையாக! இப்போது அவன் (தஜ்ஜால்) எங்கே இருக்கிறான் என்பதை நான் அறிவேன். அவனுடைய தந்தையையும் தாயையும் நான் அறிவேன்\" என்றான். அவனிடம் \"அந்த (தஜ்ஜால் எனும்) மனிதனாக நீ இருக்க வேண்டும் என ஆசைப்படுகிறாயா?\" என்று கேட்கப்பட்டது. அதற்கு அவன், \"அவ்வாறு என்னிடம் கோரப்பட்டால் அதை நான் வெறுக்கமாட்டேன்\" என்றான். இந்தத் தகவல் இரு அறிவிப்பாளர்தொடர் களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 7350,
			"arabicnumber": "2927.03",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) நாங்கள் ஹஜ்ஜுக்கு, அல்லது உம்ராவுக்குச் சென்றோம். எங்களுடன் இப்னு ஸாயிதும் இருந்தான். (வழியில்) நாங்கள் ஓரிடத்தில் தங்கினோம். (ஓய்வெடுப்பதற்காக) மக்கள் கலைந்து சென்றபின் நானும் இப்னு ஸாயிதும் மட்டுமே எஞ்சியிருந்தோம். அவனைப் பற்றிச் சொல்லப்படுகிற விஷயங்களால் அவனருகில் இருப்பதை நான் மிகவும் வெறுத்தேன். அவன் தனது பயணச் சாமான்களைக் கொண்டுவந்து எனது பயணச் சாமான்களுடன் வைத்தான். அப்போது நான், \"வெயில் கடுமையாக உள்ளது. அந்த மரத்திற்குக் கீழே நீ உன் பொருட்களை வைத்தால் நன்றாயிருக்குமே\" என்றேன். அவ்வாறே அவன் செய்தான். அப்போது ஆட்டு மந்தை ஒன்று வந்தது. உடனே அவன் சென்று, ஒரு பெரிய கோப்பை (நிறைய பால்) உடன் என்னிடம் வந்து, \"அபூசயீதே! பருகுவீராக\" என்றான். நான், \"வெயிலும் கடுமையாக உள்ளது. பாலும் சூடாக உள்ளது என்று -அவன் கையிலிருந்து வாங்கி அருந்தப் பிடிக்காமல்,அல்லது அவன் கையிலிருந்து வாங்கப் பிடிக்காமல்- சொன்னேன். அவன், \"அபூசயீதே! நான் ஒரு கயிற்றை எடுத்துவந்து அதை ஒரு மரத்தில் மாட்டி தற்கொலை செய்துகொள்ளலாமா என்று நினைத்தேன். என்னைப் பற்றி மக்கள் பேசிக்கொள்கிற செய்திகளே காரணம். அபூசயீதே! யாருக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறிய ஹதீஸ் தெரியாவிட்டாலும், அன்சாரிகளே! உங்களுக்குத் தெரியாமல் போகாது. (அபூசயீதே!) நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் ஹதீஸ்களை நன்கறிந்தவர்களில் ஒருவரல்லவா? அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவன் (தஜ்ஜால்) இறைமறுப்பாளன்\" என்று சொல்லவில்லையா? நானோ ஒரு முஸ்லிமாக இருக்கிறேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவன் (தஜ்ஜால்) குழந்தை பாக்கியமற்ற மலடன்\" என்று கூறவில்லையா? நானோ என் குழந்தையை மதீனாவில் விட்டுவந்துள்ளேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவன் மதீனாவுக்குள்ளும் மக்காவுக்குள்ளும் நுழையமுடியாது\" என்று கூறவில்லையா? நானோ,மதீனாவிலிருந்து மக்காவை நாடி வந்துகொண்டிருக்கிறேன்\" என்று சொன்னான். இதையெல்லாம் கேட்டு அவனை மன்னிக்கும் அளவுக்கு நான் போய்விட்டேன். பிறகு அவன், \"அறிந்துகொள்க: அல்லாஹ்வின் மீதாணையாக! தஜ்ஜாலை நான் அறிவேன். அவனது பிறப்பையும், இப்போது அவன் எங்கே இருக்கிறான் என்பதையும் நான் அறிவேன்\" என்றான். அப்போது நான் \"காலமெல்லாம் உனக்கு நாசமுண்டாகட்டும்\" என்று கூறி (சபித்து)விட்டேன். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 7351,
			"arabicnumber": "2928.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 7352,
			"arabicnumber": "2928.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 7353,
			"arabicnumber": "2929",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 7356,
			"arabicnumber": "169.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 7357,
			"arabicnumber": "2930.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 7358,
			"arabicnumber": "2930.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 7359,
			"arabicnumber": "2932.01",
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் இப்னு ஸாயிதை மதீனாவின் சாலைகளில் ஒன்றில் சந்தித்தார்கள். அவர்கள் அவனிடம் ஏதோ சொல்ல அவன் கோபப்பட்டான். உடனே அவனது உடல், தெருவையே அடைத்துக்கொள்ளும் அளவுக்கு (வீங்கி)ப் புடைத்தது. பின்னர் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் (தம் சகோதரி) ஹஃப்ஸா (ரலி) அவர்களிடம் சென்றார்கள். நடந்த செய்தி முன்பே ஹஃப்ஸாவுக்குத் தெரிந்திருந்தது. அப்போது ஹஃப்ஸா (ரலி) அவர்கள், \"அல்லாஹ் உமக்கு அருள்புரியட்டும்! நீர் இப்னு ஸாயிதிடமிருந்து என்ன எதிர்பார்த்தீர்?\" என்று கேட்டுவிட்டு, \"உமக்குத் தெரியுமா? அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவன் (தஜ்ஜால்) தனக்கேற்படும் ஒரு கோபத்தின் போதே புறப்படுவான்\" என்று கூறியதை நீர் அறியவில்லையா? (ஒருகால் இப்னு ஸய்யாதே தஜ்ஜாலாக இருந்தால் என்னவாயிருக்கும்!)\" என்று கேட்டார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 7360,
			"arabicnumber": "2932.02",
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், \"நான் இப்னு ஸய்யாதை இரு முறை சந்தித்தேன். முதல் முறை சந்தித்துவிட்டு வந்து அவ(னுடைய நண்ப)ர்களில் ஒருவரிடம், \"இவன் (இப்னு ஸய்யாத்), அவர் (நபி) என்று நீங்கள் பேசிக்கொள்கிறீர்களா?\" எனக் கேட்டேன். அதற்கு அவர், \"அல்லாஹ்வின் மீதாணையாக! இல்லை\" என்று பதிலளித்தார். அதற்கு நான், \"நீர் என்னிடம் பொய் சொல்கிறீர். அல்லாஹ்வின் மீதாணையாக! உங்களில் சிலர் என்னிடம், \"அவன் உங்களிலேயே அதிகச்செல்வமும் நிறைய குழந்தைகளும் உள்ளவனாக ஆகாத வரை மரணிக்கமாட்டான்\" என்று கூறினார்கள். அவனைப் பற்றி அவ்வாறே இன்றும் அவர்கள் கருதிக்கொண்டிருக்கிறார்கள் (நபி என்று கருதாவிட்டால் அவ்வளவு உறுதியாக நீங்கள் எப்படி இவ்வாறு நம்பினீர்கள்?)\" என்று கேட்டேன் என்று கூறினார்கள். மேலும், அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறினார்கள்: பிறகு நாங்கள் பேசிக்கொண்டிருந்துவிட்டு,அவனிடமிருந்து நான் (புறப்பட்டு) வந்துவிட்டேன். பிறகு அவனை மறுபடியும் நான் சந்தித்தபோது, அவனது கண் ஒன்று வீங்கிப் புடைத்திருந்தது. நான், \"இப்போது நான் காணுகின்ற நிலையில் உன்னுடைய கண் எப்போது மாறியது?\"என்று கேட்டேன். அதற்கு அவன், \"எனக்குத் தெரியாது\" என்று பதிலளித்தான். \"உன் தலையிலேயே அது இருக்க,உனக்கு எப்படி தெரியாமல் போகும்?\" என்று கேட்டேன். அதற்கு அவன், \"அல்லாஹ் நாடினால் உம்முடைய இந்தக் கைத்தடிக்கும் அல்லாஹ் (இந்தக் குறையுள்ள) கண்ணை உருவாக்குவான்\" என்று கூறிவிட்டு, கழுதையைப் போன்று மிகக் கடுமையாகக் கத்தினான். அப்போது என் தோழர்களில் சிலர், என்னிடமிருந்த கைத்தடியால் அது உடையும் அளவுக்கு நான்தான் அவனை அடித்துவிட்டேன் என்று எண்ணினர். \"அல்லாஹ்வின் மீதாணையாக! அ(வன் கத்திய)தற்கான காரணத்தை நான் அறியவில்லை. பிறகு அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் இறைநம்பிக்கையாளர்களின் அன்னை (ஹஃப்ஸா-ரலி) அவர்களிடம் சென்று அதைப் பற்றித் தெரிவித்தார்கள். அதற்கு இறை நம்பிக்கையாளர்களின் அன்னை ஹஃப்ஸா (ரலி) அவர்கள், \"அவனிடம் உமக்கென்ன வேலை?\" என்று கேட்டுவிட்டு, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவனுக்கு (தஜ்ஜாலுக்கு) ஏற்படும் ஒரு கோபத்தை முன்னிட்டே அவன் மக்களிடையே முதன் முதலில் புறப்பட்டு வருவான்\" என்று கூறியதை நீர் அறியவில்லையா?\" என்று கேட்டார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 7361,
			"arabicnumber": "169.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 7362,
			"arabicnumber": "169.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 7363,
			"arabicnumber": "2933.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: எல்லா இறைத்தூதர்களும் தம் சமுதாயத்தாரை மகா பொய்யனான ஒற்றைக் கண்ணன் (தஜ்ஜால்) குறித்து எச்சரிக்காமல் இருந்ததில்லை. அறிந்துகொள்ளுங்கள்: அவன் ஒற்றைக் கண்ணன் ஆவான். ஆனால், உங்கள் இறைவன் ஒற்றைக் கண்ணன் அல்லன். அந்தப் பொய்யனுடைய இரு கண்களுக்கிடையே காஃப், ஃப, ரா (இறைமறுப்பாளன் - காஃபிர்) என்று (தனித் தனி எழுத்துகளில்) எழுதப்பட்டிருக்கும். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 7364,
			"arabicnumber": "2933.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: தஜ்ஜாலின் இரு கண்களுக்கிடையே காஃப், ஃப, ர -அதாவது காஃபிர் (இறைமறுப்பாளன்)- என்று எழுதப்பட்டிருக்கும். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 7365,
			"arabicnumber": "2933.03",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"தஜ்ஜால் ஒரு கண் தடவப்பட்டவன் ஆவான். அவனுடைய இரு கண்களுக்கிடையே \"காஃபிர்\" என்று எழுதப்பட்டிருக்கும். அதை ஒவ்வொரு முஸ்லிமும் வாசிப்பார்\" என்று கூறிவிட்டு,அதைத் தனித்தனியாக (காஃப், ஃப, ர என்று) உச்சரித்துக் காட்டினார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 7366,
			"arabicnumber": "2934.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 7367,
			"arabicnumber": "2934.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 7369,
			"arabicnumber": "2935.01",
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தஜ்ஜால் தொடர்பாகக் கூறுகையில், \"அவனுடன் நீரும் நெருப்பும் இருக்கும். அவனிடம் உள்ள நெருப்பானது (உண்மையில்) குளிர்ந்த நீராகும். அவனிடமுள்ள நீர் (உண்மையில்) நெருப்பாகும். ஆகவே, (அவனிடமுள்ள தண்ணீரை நம்பி) அழிந்து விடாதீர்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. இந்த ஹதீஸை நானும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்றுள்ளேன் என அபூமஸ்ஊத் உக்பா பின் அம்ர் அல்அன்சாரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 7370,
			"arabicnumber": "2935.02",
			"text": "ரிப்ஈ பின் ஹிராஷ் (ரஹ்) அவர்கள் கூறியதாவது: நான் அபூமஸ்ஊத் உக்பா பின் அம்ர் (ரலி) அவர்களுடன் ஹுதைஃபா பின் அல் யமான் (ரலி) அவர்களிடம் சென்றேன். உக்பா (ரலி) அவர்கள் ஹுதைஃபா (ரலி) அவர்களிடம், \"நீங்கள் தஜ்ஜால் தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்ற ஹதீஸை எனக்கு அறிவியுங்கள்\" என்று கேட்டார்கள். அதற்கு அவர்கள், \"தஜ்ஜால் (யுக முடிவு நாளுக்குமுன்) புறப்பட்டு வருவான். அவனுடன் நீரும் நெருப்பும் இருக்கும். மக்களுக்கு நீராகக் காட்சி தருவது (உண்மையில்) கரிக்கும் நெருப்பாகும். மக்களுக்கு நெருப்பாகக் காட்சி தருவது (உண்மையில்) குளிரான சுவை நீராகும். உங்களில் யார் அந்த இடத்தை அடைகிறாரோ அவர் நெருப்பாகக் காட்சியளிப்பதில் விழட்டும்! ஏனெனில், அது நல்ல சுவை நீராகும்\" என்று கூறினார்கள். அப்போது உக்பா பின் அம்ர் (ரலி) அவர்கள், ஹுதைஃபா (ரலி) அவர்களின் அறிவிப்பை உண்மைப்படுத்தும் விதமாக, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து நானும் (இவ்வாறே) செவியுற்றேன்\" என்றார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 7372,
			"arabicnumber": "2936",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள் நான் உங்களிடம் தஜ்ஜாலைப் பற்றிய செய்தி ஒன்றைச் சொல்லட்டுமா? வேறெந்த இறைத்தூதரும் அதைப் பற்றி தம் சமுதாயத்தாருக்குச் சொன்னதில்லை. அது (என்னவெனில்), அவன் ஒற்றைக்கண்ணன் ஆவான். அவன் தன்னுடன் சொர்க்கம் மற்றும் நரகம் போன்றதைக் கொண்டுவருவான். அவன் எதைச் சொர்க்கம் என்று கூறுகிறானோ, அதுதான் (உண்மையில்) நரகமாக இருக்கும். (இறைத்தூதர்) நூஹ் (அலை) அவர்கள் அவனைக் குறித்துத் தம் சமூகத்தாரை எச்சரித்ததைப் போன்று, நானும் உங்களை (அவனைக் குறித்து) எச்சரிக்கிறேன். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 7373,
			"arabicnumber": "2937.01",
			"text": "நவ்வாஸ் பின் சம்ஆன் (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் காலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தஜ்ஜாலைப் பற்றிக் குறிப்பிட்டார்கள். அவன் தொடர்பாக(ப் பேசியபோது) அவர்கள் (சில சமயம் குரலைத்) தாழ்த்தவும், (சில சமயம்) உயர்த்தவும் செய்தார்கள். இறுதியில் அவன், (அருகிலுள்ள) பேரீச்ச மரத்தோப்புகளுக்கிடையே இருக்கிறானோ என்று நாங்கள் எண்ணும் அளவுக்குப் பேசினார்கள். பின்னர் நாங்கள் (மறுபடியும்) மாலைப் பொழுதில் நபியவர்களிடம் வந்தோம். அப்போது தஜ்ஜாலைக் குறித்த அச்சம் எங்கள் முகங்களில் இருப்பதை அவர்கள் அறிந்துகொண்டு, \"உங்களுக்கு என்ன நேர்ந்தது?\" என்று கேட்டார்கள். நாங்கள், \"அல்லாஹ்வின் தூதரே! தாங்கள் (இன்று) காலையில் தஜ்ஜாலைப் பற்றிக் குறிப்பிட்டீர்கள். (அப்போது) அவனைப் பற்றி(க் குரலை)த் தாழ்த்தியும் உயர்த்தியும் பேசினீர்கள். இறுதியில் அவன், (அருகிலுள்ள) பேரீச்ச மரத்தோப்புகளுக்கிடையே இருக்கிறானோ என்று நாங்கள் எண்ணும் அளவுக்குப் பேசினீர்கள் (அதுதான் எங்கள் அச்சத்திற்குக் காரணம்)\" என்று கூறினோம். அப்போது நபியவர்கள், \"நான் உங்கள் விஷயத்தில் பெரிதும் அஞ்சுவது தஜ்ஜாலைக் குறித்து அல்ல; நான் உங்களிடையே (உயிருடன்) இருக்கும்போது அவன் தோன்றினால் அவனிடமிருந்து உங்களைக் காக்க நானே வாதாடுவேன். நான் உங்களிடையே இல்லாத போது அவன் வெளிப்பட்டால், அப்போது ஒவ்வொரு (முஸ்லிமான) மனிதரும் தமக்காக வாதாடிக்கொள்ள வேண்டும்; அல்லாஹ் ஒவ்வொரு முஸ்லிமுக்கும் எனது சார்பில் பொறுப்பாளனாக இருப்பான். தஜ்ஜால் சுருள்முடி கொண்ட ஓர் இளைஞன் ஆவான்; அவனது கண் ஒரே குலையில் துருத்திக் கொண்டிருக்கும் திராட்சை போன்றிருக்கும். உருவத்தில் அவன் அப்துல் உஸ்ஸா பின் கத்தன் என்பவனை ஒத்திருப்பான். உங்களில் யார் அவனை அடைகிறாரோ அவர் அவனுக்கெதிராக \"அல்கஹ்ஃப்\" அத்தியாயத்தின் (18) ஆரம்ப வசனங்களை ஓதிக்கொள்ளட்டும். அவன் சிரியாவுக்கும் இராக்குக்கும் இடையே உள்ள ஒரு பகுதியிலிருந்து புறப்பட்டு வந்து, வலப்பக்கத்திலும் இடப்பக்கத்திலும் அக்கிரமங்களைக் கட்டவிழ்த்துவிடுவான்; அல்லாஹ்வின் அடியார்களே! அப்போது நீங்கள் உறுதியோடு இருங்கள்\" என்றார்கள். நாங்கள், \"அல்லாஹ்வின் தூதரே! அவன் பூமியில் எத்தனை நாட்கள் தங்கியிருப்பான்?\" என்று கேட்டோம். அதற்கு, \"நாற்பது நாட்கள்\" என்று பதிலளித்த நபியவர்கள், \"அன்றைய ஒரு நாள் ஓர் ஆண்டைப் போன்றும், மறுநாள் ஒரு மாதத்தைப் போன்றும், அதற்கு அடுத்த நாள் ஒரு வாரத்தைப் போன்றும், மற்ற நாட்கள் உங்களின் (சாதாரண) நாட்களைப் போன்றும் இருக்கும்\" என்று குறிப்பிட்டார்கள். நாங்கள், \"அல்லாஹ்வின் தூதரே! ஓர் ஆண்டிற்குச் சமமாக இருக்கும் அந்த ஒரு நாளில், வழக்கமாகத் தொழும் (ஐவேளைத்) தொழுகைகளைத் தொழுதால் போதுமா?\" என்று கேட்டோம். அதற்கு நபியவர்கள், \"இல்லை (போதாது);அந்த (நீண்ட) நாளை, அதற்கேற்ப மதிப்பிட்டு(த் தொழுது)கொள்ளுங்கள்\" என்று பதிலளித்தார்கள். நாங்கள், \"அல்லாஹ்வின் தூதரே! பூமியில் அவன் (சுற்றித் திரியும்) வேகம் எப்படி இருக்கும்?\" என்று கேட்டோம். அதற்கு நபியவர்கள், \"பின்னாலிருந்து காற்று விரட்டிச் செல்லும் மேகம் போன்று (அவன் வேகமாக பூமியைச் சுற்றிவருவான்)\" என்றார்கள். மேலும், நபியவர்கள் கூறினார்கள்: அவன் ஒரு சமுதாயத்தாரிடம் வந்து (தன்னை இறைவன் என்று ஏற்றுக்கொள்ளுமாறு) அவர்களுக்கு அழைப்புவிடுப்பான். அவர்களும் அவன்மீது நம்பிக்கை கொண்டு அவனது அழைப்புக்குப் பதிலளிப்பார்கள். உடனே வானத்திற்கு (மழை பொழியுமாறு) அவன் கட்டளையிட, மழை பொழியும். பூமிக்கு(த்தாவரங்களை முளைக்கச் செய்யுமாறு) கட்டளையிட, அது முளையவைக்கும். (அவற்றை மேய்ந்து) அவர்களின் கால்நடைகள் ஏற்கெனவே இருந்ததைவிட நீண்ட திமில்களைக் கொண்டவையாகவும் மடி கனத்தவையாகவும் வயிறு நிரம்பியவையாகவும் மாலையில் (வீடு) திரும்பும். பின்னர், அவன் மற்றொரு சமுதாயத்தாரிடம் வந்து, (தன்னை இறைவன் என்று ஏற்றுக்கொள்ளுமாறு) அவர்களுக்கும் அழைப்பு விடுப்பான். ஆனால், அவனது அழைப்பை அவர்கள் நிராகரித்து விடுவார்கள். அவர்களிடமிருந்து அவன் திரும்பிச் சென்றுவிடுவான். அதனால், அவர்கள் பஞ்சத்தாலும் வறட்சியாலும் பாதிக்கப்பட்டவர்களாகக் காலைப்பொழுதை அடைவார்கள். அவர்களின் கைகளில் அவர்களின் செல்வம் ஏதும் (எஞ்சி) இராது. அவன் பாழடைந்த இடமொன்றைக் கடந்து செல்வான். அதைப் பார்த்து, \"உன்னிடம் இருக்கின்ற புதையல்களை வெளிப்படுத்து\" என்று கூறுவான். அப்போது (வெளிப்படும்) அந்தப் புதையல்கள், இராணித் தேனீக்களை (பின்பற்றிச் செல்லும் தேனீக்களை)ப் போன்று அவனைப் பின்தொடர்ந்து செல்லும். பின்னர், அவன் வாட்டசாட்டமான இளைஞர் ஒருவரை அழைத்து, அவரை வாளால் வெட்டி இரு துண்டுகளாக்கி,அம்பெய்யும் தூரத்திற்கு இடைவெளிவிட்டு (அவ்விரண்டையும்) போடுவான். பின்னர் அந்தச் சடலத்தை அழைப்பான். உடனே அந்த இளைஞர் முகம் ஒளிர சிரித்துக்கொண்டே எழுந்து வருவார். இதற்கிடையே, மர்யமின் மைந்தர் ஈசா (அலை) அவர்களை அல்லாஹ் (பூமிக்கு) அனுப்பி வைப்பான். அவர் (சிரியாவின் தலைநகர்) \"திமஷ்க்\" (டமாஸ்கஸ்) நகரின் கிழக்குப் பகுதியிலுள்ள வெள்ளைக் கோபுரத்திற்கு அருகில் இரு வானவர்களின் இறக்கைகள்மீது தம் கைகளை வைத்தவாறு இறங்குவார். அப்போது அவர் குங்குமப்பூ நிறத்தில் இரு ஆடைகளை அணிந்திருப்பார். அவர் தமது தலையைத் தாழ்த்தினால் நீர்த்துளி சொட்டும்; தலையை உயர்த்தினாலோ வெண்முத்தைப் போன்று நீர்த்துளி வழியும். அவரது மூச்சுக் காற்றைச் சுவாசிக்கும் (அதாவது அவரை நெருங்கும்) எந்தவோர் இறைமறுப்பாளனும் சாகாமல் இருக்கமாட்டான். அவர் விடும் மூச்சானது அவரது பார்வை எட்டும் தூரம்வரை செல்லும். பின்னர் ஈசா (அலை) அவர்கள் தஜ்ஜாலைத் தேடிச் செல்வார்கள். இறுதியில், (பாலஸ் தீனத்திலுள்ள) \"லுத்து\" எனும் நகரத்தின் தலைவாயிலருகே அவனைக் கண்டு, அவனைக் கொன்றொழிப்பார்கள். பின்னர் தஜ்ஜாலிடமிருந்து அல்லாஹ் காப்பாற்றிய ஒரு சமுதாயத்தார் மர்யமின் மைந்தர் ஈசா (அலை) அவர்களிடம் வருவார்கள். அவர்களின் முகங்களை(ப்பரிவோடு) அவர் தடவிக் கொடுத்துச் சொர்க்கத்தில் அவர்களுக்குக் கிடைக்கவிருக்கும் படித்தரங்கள் குறித்து அவர்களுக்குத் தெரிவிப்பார். இதற்கிடையே, ஈசா (அலை) அவர்களுக்கு அல்லாஹ், \"நான் என் அடியார்கள் சிலரை வெளி வரச் செய்துள்ளேன். அவர்களுடன் போரிட யாருக்கும் ஆற்றல் கிடையாது. எனவே, (முஸ்லிமான) என் அடியார்களை (சினாயிலுள்ள) \"தூர்\" மலைக்கு அழைத்துச் சென்று பாதுகாப்பாக வையுங்கள்\" என்று (வஹீ) அறிவிப்பான். பின்னர், அல்லாஹ் \"யஃஜூஜ்\" \"மஃஜூஜ்\" கூட்டத்தாரை அனுப்புவான். அவர்கள் ஒவ்வோர் உயரமான பகுதியிலிருந்தும் வேகமாக(க் கீழே இறங்கி) வருவார்கள். அவர்களில் முதல் அணியினர் (ஜோர்தானில் உள்ள) \"தபரிய்யா\" ஏரியைக் கடந்து செல்லும்போது, அதிலுள்ள மொத்த நீரையும் குடித்துவிடுவார்கள். அவர்களின் இறுதி அணியினர் அதைக் கடந்து செல்லும்போது. \"முன்னொரு காலத்தில் இந்த ஏரியில் தண்ணீர் இருந்திருக்கும்\" என்று பேசிக்கொள்வார்கள். பின்னர் இறைத்தூதர் ஈசா (அலை) அவர்களும் அவர்களுடன் இருப்போரும் (\"தூர்\" மலையில்) முற்றுகையிடப்படுவார்கள். அப்போது (ஏற்படும் பட்டினியால்) அவர்களில் ஒருவருக்குக் காளை மாட்டின் தலை கிடைப்பது, இன்று உங்களில் ஒருவருக்கு நூறு பொற்காசுகள் கிடைப்பதைவிடச் சிறந்ததாக இருக்கும். பின்னர் இறைத்தூதர் ஈசா (அலை) அவர்களும் அவர்களுடன் இருப்போரும் (அல்லாஹ்விடம் உதவி கேட்டுப்) பணிந்து வேண்டுவார்கள். அப்போது யஃஜூஜ், மஃஜூஜ் கூட்டத்தாரின் பிடரிகளில் புழுக்களை அல்லாஹ் அனுப்புவான். அதனால் அவர்கள் அனைவரும் ஒரே நேரத்தில் பலியாவார்கள். பின்னர் இறைத்தூதர் ஈசா (அலை) அவர்களும் அவர்களுடன் இருப்போரும் (மலையிலிருந்து) தரைக்கு இறங்கி வருவார்கள். அப்போது பூமியின் எந்தவொரு சாண் அளவு இடமும், யஃஜூஜ், மஃஜூஜ் கூட்டத்தாரின் (சடலங்களிலிருந்து வெளிவரும்) கொழுப்பாலும் துர்நாற்றத்தாலும் நிரம்பியிருப்பதையே காண்பார்கள். உடனே இறைத்தூதர் ஈசா (அலை) அவர்களும் அவர்களுடன் இருப்போரும் அல்லாஹ்விடம் (அவற்றை அகற்றக்கோரிப்) பணிந்து வேண்டுவார்கள். அப்போது அல்லாஹ் ஒட்டகங்களின் கழுத்துகளைப் போன்று (பெரியதாக உள்ள) பறவைகளை அனுப்புவான். அவை அந்தப் பிணங்களைத் தூக்கிச் சென்று அல்லாஹ் நாடிய இடத்தில் வீசியெறியும். பின்னர் அல்லாஹ் மழை பொழியச் செய்வான். அந்த மழை எந்த மண் வீட்டிலும், எந்த முடிவீட்டிலும் படாமல் இருக்காது. இறுதியில், பூமியைக் கழுவி, கண்ணாடி போன்று (சுத்தமாக) ஆக்கிவிடும். பின்னர் பூமிக்கு, \"நீ உன் கனி வர்க்கங்களை முளைக்கச் செய்வாயாக; உன்னிடமுள்ள வளங்களை மறுபடியும் தருவாயாக\" என்று உத்தரவு பிறப்பிக்கப்படும். அன்றைய நாளில் (எந்த அளவுக்கு வளம் கொழிக்குமெனில்), ஒரு குழுவினர் சேர்ந்து ஒரேயொரு மாதுளம் பழத்தை உண்பர். அதன் தொலி அவர்கள் அனைவருக்கும் நிழல் அளிக்கும். அவர்களுக்குப் பால் வளமும் கிட்டும். எந்த அளவுக்கென்றால், பால் தரும் ஓர் ஒட்டகம் ஒரு பெரும் கூட்டத்துக்கே போதுமானதாயிருக்கும். பால் தரும் பசுவொன்று ஒரு குலத்தாருக்கே போதுமானதாயிருக்கும். பால் தரும் ஆடொன்று உறவினர்கள் அடங்கிய ஒரு கூட்டத்திற்கே போதுமானதாயிருக்கும். இந்நிலையில், அல்லாஹ் தூய காற்று ஒன்றை அனுப்புவான். அது அவர்களின் அக்குள்களுக்குக் கீழே நுழைந்து அவர்களைப் பிடித்துக்கொள்ளும். இறைநம்பிக்கை கொண்ட ஒவ்வொரு முஸ்லிமின் உயிரையும் அது கைப்பற்றும். அதையடுத்து மக்களில் தீயவர்கள் (மட்டுமே பூமியில்) எஞ்சியிருப்பார்கள். அவர்கள் கழுதைகளைப் போன்று (வெட்ட வெளியில் வைத்துப் பகிரங்கமாக) உடலுறவு கொள்வார்கள். அவர்கள்மீதுதான் உலக முடிவு நாள் ஏற்படும். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 7374,
			"arabicnumber": "2937.02",
			"text": "மேற்கண்ட ஹதீஸ் வேறு இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"முன்பொரு காலத்தில் இங்கு நீர் இருந்திருக்கிறது\" என்பதற்குப் பிறகு, \"பின்னர் அவர்கள் பைத்துல் மக்திஸிலுள்ள மலையான \"ஜபலுல் கமர்\"வரை பயணம் மேற்கொள்வார்கள். அப்போது அவர்கள், \"பூமியிலுள்ளவர்கள் அனைவரையும் நாம் கொன்று விட்டோம். வாருங்கள்: வானத்திலுள்ளோரை நாம் கொல்வோம்\" என்று கூறியபடி தங்களுடைய அம்புகளை வானை நோக்கி எய்வார்கள். அப்போது அல்லாஹ் அவர்களுடைய அம்புகளை இரத்தம் தோய்த்து திருப்பியனுப்புவான்\" என்று கூடுதலாக இடம்பெற்றுள்ளது. அலீ பின் ஹுஜ்ர் (ரஹ்) அவர்களது அறிவிப்பில், \"நான் என் அடியார்கள் சிலரை (மலைகளிலிருந்து) இறக்கிவிட்டுள்ளேன். அவர்களுடன் போரிட யாருக்கும் ஆற்றல் கிடையாது என்று (அல்லாஹ் ஈசா (அலை) அவர்களிடம் அறிவிப்பான்\" என) இடம் பெற்றுள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 7375,
			"arabicnumber": "2938.01",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு நாள் தஜ்ஜாலைக் குறித்து நீண்ட ஹதீஸ் ஒன்றை அறிவித்தார்கள். (அவனைப் பற்றி) எங்களுக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அறிவித்தவற்றில் பின்வரும் தகவலும் அடங்கும்: மதீனாவின் பாதைகளில் நுழைவது தடை செய்யப்பட்டிருக்கும் நிலையில் தஜ்ஜால் வருவான். மதீனாவையடுத்து (சிரியா நாட்டுத்திசையில்) உள்ள உவர் நிலம் ஒன்றில் அவன் தங்குவான். அந்நாளில் \"மக்களிலேயே சிறந்தவரான ஒரு மனிதர்\" அல்லது \"மக்களிலேயே சிறந்தவர்களில் ஒரு மனிதர்\" அவனை நோக்கிப் புறப்பட்டுச் சென்று, \"எவனது செய்தியை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு முன்னறிவிப்புச் செய்தார்களோ அந்த தஜ்ஜால் நீதான் என்று நான் உறுதி கூறுகிறேன்\" என்று கூறுவார். அப்போது தஜ்ஜால், \"நான் இவனைக் கொன்றுவிட்டுப் பிறகு உயிராக்கிவிட்டால் அப்போதுமா (நான் இறைவன் எனும்) என் விஷயத்தில் சந்தேகம் கொள்வீர்கள்?\" என்று (மக்களிடம்) கேட்பான். மக்கள், \"இல்லை\" என்று பதிலளிப்பார்கள். உடனே அவன் அம்மனிதரைக் கொன்றுவிட்டு உயிர்ப்பித்துக் காட்டுவான். அந்த மனிதர் உயிர் பெற்றெழுந்ததும், \"அல்லாஹ்வின் மீதாணையாக! நான் இன்று உன்னை அறிந்து கொண்டதைவிட வேறெப்போதும் நன்றாக அறிந்துகொண்டதில்லை\" என்று சொல்வார். உடனே தஜ்ஜால் அந்த மனிதரைக் கொன்றுவிட விரும்புவான். ஆனால்,அவருக்கெதிராக அவனுக்கு அதிகாரம் வழங்கப்படாது. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அபூஇஸ்ஹாக் இப்ராஹீம் பின் சுஃப்யான் (ரஹ்) அவர்கள் கூறுகிறார்கள்: அந்த மனிதர் \"களிர்\" (அலை) அவர்கள்தான் என்று சொல்லப்படுகிறது. - மேற்கண்ட ஹதீஸ் அபூசயீத் அல்குத்ரீ (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 7376,
			"arabicnumber": "2938.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 7377,
			"arabicnumber": "2938.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 7378,
			"arabicnumber": "2939.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 7379,
			"arabicnumber": "2939.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 7380,
			"arabicnumber": "2939.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 7381,
			"arabicnumber": "2940.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 7382,
			"arabicnumber": "2940.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 7383,
			"arabicnumber": "2941.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 7384,
			"arabicnumber": "2941.02",
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து ஒரு ஹதீஸை மனனமிட்டேன். இதுவரை அதை நான் மறக்கவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பின்வருமாறு கூறியதை நான் கேட்டேன்: (மறுமை நாளின் அடையாளங்களில்) முதலாவதாக வெளிப்படும் அடையாளம், சூரியன் மேற்கிலிருந்து உதயமாவதும், (பூமியிலிருந்து) ஒரு (அதிசயப்) பிராணி முற்பகல் நேரத்தில் வெளிப்படுவதும் ஆகும். இவ்விரண்டில் எது முதலில் வெளிப்பட்டாலும் மற்றொன்றும் அதைத் தொடர்ந்து வெகுவிரைவில் வெளிப்பட்டுவிடும். - அபூஸுர்ஆ (ரஹ்) அவர்கள் கூறியதாவது: மதீனாவில் மர்வான் பின் அல்ஹகமுடன் முஸ்லிம்களில் மூன்றுபேர் அமர்ந்து, (மறுமை நாளின்) அடையாளங்கள் குறித்து மர்வான் கூறியதைக் கேட்டுக்கொண்டிருந்தனர். மர்வான், \"(மறுமை நாளின் அடையாளங்களில்) முதலாவது அடையாளம் தஜ்ஜால் வெளிப்படுவதாகும்\" என்று கூறினார். அப்போது அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள், \"(தஜ்ஜாலைப் பற்றி) எதையும் மர்வான் (எனக்குக்) கூறவில்லை. நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்தே (அதைப் பற்றிய) ஹதீஸை மனனமிட்டேன். இதுவரை அதை நான் மறக்கவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்\" என்று கூறியபடி மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே அறிவித்தார்கள். - மேற்கண்ட ஹதீஸ் அபூஸுர்ஆ (ரஹ்) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"மக்கள் மர்வான் பின் அல்ஹகம் அருகில் யுக முடிவு நாளைப் பற்றி பேசிக் கொண்டிருந்தனர். அப்போது அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள் என மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்று அறிவித்தார்கள். அதில் \"முற்பகல் நேரத்தில் (அந்தப் பிராணி வெளிப்படும்)\" எனும் குறிப்பு இல்லை. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 7385,
			"arabicnumber": "2941.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 7386,
			"arabicnumber": "2942.01",
			"text": "ஆமிர் பின் ஷராஹீல் அஷ்ஷஅபீ (ரஹ்) அவர்கள் கூறியதாவது: நான் ளஹ்ஹாக் பின் கைஸ் (ரலி) அவர்களின் சகோதரியும், முந்திய முஹாஜிர்களில் ஒருவருமான ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்களிடம், \"நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்ற ஹதீஸ் ஒன்றை எனக்கு அறிவியுங்கள். அது (நேரடியாக) நீங்கள் அல்லாஹ்வின் தூதரிடமிருந்து கேட்டதாக இருக்க வேண்டும். பிறர் மூலம் கேட்டதாக இருக்க வேண்டாம்\" என்று கேட்டேன். அப்போது ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்கள், \"நீங்கள் விரும்பினால் நிச்சயமாக அவ்வாறே செய்கிறேன்\" என்றார்கள். நான் \"ஆம் (அவ்வாறுதான் நான் விரும்புகிறேன்); எனக்கு ஹதீஸ் அறிவியுங்கள்\" என்றேன். ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்கள் கூறினார்கள்: நான் அன்றைய குறைஷி இளைஞர்களில் சிறந்தவர்களில் ஒருவரான முஃகீராவின் புதல்வருக்கு வாழ்க்கைப்பட்டிருந்தேன். அவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்த முதல் போரில் காயப்படுத்தப்பட்ட(வர் ஆவா)ர். (அவர் என்னை மணவிலக்குச் செய்து) நான் விதவையாயிருந்தபோது, என்னை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தோழர்களில் ஒரு குழுவினர் பெண் கேட்டார்கள். அவர்களில் அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்களும் ஒருவராவார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் தம்மால் விடுதலை செய்யப்பட்ட அடிமையின் புதல்வரான உசாமா பின் ஸைத் அவர்களுக்காக என்னைப் பெண் கேட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"என்னை நேசிப்பவர்,உசாமாவையும் நேசிக்கட்டும்\" என்று கூறிய செய்தியை நான் அறிந்திருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம் பேசியபோது, \"என் காரியம் உங்கள் கையில் உள்ளது. நீங்கள் நாடியவருக்கு என்னை மணமுடித்து வையுங்கள்\" என்று கூறினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீ உம்மு ஷரீக்கின் இல்லத்துக்குச் சென்று தங்கி இரு\" என்று சொன்னார்கள் - உம்மு ஷரீக் (ரலி) அவர்கள் அன்சாரிகளில் வசதி படைத்த பெண்மணியாகவும் அல்லாஹ்வின் பாதையில் பெருமளவில் செலவு செய்யக் கூடியவராகவும் இருந்தார். அவரது இல்லத்தில் விருந்தாளிகள் தங்குவார்கள்.- \"அவ்வாறே செய்கிறேன்\" என்று நான் கூறினேன். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(வேண்டாம்;) அப்படிச் செய்யாதே! உம்மு ஷரீக் ஏராளமான விருந்தாளிகளை உபசரிக்கும் ஒரு பெண்மணி ஆவார். உன் முகத்திரையோ உன் கணைக்காலிலிருந்து ஆடையோ விலகியிருக்க, நீ விரும்பாத சிலவற்றை மக்கள் பார்க்கும் நிலை ஏற்படுவதை நான் வெறுக்கிறேன். எனவே, நீ உன் தந்தையின் சகோதரரான (அம்ர் - உம்மு மக்தூம் தம்பதியரின் புதல்வரான) அப்துல்லாஹ் பின் அம்ர் பின் உம்மி மக்தூம் அவர்களின் இல்லத்துக்குச் சென்று தங்கியிரு\" என்று கூறினார்கள். (அப்துல்லாஹ் பின் அம்ர் பின் உம்மி மக்தூம் குறைஷிக் குலத்திலுள்ள பனூ ஃபிஹ்ர் கிளையைச் சேர்ந்தவர் ஆவார். அந்தக் குடும்பத்தில் ஒருவராக ஃபாத்திமா பின்த் கைஸ் இருந்தார்.) அவ்வாறே நான் அவரது இல்லத்திற்குச் சென்று தங்கினேன். என் காத்திருப்புக் காலம் (\"இத்தா\") முடிந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் பொது அறிவிப்பாளர்களில் ஒருவர், \"கூட்டுத் தொழுகைக்கு வாருங்கள்\" என்று அறிவிப்புச் செய்வதை நான் செவியுற்றேன். ஆகவே, நான் பள்ளிவாசலுக்குச் சென்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தொழுகையை நிறைவேற்றினேன். அப்போது நான் ஆண்களின் தொழுகை வரிசைக்குப் பின்னால் உள்ள பெண்களின் தொழுகை வரிசையில் இருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையை முடித்துச் சொற்பொழிவு மேடை (மிம்பர்)மீது சிரித்தபடியே அமர்ந்தார்கள். \"ஒவ்வொருவரும் தாம் தொழுத இடத்தில் அப்படியே இருங்கள்\" என்று கூறினார்கள். பிறகு, \"நான் உங்களை ஏன் ஒன்று கூட்டினேன் என்று உங்களுக்குத் தெரியுமா?\" என்று கேட்டார்கள். மக்கள், \"அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்\" என்று பதிலளித்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் மீதாணையாக! உங்களுக்கு ஆர்வமூட்டுவதற்கோ அச்சுறுத்துவதற்கோ நான் உங்களை ஒன்றுகூட்டவில்லை. மாறாக, (மற்றொரு தகவலைச் சொல்வதற்காகவே) உங்களை ஒன்றுகூட்டினேன். கிறித்தவ மதத்தைச் சேர்ந்த தமீமுத் தாரீ எனும் ஒரு மனிதர் (என்னிடம்) வந்து வாக்குறுதிப் பிரமாணம் அளித்து இஸ்லாத்தை ஏற்றுக்கொண்டார். அவர் என்னிடம் ஒரு செய்தியைச் சொன்னார். அது(பெருங்குழப்பவாதியான) மசீஹுத் தஜ்ஜால் குறித்து நான் உங்களிடம் தெரிவித்திருந்த செய்திக்கு ஒத்திருந்தது. அவர் என்னிடம் கூறினார்: நான் \"லக்ம்\" , \"ஜுதாம்\" ஆகிய குலங்களைச் சேர்ந்த முப்பது பேருடன் ஒரு கப்பலில் கடல் பயணம் மேற்கொண்டேன். அப்போது கடல் அலை ஒரு மாதகாலம் எங்களைக் கடலில் அலைக் கழித்துவிட்டது. பிறகு நாங்கள் கடலில் சூரியன் அஸ்தமிக்கும் (மேற்குத்) திசையில் ஒரு தீவில் ஒதுங்கினோம். பிறகு நாங்கள் சிறிய மரக்கலம் ஒன்றில் அமர்ந்து அங்கிருந்த தீவுக்குள் சென்றோம். அங்கு (உடல் முழுவதும் அடர்ந்த) முடிகள் நிறைந்த ஒரு பிராணி எங்களைச் சந்தித்தது. அதன் முன்பகுதி எது,பின்பகுதி எது என்றே எங்களால் அறிய முடியவில்லை. (உடல் முழுவதும்) முடிகள் நிறைந்திருந்ததே அதற்குக் காரணம். அப்போது நாங்கள், \"உனக்குக் கேடுதான். நீ யார்?\" என்று கேட்டோம். அதற்கு அந்தப் பிராணி \"நான்தான் ஜஸ்ஸாஸா\"என்று சொன்னது. \"ஜஸ்ஸாஸா என்றால் என்ன?\" என்று நாங்கள் கேட்டோம். அதற்கு அந்தப் பிராணி, \"கூட்டத்தாரே! இந்த மண்டபத்திற்கு உள்ளே இருக்கும் மனிதரை நோக்கிச் செல்லுங்கள். அவர் உங்களைப் பற்றிய செய்தி அறிய ஆவலாக உள்ளார்\" என்று சொன்னது. அந்தப் பிராணி ஒரு மனிதனைப் பற்றிக் குறிப்பிட்டதைக் கேட்டு அது ஷைத்தானாக இருக்குமோ என்று நாங்கள் பயந்துவிட்டோம். உடனே நாங்கள் அந்த மனிதனை நோக்கி விரைந்து நடந்தோம். நாங்கள் அந்த மண்டபத்தைச் சென்றடைந்தோம். அங்கு மாபெரும் உருவமுடைய மனிதன் ஒருவன் இருந்தான். அவனைப் போன்ற ஒரு படைப்பை நாங்கள் ஒருபோதும் கண்டதில்லை. அவன் சங்கிலியால் பிணைக்கப்பட்டிருந்தான். அவனுடைய கைகள் அவனது தோளோடு சேர்த்து வைத்து இறுகக்கட்டப்பட்டிருந்தன. அவனுடைய முழங்கால்கள் கணுக்கால்களோடு சேர்த்துச் சங்கிலியால் பிணைக்கப்பட்டிருந்தன. அவனிடம் நாங்கள், \"உனக்குக் கேடுதான். நீ யார்?\" என்று கேட்டோம். \"என்னைப் பற்றிய தகவலை நிச்சயம் நீங்கள் அறிந்துகொள்வீர்கள். (முதலில்) நீங்கள் யார் என்று கூறுங்கள்?\" என்று கேட்டான். \"நாங்கள் அரபு மக்கள். நாங்கள் கப்பலொன்றில் கடல் பயணம் மேற்கொண்டோம். கடல் கொந்தளிப்பு ஏற்பட்டு ஒரு மாதகாலமாகக் கடல் அலை எங்களை அலைக்கழித்துவிட்டது. பிறகு நீயிருக்கும் இந்தத் தீவில் நாங்கள் கரை ஒதுங்கினோம். பிறகு நாங்கள் சிறிய மரக்கலம் ஒன்றில் அமர்ந்து இந்தத் தீவுக்குள் நுழைந்தோம். அப்போது உடல் முழுவதும் அடர்ந்த முடிகள் கொண்ட பிராணி ஒன்று எங்களைச் சந்தித்தது. உடல் முழுவதும் முடிகள் நிறைந்திருந்த காரணத்தால் அதன் முன்பகுதி எது, பின்பகுதி எது என்று அறிய முடியவில்லை. நாங்கள் \"உனக்குக் கேடுதான். நீ யார்?\" என்று கேட்டோம். அது \"நான்தான் ஜஸ்ஸாஸா\" என்று சொன்னது. \"ஜஸ்ஸாஸா என்றால் என்ன?\" என்று கேட்டோம். அதற்கு அது, \"இந்த மண்டபத்திலுள்ள இந்த மனிதரை நோக்கிச் செல்லுங்கள். அவர் உங்களைப் பற்றிய செய்தியை அறிய பெரும் ஆவலுடன் இருக்கிறார்\" என்று கூறியது. ஆகவேதான், நாங்கள் உன்னை நோக்கி விரைந்து வந்தோம். அது ஷைத்தானாக இருக்கலாம் என்பதால் எங்களால் அச்சம் கொள்ளாமல் இருக்க முடியவில்லை\" என்று சொன்னோம். அப்போது அவன், \"பைசான் பேரீச்சந்தோட்டத்தைப் பற்றி எனக்குச் சொல்லுங்கள்\" என்றான். \"அந்தத் தோட்டத்தில் நீ எதைப் பற்றிக் கேட்கிறாய்?\" என்று கேட்டோம். அதற்கு அவன், \"அந்தப் பேரீச்சந்தோட்டத்தின் மரங்கள் கனிகள் தருகின்றனவா என்பதைப் பற்றியே நான் கேட்கிறேன்\" என்றான். நாங்கள் \"ஆம்\" என்று பதிலளித்தோம். அவன், \"அறிந்துகொள்ளுங்கள். அது கனியே தராத காலம் நெருங்கிக்கொண்டிருக்கிறது\" என்று கூறினான். பிறகு \"தபரிய்யா நீர்நிலை பற்றி எனக்குச் சொல்லுங்கள்\" என்று கேட்டான். \"அதில் எதைப் பற்றி நீ கேட்கிறாய்?\"என்று நாங்கள் கேட்டோம். அதற்கு அவன், \"அதில் தண்ணீர் இருக்கிறதா?\" என்று கேட்டான். நாங்கள், \"அதில் தண்ணீர் அதிகமாக இருக்கிறது\" என்று பதிலளித்தோம். அவன், \"அறிந்துகொள்ளுங்கள்: அதிலுள்ள நீர் வற்றும் காலம் நெருங்கிவிட்டது\" என்று சொன்னான். பிறகு, \"(ஷாம் நாட்டிலுள்ள) ஸுஃகர் நீரூற்றைப் பற்றி எனக்குச் சொல்லுங்கள்\" என்று கேட்டான். நாங்கள், \"அதில் எதைப் பற்றி நீ கேட்கிறாய்?\" என்றோம். அதற்கு அவன், \"அந்த ஊற்றில் தண்ணீர் உள்ளதா? அந்த ஊற்றுத் தண்ணீரால் மக்கள் பயிர் செய்கிறார்களா?\" என்று கேட்டான். நாங்கள் \"ஆம், அதில் தண்ணீர் அதிகமாக உள்ளது. அங்குள்ளவர்கள் அந்தத் தண்ணீரால் விவசாயம் செய்கிறார்கள்\" என்று சொன்னோம். பிறகு அவன், \"எழுத்தறிவற்ற மக்களின் இறைத்தூதர் பற்றி எனக்குச் சொல்லுங்கள். அவர் (இப்போது) என்ன செய்கிறார்?\" என்று கேட்டான். நாங்கள், \"அவர் மக்காவிலிருந்து புறப்பட்டுச் சென்று யஸ்ரிபில் (மதீனாவில்) தங்கியிருக்கிறார்\" என்று பதிலளித்தோம். அவன், \"அவருக்கும் அரபியருக்குமிடையே போர் நடந்ததா?\" என்று கேட்டான். நாங்கள், \"ஆம்\" என்றோம். அவன், \"அவர்களை அவர் என்ன செய்தார்?\" என்று கேட்டான். நாங்கள், \"அவர், தம் அருகிலுள்ள அரபியரை வெற்றி கொண்டுவிட்டார். அரபியர் அவருக்குக் கட்டுப்பட்டு விட்டனர்\" என்று சொன்னோம். அதற்கு அவன், \"அப்படித்தான் நடந்ததா?\" என்று கேட்டான். நாங்கள் \"ஆம்\" என்றோம். அவன், \"அறிந்துகொள்ளுங்கள். அவருக்குக் கட்டுப்பட்டு நடப்பதே அவர்களுக்கு நல்லதாகும். (இனி) நான் என்னைப் பற்றி உங்களுக்குச் சொல்கிறேன்: நான்தான் மசீஹ் (அத்தஜ்ஜால்) ஆவேன். நான் (இங்கிருந்து) புறப்பட அனுமதிக்கப்படும் நாள் நெருங்கிக்கொண்டிருக்கிறது. நான் புறப்பட்டு வந்து, நாற்பது நாட்களில் பூமியில் எந்த ஓர் ஊரையும் விட்டுவைக்காமல் பூமியெங்கும் பயணம் செய்வேன்; மக்காவையும் தைபாவையும் தவிர! அவ்விரண்டிற் குள்ளேயும் நுழைவது எனக்குத் தடை விதிக்கப்பட்டுள்ளது. அவ்விரு நகரங்களில் ஏதேனும் ஒன்றில் நுழைய நான் நாடும்போதெல்லாம் என்னை நோக்கி வானவர் ஒருவர் வருவார். அவரது கையில் உருவியவாள் இருக்கும். (அதை வைத்து) அதற்குள் நுழைய விடாமல் அவர் என்னைத் தடுத்துவிடுவார். அதன் ஒவ்வொரு நுழைவாயிலிலும் வானவர் ஒருவர் இருந்து, அதைக் காவல் காத்துக்கொண்டிருப்பார்\" என்று கூறினான். இதைக் கூறியபின் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தம்மிடமிருந்த கைத்தடியால் சொற்பொழிவு மேடைமீது குத்தியவாறு இது -அதாவது மதீனா நகரம்-தான் தைபா; இதுதான் தைபா; இதுதான் தைபா\" என்று கூறிவிட்டு, \"இதைப்பற்றி நான் உங்களுக்கு (முன்பே) அறிவித்துள்ளேன் அல்லவா?\" என்று கேட்டார்கள். மக்கள், \"ஆம் (அறிவித்தீர்கள்)\" என்று பதிலளித்தனர். \"தமீமுத் தாரீ சொன்ன இந்தச் செய்தி, தஜ்ஜாலைப் பற்றியும் மதீனா மற்றும் மக்கா பற்றியும் நான் ஏற்கெனவே உங்களிடம் நான் கூறியிருந்ததற்கு ஒப்பவே அமைந்திருக்கிறது\" என்று கூறினார்கள். பிறகு அறிந்துகொள்ளுங்கள்: அ(ந்தத் தீவான)து, ஷாம் நாட்டுக் கடலில், அல்லது யமன் நாட்டுக் கடலில் உள்ளது. இல்லை; அது கிழக்குப் பகுதிக் கடலில் உள்ளது. அது கிழக்குப் பகுதிக் கடலில் உள்ளது. அது கிழக்குப் பகுதி கடலில் உள்ளது\" என்று (அறுதியிட்டுச்) சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இதைக் கூறும்போது கிழக்குத் திசையை நோக்கி தமது கரத்தால் சைகை செய்தார்கள். ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்கள் கூறினார்கள்: இதை நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்தே மனனமிட்டேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 7387,
			"arabicnumber": "2942.02",
			"text": "ஷஅபீ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்களிடம் (அவர்களது இல்லத்திற்குச்) சென்றோம். அவர்கள் எங்களுக்கு \"ருதப் இப்னு தாப்\" எனப்படும் பேரீச்சம் பழங்களை அன்பளிப்பாக வழங்கினார்கள். தொலி இல்லாத கோதுமை மாவால் செய்யப்பட்ட ஒரு வகை பானத்தையும் அருந்தக் கொடுத்தார்கள். அப்போது அவர்களிடம் நான், \"மூன்று \"தலாக்\"கும் சொல்லப்பட்டு (தலாக்கை முடிவுக்குக் கொண்டுவரப்பட்டு)விட்ட பெண் எங்கே \"இத்தா\" இருப்பாள்?\" என்று கேட்டேன். அதற்கு அவர்கள் கூறினார்கள்: என் கணவர் என்னை மூன்று \"தலாக்\" சொல்லி (முற்றிலுமாக விடுவித்து)விட்டார். அப்போது நபி (ஸல்) அவர்கள் என்னை என் குடும்பத்தாரிடம் தங்கி \"இத்தா\" மேற்கொள்ள அனுமதியளித்தார்கள். அப்போது மக்களிடையே, \"கூட்டுத் தொழுகை நடைபெறப்போகிறது\" என்று அறிவிப்புச் செய்யப்பட்டது. அப்போது (பள்ளி வாசலை நோக்கி) நடந்துசென்றவர்களுடன் நானும் சென்று பெண்களின் வரிசையில் முதல் வரிசையில் இருந்தேன். அது ஆண்களின் வரிசையில் இறுதி வரிசைக்கு அடுத்திருந்தது. அப்போது நபி (ஸல்) அவர்கள் சொற்பொழிவு மேடை (மிம்பர்)மீதிருந்தபடி, \"தமீமுத் தாரியின் தந்தையின் சகோதரர் குலத்தைச் சேர்ந்த சிலர் கடல் பயணம் மேற்கொண்டனர்...\" என்று தொடங்கி மேற்கண்ட ஹதீஸில் உள்ளபடி அறிவித்தார்கள். இந்த அறிவிப்பில், \"அப்போது நபி (ஸல்) அவர்கள் தம்மிடமிருந்த கைத்தடியைப் பூமியை நோக்கிச் சாய்த்தவாறு, \"இதுதான் தைபா - அதாவது மதீனா\" என்று கூறியதை இப்போதும் நான் பார்ப்பதைப் போன்றுள்ளது\" என்று கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 7388,
			"arabicnumber": "2942.03",
			"text": "மேற்கண்ட ஹதீஸ் ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"தமீமுத் தாரீ அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, தாம் கடல் பயணம் மேற்கொண்டபோது (கடல் கொந்தளித்து அவர்களது) கப்பல் திசைமாறி ஒரு தீவில் ஒதுங்கியதாகவும், அப்போது (குடி)தண்ணீரைத் தேடியபடி அவர்கள் அந்தத் தீவுக்குள் போனதாகவும், அப்போது தமது முடியை இழுத்துக்கொண்டு வந்த ஒரு மனிதனைச் சந்தித்ததாகவும் கூறினார்கள்\" என்று இடம்பெற்றுள்ளது. மற்றவை மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. \"அந்த மனிதன், கவனியுங்கள்: எனக்குப் புறப்படுவதற்கு அனுமதியளிக்கப்படும்போது எல்லா ஊர்களிலும் என் பாதத்தைப் பதிப்பேன்; தைபா (எனும் மதீனா) தவிர\" என்று கூறினான் என்றும், \"அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமீமுத் தாரீ தம்மிடம் கூறியதை மக்களிடையே தெரிவித்துவிட்டு, இதுதான் தைபா; அவன்தான் தஜ்ஜால்\" என்று கூறியதாகவும் இடம்பெற்றுள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 7389,
			"arabicnumber": "2942.04",
			"text": "மேற்கண்ட ஹதீஸ் ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொற்பொழிவு மேடை (மிம்பர்) மீதமர்ந்து, மக்களே! தமீமுத் தாரீ என்னிடம், தம் சமுதாயத்தாரில் சிலர் தமக்குரிய கப்பலொன்றில் கடல் பயணம் மேற்கொண்டதாகவும், அப்போது கப்பல் உடைந்துவிட்டதாகவும், உடனே அவர்களில் சிலர் கப்பலில் இருந்த பலகைகளில் ஒன்றில் ஏறி கடலிலிருந்து ஒரு தீவுக்குச் சென்றதாகவும் தெரிவித்தார்\" என்று கூறியதாக ஹதீஸ் ஆரம்பிக்கிறது. தொடர்ந்து மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே காணப்படுகிறது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 7390,
			"arabicnumber": "2943.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள் மக்காவையும் மதீனாவையும் தவிர தஜ்ஜாலின் கால்படாத எந்த ஊரும் இராது. மதீனாவின் ஒவ்வொரு நுழைவாயிலிலும் வானவர்கள் அணிவகுத்து நின்று மதீனாவைப் பாதுகாப்பார்கள். ஆகவே, தஜ்ஜால் (மதீனாவுக்கு வெளியிலுள்ள) உவர் நிலத்தில் இறங்கித் தங்குவான். அப்போது மதீனா மூன்று முறை குலுங்கும். உடனே மதீனாவிலிருந்து ஒவ்வொரு இறைமறுப்பாளனும் நயவஞ்சகனும் அவனை நோக்கிப் புறப்பட்டுவருவார்கள். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"ஆகவே, தஜ்ஜால் \"அல்ஜுருஃப்\" எனும் இடத்திலுள்ள உவர் நிலத்திற்குச் சென்று, தனது கூடாரத்தை அமைப்பான். அப்போது ஒவ்வொரு நயவஞ்சகனும் நயவஞ்சகியும் அவனை நோக்கி (மதீனாவிற்குள்ளிருந்து) புறப்பட்டுவருவார்கள்\" என்று இடம் பெற்றுள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 7391,
			"arabicnumber": "2943.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 7392,
			"arabicnumber": "2944",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: தஜ்ஜாலைப் பின்தொடர்ந்து \"அஸ்பஹான்\" (ஈரான்) நாட்டைச் சேர்ந்த யூதர்களில் எழுபதாயிரம் பேர் வருவார்கள். அப்போது அவர்கள் \"தயாலிசா\" எனும் (கோடு போட்ட கெட்டியான) ஒரு வகை ஆடை அணிந்திருப்பார்கள். இதை அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 7393,
			"arabicnumber": "2945.01",
			"text": "உம்மு ஷரீக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், \"மக்கள் தஜ்ஜாலிடமிருந்து வெருண்டோடி மலைகளுக்குச் சென்றுவிடுவார்கள்\" என்று கூறக்கேட்டேன். அப்போது நான், \"அல்லாஹ்வின் தூதரே! (இறைவழியில் போராடும்) அரபியர் அப்போது எங்கே இருப்பார்கள்?\" என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், \"அப்போது அவர்கள் மிகக் குறைவான எண்ணிக்கையிலேயே இருப்பார்கள்\" என்று பதிலளித்தார்கள். - மேற்கண்ட ஹதீஸ் உம்மு ஷரீக் (ரலி) அவர்களிடமிருந்தே வேறு இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 7394,
			"arabicnumber": "2945.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 7395,
			"arabicnumber": "2946.01",
			"text": "அபுத்தஹ்மா (ரஹ்), அபூகத்தாதா (ரலி) உள்ளிட்ட ஒரு குழுவினர் கூறியதாவது: நாங்கள் ஹிஷாம் பின் ஆமிர் (ரலி) அவர்களைக் கடந்து இம்ரான் பின் ஹுஸைன் (ரலி) அவர்களிடம் செல்வோம். ஒரு நாள் ஹிஷாம் (ரலி) அவர்கள், \"நீங்கள் என்னைக் கடந்து சில மனிதரை நோக்கிச் செல்கிறீர்கள். அவர்கள் என்னைவிட அதிகமாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் அவையில் இருந்ததுமில்லை; என்னைவிட அதிகமாக அவர்களிடமிருந்து ஹதீஸ்களைச் செவியுற்றதுமில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(முதல் மனிதர்) ஆதம் (அலை) அவர்களைப் படைத்தது முதல் யுக முடிவுநாள் ஏற்படும்வரை தஜ்ஜாலைவிட (குழப்பத்தை ஏற்படுத்துகின்ற) மிகப் பெரும்படைப்பேதும் இல்லை\" என்று கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள். இதை ஹுமைத் பின் ஹிலால் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 7396,
			"arabicnumber": "2946.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 7397,
			"arabicnumber": "2947.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 7398,
			"arabicnumber": "2947.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 7399,
			"arabicnumber": "2947.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 7400,
			"arabicnumber": "2948.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 7401,
			"arabicnumber": "2948.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 7402,
			"arabicnumber": "2949",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 7403,
			"arabicnumber": "2950",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 7404,
			"arabicnumber": "2951.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 7405,
			"arabicnumber": "2951.02",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நானும் யுக முடிவு நாளும் இதோ இந்த (சுட்டு விரல், நடு விரல் ஆகிய) இரு விரல்களைப் போன்று (நெருக்கமாகவே) அனுப்பப்பட்டுள்ளோம்\" என்று கூறினார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான ஷுஅபா (ரஹ்) அவர்கள் கூறுகிறார்கள்: கத்தாதா (ரஹ்) அவர்கள் இந்த ஹதீஸை (எனக்கு) அறிவிக்கும்போது, \"(உயரத்தில் அவ்விரல்களில்) ஒன்றைவிட மற்றொன்று உயர்ந்திருப்பதைப் போன்று\" என்று கூறினார்கள். அதை அனஸ் (ரலி) அவர்கள் கூறியதாகத் தெரிவித்தார்களா, அல்லது தாமாகவே கூறினார்களா என்பது எனக்குத் தெரியவில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 7406,
			"arabicnumber": "2951.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 7407,
			"arabicnumber": "2951.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 7408,
			"arabicnumber": "2951.05",
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், தமது பெருவிரலுக்கு அடுத்த (சுட்டு) விரலையும் நடுவிரலையும் (இணைத்துக் காட்டி) சைகை செய்து, \"நானும் யுக முடிவு நாளும் இதோ இதைப் போன்று (நெருக்கமாகவே) அனுப்பப்பட்டுள்ளோம்\" என்று கூறியதைக் கேட்டேன். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 7409,
			"arabicnumber": "2952",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 7410,
			"arabicnumber": "2953.01",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நானும் யுக முடிவு நாளும் இவ்வாறு அனுப்பப் பட்டுள்ளோம்\" என்று கூறினார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான ஷுஅபா (ரஹ்) அவர்கள் இதை அறிவிக்கும் போது, தம் சுட்டு விரலையும் நடுவிரலையும் இணைத்து (இவ்வாறு என்று) சைகை செய்து காட்டினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 7411,
			"arabicnumber": "2953.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 7412,
			"arabicnumber": "2953.03",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: கிராமவாசிகள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வரும்போது யுக முடிவு நாளைப் பற்றி, \"அது எப்போது வரும்?\" என்று கேட்பார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அம்மக்களிலேயே வயதில் மிகச்சிறிய மனிதரைப் பார்த்து, \"இதோ இவர் உயிருடன் வாழ்ந்தால் இவர் முதுமையை அடையாமல் இருக்கும்போதே உங்களின் யுக முடிவு (இறப்பு) நாள் சம்பவிக்கும்\" என்று கூறுவார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 7413,
			"arabicnumber": "2954",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், \"யுக முடிவு நாள் எப்போது வரும்?\" என்று கேட்டார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு அருகில் \"முஹம்மத்\" எனப்படும் அன்சாரி சிறுவர் ஒருவர் இருந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அந்தச் சிறுவரைக் காட்டி), \"இந்தச் சிறுவர் உயிருடன் வாழ்ந்து, அவருக்கு முதுமைப்பருவம் ஏற்படாமலிருக்கும் நிலையில் யுக முடிவு நாள் வரலாம்\" என்று கூறினார்கள். அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 7414,
			"arabicnumber": "2955.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 7415,
			"arabicnumber": "2955.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 7416,
			"arabicnumber": "2955.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 177
			}
		}
	]
}