{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"56": "The Book of Commentary on the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7523,
			"arabicnumber": "3015",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7524,
			"arabicnumber": "3016",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7525,
			"arabicnumber": "3017.01",
			"text": "தாரிக் பின் ஷிஹாப் (ரஹ்) அவர்கள் கூறியதாவது: யூதர்கள் (கலீஃபா) உமர் (ரலி) அவர்களிடம், \"நீங்கள் ஓர் இறைவசனத்தை ஓதுகிறீர்கள். அந்த வசனம் மட்டும் எங்களிடையே அருளப்பெற்றிருந்தால் அந்நாளை நாங்கள் பண்டிகை நாளாக ஆக்கியிருப்போம்\" என்று கூறினர். உமர் (ரலி) அவர்கள், \"அ(ந்த வசனமான)து, எந்த இடத்தில் அருளப்பெற்றது? எந்த நாளில் அருளப்பெற்றது? அது அருளப்பெற்றபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்கேயிருந்தார்கள் என்பதையெல்லாம் நான் அறிவேன். அது \"அரஃபா\" நாளில் அருளப்பெற்றது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அரஃபா பெருவெளியில் நின்று கொண்டிருந்தார்கள்\" என்று கூறினார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான சுஃப்யான் அஸ்ஸவ்ரீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: \"இன்று உங்களது மார்க்கத்தை உங்களுக்காக நான் முழுமையாக்கிவிட்டேன். எனது அருட்கொடையை உங்கள்மீது நிறைவாக்கிவிட்டேன்\" (5:3) எனும் இறைவசனம் அருளப்பெற்ற நாள் (சிலரது அறிவிப்பிலுள்ளதைப் போன்று) வெள்ளிக்கிழமையாக இருந்ததா, அல்லது இல்லையா என நான் (தீர்மானிக்க முடியாமல்) சந்தேகப்படுகிறேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7526,
			"arabicnumber": "3017.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7527,
			"arabicnumber": "3017.03",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7528,
			"arabicnumber": "3018.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7529,
			"arabicnumber": "3018.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7530,
			"arabicnumber": "3018.03",
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: \"அநாதை(ப் பெண்களிடம் நேர்மையாக நடக்க இயலாது என நீங்கள் அஞ்சினால்...\" (4:3) எனும் வசனம் தொடர்பாக ஆயிஷா (ரலி) அவர்கள் பின்வருமாறு விளக்கமளித்தார்கள்: இந்த வசனம், தம்மிடமுள்ள செல்வமுடைய அநாதைப் பெண்ணுக்குத் தாமே காப்பாளராகவும் வாரிசாகவும் இருந்துவரும் மனிதர் தொடர்பாக அருளப்பெற்றது. அவளுக்காக வாதாட அவளைத் தவிர வேறெவரும் இல்லை எனும் நிலையில் அவள் இருப்பாள்.அவளது செல்வத்தைத் தக்கவைத்துக் கொள்வதற்காக அவளை அவர் மணமுடித்துக் கொடுக்காமலிருப்பார். இதன் மூலம் அவளுக்கு அவர் இன்னல் ஏற்படுத்தி, உறவையும் கெடுத்துவைத்திருப்பார். ஆகவேதான், அநாதைப் பெண்(களை மணந்துகொண்டு அவர்)கள் விஷயத்தில் நேர்மையாக நடக்கமாட்டீர்கள் என்று நீங்கள் அஞ்சினால் உங்களுக்குப் பிடித்த (அதாவது உங்களுக்கு நான் அனுமதித்துள்ள) பெண்களை மணந்துகொள்ளுங்கள். நீங்கள் இன்னல் விளைவிக்கும் இந்த அநாதைப் பெண்களை விட்டுவிடுங்கள் என்று அல்லாஹ் கூறினான். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7531,
			"arabicnumber": "3018.04",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7532,
			"arabicnumber": "3018.05",
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்கள், \"(நபியே!) பெண்கள் தொடர்பாக அவர்கள் உம்மிடம் மார்க்கத் தீர்ப்பு கேட்கின்றனர்...\" (4:127)எனும் இறைவசனத்துக்கு விளக்கமளிக்கையில் பின்வருமாறு கூறினார்கள்: இந்த வசனம் ஓர் அநாதைப் பெண்ணைப் பற்றியதாகும். அவள் ஒரு மனிதரின் பொறுப்பில் இருந்துவருவாள். அவள் அவருடைய பேரீச்சமரங்கள் உள்ளிட்ட செல்வங்களில் பங்காளியாகக் கூட இருக்கக்கூடும். இந்நிலையில் அவளை அவரே மணமுடித்துக்கொள்ள விரும்புவார்.- மேலும், அவளை வேறோர் ஆணுக்கு மணமுடித்துக் கொடுத்து அவ(ளுக்குக் கணவனாக வருகின்றவ)னும் தமது சொத்தில் பங்காளியாக மாறுவதை அவர் வெறுப்பார். எனவே, (எவரையும் மணக்க விடாமல்) அவளை அக்காப்பாளர் முடக்கி வைத்துவந்தார். (அப்போது தான் மேற்கண்ட வசனம் அருளப்பெற்றது.) அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7533,
			"arabicnumber": "3019.01",
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்கள், \"ஏழையாக இருப்பவர் நியாயமாக உண்ணட்டும்\" (4:6) எனும் இறை வசனத்துக்குப் பின்வருமாறு விளக்கமளித்தார்கள்: இந்த வசனம் அநாதைகளை நிர்வகித்து, அவர்களின் செல்வத்தைப் பராமரிக்கும் காப்பாளர்கள் தொடர்பாக அருளப்பெற்றது. அவர் ஏழையாக இருந்தால், (தமது உழைப்புக்கான கூலியாக நியாயமான முறையில்) அநாதைகளின் பொருளை அனுபவிக்கலாம். அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7534,
			"arabicnumber": "3019.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7535,
			"arabicnumber": "3019.03",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7536,
			"arabicnumber": "3020",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7537,
			"arabicnumber": "3021.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: \"ஒரு பெண் தன் கணவனிடமிருந்து ஏற்படும் பிணக்கை, அல்லது புறக்கணிப்பைப் பற்றி அஞ்சினால்...\" (4:128) எனும் இறைவசனம், ஒரு பெண் விஷயத்தில் அருளப்பெற்றது. அவள் ஒரு கணவனின் உறவில் நீண்ட காலம் இருந்துவருவாள். பின்னர் (முதுமை போன்ற காரணத்தால்) அவளை அவர் விவாகரத்துச் செய்து(விட்டு மற்றொருத்தியை மணந்து) கொள்ள விரும்புவார். இந்நிலையில் அவள், \"என்னை மணவிலக்குச் செய்யாதீர்கள். என்னை (உங்கள் மனைவியாகவே) இருக்க விடுங்கள். என் (தாம்பத்திய உரிமைகள்) விஷயத்தில் நான் விட்டுக் கொடுத்து விடுகிறேன்\" என்று கூறுவாள். அப்போதுதான் இந்த வசனம் அருளப்பெற்றது. அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7538,
			"arabicnumber": "3021.02",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: \"ஒரு பெண் தன் கணவனிடமிருந்து ஏற்படும் பிணக்கை, அல்லது புறக்கணிப்பைப் பற்றி அஞ்சினால்...\" (4:128) எனும் இறை வசனம், ஒரு பெண் தொடர்பாக அருளப்பெற்றது. அவள் ஒருவரின் துணைவியாக இருந்துவருவாள். அவளிடம் உறவும் (தனது) குழந்தையும் இருந்துவரும்.- இந்நிலையில் (முதுமை நோய் போன்ற காரணங்களால்) அவளிடம் கணவர் (தாம்பத்திய உறவுக்காக) அதிகமாக வந்துபோகாமல் இருக்கலாம். இந்நிலையில், அவர் தன்னை மண விலக்குச் செய்துவிடுவதை விரும்பாமல் அவள், \"என் (தாம்பத்திய உரிமைகள்) விஷயத்தில் உங்களுக்கு விட்டுக் கொடுத்துவிடுகிறேன்\" என்று கூறிவிடுவாள். (இவ்வாறு விட்டுக் கொடுத்து சமரசம் செய்துகொள்வதில் தவறில்லை என இவ்வசனம் கூறுகின்றது.) அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7539,
			"arabicnumber": "3022.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7540,
			"arabicnumber": "3022.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7541,
			"arabicnumber": "3023.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7542,
			"arabicnumber": "3023.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7543,
			"arabicnumber": "3023.03",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7544,
			"arabicnumber": "3023.04",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7545,
			"arabicnumber": "3023.05",
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம், \"இறைநம்பிக்கையாளரைத் திட்டமிட்டே கொலை செய்தவனுக்குப் பாவமன்னிப்புக் கிடைக்குமா?\" என்று கேட்டேன். அவர்கள், \"பாவமன்னிப்புக் கிடையாது\" என்று சொன்னார்கள். உடனே நான் அவர்களுக்கு \"அல்ஃபுர்கான்\" (எனும் 25ஆவது) அத்தியாயத்திலுள்ள (68,69 ஆகிய) வசனங்களை ஓதிக்காட்டினேன். அதற்கு அவர்கள், \"இது மக்காவில் அருளப்பெற்ற வசனமாகும். இதை மதீனாவில் அருளப்பெற்ற மற்றொரு வசனம் மாற்றிவிட்டது என்று கூறிவிட்டு, \"ஓர் இறை நம்பிக்கையாளரைத் திட்டமிட்டே கொலை செய்தவனுக்கு நரகம்தான் தண்டனை. அதில் அவன் நிரந்தரமாக இருப்பான்\" (4:93) எனும் இறைவசனமே அது என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7546,
			"arabicnumber": "3024.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7547,
			"arabicnumber": "3024.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7548,
			"arabicnumber": "3025",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7549,
			"arabicnumber": "3026",
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: (அறியாமைக் காலத்தில்) அன்சாரிகள் \"ஹஜ்\" செய்(ய \"இஹ்ராம்\" கட்டி முடித்)துவிட்டு, மீண்டும் (வீட்டுக்கு) வருவதானால், வீடுகளில் அதன் (முன்பக்க வாசல் வழியாக நுழையாமல்) பின்பக்க வாசல் வழியேதான் நுழைவார்கள்.இந்நிலையில் அன்சாரிகளில் ஒருவர் தமது (வீட்டின்) முன்வாசல் வழியாகவே நுழைந்துவிட்டார். இது குறித்து அவரிடம் (ஆட்சேபணை) கூறப்பட்டது. அப்போதுதான், \"நீங்கள் வீடுகளுக்குள் அவற்றின் பின்புற வழியாக வருவது புண்ணியமன்று\" (2:189) எனும் இறைவசனத்தொடர் அருளப்பெற்றது. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7550,
			"arabicnumber": "3027",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7551,
			"arabicnumber": "3028",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: (அறியாமைக் காலப்) பெண்கள் இறையில்லம் கஅபாவை நிர்வாணமாகச் சுற்றி (தவாஃப்) வருவார்கள். அப்போது அவர்கள், \"தவாஃப் ஆடையை இரவல் தருபவர் யார்?\" என்று கூறி, (அதைப் பெற்று) தமது இன உறுப்பின் மீது வைத்துக்கொண்டு, பின்வருமாறு பாடுவார்கள்: \"இன உறுப்பில் சிறிதளவோ முழுவதுமோ வெளிப்படுகிறது இந்நாள். இதை எவரும் பார்க்க அனுமதிக்க முடியாது என்னால்\". எனவேதான், \"நீங்கள் தொழுமிடங்கள் ஒவ்வொன்றிலும் உங்களது அலங்காரத்தை மேற்கொள்ளுங்கள்\" (7:31) எனும் வசனம் அருளப்பெற்றது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7552,
			"arabicnumber": "3029.01",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: (நயவஞ்சகர்களின் தலைவன்) அப்துல் லாஹ் பின் உபை பின் சலூல், தன் அடிமைப் பெண்ணிடம், \"நீ சென்று விபசாரத்தில் ஈடுபட்டு எதையேனும் ஈட்டி வா\" என்று சொன்னான். அப்போதுதான் வல்லமையும் மாண்பும் மிக்க அல்லாஹ், \"கற்பொழுக்கம் நாடும் உங்கள் பெண்களை இவ்வுலக வாழ்க்கையின் சாதனங்களைப் பெறுவதற்காக விபசாரத்துக்கு நிர்பந்திக்காதீர்கள். யாரேனும் அவர்களை நிர்பந்தித்தால் நிர்பந்திக்கப்பட்ட அப்பெண்களை அல்லாஹ் மன்னிப்பவன்; நிகரற்ற அன்புடையோன்\" (24:33) எனும் வசனத்தை அருளினான். - இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7553,
			"arabicnumber": "3029.02",
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: (நயவஞ்சகர்களின் தலைவன்) அப்துல்லாஹ் பின் உபை பின் சலூலிடம் \"முசைக்கா\", \"உமைமா\" எனப்படும் இரு அடிமைப் பெண்கள் இருந்தனர். அவன் அவ்விருவரையும் நிர்பந்தித்து விபசாரத்தில் ஈடுபடுத்திவந்தான். அவ்விரு (அடிமைப்) பெண்களும் நபி (ஸல்) அவர்களிடம் (வந்து) அதைப் பற்றி முறையிட்டனர். அப்போதுதான், \"உங்கள் பெண்களை விபசாரத்திற்கு நிர்பந்திக்காதீர்கள்\" என்று தொடங்கி, \"மன்னிப்பவன்; நிகரற்ற அன்புடையோன்\" (24:33)என்பது வரை அல்லாஹ் அருளினான். அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7554,
			"arabicnumber": "3030.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7556,
			"arabicnumber": "3030.04",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7558,
			"arabicnumber": "3031",
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம், \"அத்தவ்பா\" எனும் (9ஆவது) அத்தியாயம் தொடர்பாகக் கேட்டேன். அவர்கள் \"தவ்பா அத்தியாயமா? அது (நயவஞ்சகர்களை) அம்பலப்படுத்தக்கூடிய அத்தியாயமாகும். அவர்களில் இத்தகையோர் உள்ளனர்; அவர்களில் இத்தகையோர் உள்ளனர் என (நயவஞ்சகர்களிலுள்ள எல்லாப் பிரிவினரையும் இனங்காட்டி) இவ்வத்தியாயம் இறங்கிக் கொண்டேயிருந்தது. எந்த அளவுக்கென்றால், தம்மில் ஒருவரைக்கூட விட்டுவைக்காமல் அனைவர் பற்றியும் அதில் குறிப்பிடப்பட்டுவிட்டது என நயவஞ்சகர்கள் எண்ணினார்கள்\" என்று கூறினார்கள். நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் \"அல்அன்ஃபால்\" எனும் (8ஆவது) அத்தியாயம் குறித்துக் கேட்டேன். அவர்கள் \"அது பத்ருப்போர் (பற்றிப்பேசும்) அத்தியாயமாகும்\" என்றார்கள். நான் \"அல்ஹஷ்ர்\" எனும் (59ஆவது) அத்தியாயம் குறித்துக் கேட்டேன். அவர்கள், \"அது பனூநளீர் (யூதக்) குலத்தார் குறித்து அருளப் பட்டதாகும்\" என்று பதிலளித்தார்கள். அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7559,
			"arabicnumber": "3032.01",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறிய தாவது: (என் தந்தை, கலீஃபா) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது சொற்பொழிவு மேடை (மிம்பர்)மீதிருந்தபடி பின்வருமாறு கூறியதை நான் கேட்டேன்: இறைவாழ்த்துக்குப்பின்! மக்களே! மது ஐந்துவகைப் பொருட்களால் தயாரிக்கப்பட்டு வந்த நிலையில் மதுபானத் தடை(ச் சட்டம் நடைமுறைக்கு) வந்தது. திராட்சைப் பழம், பேரீச்சம் பழம், தேன், தொலி நீக்கப்பட்ட கோதுமை, தொலி நீக்கப்படாத கோதுமை ஆகியவையே அப்பொருட்களாகும். (ஆயினும்) அறிவுக்குத் திரையிடக்கூடிய அனைத்தும் மதுவாகும். மக்களே! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மூன்று விஷயங்கள் குறித்துத் தெளிவானதொரு முடிவை நமக்கு எடுத்துரைத்திருந்தால், நாம் தெளிவு பெற்றிருப்போம் என்று நான் விரும்பியதுண்டு. 1. பாட்டனார். (அதாவது ஒருவருடைய சொத்தில் அவருக்குப் பெற்றோரோ மக்களோ இல்லாமல் சகோதரன் இருக்கும்போது பாட்டனாருக்கு எவ்வளவு பங்கு?) 2. \"கலாலா\" (என்றால் என்ன?) 3. வட்டியின் சில வகைகள் குறித்த சட்டம். - மேற்கண்ட ஹதீஸ் இப்னு உமர் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் இஸ்மாயீல் பின் உலய்யா (ரஹ்) அவர்களது அறிவிப்பில், (மது தயாரிக்கப்படும் பொருட்களில் ஒன்றாக) \"திராட்சை\" என்பது இடம்பெற்றுள்ளது; மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்று. ஈசா பின் யூனுஸ் (ரஹ்) அவர்களது அறிவிப்பில் மற்றொரு ஹதீஸில் இடம் பெற்றுள்ளதைப் போன்று \"உலர்ந்த திராட்சை\" என்று காணப்படுகிறது. அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7560,
			"arabicnumber": "3032.02",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை, கலீஃபா) உமர் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது சொற்பொழிவு மேடை (மிம்பர்) மீதிருந்தபடி உரை நிகழ்த்தினார்கள். அப்போது அல்லாஹ்வைப் போற்றிப் புகழ்ந்துவிட்டுப் பின்வருமாறு கூறினார்கள்: இறைவாழ்த்துக்குப்பின்! கவனத்தில் கொள்ளுங்கள்! மது ஐந்து வகைப் பொருட்களால் தயாரிக்கப்பட்டுவந்த நிலையில் மதுபானத் தடை(ச் சட்டம் நடைமுறைக்கு) வந்தது. தொலி நீக்கப்பட்ட கோதுமை, தொலி நீக்கப்படாத கோதுமை,பேரீச்சம் பழம், உலர்ந்த திராட்சை, தேன் ஆகியவையே அந்தப் பொருட்கள் ஆகும். (ஆயினும்,) அறிவுக்குத் திரையிடக்கூடிய அனைத்தும் மதுவாகும். மக்களே! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மூன்று விஷயங்கள் குறித்துத் தெளிவானதொரு முடிவை நமக்கு எடுத்துரைத்துவிட்டு நம்மைப் பிரிந்திருந்தால் நன்றாயிருந்திருக்கும் என நான் விரும்பியதுண்டு: 1. ஒருவரின் சொத்தில் (அவருக்குப் பெற்றோரோ மக்களோ இல்லாமல் சகோதரன் இருக்கும் போது) அவருடைய பாட்டனாருக்கு எவ்வளவு பங்கு கிடைக்கும்? 2. \"கலாலா\" என்றால் என்ன? 3. வட்டியின் சில வகைகள் குறித்த சட்டம். அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7561,
			"arabicnumber": "3032.03",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7562,
			"arabicnumber": "3033.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7563,
			"arabicnumber": "3033.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 40
			}
		}
	]
}