{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1570,
			"arabicnumber": "685.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": "685.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": "685.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": "686.01",
			"text": "யஅலா பின் உமய்யா (ரலி) அவர்கள் கூறியதாவது: நான் உமர் பின் அல்கத்தாப் (ரலி) அவர்களிடம் \"நீங்கள் பூமியில் பயணம் செய்தால், இறைமறுப்பாளர்கள் உங்களைத் துன்புறுத்துவார்கள் என நீங்கள் அஞ்சும்போது, தொழுகையைச் சுருக்கித் தொழுவதில் உங்கள்மீது தவறேதுமில்லை\" (4:101)என்றுதானே அல்லாஹ் கூறுகின்றான்! தற்போது மக்களுக்குப் பாதுகாப்பு ஏற்பட்டுவிட்டதே? என்று கேட்டேன். அதற்கு உமர் (ரலி) அவர்கள் (பின்வருமாறு) கூறினார்கள்: உங்களுக்கு ஏற்பட்ட வியப்பு(ம் ஐயமும்) எனக்கும் ஏற்பட்டது. எனவே, இது குறித்து நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வினவினேன். அப்போது \"(இது) அல்லாஹ் உங்களுக்கு வழங்கிய கொடை (சலுகை) ஆகும். அவனது கொடையை ஏற்றுக்கொள்ளுங்கள்\" என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பதிலளித்தார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": "686.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": "687.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": "687.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": "688.01",
			"text": "மூசா பின் சலமா அல்ஹுதலீ (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம், \"(வெளியூர்வாசியான) நான் மக்காவில் இருக்கும் போது இமாமுடன் தொழாமல் (தனித்துத் தொழுபவனாக) இருந்தால் எவ்வாறு தொழவேண்டும்?\" என்று கேட்டேன். அதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள், \"அபுல்காசிம் (முஹம்மத்-ஸல்) அவர்களின் வழிமுறைப்படி இரண்டு ரக்அத்களாக (தொழுது கொள்ளுங்கள்)\" என்று பதிலளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": "688.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": "689.01",
			"text": "ஹஃப்ஸ் பின் ஆஸிம் பின் உமர் பின் அல்கத்தாப் (ரஹ்) அவர்கள் கூறியதாவது: நான் (ஒரு பயணத்தில் என் தந்தையின் சகோதரர்) இப்னு உமர் (ரலி) அவர்களுடன் மக்கா செல்லும் பாதையில் இருந்தேன். அப்போது இப்னு உமர் (ரலி) அவர்கள் லுஹ்ர் தொழுகையை எங்களுக்கு இரண்டு ரக்அத்களாகத் தொழுவித்தார்கள். பிறகு தமது ஓய்விடம் நோக்கிச் சென்றார்கள். நாங்களும் அவர்களுடன் சென்றோம்; அவர்கள் அமர்ந்தபோது அவர்களுடன் நாங்களும் அமர்ந்தோம். அப்போது தாம் தொழுதுவிட்டு வந்த இடத்தைத் தற்செயலாகத் திரும்பிப் பார்த்தார்கள். அங்கு சிலர் நின்றுகொண்டிருந்தனர். உடனே, \"இவர்கள் என்ன செய்கிறார்கள்?\" என்று கேட்டார்கள். \"கூடுதலான தொழுகைகளைத் தொழுதுகொண்டிருக்கிறார்கள்\" என்று நான் பதிலளித்தேன். இப்னு உமர் (ரலி) அவர்கள், \"(பயணத்தில்) கூடுதலான தொழுகைகளை நான் தொழுபவனாக இருந்தால் எனது (கடமையான) தொழுகையை முழுமைப்படுத்தியிருப்பேன். என் சகோதரர் (ஆஸிமின்) மகனே! நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் பயணத்தில் இருந்திருக்கிறேன். அவர்கள் பயணத்தின்போது (கடமையான) இரண்டு ரக்அத்களைவிடக் கூடுதலாக (வேறெந்த முன், பின் சுன்னத்களையும்) தொழமாட்டார்கள். அவர்களது உயிரை அல்லாஹ் கைப்பற்றும் வரை (அவ்வாறே செய்தார்கள்). நான் அபூபக்ர் (ரலி) அவர்களுடனும் இருந்திருக்கிறேன். (பயணத்தில்) அவர்களும் இரண்டு ரக்அத்களைவிடக் கூடுதலாகத் தொழமாட்டார்கள். அவர்களது உயிரை அல்லாஹ் கைப்பற்றும்வரை (அவ்வாறே செய்தார்கள்). நான் உமர் (ரலி) அவர்களுடனும் இருந்திருக்கிறேன். அவர்களும் இரண்டு ரக்அத்களைவிடக் கூடுதலாகத் தொழமாட்டார்கள். அவர்களின் உயிரை அல்லாஹ் கைப்பற்றும்வரை (அவ்வாறே செய்தார்கள்). பிறகு நான் உஸ்மான் (ரலி) அவர்களுடனும் இருந்திருக்கிறேன். அவர்களும் இரண்டு ரக்அத்களைவிடக் கூடுதலாகத் தொழுததில்லை. அவரகளின் உயிரை அல்லாஹ் கைப்பற்றும் வரை (அவ்வாறே செய்தார்கள்).அல்லாஹ்வோ, \"அல்லாஹ்வின் தூதரிடம் உங்களுக்கோர் அழகிய முன்மாதிரி இருக்கிறது\" (33:21) என்று கூறுகின்றான்\" என்றார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": "689.02",
			"text": "ஹஃப்ஸ் பின் ஆஸிம் (ரஹ்) அவர்கள் கூறியதாவது: நான் கடுமையாக நோய்வாய்ப்பட்டிருந்தபோது என்னை உடல்நலம் விசாரிப்பதற்காக (என் தந்தையின் சகோதரர்) இப்னு உமர் (ரலி) அவர்கள் வந்தார்கள். அவர்களிடம் நான் பயணத்தில் (முன் பின் சுன்னத்களான) கூடுதல் தொழுகைகள் தொழுவது பற்றிக் கேட்டேன். அதற்கு அவர்கள், \"நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் இருந்திருக்கிறேன். அவர்கள் (இந்தக்) கூடுதலான தொழுகைகள் தொழுவதை நான் பார்த்ததேயில்லை. நான் (பயணத்தில்) உபரியான தொழுகைகளைத் தொழுபவனாயிருந்தால் (கடமையான தொழுகையையே) முழுமைப்படுத்தியிருப்பேன். உயர்ந்தோன் அல்லாஹ்வோ, \"அல்லாஹ்வின் தூதரிடம் உங்களுக்கோர் அழகிய முன்மாதிரி இருக்கிறது\" (33:21) என்று கூறுகின்றான்\" என்றார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": "690.01",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவில் நான்கு ரக்அத்கள் லுஹர் தொழுதார்கள்; (மக்காவுக்குச் செல்லும் வழியில்) துல்ஹுலைஃபாவில் இரண்டு ரக்அத்கள் அஸ்ர் தொழுதார்கள். - இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": "690.02",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் மதீனாவில் நான்கு ரக்அத்கள் லுஹ்ர் தொழுதேன்; (மக்காவுக்குச் செல்லும் வழியில்) துல்ஹுலைஃபாவில் அவர்களுடன் இரண்டு ரக்அத்கள் அஸ்ர் தொழுதேன்.- இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": "691",
			"text": "யஹ்யா பின் யஸீத் அல்ஹுனாயீ (ரஹ்) அவர்கள் கூறியதாவது: நான் அனஸ் பின் மாலிக் (ரலி) அவர்களிடம் தொழுகையைச் சுருக்கித் தொழுவது பற்றிக் கேட்டேன். அதற்கு அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"மூன்று மைல்\" அல்லது \"மூன்று ஃபர்ஸக்\" தொலைதூரத்திற்குப் பயணம் புறப்பட்டால் (நான்கு ரக்அத்கள் கொண்ட தொழுகைகளை) இரண்டு ரக்அத்களாகவே தொழுதார்கள்\" என்று பதிலளித்தார்கள். இந்த இடத்தில் அறிவிப்பாளர்களில் ஒருவரான ஷுஅபா (ரஹ்) அவர்களே (\"மூன்று மைல்கள்\" அல்லது \"மூன்று ஃபர்ஸக்\" என) ஐயப்பாட்டுடன் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": "692.01",
			"text": "ஜுபைர் பின் நுஃபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஷுரஹ்பீல் பின் அஸ்ஸிம்த் (ரஹ்) அவர்களுடன் பதினேழு அல்லது பதினெட்டு மைல் தொலைவிலிருந்த ஓர் ஊருக்குப் புறப்பட்டுச் சென்றேன். அவர்கள் இரண்டு ரக்அத்களே தொழுதார்கள். அப்போது அவர்களிடம் நான் (அது பற்றிக்) கேட்டேன். அதற்கு அவர்கள் கூறினார்கள்: உமர் (ரலி) அவர்கள் துல்ஹுலைஃபாவில் இரண்டு ரக்அத்கள் தொழுவதை நான் கண்டேன். உமர் (ரலி) அவர்களிடம் நான் அதைப் பற்றிக் கேட்டபோது அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்ததைப் போன்றே நானும் செய்கிறேன்\"என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": "692.02",
			"text": "மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"இப்னுஸ் ஸிம்த் (அவர்களுடன் புறப்பட்டேன்...)\" என்று உள்ளது. ஷுரஹ்பீல் எனும் அவர்களது பெயர் இடம்பெறவில்லை. மேலும் \"அவர் பதினெட்டு மைல் தொலைவிலுள்ள ஹிம்ஸ் நாட்டின் \"தூமீன்\" எனும் பகுதிக்குச் சென்றார்கள்\" என்று (அதிகப்படியாக) இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": "693.01",
			"text": "யஹ்யா பின் அபீஇஸ்ஹாக் (ரஹ்) அவர்கள் கூறியதாவது: அனஸ் பின் மாலிக் (ரலி) அவர்கள் \"நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் மதீனாவிலிருந்து (ஹஜ்ஜுக்காக) மக்காவை நோக்கிப் புறப்பட்டோம். அவர்கள் திரும்பி வரும்வரை (நான்கு ரக்அத்கள் கொண்ட தொழுகைகளை) இரண்டு இரண்டு ரக்அத்களாகவே தொழுதார்கள்\" என்று கூறினார்கள். உடனே நான் (அனஸ் (ரலி) அவர்களிடம்) \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்காவில் எத்தனை நாட்கள் தங்கினார்கள்?\" என்று கேட்டேன். அதற்குப் \"பத்து (நாட்கள்)\" என்று அனஸ் (ரலி) அவர்கள் பதிலளித்தார்கள். - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. - அனஸ் (ரலி) அவர்களிடமிருந்து யஹ்யா பின் அபீஇஸ்ஹாக் (ரஹ்) அவர்கள் அறிவிக்கும் மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் \"நாங்கள் மதீனாவிலிருந்து ஹஜ்ஜுக்காகப் புறப்பட்டோம்...\" என்று ஹதீஸ் தொடங்குகிறது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"ஹஜ்ஜுக்காகப் புறப்பட்டோம்\"எனும் குறிப்பு இல்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": "693.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": "693.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": "693.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": "694.01",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மினா உள்ளிட்ட இடங்களில் (நான்கு ரக்அத்கள் கொண்ட தொழுகைகளை) பயணத்திலிருப்பவர் தொழுவதைப் போன்று (சுருக்கி) இரண்டு ரக்அத்களாகத் தொழுதார்கள். அபூபக்ர் (ரலி) அவர்களும் உமர் (ரலி) அவர்களும் (அவ்வாறே தொழுவார்கள்). உஸ்மான் (ரலி) அவர்களும் தமது ஆட்சியின் ஆரம்பக் கட்டத்தில் இரண்டு ரக்அத்களாகவே தொழுதார்கள். பின்னர் அன்னார் (சுருக்கித் தொழாமல்) முழுமையாகவே தொழுதார்கள். - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"மினாவில்\" என்றே இடம்பெற்றுள்ளது. \"அது உள்ளிட்ட இடங்களில்\" என்ற குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": "694.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": "694.03",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மினாவில் (நான்கு ரக்அத்கள் கொண்ட தொழுகையைச் சுருக்கி) இரண்டு ரக்அத்களாகத் தொழுதார்கள். அவர்களுக்குப் பிறகு அபூபக்ர் (ரலி) அவர்களும், அபூபக்ருக்குப் பிறகு உமர் (ரலி) அவர்களும், உஸ்மான் (ரலி) அவர்கள் தமது ஆட்சியின் ஆரம்பக் கட்டத்திலும் (இரண்டு ரக்அத்களே தொழுதனர்). பின்னர் உஸ்மான் (ரலி) அவர்கள் (சுருக்கித் தொழாமல்) நான்கு ரக்அத்கள் தொழுதார்கள்.(இதன் அறிவிப்பாளரான) நாஃபிஉ (ரஹ்) அவர்கள் கூறுகின்றார்கள்: இப்னு உமர் (ரலி) அவர்கள் (மினாவில்) இமாமைப் பின்பற்றித் தொழுதால் நான்கு ரக்அத்கள் தொழுவார்கள்; தனியாகத் தொழும்போது (சுருக்கி) இரண்டு ரக்அத்கள் தொழுவார்கள். - மேற்கண்ட ஹதீஸ் மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": "694.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": "694.05",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் மினாவில், பயணத்திலிருப்பவர் தொழுவதைப் போன்று (கடமையான நான்கு ரக்அத்களைச் சுருக்கி இரண்டு ரக்அத்களாகத்) தொழுதார்கள். (அவ்வாறே) அபூபக்ர் (ரலி), உமர் (ரலி) ஆகியோரும் (தொழுதார்கள்). உஸ்மான் (ரலி) அவர்கள் (தமது ஆட்சியில்) \"எட்டு ஆண்டுகள்\" அல்லது \"ஆறு ஆண்டுகள்\" (அவ்வாறே தொழுதார்கள்).(இதன் அறிவிப்பாளரான) ஹஃப்ஸ் பின் ஆஸிம் (ரஹ்) அவர்கள் கூறுகின்றார்கள்: (என் தந்தையின் சகோதரர்) இப்னு உமர் (ரலி) அவர்கள் மினாவில் இரண்டு ரக்அத்கள் தொழுதுவிட்டுப் பிறகு தமது படுக்கைக்கு வருவார்கள். அப்போது அவர்களிடம் நான், \"என் தந்தையின் சகோதரரே! நீங்கள் (கடமையான) இந்தத் தொழுகைக்குப் பின் (கூடுதலான) இரண்டு ரக்அத்கள் தொழுதால் என்ன!\" என்று கேட்டேன். அதற்கு அவர்கள், \"நான் (அவ்வாறு) தொழுவதாயிருந்தால் கடமையான தொழுகையை (நான்கு ரக்அத்களாகவே) முழுமைப்படுத்தியிருப்பேன்\" என்று சொன்னார்கள். - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"மினாவில்\" என்ற குறிப்பில்லை. மாறாக, \"பயணத்தில் (அவ்வாறு) தொழுதார்கள்\" என்றே காணப்படுகின்றது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": "694.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": "695.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": "695.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": "696.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": "696.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": "697.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": "697.02",
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: இப்னு உமர் (ரலி) அவர்கள் குளிரும் காற்றும் மழையும் நிறைந்த ஓர் இரவில் தொழுகை அறிவிப்புச் செய்தார்கள். அறிவிப்பின் இறுதியில் \"ஓர் அறிவிப்பு! நீங்கள் உங்கள் இருப்பிடங்களிலேயே தொழுதுகொள்ளுங்கள்; இருப்பிடங்களிலேயே தொழுதுகொள்ளுங்கள்\" என்று கூறினார்கள். பிறகு \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குளிரோ மழையோ உள்ள இரவில் பயணம் செய்யும்போது தொழுகை அறிவிப்பாளரிடம் \"நீங்கள் உங்கள் இருப்பிடங்களிலேயே தொழுது கொள்ளுங்கள்\" என்று அறிவிக்குமாறு கட்டளையிடுவார்கள்\" என்றும் குறிப்பிட்டார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": "697.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": "698",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": "699.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": "699.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": "699.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": "699.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": "699.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": "699.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": "700.01",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது (ஒட்டகத்தின் மீதமர்ந்தவாறு) ஒட்டகம் செல்லும் திசையை நோக்கிக் கூடுதலான (நஃபில்) தொழுகை தொழுபவர்களாக இருந்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": "700.02",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தமது வாகனத்தில் அமர்ந்து, அது செல்லும் திசையை நோக்கித் தொழுதுவந்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": "700.03",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்காவிலிருந்து மதீனா நோக்கி வாகனத்தில் செல்லும்போது தமது முகமிருந்த திசையில் தொழுதார்கள். இது தொடர்பாகவே \"நீங்கள் எங்கு திரும்பினாலும் அங்கேயும் அல்லாஹ் இருக்கிறான்\" எனும் (2:115ஆவது) வசனம் அருளப்பெற்றது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": "700.04",
			"text": "மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், அப்துல்லாஹ் பின் அல்முபாரக் மற்றும் இப்னு அபீசாயிதா (ரஹ்) ஆகியோரின் அறிவிப்பில், \"பிறகு இப்னு உமர் (ரலி) அவர்கள் \"நீங்கள் எங்கு திரும்பினாலும் அங்கேயும் அல்லாஹ் இருக்கிறான்\" (2:115) எனும் வசனத்தை ஓதிக் காட்டிவிட்டு,இது தொடர்பாகவே இந்த வசனம் அருளப்பெற்றது\" என்று கூறியதாக இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": "700.05",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கழுதையில் இருந்தவாறு தொழுவதை நான் கண்டேன். அப்போது அவர்கள் கைபரை நோக்கிச் சென்றுகொண்டிருந்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": "700.06",
			"text": "சயீத் பின் யசார் (ரஹ்) அவர்கள் கூறியதாவது: நான் (ஓர் இரவில்) மக்கா செல்லும் சாலையில் இப்னு உமர் (ரலி) அவர்களுடன் பயணித்துக் கொண்டிருந்தேன். சுப்ஹு நேரம் (நெருங்கிவிட்டது) குறித்து நான் அஞ்சியபோது (எனது வாகனத்திலிருந்து) இறங்கி \"வித்ர்” தொழுதேன். பிறகு அவர்களுடன் போய்ச் சேர்ந்துகொண்டேன். இப்னு உமர் (ரலி) அவர்கள், \"(இவ்வளவு நேரம்) எங்கே இருந்தீர்?\" என்று கேட்டார்கள். நான் \"சுப்ஹு நேரம் (நெருங்கிவிட்டது) குறித்து அஞ்சினேன். எனவே (வாகனத்திலிருந்து) இறங்கி \"வித்ர்” தொழுதேன்\" என்று கூறினேன். அதற்கு இப்னு உமர் (ரலி) அவர்கள் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் உமக்கு அழகிய முன்மாதிரி இல்லையா?\" என்று கேட்டார்கள். அதற்கு நான், \"ஆம் (உள்ளது), அல்லாஹ்வின் மீதாணையாக!\" என்றேன். அப்போது அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒட்டகத்தின் மீதமர்ந்து வித்ர் தொழுதிருக்கிறார்கள்\" என்று கூறினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": "700.07",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வாகனத்தின் மீதமர்ந்து அது செல்லும் திசையில் தொழுவார்கள். (இதன் அறிவிப்பாளரான) அப்துல்லாஹ் பின் தீனார் (ரஹ்) அவர்கள் கூறுகிறார்கள்: இப்னு உமர் (ரலி) அவர்களும் இவ்வாறு செய்வார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": "700.08",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வாகனத்தின் மீதமர்ந்து வித்ர் தொழுவார்கள். இதை அப்துல்லாஹ் பின் தீனார் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": "700.09",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வாகனத்தில் இருந்தவாறு கூடுதல் (நஃபில்) தொழுகைகளைத் தொழுவார்கள்; அப்போது அவர்கள் எத்திசையை முன்னோக்கியிருப்பினும் சரியே! (அவ்வாறே) வாகனத்தில் இருந்தவாறு வித்ரும் தொழுவார்கள். ஆனால், கடமையான (ஃபர்ள்) தொழுகைகளை வாகனத்தின் மீதமர்ந்து தொழமாட்டார்கள். (இறங்கித்தான் தொழுவார்கள்). இதை சாலிம் பின் அப்தில்லாஹ் பின் உமர் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": "701",
			"text": "ஆமிர் பின் ரபீஆ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவில் பயணம் செய்யும்போது தமது வாகனத்தின் முதுகிலமர்ந்தவாறு அது செல்லும் திசையில் கூடுதலான (நஃபில்) தொழுகைகள் தொழுவதை நான் பார்த்திருக்கிறேன். இதை அப்துல்லாஹ் பின் ஆமிர் பின் ரபீஆ (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": "702",
			"text": "அனஸ் பின் சீரீன் (ரஹ்) அவர்கள் கூறியதாவது: அனஸ் பின் மாலிக் (ரலி) அவர்கள் சிரியாவிலிருந்து திரும்பியபோது அவர்களை நாங்கள் எதிர் கொண்டோம்; \"அய்னுத் தம்ர்” எனும் இடத்தில் அவர்களை நாங்கள் சந்தித்தோம். அப்போது அவர்கள் கழுதையின் மீதமர்ந்தவாறு (கூடுதலான தொழுகைகள்) தொழுவதை நான் கண்டேன். அவர்களுடைய முகம் (கிப்லா அல்லாத) வேறு திசை நோக்கி அமைந்திருந்தது. - இவ்விடத்தில் அறிவிப்பாளர் ஹம்மாம் (ரஹ்) அவர்கள் கிப்லாவுக்கு இடப் பக்கம் நோக்கி சைகை செய்துகாட்டினார்கள்.- அப்போது அவர்களிடம் நான் \"நீங்கள் கிப்லா அல்லாத வேறு திசை நோக்கித் தொழுவதை நான் கண்டேனே?\" என்று கேட்டேன். அதற்கு அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பயணத்தில்) இவ்வாறு செய்வதை நான் பார்த்திராவிட்டால் நானும் இவ்வாறு செய்திருக்க மாட்டேன்\" என்று விடையüத்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": "703.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": "703.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": "703.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": "703.04",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவசரமாகப் பயணம் புறப்படுவதாக இருந்தால் மஃக்ரிப் தொழுகையைத் தாமதப்படுத்தி, மஃக்ரிபையும் இஷாவையும் சேர்த்துத் தொழுவார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": "704.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சூரியன் உச்சியிலிருந்து சாய்வதற்கு முன் பயணம் மேற்கொண்டால் லுஹர் தொழுகையை அஸ்ர் நேரம்வரைத் தாமதப்படுத்தி, பின்பு (ஓரிடத்தில்) இறங்கி லுஹரையும் அஸ்ரையும் சேர்த்துத் தொழுவார்கள். பயணம் புறப்படுவதற்கு முன் சூரியன் உச்சியிலிருந்து சாய்ந்து விட்டால் லுஹர் தொழுதுவிட்டே பயணம் மேற்கொள்வார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": "704.02",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் பயணத்தில் இரு தொழுகைகளைச் சேர்த்துத் தொழ விரும்பினால், லுஹர் தொழுகையை அஸ்ரின் ஆரம்ப நேரம் வரும்வரைத் தாமதப்படுத்துவார்கள்; பிறகு லுஹரையும் அஸ்ரையும் சேர்த்துத் தொழுவார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": "704.03",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் அவசரமாகப் பயணம் செய்ய நேரிட்டால் லுஹ்ர் தொழுகையை அஸ்ரின் ஆரம்ப நேரம்வரைத் தாமதப்படுத்தி, லுஹரையும் அஸ்ரையும் சேர்த்துத் தொழுவார்கள்; மஃக்ரிப் தொழுகையைத் தாமதப்படுத்தி, மஃக்ரிபையும் இஷாவையும் சேர்த்து செம்மேகம் மறையும்போது தொழுவார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": "705.01",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் லுஹரையும் அஸ்ரையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள்; மஃக்ரிபையும் இஷாவையும் ஒரே நேரத்தில் தொழுதார்கள்; அப்போது (போர் அபாயம் மிகுந்த) அச்ச நிலையிலோ பயணத்திலோ அவர்கள் இருக்கவில்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": "705.02",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவில் லுஹரையும் அஸ்ரையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள். அப்போது (அவர்கள்) அச்ச நிலையிலோ பயணத்திலோ இருக்கவில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. (அறிவிப்பாளர்களில் ஒருவரான) அபுஸ் ஸுபைர் (ரஹ்) அவர்கள் கூறுகின்றார்கள்: நான் (இந்த ஹதீஸை எனக்கு அறிவித்த) சயீத் பின் ஜுபைர் (ரஹ்) அவர்களிடம், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இவ்வாறு ஏன் செய்தார்கள்?\" என்று கேட்டேன். அதற்கு சயீத் (ரஹ்) அவர்கள், \"நீர் என்னிடம் கேட்டதைப் போன்றே நானும் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் கேட்டேன். அதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள் \"தம் சமுதாயத்தாரில் எவருக்கும் சிரமம் ஏற்படுத்தக் கூடாது என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கருதினார்கள் (எனவேதான் இவ்வாறு செய்தார்கள்)\" என விடையளித்தார்கள்\" என்றார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": "705.03",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தபூக் போருக்காக மேற்கொண்ட பயணத்தின்போது லுஹரையும் அஸ்ரையும் சேர்த்து ஒரு நேரத்திலும், மஃக்ரிபையும் இஷாவையும் சேர்த்து ஒரு நேரத்திலும் தொழுதார்கள். இதன் அறிவிப்பாளரான சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறுகின்றார்கள்: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் \"அல்லாஹ்வின் தூதர் (ஸஸ்) அவர்கள் இவ்வாறு ஏன் செய்தார்கள்?\" என்று கேட்டேன். அதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள், \"தம் சமுதாயத்தாருக்குச் சிரமம் ஏற்படுத்தக்கூடாது என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கருதினார்கள்\" என விடையளித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": "706.01",
			"text": "முஆத் பின் ஜபல் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தபூக் போருக்குப் புறப்பட்டுச் சென்றோம். அப்போது அவர்கள் லுஹரையும் அஸ்ரையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள்; மஃக்ரிபையும் இஷாவையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": "706.02",
			"text": "முஆத் பின் ஜபல் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தபூக் போரின்போது லுஹரையும் அஸ்ரையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள்;மஃக்ரிபையும் இஷாவையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள்.(இதன் அறிவிப்பாளர்களில் ஒருவரான) ஆமிர் பின் வாஸிலா (ரஹ்) அவர்கள் கூறுகின்றார்கள்: நான் (இந்த ஹதீஸை எனக்கு அறிவித்த) முஆத் (ரலி) அவர்களிடம் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இவ்வாறு ஏன் செய்தார்கள்?\" என்று கேட்டேன். அதற்கு அவர்கள், \"தம் சமுதாயத்தாருக்குச் சிரமம் ஏற்படுத்தக்கூடாது என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கருதினார்கள்\" என விடையளித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": "705.04",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவில் லுஹரையும் அஸ்ரையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள்;மஃக்ரிபையும் இஷாவையும் சேர்த்து ஒரே நேரத்தில் தொழுதார்கள். அப்போது அச்சமோ மழையோ இருக்கவில்லை. இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில், வகீஉ (ரஹ்) அவர்களது அறிவிப்பில், \"நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இவ்வாறு ஏன் செய்தார்கள்?\" என்று கேட்டேன். அதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள் \"தம் சமுதாயத்தாருக்குச் சிரமம் ஏற்படுத்தக் கூடாது என்பதற்காக (இவ்வாறு செய்தார்கள்)\" என்று கூறியதாக இடம்பெற்றுள்ளது. அபூமுஆவியா (ரஹ்) அவர்களது அறிவிப்பில், இப்னு அப்பாஸ் (ரலி) அவர்களிடம் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எந்த நோக்கத்தில் இவ்வாறு செய்தார்கள்?\" என்று கேட்கப்பட்டதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள், \"தம் சமுதாயத்தாருக்குச் சிரமம் ஏற்படுத்தக் கூடாது என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கருதினார்கள்\" என விடையளித்ததாக இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": "705.05",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் எட்டு ரக்அத் (கொண்ட லுஹர், அஸ்ர் ஆகிய தொழுகை)களை ஒரே நேரத்தில் தொழுதிருக்கிறேன்;ஏழு ரக்அத் (கொண்ட மஃக்ரிப், இஷா ஆகிய தொழுகை)களை ஒரே நேரத்தில் தொழுதிருக்கிறேன். (இதன் அறிவிப்பாளர்களில் ஒருவரான) அம்ர் பின் தீனார் (ரஹ்) அவர்கள் கூறுகின்றார்கள்: நான் (இந்த ஹதீஸை எனக்கு அறிவித்த ஜாபிர் பின் ஸைத் (ரஹ்) அவர்களிடம்), \"அபுஷ் ஷஅஸா அவர்களே! நபி (ஸல்) அவர்கள் லுஹர் தொழுகையைத் தாமதப்படுத்தி அஸ்ரின் ஆரம்ப நேரத்திலும், மஃக்ரிப் தொழுகையைத் தாமதப்படுத்தி இஷாவின் ஆரம்ப நேரத்திலும் தொழுதிருப்பார்கள் என நான் எண்ணுகிறேன்\" என்றேன். அதற்கு \"நானும் அவ்வாறே எண்ணுகிறேன்\" என்று விடையளித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": "705.06",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவில் லுஹரையும் அஸ்ரையும் (சேர்த்து ஒரே நேரத்தில்) எட்டு ரக்அத்களும்,மஃக்ரிபையும் இஷாவையும் (சேர்த்து ஒரே நேரத்தில்) ஏழு ரக்அத்களும் தொழுதார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": "705.07",
			"text": "அப்துல்லாஹ் பின் ஷகீக் (ரஹ்) அவர்கள் கூறியதாவது: ஒரு நாள் இப்னு அப்பாஸ் (ரலி) அவர்கள் அஸ்ர் தொழுகைக்குப் பிறகு எங்களிடையே (நீண்ட) உரையாற்றினார்கள். எந்த அளவிற்கென்றால் (வானில்) சூரியன் மறைந்து நட்சத்திரங்கள் தோன்றிவிட்டன. மக்கள் \"தொழுகை, தொழுகை\" என்று கூறலாயினர். அப்போது பனூதமீம் குலத்தைச் சேர்ந்த ஒரு மனிதர் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் வந்து (நின்ற இடத்தைவிட்டும்) நகராமல் இடையறாமல் தொடர்ந்து \"தொழுகை தொழுகை\" என்று சொல்லிக்கொண்டிருந்தார். அப்போது இப்னு அப்பாஸ் (ரலி) அவர்கள் \"நீ எனக்கு நபிவழியைக் கற்றுத் தருகிறாயா, தாயற்றுப் போவாய்!\" என்று (கடிந்து) கூறினார்கள். பிறகு \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் லுஹரையும் அஸ்ரையும் சேர்த்து ஒரே நேரத்திலும் மஃக்ரிபையும் இஷாவையும் சேர்த்து ஒரே நேரத்திலும் தொழுததை நான் பார்த்தேன்\" என்று குறிப்பிட்டார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள் இவ்வாறு கூறியதைக் கேட்டு என் மனதில் இலேசான ஐயம் எழுந்தது. உடனே நான் அபூஹுரைரா (ரலி) அவர்களிடம் சென்று அதைப் பற்றிக் கேட்டேன். அப்போது அபூஹுரைரா (ரலி) அவர்கள் இப்னு அப்பாஸ் (ரலி) அவர்களின் கூற்றை உறுதிப்படுத்தினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": "705.08",
			"text": "அப்துல்லாஹ் பின் ஷகீக் அல்உகைலீ (ரஹ்) அவர்கள் கூறியதாவது: ஒரு மனிதர் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் \"தொழுகை(க்கு நேரமாகிவிட்டது)\" என்று கூறினார். இப்னு அப்பாஸ் (ரலி) அவர்கள் அமைதியாக இருந்தார்கள். பிறகு மீண்டும் அவர் \"தொழுகை(க்கு நேரமாகிவிட்டது)\" என்று கூறினார். இப்னு அப்பாஸ் (ரலி) அவர்கள் அமைதியாக இருந்தார்கள். பிறகு மீண்டும் அவர் \"தொழுகை(க்கு நேரமாகிவிட்டது)\" என்று கூறினார். அப்போதும் இப்னு அப்பாஸ் (ரலி) அவர்கள் அமைதியாக இருந்தார்கள். பிறகு \"தாயற்றுப் போவாய்! எங்களுக்கே தொழுகைகளைக் கற்றுத் தருகிறாயா? நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் இரண்டு தொழுகைகளை ஒரே நேரத்தில் சேர்த்துத் தொழுபவர்களாக இருந்தோம்\" என்று கூறினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": "707.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": "707.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": "708.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": "708.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": "709.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": "709.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": "710.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": "710.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": "710.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": "710.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": "711.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": "711.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": "712",
			"text": "அப்துல்லாஹ் பின் சர்ஜிஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வைகறைத் தொழுகை (சுப்ஹுத்) தொழுவித்துக் கொண்டிருந்தபோது ஒரு மனிதர் பள்ளிவாசலுக்குள் நுழைந்தார்; பள்ளிவாசலின் ஒரு மூலையில் (சுப்ஹுடைய சுன்னத்) இரண்டு ரக்அத்கள் தொழுதுவிட்டுப் பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் (தொழுகையில்) சேர்ந்துகொண்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சலாம் கொடுத்ததும், \"இன்னாரே! இவ்விரு தொழுகைகளில் எதைக் கருதி வந்தீர்? நீர் தனியாகத் தொழுவதற்கா? அல்லது எம்முடன் சேர்ந்து தொழுவதற்கா?\" என்று கேட்டார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": "713.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் பள்ளிவாசலுக்குள் நுழையும் போது \"அல்லாஹும்ம ஃப்தஹ்லீ அப்வாப ரஹ்மதிக\" (இறைவா! உன் கருணையின் வாசல்களை எனக்குத் திறந்திடுவாயாக!) என்று கூறட்டும்; பள்ளிவாசலிலிருந்து வெளியேறும்போது \"அல்லாஹும்ம இன்னீ அஸ்அலுக மின் ஃபள்லிக\" (இறைவா! உன்னிடம் நான் உன் அருட்(செல்வங்)களிலிருந்து வேண்டுகிறேன்) என்று கூறட்டும். இதை அபூஹுமைத் (ரலி), அல்லது அபூஉசைத் (ரலி) அவர்கள் அறிவிக்கிறார்கள். முஸ்லிம் பின் அல்ஹஜ்ஜாஜ் (ஆகிய நான்) கூறுகின்றேன்: அறிவிப்பாளர் யஹ்யா பின் யஹ்யா (ரஹ்) அவர்கள் கூறினார்கள்: இந்த ஹதீஸை நான் அறிவிப்பாளர் சுலைமான் பின் பிலால் (ரஹ்) அவர்களின் ஹதீஸ் ஏட்டிலிருந்து எழுதினேன். அதில் சுலைமான் (ரஹ்) அவர்கள் \"யஹ்யா அல்ஹிம்மானீ (ரஹ்) அவர்கள் \"அபூஹுமைதும் அபூஉசைதும் அறிவித்தனர்\" என்றே எனக்குச் செய்தி எட்டியது\" என்று குறிப்பிட்டிருந்தார்கள். (அபூஹுமைத் (ரலி) அல்லது அபூஉசைத் (ரலி) அவர்கள் என்று ஐயப்பாட்டுடன் இடம்பெற வில்லை). - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": "713.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": "714.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": "714.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": "715.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": "715.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": "715.03",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஒரு போருக்குப் புறப்பட்டுச் சென்றேன். (போரை முடித்துத் திரும்பிக்கொண்டிருந்தபோது) எனது ஒட்டகம் என்னைப் பின்தங்க வைத்துவிட்டது; அது களைத்துப்போயிருந்தது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எனக்கு முன்னால் (மதீனா) சென்றுவிட்டார்கள். நான் காலை நேரத்தில் (மதீனாவிற்குச்) சென்று பள்ளிவாசலுக்குள் நுழைந்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பள்ளிவாசலின் நுழைவாயிலில் கண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இப்போதுதான் வருகிறீரா?\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். \"உமது ஒட்டகத்தை விட்டுவிட்டு உள்ளே சென்று இரண்டு ரக்அத்கள் தொழுவீராக!\" என்று கூறினார்கள். அவ்வாறே நான் சென்று (இரண்டு ரக்அத்கள்) தொழுதுவிட்டுப் பிறகு திரும்பினேன். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": "716",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": "717.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": "717.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": "718",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": "719.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": "719.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": "719.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": "719.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": "336.04",
			"text": "அப்துர் ரஹ்மான் பின் அபீலைலா (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் முற்பகல் நேரத்தில் (ளுஹா) தொழுததைப் பார்த்தாக உம்முஹானீ (ரலி) அவர்களைத் தவிர வேறெவரும் எனக்கு அறிவிக்கவில்லை. \"நபி (ஸல்(அவர்கள் மக்கா வெற்றிகொள்ளப்பட்ட நாளில் எனது இல்லத்திற்கு வந்து எட்டு ரக்அத்கள் தொழுதார்கள்; அதைவிடச் சுருக்கமாக வேறு எந்தத் தொழுகையையும் அவர்கள் தொழுததை நான் ஒருபோதும் கண்டதில்லை. ஆயினும், ருகூஉவையும் சஜ்தாவையும் பரிபூரணமாகச் செய்தார்கள்\" என உம்முஹானீ (ரலி) அவர்கள் அறிவித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில், இப்னு பஷ்ஷார் (ரஹ்) அவர்களது அறிவிப்பில் \"ஒருபோதும்\" எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": "336.05",
			"text": "அப்துல்லாஹ் பின் அல்ஹாரிஸ் பின் நவ்ஃபல் (ரஹ்) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ளுஹாத் தொழுததாக அறிவிக்கும் யாரேனும் ஒருவரை நான் கண்டால் அவரிடம் அதைப் பற்றிக் கேட்க வேண்டும் என பேராவல் கொண்டிருந்தேன். ஆனால், அவ்வாறு அறிவிக்கும் எவரும் எனக்குக் கிடைக்கவில்லை. (நபி (ஸல்) அவர்களின் பெரிய தந்தை) அபூதாலிபின் மகள் உம்முஹானீ (ரலி) அவர்களைத் தவிர. உம்முஹானீ (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்கா வெற்றி நாளில் முற்பகல் (ளுஹா) நேரத்தில் (எனது இல்லத்திற்கு) வந்தார்கள்;அவர்களிடம் ஒரு துணி கொண்டுவரப்பட்டு அவர்களைச் சுற்றி திரையிடப்பட்டது; அவர்கள் குளித்தார்கள். பிறகு (தொழுகைக்குத் தயாராகி) நின்று எட்டு ரக்அத்கள் தொழுதார்கள். அத்தொழுகையில் அவர்களது நிற்றல் மிக நீளமானதாக இருந்ததா, அல்லது ருகூஉ, அல்லது சஜ்தா மிக நீளமானதாக இருந்ததா என்று எனக்குத் தெரியவில்லை. இவற்றில் ஒவ்வொன்றுமே கிட்டத்தட்ட ஒரே அளவிலேயே அமைந்திருந்தன. ஆனால், அவர்கள் அதற்கு முன்போ அதற்குப் பின்போ ளுஹாத் தொழுததை நான் கண்டதில்லை. இந்த ஹதீஸ் இரு அறிவிபபாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": "336.06",
			"text": "உம்மு ஹானீ பின்த் அபீதாலிப் (ரலி) அவர்கள் கூறியதாவது: மக்கா வெற்றிகொள்ளப்பட்ட ஆண்டில் நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றேன். (வெற்றி கிட்டிய அந்த நாளில்) நபி (ஸல்) அவர்களை, அவர்களுடைய புதல்வி ஃபாத்திமா (ரலி) அவர்கள் ஒரு துணியால் திரையிட்டு மறைத்துக்கொண்டிருக்க,நபி (ஸல்) அவர்கள் குளித்துக் கொண்டிருப்பதைக் கண்டேன். நான் அவர்களுக்கு சலாம் சொன்னேன். (அதைக் கேட்ட) அவர்கள், \"யார் அது?\" எனக் கேட்டார்கள். அதற்கு \"நான் உம்முஹானீ பின்த் அபீதாலிப்\" என்றேன். \"உம்மு ஹானியே வருக!\" என்று சொன்னார்கள். குளித்து முடித்ததும் ஒரே ஆடையை (இரு தோள்கள்மீது) மாற்றிப் போட்டுக்கொண்டு எட்டு ரக்அத்கள் (ளுஹா) தொழுதார்கள்; தொழுது முடித்ததும் நான், \"அல்லாஹ்வின் தூதரே! நான் புகலிடம் அளித்திருக்கும் ஒரு மனிதரை - ஹுபைரா மகன் இன்னாரை - என் தாயின் புதல்வர் (என் சகோதரர்) அலீ பின் அபீதாலிப் கொல்லப் போவதாகக் கூறுகிறார்\" என்று சொன்னேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உம்முஹானியே! நீங்கள் அபயம் அளித்தவருக்கு நாமும் அபயம் அளித்துவிட்டோம் (ஆகவே, கவலை வேண்டாம்)\" என்று கூறினார்கள். (நான் நபி (ஸல்) அவர்களிடம் சென்ற) அந்த நேரம் முற்பகல் வேளையாக இருந்தது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": "336.07",
			"text": "உம்முஹானீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்கா வெற்றி கொள்ளப்பட்ட ஆண்டில் (முற்பகல் நேரத்தில்) எனது வீட்டில் எட்டு ரக்அத்கள் தொழுதார்கள்; அப்போது ஒரே ஆடையை (தம்மீது) சுற்றிக்கொண்டு அதன் இரு ஓரங்களையும் (தோள்கள்மீது) மாற்றிப் போட்டுக் கொண்டார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": "720",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் ஒவ்வொரு காலையிலும் (தமது உடலிலுள்ள) ஒவ்வொரு மூட்டிற்காகவும் தர்மம் செய்வது கடமையாகும்;இறைவனைத் துதிக்கும் ஒவ்வொரு துதிச் சொல்லும் (சுப்ஹானல்லாஹ்) தர்மமாகும். ஒவ்வொரு புகழ்மாலையும் (அல்ஹம்து லில்லாஹ்) தர்மமாகும். ஒவ்வொரு \"ஓரிறை உறுதிமொழி\"யும் (லா இலாஹ இல்லல்லாஹ்) தர்மமாகும்; அவனைப் பெருமைப்படுத்தும் ஒவ்வொரு சொல்லும் (அல்லாஹு அக்பர்) தர்மமே! நல்லதை ஏவுதலும் தர்மமே! தீமைகளைத் தடுத்தலும் தர்மமே! இவை அனைத்திற்கும் (ஈடாக) முற்பகல் நேரத்தில் (ளுஹா) இரண்டு ரக்அத்கள் தொழுவது போதுமானதாக அமையும். இதை அபூதர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": "721.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": "721.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": "721.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": "722",
			"text": "அபுத்தர்தா (ரலி) அவர்கள் கூறியதாவது: என் நேசர் (நபி-ஸல்) அவர்கள் ஒவ்வொரு மாதமும் மூன்று நாட்கள் நோன்பு நோற்பது, ளுஹாத் தொழுவது, வித்ர் தொழாமல் உறங்கலாகாது ஆகிய மூன்று விஷயங்களை நான் வாழ்நாளில் ஒருபோதும் கைவிடக்கூடாது என எனக்கு அறிவுறுத்தினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": "723.01",
			"text": "இறைநம்பிக்கையாளர்களின் அன்னை ஹஃப்ஸா (ரலி) அவர்கள் கூறியதாவது: தொழுகை அறிவிப்பாளர் சுப்ஹுத் தொழுகைக்கான அறிவிப்புச் செய்து முடித்து, வைகறை நேரம் வந்துவிட்டால், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இகாமத் சொல்லப்படுவதற்கு முன்பாகச் சுருக்கமான முறையில் இரண்டு ரக்அத்கள் (சுன்னத்) தொழுவார்கள். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் மேலும் ஆறு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": "723.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": "723.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": "723.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": "723.05",
			"text": "ஹஃப்ஸா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் வைகறை (ஃபஜ்ர்) வெளிச்சம் வந்த பிறகு இரண்டு ரக்அத்கள் (சுன்னத்) தொழுவார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": "724.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": "724.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": "724.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": "724.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": "724.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": "724.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": "724.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": "725.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": "725.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": "726",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": "727.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": "727.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": "727.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": "728.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": "728.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": "728.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": "728.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": "729",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": "730.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": "730.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": "730.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": "730.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": "730.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": "731.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": "731.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": "731.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": "731.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": "732.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": "732.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": "732.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": "732.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": "733.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": "733.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": "734",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": "735.01",
			"text": "அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"உட்கார்ந்து தொழுபவருக்கு, (நின்று தொழுபவரின்) தொழுகையில் பாதி (நன்மை)யே உண்டு\" என்று கூறியதாக எனக்கு அறிவிக்கப்பட்டது. இதையடுத்து (ஒரு நாள்) நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றேன். அப்போது அவர்கள் உட்கார்ந்து தொழுதுகொண்டிருப்பதைக் கண்டேன். ஆகவே, நான் அவர்களது தலைமீது எனது கையை வைத்தேன். அப்போது அவர்கள், \"அப்துல்லாஹ் பின் அம்ர்! உமக்கு என்ன (நேர்ந்தது)?\" என்று கேட்டார்கள். நான், \"அல்லாஹ்வின் தூதரே! \"உட்கார்ந்து தொழுபவருக்கு, (நின்று தொழுபவரின்) தொழுகையில் பாதி (நன்மை)யே உண்டு\" எனத் தாங்கள் கூறியதாக எனக்கு அறிவிக்கப்பட்டது; ஆனால் தாங்களே உட்கார்ந்து தொழுதுகொண்டிருக்கிறீர்களே?\" என்று கேட்டேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஆம்; ஆயினும் நான் உங்களில் ஒருவரைப் போன்றவன் அல்லன்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அறிவிப்பாளர்களில் ஒருவரான அபூயஹ்யா (ரஹ்) என்பவர் \"அபூயஹ்யா அல்அஃரஜ்\" ஆவார் என ஷுஅபா (ரஹ்) அவர்களது அறிவிப்பில் காணப்படுகிறது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": "735.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": "736.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவில் பதினோரு ரக்அத்கள் (நஃபில்) தொழுவார்கள். அவற்றில் ஒரு ரக்அத்தை வித்ராகத் தொழுதார்கள். தொழுது முடித்த பின் (தம்மை அழைப்பதற்காக) தொழுகை அறிவிப்பாளர் தம்மிடம் வரும்வரை வலப் பக்கம் சாய்ந்து படுத்திருப்பார்கள். (அவர் வந்ததும் எழுந்து) சுருக்கமாக இரண்டு ரக்அத்கள் (சுப்ஹுடைய சுன்னத்) தொழுவார்கள். இதை உர்வா (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": "737.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": "737.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": "737.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": "738.01",
			"text": "அபூசலமா பின் அப்திர் ரஹ்மான் பின் அவ்ஃப் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஆயிஷா (ரலி) அவர்களிடம், \"ரமளான் மாதத்தி(ன் இரவுகளி)ல் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது தொழுகை எவ்வாறு இருந்தது?\" என்று கேட்டேன். அதற்கு அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ரமளானிலும் ரமளான் அல்லாத மாதங்களிலும் பதினோரு ரக்அத்களைவிட அதிகமாகத் தொழமாட்டார்கள்; (முதலில்) நான்கு ரக்அத்கள் தொழுவார்கள். அதன் அழகையும் நீளத்தையும் பற்றி நீ கேட்க வேண்டியதில்லை! பிறகு நான்கு ரக்அத்கள் தொழுவார்கள். அதன் அழகையும் நீளத்தையும் பற்றி நீ கேட்க வேண்டியதில்லை! பிறகு மூன்று ரக்அத்கள் தொழுவார்கள்\" என்று விடையளித்தார்கள். )தொடர்ந்து) ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: நான், \"அல்லாஹ்வின் தூதரே! நீங்கள் வித்ர் தொழுவதற்கு முன் உறங்குவீர்களா?\" என்று கேட்டேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"என் கண்கள்தாம் உறங்குகின்றன; என் உள்ளம் உறங்குவதில்லை\" என விடையளித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": "738.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": "738.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": "738.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": "738.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": "739",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": "740",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": "741",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": "742",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": "743.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": "743.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": "744.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": "744.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": "745.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": "745.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": "745.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": "746.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": "746.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": "746.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": "746.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": "746.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": "746.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": "747",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": "748.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": "748.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": "749.01",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் இரவுத் தொழுகை பற்றிக் கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இரவுத் தொழுகை இரண்டிரண்டு ரக்அத்களாகும். ஆனால், உங்களில் ஒருவர் சுப்ஹு (நேரம் வந்துவிட்டதோ) என்று அஞ்சினால் அவர் ஒரு ரக்அத் (வித்ர்) தொழட்டும்! (அவ்வாறு தொழுதால்) அவர் (முன்னர்) தொழுதவற்றை அது ஒற்றையாக ஆக்கிவிடும்\" என்று பதிலளித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": "749.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": "749.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": "749.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": "749.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": "750",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": "751.01",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: இரவில் தொழுபவர் இறுதியாக வித்ர் தொழட்டும். ஏனெனில், இவ்வாறே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கட்டளையிட்டுவந்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": "751.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: இரவில் உங்களது கடைசித் தொழுகையாக வித்ரை ஆக்கிக்கொள்ளுங்கள். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": "751.03",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: இரவில் தொழுபவர் சுப்ஹுக்கு முன் தமது கடைசித் தொழுகையாக வித்ரை ஆக்கிக் கொள்ளட்டும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இவ்வாறே மக்களுக்குக் கட்டளையிட்டு வந்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": "752.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: வித்ர் தொழுகை, இரவின் இறுதிப் பகுதியில் (தொழப்படும்) ஒரு ரக்அத்தாகும். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": "752.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: வித்ர் தொழுகை இரவின் இறுதிப் பகுதியில் (தொழப்படும்) ஒரு ரக்அத்தாகும். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": "753",
			"text": "அபூமிஜ்லஸ் (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் வித்ர் தொழுகை பற்றி வினவினேன். அதற்கு அவர்கள் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"(வித்ர்) இரவின் இறுதிப் பகுதியில் ஒரு ரக்அத்தாகும்\" என்று கூறியதை நான் கேட்டுள்ளேன்\" என்று விடையளித்தார்கள். அவ்வாறே இப்னு உமர் (ரலி) அவர்களிடமும் வினவினேன். அவர்களும் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இரவின் இறுதியில் (தொழப்படும்) ஒரு ரக்அத் ஆகும்\" என்று கூறியதை நான் செவியேற்றுள்ளேன்\" என்று விடையளித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": "749.06",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் பள்ளிவாசலில் இருந்த அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை அழைத்து, \"அல்லாஹ்வின் தூதரே! நான் இரவுத் தொழுகையை எவ்வாறு ஒற்றைப்படையாக (வித்ராக) ஆக்குவேன்?\" என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(இரவில்) தொழுபவர் இரண்டிரண்டு ரக்அத்களாகவே தொழுதுவரட்டும். சுப்ஹு (நேரம் வந்துவிட்டது) பற்றி அவர் அறிந்தால் ஒரு ரக்அத் (வித்ர்) தொழட்டும்! முன்னர் அவர் தொழுதவற்றை அது ஒற்றைப்படையாக மாற்றிவிடும்\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் அபூகுறைப் (ரஹ்) அவர்களது அறிவிப்பில், (இப்னு உமரிடமிருந்து அறிவிக்கும் அறிவிப்பாளரின் பெயர்) உபைதுல்லாஹ் பின் அப்தில்லாஹ் என்றே இடம்பெற்றுள்ளது. உபைதுல்லாஹ் பின் அப்தில்லாஹ் பின் உமர் என்று வரவில்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": "749.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": "749.08",
			"text": "மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவின் இறுதிப் பகுதியில் ஒரு ரக்அத் வித்ர் தொழுவார்கள்\" என்றும், \"போதும்! போதும் (நிறுத்து!) நீர் ஒரு விளங்காத மனிதர்\" என்று அனஸ் (ரலி) அவர்கள் கூறியதாகவும் இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": "749.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": "754.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நீங்கள் சுப்ஹை அடைவதற்கு முன் வித்ர் தொழுங்கள்! இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": "754.02",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: மக்கள் நபி (ஸல்) அவர்களிடம் வித்ர் தொழுகை பற்றி வினவினர். அப்போது நபி (ஸல்) அவர்கள், \"சுப்ஹுக்கு முன் வித்ர் தொழுங்கள்!\" என்று கூறினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": "755.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரவின் இறுயில் எழ முடியாது என அஞ்சுபவர் இரவின் ஆரம்பப் பகுதியிலேயே வித்ர் தொழுதுவிடட்டும்! இரவின் இறுதியில் எழ முடியும் என நம்புகின்றவர் இரவின் இறுதியிலேயே வித்ர் தொழட்டும். ஏனெனில், இரவின் இறுதி நேரத்தில் தொழும்போது (வானவர்கள்) பங்கேற்கின்றனர். இதுவே சிறந்ததாகும். இதை ஜாபிர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": "755.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் யார் இரவின் இறுதியில் எழ முடியாது என அஞ்சுகிறாரோ அவர் (முதலில்) வித்ர் தொழுதுவிட்டுப் பிறகு உறங்கட்டும்! இரவில் தம்மால் எழ முடியும் என உறுதியாக நம்புகின்றவர் அதன் இறுதியில் வித்ர் தொழட்டும்! ஏனெனில், இரவின் இறுதி நேரத்தில் குர்ஆன் ஓதும்போது (வானவர்கள்) பங்கேற்கின்றனர். இதுவே சிறந்ததாகும். இதை ஜாபிர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": "756.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": "756.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": "757.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": "757.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": "758.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": "758.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், ஒவ்வோர் இரவிலும் இரவின் முதல் மூன்றிலொரு பகுதி முடியும்போது, கீழ் வானிற்கு இறங்கிவந்து, \"நானே அரசன்;நானே அரசன்! என்னிடம் பிரார்த்திப்பவர் எவருமுண்டா? அவரது பிரார்த்தனையை நான் ஏற்கிறேன். என்னிடம் கேட்பவர் எவரும் உண்டா? அவருக்கு நான் கொடுக்கிறேன். என்னிடம் பாவமன்னிப்புக் கோருபவர் எவரும் உண்டா? அவரை நான் மன்னிக்கிறேன்\"என்று கூறுகிறான். வைகறை (ஃபஜ்ர்) நேரம் புலரும்வரை இவ்வாறு கூறிக்கொண்டிருக்கிறான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": "758.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": "758.04",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ், நடு இரவில் அல்லது இரவின் இறுதி மூன்றிலொரு பகுதியில் கீழ் வானிற்கு இறங்குகிறான். \"என்னிடம் பிரார்த்திப்பவர் எவரும் உண்டா? அவரது பிரார்த்தனையை நான் ஏற்கிறேன். அல்லது என்னிடம் கேட்பவர் எவரும் உண்டா?அவருக்கு நான் கொடுக்கிறேன்\" என்று கூறுகின்றான். பிறகு \"(நான்) இல்லாதவனும் அல்லன்; (வாக்குமீறுவதன் மூலம்) அநீதி இழைப்பவனும் அல்லன். (இத்தகைய) எனக்கு (அழகிய) கடனளிப்பவர் யாரும் உண்டா?\" என்று அல்லாஹ் கேட்கிறான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். முஸ்லிம் (பின் அல்ஹஜ்ஜாஜ் ஆகிய நான்) கூறுகின்றேன்: இந்த ஹதீஸின் அறிவிப்பாளர்களில் ஒருவரான இப்னு மர்ஜானா என்பவர் சயீத் பின் அப்தில்லாஹ் ஆவார். மர்ஜானா என்பது,அவருடைய தாயாரின் பெயராகும். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"பிறகு உயர்வும் வளமும் மிக்க (இறை)வன் தன் கரங்களை விரித்தபடி \"இல்லாதவனோ அநீதி இழைப்பவனோ அல்லாத (உங்கள் இறை)வனுக்கு (அழகிய) கடன் அளிப்பவர் யாரும் உண்டா?\" என்று கூறுவான் என அதிகப்படியாக இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": "758.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": "758.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": "759.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": "759.02",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ரமளான் மாதத்தில் நின்றுவழிபடுவதைக் கட்டாயப்படுத்தாமல் அதன் மீது மக்களுக்கு ஆர்வமூட்டிவந்தார்கள். \"எவர் நம்பிக்கையோடும் நன்மையை எதிர்பார்த்தும் ரமளானில் நின்றுவழிபடுகிறாரோ அவரது முந்தைய பாவங்கள் மன்னிக்கப்பட்டுவிடும்\" என்று கூறுவார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறக்கும்போது இதே நிலையே நீடித்தது. அபூபக்ர் (ரலி) அவர்களது ஆட்சிக் காலத்திலும் உமர் (ரலி) அவர்களது ஆட்சியின் ஆரம்பக் கட்டத்திலும் இந்த நிலையே இருந்தது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": "760.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": "760.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": "761.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓர் இரவில் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலில் தொழுதார்கள். அவர்களைப் பின்பற்றி மக்களும் தொழுதனர். மறுநாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுதபோது மக்களின் எண்ணிக்கை அதிகமானது. மூன்றாவது அல்லது நான்காவது இரவில் (அங்கு) மக்கள் திரண்டபோது அவர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வரவில்லை. அதிகாலையானதும் \"நீங்கள் செய்ததை நான் பார்த்(துக் கொண்டுதான் இருந்)தேன். இத்தொழுகை உங்கள்மீது கடமையாக்கப்பட்டுவிடுமோ என்று நான் அஞ்சியதுதான் உங்களிடம் வரவிடாமல் என்னைத் தடுத்துவிட்டது\" என்று கூறினார்கள்.இது ஒரு ரமளான் மாதத்தில் நடந்ததாகும். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": "761.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": "762.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": "762.02",
			"text": "ஸிர்ரு பின் ஹுபைஷ் (ரஹ்) அவர்கள் கூறியதாவது: உபை பின் கஅப் (ரலி) அவர்கள் லைலத்துல் கத்ர் இரவு பற்றி (பின்வருமாறு) கூறினார்கள்: அல்லாஹ்வின் மீது சத்தியமாக! அந்த இரவைப் பற்றி நான் அறிவேன். அந்த இரவில் நின்று வணங்குமாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்குக் கட்டளையிட்டார்கள்; அது (ரமளானின்) இருபத்தி ஏழாம் இரவேயாகும் என்றே அநேகமாக நான் கருதுகிறேன். அறிவிப்பாளர் ஷுஅபா (ரஹ்) அவர்கள் \"அந்த இரவில் நின்று வணங்குமாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்குக் கட்டளையிட்டார்கள்\" எனும் வார்த்தையில்தான் ஐயப்பாட்டுடன் அறிவிக்கிறார். மேலும், ஷுஅபா (ரஹ்) அவர்கள் கூறுகிறார்கள்: என் நண்பர்களில் ஒருவர் அப்தா பின் அபீலுபாபா (ரஹ்) அவர்களிடமிருந்து இச்செய்தியை எனக்கு அறிவித்தார். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் ஷுஅபா (ரஹ்) அவர்கள் ஐயப்பாட்டுடன் அறிவித்தது பற்றியும் அதற்குப் பின்னுள்ள குறிப்புகளும் இடம்பெறவில்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": "762.03",
			"text": "ஸிர்ரு பின் ஹுபைஷ் (ரஹ்) அவர்கள் கூறியதாவது: உபை பின் கஅப் (ரலி) அவர்களிடம் \"ஆண்டு முழுவதும் இரவில் நின்று வணங்கியவர் லைலத்துல் கத்ர் இரவை அடைந்துகொள்வார்\" என்று அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறிவருவதாகச் சொல்லப்பட்டது. அதற்கு உபை (ரலி) அவர்கள், \"எவனைத் தவிர வேறு இறைவன் இல்லையோ அவன்மீது சத்தியமாக! அது (லைலத்துல் கத்ர்) ரமளானில்தான் உள்ளது (இவ்வாறு சத்தியம் செய்தபோது அன்னார் \"அல்லாஹ் நாடினால்\" என்று கூறாமல் உறுதியாகவே குறிப்பிட்டார்கள்) அல்லாஹ்வின் மீதாணையாக! அது எந்த இரவு என்பதை நான் அறிவேன்; அந்த இரவில் நின்று வணங்குமாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்குக் கட்டளையிட்டார்கள். அது ரமளானில் இருபத்தி ஏழாம் இரவேயாகும். அ(து லைலத்துல் கத்ர் என்ப)தற்கு அடையாளம், அந்த இரவை அடுத்துவரும் காலைப் பொழுதில் சூரியன் வெண்ணிறத்தில் ஒளியிழந்து (மங்கலாக) உதிக்கும்\" என்று கூறினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": "763.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": "763.02",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் என் சிறிய தாயாரும் இறைநம்பிக்கையாளர்களின் அன்னையுமான மைமூனா (ரலி) அவர்களின் இல்லத்தில் ஓர் இரவில் தங்கினேன். நான் தலையணையின் அகலவாட்டில் (தலை வைத்துப்) படுத்துக்கொண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்களுடைய வீட்டாரும் அதன் நீளவாட்டில் (தலை வைத்துப்) படுத்திருந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவின் பாதிவரை அல்லது அதற்குச் சற்று முன்புவரை அல்லது சற்று பின்புவரை உறங்கினார்கள். (பின்னர்) அவர்கள் விழித்தெழுந்து (அமர்ந்து) தமது கரத்தால் முகத்தில் தடவித் தூக்க(க் கலக்க)த்தைத் துடைக்கலானார்கள். பிறகு ஆலு இம்ரான் அத்தியாயத்தின் இறுதிப் பத்து வசனங்களை (3:190-200) ஓதினார்கள். பிறகு கட்டித் தொங்கவிடப்பட்டிருந்த ஒரு தண்ணீர் பையருகே சென்று (அதைச் சரித்து) அதிலிருந்து அங்கத் தூய்மை (உளூ) செய்தார்கள். செம்மையாக அங்கத்தூய்மை செய்துகொண்ட பின் தொழுவதற்காக நின்றார்கள். நானும் எழுந்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்ததைப் போன்று அங்கத் தூய்மை செய்துவிட்டு அவர்களுக்கு (இட)ப் பக்கத்தில் போய் நின்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வலக் கரத்தை என் தலைமீது வைத்து, என் வலது காதைப் பிடித்துத் திருகி (தமது வலப் பக்கத்தில் நிறுத்தி)னார்கள். அப்போது இரண்டு ரக்அத்கள் தொழுதார்கள். பிறகு இரண்டு ரக்அத்கள் தொழுதார்கள். பிறகு இரண்டு ரக்அத்கள் தொழுதார்கள். பிறகு இரண்டு ரக்அத்கள் தொழுதார்கள். பிறகு இரண்டு ரக்அத்கள் தொழுதார்கள். பிறகு இரண்டு ரக்அத்கள் தொழுதார்கள். பிறகு வித்ர் தொழுதார்கள். பின்னர் தொழுகை அறிவிப்பாளர் வரும் வரை சாய்ந்து படுத்திருந்தார்கள். (அவர் வந்ததும்) எழுந்து சுருக்கமாக இரண்டு ரக்அத்கள் (சுப்ஹுடைய சுன்னத்) தொழுது விட்டு (வீட்டிலிருந்து) புறப்பட்டுச் சென்று (மக்களுக்கு) சுப்ஹுத் தொழு(வித்)தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": "763.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": "763.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": "763.05",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் ஓர் இரவில் என் சிறிய தாயார் மைமூனா பின்த் அல்ஹாரிஸ் (ரலி) அவர்களிடம் (அவர்களது இல்லத்தில்) தங்கியிருந்தேன். அப்போது அவர்களிடம், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இரவுத் தொழுகைக்காக) எழும்போது என்னையும் எழுப்பிவிடுங்கள்!\" என்று சொன்னேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இரவுத் தொழுகைக்காக) எழுந்த போது நான் எழுந்து அவர்களுக்கு இடப் பக்கத்தில் நின்றேன். உடனே அவர்கள் எனது கையைப் பிடித்துத் தமது வலப் பக்கத்தில் என்னை நிறுத்தினார்கள். நான் கண்ணயரும் போது எனது காதின் சோனையைப் பிடித்(து என்னை விழிக்கச் செய்)தார்கள். அப்போது பதினோரு ரக்அத்கள் தொழுதார்கள். பின்னர் கால்களை நட்டுவைத்துக் கைகளைக் கட்டிக் கொண்டு உட்கார்ந்தவாறே உறங்கினார்கள். அப்போது அவர்களின் குறட்டைச் சப்தத்தை நான் கேட்டேன். ஃபஜ்ர் நேரமானதும் (சுப்ஹுடைய சுன்னத்) இரண்டு ரக்அத்களைச் சுருக்கமாகத் தொழுதார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": "763.06",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் என் சிறிய தாயார் மைமூனா (ரலி) அவர்களிடம் (அவர்களது இல்லத்தில்) ஓர் இரவு தங்கினேன். அந்த இரவில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எழுந்து, கட்டித் தொங்க விடப்பட்டிருந்த தண்ணீர் பையிலிருந்து (தண்ணீரைச் சரித்து) சுருக்கமாக அங்கத் தூய்மை (உளூ) செய்தார்கள். (அவர்கள் சிறிதளவு தண்ணீரில் சுருக்கமாகவும் சிக்கனமாகவும் அங்கத் தூய்மை செய்ததை இப்னு அப்பாஸ் (ரலி) அவர்கள் சைகையால் வர்ணிக்கலானார்கள்.) நானும் எழுந்து நபி (ஸல்) அவர்கள் செய்ததைப் போன்றே (அங்கத் தூய்மை) செய்துவிட்டு வந்து அவர்களுக்கு இடப் பக்கத்தில் நின்றேன். உடனே அவர்கள் என்னை(ப் பிடித்து)ப் பின்பக்கமாகக் கொண்டுவந்து தமக்கு வலப் பக்கத்தில் நிறுத்தலானார்கள்; பிறகு தொழுதார்கள். பின்னர், படுத்து குறட்டைவிட்டு உறங்கினார்கள். பிறகு அவர்களிடம் பிலால் (ரலி) அவர்கள் வந்து (சுப்ஹுத்) தொழுகைக்காக அவர்களுக்கு அறிவிப்புக் கொடுத்தார்கள். அவர்கள் புறப்பட்டுச் சென்று (புதிதாக) அங்கத் தூய்மை செய்யாமலேயே சுப்ஹுத் தொழு(வித்)தார்கள். )இதன் அறிவிப்பாளர்களில் ஒருவரான) சுஃப்யான் (ரஹ்) அவர்கள் கூறுகிறார்கள்: (உறங்கிய பின் புதிதாக அங்கத் தூய்மை செய்யாமல் தொழும்) இந்த முறை நபி (ஸல்) அவர்களுக்கு மட்டும் உரியதாகும். ஏனெனில் \"நபி (ஸல்) அவர்களின் கண்கள் மட்டுமே உறங்குகின்றன; உள்ளம் உறங்குவதில்லை\" என நமக்குச் செய்தி எட்டியுள்ளது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": "763.07",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் ஓர் இரவில் என் சிறிய தாயார் மைமூனா (ரலி) அவர்களது இல்லத்தில் தங்கியிருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவில் எப்படித் தொழுகிறார்கள் என்பதைக் கவனிக்கக் காத்திருந்தேன். அவர்கள் எழுந்து சென்று சிறுநீர் கழித்து விட்டுப் பிறகு (திரும்பிவந்து) தமது முகத்தையும் கைகளையும் கழுவிவிட்டு உறங்கினார்கள். பின்னர் எழுந்து தண்ணீர் பையை நோக்கிச் சென்று அதன் சுருக்கை அவிழ்த்தார்கள். பிறகு உணவுத் தட்டில் அல்லது பெரிய பாத்திரத்தில் அதை ஊற்றி அதில் தமது கையை நுழைத்து நடுத்தரமாக அழகிய முறையில் அங்கத் தூய்மை (உளூ) செய்தார்கள். பிறகு நின்று தொழுதார்கள். நான் சென்று அவர்களுக்கு (இடப்) பக்கத்தில் நின்றுகொண்டேன். உடனே அவர்கள் என்னைப் பிடித்து தமக்கு வலப் பக்கத்தில் நிறுத்தினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பதிமூன்று ரக்அத்கள் தொழுது முடித்தார்கள். பிறகு குறட்டைவிட்டு உறங்கினார்கள். -(பொதுவாக) அவர்களது குறட்டைச் சப்தத்தை வைத்து அவர்கள் உறங்குகிறார்கள் என்பதை நாங்கள் அறிந்துகொள்வோம்.- பின்னர் (சுப்ஹுத்) தொழுகைக்குப் புறப்பட்டுச் சென்று தொழுதார்கள். அவர்கள் தமது \"தொழுகையில்\"அல்லது \"சஜ்தாவில்\" பின்வருமாறு கூறலானார்கள்: அல்லாஹும்மஜ்அல் ஃபீ கல்பீ நூரன். வ ஃபீ சம்ஈ நூரன். வ ஃபீ பஸரீ நூரன். வ அன் யமீனீ நூரன். வ அன் ஷிமாலீ நூரன். வ அமாமீ நூரன். வ கல்ஃபீ நூரன். வ ஃபவ்கீ நூரன். வ தஹ்தீ நூரன். வஜ்அல்லீ நூரா/ வஜ்அல்னீ நூரா. )பொருள்: இறைவா! என் இதயத்தில் ஒளியை ஏற்படுத்துவாயாக! என் செவியிலும் ஒளியை ஏற்படுத்துவாயாக. என் பார்வையிலும் ஒளியை ஏற்படுத்துவாயாக. என் வலப் பக்கத்திலும் ஒளியை ஏற்படுத்துவாயாக. என் இடப் பக்கத்திலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு முன்னாலும் ஒளியை ஏற்படுத்துவாயாக. எனக்குப் பின்னாலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு மேலேயும் ஒளியை ஏற்படுத்துவாயாக. எனக்குக் கீழேயும் ஒளியை ஏற்படுத்துவாயாக. \"எனக்கு (எல்லாத் திசைகளிலும்) ஒளியை ஏற்படுத்துவாயாக\" (அல்லது) \"என்னை ஒளிமயமாக்குவாயாக\".( - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. )அதன் அறிவிப்பாளர்களில் ஒருவரான) சலமா (ரஹ்) கூறினார்கள்: நான் குறைப் (ரஹ்) அவர்களைச் சந்தித்தபோது, \"இப்னு அப்பாஸ் (ரலி) அவர்கள் \"நான் என் சிறிய தாயார் மைமூனா (ரலி) அவர்களிடம் இருந்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்தார்கள்...\" என்று கூறிவிட்டு மேற்கண்ட ஹதீஸில் உள்ளவாறு குறிப்பிட்டார்கள்\" என்றார்கள். மேலும் \"என்னை ஒளிமயமாக ஆக்குவாயாக\" என்று (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாகவு)ம் ஐயப்பாடின்றி அறிவித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": "763.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": "763.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": "763.10",
			"text": "மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் பின்வருமாறு இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது: நான் ஓர் இரவில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தங்கியிருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தண்ணீர் பையை நோக்கிச் சென்று அதிலிருந்து தண்ணீர் ஊற்றி அங்கத் தூய்மை செய்தார்கள்; அதிகமாகத் தண்ணீரைப் பயன்படுத்தவுமில்லை; அங்கத்தூய்மையில் குறைவைக்கவுமில்லை. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளவாறே இடம்பெற்றுள்ளன. மேலும், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்றைய இரவில் பத்தொன்பது விஷயங்களை இறைவனிடம் வேண்டினார்கள்\" எனும் குறிப்பும் இடம்பெற்றுள்ளது. இதன் அறிவிப்பாளர்களில் ஒருவரான சலமா பின் குஹைல் (ரஹ்) அவர்கள் கூறினார்கள்: எனக்கு அந்தப் பத்தொன்பது விஷயங்களையும் குறைப் (ரஹ்) அவர்கள் அறிவித்தார்கள். அவற்றில் பன்னிரண்டு விஷயங்களை நான் மனனமிட்டுள்ளேன்; எஞ்சியவற்றை நான் மறந்துவிட்டேன். (அந்தப் பன்னிரண்டு விஷயங்கள் வருமாறு): அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹும்மஜ்அல் லீ ஃபீ கல்பீ நூரன். வஃபீ லிசானீ நூரன். வஃபீ சம்ஈ நூரன். வஃபீ பஸரீ நூரன். வ மின் ஃபவ்க்கீ நூரன். வ மின் தஹ்த்தீ நூரன். வ அய் யமீனீ நூரன். வ அன் ஷிமாலீ நூரன். வ மிம் பைனி யதைய்ய நூரன். வ மின் கல்ஃபீ நூரன். வஜ்அல் ஃபீ நஃப்சீ நூரன். வ அஃழிம் லீ நூரா\" என்று வேண்டினார்கள். )பொருள்: இறைவா! என் இதயத்தில் எனக்கு ஒளியை ஏற்படுத்துவாயாக. என் நாவிலும் ஒளியை ஏற்படுத்துவாயாக. என் செவியிலும் ஒளியை ஏற்படுத்துவாயாக. என் பார்வையிலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு மேலேயும் ஒளியை ஏற்படுத்துவாயாக. எனக்குக் கீழேயும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு வலப் பக்கத்திலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு இடப் பக்கத்திலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு முன்னாலும் ஒளியை ஏற்படுத்துவாயாக. எனக்குப் பின்னாலும் ஒளியை ஏற்படுத்து வாயாக. என் மனத்திலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு ஒளியை வலிமையாக்குவாயாக). அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": "763.11",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": "763.12",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் (ஓர் இரவில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (அவர்களது இல்லத்தில்) உறங்கினேன். அவர்கள் உறக்கத்திலிருந்து விழித்தெழுந்து பல் துலக்கி, அங்கத் தூய்மை (உளூ) செய்து, \"திண்ணமாக வானங்கள் மற்றும் பூமியின் படைப்(பு அமைப்)பிலும், இரவு-பகல் மாறி மாறி வருவதிலும் அறிவுடையோருக்குப் பல சான்றுகள் உள்ளன\" எனும் (3:190ஆவது) வசனத்தை, அந்த அத்தியாயத்தின் இறுதிவரை ஓதி முடித்தார்கள். பின்னர் எழுந்து நின்று இரண்டு ரக்அத்கள் தொழுதார்கள். அவற்றில் நீண்ட நேரம் நிலையில் நின்றார்கள்; ருகூஉச் செய்தார்கள்; சஜ்தாவும் செய்தார்கள். பிறகு திரும்பிச் சென்று குறட்டைவிட்டு உறங்கினார்கள். இவ்வாறே மூன்று முறை செய்து, ஆறு ரக்அத்கள் தொழுதார்கள். ஒவ்வொரு தடவையும் பல் துலக்கி, அங்கத்தூய்மை செய்து இந்த வசனங்களை ஓதினார்கள். பிறகு மூன்று ரக்அத் வித்ர் தொழுதார்கள். தொழுகை அறிவிப்பாளர் (சுப்ஹுத் தொழுகைக்காக) அறிவிப்புச் செய்ததும் (வீட்டிலிருந்து) புறப்பட்டுச் சென்றார்கள். அப்போது \"அல்லாஹும்மஜ்அல் ஃபீ கல்பீ நூரன். வஃபீ லிசானீ நூரன். வஜ்அல் ஃபீ சம்ஈ நூரன். வஜ்அல் ஃபீ பஸரீ நூரன். வஜ்அல் மின் கல்ஃபீ நூரன். வமின் அமாமீ நூரன். வஜ்அல் மின் ஃபவ்க்கீ நூரன். வமின் தஹ்த்தீ நூரன். அல்லாஹும்ம அஃத்தினீ நூரா\" என்று கூறினார்கள். )பொருள்: இறைவா! என் இதயத்தில் ஒளியை ஏற்படுத்துவாயாக. என் நாவிலும் ஒளியை ஏற்படுத்துவாயாக. என் செவியிலும் ஒளியை ஏற்படுத்துவாயாக. என் பார்வையிலும் ஒளியை ஏற்படுத்துவாயாக. எனக்குப் பின்னாலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு முன்னாலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு மேலேயும் ஒளியை ஏற்படுத்துவாயாக. எனக்குக் கீழேயும் ஒளியை ஏற்படுத்துவாயாக. இறைவா! எனக்கு ஒளியை வழங்குவாயாக). அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": "763.13",
			"text": "அதாஉ பின் அபீரபாஹ் (ரஹ்) அவர்கள் கூறியதாவது: இப்னு அப்பாஸ் (ரலி) அவர்கள் \"நான் ஓர் இரவில் என் சிறிய தாயார் மைமூனா (ரலி) அவர்களிடம் (அவர்களது இல்லத்தில்) தங்கினேன். அந்த இரவில் நபி (ஸல்) அவர்கள் கூடுதல் தொழுகையைத் தொழுவதற்காக எழுந்தார்கள். நபியவர்கள் தண்ணீர் பையை நோக்கிச் சென்று அங்கத்தூய்மை (உளூ) செய்துவிட்டு (வந்து) தொழுதார்கள். இவ்வாறு அவர்கள் செய்வதைக் கண்டதும் நானும் எழுந்து அந்தப் பையிலிருந்து (தண்ணீரைச் சரித்து) அங்கத்தூய்மை (உளூ) செய்துவிட்டு, அவர்களின் இடப் பக்கத்தில் நின்றேன். உடனே அவர்கள் தமது முதுகுக்குப் பின்னால் கையை நீட்டி எனது கையைப் பிடித்து அப்படியே தமது முதுகுக்குப் பின்னால் கொண்டுசென்று (தமக்கு) வலப் பக்கத்தில் என்னை நிறுத்தினார்கள்\" என்று கூறினார்கள். நான், \"கூடுதலான (நஃபில்) தொழுகையிலா இவ்வாறு நடந்தது?\" எனக் கேட்டேன். அதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள் \"ஆம்\" என்று பதிலளித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": "763.14",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: என்னை (என் தந்தை) அப்பாஸ் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம் அனுப்பி வைத்தார்கள். அப்போது நபியவர்கள் என் சிறிய தாயார் மைமூனா (ரலி) அவர்களது இல்லத்தில் இருந்தார்கள். நான் அந்த இரவில் அவர்களுடன் தங்கியிருந்தேன். நபி (ஸல்) அவர்கள் இரவில் தொழ நின்றார்கள். நானும் எழுந்து அவர்களுக்கு இடப் பக்கத்தில் நின்றேன். உடனே அவர்கள் தமது முதுகுக்குப் பின்னே என்னைப் பிடித்து வலப் பக்கத்திற்குக் கொண்டுசென்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் \"நான் என் சிறிய தாயார் மைமூனா (ரலி) அவர்களிடம் (அவர்களது இல்லத்தில்) இரவில் தங்கியிருந்தேன்\" என (இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாக) இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": "763.15",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": "764",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவில் பதிமூன்று ரக்அத்கள் தொழுவார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": "765",
			"text": "ஸைத் பின் காலித் அல்ஜுஹனீ (ரலி) அவர்கள் கூறியதாவது: நான் ஒரு நாள் இரவு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தொழுகையை (கண்விழித்து) கவனிக்கப்போகிறேன் எனச் சொல்லிக் கொண்டேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (முதலில்) சுருக்கமாக இரண்டு ரக்அத்கள் (உளூவின் காணிக்கையாகத்) தொழுதார்கள் (2+). பிறகு மிக மிக மிக நீளமாக இரண்டு ரக்அத்கள் தொழுதார்கள் (2+). பிறகு இரண்டு ரக்அத்கள் தொழுதார்கள் (2+). அவ்விரு ரக்அத்களும் அதற்கு முந்திய இரு ரக்அத்களையும்விடச் சுருக்கமாக இருந்தன. பிறகு இரண்டு ரக்அத்கள் தொழுதார்கள் (2+). அவ்விரு ரக்அத்களும் அதற்கு முந்திய இரு ரக்அத்களையும்விடச் சுருக்கமாகவே இருந்தன. பிறகு இரண்டு ரகஅத்கள் தொழுதார்கள் (2+). அவ்விரு ரக்அத்களும் அதற்கு முந்திய இரு ரக்அத்களையும்விடச் சுருக்கமாகவே இருந்தன. பிறகு இரண்டு ரக்அத்கள் தொழுதார்கள் (2+). அவ்விரு ரக்அத்களும் அதற்கு முந்திய இரு ரக்அத்களைவிடச் சுருக்கமாகவே இருந்தன. பிறகு (ஒரு ரக்அத்) வித்ர் தொழுதார்கள் (1=13). இவை பதிமூன்று ரக்அத்களாகும். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": "766",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஒரு பயணத்தில் இருந்தேன். நாங்கள் ஒரு நீர்நிலையின் படித்துறையைச் சென்றடைந்தோம். அப்போது அவர்கள், \"ஜாபிரே, நீ படித்துறையில் இறங்கி (ஒட்டகத்திற்கு நீர் புகட்டி உனது தேவையையும் பூர்த்தி செய்துகொள்கி)றாயா?\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஒட்டகத்திலிருந்து) இறங்கினார்கள். நான் படித்துறையில் இறங்கினேன். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது இயற்கைக் கடனை நிறைவேற்றச் சென்றார்கள். நான் அவர்களுக்காகத் தண்ணீர் எடுத்து வைத்தேன். அவர்கள் (திரும்பி) வந்து, அங்கத்தூய்மை (உளூ) செய்தார்கள். பிறகு எழுந்து, ஒரே ஆடையை அணிந்து, அதை (வலம் இடமாகத் தோள்கள் மீது) மாற்றிப் போட்டுக்கொண்டு தொழுதார்கள். நான் அவர்களுக்குப் பின்னால் (தொழுவதற்காக) நின்றேன். உடனே அவர்கள் எனது காதைப் பிடித்து (இழுத்து) என்னைத் தமக்கு வலப் பக்கத்தில் நிறுத்தினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": "767",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவில் தொழுவதற்காக நின்றால் முதலில் சுருக்கமாக இரண்டு ரக்அத்கள் தொழுவார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": "768",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் இரவில் தொழுவதற்காக நின்றால் முதலில் சுருக்கமாக இரண்டு ரக்அத்கள் தொழட்டும்.- இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": "769.01",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நடு இரவில் (தஹஜ்ஜுத்) தொழுவதற்காக எழுந்ததும் (பின்வருமாறு) பிரார்த்திப்பார்கள்: அல்லாஹும்ம, லக்கல் ஹம்து, அன்த்த நூருஸ் ஸமாவாத்தி வல்அர்ள். வ லக்கல் ஹம்து, அன்த்த கய்யாமுஸ் ஸமாவாத்தி வல்அர்ள். வ லக்கல் ஹம்து, அன்த்த ரப்புஸ் ஸமாவாத்தி வல்அர்ளி வமன் ஃபீஹின்ன. அன்த்தல் ஹக்கு. வ வஅதுக்கல் ஹக்கு. வ கவ்லுக்கல் ஹக்கு. வ லிகாஉக ஹக்குன். வல்ஜன்னத்து ஹக்குன். வந்நாரு ஹக்குன். வஸ்ஸாஅத்து ஹக்குன். அல்லாஹும்ம லக அஸ்லம்து, வ பிக ஆமன்து, வ அலைக தவக்கல்து, வ இலைக அனப்து, வ பிக காஸம்து, வ இலைக ஹாக்கம்து, ஃபஃக்ஃபிர்லீ மா கத்தம்து வ அக்கர்து வ அஸ்ரர்து வ அஃலன்து. அன்த இலாஹீ. லா இலாஹ இல்லா அன்த. (பொருள்: இறைவா! உனக்கே புகழ் அனைத்தும். வானங்கள் மற்றும் பூமியின் ஒளி நீயே. உனக்கே புகழ் அனைத்தும். வானங்கள் மற்றும் பூமி ஆகியவற்றை நிர்வகிப்பவன் நீயே. உனக்கே புகழ் அனைத்தும். வானங்கள், பூமி மற்றும் அவற்றிலுள்ளவற்றின் இறைவன் நீயே. நீ உண்மையே. உன் வாக்குறுதி உண்மையே. உனது கூற்று உண்மையே. உன் தரிசனம் உண்மை. சொர்க்கம் உண்மை. நரகம் உண்மை. மறுமை நாள் உண்மை. அல்லாஹ்வே! உனக்கே கட்டுப்பட்டேன். உன்மீதே நம்பிக்கை கொண்டுள்ளேன். உன்னையே சார்ந்துள்ளேன். உன்னிடமே திரும்புகிறேன். உன்னிடமே வழக்காடுவேன். உன்னிடமே நீதி கேட்பேன். எனவே, நான் முந்திச் செய்த, பிந்திச் செய்கிற, இரகசியமாகச் செய்த, பகிரங்கமாகச் செய்த பாவங்களை மன்னிப்பாயாக. நீயே என் இறைவன். உன்னைத் தவிர வேறு இறைவன் இல்லை.( - மேற்கண்ட ஹதீஸ் மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், இப்னு ஜுரைஜ் (ரஹ்) அவர்களது அறிவிப்பும் மாலிக் பின் அனஸ் (ரஹ்) அவர்களது அறிவிப்பும் இரண்டு சொற்றொடர்களில் தவிர வேறெதிலும் மாறுபட வில்லை. \"நிர்வகிப்பவன்\" என்பதைக் குறிக்க இப்னு ஜுரைஜின் அறிவிப்பில் (\"கய்யாம்\" என்பதற்கு பதிலாக) \"கய்யிம்\" எனும் சொல்லும் \"நான் இரகசியமாகச் செய்த\" என்பதைக் குறிக்க (\"வ அஸ்ரர்து\" என்பதற்கு பதிலாக) \"வ மா அஸ்ரர்து\" எனும் சொற்றொடரும் ஆளப்பட்டுள்ளன. இப்னு உயைனா (ரஹ்) அவர்களது அறிவிப்பில் சில கூடுதலான தகவல்கள் உள்ளன. மாலிக் மற்றும் இப்னு ஜுரைஜ் ஆகியோருக்குப் பல சொற்றொடர்களில் அன்னார் மாறுபடுகிறார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. இந்த அறிவிப்பாளர்களின் சொற்கள் மேற்கண்ட ஹதீஸ்களில் உள்ள அறிவிப்பாளர்களின் சொற்களுக்குக் கிட்டத்தட்ட நெருக்கமாகவே அமைந்துள்ளன. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": "769.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": "769.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": "770",
			"text": "அபூசலமா பின் அப்திர் ரஹ்மான் பின் அவ்ஃப் (ரஹ்) அவர்கள் கூறியதாவது: நான் இறைநம்பிக்கையாளர்களின் அன்னை ஆயிஷா (ரலி) அவர்களிடம், \"நபி (ஸல்) அவர்கள் இரவுத் தொழுகையைத் துவக்கியதும் முதலில் என்ன கூறுவார்கள்?\" என்று கேட்டேன். அதற்கு அவர்கள், \"நபி (ஸல்) அவர்கள் இரவுத் தொழுகையைத் துவக்கியதும் \"அல்லாஹும்ம ரப்ப ஜப்ராயீல வ மீக்காயீல வ இஸ்ராஃபீல, ஃபாத்திரஸ் ஸமாவாத்தி வல்அர்ளி, ஆலிமல் ஃகைபி வஷ்ஷஹாதத்தி, அன்த தஹ்குமு பய்ன இபாதிக ஃபீமா கானூ ஃபீஹி யக்தலிஃபூன். இஹ்தினீ லிமக்துலிஃப ஃபீஹி மினல் ஹக்கி பி இத்னிக, இன்னக தஹ்தீ மன் தஷாஉ இலா ஸிராதிம் முஸ்தகீம்\" என்று கூறுவார்கள்\" என்று பதிலளித்தார்கள். (பொருள்: இறைவா! (வானவர்களாகிய) ஜிப்ராயீல், மீக்காயீல், இஸ்ராஃபீல் ஆகியோரின் அதிபதியே! வானங்கள் மற்றும் பூமியை முன்மாதிரியின்றிப் படைத்தவனே! மறைவானவற்றையும் வெளிப்படையானவற்றையும் அறிந்தவனே! நீ உன் அடியார்களிடையே அவர்கள் கொண்டிருந்த கருத்துவேறுபாடுகள் குறித்து (மறுமையில்) தீர்ப்பு வழங்குவாய். (பிற மக்களால்) மாற்றுக் கருத்து கொள்ளப்பட்டாலும் சத்திய (மார்க்க)த்திலேயே உன் தயவால் என்னை நிலைத்திருக்கச் செய்வாயாக! நீ நாடியவர்களை நேரான வழியில் நீயே செலுத்துகிறாய்.( இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": "771.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": "771.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": "772",
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் ஓர் இரவில் (தஹஜ்ஜுத்) தொழுதேன். அதில் அவர்கள் \"அல்பகரா”” எனும் (இரண்டாவது) அத்தியாயத்தை ஓத ஆரம்பித்தார்கள். நான் \"அவர்கள் நூறு வசனம் முடிந்ததும் ருகூஉச் செய்துவிடுவார்கள்” என்று எண்ணினேன். ஆனால், அவர்கள் (நூறு வசனம் முடிந்த பின்னும்) தொடர்ந்து ஓதினார்கள். நான் \"அ(ந்த அத்தியாயத்)தை (இரண்டாகப் பிரித்து ஓதி இரண்டாவது) ரக்அத்தில் முடித்துவிடுவார்கள்\" என்று எண்ணினேன். ஆனால் (அதை முதல் ரக்அத்திலேயே) தொடர்ந்து ஓதினார்கள். நான் \"அவர்கள் அந்த அத்தியாயம் முடிந்ததும் ருகூஉச் செய்துவிடுவார்கள்” என்று எண்ணினேன். அவர்கள் (அந்த அத்தியாயம் முடிந்ததும்) \"அந்நிசா\" எனும் (4ஆவது) அத்தியாயத்தை ஆரம்பித்து ஓதினார்கள்; பிறகு ஆலு இம்ரான் எனும் (3ஆவது) அத்தியாயத்தை ஆரம்பித்து நிறுத்தி நிதானமாக ஓதினார்கள். அவற்றில் இறைவனைத் துதிப்பது பற்றிக் கூறும் வசனத்தை ஓதிச்செல்லும்போது (ஒதுவதை நிறுத்திவிட்டு), (சுப்ஹானல்லாஹ் - அல்லாஹ் தூயவன் என) இறைவனைத் துதித்தார்கள்; (இறையருளை) வேண்டுவது பற்றிக்கூறும் வசனத்தைக் கடந்து செல்லும்போது (ஓதுவதை நிறுத்திவிட்டு), (இறையருளை) வேண்டினார்கள். (இறை தண்டனையிலிருந்து) பாதுகாப்புக் கோருவது பற்றிக் கூறும் வசனத்தை ஓதிச் செல்லும்போது (ஓதுவதை நிறுத்திவிட்டு, இறைவனிடம்) பாதுகாப்புக் கோரினார்கள். பிறகு ருகூஉச் செய்தார்கள். அவர்கள் ருகூவில் \"சுப்ஹான ரப்பியல் அழீம்\" (மகத்துவ மிக்க என் இறைவன் தூயவன்) என்று கூறலானார்கள். அவர்கள் நிலையில் நின்ற அளவுக்கு ருகூஉச் செய்தார்கள். பின்னர் (ருகூவிலிருந்து நிமிரும்போது) \"சமிஅல்லாஹு லிமன் ஹமிதஹ்\" (அல்லாஹ் தன்னைப் புகழ்வோரின் புகழுரையை ஏற்கிறான்) என்று கூறிவிட்டுக் கிட்டத்தட்ட ருகூஉச் செய்த அளவுக்கு நீண்ட நேரம் நிலையில் நின்றிருந்தார்கள். பிறகு சஜ்தாச் செய்தார்கள். அதில் \"சுப்ஹான ரப்பியல் அஃலா\" (மிக்க மேலான என் இறைவன் தூயவன்) என்று கூறினார்கள். அவர்கள் நிலையில் நின்றிருந்த அளவுக்கு சஜ்தாச் செய்தார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் இப்னு ஜரீர் (ரஹ்) அவர்களது அறிவிப்பில், \"சமிஅல்லாஹு லிமன் ஹமிதஹ், ரப்பனா லக்கல் ஹம்து\" (அல்லாஹ் தன்னைப் புகழ்வோரின் புகழுரையை ஏற்கிறான்; எங்கள் இறைவா, உனக்கே புகழ் அனைத்தும் உரியது) என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள் எனக் கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": "773.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": "773.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": "774",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": "775",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": "776",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் உறங்கிக்கொண்டிருக்கும் போது அவரது தலையின் பின் பக்கத்தில் ஷைத்தான் மூன்று முடிச்சுகளைப் போட்டு விடுகிறான். ஒவ்வொரு முடிச்சிலும், \"இன்னும் உனக்கு நீண்ட இரவு இருக்கிறது (நன்றாக உறங்கு)\" என்று கூறி ஊதுகிறான். அவர் (அவனது போதனையைக் கேட்காமல் அதிகாலையில்) கண்விழித்து அல்லாஹ்வை நினைவுகூர்ந்தால் ஒரு முடிச்சு அவிழ்ந்துவிடுகிறது. அவர் அங்கத்தூய்மை (உளூ) செய்தால் இரண்டாவது முடிச்சு அவிழ்ந்துவிடுகிறது. அவர் (தஹஜ்ஜுத் அல்லது ஃபஜ்ர்) தொழுதுவிட்டால் முடிச்சுகள் முழுவதுமாக அவிழ்ந்துவிடுகின்றன. அவர் சுறுசுறுப்புடனும் நல்ல மனநிலையுடனும் காலைப் பொழுதை அடைவார். இல்லையென்றால் மந்தமான மனநிலையுடனும் சோம்பலுடனும் காலைப் பொழுதை அடைவார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": "777.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களுடைய இல்லங்களிலும் உங்கள் தொழுகைகளில் சிலவற்றைத் தொழுங்கள். இல்லங்களை (தொழுகை நடைபெறாத) சவக்குழிகளாக ஆக்கிவிடாதீர்கள். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": "777.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களுடைய இல்லங்களிலும் (கூடுதலான தொழுகைகளை) தொழுங்கள். இல்லங்களை சவக்குழிகளாக ஆக்கிவிடாதீர்கள்.-இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": "778",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": "779",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": "780",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": "781.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": "781.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": "782.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் பாய் ஒன்று இருந்தது. அதை அவர்கள் இரவில் ஓர் அறை போன்று அமைத்துக்கொண்டு அதனுள் தொழுவார்கள். (அதில் அவர்கள் தொழும்போது) அவர்களைப் பின்பற்றி மக்களும் தொழலாயினர். பகலில் அந்தப் பாயை விரிப்பாக பயன்படுத்துவார்கள். ஓர் இரவில் மக்கள் கூடிவிட்டனர். அப்போது அவர்கள் \"மக்களே! உங்களால் (நிரந்தரமாகச் செய்ய) முடிந்த நற்செயல்களையே கடைப்பிடித்து வாருங்கள். ஏனெனில், நீங்கள் சடையாதவரை அல்லாஹ்வும் சடைவதில்லை. நற்செயல்களில் அல்லாஹ்வுக்கு மிகவும் விருப்பமானது (எண்ணிக்கையில்) குறைவாக இருந்தாலும் (தொடர்ந்து செய்யப்படும்) நிலையான நற்செயலே ஆகும்\" என்று கூறினார்கள். முஹம்மத் (ஸல்) அவர்களின் குடும்பத்தார் ஒரு நற்செயலைச் செய்தால் அதை நிலையாக(த் தொடர்ந்து) செய்வார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": "782.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": "783.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": "783.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": "784.01",
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலுக்குள் வந்தபோது இரு தூண்களுக்கிடையில் நீண்ட கயிறு ஒன்று காணப்பட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இது என்ன?\" என்று கேட்டார்கள். அதற்கு மக்கள் \"ஸைனப் (ரலி) அவர்களுக்கு உரியதாகும்; அவர் தொழும்போது சோர்வடைந்தால் இந்தக் கயிற்றைப் பிடித்துக்கொள்வார்\" என்று கூறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இதை அவிழ்த்துவிடுங்கள். உங்களில் ஒருவர் உற்சாகமாக இருக்கும்போது தொழட்டும்; சோர்வடைந்தால் உட்கார்ந்துகொள்ளட்டும்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அனஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": "784.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": "785.01",
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஹவ்லா பின்த் துவைத் பின் ஹபீப் பின் அசத் பின் அப்தில் உஸ்ஸா எனும் பெண்மணி என்னைக் கடந்து சென்றார். அப்போது என் அருகில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இருந்தார்கள். நான் \"இவர் ஹவ்லா பின்த் துவைத் ஆவார்; இவர் இரவெல்லாம் உறங்க மாட்டார் (விடிய விடிய தொழுது கொண்டிருப்பார்) என மக்கள் கூறுகின்றனர்\" என்று சொன்னேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இரவில் உறங்குவதில்லையா? உங்களால் இயன்ற நற்செயலையே செய்துவாருங்கள். அல்லாஹ்வின் மீதாணையாக! நீங்கள் சலிப்படையாதவரை அல்லாஹ்வும் சலிப்படைவதில்லை\" என்று கூறினார்கள். இதை உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": "785.02",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: என்னிடம் ஒரு பெண்மணி இருந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வீட்டுக்கு) வந்து, \"இவர் யார்?\" என்று கேட்டார்கள். நான் \"இவர் (இன்னார்;) இவர் (இரவெல்லாம்) உறங்காமல் தொழுதுகொண்டே இருப்பார்\" என்று கூறினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நற்செயல்களில் உங்களால் இயன்றதையே செய்துவாருங்கள். அல்லாஹ்வின் மீதாணையாக! நீங்கள் சடைவடையாதவரை அல்லாஹ்வும் சடைவடையமாட்டான்\" என்று கூறினார்கள். ஒருவர் நிலையாகத் தொடர்ந்து செய்து வரும் நற்செயலே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு விருப்பமானதாக இருந்தது. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில், அபூஉசாமா (ரஹ்) அவர்களது அறிவிப்பில் \"அந்தப் பெண்மணி பனூஅசத் குலத்தைச் சேர்ந்தவர் ஆவார்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": "786",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் எவரேனும் தொழும்போது கண்ணயர்ந்துவிட்டால், அவர் தம்மைவிட்டுத் தூக்கம் அகலும்வரைத் தூங்கிவிடட்டும்! ஏனெனில், உங்களில் ஒருவர் உறங்கியவாறே தொழுவாரானால் அவர் (உணர்வில்லாமல்) பாவமன்னிப்புக் கோரப்போக, அவர் தம்மைத்தாமே ஏசி (சபித்து)விடக்கூடும்.- இதை ஆயிஷா (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": "787",
			"text": "ஹம்மாம் பின் முனப்பிஹ் (ரஹ்) அவர்கள் கூறியதாவது: இவை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து அபூஹுரைரா (ரலி) அவர்கள் எமக்கு அறிவித்த ஹதீஸ்களாகும். அவற்றில் இந்த ஹதீஸும் ஒன்றாகும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் இரவில் தொழும்போது (உறக்கம் மேலிட்டு) நாவில் குர்ஆன் வராமல் தடைபட்டு, தாம் என்ன சொல்கிறோம் என்பதை அவர் அறியாத நிலைக்குச் சென்று விடுவாரானால் அவர் படுத்து உறங்கட்டும்! இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": "788.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் இரவு நேரத்தில் (குர்ஆன் அத்தியாயங்கள் சிலவற்றை) ஓதிக்கொண்டிருப்பதை நபி (ஸல்) அவர்கள் செவியுற்றார்கள். அப்போது அவர்கள், \"அல்லாஹ், அவருக்குக் கருணை புரியட்டும்! இன்ன இன்ன அத்தியாயங்களிலிருந்து எனக்கு மறந்துவிட்டிருந்த இன்ன இன்ன வசனங்களை அவர் எனக்கு நினைவூட்டிவிட்டார்\" என்று சொன்னார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": "788.02",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: பள்ளிவாசலில் ஒரு மனிதர் (குர்ஆன்) ஓதிக்கொண்டிருப்பதைச் செவியுற்ற நபி (ஸல்) அவர்கள், \"அல்லாஹ், அவருக்குக் கருணைபுரிவானாக! (இன்ன அத்தியாயத்திலிருந்து) எனக்கு மறக்கவைக்கப்பட்டிருந்த இன்ன வசனத்தை அவர் எனக்கு நினைவூட்டிவிட்டார்\" என்று சொன்னார்கள். - இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": "789.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": "789.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": "790.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": "790.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": "790.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": "791",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": "792.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": "792.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": "792.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": "793.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": "793.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": "793.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": "793.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": "793.05",
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம், (நான் இனிய குரலில் குர்ஆன் ஓதுவதைப் பாராட்டி), \"நீங்கள் நேற்றிரவில் குர்ஆன் ஓதிக்கொண்டிருந்ததைச் செவியுற்றேன். அப்போது நீங்கள் என்னைப் பார்த்திருந்தால் (உங்களுக்கு மகிழ்ச்சியாய் இருந்திருக்கும்). (இறைத்தூதர்) தாவூத் (அலை) அவர்களுக்கு வழங்கப்பட்டிருந்த சங்கீதம் (போன்ற இனிய குரல்) ஒன்று உங்களுக்கு வழங்கப்பட்டுள்ளது\" என்று கூறினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": "794.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": "794.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": "794.03",
			"text": "மேற்கண்ட ஹதீஸ் இன்னும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் காலித் பின் அல்ஹாரிஸ் (ரஹ்) அவர்களது அறிவிப்பில், \"வாகனத்தின் மீது பயணம் செய்தபடி அல்ஃபத்ஹ் அத்தியாயத்தை ஒதிக்கொண்டிருந்தார்கள்\" என்று இடம் பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": "795.01",
			"text": "பராஉ (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் \"அல்கஹ்ஃப்\" எனும் (18ஆவது) அத்தியாயத்தை (தமது இல்லத்தில் அமர்ந்து) ஓதிக்கொண்டிருந்தார். அவருக்கு அருகில் நீண்ட இரு கயிறுகளால் குதிரையொன்று கட்டப்பட்டிருந்தது. அதை ஒரு மேகம் சூழ்ந்துகொண்டு வட்டமிட்டபடி நெருங்கத் தொடங்கியது. அதனால் குதிரை மிரள ஆரம்பித்தது. விடிந்தவுடன் அவர் நபி (ஸல்) அவர்களிடம் வந்து நடந்ததைத் தெரிவித்தார். அப்போது நபி (ஸல்) அவர்கள் \"குர்ஆன் ஓதியக் காரணத்தால் இறங்கிய அமைதிதான் அது\" என்று கூறினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": "795.02",
			"text": "பராஉ (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் தமது வீட்டில் வாகனப் பிராணி ஒன்று இருக்க, \"அல்கஹ்ஃப்\" எனும் (18ஆவது) அத்தியாயத்தை ஓதினார். உடனே அந்தப் பிராணி மிரள ஆரம்பித்தது. அந்த மனிதர் (திரும்பிப்) பார்த்தார். அப்போது மேகத்திரள் ஒன்று வந்து அவரை மூடிக்கொண்டது. இதை அந்த மனிதர் நபி (ஸல்) அவர்களிடம் சொன்னபோது நபி (ஸல்) அவர்கள், \"இன்னாரே, நீர் தொடர்ந்து ஓதிக்கொண்டேயிரு(ந்திருக்க வேண்டு)ம். அந்த மேகம் குர்ஆனின் வசனங்களை ஓதியதற்காக (இறைவனிடமிருந்து உம்மீது) இறங்கிய அமைதி(ச் சின்னம்) ஆகும்\" என்று சொன்னார்கள்.-இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் (\"மிரள ஆரம்பித்தது\" என்பதற்கு பதிலாக) \"குதிக்கலாயிற்று\" என இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": "795.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": "796",
			"text": "உசைத் பின் ஹுளைர் (ரலி) அவர்கள் கூறியதாவது: நான் ஓர் இரவில் எனது பேரீச்சங்(கனிகளை உலரவைக்கும்) களத்தில் குர்ஆன் ஓதிக் கொண்டிருந்தேன். அப்போது எனது குதிரை கடுமையாக மிரண்டது. நான் தொடர்ந்து ஓதிக்கொண்டே இருந்தேன். மீண்டும் குதிரை மிரண்டது. தொடர்ந்து நான் ஓதிக் கொண்டேயிருந்தேன். மீண்டும் அது மிரண்டது. (அங்கு படுத்திருந்த என் மகன்) யஹ்யாவை அந்தக் குதிரை மிதித்துவிடுமோ என்று நான் அஞ்சிய போது அதை நோக்கி எழுந்து சென்றேன். அங்கு மேகம் போன்றதொரு பொருளை என் தலைக்கு மேலே கண்டேன். அதில் விளக்குகள் போன்ற (பிரகாசிக்கும்) பொருள்கள் இருந்தன. நான் பார்த்தவுடன் அது வானில் உயர்ந்து (என் கண்ணைவிட்டு மறைந்து)விட்டது; பிறகு நான் அதைக் காணமுடியவில்லை. காலையில் நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று \"அல்லாஹ்வின் தூதரே! நான் நேற்றிரவு பாதி இரவில் எனது பேரீச்சங்களத்தில் குர்ஆன் ஓதிக்கொண்டி ருக்கையில் என் குதிரை கடுமையாக மிரண்டது\" என்று (நடந்ததைச்) சொன்னேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இப்னு ஹுளைரே, தொடர்ந்து ஓதியிருக்கலாமே?\" என்று கேட்டார்கள். \"நான் தொடர்ந்து ஓதினேன். மீண்டும் எனது குதிரை மிரண்டது\" என்று நான் சொன்னேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இப்னு ஹுளைரே, தொடர்ந்து ஓதியிருக்கலாமே?\" என்று கேட்டார்கள். \"நான் தொடர்ந்து ஓதினேன். மீண்டும் எனது குதிரை மிரண்டது\" என்று சொன்னேன். \"இப்னு ஹுளைரே, தொடர்ந்து ஓதியிருக்கலாமே!\" என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மீண்டும்) கூறியபோது, \"(என் மகன்) யஹ்யாவைக் குதிரை மிதித்துவிடுமோ என்று அஞ்சினேன். அவன் அதன் அருகில் இருந்தான். எனவே, நான் திரும்பிச் சென்றேன். நான் (எனது தலையை உயர்த்தி வானைப் பார்த்தபோது) அங்கு மேகம் போன்றதொரு பொருளைக் கண்டேன். அதில் விளக்குகள் போன்ற (பிரகாசிக்கும்) பொருள்கள் இருந்தன. நான் பார்த்தவுடன் அது வானில் உயர்ந்து (என் கண்ணைவிட்டு மறைந்து)விட்டது; பிறகு நான் அதைக் காணவில்லை\" என்று கூறினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உன் குரலைக் கேட்டு நெருங்கி வந்த வானவர்கள்தாம் அவர்கள். நீர் தொடர்ந்து ஓதியிருந்தால் காலையில் மக்களும் அதைப் பார்த்திருப்பார்கள். மக்களைவிட்டும் அது மறைந்திருக்காது\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": "797.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனை(ப் பார்த்தும், மனனமிட்டும்) ஓதுகின்ற இறைநம்பிக்கையாளரின் நிலையானது நாரத்தைப் பழத்தின் நிலையைப் போன்றதாகும். அதன் வாசனையும் நன்று; சுவையும் நன்று. (மற்ற நற்செயல்கள் புரிந்து கொண்டு) குர்ஆன் ஓதாமலிருக்கும் இறை நம்பிக்கையாளரின் நிலையானது, பேரீச்சம் பழத்தின் நிலையைப் போன்றதாகும். அதற்கு வாசனை கிடையாது. (ஆனால்) அதன் சுவை நன்று. நயவஞ்சகனாகவும் இருந்துகொண்டு குர்ஆனையும் ஓதிவருகின்றவரின் நிலையானது, துளசிச் செடியின் நிலையை ஒத்திருக்கின்றது. அதன் வாசனை நன்று; சுவையோ கசப்பு. நயவஞ்சகனாகவும் இருந்துகொண்டு குர்ஆனையும் ஓதாமலிருப்பவரின் நிலையானது, குமட்டிக் காயின் நிலையை ஒத்திருக்கிறது. அதற்கு வாசனையும் கிடையாது; சுவையோ கசப்பு. இதை அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ஹம்மாம் (ரஹ்) அவர்களது அறிவிப்பில் \"நயவஞ்சகன்\" என்பதற்கு பதிலாக \"தீயவன்\" எனும் சொல் இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 1861,
			"arabicnumber": "797.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 1862,
			"arabicnumber": "798.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 1863,
			"arabicnumber": "798.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 1864,
			"arabicnumber": "799.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உபை பின் கஅப் (ரலி) அவர்களிடம், \"உங்களுக்கு (குர்ஆன் அத்தியாயத்தை) ஓதிக்காட்டுமாறு அல்லாஹ் என்னைப் பணித்துள்ளான்\" என்று சொன்னார்கள். உபை (ரலி) அவர்கள், \"என் பெயரை அல்லாஹ் தங்களிடம் குறிப்பிட்டானா?\" என (பெருமிதத்துடன்) கேட்டார்கள். \"(ஆம்) அல்லாஹ், உங்கள் பெயரை என்னிடம் குறிப்பிட்டான்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பதிலளித்தார்கள். இதைக் கேட்டு உபை பின் கஅப் (ரலி) அவர்கள் (ஆனந்த மேலீட்டால்) அழலானார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 1865,
			"arabicnumber": "799.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 1866,
			"arabicnumber": "799.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 1867,
			"arabicnumber": "800.01",
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: )ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம், \"எனக்குக் குர்ஆனை ஓதிக் காட்டுங்கள்\" என்று சொன்னார்கள். நான், \"தங்கள்மீதே குர்ஆன் அருளப்பட்டுக்கொண்டிருக்க, தங்களுக்கே நான் ஓதிக் காட்டுவதா?\" என்று கேட்டேன். அதற்கு அவர்கள், \"நான் பிறரிடமிருந்து அதைக் கேட்க விரும்புகிறேன்\" என்று சொன்னார்கள். ஆகவே, நான் அவர்களுக்கு \"அந்நிசா\" எனும் (நான்காவது) அத்தியாயத்தை ஓதிக் காட்டினேன். \"ஒவ்வொரு சமுதாயத்திலிருந்தும் (அவர்களுடைய நபியாகிய) சாட்சியை நாம் (மறுமையில்) கொண்டு வரும்போதும், (நபியே!) உங்களை இவர்களுக்கெதிரான சாட்சியாகக் கொண்டு வரும்போதும் (இவர்களின் நிலை) எப்படியிருக்கும்?\" எனும் (4:41ஆவது) வசனத்தை நான் அடைந்தபோது \"தலையை உயர்த்தினேன்\" அல்லது \"எனக்குப் பக்கத்திலிருந்த ஒருவர் என்னைத் தொட்டுணர்த்தியபோது நான் தலையை உயர்த்தினேன்\". அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் கண்களில் கண்ணீர் வழிந்து கொண்டிருந்ததைக் கண்டேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ஹன்னாத் (ரஹ்) அவர்களது அறிவிப்பில் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொற்பொழிவு மேடை (மிம்பர்) மீதிருந்தபடி என்னிடம் \"எனக்கு (குர்ஆனை) ஓதிக் காட்டுங்கள்\" என்று கூறினார்கள்\" என (அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாக) அதிகப்படியாக இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 1868,
			"arabicnumber": "800.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 1869,
			"arabicnumber": "800.03",
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் என்னிடம், \"எனக்கு (குர்ஆனை) ஓதிக் காட்டுங்கள்!\" என்று சொன்னார்கள். நான், \"தங்கள்மீதே குர்ஆன் அருளப்பட்டுக்கொண்டிருக்க, தங்களுக்கே நான் ஓதிக் காட்டுவதா?\" என்று கேட்டேன். அதற்கு அவர்கள், \"நான் பிறரிடமிருந்து அதைக் கேட்க விரும்புகிறேன்\" என்று சொன்னார்கள். ஆகவே, நான் அவர்களுக்கு \"அந்நிசா\" எனும் (நான்காவது) அத்தியாயத்தை ஆரம்பம் முதல் \"ஒவ்வொரு சமுதாயத்திலிருந்தும் (அவர்களுடைய நபியாகிய) சாட்சியை நாம் (மறுமையில்) கொண்டுவரும்போதும், (நபியே!) உங்களை இவர்களுக்கெதிரான சாட்சியாகக் கொண்டுவரும்போதும் (இவர்களின் நிலை) எப்படியிருக்கும்?\" (4:41) என்பதுவரை ஓதிக் காட்டினேன். அதைக் கேட்டு அவர்கள் அழுதார்கள். இதை இப்ராஹீம் அந்நகஈ (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மிஸ்அர் (ரஹ்) அவர்கள் வழியாக மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் பின்வருமாறு கூறியதாக இடம்பெற்றுள்ளது: நபி (ஸல்) அவர்கள் \"நான் அவர்களிடையே (உயிருடன்) இருந்தவரையில் அவர்களை நான் கண்காணித்துக்கொண்டிருந்தேன்\"என்று கூறினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 1870,
			"arabicnumber": "801.01",
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நான் (சிரியா நாட்டின் பிரபல நகரமான) ஹிம்ஸில் இருந்தேன். அப்போது மக்களில் ஒருவர், \"எங்களுக்கு (குர்ஆனை) ஓதிக் காட்டுங்கள்!\" என்று சொன்னார். நான் \"யூசுஃப்\" எனும் (12ஆவது) அத்தியாயத்தை ஓதிக்காட்டினேன். அப்போது ஒரு மனிதர் (அதை ஆட்சேபிக்கும் விதமாக) \"அல்லாஹ்வின் மீதாணையாக! இவ்வாறு இந்த அத்தியாயம் அருளப்படவில்லை\" என்று கூறினார். நான், \"உமக்கு நாசம் உண்டாகட்டும்! அல்லாஹ்வின் மீதாணையாக! (இவ்வாறுதான்) நான் இந்த அத்தியாயத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முன்னிலையில் ஓதினேன். அவர்களும், \"மிகச் சரியாக ஓதினாய்\" என்று கூறினார்கள்\"என்று பதிலளித்தேன். (ஆட்சேபிக்க வந்த) அந்த மனிதருடன் நான் பேசிக் கொண்டிருந்தபோது அவரது வாயிலிருந்து மதுவின் வாடை வருவதைக் கண்டேன். \"மதுவையும் அருந்திக்கொண்டு அல்லாஹ்வின் வேதத்தை மறுக்கவும் முனைகிறாயா? (மது அருந்திய குற்றத்திற்காக) நீ சாட்டையடி பெறாமல் இந்த இடத்திலிருந்து நகர முடியாது\" என்று கூறிவிட்டு, அவருக்குச் சாட்டையடி தண்டனையை நிறைவேற்றினேன். இதை அல்கமா பின் கைஸ் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் இன்னும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், அபூமுஆவியா (ரஹ்) அவர்களது அறிவிப்பில், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம் \"மிகச் சரியாக ஓதினாய்\" என்று கூறினார்கள்\" எனும் தகவல் இடம்பெறவில்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 1871,
			"arabicnumber": "801.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 1872,
			"arabicnumber": "802",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உங்களில் ஒருவர் தம் வீட்டாரிடம் செல்கையில் வீட்டில் மூன்று பெரிய கொழுத்த சினை ஒட்டகங்கள் காணப்படுவதை விரும்புகிறாரா?\" என்று கேட்டார்கள். நாங்கள் \"ஆம்\" என்று பதிலளித்தோம். அப்போது அவர்கள், \"உங்களில் ஒருவர் தமது தொழுகையில் மூன்று வசனங்களை ஓதுவது மூன்று பெரிய கொழுத்த சினை ஒட்டகங்களைவிடச் சிறந்ததாகும்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 1873,
			"arabicnumber": "803",
			"text": "உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (மஸ்ஜிதுந் நபவீ பள்ளிவாசலின்) திண்ணையில் இருந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் புறப்பட்டு வந்தார்கள். அப்போது \"உங்களில் எவர் ஒவ்வொரு நாள் காலையிலும் \"புத்ஹான்\" அல்லது \"அகீக்\" (சந்தைக்குச்) சென்று பாவம் புரியாமலும் உறவைத் துண்டிக்காமலும் பருத்த திமில்கள் கொண்ட இரு ஒட்டகங்களுடன் திரும்பி வருவதை விரும்புவார்?\" என்று கேட்டார்கள். \"நாங்கள் (அனைவருமே) அதை விரும்புவோம்\" என்று நாங்கள் பதிலளித்தோம். அதற்கு அவர்கள், \"உங்களில் ஒருவர் காலையில் பள்ளிவாசலுக்குப் புறப்பட்டுச் சென்று அல்லாஹ்வின் வேதத்திலிருந்து இரு வசனங்களைக் \"கற்றுக்கொள்வது\" அல்லது \"ஓதுவது\" இரு ஒட்டகங்களைவிடச் சிறந்ததாகும். மூன்று வசனங்கள் மூன்று ஒட்டகங்களைவிடவும்,நான்கு வசனங்கள் நான்கு ஒட்டகங்களைவிடவும் சிறந்ததாகும். இவ்வாறு எத்தனை வசனங்கள் ஓதுகின்றாரோ அந்த அளவு ஒட்டகங்களைவிடச் சிறந்ததாக அமையும்\" என்று கூறினார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 1874,
			"arabicnumber": "804.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: குர்ஆனை ஓதிவாருங்கள். ஏனெனில், குர்ஆன் ஓதிவருபவர்களுக்கு அது மறுமையில் வந்து (இறைவனிடம்) பரிந்துரை செய்யும். இரு ஒளிச்சுடர்களான \"அல்பகரா\" மற்றும் \"ஆலு இம்ரான்\" ஆகிய இரு அத்தியாயங்களையும் ஓதிவாருங்கள். ஏனெனில், அவை மறுமை நாளில் நிழல்தரும் மேகங்களைப் போன்றோ அல்லது அணி அணியாகப் பறக்கும் பறவைக் கூட்டங்களைப் போன்றோ வந்து தம்மோடு தொடர்புள்ளவர்களுக்காக (இறைவனிடம்) வாதாடும். \"அல்பகரா\" அத்தியாயத்தை ஓதிவாருங்கள். அதைக் கையாள்வது வளம் சேர்க்கும். அதைக் கைவிடுவது இழப்பைத் தரும். இவ்வத்தியாயத்திற்கு முன் சூனியக்காரர்கள் செயலிழந்துபோவார்கள். இதை அபூஉமாமா அல்பாஹிலீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) முஆவியா பின் சல்லாம் (ரஹ்) அவர்கள் கூறுகிறார்கள்: )இந்த ஹதீஸின் மூலத்திலுள்ள) \"அல் பத்தலா\" எனும் சொல்லுக்கு \"சூனியக்காரர்கள்\" என்று பொருள் என எனக்குத் தகவல் கிட்டியது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் (அவை மேகங்களைப் போன்று அல்லது பறவைக் கூட்டங்களைப் போன்று என்பதற்கு பதிலாக) \"அவை மேகங்களைப் போன்றும் பறவைக் கூட்டங்களைப் போன்றும் வந்து வாதாடும்\" என்று இடம்பெற்றுள்ளது. இந்த அறிவிப்பில் முஆவியா பின் சல்லாம் (ரஹ்) அவர்கள் தமக்குக் கிட்டியதாகக் கூறிய சொற்பொருள் இடம்பெறவில்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 1875,
			"arabicnumber": "804.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 1876,
			"arabicnumber": "805",
			"text": "நவ்வாஸ் பின் சம்ஆன் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள், \"மறுமை நாளில் குர்ஆனும் அதன்படி செயலாற்றியவர்களும் அழைத்து வரப்படுவர். அப்போது \"அல்பகரா\"அத்தியாயமும் \"ஆலு இம்ரான்\" அத்தியாயமும் முன்னே வரும்\" என்று கூறிவிட்டு, இ(வ்விரு அத்தியாயங்களும் முன்னே வருவ)தற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பின்வரும்) மூன்று உவமைகளைக் கூறினார்கள். அவற்றை நான் இதுவரை மறந்திடவில்லை. அவ்விரு அத்தியாயங்களும் (நிழல் தரும்) மேகங்களைப் போன்று, அல்லது நடுவே ஒளியுள்ள இரு கரும் நிழல்களைப் போன்று, அல்லது அணி அணியாகப் பறக்கும் இரு பறவைக் கூட்டங்களைப் போன்று (முன்னே வந்து) தம்மைக் கையாண்டவருக்காக (இறைவனிடம்) வாதாடும். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 1877,
			"arabicnumber": "806",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: )ஒரு முறை) நபி (ஸல்) அவர்களிடம் (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் அமர்ந்திருந்தபோது தமக்கு மேலிருந்து ஒரு சப்தம் வருவதைக் கேட்டார் அவர். அப்போது வானத்தை அண்ணாந்து பார்த்த ஜிப்ரீல் (அலை) அவர்கள், \"இதோ, வானில் இதுவரை திறக்கப்பட்டிராத ஒரு கதவு இப்போது திறக்கப்பட்டிருக்கிறது. (அதன் சப்தமே இப்போது கேட்டது.)\" என்று கூறினார்கள். அந்தக் கதவு வழியாக ஒரு வானவர் இறங்கி (நபியவர்களிடம்) வந்தார். அப்போது ஜிப்ரீல் (அலை) அவர்கள் \"இதோ இந்த வானவர் இப்போதுதான் பூமிக்கு இறங்கி வந்திருக்கிறார். இதற்கு முன் எப்போதும் அவர் பூமிக்கு இறங்கியதேயில்லை\" என்று கூறினார்கள். அவ்வானவர் சலாம் கூறிவிட்டு, \"உங்களுக்கு முன் எந்த இறைத்தூதருக்கும் வழங்கப் பெற்றிராத இரு ஒளிச்சுடர்கள் உங்களுக்கு வழங்கப்பெற்றுள்ள நற்செய்தியைப் பெறுங்கள். \"அல்ஃபாத்திஹா\" அத்தியாயமும் \"அல்பகரா\" அத்தியாயத்தின் இறுதி வசனங்களுமே அவை. அவற்றிலுள்ள (பிரார்த்தனை வரிகளில்) எதை நீங்கள் ஓதினாலும் அது உங்களுக்கு வழங்கப் பெறாமல் இருப்பதில்லை\"என்று கூறினார். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 1878,
			"arabicnumber": "807.01",
			"text": "அப்துர் ரஹ்மான் பின் யஸீத் (ரஹ்) அவர்கள் கூறியதாவது: நான் அபூமஸ்ஊத் (உக்பா பின் ஆமிர் - ரலி) அவர்களை இறையில்லம் (கஅபா) அருகில் சந்தித்தேன். அவர்களிடம் \"அல்பகரா அத்தியாயத்தின் இரு வசனங்கள் குறித்துத் தாங்கள் அறிவித்த ஹதீஸ் எனக்கு எட்டியது\" என்று கூறினேன். அதற்கு அபூமஸ்ஊத் (ரலி) அவர்கள், \"ஆம்; அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"எவர் அல்பகரா அத்தியாயத்தின் இறுதி இரு வசனங்களை இரவில் ஓதுகிறாரோ அவருக்கு அந்த இரண்டுமே போதும்\" எனக் கூறினார்கள்\" என்றார்கள். - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 1879,
			"arabicnumber": "807.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 1880,
			"arabicnumber": "808.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 1881,
			"arabicnumber": "808.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 1882,
			"arabicnumber": "808.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 1883,
			"arabicnumber": "809.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: \"அல்கஹ்ஃப்\" எனும் (18ஆவது) அத்தியாயத்தின் ஆரம்பப் பத்து வசனங்களை மனனம் செய்திருப்பவர் (பெருங்குழப்பவாதியான) தஜ்ஜாலிடமிருந்து பாதுகாக்கப்படுவார். இதை அபுத்தர்தா (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ஷுஅபா (ரஹ்) அவர்களது அறிவிப்பில், \"அல்கஹ்ப் அத்தியாயத்தின் இறுதிப் பத்து வசனங்களை மனனம் செய்திருப்பவர்\" என்று இடம்பெற்றுள்ளது. ஹம்மாம் (ரஹ்) அவர்களது அறிவிப்பில், \"அல்கஹ்ஃப் அத்தியாயத்தின் ஆரம்பப் பத்து வசனங்களை...\" என்று இடம்பெற்றுள்ளது. ஹிஷாம் (ரஹ்) அவர்களது அறிவிப்பிலும் இவ்வாறே இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 1884,
			"arabicnumber": "809.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 1885,
			"arabicnumber": "810",
			"text": "உபை பின் கஅப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னிடம்), \"அபுல்முன்திர், இறைவேதத்தில் உமக்குத் தெரிந்த வசனங்களிலேயே எந்த வசனம் மிகவும் மகத்தானது என்று தெரியுமா?\" எனக் கேட்டார்கள். நான் \"அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்\" என்று கூறினேன். அவர்கள் \"அபுல்முன்திர், இறைவேதத்தில் உமக்குத் தெரிந்த வசனங்களிலேயே எந்த வசனம் மிகவும் மகத்தானது என்று தெரியுமா?\" என (மீண்டும்) கேட்டார்கள். நான் \"அல்லாஹு லாயிலாஹ இல்லாஹுவல் ஹய்யுல் கய்யூம்... எனத் தொடங்கும் (2:255 ஆவது) வசனம்\" என்று விடையளித்தேன். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மகிழ்ச்சியோடு) எனது நெஞ்சில் (ஓர் அடி) அடித்துவிட்டு \"அல்லாஹ்வின் மீதாணையாக! உமது கல்வியாற்றல் உம்மை நெகிழச் செய்யட்டும் (வாழ்த்துகள்), அபுல்முன்திரே!\" என்றார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 1886,
			"arabicnumber": "811.01",
			"text": "அபுத்தர்தா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (மக்களை நோக்கி), \"ஓர் இரவில் குர்ஆனின் மூன்றில் ஒரு பகுதியை உங்களில் ஒருவரால் ஓத முடியாதா?\" என்று கேட்டார்கள். \"(ஒரே இரவில்) எவ்வாறு குர்ஆனின் மூன்றிலொரு பகுதியை ஓத இயலும்?\" என்று மக்கள் கேட்டார்கள். நபி (ஸல்) அவர்கள் \"குல் ஹுவல்லாஹு அஹத் (என்று தொடங்கும் 112ஆவது அத்தியாயம்) குர்ஆனின் மூன்றிலொரு பங்கிற்கு ஈடானதாகும்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 1887,
			"arabicnumber": "811.02",
			"text": "மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"அல்லாஹ் குர்ஆனை மூன்று பகுதிகளாகப் பிரித்தான். அவற்றில் \"குல் ஹுவல்லாஹு அஹத்\" (எனத் தொடங்கும்112ஆவது அத்தியாயத்)தை குர்ஆனின் ஒரு பகுதியாக ஆக்கினான்\" என்று நபி (ஸல்) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 1888,
			"arabicnumber": "812.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: )ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எங்களிடம், \"மக்களே!) ஒன்று கூடுங்கள்; நான் உங்களுக்குக் குர்ஆனின் முன்றிலொரு பகுதியை ஓதிக் காட்டப் போகிறேன்\" என்று கூறினார்கள். அப்போது மக்கள் ஒன்றுகூடினர். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எங்களிடையே) புறப்பட்டு வந்து \"குல் ஹுவல்லாஹு அஹத்\" (எனத் தொடங்கும் 112ஆவது) அத்தியாயத்தை ஓதிக் காட்டினார்கள். பிறகு (தமது இல்லத்திற்குள்) சென்றுவிட்டார்கள். அப்போது எங்களில் சிலர் சிலரிடம், \"அவர்களுக்கு வானிலிருந்து ஏதேனும் செய்தி வந்திருக்கிறது போலும். அதன் காரணமாகவே அவர்கள் உள்ளே சென்றுவிட்டார்கள் என்று கருதுகிறேன்\" என்றனர். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெளியே வந்து \"நான் (சற்று முன்) உங்களிடம் குர்ஆனின் மூன்றிலொரு பகுதியை ஓதிக் காட்டுவேன் எனக் குறிப்பிட்டேன். அறிக: அந்த (112ஆவது) அத்தியாயம் குர்ஆனின் மூன்றிலொரு பகுதிக்கு ஈடானதேயாகும்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 1889,
			"arabicnumber": "812.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 1890,
			"arabicnumber": "813",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு மனிதரை படைப் பிரிவொன்றுக்குத் தளபதியாக்கி அனுப்பினார்கள். அவர் தமது தொழுகையில் தம் தோழர்களுக்கு (குர்ஆன் வசனங்களை) ஓதி (தொழுவித்து)வந்தார்; (ஒவ்வொரு முறையும்) ஓதி முடிக்கும்போது \"குல் ஹுவல்லாஹு அஹத்\" எனும் (112ஆவது) அத்தியாயத்துடன் முடிப்பார். அப்படையினர் திரும்பிவந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் இது குறித்துத் தெரிவிக்கப்பட்டது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"எதற்காக இப்படிச் செய்கிறார் என அவரிடமே கேளுங்கள்\" என்று கூற, அவர்களும் அவரிடம் கேட்டனர். அவர், \"ஏனெனில், அந்த அத்தியாயம் பேரருளாளனின் (ஏகத்துவப்) பண்புகளை எடுத்தியம்புகிறது. நான் அதை (அதிகமாக) ஓதுவதை விரும்புகிறேன்\"என்று சொன்னார். (இதைக் கேள்விப்பட்ட) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ் அவரை நேசிக்கிறான் என அவருக்குத் தெரிவியுங்கள்\" என்று கூறினார்கள். இதை நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்களால் வளர்க்கப்பட்ட அம்ரா பின்த் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 1891,
			"arabicnumber": "814.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 1892,
			"arabicnumber": "814.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 1893,
			"arabicnumber": "814.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 1894,
			"arabicnumber": "815.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 1895,
			"arabicnumber": "815.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 1896,
			"arabicnumber": "816",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 1897,
			"arabicnumber": "817.01",
			"text": "ஆமிர் பின் வாஸிலா (ரஹ்) அவர்கள் கூறியதாவது: நாஃபிஉ பின் அப்தில் ஹாரிஸ் (ரலி) அவர்கள், (கலீஃபா) உமர் (ரலி) அவர்களை உஸ்ஃபான் எனுமிடத்தில் சந்தித்தார்கள். (இக்காலகட்டத்தில்) உமர் (ரலி) அவர்கள் நாஃபிஉ (ரலி) அவர்களை மக்காவின் ஆளுநராக நியமித்திருந்தார்கள். உமர் (ரலி) அவர்கள் (நாஃபிஉ (ரலி) அவர்களிடம்) \"நீங்கள் இந்தப் பள்ளத்தாக்கு (மக்கா)வாசிகளுக்கு எவரை ஆளுநராக ஆக்கினீர்கள்?\" என்று கேட்டார்கள். அதற்கு நாஃபிஉ (ரலி) அவர்கள், \"(அப்துர் ரஹ்மான்) இப்னு அப்ஸா (ரலி) அவர்களை\" என்று பதிலளித்தார்கள். உமர் (ரலி) அவர்கள், \"இப்னு அப்ஸா யார்?\" எனக் கேட்டார்கள். நாஃபிஉ (ரலி) அவர்கள், \"எங்களால் விடுதலை செய்யப்பட்ட எங்கள் (முன்னாள்) அடிமைகளில் ஒருவர்\" என பதிலளித்தார்கள். அதற்கு உமர் (ரலி) அவர்கள், \"அவர்களுக்கு ஒரு முன்னாள் அடிமையையா ஆட்சித் தலைவராக்கினீர்?\" என்று கேட்டார்கள். அதற்கு நாஃபிஉ (ரலி) அவர்கள், \"அவர் (இப்னு அப்ஸா) இறை வேதத்தை அறிநதவர்; பாகப் பிரிவினைச் சட்டங்களை அறிந்தவர்\" என்று கூறினார்கள். (இதைக் கேட்ட) உமர் (ரலி) அவர்கள் \"அறிந்துகொள்க: அல்லாஹ் இந்த வேதத்தின் மூலம் சிலரை உயர்த்துகிறான்; வேறு சிலரைத் தாழ்த்துகிறான்\" என்று உங்கள் நபி (ஸல்) அவர்கள் கூறியுள்ளார்கள். (இப்னு அப்ஸா வேத அறிவினால் மேன்மை பெற்றார்)\" என்று சொன்னார்கள். - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"நாஃபிஉ பின் அல்ஹாரிஸ் அல்குஸாஈ (ரலி) அவர்கள் உமர் பின் அல்கத்தாப் (ரலி) அவர்களை உஸ்ஃபான் என்னுமிடத்தில் சந்தித்தார்கள்\" என ஹதீஸ் தொடங்குகிறது. மற்றவை மேற்கண்ட ஹதீஸில் உள்ளவாறே இடம்பெற்றுள்ளன. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 1898,
			"arabicnumber": "817.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 1899,
			"arabicnumber": "818.01",
			"text": "உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் கூறியதாவது: ஹிஷாம் பின் ஹகீம் பின் ஹிஸாம் (ரலி) அவர்கள் (குர்ஆனின் 25ஆவது) அத்தியாயம் அல்ஃபுர்கானை நான் ஓதுகின்ற முறைக்கு மாற்றமாக ஓதுவதைச் செவியுற்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஏற்கெனவே அந்த அத்தியாயத்தை எனக்கு ஓதிக் காட்டியிருந்தார்கள். நான் உடனே ஹிஷாம் (ரலி) அவர்களைக் கண்டிக்க முற்பட்டேன். பிறகு (சற்று யோசித்து) அவர் தொழுகையை முடிக்கும்வரை அவருக்கு அவகாசம் அளித்(துக் காத்திருந்)தேன். (அவர் தொழுது முடித்த) பிறகு அவருடைய மேலாடையை கழுத்தில் போட்டு இழுத்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுசென்று, \"அல்லாஹ்வின் தூதரே,நீங்கள் எனக்கு ஓதிக்கொடுத்ததற்கு மாறாக இவர் அல்ஃபுர்கான் அத்தியாயத்தை ஓதுவதை நான் செவியுற்றேன்\" என்று கூறினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவரை விடுங்கள்\" என (என்னிடம்) கூறிவிட்டு, (ஹிஷாம் அவர்களிடம்) \"நீங்கள் ஓதுங்கள்\" என்று கூறினார்கள். அவர் என்னிடம் ஓதியதைப் போன்றே ஓத, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இப்படித்தான் (இந்த அத்தியாயம்) அருளப்பெற்றது\" என்று கூறினார்கள். பின்னர் என்னிடம் \"நீங்கள் ஓதுங்கள்\" என்றார்கள். நான் ஓதினேன். அதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இப்படித்தான் (இந்த அத்தியாயம்) அருளப்பெற்றது. இந்தக் குர்ஆன் (ஓதுவதற்கான) ஏழு முறைகளில் அருளப்பட்டிருக்கின்றது. ஆகவே, உங்களுக்கு சுலபமானது எதுவோ அதை ஓதிக்கொள்ளுங்கள்\" என்று கூறினார்கள். இதை அப்துர் ரஹ்மான் பின் அப்தில் காரீ (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 1900,
			"arabicnumber": "818.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 1901,
			"arabicnumber": "818.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 1902,
			"arabicnumber": "819.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 1903,
			"arabicnumber": "819.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 1904,
			"arabicnumber": "820.01",
			"text": "உபை பின் கஅப் (ரலி) அவர்கள் கூறியதாவது: )ஒரு முறை) நான் பள்ளிவாசலில் அமர்ந்திருந்தேன். அப்போது ஒரு மனிதர் (பள்ளிவாசலுக்குள்) வந்து தொழலானார்; (தொழுகையில் குர்ஆன் வசனங்களை) ஒரு விதமாக ஓதினார். அதை நான் அறிந்திருக்கவில்லை. பிறகு மற்றொருவர் வந்து (அதே வசனங்களை) முதலாமவர் ஓதியதற்கு மாற்றமாக ஓதித் தொழலானார். தொழுகை முடிந்ததும் நாங்கள் அனைவரும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றோம். நான் \"இவர் குர்ஆனை நான் அறிந்திராத (ஓதல்) முறையில் ஓதினார். பின்னர் மற்றவர் வந்து முதலாமவர் ஓதியதற்கு மாறாக (அதையே) வேறு முறையில் ஓதினார்\" என்றேன். நபி (ஸல்) அவர்கள் அவ்விருவரையும் ஓதிக் காட்டும்படி பணித்தார்கள். அவ்விருவரும் ஓதினர். நபி (ஸல்) அவர்கள் அவ்விருவரும் சரியாகவே ஓதினர் எனக் கூறினார்கள். (இதைக் கேட்டவுடன்) என் உள்ளத்தில் நபியவர்கள் பொய்யுரைக்கிறார்கள் என்ற எண்ணம் விழுந்தது. அறியாமைக் காலத்தில்கூட இத்தகைய எண்ணம் எனக்கு ஏற்பட்டதில்லை. என்னை ஆட்கொண்டிருந்த (அந்த எண்ணத்)தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கண்டபோது என் நெஞ்சில் ஓர் அடி அடித்தார்கள். (அடி விழுந்ததும்) எனக்கு வியர்த்துக் கொட்டியது. அச்சத்தால் எனக்கு அல்லாஹ்வே காட்சியளிப்பதைப் போன்றிருந்தது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம் \"உபை, \"குர்ஆனை ஓர் ஓதல் முறைப்படி ஓதுவீராக\" என எனக்கு (இறைவனிடமிருந்து) செய்தியறிவிக்கப்பட்டது. உடனே நான் என் சமுதாயத்தாருக்கு இன்னும் சுலபமாக்கும்படி (இறைவனிடம்) கோரினேன். அப்போது \"குர்ஆனை இரண்டு ஓதல் முறைப்படி ஓதுவீராக!\" என எனக்கு இரண்டாவது முறையாக இறைவன் அறிவித்தான். உடனே நான் இன்னும் என் சமுதாயத்தாருக்கு சுலபமாக்கும்படி கோரினேன். மூன்றாவது முறையில் குர்ஆனை ஏழு ஓதல் முறைகளின் படி ஓதும்படி எனக்கு இறைவன் அறிவித்தான். மேலும், \"நீர் கோரிய (மூன்று கோரிக்கைகளில்) ஒவ்வொரு கோரிக்கைக்கும் பகரமாக என்னிடம் உமக்கு ஓர் (அங்கீகரிக்கப்பட்ட) பிரார்த்தனை உண்டு\" என்றும் (இறைவன்) கூறினான். எனவே நான் \"இறைவா! என் சமுதாயத்தாரை மன்னிப்பாயாக! இறைவா! என் சமுதாயத்தாரின் குற்றங்குறைகளை மறைப்பாயாக!\" என (இரண்டு) பிரார்த்தனை செய்தேன். (இவ்விரு பிரார்த்தனைகள் அல்லாமல்) மூன்றாவது பிரார்த்தனையை நான் ஒரு நாளைக்காகத் தாமதப்படுத்தி (பத்திரப்படுத்தி) வைத்துள்ளேன். அந்நாளில் படைப்பினங்கள் அனைத்தும் என்னிடம் (பரிந்துரைக்கும்படி) ஆவலுடன் வருவார்கள்; இப்ராஹீம் (அலை) அவர்கள் உட்பட\" எனக் கூறினார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் \"நான் பள்ளிவாசலில் அமர்ந்திருந்தேன். அப்போது ஒரு மனிதர் (பள்ளிவாசலுக்குள்) நுழைந்து குர்ஆனை ஓர் ஓதல் முறைப்படி ஓதித் தொழுதார்...\" என்று உபை பின் கஅப் (ரலி) அவர்கள் கூறினார்கள் என ஹதீஸ் தொடங்குகிறது. மற்றவை மேற்கண்ட ஹதீஸில் உள்ளவாறே இடம் பெற்றுள்ளன. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 1905,
			"arabicnumber": "820.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 1906,
			"arabicnumber": "821.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 1907,
			"arabicnumber": "821.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 1908,
			"arabicnumber": "822.01",
			"text": "அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: நஹீக் பின் சினான் எனப்படும் ஒரு மனிதர் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் வந்து, \"அபூஅப்திர் ரஹ்மான்,குர்ஆனில் (47ஆவது அத்தியாயத்திலுள்ள) இந்த எழுத்தை எப்படி ஓதுகிறீர்?: \"மிம்மாயின் ஃகைரி ஆசினின்\" என்று அலிஃபுடன் ஓதுகின்றீரா, அல்லாது \"மிம்மாயின் ஃகைரி யாசினின்\" என்று \"யா\"வுடன் ஓதுகின்றீரா?\" எனக் கேட்டார். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"இதைத் தவிர குர்ஆன் முழுவதையும் சரியாக மனனமிட்டு விட்டாயோ?\" என்று அவரிடம் கேட்டார்கள். அதற்கு அந்த மனிதர், \"நான் முஃபஸ்ஸல் எனும் (ஹுஜுராத் முதல் அந்நாஸ் (49-114) வரையிலான) அத்தியாயங்களை ஒரே ரக்அத்தில் ஓதுகின்றேன்\" என்றார். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"பாட்டுப் பாடுவதைப் போன்று அவசர அவசரமாக ஓதினீரோ? மக்களில் சிலர் குர்ஆனை ஓதுவார்கள். அது அவர்களது தொண்டைக் குழியைக் கடந்து செல்லாது. அது மட்டும் அவர்களது உள்ளத்திற்குள் சென்று பதிந்துவிட்டால் நிச்சயம் பயன் தரும். தொழுகையில் மிகச் சிறந்த நிலை ருகூஉவும் சஜ்தாவுமாகும். நபி (ஸல்) அவர்கள் தமது தொழுகையின் ஒவ்வொரு ரக்அத்திலும் இரண்டிரண்டாகச் சேர்த்து ஓதிவந்த சரிநிகர் அத்தியாயங்களை நான் அறிவேன்\" என்று கூறினார்கள். (இதைக் கூறிய) பிறகு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் (தமது இல்லத்தினுள்) சென்றார்கள். அவர்களைப் பின்தொடர்ந்து அல்கமா (ரஹ்) அவர்களும் உள்ளே சென்றார்கள். (சிறிது நேரம் கழித்து) அல்கமா (ரஹ்) அவர்கள் வெளியே வந்து \"அந்த (சரிநிகர்) அத்தியாயங்கள் (எவை என்பது) பற்றி எனக்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் அறிவித்தார்கள்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில், அப்துல்லாஹ் பின் நுமைர் (ரஹ்) அவர்களது அறிவிப்பில் \"பனூ பஜீலா குலத்தைச் சேர்ந்த ஒரு மனிதர் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் வந்தார்\" என்றே இடம்பெற்றுள்ளது. \"நஹீக் பின் சினான் எனப்படும் ஒரு மனிதர்\" எனும் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 1909,
			"arabicnumber": "822.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 1910,
			"arabicnumber": "822.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 1911,
			"arabicnumber": "822.04",
			"text": "அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் (ஒரு நாள்) காலையில் வைகறை (சுப்ஹு)த் தொழுகைக்குப் பிறகு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் (அவர்களது இல்லத்திற்குச்) சென்றோம். வாசலில் (நின்று) சலாம் சொன்னோம். அவர்கள் எங்களுக்கு உள்ளே வர அனுமதியளித்தார்கள். ஆனால், நாங்கள் சிறிது நேரம் வாசலிலேயே (தயங்கியவாறு) நின்றுகொண்டிருந்தோம். அப்போது பணிப் பெண் வெளியே வந்து, \"நீங்கள் உள்ளே வரக் கூடாதா?\" என்று கேட்டாள். நாங்கள் உள்ளே சென்றோம். அப்போது அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் இறைவனைத் துதித்துக்கொண்டிருந்தார்கள்; )எங்களைக் கண்டதும்) \"உங்களுக்கு அனுமதியளிக்கப்பட்ட பின்பும் ஏன் நீங்கள் உள்ளே வரவில்லை?\" என்று கேட்டார்கள். அதற்கு நாங்கள் \"(அப்படியொன்றும்) இல்லை; (தங்கள்) வீட்டாரில் எவரேனும் உறங்கிக்கொண்டிருப்பார்கள் என்று நாங்கள் எண்ணினோம்\" என்று சொன்னோம். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"இப்னு உம்மி அப்தின் குடும்பத்தார் (தொழுகையில்) அலட்சியமாக இருப்பார்கள் என எண்ணிக்கொண்டீர்களா?\" என்று கூறி விட்டு (மீண்டும்) இறைவனைத் துதிப்பதில் ஈடுபடலானார்கள். பின்னர் சூரியன் உதயமாகியிருக்கலாம் என எண்ணிய அவர்கள் (தம் பணிப்பெண்ணிடம்) \"பெண்ணே! சூரியன் உதயமாகிவிட்டதா, பார்?\" என்றார்கள். அந்தப் பெண் பார்த்தபோது சூரியன் உதயமாகியிருக்கவில்லை. எனவே, அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் மீண்டும் இறைவனைத் துதிப்பதில் ஈடுபடலானார்கள். பின்னர் சூரியன் உதயமாகி விட்டதாக எண்ணியபோது (மறுபடியும்) \"பெண்ணே, சூரியன் உதயமாகிவிட்டதா, பார்!\" என்றார்கள். அவள் பார்த்தபோது சூரியன் உதயமாகிவிட்டிருந்தது. அப்போது அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"இன்றைய நாளை நமக்கு மீட்டுத்தந்த இறைவனுக்கே புகழ் யாவும்; அவன் நம்மை நம் பாவங்களால் அழித்துவிடவில்லை\" என்று கூறினார்கள். அப்போது அங்கிருந்த மக்களில் ஒருவர், \"நேற்றிரவு நான் \"முஃபஸ்ஸல்\" அத்தியாயங்கள் முழுவதையும் ஓதி முடித்தேன்\" என்று கூறினார். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"பாட்டுப் பாடுவதைப் போன்று அவசர அவசரமாக (குர்ஆனை) ஓதினீரோ? நாங்கள் ஒரே அளவிலமைந்த அத்தியாயங்களை (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓதும்போது) செவியுற்றோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வழக்கமாக) ஓதிவந்த ஒரே அளவிலமைந்த \"முஃபஸ்ஸல்\" அத்தியாயங்கள் பதினெட்டையும் \"ஹாமீம்\" (எனத் தொடங்கும் அத்தியாயங்களின்) குடும்பத்தில் இரண்டு அத்தியாயங்களையும் நான் மனனமிட்டுள்ளேன்\" என்றார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 1912,
			"arabicnumber": "822.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 1913,
			"arabicnumber": "822.06",
			"text": "அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: பனூ பஜீலா குடும்பத்தைச் சேர்ந்த நஹீக் பின் சினான் என்று கூறப்படும் ஒரு மனிதர் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் வந்து \"நான் ஒரே ரக்அத்தில் முஃபஸ்ஸல் அத்தியாயங்கள் அனைத்தையும் ஓதுகிறேன்\" என்றார். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"பாட்டுப் பாடுவதைப் போன்று அவசர அவசரமாக ஓதினீரோ! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு ரக்அத்தில் இரண்டு அத்தியாயங்கள் வீதம் ஓதிவந்த சரிநிகர் அத்தியாயங்களை நான் அறிந்து வைத்துள்ளேன்\" என்று கூறினார்கள். - அபூவாயில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: ஒரு மனிதர் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் வந்து \"நான் இன்றிரவு ஒரே ரக்அத்தில் முஃபஸ்ஸல் அத்தியாயங்கள் முழுவதையும் ஓதி முடித்தேன்\" என்றார். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் \"பாட்டுப் பாடுவதைப் போன்று அவசர அவசரமாக ஓதினீரோ! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தமது தொழுகையில்) ஒவ்வொரு ரக்அத்திலும் இரண்டிரண்டு அத்தியாயங்களாகச் சேர்த்து ஓதிவந்த சரிநிகர் அத்தியாயங்களை நான் அறிந்துள்ளேன்\" எனக் கூறிவிட்டு, முஃபஸ்ஸல் அத்தியாயங்களில் இருபது அத்தியாயங்களைக் குறிப்பிட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 1914,
			"arabicnumber": "823.01",
			"text": "அபூஇஸ்ஹாக் அஸ்ஸபீஈ (ரஹ்) அவர்கள் கூறியதாவது: அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் பள்ளிவாசலில் குர்ஆன் கற்றுக் கொடுத்துக் கொண்டிருந்தார்கள். அப்போது அவர்களிடம் ஒரு மனிதர் \"நீங்கள் இந்த (54:32ஆவது) வசனத்தை எப்படி ஓதுகிறீர்கள்? ஃபஹல் மின்(ம்) முத்தகிர் என \"தால்\" எனும் எழுத்துடன் ஓத வேண்டுமா? அல்லது (ஃபஹல் மின்(ம்) முஸ்ஸகிர் என) \"ஃதால்\" எனும் எழுத்துடன் ஓத வேண்டுமா?\" என்று கேட்டார். அதற்கு \"தால்\" (எனும் எழுத்து) கொண்டே (ஓத வேண்டும்). அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"முத்தகிர்\" என \"தால்\" (எனும் எழுத்து) கொண்டே ஓதியதை நான் கேட்டேன் என அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறினார்கள் என்று அஸ்வத் (ரஹ்) அவர்கள் விடையளித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 1915,
			"arabicnumber": "823.02",
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (54:32ஆவது வசனத்தின் மூலத்திலுள்ள இத்தொடரை) \"ஃபஹல் மின்(ம்) முத்தகிர்\" என்றே ஓதினார்கள். இதை அஸ்வத் பின் யஸீத் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 1916,
			"arabicnumber": "824.01",
			"text": "அல்கமா பின் கைஸ் (ரஹ்) அவர்கள் கூறியதாவது: (அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களின் மாணவர்களான) நாங்கள் ஷாம் (சிரியா) நாட்டுக்குச் சென்றிருந்தோம். (நாங்கள் வந்துள்ள செய்தியறிந்து) எங்களிடம் அபுத்தர்தா (ரலி) அவர்கள் வந்து, \"அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களின் ஓதல் முறைப்படி ஓதத் தெரிந்தவர் எவரேனும் உங்களிடையே உண்டா?\" என்று கேட்டார்கள். நான் \"ஆம்; நான் (இருக்கிறேன்)\" என்று பதிலளித்தேன். அபுத் தர்தா (ரலி) அவர்கள், \"வல்லைலி இஃதா யஃக்ஷா\" எனும் இந்த (92:3ஆவது) வசனத்தை அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் எவ்வாறு ஓதக் கேட்டீர்கள்?\" என்று வினவினார்கள். நான் \"வல்லைலி இஃதா யஃக்ஷா வத்தகரி வல் உன்ஸா\" என்றே ஓதினார்கள் என்று பதிலளித்தேன். அபுத்தர்தா (ரலி) அவர்கள், \"அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் இவ்வாறு ஓதவே நான் கேட்டுள்ளேன். இந்த மக்கள் (ஷாம்வாசிகள்) \"வமா கலக்கஃத் தகர வல்உன்ஸா\" என்றே நான் ஓத வேண்டுமென விரும்புகிறார்கள். ஆனால், இவர்களை நான் பின்பற்றமாட்டேன்\" என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 1917,
			"arabicnumber": "824.02",
			"text": "மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் அல்கமா (ரஹ்) அவர்கள் கூறியிருப்பதாவது: நான் ஷாம் (சிரியா) நாட்டிற்குச் சென்றேன். அங்கு பள்ளிவாசலுக்குச் சென்று தொழுதேன். பின்னர் எழுந்து ஒரு சபைக்குச் சென்று அதில் அமர்ந்தேன். அப்போது ஒருவர் (அபுத்தர்தா-ரலி) வந்து என் அருகே அமர்ந்தார். அவரிடம் (அக்கால) மக்களின் எளிமையையும் தோற்றத்தையும் கண்டேன். அவர் (என்னிடம்), \"அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் ஓதுகின்ற முறையை நீங்கள் மனனமிட்டுள்ளீர்களா?\" என்று வினவினார். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 1918,
			"arabicnumber": "824.03",
			"text": "அல்கமா (ரஹ்) அவர்கள் கூறியதாவது: நான் அபுத்தர்தா (ரலி) அவர்களைச் சந்தித்தேன். அவர்கள் என்னிடம் \"நீங்கள் எந்த நாட்டவர்?\" என்று கேட்க, \"இராக்கியர்\" என்று நான் பதிலளித்தேன். \"இராக்கியரில் நீங்கள் எந்த ஊரைச் சேர்ந்தவர்?\" என்று அன்னார் வினவ, \"கூஃபாவாசி\" என நான் விடையளித்தேன். \"அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் ஓதிய முறையில் நீங்கள் ஓதுவீர்களா?\" என அவர்கள் கேட்டார்கள். நான் \"ஆம்\" என்றேன். \"அப்படியானால், \"வல்லைலி இதா யஃக்ஷா\" எனும் (92ஆவது) அத்தியாயத்தை ஓதிக் காட்டுங்கள்\" என்றார்கள். நான் \"வல்லைலி இதா யஃக்ஷா\" என ஓதத் தொடங்கி \"வத்தகரி வல்உன்ஸா\" என ஓதினேன். உடனே அபுத்தர்தா (ரலி) அவர்கள் சிரித்துவிட்டு \"இவ்வாறே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓத நான் செவியேற்றேன்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், அல்கமா (ரஹ்) அவர்கள் \"நான் ஷாம் (சிரியா) நாட்டிற்குச் சென்றேன். அங்கு அபுத்தர்தா (ரலி) அவர்களைச் சந்தித்தேன்\" என்று கூறியதாக ஹதீஸ் தொடங்குகிறது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 1919,
			"arabicnumber": "824.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 1920,
			"arabicnumber": "825",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 1921,
			"arabicnumber": "826.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 1922,
			"arabicnumber": "826.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 1923,
			"arabicnumber": "827",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 1924,
			"arabicnumber": "828.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் (சரியாகச்) சூரியன் உதிக்கும் நேரத்தையும் சூரியன் மறையும் நேரத்தையும் தேர்ந்தெடுத்துத் தொழ வேண்டாம். இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 1925,
			"arabicnumber": "828.02",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: )சரியாகச்) சூரியன் உதிக்கும் நேரத்தையோ சூரியன் மறையும் நேரத்தையோ நீங்கள் தொழுவதற்காகத் தேர்வு செய்யாதீர்கள். ஏனெனில் அது, ஷைத்தானின் இரு கொம்புகளுக்கிடையே உதிக்கின்றது. இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 1926,
			"arabicnumber": "829",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: சூரியனின் ஒரு பகுதி (கிழக்கில்) தோன்றும் போது (தொழாதீர்கள்.) அது முழுமையாக வெளிப்படும்வரைத் தொழுவதைத் தாமதப்படுத்துங்கள்; சூரியனின் ஒரு பகுதி (மேற்கில்) மறையும்போது (தொழாதீர்கள்); அது முழுமையாக மறையும்வரைத் தொழுகையைத் தாமதப்பபடுத்துங்கள்.-இதை இப்னு உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 1927,
			"arabicnumber": "830.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 1928,
			"arabicnumber": "830.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 1929,
			"arabicnumber": "831",
			"text": "உக்பா பின் ஆமிர் அல்ஜுஹனீ (ரலி) அவர்கள் கூறியதாவது: மூன்று நேரங்களில் தொழ வேண்டாம்; அல்லது இறந்தவர்களைப் புதைக்க வேண்டாம் என எங்களுக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தடை விதித்துவந்தார்கள். 1.சூரியன் உதயமாகத் துவங்கியதிலிருந்து நன்கு உயரும்வரை, 2.ஒருவர்உச்சிப் பொழுதில் நிற்கும்போது நிழல் விழாது போகும்) நண்பகல் துவங்கியதிலிருந்து சூரியன் (மேற்கு) சாயும்வரை. 3.சூரியன் அஸ்தமிக்கத் தலைப்பட்டதிலிருந்து நன்கு மறையும்வரை. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 1930,
			"arabicnumber": "832",
			"text": "அம்ர் பின் அபசா அஸ்ஸுலமீ (ரலி) அவர்கள் கூறியதாவது: நான் அறியாமைக் காலத்தில் வாழ்ந்தபோது மக்கள் அனைவரும் வழிகேட்டில் இருக்கிறார்கள்; அவர்களுக்கென (வாழ்க்கை நெறி) எதுவும் கிடையாது; அவர்கள் சிலைகளை வணங்கிக்கொண்டிருக்கிறார்கள் என எண்ணி (வருந்தி)னேன். இந்நிலையில் மக்காவில் ஒரு மனிதர் (புதிய) செய்திகளைச் சொல்லிவருவதாகக் கேள்விப்பட்டேன். எனவே, நான் எனது வாகனத்தில் அமர்ந்து அவரை நோக்கிச் சென்றேன். அங்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தலைமறைவாக இருந்துகொண்டிருந்தார்கள். அவர்களுடைய சமுதாயத்தார் அவர்களுக்கெதிரான துணிகரச் செயல்களில் ஈடுபட்டுக்கொண்டிருந்தனர். எனவே, நான் அரவமின்றி மெதுவாக மக்காவுக்குள் நுழைந்து அவர்களிடம் சென்றேன். அவர்களிடம் நான், \"நீங்கள் யார்?\" என்று கேட்டேன். அதற்கு அவர்கள் \"நான் ஒரு நபி\" என்றார்கள். நான் \"நபி என்றால் என்ன?\" என்று கேட்டேன். அதற்கு அவர்கள் \"அல்லாஹ் என்னை (தனது செய்தியுடன்) அனுப்பி உள்ளான்\" என்று கூறினார்கள். நான் \"என்னென்ன செய்திகளுடன் அனுப்பியுள்ளான்?\" என்று கேட்டேன். அதற்கு \"இரத்த உறவுகளைப் பேணி வாழ வேண்டும்; சிலை (வழிபாடு)களை ஒழிக்க வேண்டும்; இறைவன் ஒருவனே;அவனுக்கு இணையாக எதுவுமில்லை எனும் செய்திகளுடன் என்னை அனுப்பினான்\" என்று பதிலளித்தார்கள். நான் \"இந்தக் கொள்கையை ஏற்றுக்கொண்டவர் யார் உங்களுடன் இருக்கின்றார்கள்?\" என அவர்களிடம் கேட்டேன். அதற்கு அவர்கள் \"ஒரு சுதந்திரவானும் ஓர் அடிமையும் உள்ளனர்\" என்றார்கள். (அன்றைய நாளில் அபூபக்ர் (ரலி) அவர்களும் பிலால் (ரலி) அவர்களும் நபியவர்களை ஏற்று அவர்களுடன் இருந்தனர்). \"நானும் தங்களைப் பின்பற்ற விழைகிறேன்\" என்று நான் கூறினேன். அதற்கவர்கள் \"இந்த நாளில் அவ்வாறு உம்மால் என்னைப் பின்பற்ற இயலாது. எனது நிலையையும் மக்களின் நிலையையும் நீர் பார்க்கவில்லையா? (தற்போது) நீர் உம்முடைய குடும்பத்தாரிடம் திரும்பிச் செல்லும்! நான் எழுச்சி கண்டேன் என என்னைப் பற்றி நீர் கேள்விப்பட்டால் என்னிடம் வாரும்!\"என்றார்கள். அதற்கேற்ப நான் என் குடும்பத்தாரிடம் சென்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நாடு துறந்து) மதீனாவுக்குச் சென்றுவிட்டார்கள். நான் என் குடும்பத்தாரிடம் இருந்துகொண்டே செய்திகளைக் கேட்டு அறிந்து கொண்டிருந்தேன். அவர்கள் மதீனாவுக்குச் சென்றவுடன் மக்களிடம் அவர்களைப் பற்றி விசாரித்தேன். ஒரு சமயம் யஸ்ரிப் (மதீனா)வாசிகளில் சிலர் என்னிடம் வந்தனர். அவர்களிடம் \"மதீனாவிற்கு வந்துள்ள இந்த மனிதர் என்ன செய்துகொண்டிருக்கிறார்\" என்று கேட்டேன். அதற்கு அவர்கள் \"மக்கள் அவரை நோக்கி விரைந்துகொண்டிருக்கின்றனர். (மக்காவில்) அவருடைய சமுதாயத்தார் அவரைக் கொன்றுவிடத் திட்டமிட்டனர். ஆனால், அவர்களால் ஒன்றும் செய்ய முடியவில்லை\" என்று கூறினர். பின்னர் நான் மதீனாவுக்குச் சென்று நபியவர்களைச் சந்தித்தேன். அப்போது, \"அல்லாஹ்வின் தூதரே! தங்களுக்கு என்னை அடையாளம் தெரிகிறதா?\" என்று கேட்டேன். அவர்கள் \"ஆம், மக்காவில் என்னை வந்து சந்தித்தவர்தாமே!\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். பிறகு \"அல்லாஹ் உங்களுக்குக் கற்றுத்தந்துள்ள, எனக்குத் தெரியாத விஷயங்களைப் பற்றி எனக்குச் சொல்லுங்கள். தொழுகையைப் பற்றி எனக்குச் சொல்லுங்கள்!\" என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், \"சுப்ஹுத் தொழுகையைத் தொழுங்கள். பிறகு சூரியன் உதயமாகி உயரும்வரை தொழுவதை நிறுத்திக்கொள்ளுங்கள். ஏனெனில், அது உதயமாகும் போது ஷைத்தானின் இரு கொம்புகளுக்கிடையே உதயமாகிறது. அப்போதுதான் அதற்கு இறைமறுப்பாளர்கள் சிரவணக்கம் செய்கின்றனர். பிறகு தொழுங்கள்! அந்த நேரத்தில் தொழும் தொழுகை (வானவர்களால்) சாட்சியமளிக்கப்படக்கூடியதும் (வானவர்கள்) வருகை தரக்கூடியதுமாகும். ஈட்டியின் நிழல் கிழக்கிலோ மேற்கிலோ சாயாமல் அதன்மீதே விழும் (நண்பகல் நேரம்)வரைத் தொழுங்கள்! பிறகு தொழுவதை நிறுத்திக்கொள்ளுங்கள். ஏனெனில், அப்போது நரகம் எரிக்கப்படுகிறது. பிறகு நிழல் (கிழக்கே) சாய்ந்துவிட்டால் தொழுது கொள்ளுங்கள். அந்நேரத்தொழுகைக்கு (வானவர்களால்) சாட்சியமளிக்கப்படுகிறது. அவர்கள் அதில் பங்கேற்கின்றனர். பிறகு அஸ்ர்வரைத் தொழுதுகொள்க. பிறகு சூரியன் மறையும்வரைத் தொழுவதை நிறுத்திவிடுக! ஏனெனில், அது ஷைத்தானின் இரு கொம்புகளுக்கிடையேதான் மறைகிறது. இந்த நேரத்தில் அதற்கு இறைமறுப்பாளர்கள் சிரவணக்கம் செய்கின்றனர்\" என்று கூறினார்கள். நான், \"அல்லாஹ்வின் தூதரே! அங்கத் தூய்மை (உளூ) செய்வது பற்றி எனக்குச் சொல்லுங்கள்!\" என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள் \"உங்களில் ஒருவர் அங்கத் தூய்மை செய்வதற்குத் தண்ணீரை நெருங்கி வாய் கொப்புளித்து (மூக்கிற்கு நீர் செலுத்தி) மூக்குச் சிந்தினால் அவரது முகம், வாய், மூக்கு ஆகியவற்றால் ஏற்பட்ட பாவங்கள் அனைத்தும் (தண்ணீரோடு சேர்ந்து கீழே) விழுந்துவிடுகின்றன. பிறகு அவர் அல்லாஹ் உத்தரவிட்டதைப் போன்று தமது முகத்தைக் கழுவினால் அவரது முகத்தால் ஏற்பட்ட பாவங்கள் அனைத்தும் அவரது தாடி ஓரங்களிலிருந்து தண்ணீரோடு சேர்ந்து விழுந்துவிடுகின்றன. பிறகு அவர் மூட்டுவரை இரு கைகளைக் கழுவும்போது அவருடைய கைகளின் பாவங்கள் அனைத்தும் அவரது விரல் நுனிகளிலிருந்து தண்ணீரோடு சேர்ந்து விழுந்துவிடுகின்றன. பிறகு அவர் ஈரக் கையால் தலையைத் தடவி (மஸ்ஹுச் செய்தி)டும் போது அவரது தலையின் பாவங்கள் அனைத்தும் தலைமுடியின் ஓரங்களிலிருந்து தண்ணீரோடு சேர்ந்து விழுந்துவிடுகின்றன. பிறகு அவர் தம் பாதங்களைக் கணைக்கால்கள்வரைக் கழுவும்போது அவரது கால்களால் ஏற்பட்ட பாவங்கள் அனைத்தும் அவரது விரல் நுனிகளிலிருந்து தண்ணீரோடு சேர்ந்து விழுந்துவிடுகின்றன. (அதற்குப் பிறகு) அவர் எழுந்து தொழும்போது அல்லாஹ்வை அவனது தகுதிக்கேற்றதைக் கூறிப் புகழ்ந்து பெருமைப்படுத்தித் தமது உள்ளத்தில் இறைவனுக்கு மட்டுமே இடமளித்தால் அவர் திரும்பிச் செல்கையில் அன்று பிறந்த பாலகனைப் போன்று பாவங்கள் நீங்கி (பரிசுத்தமாகத்) திரும்புகிறார்\" என்று கூறினார்கள். )இதன் அறிவிப்பாளரான) நபித்தோழர் அபூஉமாமா (ரலி) அவர்கள் கூறுகின்றார்கள்: இந்த ஹதீஸை அம்ர் பின் அபசா (ரலி) அவர்கள் என்னிடம் கூறியபோது நான், \"அம்ர் பின் அபசா! என்ன சொல்கிறீர்கள் என்பதை நன்கு யோசித்துச் சொல்லுங்கள்! ஒரே இடத்தில் (இத்தனையும்) அந்த மனிதர் வழங்கப்பெறுகிறாரா?\" என்று கேட்டேன். அதற்கு அம்ர் பின் அபசா (ரலி) அவர்கள், \"அபூஉமாமா, என் வயது முதிர்ந்துவிட்டது; எனது எலும்பு நலிந்து விட்டது; எனது தவணை நெருங்கி விட்டது. இந்நிலையில் அல்லாஹ்வின் மீதோ அவன் தூதர்மீதோ பொய்யுரைப்பதற்கு எனக்கு எந்தத் தேவையுமில்லை. நான் இந்த ஹதீஸை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து ஒரு தடவை, இரண்டு தடவை, மூன்று தடவை (இவ்வாறு ஏழுவரை எண்ணிச் சொல்கிறார்) மட்டுமே செவியுற்றிருந்தால் இதை ஒருபோதும் நான் அறிவித்திருக்கமாட்டேன். ஆனால்,அதைவிட அதிகத் தடவைகள் நான் செவியுற்றேன் (அதனால்தான் அறிவித்தேன்)\" என்றார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 1931,
			"arabicnumber": "833.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 1932,
			"arabicnumber": "833.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 1933,
			"arabicnumber": "834",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 1934,
			"arabicnumber": "835.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 1935,
			"arabicnumber": "835.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 1936,
			"arabicnumber": "835.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 1937,
			"arabicnumber": "835.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 1938,
			"arabicnumber": "836",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 1939,
			"arabicnumber": "837",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 1940,
			"arabicnumber": "838.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 1941,
			"arabicnumber": "838.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 1942,
			"arabicnumber": "839.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 1943,
			"arabicnumber": "839.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 1944,
			"arabicnumber": "839.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 372
			}
		},
		{
			"hadithnumber": 1945,
			"arabicnumber": "840.01",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் அச்ச நேரத் தொழுகையில் நான் பங்கேற்றுள்ளேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களைத் தமக்குப் பின்னால் இரு வரிசைகளில் நிறுத்தினார்கள். அப்போது எதிரிகள் எங்களுக்கும் தொழும் திசை(யான கிப்லாவு)க்குமிடையே இருந்தார்கள். நபி (ஸல்) அவர்கள் தக்பீர் கூறி (தொழுகையைத் துவக்கி)னார்கள். (இரு வரிசைகளில் நின்றிருந்த) நாங்கள் அனைவரும் தக்பீர் கூறினோம். பின்னர் ருகூஉச் செய்தார்கள். நாங்கள் அனைவரும் ருகூஉச் செய்தோம். பின்னர் ருகூஉவிலிருந்து தலையை உயர்த்தினார்கள். நாங்கள் அனைவரும் (தலையை) உயர்த்தினோம். பிறகு நபி (ஸல்) அவர்களும் அவர்களுக்கு அருகில் (முதல் வரிசையில்) நின்றவர்களும் குனிந்து சஜ்தாச் செய்தனர். அப்போது இரண்டாவது வரிசையிலிருந்தவர்கள் (அப்படியே) எதிரிகளுக்கு நேராக (அவர்களைக் கண்காணித்தவாறு) நின்றுகொண்டேயிருந்தனர். நபி (ஸல்) அவர்கள் சஜ்தாவை நிறைவேற்றி, முதல் வரிசையிலிருந்தவர்கள் (சஜ்தாச் செய்து) எழுந்து நின்றதும் இரண்டாவது வரிசையிலிருந்தவர்கள் குனிந்து சஜ்தாச் செய்தனர். பிறகு எழுந்தனர். பிறகு இரண்டாவது வரிசையிலிருந்தவர்கள் முன்னே (முதல் வரிசைக்கு) வந்தனர். முன் வரிசையிலிருந்தவர்கள் பின்னால் (இரண்டாம் வரிசைக்கு) வந்துவிட்டனர். பிறகு நபி (ஸல்) அவர்கள் ருகூஉச் செய்தபோது (இரு வரிசைகளில் நின்றிருந்த) நாங்கள் அனைவரும் ருகூஉச் செய்தோம். பிறகு நபி (ஸல்) அவர்கள் ருகூஉவிலிருந்து தலையை உயர்த்தியபோது (இரு வரிசைகளிலிருந்த) நாங்கள் அனைவரும் தலையை உயர்த்தினோம். பிறகு நபி (ஸல்) அவர்கள் குனிந்து சஜ்தாச் செய்தார்கள். முதல் ரக்அத் நடைபெற்றபோது பின் வரிசையிலிருந்தவர்களும் இப்போது நபியவர்களுக்கு அருகில் இருப்பவர்களுமான (முதல்) அணியினர் சஜ்தாச் செய்தார்கள். பின்வரிசையிலிருந்தவர்கள் (சஜ்தாச் செய்யாமல்) எதிரிகளுக்கு நேராக (அவர்களைக் கண்காணித்தவாறு) நின்று கொண்டனர். நபி (ஸல்) அவர்களும் முதல் வரிசையிலிருந்தவர்களும் சஜ்தாச் செய்து முடித்ததும் பின்வரிசையில் நின்றுகொண்டி ருந்தவர்களும் குனிந்து சஜ்தாச் செய்தனர். நபி (ஸல்) அவர்கள் சலாம் கொடுத்தபோது நாங்கள் அனைவரும் சலாம் கொடுத்தோம். (இன்றைக்கு எவ்வாறு) உங்கள் படைவீரர்கள் தங்கள் தலைவர்களுடன் சேர்ந்து (போர்க் களங்களில்) தொழுகின்றனரோ அதைப் போன்றுதான் (நாங்களும் செய்தோம்). அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 1946,
			"arabicnumber": "840.02",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் சேர்ந்து ஜுஹைனா குலத்தைச் சேர்ந்த ஒரு கூட்டத்தாருடன் போரிடப் புறப்பட்டோம். அவர்கள் எங்களிடம் கடுமையாகப் போரிட்டனர். நாங்கள் லுஹ்ர் தொழுகையில் ஈடுபட்டிருந்தபோது (எங்களை நோட்டமிட்ட) இணைவைப்பாளர்கள் \"(முஸ்லிம்கள் தொழுகையில் ஈடுபடும்போது) அவர்கள்மீது நாம் அதிரடித் தாக்குதல் தொடுத்தால் அவர்களை நாம் பூண்டோடு ஒழித்துவிடலாம்\" என்று பேசிக் கொண்டனர். இந்த விவரத்தை (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தெரிவித்தார்கள். அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் கூறினார்கள். மேலும், \"அவர்கள் ஒரு தொழுகையை எதிர்நோக்கியுள்ளனர். அது அவர்களுக்கு (தங்கள்) குழந்தை குட்டிகளைவிட மிக விருப்பமானதாகும்\" என்று இணைவைப்பாளர்கள் கூறுகின்றனர் என்றும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். அஸ்ர் தொழுகையின் நேரம் வந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களை இரு வரிசைகளில் அணிவகுக்கச் செய்தார்கள். இணைவைப்பாளர்கள் எங்களுக்கும் தொழும் திசை(யான கிப்லாவு)க்குமிடையே இருந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முதல் தக்பீர் கூறி (தொழுகையைத் துவக்கி)னார்கள். நாங்களும் தக்பீர் கூறினோம். அவர்கள் ருகூஉச் செய்தார்கள். நாங்களும் ருகூஉச் செய்தோம். பிறகு அவர்கள் சஜ்தாச் செய்தபோது முதல் வரிசையிலிருந்தவர்கள் சஜ்தாச் செய்தனர். முதல் வரிசையிலிருந்தவர்கள் (சஜ்தாவிலிருந்து) எழுந்து நின்றதும் இரண்டாவது வரிசையிலிருந்தவர்கள் சஜ்தாச் செய்தனர். பிறகு முதல் வரிசையிலிருந்தவர்கள் பின்வரிசைக்குச் சென்றுவிட, இரண்டாம் வரிசையிலிருந்தவர்கள் முன் வரிசைக்கு வந்து அவர்களது இடத்தில் நின்றனர். (இரண்டாவது ரக்அத்தில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தக்பீர் கூற நாங்கள் (அனைவரும்) தக்பீர் கூறினோம். அவர்கள் ருகூஉச் செய்தபோது நாங்களும் ருகூஉச் செய்தோம். பிறகு அவர்கள் சஜ்தாச் செய்தபோது முதல் வரிசையிலிருந்தவர்களும் சஜ்தாச் செய்தனர். அப்போது இரண்டாவது வரிசையினர் நின்றுகொண்டனர். பின்னர் அவர்களும் சஜ்தாச் செய்த பின்னர் அனைவரும் அமர்ந்தோம். பின்னர் அனைவருடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சலாம் கொடுத்தார்கள். இதன் அறிவிப்பாளரான அபுஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறுகிறார்கள்: பிறகு ஜாபிர் (ரலி) அவர்கள் \"இன்றைய தலைவர்கள் உங்களுக்குத் தொழுவிப்பதைப் போன்றே (அன்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்குத் தொழுவித்தார்கள்)\" என்று குறிப்பிட்டுச் சொன்னார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 1947,
			"arabicnumber": "841",
			"text": "சஹ்ல் பின் அபீஹஸ்மா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் தோழர்களுக்கு அச்ச நேரத் தொழுகையைத் தொழுவித்தபோது அவர்களை இரு வரிசைகளில் தமக்குப் பின்னால் அணிவகுக்கச் செய்தார்கள்; தம்மை அடுத்து (முதல் வரிசையில்) இருந்தவர்களுக்கு ஒரு ரக்அத் தொழுவித்தார்கள். பிறகு எழுந்து நின்று கொண்டார்கள். பின்வரிசையில் நின்றவர்கள் ஒரு ரக்அத் தொழும்வரை அவ்வாறே நின்று கொண்டிருந்தார்கள். பிறகு பின்வரிசையில் இருந்தவர்கள் முன்வரிசைக்கு வந்தனர். முன்வரிசையிலிருந்தவர்கள் பின்வரிசைக்குச் சென்றுவிட்டனர். அப்போது முன்வரிசைக்காரர்களுக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு ரக்அத் தொழுவித்தார்கள். பிறகு பின்வரிசைக்குச் சென்றவர்கள் ஒரு ரக்அத் தொழும்வரை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இரண்டாவது ரக்அத்தின் சஜ்தாவை முடித்த பின்) இருப்பில் அமர்ந்திருந்தார்கள். பிறகு சலாம் கொடுத்(துத் தொழுகையை முடித்)தார்கள். இதை சாலிஹ் பின் கவ்வாத் பின் ஜுபைர் (ரஹ்) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 1948,
			"arabicnumber": "842",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 1949,
			"arabicnumber": "843.01",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் புறப்பட்டுச் சென்றோம். \"தாத்துர் ரிகாஉ\" என்னுமிடத்தில் (போரை முடித்து) நாங்கள் இருந்தபோது நிழல் நிறைந்த ஒரு மரத்தினருகே வந்தோம். நாங்கள் அந்த மரத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களு(டைய மதிய ஓய்வு)க்காக விட்டுவிட்டோம். அப்போது இணைவைப்பாளர்களில் ஒருவர் வந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது வாள் அந்த மரத்தில் தொங்கவிடப்பட்டிருந்தது. உடனே அவர் அந்த வாளை எடுத்து (உறையிலிருந்து) உருவிப் பிடித்துக்கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் \"எனக்கு நீர் அஞ்சுகிறீரா?\" என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (சிறிதும் அஞ்சாமல்) \"இல்லை\" என்று பதிலளித்தார்கள். அவர் \"இப்போது என்னிடமிருந்து உம்மைக் காப்பவர் யார்?\" என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அல்லாஹ் உன்னிடமிருந்து என்னைக் காப்பான்\" என்று பதிலளித்தார்கள். அப்போது நபித்தோழர்கள் அவரைக் கண்டித்தார்கள். உடனே அவர் வாளை உறையிலிட்டு (பழையபடி மரத்தில்) தொங்கவிட்டுவிட்டார். பிறகு தொழுகைக்கு அழைப்புவிடப்பட்டது. அப்போது (தம் தோழர்களில்) ஓர் அணியினருக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரண்டு ரக்அத்கள் (அச்ச நேரத் தொழுகை) தொழுவித்தார்கள். பிறகு இவ்வணியினர் பின்னால் விலகிக்கொள்ளவே, (எதிரிகளைக் கண்காணித்துக்கொண்டிருந்த) மற்றோர் அணியினருக்கு இரண்டு ரக்அத்கள் தொழுவித்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு நான்கு ரக்அத்களும், மக்களுக்கு இரண்டு ரக்அத்களும் ஆயின. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 1950,
			"arabicnumber": "843.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 378
			}
		}
	]
}