{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"12": "The Book on Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "Ali b. ebî Tâlib (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah neseb yönünden haram kıldığını süt emme yönünden de aynen haram kılmıştır.” (Nesâî, Nikah: 51; İbn Mâce: Nikah: 34) Bu konuda Âişe, İbn Abbâs ve Ümmü Habibe’den de hadis rivâyet edilmiştir. Ali hadisi hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve sonraki dönemlerden pek çok ilim adamı uygulamalarını bu hadisle yaparlar bu konuda aralarında farklı görüş olduğunu bilmiyoruz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, iki cariyesi olan bir erkek hakkında şöyle soruldu: “Bu cariyelerden biri bir oğlan çocuğunu diğeri de bir kız çocuğunu emzirmiştir. Bu iki çocuk sonra birbirleriyle evlenebilir mi? İbn Abbâs dedi ki: “Hayır evlenmezler o iki cariye de aynı erkeğin döl suyu ile sulanmıştır dolayısıyla aşı birdir.” (Tirmizî rivâyet etmiştir.) Bu konuda bu hadis esas delildir. Ahmed ve İshâk’da aynı kanaattedirler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1150,
			"arabicnumber": 1150,
			"text": "Âişe diyor ki: Kur’ân’da “Belli miktarda on emiş” indirilmişti sonra bunun beşinin hükmü kaldırılarak “Belli miktarda beş emiş” çevrildi durum bu şekilde iken Rasûlüllah (sallallahü aleyhi ve sellem) vefat etti. Bu hadisi bu şekilde bize İshâk b. Mûsâ el Ensarî, Ma’n yoluyla Mâlik’den, Abdullah b. Ebû Bekir’den, Amre’den, Âişe’den rivâyet etmiştir. Peygamber (sallallahü aleyhi ve sellem)’in bazı hanımları ve Âişe böylece fetva vermişlerdir. Şâfii ve İshâk’ta bu görüştedir. b. Hanbel: “Bir veya iki emmek haramlık meydana getirmez” hadisiyle uygulama yapar ve der ki: Her kim Âişe’nin “Belli miktarda beş emiş” hadisindeki sözüne uyarsa o görüş sağlamdır diyor ve bu konuda bir şeyler söylemeye cesaret edemiyor. (sallallahü aleyhi ve sellem)’in ashabından ve daha sonraki dönemlerden bazı ilim adamları; “Mideye inen azda olsa çok da olsa haram kılar” demektedirler. Sûfyân es Sevrî, Mâlik b. enes, Evzâî, Abdullah b. Mübarek, Vekî’ ve Küfeliler bu görüştedirler. b. ebî Müleyke; Abdullah b. Ubeydullah b. ebî Müleyke’dir. Künyesi Ebû Muhammed’dir. Abdullah, Taif’te kadılık yapmıştır. Cüreyc, İbn ebî Müleyke’nin şöyle söylediğini bize aktarır: “Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından otuz kadar kimseyle görüştüm.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"text": "Ukbe b. Hâris (radıyallahü anh)’den rivâyet edilmiştir. (Abdullah b. ebî Müleyke bu hadisi Ukbe’nin kendisinden de işittim fakat Ubeyd’in rivâyetini daha iyi kavramış bulunuyorum dedi) diyor ki: “Bir kadını kendime nikahlamıştım derken siyah bir kadın geldi ve ikinizi de emzirmiştim dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem)’e geldim ve dedim ki: Filanın kızını kendime nikahladım derken siyah bir kadın gelerek ikinizi de emzirdim dedi o kadın yalancıdır dedim. Ukbe diyor ki: “Peygamber (sallallahü aleyhi ve sellem) benden yüz çevirdi. Bu sefer yüzünü çevirdiği taraftan gelerek o kadın yalancıdır dedim. Bunun üzerine şöyle buyurdular: “İkinizi de emzirdiğini iddia ettiği halde sen hala o kadınla nasıl karı koca olarak yaşarsın? Bırak onu!” (Buhârî, Şehâdet: 14; Ebû Dâvûd, Akdıye: 18) Bu konuda İbn Ömer’den de hadis rivâyet edilmiştir. Ukbe b. Hâris hadisi hasen sahihtir. Pek çok kimse bu hadisi İbn ebî Müleyke’den Ukbe b. Hâris’den rivâyet ederek senedinde “Ubeyd ibn ebî Meryem’i” zikretmediler. “Bırak o kadını” da demediler. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve daha sonraki dönemlerden bazı ilim adamları uygulamalarını bu hadisle yaparlar, emzirme konusunda bir kadının şâhidliğini yeterli görürler. Abbâs der ki: Emzirme konusunda tek bir kadının şâhidliği caiz ve geçerli olup o kadının bu konuda yemin etmesi istenir. Ahmed ve İshâk’ta aynı görüştedirler. ilim adamları da derler ki: Tek kadının şâhidliği caiz ve yeterli olmaz birden fazla olması gerekir. Şâfii’de bu görüştedir. işittim; Vekî’nin şöyle söylediğini işittiğini söyledi: “Emzirme konusunda tek bir kadının şâhidliği adliye açısından geçerli değildir ama takva yönüyle o kimsenin o kadından ayrılması iyi olur.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1152,
			"arabicnumber": 1152,
			"text": "Ümmü Seleme (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Süt emmenin haram kılanı, bağırsakları patlatacak kadar çok emilmesi ve sütten kesilme yaşı olan iki yıldan önce emilmesi şeklinde olanıdır.” (Tirmizî rivâyet etmiştir.) Bu hadis hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve daha sonraki dönemlerden pek çok ilim adamı uygulamalarını bu hadisle yaparlar. Süt emme iki yaşın altında olursa haramlık gerçekleşir, iki seneden sonra olanı hiç kimseyi haram kılmaz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1153,
			"arabicnumber": 1153,
			"text": "Haccac b. Haccac el Eslemî (radıyallahü anh)’in babasından rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem)’e şöyle sormuştur: “Ey Allah’ın Rasûlü emzirme hakkını nasıl ödeyebilirim? Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: “Emziren kadına iyi bir köle ve cariye vermektir.” (Ebû Dâvûd, Nikah: 11; Nesâî, Nikah: 56) Bu hadis hasen sahihtir. Hadiste geçen “Emzirme hakkını nasıl ödeyebilirim” cümlesinin manası süt emziren kimsenin hakkı nasıl ödenebilir demektir. Rasûlüllah (sallallahü aleyhi ve sellem) buna cevap olarak “Süt emziren kadına bir köle ve cariye verirsen hakkını ödemiş olursun” buyurdular. Tufeyl’den rivâyete göre, şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) ile birlikte oturmakta iken bir kadın çıkageldi. Peygamberimiz (sallallahü aleyhi ve sellem) elbisesini yaydı o da oraya oturdu o kadın gidince şöyle denildi: “Bu kadın küçükken Rasûlüllah (sallallahü aleyhi ve sellem)’i emzirmişti.” b. Saîd el Kattan, Hatîm b. İsmail ve başka pek çok kimse bu hadisi Hişâm b. Urve’den, babasından, Haccac b. Haccac’tan babasından bu şekilde rivâyet etmişlerdir. b. Uyeyne’de Hişâm b. Urve’den babasından Haccac b. ebî Haccac’tan ve babasından rivâyet etmiştir. İbn Uyeyne hadisi pek makbul değildir. Sahih olan rivâyet onların Hişâm b. Urve ve babasından ki Hişâm b. Urve Ebûl Münzir diye künyelenir. Kendisi sahabeden Câbir b. Abdullah’a ve İbn Ömer’e ulaşmıştır. Fatıma bintil Münzir b. Zübeyr b. Avvam; Hişâm b. Urve’nin hanımıdır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1154,
			"arabicnumber": 1154,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1155,
			"arabicnumber": 1155,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1156,
			"arabicnumber": 1156,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyet edilmiştir: “Berire hürriyetine kavuşturulduğu gün onun kocası; Muğîre oğullarının siyah bir kölesi idi. Vallahi onu Medîne sokakları ve çevrelerinde hâlâ görür gibiyim göz yaşları sakallarını ıslatmakta Berire’nin kendisini seçmesi için memnun etmeye çalışmaktadır. Fakat Berire’de bunu yapmadı.” (Ebû Dâvûd, Talak: 18; Müslim, Itk: 2) Bu hadis hasen sahihtir. Saîd b. ebî Arûbe, Saîd b. Mıhran’dır. Ebû’n Nasr diye künyelenir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1157,
			"arabicnumber": 1157,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Çocuk döşek sahibinindir zina edene ise mahrumiyet vardır.” (Müslim, Rada; 10) Bu konuda Ömer, Osman, Âişe, Ebû Umâme, Amr b. Hârice, Abdullah b. Amr, Berâ b. Âzib ve Zeyd b. Erkâm’dan da hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen sahihtir. Peygamber (sallallahü aleyhi ve sellem)’in ashabından bazı ilim adamları uygulamalarını bu hadisle yaparlar. bu hadisi Saîd b. Müseyyeb’den, Ebû Seleme’den ve Ebû Hüreyre’den rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1158,
			"arabicnumber": 1158,
			"text": "Câbir b. Abdullah (radıyallahü anh)’den rivâyete göre: “Peygamber (sallallahü aleyhi ve sellem) bir kadın görmüştü de hanımlarından Zeyneb’in yanına girerek ihtiyacını gördü ve çıkarak şöyle buyurdu: “Bir kadın gelirken bazen şeytan kılığında ve şeytanın göreviyle gelebilir. Sizden biriniz böyle bir kadın gördüğünde ondan hoşlanır ve gönlü onda kalırsa hemen hanımının yanına gelsin cinsel ilişkide bulunsun çünkü onda bulunanın aynısı bunda da vardır.” (Müslim, Nikah: 2; Ebû Dâvûd, Nikah: 43) Bu konuda İbn Mes’ûd’tan da hadis rivâyet edilmiştir. Câbir hadisi hasen sahih garibtir. Hişâm ed Destevaî; Hişâm b. Senber’dir",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1159,
			"arabicnumber": 1159,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “İnsanlardan birisinin bir diğerine secde etmesini emredecek olsaydım kadının kocasına secde etmesini emrederdim.” (Tirmizî rivâyet etmiştir.) Bu konuda Muâz b. Cebel, Suraka b. Mâlik b. Cu’şum, Âişe, İbn Abbâs, Abdullah b. ebî Evfâ, Talk b. Ali, Ümmü Seleme, Enes ve İbn Ömer’den de hadis rivâyet edilmiştir. Ebû Hüreyre hadisi bu şekliyle yani Muhammed b. Amr, Ebû Seleme ve Ebû Hüreyre rivâyeti olarak hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1160,
			"arabicnumber": 1160,
			"text": "Talk b. Ali (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Erkek bir ihtiyacı için hanımını çağırdığında tandır başında ekmek yapıyor bile olsa hemen o işini bırakıp kocasının yanına gelsin.” (Tirmizî rivâyet etmiştir.) Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "Ümmü Seleme (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Hangi kadın kocası kendisinden razı olarak ölürse mutlaka Cennete girer.” (İbn Mâce: Nikah: 4) Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Müminlerin iman bakımından en olgun olanları ahlak yönünden de en güzel olanlarıdır. Sizin iyileriniz kadınlarına iyi davrananlardır.” (Ebû Dâvûd, Sünnet: 15) Bu konuda Âişe ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "Süleyman b. Amr b. Ahvas (radıyallahü anh)’den rivâyete göre, şöyle demiştir: veda haccında Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikte bulunan babam anlatmıştı. Allah’a hamd ederek söze başladı bazı hatırlatmalarda bulunarak va’zu nasihatte bulundu uzunca olan bu hadisin bir kısmında şöyle buyurdu: “Dikkat edin kadınlara karşı iyi davranmanızı tavsiye ederim, onlar size bağlılıkları ve yardımları yönünden esirler gibidir. Cinsel ilişki dışında onlardan fazla bir şey istemeyin, fazla yükler yüklemeyin. Ancak apaçık çirkin bir şey yaparlarsa o zaman onları yataklarında yalnız bırakın ve fazla olmamak şartıyla onları dövün. Size itâat ettikleri takdirde bahaneler arayarak onlara sıkıntı vermeyin. Dikkat edin sizin kadınlarınız üzerinde haklarınız olduğu gibi onlarında sizin üzerinizde hakları vardır. Sizin kadınlarınız üzerindeki hakkınız: Sevmediğiniz kimseleri evinize sokmamaları ve hoşlanmadığınız kimselerle konuşmamalarıdır. Dikkat edin sizin üzerinizde onların hakkı ise: Yedirmek ve giydirmek konusunda onlara iyi davranmanızdır.” (İbn Mâce: Nikah: 3; Ebû Dâvûd, Nikah: 40) Bu hadis hasen sahihtir. geçen (Avanün ındeküm)’ün manası: Elinizin altındaki esirler gibidir demektir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "Ali b. Talk (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir bedevi Peygamber (sallallahü aleyhi ve sellem)’e gelerek şöyle dedi: “Ey Allah’ın Rasûlü! Bizden biri çölde iken yellenir ve su da çok az olursa ne yapması gerekir? Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Sizden biriniz yellendiğinde hemen abdestini alsın, kadınlarınıza arkalarından yaklaşmayın, Allah hakkı söylemekten çekinmez.” (Ebû Dâvûd, Tahara: 81) Bu konuda Ömer, Huzeyme b. Sabit, İbn Abbâs ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. Ali b. Talk hadisi hasendir. işittim diyordu ki: Bu tek bir hadisten başka Ali b. Talk’ın Rasûlüllah (sallallahü aleyhi ve sellem)’den rivâyetini bilmiyoruz. Yine bu hadis Ali b. Talk’a mı ait yoksa Talk İbn Ali es Suhaymî’nin midir onu da bilmiyoruz. Buhariye göre anlaşılan bu hadisi rivâyet eden sahabeden başka birisidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah, bir erkeğe veya kadına arkasından yaklaşan kimseye rahmet bakışıyla bakmaz.” (Tirmizî rivâyet etmiştir.) Bu hadis hasen garibtir. hadisi Vekî’de rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "Ali (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Sizden biriniz yellendiğinde abdest alsın ve kadınlarınıza arkalarından yaklaşmayın.” (Ebû Dâvûd, Tahara: 81) Buradaki Ali, Ali b. Talk’tır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "Sa’d’ın kızı Meymûne (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ailesi dışındaki kimselere süslenerek görünmeye çalışan kadının durumu kıyamet günü gerçekleşecek karanlıklar gibidir, ona hiçbir şekilde aydınlık yoktur.” (Tirmizî rivâyet etmiştir.) Bu hadisi sadece Mûsâ b. Ubeyde’nin hadisinden bilmekteyiz. Mûsâ b. Ubeyde ise kendisi çok doğru bir kimse olmakla beraber hadis konusunda zayıf sayılmıştır. râvîler bu hadisi merfu olmaksızın Mûsâ b. Ubeyde’den rivâyet etmektedirler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah’ta kıskanır, mü’min’de kıskanır. Allah’ın kıskanması mü’min’in haramları işlemesinden dolayıdır.” (Buhârî, Nikah: 108; Nesâî, Nikah: 16) Bu konuda Âişe ve Abdullah b. Ömer’den de hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen garibtir. bu hadis; Yahya b. ebî Kesir’den, Ebû Seleme’den, Urve’den, Esma binti ebî Bekir’den de rivâyet edilmiştir. Her iki rivâyet de sahihtir. Haccac es Savvaf, Haccac b. Ebû Osman’dır. Ebû Osman’ın ismi ise Meysere’dir. Haccac, Ebûs Salt künyesiyle bilinir. Yahya b. Saîd onun güvenilir bir kimse olduğunu söylemektedir. Bekir el Attar, Ali b. el Medînî’nin bize şöyle dediğini aktarmıştır. Yahya b. Saîd el Kattan’a, Haccac es Savvaf’ı sorduğumda “Güvenilen zeki kabiliyetli bir kimsedir” dedi",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": 1171,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": 1172,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "Muâz b. Cebel (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Bir kadın dünyada kocasına eziyet ederse Cennet’te ona eş olacak hurîler şöyle derler: Kahrolasıca kadın o erkeğe eziyet etme o senin yanında misafirdir, senin yanından ayrılıp bize gelecektir.” (İbn Mâce, Nikah: 62) Bu hadis hasen garibtir. Ancak bu şekliyle bilmekteyiz. İsmail b. Ayyaş’ın Şamlılardan rivâyeti daha sahihtir. Onun Hicazlılardan ve Iraklılardan münker olan rivâyetleri vardır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 29
			}
		}
	]
}