{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"16": "The Book on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1387,
			"arabicnumber": 1387,
			"text": "Amr b. Şuayb (r.a.)’ın babasından ve dedesinden rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Bir kimse bir mü’mini bile bile öldürürse; öldürülen kimsenin velilerine bırakılır dilerlerse öldürülmesini isterler dilerlerse diyet alırlar. Diyet ise dört yaşına girmiş otuz dişi deve, beş yaşına girmiş otuz dişi deve, ve kırk hamile deveden oluşur. Anlaştıkları bir miktar varsa o miktar onlara aittir bu hüküm diyeti ağırlaştırmak için böyle verilmiştir.” Diğer tahric: Ebû Dâvûd, Diyât; İbn Mâce, Diyât Tirmizî: Abdullah b. Amr hadisi hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1388,
			"arabicnumber": 1388,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre: “Rasûlullah (s.a.v.), diyetin para olarak kıymetini oniki bin dirhem olarak kararlaştırdı.” Diğer tahric: Ebû Dâvûd, Diyat; İbn Mâce, Diyat",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1389,
			"arabicnumber": 1389,
			"text": "Saîd b. Abdurrahman el Mahzûmî, Sûfyân b. Uyeyne vasıtasıyla Amr b. Dînâr’dan, İkrime’den bu (1388.) hadisin benzerini rivâyet etmiş olup bu rivâyetinde “İbn Abbâs’tan” dememiştir. İbn Uyeyne’nin rivâyeti hakkında pek çok söz söylenmiştir. Tirmizî: Muhammed b. Müslim’den başka bu hadisi İbn Abbâs’tan rivâyet eden kimse bilmiyoruz. Bazı ilim adamlarının uygulaması bu hadise göre olup Ahmed ve İshâk bunlardandır. Bazı ilim adamları ise diyetin on bin dirhem olduğu görüşündedirler. Sûfyân es Sevrî ve Küfeliler bunlardandır. Şâfii diyor ki: Ben diyetin sadece deveden olduğunu biliyorum o da yüz deve veya onun bedelidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1390,
			"arabicnumber": 1390,
			"text": "Amr b. Şuayb (r.a.)’ın babasından ve dedesinden rivâyete göre, Nebi Sallallahu Aleyhi ve Sellem: “Kemiğe dayanacak kadar derin yaralamalarda her bir yaralama da beşer deve diyet vardır.” Diğer tahric: İbn Mâce, Diyât; Ebû Dâvûd, Diyât Tirmizî: Bu hadis hasendir. İlim adamlarının uygulaması bu hadise göredir. Sûfyân es Sevrî, Şâfii, Ahmed ve İshâk yaralamalarda beşer deve verilmesi görüşündedirler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": 1391,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “El ve ayak parmaklarının diyeti eşittir. Her parmak için diyet on devedir.” Diğer tahric: Ebû Dâvûd, Diyât; İbn Mâce, Diyât Tirmizî: Bu konuda Ebû Musa ve Abdullah b. Amr’dan da hadis rivâyet edilmiştir. Tirmizî: İbn Abbâs hadisi bu şekliyle hasen sahih garibtir. ilim adamlarının uygulaması bu hadise göredir. Şâfii, Ahmed, İshâk ve Sûfyân es Sevrî bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": 1392,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre, Nebi (s.a.v.) buyurdu ki: “Şu ve şu yani serçe parmak ile başparmak diyette eşittir.” Diğer tahric: İbn Mâce, Diyât; Ebû Dâvûd, Diyât Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": 1393,
			"text": "Ebûs Sefer (r.a.)’den rivâyet edildiğine göre, şöyle demiştir: Kureyş’den bir adam Ensâr’dan bir adamın dişini kırmıştı. Muaviye dişi kıran kimseye arka çıkınca dişi kırılan adam Muaviye’ye: “Ey Mü’minlerin emiri bu adam benim dişimi kırmıştır” dedi. Muaviye de: “Seni razı edeceğiz” dedi. Karşı taraf Muaviye üzerine baskın çıkıp Muaviye’yi bezdirip üstün çıkmaya çalışınca bu işe razı olmadı ve hasmınla ne halin varsa kendin hallediver dedi. Muaviye’nin yanında oturmakta olan Ebû’d Derdâ şöyle dedi: Rasûlullah (s.a.v.)’den işittim şöyle buyurmuştur: İki kulağımın işittiği kalbimin ezberlediği o söz şöyledir: “Bir kimsenin vücuduna bir zarar gelir de onu bağışlarsa Allah bu yaptığı affetmeden dolayı onun derecesini yükseltir ve günahını siler.” Ensârlı adam: “Bunu Rasûlullah (s.a.v.)’den bizzat kendin işittin mi?” diye sordu, Ebû’d Derdâ: “Kulaklarım dinledi kalbim kavradı” dedi. Ensârlı: “O halde o dişi ona bağışlıyorum” dedi. Muaviye: ''Seni mutlaka ödüllendireceğim dedi ve kendisine bir miktar mal verilmesini emretti. Diğer tahric: İbn Mâce, Diyât Tirmizî: Bu hadis garib olup sadece bu şekliyle bilmekteyiz. Ebûs Sefer’in, Ebû’d Derdâ’dan hadis dinlediğine ait bir bilgimiz yoktur. Ebûs Sefer’in adı; Saîd b. Ahmed İbn Muhammed es Sevrî olduğu da söylenmektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": 1394,
			"text": "Enes (r.a.)’den rivâyet edildiğine göre, şöyle demiştir: “Üzerinde gümüşten ziynet eşyası olan bir cariye şehrin dışına çıkmıştı. Bir Yahudi onu yakalayıp başını taşla ezerek ziynet eşyalarını almıştı. Son anlarında cariyeye ulaşıldı ve Rasûlullah (s.a.v.)’e getirildi de Rasûlullah (s.a.v.), sordu: Seni kim öldürmek istedi falan mı? Cariye başı ile işaret ederek hayır dedi o halde falan mı? dedi. Sonunda Yahudi’nin adını söyleyince başı ile evet dedi ve Yahudi yakalandı, suçunu da itiraf etti. Bunun üzerine Rasûlullah (s.a.v.) emretti de o Yahudi’nin başı da aynı şekilde iki taş arasında ezildi.” Diğer tahric: Müslim, Kasame; Nesâî, Kasame Tirmizî: Bu hadis hasen sahihtir. bazı ilim adamlarının uygulaması bu hadise göredir. Ahmed ve İshâk bunlardandır. Bazı ilim adamları ise: “Kısasın ancak kılıçla yapılabileceği” görüşündedirler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1395,
			"arabicnumber": 1395,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": 1396,
			"text": "Abdullah b. Mes’ûd (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Kıyamette kullar arasında ilk görülecek dava kan davalarıdır.” Diğer tahric: Buhârî, Rıkaak; Müslim, Kasame Tirmizî: Abdullah hadisi hasen sahihtir. Pek çok kimse bu hadisi A’meş’den bu şekilde merfu olarak rivâyet etmişlerdir. Bazıları da yine Â’meş’ten merfu olmaksızın rivâyet etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "Yine Abdullah (r.a.)’den rivâyet edildiğine göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Kullar arasında hükme bağlanacak ilk dava kan davalarıdır.” Diğer tahric: Buhârî, Rıkaak; Müslim, Kasame",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "Ebûl Hakem el Becelî’den rivâyete göre, şöyle demiştir: Ebû Saîd el Hudrî ve Ebü Hureyre’den işittim; Rasûlullah (s.a.v.)’in şöyle buyurduğunu hatırlattılar: “Gök ve yeryüzü halkı bir Müslüman’ın kanını akıtmak için birleşseler, Allah onların hepsini yüzüstü Cehenneme yuvarlar.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis garibtir. Ebûl Hakem el Becelî ise Abdurrahman b. Nu’min olup Küfelidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1399,
			"arabicnumber": 1399,
			"text": "Suraka b. Mâlik b. Cu’şum (r.a.)’dan rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.) ile beraber oldum, baba öldürülmesinden dolayı çocuğa kısas yapar, çocuğunu öldürdüğünden dolayı babaya kısas uygulamazdı.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadisi Suraka’nın rivâyetinden olduğunu sadece bu şekliyle bilmekteyiz. Bu hadisin senedi pek sağlam değildir çünkü bu hadisi İsmail b. Abbâs, Müsenna b. Sabbah’tan rivâyet etmiştir. Müsenna b. Sabbah hadiste zayıf görülen bir kimsedir. Yine bu hadis Ebû Hâlid el Ahmer vasıtasıyla Haccac b. Ertae’den, Amr b. Şuayb’den, babasından ve dedesinden de rivâyet edilmiştir. yine bu hadis Amr b. Şuayb’den mürsel olarakta rivâyet edilmiştir. Bu hadiste karışıklık vardır. İlim adamlarının uygulaması bu hadise göre olup; “Bir baba oğlunu öldürdürse onun karşılığında kendisi öldürülmez yine bir baba oğluna zina suçu isnad ettiğinde de kazf cezası tatbik edilmez.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "Ömer b. Hattâb (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.)’in şöyle buyurduğunu işittim: “Çocuğunu öldürmesi sebebiyle babaya kısas uygulanmaz.” Diğer tahric: İbn Mâce, Diyât",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Cezalar mescidlerde uygulanmaz! Baba çocuğunu öldürmesi sebebiyle öldürülmez.” Diğer tahric: İbn Mâce, Diyat Tirmizî: Bu hadisi merfu olarak bu senedle sadece İsmail b. Müslim’in rivâyetiyle bilmekteyiz. İsmail b. Müslim; Mekkelidir. Bazı hadisçiler bu kimse hakkında hafızası yönünden söz etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "Abdullah b. Mes’ûd (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Allah’tan başka itaat edilecek kimse tanımayan benim de Allah’ın kulu ve elçisi olduğumu kabul ederek Müslüman olan kişinin kanı ancak şu üç şeyden biri ile helal olur; 1- Zina eden evli kimse, 2- Cana karşı can, 3- Dinini terk edip İslam cemaatinden ayrılan kimse.” Diğer tahric: Ebû Dâvûd, Hudud Tirmizî: Bu konuda Osman, Âişe ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Tirmizî: İbn Mes’ûd hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Dikkat edin Allah’ın ve Rasûlünün güvencesi altında bulunan bir kimseyi her kim öldürürse Allah’a verdiği sözü bozmuş olur ve Cennetin kokusunu bile koklayamaz. Oysa Cennetin kokusu yetmiş yıllık mesafeden duyulur.” Diğer tahric: İbn Mâce, Diyât Tirmizî: Bu konuda Ebû Bekre’den de hadis rivâyet edilmiştir. Tirmizî: Ebû Hüreyre hadisi hasen sahihtir. Bu hadis Ebû Hüreyre’den değişik şekillerde de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre: “Nebi (s.a.v.), Âmir kabilesine mensub iki kişinin hata ile öldürülmesi üzerine onların velilerine Müslüman’a ödenecek kadar diyet verdi. Çünkü bu iki kimse Rasûlullah (s.a.v.)’den güvence almışlardı.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis garibtir. Sadece bu şekliyle bilmekteyiz. Ebû Sa’d el Bakkal’ın ismi Saîd b. Merzuban’dır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: “Allah fethini Peygamberine nasip edince Allah’a hamd-ü sena ederek bir konuşma yaptı ve şöyle dedi: ''Her kimin bir yakını öldürülmüş ise o kimse iki görüşten birini seçmek durumundadır. Ya affedecek veya kısas yapılmasını isteyecektir.” Diğer tahric: Buhârî, Diyât; İbn Mâce, Diyât Tirmizî: Bu konuda Vâil b. Hucr, Enes, Ebû Şüreyh, Huveylid b. Amr’dan da hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "Ebû Şureyh el Ka’bî (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Mekke’yi mukaddes kılan insanlar değil! Allah, mukaddes kılmıştır. Allah’a ve ahiret gününe inanan kimse orada asla kan dökmesin ve hiçbir ağacını da kesmesin. Rasûlullah (s.a.v.)’e fetih günü adam öldürmek mübah kılındı diyerek bir kimse öldürmeye ruhsat vermeye kalkışırsa dikkat edin onu muayyen bir zaman bana mübah kılmıştır herkese değil… Kıyamete kadar da haramlığı ve mukaddesliği devam edecektir. Siz ey Huzaa kabilesi insanları! Hüzeyl kabilesinden bu insanı öldürdünüz onun diyetini ben ödeyeceğim bundan sonra her kimin bir yakını öldürülürse onun ailesi iki şey arasında serbesttir. Ya katilin öldürülmesini tercih ederek kısas isterler veya diyet alırlar.” Diğer tahric: Müslim, Hac; Nesâî, Menasik Tirmizî: Bu hadis hasen sahihtir. Şeyban aynı şekilde Yahya b. ebî Kesîr benzerini rivâyet etmiştir. Ebû Şureyh el Huzâî’nin Peygamber (s.a.v.)’den şöyle aktardığı rivâyet edildi: “Her kimin bir yakını öldürülürse o kimse ya katilin kısasını ister veya affeder veya diyet alır.” Bazı ilim adamları bu görüşte olup Ahmed ve İshâk bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) zamanında bir adam öldürüldü, katil maktulün velisine teslim edildi. Katil: “Ey Allah’ın Rasûlü onu öldürmek istememiştim” dedi. Bunun üzerine Rasûlullah (s.a.v.) maktulün velisine şöyle buyurdu: “Dikkat et o doğru söylüyorsa ve buna rağmen sen de onu öldürürsen cehenneme girersin!” Adam da katili serbest bıraktı. Katilin elleri arkadan bağlı idi bunun üzerine bağlı bulunduğu kayışını sürükleyerek çıkıp gitti de bu adama bundan böyle kayışlı kimse denildi. Diğer tahric: Ebû Dâvûd, Diyât; İbn Mâce, Diyât Tirmizî: Bu hadis hasen sahihtir. “Nis’a” = ip ve urgan demektir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "Büreyde (r.a.)’in babasından rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.), bir orduya komutan göndereceğinde ona şu şekilde tavsiyede bulunurdu: “Allah’a karşı sorumluluk bilincinde olmayı beraberindeki Müslüman askerlere iyi davranmayı söyler şöyle buyurdu: Allah adıyla Allah yolunda savaşın Allah’tan gelen gerçekleri örtbas eden kafirlerle savaşın! Savaşın; fakat hainlik yapmayın öldürdüğünüz kimselerin gözünü oyup kulak ve burunlarını kesmeyin çocukları öldürmeyin…” Bu hadis uzuncadır. Diğer tahric: Ebû Dâvûd, Cihâd Tirmizî: Bu konuda Abdullah b. Mes’ûd’tan, Şeddâd b. Evs’den, Imrân b. Husayn’dan, Enes’den, Semure’den, Muğîre’den, Ya’la b. Mürre’den ve Ebû Eyyûb’den de hadis rivâyet edilmiştir. Tirmizî: Büreyde hadisi hasen sahih olup ilim adamları savaşta düşman askerlerinin gözünü oyup kulak ve burunlarını kesmeyi hoşgörmezler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"text": "Şeddâd b. Evs (r.a.)’den rivâyet edildiğine göre, Nebi (s.a.v.) şöyle buyurmuştur: “Allah, her işte iyi davranmayı emretmiştir, öldürdüğünüzde bile en az acı verecek şekilde öldürün hayvan boğazlayacağınızda hayvana fazla ızdırab verecek şekilde değil kolay bir şekilde kesin bıçağınızı bileyin ve hayvana fazla acı vermeyin.” Diğer tahric: Nesâî, Dehaya; Müslim, Sayd Tirmizî: Bu hadis hasen sahihtir. Ebûl Eş’as es San’ani’nin ismi Şurahbil b. Üdde’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.): “Ana karnındaki çocuğun düşürülmesine sebep olan kimseye ceza olarak erkek köle veya cariye verilmesini emretti.” Kendisine bu ceza verilen adam dedi ki: “Yemeyen, içmeyen ses çıkarmayan bir çocuk için diyet mi? Vereceğiz bu tip şeylerde bir şey vermek gerekmez” deyince; Rasûlullah (s.a.v.): ”Bu adam şair gibi konuşuyor. Evet Cenin’de gurre yani bir köle ve cariye vermek gerekir.” Diğer tahric: Nesâî, Kasame; Müslim, Kasame Tirmizî: Bu konuda Hamel İbn Mâlik b. Nabiğa ve Muğîre b. Şu’be’den de hadis rivâyet edilmiştir. Tirmizî: Ebû Hüreyre hadisi hasen sahihtir. ilim adamlarının uygulaması bu hadise göre olup bazıları derler ki: Gurre: Erkek köle veya cariye veya beşyüz dirhem paradır dediler. Kimi ilim adamları da at veya katırdır demişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "Muğîre b. Şu’be (r.a.)’den rivâyet edilmiştir. İki kadın bir erkeğin nikahında (kuma) idiler. Biri diğerine taş veya çadır direği atarak karnındaki ceninin düşmesine sebep oldu. Bunun için Rasûlullah (s.a.v.), düşürülen cenin için gurre yani bir köle veya cariye verilmesi hükmünü verdi, ödeme o kadının erkek akrabalarına yüklendi. Diğer tahric: Buhârî, Diyat; Müslim, Kasame Hasan diyor ki: Zeyd b. Hubab, Sûfyân vasıtasıyla Mansur’dan bu hadisin bir benzerini bize aktarmıştır. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "Ebû Cuhayfe (r.a.)’den rivâyete göre, şöyle demiştir: Ali’ye, Ey Mü’minlerin lideri dedim: Allah’ın kitabında olmayan fakat senin not ettiklerin arasında bildiğin şeylerden bahseder misin? Dedi ki: Ekinleri ve her türlü tohumları yayarak bitkileri bitiren ve canlıları yaratan hakkı için bildiğim şey: Allah’ın bir kişiyi Kur’ân’da anlayışlı kılmasından ve yazılı kağıtta bulunandan ibarettir. Ben de yazılı kağıtta ne var? Diye sordum. Dedi ki: Onda diyetin hükümleri, esirin kurtarılması kafir karşılığında kısas olarak bir mü’minin öldürülmemesi vardır.” Diğer tahric: Buhârî, Diyât Tirmizî: Bu konuda Abdullah b. Amr’dan da hadis rivâyet edilmiştir. Tirmizî: Ali hadisi hasen sahihtir. Bazı ilim adamlarının uygulaması bu hadise göredir. Sûfyân es Sevrî, Mâlik b. Enes, Şâfii, Ahmed ve İshâk bunlardan olup şöyle derler: “Bir mü’min, kafir karşılığında öldürülmez.” Bazı ilim adamları ise: “İslam devletinin veya bir Müslüman’ın emanında olan kafir bir kimse öldürülürse; öldüren Müslüman o öldürülen kimse karşılığında öldürülür.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "Amr b. Şuayb (radıyallahü anh)’in babasından ve dedesinden rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Bir Müslüman, bir kafir karşılığında kısas yapılarak öldürülmez.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "Semure (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Kim kölesini öldürürse onu öldürünüz kim de kölesinin organlarını keserse biz de onun organlarını keseriz.” Diğer tahric: Ebû Dâvûd, Diyât; Nesâî, Kasame Tirmizî: Bu hadis hasen garibtir. Tabiinden bazı ilim adamlarının uygulaması bu hadise göre olup İbrahim Nehaî bunlardandır. Bazı ilim adamları ise: Hür ile köle arasında can meselesinde ve organlar meselesinde kısas yoktur.” Hasan Basrî, Ata b. ebî Rebah, Ahmed ve İshak bunlardandır. Bir kısım âlimler de: “Kişi kendi kölesini öldürürse kısas yapılmaz, başkasının kölesini öldürürse kısas yapılır” derler. Sûfyân es Sevrî ve Küfeliler bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"text": "Saîd b. Müseyyeb (r.a.)’den rivâyet edildiğine göre Ömer: “Diyet baba tarafından akrabalar üzerinedir, kadın kocasının diyetinden miras olarak bir şey almaz” derdi. Dahhâk b. Sûfyân el Kılâbî kendisine Rasûlullah (s.a.v.)’in Ûşeym ed-Dababî’nin karısını kocasının diyetinden dolayı mirasçı yap diye yazdığını Ömer’e bildirdi. Diğer tahric: İbn Mâce, Diyât; Ebû Dâvûd, Feraiz Tirmizî: Bu hadis hasen sahihtir. İlim adamlarının uygulaması bu hadise göredir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "Katâde (r.a.)’den rivâyete göre, şöyle demiştir: Zürare b. Evfâ’nın, Imrân b. Husayn’dan şöyle aktardığını işittim: Bir adam bir adamın elini ısırmıştı adam elini çekince diğer adamın iki dişi sökülmüştü. Rasûlullah (s.a.v.)’e hükmetmesi için başvurdular da O’da şöyle buyurdu: “Biriniz kardeşini kuvvetli erkek devenin ısırması gibi ısırır mı? Senin dökülen dişlerin için diyet yoktur.” Bunun üzerine Allah: “… Dişe diş, yaralanmalarda da o yaranın benzeri bir karşılık vardır…” ayetini indirdi.” (Maide: 45) Diğer tahric: Buhârî, Diyât; Nesâî, Kasame Tirmizî: Bu konuda Ya’la b. Ümeyye ve kardeşi olan Seleme b. Ümeyye’den de hadis rivâyet edilmiştir. Tirmizî: Imrân b. Husayn hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "Behz b. Hakîm (r.a.)’in babasından ve dedesinden rivâyete göre: “Peygamber (s.a.v.), bir töhmet üzerine bir adamı hapsetti sonra suç'u sabit olmayınca o'nu tahliye etti.” Diğer tahric: Ebû Dâvûd, Akdıyye; Nesâî, Kat-us Sarik Tirmizî: Bu konuda Ebû Hureyre’den de hadis rivâyet edilmiştir. Tirmizî: Behz’in babasından ve dedesinden rivâyet ettiği hadis hasendir. İsmail b. İbrahim bu hadisi Behz b. Hakîm’den daha uzun bir şekilde rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "Saîd b. Zeyd (r.a.) şöyle demiştir: Rasûlullah (s.a.v.)’den işittim şöyle diyordu: “Kim malını müdafaa uğrunda öldürülürse şehîdtir, kim dini uğrunda öldürülürse şehîdtir, her kim kanını müdafaa uğrunda öldürülürse şehîdtir, kim çoluk çocuğu uğrunda öldürülürse o da şehîdtir.” Diğer tahric: Buhârî, Mezâlim Tirmizî: Bu hadis hasen sahihtir. Aynı hadisi pek çok kimse İbrahim b. Sa’d’den benzeri şekilde rivâyet etmişlerdir. Yakup, İbrahim b. Sa’d b. Abdurrahman b. Avf ez Zührî’nin oğludur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "Rafi’ b. Hadîç (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Abdullah b. Sehl b. Zeyd ile Muhayyısa b. Mes’ûd b. Zeyd bir yolculuğa çıktılar, Hayber’e vardıklarında kendi işleri için birbirlerinden ayrıldılar. Bir süre sonra Muhayyısa, Abdullah b. Sehl’i öldürülmüş olarak buldu. Birileri onu öldürmüştü, onu defnetti. Sonra Huveyyısa b. Mes’ûd, Abdurrahman b. Sehl ve Muhayyısa Rasûlüllah (sallallahü aleyhi ve sellem)’e geldiler. Abdurahman bu kimselerin yaşça en küçüğü olmasına rağmen arkadaşlarından önce konuşmaya davrandı. Rasûlüllah (sallallahü aleyhi ve sellem): “Büyüklere karşı saygılı ol” buyurdu. Bunun üzerine Abdurrahman sustu ve o iki arkadaşı konuştu, sonra onlarla beraber gerektiği yerde o da konuştu. Rasûlüllah (sallallahü aleyhi ve sellem)’e Abdullah b. Sehl’in öldürüldüğü yeri anlattılar. Rasûlüllah (sallallahü aleyhi ve sellem): “Ölen arkadaşınıza veya katile karşı hak kazanmak üzere elli sefer yemin eder misiniz? Buyurdu. Öldüreni görmediğimiz halde nasıl yemin edebiliriz dediler. Rasûlüllah (sallallahü aleyhi ve sellem), o halde Yahudiler elli yeminle sizi yemin etmekten kurtarsınlar. Diğerleri ise: Kafir bir toplumun yeminlerini nasıl kabul edebiliriz dediler. Bu durumu görünce; Rasûlüllah (sallallahü aleyhi ve sellem), öldürülen kimsenin diyetini kendisi verdi. (Müslim, Kasame: 1; Nesâî, Kasame: 3)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 39
			}
		}
	]
}