{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"20": "The Book on Vows and Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "Sabit b. Dahhak (r.a.)’den rivâyete göre, Nebi (s.a.v.) şöyle buyurmuştur: “Bir kulun bir Müslüman’ın elde edemeyeceği bir şeyi adaması yoktur, yani; mümkün olmayan şeyler adanmaz.” Diğer tahric: İbn Mâce, Keffare; Müslim, Nüzür Tirmizî: Bu konuda Abdullah b. Amr ve Imrân b. Husayn’dan da hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": 1528,
			"text": "Ukbe b. Âmir (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Adını anmadan adak adayana yemin keffâreti gereklidir.” Diğer tahric: Ebû Dâvûd, Eyman Tirmizî: Bu hadis hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "Abdurrahman b. Semure (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ey Abdurrahman! İdarecilik isteme, istediğin halde böyle bir işin başına geçersen ağır sorumluluklarla baş başa ve kendi haline yalnız bırakılırsın. Eğer idarecilik sana istemeden verilirse bu işte sana yardım edilir yalnız kalmazsın. Bir şey üzerine yemin ederde başka bir şeyi ondan daha hayırlı görürsen onu yap ve yemininin keffaretini öde.” (Ebû Dâvûd, Haraç: 2; Nesâî, Eyman: 14) Bu konuda Ali, Câbir, Adiyy b. Hatîm, Ebû’d Derdâ, Enes, Âişe, Abdullah b. Amr, Ebû Hüreyre, Ümmü Seleme ve Ebû Mûsâ’dan da hadis rivâyet edilmiştir. Abdurrahman b. Semure hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her kim bir şeyi yapmamaya veya yapmaya yemin ederse sonra da yeminini bozmayı daha hayırlı bulursa yeminin yerine keffâret ödesin ve yemin ettiği şeyi yapsın.” (Müslim, Eyman: 3; Nesai, Eyman: 14) Bu konuda Ümmü Seleme’den de hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göredir. Yemini bozmadan önce keffâret ödemek caizdir. Mâlik, Şâfii, Ahmed ve İshâk bu görüştedir. Bazı ilim adamları ise şöyle derler: Yeminini bozduktan sonra keffâret ödemesi daha uygundur demektedirler. Sûfyân es Sevrî diyor ki: Yemini bozduktan sonra keffâret ödemesi bana göre daha hoştur. Yemini bozmadan önce keffaretini öderse bu da yeterlidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "Sâlim’in babası Abdullah b. Ömer (r.a.)’den rivâyete göre: “Ömer, babam hakkı için babam adına derken Rasûlullah (s.a.v.) onun bu sözünü işitti ve şöyle buyurdu: Allah atalarınız adına yemin etmekten sizi yasaklıyor. Bunun üzerine Ömer bundan sonra ne kendi sözüm olarak nede bir başkasından naklederek baba adına yemin etmedim. Bu sözü ağzıma almadım.” Diğer tahric: Müslim, Eyman; İbn Mâce, Keffare Tirmizî: Bu konuda Sabit b. Dahhâk, İbn Abbâs, Ebû Hüreyre, Kuteyle ve Abdurrahman b. Semure’den de hadis rivâyet edilmiştir. Tirmizî: İbn Ömer hadisi hasen sahihtir. Tirmizî: Ebû Ubeyd diyor ki: Hadiste geçen “Vela Âsiran” kelimesinin anlamı onu başkasından da nakletmedim yani başkasının sözü olsa bile dilime almadım",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "İbn Ömer (r.a.)’den rivâyete göre: Ömer bir kâfilede iken ve babası adına yemin edip dururken Rasûlullah (s.a.v.) ona ulaştı ve şöyle buyurdu: “Allah atalarınız adına yemin etmekten sizi yasaklıyor. Bundan böyle yemin edecek kimse ya Allah adına yemin etsin veya sussun.” Diğer tahric: Müslim, Eyman; İbn Mâce, Keffare Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "Sa’d b. Ubeyde (radıyallahü anh)’den rivâyete göre, İbn Ömer bir adamın “Ka’be’ye yemin olsun ki hayır” dediğimi işitince şöyle dedi: “Allah’tan başkası adına yemin edilmez. Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim şöyle diyordu: Kim Allah’tan başkası adına yemin ederse kafir veya müşrik olmuş olur.” (Müslim, Eyman: 1; Ebû Dâvûd, Eyman: 4) Bu hadis hasendir. Bu hadis bazı ilim adamlarınca şöyle tefsir edilmiştir: “Kafir veya müşrik olmuş olur.” Sözü hükmü ağırlaştırmak için söylenmiştir. İbn Ömer hadisi buna delildir. Çünkü o hadiste: “Rasûlüllah (sallallahü aleyhi ve sellem), Ömer’in babam için babam adına diyerek yemin ettiğini duyunca Allah sizi bu tür yeminlerden de yasakladı” buyurmuştur. Yine aynı şekilde Ebû Hüreyre tarafından rivâyet edilen: “Kim yemininde lat ve uzza hakkı için derse hemen lailahe illallah desin” hadiste buna delil olabilir. Bu hadis Rasûlüllah (sallallahü aleyhi ve sellem)’den rivâyet edilen “Riya şirktir” hadisine de benzer. İlim adamlarından bazıları (18 Kehf: 110. âyet)’inde geçen “Vela yüşrik” kelimesini “Gösteriş yapmamak” şeklinde yorumlanmıştır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "Enes (r.a.)’den rivâyet edilmiştir. Dedi ki: Bir kadın Ka’be’ye yürüyerek gitmeyi adadı bu adamanın durumu Rasûlullah (s.a.v.)’e soruldu da buyurdular ki: “Allah’ın o kadının yürüyerek Ka’be’ye gitmesine ihtiyacı yoktur. Emredin ona binite binsin ve Ka’be’ye öylece gitsin.” Diğer tahric: Ebû Dâvûd, Eyman; Müslim, Nüzür Tirmizî: Bu konuda Ebû Hüreyre, Ukbe b. Âmir ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Tirmizî: Enes hadisi bu şekliyle hasen sahih garibtir. Bazı ilim adamlarının uygulaması bu hadise göre olup derler ki: “Bir kadın yürümeyi adarsa bir binite binsin ve bir koyun kurban etsin.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "Enes (r.a.)’den rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.) iki oğlu ile koltuklanarak götürülen bir ihtiyara rastladı ne oluyor buna, nesi var? Diye sordu. Dediler ki: Yürüyerek hacca gitmeyi adamış; bunun üzerine Rasûlullah (s.a.v.) buyurdular ki: Allah’ın bu kimsenin kendisine işkence etmesine ihtiyacı yoktur. Enes: Rasûlullah (s.a.v.) ona bir binite binmesini emretti.” Diğer tahric: Ebû Dâvûd, Eyman; Müslim, Nüzür Muhammed b. Müsenna, İbn ebî Adiyy vasıtasıyla Humeyd’den, Enes’den; Rasûlullah (s.a.v.)’in bir kişi gördüğünü rivâyet ederek bu hadisin benzerini aktardı. Bu hadis sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Nezir (adak) denilen şeyi yapmayın çünkü; kaderden bir şeyi değiştirmez; Cimri olanın elinden mal çıkarılmış olur.” Diğer tahric: Müslim, Nüzür; İbn Mâce, Keffare Tirmizî: Bu konuda İbn Ömer’den de hadis rivâyet edilmiştir. Tirmizî: Ebû Hureyre hadisi hasen sahih olup Rasûlullah (s.a.v.)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göredir. Nezr’i hoş karşılamazlar. Abdullah b. Mübarek; gerek Allah’a kulluk gerekse Allah’a isyan etmekte nezretmenin hoş olmayışı hakkında şöyle diyor: Bir kimse Allah’a kulluk konusunda nezir yapar ve nezrini de yerine getirirse bu hususta kendisi sevap kazanır nezretmesi hoş olmasada…",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "Sâlim b. Abdullah (r.a.)’ın babasından rivâyete göre, Rasûlullah (s.a.v.), çoğu kere şu yemini kullanırdı: “Kalbleri halden hale değiştirene yemin ederim ki hayır.” Diğer tahric: Ebû Dâvûd, Eyman; İbn Mâce, Kaffare Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.)’den dinlemiştim şöyle buyuruyordu: “Her kim mü’min bir köleyi hürriyetine kavuşturursa o kölenin her bir organı karşılığında onun bir organını hatta o kölenin tenasül uzvu karşılığında o kimsenin tenasül uzvunu ateşten kurtarır.” Diğer tahric: Buhârî, Itk; Müslim, Itk Tirmizî: Bu konuda Âişe, Amr b. Abese, İbn Abbâs, Vasile b. Eskâ, Ebû Umâme, Ukbe b. Âmir ve Ka’b b. Mürre’den de hadis rivâyet edilmiştir. Tirmizî: Ebû Hüreyre hadisi bu şekilde hasen sahih garibtir. İbn’ül Hâd’ın adı: Yezîd b. Abdullah b. Üsâme b. Hâd olup Medîneli güvenilir bir kimsedir. Kendisinden Mâlik b. Enes ve pek çok ilim adamı hadis rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "Süveyd b. Mukarrin el Müzenî (r.a.)’den rivâyete göre, şöyle demiştir: “Biz yedi kardeş idik ve sadece bir hizmetçimiz vardı, kardeşlerimden birinin onu tokatlaması üzerine Rasûlullah (s.a.v.) onu hürriyetine kavuşturmamızı bize emretti.” Diğer tahric: Müslim, Eyman; Ebû Dâvûd, Edep Tirmizî: Bu konuda İbn Ömer’den de hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir. pek çok kişi bu hadisi Husayn b. Abdurrahman’dan rivâyet etmiştir. Bazı râvîler bu hadiste “Cariyenin yüzüne tokat vurdu” demektedirler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "Sabit b. Dahhâk (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her kim İslam dininden ve milletinden başka bir dinden olmak üzere yalan yere yemin ederse o kimse o söylediği din sahibi gibidir.” (Buhârî, Eyman: 7; İbn Mâce, Keffare: 3) Bu hadis hasen sahihtir. İlim adamları bu konuda değişik görüşler ortaya koymuşlardır. Bir kısmı: Bir kimse İslamın dışında bir din ve sistem adına yemin ederse yani Yahudi ve Hıristiyan olmaya veya yapacağı şeyi yaptığı takdirde büyük bir günah işlemiş olur ve böyle bir şey için de keffâret gerekmez derler. Medînelilerin görüşü budur. Mâlik b. Enes ve Ebû Ubeyd’te aynı görüştedir. Peygamber (sallallahü aleyhi ve sellem)’in ashabından tabiin döneminden ve başkalarından bazı ilim adamları ise böyle bir durumda o kişiye yemin keffâreti gerekir demektedirler. Ahmed ve İshâk bu görüştedirler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "Ukbe b. Âmir (r.a.)’den rivâyete göre, şöyle demiştir: “Ey Allah’ın Rasûlü! Dedim: Kız kardeşim Ka’be’ye yalınayak ve başı çıplak olarak gitmeyi nezretti. Bunun üzerine Rasûlullah (s.a.v.) şöyle buyurdu: Kız kardeşinin kendine zulmetmesiyle Allah ona sevap yazacak değildir. Bir binite binsin başını örtsün ve üç gün oruç tutsun” buyurdular. Diğer tahric: Müslim, Nüzür; Ebû Dâvûd, Eyman Tirmizî: Bu konuda İbn Abbâs’tan da hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen olup ilim adamlarının uygulaması bu hadise göredir. Ahmed ve İshâk’da bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Kim yemin eder ve yemininde lat ve uzza adına derse hemencecik La ilahe illallah desin. Her kim de gel kumar oynayalım derse hemen sadaka versin.” Diğer tahric: Müslim, Eyman Ebû Dâvûd, Eyman Tirmizî: Bu hadis hasen sahihtir. Ebû’l Muğıre Hımıslı olup Havlanî’dir. İsmi Abdulkuddûs b. Haccac’tır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre, Sa’d b. Ubâde, annesinin üzerinde bulunan ve ödeyemeden vefat ettiği bir nezr hakkında Rasûlullah (s.a.v.)’den fetva sorunca; Rasûlullah (s.a.v.): “Onun yerine o borcunu sen yerine getiriver” buyurdular. Diğer tahric: Müslim, Nezr; İbn Mâce, Keffare Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "Ebû Umâme (r.a.) ve Rasûlullah (s.a.v.)’in ashabından daha başkalarından rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurdu: “Herhangi bir Müslüman kimse Müslüman bir köleyi hürriyetine kavuşturur ise o köle o kimsenin ateşten kurtuluşuna sebep olur. Kölenin her organı onun bir organını ateşten kurtarır. Herhangi bir Müslüman kişi iki Müslüman kadın köleyi hürriyetine kavuşturur ise o iki kadın, o hürriyetine kavuşturan kimsenin ateşten kurtuluşuna sebep olur. Onların her bir organı o kimsenin bir organını ateşten kurtarmış olur. Herhangi bir Müslüman kadın Müslüman kadın köleyi hürriyetine kavuşturursa kendisinin ateşten kurtuluşuna sebep olur. O cariyenin her bir organı onun her bir organını ateşten kurtarır.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis bu şekliyle hasen garibtir. Tirmizî: Bu hadis erkek köleyi hürriyetine kavuşturmanın cariyeyi hürriyetine kavuşturmaktan daha değerli olduğunu gösteriyor. Hadiste anlatıldığı şekilde bu hadis tüm geldiği şekillerde sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		}
	]
}