{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"21": "The Book on Military Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "Ebû’l Bahterî (radıyallahü anh)’den rivâyet edilmiştir. Selman-ı Farisî’nin komutanı olduğu islam ordularından biri İran kalelerinden birini kuşattı, Askerler, Selman’a: Ey Ebû Abdullah onlara karşı taarruza geçmeyecek miyiz? Dediler. bırakın beni Rasûlüllah (sallallahü aleyhi ve sellem)’den işittiğim gibi ben onları İslam’a davet edeyim dedi ve muhasara altındaki kalenin içindeki insanlara gelerek şöyle konuştu: Ben de sizin gibi bir insanım ve İranlıyım, Arap olan şu askerlerin bana itâat ettiklerini görüyorsunuz. Eğer Müslüman olursanız bizim gibi aynı haklara sahip olacak aynı mesuliyetleri yükleneceksiniz. Eğer dininiz üzere kalmakta ısrar ederseniz boyunlarınız eğilmiş olarak bize cizye verin sizi dininiz üzere bırakalım bizim idaremiz altında yaşayın… Selman; Farsça olarak onlara şöyle konuşmasını sürdürdü: Hiçbir yönden üstün övülen kişiler değilsiniz. Eğer tüm bu tekliflerimizi kabul etmez iseniz her toplum gibi sizinle de savaşacağız… da: Biz cizye vermeyiz ve sizinle savaşacağız dediler. bunun üzerine askerler Selman’a: haydi artık taarruz etmeyelim mi? Dediler. Selman hayır dedi. Muhasara altındakileri üç gün davet ettikten sonra askerlere taarruz ediniz emrini verdi. Bunun üzerine biz de taarruz ettik ve sonunda kaleyi fethettik. (Ebû Dâvûd, Cihâd: 82) Bu konuda Büreyde, Numân b. Mukarrin, İbn Ömer, İbn Abbâs’tan da hadis rivâyet etmiştir. hadisini sadece Atâ b. Sâib rivâyetiyle bilmekteyiz. Muhammed’den işittim diyordu ki: Ebûl Bahterî, Ali’ye ulaşmadığı için Selman’a da ulaşmamıştır; çünkü Selman, Ali’den önce vefat etmiştir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göre olup kafirleri savaştan önce İslam’a davet etmeyi öngörmüşlerdir. İshâk b. İbrahim’in görüşü budur ve şöyle der: “Savaştan önce davet yapılırsa bu güzel olur ve İslam askerlerinin heybetini artırır.” Bazı ilim adamları ise “Bugün için davete gerek yoktur.” Ahmed diyor ki: Bugün İslam’dan haberi olmayan ve davet edilmesi gereken bir kimsenin var olduğunu bilmiyorum. Şâfii diyor ki: Düşman, İslam’a davet edilmeden savaşa başlanmaz. düşman orduları buna fırsat vermedikleri ve savaş için acele ettikleri zaman davetin kendilerine ulaşmış olduğu kabul edilir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "İbn Isam el Müzenî (radıyallahü anh)’ın babasından rivâyete göre, ki Peygamberle sohbet eden birisidir, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), bir ordu ve akıncı birliği göndereceğinde onlara şöyle derdi: Savaş için gittiğiniz bölgede bir mescid görürseniz ve ezan sesi işitirseniz o bölge halkından kimseyi öldürmeyin.” (Ebû Dâvûd, Cihâd: 91) İbn Uyeyne hadisi garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "Enes (radıyallahü anh)’den rivâyet edildiğine göre: Rasûlüllah (sallallahü aleyhi ve sellem), Hayber’e savaş için çıktı ve geceleyin oraya vardı. Bir topluma geceleyin varırsa oraya baskın yapmaz sabah olmasını beklerdi. Sabah olunca Yahudiler ellerinde sepetleri ve tarım aletleriyle kalelerinden çıktılar. Karşılarında İslam ordusunu görünce vallahi güçlü ve yeterli ordusuyla Muhammed! Ordusu beş bölümden oluşan Muhammed dediler. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allahû ekber Hayber mutlaka yıkılıp elimize geçecektir. Biz İslam askerleri bir toplumun memleketine girersek uyarılan o kafirlerin sabahı çok kötü olur.” (Müslim, Cihâd ve Siyer: 1; Buhârî, Cihâd ve Siyer: 129)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "Ali b. Hucr, İsmail b. Cafer vasıtasıyla A’lâ b. Abdurrahman’dan babasından ve Ebû Hüreyre’den rivâyet ettiklerine göre Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Altı konuda diğer Peygamberlerden üstün ve değerli kılındım: 1- Cevamiul Kelim = az sözcükte çok mana ifade etme kabiliyeti” bana verildi. 2- Düşmanların kaplerine Allah tarafından korku salınması sebebiyle daima savaşlarda galip geldim. 3- Ganimet malları ümmetler içersinde sadece bana helal kılındı. 4- Yeryüzünün tamamı benim için mescid ve tertemiz kılındı. 5- Tek bir topluma değil tüm insanlığa gönderildim. 6- Peygamberlik benimle son buldu ben son peygamberim.” (Müslim, Mesacid: 5) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Yolculuk yapmakta arkadaşların en hayırlı sayıda olanı dört kişidir. Müfrezelerin en hayırlı ve ideal olanı dört yüz kişilik olanıdır.” Orduların hayırlısı dört bin kişilik olanıdır. Oniki bin kişilik ordunun mağlub olması azlıktan dolayı değildir. (Ebû Dâvûd, Cihâd: 81; Dârimî, Siyer: 4) Bu hadis hasen garibtir. Bu hadisi Cerir b. Hazim’den başka pek çok kişi müsned olarak rivâyet etmemiştir. Aynı hadis Zührî vasıtasıyla Rasûlüllah (sallallahü aleyhi ve sellem)’den mürsel olarak rivâyet edilmektedir. Yine bu hadisi Habban b. Ali el Anezî; Ukayl’den, Zührî’den, Ubeydullah b. Abdullah’tan, İbn Abbâs’tan rivâyet etmiştir. Leys b. Sa’d; yine bu hadisi Ukayl’den ve Zührî’den mürsel olarak rivâyet etmektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "Âb-il Lahm’ın azâdlı kölesi Umeyr (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Efendilerimle birlikte Hayber gazvesinde bulundum. Benim hakkımda Rasûlüllah (sallallahü aleyhi ve sellem) ile konuştular ve ona benim köle olduğumu söylediler. Rasûlüllah (sallallahü aleyhi ve sellem) emretti de kılıç kuşandım birde baktım ki yaşımın küçük boyumun kısa olmasıyla kılıç yerde sürünüyor. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) bana bazı hurda eşyalar verilmesini emretti sonra ben Rasûlüllah (sallallahü aleyhi ve sellem)’e akıl hastalarını okuyup tedavi ettiğim bir muska gösterdim. Oda ondan bazı bölümlerini atıp bazı bölümlerini tutmamı bana emretti. (Ebû Dâvûd, Cihâd: 141; Müslim, Cihâd: 48) konuda İbn Abbâs’tan da hadis rivâyet edilmiştir. hadis hasen sahihtir. ilim adamlarının uygulaması bu hadise göre olup köleye hisse verilmez ancak bahşiş olarak bir şeylerle, kölenin gönlü alınmış olur. Sevrî, Şâfii, Ahmed ve İshâk bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "İbn ebî Ömer Sûfyân vasıtasıyla Yahya b. Saîd’den aynı senedle bu hadisin bir benzerini bize aktarmıştır. Bu konuda Avf b. Mâlik, Hâlid b. Velid, Enes, Semure’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Muhammed, Ebû Katâde’nin azâd edilmiş kölesidir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göredir. Evzâî, Şâfii, Ahmed bunlardandır. ilim adamları ise devlet başkanının öldürülen kafirin şahsi eşyasından beşte bir ayırma hakkı vardır derler. Tenfil şu demektir diyor: “Devlet başkanının kim bir şey elde ederse kendisinin olsun kimde düşmandan birisini öldürürse onun şahsî eşyası onun olsun demesinden ibarettir ki bu caizdir. Bunda beşte bir ayırmak yoktur. ise şöyle der: Seleb, yani öldürülenin şahsi eşyası öldüren askerin kendisinindir. Ancak çok miktarda bir şeyler olursa ve devlet başkanı da ondan beşte bir almayı da uygun bulursa bu durumda alınabilir. Ömer b. Hattâb’ın yaptığı gibi",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "Ebû Saîd el Hudrî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) taksim edilmeden önce askerlerin birbirlerine hisselerini satmalarını yasakladı.” (Dârimî, Siyer: 36) konuda Ebû Hüreyre’den de hadis rivâyet edilmiştir. Bu hadis garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "Irbad b. Sâriye (radıyallahü anh)’nin babasından haber verdiğine göre: “Rasûlüllah (sallallahü aleyhi ve sellem), savaşta elde edilen hamile kadınlara doğum yapıncaya kadar cinsel ilişki kurulmasını yasakladı.” (Dârimî, Cihâd: 38) Bu konuda Rüfey’ b. Sabit’den de hadis rivâyet edilmiştir. Irbad hadisi garibtir. İlim adamlarının uygulamaları bu hadise göre olup Evzâî der ki: Bir kimse savaş esirlerinden hamile olan bir cariye satın alırsa Ömer’den rivâyet edilen cariyeye doğumunu yapıncaya kadar cinsel ilişki kurulmaz kaidesine göre bu iş böyledir. Evzâî: Hür kadınlara gelince iddet beklemeleri emredildiğine dair sünnet geçerlidir. bu her iki sözünü de Ali b. Haşrem, Îsa b. Yunus vasıtasıyla Evzâî’den bana aktarmışlardır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "Kabîsa b. Hülb (radıyallahü anh) babasından aktardığına göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem)’e Hıristiyanların yemeklerinden yemenin durumunu sorduğumda şöyle buyurdu: Herhangi bir yemekten dolayı sakın kalbine bir şüphe düşmesin değilse bu konuda şüphelenen ve aşırı giden Hıristiyanlara benzemiş olursun.” (İbn Mâce, Cihâd: 26; Buhârî, Zebaih: 14) Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Ali (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Cibril kendisine geldi ve şöyle dedi: “Onları yani ashabını Bedir esirleri hakkında serbest bırak ya öldürülmelerini veya gelecek yıl kendilerinden onlar kadar kimse öldürmek şartıyla fidye almayı tercih etsinler.” Ashab ta: “Fidye almayı ve bizden de bir o kadar öldürülmemizi tercih ediyoruz” dediler. (Tirmizî rivâyet etmiştir.) konuda İbn Mes’ûd, Enes, Ebû Berze, Cübeyr b. Mut’ım’dan da hadis rivâyet edilmiştir. Bu hadis Sevrî’nin rivâyeti olarak hasen garibtir. Bu hadisin Sevrî’nin rivâyetinden olduğunu sadece İbn ebî Zaide’nin rivâyetiyle bilmekteyiz. Üsâme, Hişâm’dan, İbn Sirîn’den, Ubeyde’den ve Ali’den de benzeri şekilde rivâyet edilmiştir. Avn; İbn Sirîn’den, Ubeyde’den, Ali’den mürsel olarak rivâyet ediyor. Dâvûd el Haferî’nin adı Ömer b. Sa’d’tır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "Imrân b. Husayn (radıyallahü anh)’den rivâyete göre; Rasûlüllah (sallallahü aleyhi ve sellem), Müslümanlardan iki kişi karşılığında müşriklerden bir kişiyi serbest bırakmıştı. (Dârimî, Siyer: 28) Bu hadis hasen sahihtir. Ebû Kılâbe’nin amcası Ebû’l Mühelleb’tir. İsmi Abdurrahman b. Amr’dır. Muaviye b. Amr olduğu da söylenmektedir. Ebû Kılâbe’nin ismi Abdullah b. Zeyd el Cermiy’dir. (sallallahü aleyhi ve sellem)’in ashabından ve sonrakilerden ilim adamlarının çoğunluğunun uygulaması bu hadise göre olup devlet başkanının esirlerden dilediğini serbest bırakma dilediğini öldürme dilediğini de fidye mukabili salıverme hakkı vardır. Derler. Bazı ilim adamları ise öldürülmelerini fidye almaya tercih ederler. der ki: Kıtal (Muhammed) sûresi 4. ayetinin Bakara sûresi 191. ayetiyle neshedilip hükmünün kaldırıldığı bize ulaşan bilgiler arasındadır. şekilde Hennâd, İbn’ül Mübarek vasıtasıyla Evzâî’den bize hadis rivâyet etmiştir. b. Mansur diyor ki: Ahmed’e: Esir alınan kişinin öldürülmesi mi yoksa fidye alınarak salıverilmesi mi sence daha sevimlidir? Diye sordum. Şöyle cevap verdi: “Fidye vermeye gücü yeterse bunda bir sakınca yoktur öldürüldüğünde de yine bir sakınca yoktur.” İshâk diyor ki: Esirlerin kılıçtan geçirilmesi benim hoşuma gider ama tanınmış biri olursa pek çok kimsenin dikkatini çekmek için gerekenin yapılmasını da severim",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "İbn Ömer (radıyallahü anh)’in haber verdiğine göre: “Rasûlüllah (sallallahü aleyhi ve sellem)’in savaşlarının birinde bir kadın öldürülmüş olarak bulundu, Rasûlüllah (sallallahü aleyhi ve sellem) bunu çirkin gördü ve kadınlarla çocukların öldürülmesini yasakladı.” (Dârimî, Siyer: 25; Buhârî, Cihâd: 146) konuda Büreyde, Rebah = Rebah b. er Rabî’ de denilir. Esved b. Seri’ İbn Abbâs ve Sa’b b. Cessâme’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise uygundur. Yani çocuk ve kadınların öldürülmesini hoş görmezler. Sûfyân es Sevrî ve Şâfii bunlardandır. Bazı ilim adamları ise geceleyin düşmana baskın yapmaya bu arada kadın ve çocuk öldürülmesine izin vermişlerdir. Ahmed ve İshâk’ın görüşü budur; gece baskın yapmaya izin vermişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "Sa’b b. Cessâme (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Ey Allah’ın Rasûlü dedim. Atlarımız müşriklerin kadın ve çocuklarından bir kısmını çiğnedi! Rasûlüllah (sallallahü aleyhi ve sellem)’de; Onlar babalarından bir parçadır.” Buyurdular. (Müslim, Cihâd ve Siyer: 9; Ebû Dâvûd, Cihâd, 111) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), bir miktar askerle beraber bizi savaş için gönderdi ve Kureyşten falan ve filanı bulursanız onları ateşte yakın buyurdu.” esnada ise şöyle dedi: Falan ve filanı ateşte yakınız diye emretmiştim fakat ateşle sadece Allah azâb eder, siz onları yakalarsanız öldürünüz. (Buhârî, Cihâd: 148; Dârimî, Siyer: 24) konuda İbn Abbâs, Hamza b. Amr ve Eslemî’den de hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen sahihtir. İlim adamlarının görüşü de bu hadise göredir. Muhammed b. İshâk bu hadisin senedine Süleyman b. Yesâr ile Ebû Hüreyre arasına bir kimse daha ilave etmiştir. Pek çok kimse Leys’in rivâyeti gibi rivâyet etmektedir. Fakat leys b. Sâd’ın rivâyeti daha sahih ve güzeldir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "Sevbân (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her kim kibirden, ganimete hainlik etmekten ve borçlanmaktan uzak olarak ölürse; (şirke düşmez ise) mutlaka Cennete girecektir.” (İbn Mâce, Sadaka: 12; Dârimî, Büyü: 52) konuda: Ebû Hüreyre ve Zeyd b. Hâlid el Cühenî’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "Sevbân (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Her kimin ruhu, cesedinden şu üç şeyden uzak olduğu halde ayrılırsa, (şirke düşmemiş ise) mutlaka Cennete girecektir;",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "Ömer b. Hattâb (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’e falan kimse şehîd oldu denildi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem)’de şöyle buyurdu: “Hayır! Ganimet malından aşırdığı bir elbise yüzünden o kişiyi Cehennem’de gördüm.” sonra şöyle buyurdu: “Kalk! Ey Ali, Üç sefer şöyle ilan et: Cennete sadece mümin olanlar girecektir.” (Müslim, İyman: 48) Bu hadis hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Ümmü Süleym ve onunla birlikte bazı kadınlarla savaşa katılırdı da onlar su dağıtırlar ve yaralıları tedavi ederlerdi.” (Müslim, Cihâd: 47; Ebû Dâvûd, Cihâd: 32) Bu konuda Rübeyyi’ binti Muavviz’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "Ali (radıyallahü anh)’den rivâyet edilmiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Kisra’nın kendisine gönderdiği hediyeyi kabul etmişti. Devlet başkanları kendisine hediye gönderirlerdi de onları kabul ederdi.” (Ebû Dâvûd, Harac: 33) konuda Câbir’den de hadis rivâyet edilmiştir. Bu hadis hasen garibtir. Süveyr b. ebî Fahîte’nin ismi Saîd b. İlâka’dır. Süveyr; Ebû Cehm künyesiyle anılır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "Iyaz b. Hımar (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem)’e bir adam tarafından bir şey veya bir deve hediye edilmişti de Rasûlüllah (sallallahü aleyhi ve sellem), O adama Müslüman oldun mu? Buyurdu, O’da hayır deyince Rasûlüllah (sallallahü aleyhi ve sellem), müşriklerin hediyelerini kabul etmem bana yasaklandı buyurdu.” (Ebû Dâvûd, Harac: 33) Bu hadis hasen sahihtir. geçen “Zeb’” kelimesi hediyeler anlamındadır. Rasûlüllah (sallallahü aleyhi ve sellem)’den müşriklerin hediyelerini kabul ettiği rivâyet edilmiştir. Bu hadiste ise böyle denmektedir. Muhtemeldir ki önceleri kabul ediyorken sonradan bu yasaklama getirilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "Ebû Bekre (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem) kendisini sevindiren bir haber aldı mı hemen Allah için secdeye kapanırdı.” (Ebû Dâvûd, Cihâd: 162) Bu hadis hasen garibtir; sadece bu şekilde Bekar b. Abdulaziz’in rivâyetiyle bilmekteyiz. İlim adamlarının çoğunluğunun uygulaması bu hadise göre olup şükür secdesi yapılabilir derler. Bekkar b. Abdulaziz b. ebî Bekre Hadis rivâyeti yönünden orta yollu bir kimsedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "Süleym b. Âmir (radıyallahü anh)’den rivâyete göre, şöyle diyordu: Muaviye ile Rumlar arasında bir sözleşme vardı. Muaviye bu anlaşma süresi bitmeden önce Rumların ülkesine doğru yola çıkmıştı. Anlaşma süresi sona erince onlara baskın yapacak ve onlarla savaşacaktı, derken; Allahû ekber, hayret size hıyanet değil sözünüzde durmanız gerekir diyerek atın üzerinde veya binitin üzerinde birisi çıkageldi. Bir de baktılar ki bu adam Amr b. Abese imiş Muaviye bu meseleyi kendisine sorunca şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim şöyle diyordu: “Kimin herhangi bir toplumla arasında bir anlaşma varsa süresi sona erinceye kadar, yada karşılıklı olarak anlaşmayı vaktinden önce bozduklarını birbirlerine bildirmeden önce bu bağı ne yeniden bağlasın ne de çözsün.” Bunun üzerine Muaviye seferden geri döndü. (Ebû Dâvûd, Cihâd: 152) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim şöyle diyordu: “Her sözünde durmayan kimse için kıyamet gününde bir sancak dikilecektir.” (Müslim, Cihâd: 4; Ebû Dâvûd, Cihâd: 150) Bu konuda Ali, Abdullah b. Mes’ûd, Ebû Saîd el Hudrî ve Enes’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Süveyd’in Ebû İshâk’tan, Umâra b. Umeyr’den ve Ali’den rivâyet ettiği “Her sözünde durmayan kimse için bir sancak dikilecektir.” Hadis hakkında sordum da şu cevabı verdi: “Bu hadisin merfu olarak rivâyet edildiğini bilmiyorum.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Hendek savaşında Sa’d b. Muâz yaralanmış ve kol damarlarından biri kopmuştu da Rasûlüllah (sallallahü aleyhi ve sellem) onu ateşle dağlayarak tedavi etmişti, Sa’d’ın kolu şişmişti. Sonra kanı tekrar bıraktı sonra tekrar dağlayarak tedavi etti fakat eli yine şişmişti Sa’d bu durumu görünce şöyle dedi: “Allah’ım, beni Kurayza’ya karşı yüzümü güldürmeden canımı alma.” Bunun üzerine Sa’d’ın damarından akan kan kesildi, Kurayza oğulları onun hükmüne uymak üzere gelinceye kadar hiçbir damla akmadı sonra Rasûlüllah (sallallahü aleyhi ve sellem) kendisine haber gönderdi o da şöyle hüküm verdi: “Erkeklerin öldürülmeleri kadınların sağ bırakılarak Müslümanların kendilerinden çeşitli hizmetlerde yararlanmaları.” Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): “Bunlar hakkında Allah’ın hükmüne isabet ettin” buyurdu. Bunlar dört yüz kişiydiler bunların öldürülme işlemleri bitirilince Sa’d’ın damarı patladı ve kan kaybından öldü. (Ebû Dâvûd, Tıp: 7; İbn Mâce, Tıp: 24) Bu konuda Ebû Saîd ve Atıyye el Kurazî’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "Semure b. Cündüp (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Müşriklerin yaşlılarını öldürün genç çocukların hayatlarını bağışlayın.” (Ebû Dâvûd, Cihâd: 111) Sakal ve bıyığı bitmemiş çocuk demektir Bu hadis hasen sahih garibtir. b. Ertae, Katâde’den bir benzerini rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "Amr b. Şuayb (radıyallahü anh)’in dedesinden rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), bir hutbesinde şöyle buyurdu: “Cahiliyye döneminde olsa bile verdiğiniz sözlerde durun yemininizi yerine getirin çünkü İslam bu işte daha fazla titizlik gösterir. İslam’da cahiliye dönemindeki yaptığınız miras ve benzeri sözleşmeler yaparak yenilikler ortaya koymayın.” (Müsned: 2/485) Bu konuda Abdurrahman b. Avf, Ümmü Seleme, Cübeyr b. Mut’ım, Ebû Hüreyre, İbn Abbâs ve Kays b. Âsım’dan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "Becâle b. Abde (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Münazir Valisi Cez’ b. Muaviye’nin katibi idim, Halife Ömer’den bize şu mektup geldi. Mektupta şöyle yazıyordu: “Vilayetinde bulunan Mecusilerin durumlarını kontrol ve tetkik ederek onlardan cizye vergisi al. Çünkü Abdurrahman b. Avf’ın bana haber verdiğine göre Rasûlüllah (sallallahü aleyhi ve sellem), Hecer Mecusîlerinden cizye alırdı. (Buhârî, Cizye: 1; Ebû Dâvûd, Haraç: 31) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "Becâle (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Ömer, kendisine Abdurrahman b. Avf’ın şu haberi vermesine kadar Mecusîlerden cizye vergisi almazdı o haber şöyleydi: “Rasûlüllah (sallallahü aleyhi ve sellem), Hecer Mecusilerinden cizye vergisi almıştı.” Bu hadis buradaki rivâyet edilenden daha uzundur. (Buhârî, Cizye: 1; Dârimî, Siyer: 59)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "Sâib b. Yezîd (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Bahreyn Mecusilerinden cizye almıştı. Ömer’de İranlı Mecûsilerden cizye almıştı. Yine Osman da, İranlılardan cizye vergisi almıştı.” (Muvatta, Zekât: 24) hadis hakkında Muhammed’e sordum o da şöyle dedi: Mâlik’in Zührî’den rivâyet ettiği bir hadistir",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "Ukbe b. Amîr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Ey Allah’ın Rasûlü! Bazı toplumların yanına uğramaktayız onlar bizi ne misafir ederler nede gereken hakkımızı verirler biz de onlardan zorla almayıp vazgeçiyoruz, ne buyurursunuz? Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: eğer sizi zorla almak durumunda bırakırlarsa onlardan zorla da olsa alın.” (Buhârî, Mezâlim: 18) Bu hadis hasendir. Bu hadisi Leys b. Sa’d, Yezîd b. ebî Habîb’den aynı şekilde rivâyet etmiştir. Bu hadisin manası şudur: Onlar savaşa çıktıklarında yolda uğradıkları değişik toplumlardan para karşılığında bile satın alacak yiyecek bulamazlardı. üzerine Rasûlüllah (sallallahü aleyhi ve sellem): “Satmamak suretiyle sizi zorla almak durumunda bırakırlarsa zorla alınız” buyurmuştur. hadislerde böylece tefsir edilmiştir. Ömer b. Hattâb’ın da aynı şekilde emir verdiği rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), Mekke fethedildiği gün şöyle buyurmuştur: “Mekke’nin fethedilmesinden sonra Mekke’de İslam ülkesi haline geldiğinden oradan başka yerlere hicret etmek yoktur. Fakat yeryüzünün her tarafını İslamlaştırmak için cihâd ve bu niyet üzere bulunmak vardır. Cihâd için sefere çağrıldığınızda hemen seferber olun.” (Nesâî, Biat: 11; Ebû Dâvûd, Cihâd: 2) Bu konuda Ebû Saîd, Abdullah b. Amr ve Abdullah b. Hubşî’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Sûfyân es Sevrî, Mansur b. Mu’temir’den benzeri şekilde bu hadisi rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’e söylediklerini dinlemek, dinlediklerimizle de yaşayıp itâat etmek üzere biat ederdik ve bize: “Gücünüz yettiği konularda” buyurdu. (Nesâî, Biat: 18) Bu hadis hasen sahihtir. İkisi de mana yönünden aynı olup sahihtir. Şöyle ki: Ashabından bir kısmı; kendisine ölüm üzere biat ederek sağ olduğumuz sürece yanında olacak ve beraber hareket edeceğiz demişlerdir. Diğer bir kısmıda her konuda birlikte olacağız ve kaçmayacağız diye biat etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Üç kişi vardır ki Allah onlarla konuşmayacak ceza ve azâbtan temize çıkarmayacak ve onlara acı azâb hazırlayacaktır. “Devlet başkanına biat edip kendisine mal para ve makam verilirse sözünde duran verilmezse sözünde durmayan kimse” (Diğer ikisini Tirmizî saymamıştır.) (Dârimî, Siyer: 10; Nesâî, Biat: 26) Bu hadis hasen sahihtir. İhtilafsız bu iş böylece kabul edile gelmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir köle gelip Rasûlüllah (sallallahü aleyhi ve sellem)’e hicret etmek üzere biat etti. Rasûlüllah (sallallahü aleyhi ve sellem) onun köle olduğunu bilmiyordu. Derken o kölenin efendisi geldi köleyi alıp götürmek istedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), o köleyi bana sat buyurdu ve onu iki siyah köle karşılığında satın aldı. Rasûlüllah (sallallahü aleyhi ve sellem) bu olaydan sonra köle olup olmadığını sormadan kimseden biat almadı. (Nesâî, Biat: 21) Câbir hadisi hasen garib sahihtir. Sadece Ebû’z Zübeyr’in rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": 1597,
			"text": "Ümeyme binti Rukayka (radıyallahü anh)’ın kızından rivâyete göre, şöyle diyor: Bir kısım kadınlarla birlikte Rasûlüllah (sallallahü aleyhi ve sellem)’e biat ettim, Rasûlüllah (sallallahü aleyhi ve sellem) bize gücünüz yettiği ve becerebildiğiniz şekilde biatınızı kabul ettim buyurdu. Ben de; Allah ve Rasûlü bize bizden daha merhametlidir dedim. Sonra bizim bu biatımızı kabul et dedim. Sûfyân: Bizimle tek tek Mûsâfaha et demek istiyor dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), şöyle buyurdu. “Benim yüz kadına birlikte konuşmam tek bir kadına konuşmam gibidir.” (Müslim, Imara: 21; Nesâî, Biat: 18) Yezîd bu konuda Âişe, Abdullah b. Ömer ve Esma binti Yezîd’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Bu hadisi sadece Muhammed b. Münkedir’in rivâyetiyle bilmekteyiz. es Sevrî, Mâlik b. Enes ve pek çok kimse bu hadisi Muhammed b. Münkedir’den benzeri şekilde rivâyet etmişlerdir. Muhammed’e bu hadis hakkında sordum şöyle dedi: Ümeyme binti Rukayka’yı bu hadisin dışında tanımıyorum Ümeyme isimli başka bir kadın râvî daha vardır ki Rasûlüllah (sallallahü aleyhi ve sellem)’den bazı hadisler rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "Berâ (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: “Kendi aramızda Bedir savaşına katılan kimselerin sayısını konuşur ve Tâlut’un adamlarının sayısı kadar yani üçyüz onüç olduğunu söylerdik.” (Buhârî, Meğazi: 6) Bu hadis hasen sahihtir. Sevrî ve başkaları bu hadisi Ebû İshâk’tan rivâyet etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyet edildiğine göre Rasûlüllah (sallallahü aleyhi ve sellem), Abdulkays heyetine şöyle dedi: “Size ganimet olarak elde ettiğiniz şeyin beşte birini vermenizi emrediyorum…” Bu hadis buradakinden biraz daha uzundur. (Ebû Dâvûd, Harac: 19) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "Rafi’ b. Hadîc (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) ile bir savaşta idik insanlardan ayağına çabuk olanlar ilerlediler ganimetlerden bir şeyler alıp pişirmeye başladılar. Rasûlüllah (sallallahü aleyhi ve sellem) askerin son gurubunda idi. Rasûlüllah (sallallahü aleyhi ve sellem), yemek pişirilen kapların yanından geçti ve emri üzerine bu kaplar dökülüp boşaltıldı sonra askerler arasında ganimeti taksim etti bir deveyi on koyuna eşit tuttu.” (İbn Mâce, Edahî: 6)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Herkim çapulculuk yağmalama yaparsa bizden değildir.” (İbn Mâce, Edahî: 16) Bu Enes hadisi hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Yahudi ve Hıristiyanlara önce siz selam vermeyin yolda onlardan biriyle karşılaşırsanız onları yolun en zor ve en dar yerinden geçmeye zorlayınız.” (Müslim, Selam: 4) Bu konuda İbn Ömer, Enes ve Peygamber (sallallahü aleyhi ve sellem)’in arkadaşı Ebû Basra el Gıfârî’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Yahudilerden biri size selam verdiğinde mutlaka şöyle selam verirler: “Es-Sâmü aleyke = geberesiceler, her türlü kötülük ve zehir size olsun. Siz de “ve aleyke” senin başına demek suretiyle onların selamlarını alınız. (Müslim, Selam: 4) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "Cerir b. Abdullah (radıyallahü anh)’den rivâyet edilmiştir. Rasûlüllah (sallallahü aleyhi ve sellem) Has’am kabilesine bir müfreze gönderdi. Orada bulunan insanlardan bir kısmı Müslüman olduklarını bildirip kendilerini korumak için secdeye kapandılarsa da müfreze öldürme işinde acele ederek onları da öldürdüler. Durum Rasûlüllah (sallallahü aleyhi ve sellem)’e ulaşınca onlardan her biri için yarım diyet ödenmesini emretti ve: “Ben müşrikler içerisinde yaşantısını devam ettiren her Müslüman’dan uzağım” buyurdu. Nedendir? Ey Allah’ın Rasûlü! Dediler. Çünkü onların yaktıkları ateşler birbirinden ayırt edilemez veya müşriklerle Müslümanların ateşleri birbirlerini görmesin yani çok yakın olup uzaktan bu yanan ateşin kimin olduğu belirsiz olur ve yanlışlıkla müşrik yerine Müslüman öldürülür buyurdular. (Ebû Dâvûd, Cihâd: 95)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "Hennâd (radıyallahü anh), Abde vasıtasıyla İsmail b. Ebû Hâlid’den, Kays b. Ebî Hâzim’den, Ebû Muaviye hadisinin bir benzerini rivâyet etmiş olup senedinde “Cerir’i” zikretmemiştir. Bu rivâyet daha sahihtir. konuda Semure’den de hadis rivâyet edilmiştir. İsmail’in arkadaşlarının çoğunluğu Kays b. ebî Hazîm’den rivâyet ederek senedinde “Cerir” i zikretmezler. b. Seleme, Haccac b. Ertae’den, İsmail b. ebî Hâlid’den, Kays’tan ve Cerir’den, Muaviye hadisinin bir benzerini rivâyet etmişlerdir. Muhammed’den işittim şöyle diyordu: Sahih olan Kays’ın Rasûlüllah (sallallahü aleyhi ve sellem)’den mürsel olarak yaptığı rivâyettir. Semure b. Cündüp Rasûlüllah (sallallahü aleyhi ve sellem)’den Şöyle rivâyet ediyor: “Müşriklerle aynı bölgede oturmayın onlarla cemaat olmayın veya onlarla evlenmeyin kim onlarla cemaat olur veya evlenirse onlar gibidir.”",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "Ömer b. Hattâb (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Eğer yaşarsam inşallah Arap yarımadasından Yahudi ve Hıristiyanları mutlaka çıkaracağım.” (Müslim, Cihâd: 21; Ebû Dâvûd, Harac: 21)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "Ömer b. Hattâb (radıyallahü anh), Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle söylediğini işitmiştir: “Yahudi ve Hıristiyanları, Arap yarımadasından mutlaka çıkaracağım orada sadece Müslümanlar kalacaklardır.” (Müslim, Cihâd: 21; Ebû Dâvûd, Harac: 21) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Fatıma Ebû Bekir’e gelerek şöyle sordu: Sana kim varis olur? Ailem ve çocuklarım dedi. Fatıma: O halde ben babama niçin varis olamıyorum deyince Ebû Bekir şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem)’i şöyle söylerken işittim: “Biz Peygamberler miras bırakmayız yani bize varis olunmaz.” Fakat Rasûlüllah (sallallahü aleyhi ve sellem)’in baktığı kimselere ben bakacağım onun nafakalarını temin ettiği kimselerin nafakalarını ben temin edeceğim. (Buhârî, Feraiz: 2; Nesâî, Fey taksimi: 1; Müslim, Cihâd: 16) Bu konuda Ömer, Talha, Zübeyr, Abdurrahman b. Avf, Sa’d ve Âişe’den de hadis rivâyet edilmiştir. Hüreyre hadisi bu şekliyle hasen garibtir. Bu hadisi sadece Hammad b. Seleme, Abdulvehhab b. Atâ’ vasıtasıyla Muhammed b. Amr’dan, Ebû Seleme’den, Ebû Hüreyre’den müsned olarak rivâyet ettiler. hadisi Muhammed’e sordum şöyle dedi: Bu hadisi Ebû Hüreyre’den, Ebû Seleme’den, Muhammed b. Amr’dan, Hammad b. Seleme’den başkasının rivâyet ettiğini bilmiyoruz. b. Atâ’, Muhammed b. Amr’dan, Ebû Seleme’den, Ebû Hüreyre’den, Hammad b. Seleme’nin rivâyetine benzer şekilde bu hadisi rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Fatıma, Ebû Bekir ve Ömer’in yanına geldi ve Rasûlüllah (sallallahü aleyhi ve sellem)’in mirasından sordu da Ömer ve Ebû Bekir dediler ki: Rasûlüllah (sallallahü aleyhi ve sellem)’den işittik şöyle diyordu: “Biz Peygamberlere mirasçı olunmaz” Fatıma: “Bu konuyu bir daha ikinizle hiç konuşmayacağım” Fatıma, bu konuyu konuşmadan öldü gitti. Ali b. Îsa der ki: “İkinizle konuşmayacağım” sözünün manası miras konusunda ikinizle hiç konuşmayacağım ikiniz de doğru dürüst kimselersiniz demektir. (Müslim, Cihâd: 16; Buahari, Feraiz: 2; Nesâî, Fey Taksimi: 1) hadis değişik bir şekilde Ebû Bekir’den de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "Mâlik b. Evs b. Hadesân (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Ömer b. Hattâb’ın yanına girmiştim. Aynı anda Osman b. Affân, Zübeyr b. Avvam, Abdurrahman b. Avf, Sa’d b. ebî Vakkâs’ta onun yanına gelmişlerdi. Sonra Ali ve Abbâs’ta davacı olarak oraya gelmişlerdi. Ömer bu seçkin kimselere dedi ki Sizden yeri ve göğü kanunlarıyla ayakta tutan Allah rızası için söylemenizi istiyorum. Rasûlüllah (sallallahü aleyhi ve sellem)’in: Bizden miras alınmaz biz miras bırakmayız, bizim bıraktığımız her şey sadakadır buyurduğunu biliyor musunuz? Dedi; Onlarda: “Evet” dediler. Bunun üzerine Ömer dedi ki: Rasûlüllah (sallallahü aleyhi ve sellem) vefat edince Ebû Bekir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)’in halifesiyim ve velisiyim dedi. Sen Abbâs! Ali ile beraber Ebû Bekir’e geldin. Sen kardeşinin oğlundan mirasını istiyorsun o da babasından karısının mirasını istiyordu. Bunun üzerine Ebû Bekir, Rasûlüllah (sallallahü aleyhi ve sellem)’in şu buyruğunu hatırlattı: “Biz Peygamberler miras bırakmayız bizim bıraktıklarımız sadakadır.” Allah biliyor ki: Ebû Bekir doğru dürüst hakkı bulan ve hakka uyan biri idi. (Müslim, Cihâd: 16; Buhârî, Feraiz: 2) Bu hadis bu şeklinden daha uzuncadır. Bu hadis Mâlik b. enes rivâyeti olarak hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "Hâris b. Mâlik b. Barsa (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Mekke fethi günü Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işittim: “Bu beldeye bu günden sonra kıyamete kadar savaş açılmayacaktır.” (Müslim, Cihâd: 33; Ebû Dâvûd, Harac: 24) Bu konuda İbn Abbâs, Süleyman b. Surad ve Mutî’den de hadis rivâyet edilmiştir. hadis hasen sahitir. Bu hadis Zekeriyya b. ebî Zaide’nin, Şa’bî’den rivâyetidir. Onu sadece bu hadisle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "Numân b. Mukarrin (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikte savaşa çıkmıştım; Gün ağarmaya başladığı andan güneş doğuncaya kadar savaşı durdururdu, güneş doğunca savaşı tekrar başlatırdı. Yine gündüz yarı olduğu zamandan başlıyarak güneş batıya kayınca kadar yine durdurur güneş batıya kayınca ikindi vaktine kadar savaşırdı sonra ikindi namazını kılar yine savaşırdı. Numân diyor ki: Bu anlarda zafer rüzgarları esiyor denilir ve müminler orduları için namazlarında dua ederlerdi. (Ebû Dâvûd, Cihâd: 101) Bu hadis Numân b. Mukarrin’den buradakinden daha mevsul bir senedle rivâyet edilmiştir. Katâde Numân b. Mukarrin’e ulaşmamıştır. Numân b. Mukarrin, Ömer’in halifeliği zamanında vefat etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "Ma’kıl b. Yesâr (radıyallahü anh)’den rivâyet edilmiştir. Ömer b. Hattâb Numân b. Mukarrinî, Hürmüzan’a, gönderdi. -Hadis biraz uzuncadır- Numân b. Mukarrin diyor ki: Rasûlüllah (sallallahü aleyhi ve sellem) ile savaşta bulundum gündüzün başında savaşmadığı vakit güneş batıya kayma noktasına gelinceye kadar beklerdi ki bu arada rüzgarlar eser ve Allah’tan yardım inerdi. (Ebû Dâvûd, Cihâd: 101) Bu hadis hasen sahihtir. Alkame b. Abdullah, Bekir b. Abdullah el Müzenî’nin kardeşidir. Numân b. Mukarrin, Ömer’in hilafeti döneminde vefat etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Uğursuzluk inancı insanı şirke götürür biz Müslümanlarda bu tür saplantılar olmamalıdır. Allah bu tür bozuk saplantıları kendisine güzelce tevekkül edilirse giderir. (Ebû Dâvûd, Tıp: 24; İbn Mâce, Tıp: 43) Bu konuda Ebû Hüreyre, Hâbis et Temim, Âişe, İbn Ömer ve Sa’d tan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Bu hadisi sadece Seleme b. Küheyl’in rivâyetiyle bilmekteyiz. Aynı şekilde Seleme’den bu hadisi rivâyet etmiştir. Muhammed b. İsmail’den işittim şöyle diyordu: Süleyman b. harb bu hadis hakkında şöyle derdi: Hadiste geçen “Vema minna…” bana göre Abdullah b. Mes’ûd’un kendi sözüdür",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "Enes (radıyallahü anh)’den rivâyet edilmiştir. Rasûlüllah (sallallahü aleyhi ve sellem) buyurdu ki: Bulaşıcılık serpicilik: hastalığın kendisinden değil Allah’ın izni iledir. Cahiliye dönemindeki eşya ve olaylarda uğursuzluk olduğu inancı da yoktur. Fe’li severim. Fe’l nedir? Ey Allah’ın Rasûlü dediler; “Fe’l, iyi gönül alıcı güzel sözdür” buyurdular. (Ebû Dâvûd, Tıp: 24; İbn Mâce, Tıp: 43) Bu hadis hasen garib sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), bir ihtiyaç için yola çıkarken ve işe başlarken “Ey başarılı olan, Ey doğru yolu bulan” sözlerini söylemek veya bir başkasından bu sözleri duymak hoşuna giderdi. (Ebû Dâvûd, Tıp: 24; İbn Mâce, Tıp: 43) Bu hadis hasen garib sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), ancak sabah namazı vaktinde baskın yapardı. Ezanı işitirse baskından vazgeçer değilse hücum ederdi. Bir seferinde kulak verdi ve bir adamın Allahû ekber Allahû ekber dediğini işitti ve şöyle buyurdu: “Fıtrat dini üzere…” sonra adam; eşhedû enla ilahe illallah deyince: “Cehennem’den çıktın…” buyurdu. (Ebû Dâvûd, Cihâd: 82-91-122)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 82
			}
		}
	]
}