{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"25": "The Book on Food"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), tahtadan yapılmış sini veya masa gibi ayaklı sofralar üzerinde ufak ve ayrı tabaklarda yemek yemediler. Kepeği unundan iyice ayrılmış has ekmek -veya yufka ekmeği- de yemediler.” Bunun üzerine Katâde’ye ne üzerinde yemek yerlerdi diye sordum, Katâde: “Şu yuvarlak deriden sofralar üzerinde” dedi. (Buhârî, Et’ıme: 7) Bu hadis hasen garibtir. b. Beşşâr diyor ki: Bu hadisin senedinde geçen Yunus; Yunus el İskaf’tır. Abdulvaris, İbn Saîd bu hadisi Saîd b. Ebî Arûbe’den, Katâde ve Enes’den benzeri şekilde rivâyet etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "Hişâm b. Zeyd b. Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Enes (radıyallahü anh)’den şöyle dediğini işittim: “Merruzzahran denilen yerde bir tavşanı ürküttük Peygamber (sallallahü aleyhi ve sellem)’in ashabı onun arkasından koştular ben de ona yetişip yakaladım ve tavşanı Ebû Talha’ya getirdim. İnceltilmiş taştan yapılan bir bıçakla onu kesti bir budunu veya kalçasını benimle Rasûlüllah (sallallahü aleyhi ve sellem)’e gönderdi. Rasûlüllah (sallallahü aleyhi ve sellem)’de ondan yedi. Bunun üzerine ben yedi mi? dedim. Enes’te kabul etti ve yedi dedi.” (Buhârî, Hibe: 4; Ebû Dâvûd, Et’ıme: 26; Müslim, Sayd: 9) Bu konuda Câbir, Ammâr, Muhammed b. Safvân’dan (ki Muhammed b. Sayfî de denilir) hadis rivâyet edilmiştir. hadis hasen sahihtir. adamlarının çoğunluğunun uygulaması bu hadise göre olup tavşan etinin yenmesinde bir sakınca görmezler. ilim adamları ise hayız gören bir hayvan olduğu için tavşan etinin yenmesini hoş görmezler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem)’e keler eti yemenin hükmü sorulduğunda; “Keleri ne yerim nede haram kılarım.” Buyurdular. (Müslim, Sayd: 7; Ebû Dâvûd, Et’ıme: 27) Bu konuda Ömer, Ebû Saîd, İbn Abbâs, Sabit b. Vedia, Câbir, Abdurrahman b. Hasene’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. İlim adamları kelerin yenmesi hakkında değişik görüşler ortaya koydular. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bir kısmı yenmesine izin verirken bir kısmı yenmesini hoş görmezler. İbn Abbâs’ın şöyle dediği rivâyet edildi: “Rasûlüllah (sallallahü aleyhi ve sellem)’in sofrasında keler yendi, Rasûlüllah (sallallahü aleyhi ve sellem), hoşlanmadığı için yemedi.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "İbn ebî Ammâr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Câbir’e, sırtlan; av hayvanı mıdır? diye sordum. Evet dedi. Onun etinden yiyebilir miyim? Dedim. Evet dedi. Rasûlüllah (sallallahü aleyhi ve sellem) mi böyle buyurdu dedim. Evet dedi. (Ebû Dâvûd, Et’ıme: 31; Nesâî, Sayd: 27; İbn Mâce: Sayd: 15) Bu hadis hasen sahihtir. Bazı ilim adamları bu hadise göre sırtlan eti yemekte bir sakınca görmezler. Ahmed ve İshâk bunlardandır. Peygamber (sallallahü aleyhi ve sellem)’den sırtlan etinin mekruh olduğuna dair bir hadis rivâyet edilmişse de senedi sağlam değildir. ilim adamları sırtlan etinin yenmesini hoş görmezler. Mübarek bunlardandır. b. Kattan diyor ki: Cerir b. Hâzim bu hadisi Abdullah b. Ubeyd b. Umeyr’den, İbn ebî Ammâr’dan, Câbir’den ve Ömer’den, Ömer’in sözü olarak rivâyet ediyor. İbn Cüreyc’in hadisi daha sahihtir. İbn ebî Ammâr: Abdurrahman b. Abdullah b. Ebû Ammâr olup Mekkelidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "Huzeyme b. Cez’ (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem)’e sırtlan eti yemenin hükmünü sorduğumda: “Sırtlan eti yiyen var mı?” buyurdular. Sonra kurt eti yemenin hükmünü sordum: “Hayırlı kimseler kurt eti yer mi?” buyurdular. (İbn Mâce: Sayd: 14) Bu hadisin senedi sağlam değildir. Bu hadisi sadece İsmail b. Müslim’in, Abdulkerim’den ve Ebû Ümeyye’den rivâyeti olarak bilmekteyiz. Bazı hadisçiler İsmail ve Abdulkerim hakkında söz etmişlerdir. Ebû Ümeyye = Abdulkerim b. Kays b. Ebî’l Muhârik’tır. Abdulkerim b. Mâlik el Cüzerî ise güvenilir bir kimsedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) bize at etlerinden yedirdi ve bizi eşek eti yemekten yasakladı.” (İbn Mâce, Zebaih: 12; Nesâî, Sayd: 29) Bu konuda Esma binti Ebû Bekir’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Pek çok kişi bu hadisi Amr b. Dinar vasıtasıyla Câbir’den rivâyet etmişlerdir. Bu hadisi, Hammâd b. Zeyd, Amr b. Dinâr’dan, Muhammed b. Ali’den ve Câbir’den rivâyet etmiştir. İbn Uyeyne’nin rivâyeti daha sahihtir. Muhammed’den işittim şöyle demişti: Sûfyân b. Uyeyne Hammad b. Zeyd’den hafıza yönünden daha sağlamdır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Hayber günü yırtıcı hayvanlardan her sivri dişliyi, hedef yapılarak öldürülen hayvan etinden yemeyi ve ehlî (evcil) eşek etlerinin yenmesini haram kıldı.” (İbn Mâce, Sayd: 13) Bu konuda Ali, Câbir, Berâ, İbn ebî Evfâ, Enes, Irbâd b. Sâriye, Ebû Sa’lebe, İbn Ömer ve Ebû Saîd’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. b. Muhammed ve daha başkaları bu hadisi Muhammed b. Amr’dan rivâyet ederek; sadece tekbir konu olan: “Yırtıcı hayvanlardan her sivri dişliyi” yasakladı şeklinde aktarmışlardır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "Ebû Sa’lebe el Huşenî (radıyallahü anh)’den rivâyet edilmiştir. Ebû Sa’lebe: Ey Allah’ın Rasûlü! Dedi. Biz, Ehli Kitab denilen insanların topraklarında bulunuyor onların tencerelerinde yemek pişirip kaplarından su içiyoruz! Rasûlüllah (sallallahü aleyhi ve sellem), o kaplarından başkasını bulamaz iseniz onları güzelce yıkayın su ile temizleyin buyurdu. Ey Allah’ın Rasûlü! Dedi. “Av bölgelerinde bulunuyoruz nasıl yapalım?” Buyurdular ki: Eğitilmiş köpeğini gönderdiğin ve Allah’ın ismini de andığın yani besmele çektiğin vakit o hayvan ölse dahi onu ye. Eğer eğitilmemiş bir köpek yakalamış gelmiş ise İslam’a göre kesildiyse ye. Allah’ın adını anarak yani besmele çekerek okunu fırlatırsan ve silahın hayvanı öldürse bile ye. (Ebû Dâvûd, Etıme: 45) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "Meymûne (radıyallahü anh)’den rivâyet edilmiştir: “Bir fare yağ kabı içerisine ölü olarak bulundu. Bunun hükmü Rasûlüllah (sallallahü aleyhi ve sellem)’e sorulunca: “Fareyi ve farenin bulaştığı çevresindeki yağı alın geri kalanını yeyin” buyurdular. (Ebû Dâvûd, Etıme: 47; İbn Mâce, Etıme: 8) Bu konuda Ebû Hüreyre’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Bu hadis Zuhrî’den, Ubeydullah’tan İbn Abbâs’tan rivâyet edilmiş olup “Meymûne” zikredilmemiştir. İbn Abbâs’ın, Meymûne’den rivâyeti daha sahihtir. Ma’mer, Zührî’den, Saîd b. Müseyyeb’den, Ebû Hüreyre’den bir benzerini rivâyet etmişlerdir ki bu rivâyet pek makbul değildir. Muhammed b. İsmail’den işittim şöyle diyordu: Ma’mer’in, Zührî’den, Saîd b. Müseyyeb’den, Ebû Hüreyre’den rivâyet ederek şunları aktarmıştı: Rasûlüllah (sallallahü aleyhi ve sellem)’den soruldu da buyurdular ki: Katı yağ ise fareyi ve çevresindeki yağı atın eğer yağ sıvı ise ona yaklaşmayın.” Bu rivâyet hatalıdır Ma’mer bu hadiste hata etmiştir. Muhammed şöyle devam ediyor: Sahih olan; Zührî’nin, Ubeydullah’tan, İbn Abbâs’tan ve Meymûne’den rivâyet edilendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "Abdullah b. Ömer (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: “Sol elinizle yiyip içmeyin çünkü şeytan sol eliyle yer ve içer.” (Ebû Dâvûd, Etıme: 19; İbn Mâce: Etıme: 8) Bu konuda Câbir, Ömer b. Ebî Seleme, Seleme b. el Ekvâ’, enes b. Mâlik ve Hafsa’dan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Mâlik ve İbn Uyeyne bu hadisi Zührî’den, Ebû Bekir b. Ubeydullah’tan ve İbn Ömer’den rivâyet ettiler. Ma’mer ve Ukayl ise; Zührî, Sâlim, İbn Ömer’den rivâyet etmişlerdir. Mâlik ve İbn Uyeyne’nin rivâyeti daha sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "Sâlim (radıyallahü anh)’in babasından rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Biriniz yiyeceğinde sağ eliyle yesin içeceğinde de sağ eliyle içsin. Çünkü şeytan sol eliyle yer içer.” (Ebû Dâvûd, Etıme: 19; İbn Mâce: Etıme: 8)",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Sizden biri yemek yediğinde parmaklarını yalasın çünkü bereketin yiyeceklerin hangi parçasında olduğunu bilemezsiniz.” (Müslim, Eşribe: 18) Bu konuda Câbir, Ka’b b. Mâlik ve Enes’den de hadis rivâyet edilmiştir. Bu hadis hasen garibtir. Bu şekliyle sadece Süheyl’in rivâyetiyle bilmekteyiz. bu hadis hakkında sordum. Dedi ki: Abdulaziz’in muhtelif hadislerinden olup sadece bu hadisiyle bilinir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Biriniz bir şey yerken bir parçası yere düşerse, onu alıp üzerindeki bulaşanı giderip yesin şeytana bırakmasın.” (İbn Mâce: Etıme: 13) Bu konuda Enes’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) yemeğini yedikten sonra yemek yediği üç parmağını yalardı ve şöyle buyururdu. Birinizin yiyeceğinden bir parçası yere düşerse düşen parçadan toz toprak ne varsa onu giderip o parçayı yesin o parçayı şeytana bırakmasın. Rasûlüllah (sallallahü aleyhi ve sellem), yemek kaplarını tertemiz etmemizi bize emreder ve şöyle buyururdu: “Yemeğinizin hangi parçasında bereketin olduğunu bilemezsiniz.” (İbn Mâce, Etıme: 13) Bu hadis hasen garib sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "Ebû’l Yemân el Mualla b. Râşid (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Sinan b. Seleme’nin çocuk doğuran cariyesi ninem Ümmü Âsım’dan rivâyet ederek şöyle dedi: Nübeyşetül Hayr bize geldi biz bir tabakta yemek yiyorduk, bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu bize aktardı: “Her kim bir kapta yemek yer ve o kabı da tertemiz hale getirirse o tabak kendisi için istiğfar eder yani o kimsenin günahlarının bağışlanmasını ister.” (Ebû Dâvûd, Etıme: 17) Bu hadis garib olup bu hadisi sadece Mualla b. Râşid’in rivâyetiyle bilmekteyiz. Yezîd b. Harun ve hadis imamlarından pek çok kimse bu hadisi Mualla b. Râşid’den rivâyet etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Bereket yemeğin ortasına iner dolayısıyla siz yemeği ortasından değil kenarlarından yeyin.” (Ebû Dâvûd, Etıme: 17) Bu hadis hasen sahihtir. Bu hadis sadece A’ta b. Sâib’in rivâyetiyle bilinmektedir. Şu’be ve Sevrî’de bu hadisi A’ta b. Sâib’den rivâyet etmişlerdir. konuda İbn Ömer’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: “Her kim şundan ilk önce sarımsak dedi sonra sarımsak soğan ve pırasa dedi, mescidlerimize yaklaşmasın.” (Ebû Dâvûd, Etıme: 40) Bu hadis hasen sahihtir. Bu konuda Ömer, Ebû Eyyûb, Ebû Hüreyre, Ebû Saîd, Câbir b. Semure, Kurre b. İyas el Müzenî ve İbn Ömer’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "Câbir b. Semure (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), Medîne’ye hicret ettiğinde Ebû Eyyûb’un evine misafir oldu. Yemek yediği vakit artanını Ebû Eyyûb’e gönderdi. Rasûlüllah (sallallahü aleyhi ve sellem), bir gün yemeği hiç yemeden ona geri göndermişti. Ebû Eyyûb Rasûlüllah (sallallahü aleyhi ve sellem)’e gelip durumu öğrenmek isteyince; O yemekte sarımsak vardı! buyurdular. Ebû Eyyûb: Sarımsak haram mıdır? Ey Allah’ın Rasûlü! Dedi. Rasûlüllah (sallallahü aleyhi ve sellem) buyurdular ki: “Hayır fakat ben kötü kokusundan dolayı hoşlanmam.” (Ebû Dâvûd, Etıme: 40) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "Ubeydullah b. ebî Yezîd (radıyallahü anh)’in babasından rivâyete göre, Ümmü Eyyûb ona şöyle anlattı: “Rasûlüllah (sallallahü aleyhi ve sellem), Medîne’ye hicret edip geldiğinde onlara misafir olmuştu. Rasûlüllah (sallallahü aleyhi ve sellem), için içersinde bu (soğan, sarımsak) sebzelerinin bulunduğu ağır bir yemek yaptılar. Rasûlüllah (sallallahü aleyhi ve sellem), o yemekten hoşlanmadı ve ashabına: Siz o yemekten yeyin. Ben sizden biri gibi değilim ben yanımdaki melek arkadaşımı o koku ile rahatsız edip incitmekten korkarım.” (Müslim, Eşribe: 31; İbn Mâce: Etıme: 59) Bu hadis hasen sahih garibtir. Ümmü Eyyûb, Ebû Eyyûb el Ensarî’nin hanımıdır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "Ebû’l Âliye (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Sarımsak helal olan rızıklardandır.” (Müslim, Eşribe: 31; İbn Mâce: Etıme: 59) Ebû Halde’nin adı Hâlid b. Dinar’dır. Hadisçiler yanında güvenilen bir kişidir. Enes b. Mâlik’e ulaşmış ve ondan hadis işitmiştir. Ebû’l Âliye’nin adı: Rüfey’dir. Riyâhî’de denilir. Abdurrahmam b. Mehdî diyor ki: Ebû Halde seçkin Müslümanlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) buyurdular ki: “Kapılarınızı örtün, tulumlarınızı bağlayın, kaplarınızın ağzını kapayın, örtülmesi gerekenleri örtün, kandilleri söndürün, çünkü; şeytan kapalıyı açamaz, kırbanın bağını çözemez, kapların örtülerini açamaz. Çünkü fare; kandillerin içindeki yağı ve fitili yemek ister böylece ev halkının başına evlerini yakabilir.” (Müslim, Eşribe: 12; İbn Mâce, Eşribe: 16) Bu konuda İbn Ömer, Ebû Hüreyre ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Câbir’den değişik yollardan da rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "Sâlim’in babasından rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Uyuyacağınız zaman evlerinizde ateşleri söndürünüz, gerekli tedbirleri alınız.” (Müslim, Eşribe: 12; İbn Mâce, Eşribe: 16) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Sahibinden izin almaksızın hurmayı ikişer ikişer yemeyi yasakladı.” (Müslim, Eşribe: 25; Ebû Dâvûd, Etıme: 43) Bu konuda Ebû Bekir’in azâdlı kölesi Sa’d’tan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “(Temel gıda maddelerimizden olan) Hurma bir evde bulunmazsa o evin halkı aç sayılır.” (Ebû Dâvûd, Etıme: 41; İbn Mâce: Etıme: 38) Bu konuda Ebû Rafî’nin hanımı Selma’dan da hadis rivâyet edilmiştir. Bu hadis hasen garibtir. Bu hadisi sadece Hişâm b. Urve’nin rivâyeti olarak bu şekliyle bilmekteyiz. Bu hadis hakkında Buhârî’ye sordum şöyle dedi: Yahya b. Hassân’dan başka bu hadisi rivâyet eden bir kimse tanımıyoruz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Allah, bir şey yeyip içtikten sonra kendisine hamdeden kimseden razı olur.” (Müslim, Zikir Dua: 24; İbn Mâce: Etıme: 16) Bu konuda Ukbe b. Âmir, Ebû Saîd, Âişe, Ebû Eyyûb ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. Bu hadis hasen olup pek çok kimse Zekeriyya b. Ebû Zaide’den benzeri şekilde rivâyet etmişlerdir. Bu hadis sadece Zekeriyya b. ebî Zaide’nin rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "Câbir b. Abdullah (radıyallahü anh)’den rivâyet edildiğine göre; Rasûlüllah (sallallahü aleyhi ve sellem), cüzzam hastalıklı birinin elini tutarak yemek kabına kendi eliyle birlikte getirdi ve şöyle dedi: “Allah’ın ismiyle Allah’a güvenerek ve ona dayanarak ye.” (Müslim, Selem: 36; İbn Mâce: Tıp: 44) Bu hadis garibtir. Bu hadisi sadece Yunus b. Muhammed’in, Mufaddal b. Fedâle’den rivâyetiyle bilmekteyiz. Mufaddal b. Fedâle: Basralı bir ihtiyardır. Yine Basralı olan başka bir Mufaddel b. Fedâle daha vardır ki: berikinden daha güvenilir ve daha meşhurdur. Şu’be bu hadisi Habib b. Şehîd’den, İbn Büreyde’den; “Ömer bir cüzamlının elinden tutarak…” diye rivâyet etti. Şu’be’nin rivâyeti daha sahih ve sağlamdır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “kafir yedi bağırsak dolduracak kadar yer mümin ise tek bağırsak dolduracak kadar yemek yer.” (İbn Mâce: Etıme: 3; Müslim, Eşribe: 34) Bu hadis hasen sahihtir. Bu konuda Ebû Hüreyre, Ebû Saîd, Ebû Basra el Gıfârî, Ebû Mûsâ, Cehcah el Gıfârî, Meymûne ve Abdullah b. Amr’dan da hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem)’e kafir olan bir kimse misafir olarak geldi Rasûlüllah (sallallahü aleyhi ve sellem) onun için bir koyundan süt sağılıp ikram edilmesini emretti. Koyundan süt sağıldı misafir içti sonra başka bir koyun sağılmasını emretti koyundan süt sağıldı misafir onu da içti sonra tekrar başka bir koyun sağıldı onu da içti böylece yedi koyun sütünü içmiş oldu. Ertesi sabah Müslüman oldu. Rasûlüllah (sallallahü aleyhi ve sellem) yine bir koyundan süt sağılmasını emretti, süt sağıldı misafir içti başka bir koyundan süt sağılmasını emretti süt sağıldı fakat misafir bu sütü içip bitiremedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Mümin bir bağırsak dolduracak kadar içer kafir ise yedi bağırsak dolduracak kadar yer ve içer.” (İbn Mâce: Etıme: 3; Müslim, Eşribe: 34) Bu hadis Süheyl’in rivâyeti olarak hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "Câbir b. Abdullah ve Enes b. Mâlik (radıyallahü anhüma)’dan rivâyete göre, şöyle demişlerdir: Rasûlüllah (sallallahü aleyhi ve sellem) çekirgelerin aleyhine dua ettiği zaman şöyle derdi: Allah’ım büyüklerini öldür küçüklerini helak et, yumurtalarını boz, kökünü kes, geçimliğimiz olan ürün ve rızıklardan onların ağzını uzak tut şüphesiz sen duayı işitensin. adam Ey Allah’ın Rasûlü! Allah’ın ordularından bir ordu olan çekirgeler ordusunun kökünün kesilmesine nasıl dua edersin? Deyince Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Çekirge balıkların denizde yaydığı bir yaratıktır.” (İbn Mâce, Sayd: 9; ebu Dâvûd: Etıme: 34) Bu hadis garib olup sadece bu şekliyle bilmekteyiz. Hadisin râvîlerinden Mûsâ b. Muhammed b. İbrahim et Teymî hakkında hadisçiler söz etmişlerdir. Çok garib ve münker = hoş karşılanmayan rivâyetleri olan bir kimsedir. Muhammed b. İbrahim güvenilir bir kimse olup Medînelidir",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem): “Her türlü pisliklerden yiyen, “cellale” isimli hayvanın etinden yemeyi sütünden içmeyi yasakladı.” (Ebû Dâvûd, Eşribe: 14) Bu konuda Abdullah b. Abbâs’tan da hadis rivâyet edilmiştir. Bu hadis hasen garibtir. Aynı hadisi Sevrî, İbn ebî Necîh’den, Mûcâhid’den mürsel olarak rivâyet etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "Zehdem el Cermî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Ebû Mûsâ’nın yanına girdim tavuk yiyordu. Bana yaklaş ta sende ye dedi, çünkü ben Rasûlüllah (sallallahü aleyhi ve sellem)’i tavuk yerken gördüm.” (Nesâî, Sayd: 33; Dârimî, Etıme: 22) Bu hadis hasendir. Bu hadis Zehdem’den değişik şekilde rivâyet edilmektedir. Bu hadisi sadece Zehdem’in rivâyeti olarak bilmekteyiz. Ebû’l Avvam, Imrân el Kattan’dır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "Ebû Mûsâ (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem)’in tavuk eti yediğini gördüm.” Bu hadis buradakinden daha uzuncadır. (Dârimî, Etıme: 22) hadis hasen sahihtir. Eyyûb es Sahtiyanî bu hadisi aynı şekilde Kâsım et Temimî’den, Ebû Kılâbe’den ve Zehdem’den rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "Sefîne (radıyallahü anh)’ın babasından ve dedesinden rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikte toy kuşu etinden yedim” (Ebû Dâvûd, Etıme: 28) Bu hadis garib olup sadece bu şekliyle bilmekteyiz. İbrahim b. Ömer b. Sefîne’den, İbn ebî Fûdeyk hadis rivâyet etmiştir. Bu kimseye Büreyd b. Ömer b. Sefîne de denir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "Ümmü Seleme (radıyallahü anha)’dan rivâyet edilmiştir. “Ümmü Seleme Rasûlüllah (sallallahü aleyhi ve sellem)’e kızartılıp kebab haline getirilmiş bir et parçası ikram etmişti de Rasûlüllah (sallallahü aleyhi ve sellem) ondan yedikten sonra abdest almaksızın namaza kalktı.” (İbn Mâce, Etıme: 29) Bu konuda Abdullah b. Harîs, Muğîre ve Ebû Rafî’den de hadis rivâyet edilmiştir. Bu hadis bu şekliyle hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "Ebû Cuhayfe (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Ben bir yere dayanarak rahat bir şekilde yemek yemem.” Yani yemek için fazla zaman ayırıp vaktimi orada geçirmem. (Ebû Dâvûd, Etıme: 16; Dârimî, Etıme: 31) Bu konuda Ali, Abdullah b. Amr, Abdullah b. Abbâs’tan da hadis rivâyet edilmiştir. Bu hadis hasen sahih olup sadece Ali b. Akmer rivâyetiyle bilmekteyiz. Şu’be de Sûfyân es Sevrî vasıtasıyla bu hadisi Ali b. Akmer’den rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), helva ve balı severdi.” (İbn Mâce, Etıme: 36; Dârimî: Etıme: 34) hadis hasen sahih garibtir. Ali b. Müshir bu hadisi Hişâm b. Urve’den rivâyet etmiştir. Bu hadis hakkında daha fazla söz edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "Abdullah el Müzenî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Et satın aldığınızda suyunu bol miktarda koyunuz yemekte et yiyemeyen kimse suyundan yesin çünkü iki etin birisi et suyudur. (Yani haşlanmış etin besin değeri iki parça olup birisi ette diğeri de etin suyundadır.)” (Tirmizî rivâyet etmiştir.) konuda Ebû Zerr’den de hadis rivâyet edilmiştir. Bu hadis garib olup sadece bu şekliyle Muhammed b. feza’nın rivâyetiyle bilmekteyiz. b. Feza’nın adı Muabbir’dir. Süleyman b. Harb bu kimse hakkında söz etmiştir. Alkame b. Abdullah ise Bekir b. Abdullah el Müzenî’nin kardeşidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "Ebû Zerr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Biriniz yapılan hiçbir iyiliği küçük görmesin. İyilik yapmak için hiçbir şey bulamazsa kardeşini güler yüzle karşılasın et satın alıp pişirmek istersen suyunu bol döküp iyilik olması için komşuna bir miktar ondan ver.” (İbn Mâce, Etıme: 58; Dârimî, Etıme: 37) Bu hadis hasen sahihtir. Şu’be bu hadisi Ebû Imrân el Cevnî’den rivâyet etmektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "Ebû Mûsâ (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Erkeklerden pek çok kimse olgunluğa erişti kadınlardan ise Imrân kızı Meryem ve Firavun’un karısı Asiye kemale erişenlerden oldu. Âişe’nin diğer kadınlara üstünlüğü tirit yemeğinin diğer yemeklere üstünlüğü gibidir.” (Buhârî, Enbiya: 34; Nesâî, Muaşeret: 3) Bu konuda Âişe ve Enes’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "Safvân b. Ümeyye (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Eti dişlerinizle ısıra ısıra yiyiniz çünkü bu şekil yemek daha lezzetli ve daha hoştur.” (İbn Mâce, Etıme: 27; Ebû Dâvûd, Etıme: 20) Bu konuda Âişe ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. Bu hadisi sadece Abdulkerim’in rivâyeti olarak bilmekteyiz. Bazı ilim adamları; Abdulkerim el Muallim hakkında söz etmişlerdir. Eyyûb es Sahtiyanî hafızası yönünden bu kimseyi eleştirmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "Amr b. Ümeyyete et Damrî (radıyallahü anh)’den rivâyete göre, bizzat kendisi: “Rasûlüllah (sallallahü aleyhi ve sellem)’in kızartılmış koyun budundan keserek yediğini ve abdest almadan namaza gittiğini görmüştür.” (Ebû Dâvûd, Etıme: 20) Bu hadis hasen sahihtir. Bu konuda Muğıre b. Şu’be’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem)’e pişmiş et getirildi ve ön budu kendisine takdim edildi, kendisi ön budu severdi ve onu dişleriyle ısıra ısıra yedi.” (Ebû Dâvûd, Etıme: 20) Bu konuda İbn Mes’ûd, Âişe, Abdullah b. Cafer ve Ebû Ubeyde’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Ebû Hayyan’ın ismi Yahya b. Saîd b. Hayyan’dır. Ebû Zür’a b. Amr b. Cerîr’in ismi ise Herim’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem)’e etler içerisinde ön but daha sevimliydi. Fakat et ve etli yemeklerini çok az bulurlardı. Etlerin içersinde ön kol daha kolay piştiği için severlerdi.” (İbn Mâce, Etıme: 28; Ebû Dâvûd, Etıme: 20) Bu hadis garibtir. ancak bu şekliyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": 1839,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": 1840,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "Ebû Tâlib’in kızı Ümmü Hanî (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), yanıma geldi ve yanınızda bir şey var mı? buyurdular. Ben de: Hayır hiçbir şey yok sadece bir kaç parça kurumuş ekmek ve sirke vardır dedim. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem); sirkesi bulunan bir ev katıktan yoksun sayılmaz buyurdular.” (İbn Mâce, Etıme: 33; Ebû Dâvûd, Etıme: 39) Bu hadis bu şekliyle hasen garibtir. Ümmü Hanî’nin hadisini ancak bu şekliyle bilmekteyiz. Hamza es Sûmâlî’nin ismi Sabit b. Ebû Safiyye’dir. Ümmü Hanî’, Ali b. ebî Tâlib’den bir sûre sonra vefat etmiştir. bu hadis hakkında sordum. Dedi ki: Şa’bi’nin Ümmü Hanî’den hadis işittiğini bilmiyorum. Ebû Hamza senin yanında nasıl bir kimsedir, dediğimde Ahmed b. Hanbel onun hakkında ileri geri konuşmuşlar benim yanımda ise orta yollu bir kimsedir dedi",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre: “Peygamber (sallallahü aleyhi ve sellem) yaş hurma ile karpuzu birlikte yerdi.” (Ebû Dâvûd, Et’ıme: 44) Bu konuda Enes’den de hadis rivâyet edilmiştir. Bu hadis hasen garibtir. Bazıları bu hadisi Hişâm b. Urve’den, babasından mürsel olarak rivâyet etmişler ve “Âişe’den” dememişlerdir. hadisi aynı zamanda Yezîd b. Rûman, Urve ve Âişe’den rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "Abdullah b. Cafer (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem) yaş hurma ile salatalığı birlikte yerdi.” (İbn Mâce, Etıme: 37; Ebû Dâvûd, Etıme: 44) Bu hadis hasen sahih garibtir. Bu hadisi sadece İbrahim b. Sa’d’ın rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": 1845,
			"text": "Enes (radıyallahü anh)’den rivâyet edilmiştir; “Ureyne Kabilesinden bazı kimseler Medîne’ye geldiler ve Medîne’nin havası onlara ağır geldi. Peygamber (sallallahü aleyhi ve sellem) onları Zekât develerinin bulunduğu Medîne dışındaki bir yere gönderdi ve tedavi için develerin sütlerinden ve idrarlarından içmelerini emretti.” (Müslim, Kasame: 2; Nesâî, Tahrimüddem: 7) Bu hadis bu şekliyle hasen sahih garibtir. Bu hadis başka şekillerde de Enes’den rivâyet edilmiştir. Ebû Kılâbe, bu hadisi Enes’den, Saîd b. ebî Ârube de Katâde yoluyla Enes’den rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": 1846,
			"text": "Selman (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Tevratta okuduğuma göre yemeğin bereketinin yemekten sonra elleri yıkamak olduğunu okudum. Sonra bu konuyu Rasûlüllah (sallallahü aleyhi ve sellem)’e hatırlatarak Tevratta okuduğumu haber verdim. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): “Yemeğin bereketi yemekten önce ve sonra elleri yıkamaktır” buyurdular. (Ebû Dâvûd, Etıme: 11) Bu konuda Enes ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. Bu hadisi sadece Kays b. Rabî’ın rivâyetiyle bilmekteyiz. Kays b. Rabi’in hadiste zayıf olduğu kaydedilmiştir. Ebû Haşim er Rummânî’nin ismi: Yahya b. Dinar’dır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": 1847,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) tuvaletten çıktıktan sonra kendisine yemek hazırlanmıştı ve halk sana abdest suyu getirelim mi? dediler. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ben namaz kılacağım da abdest almakla emrolundum.” (Ebû Dâvûd, Etıme: 11) Bu hadis hasen sahihtir. Amr b. Dinar bu hadisi Saîd b. Huveyris vasıtasıyla İbn Abbâs’tan rivâyet etmiştir. Ali b. el Medînî, Yahya b. Saîd’in şöyle dediğini nakletti ”Sûfyân es Sevrî, yemekten önce el yıkamayı ve tabağın altına pide ve yufka koymayı hoş görmezdi.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": 1848,
			"text": "Ikraş b. Zübeyd (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Mürre b. Ubeyd oğulları malların Zekâtlarını benimle Rasûlüllah (sallallahü aleyhi ve sellem)’e gönderdiler. Medîne’ye Rasûlüllah (sallallahü aleyhi ve sellem)’in yanına geldim onu Muhâcir ve Ensâr arasında oturur buldum. Ikraş şöyle devam etti: Sonra Rasûlüllah (sallallahü aleyhi ve sellem), elimden tutarak Ümmü Seleme’nin evine götürdü ve yemek var mı? buyurdu. Arkasından parça eti bol büyük bir kap ve tirit getirildi. Ondan yemeye yöneldik, derken ben elimi kabın her tarafında dolaştırmaya başladım. Rasûlüllah (sallallahü aleyhi ve sellem)’de kendi önünden yemekteydi. Rasûlüllah (sallallahü aleyhi ve sellem) sol eliyle benim sağ elimi tuttu ve şöyle dedi: “Ey Ikraş! Bu tek çeşitten oluşan bir yemektir, bir yerden ye.” içinde çeşitli hurma bulunan veya -Şek, Ubeydullah’tan gelmiştir- Olmuş ve yaş hurma bulunan bir tabak getirildi. Ben kendi önümden yemeye başladım. Rasûlüllah (sallallahü aleyhi ve sellem)’in eli ise tabak etrafında dolaşmaya başladı ve Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ey Ikraş! İstediğin yerden ye bu bir çeşit değildir. Sonra bize su getirildi Rasûlüllah (sallallahü aleyhi ve sellem), ellerini yıkadı avuçlarının ıslaklığı ile yüzünü kollarını ve başını sıvazladı ve dedi ki: Ey Ikraş! Ateşin değdiği şeylerden dolayı alınacak abdest budur.” (İbn Mâce, Etıme, 7; Ebû Dâvûd, Etıme: 15) Bu hadis garibtir. Bu hadisi sadece Alâ b. Fadl’ın rivâyetiyle bilmekteyiz. Alâ bu hadisi tek başına rivâyet etmektedir. Ikraş’ın Peygamber (sallallahü aleyhi ve sellem)’den sadece bu hadisini biliyoruz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": 1849,
			"text": "Ebû Talût (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Enes b. Mâlik’in yanına girdim kabak yiyor ve şöyle diyordu: “Ne güzel bitkisin sen Rasûlüllah (sallallahü aleyhi ve sellem)’in seni sevmesinden dolayı bana ne kadar sevimlisin.” (Ebû Dâvûd, Etıme: 21; İbn Mâce, Etıme: 26) Bu konuda Hakîm b. Câbir ve babasından da hadis rivâyet edilmiştir. Bu hadis bu şekliyle garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": 1850,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem)’in yemek kabı içerisinde kabağı araştırdığını gördüm bu yüzden kabağı severim.” (İbn Mâce, Etıme: 26; Ebû Dâvûd, Etıme: 21) Bu hadis hasen sahihtir. Bu hadis değişik şekillerde de yine Enes’den rivâyet edilmiştir. (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem)’in önünde kabağı görmüş ve bu nedir? Demişti; “Bu kabaktır” dedi. Bizde ondan sonra yemeklerimizde kabağı çoğaltmıştık",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": 1851,
			"text": "Ömer b. Hattâb (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Zeytin yağını yiyin ve sürünün çünkü o bereketli bir ağacın ürünüdür.” (İbn Mâce, Et’ıme: 34; Dârimî, Etıme: 346) Bu hadisi sadece Abdurrezzak’ın, Ma’mer’den rivâyetiyle bilmekteyiz. Abdurrezzak bu hadisin senedinde karışıklığa düşmüştür. Kimi rivâyette “Ömer’den” derken bazen de şüphe ederek: “Ömer’in Peygamber (sallallahü aleyhi ve sellem)’den aktardığını zannediyorum” demekte. Bazen de: “Zeyd b. Eslem’den ve babsından” diyerek mürsel olarak rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": 1852,
			"text": "Ebû Esîd (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: “Zeytin yağını yeyiniz ve sürününüz çünkü o bereketli bir ağaçtandır.” (İbn Mâce, Et’ıme: 34; Dârimî, Etıme: 346) Bu hadis bu şekliyle garibtir. Bu hadisi sadece Sûfyân es Sevrî’nin Abdullah b. Îsa’dan rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": 1853,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu bize haber vermiştir: “Sizin birinizin hizmetçisi pişirdiği, hazırladığı yemeğin ateşine ve dumanına katlanıyorsa o hizmetçiyi elinden tutarak kendisiyle beraber aynı sofraya oturtsun, eğer bunu yapamaz ise o yemekten ona da yedirsin.” Mâce, Et’ıme: 50; İbn Mâce, Etıme: 19) Bu hadis hasen sahihtir. Hâlid, İsmail’in oğludur. İsmi: Sa’d’tır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": 1854,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Selamı yaygınlaştırın, yemek yediriniz ve savaşlarda kafirlerin başlarını uçurunuz ki Cennetlere varis olasınız.” (İbn Mâce, Etıme: 23; Dârimî, Etıme: 39) Bu konuda Abdullah b. Amr, İbn Ömer, Enes, Abdullah b. Selam, Abdurrahman b. Âişe, Şüreyh b. Hanî ve babasından da hadis rivâyet edilmiştir. İbn Ziyâd’ın, Ebû Hüreyre’den rivâyet ettiği bu hadis hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": 1855,
			"text": "Abdullah b. Amr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Rahman olan Allah’a kulluk yapın, yemek yedirin, selamı yaygınlaştırın ki Cennete selametle giresiniz.” (İbn Mâce, Etıme: 23; Dârimî, Etıme: 39 Bu hadis hasen sahihtir)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": 1856,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Bir miktar hurma bile olsa akşam yemeğini yeyiniz, çünkü akşam yemeğini kaldırmak ihtiyarlık ve güçsüzlüğe sebep olur.” (Tirmizî rivâyet etmiştir.) Bu hadis hoş karşılanmayan münker hadislerdendir. Ancak bu şekliyle bilmekteyiz. Anbese hadis konusunda zayıf olduğu söylenmiştir. Abdulmelik b. Allak bilinmeyen meçhul bir kimsedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": 1857,
			"text": "Ömer b. ebî Seleme (radıyallahü anh)’den rivâyete göre, Ebû Seleme’nin oğlu Ömer, Rasûlüllah (sallallahü aleyhi ve sellem)’in yanına girmişti o anda Rasûlüllah (sallallahü aleyhi ve sellem)’de yemek yiyordu. Rasûlüllah (sallallahü aleyhi ve sellem), çocuğa: “Yaklaş bismillah de sağ elinle ve önünden ye” buyurdular. (Dârimî, Etıme: 9; Ebû Dâvûd, Etıme: 19) Bu hadis ayrıca Hişâm b. Urve’den, Ebû Vecze es Sa’dî’den, Müzeyneli bir kişiden ve Ömer b. ebî Seleme’den de rivâyet edilmiştir. Hişâm b. Urve’nin arkadaşları bu hadisin rivâyetinde ihtilaf etmişlerdir. Vecze es Sa’dî’nin adı Yezîd b. Ubeyd’tir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": 1858,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": 1859,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Şeytan (veya değişik mikrop, böcek ve bakteriler) hassas ve yalayıp yok edicidirler kendinizi ondan koruyun. Her kim elinde yemek bulaşığı ve kokusu varken yatıp uyursa ve geceleyin kendisine bir şey olursa kendisinden başka kimseyi suçlamasın.” (Ebû Dâvûd, Et’ıme: 53; İbn Mâce, Et’ıme: 22) Bu hadis bu şekliyle garibtir. bu hadis Süheyl b. ebî Salih’in babasından Ebû Hüreyre’den de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": 1860,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Her kim elinde yemek bulaşığı ve kokusu varken yatıp uyursa bu yüzden başına bir iş gelirse kendisiden başka kimseyi suçlamasın.” (Ebû Dâvûd, Et’ıme: 53; İbn Mâce, Et’ıme: 22) Bu hadis hasen garibtir. Bu şekliyle A’meş’in rivâyeti olarak biliyoruz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 78
			}
		}
	]
}