{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"26": "The Book on Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1861,
			"arabicnumber": 1861,
			"text": "İbn Ömer (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Her sarhoşluk veren içkidir, Her içki de haramdır. Her kim şarabı devamlı içerek ölür giderse ahirette sarhoşluk vermeyen şaraptan içemez.” Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu konuda Ebû Hüreyre, Ebû Saîd, Abdullah b. Amr, İbn Abbâs, Ubâde ve Ebû Mâlik el Eş’arî’den de hadis rivâyet edilmiştir. Tirmizî: İbn Ömer hadisi hasen sahihtir. Bu hadis değişik şekillerde Nafi’ ve İbn Ömer’den de rivâyet edilmiştir. Mâlik b. Enes, Nafi’ ve İbn Ömer’den mevkuf olarak rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1862,
			"arabicnumber": 1862,
			"text": "Abdullah b. Ömer (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “İçki içen kimsenin kırk gün namazı kabul olmaz. Tevbe ederse Allah tevbesini kabul eder. Yine içki içmeye dönerse Allah kırk gün onun namazını kabul etmez. Tevbe ederse Allah yine tevbesini kabul eder. Yine içki içmeye dönerse Allah kırk gün onun namazını kabul etmez. Tevbe ederse yine tevbesini kabul eder. Dördüncü sefer içki içmeye devam ederse yine kırk gün o kimsenin namazını kabul etmez tevbe etse bile tevbesini de kabul etmez ve ona Cehennem’de içki olarak Habal nehrinden içki içirir. Bunun üzerine Ey Ebû Abdurrahman derdi. Habal nehri nedir? Dedi ki: Cehennemliklerin irinlerinden meydana gelen bir ırmaktır.” Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu hadis hasendir. Aynı şekilde Abdullah b. Amr ve İbn Abbâs’tan da rivâyet edilmiştir. NESAİ’DEKİ İBN-İ AMR RİVAYETİ İÇİN BURAYA TIKLAYIN MÜSLİM DEKİ RİVAYETİ OKUMAK FAYDALI OLABİLİR BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1863,
			"arabicnumber": 1863,
			"text": "Âişe (r.anha)’dan rivâyete göre, Rasûlullah (s.a.v.)’e baldan yapılan içkinin durumu soruldu da “Sarhoşluk veren her şey neden yapılırsa yapılsın haramdır.” Diğer tahric: Dârimî, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1864,
			"arabicnumber": 1864,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işittim: “Her sarhoşluk veren şey haramdır.” (Ebû Dâvûd, Eşribe: 5; İbn Mâce, Eşribe: 1) Bu konuda Ömer, Ali İbn Mes’ûd, Enes, Ebû Saîd, Ebû Mûsâ, Eşec el Asrî, Deylem, Meymûne, İbn Abbâs, Kays b. Sa’d, Numân b. Beşîr, Muaviye, Vâil b. Hucr, Kurre el Müzenî, Abdullah b. Muğaffel, Ümmü Seleme, Büreyde, Ebû Hüreyre ve Âişe’den de hadis rivâyet edilmiştir. Bu hadis hasendir. Ebû Seleme ve Ebû Hüreyre’den benzeri şekilde rivâyet edilmiştir. İkisi de sahihtir. Ayrıca pek çok kişi bu hadisin bir benzerini Muhammed b. Amr’dan, Ebû Seleme’den ve Ebû Hüreyre’den rivâyet etmişlerdir. İbn Ömer ve Ebû Seleme’den de aynı hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1865,
			"arabicnumber": 1865,
			"text": "Câbir b. Abdullah (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) buyurdular ki: “Çoğu sarhoşluk verenin azı da haramdır.” Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe) Tirmizî: Bu konuda Sa’d, Âişe, Abdullah b. Ömer, İbn Ömer ve Havvât b. Cübeyr’den de hadis rivâyet edilmiştir. Tirmizî: Câbir’in rivâyet ettiği bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1866,
			"arabicnumber": 1866,
			"text": "Âişe (r.anha)’dan rivâyet ettiğine göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Her sarhoşluk veren şey haramdır. Bir farak’ı sarhoşluk eden şeyin bir avucu da haramdır.” Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Râvîlerden biri başka bir rivâyetle “Bir içimi bir yudumu” da haramdır demektedir. Tirmizî: Bu hadis hasendir. Leys b. ebû Süleym ve Rabî’ b. Subeyh bu hadisi Ebû Osman el Ensarî’den, Mehdî b. Meymun’un rivâyetine benzer şekilde rivâyet etmişlerdir. Ebû Osman el Ensarî’nin ismi Amr b. Sâlim olup aynı zamanda Ömer b. Sâlim de denmektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1867,
			"arabicnumber": 1867,
			"text": "Tâvus (r.a.)’den rivâyet edilmiştir. İbn Ömer’e bir adam gelerek “Rasûlullah (s.a.v.), toprak kaplarda ekşitilen şıra (bira)’yı yasakladı mı? diye sordu İbn Ömer’de “Evet” cevabını verdi. Tavus diyor ki: Vallahi bunu İbn Ömer’den bizzat işittim. Diğer tahric: İbn Mâce, Eşribe; Ebû Dâvûd, Eşribe Tirmizî: Bu konuda İbn ebî Evfâ, Ebû Saîd, Süveyd, Âişe, İbn-ü Zübeyr ve ibn Abbâs’tan da hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1868,
			"arabicnumber": 1868,
			"text": "Amr b. Mürre (r.a.)’den rivâyete göre, şöyle demiştir: Zâzân’dan işittim şöyle diyordu: İbn Ömer’e Rasûlullah (s.a.v.)’in içinde şıra yapılmasını yasakladığı kaplardan sordum. Bunu bize kendi terimleriyle anlat ve bizim anlayabileceğimiz şekilde izah et dedim. İbn Ömer’de dedi ki: Rasûlullah (s.a.v.), “Hanteme’yi” yasakladı, hanteme topraktan yapılan kaptır. “Dübba’yı” yasakladı, Dübba; Su kabağıdır. “Nakîr’i” yasakladı, Nakîr; hurma kütüğünün oyularak kap haline getirilmesidir. “Müzeffet’i” yasakladı, Müzeffet; içerisi ziftle kaplanmış kaplardır. Şıranın diğer (tulum) gibi kaplarda yapılmasını emretti. Diğer tahric: İbn Mâce, Eşribe; Ebû Dâvûd, Eşribe Tirmizî: Bu konuda Ömer, Ali, İbn Abbâs, Ebû Saîd, Ebû Hüreyre, Abdurrahman b. Ya’mur, Semure, Enes, Âişe, Imrân b. Husayn, Âiz b. Amr, Hakem el Gıfârî ve Meymûne’den de hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1869,
			"arabicnumber": 1869,
			"text": "Süleyman b. Büreyde’nin babasından rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Sizi, bazı kaplarda şıra yapmaktan yasaklamıştım. Hiçbir kap hiçbir şeyi ne helal nede haram kılar. Her sarhoşluk veren haramdır.” Diğer tahric: İbn Mâce, Eşribe; Ebû davud, Eşribe Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1870,
			"arabicnumber": 1870,
			"text": "Câbir b. Abdullah (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.), değişik kaplarda şıra yapmayı yasaklamıştı. Ensâr bizim bunlardan başka kabımız yoktur diye şikayette bulundular. Bunun üzerine: “O halde sakıncası yok” buyurdular. Diğer tahric: Ebû Dâvûd, Etıme Tirmizî: Bu konuda İbn Mes’ûd, Ebû Saîd, Ebû Hüreyre ve Abdullah b. Amr’dan da hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1871,
			"arabicnumber": 1871,
			"text": "Âişe (r.anha)’dan rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.)’in tulumlar içersine şıra kurardık tahliye deliği bulunan tulumun ağzı bağlanırdı. Sabahleyin kurduğumuz şırayı akşam içerdi, akşam şırayı kurardık sabah içerdi.” Diğer tahric: İbn Mâce, Eşribe; Ebû Dâvûd, Eşribe Tirmizî: Bu konuda Câbir, Ebû Saîd ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Tirmizî: Bu hadis garibtir. Bu şekilde Yunus b. Ubeyd rivâyetiyle bu hadisi tanımaktayız. Bu hadis aynı şekilde değişik yollarla Âişe’den rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1872,
			"arabicnumber": 1872,
			"text": "Numân b. Beşîr (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Buğdaydan içki yapılır. Arpadan içki yapılır. Hurmadan içki yapılır.” Diğer tahric: Ebû davud, Eşribe; Dârimî, Eşribe Tirmizî: Bu konuda Ebû Hüreyre’den de hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1873,
			"arabicnumber": 1873,
			"text": "Ömer (r.a.)’den rivâyete göre, şöyle demiştir: “Buğdaydan içki yapılır…” (1872) aynı hadisi söyledi",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1874,
			"arabicnumber": 1874,
			"text": "Ömer b. Hattâb (r.a.)’den rivâyete göre: “Buğdaydan içki yapılır…” (1872) aynı hadisi aktarmıştır. Bu hadis İbrahim b. Muhâcirin rivâyetinden daha sağlamdır. Ali b. Medînî diyor ki: Yahya b. Saîd: İbrahim b. Muhâcir hadis konusunda pek sağlam değildir. Bu hadis değişik şekillerde Şa’bî ve Numân b. Beşîr’den de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1875,
			"arabicnumber": 1875,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Çoğunlukla şu iki ağaçtan yapılır; Hurma ve üzüm.” Diğer tahric: İbn Mâce, Eşribe Tirmizî: Bu hadis hasen sahihtir. Ebû Kesîr es Suheymî; Uberî’dir, ismi: Yezîd b. Abdurrahman b. Gufeyle’dir. Bu hadisi Şu’be İkrime b. Ammâr’dan rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1876,
			"arabicnumber": 1876,
			"text": "Câbir b. Abdullah (r.a.)’den rivâyete göre: “Rasûlullah (s.a.v.), hurma koruğu ile hurmanın birlikte şıra yapılmasını yasakladı.” Diğer tahric: Ebû Dâvûd, Eşribe Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1877,
			"arabicnumber": 1877,
			"text": "Ebû Saîd (r.a.)’den rivâyete göre: “Rasûlullah (s.a.v.), hurma ile hurma koruğunun birbirine karıştırılarak şıra yapılmasını yasakladı. Kuru üzüm ile hurmanın birbirleriyle karıştırılarak şıra yapılmasını yasakladı toprak kaplarda şıra yapılmasını da yasakladı.” Diğer tahric: Ebû Dâvûd, Eşribe Tirmizî: Bu konuda Câbir, Enes, Ebû Katâde, İbn Abbâs, Ümmü Seleme ve Ma’bed b. Ka’b’ın anasından da hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1878,
			"arabicnumber": 1878,
			"text": "Hakem (r.a.)’den rivâyete göre, şöyle demiştir: İbn ebî Leylâ’nın şöylece aktardığını kendisinden işittim: “Huzeyfe su istedi birisi ona gümüş kapla su getirince kabı ona fırlattı ve dedi ki: Bundan yasakladığım halde bu işten vazgeçmediği için attım. Oysa Rasûlullah (s.a.v.): “Altın ve gümüş kaplarda yeyip içmeyi, ipek ve atlas kumaşlardan giymeyi yasaklamıştır. Bunları kullanmak dünyada kafirler içindir, Ahirette sadece sizler içindir” buyurdu. Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu konuda Ümmü Seleme, Berâ ve Âişe’den de hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1879,
			"arabicnumber": 1879,
			"text": "Enes b. Mâlik (r.a.)’den rivâyete göre: “Nebi (s.a.v.), kişinin ayakta su içmesini yasakladı. Yemek yemek nasıldır? Denilince; O daha kötüdür” buyurdular. Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1880,
			"arabicnumber": 1880,
			"text": "İbn Ömer (r.a.)’den rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.) zamanında; yolda yürürken yerdik, ayakta da içerdik.” Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu hadis Ubeydullah b. Ömer’in, Nafi’ ve İbn Ömer’den rivâyeti olarak sahih garibtir. Imrân b. Cerir bu hadisi Ebû’l Yûzerî’den ve İbn Ömer’den rivâyet etmiştir. Ebû’l Yûzerî’nin ismi: Yezîd b. Atarid’tir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1881,
			"arabicnumber": 1881,
			"text": "Carûd b. Muallimî (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem): “Ayakta içmeyi yasaklamıştır.” (Ebû Dâvûd, Eşribe: 13; İbn Mâce, Eşribe: 21) Bu konuda Ebû Saîd, Ebû Hüreyre ve Enes’den de hadis rivâyet edilmiştir. Bu hadis garib hasendir. Pek çok kimse bu hadisi Saîd’den, Katâde’den, Ebû Müslim’den, Carut’dan rivâyet etmişlerdir. Katade’den, Yezîd b. Abdullah b. Şıhhîr’den, Ebû Müslim’den ve Carûd’tan Peygamber (sallallahü aleyhi ve sellem)’in şöyle söylediği de rivâyet edilmiştir: “Müslümanın yitiği ateş korudur.” İbn’ül Muallah el Abdî olup Peygamber (sallallahü aleyhi ve sellem)’in yakınlarındandır. Carûd b. Alâ da denilir. Doğru olanı İbn’ül Mualla’dır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1882,
			"arabicnumber": 1882,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre: “Nebi (s.a.v.), zemzemi ayakta içmiştir.” Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu konuda Ali, Sa’d, Abdullah b. Amr ve Âişe’den de hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1883,
			"arabicnumber": 1883,
			"text": "Amr b. Şuayb’ın babasından ve dedesinden rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.)’i ayakta ve oturduğu halde içerken gördüm.” Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1884,
			"arabicnumber": 1884,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1885,
			"arabicnumber": 1885,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Develer gibi bir solukta içmeyin iki veya üç nefeste için içeceğinizde Bismillah deyin içmeyi bitirdiğinizde ise Elhamdülillah deyin.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis garibtir. Yezîd b. Sinan el Cezerî; Ebû Ferve er Ruvahî’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1886,
			"arabicnumber": 1886,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre: “Peygamber (sallallahü aleyhi ve sellem), (kaptan su) içerken iki nefes alırdı.” (Ebû Dâvûd, Eşribe: 20) Bu hadis garibtir. Bu hadisi sadece Rişdîn b. Küreyb rivâyetiyle bilmekteyiz. Abdullah b. Abdurrahman’a (Ebû Muhammed), Rişdîn b. Küreyb’i sordum. O’mu yoksa Muhammed b. Küreyb mi daha sağlamdır dedi ki: İkisi de birbirinden farksızdır, ama ben Rişdîn b. Küreyb’i tercih ederim. Muhammed b. İsmail’e sordum, dedi ki: Muhammed b. Küreyb, Rişdîn b. Küreyb’den daha fazla tercih edilir. Benim görüşümde, Ebû Muhammed, Abdullah’ın dediği gibidir. Rişdîn b. Küreyb daha yaşlı ve tercih edilir. İbn Abbâs’a ulaşmış ve onu görmüştür. Bunlar iki kardeştirler. İkisi de münker, hoş karşılanmayan hadisler rivâyet ederler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1887,
			"arabicnumber": 1887,
			"text": "Ebû Saîd el Hudrî (radıyallahü anh)’den rivâyete göre: “Peygamber (sallallahü aleyhi ve sellem) içecek kabın içerisine üflemeyi yasakladı. Bunun üzerine bir adam; kabın içerisine çerçop görüyorum dedi. Rasûlüllah (sallallahü aleyhi ve sellem) onları dök buyurdu. O adam bir nefeste kanmıyorum deyince: “O halde su kabından ağzını uzaklaştır ve nefes al” buyurdular. (Ebû Dâvûd, Eşribe: 20; İbn Mâce, Eşribe: 24) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1888,
			"arabicnumber": 1888,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre: “Nebi Sallallahu Aleyhi ve Sellem, içecek kabın içerisine üflemeyi ve kabın içine nefes almayı yasakladı.” Diğer tahric: Ebû Dâvûd, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1889,
			"arabicnumber": 1889,
			"text": "Katâde (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Sizden biriniz bir şey içerken kabın içerisine nefes almasın.” (Ebû Dâvûd, Eşribe: 20; İbn Mâce, Eşribe: 24) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1890,
			"arabicnumber": 1890,
			"text": "Ebû Saîd (r.a.)’den rivâyete göre, şöyle aktarmıştır: “Su tulumlarının ağzını dışarı kıvırıp oradan bir kaba boşaltmaksızın içmekten yasaklandık.” (Yani içi görülmeyen kaplara ağzı dayamak suretiyle içmek yasaklanmıştır Diğer tahric: Dârimî, Eşribe; Ebû Dâvûd, Eşribe Tirmizî: Bu konuda Câbir, İbn Abbâs ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1891,
			"arabicnumber": 1891,
			"text": "Abdullah b. Enîs (r.a.)’in babasından rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.)’in asılı bir tuluma kalkıp ağzını oraya dayamak suretiyle su içtiğini gördüm.” Diğer tahric: İbn Mâce, Eşribe; Dârimî, Eşribe Tirmizî: Bu konuda Ümmü Süleym’den de hadis rivâyet edilmiştir. Tirmizî: Bu hadisin senedi sağlam değildir. Abdullah b. Ömer el Umerî’nin hadis konusunda zayıf olduğu kaydedilmiştir. İsa’dan hadis işitip işitmediğini de bilmiyorum",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1892,
			"arabicnumber": 1892,
			"text": "Kebşe (r.a.)’den rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.) bana gelmişti, derken asılı duran bir tulumun ağzından su içmişti; Ben de kalkıp onun içtiği tulumun ağzını hatıra olsun diye kesmiştim.” Diğer tahric: İbn Mâce, Eşribe; Dârimî, Eşribe Tirmizî: Bu hadis hasen sahih garibtir. Yezîd b. Câbir, Abdurrahman b. Yezîd b. Câbir’in kardeşidir ve Abdurrahman’dan önce vefat etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1893,
			"arabicnumber": 1893,
			"text": "Enes b. Mâlik (r.a.)’den rivâyet edilmiştir: “Rasûlullah (s.a.v.)’e içerisine su karıştırılmış bir süt getirildi o anda Rasûlullah (s.a.v.)’in sağ tarafında bir bedevî solunda ise Ebû Bekir bulunuyordu. Rasûlullah (s.a.v.) içti ve sağındaki bedeviye verdi ve sağdan sıra ile içilsin buyurdu.” Diğer tahric: Dârimî, Eşribe; İbn Mâce, Eşribe Tirmizî: Bu konuda İbn Abbâs, Sehl b. Sa’d, İbn Ömer ve Abdullah b. Büsr’den de hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1894,
			"arabicnumber": 1894,
			"text": "Ebû Katâde (r.a.)’den rivâyete göre, Nebi (s.a.v.) şöyle buyurdu: “Bir topluluğa su dağıtan kimse en son içer.” Diğer tahric: İbn Mâce, Eşribe; Dârimî, Eşribe Tirmizî: Bu konuda İbn ebî Evfâ’dan da hadis rivâyet edilmiştir. Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1895,
			"arabicnumber": 1895,
			"text": "Âişe (r.anha)’dan rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.)’in en çok sevdiği içecek tatlı ve soğuk içeceklerdi.” Diğer tahric: Müsned: 22971 Tirmizî: Pek çok kişi bu hadisi İbn Uyeyne’den burada olduğu gibi Ma’mer’den, Zührî’den, Urve’den, Âişe’den rivâyet etmişlerdir. Sahih olan Zührî’den mürsel olarak rivâyet edilendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1896,
			"arabicnumber": 1896,
			"text": "Zührî (r.a.)’den rivâyet edildiğine göre: Rasûlullah (s.a.v.)’e hangi içecek daha lezzetlidir? Diye soruldu. Dedi ki: “Tatlı ve soğuk olanı.” Diğer tahric: Müsned: 22971 Tirmizî: Abdurrezzak böylece Ma’mer’den, Zührî’den mürsel olarak rivâyet etmiştir. Bu İbn Uyeyne’nin hadisinden daha sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 37
			}
		}
	]
}