{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"29": "Chapters On Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2090,
			"arabicnumber": 2090,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kur’ân’ı ve feraiz ilmini öğrenin ve insanlara da öğretin ben de mutlaka bir gün öleceğim.” (İbn Mâce, Feraiz: 1; Dârimî, Feraiz: 1) Bu hadisin senedinde karışıklık vardır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2091,
			"arabicnumber": 2091,
			"text": "Ebû Usame bu hadisi Avf’tan, bir adamdan, Süleyman b. Câbir’den ve İbn Mes’ûd’tan rivâyet etmiştir. Aynı şekilde Hüseyin b. Hureys; Ebû Usame’den ve Avf’tan mana olarak bu hadisin bir benzerini aktarmıştır. Muhammed b. Kâsım el Esediyyi: Ahmed b. Hanbel ve başka hadisçiler zayıf saymışlardır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2092,
			"arabicnumber": 2092,
			"text": "Câbir b. Abdullah (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Sa’d b. Rabî’in karısı Sa’d’tan olan iki kızıyla beraber Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek; Ey Allah’ın Rasûlü! Dedi. Bunlar Sa’d. b. Rabî’in kızlarıdır. Babaları Uhud da şehîd olmuştu. Bu kızların amcası malın tamamını aldı bunlara hiçbir mal bırakmadı. Malları olmadığı için bu çocuklar evlenemezler dedi. Rasûlüllah (sallallahü aleyhi ve sellem), bu konuda Allah hükmünü verecektir buyurdu ve sonunda miras ayeti nazil oldu. Rasûlüllah (sallallahü aleyhi ve sellem), kızların amcasına haber göndererek şöyle buyurdu: “İkisini Sa’d’ın iki kızına ver sekizde biri annelerinindir, geri kalan ise senindir.” (Buhârî, Feraiz: 4; İbn Mâce: Feraiz: 2) Bu hadis sahih olup sadece Abdullah b. Muhammed b. Ukayl’in rivâyetiyle bilmekteyiz. Bu hadisi aynı zamanda Şerik’te; Abdullah b. Muhammed b. Ukayl’dan rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "Huzeyl b. Şurahbil (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir adam Ebû Mûsâ ve Süleyman b. Rabia’ya geldi ve Kızın, oğlun kızın ve ana baba bir kızkardeşin mirastaki hisselerini sorduğunda ikisi birden şöyle dediler: “Yarısı kızındır, geri kalanı ana baba bir olan kız kardeşindir.” Yinede sen, Abdullah’a git ona da sor onun söylediği de bizimkiyle uyuşacaktır dediler. Adam, Abdullah’a gelerek durumu anlattı ve o iki şahsın söylediklerini de ona anlattığında Abdullah dedi ki: “Onların söylediklerine uyacak olursam yanlış yapmış olurum ve doğru yoldan ayrılmış olurum dedi. Fakat bu konuda Rasûlüllah (sallallahü aleyhi ve sellem)’in verdiği hüküm gibi hüküm vereceğim: “Yarısı kızındır, oğlun kızına ise altıda bir düşer böylece üçte ikinin tamamlanması olarak oğlun kızınındır, geri kalan ise kızkardeşindir.” (Buhârî, Feraiz: 7; Ebû Dâvûd, Feraiz: 4) Bu hadis hasen sahihtir. Ebû Kays el Evedî’nin ismi Abdurrahman b. Servan’dır ve Küfelidir. Şu’be bu hadisi Ebû Kays’den rivâyet ediyor",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2094,
			"arabicnumber": 2094,
			"text": "Ali (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: “Sizler Nisa süresi 12. ayeti olan: “Yapacağınız vasiyet ve borcunuz ödendikten sonra…” ayetini okuyorsunuz Rasûlüllah (sallallahü aleyhi ve sellem), vasiyetten önce borcun ödenmesine hüküm vermiştir. Ana baba bir kardeşler mirastan pay alırlar. Kişi anne baba bir olan kardeşinden miras alır. Babadan bir olan kardeşlerinden değil.” (İbn Mâce Vesâyâ: 46; Dârimî, Feraiz: 17)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2095,
			"arabicnumber": 2095,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2096,
			"arabicnumber": 2096,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2097,
			"arabicnumber": 2097,
			"text": "Câbir b. Abdullah (radıyallahü anh)’den rivâyete göre, şöyle diyor: “Hastalandım Rasûlüllah (sallallahü aleyhi ve sellem), beni ziyarete geldiğinde beni baygın durumda buldu. Sonra beraberinde Ebû Bekir ve Ömer olduğu halde bana yaya olarak geldiler. Rasûlüllah (sallallahü aleyhi ve sellem) abdest aldı abdest suyundan bana bir miktar döktü, hemen ayırdım. Sonra Ey Allah’ın Rasûlü! Dedim. Malım konusunda ne karar vereyim veya malımı ne yapmalıyım? Bana hiçbir cevap vermedi. O anda Câbir’in dokuz kızkardeşi vardı. Nihayet Nisa sûresi 176. ayeti indi: “Onlar senden cevap isterler. De ki: Allah size babasız ve çocuksuz kişinin mirası hakkındaki hükmünü şöyle açıklıyor: Ölen kişinin çocuğu yok bir kız kardeşi varsa, bıraktığı malın yarısı o kız kardeşinindir. Ama ölen kız kardeşinin çocuğu yoksa kendisi, yani erkek kardeşi ona mirasçı olur. Eğer kız kardeşi iki ise, geride bıraktıklarının üçte ikisi onlarındır. Ama mirasçılar erkek veya kız kardeşler olarak çok iseler, bu durumda erkek için kadının iki payı vardır. Allah şaşırıp sapmayasınız diye size her konuda hükmünü açıklıyor. Allah herşeyi bilendir.” diyor ki: Bu âyet benim hakkımda nazil oldu. (Buhârî, Feraiz: 11; Dârimî, Feraiz: 5) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2098,
			"arabicnumber": 2098,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Mirastan payı olanların hisselerini sahiplerine ulaştırın, artanını en yakın erkek kişinindir.” (Dârimî, Feraiz: 28; İbn Mâce: Feraiz: 10)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2099,
			"arabicnumber": 2099,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2100,
			"arabicnumber": 2100,
			"text": "Kabîsa b. Zûeyb (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Bir nine; annenin annesi veya babanın annesi Ebû Bekir’e gelerek; Oğlumun oğlu ve kızımın oğlu öldü, Kur’ân’da ölen torunumdan miras hakkım olduğu bana bildirildi dedi. Ebû Bekir (radıyallahü anh) şöyle konuştu: Kur’ân’da senin hakkın olan bir pay göremiyorum. Rasûlüllah (sallallahü aleyhi ve sellem)’in de sana bir pay verdiğini işitmedim. Bazı kimselerden bu konuyu soruşturacağım ve sana cevap vereceğim dedi. Sorduğu kimselerden Muğîre b. Şu’be: Rasûlüllah (sallallahü aleyhi ve sellem)’in nineye altıda bir verdiğine şâhidlik edince, senden başka bunu kim işitti diye sordu. Muğîre: Muhammed b. Mesleme dedi. Bunun üzerine Ebû Bekir, Nineye altıda bir hisse verilmesine karar verdi, daha sonraları başka bir nine Ömer’e bu konuda fetva sormak üzere gelmişti.” (Ebû Dâvûd, Feraiz: 5; Dârimî Feraiz: 19) diyor ki: Ma’mer bu hadiste Zührî’den bana ilave olarak rivâyet etti. Ben bu ilaveyi Zührî’nin kendisinden ezberlemedim. Fakat Ma’mer’den ezberlemiş bulunuyorum o ilave şudur: Ömer şöyle demiştir: “O altıda bir hisse iki nine birlikte bulunursanız ikinizin; tek kişi olursa o kişiye aittir.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2101,
			"arabicnumber": 2101,
			"text": "Kabîsa b. Zûeyb (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir nine Ebû Bekir’e gelerek ondan mirasını sordu. Ebû Bekir: Allah’ın kitabında sana bir hisse yok Peygamber (sallallahü aleyhi ve sellem)’in sünnetinde de sana bir hisse yok. Sen şimdilik git ben meseleyi bir soruşturayım dedi. Ebû Bekr, bazı kimselere soruştururken Muğîre b. Şu’be Rasûlüllah (sallallahü aleyhi ve sellem)’in yanında bulundum nineye altıda bir hisse verdi dedi. üzerine Ebû Bekir; bu konuyu senden başka bilen var mı? dedi. Muhammed b. Mesleme ayağa kalkarak mesele Muğîre b. Şu’be’nin dediği gibidir. Dedi. Ebû Bekir de o gelen kadın için altıda bir hükmünü uyguladı. başka bir nine Ömer b. Hattâb’a gelerek ondan mirasını sordu. Ömer’de ona şöyle dedi: “Allah’ın kitabında sana bir pay yok fakat senin alacağın o altıda birdir. Eğer iki nine bir arada olursanız o altıda birde ortaksınız tek başınıza olursanız altıdabir sizindir.” (Ebû Dâvûd, Feraiz: 5; Dârimî Feraiz: 19) Bu konuda Büreyde’den de hadis rivâyet edilmiştir. Bu hadis İbn Uyeyne’nin hadisinden daha sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2102,
			"arabicnumber": 2102,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh); oğlu ile beraber bulunan nine hakkında şöyle dedi: “Rasûlüllah (sallallahü aleyhi ve sellem)’in, oğlu ile bulunan ve oğlu sağ olduğu halde kendisine altıda bir verdiği ilk ninedir.” (Ebû Dâvûd, Feraiz: 5; Dârimî Feraiz: 19) Bu hadisi merfu olarak sadece bu şekliyle bilmekteyiz. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından bazıları oğlu ile beraber nineye miras tanımışlar bazıları ise miras tanımamıştır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "Ebû Ümâme b. Sehl b. Huneyf (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Ömer b. Hattâb, Ubeyde’ye şöyle yazıp göndermişti: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah ve onun Peygamberi, varisi olmayan kimsenin varisidir. Dayı da varisi olmayan kimsenin varisidir.” (İbn Mâce, Feraiz: 10) Bu konuda Âişe ve Mıkdam b. Madi’kerib’den de hadis rivâyet edilmiştir. hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2104,
			"arabicnumber": 2104,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2105,
			"arabicnumber": 2105,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2106,
			"arabicnumber": 2106,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2107,
			"arabicnumber": 2107,
			"text": "Usame b. Zeyd (radıyallahü anh)’den rivâyet edildiğine göre Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Müslüman, kafire; kafir de Müslüman’a mirasçı olamaz.” (Dârimî, Feraiz: 29; Buhârî, Feraiz: 25) Ömer, Sûfyân vasıtasıyla Zührî’den bu hadisin bir benzerini bize aktarmıştır. Bu konuda Câbir’den, Abdullah b. Amr’dan da hadis rivâyet edilmiştir. hadis hasen sahihtir. Ma’mer ve pek çok kişi Zührî’den bu hadisin benzerini rivâyet etmişlerdir. Mâlik; Zührî’den, Ali b. Husayn’dan, Ömer b. Osman’dan, Üsâme b. Zeyd’den bu hadisin benzerini rivâyet etmiştir. Mâlik’in hadisinde Mâlik vehme kapılmıştır. Mâlik’den rivâyet ederek “Amr b. Osman’dan” demişlerdir. Mâlik’in adamlarının çoğu ise “Mâlik’den ve Ömer b. Osman’dan” diyorlar. b. Osman b. Affân, Osman’ın çocuklarından meşhur olanıdır. Ömer b. Osman’ı tanımıyoruz. İlim adamlarının uygulaması bu hadise göredir. İlim adamları dinini değiştiren kişinin mirası hakkında ihtilaf ettiler. Peygamber (sallallahü aleyhi ve sellem), ashabından ve sonrakilerden pek çok ilim adamı: “Onun mirasını Müslüman varislerine verirken; Bir kısmı da: “Müslüman varisleri ondan miras alamazlar” demektedirler. Bunlar: Rasûlüllah (sallallahü aleyhi ve sellem)’in, “Müslüman, kafirden miras alamaz” hadisini delil olarak alırlar. Şâfii’de bu görüştedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2108,
			"arabicnumber": 2108,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) buyurdular ki: “Dinleri ayrı olan toplumlar birbirlerinden miras alamazlar.” (Dârimî Feraiz: 29; Ebû Dâvûd, Feraiz: 10) Bu hadisin Câbir’in hadisi olduğunu sadece İbn Leylâ rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2109,
			"arabicnumber": 2109,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Katil miras alamaz.” (Dârimî, Feraiz: 41; İbn Mâce, Feraiz: 8) Bu hadis sahih değildir. Sadece bu şekliyle bilinir. Hadisin râvîlerinden İshâk b. Abdullah b. ebî Ferve’yi aralarında Ahmed b. Hanbel’in de bulunduğu bazı hadisçiler terk etmişlerdir. İlim adamlarının uygulaması bu hadise göre olup, “Öldürme işi hataen de olsa bile bilede olsa katil miras alamaz. Bazı ilim adamları öldürme işi hataen olursa miras alabilir” derler ki imamı Mâlik bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2110,
			"arabicnumber": 2110,
			"text": "Saîd b. Müseyyeb (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Ömer; şöyle demişti: “Diyet baba tarafından akraba üzerinedir. Dolayısıyla kadın kocasının diyetinden miras olarak hiçbirşey alamaz.” Bunun üzerine Dahhâk b. Sûfyân el Kilâbî, Rasûlüllah (sallallahü aleyhi ve sellem)’in “Üşeym ed Dababî’nin karısına kocasının diyetinden miras ver” diye kendisine mektupla bildirdiğini Ömer’e bildirdi. (Dârimî, Feraiz: 36) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2111,
			"arabicnumber": 2111,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), Lıhyan oğullarından hamile bir kadından ölü olarak düşürülen cenîn için diyet bedeli olarak bir erkek köle veya cariye verilmesine hüküm vermişti. Sonra bu köle verme cezasına çarptırılan kadın da öldü bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), O kadının mirasının çocuklarına ve kocasına aid olduğu ödeyeceği diyet yükünün ise asabesi=baba tarafından erkek akrabalarına yüklenmesine hüküm vemişti. (İbn Mâce, Feraiz: 10; Ebû Dâvûd, Feraiz: 7) Yunus; bu hadisi Zührî’den, Saîd b. Müseyyeb’den, Ebû Seleme’den ve Ebû Hüreyre’den benzeri şekilde rivâyet etmiştir. Yine bu hadisi Mâlik; Zührî’den, Ebû Seleme’den, Ebû Hüreyre’den rivâyet ettiği gibi ayrıca Zührî’den Saîd b. Müseyyeb’den de mürsel olarak rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2112,
			"arabicnumber": 2112,
			"text": "Temim-i Dâri (radıyallahü anh)’den rivâyet edilmiştir dedi ki: “Müslümanlardan birinin vasıtasıyla Müslüman olan bir müşrik hakkında uygulanacak yol nasıldır diye sormuştum da Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: O kimsenin dirisine ve ölüsüne en yakın olan onun Müslüman olmasına sebep olan kimsedir.” (Ebû Dâvûd, Feraiz: 11; Dârimî, Feraiz: 42) Bu hadisi sadece Abdullah b. Vehb’in rivâyetiyle bilmekteyiz. İbn Mevhib ve Temimi Darî’den de rivâyet edildiği söylenmiştir. Bazıları bu hadisi rivâyet ederken Abdullah b. Vehb ile Temimî Dâri arasına Kabîsa b. Zûeyb’i koymuşlardır ki bu sahih değildir. Yahya b. Hamza, Abdulaziz b. Ömer’den rivâyet ederek Kabîsa b. Zûeyb’i râvîler arasına ilave etmiştir. ilim adamlarının uygulaması bu hadise göredir. Bana göre bu hadis muttasıl değildir. ilim adamları ise mirası devlet hazinesine intikal eder demektedirler ki Şâfii bu görüştedir. Rasûlüllah (sallallahü aleyhi ve sellem)’in “Vela hakkı=varis olabilme durumu azâd eden kişinindir” hadisini delil olarak getirmektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2113,
			"arabicnumber": 2113,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2114,
			"arabicnumber": 2114,
			"text": "Amr b. Şuayb (radıyallahü anh)’ın babasından ve dedesinden rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Mala varis olan vela’ya da varis olur.” (Dârimî, Feraiz: 45) Bu hadisin senedi pek sağlam değildir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2115,
			"arabicnumber": 2115,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 26
			}
		}
	]
}