{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"31": "Chapters On Wala' And Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2125,
			"arabicnumber": 2125,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, bizzat kendisi Berire’yi satın almak istemiş ve Berire’nin ailesi vela hakkının kendilerine ait olmasını istemişlerdi, bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Vela hakkı satış bedelini ödeyen kimsenin veya azâd ederek hürriyet nimetine kavuşturan kimsenindir.” (Müslim, Itk: 2; Nesâî, Kasame: 8) Bu konuda İbn Ömer, Ebû Hüreyre’den de hadis rivâyet edilmiştir. hadis hasen sahihtir. İlim adamlarının uygulamaları bu hadise göredir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": 2126,
			"text": "Abdullah b. Ömer (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Vela hakkının satılması ve bağışlanması yasaktır.” (Müslim, Itk: 2; Nesâî, Kasame: 8) Bu hadis hasen sahihtir. Bu hadisi sadece Abdullah b. Dinar’ın, İbn Ömer’den rivâyetiyle bilmekteyiz bu rivâyette de Rasûlüllah (sallallahü aleyhi ve sellem) vela hakkını satma ve hibe etmeyi yasakladı. Sûfyân es Sevrî ve Mâlik b. Enes bu hadisi Abdullah b. Dinar’dan rivâyet etmişlerdir. Şu’be’den şöyle dediği rivâyet ediliyor: “Abdullah b. Dinar bu hadisi rivâyet ederken kalkıp alnından öpmeye izin vermesini candan diledim.” Yahya b. Selîm aynı hadisi Ubeydullah b. Ömer’den Nafi’den, İbn Ömer’den rivâyet etmektedir. Oysa bu rivâyet Vehİm’den ibarettir. Yahya b. Süleym burada yanılmıştır. Sahih olan rivâyet Ubeydullah b. Ömer’den böylece rivâyet etmiştir. Abdullah b. Dinar bu hadiste tek kalmıştır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": 2127,
			"text": "İbrahim et Teymî (radıyallahü anh)’ın babasından rivâyete göre, şöyle demiştir: Ali (radıyallahü anh) bize birgün hutbe vererek şöyle dedi: Yanımızda Allah’ın kitabından ve içinde deve yaşlarından ve birtakım yaralamalara ait hükümleri içeren şu sahifeden başka biz ehli beyt’e mahsus okuduğumuz bir belge olduğunu iddia edenler muhakkak ki yalancıdırlar, diyerek hutbesini şöyle devam ettirdi: Medîne Ayr dağı ile Sevr dağı arasına kadar Harem sayılır; Kim burada bir bidat ortaya çıkarır veya bir bidata kucak açarsa Allah’ın, Meleklerin ve tüm insanların laneti onun üzerinedir. Kıyamet gününde Allah o kimsenin ne tevbesini ne de fidyesini veya o kimsenin farz ve nafile ibadetlerini kabul etmeyecektir. Kim babasından başkasına babası olduğunu iddia eder veya bir köle efendisinden başka birini kendi efendisi kabul ederse Allah’ın, meleklerin ve tüm insanların laneti bu kimseler üzerine olup Allah bu kimselerin de ne farz nede nafilelerini kabul etmeyecek veya bunlardan tevbe ve fidye de kabul edilmeyecektir. Müslümanların zimmeti yani taahhüt edip koruması altına aldığı konudaki garantisi birdir. En aşağı durumda olanları dahi aynı durumdadır.” (Müslim, Itk: 4) Bazıları A’meş’den, İbrahim et Teymî’den, Harîs b. Süveyd’den ve Ali’den bu hadisin bir benzerini bize aktarmışlardır. Bu hadis hasen sahihtir. Değişik şekillerde yine Ali’den rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": 2128,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Fezare kabilesinden bir adam Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek şöyle dedi: “Ey Allah’ın Rasûlü! Karım kendisi beyaz renkli olmasına rağmen siyah bir çocuk doğurdu nedendir bu?” Rasûlüllah (sallallahü aleyhi ve sellem), O adama “Develerin var mı?” dedi. Adam: “Evet” dedi. “Renkleri nasıldır” dedi. Adam “kızıl” dedi. Peygamber (sallallahü aleyhi ve sellem): “İçersinde boz develer var mı?” dedi. Adam “Evet içinde boz develer var” dedi. Peygamber (sallallahü aleyhi ve sellem): “Bu boz renk onlara nereden geldi?” Buyurdu. Adam: “Belki onlara çeken bir damar vardır” dedi. Peygamber (sallallahü aleyhi ve sellem): “İşte bu siyah renkli oğlunda da siyaha çeken bir damar vardır” buyurdular. (Nesâî, Talak: 46) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": 2129,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, bir gün; Rasûlüllah (sallallahü aleyhi ve sellem), Âişe’nin yanına sevinçli olarak girdi yüzü parıl parıl parlamaktaydı ve Âişe’ye şöyle dedi: “Duymadın mı? Mücezziz isimli kimse âni bir bakışla aynı renklerde olan Zeyd b. Harîse ile Üsâme b. Zeyd’in ayaklarına bakarak bu ayaklar birbirlerindendir, yani bunlar baba oğuldur demişti.” (Nesâî, Talak: 51) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": 2130,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) buyurdular ki: “Karşılıklı hediyeleşin, çünkü hediye kalpten kini giderir. Bir komşu kadın; komşusu olan kadına koyun paçasından bir parça bile olsa hediye olarak vermeyi küçük görmesin.” (Buhârî, Hibe: 5) Bu hadis bu şekliyle garibtir. Ma’şer’in ismi Beni Haşim’in azâdlısı Necîh’tir. Bazı hadis bilginleri hafızası yönünden bu kimseyi tenkid etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": 2131,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyet edildiğine göre Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Bir bağış yapıp ta sonra bağışından dönen kimse doyuncaya kadar yiyip sonra kusan ve sonra kustuğuna dönüp onu yiyen köpek gibidir.” (Müslim, Hıbât: 2) Bu konuda İbn Abbâs ve Abdullah b. Amr’dan da hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": 2132,
			"text": "İbn Ömer ve İbn Abbâs (radıyallahü anhüma)’dan merfu olarak rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Bir kimsenin bağışta bulunup bağışından dönmesi caiz değildir. Ancak baba çocuğuna verdiği bağıştan dönebilir. Bağış yapıp ta sonra bağışından dönen kimse doyuncaya kadar yiyip kusan sonra dönüp kustuğunu yiyen köpeğe benzer.” (Müslim, Hıbât: 2) Bu hadis hasen sahihtir. diyor ki: Bağış yapanın bağışından dönmesi caiz olmayıp ancak baba çocuğuna yaptığı bağıştan dönebilir. Şâfii bu görüşüne bu hadisi delil olarak göstermektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		}
	]
}