{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"36": "Chapters On Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2304,
			"arabicnumber": 2304,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “İki nimetle pekçok insan aldanmıştır. Sağlık ve boş zaman.” (Buhârî, Rıkak: 1)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2305,
			"arabicnumber": 2305,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kim şu birkaç kelimeyi benden alarak onlarla amel eder? Veya onları amel ederek bir kimseye öğretir? Ebû Hüreyre diyor ki: “Ben Ey Allah’ın Rasûlü!” dedim. Bunun üzerine elimi tuttu ve beş konu sayarak şöyle buyurdu: “Haram şeylerin her çeşidinden sakın ki insanların ençok ibadet edeni olasın, Allah’ın sana ayırdığına razı ol ki insanların en zengini olasın, komşuna iyilik et ki gerçek mü’min olasın. Kendin için sevdiğini insanlar içinde sev ki gerçek mü’min olasın. Gülmeyi çoğaltma çünkü gülmenin çokluğu kalbi öldürür.” (Müsned: 7748) Bu hadis garib olup sadece Cafer b. Süleyman’ın rivâyetiyle bilmekteyiz. Hasan Ebû Hüreyre’den bir şey işitmemiştir. Aynı şekilde Eyyûb, Yunus b. Ubeyd ve Ali b. Zeyd; Hasan, Ebû Hüreyre’den hadis işitmemiştir, demektedirler. Ebû Ubeyde en Nâci, Hasan’dan bu hadisi kendi sözü olarak rivâyet etmiş olup senedinde “Ebû Hüreyre” yi zikretmemişler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2306,
			"arabicnumber": 2306,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Yedi şey gelmezden önce hayırlı amelleri işlemeye devam edin, neyi bekliyorsunuz? Her şeyi unutturacak yoksulluğu mu, azdırıp saptıran zenginliği mi?, Bedeni tüm güçleri bozan hastalığı mı? Bunaklık meydana getiren ihtiyarlığı mı?, Ansızın geliveren ölümü mü? Yoksa gelmesi beklenen Deccâl fitnesini mi? Yoksa kıyamet saatini mi bekliyorsunuz? Ki onun gelmesi daha dehşetli ve daha acıdır.” (Müsned: 7952) Bu hadis hasen garibtir. Bu hadisin A’rec’in, Ebû Hüreyre’den rivâyeti olduğunu sadece Muhrîz b. Harun’un rivâyetiyle bilmakteyiz. Bişr b. Ömer ve başkaları bu hadisi bu şekilde Muhriz b. Harun’dan rivâyet etmişlerdir. bu hadisi Saîd el Makburî’den işiten bir kimseden ve Ebû Hüreyre’den benzeri şekilde aktarmış olup “Bekliyor musunuz?” diye başlamaktadır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2307,
			"arabicnumber": 2307,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Tüm lezzetleri kesip koparanı çok hatırlayın yani ölümü.” (İbn Mâce, Zühd: 31) Bu konuda Ebû Saîd’den de hadis rivâyet edilmiştir. Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2308,
			"arabicnumber": 2308,
			"text": "Osman’ın azâdlı kölesi Hanî (radıyallahü anh)’den rivâyete göre: Osman, bir kabrin başında durduğu zaman sakalını ıslatıncaya kadar ağlardı kendisine şöyle denildi: “Cennet ve Cehennem hatırlatılınca ağlamıyorsun bu kabirden mi ağlıyorsun?” şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kabir ahiretin konaklamalarının ilkidir. Kişi ondan kurtulursa gerisi ondan kolaydır. Eğer kurtulmazsa ondan sonrası daha ağırdır.” Osman şöyle devam etti: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her ne korkunç bir manzara gördümse, kabir; hepsinden daha korkunçtur.” (İbn Mâce, Zühd: 32) hadis hasen garib olup Hişâm b. Yusuf’un rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2309,
			"arabicnumber": 2309,
			"text": "Ubâde b. Sâmit (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kim Allah’a kavuşmak isterse Allah da o kimseyle kavuşmak ister. Kimde Allah’a kavuşmak istemezse, Allah da o kimseye kavuşmaktan hoşlanmaz.” (İbn Mâce, Zühd: 32) Bu konuda Ebû Hüreyre, Âişe, Enes, Ebû Mûsâ’dan da hadis edilmiştir. Bu Ubâde hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2310,
			"arabicnumber": 2310,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: “Yakın akrabalarını uyar” ayeti nazil olunca; Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ey Abdulmuttalib’in kızı Safiyye, Ey Muhammed’in kızı Fatıma, Ey Abdulmuttalib oğulları Allah’ın vereceği cezalara karşı sizi koruyabilecek hiçbir gücüm yok, malımdan isterseniz onu verebilirim sadece…” (Müslim, İman: 34; Nesâî, Vesâyâ: 88) Bu konuda Ebû Hüreyre, Ebû Mûsâ, İbn Abbâs’tan da hadis rivâyet edilmiştir. Âişe hadisi hasen garibtir. Bazıları Hişâm b. Urve’den bu hadisin bir benzerini rivâyet etmişlerdir. Yine bazıları Hişâm’dan ve babasından mürsel olarak rivâyet edip “Âişe’yi” zikretmemişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah’a karşı duyduğu sorumluluk bilincinden dolayı ağlayan kişi sağılan süt memeye dönmedikçe Cehenneme girmeyecektir. Allah’ın dinini yeryüzüne hâkim kılmak için çalışıp çabalayan kişiye bulaşan toz ile Cehennem dumanı bir araya gelmeyecektir.” (Nesâî, Cihâd: 9; İbn Mâce: Cihad: 64) Bu konuda Ebû Reyhane ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Muhammed b. Abdurrahman, Talha ailesinin azâdlı kölesi olup Medînelidir, güvenilir bir kimsedir, kendisinden Şu’be ve Sûfyân es Sevrî hadis rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2312,
			"arabicnumber": 2312,
			"text": "Ebû Zerr (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ben sizin görmediklerinizi görüyor işitmediklerinizi işitiyorum. Gökyüzü çatırdadı ve çatırdamakta da haklı idi çünkü gökyüzünde dört parmaklık bir yer kalmamıştı ki secde eder vaziyette melekler orayı doldurmamış olsun vallahi benim bildiklerimi bilmiş olsaydınız az güler ve çok ağlardınız, Yataklar üzerinde kadınlardan zevk almaz sokaklara dökülür ve Allah’a yalvarır yakarırdınız. Bu yüzden ben bile kesilip yok edilen bir ağaç olmayı istedim.” (İbn Mâce, Zühd: 19; Buhârî, Rikak: 27) Bu konuda Ebû Hüreyre, Âişe, İbn Abbâs ve Enes’den de hadis rivâyet edilmiştir. Bu hadis hasen garibtir. Başka bir yolla yapılan rivâyette Ebû Zerr’in şöyle dediği rivâyet olunur: “Ben de kesilip yok edilen bir ağaç olmayı arzu ettim.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2313,
			"arabicnumber": 2313,
			"text": "Ebû Hüreyre’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Benim bildiklerimi bilmiş olsanız şüphesiz ki az güler çok ağlardınız.” (İbn Mâce, Zühd: 19; Buhârî, Rikak: 27) hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2314,
			"arabicnumber": 2314,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Bir kimse bir söz söyler ve söylediği sözde bir sakınca görmez fakat o sözü yüzünden Cehennem’de yetmiş yıl dibe doğru düşer gider.” (Müslim, Zühd: 7) Bu hadis bu şekliyle hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2315,
			"arabicnumber": 2315,
			"text": "Behz b. Hakîm’in babasından ve dedesinden rivâyetine göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işittim: “İnsanları güldürmek için laf edip yalan söyleyen kişiye yazıklar olsun yazıklar olsun yazıklar olsun .” (Ebû Dâvûd: Edeb: 38; Dârimî, İstisan: 6) Bu konuda Ebû Hüreyre’den de hadis rivâyet edilmiştir. Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2316,
			"arabicnumber": 2316,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından bir kişi vefat etti bu arada bir adam o kimse için Cennetle sevin bakalım” dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Biliyor musun? Belki de bu kimse kendisini ilgilendirmeyen bir konuda lüzumsuz sözler sarfetmiş veya kendisine faydası olacak konularda harcamamış ve cimrilik etmiştir.” (İbn Mâce, Fiten: 21) Bu hadis garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2317,
			"arabicnumber": 2317,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Bir kimsenin lüzumsuz ve boş şeyleri terk etmesi iyi bir Müslüman oluşundandır.” (İbn Mâce, Fiten: 21) Bu hadis garib olup bu hadisi Ebû Seleme’nin Ebû Hüreyre’den bu şekilde rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2318,
			"arabicnumber": 2318,
			"text": "Ali b. Hüseyin’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Kişinin lüzumsuz ve boş şeyleri terk etmesi Müslümanlığının iyiliklerindendir.” (İbn Mâce, Fiten: 21; Muvatta, Cami: 2) Zührî’nin arkadaşlarından pek çok kimse bu hadisi Zührî’den, Ali b. Hüseyin’den, Mâlik’in hadisine benzer şekilde fakat mürsel olarak rivâyet etmişlerdir. Bu rivâyet benim yanımda Ebû Seleme’nin, Ebû Hüreyre’den ve Ali b. Hüseyin’den yaptığı rivâyetten daha sağlamdır. Çünkü Ali b. Hüseyin Ali b. ebî Tâlib’e yetişememiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2319,
			"arabicnumber": 2319,
			"text": "Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından Harîs el Müzenî’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim şöyle diyordu: “Sizden biriniz Allah’ın rızasını kazanacak bir söz söyler de bu sözün Allah’ın rızasını kazanma yolunda neler kazandıracağını bilemez fakat Allah bu sözü yüzünden kendisine kavuşuncaya kadar rızasını ona gerekli kılıverir. Yine sizden biriniz bir söz söylerde bu sözüyle Allah’ın gazabını elde etmiş olur ve bu söylediği sözle Allah’ın gazabından ne kazanacğını bilemez. Fakat Allah bu sözü yüzünden kendisine kavuşacağı güne kadar ona gazabını gerekli kılabilir.” (İbn Mâce, Fiten: 17; Muvatta, Cami: 3) Bu konuda Ümmü Habibe’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Pek çok râvî bu hadisi Muhammed b. Amr’dan buradaki gibi rivâyet ederek: “Muhammed b. Amr’dan, babasından, dedesinden, Bilâl b. Harîs’den” dediler. Bu hadis Mâlik’den de rivâyet edilmiş olup senedinde “Muhammed b. Amr’dan, babasından, Bilâl b. Harîs’den” denilmiş “dedesinden” denilmemiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2320,
			"arabicnumber": 2320,
			"text": "Sehl b. Sa’d (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Allah katında dünya bir sivrisineğin kanadına denk olsaydı (yani tüm dünya ve içindekilerin değeri bu kadar olsaydı) Kafire dünyada bir yudum su içirmezdi.” (İbn Mâce, Zühd: 3) Bu konuda Ebû Hüreyre’den de hadis rivâyet edilmiştir. Bu hadis bu şekliyle sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2321,
			"arabicnumber": 2321,
			"text": "Müstevrid b. Şeddâd’tan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikte bir ölü oğlağın başında duran toplulukla beraberdim Rasûlüllah (sallallahü aleyhi ve sellem) buyurdular ki: “Şu ölü oğlağın sahipleri tarafından atıldığı zaman değerini yitirdiğinden dolayı atıldığı görüşünde misiniz? Ashab: “Evet ey Allah’ın Rasûlü! onu değersiz oluşundan dolayı atmışlardır.” Bunun üzerine buyurdular ki: “Dünya Allah katında şu ölü oğlağın değersiz oluşundan daha değersizdir.” (İbn Mâce, Zühd: 3) konuda Câbir ve İbn Ömer’den de hadis rivâyet edilmiştir. Müstevrîd hadisi hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2322,
			"arabicnumber": 2322,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işittim: “Dikkat ediniz! Dünya ve içindekiler tümüyle melundur. Yani Allah’ın rahmetinden uzaklaştırılmışlardır. Ancak Allah’ı anmak ve Allah’ın rızasını kazanmaya götüren şeylerle; Âlim olup, ilim öğrenip ve ilim öğreten başka… her şey ve herkes.” (İbn Mâce, Zühd: 3) Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2323,
			"arabicnumber": 2323,
			"text": "Fihr oğullarından Müstevrîd (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ahiret nimeti karşısında dünya nimeti; sizden birinizin parmağını denize batırması gibidir. O parmak denizden ne kadar su ile döner ona bir baksın.” (İbn Mâce, Zühd: 2) Bu hadis hasen sahihtir. b. Ebû Hâlid, Ebû Abdullah diye künyelenir. Kaysın babasından Ebû Hazîm’dir. İsmi, Abd b. Avf olup sahabedendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2324,
			"arabicnumber": 2324,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Dünya; mü’min için bir hapishane, kafir için ise bir Cennettir.” (İbn Mâce, Zühd: 3; Müslim, Zühd: 1) konuda Abdullah b. Amr’dan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2325,
			"arabicnumber": 2325,
			"text": "Ebû Kebşe el Enmârî (radıyallahü anh)’den rivâyete göre, bizzat kendisi Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işitmiştir: “Üç özellik var ki onlar üzerine yemin ederim, size bir söz söyleyeceğim onu hafızanızda iyi tutun dedi ve şöyle buyurdu: “Sadaka vermekten bir kulun malı eksilmez. Uğradığı haksızlıklara sabreden kulun Allah şerefini artırır. Dilencilik kapısını açan bir kula Allah yoksulluk kapısını açar -veya benzeri bir ifade kullandı- Size bir söz söyleyeceğim onu hafızanızda tutun sonra şöyle buyurdu: Dünyada dört sınıf insan vardır; Allah’ın kendisine mal rızık ve ilim verdiği bir kul ki kul bu nimet içersinde yolunu Rabbi vasıtasıyla bulur, Müslümanlarla ve akrabalarıyla irtibatını kesmez o verilen nimette Allah’ın hakkı ne ise onu da bilir ve gereğini yerine getirir. Bu kul Allah katında en üstün derecededir. Yine bir kul ki Allah ona ilim vermiş mal vermemiştir. Bu kulun niyeti doğrudur ve şöyle der: Eğer malım olsaydı falanın yaptığı gibi yapardım der işte o niyetine göre karşılık görür. Önceki kimse ile sevapta eşittirler. Yine bir kul ki Allah kendisine rızık vermiş fakat ilim vermemiştir. İlim ve bilgisizlik yüzünden malını dengesiz biçimde harcar, rabbine karşı sorumluluk bilinci duymaz akrabası ve Müslümanlarla alakasını keser ve o malda Allah’ın hakkını da yerine getirmez. Bu kimse en kötü durumdadır. Yine bir kul daha vardır ki: Allah kendisine ne mal ne de ilim vermiştir. Bu kimse de şöyle der; Eğer malım olsaydı ben de falan kimse gibi o malı kötü yollarda harcardım. O da niyetine göre karşılık görür her ikisinin de günahı eşittir.” (İbn Mâce, Zühd: 8) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2326,
			"arabicnumber": 2326,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kime bir geçim darlığı gelirde o kimse bu geçim darlığını insanlara arz edip kapatmaya çalışırsa o kimsenin ihtiyacı kapatılmaz. Kime de bir geçim darlığı gelirde bu sıkıntısını Allah’a arz ederse Allah er veya geç ona yardım eder.” (Ebû Dâvûd, Zekât: 14) Bu hadis hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2327,
			"arabicnumber": 2327,
			"text": "Ebû Vâil (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Muaviye hasta olan Ebû Haşim b. Utbe’nin yanına ziyarete gelmişti ve şöyle demişti: Ey dayım! seni ağlatan nedir? Seni rahatsız eden bir sancı mı? Yoksa dünya hırsı mı? Ebû Haşim şu cevabı verdi: “Hiçbiri değil fakat Rasûlüllah (sallallahü aleyhi ve sellem), bana bir şeyler buyurmuştu ki onu tutamadım; şöyle buyurmuştu: Mal varlığı olarak sana yetecek bir şey bir hizmetçi ve Allah yolunda kullanacağın bir binit, fakat ben bugün kendimi pek çok mal biriktirmiş olarak görüyorum.” (Nesâî, Ziyne: 120; İbn Mâce, Zühd: 17) Zaîde ve Ubeyde b. Humeyd bu hadisi Mansur’dan, Ebû Vâil’den, Semura b. Sehm’den rivâyet ederek şöyle demişlerdir: “Muaviye Ebû Haşim’in yanına girdi…” diyor ve bu hadisin bir benzerini rivâyet ediyor. konuda Büreyre el Eslemî’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2328,
			"arabicnumber": 2328,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Çiftlik ve benzeri gibi gelir getirecek şeyler edinmeyin böylece dünyaya meyledersiniz.” (Müsned: 3398) Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2329,
			"arabicnumber": 2329,
			"text": "Abdullah b. Büsr (radıyallahü anh)’den rivâyete göre: Bir bedevî, Ey Allah’ın Rasûlü! dedi. İnsanların en hayırlısı kimdir? Rasûlüllah (sallallahü aleyhi ve sellem) buyurdular ki: “Ömrü uzun olup ameli güzel olandır.” (Müsned: 17030) Bu konuda Ebû Hüreyre ve Câbir’den de hadis rivâyet edilmiştir. Bu hadis bu şekliyle hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2330,
			"arabicnumber": 2330,
			"text": "Ebû Bekre (radıyallahü anh)’den rivâyete göre, bir adam Ey Allah’ın Rasûlü! dedi. İnsanların en hayırlısı kimdir? “Buyurdular ki: Ömrü uzun olup ameli güzel olandır. Yine sordu: İnsanların en kötüsü hangisidir? Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Ömrü uzun ve ameli kötü olan kimsedir.” (Dârimî, Rikak: 21) Bu hadis bu şekliyle hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2331,
			"arabicnumber": 2331,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ümmetimin ortalama ömrü altmış ila yetmiş arasındadır.” (İbn Mâce, Zühd: 7) Bu hadis Ebû Salih’in, Ebû Hüreyre’den rivâyeti olarak hasen garibtir. Ebû Hüreyre’den değişik şekillerde de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2332,
			"arabicnumber": 2332,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2333,
			"arabicnumber": 2333,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), omzumdan tutarak şöyle buyurdu: “Dünyada bir garib gibi yabancı gibi hatta bir yolcu gibi ol! Kendini kabir halkından biri gibi kabul et.” İbn Ömer şöyle derdi: “Sabaha çıktığında akşama çıkacağından söz etme, hastalığından önce sağlığından ölümünden önce hayatından istifade ederek hazırlık yap. Ey Abdullah yarın isminin mutlu mu? Bedbaht mı? olacağını bilemezsin.” (Buhârî, Rıkak: 37; İbn Mâce, Zühd: 14) Bu hadis A’meş tarafından Mücâhid’den ve İbn Ömer’den benzeri şekilde rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2334,
			"arabicnumber": 2334,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), eliyle bir insanı veya kendisini göstererek, bu Ademoğludur dedi ve o kimsenin yakınına işaret ederek bu da onun ecelidir. Dedi. Sonra elini ensesine götürerek mesafenin yakınlığını kasdederek elini uzattı ve insanoğlunun arzu ve istekleri ileridedir, ileridedir, ileridedir” buyurdular. (İbn Mâce, Zühd: 27) Bu hadis hasen sahihtir. Bu konuda Ebû Saîd’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2335,
			"arabicnumber": 2335,
			"text": "Abdullah b. Amr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: kendimize ait kamıştan bir evi tamir ederken Rasûlüllah (sallallahü aleyhi ve sellem) bize uğradı ve; “Bu nedir? Ne yapıyorsunuz” buyurdu. Biz de: Çökmeye yüz tuttu da tamir ediyoruz dedik, “Ölümün bundan daha çabuk geleceğini sanıyorum” buyurdular. (Ebû Dâvûd, Edeb: 57; İbn Mâce, Zühd: 15) Bu hadis hasen sahihtir. Ebû’s Sefer’in ismi Saîd b. Muhammed’tir. Ayrıca kendisine İbn Ahmed es Sevrî de denilir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2336,
			"arabicnumber": 2336,
			"text": "Ka’b b. Iyaz (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem)’den şöyle derken işitmiştir: “Her ümmetin bir fitnesi vardır, benim ümmetimin fitnesi ise maldır.” (İbn Mâce, Fiten: 18) Bu hadis hasen sahih garib olup, bu hadisi sadece Muaviye b. Salih’in rivâyeti olarak bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2337,
			"arabicnumber": 2337,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyet edildiğine göre Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Ademoğlunun iki vadi dolu altını olsa üçüncü vadinin de kendisinin olmasını ister. Ne var ki insan oğlunun ağzını ancak toprak doldurur. Yine de Allah tevbe edenin tevbesini kabul eder.” (Müslim, Zekât: 39; Dârimî, Rıkak: 62) Bu konuda Übey b. Ka’b, Ebû Saîd, Âişe, İbn Zübeyr, Ebû Vakîd, Câbir, İbn Abbâs ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. Bu hadis bu şekliyle hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2338,
			"arabicnumber": 2338,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “İhtiyarın kalbi uzun ömür ve fazla mal elde etmeye karşı gençtir.” (Müslim, Zekât: 38; İbn Mâce, Zühd: 27) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2339,
			"arabicnumber": 2339,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ademoğlu ihtiyarladıkça iki yönü gençleşir; uzun ömürlü olmak ve çok mal elde etmek.” (Müslim, Zekât: 38; İbn Mâce, Zühd: 27) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2340,
			"arabicnumber": 2340,
			"text": "Ebû Zerr (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Dünyadan yüz çevirmek ve dünya sevgisini terk etmek demek kişinin helal olan şeyleri kendisine haram kılması veya malı bırakıp atmak demek değildir. Fakat gerçek zahitlik ve dünya sevgisini terk etmek demek; elinde bulunan şeylere Allah katında bulunan imkan ve nimetlerden fazla ümid besler olmamandır. Veya başına gelen bir bela ve sıkıntıdan dolayı elde edeceğin sevap, senin yanında o bela ve sıkıntıdan dolayı kaybettiğin maldan üstün ve hayırlı olmalıdır. İşte gerçek zahidlik ve dünya sevgisi bu olmalıdır.” (İbn Mâce, Zühd: 1) Bu hadis garib olup sadece bu şekliyle bilmekteyiz Ebû İdris el Havlanî’nin ismi Aizullah b. Abdullah’tır. Amr b. Vakîd ise münker hadisler aktaran birisidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2341,
			"arabicnumber": 2341,
			"text": "Osman b. Afvân (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Adem oğlunun şunlardan başka şeylerde hakkı yoktur: Oturacağı bir ev, vücudunu örtecek bir elbise, ekmek ve su.” (Dârimî, Rıkak: 10) Bu hadis hasen sahihtir. Bu hadisin sözleri Hureys b. Sâib’in rivâyetidir. Ebû Dâvûd, Süleyman b. Selm el Belhî’den işittim şöyle diyordu: Nadr b. Şümeyl şöyle derdi: Hadiste geçen “Cif-ül hubzi”nin manası yanında katık olmayan ekmek demektir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2342,
			"arabicnumber": 2342,
			"text": "Mutrıf (radıyallahü anh)’ın babasından rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem)’in sohbetine vardığında; Rasûlüllah (sallallahü aleyhi ve sellem), Tekasür sûresini yorumlar durumda şöyle diyordu: “Mal biriktirip çoğaltma işi sizi oyalıyor, ademoğlu malım malım der oysa senin malından senin olan, sadaka vererek ahirete gönderdiğin, yiyip tükettiğin ve giyip eskittiğin şeydir.” (Müslim, Zühd: 1) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2343,
			"arabicnumber": 2343,
			"text": "Ebû Umâme (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), şöyle buyurmuştur: “Ey Ademoğlu sen ihtiyaçtan fazlasını infak edip dağıtırsan senin için bu hayırlıdır. Eğer biriktirir ve elinde tutarsan senin için bu zararlıdır. Geçinecek kadarını biriktirmenden dolayı kınanmazsın sen harcamaya önce geçimini üzerine aldığın kimselerden başla veren el alan elden daima üstündür…” (Müslim, Zekât: 32) Bu hadis hasen sahihtir. Şeddâd b. Abdullah; Ebû Ammâr diye künyelenir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2344,
			"arabicnumber": 2344,
			"text": "Ömer b. Hattâb (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle demiştir: “Siz, Allah’a gerçek biçimde tevekkül edip güvenip dayansaydınız kuşların rızıklandıkları gibi siz de rızıklandırılırdınız. Çünkü o kuşlar sabahleyin aç olarak çıkarlar akşam kursakları dolu olarak dönerler.” (İbn Mâce, Zühd: 14) Bu hadis hasen sahih olup sadece bu şekliyle bilmekteyiz. Ebû Temîm el Ceyşanî’nin ismi Abdullah b. Mâlik’tir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2345,
			"arabicnumber": 2345,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), zamanında iki kardeş vardı. Bunlardan biri Peygamber (sallallahü aleyhi ve sellem)’in yanına gelir bir şeyler öğrenmeye çalışır diğeri de sanatkar olup geçimlerini temin etmek için çalışırdı. Çalışan kardeş Peygamber (sallallahü aleyhi ve sellem)’e diğer kardeşini, çalışmayıp bedavadan yediğini şikayet etti de bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Belki de sen o kardeşinin yüzünden rızıklandırılıyorsun.” (İbn Mâce, Zühd: 14) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2346,
			"arabicnumber": 2346,
			"text": "Rasûlüllah (sallallahü aleyhi ve sellem)’in sahabîlerinden olan Ubeydullah b. Mıhsan el Hatmî (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Sizden her kim rûhen ve bedenen sağlıklı olup günlük yiyeceği de yanında olursa tüm dünya nimetleri ona toplanmış gibidir.” (İbn Mâce, Zühd; 9) Bu hadis hasen garibtir. Bu hadisi sadece Mervan b. Muaviye’nin rivâyetiyle bilmekteyiz. geçen “Hîzet” kelimesi toplanmış anlamındadır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2347,
			"arabicnumber": 2347,
			"text": "Ebû Umâme (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “En beğendiğim dostum malı ve insanlara yükü az olan namazında devamlı ve duyarlı olup Rabbine olan kulluğunu en güzel biçimde yapan gizli açık her durumda Allah’a itâat eden durumu bilinmediği için halk arasında şöhrete ulaşmayıp parmakla gösterilmeyen yaşayacak kadar rızkı olup rızkına ve her şeyine sabreden mümindir.” Sonra elini birbirine vurup dinleyicilerin dikkatini çekti ve şöyle devam etti: “Ölümü çabuk, ağlayanı ve mirası az olandır.” sened ile Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğu da rivâyet edilmiştir: Rabbim, Mekke vadisini benim için altına çevirme teklifinde bulundu da; Ben hayır ya Rabbi dedim, bir gün doyup birgün aç kalayım (üç gün veya buna benzer bir tabir kullandı) Aç kaldığımda sana yalvarır yakarır ve seni hatırlarım, doyduğum zamanda sana şükreder ve sana hamdederim. (Buhârî, Rıkak: 16) Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2348,
			"arabicnumber": 2348,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2349,
			"arabicnumber": 2349,
			"text": "Fedâle b. Ubeyd (radıyallahü anh), Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işitmiştir: “İslam’a hidayet edilip geçimi kendine yeterli ve kanaat eden kimseye ne mutlu.” (Müsned: 22818) Ebû Hanî’in ismi Humeyd b. Hanî’dir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2350,
			"arabicnumber": 2350,
			"text": "Abdullah b. Muğaffel (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Bir adam Rasûlüllah (sallallahü aleyhi ve sellem)’e; Ey Allah’ın Rasûlü! ben seni gerçekten seviyorum dedi. Rasûlüllah (sallallahü aleyhi ve sellem), o söylediğin söze dikkat et buyurdu. Adam tekrar seni ben gerçekten seviyorum deyince; Rasûlüllah (sallallahü aleyhi ve sellem), söylediğin söze iyi dikkat et ciddi misin? Buyurdu. Adam da: Vallahi seni gerçekten seviyorum diyerek üçüncü sefer aynı sözü tekrar etti. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Eğer beni seviyorsan fakirliğe karşı bir kalkan hazırla çünkü fakirliğin beni seven kimseye gelmesi; selin, durak yerine akması gibi hızlıdır.” (Tirmizî rivâyet etmiştir)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2351,
			"arabicnumber": 2351,
			"text": "Ebû Saîd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Muhâcirlerin fakirleri Cennete zenginlerden beşyüz yıl önce gireceklerdir.” (İbn Mâce, Zühd: 6) Bu konuda Ebû Hüreyre, Abdullah b. Amr ve Câbir’den de hadis rivâyet edilmiştir. Bu hadis bu şekliyle hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2352,
			"arabicnumber": 2352,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Allah’ın beni yoksul olarak yaşat ve yoksul olarak canımı al ve kıyamet gününde de yoksullar arasında haşret. Âişe (radıyallahü anha) niçin Ey Allah’ın Rasûlü diye sordu Rasûlüllah (sallallahü aleyhi ve sellem)’de şöyle buyurdu: Çünkü onlar zenginlerinden kırk yıl önce Cennete gireceklerdir. Ey Âişe! Yoksulu yarım hurmayla da olsa boş çevirme bir şeyler ver. Ey Âişe! Yoksulları sev onlara yakın ol Allah’ta seni kıyamet günü Cennetine yakın eder.” (İbn Mâce, Zühd: 6) Bu hadis garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2353,
			"arabicnumber": 2353,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2354,
			"arabicnumber": 2354,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2355,
			"arabicnumber": 2355,
			"text": "Câbir b. Abdullah (radıyallahü anh)’den rivâyet göre Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Müslümanların fakirleri Cennete zenginlerden kırk yıl önce gireceklerdir.” (İbn Mâce, Zühd: 6) Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2356,
			"arabicnumber": 2356,
			"text": "Mesrûk (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Âişe’nin yanına girdim bana yemek getirtti ve şöyle dedi: “Bir yemekten doyduğum zaman ağlamak isterim ve ağlarım.” Bende neden diye sordum, dedi ki: “Rasûlüllah (sallallahü aleyhi ve sellem)’in dünyadan ayrılıp gittiği anı hatırlarım vallahi et ve ekmekten günde iki defa karnını doyurmamıştı.” (Müslim, Zühd: 1) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2357,
			"arabicnumber": 2357,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), vefat edinceye kadar iki gün arka arkaya arpa ekmeğinden doymamıştır.” (İbn Mâce, Etıme: 49) Bu hadis hasen sahihtir. konuda Ebû Hüreyre’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2358,
			"arabicnumber": 2358,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), dünyadan ayrılıncaya kadar ne kendisi nede aile halkı üç gün peşpeşe buğday ekmeğinden doymadılar.” (İbn Mâce, Etıme: 48) hadis bu şekliyle hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2359,
			"arabicnumber": 2359,
			"text": "Selim b. Âmir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Ebû Ümâme’den işittim şöyle diyordu: “Rasûlüllah (sallallahü aleyhi ve sellem)’in ev halkından çok olmadığı için arpa ekmeği bile artmazdı.” (İbn Mâce, Etıme: 48) Bu hadis bu şekliyle hasen garibtir. b. Ebû Bükeyr, Küfelidir. Ebû Bükeyr; Yahya’nın babasıdır. Kendisinden Sûfyân es Sevrî hadis rivâyet etmiştir. Yahya b. Abdullah b. Bükeyr ise Mısırlı olup Leys’in arkadaşıdır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2360,
			"arabicnumber": 2360,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) peşpeşe birkaç geceyi aç olarak geçirir ailesi de akşam yemeği bile bulamadıkları olurdu. Ekmekleri ise çoğunlukla arpa ekmeği idi.” (İbn Mâce, Etıme: 48) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2361,
			"arabicnumber": 2361,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle dua ederdi: “Allah’ım Muhammed ailesinin rızkını yetecek kadar kıl.” (Müslim, Zühd: 1) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2362,
			"arabicnumber": 2362,
			"text": "Enes (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), yarın için bir şey saklamazdı.” (Tirmizî rivâyet etmiştir.) Bu hadis garibtir. Bu hadis Cafer b. Süleyman’dan ve Sabitten mürsel olarak rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2363,
			"arabicnumber": 2363,
			"text": "Enes (radıyallahü anh)’den rivâyete şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ömrünün sonuna kadar yüksek masa ve benzeri şeyler üzerinde yemek yememiştir. Elenmiş saf undan da ekmek yememiştir. (İbn Mâce, Etıme: 44) Bu hadis Saîd b. ebî Arûbe hadisi olarak hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2364,
			"arabicnumber": 2364,
			"text": "Sehl b. Sa’d (radıyallahü anh)’den rivâyete göre, kendisine şöyle soruldu: “Rasûlüllah (sallallahü aleyhi ve sellem), elenmiş has undan yapılmış ekmek yedi mi?” Sehl dedi ki: Rasûlüllah (sallallahü aleyhi ve sellem), Allah’a kavuşuncaya kadar has undan yapılmış ekmeği görmedi. Yine Sehl’e şöyle denildi: Rasûlüllah (sallallahü aleyhi ve sellem) zamanında un elemek için elek var mıydı? Buna cevaben eleğimiz yoktu diye cevap verdi. O halde arpayı nasıl yapıyordunuz? Diye soruldu; Dedi ki: Üfürürdük kepeğinden uçan uçardı sonra onu ıslatır hamur yapardık. (İbn Mâce, Etıme: 44) Bu hadis hasen sahihtir. b. Enes bu hadisi Ebû Hazîm’den rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2365,
			"arabicnumber": 2365,
			"text": "Kays b. Ebû Hâzim (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Sa’d b. ebî Vakkâs’tan işittim şöyle diyordu: Allah yolunda kan akıtan ilk kişi benim, Allah yolunda ilk ok atan da benim. Bir seferinde Muhammed (sallallahü aleyhi ve sellem)’in ashabından bir gurupla savaşıyordum ki o savaşta ağaç yaprakları ve asma çubuğu yiyorduk. Bundan dolayı da her birimizin dışkısı koyun ve deve dışkısı gibi oluyordu. Şimdi ise Esedoğulları; din konusunda beni beğenmemeye başladılar. Eğer bunların dediği gibi ise zarardayım ve tüm amellerim boşa gitti demektir. (Müslim, Zühd: 1) Bu hadis Beyan’ın rivâyeti olarak hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2366,
			"arabicnumber": 2366,
			"text": "Sa’d b. Mâlik (radıyallahü anh)’den rivâyete göre, şöyle diyor: Allah yolunda ok atan Arapların ilki benim bir seferinde Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikte savaşıyorduk bu savaşta yiyecek olarak sadece asam çubuğu vardı bundan dolayı da her birimizin dışkısı davar dışkısı gibiydi. Şimdi Esedoğulları din konusunda beni beğenmeye başladılar. Eğer onların dediği gibiyse zarardayım ve tüm amellerim boşa gitti demektir. (Müslim, Zühd: 1) Bu hadis hasen sahihtir. konuda Utbe b. Gazvan’dan da hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2367,
			"arabicnumber": 2367,
			"text": "Muhammed b. Sirîn (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Ebû Hüreyre’nin yanındaydık üzerinde iki keten elbise vardı; birine burnunu sildi ve şöyle dedi: Vay vay Ebû Hüreyre keten elbiseye burnunu siliyor. Oysa bir zamanlar Rasûlüllah (sallallahü aleyhi ve sellem)’in minberiyle Âişe’nin odası arasında açlıktan sendeleyip bayıldığımı görmüştüm. Bu arada gelip giden bende delilik var zannederek ayağını boynuma basardı. Halbuki ben deli değildim. Sadece aç idim.” (Buhârî, İtisam: 9) Bu hadis bu şekliyle hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2368,
			"arabicnumber": 2368,
			"text": "Fedâle b. Ubeyd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), cemaatle namaz kılarken bazı kişiler açlıktan dolayı bayılıp düşerlerdi bunlar Ashab-ı Suffe denilen mescidi, bir bölümünde günlerini geçiren kimselerdi. Bedeviler bunları görünce bunlar delidirler demişlerdi. Rasûlüllah (sallallahü aleyhi ve sellem), namazını kılıp bitirince onların yanına vardı ve şöyle buyurdu: “Allah katında nelere sahip olduğunuzu bir bilmiş olsaydınız ihtiyaç ve sıkıntınızın daha da artmasını isterdiniz.” Fedâle diyor ki: Ben o gün Rasûlüllah (sallallahü aleyhi ve sellem) ile beraberdim. (Müsned: 22813) Bu hadis sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2369,
			"arabicnumber": 2369,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), her zaman çıkmadığı ve kimseyle buluşamayacağı bir saatte evinden dışarı çıkmıştı. Derken Ebû Bekir yanına çıkageldi. Hangi şeyden dolayı bu saatte buradasın Ey Ebû Bekir! Dedi. Ebû Bekir de: Rasûlüllah (sallallahü aleyhi ve sellem) ile buluşup yüzünü görür ve selam veririm ümidiyle çıktım dedi. Az sonra Ömer geldi. Rasûlüllah (sallallahü aleyhi ve sellem), ona hangi şey seni bu saatte çıkardı dedi. Ömer: Açlık Ey Allah’ın Rasûlü! dedi. Rasûlüllah (sallallahü aleyhi ve sellem)’de Açlık bende de var dedi. Sonra üçü birden Ebû’l Heysem et Teyyihan el Ensarî’nin evine doğru yürüdüler. Ebû’l Heysem, hurması ve koyunları bol olan bir kişi idi, hizmetçisi yoktu. Evde kendisini bulamadılar ve evin hanımına eşin nerede? Dediler. Hanım: Bize, tatlı içme suyu getirmeye gitmişti dedi. Biraz sonra Ebû’l Heysem dopdolu bir su kırbasıyla çıkageldi. Kırbasını yere koyduktan sonra gelip Peygamberimize sarılıp anne ve babasının Rasûlüllah (sallallahü aleyhi ve sellem)’e feda olduğunu söyledi. Sonra onları bahçesine götürdü ve bir sergi serdi ve hurma ağacından olgunu ve olgun olmayanı bir arada bulunan bir hurma dalı salkımı getirdi ve ortaya koydu. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): Bize olgunlarından seçip getirmedin mi? buyurdu. Ebû’l Heysem: Ey Allah’ın Rasûlü! kendiniz seçesiniz diye veya yaş ve kuru hangisinden isterseniz seçip yemeniz için bu şekilde getirdim dedi. Böylece o hurmalardan yediler, tatlı sudan içtiler. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), şöyle buyurdu: “Canımı kudret elinde tutan Allah’a yemin olsun ki bu nimetlerden kıyamet günü sorguya çekileceksiniz. Serinlik ve gölge, güzel hurma ve su…” Ebû’l Heysem yemek hazırlatmak için giderken Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Sakın ha! Sütlü bir hayvan kesmeyin! Ebû’l Heysem dişi veya erkek bir oğlak kesti hazırlayıp getirdi ve hep birlikte yediler, Rasûlüllah (sallallahü aleyhi ve sellem), hizmetçin var mı? dedi. Ebû’l Heysem hayır dedi. Rasûlüllah (sallallahü aleyhi ve sellem) savaş esirleri gelince bize gel buyurdu. Rasûlüllah (sallallahü aleyhi ve sellem)’e iki savaş esiri getirilmişti. Bir üçüncüsü yoktu. Ebû’l Heysem müracaat etti, Rasûlüllah (sallallahü aleyhi ve sellem)’de ikisinden birini seç buyurdu. Ebû’l Heysem: Ey Allah’ın Rasûlü benim yerime siz seçiniz dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): İstişare edilen kimse güvenilen kimsedir, dedi. Şunu al çünkü onu namaz kılarken gördüm dedi. ona iyi davran buyurdu. Ebû’l Heysem hanımına gitti ve durumunu ona anlattı bunun üzerine hanımı Rasûlüllah (sallallahü aleyhi ve sellem)’in “Ona iyi davran” sözünü yerine getirebilmek için onu hürriyetine kavuşturmalısın, dedi. Ebû’l Heysem de o hürdür dedi. Daha sonra Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Allah’ın gönderdiği her Peygamber ve devlet idarecisinin iki tür halkı vardır; Biri ona daima iyiliği emredip kötülükten sakındırır bir diğeri de ona devamlı güçlük çıkarıp yük olur kim kötü arkadaş ve personelden korunmuş olursa gerçekten her tür kötülükten korunmuş olur. (Müslim, Eşribe: 99) Bu hadis hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2370,
			"arabicnumber": 2370,
			"text": "Ebû Seleme b. Abdurrahman (radıyallahü anh)’den rivâyet edilmiştir. “Rasûlüllah (sallallahü aleyhi ve sellem) bir gün Ebû Bekir ve Ömer’le birlikte çıkmıştı…” diyerek hadisin bir benzerini aktarmış ve senedde Ebû Hüreyre’yi zikretmemiştir. hadisi Ebû Avâne’nin hadisinden daha geniş ve uzundur. Şeyban hadisçilerce güvenilen bir kimse olup yazdığı kitabı vardır. Bu hadis Ebû Hüreyre’den değişik şekillerde rivâyet edilmiştir. şekilde İbn Abbâs’tan da rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2371,
			"arabicnumber": 2371,
			"text": "Ebû Talha (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’e açlıktan yakınarak karınlarımıza bağladığımız taşları gösterdik bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), karnına bağladığı iki taşı gösterdi. (Tirmizî rivâyet etmiştir.) Bu hadis garibtir. Sadece bu şekliyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2372,
			"arabicnumber": 2372,
			"text": "Numân b. Beşîr (radıyallahü anh)’den işittim şöyle diyordu: “Dilediğiniz kadar yiyecek ve içecek içerisinde değil misiniz? Halbuki ben, Peygamberinizi karnını doyuracak kadar kötü hurma bile bulamadığını görmüşümdür.” (Müslim, Zühd: 1) Bu hadis sahihtir. Ebû Avâne ve başkaları bu hadisi Sîmak b. Harb’den, Ebû’l Ahvas’ın rivâyeti gibi rivâyet etmiştir. Şu’be bu hadisi Sîmak’den, Numân b. Beşîr’den ve Ömer’den hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2373,
			"arabicnumber": 2373,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Gerçek zenginlik mal çokluğunda değil, gerçek zenginlik gönül zenginliğidir.” (İbn Mâce, Zühd: 9) Bu hadis hasen sahihtir. Ebû Husayn’ın ismi Osman b. Âsım el Esedî’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2374,
			"arabicnumber": 2374,
			"text": "Hamza b. Abdulmuttalib’in karısı Kays’ın kızı Havle (radıyallahü anha)’dan rivâyet edildiğine göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işittim: Bu dünya malı çekici ve tatlıdır kim gereği şekilde onu elde etmeye çalışırsa kendisi için bereketli ve hayırlı olur. Kim de Allah ve Peygamber’in dağıtacağı ganimet malından değişik yollara başvurarak almaya kalkarsa kıyamette kendisi için sadece ateş vardır. (Buhârî, Rıkak: 10; Dârimî, Rıkak: 37) Bu hadis hasen sahihtir. Ebû’l Velîd’in ismi Ubeyd Senûta’dır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2375,
			"arabicnumber": 2375,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Dinar’a ve dirheme kulluk yapanlara lanet edilmiştir.” (İbn Mâce, Zühd: 8) Bu hadis bu şekliyle hasen garibtir. hadis değişik bir şekilde Ebû Salih’den, Ebû Hüreyre’den daha uzun olarak ta rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2376,
			"arabicnumber": 2376,
			"text": "Ka’b b. Mâlik el Ensarî (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Bir koyun sürüsü üzerine salıverilen iki aç kurdun o sürüye zararı, kişinin mal ve makam hırsının dinine verdiği zarardan daha fazla değildir.” (Dârimî, Rıkak: 21) Bu hadis hasen sahihtir. konuda İbn Ömer’den de hadis rivâyet edilmiş olup senedi sağlam değildir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2377,
			"arabicnumber": 2377,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyet edilmiştir. Rasûlüllah (sallallahü aleyhi ve sellem), bir hasır üzerinde uyumuştu kalktığında hasırın izi yan tarafına çıkmıştı. Bunun üzerine Ey Allah’ın Rasûlü! dedik, senin için bir yatak temin etsek. Bunun üzerine buyurdular ki: Benim dünya rahatlığı ile işim yok. Dünyada ben bir ağacın altında gölgelenip sonra oradan ayrılıp giden bir yolcu gibiyim.” (İbn Mâce, Zühd: 3) Bu konuda Ömer ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2378,
			"arabicnumber": 2378,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Kişi dostunun dini üzeredir. Bu yüzden kişi kimi dost edineceğine iyi baksın.” (Ebû Dâvûd, Edeb: 16) Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2379,
			"arabicnumber": 2379,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Cenazeyi üç şey takip eder sonra ikisi geri döner biri cenaze ile kalır. Ailesi, malı ve ameli cenazeyle birlikte gider sonra malı ve ailesi geri döner ameli ise cenazeyle birlikte kalır.” (Müslim, Zühd: 1; Buhârî, Rıkak: 30) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2380,
			"arabicnumber": 2380,
			"text": "Mıkdam b. Ma’dikerîb (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işittim: “Ademoğlu midesinden daha kötü bir kap doldurmamıştır. Adem oğluna kendisini ayakta tutacak kadar yemesi içmesi yeterlidir. Şayet bu miktardan fazla yiyecek ise midesini üç kısma ayırsın; bir kısmı yemek bir kısmı meşrubat bir kısmı da nefes için ayrılmalıdır.” (İbn Mâce, Etıme: 50)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2381,
			"arabicnumber": 2381,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2382,
			"arabicnumber": 2382,
			"text": "Şüfey el Asbahî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Şüfey Medîne’ye girdiği zaman insanların etrafında toplandığı bir adamla karşılaştı bu adam kimdir? Diye sordu. Bu Ebû Hüreyre’dir dediler. O insanlarla konuşmasını sürdürürken kendisine yaklaşıp yanına oturdum. Konuşmasını bitirip yalnız kaldığında kendisine şöyle dedim: Sana şu ve şunun hakkı için soruyorum Rasûlüllah (sallallahü aleyhi ve sellem)’den işittiğin, anladığın ve bildiğin ve işittiğin bir hadisi bana anlatır mısın? Ebû Hüreyre istediğini yapacağım dedi. Rasûlüllah (sallallahü aleyhi ve sellem)’in bana söylediği anladığım ve öğrendiğim bir hadisi sana anlatacağım. Bunun üzerine Ebû Hüreyre; derin bir şekilde içini çekti biraz bekledi sonra kendine geldi ve şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem)’in bu evde benden ve kendisinden başka kimse yokken bana söylediği bir hadisi sana anlatacağım dedi. Bunun ardından içini tekrar çekti, sonra kendine geldi yüzünü sildi ve yapacağım dedi. Rasûlüllah (sallallahü aleyhi ve sellem)’in bu evde benden ve kendisinden başka kimse yokken bana aktardığı bir hadisi size söyleyeceğim dedi. Sonra Ebû Hüreyre tekrar içini çekti sonra yüzü koyun yere düştü onu uzun bir süre kendime dayadım sonra ayıldı ve şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem), bana anlattı ki; “Kıyamet günü Allah Kulları arasında hüküm vermek için onların yanına inecektir. Bütün toplumlar o gün dizüstü çökmüş durumdadırlar. Allah’ın çağıracağı ilk kimseler Kur’ân-ı bilen ve ezberleyen kişi, Allah yolunda öldürülen kişi ve mal varlığı çok olan kişiler olacaktır. Kur’ân-ı bilene diyecek ki: Rasûlüme indirdiğim kitabısana öğretmedim mi? O kişi de evet ya Rabbi diyecek Allah: Öğrendiğin Kur’ânla nasıl yaşadın neler yaptın? Diyecek. Adam: Gece ve gündüz Kur’ân-ı elimden bırakmadım diye cevap verecek. Bunun üzerine Allah yalan söylüyorsun buyuracak Melekler de yalan söylüyorsun diyecekler. Allah’ta şöyle buyuracak: Sen Kur’ân falan okumadın. Bilakis falan kişi Kur’ân okur, Kur’ân bilir desinler diye okudun ve böyle de denildi. mal mülk sahibi kimse getirilecek ve Allah ona senin rızkını genişletip hiçbir kimseye muhtaç etmeden yaşatmadım mı? Zengin kimse: Evet ya Rabbî diyecek Allah: Sana verdiğim mal mülk ile neler yaptın? Diyecek. Zengin kişi: Yakınlarımı yoklar yoksullara yardım ederek infak ederdim diyecek. Allah’ta yalan söyledin, Melekler de yalan söyledin diyecekler. Allah şöyle buyuracak: Sen söylediğin gibi yapmadın fakat falan kimse cömerttir desinler diye tüm bu dediklerini yaptım neticede oda denildi. Sonra Allah yolunda öldürülen kişi getirilecek Allah ona diyecek ki: Ne uğrunda öldürüldün? O kişi uğrunda cihâd edilmesini emrettin bende cihâd edip şehîd oldum diyecek Allah yalan söylüyorsun meleklerde yalan söylüyorsun diyecekler bunun üzerine Allah: Hayır sen falan kimse ne cesurdur denilmesini istemiştim bu da sana denildi diyecek. Sonra Rasûlüllah (sallallahü aleyhi ve sellem), dizime vurdu ve şöyle dedi: Ey Ebû Hüreyre bu üç kişi kendi konularında Allah’ın yarattığı ilk kimselerdir. Kıyamet günü Cehennem ateşi bunlarla tutuşturulacakdır. Ebû Osman dedi ki: Ukbe b. Müslim’in bana haber verdiğine göre Şüfeyy bizzat kendisi Muaviye’nin yanına girerek bu hadisi ona anlatmıştır. Osman diyor ki: Bana Âla b. ebî Hakîm anlattı kendisi Muaviyenin koruması idi dedi ki: Muaviye’nin yanına bir adam girdi ve bu hadisi ona Ebû Hüreyre’den nakletti. Muaviye bunun üzerine dedi ki: Bunlara böyle yapılırsa geri kalan insanlara ne yapılacak acaba? Dedi ve hüngür hüngür ağladı biz onun hayatını kaybedeceğini sandık ve bu adam bizim başımıza bir felaket getirdi dedik. Sonra Muaviye kendine geldi, yüzünü sildi ve dedi ki: Allah ve Rasûlü daima doğru söz söyler dedi ve Hûd sûresi 15-16. âyetlerini okudu; “Dünya hayatını, onun şaşırtıcı saptırıcı süs ve nimetlerini isteyenlere gelince, onlara bu dünyada yapıp ettiklerinin karşılığını tam olarak ödeyeceğiz ve onlar orada hak ettiklerinden asla yoksun bırakılmayacaklardır. İşte bunlar ahirette paylarına ateşten başka birşey düşmeyen kimselerdir. Çünkü onların bu dünyada yapıp ettikleri, hep boşa gidecektir. Yapıp ettikleri her şeyde anlamsız ve değersizdi zaten.” (Müslim, Imara: 27; Nesâî, Cihâd: 86) Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2383,
			"arabicnumber": 2383,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), şöyle buyurdu: “Üzüntü kuyusundan Allah’a sığının.” Ashab üzüntü kuyusu nedir? Ey Allah’ın Rasûlü dediler. Rasûlüllah (sallallahü aleyhi ve sellem)’de şöyle buyurdu: “Cehennem’de bir vadi olup Cehennem her gün yüzkere ondan Allah’a sığınır.” Bunun üzerine Ashab: Oraya kimler girecektir? Buyurdu ki: gösteriş için okuyup gösteriş için kulluk yapanlar oraya girecektir. (İbn Mâce, Mukaddime: 52) Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2384,
			"arabicnumber": 2384,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir adam Ey Allah’ın Rasûlü! dedi: “Bir kimse bir amel işler ve onu kimse görmesin diye gizli tutar sonradan onu başkalarından öğrenince hoşlanır.” Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “O kimseye iki mükafat vardır; biri amelin gizlediği için gizlilik sevâbı başkalarına örnek olacağı için açıkça yapılma sevâbı.” (İbn Mâce, Zühd: 16) Bu hadis hasen garibtir. ve başkaları Habîb b. ebî Sabit’den ve Ebû Salih’den mürsel olarak rivâyet etmişlerdir. A’meş’in arkadaşları bu rivâyetlerinde Ebû Hüreyre’yi zikretmemişlerdir. Bazı ilim adamları bu hadisin “Sonra onu başkalarından öğrenince hoşuna gider” sözünü şöyle tefsir etmişlerdir: Bu kişinin yaptığı bu gizli amelin insanlar tarafından hayırla anılmasının hoşa gitmesi olduğunu söylemişlerdir. Çünkü Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Sizler; yeryüzünde Allah’ın şâhidlerisiniz” bu yüzden insanların kendisini övmesinden hoşlanır değilse hayır işlediğinin insanlar tarafından bilinip bu yüzden kendisine ikram edilmesi ve kendisine saygı duyulmasından hoşlanıyorsa işte bu gösteriş ve riyadır. Bazı ilim adamları da şöyle demektedirler. O kimsenin gizli olarak yaptığı hayır işini başkasından öğrenir ve bu yaptığı şekilde onlarında amel etmesini ümid ederek bu iş hoşuna giderse bu durumda o kimseye bu şekilde amel edenlerin sevâbı kadar sevâb vardır. Bu da değişik bir görüştür",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2385,
			"arabicnumber": 2385,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyet edilmiştir. Bir adam Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek: Ey Allah’ın Rasûlü kıyamet ne zaman kopacaktır? Diye sordu. Rasûlüllah (sallallahü aleyhi ve sellem), namaza kalktı ve namazını bitirince; “Kıyametin kopmasını soran kimse nerededir? Buyurdu. Adam: Benim Ey Allah’ın Rasûlü dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): “Kıyamet için ne hazırladın?” buyurdu. Adam: “Kıyamet için fazla namaz ve oruç hazırlayamadım fakat ben Allah’ı ve Rasûlünü seviyorum” dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kişi sevdiğiyle beraberdir, sende sevdiğinle beraber olacaksın buyurdu. Müslümanların Müslüman olmaları dışında bu söze sevindikleri kadar başka bir şeye sevindiklerini görmedim.” (Ebû Dâvûd, Edeb: 113; Müslim, Birr: 50) Bu hadis sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2386,
			"arabicnumber": 2386,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kişi sevdiği kimseyle beraberdir. Hayır ve şer kazandığı her şey kişinin kendisinindir.” (Ebû Dâvûd, Edeb: 113; Müslim, Birr: 50) konuda Ali, Abdullah b. Mes’ûd, Safvân b. Assâl, Ebû Hüreyre ve Ebû Mûsâ’dan da hadis rivâyet edilmiştir. Bu hadis, Hasan-ı Basrî’nin, Enes’den rivâyeti olarak hasen garibtir. Bu hadis değişik şekillerde de Peygamber (sallallahü aleyhi ve sellem)’den rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2387,
			"arabicnumber": 2387,
			"text": "Safvân b. Assâl (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Tok sesli bir bedevî geldi ve: “Ya Muhammed! Bir kimse bir toplumu seviyor fakat her yönden onlar gibi olamamıştır, bu kişi ne olacak?” dedi. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kişi sevdiğiyle beraberdir.” (Ebû Dâvûd, Edeb: 113; Müslim, Birr: 50) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2388,
			"arabicnumber": 2388,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah şöyle buyuruyor: Ben kulumun bana ait tahmininin yanındayım bana dua ettiğinde onunla beraberim.” (İbn Mâce, Edeb: 53) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2389,
			"arabicnumber": 2389,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2390,
			"arabicnumber": 2390,
			"text": "Muâz b. Cebel (radıyallahü anh)’den Rasûlüllah (sallallahü aleyhi ve sellem)’den şöyle işitmiştir: Allah buyurdu ki: “Benim büyüklüğüm için birbirini sevenlere nurdan minberler vardır. Peygamberler ve şehîdler onlara imreneceklerdir.” (Müsned: 2121) konuda Ebû’d Derdâ’dan, İbn Mes’ûd’dan, Ubâde b. Sâmit’den, Ebû Hüreyre’den ve Ebû Mâlik el Eş’arî’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Ebû Müslüm el Havlanî’nin ismi, Abdullah b. Seveb’tır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2391,
			"arabicnumber": 2391,
			"text": "Ebû Hüreyre ve Ebû Saîd (radıyallahü anhüma)'dan rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Allah kendi gölgesinden başka gölge bulunmadığı bir günde yedi kişiyi kendi gölgesinde gölgelendirecektir; Adaletli devlet başkanı, Allah’a ibadetle yetişip büyüyen genç, Mescidden çıktığında tekrar döneceği saate kadar kalbi mescide bağlı olan kişi, Allah için birbirini seven bu sevgiyle bir araya gelip bu sevgiyle ayrılan iki kişi, kendi başına olduğu halde Allah’ı zikrederek gözünden yaşlar akıtan kimse, Güzel ve soylu bir kadının kendisini çağırması üzerine; ben, Allah’tan korkarım diyerek o kadına yaklaşmayan kişi, Sadaka veren verdiği sadakada sağ elinin verdiğini sol eli bilmeyecek kadar gizli davranan kişi.” (Müslim, Zekât: 30; Nesâî, Kudât: 1) Bu hadis hasen sahihtir. Bu hadis başka şekillerde Mâlik b. Enes’den de rivâyet edilmiştir. Mâlik, hadisin senedinde şüphe ederek, Ebû Hüreyre veya Ebû Saîd’den demektedir. Ubeydullah b. Ömer ise bu hadisi Habib b. Abdurrahman’dan rivâyet etmiş ve senedinde şüphe etmeksizin “Ebû Hüreyre’den” dememiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2392,
			"arabicnumber": 2392,
			"text": "Eğer biriniz bir kardeşini Allah için severse, ona bildirsin",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2393,
			"arabicnumber": 2393,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), haksız yere övücülerin ağızlarına toprak saçmamızı bize emretti.” (Tirmizî rivâyet etmiştir.) Ebû Hüreyre hadisi olarak bu hadis garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2394,
			"arabicnumber": 2394,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah bir kulu hakkında şer ve kötülük dilerse günahının yüzünden çekeceği cezayı ondan erteler ki kıyamet günü Allah’ın huzuruna karşılığını göreceği o günahlarıyla gelsin.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2395,
			"arabicnumber": 2395,
			"text": "Aynı sened ile Rasûlüllah (sallallahü aleyhi ve sellem)’den şöyle de gelmiştir: “Mükafatın büyüklüğü belanın büyüklüğüne bağlıdır. Allah bir toplumu severek onları değişik belalarla imtihan eder. Kim razı olursa Allah’ın rızasını kazanır. Kim de kızar kırgınlık gösterirse Allah’ta o kimseye kızar.” (İbn Mâce, Fiten: 23) Bu hadis bu şekliyle hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2396,
			"arabicnumber": 2396,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2397,
			"arabicnumber": 2397,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2398,
			"arabicnumber": 2398,
			"text": "Sa’d (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’e sordum insanların hangisinin belasının ağır olduğunu, buyurdular ki: “Peygamberler, onların peşinden yaşantı olarak Peygambere yakın olanlar sonra onlara yakın olanlar. Kişi dindarlığı oranında belayı uğratılır. Dininde sağlam ise belası ağırlaştırılır. Dininde gevşek ise dindarlığı oranında belaya uğratılır. Bela, kulun peşini bırakmaz, sonunda kul uğradığı belalarla üzerinde günah kalmayıncaya kadar günahlarından temizlenmiş olur.” (İbn Mâce, Fiten: 23) Bu hadis hasen sahihtir. Bu konuda Ebû Hüreyre ve Huzeyfe b. Yemân’ın kız kardeşi tarafından da şu şekilde bir rivâyet vardır: “Peygamber (sallallahü aleyhi ve sellem)’e hangi insanların belası daha ağırdır diye soruldu. Buyurdular ki: Peygamber (sallallahü aleyhi ve sellem), sonra yaşantı ve inançla ona yakın olanlar sonra onlara yakın olanlar.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2399,
			"arabicnumber": 2399,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Mümin erkek ve mümin kadınların başına Allah’a kavuşacağı güne kadar ya kendisinde ya çocuğunda veya malında mutlaka sıkıntı gelmeye devam eder.” (Müsned: 7521) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2400,
			"arabicnumber": 2400,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), şöyle buyurmuştur: Allah buyurdu ki: “Dünyada kulumun iki kıymetli organı olan gözünü alırsam benim yanımda onun karşılığı ancak Cennettir.” (Dârimî, Rıkak: 76) Bu konuda Ebû Hüreyre’den ve Zeyd b. Erkâm’dan da hadis rivâyet edilmiştir. Bu hadis bu şekliyle hasen garibtir. Ebû Zılâl’in ismi Hilâl’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2401,
			"arabicnumber": 2401,
			"text": "Ebû Hüreyre (radıyallahü anh)’den merfu olarak şöyle rivâyet edilmiştir: Allah şöyle buyurur: “Her kimin iki sevimli organını giderirsem o da sabredip mükafatını benden beklerse ona Cennet’ten başka bir karşılığa razı olmam.” (Dârimî, Rıkak: 76) konuda Irbad b. Sariye’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2402,
			"arabicnumber": 2402,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Kıyamet günü başlarına bela ve sıkıntı gelenlere sevap verileceği zaman dünyada sıkıntı çekmeyenler o gün derilerinin keskin aletlerle kesilip parçalanmasını isteyecekler.” (Tirmizî rivâyet etmiştir.) hadis garibtir. Sadece bu senedle ve bu şekilde bilmekteyiz. Bazıları bu hadisi A’meş’den, Talha b. Mûsârrif’den ve Mesrûk’tan benzeri şekilde rivâyet etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2403,
			"arabicnumber": 2403,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Her ölen mutlaka pişmanlık duyacaktır. Ashab: Neden pişmanlık duyacak? Dediler. Şöyle buyurdu: “İyilik eden kimse iyiliğini artırmamış olduğuna, kötülük eden kişiler ise kötülüklerden vazgeçmemiş olduğuna pişman olacaktır.” (Tirmizî rivâyet etmiştir.) Bu hadis sadece bu şekliyle bilmekteyiz. Şu’be, Yahya b. Ubeydullah hakkında söz etmiştir. Bu kimsenin meşhur ismi Yahya b. Ubeydullah b. Mevhib el Medenî’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2404,
			"arabicnumber": 2404,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ahir zamanda bazı kimseler çıkacak ve dini dünyaya alet edecekler insanlara yumuşak görünmek için kuzu derilerine bürünecekler ve dilleri şekerden tatlı, fakat kalpleri kurt kalbidir. Allah şöyle buyurur: Benim affıma mı güvenip gururlanıyorsunuz, benim rahmetime mi güvenip cesaretli davranıyorsunuz şanıma yemin ederim ki onlara kendimden bir imtihan vesilesi göndereceğim yumuşak huylu olanlar bile şaşkına çevrilecektir.” (Tirmizî rivâyet etmiştir.) konuda İbn Ömer’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2405,
			"arabicnumber": 2405,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Allah (celle celalüh) şöyle buyurdu: Öyle kimseler yarattım ki dilleri baldan tatlı kalpleri ise sabır ağacından daha acıdır. Kendi adıma yemin ederim ki onları öyle bir fitneye uğratacağım ki içlerinden yumuşak huylu olanları bile şaşkına çevirecektir. Benim affıma mı güveniyor ve rahmetimi umarak mı bana karşı cesaretli davranıyorsunuz?” (Tirmizî rivâyet etmiştir.) Bu hadis İbn Ömer rivâyeti olarak hasen garibtir. Bu hadisi sadece bu şekliyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2406,
			"arabicnumber": 2406,
			"text": "Ukbe b. Âmir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’e kurtuluş nedir? Diye sordum. Buyurdular ki: “Diline sahip ol; evin başına dar gelmesin, günahlarından dolayı ağla.” (Tirmizî rivâyet etmiştir.) Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2407,
			"arabicnumber": 2407,
			"text": "Ebû Saîd el Hudrî (radıyallahü anh)’den merfu olarak rivâyet edildiğine göre, şöyle demiştir: “Sabah olduğu zaman bütün organlar dile yalvararak şöyle derler: Bizim için Allah’a karşı sorumluluk bilinci duy biz seninle ayaktayız sen doğru olursan bizde doğru oluruz sen eğilirsen bizde eğiliriz.” (Müsned: 11472)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2408,
			"arabicnumber": 2408,
			"text": "Sehl b. Sa’d (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kim iki çenesi arasındaki ile iki bacağı arasındakini kötü yolda kullanmamayı tekeffül ederse ben de ona Cenneti tekeffül ederim.” (Buhârî, Rıkak: 23) konuda Ebû Hüreyre ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Sehl hadisi hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2409,
			"arabicnumber": 2409,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah her kimi iki çenesi arasındakinin şerri ile iki bacağı arasındakinin şerrinden korursa, Cennete girer.” (Tirmizî rivâyet etmiştir.) Ebû Hüreyre (radıyallahü anh)’den hadis rivâyet eden Ebû Hazim’in ismi; Eşcaiyye’li Azze’nin azâdlı kölesi Selman’dır ve Küfelidir. Sehil b. Sa’d’den rivâyet eden Ebû Hâzim ise Zahid olup Medînelidir. İsmi; Seleme b. Dinar’dır. Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2410,
			"arabicnumber": 2410,
			"text": "Sûfyân b. Abdullah es Sekafî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Ey Allah’ın Rasûlü! Bana bir iş söyle ona sımsıkı sarılayım” dedim. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Rabbim Allah’tır de sonra dosdoğru ol.” Sûfyân diyor ki: “Ey Allah’ın Rasûlü! Benim için en korkulacak şey nedir?” dedim. Rasûlüllah (sallallahü aleyhi ve sellem): Kendi dilini tutarak, “İşte bu” buyurdular. (Müslim, İman: 55; İbn Mâce, Fiten: 62) Bu hadis hasen sahihtir. hadis Sûfyân b. Abdullah es Sekafî’den değişik şekillerde rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2411,
			"arabicnumber": 2411,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Allah anılmaksızın sözü uzatma zira Allah anılmaksızın sözün uzatılması kalplerin katılaşmasına sebeptir. İnsanların Allah’tan en uzak olanı katı kalpli kimselerdir.” (Tirmizî rivâyet etmiştir)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2412,
			"arabicnumber": 2412,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2413,
			"arabicnumber": 2413,
			"text": "Ebû Cuhayfe (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Rasûlüllah, Selman ile Ebû’d Derdâ arasında kardeşlik kurdu, Selman Ebû’d Derdâ’yı ziyaret etti ve karısı Ümmü’d Derdâ’yı perişan bir durumda gördü, Selman neden böylesin diye sordu. Kadın: kardeşin Ebû’d Derdâ’nın dünyadan hiçbir arzusu kalmamıştır diye cevap verdi. Kadın diyor ki: Ebû’d Derdâ gelince misafirine yemek hazırlayıp önüne koydu ve siz yiyiniz ben oruçluyum dedi. Selman: Sen yemedikçe ben de yemem dedi. Bu sefer o da yedi. Gece olunca Ebû’d Derdâ namaz için kalkmak istedi fakat Selman ona yat dedi, o da yattı bir süre sonra yine kalkıp namaz kılmak istedi yine Selman ona yat dedi o da yattı. Sabah namazının vakti girince Selman ona şimdi kalk dedi. İkisi de kalkıp namazlarını kıldılar. Sonra Selman şöyle dedi: Kendinin kendinde hakkı vardır, Rabbinin hakkı vardır, misafirinin hakkı vardır, ailenin hakkı vardır. Her hak sahibine hakkını ver. Sonradan Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek durumu ona anlattılar da Rasûlüllah (sallallahü aleyhi ve sellem) Selman doğru söylemiş ve doğru yapmıştır dedi.” (Buhârî, Savm: 50) Bu hadis sahihtir. Ebû’l Umeys’in ismi Utbe b. Abdullah’tır. Abdurrahman b. Abdullah el Mes’ûdî’nin kardeşidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2414,
			"arabicnumber": 2414,
			"text": "Medîneli bir kimse (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Muaviye Âişe (radıyallahü anha)’ya bana tavsiyelerde bulunacağın bir mektup yaz fakat bana fazla zorluk çıkarma dedi. Âişe (radıyallahü anha), Muaviye’ye şöyle yazdı: Selam sana olsun bundan sonra şunu söyleyeceğim Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim şöyle buyuruyordu: “Her kim insanlar gücense bile Allah’ın rızasını isterse Allah o kimseyi insanların sıkıntısından kurtarır. ve her kim de Allah’ın gücenmesine karşılık insanların hoşnut etmeye çalışırsa Allah’ta o kimseyi insanlara havale eder. Selam sana olsun…” (Tirmizî rivâyet etmiştir)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 112
			}
		}
	]
}