{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"39": "The Book on the Description of Hellfire"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “O kıyamet günü Cehennem getirilecek ve onun yetmiş bin bağı olacak ve herbir bağı ile beraber o bağdan çeken yetmiş bin melek olacaktır.” (Müslim, Cennet: 17) diyor ki: Sevrî bu hadisi merfu olmaksızın rivâyet ediyor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Kıyamet günü Cehennem’den bir gurup yaratık çıkacaktır ki onun gören iki gözü işiten iki kulağı ve konuşan bir dili olacaktır ve şöyle diyecektir: Ben üç kişiye vekil tayin edildim, her inatçı zorbaya, Allah ile birlikte başkalarına ilahlık yakıştıranlara, resim ve heykel yapanlara.” (Müsned: 8076) konuda Ebû Saîd (radıyallahü anh)’den de hadis rivâyet edilmiştir. Bu hadis hasen garib sahihtir. A’meş’den, Atıyye’den, Ebû Saîd’den bu hadisin bir benzerini rivâyet etmişlerdir. Eş’as b. Sevvar, Atıyye’den ve Ebû Saîd el Hudrî’den bir benzerini rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "Hasan (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Utbe b. Gazvan şu minberimizin Basra minberinin üzerinde Rasûlüllah (sallallahü aleyhi ve sellem)’den şöyle buyurduğunu anlattı: “Büyük bir kaya Cehennemin kenarından aşağıya bırakılır Cehenneme yetmiş sene iniş yapar da yine dibine varamaz.” Utbe sözüne şöyle devam etti: “Ömer şöyle derdi: Cehennemi çok hatırlayın onun sıcaklığı çok şiddetli, dibi derin kamçı ve balyozları da demirdendir.” (Müslim, Zühd: 17) Hasan’ın Utbe b. Gazvan’dan hadis işittiğini bilmiyoruz. Utbe b. Gazban Ömer zamanında Basra’ya geldi, Hasan ise Ömer’in halifeliğinin sona ermesine iki yıl kala dünyaya gelmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"text": "Ebû Saîd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Saûd, ateşten bir dağdır, kafir bu dağda ebedî olarak yetmiş yıl çıkıp yetmiş yıl iniş yapacaktır.” (Müsned: 11287) Bu hadis garib olup merfu olarak sadece İbn Lehia’nın bu rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Cehenneme düşen kafirin derisinin kalınlığı kırk iki arşın olacak, azı dişi ise Uhud dağı kadar olup Cehennem’deki kapladığı yeri ise Mekke ile Medîne arası kadardır. (Müslim, Cennet: 27) hadisi hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kıyamet günü kafirin azı dişi Uhud dağı kadar uyluğu Beyda kadar Cehennem’deki oturma yeri Rebze gibi üç gecelik mesafe kadardır.” (Müslim, Cennet: 27) Bu hadis hasen garibtir. gibi sözünden Medîne ile Rebze arası kadarlık mesafe kastedilmektedir. “Beyda” Uhud dağı büyüklüğünde bir dağdır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "Ebû Hüreyre (radıyallahü anh)’den merfu olarak rivâyet edildiğine göre: “Kafirin azı dişi Uhud dağı kadardır.” (Müslim, Cennet: 27) Bu hadis hasendir. Ebû Hazım; Eşcaî denilen zattır. İsmi Selman olup Azze el Eşcaiyye’nin azatlı kölesidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kafir dilini bir veya iki fersah yerden sürükleyerek ve insanlarda onu ayaklarıyla çiğneyeceklerdir.” (Müsned: 5413) Bu hadis garibtir. Bu hadisi sadece bu şekliyle bilmekteyiz. Fadl b. Yezîd Küfelidir. Pek çok imam kendisinden hadis rivâyet etmiştir. Ebû’l Muhârik ise tanınmış bir kimse değildir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "Ebû Saîd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), Kehf sûresi 29. ayette geçen “Mühl gibi” ayeti hakkında şöyle buyurdu: Yağın tortusu gibi onu yüzüne yaklaştırdığı zaman yüzünün derisi içine düşecektir.” (Kehf 29. âyet… Şüphesiz biz kafirlere öyle bir ateş hazırladık ki etrafındaki alev duvarlar onları çepeçevre kuşatır. Susayıp su istedikleri zaman kaynamış katran gibi bir su ikram edilirde bu su yüzlerini bile kavurur gider…) (Müsned: 11244) Bu hadisi sadece Rişdîn b. Sa’dın rivâyetiyle bilmekteyiz. Rişdîn b. Saîd ise hakkında ileri geri konuşulan bir kimsedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Cehennemliklerin başlarından aşağı hamîm dökülecektir. Hamîm içine işleyecek ve karın boşluğuna varacak karın boşluğunda ne varsa hepsini silip süpürecek ve ayaklarından çıkacaktır. İşte Sahr budur sonra eski haline tekrar dönecek ve bu işlem böylece devam edip gidecektir.” (Hac sûresi 20. ayetin tefsiridir. “Bu dökülen kaynar su ile karınları içindeki organlar ve derileri eritilecektir.”) (Müsned: 8509) b. Yezîd, Ebû Şüca’ diye künyelenir ve Mısırlıdır. Kendisinden Leys b. Sa’d hadis rivâyet etmiştir. Bu hadis hasen sahih garibtir. İbn Huceyre ise Abdurrahman b. Huceyre el Mısrî’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), İbrahim sûresi 16. 17. âyetleri olan: “Önünde Cehennem var orada kendisine kanlı irinli su içirilecek…” Onu yudum yudum içer fakat boğazında kalır yutamaz her taraftan ölüm gibi felaketler sarar fakat yine ölmez…” ayeti hakkında şöyle buyurdu: “Ağzına yaklaştırılacak ve ondan tiksinecektir. Kendisini yaklaştırıldığında yüzünü yakıp kavuracak ve başının derisi düşecektir. Onu içtiği zaman bağırsakları kopup dübüründen çıkacaktır. Allah; Muhammed sûresi âyet 15 de şöyle buyurur: “… Kaynar sudan içirilecek ve bağırsakları parça parça olacak…” Yine Allah Kehf sûresi 29. ayetinde de; “... Susayıp su istedikleri zaman kaynamış katran gibi bir su ikram edilir de bu su yüzlerini bile kavurur gider. Ne kötü bir içecek ne kötü bir barınaktır orası.” (Müsned: 21254) Bu hadis garibtir. b. İsmail “Böylece Ubeydullah b. Büsr’den” demektedir. Ubeydullah b. Büsr sadece bu hadisle bilinmektedir. b. Amr Rasûlüllah (sallallahü aleyhi ve sellem)’in sahabesi Abdullah b. Büsr’den başka bir hadis rivâyet etmiştir. Abdullah b. Büsr’ün, Peygamber (sallallahü aleyhi ve sellem)’den hadis işiten bir kardeşi ve birde kız kardeşi vardır. Safvân b. Amr’ın kendisinden Ebû Umâme’nin hadisini rivâyet ettiği Ubeydullah b. Büsr ise onun arkadaşı değil başka birisi olabilir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), Alî-İmrân 102. ayeti olan “Ey iman edenler mutlaka yolunuzu Allah’ın kitabıyla bulmaya çalışın ve Müslüman olarak can verin” ayetini okudu ve şöyle buyurdu: “Cehennemliklerin yiyeceği olan zakkum’dan bir damla dünya yurduna damlatılmış olsaydı dünya halkının geçimini bozardı. Yiyeceği zakkum olan kişi ne yapacak...” (İbn Mâce, Zühd: 27) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "Ebû’d Derdâ (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Cehennemlik olanlara azâblarına eşit biçimde açlık verilir de doyurulmaları için yardım isterler, kendilerine “Dari`” denilen acı ve kuru dikenler ikram edilecektir o dikenler ne besler ne de açlığı giderir. (88 Gaşiye sûresi 6-7) sonra yine doyurulmalarını isterler de kendilerine boğazdan geçmeyen dikenli yemekler ikram edilir (73 Müzzemmil: 13) Dünyada boğaza duran yiyecekleri içecekle geçirdiklerini hatırlayarak kendilerine içecek yardımı yapılmasını isterlerde kendilerine demir çengelli kaynar sular ikram edilir onlar yüzlerine yaklaştığında yüzlerini yakar ve kavurur. Karınlarına girdiği zaman karınlarında bulunan her şeyi parçalar bu arada Cehennem bekçilerini çağırın derler. Cehennem bekçileri şöyle derler: Elçilerimiz size apaçık delillerle gelmiş değiller miydi? Onlar da evet diyecekler ve Cehennem bekçileri: Yalvarın bakalım! Allah’tan gelen gerçekleri inkar edenlerin yalvarması boşunadır.” (40 Mü’min 50) kafirler Mâlik’i çağırın deyip, “Ey Mâlik, Rabbin hükmünü verip işimizi bitiriversin böyle yapmaktansa ölüp kül ve kömür olmak iyidir” diyecekler. Mâlik te cevap verip şöyle diyecek: “Hayır siz burada ölmeden bu şekilde ebedi kalacaksınız.” (43 Zuhruf: 77) diyor ki: Bize bildirdiğine göre kafirlerin çağırması ile Mâlik’in onlara cevap vermesi arasında bin yıl geçecektir. (sallallahü aleyhi ve sellem) sözünü şöyle sürdürdü: Sonra kafirler, Rabbinize dua edin çünkü Rabbinizden başka rahmeti bol bir kimse yoktur derler ve şu duayı yaparlar: “Ey Rabbimiz bize kötülüklerimiz üstün geldi de bu yüzden yoldan çıkan kimseler olduk Ey Rabbimiz bizi bu Cehennem’den çıkar eğer tekrar işlediğimiz günahlara dönersek o zaman gerçekten zâlimlerden olmuş oluruz.” (23 Müminûn 106-109) “Allah ta onlara Alçaldıkça alçalın yıkılıp kalın orada susun konuşmayın benimle” (23/108) diyecektir. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle devam etti: Her kurtuluş çaresinden ümidlerini kesecekler işte o zaman bağrışıp çağrışmaya pişmanlığa ve yazıklar olsun bize demeye başlayacaklardır.” (Tirmizî rivâyet etmiştir.) b. Abdurrahman diyor ki: Hadisçiler bu hadisi merfu olarak rivâyet etmiyorlar. Bu hadis A’meş’den, Şimr b. Atıyye’den, Şehr b. Havşeb’den, Ümmü Derdâ’dan ve Ebû’d Derdâ’dan kendi sözü olarak rivâyet edildiğini bilmekteyiz dolayısıyla merfu değildir. b. Abdulaziz hadisçiler yanında güvenilir bir kişidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "Ebû Saîd el Hudrî (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), 23 Müminün sûresi 104. ayetini “Ateş onların yüzlerini yalayarak yakar da ateşin içinde yüz etleri sıyrılmış olarak sırıtan dişleriyle kalıverirler.” Şöyle tefsir etmiştir: “Ateşin yüz şeklini değiştirmesidir. Şöyle ki üst dudağı başının ortasına varacak kadar kasılacak alt dudağı ise göbeğine kadar inecektir.” (Müsned: 11409) Bu hadis hasen sahih garibtir. Heysem’in ismi Süleyman b. Amr b. Abdulutvârî’dir. Yetim olduğu için Ebû Saîd’in yanında kalmıştır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "Abdullah b. Amr b. As (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Eğer kafatası kadar bir parça gökten yeryüzüne gönderilse –ki aradaki mesafe beş yüz seneliktir- geceden önce yeryüzüne varır eğer o parça bir zincirin başına bağlanmış olsaydı köküne veya dibine varmadan geceli gündüzlü kırk yıl yoluna devam ederdi.” (69 Hakka Sûresi 30-32. âyetlerini tefsir ediyor) (Müsned: 6561) Bu hadisin isnadı hasen sahihtir. b. Yezîd Mısırlıdır. Pek çok ilim adamı ve Leys b. Sa’d kendisinden hadis rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre; Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Sizin şu yakmakta olduğunuz ateş ki Cehennem sıcaklığının yetmiş parçasından bir parçadır. Bunun üzerine Ashab: Vallahi Cehennem ateşi dünya ateşi kadar bile olsa azab için kafi gelirdi. Ey Allah’ın Rasûlü! Dediler. Cehennem ateşi dünya ateşlerinden altmış dokuz kat fazlalaştırılmıştır. Her bir katın derecesi buradaki ateş kadardır.” (Buhârî, Bed-il Halk: 27; Müslim: Cennet: 17) Bu hadis hasen sahihtir. Hemmâm b. Münebbih, Vehb b. Münebbih’in kardeşidir. Kendisinden Vehb hadis rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "Ebû Saîd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Sizin şu ateşiniz Cehennem ateşinin yetmiş parçasından bir parçadır. Bunlardan her bir parça dünya ateşine denktir.” (Tirmizî rivâyet etmiştir.) Ebû Saîd hadisi hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Cehennem bir kısım bir kısmımı yiyip bitiriyor diye Allah’a şikayette bulundu. Allah’ta ona iki sefer nefes almasını takdir etti. Kışın bir nefes, yazın bir nefes; kışın aldığı nefesten dolayı soğuklar ve zemheri meydana geldi. Yazın aldığı nefesten dolayı baskın sıcaklar ve sâm yeli ortaya çıktı.” (Müslim, Mesacid: 27; İbn Mâce: Zühd: 17) Bu hadis sahihtir. Ebû Hüreyre’den değişik şekilde de rivâyet edilmiştir. Mufaddal b. Salih hadisçilere göre hafız değildir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Allah herhangi bir günde beni anan veya herhangi bir yerde benden korkanları Cehennem’den çıkarınız buyuracaktır.” (Tirmizî rivâyet etmiştir.) Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyete göre; Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Cehennemliklerden çıkışı son olan kimseyi biliyorum. Bir kimse ki Cehennem’den sürünerek çıkacak ve şöyle diyecek: Ey Rabbim Cennet’teki tüm yerleri insanlar kapıp yerleştiler. Ona şöyle denilecek git ve Cennete gir. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle devam etti: O kimse de Cennete girmek için gider bütün yerlerin insanlar tarafından işgal edildiğini görerek geri döner ve Ey Rabbim der insanlar tüm yerleri doldurmuşlar. Peygamberimiz şöyle devam etti: Ona denilecek ki eskiden içinde bulunduğun durumu hatırlıyor musun? O da evet diyecek sonra kendisine ne dilersen dile denilecek. O da bir şeyler isteyecek ve kendisine dilediğin şey ve dünyanın on katı senindir denilecek. Bunun üzerine O adam sen her şeyin hükümranı olduğun halde benimle şaka mı ediyorsun diyecek İbn Mes’ûd dedi ki: Bu arada Rasûlüllah (sallallahü aleyhi ve sellem)’in azı dişleri görünecek derecede güldüğünü gördüm.” (Buhârî, Rıkak: 27; Müslim, İman: 17) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "Ebû Zerr (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Cehennemlik olanlardan ateşten en son çıkacak ve Cennete en son girecek kimseyi iyi biliyorum. Bir adam getirilecek ve Allah, ona küçük günahlarını sorunuz büyük günahlarını gizli tutunuz buyuracaktır. Bunun üzerine kendisine falan günde şöyle filan günde böyle yaptın denilecek. Rasûlüllah (sallallahü aleyhi ve sellem) sözüne şöyle devam etti: Kendisine şöyle denilecek senin her günahının yerine sana bir sevap verilecektir. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle dedi. Bunun üzerine O kimse Ya Rabbi! Bir takım günahlar işlemiştim fakat onları burada göremiyorum... Ebû Zerr dedi ki: Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem)’i azı dişleri görünecek kadar güldüğünü gördüm.” (Müslim, İman: 17) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Tevhid inancına sahip fakat günahkar olanlar Cehennem’de azâb görecekler ve kömür gibi olacaklardır. Sonra kendilerine rahmet ulaşacak Cehennem’den çıkarılacak Cennetin kapıları önüne atılacaktır. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle devam etti: Cennetlikler onlar üzerine su serpeceklerdir. Sel birikintisinde çalı çırpının bitmesi gibi onlar da yeniden hayata geçecekler ve Cennete gireceklerdir.”(Müsned: 14665) Bu hadis hasen sahihtir. Bu hadis değişik bir şekilde Câbir’den de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "Ebû Saîd el Hudrî (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Kalbinde zerre kadar imanı olan kişi Cehennem’den çıkacaktır. Ebû Saîd şöyle dedi: Kim bunun doğruluğunda şüphe ederse şu ayeti okusun: “Allah, kimseye zerre kadar haksızlık etmez.” (4 Nisa: 40) (Müsned: 10655) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Cehenneme girenlerin iki kişinin çığlıkları şiddetli olacak ve Allah onları çıkarın buyuracaktır. Çıkarıldıklarında neden çığlıklarınız şiddetli oldu diye soracaktır. O ikisi de bize acıyasın diye böyle yaptık diyecekler. Allah’ta: Benim size rahmetim kendinizi Cehennem’deki olduğunuz yere atmanızdır buyuracak. Bunun üzerine gidecekler onlardan biri kendini atacak fakat cenabı hak ateşi ona soğuk ve selamet kılacaktır. Öbürü ise dikilecek ve kendisini atmayacaktır. Bunun üzerine Allah ona Arkadaşının attığı gibi senin de kendini ateşe atmana engel olan nedir? Buyuracak o kimse de Ya rabbi diyecek beni çıkardıktan sonra tekrar oraya atmamanı senden bekliyorum. Bunun üzerine Allah: Sende umduğuna erişeceksin diyecek ve her ikisi de Allah’ın Rahmetiyle Cennete girecektir.” (Tirmizî rivâyet etmiştir.) Bu hadisin senedi zayıftır, çünkü Rişdîn b. Sa’d’tan rivâyet edilmektedir. Rişdîn b. Sa’d’ın İbn Nu’m’dan rivâyeti hadisçiler yanında zayıftır. İbn Nu’m el Ifrikî’dir. İfrîkî’de hadisçiler yanında zayıftır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "Imrân b. Husayn (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ümmetimden bir gurup benim şefaatimle Cehennem’den çıkarılacaklardır. Kendilerine Cehennemlikler adı verilecektir.” (Buhârî, Rıkak: 17; İbn Mâce, Zühd: 27) Bu hadis hasen sahihtir. Reca el Utaridî’nin ismi Imrân b. Teym’dir. İbn Milhan adı da verilir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Cehennemden kaçıp, ona karşı tedbir almayıp uyuyan; veya cenneti isteyip cennetlik ameller yapmamak suretiyle uyuyan kimseler gibisini görmedim.” (Tirmizî rivâyet etmiştir.) Bu hadisi sadece Yahya b. Ubeydullah’ın rivâyetiyle bilmekteyiz. Yahya b. Ubeydullah hadisçiler yanında zayıftır. Şu’be onun hakkında söz etmiştir. Yahya b. Ubeydullah’ın adı İbn Mevhib olup Medînelidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Cennete baktım Cennetin çoğunluğunun fakirler olduğunu gördüm Cehenneme baktım çoğunluğunun kadınlar olduğunu gördüm.” (Müslim, Zikir ve Dua: 17)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "Imrân b. Husayn (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Cehenneme baktım içerisindekilerin çoğunluğunu kadınlar olarak gördüm. Cennete baktım Cennetin çoğunluğunu fakirler olarak gördüm.” (Müsned: 19008) Bu hadis hasen sahihtir. burada olduğu Ebû Reca’dan, Imrân b. Husayn’dan diyor. Eyyûb ise Ebû Reca’dan ve İbn Abbâs’tan demektedir. Her iki senede de diyecek yoktur. Ebû Reca’nın her ikisinden de (yani İbn Abbâs ve Imrân b. Husayn) dan da hadis işittiği muhtemeldir. Avf’tan başkası bu hadisi Ebû Reca vasıtasıyla Imrân b. Husayn’dan rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "Numân b. Beşîr (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Cehennemliklerin azabı en hafif olanı iki ayağının altında ateş közü bulunan ve bunlarla beyni kaynayan kişidir.” (Buhârî, Rıkak: 17; Müslim, İman: 27) Bu hadis hasen sahihtir. konuda Ebû Hüreyre, Abbâs b. Abdulmuttalib ve Ebû Saîd ve Ebû Hüreyre’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "Hârise b. Vehb el Huzaî (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Dikkat edin size Cennet ehlini haber vereceğim her güçsüz ve zayıf görülen insan ki Allah’a karşı yemin etse Allah, onun yeminini yerine getirir. Dikkat edin size Cehennemlikleri haber vereyim; her kaba, bencil ve büyüklük taslayan kişi.” (Müslim, Cennet: 13) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 19
			}
		}
	]
}