{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"46": "Chapters on Recitation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2927,
			"arabicnumber": 2927,
			"text": "Ümmü Seleme (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Kur’ân okurken âyetler arasını keser ve dururdu. Yani şöyle okurdu: “Elhamdi lillahi rabbil alemîn” der sonra durur “Errahmanir rahim” der sonra tekrar durur şu ayeti de: “Meliki yevmiddin” diye okurdu.” (Ebû Dâvûd, Huruf ve Kıraat: 27) Bu hadis garibtir. Ebû Ubeyde bu okuyuş seklini benimser ve “Maliki” diye değil “Meliki” diye okurdu. b. Saîd el Emevî ve başkaları bu hadisi bu şekilde İbn Cüreyc’den, İbn ebî Müleyke’den ve Ümmü Seleme’den rivâyet etmişlerdir. Bu hadisin senedi muttasıl değildir. Çünkü Leys b. Sa’d bu hadisi İbn ebî Müleyke’den, Ya’la b. Memlek’den ve Ümmü Seleme’den rivâyet etmişlerdir. Leys’in hadisi daha sağlamdır. hadisinde “meliki yevmiddin şeklinde okurudu.” Bölümü yoktur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2928,
			"arabicnumber": 2928,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2929,
			"arabicnumber": 2929,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2930,
			"arabicnumber": 2930,
			"text": "Muâz b. Cebel (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem), Maide sûresi âyet 112’yi “Hel testetiu Rabbeke” diye okumuştur. (Tirmizî rivâyet etmiştir.) Bu hadis garibtir. Bu hadisi sadece Rişdî’in rivâyetiyle bilmekteyiz. Bu hadisin senedi pek sağlam değildir. Rişdîn b. Sa’d ve el Afrikî hadiste zayıf kabul edilen iki kişidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2931,
			"arabicnumber": 2931,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2932,
			"arabicnumber": 2932,
			"text": "Übey b. Ka’b (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), Kehf sûresi 76. ayetini şeddeli olarak “Kad bellağtü min ledünnî uzran” diye okudu. (Ebû Dâvûd, Huruf ve Kıraat: 27) Bu hadis garibtir. Bu hadisi sadece bu şekliyle bilmekteyiz. Ümeyye b. Hâlid güvenilen bir kimsedir. Ebû’l cariye el Abdî mechul bir ihtiyar olup adını bilmiyoruz",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2933,
			"arabicnumber": 2933,
			"text": "Übey b. Ka’b (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem), Kehf sûresi 86. ayetini “Fî aynin hamietin” diye okudu. (Ebû Dâvûd, Huruf ve Kıraat: 27) Bu hadis garibtir. Ancak bu şekliyle bilmekteyiz. Sahih olan rivâyet bu okuyuşun İbn Abbâs’ın okuyuşu olduğudur. İbn Abbâs ve Amr b. As’ın bu ayetin okunuşunda ihtilaf ettikleri ve bu konuda Ka’b’ul Ahbara müracatta bulundukları rivâyet edilmiştir. İbn Abbâs’ın yanında Peygamber (sallallahü aleyhi ve sellem)’den bu konuda bir rivâyet olsaydı o rivâyetle yetinir ve meseleyi Ka’b’a götürmezlerdi",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "Abd b. Humeyd, Yezîd b. Harun vasıtasıyla Fudeyl b. Merzuk’tan, Atıyye’den, İbn Ömer’den bu hadisin bir benzerini bize aktarmıştır. hadis hasen garibtir. Bu hadisi sadece Fudeyl b. Mersuk’un rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Matn"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2935,
			"arabicnumber": 2935,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2936,
			"arabicnumber": 2936,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), Vakıa sûresi 89. ayetini “Fe ravhun ve Rayhanûn ve Cennete nîm” diye okurdu. (Ebû Dâvûd, Huruf ve Kıraat: 27) Bu hadis hasen garibtir. Bu hadisi sadece Harun el A’ver’in rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2937,
			"arabicnumber": 2937,
			"text": "Alkame (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Şam’a gelmiştik, Ebû’d Derdâ yanımıza geldi ve: Aranızda Abdullah b. Mes’ûd’un okuduğu şekilde okuyacak kimse var mıdır? dedi. Onlar da bana işaret ettiler. Bunun üzerine ben de evet dedim. O da Abdullah b. Mes’ûd’tan “Velleyli iza yağşa” ayetini nasıl okuduğunu işittin? Diye sordu. Ben de: Bu ayeti: “Velleyli iza yağşa vezzekeri vel ünsa” olarak okuduğunu işittim. Bunun üzerine Ebû’d Derdâ şöyle dedi: Vallahi ben de Rasûlüllah (sallallahü aleyhi ve sellem)’in bu ayeti böyle okuduğunu işitmiştim. Oysa bu insanlar benden bu ayeti “vema halaka” diye okumamı istiyorlar. Bundan böyle ben bu insanların bu isteklerine asla uymayacağım. (Buhârî, Menakıb: 27; Müslim, Salat-ül Müsafirin: 17) Bu hadis hasen sahihtir. b. Mes’ûd’un okuyuş şekli şöyledir: “velleyli iza yağşa vennehâri iza tecella vezzekeri vel ünsa.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2938,
			"arabicnumber": 2938,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyete göre, dedi ki: Rasûlüllah (sallallahü aleyhi ve sellem) bana Zâriyat sûresinin 58. ayetini “innî ene’r Razzaku zul kuvvetil metîn” şeklinde okuttu.” (Ebû Dâvûd, Huruf: 27) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2939,
			"arabicnumber": 2939,
			"text": "Alkame (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Şam’a gelmiştik, Ebû’d Derdâ yanımıza geldi ve: Aranızda Abdullah b. Mes’ûd’un okuduğu şekilde okuyacak kimse var mıdır? dedi. Onlar da bana işaret ettiler. Bunun üzerine ben de evet dedim. O da Abdullah b. Mes’ûd’tan “Velleyli iza yağşa” ayetini nasıl okuduğunu işittin? Diye sordu. Ben de: Bu ayeti: “Velleyli iza yağşa vezzekeri vel ünsa” olarak okuduğunu işittim. Bunun üzerine Ebû’d Derdâ şöyle dedi: Vallahi ben de Rasûlüllah (sallallahü aleyhi ve sellem)’in bu ayeti böyle okuduğunu işitmiştim. Oysa bu insanlar benden bu ayeti “vema halaka” diye okumamı istiyorlar. Bundan böyle ben bu insanların bu isteklerine asla uymayacağım. (Buhârî, Menakıb: 27; Müslim, Salat-ül Müsafirin: 17) Bu hadis hasen sahihtir. b. Mes’ûd’un okuyuş şekli şöyledir: “velleyli iza yağşa vennehâri iza tecella vezzekeri vel ünsa.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2940,
			"arabicnumber": 2940,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Matn"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2941,
			"arabicnumber": 2941,
			"text": "Imrân b. Husayn (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), Hac sûresinin 2. ayetini şöyle okudu: “ve tera’n nâse sükâra ve mâhüm bi sükâra” diye okudu. (Tirmizî rivâyet etmiştir.) Bu hadis hasendir. Katâde’nin Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından Enes ve Ebû’t Tufeyl dışında hiçbir kimseden hadis işittiğini bilmiyoruz. Bence bu hadis uzunca bir hadisten kısaltılmıştır. Hasan’dan, Imrân b. Husayn’dan rivâyete göre, şöyle demiştir: Bir yolculukta Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikteydik; Hac Sûresinin birkaç ayetini okudu. Hadis uzuncadır. Bence yukarıdaki Hakem b. Abdulmelik hadisi bu uzunca hadisten kısaltılmıştır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2942,
			"arabicnumber": 2942,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Onlar birisinin veya sizden birinizin falan ve filan ayeti unuttum demesi ne kötüdür. Bana unutturuldu demesi daha uygundur. O halde Kur’ân-ı devamlı hatırda tutmak için gözden geçirip müzakere ediniz. Canım kudret elinde olan Allah’a yemin ederim ki Kur’ân’ın insanların kalblerinden silinip yok olması bir hayvanın bağından boşanıp kaçmasından daha şiddetli ve çabuktur.” (Buhârî, Fedail-ül Kur’ân: 27; Müslim, Salat-ül Müsafirîn: 17) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2943,
			"arabicnumber": 2943,
			"text": "Ömer b. Hattâb (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Hişâm b. Hakîm b. Hizam’a uğradım Rasûlüllah (sallallahü aleyhi ve sellem)’in hayatta olduğu bir dönemde idi namazında Furkan sûresini okumakta idi okuduğunu dinledim bir de ne göreyim. Rasûlüllah (sallallahü aleyhi ve sellem)’in bana okutup öğretmediği değişik şekilde okuyordu, az kalsın namazda üzerine atılacaktım ama selam verinceye kadar bekledim selam verince elbisesinden tuttum ve bu okuduğun sûreyi bu şekilde sana kim öğretti dedim. Rasûlüllah (sallallahü aleyhi ve sellem), okutup öğretti dedi. Bende yanılıyorsun dedim. Vallahi Rasûlüllah (sallallahü aleyhi ve sellem) bu sûreyi bizzat kendisi bana okuttu fakat senin okuduğun gibi değildi. Sonra onu çekip Rasûlüllah (sallallahü aleyhi ve sellem)’in yanına götürdüm ve şöyle dedim: Ey Allah’ın Rasûlü! bu kimsenin Furkan sûresini bana öğretmediğiniz şekillerde okuduğunu işittim. Furkan sûresini bana okutup öğreten de sizsiniz. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): Ey Ömer! Onun yakasını bırak dedi. Hişâm’a da: Oku bakalım dedi. Hişâm benim duyduğum şekilde okuyuşunu orada tekrar etti. Peygamber (sallallahü aleyhi ve sellem) işte böylece indirilmiştir buyurdu. Sonra Peygamber (sallallahü aleyhi ve sellem) bana oku Ey Ömer! Dedi. Rasûlüllah (sallallahü aleyhi ve sellem)’in bana öğrettiği şekilde ben de okudum. Yine Rasûlüllah (sallallahü aleyhi ve sellem): İşte bu sûre böylece indi buyurdular. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: “Kur’ân; yedi okuyuş şekliyle indirilmiştir. Siz bunlardan kolayınıza geleni okuyunuz.” (Buhârî, Husumat: 27; Müslim, Salat-ül Müsafirin: 17) Bu hadis hasen sahihtir. b. Enes bu hadisi Zühri’den aynı senedle benzeri şekilde rivâyet etmiş olup hadisin senedinde “Misver b. Mahreme’yi” zikretmemiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2944,
			"arabicnumber": 2944,
			"text": "Übey b. Ka’b (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), Cebrail ile buluştu ve ona Ey Cebrail dedi; ben Ümmî olan yani okuması yazması olmayan bir topluma peygamber gönderildim. Bunlar arasında yaşlı, kadın, erkek, erkek çocuğu, kız çocuğu hiç bir şey okumamış kimseler vardır (onlarla nasıl anlaşacağım Kur’ân-ı onlara nasıl anlatacağım dedi) de Cebrail şöyle dedi: “Ey Muhammed! Kur’ân yedi okuyuş şekliyle indirilmiştir.” (sıkıntı etme hepsine anlatıp duyurabilirsin) (Müsned: 20259) konuda Ömer, Huzeyfe b. Yemân, Ebû Eyyûb’un karısı Ümmü Eyyûb, Semure, İbn Abbâs, Ebû Hüreyre, Ebû Cüheym b. Harîsb. Sımme, Amr b. Âs ve Ebû Bekre’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Bu hadis değişik bir şekilde Übey b. Ka’b’tan da rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2945,
			"arabicnumber": 2945,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her kim bir kardeşinin dünyadaki sıkıntılarından bir sıkıntısını giderirse, Allah’a onun kıyamet günü bir sıkıntısını gideriverir herkim bir Müslüman’ın ayıbını örterse, Allah’ta o kimsenin dünya ve ahirette ayıplarını örter. Kim daralmış bir kimseye kolaylık gösterirse; Allah’ta o kimseye dünya ve ahirette kolaylıklar gösterir. Kul din kardeşinin yardımında olduğu sürece Allah’ta o kimsenin devamlı yardımındadır. Her kim ilim elde etmek için bir yola girerse Allah’ta o kimseye Cennetin yolunu kolaylaştırır. Herhangi bir topluluk bir mescidde oturup Allah’ın kitabını okur ve aralarında müzakere ederlerse üzerlerine ilahi huzur iner, rahmet onları kaplar, melekler onları her yönden kuşatırlar. Her kimin yaptığı işler o kimseyi Cennet yoluna gitmeye yavaşlatırsa soyu sopu onu Cennete ulaştırmaz.” (Müslim, Zikir: 27; Ebû Dâvûd, Edeb: 17) Aynı şekilde pek çok kimse bu hadisi A’meş’den, Ebû Salih’den, Ebû Hüreyre’den rivâyet etmişlerdir. Esbat b. Muhammed, Ameş’den rivâyet ederek şöyle demiştir: Bana Ebû Salih’den, Ebû Hüreyre’den rivâyet edildi, diyerek bu hadisin bir kısmını zikretmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2946,
			"arabicnumber": 2946,
			"text": "Abdullah b. Amr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Ey Allah’ın Rasûlü dedim. Kur’ân-ı kaç günde baştan sona okuyayım? “Bir ayda” buyurdu. Bundan daha kısa zamanda okumaya gücüm yeter dedim o halde “Yirmi günde” oku buyurdu. Bundan daha kısa zamanda okumaya güç yetirebilirim dedim: “O halde on beş günde oku” buyurdu. Ben yine daha kısa zamanda okumaya gücüm yeter dedim. Öyleyse “On günde oku” buyurdu. Ben daha kısa sürede okuyabilirim deyince daha fazlası için ruhsat vermedi.” (Buhârî, Savm: 27; Müslim, Sıyam: 17) Bu hadis bu şekliyle hasen garibtir. Ebû Bürde’nin Abdullah b. Amr’dan rivâyeti olarak garibtir. Bu hadis başka şekilde de Abdullah b. Ömer’den rivâyet edilmiştir. Abdullah b. Amr vasıtasıyla Peygamber (sallallahü aleyhi ve sellem)’in şöyle buyurduğu da rivâyet edilmiştir: “Üç günden az bir zamanda Kur’ân-ı başından sonuna kadar okuyan kimse Kur’ân’dan ne okuduğunu anlamamıştır.” Abdullah b. Amr’dan peygamberin ona şöyle buyurduğunu rivâyet etmektedir: “Kur’ân-ı baştan sona kırk günde oku.” İshâk b. İbrahim diyor ki: Bu hadise göre bir kimsenin kırk gün içerisinde Kur’ân-ı baştan sona okumamış olmasını hoş karşılamıyoruz. ilim adamları peygamberden aktarılan hadise dayanarak Kur’ân-ı üç günden az bir zamanda okunmamalıdır demekte kimi ilim adamları ise buna ruhsat vermektedir. Osman b. Afvân’dan vitr olarak kıldığı bir rekatte Kur’ân’ın tamamını okuduğu rivâyet edilmektedir. Saîd b. Cübeyr’den de Ka’be’de bir rekatta Kur’ân-ı baştan sona okuduğu rivâyet edilmektedir. Kur’ân okuyuşunu yavaş yavaş tertil üzere yapmak ilim adamlarınca daha makbuldür",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2947,
			"arabicnumber": 2947,
			"text": "Abdullah b. Amr (radıyallahü anh)’den rivâyet olunmuştur. Peygamber (sallallahü aleyhi ve sellem) ona şöyle buyurdu: “Kur’ân-ı kırk günde baştan sona oku.” (Buhârî, Savm: 27; Müslim, Sıyam: 17) Bu hadis hasen garibtir. bu hadisi Ma’mer’den, Simak b. Fudeyl’den, Vehb b. Münebbih’den rivâyet ederek Peygamber (sallallahü aleyhi ve sellem)’in Abdullah b. Amr’a Kur’ân-ı kırk günde baştan sona okumasını emrettiğini bize aktarmaktadırlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2948,
			"arabicnumber": 2948,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Adamın biri Ey Allah’ın Rasûlü! hangi amel Allah’a daha sevimlidir? Diye sordu da Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: “Konaklayıp yoluna devam eden kişi yani Kur’ân-ı baştan sona devamlı okuyup Kur’ân aleminde yolculuk yapıp konaklayan ve tekrar yeni bir okumayla yoluna devam eden kişinin amelidir.” Konaklayıp göçen ne demektir, diye sorulunca; Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kur’ân-ı baştan sona okuyup tekrar başa dönmektir.” (Dârimî, Fedail-ül Kur’ân: 27) Bu hadis garib olup sadece İbn Abbâs rivâyeti olarak biliyoruz. Senedi pek sağlam değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2949,
			"arabicnumber": 2949,
			"text": "Abdullah b. Amr (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğu bize aktarılmıştır: “Üç günden az bir zaman içerisinde Kur’ân-ı baştan sona okuyan Kur’ân’dan ne okuduğunu anlamamış demektir.” (Dârimî, Fedail-ül Kur’ân: 27) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 23
			}
		}
	]
}