{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"5": "The Book on the Two Eids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 530,
			"arabicnumber": 530,
			"text": "Ali b. ebî Tâlib (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: “Bayram namazına yürüyerek gitmek ve namaza çıkmadan bir şeyler yemek sünnettendir.” (Buhari, Iydeyn: 7) Bu hadis hasendir. Pek çok ilim adamı bu hadisle amel etmekte olup bayram namazlarına yürüyerek çıkmayı, Ramazan bayramına çıkmadan bir şeyler yemeyi müstehab görmüşlerdir. Özür sahibi olan kimsenin binitle çıkmasında bir sakınca yoktur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": 531,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Ebû Bekir ve Ömer, Ramazan ve Kurban bayramı namazlarını hutbeden önce kılarlar sonra hutbe okurlardı.” (Buhârî, Iydeyn: 8; Nesâî, Iydeyn: 14) konuda Câbir ve İbn Abbâs’tan da hadis rivâyet edilmiştir. İbn Ömer hadisi hasen sahihtir. (sallallahü aleyhi ve sellem)’in ashabından ve daha sonraki dönemlerden pek çok ilim adamları bu hadise göre amel etmişler olup, Bayram namazlarında hutbe namazdan sonradır, demişlerdir. Namazdan önce ilk hutbe okuyanın, Mervan b. Hakem olduğu söylenir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": 532,
			"text": "Câbir b. Semure (radıyallahü anh)’den rivâyete göre, dedi ki: “Rasûlüllah (sallallahü aleyhi ve sellem) ile beraber ne bir sefer ne iki sefer pek çok kere ezansız ve kametsiz olarak kıldım.” (Muvatta, Iydeyn: 1; Nesâî, Iydeyn: 7) konuda Câbir b. Abdillah ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Câbir b. Semure hadisi hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından pek çok ilim adamı bu görüşte olup, Bayram namazlarında ve nafile namazlarda ezan ve kamet olmadığını söylerler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 533,
			"arabicnumber": 533,
			"text": "Numân b. Beşîr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) Ramazan ve Kurban bayramlarıyla Cuma’da A’la sûresi ile Gaşiye sûresini okurdu. Bazen Cuma ile Bayram günleri aynı güne tesadüf ederdi de yine aynı sûreleri okurdu.” (Nesâî, Iydeyn: 12) Bu konuda Ebû Vakîd el Leysî, Semure b. Cündüp ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Numân b. Beşîr hadisi hasen sahihtir. es Sevrî ve Misâr, İbrahim b. Muhammed b. el Münteşir’den bu şekilde, Ebû Avâne’nin rivâyeti gibi rivâyet ettiler. b. Uyeyne rivâyeti ihtilaflıdır. Bir rivâyet şekli şöyledir; İbrahim b. Muhammed b. el Münteşir babasından, Habib b. Sâlim ve babasından ve Numân b. Beşîr’den gelmiştir. Halbuki Habib b. Sâlim’in babasından rivâyeti bilinmiyor. Habîb b. Salim, Numân b. Beşîr azâdlı kölesidir. b. Beşîr’den bir çok hadis rivâyet etmiştir. İbn Uyeyne yoluyla İbrahim b. Muhammed b. el Münteşir’den onların rivâyetine benzer bir rivâyet edilmiştir ki şöyledir: Peygamber (sallallahü aleyhi ve sellem) Ramazan ve Kurban bayramlarında Kaf sûresi ve Kamer sûresini okurdu. Şâfii de aynı görüştedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 534,
			"arabicnumber": 534,
			"text": "Ubeydullah b. Abdullah b. Utbe (radıyallahü anh)’den rivâyet edildiğine göre: “Ömer b. Hattâb, Ebû Vakîd el Leysî’ye Rasûlüllah (sallallahü aleyhi ve sellem) Ramazan ve Kurban bayramlarında ne okurdu? diye sordu da o da dedi ki: Kaf ve kamer sûrelerini okurdu.” (Nesâî, Salat-ül Iydeyn: 12; Ebû Dâvûd, Salat: 243) hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": 535,
			"text": "Hennâd, Sûfyân b. Uyeyne ve Damre b. Saîd (radıyallahü anhüma)’den aynı senedle bu hadisin benzerini aktardı. Ebû Vakîd el Leysî’nin ismi, Hâris b. Avf’tır",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 536,
			"arabicnumber": 536,
			"text": "Kesir b. Abdillah (radıyallahü anh)’ın babasından ve dedesinden rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Ramazan ve Kurban bayramlarının namazlarında ilk rek’atta okumadan önce yedi diğer rek’atta okumadan önce beş tekbîr alırdı.” (Ebû Dâvûd, Salat: 242; Muvatta, Iydeyn: 4) Bu konuda Âişe, İbn Ömer ve Abdullah b. Amr’dan da hadis rivâyet edilmiştir. Kesir’in dedesinden rivâyet edilen bu hadis hasendir. Bu hadis bu konuda Rasûlüllah (sallallahü aleyhi ve sellem)’den rivâyet edilen hadislerin en güzelidir. dedesinin adı; Amr b. Avf el Müzenî’dir. Sahabe ve diğer dönemlerin bazı ilim adamları bu hadise göre amel etmişlerdir. Hüreyre’nin Medîne’de bu şekilde namaz kıldığı rivâyet edilmiştir. Medînelilerin görüşü de böyledir. Mâlik b. Enes, Şâfii, Ahmed ve İshâk’ta bunlardandır. b. Mes’ûd’tan bayram namazındaki tekbîrler konusunda şöyle dediği rivâyet ediliyor. “Bayram namazlarındaki fazla tekbîr sayısı dokuzdur; Birinci rek’atta okumadan önce beş tekbîr ikinci rek’atta okumayla başlayıp rükû’ tekbîriyle birlikte dört tekbîr alınır.” Peygamber (sallallahü aleyhi ve sellem)’in ashabından pek çok kişiden benzeri rivâyetler vardır, Küfeliler ve Sûfyân es Sevrî de aynı görüştedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": 537,
			"text": "Adiyy b. Sabit (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: “Saîd b. Cübeyr’den işittiğime göre İbn Abbâs’tan naklederek şöyle demişti: Rasûlüllah (sallallahü aleyhi ve sellem) Ramazan bayramında namazgaha çıkarak iki rek’at bayram namazı kıldı, bayram namazının öncesinde ve sonrasında hiç namaz kılmadı.” (Muvatta, Iydeyn: 5; Ebû Dâvûd, Salat: 247) Bu konuda Abdullah b. Ömer, Abdullah b. Amr ve Ebû Saîd’den de hadis rivâyet edilmiştir. İbn Abbâs hadisi hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başka ilim adamları bu görüştedirler. Şâfii, Ahmed ve İshâk bunlardandır. Bazı ilim adamları ise bayram namazından önce ve sonra namaz kılınabileceği görüşündedir. görüş daha sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": 538,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyet edilmiştir: “İbn Ömer bayram günü namazgaha çıktı. Bayram namazının ne öncesinde ne de sonrasında namaz kılmadı ve Rasûlüllah (sallallahü aleyhi ve sellem)’in de böyle yaptığını hatırlattı.” (Muvatta, Salatül Iydeyn: 5; Ebû Dâvûd, Salat: 247) hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": 539,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": 540,
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": 541,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": 542,
			"text": "Abdullah b. Büreyde (radıyallahü anh)’in babasından rivâyete göre, şöyle demiştir: “Peygamber (sallallahü aleyhi ve sellem), Ramazan bayramı günü bir şey yemeden namaza çıkmaz, Kurban bayramında ise namaz kılıncaya kadar bir şey yemezdi.” (Buhârî, Iydeyn: 4; Muvatta, Iydeyn: 3) Bu konuda Ali ve Enes’den de hadis rivâyet edilmiştir. Büreyde b. Husayb el Eslemî hadisi garib hadistir. diyor ki: Sevap b. Utbe’nin bundan başka bir hadis rivâyet ettiğini bilmiyoruz. ilim adamları Ramazan bayramı namazına çıkmadan bir miktar hurma yemeyi, Kurban bayramı namazında ise namazdan çıkıncaya kadar bir şey yememeyi müstehab görürler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": 543,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyet edilmiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Ramazan bayramında namazgaha çıkmadan önce bir kaç tane hurma yerdi.” (Buhârî, Iydeyn: 4; Muvatta, Iydeyn: 3) Bu hadis hasen garib sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 14
			}
		}
	]
}