{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 809,
			"arabicnumber": 809,
			"text": "Ebû Şüreyh el Adevî (radıyallahü anh)’den rivâyete göre: Ebû Şüreyh, Amr b. Saîd’e: -Mekke’ye ordu gönderirken- Ey komutan bana izin ver de sana Rasûlüllah (sallallahü aleyhi ve sellem)’in Mekke fethinin ertesi günü söylediği bir sözü anlatayım. Bu sözü benim kulaklarım işitmiş kalbim (aklım) kavramış gözlerim de görmüştür. Rasûlüllah (sallallahü aleyhi ve sellem) bu konuşmasına Allah’a hamd ve sena ile başlamış ve şöyle buyurmuştur: “Şüphesiz Mekke’yi insanlar değil Allah haram kılmıştır. Dolayısıyla Allah’a ve ahiret gününe iman eden hiçbir kimsenin orada kan dökmesi ve oradan bir ağaç kesmesi helal değildir. Rasûlüllah (sallallahü aleyhi ve sellem)’in Mekke’de yaptığı savaşından yola çıkarak kendisi için savaşmaya ruhsat görürse ona: Allah bu konuda Rasûlüne izin verdi ama sana izin vermedi deyin! Bana da gündüzün bir anında bu izin verilmişti. Mekke’nin dünkü haramlığı bugün de aynen devam etmektedir. Bu durumu burada bulunan ve duyanlar bulunmayanlara duyursun.” Şüreyh’e bunu söyleyince Amr sana ne dedi denildi. Amr b. Saîd ise: Ey Ebû Şureyh! Bunu senden daha iyi bilirim muhakkak ki bu haram bölgesi Âsi’yi barındırmaz, kan yüzünden kaçıp geleni ve bozguncuyu barındırmaz cevabını verdi. (Buhârî, İlim: 38; Müslim, Hac: 82) Hadiste geçen “Bi harbetin” kelimesi “Bi hızyetin” yani utanç duyulacak bir durumla kaçıp geleni de barındırmaz şeklinde de rivâyet edilmiştir. Bu konuda Ebû Hüreyre ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Ebû Şüreyh hadisi hasen sahihtir. Ebû Şüreyh el Huzaî’nin ismi Huveylid b. Amr el Adevî el Ka’bî’dir. Hadiste geçen “Vela Fârran bi harbetin” sözünün manası cinayet demektir. Yani bir kimse bir cinayet işler elini kana bulaştırdıktan sonra gelir hareme sığınırsa haremde bu kişi barındırılmaz ona cezası uygulanır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": 810,
			"text": "Abdullah b. Mes’ûd (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Hac ve Umreyi beraber yapınız çünkü Hac ve Umre günahları ve fakirliği giderir. Tıpkı demir, altın ve gümüşün kir ve pasını körüğün giderdiği gibi kabul edilmiş haccın sevâbı ise ancak Cennettir.” (Nesâî, Menasik: 6) Bu konuda Ömer, Âmir b. Rabia, Ebû Hüreyre, Abdullah b. Hubşî, Ümmü Seleme ve Câbir’den de hadis rivâyet edilmiştir. İbn Mes’ûd hadisi hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": 811,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) buyurdu: “Her kim hacceder ve bu yaptığı hac süresince her türlü kötü sözden ve Allah’ın çizdiği dosdoğru yolundan dışarı çıkmak gibi bir suç işlemezse geçmiş günahları affedilir.” (Buhârî, Hac: 4; Müslim, Hac: 79) Ebû Hüreyre hadisi hasen sahihtir. Hazim, Küfeli olup kendisine “Eşcai” de denilir. İsmi Selman olup Eşca kabilesine mensup olan Azze isimli birinin azâd edilmiş kölesidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": 812,
			"text": "Ali (radıyallahü anh)’den rivâyet edildiğine göre Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Mekke’ye gidebilecek kadar binit ve azık imkanı olup ta haccetmeyen kimsenin Yahudi veya Hıristiyan olarak ölmesinin ne önemi vardır. Çünkü Allah Kitabında Âl-i imrân sûresi 97. ayette “… Ka’be’yi haccetmek gücü yeten tüm Müslümanların yerine getirmek zorunda oldukları bir görevdir. Kim bu vazifeyi inkar edip yapmazsa bilsin ki: Allah tüm alemlerden bağımsız olup her bakımdan kendi kendine yeterlidir” böyle buyurmaktadır. (Tirmizî rivâyet etmiştir.) Bu hadis garib olup sadece bu şekliyle biliyoruz. Senedinde söz edilmiştir. Hilâl b. Abdullah meçhul bir kimsedir, Hâris’inde hadiste zayıflığı söylenir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": 813,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir adam Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek; Ey Allah’ın Rasûlü! “Haccı farz kılan şey nedir?” Diye sordu. Rasûlüllah (sallallahü aleyhi ve sellem) de: “Azık ve binit imkanının bulunmasıdır cevabını verdi.” (İbn Mâce, Menasik: 6; Buhari, Hac: 1) Bu hadis hasendir. İlim adamları, uygulamalarını bu hadise göre yapmakta olup “Yiyeceği ve biniti olan kimseye hac farzdır” derler. İbrahim b. Yezîd el Havzî el Mekkî’dir. Bazı ilim adamları hafızası yönünden bu şahıs hakkında söz etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": 814,
			"text": "Ali b. ebî Tâlib (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Âl-i imrân 97. ayeti nazil olunca, kimileri şöyle dediler: “Ey Allah’ın Rasûlü her sene mi? Rasûlüllah (sallallahü aleyhi ve sellem) sustu onlar yine sordular her sene mi?” Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): “Hayır” dediler. “Evet deseydim her sene farz olacaktı.” Bunun üzerine Allah, Maide sûresi 101. ayetini indirdi. “Ey iman edenler açıklandığı zaman size zorluk verip üzecek şeyleri sormayın…” (İbn Mâce, Menasik: 2) Bu konuda İbn Abbâs ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. Ali (radıyallahü anh)’ın hadisi hasen garibtir. Ebûl Bahterî’nin adı Saîd b. ebî Imrân’dır. Saîd b. Feyrûz’da denir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": 815,
			"text": "Câbir b. Abdillah (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), üç kere hac yapmıştır. Hicretten önce iki hac, hicretten sonra umre ile beraber bir hac ki bu haccında Rasûlüllah (sallallahü aleyhi ve sellem) altmış üç deve getirmişti, geri kalan (otuz yedi) deveyi de Ali, Yemen’den getirmişti. Ebû Cehil’in burnunda gümüş halka bulunan devesi de bunların arasında idi. Rasûlüllah (sallallahü aleyhi ve sellem) bunların hepsini kurban etti ve hepsinden birer parça alınıp pişirilmesini emretti de Rasûlüllah (sallallahü aleyhi ve sellem) onun suyundan içti.” (İbn Mâce, Menasik: 84) Sûfyân’ın rivâyeti olan bu hadis garibtir. Bu hadisi sadece Zeyd b. Hubab’ın rivâyetiyle bilmekteyiz. Abdullah b. Abdurrahman’ın bu hadisi kendi yazdığı hadislerde Abdullah b. ebiz Ziyâd’tan rivâyet ettiğini gördüm. Muhammed’e bu hadis hakkında sordum; Sevrî’nin, Cafer’den, babasından, Câbir’den rivâyeti olarak tanımadı ve bu hadisi pek makbul saymadı ve şöyle dedi: Bu hadis Sevrî’den Ebû İshâk’dan ve Mücahid’den mürsel olarak rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": 816,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": 817,
			"text": "Câbir b. Abdillah (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Peygamber (sallallahü aleyhi ve sellem) haccetmek isteğini insanlara duyurunca hepsi toplandılar. Beyda denilen yere gelince ihrama girdi.” (Tirmizî rivâyet etmiştir.) Bu konuda İbn Ömer, Enes ve Misver b. Mahreme’den de hadis rivâyet edilmiştir. Câbir hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": 818,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": 819,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, demiştir ki: “Beyda da, Rasûlüllah (sallallahü aleyhi ve sellem) ihrama girdi diyerek yalan söylüyorsunuz. Vallahi Rasûlüllah (sallallahü aleyhi ve sellem), Telbiyeye; Zülhüleyfe mescidinin yanında ağacın bulunduğu yerden itibaren başlamıştı.” (Buhârî, Hac: 34; Müslim, Hac: 23) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": 820,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), ihram için kılınan namazın sonrasında telbiye getirmeye başladı.” (Nesâî, Menasik: 56; Müslim, Hac: 4) Bu hadis hasen garibtir. Bu hadisi Abdusselam b. Harb’den başkasının rivâyet ettiğini bilmiyoruz. İlim adamları bunu müstehab görmüşlerdir. Yani umre yapacak kimse ihram için kıldığı namazdan sonra telbiyeye başlamalıdır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": 821,
			"text": "Bazı ilim adamları uygulamalarını bu hadisle yapar. İbn Ömer (radıyallahü anh)’den rivâyete göre: “Peygamber (sallallahü aleyhi ve sellem) tek başına hac yapmıştır. Ebû Bekir, Ömer ve Osman da tek başına hac yapmışlardır. Bu hadisi bu şekilde bize Kuteybe, Abdullah b. Nafi’ es Saiğ, Ubeydullah b. Ömer, Nafi’ ve İbn Ömer yoluyla aktarmıştır. Sevrî diyor ki: “Tek başına hac yapılabilir. Hac ve Umre birlikte de yapılabilir. Veya tek bir ihramla hem hac hemde umre bir arada yapılabilir, hepsi güzeldir.” Şâfii’de aynı şekilde diyor ve şunu ekliyor: “Bizce en sevimli olan yalnızca yapılan hac’dır. Sonra temettü haccı, daha sonra da kıran haccı gelir.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": 822,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": 823,
			"text": "Muhammed b. Abdullah b. Hâris b. Nevfel (radıyallahü anh)’den rivâyete göre: Sa’d b. ebî Vakkâs ile Dahhâk b. Kays’ın Hac ile Umreyi birlikte yapma konusunu aralarında müzakere ettiklerini işitmişti. Dahhâk b. Kays diyordu ki: “Bu işi Allah’ın emrini bilmeyenler yapar.” Bunun üzerine Sa’d: “Ey kardeşimin oğlu çirkin konuştun” dedi. Dahhâk: “Ömer b. Hattâb bu işi yasaklamıştı” deyince Sa’d şöyle cevap verdi: “Hac ve Umreyi bir arada yapmayı Rasûlüllah (sallallahü aleyhi ve sellem)’de; Ömer’le beraber biz de yaptık.” (Nesâî, Menasik: 50; Müslim, Hac: 23) Bu hadis sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": 824,
			"text": "İbn Şihâb (radıyallahü anh)’den rivâyet edildiğine göre: Sâlim b. Abdullah, Şam halkından bir adamın Abdullah b. Ömer’e hac ve umreyi birlikte yapmayı sorduğunu İbn Şihâb’a anlatmıştı. Abdullah b. Ömer; “Bu tür hac ve umre yapmak helaldir” dedi. Şamlı adam: “Baban bu tür hac ve umre yapmayı yasaklamıştır” deyince Abdullah b. Ömer dedi ki: “Babam yasaklamış olsa bile Rasûlüllah (sallallahü aleyhi ve sellem) hac ve umreyi ikisini bir arada yapmıştır. Böyle bir durumda babamın emrine mi uyulur, yoksa Rasûlüllah (sallallahü aleyhi ve sellem)’in emrine mi? dedi. Şamlı adam: “Elbette Rasûlüllah (sallallahü aleyhi ve sellem)’in emrine uyulur” deyince Abdullah b. Ömer de: “Rasûlüllah (sallallahü aleyhi ve sellem)’in bu şekilde hac ve umreyi bir arada yaptığı bir gerçektir” dedi. (Tirmizî rivâyet etmiştir.) Bu konuda Ali, Osman, Câbir, Sa’d, Esma binti ebî Bekir ve İbn Ömer’den de hadis rivâyet edilmiştir. İbn Abbâs hadisi hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve diğerlerinden bir kısım ilim adamları temettu haccının yapılabileceğini tercih etmişlerdir. Temettu: Hac aylarında umre yapmaya niyet etmek demektir. Bu kimse hac edinceye kadar Mekke’de kalır ve haccını da yapar kurbanını da keser kurban bulamaz ise üç gün Mekke’de yedi gün de memleketine gidince oruç tutmalıdır. Tutacağı üç gün orucun son gününün arefe günü olması müstehabtır. Zilhiccenin on gününde bu üç orucu tutamazsa Teşrik günleri denilen bayramın 2-3-4. günleri tutmalıdır. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından İbn Ömer, Âişe, Mâlik, Şâfii, Ahmed ve İshâk’da bu görüştedirler. Kimi ilim adamları da: “teşrik günleri oruç tutamaz” diyorlar ki: Küfeliler bu görüştedirler. Hadisçiler, Temettu haccını tercih ederler. Şâfii, Ahmed ve İshâk’da bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": 825,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": 826,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": 827,
			"text": "Ebû Bekir (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem)’e hangi hac daha değerlidir diye soruldu da buyurdular ki: “Bol bol telbiye getirilen ve çok kurban edilerek yapılan hactır.” (İbn Mâce, Menasik: 15)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "Hasan b. Muhammed ez Zaferânî ve Abdurrahman b. Esved, Ebû Amr el Basrî dediler ki: Ubeyde b. Humeyd, Umare b. Gâziyye’den, Ebû Hazim’den, Sehl b. Sa’d’den ve Peygamber (sallallahü aleyhi ve sellem)’den İsmail b. Ayyaş hadisinin benzerini bize naklettiler. Bu konuda İbn Ömer ve Câbir’den de hadis rivâyet edilmiştir. Ebû Bekr hadisi garibtir. Bu hadisi sadece İbn ebî Füdeyk’in, Dahhâk b. Osman’dan yaptığı rivâyetiyle bilmekteyiz. Muhammed b. Münkedir, Abdurrahman b. Yerbu’dan hadis işitmemiştir. Muhammed b. Münkedir, Abdurrahman b. Yerbu’dan hadis işitmemiştir. Muhammed b. Münkedir, Abdurrahman b. Yerbu’un oğlu Said vasıtasıyla Abdurrahman b. Yerbu’dan başka bir hadis rivâyet etmiştir. Ebû Nuaym et Tahhan, Dırar b. Surad bu hadisi İbn ebî Füdeyk’den, Dahhâk b. Osman’dan, Muhammed b. Münkedir’den Saîd b. Abdurrahman b. Yerbu’dan ve babasından Ebû Bekir’den rivâyet etmiş olup Dırar bu rivâyetinde yanılmıştır. Ahmed b. Hasen’den işitim şöyle diyordu: Ahmed b. Hanbel şöyle diyor: Her kim bu hadisin senedinde Muhammed b. Münkedir, İbn Abdurrahman b. Yerbu’ ve babasından diyerek rivâyet ederse mutlaka yanılmıştır. işittim şöyle diyordu: Dırar b. Sured’in, İbn ebî Füdeyk’den rivâyetini ona hatırlattığımda “o yanlıştır” dedi. Bende başkalarının da İbn ebî Füdeyk’den Dırar’ın rivâyeti gibi rivâyet ettiklerini söyledim. Dedi ki: Bunlar “hiçbir şey” değildir. Doğrusu şudur ki o hadisi ibn ebî Füdeyk’den rivâyet ettiler ve senedinde Saîd b. Abdurrahman demediler. Buhârî’nin, Dırar b. Sured’i zayıf kabul ettiğini gördüm. “Ac” Telbiyeyi yüksek sesle getirmek demektir. “Sec” ise deve kesmek demektir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": 829,
			"text": "Sâib b. Hallâd (radıyallahü anh), babasından rivâyet edip şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Cebrail bana geldi ve ashabıma ihlal ve telbiyede seslerini yükseltmelerini emretmemi emir buyurdu.” (Nesâî, Menasik: 55; İbn Mâce, Menasik: 16) konuda Zeyd b. Hâlid, Ebû Hüreyre ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Hallâd’ın babasından rivâyet ettiği hadis hasen sahihtir. Bazıları bu hadisi Hallâd b. Sâib’den, Zeyd b. Hâlid’den rivâyet etmişlerdir ki sahih değildir. Sahih olan rivâyet Hallâd b. Sâib’in babasından yaptığı rivâyettir. Hallâd b. Sâib, Hallâd b. Süveyd el Ensarî’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": 830,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": 831,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, bir adam nereden ihrama gireceğiz Ey Allah’ın Rasûlü dedi. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Medîneliler; “Zülhüleyfe” den, Şamlılar; “Cuhfe” den, Necidliler; “Karn” dan, Yemenliler; “Yelemlem” denilen yerden ihrama girerler.” (Buhârî, Hac: 11; Müslim, Hac: 2) Bu konuda İbn Abbâs, Câbir b. Abdullah, Abdullah b. Amr’dan da hadis rivâyet edilmiştir. İbn Ömer hadisi hasen sahihtir. İlim adamları bu hadisle amel ederler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": 832,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, “Rasûlüllah (sallallahü aleyhi ve sellem), Mekke’nin doğusunda olan kimseler için “Akık-ı” mîkat yeri olarak tayin etti.” (Ebû Dâvûd, Menasik: 8; Buhârî, Hac: 11) Bu hadis hasendir. Muhammed b. Ali; Ebû Cafer, Muhammed b. Ali b. Husayn b. Ali b. ebî Tâlib’tir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": 833,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir adam ayağa kalktı ve şöyle dedi: “Ya Rasûlüllah ihramda hangi çeşit elbise giymemizi emredersin? Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Gömlek, don, bornoz, sarık ve mest giymeyiniz ayakkabısı olmayan kimse mestlerinin topuktan aşağısını keserek giysin. Zaferan ve Vers’le boyanmış elbise giymeyin ihramlı kadın yüzüne peçe örtmesin eldiven de kullanmasın.” (Buhârî, Hac: 21; Ebû Dâvûd, Menasik: 31) Bu hadis sahihtir. İlim adamları uygulamalarını bu hadise göre yaparlar",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": 834,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": 835,
			"text": "Ya’la b. Ümeyye (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) ihramlı olan bir bedevîyi üzerinde cübbe olduğu halde gördü ve onu çıkarmasını emretti.” (Buhârî, Hac: 21; Ebû Dâvûd, Menasik: 31)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": 836,
			"text": "Safvân b. Ya’la (radıyallahü anh), babasından bu hadisin bir benzerini rivâyet etmiştir. Aynı şekilde Katâde, Haccac b. Ertae ve pek çok kimseler Atâ’dan ve Ya’la b. Ümeyye’den bu hadisi rivâyet ettiler. Sahih olan rivâyet Amr b. Dinar’ın İbn Cüreyc’in; Atâ’dan Safvân b. Ya’la’dan ve babasından yaptıkları rivâyettir",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 837,
			"arabicnumber": 837,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Beş hayvan zararlıdır, ihramlı kimse bunları haram bölgede öldürebilir. Bunlar fare, akrep, karga, çaylak, kuduz ve yırtıcı köpekler.” (Müslim, Hac: 9; Ebû Dâvûd, Menasik: 39) Bu konuda İbn Mes’ûd, İbn Ömer, Ebû Hüreyre, Ebû Saîd ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Âişe hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 838,
			"arabicnumber": 838,
			"text": "Ebû Saîd (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “İhramlı olan kimse yırtıcı hayvanları saldırgan kuduz köpekleri, fare, akrep, çaylak, ve kargayı öldürebilir.” (Ebû Dâvûd, Menasik: 39; İbn Mâce, Menasik: 91) Bu hadis hasendir. İlim adamları bu hadisle amel ederek derler ki: ihramlı kimse yırtıcı hayvanları öldürebilir. Sûfyân es Sevrî, Şâfii bu kanaattedir. Şâfii der ki: İnsanlara ve hayvanlara saldırgan her yırtıcı hayvanı ihramlı kimse öldürebilir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 839,
			"arabicnumber": 839,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem) ihramlı olduğu halde kan aldırmıştı.” (Müslim, Hac: 11; Ebû Dâvûd, Menasik: 35) İbn Abbâs hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 840,
			"arabicnumber": 840,
			"text": "Nübeyh b. Vehb (radıyallahü anh)’den rivâyete göre, şöyle demiştir: İbn Ma’mer’in oğlunu nikahlamak istedi ve o günkü hac işleri görevlisi Ebân b. Osman’a gönderdi. Ona geldim ve şöyle dedim: “Karedeşin İbn Ma’mer oğlunu nikahlamak istiyor seninde nikahta hazır bulunmanı istiyor.” Bunun üzerine şöyle dedi: Kanaatimce o cahil bir bedeviden başkası değildir. Çünkü ihramlı kişi ne evlenebilir nede evlendirilebilir. Veya buna yakın bir söz söyledi. Sonra Osman’dan benzeri olarak merfu bir hadisi bize aktardı. (Ebû Dâvûd, Menasik: 38) konuda Ebû Rafi’ ve Meymûne’den de hadis rivâyet edilmiştir. Osman hadisi hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından bazı ilim adamları bu hadisle amel ederler. Ömer b. Hattâb, Ali b. ebî Tâlib, İbn Ömer ve bazı tabiin dönemi fakihleri bunlardır. Mâlik, Şâfii, Ahmed ve İshâk aynı görüşte olup ihramlı kimsenin evlenmesini hoş görmezler nikah yaparsa nikahı batıldır derler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 841,
			"arabicnumber": 841,
			"text": "Ebû Rafi’ (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Meymûne ile ihramsız iken evlendi, ihramsız iken gerdeğe girdi ikisinin arasında dünür başı ben idim.” (Ebû Dâvûd, Menasik: 38) Bu hadis hasen sahih olup; sadece Hammad b. Zeyd’in Matar el Verrak yoluyla Rabia’dan müsned olarak rivâyetiyle bilmekteyiz. Mâlik b. Enes, Rabia, Süleyman b. Yesâr yoluyla Peygamber (sallallahü aleyhi ve sellem)’in Meymûne ile ihramsız iken evlendiğini bize rivâyet etmektedir. Mâlik bu hadisi mürsel olarak rivâyet ediyor. Aynı şekilde Süleyman b. Bilâl’de, Rabia’dan mürsel olarak rivâyet etmiştir. Yezîd b. el Esam’ın, Meymûne’den rivâyetine göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), ihramlı değilken benimle evlendi.” b. Esam; Meymûne’nin kız kardeşinin oğludur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 842,
			"arabicnumber": 842,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, “Rasûlüllah (sallallahü aleyhi ve sellem), Meymûne ile ihramlı iken evlenmişti.” (Buhârî, Nikah: 31; Ebû Dâvûd, Menasik: 38) konuda Âişe’den de hadis rivâyet edilmiştir. İbn Abbâs hadisi hasen sahihtir. Bazı ilim adamları uygulamalarını bu hadisle yaparlar. Sûfyân es Sevrî ve Küfeliler bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 843,
			"arabicnumber": 843,
			"text": "Yine İbn Abbâs (radıyallahü anh)’den rivâyete göre, “Rasûlüllah (sallallahü aleyhi ve sellem) Meymûne ile ihramlı iken evlenmişti.” (Buhârî, Nikah: 31; Ebû Dâvûd, Menasik: 38)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 844,
			"arabicnumber": 844,
			"text": "Amr b. Dinar (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Ebûş Şa’sâ’dan işittim İbn Abbâs’dan şöyle naklediyordu: “Rasûlüllah (sallallahü aleyhi ve sellem) ihramlı iken Meymûne ile evlendi.” (Buhârî, Nikah: 31; Ebû Dâvûd, Menasik: 38) Bu hadis hasen sahihtir. Şa’sa’nın ismi Câbir b. Zeyd’tir. Rasûlüllah (sallallahü aleyhi ve sellem)’in, Meymûne ile evlenmesi konusunda değişik görüşler ortaya konulmuştur. Çünkü; Rasûlüllah (sallallahü aleyhi ve sellem), Mekke yolunda evlenmişti. Kimi ilim adamları Meymûne ile evlenmesi konusunda değişik görüşler ortaya konulmuştur çünkü, Rasûlüllah (sallallahü aleyhi ve sellem), Mekke yolunda evlenmiş. Kimi ilim adamları, Meymûne ile ihramdan önce evlenmiş evlenme işi ihramlı iken ortaya çıkmıştı yine ihramdan çıktıktan sonra Mekke yolu üzerindeki, “Şerif” denilen yerde gerdeğe girmişti. Yine Meymûne “Şerif” denilen yerde vefat etmiş ve aynı yere defnedilmişti",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 845,
			"arabicnumber": 845,
			"text": "Yezîd b. Esam (radıyallahü anh)’in, Meymûne’den rivâyetine göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Meymûne ile ihramlı değilken evlendi ve yine ihramsız iken gerdeğe girdi. Meymûne; “Serif” denilen yerde vefat etti ve onu orada zıfaf yapılan gölgeliğin altında defnettik.” (Ebû Dâvûd, Menasik: 38; Nesâî Menasik: 90) hadis garibtir. Bu hadisi pek çok kimse Yezîd b. Esam’dan mürsel olarak: “Rasûlüllah (sallallahü aleyhi ve sellem), Meymûne ile ihramda değilken evlenmişti” denilerek rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 846,
			"arabicnumber": 846,
			"text": "Câbir b. Abdullah (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Kendiniz avcılık yapmadığınız ve sizin için avlanmadığı takdirde kara avı ihramda iken sizin için helaldir.” (Ebû Dâvûd, Menasik: 40; Nesâî, Menasik: 78) Bu konuda Ebû Katâde ve Talha’dan da hadis rivâyet edilmiştir. Câbir hadisi tefsir edilip yoruma kavuşturulmuş gibidir çünkü Muttalib’in, Câbir’den hadis işittiğini bilmiyoruz. Bazı ilim adamları, uygulamalarını bu hadise göre yaparak; İhramlı kimse kendisi için avlamamış veya kendisi için bir başkası tarafından avlanmamış ise av etinden yiyebilir demektedirler. Bu konuda rivâyet edilen en güzel ve hoş hadis budur diyerek, uygulamalarını bu hadise göre yaptığını ortaya koymuştur. Ahmed ve İshâk’da aynı görüştedirler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 847,
			"arabicnumber": 847,
			"text": "Ebû Katâde (radıyallahü anh)’den rivâyet edilmiştir. Ebû Katâde, Peygamber (sallallahü aleyhi ve sellem) ile beraberdi, kendisi ihramlı değildi Mekke yolunda, ihramlı birkaç arkadaşıyla birlikte geri kaldı. Tam bu arada vahşi bir eşek gördü hemen o hayvanı avlamak için atına bindi arkadaşlardan kamçısını vermelerini istedi onlar bu işe yanaşmadılar, mızrağını istedi yine uzak durdular. Bu sefer kendisi alıp yaban eşeğini sıkıştırıp avladı. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından bir kısmı onun etinden yedi bir kısmı da yemedi. Rasûlüllah (sallallahü aleyhi ve sellem)’e ulaşınca ona bu konuda sordular. O’da buyurdu ki: “O av eti Allah’ın size yiyecek olarak verdiği bir ikramıdır.” (Ebû Dâvûd, Menasik: 40; Nesâî, Menasik: 78)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 848,
			"arabicnumber": 848,
			"text": "Kuteybe’nin, Mâlik, Zeyd b. Eslem, Atâ b. Yesâr ve Ebû Katâde’den bize aktardığına göre bu hadisin bir benzerini aktarmış olup bu Zeyd b. Eslem’in rivâyetinde Rasûlüllah (sallallahü aleyhi ve sellem)’in “Yanınızda o avın etinden bir şey var mı?” fazlalığı vardır. (Ebû Dâvûd, Menasik: 40; Nesâî, Menasik: 78) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 849,
			"arabicnumber": 849,
			"text": "Sa’d b. Cessâme (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), Ebva ve Veddan denilen yerde ona uğramıştı oda Rasûlüllah (sallallahü aleyhi ve sellem)’e vahşî bir eşek hediye etmişti. Rasûlüllah (sallallahü aleyhi ve sellem)’de onu kabul etmeyip geri çevirmişti. Onun yüzündeki hoşnutsuzluğu görünce şöyle buyurdu: “Onu sana iade etmezdik fakat biz ihramlıyız o yüzden kabul etmedik.” (Ebû Dâvûd, Menasik: 40; Nesâî, Menasik: 78) Bu hadis hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başka dönemlerden bazı ilim adamları, uygulamalarını bu hadise göre yaparak ihramlı kimsenin av eti yemesini hoş karşılamazlar. diyor ki: Bu hadis bize göre, şöyle anlaşılmalıdır: Rasûlüllah (sallallahü aleyhi ve sellem), o avın kendisi için avlandığını zannederek hoşlanmamış ve geri çevirmiştir. Zuhrî’nin bazı arkadaşları bu hadisi Zührî’den rivâyet ettiler ve dediler ki: “Rasûlüllah (sallallahü aleyhi ve sellem)’e yabanî eşek hediye edilmişti” fakat bu rivâyet pek sağlam değildir. Bu konuda Ali ve Zeyd b. Erkâm’dan da hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 850,
			"arabicnumber": 850,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikte hac ve umre için çıkmıştık çekirge sürüsüyle karşılaştık çekirgeleri bastonlarımızla ve kamçılarımızla vurup öldürüyorduk. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Çekirgeleri yeyiniz çünkü o deniz avından sayılır.” (İbn Mâce, Sayd: 9; Ebû Dâvûd, Menasik: 41) Bu hadis garibtir. Bu hadisi sadece Ebûl Mühezzim’in, Ebû Hüreyre’den rivâyetiyle bilmekteyiz. Ebûl Mühezzim’in ismi Yezîd b. Sûfyân’dır. Şu’be bu kimse hakkında ileri geri konuşmuştur. İlim adamlarından bazıları ihramlı kimsenin çekirge avlayıp yemesine izin vermişlerdir. Bir kısmı da çekirge avlayıp yiyen kimsenin sadaka vermesi gereklidir derler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 851,
			"arabicnumber": 851,
			"text": "İbn ebî Ammâr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Câbir b. Abdullah’a, sırtlan av sayılır mı? diye sordum. Evet dedi. Onu yiyebilir miyim? Dedim. Evet dedi. Bunu Rasûlüllah (sallallahü aleyhi ve sellem) mi böyle buyurdu dedim yine evet dedi.” (Tirmizî rivâyet etmiştir.) Bu hadis hasen sahihtir. b. el Medînî diyor ki: Yahya b. Saîd şöyle der: Cerir b. Hazım bu hadisi rivâyet etti ve Câbir’den, Ömer’den dedi. İbn Cüreyc’in rivâyeti daha sahihtir. Ahmed ve İshâk’ta aynı görüştedir. Bazı ilim adamlarının ameli bu hadise göredir. Yani “Sırtlan yakalayan kimseye ceza gerekir” derler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 852,
			"arabicnumber": 852,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Mekke’ye giriş için “Fah” denilen yerde gusletmişti.” (Tirmizî rivâyet etmiştir.) Bu rivâyet pek tercih edilmez sahih olan rivâyet Nafi’ yoluyla İbn Ömer’den gelen “O Mekke’ye giriş için yıkanırdı” rivâyetidir. Şâfii aynı görüşte olup Mekke’ye girerken gusletmeyi müstehab görür. Abdurrahman b. Zeyd b. Eslem hadis konusunda zayıftır. Ahmed b. Hanbel, Ali el Medînî ve başka hadisçiler bu kimseyi hadis konusunda zayıf kabul etmişlerdir. Bu hadisi sadece merfu olarak onun rivâyetinden bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 853,
			"arabicnumber": 853,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), Mekke’ye girerken üst taraftan girer alt taraftan da çıkardı.” (Buhârî, Hac: 41; Müslim, Hac: 37; Ebnu Dâvûd, Menasik: 44) Bu konuda İbn Ömer’den de hadis rivâyet edilmiştir. Âişe hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 854,
			"arabicnumber": 854,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Mekke’ye gündüzleyin girmişti.” (Nesâî, Menasik; 104; Buhârî, Hac: 39) Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 855,
			"arabicnumber": 855,
			"text": "Muhâcir el Mekkî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Câbir b. Abdullah’a “Ka’be görülünce kişi ellerini kaldırmalı mı?” diye soruldu da bunun üzerine şöyle dedi: “Rasûlüllah (sallallahü aleyhi ve sellem) ile beraber haccettik biz öyle bir şey yapıyor muyduk?” (Ebû Dâvûd, Menasik: 45) Ka’be’yi görünce ellerin kaldırılmasını sadece Şu’be’nin, Ebû Kazaa’dan rivâyetiyle bilmekteyiz. Ebû Kazaa’nın ismi: Süveyd b. Hucr’dur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 856,
			"arabicnumber": 856,
			"text": "Câbir (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), Mekke’ye gelince mescide girdi önce Hacer-ül Evsedi istilam etti (yani eliyle selamladı) sonra Ka’be’yi sol yanına alarak üç sefer hızlıca yürüyerek dört seferde normal yürüyerek tavafı tamamlamış oldu sonra İbrahim makamına gelerek “İbrahimin makamını namazgah edinin” diyerek iki rekat namaz kıldı. Makamı İbrahim kendisiyle Ka’be’nin arasında idi iki rekatlık namazdan sonra Hacer-ül Esvede gelerek istilam etti (eliyle selamladı). Sonra Safa tepesine çıktı. Zannediyorum ki: “Safa ve Merve Allah’ın sembollerindendir” buyurdu. (Nesâî, Menasik: 137) konuda İbn Ömer’den de hadis rivâyet edilmiştir. Câbir hadisi hasen sahihtir. İlim adamları bu hadisle amel ederler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 857,
			"arabicnumber": 857,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Hacer-ül Esved’den, Hacer-ül Esved’e kadar hızlıca yürüdü sonra da dört sefer normal yürüyüşle tavafı bitirmiş oldu.” (Nesâî, Menasik: 146) Bu konuda İbn Ömer’den de hadis rivâyet edilmiştir. Câbir hadisi hasen sahihtir. İlim adamları uygulamalarını bu hadisle yaparlar. diyor ki: İlk üç şaftta hızlı yürümeyi terk eden saygısızlık etmiş olur, keffâret olarak bir şey gerekmez. İlk üç şaftta hızlı yürümeyi terk etmişse geri kalanlarda hızlı yürümesi gerekmez. ilim adamları şöyle derler: Mekkeli olanlara ve Mekke’de ihrama girenlere ilk üç şaftta hızlı yürümek gerekmez",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 858,
			"arabicnumber": 858,
			"text": "Ebût Tufeyl (radıyallahü anh)’den rivâyete şöyle demiştir: İbn Abbâs’la beraberdik Muaviye, Ka’be’nin tüm köşelerini istilam ederek tavafını sürdürüyordu. Bunun üzerine İbn Abbâs ona şöyle dedi: “Rasûlüllah (sallallahü aleyhi ve sellem), sadece Rükni Yemani ve Hacer-ül Esved köşelerini istilam etmişti. Muaviye dedi ki: “Ka’be’nin istilam edilmeyecek hiçbir köşesi yoktur.” (Buhârî, Hac: 59; Nesâî, Menasik: 130) Bu konuda İbn Ömer’den de hadis rivâyet edilmiştir. İbn Abbâs hadisi hasen sahihtir. İlim adamları uygulamalarını bu hadisle yaparlar ve şöyle demişlerdir: “Rükn-ü Yemanî ve Hacer-ül Esved dışındaki Ka’be’nin başka köşeleri istilam edilmez.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 859,
			"arabicnumber": 859,
			"text": "Ya’la b. Ümeyye (radıyallahü anh)’ın babasından rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem) üzerinde bürd denilen çizgili bir ihram olduğu halde sağ omuzu çıplak olarak tavaf yaptı.”(Ebû Dâvûd, Menasik: 49; İbn Mâce, Menasik: 30) Bu hadis Sevrî’nin, İbn Cüreyc’den rivâyetidir bunu sadece onun rivâyetiyle bilmekteyiz ve bu hadis hasen sahihtir. Abdulhamid, Cübeyre b. Şeybenin oğludur, Ya’la ve babasından bildirildiğine göre o; Ya’la b. Ümeyye’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 860,
			"arabicnumber": 860,
			"text": "Âbis b. Rabia (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Ömer b. Hattâb’ı gördüm Hacer-ül Esvedi öpüyor ve şöyle diyordu: “Ben seni öpüyorum ve sadece bir taş olduğunu da biliyorum, Rasûlüllah (sallallahü aleyhi ve sellem)’in seni öptüğünü görmeseydim asla öpmezdim.” (Buhârî, Hac: 60; Nesâî, Menasik: 148) Bu konuda Ebû Bekir ve İbn Ömer’den de hadis rivâyet edilmiştir. Ömer hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 861,
			"arabicnumber": 861,
			"text": "Zübeyr b. Arabî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir adam İbn Ömer’e, Hacer-ül Esved’in istilam edilmesini sordu o da şöyle dedi: “Ben Rasûlüllah (sallallahü aleyhi ve sellem)’i Hacer-ül Esved’i hem öperken hemde istilam ederken gördüm.” Adam dedi ki: “Eğer dar bir yere sıkıştırılırsam ve oraya yaklaşmam engellenirse ne dersin? İbn Ömer bu sorunlardan hoşlanmayıp kızmış olacak ki: “Sen bu soruları Yemen’de bırak! Ben, Rasûlüllah (sallallahü aleyhi ve sellem)’i istilam ederken ve öperken gördüm dedi.” (Buhârî, Hac: 60; İbn Mâce, Menasik: 155) Hammad b. Zeyd, Zübeyr b. Arabî’den rivâyet etmiştir. Zübeyr b. Arabî, Küfeli olup bu Ebû Seleme diye künyelenir. Enes b. Mâlik, Rasûlüllah (sallallahü aleyhi ve sellem)’in başka sahabîlerinden hadis işitmiştir. İlim adamlarından Sûfyân es Sevrî ve başkaları kendisinden hadis rivâyet etmişlerdir. İbn Ömer hadisi hasen sahihtir. Yine İbn Ömer’den değişik şekillerde de bu hadis bize aktarılmıştır. İlim adamları uygulamalarını bu hadise göre yaparlar ve Hacer-ül Esved’i öpmeyi müstehab görürler. İzdiham gibi sebeplerden dolayı yaklaşmak mümkün olmazsa eliyle istilam edip elini öpmesi gerekir. Hacer-ül Esved’e ulaşamadığı zaman onun hizasına geldiği zaman ona döner ve tekbir alır. Şâfii bu görüştedir",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 862,
			"arabicnumber": 862,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), Mekke’ye geldiğinde Ka’be’yi yedi kere tavaf etti ve Bakara sûresi 125. ayetini okudu; “… İbrahim (aleyhis-selâm)’in ibadet ettiği yeri sizde kendinize ibadet yeri edinin…” sonra İbrahim makamının arkasında namaz kıldı. Sonra Hacer-ül Esved’in bulunduğu köşeyi istilam ederek şöyle buyurdu: “Allah’ın başladığı yerden başlayalım.” Sa’y yapmaya safa tepesinden başladı ve bakara sûresi 158. ayetini okudu: “Allah’ın insanlığa sunduğu sembollerden biri de Safâ ile Merve’dir…” (Müslim, Hac: 19; Ebû Dâvûd, Menasik: 56) Bu hadis hasen sahihtir. İlim adamları uygulamalarını bu hadise göre yaparlar. Sa’y yapmaya önce safa tepesinden başlanır. Sa’fa’dan önce Merve’den başlanırsa caiz değildir. Sa’fa’dan başlamak gerekir. yapıp ta sa’y yapmayan kimse hakkında alimler değişik görüşler ortaya koymuşlardır. Bir kısmı: Sa’fa ile Merve arasında sa’y yapmadan Mekke’den çıkan kimse Mekke’ye yakın iken hatırlarsa dönüp Safâ ile Merve arasında sa’y yapmalıdır. Memleketine dönünceye kadar hatırlamazsa haccı caiz olup Kurban kesmesi gerekir. Sûfyân es Sevrî, aynı görüştedir. alimler ise şöyle derler: Safa ile Merve arasındaki Sa’yı terk eder ve ülkesine dönerse haccı geçerli değildir. Şâfii bu görüşte olup şöyle der: Safa ile Merve arasında say yapmak vaciptir, “Hac” ancak onunla geçerlidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 863,
			"arabicnumber": 863,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem)’in Ka’be’de tavaf etmesi ve Safâ ile Merve arasında koşması müşriklere gövde gösterisi yapmak içindi.” (Buhârî, Hac: 80; Ebû Dâvûd, Menasik: 50) Bu konuda Âişe, İbn Ömer ve Câbir’den de hadis rivâyet edilmiştir. İbn Abbâs hadisi hasen sahihtir. İlim adamları Safa ile Merve arasında yapılan sa’yı müstehab görürler. Kişi orada koşamaz ise normal olarak yürümesini bile caiz kabul etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 864,
			"arabicnumber": 864,
			"text": "Kesir b. Cümhan (radıyallahü anh)’den rivâyete göre, şöyle demiştir: İbn Ömer’i Safa ile Merve arasında normal şekilde yürürken gördüm ve kendisine Safâ ile Merve arasında koşmuyor da yürüyor musun? Dedim. Bunun üzerine dedi ki: “Eğer koşarsam Rasûlüllah (sallallahü aleyhi ve sellem)’i koşarken görmüşümdür, eğer yürürsem şunu iyi bil ki Rasûlüllah (sallallahü aleyhi ve sellem)’i yürürken görmüşümdür ve ben yaşlı bir kimseyim.” (Ebû Dâvûd, Menasik: 55; Buhârî, Hac: 80) Bu hadis hasen sahihtir. Saîd b. Cübeyr’de, İbn Ömer’den buna benzer bir hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 865,
			"arabicnumber": 865,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 866,
			"arabicnumber": 866,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 867,
			"arabicnumber": 867,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 868,
			"arabicnumber": 868,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 869,
			"arabicnumber": 869,
			"text": "Câbir b. Abdullah (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem) iki rekatlı tavaf namazında iki ihlas sûresi olan Kâfirûn ve Kulhüvallahû ehad sûrelerini okurdu.” (Nesâî, Menasik, 164; Buhârî, Hac: 69)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 870,
			"arabicnumber": 870,
			"text": "Cafer b. Muhammed (radıyallahü anh)’in babasından rivâyete göre: “O iki rekatlık tavaf namazında Kâfirûn ve İhlas sûrelerini okumayı severdi.” (Nesâî, Menasik, 164; Buhârî, Hac: 69) Bu rivâyet Abdulaziz b. Imrân’ın rivâyetinden daha sahihtir. Cafer b. Muhammed’in babasından rivâyeti babası yoluyla Câbir’in rivâyetinden daha sahihtir. Abdulaziz b. Imrân hadis konusunda zayıf sayılan bir kimsedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 871,
			"arabicnumber": 871,
			"text": "Zeyd b. Üsey’(radıyallahü anh)’den rivâyete göre, şöyle demiştir: Ali’ye sordum; “Hangi talimatla gönderildin diye.” Buyurdular ki: “Dört şey ile gönderildim; Cennete sadece Müslümanlar gireceklerdir, Ka’be çıplak olarak tavaf edilmeyecektir, bu yıldan sonra Hac ve Umre için Ka’be’de Müslümanlarla müşrikler bir araya gelmeyeceklerdir, Rasûlüllah (sallallahü aleyhi ve sellem) ile sözleşmesi olan kimsenin sözleşmesindeki süreye uyulacaktır. Sözleşme ve süresi olmayanların süresi ise dört aydır.” (Buhârî, Hac: 67) Bu konuda Ebû Hüreyre’den de hadis rivâyet edilmiştir. Ali hadisi hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 872,
			"arabicnumber": 872,
			"text": "İbn Ömer ve Nasr b. Ali (radıyallahü anhüma) dediler ki: Sûfyân b. Uyeyne, Ebû İshâk’tan naklederek bu hadisin bir benzerini bize aktarmıştır. Ebû Ömer ve Nasr b. Ali derler ki: Zeyd b. Yüsey’ derler ki: Bu hadis daha sahihtir. Şu’be bu konuda vehme kapılarak bu ismi “Zeyd b. Üseyl” demektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 873,
			"arabicnumber": 873,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) benim yanımdan gönlü hoş ve sevinç içerisinde çıktı sonra üzüntülü bir şekilde bana döndü. Bunun üzerine üzüntüsünün sebebini sordum. Buyurdular ki: Ben Ka’be’ye girdim keşke bunu yapmasaydım ileride onlarda bunu yapmak isterler ve onlara zorluk çıkarmış olacağımdan dolayı korkarım.” (İbn Mâce, Menasik: 79; Nesâî, Menasik: 126) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 874,
			"arabicnumber": 874,
			"text": "Bilâl (radıyallahü anh)’den rivâyet edildiğine göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Ka’be içerisinde namaz kıldı.” İbn Abbâs: “Namaz kılmadı fakat tekbir aldı” diyor. (Nesâî, Menasik: 131; Buhârî, Hac: 52) Bu konuda Üsâme b. Zeyd, Fadl b. Abbâs, Osman b. Talha ve Şeybe b. Osman’dan da hadis rivâyet edilmiştir. Bilâl hadisi hasen sahihtir. Pek çok ilim adamları uygulamalarını bu hadisle yapmakta olup; Ka’be içerisinde namaz kılmakta bir sakınca görmezler. b. Enes der ki: Ka’be’nin içerisinde nafile namaz kılmakta bir sakınca yoktur, Ka’be içerisinde farz namaz kılmayı hoş karşılamam. der ki: Ka’be içerisinde farz namaz kılmakta bir sakınca yoktur. Çünkü abdest ve kıble konusunda farz namazla nafile namazın durumu aynıdır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 875,
			"arabicnumber": 875,
			"text": "Esved b. Yezîd (radıyallahü anh)’den rivâyete göre, İbn Zübeyr ona dedi ki: Müminlerin anası Âişe’nin sana anlattığı hadislerden bana biraz aktar. Esved dedi ki: Âişe, Rasûlüllah (sallallahü aleyhi ve sellem)’in O’na şöyle buyurduğunu nakletti: “Senin bu toplumun cahiliyye döneminden yeni çıkmış olmasalardı Ka’be’yi yıkar ve iki kapı yaptırırdım.” (Buhârî, Hac: 42; Müslim, Hac: 70) İbn Zübeyr, halife olunca Ka’be’yi yıktırdı ve iki kapı yaptırdı. Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"text": "Âişe (radıyallahü anha)’dan rivâyet edildiğine göre, şöyle demiştir: Ka’be’ye girmeyi ve orada namaz kılmayı çok arzu ederdim. Rasûlüllah (sallallahü aleyhi ve sellem) elimden tutarak beni Hıcr denilen yere soktu ve şöyle buyurdu: “Ka’be’ye girmek istiyorsan Hıcr’de namaz kıl çünkü orası Ka’be’den bir parçadır. Kavmin, Ka’be’yi yaparken malzeme eksikliğinden dolayı Hıcr’ı Ka’be’den ayırdılar ve ayrı bir yer haline getirdiler.” (Buhârî, Hac: 42; Müslim, Hac: 70) Bu hadis hasen sahihtir. Alkame b. ebî Alkame; Alkame b. Bilâl’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyet edildiğine göre Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Hacer-ül Esved, sütten daha beyaz olarak Cennet’ten inmişti, ademoğullarının hataları onu kararttı.” (Buhârî, Hac: 50; Nesâî, Hac: 145) Bu konuda Abdullah b. Amr ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. İbn Abbâs hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "Abdullah b. Amr’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim şöyle diyordu: “Rükün ve makam Cennetin yakutlarından iki yakuttur ki Allah onların nurunu almıştır. Eğer onların nurunu almamış olsaydı onlar doğu ile batı arasını aydınlatırlardı.” (Tirmizî rivâyet etmiştir.) Bu hadis Abdullah b. Amr’dan mevkuf yani kendi sözü olarak rivâyet ediliyor. Aynı konuda Enes’den de rivâyet olup garib hadistir",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) Arafat’a çıkmazdan önce Minâ’da bize öğle, ikindi, akşam, yatsı ve sabah namazlarını kıldırdı ve sonra Arafat’a yürüdü.” (Tirmizî rivâyet etmiştir.) İsmail b. Müslim’in hafızası konusunda söz edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"text": "Yine İbn Abbâs (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Minâ’da sabahı ve öğleyi kıldı sonra Arafat’a yürüdü.” (Tirmizî rivâyet etmiştir.) Bu konuda Abdullah b. Zübeyr ve Enes’den de hadis rivâyet edilmiştir. Mıksem’in İbn Abbâs’tan rivâyetine gelince; Ali b. el Medînî, Yahya vasıtasıyla Şu’be’den naklederek şöyle diyor. Hakem Mıksem’den sadece beş hadis işitmiştir. Şu’be’den bu beş hadisi saydı bu hadis onun saydıkları arasında değildi",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "Âişe (radıyallahü anha)’dan rivâyet edildiğine göre, şöyle demiştir: Ey Allah’ın Rasûlü! Minâ’da seni gölgelendirecek bir şey yapalım mı? dedik. Şöyle buyurdular: “Hayır Minâ; Önce gelenin devesini çökerteceği yerdir. Yerleşim yeri değildir.” (Ebû Dâvûd, Menasik: 86; İbn Mâce, Menasik: 52) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "Hârise b. Vehb (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “İnsanların güven içinde ve en kalabalık oldukları bir anda Minâ’da namazları iki rekat olarak kıldım.” (Ebû Dâvûd, Menasik: 76; Buhârî, Hac: 84) Bu konuda İbn Mes’ûd, İbn Ömer ve ve Enes’den de hadis rivâyet edilmiştir. Hârise b. Vehb hadisi hasen sahihtir. Mes’ûd’un şöyle dediği rivâyet olunmuştur: Peygamber (sallallahü aleyhi ve sellem) zamanında Ebû Bekir döneminde Ömer döneminde ve Osman’ın halifeliğinin başlarında Minâ’da namazları onlarla beraber iki rekat olarak kıldım. Minâ’da namazları kısaltmalarında alimler değişik görüşler ortaya koymuşlardır. Bir kısmı: “Mekkeliler için namazı kısaltmak yoktur ancak yolcu olanlar kısaltabilirler” demekte olup, İbn Cüreyc, Sûfyân es Sevrî, Yahya b. Saîd el Kattan, Şâfii, Ahmed ve İshâk bu görüşte olanlardandır. Diğer bir kısmı ise: “Mekkelilerin de Minâ’da namazlarını kısaltmalarında bir sakınca yoktur” derler. Evzâî, Mâlik, Sûfyân b. Uyeyne, Abdurrahman b. Mehdî’de bu görüşe sahip olanlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "Yezîd b. Şeyban (radıyallahü anh)’den rivâyete göre, şöyle demiştir: İbn Mirba’ el Ensarî biz Arafat’ta iken yanımıza geldi, Biz Amr’ın vakfe yerinden uzak saydığı bir yerde idik ve şöyle dedi. “Ben Rasûlüllah (sallallahü aleyhi ve sellem)’in size gönderdiği elçisiyim o size “İbadet yerleriniz neresi ise orada bulunun çünkü siz atanız İbrahim (aleyhis-selâm)’dan kalma bir miras üzerindesiniz.” (Ebû Dâvûd, Menasik: 62; Buhârî, Hac: 87) Bu konuda Ali, Âişe, Cübeyr b. Mut’ım ve Şerid b. Süveyd es Sekafî’den de hadis rivâyet edilmiştir. İbn Mirba’ el Ensarî hadisi hasen sahihtir. Bu hadisi sadece İbn Uyeyne’nin Amr b. Dinar’dan, yaptığı rivâyetle bilmekteyiz. İbn Mirba’nın ismi Yezîd b. Mirba’ el Ensarî’dir. Onun rivâyeti olarak tek bir hadis bilinmektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Kureyş ve Kureyş’in dini üzerinde olanlar ki onlar Ahmesî’ler yani Humus’lerdir. Müzdelife’de vakfe yaparlar ve biz Allah’ın evinin sakinleriyiz derlerdi. Onların dışındakiler ise Arafat’ta vakfeye dururlardı. Bunun üzerine Allah Bakara 199. ayetini indirdi: “Sonra sizler de dalga dalga ilerleyen öteki insanlarla birlikte ilerleyin…” (Buhârî, Hac: 92; Müslim, Hac: 46) Bu hadis hasen sahihtir. Bu hadisin anlamı şudur. Mekkeliler harem sınırları dışına çıkmazlardı. Arafat bölgesi ise harem bölgesi dışında sayılırdı. Bu yüzden Mekkeli olduklarını söyleyenler Müzdelife’de vakfe yaparlar ve “Biz, Allah’ın evinin sakinleriyiz” derlerdi. Mekkelilerin dışındakiler ise Arafat’ta vakfe yaparlardı. Bu yüzden Allah bu ayrıcalığı kaldırmak üzere “Hepiniz de dalga dalga ilerleyen diğer insanlarla birlikte ilerleyin…” ayetini indirmişti. ve Ahmesî’ler harem bölgesi insanları demektir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "Ali b. ebî Tâlib (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), Arafat’ta vakfe yaptı ve şöyle buyurdu: “Burası Arafattır, burası vakfe yapılacak yerdir. Arafat bölgesinin tamamı vakfe yeridir.” Sonra güneş batınca oradan ayrılmak için hareket etti. Üsâme b. Zeyd’i binitinin arkasına aldı. Eli ile insanlara işaret ediyordu, insanlar büyük kalabalıklar halinde sağa sola çalkalanıyorlardı, onlara bakıp; “Ey insanlar sükunetli olun” diyordu. Sonra hep birlikte denilen Müzdelife’ye gelerek iki vakit namazını bir anda birlikte kıldırdı. Sabah olunca “Kuzah” denilen yere geldi ve orada vakfe yaptı ve şöyle buyurdu: “Burası Kuzah’tır ve vakfe yapılacak yerdir Cem’in yani Müzdelife’nin tamamı vakfe yapılacak yeridir.” Sonra ilerledi Muhassir vadisine varınca devesini kamçıladı ve o bölgeden hızlıca geçti Muhassir vadisini geçince durdu. Fadl b. Abbâs’ı binitinin arkasına aldı sonra şeytan taşlama yerine gelerek taş attı. sonra kurban kesme yerine geldi ve şöyle buyurdu: “İşte burası kurban kesme yeridir. Minâ’nın tamamı kurban kesme yeridir.” Has’am kabilesinden genç bir kız fetva almak üzere Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek: “Babam yaşlı bir kimse olup kendisine Hac farz olmuştur. Onun yerine haccetmem caiz midir?” diye sordu. Rasûlüllah (sallallahü aleyhi ve sellem) “Babanın yerine haccet” buyurdular. Bu esnada binitinin arkasında bulunan Fadl’ın boynunu geri tarafa çeviren Rasûlüllah (sallallahü aleyhi ve sellem)’e Abbâs sormuştu: “Amca oğlunun boynunu niçin geri çevirdin” diye. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): “Fetva sormaya gelen genç delikanlı kız ve binitinin arkasında genç delikanlı erkek bunların birbirlerine bakmaları sonucunda şeytanın bir zarar verebileceğinden emin olmak için” buyurdular. bir adam daha geldi: “Ey Allah’ın Rasûlü ben tıraş olmadan haccın tavafını yapıvermişim ne olacak” deyince; Rasûlüllah (sallallahü aleyhi ve sellem): “Tıraş oluver veya saçını kısaltıver zararı yoktur” buyurdular. Başka bir adam gelerek: “Ey Allah’ın Rasûlü, şeytanı taşlamadan önce kurbanı kesivermişim ne olacak? Dedi. Rasûlüllah (sallallahü aleyhi ve sellem) de: “Şeytana taş atıver zararı yoktur.” buyurdular. Rasûlüllah (sallallahü aleyhi ve sellem) Ka’be’ye gelerek tavaf etti sonra zemzem kuyusuna geldi ve: “Ey Abdulmuttalib oğulları insanlar zemzem çekmek için sizi sıkıntıya sokmayacaklarını bilseydim bende bu kuyudan su çekerdim” buyurdular. (Ebû Dâvûd, Menasik: 62; İbn Mâce Menasik: 55) Bu konuda Câbir’den de hadis rivâyet edilmiştir. Ali hadisi hasen sahihtir ve sadece bu şekliyle Abdurrahman b. Hâris b. Ayyaş’ın rivâyetiyle bilmekteyiz. çok kimse bu hadisi Sevrî’den aynı şekilde rivâyet etmişlerdir. İlim adamları bu hadisle amel ederler ve: “Arafat’ta öğle ve ikindi namazlarını öğle vaktinde kılınması görüşündedirler. ilim adamları ise: “Kişi cemaate katılmaz da kendi çadırında kılar ise aynen imamın yaptığı gibi iki namazı bir vakitte cem eder” demektedirler. b. Ali Ebû Tâlib’in oğlu, Ali’nin oğlu Hüseyin’in oğludur. (Allah’ın selamı hepsinin üzerinde olsun)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, “Rasûlüllah (sallallahü aleyhi ve sellem), Muhassir vadisinde devesini hızlıca koşturdu.” Bişrin rivâyetinde şu fazlalık vardır. “Müzdelifede huzur ve sükûnetle geçti insanlara da huzur ve sükûnet içersinde olmalarını emretti.” Nuaym’ın rivâyetinde de şu fazlalık yer alır: “Şeytan taşlamayı fiske taşı büyüklüğündeki taşlarla taşlamayı emretti ve belki de bu yıldan sonra sizi tekrar göremem” buyurdu. (İbn Mâce, Menasik: 58; Buhârî, Hac: 93) Bu konuda Üsâme b. Zeyd’den de hadis rivâyet edilmiştir. Câbir hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "Abdullah b. Mâlik (radıyallahü anh)’den rivâyete göre, İbn Ömer, Müzdelife’de bir kametle iki namazı bir arada kıldı ve “Rasûlüllah (sallallahü aleyhi ve sellem)’in aynı yerde aynı şekilde yaptığını gördüm” dedi. (Buhârî, Hac: 96; Nesâî, Menasik: 190)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "Saîd b. Cübeyr ve İbn Ömer’den de bu hadisin benzeri rivâyet edilmiştir. Muhammed b. Beşşâr, Yahya’dan diyerek rivâyet etmektedir. Doğrusu Sûfyân’ın rivâyet ettiği hadistir. Bu konuda Ali, Ebû Eyyûb, Abdullah b. Saîd, Câbir, Üsâme b. Zeyd’den de hadis rivâyet edilmiştir. İbn Ömer hadisinin Sûfyân’dan rivâyeti, İsmail b. ebî Hâlid’in rivâyetinden daha sahih olup Sûfyân hadisi sahih hasendir. İlim adamları bu hadisle amel ederler akşam namazı Müzdelife’ye gelmeden kılınmaz Müzdelifeye gelince iki namazı bir arada tek kametle kılmak gereklidir ve iki namaz arasında da nafile namaz kılınmaz ilim adamlarından bir kısmının tercihleri böyledir. Sûfyân es Sevrî bunlardan olup şöyle der: “Dilerse akşam namazını kılar yemeğini yer biraz istirahat edip kamet getirir ve yatsı namazını kılar.” Bazı ilim adamları ise: “Akşam ile yatsı namazını Müzdelife’de bir ezan ve iki kametle bir arada kılar.” Yani akşam namazı için ezan okur kamet getirir akşamı kılar sonra tekrar kamet getirip yatsıyı kılar. Şâfii’nin görüşü böyledir. İbn Ömer ve Saîd b. Cübeyr hadisi hasen sahihtir. Seleme bin Küheyl Said b. Cübeyr’den rivâyet etmektedir. İshâk ise; Mâlik’in oğullarından Abdullah ve Hâlid vasıtasıyla İbn Ömer’den rivâyet etmiştir",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "Abdurrahman b. Ya’mer (radıyallahü anh)’den rivâyet edildiğine göre; Rasûlüllah (sallallahü aleyhi ve sellem) Arafat’ta iken Necidlilerden bazı kimseler O’na gelip hac hakkında sordular. Rasûlüllah (sallallahü aleyhi ve sellem)’de bir kimseyi görevlendirip şöyle ilan ettirdi: “Hac Arafat’tır her kim Müzdelife’de bulunması gereken gece gün aydınlanmadan önce gelip orada bulunursa hacca yetişmiş olur. Minâ’da kalma süresi üç gündür acele edip memleketine dönüş için iki gün kalan günahkar sayılmaz üç günden fazla kalan da yine günahkar olmaz. Muhammed b. Beşşâr dedi ki: Yahya’nın rivâyetinde şu ilave vardır. “Bir adamı bu iş için görevlendirdi de o da bunu duyurdu.” (Ebû Dâvûd, Menasik: 68; Nesâî, Menasik 203)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "Yine Abdurrahman b. Ya’mer (radıyallahü anh)’den manâca önceki hadisin bir benzeri daha rivâyet edilmiş olup İbn ebî Ömer, Sûfyân b. Uyeyne’den naklederek: “Bu hadis Sûfyân es Sevrî’nin rivâyet ettiği hadislerin en sağlamıdır” der. (sallallahü aleyhi ve sellem)’in ashabından ve sonraki gelen kimselerin uygulamaları bu hadis üzeredir. Yani gün ağarmadan önce Arafat’ta bulunmayan kişi haccı kaçırmış demektir. Gün ağarmasından sonra gelmesi hac görevi için yeterli sayılmaz. O yaptığı umre olmuş olur bir sonraki yıl tekrar hac yapması gerekir. Sevrî, Şâfii, Ahmed ve İshâk bu görüştedirler. Şu’be’de Bükeyr b. Atâ’dan, Sevrî’nin rivâyetine benzer bir hadis rivâyet etmiş olup, şöyle demiştir: Carûd’tan işittim o da Vekî’den işittiğini söyledi. Vekî’ bu hadisi aktardıktan sonra: “Hacla alakalı vazifelerin anası bu hadistir” demiştir",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "Urve b. Mudarris b. Evs b. Hârise b. Lâm’in et Taî’den rivâyet edildiğine göre, şöyle demiştir: “Müzdelife’de namaza çıkacağı sırada Rasûlüllah (sallallahü aleyhi ve sellem)’e geldim ve Şöyle dedim: Ey Allah’ın Rasûlü, Tayyi denilen bölgenin iki dağı arasından geliyorum hayvanımı da yordum kendim de yoruldum üzerinde durmadığım bir dağ bırakmadım. Benim haccım olur mu?” Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: “Bizim kılacağımız şu sabah namazına katılan burayı terk edinceye kadar bizimle beraber olan bundan öncede gece veya gündüzden bir an bile olsa Arafat’ta bulunan kimse hac vazifesini yapmış ve haccını tamamlamış sayılır.” (Ebû Dâvûd, Menasik: 68; Nesâî, Menasik: 211) Bu hadis hasen sahihtir. Hadiste geçen Tefesehu: Kelimesinin anlamı hacla ilgili vazifeler demektir. “Habelün” kumluk arazi “Cebelün” ise taşlık yerler demektir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 896,
			"arabicnumber": 896,
			"text": "Ebû İshâk (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Amr b. Meymun’dan işittim şöyle diyordu: Biz, Müzdelife’de vakfe’de iken Ömer b. Hattâb dedi ki: “Müşrikler güneş doğuncaya kadar Müzdelife’den ayrılmazlar ve ey sebir dağı güneşin ışıklarıyla aydınlan da biz Minâ’ya hareket edelim derlerdi. Rasûlüllah (sallallahü aleyhi ve sellem) onlara uymadı ve güneş doğmadan önce Minâ’ya hareket etti, Ömer’de güneş doğmadan hareket etti.” (Buhârî, Hac: 101; Nesâî, Menasik: 213) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "Abdurrahman b. Yezîd (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Abdullah b. Mes’ûd, Akabe cemresi denilen yere gelince vadinin orta yerinde durdu, Ka’be’ye yönelerek cemreyi sağ kaşı hizasına aldıktan sonra yedi taş attı. Her taş atışında tekbir getirdi ve şöyle dedi: Kendisinden başka gerçek ilah olmayan Allah’a yemin ederim ki kendisine Bakara sûresi indirilen Rasûlüllah (sallallahü aleyhi ve sellem)’de; taşları buradan atmıştır.” (Nesâî, Menasik: 226; İbn Mâce, Menasik: 64)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem), deve süren bir adam gördü ve ona “deveye bin” dedi. Adam: “Ey Allah’ın Rasûlü bu kurban edilmek üzere ayrılmış bir hayvandır” dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), üçüncü veya dördüncüsünde “Yazık sana deveye bin yazıklar olsun” buyurdular. (İbn Mâce, Menasik: 100; Ebû Dâvûd, Menasik: 17) Bu konuda Ali, Ebû Hüreyre ve Câbir’den de hadis rivâyet edilmiştir. Enes hadisi hasen sahihtir. Peygamber (sallallahü aleyhi ve sellem)’in ashabından ve daha sonraki dönem alimlerin bir kısmı ihtiyaç duyulduğu takdirde kurbanlık develere binilebileceğine izin vermişlerdir. Şâfii, Ahmed ve İshâk bunlardandır. Kimi ilim adamları da “Mecburiyet olmadıkça binilmesin” derler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Peygamber (sallallahü aleyhi ve sellem), şeytanı taşlayınca kurbanını kesti sonra tıraş olmak için berbere başının sağ yanını uzattı kesilen saçı Ebû Talha’ya verdi sonra sol yanını uzatıp tıraş oldu ve kesilen saçını Müslümanlar arasında dağıt” buyurdu. (Buhârî, Hac: 128; Müslim, Hac: 56)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "Abdullah b. Amr (radıyallahü anh)’den rivâyete göre, bir adam, Rasûlüllah (sallallahü aleyhi ve sellem)’e kurban kesmeden tıraş oluverdim diye sordu. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem); “Kurbanını kes zararı yok” buyurdular. Bir diğer kimse: Şeytanı taşlamadan önce kurban kestim, diye sordu. “Şeytanı taşla zararı yok” buyurdular. (Ebû Dâvûd, Hac: 87; İbn Mâce, Menasik: 74) Bu konuda Ali, Câbir, İbn Abbâs, İbn Ömer, Üsâme b. Şerik’den de hadis rivâyet edilmiştir. Abdullah b. Amr hadisi hasen sahihtir. İlim adamlarının çoğunluğu uygulamalarını bu hadisle yaparlar, Ahmed ve İshâk bunlardandır. kısım ilim adamları ise: “Bir kimse Hac ibadetlerinde birini diğerinden önce yaparsa kurban kesmesi gerekir” derler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"text": "Sâib b. Yezîd (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Babam, Veda haccında Rasûlüllah (sallallahü aleyhi ve sellem) ile beraber bana hac yaptırdı ve ben o anda yedi yaşındaydım.” (İbn Mâce, Menasik: 11; Ebû Dâvûd, Menasik: 7) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"text": "Câbir b. Abdillah (radıyallahü anh)’den Muhammed b. Tarîf’in hadisinin bir benzeri rivâyet edilmiştir. Muhammed b. Münkedir’den bu hadis mürsel olarak rivâyet edilmiştir. İlim adamları, küçük yaşta hacceden çocuğa büyüyünce haccetmesi gerektiği görüşünde ittifak etmişlerdir. İslamın emri olan hac yerine getirilmiş olmaz. Aynı şekilde köle de köleliği esnasında hacceder sonra da hürriyetine kavuşturulursa ileride haccetme imkanı bulursa haccetmesi gerekir. Köleliği esnasında yaptığı hac farz olacak olan haccın yerine geçmez. Sûfyân es Sevrî, Şâfii, Ahmed ve İshâk‘ta bu görüştedirler",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 927,
			"arabicnumber": 927,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) ile haccettiğimizde kadınların yerine telbiye getirir ve çocukların yerine de şeytan taşlardık.” (İbn Mâce, Menasik: 68) Bu hadis garibtir, hadisi sadece bu şekliyle bilmekteyiz. İlim adamları kadının yerine başkasının telbiye getiremeyeceği üzerinde ittifak etmişlerdir. Kadın kendisi telbiye getirmelidir, telbiye getirirken yüksek sesle getirmesi mekruhtur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "Abdullah b. Büreyde (radıyallahü anh)’ın babasından rivâyete göre: “Bir kadın Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek, annem hac yapmadan öldü onun yerine haccedebilir miyim? Diye sordu. Rasûlüllah (sallallahü aleyhi ve sellem)’de “evet onun yerine hac yap” buyurdular. (Buhârî, Cezaüs Sayd: 33; İbn Mâce, Menasik: 9) hadis sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "Ebû Rezîn el Ukaylî’den rivâyete göre, kendisi Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek “Ey Allah’ın Rasûlü! Babam çok yaşlıdır, hac ve umre yolculuğuna gücü yetmez” dedi. Rasûlüllah (sallallahü aleyhi ve sellem)’de: “Babanın yerine hac ve umre yapıver” buyurdular. (İbn Mâce, Menasik: 10; Buhârî, Cezaüs Sayd: 34) Bu hadis hasen sahihtir. Bu hadiste umrenin zikredilmesi bir başkası adına umre yapılabileceğini göstermek içindir. Rezîn el Ukaylî’nin adı Lakît b. Âmir’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "Abdurrahman b. ebî Bekir (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Abdurrahman b. ebî Bekir’e emrederek Âişe (radıyallahü anha)’yı Ten’ım’de ihrama girdirip umre yaptırmasını emretti.” (Buhârî, Umre: 6; Müslim, Hac: 17) (Bu tür umre yapmak adet hali gören kadınlar için geçerlidir herkesin fazladan umre yapması için bir model değildir. Bu gün hacca ve umreye gidenlerin üç beş sekiz umre yapıverdim demelerinin Peygamber (sallallahü aleyhi ve sellem) sünnetinde bir yeri yoktur.) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "Muharriş el Ka'bî (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Ci'rane’den umreye niyet ederek geceleyin çıktı. Mekke’ye geceleyin girdi umresini yaptı aynı gece Mekke’den çıkarak Ci'rane’de sabahladı sanki geceyi orada geçirmiş gibi ertesi gün güneş batıya kayınca, Batnı Serif bölgesinden çıktı. Yolu; Batnı Serif’den, Müzdelife yolunu takip ederek gitti bundan dolayı yaptığı umre insanlara gizli kaldı.” (Ebû Dâvûd, Menasik: 79; Nesâî, Menasik: 104) Bu hadis garibtir. Muharriş el Ka'bî’nin bu hadisten başka bir rivâyetini bilmiyoruz. Bu rivâyette mevsul yolla gelmiş olabilir denilmektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "Urve (radıyallahü anh)’den rivâyete göre, şöyle demiştir: İbn Ömer’e; “Rasûlüllah (sallallahü aleyhi ve sellem) hangi ayda umre yapmıştır” diye soruldu. Recep ayında diye cevap verdi. Bunun üzerine Âişe (radıyallahü anha) şöyle dedi: “Rasûlüllah (sallallahü aleyhi ve sellem) her umre yaptığında İbn Ömer onun yanında bulunmuştur, Rasûlüllah (sallallahü aleyhi ve sellem); Recep ayında asla umre yapmamıştır.” (İbn Mâce, Menasik: 47) Bu hadis garibtir. Muhammed’den şöyle dediğini işittim: Habib b. ebî Sabit Urve b. Zübeyr’den hadis işitmemiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyet edilmiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), dört umre yaptı onlardan biri recep ayında idi.” (Buhârî, Umre: 3; İbn Mâce, Menasik: 47) Bu hadis hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"text": "Berâ b. Âzıb (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), Zilkade ayında umre yapmıştı.” (Buhârî, Umre: 3; İbn Mâce, Menasik: 46) Bu hadis hasen sahihtir. Bu konuda İbn Abbâs’tan da hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "Ümmü Ma'kıl (radıyallahü anha)’dan rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Ramazan ayında yapılan umre hacca bedeldir.” Yani hac gibi sevâb kazandırır. (Ebû Dâvûd, Menasik: 79; İbn Mâce, Menasik: 45) konuda İbn Abbâs, Câbir, Ebû Hüreyre, Enes ve Vehb b. Hanbeş’den de hadis rivâyet edilmiştir. Vehb b. Hanbeş’e; Herem b. Hanbeş’te denilir. ve Câbir rivâyetlerini Şa'bi ve Vehb b. Hanbeş’den diyerek yaparlar. Dâvûd el Evdî ise: Şa'bi ve Harem b. Hanbeş’den diyerek rivâyet ederler. Fakat doğru olan: “Vehb b. Hanbeş” şeklindedir. Ma'kıl hadisi bu şekliyle hasen garibtir. ve İshâk diyorlar ki: Ramazanda yapılan umrenin bir hacca denk sevap kazandırdığı Rasûlüllah (sallallahü aleyhi ve sellem)’den sabit olmuştur. ise şöyle der: Bu hadisin manası şöyle anlaşılmalıdır. Peygamberimizden rivâyet edilen; “Kim ihlas sûresini okursa Kur’ân’ın üçte birini okumuş gibi olur” hadisi gibi anlaşılmalıdır. Yani üç ihlas okumakla Kur’ân’ın tamamı okunmuş olmayacağı gibi Ramazanda umre yapmakla da hac yapılmış sayılmaz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "İkrime (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Haccac b. Amr, Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle dediğini bize aktarmıştır: “Kimin bir organı kırılır, sakatlanır ve hastalanır da o yıl hac yapamaz ise bir sonraki yıl hac yapması gerekir.” İkrime dedi ki: Ben bu hadisi İbn Abbâs ve Ebû Hüreyre’ye sordum râvîlerden Haccac es Savvaf doğru söylemiştir. Dediler. (Ebû Dâvûd, Menasik: 43; İbn Mâce, Menasik: 85)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Zübeyr’in kızı Dubaa, Peygamber (sallallahü aleyhi ve sellem)’e gelerek şöyle dedi: “Ey Allah’ın Rasûlü! Ben haccetmek istiyorum niyetimle şart koşabilir miyim? Rasûlüllah (sallallahü aleyhi ve sellem) de; “Evet” dedi. Dubaa: “Nasıl söylemeliyim” deyince; “Lebbeyk Allah’ım lebbeyk bulunduğum yerden başlayarak beni alıkoyacağın yer ve zamana kadar” de buyurdular. (Müslim, Hac: 15; Nesâî, Menasik: 60) Bu konuda Câbir, Esma binti ebî Bekir ve Âişe’den de hadis rivâyet edilmiştir. İbn Abbâs hadisi hasen sahihtir. İlim adamlarından bir kısmı uygulamalarını bu hadisle yaparlar. Şartlı olarak hac yapılabileceği görüşündedirler ve şöyle derler: Şart koşar ve bir hastalık veya engel ortaya çıkarsa o anda ihramdan çıkabilir. Şâfii, Ahmed ve İshâk bu görüştedirler. ilim adamları ise şartlı hac yapılamaz demekte ve “Şart koşsa da ihramından çıkamaz” diyerek bu kimsenin de normal hac yapan kimse gibi kabul etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "Sâlim (radıyallahü anh)’in babasından rivâyete göre, Sâlim; Hacca giderken şart koşmayı hoş karşılamaz ve derdi ki: “Peygamber (sallallahü aleyhi ve sellem)’in sünneti size yeterli değil midir? (Yani o yapmış mıdır diyerek böyle bir hadisten haberi olmadığını ortaya koymuş oldu) (Nesâî, Menasik: 59; Müslim, Hac: 15) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: “Hac günlerinde hayız gördüm. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), Ka’be’yi tavaf etmek dışında tüm gerekenleri yapmamı bana emretti.” (Buhârî, Hayz: 8; Müslim, Hac: 67) İlim adamları uygulamalarını bu hadisle yaparlar yani: “Hayızlı kadın tavaf dışında haccın tüm gereklerini yerine getirir.” hadis aynı şekilde Âişe’den başka yönden de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "Ziyâd b. Eyyûb, Mervan b. Şûca' el Cezerî; Husayf, İkrime, Mûcâhid, Atâ ve İbn Abbâs’tan, Rasûlüllah (sallallahü aleyhi ve sellem)’e nispet ederek şu hadisi bize aktarmışlardır: “Doğum yapan ve hayızlı kadın guslederek ihrama girer hacla alakalı tüm yapılacakları yapar sadece temizleninceye kadar Ka’be’yi tavaf edemez. Bu hadis bu yönüyle garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "Hâris b. Abdullah b. Evs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem)’den işittim şöyle diyordu: “Her kim hac ve umre yaparsa son yapacağı vazifesi Beytullahı tavaf etmek olsun.” Bunun üzerine Ömer dedi ki: “Yaptığın şeyle ellerin kırılsın bunu Peygamber (sallallahü aleyhi ve sellem)’den işittin de bize haber vermedin öyle mi?” (Ebû Dâvûd, Menasik: 85; Müslim, Hac: 67) Bu konuda İbn Abbâs’tan da hadis rivâyet edilmiştir. Hâris b. Abdullah b. Evs hadisi garibtir. Pek çok kimse bu hadisi Haccac b. Ertae’den buradaki gibi rivâyet etmişlerdir. Rivâyetlerin bazısının senedinde Haccac’a aykırı rivâyetle bulunulmuştur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem), bir ihram ve bir niyet ile Haccı Kıran yaptı hac ve umresi için tek bir tavaf yaptı.” (Nesâî, Menasik: 144; Ebû Dâvûd, Menasik: 53) konuda İbn Ömer ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Câbir hadisi hasen sahihtir. Sahabe ve tabiinden bazı ilim adamları uygulamalarını bu hadisle yaparlar ve derler ki: Haccı Kıran yapan kimse umresi ve haccı için tek tavaf yapar. Şâfii, Ahmed ve İshâk bu görüştedir. Sahabe ve tabiin döneminden bazı ilim adamları ise: “İki tavaf ve iki sa'y yapar” derler. Sûfyân es Sevrî ve Küfelilerin görüşü böyledir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her kim hac ve umreyi bir niyetle yapmaya niyet eder ve ihrama girerse ihramdan çıkıncaya kadar her ikisi için de bir tavaf ve bir sa'y yapması yeterlidir.” (İbn Mâce, Menasik: 39; Buhârî, Hac: 77) Bu hadis hasen sahih garibtir. Pek çok kişi bu hadisi Ubeydullah b. Ömer’den rivâyet ediyor ve hadisin senedini Rasûlüllah (sallallahü aleyhi ve sellem)’e kadar ulaştırmıyorlar ki. O rivâyet daha sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 949,
			"arabicnumber": 949,
			"text": "Alâ b. Hadramî (radıyallahü anh)’den merfu olarak rivâyet edildiğine göre: (Mekke fethedilmeden önce) “Medîne’ye hicret edip de hac yapan kimseler hac ibadetlerini bitirdikten sonra Mekke’de üç gün kalabilirler.” (Müslim, Hac: 81) Bu hadis hasen sahihtir. sened ile başka şekilde de merfu olarak rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) bir savaştan veya hacdan veya bir umreden dönüşünde bir dağ eteğine veya bir bayıra çıktığında üç defa tekbir alır ve şöyle dua ederdi: “Allah’tan başka gerçek ilah yok tek olarak O var, O’nun ortağı yok, mülk ve saltanat onundur. Her türlü eksiksiz övgüler ona mahsustur ve onun her şeye gücü yeter. Allah’a döneriz daima tevbe eder, kulluğumuzu daima ona yaparız. Seyahat edenler, secde edenler! Rabbimize hamd edenleriz. Allah verdiği sözde doğru ve gerçekleştirendir. Kuluna yardım eden ve tek başına tüm küfür ordularını yok edendir.” (Buhârî, Cihad: 132; Müslim, Hac: 76) konuda Berâ, Enes ve Câbir’den de hadis rivâyet edilmiştir. İbn Ömer hadisi hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 951,
			"arabicnumber": 951,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) ile beraber bir yolculukta idik ihramlı iken deveden düşüp boynu kırılarak ölen bir adam gördü ve şöyle buyurdu: “Onu su ve sidr ile yıkayın iki parça olan ihramıyla kefenleyin başını da örtmeyin çünkü o kıyamet günü ihramlı olarak ve telbiye getirerek diriltilecektir.” (Buhârî, Cezaus Sayd: 31; Müslim, Hac: 14) Bu hadis hasen sahihtir. Bazı ilim adamları uygulamalarını bu hadisle yaparlar. Sûfyân es Sevrî, Şâfii, Ahmed ve İshâk bunlardandır. Bazı ilim adamları ise: İhramlı kimse ölünce ihramın geçerliliği kalmaz ihramlı olmayan kimseye yapılan işlemler yapılır, derler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "Nübeyh b. Vehb (radıyallahü anh)’den rivâyete göre, Ömer b. Ubeydullah b. Ma'mer ihramlıyken gözlerinden rahatsızlandı ve Ebân b. Osman’a sordu o da: Acı olan göz tedavisinde kullanılan sabır çekinmesini (sürme çeker gibi) tavsiye etmiş ve Osman b. Affân’ın bu durumu Rasûlüllah (sallallahü aleyhi ve sellem)’den bize aktardığını bildirmiştir. Rasûlüllah (sallallahü aleyhi ve sellem) gözünden rahatsız olana “sabır çekmesini” emretmişti. (Müslim, Hac: 12) Bu hadis hasen sahihtir. İlim adamları uygulamalarını bu hadisle yaparlar ve ihramlının içersinde güzel koku bulunmayan herhangi bir ilaçla tedavi görmesinde bir sakınca görmezler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "Ka'b b. Ucre (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem) Hudeybiye’de Mekke’ye girmeden önce ihramlıyken tencere altında ateş yakarken ve bitler yüzüne dökülürken ona uğradı ve “Başındaki haşereler sana zarar vermiyor mu? Ka'b: “Evet” dedi. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem); “Tıraş ol, altı fakire bir farak sadaka ver. -Farak üç ölçek hububat alan bir ölçü birimidir.- “Veya üç gün oruç tut veya bir kurban kes.” İbn ebî Nüceyh: “Bir koyun kes” diye rivâyet etmiştir. (Müslim, Hac: 10; İbn Mâce, Menasik: 86) Bu hadis hasen sahihtir. Sahabe ve tabiin döneminden bazı ilim adamları uygulamalarını bu hadise göre yaparlar. İhramlı tıraş olur veya ihramlı iken giyilmemesi gereken bir elbise giyerse veya güzel koku sürünürse; Peygamber (sallallahü aleyhi ve sellem)’den rivâyet edildiği şekilde keffâret gerekir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "Beddah b. Adıy (radıyallahü anh)’in babasından rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem) çobanların bir gün şeytan taşlamalarını bir gün de hayvanlarının başında kalmalarına izin verdi.” (Ebû Dâvûd, Menasik: 77; Nesâî, Menasik: 225) İbn Uyeyne de aynı şekilde rivâyet etmiştir. Mâlik b. Enes ise, Abdullah b. ebî Bekir’den, babasından, Ebûl Beddah b. Âsım b. Adiyy’den ve babasından rivâyet ediyor ki Mâlik’in rivâyeti daha sahihtir. İlim adamlarından bir kısmı çobanların bir gün taşlayıp bir gün bırakmalarına izin vermişlerdir. Şâfii bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "Âsım b. Adiyy (radıyallahü anh)’in babasından rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), çobanların Minâ’da gecelemeyi bırakıp bayramın birinci günü şeytanı taşlamalarını sonraki taşlamaları da bir araya getirerek değişik bir günde yapmalarına izin vermiştir.” diyor ki: Abdullah b. ebî Bekir’in şöyle söylediğini sanıyorum: “İlk günde taşlarlar nefr gününde ise diğerlerini taşlarlar.” (Ebû Dâvûd, Menasik: 77; Nesâî, Menasik: 225) Bu hadis hasen sahihtir. İbn Uyeyne’nin Abdullah b. ebî Bekir’den rivâyetinden daha sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "Enes b. Mâlik (radıyallahü anh)’den rivâyete göre: Ali, Yemen’den Rasûlüllah (sallallahü aleyhi ve sellem)’in yanına geldi ve hangi niyetle ihrama girdin dedi. Ali de dedi ki: “Rasûlüllah (sallallahü aleyhi ve sellem) hangi niyetle ihrama girdiyse ben de o niyetle girdim” dedi. Rasûlüllah (sallallahü aleyhi ve sellem)’de: “Kurbanımı yanımda getirmiş olmasaydım ben de ihramdan çıkardım” buyurdular. (Buhârî, Hac: 32; Müslim, Hac: 34) Bu hadis bu yönüyle hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"text": "Ali (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’e Hacc’ül Ekber hangi gündür? Diye sordum; “Bayramın ilk günüdür” buyurdular. (Tirmizî rivâyet etmiştir)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 958,
			"arabicnumber": 958,
			"text": "Yine Ali (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Hacc’ül Ekber günü Kurban bayramının birinci günüdür.” (Nesâî, Menasik: 134) Ali bu hadisi merfu olarak değil kendi sözü olarak aktarmıştır ki öncekinden daha sahihtir. İbn Uyeyne’nin bu hadisi mevkuf olarak rivâyet etmesi, Muhammed b. İshâk’ın, merfu olarak rivâyetinden daha sahihtir. Pek çok hadis hafızı bu hadisi Ebû İshâk’tan, Hâris’den, Ali’den mevkuf olarak bize aktarmışlardır. Yine Şu’be Ebû İshâk’tan, Abdullah b. Mürre’den, Hâris’den ve Ali’den mevkuf olarak rivâyet etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "Ubeyd b. Umeyr (radıyallahü anh)’ın babasından rivâyete göre: İbn Ömer; Ka’be’nin, Hacer-ül Esved ve Rükn-ü Yemanî denilen köşelerine gelince oralara el sürebilmek için aşırı bir gayret ederdi. Bunun üzerine Ey Ebû Abdurrahman dedim; Peygamber (sallallahü aleyhi ve sellem)’in ashabından iki rükne karşı el sürebilmek için aşırı gayret ediyorsun nedendir acaba? Ömer dediki: Öyle yapıyorsam şunu iyi bil ki; Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim; “Onlara el sürmek günahlara keffarettir” buyurdu. Yine ondan işittim: “Kim, Ka’be’yi yedi defa tavaf edip bunu güzelce yaparsa bir köleyi hürriyetine kavuşturmuş gibi sevap kazanır.” Yine ondan işittim: “Her kim Ka’be’yi tavaf esnasında attığı her bir adım sebebiyle Allah, bir günahını siler ve bir sevap yazar” buyurdu. (Nesâî, Menasik: 149) Hammad b. Zeyd, Atâ b. Sâib’den, İbn Ubeyd b. Umeyr’den, İbn Ömer’den benzeri şekilde de rivâyet etmiştir. Fakat bu rivâyetinde “babasından” dememiştir. Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: “Ka’be etrafında tavaf etmek namaz kılmak gibidir ancak tavafta konuşabilirsiniz. Her kim tavaf esnasında konuşacaksa hayırlı şeyler konuşsun.” (Nesâî, Menasik: 135; Buhârî, Hac: 65) Bu hadis İbn Tavus ve başkaları tarafından, Tavus’tan ve İbn Abbâs’tan mevkuf olarak rivâyet edilmiş olup sadece Atâ b. Sâib’in rivâyetiyle merfu olarak bilmekteyiz. İlim adamlarının çoğunluğu uygulamalarını bu hadisle yaparlar ve: “Zaruret olmadıkça tavaf anında konuşulmamasını Allah’ı zikretmek ve ilim öğrenmek gibi konuların konuşulmasını müstehab görmektedirler.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) Hacer-ül Esved hakkında şöyle buyurmuştur: “Allah kıyamet günü Hacer-ül Esved’i mahşer yerine getirecektir, ve onun iki gözü olacak onlarla görecek bir dili olacak onunla konuşacak ve kendisine istilam edenlere şâhidlik yapacaktır.” (Tirmizî rivâyet etmiştir.) Bu hadis hasendir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "İbn Ömer (radıyallahü anh)’den rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem) ihramlı iken içerisine koku karıştırılmamış zeytin yağı ile yağlanırdı.” (Tirmizî rivâyet etmiştir.) Güzel koku karıştırılmış demektir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "Âişe (radıyallahü anha)’dan rivâyet edilmiştir: “Âişe, zemzem suyunu hac günlerinde yanında bulundurur ve Rasûlüllah (sallallahü aleyhi ve sellem)’in de yanında taşıdığını haber verirdi.” (Tirmizî rivâyet etmiştir.) Bu hadis hasen garibtir. Sadece bu şekliyle biliyoruz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "Abdulaziz b. Rüfey (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Enes b. Mâlik’e Rasûlüllah (sallallahü aleyhi ve sellem)’den duyup gördüğün bazı şeylerden bana bahset dedim. “Zilhiccenin sekizinci günü öğle namazını nerede kıldı? Dedi ki: “Minâ’da. Minâ’dan dağılma günü ikindi namazını nerede kıldı? Dedim. “Ebtah” ta dedi ve sonra şöyle devam etti: “Hac görevlerini yaptıracak olan yetkilinin yaptığı gibi yap.” (Buhârî, Hac: 58; Müslim, Hac: 12) Bu hadis hasen sahihtir. Sevrî’den İshâk b. Yusuf el Ezrak’ın rivâyeti olarak ta garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 158
			}
		}
	]
}