{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2046,
			"arabicnumber": 2046,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ إِنِّي لأَمْشِي مَعَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ بِمِنًى إِذْ لَقِيَهُ عُثْمَانُ فَاسْتَخْلاَهُ فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَتْ لَهُ حَاجَةٌ قَالَ لِي تَعَالَ يَا عَلْقَمَةُ فَجِئْتُ فَقَالَ لَهُ عُثْمَانُ أَلاَ نُزَوِّجُكَ يَا أَبَا عَبْدِ الرَّحْمَنِ بِجَارِيَةٍ بِكْرٍ لَعَلَّهُ يَرْجِعُ إِلَيْكَ مِنْ نَفْسِكَ مَا كُنْتَ تَعْهَدُ فَقَالَ عَبْدُ اللَّهِ لَئِنْ قُلْتَ ذَاكَ لَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2047,
			"arabicnumber": 2047,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - حَدَّثَنِي عُبَيْدُ اللَّهِ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تُنْكَحُ النِّسَاءُ لأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2048,
			"arabicnumber": 2048,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، أَخْبَرَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَزَوَّجْتَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏ ‏.‏ فَقُلْتُ ثَيِّبًا ‏.‏ قَالَ ‏\"‏ أَفَلاَ بِكْرٌ تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2049,
			"arabicnumber": 2049,
			"text": "قَالَ أَبُو دَاوُدَ كَتَبَ إِلَىَّ حُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، عَنْ عُمَارَةَ بْنِ أَبِي حَفْصَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ امْرَأَتِي لاَ تَمْنَعُ يَدَ لاَمِسٍ ‏.‏ قَالَ ‏\"‏ غَرِّبْهَا ‏\"‏ ‏.‏ قَالَ أَخَافُ أَنْ تَتْبَعَهَا نَفْسِي ‏.‏ قَالَ ‏\"‏ فَاسْتَمْتِعْ بِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2050,
			"arabicnumber": 2050,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا مُسْتَلِمُ بْنُ سَعِيدِ ابْنُ أُخْتِ، مَنْصُورِ بْنِ زَاذَانَ عَنْ مَنْصُورٍ، - يَعْنِي ابْنَ زَاذَانَ - عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، عَنْ مَعْقِلِ بْنِ يَسَارٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنِّي أَصَبْتُ امْرَأَةً ذَاتَ حَسَبٍ وَجَمَالٍ وَإِنَّهَا لاَ تَلِدُ أَفَأَتَزَوَّجُهَا قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ ثُمَّ أَتَاهُ الثَّانِيَةَ فَنَهَاهُ ثُمَّ أَتَاهُ الثَّالِثَةَ فَقَالَ ‏\"‏ تَزَوَّجُوا الْوَدُودَ الْوَلُودَ فَإِنِّي مُكَاثِرٌ بِكُمُ الأُمَمَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2051,
			"arabicnumber": 2051,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ التَّيْمِيُّ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ مَرْثَدَ بْنَ أَبِي مَرْثَدٍ الْغَنَوِيَّ، كَانَ يَحْمِلُ الأُسَارَى بِمَكَّةَ وَكَانَ بِمَكَّةَ بَغِيٌّ يُقَالُ لَهَا عَنَاقُ وَكَانَتْ صَدِيقَتَهُ قَالَ جِئْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ أَنْكِحُ عَنَاقَ قَالَ فَسَكَتَ عَنِّي فَنَزَلَتْ ‏{‏ وَالزَّانِيَةُ لاَ يَنْكِحُهَا إِلاَّ زَانٍ أَوْ مُشْرِكٌ ‏}‏ فَدَعَانِي فَقَرَأَهَا عَلَىَّ وَقَالَ ‏\"‏ لاَ تَنْكِحْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2052,
			"arabicnumber": 2052,
			"text": "حَدَّثَنَا مُسَدَّدٌ، وَأَبُو مَعْمَرٍ قَالاَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ حَبِيبٍ، حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَنْكِحُ الزَّانِي الْمَجْلُودُ إِلاَّ مِثْلَهُ ‏\"‏ ‏.‏ وَقَالَ أَبُو مَعْمَرٍ حَدَّثَنِي حَبِيبٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2053,
			"arabicnumber": 2053,
			"text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا عَبْثَرٌ، عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ أَعْتَقَ جَارِيَتَهُ وَتَزَوَّجَهَا كَانَ لَهُ أَجْرَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2054,
			"arabicnumber": 2054,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَعْتَقَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا صَدَاقَهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2055,
			"arabicnumber": 2055,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الْوِلاَدَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2056,
			"arabicnumber": 2056,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا زُهَيْرٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ أُمَّ حَبِيبَةَ، قَالَتْ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي أُخْتِي قَالَ ‏\"‏ فَأَفْعَلُ مَاذَا ‏\"‏ ‏.‏ قَالَتْ فَتَنْكِحُهَا ‏.‏ قَالَ ‏\"‏ أُخْتَكِ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ أَوَتُحِبِّينَ ذَاكَ ‏\"‏ ‏.‏ قَالَتْ لَسْتُ بِمُخْلِيَةٍ بِكَ وَأَحَبُّ مَنْ شَرَكَنِي فِي خَيْرٍ أُخْتِي ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا لاَ تَحِلُّ لِي ‏\"‏ ‏.‏ قَالَتْ فَوَاللَّهِ لَقَدْ أُخْبِرْتُ أَنَّكَ تَخْطُبُ دُرَّةَ - أَوْ ذَرَّةَ شَكَّ زُهَيْرٌ - بِنْتَ أَبِي سَلَمَةَ ‏.‏ قَالَ ‏\"‏ بِنْتَ أُمِّ سَلَمَةَ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ أَمَا وَاللَّهِ لَوْ لَمْ تَكُنْ رَبِيبَتِي فِي حِجْرِي مَا حَلَّتْ لِي إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ أَرْضَعَتْنِي وَأَبَاهَا ثُوَيْبَةُ فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2057,
			"arabicnumber": 2057,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ، أَخْبَرَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ دَخَلَ عَلَىَّ أَفْلَحُ بْنُ أَبِي الْقُعَيْسِ فَاسْتَتَرْتُ مِنْهُ ‏.‏ قَالَ تَسْتَتِرِينَ مِنِّي وَأَنَا عَمُّكِ قَالَتْ قُلْتُ مِنْ أَيْنَ قَالَ أَرْضَعَتْكِ امْرَأَةُ أَخِي ‏.‏ قَالَتْ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ ‏.‏ فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَحَدَّثْتُهُ فَقَالَ ‏ \"‏ إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2058,
			"arabicnumber": 2058,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَشْعَثَ بْنِ سُلَيْمٍ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ الْمَعْنَى، وَاحِدٌ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ قَالَ حَفْصٌ فَشَقَّ ذَلِكَ عَلَيْهِ وَتَغَيَّرَ وَجْهُهُ - ثُمَّ اتَّفَقَا - قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ أَخِي مِنَ الرَّضَاعَةِ ‏.‏ فَقَالَ ‏ \"‏ انْظُرْنَ مَنْ إِخْوَانُكُنَّ فَإِنَّمَا الرَّضَاعَةُ مِنَ الْمَجَاعَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2059,
			"arabicnumber": 2059,
			"text": "حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ مُطَهِّرٍ، أَنَّ سُلَيْمَانَ بْنَ الْمُغِيرَةِ، حَدَّثَهُمْ عَنْ أَبِي مُوسَى، عَنْ أَبِيهِ، عَنِ ابْنٍ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ لاَ رِضَاعَ إِلاَّ مَا شَدَّ الْعَظْمَ وَأَنْبَتَ اللَّحْمَ ‏.‏ فَقَالَ أَبُو مُوسَى لاَ تَسْأَلُونَا وَهَذَا الْحَبْرُ فِيكُمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2060,
			"arabicnumber": 2060,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، حَدَّثَنَا وَكِيعٌ، عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ، عَنْ أَبِي مُوسَى الْهِلاَلِيِّ، عَنْ أَبِيهِ، عَنِ ابْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ وَقَالَ أَنْشَزَ الْعَظْمَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2061,
			"arabicnumber": 2061,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَنْبَسَةُ، حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَأُمِّ سَلَمَةَ أَنَّ أَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ كَانَ تَبَنَّى سَالِمًا وَأَنْكَحَهُ ابْنَةَ أَخِيهِ هِنْدَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ وَهُوَ مَوْلًى لاِمْرَأَةٍ مِنَ الأَنْصَارِ كَمَا تَبَنَّى رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْدًا وَكَانَ مَنْ تَبَنَّى رَجُلاً فِي الْجَاهِلِيَّةِ دَعَاهُ النَّاسُ إِلَيْهِ وَوُرِّثَ مِيرَاثَهُ حَتَّى أَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى فِي ذَلِكَ ‏{‏ ادْعُوهُمْ لآبَائِهِمْ ‏}‏ إِلَى قَوْلِهِ ‏{‏ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ ‏}‏ فَرُدُّوا إِلَى آبَائِهِمْ فَمَنْ لَمْ يُعْلَمْ لَهُ أَبٌ كَانَ مَوْلًى وَأَخًا فِي الدِّينِ فَجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلِ بْنِ عَمْرٍو الْقُرَشِيِّ ثُمَّ الْعَامِرِيِّ - وَهِيَ امْرَأَةُ أَبِي حُذَيْفَةَ - فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَرَى سَالِمًا وَلَدًا وَكَانَ يَأْوِي مَعِي وَمَعَ أَبِي حُذَيْفَةَ فِي بَيْتٍ وَاحِدٍ وَيَرَانِي فُضْلاً وَقَدْ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِيهِمْ مَا قَدْ عَلِمْتَ فَكَيْفَ تَرَى فِيهِ فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرْضِعِيهِ ‏\"‏ ‏.‏ فَأَرْضَعَتْهُ خَمْسَ رَضَعَاتٍ فَكَانَ بِمَنْزِلَةِ وَلَدِهَا مِنَ الرَّضَاعَةِ فَبِذَلِكَ كَانَتْ عَائِشَةُ - رضى الله عنها - تَأْمُرُ بَنَاتِ أَخَوَاتِهَا وَبَنَاتِ إِخْوَتِهَا أَنْ يُرْضِعْنَ مَنْ أَحَبَّتْ عَائِشَةُ أَنْ يَرَاهَا وَيَدْخُلَ عَلَيْهَا وَإِنْ كَانَ كَبِيرًا خَمْسَ رَضَعَاتٍ ثُمَّ يَدْخُلَ عَلَيْهَا وَأَبَتْ أُمُّ سَلَمَةَ وَسَائِرُ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم أَنْ يُدْخِلْنَ عَلَيْهِنَّ بِتِلْكَ الرَّضَاعَةِ أَحَدًا مِنَ النَّاسِ حَتَّى يَرْضَعَ فِي الْمَهْدِ وَقُلْنَ لِعَائِشَةَ وَاللَّهِ مَا نَدْرِي لَعَلَّهَا كَانَتْ رُخْصَةً مِنَ النَّبِيِّ صلى الله عليه وسلم لِسَالِمٍ دُونَ النَّاسِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2062,
			"arabicnumber": 2062,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ فِيمَا أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ مِنَ الْقُرْآنِ عَشْرُ رَضَعَاتٍ يُحَرِّمْنَ ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ يُحَرِّمْنَ فَتُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَهُنَّ مِمَّا يُقْرَأُ مِنَ الْقُرْآنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2063,
			"arabicnumber": 2063,
			"text": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُحَرِّمُ الْمَصَّةُ وَلاَ الْمَصَّتَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2064,
			"arabicnumber": 2064,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ الْعَلاَءِ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ حَجَّاجِ بْنِ حَجَّاجٍ، عَنْ أَبِيهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا يُذْهِبُ عَنِّي مَذَمَّةَ الرَّضَاعَةِ قَالَ ‏ \"‏ الْغُرَّةُ الْعَبْدُ أَوِ الأَمَةُ ‏\"‏ ‏.‏ قَالَ النُّفَيْلِيُّ حَجَّاجُ بْنُ حَجَّاجٍ الأَسْلَمِيُّ وَهَذَا لَفْظُهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2065,
			"arabicnumber": 2065,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنْ عَامِرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلاَ الْعَمَّةُ عَلَى بِنْتِ أَخِيهَا وَلاَ الْمَرْأَةُ عَلَى خَالَتِهَا وَلاَ الْخَالَةُ عَلَى بِنْتِ أُخْتِهَا وَلاَ تُنْكَحُ الْكُبْرَى عَلَى الصُّغْرَى وَلاَ الصُّغْرَى عَلَى الْكُبْرَى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2066,
			"arabicnumber": 2066,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَنْبَسَةُ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا وَبَيْنَ الْمَرْأَةِ وَعَمَّتِهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2067,
			"arabicnumber": 2067,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا خَطَّابُ بْنُ الْقَاسِمِ، عَنْ خُصَيْفٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَرِهَ أَنْ يُجْمَعَ بَيْنَ الْعَمَّةِ وَالْخَالَةِ وَبَيْنَ الْخَالَتَيْنِ وَالْعَمَّتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم عَنْ قَوْلِ اللَّهِ تَعَالَى ‏{‏ وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ ‏}‏ قَالَتْ يَا ابْنَ أُخْتِي هِيَ الْيَتِيمَةُ تَكُونُ فِي حِجْرِ وَلِيِّهَا فَتُشَارِكُهُ فِي مَالِهِ فَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا فَيُرِيدُ أَنْ يَتَزَوَّجَهَا بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا فَيُعْطِيَهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ وَيَبْلُغُوا بِهِنَّ أَعْلَى سُنَّتِهِنَّ مِنَ الصَّدَاقِ وَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنَ النِّسَاءِ سِوَاهُنَّ ‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ثُمَّ إِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ هَذِهِ الآيَةِ فِيهِنَّ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللاَّتِي لاَ تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ ‏}‏ قَالَتْ وَالَّذِي ذَكَرَ اللَّهُ أَنَّهُ يُتْلَى عَلَيْهِمْ فِي الْكِتَابِ الآيَةُ الأُولَى الَّتِي قَالَ اللَّهُ سُبْحَانَهُ وَتَعَالَى ‏{‏ وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ ‏}‏ قَالَتْ عَائِشَةُ وَقَوْلُ اللَّهِ عَزَّ وَجَلَّ فِي الآيَةِ الآخِرَةِ ‏{‏ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ ‏}‏ هِيَ رَغْبَةُ أَحَدِكُمْ عَنْ يَتِيمَتِهِ الَّتِي تَكُونُ فِي حِجْرِهِ حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ فَنُهُوا أَنْ يَنْكِحُوا مَا رَغِبُوا فِي مَالِهَا وَجَمَالِهَا مِنْ يَتَامَى النِّسَاءِ إِلاَّ بِالْقِسْطِ مِنْ أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ ‏.‏ قَالَ يُونُسُ وَقَالَ رَبِيعَةُ فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏{‏ وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى ‏}‏ قَالَ يَقُولُ اتْرُكُوهُنَّ إِنْ خِفْتُمْ فَقَدْ أَحْلَلْتُ لَكُمْ أَرْبَعًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2069,
			"arabicnumber": 2069,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ الدُّؤَلِيُّ، أَنَّ ابْنَ شِهَابٍ، حَدَّثَهُ أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ حَدَّثَهُ أَنَّهُمْ، حِينَ قَدِمُوا الْمَدِينَةَ مِنْ عِنْدِ يَزِيدَ بْنِ مُعَاوِيَةَ مَقْتَلَ الْحُسَيْنِ بْنِ عَلِيٍّ - رضى الله عنهما - لَقِيَهُ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَقَالَ لَهُ هَلْ لَكَ إِلَىَّ مِنْ حَاجَةٍ تَأْمُرُنِي بِهَا قَالَ فَقُلْتُ لَهُ لاَ ‏.‏ قَالَ هَلْ أَنْتَ مُعْطِيَّ سَيْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِنِّي أَخَافُ أَنْ يَغْلِبَكَ الْقَوْمُ عَلَيْهِ وَايْمُ اللَّهِ لَئِنْ أَعْطَيْتَنِيهِ لاَ يُخْلَصُ إِلَيْهِ أَبَدًا حَتَّى يَبْلُغَ إِلَى نَفْسِي إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ - رضى الله عنه - خَطَبَ بِنْتَ أَبِي جَهْلٍ عَلَى فَاطِمَةَ - رضى الله عنها - فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يَخْطُبُ النَّاسَ فِي ذَلِكَ عَلَى مِنْبَرِهِ هَذَا وَأَنَا يَوْمَئِذٍ مُحْتَلِمٌ فَقَالَ ‏\"‏ إِنَّ فَاطِمَةَ مِنِّي وَأَنَا أَتَخَوَّفُ أَنْ تُفْتَنَ فِي دِينِهَا ‏\"‏ ‏.‏ قَالَ ثُمَّ ذَكَرَ صِهْرًا لَهُ مِنْ بَنِي عَبْدِ شَمْسٍ فَأَثْنَى عَلَيْهِ فِي مُصَاهَرَتِهِ إِيَّاهُ فَأَحْسَنَ قَالَ ‏\"‏ حَدَّثَنِي فَصَدَقَنِي وَوَعَدَنِي فَوَفَّى لِي وَإِنِّي لَسْتُ أُحَرِّمُ حَلاَلاً وَلاَ أُحِلُّ حَرَامًا وَلَكِنْ وَاللَّهِ لاَ تَجْتَمِعُ بِنْتُ رَسُولِ اللَّهِ وَبِنْتُ عَدُوِّ اللَّهِ مَكَانًا وَاحِدًا أَبَدًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2070,
			"arabicnumber": 2070,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنِي عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، بِهَذَا الْخَبَرِ قَالَ فَسَكَتَ عَلِيٌّ عَنْ ذَلِكَ النِّكَاحِ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2071,
			"arabicnumber": 2071,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، - الْمَعْنَى - قَالَ أَحْمَدُ حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ الْقُرَشِيُّ التَّيْمِيُّ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، حَدَّثَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَقُولُ ‏ \"‏ إِنَّ بَنِي هِشَامِ بْنِ الْمُغِيرَةِ اسْتَأْذَنُونِي أَنْ يُنْكِحُوا ابْنَتَهُمْ مِنْ عَلِيِّ بْنِ أَبِي طَالِبٍ فَلاَ آذَنُ ثُمَّ لاَ آذَنُ ثُمَّ لاَ آذَنُ إِلاَّ أَنْ يُرِيدَ ابْنُ أَبِي طَالِبٍ أَنْ يُطَلِّقَ ابْنَتِي وَيَنْكِحَ ابْنَتَهُمْ فَإِنَّمَا ابْنَتِي بَضْعَةٌ مِنِّي يُرِيبُنِي مَا أَرَابَهَا وَيُؤْذِينِي مَا آذَاهَا ‏\"‏ ‏.‏ وَالإِخْبَارُ فِي حَدِيثِ أَحْمَدَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2072,
			"arabicnumber": 2072,
			"text": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنِ الزُّهْرِيِّ، قَالَ كُنَّا عِنْدَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فَتَذَاكَرْنَا مُتْعَةَ النِّسَاءِ فَقَالَ لَهُ رَجُلٌ يُقَالُ لَهُ رَبِيعُ بْنُ سَبْرَةَ أَشْهَدُ عَلَى أَبِي أَنَّهُ حَدَّثَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهَا فِي حَجَّةِ الْوَدَاعِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2073,
			"arabicnumber": 2073,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ رَبِيعِ بْنِ سَبْرَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم حَرَّمَ مُتْعَةَ النِّسَاءِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2074,
			"arabicnumber": 2074,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، ح وَحَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، كِلاَهُمَا عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشِّغَارِ ‏.‏ زَادَ مُسَدَّدٌ فِي حَدِيثِهِ قُلْتُ لِنَافِعٍ مَا الشِّغَارُ قَالَ يَنْكِحُ ابْنَةَ الرَّجُلِ وَيُنْكِحُهُ ابْنَتَهُ بِغَيْرِ صَدَاقٍ وَيَنْكِحُ أُخْتَ الرَّجُلِ وَيُنْكِحُهُ أُخْتَهُ بِغَيْرِ صَدَاقٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2075,
			"arabicnumber": 2075,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ الأَعْرَجُ، أَنَّ الْعَبَّاسَ بْنَ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ، أَنْكَحَ عَبْدَ الرَّحْمَنِ بْنَ الْحَكَمِ ابْنَتَهُ وَأَنْكَحَهُ عَبْدُ الرَّحْمَنِ ابْنَتَهُ وَكَانَا جَعَلاَ صَدَاقًا فَكَتَبَ مُعَاوِيَةُ إِلَى مَرْوَانَ يَأْمُرُهُ بِالتَّفْرِيقِ بَيْنَهُمَا وَقَالَ فِي كِتَابِهِ هَذَا الشِّغَارُ الَّذِي نَهَى عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2076,
			"arabicnumber": 2076,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنِي إِسْمَاعِيلُ، عَنْ عَامِرٍ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، رضى الله عنه - قَالَ إِسْمَاعِيلُ وَأُرَاهُ قَدْ رَفَعَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم - أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَعَنَ اللَّهُ الْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2077,
			"arabicnumber": 2077,
			"text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، عَنْ خَالِدٍ، عَنْ حُصَيْنٍ، عَنْ عَامِرٍ، عَنِ الْحَارِثِ الأَعْوَرِ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ فَرَأَيْنَا أَنَّهُ عَلِيٌّ - عَلَيْهِ السَّلاَمُ - عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2078,
			"arabicnumber": 2078,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، - وَهَذَا لَفْظُ إِسْنَادِهِ - وَكِلاَهُمَا عَنْ وَكِيعٍ، حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ فَهُوَ عَاهِرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2079,
			"arabicnumber": 2079,
			"text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، حَدَّثَنَا أَبُو قُتَيْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا نَكَحَ الْعَبْدُ بِغَيْرِ إِذْنِ مَوْلاَهُ فَنِكَاحُهُ بَاطِلٌ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا الْحَدِيثُ ضَعِيفٌ وَهُوَ مَوْقُوفٌ وَهُوَ قَوْلُ ابْنِ عُمَرَ رضى الله عنهما ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2080,
			"arabicnumber": 2080,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2081,
			"arabicnumber": 2081,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَخْطُبُ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ وَلاَ يَبِيعُ عَلَى بَيْعِ أَخِيهِ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2082,
			"arabicnumber": 2082,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ دَاوُدَ بْنِ حُصَيْنٍ، عَنْ وَاقِدِ بْنِ عَبْدِ الرَّحْمَنِ، - يَعْنِي ابْنَ سَعْدِ بْنِ مُعَاذٍ - عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا خَطَبَ أَحَدُكُمُ الْمَرْأَةَ فَإِنِ اسْتَطَاعَ أَنْ يَنْظُرَ إِلَى مَا يَدْعُوهُ إِلَى نِكَاحِهَا فَلْيَفْعَلْ ‏\"‏ ‏.‏ قَالَ فَخَطَبْتُ جَارِيَةً فَكُنْتُ أَتَخَبَّأُ لَهَا حَتَّى رَأَيْتُ مِنْهَا مَا دَعَانِي إِلَى نِكَاحِهَا وَتَزَوُّجِهَا فَتَزَوَّجْتُهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2083,
			"arabicnumber": 2083,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا امْرَأَةٍ نَكَحَتْ بِغَيْرِ إِذْنِ مَوَالِيهَا فَنِكَاحُهَا بَاطِلٌ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏\"‏ فَإِنْ دَخَلَ بِهَا فَالْمَهْرُ لَهَا بِمَا أَصَابَ مِنْهَا فَإِنْ تَشَاجَرُوا فَالسُّلْطَانُ وَلِيُّ مَنْ لاَ وَلِيَّ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2084,
			"arabicnumber": 2084,
			"text": "حَدَّثَنِي الْقَعْنَبِيُّ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ جَعْفَرٍ، - يَعْنِي ابْنَ رَبِيعَةَ - عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ ‏.‏ قَالَ أَبُو دَاوُدَ جَعْفَرٌ لَمْ يَسْمَعْ مِنَ الزُّهْرِيِّ كَتَبَ إِلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2085,
			"arabicnumber": 2085,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ بْنِ أَعْيَنَ، حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ، عَنْ يُونُسَ، وَإِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ نِكَاحَ إِلاَّ بِوَلِيٍّ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هُوَ يُونُسُ عَنْ أَبِي بُرْدَةَ وَإِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي بُرْدَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2086,
			"arabicnumber": 2086,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ أُمِّ حَبِيبَةَ، أَنَّهَا كَانَتْ عِنْدَ ابْنِ جَحْشٍ فَهَلَكَ عَنْهَا - وَكَانَ فِيمَنْ هَاجَرَ إِلَى أَرْضِ الْحَبَشَةِ - فَزَوَّجَهَا النَّجَاشِيُّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهِيَ عِنْدَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2087,
			"arabicnumber": 2087,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي أَبُو عَامِرٍ، حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ، عَنِ الْحَسَنِ، حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ، قَالَ كَانَتْ لِي أُخْتٌ تُخْطَبُ إِلَىَّ فَأَتَانِي ابْنُ عَمٍّ لِي فَأَنْكَحْتُهَا إِيَّاهُ ثُمَّ طَلَّقَهَا طَلاَقًا لَهُ رَجْعَةٌ ثُمَّ تَرَكَهَا حَتَّى انْقَضَتْ عِدَّتُهَا فَلَمَّا خُطِبَتْ إِلَىَّ أَتَانِي يَخْطُبُهَا فَقُلْتُ لاَ وَاللَّهِ لاَ أُنْكِحُهَا أَبَدًا ‏.‏ قَالَ فَفِيَّ نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلاَ تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ ‏}‏ الآيَةَ ‏.‏ قَالَ فَكَفَّرْتُ عَنْ يَمِينِي فَأَنْكَحْتُهَا إِيَّاهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2088,
			"arabicnumber": 2088,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا هَمَّامٌ، ح وَحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، - الْمَعْنَى - عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلأَوَّلِ مِنْهُمَا وَأَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلأَوَّلِ مِنْهُمَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2089,
			"arabicnumber": 2089,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الشَّيْبَانِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، - قَالَ الشَّيْبَانِيُّ وَذَكَرَهُ عَطَاءٌ أَبُو الْحَسَنِ السُّوَائِيُّ وَلاَ أَظُنُّهُ إِلاَّ عَنِ ابْنِ عَبَّاسٍ، - فِي هَذِهِ الآيَةِ ‏{‏ لاَ يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلاَ تَعْضُلُوهُنَّ ‏}‏ قَالَ كَانَ الرَّجُلُ إِذَا مَاتَ كَانَ أَوْلِيَاؤُهُ أَحَقَّ بِامْرَأَتِهِ مِنْ وَلِيِّ نَفْسِهَا إِنْ شَاءَ بَعْضُهُمْ زَوَّجَهَا أَوْ زَوَّجُوهَا وَإِنْ شَاءُوا لَمْ يُزَوِّجُوهَا فَنَزَلَتْ هَذِهِ الآيَةُ فِي ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2090,
			"arabicnumber": 2090,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏{‏ لاَ يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلاَ تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ إِلاَّ أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ ‏}‏ وَذَلِكَ أَنَّ الرَّجُلَ كَانَ يَرِثُ امْرَأَةَ ذِي قَرَابَتِهِ فَيَعْضُلُهَا حَتَّى تَمُوتَ أَوْ تَرُدَّ إِلَيْهِ صَدَاقَهَا فَأَحْكَمَ اللَّهُ عَنْ ذَلِكَ وَنَهَى عَنْ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2091,
			"arabicnumber": 2091,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ شَبُّويَةَ الْمَرْوَزِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ، عَنْ عِيسَى بْنِ عُبَيْدٍ، عَنْ عُبَيْدِ اللَّهِ، مَوْلَى عُمَرَ عَنِ الضَّحَّاكِ، بِمَعْنَاهُ قَالَ فَوَعَظَ اللَّهُ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2092,
			"arabicnumber": 2092,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبَانُ، حَدَّثَنَا يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُنْكَحُ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ وَلاَ الْبِكْرُ إِلاَّ بِإِذْنِهَا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا إِذْنُهَا قَالَ ‏\"‏ أَنْ تَسْكُتَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، ح وَحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، - الْمَعْنَى - حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تُسْتَأْمَرُ الْيَتِيمَةُ فِي نَفْسِهَا فَإِنْ سَكَتَتْ فَهُوَ إِذْنُهَا وَإِنْ أَبَتْ فَلاَ جَوَازَ عَلَيْهَا ‏\"‏ ‏.‏ وَالإِخْبَارُ فِي حَدِيثِ يَزِيدَ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَلِكَ رَوَاهُ أَبُو خَالِدٍ سُلَيْمَانُ بْنُ حَيَّانَ وَمُعَاذٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2094,
			"arabicnumber": 2094,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ زَادَ فِيهِ قَالَ ‏\"‏ فَإِنْ بَكَتْ أَوْ سَكَتَتْ ‏\"‏ ‏.‏ زَادَ ‏\"‏ بَكَتْ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَلَيْسَ ‏\"‏ بَكَتْ ‏\"‏ ‏.‏ بِمَحْفُوظٍ وَهُوَ وَهَمٌ فِي الْحَدِيثِ الْوَهَمُ مِنِ ابْنِ إِدْرِيسَ أَوْ مِنْ مُحَمَّدِ بْنِ الْعَلاَءِ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ أَبُو عَمْرٍو ذَكْوَانُ عَنْ عَائِشَةَ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ الْبِكْرَ تَسْتَحِي أَنْ تَتَكَلَّمَ ‏.‏ قَالَ ‏\"‏ سُكَاتُهَا إِقْرَارُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2095,
			"arabicnumber": 2095,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ سُفْيَانَ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، حَدَّثَنِي الثِّقَةُ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ آمِرُوا النِّسَاءَ فِي بَنَاتِهِنَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2096,
			"arabicnumber": 2096,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ جَارِيَةً، بِكْرًا أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَذَكَرَتْ أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ كَارِهَةٌ فَخَيَّرَهَا النَّبِيُّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2097,
			"arabicnumber": 2097,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ ‏.‏ قَالَ أَبُو دَاوُدَ لَمْ يَذْكُرِ ابْنَ عَبَّاسٍ وَكَذَلِكَ رَوَاهُ النَّاسُ مُرْسَلاً مَعْرُوفٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2098,
			"arabicnumber": 2098,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، وَعَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالاَ أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا ‏\"‏ ‏.‏ وَهَذَا لَفْظُ الْقَعْنَبِيِّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2099,
			"arabicnumber": 2099,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ ‏\"‏ الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ يَسْتَأْمِرُهَا أَبُوهَا ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏\"‏ أَبُوهَا ‏\"‏ ‏.‏ لَيْسَ بِمَحْفُوظٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2100,
			"arabicnumber": 2100,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ لِلْوَلِيِّ مَعَ الثَّيِّبِ أَمْرٌ وَالْيَتِيمَةُ تُسْتَأْمَرُ وَصَمْتُهَا إِقْرَارُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2101,
			"arabicnumber": 2101,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ، وَمُجَمِّعٍ، ابْنَىْ يَزِيدَ الأَنْصَارِيَّيْنِ عَنْ خَنْسَاءَ بِنْتِ خِدَامٍ الأَنْصَارِيَّةِ، أَنَّ أَبَاهَا، زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَجَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ فَرَدَّ نِكَاحَهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2102,
			"arabicnumber": 2102,
			"text": "حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ غِيَاثٍ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ أَبَا هِنْدٍ، حَجَمَ النَّبِيَّ صلى الله عليه وسلم فِي الْيَافُوخِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا بَنِي بَيَاضَةَ أَنْكِحُوا أَبَا هِنْدٍ وَانْكِحُوا إِلَيْهِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ وَإِنْ كَانَ فِي شَىْءٍ مِمَّا تَدَاوَوْنَ بِهِ خَيْرٌ فَالْحِجَامَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - الْمَعْنَى - قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ بْنِ مِقْسَمٍ الثَّقَفِيُّ، - مِنْ أَهْلِ الطَّائِفِ - حَدَّثَتْنِي سَارَّةُ بِنْتُ مِقْسَمٍ، أَنَّهَا سَمِعَتْ مَيْمُونَةَ بِنْتَ كَرْدَمٍ، قَالَتْ خَرَجْتُ مَعَ أَبِي فِي حَجَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَدَنَا إِلَيْهِ أَبِي وَهُوَ عَلَى نَاقَةٍ لَهُ فَوَقَفَ لَهُ وَاسْتَمَعَ مِنْهُ وَمَعَهُ دِرَّةٌ كَدِرَّةِ الْكُتَّابِ فَسَمِعْتُ الأَعْرَابَ وَالنَّاسَ وَهُمْ يَقُولُونَ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ فَدَنَا إِلَيْهِ أَبِي فَأَخَذَ بِقَدَمِهِ فَأَقَرَّ لَهُ وَوَقَفَ عَلَيْهِ وَاسْتَمَعَ مِنْهُ فَقَالَ إِنِّي حَضَرْتُ جَيْشَ عِثْرَانَ - قَالَ ابْنُ الْمُثَنَّى جَيْشَ غِثْرَانَ - فَقَالَ طَارِقُ بْنُ الْمُرَقَّعِ مَنْ يُعْطِينِي رُمْحًا بِثَوَابِهِ قُلْتُ وَمَا ثَوَابُهُ قَالَ أُزَوِّجُهُ أَوَّلَ بِنْتٍ تَكُونُ لِي ‏.‏ فَأَعْطَيْتُهُ رُمْحِي ثُمَّ غِبْتُ عَنْهُ حَتَّى عَلِمْتُ أَنَّهُ قَدْ وُلِدَ لَهُ جَارِيَةٌ وَبَلَغَتْ ثُمَّ جِئْتُهُ فَقُلْتُ لَهُ أَهْلِي جَهِّزْهُنَّ إِلَىَّ ‏.‏ فَحَلَفَ أَنْ لاَ يَفْعَلَ حَتَّى أُصْدِقَهُ صَدَاقًا جَدِيدًا غَيْرَ الَّذِي كَانَ بَيْنِي وَبَيْنَهُ وَحَلَفْتُ لاَ أُصْدِقُ غَيْرَ الَّذِي أَعْطَيْتُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَبِقَرْنِ أَىِّ النِّسَاءِ هِيَ الْيَوْمَ ‏\"‏ ‏.‏ قَالَ قَدْ رَأَتِ الْقَتِيرَ ‏.‏ قَالَ ‏\"‏ أَرَى أَنْ تَتْرُكَهَا ‏\"‏ ‏.‏ قَالَ فَرَاعَنِي ذَلِكَ وَنَظَرْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَأَى ذَلِكَ مِنِّي قَالَ ‏\"‏ لاَ تَأْثَمُ وَلاَ يَأْثَمُ صَاحِبُكَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ الْقَتِيرُ الشَّيْبُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2104,
			"arabicnumber": 2104,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، أَنَّ خَالَتَهُ، أَخْبَرَتْهُ عَنِ امْرَأَةٍ، قَالَتْ هِيَ مُصَدَّقَةٌ امْرَأَةُ صِدْقٍ قَالَتْ بَيْنَا أَبِي فِي غَزَاةٍ فِي الْجَاهِلِيَّةِ إِذْ رَمِضُوا فَقَالَ رَجُلٌ مَنْ يُعْطِينِي نَعْلَيْهِ وَأُنْكِحُهُ أَوَّلَ بِنْتٍ تُولَدُ لِي فَخَلَعَ أَبِي نَعْلَيْهِ فَأَلْقَاهُمَا إِلَيْهِ فَوُلِدَتْ لَهُ جَارِيَةٌ فَبَلَغَتْ وَذَكَرَ نَحْوَهُ وَلَمْ يَذْكُرْ قِصَّةَ الْقَتِيرِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2105,
			"arabicnumber": 2105,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، قَالَ سَأَلْتُ عَائِشَةَ - رضى الله عنها - عَنْ صَدَاقِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ ثِنْتَا عَشْرَةَ أُوقِيَّةً وَنَشٌّ ‏.‏ فَقُلْتُ وَمَا نَشٌّ قَالَتْ نِصْفُ أُوقِيَّةٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2106,
			"arabicnumber": 2106,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي الْعَجْفَاءِ السُّلَمِيِّ، قَالَ خَطَبَنَا عُمَرُ رَحِمَهُ اللَّهُ فَقَالَ أَلاَ لاَ تُغَالُوا بِصُدُقِ النِّسَاءِ فَإِنَّهَا لَوْ كَانَتْ مَكْرُمَةً فِي الدُّنْيَا أَوْ تَقْوَى عِنْدَ اللَّهِ لَكَانَ أَوْلاَكُمْ بِهَا النَّبِيُّ صلى الله عليه وسلم مَا أَصْدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم امْرَأَةً مِنْ نِسَائِهِ وَلاَ أُصْدِقَتِ امْرَأَةٌ مِنْ بَنَاتِهِ أَكْثَرَ مِنْ ثِنْتَىْ عَشْرَةَ أُوقِيَّةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2107,
			"arabicnumber": 2107,
			"text": "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ الثَّقَفِيُّ، حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ أُمِّ حَبِيبَةَ، أَنَّهَا كَانَتْ تَحْتَ عُبَيْدِ اللَّهِ بْنِ جَحْشٍ فَمَاتَ بِأَرْضِ الْحَبَشَةِ فَزَوَّجَهَا النَّجَاشِيُّ النَّبِيَّ صلى الله عليه وسلم وَأَمْهَرَهَا عنه أَرْبَعَةَ آلاَفٍ وَبَعَثَ بِهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مَعَ شُرَحْبِيلَ ابْنِ حَسَنَةَ ‏.‏ قَالَ أَبُو دَاوُدَ حَسَنَةُ هِيَ أُمُّهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2108,
			"arabicnumber": 2108,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ، حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، أَنَّ النَّجَاشِيَّ، زَوَّجَ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى صَدَاقٍ أَرْبَعَةِ آلاَفِ دِرْهَمٍ وَكَتَبَ بِذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبِلَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2109,
			"arabicnumber": 2109,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ الْبُنَانِيِّ، وَحُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ وَعَلَيْهِ رَدْعُ زَعْفَرَانٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَهْيَمْ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ تَزَوَّجْتُ امْرَأَةً ‏.‏ قَالَ ‏\"‏ مَا أَصْدَقْتَهَا ‏\"‏ ‏.‏ قَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏ قَالَ ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2110,
			"arabicnumber": 2110,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ جِبْرِيلَ الْبَغْدَادِيُّ، أَخْبَرَنَا يَزِيدُ، أَخْبَرَنَا مُوسَى بْنُ مُسْلِمِ بْنِ رُومَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْطَى فِي صَدَاقِ امْرَأَةٍ مِلْءَ كَفَّيْهِ سَوِيقًا أَوْ تَمْرًا فَقَدِ اسْتَحَلَّ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ صَالِحِ بْنِ رُومَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ مَوْقُوفًا وَرَوَاهُ أَبُو عَاصِمٍ عَنْ صَالِحِ بْنِ رُومَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كُنَّا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَسْتَمْتِعُ بِالْقُبْضَةِ مِنَ الطَّعَامِ عَلَى مَعْنَى الْمُتْعَةِ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَلَى مَعْنَى أَبِي عَاصِمٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2111,
			"arabicnumber": 2111,
			"text": "حَدَّثَنِي الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَتْهُ امْرَأَةٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَهَبْتُ نَفْسِي لَكَ ‏.‏ فَقَامَتْ قِيَامًا طَوِيلاً فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ تُصْدِقُهَا إِيَّاهُ ‏\"‏ ‏.‏ فَقَالَ مَا عِنْدِي إِلاَّ إِزَارِي هَذَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكَ إِنْ أَعْطَيْتَهَا إِزَارَكَ جَلَسْتَ وَلاَ إِزَارَ لَكَ فَالْتَمِسْ شَيْئًا ‏\"‏ ‏.‏ قَالَ لاَ أَجِدُ شَيْئًا ‏.‏ قَالَ ‏\"‏ فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏ ‏.‏ فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَهَلْ مَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏ ‏.‏ قَالَ نَعَمْ سُورَةُ كَذَا وَسُورَةُ كَذَا ‏.‏ لِسُوَرٍ سَمَّاهَا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ زَوَّجْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2112,
			"arabicnumber": 2112,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، حَدَّثَنِي أَبِي حَفْصُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنِ الْحَجَّاجِ بْنِ الْحَجَّاجِ الْبَاهِلِيِّ، عَنْ عِسْلٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَ هَذِهِ الْقِصَّةِ لَمْ يَذْكُرِ الإِزَارَ وَالْخَاتَمَ فَقَالَ ‏\"‏ مَا تَحْفَظُ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ سُورَةَ الْبَقَرَةِ أَوِ الَّتِي تَلِيهَا ‏.‏ قَالَ ‏\"‏ فَقُمْ فَعَلِّمْهَا عِشْرِينَ آيَةً وَهِيَ امْرَأَتُكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2113,
			"arabicnumber": 2113,
			"text": "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ، حَدَّثَنَا أَبِي، حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ، عَنْ مَكْحُولٍ، نَحْوَ خَبَرِ سَهْلٍ قَالَ وَكَانَ مَكْحُولٌ يَقُولُ لَيْسَ ذَلِكَ لأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2114,
			"arabicnumber": 2114,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ فِرَاسٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، فِي رَجُلٍ تَزَوَّجَ امْرَأَةً فَمَاتَ عَنْهَا وَلَمْ يَدْخُلْ بِهَا وَلَمْ يَفْرِضْ لَهَا الصَّدَاقَ فَقَالَ لَهَا الصَّدَاقُ كَامِلاً وَعَلَيْهَا الْعِدَّةُ وَلَهَا الْمِيرَاثُ ‏.‏ فَقَالَ مَعْقِلُ بْنُ سِنَانٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِهِ فِي بِرْوَعَ بِنْتِ وَاشِقٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2115,
			"arabicnumber": 2115,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، وَابْنُ، مَهْدِيٍّ عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، وَسَاقَ، عُثْمَانُ مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2116,
			"arabicnumber": 2116,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، وَأَبِي، حَسَّانَ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، أُتِيَ فِي رَجُلٍ بِهَذَا الْخَبَرِ قَالَ فَاخْتَلَفُوا إِلَيْهِ شَهْرًا أَوْ قَالَ مَرَّاتٍ قَالَ فَإِنِّي أَقُولُ فِيهَا إِنَّ لَهَا صَدَاقًا كَصَدَاقِ نِسَائِهَا لاَ وَكْسَ وَلاَ شَطَطَ وَإِنَّ لَهَا الْمِيرَاثَ وَعَلَيْهَا الْعِدَّةُ فَإِنْ يَكُ صَوَابًا فَمِنَ اللَّهِ وَإِنْ يَكُنْ خَطَأً فَمِنِّي وَمِنَ الشَّيْطَانِ وَاللَّهُ وَرَسُولُهُ بَرِيئَانِ ‏.‏ فَقَامَ نَاسٌ مِنْ أَشْجَعَ فِيهِمُ الْجَرَّاحُ وَأَبُو سِنَانٍ فَقَالُوا يَا ابْنَ مَسْعُودٍ نَحْنُ نَشْهَدُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَاهَا فِينَا فِي بِرْوَعَ بِنْتِ وَاشِقٍ وَإِنَّ زَوْجَهَا هِلاَلُ بْنُ مُرَّةَ الأَشْجَعِيُّ كَمَا قَضَيْتَ ‏.‏ قَالَ فَفَرِحَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ فَرَحًا شَدِيدًا حِينَ وَافَقَ قَضَاؤُهُ قَضَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2117,
			"arabicnumber": 2117,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ الذُّهْلِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُمَرُ بْنُ الْخَطَّابِ، - قَالَ مُحَمَّدٌ - حَدَّثَنَا أَبُو الأَصْبَغِ الْجَزَرِيُّ عَبْدُ الْعَزِيزِ بْنُ يَحْيَى، أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ أَبِي عَبْدِ الرَّحِيمِ، خَالِدِ بْنِ أَبِي يَزِيدَ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِرَجُلٍ ‏\"‏ أَتَرْضَى أَنْ أُزَوِّجَكَ فُلاَنَةَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ وَقَالَ لِلْمَرْأَةِ ‏\"‏ أَتَرْضِينَ أَنْ أُزَوِّجَكِ فُلاَنًا ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ فَزَوَّجَ أَحَدُهُمَا صَاحِبَهُ فَدَخَلَ بِهَا الرَّجُلُ وَلَمْ يَفْرِضْ لَهَا صَدَاقًا وَلَمْ يُعْطِهَا شَيْئًا وَكَانَ مِمَّنْ شَهِدَ الْحُدَيْبِيَةَ وَكَانَ مَنْ شَهِدَ الْحُدَيْبِيَةَ لَهُ سَهْمٌ بِخَيْبَرَ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم زَوَّجَنِي فُلاَنَةَ وَلَمْ أَفْرِضْ لَهَا صَدَاقًا وَلَمْ أُعْطِهَا شَيْئًا وَإِنِّي أُشْهِدُكُمْ أَنِّي أَعْطَيْتُهَا مِنْ صَدَاقِهَا سَهْمِي بِخَيْبَرَ فَأَخَذَتْ سَهْمًا فَبَاعَتْهُ بِمِائَةِ أَلْفٍ ‏.‏ قَالَ أَبُو دَاوُدَ وَزَادَ عُمَرُ بْنُ الْخَطَّابِ - وَحَدِيثُهُ أَتَمُّ - فِي أَوَّلِ الْحَدِيثِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ النِّكَاحِ أَيْسَرُهُ ‏\"‏ ‏.‏ وَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلرَّجُلِ ثُمَّ سَاقَ مَعْنَاهُ ‏.‏ قَالَ أَبُو دَاوُدَ يُخَافُ أَنْ يَكُونَ هَذَا الْحَدِيثُ مُلْزَقًا لأَنَّ الأَمْرَ عَلَى غَيْرِ هَذَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2118,
			"arabicnumber": 2118,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، فِي خُطْبَةِ الْحَاجَةِ فِي النِّكَاحِ وَغَيْرِهِ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ - الْمَعْنَى - حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي الأَحْوَصِ وَأَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَ عَلَّمَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم خُطْبَةَ الْحَاجَةِ ‏\"‏ إِنَّ الْحَمْدَ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِهِ مِنْ شُرُورِ أَنْفُسِنَا مَنْ يَهْدِ اللَّهُ فَلاَ مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلاَ هَادِيَ لَهُ وَأَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ يَا أَيُّهَا الَّذِينَ آمَنُوا ‏{‏ اتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا ‏}‏ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلاَ تَمُوتُنَّ إِلاَّ وَأَنْتُمْ مُسْلِمُونَ ‏}‏ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلاً سَدِيدًا * يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا ‏}‏ ‏.‏ لَمْ يَقُلْ مُحَمَّدُ بْنُ سُلَيْمَانَ إِنَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2119,
			"arabicnumber": 2119,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا عِمْرَانُ، عَنْ قَتَادَةَ، عَنْ عَبْدِ رَبِّهِ، عَنْ أَبِي عِيَاضٍ، عَنِ ابْنِ مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا تَشَهَّدَ ذَكَرَ نَحْوَهُ وَقَالَ بَعْدَ قَوْلِهِ ‏\"‏ وَرَسُولُهُ ‏\"‏ ‏.‏ ‏\"‏ أَرْسَلَهُ بِالْحَقِّ بَشِيرًا وَنَذِيرًا بَيْنَ يَدَىِ السَّاعَةِ مَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَإِنَّهُ لاَ يَضُرُّ إِلاَّ نَفْسَهُ وَلاَ يَضُرُّ اللَّهَ شَيْئًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2120,
			"arabicnumber": 2120,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْعَلاَءِ ابْنِ أَخِي، شُعَيْبٍ الرَّازِيِّ عَنْ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، عَنْ رَجُلٍ، مِنْ بَنِي سُلَيْمٍ قَالَ خَطَبْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم أُمَامَةَ بِنْتَ عَبْدِ الْمُطَّلِبِ فَأَنْكَحَنِي مِنْ غَيْرِ أَنْ يَتَشَهَّدَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2121,
			"arabicnumber": 2121,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا بِنْتُ سَبْعٍ - قَالَ سُلَيْمَانُ أَوْ سِتٍّ - وَدَخَلَ بِي وَأَنَا بِنْتُ تِسْعٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2122,
			"arabicnumber": 2122,
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا تَزَوَّجَ أُمَّ سَلَمَةَ أَقَامَ عِنْدَهَا ثَلاَثًا ثُمَّ قَالَ ‏ \"‏ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ لَكِ وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2123,
			"arabicnumber": 2123,
			"text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، عَنْ هُشَيْمٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَفِيَّةَ أَقَامَ عِنْدَهَا ثَلاَثًا ‏.‏ زَادَ عُثْمَانُ وَكَانَتْ ثَيِّبًا ‏.‏ وَقَالَ حَدَّثَنِي هُشَيْمٌ أَخْبَرَنَا حُمَيْدٌ أَخْبَرَنَا أَنَسٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2124,
			"arabicnumber": 2124,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، وَإِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ إِذَا تَزَوَّجَ الْبِكْرَ عَلَى الثَّيِّبِ أَقَامَ عِنْدَهَا سَبْعًا ‏.‏ وَإِذَا تَزَوَّجَ الثَّيِّبَ أَقَامَ عِنْدَهَا ثَلاَثًا ‏.‏ وَلَوْ قُلْتُ إِنَّهُ رَفَعَهُ لَصَدَقْتُ وَلَكِنَّهُ قَالَ السُّنَّةُ كَذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2125,
			"arabicnumber": 2125,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِسْمَاعِيلَ الطَّالْقَانِيُّ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا سَعِيدٌ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا تَزَوَّجَ عَلِيٌّ فَاطِمَةَ قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعْطِهَا شَيْئًا ‏\"‏ ‏.‏ قَالَ مَا عِنْدِي شَىْءٌ ‏.‏ قَالَ ‏\"‏ أَيْنَ دِرْعُكَ الْحُطَمِيَّةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": 2126,
			"text": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ، حَدَّثَنَا أَبُو حَيْوَةَ، عَنْ شُعَيْبٍ، - يَعْنِي ابْنَ أَبِي حَمْزَةَ - حَدَّثَنِي غَيْلاَنُ بْنُ أَنَسٍ، حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ عَلِيًّا عَلَيْهِ السَّلاَمُ لَمَّا تَزَوَّجَ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَضِيَ اللَّهُ عَنْهَا أَرَادَ أَنْ يَدْخُلَ بِهَا فَمَنَعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى يُعْطِيَهَا شَيْئًا فَقَالَ يَا رَسُولَ اللَّهِ لَيْسَ لِي شَىْءٌ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَعْطِهَا دِرْعَكَ ‏\"‏ ‏.‏ فَأَعْطَاهَا دِرْعَهُ ثُمَّ دَخَلَ بِهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": 2127,
			"text": "حَدَّثَنَا كَثِيرٌ، - يَعْنِي ابْنَ عُبَيْدٍ - حَدَّثَنَا أَبُو حَيْوَةَ، عَنْ شُعَيْبٍ، عَنْ غَيْلاَنَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": 2128,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّارُ، حَدَّثَنَا شَرِيكٌ، عَنْ مَنْصُورٍ، عَنْ طَلْحَةَ، عَنْ خَيْثَمَةَ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أُدْخِلَ امْرَأَةً عَلَى زَوْجِهَا قَبْلَ أَنْ يُعْطِيَهَا شَيْئًا ‏.‏ قَالَ أَبُو دَاوُدَ خَيْثَمَةُ لَمْ يَسْمَعْ مِنْ عَائِشَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": 2129,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا امْرَأَةٍ نُكِحَتْ عَلَى صَدَاقٍ أَوْ حِبَاءٍ أَوْ عِدَةٍ قَبْلَ عِصْمَةِ النِّكَاحِ فَهُوَ لَهَا وَمَا كَانَ بَعْدَ عِصْمَةِ النِّكَاحِ فَهُوَ لِمَنْ أُعْطِيَهُ وَأَحَقُّ مَا أُكْرِمَ عَلَيْهِ الرَّجُلُ ابْنَتُهُ أَوْ أُخْتُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": 2130,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا رَفَّأَ الإِنْسَانَ إِذَا تَزَوَّجَ قَالَ ‏ \"‏ بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": 2131,
			"text": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، وَالْحَسَنُ بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ أَبِي السَّرِيِّ، - الْمَعْنَى - قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ رَجُلٍ، مِنَ الأَنْصَارِ - قَالَ ابْنُ أَبِي السَّرِيِّ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَقُلْ مِنَ الأَنْصَارِ ثُمَّ اتَّفَقُوا - يُقَالُ لَهُ بَصْرَةُ قَالَ تَزَوَّجْتُ امْرَأَةً بِكْرًا فِي سِتْرِهَا فَدَخَلْتُ عَلَيْهَا فَإِذَا هِيَ حُبْلَى فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَهَا الصَّدَاقُ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَالْوَلَدُ عَبْدٌ لَكَ فَإِذَا وَلَدَتْ ‏\"‏ ‏.‏ قَالَ الْحَسَنُ ‏\"‏ فَاجْلِدْهَا ‏\"‏ ‏.‏ وَقَالَ ابْنُ أَبِي السَّرِيِّ ‏\"‏ فَاجْلِدُوهَا ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ فَحُدُّوهَا ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى هَذَا الْحَدِيثَ قَتَادَةُ عَنْ سَعِيدِ بْنِ يَزِيدَ عَنِ ابْنِ الْمُسَيَّبِ وَرَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَعَطَاءٌ الْخُرَاسَانِيُّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَرْسَلُوهُ كُلُّهُمْ ‏.‏ وَفِي حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ أَنَّ بَصْرَةَ بْنَ أَكْثَمَ نَكَحَ امْرَأَةً وَكُلُّهُمْ قَالَ فِي حَدِيثِهِ جَعَلَ الْوَلَدَ عَبْدًا لَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": 2132,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيٌّ، - يَعْنِي ابْنَ الْمُبَارَكِ - عَنْ يَحْيَى، عَنْ يَزِيدَ بْنِ نُعَيْمٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَجُلاً، يُقَالُ لَهُ بَصْرَةُ بْنُ أَكْثَمَ نَكَحَ امْرَأَةً فَذَكَرَ مَعْنَاهُ ‏.‏ وَزَادَ وَفَرَّقَ بَيْنَهُمَا ‏.‏ وَحَدِيثُ ابْنِ جُرَيْجٍ أَتَمُّ ‏.‏",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2133,
			"arabicnumber": 2133,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَتْ لَهُ امْرَأَتَانِ فَمَالَ إِلَى إِحْدَاهُمَا جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ مَائِلٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": 2134,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْسِمُ فَيَعْدِلُ وَيَقُولُ ‏ \"‏ اللَّهُمَّ هَذَا قَسْمِي فِيمَا أَمْلِكُ فَلاَ تَلُمْنِي فِيمَا تَمْلِكُ وَلاَ أَمْلِكُ ‏\"‏ ‏.‏ يَعْنِي الْقَلْبَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": 2135,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ أَبِي الزِّنَادِ - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، قَالَ قَالَتْ عَائِشَةُ يَا ابْنَ أُخْتِي كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يُفَضِّلُ بَعْضَنَا عَلَى بَعْضٍ فِي الْقَسْمِ مِنْ مُكْثِهِ عِنْدَنَا وَكَانَ قَلَّ يَوْمٌ إِلاَّ وَهُوَ يَطُوفُ عَلَيْنَا جَمِيعًا فَيَدْنُو مِنْ كُلِّ امْرَأَةٍ مِنْ غَيْرِ مَسِيسٍ حَتَّى يَبْلُغَ إِلَى الَّتِي هُوَ يَوْمُهَا فَيَبِيتُ عِنْدَهَا وَلْقَدْ قَالَتْ سَوْدَةُ بِنْتُ زَمْعَةَ حِينَ أَسَنَّتْ وَفَرِقَتْ أَنْ يُفَارِقَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ يَوْمِي لِعَائِشَةَ ‏.‏ فَقَبِلَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْهَا قَالَتْ نَقُولُ فِي ذَلِكَ أَنْزَلَ اللَّهُ تَعَالَى وَفِي أَشْبَاهِهَا أُرَاهُ قَالَ ‏{‏ وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": 2136,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، وَمُحَمَّدُ بْنُ عِيسَى، - الْمَعْنَى - قَالاَ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ، عَنْ عَاصِمٍ، عَنْ مُعَاذَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَأْذِنُنَا إِذَا كَانَ فِي يَوْمِ الْمَرْأَةِ مِنَّا بَعْدَ مَا نَزَلَتْ ‏{‏ تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ ‏}‏ قَالَتْ مُعَاذَةُ فَقُلْتُ لَهَا مَا كُنْتِ تَقُولِينَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ كُنْتُ أَقُولُ إِنْ كَانَ ذَلِكَ إِلَىَّ لَمْ أُوثِرْ أَحَدًا عَلَى نَفْسِي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": 2137,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مَرْحُومُ بْنُ عَبْدِ الْعَزِيزِ الْعَطَّارُ، حَدَّثَنِي أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ يَزِيدَ بْنِ بَابَنُوسَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ إِلَى النِّسَاءِ - تَعْنِي فِي مَرَضِهِ - فَاجْتَمَعْنَ فَقَالَ ‏ \"‏ إِنِّي لاَ أَسْتَطِيعُ أَنْ أَدُورَ بَيْنَكُنَّ فَإِنْ رَأَيْتُنَّ أَنْ تَأْذَنَّ لِيَ فَأَكُونَ عِنْدَ عَائِشَةَ فَعَلْتُنَّ ‏\"‏ ‏.‏ فَأَذِنَّ لَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": 2138,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ وَكَانَ يَقْسِمُ لِكُلِّ امْرَأَةٍ مِنْهُنَّ يَوْمَهَا وَلَيْلَتَهَا غَيْرَ أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ وَهَبَتْ يَوْمَهَا لِعَائِشَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": 2139,
			"text": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ، أَخْبَرَنِي اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِنَّ أَحَقَّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": 2140,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، أَخْبَرَنَا إِسْحَاقُ بْنُ يُوسُفَ، عَنْ شَرِيكٍ، عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ قَيْسِ بْنِ سَعْدٍ، قَالَ أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ فَقُلْتُ رَسُولُ اللَّهِ أَحَقُّ أَنْ يُسْجَدَ لَهُ قَالَ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ إِنِّي أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ فَأَنْتَ يَا رَسُولَ اللَّهِ أَحَقُّ أَنْ نَسْجُدَ لَكَ ‏.‏ قَالَ ‏\"‏ أَرَأَيْتَ لَوْ مَرَرْتَ بِقَبْرِي أَكُنْتَ تَسْجُدُ لَهُ ‏\"‏ ‏.‏ قَالَ قُلْتُ لاَ ‏.‏ قَالَ ‏\"‏ فَلاَ تَفْعَلُوا لَوْ كُنْتُ آمِرًا أَحَدًا أَنْ يَسْجُدَ لأَحَدٍ لأَمَرْتُ النِّسَاءَ أَنْ يَسْجُدْنَ لأَزْوَاجِهِنَّ لِمَا جَعَلَ اللَّهُ لَهُمْ عَلَيْهِنَّ مِنَ الْحَقِّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": 2141,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ فَلَمْ تَأْتِهِ فَبَاتَ غَضْبَانَ عَلَيْهَا لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تُصْبِحَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": 2142,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا أَبُو قَزَعَةَ الْبَاهِلِيُّ، عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ الْقُشَيْرِيِّ، عَنْ أَبِيهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا حَقُّ زَوْجَةِ أَحَدِنَا عَلَيْهِ قَالَ ‏\"‏ أَنْ تُطْعِمَهَا إِذَا طَعِمْتَ وَتَكْسُوَهَا إِذَا اكْتَسَيْتَ - أَوِ اكْتَسَبْتَ - وَلاَ تَضْرِبِ الْوَجْهَ وَلاَ تُقَبِّحْ وَلاَ تَهْجُرْ إِلاَّ فِي الْبَيْتِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏\"‏ وَلاَ تُقَبِّحْ ‏\"‏ ‏.‏ أَنْ تَقُولَ قَبَّحَكِ اللَّهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": 2143,
			"text": "حَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ نِسَاؤُنَا مَا نَأْتِي مِنْهُنَّ وَمَا نَذَرُ قَالَ ‏\"‏ ائْتِ حَرْثَكَ أَنَّى شِئْتَ وَأَطْعِمْهَا إِذَا طَعِمْتَ وَاكْسُهَا إِذَا اكْتَسَيْتَ وَلاَ تُقَبِّحِ الْوَجْهَ وَلاَ تَضْرِبْ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى شُعْبَةُ ‏\"‏ تُطْعِمُهَا إِذَا طَعِمْتَ وَتَكْسُوهَا إِذَا اكْتَسَيْتَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": 2144,
			"text": "أَخْبَرَنِي أَحْمَدُ بْنُ يُوسُفَ الْمُهَلَّبِيُّ النَّيْسَابُورِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ رَزِينٍ، حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ، عَنْ دَاوُدَ الْوَرَّاقِ، عَنْ سَعِيدِ بْنِ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، مُعَاوِيَةَ الْقُشَيْرِيِّ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فَقُلْتُ مَا تَقُولُ فِي نِسَائِنَا قَالَ ‏ \"‏ أَطْعِمُوهُنَّ مِمَّا تَأْكُلُونَ وَاكْسُوهُنَّ مِمَّا تَكْتَسُونَ وَلاَ تَضْرِبُوهُنَّ وَلاَ تُقَبِّحُوهُنَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": 2145,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ أَبِي حُرَّةَ الرَّقَاشِيِّ، عَنْ عَمِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ فَإِنْ خِفْتُمْ نُشُوزَهُنَّ فَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ ‏\"‏ ‏.‏ قَالَ حَمَّادٌ يَعْنِي النِّكَاحَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": 2146,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي خَلَفٍ، وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، - قَالَ ابْنُ السَّرْحِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ - عَنْ إِيَاسِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ذُبَابٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَضْرِبُوا إِمَاءَ اللَّهِ ‏\"‏ ‏.‏ فَجَاءَ عُمَرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ذَئِرْنَ النِّسَاءُ عَلَى أَزْوَاجِهِنَّ ‏.‏ فَرَخَّصَ فِي ضَرْبِهِنَّ فَأَطَافَ بِآلِ رَسُولِ اللَّهِ صلى الله عليه وسلم نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَقَدْ طَافَ بِآلِ مُحَمَّدٍ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ لَيْسَ أُولَئِكَ بِخِيَارِكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": 2147,
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ الأَوْدِيِّ، عَنْ عَبْدِ الرَّحْمَنِ الْمُسْلِيِّ، عَنِ الأَشْعَثِ بْنِ قَيْسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُسْأَلُ الرَّجُلُ فِيمَا ضَرَبَ امْرَأَتَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": 2148,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنِي يُونُسُ بْنُ عُبَيْدٍ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَبِي زُرْعَةَ، عَنْ جَرِيرٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ نَظْرَةِ الْفَجْأَةِ فَقَالَ ‏ \"‏ اصْرِفْ بَصَرَكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2149,
			"arabicnumber": 2149,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى الْفَزَارِيُّ، أَخْبَرَنَا شَرِيكٌ، عَنْ أَبِي رَبِيعَةَ الإِيَادِيِّ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعَلِيٍّ ‏ \"‏ يَا عَلِيُّ لاَ تُتْبِعِ النَّظْرَةَ النَّظْرَةَ فَإِنَّ لَكَ الأُولَى وَلَيْسَتْ لَكَ الآخِرَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2150,
			"arabicnumber": 2150,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ لِتَنْعَتَهَا لِزَوْجِهَا كَأَنَّمَا يَنْظُرُ إِلَيْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": 2151,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى امْرَأَةً فَدَخَلَ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ فَقَضَى حَاجَتَهُ مِنْهَا ثُمَّ خَرَجَ إِلَى أَصْحَابِهِ فَقَالَ لَهُمْ ‏ \"‏ إِنَّ الْمَرْأَةَ تُقْبِلُ فِي صُورَةِ شَيْطَانٍ فَمَنْ وَجَدَ مِنْ ذَلِكَ شَيْئًا فَلْيَأْتِ أَهْلَهُ فَإِنَّهُ يُضْمِرُ مَا فِي نَفْسِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": 2152,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا ابْنُ ثَوْرٍ، عَنْ مَعْمَرٍ، أَخْبَرَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَا أَدْرَكَ ذَلِكَ لاَ مَحَالَةَ فَزِنَا الْعَيْنَيْنِ النَّظَرُ وَزِنَا اللِّسَانِ الْمَنْطِقُ وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي وَالْفَرْجُ يُصَدِّقُ ذَلِكَ وَيُكَذِّبُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": 2153,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لِكُلِّ ابْنِ آدَمَ حَظُّهُ مِنَ الزِّنَا ‏\"‏ ‏.‏ بِهَذِهِ الْقِصَّةِ قَالَ ‏\"‏ وَالْيَدَانِ تَزْنِيَانِ فَزِنَاهُمَا الْبَطْشُ وَالرِّجْلاَنِ تَزْنِيَانِ فَزِنَاهُمَا الْمَشْىُ وَالْفَمُ يَزْنِي فَزِنَاهُ الْقُبَلُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": 2154,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذِهِ الْقِصَّةِ قَالَ ‏ \"‏ وَالأُذُنُ زِنَاهَا الاِسْتِمَاعُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": 2155,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ صَالِحٍ أَبِي الْخَلِيلِ، عَنْ أَبِي عَلْقَمَةَ الْهَاشِمِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ يَوْمَ حُنَيْنٍ بَعْثًا إِلَى أَوْطَاسٍ فَلَقُوا عَدُوَّهُمْ فَقَاتَلُوهُمْ فَظَهَرُوا عَلَيْهِمْ وَأَصَابُوا لَهُمْ سَبَايَا فَكَأَنَّ أُنَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم تَحَرَّجُوا مِنْ غِشْيَانِهِنَّ مِنْ أَجْلِ أَزْوَاجِهِنَّ مِنَ الْمُشْرِكِينَ فَأَنْزَلَ اللَّهُ تَعَالَى فِي ذَلِكَ ‏{‏ وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلاَّ مَا مَلَكَتْ أَيْمَانُكُمْ ‏}‏ أَىْ فَهُنَّ لَهُمْ حَلاَلٌ إِذَا انْقَضَتْ عِدَّتُهُنَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": 2156,
			"text": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا مِسْكِينٌ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ أَبِي الدَّرْدَاءِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ فِي غَزْوَةٍ فَرَأَى امْرَأَةً مُجِحًّا فَقَالَ ‏\"‏ لَعَلَّ صَاحِبَهَا أَلَمَّ بِهَا ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَقَالَ ‏\"‏ لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنَةً تَدْخُلُ مَعَهُ فِي قَبْرِهِ كَيْفَ يُوَرِّثُهُ وَهُوَ لاَ يَحِلُّ لَهُ وَكَيْفَ يَسْتَخْدِمُهُ وَهُوَ لاَ يَحِلُّ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": 2157,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ قَيْسِ بْنِ وَهْبٍ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَرَفَعَهُ، أَنَّهُ قَالَ فِي سَبَايَا أَوْطَاسٍ ‏ \"‏ لاَ تُوطَأُ حَامِلٌ حَتَّى تَضَعَ وَلاَ غَيْرُ ذَاتِ حَمْلٍ حَتَّى تَحِيضَ حَيْضَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2158,
			"arabicnumber": 2158,
			"text": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي مَرْزُوقٍ، عَنْ حَنَشٍ الصَّنْعَانِيِّ، عَنْ رُوَيْفِعِ بْنِ ثَابِتٍ الأَنْصَارِيِّ، قَالَ قَامَ فِينَا خَطِيبًا قَالَ أَمَا إِنِّي لاَ أَقُولُ لَكُمْ إِلاَّ مَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ يَوْمَ حُنَيْنٍ قَالَ ‏\"‏ لاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَسْقِيَ مَاءَهُ زَرْعَ غَيْرِهِ ‏\"‏ ‏.‏ يَعْنِي إِتْيَانَ الْحَبَالَى ‏\"‏ وَلاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَقَعَ عَلَى امْرَأَةٍ مِنَ السَّبْىِ حَتَّى يَسْتَبْرِئَهَا وَلاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَبِيعَ مَغْنَمًا حَتَّى يُقْسَمَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2159,
			"arabicnumber": 2159,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ ابْنِ إِسْحَاقَ، بِهَذَا الْحَدِيثِ قَالَ ‏\"‏ حَتَّى يَسْتَبْرِئَهَا بِحَيْضَةٍ ‏\"‏ ‏.‏ زَادَ فِيهِ ‏{‏ بِحَيْضَةٍ وَهُوَ وَهَمٌ مِنْ أَبِي مُعَاوِيَةَ، وَهُوَ صَحِيحٌ فِي حَدِيثِ أَبِي سَعِيدٍ زَادَ ‏}‏ ‏\"‏ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَرْكَبْ دَابَّةً مِنْ فَىْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَعْجَفَهَا رَدَّهَا فِيهِ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَلْبَسْ ثَوْبًا مِنْ فَىْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَخْلَقَهُ رَدَّهُ فِيهِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ الْحَيْضَةُ لَيْسَتْ بِمَحْفُوظَةٍ وَهُوَ وَهَمٌ مِنْ أَبِي مُعَاوِيَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2160,
			"arabicnumber": 2160,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا أَبُو خَالِدٍ، - يَعْنِي سُلَيْمَانَ بْنَ حَيَّانَ - عَنِ ابْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا تَزَوَّجَ أَحَدُكُمُ امْرَأَةً أَوِ اشْتَرَى خَادِمًا فَلْيَقُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَمِنْ شَرِّ مَا جَبَلْتَهَا عَلَيْهِ وَإِذَا اشْتَرَى بَعِيرًا فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَقُلْ مِثْلَ ذَلِكَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ زَادَ أَبُو سَعِيدٍ ‏\"‏ ثُمَّ لْيَأْخُذْ بِنَاصِيَتِهَا وَلْيَدْعُ بِالْبَرَكَةِ ‏\"‏ ‏.‏ فِي الْمَرْأَةِ وَالْخَادِمِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2161,
			"arabicnumber": 2161,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّ أَحَدَكُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ بِسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا ثُمَّ قُدِّرَ أَنْ يَكُونَ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2162,
			"arabicnumber": 2162,
			"text": "حَدَّثَنَا هَنَّادٌ، عَنْ وَكِيعٍ، عَنْ سُفْيَانَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنِ الْحَارِثِ بْنِ مُخَلَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَلْعُونٌ مَنْ أَتَى امْرَأَتَهُ فِي دُبُرِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2163,
			"arabicnumber": 2163,
			"text": "حَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ إِنَّ الْيَهُودَ يَقُولُونَ إِذَا جَامَعَ الرَّجُلُ أَهْلَهُ فِي فَرْجِهَا مِنْ وَرَائِهَا كَانَ وَلَدُهُ أَحْوَلَ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى ‏{‏ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2164,
			"arabicnumber": 2164,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الأَصْبَغِ، حَدَّثَنِي مُحَمَّدٌ، - يَعْنِي ابْنَ سَلَمَةَ - عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ أَبَانَ بْنِ صَالِحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّ ابْنَ عُمَرَ - وَاللَّهُ يَغْفِرُ لَهُ - أَوْهَمَ إِنَّمَا كَانَ هَذَا الْحَىُّ مِنَ الأَنْصَارِ - وَهُمْ أَهْلُ وَثَنٍ - مَعَ هَذَا الْحَىِّ مِنْ يَهُودَ - وَهُمْ أَهْلُ كِتَابٍ - وَكَانُوا يَرَوْنَ لَهُمْ فَضْلاً عَلَيْهِمْ فِي الْعِلْمِ فَكَانُوا يَقْتَدُونَ بِكَثِيرٍ مِنْ فِعْلِهِمْ وَكَانَ مِنْ أَمْرِ أَهْلِ الْكِتَابِ أَنْ لاَ يَأْتُوا النِّسَاءَ إِلاَّ عَلَى حَرْفٍ وَذَلِكَ أَسْتَرُ مَا تَكُونُ الْمَرْأَةُ فَكَانَ هَذَا الْحَىُّ مِنَ الأَنْصَارِ قَدْ أَخَذُوا بِذَلِكَ مِنْ فِعْلِهِمْ وَكَانَ هَذَا الْحَىُّ مِنْ قُرَيْشٍ يَشْرَحُونَ النِّسَاءَ شَرْحًا مُنْكَرًا وَيَتَلَذَّذُونَ مِنْهُنَّ مُقْبِلاَتٍ وَمُدْبِرَاتٍ وَمُسْتَلْقِيَاتٍ فَلَمَّا قَدِمَ الْمُهَاجِرُونَ الْمَدِينَةَ تَزَوَّجَ رَجُلٌ مِنْهُمُ امْرَأَةً مِنَ الأَنْصَارِ فَذَهَبَ يَصْنَعُ بِهَا ذَلِكَ فَأَنْكَرَتْهُ عَلَيْهِ وَقَالَتْ إِنَّمَا كُنَّا نُؤْتَى عَلَى حَرْفٍ فَاصْنَعْ ذَلِكَ وَإِلاَّ فَاجْتَنِبْنِي حَتَّى شَرِيَ أَمْرُهُمَا فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ ‏}‏ أَىْ مُقْبِلاَتٍ وَمُدْبِرَاتٍ وَمُسْتَلْقِيَاتٍ يَعْنِي بِذَلِكَ مَوْضِعَ الْوَلَدِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2165,
			"arabicnumber": 2165,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ الْيَهُودَ، كَانَتْ إِذَا حَاضَتْ مِنْهُمُ امْرَأَةٌ أَخْرَجُوهَا مِنَ الْبَيْتِ وَلَمْ يُؤَاكِلُوهَا وَلَمْ يُشَارِبُوهَا وَلَمْ يُجَامِعُوهَا فِي الْبَيْتِ فَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏ يَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ ‏}‏ إِلَى آخِرِ الآيَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ جَامِعُوهُنَّ فِي الْبُيُوتِ وَاصْنَعُوا كُلَّ شَىْءٍ غَيْرَ النِّكَاحِ ‏\"‏ ‏.‏ فَقَالَتِ الْيَهُودُ مَا يُرِيدُ هَذَا الرَّجُلُ أَنْ يَدَعَ شَيْئًا مِنْ أَمْرِنَا إِلاَّ خَالَفَنَا فِيهِ ‏.‏ فَجَاءَ أُسَيْدُ بْنُ حُضَيْرٍ وَعَبَّادُ بْنُ بِشْرٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالاَ يَا رَسُولَ اللَّهِ إِنَّ الْيَهُودَ تَقُولُ كَذَا وَكَذَا أَفَلاَ نَنْكِحُهُنَّ فِي الْمَحِيضِ فَتَمَعَّرَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى ظَنَنَّا ��َنْ قَدْ وَجِدَ عَلَيْهِمَا فَخَرَجَا فَاسْتَقْبَلَتْهُمَا هَدِيَّةٌ مِنْ لَبَنٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَعَثَ فِي آثَارِهِمَا فَسَقَاهُمَا فَظَنَنَّا أَنَّهُ لَمْ يَجِدْ عَلَيْهِمَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2166,
			"arabicnumber": 2166,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ جَابِرِ بْنِ صُبْحٍ، قَالَ سَمِعْتُ خِلاَسًا الْهَجَرِيَّ، قَالَ سَمِعْتُ عَائِشَةَ، - رضى الله عنها - تَقُولُ كُنْتُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم نَبِيتُ فِي الشِّعَارِ الْوَاحِدِ وَأَنَا حَائِضٌ طَامِثٌ فَإِنْ أَصَابَهُ مِنِّي شَىْءٌ غَسَلَ مَكَانَهُ وَلَمْ يَعْدُهُ وَإِنْ أَصَابَ - تَعْنِي ثَوْبَهُ - مِنْهُ شَىْءٌ غَسَلَ مَكَانَهُ وَلَمْ يَعْدُهُ وَصَلَّى فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2167,
			"arabicnumber": 2167,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَفْصٌ، عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ خَالَتِهِ، مَيْمُونَةَ بِنْتِ الْحَارِثِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَرَادَ أَنْ يُبَاشِرَ امْرَأَةً مِنْ نِسَائِهِ وَهِيَ حَائِضٌ أَمَرَهَا أَنْ تَتَّزِرَ ثُمَّ يُبَاشِرُهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2168,
			"arabicnumber": 2168,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، - غَيْرُهُ عَنْ سَعِيدٍ، - حَدَّثَنِي الْحَكَمُ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الَّذِي يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ قَالَ ‏ \"‏ يَتَصَدَّقُ بِدِينَارٍ أَوْ بِنِصْفِ دِينَارٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2169,
			"arabicnumber": 2169,
			"text": "حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ مُطَهَّرٍ، حَدَّثَنَا جَعْفَرٌ، - يَعْنِي ابْنَ سُلَيْمَانَ - عَنْ عَلِيِّ بْنِ الْحَكَمِ الْبُنَانِيِّ، عَنْ أَبِي الْحَسَنِ الْجَزَرِيِّ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِذَا أَصَابَهَا فِي الدَّمِ فَدِينَارٌ وَإِذَا أَصَابَهَا فِي انْقِطَاعِ الدَّمِ فَنِصْفُ دِينَارٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2170,
			"arabicnumber": 2170,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِسْمَاعِيلَ الطَّالْقَانِيُّ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ قَزَعَةَ، عَنْ أَبِي سَعِيدٍ، ذُكِرَ ذَلِكَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم - يَعْنِي الْعَزْلَ - قَالَ ‏\"‏ فَلِمَ يَفْعَلُ أَحَدُكُمْ ‏\"‏ ‏.‏ وَلَمْ يَقُلْ فَلاَ يَفْعَلْ أَحَدُكُمْ ‏\"‏ فَإِنَّهُ لَيْسَتْ مِنْ نَفْسٍ مَخْلُوقَةٍ إِلاَّ اللَّهُ خَالِقُهَا ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ قَزَعَةُ مَوْلَى زِيَادٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2171,
			"arabicnumber": 2171,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبَانُ، حَدَّثَنَا يَحْيَى، أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، حَدَّثَهُ أَنَّ رِفَاعَةَ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي جَارِيَةً وَأَنَا أَعْزِلُ عَنْهَا وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ وَأَنَا أُرِيدُ مَا يُرِيدُ الرِّجَالُ وَإِنَّ الْيَهُودَ تُحَدِّثُ أَنَّ الْعَزْلَ مَوْءُودَةُ الصُّغْرَى ‏.‏ قَالَ ‏ \"‏ كَذَبَتْ يَهُودُ لَوْ أَرَادَ اللَّهُ أَنْ يَخْلُقَهُ مَا اسْتَطَعْتَ أَنْ تَصْرِفَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2172,
			"arabicnumber": 2172,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، قَالَ دَخَلْتُ الْمَسْجِدَ فَرَأَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ فَجَلَسْتُ إِلَيْهِ فَسَأَلْتُهُ عَنِ الْعَزْلِ، فَقَالَ أَبُو سَعِيدٍ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ بَنِي الْمُصْطَلِقِ فَأَصَبْنَا سَبْيًا مِنْ سَبْىِ الْعَرَبِ فَاشْتَهَيْنَا النِّسَاءَ وَاشْتَدَّتْ عَلَيْنَا الْعُزْبَةُ وَأَحْبَبْنَا الْفِدَاءَ فَأَرَدْنَا أَنْ نَعْزِلَ ثُمَّ قُلْنَا نَعْزِلُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا قَبْلَ أَنْ نَسْأَلَهُ عَنْ ذَلِكَ فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ ‏ \"‏ مَا عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ وَهِيَ كَائِنَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2173,
			"arabicnumber": 2173,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ جَاءَ رَجُلٌ مِنَ الأَنْصَارِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ لِي جَارِيَةً أَطُوفُ عَلَيْهَا وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ ‏.‏ فَقَالَ ‏\"‏ اعْزِلْ عَنْهَا إِنْ شِئْتَ فَإِنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا ‏\"‏ ‏.‏ قَالَ فَلَبِثَ الرَّجُلُ ثُمَّ أَتَاهُ فَقَالَ إِنَّ الْجَارِيَةَ قَدْ حَمَلَتْ ‏.‏ قَالَ ‏\"‏ قَدْ أَخْبَرْتُكَ أَنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2174,
			"arabicnumber": 2174,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا الْجُرَيْرِيُّ، ح وَحَدَّثَنَا مُؤَمَّلٌ، حَدَّثَنَا إِسْمَاعِيلُ، ح وَحَدَّثَنَا مُوسَى، حَدَّثَنَا حَمَّادٌ، كُلُّهُمْ عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، حَدَّثَنِي شَيْخٌ، مِنْ طُفَاوَةَ قَالَ تَثَوَّيْتُ أَبَا هُرَيْرَةَ بِالْمَدِينَةِ فَلَمْ أَرَ رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَشَدَّ تَشْمِيرًا وَلاَ أَقْوَمَ عَلَى ضَيْفٍ مِنْهُ فَبَيْنَمَا أَنَا عِنْدَهُ يَوْمًا وَهُوَ عَلَى سَرِيرٍ لَهُ وَمَعَهُ كِيسٌ فِيهِ حَصًى أَوْ نَوًى - وَأَسْفَلُ مِنْهُ جَارِيَةٌ لَهُ سَوْدَاءُ - وَهُوَ يُسَبِّحُ بِهَا حَتَّى إِذَا أَنْفَدَ مَا فِي الْكِيسِ أَلْقَاهُ إِلَيْهَا فَجَمَعَتْهُ فَأَعَادَتْهُ فِي الْكِيسِ فَدَفَعَتْهُ إِلَيْهِ فَقَالَ أَلاَ أُحَدِّثُكَ عَنِّي وَعَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ قُلْتُ بَلَى ‏.‏ قَالَ بَيْنَا أَنَا أُوعَكُ فِي الْمَسْجِدِ إِذْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى دَخَلَ الْمَسْجِدَ ‏.‏ فَقَالَ ‏\"‏ مَنْ أَحَسَّ الْفَتَى الدَّوْسِيَّ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هُوَ ذَا يُوعَكُ فِي جَانِبِ الْمَسْجِدِ فَأَقْبَلَ يَمْشِي حَتَّى انْتَهَى إِلَىَّ فَوَضَعَ يَدَهُ عَلَىَّ فَقَالَ لِي مَعْرُوفًا فَنَهَضْتُ فَانْطَلَقَ يَمْشِي حَتَّى أَتَى مَقَامَهُ الَّذِي يُصَلِّي فِيهِ فَأَقْبَلَ عَلَيْهِمْ وَمَعَهُ صَفَّانِ مِنْ رِجَالٍ وَصَفٌّ مِنْ نِسَاءٍ أَوْ صَفَّانِ مِنْ نِسَاءٍ وَصَفٌّ مِنْ رِجَالٍ فَقَالَ ‏\"‏ إِنْ أَنْسَانِي الشَّيْطَانُ شَيْئًا مِنْ صَلاَتِي فَلْيُسَبِّحِ الْقَوْمُ وَلْيُصَفِّقِ النِّسَاءُ ‏\"‏ ‏.‏ قَالَ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ يَنْسَ مِنْ صَلاَتِهِ شَيْئًا ‏.‏ فَقَالَ ‏\"‏ مَجَالِسَكُمْ مَجَالِسَكُمْ ‏\"‏ ‏.‏ زَادَ مُوسَى ‏\"‏ هَا هُنَا ‏\"‏ ‏.‏ ثُمَّ حَمِدَ اللَّهَ تَعَالَى وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏ ‏.‏ ثُمَّ اتَّفَقُوا ثُمَّ أَقْبَلَ عَلَى الرِّجَالِ فَقَالَ ‏\"‏ هَلْ مِنْكُمُ الرَّجُلُ إِذَا أَتَى أَهْلَهُ فَأَغْلَقَ عَلَيْهِ بَابَهُ وَأَلْقَى عَلَيْهِ سِتْرَهُ وَاسْتَتَرَ بِسِتْرِ اللَّهِ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ ثُمَّ يَجْلِسُ بَعْدَ ذَلِكَ فَيَقُولُ فَعَلْتُ كَذَا فَعَلْتُ كَذَا ‏\"‏ ‏.‏ قَالَ فَسَكَتُوا قَالَ فَأَقْبَلَ عَلَى النِّسَاءِ فَقَالَ ‏\"‏ هَلْ مِنْكُنَّ مَنْ تُحَدِّثُ ‏\"‏ ‏.‏ فَسَكَتْنَ فَجَثَتْ فَتَاةٌ - قَالَ مُؤَمَّلٌ فِي حَدِيثِهِ فَتَاةٌ كَعَابٌ - عَلَى إِحْدَى رُكْبَتَيْهَا وَتَطَاوَلَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم لِيَرَاهَا وَيَسْمَعَ كَلاَمَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُمْ لَيَتَحَدَّثُونَ وَإِنَّهُنَّ لَيَتَحَدَّثْنَهْ فَقَالَ ‏\"‏ هَلْ تَدْرُونَ مَا مَثَلُ ذَلِكَ ‏\"‏ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا ذَلِكَ مَثَلُ شَيْطَانَةٍ لَقِيَتْ شَيْطَانًا فِي السِّكَّةِ فَقَضَى مِنْهَا حَاجَتَهُ وَالنَّاسُ يَنْظُرُونَ إِلَيْهِ أَلاَ وَإِنَّ طِيبَ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَلَمْ يَظْهَرْ لَوْنُهُ أَلاَ إِنَّ طِيبَ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَلَمْ يَظْهَرْ رِيحُهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ مِنْ هَا هُنَا حَفِظْتُهُ عَنْ مُؤَمَّلٍ وَمُوسَى ‏\"‏ أَلاَ لاَ يُفْضِيَنَّ رَجُلٌ إِلَى رَجُلٍ وَلاَ امْرَأَةٌ إِلَى امْرَأَةٍ إِلاَّ إِلَى وَلَدٍ أَوْ وَالِدٍ ‏\"‏ ‏.‏ وَذَكَرَ ثَالِثَةً فَأُنْسِيتُهَا وَهُوَ فِي حَدِيثِ مُسَدَّدٍ وَلَكِنِّي لَمْ أُتْقِنْهُ كَمَا أُحِبُّ وَقَالَ مُوسَى حَدَّثَنَا حَمَّادٌ عَنِ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنِ الطُّفَاوِيِّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 129
			}
		}
	]
}