{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3089,
			"arabicnumber": 3089,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي رَجُلٌ، مِنْ أَهْلِ الشَّامِ يُقَالُ لَهُ أَبُو مَنْظُورٍ عَنْ عَمِّهِ، قَالَ حَدَّثَنِي عَمِّي، عَنْ عَامِرٍ الرَّامِ، أَخِي الْخُضْرِ - قَالَ أَبُو دَاوُدَ قَالَ النُّفَيْلِيُّ هُوَ الْخُضْرُ وَلَكِنْ كَذَا قَالَ - قَالَ إِنِّي لَبِبِلاَدِنَا إِذْ رُفِعَتْ لَنَا رَايَاتٌ وَأَلْوِيَةٌ فَقُلْتُ مَا هَذَا قَالُوا هَذَا لِوَاءُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُهُ وَهُوَ تَحْتَ شَجَرَةٍ قَدْ بُسِطَ لَهُ كِسَاءٌ وَهُوَ جَالِسٌ عَلَيْهِ وَقَدِ اجْتَمَعَ إِلَيْهِ أَصْحَابُهُ فَجَلَسْتُ إِلَيْهِمْ فَذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم الأَسْقَامَ فَقَالَ ‏\"‏ إِنَّ الْمُؤْمِنَ إِذَا أَصَابَهُ السَّقَمُ ثُمَّ أَعْفَاهُ اللَّهُ مِنْهُ كَانَ كَفَّارَةً لِمَا مَضَى مِنْ ذُنُوبِهِ وَمَوْعِظَةً لَهُ فِيمَا يَسْتَقْبِلُ وَإِنَّ الْمُنَافِقَ إِذَا مَرِضَ ثُمَّ أُعْفِيَ كَانَ كَالْبَعِيرِ عَقَلَهُ أَهْلُهُ ثُمَّ أَرْسَلُوهُ فَلَمْ يَدْرِ لِمَ عَقَلُوهُ وَلَمْ يَدْرِ لِمَ أَرْسَلُوهُ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِمَّنْ حَوْلَهُ يَا رَسُولَ اللَّهِ وَمَا الأَسْقَامُ وَاللَّهِ مَا مَرِضْتُ قَطُّ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُمْ عَنَّا فَلَسْتَ مِنَّا ‏\"‏ ‏.‏ فَبَيْنَا نَحْنُ عِنْدَهُ إِذْ أَقْبَلَ رَجُلٌ عَلَيْهِ كِسَاءٌ وَفِي يَدِهِ شَىْءٌ قَدِ الْتَفَّ عَلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَمَّا رَأَيْتُكَ أَقْبَلْتُ إِلَيْكَ فَمَرَرْتُ بِغَيْضَةِ شَجَرٍ فَسَمِعْتُ فِيهَا أَصْوَاتَ فِرَاخِ طَائِرٍ فَأَخَذْتُهُنَّ فَوَضَعْتُهُنَّ فِي كِسَائِي فَجَاءَتْ أُمُّهُنَّ فَاسْتَدَارَتْ عَلَى رَأْسِي فَكَشَفْتُ لَهَا عَنْهُنَّ فَوَقَعَتْ عَلَيْهِنَّ مَعَهُنَّ فَلَفَفْتُهُنَّ بِكِسَائِي فَهُنَّ أُولاَءِ مَعِي ‏.‏ قَالَ ‏\"‏ ضَعْهُنَّ عَنْكَ ‏\"‏ ‏.‏ فَوَضَعْتُهُنَّ وَأَبَتْ أُمُّهُنَّ إِلاَّ لُزُومَهُنَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ أَتَعْجَبُونَ لِرُحْمِ أُمِّ الأَفْرَاخِ فِرَاخَهَا ‏\"‏ ‏.‏ قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ‏\"‏ فَوَالَّذِي بَعَثَنِي بِالْحَقِّ لَلَّهُ أَرْحَمُ بِعِبَادِهِ مِنْ أُمِّ الأَفْرَاخِ بِفِرَاخِهَا ارْجِعْ بِهِنَّ حَتَّى تَضَعَهُنَّ مِنْ حَيْثُ أَخَذْتَهُنَّ وَأُمُّهُنَّ مَعَهُنَّ ‏\"‏ ‏.‏ فَرَجَعَ بِهِنَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3090,
			"arabicnumber": 3090,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، وَإِبْرَاهِيمُ بْنُ مَهْدِيٍّ الْمِصِّيصِيُّ، - الْمَعْنَى - قَالاَ حَدَّثَنَا أَبُو الْمَلِيحِ، عَنْ مُحَمَّدِ بْنِ خَالِدٍ، - قَالَ أَبُو دَاوُدَ قَالَ إِبْرَاهِيمُ بْنُ مَهْدِيٍّ السُّلَمِيُّ - عَنْ أَبِيهِ، عَنْ جَدِّهِ، وَكَانَتْ، لَهُ صُحْبَةٌ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ الْعَبْدَ إِذَا سَبَقَتْ لَهُ مِنَ اللَّهِ مَنْزِلَةٌ لَمْ يَبْلُغْهَا بِعَمَلِهِ ابْتَلاَهُ اللَّهُ فِي جَسَدِهِ أَوْ فِي مَالِهِ أَوْ فِي وَلَدِهِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ زَادَ ابْنُ نُفَيْلٍ ‏\"‏ ثُمَّ صَبَّرَهُ عَلَى ذَلِكَ ‏\"‏ ‏.‏ ثُمَّ اتَّفَقَا ‏\"‏ حَتَّى يُبْلِغَهُ الْمَنْزِلَةَ الَّتِي سَبَقَتْ لَهُ مِنَ اللَّهِ تَعَالَى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3091,
			"arabicnumber": 3091,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، وَمُسَدَّدٌ، - الْمَعْنَى - قَالاَ حَدَّثَنَا هُشَيْمٌ، عَنِ الْعَوَّامِ بْنِ حَوْشَبٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ السَّكْسَكِيِّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم غَيْرَ مَرَّةٍ وَلاَ مَرَّتَيْنِ يَقُولُ ‏ \"‏ إِذَا كَانَ الْعَبْدُ يَعْمَلُ عَمَلاً صَالِحًا فَشَغَلَهُ عَنْهُ مَرَضٌ أَوْ سَفَرٌ كُتِبَ لَهُ كَصَالِحِ مَا كَانَ يَعْمَلُ وَهُوَ صَحِيحٌ مُقِيمٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3092,
			"arabicnumber": 3092,
			"text": "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ، عَنْ أَبِي عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أُمِّ الْعَلاَءِ، قَالَتْ عَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا مَرِيضَةٌ فَقَالَ ‏ \"‏ أَبْشِرِي يَا أُمَّ الْعَلاَءِ فَإِنَّ مَرَضَ الْمُسْلِمِ يُذْهِبُ اللَّهُ بِهِ خَطَايَاهُ كَمَا تُذْهِبُ النَّارُ خَبَثَ الذَّهَبِ وَالْفِضَّةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3093,
			"arabicnumber": 3093,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، - قَالَ أَبُو دَاوُدَ وَهَذَا لَفْظُ ابْنِ بَشَّارٍ - عَنْ أَبِي عَامِرٍ الْخَزَّازِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي لأَعْلَمُ أَشَدَّ آيَةٍ فِي الْقُرْآنِ قَالَ ‏\"‏ أَيَّةُ آيَةٍ يَا عَائِشَةُ ‏\"‏ ‏.‏ قَالَتْ قَوْلُ اللَّهِ تَعَالَى ‏{‏ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ ‏}‏ قَالَ ‏\"‏ أَمَا عَلِمْتِ يَا عَائِشَةُ أَنَّ الْمُؤْمِنَ تُصِيبُهُ النَّكْبَةُ أَوِ الشَّوْكَةُ فَيُكَافَأُ بِأَسْوَإِ عَمَلِهِ وَمَنْ حُوسِبَ عُذِّبَ ‏\"‏ ‏.‏ قَالَتْ أَلَيْسَ اللَّهُ يَقُولُ ‏{‏ فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ‏}‏ قَالَ ‏\"‏ ذَاكُمُ الْعَرْضُ يَا عَائِشَةُ مَنْ نُوقِشَ الْحِسَابَ عُذِّبَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا لَفْظُ ابْنِ بَشَّارٍ قَالَ أَخْبَرَنَا ابْنُ أَبِي مُلَيْكَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ فَلَمَّا دَخَلَ عَلَيْهِ عَرَفَ فِيهِ الْمَوْتَ قَالَ ‏ \"‏ قَدْ كُنْتُ أَنْهَاكَ عَنْ حُبِّ يَهُودَ ‏\"‏ ‏.‏ قَالَ فَقَدْ أَبْغَضَهُمْ أَسْعَدُ بْنُ زُرَارَةَ فَمَهْ فَلَمَّا مَاتَ أَتَاهُ ابْنُهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عَبْدَ اللَّهِ بْنَ أُبَىٍّ قَدْ مَاتَ فَأَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ ‏.‏ فَنَزَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَمِيصَهُ فَأَعْطَاهُ إِيَّاهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3095,
			"arabicnumber": 3095,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ غُلاَمًا، مِنَ الْيَهُودِ كَانَ مَرِضَ فَأَتَاهُ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ فَقَعَدَ عِنْدَ رَأْسِهِ فَقَالَ لَهُ ‏\"‏ أَسْلِمْ ‏\"‏ ‏.‏ فَنَظَرَ إِلَى أَبِيهِ وَهُوَ عِنْدَ رَأْسِهِ فَقَالَ لَهُ أَبُوهُ أَطِعْ أَبَا الْقَاسِمِ ‏.‏ فَأَسْلَمَ فَقَامَ النَّبِيُّ صلى الله عليه وسلم وَهُوَ يَقُولُ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي أَنْقَذَهُ بِي مِنَ النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3096,
			"arabicnumber": 3096,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي لَيْسَ بِرَاكِبِ بَغْلٍ وَلاَ بِرْذَوْنٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3097,
			"arabicnumber": 3097,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ، حَدَّثَنَا الرَّبِيعُ بْنُ رَوْحِ بْنِ خُلَيْدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ، حَدَّثَنَا الْفَضْلُ بْنُ دَلْهَمٍ الْوَاسِطِيُّ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ وَعَادَ أَخَاهُ الْمُسْلِمَ مُحْتَسِبًا بُوعِدَ مِنْ جَهَنَّمَ مَسِيرَةَ سَبْعِينَ خَرِيفًا ‏\"‏ ‏.‏ قُلْتُ يَا أَبَا حَمْزَةَ وَمَا الْخَرِيفُ قَالَ الْعَامُ ‏.‏ قَالَ أَبُو دَاوُدَ وَالَّذِي تَفَرَّدَ بِهِ الْبَصْرِيُّونَ مِنْهُ الْعِيَادَةُ وَهُوَ مُتَوَضِّئٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3098,
			"arabicnumber": 3098,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عَبْدِ اللَّهِ بْنِ نَافِعٍ، عَنْ عَلِيٍّ، قَالَ مَا مِنْ رَجُلٍ يَعُودُ مَرِيضًا مُمْسِيًا إِلاَّ خَرَجَ مَعَهُ سَبْعُونَ أَلْفَ مَلَكٍ يَسْتَغْفِرُونَ لَهُ حَتَّى يُصْبِحَ وَكَانَ لَهُ خَرِيفٌ فِي الْجَنَّةِ وَمَنْ أَتَاهُ مُصْبِحًا خَرَجَ مَعَهُ سَبْعُونَ أَلْفَ مَلَكٍ يَسْتَغْفِرُونَ لَهُ حَتَّى يُمْسِيَ وَكَانَ لَهُ خَرِيفٌ فِي الْجَنَّةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3099,
			"arabicnumber": 3099,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ لَمْ يَذْكُرِ الْخَرِيفَ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ مَنْصُورٌ عَنِ الْحَكَمِ أَبِي حَفْصٍ كَمَا رَوَاهُ شُعْبَةُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3100,
			"arabicnumber": 3100,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْحَكَمِ، عَنْ أَبِي جَعْفَرٍ عَبْدِ اللَّهِ بْنِ نَافِعٍ، قَالَ - وَكَانَ نَافِعٌ غُلاَمَ الْحَسَنِ بْنِ عَلِيٍّ - قَالَ جَاءَ أَبُو مُوسَى إِلَى الْحَسَنِ بْنِ عَلِيٍّ يَعُودُهُ ‏.‏ قَالَ أَبُو دَاوُدَ وَسَاقَ مَعْنَى حَدِيثِ شُعْبَةَ ‏.‏ قَالَ أَبُو دَاوُدَ أُسْنِدَ هَذَا عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِنْ غَيْرِ وَجْهٍ صَحِيحٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3101,
			"arabicnumber": 3101,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا أُصِيبَ سَعْدُ بْنُ مُعَاذٍ يَوْمَ الْخَنْدَقِ رَمَاهُ رَجُلٌ فِي الأَكْحَلِ فَضَرَبَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْمَةً فِي الْمَسْجِدِ فَيَعُودُهُ مِنْ قَرِيبٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3102,
			"arabicnumber": 3102,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنْ يُونُسَ بْنِ أَبِي إِسْحَاقَ، عَنْ أَبِيهِ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ عَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ وَجَعٍ كَانَ بِعَيْنَىَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3103,
			"arabicnumber": 3103,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تُقْدِمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ يَعْنِي الطَّاعُونَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3104,
			"arabicnumber": 3104,
			"text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْجُعَيْدُ، عَنْ عَائِشَةَ بِنْتِ سَعْدٍ، أَنَّ أَبَاهَا، قَالَ اشْتَكَيْتُ بِمَكَّةَ فَجَاءَنِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَوَضَعَ يَدَهُ عَلَى جَبْهَتِي ثُمَّ مَسَحَ صَدْرِي وَبَطْنِي ثُمَّ قَالَ ‏ \"‏ اللَّهُمَّ اشْفِ سَعْدًا وَأَتْمِمْ لَهُ هِجْرَتَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3105,
			"arabicnumber": 3105,
			"text": "حَدَّثَنَا ابْنُ كَثِيرٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَطْعِمُوا الْجَائِعَ وَعُودُوا الْمَرِيضَ وَفُكُّوا الْعَانِيَ ‏\"‏ ‏.‏ قَالَ سُفْيَانُ وَالْعَانِي الأَسِيرُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3106,
			"arabicnumber": 3106,
			"text": "حَدَّثَنَا الرَّبِيعُ بْنُ يَحْيَى، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا يَزِيدُ أَبُو خَالِدٍ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ عَادَ مَرِيضًا لَمْ يَحْضُرْ أَجَلُهُ فَقَالَ عِنْدَهُ سَبْعَ مِرَارٍ أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ إِلاَّ عَافَاهُ اللَّهُ مِنْ ذَلِكَ الْمَرَضِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3107,
			"arabicnumber": 3107,
			"text": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ حُيَىِّ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنِ ابْنِ عَمْرٍو، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا جَاءَ الرَّجُلُ يَعُودُ مَرِيضًا فَلْيَقُلِ اللَّهُمَّ اشْفِ عَبْدَكَ يَنْكَأُ لَكَ عَدُوًّا أَوْ يَمْشِي لَكَ إِلَى جَنَازَةٍ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَقَالَ ابْنُ السَّرْحِ ‏\"‏ إِلَى صَلاَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3108,
			"arabicnumber": 3108,
			"text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَدْعُوَنَّ أَحَدُكُمْ بِالْمَوْتِ لِضُرٍّ نَزَلَ بِهِ وَلَكِنْ لِيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3109,
			"arabicnumber": 3109,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ ‏\"‏ ‏.‏ فَذَكَرَ مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3110,
			"arabicnumber": 3110,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ مَنْصُورٍ، عَنْ تَمِيمِ بْنِ سَلَمَةَ، أَوْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ عُبَيْدِ بْنِ خَالِدٍ السُّلَمِيِّ، - رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ مَرَّةً عَنِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَالَ مَرَّةً عَنْ عُبَيْدٍ - قَالَ ‏ \"‏ مَوْتُ الْفَجْأَةِ أَخْذَةُ أَسَفٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3111,
			"arabicnumber": 3111,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَابِرِ بْنِ عَتِيكٍ، عَنْ عَتِيكِ بْنِ الْحَارِثِ بْنِ عَتِيكٍ، - وَهُوَ جَدُّ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَبُو أُمِّهِ - أَنَّهُ أَخْبَرَهُ أَنَّ عَمَّهُ جَابِرَ بْنَ عَتِيكٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَ يَعُودُ عَبْدَ اللَّهِ بْنَ ثَابِتٍ فَوَجَدَهُ قَدْ غُلِبَ فَصَاحَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يُجِبْهُ فَاسْتَرْجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ غُلِبْنَا عَلَيْكَ يَا أَبَا الرَّبِيعِ ‏\"‏ ‏.‏ فَصَاحَ النِّسْوَةُ وَبَكَيْنَ فَجَعَلَ ابْنُ عَتِيكٍ يُسْكِتُهُنَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَعْهُنَّ فَإِذَا وَجَبَ فَلاَ تَبْكِيَنَّ بَاكِيَةٌ ‏\"‏ ‏.‏ قَالُوا وَمَا الْوُجُوبُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْمَوْتُ ‏\"‏ ‏.‏ قَالَتِ ابْنَتُهُ وَاللَّهِ إِنْ كُنْتُ لأَرْجُو أَنْ تَكُونَ شَهِيدًا فَإِنَّكَ كُنْتَ قَدْ قَضَيْتَ جِهَازَكَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ أَوْقَعَ أَجْرَهُ عَلَى قَدْرِ نِيَّتِهِ وَمَا تَعُدُّونَ الشَّهَادَةَ ‏\"‏ ‏.‏ قَالُوا الْقَتْلَ فِي سَبِيلِ اللَّهِ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الشَّهَادَةُ سَبْعٌ سِوَى الْقَتْلِ فِي سَبِيلِ اللَّهِ الْمَطْعُونُ شَهِيدٌ وَالْغَرِقُ شَهِيدٌ وَصَاحِبُ ذَاتِ الْجَنْبِ شَهِيدٌ وَالْمَبْطُونُ شَهِيدٌ وَصَاحِبُ الْحَرِيقِ شَهِيدٌ وَالَّذِي يَمُوتُ تَحْتَ الْهَدْمِ شَهِيدٌ وَالْمَرْأَةُ تَمُوتُ بِجُمْعٍ شَهِيدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3112,
			"arabicnumber": 3112,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، أَخْبَرَنِي عُمَرُ بْنُ جَارِيَةَ الثَّقَفِيُّ، حَلِيفُ بَنِي زُهْرَةَ - وَكَانَ مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ - عَنْ أَبِي هُرَيْرَةَ، قَالَ ابْتَاعَ بَنُو الْحَارِثِ بْنِ عَامِرِ بْنِ نَوْفَلٍ خُبَيْبًا - وَكَانَ خُبَيْبٌ هُوَ قَتَلَ الْحَارِثَ بْنَ عَامِرٍ يَوْمَ بَدْرٍ - فَلَبِثَ خُبَيْبٌ عِنْدَهُمْ أَسِيرًا حَتَّى أَجْمَعُوا لِقَتْلِهِ فَاسْتَعَارَ مِنَ ابْنَةِ الْحَارِثِ مُوسَى يَسْتَحِدُّ بِهَا فَأَعَارَتْهُ فَدَرَجَ بُنَىٌّ لَهَا وَهِيَ غَافِلَةٌ حَتَّى أَتَتْهُ فَوَجَدَتْهُ مُخْلِيًا وَهُوَ عَلَى فَخِذِهِ وَالْمُوسَى بِيَدِهِ فَفَزِعَتْ فَزْعَةً عَرَفَهَا فِيهَا فَقَالَ أَتَخْشَيْنَ أَنْ أَقْتُلَهُ مَا كُنْتُ لأَفْعَلَ ذَلِكَ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى هَذِهِ الْقِصَّةَ شُعَيْبُ بْنُ أَبِي حَمْزَةَ عَنِ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عِيَاضٍ أَنَّ ابْنَةَ الْحَارِثِ أَخْبَرَتْهُ أَنَّهُمْ حِينَ اجْتَمَعُوا - يَعْنِي لِقَتْلِهِ - اسْتَعَارَ مِنْهَا مُوسَى يَسْتَحِدُّ بِهَا فَأَعَارَتْهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3113,
			"arabicnumber": 3113,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ قَبْلَ مَوْتِهِ بِثَلاَثٍ قَالَ ‏ \"‏ لاَ يَمُوتُ أَحَدُكُمْ إِلاَّ وَهُوَ يُحْسِنُ الظَّنَّ بِاللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3114,
			"arabicnumber": 3114,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ، عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ لَمَّا حَضَرَهُ الْمَوْتُ دَعَا بِثِيَابٍ جُدُدٍ فَلَبِسَهَا ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ الْمَيِّتَ يُبْعَثُ فِي ثِيَابِهِ الَّتِي يَمُوتُ فِيهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3115,
			"arabicnumber": 3115,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا حَضَرْتُمُ الْمَيِّتَ فَقُولُوا خَيْرًا فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ فَلَمَّا مَاتَ أَبُو سَلَمَةَ قُلْتُ يَا رَسُولَ اللَّهِ مَا أَقُولُ قَالَ ‏\"‏ قُولِي اللَّهُمَّ اغْفِرْ لَهُ وَأَعْقِبْنَا عُقْبَى صَالِحَةً ‏\"‏ ‏.‏ قَالَتْ فَأَعْقَبَنِي اللَّهُ تَعَالَى بِهِ مُحَمَّدًا صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3116,
			"arabicnumber": 3116,
			"text": "حَدَّثَنَا مَالِكُ بْنُ عَبْدِ الْوَاحِدِ الْمِسْمَعِيُّ، حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنِي صَالِحُ بْنُ أَبِي عَرِيبٍ، عَنْ كَثِيرِ بْنِ مُرَّةَ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَ آخِرُ كَلاَمِهِ لاَ إِلَهَ إِلاَّ اللَّهُ دَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3117,
			"arabicnumber": 3117,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، حَدَّثَنَا يَحْيَى بْنُ عُمَارَةَ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَقِّنُوا مَوْتَاكُمْ قَوْلَ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3118,
			"arabicnumber": 3118,
			"text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ حَبِيبٍ أَبُو مَرْوَانَ، حَدَّثَنَا أَبُو إِسْحَاقَ، - يَعْنِي الْفَزَارِيَّ - عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى أَبِي سَلَمَةَ وَقَدْ شَقَّ بَصَرُهُ فَأَغْمَضَهُ فَصَيَّحَ نَاسٌ مِنْ أَهْلِهِ فَقَالَ ‏\"‏ لاَ تَدْعُوا عَلَى أَنْفُسِكُمْ إِلاَّ بِخَيْرٍ فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لأَبِي سَلَمَةَ وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ وَاغْفِرْ لَنَا وَلَهُ رَبَّ الْعَالَمِينَ اللَّهُمَّ افْسَحْ لَهُ فِي قَبْرِهِ وَنَوِّرْ لَهُ فِيهِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَتَغْمِيضُ الْمَيِّتِ بَعْدَ خُرُوجِ الرُّوحِ سَمِعْتُ مُحَمَّدَ بْنَ مُحَمَّدِ بْنِ النُّعْمَانِ الْمُقْرِئَ قَالَ سَمِعْتُ أَبَا مَيْسَرَةَ رَجُلاً عَابِدًا يَقُولُ غَمَّضْتُ جَعْفَرًا الْمُعَلِّمَ وَكَانَ رَجُلاً عَابِدًا فِي حَالَةِ الْمَوْتِ فَرَأَيْتُهُ فِي مَنَامِي لَيْلَةَ مَاتَ يَقُولُ أَعْظَمُ مَا كَانَ عَلَىَّ تَغْمِيضُكَ لِي قَبْلَ أَنْ أَمُوتَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3119,
			"arabicnumber": 3119,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنِ ابْنِ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا أَصَابَتْ أَحَدَكُمْ مُصِيبَةٌ فَلْيَقُلْ ‏{‏ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ ‏}‏ اللَّهُمَّ عِنْدَكَ أَحْتَسِبُ مُصِيبَتِي فَآجِرْنِي فِيهَا وَأَبْدِلْ لِي خَيْرًا مِنْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3120,
			"arabicnumber": 3120,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُجِّيَ فِي ثَوْبٍ حِبَرَةٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3121,
			"arabicnumber": 3121,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، وَمُحَمَّدُ بْنُ مَكِّيٍّ الْمَرْوَزِيُّ، - الْمَعْنَى - قَالاَ حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، - وَلَيْسَ بِالنَّهْدِيِّ - عَنْ أَبِيهِ، عَنْ مَعْقِلِ بْنِ يَسَارٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اقْرَءُوا ‏{‏ يس ‏}‏ عَلَى مَوْتَاكُمْ ‏\"‏ ‏.‏ وَهَذَا لَفْظُ ابْنِ الْعَلاَءِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3122,
			"arabicnumber": 3122,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا قُتِلَ زَيْدُ بْنُ حَارِثَةَ وَجَعْفَرٌ وَعَبْدُ اللَّهِ بْنُ رَوَاحَةَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ يُعْرَفُ فِي وَجْهِهِ الْحُزْنُ وَذَكَرَ الْقِصَّةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3123,
			"arabicnumber": 3123,
			"text": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ، حَدَّثَنَا الْمُفَضَّلُ، عَنْ رَبِيعَةَ بْنِ سَيْفٍ الْمَعَافِرِيِّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ قَبَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم - يَعْنِي مَيِّتًا - فَلَمَّا فَرَغْنَا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَانْصَرَفْنَا مَعَهُ فَلَمَّا حَاذَى بَابَهُ وَقَفَ فَإِذَا نَحْنُ بِامْرَأَةٍ مُقْبِلَةٍ - قَالَ أَظُنُّهُ عَرَفَهَا - فَلَمَّا ذَهَبَتْ إِذَا هِيَ فَاطِمَةُ - عَلَيْهَا السَّلاَمُ - فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا أَخْرَجَكِ يَا فَاطِمَةُ مِنْ بَيْتِكِ ‏\"‏ ‏.‏ فَقَالَتْ أَتَيْتُ يَا رَسُولَ اللَّهِ أَهْلَ هَذَا الْبَيْتِ فَرَحَّمْتُ إِلَيْهِمْ مَيِّتَهُمْ أَوْ عَزَّيْتُهُمْ بِهِ ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلَعَلَّكِ بَلَغْتِ مَعَهُمُ الْكُدَى ‏\"‏ ‏.‏ قَالَتْ مَعَاذَ اللَّهِ وَقَدْ سَمِعْتُكَ تَذْكُرُ فِيهَا مَا تَذْكُرُ ‏.‏ قَالَ ‏\"‏ لَوْ بَلَغْتِ مَعَهُمُ الْكُدَى ‏\"‏ ‏.‏ فَذَكَرَ تَشْدِيدًا فِي ذَلِكَ فَسَأَلْتُ رَبِيعَةَ عَنِ الْكُدَى فَقَالَ الْقُبُورُ فِيمَا أَحْسِبُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3124,
			"arabicnumber": 3124,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ أَتَى نَبِيُّ اللَّهِ صلى الله عليه وسلم عَلَى امْرَأَةٍ تَبْكِي عَلَى صَبِيٍّ لَهَا فَقَالَ لَهَا ‏\"‏ اتَّقِي اللَّهَ وَاصْبِرِي ‏\"‏ ‏.‏ فَقَالَتْ وَمَا تُبَالِي أَنْتَ بِمُصِيبَتِي فَقِيلَ لَهَا هَذَا النَّبِيُّ صلى الله عليه وسلم ‏.‏ فَأَتَتْهُ فَلَمْ تَجِدْ عَلَى بَابِهِ بَوَّابِينَ فَقَالَتْ يَا رَسُولَ اللَّهِ لَمْ أَعْرِفْكَ فَقَالَ ‏\"‏ إِنَّمَا الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏ ‏.‏ أَوْ ‏\"‏ عِنْدَ أَوَّلِ صَدْمَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3125,
			"arabicnumber": 3125,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ الأَحْوَلِ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ ابْنَةً لِرَسُولِ اللَّهِ، صلى الله عليه وسلم أَرْسَلَتْ إِلَيْهِ وَأَنَا مَعَهُ وَسَعْدٌ وَأَحْسِبُ أُبَيًّا أَنَّ ابْنِي أَوْ بِنْتِي قَدْ حُضِرَ فَاشْهَدْنَا ‏.‏ فَأَرْسَلَ يُقْرِئُ السَّلاَمَ فَقَالَ ‏\"‏ قُلْ لِلَّهِ مَا أَخَذَ وَمَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَهُ إِلَى أَجَلٍ ‏\"‏ ‏.‏ فَأَرْسَلَتْ تُقْسِمُ عَلَيْهِ فَأَتَاهَا فَوُضِعَ الصَّبِيُّ فِي حِجْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَنَفْسُهُ تَقَعْقَعُ فَفَاضَتْ عَيْنَا رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ سَعْدٌ مَا هَذَا قَالَ ‏\"‏ إِنَّهَا رَحْمَةٌ وَضَعَهَا اللَّهُ فِي قُلُوبِ مَنْ يَشَاءُ وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3126,
			"arabicnumber": 3126,
			"text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وُلِدَ لِيَ اللَّيْلَةَ غُلاَمٌ فَسَمَّيْتُهُ بِاسْمِ أَبِي إِبْرَاهِيمَ ‏\"‏ ‏.‏ فَذَكَرَ الْحَدِيثَ قَالَ أَنَسٌ لَقَدْ رَأَيْتُهُ يَكِيدُ بِنَفْسِهِ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَمَعَتْ عَيْنَا رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ تَدْمَعُ الْعَيْنُ وَيَحْزَنُ الْقَلْبُ وَلاَ نَقُولُ إِلاَّ مَا يَرْضَى رَبُّنَا إِنَّا بِكَ يَا إِبْرَاهِيمُ لَمَحْزُونُونَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3127,
			"arabicnumber": 3127,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا عَنِ النِّيَاحَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3128,
			"arabicnumber": 3128,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا مُحَمَّدُ بْنُ رَبِيعَةَ، عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ عَطِيَّةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّائِحَةَ وَالْمُسْتَمِعَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3129,
			"arabicnumber": 3129,
			"text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ عَبْدَةَ، وَأَبِي، مُعَاوِيَةَ - الْمَعْنَى - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏ فَذُكِرَ ذَلِكَ لِعَائِشَةَ فَقَالَتْ وَهِلَ - تَعْنِي ابْنَ عُمَرَ - إِنَّمَا مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى قَبْرٍ فَقَالَ ‏\"‏ إِنَّ صَاحِبَ هَذَا لَيُعَذَّبُ وَأَهْلُهُ يَبْكُونَ عَلَيْهِ ‏\"‏ ‏.‏ ثُمَّ قَرَأَتْ ‏{‏ وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى ‏}‏ قَالَ عَنْ أَبِي مُعَاوِيَةَ عَلَى قَبْرِ يَهُودِيٍّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3130,
			"arabicnumber": 3130,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ يَزِيدَ بْنِ أَوْسٍ، قَالَ دَخَلْتُ عَلَى أَبِي مُوسَى وَهُوَ ثَقِيلٌ فَذَهَبَتِ امْرَأَتُهُ لِتَبْكِي أَوْ تَهُمَّ بِهِ فَقَالَ لَهَا أَبُو مُوسَى أَمَا سَمِعْتِ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ بَلَى ‏.‏ قَالَ فَسَكَتَتْ فَلَمَّا مَاتَ أَبُو مُوسَى - قَالَ يَزِيدُ - لَقِيتُ الْمَرْأَةَ فَقُلْتُ لَهَا مَا قَوْلُ أَبِي مُوسَى لَكِ أَمَا سَمِعْتِ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ سَكَتِّ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَيْسَ مِنَّا مَنْ حَلَقَ وَمَنْ سَلَقَ وَمَنْ خَرَقَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3131,
			"arabicnumber": 3131,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حُمَيْدُ بْنُ الأَسْوَدِ، حَدَّثَنَا الْحَجَّاجُ، - عَامِلٌ لِعُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَلَى الرَّبَذَةِ حَدَّثَنِي أَسِيدُ بْنُ أَبِي أَسِيدٍ، عَنِ امْرَأَةٍ، مِنَ الْمُبَايِعَاتِ قَالَتْ كَانَ فِيمَا أَخَذَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَعْرُوفِ الَّذِي أَخَذَ عَلَيْنَا أَنْ لاَ نَعْصِيَهُ فِيهِ أَنْ لاَ نَخْمِشَ وَجْهًا وَلاَ نَدْعُوَ وَيْلاً وَلاَ نَشُقَّ جَيْبًا وَأَنْ لاَ نَنْشُرَ شَعْرًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3132,
			"arabicnumber": 3132,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي جَعْفَرُ بْنُ خَالِدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اصْنَعُوا لآلِ جَعْفَرٍ طَعَامًا فَإِنَّهُ قَدْ أَتَاهُمْ أَمْرٌ شَغَلَهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْجُشَمِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ رُمِيَ رَجُلٌ بِسَهْمٍ فِي صَدْرِهِ أَوْ فِي حَلْقِهِ فَمَاتَ فَأُدْرِجَ فِي ثِيَابِهِ كَمَا هُوَ - قَالَ - وَنَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3134,
			"arabicnumber": 3134,
			"text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، وَعِيسَى بْنُ يُونُسَ، قَالاَ حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَتْلَى أُحُدٍ أَنْ يُنْزَعَ عَنْهُمُ الْحَدِيدُ وَالْجُلُودُ وَأَنْ يُدْفَنُوا بِدِمَائِهِمْ وَثِيَابِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3135,
			"arabicnumber": 3135,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، ح وَحَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، - وَهَذَا لَفْظُهُ - أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِيُّ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ أَنَّ شُهَدَاءَ أُحُدٍ لَمْ يُغَسَّلُوا وَدُفِنُوا بِدِمَائِهِمْ وَلَمْ يُصَلَّ عَلَيْهِمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3136,
			"arabicnumber": 3136,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدٌ، - يَعْنِي ابْنَ الْحُبَابِ - ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو صَفْوَانَ، - يَعْنِي الْمَرْوَانِيَّ - عَنْ أُسَامَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، - الْمَعْنَى - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ عَلَى حَمْزَةَ وَقَدْ مُثِّلَ بِهِ فَقَالَ ‏\"‏ لَوْلاَ أَنْ تَجِدَ صَفِيَّةُ فِي نَفْسِهَا لَتَرَكْتُهُ حَتَّى تَأْكُلَهُ الْعَافِيَةُ حَتَّى يُحْشَرَ مِنْ بُطُونِهَا ‏\"‏ ‏.‏ وَقَلَّتِ الثِّيَابُ وَكَثُرَتِ الْقَتْلَى فَكَانَ الرَّجُلُ وَالرَّجُلاَنِ وَالثَّلاَثَةُ يُكَفَّنُونَ فِي الثَّوْبِ الْوَاحِدِ - زَادَ قُتَيْبَةُ - ثُمَّ يُدْفَنُونَ فِي قَبْرٍ وَاحِدٍ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْأَلُ ‏\"‏ أَيُّهُمْ أَكْثَرُهُمْ قُرْآنًا ‏\"‏ ‏.‏ فَيُقَدِّمُهُ إِلَى الْقِبْلَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3137,
			"arabicnumber": 3137,
			"text": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا أُسَامَةُ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِحَمْزَةَ وَقَدْ مُثِّلَ بِهِ وَلَمْ يُصَلِّ عَلَى أَحَدٍ مِنَ الشُّهَدَاءِ غَيْرِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3138,
			"arabicnumber": 3138,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَيَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ، أَنَّ اللَّيْثَ، حَدَّثَهُمْ عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ وَيَقُولُ ‏\"‏ أَيُّهُمَا أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏ ‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ وَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ وَأَمَرَ بِدَفْنِهِمْ بِدِمَائِهِمْ وَلَمْ يُغَسَّلُوا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3139,
			"arabicnumber": 3139,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنِ اللَّيْثِ، بِهَذَا الْحَدِيثِ بِمَعْنَاهُ قَالَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3140,
			"arabicnumber": 3140,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ، حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أُخْبِرْتُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُبْرِزْ فَخِذَكَ وَلاَ تَنْظُرَنَّ إِلَى فَخِذِ حَىٍّ وَلاَ مَيِّتٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3141,
			"arabicnumber": 3141,
			"text": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي يَحْيَى بْنُ عَبَّادٍ، عَنْ أَبِيهِ، عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ قَالَ سَمِعْتُ عَائِشَةَ، تَقُولُ لَمَّا أَرَادُوا غَسْلَ النَّبِيِّ صلى الله عليه وسلم قَالُوا وَاللَّهِ مَا نَدْرِي أَنُجَرِّدُ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ ثِيَابِهِ كَمَا نُجَرِّدُ مَوْتَانَا أَمْ نُغَسِّلُهُ وَعَلَيْهِ ثِيَابُهُ فَلَمَّا اخْتَلَفُوا أَلْقَى اللَّهُ عَلَيْهِمُ النَّوْمَ حَتَّى مَا مِنْهُمْ رَجُلٌ إِلاَّ وَذَقْنُهُ فِي صَدْرِهِ ثُمَّ كَلَّمَهُمْ مُكَلِّمٌ مِنْ نَاحِيَةِ الْبَيْتِ لاَ يَدْرُونَ مَنْ هُوَ أَنِ اغْسِلُوا النَّبِيَّ صلى الله عليه وسلم وَعَلَيْهِ ثِيَابُهُ فَقَامُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَغَسَلُوهُ وَعَلَيْهِ قَمِيصُهُ يَصُبُّونَ الْمَاءَ فَوْقَ الْقَمِيصِ وَيُدَلِّكُونَهُ بِالْقَمِيصِ دُونَ أَيْدِيهِمْ وَكَانَتْ عَائِشَةُ تَقُولُ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا غَسَّلَهُ إِلاَّ نِسَاؤُهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3142,
			"arabicnumber": 3142,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، - الْمَعْنَى - عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَتِ ابْنَتُهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ - إِنْ رَأَيْتُنَّ ذَلِكَ - بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حَقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏ قَالَ عَنْ مَالِكٍ يَعْنِي إِزَارَهُ وَلَمْ يَقُلْ مُسَدَّدٌ دَخَلَ عَلَيْنَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3143,
			"arabicnumber": 3143,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، وَأَبُو كَامِلٍ - بِمَعْنَى الإِسْنَادِ - أَنَّ يَزِيدَ بْنَ زُرَيْعٍ، حَدَّثَهُمْ حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ حَفْصَةَ، أُخْتِهِ عَنْ أُمِّ عَطِيَّةَ، قَالَتْ مَشَطْنَاهَا ثَلاَثَةَ قُرُونٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3144,
			"arabicnumber": 3144,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ وَضَفَّرْنَا رَأْسَهَا ثَلاَثَةَ قُرُونٍ ثُمَّ أَلْقَيْنَاهَا خَلْفَهَا مُقَدَّمَ رَأْسِهَا وَقَرْنَيْهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3145,
			"arabicnumber": 3145,
			"text": "حَدَّثَنَا أَبُو كَامِلٍ، وَحَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا خَالِدٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُنَّ فِي غُسْلِ ابْنَتِهِ ‏ \"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3146,
			"arabicnumber": 3146,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، بِمَعْنَى حَدِيثِ مَالِكٍ زَادَ فِي حَدِيثِ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَ بِنَحْوِ هَذَا وَزَادَتْ فِيهِ ‏ \"‏ أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3147,
			"arabicnumber": 3147,
			"text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، أَنَّهُ كَانَ يَأْخُذُ الْغُسْلَ عَنْ أُمِّ عَطِيَّةَ، يَغْسِلُ بِالسِّدْرِ مَرَّتَيْنِ وَالثَّالِثَةَ بِالْمَاءِ وَالْكَافُورِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3148,
			"arabicnumber": 3148,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ خَطَبَ يَوْمًا فَذَكَرَ رَجُلاً مِنْ أَصْحَابِهِ قُبِضَ فَكُفِّنَ فِي كَفَنٍ غَيْرِ طَائِلٍ وَقُبِرَ لَيْلاً فَزَجَرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يُقْبَرَ الرَّجُلُ بِاللَّيْلِ حَتَّى يُصَلَّى عَلَيْهِ إِلاَّ أَنْ يُضْطَرَّ إِنْسَانٌ إِلَى ذَلِكَ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا كَفَّنَ أَحَدُكُمْ أَخَاهُ فَلْيُحْسِنْ كَفَنَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3149,
			"arabicnumber": 3149,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنَا الزُّهْرِيُّ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ أُدْرِجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَوْبٍ حِبَرَةٍ ثُمَّ أُخِّرَ عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3150,
			"arabicnumber": 3150,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّارُ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عَبْدِ الْكَرِيمِ - حَدَّثَنِي إِبْرَاهِيمُ بْنُ عَقِيلِ بْنِ مَعْقِلٍ، عَنْ أَبِيهِ، عَنْ وَهْبٍ، - يَعْنِي ابْنَ مُنَبِّهٍ - عَنْ جَابِرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا تُوُفِّيَ أَحَدُكُمْ فَوَجَدَ شَيْئًا فَلْيُكَفَّنْ فِي ثَوْبٍ حِبَرَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3151,
			"arabicnumber": 3151,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، أَخْبَرَتْنِي عَائِشَةُ، قَالَتْ كُفِّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابٍ يَمَانِيَةٍ بِيضٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3152,
			"arabicnumber": 3152,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، مِثْلَهُ زَادَ مِنْ كُرْسُفٍ ‏.‏ قَالَ فَذُكِرَ لِعَائِشَةَ قَوْلُهُمْ فِي ثَوْبَيْنِ وَبُرْدِ حِبَرَةٍ فَقَالَتْ قَدْ أُتِيَ بِالْبُرْدِ وَلَكِنَّهُمْ رَدُّوهُ وَلَمْ يُكَفِّنُوهُ فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3153,
			"arabicnumber": 3153,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالاَ حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ يَزِيدَ، - يَعْنِي ابْنَ أَبِي زِيَادٍ - عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُفِّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابٍ نَجْرَانِيَّةٍ الْحُلَّةُ ثَوْبَانِ وَقَمِيصُهُ الَّذِي مَاتَ فِيهِ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ عُثْمَانُ فِي ثَلاَثَةِ أَثْوَابٍ حُلَّةٍ حَمْرَاءَ وَقَمِيصِهِ الَّذِي مَاتَ فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3154,
			"arabicnumber": 3154,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ، حَدَّثَنَا عَمْرُو بْنُ هَاشِمٍ أَبُو مَالِكٍ الْجَنْبِيُّ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ عَامِرٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ لاَ تَغَالِ لِي فِي كَفَنٍ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَغَالَوْا فِي الْكَفَنِ فَإِنَّهُ يُسْلَبُهُ سَلْبًا سَرِيعًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3155,
			"arabicnumber": 3155,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ خَبَّابٍ، قَالَ إِنَّ مُصْعَبَ بْنَ عُمَيْرٍ قُتِلَ يَوْمَ أُحُدٍ وَلَمْ يَكُنْ لَهُ إِلاَّ نَمِرَةٌ كُنَّا إِذَا غَطَّيْنَا بِهَا رَأْسَهُ خَرَجَ رِجْلاَهُ وَإِذَا غَطَّيْنَا رِجْلَيْهِ خَرَجَ رَأْسُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ غَطُّوا بِهَا رَأْسَهُ وَاجْعَلُوا عَلَى رِجْلَيْهِ شَيْئًا مِنَ الإِذْخِرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3156,
			"arabicnumber": 3156,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنِي ابْنُ وَهْبٍ، حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ، عَنْ حَاتِمِ بْنِ أَبِي نَصْرٍ، عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنْ أَبِيهِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ الْكَفَنِ الْحُلَّةُ وَخَيْرُ الأُضْحِيَةِ الْكَبْشُ الأَقْرَنُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3157,
			"arabicnumber": 3157,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، حَدَّثَنِي نُوحُ بْنُ حَكِيمٍ الثَّقَفِيُّ، - وَكَانَ قَارِئًا لِلْقُرْآنِ - عَنْ رَجُلٍ، مِنْ بَنِي عُرْوَةَ بْنِ مَسْعُودٍ يُقَالُ لَهُ دَاوُدُ قَدْ وَلَّدَتْهُ أُمُّ حَبِيبَةَ بِنْتُ أَبِي سُفْيَانَ زَوْجُ النَّبِيِّ صلى الله عليه وسلم عَنْ لَيْلَى بِنْتِ قَانِفٍ الثَّقَفِيَّةِ قَالَتْ كُنْتُ فِيمَنْ غَسَّلَ أُمَّ كُلْثُومٍ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم عِنْدَ وَفَاتِهَا فَكَانَ أَوَّلُ مَا أَعْطَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم الْحِقَاءَ ثُمَّ الدِّرْعَ ثُمَّ الْخِمَارَ ثُمَّ الْمِلْحَفَةَ ثُمَّ أُدْرِجَتْ بَعْدُ فِي الثَّوْبِ الآخِرِ قَالَتْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ عِنْدَ الْبَابِ مَعَهُ كَفَنُهَا يُنَاوِلُنَاهَا ثَوْبًا ثَوْبًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3158,
			"arabicnumber": 3158,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْمُسْتَمِرُّ بْنُ الرَّيَّانِ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَطْيَبُ طِيبِكُمُ الْمِسْكُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3159,
			"arabicnumber": 3159,
			"text": "حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ الرُّؤَاسِيُّ أَبُو سُفْيَانَ، وَأَحْمَدُ بْنُ جَنَابٍ، قَالاَ حَدَّثَنَا عِيسَى، - قَالَ أَبُو دَاوُدَ هُوَ ابْنُ يُونُسَ - عَنْ سَعِيدِ بْنِ عُثْمَانَ الْبَلَوِيِّ، عَنْ عَزْرَةَ، - وَقَالَ عَبْدُ الرَّحِيمِ عُرْوَةُ بْنُ سَعِيدٍ الأَنْصَارِيُّ - عَنْ أَبِيهِ، عَنِ الْحُصَيْنِ بْنِ وَحْوَحٍ، أَنَّ طَلْحَةَ بْنَ الْبَرَاءِ، مَرِضَ فَأَتَاهُ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ فَقَالَ ‏ \"‏ إِنِّي لاَ أَرَى طَلْحَةَ إِلاَّ قَدْ حَدَثَ فِيهِ الْمَوْتُ فَآذِنُونِي بِهِ وَعَجِّلُوا فَإِنَّهُ لاَ يَنْبَغِي لِجِيفَةِ مُسْلِمٍ أَنْ تُحْبَسَ بَيْنَ ظَهْرَانَىْ أَهْلِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3160,
			"arabicnumber": 3160,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا زَكَرِيَّا، حَدَّثَنَا مُصْعَبُ بْنُ شَيْبَةَ، عَنْ طَلْقِ بْنِ حَبِيبٍ الْعَنَزِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّهَا حَدَّثَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَغْتَسِلُ مِنْ أَرْبَعٍ مِنَ الْجَنَابَةِ وَيَوْمَ الْجُمُعَةِ وَمِنَ الْحِجَامَةِ وَغُسْلِ الْمَيِّتِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3161,
			"arabicnumber": 3161,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، حَدَّثَنِي ابْنُ أَبِي ذِئْبٍ، عَنِ الْقَاسِمِ بْنِ عَبَّاسٍ، عَنْ عَمْرِو بْنِ عُمَيْرٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ غَسَّلَ الْمَيِّتَ فَلْيَغْتَسِلْ وَمَنْ حَمَلَهُ فَلْيَتَوَضَّأْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3162,
			"arabicnumber": 3162,
			"text": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى، عَنْ سُفْيَانَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ إِسْحَاقَ، مَوْلَى زَائِدَةَ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا مَنْسُوخٌ سَمِعْتُ أَحْمَدَ بْنَ حَنْبَلٍ وَسُئِلَ عَنِ الْغُسْلِ مِنْ غَسْلِ الْمَيِّتِ فَقَالَ يُجْزِيهِ الْوُضُوءُ ‏.‏ قَالَ أَبُو دَاوُدَ أَدْخَلَ أَبُو صَالِحٍ بَيْنَهُ وَبَيْنَ أَبِي هُرَيْرَةَ فِي هَذَا الْحَدِيثِ - يَعْنِي إِسْحَاقَ مَوْلَى زَائِدَةَ - قَالَ وَحَدِيثُ مُصْعَبٍ ضَعِيفٌ فِيهِ خِصَالٌ لَيْسَ الْعَمَلُ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3163,
			"arabicnumber": 3163,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ حَتَّى رَأَيْتُ الدُّمُوعَ تَسِيلُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3164,
			"arabicnumber": 3164,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ، حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، - أَوْ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، - قَالَ رَأَى نَاسٌ نَارًا فِي الْمَقْبَرَةِ فَأَتَوْهَا فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْقَبْرِ وَإِذَا هُوَ يَقُولُ ‏ \"‏ نَاوِلُونِي صَاحِبَكُمْ ‏\"‏ ‏.‏ فَإِذَا هُوَ الرَّجُلُ الَّذِي كَانَ يَرْفَعُ صَوْتَهُ بِالذِّكْرِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3165,
			"arabicnumber": 3165,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ نُبَيْحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا حَمَلْنَا الْقَتْلَى يَوْمَ أُحُدٍ لِنَدْفِنَهُمْ فَجَاءَ مُنَادِي النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكُمْ أَنْ تَدْفِنُوا الْقَتْلَى فِي مَضَاجِعِهِمْ فَرَدَدْنَاهُمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3166,
			"arabicnumber": 3166,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدٍ الْيَزَنِيِّ، عَنْ مَالِكِ بْنِ هُبَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ مُسْلِمٍ يَمُوتُ فَيُصَلِّي عَلَيْهِ ثَلاَثَةُ صُفُوفٍ مِنَ الْمُسْلِمِينَ إِلاَّ أَوْجَبَ ‏\"‏ ‏.‏ قَالَ فَكَانَ مَالِكٌ إِذَا اسْتَقَلَّ أَهْلَ الْجَنَازَةِ جَزَّأَهُمْ ثَلاَثَةَ صُفُوفٍ لِلْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3167,
			"arabicnumber": 3167,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ نُهِينَا أَنْ نَتَّبِعَ، الْجَنَائِزَ وَلَمْ يُعْزَمْ عَلَيْنَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3168,
			"arabicnumber": 3168,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، يَرْوِيهِ قَالَ مَنْ تَبِعَ جَنَازَةً فَصَلَّى عَلَيْهَا فَلَهُ قِيرَاطٌ وَمَنْ تَبِعَهَا حَتَّى يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطَانِ أَصْغَرُهُمَا مِثْلُ أُحُدٍ أَوْ أَحَدُهُمَا مِثْلُ أُحُدٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3169,
			"arabicnumber": 3169,
			"text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، وَعَبْدُ الرَّحْمَنِ بْنُ حُسَيْنٍ الْهَرَوِيُّ، قَالاَ حَدَّثَنَا الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، حَدَّثَنِي أَبُو صَخْرٍ، - وَهُوَ حُمَيْدُ بْنُ زِيَادٍ - أَنَّ يَزِيدَ بْنَ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، حَدَّثَهُ أَنَّ دَاوُدَ بْنَ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ حَدَّثَهُ عَنْ أَبِيهِ، أَنَّهُ كَانَ عِنْدَ ابْنِ عُمَرَ بْنِ الْخَطَّابِ إِذْ طَلَعَ خَبَّابٌ صَاحِبُ الْمَقْصُورَةِ فَقَالَ يَا عَبْدَ اللَّهِ بْنَ عُمَرَ أَلاَ تَسْمَعُ مَا يَقُولُ أَبُو هُرَيْرَةَ إِنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ خَرَجَ مَعَ جَنَازَةٍ مِنْ بَيْتِهَا وَصَلَّى عَلَيْهَا ‏\"‏ ‏.‏ فَذَكَرَ مَعْنَى حَدِيثِ سُفْيَانَ فَأَرْسَلَ ابْنُ عُمَرَ إِلَى عَائِشَةَ فَقَالَتْ صَدَقَ أَبُو هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3170,
			"arabicnumber": 3170,
			"text": "حَدَّثَنَا الْوَلِيدُ بْنُ شُجَاعٍ السَّكُونِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو صَخْرٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنْ مُسْلِمٍ يَمُوتُ فَيَقُومُ عَلَى جَنَازَتِهِ أَرْبَعُونَ رَجُلاً لاَ يُشْرِكُونَ بِاللَّهِ شَيْئًا إِلاَّ شُفِّعُوا فِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3171,
			"arabicnumber": 3171,
			"text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، قَالاَ حَدَّثَنَا حَرْبٌ، - يَعْنِي ابْنَ شَدَّادٍ - حَدَّثَنَا يَحْيَى، حَدَّثَنِي بَابُ بْنُ عُمَيْرٍ، حَدَّثَنِي رَجُلٌ، مِنْ أَهْلِ الْمَدِينَةِ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُتْبَعُ الْجَنَازَةُ بِصَوْتٍ وَلاَ نَارٍ ‏\"‏ ‏.‏ زَادَ هَارُونُ ‏\"‏ وَلاَ يُمْشَى بَيْنَ يَدَيْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3172,
			"arabicnumber": 3172,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم ‏ \"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا لَهَا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3173,
			"arabicnumber": 3173,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنِ ابْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا تَبِعْتُمُ الْجَنَازَةَ فَلاَ تَجْلِسُوا حَتَّى تُوضَعَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى هَذَا الْحَدِيثَ الثَّوْرِيُّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ فِيهِ حَتَّى تُوضَعَ بِالأَرْضِ وَرَوَاهُ أَبُو مُعَاوِيَةَ عَنْ سُهَيْلٍ قَالَ حَتَّى تُوضَعَ فِي اللَّحْدِ ‏.‏ قَالَ أَبُو دَاوُدَ وَسُفْيَانُ أَحْفَظُ مِنْ أَبِي مُعَاوِيَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3174,
			"arabicnumber": 3174,
			"text": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا أَبُو عَمْرٍو، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ، حَدَّثَنِي جَابِرٌ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم إِذْ مَرَّتْ بِنَا جَنَازَةٌ فَقَامَ لَهَا فَلَمَّا ذَهَبْنَا لِنَحْمِلَ إِذَا هِيَ جَنَازَةُ يَهُودِيٍّ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّمَا هِيَ جَنَازَةُ يَهُودِيٍّ ‏.‏ فَقَالَ ‏ \"‏ إِنَّ الْمَوْتَ فَزَعٌ فَإِذَا رَأَيْتُمْ جَنَازَةً فَقُومُوا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3175,
			"arabicnumber": 3175,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ وَاقِدِ بْنِ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ الأَنْصَارِيِّ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ مَسْعُودِ بْنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ فِي الْجَنَائِزِ ثُمَّ قَعَدَ بَعْدُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3176,
			"arabicnumber": 3176,
			"text": "حَدَّثَنَا هِشَامُ بْنُ بَهْرَامَ الْمَدَائِنِيُّ، أَخْبَرَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو الأَسْبَاطِ الْحَارِثِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ بْنِ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُومُ فِي الْجَنَازَةِ حَتَّى تُوضَعَ فِي اللَّحْدِ فَمَرَّ بِهِ حَبْرٌ مِنَ الْيَهُودِ فَقَالَ هَكَذَا نَفْعَلُ ‏.‏ فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم وَقَالَ ‏ \"‏ اجْلِسُوا خَالِفُوهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3177,
			"arabicnumber": 3177,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ ثَوْبَانَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِدَابَّةٍ وَهُوَ مَعَ الْجَنَازَةِ فَأَبَى أَنْ يَرْكَبَهَا فَلَمَّا انْصَرَفَ أُتِيَ بِدَابَّةٍ فَرَكِبَ فَقِيلَ لَهُ فَقَالَ ‏ \"‏ إِنَّ الْمَلاَئِكَةَ كَانَتْ تَمْشِي فَلَمْ أَكُنْ لأَرْكَبَ وَهُمْ يَمْشُونَ فَلَمَّا ذَهَبُوا رَكِبْتُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3178,
			"arabicnumber": 3178,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، سَمِعَ جَابِرَ بْنَ سَمُرَةَ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم عَلَى ابْنِ الدَّحْدَاحِ وَنَحْنُ شُهُودٌ ثُمَّ أُتِيَ بِفَرَسٍ فَعُقِلَ حَتَّى رَكِبَهُ فَجَعَلَ يَتَوَقَّصُ بِهِ وَنَحْنُ نَسْعَى حَوْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3179,
			"arabicnumber": 3179,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجَنَازَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3180,
			"arabicnumber": 3180,
			"text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، عَنْ خَالِدٍ، عَنْ يُونُسَ، عَنْ زِيَادِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، - وَأَحْسَبُ أَنَّ أَهْلَ، زِيَادٍ أَخْبَرُونِي أَنَّهُ، رَفَعَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم - قَالَ ‏ \"‏ الرَّاكِبُ يَسِيرُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي يَمْشِي خَلْفَهَا وَأَمَامَهَا وَعَنْ يَمِينِهَا وَعَنْ يَسَارِهَا قَرِيبًا مِنْهَا وَالسِّقْطُ يُصَلَّى عَلَيْهِ وَيُدْعَى لِوَالِدَيْهِ بِالْمَغْفِرَةِ وَالرَّحْمَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3181,
			"arabicnumber": 3181,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ وَإِنْ تَكُ سِوَى ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3182,
			"arabicnumber": 3182,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ فِي جَنَازَةِ عُثْمَانَ بْنِ أَبِي الْعَاصِ وَكُنَّا نَمْشِي مَشْيًا خَفِيفًا فَلَحِقَنَا أَبُو بَكْرَةَ فَرَفَعَ سَوْطَهُ فَقَالَ لَقَدْ رَأَيْتُنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَرْمُلُ رَمَلاً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3183,
			"arabicnumber": 3183,
			"text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ح وَحَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنْ عُيَيْنَةَ، بِهَذَا الْحَدِيثِ قَالاَ فِي جَنَازَةِ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ وَقَالَ فَحَمَلَ عَلَيْهِمْ بَغْلَتَهُ وَأَهْوَى بِالسَّوْطِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3184,
			"arabicnumber": 3184,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ يَحْيَى الْمُجَبِّرِ، - قَالَ أَبُو دَاوُدَ وَهُوَ يَحْيَى بْنُ عَبْدِ اللَّهِ التَّيْمِيُّ - عَنْ أَبِي مَاجِدَةَ، عَنِ ابْنِ مَسْعُودٍ، قَالَ سَأَلْنَا نَبِيَّنَا صلى الله عليه وسلم عَنِ الْمَشْىِ مَعَ الْجَنَازَةِ فَقَالَ ‏ \"‏ مَا دُونَ الْخَبَبِ إِنْ يَكُنْ خَيْرًا تَعَجَّلْ إِلَيْهِ وَإِنْ يَكُنْ غَيْرَ ذَلِكَ فَبُعْدًا لأَهْلِ النَّارِ وَالْجَنَازَةُ مَتْبُوعَةٌ وَلاَ تُتْبَعُ لَيْسَ مَعَهَا مَنْ تَقَدَّمَهَا ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهُوَ ضَعِيفٌ هُوَ يَحْيَى بْنُ عَبْدِ اللَّهِ وَهُوَ يَحْيَى الْجَابِرُ ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا كُوفِيٌّ وَأَبُو مَاجِدَةَ بَصْرِيٌّ ‏.‏ قَالَ أَبُو دَاوُدَ أَبُو مَاجِدَةَ هَذَا لاَ يُعْرَفُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3185,
			"arabicnumber": 3185,
			"text": "حَدَّثَنَا ابْنُ نُفَيْلٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سِمَاكٌ، حَدَّثَنِي جَابِرُ بْنُ سَمُرَةَ، قَالَ مَرِضَ رَجُلٌ فَصِيحَ عَلَيْهِ فَجَاءَ جَارُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ إِنَّهُ قَدْ مَاتَ ‏.‏ قَالَ ‏\"‏ وَمَا يُدْرِيكَ ‏\"‏ ‏.‏ قَالَ أَنَا رَأَيْتُهُ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَمْ يَمُتْ ‏\"‏ ‏.‏ قَالَ فَرَجَعَ فَصِيحَ عَلَيْهِ فَجَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّهُ قَدْ مَاتَ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَمْ يَمُتْ ‏\"‏ ‏.‏ فَرَجَعَ فَصِيحَ عَلَيْهِ فَقَالَتِ امْرَأَتُهُ انْطَلِقْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبِرْهُ ‏.‏ فَقَالَ الرَّجُلُ اللَّهُمَّ الْعَنْهُ ‏.‏ قَالَ ثُمَّ انْطَلَقَ الرَّجُلُ فَرَآهُ قَدْ نَحَرَ نَفْسَهُ بِمِشْقَصٍ مَعَهُ فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَهُ أَنَّهُ قَدْ مَاتَ فَقَالَ ‏\"‏ مَا يُدْرِيكَ ‏\"‏ ‏.‏ قَالَ رَأَيْتُهُ يَنْحَرُ نَفْسَهُ بِمَشَاقِصَ مَعَهُ ‏.‏ قَالَ ‏\"‏ أَنْتَ رَأَيْتَهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ إِذًا لاَ أُصَلِّي عَلَيْهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3186,
			"arabicnumber": 3186,
			"text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، حَدَّثَنِي نَفَرٌ، مِنْ أَهْلِ الْبَصْرَةِ عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يُصَلِّ عَلَى مَاعِزِ بْنِ مَالِكٍ وَلَمْ يَنْهَ عَنِ الصَّلاَةِ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3187,
			"arabicnumber": 3187,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ مَاتَ إِبْرَاهِيمُ ابْنُ النَّبِيِّ صلى الله عليه وسلم وَهُوَ ابْنُ ثَمَانِيَةَ عَشَرَ شَهْرًا فَلَمْ يُصَلِّ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3188,
			"arabicnumber": 3188,
			"text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ وَائِلِ بْنِ دَاوُدَ، قَالَ سَمِعْتُ الْبَهِيَّ، قَالَ لَمَّا مَاتَ إِبْرَاهِيمُ ابْنُ النَّبِيِّ صلى الله عليه وسلم صَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَقَاعِدِ ‏.‏ قَالَ أَبُو دَاوُدَ قَرَأْتُ عَلَى سَعِيدِ بْنِ يَعْقُوبَ الطَّالْقَانِيِّ قِيلَ لَهُ حَدَّثَكُمُ ابْنُ الْمُبَارَكِ عَنْ يَعْقُوبَ بْنِ الْقَعْقَاعِ عَنْ عَطَاءٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى ابْنِهِ إِبْرَاهِيمَ وَهُوَ ابْنُ سَبْعِينَ لَيْلَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3189,
			"arabicnumber": 3189,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ صَالِحِ بْنِ عَجْلاَنَ، وَمُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّادٍ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ وَاللَّهِ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ الْبَيْضَاءِ إِلاَّ فِي الْمَسْجِدِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3190,
			"arabicnumber": 3190,
			"text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ الضَّحَّاكِ، - يَعْنِي ابْنَ عُثْمَانَ - عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ وَاللَّهِ لَقَدْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى ابْنَىْ بَيْضَاءَ فِي الْمَسْجِدِ سُهَيْلٍ وَأَخِيهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3191,
			"arabicnumber": 3191,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ أَبِي ذِئْبٍ، حَدَّثَنِي صَالِحٌ، مَوْلَى التَّوْأَمَةِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ صَلَّى عَلَى جَنَازَةٍ فِي الْمَسْجِدِ فَلاَ شَىْءَ عَلَيْهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3192,
			"arabicnumber": 3192,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا مُوسَى بْنُ عُلَىِّ بْنِ رَبَاحٍ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، قَالَ ثَلاَثُ سَاعَاتٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْهَانَا أَنْ نُصَلِّيَ فِيهِنَّ أَوْ نَقْبُرَ فِيهِنَّ مَوْتَانَا حِينَ تَطْلُعُ الشَّمْسُ بَازِغَةً حَتَّى تَرْتَفِعَ وَحِينَ يَقُومُ قَائِمُ الظَّهِيرَةِ حَتَّى تَمِيلَ وَحِينَ تَضَيَّفُ الشَّمْسُ لِلْغُرُوبِ حَتَّى تَغْرُبَ أَوْ كَمَا قَالَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3193,
			"arabicnumber": 3193,
			"text": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الرَّمْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ يَحْيَى بْنِ صُبَيْحٍ، حَدَّثَنِي عَمَّارٌ، مَوْلَى الْحَارِثِ بْنِ نَوْفَلٍ أَنَّهُ شَهِدَ جَنَازَةَ أُمِّ كُلْثُومٍ وَابْنِهَا فَجُعِلَ الْغُلاَمُ مِمَّا يَلِي الإِمَامَ فَأَنْكَرْتُ ذَلِكَ وَفِي الْقَوْمِ ابْنُ عَبَّاسٍ وَأَبُو سَعِيدٍ الْخُدْرِيُّ وَأَبُو قَتَادَةَ وَأَبُو هُرَيْرَةَ فَقَالُوا هَذِهِ السُّنَّةُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3194,
			"arabicnumber": 3194,
			"text": "حَدَّثَنَا دَاوُدُ بْنُ مُعَاذٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ نَافِعٍ أَبِي غَالِبٍ، قَالَ كُنْتُ فِي سِكَّةِ الْمِرْبَدِ فَمَرَّتْ جَنَازَةٌ مَعَهَا نَاسٌ كَثِيرٌ قَالُوا جَنَازَةُ عَبْدِ اللَّهِ بْنِ عُمَيْرٍ فَتَبِعْتُهَا فَإِذَا أَنَا بِرَجُلٍ عَلَيْهِ كِسَاءٌ رَقِيقٌ عَلَى بُرَيْذِينَتِهِ وَعَلَى رَأْسِهِ خِرْقَةٌ تَقِيهِ مِنَ الشَّمْسِ فَقُلْتُ مَنْ هَذَا الدِّهْقَانُ قَالُوا هَذَا أَنَسُ بْنُ مَالِكٍ ‏.‏ فَلَمَّا وُضِعَتِ الْجَنَازَةُ قَامَ أَنَسٌ فَصَلَّى عَلَيْهَا وَأَنَا خَلْفَهُ لاَ يَحُولُ بَيْنِي وَبَيْنَهُ شَىْءٌ فَقَامَ عِنْدَ رَأْسِهِ فَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ لَمْ يُطِلْ وَلَمْ يُسْرِعْ ثُمَّ ذَهَبَ يَقْعُدُ فَقَالُوا يَا أَبَا حَمْزَةَ الْمَرْأَةُ الأَنْصَارِيَّةُ فَقَرَّبُوهَا وَعَلَيْهَا نَعْشٌ أَخْضَرُ فَقَامَ عِنْدَ عَجِيزَتِهَا فَصَلَّى عَلَيْهَا نَحْوَ صَلاَتِهِ عَلَى الرَّجُلِ ثُمَّ جَلَسَ فَقَالَ الْعَلاَءُ بْنُ زِيَادٍ يَا أَبَا حَمْزَةَ هَكَذَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى الْجَنَازَةِ كَصَلاَتِكَ يُكَبِّرُ عَلَيْهَا أَرْبَعًا وَيَقُومُ عِنْدَ رَأْسِ الرَّجُلِ وَعَجِيزَةِ الْمَرْأَةِ قَالَ نَعَمْ ‏.‏ قَالَ يَا أَبَا حَمْزَةَ غَزَوْتَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ غَزَوْتُ مَعَهُ حُنَيْنًا فَخَرَجَ الْمُشْرِكُونَ فَحَمَلُوا عَلَيْنَا حَتَّى رَأَيْنَا خَيْلَنَا وَرَاءَ ظُهُورِنَا وَفِي الْقَوْمِ رَجُلٌ يَحْمِلُ عَلَيْنَا فَيَدُقُّنَا وَيَحْطِمُنَا فَهَزَمَهُمُ اللَّهُ وَجَعَلَ يُجَاءُ بِهِمْ فَيُبَايِعُونَهُ عَلَى الإِسْلاَمِ فَقَالَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم إِنَّ عَلَىَّ نَذْرًا إِنْ جَاءَ اللَّهُ بِالرَّجُلِ الَّذِي كَانَ مُنْذُ الْيَوْمِ يَحْطِمُنَا لأَضْرِبَنَّ عُنُقَهُ ‏.‏ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجِيءَ بِالرَّجُلِ فَلَمَّا رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ يَا رَسُولَ اللَّهِ تُبْتُ إِلَى اللَّهِ ‏.‏ فَأَمْسَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يُبَايِعُهُ لِيَفِيَ الآخَرُ بِنَذْرِهِ ‏.‏ قَالَ فَجَعَلَ الرَّجُلُ يَتَصَدَّى لِرَسُولِ اللَّهِ صلى الله عليه وسلم لِيَأْمُرَهُ بِقَتْلِهِ وَجَعَلَ يَهَابُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَقْتُلَهُ فَلَمَّا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّهُ لاَ يَصْنَعُ شَيْئًا بَايَعَهُ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ نَذْرِي ‏.‏ فَقَالَ ‏\"‏ إِنِّي لَمْ أُمْسِكْ عَنْهُ مُنْذُ الْيَوْمِ إِلاَّ لِتُوفِيَ بِنَذْرِكَ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ أَلاَ أَوْمَضْتَ إِلَىَّ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيْسَ لِنَبِيٍّ أَنْ يُومِضَ ‏\"‏ ‏.‏ قَالَ أَبُو غَالِبٍ فَسَأَلْتُ عَنْ صَنِيعِ أَنَسٍ فِي قِيَامِهِ عَلَى الْمَرْأَةِ عِنْدَ عَجِيزَتِهَا فَحَدَّثُونِي أَنَّهُ إِنَّمَا كَانَ لأَنَّهُ لَمْ تَكُنِ النُّعُوشُ فَكَانَ الإِمَامُ يَقُومُ حِيَالَ عَجِيزَتِهَا يَسْتُرُهَا مِنَ الْقَوْمِ ‏.‏ قَالَ أَبُو دَاوُدَ قَوْلُ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ نَسَخَ مِنْ هَذَا الْحَدِيثِ الْوَفَاءَ بِالنَّذْرِ فِي قَتْلِهِ بِقَوْلِهِ إِنِّي قَدْ تُبْتُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3195,
			"arabicnumber": 3195,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ صَلَّيْتُ وَرَاءَ النَّبِيِّ صلى الله عليه وسلم عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ عَلَيْهَا لِلصَّلاَةِ وَسَطَهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3196,
			"arabicnumber": 3196,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ أَخْبَرَنَا ابْنُ إِدْرِيسَ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، عَنِ الشَّعْبِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِقَبْرٍ رَطْبٍ فَصَفُّوا عَلَيْهِ وَكَبَّرَ عَلَيْهِ أَرْبَعًا ‏.‏ فَقُلْتُ لِلشَّعْبِيِّ مَنْ حَدَّثَكَ قَالَ الثِّقَةُ مَنْ شَهِدَهُ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3197,
			"arabicnumber": 3197,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ كَانَ زَيْدٌ - يَعْنِي ابْنَ أَرْقَمَ - يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَإِنَّهُ كَبَّرَ عَلَى جَنَازَةٍ خَمْسًا فَسَأَلْتُهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكَبِّرُهَا ‏.‏ قَالَ أَبُو دَاوُدَ وَأَنَا لِحَدِيثِ ابْنِ الْمُثَنَّى أَتْقَنُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3198,
			"arabicnumber": 3198,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، قَالَ صَلَّيْتُ مَعَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ فَقَالَ إِنَّهَا مِنَ السُّنَّةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3199,
			"arabicnumber": 3199,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ، حَدَّثَنِي مُحَمَّدٌ، - يَعْنِي ابْنَ سَلَمَةَ - عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا صَلَّيْتُمْ عَلَى الْمَيِّتِ فَأَخْلِصُوا لَهُ الدُّعَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3200,
			"arabicnumber": 3200,
			"text": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَبُو الْجُلاَسِ، عُقْبَةُ بْنُ سَيَّارٍ حَدَّثَنِي عَلِيُّ بْنُ شَمَّاخٍ، قَالَ شَهِدْتُ مَرْوَانَ سَأَلَ أَبَا هُرَيْرَةَ كَيْفَ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى الْجَنَازَةِ قَالَ أَمَعَ الَّذِي قُلْتَ قَالَ نَعَمْ ‏.‏ قَالَ كَلاَمٌ كَانَ بَيْنَهُمَا قَبْلَ ذَلِكَ ‏.‏ قَالَ أَبُو هُرَيْرَةَ ‏ \"‏ اللَّهُمَّ أَنْتَ رَبُّهَا وَأَنْتَ خَلَقْتَهَا وَأَنْتَ هَدَيْتَهَا لِلإِسْلاَمِ وَأَنْتَ قَبَضْتَ رُوحَهَا وَأَنْتَ أَعْلَمُ بِسِرِّهَا وَعَلاَنِيَتِهَا جِئْنَاكَ شُفَعَاءَ فَاغْفِرْ لَهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ أَخْطَأَ شُعْبَةُ فِي اسْمِ عَلِيِّ بْنِ شَمَّاخٍ قَالَ فِيهِ عُثْمَانُ بْنُ شَمَّاسٍ وَسَمِعْتُ أَحْمَدَ بْنَ إِبْرَاهِيمَ الْمَوْصِلِيَّ يُحَدِّثُ أَحْمَدَ بْنَ حَنْبَلٍ قَالَ مَا أَعْلَمُ أَنِّي جَلَسْتُ مِنْ حَمَّادِ بْنِ زَيْدٍ مَجْلِسًا إِلاَّ نَهَى فِيهِ عَنْ عَبْدِ الْوَارِثِ وَجَعْفَرِ بْنِ سُلَيْمَانَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3201,
			"arabicnumber": 3201,
			"text": "حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ الرَّقِّيُّ، حَدَّثَنَا شُعَيْبٌ، - يَعْنِي ابْنَ إِسْحَاقَ - عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى جَنَازَةٍ فَقَالَ ‏ \"‏ اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا وَشَاهِدِنَا وَغَائِبِنَا اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِيمَانِ وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِسْلاَمِ اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ وَلاَ تُضِلَّنَا بَعْدَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3202,
			"arabicnumber": 3202,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ، ح وَحَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا الْوَلِيدُ، - وَحَدِيثُ عَبْدِ الرَّحْمَنِ أَتَمُّ - حَدَّثَنَا مَرْوَانُ بْنُ جُنَاحٍ، عَنْ يُونُسَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى رَجُلٍ مِنَ الْمُسْلِمِينَ فَسَمِعْتُهُ يَقُولُ ‏\"‏ اللَّهُمَّ إِنَّ فُلاَنَ بْنَ فُلاَنٍ فِي ذِمَّتِكَ فَقِهِ فِتْنَةَ الْقَبْرِ ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ ‏\"‏ فِي ذِمَّتِكَ وَحَبْلِ جِوَارِكَ فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَمْدِ اللَّهُمَّ فَاغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ عَنْ مَرْوَانَ بْنِ جُنَاحٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3203,
			"arabicnumber": 3203,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ امْرَأَةً، سَوْدَاءَ أَوْ رَجُلاً كَانَ يَقُمُّ الْمَسْجِدَ فَفَقَدَهُ النَّبِيُّ صلى الله عليه وسلم فَسَأَلَ عَنْهُ فَقِيلَ مَاتَ ‏.‏ فَقَالَ ‏\"‏ أَلاَّ آذَنْتُمُونِي بِهِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ دُلُّونِي عَلَى قَبْرِهِ ‏\"‏ ‏.‏ فَدَلُّوهُ فَصَلَّى عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3204,
			"arabicnumber": 3204,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى لِلنَّاسِ النَّجَاشِيَّ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ وَخَرَجَ بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3205,
			"arabicnumber": 3205,
			"text": "حَدَّثَنَا عَبَّادُ بْنُ مُوسَى، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ جَعْفَرٍ - عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَنْطَلِقَ إِلَى أَرْضِ النَّجَاشِيِّ فَذَكَرَ حَدِيثَهُ قَالَ النَّجَاشِيُّ أَشْهَدُ أَنَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَّهُ الَّذِي بَشَّرَ بِهِ عِيسَى ابْنُ مَرْيَمَ وَلَوْلاَ مَا أَنَا فِيهِ مِنَ الْمُلْكِ لأَتَيْتُهُ حَتَّى أَحْمِلَ نَعْلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3206,
			"arabicnumber": 3206,
			"text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ، حَدَّثَنَا سَعِيدُ بْنُ سَالِمٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ الْفَضْلِ السِّجِسْتَانِيُّ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ - بِمَعْنَاهُ عَنْ كَثِيرِ بْنِ زَيْدٍ الْمَدَنِيِّ، عَنِ الْمُطَّلِبِ، قَالَ لَمَّا مَاتَ عُثْمَانُ بْنُ مَظْعُونٍ أُخْرِجَ بِجَنَازَتِهِ فَدُفِنَ أَمَرَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً أَنْ يَأْتِيَهُ بِحَجَرٍ فَلَمْ يَسْتَطِعْ حَمْلَهُ فَقَامَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَسَرَ عَنْ ذِرَاعَيْهِ - قَالَ كَثِيرٌ قَالَ الْمُطَّلِبُ قَالَ الَّذِي يُخْبِرُنِي ذَلِكَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ - كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ ذِرَاعَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم حِينَ حَسَرَ عَنْهُمَا ثُمَّ حَمَلَهَا فَوَضَعَهَا عِنْدَ رَأْسِهِ وَقَالَ ‏ \"‏ أَتَعَلَّمُ بِهَا قَبْرَ أَخِي وَأَدْفِنُ إِلَيْهِ مَنْ مَاتَ مِنْ أَهْلِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3207,
			"arabicnumber": 3207,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سَعْدٍ، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3208,
			"arabicnumber": 3208,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ، عَنْ عَلِيِّ بْنِ عَبْدِ الأَعْلَى، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3209,
			"arabicnumber": 3209,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ عَامِرٍ، قَالَ غَسَّلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلِيٌّ وَالْفَضْلُ وَأُسَامَةُ بْنُ زَيْدٍ وَهُمْ أَدْخَلُوهُ قَبْرَهُ قَالَ وَحَدَّثَنِي مُرَحَّبٌ أَوِ ابْنُ أَبِي مُرَحَّبٍ أَنَّهُمْ أَدْخَلُوا مَعَهُمْ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ فَلَمَّا فَرَغَ عَلِيٌّ قَالَ إِنَّمَا يَلِي الرَّجُلَ أَهْلُهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3210,
			"arabicnumber": 3210,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي مُرَحَّبٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، نَزَلَ فِي قَبْرِ النَّبِيِّ صلى الله عليه وسلم قَالَ كَأَنِّي أَنْظُرُ إِلَيْهِمْ أَرْبَعَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3211,
			"arabicnumber": 3211,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ أَوْصَى الْحَارِثُ أَنْ يُصَلِّيَ، عَلَيْهِ عَبْدُ اللَّهِ بْنُ يَزِيدَ فَصَلَّى عَلَيْهِ ثُمَّ أَدْخَلَهُ الْقَبْرَ مِنْ قِبَلِ رِجْلَىِ الْقَبْرِ وَقَالَ هَذَا مِنَ السُّنَّةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3212,
			"arabicnumber": 3212,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ زَاذَانَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي جَنَازَةِ رَجُلٍ مِنَ الأَنْصَارِ فَانْتَهَيْنَا إِلَى الْقَبْرِ وَلَمْ يُلْحَدْ بَعْدُ فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم مُسْتَقْبِلَ الْقِبْلَةِ وَجَلَسْنَا مَعَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3213,
			"arabicnumber": 3213,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ح وَحَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَبِي الصِّدِّيقِ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا وَضَعَ الْمَيِّتَ فِي الْقَبْرِ قَالَ ‏ \"‏ بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏.‏ هَذَا لَفْظُ مُسْلِمٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3214,
			"arabicnumber": 3214,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي أَبُو إِسْحَاقَ، عَنْ نَاجِيَةَ بْنِ كَعْبٍ، عَنْ عَلِيٍّ، عَلَيْهِ السَّلاَمُ قَالَ قُلْتُ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ عَمَّكَ الشَّيْخَ الضَّالَّ قَدْ مَاتَ ‏.‏ قَالَ ‏ \"‏ اذْهَبْ فَوَارِ أَبَاكَ ثُمَّ لاَ تُحْدِثَنَّ شَيْئًا حَتَّى تَأْتِيَنِي ‏\"‏ ‏.‏ فَذَهَبْتُ فَوَارَيْتُهُ وَجِئْتُهُ فَأَمَرَنِي فَاغْتَسَلْتُ وَدَعَا لِي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3215,
			"arabicnumber": 3215,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، أَنَّ سُلَيْمَانَ بْنَ الْمُغِيرَةِ، حَدَّثَهُمْ عَنْ حُمَيْدٍ، - يَعْنِي ابْنَ هِلاَلٍ - عَنْ هِشَامِ بْنِ عَامِرٍ، قَالَ جَاءَتِ الأَنْصَارُ إِلَى رَسُولِ اللّ��هِ صلى الله عليه وسلم يَوْمَ أُحُدٍ فَقَالُوا أَصَابَنَا قَرْحٌ وَجَهْدٌ فَكَيْفَ تَأْمُرُنَا قَالَ ‏\"‏ احْفِرُوا وَأَوْسِعُوا وَاجْعَلُوا الرَّجُلَيْنِ وَالثَّلاَثَةَ فِي الْقَبْرِ ‏\"‏ ‏.‏ قِيلَ فَأَيُّهُمْ يُقَدَّمُ قَالَ ‏\"‏ أَكْثَرُهُمْ قُرْآنًا ‏\"‏ ‏.‏ قَالَ أُصِيبَ أَبِي يَوْمَئِذٍ عَامِرٌ بَيْنَ اثْنَيْنِ أَوْ قَالَ وَاحِدٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3216,
			"arabicnumber": 3216,
			"text": "حَدَّثَنَا أَبُو صَالِحٍ، - يَعْنِي الأَنْطَاكِيَّ - أَخْبَرَنَا أَبُو إِسْحَاقَ، - يَعْنِي الْفَزَارِيَّ - عَنِ الثَّوْرِيِّ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، بِإِسْنَادِهِ وَمَعْنَاهُ زَادَ فِيهِ ‏ \"‏ وَأَعْمِقُوا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3217,
			"arabicnumber": 3217,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَرِيرٌ، حَدَّثَنَا حُمَيْدٌ، - يَعْنِي ابْنَ هِلاَلٍ - عَنْ سَعْدِ بْنِ هِشَامِ بْنِ عَامِرٍ، بِهَذَا الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3218,
			"arabicnumber": 3218,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي هَيَّاجٍ الأَسَدِيِّ، قَالَ بَعَثَنِي عَلِيٌّ قَالَ لِي أَبْعَثُكَ عَلَى مَا بَعَثَنِي عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ لاَ أَدَعَ قَبْرًا مُشْرِفًا إِلاَّ سَوَّيْتُهُ وَلاَ تِمْثَالاً إِلاَّ طَمَسْتُهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3219,
			"arabicnumber": 3219,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا عَلِيٍّ الْهَمْدَانِيَّ، حَدَّثَهُ قَالَ كُنَّا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ بِرُودِسَ مِنْ أَرْضِ الرُّومِ فَتُوُفِّيَ صَاحِبٌ لَنَا فَأَمَرَ فَضَالَةُ بِقَبْرِهِ فَسُوِّيَ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِتَسْوِيَتِهَا ‏.‏ قَالَ أَبُو دَاوُدَ رُودِسُ جَزِيرَةٌ فِي الْبَحْرِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3220,
			"arabicnumber": 3220,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ هَانِئٍ، عَنِ الْقَاسِمِ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَقُلْتُ يَا أُمَّهْ اكْشِفِي لِي عَنْ قَبْرِ النَّبِيِّ صلى الله عليه وسلم وَصَاحِبَيْهِ رضى الله عنهما فَكَشَفَتْ لِي عَنْ ثَلاَثَةِ قُبُورٍ لاَ مُشْرِفَةٍ وَلاَ لاَطِئَةٍ مَبْطُوحَةٍ بِبَطْحَاءِ الْعَرْصَةِ الْحَمْرَاءِ قَالَ أَبُو عَلِيٍّ يُقَالُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مُقَدَّمٌ وَأَبُو بَكْرٍ عِنْدَ رَأْسِهِ وَعُمَرُ عِنْدَ رِجْلَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3221,
			"arabicnumber": 3221,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، حَدَّثَنَا هِشَامٌ، عَنْ عَبْدِ اللَّهِ بْنِ بَحِيرٍ، عَنْ هَانِئٍ، مَوْلَى عُثْمَانَ عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا فَرَغَ مِنْ دَفْنِ الْمَيِّتِ وَقَفَ عَلَيْهِ فَقَالَ ‏ \"‏ اسْتَغْفِرُوا لأَخِيكُمْ وَسَلُوا لَهُ التَّثْبِيتَ فَإِنَّهُ الآنَ يُسْأَلُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ بَحِيرُ بْنُ رَيْسَانَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3222,
			"arabicnumber": 3222,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ عَقْرَ فِي الإِسْلاَمِ ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّزَّاقِ كَانُوا يَعْقِرُونَ عِنْدَ الْقَبْرِ بَقَرَةً أَوْ شَاةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3223,
			"arabicnumber": 3223,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ ثُمَّ انْصَرَفَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3224,
			"arabicnumber": 3224,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، بِهَذَا الْحَدِيثِ قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى قَتْلَى أُحُدٍ بَعْدَ ثَمَانِ سِنِينَ كَالْمُوَدِّعِ لِلأَحْيَاءِ وَالأَمْوَاتِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3225,
			"arabicnumber": 3225,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُقْعَدَ عَلَى الْقَبْرِ وَأَنْ يُقَصَّصَ وَيُبْنَى عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3226,
			"arabicnumber": 3226,
			"text": "حَدَّثَنَا مُسَدَّدٌ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالاَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، وَعَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، بِهَذَا الْحَدِيثِ قَالَ أَبُو دَاوُدَ قَالَ عُثْمَانُ أَوْ يُزَادَ عَلَيْهِ وَزَادَ سُلَيْمَانُ بْنُ مُوسَى أَوْ أَنْ يُكْتَبَ عَلَيْهِ وَلَمْ يَذْكُرْ مُسَدَّدٌ فِي حَدِيثِهِ أَوْ يُزَادَ عَلَيْهِ ‏.‏ قَالَ أَبُو دَاوُدَ خَفِيَ عَلَىَّ مِنْ حَدِيثِ مُسَدَّدٍ حَرْفُ وَأَنْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3227,
			"arabicnumber": 3227,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ قَاتَلَ اللَّهُ الْيَهُودَ اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3228,
			"arabicnumber": 3228,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لأَنْ يَجْلِسَ أَحَدُكُمْ عَلَى جَمْرَةٍ فَتَحْرِقَ ثِيَابَهُ حَتَّى تَخْلُصَ إِلَى جِلْدِهِ خَيْرٌ لَهُ مِنْ أَنْ يَجْلِسَ عَلَى قَبْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3229,
			"arabicnumber": 3229,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا عِيسَى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ يَزِيدَ بْنِ جَابِرٍ - عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، قَالَ سَمِعْتُ وَاثِلَةَ بْنَ الأَسْقَعِ، يَقُولُ سَمِعْتُ أَبَا مَرْثَدٍ الْغَنَوِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَجْلِسُوا عَلَى الْقُبُورِ وَلاَ تُصَلُّوا إِلَيْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3230,
			"arabicnumber": 3230,
			"text": "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ، حَدَّثَنَا الأَسْوَدُ بْنُ شَيْبَانَ، عَنْ خَالِدِ بْنِ سُمَيْرٍ السَّدُوسِيِّ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ بَشِيرٍ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ اسْمُهُ فِي الْجَاهِلِيَّةِ زَحْمُ بْنُ مَعْبَدٍ فَهَاجَرَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا اسْمُكَ ‏\"‏ ‏.‏ قَالَ زَحْمٌ ‏.‏ قَالَ ‏\"‏ بَلْ أَنْتَ بَشِيرٌ ‏\"‏ ‏.‏ قَالَ بَيْنَمَا أَنَا أُمَاشِي رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِقُبُورِ الْمُشْرِكِينَ فَقَالَ ‏\"‏ لَقَدْ سَبَقَ هَؤُلاَءِ خَيْرًا كَثِيرًا ‏\"‏ ‏.‏ ثَلاَثًا ثُمَّ مَرَّ بِقُبُورِ الْمُسْلِمِينَ فَقَالَ ‏\"‏ لَقَدْ أَدْرَكَ هَؤُلاَءِ خَيْرًا كَثِيرًا ‏\"‏ ‏.‏ وَحَانَتْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم نَظْرَةٌ فَإِذَا رَجُلٌ يَمْشِي فِي الْقُبُورِ عَلَيْهِ نَعْلاَنِ فَقَالَ ‏\"‏ يَا صَاحِبَ السِّبْتِيَّتَيْنِ وَيْحَكَ أَلْقِ سِبْتِيَّتَيْكَ ‏\"‏ ‏.‏ فَنَظَرَ الرَّجُلُ فَلَمَّا عَرَفَ رَسُولَ اللَّهِ صلى الله عليه وسلم خَلَعَهُمَا فَرَمَى بِهِمَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3231,
			"arabicnumber": 3231,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي ابْنَ عَطَاءٍ - عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3232,
			"arabicnumber": 3232,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي مَسْلَمَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرٍ، قَالَ دُفِنَ مَعَ أَبِي رَجُلٌ فَكَانَ فِي نَفْسِي مِنْ ذَلِكَ حَاجَةٌ فَأَخْرَجْتُهُ بَعْدَ سِتَّةِ أَشْهُرٍ فَمَا أَنْكَرْتُ مِنْهُ شَيْئًا إِلاَّ شُعَيْرَاتٍ كُنَّ فِي لِحْيَتِهِ مِمَّا يَلِي الأَرْضَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3233,
			"arabicnumber": 3233,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ إِبْرَاهِيمَ بْنِ عَامِرٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَرُّوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِجَنَازَةٍ فَأَثْنَوْا عَلَيْهَا خَيْرًا فَقَالَ ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ ثُمَّ مَرُّوا بِأُخْرَى فَأَثْنَوْا عَلَيْهَا شَرًّا فَقَالَ ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ بَعْضَكُمْ عَلَى بَعْضٍ شُهَدَاءُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3234,
			"arabicnumber": 3234,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْرَ أُمِّهِ فَبَكَى وَأَبْكَى مَنْ حَوْلَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اسْتَأْذَنْتُ رَبِّي تَعَالَى عَلَى أَنْ أَسْتَغْفِرَ لَهَا فَلَمْ يُؤْذَنْ لِي فَاسْتَأْذَنْتُ أَنْ أَزُورَ قَبْرَهَا فَأُذِنَ لِي فَزُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُ بِالْمَوْتِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3235,
			"arabicnumber": 3235,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا مُعَرِّفُ بْنُ وَاصِلٍ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا فَإِنَّ فِي زِيَارَتِهَا تَذْكِرَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3236,
			"arabicnumber": 3236,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَائِرَاتِ الْقُبُورِ وَالْمُتَّخِذِينَ عَلَيْهَا الْمَسَاجِدَ وَالسُّرُجَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3237,
			"arabicnumber": 3237,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى الْمَقْبَرَةِ فَقَالَ ‏ \"‏ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ ‏\"‏ ‏.‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3238,
			"arabicnumber": 3238,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَجُلٍ وَقَصَتْهُ رَاحِلَتُهُ فَمَاتَ وَهُوَ مُحْرِمٌ فَقَالَ ‏\"‏ كَفِّنُوهُ فِي ثَوْبَيْهِ وَاغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَلاَ تُخَمِّرُوا رَأْسَهُ فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ يُلَبِّي ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ سَمِعْتُ أَحْمَدَ بْنَ حَنْبَلٍ يَقُولُ فِي هَذَا الْحَدِيثِ خَمْسُ سُنَنٍ ‏\"‏ كَفِّنُوهُ فِي ثَوْبَيْهِ ‏\"‏ ‏.‏ أَىْ يُكَفَّنُ الْمَيِّتُ فِي ثَوْبَيْنِ ‏\"‏ وَاغْسِلُوهُ بِمَاءٍ وَسِدْرٍ ‏\"‏ ‏.‏ أَىْ إِنَّ فِي الْغَسَلاَتِ كُلِّهَا سِدْرًا ‏\"‏ وَلاَ تُخَمِّرُوا رَأْسَهُ ‏\"‏ ‏.‏ وَلاَ تُقَرِّبُوهُ طِيبًا وَكَانَ الْكَفَنُ مِنْ جَمِيعِ الْمَالِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3239,
			"arabicnumber": 3239,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ عُبَيْدٍ، - الْمَعْنَى - قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، وَأَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، نَحْوَهُ قَالَ ‏\"‏ وَكَفِّنُوهُ فِي ثَوْبَيْنِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ سُلَيْمَانُ قَالَ أَيُّوبُ ‏\"‏ ثَوْبَيْهِ ‏\"‏ ‏.‏ وَقَالَ عَمْرٌو ‏\"‏ ثَوْبَيْنِ ‏\"‏ ‏.‏ وَقَالَ ابْنُ عُبَيْدٍ قَالَ أَيُّوبُ ‏\"‏ فِي ثَوْبَيْنِ ‏\"‏ ‏.‏ وَقَالَ عَمْرٌو ‏\"‏ فِي ثَوْبَيْهِ ‏\"‏ ‏.‏ زَادَ سُلَيْمَانُ وَحْدَهُ ‏\"‏ وَلاَ تُحَنِّطُوهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3240,
			"arabicnumber": 3240,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، نَحْوَهُ بِمَعْنَى سُلَيْمَانَ ‏ \"‏ فِي ثَوْبَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3241,
			"arabicnumber": 3241,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْحَكَمِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ وَقَصَتْ بِرَجُلٍ مُحْرِمٍ نَاقَتُهُ فَقَتَلَتْهُ فَأُتِيَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ اغْسِلُوهُ وَكَفِّنُوهُ وَلاَ تُغَطُّوا رَأْسَهُ وَلاَ تُقَرِّبُوهُ طِيبًا فَإِنَّهُ يُبْعَثُ يُهِلُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 153
			}
		}
	]
}