{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4596,
			"arabicnumber": 4596,
			"text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، عَنْ خَالِدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ افْتَرَقَتِ الْيَهُودُ عَلَى إِحْدَى أَوْ ثِنْتَيْنِ وَسَبْعِينَ فِرْقَةً وَتَفَرَّقَتِ النَّصَارَى عَلَى إِحْدَى أَوْ ثِنْتَيْنِ وَسَبْعِينَ فِرْقَةً وَتَفْتَرِقُ أُمَّتِي عَلَى ثَلاَثٍ وَسَبْعِينَ فِرْقَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4597,
			"arabicnumber": 4597,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَمُحَمَّدُ بْنُ يَحْيَى، قَالاَ حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا صَفْوَانُ، ح وَحَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ، حَدَّثَنَا بَقِيَّةُ، قَالَ حَدَّثَنِي صَفْوَانُ، نَحْوَهُ قَالَ حَدَّثَنِي أَزْهَرُ بْنُ عَبْدِ اللَّهِ الْحَرَازِيُّ، عَنْ أَبِي عَامِرٍ الْهَوْزَنِيِّ، عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ، أَنَّهُ قَامَ فِينَا فَقَالَ أَلاَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ فِينَا فَقَالَ ‏\"‏ أَلاَ إِنَّ مَنْ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوا عَلَى ثِنْتَيْنِ وَسَبْعِينَ مِلَّةً وَإِنَّ هَذِهِ الْمِلَّةَ سَتَفْتَرِقُ عَلَى ثَلاَثٍ وَسَبْعِينَ ثِنْتَانِ وَسَبْعُونَ فِي النَّارِ وَوَاحِدَةٌ فِي الْجَنَّةِ وَهِيَ الْجَمَاعَةُ ‏\"‏ ‏.‏ زَادَ ابْنُ يَحْيَى وَعَمْرٌو فِي حَدِيثَيْهِمَا ‏\"‏ وَإِنَّهُ سَيَخْرُجُ مِنْ أُمَّتِي أَقْوَامٌ تَجَارَى بِهِمْ تِلْكَ الأَهْوَاءُ كَمَا يَتَجَارَى الْكَلْبُ لِصَاحِبِهِ ‏\"‏ ‏.‏ وَقَالَ عَمْرٌو ‏\"‏ الْكَلْبُ بِصَاحِبِهِ لاَ يَبْقَى مِنْهُ عِرْقٌ وَلاَ مَفْصِلٌ إِلاَّ دَخَلَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4598,
			"arabicnumber": 4598,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ التُّسْتَرِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم هَذِهِ الآيَةَ ‏{‏ هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُحْكَمَاتٌ ‏}‏ إِلَى ‏{‏ أُولُو الأَلْبَابِ ‏}‏ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِذَا رَأَيْتُمُ الَّذِينَ يَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ فَأُولَئِكَ الَّذِينَ سَمَّى اللَّهُ فَاحْذَرُوهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4599,
			"arabicnumber": 4599,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ، عَنْ مُجَاهِدٍ، عَنْ رَجُلٍ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَفْضَلُ الأَعْمَالِ الْحُبُّ فِي اللَّهِ وَالْبُغْضُ فِي اللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4600,
			"arabicnumber": 4600,
			"text": "حَدَّثَنَا ابْنُ السَّرْحِ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ فَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، - وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ - قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، - وَذَكَرَ ابْنُ السَّرْحِ قِصَّةَ تَخَلُّفِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ - قَالَ وَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُسْلِمِينَ عَنْ كَلاَمِنَا أَيُّهَا الثَّلاَثَةُ حَتَّى إِذَا طَالَ عَلَىَّ تَسَوَّرْتُ جِدَارَ حَائِطِ أَبِي قَتَادَةَ وَهُوَ ابْنُ عَمِّي فَسَلَّمْتُ عَلَيْهِ فَوَاللَّهِ مَا رَدَّ عَلَىَّ السَّلاَمَ ‏.‏ ثُمَّ سَاقَ خَبَرَ تَنْزِيلِ تَوْبَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4601,
			"arabicnumber": 4601,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا عَطَاءٌ الْخُرَاسَانِيُّ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنْ عَمَّارِ بْنِ يَاسِرٍ، قَالَ قَدِمْتُ عَلَى أَهْلِي وَقَدْ تَشَقَّقَتْ يَدَاىَ فَخَلَّقُونِي بِزَعْفَرَانٍ فَغَدَوْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ وَقَالَ ‏ \"‏ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4602,
			"arabicnumber": 4602,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ سُمَيَّةَ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّهُ اعْتَلَّ بَعِيرٌ لِصَفِيَّةَ بِنْتِ حُيَىٍّ وَعِنْدَ زَيْنَبَ فَضْلُ ظَهْرٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِزَيْنَبَ ‏ \"‏ أَعْطِيهَا بَعِيرًا ‏\"‏ ‏.‏ فَقَالَتْ أَنَا أُعْطِي تِلْكَ الْيَهُودِيَّةَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَهَجَرَهَا ذَا الْحِجَّةَ وَالْمُحَرَّمَ وَبَعْضَ صَفَرٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4603,
			"arabicnumber": 4603,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ هَارُونَ - أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمِرَاءُ فِي الْقُرْآنِ كُفْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4604,
			"arabicnumber": 4604,
			"text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ، حَدَّثَنَا أَبُو عَمْرِو بْنُ كَثِيرِ بْنِ دِينَارٍ، عَنْ حَرِيزِ بْنِ عُثْمَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَوْفٍ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ أَلاَ إِنِّي أُوتِيتُ الْكِتَابَ وَمِثْلَهُ مَعَهُ أَلاَ يُوشِكُ رَجُلٌ شَبْعَانُ عَلَى أَرِيكَتِهِ يَقُولُ عَلَيْكُمْ بِهَذَا الْقُرْآنِ فَمَا وَجَدْتُمْ فِيهِ مِنْ حَلاَلٍ فَأَحِلُّوهُ وَمَا وَجَدْتُمْ فِيهِ مِنْ حَرَامٍ فَحَرِّمُوهُ أَلاَ لاَ يَحِلُّ لَكُمْ لَحْمُ الْحِمَارِ الأَهْلِيِّ وَلاَ كُلُّ ذِي نَابٍ مِنَ السَّبُعِ وَلاَ لُقَطَةُ مُعَاهِدٍ إِلاَّ أَنْ يَسْتَغْنِيَ عَنْهَا صَاحِبُهَا وَمَنْ نَزَلَ بِقَوْمٍ فَعَلَيْهِمْ أَنْ يَقْرُوهُ فَإِنْ لَمْ يَقْرُوهُ فَلَهُ أَنْ يُعْقِبَهُمْ بِمِثْلِ قِرَاهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4605,
			"arabicnumber": 4605,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ، وَعَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي النَّضْرِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ أُلْفِيَنَّ أَحَدَكُمْ مُتَّكِئًا عَلَى أَرِيكَتِهِ يَأْتِيهِ الأَمْرُ مِنْ أَمْرِي مِمَّا أَمَرْتُ بِهِ أَوْ نَهَيْتُ عَنْهُ فَيَقُولُ لاَ نَدْرِي مَا وَجَدْنَا فِي كِتَابِ اللَّهِ اتَّبَعْنَاهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4606,
			"arabicnumber": 4606,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَخْرَمِيُّ، وَإِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ فِيهِ فَهُوَ رَدٌّ ‏\"‏ ‏.‏ قَالَ ابْنُ عِيسَى قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ صَنَعَ أَمْرًا عَلَى غَيْرِ أَمْرِنَا فَهُوَ رَدٌّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4607,
			"arabicnumber": 4607,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ، قَالَ حَدَّثَنِي خَالِدُ بْنُ مَعْدَانَ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو السُّلَمِيُّ، وَحُجْرُ بْنُ حُجْرٍ، قَالاَ أَتَيْنَا الْعِرْبَاضَ بْنَ سَارِيَةَ وَهُوَ مِمَّنْ نَزَلَ فِيهِ ‏{‏ وَلاَ عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لاَ أَجِدُ مَا أَحْمِلُكُمْ عَلَيْهِ ‏}‏ فَسَلَّمْنَا وَقُلْنَا أَتَيْنَاكَ زَائِرِينَ وَعَائِدِينَ وَمُقْتَبِسِينَ ‏.‏ فَقَالَ الْعِرْبَاضُ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ ثُمَّ أَقْبَلَ عَلَيْنَا فَوَعَظَنَا مَوْعِظَةً بَلِيغَةً ذَرَفَتْ مِنْهَا الْعُيُونُ وَوَجِلَتْ مِنْهَا الْقُلُوبُ فَقَالَ قَائِلٌ يَا رَسُولَ اللَّهِ كَأَنَّ هَذِهِ مَوْعِظَةُ مُوَدِّعٍ فَمَاذَا تَعْهَدُ إِلَيْنَا فَقَالَ ‏\"‏ أُوصِيكُمْ بِتَقْوَى اللَّهِ وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ عَبْدًا حَبَشِيًّا فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ بَعْدِي فَسَيَرَى اخْتِلاَفًا كَثِيرًا فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الْمَهْدِيِّينَ الرَّاشِدِينَ تَمَسَّكُوا بِهَا وَعَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الأُمُورِ فَإِنَّ كُلَّ مُحْدَثَةٍ بِدْعَةٌ وَكُلَّ بِدْعَةٍ ضَلاَلَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4608,
			"arabicnumber": 4608,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ حَدَّثَنِي سُلَيْمَانُ، - يَعْنِي ابْنَ عَتِيقٍ - عَنْ طَلْقِ بْنِ حَبِيبٍ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلاَ هَلَكَ الْمُتَنَطِّعُونَ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4609,
			"arabicnumber": 4609,
			"text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ جَعْفَرٍ - قَالَ أَخْبَرَنِي الْعَلاَءُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ دَعَا إِلَى هُدًى كَانَ لَهُ مِنَ الأَجْرِ مِثْلُ أُجُورِ مَنْ تَبِعَهُ لاَ يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ دَعَا إِلَى ضَلاَلَةٍ كَانَ عَلَيْهِ مِنَ الإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ لاَ يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4610,
			"arabicnumber": 4610,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَعْظَمَ الْمُسْلِمِينَ فِي الْمُسْلِمِينَ جُرْمًا مَنْ سَأَلَ عَنْ أَمْرٍ لَمْ يُحَرَّمْ فَحُرِّمَ عَلَى النَّاسِ مِنْ أَجْلِ مَسْأَلَتِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4611,
			"arabicnumber": 4611,
			"text": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا إِدْرِيسَ الْخَوْلاَنِيَّ، عَائِذَ اللَّهِ أَخْبَرَهُ أَنَّ يَزِيدَ بْنَ عُمَيْرَةَ وَكَانَ مِنْ أَصْحَابِ مُعَاذِ بْنِ جَبَلٍ أَخْبَرَهُ قَالَ كَانَ لاَ يَجْلِسُ مَجْلِسًا لِلذِّكْرِ حِينَ يَجْلِسُ إِلاَّ قَالَ اللَّهُ حَكَمٌ قِسْطٌ هَلَكَ الْمُرْتَابُونَ فَقَالَ مُعَاذُ بْنُ جَبَلٍ يَوْمًا إِنَّ مِنْ وَرَائِكُمْ فِتَنًا يَكْثُرُ فِيهَا الْمَالُ وَيُفْتَحُ فِيهَا الْقُرْآنُ حَتَّى يَأْخُذَهُ الْمُؤْمِنُ وَالْمُنَافِقُ وَالرَّجُلُ وَالْمَرْأَةُ وَالصَّغِيرُ وَالْكَبِيرُ وَالْعَبْدُ وَالْحُرُّ فَيُوشِكُ قَائِلٌ أَنْ يَقُولَ مَا لِلنَّاسِ لاَ يَتَّبِعُونِي وَقَدْ قَرَأْتُ الْقُرْآنَ مَا هُمْ بِمُتَّبِعِيَّ حَتَّى أَبْتَدِعَ لَهُمْ غَيْرَهُ فَإِيَّاكُمْ وَمَا ابْتُدِعَ فَإِنَّ مَا ابْتُدِعَ ضَلاَلَةٌ وَأُحَذِّرُكُمْ زَيْغَةَ الْحَكِيمِ فَإِنَّ الشَّيْطَانَ قَدْ يَقُولُ كَلِمَةَ الضَّلاَلَةِ عَلَى لِسَانِ الْحَكِيمِ وَقَدْ يَقُولُ الْمُنَافِقُ كَلِمَةَ الْحَقِّ ‏.‏ قَالَ قُلْتُ لِمُعَاذٍ مَا يُدْرِينِي رَحِمَكَ اللَّهُ أَنَّ الْحَكِيمَ قَدْ يَقُولُ كَلِمَةَ الضَّلاَلَةِ وَأَنَّ الْمُنَافِقَ قَدْ يَقُولُ كَلِمَةَ الْحَقِّ قَالَ بَلَى اجْتَنِبْ مِنْ كَلاَمِ الْحَكِيمِ الْمُشْتَهِرَاتِ الَّتِي يُقَالُ لَهَا مَا هَذِهِ وَلاَ يُثْنِيَنَّكَ ذَلِكَ عَنْهُ فَإِنَّهُ لَعَلَّهُ أَنْ يُرَاجِعَ وَتَلَقَّ الْحَقَّ إِذَا سَمِعْتَهُ فَإِنَّ عَلَى الْحَقِّ نُورًا ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ مَعْمَرٌ عَنِ الزُّهْرِيِّ فِي هَذَا وَلاَ يُنْئِيَنَّكَ ذَلِكَ عَنْهُ مَكَانَ يُثْنِيَنَّكَ ‏.‏ وَقَالَ صَالِحُ بْنُ كَيْسَانَ عَنِ الزُّهْرِيِّ فِي هَذَا الْمُشَبَّهَاتِ مَكَانَ الْمُشْتَهِرَاتِ وَقَالَ لاَ يُثْنِيَنَّكَ كَمَا قَالَ عُقَيْلٌ ‏.‏ وَقَالَ ابْنُ إِسْحَاقَ عَنِ الزُّهْرِيِّ قَالَ بَلَى مَا تَشَابَهَ عَلَيْكَ مِنْ قَوْلِ الْحَكِيمِ حَتَّى تَقُولَ مَا أَرَادَ بِهَذِهِ الْكَلِمَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4612,
			"arabicnumber": 4612,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ كَتَبَ رَجُلٌ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ يَسْأَلُهُ عَنِ الْقَدَرِ، ح وَحَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ الْمُؤَذِّنُ، قَالَ حَدَّثَنَا أَسَدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا حَمَّادُ بْنُ دُلَيْلٍ، قَالَ سَمِعْتُ سُفْيَانَ الثَّوْرِيَّ، يُحَدِّثُنَا عَنِ النَّضْرِ، ح وَحَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ قَبِيصَةَ، قَالَ حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ أَبِي الصَّلْتِ، - وَهَذَا لَفْظُ حَدِيثِ ابْنِ كَثِيرٍ وَمَعْنَاهُمْ - قَالَ كَتَبَ رَجُلٌ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ يَسْأَلُهُ عَنِ الْقَدَرِ فَكَتَبَ أَمَّا بَعْدُ أُوصِيكَ بِتَقْوَى اللَّهِ وَالاِقْتِصَادِ فِي أَمْرِهِ وَاتِّبَاعِ سُنَّةِ نَبِيِّهِ صلى الله عليه وسلم وَتَرْكِ مَا أَحْدَثَ الْمُحْدِثُونَ بَعْدَ مَا جَرَتْ بِهِ سُنَّتُهُ وَكُفُوا مُؤْنَتَهُ فَعَلَيْكَ بِلُزُومِ السُّنَّةِ فَإِنَّهَا لَكَ بِإِذْنِ اللَّهِ عِصْمَةٌ ثُمَّ اعْلَمْ أَنَّهُ لَمْ يَبْتَدِعِ النَّاسُ بِدْعَةً إِلاَّ قَدْ مَضَى قَبْلَهَا مَا هُوَ دَلِيلٌ عَلَيْهَا أَوْ عِبْرَةٌ فِيهَا فَإِنَّ السُّنَّةَ إِنَّمَا سَنَّهَا مَنْ قَدْ عَلِمَ مَا فِي خِلاَفِهَا وَلَمْ يَقُلِ ابْنُ كَثِيرٍ مَنْ قَدْ عَلِمَ ‏.‏ مِنَ الْخَطَإِ وَالزَّلَلِ وَالْحُمْقِ وَالتَّعَمُّقِ فَارْضَ لِنَفْسِكَ مَا رَضِيَ بِهِ الْقَوْمُ لأَنْفُسِهِمْ فَإِنَّهُمْ عَلَى عِلْمٍ وَقَفُوا وَبِبَصَرٍ نَافِذٍ كَفَوْا وَلَهُمْ عَلَى كَشْفِ الأُمُورِ كَانُوا أَقْوَى وَبِفَضْلِ مَا كَانُوا فِيهِ أَوْلَى فَإِنْ كَانَ الْهُدَى مَا أَنْتُمْ عَلَيْهِ لَقَدْ سَبَقْتُمُوهُمْ إِلَيْهِ وَلَئِنْ قُلْتُمْ إِنَّمَا حَدَثَ بَعْدَهُمْ ‏.‏ مَا أَحْدَثَهُ إِلاَّ مَنِ اتَّبَعَ غَيْرَ سَبِيلِهِمْ وَرَغِبَ بِنَفْسِهِ عَنْهُمْ فَإِنَّهُمْ هُمُ السَّابِقُونَ فَقَدْ تَكَلَّمُوا فِيهِ بِمَا يَكْفِي وَوَصَفُوا مِنْهُ مَا يَشْفِي فَمَا دُونَهُمْ مِنْ مَقْصَرٍ وَمَا فَوْقَهُمْ مِنْ مَحْسَرٍ وَقَدْ قَصَّرَ قَوْمٌ دُونَهُمْ فَجَفَوْا وَطَمَحَ عَنْهُمْ أَقْوَامٌ فَغَلَوْا وَإِنَّهُمْ بَيْنَ ذَلِكَ لَعَلَى هُدًى مُسْتَقِيمٍ كَتَبْتَ تَسْأَلُ عَنِ الإِقْرَارِ بِالْقَدَرِ فَعَلَى الْخَبِيرِ بِإِذْنِ اللَّهِ وَقَعْتَ مَا أَعْلَمُ مَا أَحْدَثَ النَّاسُ مِنْ مُحْدَثَةٍ وَلاَ ابْتَدَعُوا مِنْ بِدْعَةٍ هِيَ أَبْيَنُ أَثَرًا وَلاَ أَثْبَتُ أَمْرًا مِنَ الإِقْرَارِ بِالْقَدَرِ لَقَدْ كَانَ ذَكَرَهُ فِي الْجَاهِلِيَّةِ الْجُهَلاَءُ يَتَكَلَّمُونَ بِهِ فِي كَلاَمِهِمْ وَفِي شِعْرِهِمْ يُعَزُّونَ بِهِ أَنْفُسَهُمْ عَلَى مَا فَاتَهُمْ ثُمَّ لَمْ يَزِدْهُ الإِسْلاَمُ بَعْدُ إِلاَّ شِدَّةً وَلَقَدْ ذَكَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي غَيْرِ حَدِيثٍ وَلاَ حَدِيثَيْنِ وَقَدْ سَمِعَهُ مِنْهُ الْمُسْلِمُونَ فَتَكَلَّمُوا بِهِ فِي حَيَاتِهِ وَبَعْدَ وَفَاتِهِ يَقِينًا وَتَسْلِيمًا لِرَبِّهِمْ وَتَضْعِيفًا لأَنْفُسِهِمْ أَنْ يَكُونَ شَىْءٌ لَمْ يُحِطْ بِهِ عِلْمُهُ وَلَمْ يُحْصِهِ كِتَابُهُ وَلَمْ يَمْضِ فِيهِ قَدَرُهُ وَإِنَّهُ مَعَ ذَلِكَ لَفِي مُحْكَمِ كِتَابِهِ مِنْهُ اقْتَبَسُوهُ وَمِنْهُ تَعَلَّمُوهُ وَلَئِنْ قُلْتُمْ لِمَ أَنْزَلَ اللَّهُ آيَةَ كَذَا وَلِمَ قَالَ كَذَا ‏.‏ لَقَدْ قَرَءُوْا مِنْهُ مَا قَرَأْتُمْ وَعَلِمُوا مِنْ تَأْوِيلِهِ مَا جَهِلْتُمْ وَقَالُوا بَعْدَ ذَلِكَ كُلِّهِ بِكِتَابٍ وَقَدَرٍ وَكُتِبَتِ الشَّقَاوَةُ وَمَا يُقَدَّرْ يَكُنْ وَمَا شَاءَ اللَّهُ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ وَلاَ نَمْلِكُ لأَنْفُسِنَا ضَرًّا وَلاَ نَفْعًا ثُمَّ رَغَبُوا بَعْدَ ذَلِكَ وَرَهِبُوا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4613,
			"arabicnumber": 4613,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا سَعِيدٌ، - يَعْنِي ابْنَ أَبِي أَيُّوبَ - قَالَ أَخْبَرَنِي أَبُو صَخْرٍ، عَنْ نَافِعٍ، قَالَ كَانَ لاِبْنِ عُمَرَ صَدِيقٌ مِنْ أَهْلِ الشَّامِ يُكَاتِبُهُ فَكَتَبَ إِلَيْهِ عَبْدُ اللَّهِ بْنُ عُمَرَ إِنَّهُ بَلَغَنِي أَنَّكَ تَكَلَّمْتَ فِي شَىْءٍ مِنَ الْقَدَرِ فَإِيَّاكَ أَنْ تَكْتُبَ إِلَىَّ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّهُ سَيَكُونُ فِي أُمَّتِي أَقْوَامٌ يُكَذِّبُونَ بِالْقَدَرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4614,
			"arabicnumber": 4614,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ خَالِدٍ الْحَذَّاءِ، قَالَ قُلْتُ لِلْحَسَنِ يَا أَبَا سَعِيدٍ أَخْبِرْنِي عَنْ آدَمَ، لِلسَّمَاءِ خُلِقَ أَمْ لِلأَرْضِ قَالَ لاَ بَلْ لِلأَرْضِ ‏.‏ قُلْتُ أَرَأَيْتَ لَوِ اعْتَصَمَ فَلَمْ يَأْكُلْ مِنَ الشَّجَرَةِ قَالَ لَمْ يَكُنْ لَهُ مِنْهُ بُدٌّ ‏.‏ قُلْتُ أَخْبِرْنِي عَنْ قَوْلِهِ تَعَالَى ‏{‏ مَا أَنْتُمْ عَلَيْهِ بِفَاتِنِينَ * إِلاَّ مَنْ هُوَ صَالِ الْجَحِيمِ ‏}‏ قَالَ إِنَّ الشَّيَاطِينَ لاَ يَفْتِنُونَ بِضَلاَلَتِهِمْ إِلاَّ مَنْ أَوْجَبَ اللَّهُ عَلَيْهِ الْجَحِيمَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4615,
			"arabicnumber": 4615,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنِ الْحَسَنِ، فِي قَوْلِهِ تَعَالَى ‏{‏ وَلِذَلِكَ خَلَقَهُمْ ‏}‏ قَالَ خَلَقَ هَؤُلاَءِ لِهَذِهِ وَهَؤُلاَءِ لِهَذِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4616,
			"arabicnumber": 4616,
			"text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، قَالَ قُلْتُ لِلْحَسَنِ ‏{‏ مَا أَنْتُمْ عَلَيْهِ بِفَاتِنِينَ * إِلاَّ مَنْ هُوَ صَالِ الْجَحِيمِ ‏}‏ قَالَ إِلاَّ مَنْ أَوْجَبَ اللَّهُ تَعَالَى عَلَيْهِ أَنَّهُ يَصْلَى الْجَحِيمَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4617,
			"arabicnumber": 4617,
			"text": "حَدَّثَنَا هِلاَلُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ أَخْبَرَنِي حُمَيْدٌ، قَالَ كَانَ الْحَسَنُ يَقُولُ لأَنْ يُسْقَطَ مِنَ السَّمَاءِ إِلَى الأَرْضِ أَحَبُّ إِلَيْهِ مِنْ أَنْ يَقُولَ الأَمْرُ بِيَدِي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4618,
			"arabicnumber": 4618,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا حُمَيْدٌ، قَالَ قَدِمَ عَلَيْنَا الْحَسَنُ مَكَّةَ فَكَلَّمَنِي فُقَهَاءُ أَهْلِ مَكَّةَ أَنْ أُكَلِّمَهُ فِي أَنْ يَجْلِسَ لَهُمْ يَوْمًا يَعِظُهُمْ فِيهِ ‏.‏ فَقَالَ نَعَمْ ‏.‏ فَاجْتَمَعُوا فَخَطَبَهُمْ فَمَا رَأَيْتُ أَخْطَبَ مِنْهُ فَقَالَ رَجُلٌ يَا أَبَا سَعِيدٍ مَنْ خَلَقَ الشَّيْطَانَ فَقَالَ سُبْحَانَ اللَّهِ هَلْ مِنْ خَالِقٍ غَيْرُ اللَّهِ خَلَقَ اللَّهُ الشَّيْطَانَ وَخَلَقَ الْخَيْرَ وَخَلَقَ الشَّرَّ ‏.‏ قَالَ الرَّجُلُ قَاتَلَهُمُ اللَّهُ كَيْفَ يَكْذِبُونَ عَلَى هَذَا الشَّيْخِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4619,
			"arabicnumber": 4619,
			"text": "حَدَّثَنَا ابْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنِ الْحَسَنِ، ‏{‏ كَذَلِكَ نَسْلُكُهُ فِي قُلُوبِ الْمُجْرِمِينَ ‏}‏ قَالَ الشِّرْكُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4620,
			"arabicnumber": 4620,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنْ رَجُلٍ، قَدْ سَمَّاهُ غَيْرِ ابْنِ كَثِيرٍ عَنْ سُفْيَانَ، عَنْ عُبَيْدٍ الصِّيدِ، عَنِ الْحَسَنِ، فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏{‏ وَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ ‏}‏ قَالَ بَيْنَهُمْ وَبَيْنَ الإِيمَانِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4621,
			"arabicnumber": 4621,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا سُلَيْمٌ، عَنِ ابْنِ عَوْنٍ، قَالَ كُنْتُ أَسِيرُ بِالشَّامِ فَنَادَانِي رَجُلٌ مِنْ خَلْفِي فَالْتَفَتُّ فَإِذَا رَجَاءُ بْنُ حَيْوَةَ فَقَالَ يَا أَبَا عَوْنٍ مَا هَذَا الَّذِي يَذْكُرُونَ عَنِ الْحَسَنِ قَالَ قُلْتُ إِنَّهُمْ يَكْذِبُونَ عَلَى الْحَسَنِ كَثِيرًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4622,
			"arabicnumber": 4622,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ سَمِعْتُ أَيُّوبَ، يَقُولُ كَذَبَ عَلَى الْحَسَنِ ضَرْبَانِ مِنَ النَّاسِ قَوْمٌ الْقَدَرُ رَأْيُهُمْ وَهُمْ يُرِيدُونَ أَنْ يُنَفِّقُوا بِذَلِكَ رَأْيَهُمْ وَقَوْمٌ لَهُ فِي قُلُوبِهِمْ شَنَآنٌ وَبُغْضٌ يَقُولُونَ أَلَيْسَ مِنْ قَوْلِهِ كَذَا أَلَيْسَ مِنْ قَوْلِهِ كَذَا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4623,
			"arabicnumber": 4623,
			"text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، أَنَّ يَحْيَى بْنَ كَثِيرٍ الْعَنْبَرِيَّ، حَدَّثَهُمْ قَالَ كَانَ قُرَّةُ بْنُ خَالِدٍ يَقُولُ لَنَا يَا فِتْيَانُ لاَ تُغْلَبُوا عَلَى الْحَسَنِ فَإِنَّهُ كَانَ رَأْيُهُ السُّنَّةَ وَالصَّوَابَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4624,
			"arabicnumber": 4624,
			"text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُؤَمَّلُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ ابْنِ عَوْنٍ، قَالَ لَوْ عَلِمْنَا أَنَّ كَلِمَةَ، الْحَسَنِ تَبْلُغُ مَا بَلَغَتْ لَكَتَبْنَا بِرُجُوعِهِ كِتَابًا وَأَشْهَدْنَا عَلَيْهِ شُهُودًا وَلَكِنَّا قُلْنَا كَلِمَةٌ خَرَجَتْ لاَ تُحْمَلُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4625,
			"arabicnumber": 4625,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، قَالَ قَالَ لِيَ الْحَسَنُ مَا أَنَا بِعَائِدٍ، إِلَى شَىْءٍ مِنْهُ أَبَدًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4626,
			"arabicnumber": 4626,
			"text": "حَدَّثَنَا هِلاَلُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ، عَنْ عُثْمَانَ الْبَتِّيِّ، قَالَ مَا فَسَّرَ الْحَسَنُ آيَةً قَطُّ إِلاَّ عَلَى الإِثْبَاتِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4627,
			"arabicnumber": 4627,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا نَقُولُ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم لاَ نَعْدِلُ بِأَبِي بَكْرٍ أَحَدًا ثُمَّ عُمَرَ ثُمَّ عُثْمَانَ ثُمَّ نَتْرُكُ أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم لاَ تَفَاضُلَ بَيْنَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4628,
			"arabicnumber": 4628,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَنْبَسَةُ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ إِنَّ ابْنَ عُمَرَ قَالَ كُنَّا نَقُولُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حَىٌّ أَفْضَلُ أُمَّةِ النَّبِيِّ صلى الله عليه وسلم بَعْدَهُ أَبُو بَكْرٍ ثُمَّ عُمَرُ ثُمَّ عُثْمَانُ رضى الله عنهم أَجْمَعِينَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4629,
			"arabicnumber": 4629,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا جَامِعُ بْنُ أَبِي رَاشِدٍ، حَدَّثَنَا أَبُو يَعْلَى، عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ، قَالَ قُلْتُ لأَبِي أَىُّ النَّاسِ خَيْرٌ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو بَكْرٍ ‏.‏ قَالَ قُلْتُ ثُمَّ مَنْ قَالَ ثُمَّ عُمَرُ ‏.‏ قَالَ ثُمَّ خَشِيتُ أَنْ أَقُولَ ثُمَّ مَنْ فَيَقُولَ عُثْمَانُ فَقُلْتُ ثُمَّ أَنْتَ يَا أَبَةِ قَالَ مَا أَنَا إِلاَّ رَجُلٌ مِنَ الْمُسْلِمِينَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4630,
			"arabicnumber": 4630,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي الْفِرْيَابِيَّ - قَالَ سَمِعْتُ سُفْيَانَ، يَقُولُ مَنْ زَعَمَ أَنَّ عَلِيًّا، عَلَيْهِ السَّلاَمُ كَانَ أَحَقَّ بِالْوِلاَيَةِ مِنْهُمَا فَقَدْ خَطَّأَ أَبَا بَكْرٍ وَعُمَرَ وَالْمُهَاجِرِينَ وَالأَنْصَارَ وَمَا أُرَاهُ يَرْتَفِعُ لَهُ مَعَ هَذَا عَمَلٌ إِلَى السَّمَاءِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4631,
			"arabicnumber": 4631,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ فَارِسٍ، حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا عَبَّادٌ السَّمَّاكُ، قَالَ سَمِعْتُ سُفْيَانَ الثَّوْرِيَّ، يَقُولُ الْخُلَفَاءُ خَمْسَةٌ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَعَلِيٌّ وَعُمَرُ بْنُ عَبْدِ الْعَزِيزِ رضى الله عنهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4632,
			"arabicnumber": 4632,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - قَالَ مُحَمَّدٌ كَتَبْتُهُ مِنْ كِتَابِهِ - قَالَ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ قَالَ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ أَنَّ رَجُلاً أَتَى إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أَرَى اللَّيْلَةَ ظُلَّةً يَنْطِفُ مِنْهَا السَّمْنُ وَالْعَسَلُ فَأَرَى النَّاسَ يَتَكَفَّفُونَ بِأَيْدِيهِمْ فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ وَأَرَى سَبَبًا وَاصِلاً مِنَ السَّمَاءِ إِلَى الأَرْضِ فَأَرَاكَ يَا رَسُولَ اللَّهِ أَخَذْتَ بِهِ فَعَلَوْتَ بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلاَ بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلاَ بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَانْقَطَعَ ثُمَّ وُصِلَ فَعَلاَ بِهِ ‏.‏ قَالَ أَبُو بَكْرٍ بِأَبِي وَأُمِّي لَتَدَعَنِّي فَلأَعْبُرَنَّهَا ‏.‏ فَقَالَ ‏\"‏ اعْبُرْهَا ‏\"‏ ‏.‏ قَالَ أَمَّا الظُّلَّةُ فَظُلَّةُ الإِسْلاَمِ وَأَمَّا مَا يَنْطِفُ مِنَ السَّمْنِ وَالْعَسَلِ فَهُوَ الْقُرْآنُ لِينُهُ وَحَلاَوَتُهُ وَأَمَّا الْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ فَهُوَ الْمُسْتَكْثِرُ مِنَ الْقُرْآنِ وَالْمُسْتَقِلُّ مِنْهُ وَأَمَّا السَّبَبُ الْوَاصِلُ مِنَ السَّمَاءِ إِلَى الأَرْضِ فَهُوَ الْحَقُّ الَّذِي أَنْتَ عَلَيْهِ تَأْخُذُ بِهِ فَيُعْلِيكَ اللَّهُ ثُمَّ يَأْخُذُ بِهِ بَعْدَكَ رَجُلٌ فَيَعْلُو بِهِ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَعْلُو بِهِ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَنْقَطِعُ ثُمَّ يُوصَلُ لَهُ فَيَعْلُو بِهِ أَىْ رَسُولَ اللَّهِ لَتُحَدِّثَنِّي أَصَبْتُ أَمْ أَخْطَأْتُ ‏.‏ فَقَالَ ‏\"‏ أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا ‏\"‏ ‏.‏ فَقَالَ أَقْسَمْتُ يَا رَسُولَ اللَّهِ لَتُحَدِّثَنِّي مَا الَّذِي أَخْطَأْتُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تُقْسِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4633,
			"arabicnumber": 4633,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذِهِ الْقِصَّةِ قَالَ فَأَبَى أَنْ يُخْبِرَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4634,
			"arabicnumber": 4634,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا الأَشْعَثُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ذَاتَ يَوْمٍ ‏ \"‏ مَنْ رَأَى مِنْكُمْ رُؤْيَا ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَنَا رَأَيْتُ كَأَنَّ مِيزَانًا نَزَلَ مِنَ السَّمَاءِ فَوُزِنْتَ أَنْتَ وَأَبُو بَكْرٍ فَرُجِحْتَ أَنْتَ بِأَبِي بَكْرٍ وَوُزِنَ عُمَرُ وَأَبُو بَكْرٍ فَرُجِحَ أَبُو بَكْرٍ وَوُزِنَ عُمَرُ وَعُثْمَانُ فَرُجِحَ عُمَرُ ثُمَّ رُفِعَ الْمِيزَانُ فَرَأَيْنَا الْكَرَاهِيَةَ فِي وَجْهِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4635,
			"arabicnumber": 4635,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ذَاتَ يَوْمٍ ‏\"‏ أَيُّكُمْ رَأَى رُؤْيَا ‏\"‏ ‏.‏ فَذَكَرَ مَعْنَاهُ وَلَمْ يَذْكُرِ الْكَرَاهِيَةَ ‏.‏ قَالَ فَاسْتَاءَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْنِي فَسَاءَهُ ذَلِكَ فَقَالَ ‏\"‏ خِلاَفَةُ نُبُوَّةٍ ثُمَّ يُؤْتِي اللَّهُ الْمُلْكَ مَنْ يَشَاءُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4636,
			"arabicnumber": 4636,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ ابْنِ شِهَابٍ، عَنْ عَمْرِو بْنِ أَبَانَ بْنِ عُثْمَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أُرِيَ اللَّيْلَةَ رَجُلٌ صَالِحٌ أَنَّ أَبَا بَكْرٍ نِيطَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَنِيطَ عُمَرُ بِأَبِي بَكْرٍ وَنِيطَ عُثْمَانُ بِعُمَرَ ‏\"‏ ‏.‏ قَالَ جَابِرٌ فَلَمَّا قُمْنَا مِنْ عِنْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم قُلْنَا أَمَّا الرَّجُلُ الصَّالِحُ فَرَسُولُ اللَّهِ صلى الله عليه وسلم وَأَمَّا تَنَوُّطُ بَعْضِهِمْ بِبَعْضٍ فَهُمْ وُلاَةُ هَذَا الأَمْرِ الَّذِي بَعَثَ اللَّهُ بِهِ نَبِيَّهُ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ يُونُسُ وَشُعَيْبٌ لَمْ يَذْكُرَا عَمْرًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4637,
			"arabicnumber": 4637,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَشْعَثَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنِّي رَأَيْتُ كَأَنَّ دَلْوًا دُلِّيَ مِنَ السَّمَاءِ فَجَاءَ أَبُو بَكْرٍ فَأَخَذَ بِعَرَاقِيهَا فَشَرِبَ شُرْبًا ضَعِيفًا ثُمَّ جَاءَ عُمَرُ فَأَخَذَ بِعَرَاقِيهَا فَشَرِبَ حَتَّى تَضَلَّعَ ثُمَّ جَاءَ عُثْمَانُ فَأَخَذَ بِعَرَاقِيهَا فَشَرِبَ حَتَّى تَضَلَّعَ ثُمَّ جَاءَ عَلِيٌّ فَأَخَذَ بِعَرَاقِيهَا فَانْتَشَطَتْ وَانْتَضَحَ عَلَيْهِ مِنْهَا شَىْءٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4638,
			"arabicnumber": 4638,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ مَكْحُولٍ، قَالَ لَتَمْخُرَنَّ الرُّومُ الشَّامَ أَرْبَعِينَ صَبَاحًا لاَ يَمْتَنِعُ مِنْهَا إِلاَّ دِمَشْقُ وَعَمَّانُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4639,
			"arabicnumber": 4639,
			"text": "حَدَّثَنَا مُوسَى بْنُ عَامِرٍ الْمُرِّيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ، أَنَّهُ سَمِعَ أَبَا الأَعْيَسِ عَبْدَ الرَّحْمَنِ بْنَ سَلْمَانَ، يَقُولُ سَيَأْتِي مَلِكٌ مِنْ مُلُوكِ الْعَجَمِ يَظْهَرُ عَلَى الْمَدَائِنِ كُلِّهَا إِلاَّ دِمَشْقَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4640,
			"arabicnumber": 4640,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا بُرْدٌ أَبُو الْعَلاَءِ، عَنْ مَكْحُولٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَوْضِعُ فُسْطَاطِ الْمُسْلِمِينَ فِي الْمَلاَحِمِ أَرْضٌ يُقَالُ لَهَا الْغُوطَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4641,
			"arabicnumber": 4641,
			"text": "حَدَّثَنَا أَبُو ظَفَرٍ عَبْدُ السَّلاَمِ، حَدَّثَنَا جَعْفَرٌ، عَنْ عَوْفٍ، قَالَ سَمِعْتُ الْحَجَّاجَ، يَخْطُبُ وَهُوَ يَقُولُ إِنَّ مَثَلَ عُثْمَانَ عِنْدَ اللَّهِ كَمَثَلِ عِيسَى ابْنِ مَرْيَمَ ثُمَّ قَرَأَ هَذِهِ الآيَةَ يَقْرَؤُهَا وَيَفُسِّرُهَا ‏{‏ إِذْ قَالَ اللَّهُ يَا عِيسَى إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَىَّ وَمُطَهِّرُكَ مِنَ الَّذِينَ كَفَرُوا ‏}‏ يُشِيرُ إِلَيْنَا بِيَدِهِ وَإِلَى أَهْلِ الشَّامِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4642,
			"arabicnumber": 4642,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِسْمَاعِيلَ الطَّالْقَانِيُّ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الْمُغِيرَةِ، عَنِ الرَّبِيعِ بْنِ خَالِدٍ الضَّبِّيِّ، قَالَ سَمِعْتُ الْحَجَّاجَ، يَخْطُبُ فَقَالَ فِي خُطْبَتِهِ رَسُولُ أَحَدِكُمْ فِي حَاجَتِهِ أَكْرَمُ عَلَيْهِ أَمْ خَلِيفَتُهُ فِي أَهْلِهِ فَقُلْتُ فِي نَفْسِي لِلَّهِ عَلَىَّ أَلاَّ أُصَلِّيَ خَلْفَكَ صَلاَةً أَبَدًا وَإِنْ وَجَدْتُ قَوْمًا يُجَاهِدُونَكَ لأُجَاهِدَنَّكَ مَعَهُمْ ‏.‏ زَادَ إِسْحَاقُ فِي حَدِيثِهِ قَالَ فَقَاتَلَ فِي الْجَمَاجِمِ حَتَّى قُتِلَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4643,
			"arabicnumber": 4643,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ عَاصِمٍ، قَالَ سَمِعْتُ الْحَجَّاجَ، وَهُوَ عَلَى الْمِنْبَرِ يَقُولُ اتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ لَيْسَ فِيهَا مَثْنَوِيَّةٌ وَاسْمَعُوا وَأَطِيعُوا لَيْسَ فِيهَا مَثْنَوِيَّةٌ لأَمِيرِ الْمُؤْمِنِينَ عَبْدِ الْمَلِكِ وَاللَّهِ لَوْ أَمَرْتُ النَّاسَ أَنْ يَخْرُجُوا مِنْ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ فَخَرَجُوا مِنْ بَابٍ آخَرَ لَحَلَّتْ لِي دِمَاؤُهُمْ وَأَمْوَالُهُمْ وَاللَّهِ لَوْ أَخَذْتُ رَبِيعَةَ بِمُضَرَ لَكَانَ ذَلِكَ لِي مِنَ اللَّهِ حَلاَلاً وَيَا عَذِيرِي مِنْ عَبْدِ هُذَيْلٍ يَزْعُمُ أَنَّ قِرَاءَتَهُ مِنْ عِنْدِ اللَّهِ وَاللَّهِ مَا هِيَ إِلاَّ رَجَزٌ مِنْ رَجَزِ الأَعْرَابِ مَا أَنْزَلَهَا اللَّهُ عَلَى نَبِيِّهِ عَلَيْهِ السَّلاَمُ وَعَذِيرِي مِنْ هَذِهِ الْحَمْرَاءِ يَزْعُمُ أَحَدُهُمْ أَنَّهُ يَرْمِي بِالْحَجَرِ فَيَقُولُ إِلَى أَنْ يَقَعَ الْحَجَرُ قَدْ حَدَثَ أَمْرٌ فَوَاللَّهِ لأَدَعَنَّهُمْ كَالأَمْسِ الدَّابِرِ ‏.‏ قَالَ فَذَكَرْتُهُ لِلأَعْمَشِ فَقَالَ أَنَا وَاللَّهِ سَمِعْتُهُ مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4644,
			"arabicnumber": 4644,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ الْحَجَّاجَ، يَقُولُ عَلَى الْمِنْبَرِ هَذِهِ الْحَمْرَاءُ هَبْرٌ هَبْرٌ أَمَا وَاللَّهِ لَقَدْ قَرَعْتُ عَصًا بِعَصًا لأَذَرَنَّهُمْ كَالأَمْسِ الذَّاهِبِ يَعْنِي الْمَوَالِي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4645,
			"arabicnumber": 4645,
			"text": "حَدَّثَنَا قَطَنُ بْنُ نُسَيْرٍ، حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ، ح حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنْ شَرِيكٍ، عَنْ سُلَيْمَانَ الأَعْمَشِ، قَالَ جَمَّعْتُ مَعَ الْحَجَّاجِ فَخَطَبَ فَذَكَرَ حَدِيثَ أَبِي بَكْرِ بْنِ عَيَّاشٍ قَالَ فِيهَا فَاسْمَعُوا وَأَطِيعُوا لِخَلِيفَةِ اللَّهِ وَصَفِيِّهِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ ‏.‏ وَسَاقَ الْحَدِيثَ قَالَ وَلَوْ أَخَذْتُ رَبِيعَةَ بِمُضَرَ وَلَمْ يَذْكُرْ قِصَّةَ الْحَمْرَاءِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4646,
			"arabicnumber": 4646,
			"text": "حَدَّثَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ سَعِيدِ بْنِ جُمْهَانَ، عَنْ سَفِينَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خِلاَفَةُ النُّبُوَّةِ ثَلاَثُونَ سَنَةً ثُمَّ يُؤْتِي اللَّهُ الْمُلْكَ - أَوْ مُلْكَهُ - مَنْ يَشَاءُ ‏\"‏ ‏.‏ قَالَ سَعِيدٌ قَالَ لِي سَفِينَةُ أَمْسِكْ عَلَيْكَ أَبَا بَكْرٍ سَنَتَيْنِ وَعُمَرَ عَشْرًا وَعُثْمَانَ اثْنَتَىْ عَشْرَةَ وَعَلِيٌّ كَذَا ‏.‏ قَالَ سَعِيدٌ قُلْتُ لِسَفِينَةَ إِنَّ هَؤُلاَءِ يَزْعُمُونَ أَنَّ عَلِيًّا عَلَيْهِ السَّلاَمُ لَمْ يَكُنْ بِخَلِيفَةٍ ‏.‏ قَالَ كَذَبَتْ أَسْتَاهُ بَنِي الزَّرْقَاءِ يَعْنِي بَنِي مَرْوَانَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4647,
			"arabicnumber": 4647,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا هُشَيْمٌ، عَنِ الْعَوَّامِ بْنِ حَوْشَبٍ، عَنْ سَعِيدِ بْنِ جُمْهَانَ، عَنْ سَفِينَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خِلاَفَةُ النُّبُوَّةِ ثَلاَثُونَ سَنَةً ثُمَّ يُؤْتِي اللَّهُ الْمُلْكَ مَنْ يَشَاءُ - أَوْ مُلْكَهُ مَنْ يَشَاءُ - ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4648,
			"arabicnumber": 4648,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، عَنِ ابْنِ إِدْرِيسَ، أَخْبَرَنَا حُصَيْنٌ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ عَبْدِ اللَّهِ بْنِ ظَالِمٍ، وَسُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ عَبْدِ اللَّهِ بْنِ ظَالِمٍ الْمَازِنِيِّ، قَالَ ذَكَرَ سُفْيَانُ رَجُلاً فِيمَا بَيْنَهُ وَبَيْنَ عَبْدِ اللَّهِ بْنِ ظَالِمٍ الْمَازِنِيِّ قَالَ سَمِعْتُ سَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ قَالَ لَمَّا قَدِمَ فُلاَنٌ الْكُوفَةَ أَقَامَ فُلاَنٌ خَطِيبًا فَأَخَذَ بِيَدِي سَعِيدُ بْنُ زَيْدٍ فَقَالَ أَلاَ تَرَى إِلَى هَذَا الظَّالِمِ فَأَشْهَدُ عَلَى التِّسْعَةِ إِنَّهُمْ فِي الْجَنَّةِ وَلَوْ شَهِدْتُ عَلَى الْعَاشِرِ لَمْ إِيثَمْ - قَالَ ابْنُ إِدْرِيسَ وَالْعَرَبُ تَقُولُ آثَمْ - قُلْتُ وَمَنِ التِّسْعَةُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ عَلَى حِرَاءٍ ‏ \"‏ اثْبُتْ حِرَاءُ إِنَّهُ لَيْسَ عَلَيْكَ إِلاَّ نَبِيٌّ أَوْ صِدِّيقٌ أَوْ شَهِيدٌ ‏\"‏ ‏.‏ قُلْتُ وَمَنِ التِّسْعَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَعَلِيٌّ وَطَلْحَةُ وَالزُّبَيْرُ وَسَعْدُ بْنُ أَبِي وَقَّاصٍ وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ ‏.‏ قُلْتُ وَمَنِ الْعَاشِرُ فَتَلَكَّأَ هُنَيَّةً ثُمَّ قَالَ أَنَا ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ الأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ هِلاَلِ بْنِ يِسَافٍ عَنِ ابْنِ حَيَّانَ عَنْ عَبْدِ اللَّهِ بْنِ ظَالِمٍ بِإِسْنَادِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4649,
			"arabicnumber": 4649,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحُرِّ بْنِ الصَّيَّاحِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَخْنَسِ، أَنَّهُ كَانَ فِي الْمَسْجِدِ فَذَكَرَ رَجُلٌ عَلِيًّا عَلَيْهِ السَّلاَمُ فَقَامَ سَعِيدُ بْنُ زَيْدٍ فَقَالَ أَشْهَدُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنِّي سَمِعْتُهُ وَهُوَ يَقُولُ ‏ \"‏ عَشْرَةٌ فِي الْجَنَّةِ النَّبِيُّ فِي الْجَنَّةِ وَأَبُو بَكْرٍ فِي الْجَنَّةِ وَعُمَرُ فِي الْجَنَّةِ وَعُثْمَانُ فِي الْجَنَّةِ وَعَلِيٌّ فِي الْجَنَّةِ وَطَلْحَةُ فِي الْجَنَّةِ وَالزُّبَيْرُ بْنُ الْعَوَّامِ فِي الْجَنَّةِ وَسَعْدُ بْنُ مَالِكٍ فِي الْجَنَّةِ وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فِي الْجَنَّةِ ‏\"‏ ‏.‏ وَلَوْ شِئْتَ لَسَمَّيْتُ الْعَاشِرَ ‏.‏ قَالَ فَقَالُوا مَنْ هُوَ فَسَكَتَ قَالَ فَقَالُوا مَنْ هُوَ فَقَالَ هُوَ سَعِيدُ بْنُ زَيْدٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4650,
			"arabicnumber": 4650,
			"text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا صَدَقَةُ بْنُ الْمُثَنَّى النَّخَعِيُّ، حَدَّثَنِي جَدِّي، رِيَاحُ بْنُ الْحَارِثِ قَالَ كُنْتُ قَاعِدًا عِنْدَ فُلاَنٍ فِي مَسْجِدِ الْكُوفَةِ وَعِنْدَهُ أَهْلُ الْكُوفَةِ فَجَاءَ سَعِيدُ بْنُ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ فَرَحَّبَ بِهِ وَحَيَّاهُ وَأَقْعَدَهُ عِنْدَ رِجْلِهِ عَلَى السَّرِيرِ فَجَاءَ رَجُلٌ مِنْ أَهْلِ الْكُوفَةِ يُقَالُ لَهُ قَيْسُ بْنُ عَلْقَمَةَ فَاسْتَقْبَلَهُ فَسَبَّ وَسَبَّ فَقَالَ سَعِيدٌ مَنْ يَسُبُّ هَذَا الرَّجُلُ قَالَ يَسُبُّ عَلِيًّا ‏.‏ قَالَ أَلاَ أَرَى أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم يُسَبُّونَ عِنْدَكَ ثُمَّ لاَ تُنْكِرُ وَلاَ تُغَيِّرُ أَنَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ وَإِنِّي لَغَنِيٌّ أَنْ أَقُولَ عَلَيْهِ مَا لَمْ يَقُلْ فَيَسْأَلُنِي عَنْهُ غَدًا إِذَا لَقِيتُهُ ‏ \"‏ أَبُو بَكْرٍ فِي الْجَنَّةِ وَعُمَرُ فِي الْجَنَّةِ ‏\"‏ ‏.‏ وَسَاقَ مَعْنَاهُ ثُمَّ قَالَ لَمَشْهَدُ رَجُلٍ مِنْهُمْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَغْبَرُّ فِيهِ وَجْهُهُ خَيْرٌ مِنْ عَمَلِ أَحَدِكُمْ عُمْرَهُ وَلَوْ عُمِّرَ عُمْرَ نُوحٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4651,
			"arabicnumber": 4651,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، - الْمَعْنَى - قَالاَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم صَعِدَ أُحُدًا فَتَبِعَهُ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ فَرَجَفَ بِهِمْ فَضَرَبَهُ نَبِيُّ اللَّهِ صلى الله عليه وسلم بِرِجْلِهِ وَقَالَ ‏ \"‏ اثْبُتْ أُحُدُ نَبِيٌّ وَصِدِّيقٌ وَشَهِيدَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4652,
			"arabicnumber": 4652,
			"text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدٍ الْمُحَارِبِيِّ، عَنْ عَبْدِ السَّلاَمِ بْنِ حَرْبٍ، عَنْ أَبِي خَالِدٍ الدَّالاَنِيِّ، عَنْ أَبِي خَالِدٍ، مَوْلَى آلِ جَعْدَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَانِي جِبْرِيلُ فَأَخَذَ بِيَدِي فَأَرَانِي بَابَ الْجَنَّةِ الَّذِي تَدْخُلُ مِنْهُ أُمَّتِي ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ وَدِدْتُ أَنِّي كُنْتُ مَعَكَ حَتَّى أَنْظُرَ إِلَيْهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا إِنَّكَ يَا أَبَا بَكْرٍ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4653,
			"arabicnumber": 4653,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَيَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ، أَنَّ اللَّيْثَ، حَدَّثَهُمْ عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ لاَ يَدْخُلُ النَّارَ أَحَدٌ مِمَّنْ بَايَعَ تَحْتَ الشَّجَرَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4654,
			"arabicnumber": 4654,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ مُوسَى ‏\"‏ فَلَعَلَّ اللَّهَ ‏\"‏ ‏.‏ وَقَالَ ابْنُ سِنَانٍ ‏\"‏ اطَّلَعَ اللَّهُ عَلَى أَهْلِ بَدْرٍ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ غَفَرْتُ لَكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4655,
			"arabicnumber": 4655,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، أَنَّ مُحَمَّدَ بْنَ ثَوْرٍ، حَدَّثَهُمْ عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم زَمَنَ الْحُدَيْبِيَةِ فَذَكَرَ الْحَدِيثَ ‏.‏ قَالَ فَأَتَاهُ - يَعْنِي عُرْوَةَ بْنَ مَسْعُودٍ - فَجَعَلَ يُكَلِّمُ النَّبِيَّ صلى الله عليه وسلم فَكُلَّمَا كَلَّمَهُ أَخَذَ بِلِحْيَتِهِ وَالْمُغِيرَةُ بْنُ شُعْبَةَ قَائِمٌ عَلَى رَأْسِ النَّبِيِّ صلى الله عليه وسلم وَمَعَهُ السَّيْفُ وَعَلَيْهِ الْمِغْفَرُ فَضَرَبَ يَدَهُ بِنَعْلِ السَّيْفِ وَقَالَ أَخِّرْ يَدَكَ عَنْ لِحْيَتِهِ ‏.‏ فَرَفَعَ عُرْوَةُ رَأْسَهُ فَقَالَ مَنْ هَذَا قَالُوا الْمُغِيرَةُ بْنُ شُعْبَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4656,
			"arabicnumber": 4656,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ أَبُو عُمَرَ الضَّرِيرُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَنَّ سَعِيدَ بْنَ إِيَاسٍ الْجُرَيْرِيَّ، أَخْبَرَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ الْعُقَيْلِيِّ، عَنِ الأَقْرَعِ، مُؤَذِّنِ عُمَرَ بْنِ الْخَطَّابِ قَالَ بَعَثَنِي عُمَرُ إِلَى الأُسْقُفِّ فَدَعَوْتُهُ فَقَالَ لَهُ عُمَرُ وَهَلْ تَجِدُنِي فِي الْكِتَابِ قَالَ نَعَمْ ‏.‏ قَالَ كَيْفَ تَجِدُنِي قَالَ أَجِدُكَ قَرْنًا ‏.‏ فَرَفَعَ عَلَيْهِ الدِّرَّةَ فَقَالَ قَرْنُ مَهْ فَقَالَ قَرْنٌ حَدِيدٌ أَمِينٌ شَدِيدٌ ‏.‏ قَالَ كَيْفَ تَجِدُ الَّذِي يَجِيءُ مِنْ بَعْدِي فَقَالَ أَجِدُهُ خَلِيفَةً صَالِحًا غَيْرَ أَنَّهُ يُؤْثِرُ قَرَابَتَهُ ‏.‏ قَالَ عُمَرُ يَرْحَمُ اللَّهُ عُثْمَانَ ثَلاَثًا فَقَالَ كَيْفَ تَجِدُ الَّذِي بَعْدَهُ قَالَ أَجِدُهُ صَدَأَ حَدِيدٍ فَوَضَعَ عُمَرُ يَدَهُ عَلَى رَأْسِهِ فَقَالَ يَا دَفْرَاهُ يَا دَفْرَاهُ ‏.‏ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّهُ خَلِيفَةٌ صَالِحٌ وَلَكِنَّهُ يُسْتَخْلَفُ حِينَ يُسْتَخْلَفُ وَالسَّيْفُ مَسْلُولٌ وَالدَّمُ مُهْرَاقٌ ‏.‏ قَالَ أَبُو دَاوُدَ الدَّفْرُ النَّتْنُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4657,
			"arabicnumber": 4657,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ أَنْبَأَنَا ح، وَحَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ أُمَّتِي الْقَرْنُ الَّذِينَ بُعِثْتُ فِيهِمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏ ‏.‏ وَاللَّهُ أَعْلَمُ أَذَكَرَ الثَّالِثَ أَمْ لاَ ‏\"‏ ثُمَّ يَظْهَرُ قَوْمٌ يَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ وَيَنْذِرُونَ وَلاَ يُوفُونَ وَيَخُونُونَ وَلاَ يُؤْتَمَنُونَ وَيَفْشُو فِيهِمُ السِّمَنُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4658,
			"arabicnumber": 4658,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَسُبُّوا أَصْحَابِي فَوَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنْفَقَ أَحَدُكُمْ مِثْلَ أُحُدٍ ذَهَبًا مَا بَلَغَ مُدَّ أَحَدِهِمْ وَلاَ نَصِيفَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4659,
			"arabicnumber": 4659,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زَائِدَةُ بْنُ قُدَامَةَ الثَّقَفِيُّ، حَدَّثَنَا عُمَرُ بْنُ قَيْسٍ الْمَاصِرُ، عَنْ عَمْرِو بْنِ أَبِي قُرَّةَ، قَالَ كَانَ حُذَيْفَةُ بِالْمَدَائِنِ فَكَانَ يَذْكُرُ أَشْيَاءَ قَالَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم لأُنَاسٍ مِنْ أَصْحَابِهِ فِي الْغَضَبِ فَيَنْطَلِقُ نَاسٌ مِمَّنْ سَمِعَ ذَلِكَ مِنْ حُذَيْفَةَ فَيَأْتُونَ سَلْمَانَ فَيَذْكُرُونَ لَهُ قَوْلَ حُذَيْفَةَ فَيَقُولُ سَلْمَانُ حُذَيْفَةُ أَعْلَمُ بِمَا يَقُولُ فَيَرْجِعُونَ إِلَى حُذَيْفَةَ فَيَقُولُونَ لَهُ قَدْ ذَكَرْنَا قَوْلَكَ لِسَلْمَانَ فَمَا صَدَّقَكَ وَلاَ كَذَّبَكَ ‏.‏ فَأَتَى حُذَيْفَةُ سَلْمَانَ وَهُوَ فِي مَبْقَلَةٍ فَقَالَ يَا سَلْمَانُ مَا يَمْنَعُكَ أَنْ تُصَدِّقَنِي بِمَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ سَلْمَانُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَغْضَبُ فَيَقُولُ فِي الْغَضَبِ لِنَاسٍ مِنْ أَصْحَابِهِ وَيَرْضَى فَيَقُولُ فِي الرِّضَا لِنَاسٍ مِنْ أَصْحَابِهِ أَمَا تَنْتَهِي حَتَّى تُوَرِّثَ رِجَالاً حُبَّ رِجَالٍ وَرِجَالاً بُغْضَ رِجَالٍ وَحَتَّى تُوقِعَ اخْتِلاَفًا وَفُرْقَةً وَلَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ فَقَالَ ‏ \"‏ أَيُّمَا رَجُلٍ مِنْ أُمَّتِي سَبَبْتُهُ سَبَّةً أَوْ لَعَنْتُهُ لَعْنَةً فِي غَضَبِي - فَإِنَّمَا أَنَا مِنْ وَلَدِ آدَمَ أَغْضَبُ كَمَا يَغْضَبُونَ وَإِنَّمَا بَعَثَنِي رَحْمَةً لِلْعَالَمِينَ - فَاجْعَلْهَا عَلَيْهِمْ صَلاَةً يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ وَاللَّهِ لَتَنْتَهِيَنَّ أَوْ لأَكْتُبَنَّ إِلَى عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4660,
			"arabicnumber": 4660,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ، قَالَ لَمَّا اسْتُعِزَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا عِنْدَهُ فِي نَفَرٍ مِنَ الْمُسْلِمِينَ دَعَاهُ بِلاَلٌ إِلَى الصَّلاَةِ فَقَالَ مُرُوا مَنْ يُصَلِّي لِلنَّاسِ ‏.‏ فَخَرَجَ عَبْدُ اللَّهِ بْنُ زَمَعَةَ فَإِذَا عُمَرُ فِي النَّاسِ وَكَانَ أَبُو بَكْرٍ غَائِبًا فَقُلْتُ يَا عُمَرُ قُمْ فَصَلِّ بِالنَّاسِ فَتَقَدَّمَ فَكَبَّرَ فَلَمَّا سَمِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَوْتَهُ وَكَانَ عُمَرُ رَجُلاً مُجْهِرًا قَالَ ‏ \"‏ فَأَيْنَ أَبُو بَكْرٍ يَأْبَى اللَّهُ ذَلِكَ وَالْمُسْلِمُونَ يَأْبَى اللَّهُ ذَلِكَ وَالْمُسْلِمُونَ ‏\"‏ ‏.‏ فَبَعَثَ إِلَى أَبِي بَكْرٍ فَجَاءَ بَعْدَ أَنْ صَلَّى عُمَرُ تِلْكَ الصَّلاَةَ فَصَلَّى بِالنَّاسِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4661,
			"arabicnumber": 4661,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ حَدَّثَنِي مُوسَى بْنُ يَعْقُوبَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ زَمْعَةَ، أَخْبَرَهُ بِهَذَا الْخَبَرِ، قَالَ لَمَّا سَمِعَ النَّبِيُّ صلى الله عليه وسلم صَوْتَ عُمَرَ قَالَ ابْنُ زَمَعَةَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم حَتَّى أَطْلَعَ رَأْسَهُ مِنْ حُجْرَتِهِ ثُمَّ قَالَ ‏ \"‏ لاَ لاَ لاَ لِيُصَلِّ لِلنَّاسِ ابْنُ أَبِي قُحَافَةَ ‏\"‏ ‏.‏ يَقُولُ ذَلِكَ مُغْضَبًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4662,
			"arabicnumber": 4662,
			"text": "حَدَّثَنَا مُسَدَّدٌ، وَمُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، قَالَ حَدَّثَنِي الأَشْعَثُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلْحَسَنِ بْنِ عَلِيٍّ ‏\"‏ إِنَّ ابْنِي هَذَا سَيِّدٌ وَإِنِّي أَرْجُو أَنْ يُصْلِحَ اللَّهُ بِهِ بَيْنَ فِئَتَيْنِ مِنْ أُمَّتِي ‏\"‏ ‏.‏ وَقَالَ فِي حَدِيثِ حَمَّادٍ ‏\"‏ وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنَ الْمُسْلِمِينَ عَظِيمَتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4663,
			"arabicnumber": 4663,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا يَزِيدُ، أَخْبَرَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، قَالَ قَالَ حُذَيْفَةُ مَا أَحَدٌ مِنَ النَّاسِ تُدْرِكُهُ الْفِتْنَةُ إِلاَّ أَنَا أَخَافُهَا عَلَيْهِ إِلاَّ مُحَمَّدُ بْنُ مَسْلَمَةَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَضُرُّكَ الْفِتْنَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4664,
			"arabicnumber": 4664,
			"text": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنْ أَبِي بُرْدَةَ، عَنْ ثَعْلَبَةَ بْنِ ضُبَيْعَةَ، قَالَ دَخَلْنَا عَلَى حُذَيْفَةَ فَقَالَ إِنِّي لأَعْرِفُ رَجُلاً لاَ تَضُرُّهُ الْفِتَنُ شَيْئًا ‏.‏ قَالَ فَخَرَجْنَا فَإِذَا فُسْطَاطٌ مَضْرُوبٌ فَدَخَلْنَا فَإِذَا فِيهِ مُحَمَّدُ بْنُ مَسْلَمَةَ فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ مَا أُرِيدُ أَنْ يَشْتَمِلَ عَلَىَّ شَىْءٌ مِنْ أَمْصَارِكُمْ حَتَّى تَنْجَلِيَ عَمَّا انْجَلَتْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4665,
			"arabicnumber": 4665,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَشْعَثَ بْنِ سُلَيْمٍ، عَنْ أَبِي بُرْدَةَ، عَنْ ضُبَيْعَةَ بْنِ حُصَيْنٍ الثَّعْلَبِيِّ، بِمَعْنَاهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4666,
			"arabicnumber": 4666,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الْهُذَلِيُّ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ قُلْتُ لِعَلِيٍّ رضى الله عنه أَخْبِرْنَا عَنْ مَسِيرِكَ هَذَا أَعَهْدٌ عَهِدَهُ إِلَيْكَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَمْ رَأْىٌ رَأَيْتَهُ فَقَالَ مَا عَهِدَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَىْءٍ وَلَكِنَّهُ رَأْىٌ رَأَيْتُهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4667,
			"arabicnumber": 4667,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَمْرُقُ مَارِقَةٌ عِنْدَ فُرْقَةٍ مِنَ الْمُسْلِمِينَ يَقْتُلُهَا أَوْلَى الطَّائِفَتَيْنِ بِالْحَقِّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4668,
			"arabicnumber": 4668,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرٌو، - يَعْنِي ابْنَ يَحْيَى - عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تُخَيِّرُوا بَيْنَ الأَنْبِيَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4669,
			"arabicnumber": 4669,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ إِنِّي خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4670,
			"arabicnumber": 4670,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا يَنْبَغِي لِنَبِيٍّ أَنْ يَقُولَ إِنِّي خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4671,
			"arabicnumber": 4671,
			"text": "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ، وَمُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، قَالاَ حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَعَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَجُلٌ مِنَ الْيَهُودِ وَالَّذِي اصْطَفَى مُوسَى ‏.‏ فَرَفَعَ الْمُسْلِمُ يَدَهُ فَلَطَمَ وَجْهَ الْيَهُودِيِّ فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تُخَيِّرُونِي عَلَى مُوسَى فَإِنَّ النَّاسَ يُصْعَقُونَ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ فَإِذَا مُوسَى بَاطِشٌ فِي جَانِبِ الْعَرْشِ فَلاَ أَدْرِي أَكَانَ مِمَّنْ صَعِقَ فَأَفَاقَ قَبْلِي أَوْ كَانَ مِمَّنِ اسْتَثْنَى اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَحَدِيثُ ابْنِ يَحْيَى أَتَمُّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4672,
			"arabicnumber": 4672,
			"text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُخْتَارِ بْنِ فُلْفُلٍ، يَذْكُرُ عَنْ أَنَسٍ، قَالَ قَالَ رَجُلٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا خَيْرَ الْبَرِيَّةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ذَاكَ إِبْرَاهِيمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4673,
			"arabicnumber": 4673,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ، حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، عَنْ أَبِي عَمَّارٍ، عَنْ عَبْدِ اللَّهِ بْنِ فَرُّوخَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَا سَيِّدُ وَلَدِ آدَمَ وَأَوَّلُ مَنْ تَنْشَقُّ عَنْهُ الأَرْضُ وَأَوَّلُ شَافِعٍ وَأَوَّلُ مُشَفَّعٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4674,
			"arabicnumber": 4674,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلاَنِيُّ، وَمَخْلَدُ بْنُ خَالِدٍ الشَّعِيرِيُّ، - الْمَعْنَى - قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا أَدْرِي أَتُبَّعٌ لَعِينٌ هُوَ أَمْ لاَ وَمَا أَدْرِي أَعُزَيْرٌ نَبِيٌّ هُوَ أَمْ لاَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4675,
			"arabicnumber": 4675,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ أَنَا أَوْلَى النَّاسِ بِابْنِ مَرْيَمَ الأَنْبِيَاءُ أَوْلاَدُ عَلاَّتٍ وَلَيْسَ بَيْنِي وَبَيْنَهُ نَبِيٌّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4676,
			"arabicnumber": 4676,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الإِيمَانُ بِضْعٌ وَسَبْعُونَ أَفْضَلُهَا قَوْلُ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَدْنَاهَا إِمَاطَةُ الْعَظْمِ عَنِ الطَّرِيقِ وَالْحَيَاءُ شُعْبَةٌ مِنَ الإِيمَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4677,
			"arabicnumber": 4677,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، حَدَّثَنِي أَبُو جَمْرَةَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا قَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ قَالَ ‏\"‏ أَتَدْرُونَ مَا الإِيمَانُ بِاللَّهِ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَإِقَامُ الصَّلاَةِ وَإِيتَاءُ الزَّكَاةِ وَصَوْمُ رَمَضَانَ وَأَنْ تُعْطُوا الْخُمُسَ مِنَ الْمَغْنَمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4678,
			"arabicnumber": 4678,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَ الْعَبْدِ وَبَيْنَ الْكُفْرِ تَرْكُ الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4679,
			"arabicnumber": 4679,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ بَكْرِ بْنِ مُضَرَ، عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا رَأَيْتُ مِنْ نَاقِصَاتِ عَقْلٍ وَلاَ دِينٍ أَغْلَبَ لِذِي لُبٍّ مِنْكُنَّ ‏\"‏ ‏.‏ قَالَتْ وَمَا نُقْصَانُ الْعَقْلِ وَالدِّينِ قَالَ ‏\"‏ أَمَّا نُقْصَانُ الْعَقْلِ فَشَهَادَةُ امْرَأَتَيْنِ شَهَادَةُ رَجُلٍ وَأَمَّا نُقْصَانُ الدِّينِ فَإِنَّ إِحْدَاكُنَّ تُفْطِرُ رَمَضَانَ وَتُقِيمُ أَيَّامًا لاَ تُصَلِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4680,
			"arabicnumber": 4680,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، - الْمَعْنَى - قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا تَوَجَّهَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْكَعْبَةِ قَالُوا يَا رَسُولَ اللَّهِ فَكَيْفَ الَّذِينَ مَاتُوا وَهُمْ يُصَلُّونَ إِلَى بَيْتِ الْمَقْدِسِ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏ وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4681,
			"arabicnumber": 4681,
			"text": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ، حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورٍ، عَنْ يَحْيَى بْنِ الْحَارِثِ، عَنِ الْقَاسِمِ، عَنْ أَبِي أُمَامَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ مَنْ أَحَبَّ لِلَّهِ وَأَبْغَضَ لِلَّهِ وَأَعْطَى لِلَّهِ وَمَنَعَ لِلَّهِ فَقَدِ اسْتَكْمَلَ الإِيمَانَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4682,
			"arabicnumber": 4682,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4683,
			"arabicnumber": 4683,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ ثَوْرٍ، عَنْ مَعْمَرٍ، قَالَ وَأَخْبَرَنِي الزُّهْرِيُّ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم رِجَالاً وَلَمْ يُعْطِ رَجُلاً مِنْهُمْ شَيْئًا فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ أَعْطَيْتَ فُلاَنًا وَفُلاَنًا وَلَمْ تُعْطِ فُلاَنًا شَيْئًا وَهُوَ مُؤْمِنٌ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوْ مُسْلِمٌ ‏\"‏ ‏.‏ حَتَّى أَعَادَهَا سَعْدٌ ثَلاَثًا وَالنَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَوْ مُسْلِمٌ ‏\"‏ ‏.‏ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي أُعْطِي رِجَالاً وَأَدَعُ مَنْ هُوَ أَحَبُّ إِلَىَّ مِنْهُمْ لاَ أُعْطِيهِ شَيْئًا مَخَافَةَ أَنْ يُكَبُّوا فِي النَّارِ عَلَى وُجُوهِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4684,
			"arabicnumber": 4684,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا ابْنُ ثَوْرٍ، عَنْ مَعْمَرٍ، قَالَ وَقَالَ الزُّهْرِيُّ ‏{‏ قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا ‏}‏ قَالَ نَرَى أَنَّ الإِسْلاَمَ الْكَلِمَةُ وَالإِيمَانَ الْعَمَلُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4685,
			"arabicnumber": 4685,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ح وَحَدَّثَنَا إِبْرَاهِيمُ بْنُ بَشَّارٍ، حَدَّثَنَا سُفْيَانُ، - الْمَعْنَى - قَالاَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَسَّمَ بَيْنَ النَّاسِ قَسْمًا فَقُلْتُ أَعْطِ فُلاَنًا فَإِنَّهُ مُؤْمِنٌ ‏.‏ قَالَ ‏ \"‏ أَوْ مُسْلِمٌ إِنِّي لأُعْطِي الرَّجُلَ الْعَطَاءَ وَغَيْرُهُ أَحَبُّ إِلَىَّ مِنْهُ مَخَافَةَ أَنْ يُكَبَّ عَلَى وَجْهِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4686,
			"arabicnumber": 4686,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، قَالَ وَاقِدُ بْنُ عَبْدِ اللَّهِ أَخْبَرَنِي عَنْ أَبِيهِ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4687,
			"arabicnumber": 4687,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا رَجُلٍ مُسْلِمٍ أَكْفَرَ رَجُلاً مُسْلِمًا فَإِنْ كَانَ كَافِرًا وَإِلاَّ كَانَ هُوَ الْكَافِرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4688,
			"arabicnumber": 4688,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَرْبَعٌ مَنْ كُنَّ فِيهِ فَهُوَ مُنَافِقٌ خَالِصٌ وَمَنْ كَانَتْ فِيهِ خَلَّةٌ مِنْهُنَّ كَانَ فِيهِ خَلَّةٌ مِنْ نِفَاقٍ حَتَّى يَدَعَهَا إِذَا حَدَّثَ كَذَبَ وَإِذَا وَعَدَ أَخْلَفَ وَإِذَا عَاهَدَ غَدَرَ وَإِذَا خَاصَمَ فَجَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4689,
			"arabicnumber": 4689,
			"text": "حَدَّثَنَا أَبُو صَالِحٍ الأَنْطَاكِيُّ، أَخْبَرَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَالتَّوْبَةُ مَعْرُوضَةٌ بَعْدُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4690,
			"arabicnumber": 4690,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ سُوَيْدٍ الرَّمْلِيُّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا نَافِعٌ، - يَعْنِي ابْنَ يَزِيدَ - قَالَ حَدَّثَنِي ابْنُ الْهَادِ، أَنَّ سَعِيدَ بْنَ أَبِي سَعِيدٍ الْمَقْبُرِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا زَنَى الرَّجُلُ خَرَجَ مِنْهُ الإِيمَانُ كَانَ عَلَيْهِ كَالظُّلَّةِ فَإِذَا انْقَطَعَ رَجَعَ إِلَيْهِ الإِيمَانُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4691,
			"arabicnumber": 4691,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، قَالَ حَدَّثَنِي بِمِنًى، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْقَدَرِيَّةُ مَجُوسُ هَذِهِ الأُمَّةِ إِنْ مَرِضُوا فَلاَ تَعُودُوهُمْ وَإِنْ مَاتُوا فَلاَ تَشْهَدُوهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4692,
			"arabicnumber": 4692,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ عُمَرَ بْنِ مُحَمَّدٍ، عَنْ عُمَرَ، مَوْلَى غُفْرَةَ عَنْ رَجُلٍ، مِنَ الأَنْصَارِ عَنْ حُذَيْفَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِكُلِّ أُمَّةٍ مَجُوسٌ وَمَجُوسُ هَذِهِ الأُمَّةِ الَّذِينَ يَقُولُونَ لاَ قَدَرَ مَنْ مَاتَ مِنْهُمْ فَلاَ تَشْهَدُوا جَنَازَتَهُ وَمَنْ مَرِضَ مِنْهُمْ فَلاَ تَعُودُوهُمْ وَهُمْ شِيعَةُ الدَّجَّالِ وَحَقٌّ عَلَى اللَّهِ أَنْ يُلْحِقَهُمْ بِالدَّجَّالِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4693,
			"arabicnumber": 4693,
			"text": "حَدَّثَنَا مُسَدَّدٌ، أَنَّ يَزِيدَ بْنَ زُرَيْعٍ، وَيَحْيَى بْنَ سَعِيدٍ، حَدَّثَاهُمْ قَالاَ، حَدَّثَنَا عَوْفٌ، قَالَ حَدَّثَنَا قَسَامَةُ بْنُ زُهَيْرٍ، قَالَ حَدَّثَنَا أَبُو مُوسَى الأَشْعَرِيُّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ خَلَقَ آدَمَ مِنْ قَبْضَةٍ قَبَضَهَا مِنْ جَمِيعِ الأَرْضِ فَجَاءَ بَنُو آدَمَ عَلَى قَدْرِ الأَرْضِ جَاءَ مِنْهُمُ الأَحْمَرُ وَالأَبْيَضُ وَالأَسْوَدُ وَبَيْنَ ذَلِكَ وَالسَّهْلُ وَالْحَزْنُ وَالْخَبِيثُ وَالطَّيِّبُ ‏\"‏ ‏.‏ زَادَ فِي حَدِيثِ يَحْيَى ‏\"‏ وَبَيْنَ ذَلِكَ ‏\"‏ ‏.‏ وَالإِخْبَارُ فِي حَدِيثِ يَزِيدَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4694,
			"arabicnumber": 4694,
			"text": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ مَنْصُورَ بْنَ الْمُعْتَمِرِ، يُحَدِّثُ عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ حَبِيبٍ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، عَلَيْهِ السَّلاَمُ قَالَ كُنَّا فِي جَنَازَةٍ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِبَقِيعِ الْغَرْقَدِ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ وَمَعَهُ مِخْصَرَةٌ فَجَعَلَ يَنْكُتُ بِالْمِخْصَرَةِ فِي الأَرْضِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ مَا مِنْ نَفْسٍ مَنْفُوسَةٍ إِلاَّ قَدْ كَتَبَ اللَّهُ مَكَانَهَا مِنَ النَّارِ أَوْ مِنَ الْجَنَّةِ إِلاَّ قَدْ كُتِبَتْ شَقِيَّةً أَوْ سَعِيدَةً ‏\"‏ ‏.‏ قَالَ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ يَا نَبِيَّ اللَّهِ أَفَلاَ نَمْكُثُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ فَمَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ لَيَكُونَنَّ إِلَى السَّعَادَةِ وَمَنْ كَانَ مِنْ أَهْلِ الشِّقْوَةِ لَيَكُونَنَّ إِلَى الشِّقْوَةِ قَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ أَمَّا أَهْلُ السَّعَادَةِ فَيُيَسَّرُونَ لِلسَّعَادَةِ وَأَمَّا أَهْلُ الشِّقْوَةِ فَيُيَسَّرُونَ لِلشِّقْوَةِ ‏\"‏ ‏.‏ ثُمَّ قَالَ نَبِيُّ اللَّهِ ‏\"‏ ‏{‏ فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى * فَسَنُيَسِّرُهُ لِلْيُسْرَى * وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَى * وَكَذَّبَ بِالْحُسْنَى * ‏.‏ فَسَنُيَسِّرُهُ لِلْعُسْرَى ‏}‏ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4695,
			"arabicnumber": 4695,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا كَهْمَسٌ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، قَالَ كَانَ أَوَّلَ مَنْ تَكَلَّمَ فِي الْقَدَرِ بِالْبَصْرَةِ مَعْبَدٌ الْجُهَنِيُّ فَانْطَلَقْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَاجَّيْنِ أَوْ مُعْتَمِرَيْنِ فَقُلْنَا لَوْ لَقِينَا أَحَدًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَاهُ عَمَّا يَقُولُ هَؤُلاَءِ فِي الْقَدَرِ ‏.‏ فَوَفَّقَ اللَّهُ لَنَا عَبْدَ اللَّهِ بْنَ عُمَرَ دَاخِلاً فِي الْمَسْجِدِ فَاكْتَنَفْتُهُ أَنَا وَصَاحِبِي فَظَنَنْتُ أَنَّ صَاحِبِي سَيَكِلُ الْكَلاَمَ إِلَىَّ فَقُلْتُ أَبَا عَبْدِ الرَّحْمَنِ إِنَّهُ قَدْ ظَهَرَ قِبَلَنَا نَاسٌ يَقْرَءُونَ الْقُرْآنَ وَيَتَفَقَّرُونَ الْعِلْمَ يَزْعُمُونَ أَنْ لاَ قَدَرَ وَالأَمْرُ أُنُفٌ ‏.‏ فَقَالَ إِذَا لَقِيتَ أُولَئِكَ فَأَخْبِرْهُمْ أَنِّي بَرِيءٌ مِنْهُمْ وَهُمْ بُرَآءُ مِنِّي وَالَّذِي يَحْلِفُ بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ لَوْ أَنَّ لأَحَدِهِمْ مِثْلَ أُحُدٍ ذَهَبًا فَأَنْفَقَهُ مَا قَبِلَهُ اللَّهُ مِنْهُ حَتَّى يُؤْمِنَ بِالْقَدَرِ ثُمَّ قَالَ حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ قَالَ بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ شَدِيدُ سَوَادِ الشَّعْرِ لاَ يُرَى عَلَيْهِ أَثَرُ السَّفَرِ وَلاَ نَعْرِفُهُ حَتَّى جَلَسَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ وَقَالَ يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلاَمِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَتُقِيمَ الصَّلاَةَ وَتُؤْتِيَ الزَّكَاةَ وَتَصُومَ رَمَضَانَ وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلاً ‏\"‏ ‏.‏ قَالَ صَدَقْتَ ‏.‏ قَالَ فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ ‏.‏ قَالَ فَأَخْبِرْنِي عَنِ الإِيمَانِ ‏.‏ قَالَ ‏\"‏ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الآخِرِ وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ ‏\"‏ ‏.‏ قَالَ صَدَقْتَ ‏.‏ قَالَ فَأَخْبِرْنِي عَنِ الإِحْسَانِ قَالَ ‏\"‏ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ‏\"‏ ‏.‏ قَالَ فَأَخْبِرْنِي عَنِ السَّاعَةِ ‏.‏ قَالَ ‏\"‏ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ ‏\"‏ ‏.‏ قَالَ فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا ‏.‏ قَالَ ‏\"‏ أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ ‏\"‏ ‏.‏ قَالَ ثُمَّ انْطَلَقَ فَلَبِثْتُ ثَلاَثًا ثُمَّ قَالَ ‏\"‏ يَا عُمَرُ هَلْ تَدْرِي مَنِ السَّائِلُ ‏\"‏ ‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4696,
			"arabicnumber": 4696,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ بْنِ غِيَاثٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، وَحُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ لَقِينَا عَبْدَ اللَّهِ بْنَ عُمَرَ فَذَكَرْنَا لَهُ الْقَدَرَ وَمَا يَقُولُونَ فِيهِ فَذَكَرَ نَحْوَهُ زَادَ قَالَ وَسَأَلَهُ رَجُلٌ مِنْ مُزَيْنَةَ أَوْ جُهَيْنَةَ فَقَالَ يَا رَسُولَ اللَّهِ فِيمَا نَعْمَلُ أَفِي شَىْءٍ قَدْ خَلاَ أَوْ مَضَى أَوْ شَىْءٍ يُسْتَأْنَفُ الآنَ قَالَ ‏\"‏ فِي شَىْءٍ قَدْ خَلاَ وَمَضَى ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ أَوْ بَعْضُ الْقَوْمِ فَفِيمَ الْعَمَلُ قَالَ ‏\"‏ إِنَّ أَهْلَ الْجَنَّةِ يُيَسَّرُونَ لِعَمَلِ أَهْلِ الْجَنَّةِ وَإِنَّ أَهْلَ النَّارِ يُيَسَّرُونَ لِعَمَلِ أَهْلِ النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4697,
			"arabicnumber": 4697,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، حَدَّثَنَا الْفِرْيَابِيُّ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنَا عَلْقَمَةُ بْنُ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنِ ابْنِ يَعْمَرَ، بِهَذَا الْحَدِيثِ يَزِيدُ وَيَنْقُصُ قَالَ فَمَا الإِسْلاَمُ قَالَ ‏ \"‏ إِقَامُ الصَّلاَةِ وَإِيتَاءُ الزَّكَاةِ وَحَجُّ الْبَيْتِ وَصَوْمُ شَهْرِ رَمَضَانَ وَالاِغْتِسَالُ مِنَ الْجَنَابَةِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ عَلْقَمَةُ مُرْجِئٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4698,
			"arabicnumber": 4698,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ أَبِي فَرْوَةَ الْهَمْدَانِيِّ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي ذَرٍّ، وَأَبِي، هُرَيْرَةَ قَالاَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْلِسُ بَيْنَ ظَهْرَىْ أَصْحَابِهِ فَيَجِيءُ الْغَرِيبُ فَلاَ يَدْرِي أَيُّهُمْ هُوَ حَتَّى يَسْأَلَ فَطَلَبْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ نَجْعَلَ لَهُ مَجْلِسًا يَعْرِفُهُ الْغَرِيبُ إِذَا أَتَاهُ - قَالَ - فَبَنَيْنَا لَهُ دُكَّانًا مِنْ طِينٍ فَجَلَسَ عَلَيْهِ وَكُنَّا نَجْلِسُ بِجَنْبَتَيْهِ وَذَكَرَ نَحْوَ هَذَا الْخَبَرِ فَأَقْبَلَ رَجُلٌ فَذَكَرَ هَيْئَتَهُ حَتَّى سَلَّمَ مِنْ طَرْفِ السِّمَاطِ فَقَالَ السَّلاَمُ عَلَيْكَ يَا مُحَمَّدُ ‏.‏ قَالَ فَرَدَّ عَلَيْهِ النَّبِيُّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4699,
			"arabicnumber": 4699,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي سِنَانٍ، عَنْ وَهْبِ بْنِ خَالِدٍ الْحِمْصِيِّ، عَنِ ابْنِ الدَّيْلَمِيِّ، قَالَ أَتَيْتُ أُبَىَّ بْنَ كَعْبٍ فَقُلْتُ لَهُ وَقَعَ فِي نَفْسِي شَىْءٌ مِنَ الْقَدَرِ فَحَدِّثْنِي بِشَىْءٍ لَعَلَّ اللَّهَ أَنْ يُذْهِبَهُ مِنْ قَلْبِي ‏.‏ فَقَالَ لَوْ أَنَّ اللَّهَ عَذَّبَ أَهْلَ سَمَوَاتِهِ وَأَهْلَ أَرْضِهِ عَذَّبَهُمْ وَهُوَ غَيْرُ ظَالِمٍ لَهُمْ وَلَوْ رَحِمَهُمْ كَانَتْ رَحْمَتُهُ خَيْرًا لَهُمْ مِنْ أَعْمَالِهِمْ وَلَوْ أَنْفَقْتَ مِثْلَ أُحُدٍ ذَهَبًا فِي سَبِيلِ اللَّهِ مَا قَبِلَهُ اللَّهُ مِنْكَ حَتَّى تُؤْمِنَ بِالْقَدَرِ وَتَعْلَمَ أَنَّ مَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ وَأَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ وَلَوْ مُتَّ عَلَى غَيْرِ هَذَا لَدَخَلْتَ النَّارَ ‏.‏ قَالَ ثُمَّ أَتَيْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ فَقَالَ مِثْلَ ذَلِكَ - قَالَ - ثُمَّ أَتَيْتُ حُذَيْفَةَ بْنَ الْيَمَانِ فَقَالَ مِثْلَ ذَلِكَ - قَالَ - ثُمَّ أَتَيْتُ زَيْدَ بْنَ ثَابِتٍ فَحَدَّثَنِي عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4700,
			"arabicnumber": 4700,
			"text": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ الْهُذَلِيُّ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا الْوَلِيدُ بْنُ رَبَاحٍ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ، عَنْ أَبِي حَفْصَةَ، قَالَ قَالَ عُبَادَةُ بْنُ الصَّامِتِ لاِبْنِهِ يَا بُنَىَّ إِنَّكَ لَنْ تَجِدَ طَعْمَ حَقِيقَةِ الإِيمَانِ حَتَّى تَعْلَمَ أَنَّ مَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ وَمَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ أَوَّلَ مَا خَلَقَ اللَّهُ الْقَلَمَ فَقَالَ لَهُ اكْتُبْ ‏.‏ قَالَ رَبِّ وَمَاذَا أَكْتُبُ قَالَ اكْتُبْ مَقَادِيرَ كُلِّ شَىْءٍ حَتَّى تَقُومَ السَّاعَةُ ‏\"‏ ‏.‏ يَا بُنَىَّ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ مَاتَ عَلَى غَيْرِ هَذَا فَلَيْسَ مِنِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4701,
			"arabicnumber": 4701,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، - الْمَعْنَى - قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، سَمِعَ طَاوُسًا، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يُخْبِرُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ احْتَجَّ آدَمُ وَمُوسَى فَقَالَ مُوسَى يَا آدَمُ أَنْتَ أَبُونَا خَيَّبْتَنَا وَأَخْرَجْتَنَا مِنَ الْجَنَّةِ ‏.‏ فَقَالَ آدَمُ أَنْتَ مُوسَى اصْطَفَاكَ اللَّهُ بِكَلاَمِهِ وَخَطَّ لَكَ التَّوْرَاةَ بِيَدِهِ تَلُومُنِي عَلَى أَمْرٍ قَدَّرَهُ عَلَىَّ قَبْلَ أَنْ يَخْلُقَنِي بِأَرْبَعِينَ سَنَةً فَحَجَّ آدَمُ مُوسَى ‏\"‏ ‏.‏ قَالَ أَحْمَدُ بْنُ صَالِحٍ عَنْ عَمْرٍو عَنْ طَاوُسٍ سَمِعَ أَبَا هُرَيْرَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4702,
			"arabicnumber": 4702,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي هِشَامُ بْنُ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مُوسَى قَالَ يَا رَبِّ أَرِنَا آدَمَ الَّذِي أَخْرَجَنَا وَنَفْسَهُ مِنَ الْجَنَّةِ فَأَرَاهُ اللَّهُ آدَمَ فَقَالَ أَنْتَ أَبُونَا آدَمُ فَقَالَ لَهُ آدَمُ نَعَمْ ‏.‏ قَالَ أَنْتَ الَّذِي نَفَخَ اللَّهُ فِيكَ مِنْ رُوحِهِ وَعَلَّمَكَ الأَسْمَاءَ كُلَّهَا وَأَمَرَ الْمَلاَئِكَةَ فَسَجَدُوا لَكَ قَالَ نَعَمْ ‏.‏ قَالَ فَمَا حَمَلَكَ عَلَى أَنْ أَخْرَجْتَنَا وَنَفْسَكَ مِنَ الْجَنَّةِ فَقَالَ لَهُ آدَمُ وَمَنْ أَنْتَ قَالَ أَنَا مُوسَى ‏.‏ قَالَ أَنْتَ نَبِيُّ بَنِي إِسْرَائِيلَ الَّذِي كَلَّمَكَ اللَّهُ مِنْ وَرَاءِ الْحِجَابِ لَمْ يَجْعَلْ بَيْنَكَ وَبَيْنَهُ رَسُولاً مِنْ خَلْقِهِ قَالَ نَعَمْ ‏.‏ قَالَ أَفَمَا وَجَدْتَ أَنَّ ذَلِكَ كَانَ فِي كِتَابِ اللَّهِ قَبْلَ أَنْ أُخْلَقَ قَالَ نَعَمْ ‏.‏ قَالَ فَفِيمَ تَلُومُنِي فِي شَىْءٍ سَبَقَ مِنَ اللَّهِ تَعَالَى فِيهِ الْقَضَاءُ قَبْلِي ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ فَحَجَّ آدَمُ مُوسَى فَحَجَّ آدَمُ مُوسَى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4703,
			"arabicnumber": 4703,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، أَنَّ عَبْدَ الْحَمِيدِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، أَخْبَرَهُ عَنْ مُسْلِمِ بْنِ يَسَارٍ الْجُهَنِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سُئِلَ عَنْ هَذِهِ الآيَةِ، ‏{‏ وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ‏}‏ قَالَ قَرَأَ الْقَعْنَبِيُّ الآيَةَ ‏.‏ فَقَالَ عُمَرُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ خَلَقَ آدَمَ ثُمَّ مَسَحَ ظَهْرَهُ بِيَمِينِهِ فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقْتُ هَؤُلاَءِ لِلْجَنَّةِ وَبِعَمَلِ أَهْلِ الْجَنَّةِ يَعْمَلُونَ ثُمَّ مَسَحَ ظَهْرَهُ فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقْتُ هَؤُلاَءِ لِلنَّارِ وَبِعَمَلِ أَهْلِ النَّارِ يَعْمَلُونَ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ فَفِيمَ الْعَمَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا خَلَقَ الْعَبْدَ لِلْجَنَّةِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعْمَالِ أَهْلِ الْجَنَّةِ فَيُدْخِلَهُ بِهِ الْجَنَّةَ وَإِذَا خَلَقَ الْعَبْدَ لِلنَّارِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعْمَالِ أَهْلِ النَّارِ فَيُدْخِلَهُ بِهِ النَّارَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4704,
			"arabicnumber": 4704,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، حَدَّثَنَا بَقِيَّةُ، قَالَ حَدَّثَنِي عُمَرُ بْنُ جُعْثُمَ الْقُرَشِيُّ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، عَنْ نُعَيْمِ بْنِ رَبِيعَةَ، قَالَ كُنْتُ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ بِهَذَا الْحَدِيثِ وَحَدِيثُ مَالِكٍ أَتَمُّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4705,
			"arabicnumber": 4705,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ رَقَبَةَ بْنِ مَصْقَلَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْغُلاَمُ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا وَلَوْ عَاشَ لأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4706,
			"arabicnumber": 4706,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، حَدَّثَنَا الْفِرْيَابِيُّ، عَنْ إِسْرَائِيلَ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حَدَّثَنَا أُبَىُّ بْنُ كَعْبٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ فِي قَوْلِهِ ‏{‏ وَأَمَّا الْغُلاَمُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ ‏}‏ ‏\"‏ وَكَانَ طُبِعَ يَوْمَ طُبِعَ كَافِرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4707,
			"arabicnumber": 4707,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَبْصَرَ الْخَضِرُ غُلاَمًا يَلْعَبُ مَعَ الصِّبْيَانِ فَتَنَاوَلَ رَأْسَهُ فَقَلَعَهُ فَقَالَ مُوسَى ‏{‏ أَقَتَلْتَ نَفْسًا زَكِيَّةً ‏}‏ ‏\"‏ ‏.‏ الآيَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4708,
			"arabicnumber": 4708,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، - الْمَعْنَى وَاحِدٌ وَالإِخْبَارُ فِي حَدِيثِ سُفْيَانَ - عَنِ الأَعْمَشِ قَالَ حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ الصَّادِقُ الْمَصْدُوقُ ‏ \"‏ إِنَّ خَلْقَ أَحَدِكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ ثُمَّ يُبْعَثُ إِلَيْهِ مَلَكٌ فَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ فَيُكْتَبُ رِزْقُهُ وَأَجَلُهُ وَعَمَلُهُ ثُمَّ يُكْتَبُ شَقِيٌّ أَوْ سَعِيدٌ ثُمَّ يُنْفَخُ فِيهِ الرُّوحُ فَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ أَوْ قِيدُ ذِرَاعٍ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ أَوْ قِيدُ ذِرَاعٍ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4709,
			"arabicnumber": 4709,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَزِيدَ الرِّشْكِ، قَالَ حَدَّثَنَا مُطَرِّفٌ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قِيلَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ أَعُلِمَ أَهْلُ الْجَنَّةِ مِنْ أَهْلِ النَّارِ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ فَفِيمَ يَعْمَلُ الْعَامِلُونَ قَالَ ‏\"‏ كُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4710,
			"arabicnumber": 4710,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ أَبُو عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ دِينَارٍ، عَنْ حَكِيمِ بْنِ شَرِيكٍ الْهُذَلِيِّ، عَنْ يَحْيَى بْنِ مَيْمُونٍ الْحَضْرَمِيِّ، عَنْ رَبِيعَةَ الْجُرَشِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُجَالِسُوا أَهْلَ الْقَدَرِ وَلاَ تُفَاتِحُوهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4711,
			"arabicnumber": 4711,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ ‏ \"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4712,
			"arabicnumber": 4712,
			"text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ، حَدَّثَنَا بَقِيَّةُ، ح وَحَدَّثَنَا مُوسَى بْنُ مَرْوَانَ الرَّقِّيُّ، وَكَثِيرُ بْنُ عُبَيْدٍ الْمَذْحِجِيُّ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، - الْمَعْنَى - عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، عَنْ عَائِشَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ ذَرَارِيُّ الْمُؤْمِنِينَ فَقَالَ ‏\"‏ هُمْ مِنْ آبَائِهِمْ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ بِلاَ عَمَلٍ قَالَ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ فَذَرَارِيُّ الْمُشْرِكِينَ قَالَ ‏\"‏ مِنْ آبَائِهِمْ ‏\"‏ ‏.‏ قُلْتُ بِلاَ عَمَلٍ قَالَ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4713,
			"arabicnumber": 4713,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِصَبِيٍّ مِنَ الأَنْصَارِ يُصَلِّي عَلَيْهِ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ طُوبَى لِهَذَا لَمْ يَعْمَلْ شَرًّا وَلَمْ يَدْرِ بِهِ ‏.‏ فَقَالَ ‏ \"‏ أَوَغَيْرَ ذَلِكَ يَا عَائِشَةُ إِنَّ اللَّهَ خَلَقَ الْجَنَّةَ وَخَلَقَ لَهَا أَهْلاً وَخَلَقَهَا لَهُمْ وَهُمْ فِي أَصْلاَبِ آبَائِهِمْ وَخَلَقَ النَّارَ وَخَلَقَ لَهَا أَهْلاً وَخَلَقَهَا لَهُمْ وَهُمْ فِي أَصْلاَبِ آبَائِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4714,
			"arabicnumber": 4714,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ كَمَا تَنَاتَجُ الإِبِلُ مِنْ بَهِيمَةٍ جَمْعَاءَ هَلْ تُحِسُّ مِنْ جَدْعَاءَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ مَنْ يَمُوتُ وَهُوَ صَغِيرٌ قَالَ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4715,
			"arabicnumber": 4715,
			"text": "قَالَ أَبُو دَاوُدَ قُرِئَ عَلَى الْحَارِثِ بْنِ مِسْكِينٍ وَأَنَا أَسْمَعُ، أَخْبَرَكَ يُوسُفُ بْنُ عَمْرٍو، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ سَمِعْتُ مَالِكًا، قِيلَ لَهُ إِنَّ أَهْلَ الأَهْوَاءِ يَحْتَجُّونَ عَلَيْنَا بِهَذَا الْحَدِيثِ ‏.‏ قَالَ مَالِكٌ احْتَجَّ عَلَيْهِمْ بِآخِرِهِ ‏.‏ قَالُوا أَرَأَيْتَ مَنْ يَمُوتُ وَهُوَ صَغِيرٌ قَالَ ‏ \"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4716,
			"arabicnumber": 4716,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ، قَالَ سَمِعْتُ حَمَّادَ بْنَ سَلَمَةَ، يُفَسِّرُ حَدِيثَ ‏\"‏ كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ ‏\"‏ ‏.‏ قَالَ هَذَا عِنْدَنَا حَيْثُ أَخَذَ اللَّهُ عَلَيْهِمُ الْعَهْدَ فِي أَصْلاَبِ آبَائِهِمْ حَيْثُ قَالَ ‏{‏ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4717,
			"arabicnumber": 4717,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَامِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْوَائِدَةُ وَالْمَوْءُودَةُ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ يَحْيَى بْنُ زَكَرِيَّا قَالَ أَبِي فَحَدَّثَنِي أَبُو إِسْحَاقَ أَنَّ عَامِرًا حَدَّثَهُ بِذَلِكَ عَنْ عَلْقَمَةَ عَنِ ابْنِ مَسْعُودٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4718,
			"arabicnumber": 4718,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ أَيْنَ أَبِي قَالَ ‏\"‏ أَبُوكَ فِي النَّارِ ‏\"‏ ‏.‏ فَلَمَّا قَفَّى قَالَ ‏\"‏ إِنَّ أَبِي وَأَبَاكَ فِي النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4719,
			"arabicnumber": 4719,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنِ ابْنِ آدَمَ مَجْرَى الدَّمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4720,
			"arabicnumber": 4720,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي ابْنُ لَهِيعَةَ، وَعَمْرُو بْنُ الْحَارِثِ، وَسَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ عَطَاءِ بْنِ دِينَارٍ، عَنْ حَكِيمِ بْنِ شَرِيكٍ الْهُذَلِيِّ، عَنْ يَحْيَى بْنِ مَيْمُونٍ، عَنْ رَبِيعَةَ الْجُرَشِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُجَالِسُوا أَهْلَ الْقَدَرِ وَلاَ تُفَاتِحُوهُمُ الْحَدِيثَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4721,
			"arabicnumber": 4721,
			"text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَزَالُ النَّاسُ يَتَسَاءَلُونَ حَتَّى يُقَالَ هَذَا خَلَقَ اللَّهُ الْخَلْقَ فَمَنْ خَلَقَ اللَّهَ فَمَنْ وَجَدَ مِنْ ذَلِكَ شَيْئًا فَلْيَقُلْ آمَنْتُ بِاللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4722,
			"arabicnumber": 4722,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنَا سَلَمَةُ، - يَعْنِي ابْنَ الْفَضْلِ - قَالَ حَدَّثَنِي مُحَمَّدٌ، - يَعْنِي ابْنَ إِسْحَاقَ - قَالَ حَدَّثَنِي عُتْبَةُ بْنُ مُسْلِمٍ، مَوْلَى بَنِي تَيْمٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ فَذَكَرَ نَحْوَهُ قَالَ ‏\"‏ فَإِذَا قَالُوا ذَلِكَ فَقُولُوا ‏{‏ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ‏}‏ ثُمَّ لْيَتْفُلْ عَنْ يَسَارِهِ ثَلاَثًا وَلْيَسْتَعِذْ مِنَ الشَّيْطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4723,
			"arabicnumber": 4723,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ، حَدَّثَنَا الْوَلِيدُ بْنُ أَبِي ثَوْرٍ، عَنْ سِمَاكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمِيرَةَ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، قَالَ كُنْتُ فِي الْبَطْحَاءِ فِي عِصَابَةٍ فِيهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَرَّتْ بِهِمْ سَحَابَةٌ فَنَظَرَ إِلَيْهَا فَقَالَ ‏\"‏ مَا تُسَمُّونَ هَذِهِ ‏\"‏ ‏.‏ قَالُوا السَّحَابَ ‏.‏ قَالَ ‏\"‏ وَالْمُزْنَ ‏\"‏ ‏.‏ قَالُوا وَالْمُزْنَ ‏.‏ قَالَ ‏\"‏ وَالْعَنَانَ ‏\"‏ ‏.‏ قَالُوا وَالْعَنَانَ ‏.‏ قَالَ أَبُو دَاوُدَ لَمْ أُتْقِنِ الْعَنَانَ جَيِّدًا قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا بُعْدُ مَا بَيْنَ السَّمَاءِ وَالأَرْضِ ‏\"‏ ‏.‏ قَالُوا لاَ نَدْرِي ‏.‏ قَالَ ‏\"‏ إِنَّ بُعْدَ مَا بَيْنَهُمَا إِمَّا وَاحِدَةٌ أَوِ اثْنَتَانِ أَوْ ثَلاَثٌ وَسَبْعُونَ سَنَةً ثُمَّ السَّمَاءُ فَوْقَهَا كَذَلِكَ ‏\"‏ ‏.‏ حَتَّى عَدَّ سَبْعَ سَمَوَاتٍ ‏\"‏ ثُمَّ فَوْقَ السَّابِعَةِ بَحْرٌ بَيْنَ أَسْفَلِهِ وَأَعْلاَهُ مِثْلُ مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ فَوْقَ ذَلِكَ ثَمَانِيَةُ أَوْعَالٍ بَيْنَ أَظْلاَفِهِمْ وَرُكَبِهِمْ مِثْلُ مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ عَلَى ظُهُورِهِمُ الْعَرْشُ بَيْنَ أَسْفَلِهِ وَأَعْلاَهُ مِثْلُ مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ اللَّهُ تَبَارَكَ وَتَعَالَى فَوْقَ ذَلِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4724,
			"arabicnumber": 4724,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ سَعْدٍ، وَمُحَمَّدُ بْنُ سَعِيدٍ، قَالاَ أَخْبَرَنَا عَمْرُو بْنُ أَبِي قَيْسٍ، عَنْ سِمَاكٍ، بِإِسْنَادِهِ وَمَعْنَاهُ ‏.‏",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4725,
			"arabicnumber": 4725,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي، حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ سِمَاكٍ، بِإِسْنَادِهِ وَمَعْنَى هَذَا الْحَدِيثِ الطَّوِيلِ ‏.‏",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، وَأَحْمَدُ بْنُ سَعِيدٍ الرِّبَاطِيُّ، قَالُوا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، - قَالَ أَحْمَدُ كَتَبْنَاهُ مِنْ نُسْخَتِهِ وَهَذَا لَفْظُهُ - قَالَ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَاقَ يُحَدِّثُ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ عَنْ جُبَيْرِ بْنِ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ جُهِدَتِ الأَنْفُسُ وَضَاعَتِ الْعِيَالُ وَنُهِكَتِ الأَمْوَالُ وَهَلَكَتِ الأَنْعَامُ فَاسْتَسْقِ اللَّهَ لَنَا فَإِنَّا نَسْتَشْفِعُ بِكَ عَلَى اللَّهِ وَنَسْتَشْفِعُ بِاللَّهِ عَلَيْكَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَيْحَكَ أَتَدْرِي مَا تَقُولُ ‏\"‏ وَسَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَا زَالَ يُسَبِّحُ حَتَّى عُرِفَ ذَلِكَ فِي وُجُوهِ أَصْحَابِهِ ثُمَّ قَالَ ‏\"‏ وَيْحَكَ إِنَّهُ لاَ يُسْتَشْفَعُ بِاللَّهِ عَلَى أَحَدٍ مِنْ خَلْقِهِ شَأْنُ اللَّهِ أَعْظَمُ مِنْ ذَلِكَ وَيْحَكَ أَتَدْرِي مَا اللَّهُ إِنَّ عَرْشَهُ عَلَى سَمَوَاتِهِ لَهَكَذَا ‏\"‏ ‏.‏ وَقَالَ بِأَصَابِعِهِ مِثْلَ الْقُبَّةِ عَلَيْهِ ‏\"‏ وَإِنَّهُ لَيَئِطُّ بِهِ أَطِيطَ الرَّحْلِ بِالرَّاكِبِ ‏\"‏ ‏.‏ قَالَ ابْنُ بَشَّارٍ فِي حَدِيثِهِ ‏\"‏ إِنَّ اللَّهَ فَوْقَ عَرْشِهِ وَعَرْشُهُ فَوْقَ سَمَوَاتِهِ ‏\"‏ ‏.‏ وَسَاقَ الْحَدِيثَ وَقَالَ عَبْدُ الأَعْلَى وَابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ وَجُبَيْرِ بْنِ مُحَمَّدِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ أَبُو دَاوُدَ وَالْحَدِيثُ بِإِسْنَادِ أَحْمَدَ بْنِ سَعِيدٍ هُوَ الصَّحِيحُ وَافَقَهُ عَلَيْهِ جَمَاعَةٌ مِنْهُمْ يَحْيَى بْنُ مَعِينٍ وَعَلِيُّ بْنُ الْمَدِينِيِّ وَرَوَاهُ جَمَاعَةٌ عَنِ ابْنِ إِسْحَاقَ كَمَا قَالَ أَحْمَدُ أَيْضًا وَكَانَ سَمَاعُ عَبْدِ الأَعْلَى وَابْنِ الْمُثَنَّى وَابْنِ بَشَّارٍ مِنْ نُسْخَةٍ وَاحِدَةٍ فِيمَا بَلَغَنِي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4727,
			"arabicnumber": 4727,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أُذِنَ لِي أَنْ أُحَدِّثَ عَنْ مَلَكٍ مِنْ مَلاَئِكَةِ اللَّهِ مِنْ حَمَلَةِ الْعَرْشِ إِنَّ مَا بَيْنَ شَحْمَةِ أُذُنِهِ إِلَى عَاتِقِهِ مَسِيرَةُ سَبْعِمِائَةِ عَامٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4728,
			"arabicnumber": 4728,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ نَصْرٍ، وَمُحَمَّدُ بْنُ يُونُسَ النَّسَائِيُّ، - الْمَعْنَى - قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا حَرْمَلَةُ، - يَعْنِي ابْنَ عِمْرَانَ - حَدَّثَنِي أَبُو يُونُسَ، سُلَيْمُ بْنُ جُبَيْرٍ مَوْلَى أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقْرَأُ هَذِهِ الآيَةَ ‏{‏ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الأَمَانَاتِ إِلَى أَهْلِهَا ‏}‏ إِلَى قَوْلِهِ تَعَالَى ‏{‏ سَمِيعًا بَصِيرًا ‏}‏ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَضَعُ إِبْهَامَهُ عَلَى أُذُنِهِ وَالَّتِي تَلِيهَا عَلَى عَيْنِهِ قَالَ أَبُو هُرَيْرَةَ ‏.‏ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْرَؤُهَا وَيَضَعُ إِصْبَعَيْهِ قَالَ ابْنُ يُونُسَ قَالَ الْمُقْرِئُ يَعْنِي ‏{‏ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ ‏}‏ يَعْنِي أَنَّ لِلَّهِ سَمْعًا وَبَصَرًا ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا رَدٌّ عَلَى الْجَهْمِيَّةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4729,
			"arabicnumber": 4729,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، وَوَكِيعٌ، وَأَبُو أُسَامَةَ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم جُلُوسًا فَنَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ لَيْلَةَ أَرْبَعَ عَشْرَةَ فَقَالَ ‏\"‏ إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا لاَ تُضَامُّونَ فِي رُؤْيَتِهِ فَإِنِ اسْتَطَعْتُمْ أَنْ لاَ تُغْلَبُوا عَلَى صَلاَةٍ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا فَافْعَلُوا ‏\"‏ ‏.‏ ثُمَّ قَرَأَ هَذِهِ الآيَةَ ‏{‏ فَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا ‏}‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4730,
			"arabicnumber": 4730,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سُفْيَانُ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَهُ يُحَدِّثُ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ نَاسٌ يَا رَسُولَ اللَّهِ أَنَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ قَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي رُؤْيَةِ الشَّمْسِ فِي الظَّهِيرَةِ لَيْسَتْ فِي سَحَابَةٍ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ لَيْسَ فِي سَحَابَةٍ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لاَ تُضَارُّونَ فِي رُؤْيَتِهِ إِلاَّ كَمَا تُضَارُّونَ فِي رُؤْيَةِ أَحَدِهِمَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4731,
			"arabicnumber": 4731,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، - الْمَعْنَى - عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ وَكِيعٍ، - قَالَ مُوسَى - ابْنُ عُدُسٍ عَنْ أَبِي رَزِينٍ، - قَالَ مُوسَى الْعُقَيْلِيُّ - قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَكُلُّنَا يَرَى رَبَّهُ قَالَ ابْنُ مُعَاذٍ مُخْلِيًا بِهِ يَوْمَ الْقِيَامَةِ وَمَا آيَةُ ذَلِكَ فِي خَلْقِهِ قَالَ ‏\"‏ يَا أَبَا رَزِينٍ أَلَيْسَ كُلُّكُمْ يَرَى الْقَمَرَ ‏\"‏ ‏.‏ قَالَ ابْنُ مُعَاذٍ ‏\"‏ لَيْلَةَ الْبَدْرِ مُخْلِيًا بِهِ ‏\"‏ ‏.‏ ثُمَّ اتَّفَقَا قُلْتُ بَلَى ‏.‏ قَالَ ‏\"‏ فَاللَّهُ أَعْظَمُ ‏\"‏ ‏.‏ قَالَ ابْنُ مُعَاذٍ قَالَ ‏\"‏ فَإِنَّمَا هُوَ خَلْقٌ مِنْ خَلْقِ اللَّهِ فَاللَّهُ أَجَلُّ وَأَعْظَمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4732,
			"arabicnumber": 4732,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، أَنَّ أَبَا أُسَامَةَ، أَخْبَرَهُمْ عَنْ عُمَرَ بْنِ حَمْزَةَ، قَالَ قَالَ سَالِمٌ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَطْوِي اللَّهُ السَّمَوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ ثُمَّ يَطْوِي الأَرَضِينَ ثُمَّ يَأْخُذُهُنَّ ‏\"‏ ‏.‏ قَالَ ابْنُ الْعَلاَءِ ‏\"‏ بِيَدِهِ الأُخْرَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4733,
			"arabicnumber": 4733,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَعَنْ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَنْزِلُ رَبُّنَا كُلَّ لَيْلَةٍ إِلَى سَمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرِ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4734,
			"arabicnumber": 4734,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا إِسْرَائِيلُ، حَدَّثَنَا عُثْمَانُ بْنُ الْمُغِيرَةِ، عَنْ سَالِمٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْرِضُ نَفْسَهُ عَلَى النَّاسِ فِي الْمَوْقِفِ فَقَالَ ‏ \"‏ أَلاَ رَجُلٌ يَحْمِلُنِي إِلَى قَوْمِهِ فَإِنَّ قُرَيْشًا قَدْ مَنَعُونِي أَنْ أُبَلِّغَ كَلاَمَ رَبِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4735,
			"arabicnumber": 4735,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، وَعَلْقَمَةُ بْنُ وَقَّاصٍ، وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنْ حَدِيثِ، عَائِشَةَ وَكُلٌّ حَدَّثَنِي طَائِفَةً، مِنَ الْحَدِيثِ قَالَتْ وَلَشَأْنِي فِي نَفْسِي كَانَ أَحْقَرَ مِنْ أَنْ يَتَكَلَّمَ اللَّهُ فِيَّ بِأَمْرٍ يُتْلَى ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4736,
			"arabicnumber": 4736,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عُمَرَ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ مُجَالِدٍ، عَنْ عَامِرٍ، - يَعْنِي الشَّعْبِيَّ - عَنْ عَامِرِ بْنِ شَهْرٍ، قَالَ ‏:‏ كُنْتُ عِنْدَ النَّجَاشِيِّ فَقَرَأَ ابْنٌ لَهُ آيَةً مِنَ الإِنْجِيلِ فَضَحِكْتُ فَقَالَ ‏:‏ أَتَضْحَكُ مِنْ كَلاَمِ اللَّهِ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4737,
			"arabicnumber": 4737,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَوِّذُ الْحَسَنَ وَالْحُسَيْنَ ‏:‏ ‏\"‏ أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ ‏\"‏ ‏.‏ ثُمَّ يَقُولُ ‏:‏ ‏\"‏ كَانَ أَبُوكُمْ يُعَوِّذُ بِهِمَا إِسْمَاعِيلَ وَإِسْحَاقَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ هَذَا دَلِيلٌ عَلَى أَنَّ الْقُرْآنَ لَيْسَ بِمَخْلُوقٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4738,
			"arabicnumber": 4738,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ الرَّازِيُّ، وَعَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ مُسْلِمٍ، قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ إِذَا تَكَلَّمَ اللَّهُ بِالْوَحْىِ سَمِعَ أَهْلُ السَّمَاءِ لِلسَّمَاءِ صَلْصَلَةً كَجَرِّ السِّلْسِلَةِ عَلَى الصَّفَا فَيُصْعَقُونَ، فَلاَ يَزَالُونَ كَذَلِكَ حَتَّى يَأْتِيَهُمْ جِبْرِيلُ حَتَّى إِذَا جَاءَهُمْ جِبْرِيلُ فُزِّعَ عَنْ قُلُوبِهِمْ ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَيَقُولُونَ ‏:‏ يَا جِبْرِيلُ مَاذَا قَالَ رَبُّكَ فَيَقُولُ ‏:‏ الْحَقَّ فَيَقُولُونَ ‏:‏ الْحَقَّ الْحَقَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4739,
			"arabicnumber": 4739,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا بِسْطَامُ بْنُ حُرَيْثٍ، عَنْ أَشْعَثَ الْحُدَّانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ شَفَاعَتِي لأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4740,
			"arabicnumber": 4740,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ الْحَسَنِ بْنِ ذَكْوَانَ، حَدَّثَنَا أَبُو رَجَاءٍ، قَالَ حَدَّثَنِي عِمْرَانُ بْنُ حُصَيْنٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ يَخْرُجُ قَوْمٌ مِنَ النَّارِ بِشَفَاعَةِ مُحَمَّدٍ فَيَدْخُلُونَ الْجَنَّةَ وَيُسَمَّوْنَ الْجَهَنَّمِيِّينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4741,
			"arabicnumber": 4741,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏:‏ ‏ \"‏ إِنَّ أَهْلَ الْجَنَّةِ يَأْكُلُونَ فِيهَا وَيَشْرَبُونَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4742,
			"arabicnumber": 4742,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنَا أَسْلَمُ، عَنْ بِشْرِ بْنِ شَغَافٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ الصُّورُ قَرْنٌ يُنْفَخُ فِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4743,
			"arabicnumber": 4743,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ كُلَّ ابْنِ آدَمَ تَأْكُلُ الأَرْضُ إِلاَّ عَجْبَ الذَّنَبِ، مِنْهُ خُلِقَ وَفِيهِ يُرَكَّبُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4744,
			"arabicnumber": 4744,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏\"‏ لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ قَالَ لِجِبْرِيلَ ‏:‏ اذْهَبْ فَانْظُرْ إِلَيْهَا ‏.‏ فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ ‏:‏ أَىْ رَبِّ وَعِزَّتِكَ لاَ يَسْمَعُ بِهَا أَحَدٌ إِلاَّ دَخَلَهَا ثُمَّ حَفَّهَا بِالْمَكَارِهِ ثُمَّ قَالَ ‏:‏ يَا جِبْرِيلُ اذْهَبْ فَانْظُرْ إِلَيْهَا فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ ‏:‏ أَىْ رَبِّ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لاَ يَدْخُلَهَا أَحَدٌ ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَلَمَّا خَلَقَ اللَّهُ النَّارَ قَالَ ‏:‏ يَا جِبْرِيلُ اذْهَبْ فَانْظُرْ إِلَيْهَا ‏.‏ فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ ‏:‏ أَىْ رَبِّ وَعِزَّتِكَ لاَ يَسْمَعُ بِهَا أَحَدٌ فَيَدْخُلُهَا فَحَفَّهَا بِالشَّهَوَاتِ ثُمَّ قَالَ ‏:‏ يَا جِبْرِيلُ اذْهَبْ فَانْظُرْ إِلَيْهَا ‏.‏ فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ ‏:‏ أَىْ رَبِّ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لاَ يَبْقَى أَحَدٌ إِلاَّ دَخَلَهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4745,
			"arabicnumber": 4745,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏ \"‏ إِنَّ أَمَامَكُمْ حَوْضًا مَا بَيْنَ نَاحِيَتَيْهِ كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4746,
			"arabicnumber": 4746,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي حَمْزَةَ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ ‏:‏ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَزَلْنَا مَنْزِلاً فَقَالَ ‏:‏ ‏ \"‏ مَا أَنْتُمْ جُزْءٌ مِنْ مِائَةِ أَلْفِ جُزْءٍ مِمَّنْ يَرِدُ عَلَىَّ الْحَوْضَ ‏\"‏ ‏.‏ قَالَ قُلْتُ ‏:‏ كَمْ كُنْتُمْ يَوْمَئِذٍ قَالَ ‏:‏ سَبْعَمِائَةٍ أَوْ ثَمَانَمِائَةٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4747,
			"arabicnumber": 4747,
			"text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ ‏:‏ أَغْفَى رَسُولُ اللَّهِ صلى الله عليه وسلم إِغْفَاءَةً فَرَفَعَ رَأْسَهُ مُتَبَسِّمًا، فَإِمَّا قَالَ لَهُمْ وَإِمَّا قَالُوا لَهُ ‏:‏ يَا رَسُولَ اللَّهِ لِمَ ضَحِكْتَ فَقَالَ ‏:‏ ‏\"‏ إِنَّهُ أُنْزِلَتْ عَلَىَّ آنِفًا سُورَةٌ ‏\"‏ ‏.‏ فَقَرَأَ ‏‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ} ‏‏ حَتَّى خَتَمَهَا فَلَمَّا قَرَأَهَا قَالَ ‏:‏ ‏\"‏ هَلْ تَدْرُونَ مَا الْكَوْثَرُ ‏\"‏ ‏.‏ قَالُوا ‏:‏ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَإِنَّهُ نَهْرٌ وَعَدَنِيهِ رَبِّي عَزَّ وَجَلَّ فِي الْجَنَّةِ، وَعَلَيْهِ خَيْرٌ كَثِيرٌ عَلَيْهِ حَوْضٌ تَرِدُ عَلَيْهِ أُمَّتِي يَوْمَ الْقِيَامَةِ آنِيَتُهُ عَدَدُ الْكَوَاكِبِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4748,
			"arabicnumber": 4748,
			"text": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ ‏:‏ لَمَّا عُرِجَ بِنَبِيِّ اللَّهِ صلى الله عليه وسلم فِي الْجَنَّةِ - أَوْ كَمَا قَالَ - عُرِضَ لَهُ نَهْرٌ حَافَتَاهُ الْيَاقُوتُ الْمُجَيَّبُ أَوْ قَالَ الْمُجَوَّفُ، فَضَرَبَ الْمَلَكُ الَّذِي مَعَهُ يَدَهُ فَاسْتَخْرَجَ مِسْكًا فَقَالَ مُحَمَّدٌ صلى الله عليه وسلم لِلْمَلَكِ الَّذِي مَعَهُ ‏:‏ ‏ \"‏ مَا هَذَا ‏\"‏ ‏.‏ قَالَ ‏:‏ هَذَا الْكَوْثَرُ الَّذِي أَعْطَاكَ اللَّهُ عَزَّ وَجَلَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4749,
			"arabicnumber": 4749,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ أَبِي حَازِمٍ أَبُو طَالُوتَ، قَالَ شَهِدْتُ أَبَا بَرْزَةَ دَخَلَ عَلَى عُبَيْدِ اللَّهِ بْنِ زِيَادٍ فَحَدَّثَنِي فُلاَنٌ، سَمَّاهُ مُسْلِمٌ وَكَانَ فِي السِّمَاطِ فَلَمَّا رَآهُ عُبَيْدُ اللَّهِ قَالَ ‏:‏ إِنَّ مُحَمَّدِيَّكُمْ هَذَا الدَّحْدَاحُ، فَفَهِمَهَا الشَّيْخُ فَقَالَ مَا كُنْتُ أَحْسِبُ أَنِّي أَبْقَى فِي قَوْمٍ يُعَيِّرُونِي بِصُحْبَةِ مُحَمَّدٍ صلى الله عليه وسلم فَقَالَ لَهُ عُبَيْدُ اللَّهِ إِنَّ صُحْبَةَ مُحَمَّدٍ صلى الله عليه وسلم لَكَ زَيْنٌ غَيْرُ شَيْنٍ ثُمَّ قَالَ ‏:‏ إِنَّمَا بُعِثْتُ إِلَيْكَ لأَسْأَلَكَ عَنِ الْحَوْضِ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ فِيهِ شَيْئًا فَقَالَ أَبُو بَرْزَةَ ‏:‏ نَعَمْ لاَ مَرَّةً وَلاَ ثِنْتَيْنِ وَلاَ ثَلاَثًا وَلاَ أَرْبَعًا وَلاَ خَمْسًا، فَمَنْ كَذَّبَ بِهِ فَلاَ سَقَاهُ اللَّهُ مِنْهُ ثُمَّ خَرَجَ مُغْضَبًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4750,
			"arabicnumber": 4750,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏\"‏ إِنَّ الْمُسْلِمَ إِذَا سُئِلَ فِي الْقَبْرِ فَشَهِدَ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَلِكَ قَوْلُ اللَّهِ عَزَّ وَجَلَّ ‏{‏ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4751,
			"arabicnumber": 4751,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ الْخَفَّافُ أَبُو نَصْرٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ ‏:‏ إِنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم دَخَلَ نَخْلاً لِبَنِي النَّجَّارِ فَسَمِعَ صَوْتًا فَفَزِعَ فَقَالَ ‏:‏ ‏\"‏ مَنْ أَصْحَابُ هَذِهِ الْقُبُورِ ‏\"‏ ‏.‏ قَالُوا ‏:‏ يَا رَسُولَ اللَّهِ نَاسٌ مَاتُوا فِي الْجَاهِلِيَّةِ ‏.‏ فَقَالَ ‏:‏ ‏\"‏ تَعَوَّذُوا بِاللَّهِ مِنْ عَذَابِ النَّارِ وَمِنْ فِتْنَةِ الدَّجَّالِ ‏\"‏ ‏.‏ قَالُوا ‏:‏ وَمِمَّ ذَاكَ يَا رَسُولَ اللَّهِ قَالَ ‏:‏ ‏\"‏ إِنَّ الْمُؤْمِنَ إِذَا وُضِعَ فِي قَبْرِهِ أَتَاهُ مَلَكٌ فَيَقُولُ لَهُ ‏:‏ مَا كُنْتَ تَعْبُدُ فَإِنِ اللَّهُ هَدَاهُ قَالَ ‏:‏ كُنْتُ أَعْبُدُ اللَّهَ ‏.‏ فَيُقَالُ لَهُ ‏:‏ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَيَقُولُ ‏:‏ هُوَ عَبْدُ اللَّهِ وَرَسُولُهُ فَمَا يُسْأَلُ عَنْ شَىْءٍ غَيْرَهَا فَيُنْطَلَقُ بِهِ إِلَى بَيْتٍ كَانَ لَهُ فِي النَّارِ، فَيُقَالُ لَهُ ‏:‏ هَذَا بَيْتُكَ كَانَ لَكَ فِي النَّارِ وَلَكِنَّ اللَّهَ عَصَمَكَ وَرَحِمَكَ فَأَبْدَلَكَ بِهِ بَيْتًا فِي الْجَنَّةِ فَيَقُولُ ‏:‏ دَعُونِي حَتَّى أَذْهَبَ فَأُبَشِّرَ أَهْلِي ‏.‏ فَيُقَالُ لَهُ ‏:‏ اسْكُنْ ‏.‏ وَإِنَّ الْكَافِرَ إِذَا وُضِعَ فِي قَبْرِهِ أَتَاهُ مَلَكٌ فَيَنْتَهِرُهُ فَيَقُولُ لَهُ ‏:‏ مَا كُنْتَ تَعْبُدُ فَيَقُولُ ‏:‏ لاَ أَدْرِي ‏.‏ فَيُقَالُ لَهُ ‏:‏ لاَ دَرَيْتَ وَلاَ تَلَيْتَ ‏.‏ فَيُقَالُ لَهُ ‏:‏ فَمَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَيَقُولُ ‏:‏ كُنْتُ أَقُولُ مَا يَقُولُ النَّاسُ ‏.‏ فَيَضْرِبُهُ بِمِطْرَاقٍ مِنْ حَدِيدٍ بَيْنَ أُذُنَيْهِ فَيَصِيحُ صَيْحَةً يَسْمَعُهَا الْخَلْقُ غَيْرَ الثَّقَلَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4752,
			"arabicnumber": 4752,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، بِمِثْلِ هَذَا الإِسْنَادِ نَحْوَهُ قَالَ ‏:‏ ‏\"‏ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ، فَيَأْتِيهِ مَلَكَانِ فَيَقُولاَنِ لَهُ ‏\"‏ ‏.‏ فَذَكَرَ قَرِيبًا مِنْ حَدِيثِ الأَوَّلِ قَالَ فِيهِ ‏:‏ ‏\"‏ وَأَمَّا الْكَافِرُ وَالْمُنَافِقُ فَيَقُولاَنِ لَهُ ‏\"‏ ‏.‏ زَادَ ‏:‏ ‏\"‏ الْمُنَافِقُ ‏\"‏ ‏.‏ وَقَالَ ‏:‏ ‏\"‏ يَسْمَعُهَا مَنْ يَلِيهِ غَيْرَ الثَّقَلَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4753,
			"arabicnumber": 4753,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، - وَهَذَا لَفْظُ هَنَّادٍ - عَنِ الأَعْمَشِ، عَنِ الْمِنْهَالِ، عَنْ زَاذَانَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ ‏:‏ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي جَنَازَةِ رَجُلٍ مِنَ الأَنْصَارِ، فَانْتَهَيْنَا إِلَى الْقَبْرِ وَلَمَّا يُلْحَدْ، فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَلَسْنَا حَوْلَهُ كَأَنَّمَا عَلَى رُءُوسِنَا الطَّيْرُ، وَفِي يَدِهِ عُودٌ يَنْكُتُ بِهِ فِي الأَرْضِ، فَرَفَعَ رَأْسَهُ فَقَالَ ‏:‏ ‏\"‏ اسْتَعِيذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ ‏\"‏ ‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا - زَادَ فِي حَدِيثِ جَرِيرٍ هَا هُنَا - وَقَالَ ‏:‏ ‏\"‏ وَإِنَّهُ لَيَسْمَعُ خَفْقَ نِعَالِهِمْ إِذَا وَلَّوْا مُدْبِرِينَ حِينَ يُقَالُ لَهُ ‏:‏ يَا هَذَا مَنْ رَبُّكَ وَمَا دِينُكَ وَمَنْ نَبِيُّكَ ‏\"‏ ‏.‏ قَالَ هَنَّادٌ قَالَ ‏:‏ ‏\"‏ وَيَأْتِيهِ مَلَكَانِ فَيُجْلِسَانِهِ فَيَقُولاَنِ لَهُ ‏:‏ مَنْ رَبُّكَ فَيَقُولُ ‏:‏ رَبِّيَ اللَّهُ ‏.‏ فَيَقُولاَنِ لَهُ ‏:‏ مَا دِينُكَ فَيَقُولُ ‏:‏ دِينِي الإِسْلاَمُ ‏.‏ فَيَقُولاَنِ لَهُ ‏:‏ مَا هَذَا الرَّجُلُ الَّذِي بُعِثَ فِيكُمْ قَالَ فَيَقُولُ ‏:‏ هُوَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَيَقُولاَنِ ‏:‏ وَمَا يُدْرِيكَ فَيَقُولُ ‏:‏ قَرَأْتُ كِتَابَ اللَّهِ فَآمَنْتُ بِهِ وَصَدَّقْتُ ‏\"‏ ‏.‏ زَادَ فِي حَدِيثِ جَرِيرٍ ‏:‏ ‏\"‏ فَذَلِكَ قَوْلُ اللَّهِ عَزَّ وَجَلَّ ‏{‏ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا ‏}‏ ‏\"‏ ‏.‏ الآيَةَ ‏.‏ ثُمَّ اتَّفَقَا قَالَ ‏:‏ ‏\"‏ فَيُنَادِي مُنَادٍ مِنَ السَّمَاءِ ‏:‏ أَنْ قَدْ صَدَقَ عَبْدِي فَأَفْرِشُوهُ مِنَ الْجَنَّةِ، وَافْتَحُوا لَهُ بَابًا إِلَى الْجَنَّةِ وَأَلْبِسُوهُ مِنَ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَيَأْتِيهِ مِنْ رَوْحِهَا وَطِيبِهَا ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ وَيُفْتَحُ لَهُ فِيهَا مَدَّ بَصَرِهِ ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ وَإِنَّ الْكَافِرَ ‏\"‏ ‏.‏ فَذَكَرَ مَوْتَهُ قَالَ ‏:‏ ‏\"‏ وَتُعَادُ رُوحُهُ فِي جَسَدِهِ وَيَأْتِيهِ مَلَكَانِ فَيُجْلِسَانِهِ فَيَقُولاَنِ ‏:‏ مَنْ رَبُّكَ فَيَقُولُ ‏:‏ هَاهْ هَاهْ هَاهْ لاَ أَدْرِي ‏.‏ فَيَقُولاَنِ لَهُ ‏:‏ مَا دِينُكَ فَيَقُولُ ‏:‏ هَاهْ هَاهْ لاَ أَدْرِي ‏.‏ فَيَقُولاَنِ ‏:‏ مَا هَذَا الرَّجُلُ الَّذِي بُعِثَ فِيكُمْ فَيَقُولُ ‏:‏ هَاهْ هَاهْ لاَ أَدْرِي ‏.‏ فَيُنَادِي مُنَادٍ مِنَ السَّمَاءِ ‏:‏ أَنْ كَذَبَ فَأَفْرِشُوهُ مِنَ النَّارِ وَأَلْبِسُوهُ مِنَ النَّارِ، وَافْتَحُوا لَهُ بَابًا إِلَى النَّارِ ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَيَأْتِيهِ مِنْ حَرِّهَا وَسَمُومِهَا ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ وَيُضَيَّقُ عَلَيْهِ قَبْرُهُ حَتَّى تَخْتَلِفَ فِيهِ أَضْلاَعُهُ ‏\"‏ ‏.‏ زَادَ فِي حَدِيثِ جَرِيرٍ قَالَ ‏:‏ ‏\"‏ ثُمَّ يُقَيَّضُ لَهُ أَعْمَى أَبْكَمُ مَعَهُ مِرْزَبَّةٌ مِنْ حَدِيدٍ، لَوْ ضُرِبَ بِهَا جَبَلٌ لَصَارَ تُرَابًا ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَيَضْرِبُهُ بِهَا ضَرْبَةً يَسْمَعُهَا مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ إِلاَّ الثَّقَلَيْنِ فَيَصِيرُ تُرَابًا ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ ثُمَّ تُعَادُ فِيهِ الرُّوحُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4754,
			"arabicnumber": 4754,
			"text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا الْمِنْهَالُ، عَنْ أَبِي عُمَرَ، ‏:‏ زَاذَانَ قَالَ سَمِعْتُ الْبَرَاءَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فَذَكَرَ نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4755,
			"arabicnumber": 4755,
			"text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، وَحُمَيْدُ بْنُ مَسْعَدَةَ، أَنَّ إِسْمَاعِيلَ بْنَ إِبْرَاهِيمَ، حَدَّثَهُمْ قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الْحَسَنِ، عَنْ عَائِشَةَ، ‏:‏ أَنَّهَا ذَكَرَتِ النَّارَ فَبَكَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ مَا يُبْكِيكِ ‏\"‏ ‏.‏ قَالَتْ ‏:‏ ذَكَرْتُ النَّارَ فَبَكَيْتُ، فَهَلْ تَذْكُرُونَ أَهْلِيكُمْ يَوْمَ الْقِيَامَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ أَمَّا فِي ثَلاَثَةِ مَوَاطِنَ فَلاَ يَذْكُرُ أَحَدٌ أَحَدًا ‏:‏ عِنْدَ الْمِيزَانِ حَتَّى يَعْلَمَ أَيَخِفُّ مِيزَانُهُ أَوْ يَثْقُلُ، وَعِنْدَ الْكِتَابِ حِينَ يُقَالُ ‏{‏ هَاؤُمُ اقْرَءُوا كِتَابِيَهْ ‏}‏ حَتَّى يَعْلَمَ أَيْنَ يَقَعُ كِتَابُهُ أَفِي يَمِينِهِ أَمْ فِي شِمَالِهِ أَمْ مِنْ وَرَاءِ ظَهْرِهِ، وَعِنْدَ الصِّرَاطِ إِذَا وُضِعَ بَيْنَ ظَهْرَىْ جَهَنَّمَ ‏\"‏ ‏.‏ قَالَ يَعْقُوبُ ‏:‏ عَنْ يُونُسَ وَهَذَا لَفْظُ حَدِيثِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4756,
			"arabicnumber": 4756,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ بْنِ سُرَاقَةَ، عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏:‏ ‏\"‏ إِنَّهُ لَمْ يَكُنْ نَبِيٌّ بَعْدَ نُوحٍ إِلاَّ وَقَدْ أَنْذَرَ الدَّجَّالَ قَوْمَهُ، وَإِنِّي أُنْذِرُكُمُوهُ ‏\"‏ ‏.‏ فَوَصَفَهُ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏:‏ ‏\"‏ لَعَلَّهُ سَيُدْرِكُهُ مَنْ قَدْ رَآنِي وَسَمِعَ كَلاَمِي ‏\"‏ ‏.‏ قَالُوا ‏:‏ يَا رَسُولَ اللَّهِ كَيْفَ قُلُوبُنَا يَوْمَئِذٍ أَمِثْلُهَا الْيَوْمَ قَالَ ‏:‏ ‏\"‏ أَوْ خَيْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4757,
			"arabicnumber": 4757,
			"text": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ ‏:‏ قَامَ النَّبِيُّ صلى الله عليه وسلم فِي النَّاسِ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، فَذَكَرَ الدَّجَّالَ فَقَالَ ‏:‏ ‏ \"‏ إِنِّي لأُنْذِرُكُمُوهُ، وَمَا مِنْ نَبِيٍّ إِلاَّ قَدْ أَنْذَرَهُ قَوْمَهُ، لَقَدْ أَنْذَرَهُ نُوحٌ قَوْمَهُ، وَلَكِنِّي سَأَقُولُ لَكُمْ فِيهِ قَوْلاً لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ ‏:‏ إِنَّهُ أَعْوَرُ وَإِنَّ اللَّهَ لَيْسَ بِأَعْوَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4758,
			"arabicnumber": 4758,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، وَأَبُو بَكْرِ بْنُ عَيَّاشٍ وَمَنْدَلٌ عَنْ مُطَرِّفٍ، عَنْ أَبِي جَهْمٍ، عَنْ خَالِدِ بْنِ وَهْبَانَ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏ \"‏ مَنْ فَارَقَ الْجَمَاعَةَ شِبْرًا فَقَدْ خَلَعَ رِبْقَةَ الإِسْلاَمِ مِنْ عُنُقِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4759,
			"arabicnumber": 4759,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُطَرِّفُ بْنُ طَرِيفٍ، عَنْ أَبِي الْجَهْمِ، عَنْ خَالِدِ بْنِ وَهْبَانَ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ كَيْفَ أَنْتُمْ وَأَئِمَّةٌ مِنْ بَعْدِي يَسْتَأْثِرُونَ بِهَذَا الْفَىْءِ ‏\"‏ ‏.‏ قُلْتُ ‏:‏ إِذًا وَالَّذِي بَعَثَكَ بِالْحَقِّ أَضَعُ سَيْفِي عَلَى عَاتِقِي، ثُمَّ أَضْرِبُ بِهِ حَتَّى أَلْقَاكَ أَوْ أَلْحَقَكَ ‏.‏ قَالَ ‏:‏ ‏\"‏ أَوَلاَ أَدُلُّكَ عَلَى خَيْرٍ مِنْ ذَلِكَ تَصْبِرُ حَتَّى تَلْقَانِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4760,
			"arabicnumber": 4760,
			"text": "حَدَّثَنَا مُسَدَّدٌ، وَسُلَيْمَانُ بْنُ دَاوُدَ، - الْمَعْنَى - قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْمُعَلَّى بْنِ زِيَادٍ، وَهِشَامِ بْنِ حَسَّانَ، عَنِ الْحَسَنِ، عَنْ ضَبَّةَ بْنِ مِحْصَنٍ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ سَتَكُونُ عَلَيْكُمْ أَئِمَّةٌ تَعْرِفُونَ مِنْهُمْ وَتُنْكِرُونَ فَمَنْ أَنْكَرَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ هِشَامٌ ‏:‏ ‏\"‏ بِلِسَانِهِ فَقَدْ بَرِئَ، وَمَنْ كَرِهَ بِقَلْبِهِ فَقَدْ سَلِمَ وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ ‏\"‏ ‏.‏ فَقِيلَ ‏:‏ يَا رَسُولَ اللَّهِ أَفَلاَ نَقْتُلُهُمْ قَالَ ابْنُ دَاوُدَ ‏:‏ ‏\"‏ أَفَلاَ نُقَاتِلُهُمْ ‏\"‏ ‏.‏ قَالَ ‏:‏ ‏\"‏ لاَ مَا صَلَّوْا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4761,
			"arabicnumber": 4761,
			"text": "حَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ حَدَّثَنَا الْحَسَنُ، عَنْ ضَبَّةَ بْنِ مِحْصَنٍ الْعَنَزِيِّ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ قَالَ ‏:‏ ‏ \"‏ فَمَنْ كَرِهَ فَقَدْ بَرِئَ، وَمَنْ أَنْكَرَ فَقَدْ سَلِمَ ‏\"‏ ‏.‏ قَالَ قَتَادَةُ ‏:‏ يَعْنِي مَنْ أَنْكَرَ بِقَلْبِهِ، وَمَنْ كَرِهَ بِقَلْبِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4762,
			"arabicnumber": 4762,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ زِيَادِ بْنِ عَلاَقَةَ، عَنْ عَرْفَجَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏:‏ ‏ \"‏ سَتَكُونُ فِي أُمَّتِي هَنَاتٌ وَهَنَاتٌ وَهَنَاتٌ، فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ الْمُسْلِمِينَ وَهُمْ جَمِيعٌ فَاضْرِبُوهُ بِالسَّيْفِ كَائِنًا مَنْ كَانَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4763,
			"arabicnumber": 4763,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، وَمُحَمَّدُ بْنُ عِيسَى، - الْمَعْنَى - قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ عَبِيدَةَ، ‏:‏ أَنَّ عَلِيًّا، ذَكَرَ أَهْلَ النَّهْرَوَانِ فَقَالَ ‏:‏ فِيهِمْ رَجُلٌ مُودَنُ الْيَدِ أَوْ مُخْدَجُ الْيَدِ، أَوْ مَثْدُونُ الْيَدِ لَوْلاَ أَنْ تَبْطَرُوا لَنَبَّأْتُكُمْ مَا وَعَدَ اللَّهُ الَّذِينَ يَقْتُلُونَهُمْ عَلَى لِسَانِ مُحَمَّدٍ صلى الله عليه وسلم ‏.‏ قَالَ قُلْتُ ‏:‏ أَنْتَ سَمِعْتَ هَذَا مِنْهُ قَالَ ‏:‏ إِي وَرَبِّ الْكَعْبَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4764,
			"arabicnumber": 4764,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ ‏:‏ بَعَثَ عَلِيٌّ عَلَيْهِ السَّلاَمُ إِلَى النَّبِيِّ صلى الله عليه وسلم بِذُهَيْبَةٍ فِي تُرْبَتِهَا، فَقَسَّمَهَا بَيْنَ أَرْبَعَةٍ بَيْنَ ‏:‏ الأَقْرَعِ بْنِ حَابِسٍ الْحَنْظَلِيِّ ثُمَّ الْمُجَاشِعِيِّ، وَبَيْنَ عُيَيْنَةَ بْنِ بَدْرٍ الْفَزَارِيِّ وَبَيْنَ زَيْدِ الْخَيْلِ الطَّائِيِّ ثُمَّ أَحَدِ بَنِي نَبْهَانَ وَبَيْنَ عَلْقَمَةَ بْنِ عُلاَثَةَ الْعَامِرِيِّ ثُمَّ أَحَدِ بَنِي كِلاَبٍ قَالَ فَغَضِبَتْ قُرَيْشٌ وَالأَنْصَارُ وَقَالَتْ ‏:‏ يُعْطِي صَنَادِيدَ أَهْلِ نَجْدٍ وَيَدَعُنَا ‏.‏ فَقَالَ ‏:‏ ‏\"‏ إِنَّمَا أَتَأَلَّفُهُمْ ‏\"‏ ‏.‏ قَالَ ‏:‏ فَأَقْبَلَ رَجُلٌ غَائِرُ الْعَيْنَيْنِ مُشْرِفُ الْوَجْنَتَيْنِ نَاتِئُ الْجَبِينِ كَثُّ اللِّحْيَةِ مَحْلُوقٌ قَالَ ‏:‏ اتَّقِ اللَّهَ يَا مُحَمَّدُ ‏.‏ فَقَالَ ‏:‏ ‏\"‏ مَنْ يُطِعِ اللَّهَ إِذَا عَصَيْتُهُ أَيَأْمَنُنِي اللَّهُ عَلَى أَهْلِ الأَرْضِ وَلاَ تَأْمَنُونِي ‏\"‏ ‏.‏ قَالَ ‏:‏ فَسَأَلَ رَجُلٌ قَتْلَهُ أَحْسِبُهُ خَالِدَ بْنَ الْوَلِيدِ - قَالَ - فَمَنَعَهُ ‏.‏ قَالَ ‏:‏ فَلَمَّا وَلَّى قَالَ ‏:‏ ‏\"‏ إِنَّ مِنْ ضِئْضِئِ هَذَا أَوْ فِي عَقِبِ هَذَا قَوْمًا يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ حَنَاجِرَهُمْ يَمْرُقُونَ مِنَ الإِسْلاَمِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ، يَقْتُلُونَ أَهْلَ الإِسْلاَمِ وَيَدَعُونَ أَهْلَ الأَوْثَانِ لَئِنْ أَنَا أَدْرَكْتُهُمْ قَتَلْتُهُمْ قَتْلَ عَادٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4765,
			"arabicnumber": 4765,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ الأَنْطَاكِيُّ، حَدَّثَنَا الْوَلِيدُ، وَمُبَشِّرٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ الْحَلَبِيَّ عَنْ أَبِي عَمْرٍو، قَالَ - يَعْنِي الْوَلِيدَ - حَدَّثَنَا أَبُو عَمْرٍو، قَالَ حَدَّثَنِي قَتَادَةُ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَأَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏\"‏ سَيَكُونُ فِي أُمَّتِي اخْتِلاَفٌ وَفُرْقَةٌ، قَوْمٌ يُحْسِنُونَ الْقِيلَ وَيُسِيئُونَ الْفِعْلَ وَيَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ تَرَاقِيَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ لاَ يَرْجِعُونَ حَتَّى يَرْتَدَّ عَلَى فُوقِهِ هُمْ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ طُوبَى لِمَنْ قَتَلَهُمْ وَقَتَلُوهُ، يَدْعُونَ إِلَى كِتَابِ اللَّهِ وَلَيْسُوا مِنْهُ فِي شَىْءٍ، مَنْ قَاتَلَهُمْ كَانَ أَوْلَى بِاللَّهِ مِنْهُمْ ‏\"‏ ‏.‏ قَالُوا ‏:‏ يَا رَسُولَ اللَّهِ مَا سِيمَاهُمْ قَالَ ‏:‏ ‏\"‏ التَّحْلِيقُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4766,
			"arabicnumber": 4766,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَحْوَهُ قَالَ ‏:‏ ‏ \"‏ سِيمَاهُمُ التَّحْلِيقُ وَالتَّسْبِيدُ، فَإِذَا رَأَيْتُمُوهُمْ فَأَنِيمُوهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ التَّسْبِيدُ اسْتِئْصَالُ الشَّعْرِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4767,
			"arabicnumber": 4767,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ خَيْثَمَةَ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، قَالَ قَالَ عَلِيٌّ ‏:‏ إِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا فَلأَنْ أَخِرَّ مِنَ السَّمَاءِ أَحَبُّ إِلَىَّ مِنْ أَنْ أَكْذِبَ عَلَيْهِ وَإِذَا حَدَّثْتُكُمْ فِيمَا بَيْنِي وَبَيْنَكُمْ فَإِنَّمَا الْحَرْبُ خُدْعَةٌ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏:‏ ‏ \"‏ يَأْتِي فِي آخِرِ الزَّمَانِ قَوْمٌ حُدَثَاءُ الأَسْنَانِ سُفَهَاءُ الأَحْلاَمِ، يَقُولُونَ مِنْ قَوْلِ خَيْرِ الْبَرِيَّةِ يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، لاَ يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ، فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ، فَإِنَّ قَتْلَهُمْ أَجْرٌ لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4768,
			"arabicnumber": 4768,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ وَهْبٍ الْجُهَنِيُّ، ‏:‏ أَنَّهُ كَانَ فِي الْجَيْشِ الَّذِينَ كَانُوا مَعَ عَلِيٍّ عَلَيْهِ السَّلاَمُ الَّذِينَ سَارُوا إِلَى الْخَوَارِجِ فَقَالَ عَلِيٌّ عَلَيْهِ السَّلاَمُ ‏:‏ أَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏:‏ ‏ \"‏ يَخْرُجُ قَوْمٌ مِنْ أُمَّتِي يَقْرَءُونَ الْقُرْآنَ لَيْسَتْ قِرَاءَتُكُمْ إِلَى قِرَاءَتِهِمْ شَيْئًا وَلاَ صَلاَتُكُمْ إِلَى صَلاَتِهِمْ شَيْئًا وَلاَ صِيَامُكُمْ إِلَى صِيَامِهِمْ شَيْئًا، يَقْرَءُونَ الْقُرْآنَ يَحْسَبُونَ أَنَّهُ لَهُمْ وَهُوَ عَلَيْهِمْ، لاَ تُجَاوِزُ صَلاَتُهُمْ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، لَوْ يَعْلَمُ الْجَيْشُ الَّذِينَ يُصِيبُونَهُمْ مَا قُضِيَ لَهُمْ عَلَى لِسَانِ نَبِيِّهِمْ صلى الله عليه وسلم لَنَكَلُوا عَلَى الْعَمَلِ، وَآيَةُ ذَلِكَ أَنَّ فِيهِمْ رَجُلاً لَهُ عَضُدٌ وَلَيْسَتْ لَهُ ذِرَاعٌ، عَلَى عَضُدِهِ مِثْلُ حَلَمَةِ الثَّدْىِ عَلَيْهِ شَعَرَاتٌ بِيضٌ ‏\"‏ ‏.‏ أَفَتَذْهَبُونَ إِلَى مُعَاوِيَةَ وَأَهْلِ الشَّامِ وَتَتْرُكُونَ هَؤُلاَءِ يَخْلُفُونَكُمْ فِي ذَرَارِيِّكُمْ وَأَمْوَالِكُمْ وَاللَّهِ إِنِّي لأَرْجُو أَنْ يَكُونُوا هَؤُلاَءِ الْقَوْمَ، فَإِنَّهُمْ قَدْ سَفَكُوا الدَّمَ الْحَرَامَ، وَأَغَارُوا فِي سَرْحِ النَّاسِ فَسِيرُوا عَلَى اسْمِ اللَّهِ ‏.‏ قَالَ ‏:‏ سَلَمَةُ بْنُ كُهَيْلٍ ‏:‏ فَنَزَّلَنِي زَيْدُ بْنُ وَهْبٍ مَنْزِلاً مَنْزِلاً حَتَّى مَرَّ بِنَا عَلَى قَنْطَرَةٍ قَالَ فَلَمَّا الْتَقَيْنَا وَعَلَى الْخَوَارِجِ عَبْدُ اللَّهِ بْنُ وَهْبٍ الرَّاسِبِيُّ فَقَالَ لَهُمْ ‏:‏ أَلْقُوا الرِّمَاحَ وَسُلُّوا السُّيُوفَ مِنْ جُفُونِهَا، فَإِنِّي أَخَافُ أَنْ يُنَاشِدُوكُمْ كَمَا نَاشَدُوكُمْ يَوْمَ حَرُورَاءَ قَالَ ‏:‏ فَوَحَّشُوا بِرِمَاحِهِمْ وَاسْتَلُّوا السُّيُوفَ وَشَجَرَهُمُ النَّاسُ بِرِمَاحِهِمْ - قَالَ - وَقَتَلُوا بَعْضَهُمْ عَلَى بَعْضِهِمْ ‏.‏ قَالَ ‏:‏ وَمَا أُصِيبَ مِنَ النَّاسِ يَوْمَئِذٍ إِلاَّ رَجُلاَنِ فَقَالَ عَلِيٌّ عَلَيْهِ السَّلاَمُ ‏:‏ الْتَمِسُوا فِيهِمُ الْمُخْدَجَ فَلَمْ يَجِدُوا قَالَ ‏:‏ فَقَامَ عَلِيٌّ رضى الله عنه بِنَفْسِهِ حَتَّى أَتَى نَاسًا قَدْ قُتِلَ بَعْضُهُمْ عَلَى بَعْضٍ فَقَالَ ‏:‏ أَخْرِجُوهُمْ فَوَجَدُوهُ مِمَّا يَلِي الأَرْضَ فَكَبَّرَ وَقَالَ ‏:‏ صَدَقَ اللَّهُ وَبَلَّغَ رَسُولُهُ ‏.‏ فَقَامَ إِلَيْهِ عَبِيدَةُ السَّلْمَانِيُّ فَقَالَ ‏:‏ يَا أَمِيرَ الْمُؤْمِنِينَ وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ لَقَدْ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏:‏ إِي وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ حَتَّى اسْتَحْلَفَهُ ثَلاَثًا وَهُوَ يَحْلِفُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4769,
			"arabicnumber": 4769,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ جَمِيلِ بْنِ مُرَّةَ، قَالَ حَدَّثَنَا أَبُو الْوَضِيءِ، قَالَ قَالَ عَلِيٌّ عَلَيْهِ السَّلاَمُ ‏:‏ اطْلُبُوا الْمُخْدَجَ ‏.‏ فَذَكَرَ الْحَدِيثَ فَاسْتَخْرَجُوهُ مِنْ تَحْتِ الْقَتْلَى فِي طِينٍ، قَالَ أَبُو الْوَضِيءِ ‏:‏ فَكَأَنِّي أَنْظُرُ إِلَيْهِ حَبَشِيٌّ عَلَيْهِ قُرَيْطَقٌ لَهُ إِحْدَى يَدَيْنِ مِثْلُ ثَدْىِ الْمَرْأَةِ عَلَيْهَا شُعَيْرَاتٌ مِثْلُ شُعَيْرَاتِ الَّتِي تَكُونُ عَلَى ذَنَبِ الْيَرْبُوعِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4770,
			"arabicnumber": 4770,
			"text": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، عَنْ نُعَيْمِ بْنِ حَكِيمٍ، عَنْ أَبِي مَرْيَمَ، قَالَ ‏:‏ إِنْ كَانَ ذَلِكَ الْمُخْدَجَ لَمَعَنَا يَوْمَئِذٍ فِي الْمَسْجِدِ نُجَالِسُهُ بِاللَّيْلِ وَالنَّهَارِ، وَكَانَ فَقِيرًا وَرَأَيْتُهُ مَعَ الْمَسَاكِينِ يَشْهَدُ طَعَامَ عَلِيٍّ عَلَيْهِ السَّلاَمُ مَعَ النَّاسِ وَقَدْ كَسَوْتُهُ بُرْنُسًا لِي ‏.‏ قَالَ أَبُو مَرْيَمَ ‏:‏ وَكَانَ الْمُخْدَجُ يُسَمَّى نَافِعًا ذَا الثُّدَيَّةِ، وَكَانَ فِي يَدِهِ مِثْلُ ثَدْىِ الْمَرْأَةِ عَلَى رَأْسِهِ حَلَمَةٌ مِثْلُ حَلَمَةِ الثَّدْىِ عَلَيْهِ شُعَيْرَاتٌ مِثْلُ سِبَالَةِ السِّنَّوْرِ ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ وَهُوَ عِنْدَ النَّاسِ اسْمُهُ حَرْقُوسُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4771,
			"arabicnumber": 4771,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ حَسَنٍ، قَالَ حَدَّثَنِي عَمِّي، إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ مَنْ أُرِيدَ مَالُهُ بِغَيْرِ حَقٍّ فَقَاتَلَ فَقُتِلَ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4772,
			"arabicnumber": 4772,
			"text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، وَسُلَيْمَانُ بْنُ دَاوُدَ، - يَعْنِي أَبَا أَيُّوبَ الْهَاشِمِيَّ - عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنْ أَبِيهِ، عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ، وَمَنْ قُتِلَ دُونَ أَهْلِهِ أَوْ دُونَ دَمِهِ أَوْ دُونَ دِينِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 177
			}
		}
	]
}