{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، حَدَّثَنِي النُّعْمَانُ بْنُ سَالِمٍ، عَنْ عَمْرِو بْنِ أَوْسٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَىْ عَشْرَةَ رَكْعَةً تَطَوُّعًا بُنِيَ لَهُ بِهِنَّ بَيْتٌ فِي الْجَنَّةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا خَالِدٌ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، - الْمَعْنَى - عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ التَّطَوُّعِ فَقَالَتْ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا فِي بَيْتِي ثُمَّ يَخْرُجُ فَيُصَلِّي بِالنَّاسِ ثُمَّ يَرْجِعُ إِلَى بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ وَكَانَ يُصَلِّي بِالنَّاسِ الْمَغْرِبَ ثُمَّ يَرْجِعُ إِلَى بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ وَكَانَ يُصَلِّي بِهِمُ الْعِشَاءَ ثُمَّ يَدْخُلُ بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ وَكَانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ فِيهِنَّ الْوِتْرُ وَكَانَ يُصَلِّي لَيْلاً طَوِيلاً قَائِمًا وَلَيْلاً طَوِيلاً جَالِسًا فَإِذَا قَرَأَ وَهُوَ قَائِمٌ رَكَعَ وَسَجَدَ وَهُوَ قَائِمٌ وَإِذَا قَرَأَ وَهُوَ قَاعِدٌ رَكَعَ وَسَجَدَ وَهُوَ قَاعِدٌ وَكَانَ إِذَا طَلَعَ الْفَجْرُ صَلَّى رَكْعَتَيْنِ ثُمَّ يَخْرُجُ فَيُصَلِّي بِالنَّاسِ صَلاَةَ الْفَجْرِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ - وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ - فِي بَيْتِهِ وَبَعْدَ صَلاَةِ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لاَ يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّي رَكْعَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَدَعُ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ صَلاَةِ الْغَدَاةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي عَطَاءٌ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَكُنْ عَلَى شَىْءٍ مِنَ النَّوَافِلِ أَشَدَّ مُعَاهَدَةً مِنْهُ عَلَى الرَّكْعَتَيْنِ قَبْلَ الصُّبْحِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُخَفِّفُ الرَّكْعَتَيْنِ قَبْلَ صَلاَةِ الْفَجْرِ حَتَّى إِنِّي لأَقُولُ هَلْ قَرَأَ فِيهِمَا بِأُمِّ الْقُرْآنِ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَرَأَ فِي رَكْعَتَىِ الْفَجْرِ ‏{‏ قُلْ يَا أَيُّهَا الْكَافِرُونَ ‏}‏ وَ ‏{‏ قُلْ هُوَ اللَّهُ أَحَدٌ ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ، حَدَّثَنِي أَبُو زِيَادَةَ، عُبَيْدُ اللَّهِ بْنُ زِيَادٍ الْكِنْدِيُّ عَنْ بِلاَلٍ، أَنَّهُ حَدَّثَهُ أَنَّهُ، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم لِيُؤْذِنَهُ بِصَلاَةِ الْغَدَاةِ فَشَغَلَتْ عَائِشَةُ - رضى الله عنها - بِلاَلاً بِأَمْرٍ سَأَلَتْهُ عَنْهُ حَتَّى فَضَحَهُ الصُّبْحُ فَأَصْبَحَ جِدًّا قَالَ فَقَامَ بِلاَلٌ فَآذَنَهُ بِالصَّلاَةِ وَتَابَعَ أَذَانَهُ فَلَمْ يَخْرُجْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا خَرَجَ صَلَّى بِالنَّاسِ وَأَخْبَرَهُ أَنَّ عَائِشَةَ شَغَلَتْهُ بِأَمْرٍ سَأَلَتْهُ عَنْهُ حَتَّى أَصْبَحَ جِدًّا وَأَنَّهُ أَبْطَأَ عَلَيْهِ بِالْخُرُوجِ فَقَالَ ‏\"‏ إِنِّي كُنْتُ رَكَعْتُ رَكْعَتَىِ الْفَجْرِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّكَ أَصْبَحْتَ جِدًّا ‏.‏ قَالَ ‏\"‏ لَوْ أَصْبَحْتُ أَكْثَرَ مِمَّا أَصْبَحْتُ لَرَكَعْتُهُمَا وَأَحْسَنْتُهُمَا وَأَجْمَلْتُهُمَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ إِسْحَاقَ الْمَدَنِيَّ - عَنِ ابْنِ زَيْدٍ، عَنِ ابْنِ سِيْلاَنَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَدَعُوهُمَا وَإِنْ طَرَدَتْكُمُ الْخَيْلُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، أَخْبَرَنِي سَعِيدُ بْنُ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ كَثِيرًا، مِمَّا كَانَ يَقْرَأُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَكْعَتَىِ الْفَجْرِ بِـ ‏{‏ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا ‏}‏ هَذِهِ الآيَةَ قَالَ هَذِهِ فِي الرَّكْعَةِ الأُولَى وَفِي الرَّكْعَةِ الآخِرَةِ بِـ ‏{‏ آمَنَّا بِاللَّهِ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنِ مُحَمَّدٍ، عَنْ عُثْمَانَ بْنِ عُمَرَ، - يَعْنِي ابْنَ مُوسَى - عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ فِي رَكْعَتَىِ الْفَجْرِ ‏{‏ قُلْ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ عَلَيْنَا ‏}‏ فِي الرَّكْعَةِ الأُولَى وَفِي الرَّكْعَةِ الأُخْرَى بِهَذِهِ الآيَةِ ‏{‏ رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ ‏}‏ أَوْ ‏{‏ إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا وَلاَ تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ ‏}‏ شَكَّ الدَّرَاوَرْدِيُّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "حَدَّثَنَا مُسَدَّدٌ، وَأَبُو كَامِلٍ وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ قَالُوا حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا صَلَّى أَحَدُكُمُ الرَّكْعَتَيْنِ قَبْلَ الصُّبْحِ فَلْيَضْطَجِعْ عَلَى يَمِينِهِ ‏\"‏ ‏.‏ فَقَالَ لَهُ مَرْوَانُ بْنُ الْحَكَمِ أَمَا يُجْزِئُ أَحَدَنَا مَمْشَاهُ إِلَى الْمَسْجِدِ حَتَّى يَضْطَجِعَ عَلَى يَمِينِهِ قَالَ عُبَيْدُ اللَّهِ فِي حَدِيثِهِ قَالَ لاَ ‏.‏ قَالَ فَبَلَغَ ذَلِكَ ابْنَ عُمَرَ فَقَالَ أَكْثَرَ أَبُو هُرَيْرَةَ عَلَى نَفْسِهِ ‏.‏ قَالَ فَقِيلَ لاِبْنِ عُمَرَ هَلْ تُنْكِرُ شَيْئًا مِمَّا يَقُولُ قَالَ لاَ وَلَكِنَّهُ اجْتَرَأَ وَجَبُنَّا ‏.‏ قَالَ فَبَلَغَ ذَلِكَ أَبَا هُرَيْرَةَ قَالَ فَمَا ذَنْبِي إِنْ كُنْتُ حَفِظْتُ وَنَسُوا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَضَى صَلاَتَهُ مِنْ آخِرِ اللَّيْلِ نَظَرَ فَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي وَإِنْ كُنْتُ نَائِمَةً أَيْقَظَنِي وَصَلَّى الرَّكْعَتَيْنِ ثُمَّ اضْطَجَعَ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ فَيُؤْذِنَهُ بِصَلاَةِ الصُّبْحِ فَيُصَلِّي رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ يَخْرُجُ إِلَى الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَمَّنْ حَدَّثَهُ - ابْنِ أَبِي عَتَّابٍ، أَوْ غَيْرِهِ - عَنْ أَبِي سَلَمَةَ، قَالَ قَالَتْ عَائِشَةُ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا صَلَّى رَكْعَتَىِ الْفَجْرِ فَإِنْ كُنْتُ نَائِمَةً اضْطَجَعَ وَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ، وَزِيَادُ بْنُ يَحْيَى، قَالاَ حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ، عَنْ أَبِي مَكِينٍ، حَدَّثَنَا أَبُو الْفَضْلِ، - رَجُلٌ مِنَ الأَنْصَارِ - عَنْ مُسْلِمِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ خَرَجْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم لِصَلاَةِ الصُّبْحِ فَكَانَ لاَ يَمُرُّ بِرَجُلٍ إِلاَّ نَادَاهُ بِالصَّلاَةِ أَوْ حَرَّكَهُ بِرِجْلِهِ ‏.‏ قَالَ زِيَادٌ قَالَ حَدَّثَنَا أَبُو الْفُضَيْلِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، قَالَ جَاءَ رَجُلٌ وَالنَّبِيُّ صلى الله عليه وسلم يُصَلِّي الصُّبْحَ فَصَلَّى الرَّكْعَتَيْنِ ثُمَّ دَخَلَ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي الصَّلاَةِ فَلَمَّا انْصَرَفَ قَالَ ‏ \"‏ يَا فُلاَنُ أَيَّتُهُمَا صَلاَتُكَ الَّتِي صَلَّيْتَ وَحْدَكَ أَوِ الَّتِي صَلَّيْتَ مَعَنَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ وَرْقَاءَ، ح وَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا زَكَرِيَّا بْنُ إِسْحَاقَ، كُلُّهُمْ عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ صَلاَةَ إِلاَّ الْمَكْتُوبَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ سَعْدِ بْنِ سَعِيدٍ، حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، عَنْ قَيْسِ بْنِ عَمْرٍو، قَالَ رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً يُصَلِّي بَعْدَ صَلاَةِ الصُّبْحِ رَكْعَتَيْنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ صَلاَةُ الصُّبْحِ رَكْعَتَانِ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ إِنِّي لَمْ أَكُنْ صَلَّيْتُ الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَهُمَا فَصَلَّيْتُهُمَا الآنَ ‏.‏ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى الْبَلْخِيُّ، قَالَ قَالَ سُفْيَانُ كَانَ عَطَاءُ بْنُ أَبِي رَبَاحٍ يُحَدِّثُ بِهَذَا الْحَدِيثِ عَنْ سَعْدِ بْنِ سَعِيدٍ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَى عَبْدُ رَبِّهِ وَيَحْيَى ابْنَا سَعِيدٍ هَذَا الْحَدِيثَ مُرْسَلاً أَنَّ جَدَّهُمْ زَيْدًا صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم بِهَذِهِ الْقِصَّةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ، حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، عَنِ النُّعْمَانِ، عَنْ مَكْحُولٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، قَالَ قَالَتْ أُمُّ حَبِيبَةَ زَوْجُ النَّبِيِّ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ حَافَظَ عَلَى أَرْبَعِ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعٍ بَعْدَهَا حَرُمَ عَلَى النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ الْعَلاَءُ بْنُ الْحَارِثِ وَسُلَيْمَانُ بْنُ مُوسَى عَنْ مَكْحُولٍ بِإِسْنَادِهِ مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ عُبَيْدَةَ، يُحَدِّثُ عَنْ إِبْرَاهِيمَ، عَنِ ابْنِ مِنْجَابٍ، عَنْ قَرْثَعٍ، عَنْ أَبِي أَيُّوبَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَرْبَعٌ قَبْلَ الظُّهْرِ لَيْسَ فِيهِنَّ تَسْلِيمٌ تُفْتَحُ لَهُنَّ أَبْوَابُ السَّمَاءِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ بَلَغَنِي عَنْ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ قَالَ لَوْ حَدَّثْتُ عَنْ عُبَيْدَةَ بِشَىْءٍ لَحَدَّثْتُ عَنْهُ بِهَذَا الْحَدِيثِ ‏.‏ قَالَ أَبُو دَاوُدَ عُبَيْدَةُ ضَعِيفٌ ‏.‏ قَالَ أَبُو دَاوُدَ ابْنُ مِنْجَابٍ هُوَ سَهْمٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الْقُرَشِيُّ، حَدَّثَنِي جَدِّي أَبُو الْمُثَنَّى، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ رَحِمَ اللَّهُ امْرَأً صَلَّى قَبْلَ الْعَصْرِ أَرْبَعًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، عَلَيْهِ السَّلاَمُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي قَبْلَ الْعَصْرِ رَكْعَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَرْسَلُوهُ إِلَى عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالُوا اقْرَأْ عَلَيْهَا السَّلاَمَ مِنَّا جَمِيعًا وَسَلْهَا عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ وَقُلْ إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا وَقَدْ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهُمَا ‏.‏ فَدَخَلْتُ عَلَيْهَا فَبَلَّغْتُهَا مَا أَرْسَلُونِي بِهِ فَقَالَتْ سَلْ أُمَّ سَلَمَةَ ‏.‏ فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي بِهِ إِلَى عَائِشَةَ فَقَالَتْ أُمُّ سَلَمَةَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْهُمَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا أَمَّا حِينَ صَلاَّهُمَا فَإِنَّهُ صَلَّى الْعَصْرَ ثُمَّ دَخَلَ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنَ الأَنْصَارِ فَصَلاَّهُمَا فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ فَقُلْتُ قُومِي بِجَنْبِهِ فَقُولِي لَهُ تَقُولُ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ أَسْمَعُكَ تَنْهَى عَنْ هَاتَيْنِ الرَّكْعَتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ ‏.‏ قَالَتْ فَفَعَلَتِ الْجَارِيَةُ فَأَشَارَ بِيَدِهِ فَاسْتَأْخَرَتْ عَنْهُ فَلَمَّا انْصَرَفَ قَالَ ‏ \"‏ يَا بِنْتَ أَبِي أُمَيَّةَ سَأَلْتِ عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ إِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ بِالإِسْلاَمِ مِنْ قَوْمِهِمْ فَشَغَلُونِي عَنِ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ وَهْبِ بْنِ الأَجْدَعِ، عَنْ عَلِيٍّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الصَّلاَةِ بَعْدَ الْعَصْرِ إِلاَّ وَالشَّمْسُ مُرْتَفِعَةٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِي إِثْرِ كُلِّ صَلاَةٍ مَكْتُوبَةٍ رَكْعَتَيْنِ إِلاَّ الْفَجْرَ وَالْعَصْرَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبَانُ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ شَهِدَ عِنْدِي رِجَالٌ مَرْضِيُّونَ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ وَأَرْضَاهُمْ عِنْدِي عُمَرُ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ صَلاَةَ بَعْدَ صَلاَةِ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ وَلاَ صَلاَةَ بَعْدَ صَلاَةِ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ، عَنِ الْعَبَّاسِ بْنِ سَالِمٍ، عَنْ أَبِي سَلاَّمٍ، عَنْ أَبِي أُمَامَةَ، عَنْ عَمْرِو بْنِ عَبَسَةَ السُّلَمِيِّ، أَنَّهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ اللَّيْلِ أَسْمَعُ قَالَ ‏ \"‏ جَوْفُ اللَّيْلِ الآخِرُ فَصَلِّ مَا شِئْتَ فَإِنَّ الصَّلاَةَ مَشْهُودَةٌ مَكْتُوبَةٌ حَتَّى تُصَلِّيَ الصُّبْحَ ثُمَّ أَقْصِرْ حَتَّى تَطْلُعَ الشَّمْسُ فَتَرْتَفِعَ قِيْسَ رُمْحٍ أَوْ رُمْحَيْنِ فَإِنَّهَا تَطْلُعُ بَيْنَ قَرْنَىْ شَيْطَانٍ وَتُصَلِّي لَهَا الْكُفَّارُ ثُمَّ صَلِّ مَا شِئْتَ فَإِنَّ الصَّلاَةَ مَشْهُودَةٌ مَكْتُوبَةٌ حَتَّى يَعْدِلَ الرُّمْحُ ظِلَّهُ ثُمَّ أَقْصِرْ فَإِنَّ جَهَنَّمَ تُسْجَرُ وَتُفْتَحُ أَبْوَابُهَا فَإِذَا زَاغَتِ الشَّمْسُ فَصَلِّ مَا شِئْتَ فَإِنَّ الصَّلاَةَ مَشْهُودَةٌ حَتَّى تُصَلِّيَ الْعَصْرَ ثُمَّ أَقْصِرْ حَتَّى تَغْرُبَ الشَّمْسُ فَإِنَّهَا تَغْرُبُ بَيْنَ قَرْنَىْ شَيْطَانٍ وَيُصَلِّي لَهَا الْكُفَّارُ ‏\"‏ ‏.‏ وَقَصَّ حَدِيثًا طَوِيلاً قَالَ الْعَبَّاسُ هَكَذَا حَدَّثَنِي أَبُو سَلاَّمٍ عَنْ أَبِي أُمَامَةَ إِلاَّ أَنْ أُخْطِئَ شَيْئًا لاَ أُرِيدُهُ فَأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا قُدَامَةُ بْنُ مُوسَى، عَنْ أَيُّوبَ بْنِ حُصَيْنٍ، عَنْ أَبِي عَلْقَمَةَ، عَنْ يَسَارٍ، مَوْلَى ابْنِ عُمَرَ قَالَ رَآنِي ابْنُ عُمَرَ وَأَنَا أُصَلِّي، بَعْدَ طُلُوعِ الْفَجْرِ فَقَالَ يَا يَسَارُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ عَلَيْنَا وَنَحْنُ نُصَلِّي هَذِهِ الصَّلاَةَ فَقَالَ ‏ \"‏ لِيُبَلِّغْ شَاهِدُكُمْ غَائِبَكُمْ لاَ تُصَلُّوا بَعْدَ الْفَجْرِ إِلاَّ سَجْدَتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، وَمَسْرُوقٍ، قَالاَ نَشْهَدُ عَلَى عَائِشَةَ - رضى الله عنها - أَنَّهَا قَالَتْ مَا مِنْ يَوْمٍ يَأْتِي عَلَى النَّبِيِّ صلى الله عليه وسلم إِلاَّ صَلَّى بَعْدَ الْعَصْرِ رَكْعَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، حَدَّثَنَا عَمِّي، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ ذَكْوَانَ، مَوْلَى عَائِشَةَ أَنَّهَا حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي بَعْدَ الْعَصْرِ وَيَنْهَى عَنْهَا وَيُوَاصِلُ وَيَنْهَى عَنِ الْوِصَالِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": 1281,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنِ الْحُسَيْنِ الْمُعَلِّمِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عَبْدِ اللَّهِ الْمُزَنِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ لِمَنْ شَاءَ ‏\"‏ ‏.‏ خَشْيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ الْبَزَّازُ، أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مَنْصُورُ بْنُ أَبِي الأَسْوَدِ، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ صَلَّيْتُ الرَّكْعَتَيْنِ قَبْلَ الْمَغْرِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ قُلْتُ لأَنَسٍ أَرَآكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ رَآنَا فَلَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنِ الْجُرَيْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَ كُلِّ أَذَانَيْنِ صَلاَةٌ بَيْنَ كُلِّ أَذَانَيْنِ صَلاَةٌ لِمَنْ شَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "حَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي شُعَيْبٍ، عَنْ طَاوُسٍ، قَالَ سُئِلَ ابْنُ عُمَرَ عَنِ الرَّكْعَتَيْنِ، قَبْلَ الْمَغْرِبِ فَقَالَ مَا رَأَيْتُ أَحَدًا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يُصَلِّيهِمَا ‏.‏ وَرَخَّصَ فِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ ‏.‏ قَالَ أَبُو دَاوُدَ سَمِعْتُ يَحْيَى بْنَ مَعِينٍ يَقُولُ هُوَ شُعَيْبٌ يَعْنِي وَهِمَ شُعْبَةُ فِي اسْمِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، عَنْ عَبَّادِ بْنِ عَبَّادٍ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، - الْمَعْنَى - عَنْ وَاصِلٍ، عَنْ يَحْيَى بْنِ عُقَيْلٍ، عَنْ يَحْيَى بْنِ يَعْمُرَ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يُصْبِحُ عَلَى كُلِّ سُلاَمَى مِنِ ابْنِ آدَمَ صَدَقَةٌ تَسْلِيمُهُ عَلَى مَنْ لَقِيَ صَدَقَةٌ وَأَمْرُهُ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيُهُ عَنِ الْمُنْكَرِ صَدَقَةٌ وَإِمَاطَتُهُ الأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ وَبُضْعَةُ أَهْلِهِ صَدَقَةٌ وَيُجْزِئُ مِنْ ذَلِكَ كُلِّهِ رَكْعَتَانِ مِنَ الضُّحَى ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَحَدِيثُ عَبَّادٍ أَتَمُّ وَلَمْ يَذْكُرْ مُسَدَّدٌ الأَمْرَ وَالنَّهْىَ زَادَ فِي حَدِيثِهِ وَقَالَ كَذَا وَكَذَا وَزَادَ ابْنُ مَنِيعٍ فِي حَدِيثِهِ قَالُوا يَا رَسُولَ اللَّهِ أَحَدُنَا يَقْضِي شَهْوَتَهُ وَتَكُونُ لَهُ صَدَقَةٌ قَالَ ‏\"‏ أَرَأَيْتَ لَوْ وَضَعَهَا فِي غَيْرِ حِلِّهَا أَلَمْ يَكُنْ يَأْثَمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": 1286,
			"text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، أَخْبَرَنَا خَالِدٌ، عَنْ وَاصِلٍ، عَنْ يَحْيَى بْنِ عُقَيْلٍ، عَنْ يَحْيَى بْنِ يَعْمُرَ، عَنْ أَبِي الأَسْوَدِ الدُّؤَلِيِّ، قَالَ بَيْنَمَا نَحْنُ عِنْدَ أَبِي ذَرٍّ قَالَ ‏\"‏ يُصْبِحُ عَلَى كُلِّ سُلاَمَى مِنْ أَحَدِكُمْ فِي كُلِّ يَوْمٍ صَدَقَةٌ فَلَهُ بِكُلِّ صَلاَةٍ صَدَقَةٌ وَصِيَامٍ صَدَقَةٌ وَحَجٍّ صَدَقَةٌ وَتَسْبِيحٍ صَدَقَةٌ وَتَكْبِيرٍ صَدَقَةٌ وَتَحْمِيدٍ صَدَقَةٌ ‏\"‏ ‏.‏ فَعَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ هَذِهِ الأَعْمَالِ الصَّالِحَةِ ثُمَّ قَالَ ‏\"‏ يُجْزِئُ أَحَدَكُمْ مِنْ ذَلِكَ رَكْعَتَا الضُّحَى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": 1287,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يَحْيَى بْنِ أَيُّوبَ، عَنْ زَبَّانَ بْنِ فَائِدٍ، عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَعَدَ فِي مُصَلاَّهُ حِينَ يَنْصَرِفُ مِنْ صَلاَةِ الصُّبْحِ حَتَّى يُسَبِّحَ رَكْعَتَىِ الضُّحَى لاَ يَقُولُ إِلاَّ خَيْرًا غُفِرَ لَهُ خَطَايَاهُ وَإِنْ كَانَتْ أَكْثَرَ مِنْ زَبَدِ الْبَحْرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ، حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، عَنْ يَحْيَى بْنِ الْحَارِثِ، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي أُمَامَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلاَةٌ فِي أَثَرِ صَلاَةٍ لاَ لَغْوَ بَيْنَهُمَا كِتَابٌ فِي عِلِّيِّينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ، عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ، عَنْ مَكْحُولٍ، عَنْ كَثِيرِ بْنِ مُرَّةَ أَبِي شَجَرَةَ، عَنْ نُعَيْمِ بْنِ هَمَّارٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَقُولُ اللَّهُ عَزَّ وَجَلَّ يَا ابْنَ آدَمَ لاَ تُعْجِزْنِي مِنْ أَرْبَعِ رَكَعَاتٍ فِي أَوَّلِ نَهَارِكَ أَكْفِكَ آخِرَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عِيَاضُ بْنُ عَبْدِ اللَّهِ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ الْفَتْحِ صَلَّى سُبْحَةَ الضُّحَى ثَمَانِيَ رَكَعَاتٍ يُسَلِّمُ مِنْ كُلِّ رَكْعَتَيْنِ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ أَحْمَدُ بْنُ صَالِحٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ الْفَتْحِ صَلَّى سُبْحَةَ الضُّحَى فَذَكَرَ مِثْلَهُ ‏.‏ قَالَ ابْنُ السَّرْحِ إِنَّ أُمَّ هَانِئٍ قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ يَذْكُرْ سُبْحَةَ الضُّحَى بِمَعْنَاهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ مَا أَخْبَرَنَا أَحَدٌ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم صَلَّى الضُّحَى غَيْرَ أُمِّ هَانِئٍ فَإِنَّهَا ذَكَرَتْ أَنَّ النَّبِيَّ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ اغْتَسَلَ فِي بَيْتِهَا وَصَلَّى ثَمَانِيَ رَكَعَاتٍ فَلَمْ يَرَهُ أَحَدٌ صَلاَّهُنَّ بَعْدُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ سَأَلْتُ عَائِشَةَ هَلْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الضُّحَى فَقَالَتْ لاَ إِلاَّ أَنْ يَجِيءَ مِنْ مَغِيبِهِ ‏.‏ قُلْتُ هَلْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرِنُ بَيْنَ السُّورَتَيْنِ قَالَتْ مِنَ الْمُفَصَّلِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا سَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم سُبْحَةَ الضُّحَى قَطُّ وَإِنِّي لأُسَبِّحُهَا وَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيَدَعُ الْعَمَلَ وَهُوَ يُحِبُّ أَنْ يَعْمَلَ بِهِ خَشْيَةَ أَنْ يَعْمَلَ بِهِ النَّاسُ فَيُفْرَضَ عَلَيْهِمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "حَدَّثَنَا ابْنُ نُفَيْلٍ، وَأَحْمَدُ بْنُ يُونُسَ، قَالاَ حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سِمَاكٌ، قَالَ قُلْتُ لِجَابِرِ بْنِ سَمُرَةَ أَكُنْتَ تُجَالِسُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ كَثِيرًا فَكَانَ لاَ يَقُومُ مِنْ مُصَلاَّهُ الَّذِي صَلَّى فِيهِ الْغَدَاةَ حَتَّى تَطْلُعَ الشَّمْسُ فَإِذَا طَلَعَتْ قَامَ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ الْبَارِقِيِّ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلاَةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنِي عَبْدُ رَبِّهِ بْنُ سَعِيدٍ، عَنْ أَنَسِ بْنِ أَبِي أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنِ الْمُطَّلِبِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الصَّلاَةُ مَثْنَى مَثْنَى أَنْ تَشَهَّدَ فِي كُلِّ رَكْعَتَيْنِ وَأَنْ تَبَاءَسَ وَتَمَسْكَنَ وَتُقْنِعَ بِيَدَيْكَ وَتَقُولَ اللَّهُمَّ اللَّهُمَّ فَمَنْ لَمْ يَفْعَلْ ذَلِكَ فَهِيَ خِدَاجٌ ‏\"‏ ‏.‏ سُئِلَ أَبُو دَاوُدَ عَنْ صَلاَةِ اللَّيْلِ مَثْنَى قَالَ إِنْ شِئْتَ مَثْنَى وَإِنْ شِئْتَ أَرْبَعًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ النَّيْسَابُورِيُّ، حَدَّثَنَا مُوسَى بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِلْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ ‏ \"‏ يَا عَبَّاسُ يَا عَمَّاهُ أَلاَ أُعْطِيكَ أَلاَ أَمْنَحُكَ أَلاَ أَحْبُوكَ أَلاَ أَفْعَلُ بِكَ عَشْرَ خِصَالٍ إِذَا أَنْتَ فَعَلْتَ ذَلِكَ غَفَرَ اللَّهُ لَكَ ذَنْبَكَ أَوَّلَهُ وَآخِرَهُ قَدِيمَهُ وَحَدِيثَهُ خَطَأَهُ وَعَمْدَهُ صَغِيرَهُ وَكَبِيرَهُ سِرَّهُ وَعَلاَنِيَتَهُ عَشْرَ خِصَالٍ أَنْ تُصَلِّيَ أَرْبَعَ رَكَعَاتٍ تَقْرَأُ فِي كُلِّ رَكْعَةٍ فَاتِحَةَ الْكِتَابِ وَسُورَةً فَإِذَا فَرَغْتَ مِنَ الْقِرَاءَةِ فِي أَوَّلِ رَكْعَةٍ وَأَنْتَ قَائِمٌ قُلْتَ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ خَمْسَ عَشْرَةَ مَرَّةً ثُمَّ تَرْكَعُ فَتَقُولُهَا وَأَنْتَ رَاكِعٌ عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ مِنَ الرُّكُوعِ فَتَقُولُهَا عَشْرًا ثُمَّ تَهْوِي سَاجِدًا فَتَقُولُهَا وَأَنْتَ سَاجِدٌ عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ مِنَ السُّجُودِ فَتَقُولُهَا عَشْرًا ثُمَّ تَسْجُدُ فَتَقُولُهَا عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ فَتَقُولُهَا عَشْرًا فَذَلِكَ خَمْسٌ وَسَبْعُونَ فِي كُلِّ رَكْعَةٍ تَفْعَلُ ذَلِكَ فِي أَرْبَعِ رَكَعَاتٍ إِنِ اسْتَطَعْتَ أَنْ تُصَلِّيَهَا فِي كُلِّ يَوْمٍ مَرَّةً فَافْعَلْ فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ جُمُعَةٍ مَرَّةً فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ شَهْرٍ مَرَّةً فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ سَنَةٍ مَرَّةً فَإِنْ لَمْ تَفْعَلْ فَفِي عُمُرِكَ مَرَّةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُفْيَانَ الأُبُلِّيُّ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ أَبُو حَبِيبٍ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا عَمْرُو بْنُ مَالِكٍ، عَنْ أَبِي الْجَوْزَاءِ، قَالَ حَدَّثَنِي رَجُلٌ، كَانَتْ لَهُ صُحْبَةٌ يُرَوْنَ أَنَّهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ائْتِنِي غَدًا أَحْبُوكَ وَأُثِيبُكَ وَأُعْطِيكَ ‏\"‏ ‏.‏ حَتَّى ظَنَنْتُ أَنَّهُ يُعْطِينِي عَطِيَّةً قَالَ ‏\"‏ إِذَا زَالَ النَّهَارُ فَقُمْ فَصَلِّ أَرْبَعَ رَكَعَاتٍ ‏\"‏ ‏.‏ فَذَكَرَ نَحْوَهُ قَالَ ‏\"‏ تَرْفَعُ رَأْسَكَ - يَعْنِي مِنَ السَّجْدَةِ الثَّانِيَةِ - فَاسْتَوِ جَالِسًا وَلاَ تَقُمْ حَتَّى تُسَبِّحَ عَشْرًا وَتَحْمَدَ عَشْرًا وَتُكَبِّرَ عَشْرًا وَتُهَلِّلَ عَشْرًا ثُمَّ تَصْنَعُ ذَلِكَ فِي الأَرْبَعِ رَكَعَاتٍ ‏\"‏ ‏.‏ قَالَ ‏\"‏ فَإِنَّكَ لَوْ كُنْتَ أَعْظَمَ أَهْلِ الأَرْضِ ذَنْبًا غُفِرَ لَكَ بِذَلِكَ ‏\"‏ ‏.‏ قُلْتُ فَإِنْ لَمْ أَسْتَطِعْ أَنْ أُصَلِّيَهَا تِلْكَ السَّاعَةَ قَالَ ‏\"‏ صَلِّهَا مِنَ اللَّيْلِ وَالنَّهَارِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ حَبَّانُ بْنُ هِلاَلٍ خَالُ هِلاَلٍ الرَّائِيِّ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ الْمُسْتَمِرُّ بْنُ الرَّيَّانِ عَنْ أَبِي الْجَوْزَاءِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو مَوْقُوفًا وَرَوَاهُ رَوْحُ بْنُ الْمُسَيَّبِ وَجَعْفَرُ بْنُ سُلَيْمَانَ عَنْ عَمْرِو بْنِ مَالِكٍ النُّكْرِيِّ عَنْ أَبِي الْجَوْزَاءِ عَنِ ابْنِ عَبَّاسٍ قَوْلُهُ وَقَالَ فِي حَدِيثِ رَوْحٍ فَقَالَ حَدِيثُ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ، عَنْ عُرْوَةَ بْنِ، رُوَيْمٍ حَدَّثَنِي الأَنْصَارِيُّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِجَعْفَرٍ بِهَذَا الْحَدِيثِ فَذَكَرَ نَحْوَهُمْ قَالَ فِي السَّجْدَةِ الثَّانِيَةِ مِنَ الرَّكْعَةِ الأُولَى كَمَا قَالَ فِي حَدِيثِ مَهْدِيِّ بْنِ مَيْمُونٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنِي أَبُو مُطَرِّفٍ، مُحَمَّدُ بْنُ أَبِي الْوَزِيرِ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْفِطْرِيُّ، عَنْ سَعْدِ بْنِ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَتَى مَسْجِدَ بَنِي عَبْدِ الأَشْهَلِ فَصَلَّى فِيهِ الْمَغْرِبَ فَلَمَّا قَضَوْا صَلاَتَهُمْ رَآهُمْ يُسَبِّحُونَ بَعْدَهَا فَقَالَ ‏ \"‏ هَذِهِ صَلاَةُ الْبُيُوتِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "حَدَّثَنَا حُسَيْنُ بْنُ عَبْدِ الرَّحْمَنِ الْجَرْجَرَائِيُّ، حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ اللَّهِ، عَنْ جَعْفَرِ بْنِ أَبِي الْمُغِيرَةِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُطِيلُ الْقِرَاءَةَ فِي الرَّكْعَتَيْنِ بَعْدَ الْمَغْرِبِ حَتَّى يَتَفَرَّقَ أَهْلُ الْمَسْجِدِ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ نَصْرٌ الْمُجَدَّرُ عَنْ يَعْقُوبَ الْقُمِّيِّ وَأَسْنَدَهُ مِثْلَهُ ‏.‏ قَالَ أَبُو دَاوُدَ حَدَّثَنَاهُ مُحَمَّدُ بْنُ عِيسَى بْنِ الطَّبَّاعِ حَدَّثَنَا نَصْرٌ الْمُجَدَّرُ عَنْ يَعْقُوبَ مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، وَسُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، قَالاَ حَدَّثَنَا يَعْقُوبُ، عَنْ جَعْفَرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ مُرْسَلٌ ‏.‏ قَالَ أَبُو دَاوُدَ سَمِعْتُ مُحَمَّدَ بْنَ حُمَيْدٍ يَقُولُ سَمِعْتُ يَعْقُوبَ يَقُولُ كُلُّ شَىْءٍ حَدَّثْتُكُمْ عَنْ جَعْفَرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فَهُوَ مُسْنَدٌ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ الْعُكْلِيُّ، حَدَّثَنِي مَالِكُ بْنُ مِغْوَلٍ، حَدَّثَنِي مُقَاتِلُ بْنُ بَشِيرٍ الْعِجْلِيُّ، عَنْ شُرَيْحِ بْنِ هَانِئٍ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَ سَأَلْتُهَا عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الْعِشَاءَ قَطُّ فَدَخَلَ عَلَىَّ إِلاَّ صَلَّى أَرْبَعَ رَكَعَاتٍ أَوْ سِتَّ رَكَعَاتٍ وَلَقَدْ مُطِرْنَا مَرَّةً بِاللَّيْلِ فَطَرَحْنَا لَهُ نِطْعًا فَكَأَنِّي أَنْظُرُ إِلَى ثُقْبٍ فِيهِ يَنْبُعُ الْمَاءُ مِنْهُ وَمَا رَأَيْتُهُ مُتَّقِيًا الأَرْضَ بِشَىْءٍ مِنْ ثِيَابِهِ قَطُّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ ابْنُ شَبُّويَةَ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ فِي الْمُزَّمِّلِ ‏{‏ قُمِ اللَّيْلَ إِلاَّ قَلِيلاً * نِصْفَهُ ‏}‏ نَسَخَتْهَا الآيَةُ الَّتِي فِيهَا ‏{‏ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ ‏}‏ وَنَاشِئَةُ اللَّيْلِ أَوَّلُهُ وَكَانَتْ صَلاَتُهُمْ لأَوَّلِ اللَّيْلِ يَقُولُ هُوَ أَجْدَرُ أَنْ تُحْصُوا مَا فَرَضَ اللَّهُ عَلَيْكُمْ مِنْ قِيَامِ اللَّيْلِ وَذَلِكَ أَنَّ الإِنْسَانَ إِذَا نَامَ لَمْ يَدْرِ مَتَى يَسْتَيْقِظُ وَقَوْلُهُ ‏{‏ أَقْوَمُ قِيلاً ‏}‏ هُوَ أَجْدَرُ أَنْ يُفْقَهَ فِي الْقُرْآنِ وَقَوْلُهُ ‏{‏ إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلاً ‏}‏ يَقُولُ فَرَاغًا طَوِيلاً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، - يَعْنِي الْمَرْوَزِيَّ - حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ سِمَاكٍ الْحَنَفِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا نَزَلَتْ أَوَّلُ الْمُزَّمِّلِ كَانُوا يَقُومُونَ نَحْوًا مِنْ قِيَامِهِمْ فِي شَهْرِ رَمَضَانَ حَتَّى نَزَلَ آخِرُهَا وَكَانَ بَيْنَ أَوَّلِهَا وَآخِرِهَا سَنَةٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ إِذَا هُوَ نَامَ ثَلاَثَ عُقَدٍ يَضْرِبُ مَكَانَ كُلِّ عُقْدَةٍ عَلَيْكَ لَيْلٌ طَوِيلٌ فَارْقُدْ فَإِنِ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ فَإِنْ صَلَّى انْحَلَّتْ عُقْدَةٌ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ وَإِلاَّ أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلاَنَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي قَيْسٍ، يَقُولُ قَالَتْ عَائِشَةُ رضى الله عنها لاَ تَدَعْ قِيَامَ اللَّيْلِ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ لاَ يَدَعُهُ وَكَانَ إِذَا مَرِضَ أَوْ كَسِلَ صَلَّى قَاعِدًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "حَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا ابْنُ عَجْلاَنَ، عَنِ الْقَعْقَاعِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ رَحِمَ اللَّهُ رَجُلاً قَامَ مِنَ اللَّيْلِ فَصَلَّى وَأَيْقَظَ امْرَأَتَهُ فَإِنْ أَبَتْ نَضَحَ فِي وَجْهِهَا الْمَاءَ رَحِمَ اللَّهُ امْرَأَةً قَامَتْ مِنَ اللَّيْلِ فَصَلَّتْ وَأَيْقَظَتْ زَوْجَهَا فَإِنْ أَبَى نَضَحَتْ فِي وَجْهِهِ الْمَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "حَدَّثَنَا ابْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مِسْعَرٍ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنِ الأَعْمَشِ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، - الْمَعْنَى - عَنِ الأَغَرِّ، عَنْ أَبِي سَعِيدٍ، وَأَبِي، هُرَيْرَةَ قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَيْقَظَ الرَّجُلُ أَهْلَهُ مِنَ اللَّيْلِ فَصَلَّيَا أَوْ صَلَّى رَكْعَتَيْنِ جَمِيعًا كُتِبَا فِي الذَّاكِرِينَ وَالذَّاكِرَاتِ ‏\"‏ ‏.‏ وَلَمْ يَرْفَعْهُ ابْنُ كَثِيرٍ وَلاَ ذَكَرَ أَبَا هُرَيْرَةَ جَعَلَهُ كَلاَمَ أَبِي سَعِيدٍ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ ابْنُ مَهْدِيٍّ عَنْ سُفْيَانَ قَالَ وَأُرَاهُ ذَكَرَ أَبَا هُرَيْرَةَ ‏.‏ قَالَ أَبُو دَاوُدَ وَحَدِيثُ سُفْيَانَ مَوْقُوفٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا نَعَسَ أَحَدُكُمْ فِي الصَّلاَةِ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبَّ نَفْسَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ فَلَمْ يَدْرِ مَا يَقُولُ فَلْيَضْطَجِعْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، وَهَارُونُ بْنُ عَبَّادٍ الأَزْدِيُّ، أَنَّ إِسْمَاعِيلَ بْنَ إِبْرَاهِيمَ، حَدَّثَهُمْ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْجِدَ وَحَبْلٌ مَمْدُودٌ بَيْنَ سَارِيَتَيْنِ فَقَالَ ‏\"‏ مَا هَذَا الْحَبْلُ ‏\"‏ ‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ هَذِهِ حَمْنَةُ بِنْتُ جَحْشٍ تُصَلِّي فَإِذَا أَعْيَتْ تَعَلَّقَتْ بِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِتُصَلِّ مَا أَطَاقَتْ فَإِذَا أَعْيَتْ فَلْتَجْلِسْ ‏\"‏ ‏.‏ قَالَ زِيَادٌ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ فَقَالُوا لِزَيْنَبَ تُصَلِّي فَإِذَا كَسِلَتْ أَوْ فَتَرَتْ أَمْسَكَتْ بِهِ ‏.‏ فَقَالَ ‏\"‏ حُلُّوهُ ‏\"‏ ‏.‏ فَقَالَ ‏\"‏ لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ فَإِذَا كَسِلَ أَوْ فَتَرَ فَلْيَقْعُدْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ، ح وَحَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ، وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، - الْمَعْنَى - عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، وَعُبَيْدَ اللَّهِ، أَخْبَرَاهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ قَالاَ عَنِ ابْنِ وَهْبِ بْنِ عَبْدٍ الْقَارِيِّ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَىْءٍ مِنْهُ فَقَرَأَهُ مَا بَيْنَ صَلاَةِ الْفَجْرِ وَصَلاَةِ الظُّهْرِ كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنَ اللَّيْلِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ رَجُلٍ، عِنْدَهُ رَضِيٍّ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا مِنِ امْرِئٍ تَكُونُ لَهُ صَلاَةٌ بِلَيْلٍ يَغْلِبُهُ عَلَيْهَا نَوْمٌ إِلاَّ كُتِبَ لَهُ أَجْرُ صَلاَتِهِ وَكَانَ نَوْمُهُ عَلَيْهِ صَدَقَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَعَنْ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى سَمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الْكُوفِيُّ، حَدَّثَنَا حَفْصٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُوقِظُهُ اللَّهُ عَزَّ وَجَلَّ بِاللَّيْلِ فَمَا يَجِيءُ السَّحَرُ حَتَّى يَفْرُغَ مِنْ حِزْبِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا أَبُو الأَحْوَصِ، ح وَحَدَّثَنَا هَنَّادٌ، عَنْ أَبِي الأَحْوَصِ، - وَهَذَا حَدِيثُ إِبْرَاهِيمَ - عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، قَالَ سَأَلْتُ عَائِشَةَ - رضى الله عنها - عَنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهَا أَىُّ حِينٍ كَانَ يُصَلِّي قَالَتْ كَانَ إِذَا سَمِعَ الصُّرَاخَ قَامَ فَصَلَّى ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "حَدَّثَنَا أَبُو تَوْبَةَ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ ‏:‏ مَا أَلْفَاهُ السَّحَرُ عِنْدِي إِلاَّ نَائِمًا، تَعْنِي النَّبِيَّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الدُّؤَلِيِّ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَخِي، حُذَيْفَةَ عَنْ حُذَيْفَةَ، قَالَ ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا حَزَبَهُ أَمْرٌ صَلَّى ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْهِقْلُ بْنُ زِيَادٍ السَّكْسَكِيُّ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، قَالَ سَمِعْتُ رَبِيعَةَ بْنَ كَعْبٍ الأَسْلَمِيَّ، يَقُولُ ‏:‏ كُنْتُ أَبِيتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم آتِيهِ بِوَضُوئِهِ وَبِحَاجَتِهِ، فَقَالَ ‏:‏ ‏\"‏ سَلْنِي ‏\"‏ ‏.‏ فَقُلْتُ ‏:‏ مُرَافَقَتَكَ فِي الْجَنَّةِ ‏.‏ قَالَ ‏:‏ ‏\"‏ أَوَغَيْرَ ذَلِكَ ‏\"‏ ‏.‏ قُلْتُ ‏:‏ هُوَ ذَاكَ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَأَعِنِّي عَلَى نَفْسِكَ بِكَثْرَةِ السُّجُودِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، فِي هَذِهِ الآيَةِ ‏{‏ تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ، يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ ‏}‏ قَالَ ‏:‏ كَانُوا يَتَيَقَّظُونَ مَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ يُصَلُّونَ، وَكَانَ الْحَسَنُ يَقُولُ ‏:‏ قِيَامُ اللَّيْلِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، فِي قَوْلِهِ جَلَّ وَعَزَّ ‏{‏ كَانُوا قَلِيلاً مِنَ اللَّيْلِ مَا يَهْجَعُونَ ‏}‏ قَالَ ‏:‏ كَانُوا يُصَلُّونَ فِيمَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ، زَادَ فِي حَدِيثِ يَحْيَى ‏:‏ وَكَذَلِكَ ‏{‏ تَتَجَافَى جُنُوبُهُمْ ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَيَّانَ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏ \"‏ إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ فَلْيُصَلِّ رَكْعَتَيْنِ خَفِيفَتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، حَدَّثَنَا إِبْرَاهِيمُ، - يَعْنِي ابْنَ خَالِدٍ - عَنْ رَبَاحِ بْنِ زَيْدٍ، عَنْ مَعْمَرٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ‏:‏ ‏\"‏ إِذَا ‏\"‏ ‏.‏ بِمَعْنَاهُ زَادَ ‏:‏ ‏\"‏ ثُمَّ لْيُطَوِّلْ بَعْدُ مَا شَاءَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ رَوَى هَذَا الْحَدِيثَ حَمَّادُ بْنُ سَلَمَةَ وَزُهَيْرُ بْنُ مُعَاوِيَةَ وَجَمَاعَةٌ عَنْ هِشَامٍ عَنْ مُحَمَّدٍ أَوْقَفُوهُ عَلَى أَبِي هُرَيْرَةَ، وَكَذَلِكَ رَوَاهُ أَيُّوبُ وَابْنُ عَوْنٍ أَوْقَفُوهُ عَلَى أَبِي هُرَيْرَةَ، وَرَوَاهُ ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ ‏:‏ فِيهِمَا تَجَوَّزْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "حَدَّثَنَا ابْنُ حَنْبَلٍ، - يَعْنِي أَحْمَدَ - حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ، عَنْ عَلِيٍّ الأَزْدِيِّ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ الْخَثْعَمِيِّ، ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ أَىُّ الأَعْمَالِ أَفْضَلُ قَالَ ‏:‏ ‏ \"‏ طُولُ الْقِيَامِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏:‏ أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏ \"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى، فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً تُوتِرُ لَهُ مَا قَدْ صَلَّى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ الْوَرْكَانِيُّ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏:‏ كَانَتْ قِرَاءَةُ النَّبِيِّ صلى الله عليه وسلم عَلَى قَدْرِ مَا يَسْمَعُهُ مَنْ فِي الْحُجْرَةِ وَهُوَ فِي الْبَيْتِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عِمْرَانَ بْنِ زَائِدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي خَالِدٍ الْوَالِبِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ ‏:‏ كَانَتْ قِرَاءَةُ النَّبِيِّ صلى الله عليه وسلم بِاللَّيْلِ يَرْفَعُ طَوْرًا وَيَخْفِضُ طَوْرًا ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ أَبُو خَالِدٍ الْوَالِبِيُّ اسْمُهُ هُرْمُزُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح وَحَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي رَبَاحٍ، عَنْ أَبِي قَتَادَةَ، ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ لَيْلَةً فَإِذَا هُوَ بِأَبِي بَكْرٍ - رضى الله عنه - يُصَلِّي يَخْفِضُ مِنْ صَوْتِهِ - قَالَ - وَمَرَّ بِعُمَرَ بْنِ الْخَطَّابِ وَهُوَ يُصَلِّي رَافِعًا صَوْتَهُ - قَالَ - فَلَمَّا اجْتَمَعَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم قَالَ النَّبِيُّ صلى الله عليه وسلم ‏:‏ ‏\"‏ يَا أَبَا بَكْرٍ مَرَرْتُ بِكَ وَأَنْتَ تُصَلِّي تَخْفِضُ صَوْتَكَ ‏\"‏ ‏.‏ قَالَ ‏:‏ قَدْ أَسْمَعْتُ مَنْ نَاجَيْتُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ وَقَالَ لِعُمَرَ ‏:‏ ‏\"‏ مَرَرْتُ بِكَ وَأَنْتَ تُصَلِّي رَافِعًا صَوْتَكَ ‏\"‏ ‏.‏ قَالَ فَقَالَ ‏:‏ يَا رَسُولَ اللَّهِ أُوقِظُ الْوَسْنَانَ وَأَطْرُدُ الشَّيْطَانَ ‏.‏ زَادَ الْحَسَنُ فِي حَدِيثِهِ ‏:‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏:‏ ‏\"‏ يَا أَبَا بَكْرٍ ارْفَعْ مِنْ صَوْتِكَ شَيْئًا ‏\"‏ ‏.‏ وَقَالَ لِعُمَرَ ‏:‏ ‏\"‏ اخْفِضْ مِنْ صَوْتِكَ شَيْئًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "حَدَّثَنَا أَبُو حَصِينِ بْنُ يَحْيَى الرَّازِيُّ، حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذِهِ الْقِصَّةِ لَمْ يَذْكُرْ فَقَالَ لأَبِي بَكْرٍ ‏:‏ ‏\"‏ ارْفَعْ مِنْ صَوْتِكَ شَيْئًا ‏\"‏ ‏.‏ وَلِعُمَرَ ‏:‏ ‏\"‏ اخْفِضْ شَيْئًا ‏\"‏ ‏.‏ زَادَ ‏:‏ ‏\"‏ وَقَدْ سَمِعْتُكَ يَا بِلاَلُ وَأَنْتَ تَقْرَأُ مِنْ هَذِهِ السُّورَةِ وَمِنْ هَذِهِ السُّورَةِ ‏\"‏ ‏.‏ قَالَ ‏:‏ كَلاَمٌ طَيِّبٌ يَجْمَعُ اللَّهُ تَعَالَى بَعْضَهُ إِلَى بَعْضٍ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏:‏ ‏\"‏ كُلُّكُمْ قَدْ أَصَابَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رضى الله عنها ‏:‏ أَنَّ رَجُلاً، قَامَ مِنَ اللَّيْلِ فَقَرَأَ فَرَفَعَ صَوْتَهُ بِالْقُرْآنِ، فَلَمَّا أَصْبَحَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ يَرْحَمُ اللَّهُ فُلاَنًا، كَأَيِّنْ مِنْ آيَةٍ أَذْكَرَنِيهَا اللَّيْلَةَ كُنْتُ قَدْ أَسْقَطْتُهَا ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ رَوَاهُ هَارُونُ النَّحْوِيُّ عَنْ حَمَّادِ بْنِ سَلَمَةَ فِي سُورَةِ آلِ عِمْرَانَ فِي الْحُرُوفِ ‏{‏ وَكَأَيِّنْ مِنْ نَبِيٍّ ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ ‏:‏ اعْتَكَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَسَمِعَهُمْ يَجْهَرُونَ بِالْقِرَاءَةِ، فَكَشَفَ السِّتْرَ وَقَالَ ‏:‏ ‏\"‏ أَلاَ إِنَّ كُلَّكُمْ مُنَاجٍ رَبَّهُ فَلاَ يُؤْذِيَنَّ بَعْضُكُمْ بَعْضًا، وَلاَ يَرْفَعْ بَعْضُكُمْ عَلَى بَعْضٍ فِي الْقِرَاءَةِ ‏\"‏ ‏.‏ أَوْ قَالَ ‏:‏ ‏\"‏ فِي الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏ \"‏ الْجَاهِرُ بِالْقُرْآنِ كَالْجَاهِرِ بِالصَّدَقَةِ، وَالْمُسِرُّ بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ حَنْظَلَةَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ ‏:‏ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ عَشْرَ رَكَعَاتٍ، وَيُوتِرُ بِسَجْدَةٍ، وَيَسْجُدُ سَجْدَتَىِ الْفَجْرِ، فَذَلِكَ ثَلاَثَ عَشْرَةَ رَكْعَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً، يُوتِرُ مِنْهَا بِوَاحِدَةٍ، فَإِذَا فَرَغَ مِنْهَا اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، وَنَصْرُ بْنُ عَاصِمٍ، - وَهَذَا لَفْظُهُ - قَالاَ حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا الأَوْزَاعِيُّ، - وَقَالَ نَصْرٌ ‏:‏ عَنِ ابْنِ أَبِي ذِئْبٍ، وَالأَوْزَاعِيِّ، - عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ ‏:‏ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلاَةِ الْعِشَاءِ إِلَى أَنْ يَنْصَدِعَ الْفَجْرُ إِحْدَى عَشْرَةَ رَكْعَةً، يُسَلِّمُ مِنْ كُلِّ ثِنْتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ، وَيَمْكُثُ فِي سُجُودِهِ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ، فَإِذَا سَكَتَ الْمُؤَذِّنُ بِالأُولَى مِنْ صَلاَةِ الْفَجْرِ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، وَعَمْرُو بْنُ الْحَارِثِ، وَيُونُسُ بْنُ يَزِيدَ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُمْ بِإِسْنَادِهِ، وَمَعْنَاهُ،، قَالَ ‏:‏ وَيُوتِرُ بِوَاحِدَةٍ، وَيَسْجُدُ سَجْدَةً قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ، فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ صَلاَةِ الْفَجْرِ وَتَبَيَّنَ لَهُ الْفَجْرُ ‏.‏ وَسَاقَ مَعْنَاهُ ‏.‏ قَالَ ‏:‏ وَبَعْضُهُمْ يَزِيدُ عَلَى بَعْضٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": 1338,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ ‏:‏ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِخَمْسٍ، لاَ يَجْلِسُ فِي شَىْءٍ مِنَ الْخَمْسِ حَتَّى يَجْلِسَ فِي الآخِرَةِ فَيُسَلِّمَ ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ رَوَاهُ ابْنُ نُمَيْرٍ عَنْ هِشَامٍ، نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ ‏:‏ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِاللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً، ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، وَمُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالاَ حَدَّثَنَا أَبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، ‏:‏ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي مِنَ اللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً، وَكَانَ يُصَلِّي ثَمَانِيَ رَكَعَاتٍ، وَيُوتِرُ بِرَكْعَةٍ، ثُمَّ يُصَلِّي - قَالَ مُسْلِمٌ ‏:‏ بَعْدَ الْوِتْرِ، ثُمَّ اتَّفَقَا - رَكْعَتَيْنِ وَهُوَ قَاعِدٌ، فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ، وَيُصَلِّي بَيْنَ أَذَانِ الْفَجْرِ وَالإِقَامَةِ رَكْعَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ أَخْبَرَهُ ‏:‏ أَنَّهُ، سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَقَالَتْ ‏:‏ مَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَزِيدُ فِي رَمَضَانَ وَلاَ فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً ‏:‏ يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي ثَلاَثًا، قَالَتْ عَائِشَةُ - رضى الله عنها - فَقُلْتُ ‏:‏ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ قَالَ ‏:‏ ‏ \"‏ يَا عَائِشَةُ إِنَّ عَيْنَىَّ تَنَامَانِ وَلاَ يَنَامُ قَلْبِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، قَالَ ‏:‏ طَلَّقْتُ امْرَأَتِي فَأَتَيْتُ الْمَدِينَةَ لأَبِيعَ عَقَارًا كَانَ لِي بِهَا، فَأَشْتَرِيَ بِهِ السِّلاَحَ وَأَغْزُوَ، فَلَقِيتُ نَفَرًا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَقَالُوا ‏:‏ قَدْ أَرَادَ نَفَرٌ مِنَّا سِتَّةٌ أَنْ يَفْعَلُوا ذَلِكَ فَنَهَاهُمُ النَّبِيُّ صلى الله عليه وسلم وَقَالَ ‏:‏ ‏\"‏ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ ‏\"‏ ‏.‏ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَسَأَلْتُهُ عَنْ وِتْرِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏:‏ أَدُلُّكَ عَلَى أَعْلَمِ النَّاسِ بِوِتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأْتِ عَائِشَةَ رضى الله عنها ‏.‏ فَأَتَيْتُهَا فَاسْتَتْبَعْتُ حَكِيمَ بْنَ أَفْلَحَ فَأَبَى فَنَاشَدْتُهُ فَانْطَلَقَ مَعِي، فَاسْتَأْذَنَّا عَلَى عَائِشَةَ، فَقَالَتْ ‏:‏ مَنْ هَذَا قَالَ ‏:‏ حَكِيمُ بْنُ أَفْلَحَ ‏.‏ قَالَتْ ‏:‏ وَمَنْ مَعَكَ قَالَ ‏:‏ سَعْدُ بْنُ هِشَامٍ ‏.‏ قَالَتْ ‏:‏ هِشَامُ بْنُ عَامِرٍ الَّذِي قُتِلَ يَوْمَ أُحُدٍ قَالَ قُلْتُ ‏:‏ نَعَمْ ‏.‏ قَالَتْ ‏:‏ نِعْمَ الْمَرْءُ كَانَ عَامِرًا ‏.‏ قَالَ قُلْتُ ‏:‏ يَا أُمَّ الْمُؤْمِنِينَ حَدِّثِينِي عَنْ خُلُقِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ ‏:‏ أَلَسْتَ تَقْرَأُ الْقُرْآنَ فَإِنَّ خُلُقَ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَ الْقُرْآنَ ‏.‏ قَالَ قُلْتُ ‏:‏ حَدِّثِينِي عَنْ قِيَامِ اللَّيْلِ قَالَتْ ‏:‏ أَلَسْتَ تَقْرَأُ ‏{‏ يَا أَيُّهَا الْمُزَّمِّلُ ‏}‏ قَالَ قُلْتُ ‏:‏ بَلَى ‏.‏ قَالَتْ ‏:‏ فَإِنَّ أَوَّلَ هَذِهِ السُّورَةِ نَزَلَتْ، فَقَامَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى انْتَفَخَتْ أَقْدَامُهُمْ، وَحُبِسَ خَاتِمَتُهَا فِي السَّمَاءِ اثْنَىْ عَشَرَ شَهْرًا، ثُمَّ نَزَلَ آخِرُهَا فَصَارَ قِيَامُ اللَّيْلِ تَطَوُّعًا بَعْدَ فَرِيضَةٍ ‏.‏ قَالَ قُلْتُ ‏:‏ حَدِّثِينِي عَنْ وِتْرِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَتْ ‏:‏ كَانَ يُوتِرُ بِثَمَانِ رَكَعَاتٍ لاَ يَجْلِسُ إِلاَّ فِي الثَّامِنَةِ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَةً أُخْرَى، لاَ يَجْلِسُ إِلاَّ فِي الثَّامِنَةِ وَالتَّاسِعَةِ، وَلاَ يُسَلِّمُ إِلاَّ فِي التَّاسِعَةِ، ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَىَّ، فَلَمَّا أَسَنَّ وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعِ رَكَعَاتٍ لَمْ يَجْلِسْ إِلاَّ فِي السَّادِسَةِ وَالسَّابِعَةِ، وَلَمْ يُسَلِّمْ إِلاَّ فِي السَّابِعَةِ، ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ، فَتِلْكَ هِيَ تِسْعُ رَكَعَاتٍ يَا بُنَىَّ، وَلَمْ يَقُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً يُتِمُّهَا إِلَى الصَّبَاحِ، وَلَمْ يَقْرَإِ الْقُرْآنَ فِي لَيْلَةٍ قَطُّ، وَلَمْ يَصُمْ شَهْرًا يُتِمُّهُ غَيْرَ رَمَضَانَ، وَكَانَ إِذَا صَلَّى صَلاَةً دَاوَمَ عَلَيْهَا، وَكَانَ إِذَا غَلَبَتْهُ عَيْنَاهُ مِنَ اللَّيْلِ بِنَوْمٍ صَلَّى مِنَ النَّهَارِ ثِنْتَىْ عَشْرَةَ رَكْعَةً ‏.‏ قَالَ ‏:‏ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَحَدَّثْتُهُ ‏.‏ فَقَالَ ‏:‏ هَذَا وَاللَّهِ هُوَ الْحَدِيثُ، وَلَوْ كُنْتُ أُكَلِّمُهَا لأَتَيْتُهَا حَتَّى أُشَافِهَهَا بِهِ مُشَافَهَةً ‏.‏ قَالَ قُلْتُ ‏:‏ لَوْ عَلِمْتُ أَنَّكَ لاَ تُكَلِّمُهَا مَا حَدَّثْتُكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، بِإِسْنَادِهِ نَحْوَهُ قَالَ ‏:‏ يُصَلِّي ثَمَانِ رَكَعَاتٍ لاَ يَجْلِسُ فِيهِنَّ إِلاَّ عِنْدَ الثَّامِنَةِ، فَيَجْلِسُ فَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ، ثُمَّ يَدْعُو، ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا، ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا يُسَلِّمُ، ثُمَّ يُصَلِّي رَكْعَةً، فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَىَّ، فَلَمَّا أَسَنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعٍ، وَصَلَّى رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا يُسَلِّمُ، بِمَعْنَاهُ إِلَى مُشَافَهَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا سَعِيدٌ، بِهَذَا الْحَدِيثِ قَالَ ‏:‏ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا كَمَا قَالَ يَحْيَى بْنُ سَعِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، بِهَذَا الْحَدِيثِ قَالَ ابْنُ بَشَّارٍ بِنَحْوِ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ إِلاَّ أَنَّهُ قَالَ ‏:‏ وَيُسَلِّمُ تَسْلِيمَةً يُسْمِعُنَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُسَيْنٍ الدِّرْهَمِيُّ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ بَهْزِ بْنِ حَكِيمٍ، حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى، ‏:‏ أَنَّ عَائِشَةَ، - رضى الله عنها - سُئِلَتْ عَنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي جَوْفِ اللَّيْلِ، فَقَالَتْ ‏:‏ كَانَ يُصَلِّي صَلاَةَ الْعِشَاءِ فِي جَمَاعَةٍ، ثُمَّ يَرْجِعُ إِلَى أَهْلِهِ فَيَرْكَعُ أَرْبَعَ رَكَعَاتٍ، ثُمَّ يَأْوِي إِلَى فِرَاشِهِ وَيَنَامُ وَطَهُورُهُ مُغَطًّى عِنْدَ رَأْسِهِ، وَسِوَاكُهُ مَوْضُوعٌ حَتَّى يَبْعَثَهُ اللَّهُ سَاعَتَهُ الَّتِي يَبْعَثُهُ مِنَ اللَّيْلِ، فَيَتَسَوَّكُ وَيُسْبِغُ الْوُضُوءَ، ثُمَّ يَقُومُ إِلَى مُصَلاَّهُ فَيُصَلِّي ثَمَانِ رَكَعَاتٍ يَقْرَأُ فِيهِنَّ بِأُمِّ الْكِتَابِ وَسُورَةٍ مِنَ الْقُرْآنِ وَمَا شَاءَ اللَّهُ، وَلاَ يَقْعُدُ فِي شَىْءٍ مِنْهَا حَتَّى يَقْعُدَ فِي الثَّامِنَةِ، وَلاَ يُسَلِّمُ، وَيَقْرَأُ فِي التَّاسِعَةِ، ثُمَّ يَقْعُدُ فَيَدْعُو بِمَا شَاءَ اللَّهُ أَنْ يَدْعُوَهُ، وَيَسْأَلُهُ وَيَرْغَبُ إِلَيْهِ وَيُسَلِّمُ تَسْلِيمَةً وَاحِدَةً شَدِيدَةً، يَكَادُ يُوقِظُ أَهْلَ الْبَيْتِ مِنْ شِدَّةِ تَسْلِيمِهِ، ثُمَّ يَقْرَأُ وَهُوَ قَاعِدٌ بِأُمِّ الْكِتَابِ، وَيَرْكَعُ وَهُوَ قَاعِدٌ، ثُمَّ يَقْرَأُ الثَّانِيَةَ فَيَرْكَعُ وَيَسْجُدُ وَهُوَ قَاعِدٌ، ثُمَّ يَدْعُو مَا شَاءَ اللَّهُ أَنْ يَدْعُوَ، ثُمَّ يُسَلِّمُ وَيَنْصَرِفُ، فَلَمْ تَزَلْ تِلْكَ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى بَدَّنَ فَنَقَصَ مِنَ التِّسْعِ ثِنْتَيْنِ، فَجَعَلَهَا إِلَى السِّتِّ وَالسَّبْعِ وَرَكْعَتَيْهِ وَهُوَ قَاعِدٌ حَتَّى قُبِضَ عَلَى ذَلِكَ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ، فَذَكَرَ هَذَا الْحَدِيثَ بِإِسْنَادِهِ قَالَ ‏:‏ يُصَلِّي الْعِشَاءَ ثُمَّ يَأْوِي إِلَى فِرَاشِهِ، لَمْ يَذْكُرِ الأَرْبَعَ رَكَعَاتٍ، وَسَاقَ الْحَدِيثَ قَالَ فِيهِ ‏:‏ فَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ، وَلاَ يَجْلِسُ فِي شَىْءٍ مِنْهُنَّ إِلاَّ فِي الثَّامِنَةِ، فَإِنَّهُ كَانَ يَجْلِسُ ثُمَّ يَقُومُ وَلاَ يُسَلِّمُ، فَيُصَلِّي رَكْعَةً يُوتِرُ بِهَا، ثُمَّ يُسَلِّمُ تَسْلِيمَةً يَرْفَعُ بِهَا صَوْتَهُ حَتَّى يُوقِظَنَا، ثُمَّ سَاقَ مَعْنَاهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "حَدَّثَنَا عُمَرُ بْنُ عُثْمَانَ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي ابْنَ مُعَاوِيَةَ - عَنْ بَهْزٍ، حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، ‏:‏ أَنَّهَا سُئِلَتْ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ ‏:‏ كَانَ يُصَلِّي بِالنَّاسِ الْعِشَاءَ، ثُمَّ يَرْجِعُ إِلَى أَهْلِهِ فَيُصَلِّي أَرْبَعًا، ثُمَّ يَأْوِي إِلَى فِرَاشِهِ، ثُمَّ سَاقَ الْحَدِيثَ بِطُولِهِ وَلَمْ يَذْكُرْ ‏:‏ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ ‏.‏ وَلَمْ يَذْكُرْ فِي التَّسْلِيمِ ‏:‏ حَتَّى يُوقِظَنَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ سَلَمَةَ - عَنْ بَهْزِ بْنِ حَكِيمٍ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، - رضى الله عنها - بِهَذَا الْحَدِيثِ وَلَيْسَ فِي تَمَامِ حَدِيثِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "حَدَّثَنَا مُوسَى، - يَعْنِي ابْنَ إِسْمَاعِيلَ - حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ سَلَمَةَ - عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، رضى الله عنها ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي مِنَ اللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً يُوتِرُ بِسَبْعٍ أَوْ كَمَا قَالَتْ، وَيُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ، وَرَكْعَتَىِ الْفَجْرِ بَيْنَ الأَذَانِ وَالإِقَامَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عَائِشَةَ، رضى الله عنها ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِتِسْعِ رَكَعَاتٍ، ثُمَّ أَوْتَرَ بِسَبْعِ رَكَعَاتٍ، وَرَكَعَ رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ الْوِتْرِ يَقْرَأُ فِيهِمَا، فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ ثُمَّ سَجَدَ، قَالَ أَبُو دَاوُدَ ‏:‏ رَوَى هَذَيْنِ الْحَدِيثَيْنِ خَالِدُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ عَنْ مُحَمَّدِ بْنِ عَمْرٍو مِثْلَهُ، قَالَ فِيهِ قَالَ عَلْقَمَةُ بْنُ وَقَّاصٍ ‏:‏ يَا أُمَّتَاهُ كَيْفَ كَانَ يُصَلِّي الرَّكْعَتَيْنِ فَذَكَرَ مَعْنَاهُ ‏.‏ حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنِ الْحَسَنِ، عَنْ سَعْدِ بْنِ هِشَامٍ، قَالَ ‏:‏ قَدِمْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَى عَائِشَةَ فَقُلْتُ ‏:‏ أَخْبِرِينِي عَنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ ‏:‏ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي بِالنَّاسِ صَلاَةَ الْعِشَاءِ، ثُمَّ يَأْوِي إِلَى فِرَاشِهِ فَيَنَامُ، فَإِذَا كَانَ جَوْفُ اللَّيْلِ قَامَ إِلَى حَاجَتِهِ وَإِلَى طَهُورِهِ فَتَوَضَّأَ، ثُمَّ دَخَلَ الْمَسْجِدَ فَصَلَّى ثَمَانِ رَكَعَاتٍ يُخَيَّلُ إِلَىَّ أَنَّهُ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ، ثُمَّ يُوتِرُ بِرَكْعَةٍ، ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ، ثُمَّ يَضَعُ جَنْبَهُ، فَرُبَّمَا جَاءَ بِلاَلٌ فَآذَنَهُ بِالصَّلاَةِ، ثُمَّ يُغْفِي، وَرُبَّمَا شَكَكْتُ أَغَفَى أَوْ لاَ، حَتَّى يُؤْذِنَهُ بِالصَّلاَةِ، فَكَانَتْ تِلْكَ صَلاَتَهُ حَتَّى أَسَنَّ وَلَحُمَ، فَذَكَرَتْ مِنْ لَحْمِهِ مَا شَاءَ اللَّهُ، وَسَاقَ الْحَدِيثَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا حُصَيْنٌ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ حُصَيْنٍ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، ‏:‏ أَنَّهُ رَقَدَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَرَآهُ اسْتَيْقَظَ فَتَسَوَّكَ وَتَوَضَّأَ وَهُوَ يَقُولُ ‏:‏ ‏{‏ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ ‏}‏ حَتَّى خَتَمَ السُّورَةَ، ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ أَطَالَ فِيهِمَا الْقِيَامَ وَالرُّكُوعَ وَالسُّجُودَ، ثُمَّ إِنَّهُ انْصَرَفَ فَنَامَ حَتَّى نَفَخَ، ثُمَّ فَعَلَ ذَلِكَ ثَلاَثَ مَرَّاتٍ بِسِتِّ رَكَعَاتٍ، كُلُّ ذَلِكَ يَسْتَاكُ ثُمَّ يَتَوَضَّأُ وَيَقْرَأُ هَؤُلاَءِ الآيَاتِ، ثُمَّ أَوْتَرَ - قَالَ عُثْمَانُ ‏:‏ بِثَلاَثِ رَكَعَاتٍ، فَأَتَاهُ الْمُؤَذِّنُ فَخَرَجَ إِلَى الصَّلاَةِ - وَقَالَ ابْنُ عِيسَى ‏:‏ ثُمَّ أَوْتَرَ فَأَتَاهُ بِلاَلٌ فَآذَنَهُ بِالصَّلاَةِ حِينَ طَلَعَ الْفَجْرُ، فَصَلَّى رَكْعَتَىِ الْفَجْرِ ثُمَّ خَرَجَ إِلَى الصَّلاَةِ - ثُمَّ اتَّفَقَا - وَهُوَ يَقُولُ ‏:‏ ‏\"‏ اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَاجْعَلْ فِي لِسَانِي نُورًا، وَاجْعَلْ فِي سَمْعِي نُورًا، وَاجْعَلْ فِي بَصَرِي نُورًا، وَاجْعَلْ خَلْفِي نُورًا، وَأَمَامِي نُورًا، وَاجْعَلْ مِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، اللَّهُمَّ وَأَعْظِمْ لِي نُورًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، عَنْ خَالِدٍ، عَنْ حُصَيْنٍ، نَحْوَهُ قَالَ ‏:‏ ‏ \"‏ وَأَعْظِمْ لِي نُورًا ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ وَكَذَلِكَ قَالَ أَبُو خَالِدٍ الدَّالاَنِيُّ عَنْ حَبِيبٍ فِي هَذَا، وَكَذَلِكَ قَالَ فِي هَذَا الْحَدِيثِ وَقَالَ سَلَمَةُ بْنُ كُهَيْلٍ عَنْ أَبِي رِشْدِينَ عَنِ ابْنِ عَبَّاسٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ كُرَيْبٍ، عَنِ الْفَضْلِ بْنِ عَبَّاسٍ، قَالَ ‏:‏ بِتُّ لَيْلَةً عِنْدَ النَّبِيِّ صلى الله عليه وسلم لأَنْظُرَ كَيْفَ يُصَلِّي فَقَامَ فَتَوَضَّأَ ثُمَّ صَلَّى رَكْعَتَيْنِ قِيَامُهُ مِثْلُ رُكُوعِهِ، وَرُكُوعُهُ مِثْلُ سُجُودِهِ، ثُمَّ نَامَ، ثُمَّ اسْتَيْقَظَ فَتَوَضَّأَ وَاسْتَنَّ ثُمَّ قَرَأَ بِخَمْسِ آيَاتٍ مِنْ آلِ عِمْرَانَ ‏{‏ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ ‏}‏ فَلَمْ يَزَلْ يَفْعَلُ هَذَا حَتَّى صَلَّى عَشْرَ رَكَعَاتٍ، ثُمَّ قَامَ فَصَلَّى سَجْدَةً وَاحِدَةً فَأَوْتَرَ بِهَا، وَنَادَى الْمُنَادِي عِنْدَ ذَلِكَ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ مَا سَكَتَ الْمُؤَذِّنُ فَصَلَّى سَجْدَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ جَلَسَ حَتَّى صَلَّى الصُّبْحَ ‏.‏ قَالَ أَبُو دَاوُدَ ‏:‏ خَفِيَ عَلَىَّ مِنِ ابْنِ بَشَّارٍ بَعْضُهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا مُحَمَّدُ بْنُ قَيْسٍ الأَسَدِيُّ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏:‏ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ مَا أَمْسَى فَقَالَ ‏:‏ ‏ \"‏ أَصَلَّى الْغُلاَمُ ‏\"‏ ‏.‏ قَالُوا ‏:‏ نَعَمْ ‏.‏ فَاضْطَجَعَ حَتَّى إِذَا مَضَى مِنَ اللَّيْلِ مَا شَاءَ اللَّهُ قَامَ فَتَوَضَّأَ، ثُمَّ صَلَّى سَبْعًا أَوْ خَمْسًا أَوْتَرَ بِهِنَّ لَمْ يُسَلِّمْ إِلاَّ فِي آخِرِهِنَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏:‏ بِتُّ فِي بَيْتِ خَالَتِي مَيْمُونَةَ بِنْتِ الْحَارِثِ فَصَلَّى النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ، ثُمَّ جَاءَ فَصَلَّى أَرْبَعًا، ثُمَّ نَامَ، ثُمَّ قَامَ يُصَلِّي، فَقُمْتُ عَنْ يَسَارِهِ فَأَدَارَنِي فَأَقَامَنِي عَنْ يَمِينِهِ فَصَلَّى خَمْسًا ثُمَّ نَامَ حَتَّى سَمِعْتُ غَطِيطَهُ - أَوْ خَطِيطَهُ - ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الْغَدَاةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ الْمَجِيدِ، عَنْ يَحْيَى بْنِ عَبَّادٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّ ابْنَ عَبَّاسٍ، حَدَّثَهُ فِي، هَذِهِ الْقِصَّةِ قَالَ ‏:‏ فَقَامَ فَصَلَّى رَكْعَتَيْنِ رَكْعَتَيْنِ، حَتَّى صَلَّى ثَمَانِيَ رَكَعَاتٍ، ثُمَّ أَوْتَرَ بِخَمْسٍ لَمْ يَجْلِسْ بَيْنَهُنَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ، حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ ‏:‏ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي ثَلاَثَ عَشْرَةَ رَكْعَةً بِرَكْعَتَيْهِ قَبْلَ الصُّبْحِ ‏:‏ يُصَلِّي سِتًّا مَثْنَى مَثْنَى، وَيُوتِرُ بِخَمْسٍ لاَ يَقْعُدُ بَيْنَهُنَّ إِلاَّ فِي آخِرِهِنَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا أَخْبَرَتْهُ ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي بِاللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً بِرَكْعَتَىِ الْفَجْرِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، وَجَعْفَرُ بْنُ مُسَافِرٍ، أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْمُقْرِئَ، أَخْبَرَهُمَا عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الْعِشَاءَ، ثُمَّ صَلَّى ثَمَانِيَ رَكَعَاتٍ قَائِمًا، وَرَكْعَتَيْنِ بَيْنَ الأَذَانَيْنِ وَلَمْ يَكُنْ يَدَعُهُمَا ‏.‏ قَالَ جَعْفَرُ بْنُ مُسَافِرٍ فِي حَدِيثِهِ ‏:‏ وَرَكْعَتَيْنِ جَالِسًا بَيْنَ الأَذَانَيْنِ، زَادَ ‏:‏ جَالِسًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، قَالَ قُلْتُ لِعَائِشَةَ رضى الله عنها ‏:‏ بِكَمْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ قَالَتْ ‏:‏ كَانَ يُوتِرُ بِأَرْبَعٍ وَثَلاَثٍ، وَسِتٍّ وَثَلاَثٍ، وَثَمَانٍ وَثَلاَثٍ، وَعَشْرٍ وَثَلاَثٍ، وَلَمْ يَكُنْ يُوتِرُ بِأَنْقَصَ مِنْ سَبْعٍ، وَلاَ بِأَكْثَرَ مِنْ ثَلاَثَ عَشْرَةَ ‏.‏ قَالَ أَبُو دَاوُدَ زَادَ أَحْمَدُ بْنُ صَالِحٍ ‏:‏ وَلَمْ يَكُنْ يُوتِرُ بِرَكْعَتَيْنِ قَبْلَ الْفَجْرِ ‏.‏ قُلْتُ ‏:‏ مَا يُوتِرُ قَالَتْ ‏:‏ لَمْ يَكُنْ يَدَعُ ذَلِكَ ‏.‏ وَلَمْ يَذْكُرْ أَحْمَدُ ‏:‏ وَسِتٍّ وَثَلاَثٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي إِسْحَاقَ الْهَمْدَانِيِّ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، ‏:‏ أَنَّهُ دَخَلَ عَلَى عَائِشَةَ فَسَأَلَهَا عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّيْلِ ‏.‏ فَقَالَتْ ‏:‏ كَانَ يُصَلِّي ثَلاَثَ عَشْرَةَ رَكْعَةً مِنَ اللَّيْلِ، ثُمَّ إِنَّهُ صَلَّى إِحْدَى عَشْرَةَ رَكْعَةً، وَتَرَكَ رَكْعَتَيْنِ ثُمَّ قُبِضَ صلى الله عليه وسلم حِينَ قُبِضَ وَهُوَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، وَكَانَ آخِرُ صَلاَتِهِ مِنَ اللَّيْلِ الْوِتْرَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، أَنَّ كُرَيْبًا، مَوْلَى ابْنِ عَبَّاسٍ أَخْبَرَهُ أَنَّهُ، قَالَ ‏:‏ سَأَلْتُ ابْنَ عَبَّاسٍ كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّيْلِ قَالَ ‏:‏ بِتُّ عِنْدَهُ لَيْلَةً وَهُوَ عِنْدَ مَيْمُونَةَ، فَنَامَ حَتَّى إِذَا ذَهَبَ ثُلُثُ اللَّيْلِ أَوْ نِصْفُهُ اسْتَيْقَظَ فَقَامَ إِلَى شَنٍّ فِيهِ مَاءٌ فَتَوَضَّأَ وَتَوَضَّأْتُ مَعَهُ، ثُمَّ قَامَ فَقُمْتُ إِلَى جَنْبِهِ عَلَى يَسَارِهِ فَجَعَلَنِي عَلَى يَمِينِهِ، ثُمَّ وَضَعَ يَدَهُ عَلَى رَأْسِي كَأَنَّهُ يَمَسُّ أُذُنِي كَأَنَّهُ يُوقِظُنِي فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، قُلْتُ ‏:‏ فَقَرَأَ فِيهِمَا بِأُمِّ الْقُرْآنِ فِي كُلِّ رَكْعَةٍ ثُمَّ سَلَّمَ ثُمَّ صَلَّى حَتَّى صَلَّى إِحْدَى عَشْرَةَ رَكْعَةً بِالْوِتْرِ، ثُمَّ نَامَ فَأَتَاهُ بِلاَلٌ فَقَالَ ‏:‏ الصَّلاَةُ يَا رَسُولَ اللَّهِ ‏.‏ فَقَامَ فَرَكَعَ رَكْعَتَيْنِ، ثُمَّ صَلَّى لِلنَّاسِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "حَدَّثَنَا نُوحُ بْنُ حَبِيبٍ، وَيَحْيَى بْنُ مُوسَى، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏:‏ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَقَامَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ فَصَلَّى ثَلاَثَ عَشْرَةَ رَكْعَةً مِنْهَا رَكْعَتَا الْفَجْرِ، حَزَرْتُ قِيَامَهُ فِي كُلِّ رَكْعَةٍ بِقَدْرِ ‏{‏ يَا أَيُّهَا الْمُزَّمِّلُ ‏}‏ لَمْ يَقُلْ نُوحٌ ‏:‏ مِنْهَا رَكْعَتَا الْفَجْرِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ، أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ - قَالَ - لأَرْمُقَنَّ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم اللَّيْلَةَ، قَالَ ‏:‏ فَتَوَسَّدْتُ عَتَبَتَهُ أَوْ فُسْطَاطَهُ، فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ أَوْتَرَ، فَذَلِكَ ثَلاَثَ عَشْرَةَ رَكْعَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ ‏:‏ أَنَّهُ، بَاتَ عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَهِيَ خَالَتُهُ - قَالَ - فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا انْتَصَفَ اللَّيْلُ - أَوْ قَبْلَهُ بِقَلِيلٍ، أَوْ بَعْدَهُ بِقَلِيلٍ - اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ، ثُمَّ قَرَأَ الْعَشْرَ الآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا فَأَحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي، قَالَ عَبْدُ اللَّهِ ‏:‏ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي فَأَخَذَ بِأُذُنِي يَفْتِلُهَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، قَالَ الْقَعْنَبِيُّ ‏:‏ سِتَّ مَرَّاتٍ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ، حَتَّى جَاءَهُ الْمُؤَذِّنُ فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ اكْلَفُوا مِنَ الْعَمَلِ مَا تُطِيقُونَ، فَإِنَّ اللَّهَ لاَ يَمَلُّ حَتَّى تَمَلُّوا، وَإِنَّ أَحَبَّ الْعَمَلِ إِلَى اللَّهِ أَدْوَمُهُ وَإِنْ قَلَّ ‏\"‏ ‏.‏ وَكَانَ إِذَا عَمِلَ عَمَلاً أَثْبَتَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، حَدَّثَنَا عَمِّي، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ إِلَى عُثْمَانَ بْنِ مَظْعُونٍ فَجَاءَهُ فَقَالَ ‏:‏ ‏\"‏ يَا عُثْمَانُ أَرَغِبْتَ عَنْ سُنَّتِي ‏\"‏ ‏.‏ قَالَ ‏:‏ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ، وَلَكِنْ سُنَّتَكَ أَطْلُبُ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَإِنِّي أَنَامُ وَأُصَلِّي، وَأَصُومُ وَأُفْطِرُ، وَأَنْكِحُ النِّسَاءَ، فَاتَّقِ اللَّهَ يَا عُثْمَانُ، فَإِنَّ لأَهْلِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِضَيْفِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِنَفْسِكَ عَلَيْكَ حَقًّا، فَصُمْ وَأَفْطِرْ، وَصَلِّ وَنَمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ ‏:‏ سَأَلْتُ عَائِشَةَ كَيْفَ كَانَ عَمَلُ رَسُولِ اللَّهِ صلى الله عليه وسلم هَلْ كَانَ يَخُصُّ شَيْئًا مِنَ الأَيَّامِ قَالَتْ ‏:‏ لاَ، كَانَ كُلُّ عَمَلِهِ دِيمَةً، وَأَيُّكُمْ يَسْتَطِيعُ مَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَطِيعُ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 121
			}
		}
	]
}