{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"12": "The Book of The At-Tatbiq (Clasping One's Hands Together)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "رفاعہ بن رافع رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم بیٹھے تھے، اور ہم لوگ آپ کے اردگرد تھے، اتنے میں ایک شخص آیا اور وہ قبلہ رخ ہو کر نماز پڑھنے لگا، جب وہ اپنی نماز پوری کر چکا تو آیا، اور رسول اللہ صلی اللہ علیہ وسلم اور لوگوں کو سلام کیا، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: تم پر بھی سلامتی ہو، جاؤ پھر سے نماز پڑھو، کیونکہ تم نے نماز نہیں پڑھی ، تو وہ گیا، اور اس نے جا کر پھر سے نماز پڑھی، اور رسول اللہ صلی اللہ علیہ وسلم اس کی نماز کو کنکھیوں سے دیکھ رہے تھے لیکن وہ یہ جان نہیں رہا تھا کہ اس میں وہ کیا غلطی کر رہا ہے؟ تو جب وہ اپنی نماز پوری کر چکا تو آیا، اور اس نے رسول اللہ صلی اللہ علیہ وسلم اور لوگوں کو سلام کیا، رسول اللہ صلی اللہ علیہ وسلم نے پھر اس سے فرمایا: تم پر بھی سلامتی ہو، جاؤ پھر سے نماز پڑھو، کیونکہ تم نے نماز نہیں پڑھی ، چنانچہ اس نے دو یا تین بار نماز دہرائی، پھر اس شخص نے پوچھا: اللہ کے رسول! میری نماز میں آپ نے کیا خامی پائی ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کسی کی نماز پوری نہیں ہوتی جب تک کہ وہ اچھی طرح وضو نہ کر لے جس طرح اللہ تعالیٰ نے اس کے کرنے کا حکم دیا ہے، وہ اپنا چہرہ دھوئے، اپنے دونوں ہاتھ کہنیوں سمیت دھوئے، اپنے سر کا مسح کرے، اور اپنے دونوں پیر ٹخنوں سمیت دھوئے، پھر اللہ تعالیٰ کی بڑائی کرے ( یعنی تکبیر تحریمہ کہے ) اور اس کی حمد و ثناء اور بزرگی بیان کرے ( یعنی دعائے ثناء پڑھے ) ۔ ہمام کہتے ہیں: میں نے اسحاق کو «ويحمد اللہ ويمجده ويكبره» بھی کہتے سنا ہے، وہ کہتے ہیں: میں نے دونوں طرح سے انہیں کہتے سنا ہے۔ آگے آپ صلی اللہ علیہ وسلم نے فرمایا: اور قرآن میں سے حسب توفیق اور مرضی الٰہی جو آسان ہو پڑھے، پھر اللہ اکبر کہے، اور رکوع کرے یہاں تک کہ اس کے تمام جوڑ اپنی جگہ آ جائیں، اور ڈھیلے پڑ جائیں، پھر «سمع اللہ لمن حمده» کہے، پھر سیدھا کھڑا ہو جائے یہاں تک اس کی پیٹھ برابر ہو جائے، پھر اللہ اکبر کہے، اور سجدہ کرے یہاں تک کہ وہ اپنا چہرہ زمین پر ٹکا دے ، ( میں نے اسحاق کو اپنی پیشانی بھی کہتے سنا ہے ) ، اور تمام جوڑ اپنی جگہ آ جائیں اور ڈھیلے پڑ جائیں، پھر اللہ اکبر کہے، اور اپنا سر اٹھائے یہاں تک کہ اپنی سرین پر سیدھا ہو کر بیٹھ جائے، اور اپنی پیٹھ سیدھی کر لے، پھر اللہ اکبر کہے، اور سجدہ کرے یہاں تک کہ وہ اپنا چہرہ زمین سے اچھی طرح ٹکا دے، اور ڈھیلا پڑ جائے، اگر اس نے اس طرح نہیں کیا تو اس کی نماز پوری نہیں ہوئی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 108
			}
		}
	]
}