{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"13": "The Book of Forgetfulness (In Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"text": "معاویہ بن حکم سلمی رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! ہمارا جاہلیت کا زمانہ ابھی ابھی گزرا ہے، پھر اللہ تعالیٰ اسلام کو لے آیا، ہم میں سے کچھ لوگ ایسے ہیں جو برا شگون لیتے ہیں! آپ نے فرمایا: یہ محض ایک خیال ہے جسے لوگ اپنے دلوں میں پاتے ہیں، تو یہ ان کے آڑے نہ آئے ۱؎ معاویہ بن حکم نے کہا: اور ہم میں بعض لوگ ایسے ہیں جو کاہنوں کے پاس جاتے ہیں! تو آپ نے فرمایا: تم لوگ ان کے پاس نہ جایا کرو ، پھر معاویہ رضی اللہ عنہ نے کہا: اللہ کے رسول! اور ہم میں سے کچھ لوگ ( زمین پر یا کاغذ پر آئندہ کی بات بتانے کے لیے ) لکیریں کھینچتے ہیں! آپ نے فرمایا: نبیوں میں سے ایک نبی بھی لکیریں کھینچتے تھے، تو جس شخص کی لکیر ان کے موافق ہو تو وہ صحیح ہے ۔ معاویہ رضی اللہ عنہ کہتے ہیں: میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھ ہی رہا تھا کہ اسی دوران اچانک قوم میں سے ایک آدمی کو چھینک آ گئی، تو میں نے ( زور سے ) «يرحمك اللہ» اللہ تجھ پر رحم کرے کہا، تو لوگ مجھے گھور کر دیکھنے لگے، میں نے کہا: «واثكل أمياه» میری ماں مجھ پر روئے ، تم لوگوں کو کیا ہو گیا ہے کہ تم مجھے گھور رہے ہو؟ لوگوں نے ( مجھے خاموش کرنے کے لیے ) اپنے ہاتھوں سے اپنی رانوں کو تھپتھپایا، جب میں نے انہیں دیکھا کہ وہ مجھے خاموش کر رہے ہیں تو میں خاموش ہو گیا، پھر جب رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو آپ نے مجھے بلایا، میرے ماں باپ آپ پر فدا ہوں، نہ تو آپ نے مجھے مارا، نہ ہی مجھے ڈانٹا، اور نہ ہی برا بھلا کہا، میں نے اس سے پہلے اور اس کے بعد آپ سے اچھا اور بہتر معلم کسی کو نہیں دیکھا، آپ نے فرمایا: ہماری اس نماز میں لوگوں کی گفتگو میں سے کوئی چیز درست نہیں، نماز تو صرف تسبیح، تکبیر اور قرأت قرآن کا نام ہے ، پھر میں اپنی بکریوں کی طرف آیا جنہیں میری باندی احد پہاڑ اور جوانیہ ۲؎ میں چرا رہی تھی، میں ( وہاں ) آیا تو میں نے پایا کہ بھیڑیا ان میں سے ایک بکری اٹھا لے گیا ہے، میں ( بھی ) بنو آدم ہی میں سے ایک فرد ہوں، مجھے ( بھی ) غصہ آتا ہے جیسے انہیں آتا ہے، چنانچہ میں نے اسے ایک چانٹا مارا، پھر میں لوٹ کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، میں نے آپ کو اس واقعہ کی خبر دی، تو آپ نے مجھ پر اس کی سنگینی واضح کی، تو میں نے عرض کیا: اللہ کے رسول! کیا میں اس کو آزاد نہ کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اسے بلاؤ ، تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا: اللہ کہاں ہے؟ اس نے جواب دیا: آسمان کے اوپر، آپ نے پوچھا: میں کون ہوں؟ اس نے کہا: آپ اللہ کے رسول ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: یہ مومنہ ہے، تو تم اسے آزاد کر دو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 40
			}
		}
	]
}