{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"13": "The Book of Forgetfulness (In Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "سائب کہتے ہیں کہ عمار بن یاسر رضی اللہ عنہما نے ہمیں نماز پڑھائی تو اس میں اختصار سے کام لیا، قوم میں سے کچھ لوگوں نے ان سے کہا: آپ نے نماز ہلکی کر دی ہے، راوی کو شک ہے «خففت» کہا یا «أوجزت» ( ہلکی کر دی یا مختصر کر دی ) تو انہوں نے کہا: اس کے باوجود میں نے اس میں ایسی دعائیں پڑھی ہیں جن کو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے، تو جب وہ جانے کے لیے کھڑے ہوئے تو قوم میں سے ایک آدمی ان کے پیچھے ہو لیا ( وہ کوئی اور نہیں میرے والد تھے مگر انہوں نے اپنا نام چھپایا ہے ) ۱؎ اس نے ان سے اس دعا کے بارے میں سوال کیا، پھر آ کر لوگوں کو اس کی خبر دی، وہ دعا یہ تھی: «اللہم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لي وتوفني إذا علمت الوفاة خيرا لي اللہم وأسألك خشيتك في الغيب والشهادة وأسألك كلمة الحق في الرضا والغضب وأسألك القصد في الفقر والغنى وأسألك نعيما لا ينفد وأسألك قرة عين لا تنقطع وأسألك الرضاء بعد القضاء وأسألك برد العيش بعد الموت وأسألك لذة النظر إلى وجهك والشوق إلى لقائك في غير ضراء مضرة ولا فتنة مضلة اللہم زينا بزينة الإيمان واجعلنا هداة مهتدين» اے اللہ! میں تیرے علم غیب اور تمام مخلوق پر تیری قدرت کے واسطہ سے تجھ سے سوال کرتا ہوں کہ تو مجھے اس وقت تک زندہ رکھ جب تک تو جانے کہ زندگی میرے لیے باعث خیر ہے، اور مجھے موت دیدے جب تو جانے کہ موت میرے لیے بہتر ہے، اے اللہ! میں غیب و حضور دونوں حالتوں میں تیری مشیت کا طلب گار ہوں، اور میں تجھ سے خوشی و ناراضگی دونوں حالتوں میں کلمہ حق کہنے کی توفیق مانگتا ہوں، اور تنگ دستی و خوشحالی دونوں میں میانہ روی کا سوال کرتا ہوں، اور میں تجھ سے ایسی نعمت مانگتا ہوں جو ختم نہ ہو، اور میں تجھ سے ایسی آنکھوں کی ٹھنڈک کا طلبگار ہوں جو منقطع نہ ہو، اور میں تجھ سے تیری قضاء پر رضا کا سوال کرتا ہوں، اور میں تجھ سے موت کے بعد کی راحت اور آسائش کا طالب ہوں، اور میں تجھ سے تیرے دیدار کی لذت، اور تیری ملاقات کے شوق کا طالب ہوں، اور پناہ چاہتا ہوں تجھ سے اس مصیبت سے جس پر صبر نہ ہو سکے، اور ایسے فتنے سے جو گمراہ کر دے، اے اللہ! ہم کو ایمان کے زیور سے آراستہ رکھ، اور ہم کو راہ نما اور ہدایت یافتہ بنا دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 127
			}
		}
	]
}