{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"13": "The Book of Forgetfulness (In Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "قیس بن عباد کہتے ہیں کہ عمار بن یاسر رضی اللہ عنہما نے لوگوں کو نماز پڑھائی، اور اسے ہلکی پڑھائی، تو گویا کہ لوگوں نے اسے ناپسند کیا، تو انہوں نے کہا: کیا میں نے رکوع اور سجدے پورے پورے نہیں کیے ہیں؟ لوگوں نے کہا: کیوں نہیں، ضرور کیا ہے، پھر انہوں نے کہا: سنو! میں نے اس میں ایسی دعا پڑھی ہے جس کو نبی اکرم صلی اللہ علیہ وسلم پڑھا کرتے تھے وہ یہ ہے: «‏اللہم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لي وتوفني إذا علمت الوفاة خيرا لي وأسألك خشيتك في الغيب والشهادة وكلمة الإخلاص في الرضا والغضب وأسألك نعيما لا ينفد وقرة عين لا تنقطع وأسألك الرضاء بالقضاء وبرد العيش بعد الموت ولذة النظر إلى وجهك والشوق إلى لقائك وأعوذ بك من ضراء مضرة وفتنة مضلة اللہم زينا بزينة الإيمان واجعلنا هداة مهتدين» اے اللہ! میں تیرے علم غیب اور تمام مخلوق پر تیری قدرت کے واسطہ سے تجھ سے سوال کرتا ہوں کہ تو مجھے اس وقت تک زندہ رکھ جب تک تو جانے کہ زندگی میرے لیے باعث خیر ہے، اور مجھے موت دیدے جب تو جانے کہ موت میرے لیے بہتر ہے، اے اللہ! میں غیب و حضور دونوں حالتوں میں تیری خشیت کا طلب گار ہوں، اور میں تجھ سے خوشی و ناراضگی دونوں حالتوں میں کلمہ اخلاص کی توفیق مانگتا ہوں، اور میں تجھ سے ایسی نعمت مانگتا ہوں جو ختم نہ ہو، اور میں تجھ سے ایسی آنکھوں کی ٹھنڈک کا طلبگار ہوں جو منقطع نہ ہو، اور میں تجھ سے تیری قضاء پر رضا کا سوال کرتا ہوں، اور میں تجھ سے موت کے بعد کی راحت اور آسائش کا طلبگار ہوں، اور میں تجھ سے تیرے دیدار کی لذت، اور تیری ملاقات کے شوق کا طلبگار ہوں، اور پناہ چاہتا ہوں تیری اس مصیبت سے جس پر صبر نہ ہو سکے، اور ایسے فتنے سے جو گمراہ کر دے، اے اللہ! ہم کو ایمان کے زیور سے آراستہ رکھ، اور ہم کو راہنما و ہدایت یافتہ بنا دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 128
			}
		}
	]
}