{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"22": "The Book of Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2091,
			"arabicnumber": 2091,
			"text": "انس رضی الله عنہ کہتے ہیں: ہمیں قرآن کریم میں نبی اکرم صلی اللہ علیہ وسلم سے لایعنی بات پوچھنے سے منع کیا گیا تھا، تو ہمیں یہ بات اچھی لگتی کہ دیہاتیوں میں سے کوئی عقلمند شخص آئے، اور آپ سے نئی نئی باتیں پوچھے، چنانچہ ایک دیہاتی آیا، اور کہنے لگا: اے محمد! ہمارے پاس آپ کا قاصد آیا، اور اس نے ہمیں بتایا کہ آپ کہتے ہیں کہ اللہ تعالیٰ نے آپ کو بھیجا ہے؟ آپ نے فرمایا: ”اس نے سچ کہا“، اس نے پوچھا: آسمان کو کس نے پیدا کیا؟ آپ نے کہا: ”اللہ تعالیٰ نے“ ( پھر ) اس نے پوچھا: زمین کو کس نے پیدا کیا؟ آپ نے کہا: ”اللہ نے“ ( پھر ) اس نے پوچھا: اس میں پہاڑ کو کس نے نصب کیے ہیں؟ آپ نے کہا: ”اللہ تعالیٰ نے“ ( پھر ) اس نے پوچھا: اس میں نفع بخش ( چیزیں ) کس نے بنائیں؟ آپ نے کہا: ”اللہ تعالیٰ نے“ ( پھر ) اس نے کہا: قسم اس ذات کی جس نے آسمان اور زمین کو پیدا کیا، اور اس میں پہاڑ نصب کیے، اور اس میں نفع بخش ( چیزیں ) بنائیں کیا آپ کو اللہ تعالیٰ نے بھیجا ہے؟ آپ نے کہا: ”ہاں“، پھر اس نے کہا: اور آپ کے قاصد نے کہا ہے کہ ہمارے اوپر ہر روز دن اور رات میں پانچ وقت کی نماز فرض ہے؟ آپ نے فرمایا: ”اس نے سچ کہا“، تو اس نے کہا: قسم ہے اس ذات کی جس نے آپ کو بھیجا! کیا اللہ تعالیٰ نے آپ کو ان ( نمازوں ) کا حکم دیا ہے؟ آپ نے کہا: ہاں، ( پھر ) اس نے کہا: آپ کے قاصد نے کہا ہے کہ ہم پر اپنے مالوں کی زکاۃ فرض ہے؟ آپ نے فرمایا: اس نے سچ کہا، ( پھر ) اس نے کہا: قسم اس ذات کی جس نے آپ کو بھیجا! کیا آپ کو اللہ تعالیٰ نے اس کا حکم دیا ہے؟ آپ نے کہا: ”ہاں“، ( پھر ) اس نے کہا: آپ کے قاصد نے کہا ہے: ہم پر ہر سال ماہ رمضان کے روزے فرض ہیں، آپ نے کہا: ”اس نے سچ کہا“ ( پھر ) اس نے کہا: کیا اللہ تعالیٰ نے آپ کو ان ( دنوں کے روزوں ) کا حکم دیا ہے؟ آپ نے کہا: ”ہاں“، ( پھر ) اس نے کہا: آپ کے قاصد نے کہا ہے: ہم میں سے جو کعبہ تک جانے کی طاقت رکھتے ہوں، ان پر حج فرض ہے؟ آپ نے فرمایا: ”اس نے سچ کہا“، اس نے کہا: قسم اس ذات کی جس نے آپ کو بھیجا! کیا اللہ تعالیٰ نے آپ کو اس کا حکم دیا ہے؟ آپ نے فرمایا: ”ہاں“، تو اس نے کہا: قسم اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا فرمایا: میں ہرگز نہ اس میں کچھ بڑھاؤں گا اور نہ گھٹاؤں گا، جب وہ لوٹا تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اگر اس نے سچ کہا ہے تو یہ ضرور جنت میں داخل ہو گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 2
			}
		}
	]
}