{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"25": "The Book of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3149,
			"arabicnumber": 3149,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ جنگ احد کے دن جب لوگ پیٹھ پھیر کر بھاگ کھڑے ہوئے، ( اس وقت ) رسول اللہ صلی اللہ علیہ وسلم بارہ انصاری صحابہ کے ساتھ ایک طرف موجود تھے انہیں میں ایک طلحہ بن عبیداللہ رضی اللہ عنہ بھی تھے ۱؎۔ مشرکین نے انہیں ( تھوڑا دیکھ کر ) گھیر لیا تو رسول اللہ صلی اللہ علیہ وسلم نے ان کی طرف دیکھا اور فرمایا: ”ہماری طرف سے کون لڑے گا“؟ طلحہ رضی اللہ عنہ نے کہا: اللہ کے رسول! میں ( آپ کا دفاع کروں گا ) ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم جیسے ہو ویسے ہی رہو“ تو ایک دوسرے انصاری صحابی نے کہا: اللہ کے رسول! میں ( دفاع کیلئے تیار ہوں ) ۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تم ( لڑو ان سے ) تو وہ لڑے یہاں تک کہ شہید کر دیئے گئے“۔ پھر آپ نے مڑ کر ( سب پر ) ایک نظر ڈالی تو مشرکین موجود تھے آپ نے پھر آواز لگائی: ”قوم کی کون حفاظت کرے گا“؟ طلحہ رضی اللہ عنہ ( پھر ) بولے: میں حفاظت کروں گا، آپ نے فرمایا: ” ( تم ٹھہرو ) تم جیسے ہو ویسے ہی رہو“، تو دوسرے انصاری صحابی نے کہا: اللہ کے رسول! میں قوم کی حفاظت کروں گا، آپ نے فرمایا: ”تم ( لڑو ان سے ) “ پھر وہ صحابی ( مشرکین سے ) لڑے اور شہید ہو گئے۔ پھر آپ صلی اللہ علیہ وسلم برابر ایسے ہی پکارتے رہے اور کوئی نہ کوئی انصاری صحابی ان مشرکین کے مقابلے کے لیے میدان میں اترتا اور نکلتا رہا اور اپنے پہلوں کی طرح لڑ لڑ کر شہید ہوتا رہا۔ یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم اور طلحہ بن عبیداللہ ہی باقی رہ گئے۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے آواز لگائی۔ ”قوم کی کون حفاظت کرے گا“؟ طلحہ رضی اللہ عنہ نے ( پھر ) کہا: میں کروں گا ( یہ کہہ کر ) پہلے گیارہ ( شہید ساتھیوں ) کی طرح مشرکین سے جنگ کرنے لگ گئے۔ ( اور لڑتے رہے ) یہاں تک کہ ہاتھ پر ایک کاری ضرب لگی اور انگلیاں کٹ کر گر گئیں۔ انہوں نے کہا: «حس» رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم ( «حس» کے بجائے ) «بسم اللہ» کہتے تو فرشتے تمہیں اٹھا لیتے اور لوگ دیکھ رہے ہوتے“، پھر اللہ تعالیٰ نے مشرکین کو واپس کر دیا ( یعنی وہ مکہ لوٹ گئے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 65
			}
		}
	]
}