{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"25": "The Book of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3171,
			"arabicnumber": 3171,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب قباء جاتے تو ام حرام بنت ملحان رضی اللہ عنہا کے یہاں بھی جاتے، وہ آپ کو کھانا کھلاتیں۔ ام حرام بنت ملحان رضی اللہ عنہا عبادہ بن صامت رضی اللہ عنہ کی بیوی تھیں، ایک دن رسول اللہ صلی اللہ علیہ وسلم ان کے یہاں تشریف لے گئے تو انہوں نے آپ کو کھانا کھلایا اور آپ کے سر کی جوئیں دیکھنے بیٹھ گئیں۔ آپ سو گئے، پھر جب اٹھے تو ہنستے ہوئے اٹھے، کہتی ہیں: میں نے عرض کیا: اللہ کے رسول! آپ کو کس چیز نے ہنسایا؟ آپ نے فرمایا: ” ( خواب میں ) مجھے میری امت کے کچھ مجاہدین دکھائے گئے وہ اس سمندر کے سینے پر سوار تھے، تختوں پر بیٹھے ہوئے بادشاہ لگتے تھے“، یا تختوں پر بیٹھے ہوئے بادشاہوں جیسے لگتے تھے۔ ( اس جگہ اسحاق راوی کو شک ہو گیا ہے ( کہ ان کے استاد نے «ملوك على الأسرة» کہا، یا «مثل الملوك على الأسرة» کہا ) ۔ میں نے کہا: اللہ کے رسول! اللہ تعالیٰ سے دعا کیجئے کہ وہ مجھے بھی انہیں لوگوں میں سے کر دے تو رسول اللہ صلی اللہ علیہ وسلم نے ان کے لیے دعا فرما دی، پھر آپ سو گئے۔ ( اور حارث کی روایت میں یوں ہے۔ آپ سوئے ) پھر جاگے، پھر ہنسے پھر میں نے آپ سے کہا: اللہ کے رسول! آپ کے ہنسنے کی وجہ کیا ہے؟ آپ نے ( جیسے اس سے پہلے فرمایا تھا ) فرمایا: ”مجھے میری امت کے کچھ لوگ اللہ کے راستے میں جہاد کرتے ہوئے دکھائے گئے وہ تختوں پر بیٹھے بادشاہ تھے، یا تختوں پر بیٹھے بادشاہوں جیسے لگتے تھے۔ میں نے کہا: اللہ کے رسول! دعا فرمائیے کہ اللہ مجھے بھی انہیں لوگوں میں شامل فرمائے، آپ نے فرمایا: تم ( سمندر میں جہاد کرنے والوں کے ) پہلے گروپ میں ہو گی۔ ( انس بن مالک راوی حدیث فرماتے ہیں ) پھر وہ معاویہ رضی اللہ عنہ کے زمانہ میں سمندری سفر پر جہاد کے لیے نکلیں تو وہ سمندر سے نکلتے وقت اپنی سواری سے گر کر ہلاک ہو گئیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 87
			}
		}
	]
}