{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"26": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3253,
			"arabicnumber": 3253,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں تمام امور ( و معاملات ) میں استخارہ کرنے کی تعلیم دیتے تھے، جیسا کہ ہمیں قرآن کی سورتیں سکھاتے تھے، فرماتے: جب تم میں سے کوئی کسی ( اچھے ) کام کا ارادہ کرے تو فرض ( اور اس کے توابع ) کے علاوہ دو رکعتیں پڑھے پھر ( دعا کرتے ہوئے ) کہے: «اللہم إني أستخيرك بعلمك وأستعينك بقدرتك وأسألك من فضلك العظيم فإنك تقدر ولا أقدر وتعلم ولا أعلم وأنت علام الغيوب اللہم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري – أو قال في عاجل أمري وآجله – فاقدره لي ويسره لي ثم بارك لي فيه وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري – أو قال في عاجل أمري وآجله – فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم أرضني به» ”اے اللہ! میں تیرے علم کی برکت سے تجھ سے بھلائی اور خیر کا طالب ہوں اور تیری قدرت کا واسطہ دے کر تیری مدد کا چاہتا ہوں اور تیرے عظیم فضل کا طالب ہوں کیونکہ تو قدرت والا ہے، میں قدرت والا نہیں، تو ( اچھا و برا سب ) جانتا ہے، میں نہیں جانتا، تو ہی غیب کی باتوں کو جانتا ہے، اللہ! اگر تو جانتا ہے کہ یہ معاملہ، ( پھر متعلق کام یا چیز کا نام لے ) میرے لیے میرے دین، دنیا اور کے اعتبار سے، یا یہ کہا: اس دار فانی اور اخروی زندگی کے اعتبار سے بہتر ہے تو اس کام کو میرے لیے مقدر کر دے اور اس کا حصول میرے لیے آسان کر دے اور مجھے اس میں برکت دے۔ اور اگر تو جانتا اور سمجھتا ہے کہ یہ کام میرے لیے برا ہے، میرے دین، دنیا اور انجام کار کے لحاظ سے یا اس دار فانی اور اخروی زندگی کے لحاظ سے تو اس کام کو مجھ سے دور رکھ اور مجھے اس سے بچا لے۔ اور بھلائی جہاں بھی ہو اسے میرے لیے مقدر فرما دے اور مجھے اس پر راضی و خوش رکھ“۔ آپ نے فرمایا: ” ( دعا کرتے وقت ) اپنی ضرورت کا نام لے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 58
			}
		}
	]
}