{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"26": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3346,
			"arabicnumber": 3346,
			"text": "عروہ بن زبیر کہتے ہیں کہ انہوں نے ( ام المؤمنین ) عائشہ رضی اللہ عنہا سے اللہ تعالیٰ کے فرمان: «وإن خفتم أن لا تقسطوا في اليتامى فانكحواء ما طاب لكم من النساء» ”اگر تمہیں ڈر ہو کہ یتیم لڑکیوں سے نکاح کر کے تم انصاف نہ رکھ سکو گے، تو اور عورتوں میں سے جو بھی تمہیں اچھی لگیں تم ان سے نکاح کر لو ( النساء: ۳ ) کے بارے میں سوال کیا تو عائشہ رضی اللہ عنہا نے کہا: بھانجے! اس سے وہ یتیم لڑکی مراد ہے جو اپنے ایسے ولی کی پرورش میں ہو جس کے مال میں وہ ساجھی ہو اور اس کی خوبصورتی اور اس کا مال اسے بھلا لگتا ہو، اس کی وجہ سے وہ اس سے بغیر مناسب مہر ادا کیے نکاح کرنا چاہتا ہو یعنی جتنا مہر اس کو اور کوئی دیتا اتنا بھی نہ دے رہا ہو، چنانچہ انہیں ان سے نکاح کرنے سے روک دیا گیا۔ اگر وہ انصاف سے کام لیں اور انہیں اونچے سے اونچا مہر ادا کریں تو نکاح کر سکتے ہیں ورنہ فرمان رسول ہے کہ ان کے علاوہ جو عورتیں انہیں پسند ہوں ان سے نکاح کر لیں۔ عروہ کہتے ہیں: عائشہ رضی اللہ عنہا نے کہا: لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے ان یتیم بچیوں کے متعلق مسئلہ پوچھا تو اللہ نے آیت «ويستفتونك في النساء قل اللہ يفتيكم فيهن» سے لے کر «وترغبون أن تنكحوهن» ”آپ سے عورتوں کے بارے میں حکم پوچھتے ہیں آپ کہہ دیجئیے کہ خود اللہ تعالیٰ ان کے بارے میں حکم دے رہا ہے، اور قرآن کی وہ آیتیں جو تم پر ان یتیم لڑکیوں کے بارے میں پڑھی جاتی ہیں جنہیں ان کا مقرر حق تم نہیں دیتے، اور انہیں اپنے نکاح میں لانے کی رغبت رکھتے ہو ( النساء: ۱۲۷ ) تک نازل فرمائی۔ عائشہ رضی اللہ عنہا فرماتی ہیں: پچھلی آیت میں اللہ تعالیٰ نے «وما يتلى عليك في الكتاب» جو فرمایا ہے اس سے پہلی آیت: «وإن خفتم أن لا تقسطوا في اليتامى فانكحواء ما طاب لكم من النساء» مراد ہے۔ اور دوسری آیت میں فرمایا: «وترغبون أن تنكحوهن» تو اس کا مطلب یہ ہے کہ جو یتیم لڑکی تمہاری نگہداشت و پرورش میں ہوتی ہے اور کم مال والی اور کم خوبصورتی والی ہوتی ہے اسے تو تم نہیں چاہتے تو اس کی بنا پر تمہیں ان یتیم لڑکیوں سے بھی شادی کرنے سے روک دیا گیا ہے جن کا مال پانے کی خاطر تم ان سے شادی کرنے کی خواہش رکھتے ہو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 151
			}
		}
	]
}