{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"26": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3380,
			"arabicnumber": 3380,
			"text": "انس رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم خیبر فتح کرنے کے ارادے سے نکلے، ہم نے نماز فجر خیبر کے قریب اندھیرے ہی میں پڑھی پھر نبی اکرم صلی اللہ علیہ وسلم سوار ہوئے اور ابوطلحہ رضی اللہ عنہ بھی سوار ہوئے اور میں ابوطلحہ کی سواری پر ان کے پیچھے بیٹھا، جب نبی اکرم صلی اللہ علیہ وسلم خیبر کے تنگ راستے سے گزرنے لگے تو میرا گھٹنا آپ صلی اللہ علیہ وسلم کی ران سے چھونے اور ٹکرانے لگا، ( اور یہ واقعہ میری نظروں میں اس طرح تازہ ہے گویا کہ ) میں آپ صلی اللہ علیہ وسلم کی ران کی سفیدی ( و چمک ) دیکھ رہا ہوں، جب آپ بستی میں داخل ہوئے تو تین بار کہا: «اللہ أكبر خربت خيبر إنا إذا نزلنا بساحة قوم فساء صباح المنذرين» ”اللہ بہت بڑا ہے، خیبر کی بربادی آئی، جب ہم کسی قوم کی آبادی ( و حدود ) میں داخل ہو جاتے ہیں تو اس پر ڈرائی گئی قوم کی بدبختی کی صبح نمودار ہو جاتی ہے ۱؎۔ انس رضی اللہ عنہ کہتے ہیں: ( جب ہم خیبر میں داخل ہوئے ) لوگ اپنے کاموں پر جانے کے لیے نکل رہے تھے۔ ( عبدالعزیز بن صہیب کہتے ہیں: ) لوگ کہنے لگے: محمد ( آ گئے ) ہیں ( اور بعض کی روایت میں «الخمیس» ۲؎ کا لفظ آیا ہے ) یعنی لشکر آ گیا ہے۔ ( بہرحال ) ہم نے خیبر طاقت کے زور پر فتح کر لیا، قیدی اکٹھا کئے گئے، دحیہ کلبی نے آ کر کہا: اللہ کے نبی! ایک قیدی لونڈی مجھے دے دیجئیے؟ آپ نے فرمایا: جاؤ ایک لونڈی لے لو، تو انہوں نے صفیہ بنت حیی رضی اللہ عنہا کو لے لیا۔ ( ان کے لے لینے کے بعد ) ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور عرض کیا: اللہ کے نبی! آپ نے دحیہ کو صفیہ بنت حیی کو دے دیا، وہ بنو قریظہ اور بنو نضیر گھرانے کی سیدہ ( شہزادی ) ہے، وہ تو صرف آپ کے لیے موزوں و مناسب ہے۔ آپ نے فرمایا: ”اسے ( دحیہ کو ) بلاؤ، اسے ( صفیہ کو ) لے کر آئیں“، جب وہ انہیں لے کر آئے اور نبی اکرم صلی اللہ علیہ وسلم نے انہیں ایک نظر دیکھا تو فرمایا: ”تم انہیں چھوڑ کر کوئی دوسری باندی لے لو“۔ انس رضی اللہ عنہ کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم نے انہیں آزاد کر کے ان سے شادی کر لی، ثابت نے ان سے ( یعنی انس سے ) پوچھا: اے ابوحمزہ! آپ صلی اللہ علیہ وسلم نے انہیں کتنا مہر دیا تھا؟ انہوں نے کہا: آپ نے انہیں آزاد کر دیا اور ان سے شادی کر لی ( یہی آزادی ان کا مہر تھا ) ۔ انس رضی اللہ عنہ کہتے ہیں: آپ راستے ہی میں تھے کہ ام سلیم رضی اللہ عنہا نے صفیہ کو آراستہ و پیراستہ کر کے رات میں رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچا دیا۔ آپ نے صبح ایک دولہے کی حیثیت سے کی اور فرمایا: ”جس کے پاس جو کچھ ( کھانے کی چیز ) ہو وہ لے آئے“، چمڑا ( دستر خوان ) بچھا یا گیا۔ کوئی پنیر لایا، کوئی کھجور اور کوئی گھی لایا اور لوگوں نے سب کو ملا کر ایک کر دیا ( اور سب نے مل کر کھایا ) یہی رسول اللہ صلی اللہ علیہ وسلم کا ولیمہ تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 185
			}
		}
	]
}