{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3402,
			"arabicnumber": 3402,
			"text": "سہل بن سعد ساعدی رضی الله عنہ سے روایت ہے کہ عویمر عجلانی رضی اللہ عنہ نے عاصم بن عدی رضی اللہ عنہ کے پاس آ کر کہا: عاصم! بتاؤ اگر کوئی شخص اپنی بیوی کے ساتھ کسی غیر آدمی کو پائے تو کیا وہ اسے قتل کر دے؟ ( وہ قتل کر دے ) تو لوگ اسے اس کے بدلے میں قتل کر دیں گے! بتاؤ وہ کیا اور کیسے کرے؟ عاصم! اس کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے پوچھ کر مجھے بتاؤ، عاصم نے رسول اللہ صلی اللہ علیہ وسلم سے ( یہ مسئلہ ) پوچھا، تو رسول اللہ صلی اللہ علیہ وسلم کو اس طرح کے سوالات برے لگے اور آپ نے اسے ناپسند فرمایا ۱؎، عاصم رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کی گفتگو بڑی گراں گزری ۲؎، جب عاصم رضی اللہ عنہ لوٹ کر اپنے گھر والوں کے پاس آئے تو عویمر رضی اللہ عنہ ان کے پاس آئے اور کہا: عاصم! رسول اللہ صلی اللہ علیہ وسلم نے تم سے کیا فرمایا؟ عاصم رضی اللہ عنہ نے عویمر رضی اللہ عنہ سے کہا: تم نے مجھے کوئی اچھی بات نہیں سنائی، جو مسئلہ تم نے پوچھا تھا اسے رسول اللہ صلی اللہ علیہ وسلم نے ناپسند فرمایا۔ عویمر رضی اللہ عنہ نے کہا: قسم اللہ کی! یہ مسئلہ تو میں رسول اللہ صلی اللہ علیہ وسلم سے پوچھ کر رہوں گا، ( یہ کہہ کر ) عویمر رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی طرف روانہ ہو گئے اور آپ جہاں لوگوں کے درمیان بیٹھے ہوئے تھے وہاں پہنچ کر کہا: اللہ کے رسول! آپ بتائیے ایک شخص اپنی بیوی کو غیر مرد کے ساتھ پائے تو کیا وہ اسے قتل کر دے؟ ( اگر وہ اسے قتل کر دے ) تو آپ لوگ اسے ( اس کے بدلے میں ) قتل کر ڈالیں گے! ( ایسی صورت حال پیش آ جائے ) تو وہ کیا کرے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تمہارے اور تمہاری بیوی کے معاملے میں قرآن نازل ہوا ہے، جاؤ اور اپنی بیوی کو لے کر آؤ“، سہل رضی اللہ عنہ کہتے ہیں: ( وہ لے کر آئے ) پھر دونوں ( یعنی عویمر اور اس کی بیوی نے ) لعان کیا، میں بھی اس وقت لوگوں کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھا۔ پھر جب عویمر رضی اللہ عنہ لعان سے فارغ ہوئے تو کہا: اللہ کے رسول! اگر میں نے ( اس لعان کے بعد ) اس کو اپنے گھر رکھا تو اس کا مطلب یہ ہو گا کہ میں جھوٹا ہوں ( اور میں نے اس پر تہمت لگائی ہے ) یہ کہہ کر انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے حکم سے پہلے اسے ( دھڑا دھڑ ) تین طلاقیں دے دیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		}
	]
}