{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3473,
			"arabicnumber": 3473,
			"text": "سعید بن جبیر کہتے ہیں کہ مجھ سے عبداللہ بن زبیر رضی اللہ عنہما کی امارت کے زمانہ میں دو لعان کرنے والوں کے بارے میں پوچھا گیا ( کہ جب وہ دونوں لعان کر چکیں گے تو ) کیا ان دونوں کے درمیان تفریق ( جدائی ) کر دی جائے گی؟ میری سمجھ میں نہ آیا کہ میں کیا جواب دوں، میں اپنی جگہ سے اٹھا اور ابن عمر رضی اللہ عنہما کے گھر چلا گیا، میں نے کہا: ابوعبدالرحمٰن! کیا دونوں لعان کرنے والوں کے درمیان تفریق کرا دی جائے گی؟ انہوں نے کہا: ہاں، سبحان اللہ، پاک و برتر ہے ذات اللہ کی۔ سب سے پہلے اس بارے میں فلاں ابن فلاں نے مسئلہ پوچھا تھا ( ابن عمر رضی اللہ عنہما نے ان کا نام نہیں لیا ) اس آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے کہا: اللہ کے رسول! ( «ارأیت» عمرو بن علی جو اس حدیث کے ایک راوی ہیں انہوں نے اپنی روایت میں «ارأیت» کا لفظ نہیں استعمال کیا ہے ) ، آپ بتائیے ہم میں سے کوئی شخص کسی شخص کو اپنی بیوی کے ساتھ بدکاری کرتے ہوئے دیکھے ( تو کیا کرے؟ ) اگر وہ زبان کھولتا ہے تو بڑی بات کہتا ہے ۱؎ اور اگر وہ چپ رہتا ہے تو بھی وہ ایسی بڑی اور بری بات پر چپ رہتا ہے ( جو ناقابل برداشت ہے ) ، آپ صلی اللہ علیہ وسلم نے اسے کوئی جواب نہ دیا ( اس روایت میں ـ «فأمر عظیم» کے الفاظ آئے ہیں، یہ اس روایت کے ایک راوی محمد بن مثنیٰ کے الفاظ ہیں، اس روایت کے دوسرے راوی عمرو بن علی نے اس کے بجائے «اتی امراً عظیماً» کے الفاظ استعمال کیے ہیں ) ۔ پھر جب اس کے بعد ایسا واقعہ پیش آ گیا تو وہ شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا: جس بارے میں، میں نے آپ سے مسئلہ پوچھا تھا میں خود ہی اس سے دوچار ہو گیا، ( اس وقت ) اللہ تعالیٰ نے سورۃ النور کی یہ آیت: «والذين يرمون أزواجهم» سے لے کر «والخامسة أن غضب اللہ عليها إن كان من الصادقين» تک نازل فرمائیں، ( اس کارروائی کا ) آغاز آپ نے مرد کو وعظ و نصیحت سے کیا، آپ نے اسے بتایا کہ دنیا کا عذاب آخرت کے عذاب کے مقابل میں ہلکا، آسان اور کم تر ہے۔ اس شخص نے کہا: قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ہے، میں نے جھوٹ نہیں کہا ہے، پھر آپ نے عورت کو بھی خطاب کیا، آپ نے اسے بھی وعظ و نصیحت کی، ڈرایا اور آخرت کے سخت عذاب کا خوف دلایا۔ اس نے بھی کہا: قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ہے یہ شخص جھوٹا ہے۔ ( اس وعظ و نصیحت کے بعد لعان کی کارروائی روبہ عمل آئی ) تو آپ نے ( یہ کارروائی ) مرد سے شروع کی۔ اس نے اللہ کا نام لے کر چار گواہیاں دیں کہ وہ سچے لوگوں میں سے ہے اور پانچویں بار اس نے کہا کہ اس پر اللہ کی لعنت ہو اگر وہ جھوٹوں میں سے ہو۔ پھر آپ نے عورت سے گواہی لینی شروع کی، اس نے بھی اللہ کا نام لے کر چار گواہیاں دیں کہ وہ ( شوہر ) جھوٹوں میں سے ہے اور اس نے پانچویں بار کہا: اس پر ( یعنی مجھ پر ) اللہ کا غضب نازل ہو اگر وہ ( شوہر ) سچوں میں سے ہو۔ پھر آپ نے ان دونوں کے درمیان جدائی کرا دی ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 85
			}
		}
	]
}