{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"32": "The Book of Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3688,
			"arabicnumber": 3688,
			"text": "عبداللہ بن عمرو بن عاص رضی الله عنہما کہتے ہیں کہ جب ہوازن کا وفد رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو ہم آپ کے پاس تھے۔ انہوں نے کہا: اے محمد! ہم ایک ہی اصیل اور خاندانی لوگ ہیں اور ہم پر جو بلا اور مصیبت نازل ہوئی ہے وہ آپ سے پوشیدہ نہیں، آپ ہم پر احسان کیجئے، اللہ آپ پر احسان فرمائے گا۔ آپ نے فرمایا: ”اپنے مال یا اپنی عورتوں اور بچوں میں سے کسی ایک کو چن لو“، تو ان لوگوں نے کہا: آپ نے ہمیں اپنے خاندان والوں اور اپنے مال میں سے کسی ایک کے چن لینے کا اختیار دیا ہے تو ہم اپنی عورتوں اور بچوں کو حاصل کر لینا چاہتے ہیں، اس پر آپ نے فرمایا: ”میرے اور بنی مطلب کے حصے میں جو ہیں انہیں میں تمہیں واپس دے دیتا ہوں اور جب میں ظہر سے فارغ ہو جاؤں تو تم لوگ کھڑے ہو جاؤ اور کہو: ہم رسول اللہ صلی اللہ علیہ وسلم کے واسطہ سے آپ سارے مسلمانوں اور مومنوں سے اپنی عورتوں اور بچوں کے سلسلہ میں مدد کے طلب گار ہیں“۔ چنانچہ جب لوگ ظہر پڑھ چکے تو یہ لوگ کھڑے ہوئے اور انہوں نے یہی بات دہرائی، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو میرا اور بنی عبدالمطلب کا حصہ ہے وہ تمہارے حوالے ہے“، یہ بات سن کر مہاجرین نے کہا: جو ہمارے حصے میں ہے وہ رسول اللہ صلی اللہ علیہ وسلم کے سپرد، اور انصار نے بھی کہا: جو ہمارے حصہ میں ہے وہ بھی رسول اللہ صلی اللہ علیہ وسلم کے سپرد، اس پر اقرع بن حابس رضی اللہ عنہ نے کہا: میں اور بنو تمیم تو اپنا حصہ واپس نہیں کر سکتے۔ عیینہ بن حصن رضی اللہ عنہ نے بھی کہا کہ میں اور بنو فزارہ بھی اپنا حصہ دینے کے نہیں۔ عباس بن مرداس رضی اللہ عنہ نے کہا: میں اور بنو سلیم بھی اپنا حصہ نہیں لوٹانے کے۔ ( یہ سن کر ) قبیلہ بنو سلیم کے لوگ کھڑے ہوئے اور کہا: تم غلط کہتے ہو، ہمارا حصہ بھی رسول اللہ صلی اللہ علیہ وسلم کے حوالے ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”لوگو! ان کی عورتوں اور بچوں کو انہیں واپس کر دو اور جو کوئی بغیر کسی بدلے نہ دینا چاہے تو اس کے لیے میرا وعدہ ہے کہ مال فیٔ میں سے جو اللہ تعالیٰ پہلے عطا کر دے گا میں اس کے ہر گردن ( غلام ) کے بدلے چھ اونٹ ملیں گے“، یہ فرما کر آپ اپنی سواری پر سوار ہو گئے، اور لوگوں نے آپ کو گھیر لیا ( اور کہنے لگے: ) ہمارے حصہ کا مال غنیمت ہمیں بانٹ دیجئیے، اور آپ کو ایک درخت کا سہارا لینے پر مجبور کر دیا جس سے آپ کی چادر الجھ کر آپ سے الگ ہو گئی تو آپ نے فرمایا: ”لوگو! میری چادر تو واپس لا دو، قسم اللہ کی! اگر تمہارے لیے تہامہ کے درختوں کے برابر اونٹ بھی ہوں تو میں انہیں تم میں تقسیم کر دوں گا، تم لوگ مجھے بخیل، بزدل اور جھوٹا نہیں پاؤ گے، پھر ایک اونٹ کے پاس آئے اور اپنی انگلیوں کے درمیان اس کے کوہان سے بالوں کا ایک گچھا لے کر کہنے لگے: سن لو! فیٔ میں سے میرا کچھ نہیں ہے اور یہ بھی نہیں ہے ( اونٹ کے بالوں کی طرف اشارہ کر کے کہا ) سوائے خمس ( ۱/۵ ) کے اور خمس بھی ( گھوم پھر کر ) تمہیں لوگوں کو لوٹا دیا جاتا ہے“۔ یہ بات سن کر ایک آدمی بالوں کا ایک گچھا لے کر آپ کے پاس آ کھڑا ہوا، اس نے کہا: اللہ کے رسول! میں نے بالوں کا یہ گچھا لیا ہے تاکہ اس سے اپنے اونٹ کی ( پھٹے ہوئے ) پالان ( گدے ) کو درست کر لوں، آپ نے فرمایا: ”میرا اور بنی مطلب کا جو حصہ ہے وہ تمہارے لیے ہے“ اس شخص نے کہا: کیا یہ اس حد تک سنگین اور اہم معاملہ ہے؟ تو مجھے اس سے کچھ نہیں لینا دینا، یہ کہہ کر اس نے بالوں کا گچھا مال فیٔ میں ڈال دیا، اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگو! ”سوئی اور دھاگا بھی لا کر جمع کرو، کیونکہ مال غنیمت میں چوری اور خیانت قیامت کے دن چوری اور خیانت کرنے والے کے لیے شرم و ندامت کا باعث ہو گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		}
	]
}