{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"36": "The Book of the Kind Treatment of Women"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3964,
			"arabicnumber": 3964,
			"text": "محمد بن قیس بن مخرمہ کہتے ہیں کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا کو کہتے ہوئے سنا: کیا میں تم سے نبی اکرم صلی اللہ علیہ وسلم کا اور اپنا ایک واقعہ نہ بیان کروں؟ ہم نے عرض کیا: کیوں نہیں؟ وہ بولیں: جس رات میری باری تھی، نبی اکرم صلی اللہ علیہ وسلم میرے یہاں تھے، آپ عشاء سے لوٹے اور جوتے اپنے پیروں کے پاس رکھ لیے، اپنی چادر رکھی اور بستر پر تہبند بچھایا، ابھی تھوڑی ہی دیر ہوئی تھی جب آپ کو اندازہ ہوا کہ میں سو چکی ہوں، آپ نے آہستہ سے جوتے پہنے اور آہستہ سے چادر لی پھر دھیرے سے دروازہ کھولا اور باہر نکل کر دھیرے سے بھیڑ دیا، میں نے بھی اوڑھنی اپنے سر پر ڈالی، چادر اوڑھی، پھر تہبند پہن کر آپ کے پیچھے پیچھے چل پڑی، یہاں تک کہ آپ مقبرہ بقیع آئے، تو آپ نے اپنے ہاتھ تین بار اٹھائے، قیام کو طویل کیا پھر پلٹے تو میں بھی پلٹی، اور تیزی سے چلے، میں بھی تیزی سے چلی، پھر آپ نے رفتار کچھ اور تیز کر دی تو میں نے بھی رفتار تیز کر دی پھر آپ دوڑنے لگے تو میں بھی دوڑنے لگی اور میں آپ سے آگے نکل گئی اور اندر داخل ہو گئی اور اب میں لیٹی ہی تھی کہ آپ اندر آ گئے اور فرمایا: ”کیا بات ہے عائشہ! پیٹ کیسا پھولا ہے، تمہاری سانسیں کیوں پھول رہی ہیں؟ بتاؤ ورنہ مجھے لطیف و خبیر یعنی اللہ تعالیٰ بتا دے گا“۔ میں نے کہا: اللہ کے رسول! میرے ماں باپ آپ پر قربان ہوں، پھر انہوں نے آپ کو پورا واقعہ بتایا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تو تمہارا ہی سایہ تھا جو میں نے اپنے آگے دیکھا؟“ میں نے کہا: ہاں، پھر آپ نے میرے سینے پر ایک ایسی تھپکی ماری کہ مجھے تکلیف ہوئی اور فرمایا: ”کیا تم سمجھتی ہو کہ اللہ اور اس کا رسول تم پر ظلم کرے گا؟“ انہوں نے کہا: کوئی بات چاہے لوگوں سے کتنی ہی مخفی رہے، لیکن اللہ تعالیٰ تو اسے جان ہی لے گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں، ( اور ) کہا: جبرائیل میرے پاس آئے جب تم نے مجھے دیکھا، لیکن وہ اندر تمہارے سامنے نہیں آ سکتے تھے کہ تم اپنے کپڑے اتار چکی تھیں۔ انہوں نے مجھے پکارا اور تم سے چھپایا، میں نے انہیں جواب دیا اور میں نے اسے تم سے چھپایا ( یعنی دھیرے سے کہا ) اور میں سمجھا کہ تم سو چکی ہو، اور مجھے ڈر تھا کہ تم تنہائی میں وحشت نہ کھاؤ، تو انہوں ( جبرائیل ) نے مجھے حکم دیا کہ میں اہل بقیع کے پاس جاؤں اور ان کے لیے استغفار کروں۔ عاصم نے یہ حدیث دوسرے الفاظ کے ساتھ عبداللہ بن عامر سے اور انہوں نے عائشہ رضی اللہ عنہا سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		}
	]
}