{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"5": "The Book of Salah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 448,
			"arabicnumber": 448,
			"text": "انس بن مالک، مالک بن صعصعہ رضی اللہ عنہما سے روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: میں کعبہ کے پاس نیم خواب اور نیم بیداری میں تھا کہ اسی دوران میرے پاس تین ( فرشتے ) آئے، ان تینوں میں سے ایک جو دو کے بیچ میں تھا میری طرف آیا، اور میرے پاس حکمت و ایمان سے بھرا ہوا سونے کا ایک طشت لایا گیا، تو اس نے میرا سینہ حلقوم سے پیٹ کے نچلے حصہ تک چاک کیا، اور دل کو آب زمزم سے دھویا، پھر وہ حکمت و ایمان سے بھر دیا گیا، پھر میرے پاس خچر سے چھوٹا اور گدھے سے بڑا ایک جانور لایا گیا، میں جبرائیل علیہ السلام کے ساتھ چلا، تو ہم آسمان دنیا پر آئے، تو پوچھا گیا کون ہو؟ انہوں نے کہا: جبرائیل ہوں، پوچھا گیا آپ کے ساتھ کون ہیں؟ انہوں نے کہا: محمد ( صلی اللہ علیہ وسلم ) ہیں، پوچھا گیا: کیا بلائے گئے ہیں؟ مرحبا مبارک ہو ان کی تشریف آوری، پھر میں آدم علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بیٹے اور نبی! پھر ہم دوسرے آسمان پر آئے، پوچھا گیا: کون ہو؟ انہوں نے کہا: جبرائیل ہوں، پوچھا گیا: آپ کے ساتھ کون ہیں؟ انہوں نے کہا: محمد ( صلی اللہ علیہ وسلم ) ہیں، یہاں بھی اسی طرح ہوا، یہاں میں عیسیٰ علیہ السلام اور یحییٰ علیہ السلام کے پاس آیا، اور میں نے ان دونوں کو سلام کیا، ان دونوں نے کہا: خوش آمدید تمہیں اے بھائی اور نبی! پھر ہم تیسرے آسمان پر آئے، پوچھا گیا کون ہو؟ انہوں نے کہا: جبرائیل ہوں، پوچھا گیا: آپ کے ساتھ کون ہیں؟ انہوں نے کہا: محمد ( صلی اللہ علیہ وسلم ) ہیں، یہاں بھی اسی طرح ہوا، یہاں میں یوسف علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بھائی اور نبی! پھر ہم چوتھے آسمان پر آئے، وہاں بھی اسی طرح ہوا، یہاں میں ادریس علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بھائی اور نبی! پھر ہم پانچویں آسمان پر آئے، یہاں بھی ویسا ہی ہوا، میں ہارون علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بھائی، اور نبی! پھر ہم چھٹے آسمان پر آئے، یہاں بھی ویسا ہی ہوا، تو میں موسیٰ علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بھائی اور نبی! تو جب میں ان سے آگے بڑھا، تو وہ رونے لگے ۱؎، ان سے پوچھا گیا آپ کو کون سی چیز رلا رہی ہے؟ انہوں نے کہا: پروردگار! یہ لڑکا جسے تو نے میرے بعد بھیجا ہے اس کی امت سے جنت میں داخل ہونے والے لوگ میری امت کے داخل ہونے والے لوگوں سے زیادہ اور افضل ہوں گے، پھر ہم ساتویں آسمان پر آئے، یہاں بھی ویسا ہی ہوا، تو میں ابراہیم علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بیٹے اور نبی! پھر بیت معمور ۲؎ میرے قریب کر دیا گیا، میں نے ( اس کے متعلق ) جبرائیل سے پوچھا تو انہوں نے کہا: یہ بیت معمور ہے، اس میں روزانہ ستر ہزار فرشتے نماز ادا کرتے ہیں، جب وہ اس سے نکلتے ہیں تو پھر دوبارہ اس میں واپس نہیں ہوتے، یہی ان کا آخری داخلہ ہوتا ہے، پھر سدرۃ المنتھی میرے قریب کر دیا گیا، اس کے بیر ہجر کے مٹکوں جیسے، اور اس کے پتے ہاتھی کے کان جیسے تھے، اور اس کی جڑ سے چار نہریں نکلی ہوئی تھی، دو نہریں باطنی ہیں، اور دو ظاہری، میں نے جبرائیل سے پوچھا، تو انہوں نے کہا: باطنی نہریں تو جنت میں ہیں، اور ظاہری نہریں فرات اور نیل ہیں، پھر میرے اوپر پچاس وقت کی نمازیں فرض کی گئیں، میں لوٹ کر موسیٰ ( علیہ السلام ) کے پاس آیا، تو انہوں نے پوچھا: آپ نے کیا کیا؟ میں نے کہا: میرے اوپر پچاس نمازیں فرض کی گئیں ہیں، انہوں نے کہا: میں لوگوں کو آپ سے زیادہ جانتا ہوں، میں بنی اسرائیل کو خوب جھیل چکا ہوں، آپ کی امت اس کی طاقت بالکل نہیں رکھتی، اپنے رب کے پاس واپس جایئے، اور اس سے گزارش کیجئیے کہ اس میں تخفیف کر دے، چنانچہ میں اپنے رب کے پاس واپس آیا، اور میں نے اس سے تخفیف کی گزارش کی، تو اللہ تعالیٰ نے چالیس نمازیں کر دیں، پھر میں موسیٰ علیہ السلام کے پاس واپس آیا، انہوں نے پوچھا: آپ نے کیا کیا؟ میں نے کہا: اللہ تعالیٰ نے انہیں چالیس کر دی ہیں، پھر انہوں نے مجھ سے وہی بات کہی جو پہلی بار کہی تھی، تو میں پھر اپنے رب عزوجل کے پاس واپس آیا، تو اللہ تعالیٰ نے انہیں تیس کر دیں، پھر میں موسیٰ علیہ السلام کے پاس آیا، اور انہیں اس کی خبر دی، تو انہوں نے پھر وہی بات کہی جو پہلے کہی تھی، تو میں اپنے رب کے پاس واپس گیا، تو اس نے انہیں بیس پھر دس اور پھر پانچ کر دیں، پھر میں موسیٰ علیہ السلام کے پاس آیا، تو انہوں نے پھر وہی بات کہی جو پہلے کہی تھی، تو میں نے کہا: ( اب مجھے ) اپنے رب عزوجل کے پاس ( باربار ) جانے سے شرم آ رہی ہے، تو آواز آئی: میں نے اپنا فریضہ نافذ کر دیا ہے، اور اپنے بندوں سے تخفیف کر دی ہے، اور میں نیکی کا بدلہ دس گنا دیتا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		}
	]
}