{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"7": "The Book of the Adhan (The Call to Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 632,
			"arabicnumber": 632,
			"text": "(عبداللہ بن محیریز جو ابومحذورہ کے زیر پرورش ایک یتیم کے طور پر رہے تھے یہاں تک کہ انہوں نے ان کے شام کے سفر کے لیے سامان تیار کیا ) کہتے ہیں کہ میں نے ابو محذورہ رضی اللہ عنہ سے کہا: میں شام جا رہا ہوں، اور میں ڈرتا ہوں کہ آپ کی اذان کے متعلق مجھ سے کہیں سوال کیا جائے ( اور میں جواب نہ دے پاؤں، اس لیے مجھے اذان سکھا دو ) ، تو آپ نے کہا: میں چند لوگوں کے ساتھ نکلا، رسول اللہ صلی اللہ علیہ وسلم کے حنین سے لوٹتے وقت ہم حنین کے راستہ میں تھے، ہم رسول اللہ صلی اللہ علیہ وسلم سے راستے میں ملے، آپ صلی اللہ علیہ وسلم کے مؤذن نے نماز کے لیے آپ صلی اللہ علیہ وسلم کے پاس ( ہی ) اذان دی، ہم نے مؤذن کی آواز سنی، تو ہم اس کی نقل اتارنے، اور اس کا مذاق اڑانے لگے، رسول اللہ صلی اللہ علیہ وسلم نے آواز سنی تو ہمیں بلوایا تو ہم آ کر آپ کے سامنے کھڑے ہو گئے، آپ صلی اللہ علیہ وسلم نے پوچھا: میں نے ( ابھی ) تم میں سے کس کی آواز سنی ہے؟ تو لوگوں نے میری جانب اشارہ کیا، اور انہوں نے سچ کہا تھا، آپ نے ان سب کو چھوڑ دیا، اور مجھے روک لیا اور فرمایا: اٹھو اور نماز کے لیے اذان دو، تو میں اٹھا، آپ صلی اللہ علیہ وسلم نے بذات خود مجھے اذان سکھائی، آپ نے فرمایا: کہو: «اللہ أكبر اللہ أكبر»، «اللہ أكبر اللہ أكبر»، «أشهد أن لا إله إلا اللہ»، «أشهد أن لا إله إلا اللہ»، «أشهد أن محمدا رسول اللہ»، «أشهد أن محمدا رسول اللہ»، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: دوبارہ اپنی آواز کھینچو ( بلند کرو ) ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: کہو! «أشهد أن لا إله إلا اللہ»، «أشهد أن لا إله إلا اللہ»، «أشهد أن محمدا رسول اللہ»،«أشهد أن محمدا رسول اللہ»، «حى على الصلاة»، «حى على الصلاة»، «حى على الفلاح»، «حى على الفلاح»، «اللہ أكبر اللہ أكبر»، «لا إله إلا اللہ»، پھر جس وقت میں نے اذان پوری کر لی تو آپ نے مجھے بلایا، اور ایک تھیلی دی جس میں کچھ چاندی تھی، میں نے عرض کیا: اللہ کے رسول! مجھے مکہ میں اذان دینے پر مامور فرما دیجئیے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: میں نے تمہیں اس کے لیے مامور کر دیا ، چنانچہ میں رسول اللہ صلی اللہ علیہ وسلم کے عامل عتاب بن اسید رضی اللہ عنہ کے پاس مکہ آیا تو میں نے ان کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کے حکم سے نماز کے لیے اذان دی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 7
			}
		}
	]
}