{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"14": "The Book on Business"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1205,
			"arabicnumber": 1205,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": 1206,
			"text": "Ibn Mas'ud narrated:\"The Messenger of Allah (ﷺ) cursed the one who consumed Riba, and the one who charged it, those who witnessed it, and the one who recorded it.\" He said: There are narrations on this topic from 'Umar, 'Ali, Jabir [and Abu Juhaifah]. The Hadith of 'Abdullah (bin Mas'ud) is a Hasan Sahih Hadith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": 1207,
			"text": "Anas narrated that the Prophet (ﷺ) said about the major sins:\"Associating partners with Allah, disobeying parents, killing oneself, and false speech.\" He said: There are narrations on this topic from Abu Bakrah, Ayman bin Khuraim, and Ibn 'Umar Abu 'Eisa said: The Hadith of Anas is a Hasan Sahih Gharib Hadith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": 1208,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": 1209,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": 1210,
			"text": "Narrated Isma'il bin 'Ubaid bin Rifa'ah: From his father, from his grandfather, that he went with the Messenger of Allah (ﷺ) to the Musalla, and he saw the people doing business so he said: 'O people of trade!' and they replied to the Messenger of Allah (ﷺ) turning their necks and their gazes towards him, and he said: Indeed the merchants will be resurrected on the Day of judgement with the wicked, except the one who has Taqwa of Allah, who behaves charitably and is truthful.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. And they also say Isma'il bin 'Ubaidullah bin Rifa'ah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": 1211,
			"text": "Narrated Abu Dharr: That the Prophet (ﷺ) said: \"There are three whom Allah will not look at on the Day of Judgement, nor will He purify them, and theirs is a painful punishment.\" We said: \"Who are they O Messenger of Allah ? For they have indeed failed and are lost!\" He sai: \"The Mannan, the one whose Izar hangs (below the ankels) and the one who promotes his merchandise with false oath.\" [He said:] There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Umamah bin Tha'labah, 'Imran bin Husain, and Ma'qil bin Yasar [Abu 'Eisa said:] The Hadith of Abu Dharr is a Hasan Sahih Hadith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": 1212,
			"text": "Narrated 'Umarah bin Hadid: From Shakr Al-Ghamidi that the Messenger of Allah (ﷺ) said: \"O Allah bless my Ummah in what they do early (in the day).\" He said: \"Whenever he (ﷺ) would dispatch a military expedition or an army, he would send them in the first part of the day.\" And Sakhr, a man who was a merchant, used to send his goods for trade during the beginning of the day, so he became rich, and his wealth increased. [He said:] There are narrations on this topic from 'Ali, Buraidah, Ibn Mas'ud, Anas, Ibn 'Umar, Ibn 'Abbas, and Jabir. [Abu 'Eisa said:] The Hadith is Sakhr Al-Ghamidi is a Hasan Hadith. We do not know of a narration that Sakhr Al-Ghamidi reported from the Prophet (ﷺ) other than this Hadith. Sufyan Ath-Thawri reported this Hadith from Shu'bah, from Ya'la bin 'Ata",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": 1213,
			"text": "Narrated 'Aishah:\"The Messenger of Allah (ﷺ) was wearing two thick Qitri garments on. When he would sit, he would sweat since they were so heavy for him. Some clothes arrived from Ash-Sham for so-and-so, the Jew. I said: 'Perhaps you could dispatch a request to him to buy some garments (on credit) from him until it is easy (to pay). So he sent a message to him and he said: 'I know what he wants. He only wants to take away my wealth' or 'my Dirham.' So the Messenger of Allah (ﷺ) said: 'He has lied, indeed he knows that I am the one with the most Taqwa among them, and the best at fulfilling trusts among them.'\" [He said:] There are narrations on this topic from Ibn 'Abbas, Anas, and Asma' bint Yazid. [Abu 'Eisa said:] The Hadith of 'Aishah is Hasan Sahih Gharib Hadith. Shu'bah has also reported it from 'Umarah bin Abi Hafsah. He said: I heard Muhammad bin Firas Al-Basri saying: \"I heard Abu Dawud At-Tayalisi saying: 'One day Shu'bah was asked about this Hadith, and he said: \"I will not narrate it to you (people) until you stand up before Harami bin 'Umarah [bin Hafsah] to kiss his head.\" He said: 'And Harami was there among the people.'\" [Abu 'Eisa said:] Meaning: \"approving of this Hadith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": 1214,
			"text": "Narrated Ibn 'Abbas: \"The Prophet (ﷺ) died while his armour was pawned for twenty Sa' of food that he got for his family.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": 1215,
			"text": "Narrated Anas: I walked to the Prophet (ﷺ) with some barley bread that has some rancid oil poured over it. The Prophet (ﷺ) had pawned his armour with a Jew for twenty Sa' of food that he got for his family. That day (he pawned it), I heard him saying: 'Not for one evening has the household of Muhammad had a Sa' of dates or a Sa' of grain.' And on that day he had nine wives.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": 1216,
			"text": "Narrated 'Abbad bin Laith Al-Karabisi [Al-Basri]: \"Abdul Majid bin Wahb narrated to us, he said: 'Al-'Adda' bin Khalid bin Hawdhah said to me: \"Shall I not read to you a letter that was written for me from the Messenger of Allah (ﷺ) ?'\" He said: 'I said: \"Of course.\" So he took out a letter for me: \"This is what Al-'Adda' bin Khalid bin Hawdhah purchased from Muhammad, the Messenger of Allah (ﷺ): He purchased from him a slave' - or - 'a female slave, having no ailments, nor being a runaway, nor having any malicious behavior. Sold by a Muslim to a Muslim.'\" [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from 'Abbad bin Laith. More than one of the people of Hadith have reported this Hadith from him",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": 1217,
			"text": "Narrated Ibn 'Abbas: That the Messenger of Allah (ﷺ) said to the people of weights and measures: \"Indeed you have been entrusted with two matters that nations preceding you in the past were destroyed for.\" [Abu 'Eisa said:] We do not know this Hadith to be Marfu' except through the narration of Husain bin Qais, and Husain bin Qais was graded weak in Hadith. This has been reported as Maquf narration from Ibn 'Abbas with a Sahih chain of narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"text": "Narrated Anas bin Malik: That the Messenger of Allah (ﷺ) sold a saddle blanket and a drinking bowl. He (ﷺ) said: \"Who will buy saddle blanket and drinking bowl ?\". So a man said: \"I will take them for a Dirham.\" So the Prophet (ﷺ) said: \"Who will give more than a Dirham ? Who will give more that a Dirham ?\" A man agreed to give him two Dirham, so he sold them to him. [Abu 'Eisa said:] This Hadith is Hasan. We do not know of it except from the narration of Al-Akhdar bin 'Ajlan, and 'Abdullah Al-Hanafi who is reporting from Anas, is Abu Bakr Al-Hanafi. This is acted upon according to some of the people of knowledge, they did not see any harm in auctioning the spolis of war and inheritance. Al-Mu'tamir bin Sulaiman and others among the people of Hadith reported from Al-Akhdar bin 'Ajlan",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": 1219,
			"text": "Narrated Jabir: \"A man among the Ansar decided to free a slave of his after his death. He died but he left no wealth behind beside the slave. So the Prophet (ﷺ) sold him and Nu'aim [bin 'Abdullah] bin An-Nah-ham bought him.\" Jabir said: \"He was Coptic slave who died during the first year of the leadership of Ibn Az-Zubair.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih and it has been reported through more than one route from Jabir bin 'Abdullah. This Hadith is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They did not see any harm in the sale of Mudabbar. This is the view of Ash-Shafi'i, Ahmad and Ishaq. There are those among people of knowledge, among the Companions of the Prophet (ﷺ) and others, who disliked selling the Mudabbar. This is the view of Sufyan Ath-Thawri, Malik and Al-Awza'i",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1220,
			"arabicnumber": 1220,
			"text": "Narrated Ibn Mas'ud: From the Prophet (ﷺ): \"He prohibited meeting the owners of the goods.\" [He said:] There are narrations on this topic from 'Ali, Ibn 'Abbas, Abu Hurairah, Abu Sa'eed, Ibn 'Umar, and a man from the Companions of the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1221,
			"arabicnumber": 1221,
			"text": "Narrated Abu Hurairah: \"The Prophet (ﷺ) prohibited meeting the goods being brought (to the market). If someone were to meet them and buy them, then the owner of the goods retains the option when he reaches the market.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib narration of Ayyub (a narrator). The Hadith if Ibn Mas'ud is a Hasan Sahih Hadith. There are those among the people of knowledge who disliked meeting the owners of the goods, saying that it is a type of deception. This is the view of Ash-Shafi'i, and others among our companions",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1222,
			"arabicnumber": 1222,
			"text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"The dweller of the town is not to sell for the Bedouin.\" [He said:] There are narrations on this topic from Talhah, Jabir, Anas, Ibn 'Abbas, Hakim bin Abi Yazid from his father, 'Amr bin 'Awf Al-Muzani the grandfather of Kathir bin 'Abdullah, and a man from the Companions of the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": 1223,
			"text": "Narrated Jabir: That the Messenger of Allah (ﷺ) said: \"The dweller of the town is not to sell for the Bedouin, leave the people ; Allah provides for some of them through others.\" [Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith, and this Hadith of Jabir is a Hasan Sahih Hadith as well. This Hadith is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They dislike the dweller of the town to sell for the Bedouin, while some of them permitted the town dweller to purchase for the Bedouin. Ash-Shafi'i said: \"It is disliked for the dweller of the town to sell for the Bedouin, and if he does sell, then the sale is permissible",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1224,
			"arabicnumber": 1224,
			"text": "Narrated Abu Hurairah: The Messenger of Allah (ﷺ) prohibited Muhaqalah and Muzabanah. [He said:] There are narrations on this topic from Ibn 'Umar, Ibn 'Abbas, Zaid bin Thabit, Sa'd, Jabir, Rafi' bin Khadij, and Abu Sa'eed. [Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. Muhaqalah is selling corps for wheat, and Muzabanah is selling dates that are on the date-palm for dried dates. This is acted upon according to the most of the people of knowledge, they disliked sales of Muhaqalah and Muzabanah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1225,
			"arabicnumber": 1225,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1226,
			"arabicnumber": 1226,
			"text": "Narrated Ibn 'Umar:\"The Messenger of Allah (ﷺ) prohibited selling date-palms until they have blossomed",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1227,
			"arabicnumber": 1227,
			"text": "With this (same as no. 1226) chain:\"The Prophet (ﷺ) prohibited selling ears (of grain) until they have whitened (shown their kernals) and are safe from blight, he forbade it for the seller and the buyer.\" [He said:] There are narrations on this topic from Anas, Ibn 'Abbas, Jabir, Abu Sa'eed, and Zaid bin Thabit. [Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They dislike selling fruits before their usefulness appears, this is the view of Ash-Shafi'i, Ahmad and Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1228,
			"arabicnumber": 1228,
			"text": "Narrated Anas: \"The Messenger of Allah (ﷺ) prohibited selling grapes until they appear and selling grains until they become firm.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it being Marfu' except from the narration of Hammad bin Salamah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1229,
			"arabicnumber": 1229,
			"text": "Narrated Ibn 'Umar: \"The Prophet (ﷺ) prohibited the sale of Habalil-Habalah.\" [He said:] There are narrations on this topic from 'Abdullah bin 'Abbas and Abu Sa'eed Al-Khudri [Abu 'Eisa said:] The Hadith of Ibn 'Umar is Hasan Sahih Hadith. This is acted upon according to the people of knowledge. And Hababil-Habalah is the offspring of the offspring (of an animal). It is an invalid sale according to the people of knowledge and it is type of Gharar sale. Shu'bah reported this Hadith from Ayyub, from Sa'eed bin Jubair, from Ibn 'Abbas. 'Abdul Wahhab Ath-Thaqafi and others reported it from Ayyub, from Sa'eed bin Jubair and Nafi', from Ibn 'Umar, from the Prophet (ﷺ), and this is more correct",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1230,
			"arabicnumber": 1230,
			"text": "Narrated Abu Hurairah: \"The Messenger of Allah (ﷺ) prohibited the Gharar sale, and the Hasah sale.\" [He said:] There are narrations on this topic from Ibn 'Umar, Ibn 'Abbas, Abu Sa'eed, and Anas. [Abu 'Eisa said:] This Hadith of Abu Hurairah is Hasan Sahih Hadith. This Hadith is acted upon according to the people of knowledge, they dislike the Gharar. Ash-Shafi'i said: \"The Gharar sale includes selling fish that are in the wate, selling a slave that has escaped, selling birds that are in the sky, and similar type of sales. And the meaning of Hasah sale is when the seller says to the buyer: 'When I toss the pebble at you, then the sale between you and I is final.' This resembles the sale of Munabadhah and this is one of the selling practices of the people of Jahiliyyah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1231,
			"arabicnumber": 1231,
			"text": "Narrated Abu Hurairah: \"The Messenger of Allah (ﷺ) prohibited two sales in one.\" There are narrations on this topic from 'Abdullah bin 'Amr, Ibn 'Umar, and Ibn Mas'ud. [Abu Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. Some of the people of knowledge have explained it by saying that two sales in one is when one says: \"I will sell you this garment for ten in cash, and twenty on credit.\" He does not distinguish between either of the two sales. But when he distinguishes it as being one of them, then there is no harm when one of them is agreed upon. Ash-Shafi'i said: \"Included in the meaning of what the Prophet (ﷺ) prohibited of regarding two sales in one, is if one said: 'I will sell you the house of mine for that (price), upon the condition that you sell me you alve for this (price). When I get the slave, then you get the house.' In this way the sales are distinguished without the prices being known, and neither of them knows what will happen at the conclusion of it (the agreement)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1232,
			"arabicnumber": 1232,
			"text": "Narrated Hakim b. Hizam:\"I asked Messenger of Allah (ﷺ), I said: 'A man came to me asking to buy something that I did not have. Can I buy it from the market for him and then give it to him?' He said: 'Do not sell what is not with you.'\" He said: There are narrations on this topic from 'Abdullah bin 'Umar",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "Narrated Hakim b. Hizam: \"The Messenger of Allah (ﷺ) prohibited me from selling what was not with me.\" [Abu 'Eisa said:] This Hadith is Hasan. He said: There is something on this topic from 'Abdullah bin 'Umar. Ishaq bin Mansur said: \"I said to Ahmad: 'What is the meaning of the prohibition from a loan along with a sale? He said: 'That he gives him a loan and then he makes a sale to him greater then it's actual worth. And, it carries the meaning of him loaning it to him in exchange for something (as collateral), so he says: 'If you are unable to pay it (the loan), the it (the collateral) will be a sale for you.' Ishaq [bin Rahuwyah] said as he said. And I said to Ahmad: 'What about selling what one does not possess?' He said: 'To me it does not apply except in cases of food - meaning one has not taken possession of it.' And Ishaq said the same for all of what is measured or weighed. Ahmad said: 'When he says: \"I will sell you this garment, with the condition that I am the tailor for it, and I am the one who bleaches it.' This is an example of two conditions in one sale. But if he says: \"I am selling it to you with the condition that I am its tailor,\" then there is no harm in it. And, if he said: \"I am selling it to you with the condition that I am the one who bleaches it\" then there is no harm in it, because this is only one condition.' And Ishaq said as he said",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "Narrated Ayyub: 'Amr bin Shu'aib narrated to us, saying: My father narrated to me from his father' until he mentioned 'Abdullah bin 'Amr: \"The Messenger of Allah (ﷺ) said: 'It is not lawful to lend and sell, nor two conditions in a sale, nor to profit from what is not possessed, nor to sell what one does not have.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. [Abu 'Eisa said:] The Hadith of Hakim bin Hizam is a Hasan Hadith, it has been reported from him through other routes. Ayyub As-Sakhtiyani and Abu Bishr report from Yusuf bin Mahak, from Hakim bin Hizam. [Abu 'Eisa said:] 'Awf and Hisham bin Hassan reported this Hadith from Ibn Sirin, from Hakim bin Hizam from the Prophet (ﷺ). And this is a Mursal Hadith. Ibn Sirin only reported it from Ayyub As-Sikhtiyani from Yusuf bin Mahak, from Hakim bin Hizam like this",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1235,
			"arabicnumber": 1235,
			"text": "Narrated Hakim b. Hizam: \"The Messenger of Allah (ﷺ) prohibited me from selling what was not with me.\" [Abu 'Eisa said:] Waki' reported this Hadith from Yazid bin Ibrahim, from Ibn Sirin, from Ayyub, from Hakim bin Hizam, and he did not mention in it: \"From Yusuf bin Mahak.\" And the narration of 'Abdus-Samad (a narrator in the chain of Hadith no. 1235) is more correct. Yahya bin Abi Kathir reported this Hadith from Ya'la bin Hakim, from Yusuf bin Mahak, from 'Abdullah bin 'Ismah, from Hakim bin Hizam, from the Prophet (ﷺ). This Hadith is acted upon according to most of the people of knowledge, they dislike for a man to sell what is not with him",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1236,
			"arabicnumber": 1236,
			"text": "Narrated Ibn 'Umar: \"The Messenger of Allah (ﷺ) prohibited selling the Wala' and conferring it.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. We do not know of it except as a narration of 'Abdullah bin Dinar, from Ibn 'Umar. This Hadith is acted upon according to the people of knowledge. Yahya bin Sulaim reported this Hadith from 'Ubaidullah bin 'Umar, from Nafi' from Ibn 'Umar from the Prophet (ﷺ), saying \"That he prohibited selling the Wala' and conferring it.\" But this is mistake from Yahya bin Sulaim. Because 'Abdul Wahhab Ath-Thaqafi, 'Abdullah bin Numair and others reported it from 'Ubaidullah bin 'Umar, from Ibn 'Umar, from the Prophet (ﷺ). And this is more correct than the narration of Yahya bin Sulaim",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1237,
			"arabicnumber": 1237,
			"text": "Narrated Samurah: \"The Messenger of Allah (ﷺ) prohibited bartering animals on credit.\" He said: There are narration on this topic from Ibn 'Abbas, Jabir, Ibn 'Umar. [Abu 'Eisa said:] The Hadith of Samurah is Hasan Sahih Hadith. It is correct that Al-Hasan heard from Samurah, this is what 'Ali bin Al-Madini and others said. Regarding (the prohibition of) bartering animals on credit, this is acted upon according to most of the people of knowledge among the Companions of the Prophet (ﷺ) and others. This is the view of Sufyan Ath-Thawri and the people of Al-Kufah, and it is the view of Ahmad. Some of the people of knowledge, among the Companions of the Prophet (ﷺ) and others, permitted bartering animals for animals on credit. This is the view of Ash-Shafi'i and Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": 1238,
			"text": "Narrated Jabir: That the Messenger of Allah (ﷺ) said: \"Animals [two for one] are not proper on credit, and there is no harm in a hand to hand (exchange).\" The Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": 1239,
			"text": "Narrated Jabir: \"A slave came to give the pledge to the Prophet (ﷺ) for Hijrah, but the Prophet (ﷺ) did not realize that he was a slave. So his master came to get him and the Prophet (ﷺ) said: 'Sell him to me.' So he purchased him for two black slaves. Then he would not pledge from anyone until he asked him if he was a slave.\" [He said:] There is something on this topic from Anas. [Abu 'Eisa said:] The Hadith of Jabir is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. There is no harm in a slave for two slaves in hand to hand exchange, but they differ when it is on credit",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": 1240,
			"text": "Narrated 'Ubadah bin As-Samit: That the Prophet (ﷺ) said: \"Gold for gold, kind for kind; silver for silver, kind for kind; dried-dates for dried-dates, kind for kind; wheat for wheat, kind for kind; salt for salt, kind for kind; and barley for barley, kind for kind. Whoever increases or seeks an increase, then he dealt with Riba. Sell gold for silver as you wish, hand to hand; and sell wheat for dried-dates as you wish, hand to hand; and sell barley for dried-dates as you wish, hand to hand.\" [He said:] There are narrations on this topic from Abu Sa'eed, Abu Hurairah, Bilal, And Anas. [Abu 'Eisa said:] The Hadith of 'Ubadah bin As-Samit is Hasan Sahih. Some of them reported this Hadith from Khalid, with this chain, and he said: \"Sell wheat for barley as you wish, hand to hand.\" Some of them reported this Hadith from Khalid, from Abu Qilabah, from Ash'ath, from 'Ubadah from the Prophet (ﷺ). In that Hadith, they added that Khalid said: \"Abu Qilabah said: \"Sell wheat for barley as you wish, hand to hand.\" This Hadith is acted upon according to the people of knowledge, they do not think that one may sell wheat for wheat except when it is the same kind for the same kind, and (the same for) barely in exchange for barley, kind for kind. When the items are themselves different, then there is no harm in one being more than the other if it is hand to hand. This is saying of most of the people of knowledge among the Companions of the Prophet (ﷺ) and others. It is the view of Sufyan Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq. Ash-Shafi'i said: \"And the proof for that is the saying of the Prophet (ﷺ): 'Sell barley for wheat as you wish, hand to hand.'\" [Abu 'Eisa said:] Some of the people of knowledge considered it disliked that wheat be sold for barely unless it was kind for kind. This is the view of Malik bin Anas, but the first view is more correct",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1241,
			"arabicnumber": 1241,
			"text": "Narrated Nafi': \"Ibn 'Umar and I went to Abu Sa'eed and he narrated to us: 'the Messenger of Allah (ﷺ) said - and I heard him with these [two] ears: \"Do not sell gold for gold except kind for kind, nor sliver for silver except kind for kind, do not exchange more of one than the other, and do not sell what is not present from them for what is present.\" [Abu 'Eisa said:] There are narrations on this topic from Abu Bakr, 'Umar, 'Uthman, Abu Hurairah, Hisham bin 'Amir, Al-Bara', Zaid bin Arqam, Fadalah bin 'Ubaid, Abu Bakrah, Ibn 'Umar, Abu Ad-Darda', and Bilal. [He said:] The Hadith of Abu Sa'eed, from the Prophet (ﷺ) [about Riba] is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others, except for what has been related from Ibn 'Abbas; he did not see any harm in exchanging gold for gold or silver for silver, more for less, when it is done hand in hand, and he said: \"Riba' is only in credit.\" Similar it has been related from some of his companions. It has been related that Ibn 'Abbas changed his opinion when Abu Sa'eed narrated it to him from the Prophet (ﷺ). The first view is more correct. And this is acted upon according to the people of knowledge [among the Companions of the Prophet (ﷺ) and others]. It is the view of Sufyan Ath-Thawri, Ibn Al-Mubarak, Ash-Shafi'i, Ahmad, and Ishaq. It has been reported that Ibn Al-Mubarak said: \"There is no difference over exchange",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": 1242,
			"text": "Narrated Ibn 'Umar: \"I would sell camels at Al-Baqi', so I would sell them for Dinar but take in place of them Dirham, and, I would sell for silver and take Dinar in its place. So I went to the Messenger of Allah (ﷺ) and found him leaving the house of Hafsah. I asked him about that and he said: 'There is no harm in that when it (equals) the price.'\" [Abu 'Eisa said:] We do not know of this Hadith being Marfu' except from the narration of Simak bin Harb from Sa'eed bin Jubair, from Ibn 'Umar. Dawud bin Abi Hind narrated this Hadith from Abu Sa'eed bin Jubair, from Ibn 'Umar in Mawquf form. This is acted upon according to some of the people of knowledge. There is no harm in paying for gold with silver and silver with gold. This is the view of Ahmad and Ishaq. Some of the people of knowledge, among the Companions and others, disliked that",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": 1243,
			"text": "Narrated Ibn Shihab: From Malik bin Aws bin Hadathan that he said: \"I once said: 'Who can change some Dirham?' So Talhah bin 'Ubaidullah - and he was with 'Umar bin Al-Khattab - said: \"Leave your gold with us, then return to us when our servant comes and we will give you your silver.\" 'Umar bin Al-Khattab said: \"No! By Allah! Either give him his silver or return his gold to him. Indeed the Messenger of Allah (ﷺ) said: 'Silver for gold is Riba, except for hand to hand; and wheat for wheat is Riba except for hand to hand; and barley for barley is Riba except hand to hand; and dried-dates for dried-dates is Riba except for hand to hand.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to the people of knowledge. And the meaning of Ha' Wa Ha' is hand to hand",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "Narrated Salim: From his father that the Messenger of Allah (ﷺ) said: 'Whoever purchases a date-palm after it has been pollinated then its fruits are for the one who sold it, unless the buyer made it a condition. And whoever purchases slave who has property, then his property is for the one who sold him, unless the buyer made it a condition.\" [He said:] There is something on this topic from Jabir. The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. Similarly, it has been reported by more than one route from Az-Zuhri, from Salim, from Ibn 'Umar, that the Prophet (ﷺ) \"Whoever purchases a date-palm after it has been pollinated, then its fruits are for seller, unless the buyer made it a condition. And whoever purchases a slave who has property, then his property is for the seller, unless the buyer made it a condition.\" And it has been reported from Nafi', from Ibn 'Umar, that the Prophet (ﷺ) said: \"Whoever purchases a date-palm that has been pollinated, then its fruits are for the seller, unless the buyer made it a condition.\" It has been reported from Nafi', from Ibn 'Umar, from 'Umar, that he (ﷺ) said: \"Whoever sold a slave who has property, his property is for the seller, unless the buyer made it a condition.\" This is how the two Ahadith were reported by 'Ubaidullah bin 'Umar and others from Nafi'. Some of them have also reported this Hadith from Nafi', from Ibn 'Umar, from the Prophet (ﷺ). 'Ikrimah bin Khalid reported similar to the Hadith of Salim, from Ibn 'Umar, from the Prophet (ﷺ). This Hadith is acted upon according to some of the people of knowledge. It is the view of Ash-Shafi'i, Ahmad, and Ishaq. Muhammad bin Isma'il said: \"The Hadith of Az-Zuhri from Salim, from his father, from the Prophet (ﷺ) is the most correct [of what has been reported on this topic]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": 1245,
			"text": "Narrated Nafi': From Ibn 'Umar, that the Messenger of Allah (ﷺ) said: \"Both the buyer and the seller retain the option as long as they have not separated or they give each other than option.\" He (Nafi') said: \"So when Ibn 'Umar purchased something while he was sitting, he would stand to complete the sale",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": 1246,
			"text": "Narrated Hakim b. Hizam: That the Messenger of Allah (ﷺ) said: \"Both the buyer and the seller retain the option as long as they have not separated. If they spoke the truth and clarified (any defects or conditions), then they would be blessed in their sale, and if they hid something and lied then their sale would be deprived of blessings.\" And this is a Sahih Hadith. This is how it was reported from Abu Barzah Al-Aslami, that two men came disputing to him after the sale of a horse, and they were on a ship, so he said: \"I did not see the two of your separate, and the Messenger of Allah (ﷺ) said: 'The buyer and the seller retain the choice as long as they did not separate.'\" Some of the people of knowledge, among the people of Al-Kufah and others, held the view that the separation refers to speech. This is the saying of [Sufyan] Ath-Thawri. This has been reported from Malik bin Anas, and it has been reported from Ibn al-Mubarak that he said: \"How could this be refuted ?\" And the Hadith about it from the Prophet (ﷺ) is Sahih, and it strenghtens this view. And the meaning of the saying of the Prophet (ﷺ): \"Except for the optional sale\" is, that (while they are still together) the seller gives the buyer the option to cancel after the conclusion of the sale. If he chooses to agree to the sale, then he does not have the choice to cancel the sale after then, even if they did not separate. This is how Ash-Shafi'i and others explained it. And what strenghtens the view of those who said that the separation refers to them parting, (and) it does not refer to speech, is the (following) Hadith of 'Abdullah bin 'Amr from the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": 1247,
			"text": "Narrated 'Amr bin Shu'aib: From his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"Both the buyer and the seller retain the option as long as they did not separate, unless they agreed to making it optional. And it is not lawful for him to separate from his companion, fearing that he will change his mind.\" [Abu 'Eisa said:] This Hadith is Hasan and this means separating from him after the sale, fearing that he will change his mind. And if the separation referred to speech, and there was no option left for him after the sale, then this Hadith would be meaningless, since he (ﷺ) said: \"And it is not lawful for him to separate from his companion, fearing that he will change his mind",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": 1248,
			"text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: \"They (the two) are not separate from a sale except in agreement. [Abu 'Eisa said:] This Hadith is Gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1249,
			"arabicnumber": 1249,
			"text": "Narrated Jabir: \"The Prophet (ﷺ) gave a Bedouin the option after a sale.\" This Hadith is Hasan Gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "Narrated Anas: That there was a man who was not very sensible and he would make purchases. So his family came to the Prophet (ﷺ) and said: \"O Messenger of Allah! Stop him (from making purchases).\" So Allah's Prophet (ﷺ) called him to prohibit him, and he said: \"O Messenger of Allah! I have no patience for business.\" So he said: \"When you are buying, say: 'Hand to hand, and no cheating.'\" [Abu 'Eisa said:] There is a narration on this topic from Ibn 'Umar. The Hadith of Anas is a Hasan Sahih Gharib Hadith. This is acted upon according to the people of knowledge. They say that the free man can be prevented from selling and buying when his intellect is weak. This is the view of Ahmad and Ishaq. Some of the scholars did not think that the free person who had attained the age of responsibility could be prevented from that",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: \"Whoever purchased an animal that has not been milked, then he the choice when he milks it, if he wishes he may return it, returning a Sa' of dried dates along with it.\" [Abu 'Eisa said:] There are narration on this topic from Anas, and a man from the Companions of the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: \"Whoever purchases an animal that has not been milked, then he retains the option for three days. If he returns it, then he is to return with it a Sa' of food, not Samra' \" [Abu 'Eisa said:] The meaning of \"Not Samra'\" is \"not wheat.\" This Hadith is Hasan Sahih. This Hadith is acted upon according to our companions, among them Ash-Shafi'i, Ahmad, and Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "Narrated Jabir bin ‘Abdullah : That he sold a camel to the Prophet (ﷺ) and made a condition that he could ride it to (return to) his family. [Abu 'Eisa said:] This Hadith is Hasan Sahih. It has been reported through other routes from Jabir. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They consider it allowed to make a condition in a sale when it is one condition. This is the view of Ahmad and Ishaq. Some of the people of knowledge said that it is not allowed to make a condition in a sale, nor to complete a sale when there is a condition for it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ): \"A riding animal can be ridden while it is pawned, and a milking animal can be milked while it is pawned, and it is up to the one riding and drinking (the milk) to maintain it.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. We do now know of it being Marfu' except by the narration of 'Amir Ash-Sha'bi from Abu Hurairah. Others have reported this Hadith from Al-A'mash, from Abu Salih, from Abu Hurairah in Mawquf form. This is acted upon according to some of the people of knowledge, and it is the view of Ahmad and Ishaq. Some of the people of knowledge said that one may not benefit in any way from what is pawned",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "Narrated Al-Aswad: From 'Aishah that she wanted to purchase Barirah, but they (he owners) made the condition that they would retain the Wala'. So the Prophet (ﷺ) said: \"Buy her, the Wala' is only for the one who gives the price, or for the one who grants the favor.\" [He said:] There is something on this topic from Ibn 'Umar. [Abu 'Eisa said:] The Hadith of 'Aishah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. And Mansur bin Al-Mu'tamir's Kunyah is Abu 'Attab. Abu Bakr Al-'Attar Al-Basri narrated to us from 'Ali bin Al-Madini who said: \"I heard Yahya bin Sa'eed saying: 'When you get a narration from Mansur, then your hand has been filled with goodness without needing others.' Then Yahya said: 'I did not find anyone more reliable in (narrating from) Ibrahim An-Nakha'i and Mujahid than Mansur.\" [He said:] Muhammad informed me from 'Abdullah bin Abi Al-Aswad who said: \" 'Abdur-Rahman bin Mahdi said: 'Mansur is the most reliable of the people of Al-Kufah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "Narrated Habib bin Abi Thabit: From Hakim bin Hizam, that the Messenger of Allah (ﷺ) sent Hakim bin Hizam with a Dinar to buy an animal for Udhiyyah (an animal for sacrifice) for him. He purchases an Udhiyyah which he sold and profited a Dinar from, so he purchased another in its place. And he returned to the Messenger of Allah (ﷺ) with Udhiyyah and the Dinar, so he said: 'The sheep is for sacrifice and Dinar is for charity.'\" [Abu 'Eisa said:] We do not know of the Hadith of Hakim bin Hizam except through this route, and Habib bin Abi Thabit did not hear from Hakim bin Hizam - in my view",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "Narrated Ibn 'Abbas: That the Prophet (ﷺ) said: \"When the penalty (of blood money) goes to a Mukatab, or an inheritance, then he inherits in accordance with as much as he is freed from it.\" And the Prophet (ﷺ) said: \"The Mukatab is given the blood-money of a free person in accordance to what he has paid (for his freedom), and that of a slave in accordance to what remains.\" [He said:] There is something on this from Umm Salamah. [Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Hadith. This is how it was reported from Yahya bin Abi Kathir from 'Ikrimah, from Ibn 'Abbas, from the Prophet (ﷺ). Khalid bin Al-Hadh-dha' reported it from 'Ikrimah, from 'Ali as his saying. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. Most of the people of knowledge among the Companions of the Prophet (ﷺ) and others said that the Mukatab remains a slave as long as he still owes a Dirham. This is the view of Sufyan Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "Narrated 'Amr bin Shu'aib: From his father, from his grandfather that he heard the Messenger of Allah (ﷺ) delivering a Khutbah in which he said: \"Whoever gives a writ of emancipation to his slave, for one hundred Uqiyyah, and he pays it to him less then ten Uqiyah.\" - or he said: \"Ten Dirham\" - \"then he becomes incapable (of paying the remainder), the he remains a slave.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib. And this acted upon according to most of the people of knowledge among the Companions of the Prophet (ﷺ) and others: The Mukatab is a slave as long as something remains due from him for his Kitabah. Al-Hajjaj bin Artat reported similarly from 'Amr bin Shu'aib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "Narrated Umm Salamah: That the Messenger of Allah (ﷺ) said: \"When one of you (women) has a Mukatab ho has with him what will fulfill (the Kitabah) then observe Hijab from him.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of this Hadith according to the people of knowledge is that of caution. They say that the Mukatab is not freed, even if he has the amount to pay, until he pays it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"Whichever person becomes bankrupt, and a man finds his particular merchandise with him, then he is more deserving of it than others. [He said:] There are narrations on this topic from Samurah and Ibn 'Umar. [Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to some of the people of knowledge and it is the view of Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge said that he is just like one of the debtors. This is the view of the people of Al-Kufah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "Narrated Abu Al-Waddak: That Abu Sa'eed said: \"We had some wine that belonged to an orphan. When Al-Ma'idah was revealed I asked the Messenger of Allah (ﷺ) about it, I said: 'It belongs to an orphan.' He said: 'Spill it out.'\" [He said:] There is something on this topic from Anas bin Malik. [Abu 'Eisa said:] The Hadith of Abu Sa'eed is a Hasan [Sahih] Hadith. Similar to this has been reported through other routes from the Prophet (ﷺ). Some of the people of knowledge stated according to this, they dislike the usage of wine for making vinegar. And the only thing that they disliked about it, and Allah knows best, is for a Muslim to have wine in his house until it becomes vinegar. Abu Al-Waddak's name is Jabr bin Nawf",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: \"Fulfill the trust for the one who entrusted you, and do not cheat the one who cheated you.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge followed this Hadith, they said that when something belonging to a man is with another and he leaves (with it), then he has something that belongs to him, he may not withhold from him an equivalent to what the other took of his. Some of the people of knowledge among the Tabi'in allowed that. This is the view of Sufyan Ath-Thawri, he said: \"If one man has some Dirham that belong to another, and the second has some Dinar belonging to the first, he may not withhold any in place of his Dirham, unless it so happens that he has some Dirham of his, then in that case he can withhold some of his Dirham equal to what he is owed by the first",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "Narrated Abu Umamah: \"During the year of the Farewell Pilgrimage, I heard the Prophet (ﷺ) saying during the Khutbah: \"The borrowed is to be returned, and the guarantor is responsible, and the debt is to be repaid.\" [Abu 'Eisa said:] There are narrations on this topic from Samurah, Safwan bin Umayyah, and Anas. [He said:] The Hadith of Abu Umamah is a Hasan Gharib Hadith. It has also been reported through other routes besides this, from Abu Umamah, from the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "Narrated Qatadah: From Al-Hasan, from Samurah, that the Prophet (ﷺ) said: \"Upon the hand is what it took, until it is returned.\" Qatadah said: \"Then Al-Hasan forgot, so he said: 'It is something you entrusted, he is not liable for it.' \" Meaning the borrowed property. [Abu 'Eisa said:] This Hadith is Hasan Sahih. Some of the people pf knowledge, among the Companions of the Prophet (ﷺ) and others, followed this Hadith. They said that the possessor of the borrowed thing is liable. This is the view of Ash-Shafi'i and Ahmad. Some of the people of knowledge among the Companions and others said that the possessor of the borrowed this is not liable unless there is dispute. This is the view of Sufyan Ath-Thawri and the people of Al-Kufah, and it is the view of Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "Narrated Muhammad bin Ibrahim : From Sa'eed bin Al-Musayyab, from Ma'mar bin 'Abdullah bin Nadlah who said: \"I heard the Messenger of Allah (ﷺ) saying: 'Hoarding is nothing but sin.' So I (Muhammad) said to Sa'eed: \"O Abu Muhammad! You hoard?\" He said: \"And Ma'mar would hoard.\" It is also been reported that Sa'eed bin Musayyab would hoard oil, (camel) fodder, and the like. [Abu 'Eisa said:] There are narrations on this topic from 'Umar, 'Ali, Abu Umamah, and Ibn 'Umar. The Hadith of Ma'mar is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge, they dislike hoarding food, and some of them make a concession for hoarding things other than food. Ibn Al-Mubarak said: \"There is no harm in hoarding cotton, goat pelts and like",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "Narrated Ibn 'Abbas: That the Prophet (ﷺ) said: \"Do not go out to meet the market (caravan), do not leave animals un-milked (to deceive the buyer), nor out-spend one another.\" [Abu 'Eisa said:] There are narrations on this topic from Ibn Mas'ud and Abu Hurairah. The Hadith if Ibn 'Abbas is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge, they dislike selling the Muhaffalah, and it is the Musarrah that has not been milked by its owner in days or more than that, so the milk accumulates in its udder to impress the purchaser. This is a type of deceit and misrepresentation",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "Narrated 'Abdullah bin Mas'ud: That the Messenger of Allah (ﷺ) said: \"Whoever takes a false oath to deprive a Muslim of his wealth, he will meet Allah while He is angry with him.\" Al-Ash'ath bin Qais said: \"It is about me, by Allah! There was a dispute about some land between myself and a man from the Jews who denied my ownership of it, so I took him to the Prophet (ﷺ). The Messenger of Allah (ﷺ) said to me: 'Do you have any proof ?' I said: 'No'. So he said to Jew: 'Take an oath.' I said: 'O Messenger of Allah! If he takes an oath then my property will be gone!' So Allah, Most High revealed: Verily those who purchase a small gain at the cost of Allah's Covenant and their oaths.. until the end of the Ayah.\" [Abu 'Eisa said:] There are narrations on this topic from Wa'il bin Hujr, Abu Musa, Abu Umamah bin Tha'labah Al-Ansari, and 'Imran bin Husain. The Hadith of Ibn Mas'ud is a Hasan Sahih Hadith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "Narrated Ibn Mas'ud: That the Messenger of Allah (ﷺ) said: \"When the two parties (in a deal) disagree then the seller's statement is taken as valid, and the purchaser retains the option.\" [Abu 'Eisa said:] This Hadith is Mursal. 'Awn bin 'Abdullah did not see Ibn Mas'ud. This Hadith has also been reported from Al-Qasim bin 'Abdur-Rahman, from Ibn Mas'ud from the Prophet (ﷺ). But it also Mursal. [Abu 'Eisa said:] Ishaq bin Mansur said: \"I said to Ahmad: what if when the two parties disagree and there is no proof (what is done)?' He said: 'The saying of the owner of the merchandise is taken as valid or they both refuse.' And Ishaq said as he did, and that in every case where his saying is taken, he must swear.'\" [Abu 'Eisa said:] Similar to this has been reported from some of the people of knowledge among the Tabi'in, Shuraih is among those",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "Narrated Abu Al-Minhal: From Iyas bin 'Abd al-Muzani who said: \"The Prophet (ﷺ) prohibited selling water.\" [He said:] There are narrations on this topic from Jabir, Buhaisah from her father, Abu Hurairah, 'Aishah, Anas and 'Abdullah bin 'Amr. [Abu 'Eisa said:] The Hadith is Iyas is a Hasan Sahih Hadith. This is acted upon according to most of the people of knowledge, they dislike selling water. This is the view of Ibn Al-Mubarak, Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge permitted selling water, Al-Hasan al-Basri is one of them",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: \"Do not withhold surplus water so that it is prevented from the pasture.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Al-Munhal's name is 'Abdur-Rahman bin Mut'im, he is from Al-Kufah, and he is oen that Habib bin Abi Thabit reports from. Abu Al-Munhal Sayyar bin Salamah is from Al-Basrah, he is the companion of Abu Barzah Al-Aslami",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "Narrated Ibn 'Umar: \"The Prophet (ﷺ) prohibited studding the stallion.\" [He said:] There are narrations on this topic from Abu Hurairah, Anas, and Abu Sa'eed. [Abu 'Eisa said:] The Hadith is Ibn 'Umar is a Hasan Sahih Hadith. This is acted upon according to some of the people of knowledge. There are those who made concession for accepting an honorarium for that",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "Narrated Anas bin Malik: \"A man from (the tribe of) Kilab asked the Messenger of Allah (ﷺ) about studding a stallion and he prohibited it. So he said: 'O Messenger of Allah! We stud the stallions so that we get honorarium (from the owners of the female horse)!' So he permitted it for honorarium.\" [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Ibrahim bin Humaid, from Hisham bin 'Urwah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "Narrated Rafi' b. Khadij: That the Messenger of Allah (ﷺ) said: \"The earnings of the cupper is filth, the earnings of the fornicator (from harlotry) is filth, and the price of a dog is filth.\" [He said:] There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Abu Masu'd, Jabir, Abu Hurairah, Ibn 'Abbas, Ibn 'Umar, and 'Abdullah bin Ja'far. [Abu 'Eisa said:] The Hadith is Rafi' is a Hasan Sahih Hadith. This is acted upon according to most of the people of knowledge, they disliked the price of a dog. This the view of Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge permitted the price of the hunting dog",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "Narrated Abu Mas'ud Al-Ansari: \"The Messenger of Allah (ﷺ) prohibited the price of a dog, the earnings of the fornicator (from harlotry), and the news of the fortune-teller.\" This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "Narrated Ibn Muhayyisah of Banu Harithah: From his father, that he sought permission from the Prophet (ﷺ) to take the wages for cupping and he (ﷺ) forbade him from it. He continued asking him and seeking his permission until he said: \"Use it to give fodder to your water-carrying camels, and to feed your slaves.\" [He said:] There are narrations on this topic from Rafi' bin Khadij, Abu Juhaifah, Jabir, and As-Sa'ib bin Yazid. [Abu 'Eisa said:] The Hadith of Muhayyisah is a Hasan Sahih Hadith. This is acted upon according to some of the people of knowledge. Ahmad said: \"If I am asked for something by cupper then I deny him, acting upon this Hadith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "Narrated Anas: \"The Messenger of Allah (ﷺ) was cupped. Abu Talhah did the cupping. So he ordered that he be given two Sa' of food, and he spoke to his masters to reduce his taxes. He said: 'The most virtuous of what you treat with is cupping.' Or, he said: 'The best of your treatments is cupping.'\" [He said:] There are narrations on this topic from 'Ali, Ibn 'Abbas, and Ibn 'Umar. [Abu 'Eisa said:] The Hadith of Anas is a Hasan Sahih. Some of the people of knowledge among the Companions of the Prophet (ﷺ), and others permitted paying the cupper. This is the view of Ash-Shafi'i",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "Narrated Jabir: \"The Messenger of Allah (ﷺ) prohibited the price of the dog and the cat.\" [Abu 'Eisa said:] There is some confusion (Idtirab) in the chain for this Hadith. The price of a cat is not correct. This Hadith has been reported from Al-A'mash, from some of his companions, from Jabir, and they caused some confusion for Al-A'mash in this narration. There are those among the people of knowledge who disliked the price of a cat, and some of them permitted it. This is the view of Ahmad and Ishaq. It has been reported from Ibn Al-Fudail, from Al-A'mash, from Abu Hazim, from Abu Hurairah from the Prophet (ﷺ), through other than this route",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "Narrated Jabir: \"The Messenger of Allah (ﷺ) prohibited eating the cat and from its price.\" [Abu 'Eisa said:] This Hadith is Gharib. We do not know of any major (known) narrators who reports from 'Umar bin Zaid (one of the narrators) besides 'Abdur-Razzaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": 1281,
			"text": "Narrated Abu Al-Muhazzim: From Abu Hurairah who said: \"The price of a dog was prohibited, except for the hunting dog.\" [Abu 'Eisa said:] This Hadith is not correct from this route. Abu Al-Muhazzim's name is Yazid bin Sufyan, and Shu'bah bin Al-Hajjaj criticized him and graded him weak. Similar to this has been reported from Jabir, from the Prophet (ﷺ), but its chain is also not correct",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "Narrated Abu Umamah: That the Messenger of Allah (ﷺ) said: \"Do not sell the (slave) female singers, not purchase them, nor teach them (to sing). And there is no good in trading in them, and their prices are unlawful. It was about the likes of this that this Ayah was revealed: And among mankind is he who purchases idle talk to divert from the way of Allah.\" [He said:] There is narration about this from 'Umar bin Al-Khattab. [Abu 'Eisa said:] We only know of the Hadith of Abu Umamah, like this, from this route. Some of the people of knowledge have criticized 'Ali bin Yazid (one of the narrators) and graded him weak, and he is from Ash-Sham",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "Narrated Abu Ayyub: \"I narrated heard the Messenger of Allah (ﷺ) saying: 'Whoever seperates a mother from her child, Allah seperates him and his most beloved on the Day of Judgement.'\" [Abu 'Eisa said:] This Hadith is Hasan Gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "Narrated 'Ali : \"The Messenger of Allah (ﷺ) gave me two boys who were brothers, so I sold one of them, and the Messenger of Allah (ﷺ) said to me: 'O, 'Ali! What happened to your boy?' So I informed him, and he said: 'Return him, return him.'\" [Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others, disliked separating between the captives when selling them. Some of the people of knowledge permitted separating the children that were born in the land of Islam, but the first view is more correct. It has been related that Ibrahim An-Nakha'i seperated a mother and her child in a sale, so he was asked about that. He said: \"I sought her permission for that and she approved",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "Narrated 'Aishah: That the Messenger of Allah (ﷺ) judged: \"The produce is for the responsible one.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. This Hadith has been reported through routes other than this, and this acted upon according to the people of knowledge",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": 1286,
			"text": "Narrated 'Aishah: \"The Prophet (ﷺ) judged that the produce is produce is for the responsible one.\" [He said:] This Hadith is Hasan Sahih, Gharib as a Hadith of Hisham bin 'Urwah (a narrator). [Abu 'Eisa said:] Muslim bin Khalid Az-Zanji reported this Hadith from Hisham, from 'Urwah. Jarir reported it from Hisham as well. It is said that the narration of Jarir has Tadlis in in it, that Jarir committed the Tadlis, he did not hear it from Hisham bin 'Urwah. As for the meaning of \"the produce is for the responsible one,\" he is the man who purchased the slave then the slave produced for him, and he found some defect in him so he returned him to the seller. Then the produce (of his work) is the purchaser's. In cases similar to this, the produce is for the responsible one. [Abu 'Eisa said:] Muhammad bin Isma'il called this Hadith Gharib, as a narration of 'Umar bin 'Ali (one of the narrators). I said: \"Do you think that he committed Tadlis?\" He said:\"No",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": 1287,
			"text": "Narrated Ibn 'Umar: That the Prophet (ﷺ) said: \"Whoever enters an orchard then let him eat, but not take any in his garment.\" [He said:] There are narrations on this topic from 'Abdullah bin 'Amr, 'Abbad bin Shurahbil, Rafi' bin 'Amr, 'Umair the freed slave of Abi Al-Lahm, and Abu Hurairah. [Abu 'Eisa said:] The Hadith of Ibn 'Umar is Gharib Hadith. We do not know of it from this route except from Yahya bin Sulaim. Some of the people of knowledge have permitted the wayfarer to eat from the fruits, and some of them disliked it without paying",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "Narrated Rafi' bin 'Amr: \"I was throwing stones at a date-palm belonging to some of the Ansar. They took me along with them to the Prophet (ﷺ). He said: \"O Rafi'! Why were you throwing stones at their date-palm?'\" He said: \"I said: 'Out of hunger, O Messenger of Allah! He said: 'Do not throw stones at them, eat what falls. May Allah fill you and quench your thirst.'\" This Hadith is Hasan Gharib Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "Narrated 'Amr bin Shu'aib: From his father, from his grandfather, that the Prophet (ﷺ) was asked about hanging fruits (on the trees), so he said: \"Whoever is in need and picks some of it without taking any in his garment, then there is no sin upon him.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "Narrated Jabir: \"The Messenger of Allah (ﷺ) prohibited Al-Muhaqalah, Al-Muzabanah, Al-Mukhabarah, and making an exception (in a sale) unless it is made known.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih, Gharib from this route as narration of Yunus bin 'Ubaid, from 'Ata, from Jabir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "Narrated Ibn 'Abbas: That the Prophet (ﷺ) said: \"Whoever buys food, then he is not to sell it until he takes possession of it.\" Ibn 'Abbas said: \"All things are considered the same (in this regard).\" [He said:] There are narrations on this topic from Jabir, Ibn 'Umar, and Abu Hurairah. [Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Sahih Hadith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "Narrated Ibn 'Umar: That the Messenger of Allah (ﷺ) said: \"None of you is to sell over the sale of others, nor to propose over the proposal of others.\" [He said:] There are narration on this topic from Abu Hurairah and Samurah. [Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. And it has been reported from the Prophet (ﷺ) that he said: \"Do not haggle in competition with your brother's haggling.\" And the meaning of sale in this Hadith of the Prophet (ﷺ), according to some of the people of knowledge is to haggle",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "Narrated Anas: From Abu Talhah that he said: \"O Prophet of Allah! I had purchased some wine for the orphans under my care. He said: 'Spill out the wine, and break the jugs.'\" [He said:] There are narrations on this topic from Jabir, 'Aishah, Abu Sa'eed, Ibn Mas'ud, Ibn 'Umar, and Anas. [Abu 'Eisa said:] The Hadith of Abu Talhah, Ath-Thawri reported this Hadith from As-Suddi, from Yahya bin 'Abbad, from Anas: \"That Abu Talhah was with him\" and this is more correct than the narration of Al-laith (no. 1293)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "Narrated Anas bin Malik: \"I asked the Messenger of Allah (ﷺ) 'Can wine be used for vinegar?' He said: 'No'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "Narrated Anas bin Malik: \"The Messenger of Allah (ﷺ) cursed ten involved in wine: The one who presses it, the one who has it pressed, its drinker, its carrier, and the one it is carried to, its server, its seller, the consumption of its price, the one who purchases it and the one it was purchased for.\" [Abu 'Eisa said:] This Hadith is Gharib as a narration of Anas. Similar to this has been reported from Ibn 'Abbas, Ibn Mas'ud, and Ibn 'Umar, from the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "Narrated Samurah bin Jundab: That the Prophet (ﷺ) said: \"When one of you comes upon livestock, if its owner is with it then seek his permission. If he permits him then let him milk it and drink. If there is no one with it then call out three times, if someone answers then seek his permission. If no one answers then let him milk it and drink without carrying (any of it away).\" [He said:] There are narrations on this topic from Ibn 'Umar and Abu Sa'eed. [Abu 'Eisa said:] The Hadith of Samurah is a Hasan Gharib Sahih Hadith. This is acted upon according to some of the people of knowledge, and it is the view of Ahmad and Ishaq. [Abu 'Eisa said:] 'Ali bin Al-Madini said: \"It is correct that Al-Hasan heard this from Samurah.\" Some of the people of Hadith criticized the narrations of Al-Hasan from Samurah, they said that he only narrated from a writing of Samurah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "Narrated Jabir bin ‘Abdullah : That during the Year of the Conquest, while he was in Makkah, he heard the Messenger of Allah (ﷺ) saying: \"Indeed Allah and His Messenger unlawful the sale of wine, dead carcasses, the pig, and idols.\" They said: \"O Messenger of Allah! What about the fat of carcasses? For indeed it is used to coat the ships, skins are oiled with it, and people use it for lamps?\" He said: \"No. It is unlawful.\" Then, with that, the Messenger of Allah (ﷺ) said: \"May Allah fight (curse) the Jews! Indeed Allah made the fat unlawful for them, they melted it, sold it, and consumed its price.\" [He said:] There are narrations of this topic from 'Umar and Ibn 'Abbas. [Abu 'Eisa said:] The Hadith of Jabir is Hasan Sahih Hadith. This is acted upon according to the people of knowledge",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "Narrated Ibn 'Abbas: That the Messenger of Allah (ﷺ) said: \"Ours is not a bad example: The one who takes back his gift is like the dog who takes back his vomit.\" [He said:] On this topic, there is the narration from Ibn 'Umar from the Prophet (ﷺ) that he said: \"It is not lawful for anyone that has given a gift to take it back, except for a father who gives something to his son",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "Narrated 'Amr bin Shu'aib: That he heard Tawus narrating from Ibn 'Umar and Ibn 'Abbas, and they both narrated this Hadith from the Prophet (ﷺ). (A Hadith similar to no. 1298). [Abu 'Eisa said:] The Hadith of Ibn 'Abbas (ra), is a Hasan Sahih Hadith. This Hadith is acted upon according to soe of the people of knowledge among the Companions of the Prophet (ﷺ). They said whoever gives a gift to a closely related relative, then he is not to take back his gift. And whoever gives a gift to someone other then a close relative, then he may take it back as long as it has not been reciprocated. This is the view of Ath-Thawri. Ash-Shafi'i said: \"It is not lawful for any that has given a gift to take it back except for what the father gave to his son.\" Ash-Shafi'i argued with the Hadith of 'Abdullah bin 'Umar from the Prophet (ﷺ): \"It is not lawful for anyone that has given a gift to take it back, except for a father who give something to his son",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "Narrated Ibn 'Umar: From Zaid bin Thabit that the Prophet (ﷺ) prohibited Al-Muhalaqah and Al-Muzabanah, except that he permitted those practice Al-'Araya to sell it for a like estimation. [He said:] There are narrations on this topic from Abu Hurairah and Jabir. [Abu 'Eisa said:] The Hadith if Zaid bin Thabit: This is how Muhammad bin Ishaq reported this Hadith. Ayyub, 'Ubaidullah bin 'Umar, and Malik bin Anas reported it from Nafi', from 'Ibn Umar: \"The Prophet (ﷺ) prohibited Al-Muhalaqah and Al-Muzabanah.\" With this chain of narration, it has been reported from Ibn 'Umar, from Zaid bin Thabit, from the Prophet (ﷺ) that he permitted Al-'Araya in cases less that five Wasq. This is more correct than the narration of Muhammad bin Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "Narrated Ibn 'Umar: From Zaid bin Thabit that the Messenger of Allah (ﷺ) permitted selling in Al-'Araya by estimating it. [Abu 'Eisa said:] This Hadith is Hasan Sahih. The Hadith of Abu Hurairah is Hasan Sahih. And this is acted upon according to some of the people of knowledge. Among them Ash-Shafi'i, Ahmad and Ishaq. They said Al-'Araya is an exception from the general scope of the prohibition of the Prophet (ﷺ) when he prohibited Al-Muhaqalah and Al-Muzabanah. They argued using this Hadith of Zaid bin Thabit and the Hadith of Abu Hurairah. They said that he may buy what is less than five Wasq. According to some of the people of knowledge, this means that the Prophet (ﷺ) wanted to make less restriction for them on this matter because they complained to him saying: \"We dont by anything with dried dates except fruit.\" So he permitted them to buy less than five Wasq worth so they could eat fresh dates",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "Narrated Bushair bin Yasar, the freed slave of Banu Harithah: Rafi' bin Khadij and Sahl bin Abi Hathmah narrated to him that the Messenger of Allah (ﷺ) prohibited Al-Muzabanah sales, (buying) fruits with dried dates, except for those who practice Al-'Araya - for he permitted it for them - and from buying grapes with raisins, and from every fruit by its estimation. [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"Do not practice An-Najsh.\" [He said:] There are narrations on this topic from Ibn 'Umar and Anas. [Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge, they disliked An-Najsh. [Abu 'Eisa said:] An-Najsh is when a man who knows about the goods comes to the owner of the goods to offer him more than what it is worth, doing so in the presence of the buyer. He intends to seduce the buyer while he himself does not want to buy it, rather he only wants to deceive the buyer with his offer. And this is type of deceit. Ash-Shafi'i said: \"If a man commits An-Najsh the he has sinned due to what he has done, but the sale is permissible, because the buyer did not commit An-Najsh",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "Narrated Suwaid bin Qais: \"Makhrafah Al-'Abdi and I brought linens from Hajar. The Prophet (ﷺ) came to us in bargain with us with some pants. There was someone with me who weighed (the goods) to determine the value. So the the Prophet (ﷺ) said to the one weighing: 'Weigh and add more.'\" [He said:] There are narrations on this topic from Jabir and Abu Hurairah. [Abu 'Eisa said:] The Hadith of Suwaid is a Hasan Sahih Hadith. The people of knowledge consider it recommended to add more when weighing. Shu'bah reported this Hadith from Simak, so he said: \"From Abu Safwan\" and he mentioned the narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"Whoever grants respite to an indigent or alleviates it for him, Allah will shade him on the Day of Judgement under His Throne, a Day in which there is no shade except His shade.\" [He said:] There are narrations on this topic from Abu Al-Yasar, Abu Qatadah, Hudhaifah, Abu Mas'ud, 'Ubadah, and Jabir. [Abu 'Eisa said:] The Hadith if Abu Hurairah is a Hasan Sahih Gharib Hadith from this route",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "Narrated Abu Mas'ud: That the Messenger of Allah (ﷺ) said: \"A man among those before you was called to reckon and nothing good was found with him. Except that he was a wealthy man so he used to mix with the pople and he would tell his servant to be lenient with the insolvent. So Allah, Mighty and Sublime is He, said: 'We are more worthy of that than him, so be lenient with him.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Al-Yasar is Ka'b bin 'Amr",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: \"Procrastination (in paying a debt) by a rich person is oppression. So if your debt is transferred from your debtor to a rich debtor, you should agree.\" He said: There are narrations on this topic from Ibn 'Umar, and Ash-Sharid bin Suwaid Ath-Thaqafi",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "Narrated Ibn 'Umar: That the Prophet (ﷺ) said: \"Procrastination (in paying a debt) by a rich person is oppression. So if your debt is transfered from your debtor you should agree, and do not make two sales in one sale.\" [Abu 'Eisa said:] The Hadith is the Abu Hurairah (no. 1308) is a Hasan Sahih Hadith. And its meaning is that when the debt of one of you is transferred then agree. Some of the people of knowledge said when a man is offered to transfer his debt to a rich man and he does so, then the transferor is free of it, he is not to seek its return from the transferor. This is the view of Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge said: \"When this wealth could not be collected due to bankruptcy of the one it was transferred to, then he may seek its return to the first one.\" They argue this view with the saying of 'Uthman and others, when they said: \"There is nothing due on a Muslim's wealth that is lost.\" Ishaq said: \"The meaning of this Hadith: 'There is nothing due on a Muslim's wealth that is lost' this is when a man transfers it to another whom he thinks is wealthy, then he becomes bankrupt, so there is nothing due on the Muslim's wealth that is lost",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "Narrated Abu Hurairah: \"The Messenger of Allah (ﷺ) prohibited sales of Al-Munabadhah and Al-Mulamasah.\" He said: There are narrations on this topic from Abu Sa'eed and Ibn 'Umar. [Abu 'Eisa said:] The Hadith is Abu Hurairah is a Hasan Sahih Hadith. And the meaning of (Munabadhah) in this Hadith is when it is said: \"When I throw something to you then the sale between you and I is concluded.\" And Al-Mulamasah is that he says: \"When you touch something then the sale is concluded.\" Even if he did not see it at all, like if it was inside of a bag or something else. There are merely sales practices of the people of Jahiliyyah so they were prohibited",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "Narrated Ibn 'Abbas: \"When the Prophet (ﷺ) arrived in Al-Madinah, they were paying in advance for fruits. So he said: 'Whoever pays in advance, then let him pay in advance for known measurements (of dates), and known weights for a specified period of time.'\" He said: There are narrations on this topic from Ibn Abi Awfa and 'Abdur-Rahman bin Abza. [Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They allow for advanced payments on food, garments and other things in which the limits and description are known. They differed over delay in delivery of animals. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others thought that delay in delivery of animals is allowed. This is the view of Ash-Shafi'i, Ahmad and Ishaq. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others, disliked delay in delivery of animals. This is the saying of Sufyan and the people of Al-Kufah. And Abu Al-Minhal's (a narrator) name is 'Abdur-Rahman bin Mut'im",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "Narrated Jabir bin ‘Abdullah : That Allah's Prophet (ﷺ) said: \"Whoever has a partner in an orchard, then he is not to sell his share of that until he proposes that to his partner.\" [Abu 'Eisa said:] The chain of this Hadith is not connected. I heard Muhammad bin Isma'il saying: It is said that \"Sulaiman Al-Yashkuri died during the lifetime of Jabir bin 'Abdullah.\" He said: \"And Qatadah did not hear from him, nor did Abu Bishr.\" Muhammad said: \"We do not know of any of them hearing from Sulaiman Al-Yashkuri except that 'Amr bin Dinar possibly heard from his during the lifetome of Jabir bin 'Abdullah.\" He said: \"Qatadah only narrated from a writing of Sulaiman Al-Yashkuri, and he has a book from Jabir bin 'Abdullah.\" Abu Bakr Al-'Attar 'Abdul Quddus narrates to us, he said: \" 'Ali bin Al-Madini said: 'Yahya bin Sa'eed said: \"Sulaiman At-Taymi said: 'They went with the book of Jabir bin 'Abdullah to Al-Hasan Al-Basri and he took it' - or he said - 'and they reported it. Then they took it to Qatadah and reported it, so they gave it to me but I did not report it [he said: 'I refused it'] This was narrated to us by Abu Bakr Al-'Attar from 'Ali bin Al-Madini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "Narrated Abu Az-Zubair: From Jabir that the Prophet (ﷺ) prohibited Al-Muhaqalah, Al-Muzabanah, Al-Mukhabarah, and Al-Mu'awamah, and he permitted it in the case of Al-'Araya. [Abu 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "Narrated Anas: \"Prices became excessive during the time of the Messenger of Allah (ﷺ), so they said: 'O Messenger of Allah! Set prices for us!' So he said: 'Indeed Allah is Al-Musa'ir, Al-Qabid, Al-Basir, Ar-Razzaq. And I am hopeful that I meet my Lord and none of you are seeking (recompense from) me for an injustice involving blood or wealth.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) passed by a pile of food. He put his fingers in it and felt wetness. He said: 'O owner of the food! What is this ?' He replied: 'It was rained upon O Messenger of Allah.' He said: 'Why not put it on top of the food so the people can see it?' Then he said: 'Whoever cheats, he is not one of us.'\" He said: There are narrations on this topic from Ibn 'Umar, Abu Al-Hamra', Ibn 'Abbas, Buraidah, Abu Burdah bin Niyar, and Hudhaifah bin Al-Yaman. [Abu 'Eisa said:] The Hadith of Abu Hurairah is Hasan Sahih Hadith. This is acted upon according to the people of knowledge. They dislike cheating and they say that cheating is unlawful",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "Narrated Abu Hurairah: \"The Messenger of Allah (ﷺ) took a camel of a particular age on loan. He gave back to him a camel of a better age than the one he was given. He said: 'The best among you is the best in repaying.'\" He said: There is something on this topic from Abu Rafi'. [Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. Shu'bah and Sufyan reported it from Salamah. This is acted upon according to some of the people of knowledge, they saw no harm is taking a camel of a particular age as a loan. This is the view of Ash-Shafi'i, Ahmad, and Ishaq. But some of them disliked that",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "Narrated Abu Rafi', the freed slave of the Messenger of Allah (ﷺ): \"The Messenger of Allah got a camel in advance. Some camels from the charity.\" Abu Rafi' said: \"So the Messenger of Allah (ﷺ) told me to pay the man back for his camel. I said: 'I did not find among the camels but a superior selection of Raba'. The Messenger of Allah (ﷺ) said: 'Give it to him, for indeed the base of people is the best of them in repaying.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"Indeed Allah loves tolerance in selling, tolerance in buying, and tolerance in repaying.\" He said: There is something on this topic from Jabir. [Abu 'Eisa said:] This Hadith is Gharib. Some of them reported this Hadith from Yunus, from Sa'eed Al-Maqburi, from Abu Hurairah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "Narrated Jabir: That the Messenger of Allah (ﷺ) said: \"Allah forgave a man who was before you: He was tolerant when selling, tolerant when purchasing, and tolerant when repaying.\" He said: This Hadith is Gharib Sahih Hasan from this route",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: \"When you see someone selling or buying in the Masjid then say: 'May Allah not profit your business.' And when you see someone announcing about something lost then say: 'May Allah not return it to you.'\" The Hadith of Abu Hurairah is Hasan Gharib. This is acted upon according to some of the people of knowledge. They dislike selling and buying in the Masjid. This is the view of Ahmad and Ishaq. Some of the people of knowledge permitted selling and buying in the Masjid",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 125
			}
		}
	]
}