{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2415,
			"arabicnumber": 2415,
			"text": "Adi bin Hatim narrated that the Messenger of Allah SAW said:\"There is no man among you except that his Lord shall converse with him on the Day of Judgement, there being no interpreter between him and Him (Allah). Then he looks to the south (his right) and does not see anything except the things he put forward (of good), then he looks to the north (his left) and he does not see anything except the things he put forward (of evil), then he turns to look before him to find he is facing the Fire.\" The Messenger of Allah SAW, said: \"Whoever among you is able to protect his face from [the heat of] the Fire – even with a piece of a date - then let him do so.\" (Sahih) [Abu 'Eisa said: This Hadith is Hasan Sahih]. Abu As-Sã'ib narrated to us: \"One day, Waki' narrated this Hadith to us from Al-'Amash. When Waki' was finished with this Hadith, he said: 'Whoever is present from the inhabitants of Khurãsãn, then let him seek the reward of spreading this Hadith in Khurãsãn.\" Abu 'Eisa said: The Jahmiyyah rejected this. [Abu As-Sã'ib's name is Salam bin Junadah bin Khãlid bin Jäbir bin Samurah Al-Kufi]. This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2416,
			"arabicnumber": 2416,
			"text": "Ibn Mas'ud narrated that the Messenger of Allah SAW said:\"The feet of the son of Adam shall not move from before his Lord on the Day of Judgement, until he is asked about five things: About his life and what he did with it, about his youth and what he wore it out in, about his wealth and how he earned it, and spent it upon, and what he did with what he knew.\" (Da'if) [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it as a narration of Ibn Mas'üd from the Prophet except through the narration of Husain bin Qais. Husain [bin Qais] was graded weak in Hadith [due to his memory]. There are narrations on this topic from Abu Barzah and Abu Sa'eed",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2417,
			"arabicnumber": 2417,
			"text": "Abu Barzah Al-Aslami narrated that the Messenger of Allah (s.a.w) said:\"The feet of the slave of Allah shall not move [on the Day of Judgement] until he is asked about five things: about his life and what he did with it, about his knowledge and what he did with it, about his wealth and how he earned it and where he spent it on, about his body and for what did he wear it out.\" [He said:] This Hadith is Hasan Sahih. Sa'eed bin Abdullah bin Juraij (a narrator in the chain) [is from Al-Basrah], and he is the freed slave of Abu Barzah AlAslami, and Abu Barzah AlAslami's name is Nadlah bin 'Ubaid",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2418,
			"arabicnumber": 2418,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"Do you know who the bankrupt is?\" They said: \"O Messenger of Allah SAW! The bankrupt among us is the one who has no Dirham nor property.\" The Messenger of Allah (s.a.w) said: \"The bankrupt in my Ummah is the one who comes with Salat and fasting and Zakat on the Day of Judgement, but he comes having abused this one, falsely accusing that one, wrongfully consuming the wealth of this one, spilling the blood of that one, and beating this one. So he is seated, and this one is requited from his rewards. If his rewards are exhausted before the sins that he committed are requited, then some of their sins will be taken and cast upon him, then he will be cast into the Fire.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2419,
			"arabicnumber": 2419,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"May Allah have mercy upon a servant who has wronged his brother in his honor or his wealth, then he comes to him to seek his pardon before (his right) is taken, when he has no Dinar nor Dirham. Then if he has any rewards, it will be taken from his rewards, and if he have no rewards, Then some of his (brothers) bad deeds will be levied upon him.\" [Abu 'Eisa said:] This Hadith is Sahih [Gharib as a narration of Sa'eed Al-Maqburi]. Malik bin Anas also reported it from Sa'eed A]-Maqburl, from Abu Hurairah from the Prophet SAW, and it is similar in meaning",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2420,
			"arabicnumber": 2420,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"Rights will be given to their due, such that the hornless sheep would get its claim from the horned sheep.\" There are narrations on this topic from Abu Dharr and 'Abdullah bin Unais. [Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2421,
			"arabicnumber": 2421,
			"text": "Sulaim bin 'Amir narrated from Al-Miqdad, a Companion of the Messenger of Allah (s.a.w) who said:\"I heard the Messenger of Allah (s.a.w) saying: 'On the Day of Judgement, the sun will be drawn near the servants, until it has come a mile or two (away).'\" Sulaim bin 'Amir said: \" I do not know if it is miles that refer to distance on the land, or Al-Mil which is used to apply Kuhl for the eyes.\" He (the Prophet (s.a.w)): \"The sun will melt them, until they will be in sweat according to their deeds. Among them one will be covered up to his ankles, and among them will be one who is covered up to his knees, and among them will be one who is covered up to his waist, and among them will be one who is bridled with it.' I saw the Messenger of Allah (s.a.w) indicating with his hand toward his mouth, meaning that one would be bridled with it.'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. There are narrations on this topic from Abu Sa'eed and Ibn 'Umar",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2422,
			"arabicnumber": 2422,
			"text": "Hammad bin Zayd narrated from Ayub, from Nafi', from Ibn 'Umar – Hammad said - :“And it is Marfu` in our view.” (He said): “The Day when all mankind will stand before the Lord of all that exists. They will be standing in their sweat up to the middle of their ears.” (Sahih) [Abu 'Eisa said:] This Hadith is Hasan Sahih. (Another chain) from the Prophet SAW with similar meaning",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2423,
			"arabicnumber": 2423,
			"text": "Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said:\"The people will be gathered on the Day of Resurrection bare-foot, naked and uncircumcised as they were created.\" Then he recited: \"As we begin the first creation, we shall repeat it: A promise binding upon Us. Truly We shall do it. And the first of people to be clothed will be Ibrahim. Among my companions will be some men who are taken to the right and to the left. I will say: 'O my Lord! My companions!' It will be said: 'You do not know what they innovated after you, they continued to be apostates since you parted from them.' So I will say as the righteous worshipper said: If you punish them, they are your slaves, and if You forgive them, indeed You, only You are the Almighty, the All-Wise.\" (Another chain) and he mentioned similarly. [Abü 'Eisa said:] This Hadith is Hasan Sahih",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2424,
			"arabicnumber": 2424,
			"text": "Bahz bin Hakim narrated from his father, from his grandfather, that the Messenger of Allah (s.a.w) said:\"You shall be gathered walking, riding, and dragged upon your faces.\" There is a narration on this topic from Abu Hurairah. [Abu 'Eisa said:] This Hadith is Hasan [Sahih]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2425,
			"arabicnumber": 2425,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"The people will face three presentations on the Day of Judgement. As for (the first) two presentations, they are the arguments and the excuses, as for the third presentation, upon that the records will fly into the hands. Some will take them in their right hand, and some will take them in their left hand.\" [Abu 'Eisa said:] This Hadith is not correct, because Al-Hasan did not hear from Abu Hurairah. Some of them reported it from 'Ali bin 'Ali - and he is Ar-Rifa'i - from Al-Hasan, from Abu Musã from the Prophet SAW. [Abu 'Eisa said:] This Hadith is not correct, because Al-Hasan did not hear from Abü Musa",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2426,
			"arabicnumber": 2426,
			"text": "Ibn 'Abi Mulaikah narrated that 'Aishah said:\"I heard the Messenger of Allah (s.a.w) saying: 'Whoever his account is questioned about , he shall be ruined.' I said: 'O Messenger of Allah! Indeed Allah [Most High] has said: Then as for him who shall be given his Record in his right hand. He surely will receive an easy reckoning.' Then he said: 'That is the presentation.'\" [Abu 'Eisa said:] This Hadith is Sahih Hasan, Ayyub also reported it from Ibn Abi Mulaikah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2427,
			"arabicnumber": 2427,
			"text": "Anas narrated that the Prophet (s.a.w) said:\"The son of Adam will be brought on the Day of Judgement as if he is a goat kid to be stood before Allah, Most High. Allah will say to him: 'I gave to you, I granted you, and I bestowed favors upon you. So what did you do?' So he says: 'I collected it, increased it, and left it as more than what it was. So return me and I shall give it all to You.' So He will say to him: 'Show me what you have prepared.' So he says: 'My Lord! I collected it, increased it and left it more than it was, So return me and I shall give it all to You.' So when the servant does not present any good he will be entered into the Fire.\" Abu 'Eisa said: More than one narrator reported this from Al-Hasan as his saying. And they did not rely upon Ismä'il bin Muslim who was graded weak in Hadith [due to his memory]. There are narrations on this topic from Abu Hurairah and Abu Sa'eed Al-Khudri",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2428,
			"arabicnumber": 2428,
			"text": "Abu Salih reported from Abu Hurairah and Abu Sa'eed that the Messenger of Allah (s.a.w) said:\"The servant will be brought on the Day of Judgement, and He will say to hi: 'Did I not give you hearing, sight, wealth, children, and did I not make the cattle and tillage subservient to you, and did I not leave you as the head of people taking from their wealth? Did you not think that you would have to meet with Me on this Day of yours?' So he will say: 'No.' So it will be said to him: 'Today you shall be forgotten just as you have forgotten Me.'\" [Abü 'Elsa said:] This Hadith is Sahih Gharib and the meaning of His saying: \"Today you shall be forgotten just as you have forgotten Me\" is: Today I shall leave you in chastisement. [This is how they have explained it]. [Abu 'Eisa said:] This is how some of the people of knowledge have explained this Ayah: So this Day We shall forget them...They said that it means: We shall leave them in chastisement",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2429,
			"arabicnumber": 2429,
			"text": "Abu Hurairah narrated:\"The Messenger of Allah (s.a.w) recited: That Day it will declare its information. And said: 'Do you know what its information is?' they said: 'Allah and His Messenger know best.' He said: 'Indeed its information is that it will testify against every servant, male and female, It will say that he did such and such, on such and such a day.' He said: 'With this it shall be ordered.'\" [Abu 'Eisa said:] This Hadith is Hasan Gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2430,
			"arabicnumber": 2430,
			"text": "Abdullah bin 'Amr bin Al-'As said:\"A Bedouin came to the Prophet (S.a.w) and said: 'What is the Sur?' He said: 'A horn that will be blown into'\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. It has been reported by more than one narrator from Sulaimãn At-Taimi, and we do not know of it except as his narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2431,
			"arabicnumber": 2431,
			"text": "Abu Sa'eed narrated:\"The Messenger of Allah (s.a.w) said: 'How can I be comfortable when the one with the horn is holding it to his lip, his ears listening for when he will be ordered to blow, so he can blow.' It was as if that was very hard upon the Companions of the Prophet (s.a.w), so he said to them: 'Say: \"Allah is sufficent for us and what a good protector He is, and upon Allah we rely.\" [Abu' Eisa said:] This Hadith is Hasan. This Hadith has been reported through other routes from 'Atiyyah, from Abu Sa'eed [AlKhudri] from the Prophet SAW, similarly",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2432,
			"arabicnumber": 2432,
			"text": "Al-Mughirah bin Shu'bah narrated that The Messenger of Allah (s.a.w) said:\"The sign of the believers upon the Sirat is: O lord, protect (us), protect (us).'\" [Abü 'Eisa said:] This Hadith is Gharib [as a narration of AlMughirah bin Shu'bah] we do not know of it except through the narration of 'Abdur-Rahmãn bin Ishaq [and there is something on this topic from Abu Hurairah]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2433,
			"arabicnumber": 2433,
			"text": "An-Nadr bin Anas bin Malik narrated from his father who said:\"I asked the Prophet (s.a.w) to intercede for me on the Day of Judgement. He said: 'I am the one to do so.'\" [He said:] \"I said: 'O Messenger of Allah! Then where shall I seek you?' He said: 'Seek me, the first time you should seek me is on the Sirat.'\" [He said:] \"I said: 'If I do not meet you upon the Sirat?' He said: 'Then seek me at the Mizan.' I said:'And if I do not meet you at the Mizan?' He said: 'Then seek me at the Hawd, for indeed I will not me missed at these three locations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "Abu Hurairah narrated:\"\"Some meat was brought to the Prophet (s.a.w) and a foreleg was presented to him, and he used to like it, so he bit from it. Then he said: 'I will be the 'Leader' of the people on the Day of Resurrection. Do you know why that is? Allah will gather the people, the first and the last, on one level ground where they will (all) be able to hear a caller, and all of them will be visible, and the sun will be brought near such that the people will suffer distress and trouble that they cannot tolerate nor bear. Then some people will say: \"Don't you see the state you have reached? Why don't you look for a person who can intercede for you with your Lord? \" Some of them will say to others: \" You should go to Adam.\" So they will go to Adam and say, \"You are the father of all mankind, Allah created you with His Own Hands, and breathed into you from His spirit (which He creted for you) and ordered the angels to prostrate for you. Will you not intercede for us with your Lord? Don't you see what has happened to us? Don't you see the state we have reached?\" On that Adam will reply, \"Today my Lord has become angry such that He has never before been angry, and will never be thereafter. He forbade me (to eat from) the tree, but I disobeyed(Him), Myself! Myself! Myself! Go to somebody else; Go to Nuh.\" They will go to Nuh and say: \"O Nuh! You are the first among the Messengers to the people of the earth, and Allah named you a thankful slave. Will you not intercede for us with your Lord? Don't you see what has happened to us? Don't you see the state we have reached?\" Nuh will say to them : \"Today my Lord has become angry as He has never before been angry, and will never be thereafter. I had been given one supplication, and I supplicated against my own people. Myself! Myself! Myself! Go to someone else! Go to Ibrahim.\" They will go to Ibrahim and say: \"O Ibrahim! You are Allah's Prophet and His Khalil among the people of the earth, so intercede for us with your Lord, don't you see what hads happened to us?\" He will say: \"Today my Lord has become angry as He has never before been angry and will never be thereafter. Indeed I uttered three lies.\"- Abu Hayyyan (a narrator) mentioned them in his narration - \" Myself! Myself! Myself! Go to someone else! Go to Musa.\" So they will go to Musa and say: \"O Musa! You are the Messenger of Allah who Allah distinguished above the people with His Message and His Speech, intercede for us with your Lord. Don't you see what has happened to us?\" So he will say \"Today my Lord has become angry as He has never before been angry and will never be thereafter. Indeed I killed a person whom I was ordered not to kill. Myself! Myself! Myself! Go to someone else; Go to 'Eisa.\" They will go to 'Eisa and say: \"O 'Eisa ! You are the Messenger of Allah and His Word which He placed into Mariam, and a Spirit from Him, and you spoke to the people in the cradle. Intercede for us with your Lord. Don't you see what has happened to us?\" Then 'Eisa will say: \"Today my Lord has become angry as He has never before been angry and will never be thereafter.\" He will not mention a sin, but will say: \"Myself! Myself! Myself! Go to someone else! Go to Muhammad.\" He said: 'They will go to Muhammad(s.a.w) and they say: \"O Muhammad! You are the Messenger of Allah and the last of the Prophets, and your past and future sins have been pardoned. Will you not intercede for us with your Lord, don't you see what has happened to us?\" Then I will depart until I come to under the Throne to fall prostrating before my Lord. Then Allah will guide me to such praises and beautiful statements of glorification which He did not guide anyone to before me. Then He will say: \"O Muhammad! Raise your head. Ask,so that you may be granted and intercede so that your intercession may be accepted.\" I will raise my head and say: \"O Lord! My Ummah! O Lord! My Ummah! O Lord! My Ummah!\" He will say: \"O Muhammad! Let those of your Ummah who have no accounts enter the gate on the right among the gates of Paradise, and they shall share in the gates other than that with the people.'\" Then he (s.a.w) said: 'By the One in Whose Hand is my soul! What is between every two gate-posts in Paradise is as what is between Makkah and Hajar, and what is between Makkah and Busra.'\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2435,
			"arabicnumber": 2435,
			"text": "Anas narrated that the Messenger of allah (s.a.w)said:\"My intercession is for the people who committed the major sins in my Ummah.\" Another chain reports a similar narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2436,
			"arabicnumber": 2436,
			"text": "Ja'far bin Muhammad narrated from his father, from Jabir bin 'Abdullah who said:\"The Messenger of Allah (s.a.w) said: 'My intercession is for the people who comitted major sins in my Ummah.'\" Muhammad bin 'Ali said: \"Jabir said to me: 'O Muhammad! Whoever is not among the people of major sins, then there is no need in the intercession for him",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2437,
			"arabicnumber": 2437,
			"text": "Abu Umamah narrated the Messenger of Allah (s.a.w) said:\"My Lord promised me that seventy thousand of my Ummah shall be admitted into Paradise without a reckoning against them nor any punishment. With every thousand, are seventy thousand and three measures from His measures",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2438,
			"arabicnumber": 2438,
			"text": "Abdullah bin Shaqiq narrated:\" I was with a troop in Jerusalem, and a man among them said: 'I heard the Messenger of Allah (s.a.w) saying: \"From the intersection of one man in my Ummah more (people) then Banu Tamim will be admitted into Paradise.' It was said: 'O Messenger of Allah! Someone other than you?' He said: 'Other than me.' So when he stood, I said: 'Who is this?' They said: 'This is Ibn Abi Al-Jadh'a",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2439,
			"arabicnumber": 2439,
			"text": "Al-Hasan Al-Basri said:\"The Messenger of Allah (s.a.w) said: 'On the Day of Judgement, 'Uthman bin 'Affan will intercede for (an amount) the likes of Rabi'ah and Mudar",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2440,
			"arabicnumber": 2440,
			"text": "Abu Sa'eed narrated the Messenger of Allah (ﷺ) said:\"Indeed in my Ummah are those who intercede for large groups of people, and among them (there are) who intercede for a tribe, and among them (there are) who intercede for a group, and among them (there are) who intercede for a man, until they are admitted to Paradise",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2441,
			"arabicnumber": 2441,
			"text": "Abu Al-Malih narrated from 'Awf bin Malik Al-Ashja'i who said:\"The Messenger of Allah (s.a.w) said 'Someone came to me from my Lord to give me choice between the half of my Ummah being admitted into Paradise or intercession. So I chose the intercession, and it is for whoever dies and he did not associate anything with Allah.\"' Another chain reports a similar narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2442,
			"arabicnumber": 2442,
			"text": "Anas bin Malik narrated that the Messenger of Allah (s.a.w) said:\"Indeed, at my Hawd there are drinking vessels as numerous as the stars in the heavens",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2443,
			"arabicnumber": 2443,
			"text": "Samurah narrated the Messenger of Allah (s.a.w)said:\"Indeed there is a Hawd for every Prophet, and indeed they compete to see which of them has the most arriving at it. Indeed I hope that mine will be the one with the most arrival",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2444,
			"arabicnumber": 2444,
			"text": "Al-'Abbas narrated from Abu Sallam Al-Habashi who said:\"'Umar bin 'Abdul-'Aziz summoned me so I got a ride on a mule.\" [He said:] \"When he entered upon him, he said: 'O Commander of the Believers! My riding mule was troublesome for me.' So he said: 'O Abu Sallam!I did not want to trouble you, but a Hadith which you narrated-from Thawban, from the Prophet (s.a.w) about the Hawd-was conveyed to me,and I wanted you to narrate it directly to me.\"'Abu Sallam said: \"Thawban narrated to me from The Messenger of Allah (s.a.w) who said 'My Hawd (is as large as) from 'Adan to 'Amman of Al-Balqa', its water is whiter than milk and sweeter than honey. Its cups are as numerous as the stars, whoever drinks one drink from it, he will never be thirsty after that again. The first people to arrive at it are the poor among the Muhajirin with disheveled heads, dirty clothes, those whom the women of favor would not marry, nor would the doors be open for them.' 'Umar said: 'But I have married a women of favor and the doors are open for me. I married Fatimah bint 'Abdul-Malik. I shall certainly not wash my head until it is disheveled, nor wash my garment which touches my body until it becomes dirty.\" Another chain reports a similar narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2445,
			"arabicnumber": 2445,
			"text": "Abu Dharr narrated:\"I said: 'O Messenger of Allah! What about the vessels of the Hawd?' He said: 'By the one in Whose Hand is my soul! Its vessels number more than the stars of the heavens and the planets on a clear dark night. (They are) among the vessels of Paradise, whoever drinks from them, he will never be thirsty again. Its longest breadth is the same as its length, like that which is between 'Amman to Aylah, its water is whiter than milk and sweeter than honey.'\" Another chain reports a similar narration. It has been reported from Ibn 'Umar that the Prophet SAW said: \"My Hawd (covers a distance) like what is between Kufah to the Black Stone",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "Ibn 'Abbas narrated :\"When the Prophet (s.a.w) was taken for the Night Journey, he passed by a Prophet, and, some Prophets and with them were some people, and a Prophet, and some Prophets and with them was a group of people, and a Prophet, and some Prophets and with them there was no one. Until he passed by a large multitude. (The Prophet (s.a.w)said: ) I said: 'Who is this?' It was said: 'Musa and his people. But raise your head and look.' There was a large multitude that covered the horizon, from one side to the other. It was said: 'These people are your Ummah, and there are seventy thousand besides these from your Ummah that shall enter Paradise without a reckoning.' So he went inside, and they did not question him, and he gave no explanation to them. (Some of them) said: 'We are them.' Others said: 'They are the children who were born upon the Fitrah and Islam.' So the Prophet (s.a.w) came out and said: 'They are those who do not get themselves cauterized, nor seek Ruqyah, nor read omens, and upon their Lord they rely.' So 'Ukashah bin Mihsan stood and said: 'Am I among them O Messenger of Allah?' He said: 'Yes.' Then another one stood up and said: 'Am I among them?' So he said \"Ukashah has preceded you to it.'\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "Abu 'Imaran Al-Jawni narrated :\"From Anas bin Malik who said : 'I do not recognize anything (today) from what we were upon during the time of The Messenger of Allah (s.a.w).' So I said : 'What about the Salat?' He said: 'Have you (people) not done what you know (you have done)?'\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2448,
			"arabicnumber": 2448,
			"text": "Asma bint 'Umais Al-Khath'amiyyah narrated that The Messenger of Allah (s.a.w) said:\"What an evil servant is the one who fancies himself and becomes vain forgetting the Most Great, the Most High. What an evil servant is the one who forces and behaves hostility, forgetting the Compeller, the Most High. What an evil servant is the one who is heedless and diverted, forgetting about the graves and the trials. What an evil servant is the one who is violent and tyrannical, forgetting his beginnings or his end. What an evil servant is the one who seeks the world through the religion. What an evil servant is the one who seeks the religion through his desires. What an evil servant is the one who puts all hope in his own zeal. What an evil servant is the worshipper who is misled by his desire. What an evil servant is the one whose aspirations humiliate him",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2449,
			"arabicnumber": 2449,
			"text": "Atiyyah Al-'Awfi narrated from Abu Sa'eed Al-Khudri,that The Messenger of Allah (s.a.w) said:\"Whichever believer feeds a hungry believer , Allah feeds him from the fruits of Paradise on the Day of Resurrection. Whichever believer gives drink to a thirsty believer, Allah gives him to drink from the 'sealed nectar' on the Day of Resurrection. Whichever believer clothes a naked believer, Allah clothes him from the green garments of Paradise",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2450,
			"arabicnumber": 2450,
			"text": "Abu Hurairah narrated that The Messenger of Allah (s.a.w) said:\"Whoever fears traveling at night - and whoever travels at night reaches his destination - Allah provides him with the most precious of goods, and indeed Allah's goods are but Paradise",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2451,
			"arabicnumber": 2451,
			"text": "Rabi'ah bin Yazid and 'Atiyyah bin Qais narrated from 'Atiyyah As-Sa'di - and he was one of the Companions of the Prophet (ﷺ) - that the Messenger of Allah (ﷺ) said:\"The servant shall not reach the state of being among the Muttaqin until he leaves what there is no harm in out of caution for its harm",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2452,
			"arabicnumber": 2452,
			"text": "Hanzalah Al-Usaiyyidi narrated that the Messenger of Allah (s.a.w) said:\"If you would (always) be as you are with me, then the angels would shade you with their wings.\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2453,
			"arabicnumber": 2453,
			"text": "Abu Hurairah narrated that the Prophet (s.a.w) said:\"Indeed for everything there is a zeal, and for every zeal there is a slackening. So if its practitioner behaves properly,and is moderate, then hope for him (for his success). But if the fingers are pointed to him, then do not count him (among the worthy).\" It has been related from Anas bin Malik that the Prophet SAW said: \"It is sufficient evil for a man that fingers be raised against him, regarding religion or worldly matters, except for one whom Allah has protected",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2454,
			"arabicnumber": 2454,
			"text": "Abdullah bin Mas'ud narrated \"The Messenger of Allah (s.a.w) drew a square line (on the ground) forus, and in the middle of the (square) line he drew another line, and he drew another line going out of the (square) line.Around the one that was in the middle, he drew (various) lines. Then he said:'This is the son of Adam, and this is his life-span encircling him, and this one in the middle in the person, and these lines are his obstacles, if he escapes this one, this one ensnares him, and the line extending outside is his hope",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2455,
			"arabicnumber": 2455,
			"text": "Anas bin Malik narrated that the Messenger of Allah (s.a.w)said:\"The son of Adam grows old. But two things keep him young: Desire for life and desire for wealth",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2456,
			"arabicnumber": 2456,
			"text": "Mutarrif bin 'Abdullah bin Ash-Shikh-khir narrated from his father from the Prophet(s.a.w) who said:\"The case of the son of Adam is such that he is surrounded by ninety-nine calamities, if the calamities miss him, he falls into decrepitude",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2457,
			"arabicnumber": 2457,
			"text": "At-Tufail bin Ubayy bin Ka'b narrated from his father who said:\"When a third of the night had passed, the Messenger of Allah(s.a.w) stood and said: 'O you people! Remember Allah! Remember Allah! The Rajifah is coming, followed by the Radifah, death and what it brings is coming, death and what it brings is coming!'\" Ubayy said: \"I said: 'O Messenger of Allah! Indeed I say very much Salat for you. How much of my Salat should I make for you?' He said: 'As you wish.'\" [He said:] \"I said: 'A fourth?' He said: 'As you wish. But if you add more it would be better for you.' I said: 'Then half?' He said: 'As you wish. And if you add more it would be better [for you].'\" [He said:] \"I said: 'Then two-thirds? 'He said: 'As you wish, but if you add more it would be better for you.' I said: 'Should I make all of my Salat for you?' He said: 'Then your problems would be solved and your sins would be forgiven",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2458,
			"arabicnumber": 2458,
			"text": "Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said:\" Have Haya' for Allah as is His due.\" [He said:] We said: \"O Prophet of Allah! We have Haya', and all praise is due to Allah.\" He said: \"Not that, but having the Haya' for Allah which He is due is to protect the head and what it contains and to protect the insides and what it includes, and to remember death and the trial, and whoever intends the Hereafter, he leaves the adornments of the world. So whoever does that, then he has indeed fulfilled Haya', meaning the Haya' which Allah is due",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2459,
			"arabicnumber": 2459,
			"text": "Shaddad bin Aws narrated that the Prophet (s.a.w) said:\"The clever person ids the one who subjugates his soul, and works for what is after death. And the incapable is the one who follows his desires and merely hopes in Allah.\" [He said:] The meaning of his saying: \"Who subjugates his soul\", is to say the one who reckons with his soul in the world, before he is reckoned with, on the Day of Judgement. It has been related that 'Umar bin Al-Khattäb said: \"Reckon with yourselves before you are reckoned with, and prepare for the Greatest Inquisition. The reckoning of the Day of Judgement is only light for the one who reckoned with himself in the world.\" And, it has been related that Maimun bin Mihran said: \"The slave (of Allah) will not be a Taqi until he has reckoned himself, just as he would account for where his business partner got his food and clothing",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "Abu Sa'eed narrated:\" The Messenger of Allah (s.a.w) entered his Musalla and saw the people who looked as if they were smiling. So he said: 'Indeed, if you were to increase in remembrance of the severer of pleasures, then you would find yourselves too busy for what I see. So increase in remembrance of death, the severer of pleasures. For indeed there is no day that comes upon the grave except that it speaks, saying: \"I am thee house of the estranged, I am the house of the solitude, I am the house of dust, and I am the house of the worm-eaten.\" When the believing worshipper is buried, the grave says to him: \"Welcome, make yourself comfortable. Indeed, to me, you are the most beloved of those who walked upon me. Since you have been entrusted to me and delivered to me today, you shall see what I have arranged for you.\" It will then widen for him so that his sight extends, and the door to Paradise is opened for him. And when the wicked worshipper or the disbeliever is buried , the grave says to him: \"You are not welcome, do not get comfortable. Indeed, to me, you are the most hated of those who walked upon me. Since you have been entrusted to me and delivered to me today, you shall see what I have arranged for you.'\" He said: 'It will begin closing in on him(squeezing him) until his ribs are crushing each other.'\" He said: \" The Messenger of Allah (s.a.w) clasped some of his fingers between others and said: 'Seventy giant serpents will constrict him, if even one of them were to hiss on the earth, nothing upon it would grow as long as it remained. They will chew on him and bite him until he is brought to the Reckoning.'\" He said: \" The Messenger of Allah (s.a.w) said: 'The grave is but a garden from the gardens of Paradise, or a pit from the pits of the Fire",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2461,
			"arabicnumber": 2461,
			"text": "Ibn 'Abbas narrated:\"'Umar bin Al-Khattab informed me, saying: 'I entered upon the Messenger of Allah (s.a.w) and saw him reclining upon a mat woven from fibers, and I could see the impressions it left upon his side",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2462,
			"arabicnumber": 2462,
			"text": "Al-Mustawrad bin Makhramah narrated that 'Amir bin 'Awf informed him- and he was an ally of Banu 'Amr bin Lu'ay who had participated with The Messenger of Allah (s.a.w) at(the battle of ) Badr, he said:\"The Messenger of Allah (s.a.w) had dispatched Abu 'Ubaidah bin Al-Jarrah, so he arrived with the wealth from Al-Bahrain. When the Ansar had heard of the arrival of Abu 'Ubaidah they were attending Salat Al-Fajr. So the the Messenger of Allah (s.a.w) performed the Salat and when he finished, they assembled before him. The Messenger of Allah (s.a.w) smiled when he saw them, then he said: 'I think that you heard that Abu 'Ubaidah has arrived with something?' They said: 'Yes O Messenger of Allah! 'He said: 'Then receive good news, and hope for what will please you. By Allah! It is not poverty that I fear for you, but what I fear for you is that the world will be presented for you just as it was presented for those before you,then you will compete for it, just as they competed for it, and it will destroy you, just as it destroyed them",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2463,
			"arabicnumber": 2463,
			"text": "Urwah bin Az-Zubair and Ibn Musayyab narrated that Hakim bin Hizam said:\"I (once) asked the Messenger of Allah (s.a.w) (for something) and he gave it to me. Then I asked him (again) and he gave it to me. Then I asked him (again) and he gave it to me. Then I asked him (again), so he gave it to me. Then he said: 'O Hakim! Indeed this wealth is green and sweet, so whoever takes it without asking for it, he will be blessed in it. And whoever takes it, insisting upon it, he will not be blessed in it. He is like the one who eats but does not get satisfied and contended. And the upper hand (giving) is better than the lower hand (receiving).\" So Hakim said: \"I said: 'O Messenger of Allah! By the One who sent you with the Truth! I shall not ask anyone for anything after you until I depart the world.'\"So Abu Bakr used to call Hakim to give him something, but he refused to accept it. Then 'Umar called him to give to him, but he refused to accept it. So 'Umar said: \"O you Muslims! I would like you to bear witness that I presented Hakim with his due of these spoils of war but he refused to accept it.\" So Hakim never asked anyone of the people for anything after the Messenger of Allah, until he died",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2464,
			"arabicnumber": 2464,
			"text": "Abdur-Rahman bin 'Awf said:\"We were tested along with the Messenger of Allah(s.a.w) by adversity, so we were patient, then we were tested after him with prosperity, but we were not patient",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2465,
			"arabicnumber": 2465,
			"text": "Anas bin Malik narrated that the Messenger of Allah (ﷺ) said:\"Whoever makes the Hereafter his goal, Allah makes his heart rich, and organizes his affairs, and the world comes to him whether it wants to or not. And whoever makes the world his goal, Allah puts his poverty right before his eyes, and disorganizes his affairs, and the world does not come to him, except what has been decreed for him",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2466,
			"arabicnumber": 2466,
			"text": "Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:\"Indeed Allah, Most High said: 'O son of Adam! Devote yourself to My worship, I will fill your chest with riches and alleviate your poverty. And if you do not do so, then I will fill your hands with problems and not alleviate your poverty",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2467,
			"arabicnumber": 2467,
			"text": "Aishah said :\" The Messenger of Allah(s.a.w) died and we had a Shatr of barley. We ate from it as Allah willed, then I said to the slave girl: 'Measure it' so she measured it, and it was not long before it was gone.\" She said: \"If we had left it alone then we could have eaten from it more than that.\" [Her saying]: \"Shatr\" means a small quantity of barley",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "Aishah narrated:\"We had a cloth which had some pictures on it as a curtain on my door. The Messenger of Allah(s.a.w) saw it and said: 'Remove it, for it reminds me of the world.'\" She said: \"We had a piece of velvet that had patches of silk on it which we used to wear",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2469,
			"arabicnumber": 2469,
			"text": "Aishah narrated:\"The Messenger of Allah (s.a.w) had a leather cushion stuffed with palm fibres which he would lean on",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2470,
			"arabicnumber": 2470,
			"text": "Abu Maisarah narrated from 'Aishah that they had slaughtered a sheep, so the Prophet (s.a.w) said:\"What remains of it?\" She said: \"Nothing remains of it except its shoulder.\" He said: \"All of it remains except its shoulder",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2471,
			"arabicnumber": 2471,
			"text": "Aishah narrated:\"We, the family of Muhammad, would go for a month without kindling a fire, having only water and dates",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2472,
			"arabicnumber": 2472,
			"text": "Anas narrated that the Messenger of Allah (s.a.w) said:\"Indeed I have feared for the sake of Allah, such that no one has feared, and I have been harmed for the sake of Allah, such that no one has been harmed. Thirty days and nights have passed over me, and there was no food with Bilal and I forced something with a liver to eat, except what Bilal could conceal under his armpit.\" This Hadith refers to when the Prophet SAW went out fleeing from Makkah and Bilal was with him. The only food Bilãl had was what he could carry under his arm",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2473,
			"arabicnumber": 2473,
			"text": "Muhammad bin Ka'b Al-Qurazi said:\"Someone narrated to me that he heard 'ali bin abi Talib saying: 'I went out on a cold day from the house of the Messenger of Allah (s.a.w). I had taken a tanned skin, si I tore it in the middle, and out it over my neck, and wrapped my mid-section, fastening it with a palm leave. I was severely hungry, and if there was food in the house of the Messenger of Allah (s.a.w) I would have eaten some of it. I went in search of something. I passed by a Jew on his property drawing water (from a well) with a pulley. I watched him from a gap in the fence. He said: \"what is wrong with you O Arab1 Would you like to get a date for every bucket?\" I said: \"Yes. Open the door so I can come in.\" He opened the door, I entered and he gave me his bucket. Then for every bucket I pulled out, he would give me a date, until when it was enough for me. I put his bucket down and said: \"I think I had enough to eat\" then I scooped some water to drink it. Then I came to the Masjid and found the Messenger of Allah (s.a.w) in it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2474,
			"arabicnumber": 2474,
			"text": "Abu 'Uthman An-Nahdi narrated from Abu Hurairah that they (the Companions) were suffering from hunger so the Messenger of Allah (s.a.w) gave them each a date",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2475,
			"arabicnumber": 2475,
			"text": "Jabir bin 'Abdullah narrated:\"The Messenger of Allah (s.a.w) dispatched us, and there were three-hundred of us. We were carrying our provisions on our shoulders. Then our provisions ran out such that each man among us could eat only a date per day.\" It was said to him: \"O Abu 'Abdullah! How could one date be enough for a man?'\" He said: \"We realized its value when we did not even have that. Then we came to the sea where we saw a whale that the sea had tossed (on the shore). So we ate as much as we liked from it for eighteen days.\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2476,
			"arabicnumber": 2476,
			"text": "Yazid bin Ziyad narrated from Muhammad bin Ka'b Al-Qurazi who heard from Abi Talib narrated that he said:'I was sitting in a gathering with the Messenger of Allah (s.a.w) when Mus'ab bin 'Umair appeared before us, wearing nothing but a Burdah patched with some animal furs. When the Messenger of Allah (s.a.w) saw him he began crying because of the good life he previously had compared to the state that he was in that day. Then the Messenger of Allah (s.a.w) said: 'How will you people be, when the late morning comes upon one of you while wearing a Hullah, and at the end of the day he is in, (another) Hullah, when a platter is placed in front of him while another is removed, and you cover your houses just as the Ka'bah is covered?' They said: 'O Messenger of Allah! On that day we will be better than we are today, devoting ourselves to worship, satisfied with our good fortune.' So the Messenger of Allah (s.a.w) said: 'No, today you are better than you will be on that day",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "Abu Hurairah narrated:\"The people of As-Suffah were the guests of the people of Islam,they had nothing of people nor wealth to rely upon. And By Allah, the One Whom there is none worthy of worship besides Him – I would lay on the ground on my liver (side) due to hunger, And I would fasten a stone to my stomach out of hunger. One day I sat by the way that they (the Companions) use to come out through. Abu Bakr passed and so I asked him about an Ayah from Allah's Book, not asking him except that he might tell me to follow him (for something to eat). But he passed on without doing so. Then `Umar passed, so I asked him about an Ayah from Allah's Book, not asking him except that he might tell me to follow him. But he passed on without doing so. Then Abul-Qasim (s.a.w) passed, and he smiled when he saw me, and said: 'Abu Hurairah?' I said: 'I am here O Messenger of Allah!' He said: 'Come along.' He continued and I followed him, he entered his house, so I sought permission to enter, and he permitted me. He found a bowl of milk and said: 'Where did this milk come from?' It was said: 'It was a gift to us from so – and – so.' So the Messenger of Allah (s.a.w) said: 'O Abu Hurairah' I said: 'I am here O Messenger of Allah!' He said: 'Go to the people of As-Suffah to invite them.' - Now, they were the guests of the people of Islam, they had nothing of people nor wealth to rely upon. Whenever some charity was brought to him, he would send it to them without using any of it. And when a gift was given to him (s.a.w), he would send for them to participate and share with him in it. I became upset about that, and I said (to myself): 'What good will this bowl be among the people of As-Suffah and I am the one bringing it to them?' Then he ordered me to circulate it among them (So I wondered) what of it would reach me from it, and I hoped that I would get from it what would satisfy me. But I would certainly not neglect to obey Allah and obey His Messenger, so I went to them and invited them. When they entered upon him they sat down. He said: 'Abu Hurairah, take the bowl and give it to them.' So I gave it to a man who drank his fill, then he gave it to another one, until it ended up with the Messenger of Allah (s.a.w), and all of the people had drank their fill. The Messenger of Allah (s.a.w) took the bowl, put it on his hand,then raised his head. He smiled and said: 'Abu Hurairah, drink.' So I drank, then he said: 'Drink.' I kept drinking and he kept on saying, 'Drink.' Then I said: 'By the One Who sent you with the truth! I have no more space for it.' So he took the bowl and praised Allah, mentioned His Name and drank.'” (Sahih)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2478,
			"arabicnumber": 2478,
			"text": "Yahya Al-Bakka' narrated from Ibn 'Umar who said:\"A man belched in the presence of the Prophet(s.a.w), so he said: 'Restain your belching from us. For indeed those who are filled most in the world will be the hungriest on the Day of Judgement",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2479,
			"arabicnumber": 2479,
			"text": "Abu Burdah bin Abi Musa narrated that his father said:\"O my son! If you saw us when we were with the Prophet(s.a.w) and the sky poured upon us, you would think that our smell was the smell of sheep.\" The meaning of this Hadith is that their garments were of wool, so when the rain fell upon them, the smell coming from their clothes was that of sheep",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2480,
			"arabicnumber": 2480,
			"text": "Sufyan Ath-Thawri narrated:From Abu Hamzah, (who said): \"From Ibrahim An-Nakha'i who said: 'All buildings and concerns for them will be against you.' I said: 'What do you think about what one can not do without?' He said: 'There is no reward for that nor harm",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2481,
			"arabicnumber": 2481,
			"text": "Sahl bin Mu'adh bin Anas Al-Juhani narrated from his father, that the Messenger of Allah (s.a.w)said:\"Whoever leaves(valuable) dress out of humility to Allah while he is able to (afford it), Allah will call him before the heads of creation on the Day of Judgement so that he can chose whichever Hulal of faith he wishes to wear.\" The meaning of his saying: \"Hulal of faith\" is the garments of Paradise which are given to the people of faith",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2482,
			"arabicnumber": 2482,
			"text": "Shahib bin Bashir narrated from Anas bin Malik that the Messenger of Allah (s.a.w) said:\"All expenditures are in Allah's Cause, except for buildings, for there is no good in it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2483,
			"arabicnumber": 2483,
			"text": "Harithah bin Mudarrib said:\"We went to visit Khabbab who had himself cauterized in seven places on his body. He said: 'I have been ill for so long, and if it was not that I heard the Messenger of Allah (s.a.w) saying: \"None of you should wish for death\" then I would have wished for it, and he said: \"A man is rewarded for [all of] his spending except for the dust\" - or he said - \"in the building",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2484,
			"arabicnumber": 2484,
			"text": "Husain said:\"A beggar came to Ibn 'Abbas to beg from him. Ibn 'Abbas said to the beggar: 'Do you testify to La Ilaha Illallah?' He said: 'Yes.' He said: 'Do you testify that Muhammad is the Messenfger of Allah?' He said: 'Yes.' He said: 'You fast(the month of) Ramadan?' He said: 'Yes?' He said: 'You asked, and the one who asked has a right, so you have a right upon us that we give you.' So he gave him a garment then said: 'I heard the Messenger of Allah (s.a.w) saying: \"No Muslim clothes a Muslim with a garment except that he is under the protection of Allah as long as a shred from it remains upon him",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2485,
			"arabicnumber": 2485,
			"text": "Abdullah bin Salam said:\"When the Messenger of Allah (s.a.w) arrived- meaning in Al-Madinah – the people came out to meet him. It was said that the Messenger of Allah (s.a.w) had arrived, so I went among the people to get a look at him. When I gazed upon the face of the Messenger of Allah (s.a.w), I knew that this face was not the face of a liar. The first thing that he spoke about was that he said: 'O you people! Spread the Salam, feed(others), and perform Salat while the people are sleeping; you will enter Paradise with(the greeting of) Salam.'” (Sahih)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2486,
			"arabicnumber": 2486,
			"text": "Abu Hurairah narrated that the Prophet(s.a.w) said:\"The one who eats and is grateful is like the status of the patient fasting person",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2487,
			"arabicnumber": 2487,
			"text": "Anas said:\"When the Messenger of Allah (s.a.w) arrived in Al-Madinah the Muhajirun came to him and said: 'O Messenger of Allah! We have not seen a people more willing to sacrifice when having a lot, nor more patient when having a little than the people whom we are staying among. Our provisions are so sufficient, and we share with them in their produce such that we fear that all our reward is gone. So the Prophet (s.a.w) said: \"No. As long as you supplicate to Allah for them and praise (show gratitude to) them(for it)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2488,
			"arabicnumber": 2488,
			"text": "Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said:\"Shall I not inform you of whom the Fire is unlawful and he is unlawful for the Fire? Every person who is near (to people), amicable, and easy (to deal with)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2489,
			"arabicnumber": 2489,
			"text": "Aswad bin Yazid narrated:\"I said to Aishah: 'What would the Prophet (s.a.w) do when he entered his house?' She said: 'He would busy himself with serving his family, then when (the time for) Salat was due he would stand (to go) for it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2490,
			"arabicnumber": 2490,
			"text": "Anas bin Malik narrated:\"When the Prophet(s.a.w) would receive a man to shake hands with him,he would not remove his hand until he [the man]removed his, and he would not turn his face away from his face until the man turned and he would not be seen advancing his knees before one sitting with him",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2491,
			"arabicnumber": 2491,
			"text": "Abdullah bin 'Amr narrated that the Messenger of Allah (s.a.w) said:\"A man among those before you went out arrogantly in a Hullah of his. So Allah ordered the earth to take him. He remains sinking[into it]\" - or he said - \"He will remain sinking into it until the Day of Judgement",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2492,
			"arabicnumber": 2492,
			"text": "Amr bin Shu'aib narrated from his father, from his grandfather from the Prophet (s.a.w) who said:\"The proud will be gathered on the Day of Judgement resembling tiny particles in the image of men. They will be covered with humiliation everywhere, they will be dragged into a prison in Hell called Bulas, submerged in the Fire of Fires, drinking the drippings of the people of the Fire, filled with derangement",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2493,
			"arabicnumber": 2493,
			"text": "Sahl bin Mu'ad bin Anas narrated from his father, that the Prophet (s.a.w) said:\"Whoever suppresses his rage, while he is able to exact it, Allah will call him before the heads of creation [on the Day of Judgement] so that he can chose whichever of the Hur he wishes",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "Abu Bakr bin Al-Munkadir narrated from Jabir that the Messenger of Allah (s.a.w) said:\"There are three (characteristics) for which whomever has them,Allah will expose His side,and admit him to Paradise:Being courteous to the guest,kind to parents,and doing good for slaves",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2495,
			"arabicnumber": 2495,
			"text": "Abu Dharr narrated that the Messenger of Allah (s.a.w) said:\"Allah,Most High said: 'O My Slaves! All of you are astray except whom I guide, so ask Me for guidance and I shall guide you. All of you are poor except whom I enrich, so ask Me and I shall provide you. All of you are sinners except whom I have pardoned, so whoever among you knows that I am the One able to forgive, and seeks My forgiveness, I shall forgive him, without concern for Me (and it will not affect Me). If the first of you and the last of you, the living among you and the dead among you, the fresh among you and the dry among you were to gather together to help the heart with the most Taqwa among My slaves, that would not add a mosquito's wing to My sovereignty. If the first of you and the last of you, the living among you and the dead among you, the fresh among you and the dry among you were to gather together to help the worst heart of My slaves, that would not diminish a mosquito's wing to My sovereignty. I shall forgive him, without concern for Me (and it will not affect Me). If the first of you and the last of you, the living among you and the dead among you, the fresh among you and the dry among you were to gather together upon one plateau, and each person among them were to ask for his utmost desire, and I were to give each what he asked for, that would not diminish from My sovereignty, except as if one of you were to pass by an ocean and dip a needle into it and then remove it. That is because I am the Most Liberal without need, the Most Generous, doing as I will. I give by My speech and I punish by My speech, whenever I will something I only say: \"Be\" and it shall be.'\" Another chain reports a similar narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2496,
			"arabicnumber": 2496,
			"text": "Ibn 'Umar said:\"I heard the Prophet (s.a.w) narrating a hadith, not just once or twice, even seven times, but I heard him saying it more than that. I heard him saying: 'There was a man called Al-Kifl among the children of Isra'il who did not restrain himself from committing sins. A woman came to him and he gave her sixty Dinar so he could sleep with her. When he sat up from her, as a man sits up from a woman, she began to tremble and cry, so he said: \"Why are you crying, did I do something to harm you?\" She said: \"No. But it is because of what I did, I only did so out of need.\" He said: \"You did this without having done (it before), so leave me, and it (the money) is for you.\" And then he said: \"By Allah! I will never disobey Allah after that.\" He died during the night and morning came with: \" Indeed Allah has forgiven Al-Kifl\" written upon his door.\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2497,
			"arabicnumber": 2497,
			"text": "Al-Harith bin Suwaid said:\" 'Abdullah [bin Mas'ud] narrated two Ahadith to us, one of them from himself and the other from the Prophet (s.a.w). 'Abdullah said: 'The believer sees his sins as if he was at the base of a mountain, fearing that it was about to fall upon him. The wicked person sees his sins as if (they are) flies are hitting his nose\" he said: \"Like this\" - motioning with his hand - \"to get them to fly away",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2498,
			"arabicnumber": 2498,
			"text": "And the Messenger of Allah (s.a.w) said:\"Allah is more pleased with the repentance of one of you that a man in a desolate, barren, destructive wasteland, who has his mount carrying his provisions, his food, and his drink and what he needs with him. Then it wanders away. So he goes to find it until he is on the brink of death. He says: 'I will return to the place where I lost it, to die.' So he returns to his place and his eyes become heavy (falling asleep). Then he awakens to find his mount at his head carrying his food, drink and what he needs.\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2499,
			"arabicnumber": 2499,
			"text": "Anas narrated that the Prophet (ﷺ) said:\"Every son of Adam sins, and the best of the sinners are the repentant",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2500,
			"arabicnumber": 2500,
			"text": "Abu Hurairah narrated that the Prophet(s.a.w) said:\"Whoever believes in Allah and the Last Day, then let him honor his guest. And whoever believes in Allah and the Last Day, then let him say what is good or remain silent.\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2501,
			"arabicnumber": 2501,
			"text": "Abdullah bin 'Amr narrated that the Messenger of Allah (s.a.w) said:\"Whoever is silent, he is saved",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2502,
			"arabicnumber": 2502,
			"text": "Abu Hudhaifah narrated - and he was one of the companions of 'Abdullãh bin Mas'üd - from 'Aishah who said:\"I told the Prophet (ﷺ) about a man, so he said: 'I do not like to talk about a man, even if I were to get this or that (for doing so).\" She said: \"I said: 'O Messenger of Allah! Safiyyah is a woman who is ...\" and she used her hand as if to indicate that she is short - \"So he said: 'You have said a statement which, if it were mixed in with the water of the sea, it would pollute it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": 2503,
			"text": "Aishah narrated that the Messenger of Allah (s.a.w) said:\"I do not like to talk about anyone, even if I were to get this or that",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": 2504,
			"text": "Abu Musa said:\"The Messenger of Allah (s.a.w) was asked: 'Which of the Muslims is the most virtuous?' He said: 'The one whom the Muslims are safe from his tongue and his hand",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2505,
			"arabicnumber": 2505,
			"text": "Khalid bin Ma'dan narrated from Mu'adh bin Jabal that the Messenger of Allah (s.a.w) said:\"Whoever shames his brother for a sin, he shall not die until he (himself) commits it.\" (One of the narrators) Ahmad said: They said: 'From a sin he has repented from",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": 2506,
			"text": "Wathilah bin Al-Asqa' narrated that the Messenger of Allah (s.a.w) said:\"Do not rejoice over the mishaps of your brother so that Allah has mercy on him and subjects you to trials",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "Yahya bin Wath-thab narrated:\"From a Shaikh among the Companions of the Prophet (s.a.w) , I think it is from the Prophet(s.a.w), who said: 'The Muslim who mixes with the people and he is patient with their harm is better than the Muslim who does not mix with the people and is not patient with their harm",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2508,
			"arabicnumber": 2508,
			"text": "Abu Hurairah narrated that the Prophet (s.a.w) said:\"Beware of evil with each other, for indeed it is the Haliqah.\" [The meaning of his saying]: \"Süw'a Dhãt Al-Bain (evil with each other) is enmity and hatred, and his saying: \"The Haliqah\" [it is said] that it severs the religion",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2509,
			"arabicnumber": 2509,
			"text": "Abu Ad-Darda' narrated that the Messenger of Allah (s.a.w) said:\"Shall I not inform you of what is more virtuous than the rank of fasting, Salat, and charity?\" They said: \"But of course!\" He said: \"Making peace between each other. For indeed spoiling relations with each other is the Haliqah.\" It has been related that the Prophet SAW said: \"It is the Haliqah, I do not speak of what cuts hair, but it severs the religion",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2510,
			"arabicnumber": 2510,
			"text": "Az-Zubair bin Al-'Awwam narrated that the Prophet (s.a.w) said:\"The disease of the nations before you is creeping towards you: Envy and hatred, it is the Haliqah. I do not speak of what cuts the hair, but what severs the religion. By the One in Whose Hand is my soul! You will not enter Paradise until you believe, and you will not believe until you love each other. Shall I tell you about what will strengthen that for you? Spread the Salam among each other",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2511,
			"arabicnumber": 2511,
			"text": "Abu Bakrah narrated that the Messenger of Allah (s.a.w) said:\"There is no sin more worthy of Allah hastening the punishment upon its practitioner in the world – along with what is in store for him in the Hereafter – than tyranny and severing the ties of kinship.” (Sahih)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2512,
			"arabicnumber": 2512,
			"text": "Amr bin Shu'aib narrated from his grandfather 'Abdullah bin 'Amr, that the Messenger of Allah (s.a.w) said:\"There are two traits, whoever has them in him, Allah writes him down as grateful and patient. And whoever does not have them, Allah does not write him down as grateful, nor patient. Whoever looks to one above him for his religion, and follows him in it, and whoever looks to one who is below him in worldly matters, and praises Allah for the blessings He has favored the one who is above him with, then Allah writes him down as grateful and patient. And whoever looks to one who is below him for his religion, and looks to one who is above him for worldly matters, and grieves over what missed him of it, Allah does not write him down as grateful nor as patient.\" (Another chain reaching to) 'Amr bin Shu'aib, from his father, from his grandfather from the Prophet (s.a.w) with similar narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2513,
			"arabicnumber": 2513,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"Look to one who is lower than you, and do not look to one who is above you. For indeed that is more worthy(so that you will) not belittle Allah's favors upon you",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2514,
			"arabicnumber": 2514,
			"text": "Abu 'Uthman narrated from Hanzalah Al-Usaidi – and he was one of the scribes of the Messenger of Allah (s.a.w)- that he passed by Abu Bakr while he was crying, so he(Abu Bakr) said to him:“What is wrong with you, O Hanzalah?” He replied: “Hanzalah has become a hypocrite O Abu Bakr! When we are with the Messenger of Allah (s.a.w) we remember the Fire and Paradise as if we are looking at them with the naked eye. But when we return we busy ourselves with our wives and livelihood and we forget so much.” He(Abu Bakr) said: “By Allah! The same thing happens to me. Let us go to the Messenger of Allah (s.a.w).” (Hanzalah said:) “So he went.\" When the Messenger of Allah (s.a.w) saw him, he said: “What is wrong with you O Hanzalah?” He said: “Hanzalah has become a hypocrite O Messenger of Allah! When we are with you we remember the Fire and Paradise as if we can see them with the naked eye. But when we return we are busy with our wives and livelihood, and we forget so much.” He said: “So the Messenger of Allah (s.a.w) said: 'If you were to abide in the state that you are in when you are with me, then the Angels would shake hands with you in your gatherings, and upon your bedding, and in your paths. But O Hanzalah! There is a time for this and a time for that.'” (Sahih)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2515,
			"arabicnumber": 2515,
			"text": "Anas narrated that the Prophet(s.a.w) said:\"None of you believes until he loves for his brother what he loves for himself",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2516,
			"arabicnumber": 2516,
			"text": "Ibn 'Abbas narrated:\"I was behind the Prophet(s.a.w) one day when he said: 'O boy! I will teach you a statement: Be mindful of Allah and He will protect you. Be mindful of Allah and you will find Him before you. When you ask, ask Allah, and when you seek aid, seek Allah's aid. Know that if the entire creation were to gather together to do something to benefit you- you would never get any benefit except that Allah had written for you. And if they were to gather to do something to harm you- you would never be harmed except that Allah had written for you. The pens are lifted and the pages are dried",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2517,
			"arabicnumber": 2517,
			"text": "Anas bin Malik narrated that a man said:\"O Messenger of Allah! Shall I tie it and rely(upon Allah), or leave it loose and rely(upon Allah)?\" He said: \"Tie it and rely(upon Allah).\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2518,
			"arabicnumber": 2518,
			"text": "Al-Hasan bin 'Ali said:\"I remember that the Messenger of Allah (s.a.w) said: 'Leave what makes you in doubt for what does not make you in doubt. The truth brings tranquility while falsehood sows doubt.'\" Another chain reports a similar narration",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2519,
			"arabicnumber": 2519,
			"text": "Muhammad bin Al-Munkadir narrated from Jabir, that a man was mentioned in the presence of the Prophet (s.a.w) for his worship and striving in it, and another man was mentioned for his cautious piety. So the Prophet (s.a.w) said:\"Nothing is equal to cautious piety",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2520,
			"arabicnumber": 2520,
			"text": "Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (s.a.w) said:\"Whoever eats the Tayyib and acts in accordance with the Sunnah, and the people are safe from his harm, he will enter Paradise.\" So a man said: \"O Messenger of Allah! This is the case with many people today.\" So he said: \"It shall be so in the generation after me",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2522,
			"arabicnumber": 2522,
			"text": "Abu Sa'eed Al-Khudri narrated that the Prophet (s.a.w) said:\"The first batch to enter Paradise will appear like the moon of a night that is full. The second will appear like the color of the most beautiful star in the sky. Each man among them shall have two wives, each wife wearing seventy bracelets, with the marrow of their shins being visible from behind them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 108
			}
		}
	]
}