{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"39": "The Book on the Description of Hellfire"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said:\"Hell will be brought forth on that Day (of Resurrection) having seventy thousand bridles, and with every handle will be seventy thousand angels dragging it'\". Other chains report similar narrations",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"Some of the Fire (in the shape of a long neck) will come out of the Fire on the Day of judgment. It will have two eyes which can see, two ears which can hear, and a tongue which can speak. It will say: 'I have been left in charge of three: Every obstinate oppressor, everyone who called upon a deity besides Allah, and the image makers.\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "Al-Hasan said:\"While he was on the pulpit – the pulpit of Al-Basrah – `Utbah bin Ghazwain narrated that the Messenger of Allah (s.a.w) said: “Indeed a giant rock can be thrown from the brink of Hell and it will continue to fall into it for seventy years without reaching the bottom of it.”.He said: “`Umar used to say:'Increase in your remembrance of the Fire, for its heat is extreme, its bottom is distant, and its whips are of Iron.'” (Sahih)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"text": "Abu Sa'eed narrated that the Prophet SAW said:\"As-Saud is a mountain in the Fire, a disbeliever will be raised upon it for seventy autumns and then similarly he will fall down it, forever.\" (Daif)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "Abu Hurairah narrated that the Prophet (s.a.w) said:\"Indeed a disbeliever's skin will be forty-two forearm lengths thick, his molar teeth will be like Uhud (mountain), and his sitting place in Hell will be like what is between Makkah and Al-Madinah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"The molar teeth of the disbeliever on the Day of Judgment will be like Uhud (mountain), his thigh will be like Al-Baida, and his seat in the Fire will be like the distance of three the likes of Ar-Rabadhah.\" His SAW statement: \"The likes of Ar-Rabadhah\" means: like what is between Al-Madinah and ArRabadhah. And Al-Baidã' is a mountain like Uhud",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "Abu Hurairah narrated a Marfu' narration:\"The molar teeth of the disbeliever will be like Uhud (mountain)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said:'Indeed the disbeliever's tongue will be stretched a Farsakh or two Farsakh, such that the people will walk upon it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "Abu Sa'eed narrated regarding His (Allah's) statement:Kal Muhl, the Prophet (s.a.w)said: 'Like boiling oil, such that when it is brought close to his face, the skin of his face will fall off into it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "Abu Hurairah narrated that the Prophet (s.a.w) said:Indeed Hamim will be poured over their heads. The Hamim will penetrate until it finds its way to his insides. Then whatever is inside him will fall out until it pours over his feet while it melts away. Then he will be reformed to how he was",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "Abu Umamah narrated regarding His (Allah's) statement:\"He will be given water of Sadid to drink, he will swallow it...\" that the Prophet (s.a.w) said: \" It will be brought toward his mouth and he will dislike it, so whenever it is brought closer to him it will melt his face and the skin of his head will fall into it. Then whenever he drinks from it, his bowels will be severed until it comes out from his anus. Allah, the Blessed and Exalted says: \"And they will be given water of Hamim to drink such that it cuts up their bowels...\" and He says: \"And if they call for drink they will be given water of Muhl which melts the faces, the worst of drinks",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"text": "Abu Sa'eed Al-Khudri narrated that about:Kal Muhl, the Prophet (s.a.w) said: \"Like boiling oil, such that whenever it is brought near him the skin of his face falls into it.\" And also with this chain, from the is Prophet SAW, that he said: \"If a bucket of Ghassaq were poured out in the world, the people of the world would rot. (Da'if) And the meaning of his statement: \"The Kithaf of each wall\" is its thickness",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) recited this Ayah:Have the Taqwa of Allah as His due, and do not die except as Muslims. And the Messenger of Allah (s.a.w) said: \"If only a drop of Az-Zaqqum were to drip into the abode of the world, it would spoil the peoples' livelihood, so how about the person for whom it is his food?",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "Abu Ad-Darda' narrated that the Messenger of Allah (s.a.w) said:\"The inhabitants of the Fire will suffer from a hunger equal to the punishment they experience, so they will seek relief, and be given to eat of Dari; which will neither nourish nor avail against hunger. So they will (again) seek food to relieve (their hunger), and they will be given to eat of a food that causes one to choke. Then they will remember that they used remedy for choking in the world by drinking something. So they will seek relief from drink. Then they will be given Hamim with meat hooks, so when it comes toward their faces it melts their faces, and when it enters their insides it cuts up what is inside of them. So (some of them) say: 'Call the keepers of Hell' so they say: Did there not come to you your Messengers with clear signs? They say: 'Yes!' They say: 'Then call as you like.' And the invocation of the disbelievers is nothing but in vain.\" He said: \"They will say: 'Call Malik.' So they say: O Malik! Let your Lord make an end of us!'\" He said: \"So he answers them: Verily you shall abide forever. Al-A'mash said: \"I was informed that there is a thousand years between their calling him, and Malik's answering them.\" He said: \"They say: 'Call your Lord, for there is none better than your Lord.' So they will say: Our Lord! Our wretchedness over came us, and we were (an) erring people. Our Lord! Bring us out of this. If we ever return (to evil), indeed we shall be wrong doers.\"He said: \"So the reply to them is: You remain in it in ignominy! And do not speak to Me.\" He said: \"So with that, they loose hope of any good, and with that they are taken to moaning, despair and severe ruin",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "Abu Sa'eed Al-Khudri narrated that the Prophet (s.a.w) said:\"And therein they will grimace in displace lips. -He will be grilled by the Fire until his upper lip is folded up reaching the middle of his head, And his bottom lip pains down, until it hits his navel",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "Abdullah bin 'Amr bin Al-'As narrated that the Messenger of Allah said:\"If a pellet like this one, and he pointed to one like Al-jumjumah were to be dropped from the heavens to the earth – and it is the distance of traveling five hundred years it would reach the earth before the night-fall. But if it were dropped from the top of the chain it would travel for forty years, day and night, before it would reach its foundation or bottom.” (Hasan)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "Abu Hurairah narrated that the Prophet (s.a.w) said:\"This Fire of yours, which the sons of Adam kindle, is one part from seventy parts of the heat of the Hell.\" They said: \"By Allah! Would it not have been enough O Messenger of Allah?!\" He said: \"It is sixty-nine parts more – all of them similar in heat.” (Sahih)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "Abu Sa'eed narrated that the Prophet (s.a.w) said:\"This fire of yours is one part from seventy parts of the fire of Hell, each part of it is like the heat of this one",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "Abu Hurairah narrated:that the Messenger of Allah (s.a.w) said: \"The Fire complained to its Lord. It said: 'Some parts of me consume other parts.' So He allowed it to take two breaths: one during the winter, and during the summer. As for the breath in the winter then it is Zamharir, and as for the breath in the summer then it is Samum. Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"text": "From Anas, that the Messenger of Allah (s.a.w) said – Hisham (one of the narrators) narrated it:“Some will exit the Fire,” Shu`bah (another narrator) narrated it: 'Remove from the Fire whoever said La ilaha illallah and had good in his heart equal to the weight of a grain of barley. Remove from the Fire anyone who said La Ilaha illallah and had good in his heart equal to the weight of a grain of wheat. Remove from the Fire anyone who said La ilaha illallah and had good in his heart equal to the weight of a speck.” And Shubah said: “What is equal to the weight of a light piece of corn.” (Sahih) Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "Anas said that the Prophet (s.a.w) said:\"Allah will say: 'Remove from the Fire whoever remembered Me one day, or feared Me while in a state of sinning",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "Ibn Masud narrated that the Messenger of Allah (s.a.w) said:\"I know the last of the people of the Fire to depart from it. A man will exit it crawling, and he will say: 'O Lord! The people have taken all the places.'\" He said: \"So it will be said to him: 'Go to Paradise to enter Paradise.' So he will go to enter, but he will see that the people have taken all the places. He will return and say: 'O Lord! The people have taken all of the places.' So it will be said to him: 'Do you remember the times you used to live in?' And he will say: 'Yes.' So it will be said to him: 'Wish, He will wish for something, and it will be said to him: 'For you is whatever you wished for, and ten times the world.' He will say: 'Do you mock me while you are the King?'\" He (Ibn Masud) said: \"I saw the Messenger of Allah (s.a.w) laugh until his molars were visible",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "Abu Dharr narrated that the Messenger of Allah (s.a.w) said:\" I know the last of the people of the Fire to depart from the Fire and the last of the people of Paradise to enter Paradise. A man will be brought forth and He (s.a.w) will say: 'Ask about his small sins and hide his large sins.' So it will be said to him: 'Did you do this and that on such and such a day, did you do this and that on such- and – such a day?'” He said: “Then it will be said to him; 'For each of your sins you shall have a reward.'” He (s.a.w) said: “So he will say: 'O Lord! I have done things that I do not see here.'” He (Abu Dharr) said: “I saw the Messenger of Allah (s.a.w) laugh until his molars were visible.” (Sahih)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "Jabir narrated that the Messenger of Allah (s.a.w) said:\" Some of the people of Tawhid will be punished in the Fire until they are coals. Then the Mercy (of Allah) will reach them, they will be taken out and tossed at the doors of Paradise.\" He said: \" The people of Paradise will pour water over them, and they will sprout as the debris carried by the flood sprouts, then they will enter Paradise",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (s.a.w) said:\"Whoever had the weight of a speck of faith in his heart will depart from the Fire.\" Abu Sa'eed said: \"Whoever has doubt then let him recite: Indeed Allah does not deal unjustly with even the weight of a speck",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"Indeed two men among those who entered the Fire will be screaming violently. So the Lord, Blessed and Exalted, will say: 'Take them out.' Then when they are taken out He will say: 'What caused you to scream so violently?' They will say: 'We did that so You would have mercy on us.' He will say: 'My mercy for you is that you both go and throw yourselves where you were in the Fire.' So they will go. One of them will throw himself in, and He will make it cool and peaceful for him. And the other will stand there and not throw himself in, so the Lord, Mighty and Majestic, will say to him: 'What prevented you from throwing yourself in as your companion did?' He will say: 'O Lord! I hope that you will not return me to it aftrr You have taken me out.' So the Lord, Blessed and Exalted, will say to him: 'For you is what you hoped for,' and so they will both enter Paradise together by the mercy of Allah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "Imran bin Husain narrated that the Prophet (s.a.w) said:'A group from my Ummah will depart from the Fire through my intercession, and they will be called the Jahannamiyyun",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"I have not seen the likes of the Fire in which the one who runs from it sleeps, nor the likes of Paradise in which the one who seeks it sleeps",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "Ibn 'Abbas narrated that the Messenger Of Allah (s.a.w) said:\"I looked into Paradise and I saw that the most of its people were the poor; and I looked into the Fire and I saw that most of its people were women",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "Imran bin Husain narrated that the Messenger Of Allah (s.a.w) said:\" I looked into the Fire and I saw that most of its people are women, and I looked into Paradise and I saw that most of its people were the poor.\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "An-Numan bin Bashir narrated that the Messenger Of Allah (s.a.w) said:\"Indeed the person among the inhabitants of the Fire punished least [on the Day of Judgment] is a man who has two coals beneath his feet, which cause his brain to boil.\" Other chains report similar narrations",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "Harithah bin Wahb Al-Khuzai narrated that the Messenger of Allah (s.a.w) said:\"Should I not inform you about the people of Paradise: They are every humble and weak person, who if he were to make an Oath by Allah, He would fulfill it. Should I not inform you about the people of the Fire: They are every prideful, swaggering, ill-speaking person",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "Narrated Zur'ah bin Muslim bin Jardah Al-Aslami:about his grandfather Jarhad, he said: \"The Prophet (ﷺ) passed by Jarhad in the Masjid and his thigh was exposed, so he said: 'Indeed the thigh is 'Awrah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 19
			}
		}
	]
}