{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abu Ashim] berkata, telah menceritakan kepada kami [Abdul Hamid bin Ja'far] berkata, telah menceritakan kepada kami [Muhammad bin Amru bin 'Atho`] berkata; aku mendengar [Abu Humaid As Sa'idi] -ia adalah seorang dari sepuluh orang sahabat Rasulullah shallallahu 'alaihi wasallam yang sedang berkumpul- di antara mereka juga ada [Abu Qatadah], ia berkata, \"Aku adalah orang yang paling tahu tentang shalat Rasulullah shallallahu 'alaihi wasallam daripada kalian semua, \" mereka bertanya, \"Bagaimana bisa! Demi Allah, tidaklah engkau lebih banyak mengikuti Rasulullah ketimbang kami, dan tidak lebih dahulu bertemu dengan beliau daripada kami?\" Abu Qatadah menjawab, \"Benar. \" Mereka berkata, \"Maka jelaskanlah (kepada kami), \" Abu Qatadah berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam berdiri shalat, beliau takbir dan mengangkat kedua tangannya hingga sejajar dengan kedua pundak dan setiap organ tubuh kembali ke tempatnya. Kemudian beliau meletakkan dua telapak tangannya dan bertumpu pada lutut, seimbang tidak mengangkat atau pun menurunkan kepalanya. Kemudian beliau mengucapkan; SAMI'A ALLAHU LIMAN HAMIDAHU seraya mengangkat kedua tangannya hingga sejajar dengan kedua pundak dan setiap tulang kembali ke tempatnya. Setelah itu beliau turun ke bumi (sujud) dan menjauhkan kedua tangannya dari lambung, kemudian beliau mengangkat kepala dan membentangkan kaki kiri dan duduk di atasnya -beliau juga melenturkan jari-jari kakinya dan mengarahkan menghadap kiblat ketika sujud-, kemudian beliau sujud, kemudian takbir dan duduk di atas kaki kiri hingga setai tulang kembali ke asalnya. Setelah itu beliau bangun dan melakukan seperti itu pada raka'at yang lain. kemudian jika berdiri dari raka'at kedua, beliau mengangkat kedua tangannya sejajar dengan kedua pundak sebagaimana ketika beliau memulai shalat (Takbiratul Ikram). Kemudian beliau melakukan sisa shalatnya seperti itu, hingga ketika sampai pada sujud terakhir sebelum salam beliau mengakhirkan salah satu kakinya dan duduk tawarruk pada sisi kiri. \" Mereka berkata, \"Engkau benar, begitulah Rasulullah shallallahu 'alaihi wasallam shalat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 259
			}
		}
	]
}