{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yusuf As Sulami] berkata, telah menceritakan kepada kami [Khalid bin Makhlad] berkata, telah menceritakan kepada kami ['Abdurrahman bin Abu Al Mawali] berkata; aku mendengar [Muhammad Ibnul Munkadir] menceritakan dari [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengajari kami do`a istikharah sebagaimana beliau mengajari kami surat Al Qur`an. Beliau bersabda: \"Jika salah seorang dari kalian menginginkan sesuatu hendaklah shalat sunnah dua raka'at, setelah itu ucapkanlah; \"ALLAHUMMA INNI ASTAKHIIRUKA BI 'ILMIKA WA ASTAQDIRUKA BI QURATIKA WA AS`ALUKA MIN FADLIKAL 'AZHIIM FA INNAKA TAQDIRU WA LAA AQDIRU WA TA'LAMU WA LAA A'LAMU WA ANTA ALLAAMUL GHUYUUB ALLAHUMMA IN KUNTA TA'LAMU HADZAL AMRA KHAIRAN LI FII DIINI WA MA'AASYII WA 'AAQIBATI AMRII AU KHAIRAN LII FII 'AAJILI AMRII WA AAJILIHI FAQDURHULII WA YASSIRHULII WA BAARIKLII FIIHI WA IN KUNTA TA'LAMU SYARRAN LII FASHRIFHU 'ANNII WASHRIFNII 'ANHU WAQDURHULIL KHAIRA HAISTUMAA KAANA TSUMMA RADLDLINII BIHI (Ya Allah, sesungguhnya aku meminta pilihan yang tepat kepada-Mu dengan ilmu pengetahuan-Mu dan aku memohon kekuasaan-Mu (untuk mengatasi persoalanku) dengan kemahakuasaan-Mu. Aku mohon kepada-Mu sesuatu dari anugerah-Mu Yang Maha Agung, sesungguhnya Engkau Maha Agung, sesungguhnya Engkau Maha kuasa, sedang aku tidak kuasa, Engkau mengetahui sedang aku tidak mengetahui, dan Engkau adalah Maha Mengetahui hal yang ghaib. Ya Allah, apabila Engkau mengetahui bahwa urusan ini -menyebutkan apa yang menjadi persoalannya- lebih baik dalam agama dan kehidupanku, dan akibat terhadap diriku, atau beliau mengatakan: \"baik bagiku di dunia dan di akhirat, maka takdirkanlah untukku, mudahkan, dan berkahilah. Akan tetapi jika Engkau tahu bahwa perkara ini -ia menyebutkan kembali persoalan yang ia sebutkan di muka- berakibat buruk bagiku, maka singkirkanlah persoalan tersebut dan jauhkan aku darinya. Takdirkanlah untukku di mana pun kebaikan itu berada, kemudian ridlailah aku dengannya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 581
			}
		}
	]
}