{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "Telah menceritakan kepada kami [Isma'il bin Abdullah Ar Raqqi] berkata, telah menceritakan kepada kami [Ubaidullah bin Amru Ar Raqqi] dari [Abdullah bin Muhammad bin Aqil] dari [Ath Thufail bin Abu Ubai bin Ka'b] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam shalat menghadap ke arah sebatang kayu kurma, sebab masjid pada masa itu tidak mempunyai dinding, dan beliau juga berkhutbah di atas kayu tersebut. Seorang laki-laki dari sahabatnya berkata, \"Bagaimana jika kami buatkan sesuatu (mimbar) yang dapat engkau gunakan berdiri di hari jum'at, hingga orang-orang dapat melihatmu dan mendengar khutbahmu?\" beliau menjawab: \"Ya, \" maka sahabat itu membuatkan Rasulullah mimbar yang mempunyai tiga undakan, ketika para sahabat meletakkan mimbar tersebut pada tempat yang biasa beliau gunakan khutbah, dan Rasulullah shallallahu 'alaihi wasallam ingin berdiri di atasnya, beliau melintasi batang kayu yang biasa beliau gunakan untuk berkhutbah. Ketika melintas, batang kayu tersebut mengeluarkan suara dan terbelah. Rasulullah shallallahu 'alaihi wasallam pun turun, ketika beliau mendengar suara kayu itu beliau mengusapnya dengan tangan hingga ia menjadi tenang, setelah itu beliau kembali lagi ke atas mimbar. Jika shalat beliau selalu menghadap ke arah batang kayu tersebut, maka ketika masjid dirombak dan di ubah, Ubai bin Ka'b mengambil batang kayu tersebut. Batang kayu tersebut tetap di rumahnya hingga lapuk dan di makan rayap dan menjadi remukan-remukan kecil",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 612
			}
		}
	]
}