{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"8": "The Chapters Regarding Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "Telah menceritakan kepada kami [Abu Bisyr Bakr bin Khalaf] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Sulaiman bin Katsir] berkata, telah menceritakan kepada kami [Ibnu Syihab] dari [Salim bin Abdullah] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam, ia berkata, \"Salim membacakan aku sebuah kitab yang ditulis oleh Rasulullah shallallahu 'alaihi wasallam tentang sedekah sebelum Allah mewafatkannya. Lalu aku mendapati di dalamnya bahwa pada setiap lima ekor unta zakatnya adalah satu kambing, setiap sepuluh ekor zakatnya dua kambing, setiap lima belas ekor zakatnya tiga ekor kambing, setiap dua puluh ekor zakatnya empat kambing, setiap dua puluh lima hingga tiga puluh lima ekor zakatnya satu Bintu Mahkadl. Jika tidak didapatkan Bintu Makhadl, maka boleh Ibnu Labun laki-laki. Jika telah lebih dari tiga puluh lima hingga empat puluh ekor, maka zakatnya adalah Bintu Labun. Jika telah lebih dari empat puluh hingga enam puluh ekor, maka zakatnya adalah satu ekor Hiqqah. Jika telah lebih dari enam puluh hingga tujuh puluh lima, maka zakatnya adalah satu ekor Jadz'ah. Jika telah lebih dari tujuh puluh lima hingga sembilan puluh ekor, dua ekor bintu labun. Jika telah lebih dari sembilan puluh hingga seratus dua puluh ekor, maka zakatnya adalah dua ekor Hiqqah. Dan jika terus bertambah banyak, maka setiap kelebihan lima puluh ekor zakatnya adalah satu hiqqah, dan setiap kelebihan empat puluh ekor zakatnya adalah Bintu Labun",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		}
	]
}