{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 18,
			"arabicnumber": 18,
			"text": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata, telah menceritakan kepada kami [Yahya bin Hamzah] berkata, telah menceritakan kepadaku [Burd bin Sinan] dari [Ishaq bin Qabishah] dari [Bapaknya] berkata; [Ubadah bin Shamit Al Anshari] adalah seorang komandan dan sahabat Rasulullah shallallahu 'alaihi wasallam yang ikut berperang bersama Mu'awiyah di bumi Romawi. Dia memperhatikan orang-orang yang sedang melakukan jual beli pecahan emas dengan dinar dan pecahan perak dengan dirham. Kemudian ia berseru; \"Hai manusia, sesungguhnya kalian telah memakan riba, aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Janganlah kalian menjual emas dengan emas kecuali sebanding, tidak ada kelebihan dan tidak ada penangguhan antara keduanya.\" Mu'awiyah berkata kepadanya; \"Wahai Abul Walid saya tidak memandang riba dalam transaksi ini, kecuali dalam penangguhannya! \" Ubadah menjawab; \"Aku sampaikan kepadamu hadits dari Rasulullah shallallahu 'alaihi wasallam, namun engkau berpendapat dengan pandanganmu sendiri. Sungguh, sekiranya Allah mengeluarkanku, maka aku tidak akan tinggal di wilayah kekuasaanmu meski aku di bawah perintahmu.\" Ketika kembali ke Madinah ia bertemu Umar bin Khaththab, lalu Umar berkata kepadanya, \"Hai Abul Walid, apa yang membuatmu datang ke sini? Lalu ia ceritakan kisah tersebut kepada Umar, dan ia tidak bercerita tentang tempat tinggalnya. Umar pun berkata: \"Hai Abul Walid, kembalilah ke negerimu. Sungguh, Allah akan membuat satu negeri menjadi hina tanpa keberadaanmu dan orang-orang sepertimu.\" Kemudian Umar menulis surat untuk Mu'awiyah; \"Engkau tidak berhak memerintahnya, dan ajaklah manusia mengikuti apa yang dikatakannya, karena dia di atas kebenaran",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 18
			}
		}
	]
}