{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"9": "The Chapters on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1989,
			"arabicnumber": 1989,
			"text": "Telah menceritakan kepada kami [Abu Umar Hafsh bin Amru] dan ['Abdurrahman bin Umar] keduanya berkata; telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat wanita yang mentato dan wanita yang minta ditato, wanita yang menyambung rambut dan wanita yang minta disambung rambutnya, wanita yang mencukur alis, dan wanita yang merenggangkan gigi agar tampak cantik, dengan merubah ciptaan Allah.\" Lalu sampailah hal itu pada seorang wanita dari bani Asad yang dipanggil dengan nama Ummu Ya'qub, ia kemudian datang menemui Abdullah dan berkata, \"Telah sampai kepadaku bahwa engkau mengatakan begini dan begini?\" Abdullah berkata: \"Apa yang menghalangiku hingga aku tidak melaknat orang yang Rasulullah shallallahu 'alaihi wasallam telah melaknatnya, dan itu juga telah ada dalam kitabullah! \" wanita itu berkata, \"Aku telah membaca dalam lembaran-lembaran (Al Quran) itu namun aku tidak mendapatkannya! \" Abdullah berkata, \"Jika memang engkau telah membacanya, pasti engkau akan mendapatkannya, tidakkah engkau membaca ayat: ' Apa yang diberikan Rasul kepadamu, maka terimalah. Dan apa yang dilarangnya bagimu, maka tinggalkanlah' wanita itu menjawab, \"Sudah, \" Abdullah berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang perbuatan tersebut.\" Wanita itu berkata, \"Sungguh, aku beranggapan celakalah mereka yang telah melakukannya.\" Abdullah berkata; \"Pergi dan lihatlah, \" maka wanita itu pergi dan melihat, namun ia tidak melihat sesuatu yang ia butuhkan. Ia berkata; \"Aku tidak melihat sesuatu pun! \" Abdullah berkata; \"Jika memang sebagaimana yang engkau katakan, maka ia tidak akan menggauli kami (mencerainya)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 145
			}
		}
	]
}