{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"15": "The Chapters on Charity"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2430,
			"arabicnumber": 2430,
			"text": "Telah menceritakan kepada kami [Muhammad bin Khalaf Al Asqalani] berkata, telah menceritakan kepada kami [Ya'la] berkata, telah menceritakan kepada kami [Sulaiman bin Yasir] dari [Qais bin Rumi] ia berkata, \"Sulaiman bin Udzunan meminjami Alqamah seribu dirham sampai waktu yang telah ditentukan, ketika waktu yang telah ditentukan habis, Sulaiman meminta dan memaksa agar ia melunasinya, Alqamah pun membayarnya. Namun seakan-akan [Alqamah] marah hingga ia berdiam diri selama beberapa bulan. Kemudian Alqamah datang kembali kepadanya dan berkata, \"Pinjami aku seribu dirham sampai batas waktu yang telah engkau berikan kepadaku dulu.\" Sulaiman menjawab, \"Baiklah, dan dengan rasa hormat wahai Ummu Utbah, berikanlah kantung milikmu yang tertutup itu.\" Ia pun datang dengan membawa kantung tersebut, kemudian Sulaiman berkata, \"Demi Allah, sesungguhnya itu adalah dirham-dirham milikmu yang pernah engkau bayarkan kepadaku, aku tidak merubah dirham itu sedikitpun.\" Alqamah berkata, \"Demi Allah, apa yang mendorongmu melakukan ini kepadaku?\" ia menjawab, \"Karena sesuatu yang aku dengar darimu.\" Ia bertanya, \"Apa yang kamu dengar dariku?\" ia menjawab, \"Aku mendengarmu menyebutkan dari [Ibnu Mas'ud] berkata, \"Sesungguhnya Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang muslim memberi pinjaman kepada orang lain dua kali, kecuali seperti sedekahnya yang pertama.\" Ia berkata, \"Seperti itu pula yang di beritakan Ibnu Mas'ud kepadaku",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 41
			}
		}
	]
}