{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"15": "The Chapters on Charity"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Syu'aib bin Ishaq] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Wahb bin Kaisan] dari [Jabir bin Abdullah] bahwa ayahnya wafat dan meninggalkan hutang tiga puluh wasaq kepada seorang yahudi. Jabir kemudian meminta perpanjangan waktu kepadanya, namun orang yahudi tersebut tidak mau memberi perpanjangan kepadanya. Jabir kemudian berbicara kepada Rasulullah shallallahu 'alaihi wasallam agar beliau bisa membantunya menghadapi yahudi itu. Maka datanglah Rasulullah shallallahu 'alaihi wasallam menemui orang yahudi itu dan mengatakan kepadanya agar mengambil buah kurma sebagai ganti hutang Jabir kepadanya, tetapi dia menolaknya. Rasulullah shallallahu 'alaihi wasallam pun mengajaknya bicara lagi, tetapi dia tetap menolak untuk memberi perpanjangan waktu kepada Jabir. Rasulullah shallallahu 'alaihi wasallam kemudian masuk ke dalam kebun kurma dan mengitarinya, beliau lantas berkata kepada Jabir: \"Petiklah buah itu dan bayarkan kepadanya.\" Setelah Rasulullah shallallahu 'alaihi wasallam kembali ia memetik buah kurma sebanyak tiga puluh wasaq, dan masih mempunyai sisa dua belas wasaq. Jabir kemudian menemui Rasulullah shallallahu 'alaihi wasallam untuk mengabarkan apa yang ia lakukan kepada beliau, namun ia tidak mendapati Rasulullah shallallahu 'alaihi wasallam di tempat. Saat Rasulullah shallallahu 'alaihi wasallam kembali, Jabir kembali datang dan mengabarkan bahwa ia telah membayarkannya, dan mengabarkan kepada beliau kelebihan yang ia dapatkan. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Kabarkanlah hal itu kepada Umar Ibnul Khaththab.\" Jabir lalu pergi menemui Umar dan mengabarkan kepadanya. Umar lantas berkata kepadanya, \"Aku telah mengetahui hal itu tatkala Rasulullah shallallahu 'alaihi wasallam berjalan di sana, Sungguh Allah telah memberkahi kebun kurma itu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 45
			}
		}
	]
}