{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"20": "The Chapters on Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2558,
			"arabicnumber": 2558,
			"text": "Telah menceritakan kepada kami [Ali bin Muhammad], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al 'A'masy] dari [Abdullah bin Murrah] dari [Al Barra bin Azib], ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bertemu dengan seorang laki-laki Yahudi yang berwajah memar dan bekas cambukan di tubuhnya. Lalu Rasulullah shallallahu 'alaihi wasallam memanggil mereka dan berkata, 'Apakah ini yang kalian temukan dalam kitab suci kalian mengenai hukuman bagi pezina?\" Mereka menjawab, \"Ya.\" Lalu Rasulullah memanggil salah seorang ulama dari kalangan mereka dan berkata, \"Aku menyerukan kepadamu atas nama Allah Yang telah menurunkan Taurat kepada Nabi Musa. Apakah demikian kalian menemukan hukuman untuk seorang pezina?\" la menjawab, \"Tidak\" dan seandainya engkau tidak tidak bersumpah padaku, maka aku tidak akan memberitahukan hal ini kepadamu. Di dalam kitab kami, kami temukan bahwa hukuman bagi seorang pezina adalah hukum rajam, tetapi sangat banyak dari kalangan pembesar-pembesar kami yang terkena hukum rajam. Apabila kami menangkap seorang Pembesar, maka kami biarkan dan apabila kami menangkap seorang dari kalangan bawah, maka kami melaksanakan hukum had tersebut kepadanya. Akhirnya kami berkumpul, dari kalangan bangsawan dan rakyat jelata untuk menyepakati bahwa hukuman atas pezina adalah dengan mencoreng wajahnya dengan arang dan hukuman dera sebagai ganti dari rajam. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, sunguh aku adalah orang yang pertama kali menghidupkan perintah-Mu, ketika mereka telah meniadakannya. Lalu beliau shallallahu 'alaihi wasallam meminta agar laki-laki tersebut dirajam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		}
	]
}