{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yahya], telah menceritakan kepada kami [Abdurrazak], telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah]; sesungguhnya Rasulullah shallallahu 'alaihi wasallam mengutus Abu Jahm bin Khudzaifah untuk mengambil zakat, tetapi seseorang menolaknya untuk membayarkan zakatnya, maka Abu Jahm memukulnya hingga melukai bagian kepalanya. Lalu datanglah mereka kepada Nabi shallallahu 'alaihi wasallam dan berkata; \"Qishaslah wahai Rasulullah\". Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kalian mendapatkan seperti ini dan seperti ini.\" Tetapi mereka tidak mau menerima. Kemudian beliau bersabda kembali: \"Bagi kalian seperti ini dan seperti ini.\" Maka mereka menerimanya. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku akan berbicara kepada orang-orang dan memberitahukan kepada mereka dengan kerelaan kalian.\" Mereka berkata: \"Silahkan.\" Maka Nabi shallallahu 'alaihi wasallam berkhutbah dan bersabda: \"Sesungguhnya mereka orang-orang suku Laits telah mendatangiku dan menginginkan qishas, kemudian aku tawarkan kepada mereka seperti ini dan seperti ini, apakah kalian rela?\". Mereka menjawab; \" Tidak.\" Maka para sahabat Muhajirin pun gerang kepada mereka, sehingga Nabi shallallahu 'alaihi wasallam memerintahkan untuk menahan, dan mereka pun menahan. Kemudian beliau memanggil mereka dan menambahnya, serta bersabda: \"Apakah kalian telah rela?\" mereka menjawab; \"Iya\". Nabi bersabda: \"Aku akan berkhutbah dihadapan orang-orang dan memberitahukan kepada mereka tentang kerelaan kalian\". Mereka menjawab; \"Silahkan\". Maka Nabi shallallahu 'alaihi wasallam berkhutbah kemudian bersabda: \"Apakah kalian rela?.\" Mereka menjawab; \"Ya.\" Ibnu Majah berkata; Aku mendengar Muhammad bin Yahya berkata; Ma'mar meriwayatkan Hadits ini secara sendirian, aku tidak mengetahui ada riwayat dari yang lainnya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		}
	]
}