{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"25": "Chapters on Hajj Rituals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "Telah menceritakan kepada kami [Hisyam bin Ammar]; telah menceritakan kepada kami [Hatim bin Isma'il]; telah menceritakan kepada kami [Ja'far bin Muhammad] dari [Ayahnya], ia berkata; \"Aku pernah datang menemui [Jabir bin Abdullah]. Ketika kami menjumpainya, ia bertanya tentang kabar orang-orang, hingga ia bertanya tentang diriku. Maka aku menjawab; 'Aku Muhammad bin Ali bin Husain.' Maka ia letakkan tangannya di atas kepalaku sambil membuka kancing atas dan bawahku, lalu meletakkan pundaknya diantara dadaku dan saat itu aku masih kecil yang menginjak dewasa. Ia berkata; 'Selamat datang, tanyakanlah apa saja yang kamu ingini.' Aku bertanya kepadanya sedang ia seorang yang buta. Hingga tiba waktu shalat sedang ia berdiri di atas sajadahnya, yang apabila ia meletakkan tumitnya pada sisi-sisi sajadah maka akan tertarik karena kecilnya sajadah tersebut, adapun selendangnya menggantung di pundaknya dan ia pun shalat mengimami kami.' Lalu aku bertanya; 'Beritahukan pada kami bagaimana Rasulullah shallallahu 'alaihi wasallam berhaji! ' Maka ia mengisyaratkan dengan tangannya dan ia menjulurkan sembilan (jari jemarinya), dan berkata; 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam berdiam tidak berangkat haji selama sembilan tahun, lalu beliau menyerukan orang-orang untuk menunaikan ibadah haji pada tahun kesepuluh. Rasulullah shallallahu 'alaihi wasallam berangkat haji, lalu datanglah banyak orang ke Madinah, mereka semua ingin berkumpul dengan Nabi shallallahu 'alaihi wasallam dan mengerjakan seperti yang beliau kerjakan. Maka beliaupun berangkat, dan kamipun berangkat bersama beliau. Sesampainya kami di Dzul Hulaifah, Asma' binti Umais melahirkan Muhammad bin Abu Bakar, maka diutuslah kepada beliau untuk menanyakan; 'Apa yang patut aku perbuat? ' Lalu beliau bersabda kepada Asma: 'Mandilah dan ikatlah kencang-kencang dengan kain dan berihramlah.' Kemudian Rasulullah shallallahu 'alaihi wasallam shalat di masjid lalu mengendarai unta Qashwa, dan untanya pun berdiri tegak membawa beliau di atas padang Sahara.' Jabir berkata; 'Aku melihat sejauh pandanganku banyak orang yang berada di depan beliau, antara penunggang kendaraan dan pejalan kaki, juga yang berada di sisi kanan dan kiri serta belakang beliau (terlihat banyak orang). Rasulullah shallallahu 'alaihi wasallam berada di tengah-tengah kami, sedangkan Al Qur'an turun kepada beliau, dan beliau sangat tahu akan takwilnya. Apa saja yang beliau kerjakan, maka kami turut mengerjakannya. Beliau mengeraskan suara tauhid dengan mengucapkan: 'Aku penuhi panggilan-Mu, ya Allah. Aku penuhi panggilan-Mu, aku penuhi panggilan-Mu. Tiada sekutu bagi-Mu, Aku penuhi panggilan-Mu. Sesungguhnya pujian, kenikmatan dan kerajaan hanya milik-Mu, yang tiada sekutu bagi-Mu.' Orang-orang juga mengeraskan suara dengan bacaan yang mereka ucapkan, dan beliau shallallahu 'alaihi wasallam tidak mengatakan apapun atas tindakan mereka itu. Beliau shallallahu 'alaihi wasallam terus membaca talbiyahnya.' Jabir radliallahu 'anhu berkata lagi; 'Kami tidak berniat kecuali menunaikan haji saja, dan kami belum mengenal umrah. Sesampainya kami di Baitullah bersama beliau, beliau segera mengusap (mencium) Rukun (awal Thawaf), lalu berlari kecil tiga putaran dan berjalan biasa pada empat putaran (lainnya). Kemudian beliau pergi menuju maqam Ibrahim, seraya membaca ayat: ' Dan jadikanlah Maqam Ibrahim sebagai tempat shalat.' Beliaupun memposisikan dirinya antara Maqam Ibrahim dengan Baitullah (Ka'bah). -Bapakku berkata; - 'dan aku tidak mengetahui kecuali ia menyebutkannya dari Nabi shallallahu 'alaihi wasallam, bahwa Nabi membaca surah Al Kaafiruun dan Al Ikhlaash dalam shalat dua rakaat (di Maqam Ibrahim). Kemudian beliau kembali ke Baitullah, lalu mengusap (mencium atau menyalami) Rukun (awal thawaf), lantas beliau keluar dari pintu (Ka'bah) menuju bukit Shafa. Dan ketika mendekati Shafa, beliau membaca: ' Sesungguhnya Shafa dan Marwa termasuk syiar-syiar Allah, kita memulai (sa'i) dengan apa yang telah Allah Subhanahu Wa Ta'ala mulai.' Beliau mulai bersa'i dari Shafa, lalu menaiki (bukit itu) hingga dapat melihat Ka'bah, kemudian beliau bertakbir, bertahlil dan bertahmid seraya mengucapkan: 'Tidak ada Tuhan selain Allah semata yang tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala pujian. (Dia) yang maha menghidupkan dan maha mematikan, serta Dia maha kuasa atas segala sesuatu. Tidak ada Tuhan selain Allah semata, yang tiada sekutu baginya, yang melaksanakan janji-Nya, menolong hamba-Nya dan mengalahkan seluruh golongan dengan sendirian.' Kemudian beliau berdoa diantara bacaan itu, lalu mengucapkan bacaan seperti itu tiga kali. Beliau lantas turun ke Marwa, sambil berjalan sehingga jika kedua kakinya telah tegak, beliau berlari kecil di tengah lembah. Tatkala kedua kakinya telah mendaki, beliau berjalan sampai tiba di Marwa. Di Marwa beliau melakukan seperti yang beliau lakukan di Shafa. Dan ketika Thawafnya berakhir di Marwa, beliaupun bersabda: 'Seandainya aku menghadap apa yang aku belakangi, maka aku tidak menggiring hewan sembelihan (al hadyu), dan aku menjadikannya umrah. Barang siapa diantara kalian tidak membawa hewan sembelihan, maka bertahllul-lah dan jadikanlah ia sebagai ibadah.' Maka seluruh orangpun bertahallul dan memendekan rambut kecuali Nabi shallallahu 'alaihi wasallam dan orang-orang yang membawa hewan sembelihan. Lalu Suraqah bin Malik bin Ju'syum berdiri seraya berkata; 'Wahai Rasulullah apakah ini berlaku untuk tahun ini, ataukah untuk selamanya'.\" (Perawi) berkata; 'Rasulullah shallallahu 'alaihi wasallam pun merangkai jemarinya dengan jari jemari seraya menjawab: 'Umrah masuk ke dalam haji (haji tamattu') beginilah caranya.' Beliau mengucapkan dua kali lantas bersabda: 'Tidak (ini hanya berlaku untuk tahun ini saja), tetapi untuk selamanya'.' (Perawi) berkata; 'Ali radliallahu 'anhu datang membawa unta (al hadyu) Nabi shallallahu 'alaihi wasallam, maka ia mendapatkan Fathimah termasuk orang yang bertahallul tengah memakai pakaian berwarna dan memakai sipat mata. Ali pun menyalahkannya, maka Fatimah pun berkata; 'Bapakku (Nabi shallallahu 'alaihi wasallam) telah memberitahuku berbuat begini.' Ali radliallahu 'anhu mengatakannya saat di Irak: 'Lalu aku pergi meminta nasehat kepada Rasulullah shallallahu 'alaihi wasallam dan mengeluhkan perbuatan Fatimah yang aku ingkari itu. Maka beliau menjawab: 'Ia (Fatimah) benar, ia benar. Apa yang telah aku katakan ketika kamu ingin melakukan ibadah haji dulu? ' Ali menjawab; 'Aku berkata; 'Ya Allah, aku mengeraskan suara yang dikeraskan oleh Rasul-Mu shallallahu 'alaihi wasallam.' Beliau bersabda: 'Sesungguhnya aku membawa hewan kurban, maka janganlah kamu ikut bertahallul'. (Perawi) berkata; 'Hewan kurban yang dibawa Ali dari Yaman dan yang dibawa Rasulullah shallallahu 'alaihi wasallam dari Madinah berjumlah seratus ekor. Kemudian semua orang bertahallul dan memendekan rambutnya kecuali Nabi shallallahu 'alaihi wasallam dan orang-orang yang membawa hewan kurban. Ketika hari Tarwiyah datang mereka semua menuju Mina dan meneriakkan niat haji. Rasulullah shallallahu 'alaihi wasallam naik kendaraan, dan di sana beliau mengerjakan shalat Dzuhur, Ashar, Maghrib, Isya', dan Subuh. Kemudian menunggu sebentar sampai matahari terbit, lalu memerintahkan untuk mendirikan Kubah di Masy'aril haram maka ditancapkan di Namirah. Rasulullah shallallahu 'alaihi wasallam kemudian berjalan seperti yang biasa kaum Quraisy kerjakan, tetapi beliau berhenti di Masy'aril Haram atau Muzdalifah. Rasulullah shallallahu 'alaihi wasallam membolehkannya sampai tiba di Arafah. Dan ketika mendekati kubah yang telah didirikan di Namirah, beliau singgah di sana. Ketika matahari tergelincir, beliau memerintahkan agar untanya (Qashwa) didatangkan, lalu beliau mengendarainya hingga tiba di perut lembah. Lantas beliau berkhutbah pada khalayak: 'Sesungguhnya darah kalian, harta, kehormatan dan kebahagiaan (kemuliaan) kalian adalah haram sebagaimana keharaman hari kalian ini, dibulan dan negeri kalian ini, camkanlah, sesungguhnya segala perkara jahiliyyah adalah terhina di bawah kakiku ini, darah-darah jahiliyyah telah dihinakan dan darah yang pertama kali aku hinakan adalah darah Rabi'ah bin Harits (yang dahulu meminta susuan dari bani Sa'ad lalu ia dibunuh Hudzail), riba jahiliyyah telah dihapuskan sedang riba yang pertama kali aku hapuskan adalah riba kami, yaitu riba yang dilakukan Abbas bin Abdul Muthallib, semuanya telah dihapuskan. Maka bertakwalah kepada Allah dari para wanita, karena kalian telah menjadikan mereka isteri dengan amanat Allah dan kalian halalkan farji dengan kalimat Allah. Sesungguhnya hak kalian atas mereka adalah agar mereka tidak membiarkan orang lain yang kalian benci tidur di atas ranjang kalian. Jika isteri-isteri kalian melakukannya, maka pukullah mereka dengan pukulan yang tidak melukai. Dan bagi mereka atas kalian untuk dinafkahi dan diberi pakaian dengan jalan yang baik. Aku tinggalkan untuk kalian dua perkara yang jika kalian berpegang teguh pada keduanya maka kalian tidak akan tersesat yaitu Kitabullah. Dan kalian bertanggung jawab kepadaku. Lalu apa yang ingin kalian katakan? ' Mereka menjawab; 'Kami bersaksi bahwa engkau telah menyampaikan, melaksanakan tugas dan memberikan nasehat. Maka beliau bersabda sambil menunjukan jarinya ke langit: 'Ya Allah, saksikanlah! Ya Allah saksikanlah.' Beliau mengucapkannya sampai tiga kali. Kemudian Bilal mengumandangkan adzan, lalu iqamat, maka beliau mendirikan shalat Zhuhur. (Selepas itu) Bilal kembali beriqamat, lalu beliau mendirikan shalat Ashar dan tidak melakukan shalat apapun diantara keduanya. Kemudian Rasulullah shallallahu 'alaihi wasallam mengendarai kendaraannya sehingga sampai ke tempat wukuf. Lalu beliau mendudukkan untanya (menjadikan perut untanya menyentuh padang) dan menjadikan tali pejalan kaki di depannya, lalu beliau menghadap kiblat. Beliau terus berwukuf sampai terbenamnya matahari dan sinar kekuning-kuningan sedikit sirna serta tenggelamnya bola matahari. Lalu beliau membonceng Usamah bin Said dan bertolak. Beliau pun mengikat Qashwa dengan kendali, hingga kepalanya nyaris menyentuh pangkal kaki kendaraan yang beliau tunggangi. Sambil mengisyaratkan dengan tangan kanannya, beliau bersabda: 'Wahai manusia, tenang, tenang! ' Setiap kali beliau mengulurkan tali kendali untanya, maka beliau menenangkan sedikit sehingga untanya agak naik. Kemudian tibalah beliau di Muzdalifah, lalu mengerjakan shalat Maghrib dan Isya' di sana dengan sekali adzan dan dua kali iqamat. Dan beliau tidak melakukan shalat apapun diantara keduanya. Kemudian beliau shallallahu 'alaihi wasallam berbaring sampai terbit fajar. Beliau mendirikan shalat fajar ketika nampak jelas baginya waktu subuh, dengan sekali adzan dan sekali iqamat. Kemudian beliau mengendarai Qashwa sampai tiba di Masy'aril Haram, lalu beliau menaiki bukitnya lantas memuji Allah (bertahmid), mengagungkan-Nya (bertakbir) dan mengesakan-Nya (bertahlil). Beliau terus melakukan Wukuf sampai matahari benar-benar terang, lalu bertolak sebelum terbit matahari. Beliau membonceng Fadl bin Abbas (seorang laki-laki berambut bagus, putih kulitnya dan ganteng). Ketika Rasulullah shallallahu 'alaihi wasallam bertolak, beliau melintasi para wanita yang sedang berlari, maka beliau memandang kepada mereka lalu meletakkan tangannya ke sisi lain. Sementara Fadl pun memalingkan mukanya ke sisi lain. Sesampainya di Muhassar, beliau bergerak sedikit kemudian mengambil jalan pintas menuju jumrah Kubra (Aqabah), dan langsung sampai di jumrah yang berada di sisi pohon. Lalu beliau melontar tujuh kerikil dengan bertakbir pada setiap lemparan, (dengan) kerikil yang besarnya seperti kerikil ketapel. Dan beliau melontarnya dari perut lembah. Lalu ia bertolak ke tempat menyembelih hewan kurban. Di sana beliau menyembelih sendiri enam puluh tiga ekor hewan kurban, dan menyerahkan kepada Ali sisanya berikut hewan kurbannya. Kemudian beliau memerintahkan dari setiap hewan kurban yang disembelihnya agar sepotong dagingnya disisihkan lalu di letakan di kuali, lantas dimasak. Rasulullah dan Ali pun memakan dan menghirup kuahnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bertolak menuju Ka'bah (untuk mengerjakan Thawaf Ifadhah), lalu beliau mengerjakan Shalat Zhuhur di Makkah dan mendatangi Bani Abdul Muththalib yang sedang mengambil air Zamzam. Beliau seraya bersabda: 'Rebutlah wahai Bani Muththalib. Seandainya orang-orang tidak mengungguli kalian dalam pemberian minuman kalian, tentu akan kuperebutkannya bersama kalian.' Lalu mereka pun memberi beliau shallallahu 'alaihi wasallam ember, dan beliau meminum darinya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 193
			}
		}
	]
}