{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"31": "Chapters on Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3549,
			"arabicnumber": 3549,
			"text": "Telah menceritakan kepada kami [Harun bin Hayyan] telah menceritakan kepada kami [Ibrahim bin Musa] telah memberitakan kepada kami ['Abdah bin Sulaiman] telah menceritakan kepada kami [Abu Janab] dari [Abdurrahman bin Abu Laila] dari ayahnya [Abu Laila] dia berkata, \"Ketika aku sedang duduk di samping Nabi shallallahu 'alaihi wasallam, tiba-tiba datang seorang Arab Badui seraya berkata, 'Sesungguhnya aku mempunyai saudara yang menderita sakit.\" Beliau bertanya: \"Apa sakit yang meninmpa saudaramu?\" Dia menjawab, \"Dia terserang ayan.\" Beliau bersabda: \"Pergi dan bawalah dia kesini.\" Maka dia pergi dan kembali (kepada beliau) bersama saudaranya dan mendudukkannya di depan beliau, maka aku mendengar beliau memberikan perlindungan kepadanya dengan Al Fatihah, empat ayat dari permulaan surat Al Baqarah, dua ayat dari tengahnya dan (ayat) WA ILAAHUKUM ILAAHUWWAAHID (dan tuhan kalian adalah tuhan yang satu), ayat kursi, tiga ayat dari penghujung surat Al Baqarah, dan satu ayat dari surat Ali 'Imran. Aku yakin beliau mengucapkan: \"SYAHIDALLAHU ANNAHU LAA ILAAHA ILLA HUWA (Allah bersaksi bahwa tidak ada ilah yang berhak disembah kecuali Dia) '. Beliau juga membaca satu ayat dari surat Al A'raaf: INNA RABBAKUMULLAHULLADZI KHALAQ (sesungguhnya Rabb kalian adalah yang menciptakan) ', satu ayat dari surat Al MuKminun: WA MAN YADA'U MA'ALLAHI ILAAHNA AAKHAR LAA BURHAANA LAHU BIHI '(Dan barang siapa yang menyeru bersama dengan Allah yaitu ilah yang lain, maka tidak ada petunjuk baginya), satu ayat dari surat Al Jin: WA ANNAHU TA'ALA JADDU RABBINAA MATTAKHADZA SHAAHIBATAN WA LAA WALADA (Dan bahwasannya Maha Tinggi kebesaran Rabb kami, Dia tidak beristeri dan tidak (pula) beranak) '. Sepuluh ayat dari surat Ash Shaffaat, tiga ayat dari akhir surat Al Hasyr, dan QULHUWALLAHU AHAD, dan dua mu'awidzatain. Kemudian orang Arab Badui itu bangun dan sembuh seakan-akan tidak menderita sakit",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 114
			}
		}
	]
}