{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"35": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3918,
			"arabicnumber": 3918,
			"text": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib Al Madani] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] dia berkata, \"Seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam ketika beliau kembali dari perang Uhud, laki-laki itu berkata, \"Wahai Rasulullah, aku bermimpi melihat awan menaungi dan menurunkan hujan minyak samin dan madu. Aku juga melihat orang-orang menadahinya dengan kedua telapak tangan mereka, maka ada yang mendapat banyak dan ada pula yang mendapat sedikit. Aku juga melihat tangga yang menghubungkan ke langit, kulihat anda menaikinya sampai ke atas. Kemudian ada seorang laki-laki menaikinya setelah anda, sehingga ia sampai ke atas. Lalu seorang laki-laki setelahnya pun turut menaikinya namun terputus dan diperbaiki untuknya sehingga ia pun sampai ka atas.\" Abu Bakar berkata, \"Izinkanlah aku untuk menta'birkannya, wahai Rasulullah.\" Beliau menjawab: \"Ta'birkanlah.\" Abu Bakar berkata, \"Adapun awan itu adalah Islam, sedangkan hujan minyak samin dan madu yang turun darinya adalah Al Quran dengan kenikmatan dan kelembutannya. Adapun yang ditadahi oleh orang-orang dengan kedua telapak tangan mereka adalah orang-orang yang mengambil Al Quran, ada yang mendapat banyak dan ada pula yang mendapat sedikit. Sedangkan tangga yang sampai ke langit adalah kebenaran yang ada pada dirimu, dan kamu mempertahankannya sehingga kamu dapat mencapai kemualiaan. Setelah itu seorang laki-laki setelahmu juga mempertahankannya dan membuat dirinya juga mulia. Setelah itu datang laki-laki lain dan ia juga mendapatkan kemuliaan dengannya, dan yang lain ada yang terputus, namun disambungkan lagi untuknya sehingga dengannya ia juga mendapatkan kemuliaan.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Apa yang kamu ta'birkan itu sebagiannya benar, dan sebagiannya lagi ada yang keliru.\" Abu Bakar berkata, \"Aku bersumpah atas namamu wahai Rasulullah, sekiranya anda berkenan untuk memberitahukan sebagian yang benar dan sebagian yang keliru kepadaku.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Bakar, janganlah kamu bersumpah dengan urusan seperti ini.\" Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Ubaidullah] dari [Ibnu Abbas] dia berkata; [Abu Hurairah] pernah bercerita bahwa seorang laki-laki datang menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, saya pernah bermimpi melihat naungan awan yang berada antara langit dan bumi, ia menurunkan minyak samin dan madu…kemudian dia menyebutkan hadits seperti di atas",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 26
			}
		}
	]
}