{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"35": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Al Hasan bin Musa Al Asyaib] telah menceritakan kepada kami [Hammad bin Salamah] dari ['Ashim bin Bahdalah] dari [Al Musayyab bin Rafi'] dari [Kharasyah bin Al Hur] dia berkata, \"Saya tiba di Madinah, lalu duduk-duduk bersama dengan beberapa orang tua di masjid Nabi shallallahu 'alaihi wasallam. Tiba-tiba seorang yang telah lanjut usia datang dengan bersandar pada tongkatnya, lalu orang-orang berkata, \"Barangsiapa ingin melihat seorang penghuni surga maka lihatlah orang ini! \" Orang itu kemudian berdiri dan shalat dua rakaat di belakang tiang masjid. Aku lalu mendekat dan berkata kepadanya, \"Sebagian orang telah menceritakan tentang dirimu begini dan begini.\" Orang itu menjawab, \"Segala puji bagi Allah, surga adalah milik Allah dan Dia memasukkan ke dalamnya siapa saja yang di kehendaki-Nya. Ketahuilah, bahwa pada zaman Rasulullah shallallahu 'alaihi wasallam aku telah bermimpi, kulihat seakan-akan seorang laki-laki telah menjumpaiku dan berkata kepadaku, 'Berangkatlah! ' Lalu aku berangkat bersamanya dan ia membawaku menelusuri tempat yang terang dan besar, lantas ditampakkan kepadaku jalan yang berada di sisi kiriku, dan aku ingin berjalan mengikuti jalan tersebut. Maka laki-laki yang bersamaku berkata, 'Sesungguhnya kamu bukan termasuk dari golongan mereka.\" Kemudian di tampakkan kepadaku jalan yang berada di sebelah kananku, maka aku berjalan mengikuti jalan tersebut hingga sampailah ke suatu gunung yang tidak dapat ditapaki kaki. Tiba-tiba lelaki itu memegang tanganku lantas mendorongku, dan tak disangka ternyata aku telah berada di puncaknya hingga aku tidak dapat bersandar dan berpegangan. Ternyata ada suatu tiang dari besi di atas puncak tersebut yang terbuat dari emas, maka ia pegang tanganku dan melemparkanku sehingga aku berpegangan pada seutas tali. Lalu dia bertanya, 'Sudahkah kamu berpegangan? ' Aku menjawab, 'Sudah.' Kemudian dia menghempaskan tiang tersebut dan aku pun berpegangan pada tali tersebut.' Orang itu berkata, 'Kemudian aku menceritakannya kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: 'Kamu telah bermimpi dengan mimpi yang baik. Adapun tempat yang terang dan besar itu adalah padang Mahsyar. Sedangkan jalan yang di perlihatkan di sisi kirimu adalah jalan penghuni neraka, dan kamu bukan termasuk dari penghuninya. Sedangkan jalan yang di perlihatkan di sisi kananmu adalah jalan kananmu adalah jalan penghuni surga. Adapun gunung yang tidak dapat ditapaki kaki itu adalah kediaman para syuhada, dan tali yang kamu berpegang padanya adalah Islam. Maka berpeganglah kamu erat-erat sampai ajal menjemputmu.' Oleh sebab itu, aku berharap menjadi penghuni surga.\" Ternyata orang tua itu adalah [Abdullah bin Salam]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 28
			}
		}
	]
}