{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3952,
			"arabicnumber": 3952,
			"text": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Muhammad bin Syu'aib bin Syabur] telah menceritakan kepada kami [Sa'id bin Basyir] dari [Qatadah] dia menceritakan kepada mereka dari [Abu Qilabah Al Jarmi Abdullah bin Zaid] dari [Abu Asma Ar Rahabi] dari [Tsauban] mantan budak Rasulullah shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bumi disatukan bagiku sehingga saya dapat melihat sisi timur dan baratnya. Dan aku telah diberi dua perbendaharaan yang sangat berharga; yang kuning -atau merah- dan putih, yaitu emas dan perak. Kemudian dikatakan kepadaku, 'Sesungguhnya kerajaanmu seperti yang telah di satukan untukmu'. Dan aku memohon kepada Allah 'azza wajalla tiga perkara; supaya tidak menimpakan atas ummatku kelaparan sehingga akan membinasakan mereka, tidak mencampurkan mereka dalam golongan yang saling bertentangan dan merasakan keganasan antara yang satu dengan goliongan yang lain. Sesungguhnya telah difirmankan kepadaku: \"Jika Aku telah menentukan sesuatu, niscaya tidak akan ada yang dapat menolaknya, dan sesungguhnya Aku tidak akan menimpakan atas ummatmu kelaparan yang menyebabkan mereka binasa, dan tidak akan Aku campurkan mereka dari segala penjuru, sehingga sebagian dari mereka menumpas sebagian lainnya, dan mereka pun akan saling memerangi antara mereka.' Dan jika telah diperintahkan kepada ummatku untuk mengangkat pedang, maka tidak akan dicabut kembali sampai datangnya hari Kiamat. Dan di antara yang saya khawatirkan atas ummatku adalah para pemimpin yang menyesatkan, dan akan ada sebagian dari ummatku kelak yang menyembah berhala. Sebagian dari ummatku akan ada yang bergabung dengan kaum Musyrikin. Sesungguhnya di antara tanda-tanda hari Kiamat adalah munculnya para Dajjal pendusta, jumlah mereka hampir mencapai tiga puluh orang dan mereka semua akan mendakwakan dirinya seorang Nabi. Dan akan senantiasa ada dari umatku sekelompok orang yang berpegang terhadap kebenaran, mereka akan senantiasa mendapatkan pertolongan, dan tidak akan dapat di kalahkan oleh orang-orang yang menentangnya sampai tiba ketentuan Allah 'azza wajalla.\" Abu Al Hasan berkata, \"Ketika Abu Abdullah selesai membacakan hadits ini, ia berkata, 'Sungguh sangat mengerikannya perkara ini",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		}
	]
}