{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3955,
			"arabicnumber": 3955,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Abu Mu'wiyah] dan [Ayahku] dari [Al A'masy] dari [Syaqiq] dari [Hudzaifah] dia berkata, \"Kami pernah duduk bermajlis di sisi Umar, lalu ia berkata, \"Siapakah di antara kalian yang masih hafal hadits Rasulullah shallallahu 'alaihi wasallam tentang fitnah?\" aku menjawab, \"Aku.\" Lantas Umar berkata, \"Sesungguhnya kamu adalah seorang yang sangat pemberani.\" Umar melanjutkan, \"Bagaimana dengan hadits tersebut?\" Hudzaifah berkata, \"Aku pernah mendengar belaiu bersabda: \"Fitnah seorang laki-laki yang berasal dari isteri, anak dan tetangganya dapat terhapuskan dengan shalat, puasa, sedekah dan Amar Ma'ruf nahi munkar.\" Umar berkata, \"Bukan hadits ini yang kumaksud! tetapi fitnah yang kumaksudkan adalah yang bergemuruh laksana gemuruh ombak di lautan.\" Hudzaifah berkata, \"Apa hubungannya dirimu dengan fitnah tersebut wahai Amirul mukminin? Sepertinya dirimu dengan fitnah tersebut terdapat pintu yang terkunci.\" Umar bertanya, \"Apakah pintu itu dapat di rusak atau di buka?\" Hudzaifah menjawab, \"Tidak, namun harus di rusak.\" Umar berkata, \"Hal itu supaya tidak dapat ditutup kembali.\" Kami lalu bertanya kepada Hudzaifah, \"Apakah Umar tahu siapakah yang di maksud dengan pintu?\" Hudzaifah menjawab, \"Ya, seperti halnya ia mengetaui bahwa setelah esok hari pasti datang malam hari. Sebab aku telah menceritakan kepadanya hadits yang tidak terdapat kesalahan dan kedustaan.\" Kami ingin sekali bertanya siapakah pintuk itu? lalu kami katakan kepada Masruq, \"Tanyakanlah padanya.\" Hudzaifah lalu menjawab, \"Yaitu Umar sendiri",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		}
	]
}