{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3958,
			"arabicnumber": 3958,
			"text": "Telah menceritakan kepada kami [Ahmad bin 'Abddah] telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu 'Imran Al Jauni] dari [Al Muysa'ats] dari [Abdullah bin As Shamit] dari [Abu Dzar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana keadaanmu wahai Abbu Dzar, disaat kematian menimpa manusia sehingga rumah ditegakkan di kuburan.\" Aku berkata, \"Allah dan Rasul-Nya tidak mengungkapkan untukku.\" Atau, \"Allah dan Rasul-Nya yang lebih tahu.\" Beliau bersabda: \"Bersabarlah.\" Beliau kembali bersabda: \"Apa yang akan kamu lakukan sedangkan orang-orang tengah tertimpa kelaparan, sehingga kamu datang ke masjidmu lalu kamu tidak bisa lagi kembali ke kasurmu, dan kamu juga tidak bisa berdiri dari tempat tidurmu menuju ke masjidmu?\" Abu Dzar berkata, \"Aku berkata, \"Allah dan Rasul-Nya yang lebih tahu.\" Atau, \"Allah dan Rasul-Nya tidak mengabarkan untukku.\" Beliau bersabda: \"Hendaklah kamu menjaga kebersihan dirimu.\" Kemudian beliau bersabda lagi: \"Apa yang akan kamu lakukan sementara pembunuhan telah menimpa manusia sehingga Hijrah Az Zait (nama tempat di Madinah) di banjiri oleh darah.\" Aku menjawab, \"Allah dan Rasul-Nya tidak mengabarkannya untukku.\" Beliau bersabda: \"Bergabunglah kamu dengan orang-orang yang kamu berasal darinya.\" Abu Dzar berkata, \"Aku berkata, \"Wahai Rasulullah, bolehkan kuambil pedangku lalu aku tebas orang-orang yang demikian (memerangi kaum muslimin)? ' Beliau menjawab: \"Kalau begitu, kamu telah ikut serta dengan kaum itu. Tetapi masuklah (diamlah) di rumahmu.\" Aku bertanya, \"Wahai Rasulullah, bagaimana jika rumahku di masuki (mereka)? Beliau menjawab: \"Jika kamu disilaukan oleh sinar pedang, maka lemparlah (tutuplah) ujung selendangmu di mukamu, sehingga ia akan menanggung dosanya dan dosamu, dan ia termasuk dari penghuni Neraka",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		}
	]
}