{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3959,
			"arabicnumber": 3959,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami ['Auf] dari [Al Hasan] telah menceritakan kepada kami [Asid bin Al Mutasyammas] dia berkata; telah menceritakan kepada kami [Abu Musa] telah menceritakan kepada kami Rasulullah shallallahu 'alaihi wasallam, beliau bersabda \"Sesungguhnya di antara (tanda-tanda) hari Kiamat adalah terjadinya kekacauan.\" Abu Musa berkata, \"Saya bertanya, \"Wahai Rasulullah, apakah yang di maksudkan kekacauan?\" beliau menjawa: \"Pembunuhan.\" Sebagian kaum Muslimin lalu bertanya, \"Wahai Rasulullah, dalam satu tahun ini kami telah membunuh kaum Musyrikin begini dan begini.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukannya membunuh kaum Musyrikin, akan tetapi kalianlah yang akan saling bunuh sesama kalian, sehingga seseorang membunuh tetangganya, anak pamannya, dan kerabat dekatnya sendiri.\" Sebagian yang lain lalu bertanya, \"Wahai Rasulullah, mekipun saat itu para ulama masih bersama kami?! Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak, para ulama akan dimatikan lalu diganti dengan orang-orang hina dan bodoh.\" Kemudian Abu Musa Al Asy'ari berkata, \"Demi Allah, sesungguhnya aku memastikan bahwa perkara itu akan menimpa kita dan kalian. Demi Allah, tidak ada jalan keluar bagiku dan kalian, jika apa yang telah di janjikan Rasulullah shallallahu 'alaihi wasallam itu menimpa kita, kecuali jika kita keluar sebagaimana kita masuk ke dalamnya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		}
	]
}