{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4030,
			"arabicnumber": 4030,
			"text": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Sa'id bin Basyir] dari [Qatadah] dari [Mujahid] dari [Ibnu Abbas] dari [Ubay bin Ka'ab] dari Nabi shallallahu 'alaihi wasallam, bahwa ketika malam diisra`kan, beliau menemukan bau yang sangat harum. Maka beliau pun bertanya: \"Wahai Jibril, apakah bau harum ini?\" Jibril menjawab, \"Ini adalah bau harum kuburanya Masyithah, kedua anaknya beserta suami.\" Jibril melanjutkan, \"Pada awal mulanya, khidlir termasuk dari kalangan orang-orang mulia Bani Israil dan dia sering melewati seorang Rahib yang tinggal di biara. Setiap kali lewat Rahib itu muncul ke hadapannya, lantas dia mengajarkan Islam kepadanya. Tatkala Khidlir telah mencapai aqil baligh, bapaknya menikahkannya dengan seorang perempuan, maka Khidlir pun mengajarkan (Islam) kepada isterinya. Lalu dia minta kepada isterinya agar tidak memberitahukan ajaran tersebut kepada seorangpun. Karena Khidlir tidak pernah mendekati seorang wanita, maka dia mentalaknya, kemudian ayahnya menikahkannya lagi dengan wanita lain, maka Khidlir pun mengajarkan kepada isterinya yang baru dan meminta kepadanya agar tidak memberitahukan ajaran tersebut kepada seorangpun. Ternyata salah seorang dari keduanya menyembunyikannya dan yang lainnya menyebarkannya, Maka dia bergegas pergi sehingga tiba di suatu pulau di tengah laut. Dan di sana dua lelaki yang sedang mencari kayu melihatnya, maka salah seorang darinya menyembunyikan sedang yang lain menyebarkan, Orang yang menyebarkan (berita itu) berkata, \"Aku telah melihat Khidlir.\" Maka dia ditanya, \"Dengan siapa kamu melihatnya.\" Dia menjawab, \"Dengan fulan.\" Laki-laki itu berkata lagi, \"Tetapi dia menyembunyikannya. Dan kebiasaan dalam agama mereka, bahwa siapa berdusta maka akan dibunuh.\" Dia menuturkan kembali, \"Maka laki-laki itu menikahi seorang perempuan yang bisa menjaga rahasia, ketika dia sedang menyisir anak perempuan Fir'aun, tiba-tiba sisirnya terjatuh, sambil berkata, \"Celaka Fir'aun.\" Maka puterinya memberitahukan kepada bapaknya. Sedangkan wanita itu memiliki dua orang anak dan suami. Maka Fir'aun mengutus utusan kepada perempuan itu dan suaminya untuk merayu agar kembali kepada agamanya, tetapi keduanya menolak, maka utusan itu berkata, \"Aku akan membunuh kalian berdua.\" Keduanya berkata, \"Sebagai budi baik darimu kepada kami, apabila kamu membunuh kami hendaknya kamu jadikan kami di satu rumah.\" Maka dia melakukannya.\" Tatkala Nabi shallallahu 'alaihi wasallam di israkan, beliau mendapati bau harum, maka dia bertanya kepada Jibril dan Jibril pun memberitahukan kepada beliau",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		}
	]
}