{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4042,
			"arabicnumber": 4042,
			"text": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Abdullah bin Al 'Ala] telah menceritakan kepadaku [Busr bin 'Ubaidullah] telah menceritakan kepadaku [Abu Idris Al Khaulani] telah menceritakan kepadaku ['Auf bin Malik Al Asyja'i] dia berkata, \"Saya pernah datang kepada Rasulullah shallallahu 'alaihi wasallam saat beliau ikut dalam perang Tabuk. Saat itu beliau tengah berada di dalam tenda yang terbuat dari kulit, lalu aku duduk di depan tenda. Lantas beliau bersabda: \"Masuklah wahai 'Auf! \" Aku bertanya, \"Dengan seluruh tubuhku wahai Rasulullah?\" Beliau menjawab: \"Ya, dengan seluruh tubuhmu.\" Kemudian beliau bersabda: \"Wahai 'Auf, ingatlah diantara enam tanda-tanda hari Kiamat, salah satunya adalah kematianku.\" Lalu beliau melanjutkan: \"Kemudian dikuasainya Baitul Maqdis (oleh orang-orang non Muslim), munculnya penyakit yang mematikan di tengah-tengah kalian, yang dengannya Allah mematikan anak-anak dan diri-diri kalian serta membersihkan amal perbuatan kalian. Kemudian melimpahnya harta benda yang kalian miliki, sehingga walaupun ia telah diberi seratus dinar namun dirinya tetap marah (karena kurang), dan suatu fitnah yang akan terjadi di antara kalian sehingga tidak akan tersisa lagi satu rumahpun dari rumah-rumah kaum Muslimin kecuali akan dimasuki (fitnah tersebut). Kemudian antara kalain dengan Bani Ashfar akan terjadi gencatan senjata, lalu mereka mengkhianati kalian. Mereka akan datang untuk menyerang kalian dengan membawa delapan puluh bendera perang, dan setiap bendera membawahi dua belas ribu pasukan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 117
			}
		}
	]
}