{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4074,
			"arabicnumber": 4074,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Mujalid] dari [As Sya'bi] dari [Fatimah binti Qais] dia berkata, \"Suatu hari Rasulullah shallallahu 'alaihi wasallam shalat lalu naik mimbar, padahal biasanya beliau tidak langsung naik mimbar sebelum itu, kecuali pada hari Jum'at. Sehingga hal itu menjadikan suasana tampak serius bagi mereka. Ketika itu ada yang hendak beranjak pergi dan ada pula yang masih duduk, lantas beliau mengisyaratkan dengan tangannya kepada orang-orang supaya mereka duduk kembali. Beliau bersabda: \"Demi Allah, sesungguhnya aku duduk di tempatku ini tidaklah karena ada sesuatu yang bermanfaat buat kalian semua, untuk mengagetkan dan mencemaskan kalian. Akan tetapi Tamim Ad Dari telah datang kepadaku mengabarkan suatu berita yang mencegahku dari tidur siang, karena rasa senang dan gembira. Oleh karena itu, aku ingin sebarkan kepada kalian kebahagiaan Nabi kalian. Ketahuilah bahwa anak paman Tamim Ad Dari mengabariku bahwa angin telah mengarahkan (kapal) mereka menuju pulau yang tidak mereka kenal. Lalu mereka duduk-duduk di sampan kecil miliki perahu induknya. Lalu mereka keluar dengan sampan tersebut. Tiba-tiba mereka berhadapan dengan sosok yang berbulu lebat dan hitam, lantas mereka berkata kepada makhluk itu, 'Siapakah dirimu? ' ia menjawab, 'Aku adalah Al Jasasah.' Mereka bertanya lagi, 'Kabarkanlah kepada kami tentang dirimu! ' ia menjawab, 'Bukankah aku orang yang akan memberitahu kepada kalian dan juga menanyai kalian tentang sesuatu, namun di sana terdapat gua dan kalian telah melihatnya sepintas. Maka datangilah, karena di sana ada seorang laki-laki yang sangat merindukan kabar dari kalian dan ia pun akan mengabari kalian.\" Lantas mereka mendatangi gua tersebut dan menemui laki-laki yang dimaksud. Tiba-tiba mereka melihat seorang yang terbelenggu dengan ikatan yang kuat dan menampakkan kesedihan yang sangat. Orang tersebut berkata kepada mereka, 'Dari manakah kalian? ' mereka menjawab, 'Dari negeri Syam.' Ia bertanya lagi, 'Apa yang telah diperbuat oleh bangsa Arab? ' Mereka menjawab, 'Kami adalah suatu kaum dari bangsa Arab. Lantas apa yang hendak kamu tanyakan? ' Ia berkata, 'Apa yang telah diperbuat oleh seorang laki-laki yang diutus dari lingkungan kalian? mereka menjawab, 'Baiklah, ia telah menentang kaumnya, maka Allah memenangkan dirinya atas mereka. Kini, segala urusan mereka sama (satu), tuhan mereka satu dan agama mereka pun satu.\" laki-laki yang ada dalam gua itu bertanya, 'Apa yang diperbuat oleh 'Ain Zaghar (mata air di negeri Syam)? ' mereka menjawab, 'Mata air tersebut dipergunakan untuk menyirami tumbuh-tumbuhan mereka dan menghilangkan dahaga mereka.' Ia bertanya lagi, 'Apa yang diperbuat terhadap pohon yang terletak antara Amman dan Baisan? ' mereka menjawab, 'Pohon tersebut berbuah setiap tahunnya.' Ia bertanya lagi, 'Bagaimana keadaan danau At Thabariyah? ' mereka menjawab, '(airnya) melimpah sampai ke sisi-sisinya karena banyaknya air. Dan menghembuskan tiga kali semburan.' Lelaki itu berkata, 'Seandainya aku lepas dari ikatanku ini, maka tidaklah akan aku tinggalkan satu daratan pun melainkan akan aku singgahi dengan kedua kakiku ini, kecuali Thayyibah, sebab aku tidak kuasa menyinggahinya.' Nabi shallallahu 'alaihi wasallam bersabda: \"Sampai di sini habislah kegembiraanku. Dan inilah negeri yang baik (suci). Demi dzat yang jiwaku berada di tangan-Nya, di dalamnya tidak ada jalan yang sempit atau luas, dataran atau pun pegunungan melainkan di atasnya terdapat Malaikat yang menghunuskan pedangnya sampai hari Kiamat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Matn"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 149
			}
		}
	]
}