{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4080,
			"arabicnumber": 4080,
			"text": "Telah menceritakan kepada kami [Azhar bin Marwan] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dia berkata; telah menceritakan kepada kami [Abu Rafi'] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Ya'juj dan Ma'juj menggali lubang setiap harinya. Ketika mereka nyaris melihat cahaya matahari, maka yang mengusai mereka berseru, 'Kembalilah, kita akan menggalinya esok hari.' Maka Allah mengembalikannya melebihi dari yang sebelumnya. Dan ketika masa mereka telah sampai, dan Allah hendak mengirim mereka kepada manusia, maka mereka kembali menggali sampai ketika mereka nyaris melihat cahaya matahari, maka salah satu dari yang mengusai mereka berseru, 'Kembalilah, kalian akan menggalinya esok hari, jika Allah mengizinkan.' Maka mereka menunggu, lalu mereka kembali lagi ke tempat penggalian yang bentuknya masih seperti semula disaat mereka meninggalkannya. Maka mereka terus menggalinya dan akhirnya mereka dapat keluar kepada manusia. Lantas mereka menghirup air, dan manusia pun berlindung dari mereka di benteng-benteng. Lalu mereka melemparkan anak panah mereka ke langit, maka anak panah itu kembali dengan berlumuran darah. Maka mereka berkata, 'Kami telah menundukkan penduduk bumi, dan kami juga telah menguasai penduduk langit.' Setelah itu Allah mengutus sekelompok ulat di kepala mereka, lalu Allah membunuh mereka dengan binatang tersebut.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi dzat yang jiwaku berada di tangan-Nya, sesungguhnya bintang-binatang bumi akan menjadi gemuk dan bersyukur berkat daging-daging mereka",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 155
			}
		}
	]
}