{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4268,
			"arabicnumber": 4268,
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Syababah] dari [Ibnu Abu Dzi`b] dari [Muhammad bin 'Amru bin Al 'Atha`] dari [Sa'id bin Yasar] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya (ketika) mayit masuk ke dalam kuburnya, maka seorang yang shalih akan di di dudukkan dalam kuburnya tanpa rasa takut dan rasa kekhawatiran. Lalu akan di katakan kepadanya; \"Bagaimana keadaan akhir hayatmu?\" maka ia akan menjawab; \"Aku dalam keadaan Islam (berserah diri).\" kemudian ditanyakan lagi; \"siapakah lelaki ini?\" ia akan menjawab; \"Muhammad Rasulullah shallallahu 'alaihi wasallam, dia telah datang kepada kami dengan membawa keterangan-keterangan dari sisi Allah, lalu kami membenarkannya.\" di tanyakan lagi kepadanya; \"Apakah kamu melihat Allah?\" Ia menjawab; \"Tidak layak bagi seseorang untuk melihat Allah.\" maka di singkapkanlah baginya celah yang membatasi neraka, ia melihat gejolak apinya yang saling menghantam satu sama lainnya. Dan di katakan kepadanya; \"Lihatlah apa yang telah Allah perbuat untuk menyelamatkanmu.\" kemudian di singkapkan baginya celah yang menghalangi surga dan ia melihat hiasan dan seluruh keindahan yang terdapat di dalamnya. Maka di katakan kepadanya; \"Inilah tempatmu.\" dan di katakan kepadanya; \"atas keyakinan yang kamu jalankan, dan karenanya kamu di matikan serta dengannya pula kamu di bangkitkan Insya Allah.\" Dan seorang yang jahat akan didudukkan di dalam kuburnya dengan penuuh rasa takut dan kekhawatiran. Lalu di tanyakan kepadanya; \"Bagaimana keadaan akhir hayatmu?\" ia menjawab; \"Aku tidak tahu.\" di tanyakan kepadanya; \"Siapakah laki-laki ini?\" ia menjawab; \"Aku mendengar orang-orang membicarakan sesuatu dan aku pun mengikutinya.\" lalu di bukakan celah yang membatasi surga, dan ia melihat keindahan yang terdapat di dalamnya, maka di katakan kepadanya; \"Lihatlah kepada orang-orang yang Allah jauhkan dirimu darinya.\" kemudian di bukakan celah yang membatasi neraka dan ia melihat apinya saling menghantam satu sama lain, maka di katakan kepadanya; \"Inilah tempatmu, atas keraguan yang ada pada dirimu. Karenanya pula kamu mati dan dengannya pula kamu di bangkitkan Insya Allah Ta'ala",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 169
			}
		}
	]
}