{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Abdul Hamid bin Habib bin Abu Al 'Iysrin] telah menceritakan kepadaku [Abdurrahman bin 'Amru Al Auza'i] telah menceritakan kepadaku [Hasan bin 'Athiyah] telah menceritakan kepadaku [Sa'id bin Al Musayyab] bawha dia bertemu dengan Abu Hurairah, maka [Abu Hurairah] berkata: Aku mengharap kepada Allah semoga menyatukanku denganmu di pasar surga.\" Sa'id bertanya: \"Apakah disana ada pasar?\" Abu Hurairah menjawab: Ya, telah mengkhabarkan kepadaku Rasulullah shallallahu 'alaihi wasallam bahwa penghuni surga bila masuk surga, mereka tinggal di sana karena keutamaan amal-amal mereka, kemudian diizinkan pada hari jum'at dari hari-hari dunia lalu mereka mengunjungi Allah 'azza wajalla, maka Dia menampakkan 'arsy-Nya pada mereka, dan menampakkannya kepada mereka di salah satu taman dari taman-taman surga, sedangkan mimbar-mimbar dari cahaya, mimbar-mimbar dari mutiara, mimbar-mimbar dari yaqut, mimbar-mimbar dari permata, mimbar-mimbar dari emas, mimbar-mimbar dari perak diletakkan untuk mereka, yang paling rendah di antara mereka beserta tingkat kerendahannya duduk di atas gundukan tanah kesturi dan kafur dan mereka tidak menilai tempat duduk para pemilik kursi lebih baik dari mereka.\" Abu Hurairah berkata; lalu saya bertanya; \"Wahai Rasulullah, apakah kita akan melihat Rabb kita?\" Beliau menjawab: \"Ya.\" Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah kalian saling berbantahan saat melihat matahari dan bulan dimalam purnama?\" Kami menjawab: \"Tidak.\" Beliau bersabda: \"Seperti itu juga kalian tidak berbantahan dalam melihat Rabb kalian. Dan dimajlis itu tidak ada seorang pun melainkan Allah akan mendatanginya dengan sebenarnya hingga Dia akan bertanya kepada salah seorang dari kalian: \"Hai fulan, tidak ingatkah kau saat berkata begini dan begini?\" Allah mengingatkan sebagian kemaksiatan-kemaksiatannya ketika di dunia. Orang itu menjawab: \"Wahai Rabb, tidakkah Engkau mengampuniku?\" Allah menjawab: \"Ya, Demi luasnya ampunan-Ku sampai pada tempatmu ini.\" Saat mereka seperti itu, mega menaungi di atas mereka lalu turun hujan minyak wangi yang baunya sama sekali belum pernah mereka temukan, kemudian Dia berfirman: \"Berdirilah menuju kemuliaan yang telah Aku persiapkan untuk kalian, lalu ambillah yang kalian inginkan.\" Beliau bersabda: \"Lalu kami mendatangi pasar yang diliputi oleh Malaikat, di dalamnya ada yang belum pernah dilihat mata sama sekali, belum pernah terdengar oleh telinga dan tidak terlintas dihati.\" Beliau meneruskan: \"Lalu apa yang kami inginkan dibawakan untuk kami, di sana tidak dijual dan tidak juga dibeli. Di pasar itu, para penghuni surga saling bertemu satu sama lain. Seseorang yang memiliki derajat tinggi datang lalu bertemu dengan orang yang tingkatnya berada dibawahnya beserta kerendahan yang ada padanya, lalu ia gentar pada pakaian yang diperlihatkan padanya, akhir kata-katanya belum juga habis hingga ia berhayal yang lebih baik darinya, itu karena tidak layak bagi siapa pun untuk bersedih di surga. Setelah itu kami pulang ke rumah-rumah kami, kami disambut oleh isteri-isteri kami, mereka berkata: \"Selamat datang, kamu telah datang dengan keindahan yang lebih baik dari saat kamu meninggalkan kami. Kami menjawab: \"Sesungguhnya hari ini kami menemani Rabb kami Al Jabbar 'azza wajalla, dan tak layak bagi kami untuk pulang seperti ini",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 237
			}
		}
	]
}