{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Hammam bin Yahya] dari [Amir Al Ahwal] bahwa [Makhul] menceritakan kepadanya bahwa [Abdullah bin Muhairiz] menceritakan kepadanya, bahwa [Abu Mahdzurah] menceritakan kepadanya, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengajariku adzan dengan sembilan belas kalimat, dan iqamah dengan tujuh belas kalimat. Kalimat adzan itu adalah; ALLAHU AKBAR ALLAHU AKBAR ALLAHU AKBAR ALLAHU AKBAR, ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU ANNA MUHAMMADAN RASULULLAH, ASYHADU ANNA MUHAMMADAN RASULULLAH, ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU ANNA MUHAMMADAN RASULULLAH, ASYHADU ANNA MUHAMMADAN RASULULLAH, HAYYA 'ALASH SHALAH, HAYYA 'ALASH SHALAH, HAYYA 'ALAL FALAH, HAYYA 'ALAL FALAH, ALLAHU AKBAR ALLAHU AKBAR, LAA ILAAHA ILLALLAH. (Allah Maha Besar. Allah Maha Besar. Allah Maha Besar. Allah Maha Besar-Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah. Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah-Aku bersaksi bahwa Muhammad adalah utusan Allah. Aku bersaksi bahwa Muhammad adalah utusan Allah-Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah. Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah- Aku bersaksi bahwa Muhammad adalah utusan Allah. Aku bersaksi bahwa Muhammad adalah utusan Allah-Mari menuju shalat. Mari menuju shalat-Mari menuju kemenangan. Mari menuju kemenangan-Allah Maha Besar. Allah Maha Besar-Tidak ada Tuhan Yang berhak disembah selain Allah). Sedangkan kalimat iqamah adalah tujuh belas kalimat; ALLAHU AKBAR ALLAHU AKBAR ALLAHU AKBAR ALLAHU AKBAR, ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU ANNA MUHAMMADAN RASULULLAH, ASYHADU ANNA MUHAMMADAN RASULULLAH, HAYYA 'ALASH SHALAH, HAYYA 'ALASH SHALAH, HAYYA 'ALAL FALAH, HAYYA 'ALAL FALAH, QAD QAAMATISH SHALAH, QAD QAAMATISH SHALAH, ALLAHU AKBAR ALLAHU AKBAR, LAA ILAAHA ILLALLAH. (Allah Maha Besar. Allah Maha Besar. Allah Maha Besar. Allah Maha Besar-Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah. Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah-Aku bersaksi bahwa Muhammad adalah utusan Allah. Aku bersaksi bahwa Muhammad adalah utusan Allah-Shalat telah ditegakkan. Shalat telah ditegakkan-Mari menuju shalat. Mari menuju shalat-Mari menuju kemenangan. Mari menuju kemenangan-Allah Maha Besar. Allah Maha Besar-Tidak ada Tuhan Yang berhak disembah selain Allah)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		}
	]
}