{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 102,
			"arabicnumber": "12.01",
			"text": "ہاشم بن قاسم ابونضر نے کہا : ہمیں سلیمان بن مغیرہ نے ثابت کے حوالے سے یہ حدیث سنائی ، انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ ہمیں رسول اللہ ﷺ سے ( غیر ضروری طور پر ) کسی چیز کے بارے میں سوال کرنے سے روک دیا گیا تو ہمیں بہت اچھا لگتا تھا کہ کوئی سمجھ دار بادیہ نشیں آپ کی خدمت میں حاضر ہوا اور آپ سے سوال کرے اور ہم ( بھی جواب ) سنیں ، چنانچہ ایک بدوی آیا اور کہنے لگا ، اے محمد ( ﷺ ) ! آپ کا قاصد ہمارے پاس آیا تھا ، اس نے ہم سے کہا کہ آپ نے فرماتے ہیں : اللہ تعالیٰ نے آپ کو رسول بنا کر بھیجا ہے ۔ آپ نے فرمایا : ’’ اس نے سچ کہا ۔ ‘ ‘ اس نے پوچھا : آسمان کس نے بنایا ہے ؟ آپ نے جواب دیا : ’’ اللہ نے ۔ ‘ ‘ اس نےکہا : زمین کس نےبنائی ؟ آپ نے فرمایا : ’’اللہ نے ۔ ‘ ‘ اس نے سوال کیا : یہ پہاڑ کس نے گاڑے ہیں اور ان میں جو کچھ رکھا ہے کس نے رکھا ہے ؟ آپ نے فرمایا : ’’ اللہ نے ۔ ‘ ‘ بدوی نے کہا : اس ذات کی قسم ہے جس نے آسمان بنایا ، زمین بنائی اور یہ پہاڑ نصب کیے ! کیا اللہ ہی نے آپ کو ( رسول بنا کر ) بھیجا ہے ؟ آپ نے جواب دیا : ’’ ہاں! ‘ ‘ اس نے کہا : آپ کے قاصد نے بتایا ہے کہ ہمارے دن او رات میں پانچ نمازیں ہیں ۔ آپ نے فرمایا : ’’اس نے درست کہا ۔ ‘ ‘ اس نے کہا : اس ذات کی قسم جس نے آپ کو بھیجا ہے ! کیا اللہ ہی نے آپ کو اس کاحکم دیا ہے ؟ آپ نے جواب دیا : ’’ہاں ! ‘ ‘ اس نے کہا : آپ کو ایلچی کا خیال ہے کہ ہمارے ذمے ہمارے مالوں کی زکاۃ ہے ۔ آپ نے فرمایا : ’’ اس نے سچ کہا ۔ ‘ ‘ بدوی نے کہا : ا س ذات کی قسم جس نے آپ کو رسول بنا یا ! کیا اللہ ہی نے آپ کو یہ حکم دیا ہے ؟ آپ نے جواب دیا : ’’ہاں ! ‘ ‘ اعرابی نے کہا : آپ کو ایلچی کا خیال ہے کہ ہمارے سال میں ہمارے ذمے ماہ رمضان کے روزے ہیں ۔ آپ نے فرمایا : ’’ اس نے صحیح کہا ۔ ‘ ‘ اس نے کہا : اس ذات کی قسم جس نے آپ کو بھیجا ہے ! کیا للہ ہی نے آپ کو اس کاحکم دیا ہے ؟ آپ نے فرمایا : ’’ہاں ! ‘ ‘ وہ کہنے لگا : آپ کے بھیجے ہوئے ( قاصد ) کا خیال ہے کہ ہم پر بیت اللہ کا حج فرض ہے ، اس شخص پر جو اس کے راستے ( کو طے کرنے ) کی استطاعت رکھتا ہو ۔ آپ نے فرمایا ، ’’ اس نے سچ کہا ۔ ‘ ‘ ( حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ) پھر وہ واپس چل پڑا اور ( چلتے چلتے ) کہا : اس ذات کی قسم جس نے آپ کو حق کے ساتھ بھیجا ہے! میں ان پر کوئی اضافہ کروں گا نہ ان میں کوئی کمی کروں گا ۔ اس پر نبی کریم ﷺ نے فرمایا : ’’اگر اس نے سچ کر دکھایا تو یقیناً جنت میں داخل ہو گا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 10
			}
		}
	]
}