{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 116,
			"arabicnumber": "17.02",
			"text": "شعبہ نے ابو جمرہ سے حدیث بیان کی ، انہوں نے کہا : میں حضرت عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ اور ( دوسرے ) لوگوں کے درمیان ترجمان تھا ، ان کے پاس ایک عورت آئی ، وہ ان سے گھڑے کی نبیذ کے بارے میں سوال کر رہی تھی توحضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جواب دیا : رسول اللہ ﷺ کی خدمت میں عبد القیس کا وفد آیا ۔ رسول اللہ ﷺ نے پوچھا : ’’یہ کون سا وفد ہے ؟ ( یا فرمایا : یہ کو ن لوگ ہیں ؟ ) ‘ ‘ انہوں نے کہا : ربیعہ ( قبیلہ سے ہیں ۔ ) فرمایا : ’’ اس قوم ( یا وفد ) کو خوش آمدید جو رسوا ہوئے نہ نادم ۔ ‘ ‘ ( ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا ، ان لوگوں نے عرض کی : اے اللہ کےرسول ! ہم لوگ آپ کے پاس بہت دور سے آتے ہیں ، ہمارے اور آپ کے درمیان مضر کے کافروں کا یہ قبیلہ ( حائل ) ہے ، ہم ( کسی ) حرمت والے مہینے کے سوا آپ کے پاس نہیں آ سکتے ، آپ ہمیں فیصلہ کن بات بتائیے جو ہم اپنے ( گھروں میں ) پیچھے لوگوں کو ( بھی ) بتائیں اور اس کے ذریعے سے ہم جنت میں داخل ہو جائیں ۔ ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا : آپ نے ان چار باتوں کا حکم دیا اور چار چیزیں سے روکا ۔ آپ نے ان کو اکیلے اللہ تعالیٰ پر ایمان لانا کا حکم دیا اور پوچھا : ’’جانتے ہو ، صرف اللہ پر ایمان لانا کیا ہے ؟ ‘ ‘ انہوں نے کہا : اللہ اور اس کے رسول ہی زیادہ جاننے والے ہیں ۔ آپ نے فرمایا : ’’اس حقیقت کی گواہی دینا کہ اللہ کے سوا کوئی الٰہ نہیں اور محمد ﷺ اللہ کے رسول ہیں ، نماز قائم کرنا ، زکاۃ دینا ، رمضان کے روزے رکھنا اور یہ کہ تم مال غنیمت میں سے اس کا پانچواں حصہ ادا کرو ۔ ‘ ‘ اور انہیں خشک کدو سے بنائے ہوئے برتن ، سبز مٹکے اور تارکول ملے ہوئے برتن ( استعمال کرنے ) سے منع کیا ( شعبہ نے کہا : ) ابو جمرہ نے شاید نقیر ( لکڑی میں کھدائی کر کے بنایا ہوا برتن کہا یا شاید مقیر ( تارکول ملا ہوا برتن ) کہا ۔ اور آپ نے فرمایا : ’’ان کو خوب یاد رکھو اور اپنے پیچھے ( والوں کو ) بتا دو ۔ ‘ ‘ ابو بکر بن ابی شیبہ کی روایت میں ( من ورائکم کے بجائے ) من وراءکم ( ان کو ( بتاؤ ) جو تمہارے پیچھے ہیں ) کے الفاظ ہیں اور ان کی روایت میں مقیر کا ذکر نہیں ( بلکہ نقیر کا ہے ۔)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 24
			}
		}
	]
}