{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1173,
			"arabicnumber": "524.01",
			"text": "۔ عبد الوارث بن سعید نے ہمیں ابو تیاح صبعی سے خبر دی ، انہوں نے کہا : ہمیں حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے حدیث سنائی کہ رسول اللہﷺ مدینہ تشریف لائے تو مدینہ کے بالائی حصے میں اس قبیلے میں فروکش ہوئے جنہیں بنو عمرو بن عوف کہا جاتا تھا اور وہاں چودہ راتیں قیام فرمایا ، پھر آپ نے بنو نجار کے سرداروں کی طرف پیغام بھیجا تو وہ لوگ ( پورے اہتمام سے ) تلواریں لٹکائے ہوئے حاضر ہوئے ۔ ( انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : گویا میں رسول اللہﷺ کو آپ کی سواری پر دیکھ رہا ہوں ، ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ آپ کے پیچھے سوار ہیں اور بنو نجار کے لوگ آپ کے ارد گرد ہیں یہاں تک کہ آپ نے سواری کا پالان ابو ایوب ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آنگن میں ڈال دیا ۔ ( انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : ( اس وقت تک ) رسول اللہﷺ کو جہاں بھی نماز کا وقت ہو جاتا آپ وہیں نماز ادا کر لیتے تھے ۔ آپ بکریوں کے باڑے میں بھی نماز پڑھ لیتے تھے ۔ پھر آپﷺ کو مسجد بنانے کا حکم دیا گیا ۔ ( انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : چنانچہ آپ نے بنو نجار کے لوگوں کی طرف پیغام بھیجا ، وہ حاضر ہو گئے ۔ آپ نے فرمایا : ’’ اے بنی نجار! مجھ سے اپنے اس باغ کی قیمت طے کرو ۔ ‘ ‘ انہوں نے جواب دیا : نہیں ، اللہ کی قسم! ہم اس کی قیمت صرف اللہ تعالیٰ سے مانگتے ہیں ۔ انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اس جگہ وہی کچھ تھا جو میں تمہیں بتا رہا ہوں ، اس میں کجھوروں کے کچھ درخت ، مشرکوں کی چند قبریں اور ویرانہ تھا ، چنانچہ رسول اللہﷺ نے حکم دیا ، کجھوریں کاٹ دی گئیں ، مشرکوں کی قبریں اکھیڑی گئیں اور ویرانے کو ہموار کر دیا گیا ، اور لوگوں نے کجھوروں ( کے تنوں ) کو ایک قطار میں قبلے کی جانب گاڑ دیا اور دروازے کے ( طور پر ) دونوں جانب پتھر لگا دیے گئے ۔ ( انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : اور لوگ ( صحابہ ) رجزیہ اشعار پڑھ رہے تھے اور رسول اللہﷺ ان کے ساتھ تھے ، وہ کہتے تھے : اے اللہ! بے شک آخرت کی بھلائی کے سوا کوئی بھلائی نہیں ، اس لیے تو انصار اور مہاجرین کی نصرت فرما ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		}
	]
}