{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1199,
			"arabicnumber": "537.01",
			"text": "ہم سے ابو جعفرمحمد بن صباح اور ابو بکر بن ابی شیبہ نے حدیث بیان کی ۔ حدیث کے لفظوں میں بھی دونوں ایک دوسرے کے قریب ہیں ۔ دونوں نے کہا : ہم سے اسماعیل بن ابراہیم نے حدیث بیان کی ‘ انھوں نے حجاج صوّاف سے انھوں نے یحییٰ بن ابی کثیر سے ‘ انھوں نے ہلال بن ابی میمونہ سے ‘ انھوں نے عطاء بن یسار سے اور انھوں نے حضرت معاویہ بن ابی حکم سلمی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی انھوں نے کہا : میں رسول اللہ ﷺ کے ساتھ نماز پڑ ھ رہاتھا کہ لوگوں میں سے ایک آدمی کو چھینک آئی تو میں نے کہا : یرحمک اللہ’’اللہ تجھ پر رحم کرے ۔ ‘ ‘ لوگوں نے مجھے گھورنا شروع کر دیا ۔ میں نے ( دل میں ) کہا : میری ماں مجھے گم پائے ‘ تم سب کو کیا ہو گیا؟ کہ مجھے گھور رہے ہو پھروہ اپنے ہاتھ اپنی رانوں پر مارنے لگے ۔ جب میں نے انھیں دیکھا کہ وہ مجھے چپ کرا رہے ہیں ( تو مجھے عجیب لگا ) لیکن میں خاموش رہا ‘ جب رسو ل اللہ نماز سے فارغ ہوئے ‘ میرے ماں باپ آپ پرقربان !میں نے آپ سےپہلے اور آپکے بعدآپ سے بہتر کوئی معلم ( سکھانےوالا ) نہیں دیکھا!اللہ کی قسم !نہ تو آپنے مجھے ڈانٹا ‘ نہ مجھے مارا اور نہ مجھے برا بھلا کہا ۔ آپنے فرمایا : ’’یہ نماز ہے اس میں کسی قسم کی گفتگو روانہیں ہے ‘ یہ تو بس تسبیح و تکبیر اور قرآن کی تلاوت ہے ۔ ‘ ‘ یا جیسے رسو ل اللہ ﷺنے فرمایا ۔ میں نے عرض کی اے اللہ کے رسول اللہ !ابھی تھوڑا عرصہ پہلے جاہلیت میں تھا ‘ اور اللہ نے اسلام سے نوازدیا ہے ‘ ہم میں سے کچھ لوگ ہیں جو کاہنوں ( پیش گوئی کرنے والے ) کے پاس جاتے ہیں ۔ آپنے فرمایا : ’’تم ان کے پاس نہ جانا ۔ ‘ ‘ میں نے عرض کی : ہم میں سے کچھ لوگ ایسے ہیں جو بدشگونی لیتےہیں ۔ آپن فرمایا : ’’یہ ایسی بات ہے جو وہ اپنے دلوں میں پاتے ہیں ( ایک طرح کا وہم ہے ) یہ ( وہم ) انھیں ( ان کے ) کسی کام سے نہ روکے ۔ ‘ ‘ ( محمد ) ابن صباح نے روایت کی : ’’یہ تمہیں کسی صورت ( اپنے کاموں سے ) نہ رزکے ۔ ‘ ‘ میں نے عرض کی : ہم میں سے کچھ لوگ لکیریں کھینچھنے ہیں ۔ ‘ ‘ آپنے فرمایا : ’’سابقہ انبیاء میں سے ایک بنی لکیریں کھینچا کرتے تھے تو جس کی لکیریں ان کے موافق ہو جائیں وہ تو صحیح ہو سکتی ہیں ‘ ‘ ( لیکن اب اس کا جاننا مشکل ہے ۔ ) ( معاویہ بن حکم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : میری ایک لونڈی تھی جو احد اور جوانیہ کے اطراف میں میری بکریا چراتی تھی ‘ ایک دن میں اس طرف جاانکلاتو بھیڑیا اس کی بکری لے جا چکا تھا ۔ میں بھی بنی آدم میں سے ایک آدمی ہوں ‘ مجھے بھی اسی طرح افسوس ہوتا ہے جس طرح ان کو ہوتا ہے ( مجھے صبر کرناچاہیے تھا ) لیکن میں نے اسے زور سے ایک تھپڑجڑدیا اس کے بعد رسول اللہﷺکی خدمت میں حاضر ہو اآپنے میری اس حرکت کو میرے لیے بڑی ( غلط ) حرکت قرار دیا ۔ میں نے عرض کی : اے اللہ کے رسول !کیا میں اسے آزادنہ کردوں؟آپ نےفرمایا : ’’اسے میرےپاس لے آؤ ۔ ‘ ‘ میں اسے لےکر آپ کےپاس حاضر ہوا ، آپ نےاس سے پوچھا : ’’اللہ کہا ں ہے؟ ‘ ‘ اس نےکہا : آسمان میں ۔ آپ نےپوچھا : ’’میں کون ہوں؟ ‘ ‘ اس نےکہا : آپ اللہ کےرسول ہیں ۔ تو آپ نے فرمایا : ’’اسے آزاد کردو ، یہ مومنہ ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		}
	]
}