{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1258,
			"arabicnumber": "567.01",
			"text": "ہشام نےکہا : ہم سے قتادہ نے حدیث بیان کی ، انھوں نے سالم بن ابی جعد سے اور انھوں نے حضرت معد ان بن ابی طلحہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جمعے کے دن خطبہ دیا اور نبی اکرم ﷺ اور ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا تذکرہ کیا ، کہا : میں نے خواب دیکھا ہے ، جیسے ایک مرغ نے مجھے تین ٹھونگیں ماری ہیں اور اس کو میں اپنی موت قریب آنے کے سوا اور کچھ نہیں سمجھتا ۔ اور کچھ قبائل مجھ سے مطالبہ کر رہے ہیں کہ میں کسی کو اپنا جانشین بنادو ں ۔ بلا شبہ اللہ تعالیٰ اپنے دین کو ضائع نہیں ہونے دے گا ، نہ اپنی خلافت کو اور نہ اس شریعت کو جس کے ساتھ اس نے اپنے نبی ﷺ کو مبعوث فرمایا ۔ اگر مجھے جلد موت آجائے تو خلافت ان چھ حضرات کے باہیم مشورے سے طے ہو گی جن سے رسول اللہ ﷺ اپنی وفات کے وقت خوش تھے ۔ اور میں جانتا ہوں کہ کچھ لوگ جن کو میں نے اسلام کی خاطر اپنے اس ہاتھ سے مارا ہے ، وہ اس امر ( خلافت ) پر اعتراض کریں گے ، اگر وہ ایسا کریں گے تو وہ اللہ کے دشمن ، کافر اور گمراہ ہوں گے ، پھر میں اپنے بعد جو ( حل طلب ) چیزیں چھوڑ کر جارہا ر ہوں ان میں سے میرے نزدیک کلالہ کی وراثت کےمسئلے سے بڑھ کر کوئی مسئلہ زیادہ اہم نہیں ۔ میں نے رسول اللہ ﷺ سے کسی مسئلے کے بارے میں اتنی دفعہ رجوع نہیں کیا جتنی دفعہ کلالہ کے بارے میں کیا اور آپ نے ( بھی ) میرے ساتھ کسی مسئلے میں اس قدر سختی نہیں برتی جتنی میرے ساتھ آپ نے اس مسئلے میں سختی کی حتیٰ کہ آپ نے انگلی میرے سینے میں چبھو کر فرمایا : ’’اے عمر ! کیا گرمی کے موسم میں اترنے والی آیت تمھارے لیے کافی نہیں جو سورۃ نساء کے آخر میں ہے ؟ ‘ ‘ میں اگر زندہ رہا تو میں اس مسئلے ( کلالہ ) کے بارے میں ایسا فیصلہ کروں گا کہ ( ہر انسان ) جو قرآن پڑھتا ہے یا نہیں پڑھتا ہے اس کے مطابق فیصلہ کر سکے گا ، پھر آپ نے فرمایا : اے اللہ ! میں شہروں کے گورنرون کے بارے میں تجھے گواہ بناتا ہوں کہ میں نے لوگوں پر انھیں صرف اس لیے مقرر کر کے بھیجا کہ وہ ان سے انصاف کریں اور لوگوں کو ان کے دین اور ان کے نبی ﷺ کی سنت کی تعلیم دیں اور ان کے اموال فے ان میں تقسیم کریں اور اگر لوگوں کے معاملات میں انھیں کوئی مشکل پیش آئے تو اسے میرے سامنے پیش کریں ۔ پھر اے لوگو! تم دو پودے کھا تے ہو ، میں انھیں ( بو کے اعتبار سے ) برے پودے ہی سمجھتا ہوں ، یہ پیاز اور لہسن ہیں ۔ میں نے رسول اللہ ﷺ کو دیکھا ، جب مسجد میں آپ کو کسی آدمی سے ان کی بوآتی تو آپ اسے بقیع کی طرف نکال دینے کا حکم صادر فرماتے ، لہذا جو شخص انھیں کھانا چاہتا ہے وہ انھیں پکاکر ان کی بو مار دے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 96
			}
		}
	]
}