{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 147,
			"arabicnumber": "31",
			"text": "حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ہم رسول اللہ ﷺ کے چاروں طرف ایک جماعت ( کی صورت ) میں بیٹھے ہوئے تھے ۔ ہمارے ساتھ حضرت ابو بکر اور عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ بھی موجود تھے ۔ رسول اللہ ﷺ ہمارے درمیان سے اٹھے ( اور کسی طرف چلے گئے ) ، پھر آپ نے ہماری طرف ( واپسی میں ) بہت تاخیر کر دی تو ہم ڈر گئے کہ کہیں ہمارے بغیر آپ کو کوئی گزند نہ پہنچائی جائے ۔ اس پر ہم بہت گھبرائے اور ( آپ کی تلاش میں نکل ) کھڑے ہوئے ۔ سب سے پہلے میں ہی گھبرایا اور رسول اللہ ﷺ کو ڈھونڈ نے نکلا یہاں تک کہ میں انصار کے خاندان بنو نجاز کے چار دیواری ( فصیل ) سے گھرے ہوئے ایک باغ تک پہنچا اور میں نے اس کے ارد گرد چکر لگایا کہ کہیں پر دروازہ مل جائے لیکن مجھے نہ ملا ۔ اچانک پانی کی ایک گزر گاہ دکھائی دی جو باہر کے کنوئیں سے باغ کے اندر جاتی تھی ( ربیع آب پاشی کی چھوٹی سی نہر کو کہتے ہیں ) میں لومڑی کی طرح سمٹ کر داخل ہوا اور رسول اللہ ﷺ کے پاس پہنچ گیا ۔ آپ نے پوچھا : ’’ ابو ہریرہ ہو ؟ ‘ ‘ میں نے عرض کی : جی ہاں ، اے اللہ کے رسول ! آپ نے فرمایا : ’’تمہیں کیا معاملہ درپیش ہے ؟ ‘ ‘ میں نے عرض کی : آپ ہمارے درمیان تشریف فرماتھے ، پھر وہاں سے اٹھ گئے ، پھر آپ نے ہماری طرف ( واپس ) آنے میں دیر کر دی تو ہمیں خطرہ لاحق ہوا کہ آپ ہم سے کاٹ نہ دیے جائیں ۔ اس پر ہم گھبرا گئے ، سب سے پہلے میں گھبرا کر نکلا تو اس باغ تک پہنچا اور اس طرح سمٹ کر ( اندر گھس ) آیا ہوں جس طرح لومڑی سمٹ کر گھستی ہے اور یہ دوسرے لوگ میرے پیچھے ( آرہے ) ہیں ۔ تب آپﷺ نے فرمایا : ’’اے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ! ‘ ‘ او رمجھے اپنے نعلین ( جوتے ) عطا کیے اور ارشاد فرمایا : ’’میرے یہ جوتے لے جاؤ اور اس چار دیواری کی دوسری طرف تمہیں جو بھی ایسا آدمی ملے جو دل کے پورے یقین کے ساتھ لا اله الاالله کی شہادت دیتا ہو ، اسے جنت کی خوش خبری سنا دو ۔ ‘ ‘ سب سے پہلے میری ملاقات عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ہوئی ، انہوں نے نے کہا : ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ! ( تمہاری ہاتھ میں ) یہ جوتے کیسے ہیں ؟ میں نے کہا : یہ رسول اللہ ﷺ کے نعلین ( مبارک ) ہیں ۔ آپ نے مجھے یہ نعلین ( جوتے ) دے کر بھیجا ہے کہ جس کسی کو ملوں جو دل کے یقین کے ساتھ لا اله الاالله کی شہادت دیتا ہو ، اسے جنت کی بشارت دے دوں ۔ عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےمیرے سینے پر اپنے ہاتھ سے ایک ضرب لگائی جس سے میں اپنی سرینوں کے بل گر پڑا اور انہوں نے کہا : اے ابو ہریرہ! پیچھے لوٹو ۔ میں رسول اللہ ﷺ کے پاس اس عالم میں واپس آیا کہ مجھے رونا آرہا تھا اور عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ میرے پیچھے لگ کر چلتے آئے تو اچانک میرے عقب سے نمودار ہو گئے ۔ رسول اللہ ﷺ نے ( مجھ سے ) کہا : ’’ اے ابوہریرہ !تمہیں کیا ہوا ؟ میں نے عرض کی : میں نے عرض : میں عمر سے ملا اور آپ نے مجھے جو پیغام دے کر بھیجا تھا ، میں نے انہیں بتایا تو انہوں نے میرے سینے پر ایک ضرب لگائی ہے جس سے میں اپنی سرینوں کے بل گر پڑا ، اور مجھ سے کہا کہ پیچھے لوٹو ۔ رسول اللہ ﷺ نے فرمایا : ’’ عمر! تم نے جو کیا اس کا سبب کیا ہے ؟ ‘ ‘ انہوں نے عرض کی : اللہ کے رسول! آپ پر میرے ماں باپ قربان ہوں ! کیا آپ نے ابوہریرہ کو اس لیے نعلین دے کر بھیجا تھا کہ دل کے یقین کے ساتھ لا اله الااللهکی شہادت دینے والے جس کسی کو ملے ، اسے جنت کی بشارت دے ؟ آپﷺ نے فرمایا : ’’ہاں ۔ ‘ ‘ عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے عرض کی : تو ایسا نہ کیجیے ، مجھے ڈر ہے کہ لوگ بس اسی ( شہادت ) پر بھروسا کر بیٹھیں گے ، انہیں چھوڑ دیں کہ وہ عمل کرتے رہیں ، رسول اللہ ﷺ نے فرمایا : ’’اچھا تو ان کو چھوڑ دو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 54
			}
		}
	]
}