{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1739,
			"arabicnumber": "746.01",
			"text": "ابن ابی عدی نے سعید ( ابن ابی عروبہ ) سے ، انھوں نے قتادہ سے اور انھوں نے زرارہ سے روایت کی کہ ( حضرت انس رضی اللہ تعالیٰ عنہ کے قریبی عزیز ) سعد بن ہشام بن عامر نے ارادہ کیا کہ اللہ تعالیٰ کی راہ میں جنگ ( جہاد ) کریں ، وہ مدینہ منورہ آگئے اور وہاں ا پنی ایک جائیداد فروخت کرنی چاہی تاکہ اس سے ہتھیار اور گھوڑے مہیا کریں اور موت آنے تک رومیوں کے خلاف جہاد کریں ، چنانچہ جب مدینہ آئے تو اہل مدینہ میں سے کچھ لوگوں سے ملے ، انھوں نے اس کو اس ارادے سے روکا اور ان کو بتایا کہ چھ افراد کے ایک گروہ نے نبی اکرم صلی اللہ علیہ وسلم کی حیات مبارکہ میں ایسا کرنے کاارادہ کیاتھا تو نبی اکرم صلی اللہ علیہ وسلم نے انہیں روک دیا تھا ۔ آپ نے فرمایا تھا : \"\" کیا میرے طرز عمل میں تمھارے لئے نمونہ نہیں ہیں؟ \"\" چنانچہ جب ان لوگوں نے انھیں یہ بات بتائی تو انھوں نے اپنی بیوی سے رجوع کرلیا جبکہ وہ اسے طلاق دے چکے تھے ، اور اس سے رجو ع کے لئے گواہ بنائے ۔ پھر حضرت ابن عباس رضی اللہ تعالیٰ عنہ کی خدمت میں حاضر ہوکر ان سے رسول اللہ صلی اللہ علیہ وسلم کے وتر ( بشمول قیام اللیل ) کے بارے میں سوال کیا تو حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : کیا میں تمھیں اس ہستی سے آگاہ نہ کروں ۔ جو روئے زمین کے تمام لوگوں کی نسبت ر سول اللہ صلی اللہ علیہ وسلم کے وتر کو زیادہ جاننے والی ہے؟سعد نے کہا : وہ کون ہیں؟انھوں نےکہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا ان کے پاس جاؤ اور پوچھو ، پھر ( دوبارہ ) میرے پاس آنا اور ان کا جواب مجھے بھی آکر بتانا ، ( سعدنے کہا : ) میں ان کی طرف چل پڑا اور ( پہلے ) حکیم بن افلح کے پاس آیا اور انھیں اپنے ساتھ حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس چلنے کو کہا تو انھوں نے کہا : میں ان کے پاس نہیں جاؤں گا کیونکہ میں نے انھیں ( آپس میں لڑنے والی ) ان دو جماعتوں کے بارے میں کچھ بھی کہنے سے روکا تھا ۔ تو وہ ان دونوں کے بارے میں اسی طریقے پر چلتے رہنے کے سوا اور کچھ نہ مانیں ۔ ( سعد نے ) کہا : تو میں نے انھیں قسم دی تو وہ آگئے ، پس ہم حضرت عائشہ رضی اللہ تعالیٰ عنہا کی طرف چل پڑے ، اور ان سے حاضری کی اجازت طلب کی ، انھوں نے اجازت مرحمت فرمادی اور ہم ان کے گھر ( دروازے ) میں داخل ہوئے ، انھوں نے کہا : کیا حکیم ہو؟انہوں نے اسے پہچان لیا ، اس نے کہا : جی ہاں ۔ تو انھوں نے کہا : تمہارے ساتھ کون ہے؟اس نے کہا : سعد بن ہشام ۔ انھوں نے پوچھا : ہشام کون؟ اس نے کہا : عامر رضی اللہ تعالیٰ عنہ ( بن امیہ انصاری ) کے بیتے ۔ تو انہوں نے ان کے لئے رحمت کی دعا کی اور کلمات خیر کہے ۔ قتادہ نے کہا : وہ ( عامر رضی اللہ تعالیٰ عنہ ) غزوہ احد میں شہید ہوگئے تھے ۔ میں نے کہا : ام المومنین! مجھے رسول اللہ صلی اللہ علیہ وسلم کے خلق مبارک کے بارے میں بتایئے ۔ انھوں نے کہا : کیاتم قرآن نہیں پڑھتے؟میں نے عرض کی : کیوں نہیں !انھوں نے کہا : اللہ کے نبی صلی اللہ علیہ وسلم کا اخلاق قرآن ہی تھا ( آپ کی سیرت وکردار قرآن کا عملی نمونہ تھی ) کہا : اس پر میں نے یہ چاہا کہ اٹھ ( کر چلا ) جاؤں اور موت تک کسی سے کچھ نہ پوچھوں ، پھر اچانک زہن میں آیا تو میں نے کہامجھے رسول اللہ صلی اللہ علیہ وسلم کے ( رات کے ) قیام کے بارے میں بتائیں ، تو انھوں نے کہا : کیا تم ( يَا أَيُّهَا الْمُزَّمِّلُ ) نہیں پڑ ھتے؟ میں نے عرض کی کیوں نہیں!انھوں نے کہا : اللہ تعالیٰ نے اس سورت کے آغاز میں رات کا قیام فرض قرار دیا تو نبی کریم صلی اللہ علیہ وسلم اور آپ کے ساتھیوں نے سال بھر قیام کیا اور اللہ تعالیٰ نے اس سورت کی آخری آیات بارہ ماہ تک آسمان پر روکے رکھیں یہاں تک کہ اللہ تعالیٰ نے اس سورت کے آخر میں تخفیف کا حکم نازل فرمایاتو رات کا قیام فرض ہونے کے بعد نفل ( میں تبدیل ) ہوگیا ۔ سعد نے کہا : میں نے عرض کی : اے ام المومنین ! مجھے رسول اللہ صلی اللہ علیہ وسلم کے وتر کے بارے میں بتایئے ۔ تو انھوں نے کہا : ہم آپ صلی اللہ علیہ وسلم کے لئے آپ کی مسواک اور آپ کے وضو کا پانی تیار کرکے رکھتے تھے اللہ تعالیٰ رات کو جب چاہتا ، آپ کو بیدار کردیتا تو آپ مسواک کرتے ، وضو کرتے اور پھر نو رکعتیں پڑھتے ، ان میں آپ آٹھویں کے علاوہ کسی رکعت میں نہ بیٹھتے ، پھر اللہ کا ذکر کرتے ، اس کی حمد بیان کرتے اور دعا فرماتے ، پھر سلام پھیرے بغیر کھڑے ہوجاتے ، پھر کھڑے ہوکرنویں رکعت پڑھتے ، پھر بیٹھتے اللہ کا ذکر اور حمد کرتے اور اس سے دعا کرتے ، پھر سلام پھیرتے جو ہمیں سناتے جو ہمیں سناتے پھر سلام ے بعد بیٹھ کر دو رکعتیں پڑھتے ، تو میرے بیٹے! یہ گیارہ رکعتیں ہوگئیں ۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم کی عمر مبارک بڑھی اور ( جسم پر کسی حد تک ) گوشت چڑھ گیا ( جسم مبارک بھاری ہوگیا ) تو آپ سات وتر پڑھنے لگ گئے اور دو رکعتوں میں وہی کرتے جو پہلے کرتے تھے ( بیٹھ کر پڑھتے ) تو بیٹا!یہ نو رکعتیں ہوگئیں اور اللہ کے نبی صلی اللہ علیہ وسلم جب کوئی نماز پڑھتے تو آپ پسند کرتے کہ اس پرقائم رہیں اور جب نیند یا بیماری غالب آجاتی اور رات کا قیام نہ کرسکتے تو آپ دن کو بارہ رکعتیں پڑھ لیتے ۔ میں نہیں جانتی کہ اللہ کے نبی کریم صلی اللہ علیہ وسلم نے بھی پورا قرآن ایک رات میں پڑھا ہو اور نہ ہی آپ نے کسی رات صبح تک نماز پڑھی اور نہ رمضان کے سوا کبھی پورے مہینے کے روزے رکھے ۔ ( سعد نے ) کہا : پھر میں ابن عباس رضی اللہ تعالیٰ عنہ کی طرف گیا اور انھیں ان ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) کی حدیث سنائی تو انھوں نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے سچ کہا ، اگر میں ان کے قریب ہوتا یا ان کے گھر جاتا ہوتا تو ان کے پاس جاتا تاکہ وہ مجھے یہ حدیث رو برو سناتیں ۔ ( سعد نے ) کہا : میں نےکہا : اگر مجھے علم ہوتا ہے کہ آپ ان کے ہاں حاضر نہیں ہوتے تو میں آپ کو ان کی حدیث نہ سناتا ( یہ سعد بالآخر سرزمین ہند میں شہید ہوئے)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 168
			}
		}
	]
}