{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1930,
			"arabicnumber": "832",
			"text": "ابو عمار شداد بن عبداللہ اور یحییٰ بن ابی کثیر نے ابو امامہ سے روایت کی ۔ ۔ ۔ عکرمہ نے کہا : شداد ابو امامہ اور واثلہ رضی اللہ تعالیٰ عنہ سے مل چکا ہے ، وہ شام کے سفر میں حضرت انس رضی اللہ تعالیٰ عنہ کے ساتھ رہااور ان کی فضیلت اور خوبی کی تعریف کی ۔ حضرت ابو امامہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : عمرو بن عبسہ سلمی رضی اللہ تعالیٰ عنہ نےکہا : میں جب اپنے جاہلیت کے دور میں تھا تو ( یہ بات ) سمجھتا تھا کہ لوگ گمراہ ہیں اور جب وہ بتوں کی عبادت کرتے ہیں تو کسی ( سچی ) چیز ( دین ) پر نہیں ، پھر میں نے مکہ کے ایک آدمی کے بارے میں سنا کہ وہ بہت سی باتوں کی خبر دیتا ہے ، میں اپنی سواری پر بیٹھا اور ان کے پاس آگیا ، اس زمانے میں رسول اللہ صلی اللہ علیہ وسلم چھپے ہوئے تھے ، آپ کی قوم ( کے لوگ ) آپ کے خلاف دلیر ، اور جری تھے ۔ میں ایک لطیف تدبیر اختیار کرکے مکہ میں آپ کی خدمت میں حاضر ہوااور آپ سے پوچھا آپ کیا ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں نبی ہوں ۔ \" پھر میں نے پوچھا : \" نبی کیا ہوتا ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے اللہ نے بھیجا ہے ۔ \" میں نے کہا : آپ کو کیا ( پیغام ) دے کر بھیجا ہے؟آپ نے فرمایا : \" اللہ تعالیٰ مجھے صلہ رحمی ، بتوں کو توڑنے ، اللہ تعالیٰ کو ایک قرار دینے ، اور اس کے ساتھ کسی چیز کو شریک نہ ٹھہرانے ( کاپیغام ) دے کر بھیجا ہے ۔ \" میں نے آپ سے پوچھا : آپ کے ساتھ اس ( دین ) پر اور کون ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ایک آزاد اور ایک غلام ۔ \" ۔ ۔ ۔ کہا : آپ صلی اللہ علیہ وسلم کے ساتھ اس وقت ایمان لانے والوں میں سے ابو بکر اور بلال رضوان اللہ عنھم اجمعین تھے ۔ میں نے کہا : میں بھی آپ کا متبع ہوں ۔ فرمایا : \" تم اپنے آج کل کے حالات میں ایسا کرنے کی استطاعت نہیں رکھتے ۔ کیا تم میرا اور لوگوں کا حال نہیں دیکھتے؟لیکن ( ان حالات میں ) تم اپنے گھر کی طرف لوٹ جاؤ اور جب میرے بارے میں سنو کہ میں غالب آگیا ہوں تو میرے پاس آجانا ۔ \" کہا : تو میں اپنے گھر والوں کے پاس لوٹ گیا ۔ او ( بعد ازاں ) رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لے گئے میں اپنے گھر ہی میں تھا ، جب آپ صلی اللہ علیہ وسلم مدینہ تشریف لائے ۔ تو میں بھی خبریں لینے اور لوگوں سے آپ کے حالات پوچھنے میں لگ گیا ۔ حتیٰ کہ میرے پاس اہل یثرب ( مدینہ والوں ) میں سے کچھ لوگ آئے تو میں نے پوچھا : یہ شخص جو مدینہ میں آیا ہے اس نے کیا کچھ کیا ہے؟انھوں نے کہا : لوگ تیزی سے ان ( کے دین ) کی طرف بڑھ رہے ہیں ، آپ کی قوم نے آپ کو قتل کرنا چاہا تھا لیکن وہ ایسا نہ کرسکے ۔ اس پر میں مدینہ آیا اور آپ کی خدمت میں حاضر ہوا اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! کیا آپ مجھے پہچانتے ہیں؟آپ نے فرمایا : \" ہاں تم وہی ہو ناں جو مجھ سے مکہ میں ملے تھے؟ \" کہا : تو میں نے عرض کی : جی ہاں ، اور پھر پوچھا : اے اللہ کے نبی! مجھے وہ ( سب ) بتایئے جو اللہ نے آپ کوسکھایا ہے اور میں اس سے ناواقف ہوں ، مجھے نماز کے بارے میں بتایئے ۔ آپ نے فرمایا : \" صبح کی نماز پڑھو اور پھر نمازسے رک جاؤ حتیٰ کہ سورج نکل کر بلند ہوجائے کیونکہ وہ جب طلوع ہوتا ہے تو شیطان ( اپنے سینگوں کو آگے کرکے یوں دیکھاتا ہے جیسے وہ اُس ) کے دو سینگوں کےدرمیان طلوع ہوتا ہے اور اس وقت کافر اس ( سورج ) کو سجدہ کرتے ہیں ، اس کے بعد نماز پڑھو کیونکہ نماز کا مشاہدہ ہوتاہے اور اس میں ( فرشتے ) حاضر ہوتے ہیں یہاں تک کہ جب نیزے کا سایہ اس کے ساتھ لگ جائے ( سورج بالکل سر پر آجائے ) تو پھر نماز سے رک جاؤ کیونکہ اس وقت جہنم کو ایندھن سے بھر کو بھڑکایاجاتا ہے ، پھر جب سایہ آئے جائے ( سورج ڈھل جائے ) تو نمازپڑھو کیونکہ نماز کا مشاہدہ کیاجاتا ہے اور اس میں حاضری دی جاتی ہے حتیٰ کہ تم عصر سے فارغ ہوجاؤ ، پھر نماز سے رک جاؤ یہاں تک کہ سورج ( پوری طرح ) غروب ہوجائے کیونکہ وہ شیطان کے دو سینگوں میں غروب ہوتا ہے اور اس وقت کافر اس کے سامنے سجدہ کرتے ہیں ۔ \" کہا : پھر میں نے پوچھا : اے اللہ کے نبی صلی اللہ علیہ وسلم ! تو وضو؟مجھے اس کے بارے میں بھی بتایئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے جوشخص بھی وضو کے لئے پانی اپنے قریب کرتاہے ۔ پھر کلی کرتاہے اور ناک میں پانی کھینچ کر اسے جھاڑتاہے تو اس سے اس کے چہرے ، منہ ، اور ناک کے نتھنوں کے گناہ جھڑ جاتے ہیں ، پھر جب وہ اللہ کے حکم کےمطابق اپنے چہرے کو دھوتا ہے تو لازماً اس کے چہرے کےگناہ بھی پانی کے ساتھ اس کی داڑھی کے کناروں سے گر جاتے ہیں ، پھر وہ اپنے دونوں ہاتھوں کو کہنیوں ( کے اوپر ) تک دھوتا ہے ۔ تو لازماً اس کے ہاتھوں کےگناہ پانی کے ساتھ اس کے پوروں سے گرجاتے ہیں ، پھر وہ سر کا مسح کرتاہے تو اس کے سر کے گناہ پانی کے ساتھ اس کے بالوں کے اطراف سے زائل ہوجاتے ہیں ، پھر وہ ٹخنوں ( کے اوپر ) تک اپنے دونوں قدم دھوتا ہے ۔ تو اس کے دونوں پاؤں کے گناہ پانی کے ساتھ اس کے پوروں سے گر جاتے ہیں ، پھر اگر وہ کھڑا ہوانماز پڑھی اور اللہ کے شایان شان اس کی حمد وثنا اور بزرگی بیان کی اور اپنا دل اللہ کے لئے ( ہر قسم کے دوسرے خیالات وتصورات سے ) خالی کرلیا تو وہ اپنے گناہوں سے اس طرح نکلتا ہے جس طرح اس وقت تھا جس دن اس کی ماں نے اسے ( ہر قسم کے گناہوں سے پاک ) جنا تھا ۔ \" حضرت عمرو بن عبسہ رضی اللہ تعالیٰ عنہ نے یہ حدیث رسول اللہ صلی اللہ علیہ وسلم کے ( ایک اور ) صحابی حضرت ابو امامہ رضی اللہ تعالیٰ عنہ کو سنائی تو ابو امامہ رضی اللہ تعالیٰ عنہ نے ان سے کہا : اے عمرو بن عبسہ رضی اللہ تعالیٰ عنہ !دیکھ لوتم کیا کہہ رہے ہو ۔ ایک ہی جگہ اس آدمی کو اتناکچھ عطا کردیا جاتا ہے! اس پر عمرو رضی اللہ تعالیٰ عنہ نے کہا : اے ابو امامہ رضی اللہ تعالیٰ عنہ !میری عمر بڑھ گئی ہے میری ہڈیاں نرم ہوگئیں ہیں اور میری موت کا وقت بھی قریب آچکا ہے اور مجھے کوئی ضرورت نہیں کہ اللہ پر جھوٹ بولوں ۔ اور اس کے رسول صلی اللہ علیہ وسلم پر جھوٹ بولوں ۔ اگر میں نے اس حدیث کو رسول اللہ صلی اللہ علیہ وسلم سے ایک ، دو ، تین ۔ ۔ ۔ حتیٰ کہ انھوں نے سات بار شمار کیا ۔ ۔ ۔ بار نہ سنا ہوتا تو میں اس حدیث کو کبھی بیان نہ کرتا بلکہ میں نے تو اسے آپ صلی اللہ علیہ وسلم سے اس سے بھی زیادہ بارسنا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 358
			}
		}
	]
}