{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1933,
			"arabicnumber": "834",
			"text": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام کریب سے روایت ہے کہ عبداللہ بن عباس رضی اللہ تعالیٰ عنہ ، عبدالرحمان بن ازہر ، مسور بن مخرمہ رضی اللہ تعالیٰ عنہ انھیں نبی اکرم صلی اللہ علیہ وسلم کی زوجہ حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس بھیجا اور کہا کہ ہم سب کی طرف سے انھیں سلام عرض کرنا اور ان سے عصر کے بعد کی دو رکعت کے بارے میں پوچھنا اور کہنا کہ ہمیں خبر ملی ہے کہ آ پ یہ ( دو رکعتیں ) پڑھتی ہیں ۔ جبکہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے ہم تک یہ خبر پہنچی ہے کہ آپ صلی اللہ علیہ وسلم نے ان سے روکا ہے ۔ ابن عباس رضی اللہ تعالیٰ عنہ نے کہا کہ میں تو حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کے ساتھ مل کر لوگوں کو ان سے روکا کرتا تھا ۔ کریب نے کہا : میں حضرت عائشہ رضی اللہ تعالیٰ عنہا کی خدمت میں حاضر ہوا اور ان حضرات نے جو پیغام د ے کر مجھے بھیجا تھا میں نے ان تک پہنچایا ۔ انھوں نے جواب دیا ام سلمہ رضی اللہ تعالیٰ عنہا سے پوچھو ۔ میں نکل کر ان حضرات کے پاس لوٹا اور انھیں ان کے جواب سے آگاہ کیا ۔ ان حضرات نے مجھے وہی پیغام دے کر حضرت اسلمہ رضی اللہ تعالیٰ عنہا کی طرف بھیج دیا جس طرح حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس بھیجاتھا ، اس پر ام سلمہ رضی اللہ تعالیٰ عنہا نے جواب دیا ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا کہ آپ ان دو رکعتوں سے روکتے تھے ، پھر میں نے آپ صلی اللہ علیہ وسلم کو یہ دو رکعتیں پڑھتے ہوئے دیکھا ، ہاں ، آپ نے جب یہ دو رکعتیں پڑھیں تھیں اس وقت آپ عصر کی نماز پڑھ چکے تھے ، پھر ( عصر پڑھ کر ) آپ ( میرے گھر میں ) داخل ہوئے جبکہ میرے پاس انصار کے قبیلے بنو حرام کے قبیلے کی کچھ عورتیں موجودتھیں ، آ پ نے یہ دو رکعتیں ادا ( کرنی شروع ) کیں تو میں نے آپ کے پاس خادمہ بھیجی اور ( اس سے ) کہا : آپ صلی اللہ علیہ وسلم کی ایک جانب جا کر کھڑی ہوجاؤ اور آپ صلی اللہ علیہ وسلم سے عرض کرو کہ اے اللہ کے رسول صلی اللہ علیہ وسلم !ام سلمہ رضی اللہ تعالیٰ عنہا کہتی ہیں : میں آپ سے سنتی رہی ہوں کہ آپ ( عصر کے بعد ) ان دو رکعتوں سے منع فرماتے تھے اور اب میں آپ کو پڑھتے ہوئےدیکھ رہی ہوں؟اگر آپ صلی اللہ علیہ وسلم ہاتھ سے اشارہ فرمائیں تو پیچھے ہٹ ( کرکھڑی ہو ) جانا ۔ اس لڑکی نے ایسے ہی کیا ، آپ نے ہاتھ سے اشارہ فرمایا ، وہ آپ سے پیچھے ہٹ ( کر کھڑی ہو ) گئی ، جب آپ صلی اللہ علیہ وسلم نے سلام پھیراتو فرمایا : \" اے ابو امیہ ( حذیفہ بن مغیرہ مخزومی ) کی بیٹی!تم نے عصر کے بعد کی دورکعتوں کے بارے میں پوچھا ہے ، تو ( معاملہ یہ ہے کہ ) بنو عبدالقیس کے کچھ افراد اپنی قوم کے اسلام ( لانے کی اطلاع ) کے ساتھ میرے پاس آئے ، اور انھوں نے مجھے ظہر کی بعد کی دورکعتوں سے مشغول کردیا ، یہ وہی دو رکعتیں ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 361
			}
		}
	]
}