{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2149,
			"text": "ایوب نے عبد اللہ بن ابی ملیکہ سے روا یت کی ، انھوں نے کہا : میں حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے پہلو میں بیٹھا ہوا تھا ۔ ہم حضرت عثمان رضی اللہ تعالیٰ عنہ کی صاحبزادی ام ابان کے جنازے کا انتظار کر رہے تھے جبکہ عمرو بن عثمان بھی ان کے پا س تھے اتنے میں حضرت ابن عباس رضی اللہ تعالیٰ عنہ آئے انھیں لے کر آنے والا ایک آدمی لا یا میرے خیال میں اس نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ کو حضرت ابن عمر رضی اللہ تعالیٰ عنہ کی بیٹھنے کی جگہ کے بارے میں بتا یا تو وہ آکر میرے پہلو میں بیٹھ گئے میں ان دو نوں کے در میان میں تھا اچانک گھر ( کے اندر ) سے ( رونے کی ) آواز آئی تو ابن عمر رضی اللہ تعالیٰ عنہ نے ۔ ۔ ۔ اور ایسا لگتا تھا وہ عمرو ( بن عثمان ) کو اشارہ کر رہے ہیں کہ وہ انھیں اور ان کو روکیں ۔ ۔ ۔ کہا میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ہے بلا شبہ میت کو اس کے گھر والوں کے رو نے سے عذاب دیا جا تا ہے : \" ( عبد اللہ بن ابی ملیکہ نے ) کہا : حضرت عبد اللہ رضی اللہ تعالیٰ عنہ نے اس کو بلا شرط و قید ( یعنی ہر طرح کے رو نے کے حوالے سے ) بیان کیا ۔ اس پر حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : ہم امیر المو منین حضرت عمربن خطا ب رضی اللہ تعالیٰ عنہ کے ساتھ تھے حتیٰ کہ جب ہم بیداء کے مقام پر پہنچے تو انھوں نے ایک آدمی کو درخت کے سائے میں پڑا ؤڈالے دیکھا انھوں نے مجھ سے کہا : جا ؤ اور میرے لیے پتہ کرو کہ وہ کو ن آدمی ہے میں گیا تو دیکھا وہ صہیب رضی اللہ تعالیٰ عنہ تھے میں ان کے پاس واپس آیا اور کہا : آپ نے مجھے حکم دیا تھا کہ میں آپ کے لیے پتہ کروں کہ وہ کو ن شخص ہیں تو وہ صہیب رضی اللہ تعالیٰ عنہ ہیں انھوں نے کہا : ( جاؤ اور ) ان کو حکم ( پہنچا ) دو کہ وہ ہمارے ساتھ ( قافلے میں ) آجا ئیں ۔ میں نے کہا : ان کے ساتھ ان کے گھر والے ہیں انھوں نے کہا : چاہے ان کے ساتھ ان کے گھر والے ( بھی ) ہیں شامل ہو جا ئیں ) بسا اوقات ایوب نے ( بس یہاں تک کہا ) ان سے کہو کہ وہ ہمارے ساتھ ( قافلے میں ) شامل ہو جائیں ۔ ۔ ۔ جب ہم مدینہ پہنچے تو زیادہ وقت نہ گزرا تھا کہ امیر المو منین زخمی کردیے گئے صہیب رضی اللہ تعالیٰ عنہ یہ کہتے ہو ئے آئے ہائے میرا بھائی !ہائے میرا ساتھی!تو عمر رضی اللہ تعالیٰ عنہ نے کہا کیا تمھیں معلوم نہیں یا ( کہا : تم نے سنا نہیں ۔ ۔ ۔ ایوب نے کہا : یا انھوں نے ( اس کے بجا ئے ( او لم تعلم ...اولم تسمع کیا تمھیں پتہ نہیں اور تم نے سنا نہیں \" کے الفاظ کہے ۔ ۔ ۔ کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میت کو اس کے گھر والوں کے بعض ( طرح کے ) رونے سے عذاب دیا جاتا ہے ( ابن ابی ملیکہ نے ) کہا : حضرت عبداللہ رضی اللہ تعالیٰ عنہ نے اس ( رونے کے لفظ ) کو بلا قید بیان کیا جبکہ حضرت عمر رضی اللہ تعالیٰ عنہ نے ( لفظ ) بعض ( کی قید ) کے ساتھ کہاتھا ۔ میں ( ابن ابی ملکہ ) اٹھ کر حضرت عائشہ رضی اللہ تعالیٰ عنہا کی خدمت میں حاضر ہوا اور حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے جو کہا تھا ان کو بتا یا انھوں نے کہا نہیں اللہ کی قسم !رسول اللہ صلی اللہ علیہ وسلم نے یہ کبھی نہیں فر ما یا کہ میت کو کسی ایک کے رونے کی وجہ سے عذاب دیا جا تا ہے بلکہ آپ نے فر ما یا ہے : \" اللہ تعا لیٰ کا فر کے عذاب میں اس کے گھر والوں کے رو نے کی وجہ سے اضافہ کر دیتا ہے ( کیونکہ کا فروں نے اپنی اولاد کو بلند آواز سے رونا سکھایا ہوتا ہے رہا بغیر آواز کے رونا تو اس کی ذمہ داری رونے والے پر نہیں کیونکہ ) بے شک اللہ ہی ہے جس نے ہنسایا اور رلایا ۔ \" اور بو جھ اٹھا نے والی کو ئی جان کسی دوسری کا بو جھ نہیں اٹھا ئے گی ۔ ( آواز کے بغیر محض آنسوؤں سے رونے کا نہ رونے والے کو گنا ہ ہے نہ اس کے بڑوں کو کیونکہ وہ بھی اس کے ذمہ دار نہیں ۔ ) ایوب نے کہا : ابن ابی ملیکہ نے کہاں مجھ سے قاسم بن محمد نے بیان کیا انھوں نے کہا : جب حضرت عائشہ رضی اللہ تعالیٰ عنہا کو حضرت عمر اور ابن عمر رضی اللہ تعالیٰ عنہ کی یہ بات پہنچی تو انھوں نے کہا : تم مجھے ایسے دو افراد کی حدیث بیان کرتے ہو جو نہ ( خود جھوٹ بولنے والے ہیں اور نہ جھٹلائے جا نے والے ہیں لیکن ( بعض اوقات ) سماع ( سننا ) غلط ہو جا تا ہے ( کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ایک اور سیاق میں یہ با ت کی تھی دیکھیے حدیث نمبر2153 ۔ 2156 ) ۔ ۔",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}