{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2150,
			"text": "(ابن جریج نے کہا : مجھے عبد اللہ بن ابی ملیکہ نے خبر دی انھوں نے کہا : حضرت عثمان بن عفان رضی اللہ تعالیٰ عنہ کی صاحبزادی مکہ میں فو ت ہو گئی توہم ان کے جنا زے میں شرکت کے لیے آئے حضرت ابن عمر اور حضرت ابن عبا س رضی اللہ تعالیٰ عنہ بھی تشریف لا ئے ۔ میں ان دو نوں کے درمیان میں بیٹھا تھا میں ان میں سے ایک کے پاس بیٹھا تھا پھر دوسرا آکر میرے پہلو میں بیٹھ گیا حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے عمرو بن عثمان سے اور وہ ان کے رو برو بیٹھے ہو ئے تھے کہا : تم رو نے سے رو کتے کیوں نہیں ؟بے شک رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا تھا \" میت کو اس کے گھروالوں کے اس پررونے سے عذاب دیا جا تا ہے ۔ اس پر ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : حضرت عمر رضی اللہ تعالیٰ عنہ اس کے بعض طرح کے رونے سے ) کہا کرتے تھے پھر انھوں نے ( مکمل ) حدیث بیان کی کہا : میں عمر رضی اللہ تعالیٰ عنہ کے ساتھ مکہ سے لو ٹا حتیٰ کہ جب ہم مقام بیداء پر پہنچے تو اچانک انھیں درخت کے سائے تلے کچھ اونٹ سوار دکھا ئی دیے انھوں نے کہا : جا کر دیکھو یہ اونٹ سوار کو ن ہیں ؟ میں نے دیکھا تو وہ صہیب رضی اللہ تعالیٰ عنہ تھے میں نے ( آکر ) انھیں بتا یا تو انھوں نے کہا : انھیں میرے پاس بلا ؤ ۔ میں لو ٹ کر صہیب رضی اللہ تعالیٰ عنہ کے پاس گیا ۔ میں نے کہا : چلیے امیر المومنین کے ساتھ ہو جائیے اس کے بعد جب حضرت عمر رضی اللہ تعالیٰ عنہ زخمی کر دیے گئے تو صہیب رضی اللہ تعالیٰ عنہ روتے ہو ئے اندر آئے کہہ رہے تھے ہائے میرا بھا ئی ! ہا ئے میرا ساتھی !تو حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا صہیب ! کیا تم مجھ پر رو رہے ہو؟حالانکہ رسول اللہ صلی اللہ علیہ وسلم نے فر مایا ہے : \" میت کو اس کے گھر والوں کے بعض ( طرح کے ) رونے سے عذاب دیا جا تا ہے ۔ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : جب حضرت عمر رضی اللہ تعالیٰ عنہ وفات پا گئے تو میں نے یہ بات حضرت عائشہ رضی اللہ تعالیٰ عنہا سے بیان کی انھوں نے کہا : اللہ عمر پر رحم فر ما ئے !اللہ کی قسم !نہیں رسول اللہ صلی اللہ علیہ وسلم نے یہ نہیں فر ما یا کہ اللہ تعا لیٰ مومن کو کسی کے رونے کی وجہ سے عذاب دیتا ہے بلکہ آپ نے فر ما یا : \" اللہ تعا لیٰ کا فرکے عذاب کو اس کے گھر والوں کے اس پر رونے کی وجہ سے بڑھا دیتا ہے ۔ \" کہا اور حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : اور تمھا رے لیے قرآن کا فی ہے ( جس میں یہ ہے ) اور بو جھ اٹھا نے والی کو ئی جا ن کسی دوسری جا ن کا بوجھ نہیں اٹھا ئے گی ۔ اسکے ساتھ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا اور اللہ ہی ہنساتا ہے اور رلا تا ہے ۔ ابن ابی ملیکہ نے نے کہا : اللہ کی قسم !حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے ( جواب میں ) کچھ نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}