{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2290,
			"arabicnumber": "987.01",
			"text": "حفص بن میسرہ صنعانی نے زید بن اسلم سے حدیث بیان کی کہ ان کو ابو صالح ذکوان نے خبر دی کہ انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : جو بھی سونے اور چاندی کا مالک ان میں سے ( یا ان کی قیمت میں سے ) ان کا حق ( زکاۃ ) ادا نہیں کرتا تو جب قیامت کا دن ہوگا ( انھیں ) اس کے لئے آگ کی تختیاں بنا دیا جائے گا اور انھیں جہنم کی آگ میں گرم کیا جائے گا اور پھران سے اس کے پہلو ، اس کی پیشانی اور اس کی پشت کو داغا جائےگا ، جب وہ ( تختیاں ) پھر سے ( آگ میں ) جائیں گی ، انھیں پھر سے اس کے لئے واپس لایا جائےگا ، اس دن جس کی مقدار پچاس ہزار سال ہے ( یہ عمل مسلسل ہوتا رہے گا ) حتیٰ کہ بندوں کے درمیان فیصلہ کردیا جائے گا ، پھر وہ جنت یا دوزخ کی طرف اپنا راستہ دیکھ لےگا ۔ \"\" آپ صلی اللہ علیہ وسلم سے پوچھا گیا : اے اللہ کے رسول صلی اللہ علیہ وسلم !اونٹوں کا کیا حکم ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کوئی اونٹوں کا مالک نہیں جو ان کا حق ادا نہیں کرتا اور ان کا حق یہ بھی ہے کہ ان کو پانی پلانے کے دن ( ضرورت مندوں اور مسافروں کےلئے ) ان کا دودھ نکالا جائے ، اور جب قیامت کا دن ہوگااس ( مالک ) ایک وسیع چٹیل میدان میں ان ( اونٹوں ) کے سامنے بچھا ( لٹا ) دیاجائے گا ، وہ ( اونٹ دنیا میں تعداد اور فربہی کے اعتبار سے ) جتنے زیادہ سے زیادہ وافر تھے اس حالت میں ہوں گے ، وہ ان میں سے دودھ چھڑائے ہوئے ایک بچے کو بھی گم نہیں پائے گا ، وہ اسے اپنے قدموں سے روندیں گے اور اپنے منہ سے کاٹیں گے ، جب بھی ان میں سے پہلا اونٹ اس پر سے گزر جائےگا تو دوسرا اس پر واپس لے آیا جائے گا ، یہ اس دن میں ( بار بار ) ہوگا جس کی مقدار پچاس ہزار سال ہوگی ، یہاں تک کہ بندوں کے درمیان فیصلہ ہوجائےگا اور اسے اور اسے جنت کادوزخ کی طرف اس کا راستہ دیکھایاجائے گا ۔ آپ صلی اللہ علیہ وسلم سے عر ض کی گئی : اللہ کے رسول صلی اللہ علیہ وسلم !تو گائے اور بکریاں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اورنہ گائے اور بکریوں کا کوئی مالک ہوگا جو ان کا حق ادا نہیں کرتا ، مگر جب قیامت کادن ہوگا تو اسے ان کے سامنے وسیع چٹیل میدان میں بچھایا ( لِٹایا ) جائے گا ۔ وہ ان میں سے کسی ایک ( جانور ) کو بھی گم نہیں پائےگا ۔ ان میں کوئی ( گائے یا بکری ) نہ مڑے سینگوں والی ہوگی ، نہ بغیر سینگوں کے اور نہ ہی کوئی ٹوٹے سینگوں والی ہوگی ( سب سیدھے تیز سینگوں والی ہوں گی ) وہ اسے اپنے سینگوں سے ماریں گی اور اپنے سمو سے روندیں گی ، ( یہ معاملہ ) اس دن میں ( ہوگا ) جو پچاس ہزار سال کے برابر ہوگا ، جب پہلا ( جانور ) گزر جائے گا تو ان کا دوسرا ( جانور واپس ) لے آیا جائے گا حتیٰ کہ بندوں کے درمیان فیصلہ ہوجائے گا ، اور سے جنت یا دوزخ کی طرف اس کا راستہ د یکھایا جائے گا ۔ \"\" عرض کی گئی : اے اللہ کے رسول صلی اللہ علیہ وسلم !تو گھوڑے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" گھوڑے تین طرح کے ہیں : وہ جو آدمی کے بوجھ ہیں ، دوسرے وہ جو آدمی کے لئے ستر ( پردہ پوشی کا باعث ) ہیں ۔ تیسرے وہ جو آدمی کے لئے اجر وثواب کا باعث ہیں ۔ بوجھ اور گناہ کا باعث وہ گھوڑے ہیں جن کو ان مالک ریاکاری ، فخر وغرور ، اور مسلمانوں کی دشمنی کے لئے باندھتا ہے تو یہ گھوڑے اس کے لئے بوجھ ( گناہ ) ہیں ۔ اور وہ جو اسکے لئے پردہ پوشی کا باعث ہیں تو وہ ( اس ) آدمی ( کے گھوڑے ہیں ) جس نے انھیں ( موقع ملنے پر ) اللہ کی راہ میں ( خود جہاد کرنے کے لئے ) باندھ رکھا ہے ، پھر وہ ان کی پشتوں اور گردنوں میں اللہ کے حق کو نہیں بھولا تو یہ اس کے لئے باعث ستر ہیں ( چاہے اسے جہاد کا موقع ملے یا نہ ملے ) اور وہ گھوڑے جو اس کے لئے اجر وثواب کا باعث ہیں تو وہ ( اس ) آدمی ( کے گھوڑے ہیں ) جس نے انھیں اللہ کی راہ میں اہل اسلام کی خاطر کسی چراگاہ یا باغیچے میں باندھ رکھا ہے ( اور وہ خود جہاد پر جاسکے یا نہ جاسکے انھیں دوسروں کو جہاد کے لئے دیتا ہے ) یہ گھوڑے اس چراگاہ یاباغ میں سے جتنا بھی کھائیں گے تو اس شخص کے لئے اتنی تعداد میں نیکیاں لکھ دی جائیں گی اور اس شخص کے لئے ان کی لید اور پیشاب کی مقدار کے برابر ( بھی ) نیکیاں لکھ دی جائیں گی اور وہ گھوڑے اپنی رسی تڑواکر ایک دو ٹیلوں کی دوڑ نہیں لگائیں گے مگر اللہ تعالیٰ ا س شخص کےلئے ان کے قدموں کے نشانات اور لید کی تعداد کے برابر نیکیاں لکھ دے گا اور نہ ہی ان کا مالک انھیں لے کر کسی نہر پر سے گزرے گا اور وہ گھوڑے اس نہر میں سے پانی پیئں گے جبکہ وہ ( مالک ) ان کو پانی پلانا ( بھی ) نہیں چاہتا مگر اللہ تعالیٰ اس شخص کے لئے اتنی نیکیاں لکھ دے گا جتنا ان گھوڑوں نے پانی پیا ۔ \"\" عرض کی گئی : اے اللہ کے رسول صلی اللہ علیہ وسلم !اور گدھے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" مجھ پر گدھوں کے بارے میں اس منفرد اور جامع آیت کے سوا کوئی چیز نازل نہیں کی گئی : فَمَن يَعْمَلْ مِثْقَالَ ذَرَّ‌ةٍ خَيْرً‌ا يَرَ‌هُ ﴿<http : //tanzil.net/>﴾ وَمَن يَعْمَلْ مِثْقَالَ ذَرَّ‌ةٍ شَرًّ‌ا يَرَ‌هُ ﴿<http : //tanzil.net/>﴾ \"\" جو کوئی ایک زرے کی مقداار میں نیکی کرے گا ( قیامت کے دن ) اسے دیکھ لے گا اور جو کوئی ایک زرے کے برابر بُرائی کرے گا اسے دیکھ لے گا ۔",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		}
	]
}