{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2305,
			"arabicnumber": "94.04",
			"text": "عبدالعزیز بن رفیع نے زید بن وہب سے اور انھوں نے ابو زر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں ایک رات ( گھرسے ) باہر نکلا تو اچانک دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم اکیلے جارہے ہیں ، آپ کے ساتھ کوئی انسان نہیں تو میں نے خیال کیا کہ آپ اس بات کو ناپسند کررہے ہیں کہ کوئی آپ کے ساتھ چلے ، چنانچہ میں چاند کے سائے میں چلنے لگا ، آپ مڑے تو مجھے دیکھ لیا اور فرمایا : \" یہ کون ہے؟ \" میں نے عرض کی : ابو زر رضی اللہ تعالیٰ عنہ ہوں ، اللہ مجھے آپ پر قربان کرے!آپ صلی اللہ علیہ وسلم نے فرمایا : \" ابو زر ( رضی اللہ تعالیٰ عنہ ) آجاؤ ۔ \" کہا : میں کچھ دیر آپ کے ساتھ چلا تو آپ نے فرمایا : \" بے شک زیادہ مال والے ہی قیامت کے دن کم ( مایہ ) ہوں گے ، سوائے ان کے جن کو اللہ نے مال عطا فرمایا : اور ا نھوں نے اسے دائیں ، بائیں اور آگے ، پیچھے اڑا ڈالا اور اس میں نیکی کے کام کئے ۔ \" میں ایک گھڑی آپ کے ساتھ چلتا رہا تو آپ صلی اللہ علیہ وسلم نے فرمایا : یہاں بیٹھ جاؤ ۔ \" آپ نے مجھے ایک ہموار زمین میں بٹھا دیا جس کے گرد پتھر تھے اور آپ صلی اللہ علیہ وسلم نے مجھے فرمایا : \" یہیں بیٹھے رہنا یہاں تک کہ میں تمھارے پاس لوٹ آؤں ۔ \" آپ پتھریلے میدان ( حرے ) میں چل پڑے حتیٰ کہ میری نظروں سے اوجھل ہوگئے ، آپ مجھ سے دور رکے رہے اور زیادہ دیرکردی ، پھر میں نے آپ کی آواز سنی جب آپ صلی اللہ علیہ وسلم میری طرف آتے ہوئے فرمارہے تھے : \" خواہ اس نے چوری کی ہو یا زنا کیا ہو ۔ \" جب آپ تشریف لئے آئے تو میں صبر نہ کرسکا میں نے عرض کی : اے اللہ کے نبی صلی اللہ علیہ وسلم !اللہ مجھے آپ پر نثار فرمائے!آپ سیاہ پتھروں کے میدان ( حرہ ) کے کنارے کس سے گفتگو فرمارہے تھے؟میں نے تو کسی کو نہیں سناجو آپ کو جواب دے رہا ہو ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ جبرئیل علیہ السلام تھے جو سیاہ پتھروں کے کنارے میرے سامنے آئے اور کہا : اپنی امت کو بشارت دے دیجئے کہ جو کوئی اس حالت میں مرے گا کہ اللہ کے ساتھ کسی چیز کو شریک نہیں ٹھہراتا ہوگا وہ جنت میں داخل ہوگا ۔ میں نے کہا : اے جبرئیل علیہ السلام! چاہے اس نے چوری کی ہو یا زنا کیا ہو؟انھوں نےکہا : ہاں!فرمایا : میں نے پھر کہا : خواہ اس نے چوری کی ہو خواہ اس نے زنا کیا ہو؟انھوں نے کہا : ہاں ۔ میں نے پھر ( تیسری بار ) پوچھا : خواہ اس نے چوری کی ہو خواہ اس نے زنا کیا ہو؟انھوں نے کہا : ہاں ، خواہ اس نے شراب ( بھی ) پی ہو ۔",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 42
			}
		}
	]
}