{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2306,
			"arabicnumber": "992.01",
			"text": "ابو علاء نے حضرت احنف بن قیس ؒسے روایت کی انھوں نے کہا : میں مدینہ آیا تو میں قریشی سر داروں کے ایک حلقے میں بیٹھا ہوا تھا کہ اچانک کھردرے کپڑوں گٹھے ہو ئے جسم اور سخت چہرے والا ایک آدمی آیا اور ان کے سر پر کھڑا ہو گیا اور کہنے لگا ۔ مال و دولت جمع کرنے والوں کو اس تپتے ہو ئے پتھر کی بشارت سنا دو جس کو جہنم کی آگ میں گرم کیا جا ئے گا اور اسے ان کے ایک فرد کی نو ک پستان پر رکھا جائے گا حتیٰ کہ وہ اس کے دونوں کندھوں کی باریک ہڈیوں سے لہراتا ہوا نکل جا ئے گا اور اسے اس کے شانوں کی باریک ہڈیوں پر رکھا جا ئے گا حتیٰ کہ وہ اس کے پستانوں کے سروں سے حرکت کرتا ہوا نکل جا ئے گا ۔ ( احنف نے ) کہا : اس پر لو گوں نے اپنے سر جھکا لیے اور میں نے ان میں سے کسی کو نہ دیکھا کہ اسے کو ئی جواب دیا ہو کہا پھر وہ لو ٹا اور میں نے اس کا پیچھا کیا حتیٰ کہ وہ ایک ستون کے ساتھ ( ٹیک لگا کر ) بیٹھ گیا میں نے کہا : آپ نے انھیں جو کچھ کہا ہے میں نے انھیں اس کو نا پسند کرتے ہو ئے ہی دیکھا ہے انھوں نے کہا : یہ لو گ کچھ سمجھتے نہیں میرے خلیل ابو القاسم صلی اللہ علیہ وسلم نے مجھے بلا یا میں نے لبیک کہا تو آپ نے فر ما یا : \" کیا تم احد ( پہاڑ ) کو دیکھتے ہو؟ میں نے دیکھا کہ مجھ پر کتنا سورج باقی ہے میں سمجھ رہا تھا کہ آپ مجھے اپنی کسی ضرورت کے لیے بھیجنا چا ہتے ہیں چنا نچہ میں نے عرض کی میں اسے دیکھ رہا ہوں تو آپ نے فر مایا : \" میرے لیے یہ بات باعث مسرت نہ ہو گی کہ میرے پا س اس کے برا برا سونا ہو اور میں تین دیناروں کے سوا اس سارے ( سونے ) کو خرچ ( بھی ) کر ڈالوں ۔ پھر یہ لو گ ہیں دنیا جمع کرتے ہیں کچھ عقل نہیں کرتے ۔ میں نے ان سے پو چھا آپ کا اپنے ( حکمران ) قریشی بھائیوں کے ساتھ کیا معاملہ ہے آپ اپنی ضرورت کے لیے نہ ان کے پاس جا تے ہیں اور نہ ان سے کچھ لیتے ہیں ؟ انھوں نے جواب دیا نہیں تمھا رے پرودیگار کا قسم! نہ میں ان سے دنیا کی کو ئی چیز مانگوں گا نہ ہی ان سے کسی دینی مسئلے کے بارے میں پو چھوں گا یہاں تک کہ میں اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم سے جا ملوں ۔",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 43
			}
		}
	]
}