{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2351,
			"arabicnumber": "1017.01",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے عون بن ابی جحیفہ سے حدیث بیان کی ، ا نھوں نے منذر بن جریر سے اور انھوں نے اپنے والد سے روایت کی ، انھوں نے کہا ؛ ہم دن کے ابتدا ئی حصے میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حا ظر تھے کہ آپ کے پا س کچھ لو گ ننگے پاؤں ننگے بدن سوراخ کر کے دن کی دھا ری دار چادریں یا غبائیں گلے میں ڈا لے اور تلواریں لٹکا ئے ہو ئے آئے ان میں سے اکثر بلکہ سب کے سب مضر قبیلے سے تھے ان کی فاقہ زدگی کو دیکھ کر رسول اللہ صلی اللہ علیہ وسلم کا رخ نور غمزدہ ہو گیا آپ اندر تشریف لے گئے پھر با ہر نکلے تو بلال رضی اللہ تعالیٰ عنہ کو حکم دیا انھوں نے اذان دی اور اقامت کہی آپ نے نماز ادا کی ، پھر خطبہ دیا اور فرما یا : \" اے لو گو !اپنے رب سے ڈرو جس نے تمھیں ایک جا ن سے پیدا کیا ۔ ۔ ۔ آیت کے آخر تک \" بے شک اللہ تم پر نگرا ن ہے اور وہ آیت جو سورہ حشر میں ہے اللہ سے ڈرو اور ہر جا ن دیکھے کہ اس نے کل کے لیے آگے کیا بھیجا ہے ( پھر فر ما یا ) آدمی پر لازم ہے کہ وہ اپنے دینا ر سےاپنے درہم سے اپنے کپڑے سے اپنی گندم کے ایک صاع سے اپنی کھجور کے ایک صاع سے ۔ حتیٰ کہ آپ نے فر ما یا : ۔ ۔ ۔ چا ہے کھجور کے ایک ٹکڑے کے ذریعے سے صدقہ کرے ( جریرنے ) کہا : تو انصار میں سے ایک آدمی ایک تھیلی لا یا اس کی ہتھیلی اس ( کو اٹھا نے ) سے عاجز آنے لگی تھی بلکہ عا جز آگئی تھی کہا : پھر لو گ ایک دوسرے کے پیچھے آنے لگے یہاں تک کہ میں نے کھا نے اور کپڑوں کے دو ڈھیر دیکھے حتیٰ کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کا چہرہ مبارک دیکھا وہ اس طرح دمک رہا تھا جیسے اس پر سونا چڑاھا ہوا ہو ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا \" جس نے اسلا م میں کو ئی اچھا طریقہ رائج کیا تو اس کے لیے اس کا ( اپنا بھی ) اجر ہےے اور ان کے جیسا اجر بھی جنھوں نے اس کے بعد اس ( طریقے ) پر عمل کیا اس کے بغیر کہ ان کے اجر میں کو ئی کمی ہو اور جس نے اسلا م میں کسی برے طریقے کی ابتدا کی اس کا بو جھ اسی پر ہے اور ان کا بو جھ بھی جنھوں نے اس کے بعد اس پر عمل کیا اس کے بغیر کہ ان کے بو جھ میں کو ئی کمی ہو ۔",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		}
	]
}