{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2467,
			"arabicnumber": "1066.06",
			"text": "سلمہ بن کہیل نے کہا : مجھے زید بن وہب جہنی ؒ نے حدیث سنا ئی کہ وہ اس لشکر میں شامل تھے جو حضرت علی رضی اللہ تعالیٰ عنہ کے ساتھ تھا ( اور ) خوارج کی طرف روانہ ہوا تھا تو حضرت علی رضی اللہ تعالیٰ عنہ نے کہا : لو گو !میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \"\" میری امت سے کچھ لو گ نکلیں گے وہ ( اس طرح ) قرآن پڑھیں گے کہ تمھا ری قراءت ان کی قراءت کے مقابلے میں کچھ نہ ہو گی اور نہ تمھا ری نمازوں کی ان کی نمازوں کے مقابلے میں کو ئی حیثیت ہو گی اور نہ ہی تمھا رے روزوں کی ان کے روزوں کے مقابلے میں کو ئی حیثیت ہو گی ۔ وہ قرآن پڑھیں گے اور خیال کریں گے وہ ان کے حق میں ہے حا لا نکہ وہ ان کے خلا ف ہو گا ان کی نماز ان کی ہنسلیوں سے آگے نہیں بڑھے گی وہ اس طرح تیزرفتا ری کے ساتھ اسلام سے نکل جا ئیں گے جس طرح تیر بہت تیزی سے شکا ر کے اندر سے نکل جا تا ہے ۔ : \"\" اگر وہ لشکر جو ان کو جا لے گا جا ن لے کہ ان کے نبی صلی اللہ علیہ وسلم کی زبان سے ان کے بارے میں کیا فیصلہ ہوا ہے تو وہ عمل سے ( بے نیاز ہو کر صرف اسی عمل پر ) بھروسا کر لیں ۔ اس ( گروہ ) کی نشانی یہ ہے کہ ان میں ایک آدمی ہو گا جس کا عضد ( بازو ، کندھے سے لے کر کہنی تک کا حصہ ) ہو گا کلا ئی نہیں ہو گی اس کے بازو کے سر ے پر پستان کی نو ک کی طرح ( کا نشان ) ہو گا جس پر سفید بال ہوں گے تو لو گ معاویہ رضی اللہ تعالیٰ عنہ اور اہل شام کی طرف جا رہے ہو اور ان ( لوگوں ) کو چھوڑرہے ہو جو تمھا رے بعد تمھا رے بچوں اور اموال پر آپڑیں گے اللہ کی قسم!مجھے امید ہے کہ وہی قوم ہے کیونکہ انھوں نے ( مسلمانوں کا ) حرمت والا خون بہا یا ہے اور لوگوں کے مویشیوں پر غارت گر ی کی ہے اللہ کا نا م لے کر ( ان کی طرف ) چلو ۔ سلمہ بن کہیل نے کہا : مجھے زید بن وہب نے ( ایک ایک ) منزل میں اتارا ( ہر منزل کے بارے میں تفصیل سے ) بتا یا حتیٰ کے بتا یا : ہم ایک پل پر سے گزرے پھر جب ہمارا آمنا سامنا ہوا تو اس روز خوارج کا سپہ سالار عبد اللہ بن وہب راسی تھا اس نے ان سے کہا : اپنے نیزے پھنیک دو اور اپنی تلواریں نیا موں سے نکا ل لو کیونکہ مجھے خطرہ ہے کہ وہ تمھا رے سامنے ( صلح کے لیے اللہ کا نا م ) پکا ریں گے جس طرح انھوں نے خروراء کے دن تمھا رے سامنے پکا را تھا تو انھوں نے لوٹ کر اپنے نیزے دو ر پھینک دیے اور تلواریں سونت لیں تو لو گ انھی نیزوں کے ساتھ ان پر پل پڑے اور وہ ایک دوسرے پر قتل ہو ئے ( ایک کے بعد دوسرا آتا اور قتل ہو کر پہلو ں پر گرتا ) اور اس روز ( علی رضی اللہ تعالیٰ عنہ کا ساتھ دینے والے ) لو گوں میں سے دو کے سوا کو ئی اور قتل نہ ہوا حضرت علی رضی اللہ تعالیٰ عنہ نے کہا ان میں ادھورے ہاتھ والے کو تلا ش کرو لو گوں نے بہت ڈھونڈا لیکن اس کو نہ پا سکے اس پر حضرت علی رضی اللہ تعالیٰ عنہ خود اٹھے اور ان لو گوں کے پاس آئے جو قتل ہو کر ایک دوسرے پر گرے ہو ئے تھے آپ نے فر ما یا : ان کو ہٹاؤ تو انھوں نے اسے ( لا شوں کے نیچے ) زمین سے لگا ہوا پا یا ۔ آپ نے اللہ اکبر کہا پھر کہا : اللہ نے سچ فر ما یا اور اس کے رسول اللہ صلی اللہ علیہ وسلم نے ( اسی طرح ہم تک ) پہنچا دیا ۔ ( زید بن وہب نے ) کہا عبیدہ سلمانی کھڑے ہو کر آپ کے سامنے حاضر ہو ئے اور کہا اے امیر المومنین ! اس اللہ کی قسم جس کے سوا کو ئی عبادت کے لا ئق نہیں !آپ نے واقعی یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی؟ تو انھوں نے کہا : ہاں اس اللہ کی قسم جس کے سوا کو ئی عبادت کے لا ئق نہیں !حتیٰ کہ اس نے آپ سے تین دفعہ قسم لی اور آپ اس کے سامنے حلف اٹھاتے رہے ۔",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 204
			}
		}
	]
}