{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2481,
			"arabicnumber": "1072.01",
			"text": "امام مالک نے زہری سے روایت کی کہ عبد اللہ بن نو فل بن حارث بن عبد المطلب نے انھیں حدیث بیان کی کہ عبد المطلب بن ربیعہ بن حا رث ( بن عبد المطلب ) رضی اللہ تعالیٰ عنہ نے انھیں حدیث بیان کی ، امھوں نے کہا ربیعہ بن حا رث اور عباس بن عبد المطلب رضی اللہ تعالیٰ عنہ اکٹھے ہو ئے اور دونوں نے کہا : اللہ کی قسم! اگر ہم ان دو نوں لڑکوں کو ، ، انھوں نے ( یہ بات ) میرے اور فضل بن عباس رضی اللہ تعالیٰ عنہ کے بارے میں کہی ۔ ۔ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیجیں اور یہ دو نوں آپ سے بات کریں اور آپ ان دونوں کو ان صدقات کی وصولی پر مقرر کر دیں جو کچھ ( دو سرے ) لو گ ( لا کر ) اداکرتے ہیں یہ دو نوں ادا کریں اور ان دو نوں کو بھی وہی کچھ ملے جو ( دوسرے ) لوگوں کو ملتا ہے ( رو کتنا اچھا ہو! ) وہ دو نوں اسی ( مشورے ) میں ( مشغول ) تھے کہ حضرت علی رضی اللہ تعالیٰ عنہ آئے اور ان کے پاس کھڑے ہو گئے ان دو نوں نے اس با ت کا ان کے سامنے ذکر کیا تو حضرت علی بن ابی طا لب رضی اللہ تعالیٰ عنہ نے کہا : آپ دونوں ایسا نہ کریں اللہ کی قسم! آپ صلی اللہ علیہ وسلم یہ کا م کرنے والے نہیں اس پر ربیعہ بن حارث رضی اللہ تعالیٰ عنہ ان کے درپے ہو گئے اور کہا اللہ کی قسم !تم محض اس لیے ہمارے ساتھ ایسا کر رہے ہو تا کہ تم ہم پر اپنی بر تری جتاؤ اللہ کی قسم !تمھیں رسول اللہ صلی اللہ علیہ وسلم کے داماد ہو نے کا شرف حاصل ہوا تو ( اس موقع پر ) ہم نے تو تم پر بر تری نہیں جتا ئی تھی حضرت علی رضی اللہ تعالیٰ عنہ نے کہا تم ان دونوں کو بھیج دو ۔ وہ دو نو چلے گئے اور حضرت علی رضی اللہ تعالیٰ عنہ ( وہیں ) لیٹ گئے ( ابن ربیعہ نے ) کہا جب رسول اللہ صلی اللہ علیہ وسلم نے ظہر کی نماز پڑھا لی تو وہ دونوں آپ سے پہلے حجرے کے قریب پہنچ گئے اور کہا : ہم وہاں کھڑے ہو گئے حتیٰ کہ جب آپ تشریف لا ئے تو ( اظہار اپنائیت کے طور پر ) ہمارے کا ن پکڑ لیے پھر فر ما یا : \"\" تم دو نوں کے دل میں جو کچھ ہے اسے نکا لو ( اس کا اظہار کرو ۔ ) پھر آپ اندر دا خل ہو ئے ہم بھی ساتھ ہی دا خل ہو گئے اس دن آپ زینب بنت حجش رضی اللہ تعالیٰ عنہا کے ہاں تھے ہم نے گفتگو ایک دوسرے پر ڈالی ( ہر ایک نے چا ہا دوسرا بات کرے ) پھر ہم میں سے ایک نے گفتگو شروع کی کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ سب لوگوں سے بڑھ کر احسان کرنے والے اور سب لوگوں سے زیادہ صلہ رحمی کرنے والے ہیں ہم دو نوں نکاح کی عمر کو پہنچ گئے ہیں ہم اس لیے حاضر ہو ئے ہیں کہ آپ ہمیں بھی ان صدقات میں سے کچھ ( صدقات ) کی وصولی کے لیے مقرر فر ما دیں جس طرح لو گ لا کر ادا کرتے ہیں ہم بھی لا کر دیں گے اور جس طرح انھیں ملتا ہے ہمیں بھی ملے گا آپ خاصی دیرتک خاموش رہے حتیٰ کہ ہم نے دوبارہ ) گفتگو کرنے کا ارادہ کر لیا ۔ کہا تو حضرت زینب رضی اللہ تعالیٰ عنہا پردے کے پیچھے سے اشارا کرنے لگیں کہ تم دونوں ان ( ( رسول اللہ صلی اللہ علیہ وسلم ) سے بات نہ کرو کہا : پھر ( کچھ دیر بعد ) آپ نے فر ما یا : \"\" آل محمد کے لیے صدقہ روانہیں ۔ یہ تو لوگوں ( کے مال ) کا میل کچل ہے محمية وہ خمس ( غنیمت کے پانچویں حصے ) پر مامور تھے ۔ ۔ ۔ اور نوفل بن حارث بن عبد المطلب کو میرے پاس بلا ؤ ۔ کہا وہ دونوں آپ کی خدمت میں حا ضر ہو ئے تو آپ نے محمیہ رضی اللہ تعالیٰ عنہ سے کہا : \"\" اس لڑکے ( فضل بن عباس رضی اللہ تعالیٰ عنہ ) سے اپنی بیٹی کا نکا ح کر دو ۔ تو اس نے ان کا نکا ح کر دیا اور آپ نے نوفل بن حارث رضی اللہ تعالیٰ عنہ سے کہا تم اس لڑکے سے اپنی بیٹی کی شادی کر دو ۔ میرے بارے میں ۔ تو اس نے میرا نکا ح کر دیا اور آپ نے محمیہ رضی اللہ تعالیٰ عنہ سے فر ما یا : \"\" خمس ( جو اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم کے لیے تھا ) میں سے ان دونوں کا تنا اتنا حق مہر ادا کر دو ۔ زہری نے کہا اس ( عبد اللہ بن عبد اللہ ) نے حق مہر مجھے نہیں بتا یا ۔",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 218
			}
		}
	]
}