{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2746,
			"arabicnumber": "1162.01",
			"text": "حماد نے غیلان سے ، انھوں نے عبداللہ بن معبد زمانی سے اورانھوں نے حضرت ابو قتادہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور پوچھا : آپ کس طرح روزے رکھتے ہیں؟اس کی بات سے رسول اللہ صلی اللہ علیہ وسلم غصے میں آگئے ، جب حضرت عمر رضی اللہ تعالیٰ عنہ نے آپ صلی اللہ علیہ وسلم کا غصہ دیکھا تو کہنے لگے : ہم اللہ کے رب ہونے ، اسلام کے دین ہونے اور محمد صلی اللہ علیہ وسلم کے رسول ہونے پر راضی ہیں ، ہم اللہ کے غصے سے اوراس کے رسول صلی اللہ علیہ وسلم کے غصے سے اللہ کی پناہ میں آتے ہیں ۔ حضرت عمر رضی اللہ تعالیٰ عنہ بار بار ان کلمات کو دہرانے لگے حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم کا غصہ ٹھنڈا ہوگیا ، توحضرت عمر رضی اللہ تعالیٰ عنہ نے کہااللہ کے رسول صلی اللہ علیہ وسلم اس شخص کا کیا حکم ہے جو سال بھر ( مسلسل ) روزہ رکھتا ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" نہ اس نے روزہ رکھا نہ اس نے افطارکیا ۔ \" یا فرمایا ۔ \" اس نے روزہ نہیں رکھا اس نے افطار نہیں کیا ۔ \" کہا : اس کا کیا حکم ہے جو دو دن روزہ رکھتاہے اور ایک دن افطار کرتاہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیاکوئی اس کی طاقت رکھتاہے؟ \" پوچھا : اس کا کیا حکم ہے جو ایک دن روزہ رکھتاہے اور ایک دن افطار کرتاہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ داود علیہ السلام کا روزہ ہے ۔ \" پوچھا : اس کا کیا حکم ہے جو ایک دن روزہ رکھتاہے اور دو دن افطار کرتاہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے پسند ہے کہ مجھے اس کی طاقت مل جاتی ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر مہینے کے تین روزے اور ایک رمضان ( کے روزوں ) سے ( لے کردوسرے ) رمضان ( کے روزے ) یہ ( عمل ) سارے سال کے روزوں ( کے برابر ) ہے ۔ اور عرفہ کے دن کا روزہ میں اللہ سے امید رکھتاہوں کہ پچھلے سال کے گناہوں کاکفارہ بن جائے گا اور اگلے سال کے گناہوں کا بھی اور یوم عاشورہ کاروزہ ، میں اللہ سے امید رکھتاہوں کہ پچھلے سال کے گناہوں کا کفارہ بن جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 252
			}
		}
	]
}