{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2959,
			"arabicnumber": "1221.03",
			"text": "سفیان ثوری نے قیس ( بن مسلم ) سے ، انھوں نے طارق بن شہاب سے ، انھوں نے حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : سیدنا ابوموسیٰ رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ، اور آپ صلی اللہ علیہ وسلم ( مکہ سے باہروادی ) بطحاء میں سواریاں بٹھائے ہوئے ( پڑاؤڈالے ہوئے ) تھےتو آپ صلی اللہ علیہ وسلم نے مجھ سے پوچھا کہ \" تم نے کون سا تلبیہ پکارا ہے؟ ( حج کا ، عمرے کا ، یا دونوں کا؟ ) \" میں نے عرض کی : میں نے نبی صلی اللہ علیہ وسلم والا تلبیہ پکارا ۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ تم قربانی ساتھ لائے ہو؟ میں نے کہا نہیں تو آپ صلی اللہ علیہ وسلم نے فرمایا : بیت اللہ اور صفا مروہ کا طواف کر کے احرام کھول ڈالو ۔ پس میں نے بیت اللہ کا طواف اور صفا مروہ کی سعی کی ، پھر میں اپنی قوم کی ایک عورت کے پاس آیا ( یہ ان کی محرم تھی ) تو اس نے میرے سر میں کنگھی کی اور میرا سر دھو دیا ۔ پھر میں ابوبکر و عمر رضی اللہ عنہما کی خلافت میں لوگوں کو یہی فتویٰ دینے لگا ۔ ( یعنی جو بغیر قربانی کے حج پر آئے تو وہ عمرہ کرنے کے بعد احرام کھول دے ، پھر یوم الترویہ 8 ۔ ذوالحج کو دوبارہ حج کا احرام باندھے لیکن ) ایک مرتبہ میں حج کے مقام پر کھڑا تھا کہ اچانک ایک شخص آیا ، اس نے کہا کہ ( تو تو احرام کھولنے کا فتویٰ دیتا ہے ) آپ جانتے ہیں کہ امیرالمؤمنین سیدنا عمر رضی اللہ عنہ نے قربانی کے متعلق نیا کام شروع کر دیا ۔ ( یعنی عمر رضی اللہ عنہ کا کہنا تھا کہ عمرہ کر کے احرام کو کھولنا نہیں چاہئے ) تو میں نے کہا اے لوگو! ہم نے جس کو اس مسئلے کا فتویٰ دیا ہے اس کو رک جانا چاہئے ۔ کیونکہ امیرالمؤمنین سیدنا عمر رضی اللہ عنہ آنے والے ہیں لہٰذا ان کی پیروی کرو ۔ جب سیدنا عمر رضی اللہ عنہ آئے تو میں نے کہا ، امیرالمؤمنین آپ نے قربانی کے متعلق یہ کیا نیا مسئلہ بتایا ہے؟ تو سیدنا عمر رضی اللہ عنہ نے فرمایا : اگر آپ اللہ کی کتاب قرآن پر عمل کریں تو قرآن کہتا ہے : ( ( وَأَتِمُّوا الْحَجَّ وَالْعُمْرَ‌ةَ لِلَّـهِ ۚ ) ) یعنی حج اور عمرہ کو اللہ کے لئے پورا کرو ( یعنی احرام نہ کھولو ) اور اگر آپ نبی کریم صلی اللہ علیہ وسلم کی سنت پر عمل کریں تو ان کا اپنا طریقہ یہ تھا کہ انہوں نے احرام اس وقت تک نہ کھولا جب تک قربانی نہ کر لی ۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 168
			}
		}
	]
}