{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3001,
			"arabicnumber": "1235",
			"text": "محمد بن عبدالرحمان سے روایت ہے کہ ایک عراقی شخص نے ان سے کہا : میری طرف سے عروہ بن زبیر رضی اللہ تعالیٰ عنہ سے اس شخص کے بارے میں سوال کیجئے جو حج کا تلبیہ پکارتا ہے ، جب وہ بیت اللہ کاطواف کرلےتو کیا احرام سے آزاد ہوجائےگا یانہیں؟اگر وہ تمھیں جواب دیں کہ وہ آزاد نہیں ہوگا تو ان سے کہناکہ ایک شخص ہے جو یہ کہتاہے ( محمد بن عبدالرحمان نے ) کہا : میں نے عروہ سے اس کی بابت سوال کیا توا نھوں نےکہا : جو شخص حج کا احرام باندھے ، وہ حج کیے بغیر احرام سے فارغ نہیں ہوگا ۔ میں ( محمد بن عبدالرحمان ) نے عرض کی کہ ایک شخص ہے جو یہی بات کہتا ہے انھوں نے فرمایا : کتنی بری بات ہے جو اس نے کہی ہے ۔ پھر میرا ٹکراؤ ( اس عراقی ) شخص سے ہوا تو اس نے مجھ سے ( اپنے سوال کے متعلق ) پوچھا ۔ میں نے اسے بتادیا ۔ اس ( عراقی ) نے کہا : ان ( عروہ ) سے کہو ، بلاشبہ ایک شخص خبر دے رہاتھا کہ اللہ کے رسول صلی اللہ علیہ وسلم نے ایسا حکم کیا تھا ( حکم دیا تھا ) حضرت اسماء رضی اللہ تعالیٰ عنہا اور حضرت زبیر رضی اللہ تعالیٰ عنہ کا کیا معاملہ تھا؟انھوں نے ( بھی تو ) ایسا کیا تھا ۔ ( محمد بن عبدالرحمان نے ) کہا : میں ان عروہ کے پاس آیا اور ان کو یہ بات سنائی ۔ انھوں نے پوچھا : یہ ( سائل ) کون ہے؟میں نے عرض کی : میں نہیں جانتا ۔ انھوں نے کہا : اسے کیا ہے؟وہ خود میرے پاس آکرمجھ سے سوال کیوں نہیں کرتا؟میرا خیال ہے ، وہ کوئی عراقی ہوگا ۔ میں نے کہا : میں نہیں جانتا ۔ ( عروہ نے ) کہا : بلاشبہ اس نے جھوٹ بولاہے ۔ مجھے حضرت عائشہ رضی اللہ تعالیٰ عنہا نےخبر دی کہ اللہ کےرسول صلی اللہ علیہ وسلم نے حج کیا ، مکہ آکر آپ نے جو کام سب سے پہلے کیا ، یہ تھا کہ آپ نے وضوفرمایا اور پھر بیت اللہ کاطواف کیا ۔ پھر ان کے بعدحضرت ابو بکر رضی اللہ تعالیٰ عنہ نے بھی حج کیا ، انھوں نے بھی ، سب سے پہلے جو کیا ، یہی تھا کہ بیت اللہ کا طواف کیا اور اس کےسوا کوئی کام نہ کیا ( نہ بال کٹوائے نہ احرام کھولا ) ، پھرحضرت عمر رضی اللہ تعالیٰ عنہ نے ہی ایسا ہی کیا ۔ پھرحضرت عثمان رضی اللہ تعالیٰ عنہ نے حج کیا ۔ میں نےانھیں دیکھا ، انھوں نے بھی سب سے پہلا کام جس سے آغاز کیا ، بیت اللہ کاطواف تھا ، پھر اس کےپھر اس کے علاوہ کوئی کام نہ ہوا ۔ پھرمعاویہ رضی اللہ تعالیٰ عنہ اورعبداللہ بن عمر رضی اللہ تعالیٰ عنہ ( نے بھی ایسا ہی کیا ) پھر میں نے اپنے والد زبیر بن عوام رضی اللہ تعالیٰ عنہ کے ساتھ حج کیا ، انھوں نے بھی سب سے پہلے جس سے آغاز کیا بیت اللہ کاطواف تھا اور اس کے علاوہ کوئی نہ تھا ، پھر میں نے مہاجرین وانصار ( کی جماعت ) کو بھی ایسا ہی کرتے دیکھا ۔ اس کے بعد ( بال کٹوانا احرام کھولنا ) کوئی کام نہ ہوا ۔ پھر سب سے آخر میں جسے میں نے یہ کرتے دیکھا وہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ ہیں ۔ انہوں نے بھی عمرے کے ذریعے سے اپنے حج کو فسخ نہیں کیا ، اور یہ ابن عمر رضی اللہ تعالیٰ عنہ لوگوں کے پاس موجود ہیں ۔ یہ انھی سے کیوں نہیں پوچھ لیتے؟اور نہ گزرے ہوئے لوگوں ( صحابہ رضوان اللہ عنھم اجمعین ) میں سے کسی نے ( یہ کام ) کیا ۔ وہ ( صحابہ رضوان اللہ عنھم اجمعین ) جب بھی بیت اللہ میں قدم رکھتے تو طواف سے پہلے اور کسی چیز سے ابتداء نہ کرتے تھے ( طوا ف کرنے کے بعد ) احرام نہیں کھولتے تھے ۔ میں نے اپنی والدہ اور خالہ کو بھی دیکھا ، وہ جب بھی مکہ آتیں طواف سے پہلے کسی اور کام سے آغاز نہ کرتیں ، اس کا طواف کرتیں ، پھر احرام نہ کھولتیں ( حتیٰ کہ حج پورا کرلیتیں ) میری والدہ نے مجھے بتایا کہ وہ ، ان کی ہمشیرہ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) ، حضرت زبیر رضی اللہ تعالیٰ عنہ فلاں فلاں لوگ کسی وقت عمرہ کے لئے آئے تھے ، جب انھوں نے حجر اسود کا استلام کرلیا ( اور عمرہ مکمل ہوگیا ) تو ( اس کے بعد ) انھوں نے احرام کھولا ۔ اس شخص نے اس کے بارے میں جس بات کا ذکر کیا ہے ، اس میں جھوٹ بولا ہے ۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 209
			}
		}
	]
}