{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 329,
			"arabicnumber": "125",
			"text": "حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ جب رسول اللہ ﷺ پر یہ آیت اتری : ’’ آسمانوں اور زمین میں جو کچھ ہے ، اللہ ہی کا ہے اور تمہارے دلوں میں جو کچھ ہے اسے ظاہر کرو یا چھپاؤ ، اللہ تعالیٰ اس پر تمہارا محاسبہ کرے گا ، پھر جسے چاہے گا بخش دے گا اور جسے چاہے گا عذاب دے گا اور ا للہ ہر چیز پر قادر ہے ۔ ‘ ‘ تو رسول اللہ ﷺ سے ساتھیوں پر یہ بات انتہائی گراں گزری ۔ کہا : وہ رسول اللہ ﷺ کی خدمت میں حاضر ہوئے اور گھٹنوں کے بل بیٹھ کر کہنے لگے : اے اللہ کے رسول ! ( پہلے ) ہمیں ایسے اعمال کا پابند کیا گیا جو ہماری طاقت میں ہیں : نماز ، روزہ ، جہاد اور صدقہ او راب آپ پر یہ آیت اتری ہے جس کی ہم طاقت نہیں رکھتے ۔ رسول اللہ ﷺ نے فرمایا : ’’ کیا تم وہی بات کہنا چاہتے ہو جو تم سے پہلے دونوں اہل کتاب نے کہی : ہم نے سنا اور نافرمانی کی ! بلکہ تم کہو : ہم نے سنا اور اطاعت کی ۔ اے ہمارے رب ! تیری بخشش چاہتے ہیں اور تیری ہی طرف لوٹنا ہے ۔ ‘ ‘ جب صحابہ نے یہ الفاظ دہرانے لگے اور ان کی زبانیں ان الفاظ پر رواں ہو گئیں ، تو اس کے بعد اللہ تعالیٰ نے یہ آیت اتاری : ’’رسو ل اللہ ﷺ اس ( ہدایت ) پر ایمان لائے جوان کے رب کی طرف ان پر نازل کی گئی اور سارے مومن بھی ۔ سب ایمان لائے اللہ پر ، اس کے فرشتوں پر ، اس کی کتابوں پر اور اس کے رسولوں پر ، ( اورکہا : ) ہم ( ایمان لانے میں ) اس کے رسولوں کے درمیان فرق نہیں کرتے اور انہوں نے کہا : ہم نے سنا اور ہم نے اطاعت کی ، اے ہمارے رب !تیری بخشش چاہتے ہیں اور تیری ہی طرف لوٹ کر آنا ہے ۔ ‘ ‘ چنانچہ جب انہوں نے یہ ( مان کر اس پر عمل ) کیا تو اللہ عزوجل نےاس آیت ( کے ابتدائی معنی ) منسوخ کرتے ہوئے یہ آیت نازل فرمائی : ’’ اللہ کسی شخص پر اس کی طاق سے زیادہ بوجھ نہیں ڈالتا ۔ اس نے جو ( نیکی ) کمائی اورجو ( برائی ) کمائی ( اس کا وبال ) اسی پر ہے ، اے ہمارے رب ! اگر ہم بھول جائیں یا ہم خطا کریں تو ہمارا مؤاخذہ نہ کرنا ۔ ‘ ‘ ( اللہ نے ) فرمایا : ہاں ۔ ( انہوں نے کہا : ) ’’ اے ہمارے پروردگار ! اور ہم پر ایسا بوجھ نہ ڈال جیسا تو نے ان لوگوں پر ڈالا جوہم سے پہلے ( گزر چکے ) ہیں ۔ ‘ ‘ ( اللہ نے ) فرمایا : ہاں! ( پھر کہا : ) ’’اے ہمارے رب ! ہم سے وہ چیز نہ اٹھوا جس کے اٹھانے کی ہم میں طاقت نہیں ۔ ‘ ‘ ( اللہ نے ) فرمایا : ہاں ! ( پھر کہا : ) ’’ او رہم سےدرگزر فرما اور ہمیں بخشش دے اور ہم پر مہربانی فرما ۔ تو ہی ہمارا کارساز ہے ، پس تو کافروں کے مقابلے میں ہماری مدد فرما ۔ ‘ ‘ ( اللہ نے ) فرمایا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 236
			}
		}
	]
}