{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3501,
			"arabicnumber": "1365.06",
			"text": "سلیمان بن مغیرہ نے ہمیں ثابت سے حدیث بیان کی کہا : حضرت انس رضی اللہ عنہ نے ہمیں حدیث بیان کی ، انہوں نے کہا : حضرت صفیہ حضرت دحیہ رضی اللہ عنہا کے حصے میں آ گئیں ، ( آپ صلی اللہ علیہ وسلم نے دحیہ رضی اللہ عنہا کو اپنے حصے کی ایک کنیز لینے کی اجازت دے کر غیر رسمی طور پر تقسیم کا آغاز فرما دیا تھا ۔ ) لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس ان کی تعریف کرنے لگے ، وہ کہہ رہے تھے : ہم نے قیدیوں میں ان جیسی عورت نہیں دیکھی ۔ تو آپ نے دحیہ رضی اللہ عنہ کی طرف پیغام بھیجا ، اور ان کے بدلے میں جو انہوں نے چاہا ، آپ صلی اللہ علیہ وسلم نے دیا ، پھر آپ نے اسے میری والدہ کے سپرد کیا اور فرمایا : \" اسے بنا سنوار دو ۔ \" پھر رسول اللہ صلی اللہ علیہ وسلم خیبر سے نکلے حتیٰ کہ جب آپ نے اسے پشت کی طرف کر لیا ، ( خیبر پیچھے رہ گیا ) تو آپ نے پڑاؤ ڈالا ، پھر ان ( حضرت صفیہ رضی اللہ عنہا ) کے لیے خیمہ لگوایا ، جب صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس کے پاس زادِ راہ سے زائد کچھ ہو وہ اسے ہمارے پاس لے آئے ۔ \" کہا : اس پر کوئی آدمی زائد کھجوریں لے کر آنے لگا اور ( کوئی ) زائد ستو ، حتیٰ کہ لوگوں نے ان چیزوں سے ایک ڈھیر مخلوط کھانے ( حَیس ) کا بنا لیا ، پھر وہ اس حیس میں سے تناول کرنےلگے اور بارش کے پانی کے حوضوں سے جو ان کے قریب تھے پانی پینے لگے ۔ کہا : حضرت انس رضی اللہ عنہ نے کہا : یہ تھا ان ( صفیہ رضی اللہ عنہا ) کے لیے رسول اللہ صلی اللہ علیہ وسلم کا ولیمہ ۔ کہا : اس کے بعد ہم چل پڑے ، جب ہم نے مدینہ کی دیواریں دیکھیں تو ہم شدتِ شوق سے اس کی طرف لپک پڑے ، ہم نے اپنی ساریاں اٹھا دیں ( تیز کر دیں ) اور رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنی سواری اٹھا دی ۔ کہا : صفیہ رضی اللہ عنہا آپ کے پیچھے تھیں ، رسول اللہ صلی اللہ علیہ وسلم نے انہیں اپنے ساتھ سوار کر لیا تھا ، کہا : ( اچانک ) رسول اللہ کی سواری کو ٹھوکر لگی تو آپ زمین پر آ رہے اور وہ ( حضرت صفیہ رضی اللہ عنہا ) بھی زمین پر آ رہیں ، کہا : لوگوں میں سے کوئی بھی نہ آپ صلی اللہ علیہ وسلم کی طرف دیکھ رہا تھا اور نہ ان کی طرف ، کہا : حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور حضرت صفیہ رضی اللہ عنہا کے آگے پردہ کیا ، پھر ہم آپ کی خدمت میں حاضر ہوئے ، تو آپ نے فرمایا : \" ہمیں کوئی نقصان نہیں پہنچا ۔ \" پھر ہم مدینہ کے اندر داخل ہوئے تو آپ کی ازواج کی باندیاں باہر نکل آئیں ، وہ ایک دوسری کو وہ ( صفیہ رضی اللہ عنہا ) دکھا رہی تھیں ، اور ان کے گرنے پر دل ہی دل میں خوش ہو رہی تھیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 104
			}
		}
	]
}