{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3690,
			"arabicnumber": "1478",
			"text": "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : حضرت ابوبکر رضی اللہ عنہ آئے ، وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کی اجازت مانگ رہے تھے ۔ انہوں نے لوگوں کو آپ کے دروازے پر بیٹھے ہوئے پایا ۔ ان میں سے کسی کو اجازت نہیں ملی تھی ۔ کہا : ابوبکر رضی اللہ عنہ کو اجازت ملی تو وہ اندر داخل ہو گئے ، پھر عمر رضی اللہ عنہ آئے ، انہوں نے اجازت مانگی ، انہیں بھی اجازت مل گئی ، انہوں نے نبی صلی اللہ علیہ وسلم کو غمگین اور خاموش بیٹھے ہوئے پایا ، آپ کی بیویاں آپ کے ارد گرد تھیں ۔ کہا : تو انہوں ( ابوبکر رضی اللہ عنہ ) نے کہا : میں ضرور کوئی ایسی بات کروں گا جس سے میں نبی صلی اللہ علیہ وسلم کو ہنساؤں گا ۔ انہوں نے کہا : اللہ کے رسول! کاش کہ آپ بنت خارجہ کو دیکھتے جب اس نے مجھ سے نفقہ کا سوال کیا تو میں اس کی جانب بڑھا اور اس کی گردن دبا دی ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم ہنس پڑے ۔ اور فرمایا : \"\" یہ بھی میرے اردگرد بیٹھی ہیں ، جیسے تم دیکھ رہے ہو ، اور مجھ سے نفقہ مانگ رہی ہیں ۔ \"\" ابوبکر رضی اللہ عنہ عائشہ رضی اللہ عنہا کی جانب اٹھے اور ان کی گردن پر ضرب لگانا چاہتے تھے اور عمر رضی اللہ عنہ حفصہ رضی اللہ عنہا کی جانب بڑھے اور وہ ان کی گردن پر مارنا چاہتے تھے ، ( رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں کو اس سے روک دیا ۔ مسند احمد : 3/328 ) اور دونوں کہہ رہے تھے : تم رسول اللہ صلی اللہ علیہ وسلم سے اس چیز کا سوال کرتی ہو جو ان کے پاس نہیں ہے ۔ وہ کہنے لگیں : اللہ کی قسم! آج کے بعد ہم کبھی رسول اللہ صلی اللہ علیہ وسلم سے ایسی چیز کا مطالبہ نہیں کریں گی جو آپ کے پاس نہ ہو گی ۔ پھر آپ صلی اللہ علیہ وسلم نے ایک ماہ یا انتیس دن تک کے لیے ان سے علیحدگی اختیار کر لی ۔ پھر آپ پر یہ آیت نازل ہوئی : \"\" اے نبی صلی اللہ علیہ وسلم! آپ اپنی بیویوں سے کہہ دو ۔ \"\" حتی کہ یہاں پہنچ گئے : \"\" تم میں سے نیکی کرنے والیوں کے لیے بڑا اجر ہے ۔ \"\" ( جابر رضی اللہ عنہ نے ) کہا : آپ نے ابتدا حضرت عائشہ رضی اللہ عنہا سے کی اور فرمایا : \"\" اے عائشہ! میں تمہارے سامنے ایک معاملہ پیش کر رہا ہوں اور پسند کرتا ہوں کہ تم ، اپنے والدین سے مشورہ کر لینے تک اس میں جلدی نہ کرنا ۔ \"\" انہوں نے کہا : کیا میں آپ کے بارے میں ، اللہ کے رسول! اپنے والدین سے مشورہ کروں گی! بلکہ میں تو اللہ ، اس کے رسول اور آخرت کے گھر کو چنتی ہوں ، اور آپ سے یہ درخواست کرتی ہو کہ جو میں نے کہا ہے ، آپ اپنی بیویوں میں سے کسی کو اس کی خبر نہ دیں ۔ آپ نے فرمایا : \"\" مجھ سے جو بھی پوچھے گی میں اسے بتا دوں گا ، اللہ تعالیٰ نے مجھے سختی کرنے والا اور لوگوں کے لیے مشکلات ڈھونڈنے والا بنا کر نہیں بھیجا ، بلکہ اللہ نے مجھے تعلیم دینے والا اور آسانی کرنے والا بنا کر بھیجا ہے",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 39
			}
		}
	]
}