{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3691,
			"arabicnumber": "1479.01",
			"text": "سماک ابوزمیل سے روایت ہے ، ( انہوں نے کہا : ) مجھے عبداللہ بن عباس رضی اللہ عنہ نے حدیث بیان کی ، ( کہا : ) مجھے عمر بن خطاب رضی اللہ عنہ نے حدیث بیان کی ، انہوں نے کہا : جب نبی صلی اللہ علیہ وسلم نے اپنی ازواج سے علیحدگی اختیار فرمائی ، کہا : میں مسجد میں داخل ہوا تو لوگوں کو دیکھا وہ ( پریشانی اور تفکر میں ) کنکریاں زمین پر مار رہے ہیں ، اور کہہ رہے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کو طلاق دے دی ہے ، یہ واقعہ انہیں پردے کا حکم دیے جانے سے پہلے کا ہے ۔ عمر رضی اللہ عنہ نے کہا : میں نے ( دل میں ) کہا : آج میں اس معاملے کو جان کر رہوں گا ۔ انہوں نے کہا : میں عائشہ رضی اللہ عنہا کے پاس گیا ، اور کہا : ابوبکر رضی اللہ عنہ کی بیٹی! تم اس حد تک پہنچ چکی ہو کہ اللہ کے رسول صلی اللہ علیہ وسلم کو اذیت دو؟ انہوں نے جواب دیا : خطاب کے بیٹے! آپ کا مجھ سے کیا واسطہ؟ آپ اپنی گھٹڑی ( یا تھیلا وغیرہ جس میں قیمتی ساز و سامان سنبھال کر رکھا جاتا ہے یعنی اپنی بیٹی حفصہ رضی اللہ عنہا ) کی فکر کریں ۔ انہوں نے کہا : پھر میں ( اپنی بیٹی ) حفصہ بنت عمر رضی اللہ عنہا کے پاس آیا اور کہا : حفصہ! کیا تم اس حد تک پہنچ گئی ہو کہ اللہ کے رسول صلی اللہ علیہ وسلم کو تکلیف دو؟ اللہ کی قسم! تمہیں خوب معلوم ہے کہ اللہ کے رسول صلی اللہ علیہ وسلم تم سے محبت نہیں رکھتے ۔ اگر میں نہ ہوتا تو رسول اللہ صلی اللہ علیہ وسلم تمہیں طلاق دے دیتے ۔ ( میری یہ بات سن کر ) وہ بری طرح سے رونے لگیں ۔ میں نے ان سے پوچھا : اللہ کے رسول صلی اللہ علیہ وسلم کہاں ہیں؟ انہوں نے جواب دیا : وہ اپنے بالا خانے پر سامان رکھنے والی جگہ میں ہیں ۔ میں وہاں گیا تو دیکھا رسول اللہ صلی اللہ علیہ وسلم کا غلام رَباح چوبارے کی چوکھٹ کے نیچے والی لکڑی پر بیٹھا ہے ۔ اس نے اپنے دونوں پاؤں لکڑی کی سوراخ دار سیڑھی پر لٹکا رکھے ہیں ۔ وہ کھجور کا ایک تنا تھا ، رسول اللہ صلی اللہ علیہ وسلم اس پر ( قدم رکھ کر ) چڑھتے اور اترتے تھے ۔ میں نے آواز دی ، رباح! مجھے اپنے پاس ، رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ، حاضر ہونے کی اجازت لے دو ۔ رباح رضی اللہ عنہ نے بالا خانے کی طرف نظر کی ، پھر مجھے دیکھا اور کچھ نہ کہا ۔ میں نے پھر کہا : رباح! مجھے اپنے پاس ، رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ، حاضر ہونے کی اجازت لے دو ، رباح رضی اللہ عنہ نے ( دوبارہ ) بالا خانے کی طرف نگاہ اٹھائی ، پھر مجھے دیکھا ، اور کچھ نہ کہا ، پھر میں نے اپنی آواز کو بلند کی اور کہا : اے رباح! مجھے اپنے پاس ، رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ، حاضر ہونے کی اجازت لے دو ، میرا خیال ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے سمجھا ہے کہ میں حفصہ رضی اللہ عنہا کی ( سفارش کرنے کی ) خاطر آیا ہوں ، اللہ کی قسم! اگر رسول اللہ صلی اللہ علیہ وسلم مجھے اس کی گردن اڑانے کا حکم دیں تو میں اس کی گردن اڑا دوں گا ، اور میں نے اپنی آواز کو ( خوب ) بلند کیا ، تو اس نے مجھے اشارہ کیا کہ اوپر چڑھ آؤ ۔ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، آپ ایک چٹائی پر لیٹے ہوئے تھے ، میں بیٹھ گیا ، آپ نے اپنا ازار درست کیا اور آپ ( کے جسم ) پر اس کے علاوہ اور کچھ نہ تھا اور چٹائی نے آپ کے جسم پر نشان ڈال دیے تھے ۔ میں نے اپنی آنکھوں سے رسول اللہ صلی اللہ علیہ وسلم کے سامان کے کمرے میں دیکھا تو صرف مٹھی بھر جو ایک صاع کے برابر ہوں گے ، جَو اور کمرے کے ایک کونے میں اتنی ہی کیکر کی چھال دیکھی ۔ اس کے علاوہ ایک غیر دباغت شدہ چمڑا لٹکا ہوا تھا ۔ کہا : تو میری آنکھیں بہ پڑیں ، آپ صلی اللہ علیہ وسلم نے پوچھا : \" ابن خطاب! تمہیں رُلا کیا چیز رہی ہے؟ \" میں نے عرض کی : اللہ کے نبی! میں کیوں نہ روؤں؟ اس چٹائی نے آپ کے جسم اطہر پر نشان ڈال دیے ہیں ، اور یہ آپ کا سامان رکھنے کا کمرہ ہے ، اس میں وہی کچھ ہے جو مجھے نظر آرہا ہے ، اور قیصر و کسری نہروں اور پھلوں کے درمیان ( شاندار زندگی بسر کر رہے ) ہیں ، جبکہ آپ تو اللہ کے رسول اور اس کی چنی ہوئی ہستی ہیں ، اور یہ آپ کا سارا سامان ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ابن خطاب! کیا تمہیں پسند نہیں کہ ہمارے لیے آخرت ہو اور ان کے لیے دنیا ہو؟ \" میں نے عرض کی : کیوں نہیں! کہا : جب میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تھا تو آپکے چہرے پر غصہ دیکھ رہا تھا ، میں نے عرض کی : اللہ کے رسول! آپ کو ( اپنی ) بیویوں کی حالت کی بنا پر کیا دشواری ہے؟ اگر آپ نے انہیں طلاق دے دی ہے تو اللہ آپ کے ساتھ ہے ، اس کے فرشتے ، جبرئیل ، میکائیل ، میں ، ابوبکر اور تمام مومن آپ کے ساتھ ہیں ۔ اور میں اللہ کا شکر ادا کرتا ہوں کہ میں نے کم ہی کوئی بات کہی ، مگر میں نے امید کی کہ اللہ میری اس بات کی تصدیق فرما دے گا جو میں کہہ رہا ہوں ۔ ( چنانچہ ایسے ہی ہوا ) اور یہ تخییر کی آیت نازل ہو گئی : \" اگر وہ ( نبی ) تم سب ( بیویوں ) کو طلاق دے دیں تو قریب ہے کہ ان کا رب ، انہیں تم سے بہتر بیویاں بدلے میں دے ۔ \" اور \" اگر تم دونوں ان کے خلاف ایک دوسرے کی مدد کرو گی ، تو اللہ خود ان کا نگہبان ہے ، اور جبریل اور صالح مومن اور اس کے بعد تمام فرشتے ( ان کے ) مددگار ہیں ۔ \" عائشہ بنت ابی بکر اور حفصہ رضی اللہ عنہن دونوں نبی صلی اللہ علیہ وسلم کی تمام بیویوں کے مقابلے میں ایک دوسرے کا ساتھ دیتی تھیں ۔ میں نے عرض کی : اے اللہ کے رسول! کیا آپ نے ان کو طلاق دے دی ہے؟ آپ نے فرمایا : \" نہیں ۔ \" میں نے عرض کی : اے اللہ کے رسول! میں مسجد میں داخل ہوا تھا تو لوگ کنکریاں زمین پر مار رہے تھے ، اور کہہ رہے تھے : اللہ کے رسول صلی اللہ علیہ وسلم نے اپنی بیویوں کو چلاق دے دی ہے ۔ کیا میں اتر کر انہیں بتا دوں کہ آپ نے ان ( بیویوں ) کو طلاق نہیں دی؟ آپ نے فرمایا : \" ہاں ، اگر چاہو ۔ \" میں مسلسل آپ سے گفتگو کرتا رہا یہاں تک کہ آپ کے چہرے سے غصہ دور ہو گیا ، اور یہاں تک کہ آپ کے لب وار ہوئے اور آپ ہنسے ۔ آپ کے سامنے والے دندانِ مبارک سب انسانوں سے زیادہ خوبصورت تھے ۔ پھر اللہ کے نبی صلی اللہ علیہ وسلم ( بالا خانے سے نیچے ) اترے ۔ میں تنے کو تھامتے ہوئے اترا اور رسول اللہ صلی اللہ علیہ وسلم ایسے اترے جیسے زمین پر چل رہے ہوں ، آپ نے تنے کو ہاتھ تک نہ لگایا ۔ میں نے عرض کی : اللہ کے رسول! آپ بالا خانے میں 29 دن رہے ہیں ۔ آپ نے فرمایا : \" مہینہ 29 دن کا ہوتا ہے ۔ \" چنانچہ میں مسجد کے دروازے پر کھڑا ہوا ، اور بلند آواز سے پکار کر کہا : رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کو طلاق نہیں دی ، اور ( پھر ) یہ آیت نازل ہوئی : \" اور جب ان کے پاس امن یا خوف کی کوئی خبر آتی ہے تو اسے مشہور کر دیتے ہیں ، اور اگر وہ اسے رسول اللہ صلی اللہ علیہ وسلم کی طرف اور اپنے معاملات سنبھالنے والوں کی طرف لوٹا دیتے ، تو وہ لوگ جو ان میں اس سے اصل مطلب اخذ کرتے ہیں اسے ضرور جان لیتے ۔ \" تو میں ہی تھا جس نے اس معاملے کی اصل حقیقت کو اخذ کیا ، اور اللہ تعالیٰ نے تخییر کی آیت نازل فرمائی",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 40
			}
		}
	]
}