{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3704,
			"arabicnumber": "1480.08",
			"text": "معمر نے ہمیں زہری سے خبر دی ، انہوں نے عبیداللہ بن عبداللہ بن عتبہ سے روایت کی کہ ابو عمرو بن حفص بن مغیرہ رضی اللہ عنہ حضرت علی بن ابی طالب رضی اللہ عنہ کے ساتھ یمن کی جانب گئے اور اپنی بیوی فاطمہ بنت قیس رضی اللہ عنہا کو اس کی ( تین ) طلاقوں میں سے جو طلاق باقی تھی بھیج دی ، اور انہوں نے ان کے بارے میں ( اپنے عزیزوں ) حارث بن ہشام اور عیاش بن ابی ربیعہ سے کہا کہ وہ انہیں خرچ دیں ، تو ان دونوں نے ان ( فاطمہ ) سے کہا : اللہ کی قسم! تمہارے لیے کوئی خرچ نہیں الا یہ کہ تم حاملہ ہوتی ۔ وہ نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور آپ کو ان دونوں کی بات بتائی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمہارے لیے خرچ نہیں ( بنتا ۔ ) \" انہوں نے آپ سے نقل مکانی کی اجازت چاہی تو آپ نے انہیں اجازت دے دی ۔ انہوں نے پوچھا : اللہ کے رسول! کہاں؟ فرمایا : \" ابن ام مکتوم کے ہاں ۔ \" وہ نابینا تھے ، وہ ان کے سامنے اپنے ( اوڑھنے کے ) کپڑے اتارتیں تو وہ انہیں دیکھ نہیں سکتے تھے ۔ جب ان کی عدت پوری ہوئی تو نبی صلی اللہ علیہ وسلم نے ان کا نکاح اسامہ بن زید رضی اللہ عنہ سے کر دیا ۔ اس کے بعد مروان نے اس حدیث کے بارے میں دریافت کرنے کے لیے قبیصہ بن ذؤیب کو ان کے پاس بھیجا تو انہوں نے اسے یہ حدیث بیان کی ، اس پر مروان نے کہا : ہم نے یہ حدیث صرف ایک عورت سے سنی ہے ، ہم تو اسی مقبول طریقے کو تھامے رکھیں گے جس پر ہم نے تمام لوگوں کو پایا ہے ۔ جب فاطمہ رضی اللہ عنہا کو مروان کی یہ بات پہنچی تو انہوں نے کہا : میرے اور تمہارے درمیان قرآن فیصل ہے ۔ اللہ تعالیٰ نے فرمایا : \" تم انہیں ان کے گھروں سے مت نکالو ۔ \" آیت مکمل کی ۔ انہوں نے کہا : یہ آیت تو ( جس طرح اس کے الفاظ ( لَعَلَّ ٱللَّـهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا ) ( الطلاق 1 : 65 ) سے ظاہر ہے ) اس ( شوہر ) کے لیے ہوئی جسے رجوع کا حق حاصل ہے ، اور تیسری طلاق کے بعد از سر نو کون سی بات پیدا ہو سکتی ہے؟ اور تم یہ بات کیسے کہتے ہو کہ اگر وہ حاملہ نہیں ہے تو اس کے لیے خرچ نہیں ہے؟ پھر تم اسے روکتے کس بنا پر ہو",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 52
			}
		}
	]
}