{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"19": "The Book of Invoking Curses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3746,
			"arabicnumber": "1493.01",
			"text": "سعید بن جبیرؓ سے روایت ہے مجھ سے پوچھا گیا لعان کرنے والوں کا مسئلہ مصعب بن زبیر کی خلافت میں میں حیران ہوا کیا جواب دوں تو میں چلا عبداﷲ بن عمرؓ کے مکان کی طرف مکہ میں او ران کے غلام سے کہا میری عرض کرو اس نے کہا وہ آرام کرتے ہیں انہوں نے میری آواز سنی او رکہا کیا جبیر کا بیٹا ہے؟ میں نے کہا ہاں انہوں نے کہا اندر آ قسم خدا کی تو کسی کام سے آیا ہوگا میں اندر آگیا تو وہ ایک کمبل بچھائے بیٹھے تھے او رایک تکیے پر ٹیک لگائے تھے جو چھال سے کھجور کی بھرا ہوا تھا ۔ میں نے کہا اے ابوعبدالرحمن! لعان کرنے والوں میں جدائی کی جائے گی؟ انہوں نے کہا سبحان اﷲ بے شک جدائی کی جائے گی اور سب سے پہلے اس باب میں فلاں نے پوچھا جو فلاں کا بیٹا تھا رسول اﷲ ﷺ سے ۔ اس نے کہا یا رسول اﷲ آپ کیا سمجھتے ہیں اگر ہم میں سے کوئی اپنی عورت کو برا کام کراتے دیکھے تو کیا کرے ، اگر منہ سے نکالے تو بری بات نکالے گا اگر چپ رہے تو ایسی بری بات سے کیونکر چپ رہے؟ رسول اﷲ ﷺ یہ سن کر چپ ہورہے اور جواب نہیں دیا ۔ پھر وہ شخص آپ کے پاس آیا اور کہنے لگا یا رسول اﷲ ۔ جو بات میں نے آپ سے پوچھی تھی میں خود اس میں پڑگیا ۔ تب اﷲ تعالیٰ نے یہ آیتیں اتاریں سورۂ نور میں والذین یرمون ازواجھم آخر تک ۔ آپ نے یہ آیتیں مرد کو پڑھ کر سنائیں اور اس کو نصیحت کی اور سمجھایا کہ دنیا کا عذاب آخرت کے عذاب سے آسان ہے ۔ ( یعنی اگر تو جھوٹ طوفان باندھتا ہے تو اب بھی بول دے ، حد قذف کے اسی کوڑے پڑجائیں گے ، مگر یہ جہنم میں جلنے سے آسان ہے ) ۔ وہ بولا نہیں قسم اس کی جس نے آپ کو سچائی کے ساتھ بھیجا میں نے عورت پر طوفان نہیں جوڑا ۔ پھر آپ نے عوت کو بلایااوراس کو ڈرایا اور سمجھایا اور فرمایا دنیا کا عذاب سہل ہے آخرت کے عذاب سے ۔ وہ بولی نہیں قسم اس کی جس نے آپ کو سچائی کیس اتھ بھیجا ہے میرا خاوند جھوٹ بولتا ہے ۔ تب آپ نے شروع کیا مرد سے اور اس نے چار گواہیاں دیں اﷲ تعالیٰ کے نام کی مقرر وہ سچا ہے اور پانچویں بار میں یہ کہا کہ خدا کی پھٹکار ہو اس پر اگر وہ جھوٹا ہو ۔ پھر عورت کو بلایا اس نے چار گواہیاں دیں اﷲ تعالیٰ کے نام کی مقرر مرد جھوٹا ہے اور پانچویں بار میں یہ کہا اﷲ کا غضب اترے اس پر اگر مرد سچا ہے ۔ اس کے بعد آپ نے جدائی کرادی ان دونوں میں ۔",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		}
	]
}