{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4264,
			"arabicnumber": "1649.02",
			"text": "بُرید نے ابوبردہ سے اور انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میرے ساتھیوں نے مجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیجا تاکہ میں آپ سے ان کے لیے سواریاں مانگوں ، ( یہ اس موقع کی بات ہے ) جب وہ آپ کے ساتھ جیش العسرۃ میں تھے ۔ ۔ اور اس سے مراد غزوہ تبوک ہے ۔ ۔ تو میں نے عرض کی : اللہ کے نبی! میرے ساتھیوں نے مجھے آپ کے پاس بھیجا ہے تاکہ آپ انہیں سواریاں دیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ کی قسم! میں تمہیں کسی چیز پر سوار نہیں کروں گا ۔ \"\" اور میں ایسے وقت آپ کے پاس گیا تھا کہ آپ غصے میں تھے اور مجھے معلوم نہ تھا ۔ میں رسول اللہ صلی اللہ علیہ وسلم کے انکار کی وجہ سے اور اس ڈر سے کہ آپ اپنے دل میں مجھ سے ناراض ہو گئے ہیں ، غمگین واپس ہوا ۔ میں اپنے ساتھیوں کے پاس واپس آیا اور جو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ، انہیں بتایا ۔ میں نے ایک چھوٹی سی گھڑی ہی گزاری ہو گی کہ اچانک میں نے بلال رضی اللہ عنہ کو سنا ، وہ پکار رہے تھے : اے عبداللہ بن قیس! میں نے انہیں جواب دیا تو انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو جاؤ ، وہ تمہیں بلا رہے ہیں ۔ جب میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" یہ دو اکٹھے بندھے ہوئے اونٹ لے لو ، یہ جوڑا اور یہ جوڑا بھی لے لو ۔ ۔ چھ اونٹوں کی طرف اشارہ کیا جو آپ نے اسی وقت حضرت سعد رضی اللہ عنہ سے خریدے تھے ۔ ۔ اور انہیں اپنے ساتھیوں کے پاس لے جاؤ اور کہو : اللہ تعالیٰ ۔ ۔ یا فرمایا : رسول اللہ صلی اللہ علیہ وسلم ۔ ۔ تمہیں یہ سواریاں مہیا کر رہے ہیں ، ان پر سواری کرو ۔ \"\" حضرت ابو موسیٰ رضی اللہ عنہ نے کہا : میں انہیں لے کر اپنے ساتھیوں کے پاس گیا اور کہا : بلاشبہ رسول اللہ صلی اللہ علیہ وسلم تمہیں ان پر سوار کر رہے ہیں لیکن اللہ کی قسم! میں اس وقت تک تمہیں نہیں چھوڑوں گا یہاں تک کہ تم میں سے کوئی میرے ساتھ اس آدمی کے پاس جائے جس نے اس وقت رسول اللہ صلی اللہ علیہ وسلم کی بات سنی تھی جب میں نے آپ سے تمہارے لیے سوال کیا تھا ، اور پہلی مرتبہ آپ کے منع کرنے اور اس کے بعد مجھے عطا کرنے کی بات بھی سنی تھی ، مبادا تم سمجھو کہ میں نے تمہیں ایسی بات بتائی ہے جو آپ نے نہیں فرمائی ۔ تو انہوں نے مجھ سے کہا : اللہ کی قسم! آپ ہمارے نزدیک سچے ہیں اور جو آپ کو پسند ہے وہ بھی ہم ضرور کریں گے ، چنانچہ حضرت ابو موسیٰ رضی اللہ عنہ ان میں سے چند لوگوں کو ساتھ لے کر چل پڑے یہاں تک کہ ان لوگوں کے پاس آئے جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کی بات اور آپ کے انکار کرنے کے بعد عطا کرنے کے بارے میں خود سنا تھا ۔ انہوں نے بالکل وہی بات کی جو حضرت ابو موسیٰ رضی اللہ عنہ نے ( اپنے ) لوگوں کو بتائی تھی ۔ فائدہ : اس حدیث میں واقعے کے پہلے حصے کی زیادہ تفصیل بیان کی گئی ہے جبکہ آخری حصے کی تفصیل پچھلی حدیث میں ہے ۔ حضرت ابوموسیٰ رضی اللہ عنہ کو ساتھیوں نے بھیجا ، رسول اللہ صلی اللہ علیہ وسلم نے انہیں جواب دیا ، پھر بلا کر اونٹ عطا فرمائے ، پھر یہ لوگ ان لوگوں کے پاس گئے جو سارے واقعے کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے موجود تھے ، پھر یہ حضرات رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور قسم والی بات بتائی ۔ اس پر آپ نے وہی جواب دیا جو پہلی حدیث میں مذکور ہے",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		}
	]
}