{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4265,
			"arabicnumber": "1649.03",
			"text": "حماد بن زید نے ہمیں ایوب سے حدیث بیان کی ، انہوں نے ابوقلابہ اور قاسم بن عاصم سے اور انہوں نے زَہدم جرمی سے روایت کی ۔ ۔ ایوب نے کہا : ابوقلابہ کی حدیث کی نسبت مجھے قاسم کی حدیث زیادہ یاد ہے ۔ ۔ انہوں ( زہدم ) نے کہا : ہم حضرت ابو موسیٰ رضی اللہ عنہ کے پاس تھے ، انہوں نے اپنا دسترخوان منگوایا جس پر مرغی کا گوشت تھا ، اتنے میں بنو تیمِ اللہ میں سے ایک آدمی اندر داخل ہوا ، وہ سرخ رنگ کا موالی جیسا شخص تھا ، تو انہوں نے اس سے کہا : آؤ ۔ وہ ہچکچایا تو انہوں نے کہا : آؤ ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس ( مرغی کے گوشت ) میں سے کھاتے ہوئے دیکھا ہے ۔ اس آدمی نے کہا : میں نے اسے کوئی ایسی چیز کھاتے ہوئے دیکھا تھا جس سے مجھے اس سے گھن آئی تو میں نے قسم کھائی تھی کہ میں اس ( کے گوشت ) کو کبھی نہیں کھاؤں گا ۔ اس پر انہوں نے کہا : آؤ ، میں تمہیں اس کے بارے میں حدیث سناتا ہوں ، میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، میں اشعریوں کے ایک گروہ کے ساتھ تھا ، ہم آپ سے سواریوں کے طلبگار تھے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی قسم! میں تمہیں سواری مہیا نہیں کروں گا اور نہ میرے پاس کوئی ایسی چیز ہے جس پر میں تمہیں سوار کروں ۔ \" جتنا اللہ نے چاہا ہم رکے ، پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس ( کافروں سے ) چھینے ہوئے اونٹ ( جو آپ نے سعد رضی اللہ عنہ سے خرید لیے تھے ) لائے گئے تو آپ نے ہمیں بلوایا ، آپ نے ہمیں سفید کوہان والے پانچ ( یا چھ ، حدیث : 4264 ) اونٹ دینے کا حکم دیا ۔ کہا : جب ہم چلے ، تو ہم میں سے کچھ لوگوں نے دوسروں سے کہا : ( غالبا ) ہم نے رسول اللہ صلی اللہ علیہ وسلم کو اپنی قسم سے غافل کر دیا ، ہمیں برکت نہ دی جائے گی ، چنانچہ ہم واپس آپ کی خدمت میں حاضر ہوئے اور عرض کی : اے اللہ کے رسول! ہم آپ کی خدمت میں سواریاں لینے کے لیے حاضر ہوئے تھے اور آپ نے ہمیں سواری نہ دینے کی قسم کھائی تھی ، پھر آپ نے ہمیں سواریاں دے دی ہیں تو اللہ کے رسول! کیا آپ بھول گئے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی قسم! اللہ کی مشیت سے میں جب بھی کسی چیز پر قسم کھاتا ہوں ، پھر اس کے علاوہ کسی اور کام کو اس سے بہتر خیال کرتا ہوں تو وہی کام کرتا ہوں جو بہتر ہے اور ( قسم کا کفارہ ادا کر کے ) اس کا بندھن کھول دیتا ہوں ۔ تم جاؤ ، تمہیں اللہ عزوجل نے سوار کیا ہے",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		}
	]
}