{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4349,
			"arabicnumber": "1669.08",
			"text": "ابولیلیٰ بن عبداللہ بن عبدالرحمان بن سہل ( بن زید انصاری ) نے سہل بن ابی حثمہ ( انصاری ) سے حدیث بیان کی ، انہوں نے انہیں ان کی قوم کے بڑی عمر کے لوگوں سے خبر دی کہ عبداللہ بن سہل اور محیصہ اپنی تنگدستی کی بنا پر جو انہیں لاحق ہو گئی تھی ، ( تجارت وغیرہ کے لیے ) خیبر کی طرف نکلے ، بعد ازاں محیصہ آئے اور بتایا کہ عبداللہ بن سہل قتل کر دیے گئے ہیں اور انہیں کسی چشمے یا پانی کے کچے کنویں ( فقیر ) میں پھینک دیا گیا ، چنانچہ وہ یہود کے پاس آئے اور کہا : اللہ کی قسم! تم لوگوں نے ہی انہیں قتل کیا ہے ۔ انہوں نے کہا : اللہ کی قسم! ہم نے انہیں قتل نہیں کیا ، پھر وہ آئے حتی کہ اپنی قوم کے پاس پہنچے اور ان کو یہ بات بتائی ، پھر وہ خود ، ان کے بھائی حویصہ ، اور وہ ان سے بڑے تھے ، اور عبدالرحمان بن سہل ( رسول اللہ صلی اللہ علیہ وسلم کے پاس ) آئے ، محیصہ نے گفتگو شروع کی اور وہی خیبر میں موجود تھے تو رسول اللہ صلی اللہ علیہ وسلم نے محیصہ سے فرمایا : \"\" بڑے کو بات کرنے دو ، بڑے کو موقع دو \"\" آپ کی مراد عمر ( میں بڑے ) سے تھی ، تو حویصہ نے بات کی ، اس کے بعد محیصہ نے بات کی ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" یا وہ تمہارے ساتھی کی دیت دیں یا پھر جنگ کا اعلان کریں ۔ \"\" رسول اللہ صلی اللہ علیہ وسلم نے اس سلسلے میں ان کی طرف خط لکھا ، تو انہوں نے ( جوابا ) لکھا : اللہ کی قسم! ہم نے انہیں قتل نہیں کیا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے حویصہ ، محیصہ اور عبدالرحمان سے فرمایا : \"\" کیا تم قسم کھا کر اپنے ساتھی کے خون ( کا بدلہ لینے ) کے حقدار بنو گے؟ \"\" انہوں نے کہا : نہیں ۔ آپ نے پوچھا : \"\" تو تمہارے سامنے یہود قسمیں کھائیں؟ \"\" انہوں نے جواب دیا : وہ مسلمان نہیں ہیں ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے اپنے پاس سے اس کی دیت ادا کر دی ، رسول اللہ صلی اللہ علیہ وسلم نے ایک سو اونٹنیاں ان کی طرف روانہ کیں حتی کہ ان کے گھر ( باڑے ) پہنچا دی گئیں ۔ سہل نے کہا : ان میں سے ایک سرخ اونٹنی نے مجھے لات ماری تھی",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 8
			}
		}
	]
}