{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4522,
			"text": "نیز عبداللہ بن ہاشم نے کہا ۔ ۔ الفاظ انہی کے ہیں ۔ ۔ مجھے عبدالرحمٰن بن مہدی نے حدیث بیان کی ، کہا : ہمیں سفیان نے علقمہ بن مرثد سے حدیث بیان کی ، انہوں نے سلیمان بن بریدہ سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جب کسی بڑے لشکر یا چھوٹے دستے پر کسی کو امیر مقرر کرتے تو اسے خاص اس کی اپنی ذات کے بارے میں اللہ سے ڈرنے کی اور ان تمام مسلمانوں کے بارے میں ، جو اس کے ساتھ ہیں ، بھلائی کی تلقین کرتے ، پھر فرماتے : \"\" اللہ کے نام سے اللہ کی راہ میں جہاد کرو ، جو اللہ تعالیٰ سے کفر کرتے ہیں ان سے لڑو ، نہ خیانت کرو ، نہ بد عہدی کرو ، نہ مثلہ کرو اور نہ کسی بچے کو قتل کرو اور جب مشرکوں میں سے اپنے دشمن سے ٹکراؤ تو انہیں تین باتوں کی طرف بلاؤ ، ان میں سے جسے وہ تسلیم کر لیں ، ( اسی کو ) ان کی طرف سے قبول کر لو اور ان ( پر حملے ) سے رک جاؤ ، انہیں اسلام کی دعوت دو ، اگر وہ مان لیں تو اسے ان ( کی طرف ) سے قبول کر لو اور ( جنگ سے ) رک جاؤ ، پھر انہیں اپنے علاقے سے مہاجرین کے علاقے میں آ جانے کی دعوت دو اور انہیں بتاؤ کہ اگر وہ ایسا کریں گے تو ان کے لیے وہی حقوق ہوں گے جو مہاجرین کے ہیں اور ان پر وہی ذمہ دریاں ہوں گی جو مہاجرین پر ہیں ۔ اگر وہ وہاں سے نقل مکانی کرنے پر انکار کریں تو انہیں بتاؤ کہ پھر وہ بادیہ نشیں مسلمانوں کی طرح ہوں گے ، ان پر اللہ کا وہی حکم نافذ ہو گا جو مومنوں پر نافذ ہوتا ہے اور غنیمت اور فے میں سے ان کے لیے کچھ نہ ہو گا مگر اس صورت میں کہ وہ مسلمانوں کے ساتھ مل کر جہاد کریں ۔ اگر وہ انکار کریں تو ان سے جزیے کا مطالبہ کرو ، اگر وہ تسلیم کر لیں تو ان کی طرف سے قبول کر لو اور رک جاؤ اور اگر وہ انکار کریں تو اللہ سے مدد مانگو اور ان سے لڑو اور جب تم کسی قلعے ( میں رہنے ) والوں کا محاصرہ کرو اور وہ تم سے چاہیں کہ تم انہیں اللہ اور اس کے نبی کا عہدوپیمان عطا کرو تو انہیں اللہ اور اس کے نبی کا عہدوپیمان نہ دو بلکہ اپنی اور اپنے ساتھیوں کی طرف سے عہد و امان دو ، کیونکہ یہ بات کہ تم لوگ اپنے اور اپنے ساتھیوں کے عہدوپیمان کی خلاف ورزی کر بیٹھو ، اس کی نسبت ہلکی ہے کہ تم اللہ اور اس کے رسول صلی اللہ علیہ وسلم کا عہدوپیمان توڑ دو ۔ اور جب تم قلعہ بند لوگوں کا محاصرہ کرو اور وہ تم سے چاہیں کہ تم انہیں اللہ کے حکم پر ( قلعے سے ) نیچے اترنے دو تو انہیں اللہ کے حکم پر نیچے نہ اترنے دو بلکہ اپنے حکم پر انہیں نیچے اتارو کیونکہ تمہیں معلوم نہیں کہ تم ان کے بارے میں اللہ کے صحیح حکم پر پہنچ پاتے ہو یا نہیں ۔ \"\" ( ابن ہشام نے کہا : ) عبدالرحمان نے یہی کہا یا اسی طرح کہا ۔ اسحا نے اپنی حدیث کے آخر میں یہ اضافہ کیا : یحییٰ بن آدم سے روایت ہے کہ ( علقمہ نے ) کہا : میں نے یہ حدیث مقاتل بن حیان سے بیان کی ۔ ۔ یحییٰ نے کہا : یعنی علقمہ نے ابن حیان سے بیان کی ۔ ۔ تو انہوں نے کہا : مجھے مسلم بن ہیصم نے حضرت نعمان بن مقرن رضی اللہ عنہ کے واسطے سے نبی صلی اللہ علیہ وسلم سے اسی طرح حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}