{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 454,
			"arabicnumber": "183.01",
			"text": "حفص بن میسرہ نے زید بن اسلم سے ، انہوں نے عطاء بن یسار سے اور انہوں نے حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی کہ کچھ لوگوں نے رسول اللہ ﷺ کے عہد میں ( آپ سے ) عرض کی : اے اللہ کے رسول ! کیاہم قیامت کے دن اپنےرب کو دیکھیں گے؟ رسول اللہ ﷺ نے فرمایا : ’’ہاں ۔ ‘ ‘ ( ہاں ) فرمایا : ’’ کیا دو پہر کے وقت صاف مطلع ہیں ، جب ابر نہ ہوں ، سورج کو دیکھتے ہوئے تمہیں کوئی زحمت ہوتی ہے ؟ اور کیا پورے چاند کی رات کو جب مطلع صاف ہو اور ابر نہ ہوں تو چاند کو دیکھنے میں کوئی تکلیف محسوس کرتے ہو ؟ ‘ ‘ صحابہ نے کہا : اللہ کےرسول نہیں ! فرمایا : ’’ قیامت کے روز اللہ تبارک و تعالیٰ کو دیکھنے میں اس سے زیادہ دقت نہ ہوگی جتنی ان دونوں میں سے کسی ایک کو دیکھنے میں ہوتی ہے ۔ جب قیامت کا دن ہو گا ، ایک اعلان کرنے والا یہ اعلان کرے گا : ہر امت اس کے پیچھے چلے جس کی وہ عبادت کیا کرتی تھی ۔ کوئی آدمی ایسا نہ بچے گا جو اللہ کے سوابتوں اور پتھروں کو پوجتا تھا مگر وہ آ گ میں جا گرے گا حتی کہ جب ان کے سوا جو اللہ کی عبادت کرتے تھے ، وہ نیک ہوں یا بد ، اور اہل کتاب کے بقیہ ( بعد کے دور ) لوگوں کےسوا کوئی نہ بچے گا تو یہود کو بلایا جائے گا او ران سے کہا جائے گا : تم کس کی عبادت کرتے تھے؟ وہ کہیں گے : ہم اللہ کے بیٹے عزیر کی عبادت کرتے تھے تو کہا جائے گا : تم نے جھوٹ بولا ، اللہ تعالیٰ نے نہ کوئی بوی بنائی نہ بیٹا ، تو ( اب ) کیا چاہتے ہو ؟کہیں گے : پروردگار ! ہمیں پیاس لگی ہے ہمیں پانی پلا ۔ تو ان کو اشارہ کیا جائے گاکہ تم پانی ( کے گھاٹ ) پر کیوں نہیں جاتے ؟ پھر ا نہیں اکٹھا کر کے آگ کی طرف ہانک دیا جائے گا ، وہ سراب کی طرح ہو گی ، اس کا ایک حصہ دوسرے حصے کو توڑ رہا ہو گا اوروہ سب ( ایک دوسرے کے پیچھے ) آگ میں گرتے چلے جائیں گے ، پھر نصاریٰ کو بلایا جائے گا او ران سے کہاجائے گا : تم کس کی عبادت کرتے تھے؟ وہ کہیں گے : ہم اللہ کے بیٹے مسیح کو پوجتے تھے ۔ ان سے کہا جائے گا : تم جھوٹ بولتے ہو ، اللہ نے نہ کوئی بیوی بنائی نہ کوئی بیٹا ، پھر ان سے کہا جائے گا! ( اب ) تم کیا چاہتے ہو؟ وہ کہیں گے : ہم پیاسے ہیں ہمارے پروردگار ! ہمیں پانی پلا ، آپ نے فرمایا : ان کواشارہ کیا جائے گا ، تم پانی ( کے گھاٹ ) پر کیوں نہیں جاتے ؟ پھر انہیں اکٹھا کر کے جہنم کی طرف ہانکا جائے گا ، وہ سراب کی طرح ہو گی ( اور ) اس کا ایک حصہ ( شدت اشتعال سے ) دوسرے کو توڑ رہا ہو گا ، وہ ( ایک دوسرے کے پیچھے ) آگ میں گرتے چلے جائیں گے ، حتی کہ جب ان کے سوا کوئی نہ بچے گا جو اللہ تعالیٰ ( ہی ) کی عبادت کرتے تھے ، نیک ہوں یا بد ، ( تو ) سب جہانوں کا رب سبحان و تعالیٰ ان کی دیکھی ہوئی صورت سے کم تر ( یا مختلف ) صورت میں آئے گا ( اور ) فرمائے گا : تم کس چیز کا انتظار کر رہے ہو ؟ ہر امت اس کے پیچھے جا رہی ہے جس کی وہ عبادت کرتی تھی ، وہ ( سامنے ظاہر ہونے والی صورت کے بجائے اپنے پروردگار کی طرف متوجہ ہو کر ) التجا کریں گے : اےہمارے رب ! ہم دنیا میں سب لوگوں سے ، جتنی شدید بھی ہمیں ان کی ضرورت تھی ، الگ ہو گئے ، ہم نے ان کاساتھ نہ دیا ۔ وہ کہے گا : میں تمہارا رب ہوں ، وہ کہیں گے : ہم تم سے اللہ کی پناہ میں آتے ہیں ، ہم اللہ کے ساتھ کسی کو شریک نہیں ٹھہرائیں گے ( دو یا تین دفعہ یہی کہیں گے ) یہاں تک کہ ان میں بعض لوگ بدلنے کے قریب ہو ں گے تو وہ فرمائے گا : کیا تمہارے اور اس کے درمیان کوئی نشانی ( طے ) ہے جس سے تم اس کو پہچان سکو؟ وہ جواب دیں گے : ہاں !تو پنڈلی ظاہر کر دی جائے گی پھر کوئی ایسا شخص نہ بچے گا جو اپنے دل سے اللہ کو سجدہ کرتا تھا مگر اللہ اسے سجدے کی اجازت دے گا اور کوئی ایسا نہ بچے گا جو جان بچانے کےلیے یا دکھاوے کےلیے سجدہ کرتا تھامگر اللہ تعالیٰ اس کی پشت کو ایک ہی مہر بنادے گا ، جب بھی وہ سجدہ کرنا چاہے گا اپنی گدی کے بل گر پڑے گا ، پھر وہ ( سجدے سے ) اپنے سر اٹھائیں گے اور اللہ تعالیٰ اپنی اس صورت میں آ چکا ہو گا جس میں انہوں نے اس کو ( سب سے ) پہلی مرتبہ دیکھا تھا اور وہ فرمائے گا : میں تمہارا رب ہوں ۔ تووہ کہیں گے : ( ہاں ) تو ہی ہمارا رب ہے ، پھر جہنم پر پل دیا جائے گا اور سفارش کا دروازہ کھل جائے گا ، اور ( سب رسول ) کہہ رہے ہوں گے : اے اللہ ! سلامت رکھ ، سلامت رکھ ۔ ‘ ‘ پوچھا گیا : اے اللہ کے رسول ! جسر ( پل ) کیا ہے ؟ آپ نے فرمایا : ’’ بہت پھسلنی ، ڈگمگا دینے والی جگہ ہے ، اس میں اچک لینےوالے آنکڑے اور کئی کئی نوکوں والے کنڈے ہیں اور اس میں کانٹے دار پودے ہیں جو نجد میں ہوتے ہیں جنہیں سعدان کہا جاتا ہے ۔ تو مومن آنکھ کی جھپک کی طرح اور بجلی کی طرح اور ہوا کی طرح اور پرندوں کی طرح اور تیز رفتار گھوڑوں اور سواریوں کی طرح گزر جائیں گے ، کوئی صحیح سالم نجات پانے والا ہو گا اور کوئی زخمی ہو کر چھوڑ دیا جانے والا اور کچھ جہنم کی آگ میں تہ بن تہ لگا دیے جانے والے ، یہاں تک کہ جب مومن آگ سے خلاصی پالیں گے تو اس ذات کی قسم جس کے ہاتھ میں جان ہے ! تم میں سے کوئی پورا پورا حق وصول کرنے ( کے معاملے ) میں اس قدر اللہ سے منت اور آہ وزاری نہیں کرتا جس قدر قیامت کے دن مومن اپنے ان مسلمان بھائیوں کے بارے میں کریں گے جو آگ میں ہوں گے ۔ وہ کہیں گے : اے ہمارے رب !وہ ہمارے ساتھ روزے رکھتے ، نمازیں پڑھتے اورحج کرتے تھے ۔ تو ان سے کہا جائے گا : تم جن کو پہچانتے ہو انہیں نکال لو ، ان کی صورتیں آگ پر حرام کر دی گئی ہوں گی ۔ تو وہ بہت سے لوگوں کونکال لائیں گے جن کی آدھی پنڈلیوں تک یا گھٹنوں تک آگ پکڑ چکی ہوگی ، پھر وہ کہیں گے : ہمارے رب ! جنہیں نکالنے کا تو نے حکم دیا تھا ان میں سے کوئی دوزخ میں نہیں رہا ۔ تو وہ فرمائے گا : واپس جاؤ ، جس کےدل میں دینار بھر خیر ( ایمان ) پاؤ اس کو نکال لاؤ تو وہ بڑی خلقت کو نکال لائیں گے ، پھر کہیں گے : ہمارے رب! جنہیں نکالنے کا تو نے حکم دیا تھا ان میں سے کسی کو ہم دوزخ میں نہیں چھوڑا ۔ وہ پھر فرمائے گا : واپس جاؤ ، جس کے دل میں آدھے دینار کے برابر خیر پاؤ اس کو نکال لاؤ تو وہ ( پھرسے ) بڑی خلقت کو نکال لائیں گے ، پھر وہ کہیں گے ، ہمارے رب! جنہیں نکالنے کا تو نےحکم دیا تھا ہم نے ان میں کسی کو دوزخ میں نہیں چھوڑا ۔ وہ پھر فرمائے گا : واپس جاؤ ، جس کے دل میں ایک ذرے کے برابر خیر پاؤ اس کو نکال لاؤ تووہ کثیر خلقت کو نکال لائیں گے ، پھر وہ کہیں گے : ہمارے رب ! ہم نے اس میں کسی صاحب خیر کو نہیں چھوڑا ۔ ‘ ‘ ( ایمان ایک ذرے کے برابر بھی ہوسکتا ہے ۔ ) ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ کہا کرتے تھے : اگر تم اس حدیث میں میری تصدیق نہیں کرتے تو چاہو تو یہ آیت پڑھ لو : ’’بے شک اللہ ایک ذرہ برابر ظلم نہیں کرتا اور اگر کوئی نیکی ہو تواس کو بڑھاتا ہے او راپنی طرف سے اجر عظیم دیتا ہے ۔ ‘ ‘ ’’پھر اللہ تعالیٰ فرمائے گا : فرشتوں نے سفارش کی ، اب ارحم الراحمین کے سوا کوئی باقی نہیں رہا تو وہ آ ‎گ سے ایک مٹھی بھرے گا او رایسے لوگوں کو اس میں سے نکال لے گا جنہوں نے کبھی بھلائی کا کوئی کام نہیں کیا تھا اور وہ ( جل کر ) کوئلہ ہو چکے ہوں گے ، پھر وہ انہیں جنت کے دہانوں پر ( بہنے والی ) ایک نہر میں ڈال دے گا جس کو نہر حیات کہا جاتا ہے ، وہ اس طرح ( اگ کر ) نکل آئیں گے جس طرح ( گھاس کا ) چھوٹا سا بیج سیلاب کے خس و خاشاک میں پھوٹتا ہے ، کیا تم اسے دیکھتے نہیں ہو کہ کبھی وہ پتھر کے ساتھ لگا ہوتا ہے اور کبھی درخت کے ساتھ ، جوسورج کے رخ پر ہوتا ہے وہ زرد اور سبز ہوتا ہے اور جو سائے میں ہوتا ہے وہ سفید ہوتا ہے ؟ ‘ ‘ صحابہ نے کہا : اللہ کے رسول ! ایسا لگتا ہے کہ آپ جنگل میں جانور چرایا کرتے تھے؟ آپ نے فرمایا : ’’ تووہ لوگ ( نہرسے ) موتیوں کے مانند نکلیں گے ، ان کی گردنوں میں مہریں ہو ں گی ، اہل جنت ( بعد ازاں ) ان کو ( اس طرح ) پہچانیں گے کہ یہ لوگ اللہ تعالیٰ کے آزاد کیے ہوئے ہیں ، جن کو اللہ تعالیٰ نے بغیر کسی عمل کے جو انہوں نے کیا ہو اور بغیر کسی نیکی کے جو انہوں نے آگے بھیجی ہو ، جنت میں داخل کیا ہے ۔ پھر وہ فرمائے گا : جنت میں داخل ہو جاؤ اور جو تمہیں نظر آئے وہ تمہارا ہے ، اس پر وہ کہیں گے : اےہمارے رب ! تو نے ہمیں وہ کچھ دیا ہے جو جہان والوں میں سےکسی کو نہیں دیا ۔ تو وہ فرمائے گا : تمہارے میرے پاس اس سے بڑھ کر کون سی چیز ( ہوسکتی ) ہے ؟ تو وہ فرمائے گا : میری رضا کہ اس کے بعد میں تم سے کبھی ناراض نہ ہوں گا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 359
			}
		}
	]
}