{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4603,
			"arabicnumber": "1771.01",
			"text": "ابن شہاب نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : جب مہاجرین مکہ سے مدینہ آئے تو اس حالت میں آئے کہ ان کے پاس کچھ بھی نہ تھا ، جبکہ انصار زمین اور جائدادوں والے تھے ۔ تو انصار نے ان کے ساتھ اس طرح حصہ داری کی کہ وہ انہیں ہر سال اپنے اموال کی پیداوار کا آدھا حصہ دیں گے اور یہ ( مہاجرین ) انہیں محنت و مشقت سے بے نیاز کر دیں گے ۔ حضرت انس رضی اللہ عنہ کی والدہ ، جو ام سلیم کہلاتی تھیں اور عبداللہ بن ابی طلحہ جو حضرت انس رضی اللہ عنہ کے مادری بھائی تھے ، کی بھی والدہ تھیں ۔ حضرت انس رضی اللہ عنہ کی ( انہی ) والدہ نے رسول اللہ صلی اللہ علیہ وسلم کو کھجور کے اپنے کچھ درخت دیے تھے ، رسول اللہ صلی اللہ علیہ وسلم نے وہ اپنی آزاد کردہ کنیز ، اسامہ بن زید رضی اللہ عنہ کی والدہ ، ام ایمن رضی اللہ عنہا کو عنایت کر دیے تھے ۔ ابن شہاب نے کہا : مجھے حضرت انس بن مالک رضی اللہ عنہ نے بتایا کہ جب رسول اللہ صلی اللہ علیہ وسلم اہل خیبر کے خلاف جنگ سے فارغ ہوئے اور مدینہ واپس آئے تو مہاجرین نے انصار کو ان کے وہ عطیے واپس کر دیے جو انہوں نے انہیں اپنے پھلوں ( کھیتوں باغوں ) میں سے دیے تھے ۔ کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے میری والدہ کو ان کے کھجور کے درخت واپس کر دیے اور ام ایمن رضی اللہ عنہا کو رسول اللہ صلی اللہ علیہ وسلم نے ان کی جگہ اپنے باغ میں سے ( ایک حصہ ) عطا فرما دیا ۔ ابن شہاب نے کہا : اسامہ بن زید رضی اللہ عنہ کی والدہ ام ایمن رضی اللہ عنہا کے حالات یہ ہیں کہ وہ ( رسول اللہ صلی اللہ علیہ وسلم کے والد گرامی ) عبداللہ بن عبدالمطلب کی کنیز تھیں ، اور وہ حبشہ سے تھیں ، اپنے والد کی وفات کے بعد جب حضرت آمنہ کے ہاں رسول اللہ صلی اللہ علیہ وسلم کی ولادت با سعادت ہوئی تو ام ایمن رضی اللہ عنہا آپ کو گود میں اٹھاتیں اور آپ کی پرورش میں شریک رہیں یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم بڑے ہو گئے تو آپ نے انہیں آزاد کر دیا ، پھر زید بن حارثہ رضی اللہ عنہ سے ان کا نکاح کرا دیا ، وہ رسول اللہ صلی اللہ علیہ وسلم کی وفات سے پانچ ماہ بعد فوت ہو گئیں",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 84
			}
		}
	]
}