{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4612,
			"arabicnumber": "1775.01",
			"text": "یونس نے مجھے ابن شہاب سے خبر دی ، انہوں نے کہا : مجھے کثیر بن عباس بن عبدالمطلب رضی اللہ عنہ نے حدیث بیان کی ، انہوں نے کہا : حضرت عباس رضی اللہ عنہ نے کہا : حنین کے دن میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ موجود تھا ، میں اور ابوسفیان بن حارث بن عبدالمطلب رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رہے ، آپ سے جدا نہ ہوئے ، رسول اللہ صلی اللہ علیہ وسلم اپنے سفید خچر پر ( سوار ) تھے جو فرقہ بن نُفاثہ جذامی نے آپ کو تحفے میں دیا تھا ۔ جب مسلمانوں اور کفار کا آمنا سامنا ہوا تو مسلمان پیٹھ پھیر کر بھاگے ، ( مگر ) رسول اللہ صلی اللہ علیہ وسلم اپنے خچر کو ایڑ لگا کر ، کفار کی جانب بڑھنے لگے ۔ حضرت عباس رضی اللہ عنہ نے کہا : میں رسول اللہ صلی اللہ علیہ وسلم کے خچر کی لگام تھامے ہوئے تھا ، میں چاہتا تھا کہ وہ تیزی سے ( آگے ) نہ بڑھے اور ابوسفیان رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کی رکاب کو پکڑا ہوا تھا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عباس! کیکر کے درخت ( کے نیچے بیعت کرنے ) والوں کو آواز دو ۔ \" حضرت عباس رضی اللہ عنہ نے کہا : ۔ ۔ اور وہ بلند آواز والے تھے ۔ ۔ میں نے اپنی بلند ترین آواز سے پکار کر کہا : کیکر کے درخت والے کہاں ہیں؟ کہا : اللہ کی قسم! میری آواز سن کر ان کا پلٹنا اس طرح تھا جیسے گائے اپنے بچوں کی ( آواز سن کر ان کی ) طرف پلٹتی ہے ۔ اور وہ ( جواب میں ) کہنے لگے : حاضر ہیں! حاضر ہیں! کہا : تو وہ کفار سے بھڑ گئے ، پھر انصار میں بلاوا دیا گیا ( بلاوا دینے والے ) کہتے تھے : اے انصار کی جماعت! اے انصار کی جماعت! پھر اس ندا کو بنی حارث بن خزرج تک محدود کر دیا گیا اور انہوں نے کہا : اے بنو حارث بن خزرج! اے بنو حارث بن خزرج! رسول اللہ صلی اللہ علیہ وسلم نے اپنے خچر پر بیٹھے ہوئے ، گردن کو آگے کر کے دیکھنے والے کی طرح ، ان کی لڑائی کا جائزہ لیا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ گھڑی ہے کہ ( لڑائی کا ) تنور گرم ہوا ہے ۔ \" پھر رسول اللہ صلی اللہ علیہ وسلم نے کنکریاں پکڑیں اور انہیں کافروں کے چہروں پر مارا ، پھر فرمایا : \" محمد کے پروردگار کی قسم! وہ شکست کھا گئے ۔ \" کہا : میں دیکھنے لگا تو میرے خیال کے مطابق لڑائی اسی طرح جاری تھی ۔ کہا : اللہ کی قسم! پھر یہی ہوا کہ جونہی آپ نے ان کی طرف کنکریاں پھینکیں تو میں دیکھ رہا تھا کہ ان کی دھار کند ہو گئی ہے اور ان کا معاملہ پیچھے جانے کا ہے",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 94
			}
		}
	]
}