{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4621,
			"arabicnumber": "1779",
			"text": "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو جب ابوسفیان رضی اللہ عنہ کی آمد کی خبر ملی تو آپ نے مشورہ کیا ، کہا : حضرت ابوبکر رضی اللہ عنہ نے گفتگو کی تو آپ نے ان سے اعراض فرمایا ، پھر حضرت عمر رضی اللہ عنہ نے گفتگو کی تو آپ نے ان سے اعراض فرمایا ، پھر حضرت عمر رضی اللہ عنہ نے گفتگو کی تو آپ نے ان سے بھی اعراض فرمایا ۔ اس پر حضرت سعد بن عبادہ رضی اللہ عنہ کھڑے ہوئے اور کہنے لگے : اے اللہ کے رسول! کیا آپ ہم سے ( مشورہ کرنا ) چاہتے ہیں؟ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر آپ ہمیں ( اپنے گھوڑے ) سمندر میں ڈال دینے کا حکم دیں تو ہم انہیں ڈال دیں گے اور اگر آپ ہم کو انہیں ( معمورہ اراضی کے آخری کونے ) برک غماد تک دوڑانے کا حکم دیں تو ہم یہی کریں گے ۔ کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو بلایا ، اور وہ چل پڑے حتی کہ بدر میں پڑاؤ ڈالا ۔ ان کے پاس قریش کے پانی لانے والے اونٹ آئے ، ان میں بنو حجاج کا ایک سیاہ فام غلام بھی تھا تو انہوں نے اسے پکڑ لیا ، رسول اللہ صلی اللہ علیہ وسلم کے ساتھی اس سے ابوسفیان اور اس کے ساتھیوں کے بارے میں پوچھ گچھ کرنے لگے تو وہ کہنے لگا : مجھے ابوسفیان کا تو پتہ نہیں ہے ، البتہ ابوجہل ، عتبہ ، شیبہ ، اور امیہ بن خلف یہاں ( قریب موجود ) ہیں ۔ جب اس نے یہ کہا ، وہ اسے مارنے لگے ۔ تو اس نے کہا : ہاں ، تمہیں بتاتا ہوں ، ابوسفیان ادھر ہے ۔ جب انہوں نے اسے چھوڑا اور ( دوبارہ ) پوچھا ، تو اس نے کہا : ابوسفیان کا تو مجھے علم نہیں ہے ، البتہ ابوجہل ، عتبہ ، شیبہ ، اور امیہ بن خلف یہاں لوگوں میں موجود ہیں ۔ جب اس نے یہ ( پہلے والی ) بات کی تو وہ اسے مارنے لگے ۔ رسول اللہ صلی اللہ علیہ وسلم کھڑے نماز پڑھ رہے تھے ، آپ نے جب یہ صورت حال دیکھی تو آپ ( سلام پھیر کر ) پلٹے اور فرمایا : \"\" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! جب وہ سچ کہتا ہے تو تم اسے مارتے ہو اور جب وہ تم سے جھوٹ بولتا ہے تو اسے چھوڑ دیتے ہو ۔ \"\" کہا : اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" یہ فلاں کے مرنے کی جگہ ہے ۔ \"\" آپ زمین پر اپنا ہاتھ رکھتے تھے ( اور فرماتے تھے ) یہاں اور یہاں ۔ کہا : ان میں سے کوئی بھی رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ کی جگہ سے ( ذرہ برابر بھی ) اِدھر اُدھر نہیں ہوا",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 103
			}
		}
	]
}