{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4622,
			"arabicnumber": "1780.01",
			"text": "شیبان بن فروخ نے حدیث بیان کی ، کہا : ہمیں سلیمان بن مغیرہ نے حدیث سنائی ، کہا : ہمیں ثابت بنانے نے عبداللہ بن رباح سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : کئی وفود حضرت معاویہ رضی اللہ عنہ کے پاس گئے ، یہ رمضان کا مہینہ تھا ۔ ( عبداللہ بن رباح نے کہا : ) ہم ایک دوسرے کے لیے کھانا تیار کرتے تو ابوہریرہ رضی اللہ عنہ جو ہمیں اکثر اپنی قیام گاہ پر بلاتے تھے ۔ ایک ( دن ) میں نے کہا : میں بھی کیوں نہ کھانا تیار کروں اور سب کو اپنی قیام گاہ پر بلاؤں ۔ میں نے کھانا بنانے کا کہہ دیا ، پھر شام کو ابوہریرہ رضی اللہ عنہ سے ملا اور کہا : آج کی رات میرے یہاں دعوت ہے ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا : تو نے مجھ سے پہلے کہہ دیا ۔ ( یعنی آج میں دعوت کرنے والا تھا ) میں نے کہا : ہاں ، پھر میں نے ان سب کو بلایا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا : اے انصار کی جماعت! کیا میں تمہیں تمہارے متعلق احادیث میں سے ایک حدیث نہ بتاؤں؟ پھر انہوں نے مکہ کے فتح ہونے کا ذکر کیا ۔ اس کے بعد کہا : رسول اللہ صلی اللہ علیہ وسلم تشریف لائے یہاں تک کہ مکہ میں داخل ہو گئے ، پھر دو میں سے ایک بازو پر زبیر رضی اللہ عنہ کو بھیجا اور دوسرے بازو پر خالد بن ولید رضی اللہ عنہ کو ، ابوعبیدہ ( بن جراح ) رضی اللہ عنہ کو ان لوگوں کا سردار کیا جن کے پاس زرہیں نہ تھیں ۔ انہوں نے گھاٹی کے درمیان والا راستہ اختیار کیا تو رسول اللہ صلی اللہ علیہ وسلم ایک دستے میں تھے ۔ آپ صلی اللہ علیہ وسلم نے مجھے دیکھا تو فرمایا : \"\" ابوہریرہ! \"\" میں نے کہا : حاضر ہوں ، اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" میرے ساتھ انصاری کے سوا کوئی نہ آئے ۔ \"\" شیبان کے علاوہ دوسرے راویوں نے اضافہ کیا : آپ نے فرمایا : \"\" میرے لیے انصار کو آواز دو ۔ \"\" انصار آپ کے اردگرد آ گئے ۔ اور قریش نے بھی اپنے اوباش لوگوں اور تابعداروں کو اکٹھا کیا اور کہا : ہم ان کو آگے کرتے ہیں ، اگر کوئی چیز ( کامیابی ) ملی تو ہم بھی ان کے ساتھ ہیں اور اگر ان پر آفت آئی تو ہم سے جو مانگا جائے گا دے دیں گے ۔ ( دیت ، جرمانہ وغیرہ ۔ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم قریش کے اوباشوں اور تابعداروں ( ہر کام میں پیروی کرنے والوں ) کو دیکھ رہے ہو؟ \"\" پھر آپ نے دونوں ہاتھوں سے ایک ہاتھ کو دوسرے ہاتھ پر ( مارتے ہوئے ) اشارہ فرمایا : \"\" ( ان کا صفایا کر دو ، ان کا فتنہ دبا دو ) ، پھر فرمایا : \"\" یہاں تک کہ تم مجھ سے صفا پر آ ملو ۔ \"\" حضرت ابوہریرہ رضی اللہ عنہ نے کہا : پھر ہم چلے ، ہم میں سے جو کوئی ( کافروں میں سے ) جس کسی کو مارنا چاہتا ، مار ڈالتا اور کوئی ہماری طرف کسی چیز ( ہتھیار ) کو آگے تک نہ کرتا ، یہاں تک کہ ابوسفیان رضی اللہ عنہ آئے اور کہنے لگے : اللہ کے رسول! قریش کی جماعت ( کے خون ) مباح کر دیے گئے اور آج کے بعد قریش نہ رہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ( اپنا سابقہ بیان دہراتے ہوئے ) فرمایا : \"\" جو شخص ابوسفیان کے گھر کے اندر چلا جائے اس کو امن ہے ۔ \"\" انصار ایک دوسرے سے کہنے لگے : ان کو ( یعنی رسول اللہ صلی اللہ علیہ وسلم کو ) اپنے وطن کی الفت اور اپنے کنبے والوں پر شفقت آ گئی ہے ۔ ابوہریرہ رضی اللہ عنہ نے کہا : اور وحی آنے لگی اور جب وحی آنے لگتی تھی تو ہم سے مخفی نہ رہتی ۔ جب وحی آتی تو وحی ( کا نزول ) ختم ہونے تک کوئی شخص آپ صلی اللہ علیہ وسلم کی طرف اپنی آنکھ نہ اٹھاتا تھا ، غرض جب وحی ختم ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اے انصار کے لوگو! انہوں نے کہا : اللہ کے رسول! ہم حاضر ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم نے یہ کہا : اس شخص ( کے دل میں ) اپنے گاؤں کی الفت آ گئی ہے ۔ \"\" انہوں نے کہا : یقینا ایسا تو ہوا تھا ۔ آپ صلی اللہ علیہ وسلم نے بفرمایا : \"\" ہرگز نہیں ، میں اللہ کا بندہ اور اس کا رسول ہوں ۔ میں نے اللہ تعالیٰ کی طرف ہجرت کی اور تمہاری طرف ( آیا ) اب میری زندگی بھی تمہاری زندگی ( کے ساتھ ) ہے اور موت بھی تمہارے ساتھ ہے ۔ \"\" یہ سن کر انصار روتے ہوئے آگے بڑھے ، وہ کہہ رہے تھے : اللہ تعالیٰ کی قسم! ہم نے کہا جو کہا محض اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کے ساتھ شدید چاہت ( اور ان کی معیت سے محرومی کے خوف ) کی وجہ سے کہا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" بے شک اللہ اور اس کا رسول تمہاری تصدیق کرتے ہیں اور تمہارا عذر قبول کرتے ہیں ۔ \"\" پھر لوگ ابوسفیان رضی اللہ عنہ کے گھر کی طرف آ گئے اور لوگوں نے اپنے دروازے بند کر لیے اور رسول اللہ صلی اللہ علیہ وسلم حجراسود کے پاس تشریف لے آئے اور اس کو چوما ، پھر بیت اللہ کا طواف کیا ، پھر آپ بیت اللہ کے پہلو میں ایک بت کے پاس آئے ، لوگ اس کی پوجا کیا کرتے تھے ، اس وقت آپ صلی اللہ علیہ وسلم کے ہاتھ میں کمان تھی ، آپ صلی اللہ علیہ وسلم نے اس کو ایک طرف سے پکڑا ہوا تھا ، جب آپ بت کے پاس آئے تو اس کی آنکھ میں چبھونے لگے اور فرمانے لگے : \"\" حق آ گیا اور باطل مٹ گیا ۔ \"\" جب اپنے طواف سے فارغ ہوئے تو کوہِ صفا پر آئے ، اس پر چڑھے یہاں تک کہ بیت اللہ کی طرف نظر اٹھائی اور اپنے دونوں ہاتھ اٹھائے ، پھر اللہ تعالیٰ کی حمد کرنے لگے اور اللہ سے جو مانگنا چاہا وہ مانگنے لگے",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 104
			}
		}
	]
}