{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4624,
			"arabicnumber": "1780.03",
			"text": "ہمیں حماد بن سلمہ نے حدیث بیان کی ، ( کہا : ) ہمیں ثابت نے عبداللہ بن رباح سے خبر دی ، انہوں نے کہا : ہم بطور وفد حضرت معاویہ بن ابی سفیان رضی اللہ عنہ کے پاس گئے ، اور ہم لوگوں میں ابوہریرہ رضی اللہ عنہ بھی تھے ، ہم میں سے ہر آدمی ایک دن اپنے ساتھیوں کے لیے کھانا بناتا ، ایک دن میری باری تھی ، میں نے کہا : ابوہریرہ رضی اللہ عنہ! آج میری باری ہے ، وہ سب میرے ٹھکانے پر آئے اور ابھی کھانا نہیں آیا تھا ۔ میں نے کہا : ابوہریرہ رضی اللہ عنہ! کاش آپ ہمیں رسول اللہ صلی اللہ علیہ وسلم سے کوئی حدیث سنائیں یہاں تک کہ کھانا آ جائے ۔ انہوں نے کہا : ہم فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ۔ آپ صلی اللہ علیہ وسلم نے خالد بن ولید رضی اللہ عنہ کو دائیں بازو ( میمنہ ) پر ( امیر ) مقرر کیا اور زبیر رضی اللہ عنہ کو بائیں بازو ( میسرہ ) پر اور ابوعبیدہ رضی اللہ عنہ کو پیادوں پر اور وادی کے اندر ( کے راستے ) پر تعینات کیا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا : \" ابوہریرہ! انصار کو بلاؤ ۔ \" میں نے ان کو بلایا ، وہ دوڑتے ہوئے آئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" انصار کے لوگو! کیا تم قریش کے اوباشوں کو دیکھ رہے ہو؟ انہوں نے کہا : جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" دیکھو! کل جب تمہارا ان سے سامنا ہو تو ان کو اس طرح کاٹ دینا جس طرح فصل کاٹی جاتی ہے \" اور آپ صلی اللہ علیہ وسلم نے پوشیدہ رکھتے ہوئے ہاتھ سے اشارہ کر کے بتایا اور داہنا ہاتھ بائیں ہاتھ پر رکھا ۔ اور فرمایا : \" اب تم سے ملاقات کا وعدہ کوہِ صفا پر ہے ۔ \" حضرت ابوہریرہ رضی اللہ عنہ نے کہا : تو اس روز جس کسی نے سر اٹھایا ، انہوں نے اس کو سلا دیا ، ( یعنی مار ڈالا ۔ ) رسول اللہ صلی اللہ علیہ وسلم صفا پہاڑ پر چڑھے ، انسار آئے ، انہوں نے صفا کو گھیر لیا ، اتنے میں ابوسفیان رضی اللہ عنہ آئے اور کہنے لگا : اللہ کے رسول! قریش کی جمعیت مٹا دی گئی ، آج سے قریش نہ رہے ۔ ابوسفیان رضی اللہ عنہ نے کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو کوئی ابوسفیان کے گھر میں چلا گیا اس کو امن ہے اور جو ہتھیار ڈال دے اس کو بھی امن ہے اور جو اپنا دروازہ بند کے لے اس کو بھی امن ہے ۔ \" انصار نے کہا : آپ پر اپنے عزیزوں کی محبت اور اپنے شہر کی الفت غالب آ گئی ہے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم پر وحی نازل ہوئی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم لوگوں نے کہا : مجھ پر کنبے والوں کی محبت اور اپنے شہر کی الفت غالب آ گئی ہے ، دیکھو! پھر ( اس صورت میں ) میرا نام کیا ہو گا؟ \" آپ نے تین بار فرمایا : ۔ ۔ \" میں محمد اللہ تعالیٰ کا بندہ اور اس کا رسول ہوں ۔ میں نے اللہ کے لیے تمہاری طرف ہجرت کی ، تو اب زندگی تمہاری زندگی ( کے ساتھ ) ہے اور موت تمہاری موت ( کے ساتھ ) ہے ۔ \" انہوں نے کہا : اللہ کی قسم! ہم نے یہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی شدید چاہت ( اور آپ کی معیت سے محرومی کے خوف ) کے علاوہ کسی وجہ سے نہیں کہا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تو اللہ اور اس کا رسول دونوں تم کو سچا جانتے ہیں اور تمہارا عذر قبول کرتے ہیں",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 106
			}
		}
	]
}