{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 463,
			"arabicnumber": "187",
			"text": "انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےحضرت ابن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’جنت میں سب سے آخر میں وہ آدمی داخل ہو گا جو کبھی چلےگا ، کبھی چہرے کے بل گرے گا اور کبھی آگ سے جھلسا دے گی ۔ جب و ہ آگ سے نکل آ ئے گا توپلٹ کر اس کو دیکھے گا اور کہے گا : بڑی برکت والی ہے وہ ذات جس نے مجھے تجھ سے نجات دے دی ۔ اللہ نے مجھے ایسی چیز عطا فرما دی جو اس نے اگلوں پچھلوں میں سے کسی کو عطا نہیں فرمائی ۔ اسے بلندی پر ایک درخت کے قریب کردے تاکہ میں اس کے سائے میں دھوپ سے نجات حاصل کروں اور اس کے پانی سے پیاس بجھاؤں ۔ اس پر اللہ عز وجل فرمائے گا : اے ابن آدم ! ہو سکتا ہے کہ میں تمہیں یہ درخت دےدوں تو تم مجھ سے اس کے سوا کچھ اور مانگو ۔ وہ کہے گا : نہیں ، اے میرے رب ! اور اللہ کے ساتھ عہد کرے گا کہ وہ اس سے اور کچھ نہ مانگے گا ۔ اس کا پروردگار اس کے عذر قبول کر لے گا کیونکہ وہ ایسی چیز دیکھ رہا ہو گاجس پر وہ صبر کر ہی نہیں سکتا ۔ تو اللہ تعالیٰ اسے اس ( درخت ) کے قریب کر دے گا اور وہ اس کے سائے میں دھوپ سے محفوظ ہو جائے گا اور اس کاپانی پیے گا ، پھر اسے اوپر ایک اور درخت دکھایا جائے گاجو پہلے درخت سےزیادہ خوبصورت ہو گا تووہ کہے گا : اےمیرے رب ! مجھے اس درخت کے قریب کر دے تاکہ میں اس کے پانی سے سیراب ہوں اور اس کے سائے میں آرام کروں ، میں تجھ سے اس کے سوا کچھ نہیں مانگوں گا ۔ اللہ تعالیٰ فرمائےگا : اے آدم کے بیٹے ! کیا تم نے مجھ سےوعدہ نہ کیا تھا کہ تم مجھ سے کچھ اورنہیں مانگو گے؟ اور فرمائے گا : مجھے لگتا ہے اگر میں تمہیں اس کے قریب کردوں تو تم مجھ سے کچھ اور بھی مانگو گے ۔ وہ اللہ تعالیٰ سے وعدہ کرے گا کہ وہ اس کے علاوہ اور کچھ نہیں مانگے گا ، اس کا رب تعالیٰ اس کا عذر قبول کر لے گا ، کیونکہ وہ ایسی چیز دیکھ رہا ہو گا جس کے سامنے اس سے صبر نہیں ہو سکتا ۔ اس پر اللہ اسے اس درخت کے قریب کر دے گا ۔ وہ اس کے سائے کے نیچے آ جائے گا اور اس کےپانی سے پیاس بجھائے گا ۔ اور پھر ایک درخت جنت کے دروازے کے پاس دکھایا جائے گا جو پہلے دونوں درختوں سے زیادہ خوبصورت ہو گا تو وہ عرض کرے گا : اے میرے رب ! مجھے اس درخت کے قریب کر دے تاکہ میں اس کے سائے سے فائدہ اٹھاؤں اور اس کے پانی سے پیاس بجھاؤں ، میں تم سے اور کچھ نہیں مانگوں گا ۔ اللہ تعالیٰ فرمائے گا : اے آدم کے بیٹے! کیا تم نے میرے ساتھ وعدہ نہیں کیا تھا کہ او رکچھ نہیں مانگو گے؟ وہ کہے گا : کیوں نہیں میرے رب! ( وعدہ کیا تھا ) بس یہی ، اس کے علاوہ اور کچھ نہیں مانگوں گا ۔ اس کا رب اس کاعذر قبول کر لے گاکیونکہ وہ ایسی چیز دیکھ رہا ہو گا جس پر وہ صبر کر ہی نہیں سکتا ۔ تو وہ اس شخص کے اس ( درخت ) کے قریب کر دے گاتو وہ اہل جنت کی آوازیں سنے گا ۔ وہ کہے گا : اے میرے رب!مجھے اس میں داخل کر دے ، اللہ تعالیٰ فرمائے گا : اے آدم کے بیٹے ! وہ کیا چیز ہے جو تجھے راضی کر کے ہمارے درمیان سوالات کا سلسلہ ختم کر دے؟ کیا تم اس سے راضی ہو جاؤ گے کہ میں تمہیں ساری دنیا اور اس کے برابر اوردے دوں ؟وہ کہے گا : اے میرے رب! کیا تومیری ہنسی اڑاتا ہے جبکہ تو سارے جہانوں کا رب ہے ۔ ‘ ‘ اس پر ابن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ہنس پڑے اور کہا : کیا تم مجھ سے یہ نہیں پوچھوگے کہ میں کیوں ہنسا؟ سامعین نے پوچھا : آپ کیوں ہنسے؟ کہا : اسی طرح رسول اللہ ﷺ ہنسے تھے توصحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے پوچھا تھا : اے اللہ کے رسول ! آپ کیوں ہنس رہے ہیں ؟ آپ نے فرمایا : ’’رب العالمین کے ہنس پڑے پر ، جب اس نے کہا کہ تو سارے جہانوں کارب ہے ، میری ہنسی اڑاتا ہے ؟ اللہ فرمائے گا : میں تیری ہنسی نہیں اڑاتا بلکہ میں جو چاہوں کر سکتا ہوں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 368
			}
		}
	]
}