{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4649,
			"arabicnumber": "1794.01",
			"text": "زکریا ( بن ابی زائدہ ) نے ابواسحاق سے ، انہوں نے عمرو بن میمون اودی سے ، انہوں نے ابن مسعود رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : ایک بار رسول اللہ صلی اللہ علیہ وسلم بیت اللہ کے پاس نماز پڑھ رہے تھے ، ابوجہل اور اس کے ساتھی بھی بیٹھے ہوئے تھے ، اور ایک دن پہلے ایک اونٹنی ذبح ہوئی تھی ۔ ابوجہل نے کہا : تم میں سے کون اٹھ کر بنی فلاں کے محلے سے اونٹنی کی بچے والی جھلی ( بچہ دانی ) لائے گا اور محمد سجدے میں جائیں تو اس کو ان کے کندھوں کے درمیان رکھ دے گا؟ قوم کا سب سے بدبخت شخص ( عقبہ بن ابی معیط ) اٹھا اور اس کو لے آیا ۔ جب نبی صلی اللہ علیہ وسلم سجدے میں گئے تو اس نے وہ جھلی آپ کے کندھوں کے درمیان رکھ دیا ، پھر وہ آپس میں خوب ہنسے اور ایک دورے پر گرنے لگے ۔ میں کھڑا ہوا دیکھ رہا تھا ، کاش! مجھے کچھ بھی تحفظ حاصل ہوتا تو میں اس جھلی کو رسول اللہ صلی اللہ علیہ وسلم کی پشت سے اٹھا کر پھینک دیتا ، نبی صلی اللہ علیہ وسلم سجدے میں تھے ۔ اپنا سر مبارک نہیں اٹھا رہے تھے ، حتی کہ ایک شخص نے جا کر حضرت فاطمہ رضی اللہ عنہا کو خبر دی ، وہ آئیں ، حالانکہ وہ اس وقت کم سن بچی تھیں ، انہوں نے وہ جھلی اٹھا کر آپ سے دور پھینکی ۔ پھر وہ ان لوگوں کی طرف متوجہ ہوئیں اور انہیں سخت سست کہا ۔ جب نبی صلی اللہ علیہ وسلم نے اپنی نماز مکمل کر لی تو آپ نے بآزاو بلند ان کے خلاف دعا کی ، آپ جب کوئی دعا کرتے تھے تو تین مرتبہ دہراتے اور آپ صلی اللہ علیہ وسلم اگر کچھ مانگتے تو تین بار مانگتے تھے ، پھر آپ نے تین مرتبہ فرمایا : \"\" اے اللہ! قریش پر گرفت فرما ۔ \"\" جب قریش نے آپ کی آواز سنی تو ان کی ہنسی جاتی رہی اور وہ آپ کی بددعا سے خوف زدہ ہو گئے ۔ آپ نے پھر بددعا فرمائی : اے اللہ! ابوجہل بن ہشام پر گرفت فرما اور عتبہ بن ربیعہ ، شیبہ بن ربیعہ ، ولید بن عقبہ ، امیہ بن خلف ، عقبہ بن ابی معیط پر گرفت فرما ۔ \"\" ۔ ۔ ( ابواسحاق نے کہا : ) انہوں ( عمرو بن میمون ) نے ساتویں شخص کا نام بھی لیا تھا لیکن وہ مجھے یاد نہیں رہا ( بعد ازاں ابواسحاق کو ساتویں شخص عمارہ بن ولید کا نام یاد آ گیا تھا ، صحیح البخاری ، حدیث : 520 ) ۔ ۔ ( ابن مسعود رضی اللہ عنہ نے کہا : ) اس ذات کی قسم جس نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث کیا ہے! جن کا آپ نے نام لیا تھا میں نے بدر کے دن ان کو مقتول پڑے دیکھا ، پھر ان سب کو گھسیٹ کر کنویں ، بدر کے کنویں کی طرف لے جایا گیا اور انہیں اس میں ڈال دیا گیا ۔ ابواسحاق نے کہا : اس حدیث میں ولید بن عقبہ ( کا نام ) غلط ہے ۔ ( صحیح ولید بن عتبہ ہے)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 131
			}
		}
	]
}