{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4669,
			"arabicnumber": "1802.02",
			"text": "ابوطاہر نے مجھے حدیث بیان کی ، کہا : ہمیں ابن وہب نے خبر دی ، کہا : مجھے یونس نے ابن شہاب سے خبر دی ، کہا : مجھے عبدالرحمان نے خبر دی ۔ ۔ ابن وہب کے علاوہ دوسرے راوی نے ان کا نسب بیان کیا تو ( عبدالرحمان ) بن عبداللہ بن کعب بن مالک کہا ۔ ۔ کہ حضرت سلمہ بن اکوع رضی اللہ عنہ نے کہا : جب خیبر کا دن تھا ، میرے بھائی نے رسول اللہ صلی اللہ علیہ وسلم کی معیت میں خوب جنگ لڑی ، ( اسی اثنا میں ) ان کی تلوار پلٹ کر انہی کو جا لگی اور انہیں شہید کر دیا تو رسول اللہ صلی اللہ علیہ وسلم کے صحابہ نے اس حوالے سے کچھ باتیں کہیں اور اس معاملے میں شک ( کا اظہار کیا ) کہ آدمی اپنے ہی اسلحہ سے فوت ہوا ہے ۔ انہوں نے ان کے معاملے کے بعض پہلوؤں میں شک کیا ۔ سلمہ رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم خیبر سے واپس ہوئے تو میں نے کہا : اے اللہ کے رسول! مجھے اجازت دیجئے کہ میں آپ کے آگے رجزیہ اشعار پڑھوں تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی ۔ اس پر حضرت عمر بن خطاب رضی اللہ عنہ نے کہا : میں جانتا ہوں جو تم کہنے جا رہے ہو ۔ کہا : تو میں نے ( یہ رجزیہ اشعار ) پڑھے : \"\" اللہ کی قسم! اگر اللہ ( کا کرم ) نہ ہوتا تو ہم ہدایت نہ پاتے ، نہ صدقہ کرتے اور نہ نماز پڑھتے ۔ \"\" اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم نے سچ کہا ۔ \"\" \"\" ہم پر بہت سکینت نازل فرما اور اگر ہمارا مقابلہ ہو تو ہمارے قدم مضبوط کر دے ، مشرکوں نے یقینا ہم پر سخت زیادتی کی ۔ \"\" کہا : جب میں نے اپنے رجزیہ اشعار ختم کیے تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \"\" یہ ( اشعار ) کس نے کہے؟ \"\" میں نے جواب دیا : میرے بھائی نے کہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ ان پر رحم کرے! \"\" کہا : تو میں نے کہا : اللہ کی قسم! اللہ کے رسول! کچھ لوگ اس کے لیے دعا کرتے ہوئے ڈر رہے تھے ، وہ کہہ رہے تھے : وہ آدمی اپنے ہی اسلحے سے فوت ہوا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" وہ تو جہاد کرتے ہوئے مجاہد کے طور پر فوت ہوا ہے ۔ \"\" ابن شہاب نے کہا : پھر میں نے سلمہ بن اکوع رضی اللہ عنہ کے ایک بیٹے سے سوال کیا تو انہوں نے مجھے اپنے والد سے اسی کے مانند حدیث بیان کی ، مگر انہوں نے ( حضرت سلمہ رضی اللہ عنہ کے الفاظ دہراتے ہوئے ) کہا : جب میں نے کہا : کچھ لوگ اس کے لیے دعا کرنے سے ڈرتے ہیں تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ان لوگوں نے غلط کہا ، وہ تو جہاد کرتے ہوئے مجاہد کے طور پر فوت ہوئے ، ان کے لیے دہرا اجر ہے ۔ \"\" اور آپ نے اپنی دو انگلیوں سے اشارہ فرمایا",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 151
			}
		}
	]
}