{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4714,
			"arabicnumber": "1823.02",
			"text": "سالم نے ابن عمر رضی اللہ عنہ سے بیان کیا ، کہا : میں حضرت حفصہ رضی اللہ عنہ کے پاس گیا ، انہوں نے کہا : کیا تم کو علم ہے کہ تمہارے والد کسی کو ( اپنا ) جانشیں مقرر نہیں کر رہے؟ میں نے کہا : وہ ایسا نہیں کریں گے ۔ وہ کہنے لگیں : وہ یہی کرنے والے ہیں ۔ حضرت ابن عمر رضی اللہ عنہ نے کہا : میں نے قسم کھائی کہ میں اس معاملے میں ان سے بات کروں گا ، پھر میں خاموش ہو گیا حتی کہ صبح ہو گئی اور میں نے ان سے اس معاملے میں بات نہیں کی تھی ، اور مجھے ایسا لگتا تھا جیسے میں نے اپنے دائیں ہاتھ میں پہاڑ اٹھایا ہوا ہے ( مجھ پر اپنی قسم کا بہت زیادہ بوجھ تھا ) آخر کار میں واپس آیا اور ان کے پاس گیا ، انہوں نے مجھ سے لوگوں کا حال دریافت کیا ، میں آپ کو حالات سے باخبر کرنے لگا ، پھر میں نے ان سے کہا : میں نے لوگوں سے ایک بات سنی تھی اور وہ سن کر میں نے قسم کھائی کہ وہ میں آپ سے ضرور بیان کروں گا ۔ لوگوں کا خیال ہے کہ آپ کسی کو اپنا جانشیں نہیں بنائیں گے اور بات یہ ہے کہ اگر آپ کا کوئی اونٹوں یا بکریوں کا چرواہا ہو اور وہ آپ کے پاس چلا آئے اور ان کو ایسے ہی چھوڑ دے تو آپ یہی کہیں گے کہ اس نے ان کو ضائع کر دیا ہے ۔ سو لوگوں کی نگہبانی تو اس سے زیادہ ضروری ہے ، حضرت عمر رضی اللہ عنہ کو میری رائے ٹھیک معلوم ہوئی ، انہوں نے گھڑی بھر سر جھکائے رکھا ، پھر میری طرف سر اٹھا کر فرمایا : بلاشبہ اللہ عزوجل اپنے دین کی حفاظت فرمائے گا اور اگر میں کسی کو جانشیں نہ بناؤں تو رسول اللہ صلی اللہ علیہ وسلم نے کسی کو جانشیں مقرر نہیں کیا تھا اور اگر میں کسی کو جانشیں بناؤں تو حضرت ابوبکر رضی اللہ عنہ نے جانشیں بنایا تھا ۔ ( دونوں میں سے کسی بھی مثال پر عمل کیا جا سکتا ہے ۔ ) انہوں ( حضرت ابن عمر رضی اللہ عنہ ) نے کہا : اللہ کی قسم! جب حضرت عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم اور حضرت ابوبکر رضی اللہ عنہ کا ذکر کیا تو میں نے جان لیا کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے طریقے سے کبھی نہیں ہٹیں گے اور وہ کسی کو جانشیں بنانے والے نہیں",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 14
			}
		}
	]
}