{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4718,
			"arabicnumber": "1733.04",
			"text": "حمید بن ہلال نے کہا : مجھے ابوبردہ نے حدیث بیان کی ، انہوں نے کہا : حضرت ابو موسیٰ اشعری رضی اللہ عنہ نے کہا : میں بنو اشعر میں سے دو آدمیوں کے ساتھ نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، ایک میری دائیں جانب تھا اور دوسرا میری بائیں جانب ۔ ان دونوں نے کسی منصب کا سوال کیا ، اس وقت نبی صلی اللہ علیہ وسلم مسواک کر رہے تھے ، آپ نے فرمایا : \" ابوموسیٰ! \" یا فرمایا : \" عبداللہ بن قیس! تم کیا کہتے ہو؟ \" میں نے عرض کی : اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث کیا ہے! ان دونوں نے مجھے یہ نہیں بتایا تھا کہ ان کے دل میں کیا ہے؟ اور نہ مجھے یہ پتہ تھا کہ یہ دونوں منصب کا سوال کریں گے ۔ حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہا : ایسا لگتا ہے کہ میں ( آج بھی ) آپ کے ہونٹ کے نیچے مسواک دیکھ رہا ہوں جبکہ آپ کا ہونٹ اوپر کو سمٹا ہوا تھا ، آپ نے فرمایا : \" جو شخص خواہش مند ہو گا ہم اسے اپنے کسی کام کی ذمہ داری نہیں یا ( فرمایا : ) ہرگز نہیں دیں گے لیکن ابو موسیٰ! یا فرمایا : عبداللہ بن قیس! تم ( ذمہ داری سنبھالنے کے لیے ) چلے جاؤ ۔ \" تو آپ صلی اللہ علیہ وسلم نے انہیں یمن بھیج دیا ، پھر ( ساتھ ہی ) ان کے پیچھے معاذ بن جبل رضی اللہ عنہ کو بھیج دیا ، جب حضرت معاذ بن جبل رضی اللہ عنہ ان کے پاس پہنچے تو حضرت ابو موسیٰ رضی اللہ عنہ نے کہا : تشریف لائیے اور ان کے بیٹھنے کے لیے ایک گدا بچھایا ، تو وہاں اس وقت ایک شخص رسیوں سے بندھا ہوا تھا ، انہوں ( حضرت معاذ رضی اللہ عنہ ) نے پوچھا : یہ کون ہے؟ ( حضرت ابو موسیٰ رضی اللہ عنہ نے ) کہا : ایک یہودی تھا ، پھر یہ مسلمان ہو گیا اور اب پھر اپنے دین ، برائی کے کے دین پر لوٹ گیا ہے اور یہودی ہو گیا ہے ۔ حضرت معاذ رضی اللہ عنہ نے کہا : میں اس وقت تک نہیں بیٹھوں گا جب تک اس کو قتل نہ کر دیا جائے ، یہی اللہ اور اس کے رسول صلی اللہ علیہ وسلم کا فیصلہ ہے ۔ حضرت ابو موسیٰ رضی اللہ عنہ نے کہا : ہاں ، ( ہم اس کو قتل کرتے ہیں ) آپ بیٹھیے ، حضرت معاذ رضی اللہ عنہ نے کہا : میں اس وقت تک نہیں بیٹھوں گا جب تک اس شخص کو قتل نہیں کر دیا جاتا جو اللہ اور اس کے رسول صلی اللہ علیہ وسلم کا فیصلہ ہے ، تین ( مرتبہ یہی مکالمہ ہوا ) حضرت ابو موسیٰ رضی اللہ عنہ نے حکم دیا ، اس شخص کو قتل کر دیا گیا ، پھر ان دونوں نے آپس میں رات کے قیام کے بارے میں گفتگو کی ۔ دونوں میں سے ایک ( یعنی ) حضرت معاذ رضی اللہ عنہ نے کہا : جہاں تک میرا معاملہ ہے ، میں سوتا بھی ہوں اور قیام بھی کرتا ہوں اور میں اپنے قیام میں جس اجر کی امید رکھتا ہوں اپنی نیند میں بھی اسی ( اجر ) کی توقع رکھتا ہوں",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 18
			}
		}
	]
}