{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 475,
			"arabicnumber": "193.01",
			"text": "ابو کامل فضیل بن حسین جحدری اور محمد بن عبید غبری نے کہا : ( الفاظ ابو کامل کے ہیں ) ہمیں ابو عوانہ نے قتادہ سےحدیث سنائی ، انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نےکہاکہ رسول اللہ ﷺ نے فرمایا : ’’اللہ تعالیٰ قیامت کے دن لوگوں کو جمع کرے گا اور وہ اس بات پر فکر مند ہوں گے ( کہ اس دن کی سختیوں سے کیسے نجات پائی جائے؟ ) ( ابن عبید نے کہا : ان کے دل میں یہ بات ڈالی جائے گی ) او ر وہ کہیں گے : اگر ہم اپنے رب کے حضور کوئی سفارش لائیں تاکہ وہ ہمیں اس جگہ ( کی سختیوں ) سے راحت عطا کر دے ۔ آپ نے فرمایا : چنانچہ وہ آدم علیہ السلام کے پاس آئیں گے اورکہیں گے : آپ آدم ہیں ، تمام مخلوق کے والد ، اللہ تعالیٰ نے آپ کو اپنے ہاتھ سے پیدا کیا اور آپ میں اپنی روح پھونکی اور فرشتوں کو حکم دیا تو انہوں نے آپ کو سجدہ کیا ، آپ ہمارے لیے اپنے رب کے حضور سفارش فرمائیں کہ وہ ہمیں اس ( اذیت ناک ) جگہ سے راحت دے ۔ وہ جواب دیں گے : میں اس مقام پر نہیں ، پھر وہ اپنی غلطی کو ، جو ان سے ہو گئی تھی ، یاد کر کے اس کی وجہ سے اپنےرب سے شرمندگی محسوس کریں گے ، ( اور کہیں گے : ) لیکن تم نوح ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس جاؤ ، وہ پہلے رسول ہیں جنہیں اللہ تعالیٰ نے ( لوگوں کی طرف ) مبعوث فرمایا ، آپ نے فرمایا : تو اس پر لوگ نوح ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آئیں گے ۔ وہ کہیں گے : یہ میرا مقام نہیں اور وہ اپنی غلطی کو ، جس کا ارتکاب ان سے ہو گیا تھا ، یادکرکے اس پر اپنے رب کی شرمندگی محسوس کریں گے ، ( اور کہیں گے : ) لیکن تم ابراہیم علیہ السلام کے پاس جاؤ جنہیں اللہ تعالیٰ نے اپنا خلیل ( خالص دوست ) بنایا ہے ۔ وہ ابراہیم علیہ السلام کے پاس آئیں گے تو وہ کہیں گے : یہ میرا مقام نہیں ہے اور وہ اپنی غلطی کو یادکریں گےجو ان سے سرزد ہو گئی تھی اور اس پر اپنے رب سے شرمندہ ہوں گے ، ( اور کہیں گے : ) لیکن تم موسیٰ ‌علیہ ‌السلام ‌ کے پاس جاؤ جن سے اللہ تعالیٰ نےکلام کیا اور انہیں تورات عنایت کی ۔ لوگ موسیٰ ‌علیہ ‌السلام ‌ کی خدمت میں حاضر ہوں گے ، وہ کہیں گے کہ میں اس مقام پر نہیں اور اپنی غلطی کو ، جو ان سے ہو گئی تھی ، یاد کر کے اس پر اپنے رب سے شرمندگی محسوس کریں گے ( او رکہیں گے : ) لیکن تم روح اللہ اور اس کے کلمے عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس جاؤ ۔ لوگ روح اللہ اور اس کے کلمے عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کےپاس آئیں گے ۔ وہ ( بھی یہ ) کہیں گے : یہ میرا مقام نہیں ہے ، تم محمدﷺ کے پاس جاؤ ، وہ ایسے برگزیدہ عبد ( بندت ) ہیں جس کے اگلے پچھلے گناہ ( اگر ہوتے تو بھی ) معاف کیے جا چکے ۔ ‘ ‘ حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : رسو ل اللہ ﷺ نے فرمایا : ’’ پھر وہ میرے پاس آئیں گے ، میں اپنے رب ( کے پاس حاضری ) کی اجازت چاہوں گا تو مجھے اجازت دی جائے گی ، اسے دیکھتے ہی میں سجدے میں گر جاؤں گا ، تو جب تک اللہ چاہے گا مجھے اس حالت ( سجدہ ) میں رہنے دے گا ۔ پھر کہا جائے گا : اے محمد! اپنا سر اٹھائیے ، کہیے : آپ کی بات سنی جائے گی ، مانگیے ، آپ کودیاجائے گا ، سفارش کیجیے ، آپ کی سفارش قبول کی جائے گی ۔ میں اپنا سر اٹھاؤں گا اور اپنے رب تعالیٰ کی ایسی حمد وستائش بیان کروں گا جو میرا رب عز وجل خود مجھے سکھائے گا ، پھر میں سفارش کروں گا ۔ وہ میرے لیے حد مقرر کر دے گا ، میں ( اس کے مطابق ) لوگوں کو آگ سے نکال کر جنت میں داخل کروں گا ، پھر میں واپس آکر سجدے میں گر جاؤں گا ۔ اللہ تعالیٰ جب تک چاہے گا مجھے اسی حالت میں رہنے دے گا ، پھر کہا جائے گا : اپنا سر اٹھائیے ، اے محمدﷺ!کہیے : آپ کی بات سنی جائے گی ، مانگیے ، آپ کو ملے گا ، سفارش کیجیے آپ کی سفارش قبول کی جائے گی ۔ میں اپنا سر اٹھاؤں گا اور اپنے رب کی وہ حمد کروں گا جومیرا رب مجھے سکھائے گا ، پھر میں سفارش کروں گا تووہ میرے لیے پھر ایک حد مقرر فرما دےگا ، میں ان کو دوزخ سے نکالوں گا اور جنت میں داخل کروں گا ۔ ‘ ‘ ( حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : مجھے یاد نہیں ، آپ نے تیسری یا چوتھی بار فرمایا ) پھر میں کہوں گا : ’’اےمیرے رب! آگ میں ان کے سوا اور کوئی باقی نہیں بچا جنہیں قرآن نے روک لیا ہے ، یعنی جن کا ( دوزخ میں ) ہمیشہ رہنا ( اللہ کی طرف سے ) لازمی ہو گیا ہے ۔ ‘ ‘ ابن عبید نےاپنی روایت میں کہا : قتادہ نے کہا : یعنی جس کا ہمیشہ رہنا لازمی ہو گیا ۔",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 381
			}
		}
	]
}