{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 480,
			"arabicnumber": "194.01",
			"text": "ابو حیان نے ابو زرعہ سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نےکہا : ایک دن رسو ل اللہ ﷺ کی خدمت میں گوشت لایا گیا اور دستی اٹھا کر آپ کو پیش کی گئی کیونکہ آپ آپ کو مرغوب تھی ، آپ نے اپنےدندان مبارک سے ایک بار اس میں سے تناول کیا اور فرمایا : ’’ میں قیامت کے دن تمام انسانوں کا سردار ہوں گا ۔ کیا تم جانتے ہو یہ کیسے ہو گا؟ اللہ تعالیٰ قیامت کے دن تمام اگلون اور پچھلوں کو ایک ہموار چٹیل میدان میں جمع کرے گا ۔ بلانے والا سب کو اپنی آواز سنائے گا اور ( اللہ کی ) نظر سب کے آر پار ( سب کو دیکھ رہی ) ہو گی ۔ سورج قریب ہو جائے گا اور لوگوں کو اس قدر غم اور کرب لاحق ہو گا جوان کی طاقت سے زیادہ اور ناقابل برداشت ہو گا ۔ لوگ ایک دوسرے کہیں گے : کیا دیکھتے نہیں تم کس حالت میں ہو ؟ کیا دیکھتے نہیں تم پر کیسی مصیبت آن پڑی ہے ؟ کیا تم کوئی ا یسا شخص تلاش نہیں کرتے جو تمہاری سفارش کردے؟ یعنی تمہارے رب کے حضور ۔ چنانچہ لوگ ایک دوسرے سے کہیں گے : آدم علیہ السلام کے پاس چلو تو وہ آدم علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے : اے آدم ! آپ سب انسانوں کے والد ہیں ، اللہ تعالیٰ نے آپ کو اپنے ہاتھ سے بنایا اور آپ میں اپنی ( طرف سے ) روح پھونکی اور فرشتوں کو حکم دیا تو انہوں نے آپ کو سجدہ کیا ۔ آپ اپنے رب کے حضور ہماری سفارش فرمائیں ۔ آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ کیا آپ دیکھتے نہیں ہم پر کیسی مصیبت آن پڑی ہے ؟ آدم علیہ السلام جواب دیں گے : میرا رب آج اتنے غصے میں ہے جتنے غصے میں اسے سے پہلے کبھی نہیں آیا اور نہ اس کے بعد کبھی آئے گا اور یقیناً اس نے مجھے ایک خاص درخت ( کےقریب جانے ) سے روکا تھا لیکن میں نے اس کی نافرمانی کی تھی ، مجھے اپنی جان کی فکر ہے ، مجھے اپنی جان بچانی ہے ۔ تم کسی اور کے پاس جاؤ ، نوح ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس جاؤ ۔ لوگ نوح ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں حاضر ہوں گے اور عرض کریں گے : اے نوح! آپ ( اہل ) زمین کی طرف سے بھیجے گئے سب سے پہلے رسول ہیں اور ا للہ تعالیٰ نے آپ کو شکر گزار بندے کا نام دیا ہے ۔ آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ آپ دیکھتے نہیں ہم پر کیا مصیبت آن پڑی ہے ؟ وہ انہیں جوا ب دیں گے : آج میرا رب اتنے غصے میں ہے جتنے غصے میں نہ وہ اس سے پہلے کبھی آیا نہ آیندہ کبھی آئے گا ۔ حقیقت یہ ہے کہ میرے لیے ایک دعا ( خاص کی گئی ) تھی وہ میں نے اپنی قوم کےخلاف مانگ لی ۔ ( آج تو ) میری اپنی جان ( پر بنی ) ہے ۔ مجھے اپنی جان ( کی فکر ) ہے ۔ تم ابراہیم علیہ السلام کے پاس جاؤ ، چنانچہ لوگ ابراہیم علیہ السلام کے پاس حاضر ہوں گے اور عرض گزار ہوں گے : آپ اللہ کے نبی اور اہل زمین میں سے اس کے خلیل ( صرف اس کے دوست ) ہیں ، اپنے رب کے حضور ہماری سفارش فرمائیں ، آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ کیا آپ دیکھتے نہیں ہم پر کیا مصیبت آن پڑی ہے ؟ تو ابراہیم علیہ السلام ان سے کہیں گے : میرارب اس قدر غصے میں ہے کہ اس سے پہلے کبھی اتنے غصے میں نہیں آیا اور نہ آیندہ کبھی آئے گا اور اپنے ( تین ) جھوٹ یاد کریں گے ، ( اور کہیں ) مجھے اپنی جان کی فکر ہے ، مجھے تو اپنی جان کی بچانی ہے ۔ کسی اورکے پاس جاؤ ، موسیٰ ‌علیہ ‌السلام ‌ کے پاس جاؤ ۔ لوگ موسیٰ ‌علیہ ‌السلام ‌ کے خدمت میں حاضر ہوں گے اورعرض کریں گے : اے موسیٰ!آپ اللہ کےرسول ہیں ، اللہ تعالیٰ نے آپ کو اپنے پیغام اور اپنی ہم کلامی کے ذریعے سے فضیلت عطا کی ، اللہ کے حضور ہمارے لیے سفارش کیجیے ، آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ آپ دیکھتے نہیں ہم پر کیا مصیبت آن پڑی ہے ؟ موسیٰ ‌علیہ ‌السلام ‌ ان سے کہیں گے : میرا ب آج اس قدر غصے میں ہے کہ نہ اس سے پہلے کبھی اس قدر غصے میں آیا اور نہ اس کے بعد آئے گا ۔ میں ایک جان کو قتل کر چکا ہوں جس کے قتل کا مجھے حکم نہ دیا گیا تھا ۔ میری جان ( کا کیا ہو گا ) میری جان ( کیسے بچے گی؟ ) عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پا س جاؤ ۔ لوگ عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آئیں گے اور عرض کریں گے : اے عیسیٰ! آپ اللہ کا کلمہ ہیں جسے اس نے مریم ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف القاء کیا اور اس کی روح ہیں ، اس لیے آپ اپنے رب کے حضور ہماری سفارش فرمائیں ، آپ ہماری حالت نہیں دیکھتے جس میں ہم ہیں ؟ کیا آپ نہیں دیکھتے ہم پر کیسی مصیبت آن پڑی ہے ؟ تو عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ انہیں جواب دیں گے : میرا رب اتنے غصے میں ہے جتنے غصےمیں نہ وہ اس سے پہلے آیا اور نہ آیندہ کبھی آئے گا ، وہ اپنی کسی خطا کا ذکر نہیں کریں گے ، ( کہیں گے مجھے ) اپنی جان کی فکر ہے ، مجھے اپنی جان بچانی ہے ۔ میرے سوا کسی اور کے پاس جاؤ ، محمدﷺ کے پاس جاؤ ۔ لوگ میرے پاس ےئین گآ اور کہیں گے : اے محمد! آپ اللہ کے رسول اور آخری نبی ہیں ، اللہ تعالیٰ نے آپ کے اگلے پچھلے تمام گناہ ( اگر ہوتے تو بھی ) معاف کر دیے ، اپنے رب کےحضور ہماری سفارش فرمائیں ، آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ آپ دیکھتے نہیں ہم کیا مصیبت آن پڑی ہے ؟ تو میں چل پڑوں گا اور عرش کے نیچے آؤں گا اور اپنے رب کے حضور سجدے میں گر جاؤں گا ، پھر اللہ تعالیٰ مجھ پر اپنی ایسی تعریفوں اوراپنی ایسی بہترین ثنا ( کے دروازے ) کھول دے گا اور انہیں میرے دل میں ڈالے گا جو مجھ سے پہلے کسی کے لیے نہیں کھولے گئے ، پھر ( اللہ ) فرمائےگا : اے محمد! اپنا سر اٹھائیے ، مانگیے ، آپ کو ملے گا ، سفارش کیجیے ، آپ کی سفارش قبول ہو گی ۔ تو میں سر اٹھاؤں گا اور عرض کروں گا : اےمیرے رب ! میری امت ! میری امت ! توکہا جائے گا : اے محمد! آپ کی امت کے جن لوگوں کا حساب و کتاب نہیں ان کو جنت کے دروازے میں سے دائیں دروازے سے داخل کر دیجیے اور وہ جنت کے باقی دروازوں میں ( بھی ) لوگوں کے ساتھ شریک ہیں ۔ اس ذات کی قسم جس کے ہاتھ میں محمد کی جان ہے ! جنت کے دو کواڑوں کے درمیان اتنا ( فاصلہ ) ہے جتنامکہ اور ( شہر بجر ) یا مکہ اور بصری کے درمیان ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 386
			}
		}
	]
}