{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4915,
			"arabicnumber": "1901",
			"text": "ثابت نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ابوسفیان کی خبر لانے کے لئے بُسیسہ ( خزرجی انصاری ) رضی اللہ عنہ کو جاسوس بنا کر بھیجا کہ دیکھے ابوسفیان کے ( تجارتی ) قافلے کی کیا صورتِ حال ہے ۔ جس وقت وہ واپس آیا تو گھر میں میرے اور رسول اللہ صلی اللہ علیہ وسلم کے سوا اور کوئی نہیں تھا ، ۔ ۔ ( ثابت نے ) کہا : مجھے انس رضی اللہ عنہ کا کسی ام المومنین کو مستثنیٰ کرنا معلوم نہیں ۔ ۔ کہا : اس نے آ کر آپ کو ساری بات بتائی تو رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لائے اور فرمایا : \" ہمیں کچھ ( کرنا ) مطلوب ہے ، سو جس کے پاس سواری موجود ہو وہ ہمارے ساتھ سوار ہو کر چلے ۔ \" کچھ لوگ بالائی مدینہ میں ( موجود ) اپنی سواریاں لانے کی اجازت طلب کرنے لگے ۔ آپ نے فرمایا : \" نہیں ، صرف وہی لوگ ( ساتھ چلیں ) جن کی سواریاں یہیں موجود ہوں ۔ \" پھر رسول اللہ صلی اللہ علیہ وسلم اور آپ کے اصحاب چل پڑے اور مشرکین سے پہلے \" بدر \" پہنچ گئے ، مشرکین بھی آ پہنچے ، نبی صلی اللہ علیہ وسلم نے فرمایا : \" کوئی شخص ، جب تک میں اس کے پیچھے نہ ہوں ، کسی چیز پر پیش قدمی نہ کرے ۔ \" مشرکین قریب آ گئے تو نبی صلی اللہ علیہ وسلم نے فرمایا : \" اس جنت کی طرف بڑھ جس کی چوڑائی آسمان اور زمین ہیں ۔ \" کہا : ( یہ سن کر ) حضرت عمیر بن حمام انصاری رضی اللہ عنہ کہنے لگے : یا رسول اللہ! جنت جس کا عرض آسمان اور زمین ہے؟ آپ نے فرمایا : \" ہاں ۔ \" اس نے کہا : واہ واہ! رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم نے یہ واہ واہ کس وجہ سے کہا؟ \" اس نے کہا : اللہ کے رسول! اس امید کے سوا اور کسی وجہ سے نہیں ( کہا ) کہ میں ( بھی ) جنت والوں میں سے ہو جاؤں ، آپ نے فرمایا : \" بلاشبہ تم اہل جنت میں سے ہو ۔ \" حضرت عمیر رضی اللہ عنہ نے اپنے ترکش سے کچھ کھجوریں نکال کر کھانی شروع کیں ، پھر کہنے لگے : اگر میں اپنی ان کھجوروں کو کھا لینے تک زندہ رہا تو پھر یہ بڑی لمبی زندگی ہو گی ( یعنی جنت ملنے میں دیر ہو جائے گی ) ، پھر انہوں نے ، جو کھجوریں ان کے پاس تھیں ، پھینکیں اور لڑائی شروع کر دی یہاں تک کہ شہید ہو گئے ۔",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 210
			}
		}
	]
}