{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4923,
			"arabicnumber": "1905.01",
			"text": "خالد بن حارث نے کہا : ہمیں ابن جریج نے حدیث بیان کی ، کہا : مجھے یونس بن یوسف نے سلیمان بن یسار سے حدیث بیان کی ، انہوں نے کہا : ( جمگھٹے کے بعد ) لوگ حضرت ابوہریرہ رضی اللہ عنہ کے پاس سے چھٹ گئے تو اہل شام میں سے ناتل ( بن قیس جزامی رئیس اہل شام ) نے ان سے کہا : شیخ! مجھے ایسی حدیث سنائیں جو آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہو ، کہا : ہاں ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" قیامت کے روز سب سے پہلا شخص جس کے خلاف فیصلہ آئے گا ، وہ ہو گا جسے شہید کر دیا گیا ۔ اسے پیش کیا جائے گا ۔ اللہ تعالیٰ اسے اپنی ( عطا کردہ ) نعمت کی پہچان کرائے گا تو وہ اسے پہچان لے گا ۔ وہ پوچھے گا تو نے اس نعمت کے ساتھ کیا کیا؟ وہ کہے گا : میں نے تیری راہ میں لڑائی کی حتی کہ مجھے شہید کر دیا گیا ۔ ( اللہ تعالیٰ ) فرمائے گا تو نے جھوٹ بولا ۔ تم اس لیے لڑے تھے کہ کہا جائے : یہ ( شخص ) جری ہے ۔ اور یہی کہا گیا ، پھر اس کے بارے میں حکم دیا جائے گا تو اس آدمی کو منہ کے بل گھسیٹا جائے گا یہاں تک کہ آگ میں ڈال دیا جائے گا اور وہ آدمی جس نے علم پڑھا ، پڑھایا اور قرآن کی قراءت کی ، اسے پیش کیا جائے گا ۔ ( اللہ تعالیٰ ) اسے اپنی نعمتوں کی پہچان کرائے گا ، وہ پہچان کر لے گا ، وہ فرمائے گا : تو نے ان نعمتوں کے ساتھ کیا کیا؟ وہ کہے گا : میں نے علم پڑھا اور پڑھایا اور تیری خاطر قرآن کی قراءت کی ، ( اللہ ) فرمائے گا : تو نے جھوٹ بولا ، تو نے اس لیے علم پڑھا کہ کہا جائے ( یہ ) عالم ہے اور تو نے قرآن اس لیے پڑھا کہ کہا جائے : یہ قاری ہے ، وہ کہا گیا ، پھر اس کے بارے میں حکم دیا جائے گا ، اسے منہ کے بل گھسیٹا جائے گا حتی کہ آگ میں ڈال دیا جائے گا ۔ اور وہ آدمی جس پر اللہ نے وسعت کی اور ہر قسم کا مال عطا کیا ، اسے لایا جائے گا ۔ اللہ تعالیٰ اسے اپنی نعمتوں کی پہچان کرائے گا ، وہ پہچان لے گا ۔ اللہ فرمائے گا : تم نے ان میں کیا کیا؟ کہے گا : میں نے کوئی راہ نہیں چھوڑی جس میں تمہیں پسند ہے کہ مال خرچ کیا جائے مگر ہر ایسی راہ میں خرچ کیا ۔ اللہ فرمائے گا : تم نے جھوٹ بولا ہے ، تم نے ( یہ سب ) اس لیے کیا تاکہ کہا جائے ، وہ سخی ہے ، ایسا ہی کہا گیا ، پھر اس کے بارے میں حکم دیا جائے گا ، تو اسے منہ کے بل گھسیٹا جائے گا ، پھر آگ میں ڈال دیا جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 218
			}
		}
	]
}