{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"34": "The Book of Hunting, Slaughter, and what may be Eaten"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4998,
			"arabicnumber": "1935.01",
			"text": "ابو زبیر نے حضرت جابر سے روایت کی ، کہا : کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ابوعبیدہ بن الجراح رضی اللہ عنہ کی امارت میں قریش کے ایک قافلے کو ملنے ( یعنی ان کے پیچھے ) اور ہمارے سفر خرچ کے لئے کھجور کا ایک تھیلہ دیا اور کچھ آپ کو نہ ملا کہ ہمیں دیتے ۔ سیدنا ابوعبیدہ رضی اللہ عنہ ہمیں ایک ایک کھجور ( ہر روز ) دیا کرتے تھے ۔ ابوالزبیر نے کہا کہ میں نے سیدنا جابر رضی اللہ عنہ سے پوچھا کہ تم ایک کھجور میں کیا کرتے تھے؟ انہوں نے کہا کہ اس کو بچے کی طرح چوس لیا کرتے تھے ، پھر اس پر تھوڑا پانی پی لیتے تھے ، وہ ہمیں سارا دن اور رات کو کافی ہو جاتا اور ہم اپنی لکڑیوں سے پتے جھاڑتے ، پھر ان کو پانی میں تر کرتے اور کھاتے تھے ۔ سیدنا جابر رضی اللہ عنہ نے کہا ہم سمندر کے کنارے پہنچے تو وہاں ایک لمبی اور موٹی سی چیز نمودار ہوئی ۔ ہم اس کے پاس گئے تو دیکھا کہ وہ ایک جانور ہے جس کو عنبر کہتے ہیں ۔ سیدنا ابوعبیدہ رضی اللہ عنہ نے کہا کہ یہ مردار ہے ( یعنی حرام ہے ) ۔ پھر کہنے لگے کہ نہیں ہم اللہ کے رسول صلی اللہ علیہ وسلم کے بھیجے ہوئے ہیں اور اللہ کی راہ میں نکلے ہیں اور تم ( بھوک کی وجہ سے ) مجبور ہو چکے ہو تو اس کو کھاؤ ۔ سیدنا جابر رضی اللہ عنہ نے کہا ہم وہاں ایک مہینہ رہے اور ہم تین سو آدمی تھے ۔ اس کا گوشت کھاتے رہے ، یہاں تک کہ ہم موٹے ہو گئے ۔ سیدنا جابر رضی اللہ عنہ نے کہا میں دیکھ رہا ہوں کہ ہم اس کی آنکھ کے حلقہ میں سے چربی کے گھڑے کے گھڑے بھرتے تھے اور اس میں سے بیل کے برابر گوشت کے ٹکڑے کاٹتے تھے ۔ آخر سیدنا ابوعبیدہ رضی اللہ عنہ نے ہم میں سے تیرہ آدمیوں کو لیا ، وہ سب اس کی آنکھ کے حلقے کے اندر بیٹھ گئے ۔ اور اس کی پسلیوں میں سے ایک پسلی اٹھا کر کھڑی کی ، پھر جو اونٹ ہمارے ساتھ تھے ، ان میں سے سب سے بڑے اونٹ پر پالان باندھی تو وہ اس کے نیچے سے نکل گیا اور ہم نے اس کے گوشت میں سے زادراہ کے لئے وشائق بنا لئے ( وشائق ابال کر خشک کئے ہوئے گوشت کو کہتے ہیں ، جو سفر کے لئے رکھتے ہیں ) ۔ جب ہم مدینہ میں آئے تو رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور یہ قصہ بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ اللہ تعالیٰ کا رزق تھا جو اس نے تمہارے لئے نکالا تھا ۔ اب تمہارے پاس اس گوشت کا کچھ حصہ ہے تو ہمیں بھی کھلاؤ ۔ سیدنا جابر رضی اللہ عنہ نے کہا کہ ہم نے اس کا گوشت آپ صلی اللہ علیہ وسلم کے پاس بھیجا تو آپ صلی اللہ علیہ وسلم نے اس کو کھایا ۔",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 27
			}
		}
	]
}