{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5129,
			"arabicnumber": "1979.03",
			"text": "۔ عبد اللہ بن وہب نے کہا : مجھے یو نس بن یزید نے ابن شہاب سے حدیث بیان کی ، کہا : مجھے علی بن حسین بن علی نے بتا یا کہ حسین بن علی رضی اللہ تعالیٰ عنہ نے انھیں خبر دی کہ علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ مجھے بدر کے دن مال غنیمت میں ایک اونٹنی ملی اور اسی دن ایک اونٹنی رسول اللہ صلی اللہ علیہ وسلم نے مجھے خمس میں سے اور دی ۔ پھر جب میں نے چاہا کہ فاطمۃالزہراء رضی اللہ عنہا سے شادی کروں جو کہ رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی تھیں تو میں نے بنی قینقاع کے ایک سنار سے وعدہ کیا کہ وہ میرے ساتھ چلے اور ہم دونوں مل کر اذخر لائیں اور سناروں کے ہاتھ بیچیں اور اس سے میں اپنی شادی کا ولیمہ کروں ۔ میں اپنی دونوں اونٹنیوں کا سامان پالان ، رکابیں اور رسیاں وغیرہ اکٹھا کر رہا تھا اور وہ دونوں اونٹنیاں ایک انصاری کی کوٹھری کے بازو میں بیٹھی تھیں ۔ جس وقت میں یہ سامان جو اکٹھا کر رہا تھا اکٹھا کر کے لوٹا تو کیا دیکھتا ہوں کہ دونوں اونٹنیوں کے کوہان کٹے ہوئے ہیں ، ان کی کوکھیں پھٹی ہوئی ہیں اور ان کے جگر نکال لئے گئے ۔ مجھ سے یہ دیکھ کر نہ رہا گیا اور میری آنکھیں تھم نہ سکیں ( یعنی میں رونے لگا یہ رونا دنیا کے طمع سے نہ تھا بلکہ سیدہ فاطمۃالزہراء اور رسول اللہ صلی اللہ علیہ وسلم کے حق میں جو تقصیر ہوئی ، اس خیال سے تھا ) میں نے پوچھا کہ یہ کس نے کیا؟ لوگوں نے کہا کہ حمزہ رضی اللہ عنہ بن عبدالمطلب نے اور وہ اس گھر میں انصار کی ایک جماعت کے ساتھ ہیں جو شراب پی رہے ہیں ، ان کے سامنے اور ان کے ساتھیوں کے سامنے ایک گانے والی نے گانا گایا تو گانے میں یہ کہا کہ اے حمزہ اٹھ ان موٹی اونٹنیوں کو اسی وقت لے ۔ حمزہ رضی اللہ عنہ تلوار لے کر اٹھے اور ان کے کوہان کاٹ لئے اور کوکھیں پھاڑ ڈالیں اور جگر ( کلیجہ ) نکال لیا ۔ سیدنا علی رضی اللہ عنہ نے کہا کہ یہ سن کر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا ، وہاں زید بن حارثہ رضی اللہ عنہ بیٹھے تھے ۔ آپ صلی اللہ علیہ وسلم نے مجھے دیکھتے ہی میرے چہرے سے رنج و مصیبت کو پہچان لیا اور فرمایا کہ تجھ کو کیا ہوا؟ میں نے عرض کیا کہ یا رسول اللہ! اللہ کی قسم! آج کا سا دن میں نے کبھی نہیں دیکھا ۔ حمزہ رضی اللہ عنہ نے میری دونوں اونٹنیوں پر ظلم کیا ، ان کے کوہان کاٹ لئے ، کوکھیں پھاڑ ڈالیں اور وہ اس گھر میں چند شرابیوں کے ساتھ ہیں ۔ یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے اپنی چادر منگوا کر اوڑھی اور پھر پیدل چلے ، میں اور زید بن حارثہ دونوں آپ صلی اللہ علیہ وسلم کے پیچھے تھے ، یہاں تک کہ آپ صلی اللہ علیہ وسلم اس دروازے پر آئے جہاں حمزہ رضی اللہ عنہ تھے اور اندر آنے کی اجازت مانگی ۔ لوگوں نے اجازت دی ۔ دیکھا تو وہ شراب پئے ہوئے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے سیدنا حمزہ رضی اللہ عنہ کو اس کام پر ملامت شروع کی اور سیدنا حمزہ کی آنکھیں ( نشے کی وجہ سے ) سرخ تھیں انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، پھر آپ رضی اللہ عنہ کے گھٹنوں کو دیکھا ، پھر نگاہ بلند کی تو ناف کو دیکھا ۔ پھر نگاہ بلند کی تو منہ کو دیکھا اور ( نشے میں دھت ہونے کی وجہ سے ) کہا کہ تم تو میرے باپ دادوں کے غلام ہو ۔ تب رسول اللہ صلی اللہ علیہ وسلم نے پہچانا کہ وہ نشہ میں مست ہیں تو آپ صلی اللہ علیہ وسلم الٹے پاؤں پھرے اور باہر نکلے ۔ ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ نکلے ۔",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		}
	]
}