{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5358,
			"arabicnumber": "2053.03",
			"text": "حضرت ایوب انصاری رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام افلح نے حضرت ایوب انصاری رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم ان کے ہاں مہمان ٹھرے تو آپ صلی اللہ علیہ وسلم نیچے کے مکان میں رہے اور سیدنا ابوایوب رضی اللہ عنہ اوپر کے درجہ میں تھے ۔ ایک دفعہ سیدنا ابوایوب رضی اللہ عنہ رات کو جاگے اور کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے سر کے اوپر چلا کرتے ہیں ، پھر ہٹ کر رات کو ایک کونے میں ہو گئے ۔ پھر اس کے بعد سیدنا ابوایوب رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم سے اوپر جانے کے لئے کہا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ نیچے کا مکان آرام کا ہے ( رہنے والوں کے لئے اور آنے والوں کے لئے اور اسی لئے رسول اللہ نیچے کے مکان میں رہتے تھے ) ۔ سیدنا ابوایوب رضی اللہ عنہ نے کہا میں اس چھت پر نہیں رہ سکتا جس کے نیچے آپ صلی اللہ علیہ وسلم ہوں ۔ یہ سن کر آپ صلی اللہ علیہ وسلم اوپر کے درجہ میں تشریف لے گئے اور ابوایوب رضی اللہ عنہ نیچے کے درجے میں آ گئے ۔ سیدنا ابوایوب رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے لئے کھانا تیار کرتے تھے ، پھر جب آپ صلی اللہ علیہ وسلم کے پاس کھانا آتا ( اور آپ صلی اللہ علیہ وسلم اس میں سے کھاتے اور اس کے بعد بچا ہوا کھانا واپس جاتا ) تو سیدنا ابوایوب رضی اللہ عنہ ( آدمی سے ) پوچھتے کہ آپ صلی اللہ علیہ وسلم کی انگلیاں کھانے کی کس جگہ پر لگی ہیں اور وہ وہیں سے ( برکت کے لئے ) کھاتے ۔ ایک دن سیدنا ابوایوب رضی اللہ عنہ نے کھانا پکایا ، جس میں لہسن تھا ۔ جب کھانا واپس گیا تو سیدنا ابوایوب رضی اللہ عنہ نے پوچھا کہ آپ صلی اللہ علیہ وسلم کی انگلیاں کہاں لگی تھیں؟ انہیں بتایا گیا کہ آپ صلی اللہ علیہ وسلم نے کھانا نہیں کھایا ۔ یہ سن کر سیدنا ابوایوب رضی اللہ عنہ گھبرا گئے اور اوپر گئے اور پوچھا کہ کیا لہسن حرام ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ، لیکن میں اسے ناپسند کرتا ہوں ۔ سیدنا ابوایوب رضی اللہ عنہ نے کہا جو چیز آپ صلی اللہ علیہ وسلم کو ناپسند ہے ، مجھے بھی ناپسند ہے ۔ سیدنا ابوایوب رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ( فرشتے ) آتے تھے ( اور فرشتوں کو لہسن کی بو سے تکلیف ہوتی اس لئے آپ صلی اللہ علیہ وسلم نہ کھاتے ) ۔",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 232
			}
		}
	]
}