{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5362,
			"arabicnumber": "2055.01",
			"text": "شبانہ بن سوار نے کہا : ہمیں سلیمان بن مغیرہ نے ثابت سے حدیث بیان کی ، انھوں نے عبدالرحمان بن ابی لیلیٰ سے ، انھوں نے حضرت مقدار رضی اللہ تعالیٰ عنہ سے روایت کی ، سیدنا مقداد رضی اللہ عنہ کہتے ہیں کہ میں اور میرے دونوں ساتھی آئے اور ( فاقہ وغیرہ کی ) تکلیف سے ہماری آنکھوں اور کانوں کی قوت جاتی رہی تھی ۔ ہم اپنے آپ کو رسول اللہ صلی اللہ علیہ وسلم کے اصحاب پر پیش کرتے تھے لیکن کوئی ہمیں قبول نہ کرتا تھا ۔ آخر ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو آپ صلی اللہ علیہ وسلم ہمیں اپنے گھر لے گئے ۔ وہاں تین بکریاں تھیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کا دودھ دوہو ، ہم تم سب پئیں گے پھر ہم ان کا دودھ دوہا کرتے اور ہم میں سے ہر ایک اپنا حصہ پی لیتا اور رسول اللہ صلی اللہ علیہ وسلم کا حصہ رکھ چھوڑتے ۔ آپ صلی اللہ علیہ وسلم رات کو تشریف لاتے اور ایسی آواز سے سلام کرتے جس سے سونے والا نہ جاگے اور جاگنے والا سن لے ۔ پھر آپ صلی اللہ علیہ وسلم مسجد میں آتے ، نماز پڑھتے ، پھر اپنے دودھ کے پاس آتے اور اس کو پیتے ۔ ایک رات جب میں اپنا حصہ پی چکا تھا کہ شیطان نے مجھے بھڑکایا ۔ شیطان نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم تو انصار کے پاس جاتے ہیں ، وہ آپ صلی اللہ علیہ وسلم کو تحفے دیتے ہیں اور جو آپ صلی اللہ علیہ وسلم کو ضرورت ہے ، مل جاتا ہے آپ صلی اللہ علیہ وسلم کو اس ایک گھونٹ دودھ کی کیا ضرورت ہو گی؟ آخر میں آیا اور وہ دودھ پی گیا ۔ جب دودھ پیٹ میں سما گیا اور مجھے یقین ہو گیا کہ اب وہ دودھ نہیں ملنے کا تو اس وقت شیطان نے مجھے ندامت کی اور کہنے لگا کہ تیری خرابی ہو تو نے کیا کام کیا؟ تو نے رسول اللہ صلی اللہ علیہ وسلم کا حصہ پی لیا ، اب آپ صلی اللہ علیہ وسلم آئیں گے اور دودھ کو نہ پائیں گے تو تجھ پر بددعا کریں گے اور تیری دنیا اور آخرت دونوں تباہ ہوں گی ۔ میں ایک چادر اوڑھے ہوئے تھا جب اس کو پاؤں پر ڈالتا تو سر کھل جاتا اور جب سر ڈھانپتا تو پاؤں کھل جاتے تھے اور مجھے نیند بھی نہ آ رہی تھی جبکہ میرے ساتھی سو گئے اور انہوں نے یہ کام نہیں کیا تھا جو میں نے کیا تھا ۔ آخر رسول اللہ صلی اللہ علیہ وسلم آئے اور معمول کے موافق سلام کیا ، پھر مسجد میں آئے اور نماز پڑھی ، اس کے بعد دودھ کے پاس آئے ، برتن کھولا تو اس میں کچھ نہ تھا ۔ آپ صلی اللہ علیہ وسلم نے اپنا سر آسمان کی طرف اٹھایا میں سمجھا کہ اب آپ صلی اللہ علیہ وسلم بددعا کرتے ہیں اور میں تباہ ہوا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! کھلا اس کو جو مجھے کھلائے اور پلا اس کو جو مجھے پلائے ۔ یہ سن کر میں نے اپنی چادر کو مضبوط باندھا ، چھری لی اور بکریوں کی طرف چلا کہ جو ان میں سے موٹی ہو اس کو رسول اللہ صلی اللہ علیہ وسلم کے لئے ذبح کروں ۔ دیکھا تو اس کے تھن میں دودھ بھرا ہوا ہے ۔ پھر دیکھا تو اور بکریوں کے تھنوں میں بھی دودھ بھرا ہوا ہے ۔ میں نے آپ صلی اللہ علیہ وسلم کے گھر والوں کا ایک برتن لیا جس میں وہ دودھ نہ دوہتے تھے ( یعنی اس میں دوہنے کی خواہش نہیں کرتے تھے ) ۔ اس میں میں نے دودھ دوہا ، یہاں تک کہ اوپر جھاگ آ گیا ( اتنا بہت دودھ نکلا ) اور میں اس کو لے کر آپ صلی اللہ علیہ وسلم کے پاس آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم نے اپنے حصے کا دودھ رات کو پیا یا نہیں؟ میں نے عرض کیا کہ یا رسول اللہ! آپ دودھ پیجئے ۔ آپ صلی اللہ علیہ وسلم نے پی کر مجھے دیا تو میں نے عرض کیا کہ یا رسول اللہ! اور پیجئے ۔ آپ صلی اللہ علیہ وسلم نے اور پیا ۔ پھر مجھے دیا ، جب مجھے معلوم ہو گیا کہ آپ صلی اللہ علیہ وسلم سیر ہو گئے اور آپ صلی اللہ علیہ وسلم کی دعا میں نے لے لی ہے ، تب میں ہنسا ، یہاں تک کہ خوشی کے مارے زمین پر گر گیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے مقداد! تو نے کوئی بری بات کی؟ وہ کیا ہے؟ میں نے عرض کیا کہ یا رسول اللہ! میرا حال ایسا ہوا اور میں نے ایسا قصور کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس وقت کا دودھ ( جو خلاف معمول اترا ) اللہ کی رحمت تھی ۔ تو نے مجھ سے پہلے ہی کیوں نہ کہا ہم اپنے دونوں ساتھیوں کو بھی جگا دیتے کہ وہ بھی یہ دودھ پیتے؟ میں نے عرض کیا کہ قسم اس کی جس نے آپ صلی اللہ علیہ وسلم کو سچا کلام دے کر بھیجا ہے کہ اب مجھے کوئی پرواہ نہیں جب آپ نے اللہ کی رحمت حاصل کر لی اور میں نے آپ صلی اللہ علیہ وسلم کے ساتھ حاصل کی تو کوئی بھی اس کو حاصل کرے ۔",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 236
			}
		}
	]
}