{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6121,
			"arabicnumber": "2359.03",
			"text": "یونس نے ابن شہاب سے خبر دی ، کہا : مجھے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے خبر دی کہ ( ایک دن ) رسول اللہ صلی اللہ علیہ وسلم سورج ڈھلنے کے بعد باہر تشریف لائے اور انھیں ظہر کی نماز پڑھائی ، جب آ پ نے سلام پھیرا تو منبر پر کھڑے ہوئے اور قیامت کا ذکر کیا اور بتایا کہ اس سے پہلے بہت بڑے بڑے امور وقوع پزیر ہوں گے ، پھر فرمایا : \"\" جو شخص ( ان میں سے ) کسی چیز کے بارے میں سوال کرنا چاہے تو سوا ل کرلے ۔ اللہ کی قسم!میں جب تک اس جگہ کھڑا ہوں ، تم مجھ سے جس چیز کے بارے میں بھی سوال کروگے میں تمھیں اس کے بارے میں بتاؤں گا ۔ \"\" حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے کہا : جب لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ سنا اور آپ نے بار بار کہنا شروع کردیا : \"\" مجھ سے پوچھو \"\" تو لوگ بہت روئے ، اتنے میں عبداللہ بن حذافہ رضی اللہ تعالیٰ عنہ کھڑے ہوگئے اور کہنے لگے : اللہ کے رسول صلی اللہ علیہ وسلم !میرا باپ کون تھا؟رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تمھارا باپ حذافہ تھا ۔ \"\" پھر جب رسول اللہ صلی اللہ علیہ وسلم نے زیادہ بار \"\" مجھ سے پوچھو \"\" فرمانا شروع کیا ( اور پتہ چل گیا کہ آپ غصے میں کہہ رہے ہیں ) توحضرت عمر رضی اللہ تعالیٰ عنہ گھٹنوں کے بل بیٹھ گئے اور کہنے لگے : ہم اللہ کے رب ہونے ، اسلام کے دین ہونے ، اور محمد صلی اللہ علیہ وسلم کے رسول ہونے پر راضی ہیں ۔ جب حضرت عمر رضی اللہ تعالیٰ عنہ نے یہ کہا تو رسول اللہ صلی اللہ علیہ وسلم نے سکوت اختیار فرمالیا ۔ کہا : اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اچھا اس ذات کی قسم جس کے ہاتھ میں محمد کی جان ہے!ابھی ابھی اس دیوار کی چوڑائی کے اندرجنت اور دوزخ کو میرے سامنے پیش کیا گیا تو خیر اورشر کے بارے میں جو میں نے آج دیکھا ، کبھی نہیں دیکھا ۔ \"\" ابن شہاب نے کہا : عبیداللہ بن عبداللہ بن عتبہ نے مجھے بتایاکہ عبداللہ بن حذافہ رضی اللہ تعالیٰ عنہ ( کی یہ بات سن کر ان ) کی والدہ نے عبداللہ بن حذافہ رضی اللہ تعالیٰ عنہ سے کہا : میں نے کبھی نہیں سنا کہ کوئی بیٹا تم سے زیادہ والدین کا حق پامال کرنے والا ہو ۔ کیا تم خود کو اس بات سے محفوظ سمجھتے تھے کہ ہوسکتا ہے تمہاری ماں سے بھی کوئی ایسا کام ہوگیا ہو کہ جو اہل جاہلیت کی عورتوں سے ہوجاتا تھا تو تم اس طرح ( سوال کرکے ) سب لوگوں کے سامنے اپنی ماں کو رسوا کردیتے؟عبداللہ بن حذافہ رضی اللہ تعالیٰ عنہ نے کہا : اللہ کی قسم!اگر آپ صلی اللہ علیہ وسلم میرا نسب کسی حبشی غلام سے بھی ملا دیتے تو میں اسی کی ولدیت اختیار کرلیتا ۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 179
			}
		}
	]
}