{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6145,
			"arabicnumber": "2371",
			"text": "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : سیدنا ابراہیم علیہ السلام نے کبھی جھوٹ نہیں بولا مگر ، تین دفعہ ( بولا ) ( یہ اصطلاحاً جھوٹ کہے گئے ہیں ، حقیقت میں جھوٹ نہیں ہیں بلکہ یہ توریہ کی ایک شکل ہیں ) ان میں سے دو جھوٹ اللہ کے لئے تھے ، ایک تو ان کا یہ قول کہ ”میں بیمار ہوں“ اور دوسرا یہ کہ ”ان بتوں کو بڑے بت نے توڑا ہو گا“تیسرا جھوٹ سیدہ سارہ علیہا السلام کے بارے میں تھا ۔ اس کا قصہ یہ ہے کہ سیدنا ابراہیم علیہ السلام ایک ظالم بادشاہ کے ملک میں پہنچے ان کے ساتھ ان کی بیوی سیدہ سارہ بھی تھیں اور وہ بڑی خوبصورت تھیں ۔ انہوں نے اپنی بیوی سے کہا کہ اس ظالم بادشاہ کو اگر معلوم ہو گا کہ تو میری بیوی ہے تو مجھ سے چھین لے گا ، اس لئے اگر وہ پوچھے تو یہ کہنا کہ میں اس شخص کی بہن ہوں اور تو اسلام کے رشتہ سے میری بہن ہے ۔ ( یہ بھی کچھ جھوٹ نہ تھا ) اس لئے کہ ساری دنیا میں آج میرے اور تیرے سوا کوئی مسلمان معلوم نہیں ہوتا جب سیدنا ابراہیم علیہ السلام اس کی قلم رو ( اس کے علاقہ ) سے گزر رہے تھے تو اس ظالم بادشاہ کے کارندے اس کے پاس گئے اور بیان کیا کہ تیرے ملک میں ایک ایسی عورت آئی ہے جو تیرے سوا کسی کے لائق نہیں ہے ۔ اس نے سیدہ سارہ کو بلا بھیجا ۔ وہ گئیں تو سیدنا ابراہیم علیہ السلام نماز کے لئے کھڑے ہو گئے ( اللہ سے دعا کرنے لگے اس کے شر سے بچنے کے لئے ) جب سیدہ سارہ اس ظالم کے پاس پہنچیں تو اس نے بے اختیار اپنا ہاتھ ان کی طرف دراز کیا ، لیکن فوراً اس کا ہاتھ سوکھ گیا وہ بولا کہ تو اللہ سے دعا کر کہ میرا ہاتھ کھل جائے ، میں تجھے نہیں ستاؤں گا ۔ انہوں نے دعا کی اس مردود نے پھر ہاتھ دراز کیا ، پھر پہلے سے بڑھ کر سوکھ گیا ۔ اس نے دعا کے لئے کہا تو انہوں نے دعا کی ۔ پھر اس مردود نے دست درازی کی ، پھر پہلی دونوں دفعہ سے بڑھ کر سوکھ گیا ۔ تب وہ بولا کہ اللہ سے دعا کر کہ میرا ہاتھ کھل جائے ، اللہ کی قسم اب میں تجھ کو نہ ستاؤں گا ۔ سیدہ سارہ نے پھر دعا کی ، اس کا ہاتھ کھل گیا ۔ تب اس نے اس شخص کو بلایا جو سیدہ سارہ کو لے کر آیا تھا اور اس سے بولا کہ تو میرے پاس شیطاننی کو لے کر آیا ، یہ انسان نہیں ہے اس کو میرے ملک سے باہر نکال دے اور ایک لونڈی ہاجرہ اس کے حوالے کر دے سیدہ سارہ ہاجرہ کو لے کر لوٹ آئیں جب سیدنا ابراہیم علیہ السلام نے دیکھا تو نمازوں سے فارغ ہوئے اور کہا کیا ہوا؟ سارہ نے کہا بس کہ سب خیریت رہی ، اللہ تعالیٰ نے اس بدکار کا ہاتھ مجھ سے روک دیا اور ایک لونڈی بھی دی ۔ سیدنا ابوہریرہ رضی اللہ عنہ نے کہا کہ پھر یہی لونڈی یعنی ہاجرہ تمہاری ماں ہے اے بارش کے بچو",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 203
			}
		}
	]
}