{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6151,
			"arabicnumber": "2373.01",
			"text": "حجین بن مثنیٰ نے کہا : ہمیں عبد العز یز بن عبد اللہ بن ابی سلمہ نے عبد اللہ بن فضل ہاشمی سے حدیث بیان کی ، انھوں نے عبد الرحمٰن اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ایک بار ایک یہودی اپنا سامان بیچ رہا تھا اس کو اس کے کچھ معاوضے کی پیش کش کی گئی جو اسے بری لگی یا جس پر وہ راضی نہ ہوا ۔ شک عبد العزیز کو ہوا ۔ وہ کہنے لگا نہیں ، اس ذات کی قسم جس نے موسیٰ علیہ السلام کو تمام انسانوں پر فضیلت دی !انصار میں سے ایک شخص نے اس کی بات سن لی تو اس کے چہرے پر تھپڑلگا یا ، کہا : تم کہتے ہو ۔ اس ذات کی قسم جس نے موسیٰ علیہ السلام کو تمام انسانوں پر فضیلت دی!جبکہ رسول اللہ صلی اللہ علیہ وسلم ( تشریف لا چکے اور ) ہمارے درمیان مو جو د ہیں ۔ کہا : تو وہ یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس آگیا اور کہنے لگا : ابو القاسم !میری ذمہ داری لی گئی ہے اور ہم سے ( سلامتی کا ) وعدہ کیا گیا ہے ۔ اور کہا : فلا ں شخص نے میرے منہ پر تھپڑ مارا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے کہا : \" تم نے اس کے منہ پر تھپڑ کیوں مارا ؟کہا کہ اس نے کہا تھا ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ۔ اس ذات کی قسم جس نے حضرت موسیٰ کہا : کو تمام انسانوں پر فضیلت دی ہے جبکہ آپ ہمارے درمیان مو جود ہیں تو رسول اللہ صلی اللہ علیہ وسلم کو غصہ آگیا اور آپ کے چہرہ مبارک سے غصےکا پتہ چلنے لگا ، پھر آپ نے فر ما یا : \" اللہ کے نبیوں کے مابین ( انھیں ایک دوسرے پر ) فضیلت نہ دیا کرو اس لیے کہ جب صور پھونکا جا ئے گا تو سوائے ان کے جنھیں اللہ چا ہے گا آسمانوں اور زمین میں جو مخلوق ہے سب کے ہوش و حواس جا تے رہیں گے ، پھر دوبارہ صور پھونکا جا ئے گا ، تو سب سے پہلے جسے اٹھا یا جا ئے گا وہ میں ہو ں گا یا ( فرمایا ) جنھیں سب سے پہلے اٹھا یا جا ئے گا میں ان میں ہو ں گا ۔ تو ( میں دیکھوں گا ۔ کہ ) حضرت موسیٰ علیہ السلام عرش کو پکڑ ے ہو ئے ہوں گے ، مجھے معلوم نہیں کہ ان کے لیے یوم طور کی بے ہو شی کو شمار کیا جا ئے گا ۔ ( اور وہ اس کے عوض اس بے ہوشی سےمستثنیٰ ہو ں گے ، ) یاانھیں مجھ سے پہلے ہی اٹھا یا جا ئے گا ، میں ( یہ بھی ) نہیں کہتا کہ کو ئی ( نبی ) یو نس بن متی علیہ السلام سے افضل ہے ۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 209
			}
		}
	]
}