{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6163,
			"arabicnumber": "2380.01",
			"text": "عمرو بن محمد ناقد ، اسحاق بن ابراہیم حنظلی ، عبیداللہ بن سعید اور محمد بن ابی عمر مکی ، ان سب نے ہمیں ابن عیینہ سے حدیث بیان کی ۔ الفاظ ابن ابی عمر کے ہیں ۔ سفیان بن عیینہ نے کہا : ہمیں عمرو بن دینار نے سعید بن جبیر سے حدیث بیان کی ، انھوں نے کہا : کہ میں نے سیدنا ابن عباس رضی اللہ عنہما سے کہا کہ نوف بکالی کہتا ہے کہ سیدنا موسیٰ علیہ السلام جو بنی اسرائیل کے پیغمبر تھے ، وہ اور ہیں اور جو موسیٰ خضر علیہ السلام کے پاس گئے تھے وہ اور ہیں انہوں نے کہا کہ اللہ کا دشمن جھوٹ بولتا ہے ۔ میں نے سیدنا ابی بن کعب رضی اللہ عنہ سے سنا ، وہ کہتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ سیدنا موسیٰ علیہ السلام اپنی قوم بنی اسرائیل پر خطبہ پڑھنے کو کھڑے ہوئے ، ان سے پوچھا گیا کہ سب لوگوں میں زیادہ علم کس کو ہے؟ انہوں نے کہا کہ مجھ کو ہے ( یہ بات اللہ تعالیٰ کو ناپسند ہوئی ) پس اللہ تعالیٰ نے ان پر اس وجہ سے ناراضگی کا اظہار کیا کہ انہوں نے یہ نہیں کہا کہ اللہ تعالیٰ خوب جانتا ہے ۔ پھر اللہ تعالیٰ نے ان کو وحی بھیجی کہ دو دریاؤں کے ملاپ پر میرا ایک بندہ ہے ، وہ تجھ سے زیادہ عالم ہے سیدنا موسیٰ علیہ السلام نے عرض کیا کہ اے پروردگار! میں اس سے کیسے ملوں؟ حکم ہوا کہ ایک مچھلی زنبیل ( ٹوکرے ) میں رکھ ، جہاں وہ مچھلی گم ہو جائے ، وہیں وہ بندہ ملے گا ۔ یہ سن کر سیدنا موسیٰ علیہ السلام اپنے ساتھی یوشع بن نون علیہ السلام کو ساتھ لے کر چلے اور انہوں نے ایک مچھلی زنبیل میں رکھ لی ۔ دونوں چلتے چلتے صخرہ ( ایک مقام ہے ) کے پاس پہنچے تو سیدنا موسیٰ علیہ السلام اور ان کے ساتھی سو گئے ۔ مچھلی تڑپی یہاں تک کہ زنبیل سے نکل کر دریا میں جا پڑی اور اللہ تعالیٰ نے پانی کا بہنا اس پر سے روک دیا ، یہاں تک کہ پانی کھڑا ہو کر طاق کی طرح ہو گیا اور مچھلی کے لئے خشک راستہ بن گیا ۔ سیدنا موسیٰ علیہ السلام اور ان کے ساتھی کے لئے تعجب ہوا پھر دونوں چلے دن بھر اور رات بھر اور موسیٰ علیہ السلام کے ساتھی مچھلی کا حال ان سے کہنا بھول گئے جب صبح ہوئی تو موسیٰ علیہ السلام نے اپنے ساتھی سے کہا کہ ہمارا ناشتہ لاؤ ، ہم تو اس سفر سے تھک گئے ہیں اور تھکاوٹ اسی وقت ہوئی جب اس جگہ سے آگے بڑھے جہاں جانے کا حکم ہوا تھا ۔ انہوں نے کہا کہ آپ کو معلوم نہیں کہ جب ہم ( مقام ) صخرہ پر اترے تو میں مچھلی بھول گیا اور شیطان نے مجھے بھلایا اور تعجب ہے کہ اس مچھلی نے دریا میں جانے کی راہ لی ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ ہم تو اسی مقام کو ڈھونڈھتے تھے ، پھر دونوں اپنے پاؤں کے نشانوں پر لوٹے یہاں تک کہ صخرہ پر پہنچے ۔ وہاں ایک شخص کو کپڑا اوڑھے ہوئے دیکھا تو سیدنا موسیٰ علیہ السلام نے ان کو سلام کیا تو انہوں نے کہا کہ تمہارے ملک میں سلام کہاں سے ہے؟ سیدنا موسیٰ علیہ السلام نے کہا کہ میں موسیٰ ہوں ۔ انہوں نے کہا کہ بنی اسرائیل کے موسیٰ؟ سیدنا موسیٰ نے کہا کہ ہاں ۔ سیدنا خضر علیہ السلام نے کہا کہ تمہیں اللہ تعالیٰ نے وہ علم دیا ہے جو میں نہیں جانتا ۔ اور مجھے وہ علم دیا ہے جو تم نہیں جانتے سیدنا موسیٰ علیہ السلام نے کہا کہ میں تمہارے ساتھ رہنا چاہتا ہوں اس لئے کہ مجھے وہ علم سکھلاؤ جو تمہیں دیا گیا ہے ۔ سیدنا خضر علیہ السلام نے کہا کہ تم میرے ساتھ صبر نہ کر سکو گے اور تم سے اس بات پر کیسے صبر ہو سکے گا جس کو تم نہیں جانتے ہو ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ اگر اللہ نے چاہا تو تم مجھے صابر پاؤ گے اور میں کسی بات میں تمہاری نافرمانی نہیں کروں گا ۔ سیدنا خضر علیہ السلام نے کہا کہ اچھا اگر میرے ساتھ ہوتے ہو تو مجھ سے کوئی بات نہ پوچھنا جب تک میں خود اس کا ذکر نہ کروں ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ بہت اچھا ۔ پس خضر علیہ السلام اور سیدنا موسیٰ علیہ السلام دونوں سمندر کے کنارے چلے جاتے تھے کہ ایک کشتی سامنے سے نکلی ، دونوں نے کشتی والوں سے کہا کہ ہمیں بٹھا لو ، انہوں نے سیدنا خضر علیہ السلام کو پہچان لیا اور دونوں کو بغیر کرایہ چڑھا لیا ۔ سیدنا خضر علیہ السلام نے اس کشتی کا ایک تختہ اکھاڑ ڈالا ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ ان لوگوں نے تو ہمیں بغیر کرایہ کے چڑھایا اور تم نے ان کی کشتی کو توڑ ڈالا تاکہ کشتی والوں کو ڈبو دو ، یہ تم نے بڑا بھاری کام کیا ۔ سیدنا خضر علیہ السلام نے کہا کہ کیا میں نہیں کہتا تھا کہ تم میرے ساتھ صبر نہ کر سکو گے؟ سیدنا موسیٰ علیہ السلام نے کہا کہ بھول چوک پر مت پکڑو اور مجھ پر تنگی مت کرو ۔ پھر دونوں کشتی سے باہر نکلے اور سمندر کے کنارے چلے جاتے تھے کہ ایک لڑکا ملا جو اور لڑکوں کے ساتھ کھیل رہا تھا ، سیدنا خضر علیہ السلام نے اس کا سر پکڑ کر اکھیڑ لیا اور مار ڈالا ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ تم نے ایک بےگناہ کو ناحق مار ڈالا ، یہ تو بہت برا کام کیا ۔ سیدنا خضر علیہ السلام نے کہا کہ کیا میں نہ کہتا تھا کہ تم میرے ساتھ صبر نہ کر سکو گے؟ اور یہ کام پہلے کام سے بھی زیادہ سخت تھا ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ اب میں تم سے کسی بات پر اعتراض کروں تو مجھے اپنے ساتھ نہ رکھنا بیشک تمہارا اعتراض بجا ہو گا ۔ پھر دونوں چلے یہاں تک کہ ایک گاؤں میں پہنچے ، گاؤں والوں سے کھانا مانگا تو انہوں نے انکار کیا ، پھر ایک دیوار ملی جو گرنے کے قریب تھی اور جھک گئی تھی ، سیدنا خضر علیہ السلام نے اس کو اپنے ہاتھ سے سیدھا کر دیا ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ ان گاؤں والوں سے ہم نے کھانا مانگا اور انہوں نے انکار کیا اور کھانا نہ کھلایا ( ایسے لوگوں کا کام مفت کرنا کیا ضروری تھا؟ ) اگر تم چاہتے تو اس کی مزدوری لے سکتے تھے ۔ سیدنا خضر علیہ السلام نے کہا کہ بس ، اب میرے اور تمہارے درمیان جدائی ہے ، اب میں تم سے ان باتوں کا مطلب کہے دیتا ہوں جن پر تم سے صبر نہ ہو سکا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ موسیٰ علیہ السلام پر رحم کرے ، مجھے آرزو ہے کہ کاش وہ صبر کرتے اور ہمیں ان کی اور باتیں معلوم ہوتیں ۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ پہلی بات سیدنا موسیٰ علیہ السلام نے بھولے سے کی ۔ پھر ایک چڑیا آئی اور کشتی کے کنارے پر بیٹھی اور اس نے سمندر میں چونچ ڈالی ، سیدنا خضر علیہ السلام نے کہا کہ میں نے اور تم نے اللہ تعالیٰ کے علم میں سے اتنا ہی علم سیکھا ہے جتنا اس چڑیا نے سمندر میں سے پانی کم کیا ہے ۔ سیدنا سعید بن جبیر نے کہا کہ سیدنا ابن عباس رضی اللہ عنہما اس طرح پڑھتے تھے کہ ”ان کشتی والوں کے آگے ایک بادشاہ تھا جو ہر ثابت کشتی کو ناحق جبر سے چھین لیتا تھا“ اور پڑھتے تھے کہ ”وہ لڑکا کافر تھا“ ۔",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 221
			}
		}
	]
}