{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6214,
			"arabicnumber": "2403.03",
			"text": "یحییٰ بن حسان نے کہا : ہمیں سلیمان بن بلال نے شریک بن ابی نمر سے ، انھوں نے سعید بن مسیب سے روایت کی ، کہا : کہ مجھے سیدنا ابوموسیٰ اشعری رضی اللہ عنہ نے خبر دی کہ انہوں نے اپنے گھر میں وضو کیا ، پھر باہر نکلے ۔ سیدنا ابوموسیٰ کہتے ہیں کہ میں نے کہا کہ آج میں دن بھر رسول اللہ صلی اللہ علیہ وسلم کا ساتھ نہ چھوڑوں گا ، آپ صلی اللہ علیہ وسلم کے پاس ہی رہوں گا ۔ کہتے ہیں کہ پھر مسجد میں آیا تو نبی کریم صلی اللہ علیہ وسلم کے بارے میں پوچھا ۔ لوگوں نے کہا کہ باہر اس طرف تشریف لے گئے ہیں ۔ میں بھی آپ صلی اللہ علیہ وسلم کے قدموں کے نشان پر چلا اور آپ صلی اللہ علیہ وسلم کے بارے میں لوگوں سے پوچھتا جاتا تھا ۔ چلتے چلتے معلوم ہوا کہ آپ صلی اللہ علیہ وسلم مقام اریس پر باغ میں گئے ہیں ۔ میں دروازے کے قریب بیٹھ گیا جو کھجور کی ڈالیوں کا بنا ہوا تھا ، یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم حاجت سے فارغ ہوئے اور وضو کر چکے تو میں آپ صلی اللہ علیہ وسلم کی طرف چل دیا ۔ میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم اریس کنوئیں کی منڈیر پر بیٹھے ہیں اور دونوں پنڈلیاں کھول کر کنوئیں میں لٹکا دی ہیں ۔ پس میں نے آپ صلی اللہ علیہ وسلم کو سلام کیا اور پھر لوٹ کر دروازے کے قریب بیٹھ گیا ۔ میں نے ( دل میں ) کہا کہ میں آج نبی کریم صلی اللہ علیہ وسلم کا دربان ، چوکیدار رہوں گا ۔ اتنے میں سیدنا ابوبکر رضی اللہ عنہ آئے اور دروازے کو دھکیلا ۔ میں نے پوچھا کون ہے؟ انہوں نے کہا کہ ابوبکر ہوں ، میں نے کہا ذرا ٹھہرو ۔ پھر میں گیا اور کہا کہ یا رسول اللہ! ابوبکر اندر آنے کی اجازت چاہتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کو آنے دو اور جنت کی خوشخبری دو ۔ میں آیا اور سیدنا ابوبکر سے کہا کہ اندر داخل ہو ، اور رسول اللہ صلی اللہ علیہ وسلم نے آپ کو جنت کی خوشخبری دی ہے ۔ پس سیدنا ابوبکر داخل ہوئے اور نبی کریم صلی اللہ علیہ وسلم کی داہنی طرف اسی منڈیر پر دونوں پاؤں لٹکا کر پنڈلیاں کھول کر جیسے نبی کریم صلی اللہ علیہ وسلم بیٹھے تھے ، بیٹھ گئے ۔ میں لوٹ آیا اور پھر بیٹھ گیا اور میں اپنے بھائی ( عامر ) کو گھر میں وضو کرتے چھوڑ آیا تھا ، میں نے کہا کہ اگر اللہ تعالیٰ کو فلاں ( یعنی ) میرے بھائی کی بھلائی منظور ہے تو اس کو یہاں لے آئے گا ۔ اتنے میں ( کیا دیکھتا ہوں کہ ) کوئی دروازہ ہلانے لگا ہے ۔ میں نے پوچھا کون ہے؟ جواب آیا کہ عمر بن خطاب ۔ میں نے کہا ٹھہر جا ۔ پھر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ، سلام کیا اور کہا کہ سیدنا عمر بن خطاب اندر آنے کی اجازت چاہتے ہیں؟ فرمایا کہ انہیں اجازت دو اور جنت کی خوشخبری بھی دو ۔ پس میں گیا اور کہا کہ اندر داخل ہو اور رسول اللہ صلی اللہ علیہ وسلم نے تجھے جنت کی خوشخبری دی ہے ۔ پس وہ بھی داخل ہوئے اور رسول اللہ صلی اللہ علیہ وسلم کے بائیں طرف اسی منڈیر پر بیٹھ گئے اور دونوں پاؤں کنوئیں میں لٹکا دئیے ۔ پھر میں لوٹ آیا اور ( دروازے پر ) بیٹھ گیا ۔ میں نے کہا کہ اگر اللہ کو فلاں آدمی ( عامر ) کی بھلائی منظور ہے تو اس کو بھی لے آئے گا ۔ اتنے میں ایک اور آدمی نے دروازہ ہلایا ۔ میں نے کہا کہ کون ہے؟ جواب دیا کہ عثمان بن عفان ۔ میں نے کہا کہ ٹھہر جا ۔ پھر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور بتایا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دو اور جنت کی خوشخبری دو مگر وہ ایک مصیبت میں مبتلا ہوں گے ۔ میں آیا اور ان سے کہا کہ داخل ہو اور رسول اللہ صلی اللہ علیہ وسلم نے تجھے جنت کی خوشخبری دی ہے مگر ایک بلا کے ساتھ جو تم پر آئے گی ۔ پس وہ بھی داخل ہوئے اور دیکھا کہ منڈیر کا ایک حصہ بھر گیا ہے ، پس وہ دوسرے کنارے پر آپ صلی اللہ علیہ وسلم کے سامنے بیٹھ گئے ۔ شریک نے کہا کہ سعید بن مسیب نے کہا کہ میں نے اس حدیث سے یہ نکالا کہ ان کی قبریں بھی اسی طرح ہوں گی ۔ ( ویسا ہی ہوا کہ سیدنا عثمان رضی اللہ عنہ کو اس حجرہ میں جگہ نہ ملی ، تو وہ آپ صلی اللہ علیہ وسلم کے سامنے بقیع میں دفن ہوئے ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 44
			}
		}
	]
}