{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6305,
			"arabicnumber": "2448.01",
			"text": "عیسیٰ بن یونس نے کہا : ہمیں ہشام بن عروہ نے اپنے بھائی عبداللہ بن عروہ سے حدیث بیان کی ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : ہیں کہ گیارہ عورتیں بیٹھیں اور ان سب نے یہ اقرار اور عہد کیا کہ اپنے اپنے خاوندوں کی کوئی بات نہ چھپائیں گی ۔ پہلی عورت نے کہا کہ میرا خاوند گویا دبلے اونٹ کا گوشت ہے ، جو ایک دشوار گزار پہاڑ کی چوٹی پر رکھا ہو ۔ نہ تو وہاں تک صاف راستہ ہے کہ کوئی چڑھ جائے اور نہ وہ گوشت موٹا ہے کہ لایا جائے ۔ دوسری عورت نے کہا کہ میں اپنے خاوند کی خبر نہیں پھیلا سکتی میں ڈرتی ہوں کہ اگر بیان کروں تو پورا بیان نہ کر سکوں گی کیونکہ اس میں ظاہری و باطنی عیوب بہت زیادہ ہیں ۔ ( اور بعض نے یہ معنی کئے ہیں کہ میں ڈرتی ہوں کہ اگر بیان کروں گی تو اس کو چھوڑ دوں گی ۔ یعنی وہ خفا ہو کر مجھے طلاق دے گا اور اس کو چھوڑنا پڑے گا ) ۔ تیسری عورت نے کہا کہ میرا خاوند لمبا قد اور احمق ہے ، اگر میں اس کی برائی بیان کروں تو مجھے طلاق دیدے گا اور جو چپ رہوں تو اسی طرح معلق رہوں گی ( یعنی نہ نکاح کے مزے اٹھاؤں گی نہ بالکل محروم رہوں گی ) ۔ چوتھی نے کہا کہ میرا خاوند تو ایسا ہے جیسے تہامہ ( حجاز اور مکہ ) کی رات ۔ نہ گرم ہے نہ سرد ہے ( یعنی معتدل المزاج ہے ) نہ ڈر ہے نہ رنج ہے ( یہ اس کی تعریف کی یعنی اس کے اخلاق عمدہ ہیں اور نہ وہ میری صحبت سے ملول ہوتا ہے ) ۔ پانچویں عورت نے کہا کہ میرا خاوند جب گھر میں آتا ہے تو چیتا ہے ( یعنی پڑ کر سو جاتا ہے اور کسی کو نہیں ستاتا ) اور جب باہر نکلتا ہے تو شیر ہے ۔ اور جو مال اسباب گھر میں چھوڑ جاتا ہے اس کو نہیں پوچھتا ۔ چھٹی عورت نے کہا کہ میرا خاوند اگر کھاتا ہے تو سب ختم کر دیتا ہے اور پیتا ہے تو تلچھٹ تک نہیں چھوڑتا اور لیٹتا ہے تو بدن لپیٹ لیتا ہے اور مجھ پر اپنا ہاتھ نہیں ڈالتا کہ میرا دکھ درد پہچانے ( یہ بھی ہجو ہے یعنی سوا کھانے پینے کے بیل کی طرح اور کوئی کام کا نہیں ، عورت کی خبر تک نہیں لیتا ) ۔ ساتویں عورت نے کہا کہ میرا خاوند نامرد ہے یا شریر نہایت احمق ہے کہ کلام کرنا نہیں جانتا ، سب دنیا بھر کے عیب اس میں موجود ہیں ۔ ایسا ظالم ہے کہ تیرا سر پھوڑے یا ہاتھ توڑے یا سر اور ہاتھ دونوں مروڑے ۔ آٹھویں عورت نے کہا کہ میرا خاوند بو میں زرنب ہے ( زرنب ایک خوشبودار گھاس ہے ) اور چھونے میں نرم جیسے خرگوش ( یہ تعریف ہے یعنی اس کا ظاہر اور باطن دونوں اچھے ہیں ) ۔ نویں عورت نے کہا کہ میرا خاوند اونچے محل والا ، لمبے پرتلے والا ( یعنی قد آور ) اور بڑی راکھ والا ( یعنی سخی ہے ) اس کا باورچی خانہ ہمیشہ گرم رہتا ہے تو راکھ بہت نکلتی ہے اس کا گھر قوم کے مل بیٹھ کر مشورہ کرنے کی جگہ ( ڈیرہ وغیرہ ) ( یعنی سردار اور صاحب الرائے ہے ) ۔ دسویں عورت نے کہا کہ میرے خاوند کا نام مالک ہے ۔ اور مالک کیا خوب ہے ۔ مالک میری اس تعریف سے افضل ہے ۔ اس کے اونٹوں کے بہت سے شترخانے ہیں اور کم تر چراگاہیں ہیں ( یعنی ضیافت میں اس کے یہاں اونٹ بہت ذبح ہوا کرتے ہیں ، اس سبب سے شترخانوں سے جنگل میں کم چرنے جاتے ہیں ) جب اونٹ باجے کی آواز سنتے ہیں تو اپنے ذبح ہونے کا یقین کر لیتے ہیں ( ضیافت میں راگ اور باجے کا معمول تھا ، اس سبب سے باجے کی آواز سن کر اونٹوں کو اپنے ذبح ہونے کا یقین ہو جاتا تھا ) ۔ گیارھویں عورت نے کہا کہ میرے خاوند کا نام ابوذرع ہے سو واہ کیا خوب ابوذرع ہے ۔ اس نے زیور سے میرے دونوں کان جھلائے اور چربی سے میرے دونوں بازو بھرے ( یعنی مجھے موٹا کیا اور مجھے بہت خوش کیا ) ، سو میری جان بہت چین میں رہی مجھے اس نے بھیڑ بکری والوں میں پایا جو پہاڑ کے کنارے رہتے تھے ، پس اس نے مجھے گھوڑے ، اونٹ ، کھیت اور ڈھیریوں / خرمن کا مالک کر دیا ( یعنی میں نہایت ذلیل اور محتاج تھی ، اس نے مجھے باعزت اور مالدار کر دیا ) ۔ میں اس کی بات کرتی ہوں تو وہ مجھے برا نہیں کہتا ۔ سوتی ہوں تو فجر کر دیتی ہوں ( یعنی کچھ کام نہیں کرنا پڑتا ) اور پیتی ہوں تو سیراب ہو جاتی ہوں ۔ اور ابوزرع کی ماں ، پس ابوزرع کی ماں بھی کیا خوب ہے ۔ اس کی بڑی بڑی گٹھڑیاں اور کشادہ گھر ہیں ۔ ابوزرع کا بیٹا ، پس ابوزرع کا بیٹا بھی کیا خوب ہے ۔ اس کی خواب گاہ جیسے تلوار کا میان ( یعنی نازنین بدن ہے ) ، اس کو ( بکری ) حلوان کا ہاتھ آسودہ ( سیر ) کر دیتا ہے ( یعنی کم خور ہے ) ۔ ابوزرع کی بیٹی ، پس ابوزرع کی بیٹی بھی کیا خوب ہے ۔ اپنے والدین کی تابعدار اور اپنے لباس کو بھرنے والی ( یعنی موٹی ہے ) اور اپنی سوتن کی رشک ( یعنی اپنے خاوند کی پیاری ہے ، اس لئے اس کی سوتن اس سے جلتی ہے ) ۔ اور ابوزرع کی لونڈی ، ابوزرع کی لونڈی بھی کیا خوب ہے ۔ ہماری بات ظاہر کر کے مشہور نہیں کرتی اور ہمارا کھانا اٹھا کر نہیں لیجاتی اور ہمارا گھر کچرے سے آلودہ نہیں رکھتی ۔ ابوزرع باہر نکلا جب کہ مشکوں میں دودھ ( گھی نکالنے ) کے لئے بلوایا جا رہا تھا ۔ پس وہ ایک عورت سے ملا ، جس کے ساتھ اس کے دو لڑکے تھے جیسے دو چیتے اس کی گود میں دو اناروں سے کھیلتے ہوں ۔ پس ابوزرع نے مجھے طلاق دی اور اس عورت سے نکاح کر لیا ۔ پھر میں نے اس کے بعد ایک سردار مرد سے نکاح کیا جو ایک عمدہ گھوڑے کا سوار اور نیزہ باز ہے ۔ اس نے مجھے چوپائے جانور بہت زیادہ دئیے اور اس نے مجھے ہر ایک مویشی سے جوڑا جوڑا دیا اور اس نے مجھ سے کہا کہ اے ام زرع! خود بھی کھا اور اپنے لوگوں کو بھی کھلا ۔ پس اگر میں وہ چیزیں جمع کروں جو مجھے دوسرے شوہر نے دیں ، تو وہ ابوزرع کے چھوٹے برتن کے برابر بھی نہ پہنچیں ( یعنی دوسرے خاوند کا احسان پہلے خاوند کے احسان سے نہایت کم ہے ) ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ میں تیرے لئے ایسا ہوں جیسے ابوزرع ام زرع کے لئے تھا ۔ ( لیکن نہ تجھے طلاق دی ہے اور نہ دوں گا ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 135
			}
		}
	]
}