{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6314,
			"arabicnumber": "2450.03",
			"text": "زکریا نے فراس سے ، انھوں نے عامر سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی سب ازواج مطہرات رضی اللہ عنہن آپ صلی اللہ علیہ وسلم کے پاس تھیں ( آپ صلی اللہ علیہ وسلم کی بیماری میں ) ، کوئی بیوی ایسی نہ تھیں جو پاس نہ ہو کہ اتنے میں سیدہ فاطمۃالزہراء رضی اللہ عنہا آئیں اور وہ بالکل اسی طرح چلتی تھیں جس طرح رسول اللہ صلی اللہ علیہ وسلم چلتے تھے ۔ آپ صلی اللہ علیہ وسلم نے جب انہیں دیکھا تو مرحبا کہا اور فرمایا کہ مرحبا میری بیٹی ۔ پھر ان کو اپنے دائیں طرف یا بائیں طرف بٹھایا اور ان کے کان میں آہستہ سے کچھ فرمایا تو وہ بہت روئیں ۔ جب آپ صلی اللہ علیہ وسلم نے ان کا یہ حال دیکھا تو دوبارہ ان کے کان میں کچھ فرمایا تو وہ ہنسیں ۔ میں نے ان سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے خاص تم سے راز کی باتیں کیں ، پھر تم روتی ہو ۔ جب آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو میں نے ان سے پوچھا کہ تم سے رسول اللہ صلی اللہ علیہ وسلم نے کیا فرمایا؟ انہوں نے کہا کہ میں آپ صلی اللہ علیہ وسلم کا راز فاش کرنے والی نہیں ہوں ۔ جب آپ صلی اللہ علیہ وسلم کی وفات ہو گئی تو میں نے ان کو قسم دی اس حق کی جو میرا ان پر تھا اور کہا کہ مجھ سے بیان کرو جو رسول اللہ صلی اللہ علیہ وسلم نے تم سے فرمایا تھا ، تو انہوں نے کہا کہ اب البتہ میں بیان کروں گی ۔ پہلی مرتبہ آپ صلی اللہ علیہ وسلم نے میرے کان میں یہ فرمایا کہ جبرائیل علیہ السلام ہر سال ایک بار یا دو بار مجھ سے قرآن کا دور کرتے تھے اور اس سال انہوں نے دوبار دور کیا ، اور میں خیال کرتا ہوں کہ میرا ( دنیا سے جانے کا ) وقت قریب آ گیا ہے ، پس اللہ سے ڈرتی رہ اور صبر کر ، میں تیرا بہت اچھا منتظر ہوں ۔ یہ سن کر میں رونے لگی جیسے تم نے دیکھا تھا ۔ جب آپ صلی اللہ علیہ وسلم نے میرا رونا دیکھا تو دوبارہ مجھ سے سرگوشی کی اور فرمایا کہ اے فاطمہ! تو اس بات سے راضی نہیں ہے کہ تو مومنوں کی عورتوں کی یا اس امت کی عورتوں کی سردار ہو؟ یہ سن کر میں ہنسی جیسے کہ تم نے دیکھا تھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 144
			}
		}
	]
}