{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6381,
			"arabicnumber": "2484.01",
			"text": "معاذ بن معاذ نے کہا : ہمیں عبداللہ بن عون نے محمد بن سیرین سے حدیث بیان کی ، انھوں نے قیس بن عباد سے روایت کی ، کہا : میں مدینہ منورہ میں کچھ لوگوں کےساتھ تھا جن میں نبی کریم صلی اللہ علیہ وسلم کے بعض صحابہ رضوان اللہ عنھم اجمعین بھی تھے ، پھر ایک شخص آیا جس کے چہرے پر خشوع کا اثر ( نظر آتا ) تھا ، لوگوں میں سے ایک نے کہا : یہ اہل جنت میں سے ایک آدمی ہے ۔ اس آدمی نے دو رکعت نماز پڑھی جن میں اختصار کیا پھر چلاگیا ۔ میں بھی اس کے پیچھے گیا ، پھر وہ اپنے گھر میں داخل ہوگیا ، میں بھی ( اجازت ) لے کر اندر گیا ، پھر ہم نے آپس میں باتیں کیں ۔ جب وہ کچھ میرے ساتھ مانوس ہوگئے تو میں نے ان سے کہا : جب آپ ( کچھ دیر ) پہلے مسجد میں آئے تھے تو آپ کے متعلق ایک شخص نے اس طرح کہاتھا ۔ انھوں نے کہا : سبحان اللہ!کسی شخص کے لئے مناسب نہیں کہ وہ کوئی بات کہے جس کا اسے پوری طرح علم نہیں اورمیں تمھیں بتاتا ہوں کہ یہ کیونکر ہوا ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ایک خواب دیکھا اور وہ خواب آپ کے سامنے بیان کیا ۔ میں نے اپنے آپ کو ایک باغ میں دیکھا ۔ انھوں نے اس باغ کی وسعت ، اس کے پودوں اور اس کی شادابی کے بارے میں بتایا ۔ باغ کے وسط میں لوہے کا ایک ستون تھا ، اس کا نیچے کا حصہ زمین کے اندر تھا اور اسکے اوپر کا حصہ آسمان میں تھا ، اس کے اوپر کی جانب ایک حلقہ تھا ، مجھ سے کہا گیا : اس پرچڑھو ۔ میں نے کہا؛میں اس پر نہیں چڑھ سکتا ، پھر ایک منصف آیا ۔ ابن عون نے کہا : منصف ( سے مراد ) خادم ہےاس نے میرے پیچھے سے میرے کپڑے تھام لیے اور انھوں ( عبداللہ بن سلام رضی اللہ تعالیٰ عنہ ) نے واضح کیا کہ اس نے اپنے ہاتھ سے انھیں پیچھے سےاوپر اٹھایا تو میں اوپر چڑھ گیا یہاں تک کہ میں ستون کی چوٹی پر پہنچ گیا اور حلقے کو پکڑ لیا تو مجھ سےکہا گیا : اس کو مضبوطی سے پکڑ رکھو اور وہ میرے ہاتھ ہی میں تھا کہ میں جاگ گیا ۔ میں نے یہ ( خواب ) رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" وہ باغ اسلام ہے ۔ اور وہ ستون اسلام کا ستون ہے اور وہ حلقہ ( ایمان کا ) مضبوط حلقہ ہے اور تم موت تک اسلام پر رہو گے ۔ \"\" ( قیس بن عباد نے ) کہا : اور وہ شخص عبداللہ بن سلام رضی اللہ تعالیٰ عنہ تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 211
			}
		}
	]
}