{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6395,
			"arabicnumber": "2490",
			"text": "ابو سلمہ بن عبدالرحمان نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" قریش کی ہجو کرو کیونکہ ہجو ان کو تیروں کی بوچھاڑ سے زیادہ ناگوار ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے ایک شخص کو سیدنا ابن رواحہ رضی اللہ عنہ کے پاس بھیجا اور فرمایا کہ قریش کی ہجو کرو ۔ انہوں نے ہجو کی لیکن آپ صلی اللہ علیہ وسلم کو پسند نہ آئی ۔ پھر سیدنا کعب بن مالک رضی اللہ عنہ کے پاس بھیجا ۔ پھر سیدنا حسان بن ثابت رضی اللہ عنہ کے پاس بھیجا ۔ جب سیدنا حسان آپ صلی اللہ علیہ وسلم کے پاس آئے تو انہوں نے کہا کہ تم پر وہ وقت آ گیا کہ تم نے اس شیر کو بلا بھیجا جو اپنی دم سے مارتا ہے ( یعنی اپنی زبان سے لوگوں کو قتل کرتا ہے گویا میدان فصاحت اور شعر گوئی کے شیر ہیں ) ۔ پھر اپنی زبان باہر نکالی اور اس کو ہلانے لگے اور عرض کیا کہ قسم اس کی جس نے آپ صلی اللہ علیہ وسلم کو سچا پیغمبر کر کے بھیجا ہے میں کافروں کو اپنی زبان سے اس طرح پھاڑ ڈالوں گا جیسے چمڑے کو پھاڑ ڈالتے ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے حسان! جلدی مت کر! کیونکہ ابوبکر رضی اللہ عنہ قریش کے نسب کو بخوبی جانتے ہیں اور میرا بھی نسب قریش ہی ہیں ، تو وہ میرا نسب تجھے علیحدہ کر دیں گے ۔ پھر حسان سیدنا ابوبکر رضی اللہ عنہ کے پاس آئے ، پھر اس کے بعد لوٹے اور عرض کیا کہ یا رسول اللہ! سیدنا ابوبکر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کا نسب مجھ سے بیان کر دیا ہے ، قسم اس کی جس نے آپ صلی اللہ علیہ وسلم کو سچا پیغمبر کر کے بھیجا ، میں آپ صلی اللہ علیہ وسلم کو قریش میں سے ایسا نکال لوں گا جیسے بال آٹے میں سے نکال لیا جاتا ہے ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم حسان سے فرماتے تھے کہ روح القدس ہمیشہ تیری مدد کرتے رہیں گے جب تک تو اللہ اور اس کے رسول کی طرف سے جواب دیتا رہے گا ۔ اور ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ حسان نے قریش کی ہجو کی تو مومنوں کے دلوں کو شفاء دی اور کافروں کی عزتوں کو تباہ کر دیا ۔ حسان نے کہا کہ تو نے محمد صلی اللہ علیہ وسلم کی برائی کی تو میں نے اس کا جواب دیا اور اللہ تعالیٰ اس کا بدلہ دے گا ۔ تو نے محمد صلی اللہ علیہ وسلم کی برائی کی جو نیک اور پرہیزگار ہیں ، اللہ تعالیٰ کے رسول صلی اللہ علیہ وسلم ہیں اور وفاداری ان کی خصلت ہے ۔ میرے باپ دادا اور میری آبرو محمد صلی اللہ علیہ وسلم کی آبرو بچانے کے لئے قربان ہیں ۔ اگر کداء ( مکہ کے دروازہ پر گھاٹی ) کے دونوں جانب سے غبار اڑتا ہو نہ دیکھو تو میں اپنی جان کو کھوؤں ۔ ایسی اونٹنیاں جو باگوں پر زور کریں گی اور اپنی قوت اور طاقت سے اوپر چڑھتی ہوئیں ، ان کے کندھوں پر وہ برچھے ہیں جو باریک ہیں یا خون کی پیاسی ہیں اور ہمارے گھوڑے دوڑتے ہوئے آئیں گے ، ان کے منہ عورتیں اپنے دوپٹوں سے پونچھتی ہیں ۔ اگر تم ہم سے نہ بولو تو ہم عمرہ کر لیں گے اور فتح ہو جائے گی اور پردہ اٹھ جائے گا ۔ نہیں تو اس دن کی مار کے لئے صبر کرو جس دن اللہ تعالیٰ جس کو چاہے گا عزت دے گا ۔ اور اللہ تعالیٰ نے فرمایا کہ میں نے ایک لشکر تیار کیا ہے جو انصار کا لشکر ہے ، جس کا کھیل کافروں سے مقابلہ کرنا ہے ۔ اور اللہ تعالیٰ نے فرمایا کہ میں نے ایک بندہ بھیجا جو سچ کہتا ہے اس کی بات میں کچھ شبہہ نہیں ہے ۔ ہم تو ہر روز ایک نہ ایک تیاری میں ہیں ، گالی گلوچ ہے کافروں سے یا لڑائی ہے یا کافروں کی ہجو ہے ۔ تم میں سے جو کوئی اللہ کے رسول صلی اللہ علیہ وسلم کی ہجو کرے اور ان کی تعریف کرے یا مدد کرے وہ سب برابر ہیں ۔ اور ( روح القدس ) جبریل علیہ السلام کو اللہ کی طرف سے ہم میں بھیجاگیا ہے اور روح القدس کا ( کائنات میں ) کوئی مد مقابل نہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 225
			}
		}
	]
}