{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6396,
			"arabicnumber": "2491",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : کہ میں اپنی والدہ کو اسلام کی طرف بلاتا تھا اور وہ مشرک تھی ۔ ایک دن میں نے اس کو مسلمان ہونے کو کہا تو اس نے رسول اللہ صلی اللہ علیہ وسلم کے حق میں وہ بات سنائی جو مجھے ناگوار گزری ۔ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس روتا ہوا آیا اور عرض کیا کہ میں اپنی والدہ کو اسلام کی طرف بلاتا تھا وہ نہ مانتی تھی ، آج اس نے آپ صلی اللہ علیہ وسلم کے حق میں مجھے وہ بات سنائی جو مجھے ناگوار ہے تو آپ صلی اللہ علیہ وسلم اللہ تعالیٰ سے دعا کیجئے کہ وہ ابوہریرہ کی ماں کو ہدایت دیدے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! ابوہریرہ کی ماں کو ہدایت کر دے ۔ میں رسول اللہ صلی اللہ علیہ وسلم کی دعا سے خوش ہو کر نکلا ۔ جب گھر پر آیا اور دروازہ پر پہنچا تو وہ بند تھا ۔ میری ماں نے میرے پاؤں کی آواز سنی ۔ اور بولی کہ ذرا ٹھہرا رہ ۔ میں نے پانی کے گرنے کی آواز سنی غرض میری ماں نے غسل کیا اور اپنا کرتہ پہن کر جلدی سے اوڑھنی اوڑھی ، پھر دروازہ کھولا اور بولی کہ اے ابوہریرہ! ”میں گواہی دیتی ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں ہے اور میں گواہی دیتی ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے بندے اور اس کے رسول ہیں“ ۔ سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس خوشی سے روتا ہوا آیا اور عرض کیا کہ یا رسول اللہ! خوش ہو جائیے اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کی دعا قبول کی اور ابوہریرہ کی ماں کو ہدایت کی تو آپ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کی تعریف اور اس کی صفت کی اور بہتر بات کہی ۔ میں نے عرض کیا کہ یا رسول اللہ! اللہ عزوجل سے دعا کیجئے کہ میری اور میری ماں کی محبت مسلمانوں کے دلوں میں ڈال دے ۔ اور ان کی محبت ہمارے دلوں میں ڈال دے ۔ تب رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! اپنے بندوں کی یعنی ابوہریرہ اور ان کی ماں کی محبت اپنے مومن بندوں کے دلوں میں ڈال دے اور مومنوں کی محبت ان کے دلوں میں ڈال دے ۔ پھر کوئی مومن ایسا پیدا نہیں ہوا جس نے میرے بارے میں سنایا مجھے دیکھا ہواور میرےساتھ محبت نہ کی ہو ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 226
			}
		}
	]
}