{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6401,
			"arabicnumber": "2494.01",
			"text": "ابو بکر بن ابی شیبہ ، عمرو ناقد ، زہیر بن حرب ، اسحاق بن ابراہیم اور ابن ابی عمر نے ہمیں حدیث بیان کی ، الفاظ عمرو کے ہیں ۔ اسحاق نے کہا : ہمیں خبر دی ، دوسروں نے کہا : ہمیں سفیان بن عیینہ نے عمرو ( بن دینار ) سے حدیث بیان کی ، انھوں نے حسن بن محمد سے روایت کی ، انھوں نے کہا : مجھے عبیداللہ بن ابی رافع نے جو حضرت علی رضی اللہ تعالیٰ عنہ کے کاتب تھے ، خبر دی ، انھوں نے کہا : میں نے حضرت علی رضی اللہ تعالیٰ عنہ کو یہ فرماتے ہوئے سنا : کہ ہمیں یعنی رسول اللہ صلی اللہ علیہ وسلم نے مجھے ، سیدنا زبیر رضی اللہ عنہ اور سیدنا مقداد رضی اللہ عنہ کو روضہ خاخ مقام پر بھیجا اور فرمایا کہ جاؤ اور وہاں تمہیں ایک عورت اونٹ پر سوار ملے گی ، اس کے پاس ایک خط ہے وہ اس سے لے کر آؤ ۔ ہم گھوڑے دوڑاتے ہوئے چلے اچانک وہ عورت ہمیں ملی تو ہم نے اس سے کہا کہ خط نکال ۔ وہ بولی کہ میرے پاس تو کوئی خط نہیں ہے ۔ ہم نے کہا کہ خط نکال یا اپنے کپڑے اتار ۔ پس اس نے وہ خط اپنے جوڑے سے نکالا ۔ ہم وہ خط رسول اللہ صلی اللہ علیہ وسلم کے پاس لے کر آئے ، اس میں لکھا تھا حاطب بن ابی بلتعہ کی طرف سے مکہ کے بعض مشرکین کے نام ( اور اس میں ) رسول اللہ صلی اللہ علیہ وسلم کی بعض باتوں کا ذکر تھا ( ایک روایت میں ہے کہ حاطب نے اس میں رسول اللہ صلی اللہ علیہ وسلم کی تیاری اور فوج کی آمادگی اور مکہ کی روانگی سے کافروں کو مطلع کیا تھا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے حاطب! تو نے یہ کیا کیا؟ وہ بولے کہ یا رسول اللہ! آپ جلدی نہ فرمائیے ۔ میں قریش سے ملا ہوا ایک شخص تھا یعنی ان کا حلیف تھا اور قریش میں سے نہ تھا اور آپ صلی اللہ علیہ وسلم کے مہاجرین جو ہیں ان کے رشتہ دار قریش میں بہت ہیں جن کی وجہ سے ان کے گھربار کا بچاؤ ہوتا ہے تو میں نے یہ چاہا کہ میرا ناتا تو قریش سے نہیں ہے ، میں بھی ان کا کوئی کام ایسا کر دوں جس سے میرے اہل و عیال والوں کا بچاؤ کریں گے اور میں نے یہ کام اس وجہ سے نہیں کیا کہ میں کافر ہو گیا ہوں یا مرتد ہو گیا ہوں اور نہ مسلمان ہونے کے بعد کفر سے خوش ہو کر کیا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ حاطب نے سچ کہا ۔ سیدنا عمر رضی اللہ عنہ نے کہ کہ یا رسول اللہ! آپ چھوڑئیے میں اس منافق کی گردن ماروں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو بدر کی لڑائی میں شریک تھا اور تو نہیں جانتا کہ اللہ تعالیٰ نے بدر والوں کو جھانکا اور فرمایا کہ تم جو اعمال چاہو کرو ( بشرطیکہ کفر تک نہ پہنچیں ) میں نے تمہیں بخش دیا ۔ تب اللہ تعالیٰ نے یہ آیت اتاری کہ ”اے ایمان والو! میرے اور اپنے دشمنوں کو دوست مت بناؤ“ ۔ ( سورۃ : الممتحنہ : 1 ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 232
			}
		}
	]
}