{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6492,
			"arabicnumber": "2542.03",
			"text": "زرارہ بن اوفیٰ نے اُسیر بن جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ سیدنا عمر بن خطاب رضی اللہ عنہ کے پاس جب یمن سے مدد کے لوگ آتے ( یعنی وہ لوگ جو ہر ملک سے اسلام کے لشکر کی مدد کے لئے جہاد کرنے کو آتے ہیں ) تو وہ ان سے پوچھتے کہ تم میں اویس بن عامر بھی کوئی شخص ہے؟ یہاں تک کہ سیدنا عمر رضی اللہ عنہ خود اویس کے پاس آئے اور پوچھا کہ تمہارا نام اویس بن عامر ہے؟ انہوں نے کہا کہ ہاں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ تم مراد قبیلہ کی شاخ قرن سے ہو؟ انہوں نے کہا کہ ہاں ۔ انہوں نے پوچھا کہ تمہیں برص تھا وہ اچھا ہو گیا مگر درہم برابر باقی ہے؟ انہوں نے کہا کہ ہاں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ تمہاری ماں ہے؟ انہوں نے کہا کہ ہاں ۔ تب سیدنا عمر رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ تمہارے پاس اویس بن عامر یمن والوں کی کمکی فوج کے ساتھ آئے گا ، وہ قبیلہ مراد سے ہے جو قرن کی شاخ ہے ۔ اس کو برص تھا وہ اچھا ہو گیا مگر درہم باقی ہے ۔ اس کی ایک ماں ہے ۔ اس کا یہ حال ہے کہ اگر اللہ کے بھروسے پر قسم کھا بیٹھے تو اللہ تعالیٰ اس کو سچا کرے ۔ پھر اگر تجھ سے ہو سکے تو اس سے اپنے لئے دعا کرانا ۔ تو میرے لئے دعا کرو ۔ پس اویس نے سیدنا عمر رضی اللہ عنہ کے لئے بخشش کی دعا کی ۔ تو سیدنا عمر رضی اللہ عنہ نے کہا کہ تم کہاں جانا چاہتے ہو؟ انہوں نے کہا کہ کوفہ میں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ میں تمہیں کوفہ کے حاکم کے نام ایک خط لکھ دوں؟ انہوں نے کہا کہ مجھے خاکساروں میں رہنا اچھا معلوم ہوتا ہے ۔ جب دوسرا سال آیا تو ایک شخص نے کوفہ کے رئیسوں میں سے حج کیا ۔ وہ سیدنا عمر رضی اللہ عنہ سے ملا تو سیدنا عمر رضی اللہ عنہ نے اس سے اویس کا حال پوچھا تو وہ بولا کہ میں نے اویس کو اس حال میں چھوڑا کہ ان کے گھر میں اسباب کم تھا اور ( خرچ سے ) تنگ تھے ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اویس بن عامر تمہارے پاس یمن والوں کے امدادی لشکر کے ساتھ آئے گا ، وہ مراد قبیلہ کی شاخ قرن میں سے ہے ۔ اس کو برص تھا وہ اچھا ہو گیا صرف درہم کے برابر باقی ہے ۔ اس کی ایک ماں ہے جس کے ساتھ وہ نیکی کرتا ہے ۔ اگر وہ اللہ پر قسم کھا بیٹھے تو اللہ تعالیٰ اس کو سچا کرے ۔ پھر اگر تجھ سے ہو سکے کہ وہ تیرے لئے دعا کرے تو اس سے دعا کرانا ۔ وہ شخص یہ سن کر اویس کے پاس آیا اور کہنے لگا کہ میرے لئے دعا کرو ۔ اویس نے کہا کہ تو ابھی نیک سفر کر کے آ رہا ہے ( یعنی حج سے ) میرے لئے دعا کر ۔ پھر وہ شخص بولا کہ میرے لئے دعا کر ۔ اویس نے یہی جواب دیا پھر پوچھا کہ تو سیدنا عمر رضی اللہ عنہ سے ملا؟ وہ شخص بولا کہ ہاں ملا ۔ اویس نے اس کے لئے دعا کی ۔ اس وقت لوگ اویس کا درجہ سمجھے ۔ وہ وہاں سے سیدھے چلے ۔ اسیر نے کہا کہ میں نے ان کو ان کا لباس ایک چادر پہنائی جب کوئی آدمی ان کو دیکھتا تو کہتا کہ اویس کے پاس یہ چادر کہاں سے آئی ہے؟ ( وہ ایسے تھے کہ ایک مناسب چادر بھی ان کے پاس ہونا باعث تعجب تھا ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 321
			}
		}
	]
}