{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6496,
			"arabicnumber": "2545",
			"text": "ہمیں اسود بن شیبان نے ابو نوافل سے خبردی ، کہا : میں نے حضرت عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ ( کے جسد خاکی ) کو شہر کی گھاٹی میں ( کھجور کے ایک تنے سے لٹکا ہوا ) دیکھا ، کہا : تو قریش اور دوسرے لوگوں نے وہاں سے گزرنا شروع کردیا ، یہاں تک کہ حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ وہاں سے گزرے تو وہ ان ( ابن زبیر رضی اللہ تعالیٰ عنہ ) کے پاس کھڑے ہوگئے ، اور ( انھیں مخاطب کرتے ہوئے ) کہا : ابو خبیب!آپ پر سلام! ابو خبیب!آپ پر سلام! ابو خبیب!آپ پر سلام!اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ کی قسم!آپ ، جتنا مجھے علم ہے بہت روزے رکھنے والے ، بہت قیام کرنے والے ، بہت صلہ رحمی کرنے و الے تھے ۔ اللہ کی قسم!وہ امت جس میں آپ سب سے بُرے ( قرار دیے گئے ) ہوں ، وہ امت تو پوری کی پوری بہترین ہوگی ( جبکہ اس میں تو بڑے بڑے ظالم ، قاتل اور مجرم موجود ہیں ۔ آپ کسی طور پر اس سلوک کے مستحق نہ تھے ۔ ) پھر عبداللہ بن عمر رضی اللہ تعالیٰ عنہ وہاں سے چلے گئے ۔ حجاج کو عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے وہاں کھڑے ہونے کی خبر پہنچی تو اس نے کارندے بھیجے ، ان ( کے جسدخاکی ) کو کھجور کے تنے سے اتارا گیا اور انھیں جاہلی دور کی یہود کی قبروں میں پھینک دیا گیا ، پھر اس نے ( ابن زبیر رضی اللہ تعالیٰ عنہ کی والدہ ) حضرت اسماء بنت ابی بکر رضی اللہ تعالیٰ عنہا کے پاس کارندہ بھیجا ۔ انھوں نے اس کے پاس جانے سے انکار کردیا ۔ اس نے دوبارہ قاصد بھیجا کہ یا تو تم میرے پاس آؤ گی یا پھر میں تمھارے پاس ان لوگوں کو بھیجو ں گا جو تمھیں تمھارے بالوں سے پکڑ کر گھسیٹتے ہوئے لے آئیں گے ۔ حضرت اسماء رضی اللہ تعالیٰ عنہا نے پھر انکار کردیا اورفرمایا : میں ہرگز تیرے پاس نہ آؤں گی یہاں تک کہ تو میرے پاس ایسے شخص کو بھیجے جو مجھے میرے بالوں سے پکڑ کر گھسیٹتے ہوئے لےجائے ۔ کہا : توحجاج کہنے لگا : مجھے میرے جوتے دکھاؤ ، اس نے جوتے پہنے اور اکڑتا ہوا تیزی سے چل پڑا ، یہاں تک کہ ان کے ہاں پہنچا اور کہا : تم نے مجھے دیکھا کہ میں نے اللہ کے دشمن کے ساتھ کیا کیا؟انھوں نے جواب دیا : میں نے تمھیں دیکھا ہے کہ تم نے اس پر اس کی دنیا تباہ کردی جبکہ اس نے تمھاری آخرت برباد کردی ، مجھے یہ بات پہنچی ہے کہ تو اسے دو پیٹیوں والی کا بیٹا ( ابن ذات النطاقین ) کہتا ہے ۔ ہاں ، اللہ کی قسم!میں دو پیٹیوں والی ہوں ۔ ایک پیٹی کے ساتھ میں رسول اللہ صلی اللہ علیہ وسلم اور ابو بکر رضی اللہ تعالیٰ عنہ کا کھانا سواری کے جانور پر باندھتی تھی اور دوسری پیٹی وہ ہے جس سے کوئی عورت مستغنی نہیں ہوسکتی ( سب کو لباس کے لیے اس کی ضرورت ہوتی ہے ۔ ) اور سنو!رسول اللہ صلی اللہ علیہ وسلم نے ہمیں بتایا تھا کہ بنو ثقیف میں ایک بہت بڑا کذاب ہوگا اور ایک بہت بڑا سفاک ہوگا ۔ کذاب ( مختار ثقفی ) کو تو ہم نے دیکھ لیا اور رہا سفاک تو میں نہیں سمجھتی کہ تیرے علاوہ کوئی اورہوگا ، کہا : تو وہ وہاں سے اٹھ کھڑا ہوا اور انھیں کوئی جواب نہ دے سکا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 325
			}
		}
	]
}