{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6509,
			"arabicnumber": "2550.02",
			"text": "محمد بن سیرین نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \"\" صرف تین بچوں کے سوا پنگھوڑے میں کسی نے بات نہیں کی : حضرت عیسیٰ بن مریم اور جریج ( کی گواہی دینے ) والے نے ۔ جریج ایک عبادت گزار آدمی تھی ۔ انہوں نے نوکیلی چھت والی ایک عبادت گاہ بنا لی ۔ وہ اس کے اندر تھے کہ ان کی والدہ آئی اور وہ نماز پڑھ رہے تھے ۔ تو اس نے پکار کر کہا : جریج! انہوں نے کہا : میرے رب! ( ایک طرف ) میری ماں ہے اور ( دوسری طرف ) میری نماز ہے ، پھر وہ اپنی نماز کی طرف متوجہ ہو گئے اور وہ چلی گئی ۔ جب دوسرا دن ہوا تو وہ آئی ، وہ نماز پڑھ رہے تھے ۔ اس نے بلایا : او جریج! تو جریج نے کہا : میرے پروردگار! میری ماں ہے اور میری نماز ہے ۔ انہوں نے نماز کی طرف توجہ کر لی ۔ وہ چلی گئی ، پھر جب اگلا دن ہوا تو وہ آئی اور آواز دی : جریج! انہوں نے کہا : میرے پروردگار! میری ماں ہے اور میری نماز ہے ، پھر وہ اپنی نماز میں لگ گئے ، تو اس نے کہا : اے اللہ! بدکار عورتوں کا منہ دیکھنے سے پہلے اسے موت نہ دینا ۔ بنی اسرائیل آپس میں جریج اور ان کی عبادت گزاری کا چرچا کرنے لگے ۔ وہاں ایک بدکار عورت تھی جس کے حسن کی مثال دی جاتی تھی ، وہ کہنے لگی : اگر تم چاہو تو میں تمہاری خاطر اسے فتنے میں ڈال سکتی ہوں ، کہا : تو اس عورت نے اپنے آپ کو اس کے سامنے پیش کیا ، لیکن وہ اس کی طرف متوجہ نہ ہوئے ۔ وہ ایک چرواہے کے پاس گئی جو ( دھوپ اور بارش مین ) ان کی عبادت گاہ کی پناہ لیا کرتا تھا ۔ اس عورت نے چرواہے کو اپنا آپ پیش کیا تو اس نے عورت کے ساتھ بدکاری کی اور اسے حمل ہو گیا ۔ جب اس نے بچے کو جنم دیا تو کہا : یہ جریج سے ہے ۔ لوگ ان کے پاس آئے ، انہیں ( عبادت گاہ سے ) نیچے آنے کا کہا ، ان کی عبادت گاہ ڈھا دی اور انہیں مارکا شروع کر دیا ۔ انہوں نے کہا : تم لوگوں کو کیا ہوا ہے؟ لوگوں نے کہا : تم نے اس بدکار عورت سے زنا کیا ہے اور اس نے تمہارے بچے کو جنم دیا ہے ۔ انہوں نے کہا : بچہ کہاں ہے؟ وہ اسے لے آئے ۔ انہوں نے کہا : مجھے نماز پڑھ لینے دو ، پھر انہوں نے نماز پڑھی ، جب نماز سے فارغ ہوئے تو بچے کے پاس آئے ، اس کے پیٹ میں انگلی چبھوئی اور کہا : بچے! تمہارا باپ کون ہے ۔ اس نے جواب دیا ۔ فلاں چرواہا ۔ آپ نے فرمایا : پھر وہ لوگ جریج کی طرف لپکے ، انہیں چومتے تھے اور برکت حاصل کرنے کے لیے ان کو ہاتھ لگاتے تھے اور انہوں نے کہا : ہم آپ کی عبادت گاہ سونے ( چاندی ) کی بنا دیتے ہیں ، انہوں نے کہا : نہیں ، اسے مٹی سے دوبارہ اسی طرح بنا دو جیسی وہ تھی تو انہوں نے ( ویسے ہی ) کیا ۔ اور ایک بچہ اپنی ماں کا دودھ پی رہا تھا ۔ وہاں سے ایک آدمی عمدہ سواری پر سوار خوبصورت لباس پہنے ہوئے گزرا تو اس بچے کی ماں نے کہا : اے اللہ! میرے بیٹے کو ایسا بنا دے ۔ بچے نے پستان ( دودھ ) چھوڑا ، اس آدمی کی طرف رخ کیا ، اسے دیکھا اور کہا؛ اے اللہ! مجھے اس جیسا نہ بنانا ، پھر اپنے پستان ( دودھ ) کا رخ کیا اور دودھ پینے میں لگ گیا ۔ \"\" ( ابوہریرہ رضی اللہ عنہ نے ) کہا : جیسے میں ( اب بھی ) رسول اللہ صلی اللہ علیہ وسلم کو دیکھ رہا ہوں کہ آپ صلی اللہ علیہ وسلم اپنی شہادت کی انگلی اپنے منہ میں ڈال کر اس کو چوستے ہوئے اس بچے کا دودھ پینا بیان کر رہے ہیں ۔ آپ نے فرمایا : \"\" پھر لوگ ایک لونڈی کو لے کر گزرے ۔ وہ اسے مار رہے تھے اور کہہ رہے تھے : تو نے زنا کیا ، تو نے چوری کی اور وہ کہہ رہی تھی : مجھے اللہ کافی ہے ، وہی بہترین کارساز ہے ۔ اس بچے کی ماں کہنے لگی : اے اللہ! میرے بیٹے کو اس کی طرح نہ بنانا ۔ بچے نے دودھ چھوڑا ، اس باندی کی طرف دیکھا اور کہا : اے اللہ! مجھے اسی جیسا بنانا ۔ یہاں آ کر ان دونوں ( ماں بیٹے ) نے ایک دوسرے سے سوال جواب کیا ۔ وہ کہنے لگی : میرا سر منڈے! بہت اچھی ہئیت کا ایک آدمی گزرا ، میں نے کہا : اے اللہ! میرے بیٹے کو اس جیسا بنانا تو تم نے کہا : اے اللہ! مجھے اس جیسا نہ بنانا ۔ پھر لوگ اس کنیز کو لے کر گزرے ، اسے مار رہے تھے اور کہہ رہے تھے : تو نے زنا کیا ہے ، تو نے چوری کی ہے ۔ میں نے کہا : اے اللہ! میرے بیٹے کو اس جیسا نہ بنانا تو تم نے یہ کہہ دیا : اے اللہ! مجھے اس جیسا بنانا ۔ اس ( بچے ) نے کہا : وہ شخص دوسروں پر ظلم ڈھانے والا جابر تھا ، اس لیے میں نے کہا : اے اللہ! مجھے اس کی طرح نہ بنانا ۔ اور یہ عورت جسے لوگ کہہ رہے تھے : تو نے زنا کیا ، حالانکہ اس نے زنا نہیں کیا تھا اور تو نے چوری کی حالانکہ اس نے چوری نہیں کی تھی ، اس لیے میں نے کہا : اے اللہ! مجھے اس کی طرح ( پاکباز ) بنانا ۔ \"\" فائدہ : حقیقی اور دائمی عزت والا وہی ہے جو اپنے پروردگار کی نافرمانی سے بچا ہوا ہے ، چاہے لوگ اسے حقیر اور گناہ گار سمجھتے ہوں اور حقیقت میں دائمی طور پر رذیل وہی ہے جو اللہ کا نافرمان ہے ، چاہے عارضی زندگی میں لوگ اسے معزز سمجھتے ہوں ۔",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		}
	]
}