{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6627,
			"arabicnumber": "2603",
			"text": "زہیر بن حرب اور ابومعن رقاشی نے ہمیں حدیث بیان کی ۔ ۔ اور الفاظ زہیر کے ہیں ۔ ۔ دونوں نے کہا : ہمیں عمر بن یونس نے حدیث بیان کی ، انہوں نے کہا : ہمیں عکرمہ بن عمار نے حدیث بیان کی ، کہا : ہمیں اسحق بن ابی طلحہ نے حدیث سنائی ، انہوں نے کہا : مجھے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ حضرت ام سلیم رضی اللہ عنہا کے پاس ایک یتیم لڑکی تھی اور یہی ( ام سلیم رضی اللہ عنہا ) ام انس بھی کہلاتی تھیں ، رسول اللہ صلی اللہ علیہ وسلم نے اس کو دیکھا تو فرمایا : \"\" تو وہی لڑکی ہے ، تو بڑی ہو گئی ہے! تیری عمر ( اس تیزی سے ) بڑی نہ ہو \"\" وہ لڑکی روتی ہوئی واپس حضرت ام سلیم رضی اللہ عنہا کے پاس گئی ، حضرت ام سلیم رضی اللہ عنہا نے پوچھا : بیٹی! تجھے کیا ہوا؟ اس نے کہا : نبی صلی اللہ علیہ وسلم نے میرے خلاف دعا فرما دی ہے کہ میری عمر زیادہ نہ ہو ، اب میری عمر کسی صورت زیادہ نہ ہو گی ، یا کہا : اب میرا زمانہ ہرگز زیادہ نہیں ہو گا ، حضرت ام سلیم رضی اللہ عنہا جلدی سے دوپٹہ لپیٹتے ہوئے نکلیں ، حتی کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوئیں ، رسول اللہ صلی اللہ علیہ وسلم نے ان سے پوچھا : \"\" ام سلیم! کیا بات ہے؟ \"\" حضرت ام سلیم رضی اللہ عنہا نے کہا : اللہ کے نبی! کیا آپ نے میری ( پالی ہوئی ) یتیم لڑکی کے خلاف دعا کی ہے؟ آپ نے پوچھا : \"\" یہ کیا بات ہے؟ \"\" حضرت ام سلیم رضی اللہ عنہا نے کہا : وہ کہتی ہے : آپ نے دعا فرمائی ہے کہ اس کی عمر زیادہ نہ ہو ، اور اس کا زمانہ لمبا نہ ہو ، ( حضرت انس رضی اللہ عنہ نے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم ہنسے ، پھر فرمایا : \"\" ام سلیم! کیا تمہیں معلوم نہیں کہ میں نے اپنے رب سے پختہ عہد لیا ہے ، میں نے کہا : میں ایکبشر ہی ہوں ، جس طرح ایک بشر خوش ہوتا ہے ، میں بھی خوش ہوتا ہوں اور جس طرح بشر ناراض ہوتے ہیں میں بھی ناراض ہوتا ہوں ۔ تو میری امت میں سے کوئی بھی آدمی جس کے خلاف میں نے دعا کی اور وہ اس کا مستحق نہ تھا تو اس دعا کو قیامت کے دن اس کے لیے پاکیزگی ، گناہوں سے صفائی اور ایسی قربت بنا دے جس کے ذریعے سے تو اسے اپنے قریب فرما لے ۔ \"\" ابو معن نے کہا : حدیث میں تینوں جگہ ( یتیمہ کے بجائے ) تصغیر کے ساتھ يتيمة ( چھوٹی سی یتیم بچی کا لفظ ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 124
			}
		}
	]
}