{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"52": "Characteristics of the Day of Judgment, Paradise, and Hell"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7067,
			"arabicnumber": "2798.02",
			"text": "ابو معاویہ ، وکیع ، اور جریر نے اعمش سے ، انھوں نے مسلم بن صحیح سے اور انھوں نے مسروق سے روایت کی کہ حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) کے پاس ایک شخص آیا اور کہنے لگا : میں مسجد میں ایک ایسے شخص کو چھوڑ کر آرہا ہوں جو اپنی رائے سے قرآن مجید کی تفسیر کرتا ہے وہ ( قرآن کی ) آیت : \" جب آسمان سے واضح دھواں اٹھے گا \" کی تفسیر کرتا ہے ، کہتا ہے : \" قیامت کےدن لوگوں کے پاس ایک دھواں آئے گا جو لوگوں کی سانسوں کو گرفت میں لے لے گا ، یہاں تک کہ لوگوں کو زکام جیسی کیفیت ( جس میں سانس لینی مشکل ہوجاتی ہے ) درپیش ہوگی ، توحضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) نے کہا : جس کے پاس علم ہو وہ اس کے مطابق بات کہے اور جو نہ جانتا ہو ، وہ کہے : اللہ زیادہ جاننے والا ہے ۔ یہ بات انسان کے فہم ( دین ) کاحصہ ہے ۔ کہ جس بات کو وہ نہیں جانتا اس کے بارے میں کہے : اللہ زیادہ جاننے والاہے ۔ اس ( دھوئیں ) کی حقیقت یہ تھی کہ قریش نے جب نبی کریم صلی اللہ علیہ وسلم کے خلاف سخت نافرمانی سے کام لیا تو آپ نے ان کے خلاف یوسف علیہ السلام ( کے زمانےوالے ) قحط کے سالوں جیسی قحط سالی کی دعاکی ۔ انھیں قحط اور تنگ دستی نے آلیا یہاں تک کہ ( ان میں سے ) کوئی شخص آسمان کی طرف دیکھنے لگتا تو بھوک کی شدت سے اسے اپنے اور آسمان کے درمیان دھواں ساچھایا ہوا نظرآتا یہاں تک کہ ان لوگوں نے ( بھوک کی شدت سے ) ہڈیاں تک کھائیں ، چنانچہ ( ان میں سے ) ایک شخص نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !آپ ( قبیلہ ) مضر کے لئے بخشش طلب فرمائیں ۔ وہ ہلاکت کا شکار ہیں ، تو آ پ صلی اللہ علیہ وسلم نے فرمایا : \" مضر کے لئے؟تو بہت جراءت والا ہے ( کہ اللہ سے شرک اور اس کے رسول سے بغض کے باوجود د رخواست کررہا ہے کہ میں تمہارے لئے اللہ سے دعا کروں ) \" کہا : آپ صلی اللہ علیہ وسلم نے ( پھر بھی ) ان کے حق میں دعا فرمادی ۔ اس پر اللہ عزوجل نے ( آیت ) نازل فرمائی : \" ہم ( تم سے ) تھوڑے عرصے کے لئے عذاب ہٹادیتے ہیں ۔ تم ( پھر کفر ہی میں ) لوٹنے والا ہو ۔ \" ( حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : پھر ان پر بارش برسائی گئی ۔ انھیں خوشحالی مل گئی ، کہا : ( تو پھر ) وہ اپنی اسی روش پر لوٹ گئے جس سے پہلے تھے ۔ اس پر اللہ تعالیٰ نے ( یہ حصہ ) نازل فرمایا : \" آپ انتظار کیجئے جب آسمان ظاہر دھواں لے آئے گا ۔ جو لوگوں کو ڈھانپ لے گا ، یہ دردناک عذاب ہوگا ۔ ( پھر یہ آیت نازل فرمائی ) جس دن ہم بڑ ی گرفت میں لیں گے ، ہم انتقام لینے والے ہوں گے ۔ \" کہا : یعنی جنگ بدر کو ۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 23
			}
		}
	]
}