{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7207,
			"arabicnumber": "2865.01",
			"text": "ابو غسان مسمعی محمد بن مثنیٰ اور محمد بن بشار بن عثمان نے ہمیں حدیث بیان کی ۔ الفاظ ابو غسان اور ابن مثنیٰ کے ہیں دونوں نے کہا : معاذ بن ہشام نے ہمیں حدیث بیان کی کہا : مجھے میرے والد نے قتادہ سے حدیث بیان کی انھوں نے مطرف بن عبد اللہ بن شخیرسے اور انھوں نے حضرت عیاض بن حمادمجاشعی رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم نے اپنے خطبے میں ارشاد فرمایا : \" سنو!میرے رب نے مجھے یہ حکم دیا ہے کہ میں تمھیں ان باتوں کی تعلیم دوں جو تمھیں معلوم نہیں اور اللہ تعالیٰ نے آج مجھے ان کا علم عطا کیا ہے ( اللہ تعالیٰ نے فرمایا ہے ) ہر مال جو میں نے کسی بندے کو عطا کیا ( اس کی قسمت میں لکھا ) حلال ہے اور میں نے اپنے تمام بندوں کو ( حق کے لیے ) یکسو پیدا کیا پھر شیاطین ان کے پاس آئے اور انھیں ان کے دین سے دور کھینچ لیا اور جو میں نے ان کے لیے حلال کیا تھا انھوں نے اسے ان کے لیے حرام کر دیا اور ان ( بندوں ) کو حکم دیا کہ وہ میرے ساتھ شرک کریں جس کے لیے میں نے کوئی دلیل نازل نہیں کی تھی ۔ اور اللہ نے زمین والوں کی طرف نظر فرمائی تو اہل کتاب کے ( کچھ ) بچے کھچے لوگوں کے سوا باقی عرب اور عجم سب پر سخت ناراض ہوا اور ( مجھ سے ) فرمایا : میں نے آپ کو اس لیے مبعوث کیا کہ میں آپ کی اور آپ کے ذریعے سے دوسروں کی آزمائش کروں اور میں نے آپ پر ایک ایسی کتاب نازل کی ہے جسے پانی دھو ( کر مٹا ) نہیں سکتا ، آپ سوتے ہوئے بھی اس کی تلاوت کریں گے اور جاگتے ہوئے بھی اور اللہ نے مجھے حکم دیا کہ میں قریش کو ( ان کے معبودوں اور ان آباء واجداد کے شرک اور گناہوں پر عار دلاتے ہوئے انھیں ) جلاؤں میں نے کہا : میرے رب وہ میرے سر کو ٹکڑے ٹکڑے کر کے روٹی کی طرح کر دیں گے ۔ تو ( اللہ نے ) فرمایا : آپ انھیں باہر نکالیں جس طرح انھوں نے آپ کو باہر نکالا اور ان سے لڑائی کریں ہم آپ کو لڑوائیں گےاور ( اللہ کی راہ میں ) خرچ کریں آپ پر خرچ کیا جائے گا اور آپ لشکر بھیجیں ہم اس جیسے پانچ لشکربھیجیں گے اور جو لوگ آپ کے فرماں بردار ہیں ان کے ذریعے سے نافرمانوں کے خلاف جنگ کریں ۔ ( پھر آپ صلی اللہ علیہ وسلم نے ) فرمایا : اہل جنت تین ( طرح کے لوگ ) ہیں ایسا سلطنت والا جو عادل ہے صدقہ کرنے والا ہے اسے اچھائی کی توفیق دی گئی ہے ۔ اور ایسا مہربان شخص جو ہر قرابت دار اور ہر مسلمان کے لیے نرم دل ہے اور وہ عفت شعار ( برائیوں سے بچ کر چلنے والا ) جو عیال دارہے ، ( پھر بھی ) سوال سے بچتاہے ۔ فرمایا : \" اور اہل جہنم پانچ ( طرح کے لوگ ) ہیں وہ کمزور جس کے پاس ( برائی سے ) روکنے والی ( عقل عفت ، حیا ، غیرت ) کوئی چیز نہیں جوتم میں سے ( برے کاموں میں دوسروں کے ) پیچھے لگنے والے لوگ ہیں ( حتیٰ کہ ) گھر والوں اور مال کے پیچھے بھی نہیں جاتے ( ان کی بھی پروا نہیں کرتے ) اور ایسا خائن جس کا کو ئی بھی مفاد چاہے بہت معمولی ہو ۔ ( دوسروں کی نظروں سے ) اوجھل ہوتا ہےتووہ اس میں ( ضرور ) خیانت کرتاہے ۔ اور ایسا شخص جو صبح شام تمھارے اہل وعیال اور مال کے بارے میں تمھیں دھوکادیتا ہے ۔ \" اور آپ صلی اللہ علیہ وسلم نے بخل یا جھوٹ کا بھی ذکر فرمایا ۔ \" اور بدطینت بد خلق ۔ \" اور ابو غسان نے اپنی حدیث میں یہ ذکر نہیں کیا : \" آپ خرچ کریں تو عنقریب آپ پر خرچ کیا جا ئے گا ۔",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 76
			}
		}
	]
}