{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7268,
			"arabicnumber": "144.04",
			"text": "ابو معاویہ نے کہا : ہمیں اعمش نے ( ابو وائل ) شقیق سے حدیث بیان کی انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس بیٹھے ہوئے تھے کہ انھوں نے کہا : فتنے کے متعلق رسول اللہ صلی اللہ علیہ وسلم کا ارشاد جس طرح آپ نے خود فرمایا تھا تم میں سے کسی کو یاد ہے؟ ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے عرض کی : مجھے ۔ ( حضرت عمر رضی اللہ تعالیٰ عنہ نے ) کہا : تم بہت جرات مند ہو ۔ ( یہ بتاؤ کہ ) آپ صلی اللہ علیہ وسلم نے کس طرح ارشاد فرمایاتھا؟میں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا آپ فرما رہے تھے ۔ انسان اپنے گھروالوں اپنےمال اپنی جان اور اپنے ہمسائے کے بارے میں جس فتنے میں مبتلا ہوتاہے تو روزہ نماز ، صدقہ ، نیکی کا حکم کرنا اور برائی سے منع کرنا اس کا کفارہ بن جاتے ہیں ۔ تو حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : میری مراد اس سے نہیں میری مراد تواس ( فتنے ) سے ہے جو سمندر کی موجوں کی طرح امڈکرآتا ہے ۔ حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے کہا : امیر المؤمنین!آپ کو اس فتنے سے کیا ( خطرہ ) ہے؟آپ کے اور اس فتنے کے درمیان ایک بنددروازہ ہے ۔ انھوں نے کہا : وہ دروازہ توڑاجائے گا یا کھولا جا ئے گا؟کہا : میں نے جواب دیا نہیں بلکہ توڑاجائےگا ۔ ( حضرت عمر رضی اللہ تعالیٰ عنہ نے ) کہا : پھر اس بات کی زیادہ توقع ہے کہ وہ ( دروازہ دوبارہ ) کبھی بند نہیں کیا جا سکے گا ۔ ( شقیق نے ) کہا : ہم نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے پوچھا کیا حضرت عمر رضی اللہ تعالیٰ عنہ جانتے تھے کہ دروازہ کون ہے؟انھوں نے کہا : ہاں اسی طرح جیسے وہ یہ بات جانتے تھے کہ صبح کے بعد رات ہے میں نے ان کو ایک حدیث بیان کی تھی وہ کوئی اٹکل بچو بات نہ تھی ۔ کہا : پھر ہم اس بات سے ڈرگئے کہ حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے پوچھیں وہ دروازہ کون تھا؟ ہم نے مسروق سے کہا : آپ ان ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ ) سے پوچھیں انھوں نے پوچھا تو ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے ) کہا : ( وہ دروازہ ) حضرت عمر رضی اللہ تعالیٰ عنہ ( تھے)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 34
			}
		}
	]
}