{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7278,
			"arabicnumber": "2897",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہو گی ، یہاں تک کہ رومی ( عیسائی ) اعماق ( شام میں حلب اور انطاکیہ کے درمیان ایک پر فضا علاقہ جو دابق شہر سے متصل واقع ہے ) یا دابق میں اتریں گے ۔ ان کے ساتھ مقابلے کے لیے ( دمشق ) شہر سے ( یامدینہ سے ) اس وقت روئے زمین کے بہترین لوگوں کا ایک لشکر روانہ ہو گا جب وہ ( دشمن کے سامنے ) صف آراءہوں گے تو رومی ( عیسائی ) کہیں گے تم ہمارے اور ان لوگوں کے درمیان سے ہٹ جاؤ جنھوں نے ہمارے لوگوں کو قیدی بنایا ہوا ہے ہم ان سے لڑیں گے تو مسلمان کہیں گے ۔ اللہ کی قسم!نہیں ہم تمھارے اور اپنے بھائیوں کے درمیان سے نہیں ہٹیں گے ۔ چنانچہ وہ ان ( عیسائیوں ) سے جنگ کریں گے ۔ ان ( مسلمانوں ) میں سے ایک تہائی شکست تسلیم کر لیں گے اللہ ان کی توبہ کبھی قبول نہیں فرمائے گا اور ایک تہائی قتل کر دیے جائیں گے ۔ وہ اللہ کے نزدیک افضل ترین شہداء ہوں گے اور ایک تہائی فتح حاصل کریں گے ۔ وہ کبھی فتنے میں مبتلا نہیں ہوں گے ۔ ( ہمیشہ ثابت قدم رہیں گے ) اور قسطنطنیہ کو ( دوبارہ ) فتح کریں گے ۔ ( پھر ) جب وہ غنیمتیں تقسیم کر رہے ہوں گے اور اپنے ہتھیار انھوں نے زیتون کے درختوں سے لٹکائے ہوئے ہوں گے تو شیطان ان کے درمیان چیخ کر اعلان کرے گا ۔ مسیح ( دجال ) تمھارےپیچھے تمھارے گھر والوں تک پہنچ چکا ہے وہ نکل پڑیں گے مگر یہ جھوٹ ہو گا ۔ جب وہ شام ( دمشق ) پہنچیں گے ۔ تووہ نمودار ہو جا ئے گا ۔ اس دوران میں جب وہ جنگ کے لیے تیاری کررہے ہوں گے ۔ صفیں سیدھی کر رہے ہوں گے تو نماز کے لیے اقامت کہی جائے گی اس وقت حضرت عیسیٰ بن مریم علیہ السلام اتریں گے تو ان کا رخ کریں گے پھر جب اللہ کا دشمن ( دجال ) ان کو دیکھے گاتو اس طرح پگھلےگا جس طرح نمک پانی میں پگھلتا ہے اگر وہ ( حضرت عیسیٰ علیہ السلام ) اسے چھوڑ بھی دیں تو وہ پگھل کر ہلاک ہوجائے گا لیکن اللہ تعالیٰ اسے ان ( حضرت عیسیٰ علیہ السلام ) کے ہاتھ سے قتل کرائے گااور لوگوں کو ان کے ہتھیارپر اس کا خون دکھائےگا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 44
			}
		}
	]
}