{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 93,
			"arabicnumber": "8.01",
			"text": "کہمس سے ا بن بریدہ سے ، انہوں نے یحیی بن یعمر سےروایت کی ، انہوں نے کہا کہ سب سے پہلا شخص جس نے بصرہ میں تقدیر ( سے انکار ) کی بات کی ، معبد جہنی تھا میں ( یحیی ) اور حمید بن عبد الرحمن خمیری حج یا عمرے کے ارادے سے نکلے ، ہم نے ( آپس میں ) کہا : کاش! رسول اللہ ﷺ کے صحابہ میں سے کسی کے ساتھ ہماری ملاقات ہو جائے تو ہم ان سے تقدیر کے بارے میں ان ( آج کل کے ) لوگوں کی کہی ہوئی باتوں کے متعلق دریافت کر لیں ۔ توفیق الہٰی سے ہمیں حضرت عبد اللہ بن عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ مسجد میں داخل ہوتے ہوئے مل گئے ۔ میں اور میرے ساتھ نے ان کے درمیان میں لے لیا ، ایک ان کی دائیں طرف تھا اور دوسرا ان کی بائیں طرف ۔ مجھے اندازہ تھا کہ میرا ساتھی گفتگو ( کامعاملہ ) میرے سپرد کرے گا ، چنانچہ میں نے عرض کی : اے ابو عبدالرحمن ! ( یہ عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی کنیت ہے ) واقعہ یہ ہے کہ ہماری طرف کچھ ایسے لوگ ظاہر ہوئے جو قرآن مجید پڑھتے ہیں اور علم حاصل کرتے ہیں ( اور ان کے حالات بیان کیے ) ان لوگوں کا خیال ہے کہ تقدیر کچھ نہیں ، ( ہر ) کام نئے سرے سے ہو رہا ہے ( پہلے اس بارے میں نہ کچھ طے ہے ، نہ اللہ کا اس کاعلم ہے ۔ ) ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : جب تمہاری ان لوگوں سے ملاقات ہو تو انہیں بتا دینا کہ میں ان سے بری ہوں اور وہ مجھ سے بری ہیں ۔ اس ( ذات ) کی قسم جس ( کے نام ) کے ساتھ عبد اللہ بن عمر حلف اٹھاتا ہے ! اگر ان میں سے کسی کو پاس احد پہاڑ کے برابر سونا ہو اور وہ اسے خرچ ( بھی ) کر دے تو اللہ تعالیٰ اس کی طرف سے اس کوقبول نہیں فرمائے گا یہاں تک کہ وہ تقدیر پر ایمان لے آئے ، پھر کہا : مجھے میرے والد عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا : ایک دن ہم رسول ا للہ ﷺ کی خدمت میں حاضر تھے کہ اچانک ایک شخص ہمارے سامنے نمودار ہوا ۔ اس کے کپڑے انتہائی سفید اوربا ل انتہائی سیاہ تھے ۔ اس پر سفر کا کوئی اثر دکھائی دیتا تھا نہ ہم میں سے کوئی اسے پہچانتا تھا حتیٰ کہ وہ آ کر نبی اکرمﷺ کے پاس بیٹھ گیا اور اپنے گھٹنے آپ کے گھٹنوں سے ملا دیے ، اور اپنے ہاتھ آپﷺ کی را نوں پر رکھ دیے ، اور کہا : اے محمد ( ﷺ ) ! مجھے اسلام کے بارے میں بتائیے ۔ رسول اللہ ﷺ نے فرمایا : ’’اسلام یہ ہے کہ تم اس بات کی گواہی دو کہ اللہ تعالیٰ کے سوا کوئی عبادت کےلائق نہیں اور محمدﷺ اس کے رسول ہیں ، نماز کا اہتمام کرو ، زکاۃ ادا کرو ، رمضان کے روزے رکھو اور اگر اللہ کے گھر تک راستہ ( طے کرنے ) کی استطاعت ہو تو اس کا حج کرو ۔ ‘ ‘ اس نے کہا : آپ نے سچ فرمایا ۔ ( حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : ہمیں اس پر تعجب ہوا کہ آپ سے پوچھتا ہے اور ( خود ہی ) آپ کی تصدیق کرتا ہے ۔ اس نے کہا : مجھے ایمان کے بارے میں بتائیے ۔ آپ نے فرمایا : ’’یہ کہ تم اللہ تعالیٰ ، اس کے فرشتوں ، اس کی کتابوں ، اس کے رسولوں اور آخری دن ( یوم قیامت ) پر ایمان رکھو اور اچھی اور بری تقدیر پر بھی ایمان لاؤ ۔ ‘ ‘ اس نے کہا : آپ نے درست فرمایا ۔ ( پھر ) اس نے کہا : مجھے احسان کے بارے میں بتائیے ۔ آپ نے فرمایا : یہ کہ تم اللہ تعالیٰ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو اور اگر تم اسے نہیں دیکھ رہے تو وہ تمہیں دیکھ رہا ہے ۔ ‘ ‘ اس نے کہا : تومجھے قیات کے بارے میں بتائیے ۔ آپ نے فرمایا : ’’جس سے اس ( قیامت ) کے بارے میں سوال کیا جا رہا ہے ، وہ پوچھنے والے سے زیادہ نہیں جانتا ۔ ‘ ‘ اس نے کہا : تو مجھے اس کی علامات بتا دیجیے ۔ آپ نے فرمایا : ’’ ( علامات یہ ہیں کہ ) لونڈی اپنی مالکہ کو جنم دے اور یہ کہ تم ننگے پاؤں ، ننگے بدن ، محتاج ، بکریاں چرانے والوں کو دیکھو کہ وہ اونچی سے اونچی عمارتیں بنانے میں ایک دوسرے کے ساتھ مقابلہ کر رہے ہیں ۔ ‘ ‘ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : پھر وہ سائل چلا گیا ، میں کچھ دیر اسی عالم میں رہا ، پھر آپ ﷺ نے مجھ سے کہا : ’’اے عمر !تمہیں معلوم ہے کہ پوچھنے والا کون تھا؟ ‘ ‘ میں نے عرض کی : اللہ اور اس کا رسول زیادہ آگاہ ہیں ۔ آپﷺ نے فرمایا : ’’وہ جبرئیل تھے ، تمہارے پاس آئے تھے ، تمہیں تمہارا دین سکھا رہے تھے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		}
	]
}