{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 936,
			"arabicnumber": "418.01",
			"text": "موسیٰ بن ابی عائشہ نے عبید اللہ بن عبد اللہ سے روایت کی ، انہوں نے کہا : میں حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور ان سے کہا : کیا آپ مجھے رسول اللہﷺ کی بیماری کے بارے میں نہیں بتائیں گی؟ انہوں نے کہا : کیوں نہیں! جب ( بیماری کے سبب ) نبی ( کے حرکات وسکنات ) بوجھل ہونے لگے تو آپ نے فرمایا : ’’ کیا لوگوں نے نماز پڑھ لی؟ ‘ ‘ ہم نے عرض کی : اللہ کے رسول! نہیں ، وہ سب آپ کا انتظار کر رہے ہیں ۔ آپ نے فرمایا : میرے لیے بڑے طشت میں پانی رکھو ۔ ‘ ‘ ہم نے پانی رکھا تو آپ نے غسل فرمایا : پھر آپ نے اٹھنے کی کوشش کی تو آپ پر بے ہوشی طاری ہو گئی ، پھر آپ کو افاقہ ہوا تو فرمایا : ’’ کیا لوگوں نے نماز پڑھی لی؟ ‘ ‘ ہم نے کہا : نہیں ، اللہ کے رسول! وہ آپ کے منتظر ہیں ۔ آپ نے فرمایا : ’’ میرے لیے بڑے طشت میں پانی رکھو ۔ ‘ ‘ ہم نے رکھا تو آپ نے غسل فرمایا : پھر آپ اٹھنے لگے توآپ پر غشی طاری ہو کئی ، پھر ہوش میں آئے تو فرمایا : ’’ کیا لوگوں نے نماز پڑھ لی ہے؟ ‘ ‘ ہم نے کہا : نہیں ، اللہ کے رسول! وہ آپ کا انتظار کر رہے ہیں ۔ آپ نے فرمایا : ’’میرے لیے بڑے طشت میں پانی رکھو ۔ ‘ ‘ ہم نے رکھا تو آپ نے غسل فرمایا : پھر اٹھنے لگے تو بے شہوش ہو گئے ، پھر ہوش میں آئے تو فرمایا : ’’ کیا لوگوں نے نماز پڑھ لی؟ ‘ ‘ ہم نے کہا : نہیں ، اللہ کے رسول! وہ رسول اللہﷺ کا انتظار کرر ہے ہیں ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا : لوگ مسجد میں اکٹھے بیٹھے ہوئے عشاء کی نماز کے لیے رسول اللہﷺ کا انتظار کر رہے تھے ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا : پھر رسول اللہﷺ نے ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف پیغام بھیجا کہ وہ لوگوں کو نماز پڑھائیں ۔ پیغام لانے والا ان کے پاس آیا اور بولا : رسول اللہﷺ آپ کو حکم دے رہے ہیں کہ آپ لوگوں کو نماز پڑھائیں ۔ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا ، اور وہ بہت نرم دل انسان تھے : عمر! آپ لوگوں کو نماز پڑھائیں ۔ عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : آپ ہی اس کے زیادہ حقدار ہیں ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا : ان دنوں ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے لوگوں کو نماز پڑھائی ، پھر یہ ہوا کہ رسول اللہﷺ نے کچھ تخفیف محسوس فرمائی تو دو مردوں کا سہارا لے کر ، جن میں سے ایک عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ تھے ، نماز ظہر کے لیے نکلے ، ( اس وقت ) ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ لوگوں کو نماز پڑھا رہے تھے ، جب ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے آپ کو دیکھا تو پیچھے ہٹنے لگے ، اس پر نبیﷺ نے انہیں اشارہ کیا کہ پیچھے نہ ہٹیں اور آپ نے ان دونوں سے فرمایا : ’’ مجھے ان کے پہلو میں بٹھا دو ۔ ‘ ‘ ان دونوں نے آپ کو ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پہلو میں بٹھا دیا ، ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کھڑے ہو کر نبیﷺ کی اقتدا میں نماز پڑھ رہے تھے اور لوگ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی نماز کی اقتدا کر رہے تھے اور نبیﷺ بیٹھے ہوئے تھے ۔ ( حضرت عائشہ رضی اللہ عنہا سے روایت کرنے والے راوی ) عبید اللہ نے کہا : پھر میں حضرت عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں حاضر ہوا اور ان سے عرض کی : کیا میں آپ کے سامنے وہ حدیث پیش نہ کروں ، جو حضرت عائشہ رضی اللہ عنہا نے مجھے نبی ﷺ کی بیماری کے بارے میں بیان کی ہے؟ انہوں نے کہا : لاؤ ۔ تو میں نے ان کے سامنے عائشہ رضی اللہ عنہا کی حدیث پیش کی ، انہوں نے اس میں سے کسی بات کا انکار نہ کیا ، ہاں! اتنا کہا : کیا حضرت عائشہ رضی اللہ عنہ نے تمہیں اس آدمی کا نام بتایا جو عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ تھے؟ میں نے کہا : نہیں ۔ انہوں نے کہا : وہ حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ تھے ۔",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 98
			}
		}
	]
}