{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"30": "Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "İbn Şihab'a büyüğün emmesinin hükmü sorulunca, bu hususta, Urve b. Zübeyr bana şunları haber verdi dedi: «Resulullah'ın ashabından Bedir muharebesinde bulunan Ebu Huzeyfe b. Utbe b. Rabia, Resulullah'ın Zeyd b. Harise'yi oğulluk edindiği gibi, azadhsı Salim'i oğulluk edinip evlendirdi. Onu oğlu gibi görü­yordu. Kardeşi Velidin kızı Fatıma ile evlendirdi. Fatıma Kureyş'in en güzide genç kızlarından olup ilk hicret edenlerdendi. Allah Teala, Zeyd b. Harise hakkında: «Onları (oğulluklarını­zı) babalarının adiyle çağırın. Bu, Allah indinde daha doğrudur. Eğer babalarını bilmiyorsanız onlar dinde kar­deşleriniz ve do8tlarınızdır.»[Ahzab 5] ayetini indirince bu oğulluklar babalarına verildi. Babaları bilinmiyorsa, velilerine verildi. O sı­rada Ebu Huzeyfe'nin hanımı Amir b. Lüey kabilesine mensup olan Süheyl'kızı Sehle Resulullah'a gelerek: «— Ey Allah'ın Peygamberi, Biz Salim'i çocuğumuz gibi görü­yorduk. Yanımıza serbestçe girip çıkıyordu. Benim başım açık oluyor. Evimizde yalnız bir oda var. Salim hakkında ne buyurur­sun? Yanımızda kalabilir mi?» deyince, Resulullah Sallallahu Aleyhi ve Sellem: «— Onu beş defa emzir süt oğlun olur.» (Yanına girip çık­ması caiz olur.) buyurdu. Sehle dediği gibi yaptı. Böylece Salimi süt oğul sayardı. Hz. Aişe de yanına girmesini arzu ettiği kimseye bu hükmü uygulardı. Kız kardeşi Ümmü Gülsüm ve erkek kardeş­lerinin kızlarına, yanma almasını arzu ettiği erkekleri emzirme­lerini emrederdi. Ama Peygamber Efendimiz'in Sallallahu Aleyhi ve Sellem diğer ha­nımları bu emme ile hiç kimseyi yanlarına kabul etmezlerdi ve: «Hayır, Allah'a yemin ederiz ki Resulullah'ın Sehle'ye emri sadece Salim'in emmesine mahsus bir ruhsattır. (Başkalarının bu hük­mü uygulamaları doğru olmaz.) Hayır, Allah'a yemin ederiz ki, bu emme ile hiç bir kimse yanımıza giremez.» derlerdi. İbn Abdilber der ki: Bu, müsnede giren bir hadistir. Çünkü Urve, Hz. Aişe'yle ve Rasulullah'm diğer eşleriyle görüşmüştür. Müslim - Rada",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 1284
			}
		}
	]
}