{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Yesar oğlu Süleyman'dan: Kemiğe kadar işleyen yüzdeki ya­ralamanın diyeti, baş kemiğine kadar ulaşan yaralama diyeti gi­bidir. Ancak yara yüzde kusur bırakırsa, o zaman yüzün diyetine başdaki yaranın diyetinin yarısı kadar daha ilave edilir. Böylece diyetin miktarı, yetmişbeş dinar olur. İmam Malik der ki: Beyne kadar ulaşmıyan yaralama halle­rinde diyet onbeş devedir. Eti kemikten alan ve beyne kadar ulaş­mayan yara, başta ve yüzde olur. îmam Malik der ki: Beyne ve karın boşluğuna ulaşan yarala­mada kısas gerekmez. Nitekim tbn Şihab da, «beyne kadar ulaşan yaralamada kısas yoktur» demiştir. îmam Malik der ki: Kemiği kırıp beyne ulaşan yaralama an­cak kafada olur. îmam Malik der ki: Baş ve yüzdeki kemiği meydana çıkarma­yan ufak yaralamalarda diyet yoktur. Diyet kemiğe kadar işleyen ve daha büyük yaralamalarda vardır. Çünkü peygamber efendi­miz (s.a.v.) Amr b. Hazm'a diyetlerle ilgili yazdığı fermanda en son olarak kemiğe kadar işleyen yaralamayı zikretmiş ve diyetini beş deve takdir etmiştir. Ne eski ve ne de yeni hiçbir halife kemiğe kadar işlemeyen küçük yaralar için diyete hükmetmemişlerdir. Said b. Müseyyeb: «İnsanın herhangi bir uzvunda açılan yara için o uzvun diyetinin üçte biri gerekir» dedi. îmam Malik der ki; İbn Şihab böyle ufak yaralamalarda diyet gerekmeyeceği görüşünde idi. Bana göre de, bu gibi hallerde üze­rinde ittifak edilmiş belirli bir diyet yoktur. Fakat hakimin diyet takdir edebileceği görüşündeyim. İmam Malik der ki: Bize göre, beyne kadar ulaşan yaralama, yüz ve baş kemiklerinin yaralanması, yaranın eti sıyırarak kemi­ğin meydana çıkması başta ve yüzde olunca belirtilen diyet vardır. Vücudun diğer yerlerindeki yaralamalarda hüküm, hakimin tak­dirine bırakılır. imam Malik der ki: Alt çene kemiği ile burun kemiği başdan değildir. Müstakil iki ayrı kemikdirler. Bunların yaralanma­sında diyet olmadığı görüşündeyim. Baş kemiği bunların dışında müstakildir. Ebu Abdurrahman oğlu Rabia'dan «Abdulah b. Zübeyr baş ke­miğinin yaralanmasında kısas yaptı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1567
			}
		}
	]
}