{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"9": "Shortening the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 336,
			"arabicnumber": 336,
			"text": "Abdullah b. Ömer'den: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: «Ay yirmi dokuz çekebilir, hilâli görmeden oruca başlamayın, hilâli görmeden bayram da yapmayın. Şayet Ramazanın son günü hava bulutlu olursa ayı otuz güne tamamlayın.» Buhârî, Savm, 30/11; Müslim, Siyam, 13/9. «İHTİLAF-I METALİ»a itibar eden, fıkhı görüş açısından konuya bakıldığı zaman, bu konudaki ayrılığı tabiî karşılamak mümkündür. Ancak, hemen ifade etmeliyiz ki, bugün bu konuda görülen ayrılık, «İHTİLAF-I METALİ»a itibar etmekten meydana gelmemektedir. Hilâlin tesbitinde uygulanan farklı metotların meydana getirdiği bir ayrılıktır. Ancak, kabule mecburuz ki, «İHTİLAF-I METALİ»a itibardan dolayı meydana gelmiş de olsa, günümüz müslumanlarının ayrılığa tahammülü yoktur. Çünkü, biraz önce de belirttiğimiz gibi, dünyamız küçülmüş, mesafeler kısalmıştır. Çok seri haberleşme ve ulaşım imkânları sayesinde, dünyanın herhangi bir noktasında meydana gelen bir olay, bu noktaya en uzak köşesinde bile, anında duyulabilmektedir. Bir İslâm Ülkesinde bayram yapılırken, bir başka İslâm Ülkesinde oruca devam edilmesi, «İHTİLAF-I METALİ»a itibar eden fikhî görüşe dayanılmış da olsa, müslüman toplumları izahı mümkün olmayan bir sonuçla karşı karşıya getirmektedir. Aslında, çok iyi bildiğimiz gibi; Hanefî, Maliki ve Hanbelî Mezheplerinin cumhur-ı fukahası «İHTİLAF-I METALÎ»a itibar edilmemesi, hilâlin bir yerde sübutu halinde bütün İslâm Dünyasının bu sübuta göre amel etmesi görüşündedir. Şafiî mezhebinde de aynı görüşü benimseyen fakihler vardır. O halde, bu ayrılığı ortadan kaldırmak hepimiz için önemli bir görev olmaktadır. konuda özellikle Avrupa ülkelerinde çalışan ve değişik İslâm Ülkelerine mensup bulunan müslümanlar, daha güç durumdadır. Bunların bir kısmı, kendi ülkelerine uymakta, diğer bir kısmı, başka ülkelerin ilânına itibar etmekte, böylece aynı şehirde yaşayan, aynı dine, hatta aynı millete mensup olan müslümanlar, ayrı günlerde oruca başlamakta ve bayram yapmaktadır. Bunlar içinde kırıcı ithamlarda bulunanlar ve farkında olmadan fitneye yol açanlar da pek çoktur. Bu halin onları, gayr-ı müslimler karşısında güç bir duruma sokmuş olması da ayrı bir gerçek ve ayrı bir acıdır. ülkelerde çalışan müslüman işçisi, kendisine müslüman olmayanlar tarafından sorulan «Siz hepiniz aynı dinin mensupları değil misiniz? Niçin aynı günde bayram yapmıyorsunuz?» sorusuyla karşı karşıya gelmekten kurtarılmalıdır. Bu konuda en yakın geçmişteki, Ramazan, Şevval ve Zilhicce hilâllerinin tesbitini örnek olarak ele almak istiyorum. malûmları olduğu üzere, 1398 H. -1978 M. yılı Ramazan orucuna bazı İslâm Ülkelerinde (Meselâ: Türkiye, Afganistan, Fas ve Nijerya'da) 6 Ağustos 1978 Pazar günü başlanmışken, diğer bazıları (meselâ: Mısır, Suudî Arabistan, Lübnan, Suriye gibi ülkelerde) oruca 5 Ağustos Cumartesi günü girilmiştir. İslâm Ülkelerinin büyük çoğunluğu 5 veya 6 Ağustos günlerinde bölünerek oruca başlarken, 4 ve 7 Ağustos günleri Ramazan'a giren ülkeler de vardır. Büyükelçiliklerden aldığımız bilgiler bizi yanıltıcı nitelikte değilse, Irak ve Kuveyt'deki müslümalar, 4 Ağustosta oruca niyyet etmişler, Pakistan'daki müslüman kardeşlerimiz ise, oruç tutmağa 7 Ağustos günü başlamışlardır. «İHTİLAF-I METALÎ»a itibar eden fıkhî görüş savunulsa bile, bu tablo karşısında İslâm Dünyasının hazin durumunu görmemek mümkün değildir. 1398 H. /1978 M. yılı Şevval hilâline gelince: hazin sonuç, bu hilâlin ilanı konusunda da ortaya çıkmıştır. Şöyle ki: Bazı ülkelerde 2 Eylül akşamı Şevval hilâli görülmüş gibi, 3 Eylülde bayram yapılmış, diğer bazı ülkelerde ise, aynı gün oruca devam edilerek, bayrama bir gün sonra (4 Eylülde) girilmiştir. Kesin tesbitlerimiz olmamakla beraber, Ramazan'a girişlerine bakarak, bazı ülkelerde de 2 ve 5 Eylül günlerinde bayram yapıldığım söylemek mümkündür. Yine bu yıl, Zilhicce hilalinin tesbitinde ve kurban bayramının ilânında karşılaşılan sonuç, Ramazan ve Şevval hilâllerinin durumundan farklı olmamıştır. Bazı İslâm ülkelerinde 31 Ekim akşamı Zilhicce hilâli görülmüş gibi 1 Kasım tarihi 1 Zilhicce olarak ilân edilirken, diğer bazılarında 2 Kasım günü 1 Zilhicce olarak kabul ve ilân edilmiştir. kanaatimiz olur ki, bu ayrılık, «İHTİLAF-I METALİ»'dan doğan bir ayrılık değildir. Bu ülkelerde hilâl gözlenmesi ve tesbitinin yol açtığı bir ayrılık da değildir. Şu veya bu ülkelerin hilâli bizzat gözleyerek ve sadece bu gözlem olarak ilân ettiklerini, diğerlerinin ise, bunu yapmadıkları için yanlış yolda olduklarını iddia etmek de imkânsızdır. İhtilâfın temelinde, İslâm ülkelerinde uygulanan farklı metotlar yatmaktadır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 336
			}
		}
	]
}