{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 804,
			"arabicnumber": 804,
			"text": "Süleyman b. Yesar'dan: Saîd b. Huzabe el-Mahzumî Mekke'ye giderken yolda sara hastalığına yakalandı. îhramlı idi. Yol üzerindeki suya gelen birine sorarak Abdullah b. Ömer, Abdullah b. Zübeyr ve Mervan b. Hakem'i buldu. Başına gelen durumu onlara anlattı. Hepsi de tedavisi gerektiğini ve fidye vermesini, iyileşince Umre yapıp ihramdan çıkmasını, gelecek sene de hac edip uygun bir kurban kesmesini söylediler. İmam Malik der p;i: Düşmanın dışında bir engelden dolayı muhsar kalanın (Kabe'ye gidemeyenin) durumu biz Medineliler arasında da böyledir. Ebu Eyyüb el-Ensari ile Hebbar b. Esved hacca yetişemeyip bayram günü geldiklerinde Hz. Ömer onlara, umre yaparak ihramdan çıkmalarını, sonra da ihramsız olarak dönmelerini emretmişti. Ayrıca ertesi sene haclarını ifa etmelerini, kurban kesmelerini, bulamazlarsa üç gün hacda, yedi gün de dönünce toplam on gün oruç tutmalarını emretmişti. îmam Malik'ten: îhrama girdikten sonra hastalık, günleri şaşırma, ayı şaşırma gibi engellerden dolayı muhsar kalan, yani haccını zamanında ifa edemeyen kimseler muhsar sayılırlar. Muhsar kalanın yapması gerekenleri yaparlar. İmam Malik'e «Mekkeli olup da hac için ihrama giren, sonra da bir yeri kınlan, yahut şiddetli karın ağrısına yakalanan kimsenin ve kocasından boşanan kadının durumu» sorulduğunda şöyle dedi: Bu durumdaki kimseler muhsar (hacca gitmesi engellenmiş) sayılırlar. Mekke'ye dışarıdan gelip de muhsar kalanlara uygulanan bunlara da uygulanır. «Hac aylarında umresini yaptıktan sonra hac için ihrama girerek Mekke'de kalan kimsenin bir yeri kırılsa veya herkesle beraber zamanında vakfesini yapma imkanını bulamasa, böyle bir kimsenin nasıl hareket edeceği» konusunda da imam Malik şöyle der: «Bana kalırsa orada iyileşinceye kadar kalır. İyileşince Hill'e çıkarak tekrar Mekke'ye döner, tavaf ve sa'y i yaptıktan sonra ihramdan çıkar. Ertesi sene de haccını ifa ederek kurbanını keser.» Mekke'den hac için ihrama girdikten-sonra tavaf ve sa'yini yapınca hastalanıp herkesle beraber vaktinde vakfeye yetişemeyen kimseyle ilgili olarak da imam Malik şöyle der: Haccı kaçırdığı zaman elinden gelirse Hill'e çıkar, oradan umreye girerek tavaf ve sa'y yapar. Çünkü ilk tavafında Umreye niyet etmemişti. Ertesi sene de haccını ifa ederek kurbanını keser. Şayet Mekke dışından gelmiş de tavaf ve sa'ydan sonra haccını ifa edememişse Umre yaparak ihramdan çıkar, ancak yeniden bir tavaf ve sa'y daha yapar, çünkü ilk yapmış olduğu tavaf ve sa'yde ifa edemediği hacca niyet etmişti. (Son yaptığı ise Umre tavafı ve sa'yidir.) Ertesi sene ise yetişemediği hacını ifa ederek hediy kurbanını keser",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 804
			}
		}
	]
}