{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 834,
			"arabicnumber": 834,
			"text": "Zeyd, babası Eşlem’den şöyle Rivâyet etti: Ömer b. Hattab (radıyallahü anh)'ın oğulları Abdullah ve Ubeydullah (radıyallahü anh) bir ordu ile Irak seferine çıktılar. Dönüşlerinde Basra valisi Ebû Musa el-Eş'arî'ye uğradılar. Ebu Musa el-Eş'âri (radıyallahü anh) onları çok iyi karşıladı ve: Size faydalı olabileceğim bir iş gelse elimden mutlaka yapardım» dedi. Sonra da: Evet, burada hazineye ait biraz mal var. Ben onu Emiril-Mü'minine (halifeye) göndermek istiyorum. Size borç olarak vereyim, onunla Irak'tan biraz mal alır, Medine'de satarsınız, ana parayı Halifeye teslim edersiniz. Yapacağınız kâr da ikinize ait olur.» dedi. Onlar da kabul ettiler. Ebu Musa el-Eş'ârî (radıyallahü anh) böyle yaptı ve Ömer b. Hattab (radıyallahü anh)'a malı onlardan almasını yazdı. ve Ubeydullah (radıyallahü anh) Medine'ye gelince aldıkları malı sattılar ve kâr sağladılar. O malı Hazret-i Ömer (radıyallahü anh)'e verdiklerinde o: Bütün ordu sizin gibi borç aldı mı?» diye sordu. Onlar da: « Hayır» dediler. Bunun üzerine Ömer b. Hattab (radıyallahü anh): Ey Emiril-Müminin'in oğulları, demek siz borç aldınız, hem malı ve hem de kârı ödeyiniz.» dediğinde Abdullah sustu. Ubeydullah ise: Ya emirel müminin, bu kâr sana ait değil, çünkü bu mal, noksanlaşsa veya helak olsaydı biz yine onu ödeyecektik» dedi. Hazret-i Ömer (radıyallahü anh) tekrar: Ödeyiniz» dediğinde, Abdullah yine sustu, Ubeydullah ise aynı şekilde karşı çıktı. Abdullah'ın sükût etmesi, babasına karşı bir saygı ifadesi olarak ona karşı çıkmamasından kaynaklanmaktadır. Ubeydullah'ın cevap vermesi de delil getirerek hakkını istemekti. Bundan sonra Hazret-i Ömer (radıyallahü anh)'ın yine «Mal ve kârını ödeyin» demesi, maldan elde edilen kârda sermaye sahibinin de hakkı olduğunu vurgulamak içindir. (Bâcî, el-Münteka, c. 5, s. 150) Halife Ömer'in, yanındaki adamın işaretini dinleyip aynen kabul etmesi takdire şayandır. Bu da islam'da bir şahsın makamı ne kadar büyük olursa olsun halktan birinin işaret ve tenkitlerini dinleyip onu değerlendirmesi gerektiğini ifade eder. Dolayısıyla, istişare ve tartışmaların önem ve faydasını gösterir. Bunun üzerine Hazret-i Ömer (radıyallahü anh)'ın meclisinde bulunanlardan biri: O malı kırad (mudabere) yapsanız ey müminlerin emiri» diye fikir beyan etti. Ömer (radıyallahü anh)'de: Onu kırad (mudabere) yaptım» dedi ve ana para ile kârının yarısını aldı. Oğulları Abdullah ve Ubeydullah (radıyallahü anh) da kârın diğer yarısını aldılar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 834
			}
		}
	]
}