{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"10": "The Book on Jana''iz (Funerals)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1036,
			"arabicnumber": 1036,
			"text": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [Abdurrahman bin Ka'Abu Bakar bin Malik] bahwa [Jabir bin Abdullah] mengabarinya bahwa Nabi shallallahu 'alaihi wasallam mengumpulkan dua orang dari para korban Perang Uhud dengan satu kain kafan, lalu beliau bertanya: \"Mana di antara keduanya yang lebih banyak hafal Al Qur'an?\" Tatkala ditunjukkan salah satunya, maka beliau mendahulukannya untuk dimasukkan ke dalam liang lahad. Beliau bersabda: \"Saya akan menjadi saksi atas mereka pada Hari Kiamat.\" Beliau memerintahkan agar menguburkan mereka dengan darah-darah mereka. Beliau tidak menshalatkannya, juga tidak memandikannya. (Abu Isa At Tirmidzi) berkata; \"Hadits semakna diriwayatkan dari Anas bin Malik. Abu Isa berkata; \"Hadits Jabir merupakan hadits hasan shahih. Hadits ini diriwayatkan dari [Az-Zuhri] dari [Anas] dari Nabi shallallahu 'alaihi wasallam. Juga diriwayatkan dari [Az-Zuhri] dari [Abdullah bin Tsa'labah bin Abu Shu'air] dari Nabi shallallahu 'alaihi wasallam. Di antara mereka ada yang menyebutkan dari Jabir. Ulama berselisih tentang shalat atas orang mati syahid. Sebagian berpendapat; tidak perlu dishalati orang yang syahid. Ini pendapat panduduk Madinah, juga pendapat Syafi'i dan Ahmad. Sebagian berpendapat; orang yang syahid harus dishalati, mereka berdalil dengan hadits Nabi shallallahu 'alaihi wasallam bahwa beliau shalat atas Hamzah. Ini adalah pendapat Ats Tsauri dan penduduk Kufah dan juga Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 72
			}
		}
	]
}