{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "Telah menceritakan kepada kami [Ibnu Abu Umar], telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ibnu Juraij] dari [Sulaiman bin Musa] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita manapun yang menikah tanpa seizin walinya maka nikahnya adalah batal, nikahnya adalah batal, nikahnya adalah batal. Jika dia telah digauli maka dia berhak mendapatkan mahar, karena suami telah menghalalkan kemaluannya. Jika terjadi pertengkaran di antara mereka, maka penguasalah yang menjadi wali atas orang yang tidak punya wali.\" Abu Isa berkata; \"Ini merupakan hadits hasan. [Yahya bin Sa'id Al Anshari], [Yahya bin Ayyub], [Sufyan Ats Tsauri] dan yang lainnya dari kalangan huffazh, meriwayatkan dari [Ibnu Juraij] seperti di atas.\" Abu Isa berkata; \"Hadits Abu Musa di dalamnya ada perselisihan. [Isra`il], [Syarik bin Abdullah], [Abu Awanah], [Zuhair bin Mu'awiyah], [Qais bin Ar Rabi'] meriwayatkan dari [Abu Ishaq] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam. [Asbath bin Muhammad] dan [Zaid bin Hubab] meriwayatkan dari [Yunus bin Abu Ishaq] dari [Abu Ishaq] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam. [Abu 'Ubaidah Al Haddad] meriwayatkan dari [Yunus bin Abu Ishaq] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam seperti di atas dengan tidak menyebutkan di dalamnya dari Abu Ishaq. Diriwayatkan dari [Yunus bin Abu Ishaq] dari [Abu Ishaq] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam juga. [Syu'bah] dan [Ats Tsauri] meriwayatkan dari [Abu Ishaq] dari [Abu Burdah] dari Nabi shallallahu 'alaihi wasallam: \"Tidak ada (tidak sah) nikah kecuali dengan wali.\" Para sahabat Sufyan menyebutkan dari Sufyan dari Abu Ishaq dari Abu Burdah dari Abu Musa dan tidak sahih riwayat mereka, yang meriwayatkan dari Abu Ishaq dari Abu Burdah dari Abu Musa dari Nabi shallallahu 'alaihi wasallam: \"Tidak sah nikah kecuali dengan wali.\" Menurutku lebih sahih karena mereka mendengar dari Abu Ishaq pada waktu yang berbeda-beda. Walau Syu'bah dan Ats Tsauri lebih terjaga dan lebit tsabat dari semuanya yang meriwayatkan dari Abu Ishaq pada hadits ini. Sesungguhnya riwayat mereka menurutku lebih mirip karena Syu'bah dan Ats Tsauri telah mendengar hadits ini dari Abu Ishaq pada satu majlis. Bukti lain yang menunjukkan hal itu, apa yang telah diceritakan kepada kami; [Mahmud bin Ghailan] berkata; Telah menceritakan kepada kami [Abu Daud] berkata; Telah memberitakan kepada kami [Syu'bah] berkata; Saya telah mendengar [Sufyan Ats Tsauri] bertanya kepada [Abu Ishaq]; apakah kamu telah mendengar [Abu Burdah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada (tidak sah) nikah kecuali dengan wali.\" Dia menjawab; \"Ya.\" Hadits ini menunjukkan bahwa Syu'bah dan Ats Tsauri mendengar hadits ini pada satu waktu. Isra`il merupakan orang yang dapat dipercaya dan kokoh dalam meriwayatkan hadits Abu Ishaq. Saya telah mendengar Muhammad bin Al Mutsanna berkata; saya telah mendengar Abdurrahman bin Mahdi berkata; Saya tidak ketinggalan dengan hadits Ats Tsauri dari Abu Ishaq melainkan aku pasrahkan dan mempercayai Isra`il, karena dia datang dengan meriwayatkan hadits yang lebih sempurna. Sedangkan hadits Aisyah di dalam bab ini, dari Nabi shallallahu 'alaihi wasallam: \"Tidak ada (tidak sah) nikah kecuali dengan wali.\" Menurutku adalah hadits hasan. [Ibnu Juraij] meriwayatkan hadits ini dari [Sulaiman bin Musa] dari [Az-Zuhri] dari ['Urwah] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam. [Hajjaj bin Arthah] dan [Ja'far bin Rabi'ah] meriwayatkan dari [Az-Zuhri] dari ['Urwah] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam. Dia juga meriwayatkan dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam dengan lafazh yang sama. Sebagian ahli hadits membicarakan hadits Az-Zuhri dari 'Urwah dari Aisyah dari Nabi shallallahu 'alaihi wasallam. Ibnu Juraij berkata; saya bertemu Az-Zuhri, menanyakannya, maka dia mengingkarinya dan mereka medlaifkan hadits ini karena hal ini. Disebutkan dari Yahya bin Ma'in; Isma'il bin Ibrahim dari Ibnu Juraij mendengarnya tidak seperti itu, tapi dia membenarkan kitab-kitabnya atas kitab-kitab Abdul Majid bin Abdul Aziz bin Abu Rawwad dan dia tidak mendengar dari Ibnu Juraij. Yahya mendla'ifkan riwayat Isma'il bin Ibrahim dari Ibnu Juraij. Para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam, di antaranya Umar bin Al Khaththab, Ali bin Abu Thalib, Abdullah bin Abbas, Abu Hurairah dan yang lainnya mengamalkan hadits Nabi shallallahu 'alaihi wasallam: \"Tidak sah nikah kecuali dengan wali.\" Demikian juga diriwayatkan dari sebagian fuqaha' dari kalangan tabi'in. Mereka berpendapat; tidak ada nikah kecuali dengan adanya wali. Mereka adalah Sa'id bin Musayyab, Al Hasan Al Bashri, Syuraikh, Ibrahim An Nakha'i, Umar bin Abdul Aziz dan yang lainnya. Juga merupakan pendapat Sufyan Ats Tsauri, Al Auza'i, Abdullah bin Mubarak, Malik, Syafi'i, Ahmad dan Ishaq",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		}
	]
}