{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "Telah menceritakan kepada kami [Yusuf bin Hammad Al Bashri], telah menceritakan kepada kami [Abdul A'la] dari [Sa'id] dari [Qatadah] dari [Jabir bin Zaid] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Wanita-wanita pezina ialah mereka yang menikahkan diri mereka sendiri tanpa adanya bayyinah (yaitu wali atau saksi).\" Yusuf bin Hammad berkata; Abdul 'Ala memarfu'kan hadits ini dalam Kitab Tafsir dan memauqufkannya dalam Kitab Thalaq. Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Ghundar yaitu Muhammad bin Ja'far, dari Sa'id bin Abu 'Arubah seperti hadits di atas namun tidak memarfu'kannya dan ini lebih sahih. Berkata Abu 'Isa; \"Hadits ini bukan merupakan hadits yang mahfuzh (terjaga). Tidak kami ketahui diriwayatkan secara marfu' kecuali yang diriwayatkan dari Abdul 'Ala dari Sa'id dari Qatadah. Hadits ini diriwayatkan dari Abdul 'Ala dari Sa'id secara mauquf. Yang sahih ialah yang diriwayatkan dari Ibnu Abbas secara mauquf yang berbunyi: \"Tidak sah nikah kecuali dengan adanya bayyinah (saksi atau wali).\" Demikian juga banyak yang meriwayatkan dari Sa'id bin Abu 'Arubah perkataan seperti ini secara mauquf. Hadits semakna diriwayatkan dari Imran bin Hushain, Anas dan Abu Hurairah. Hadits ini diamalkan oleh para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan Tabi'in dan selain mereka, semuanya berpendapat: tidak sah nikah kecuali dengan saksi-saksi. Tidak ada yang menyelisihi pendapat tersebut kecuali sebagian ulama mutaakhkhirin. Para ulama berselisih pendapat dalam hal ini, jika dua orang bersaksi satu demi satu tidak bersamaan. Sebagian besar ulama dari Kufah dan yang lainnya berpendapat: Nikah tidak boleh dilakukan hingga dua orang bersaksi secara bersamaan pada waktu akad nikah. Adapun ahlul Madinah berpendapat: Bolehnya dua orang bersaksi dalam waktu yang tidak bersamaan, jika hal itu diumumkan. Ini merupakan pendapat Malik bin Anas dan yang lainnya. Demikian dikatakan Ishaq mengenai pendapat ahlul Madinah. Ahmad dan Ishaq berpendapat bolehnya seorang lelaki dan dua orang wanita untuk bersaksi",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		}
	]
}