{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khalal], telah menceritakan kepada kami [Ishaq bin Isa] dan [Abdullah bin Nafi' Ash Sha`igh] berkata; Telah mengabarkan kepada kami [Malik bin Anas] dari [Abu Hazim bin Dinar] dari [Sahl bin Sa'ad As Sa'idi] bahwa Rasulullah shallallahu 'alaihi wasallam didatangi seorang wanita lalu berkata; \"Aku berikan diriku kepada engkau.\" Dia berdiri dalam waktu yang lama. Ada seorang laki-laki yang berkata; \"Wahai Rasulullah, nikahkanlah dia denganku, jika engkau tidak menyukainya.\" Beliau bertanya: \"Apakah kamu memiliki sesuatu untuk maharnya.\" Dia menjawab; \"Saya tidak punya apapun kecuali pakaian yang ada pada badanku ini.\" Rasulullah shallallahu 'alaihi wasallam menyanggah: \"Jika pakaianmu kamu berikan, maka kau duduk tanpa pakaian. Carilah yang lainnya!\" Dia menjawab; \"Tidak ada.\" Beliau menyuruh: \"Carilah walau (sebuah) cincin besi.\" Dia mencarinya, namun tetap tidak mendapatkannya. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah kamu hafal (ayat) Al Quran?\" Dia menjawab; \"Ya. surat ini dan itu.\" -beberapa surat yang dia baca-. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku nikahkan kamu dengannya dengan (mahar) hafalanmu (atas ayat-ayat) Al Qur'an.\" Abu Isa berkata; \"Ini merupakan hadits hasan sahih.\" Imam Syafi'i berpendapat berdasarkan hadits ini. Dia berkata; jika dia tidak memiliki sesuatu untuk mahar, maka dia bisa menikahinya dengan beberapa surat dari Al Qur'an. Nikahnya boleh dan dia harus mengajarinya beberapa surat Al Qur'an. Sebagian ulama berpendapat; Nikahnya boleh dan dia harus membayar mahar sepadan. Ini pendapat penduduk Kufah, Ahmad dan Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1114.2,
			"arabicnumber": 1114.2,
			"text": "Telah menceritakan kepada kami [Ibnu Abu Umar], telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ayyub] dari [Ibnu Sirrin] dari [Abu Al 'Ajfa` As Sulami] berkata; [Umar bin Khaththab] berkata; \"Janganlah kalian berlebih-lebihan dalam membayar mahar wanita. Jika hal itu memang suatu kemuliaan di dunia atau sebuah ketakwaan di sisi Allah, niscaya Nabi shallallahu 'alaihi wasallam telah melakukannya. Saya melihat beliau tidak menikahi para isterinya, juga tidak menikahkan para putrinya (dengan mahar) lebih dari dua belas Uqiyyah.\" Abu Isa berkata; \"Ini merupakan hadits hasan sahih. Abu Al Ajfa` As Sulami bernama Harim. Satu Uqiyah menurut para ulama adalah empat puluh dirham. Dua belas Uqiyah adalah empat ratus delapan puluh dirham",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}