{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah bercerita kepada kami [Zaid bin Al Habhab], telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dari Ibnu Mas'ud bahwa dia ditanya tentang seorang lelaki yang menikahi seorang wanita. Lelaki tersebut belum menentukan mahar juga belum menyetubuhinya dan tiba-tiba meninggal. Ibnu Mas'ud menjawab; \"Wanita itu berhak mendapatkan mahar yang sama dengan mahar istri lainnya, tanpa dikurangi atau ditambah. Dia harus menjalani masa iddah dan dia mendapatkan harta warisan.\" Lantas [Ma'qil bin Sinan Al Asyja'i] berdiri sambil berkata; \"Rasulullah shallallahu 'alaihi wasallam telah memberi keputusan hukum mengenai Barwa' binti Wasyiq, salah seorang dari kaum kami seperti yang kau putuskan. Ibnu Mas'ud merasa senang. Abu Isa; \"Hadits semakna diriwayatkan dari Al Jarrh. Telah bercerita kepada kami [Al Hasan bin Ali Al Khallal], telah bercerita kepada kami [Yazid bin Harun] dan [Abdurrazaq] keduanya meriwayatkan dari [Sufyan] dari [Manshur] seperti hadits di atas.\" Abu 'Isa berkata; \"Hadits Ibnu Mas'ud merupakan hadits hasan shahih. Telah diriwayatkan dari Ibnu Mas'ud melalui lebih dari satu jalur dan hadits ini diamalkan oleh sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan yang lainnya. Di antaranya: Ats Tsauri, Ahmad dan Ishaq. Sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam di antaranya: Ali bin Abu Thalib, Zaid bin Tsabit, Ibnu Abbas dan Ibnu Umar, berpendapat; Jika seorang lelaki menikahi seorang wanita, namun sebelum bersetubuh dengannya dan menentukan mahar untuknya dia meninggal, maka si wanita mendapatkan warisan tetapi tidak mendapatkan mahar. Dia wajib menjalani masa iddah. Ini merupakan pendapat Syafi'i. Dia berkata: Jika hadits Barwa' binti Wasyiq yaitu hadits shahih, maka hujjah masalah ini ialah hadits Nabi shallallahu 'alaihi wasallam. Diriwayatkan dari Syafi'i bahwa dia mencabut pendapat ini di Mesir lalu berpendapat dengan hadits Barwa' binti Wasyiq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		}
	]
}