{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"13": "The Book on Divorce and Li'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1177,
			"arabicnumber": 1177,
			"text": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami [Qabishah] dari [Jarir bin Hazim] dari [Zubair bin Sa'id] dari [Abdullah bin Yazid bin Rukanah] [Bapaknya] dari [kakeknya] berkata; \"Aku mendatangi Nabi shallallahu 'alaihi wasallam. Aku berkata; 'Wahai Rasulullah! Aku telah menceraikan istriku dengan tiga kali ucapan talak.' Beliau bertanya: 'Apa yang kamu niatkan? ' Aku menjawab; 'Aku hanya berniat sekali.' Beliau bertanya: 'Demi Allah? ' Aku menjawab; 'Demi Allah.' beliau bersabda: 'Kalau begitu, hukumnya sesuai dengan apa yang kamu niatkan'.\" Abu 'Isa berkata; \"Hadits ini tidak kami ketahui kecuali melalui jalur ini. Aku bertanya kepada Muhammad perihal hadits ini, dia menjawab; 'Dalam hadits ini terdapat idlthirab. Diriwayatkan juga dari Ikrimah dari Ibnu Abbas bahwa Rukanah menceraikan istrinya langsung tiga kali. Para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selainnya berselisih pendapat mengenai talak langsung tiga kali. Diriwayatkan dari Umar bin Khaththab bahwa beliau menganggapnya satu kali. Dan diriwayatkan dari Ali bahwa dia menjadikannya tiga kali talak. Sebagian ulama di antaranya Sufyan Ats Tsauri dan penduduk Kufah berpendapat: hal itu tergantung niat orang yang mentalak. Jika dia berniat satu kali maka dihitung satu kali. Jika berniat tiga kali berarti tiga kali. Jika berniat dua kali maka hanya dihitung satu kali. Sedangkan Malik bin Anas berperndapat: jika dia sudah pernah menyetubuhinya maka dihitung tiga kali. Syafi'i berpendapat: jika dia berniat satu kali, maka dihitung satu kali dan memungkinkan untuk rujuk. Jika berniat dua kali dihitung dua kali, dan jika berniat tiga kali maka dihitung tiga kali",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		}
	]
}