{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"13": "The Book on Divorce and Li'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "Telah menceritakan kepada kami [Ali bin Nashr bin Ali], telah menceritakan kepada kami [Sulaiman bin Harb], telah menceritakan kepada kami [Hammad bin Zaid] berkata; \"Saya bertanya kepada [Ayyub]: 'Apakah kamu tahu selain Hasan yang mengatakan bahwa orang yang berkata kepada istrinya: 'urusanmu ada di tanganmu' adalah sebagai talak tiga? Ayyub menjawab; 'Tidak, hanya Hasan.' Dia berdoa: Ya Allah, ampunilah kecuali yang diceritakan kepadaku oleh [Qatadah] dari [Katsir] mantan budak Bani Samurah, dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Hal itu dihitung tiga kali.\" Ayyub berkata: Aku temui Katsir, mantan budak Bani Samurah. Saya tanyakan kepadanya, namun dia tidak mengetahuinya. Saya kembali kepada Qatadah, lalu saya ceritakan perihal Katsir. Dia menjawab; 'Katsir lupa.' Abu Isa berkata; \"Ini merupakan hadits gharib. Kami tidak mengetahuinya kecuali dari hadits Sulaiman bin Harb dari Hammad bin Zaid. Saya bertanya kepada Muhammad tentang hadits ini. Dia menjawab; telah menceritakan kepada kami Sulaiman bin Harb dari Hammad bin Zaid dengan hadits ini. Hadits ini sebenarnya diriwayatkan dari Abu Hurairah secara mauquf dan tidak diketahui diriwayatkan dari Abu Hurairah secara marfu'. Ali bin Nashr seorang yang hafizh dan ahli hadits. Para ulama berselisih pendapat mengenai perkataan: \"Urusanmu berada di tanganmu.\" Sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, diantaranya Umar bin Khaththab dan Abdullah bin Mas'ud berpendapat: itu dihitung satu kali. Ini juga merupakan pendapat para ulama dari kalangan Tabi'in dan setelah mereka. Adapun Utsman bin Affan dan Zaid bin Tsabit berpendapat: Hal itu tergantung dengan niatnya. Ibnu Umar berkata: jika dia memberi wewenang urusan talak kepada istrinya, lalu istrinya mentalak dirinya tiga kali, namun suami membantah telah menyerahkan urusan talak kepada istrinya dan menyatakan bahwa dia tidak menyerahkan kecuali satu talak, maka suami dimintai sumpah. Yang diakui ialah pernyataan dia dengan ditambah sumpahnya. Sufyan Ats Tsauri dan penduduk Kufah sependapat dengan Umar dan Abdullah, sedangkan Malik bin Anas berpendapat: hal itu tergantung kepada yang diniatkan. Ini juga merupakan pendapata Ahmad. Ishaq berpegang kepada pendapat Ibnu Umar",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		}
	]
}