{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "telah menceritakan kepada kami [Hannad bin As Sari] berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin Urwah] dari [Ayahnya] dari [Abdullah bin Al Arqam] ia berkata; \"Iqamah telah dikumandangkan, lalu ia mengambil tangan seorang laki-laki seraya menyuruhnya ke depan, padahal ia adalah imam bagi kaumnya. Lalu ia berkata; \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika shalat telah dikumandangkan, dan salah seorang dari kalian ingin ke WC, maka hendaklah ia ke WC terlebih dahulu.\" Ia berkata; \"Dalam bab ini juga ada riwayat dari 'Aisyah, Abu Hurairah, Tsauban dan Abu Umamah.\" Abu Isa berkata; \"Hadits Abdullah bin Al Arqam adalah hadits hasan shahih. Seperti inilah [Malik bin Anas] dan [Yahya bin Sa'id Al Qaththan] dan tidak sedikit pula dari kalangan penghafal (ahli hadits) meriwayatkan dari [Hisyam bin Urwah] dari [ayahnya] dari [Abdullah bin Al Arqam].\" [Wuhaib] dan selainnya juga meriwayatkan dari [Hisyam bin Urwah] dari [ayahnya] dari [seorang laki-laki] dari [Abdullah bin Al Arqam]. Ini adalah pendapat tidak seorang saja dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan tabi'in. Pendapat ini juga dipegang oleh Ahmad dan Ishaq, mereka mengatakan, \"Janganlah seseorang melakukan shalat jika ia merasakan (ingin) buang air besar atau air kecil.\" Mereka berkata lagi, \"Jika ia telah berdiri shalat, ia tidak harus membatalkan shalatnya selama hal itu tidak mengganggu.\" Sebagian ahli ilmu berpendapat, \"Seseorang tidak apa-apa melaksanakan shalat dalam keadaan ingin buang air besar atau air kecil, selama hal itu tidak mengganggunya dalam shalat",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 142
			}
		}
	]
}