{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"17": "The Book on Legal Punishments (Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari ['Ashim bin Bahdalah] dari [Abu Shalih] dari [Mu'awiyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang minum khamr maka deralah ia, jika ia mengulangi keempat kalinya maka bunuhlah.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah, Asy Syarid, Syurahbil bin Aus, Jarir, Abu Ar Ramad Al Balawi dan Abdullah bin Amr. Abu Isa berkata; Hadits Mu'awiyah adalah seperti ini, [Ats Tsauri] meriwayatkan juga dari ['Ashim] dari [Abu Shalih] dari [Mu'awiyah] dari Nabi shallallahu 'alaihi wasallam. [Ibnu Juraij] dan [Ma'mar] meriwayatkan dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Ia mengatakan; Aku mendengar Muhammad mengatakan; Hadits Abu Shalih dari Mu'awiyah dari Nabi shallallahu 'alaihi wasallam dalam hal ini adalah lebih shahih daripada Hadits Abu Shalih dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam dan sesungguhnya hal ini terjadi pada awal perintah kemudian dihapus setelah itu. Demikianlah [Muhammad bin Ishaq] meriwayatkan dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang meminum khamr maka deralah ia, dan jika ia mengulangi keempat kalinya, bunuhlah ia.\" Ia melanjutkan; Kemudian didatangkan setelah itu kepada Nabi shallallahu 'alaihi wasallam seseorang yang telah meminum khamr keempat kalinya, namun beliau hanya memukul dan tidak membunuhnya. Dan demikianlah [Az Zuhri] meriwayatkan dari [Qabishah bin Dzu`aib] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini. Ia melanjutkan; Maka dihapuslah pembunuhan sebagai keringanan. Hadits ini menjadi pedoman amal menurut mayoritas ulama, tidak kami ketahui ada perselisihan di antara mereka dari banyak sisi karena beliau pernah bersabda: \"Tidak halal darah seorang muslim yang bersaksi bahwa tidak ada sesembahan yang haq selain Allah dan aku adalah utusan Allah kecuali salah satu dari tiga orang; Jiwa dibalas dengan jiwa (orang yang membunuh orang lain), orang tua yang berzina, dan orang meninggalkan agamanya",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 27
			}
		}
	]
}