{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"17": "The Book on Legal Punishments (Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam memotong tangan dalam pencurian tameng besi senilai tiga dirham. Ia mengatakan; Dalam hal ini ada hadits serupa dari Sa'd, Abdullah bin Amr, Ibnu Abbas, Abu Hurairah dan Aiman. Abu Isa berkata; Hadits Ibnu Umar adalah hadits hasan shahih dan menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam di antaranya; Abu Bakr Ash Shiddiq memotong tangan dalam pencurian lima dirham, dan diriwayatkan dari Utsman dan Ali bahwa keduanya pernah memotong tangan dalam pencurian seperempat dinar dan diriwayatkan juga dari Abu Hurairah dan Abu Sa'id bahwa keduanya berkata; Tangan boleh dipotong dalam penduciran lima dirham. Hadits ini menjadi pedoman amal menurut sebagian fuqaha tabi'in, ini menjadi pendapat Malik bin Anas, Asy Syafi'i, Ahmad dan Ishaq, mereka membolehkan memotong tangan dalam pencurian seperempat dinar atau lebih. Telah diriwayatkan juga dari Ibnu Mas'ud bahwa ia berkata; Tidak dipotong tangan kecuali mencapai satu dinar atau sepuluh dirham. Ini adalah hadits mursal, Al Qasim bin Abdurrahman meriwayatkannya dari Ibnu Mas'ud padahal Al Qasim tidak mendengar dari Ibnu Mas'ud. Hadits ini menjadi pedoman amal menurut sebagian ulama, ini menjadi pendapat Sufyan Ats Tsauri dan ulama Kufah, mereka berpendapat; Tidak ada potong tangan kurang dari sepuluh dirham dan sanadnya tidak bersambung",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 29
			}
		}
	]
}