{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"17": "The Book on Legal Punishments (Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yahya An Naisaburi], telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Isra`il], telah menceritakan kepada kami [Simak bin Harb] dari ['Alqamah bin Wa`il Al Kindi] dari [ayahnya] bahwa pada zaman Rasulullah shallallahu 'alaihi wasallam ada seorang wanita yang keluar hendak melakukan shalat, ia bertemu dengan seseorang laki-laki, lalu laki-laki itu menghadang dan memperkosanya. Wanita itu pun berteriak dan laki-laki itu pergi. Kemudian ada seseorang yang melintasinya, wanita itu berkata; Sesungguhnya orang itu telah melakukan begini dan begini kepadaku. Melintas juga sekumpulan orang-orang Muhajirin, wanita itu berkata; Sesungguhnya orang itu telah melakukan begini dan begini kepadaku. Maka mereka beranjak pergi untuk menangkap orang yang dituduh telah memperkosanya, mereka mendatangkan kepadanya, wanita itu berkata; Benar, ini orangnya. Mereka pun mendatangkannya kepada Rasulullah shallallahu 'alaihi wasallam, ketika beliau memerintahkan agar ia dirajam, teman orang yang memerkosa wanita itu berdiri seraya berkata; Wahai Rasulullah, aku adalah temannya. Beliau mengatakan kepada wanita itu: \"Pergilah engkau, Allah telah mengampunimu.\" Beliau berbicara kepada temannya itu dengan perkataan yang baik dan beliau mengatakan kepada orang yang telah menggaulinya: \"Rajamlah ia.\" Beliau bersabda: \"Sungguh, ia telah bertaubat dengan taubat yang sekiranya seluruh penduduk Madinah bertaubat, niscaya dapat mengimbanginya.\" Abu Isa berkata; Hadits ini hasan gharib shahih. 'Alqamah bin Wa`il bin Hujr mendengar dari ayahnya, ia lebih tua dari Abdul Jabbar bin Wa`il sedangkan Abdul Jabbar tidak mendengar dari ayahnya",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 37
			}
		}
	]
}