{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"19": "The Book on Sacrifices"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "Telah menceritakan kepada kami [Al hasan bin Ali Al Hulwani] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Syarik bin Abdullah] dari [Abu Ishaq] dari [Syuraih bin An Nu'man Ash Sha`idi dan dia adalah orang? Hamdan] dari [Ali bin Abu Thalib] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk memperhatikan baiknya mata dan telinga (hewan kurban). Beliau juga melarang kami untuk berkurban dengan hewan yang cacat telinga bagian depannya, dan tidak pula cacat telinga bagian belakangnya, tidak yang terbelah terbalah daun telinganya dan tidak pula yang terdapat lubang bundar pada daun telinganya.\" Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Ubaidullah bin Musa] berkata, telah mengabarkan kepada kami [Isra'il] dari [Abu Ishaq] dari [Syuraih bin Nu'man] dari [Ali] dari Nabi shallallahu 'alaihi wasallam, seperti hadits tersebut. Ia menambahkan, Ali berkata; \"Muqabalah adalah hewan yang terpotong pada sisi ujungnya, Mudabarah hewan yang terpotong pada sisi telinganya, Syarqa` hewan yang telinganya terbelah; dan Kharqa hewan yang telinganya berlubang.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih. Dan Syuraih bin An Nu'man Ash Sha`idi berasal dari Kufah, dan termasuk dari sahabat Ali. Syuraih bin Hani juga dari Kufah, bapaknya termasuk sahabat Ali. Syuraih Ibnul Harits Al Kindi Abu Umayyah Al Qadhi telah meriwayatkan dari Ali, mereka semua masih sahabat Ali yang hidup dalam satu masa. Perkataan Ali 'memperhatikan baiknya' maksudnya adalah memperhatikan kesehatan hewan kurban",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		}
	]
}