{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"20": "The Book on Vows and Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah lalu mengucapkan 'Insyaallah', maka ia tidak berdosa (jika tidak terlaksana).\" Abu Isa berkata; \"Aku pernah bertanya kepada Muhammad bin Isma'il tentang hadits ini, ia lalu berkata, \"Ini adalah hadits yang keliru, Abdurrazaq telah melakukan kekeliruan di dalamnya. Ia meringkasnya dari hadits Ma'mar, dari Ibnu Thawus, dari bapaknya, dari Abu Hurairah, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sulaiman bin Dawud pernah mengatakan, 'Sungguh, aku akan menggilir tujuh puluh wanita dalam semalam, niscaya setiap dari mereka akan melahirkan seorang anak laki-laki'. Lalu ia menggilir mereka dan tidak ada seorang pun dari mereka yang melahirkan, kecuali seorang wanita yang melahirkan anak setengah laki-laki (cacat).\" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Sekiranya Sulaiman mengucapkan 'Insyaallah', sungguh ia akan mendapatkan sebagaimana yang ia katakan.\" Demikianlah hadits ini diriwayatkan dari Abdurrazaq dari Ma'mar, dari Ibnu Thawus, dari bapaknya secara lengkap. Beliau mengatakan, \"Tujuh puluh wanita.\" Hadits ini diriwayatkan dari jalur yang banyak dari Abu Hurairah, dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sulaiman bin Dawud berkata, 'Sungguh, aku akan menggilir seratus wanita dalam satu malam",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		}
	]
}