{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"21": "The Book on Military Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Pada perang Ahzab Sa'd bin Mu'adz terkena anak panah hingga memutus urat nadi lengannya bagian luar, atau bagian dalam. Maka Rasulullah shallallahu 'alaihi wasallam menempelkan besi panas agar darahnya berhenti, tetapi tangannya justru membengkak dan mengeluarkan banyak darah. Rasulullah shallallahu 'alaihi wasallam kembali menempelkan besi panas agar darahnya berhenti. Ketika Sa'd melihat darahnya banyak keluar, ia pun berdoa, \"Ya Allah, janganlah engkau matikan aku hingga mataku menjadi sejuk dari (kekalahan) bani Quraizhah.\" Seketika itu urat nadinya berhenti dan tidak mengeluarkan setetes darah pun, hingga mereka (Bani Quraizhah) menyerahkan hukuman kepada keputusan Sa'd bin Mu'adz. Nabi pun mengutus seseorang menemui Sa'd. Saad putuskan agar tawanan laki-laki dibunuh sedang kaum perempuan dibiarkan hidup, dengan harapan kaum muslimin sewaktu-waktu membutuhkan pertolongannya. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Engkau telah memberlakukan mereka sesuai dengan hukum Allah.\" Jumlah mereka waktu itu adalah empat ratus orang, ketika selesai membunuh orang-orang kafir itu, urat nadi Sa'd kembali mengeluarkan darah hingga ia pun meninggal.\" Ia berkata, \"Dalam bab ini juga ada hadits dari Abu Sa'id dan Athiyah Al Qurazhi.\" Abu Isa berkata, \"Ini adalah hadits shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 44
			}
		}
	]
}