{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 17,
			"arabicnumber": 17,
			"text": "telah menceritakan kepada kami [Hannad] dan [Qutaibah] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Isra'il] dari [Abu Ishaq] dari [Abu Ubaidah] dari [Abdullah] ia berkata, Nabi Shallahu 'alaihi wa Sallam keluar untuk buang hajat, beliau lalu bersabda: \" Carikanlah tiga buah batu untukku, \" Abu Ubaid berkata; \"Maka aku pun membawakan beliau dua batu dan satu kotoran binatang yang telah kering, beliau hanya mengambil dua batu dan melemparkan kotoran binatang tersebut kemudian bersabda: \"Sesungguhnya kotoran binatang itu najis.\" Abu Isa berkata; \"Seperti inilah [Qais bin Ar Rabi'] meriwayatkan hadits ini dari [Abu Ishaq], dari [Abu Ubaidah], dari [Abdullah] sebagaimana hadits riwayat Israil. [Ma'mar] dan ['Ammar bin Ruzaiq] juga meriwayatkan dari [Abu Ishaq], dari [Alqamah], dari [Abdullah]. [Zuhair] meriwayatkan dari [Abu Ishaq], dari [Abdurrahman Ibnul Aswad], dari bapaknya - [Al Aswad bin Yazid] -, dari [Abdullah]. Namun hadits ini ada kekacauan di dalamnya. Telah menceritakan kepada kami Muhammad bin Basysyar Al Abdi berkata, telah menceritakan kepada kami Muhammad bin Ja'far berkata, telah menceritakan kepada kami Syu'bah dari 'Amru bin Murrah ia berkata; \"Apakah engkau mengingat sesuatu dari Abdullah?\" ia menjawab, \"Tidak.\" Abu Isa berkata; \"Aku bertanya kepada Abdullah bin Abdurrahman; riwayat manakah yang paling shahih dalam hadits Abu Ishaq ini?\" namun ia tidak menjawab dengan sesuatu pun. Dan aku juga bertanya kepada Muhammad, namun ia juga tidak memberikan menjawab apapun.\" Seakan-akan ia melihat bahwa hadits Zuhair dari Abu Ishaq, dari Abdurrahman Ibnul Aswad, dari bapaknya, dari Abdullah mempunyai kemiripan, lalu ia meletakkannya dalam kitab Al Jami'.\" Abu Isa berkata; \"Dalam bab ini menurutku yang paling shahih adalah hadits Israil dan Qais dari Abu Ishaq, dari Abu Ubaidah, dari Abdullah. Sebab Israil adalah seorang yang lebih kuat dan hafal dengan hadits Abu Ishaq dari yang lainnya. Hal itu diperkuat oleh Qais bin Ar Rabi'.\" Abu Isa berkata; \"Aku mendengar Abu Musa Muhammad Ibnul Mutsanna berkata; aku mendengar Abdurrahman bin Mahdi berkata; \"Tidaklah hilang dariku sebagaimana hilang dariku dari hadits Sufyan Ats Tsauri, dari Abu Ishaq kecuali sesuatu yang aku pegang atas Israil, karena ia meriwayatkan dengan sesuatu yang lebih sempurna.\" Abu Isa berkata; \"Riwayat Zuhair dari Abu Ishaq tidaklah demikian, karena ia mendengarnya disaat-saat akhir.\" Ia berkata; \"Aku mendengar Ahmad Ibnul Hasan At Turmudzi berkata; \"Aku mendengar Ahmad bin Hanbal mengatakan; \"Apabila engkau mendengar hadits dari Za`idah dan Zuhair maka mantaplah, meskipun engkau tidak mendengarnya dari yang lain, kecuali hadits dari Abu Ishaq, sedang Abu Ishaq namanya adalah 'Amru bin Abdullah As Sabi'i Al Hamdani, dan Abu Ubaidah bin Abdullah bin Mas'ud tidak mendengar dari bapaknya, dan namanya juga tidak dikenal",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 17
			}
		}
	]
}