{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"24": "The Book on Clothing"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "Telah menceritakan kepadaku [Yahya bin Musa], telah menceritakan kepadaku [Sa'id bin Muhammad Al Warraq] dan [Abu Yahya Al Himmani] keduanya berkata, Telah menceritakan kepadaku [Shalih bin Hassan] dari [Urwah] dari ['Aisyah] radliallahu 'anha berkata; Rasulullah shallallahu 'alaihi wasallam pernah bersabda kepadaku: \"Jika engkau ingin bersamaku (atau sederajat denganku) di surga, maka ambillah bekal dari dunia seperti bekalnya seorang musafir dan janganlah engkau bergaul dengan orang-orang kaya serta janganlah menganggap bajumu sudah lusuh (robek yaitu tidak layak pakai) sebelum engkau menambalnya.\" Abu Isa berkata; Ini merupakan hadits Gharib yang tidak kami ketahui kecuali dari haditnya Shalih bin Hassan. Dan aku mendengar Muhammad berkata, \"Shalih bin Hassan seorang munkarul hadits adapun Shalih bin Abi Hassan yang mana Ibnu Abi Dzuaib meriwayatkan darinya ialah seorang yang tsiqqah.\" Abu Isa berkata; Dan arti dari sabda Nabi shallallahu 'alaihi wasallam \"Dan janganlah kamu bergaul dengan orang-orang kaya\". Ialah sebagaimana dalam riwayatnya Abu Hurairah Rhadliyallahu 'Anhu dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Barang siapa yang melihat orang yang dilebihkan darinya dari segi rupa dan rezeki, maka hendaknya dia melihat orang yang lebih kurang darinya atas nikmat yang dilebihkan atasnya (baik dari segi rupa atau rezeki), karena hal itu akan mendorongnya untuk selalu mensyukuri nikmat Allah yang telah dikaruniakan kepadanya.\" Diriwayatkan dari 'Aun bin Abdullah berkata; \"Aku telah bergaul dengan orang-orang kaya, maka aku tidak melihat ada orang yang lebih memiliki kemauan dari pada aku, bersama mereka aku melihat ada onta yang lebih bagus dari ontaku dan aku melihat baju yang lebih bagus dari bajuku. Lantas aku bergaul dengan para faqir dan hatiku menjadi tenang",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 68
			}
		}
	]
}