{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"25": "The Book on Food"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi] dan [Abu Ammar] keduanya berkata, Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Ubaidullah] dari [Ibnu Abbas] dari [Maimunah] ia berkata; Bahwa ada seekor tikus yang terjatus di atas mentega hingga mati, lalu hal itu pun ditanyakan kepada Nabi shallallahu 'alaihi wasallam, maka beliau pun bersabda: \"Buanglah tikus itu beserta mentega yang ada di sekelilingnya dan makanlah sisanya.\" Di dalam bab ini, juga terdapat riwayat dari Abu Hurairah. Abu Isa berkata; Ini adalah hadits Hasan Shahih. Dan hadits ini juga telah diriwayatkan dari Az Zuhri dari Ubaidullah dari Ibnu Abbas bahwasanya Nabi shallallahu 'alaihi wasallam pernah ditanya. Namun mereka tidak menyebutkan di dalamnya, \"Dari Maimunah.\" Haditsnya Ibnu Abbas dari Maimunah adalah lebih shahih. [Ma'mar] telah meriwayatkan dari [Az Zuhri], dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam semisalnya, namun hadits tersebut adalah hadits ghairu mahfuzh (tidak terjaga). Ia berkata; Dan saya mendengar Muhammad bin Isma'il berkata; Haditsnya Ma'mar dari Zuhri dari Sa'id bin Al Musayyab dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam. Kemudian ia menyebutkan di dalamnya; Bahwa beliau ditanya tentangnya (yakni tikus yang terjatuh dalam mentega), maka beliau bersabda: \"Jika menteganya kering, maka buanglah tikusnya serta mentega yang berada di sekelilingnya. Namun jika mentegasah basah berair, maka janganlah kalian mendekatinya.\" Ini adalah salah. Ma'mar telah berbuat kesalahan di dalamnya. Yang Shahih adalah haditsnya Az Zuhri dari Ubaidullah dari Ibnu Abbas dari Maimunah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		}
	]
}