{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 182,
			"arabicnumber": 182,
			"text": "telah menceritakan kepada kami [Hannad] berkata; telah menceritakan kepada kami [Abdah] dari [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samrah bin Jundab] dari Nabi shallallahu 'alaihi wasallam, bahwasanya beliau bersabda: \"Shalat wustha adalah shalat asar.\" Ia berkata; \"Dalam bab ini juga ada riwayat dari Ali, Abdullah bin Mas'ud, Zaid bin Tsabit, 'Aisyah, Hafshah, Abu Hurairah dan Abu Hasyim bin Utbah.\" Abu Isa berkata; \"Muhammad berkata; \"Ali bin Abdullah mengatakan bahwa hadits Samrah bin Jundab derajatnya hasan shahih, dan ia telah mendengar darinya.\" Abu Isa berkata; \"Hadits Samrah tentang shalat wustha adalah shalat asar, derajatnya hasan shahih. Ini adalah pendapat yang diambil oleh sebagian besar ahli ilmu dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka.\" Zaid bin Tsabit dan 'Aisyah mengatakan, \"Shalat wustha adalah shalat zhuhur.\" Sedangkan Ibnu Abbas dan Ibnu Umar mengatakan, \"Shalat wustha adalah shalat subuh.\" Telah menceritakan kepada kami Abu Musa Muhammad bin Al Mutsanna berkata; telah menceritakan kepada kami Quraisy bin Anas dari Habib Ibnu Asy Syahid ia berkata; \"Muhammad bin Sirin berkata; \"Bertanyalah kepada Al Hasan dari siapa ia mendengar hadits tentang Aqiqah?\" maka aku pun bertanya kepadanya, lalu ia menjawab, \"Aku mendengarnya dari Samrah bin Jundab.\" Abu Isa berkata; \"Telah menceritakan kepada kami Muhammad bin Isma'il berkata; telah menceritakan kepada kami Ali bin Abdullah bin Al Madini dari Quraisy bin Anas dengan hadits ini.\" Muhammad berkata; \"Ali berkata; \"Mendengarnya Al Hasan dari Samrah adalah benar, dan ia berdasar dengan hadits ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 34
			}
		}
	]
}