{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 189,
			"arabicnumber": 189,
			"text": "telah menceritakan kepada kami [Sa'id bin Yahya bin Sa'id Al Umawi] berkata; telah menceritakan kepada kami [ayahku] berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim Al Harits At Taimi] dari [Muhammad bin Abdullah bin Zaid] dari [Ayahnya] ia berkata; \"Pada suatu pagi kami mendatangi Rasulullah shallallahu 'alaihi wasallam, aku lalu mengabarkan kepadanya perihal mimpi yang aku alami, beliau lalu bersabda: \"Ini mimpi yang benar, maka berdirilah bersama Bilal, karena suaranya lebih lantang dan panjang daripada kamu, sampaikanlah padanya apa yang dikatakan padamu (impikan), suruhlah agar ia menyeru dengannya.\" Abdullah bin Zaid berkata; \"Ketika Umar bin Al Khaththab mendengar seruan Bilal, maka ia pun keluar menemui Rasulullah shallallahu 'alaihi wasallam seraya menjinjing kain sarungnya, ia lantas berkata; \"Wahai Rasulullah, demi Dzat yang mengutusmu dengan kebenaran, aku juga telah mengimpikan sebagaimana yang ia serukan.\" Abdullah bin Zaid berkata; \"Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Milik Allah lah segala pujian, maka itu akan lebih menguatkan lagi.\" Ia berkata; \"Dalam bab ini juga ada riwayat dari Ibnu Umar.\" Abu Isa berkata; \"Hadits Abdullah bin Zaid ini derajatnya hasan shahih. [Ibrahim bin Sa'd] telah meriwayatkan hadits ini dari [Muhammad bin Ishaq] dengan lafadz yang lebih sempurna dan lebih panjang. Disebutkan dalam hadits tersebut bahwa adzan dua kali-dua kali, sedangkan iqamah dengan satu kali-satu kali.\" Abdullah bin Zaid adalah Ibnu Abdu Rabbih, dan disebut juga dengan Ibnu Abdu Rabbi. Dan kami tidak pernah mengetahui hadits shahih darinya yang diriwayatkan dari Nabi shallallahu 'alaihi wasallam selain hadits yang berkenaan dengan adzan ini. sedangkan Abdullah bin Zaid bin 'Ashim Al Mazini, ia mempunyai beberapa hadits yang diriwayatkan dari Nabi shallallahu 'alaihi wasallam. Ia adalah paman Abbad bin Tamim",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		}
	]
}