{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 198,
			"arabicnumber": 198,
			"text": "telah menceritakan kepada kami [Ahmad bin Mani'] berkata; telah menceritakan kepada kami [Abu Ahmad Az Zubair] berkata; telah menceritakan kepada kami [Abu Isra`il] dari [Al Hakam] dari [Abdurrahman bin Abu Laila] dari [Bilal] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali kamu melakukan tastwib (menguap) pada waktu-waktu shalat kecuali dalam shalat subuh.\" Ia berkata; \"Dalam bab ini juga ada riwayat dari Abu Mahdlurah.\" Abu Isa berkata; \"Kami tidak mengetahui hadits Bilal kecuali dari Abu Isra'il Al Mula'I, dan Abu Isma'il belum pernah mendengar hadits ini dari Al Hakam bin Utaibah.\" Ia berkata; \"Hanyasanya ia meriwayatkan hadits ini dari Al Hasan bin Umarah, dari Al Hakam bin Utaibah. Dan Abu Isma'il namanya adalah Isma'il bin Abu Ishaq. Namun menurut ahli hadits ia bukan seorang yang kuat.\" Para ulama berselisih dalam menafsirkan lafadz tatswib, sebagian dari mereka mengatakan bahwa tastwid adalah, seseorang mengucapkan dalam adzan shalat subuh ASH SHALATU KHAIRUN MINAN NAUM (shalat lebih baik daripada tidur). Ini adalah pendapat yang diambil oleh bin Al Mubarak dan Ahmad. Sedangkan Ishaq punya pendapat lain dalam hal tatswib, ia berkata; \"Tatswib yang dibenci adalah sesuatu yang diada-adakan oleh manusia setelah Nabi shallallahu 'alaihi wasallam, jika mu'adzin melakukan adzan kemudian orang-orang bermalas-malas dalam memenuhinya, ia mengucapkan antara adzan dan iqamah; QAD QAAMATISH SHALAT - HAYYA 'ALA ASH SHALAT - HAYYA 'ALAL FALAH (shalat telah didirikan, mari menegakkan shalat, mari menuju kemenangan).\" Ia berkata; \"Apa yang dikatakan oleh Ishaq ini adalah model tatswib yang diada-adakan setelah Nabi shallallahu 'alaihi wasallam dan dibenci oleh para ahli ilmu.\" Yang ditafsirkan oleh bin Al Mubarak dan Ahmad bahwa tatswib itu adalah ucapan seorang mu'adzin pada adzan subuh; ASH SHALATU KHAIRUN MINAN NAUM (shalat itu lebih baik daripada tidur).\" Ini adalah pendapat yang benar. Itulah yang disebut dengan tatswid sebagaimana yang diambil dan dipilih oleh ahli ilmu. Diriwayatkan dari Ibnu Umar bahwa dalam adzan shalat subuh ia mengucapkan; ASH SHALATU KHAIRUN MINAN NAUM (shalat itu lebih baik daripada tidur). Diriwayatkan dari Mujahid bahwa ia berkata; \"Aku bersama Abdullah bin Umar masuk ke dalam masjid ketika adzan telah dikumandangkan, namun mu'adzin mengucapkan tatswib. Maka Abdullah bin Umar pun keluar dari masjid dan berkata; \"Ikutlah keluar bersamaku dari sisi tukang bid'ah ini!\" dan ia tidak jadi melaksanakan shalat di dalamnya.\" Ia berkata; \"Hanyasanya tatswid yang dibenci oleh Abdullah adalah (tatswib) yang diada-adakan oleh manusia",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 50
			}
		}
	]
}