{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] berkata, telah menceritakan kepada kami [Ma'n bin Isa Al Qazzaz] berkata, telah menceritakan kepada kami [Malik bin Anas]. Dari jalur yang lain; dan telah menceritakan kepada kami [Qutaibah] dari [Malik] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] ia berkata, Rasulullah Shallahu 'alaihi wa Sallam bersabda: \" Jika seorang muslim, atau seorang mukmin berwudlu, lalu ia membasuh wajahnya, maka dosa-dosa yang berada di wajahnya karena pandangan mata akan keluar bersama air, atau bersama tetesan air yang terakhir, atau yang semisal itu. Jika ia membasuh tangan, maka dosa-dosa dari tangannya akan keluar bersama air, atau bersama tetesan air yang terakhir hingga ia keluar tanpa dosa sedikitpun.\" Abu Isa berkata; \"Ini adalah hadits hasan shahih, yaitu hadits riwayat Malik dari Suhail dari bapaknya dari Abu Hurairah dan Abu Shalih, ayah Suhail, yaitu Abu Shalih As Samman, dan namanya adalah Dzakwan. Abu Hurairah sendiri masih diperselisihkan tentang namanya; sebagian mengatakan Abdu Syamsi, sebagian mengatakan Abdullah bin 'Amru dan seperti inilah, Muhammad bin Isma'il berkata; \"Itu yang paling benar.\" Abu Isa berkata; dalam bab ini juga ada riwayat dari Utsman bin 'Affan, Tsauban, Ash Shunabihi, Umar bin Abasah, Salman, Abdullah bin 'Amru, dan Ash Shunabihi yang meriwayatkan dari Abu Bakar Ash Shiddiq, namun ia tidak mendengar langsung dari Rasulullah Shallahu 'alaihi wa Sallam. Namanya adalah Abdurrahman bin Usailah, sedang julukannya Abu Abdullah, ia melakukan perjalanan untuk menemui Rasulullah Shallahu 'alaihi wa Sallam, sedangkan Nabi Shallahu 'alaihi wa Sallam sendiri telah wafat ketika ia masih dalam perjalanan. Ia telah meriwayatkan beberapa hadits dari Nabi Shallahu 'alaihi wa Sallam. Ash Shunabi Ibnul A'sar Al Ahmasi adalah seorang sahabat Nabi Shallahu 'alaihi wa Sallam, ia disebut juga dengan nama Ash Shunabihi. Hadits yang ia riwayatkan adalah; ia berkata; aku mendengar Nabi Shallahu 'alaihi wa Sallam bersabda: \"Sesungguhnya aku akan berbanyak-banyakkan umat, maka jangan sekali-kali kalian saling membunuh setelahku",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		}
	]
}