{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"28": "Chapters on Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2063,
			"arabicnumber": 2063,
			"text": "Telah menceritakn kepada kami [Hannad], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ja'far bin Iyas] dari [Abu Nadlrah] dari [Sa'id bin Al Khudri] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengutusku dalam suatu Sariyyah. Kemudian kami singgah pada suatu kaum dan meminta untuk dijamu, namun mereka tidak mau memberikan jamuan. Lalu pemimpin mereka terkena sengatan, maka kami pun segera mendatanginya. Mereka bertanya, \"Apakah diantara kalian ada yang bisa meruqyah dari sengatan kalajengking?\" Aku berkata, \"Ya, sayalah orangnya. Namun saya tidak akan meruqyah hingga kalian member seekor kambing untuk kami.\" Ia berkata, \"Aku akan memberikan tiga ekor kambing untuk kalian.\" Maka kami pun menyetujuinya, dan aku mulai meruqyah dengan membacakan, \"AL HAMDULILLAH\" sebanyak tujuh kali, hingga ia siuman dan kami pun langsung mengambil kambing tersebut. Namun di dalam hati kami timbul semacam keraguan akan tiga ekor kambing tersebut. Maka kami pun berkata, \"Janganlah kalian tergesa-gesa untuk memakannya, hingga kalian menemui Rasulullah shallallahu 'alaihi wasallam.\" Saat menemui Rasulullah shallallahu 'alaihi wasallam, maka aku langsung menceritakan apa yang telah aku perbuat. Kemudian beliau bersabda: \"Tidakkah kamu ketahui ia ia adalah benar-benar ruqyah? Ambillah kambing itu, dan berikanlah aku bagian darinya.\" Abu Isa berkata; Ini adalah hadits hasan. Abu Nadlrah namanya adalah Al Mundzir bin Malik bin Qutha'ah. Asy Syafi'i membolehkan bagi seorang mu'allim untuk mengambil upah atas pengajaran Al Qur`annya. Dan menurutnya, ia boleh memberikan persyaratan seperti itu dan ia berdalih dengan hadits ini. Ja'far bin Iyas adalah Ja'far bin Abu Wahsyiyyah yakni Abu Bisyr. [Syu'bah] dan [Abu 'Awanah] serta lebih dari satu orang perawi telah meriwayatkan hadits ini dari [Abu Al Mutawakkal] dari [Abu Sa'id]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 28
			}
		}
	]
}