{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"30": "Chapters On Wasaya (Wills and Testament)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2116,
			"arabicnumber": 2116,
			"text": "Telah menceritakan kepada kami [Ibnu Abu 'Umar]; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Amir bin Sa'd bin Abu Waqqash] dari [bapaknya] dia berkata; Pada tahun Fathu Makkah, aku tertimpa sakit dan aku merasa akan mengalami kematian. Kemudian Rasulullah shallallahu 'alaihi wasallam pun menjengukku, maka aku pun berkata pada beliau, \"Wahai Rasulullah, sesungguhnya aku memiliki harta yang banyak, sedangkan tidak ada orang yang akan mewarisiku kecuali anak perempuanku seorang diri. Apakah aku harus berwasiat dengan hartaku seluruhnya?\" beliau menjawab: \"Tidak.\" Aku berkata, \"Atau duapertiga darinya?\" Beliau menjawab: \"Tidak.\" Aku berkata lagi, \"Atau setengahnya?\" beliau menjawab: \"Tidak.\" Aku berkata lagi, \"Kalau begitu, sepertiga darinya?\" Akhirnya beliau bersabda: \"Sepertiga. Namun, sepertiga adalah jumlah yang banyak. Sesungguhnya, bila kamu meninggalkan ahli warismu dalam keadaan berkecukupan adalah lebih baik daripada kamu meninggalkan mereka dalam keadaan fakir dan meminta-minta kepada manusia. Dan tidaklah kamu menginfakkan sesuatu pun, kecuali kamu akan diberi ganjaran pahala, hingga sesuap makanan yang kamu suapkan pada mulut isterimu.\" Lalu aku bertanya, \"Wahai Rasulullah, apakah aku telah ditinggalkan dari hijrahku?\" Beliau menjawab: \"Sesungguhnya, kamu tidak akan ditinggalkan setelahku, sehingga kamu mengerjakan amalan yang dengannya kamu mengharap wajah Allah, sehingga membuat derajatmu (di sisi-Nya) semakin tinggi. Dan semoga sepeninggalmu setelahku nanti, orang-orang dapat mengambil manfaat darimu, dan yang lain mendapat kecelakaan. Ya Allah, terimalah hijrah para sahabatku, dan janganlah Engkau tolak akan kesudahan mereka.\" Akan tetapi Al Ba`is Sa'd bin Khaulah, Rasulullah shallallahu 'alaihi wasallam telah mewarisinya, agar ia dapat meninggal di Makkah. Abu Isa berkata; Hadits semakna juga diriwayatkan dari Ibnu Abbas. Ini adalah hadits Hasan Shahih. Dan hadits ini telah diriwayatkan pula oleh lebih dari satu orang perawi dari Sa'd bin Abu Waqhas. Menurut Ahli imu, hadits ini diamalkan, yakni, seorang laki-laki tidak boleh mewasiatkan lebih dari sepertiga hartanya. Sedangkan sebagian ulama, adalah suatu hal yang Mustahab (sunnah) bila wasiat kurang dari sepertiga, berdasarkan Sabda Rasulullah shallallahu 'alaihi wasallam: \"Dan sepertiga itu, merupakan jumlah yang banyak",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 1
			}
		}
	]
}