{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"31": "Chapters On Wala' And Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2127,
			"arabicnumber": 2127,
			"text": "Telah menceritakan kepada kami [Hannad]; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim At Taimi] dari [bapaknya] dia berkata; [Ali] pernah menyampaikan khuthbah kepada kami seraya berkata, \"Barangsiapa yang menyangka, bahwa kami memiliki sesuatu yang kami baca kecuali Kitabullah (Al Qur`an) dan di dalam Shahifah ini gigi unta, atau pun sesuatu dari batu-batu, maka sungguh ia telah berdusta.\" Dan di dalam khuthbahnya, ia juga berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kota Madinah adalah haram (suci), yakni daerah antara 'Air dan Tsaur. Maka barangsiapa yang berbuat kejahatan di dalamnya, atau berniat hendak melakukan kejahatan di dalamnya, niscaya laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa atasnya. Allah tidak akan menerima darinya, baik itu amalan wajib atau pun amalan sunnahnya. Dan barangisapa yang bernasab kepada selain bapaknya, atau berwali kepada selain walinya, maka laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa atasnya, tidak akan diterima lagi darinya, baik itu amalan wajib atau pun amalan sunnahnya. Dzimmah kaum muslimin adalah satu. Dan akan lebih tinggi lagi, orang-orang yang paling rendah dari mereka.\" Abu Isa berkata; Sebagian mereka meriwayatkan dari [Al A'masy] dari [Ibrahim At Tamimi], dari [Al Harits bin Suwaid], dari [Ali] dengan hadits semisalnya. Abu Isa berkata; Ini adalah hadits hasan shahih. Dan telah pula diriwayatkan lebih dari satu jalur dari Ali dari Nabi shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		}
	]
}