{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2165,
			"arabicnumber": 2165,
			"text": "Telah menceritakan kepada kami [Ahmad bin Mani']; telah menceritakan kepada kami [An Nadhr bin Isma'il Abul Mughirah] dari [Muhammad bin Suqah] dari ['Abdullah bin Dinar] dari [Ibnu 'Umar] dia berkata; Suatu ketika Umar menyampaikan pidato kepada kami di Jabiyyah. [Umar] berkata, \"Wahai sekalian manusia, aku berdiri di tengah-tengah kalian sebagaimana posisi Rasulullah shallallahu 'alaihi wasallam yang ketika itu juga berdiri di tengah-tengah kami dan bersabda: 'Aku berwasiat kepada kalian dengan (melalui) para sahabat-sahabatku kemudian orang-orang setelah mereka dan orang-orang yang datang lagi setelah mereka. Kemudian merajalelalah kedustaan. Hingga seseorang bersumpah tanpa ia diminta untuk bersumpah, kemudian seseorang memberi kesaksian padahal ia tidak diminta untuk menjadi saksi. Sungguh, tidaklah seorang laki-laki berduaan dengan seorang wanita, kecuali pihak ketiganya adalah setan. Hendaklah kalian selalu bersama Al Jama'ah. Dan janganlah kalian berpecah belah, karena setan itu selalu bersama dengan orang yang sendirian, sedangkan terhadap dua orang, ia lebih jauh. Barangsiapa yang menginginkan Buhbuhata Al Jannah, maka hendaklah ia komitmen untuk menetapi Al Jama'ah. Barangsiapa kebaikannya yang ia lakukan membuatnya lapang dan bahagia, dan keburukannya membuatnya penat dan susah, maka dia adalah seorang mukmin.'\" Abu Isa berkata; Ini adalah hadits hasan shahih gharib bila ditinjau dari jalur ini. Dan hadits ini telah diriwayatkan pula oleh [Ibnul Mubarak] dari [Muhammad bin Suqah]. Dan telah diriwayatkan pula lebih dari satu jalur dari Umar dari Nabi shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 8
			}
		}
	]
}