{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2187,
			"arabicnumber": 2187,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi] dan [Abu Bakar bin Nafi'] serta lainnya, mereka berkata: telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Urwah bin Az Zubair] dari [Zainab binti Abu Salamah] dari [Habibah] dari [Ummu Habibah] dari [Zainab binti Jahsy] berkata: Rasulullah Shallallahu 'alaihi wa Salam bangun tidur 'Aisyah wajah memerah, beliau mengucapkan: LAA ILAAHA ILLALLAAH, beliau mengulanginya tiga kali, celakalah bagi bangsa arab karena keburukan yang telah mendekat, saat ini penghalang Ya'juj dan Ma'juj telah dibuka seperti ini -beliau memperagakan jarinya dengan membentuk angka sepuluh--. Berkata Zainab: Aku bertanya: Apakah kami akan binasa padahal di tengah-tengah kami ada orang-orang Shalih? Rasulullah Shallallahu 'alaihi wa Salam menjawab: \"Ya, bila kekejian kian banyak.\" Berkata Abu Isa: Hadits ini hasan shahih dan Sufyan memperindah hadits ini. seperti itulah [Al Humaidi], ['Ali bin Al Madini] dan yang lainnya dari para hafidz meriwayatkan dari [Sufyan bin 'Uyainah] seperti ini. berkata Al Humaidi: Berkata Sufyan bin 'Uyainah: Aku menghafal dari Az Zuhri dalam hadits ini ada empat wanita; Zainab binti Abu Salamah dari Habibah, keduanya adalah putri rabibah nabi Shallallahu 'alaihi wa Salam dari Ummu Habibah dari Zainab binti Jahsy, keduanya adalah istri nabi Shallallahu 'alaihi wa Salam. Seperti itulah [Ma'mar] dan lainnya meriwayatkan hadits ini dari [Az Zuhri] tapi mereka tidak menyebut: Dari Habibah dan sebagaian sahabat Ibnu 'Uyainah meriwayatkan hadits ini dari Ibnu 'Uyainah dan mereka tidak menyebutkan: Dari Ummu Habibah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 30
			}
		}
	]
}