{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "Telah menceritakan kepada kami ['Imran bin Musa Al Qazzaz Al Bashri] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami ['Ali bin Zaid bin Jud'an Al Qurasy] dari [Abu Nadlrah] dari [Abu Sa'id Al Khudri] berkata: Rasulullah Shallallahu 'alaihi wa Salam shalat ashar bersama kami pada suatu hari setelah itu beliau berkhotbah, beliau tidak meninggalkan apa pun yang ada dihadapan hari kiamat melainkan beliau pasti memberitahukannya kepada kami, siapa yang hafal musti hafal dan siapa yang lupa pasti melupakannya. Diantara yang beliau sampaikan: \" dunia manis dan hijau dan Allah akan menjadikan kalian sebagai pemimpinnya lalu Ia akan memperhatikan apa yang kalian lakukan, ingat, takutlah pada dunia, takutlah pada wanita.\" Diantara yang beliau sampaikan: \"Ingat, jangan sampai rasa segan pada manusia menghalangi seseorang untuk menyampaikan kebenaran bila ia mengetahuinya.\" Abu Sa'id menangis lalu berkata: Demi Allah, kami telah melihat berbagai hal lalu kami takut dan diantara yang beliau sampaikan: \"Ingat, untuk setiap pengkhianat akan ditegakkan bendera baginya pada hari kiamat berdasarkan tingkat pengkhianatannya dan tidak ada pengkhianatan yang lebih besar dari pengkhianatan pemimpin rakyat, benderanya dipusatkan didekat pantatnya.\" Diantara yang kami hafal saat itu: \"Ingat, anak cucu Adam diciptakan diatas beberapa tingkatan yang banyak, diantara mereka ada yang dilahirkan dalam keadaan mu`min dan mati dalam keadaan mu`min, diantara mereka ada yang terlahir kafir, hidup sebagai orang kafir dan mati dalam keadaan kafir, diantara mereka ada yang terlahir mu`min, hidup sebagai mu`min dan mati dalam keadaan kafir, diantara mereka ada yang terlahir kafir, hidup sebagai orang kafir tapi mati dalam keadaan beriman, ingat, diantara mereka ada yang lamban marah dan cepat sadar, ada juga yang cepat marah dan cepat sadar, maka itu sebagai ganti yang itu, ingat, diantara mereka ada yang cepat marah dan lamban sadar, ingat, yang terbaik dari mereka adalah yang lamban marah tapi cepat sadar, ingat yang terburuk dari mereka adalah yang cepat marah dan lamban sadar, ingat, diantara mereka ada yang menunaikan (hutang) dengan baik dan menagih dengan baik, diantara mereka ada yang menunaikan (hutang) dengan buruk dan menagih dengan buruk, ingat dan yang terbaik dari mereka adalah yang menunaikan (hutang) dengan baik dan menagih dengan baik, ingat, dan yang paling buruk dari mereka adalah yang menunaikan (hutang) dengan buruk dan menagih (hutang) dengan buruk, ingat, marah itu bara api di hati manusia, apa kalian tidak melihat merahnya mata orang marah dan uratnya membengkak. Barangsiapa yang merasakan sesuatu darinya, hendaklah menempel tanah.\" Berkata Ibnu Mas'ud: Kami lalu melihat matahari, apakah masih ada yang tersisa lalu Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Ingatlah, tidaklah tersisa dari dunia dari waktu yang telah berlalu kecuali seperti sisa hari kalian yang masih ada ini dari hari yang telah berlalu.\" Berkata Abu Isa: dalam hal ini ada hadits serupa dari Hudzaifah, Abu Maryam, Abu Zaid bin Akhthab dan Al Mughirah bin Syu'bah, mereka menyebutkan bahwa nabi Shallallahu 'alaihi wa Salam menceritakan apa yang akan terjadi hingga hari kiamat terjadi kepada mereka. hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 34
			}
		}
	]
}