{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2246,
			"arabicnumber": 2246,
			"text": "Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami ['Abdul A'la] telah menceritakan kepada kami [Al Jurairi] dari [Abu Nadlrah] dari [Abu Sa'id] dia berkata: Ibnu Sha'id menemaniku ketika haji maupun umroh, orang orang berangkat sementara aku dan dia tertinggal, setelah aku menyendiri dengan dia aku merasa merinding dan ngeri darinya karena apa yang telah dikatakan orang orang tentangnya, setelah aku turun aku berkata kepadanya: Letakkan barang bawaanmu di pohon itu. dia (Abu sa'id) berkata: Dia melihat seekor kambing dan mengambil wadah lalu pergi memerah susu kemudian dia datang kepadaku dengan membawa susu dan berkata kepadaku: wahai Abu sa'id minumlah, namun aku tidak suka untuk minum sesuatu melalui tangannya karena apa yang telah dikatakan orang orang tentangnya, lalu aku berkata kepadanya: Hari ini adalah hari yang panas dan aku tidak ingin untuk minum susu. lalu dia berkata kepadaku: Wahai Abu Sa'id, aku berniat untuk mengambil seutas tali kemudian aku ikatkan pada sebuah pohon lalu aku mencekikkan diriku karena apa apa yang telah dikatakan oleh orang orang kepadaku dan tentangku, tidakkah kalian tahu bahwa barangsiapa yang ucapanku samar baginya, namun sekali-kali tidak samar bagi kalian, bukankah engkau adalah orang yang paling tahu tentang sabda Rasulullah Shallallahu 'alahi wa Salam, wahai orang orang Anshar bukankah Rasulullah Shallallahu 'alahi wa Salam pernah bersabda bahwa dia kafir (Dajjal) sedangkan aku adalah orang muslim, bukankah Rasulullah Shallallahu 'alahi wa Salam pernah bersabda: \" dia adalah orang yang mandul tidak melahirkan anak sedangkan aku telah meninggalkan anak anakku di Madinah, bukankah Rasulullah Shallallahu 'alahi wa Salam pernah bersabda bahwa dia tidak masuk atau tidak halal baginya Makkah dan Madinah, bukankah aku termasuk penduduk Madinah? dia (Ibnu Sha'id) berkata: inilah aku sekarang berjalan bersamamu menuju Makkah. Demi Allah dia terus menerus mengatakan hal ini sampai aku mengatakan: Mungkin dia berbohong, kemudian dia berkata: wahai Abu Sa'id, demi Allah pasti aku akan ceritakan kepadamu suatu berita yang benar, demi Allah aku mengetahuinya (Dajjal), aku mengetahui bapaknya, dan mengetahui di mana sekarang ia berada. Aku berkata: Celaka kamu sepanjang hari. Abu Isa berkata \" Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 89
			}
		}
	]
}