{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 230,
			"arabicnumber": 230,
			"text": "telah menceritakan kepada kami [Hannad] berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Hushain] dari [Hilal bin Yasaf] berkata; Ziyad bin Abu Al Ja'd memegang tanganku ketika kami sedang berada di tanah yang becek (bekas genangan banjir). Lalu ia mengajakku menemui seorang syaikh yang biasa dipanggil dengan nama [Wabishah bin Ma'bad] dari bani Asad. Ziyad berkata; \"Syaikh ini menceritakan kepadaku, pernah seorang laki-laki shalat sendirian di belakang shaf, syaikh tersebut mendengar Rasulullah shallallahu 'alaihi wasallam memerintahkan laki-laki itu untuk mengulangi shalatnya.\" Abu Isa berkata; \"Dalam bab ini juga ada riwayat dari Ali bin Syaiban dan Ibnu Abbas.\" Abu Isa berkata; \"Hadits Wabishah ini derajatnya hasan. Sebagian ahli ilmu memakruhkan shalat sendirian di belakang imam, mereka berkata; \"Ia harus mengulangi shalatnya jika dilakukan sendirian di belakang imam.\" Pendapat ini diambil oleh Ahmad dan Ishaq. Dan sebagian ulama yang lain, \"Jika ia shalat sendirian di belakang imam maka itu telah mencukupi.\" Pendapat ini diambil oleh Sufyan Ats Tsauri, bin Al Mubarak dan Syafi'i. Beberapa ulama dari Kufah juga berpegangan dengan hadits Wabishah bin Ma'bad, mereka berkata; \"Barangsiapa shalat sendirian di belakang shaf maka ia harus menguangi shalatnya.\" Di antara yang berpendapat seperti ini adalah Hammad bin Sulaiman, Ibnu Abu laila dan Waki'. Hadits Hushain dari Hilal bin Yasaf diriwayatkan dari beberapa orang, seperti riwayat Abu Al Ahwash, dari Ziyad bin Abu Al Ja'd, dari Wabishah bin Ma'bad. Dalam hadits Hushain ini ada petunjuk bahwa Hilal pernah bertemu dengan Wabishah. Dalam hal ini terjadi perselisihan antara ahli hadits, sebagian mereka berkata; \"Hadits yang diriwayatkan dari 'Amru bin Murrah, dari Hilal bin Yasaf, dari 'Amru bin Risydin, dari Wabishah bin Ma'bad lebih shahih. sedangkan yang lain mengatakan, \"Hadits Hushain yang diriwayatkan dari Hilal bin Yasaf, dari Ziyad bin Abu Al Ja'd, dari Wabishah bin Ma'bad lebih shahih.\" Abu Isa berkata; \"Menurutku hadits ini lebih shahih dari hadits Amru bin Murrah. Sebab hadits itu juga telah diriwayatkan dari selain hadits Hilal bin Yasaf, dari Ziyad bin Abu Al Ja'd, dari Wabishah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		}
	]
}