{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"36": "Chapters On Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2382,
			"arabicnumber": 2382,
			"text": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Haiwah bin Syuraih] telah mengkhabarkan kepadaku [Al Walid bin Abu Al Walid Abu 'Utsman Al Mada`ini] bahwa ['Uqbah bin Muslim] telah menceritakan padanya bahwa [Syufaiya Al Ashbahi] telah menceritakan padanya bahwa ia masuk ke Madina, ternyata ada seseorang yang dikerumuni orang-orang. Syufaiya bertanya: Siapa dia? Mereka menjawab: Abu Hurairah. Aku mendekatinya hingga aku duduk di hadapannya sementara ia tengah menceritakan kepada orang-orang. Saat diam dan selesai, aku berkata padanya: Aku menyumpahmu dengan kebenaran dan dengan kebenaran, ceritakanlah suatu hadits padaku yang kau dengar dari Rasulullah Shallallahu 'alahi wa Salam yang kau fahami dan yang kau ketahui. Berkata [Abu Hurairah]: Baik, aku akan menceritakan suatu hadits kepadamu yang diceritakan Rasulullah Shallallahu 'alahi wa Salam kepadaku yang aku fahami dan aku ketahui. Abu Hurairah terisak-isak, setelah itu ia diam sejenak, setelah sadar ia berkata: Aku akan menceritakan kepada hadits yang diceritakan Rasulullah Shallallahu 'alahi wa Salam kepadaku di rumah ini, tidak ada orang lain bersamaku. Setelah itu Abu Hurairah terisak-isak lagi, setelah mereda ia membasuh wajahnya lalu berkata: Aku akan menceritakan kepadamu hadits yang diceritakan Rasulullah Shallallahu 'alahi wa Salam kepadaku, aku dan beliau di rumah ini, tidak ada orang lain bersamamu. Setelah itu Abu Hurairah terisak-isak lagi, setelah mereda ia membeslah wajahnya lalu berkata: Baik, aku akan menceritakan suatu hadis kepadamu yang diceritakan Rasulullah Shallallahu 'alahi wa Salam kepadaku, aku bersama beliau di rumah ini, tidak ada orang lain bersama beliau selain aku. Setelah itu Abu Hurairah terisak-isak dengan keras, setelah itu ia miring tersungkur di atas wajahnya lalu aku menyandarkannya dibadanku selang berapa lama, setelah sadar ia berkata: Telah menceritakan kepadaku Rasulullah Shallallahu 'alahi wa Salam, bahwa Allah Tabaaraka wa Ta'ala pada hari kiamat akan turun kepada para hamba untuk memutuskan di antara mereka dan masing-masing ummat berlutut. Orang pertama yang dipanggil adalah orang hafal al-Qur`an, orang yang terbunuh di jalan Allah dan orang yang banyak hartanya lalu Allah berkata kepada penghafal al-Qur`an: Bukankah Aku mengajarimu sesuatu yang Aku turunkan pada rasulKu? Ia menjawab: Benar, wahai Rabb. Allah bertanya: Apa yang kau amalkan dari ilmu yang diajarkan padamu? Ia menjawab: Dengannya, dulu aku bangun shalat di malam hari dan di siang hari. Allah berfirman padanya: Kau dusta. Para malaikat berkata padanya: Kau dusta. Allah berfirman: Tapi kau ingin memperoleh pujian bahwa si fulan ahli baca al-Qur`an dan memang telah kau peroleh ujian itu. Setelah itu pemilik harta didatangkan lalu Allah bertanya kepadanya: Bukankah Aku melapangkan rizkimu hingga Aku tidak membiarkanmu memerlukan kepada siapa pun? Orang itu menjawab: Benar, wahai Rabb. Allah bertanya: Lalu apa yang kau lakukan dengan apa yang Aku berikan padamu? Ia menjawab: Aku menyambung silaturrahim dan bersedekah. Allah berfirman padanya: Kau dusta. para malaikat berkata padanya: Kau dusta. Allah berfirman: Tapi kau ingin peroleh gelar bahwa si fulan dermawan dan memang telah kau peroleh gelar itu. Kemudian orang yang terbunuh di jalan Allah didatangkan, Allah bertanya kepadanya: Karena apa kau terbunuh? Ia menjawab: Aku diperintahkan berjihad di jalanMu lalu aku berperang hingga aku terbunuh. Allah berfirman padanya: Kau dusta. para malaikat berkata padanya: Kau dusta. Allah berfirman: Tapi kau ingin peroleh gelar si fulan pemberani dan menag telah kau peroleh gelar itu.\" Setelah itu Rasulullah Shallallahu 'alahi wa Salam memukul lututku dan bersabda: \"Hai Abu Hurairah, ketiga orang itulah makhluk Allah pertama-tama yang neraka dinyalakan karena mereka pada hari kiamat.\" Berkata Al Walid Abu 'Utsman: telah mengkhabarkan kepadaku 'Uqbah bin Muslim bahwa Syufaiya dialah yang menemui Mu'awiyah lalu memberitahukan hadits ini padanya. Berkata [Abu 'Utsman]: telah menceritakan kepadaku [Al 'Alla` bin Abu Hakim] ia adalah algojo Mu'awiyah, ia memasuki kediamannya, ia bersama seseorang lalu ia memberitahukan hadits dari Abu Hurairah ini padanya lalu Mu'awiyah berkata: Mereka diperlakukan seperti itu lalu bagaimana sekiranya dengan semua orang? Mu'awiyah menangis dengan keras hingga kami mengira ia meninggal. Kami berkata: Orang ini datang membawa keburukan. Setelah itu Mu'awiyah sadar dan membeslah wajahnya, ia berkata: Maha Benar Allah dan rasulNya: \"Barangsiapa yang menghendaki kehidupan dunia dan perhiasannya, niscaya kami berikan kepada mereka balasan pekerjaan mereka di dunia dengan sempurna dan mereka di dunia itu tidak akan dirugikan. Itulah orang-orang yang tidak memperoleh di akhirat, kecuali neraka dan lenyaplah di akhirat itu apa yang Telah mereka usahakan di dunia dan sia-sialah apa yang Telah mereka kerjakan.\" (Huud: 15-16) Berkata Abu Isa: Hadits ini hasan gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		}
	]
}