{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Abu Hayyan At Taimi] dari [Abu Zur'ah bin 'Amru bin Jarir] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alahi wa Salam diberi daging lalu lengan diangkat pada belia, beliau memakannya dan lengan itu membuat beliau senang, beliau lalu menggigitnya, setelah itu beliau bersabda: \"Aku pemimpin manusia pada hari kiamat, tahukah kalian kenapa? Allah mengumpulkan semua manusia dari yang pertama hingga yang akhir dalam satu tanah lapang, penyeru memperdengarkan mereka, pandangan menembus mereka dan matahari mendekat, duka dan kesusahan manusia sampai pada batas yang tidak mereka mampu dan tidak mampu mereka pikul. Orang-orang saling berkata satu sama lain: Apa kalian tidak melihat yang telah menimpa kalian, apakah kalian tidak melihat siapa yang memberi kalian syafaat kepada Rabb kalian. Orang-orang saling berkata satu sama lain: Hendaklah kalian menemui Adam. Mereka menemui Adam lalu berkata: Engkau adalah nenek moyang manusia, Allah menciptakanmu dengan tanganNya, meniupkan ruhnya padamu dan memerintahkan para malaikat lalu mereka sujud padamu, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Adam berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu Ia melarangku mendekati pohon tapi aku durhaka, diriku, diriku, diriku. Pergilah pada selainku, pergilah ke Nuh. Mereka mendatangi Nuh lalu berkata: Hai Nuh, engkau adalah rasul pertama untuk penduduk bumi, Allah menyebutmu hamba yang sangat bersyukur, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Nuh berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah berdoa keburukan untuk kaumku, diriku, diriku, diriku, pergilah kepada selainku, pergilah ke Ibrahim. Mereka mendatangi Ibrahim lalu berkata: Wahai Ibrahim, engkau nabi Allah dan kekasihNya dari penduduk bumi, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Nuh berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah bedusta tiga kali -Abu Hayyan menyebut ketiga-tiganya dalam hadits ini- diriku, diriku, diriku, pergilah kepada selainku, pergilah ke Musa. Mereka menemui Musa lalu berkata: Wahai Musa, engkau utusan Allah, Allah melebihkanmu dengan risalah dan kalamNya atas seluruh manusia, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Musa berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah membunuh jiwa padahal aku tidak diperintahkan untuk membunuhnya, diriku, diriku, diriku, pergilah kepada selainku, pergilah ke 'Isa. Mereka mendatangi 'Isa lalu berkata: Hai 'Isa, engkau adalah utusan Allah, kalimatNya yang disampaikan ke maryam, ruh dariNya, engkau berbicara pada manusia saat masih berada dalam buaian, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Isa berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, ia tidak menyebut dosa, diriku, diriku, diriku, pergilah ke selainku, pergilah ke Muhammad. Mereka mendatangi Muhammad lalu berkata: Wahai Muhammad, engkau adalah utusan Allah, penutup para nabi, dosamu yang telah lau dan yang kemudian telah diampuni, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami. Lalu aku pergi hingga sampai di bawah 'arsy, aku tersungkur sujud pada Rabbku lalu Allah memulai dengan pujian dan sanjungan untukku yang belum pernah disampaikan pada seorang pun sebelumku, lalu ada suara: Hai Muhammad, angkatlah kepalamu, mintalah pasti kau diberi, berilah syafaat nicaya kau diizinkan untuk memberi syafaat. Lalu aku mengangkat kepalaku, aku berkata: Wahai Rabb, ummatku, wahai Rabb, ummatku, wahai Rabb, ummatku. Ia berkata: Hai Muhammad, masukkan orang yang tidak dihisab dari ummatmu melalui pintu-pintu surga sebelah kanan dan mereka adalah sekutu semua manusia selain pintu-pintu itu.\" Setelah itu beliau bersabda: \"Demi Dzat yang jiwaku berada ditanganNya, jarak antara dua daun pintu-pintu surga seperti jarak antara Makakah dan Hajar dan seperti jarak antara Makkah dan Bashrah.\" Dalam hal ini ada hadits serupa dari Abu Bakar Ash Shiddiq, Anas, 'Uqbah bin 'Amir, Abu Sa'id. Berkata Abu Isa: Hadits ini hasan shahih dan nama Abu Hayyan At Taimi adalah Yahya bin Sa'id bin Hayyan, orang kufi, terpercaya, dan nama Abu Zur'ah bin 'Amru bin Jarir adalah Harim",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		}
	]
}