{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "Telah menceritakan kepada kami [Abu Hashin Abdullah bin Ahmad bin Yunus Kufi] telah menceritakan kepada kami ['Abtsar bin Al Qasim] telah menceritakan kepada kami [Hushain bin Abdurrahman] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] berkata: Saat nabi Shallallahu 'alaihi wa Salam isra`, ia melintasi satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam bersama kaum mereka, satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam bersama beberapa orang, satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam tidak bersama seorang pun hingga beliau melewati sekumpulan besar manusia, aku bertanya: Siapa dia? Dijawab: Musa dan kaumnya, tapi angkatlah kepalamu lau lihatlah. Ternyata sekelompok besar manusia menutupi ufuk dari sisi ini dan sisi ini. dikatakan: Mereka adalah ummatmu dan diantara ummatmu itu ada tujuhpuluh ribu yang masuk surga tanpa hisab. Beliau masuk lalu para sahabat tidak bertanya kepada beliau dan beliau tidak memberi penjelasan pada mereka, lalu mereka bertanya: Kamikah mereka itu? Ada yang menjawab: Mereka adalah anak-anak kami yang meninggal dunia diatas fitrah dan Islam. Lalu nabi Shallallahu 'alaihi wa Salam keluar dan bersabda: \"Mereka adalah orang-orang yang tidak mengecos (berobat dengan sundutan api), tidak meminta diruqyah, tidak berfirasat buruk karena kedatangan hewan dan mereka bertawakal kepada Rabb mereka.\" 'Ukkasyah bin Mihshan berdiri lalu bertanya: Saya termasuk dari mereka wahai Rasulullah? beliau menjawab: \"Ya.\" Yang lain berdiri lalu bertanya: Saya termasuk dari mereka? Beliau menjawab: \"Kau sudah didahului 'Ukkasyah.\" Berkata Abu Isa: Hadits ini hasan shahih dan dalam hal ini ada hadits serupa dari Ibnu Mas'ud dan Abu Hurairah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		}
	]
}