{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 248,
			"arabicnumber": 248,
			"text": "telah menceritakan kepada kami [Bundar Muhammad bin Basysyar] berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dan [Abdurrahman bin Mahdi] keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Hujr bin Anbasah] dari [Wa`il bin Hujr] ia berkata; \"Aku mendengar Nabi shallallahu 'alaihi wasallam membaca: \"GHAIRIL MAGHDLUUBI 'ALAIHIM WA LADLAALLIIN (bukan (jalan) mereka yang dimurkai dan bukan (pula jalan) mereka yang sesat), beliau lalu mengucapkan: \"AAMIIN (semoga Allah mengAbu Alkan), \" dengan memanjangkan suaranya.\" Ia berkata; \"Dalam bab ini juga ada riwayat dari Ali dan Abu Hurairah.\" Abu Isa berkata; \"Hadits Wa`il bin Hujr ini derajatnya hasan. Pendapat ini banyak diambil oleh ahli ilmu dari kalangan sahabat Nabi shallallahu 'alaihi wasallam, tabi'in dan orang-orang setelah mereka. Mereka berpendapat bahwa seseorang hendaknya mengeraskan suara AMIN dan tidak menyuarakannya dengan pelan. Pendapat ini juga diambil oleh Imam Syafi'i, Ahmad dan Ishaq. [Syu'bah] juga meriwayatkan hadits ini dari [Salamah bin Kuhail] dari [Hujr Abu Al 'Anbasah] dari [Alqamah bin Wa`il] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam membaca: GHAIRIL MAGHDLUUBI 'ALAIHIM WA LADLAALLIIN (bukan (jalan) mereka yang dimurkai dan bukan (pula jalan) mereka yang sesat), lalu beliau mengucapkan: \"AAMIIN (semoga Allah mengAbu Alkan), dan beliau menyuarakannya dengan pelan.\" Abu Isa berkata; \"Aku mendengar Muhammad berkata; \"Dalam hal ini hadits Sufyan lebih shahih daripada hadits Syu'bah. Syu'bah telah melakukan beberapa kesalahan kaitannya dengan hadits ini. Ia mengatakan, \"Dari Hujr Abu Al 'Anbasah, padahal yang dimaksud adalah Hujr bin 'Anbas, julukannya Abu As Sakan. Di dalamnya ia menambahkan; dari Alqamah bin Wa`il, padahal di dalamnya tidak ada Alqamah. Hanyasanya dari Hujr bin 'Anbasah, dari Wa`il bin Hujr. Dan ia mengatakan, \"Lalu beliau menyuarakannya dengan pelan, \" padahal yang benar, \"Beliau mengeraskan suaranya.\" Abu Isa berkata; \"Aku pernah bertanya kepada Abu Zur'ah tentang hadits ini, ia lalu menjawab, \"Hadits Sufyan dalam hal ini lebih shahih ketimbang hadits Syu'bah.\" Ia berkata; \"Al 'Ala bin Shalih Al Asadi meriwayatkan dari Salamah bin Kuhail sebagaimana riwayat Sufyan.\" Abu Isa berkata; \"Telah menceritakan kepada kami [Abu Bakar Muhammad bin Aban] berkata; telah menceritakan kepada kami [Abdullah bin Numair] berkata; telah menceritakan kepada kami [Al 'Ala bin Shalih Al Asadi] dari [Salamah bin Kuhail] dari [Hujr bin 'Anbas] dari [Wa`il bin Hujr] dari Nabi shallallahu 'alaihi wasallam, sebagaimana hadits Sufyan dari Salamah bin Kuhail",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 100
			}
		}
	]
}