{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Abdul Hamid bin Habib bin Abu Al 'Isyrin] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Hassan bin 'Athiyah] dari [Sa'id bin Al Musayyib] ia bertemu [Abu Hurairah] lalu Abu Hurairah berkata: Aku meminta kepada Allah semoga menyatukanku denganmu di pasar surga. Sa'id bertanya: Apa disana ada pasar? Abu Hurairah menjawab: Ya, telah menghabarkan kepadaku Rasulullah Shallallahu 'alaihi wa Salam, bahwa penghuni surga bila masuk surga, mereka tinggal di sana karena keutamaan amal-amal mereka, kemudian diizinkan seukuran hari jum'at dari hari-hari dunia lalu mereka mengunjungi Rabb mereka kemudian Rabb menampakkan 'arsyNya pada mereka, salah satu taman surga nampak pada mereka kemudian mimbar-mimbar dari cahaya, mimbar-mimbar dari mutiara, mimbar-mimbar dari yaqut, mimbar-mimbar dari permata, mimbar-mimbar dari emas, mimbar-mimbar dari perak diletakkan untuk mereka, yang paling rendah di antara mereka beserta tingkat kerendahannya duduk di atas gundukan tanah kesturi dan kafur dan mereka beranggapan tempat duduk para pemilik kursi tidak lebih baik dari mereka.\" Abu Hurairah bertanya: Wahai Rasulullah, apakah kita akan melihat Rabb kita? Beliau menjawab: \"Ya.\" Rasulullah Shallallahu 'alaihi wa Salam bertanya: \"Apakah kalian kesulitan saat melihat matahari dan bulan di malam purnama?\" Kami menjawab: Tidak. Beliau bersabda: \"Seperti itu juga kalian tidak kesulitan dalam melihat Rabb kalian. Dan dimajlis itu tidaklah ada seorang pun melainkan Allah mendatanginya dengan sebenarnya hingga Ia bertanya kepada seseorang dari mereka: Hai fulan bin fulan, ingatkah kau saat berkata begini dan begini? Allah mengingatkan sebagian kemaksiatan-kemaksiatannya didunia. Orang itu berkata: Wahai Rabb, apa Kau tidak mengampuniku? Allah menjawab: Ya, luasnya ampunanku sampai pada tempatmu ini. Saat mereka seperti, mega menaungi mereka di atas mereka lalu turun hujan minyak wangi yang baunya sama sekali belum pernah mereka temukan, Rabb kita Tabaaraka wa Ta'ala berfirman: Berdirilah menuju kemuliaan yang telah Aku persiapkan untuk kalian lalu ambillah yang kalian inginkan. Lalu kami mendatangi pasar yang diliputi oleh malaikat, di dalamnya ada yang belum pernah dilihat mata sepertinya, belum pernah terdengar oleh telinga dan tidak terlintas dihati, lalu apa yang kami inginkan dibawakan untuk kami, di sana tidak dijual dan tidak dibeli. Di pasar itu, para penghuni surga saling bertemu satu sama lain.\" Beliau meneruskan: \"Seseorang yang tinggal di flat (derajat tinggi) surga lantas datang lalu bertemu dengan orang yang tingkatnya berada dibawahnya beserta kerendahan yang ada padanya lalu ia kaget terhadap pakaian yang diperlihatkan padanya, akhir kata-katanya belum juga habis hingga ia menghayal yang lebih baik darinya, karenanya tidak layak bagi siapa pun untuk bersedih di surga. Setelah itu kami pulang ke rumah-rumah kami, kami disambut oleh istri-istri kami, mereka berkata: Selamat datang, kau datang dengan keindahan yang lebih baik dari saat kau tinggalkan kami. Ia berkata: Sesungguhnya kami menemani Rabb kami Al Jabbar hari ini, laik bagi kami untuk pulang seperti ini.\" Berkata Abu Isa: Hadits ini hasan gharib, kami hanya mengetahuinya dari jalur sanad ini. [Suwaid bin Amru] meriwayatkan sebagaian hadits ini dari [Al Auza'i]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 27
			}
		}
	]
}