{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"39": "The Book on the Description of Hellfire"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Risydin] telah menceritakan kepadaku [Ibnu An'um] dari [Abu Utsman] bahwa dia menceritakan kepadanya dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam; \"Sesunguhnya ada dua orang yang masuk ke dalam neraka, keduanya menjerit dengan suara keras, maka Rabb 'azza wajalla memerintahkan (kepada Malaikat Zabaniyah): 'Keluarkanlah keduanya! ' Setelah keduanya dikeluarkan, maka Allah bertanya kepada keduanya: 'Untuk apa kalian berdua menjerit dengan suara keras? ' Keduanya menjawab; 'Kami melakukan demikian agar supaya Engkau mengasihani kami, ' kemudian Allah berfirman, 'Sesungguhnya rahmat-Ku untuk kalian berdua, hendaklah kalian berdua pergi lalu menceburkan diri kalian di tempat kalian dahulu berada dalam neraka, ' maka keduanya pergi, dan salah seorang dari keduanya menceburkan dirinya ke dalam neraka, namun Allah menjadikannya dingin dan selamat atasnya, sedangkan yang lain tetap berdiri dan tidak menceburkan dirinya, kemudian Allah 'azza wajalla bertanya kepadanya; 'Apa yang menghalangimu untuk menceburkan dirimu sebagaimana temanmu telah menceburkan dirinya? ' dia menjawab; 'Wahai Rabbku sesungguhnya aku sangat mengharap agar supaya Engkau tidak mengembalikanku ke dalamnya (neraka) setelah Engkau keluarkan aku darinya.' Maka Allah berfirman: 'Kamu mendapatkan apa yang kamu harapkan.' Kemudian keduanya masuk Surga dengan rahmat Allah\". Abu Isa berkata; 'Isnad hadits ini lemah, karena ia berasal dari Risydin bin Sa'ad. Sedangkan Risydin bin Sa'ad adalah seorang yang dhaif (lemah) menurut ahli hadits dari Ibnu An'um, karena dia seorang warga Afrika, sedangkan orang Afrika adalah dhaif menurut ahli hadits",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		}
	]
}