{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"40": "The Book on Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2611,
			"arabicnumber": 2611,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abbad bin Abbad al Muhallabi] dari [Abu Jamrah] dari [Ibnu Abbas] dia berkata; Delegasi Abdul Qais datang kepada Rasulullah seraya berkata; 'Sesungguhnya kampung ini adalah (melewati) kampung Rabi'ah, dan tidaklah kita mengunjungimu kecuali pada bulan bulan haram, maka perintahkanlah kepada kami untuk melakukan sesuatu yang kami ambil darimu, dan kami akan mengajak orang-orang yang berada di belakang kami kepadanya, ' maka beliau bersabda; \"Saya perintahkan kalian dengan empat perkara; iman kepada Allah, \" kemudian beliau menafsirkannya untuk mereka, yaitu; \"kesaksian bahwa tidak ada tuhan (yang berhak disembah) selain Allah, dan bahwa aku adalah utusan Allah, mendirikan shalat, menunaikan zakat, menunaikan seperlima dari harta ghanimah kalian.\" Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu Jamrah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Isa berkata; ini adalah hadits hasan shahih, dan Abu Jamrah Adl Dlaba'I namanya adalah Nadlr bin Imran. Dan [Syu'bah] juga meriwayatkannya dari [Abu Jamrah]. Dan dia menambahkan di dalamnya; \"Apakah kalian tahu apakah iman itu? Yaitu persaksian bahwa tidak ada tuhan (yang berhak disembah) selain Allah dan bahwa aku adalah utusan Allah…\" dan dia menyebutkan kesempurnaan hadits. Saya mendengar Qutaibah bin Sa'id berkata, 'Saya tidak pernah melihat seperti mereka empat ahli fikih yang mulia; Malik bin Anas, al Laits bin Sa'ad, Abbad bin Abbad al Muhallabi, dan Abdul Wahhab ats Tsaqafi. Qutaibah berkata; 'Kami rela untuk pulang dari sisi Abbad setiap hari dengan membawa dua hadits. Dan Abbad bin Abbad adalah termasuk putera al Muhallab bin Abi Shufrah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 6
			}
		}
	]
}