{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"40": "The Book on Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2616,
			"arabicnumber": 2616,
			"text": "Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Abdullah bin Mu'adz ash Shan'ani] dari [Ma'mar] dari ['Ashim bin Abi an Najud] dari [Abu Wail] dari [Mu'adz bin Jabal] dia berkata; Saya pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan, suatu pagi aku berada dekat dari beliau, dan kami sedang bepergian, maka saya berkata; 'Wahai Rasulullah, kabarkanlah kepadaku tentang suatu amal yang akan memasukkanku kedalam surga dan menjauhkanku dari neraka.' Beliau menjawab: \"Kamu telah menanyakan kepadaku tentang perkara yang besar, padahal sungguh ia merupakan perkara ringan bagi orang yang telah Allah jadikan ringan baginya, yaitu: Kamu menyembah Allah dan tidak menyekutukannya dengan sesuatu apa pun, kamu mendirikan shalat, menunaikan zakat, berpuasa di bulan Ramadhan, berhaji ke Baitullah.\" Kemudian beliau bersabda: \"Maukah kamu aku tunjukkan pada pintu-pintu kebaikan? Puasa adalah perisai dan sedekah akan memadamkan kesalahan sebagaimana air memadamkan api, dan shalat seorang laki-laki pada pertengahan malam.\" Kemudian beliau membaca; \"Lambung mereka jauh dari tempat tidurnya, sedang mereka berdoa kepada Rabbnya dengan rasa takut dan harap, dan mereka menafkahkan sebagian dari rezki yang Kami berikan kepada mereka. (16) Seorang pun tidak mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam nikmat) yang menyedapkan pandangan mata sebagai balasan terhadap apa yang telah mereka kerjakan.\" (As-Sajdah: 16-17). Kemudian beliau bersabda: \"Maukah kamu aku tunjukkan pokok perkara agama, tiang dan puncaknya?\" Aku menjawab: \"Ya, wahai Rasulullah.\" Beliau bersabda: \"Pokok dari perkara agama adalah Islam, tiangnya adalah shalat, sedangkan puncaknya adalah jihad.' Kemudian beliau bersabda: \"Maukah kamu aku kabarkan dengan sesuatu yang menguatkan itu semua?\" Aku menjawab; 'Ya, wahai Nabi Allah.' Lalu beliau memegang lisannya, dan bersabda: \"'Tahanlah (lidah) mu ini.\" Aku bertanya; 'Wahai Nabi Allah, (Apakah) sungguh kita akan diadzab disebabkan oleh perkataan yang kita ucapkan? ' Beliau menjawab; \"(Celakalah kamu) ibumu kehilanganmu wahai Mu'adz, Tidaklah manusia itu disunggkurkan ke dalam neraka di atas muka atau hidung mereka melainkan karena hasil ucapan lisan mereka?\" Abu Isa berkata; 'Ini hadits hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		}
	]
}