{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"40": "The Book on Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [al Laits] dari [Ibnu 'Ajlan] dari [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz] dari [Ash Shunabihi] dari [Ubadah bin Ash Shamit] bahwasanya dia berkata; Saya mengunjungi Ubadah bin ash Shamit yang sedangkan berada di (ambang) kematian, aku pun menangis, maka dia berkata; 'Tahan dulu perlahan, kenapa kamu menangis? Demi Allah, jika aku mati syahid, niscaya aku bersaksi untukmu, dan jika aku diberi syafaat yang dikabulkan, niscaya aku memberikan syafaat untukmu, dan jika aku mampu, niscaya aku memberikan manfaat untukmu'. Kemudian dia berkata; 'Demi Allah, tidaklah ada hadits yang aku dengar dari Rasulullah shallallahu 'alaihi wasallam yang ada kebaikannya bagi kalian, melainkan aku telah menceritakannya kepada kalian kecuali satu hadits, namun sekarang aku akan menceritakannya kepada kalian, dan sungguh aku telah mendekati ajalku. Aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, dan bahwa Muhammad adalah Rasulullah niscaya Allah mengharamkan neraka atasnya.\" Dan dalam hadits bab tersebut juga diriwayatkan dari Abu Bakar, Umar, Utsman, Ali, Thalhah, Jabir, Ibnu Umar, dan Zaid bin Khalid. Dia berkata; saya mendengar Ibnu Abi Umar berkata, saya mendengar Ibnu Uyainah berkata, Muhammad bin 'Ajlan adalah seorang yang tsiqah terpercaya dalam hadits. Abu Isa berkata; 'Ini hadits hasan shahih gharib dari jalur sanad ini. Sedangkan ash Shunabihi adalah Abdurrahman bin Usailah Abu Abdullah, dan telah diriwayatkan dari az Zuhri bahwasanya dia ditanya tentang sabda Nabi shallallahu 'alaihi wasallam: \"Barangsiapa yang mengucapkan; 'Tidak ada tuhan (yang berhak disembah) selain Allah' niscaya dia masuk surga.' Maka dia menjelaskan; 'Hadits ini adalah pada awal Islam sebelum turunnya ibadah Fardhu, perintah dan larangan.' Abu Isa berkata; 'segi pendalilan dari hadits ini menurut sebagian ahli ilmu bahwa ahli tauhid akan masuk surga, walaupun mereka diadzab di neraka disebabkan dosa mereka, namun mereka tidak kekal di neraka. Dan telah diriwayatkan dari Abdullah bin Mas'ud, Abu Dzar, Imran bin Hushain, Jabir bin Abdullah, Ibnu Abbas, Abu Sa'id al Khudri, dan Anas bin Malik dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Akan keluar sejumlah kaum dari manusia dari golongan ahli tauhid, dan masuk surga.\" Demikianlah diriwayatkan dari Sa'id bin Jubair, Ibrahim an Nakha'i, dan tidak hanya satu orang dari kalangan tabi'in dalam menafsirkan ayat ini; 'Orang-orang yang kafir itu seringkali (nanti di akhirat) menginginkan, kiranya mereka dahulu (di dunia) menjadi orang-orang muslim.' (QS. 15: 2) ' Mereka memberikan penafsiran; 'Apabila ahli tauhid dikeluarkan dari neraka dan dimasukkan ke dalam surga, maka berkeinginanlah orang-orang kafir bahwa seandainya mereka dahulu menjadi orang-orang muslim",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 33
			}
		}
	]
}