{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"40": "The Book on Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2639,
			"arabicnumber": 2639,
			"text": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengabarkan kepada kami [Abdullah] dari [Laits bin Sa'd] telah menceritakan kepada kami [Amir bin Yahya] dari [Abu Abdurrahman al Ma'afiri al Hubuli] dia berkata, saya mendengar [Abdullah bin Amru bin al Ash] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah akan menyelamatkan seorang laki-laki dari umatku di hadapan manusia pada hari kiamat, lalu dia membuka buku catatan besar di hadapannya, setiap buku catatan besar lebarnya seperti sepanjang mata memandang, kemudian Dia berfirman; 'Apakah kamu mengingkari sesuatu dari ini? Apakah para penulisku yang menjaga (amal manusia) menzhalimimu? ' dia menjawab; 'Tidak wahai Rabbku.' Allah bertanya; 'Apakah kamu mempunyai alasan dalih (bagi amal burukmu)? ' Dia menjawab; 'Tidak wahai Rabbku.' Allah berfirman; 'Tidak demikian, sesungguhnya kamu mempunyai kebaikan di sisi Kami, karena itu tidak ada kezhaliman atasmu pada hari ini'. Lalu keluarlah kartu amal kebaikan, yang di dalamnya tercatat bahwa; saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, dan saya bersaksi bahwa Muhammad adalah hamba dan RasulNya.' Lalu Allah berfirman; 'Hadirkan amal timbanganmu! ' dia berkata; 'Wahai Rabbku, apa (artinya) satu kartu amal ini (bila) dibandingkan buku catatan besar ini? ' Allah berfirman; 'Sesungguhnya kamu tidak akan dizhalimi.'\" Nabi melanjutkan; 'Lalu diletakkanlah buku catatan besar pada satu sisi, sedangkan kartu amal diletakkan pada sisi lainnya, maka buku catatan besar itu ringan (timbangannya) sedangkan kartu amal itu berat, maka tidak ada sesuatu pun yang lebih berat dibandingkan nama Allah.\" Abu Isa berkata; 'Ini hadits hasan gharib. Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Ibnu Lahi'ah], dari [Amir bin Yahya] dengan sanad ini hadits semisalnya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 34
			}
		}
	]
}