{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"42": "Chapters on Seeking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2690,
			"arabicnumber": 2690,
			"text": "Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [Abdul A'la bin Abdul A'la] dari [Al Jurairi] dari [Abu Nadlrah] dari [Abu Sa'id] ia berkata; Abu Musa meminta izin kepada Umar, sambil berucap; \"ASSALAAMU'ALAIKUM, apakah aku boleh masuk?\" Umar berkata; \"Satu, setelah itu ia diam sesaat.\" Selanjutnya Abu Musa mengucapkan; \"ASSALAAMU'ALAIKUM, apakah aku boleh masuk?\" Umar berkata; \"Dua, setelah itu ia diam sesaat.\" Abu Musa mengulanginya; \"ASSALAAMU'ALAIKUM, apakah aku boleh masuk?\" Umar berkata; \"Tiga.\" Setelah itu Abu Musa beranjak pergi, lalu Umar berkata kepada penjaga pintu; \"Apa yang ia lakukan?\" Penjaga pintu menjawab; \"Ia sudah beranjak pergi.\" Umar berkata; \"Suruh ia dating kembali.\" Saat Abu Musa datang, Umar bertanya: \"Apa yang telah kamu lakukakn?\" Abu Musa menjawab; \"Sunnah.\" Umar berkata; \"Sunnah? demi Allah, kamu harus membawa bukti atau aku akan menghukummu.\" Abu Sa'id melanjutkan; \"Lalu Abu Musa mendatangi kami, sementara kami tengah bersama beberapa orang Anshar, Abu Musa berkata; \"Wahai sekalian kaum Anshar, bukankah kalian yang paling tahu tentang hadits Rasulullah shallallahu 'alaihi wasallam?, bukankah Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Meminta izin itu tiga kali, bila kamu diizinkan (silahkan masuk) dan bila tidak, maka kembalilah.\" Orang-orangpun mencandainya. Abu Sa'id berkata; Lalu aku mengangkat kepalaku, aku bertanya: \"Apakah kamu akan mendapakan hukuman karena masalah ini?, sungguh aku akan menyertaimu.\" Ia mendatangi Umar lalu memberitahukannya. Umar berkata; Aku belum mengetahui mengenai masalah ini. Dalam hal ini ada hadits serupa dari Ali dan Ummu Thariq budak milik Sa'ad. Abu Isa berkata; Hadits ini hasan shahih. Nama Al Jurairi adalah Sa'id bin Iyas, julukannya Abu Mas'ud. Yang lain juga meriwayatkan hadits ini dari Abu Nadlrah Al Abdi, namnya adalah Al Mundzir bin Malik bin Qatha'ah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		}
	]
}