{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"text": "telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dan [Jarir] dari [Manshur] dari [Hilal bin Yasaf] dari [Salamah bin Qais] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Jika engkau berwudlu maka masukkanlah air ke dalam hidung, dan jika engkau beristijmar maka lakukanlah dengan bilangan ganjil.\" Dalam bab ini juga ada riwayat dari Utsman, Laqith bin Shabrah, Ibnu Abbas, Al Migdam bin Ma'di Karib, Wa`il bin Hujr dan Abu Hurairah.\" Abu Isa berkata; \"Hadits Salamah bin Qais derajatnya hasan shahih. Dan para ahli ilmu saling berbeda pendapat tentang hukum orang yang meninggalkan berkumur dan istinsyaq. Sebagian kelompok mengatakan; \"Jika seseorang meninggalkannya hingga ia melaksanakan shalat, maka ia harus mengulangi shalatnya. Mereka berpendapat bahwa hal itu berlaku dalam wudlu dan mandi janabah. Yang berpendapat demikian adalah Ibnu Abu Laila, Abdullah Ibnul Mubarak, Ahmad dan Ishaq. Sedangkan Ahmad berpendapat bahwa melakukan istinsyaq lebih ditekankan pada wudlu. Abu Isa berkata; \"Dan sebagian ulama yang lain berpendapat bahwa hal itu berlaku dalam keadaan junub, bukan dalam wudlu.\" Ini adalah pendapat Sufyan Ats Tsauri dan sebagian dari penduduk Kufah. Dan sebagian ulama yang lain mengatakan bahwa hal itu tidak berlaku dalam wudlu dan junub, karena keduanya adalah perkara sunnah, maka tidak ada kewajiban untuk mengulanginya bagi seseorang yang meninggalkan keduanya. Ini adalah pendapat Malik, Asy Syafi'i dalam qaul jadid",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 27
			}
		}
	]
}