{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"42": "Chapters on Seeking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abdullah bin Idris] dan [Abu Usamah] dari [Syu'bah] dari ['Amr bin Murrah] dari [Abdullah bin Salamah] dari [Shafwan bin 'Assal] ia berkata; \"Seorang Yahudi berkata kepada sahabatnya; \"Marilah kita berangkat bersama menemui Nabi ini!\" sahabatnya menjawab: \"Jangan katakan Nabi, sungguh apabila dia mendengar perkataanmu, maka dia akan memiliki empat mata (bahasa kiasan dari senang), \" lalu keduanya mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya kepada beliau tentang sembilan ayat bayyinat, beliau bersabda kepada mereka: \"Janganlah kalian menyekutukan Allah dengan sesuatu apapun, jangan mencuri, jangan berzina, jangan membunuh jiwa yang diharamkan oleh Allah kecuali dengan benar, jangan menjelek-jelekkan orang yang tidak bersalah kepada penguasa agar penguasa membunuhnya, jangan melakukan sihir, jangan memakan riba, jangan menuduh (berbuat zina) wanita-wanita suci, jangan berpaling lari dari medan pertempuran, dan kepada kalian khususnya wahai orang-orang Yahudi, janganlah kalian melampaui batas pada hari sabtu.\" Shafwan berkata; Mereka langsung mencium kedua tangan dan kaki beliau, lalu keduanya mengatakan; \"Kami bersaksi bahwa engkau adalah Nabi.\" Beliau bertanya: \"Lalu apa yang menghalangi kalian tidak mengikutiku?\" Shafwan berkata; Mereka mengatakan: \"Sesungguhnya Nabi Daud berdo'a kepada Rabbnya agar senantiasa ada dari keturunannya seorang nabi, sesungguhnya kami takut jika mengikutimu orang-orang Yahudi akan membunuh kami.\" Dan dalam bab ini, ada hadits dari Yazid bin Al Aswad, Ibnu Umar dan Ka'ab bin Malik. Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 46
			}
		}
	]
}