{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"44": "Chapters on Parables"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Abu Adi] dari [Ja'far bin Maymun] dari [Abu Tamimah Al Hujaimi] dari [Abu Utsman] dari [Ibnu Mas'ud] ia berkata; \"Seusai Rasulullah shallallahu 'alaihi wasallam shalat isya, beliau keluar sambil memegang tangan Abdullah bin Mas'ud, ketika sampai di suatu lembah makkah, beliau mendudukkannya kemudian membuat garis lingkaran di sekitarnya lalu bersabda: \"Janganlah kamu meninggalkan garismu, karena akan datang kepadamu beberapa orang dan janganlah kamu mengajak bicara kepada mereka, karena sesungguhnya mereka tidak mengajak bicara denganmu, \" Ibnu Mas'ud berkata; lalu Rasulullah shallallahu 'alaihi wasallam berlalu ke tempat yang beliau tuju, ketika aku sedang duduk di garisku, tiba-tiba datanglah kepadaku beberapa orang, seakan-akan mereka adalah orang-orang hitam India yang rambut dan tubuh mereka tidak terlihat, tapi tidak memakai kain penutup, mereka menghampiriku namun tidak bisa melewati garis, setelah itu mereka kembali kepada Rasulullah shallallahu 'alaihi wasallam, sampai ketika di akhir malam, Rasulullah shallallahu 'alaihi wasallam mendatangiku, sementara saya dalam keadaan duduk, lalu beliau bersabda: \"Sejak tadi malam aku tidak tidur, \" kemudian beliau masuk ke dalam garis bersamaku dan menjadikan pahaku untuk bantalnya lalu beliau tertidur. Jika Rasulullah shallallahu 'alaihi wasallam tidur, maka tarikan nafasnya terdengar. Ketika aku sedang duduk sementara Rasulullah shallallahu 'alaihi wasallam berbantalkan pahaku, tiba-tiba saya melihat beberapa orang dengan mengenakan pakaian serba putih, hanya Allah yang tahu akan keindahan mereka, mereka menghampiriku, sedangkan sebagian dari mereka duduk di sisi kepala Rasulullah shallallahu 'alaihi wasallam dan sebagian yang lainnya di sisi kaki beliau, lalu mereka berkata kepada sesamanya: \"Kita tidak pernah sama sekali melihat seorang hamba yang diberi sebagaimana yang diberikan kepada Nabi ini, sungguh kedua matanya tertidur sementara hatinya terjaga, buatlah oleh kalian permisalan untuknya, permisalannya seperti seorang tuan yang membangun istana, kemudian membuat jamuan makan, setelah itu ia mengundang orang-orang untuk menghadiri jamuan makan dan minumnya, barangsiapa memenuhi undangannya maka dia makan dan minum jamuan makanan dan minumannya, dan barangsiapa tidak memenuhi undangannya, maka dia akan memberinya sanksi, atau dia berkata; maka dia akan menyiksanya.\" kemudian mereka pergi, ketika itu Rasulullah shallallahu 'alaihi wasallam terjaga dari tidurnya, lalu beliau bertanya: \"Apakah kamu mendengar apa yang mereka katakan dan apakah kamu tahu siapa mereka?\" Aku menjawab; \"Allah dan RasulNya yang lebih tahu, \" beliau bersabda: \"Mereka adalah para Malaikat, kemudian apakah kamu tahu apa permisalan yang mereka buat?\" aku menjawab; \"Allah dan Rasul-Nya yang lebih tahu, \" beliau bersabda: \"Permisalan yang mereka buat adalah Allah yang Maha pemurah dan Maha Tinggi telah membangum surga dan menyeru hamba-hambaNya menuju surga, barangsiapa menjawab seruanNya, dia masuk surga dan barangsiapa tidak menjawabnya, Dia akan memberinya sanksi atau menyiksanya.\" Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini, Abu Tamimah adalah Al Juhani, namanya adalah Tharif bin Mujalid, Abu Utsman An Nahdi namanya adalah Abdurrahman bin Mull. Hadits [Sulaiman At Taimi] telah meriwayatkan hadits ini darinya [Mu'tamir] dan dia adalah Sulaiman bin Tharkhan, bukan Taimi namun dia pernah singgah di Bani Taim sehingga dia dinisbahkan kepadanya. Ali berkata bahwa Yahya bin Sa'id berkata; \"Aku tidak pernah melihat orang yang lebih takut kepada Allah melebihi Sulaiman At Taimi",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 3
			}
		}
	]
}