{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"44": "Chapters on Parables"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban bin Yazid] telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Zaid bin Sallam] bahwa [Abu Sallam] telah menceritakan kepadanya bahwa [Al Harits Al Asy'ari] telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah memerintahkan lima kalimat kepada Yahya bin Zakariya agar diamalkan dan memerintahkan Bani Israil supaya mengamalkannya, dan sesungguhnya ia hampir saja memperlambatnya. Isa berkata; \"Sesungguhnya Allah memerintahkan lima kalimat padamu agar kamu amalkan dan agar Bani Israil kamu perintahkan untuk mengamalkannya, perintahlah mereka atau aku yang memerintah mereka.\" Yahya menjawab; \"Aku khawatir bila kamu mendahuluiku menyampaikannya, aku akan dibenamkan atau disiksa.\" Isa kemudian mengumpulkan manusia di Baitul Maqdis, masjid penuh sesak hingga ke teras, Isa berkata; \"Sesungguhnya Allah memerintahkanku lima kalimat agar aku amalkan dan aku perintahkan kalian untuk mengamalkannya, pertama; sembahlah Allah dan jangan menyekutukanNya dengan sesuatu pun, sesungguhnya perumpamaan orang yang menyekutukan Allah sama seperti seseorang membeli budak dengan uang emas atau perak lalu ia berkata; Ini rumahku dan ini pekerjaanku, bekerjalah dan tunaikan untukku. Tapi budak itu malah bekerja dan menunaikan untuk orang lain, siapa di antara kalian yang mau budaknya seperti itu? Sesungguhnya Allah memerintahkan shalat pada kalian, bila kalian shalat, maka janganlah menoleh, karena Allah menghadapkankan wajah-Nya ke wajah hambaNya saat shalat, selama ia tidak menoleh. Aku memerintahkan kalian puasa, dan perumpamaannya seperti seseorang berada di tengah-tengah sekelompok orang, ia membawa kantong berisi minyak kesturi, kalian semua kagum atau semerbak baunya mengagumkan, seseungguhnya bau (mulut) orang yang berpuasa lebih harum bagi Allah melebihi minyak kesturi, aku juga memerintahkan kalian bersedekah, perumpamaannya seperti seseorang yang ditawan musuh, mereka membelenggu tangannya ke leher, mereka lalu memajukannya untuk ditebas lehernya, kemudian ia berkata; \"Aku menebusnya dari kalian dengan yang sedikit dan yang banyak, \" lalu tawanan tersebut menebus dirinya dari mereka. Aku memerintahkan kalian untuk mengingat Allah, sesungguhnya perumpamaannya seperti seseorang yang dikejar musuh dengan cepat, hingga ketika tiba di benteng yang kokoh, ia menjaga dirinya dari mereka, demikian halnya hamba, ia tidak menjaga diri dari setan kecuali dengan mengingat Allah.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Dan aku memerintahkan lima hal pada kalian yang diperintahkan Allah padaku, yaitu; mendengar, taat, jihad, hijrah dan jama'ah, sebab barangsiapa meninggalkan jama'ah barang sejengkal, maka ia telah melepas tali Islam dari lehernya, kecuali jika ia kembali. Dan barangsiapa menyerukan seruan jahiliyah, maka ia termasuk bangkai neraka jahanam.\" Seseorang bertanya; \"Wahai Rasulullah, meski ia shalat dan puasa?\" Beliau menjawab: \"Meski ia shalat dan puasa, oleh karena itu, serukanlah seruan Allah yang menyebut kalian sebagai kaum muslimin, mu`minin dan hamba-hamba Allah.\" Abu Isa berkata; Hadits ini hasan shahih gharib. Abu Isa berkata; Muhammad bin Isam'il Al Harits Al Asy'ari pernah bertemu Nabi shallallahu 'alaihi wasallam dan ia memiliki hadits lain selain hadits ini. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Dawud Ath Thayalisi] telah menceritakan kepada kami [Aban bin Yazid] dari [Yahya bin Abu Katsir] dari [Zaid bin Sallam] dari [Abu Sallam] dari [Al Harits Al Asy'ari] dari Nabi shallallahu 'alaihi wasallam seperti di atas dengan maksud yang sama.\" Abu Isa berkata; Hadits ini hasan shahih gharib, dan Abu Sallam Al Habasyi namanya adalah Mamthur. [Ali bin Al Mubarak] telah meriwayatkan hadits ini dari [Yahya bin Abu Katsir]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 5
			}
		}
	]
}