{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam pergi menemui Ubay bin Ka'ab, maka Rasulullah shallallahu 'alaihi wasallam memanggil: \"Hai Ubay!\" sementara dirinya tengah mengerjakan shalat, ia menoleh namun tidak menjawab beliau, dan Ubai tetap melanjutkan shalatnya, ia lalu mempercepat shalatnya dan langsung menghampiri Rasulullah shallallahu 'alaihi wasallam, Ubay mengucapkan; \"ASSALAAMU'ALAIKUM, wahai Rasulullah.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"WA 'ALAIKASSALAAM, apa yang menghalangimu, wahai Ubay untuk menjawabku saat aku memanggilmu?\" Ubay menjawab; \"Wahai Rasulullah, aku tadi sedang mengerjakan shalat. Beliau bertanya: \"Apa kau tidak menemukan di antara yang diwahyukan Allah kepadaku agar kalian memenuhi panggilan Allah dan RasulNya bila menyeru kalian untuk sesuatu yang menghidupkan kalian?\" Ubay menjawab; \"Benar, aku tidak akan mengulangi, insya Allah.\" Beliau bersabda: \"Maukah aku ajarkan kepadamu satu surat yang tidak diturunkan di Taurat, Injil dan Zabur, dan dalam al-Qur`an juga tidak ada yang sepertinya?\" Ubay menjawab; \"Tentu, wahai Rasulullah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana kamu membaca saat shalat?\" Perawi berkata; \"Maka Ubay membaca ummul al-Qur`an (Al Fatehah). Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah diturunkan di Taurat, Injil, Zabur dan dalam al-Qur`an seperti itu, sesungguhnya ia adalah tujuh (ayat) yang diulang-ulang dan al-Qur`an yang agung yang diberikan padaku.\" Abu Isa berkata; Hadits ini hasan shahih. Dalam hal ini, ada hadits serupa dari Anas bin Malik dan Abu Sa'id bin Al Mu'alla",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		}
	]
}