{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Isma'il bin Abu Uwais] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Ubaidullah bin Umar] dari [Tsabit Al Bunanni] dari [Anas bin Malik] ia berkata; \"Seorang sahabat Anshar mengimami mereka di Masjid Quba`, setiap kali mengawali untuk membaca surat (setelah al fatihah -pent) dalam shalat, ia selalu memulainya dengan membaca QUL HUWALLAHU AHAD hingga selesai, lalu ia melanjutkan dengan surat yang lain, dan ia selalu melakukannya di setiap rakaat. Lantas para sahabatnya berbicara padanya, kata mereka; \"Kamu membaca surat itu lalu menurutmu itu tidak mencukupimu, hingga kamu melanjutkannya dengan surat yang lain, bacalah surat tersebut atau tinggalkan lalu bacalah surat yang lain!.\" Sahabat Anshar itu berkata; \"Aku tidak akan meninggalkannya, bila kalian ingin aku menjadi imam kalian dengan membacanya, maka aku akan melakukannya dan bila kalian tidak suka, aku akan meninggalkan kalian.\" Sementara mereka menilainya sebagai orang yang paling mulia di antara mereka, maka mereka tidak ingin diimami oleh orang lain. Saat Nabi shallallahu 'alaihi wasallam mendatangi mereka, mereka memberitahukan masalah itu, lalu beliau bersabda: \"Hai fulan, apa yang menghalangimu untuk melakukan yang diperintahkan teman-temanmu dan apa yang mendorongmu membaca surat itu disetiap rakaat?\" ia menjawab; \"Wahai Rasulullah, sesungguhnya aku menyukainya.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya mencintainya akan memasukkanmu ke dalam surga.\" Abu Isa berkata; Hadits ini hasan gharib, shahih dari jalur ini dari hadits 'Ubaidullah bin Umar dari Tsabit. [Mubarak bin Fadlalah] meriwayatkan dari [Tsabit] dari [Anas] bahwa seseorang berkata; \"Wahai Rasulullah, sesungguhnya aku menyukai surat ini, yaitu QUL HUWALLAAHU AHAD.\" Beliau bersabda: \"Sesungguhnya mencintainya akan memasukkanmu ke dalam surga.\" Telah menceritakan kepada kami [Abu Dawud Sulaiman bin Al Asy'ats] seperti itu, telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Mubarak bin Fadlalah] seperti ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 27
			}
		}
	]
}