{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Bisyr bin As Suri] telah menceritakan kepada kami [Sufyan] dari ['Alqamah bin Martsad] dari [Abu Abdurrahman As Sulami] dari [Utsman bin Affan] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kalian atau seutama-utama kalian adalah yang belajar al Qur'an dan mengajarkannya.\" Abu Isa berkata; Hadits ini hasan shahih. Seperti itulah [Abdurrahman bin Mahdi] dan lainnya meriwayatkan dari [Sufyan Ats Tsauri] dari ['Alqamah bin Martsad] dari [Abu Abdurrahman] dari [Utsman] dari Nabi shallallahu 'alaihi wasallam. Sufyan tidak menyebutkan; \"Dari Sa'd bin 'Ubaidah. [Yahya bin Sa'id Al Qaththan] meriwayatkan hadits ini dari [Sufyan] dan [Syu'bah] dari ['Alqamah bin Martsad] dari [Sa'd bin 'Ubaidah] dari [Abu Abdurrahman] dari [Utsman] dari Nabi shallallahu 'alaihi wasallam. Telah menceritakan kepada kami [Muhammad bin Basyar] seperti itu, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dan [Syu'bah]. Muhammad bin Basyar berkata; Seperti itu yang disebutkan Yahya bin Sa'id dari Sufyan dan Syu'bah bukan hanya sekali, dari 'Alqmah bin Martsad dari Sa'ad bin 'Ubaidah dari Abu Abdurrahman dari Utsman dari Nabi shallallahu 'alaihi wasallam. Muhammad bin Basyar dan sahabat-sahabat Sufyan tidak menyebutkan; \"Dari Sufyan dari Sa'ad bin 'Ubaidah.\" Muhammad bin Basyar berkata; \"Itu lebih shahih.\" Abu Isa berkata; \"Syu'bah menambahkan Sa'ad bin Ubaidah dalam sanadnya hadits ini, sepertinya hadits Sufyan lebih shahih.\" Ali bin Abdullah berkata; Yahya bin Abu Sa'id berkata; Menurutku, tidak ada seorang pun yang menyamai Syu'bah, namun apabila Sufyan berbeda pandangan dengannya, aku mengambil perkataan Sufyan.\" Abu Isa berkata; Aku mendengar Abu 'Ammar meriwayatkan dari Waki', ia berkata; Syu'bah berkata; Sufyan lebih hafal dariku, dan hadits yang diceritakan padaku oleh Sufyan dari seseorang, lalu aku tanyakan padanya melainkan aku temukan seperti yang ia ceritakan kepadaku. Dalam hal ini ada hadits serupa dari Ali dan Sa'd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 34
			}
		}
	]
}