{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2953,
			"arabicnumber": 2953,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa shalat tanpa membaca ummul Qur'an (Al Fatihah), maka shalatnya kurang, shalatnya kurang, dan tidak sempurna.\" Abu Al Ala` berkata; Aku berkata; \"Hai Abu Hurairah, aku terkadang shalat di belakang imam.\" Abu Hurairah berkata; \"Hai Ibnu Al Farisi, bacalah sendiri, aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala berfirman: Aku membagi shalat antara Aku dan hambaKu menjadi dua bagian, separuhnya untukKu dan separuhnya untuk hambaKu, dan hambaKu berhak mendapat yang ia meminta. Bila seorang hamba membaca ALHAMDULILLAAHI RABBIL 'AALAMIIN, Allah Tabaraka wa Ta'ala berfirman; HambaKu memujiKu. Bila hamba membaca \"ARRAHMAANIRRAHIIM, \" Allah Tabaraka wa Ta'ala berfirman: \"HambaKu memujaku.\" Bila hamba membaca \"MAALIKI YAWMIDDIIN, \" Allah Tabaraka wa Ta'ala berfirman: \"HambaKu mengagungkanKu, dan ini untukKu, antara Aku dan hambaKu; IYYAAKA NA'BUDU WA IYYAAKA NASTA'IIN dan akhir surat untuk hambaKu dan hambaKu berhak mendapatkan yang ia minta, ia membaca: IHDINASH SHIRAATHAL MUSTAQIIM SHIRAATHAL LADZIINA AN'AMTA 'ALAIHIM GHARIL MAGHDLUUBI 'ALAIHIM WALADL DLAALLIIN.\" Abu Isa berkata; Hadits ini hasan. [Syu'bah], [Isma'il bin Ja'far] dan lainnya meriwayatkan dari [Al Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini. [Ibnu Juraij] dan [Malik bin Anas] meriwayatkan dari [Al Ala` bin Abdurrahman] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti ini. Telah mengabarkan kepada kami yang demikian itu [Muhammad bin Yahya] dan [Ya'qub bin Sufyan Al Farisi], keduanya berkata; telah menceritakan kepada kami [Isma'il bin Abu Uwais] dari [Ayahnya] dari [Al Ala` bin Abdurrahman] telah menceritakan kepadaku [Ayahku] dan [Abu As Sa`ib] bekas budak Hisyam bin Zuhrah, keduanya adalah teman Abu Hurairah, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa shalat tanpa membaca ummul Qur'an (Al Fatihah) maka shalatnya kurang, dan tidak sempurna.\" Tidak disebutkan dalam hadits Isamil bin Abu Uwais lebih dari matan itu, dan aku bertanya kepada Abu Zur'ah tentang hadits ini, ia menjawab; \"Kedua hadits itu shahih.\" Lalu ia berhujah dengan hadits Ibnu Abu Uwais dari Ayahnya dari Al Ala",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2953.2,
			"arabicnumber": 2953.2,
			"text": "Telah mengabarkan kepada kami ['Abd bin Humaid] telah mengabarkan kepada kami [Abdurrahman bin Sa'd] telah memberitakan kepada kami ['Amru bin Abu Qais] dari [Simak bin Harb] dari ['Abbad bin Hubaisy] dari [Adi bin Hatim] ia berkata; Aku datang menemui Rasulullah shallallahu 'alaihi wasallam, ketika ituu beliau tengah duduk di masjid, orang-orang berkata; \"Ini Adi bin Hatim.\" Aku datang tanpa jaminan keamanan ataupun surat. Saat aku diserahkan kepada beliau, beliau meraih tanganku, sebelum itu, beliau pernah bersabda; \"Sesungguhnya aku sangat berharap agar Allah meletakkan tangannya di tanganku.\" Adi berkata; \"Beliau berdiri, lalu seorang wanita bersama anaknya menemui beliau, Keduanya berkata; \"Kami ada perlu dengan anda.\" Maka beliau berdiri bersama keduanya, hingga beliau menuntaskan keperluan mereka berdua, setelah itu beliau meraih tanganku hingga beliau membawaku ke kediaman beliau, seorang budak menatakan bantal untuk beliau, beliau duduk dan aku duduk di hadapan beliau. Beliau memuja dan memuji Allah, selanjutnya beliau bertanya: \"Apa yang membuatmu benci untuk mengucapkan LAA ILAAHA ILLALLAAH, apa kamu tahu ada ilah selain Allah?\" aku menjawab; \"Tidak.\" selanjutnya beliau berbicara sesaat, lalu bersabda: \"Sesungguhnya kamu hanya takut mengucapkan ALLAAHU AKBAR dan kamu tahu bahwa ada sesuatu yang lebih besar dari Allah.\" Adi berkata; Aku menjawab; \"Tidak.\" Beliau bersabda: \"Sesungguhnya Yahudi dimurkai sedangkan Nasrani sesat.\" Adi berkata; Aku menjawab; \"Aku datang dalam keadaan muslim.\" Adi berkata; Lalu aku melihat wajah beliau lapang karena gembira, lalu beliau memerintahkan seseorang untuk membawaku, selanjutnya aku ditempatkan di rumah salah seorang Anshar. Di kedua penghujung siang, aku mendatangi beliau. Pada suatu sore, aku berada di dekat beliau, tiba-tiba sekelompok kaum berpakaian wool yamg bergaris mendatangi beliau. Adi berkata; \"Lalu beliau shalat, berdiri lalu menganjurkan mereka (untuk bersedekah), setelah itu beliau bersabda: \"Meski dengan satu sha', setengah sha', segenggam dan sedikit genggaman salah seorang di antara kalian menjaga wajahnya dari panasnya jahanam atau neraka, meski dengan satu kurma, meski dengan secuil kurma, sesungguhnya salah seorang dari kalian akan bertemu Allah dan ada yang berkata padanya seperti yang aku katakan pada kalian; \"Bukankah Aku telah membuatkan pendengaran dan penglihatan untukmu?\" Ia menjawab; \"Benar.\" Dia bertanya: \"Bukankah Aku telah memberikan harta dan anak untukmu?\" Ia menjawab: \"Benar.\" Dia bertanya: \"Mana (kebaikan) yang kau lakukan untuk dirimu?\" lalu ia melihat ke belakang, depan, kanan dan kirinya, tapi tidak menemukan apa pun yang menjaga wajahnya dari panasnya jahanam. Hendaklah salah seorang dari kalian menjaga wajahnya dari neraka meski dengan secuil kurma, bila ia tidak punya, maka dengan tutur kata yang baik, sesungguhnya aku tidak mengkhawatirkan kemiskinan pada kalian karena Allah penolong kalian dan pemberi kalian, hingga wanita berada dalam sekedup berjalan antara Yatsrib dan Hairah atau lebih jauh, tanpa rasa takut barang bawannya di curi.\" Adi berkata; Aku berkata dalam hati; \"Lalu dimana pencuri-pencuri Thayyi`? Abu Isa berkata; Hadits ini hasan gharib, kami hanya mengetahuinya dari hadits Simak bin Harb. [Syu'bah] meriwayatkan dari [Simak bin Harb] dari ['Abbad bin Hubaisy] dari [Adi bin Hatim] dari Nabi shallallahu 'alaihi wasallam secara panjang lebar. Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basyar] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari ['Abbad bin Hubaisy] dari [Adi bin Hatim] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Yahudi dimurkai dan Nasrani sesat.\" Kemudian ia menyebut hadits secara panjang lebar",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}