{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 303,
			"arabicnumber": 303,
			"text": "telah menceritakan kepada kami [Muhammad bin Basysyar] berkata; telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] berkata; telah menceritakan kepada kami [Ubaidullah bin Umar] berkata; telah mengabarkan kepadaku [Sa'id bin Abu Sa'id] dari [Ayahnya] dari [Abu Hurairah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam masuk ke dalam masjid. Lalu masuklah seorang laki-laki dan mengerjakan shalat, setelah itu ia datang seraya mengucapkan salam kepada Nabi shallallahu 'alaihi wasallam. Beliau lalu menjawab salamnya dan bersabda: \"Kembali dan shalatlah, sesungguhnya engkau belum shalat!\" lalu laki-laki itu kembali dan shalat sebagaimana yang ia lakukan, setelah itu ia datang dan mengucapkan salam kepada Nabi shallallahu 'alaihi wasallam. Beliau lalu menjawab salamnya, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada: \"Kembali dan shalatlah, sesungguhnya engkau belum shalat!\" hingga laki-laki itu mengulanginya sampai tiga kali, setelah itu ia berkata kepada Rasulullah, \"Demi Dzat yang mengutusmu dengan kebenaran, aku tidak bisa shalat dengan baik kecuali seperti ini, untuk itu ajarilah aku!\" beliau pun bersabda: \"Jika engkau berdiri shalat, maka bertakbirlah. Setelah itu bacalah Al Qur`an yang mudah kamu baca, lalu rukuklah dengan tuma'ninah (tenang) dan berdiri lagi hingga benar-benar tegak. Setelah itu sujudlah dengan tuma'ninah dan bangun (duduk) hingga benar-benar tegak. Lakukanlah seperti itu pada semua shalatmu.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. Ia berkata; \" [Ibnu Numair] juga telah meriwayatkan hadits ini dari [Ubaidullah bin Umar] dari [Sa'id Al Maqburi] dari [Abu Hurairah] hanya saja di dalamnya ia tidak menyebutkan dari Abu Hurairah. Dan riwayat Yahya bin Sa'id dari Abdullah bin Umar lebih shahih. Sedangkan Sa'id Al Maqburi telah mendengar hadits ini dari Abu Hurairah, ia meriwayatkan dari ayahnya, dari Abu Hurairah.\" Nama Abu Sa'id Al Maqburi adalah Kaisan. Dan Sa'id Al Maqburi dijuluki dengan nama Abu Sa'd. Kaisan dahulu adalah termasuk budak mereka yang memerdekakan dirinya (dengan menebus)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 155
			}
		}
	]
}