{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3048,
			"arabicnumber": 3048,
			"text": "Telah menceritakan kepada kami [Bundar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Ali bin Badzimah] dari [Abu Ubaidah] ia berkata; Rasulullah Shallallahu 'alahi wasallam bersabda: \"Ketika Bani Israil ditimpa kekurangan, salah seorang di antara mereka melihat saudaranya melakukan dosa, lalu ia mencegahnya, akan tetapi keesokan harinya ia tidak melarang dari apa yang telah dilihatnya (kemarin), bahkan ia menemaninya makan, minum, dan bergaul. Lalu Allah mencampur adukkan hati mereka satu sama lain, dan Allah menurunkan ayat tentang mereka: Telah dila'nati orang-orang kafir dari Bani Israil dengan lisan Daud dan 'Isa putra Maryam. Yang demikian itu, disebabkan mereka durhaka dan selalu melampaui batas Beliau membaca hingga sampai firmanNya: Sekiranya mereka beriman kepada Allah, kepada nabi (Musa) dan kepada apa yang diturunkan kepadanya (Nabi), niscaya mereka tidak akan mengambil orang-orang musyrikin itu menjadi penolong-penolong, tapi kebanyakan dari mereka adalah orang-orang yang fasik. QS Al Ma`idah; 78-81. Rasulullah Shallallahu 'alahi wasallam yang tadinya bersandar, kemudian beliau duduk dan bersabda: \"Tidak, (kalian tidak akan luput dari apa yang mereka alami) sehingga kalian mangarahkan orang dzalim lalu kalian benar-benar membelokkannya di atas kebenaran.\" Telah menceritakan kepada kami [Bundar] telah menceritakan kepada kami [Abu Dawud Ath Thayalisi] dan ia mengimlakkannya kepadaku. Telah menceritakan kepada kami [Muhammad bin Muslim bin Abu Al Wadlah] dari [Ali bin Badzimah] dari [Abu 'Ubaidah] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 100
			}
		}
	]
}