{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3049,
			"arabicnumber": 3049,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengabarkan kepada kami [Muhammad bin Yusuf] telah mengabarkan kepada kami [Isra`il] telah menceritakan kepada kami [Abu Ishaq] dari ['Amru bin Syurahbil Abu Maisarah] dari [Umar bin Al Khaththab] ia berdoa; \"Ya Allah, berilah kami penjelasan tentang khamer dengan penjelasan yang memadai.\" Lalu turunlah ayat yang ada dalam surat Al Baqarah; Mereka bertanya kepadamu tentang khamer dan judi. QS Al Baqarah: 219, lalu Umar dipanggil dan dibacakan kepadanya. Setelah itu ia berdoa; \"Ya Allah, berilah kami penjelasan tentang khamer dengan penjelasan yang memadai.\" Lalu turunlah ayat yang ada dalam surat An Nisa` Hai orang-orang yang beriman, janganlah kamu mendekati shalat sedang kamu mabuk QS An Nisa`: 43. Selanjutnya ia berdoa; \"Ya Allah, berilah kami penjelasan tentang khamer dengan penjelasan yang memadai.\" Lalu turunlah ayat yang ada dalam surat Al Mai`idah Sesungguhnya syaitan itu bermaksud hendak menimbulkan permusuhan dan kebencian di antara kamu lantaran (meminum) khamar dan berjudi itu, -sampai firmanNya- maka berhentilah kamu (dari mengerjakan pekerjaan itu) QS Al Ma`idah: 91. Umar lalu berkata; \"Kami berhenti, kami berhenti.\" Abu Isa berkata; Hadits ini juga diriwayatkan dari Isra`il secara mursal. Telah menceritakan kepada kami [Muhammad bin Al Ala`] telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Abu Ishaq] dari [Abu Maisarah 'Amru bin Syurahbil] bahwa [Umar bin Al Khaththab] berkata; \"Ya Allah, Ya Allah, berilah kami penjelasan tentang khamar dengan penjelasan yang memadai.\" Lalu ia menyebutkan seperti di atas, namun hadits ini lebih shahih dari hadits Muhammad bin Yusuf",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 101
			}
		}
	]
}