{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3075,
			"arabicnumber": 3075,
			"text": "Telah menceritakan kepada kami [Al Ashari] telah menceritakan kepada kami [Ma'an] telah menceritakan kepada kami [Malik bin Anas] dari [Zaid bin Abu Unaisah] dari [Abdulhamid bin Abdurrahman bin Zaid bin Al Khathtahab] dari [Muslim bin Yasar Al Juhani] bahwa [Umar bin Al Khaththab] pernah ditanya tentang ayat \"Dan (ingatlah), ketika Rabbmu mengeluarkan keturunan anak-anak Adam dari sulbi mereka dan Allah mengambil kesaksian terhadap jiwa mereka (seraya berfirman): 'Bukankah Aku ini Rabbmu? ' Mereka menjawab: 'Betul (Engkau Rabb kami), kami menjadi saksi.' (Kami lakukan yang demikian itu) agar di hari kiamat kamu tidak mengatakan: 'Sesungguhnya kami (bani Adam) adalah orang-orang yang lengah terhadap ini (keesaan Rabb).\" (Al A'raaf: 172) Umar berkata: Saya mendengar Rasulullah Shallallahu 'alaihi wa Salam pernah ditanya tentangnya lalu beliau menjawab: \"Sesungguhya Allah menciptakan Adam kemudian Dia mengusap punggungnya dengan tangan kananNya lalu mengeluarkan keturunan, setelah itu berfirman: 'Aku ciptakan mereka semua untuk (menghuni) surga dan dengan amalan ahli surga.' Kemudian Ia usap punggungnya, maka keluarlah keturunan darinya, setelah itu Ia berfirman: 'Aku ciptakan mereka untuk (menghuni) neraka dan dengan amalan ahli neraka'.\" Lalu ada orang yang bertanya: Wahai Rasulullah, kalau demikian apa gunanya beramal? beliau menjawab: \"Sesungguhnya Allah jika menciptakan hamba sebagai ahli surga, ia akan dituntun olehNya untuk beramal dengan amal ahli surga sampai mereka mati dalam keadaan demikian lalu Allah memasukannya ke surga. Sedangkan jika Dia menciptakan hamba itu sebagai ahli neraka, ia akan dituntun olehNya untuk beramal dengan amal ahli neraka sampai mereka mati dalam keadaan demikian lalu Allah memasukannya ke dalam neraka.\" Abu Isa berkata: Hadits ini hasan. Muslim bin Yasar tidak mendengar dari Umar. Sebagaian dari mereka menyebutkan seseorang yang tidak diketahui dalam sanad ini antara Muslim bin Yasar dan Umar",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 127
			}
		}
	]
}