{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3097,
			"arabicnumber": 3097,
			"text": "Telah menceritakan kepada kami [Abdu bin Humaid] telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'ad] dari [ayahnya] dari [Muhammad bin Ishaq] dari [Az Zuhri] dari [Ubaidullah bin Abdullah bin Utbah] dari [Ibnu Abbas] berkata: Saya pernah mendengar [Umar bin Al Khaththab] berkata: Pada hari kematian Abdullah bin Ubbai bin Salul, Rasulullah Shallallahu 'alaihi wa Salam dipanggil untuk menshalatinya, beliau berdiri namun tatkala beliau hendak shalat, aku beranjak dan berdiri didepan beliau: Wahai Rasulullah apakah engkau hendak menshalati musuh Allah Abdulllah bin Ubbai yang telah banyak melontarkan ucapan-ucapan menyakitkan semasa hidupnya? Rasulullah Shallallahu 'alaihi wa Salam pada saat itu hanya tersenyum dan setelah aku tanya beliau berulang-ulang, beliau mengatakan: \"Biarkan aku wahai Umar karena telah diberi pilihan dan aku akan memilih. Sungguh telah datang (wahyu) kepadaku: 'Kamu memohonkan ampun bagi mereka atau tidak kamu mohonkan ampun bagi mereka (adalah sama saja). Kendatipun kamu memohonkan ampun bagi mereka tujuh puluh kali, namun Allah sekali-kali tidak akan memberi ampunan kepada mereka. (At Taubah: 80) seandainya dengan memohon ampunan lebih dari tujuhpuluh kali ia akan diampuni, maka aku akan melakukannya.\" Beliau menshalati dan mengantarnya, lalu beliau berdiri didepan kuburnya, setelah beliau selesai, aku merasa heran pada keberanianku terhadap Rasulullah Shallallahu 'alaihi wa Salam. Allah dan RasulNya lebih mengetahui, tetapi tidak lama berselang, turunlah ayat ini: \"Dan janganlah kamu sekali-kali menyembahyangkan (jenazah) seorang yang mati di antara mereka, dan janganlah kamu berdiri (mendo'akan) di kuburnya.\" (At Taubah: 84) Abu Isa mengatakan bahwa hadits ini hasan shahih gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 149
			}
		}
	]
}