{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3115,
			"arabicnumber": 3115,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengkhabarkan kepada kami [Yazid bin Harun] telah mengkhabarkan kepada kami [Qais bin Ar Rabi'] dari [Utsman bin Abdullah bin Mauhab] dari [Musa bin Thalhah] dari [Abu Al Yasar] berkata: Seorang wanita datang kepadaku seraya menjual kurma, aku berkata: Di rumah ada kurma yang lebih baik darinya. Wanita itu masuk rumah bersamaku lalu aku meraihnya, aku menciumnya lalu aku mendatangi Abu Bakar dan menyebutkan hal itu. Abu Bakar berkata: Tutupilah (aib) dirimu, bertaubatlah dan jangan beritahukan pada siapa pun. Aku tidak sabar, lalu aku mendatangi Umar dan menyebutkan hal itu padanya. Umar berkata: Tutupilah (aib) dirimu, bertaubatlah dan jangan beritahukan pada siapa pun. Aku tidak sabar lalu aku mendatangi Rasulullah Shallallahu 'alaihi wa Salam lalu aku memberitahukannya kepada beliau, beliau bersabda: \"Apa kau mengkhianati istri orang yang tengah berperang di jalan Allah?\" hingga ia berharap belum masuk Islam kecuali pada saat itu, hingga ia mengira termasuk penghuni neraka. Rasulullah Shallallahu 'alaihi wa Salam terdiam selang berapa lama hingga Allah mewahyukan pada beliau: \"Dan dirikanlah sembahyang itu pada kedua tepi siang (pagi dan petang) dan pada bahagian permulaan daripada malam\" hingga firmanNya: \"Peringatan bagi orang-orang yang mengingat.\" (Huud: 114-115) Abu Al Yasar berkata: Aku mendatangi beliau lalu Rasulullah Shallallahu 'alaihi wa Salam membacakannya padaku kemudian para sahabat beliau berkata: Wahai Rasulullah, apakah untuk dia saja ataukah untuk seluruh manusia? Beliau menjawab: Untuk seluruh manusia.\" Abu Isa berkata: Hadits ini hasan shahih gharib. Qais bin Ar Rabi' dilemahkan oleh Waki' dan lainnya. Abu Al Yasar adalah Ka'ab bin Amru. Abu Isa berkata: [Syarik] meriwayatkan hadits ini dari [Utsman bin Abdullah] seperti riwayat Qais bin Ar Rabi'. Abu Isa berkata: Dalam hal ini ada hadits serupa dari Abu Umamah, Watsilah bin Al Asqa' dan Anas bin Malik",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 167
			}
		}
	]
}