{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3116,
			"arabicnumber": 3116,
			"text": "Telah menceritakan kepada kami [Al Husain bin Huraits Al Khuza'I Al Marwazi] telah menceritakan kepada kami [Al Fadll bin Musa] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Bahwa al Kariim (orang mulia) bin Al Karim bin al Karim bin al Karim adalah Yusuf bin Ya'qub bin Ishaq bin Ibrahim.\" Beliau bersabda: \"Seandainya aku tinggal di penjara sebagaimana yang dialami Yusuf, kemudian datang utusan padaku maka aku kujawab, lalu beliau bacakan ayat: 'Kembalilah kepada tuanmu dan tanyakanlah kepadanya bagaimana halnya wanita-wanita yang telah melukai tangannya?\" (Yusuf: 50) dan rahmat Allah atas Luth ketika ia hendak berlindung kepada keluarga yang kuat, ia berkata: \"Seandainya aku mempunyai kekuatan (untuk menolakmu) atau kalau aku dapat berlindung kepada keluarga yang kuat (tentu aku lakukan).\" (Huud: 80) dan Allah tidak mengutus seorang Nabi setelahnya kecuali dari keturunan teratas kaumnya. Abu Kuraib menceritakan pada kami, dari Abdah dan Abdurrahim dari Muhammad bin Amru seputar haditsnya Fadll bin Musa, ia berkata: Allah tidak mengutus seorang nabi setelahnya melainkan dari keturunan terbesar dari kaumnya. Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abdah] dan [Abdurrahim] dari [Muhammad bin Amru] seperti hadits Al Fadll bin Musa hanya saja ia menyebut: Tidaklah Allah mengutus seorang nabi pun setelahnya kecuali dari kaumnya yang terbanyak. Muhammad bin Amru berkata: Tsarwah artinya banyak dan kuat. Abu Isa berkata: Ini lebih shahih dari riwayat Al Fadll bin Musa dan hadits ini hasan",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 168
			}
		}
	]
}