{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3153,
			"arabicnumber": 3153,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan lainnya, maknanya sama sedangkan teksnya milik Ibnu Basyar, mereka berkata: Telah menceritakan kepada kami [Hisyam bin Abdul Malik] telah menceritakan kepada kami [Abu Awanah] dari [Qatadah] dari [Abu Rafi'] dari hadits [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam tentang dinding (yang dibangun Dzulqarnain) beliau bersabda: \"Setiap hari mereka (Ya`juj dan Ma`juj) menggalinya, sehingga ketika dinding itu hampir mereka menembusnya, pemimpinnya mengatakan: Sekarang pulanglah kalian, karena esok hari kalian pasti bisa menembusnya! tetapi Allah mengembalikannya seperti semula. dan keesokan harinya, ketika Allah hendak mengutus mereka kepada manusia, pemimpin mereka berkata: Sekarang pulanglah kalian, karena esok hari kalian akan merobohkannya jika Allah menghendaki\" ia mengucapkan insya Allah.\" Beliau bersabda: \"Pulanglah mereka dan mendapatinya seperti keadaanya semula saat mereka tinggalkan lalu mereka merobohkannya dan menyerang orang-orang, lalu mereka meminum air dan berlarilah orang-orang menghindari mereka, mereka pun melepaskan anak panah ke langit dan seketika itu juga panah tersebut berlumuran darah. Lantas mereka berkata: \"Kita telah menaklukan penduduk bumi dan menguasai yang berada di langit secara paksa.\" Lalu Allah mengirim ulat pada tengkuk mereka, demi Dzat yang jiwaku ada dalam tangannya, sesungguhnya hewan-hewan bumi menjadi gemuk, gesit dan sangat berterima kasih karena daging-daging mereka.\" Abu Isa berkata: Hadits ini hasan gharib, kami hanya mengetahuinya dari sanad ini seperti ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 205
			}
		}
	]
}