{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3165,
			"arabicnumber": 3165,
			"text": "Telah menceritakan kepada kami [Mujahid bin Musa Al Baghdadi] dan [Al Fadll bin Sahal Al A'raj Baghdadi] dan lainnya, mereka berkata: Telah menceritakan kepada kami [Abdurrahman bin Ghazwan Abu Nuh] telah menceritakan kepada kami [Al Laits bin Sa'ad] dari [Malik bin Anas] dari [Az Zuhri] dari [Urwah] dari [Aisyah] bahwa seseorang duduk di depan Nabi Shallallahu 'alaihi wa Salam lalu berkata: Wahai Rasulullah, sesungguhnya saya memiliki dua orang budak mereka mendustai dan mengkhianati saya, mereka juga membangkang terhadap (perintah) saya, lalu saya umpat dan saya pukul mereka apakah saya berdosa kepada mereka? beliau menjawab \"Pengkhianatan, pembangkangan, dan kedustaan mereka terhadapmu, juga hukumanmu atas mereka, semua itu ada perhitungannya. Jika hukumanmu sebanding dengan kesalahan mereka, maka impaslah urusanmu dengannya. Tapi jika hukumanmu lebih ringan dibanding kesalahan mereka, maka kamu mendapat keutamaan. Namun jika hukuman yang kamu timpakan kepada mereka lebih berat dibanding kesalahan mereka, maka merekalah yang akan mendapat keutamaan darimu sebagai qishash.\" ia berkata; lalu menyesallah lelaki itu kemudian ia menangis dan berteriak lalu Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidakkah engkau membaca kitab Allah: 'Kami akan memasang timbangan yang tepat pada hari kiamat, maka tiadalah seseorang dirugikan barang sedikitpun.\" (Al Anbiyaa`: 47) lelaki itu berkata: Wahai Rasulullah, demi Allah, tidak ada sesuatu yang lebih baik bagi saya kecuali dengan memerdekakan mereka. Karena itu saksikanlah bahwa mereka semua saya merdekakan.\" Abu Isa mengatakan bahwa hadits ini gharib, kami hanya mengetahuinya dari hadits Abdurrahman bin Ghazwan. [Ahmad bin Hambal] meriwayatkan hadits ini dari [Abdurrahman bin Ghazwan]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 217
			}
		}
	]
}