{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3168,
			"arabicnumber": 3168,
			"text": "Bismillaahirrahmaanirrahiim. Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibnu Jud'an] dari [Al Hasan] dari [Imran bin Hushain] saat turun ayat: \"Hai manusia, bertakwalah kepada Tuhanmu; Sesungguhnya kegoncangan hari kiamat itu adalah suatu kejadian yang sangat besar (dahsyat), \" hingga \"Akan tetapi azab Allah itu sangat kerasnya.\" (Al Hajj: 1-2), ayat ini turun saat beliau berada dalam perjalanan. Beliau bertanya: \"Tahukah kalian, hari apa itu?\" mereka menjawab: Allah dan RasulNya lebih tahu. Beliau bersabda: \"Itulah hari ketika Allah berfirman kepada Adam: Utuslah utusan-utusan ke neraka. Adam bertanya: Wahai Rabb, apa maksud utusan-utusan ke nereka? Allah menjawab: sembilanratus sembilanpuluh sembilan orang masuk neraka sedangkan satu orang masuk surga.\" Kaum muslimin pun menangis lalu Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Beramallah istiqomah, dan usahakanlah untuk benar, karena tidak ada kenabian pun melainkan jahiliyah pasti ada dihadapannya, lalu diambillah bilangan kejahiliyahan, bila selesai (itulah yang terbaik), dan bila tidak selesai disempurnakan dari kaum munafik. Tidaklah perumpamaan kalian dengan ummat-ummat lain kecuali seperti tanda yang ada di lengan binatang (unta) atau seperti tahi lalat disisi unta.\" Lalu beliau bersabda: \"Sesungguhnya aku berharap kalian menjadi seperempat penghuni surga.\" Mereka bertakbir. Setelah itu beliau bersabda: \"Sesungguhnya aku berharap kalian menjadi sepertiga penghuni surga.\" Mereka bertakbir. Imran berkata: Aku tidak tahu apakah beliau menyebut dua pertiga atau tidak. Abu Isa berkata: Hadits ini hasan shahih. Diriwayatkan melalui sanad lain dari Al Hasan dari Imran bin Hushain dari nabi Shallallahu 'alaihi wa Salam",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 220
			}
		}
	]
}