{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3180,
			"arabicnumber": 3180,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin Urwah] telah mengkhabarkan kepadaku [ayahku] dari [Aisyah] berkata: Saat perihalku disebut sedemikian rupa dan aku tidak mengetahuinya, Rasulullah Shallallahu 'alaihi wa Salam berdiri berkhutbah dihadapanku, beliau membaca kalimat syahadat dan bertahmid dengan tahmid yang layak bagiNya, setelah itu beliau bersabda: \"Hadirin semua, berilah aku saran-saran tentang orang-orang yang menuduhkan keburukan pada keluargaku (maksud beliau 'Aisyah), demi Allah aku tidak mengetahui suatu keburukan pun atas keluargaku, dan mereka tuduhkan keburukan kepada orang yang demi Allah aku tidak mengetahui suatu keburukan pun atasnya (maksud beliau Shafwan bin Mu'aththal). Ia (Shafwan) tidak masuk rumahku sama sekali melainkan aku ada dan tidaklah aku pergi dalam suatu perjalanan melainkan ia (Shfawan) pergi berasamaku. Sa'ad bin Mu'adz radliallahu 'anhu berdiri lalu berkata: Wahai Rasulullah, izinkan aku menebas leher mereka. Seseorang dari bani Khajraj lantas berdiri, yang ibu Hassan bin Tsabit berasal dari kabilah orang tersebut, ia berkata: \"Kau dusta, demi Allah, bila meraka dari Aus, tentu tidak kau tebas leher-leher mereka.\" Hingga nyaris terjadi suatu keburukan antara Aus dan Khajraj di masjid dan aku tidak mengetahuinya. Sore harinya, dan masih hari itu juga, aku (Aisyah) pergi untuk suatu keperluan bersama Ummu Misthah, rupanya ia terpeleset lalu berkata: Celakalah Misthah. Aku berkata padanya: Hai ibu, kau mencela anakmu? Ia diam lalu terpeleset lagi, ia berkata: Celakalah Misthah, lalu aku membentaknya, aku berkata padanya: Hai ibu, kau mencela anakmu. Ia berkata: Demi Allah, aku tidak mencelanya kecuali berkenaan dengan kasus mu. Aku bertanya: Tentang apa? Ia menjawab lalu membeberkan masalahnya padaku. Aku bertanya: Sudah terjadi? Ia menjawab: Ya, demi Allah. Aku kembali pulang ke rumah, seolah-olah keperluan yang aku tuju tidak ada artinya, aku tidak mendapatkannya sedikit atau banyak, aku terserang panas. Aku berkata kepada Rasulullah Shallallahu 'alaihi wa Salam: Pulangkan aku ke rumah ayahku. Beliau mengirimku bersama seorang budak, aku masuk rumah lalu aku lihat Ummu Ruman tengah berada di bawah sementara Abu Bakar berada di atas rumah tengah membaca (al-Qur`an). Ibuku bertanya: Ada apa kau datang, wahai putriku? Aisyah berkata: Lalu aku memberitahukan kisah itu padanya ternyata ia belum mendengar seperti yang telah aku dengar. Ia berkata: Wahai putriku, ringankan kondisimu karena sesungguhnya demi Allah amat jarang sekali seorang wanita cantik yang diperistri seseorang yang punya madu dan ia cintai melainkan mereka akan hasud padanya dan dituduh bermacam-macam. Ternyata ia belum mendengar seperti yang aku dengar. Aisyah berkata: Aku bertanya: Apa ayahku sudah mengetahuinya? Ia menjawab: Ya. Aku bertanya: Rasulullah Shallallahu 'alaihi wa Salam juga? Ia menjawab: Ya. Aku sedih dan menangis hingga Abu Bakar mendengar suaraku saat ia berada di atas rumah membaca (al-Qur`an). Abu Bakar turun lalu bertanya kepada ibuku: Ada apa dia? Ia menjawab: Ia mendengar berita yang disebut-sebut berkenaan dengan masalahnya. Abu Bakar berlinangan air mata lalu berkata: Aku bersumpah untukmu wahai putriku kecuali kau kembali ke rumahmu. Aku kembali dan Rasulullah Shallallahu 'alaihi wa Salam telah sampai. Beliau bertanya kepada pelayanku tentang aku, pelayanku menjawab: Tidak, demi Allah aku tidak mengetahui keburukan padanya selain ia tidur hingga ada kambing masuk lalu memakan ragi adonan roti atau ragienya. Sebagaian sahabat Rasulullah Shallallahu 'alaihi wa Salam membentaknya lalu berkata: Benarkan Rasulullah Shallallahu 'alaihi wa Salam, hingga mereka mencelanya. Ia berkata: Subhaanallaah, demi Allah aku tidak mengetahui kondisinya kecuali seperti yang diketahui tukang emas atas emas lantak. Berita bohong ini pun terdengar oleh orang yang dituduhkan padanya (Shafwan) lalu ia berkata: Subhaanallaah, demi Allah aku sama sekali tidak pernah membuka pakaian wanita. Aisyah berkata: Ia (Shafwan) mati syahid di jalan Allah. Aisyah berkata: Kedua orang tuaku berada di dekatku, mereka tetap berada di dekatku hingga Rasulullah Shallallahu 'alaihi wa Salam masuk dan beliau usai shalat ashar. Kedua orang tuaku mengelilingku dari kanan dan kiri, nabi Shallallahu 'alaihi wa Salam membaca syahadat dan bertahmid seperti yang layak bagiNya, setelah itu beliau bersabda: \"Wahai Aisyah, bila kau melakukan suatu keburukan atau berbuat zhalim, bertaubatlah kepada Allah karena Allah menerima taubat hamba-hambaNya.\" Aisyah berkata: Seorang wanita Anshar datang dan tengah duduk di pintu, aku berkata: Apa kau tidak malu pada wanita ini dengan menyebut sesuatu. Rasulullah Shallallahu 'alaihi wa Salam kemudian memberikan nasehat lalu aku menoleh ke ayahku, aku berkata: Jawab dia. Abu Bakar bertanya: Apa yang harus aku katakan? Aku menoleh ke ibuku, aku berkata: Jawab dia. Ummu Misthah bertanya: Apa yang harus aku katakan? Saat keduanya tidak menjawab, aku membaca syahadat, aku bertahmid dan memuji dengan pujian yang patut baginya, selanjutnya aku berkata: Ingatlah, demi Allah bila aku katakan pada kalian bahwa aku tidak melakukannya, Allah tahu bahwa aku benar tapi itu tidak ada gunanya bagi kalian, kalian sudah bicara (macam-macam) dan hati kalian telah terasuki. Bila pun aku mengatakan aku telah melakukannya, Allah tahu bahwa aku tidak melakukannya, kalian pasti akan mengatakan bahwa ia telah mengakui perbuatannya, demi Allah tidak memiliki perumpamaan antara aku dan kalian. Aisyah melanjutkan: Aku mencari nama Ya'qub, tapi aku tidak mampu menyebutnya selain Abu Yusuf saat berkata: \"Maka kesabaran yang baik Itulah (kesabaranku) dan Allah sajalah yang dimohon pertolongan-Nya terhadap apa yang kamu ceritakan.\" (Yuusuf: 18) Aisyah meneruskan: Saat itu juga diturunkan wahyu pada Rasulullah Shallallahu 'alaihi wa Salam, kami diam lalu wahyu diangkat dari beliau, kami mengetahui kebahagiaan diwajah beliau, beliau mengusap dahi dan bersabda: \"Khabar gembira wahai Aisyah, Allah telah menurunkan pembebasanmu (berita kesucianmu).\" Aisyah berkata: Saat itu aku sangat marah sekali. Kedua orang tuaku berkata: Hampirilah beliau. Aku berkata: Tidak, demi Allah aku tidak akan menghampiri beliau, aku tidak memujinya dan tidak juga kalian berdua, tapi aku memuji Allah yang telah menurunkan berita kesucianku yang telah kalian sama dengarkan, tidak kalian ingkari dan juga tidak kalian rubah. Aisyah berkata: Zainab binti Jahsy dijaga Allah karena agamanya, ia tidak mengucapkan kata-kata selain kebaikan, sementara saudaranya, Hamnah, ia binasa bersama yang lainnya. Dan yang turut membicarakan khabar bohong (issue dusta) itu adalah Misthah, Hassan bin Tsabit dan si munafik, Abdullah bin Ubai bin Salul, dialah yang memimpin dan memprovokasinya, dialah yang menanggung dosanya diantara mereka, dia bersama Hamnah. Aisyah meneruskan: Abu Bakar bersumpah tidak akan memberi apa pun pada Misthah selamanya lalu Allah menurunkan ayat ini: \"Dan janganlah orang-orang yang mempunyai kelebihan dan kelapangan di antara kamu bersumpah untuk tidak memberi…..\" Hingga akhir ayat (An Nuur: 22) maksudnya Abu Bakar untuk memberi (bantuan) pada kerabat, orang-orang miskin dan muhajirin di jalan Allah. Yang dimaksudkan adalah Misthah, hingga firmanNya: \"Apakah kamu tidak ingin bahwa Allah mengampunimu? dan Allah adalah Maha Pengampun lagi Maha Penyayang.\" (An Nuur: 22) Abu Bakar berkata: Ya, demi Allah wahai Rabb kami, kami ingin Engkau mengampuni kami. Abu Bakar kembali melakukan seperti yang dilakukan semula (memberi infak untuk Mistah). Abu Isa berkata: Hadits ini hasan shahih dari hadits Hisyam bin Urwah. [Yunus bin Yazid], [Ma'mar] dan lainnya juga meriwayatkannya dari [Az Zuhri] dari [Urwah bin Az Zubair], [Sa'id bin Al Musayyib], [Alqamah bin Waqqash Al Laitsi] dan [Ubaidullah bin Abdullah] dari [Aisyah] yang lebih panjang dan lebih lengkap dari hadits Hisyam bin Urwah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 232
			}
		}
	]
}