{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3254,
			"arabicnumber": 3254,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abdul Malik bin Ibrahim Al Juddi] telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dan [Manshur] keduanya mendengar [Abu Adl Dluha] menceritakan dari [Masruq] berkata: Seseorang mendatangi [Abdullah] lalu berkata: Seorang bercerita, ia berkata: Sesungguhnya asap akan muncul dari bumi lalu melenyapkan pendengaran orang-orang kafir dan mencabut nyawa orang mu`min seperti kondisi selesma. Masruq berkata: Ia marah, tadinya bersandar kemudian duduk, setelah itu berkata: Bila salah seorang dari kalian ditanya sesuatu yang ia tahu, beritahulah -Manshur berkata: Hendaklah memberitahukannya- dan bila ditanya tentang sesuatu yang tidak diketahui, hendaklah mengucapkan: Allahu a'lam, karena termasuk ilmu seseorang bila ditanya sesuatu yang tidak diketahui adalah dengan mengucapkan: Allahu a'lam karena Allah Ta'ala berfirman kepada nabiNya: \"Katakanlah (hai Muhammad): \"Aku tidak meminta upah sedikitpun padamu atas dakwahku dan bukanlah aku termasuk orang-orang yang mengada-adakan.\" (Shaad: 86) saat Rasulullah Shallallahu 'alaihi wa Salam melihat kaum Quraisy durhaka, beliau berdoa: ALLOOHUMMA A'INNNII 'ALAIHIM BISAB'I KASAB'I YUUSUF \"Ya Allah, tolonglah aku atas mereka dengan kelaparan seperti kelaparannya Yusuf\" lalu mereka diserang kemarau. Kemarau menyerang segala sesuatu hingga mereka makan kulit dan bangkai -salah seorang mengatakan: tulang- kemudian keluarlah seperti asap (dukhan) dari tanah lalu Abu Sufyan mendatangi beliau, ia berkata: Sesungguhnya kaummu telah binasa, berdoalah kepada Allah untuk kebaikan mereka. Ia berkata: Ini sesuai firmanNya: \"Maka tunggulah hari ketika langit membawa asap (dukhan) yang nyata. Yang meliputi manusia. inilah azab yang pedih.\" (Ad Dukhaan: 10-11) Manshur berkata: Ini sesuai firmanNya: \" (Mereka berdoa): \"Ya Rabb kami, lenyapkanlah dari kami azab itu. Sesungguhnya kami akan beriman.\" (Ad Dukhaan: 10-11) apakah adzab akhirat sudah dilenyapkan? Siksaan, Lizam (kebinasaan) dan asap telah berlalu. Salah seorang dari mereka berkata: Terbelahnya Bulan. Yang lain berkata: Kekalahan Romawi. Abu Isa berkata: Lizam adalah korban perang Badar. Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 306
			}
		}
	]
}