{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3256,
			"arabicnumber": 3256,
			"text": "Telah menceritakan kepada kami [Ali bin Sa'id Al Kindi] telah menceritakan kepada kami [Abu Muhayyah] dari [Abdul Malik bin Umair] dari [Ibnu Akhi Abdullah bin Salam] berkata: Saat Utsman diburu untuk dibunuh, [Abdullah bin Salam] datang lalu Utsman bertanya padanya: Ada perlu apa kau datang? Ia menjawab: Aku datang untuk menolongmu. Utsman berkata: Temuilah orang-orang lalu usirlah mereka dariku karena kau diluar itu lebih baik bagiku dari pada kau didalam. Abdullah bin Salam keluar menemui orang-orang lalu berkata: Wahai sekalian manusia, dulu dimasa jahiliyah aku bernama fulan lalu Rasulullah Shallallahu 'alaihi wa Salam memberiku nama Abdullah, berkenaan denganku turun beberapa ayat kitab Allah, berkenaan dengankulah ayat ini turun: \"Dan seorang saksi bani israil menyatakan kesaksian semisalnya dan ia beriman, namun kalian malah menyombongkan diri, sesungguhnya Allah tidak memberi petunjuk orang-orang yang zhalim (QS. Al-Ahqaf 10) Dan diturunkan karenaku, ayat; \"Katakanlah: 'Cukuplah Allah dan orang yang memiliki pengetahuan tentang al kitab menjadi saksi antara aku dan kamu sekalian.\" (Al Israa`: 96), sesungguhnya Allah memiliki pedang yang disarungkan sehingga tidak menebas kalian, para malaikat telah melindungi kalian di negeri kalian. Inilah pesan-pesan yang karenanya nabi kalian turun. Takutlah kalian kepada Allah dari membunuh nabi ini, Takutlah kalian kepada Allah dari membunuh nabi ini, demi Allah jika kalian membunuhnya niscaya para malaikat akan menghilangkan perlindungan terhadap kalian, dan pedang Allah yang dahulunya disarungkan akan dihunus untuk kalian, dan tidak akan disarungkan lagi hingga hari kiamat. Akhirnya mereka berkata: Bunuhlah si Yahudi dan bunuhlah Utsman. Abu Isa berkata: Hadits ini gharib. [Syu'aib bin Shafwan] meriwayatkannya dari [Abdul Malik bin Umair] dari [Ibnu Muhammad bin Abdullah bin Salam] dari [kakeknya, Abdullah bin Salam]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 308
			}
		}
	]
}