{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3299,
			"arabicnumber": 3299,
			"text": "Telah menceritakan kepada kami [Abdu bin Humaid] serta [Al Hasan bin Ali Al Hulwani] maknanya adalah satu. Mereka berkata; telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Muhammad bin 'Amr bin 'Atho`] dari [Sulaiman bin Yasar] dari [Salamah bin Shakhr Al Anshari], ia berkata; aku adalah seorang laki-laki yang diberi kemampuan untuk melakukan jima' yang tidak diberikan kepada orang selainku. Kemudian setelah Bulan Ramadhan masuk, aku menzhihar isteriku hingga Bulan Ramadhan selesai agar aku tidak menggaulinya pada malam hari. Kemudian aku melakukan hal tersebut berturut-turut hingga mendapati siang hari sementara aku tidak mampu untuk meninggalkan. Kemudian tatkala ia melayaniku pada suatu malam tiba-tiba tersingkap sesuatu darinya, lalu aku menggaulinya. Kemudian pada saat pagi hari aku pergi kepada kaumku dan mengabarkan beritaku kepada mereka. Aku katakan; Ayo pergilah bersamaku kepada Rasulullah shallallahu 'alaihi wasallam hingga aku beritahukan perkaraku kepada beliau. Kemudian mereka berkata; Tidak, demi Allah, kami tidak akan melakukannya. Kami khawatir akan turun Al Qur'an mengenai kami atau Rasulullah shallallahu 'alaihi wasallam berbicara mengenai kami yang aibnya tetap ada pada kami. Akan tetapi pergilah kamu dan lakukan sekehendakmu. Kemudian aku keluar dan mendatangi Rasulullah serta memberitahukan mengenai beritaku. Lalu beliau berkata: \"Apakah engkau melakukannya?\" Aku katakan; saya melakukannya. Beliau berkata: \"Apakah engkau melakukannya?\" Aku mengatakan; saya melakukannya. Beliau berkata: \"Apakah engkau melakukannya?\" Aku mengatakan; saya melakukannya. Ini saya, maka tegakkanlah hukuman Allah kepadaku, karena sesungguhnya aku akan bersabar untuk itu. Beliau berkata: \"Bebaskan budak!\" Salamah bin Shakhr berkata; lalu aku menepuk permukaan leherku dengan tanganku. Kemudian aku katakan; \"Tidak, demi Dzat yang mengutusmu dengan kebaikan, aku tidak memiliki, selain itu sajalah.\" Beliau berkata: \"Berpuasalah dua bulan!\" Aku katakan; wahai Rasulullah, Bukankah yang menimpaku tak lain kecuali terjadi ketika berpuasa?. Beliau berkata: \"Berilah makan enam puluh orang miskin!\" aku katakan; demi Dzat yang mengutusmu dengan kebenaran, sungguh kami bermalam dalam keadaan tidak memiliki makanan. Beliau berkata: \"Kalau begitu, sana pergilah kepada penjaga Shadaqah Bani Zuraiq, suruh ia memberi untukmu dan berilah makan enam puluh orang miskin satu wasaq kurma, kemudian gunakan sisanya untuk membantu dirimu dan keluargamu.\" Salamah bin Shakhr berkata; kemudian aku kembali kepada kaumku dan mengatakan; aku telah mendapatkan kesempitan dan komentar-komentar yang buruk di sisi kalian, sebaliknya kudapatkan di sisi Rasulullah shallallahu 'alaihi wasallam kelapangan serta berkah. Beliau memerintahkan agar aku diberi sedekah kalian, maka serahkan sedekah tersebut kepadaku. Kemudian mereka menyerahkannya kepadaku. Abu Isa berkata; hadits ini adalah hadits hasan. Muhammad berkata; Sulaiman bin Yasar menurutku tidak mendengar dari Salamah bin Shakhr. Ia berkata; ada yang mengatakan; ia adalah Salamah bin Shakhr ada yang mengatakan; Salman bin Shakhr. Dan dalam bab tersebut dari Khaulah binti Tsa'labah, ia adalah isteri Aus bin Ash Shamit",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 351
			}
		}
	]
}