{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3305,
			"arabicnumber": 3305,
			"text": "Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] dari [Al Hasan bin Muhammad yaitu Al Hanafiyyah] dari ['Ubaidullah bin Abu Rafi'], ia berkata; saya mendengar [Ali bin Abu Thalib] berkata; Rasulullah shallallahu 'alaihi wasallam telah mengutus kami yaitu saya, Az Zubair, dan Al Miqdad bin Al Aswad. Beliau berkata: \"Pergilah hingga kalian sampai di lokasi yang namanya Raudhah Khakh, karena sesungguhnya padanya terdapat seorang wanita yang membawa sepucuk surat lalu ambillah darinya dan datangkan kepadaku.\" Kemudian kami keluar dan kuda kami berlari kencang hingga kami sampai pada Raudhah Khah, dan ternyata kami menjumpai seorang wanita, lalu kami mengatakan; keluarkan surat tersebut! Kemudian wanita tersebut mengatakan; aku tidak membawa surat. Lalu kami mengatakan; sungguh engkau mengeluarkan surat tersebut atau engkau melepas pakaianmu! Ali berkata; kemudian wanita tersebut mengeluarkan surat tersebut dari rambut kepangnya (Sanggul, gelung). Ali berkata; kemudian kami meringkus wanita itu kepada Rasulullah shallallahu 'alaihi wasallam dan ternyata surat tersebut dari Hathib bin Abu Balta'ah kepada orang-orang musyrik di Mekkah, ia mengabarkan kepada mereka sebagian urusan Nabi shallallahu 'alaihi wasallam. Kemudian beliau berkata: \"Apa ini wahai Hathib?\" Hathib berkata; jangan terburu menghukumku wahai Rasulullah! Sesungguhnya dahulu aku adalah orang yang tinggal di antara orang-orang Quraisy dan bukan dari cucu keturunan mereka, sementara orang-orang yang bersamamu dari kalangan muhajirin memiliki kerabat yang dengan kekerabatan tersebut mereka melindungi keluarga dan harta mereka di Mekkah. Dan aku ingin, disaat aku tidak memiliki nasab pada mereka ini, untuk memberi suatu jasa yang dengannya mereka dapat mempertahankan hubungan kekerabatanku, dan aku melakukan hal itu bukan lantaran aku kafir serta keluar dari agamaku dan bukan lantaran ridha dengan kekafiran setelah datangnya Islam. Kemudian Nabi shallallahu 'alaihi wasallam berkata: ia benar. Lalu Umar bin Al Khathab radliallahu 'anhu berkata; biarkan aku memenggal leher orang munafik ini wahai Rasulullah! Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Sesungguhnya ia telah mengikuti perang Badr, tahukah kamu kemungkinan Allah telah melihat kepada Ahli Badr dan berkata: \"Lakukan sesuka kalian, sungguh Aku telah mengampuni dosa kalian?.\" Ali berkata; kemudian turunlah surat ini mengenai Hathib bin Abu Balta'ah: \"Hai orang-orang yang beriman, janganlah kamu mengambil musuh-Ku dan musuhmu menjadi teman-teman setia.\" (QS. Almumtahanah 1), 'Amr berkata; setahuku, Ibnu Abu Rafi' adalah sekretaris Ali bin Abu Thalib. Hadits ini adalah hadits hasan shahih, dan padanya dari Umar dan Jabir bin Abdullah, dan tidak hanya satu orang telah meriwayatkan hadits ini dari Sufyan bin 'Uyainah seperti ini. Dan mereka menyebutkan dengan redaksi ini: sungguh akan engkau keluarkan surat tersebut atau engkau lepas pakaianmu! Dan telah diriwayatkan juga dari [Abu Abdur Rahman As Sulami] dari [Ali] seperti hadits ini, sebagian mereka menyebutkan padanya: sungguh engkau mengeluarkan surat tersebut atau kami akan melucuti pakaianmu",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 357
			}
		}
	]
}