{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3315,
			"arabicnumber": 3315,
			"text": "Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] ia telah mendengar [Jabir bin Abdullah] berkata; kami berada dalam suatu peperangan. Sufyan berkata; seingat mereka, perang tersebut adalah perang Bani Al Mushthaliq, kemudian seorang laki-laki muhajirin memukul pantat seorang laki-laki dari kalangan anshar. Orang muhajir tersebut mengatakan; wahai orang-orang muhajirin, dan orang-orang anshar berkata; wahai orang-orang Anshar. Kemudian Nabi shallallahu 'alaihi wasallam mendengar hal tersebut lalu berkata: \"Mengapa masih saja dilestarikan seruan jahiliyah?\" Mereka berkata; seseungguhnya terdapat seorang laki-laki dari kalangan muhajirin memukul pantat seorang laki-laki dari kalangan anshar. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Tinggalkan hal itu, karena hal itu adalah busuk.\" Kemudian Abdullah bin Ubai bin Salul mendengar hal tersebut dan berkata; apakah mereka telah melakukannya, demi Allah sesungguhnya jika kita telah kembali ke Madinah, benar-benar orang yang kuat akan mengusir orang-orang yang lemah dari padanya. Kemudian Umar berkata; wahai Rasulullah, biarkan saya memenggal leher orang munafik ini. Kemudian Nabi shallallahu 'alaihi wasallam berakta: \"Biarkan dia, jangan sampai orang-orang mengatakan bahwa Muhammad membunuh sahabatnya.\" Orang selain 'Amr mengatakan; kemudian anaknya yaitu Abdullah bin Abdullah berkata; demi Allah engkau tidak kembali kecuali engkau mengakui bahwa engkau hina sedangkan Rasulullah shallallahu 'alaihi wasallam adalah orang yang mulia. Kemudian ia melakukannya. Abu Isa berkata; hadits ini adalah hadits hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 367
			}
		}
	]
}