{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3318,
			"arabicnumber": 3318,
			"text": "Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdur Razzaq] dari [Ma'mar] dari [Az Zuhri] dari [Ubaidullah bin Abudullah bin Abu Tsaur], ia berkata; saya mendengar [Ibnu Abbas radliallahu 'anhuma] berkata; senantiasa aku bersemangat untuk bertanya kepada [Umar] mengenai dua orang wanita dari isteri-isteri Nabi shallallahu 'alaihi wasallam yang Allah dikatakan Allah 'azza wajalla: \"Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan).\" (QS. Attahrim 4), Hingga Umar melakukan haji dan akupun berhaji bersamanya, kemudian aku menuangkan air dari tempat air untuk bersuci lalu ia berwudhu. Aku katakan; wahai amirul mukminin; siapakah dua orang wanita diantara isteri Nabi shallallahu 'alaihi wasallam yang Allah katakan: \"Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan).\" (QS. Attahrim 4), Kemudian Umar berkata kepadaku; aneh engkau wahai Ibnu Abbas. Az Zuhri berkata; demi Allah ia tidak senang dengan apa yang ia tanyakan namun ia tidak menyembunyikannya. Ia berkata; ia adalah Aisyah dan Hafshah. Ibnu Abbas berkata; kemudian ia mulai menceritakan sebuah hadits kepadaku, ia berkata; dahulu kami orang-orang Quraisy menguasai para isteri, kemudian setelah kami datang ke Madinah kami mendapati orang-orang justru malah di atur para isteri mereka. Kemudian para isteri kami mulai belajar dari para isteri mereka, maka aku marah kepada isteriku pada suatu hari ternyata ia mendebatku dan berkata; apa yang engkau ingkari dari hal tersebut? Demi Allah sesungguhnya para isteri Nabi shallallahu 'alaihi wasallam juga biasa melakukan \"dialog alot dan debat\" bersama beliau dan salah seorang dari mereka pada hari ini, bahkan meninggalkan beliau hingga malam hari. Umar berkata; maka aku katakan dalam hati; telah celaka orang yang melakukan hal tersebut diantara mereka, dan telah merugi dia. Umar berkata; rumahku ketika itu di perkampungan namanya 'Aliyah, diantara Bani Umayyah. Aku pernah memiliki seorang tetangga dari kalangan anshar, kami dahulu bergantian menemui Rasulullah shallallahu 'alaihi wasallam. Sehari ia datang kepadaku membawa berita wahyu, dan yang lainnya. Dan hari lain aku yang datang menemui beliau membawa yang semisal hal tersebut. Umar berkata; ketika itu kami sedang hangat-hangatnya menceritakan bahwa raja Ghassan memasang sepatu kuda untuk memerangi kami. Ia berkata; kemudian tetangga tersebut datang kepadaku pada malam hari, dan mengetuk pintu. Lalu aku keluar menemuinya, ia berkata; telah terjadi perkara besar. Aku katakan; apakah Ghassan telah datang? Ia berkata; lebih besar daripada hal itu. Rasulullah shallallahu 'alaihi wasallam telah mencerai para isterinya. Umar berkata; lalu aku mengatakan dalam hati; Hafshah telah celaka dan merugi, aku telah menyangka hal ini akan terjadi. Umar berkata; tatkala aku telah melakukan shalat Shubuh aku mengencangkan pakaianku kemudian pergi hingga menemui Hafshah. Ternyata ia sedang menangis, lalu aku bertanya; apakah Rasulullah shallallahu 'alaihi wasallam telah mencerai kalian? Ia berkata; saya tidak tahu, beliau sedang menyendiri di ruangan yang tinggi ini. Umar berkata; kemudian aku pergi dan mendatangi seorang budak hitam lalu aku katakan; mintakan izin untuk Umar. Lalu Umar masuk kemudian keluar menemuiku seraya berkata; aku telah menyebutkan dirimu namun beliau tidak mengatakan sesuatupun. Lalu aku pergi, tiba-tiba budak tersebut memanggilku dan mengatakan; masuklah! Sungguh engkau telah diberi izin. Maka akupun masuk, ternyata Nabi sedang bersandar kepada tikar dan aku melihat bekasnya pada sisi badan beliau, lalu aku katakan; wahai Rasulullah, apakah anda mencerai isteri-isteri anda? Beliau bersabda: \"Tidak\" Maka aku katakan; Allahu akbar, wahai Rasulullah sungguh aku melihat kita orang-orang Quraisy, dahulu menguasai para wanita, kemudian tatkala kita datang ke Madinah maka kita mendapatkan sebuah kaum yang dikuasai para isteri mereka, kemudian para isteri kita mulai belajar dari isteri-isteri mereka, lalu aku suatu hari marah kepada isteriku ternyata ia membantahku hingga aku mengingkari hal tersebut, lalu ia berkata; apa yang engkau ingkari? Demi Allah sesungguhnya para isteri Nabi shallallahu 'alaihi wasallam membantah beliau dan salah seorang dari mereka meninggalkan beliau pada hari ini hingga malam hari. Umar berkata; lalu aku berkata kepada Hafshah; apakah engkau membantah Rasulullah? Maka ia berkata; ya, dan salah seorang dari kami meninggalkan beliau hingga malam hari. Lalu saya katakan; telah celaka orang yang melakukan hal tersebut diantara kalian dan ia telah merugi, apakah salah seorang diantara kalian aman dari kemarahan Allah kepadanya karena kemarahan RasulNya? Ternyata ia telah bersedih. Kemudian Nabi shallallahu 'alaihi wasallam tersenyum. Umar berkata; kemudian aku berkata kepada Hafshah; janganlah engkau membantah Rasulullah shallallahu 'alaihi wasallam dan jangan meminta sesuatu kepada beliau, mintalah kepadaku apa yang engkau inginkan janganlah terpengaruh apabila sahabatmu lebih cantik dan lebih dicintai Rasulullah shallallahu 'alaihi wasallam. Umar berkata; kemudian beliau tersenyum lagi, lalu aku katakan; wahai Rasulullah, apakah saya boleh meminta izin untuk berbicara? Beliau mengatakan: \"Ya.\" Umar berkata; kemudian aku mengangkat kepala dan tidak ada yang aku lihat di dalam rumah kecuali tiga peralatan rumah tangga. Umar berkata; kemudian aku katakan; wahai Rasulullah, berdoalah agar Allah memberikan kelapangan kepada umatmu, sungguh Allah telah memberikan kelapangan kepada orang-orang Persia dan Romawi sementara mereka tidak beribadah kepadaNya. Kemudian beliau duduk tegak, dan berkata: \"Apakah engkau merasa ragu wahai Ibnu Al Khathab? Mereka adalah orang-orang yang disegerakan kebaikan-kebaikan mereka dalam kehidupan dunia.\" Umar berkata; beliau telah bersumpah untuk tidak menemui para isterinya selama satu bulan, kemudian Allah mencelanya dalam hal tersebut dan mengharuskan beliau untuk membayar kafarah karena sebuah sumpah. [Az Zuhri] berkata; telah mengabarkan kepadaku ['Urwah] dari [Aisyah], ia berkata; kemudian tatkala telah berlalu dua puluh sembilan hari, Nabi shallallahu 'alaihi wasallam menemuiku dan memulai dariku. Beliau berkata: \"Wahai Aisyah, sesungguhnya aku menyebutkan sesuatu kepadamu dan janganlah engkau terburu-buru hingga engkau meminta pertimbangan kedua orang tuamu.\" Aisyah berkata; kemudian beliau membacakan ayat ini: Hai Nabi, katakanlah kepada isteri-isterimu: \"Jika kamu sekalian mengingini kehidupan dunia dan perhiasannya, maka marilah supaya kuberikan kepadamu mut'ah dan aku ceraikan kamu dengan cara yang baik. (QS. Al-Ahzab 28), Demi Allah beliau telah mengetahui bahwa kedua orang tuaku tidak memerintahkanku untuk berpisah dengannya. Lalu aku katakan; apakah dalam hal ini saya harus meminta pertimbangan kedua orang tuaku? Sesungguhnya saya menginginkan Allah dan rasulNya serta kampung akherat. [Ma'mar] berkata; dan telah mengabarkan kepada kami [Ayyub] bahwa [Aisyah] berkata kepada beliau; wahai Rasulullah, janganlah engkau memberitahu isteri-isterimu bahwa saya memilihmu. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku diutus Allah untuk menyampaikan dan Allah tidak mengutusku untuk mempersulit.\" Abu Isa berkata; hadits ini adalah hadits hasan shahih gharib, dan tealh diriwayatkan tidak hanya dari satu sisi dari Ibnu Abbas",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 370
			}
		}
	]
}