{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3350,
			"arabicnumber": 3350,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud Ath Thayalisi] telah menceritakan kepada kami [Al Qasim bin Al Fadhl Al Huddani] dari [Yusuf bin Sa'd], ia berkata; seorang laki-laki berdiri menuju [Al Hasan bin Ali] setelah berbai'at kepada Mu'awiyah, kemudian berkata: engkau telah mencoreng wajah orang-orang mukmin, atau ia berkata; wahai orang yang mencoreng wajah orang-orang mukmin! Maka ia mengatakan; janganlah engkau mencelaku, semoga Allah merahmati dirimu. Sesungguhnya Nabi shallallahu 'alaihi wasallam pernah diperlihatkan kepadanya Bani Umayyah di atas mimbar, dan itu membuat beliau gundah. Kemudian turun ayat: \"Sesungguhnya Kami telah memberikan kepadamu Al Kautsar.\" wahai Muhammad, Al Kautsar yaitu sungai di Surga. Dan turun ayat ini: \"Sesungguhnya Kami telah menurunkannya (Al Quran) pada malam kemuliaan. Dan tahukah kamu apakah malam kemuliaan itu? Malam kemuliaan itu lebih baik dari seribu bulan.\" (QS.Alqadar 1-3), malam itu akan dimiliki Bani Umayyah setelahmu wahai Muhammad. Al Qasim berkata; kami menghitungnya ternyata malam itu seribu tahun, tidak bertambah dan tidak berkurang. Abu Isa berkata; hadits ini adalah hadits gharib, kami tidak mengetahuinya kecuali dari sisi ini, dari hadits Al Qasim bin Al Fadhl, dan ada yang mengatakan dari Al Qasim bin Al Fadhl dari Yusuf bin Mazin serta Al Qasim bin Al Fadhl Al Haddani ia adalah orang yang tsiqah, ia ditsiqahkan oleh Yahya bin Sa'id serta Abdur Rahman bin Mahdi sedangkan Yusuf bin Sa'd adalah orang yang tidak dikenal. Dan kami tidak mengetahui hadits ini dengan lafazh ini kecuali dari sisi ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 402
			}
		}
	]
}