{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 336,
			"arabicnumber": 336,
			"text": "telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] berkata; telah menceritakan kepada kami Telah memberitakan kepada kami [Ma'n] berkata; telah menceritakan kepada kami [Malik bin Anas] dari [Abu An Nadlr] dari [Busr bin Sa'id] berkata; \"Zaid bin Khalid Al Juhani mengutusnya menemui Abu Juhaim untuk bertanya kepadanya tentang apa yang pernah ia dengar dari Nabi shallallahu 'alaihi wasallam berkenaan dengan seseorang yang lewat di hadapan orang yang sedang shalat. Maka [Abu Juhaim] pun berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya orang yang lewat di depan orang yang sedang shalat mengetahui apa yang akan menimpanya, sungguh ia berhenti selama empat puluh lebih baik daripada lewat di hadapannya.\" Abu An Nadlr berkata; \"Aku tidak tahu beliau mengatakan empat puluh orang, atau bulan, atau tahun.\" Abu Isa berkata; \"Dalam bab ini juga ada riwayat dari Abu Sa'id Al Khudri, Abu Hurairah, Ibnu Umar dan Abdullah bin Umar.\" Abu Isa berkata; \"Hadits Abu Juhaim derajatnya hasan shahih. Telah diriwayatkan dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Sekiranya salah seorang dari kalian berhenti (menunggu) selama ratus tahun adalah lebih baik daripada harus melintasi saudaranya yang sedang shalat.\" Para ulama mengamalkan hadits ini, mereka memakruhkan seseorang melintas di hadapan orang yang sedang shalat. Namun mereka tidak berpandangan bahwa hal itu akan membatalkan shalat seseorang.\" Dan Abu An Nadlr namanya adalah Salim pelayan Umar bin Ubaidullah Al Madini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 188
			}
		}
	]
}