{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3379,
			"arabicnumber": 3379,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Marhum bin Abdul Aziz Al 'Aththar] telah menceritakan kepada kami [Abu Na'amah] dari [Abu Utsman An Nahdi] dari [Abu Sa'id al khudri] ia berkata; [Mu'awiyah] keluar menuju masjid, kemudian ia berkata; apa yang mendorong kalian untuk duduk-duduk? Mereka berkata; kami duduk-duduk untuk berdzikir kepada Allah. Ia berkata; demi Allah, tidak ada yang mendorong kalian untuk duduk-duduk kecuali hal tersebut? Mereka berkata; demi Allah, tidak ada yang mendorong kami untuk duduk-duduk kecuali hal tersebut. Ia berkata; ketahuilah, aku tidak meminta kalian bersumpah karena suatu tuduhan kepada kalian, dan tidak ada seorangpun yang hadisnya lebih sedikit daripada diriku sekalipun aku memperoleh kedudukan istimewa disisi Rasulullah Shallallahu'alaihiwasallam. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah keluar kepada sebuah majlis para sahabatnya kemudian berkata: \"Apakah yang mendorong kalian untuk duduk-duduk?\" Mereka berkata; kami duduk-duduk untuk berdzikir kepada Allah, dan memuji-Nya karena telah memberi petunjuk kepada kami untuk memeluk Islam, dan telah memberikan karunia kepada kami dengan Islam tersebut. Kemudian beliau berkata: \"Demi Allah, apakah tidak ada yang mendorong kalian untuk duduk-duduk kecuali hal tersebut?\" mereka berkata; demi Allah, tidak ada yang mendorong kami untuk duduk-duduk kecuali hal tersebut. Beliau bersabda: 'Ketahuilah bahwa aku tidak meminta kalian bersumpah karena sebuah tuduhan kepada kalian, sesungguhnya Jibril telah datang kepadaku dan memberitahukan bahwa Allah membanggakan kalian kepada para Malaikat.\" Abu Isa berkata; hadits ini adalah hadits hasan gharib, kami tidak mengetahuinya kecuali dari sisi ini. sedangkan Abu Na'amah As Sa'di namanya adalah 'Amru bin Isa, dan Abu Utsman An Nahdi namanya adalah Abdur Rahman bin Mull",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 10
			}
		}
	]
}