{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3393,
			"arabicnumber": 3393,
			"text": "Telah menceritakan kepada kami [Al Husain bin Huraits] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim]?? dari [Katsir bin Zaid]? dari [Utsman bin Rabi'ah]? dari [Syaddad bin Aus? radliallahu 'anhu] bahwa Nabi? shallallahu 'alaihi wasallam berkata kepadanya: \"Maukah aku tunjukkan kepadamu sayyid istighfar? Yaitu ALLAAHUMMA ANTA RABBII LAA ILAAHA ILLAA ANTA KHALAQTANII WA ANAA 'ABDUKA WA ANAA 'ALAA 'AHDIKA WA WA'DIKA MASTATHA'TU, A'UUDZU BIKA MIN SYARRI MAA SHANA'TU WA ABUU-U LAKA BINI'MATIKA 'ALAYYA WA A'TARIFU BIDZUNUUBII FAGHFIR LII DZUNUUBII, INNAHU LAA YAGHFIRUDZ DZUNUUBA ILLAA ANTA. (Ya Allah, Engkau adalah Tuhanku, tidak ada tuhan yang berhak disembah kecuali Engaku, Engkau telah menciptakanku, dan aku adalah hambaMu, dan berada dalam perjanjian dan janjiMu semampuku. Aku berlindung kepadaMu dari keburukan apa yang telah aku perbuat, dan aku mengakui kenikmatanMu yang Engkau berikan kepadaku dan mengakui dosa-dosaku, maka ampunilah dosaku, sesungguhnya tidak ada yang dapat mengampuni dosa kecuali Engkau). Tidak ada seorangpun diantara kalian yang mengucapkannya ketika sore hari kemudian datang kepadanya taqdir untuk meninggal sebelum datang pagi hari melainkan wajib baginya Surga, dan tidaklah ia mengucapkannya ketika pagi hari kemudian datang kepadanya taqdir untuk meninggal sebelum datang sore hari melainkan wajib baginya Surga.\" Dalam bab tersebut ada yang diriwayatkan dari Abu Hurairah, Ibnu Umar, Ibnu Mas'ud, Ibnu Abza serta Buraidah? radliallahu 'anhum. Abu Isa berkata; hadits ini adalah hadits hasan gharib dari sisi ini dan hadits ini telah diriwayatkan dari selain sisi ini dari Syaddad bin Aus, sedangkan Abdul Aziz bin Abu Hazim adalah Ibnu Abu Hazim Az Zahid",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 24
			}
		}
	]
}