{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 340,
			"arabicnumber": 340,
			"text": "telah menceritakan kepada kami [Hannad] berkata; telah menceritakan kepada kami [Waki'] dari [Isra'il] dari [Ishaq] dari [Al Bara` bin 'Azib] ia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam datang di Madinah, beliau sempat shalat menghadap ke Baitul Maqdis selama enam atau tujuh belas bulan. Sedangkan Rasulullah shallallahu 'alaihi wasallam menyukai sekiranya beliau menghadap ke arah Ka'bah, maka Allah pun menurunkan ayat: (Sungguh Kami (sering) melihat mukamu menengadah ke langit, maka sungguh Kami akan memalingkan kamu ke kiblat yang kamu sukai. Palingkanlah mukamu ke arah Masjidil Haram). Maka beliau pun menghadap ke arah kiblat, dan beliau menyukai hal itu.\" Kemudian ada seseorang shalat asar bersama beliau. Setelah itu ia melintasi beberapa orang dari kaum Anshar yang sedang rukuk dalam shalat asar mengadap arah Baitul Maqdis, maka ia pun mengatakan -seraya bersaksi-, bahwa ia pernah shalat bersama Rasulullah shallallahu 'alaihi wasallam, dan beliau menghadap ke arah Ka'bah.\" Al Bara` berkata; \"Maka orang-orang pun berpaling ke arah Ka'bah dalam keadaan rukuk.\" Ia berkata; \"Dalam bab ini juga ada riwayat dari Ibnu Umar, Ibnu Abbas, 'Umarah bin Aus, 'Amru bin 'Auf Al Muzani dan Anas.\" Abu Isa berkata; \"Hadits Al Bara` adalah hadits hasan shahih dan [Sufyan Ats Tsauri] telah meriwayatkan dari [Abu Ishaq], telah menceritakan kepada kami [Hannad] berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abdullah bin Dinar] dari [Ibnu Umar] ia berkata; \"Mereka rukuk di dalam shalat Shubuh.\" Abu Isa berkata; \"Hadits Ibnu Umar adalah hadits hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 192
			}
		}
	]
}