{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3410,
			"arabicnumber": 3410,
			"text": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Isma'il bin 'Ulaiyyah]? telah menceritakan kepada kami ['Atho` bin As Saib]? dari [ayahnya]? dari [Abdullah bin 'Amru? radliallahu 'anhuma]? ia berkata; Rasulullah shallallahu 'alaihi wa salam bersabda: \"Terdapat dua sifat yang tidaklah seorang muslim menjaganya melainkan ia masuk Surga, ketahuilah kedua sifat tersebut adalah mudah namun orang yang melakukannya sedikit yaitu; bertasbih kepada Allah setiap selesai shalat sebanyak sepuluh kali, memujinya sebanyak sepuluh kali, bertakbir sebanyak sepuluh kali.\" Abdullah bin 'Amru berkata; dan aku melihat Rasulullah shallallahu 'alaihi wa salam menghitungnya dengan tangannya. Beliau bersabda: \"Itulah seratus lima puluh dengan lisan dan lima ratus di dalam timbangan, dan apabila engkau telah bersiap-siap untuk tidur maka engkau bertasbih, bertakbir dan bertahmid kepadaNya sebanyak seratus kali. Maka itu adalah seratus dengan lisan dan seribu dalam timbangan. Siapakah diantara kalian dalam satu hari satu malam melakukan dua ribu lima ratus keburukan?\" Para sahabat berkata; bagaimana seseorang bisa tidak menghitungnya (mengamalkannya)? Beliau bersabda: \"Itu terjadi karena salah seorang diantara kalian didatangi syetan ketika ia dalam shalatnya, kemudian syetan berkata; ingatlah ini, ingatlah ini, hingga ia berpaling dari shalatnya, sehingga ia tidak melakukannya. Dan syetan datang kepadanya ketika sedang berbaring, ia terus menidurkannnya hingga ia tertidur.\" Abu Isa berkata; hadits ini adalah hadits hasan shahih. dan [Syu'bah] serta [Ats Tsauri] telah meriwayatkan hadits ini dari ['Atho` bin Asy Saib]. Dan? [Al A'masy] meriwayatkan hadits ini dari ['Atho' bin As Saib] secara ringkas, dan di dalam bab ini ada yang diriwayatkan dari Zaid bin Tsabit serta Anas dan Ibnu Abbas",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 41
			}
		}
	]
}