{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3418,
			"arabicnumber": 3418,
			"text": "Telah menceritakan kepada kami [Al Anshari] telah menceritakan kepada kami [Ma'n] telah menceritakan kepada kami [Malik bin Anas]? dari [Abu Az Zubair]? dari [Thawus Al Yamani]?? dari [Abdullah bin Abbas]? radliallahu 'anhuma bahwa Nabi? shallallahu 'alaihi wasallam apabila bangkit untuk melakukan shalat di tengah malam beliau mengucapkan: ALLAAHUMMA LAKAL HAMDU ANTA NUURUS SAMAAWAATI WAL ARDHI WA LAKAL HAMDU ANTA QAYYUUMUS SAMAAWAATI WAL ARDHI, WA LAKAL HAMDU ANTA RABBUS SAMAAWAATI WAL ARDHI WA MAN FIIHINNA, ANTAL HAQQU WA WA'DUKAL HAQQU WA LIQAAUKA HAQQUN WAL JANNATU HAQQUN WAS SAA'ATU HAQQUN, ALLAAHUMMA LAKA ASLAMTU WA BIKA AAMANTU WA 'ALAIKA TAWAKKALTU WA ILAIKA ANABTU WA BIKA KHAASHAMTU WA ILAIKA HAAKAMTU FAGHFIR LII MAA QADDAMTU WA MAA AKHKHARTU WA MAA ASRARTU WA MAA A'LANTU, ANTA ILAAHII, LAA ILAAHA ILLAA ANTA.\" (Ya Allah, segala puji bagiMu, Engkau Yang memberikan cahaya langit dan bumi, segala puji bagiMu, Engkau Yang terus mengurus langit dan bumi. Segala puji bagiMu, Engkau Tuhan langit dan bumi dan yang ada padanya. Engkau Maha Benar, janjiMu adalah benar, pertemuan denganMu adalah benar, Surga adalah benar, Hari Kiamat adalah benar. Ya Allah, kepadaMu aku berserah diri, kepadaMu aku beriman, kepadaMu aku bertawakal, kepadaMu aku kembali, dengan pertolonganMu aku berseteru, dan kepadaMu aku berhukum, maka ampunilah apa yang telah aku lakukan dan yang belum aku lakukan, apa yang aku sembunyikan dan apa yang aku nampakkan. Engkau adalah Tuhan sembahanku, tidak ada tuhan yang berhak disembah kecuali Engkau). Abu Isa berkata; hadits ini adalah hadits hasan shahih dan telah diriwayatkan lebih dari satu sisi, dari Ibnu Abbas? dari Nabi? shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 49
			}
		}
	]
}