{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 347,
			"arabicnumber": 347,
			"text": "telah menceritakan kepada kami [Mahmud bin Ghailan] berkata; telah menceritakan kepada kami [Al Muqri`] berkata; telah menceritakan kepada kami [Yahya bin Ayyub] dari [Zaid bin Jabirah] dari [Daud bin Al Hushain] dari [Nafi'] dari [Ibnu Umar] berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang shalat di tujuh tempat; tempat pembuangan sampah, tempat pemotongan hewan, pemakaman, tengah jalan, pemandian umum, tempat menderumnya unta dan di atas Ka'bah.\" Telah menceritakan kepada kami [Ali bin Hujr] berkata; telah menceritakan kepada kami [Suwaid bin Abdul Aziz] dari [Zaid bin Jabirah] dari [Daud bin Hushain] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan hadits serupa secara makna.\" Ia berkata; \"Dalam bab ini ada juga hadits dari Abu Martsad, Jabir dan Anas. Abu Martsad namanya adalah Kannaz bin Hushain.\" Abu Isa berkata; \"Hadits Ibnu Umar sanadnya tidak begitu kuat, karena Zaid bin Jabirah telah perbincangkan dari segi hafalannya.\" Abu Isa berkata; \"Zaid bin Jubair Al Kufi lebih kuat dan lebih dahulu dari ini Zaid bin Jabirah, karena ia pernah mendengar dari Ibnu Umar. Dan [Laits bin Sa'ad] telah meriwayatkan hadits ini dari [Abdullah bin Umar Al Umari] dari [Nafi'] dari [Ibnu Umar] dari [Umar] dari Nabi shallallahu 'alaihi wasallam dengan hadits yang semisal dengannya. Adapun hadits Daud dari Nafi', dari Ibnu Umar, dari Nabi shallallahu 'alaihi wasallam lebih mirip dan lebih shahih dari hadits Laits bin Sa'ad, karena Abdullah bin Umar Al Umari telah dilemahkan oleh sebagian ahli hadits dari segi hafalannya. Dan di antara mereka yang melemahkannya adalah Yahya bin Sa'id Al Qaththan",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 199
			}
		}
	]
}