{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3511,
			"arabicnumber": 3511,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Ya'qub] telah menceritakan kepada kami ['Amr bin 'Ashim] telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Umar bin Abu Salamah] dari [ibunya yaitu Ummu Salamah] dari [Abu Salamah] bahwa Rasulullah shallallahu wa'alaihi wa sallam bersabda: \"Apabila salah seorang dari kalian tertimpa musibah hendaknya ia mengucapkan; INNAA LILLAAHI WA INNAA ILAIHI RAAJI'UUN, ALLAAHUMMA 'INDAKA IHTASABTU MUSHIIBATII, FA`JURNII FIIHAA WA ABDILNII MINHAA KHAIRAN (Sesungguhnya kami adalah milik Allah, dan kami kepadaNya akan kembali. Ya Allah, aku mengharapkan pahala musibahku di sisiMu maka berilah aku pahala padanya dan gantilah untukku yang lebih baik darinya!). kemudian tatkala Abu Salamah akan meninggal ia berdoa; ya Allah, gantikanlah di dalam keluargaku orang yang lebih baik dariku. Kemudian tatkala Abu Salamah meninggal maka Ummu Salamah berdoa: INNAA LILLAAHI WA INNAA ILAIHI RAAJI'UUN, 'INDALLAAHI IHTASABTU MUSHIIBATII, FA`JURNII FIIHAA WA ABDILNII MINHAA KHAIRAN (Sesungguhnya kami adalah milik Allah, di sisi Allah aku mengharapkan pahala musibahku maka berilah aku pahala padanya dan gantilah untukku yang lebih baik darinya!). Abu Isa berkata; hadits ini adalah hadits hasan gharib dari jalur ini. Dan telah diriwayatkan hadits ini dari selain jalur ini dari Ummu Salamah dari Nabi shallallahu 'alaihi wasallam. Abu Salamah namanya adalah Abdullah bin Abdul Asad",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 142
			}
		}
	]
}