{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 356,
			"arabicnumber": 356,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] dan [Hannad] keduanya; telah menceritakan kepada kami [Waki'] dari [Aban bjn Yazid Al Aththar] dari [Budail bin Maisarah Al Uqaili] dari [Abu 'Athiyyah] -seorang dari bani Uqail- ia berkata; \" [Malik bin Al Huwairits] datang ke tempat shalat kami untuk membicarakan sesuatu, lalu tibalah waktu shalat, kami pun berkata kepadanya, \"Hendaklah engkau maju (menjadi imam), \" namun ia menjawab, \"Hendaklah salah seorang dari kalian maju menjadi imam hingga aku ceritakan kenapa aku tidak ingin maju. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengunjungi suatu kaum maka janganlah ia menjadi imam untuk mereka, tetapi hendaklah seorang dari mereka yang menjadi imam.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. Hadits ini diamalkan oleh banyak ahli ilmu dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan orang-orang setelah mereka. Mereka berkata; \"Pemilik rumah lebih berhak untuk menjadi imam daripada yang berkunjung.\" Sedangkan sebagian ahli ilmu yang lain berkata; \"Jika tuan rumah memberikan izin maka tidak mengapa ia menjadi imam.\" Ishaq berpendapat berdasarkan hadits Malik bin Al Huwairits dan bersikap tegas, bahwa seseorang tidak boleh shalat dengan mengimami tuan rumah meskipun ia mendapatkan izin.\" Dan Ishaq juga mengatakan, \"Hal ini juga berlaku di dalam masjid, seseorang tidak boleh mengimami suatu kaum yang ia kunjungi. Dan hendaklah ia berkata; \"Hendaknya seorang dari mereka yang menjadi imam",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 208
			}
		}
	]
}