{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3604,
			"arabicnumber": 3604,
			"text": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berlindunglah kalian kepada Allah dari siksa neraka dan berlindunglah kalian kepada Allah dari siksa kubur. Berlindunglah kalian kepada Allah dari fitnah al-Masihud Dajjal, berlindunglah kalian kepada Allah dari fitnah kehidupan serta fitnah kematian.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 3604.1,
			"arabicnumber": 3604.1,
			"text": "Telah menceritakan kepada kami [Shalih bin Abdullah] telah mengabarkan kepada kami [Ja'far bin Sulaiman] dari [tsabit Al Bunani] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"hendaklah salah seorang diantara kalian akan benar-benar memohon kebutuhan kepada Rabnya, hingga ia memohon garam, dan hingga tali sandal yang putus pun ia akan memohon kepada-Nya.\" Hadits ini lebih shahih dari hadits Qathn dari Ja'far bin Sulaiman",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.2,
			"arabicnumber": 3604.2,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hisyam bin Hassan] dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa ketika di sore harinya membaca; A'UUDZU BIKALIMAATILLAHIT TAAMMAH MIN SYARRI MAA KHALAQ (aku berlindung kepada kalimat-kalimat Allah yang sempurna dari kejahatan para makhluk yang telah Dia ciptakan), sebanyak tiga kali, maka dia tidak akan tertimpa sengatan (bahaya) pada malam itu\" Suhail berkata; \"Keluarga kami telah mempelajarinya dan mereka membacanya setiap malam, lalu diantara putri mereka ada yang tersengat (binatang), akan tetapi ia tidak merasakan sakit.\" Abu Isa berkata; \"Hadits ini derajatnya hasan.\" [Malik bin Anas] juga telah meriwayatkan hadits ini dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, dan di riwayatkan pula oleh ['Ubaidillah bin Umar] dan yang lain dari [Suhail], namun mereka tidak menyebutkan dari Abu Hurairah",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.3,
			"arabicnumber": 3604.3,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] telah mengabarkan kepada kami [Waki'] ' telah mengabarkan kepada kami [Abu Fadhalah Al Farj bin Fadhalah] dari [Abu Sa'id Al Maqburi] bahwa [Abu Hurairah] berkata; \"Aku telah hafal do'a dari Rasulullah? radliallahu 'anhu dan aku tidak akan meninggalkannya, yaitu; \"ALLAHUMMAJ'ALNII U'ADDHIM SYUKRAKA WA UKTSIR DZIKRAKA WA ATTABBI'U NASHIIHATAKA WA AHFADHU WASHIYYATAKA (Ya Allah! Jadikanlah aku sebagai orang yang mengagungkan untuk selalu bersyukur kepada-Mu, memperbanyak mengingat-Mu, mengikuti nasehat-Mu dan selalu menjaga wasiat-Mu.\" Abu Isa berkata; \"Hadits ini derajatnya gharib)",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.4,
			"arabicnumber": 3604.4,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] telah mengabarkan kepada kami [Abu Mu'awiyah] telah mengabarkan kepada kami [Al Laits yaitu Ibnu Abu Sulaim] dari [Ziyad] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang yang berdo'a kepada Allah kecuali akan dikabulkan untuknya, baik akan disegerakan di dunia atau dijadikan tabungan di akhirat atau akan menghapus dosa-dosanya sesuai dengan do'a yang ia lantunkan, selama ia tidak berdo'a untuk kemaksiatan atau memutus tali silaturrahmi atau terburu-buru.\" Mereka bertanya, \"Wahai Rasulullah! Bagaimana ia terburu-buru? Beliau bersabda: \"Ia berkata, aku telah berdoa akan tetapi Rab-ku tidak juga mengabulkan untukku.\" Abu Isa berkata; \"Hadits ini derajatnya gharib",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.5,
			"arabicnumber": 3604.5,
			"text": "Telah menceritakan kepada kami [Yahya] telah mengabarkan kepada kami [Ya'la bin 'Ubaid] dia berkata; telah mengabarkan kepada kami [Yahya bin 'Ubaidillah] dari [ayahnya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba yang mengangkat kedua tangannya hingga nampak ketiaknya, untuk memohon kepada Allah suatu permintaan, kecuali Allah akan memberinya selama ia tidak terburu-buru.\" Mereka bertanya, \"Wahai Rasulullah! Bagaimana sikap terburu-buru itu? Beliau bersabda: \"Ia mengatakan, aku telah meminta namun aku tidak diberi sesuatu.\"Hadits ini di riwayatkan oleh [Az Zuhri] dari [Abu 'Ubaid] mantan budak (yang telah dimerdekakan oleh) Ibnu Azhar dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Akan di kabulkan doa salah seorang dari kalian selama tidak terburu-buru, yaitu mengatakan; \"Aku telah berdo'a, namun tidak juga terkabul",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.6,
			"arabicnumber": 3604.6,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] telah mengabarkan kepada kami [Abu Daud] telah mengabarkan kepada kami [Shadaqah bin Musa] telah mengabarkan kepada kami [Muhammad bin Wasi'] dari [Sumair bin Nahar Al 'Abdi] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya berbaik sangka kepada Allah termasuk tanda akan baiknya ibadah kepada Allah.\" Abu Isa berkata; \"Hadits ini derajatnya gharib",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.7,
			"arabicnumber": 3604.7,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] telah mengabarkan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Abu 'Awanah] dari ['Umar bin Abu Salamah] dari [ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"hendaklah salah seorang diantara kalian meliahat (memperhatikan) terhadap apa yang ia angan-angankan, karena ia tidak mengetahui apa yang akan ditetapkan baginya (terjadi) dari angan-angannya tersebut.\" Abu Isa berkata; \"Hadits ini derajatnya hasan",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.8,
			"arabicnumber": 3604.8,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] telah mengabarkan kepada kami [Jabir bin Nuh] dia berkata; telah mengabarkan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah berdoa dengan membaca: \"ALLAHUMMA MATTI'NII BISAM'II WA BASHARII WAJ'ALHUMAL WAARISA MINNI WANSHURNII 'ALAA MAN YADHLIMUNII WA KHUD MINHU BI TSA`RII (Ya Allah, Berilah aku manfaat dari pendengaranku dan penglihatanku, jadikanlah keduanya sebagai waris dariku (tetap sehat sampai aku meninggal), tolonglah aku atas orang-orang yang mendzalimiku dan balaslah dendamku kepadanya).\" Abu Isa berkata; \"Hadits ini derajatnya hasan gharib melalui jalur ini",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.9,
			"arabicnumber": 3604.9,
			"text": "Telah menceritakan kepada kami [Abu Daud Sulaiman bin Al Asy'ats As Sijzi] telah menceritakan kepada kami [Qathan Al Bashri] telah mengabarkan kepada kami [Ja'far bin Sulaiman] dari [Tsabit] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah salah seorang dari kalian memohon setiap kebutuhannya kepada Rabbnya, hingga tali sandal yang putus pun ia tetap memohon kepada-Nya.\" Abu Isa berkata; \"Hadits ini derajatnya gharib.\" Dan hadits ini juga telah di riwayatkan oleh beberapa perawi dari Ja'far bin Sulaiman dari Tsabit Al Bunani dari Nabi shallallahu 'alaihi wasallam, namun mereka tidak menyebutkan di dalam sanadnya dari Anas",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}