{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3630,
			"arabicnumber": 3630,
			"text": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] telah menceritakan kepada kami [Ma'n] dia berkata; aku memaparkan (hadits) kepada [Malik bin Anas] dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa dia mendengar [Anas bin Malik] berkata; Abu Thalhah berkata kepada Ummul Sulaim; \"Aku mendengar suara lirih Rasulullah Shallallahu'alaihi wasallam, aku tahu bahwa beliau merasa lapar, apakah kamu memiliki sesuatu?\" dia menjawab; \"Ya.\" kemudian dia mengeluarkan beberapa genggam gandum, setelah itu dia mengambil kerudungnya dan melipat sebagian roti dan menekannya di tanganku lalu memberiku sebagian yang lain. Lalu dia mengutusku menemui Rasulullah Shallallahu'alaihi wasallam, Ummu Sulaim berkata; \"Lalu aku membawanya menemui Rasulullah Shallallahu'alaihi wasallam, ternyata beliau sedang duduk-duduk dimasjid bersama para sahabat, lalu aku berdiri di hadapan mereka, maka Rasulullah Shallallahu'alaihi wasallam bersabda: \"Apakah Abu Thalhah yang mengirimmu kemari?\" Aku menjawab; \"Ya.\" beliau bersabda: \"Apakah untuk membawa makanan?\" Aku menjawab; \"Ya.\" lalu Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bagi siapa yang ingin bersamanya maka berdirilah, \" kemudian beliau pergi dan akupun pergi bersama mereka, hingga aku menemui Abu Thalhah dan mengabarkan hal itu kepadanya, Abu Thalhah berkata; \"Hai Ummu Sulaim, sesungguhnya Rasulullah Shallallahu'alaihi wasallam telah datang bersama para sahabat, sedangkan kita tidak memiliki makanan untuk menjamu mereka.\" Dia menjawab; \"Allah dan Rasul-Nya yang lebih mengetahui.\" Anas bin Malik berkata; \"Lalu Abu Thalhah pergi menemui Rasulullah Shallallahu'alaihi wasallam dan Rasulullah Shallallahu'alaihi wasallam datang menyambut hingga Abu Thalhah bersama beliau masuk rumah, Rasulullah Shallallahu'alaihi wasallam bersabda: \"Kemarilah hai Ummu Sulaim, apa yang kau miliki?\" Lalu ia datang dengan roti itu, kemudian Rasulullah Shallallahu'alaihi wasallam memerintahkan (untuk di hidangkan), maka dia membagi-bagi dan memerah susu murni miliknya dan menghidangkannya sebagai lauk untuk beliau, kemudian Rasulullah Shallallahu'alaihi wasallam mengucapkan sesuatu sebagaimana yang di kehendaki Allah, lalu bersabda: \"Izinkanlah sepuluh orang untuk masuk.\" Dia pun mengzinkan, lalu mereka masuk dan makan hingga kenyang kemudian keluar, beliau bersabda lagi: \"Izinkanlah sepuluh orang lagi untuk masuk.\" dia pun mengizinkan, lalu masuklah sepuluh orang, setelah itu mereka makan hingga kenyang kemudian keluar, hingga pada hari itu, seluruh orang makan dan kenyang semuanya, ketika itu jumlah mereka sekitar tujuh puluh atau delapan puluh orang.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 26
			}
		}
	]
}