{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3742,
			"arabicnumber": 3742,
			"text": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Yunus bin Bukair] telah menceritakan kepada kami [Thalhah bin Yahya] dari [Musa] dan [Isa] -keduanya adalah anak Thalhah- dari ayahnya yaitu [Thalhah] bahwa para sahabat Rasulullah shallallahu 'alaihi wasallam berkata kepada seorang Arab badui yang masih bodoh, \"Tanyakan kepada beliau mengenai orang yang berjanji untuk mati, siapakah dia.\" -sebab mereka (para sahabat) tidak berani menanyakan langsung kepada beliau, karena mereka sangat menghormati dan takut terhadap beliau- lantas orang Arab tersebut bertanya kepada beliau, akan tetapi beliau berpaling darinya, kemudian ia menanyakannya lagi dan beliau tetap berpaling darinya. Lalu aku datang dari arah pintu masjid, -waktu itu aku memakai baju berwarna hijau- ketika Rasulullah shallallahu 'alaihi wasallam melihatku, beliau bertanya: \"Mana orang yang bertanya mengenai siapa orang yang pernah berjanji sampai titik darah penghabisan\". orang Arab badui itu menjawab, \"Aku ya Rasulullah! beliau bersabda: \"Inilah orang yang pernah berjanji hingga titik darah penghabisan.\" Abu Isa berkata; \"Hadits ini adalah hadits hasan gharib, kami tidak mengetahuinya kecuali dari hadits Abu Kuraib dari Yunus bin Bukair, dan hadits ini juga telah diriwayatkan oleh beberapa perawi dari para tokoh ahli hadits dari Abu Kuraib, dan aku juga mendengar [Muhammad bin Isma'il] menceritakan tentang hal ini dari [Abu Kuraib] dan ia meletakkannya dalam kitab Al Fawa`id",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 139
			}
		}
	]
}