{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3803,
			"arabicnumber": 3803,
			"text": "Telah menceritakan kepada kami [Ali bin Sa'id Al Kindi] telah menceritakan kepada kami [Abu Muhayyah Yahya bin Ya'la bin 'Atha`] dari [Abdul Malik bin 'Umair] dari [sepupunya Abdullah bin Salam] dia berkata; \"ketika Utsman hendak dibunuh, Abdullah bin Salam datang kepadanya, lantas Utsman berkata kepadanya; \"Untuk apa kamu datang kemari?\" dia menjawab; \"Saya datang untuk menolongmu.\" Utsman berkata; \"Keluarlah menuju (kerumunan) manusia, dan usirlah mereka dariku, karena bagiku, kamu lebih baik di luar dari pada di dalam.\" Lantas [Abdullah] keluar menuju (kerumunan) manusia, dan berkata; \"Wahai sekalian manusia, sesungguhnya ketika Jahiliyah namaku adalah fulan, lantas Rasulullah shallallahu 'alaihi wasallam menamaiku dengan Abdullah, beberapa ayat dari kitabullah juga telah turun mengenai diriku, di antaranya; \"Katakanlah: \"Terangkanlah kepadaku, bagaimanakah pendapatmu jika Al Quran itu datang dari sisi Allah, padahal kamu mengingkarinya dan seorang saksi dari Bani Israil mengakui (kebenaran) yang serupa dengan (yang tersebut dalam) Al Quran lalu dia beriman, sedang kamu menyombongkan diri. Sesungguhnya Allah tiada memberi petunjuk kepada orang-orang yang zalim.\" QS Al Ahqaf; 10 dan turun pula mengenai diriku ayat; \"Katakanlah: \"Cukuplah Allah menjadi saksi antaraku dan kamu, dan antara orang yang mempunyai ilmu Al Kitab.\" (QS Ar Ra'du; 43), sesungguhnya Allah memiliki pedang yang masih dalam sarungnya, dan sesungguhnya Malaikat telah berada di samping kalian, yaitu di negeri kalian ini, negeri yang Dia telah mengutus Rasulullah shallallahu 'alaihi wasallam, demi Allah, demi Allah, apakah kalian hendak membunuh laki-laki ini (Utsman)? Demi Allah sekiranya kalian membunuhnya, maka sesungguhnya kalian benar-benar akan mengusir para Malaikat dari melindungi kalian dan kalian benar-benar akan menghunuskan pedang Allah yang tersarungkan dari kalian, hingga pedang tersebut tidak tersarungkan lagi dari kalian hingga hari kiamat.\" Namun mereka (para pemberontak) tetap mengatakan; \"Bunuhlah orang Yahudi ini (Abdullah bin Salam), dan bunuhlah Utsman.\" Abu Isa berkata; \"Hadits ini adalah hadits gharib, kami hanya mengenalnya dari hadits Abdul Malik bin 'Umair. [Syu'aib bin Shafwan] juga telah meriwayatkan hadits ini dari [Abdul Malik bin 'Umair], dia mengatakan; dari [Ibnu Muhammad bin Abdullah bin Salam] dari [kakeknya yaitu Abdullah bin Salam]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 203
			}
		}
	]
}