{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3837,
			"arabicnumber": 3837,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengabarkan kepada kami [Ahmad bin Abu Syu'aib Al Harrani] telah mengabarkan kepada kami [Muhammad bin Salamah Al Harrani] dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim] dari [Malik bin Abu 'Amir] dia berkata; seorang laki-laki datang menemui [Thalhah bin Ubaidillah] seraya berkata; \"Wahai Abu Muhammad, apakah anda tahu orang dari Yaman ini -maksudnya Abu Hurairah-, apakah dia lebih mengetahui tentang hadits Rasulullah shallallahu 'alaihi wasallam dari pada kalian?, karena kami telah mendengar darinya apa yang belum pernah kami mendengarnya dari kalian, atau dia cuma mengatakan atas nama Rasulullah shallallahu 'alaihi wasallam sesuatu yang belum pernah beliau sabdakan.\" Thalhah berkata; \"Adapun perkataannya, bahwa dia pernah mendengar Rasulullah shallallahu 'alaihi wasallam terhadap sesuatu yang belum pernah kami dengar, maka aku tidak ragu lagi akan hal itu, bahwa dia memang mendengar Rasulullah shallallahu 'alaihi wasallam sesuatu yang belum pernah kami dengar, sebab dia adalah orang miskin yang tidak memiliki sesuatu, dia sebagai tamu Rasulullah shallallahu 'alaihi wasallam. tangannya selalu menyertai tangan Rasulullah shallallahu 'alaihi wasallam, sedangkan kami memiliki rumah-rumah dan selalu kecukupan, kami datang kepada Rasulullah shallallahu 'alaihi wasallam hanya di awal dan di akhir siang, maka aku tidak ragu lagi bila dia mendengar sesuatu dari Rasulullah shallallahu 'alaihi wasallam apa yang tidak kami dengar, dan kami juga tidak pernah mendapati seseorang yang memiliki kebaikan, yang berkata atas nama Rasulullah shallallahu 'alaihi wasallam terhadap sesuatu yang tidak beliau katakan.\" Abu Isa berkata; \"Hadits ini adalah hadits gharib, kami tidak mengenalnya kecuali dari hadits Muhammad bin Ishaq, [Yunus bin Bukair] dan yang lain juga meriwayatkan hadits tersebut dari [Muhammad bin Ishaq]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 237
			}
		}
	]
}