{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3879,
			"arabicnumber": 3879,
			"text": "Telah menceritakan kepada kami [Yahya bin Durusta Al Bashri] telah menceritakan kepada kami [Hammad bin Zaid] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] dia berkata; Dahulu para sahabat berusaha keras mencari kebaikan dengan menyerahkan hadiah mereka kepada Nabi shallallahu 'alaihi wasallam saat hari giliran beliau di rumah \"Aisyah.\" Aisyah melanjutkan; \"Lalu para sahabatku (isteri isteri Nabi shallallahu 'alaihi wasallam yang lain) berkumpul menuju Ummu Salamah, dan mereka berkata; \"Wahai Ummu Salamah, sesungguhnya orang-orang (para sahabat) berusaha keras mencari kebaikan dengan memberikan hadiah mereka kepada Nabi shallallahu 'alaihi wasallam saat hari giliran beliau di rumah Aisyah, dan sesungguhnya kami menginginkan kebaikan sebagaimana kebaikan yang diinginkan oleh Aisyah, oleh karena itu, katakanlah kepada Rasulullah shallallahu 'alaihi wasallam supaya beliau memerintahkan para sahabat untuk memberi hadiah mereka kepada beliau di mana saja beliau berada (di antara rumah isteri-isteri beliau).\" Akhirnya Ummu Salamah menuturkan hal itu kepada beliau, namun beliau hanya berpaling, kemudian beliau kembali kepadanya, dan Ummu Salamah mengulangi kembali perkataannya, ia berkata; \"Wahai Rasulullah, sesungguhnya para sahabatku (isteri isteri Nabi) menuturkan bahwa orang-orang (para sahabat Nabi) berusaha keras mencari kebaikan dengan memberikan hadiah mereka (kepada Rasulullah shallallahu 'alaihi wasallam) tepat pada hari giliran beliau bersama Aisyah, oleh karena itu perintahkan orang-orang untuk menyerahkan hadiah mereka di mana saja anda berada.\" Ketika Ummu Salamah mengatakan hal itu hingga tiga kali, beliau bersabda: \"Wahai Ummu Salamah, janganlah kamu menyakiti diriku karena Aisyah, karena tidaklah wahyu di turunkan kepadaku, dan aku berada dalam satu selimut bersama seorang wanita dari kalian melainkan Aisyahlah orangnya.\" Abu Isa berkata; \"Hadits ini adalah hadits hasan gharib, dan sebagian mereka meriwayatkan hadits ini dari Hammad bin Zaid dari Hisyam bin 'Urwah dari ayahnya dari Nabi shallallahu 'alaihi wasallam secara mursal, dan Hadits ini diriwayatkan juga dari [Hisyam bin Urwah] dari ['Auf bin Al Harits] dari [Rumaitsah] dari [Ummu Salamah] sesuatu dari ini.\" Lalu hadits ini juga diriwayatkan dari Hisyam bin 'Urwah dengan riwayat yang berbeda-beda, dan [Sulaiman bin Bilal] juga meriwayatkan dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] seperti hadits Hammad bin Zaid",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 279
			}
		}
	]
}