{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 395,
			"arabicnumber": 395,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yahya An Naisaburi] berkata; telah menceritakan kepada kami [Muhammad bin Abdullah Al Anshari] berkata; telah mengabarkan kepadaku [Asy'ats] dari [Ibnu Sirin] dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] bahwa Nabi shallallahu 'alaihi wasallam shalat bersama para sahabat kemudian lupa, beliau lalu sujud dengan dua kali sujud. Setelah itu beliau tasyahud dan salam.\" Abu Isa berkata; \"Hadits ini derajatnya hasan gharib. Muhammad bin Sirin meriwayatkan hadits yang berbeda dari Abu Al Muhallab, ia adalah paman Abu Qilabah. Sedangkan [Muhammad] meriwayatkan hadits ini dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Abu Al Muhallab] dan Abu Al Muhallab namanya adalah Abdurrahman bin 'Amru, disebut juga dengan nama Mu'awiyah bin 'Amru. [Abdul Wahhab Ats Tsaqafi] dan [Husyaim] dan beberapa orang meriwayatkan hadits ini dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dengan (lafadz) sempurna. Yaitu hadits Imran bin Hushain bahwa Nabi shallallahu 'alaihi wasallam salam di rakaat ketiga pada shalat asar. Maka berdirilah seorang laki-laki yang bernama Hirbaq. Para ahli ilmu berselisih berkenaan dengan tasyahud dalam dua sujud sahwi. Sebagian mereka berkata; \"Hendaknya seseorang bertasyahud dalam dua sujud tersebut kemudian salam.\" Sedangkan yang lainnya berkata; \"Pada dua sujud itu tidak ada tasyahud dan salam, jika ia melakukan sujud tersebut sebelum salam ia tidak harus bertasyahud.\" Ini adalah pendapat yang diambil oleh Ahmad dan Ishaq, keduanya berkata; \"Jika seseorang melakukan dua sujud sahwi sebelum salam maka ia tidak perlu bertasyahud",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 248
			}
		}
	]
}