{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"3": "The Book on Al-Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdurrahman bin Abu Al Mawali] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] dia berkata, adalah Rasulullah Shallahu 'alaihi wa sallam mengajari kami (shalat) istikharah dalam semua perkara, sebagaimana beliau mengajari kami surat dalam Al Qur'an, beliau bersabda: \"Jika salah seorang dari kalian memiliki hajat (kebutuhan) dengan suatu perkara, hendaknya dia shalat sunnah dua raka'at, kemudian mengucapkan ALLAHUMMA INNI ASTAKHIRUKA BI 'ILMIKA WA ASTAQDIRUKA BIQADRATIKA WA AS'ALUKA MIN FADLLIKAL 'ADZIM, FAINNAKA TAQDIRU WALAA AQDIR, WA TA'LAMU WALAA A'LAM WA ANTAL 'ALLAAMUL GHUYUB, ALLAHUMMA INKUNTA TA'LAM ANNA HADZAL AMRA KHAIRUN LII FII DIINI WA MA'ISYATII WA 'AAQIBATI AMRII AU QAALA FII 'AAJILI AMRII WA AAJILIHI FAYASIRHU LII TSUMMA BAARIKLII FIIHI, WA INKUNTA TA'LAM ANNA HADZAL AMRA SYARRUN LII FII DIINI WA MA'ISYATII WA 'AAQIBATI AMRII AU QAALA FII 'AAJILI AMRII WA AAJILIHI FASHRIFHU 'ANNII WASHRIFNII 'ANHU WAQDURLII KHAIRA HAITSU KAANA TSUMMA ARDLINII BIHI. (\"Ya Allah, sesungguhnya aku meminta pilihan yang tepat kepadaMu dengan ilmu pengetahuanMu dan aku mohon kekuasaanMu (untuk mengatasi persoalanku) dengan kemahakuasaanMu. Aku mohon kepadaMu sesuatu dari anugerahMu Yang Maha Agung, sesungguhnya Engkau Mahakuasa, sedang aku tidak kuasa, Engkau mengetahui, sedang aku tidak mengetahuinya dan Engkau adalah Maha Mengetahui hal yang ghaib. Ya Allah, apabila Engkau mengetahui bahwa urusan ini (orang yang mempunyai hajat hendak-nya menyebut persoalannya) lebih baik dalam agamaku, dan akibatnya terhadap diriku atau -Nabi bersabda: …di dunia atau akhirat- sukseskanlah untukku, mudahkan jalannya, kemudian berilah berkah. Akan tetapi apabila Engkau mengetahui bahwa persoalan ini lebih berbahaya bagiku dalam agama, perekonomian dan akibatnya kepada diriku, maka singkirkan persoalan tersebut, dan jauhkan aku daripadanya, takdirkan kebaikan untukku di mana saja kebaikan itu berada, kemudian berilah kerelaanMu kepadaku).\" Beliau lantas bersabda: \"Kemudian dia mengatakan apa yang menjadi kebutuhannya.\" dalam bab ini (ada juga riwayat -pent) dari Abdullah bin Mas'ud dan Abu Ayyub. Abu Isa berkata, hadits Jabir adalah hadits shahih gharib, kami tidak mengetahuinya melainkan dari hadits Abdurrahman bin Abu Al Mawali, dia adalah syaikh Madini, seorang yang tsiqah. Sufyan At Tsauri juga telah meriwayatkan hadits darinya, dan tidak cuma seorang dari para ulama yang meriwayatkan hadits dari Abdurrahman, dia adalah Abdurrahman bin Zaid bin Abu Al Mawali",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		}
	]
}