{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 49,
			"arabicnumber": 49,
			"text": "telah menceritakan kepada kami [Hannad] dan [Qutaibah] mereka berkata; telah menceritakan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari [Abu Hayyah] ia berkata; \"Aku melihat [Ali] berwudlu, ia membasuh kedua telapak tangannya hingga bersih, lalu ia berkumur tiga kali, memasukkan air ke dalam hidung tiga kali, membasuh wajah tiga kali, membasuh kedua siku tiga kali, dan mengusap kepalanya satu kali. Lalu membasuh telapak kakinya hingga mata kaki, kemudian ia berdiri seraya mengambil sisa air wudlu dan meminumnya, sedang ia masih dalam keadaan berdiri. Setelah itu ia berkata; \"Aku senang bisa memperlihatkan kepada kalian bagaimana Rasulullah shallallahu 'alaihi wasallam berwudlu.\" Dalam bab ini juga ada riwayat dari Utsman, Abdullah bin Zaid, Ibnu Abbas, Abdullah bin 'Amru, Ar Rabi', Abdullah bin Unais dan Aisyah, semoga Allah meridlai mereka.\" Telah menceritakan kepada kami [Qutaibah] dan [Hannad] mereka berkata; telah menceritakan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari [Abdu Khair], ia menyebutkan dari [Ali] sebagaimana hadits Abu Hayyah, hanya saja Abdu Khair mengatakan; \"Jika Ali selesai dari bersuci, ia mengambil sisa air wudlunya dengan telapak tangan, setelah itu ia meminumnya.\" Abu Isa berkata; \"Hadits Ali ini diriwayatkan oleh [Abu Ishaq Al Hamdani], dari [Abdu Khair] dan [Al Harits] dari [Ali]. Dan diriwayatkan pula oleh [Za`idah bin Qudamah] dan selainnya dari [Khalid bin Alqamah], dari [Abdu Khair], dari [Ali] Radliaallahu 'ahu (hadits tentang wudlu secara sempurna). Dan hadits ini derajatnya hasan shahih. Abu Isa berkata; \"Syu'bah meriwayatkan hadits ini dari Khalid bin Alqamah, namun ia keliru dalam menyebutkan namanya dan juga nama bapaknya. Ia mengatakan; \"Malik bin Urfuthah dari Abdu Khair dari Ali.\" Abu Isa berkata; \"Hadits ini juga diriwayatkan oleh [Abu 'Awanah], dari [Khalid bin Alqamah], dari [Abdu Khair], dari [Ali].\" Ia berkata; \"Hadits diriwayatkan dari Malik bin Urfuthah sebagaimana dalam riwayat Syu'bah. Sedang yang benar adalah Khalid bin Alqamah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 49
			}
		}
	]
}