{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "Telah menceritakan kepada kami ['Abdul Wahhab bin 'Abdul Hakam Al Warraq Al Baghdadi] telah menceritakan kepada kami [Yahya bin Sulaim] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] dia berkata, saya bepergian bersama Nabi Shallahu 'alaihi wa sallam, Abu Bakar, Umar dan Utsman, maka mereka melaksanakan shalat Dzuhur dan Ashar dua raka'at-dua raka'at, mereka tidak melakukan shalat sebelum maupun sesudahnya, Abdullah berkata, jika saya melakukan shalat sebelum atau sesudahnya niscaya saya akan menyempurnakan shalatku. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Umar, Ali, Ibnu Abbas, Anas, Imran bin Hushain dan A'isyah. Abu Isa berkata, hadits Ibnu Umar adalah hadits hasan gharib, kami tidak mengetahuinya kecuali dari hadits Yahya bin Sulaim yang seperti ini. Muhammad bin Isma'il berkata, hadits ini telah diriwayatkan dari 'Ubaidullah bin Umar dari seorang lelaki keluarga Suraqah dari Abdullah bin Umar, Abu Isa berkata, telah diriwayatkan dari ['Athiyyah Al Aufi] dari [Ibnu Umar] bahwa Nabi Shallahu 'alaihi wa sallam melaksanakan shalat sunnah tathawwu' dalam bepergian baik sebelum dan sesudah shalat, dan telah shahih dari Nabi Shallahu 'alaihi wa sallam bahwa beliau mengqashar (meringkas) shalatnya sewaktu bepergian, begitu juga Abu Bakar, Umar dan awal-awal dari kekhilafahan Utsman, hadits ini diamalkan oleh kebanyakan ahli ilmu dari kalangan para sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya, telah diriwayatkan dari A'isyah bahwa dia menyempurnakan shalat sewaktu safar (bepergian), namun yang berlaku adalah sebagaimana apa yang telah diriwayatkan dari Nabi Shallahu 'alaihi wa sallam dan para sahabatnya, ini adalah pendapat Imam Syafi'i, Ahmad dan Ishaq, namun Imam Syafi'I berkata, mengqashar (meringkas shalat) adalah sebuah keringanan bagi musafir, jika dia menyempurnakan shalat maka itu sah-sah saja",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		}
	]
}