{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Hisyam bin Ishaq] dia adalah Ibnu Abdullah bin Kinanah dari [ayahnya] dia berkata, Al Walid bin Uqbah seorang gubernur Madinah mengutusku kepada [Ibnu Abbas] untuk menanyakan tentang shalat ististqa'nya Rasulullah Shalallahu 'alaihi wa salam, saya pun mendatanginya, dia berkata, sesungguhnya Rasulullah Shalallahu 'alaihi wa salam keluar rumah dengan penuh ketundukan, tawadlu' dan kerendahan sehingga tiba di tempat shalat, beliau tidak berkhutbah seperti khutbah kalian ini, akan tetepi beliau tidak henti hentinya berdo'a, merendah, bertakbir dan melaksanakan shalat dua raka'at seperti ketika shalat Ied. Abu Isa berkata, hadits ini hasan shahih. Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Hisyam bin Ishaq bin Abdullah bin Kinanah] dari [ayahnya], kemudian dia menyebutkan hadits yang semakna dengannya, namun dia menambahkan \"dengan penuh kekhusyu'an\" Abu Isa berkata, hadits ini hasan shahih, ini juga pendapat Imam Syafi'i, dia berkata, pelaksanaan shalat ististqa' sebagaimana shalat Ied (Iedul Fitri dan Iedul Adlha), pada raka'at pertama takbir tujuh kali dan pada raka'at kedua lima kali, dengan berdalilkan hadits Ibnu Abbas. Abu Isa berkata, telah diriwayatkan dari Malik bin Anas bahwa dia berkata \"tidak ada takbir dalam shalat ististqa' seperti takbir dalam shalat Ied, An Nu'man Abu Hanifah berkata, tidak ada pelaksanaan shalat istisqa' dan saya tidak memerintahkan mereka memindahkan selendang, akan tetapi hendaknya mereka berdo'a kemudian mereka kembali secara keseluruhan. Abu Isa berkata, ini merupakan pendapat yang menyelisihi As Sunnah",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		}
	]
}