{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] telah menceritakan kepada kami [Waki'] dari [Ibnu Abu Dzi'b] dari [Yazid bin Abdullah bin Qusaith] dari ['Atha' bin Yasar] dari [Zaid bin Tsabit] dia berkata, saya membaca surat An najm dihadapan Rasulullah Sallallahu 'alaihi wasallam, namun beliau tidak sujud (tilawah). Abu 'Isa berkata, hadits Zaid bin Tsabit adalah hadits hasan shahih. sebagian ahlul ilmi memberikan penjelasan tentang hadits ini bahwa tidak sujudnya Nabi Shalallahu 'alaihi wa salam dikarenakan Zaid bin Tsabit, selaku qari' tidak sujud, mereka juga berpendapat bahwa sujud tilawah hukumnya wajib bagi siapa saja yang mendengar tanpa memberikan rukhshah didalamnya, bahkan mereka berkata, jika seseorang mendengarnya dalam keadaan tidak berwudlu' kemudian berwudlu, maka wajib baginya bersujud, perkataan ini merupakan pendapat Sufyan Ats Tsauri dan Ahli Kufah serta Ishaq. Sebagian dari ahlul ilmi berpendapat sujud tilawah disyare'atkan bagi siapa yang ingin bersujud dan mengharapkan keutamaan serta boleh juga untuk tidak dikerjakan. Mereka berhujjah dengan hadits shahih yaitu hadits Zaid bin Tsabit yang berkata, saya membaca surat An najm dihadapan Rasulullah Sallallahu 'alaihi wasallam, namun beliau tidak sujud (tilawah). Mereka juga berhujjah dengan hadits yang diriwayatkan oleh Umar, bahwasanya beliau membaca ayat As Sajdah di atas mimbar, lalu beliau turun dan langsung bersujud, kemudian membacanya lagi pada Jum'at berikutnya tatkala orang-orang bersiap-siap untuk bersujud, beliau bersabda: \"Sesungguhnya sujud tilawah tidak diwajibkan atas kita, hanya bagi siapa yang ingin melakukannya.\" Pada waktu itu beliau tidak sujud, demikian juga dengan orang-orang. Oleh karena itu sebagian ahlul ilmi berpegang pada pendapat ini, juga merupakan pendapatnya Syafi'i dan Ahmad",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		}
	]
}