{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha'] dari [Ali Al Azdi] dari [Ibnu Umar] dari Nabi Shalallahu 'alaihi wa salam beliau bersabda: \" Shalat sunnah di waktu malam dan siang hari dilakukan sebanyak dua raka'at- dua raka'at.\" Abu 'Isa berkata, Para sahabat Syu'bah berselisih pendapat mengenai hadits Ibnu Umar, sebagian dari mereka memarfu'kannya dan sebagian lagi memauqufkannya. Diriwayatkan dari [Abdullah Al Umary] dari [Nafi'] dari [Ibnu Umar] dari Nabi Sallallahu 'alaihi wasallam seperti lafazh hadits diatas. Riwayat yang paling shahih ialah riwayat dari Ibnu Umar sesungguhnya Nabi Sallallahu 'alaihi wasallam bersabda: \"Shalat sunnah pada malam hari dilakukan sebanyak dua raka'at-dua raka'at.\" Dan para perawi yang tsiqah meriwayatkan hadits ini dari Ibnu Umar dari Nabi Sallallahu 'alaihi wasallam tanpa menyebut Shalat Nahar (pada siang hari). Dan telah diriwayatkan dari Ubaidullah dari Naf'i dari Ibu Umar bahwasanya beliau shalat sunnah pada malam hari dua raka'at-dua raka'at dan pada siang hari empat raka'at-empat raka'at. Oleh karena itu para ahlul ilmi berselisih pendapat dalam masalah ini, Imam Syafi'i dan Ahmad berpendapat bahwa shalat sunnah pada waktu malam ataupun siang hari sebanyak dua raka'at-dua raka'at, sedangkan Imam Sufyan Ats Tsauri, Ibnu Al Mubarak dan Ishaq berpendapat bahwa shalat sunnah pada malam hari dua raka'at-dua raka'at dan pada siang hari empat raka'at-empat raka'at seperti shalat sunnah empat raka'at sebelum zhuhur maupun shalat sunnah yang lainnya",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 54
			}
		}
	]
}