{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 61,
			"arabicnumber": 61,
			"text": "telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [Bapaknya] ia berkata; \"Nabi shallallahu 'alaihi wasallam selalu berwudlu ketika akan shalat. Dan pada hari penaklukan kota Makkah, beliau mengerjakan semua shalat dengan satu wudlu dan mengusap khufnya. Lalu Umar berkata; \"Sungguh, engkau melakukan sesuatu yang tidak biasa engkau lakukan, \" beliau menjawab: \"Aku sengaja melakukannya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih.\" [Ali bin Qadim] meriwayatkan hadits ini dari [Sufyan Ats Tsauri], lalu ia menambahkan, \"Rasulullah berwudlu dengan satu kali-satu kali.\" Ia berkata; \"Dan [Sufyan Ats Tsauri] juga meriwayatkan hadits ini dari [Muharib bin Ditsar], dari [Sulaiman bin Buraidah], dari Nabi shallallahu 'alaihi wasallam, bahwasanya beliau selalu berwudlu ketika akan shalat. Dan [Waki'] meriwayatkannya dari [Sufyan], dari [Muharib], dari [Sulaiman bin Buraidah], dari [bapaknya]. [Abdurrahman bin Mahdi] dan selainnya meriwayatkannya dari [Sufyan], dari [Muharib bin Ditsar], dari [Sulaiman bin Buraidah], dari Nabi shallallahu 'alaihi wasallam secara mursal, dan ini lebih shahih dari hadits Waki'. Para ahli ilmu mengamalkan hadits ini, yaitu bahwa Rasulullah melakukan beberapa shalat dengan satu kali wudlu selama belum batal. Namun di antara mereka ada yang berwudlu setiap kali akan mengerjakan shalat karena ada anjuran dan demi mendapatkan keutamaan.\" Diriwayatkan pula dari Al Afriqi, dari Abu Ghuthaif, dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa berwudlu dalam keadaan masih suci maka Allah akan menuliskan baginya sepuluh kebaikan.\" Namun hadits ini sanadnya lemah. Dan dalam bab ini ada riwayat dari Jabir bin Abdullah bahwa Nabi shallallahu 'alaihi wasallam shalat zhuhur dan ashar dengan satu wudlu",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 61
			}
		}
	]
}