{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"7": "The Book on Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 666,
			"arabicnumber": 666,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] telah menceritakan kepada kami [Yahya bin Adam] dari [Ibnu Al Mubarak] dari [Yunus bin Yazid] dari [Az Zuhri] dari [Sa'id bin Al Musayyib] dari [Shafwan bin 'Umayyah] dia berkata, Rasulullah Shalallahu 'alaihi wa sallam memberiku bagian dari rampasan perang Hunain, padahal waktu itu beliau adalah orang yang paling saya benci, namun beliau terus saja memberiku bagian hingga menjadi orang yang paling saya cintai. Abu 'Isa berkata, telah menceritakan kepada kami Al Hasan bin Ali dengan hadits ini atau yang semakna dengannya dalam Al Mudzakarah. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Sa'id. Abu 'Isa berkata, hadits Sufwan telah diriwayatkan oleh [Ma'mar] dan yang lainnya dari [Az Zuhri] dari [Sa'id bin Al Musayyib], bahwasanya [Shafwan] berkata, Rasulullah Shalallahu 'alaihi wa salam memberiku bagian …\" sepertinya riwayat ini lebih shahih. Para ulama berselisih pendapat mengenai masalah ini, kebanyakan ulama berpendapat bahwa Al Muallafatu qulubuhum pada zaman sekarang tidak berhak mendapatkan zakat/pemberian, karena hadits ini khusus untuk Nabi Shallallaahu 'alaihi wasallam yaitu ketika beliau membujuk mereka untuk masuk Islam dengan harta benda sampai mereka masuk Islam. Ini merupakan pendapatnya Sufyan Ats Tsauri dan penduduk kufah serta pendapatnya Ahmad dan Ishaq. Sedangkan Imam Syafi'i berpendapat, jika sekarang ini terdapat muallaf yang sama keadaannya dengan muallaf pada zaman Nabi lalu imam membujuk mereka untuk masuk Islam dengan harta maka hal itu boleh dilakukan",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 50
			}
		}
	]
}