{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 735,
			"arabicnumber": 735,
			"text": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Katsir bin Hisyam] telah menceritakan kepada kami [Ja'far bin Burqan] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata, Suatu hari saya dan Hafshah berpuasa, lalu dihadiahkan kepada kami makanan yang kami sukai, lantas kami memakannya, tiba-tiba Nabi datang lalu Hafshah mendahuluiku untuk menghampirinya -sebagaimana sifat ayahnya- seraya berkata, wahai Rasulullah, tadinya kami berpuasa, lalu dihadiahkan kepada kami makanan yang kami sukai, lantas kami memakannya, beliau pun bersabda: \" Berpuasalah pada hari yang lain sebagai gantinya.\" Abu 'Isa berkata, [Shalih bin Abu Akhdlar] dan [Muhammad bin Abu Hafshah] telah meriwayatkan hadits ini dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] secara mursal seperti hadits di atas. Sedangkan [Malik bin Anas] dan [Ma'mar] dan ['Ubaidullah bin Umar] dan [Ziyad bin Sa'ad] serta lebih dari satu huffazh hadits telah meriwayatkan hadits ini dari [Az Zuhri] dari ['Aisyah] secara mursal, namun tidak disebutkan di dalamnya dari 'Urwah. Riwayat ini lebih shahih karena diriwayatkan dari [Ibnu Juraij], dia berkata, saya bertanya kepada [Az Zuhri], apakah 'Urwah meriwayatkan hadits ini kepadamu dari 'Aisyah? Dia menjawab, saya tidak pernah mendengar satu haditspun dalam hal ini dari 'Urwah, namun saya mendengar pada masa kekhilafahan Sulaiman bin 'Abdul Malik dari [beberapa orang] yang bertanya kepada ['Aisyah] tentang hadits ini. Telah menceritakan kepada kami seperti itu [Ali bin 'Isa bin Yazid Al Baghdadi], telah menceritakan kepada kami [Rauh bin 'Ubadah] dari [Ibnu Juraij] lalu dia menuturkan hadits di atas. Sebagian ulama dari kalangan shahabat Nabi Shalallahu 'alaihi wa salam berpegang kepada hadits ini, mereka berpendapat, orang yang membatalkan puasanya harus mengqadla', ini juga merupakan pendapatnya Anas bin Malik",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		}
	]
}