{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 774,
			"arabicnumber": 774,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Muhammad bin Rafi' An Naisaburi] dan [Mahmud bin Ghailan] dan [Yahya bin Musa] mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] dari [Ma'mar] dari [Yahya bin Abu Katsir] dari [Ibrahim bin Abdullah bin Qarizh] dari [As Sa`ib bin Yazid] dari [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang membekam dan yang dibekam puasanya telah batal\". Abu 'Isa berkata; \"Hadits yang semakna diriwayatkan dari 'Ali, Sa'ad, Syaddad bin Aus, Tsauban, Usamah bin Zaid, 'Aisyah, Ma'qil bin Sinan atau yang bernama Ibnu Yasar, Abu Hurairah, Ibnu Abbas, Abu Musa, Bilal dan Sa'ad.\" Abu 'Isa berkata; \"Hadits Rafi' bin Khadij merupakan hadits hasan shahih. Disebutkan bahwa Ahmad bin Hambal berkata; 'Hadits yang paling shahih dalam hal ini ialah haditsnya Rafi' bin Khudaij.' Ali bin Abdullah berkata; 'Hadits yang paling shahih dalam hal ini ialah haditsnya Tsauban dan Syaddad bin Aus karena Yahya bin Abu Katsir meriwayatkan dari Abu Qilabah kedua hadits tersebut. Sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam membenci berbekam untuk orang yang sedang berpuasa hingga sebagian sahabat Nabi berbekam pada malam hari. Di antaranya adalah: Abu Musa dan Ibnu Umar. Hal ini juga merupakan pendapatnya Ibnul Mubarak.\" Abu 'Isa berkata; \"Saya mendengar Ishaq bin Manshur berkata; 'Abdurrahman bin Mahdi berkata; \"Barang siapa yang berbekam ketika berpuasa maka wajib mengqadlanya.\" Ishaq bin Manshur berkata; \"Demikian itu pendapatnya Ahmad dan Ishaq, telah menceritakan kepada kami Az Za'farani berkata; Syafi'i berkata; 'telah diriwayatkan dari Nabi shallallahu 'alaihi wasallam bahwasanya beliau berbekam ketika berpuasa. Diriwayatkan juga dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Orang yang membekam dan yang dibekam puasanya telah batal\". Namun saya tidak tahu hadits mana yang tsabit (dapat dijadikan pedoman) dari Nabi shallallahu 'alaihi wasallam. Jika orang yang berpuasa berhati-hati dan tidak berbekam itu lebih aku sukai, akan tetapi jika dia berbekam menurutku hal itu tidak membatalkan puasa. Abu 'Isa berkata; \"Perkataan tadi merupakan pendapatnya Syafi'i di Bagdad. Adapun pendapatnya di Mesir, beliau berpendapat bolehnya orang yang berpuasa untuk berbekam dan tidak membatalkan puasa, beliau berhujjah dengan hadits yang diriwayatkan dari Nabi bahwa beliau berbekam pada waktu Haji Wada' dalam keadaan sedang ihramdan berpuasa",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 93
			}
		}
	]
}