{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 792,
			"arabicnumber": 792,
			"text": "Telah menceritakan kepada kami [Harun bin Ishaq Al Hamdani] telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] berkata; \"Rasulullah shallallahu 'alaihi wasallam senantiasa ber'itikaf pada sepuluh hari terakhir Ramadlan dan beliau bersabda: 'Raihlah malam lailatul Qodar pada sepuluh hari terakhir'.\" Hadits semakna diriwayatkan dari Umar, Ubay bin Ka'ab, Jabir bin Samurah, Jabir bin Abdullah, Ibnu Umar, Al Falatan bin 'Ashim, Anas, Abu Sa'id, Abdullah bin Unais, Abu Bakrah, Ibnu Abbas, Bilal, dan Ubadah bin Shamit. Abu 'Isa berkata; \"Hadits 'Aisyah merupakan hadits hasan shahih, dan arti dari perkataan berliau \"yujawiru\" yaitu ber'itikaf. Kebanyakan riwayat dari Nabi shallallahu 'alaihi wasallam dalam hal memakai lafazh: \"Raihlah Lailatul Qodar pada sepuluh malam terakhir di malam yang ganjil\". Diriwayatkan juga dari Nabi shallallahu 'alaihi wasallam bahwa lailatul qodar diraih pada malam dua puluh satu, dua puluh tiga, dua puluh lima, dua puluh tujuh dan dua puluh sembilan serta malam terakhir bulan Ramadlan. Abu 'Isa berkata; \"Syafi'i berkata; 'Itu hanya pendapatku. Allah lebih tahu. Nabi shallallahu 'alaihi wasallam menjawab pertanyaan kami seperti yang sebelumnya. Beliau akan menjawab sebagaimana yang pertama. Ditanyakan kepada beliau, yang bisa mencarinya pada malam yang demikian\". Lalu beliau kabarkan: \"Carilah pada malam yang sekian…\". Syafi'i berkata; riwayat yang paling kuat menurutku ialah riwayat malam ke dua puluh satu.\" Abu 'Isa berkata; \"Diriwayatkan juga dari Ubay bin Ka'ab. Dia bersumpah bahwa lailatul Qodar diraih pada malam ke dua puluh tujuh. Dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengabari kami tanda-tandanya lalu kami hapalkan.\" Diriwayatkan dari Abu Qilabah bahwa beliau berkata; \"Malam lailatul qodar itu berpindah-pindah pada sepuluh hari terakhir.\" Telah menceritakan kepadaku Abdu bin Humaid telah mengabarkan kepada kami Abdurrazzaq dari Ma'mar dari Ayyub dari Abu Qilabah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 111
			}
		}
	]
}