{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 809,
			"arabicnumber": 809,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits bin Sa'ad] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Syuraih Al 'Adawi] bahwa dia berkata kepada Amru bin Sa'id -ketika itu dia sedang mengirim pasukan ke Makkah-: \"Wahai 'Amir, izinkan saya untuk menyampaikan sabda Rasulullah shallallahu 'alaihi wasallam dalam khutbahnya pada hari kedua Fathu Makkah -saya mendengarnya dengan kedua telingaku, saya fahami dalam hati serta saya melihatnya dengan mata kepala saya ketika beliau mengucapkannya- Beliau bertahmid dan memuji Allah kemudian bersabda: \"Allah Ta'ala telah mengharamkan Makkah, namun manusia tidak mengharamkannya. Tidak halal bagi seseorang yang beriman kepada Allah dan Hari Akhir untuk menumpahkan darah di dalamnya, menumbangkan pohon. Jika seseorang melakukannya dan beralasan dengan perangnya Rasulullah shallallahu 'alaihi wasallam di Makkah, maka katakan kepadanya; 'Allah telah mengizinkannya untuk RasulNya shallallahu 'alaihi wasallam dan tidak mengizinkannya untukmu. (Allah Ta'ala) mengizinkannya hanya beberapa saat saja pada waktu siang. Pada hari ini, keharamannya telah kembali seperti semula. Hendaknya orang yang hadir menyampaikan kepada orang yang tidak hadir!\" Ditanyakan kepada Syuraih; \"Apa jawaban Amru bin 'Ubaid untukmu?\" Syuraih melanjutkan; \"Dia berkata; 'Saya lebih tahu daripadamu, wahai Abu Syuraih. Tanah haram tidak dapat melindungi orang yang berbuat maksiat, orang yang melarikan diri karena membunuh dan orang kabur dari pencurian'.\" Abu 'Isa berkata; \"Di lain riwayat dengan lafazh 'Orang yang membawa lari jizyah'.\" (Abu Isa At Tirmidzi) berkata; \"Hadits semakna diriwayatkan dari Abu Hurairah dan Ibnu Abbas.\" Abu 'Isa berkata; \"Hadits Abu Syuraih merupakan hadits hasan shahih dan Abu Syuraih Al Khuza'i bernama Khuwailid bin Amru Al 'Adawi, Al Ka'bi. Arti dari perkataannya 'WA LAA FAARRAN BIKHARBATIN\" ialah tindak pidana. Dia mengatakan; 'Barangsiapa yang melakukan tindak pidana atau membunuh lalu berlindung di Makkah, maka tetap akan dijatuhi hukuman",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		}
	]
}