{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari ['Umarah bin Ghaziyyah] dari [Abu Hazim] dari [Sahl bin Sa'ad] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang muslim bertalbiyah kecuali yang berada di samping kanan dan kirinya akan ikut bertalbiyah, baik itu batu, pohon dan tanah keras hingga ke ujung bumi.\" Telah menceritakan kepada kami [Al Hasan bin Muhammad Az Za'farani] dan [Abdurrahman bin Al Aswad, Abu Amru Al Bashri] keduanya berkata; telah menceritakan kepada kami ['Abidah bin Humaid] dari ['Umarah bin Ghaziyyah] dari [Abu Hazim] dari [Sahl bin Sa'ad] dari Nabi shallallahu 'alaihi wasallam seperti hadits Isma'il bin Ayyasy. (Abu Isa At Tirmidzi) berkata; \"Hadits semakna diriwayatkan dari Ibnu Umar dan Jabir.\" Abu 'Isa berkata; \"Hadits Abu Bakr merupakan hadits gharib. Tidak kami ketahui kecuali dari hadits Ibnu Abu Fudaik dari Dlahhak bin Utsman dan Muhammad bin Al Munkadir. Dia tidak mendengar hadits dari Abdurrahman bin Yarbu'. Tapi Muhammad bin Al Munkadir meriwayatkan hadits dari Sa'id bin Abdurrahman bin Yarbu' dari ayahnya selain hadits ini. Abu Nu'aim Ath Thahhan, Dlirar bin Shurad meriwayatkan hadits ini dari Ibnu Abu Fudaik dari Dlahhak bin Utsman dari Muhammad bin Al Munkadir dari Sa'id bin Abdurrahman bin Yarbu' dari ayahnya dari Abu Bakr dari Nabi shallallahu 'alaihi wasallam, namun Dlirar melakukan kesalahan di dalamnya.\" Abu 'Isa berkata; \"Saya mendengar Ahmad bin Al Hasan berkata; Ahmad bin Hanbal berkata; 'Barang siapa yang mengatakan hadits ini diriwayatkan dari Muhammad bin Al Munkadir dari Ibnu Abdurrahman bin Yarbu' dari ayahnya, sungguh dia telah melakukan kesalahan'.\" (Abu Isa At Tirmidzi) berkata; \"Saya telah mendengar Muhammad, ketika saya sebutkan hadits Dlirar bin Shurad dari Ibnu Abu Fudaik, berkata; 'Ini suatu kesalahan.' Lalu saya katakan; 'Selain dia telah meriwayatkannya dari Ibnu Abu Fudaik, juga sebagaimana riwayatnya.' Maka dia berkata; 'hal itu tidak kuat, karena mereka meriwayatkannya dari Ibnu Abu Fudaik namun tidak menyebutkan di dalamnya dari Sa'id bin Abdurrahman'. Saya melihat (Muhammad) mendla'ifkan Dlirar bin Shurad. Al 'Ajju ialah mengangkat suara ketika bertalbiyah dan ats tsajju ialah menyembelih hewan kurban",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		}
	]
}