{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 87,
			"arabicnumber": 87,
			"text": "telah menceritakan kepada kami [Abu Ubaidah bin Abu As Safar (yaitu) Ahmad bin Abdullah Al Hamdani Al Kufi]. Dan [Ishaq bin Manshur] berkata; telah menceritakan kepada kami [Abu Ubaidah], Ishaq berkata; telah mengabarkan kepada kami [Abdu Ashshamad bin Abdul Warits] berkata, telah menceritakan kepadaku [Bapakku] dari [Husain Al Mu'allim] dari [Yahya bin Abu Katsir] berkata; telah menceritakan kepadaku [Abdurrahman bin 'Amru Al Auza'i] dari [Ya'isy Ibnul Walid Al Makhzumi] dari [Bapaknya] dari [Ma'dan bin Abu Thalhah] dari [Abu Darda`] bahwa Rasulullah shallallahu 'alaihi wasallam muntah, lalu beliau berbuka dan berwudlu. Abu Darda' berkata; \"Lalu aku bertemu dengan [Tsauban] di masjid Damaskus, aku kabarkan hal itu kepadanya, maka ia pun berkata, \"Benar, bahkan akulah yang menuangkan air wudlu kepada beliau.\" Abu Isa berkata; Ishaq bin Manshur berkata; \"Ma'dan bin Thalhah.\" Abu Isa berkata; \"Sedangkan Ibnu Abu Thalhah lebih shahih.\" Abu Isa berkata; \"Tidak hanya satu orang ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan tabi'in yang berpendapat bahwa seseorang itu harus berwudlu karena muntah atau darah (mimisan). Pendapat ini diambil oleh Sufyan Ats Tsauri, Ibnul Mubarak, Ahmad dan Ishaq.\" Sedangkan sebagian ulama berpendapat bahwa seseorang tidak harus berwudlu karena muntah atau mimisan. Pendapat ini diambil oleh Malik dan Syafi'. Husain Al Mu'allim menganggap bahwa hadits ini baik. Dan hadits Husain adalah hadits yang paling baik dalam bab ini. Ma'mar meriwayatkan hadits ini dari Yahya bin Abu Katsir, namun ia salah di dalamnya. Ia berkata; \"Dari Ya`isy Ibnul Walid, dari Khalid bin Ma'dan, dari Abu Darda`, dan ia tidak menyebutkan di dalamnya nama Al Auza'i. Ia menyebutkan dari Khalid bin Ma'dan, padahal ia adalah Ma'dan bin Abu Thalhah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 87
			}
		}
	]
}