{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Waki'] dari [Hisyam Ad Dastuwa`i] dari [Qatadah] dari [Abu Hassan Al A'raj] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam mengalungkan sepasang sandal pada badan hewan sembelihan yang sebelah kanan dan dan memberi tanda hewan kurbannya di Dzul Hulaifah. Beliau juga menghilangkan darah dari hewan itu. (Abu Isa At Tirmidzi) berkata; \"Hadits semakna diriwayatkan dari Al Miswar bin Makhramah.\" Abu 'Isa berkata; \"Hadits Ibnu Abbas merupakan hadits hasan shohih dan Abu Al Hasan Al 'Araj bernama Muslim. Hadits ini diamalkan oleh para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan yang lainnya. Mereka berpendapat disunnahkannya untuk memberi tanda pada hewan sembelihan, ini juga merupakan pendapat Ats Tsauri, Syafi'i, Ahmad dan Ishaq. (Abu Isa At Tirmidzi) berkata; \"Saya telah mendengar Yusuf bin 'Isa berkata; Saya mendengar Waki' berkomentar ketika meriwayatkan hadits ini; 'Jangan kalian mendengar perkataan orang yang berpegang pada akal dalam masalah ini. Memberi tanda pada hewan ialah sunnah dan pendapat mereka ialah bid'ah'.\" (Abu Isa At Tirmidzi) berkata; \"Saya telah mendengar Abu Sa`ib berkata; Tatkala kami bersama Waki', dia berkata kepada seseorang di dekatnya yang berpegang pada akal bahwa Rasulullah shallallahu 'alaihi wasallam memberi tanda pada hewan, sedangkan Abu Hanifah mengatakan; itu merupakan bentuk penganiayaan kepada hewan. Orang itu berkata; hal itu telah diriwayatkan dari Ibrahim An Nakha'i bahwa dia mengatakan; memberi tanda pada hewan merupakan bentuk penganiayaan. Abu Sa`ib berkata; 'Lalu saya melihat Waki' menjadi sangat marah sambil berkata; Saya sampaikan sabda Rasulullah shallallahu 'alaihi wasallam, engkau malah membantah dengan perkataan Ibrahim. Sungguh engkau pantas untuk dipenjara dan tidak dikeluarkan sampai kamu menarik ucapanmu ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 99
			}
		}
	]
}