{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"15": "Invoking Allah for Rain (Istisqaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "بَابُ انْتِقَامِ الرَّبِّ عَزَّ وَجَلَّ مِنْ خَلْقِةِ بِالْقَحْطِ إِذَا انْتُهِكَتْ مَحَارِمُهُ ১৫/৫. অধ্যায়ঃ আল্লাহর সৃষ্টজীবের মধ্য হতে কেউ তাঁর হারামকৃত বিধানসমূহের সীমা অতিক্রম করলে মহিমাময় প্রতিপালক কর্তৃক দুর্ভিক্ষ দ্বারা শাস্তি প্রদান। ১০১৩. আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি জুমু‘আহ’র দিন মিম্বরের সোজাসুজি দরওয়াজা দিয়ে (মসজিদে) প্রবেশ করল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দাঁড়িয়ে খুৎবা দিচ্ছিলেন। সে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সম্মুখে দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! গবাদি পশু ধ্বংস হয়ে গেল এবং রাস্তাগুলোর চলাচল বন্ধ হয়ে গেল। সুতরাং আপনি আল্লাহর কাছে দু‘আ করুন, যেন তিনি আমাদের বৃষ্টি দেন। বর্ণনাকারী বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তাঁর উভয় হাত তুলে দু‘আ করলেন, হে আল্লাহ্! বৃষ্টি দিন, হে আল্লাহ্! বৃষ্টি দিন, হে আল্লাহ্! বৃষ্টি দিন। আনাস (রাযি.) বলেন, আল্লাহর কসম! আমরা তখন আকাশে মেঘমালা, মেঘের চিহ্ন বা কিছুই দেখতে পাইনি। অথচ সাল‘আ (মদিনার একটি পাহাড়) পর্বত ও আমাদের মধ্যে কোন ঘর-বাড়ি ছিল না। আনাস (রাযি.) বলেন, হঠাৎ সাল‘আ পর্বতের পিছন হতে ঢালের মত মেঘ বেরিয়ে এল এবং তা মধ্য আকাশে পৌঁছে বিস্তৃত হয়ে পড়ল। অতঃপর বর্ষণ শুরু হল। তিনি বলেন, আল্লাহর কসম! আমরা ছয়দিন সূর্য দেখতে পাইনি। অতঃপর এক ব্যক্তি পরবর্তী জুমু‘আহ’র দিন সে দরজা দিয়ে (মসজিদে) প্রবেশ করল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দাঁড়িয়ে খুৎবাহ দিচ্ছিলেন। লোকটি দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! ধন-সম্পদ ধ্বংস হয়ে গেল এবং রাস্তাঘাটও বিচ্ছিন্ন হয়ে গেল। কাজেই আপনি আল্লাহর নিকট বৃষ্টি বন্ধের জন্য দু‘আ করুন। আনাস (রাযি.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উভয় হাত তুলে দু‘আ করলেন, হে আল্লাহ্! আমাদের আশেপাশে, আমাদের উপর নয়; টিলা, পাহাড়, উচ্চভূমি, মালভূমি, উপত্যকা এবং বনভূমিতে বর্ষণ করুন। আনাস (রাযি.) বলেন, এতে বৃষ্টি বন্ধ হয়ে গেল এবং আমরা (মাসজিদ হতে বেরিয়ে) রোদে চলতে লাগলাম। শরীক (রহ.) (বর্ণনাকারী) বলেন, আমি আনাস (রাযি.)-কে জিজ্ঞেস করলাম, এ লোকটি কি আগের সেই লোকটি? তিনি বললেন, আমি জানি না। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৫২, ইসলামিক ফাউন্ডেশনঃ ৯৫৮)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		}
	]
}