{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "মাহমূদ (রহ.) বলেন যে, ইতবান ইবনু মালিক আনসারী (রাযি.)-কে (যিনি ছিলেন বদর জিহাদে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে উপস্থিত বদরী সাহাবীগণের অন্যতম) বলতে শুনেছেন যে, আমি আমার কাওম বনূ সালিমের সালাতে ইমামাত করতাম। আমার ও তাদের (কাওমের মসজিদের) মধ্যে ছিল একটি উপত্যকা। বৃষ্টি হলে উপত্যকা আমার মাসজিদ গমনে বাধা সৃষ্টি করতো এবং এ উপত্যকা অতিক্রম করে তাদের মসজিদে যাওয়া আমার জন্য কষ্টকর হতো। তাই আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খিদমতে হাযির হয়ে আরয করলাম, (হে আল্লাহর রাসূল!) আমি আমার দৃষ্টিশক্তির কমতি অনুভব করছি (উপরন্তু) আমার ও আমার গোত্রের মধ্যকার উপত্যকাটি বৃষ্টি হলে প্লাবিত হয়ে যায়। তখন তা পার হওয়া আমার জন্য কষ্টকর হয়ে পড়ে। তাই আমার একান্ত আশা যে আপনি শুভাগমন করে আমার ঘরের কোন স্থানে সালাত আদায় করবেন; আমি সে স্থানটিকে সালাতের স্থানরূপে নির্ধারিত করে নিব। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, শীঘ্রই তা করবো। পরের দিন সূর্যের উত্তাপ যখন বেড়ে গেল, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং আবূ বাকর (রাযি.) আসলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (প্রবেশের) অনুমতি চাইলে আমি তাঁকে স্বাগত জানালাম, তিনি উপবেশন না করেই আমাকে জিজ্ঞেস করলেন, তোমার ঘরের কোন্ জায়গায় আমার সালাত আদায় করা তুমি পছন্দ কর? যে স্থানে সালাত আদায় করা আমার মনঃপূত ছিল, তাঁকে আমি সে স্থানের দিকে ইঙ্গিত করে দিলাম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে তাকবীর বললেন, আমরা সারিবদ্ধভাবে তাঁর পিছনে দাঁড়ালাম। তিনি দু’রাক‘আত সালাত আদায় করে সালাম ফিরালেন। তাঁর সালাম ফেরানোর সময় আমরাও সালাম ফিরালাম। অতঃপর তাঁর উদ্দেশে যে খাযীরা প্রস্তুত করা হচ্ছিল তা আহারের জন্য তাঁর প্রত্যাগমনে আমি বিলম্ব ঘটালাম। ইতিমধ্যে মহল্লার লোকেরা আমার বাড়িতে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অবস্থানের সংবাদ শুনতে পেয়ে তাঁদের কিছু লোক এসে গেলেন। এমন কি আমার ঘরে অনেক লোকের সমাগম ঘটলো। তাঁদের একজন বললেন, মালিক (ইবনু দুখায়শিন) করল কী? তাকে দেখছি না যে? তাঁদের একজন জবাব দিলেন, সে মুনাফিক! আল্লাহ্ ও তাঁর রাসূলকে ভালবাসে না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করলেনঃ এমন কথা বলবে না। তুমি কি লক্ষ্য করছ না যে, আল্লাহর সন্তুষ্টি কামনায় ‘লা- ইলা-হা ইল্লাল্লাহু’ উচ্চারণ করেছে। সে ব্যক্তি বলল, আল্লাহ্ ও তাঁর রাসূলই অধিক অবগত। তবে আল্লাহর কসম! আমরা মুনাফিকদের সাথেই তার ভালবাসা ও আলাপ-আলোচনা দেখতে পাই। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করলেনঃ আল্লাহ্ তা‘আলা সে ব্যক্তিকে জাহান্নামের জন্য হারাম করে দিয়েছেন, যে ব্যক্তি আল্লাহর সন্তুষ্টির উদ্দেশে ‘লা- ইলা-হা ইল্লাল্লাহু’ উচ্চারণ করে। মাহমূদ (রাযি.) বলেন, এক যুদ্ধ চলাকালীন সময়ে একদল লোকের নিকট বর্ণনা করলাম তাঁদের মধ্যে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাহাবী আবূ আইয়ুব (আনসারী) (রাযি.) ছিলেন। তিনি সে যুদ্ধে ওফাত পেয়েছিলেন। আর ইয়াযীদ ইবনু মু‘আবিয়া (রাযি.) রোমানদের দেশে তাদের আমীর ছিলেন। আবূ আইয়ুব (রাযি.) আমার বর্ণিত হাদীসটি অস্বীকার করে বললেন, আল্লাহর কসম! তুমি যে কথা বলেছ তা যে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন, তা আমি বিশ্বাস করতে পারি না। ফলে তা আমার নিকট ভারী মনে হল। তখন আমি আল্লাহর নামে প্রতিজ্ঞা করলাম যে, যদি এ যুদ্ধ হতে প্রত্যাবর্তন পর্যন্ত তিনি আমাকে নিরাপদ রাখেন, তাহলে আমি ইত্বান ইবনু মালিক (রাযি.)-কে তাঁর কাউমের মসজিদের বিষয়ে জিজ্ঞেস করবো, যদি তাঁকে জীবিত অবস্থায় পেয়ে যাই। অতঃপর আমি ফিরে চললাম এবং হাজ্জ কিংবা উমরার নিয়্যাতে ইহরাম করলাম। অতঃপর সফর করতে করতে আমি মদিনা্য় উপনীত হয়ে বনূ সালিম গোত্রে উপস্থিত হলাম। দেখতে পেলাম ‘ইত্বান (রাযি.) যিনি তখন একজন বৃদ্ধ ও অন্ধ ব্যক্তি কাউমের সালাতে ইমামাত করছেন। তিনি সালাত সমাপ্ত করলে আমি তাঁকে সালাম দিলাম এবং আমার পরিচয় দিয়ে উক্ত হাদীস সম্পর্কে তাঁকে জিজ্ঞেস করলাম। তিনি প্রথমবারের মতই হাদীসটি আমাকে শুনালেন। (৪২৪) (আধুনিক প্রকাশনীঃ ১১০৯ শেষাংশ, ইসলামিক ফাউন্ডেশনঃ ১১১৪)",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 62
			}
		}
	]
}