{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"22": "Forgetfulness in Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "কুরায়ব (রহ.) হতে বর্ণিত। ইবনু ‘আব্বাস, মিসওয়ার ইবনু মাখরামাহ এবং ‘আবদুর রহমান ইবনু আযহার (রাযি.) তাঁকে ‘আয়িশাহ্ (রাযি.)-এর নিকট পাঠালেন এবং বলে দিলেন, তাঁকে আমাদের সকলের তরফ হতে সালাম পৌঁছিয়ে আসরের পরের দু’রাক‘আত সালাত সম্পর্কে জিজ্ঞেস করবে। তাঁকে একথাও বলবে যে, আমরা খবর পেয়েছি যে, আপনি সে দু’রাক‘আত আদায় করেন, অথচ আমাদের নিকট পৌঁছেছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে দু’রাক‘আত আদায় করতে নিষেধ করেছেন। ইবনু ‘আব্বাস (রাযি.) সংবাদে আরও বললেন যে, আমি ‘উমার ইবনু খাত্তাব (রাযি.)-এর সাথে এ সালাতের কারণে লোকদের মারধোর করতাম। কুরায়ব (রহ.) বলেন, আমি ‘আয়িশাহ্ (রাযি.)-এর নিকট গিয়ে তাঁকে তাঁদের পয়গাম পৌঁছিয়ে দিলাম। তিনি বললেন, উম্মু সালামাহ্ (রাযি.)-কে জিজ্ঞেস কর। [কুরায়ব (রহ.) বলেন] আমি সেখান হতে বের হয়ে তাঁদের নিকট গেলাম এবং তাঁদেরকে ‘আয়িশাহ্ (রাযি.)-এর কথা জানালাম। তখন তাঁরা আমাকে ‘আয়িশাহ্ (রাযি.)-এর নিকট যে বিষয় নিয়ে পাঠিয়েছিলেন, তা নিয়ে পুনরায় উম্মু সালামাহ (রাযি.)-এর নিকট পাঠালেন। উম্মু সালামাহ্ (রাযি.) বললেন, আমিও নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে তা নিষেধ করতে শুনেছি। অথচ অতঃপর তাঁকে আসরের সালাতের পর তা আদায় করতেও দেখেছি। একদা তিনি ‘আসরের সালাতের পর আমার ঘরে আসলেন। তখন আমার নিকট বনূ হারাম গোত্রের আনসারী কয়েকজন মহিলা উপস্থিত ছিলেন। আমি বাঁদীকে এ বলে তাঁর নিকট পাঠালাম যে, তাঁর পাশে গিয়ে দাঁড়িয়ে তাঁকে বলবে, উম্মে সালামাহ (রাযি.) আপনার নিকট জানতে চেয়েছেন, আপনাকে (‘আসরের পর সালাতের) দু’রাক‘আত নিষেধ করতে শুনেছি; অথচ দেখছি, আপনি তা আদায় করছেন? যদি তিনি হাত দিয়ে ইঙ্গিত করেন, তাহলে পিছনে সরে থাকবে, বাঁদী তা-ই করল। তিনি ইঙ্গিত করলেন, সে পিছনে সরে থাকল। সালাত শেষ করে তিনি বললেন, হে আবূ উমায়্যার কন্যা! ‘আসরের পরের দু’রাক‘আত সালাত সম্পর্কে তুমি আমাকে জিজ্ঞেস করেছ। আবদুল কায়স গোত্রের কিছু লোক আমার নিকট এসেছিল। তাদের কারণে যুহরের পরের দু’রাকা‘আত আদায় করতে না পেরে (তাদেরকে নিয়ে) ব্যস্ত হয়ে পড়েছিলাম। এ দু’রাক‘আত সে দু’রাক‘আত।* (৪৩৭০; মুসলিম ৬/৫৪, হাঃ ৭৩৪) (আধুনিক প্রকাশনীঃ ১১৫৪, ইসলামিক ফাউন্ডেশনঃ ১১৬১)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		}
	]
}