{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"22": "Forgetfulness in Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "قَالَهُ كُرَيْبٌ عَنْ أُمِّ سَلَمَةَ رَضِيَ اللهُ عَنْهَا عَنِ النَّبِيِّ صلى الله عليه وسلم. কুরাইব (রহ.) উম্মু সালামাহ্ (রাযি.) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ সম্পর্কে বর্ণনা করেছেন। ১২৩৪. সাহল ইবনু সা‘দ সা‘ঈদী (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট সংবাদ পৌঁছে যে, বানূ আমর ইবনু আওফ-এ কিছু ঘটেছে। তাদের মধ্যে আপোষ করে দেয়ার উদ্দেশে তিনি কয়েকজন সাহাবীসহ বেরিয়ে গেলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে কর্মব্যস্ত হয়ে পড়েন। ইতোমধ্যে সালাতের সময় হয়ে গেল। বিলাল (রাযি.) আবূ বাকর (রাযি.)-এর নিকট এসে বললেন, হে আবূ বাকর! আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কর্মব্যস্ত হয়ে পড়েছেন। এদিকে সালাতের সময় হয়ে গেছে, আপনি কি সালাতে লোকদের ইমামাত করতে প্রস্তুত আছেন? তিনি বললেন, হাঁ, যদি তুমি চাও। তখন বিলাল (রাযি.) ইক্বামাত(ইকামত/একামত) বললেন এবং আবূ বাকর (রাযি.) সামনে এগিয়ে গিয়ে লোকদের জন্য তাকবীর বললেন। এদিকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসলেন এবং কাতারের ভিতর দিয়ে হেঁটে (প্রথম) কাতারে এসে দাঁড়িয়ে গেলেন। মুসল্লীগণ তখন হাততালি দিতে লাগলেন। আবূ বাকর (রাযি.)-এর অভ্যাস ছিল যে, সালাতে এদিক সেদিক তাকাতেন না। মুসল্লীগণ যখন অধিক পরিমাণে হাততালি দিতে লাগলেন, তখন তিনি সেদিকে তাকালেন এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখতে পেলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে ইঙ্গিত করে সালাত আদায় করতে থাকার নির্দেশ দিলেন। আবূ বাকর (রাযি.) দু’হাত তুলে আল্লাহর হামদ বর্ণনা করলেন এবং পিছনের দিকে সরে গিয়ে কাতারে দাঁড়ালেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সামনে এগিয়ে লোকদের নিয়ে সালাত আদায় করলেন। সালাত শেষ করে মুসল্লীগণের প্রতি লক্ষ্য করে বললেন, হে লোক সকল! তোমাদের কী হয়েছে, সালাতে কোন ব্যাপার ঘটলে তোমরা হাততালি দিতে থাক কেন? হাততালি তো মেয়েদের জন্য। কারো সালাতের মধ্যে কোন সমস্যা দেখা দিলে সে যেন ‘সুবহানাল্লাহ্’ বলে। কারণ, কেউ অন্যকে ‘সুবহানাল্লাহ্’ বলতে শুনলে অবশ্যই সেদিকে লক্ষ্য করবে। অতঃপর তিনি বললেন, হে আবূ বাকর! তোমাকে আমি ইঙ্গিত করা সত্ত্বেও কিসে তোমাকে লোকদের নিয়ে সালাত আদায় করতে বাধা দিল? আবূ বাকর (রাযি.) বললেন, কুহাফার ছেলের জন্য এ সমীচীন নয় যে, সে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সম্মুখে দন্ডায়মান হয়ে সালাত আদায় করবে। (৬৮৪) (আধুনিক প্রকাশনীঃ ১১৫৫, ইসলামিক ফাউন্ডেশনঃ ১১৬২)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		}
	]
}