{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"23": "Funerals (Al-Janaa'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "সামুরাহ ইবনু জুনদুব (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ফজর) সালাত শেষে আমাদের দিকে মুখ ফিরিয়ে বসতেন এবং জিজ্ঞেস করতেন, তোমাদের কেউ গত রাতে কোন স্বপ্ন দেখেছ কি? (বর্ণনাকারী) বলেন, কেউ স্বপ্ন, দেখে থাকলে তিনি তা বিবৃত করতেন। তিনি তখন আল্লাহ্‌র মর্যী মুতাবিক তাবীর বলতেন। একদা আমাদেরকে প্রশ্ন করলেন, তোমাদের কেউ কি কোন স্বপ্ন দেখেছ? আমরা বললাম, জী না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ গত রাতে আমি দেখলাম, দু’জন লোক এসে আমার দু’হাত ধরে আমাকে পবিত্র ভূমির দিকে নিয়ে চললো। হঠাৎ দেখতে পেলাম, এক ব্যক্তি বসে আছে আর এক ব্যক্তি লোহার আঁকড়া হাতে দাঁড়িয়ে। [ইমাম বুখারী (রহ.) বলেন] আমাদের এক সাথী মু‘সা (রহ.) বর্ণনা করেছেন যে, দাঁড়ানো ব্যক্তি বসে থাকা ব্যক্তির (এক পাশের) চোয়ালটা এমনভাবে আঁকড়া বিদ্ধ করছিল যে, তা (চোয়াল বিদীর্ণ করে) মস্তকের পিছনের দিক পর্যন্ত পৌঁছে যাচ্ছিল। অতঃপর অপর চোয়ালটিও আগের মত বিদীর্ণ করল। ততক্ষণে প্রথম চোয়ালটা জোড়া লেগে যাচ্ছিল। আঁকড়াধারী ব্যক্তি পুনরায় সেরূপ করছিল। আমি জিজ্ঞেস করলাম, এ কী হচ্ছে? সাথীদ্বয় বললেন, (পরে বলা হবে এখন) চলুন। আমরা চলতে চলতে চিৎ হয়ে শায়িত এক ব্যক্তির পাশে এসে উপস্থিত হলাম, তার মাথার নিকট পাথর হাতে এক ব্যক্তি দাঁড়িয়ে পাথর দিয়ে তার মাথা চূর্ণ করে দিচ্ছিল। নিক্ষিপ্ত পাথর দূরে গড়িয়ে যাওয়ার ফলে তা তুলে নিয়ে শায়িত ব্যক্তির নিকট ফিরে আসার পূর্বেই বিচূর্ণ মাথা আগের মত জোড়া লেগে যাচ্ছিল। সে পুনরায় মাথার উপরে পাথর নিক্ষেপ করছিল। আমি জিজ্ঞেস করলাম, লোকটি কে? তাঁরা বললেন, চলুন। আমরা অগ্রসর হয়ে তন্দুরের ন্যায় এক গর্তের নিকট উপস্থিত হলাম। গর্তের উপরিভাগ ছিল সংকীর্ণ ও নীচের অংশ প্রশস্ত এবং এর তলদেশ হতে আগুন জ্বলছিল। আগুন গর্তের মুখের নিকটবর্তী হলে সেখানের লোকগুলোও উপরে চলে আসে যেন তারা গর্ত হতে বের হয়ে যাবে। আগুন ক্ষীণ হয়ে গেলে তারাও (তলদেশে) ফিরে যায়। গর্তের মধ্যে বহুসংখ্যক উলঙ্গ নারী-পুরুষ ছিল। জিজ্ঞেস করলাম, এরা কারা? তাঁরা বললেন, চলুন। আমরা চলতে চলতে একটি রক্ত প্রবাহিত নদীর কাছে হাযির হলাম। নদীর মাঝখানে এক ব্যক্তি দাঁড়ানো ছিল। নদীর তীরে অপর এক ব্যক্তি যার সামনে ছিল পাথর। নদীর মাঝখানের লোকটি নদী হতে বের হয়ে আসার জন্য অগ্রসর হলেই তীরে দাঁড়ানো লোকটি সে ব্যক্তির মুখ বরাবর পাথর নিক্ষেপ করছিল, এতে সে পূর্বস্থানে ফিরিয়ে দিচ্ছিল। এমনভাবে যতবার সে তীরে উঠে আসতে চেষ্টা করে ততবার সে ব্যক্তি তার মুখ বরাবর পাথর নিক্ষেপ করে পূর্বস্থানে ফিরে যেতে বাধ্য করে। আমি জানতে চাইলাম, এ ঘটনার কারণ কী? তাঁরা বললেন, চলতে থাকুন। আমরা চলতে চলতে একটি সবুজ বাগানে উপস্থিত হলাম। এতে একটি বড় গাছ ছিল। গাছটির গোড়ায় এক বৃদ্ধ ও বেশ কিছু বালক-বালিকা ছিল। হঠাৎ দেখি যে, গাছটির সন্নিকটে জনৈক ব্যক্তি আগুন জ্বালাচ্ছে। সাথীদ্বয় আমাকে নিয়ে গাছে আরোহণ করে এমন একটি বাড়িতে প্রবেশ করলেন যার চেয়ে সুদৃশ্য বাড়ি ইতিপূর্বে কখনো দেখিনি। বাড়িতে বহু সংখ্যক বৃদ্ধ, যুবক, নারী এবং বালক-বালিকা ছিল। অতঃপর তাঁরা আমাকে সেখান হতে বের করে নিয়ে গাছে আরো উপরে আরোহণ করে অপর একটি বাড়িতে প্রবেশ করালেন। এটা পূর্বাপেক্ষা অধিক সুদৃশ্য ও মনোরম। বাড়িটিতে ছিল কতিপয় বৃদ্ধ ও যুবক। আমি বললাম, আজ রাতে আপনারা আমাকে (বহুদূর পর্যন্ত) ভ্রমণ করালেন। এবার বলুন, যা দেখলাম তার তাৎপর্য কী? তাঁরা বললেন, না, আপনি যে ব্যক্তির চোয়াল বিদীর্ণ করার দৃশ্য দেখলেন সে মিথ্যাবাদী; মিথ্যা কথা বলে বেড়াতো, তার বিবৃত মিথ্যা বর্ণনা ক্রমাগত বর্ণিত হয়ে দূর দূরান্তে পৌঁছে যেতো। ক্বিয়ামাত (কিয়ামত) পর্যন্ত তার সঙ্গে এ ব্যবহার করা হবে। আপনি যার মাথা চূর্ণ করতে দেখলেন, সে এমন ব্যক্তি যাকে আল্লাহ্ কুরআনের শিক্ষা দান করেছিলেন, কিন্তু রাতের বেলায় সে কুরআন হতে বিরত হয়ে নিদ্রা যেতো এবং দিনের বেলায় কুরআন অনুযায়ী ‘আমল করতো না। তার সাথে ক্বিয়ামাত (কিয়ামত) পর্যন্ত এরূপই করা হবে। গর্তের মধ্যে যাদেরকে আপনি দেখলেন, তারা ব্যভিচারী। (রক্ত প্রবাহিত) নদীতে আপনি যাকে দেখলেন, সে সুদখোর। গাছের গোড়ায় যে বৃদ্ধ ছিলেন তিনি ইব্রাহীম (আঃ) এবং তাঁর চারপাশের বালক-বালিকারা মানুষের সন্তান। যিনি আগুন জ্বালাচ্ছিলেন তিনি হলেন, জাহান্নামের খাযিন-মালিক নামক ফেরেশ্তা। প্রথম যে বাড়িতে আপনি প্রবেশ করলেন তা সাধারণ মু’মিনদের বাসস্থান। আর এ বাড়িটি হলো শহীদগণের আবাস। আমি (হলাম) জিব্রাঈল আর ইনি হলেন মীকাঈল। (এরপর জিব্রাঈল আমাকে বললেন) আপনার মাথা উপরে উঠান। আমি উঠিয়ে মেঘমালার মত কিছু দেখলাম। তাঁরা বললেন, এটাই হলো আপনার আবাসস্থল। আমি বললাম, আমাকে ছেড়ে দিন আমি আমার আবাসস্থলে প্রবেশ করি। তাঁরা বললেন, এখনো আপনার আয়ু কিছু সময়ের জন্য রয়ে গেছে, যা এখনো পূর্ণ হয়নি। অবশিষ্ট সময় পূর্ণ হলে অবশ্যই আপনি স্বীয় আবাসে চলে আসবেন। (৮৪৫) (আধুনিক প্রকাশনীঃ ১২৯৫, ইসলামিক ফাউন্ডেশনঃ ১৩০৩)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 138
			}
		}
	]
}