{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "وَقَالَ طَاوُسٌ قَالَ مُعَاذٌ رَضِيَ اللَّهُ عَنْهُ لأَهْلِ الْيَمَنِ ائْتُونِي بِعَرْضٍ ثِيَابٍ خَمِيصٍ أَوْ لَبِيسٍ فِي الصَّدَقَةِ، مَكَانَ الشَّعِيرِ وَالذُّرَةِ أَهْوَنُ عَلَيْكُمْ، وَخَيْرٌ لأَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ. وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَأَمَّا خَالِدٌ احْتَبَسَ أَدْرَاعَهُ وَأَعْتُدَهُ فِي سَبِيلِ اللَّهِ». وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ». فَلَمْ يَسْتَثْنِ صَدَقَةَ الْفَرْضِ مِنْ غَيْرِهَا، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي خُرْصَهَا وَسِخَابَهَا، وَلَمْ يَخُصَّ الذَّهَبَ وَالْفِضَّةَ مِنَ الْعُرُوضِ তাউস (রহ.) বলেন, মু‘আয (ইবনু জাবাল) (রাঃ) ইয়ামানবাসীদেরকে বললেন, তোমরা যব ও ভুট্টার পরিবর্তে চাদর বা পরিধেয় বস্ত্র আমার কাছে যাকাত স্বরূপ নিয়ে এস। ওটা তোমাদের পক্ষেও সহজ এবং মদিনা্য় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাহাবীগণের জন্যও উত্তম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ খালিদ ইবনু ওয়ালীদ (রাঃ)-এর ব্যাপার হলো এই যে, সে তার বর্ম ও যুদ্ধাস্ত্র আল্লাহর পথে ওয়াক্ফ করে দিয়েছে। (মহিলাদের লক্ষ্য করে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা তোমাদের অলংকার হতে হলেও সদাকাহ কর। [ইমাম বুখারী (রহ.) বলেন,] নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পণ্যদ্রব্যের যাকাত সেই পণ্য দ্বারাই আদায় করতে হবে এমন নির্দিষ্ট করে দেননি। তখন মহিলাগণ কানের দুল ও গলার হার খুলে দিতে আরম্ভ করলেন, [ইমাম বুখারী (রহ.) বলেন] সোনা ও রূপার বিষয়টি পণ্যদ্রব্য হতে পৃথক করেননি (বরং উভয় প্রকারেই যাকাত স্বরূপ গ্রহণ করা হতো)। (আধুনিক প্রকাশনীঃ অনুচ্ছেদ ৩৪ , ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ৯১৫) ১৪৪৮. আনাস (রাঃ) হতে বর্ণিত যে, আবূ বাকর (রাঃ) আনাস (রাঃ)-এর কাছে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে আল্লাহ তা‘আলা যাকাত সম্পর্কে যে বিধান দিয়েছেন সে সম্পর্কে লিখে জানালেন, যে ব্যক্তির উপর যাকাত হিসেবে বিনতে মাখায[1] ওয়াজিব হয়েছে কিন্তু তার কাছে তা নেই বরং বিনত্ লাবূন[2] রয়েছে, তা হলে তা-ই (যাকাত স্বরূপ) গ্রহণ করা হবে। এ অবস্থায় যাকাত আদায়কারী যাকাত দাতাকে বিশটি দিরহাম বা দু’টি বকরী দিবে। আর যদি বিনতে মাখায না থাকে বরং ইবনু লাবূন থাকে তা হলে তা-ই গ্রহণ করা হবে। এমতাবস্থায় আদায়কারীর যাকাত দাতাকে কিছু দিতে হবে না। (১৪৫০, ১৪৫১, ১৪৫৩, ১৪৫৪, ১৪৫৫, ২৪৮৭, ৩১০৬, ৫৮৭৮, ৬৯৫৫) (আধুনিক প্রকাশনীঃ ১৩৫৫, ইসলামিক ফাউন্ডেশনঃ ১৩৬১)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 51
			}
		}
	]
}