{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, হাজ্জে তামাত্তু‘ সম্পর্কে তাঁর নিকট জানতে চাওয়া হলে তিনি বললেন, বিদায় হাজ্জের বছর আনসার ও মুহাজির সাহাবীগণ, নবী-সহধর্মিণীগণ ইহরাম বাঁধলেন, আর আমরাও ইহরাম বাঁধলাম। আমরা মক্কা্য় পৌঁছলে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা হাজ্জ-এর ইহরামকে ‘উমরায় পরিণত কর। তবে যারা কুরবানীর পশুর গলায় মালা ঝুলিয়েছে, তাদের কথা ব্যতিক্রম (তারা ইহরাম ভঙ্গ করতে পারবে না)। আমরা বাইতুল্লাহর তাওয়াফ ও সাফা মারওয়ার সা‘য়ী করলাম। এরপর স্ত্রী-সহবাস করলাম এবং কাপড়-চোপড় পরিধান করলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যে ব্যক্তি কুরবানীর জন্য উপস্থিত করার উদ্দেশে পশুর গলায় মালা ঝুলিয়েছে, পশু কুরবানীর স্থানে না পৌঁছা পর্যন্ত সে হালাল হতে পারে না। এরপর যিলহাজ্জ মাসের আট তারিখ বিকালে আমাদেরকে হাজ্জ-এর ইহরাম বাঁধার নির্দেশ দেন। যখন আমরা হাজ্জ-এর সকল কার্য শেষ করে বাইতুল্লাহর তাওয়াফ ও সাফা-মারওয়া সা‘য়ী করে অবসর হলাম, তখন আমাদের হাজ্জ পূর্ণ হল এবং আমাদের উপর কুরবানী করা ওয়াজিব হলো। যেমন মহান আল্লাহ ইরশাদ করেনঃ ‘‘যার পক্ষে সম্ভব সে একটি কুরবানী করবে, আর যার পক্ষে সম্ভব নয় সে হাজ্জ চলাকালে তিনটি সওম পালন করবে এবং ফিরে এসে সাত দিন সওম পালন করবে অর্থাৎ নিজ দেশে ফিরে’’- (আল-বাকারাঃ ১৯৬)। একটি বকরীই দম হিসেবে কুরবানীর জন্য যথেষ্ট। একই বছরে সাহাবীগণ হাজ্জ ও ‘উমরাহ একসাথে আদায় করলেন। আল্লাহ তাঁর কুরআনে এ বিধান নাযিল করেছেন এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ তরীকা জারী করেছেন আর মক্কা্বাসী ব্যতীত অন্যদের জন্য তা বৈধ করেছেন। আল্লাহ ইরশাদ করেনঃ ‘‘(হাজ্জে তামাত্তু‘) তাদের জন্য, যাদের পরিবার-পরিজন মসজিদে হারামের (হারামের সীমার) মধ্যে বাস করে না’’- (আল-বাকারাঃ ১৯৬)। আল্লাহ তাঁর কুরআনে হাজ্জের যে মাসগুলোর কথা উল্লেখ করেছেন তা হলো ঃ শাওয়াল, যিলক্বাদ ও যিলহাজ্জ। যারা এ মাসগুলোতে তামাত্তু‘ হাজ্জ করবে তাদের অবশ্য দম দিতে হবে অথবা সওম পালন করতে হবে। (আধুনিক প্রকাশনীঃ অনুচ্ছেদ ৩৭ এর শেষাংশ) الرَّفَثُ অর্থ স্ত্রী সহবাস, الْفُسُوقُ অর্থ গুনাহ, الْجِدَالُ অর্থ বিবাদ। (আধুনিক প্রকাশনীঃ , ইসলামিক ফাউন্ডেশনঃ পরিচ্ছেদ ৯৯৭)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		}
	]
}