{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "وَقَوْلِهِ تَعَالَى : (وَإِذْ جَعَلْنَا الْبَيْتَ مَثَابَةً لِلنَّاسِ وَأَمْنًا وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى وَعَهِدْنَا إِلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ أَنْ طَهِّرَا بَيْتِيَ لِلطَّائِفِينَ وَالْعَاكِفِينَ وَالرُّكَّعِ السُّجُودِ وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَذَا بَلَدًا آمِنًا وَارْزُقْ أَهْلَهُ مِنْ الثَّمَرَاتِ مَنْ آمَنَ مِنْهُمْ بِاللهِ وَالْيَوْمِ الآخِرِ قَالَ وَمَنْ كَفَرَ فَأُمَتِّعُهُ قَلِيلاً ثُمَّ أَضْطَرُّهُ إِلَى عَذَابِ النَّارِ وَبِئْسَ الْمَصِيرُ وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنْ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ) এবং মহান আল্লাহর বাণীঃ ‘‘এবং সেই সময়কে স্মরণ করুন যখন কা‘বাঘরকে মানব জাতির মিলন কেন্দ্র ও নিরাপত্তা স্থল করেছিলাম এবং বলেছিলাম, তোমরা ইব্রাহীমের দাঁড়াবার স্থানকেই সালাতের স্থানরূপে গ্রহণ কর এবং ইব্রাহীম ও ইসমা‘ঈলকে তাওয়াফকারী, ই‘তিকাফকারী, রুকূ ও সিজদাকারীদের জন্য আমার ঘরকে পবিত্র রাখতে আদেশ দিয়েছিলাম। স্মরণ করুন, যখন ইব্রাহীম বলেছিলেন, হে আমার প্রতিপালক! একে নিরাপদ শহর করুন আর এ অধিবাসীদের মধ্যে যারা আল্লাহ ও পরকালে বিশ্বাসী তাদেরকে ফলমূল হতে জীবিকা প্রদান করুন। তিনি বললেন, যে কেউ কুফরী করবে তাকেও কিছুকালের জন্য জীবনোপভোগ করতে দিব। অতঃপর তাকে জাহান্নামের শাস্তি ভোগ করতে বাধ্য করব এবং তা কত নিকৃষ্ট পরিণাম! স্মরণ করুন, যখন ইবরাহীম ও ইসমা‘ঈল কা’বা ঘরের প্রাচীর তুলছিলেন তখন তারা বলেছিলেন, হে আমাদের প্রতিপালক! আমাদের এ কাজ গ্রহণ করুন, নিশ্চয়ই আপনি সর্বশ্রোতা, সর্বজ্ঞাতা। হে আমাদের প্রতিপালক! আমাদের উভয়কে আপনার একান্ত অনুগত করুন এবং আমাদের বংশধর হতে আপনার এক অনুগত উম্মাত করুন। আমাদেরকে ‘ইবাদাতের নিয়ম-পদ্ধতি দেখিয়ে দিন এবং আমাদের প্রতি ক্ষমাশীল হন, আপনি অত্যন্ত ক্ষমাশীল, পরম দয়ালু।’’ (আল-বাকারাঃ ১২৫-১২৮) ১৫৮২. জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, কা‘বা ঘর পুনর্নির্মাণের সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও ‘আব্বাস (রাঃ) পাথর বহন করছিলেন। ‘আব্বাস (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বললেন, তোমার লুঙ্গিটি কাঁধের ওপর দিয়ে নাও। তিনি তা করলে মাটিতে পড়ে গেলেন এবং তাঁর উভয় চোখ আকাশের দিকে তাকিয়ে থাকল। তখন তিনি বললেনঃ আমার লুঙ্গি দাও এবং তা বেঁধে নিলেন। (৩৬৪) (আধুনিক প্রকাশনীঃ ১৪৭৮, ইসলামিক ফাউন্ডেশনঃ ১৪৮৪)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 68
			}
		}
	]
}