{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "لِقَوْلِهِ تَعَالَى : (إِنَّ الَّذِينَ كَفَرُوا وَيَصُدُّونَ عَنْ سَبِيلِ اللهِ وَالْمَسْجِدِ الْحَرَامِ الَّذِي جَعَلْنَاهُ لِلنَّاسِ سَوَاءً الْعَاكِفُ فِيهِ وَالْبَادِ وَمَنْ يُرِدْ فِيهِ بِإِلْحَادٍ بِظُلْمٍ نُذِقْهُ مِنْ عَذَابٍ أَلِيمٍ) الْبَادِي الطَّارِي (مَعْكُوفًا) مَحْبُوسًا তার কেনা-বেচা এবং বিশেষভাবে মাসজিদুল হারামে সকল মানুষের সমান অধিকার। এ পর্যায়ে আল্লাহর বাণীঃ নিশ্চয়ই যারা কুফরী করে এবং আল্লাহর পথে বাধা সৃষ্টি করে ও মাসজিদুল হারাম থেকে মানুষকে নিবৃত্ত করে, যে মাসজিদুল হারামকে স্থানীয় ও বহিরাগত সব মানুষের জন্য সমান করেছি, আর যে ব্যক্তি তথায় ইচ্ছাপূর্বক অন্যায়ভাবে কোন পাপ কাজ করবে, আমি তাকে যন্ত্রণাদায়ক শাস্তির স্বাদ আস্বাদন করাব।’’ (আল-হাজ্জঃ ২৫) الْبَادِي অর্থ হলো الطَّارِي (আগন্তুক) ও مَعْكُوفًا অর্থ হলো مَحْبُوسًا (আবদ্ধ) ১৫৮৮. উসামাহ ইবনু যায়দ (রাঃ) হতে বর্ণিত। তিনি বললেন, হে আল্লাহর রাসূল! আপনি মক্কা্য় অবস্থিত আপনার বাড়ির কোন্ স্থানে অবস্থান করবেন? তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘আকীল কি কোন সম্পত্তি বা ঘর-বাড়ি অবশিষ্ট রেখে গেছে? ‘আকীল এবং তালিব আবূ তালিবের সম্পত্তির উত্তরাধিকারী হয়েছিলেন, জা‘ফর ও ‘আলী (রাঃ) হননি। কেননা তাঁরা দু’জন ছিলেন মুসলিম। ‘আকীল ও তালিব ছিল কাফির। এজন্যই ‘উমার ইবনু খাত্তাব (রাঃ) বলতেন, মু’মিন কাফির-এর সম্পত্তির উত্তরাধিকারী হয় না। ইবনু শিহাব (যুহরী) (রহ.) বলেন, (পূর্ববর্তীগণ নিম্ন উদ্ধৃত আয়াতে উক্ত বিলায়াতকে উত্তরাধিকার বলে) এই তাফসীর করতেন। আল্লাহ বলেনঃ ‘‘নিশ্চয় যারা ঈমান এনেছে, হিজরাত করেছে, নিজেদের ধন ও প্রাণ দিয়ে আল্লাহর পথে জিহাদ করেছে এবং যারা তাদেরকে আশ্রয় দান করেছে ও সাহায্য করেছে তারা একে অপরের বন্ধু। আর যারা ঈমান এনেছে কিন্তু হিজরাত করেনি তাদের অভিভাবকত্বের দায়িত্ব তোমাদের নেই যে পর্যন্ত না তারা হিজরাত করে। আর যদি তারা দ্বীনের ব্যাপারে তোমাদের সাহায্য চায় তবে তাদের সাহায্য করা তোমাদের অবশ্য কর্তব্য, কিন্তু তোমাদের সাথে যে ক্বাওমের চুক্তি রয়েছে তাদের মুকাবিলায় নয়। তোমরা যা কিছু কর আল্লাহ তা সবই দেখেন।’’ (আল-আনফালঃ ৭২)। (৩০৫৮, ৪২৮২, ৬৭৬৪, মুসলিম ১৫/৮০, হাঃ ১৩৫১, আহমাদ ২১৮২৫) (আধুনিক প্রকাশনীঃ ১৪৮৪, ইসলামিক ফাউন্ডেশনঃ ১৪৯০)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 74
			}
		}
	]
}