{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "(وَالْبُدْنَ جَعَلْنَاهَا لَكُمْ مِنْ شَعَائِرِ اللهِ لَكُمْ فِيهَا خَيْرٌ فَاذْكُرُوا اسْمَ اللهِ عَلَيْهَا صَوَافَّ فَإِذَا وَجَبَتْ جُنُوبُهَا فَكُلُوا مِنْهَا وَأَطْعِمُوا الْقَانِعَ وَالْمُعْتَرَّ كَذَلِكَ سَخَّرْنَاهَا لَكُمْ لَعَلَّكُمْ تَشْكُرُونَ لَنْ يَنَالَ اللهَ لُحُومُهَا وَلاَ دِمَاؤُهَا وَلَكِنْ يَنَالُهُ التَّقْوَى مِنْكُمْ كَذَلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا اللهَ عَلَى مَا هَدَاكُمْ وَبَشِّرْ الْمُحْسِنِينَ) قَالَ مُجَاهِدٌ سُمِّيَتْ الْبُدْنَ لِبُدْنِهَا وَالْقَانِعُ السَّائِلُ وَالْمُعْتَرُّ الَّذِي يَعْتَرُّ بِالْبُدْنِ مِنْ غَنِيٍّ أَوْ فَقِيرٍ وَشَعَائِرُ اسْتِعْظَامُ الْبُدْنِ وَاسْتِحْسَانُهَا وَالْعَتِيقُ عِتْقُهُ مِنْ الْجَبَابِرَةِ وَيُقَالُ وَجَبَتْ سَقَطَتْ إِلَى الأَرْضِ وَمِنْهُ وَجَبَتْ الشَّمْسُ ‘‘আর উটকে আমি করেছি তোমাদের জন্য আল্লাহ্‌র নিদর্শনাবলীর মধ্যে অন্যতম নিদর্শন, তোমাদের জন্য এতে রয়েছে মঙ্গল। সুতরাং সারিবদ্ধভাবে দাঁড় করানো অবস্থায় তাদের উপর তোমরা আল্লাহর নাম উচ্চারণ কর; তারপর যখন তারা কাত হয়ে পড়ে যায় তখন তোমরা তা থেকে খাও এবং সাহায্য কর ধৈর্যশীল অভাবগ্রস্তকে এবং যাচ্ঞাকারী অভাবগ্রস্তকেও। আমি এভাবে ঐ পশুগুলোকে তোমাদের অধীন করে দিয়েছি যেন তোমরা শোকর কর। আর আল্লাহ্‌র কাছে পৌঁছে না এগুলোর গোশত এবং না এগুলোর রক্ত, বরং তাঁর কাছে পৌঁছে তোমাদের তাকওয়া। এভাবেই তিনি এগুলোকে তোমাদের বশীভূত করে দিয়েছেন যেন তোমরা আল্লাহ্‌র মহত্ব ঘোষণা কর, যেহেতু তিনি তোমাদেরকে হিদায়াত দান করেছেন। সুতরাং আপনি সুসংবাদ দিন সৎকর্মশীলদেরকে।’’ (আল-হাজ্জঃ ৩৬-৩৭) মুজাহিদ (রহ.) বলেন, কুরবানীর উটগুলোকে মোটা তাজা হওয়ার কারণে الْبُدْنَ বলা হয়, الْقَائِ অর্থাৎ যাচ্ঞাকারী, الْمُعْتَرُّ ঐ ব্যক্তি, যে ধনী হোক বা দরিদ্র, কুরবানীর উটের গোশত খাওয়ার জন্য ঘুরে বেড়ায়। شَعَائِرُ অর্থাৎ কুরবানীর উটের প্রতি সম্মান করা এবং ভাল জানা। الْعَتِيقُ অর্থাৎ যালিমদের হতে মুক্ত হওয়া وَجَبَتْ অর্থ যমীনে লুটিয়ে পড়ে। এ অর্থেই হল وَجَبَتْ الشَّمْسُ সূর্য অস্তমিত হয়েছে। ১৬৮৯. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে কুরবানীর উট হাঁকিয়ে নিতে দেখে বললেন, এর পিঠে আরোহণ কর। সে বলল, এ তো কুরবানীর উট। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এর পিঠে সওয়ার হয়ে চল। এবারও লোকটি বলল, এ-তো কুরবানীর উট। এরপরও আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এর পিঠে আরোহণ কর, তোমার সর্বনাশ! এ কথাটি দ্বিতীয় বা তৃতীয়বারে বলেছেন। (১৭০৬, ২৭৫৫, ৬১৬০, মুসলিম ১৫/৬৫, হাঃ ১৩২২, আহমাদ ১০৩১৯) (আধুনিক প্রকাশনীঃ ১৫৭৩, ইসলামিক ফাউন্ডেশনঃ ১৫৮০)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 168
			}
		}
	]
}