{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"26": "`Umrah (Minor pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীগণ হাজ্জের ইহরাম বেঁধেছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তালহা (রাঃ) ব্যতীত কারো সাথে কুরবানীর পশু ছিল না। আর ‘আলী (রাঃ) ইয়ামান হতে এলেন এবং তাঁর সঙ্গে কুরবানীর পশু ছিল। তিনি বলেছিলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে বিষয়ে ইহরাম বেঁধেছেন, আমিও তার ইহরাম বাঁধলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ ইহরামকে ‘উমরায় পরিণত করতে এবং তাওয়াফ করে এরপরে মাথার চুল ছোট করে হালাল হয়ে যেতে নির্দেশ দিলেন। তবে যাদের সঙ্গে কুরবানীর জানোয়ার রয়েছে (তারা হালাল হবে না)। তাঁরা বললেন, আমরা মিনার দিকে রওয়ানা হবো এমতাবস্থায় আমাদের কেউ স্ত্রীর সাথে সহবাস করে এসেছে। এ সংবাদ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট পৌঁছলে তিনি বললেনঃ যদি আমি এ ব্যাপার পূর্বে জানতাম, যা পরে জানতে পারলাম, তাহলে কুরবানীর জানোয়ার সঙ্গে আনতাম না। আর যদি কুরবানীর পশু আমার সাথে না থাকত অবশ্যই আমি হালাল হয়ে যেতাম। আর ‘আয়িশাহ্ (রাযি.)-এর ঋতু দেখা দিল। তিনি বায়তুল্লাহর তাওয়াফ ব্যতীত হাজ্জের সব কাজই সম্পন্ন করে নিলেন। রাবী বলেন, এরপর যখন তিনি পাক হলেন এবং তাওয়াফ করলেন, তখন বললেন, হে আল্লাহর রাসূল! আপনারা তো হাজ্জ এবং ‘উমরাহ উভয়টি পালন করে ফিরছেন, আমি কি শুধু হাজ্জ করেই ফিরব? তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আবদুর রাহমান ইবনু আবূ বাকর (রাঃ)-কে নির্দেশ দিলেন তাকে সঙ্গে নিয়ে তান‘ঈমে যেতে। অতঃপর যুলহাজ্জ মাসেই হাজ্জ আদায়ের পর ‘আয়িশাহ্ (রাযি.) ‘উমরাহ আদায় করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জামরাতুল ‘আকাবায় কঙ্কর মারছিলেন তখন সুরাকা ইবনু মালিক ইবনু জু‘শুম (রাঃ)-এর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে সাক্ষাৎ হয়। তিনি বললেন, হে আল্লাহর রাসূল! এ হাজ্জের মাসে ‘উমরাহ আদায় করা কি আপনাদের জন্য খাস? আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ না, এতো চিরদিনের (সকলের) জন্য। (১৫৫৭, মুসলিম ১৫/১৭, হাঃ ১২১৬, আহমাদ ১৪২৮২) (আধুনিক প্রকাশনীঃ ১৬৫৮. ইসলামিক ফাউন্ডেশনঃ ১৬৬৭)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		}
	]
}