{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"27": "Pilgrims Prevented from Completing the Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "وَقَالَ رَوْحٌ عَنْ شِبْلٍ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ إِنَّمَا الْبَدَلُ عَلَى مَنْ نَقَضَ حَجَّهُ بِالتَّلَذُّذِ، فَأَمَّا مَنْ حَبَسَهُ عُذْرٌ، أَوْ غَيْرُ ذَلِكَ فَإِنَّهُ يَحِلُّ وَلاَ يَرْجِعُ، وَإِنْ كَانَ مَعَهُ هَدْىٌ وَهُوَ مُحْصَرٌ نَحَرَهُ، إِنْ كَانَ لاَ يَسْتَطِيعُ أَنْ يَبْعَثَ بِهِ، وَإِنِ اسْتَطَاعَ أَنْ يَبْعَثَ بِهِ لَمْ يَحِلَّ، حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ‏.‏ وَقَالَ مَالِكٌ وَغَيْرُهُ يَنْحَرُ هَدْيَهُ، وَيَحْلِقُ فِي أَىِّ مَوْضِعٍ كَانَ، وَلاَ قَضَاءَ عَلَيْهِ، لأَنَّ النَّبِيَّ صلى الله عليه وسلم وَأَصْحَابَهُ بِالْحُدَيْبِيَةِ نَحَرُوا وَحَلَقُوا وَحَلُّوا مِنْ كُلِّ شَىْءٍ، قَبْلَ الطَّوَافِ، وَقَبْلَ أَنْ يَصِلَ الْهَدْىُ إِلَى الْبَيْتِ، ثُمَّ لَمْ يُذْكَرْ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ أَحَدًا أَنْ يَقْضُوا شَيْئًا، وَلاَ يَعُودُوا لَهُ، وَالْحُدَيْبِيَةُ خَارِجٌ مِنَ الْحَرَمِ রাওহ (রহ.) হতে বর্ণিত যে, কাযা ঐ ব্যক্তির উপর ওয়াজিব, যে তার হাজ্জ স্ত্রী সম্ভোগ করে নষ্ট করে দিয়েছে। তবে প্রকৃত ওযর কিংবা অন্য কোন বাধা থাকলে সে হালাল হয়ে যাবে এবং তাকে (কাযার জন্য) ফিরে আসতে হবে না। বাধাপ্রাপ্ত ব্যক্তির নিকট কুরবানীর পশু থাকলে সেখানেই কুরবানী দিয়ে (হালাল হয়ে যাবে) যদি পশু কুরবানীর স্থানে পাঠাতে অক্ষম হয়। আর যদি সে তা পাঠাতে পারে তা হলে কুরবানীর জানোয়ারটি তার স্থানে না পৌঁছা পর্যন্ত হালাল হবে না। ইমাম মালিক (রহ.) ও অন্যান্য উলামায়ে কিরাম বলেন, সে যে কোন স্থানে কুরবানীর পশুটি যবেহ করে মাথা কামিয়ে নিতে পারবে। তার উপর কোন কাযা নেই। কেননা, হুদাইবিয়াতে তাওয়াফের আগে এবং কুরবানীর জানোয়ার বাইতুল্লাহ পৌঁছার পূর্বে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও সাহাবীগণ যবেহ করেছেন, মাথা কামিয়েছেন এবং হালাল হয়ে গিয়েছেন। এর কোন উল্লেখও নেই যে, এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাউকে কাযা করার বা (পুনরায় হাজ্জ আদায় করার জন্য) ফিরে আসার নির্দেশ দিয়েছেন, অথচ হুদাইবিয়া হারাম শরীফের বাইরে অবস্থিত। ১৮১৩. নাফি‘ (রহ.) হতে বর্ণিত যে, (মক্কা মুকার্রামায়) গোলযোগ চলাকালে ‘উমরাহ্’র নিয়ত করে ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) যখন মক্কার দিকে রওয়ানা হলেন, তখন বললেন, বাইতুল্লাহ হতে যদি আমি বাধাপ্রাপ্ত হই তাহলে তাই করব যা করেছিলাম আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে। তাই তিনি ‘উমরাহ্’র ইহরাম বাঁধলেন। কারণ, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -ও হুদাইবিয়ার বছর ‘উমরাহ্’র ইহরাম বেঁধেছিলেন। অতঃপর ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) নিজের ব্যাপারে ভেবে চিন্তে বললেন, উভয়টিই (হাজ্জ ও ‘উমরা) এক রকম। এরপর তিনি তাঁর সাথীদের প্রতি লক্ষ্য করে বললেন, উভয়টি তো একই রকম। আমি তোমাদের সাক্ষী করে বলছি, আমি আমার উপর ‘উমরাহ্’র সাথে হাজ্জকে ওয়াজিব করে নিলাম। তিনি উভয়টির জন্য একই তাওয়াফ করলেন এবং এটাই তাঁর পক্ষ হতে যথেষ্ট মনে করেন, আর তিনি কুরবানীর পশু সঙ্গে নিয়েছিলেন। (১৬৩৯) (আধুনিক প্রকাশনীঃ ১৬৮৪. ইসলামিক ফাউন্ডেশনঃ ১৬৯৪)",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 8
			}
		}
	]
}