{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"30": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1930,
			"arabicnumber": 1930,
			"text": "وَبَلَّ ابْنُ عُمَرَ ثَوْبًا فَأَلْقَاهُ عَلَيْهِ وَهُوَ صَائِمٌ وَدَخَلَ الشَّعْبِيُّ الْحَمَّامَ وَهُوَ صَائِمٌ وَقَالَ ابْنُ عَبَّاسٍ لاَ بَأْسَ أَنْ يَتَطَعَّمَ الْقِدْرَ أَوْ الشَّيْءَ وَقَالَ الْحَسَنُ لاَ بَأْسَ بِالْمَضْمَضَةِ وَالتَّبَرُّدِ لِلصَّائِمِ وَقَالَ ابْنُ مَسْعُودٍ إِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلْيُصْبِحْ دَهِينًا مُتَرَجِّلاً وَقَالَ أَنَسٌ إِنَّ لِي أَبْزَنَ أَتَقَحَّمُ فِيهِ وَأَنَا صَائِمٌ وَيُذْكَرُ عَنْ النَّبِيِّ أَنَّهُ اسْتَاكَ وَهُوَ صَائِمٌ وَقَالَ ابْنُ عُمَرَ يَسْتَاكُ أَوَّلَ النَّهَارِ وَآخِرَهُ وَلاَ يَبْلَعُ رِيقَهُ وَقَالَ عَطَاءٌ إِنْ ازْدَرَدَ رِيقَهُ لاَ أَقُولُ يُفْطِرُ وَقَالَ ابْنُ سِيرِينَ لاَ بَأْسَ بِالسِّوَاكِ الرَّطْبِ قِيلَ لَهُ طَعْمٌ قَالَ وَالْمَاءُ لَهُ طَعْمٌ وَأَنْتَ تُمَضْمِضُ بِهِ وَلَمْ يَرَ أَنَسٌ وَالْحَسَنُ وَإِبْرَاهِيمُ بِالْكُحْلِ لِلصَّائِمِ بَأْسًا সওমরত অবস্থায় ইবনু ‘উমার (রাঃ) একটি কাপড় ভিজালেন এরপর তা গায়ে দেয়া হলো। সওমরত অবস্থায় শা‘বী (রহ.) গোসলখানায় প্রবেশ করেছেন। ইবনু ‘আব্বাস (রাঃ) বলেন, হাঁড়ি হতে কিছু বা অন্য কোন জিনিস চেটে স্বাদ দেখায় কোন দোষ নেই। হাসান (রহ.) বলেন, সওম পালনকারীর কুলি করা এবং ঠান্ডা লাগান দূষণীয় নয়। ইবনু মাস‘ঊদ (রাঃ) বলেন, তোমাদের কেউ সওম পালন করলে সে যেন সকালে তেল লাগায় এবং চুল আঁচড়িয়ে নেয়। আনাস (রাঃ) বলেন, আমার একটি হাউজ আছে, আমি সায়িম অবস্থায় তাতে প্রবেশ করি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, তিনি সায়িম অবস্থায় মিস্ওয়াক করতেন। ইবনু ‘উমার (রাঃ) সায়িম অবস্থায় দিনের প্রথমভাগে এবং শেষভাগে মিস্ওয়াক করতেন। ‘আত্বা (রহ.) বলেন, থুথু গিলে ফেললে সওম ভঙ্গ হয়েছে বলা যায় না। ইবনু সীরীন (রহ.) বলেন, কাঁচা মিসওয়াক ব্যবহারে কোন দোষ নেই। প্রশ্ন করা হল, কাঁচা মিসওয়াকের তো স্বাদ রয়েছে? তিনি বলেন, পানিরও তো স্বাদ আছে, অথচ এ পানি দিয়েই তুমি কুলি কর। আনাস (রাঃ), হাসান (রহ.) এবং ইব্রাহীম (রহ.) সায়িমের সুরমা ব্যবহারে কোন দোষ মনে করতেন না। ১৯৩০. ‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, রমাযান মাসে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ভোর হয়ে যেত ইহ্তিলাম (স্বপ্নদোষ) ব্যতীত (জুনুবী অবস্থায়)। তখন তিনি গোসল করতেন এবং সওম পালন করতেন। (১৯২৫) (আধুনিক প্রকাশনীঃ ১৭৯৩, ইসলামিক ফাউন্ডেশনঃ ১৮০৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 38
			}
		}
	]
}