{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"30": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1949,
			"arabicnumber": 1949,
			"text": "(وَبَيِّنَاتٍ مِنْ الْهُدَى وَالْفُرْقَانِ فَمَنْ شَهِدَ مِنْكُمْ الشَّهْرَ فَلْيَصُمْهُ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ يُرِيدُ اللهُ بِكُمْ الْيُسْرَ وَلاَ يُرِيدُ بِكُمْ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللهَ عَلَى مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ) ইবনু ‘উমার (রাঃ) এবং সালামাহ ইবনু আকওয়া‘ (রাযি.) বলেন যে, উক্ত আয়াতকে রহিত করেছে এ আয়াতঃ ‘‘রমাযান মাস, এ মাসেই কুরআন অবতীর্ণ করা হয়েছে, যা মানুষের জন্য হিদায়াত, সৎপথের স্পষ্ট নিদর্শন এবং সত্যাসত্যের পার্থক্যকারী। সুতরাং তোমাদের মধ্যে যে এ মাস পাবে সে যেন এ মাসে সিয়াম পালন করে। তবে কেউ অসুস্থ হলে কিংবা সফরে থাকলে সে অন্য সময়ে সওম এর সংখ্যা পূরণ করে দিবে। আল্লাহ চান তোমাদের জন্য সহজ করতে, তিনি এমন কিছু চান না যা তোমাদের জন্য কষ্টকর। যাতে তোমরা সংখ্যা পূরণ কর এবং তোমাদের সৎপথে পরিচালিত করার দরুন আল্লাহর মহিমা বর্ণনা কর এবং যাতে তোমরা কৃতজ্ঞতা প্রকাশ করতে পার।’’ (আল-বাকারাহঃ ১৮৫) نَزَلَ رَمَضَانُ فَشَقَّ عَلَيْهِمْ فَكَانَ مَنْ أَطْعَمَ كُلَّ يَوْمٍ مِسْكِينًا تَرَكَ الصَّوْمَ مِمَّنْ يُطِيقُهُ وَرُخِّصَ لَهُمْ فِي ذَلِكَ فَنَسَخَتْهَا (وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ) فَأُمِرُوا بِالصَّوْمِ ইবনু নুমাইর (রহ.) ইবনু আবূ লায়লা (রহ.) হতে বর্ণনা করেন যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাহাবীগণ আমাদের কাছে বর্ণনা করেছেন, রমাযানের হুকুম নাযিল হলে তা পালন করা তাঁদের জন্য কষ্টকর হয়ে দাঁড়ায়। তাই তাঁদের মধ্যে কেউ সওম পালনে সক্ষম হওয়া সত্ত্বেও সওম ত্যাগ করে প্রতিদিনের পরিবর্তে একজন মিসকীনকে খাওয়াতো। এ ব্যাপারে তাদের অনুমতিও দেওয়া হয়েছিল।(وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ) ‘আর সওম পালন করাই তোমাদের জন্য উত্তম’, এ আয়াতটি পূর্বের হুকুমকে রহিত করে দেয় এবং সবাইকে সওম পালনের নির্দেশ দেয়া হয়। ১৯৪৯. ইবনু ‘উমার (রাঃ) হতে বর্ণিত, তিনি (فِدْيَةٌ طَعَامُ مَسَاكِينَ) আয়াতটি পড়ে বলেছেন যে, ইহা মানসূখ (রহিত)। (৪৫০৬) (আধুনিক প্রকাশনীঃ ১৮০৯, ইসলামিক ফাউন্ডেশনঃ ১৮২২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 56
			}
		}
	]
}