{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2079,
			"arabicnumber": 2079,
			"text": "وَيُذْكَرُ عَنْ الْعَدَّاءِ بْنِ خَالِدٍ قَالَ كَتَبَ لِي النَّبِيُّ صلى الله عليه وسلم هَذَا مَا اشْتَرَى مُحَمَّدٌ رَسُولُ اللهِ مِنْ الْعَدَّاءِ بْنِ خَالِدٍ بَيْعَ الْمُسْلِمِ مِنْ الْمُسْلِمِ لاَ دَاءَ وَلاَ خِبْثَةَ وَلاَ غَائِلَةَ وَقَالَ قَتَادَةُ الْغَائِلَةُ الزِّنَا وَالسَّرِقَةُ وَالإبَاقُ وَقِيلَ لإِبْرَاهِيمَ إِنَّ بَعْضَ النَّخَّاسِينَ يُسَمِّي آرِيَّ خُرَاسَانَ وَسِجِسْتَانَ فَيَقُولُ جَاءَ أَمْسِ مِنْ خُرَاسَانَ جَاءَ الْيَوْمَ مِنْ سِجِسْتَانَ فَكَرِهَهُ كَرَاهِيَةً شَدِيدَةً وَقَالَ عُقْبَةُ بْنُ عَامِرٍ لاَ يَحِلُّ لِامْرِئٍ يَبِيعُ سِلْعَةً يَعْلَمُ أَنَّ بِهَا دَاءً إِلاَّ أَخْبَرَهُ ‘আদ্দা ইবনু খালিদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে লিখে দেন যে, এটি মুহাম্মাদুর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আদ্দা ইবনু খালিদ (রাঃ) হতে খরিদ করলেন। এ হলো এক মুসলিমের সঙ্গে আর এক মুসলিমের ক্রয়-বিক্রয়। এতে নেই কোন খুঁৎ, কোন অবৈধতা এবং গায়েলা। কাতাদাহ (রহ.) বলেন, গায়িলা অর্থ ব্যভিচার, চুরি ও পলায়নের অভ্যাস। ইবরাহীম নাখয়ী (রহ.)-কে বলা হল, কোন কোন দালাল খুরাসান ও সিজিস্তান এর খাসবারশি নাম উচ্চারণ করে এবং বলে, এটি কালকে এসেছে খুরাসান হতে, আর এটি আজ এসেছে সিজিস্তিন হতে। তিনি এরূপ বলাকে খুবই গর্হিত মনে করলেন। উকবা ইবনু আমির (রহ.) বলেন, কোন ব্যক্তির জন্য বৈধ নয় যে, সে কোন পণ্য বিক্রি করছে এবং এর দোষ-ত্রুটি জেনেও তা প্রকাশ করে না। ২০৭৯. হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ক্রেতা-বিক্রেতা যতক্ষণ পরস্পর বিচ্ছিন্ন না হয়, ততক্ষণ তাদের ইখতিয়ার থাকবে (ক্রয়-বিক্রয় সম্পন্ন করা বা বাতিল করা)। যদি তারা সত্য বলে এবং অবস্থা ব্যক্ত করে তবে তাদের ক্রয়-বিক্রয়ে বরকত হবে আর যদি মিথ্যা বলে এবং দোষ গোপন করে তবে তাদের ক্রয়-বিক্রয়ের বরকত মুছে ফেলা হয়। (২০৮২, ২১০৮, ২১১০, ২১১৪, মুসলিম ২১/১০, হাঃ ১৫৩২, আহমাদ ১৫৩২৪) (আধুনিক প্রকাশনীঃ ১৯৩৪ , ইসলামিক ফাউন্ডেশনঃ ১৯৪৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 32
			}
		}
	]
}