{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"37": "Hiring"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2276,
			"arabicnumber": 2276,
			"text": "وَقَالَ ابْنُ عَبَّاسٍ عَنْ النَّبِيِّ صلى الله عليه وسلم أَحَقُّ مَا أَخَذْتُمْ عَلَيْهِ أَجْرًا كِتَابُ اللهِ وَقَالَ الشَّعْبِيُّ لاَ يَشْتَرِطُ الْمُعَلِّمُ إِلاَّ أَنْ يُعْطَى شَيْئًا فَلْيَقْبَلْهُ وَقَالَ الْحَكَمُ لَمْ أَسْمَعْ أَحَدًا كَرِهَ أَجْرَ الْمُعَلِّمِ وَأَعْطَى الْحَسَنُ دَرَاهِمَ عَشَرَةً وَلَمْ يَرَ ابْنُ سِيرِينَ بِأَجْرِ الْقَسَّامِ بَأْسًا وَقَالَ كَانَ يُقَالُ السُّحْتُ الرِّشْوَةُ فِي الْحُكْمِ وَكَانُوا يُعْطَوْنَ عَلَى الْخَرْصِ ইবনু ‘আব্বাস (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন যে, পারিশ্রমিক গ্রহণের ব্যাপারে অধিক হকদার হল আল্লাহর কিতাব। শা’বী (রহ.) বলেন, শিক্ষক কোনরূপ (পারিশ্রমিকের) শর্তারোপ করবে না। তবে (বিনা শর্তে) যদি তাকে কিছু দেয়া হয় তিনি তা গ্রহণ করতে পারেন। হাকাম (রহ.) বলেন, আমি এমন কারো কথা শুনিনি, যিনি (শিক্ষকের পারিশ্রমিক গ্রহণ করাটাকে অপছন্দ মনে করেছেন। হাসান (বাসরী) (রহ.) শিক্ষকের পারিশ্রমিক বাবত) দশ দিরহাম দিয়েছেন। ইবনু সীরীন (রহ.) বণ্টনকারীর পারিশ্রমিক গ্রহণ করাতে কোন দোষ মনে করেননি। তিনি বলেন, বিচারে ঘুষ গ্রহণকে সুহ্ত বলা হয়। লোকেরা অনুমান করার জন্য অনুমানকারীদের পারিশ্রমিক প্রদান করত। ২২৭৬. আবূ সাঈদ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর একদল সাহাবী কোন এক সফরে যাত্রা করেন। তারা এক আরব গোত্রে পৌঁছে তাদের মেহমান হতে চাইলেন। কিন্তু তারা তাদের মেহমানদারী করতে অস্বীকার করল। সে গোত্রের সরদার বিচ্ছু দ্বারা দংশিত হল। লোকেরা তার (আরোগ্যের) জন্য সব ধরনের চেষ্টা করল। কিন্তু কিছুতেই কোন উপকার হল না। তখন তাদের কেউ বলল, এ কাফেলা যারা এখানে অবতরণ করেছে তাদের কাছে তোমরা গেলে ভাল হত। সম্ভবত, তাদের কারো কাছে কিছু থাকতে পারে। ওরা তাদের নিকট গেল এবং বলল, হে যাত্রীদল! আমাদের সরদারকে বিচ্ছু দংশন করেছে, আমরা সব রকমের চেষ্টা করেছি, কিন্তু কিছুতেই উপকার হচ্ছে না। তোমাদের কারো কাছে কিছু আছে কি? তাদের (সাহাবীদের) একজন বললেন, হ্যাঁ, আল্লাহর কসম আমি ঝাড়-ফুঁক করতে পারি। আমরা তোমাদের মেহমানদারী কামনা করেছিলাম, কিন্তু তোমরা আমাদের জন্য মেহমানদারী করনি। কাজেই আমি তোমাদের ঝাড়-ফুঁক করব না, যে পর্যন্ত না তোমরা আমাদের জন্য পারিশ্রমিক নির্ধারণ কর। তখন তারা এক পাল বকরীর শর্তে তাদের সাথে চুক্তিবদ্ধ হল। তারপর তিনি গিয়ে (الْحَمْدُ للهِ رَبِّ الْعَالَمِينَ) ‘‘আলহামদু লিল্লাহি রাব্বিল আলামীন’’ (সূরা ফাতিহা) পড়ে তার উপর ফুঁ দিতে লাগলেন। ফলে সে (এমনভাবে নিরাময় হল) যেন বন্ধন হতে মুক্ত হল এবং সে এমনভাবে চলতে ফিরতে লাগল যেন তার কোন কষ্টই ছিল না। (বর্ণনাকারী বলেন,) তারপর তারা তাদের স্বীকৃত পারিশ্রমিক পুরোপুরি দিয়ে দিল। সাহাবীদের কেউ কেউ বলেন, এগুলো বণ্টন কর। কিন্তু যিনি ঝাড়-ফুঁক করেছিলেন তিনি বললেন এটা করব না, যে পর্যন্ত না আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট গিয়ে তাঁকে এই ঘটনা জানাই এবং লক্ষ্য করি তিনি আমাদের কী নির্দেশ দেন। তারা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে এসে ঘটনা বর্ণনা করলেন। তিনি [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ] বলেন, তুমি কিভাবে জানলে যে, সূরা ফাতিহা একটি দু‘আ? তারপর বলেন, তোমরা ঠিকই করেছ। বণ্টন কর এবং তোমাদের সাথে আমার জন্যও একটা অংশ রাখ। এ বলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাসলেন। শো’বা (রহ.) বলেন, আমার নিকট আবূ বিশর (রহ.) বর্ণনা করেছেন যে, আমি মুতাওয়াক্কিল (রহ.) হতে এ হাদীস শুনেছি। (৫০০৭, ৫৭৩৬, ৫৭৪৯, মুসলিম ৩৯/২৩, হাঃ ২২০১, আহমাদ ১১৩৯৯) (আধুনিক প্রকাশনীঃ ২১১৫, ইসলামিক ফাউন্ডেশনঃ ২১৩২)",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		}
	]
}