{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"40": "Representation, Authorization, Business by Proxy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে রমাযানের যাকাত হিফাযত করার দায়িত্বে নিযুক্ত করলেন। এক ব্যক্তি এসে আঞ্জলা ভর্তি করে খাদ্য সামগ্রী নিতে লাগল। আমি তাকে পাকড়াও করলাম এবং বললাম, আল্লাহর কসম! আমি তোমাকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে উপস্থিত করব। সে বলল, আমাকে ছেড়ে দিন। আমি খুব অভাবগ্রস্ত, আমার যিম্মায় পরিবারের দায়িত্ব রয়েছে এবং আমার প্রয়োজন তীব্র। তিনি বললেন, আমি ছেড়ে দিলাম। যখন সকাল হলো, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেন, হে আবূ হুরাইরা, তোমার রাতের বন্দী কি করলে? আমি বললাম, হে আল্লাহর রাসূল! সে তার তীব্র অভাব ও পরিবার, পরিজনের কথা বলায় তার প্রতি আমার দয়া হয়, তাই তাকে আমি ছেড়ে দিয়েছি। তিনি বললেন, সাবধান! সে তোমার কাছে মিথ্যা বলেছে এবং সে আবার আসবে। ‘সে আবার আসবে’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এ উক্তির কারণে আমি বুঝতে পারলাম যে, সে পুনরায় আসবে। কাজেই আমি তার অপেক্ষায় থাকলাম। সে এল এবং অঞ্জলি ভরে খাদ্র সামগ্রী নিতে লাগল। আমি ধরে ফেললাম এবং বললাম, আমি তোমাকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে নিয়ে যাব। সে বলল, আমাকে ছেড়ে দিন। কেননা, আমি খুবই দরিদ্র এবং আমার উপর পরিবার-পরিজনের দায়িত্ব ন্যস্ত, আমি আর আসব না। তার প্রতি আমার দয়া হল এবং আমি তাকে ছেড়ে দিলাম। সকাল হলে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেন, হে আবূ হুরাইরাহ! তোমার বন্দী কী করল? আমি বললাম, হে আল্লাহর রাসূল! সে তার তীব্র প্রয়োজন এবং পরিবার-পরিজনের কথা বলায় তার প্রতি আমার দয়া হয়। তাই আমি তাকে ছেড়ে দিয়েছি। তিনি বললেন, খবরদার সে তোমার কাছে মিথ্যা বলেছে এবং সে আবার আসবে। তাই আমি তৃতীয়বার তার অপেক্ষায় রইলাম। সে আবার আসল এবং অঞ্জলি ভর্তি করে খাদ্য সামগ্রী নিতে লাগল। আমি তাকে পাকড়াও করলাম এবং বললাম, আমি তোমাকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে অবশ্যই নিয়ে যাব। এ হলো তিনবারের শেষবার। তুমি প্রত্যেকবার বল যে, আর আসবে না, কিন্তু আবার আস। সে বলল, আমাকে ছেড়ে দাও। আমি তোমাকে কয়েকটি কথা শিখিয়ে দেব। যা দিয়ে আল্লাহ তোমাকে উপকৃত করবেন। আমি বললাম, সেটা কী? সে বলল, যখন তুমি রাতে শয্যায় যাবে তখন আয়াতুল কুরসী (اللهُ لاَ إِلٰهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ) আয়াতের শেষ পর্যন্ত পড়বে। তখন আল্লাহর তরফ হতে তোমার জন্যে একজন রক্ষক নিযুক্ত হবে এবং ভোর পর্যন্ত শয়তান তোমার কাছে আসতে পারবে না। কাজেই তাকে আমি ছেড়ে দিলাম। ভোর হলে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, গত রাতের তোমার বন্দী কী করল? আমি বললাম, হে আল্লাহর রাসূল! সে আমাকে বলল যে, সে আমাকে কয়েকটি বাক্য শিক্ষা দেবে যা দিয়ে আল্লাহ আমাকে লাভবান করবেন। তাই আমি তাকে ছেড়ে দিয়েছি। তিনি আমাকে বললেন, এই বাক্যগুলো কী? আমি বললাম, সে আমাকে বলল, যখন তুমি তোমার বিছানায় শুতে যাবে তখন আয়াতুল কুরসী( اللهُ لاَ إِلٰهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ ) প্রথম হতে আয়াতের শেষ পর্যন্ত পড়বে এবং সে আমাকে বলল, এতে আল্লাহর তরফ হতে তোমার জন্য একজন রক্ষক নিযুক্ত থাকবেন এবং ভোর পর্যন্ত তোমার নিকট কোন শয়তান আসতে পারবে না। সাহাবায়ে কিরাম কল্যাণের জন্য বিশেষ লালায়িত ছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হ্যাঁ, এ কথাটি তো সে তোমাকে সত্য বলেছে। কিন্তু হুশিয়ার, সে মিথ্যুক। হে আবূ হুরাইরাহ! তুমি কি জান, তিন রাত ধরে তুমি কার সাথে কথাবার্তা বলেছিলে। আবূ হুরাইরাহ (রাঃ) বললেন, না। তিনি বললেন, সে ছিল শয়তান। (৩২৭৫, ৫০১০) (আধুনিক প্রকাশনীঃ কিতাবুল ওয়াকালাহ অনুচ্ছেদ-১০, ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ১৪৩৮)",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		}
	]
}