{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"43": "Loans, Payment of Loans, Freezing of Property, Bankruptcy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2388,
			"arabicnumber": 2388,
			"text": "وَقَوْلِ اللهِ تَعَالَى (إِنَّ اللهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الأَمَانَاتِ إِلَى أَهْلِهَا وَإِذَا حَكَمْتُمْ بَيْنَ النَّاسِ أَنْ تَحْكُمُوا بِالْعَدْلِ إِنَّ اللهَ نِعِمَّا يَعِظُكُمْ بِهِ إِنَّ اللهَ كَانَ سَمِيعًا بَصِيرًا) আর আল্লাহ তা‘আলার বাণীঃ ‘‘আমানত তার হকদারকে ফিরিয়ে দেয়ার জন্য আল্লাহ তোমাদের নির্দেশ দিচ্ছেন। আর যখনি তোমরা মানুষের মধ্যে বিচার পরিচালনা করবে, তখন ন্যায়পরায়ণতার সাথে বিচার করবে। নিশ্চয়ই আল্লাহ তোমাদের যে উপদেশ দেন তা কত উৎকৃষ্ট। আল্লাহ সব শুনেন, সব দেখেন।’’ (আন-নিসা (৪) : ৫৮) ২৩৮৮. আবূ যার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ছিলাম। যখন তিনি উহুদ পাহাড় দেখলেন, তখন বললেন, আমি পছন্দ করি না যে, এই পাহাড়টি আমার জন্য সোনায় পরিণত করা হোক এবং এর মধ্য হতে একটি দ্বীনারও (স্বর্ণ মুদ্রা) আমার নিকট তিন দিনের বেশী থাকুক, সেই দ্বীনার ব্যতীত যা আমি ঋণ আদায়ের জন্য রেখে দেই। তারপর তিনি বললেন, যারা অধিক সম্পদশালী তারাই (সাওয়াবের দিক দিয়ে) স্বল্পের অধিকারী। কিন্তু যারা এভাবে ওভাবে ব্যয় করেন (তারা ব্যতীত) (বর্ণনাকারী) আবূ শিহাব তার সামনের দিকে এবং ডান ও বাম দিকে ইশারা করেন এবং এরূপ লোক খুব কম আছে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি এখানেই অবস্থান কর। তিনি একটু দূরে গেলেন। আমি কিছু শব্দ শুনতে পেলাম। তখন আমি তাঁর কাছে আসতে চাইলাম। এরপর ‘‘আমি ফিরে আসা পর্যন্ত তুমি এখানে অবস্থান কর’’ তাঁর এ কথাটি আমার মনে পড়ল। তিনি যখন আসলেন, আমি বললাম, হে আল্লাহর রাসূল! যা আমি শুনলাম অথবা বললেন যে আওয়াজটি আমি শুনতে পেলাম তা কী? তিনি বললেন, তুমি কী শুনেছ? আমি বললাম, হ্যাঁ। তিনি বললেন, আমার কাছে জিবরীল (আঃ) এসেছিলেন এবং তিনি বললেন, আপনার কোন উম্মাত আল্লাহর সঙ্গে কোন কিছু শরীক না করে মারা গেলে সে জান্নাতে প্রবেশ করবে। আমি বললাম, যদিও সে এরূপ, এরূপ কাজ করে? তিনি বললেন, হ্যাঁ। (১২৩৭) (আধুনিক প্রকাশনীঃ ২২১৩, ইসলামিক ফাউন্ডেশনঃ ২২৩০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 4
			}
		}
	]
}