{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "بَاب الِانْتِصَارِ مِنْ الظَّالِمِ لِقَوْلِهِ جَلَّ ذِكْرُهُ ৪৬/৬. অত্যাচারী হতে প্রতিশোধ নেয়া। ( لاَ يُحِبُّ اللهُ الْجَهْرَ بِالسُّوءِ مِنْ الْقَوْلِ إِلاَّ مَنْ ظُلِمَ وَكَانَ اللهُ سَمِيعًا عَلِيمًا ) ( وَالَّذِينَ إِذَا أَصَابَهُمْ الْبَغْيُ هُمْ يَنْتَصِرُونَ ) قَالَ إِبْرَاهِيمُ كَانُوا يَكْرَهُونَ أَنْ يُسْتَذَلُّوا فَإِذَا قَدَرُوا عَفَوْا আল্লাহ তা‘আলার বাণীঃ ‘‘মন্দ কথার প্রচারণা আল্লাহ পছন্দ করেন না, তবে যার উপর যুলুম করা হয়েছে। আর আল্লাহ শ্রবণকারী, জ্ঞানী’’- (আন-নিসাঃ ১৪৮)। ‘‘এবং যারা অত্যাচারিত হলে প্রতিশোধ গ্রহণ করে’’- (শূরাঃ ৩৯)। ইবরাহীম (রহ.) বলেন, সহাবায়ে কিরাম (রাঃ) অপমানিত হওয়াকে পছন্দ করতেন না, তবে ক্ষমতা লাভ করলে মাফ করে দিতেন। 46/7. بَاب عَفْوِ الْمَظْلُومِ ৪৬/৭. অধ্যায় : নির্যাতিতকে ক্ষমা করা। لِقَوْلِهِ تَعَالَى ( إِنْ تُبْدُوا خَيْرًا أَوْ تُخْفُوهُ أَوْ تَعْفُوا عَنْ سُوءٍ فَإِنَّ اللهَ كَانَ عَفُوًّا قَدِيرًا ) ( وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللهِ إِنَّهُ لاَ يُحِبُّ الظَّالِمِينَ وَلَمَنْ انْتَصَرَ بَعْدَ ظُلْمِهِ فَأُولَئِكَ مَا عَلَيْهِمْ مِنْ سَبِيلٍ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الأَرْضِ بِغَيْرِ الْحَقِّ أُولَئِكَ لَهُمْ عَذَابٌ أَلِيمٌ وَلَمَنْ صَبَرَ وَغَفَرَ إِنَّ ذَلِكَ لَمِنْ عَزْمِ الأُمُورِ) (وَتَرَى الظَّالِمِينَ لَمَّا رَأَوْا الْعَذَابَ يَقُولُونَ هَلْ إِلَى مَرَدٍّ مِنْ سَبِيلٍ) আল্লাহ তা‘আলার বাণীঃ ‘‘তোমরা সৎকর্ম প্রকাশ্যে করলে অথবা গোপনে করলে অথবা দোষ ক্ষমা করলে আল্লাহও দোষ মোচনকারী, শক্তিমান’’- (আন-নিসাঃ ১৪৯)। ‘‘মন্দের প্রতিফল অনুরূপ মন্দ, কিন্তু যে মাফ করে দেয় এবং আপোষে নিষ্পত্তি করে, তার পুরস্কার আল্লাহর নিকটই রয়েছে। তিনি যালিমদের পছন্দ করেন না। তবে অত্যাচারিত হওয়ার পর যারা প্রতিবিধান করে, তাদের বিরুদ্ধে কোন ব্যবস্থা গ্রহণ করা হবে না। কেবল তাদের বিরুদ্ধে ব্যবস্থা অবলম্বন করা হবে, যারা মানুষের উপর জুলুম করে এবং পৃথিবীতে অন্যায়ভাবে বিদ্রোহাচরণ করে বেড়ায়। এদের জন্য রয়েছে যন্ত্রণাদায়ক শাস্তি। অবশ্য যে ধৈর্য ধারণ করে এবং মাফ করে দেয়, এতো হবে দৃঢ়সংকল্পের কাজ। আল্লাহ যাকে পথভ্রষ্ট করেন তার জন্য কোন অভিভাবক নেই। যালিমরা (কিয়ামতের দিন) যখন শাস্তি দেখবে, তখন আপনি তাদের বলতে শুনবেন প্রত্যাবর্তনের কোন পথ আছে কি?’’ (শূরা (৪২) : ৪০-৪৪) ২৪৪৭. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, জুলুম কিয়ামতের দিন অনেক অন্ধকারের রূপ ধারণ করবে। (আধুনিক প্রকাশনীঃ ২২৬৮, ইসলামিক ফাউন্ডেশনঃ ২২৮৫)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 8
			}
		}
	]
}