{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"50": "Makaatib"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2560,
			"arabicnumber": 2560,
			"text": "وَقَوْلِهِ (وَالَّذِينَ يَبْتَغُونَ الْكِتَابَ مِمَّا مَلَكَتْ أَيْمَانُكُمْ فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا وَآتُوهُمْ مِنْ مَالِ اللهِ الَّذِي آتَاكُمْ) وَقَالَ رَوْحٌ عَنْ ابْنِ جُرَيْجٍ قُلْتُ لِعَطَاءٍ أَوَاجِبٌ عَلَيَّ إِذَا عَلِمْتُ لَهُ مَالاً أَنْ أُكَاتِبَهُ قَالَ مَا أُرَاهُ إِلاَّ وَاجِبًا وَقَالَهُ عَمْرُو بْنُ دِينَارٍ قُلْتُ لِعَطَاءٍ تَأْثُرُهُ عَنْ أَحَدٍ قَالَ لاَ ثُمَّ أَخْبَرَنِي أَنَّ مُوسَى بْنَ أَنَسٍ أَخْبَرَهُ أَنَّ سِيرِينَ سَأَلَ أَنَسًا الْمُكَاتَبَةَ وَكَانَ كَثِيرَ الْمَالِ فَأَبَى فَانْطَلَقَ إِلَى عُمَرَ tفَقَالَ كَاتِبْهُ فَأَبَى فَضَرَبَهُ بِالدِّرَّةِ وَيَتْلُو عُمَرُ ( فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا ) فَكَاتَبَهُ আল্লাহ তা‘আলার বাণীঃ ‘‘তোমাদের এবং তোমাদের মালিকানাধীন দাস-দাসীদের মধ্যে কেউ তার মুক্তির জন্য চুক্তিপত্র লিখতে চাইলে তাদের সাথে তোমরা চুক্তিবদ্ধ হও, যদি তোমরা ওদের মধ্যে মঙ্গলের সন্ধান পাও এবং আল্লাহ তোমাদের যে সম্পদ দিয়েছেন, তা হতে তোমরা ওদের দান করবে’’- (আন-নূর ৩২)। রাওয়াহ (রহ.) বলেন, ইবনু জুরাইজ (রহ.) বর্ণনা করেন, আমি ‘আতা (রহ.)-কে জিজ্ঞেস করলাম, যদি আমি জানতে পারি যে, তার (গোলামের) অর্থ-সম্পদ রয়েছে, তবে কি তার সাথে কিতাবের চুক্তি করা আমার জন্য ওয়াজিব হবে? তিনি বললেন, আমি তো ওয়াজিব ছাড়া অন্য কিছু মনে করি না। ‘আমর ইবনু দ্বীনার (রহ.) বলেন, আমি ‘আতা (রহ.)-কে জিজ্ঞেস করলাম, এ মতামত কি আপনি (পূর্ববর্তী) কারো কাছ হতে বর্ণনা করছেন? তিনি বললেন, না। তারপর ‘আতা (রহ.) আমার কাছে বর্ণনা করেছেন যে, মূসা ইবনু আনাস (রহ.) তাকে অবহিত করেছেন যে, আনাস (রাঃ)-এর কাছে তার ক্রীতদাস সীরীন মুকাতাব (চুক্তিবদ্ধ) হবার আবেদন জানাল। সে বিত্তশালী ছিল। কিন্তু আনাস (রাঃ) তাতে অস্বীকৃতি জানালেন। সীরীন তখন ‘উমার (রাঃ)-এর কাছে বিষয়টি উত্থাপন করল। ‘উমার (রাঃ) তখন তাকে [আনাস (রাঃ)-কে] বেত্রাঘাত করলেন এবং নিম্নোক্ত আয়াত পাঠ করলেন, ‘‘তোমরা তাদের সঙ্গে চুক্তিতে আবদ্ধ হও, যদি তোমরা তাদের মধ্যে মঙ্গলের সন্ধান পাও’’- (আন-নূর ৩৩)। ২৫৬০. ‘আয়িশাহ (রাযি.) হতে বর্ণিত, তিনি বলেছেন, বারীরা (রাঃ) একবার মুকাতাবাতের সাহায্য চাইতে তাঁর কাছে আসলেন। প্রতিবছর এক ‘উকিয়া’ করে পাঁচ বছরে পাঁচ ‘উকিয়া’ তাকে পরিশোধ করতে হবে। তার প্রতি ‘আয়িশাহ (রাযি.) আগ্রহান্বিত হলেন। তাই তিনি বললেন, যদি আমি এককালীন মূল্য পরিশোধ করে দেই তবে কি তোমার মালিক তোমাকে বিক্রি করবে? তখন আমি তোমাকে মুক্ত করে দিব এবং তোমার ওয়ালার অধিকার আমার হবে। বারীরা (রাঃ) তার মালিকের কাছে গিয়ে উক্ত প্রস্তাব পেশ করলেন। কিন্তু তারা বলল, না; তবে যদি ওয়ালার অধিকার আমাদের হয়। ‘আয়িশাহ (রাযি.) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খিদমতে গেলাম এবং বিষয়টি তাঁকে বললাম। (রাবী বলেন) তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেন, তাকে খরিদ করে মুক্ত করে দাও। কেননা, ওয়ালা তারই হবে, যে মুক্ত করবে। তারপর তিনি দাঁড়িয়ে বললেন, মানুষের কী হল, তারা এমন সব শর্তারোপ করে, যা আল্লাহর কিতাবে নেই! আল্লাহর কিতাবে নেই এমন শর্ত কেউ আরোপ করলে তা বাতিল বলে গণ্য হবে। আল্লাহর দেয়া শর্তই সঠিক এবং নির্ভরযোগ্য। (৪৫৬) (আধুনিক প্রকাশনীঃ কিতাবুল মুকাতাব অনুচ্ছেদ-১, ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ১৬০২)",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 1
			}
		}
	]
}