{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"52": "Witnesses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2686,
			"arabicnumber": 2686,
			"text": "(وَقَوْلِهِ عَزَّ وَجَلَّ )إِذْ يُلْقُوْنَ أَقْلَامَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ( ( آل عمران : 44) وَقَالَ ابْنُ عَبَّاسٍ اقْتَرَعُوْا فَجَرَتْ الأَقْلَامُ مَعَ الْجِرْيَةِ وَعَالَ قَلَمُ زَكَرِيَّاءَ الْجِرْيَةَ فَكَفَلَهَا زكَرِيَّاءُ وَقَوْلِهِ )فَسَاهَمَ( أَقْرَعَ )فَكَانَ مِنْ الْمُدْحَضِيْنَ( ( الصافات : 141) مِنْ الْمَسْهُومِيْنَ وَقَالَ أَبُوْ هُرَيْرَةَ عَرَضَ النَّبِيُّ صلى الله عليه وسلم عَلَى قَوْمٍ الْيَمِيْنَ فَأَسْرَعُوْا فَأَمَرَ أَنْ يُسْهِمَ بَيْنَهُمْ أَيُّهُمْ يَحْلِفُ মহান আল্লাহর বাণীঃ যখন তারা তাদের কলম নিক্ষেপ করছিল মারয়ামের তত্ত্বাবধানের দায়িত্ব তাদের মধ্যে কে গ্রহণ করবে? (সূরা আলে-ইমরান ৪৪) ইবনু ‘আব্বাস (রাঃ) বলেন, তারা (কলম নিক্ষেপের মাধ্যমে) কুর‘আর ব্যবস্থা করল, তখন তাদের সবার কলম স্রোতের সঙ্গে ভেসে গেল। শুধু যাকারিয়ার কলম স্রোতের মুখেও ভেসে রইল। তাই তাকে যাকারিয়ার তত্ত্বাবধানে রেখে দিলেন। [ইউনুস (আ) সম্পর্কে] আল্লাহ তা‘আলার বাণীঃ (فَسَاهَمَ ) এর অর্থ أقْرَعَ কুর‘আ নিক্ষেপ করল। فَكَانَ مِنْ الْمُدْحَضِيْنَ (لصافات : ১৪১) অতঃপর তিনি পরাভূত হলেন- (সূরা আস্-সফফাত ১৪১)। আবূ হুরাইরাহ্ (রাঃ) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একদল লোককে হলফ করার নির্দেশ দিলেন। তারা কে আগে হলফ করবে তাই নিয়ে হুড়াহুড়ি শুরু করল। তখন কুর‘আর মাধ্যমে কে হলফ করবে তা নির্ধারণের নির্দেশ দিলেন। ২৬৮৬. নু‘মান ইবনু বশীর (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, আল্লাহর নির্ধারিত সীমারেখার ব্যাপারে শিথিলতা প্রদর্শনকারী এবং তা লঙ্ঘনকারীর উপমা হল সেই যাত্রীদল, যারা কুর‘আর মাধ্যমে এক নৌযানে নিজেদের স্থান নির্ধারণ করে নিল। ফলে কারো স্থান হল এর নীচতলায় আর কারও হল উপর তলায়। যারা নীচতলায় ছিল তারা পানি নিয়ে উপর তলার লোকদের নিকট দিয়ে আসত। এতে তারা বিরক্তি প্রকাশ করল। তখন এক লোক কুড়াল নিয়ে নৌযানের নীচের অংশ ফুটো করতে লেগে গেল। এ দেখে উপর তলার লোকজন তাকে এসে জিজ্ঞেস করল তোমার হয়েছে কী? সে বলল, আমাদের কারণে তোমরা কষ্ট পেয়েছ। অথচ আমারও পানির প্রয়োজন আছে। এ মুহূর্তে তারা যদি এর দু’হাত চেপে ধরে তাহলে তাকে যেমন রক্ষা করা হল তেমনি নিজেদেরও রক্ষা হল। আর যদি তাকে ছেড়ে দেয় তবে তাকে ধ্বংস করা হল এবং নিজেদেরও ধ্বংস করা হল। (২৪৯৩) (আধুনিক প্রকাশনীঃ ২৪৯১, ইসলামিক ফাউন্ডেশনঃ ২৫০৭)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 47
			}
		}
	]
}