{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"2": "Belief"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"text": "(لِقَوْلِهِ تَعَالَى )قَالَتْ الْأَعْرَابُ آمَنَّا قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا( فَإِذَا كَانَ عَلَى الْحَقِيقَةِ فَهُوَ عَلَى قَوْلِهِ جَلَّ ذِكْرُهُ )إِنَّ الدِّينَ عِنْدَ اللهِ الإِسْلاَمُ ( )وَمَنْ يَبْتَغِ غَيْرَ الْأِسْلامِ دِيناً فَلَنْ يُقْبَلَ مِنْهُ( মহান আল্লাহর এ বাণী অনুযায়ী হবেঃ ‘‘আরব মরুবাসীরা বলে, আমরা বিশ্বাস স্থাপন করলাম; আপনি বলে দিন, ‘‘তোমরা বিশ্বাস স্থাপন করনি; বরং তোমরা বল, ‘আমরা বাহ্যিক দৃষ্টিতে মুসলিম হয়েছি।’’ (সূরাহ্ হুজরাত ৪৯/১৪) আর ইসলাম গ্রহণ খাঁটি হলে তা হবে আল্লাহ্ তা‘আলার এ বাণী অনুযায়ীঃ ‘‘নিশ্চয়ই ইসলাম আল্লাহর মনোনীত একমাত্র দ্বীন’’- (সূরাহ্ আলে ‘ইমরান ৩/১৯)। ‘‘আর যে ব্যক্তি ইসলাম ব্যতীত অন্য কোন দ্বীন অন্বেষণ করবে তবে তা গৃহীত হবে না।’’ (সূরাহ্ আলে ‘ইমরান ৩/৮৫) ২৭. সা‘দ (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদল লোককে কিছু দান করলেন। সা‘দ (রাযি.) সেখানে বসেছিলেন। সা‘দ (রাযি.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের এক ব্যক্তিকে কিছু দিলেন না। সে ব্যক্তি আমার নিকট তাদের চেয়ে অধিক পছন্দের ছিল। তাই আমি আরয করলাম, হে আল্লাহর রাসূল! অমুক ব্যক্তিকে আপনি বাদ দিলেন কেন? আল্লাহর শপথ! আমি তো তাকে মু‘মিন বলেই জানি। তিনি বললেনঃ না, মুসলিম। তখন আমি কিছুক্ষণ নীরব থাকলাম। অতঃপর আমি তার সম্পর্কে যা জানি, তা (ব্যক্ত করার) প্রবল ইচ্ছা হলো। তাই আমি আমার বক্তব্য আবার বললাম, আপনি অমুককে দান থেকে বাদ রাখলেন? আল্লাহর শপথ! আমি তো তাকে মু‘মিন বলেই জানি। তিনি বললেনঃ ‘না, মুসলিম?’ তখন আমি কিছুক্ষণ নীরব থাকলাম। তারপর আমি তার সম্পর্কে যা জানি তা (ব্যক্ত করার) প্রবল ইচ্ছা হলো। তাই আমি আবার বললাম, আপনি অমুককে দান হতে বাদ রাখলেন? আল্লাহর শপথ! আমি তো তাকে মু’মিন বলেই জানি। তিনি বললেনঃ ‘না, মুসলিম?’ তখন আমি কিছুক্ষণ চুপ থাকলাম। তারপর আমি তার সম্পর্কে যা জানি তা (ব্যক্ত করার) প্রবল ইচ্ছা হলো। তাই আমি আমার বক্তব্য আবার বললাম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুনরায় সেই একই জবাব দিলেন। তারপর বললেনঃ ‘সা‘দ! আমি কখনো ব্যক্তি বিশেষকে দান করি, অথচ অন্যলোক আমার নিকট তার চেয়ে অধিক প্রিয়। তা এ আশঙ্কায় যে (সে ঈমান থেকে ফিরে যেতে পারে পরিণামে), আল্লাহ্ তা‘আলা তাকে অধোমুখে জাহান্নামে নিক্ষিপ্ত করবেন। এ হাদীস ইউনুস, সালিহ, মা‘মার এবং যুহরী (রহ.)-এর ভ্রাতুষ্পুত্র যুহরী (রহ.) হতে বর্ণনা করেছেন। (১৪৭৮; মুসলিম ১/৬৮ হাঃ ১৫০) (আধুনিক প্রকাশনীঃ ২৬, ইসলামিক ফাউন্ডেশনঃ ২৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 20
			}
		}
	]
}