{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"53": "Peacemaking"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2704,
			"arabicnumber": 2704,
			"text": "وَقَوْلُهُ جَلَّ ذِكْرُهُ: (فَأَصْلِحُوا بَيْنَهُمَا) আর আল্লাহ তা‘আলার বাণীঃ তোমরা তাদের উভয় দলের মাঝে মীমাংসা করে দাও। (সূরা আল-হুজুরাত ৯) ২৭০৪. হাসান (বাসরী) (রহ.) বলেন, আল্লাহর কসম, হাসান ইবনু ‘আলী (রাঃ) পর্বত প্রমাণ সেনাদল নিয়ে মু‘আবিয়াহ (রাঃ)-এর মুখোমুখী হলেন। আমর ইবনু ‘আস (রাঃ) বললেন, আমি এমন সেনাদল দেখতে পাচ্ছি যারা প্রতিপক্ষকে হত্যা না করে ফিরে যাবে না। মু‘আবিয়াহর (রাঃ) তখন বললেন, আল্লাহর কসম! আর (মু‘আবিয়াহ ও ‘আমর ইবনুল ‘আস) (রাঃ) উভয়ের মধ্যে মু‘আবিয়াহ (রাঃ) ছিলেন উত্তম ব্যক্তি- ‘হে ‘আমর! এরা ওদের এবং ওরা এদের হত্যা করলে, আমি কাকে দিয়ে লোকের সমস্যার সমাধান করব? তাদের নারীদেও কে তত্ত্বাবধান করবে? তাদের দুর্বল ও শিশুদের কে রক্ষণাবেক্ষণ করবে? অতঃপর তিনি কুরায়শের বানূ আবদে শাম্স্ শাখার দু’ ব্যক্তি ‘আবদুর রহমান ইবনু সামুরাহ ও ‘আবদুল্লাহ্ ইবনু আমর (রাঃ)-কে হাসান (রাঃ)-এর নিকট পাঠালেন। তিনি তাদের বললেন, ‘তোমরা উভয়ে এ ব্যক্তিটির নিকট যাও এবং তাঁর নিকট (সন্ধির) প্রস্তাব পেশ করো, তাঁর সঙ্গে আলোচনা কর ও তাঁর বক্তব্য জানতে চেষ্টা কর।’ তাঁরা তাঁর নিকট রয়ে গেলেন এবং তাঁর সঙ্গে কথা বললেন, আলাপ-আলোচনা করলেন এবং তাঁর বক্তব্য জানলেন। হাসান ইবনু ‘আলী (রাঃ) তাদের বললেন, ‘আমরা ‘আবদুল মুত্তালিবের সন্তান, এই সম্পদ (বায়তুল মালের) আমরা পেয়েছি। আর এরা রক্তপাতে লিপ্ত হয়েছে।’ তারা উভয়ে বললেন, [মুআবিয়াহ (রাঃ)] আপনার নিকট এরূপ বক্তব্য পেশ করেছেন। আর আপনার বক্তব্যও জানতে চেয়েছেন ও সন্ধি কামনা করেছেন। তিনি বললেন, ‘এ দায়িত্ব কে নিবে?’ তারা (তার জওয়াবে) বললেন, ‘আমরা এ দায়িত্ব নিচ্ছি।’ অতঃপর তিনি তাঁর সঙ্গে সন্ধি করলেন। হাসান (বসরী) (রহ.) বলেন, আমি আবূ বাকরাহ (রাঃ)-কে বলতে শুনেছিঃ ‘রাসূলুল্লাহ্ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে আমি মিম্বরের উপর দেখেছি, হাসান বিন ‘আলী (রাঃ) তাঁর পাশে ছিলেন। তিনি একবার লোকদের দিকে আরেকবার তাঁর দিকে তাকাচ্ছিলেন আর বলছিলেন, আমার এ সন্তান একজন নেতা। সম্ভবত তার মাধ্যমে আল্লাহ্ তা‘আলা মুসলিমদের দু’টি বড় দলের মধ্যে মীমাংসা করাবেন।’ আবূ ‘আবদুল্লাহ্ (রহ.) বলেন, ‘আলী ইবনু ‘আবদুল্লাহ্ আমাকে বলেছেন যে, এ হাদীসের মাধ্যমেই আবূ বাকরাহ (রাঃ) হতে হাসানের শোনা কথা আমাদের নিকট প্রমাণিত হয়েছে। (৩৬২৯, ৩৭৪৬, ৭১০৯) (আধুনিক প্রকাশনীঃ ২৫০৭, ইসলামিক ফাউন্ডেশনঃ ২৫২০)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 14
			}
		}
	]
}