{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আবূ ত্বলহাকে বলেন, তোমাদের ছেলেদের মধ্য থেকে একটি ছেলে খুঁজে আন, যে আমার খেদমত করতে পারে। এমনকি তাকে আমি খায়বারেও নিয়ে যেতে পারি। অতঃপর আবূ ত্বলহা (রাঃ) আমাকে তার সাওয়ারীর পেছনে বসিয়ে নিয়ে চললেন। আমি তখন প্রায় সাবালক। আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর খেদমত করতে লাগলাম। তিনি যখন অবতরণ করতেন, তখন প্রায়ই তাকে এই দু‘আ পড়তে শুনতামঃ ‘হে আল্লাহ! আমি দুশ্চিন্তা ও পেরেশানী থেকে, অক্ষমতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণভার ও লোকজনের প্রাধান্য থেকে আপনার নিকট পানাহ চাচ্ছি।’ পরে আমরা খায়বারে গিয়ে হাজির হলাম। অতঃপর যখন আল্লাহ তা‘আলা তাঁকে দুর্গের উপর বিজয়ী করলেন, তখন তাঁর নিকট সাফিয়্যা বিনতু হুয়াই ইবনু আখতাবের সৌন্দর্যের কথা উল্লেখ করা হলো, তিনি ছিলেন সদ্য বিবাহিতা; তাঁর স্বামীকে হত্যা করা হয়েছিল এবং আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁকে নিজের জন্য মনোনীত করলেন। অতঃপর তাঁকে নিয়ে রওয়ানা দিলেন। আমরা যখন সাদ্দুস্ সাহ্বা নামক স্থানে পৌঁছলাম তখন সফিয়্যাহ (রাঃ) হায়েয থেকে পবিত্র হন। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেখানে তাঁর সঙ্গে বাসর যাপন করেন। অতঃপর তিনি চামড়ার ছোট দস্তরখানে ‘হায়সা’ প্রস্তুত করে আমাকে আশেপাশের লোকজনকে ডাকার নির্দেশ দিলেন। এই ছিল আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে সাফিয়্যার বিয়ের ওয়ালিমা। অতঃপর আমরা মদিনার দিকে রওয়ানা দিলাম। আনাস (রাঃ) বলেন, আমি দেখতে পেলাম যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর পেছনে চাদর দিয়ে সফিয়্যাহ্কে পর্দা করছেন। উঠানামার প্রয়োজন হলে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর উটের কাছে হাঁটু বাড়িয়ে বসতেন, আর সাফিয়্যা (রাঃ) তাঁর উপর পা রেখে উটে আরোহণ করতেন। এভাবে আমরা মদিনার নিকটবর্তী হলাম। তখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উহুদের দিকে তাকিয়ে বললেন, এটি এমন এক পর্বত যা আমাদের ভালবাসে এবং আমরাও তাকে ভালবাসি। অতঃপর মদিনার দিকে তাকিয়ে বললেন, ‘ হে আল্লাহ, এই কঙ্করময় দু’টি ময়দানের মধ্যবর্তী স্থানকে আমি ‘হারাম’ বলে ঘোষণা করছি, যেমন ইব্রাহীম (আঃ) মক্কাকে ‘হারাম’ ঘোষণা করেছিলেন। হে আল্লাহ্! আপনি তাদের মুদ এবং সা‘তে বরকত দান করুন।’ (৩৭১) (আধুনিক প্রকাশনীঃ ২৬৮০, ইসলামিক ফাউন্ডেশনঃ ২৬৯১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 108
			}
		}
	]
}