{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "قَالَ أَبُوْ هُرَيْرَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم اللهُ أَعْلَمُ بِمَنْ يُجَاهِدُ فِيْ سَبِيْلِهِ وَاللهُ أَعْلَمُ بِمَنْ يُكْلَمُ فِيْ سَبِيْلِهِ আবূ হুরাইরাহ্ (রাঃ) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, আল্লাহর পথে কে জিহাদ করছে, তা তিনিই ভাল জানেন এবং কে তাঁর পথে আহত হয়েছে আল্লাহ্ই অধিক অবগত আছেন। ২৮৯৮. সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত যে, একবার আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ও মুশ্রিকদের মধ্যে মুকাবিলা হয় এবং উভয়পক্ষ ভীষণ যুদ্ধ লিপ্ত হয়। অতঃপর আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) নিজ সৈন্যদলের নিকট ফিরে এলেন, মুশ্রিকরাও নিজ সৈন্যদলে ফিরে গেল। সেই যুদ্ধে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গীদের মধ্যে এমন এক ব্যক্তি ছিল, যে কোন মুশরিককে একাকী দেখলেই তার পশ্চাতে ছুটত এবং তাকে তলোয়ার দিয়ে আক্রমণ করত। বর্ণনাকারী (সাহল ইবনু সা‘দ (রাঃ) বলেন, আজ আমাদের কেউ অমুকের মত যুদ্ধ করতে পারেনি। তা শুনে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, সে তো জাহান্নামের অধিবাসী হবে। একজন সাহাবী বলে উঠলেন, আমি তার সঙ্গী হব। অতঃপর তিনি তার সঙ্গে বেরিয়ে পড়লেন, সে দাঁড়ালে তিনিও দাঁড়াতেন এবং সে শীঘ্র চললে তিনিও দ্রুত চলতেন। তিনি বললেন, এক সময় সে মারাত্মকভাবে আহত হলো এবং সে দ্রুত মৃত্যু কামনা করতে লাগল। এক সময় তলোয়ারের বাঁট মাটিতে রাখল এবং এর তীক্ষ্ণ দিক বুকে চেপে ধরে তার উপর ঝাঁপিয়ে পড়ে আত্মহত্যা করল। অনুসরণকারী ব্যক্তিটি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট আসলেন এবং বললেন, আমি সাক্ষ্য দিচ্ছি যে, আপনি আল্লাহর রাসূল। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, কী ব্যাপার? তিনি বললেন, যে ব্যক্তিটি সম্পর্কে আপনি কিছুক্ষণ আগেই বলেছিলেন যে, সে জাহান্নামী হবে, তা শুনে সাহাবীগণ বিষয়টিকে অস্বাভাবিক মনে করলেন। আমি তাদের বললাম যে, আমি ব্যক্তিটির সম্পর্কে খবর তোমাদের জানাব। অতঃপর আমি তার পিছু পিছু বের হলাম। এক সময় লোকটি মারাত্মকভাবে আহত হয় এবং সে শীঘ্র মৃত্যু কামনা করতে থাকে। অতঃপর তার তলোয়ারের বাট মাটিতে রেখে এর তীক্ষ্ণধার বুকে চেপে ধরল এবং তার উপরে ঝাঁপিয়ে পড়ে আত্মহত্যা করল। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তখন বললেন, ‘মানুষের বাহ্যিক বিচারে অনেক সময় কোন ব্যক্তি জান্নাতবাসীর মত ‘আমল করতে থাকে, আসলে সে জাহান্নামী হয় এবং তেমনি মানুষের বাহ্যিক বিচারে কোন ব্যক্তি জাহান্নামীর মত ‘আমল করলেও প্রকৃতপক্ষে সে জান্নাতী হয়।’ (৪২০৩, ৪২০৭, ৬৪৯৩, ৬৬০৭) (মুসলিম ১/৪৭ হাঃ ১১২, আহমাদ ২২৮৯৮) (আধুনিক প্রকাশনীঃ ২৬৮৪, ইসলামিক ফাউন্ডেশনঃ ২৬৯৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 112
			}
		}
	]
}