{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2967,
			"arabicnumber": 2967,
			"text": "(لِقَوْلِهِ )إِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اٰمَنُوْا بِاللهِ وَرَسُوْلِهٰ وَإِذَا كَانُوْا مَعَهُ عَلٰى أَمْرٍ جَامِعٍ لَّمْ يَذْهَبُوْا حَتّٰى يَسْتَأْذِنُوْهُ إِنَّ الَّذِيْنَ يَسْتَأْذِنُوْنَكَ( إِلَى آخِرِ الآيَةِ আল্লাহ্ তা‘আলার বাণীঃ মু‘মিন তো তারাই যারা আল্লাহ্ ও তাঁর রাসূলের প্রতি ঈমান রাখে এবং যখন তারা কোন সমষ্টিগত কাজে রসুলের সাথে সমবেত হয় তখন তারা তাঁর অনুমতি ব্যতিরেকে চলে যায় না।। (নূর ৬২) ২৯৬৭. জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে এক যুদ্ধে অংশ গ্রহণ করি। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিছুক্ষণ পরে এসে আমার সঙ্গে মিলিত হন; আমি তখন আমার পানি-সেচের উটনীর উপর আরোহী ছিলাম। উটনী ক্লান্ত হয়ে পড়েছিল; এটি মোটেই চলতে পারছিল না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেন, তোমার উটের কী হয়েছে? আমি বললাম, ক্লান্ত হয়ে পড়েছে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উটনীর পেছন দিক থেকে গিয়ে উটনীটিকে হাঁকালেন এবং এটির জন্য দু‘আ করলেন। অতঃপর এটি সবক’টি উটের আগে আগে চলতে থাকে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেন, এখন তোমার উটনীটি কেমন মনে হচ্ছে? আমি বললাম, ভালই। এটি আপনার বরকত লাভ করেছে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি কি এটি আমার নিকট বিক্রয় করবে? তিনি বলেন, আমি মনে মনে লজ্জাবোধ করলাম। (কারণ) আমার নিকট এ উটটি ব্যতীত পানি বহনের অন্য কোন উটনী ছিল না। আমি বললাম, হ্যাঁ। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তাহলে আমার নিকট বিক্রয় কর। অনন্তর আমি উটনীটি তাঁর নিকট এ শর্তে বিক্রয় করলাম যে, মদিনা্য় পৌঁছা পর্যন্ত এর উপর আরোহণ করব। আমি বললাম, হে আল্লাহর রাসূল! আমি সদ্য বিবাহিত একজন পুরুষ। অতঃপর আমি তাঁর নিকট অনুমতি চাইলাম। তিনি আমাকে অনুমতি দিলেন। আমি লোকদের আগে আগে চললাম এবং মদিনা্য় পৌঁছে গেলাম। তখন আমার মামা আমার সঙ্গে সাক্ষাৎ করলেন। তিনি আমাকে উটনীর ব্যাপারে জিজ্ঞেস করলেন। আমি তাকে সে বিষয়ে অবহিত করলাম যা আমি করেছিলাম। তিনি আমাকে তিরস্কার করলেন। তিনি (রাবী) বলেন, আর যখন আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট অনুমতি চেয়েছিলাম, তখন তিনি আমাকে প্রশ্ন করছিলেন, তুমি কি কুমারী বিবাহ করেছ, না এমন মহিলাকে বিবাহ করেছ যার পূর্বে বিবাহ হয়েছিল? আমি বললাম, এমন মহিলাকে বিবাহ করেছি যার পূর্বে বিবাহ হয়েছে। তিনি বললেন, তুমি কুমারী বিবাহ করলে না কেন? তুমি তার সঙ্গে খেলা করতে এবং সেও তোমার সঙ্গে খেলা করত। আমি বললাম, হে আল্লাহর রাসূল! আমার পিতা শহীদ হয়েছেন। আমার কয়েকজন ছোট ছোট বোন রয়েছে। তাই আমি তাদের সমান বয়সের কোন মেয়ে বিবাহ করা পছন্দ করিনি; যে তাদেরকে আদব-আখলাক শিক্ষা দিতে পারবে না এবং তাদের দেখাশোনা করতে পারবে না। তাই আমি একজন পূর্ব বিবাহ হয়েছে এমন মহিলাকে বিবাহ করেছি; যাতে সে তাদের দেখাশোনা করতে পারে এবং তাদেরকে আদব-আখলাক শিক্ষা দিতে পারে। তিনি বলেন, যখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনা্য় আসেন, পরদিন আমি তাঁর নিকট উটনীটি নিয়ে উপস্থিত হলাম। তিনি আমাকে এর মূল্য দিলেন এবং উটটিও ফেরত দিলেন। মুগীরাহ (রাঃ) বলেন, আমাদের বিবেচনায় এটি উত্তম। আমরা এতেকোন কোন দোষ মনে করি না। (৪৪৩) (মুসলিম ৬/১২ হাঃ ৭১৫) (আধুনিক প্রকাশনীঃ ২৭৪৬, ইসলামিক ফাউন্ডেশনঃ ২৭৫৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 176
			}
		}
	]
}