{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )لَا تَتَّخِذُوْا عَدُوِّيْ وَعَدُوَّكُمْ أَوْلِيَآءَ ( التَّجَسُّسُ التَّبَحُّثُ আর আল্লাহ্ তা‘আলার বাণীঃ তোমরা আমার শত্রু ও তোমাদের শত্রুকে বন্ধুরূপে গ্রহণ করো না। (মুমতাহিনাহ ১) التَّجَسُّسُ অর্থ হচ্ছে খোঁজ-খবর নেয়া। ৩০০৭. ‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এবং যুবায়র ও মিকদাদ ইবনু আসওয়াদ (রাঃ)-কে পাঠিয়ে বললেন, ‘তোমরা খাখ্ বাগানে যাও। সেখানে তোমরা এক মহিলাকে দেখতে পাবে। তার নিকট একটি পত্র আছে, তোমরা তার কাছ থেকে তা নিয়ে আসবে।’ তখন আমরা রওনা দিলাম। আমাদের ঘোড়া আমাদের নিয়ে দ্রুত বেগে চলছিল। অবশেষে আমরা উক্ত খাখ্ নামক বাগানে পৌঁছে গেলাম এবং সেখানে আমরা মহিলাটিকে দেখতে পেলাম। আমরা বললাম, ‘পত্র বাহির কর।’ সে বলল, ‘আমার নিকট তো কোন পত্র নেই।’ আমরা বললাম, ‘তুমি অবশ্যই পত্র বের করে দিবে, নচেৎ তোমার কাপড় খুলতে হবে।’ তখন সে তার চুলের খোঁপা থেকে পত্রটি বের করে দিল। আমরা তখন সে পত্রটি নিয়ে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাজির হলাম। দেখা গেল, তা হাতিব ইবনু বালতাআ (রাঃ)-এর পক্ষ থেকে মক্কার কয়েকজন মুশরিকের প্রতি লেখা হয়েছে। যাতে তাদেরকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কোন পদক্ষেপ সম্পর্কে সংবাদ দেয়া হয়েছে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘হে হাতিব! একি ব্যাপার?’ তিনি বললেন, ‘হে আল্লাহর রাসূল! আমার ব্যাপারে কোন তড়িত সিদ্ধান্ত গ্রহণ করবেন না। আসলে আমি কুরাইশ বংশোদ্ভূত নই। তবে তাদের সঙ্গে মিশে ছিলাম। আর যারা আপনার সঙ্গে মুহাজিরগণ রয়েছেন, তাদের সকলেরই মক্কাবাসীদের সঙ্গে আত্মীয়তার সম্পর্ক রয়েছে। যার কারণে তাঁদের পরিবার-পরিজন ও ধন-সম্পদ নিরাপদ। তাই আমি চেয়েছি, যেহেতু আমার বংশগতভাবে এ সম্পর্ক নেই, কাজেই আমি তাদের প্রতি এমন কিছু অনুগ্রহ দেখাই, যদ্দবারা অন্তত তারা আমার আপন জনদের রক্ষা করবে। আর আমি তা কুফরী কিংবা মুরতাদ হবার উদ্দেশ্যে করিনি এবং কুফরীর প্রতি আকৃষ্ট হবার কারণেও নয়।’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘হাতিব তোমাদের নিকট সত্য কথা বলছে।’ তখন ‘উমার (রাঃ) বললেন, ‘হে আল্লাহর রাসূল! আমাকে অনুমতি দিন, আমি এই মুনাফিকের গর্দান উড়িয়ে দেই।’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘সে বাদার যুদ্ধে অংশগ্রহণ করেছে। তোমার হয়ত জানা নেই, আল্লাহ্ তা‘আলা বাদার যুদ্ধে অংশ গ্রহণকারীদের ব্যাপারে অবহিত আছেন। তাই তাদের উদ্দেশ্য করে বলেছেন, তোমরা যা ইচ্ছা আমল কর। আমি তোমাদেরকে ক্ষমা করে দিয়েছি।’ সুফ্ইয়ান (রহ.) বলেন এ সনদটি খুবই উত্তম। (৩০৮১, ৩৯৮৩, ৪২৭৪, ৪৮৯০, ৬২৫৯, ৬৯৩৯) (মুসলিম ৪৪/৩৬ হাঃ ২৪৯৪, আহমাদ ৬০০) (আধুনিক প্রকাশনীঃ ২৭৮৬, ইসলামিক ফাউন্ডেশনঃ ২৭৯৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 216
			}
		}
	]
}