{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3129,
			"arabicnumber": 3129,
			"text": "‘আবদুল্লাহ ইবনু যুবায়র (রাঃ) হতে বর্ণিত। তিনি বলেন, উষ্ট্র যুদ্ধের দিন যুবায়র (রাঃ) যুদ্ধক্ষেত্রে অবস্থান গ্রহণ করে আমাকে ডাকলেন। আমি তাঁর পাশে গিয়ে দাঁড়ালাম। তিনি আমাকে বললেন, হে বৎস! আজকের দিন যালিম অথবা মাযলূম ব্যতীত কেউ নিহত হবে না। আমার মনে হয়, আমি আজ মাযলূম হিসেবে নিহত হব। আর আমি আমার ঋণ সম্পর্কে অধিক চিন্তিত। তুমি কি মনে কর যে, আমার ঋণ আদায় করার পর আমার সম্পদের কিছু অবশিষ্ট থাকবে? অতঃপর তিনি বললেন, হে পুত্র! আমার সম্পদ বিক্রয় করে আমার ঋণ পরিশোধ করে দিও। তিনি এক তৃতীয়াংশের ওসীয়্যত করেন। আর সেই এক তৃতীয়াংশের এক তৃতীয়াংশ ওয়াসিয়াত করেন তাঁর (আবদুল্লাহ্ ইবনু যুবায়রের) পুত্রদের জন্য তিনি বললেন, এক তৃতীয়াংশকে তিন ভাগে বিভক্ত করবে ঋণ পরিশোধ করার পর যদি আমার সম্পদের কিছু উদ্বৃত্ত থাকে, তবে তার এক তৃতীয়াংশ তোমার পুত্রদের জন্য। হিশাম (রহ.) বলেন, ‘আবদুল্লাহ্ ইবনু যুবাইর (রাঃ)-এর কোন কোন পুত্র যুবাইর (রাঃ)-এর পুত্রদের সমবয়সী ছিলেন। যেমন, খুবায়ের ও ‘আববাদ। আর মৃত্যুকালে তাঁর নয় পুত্র ও নয় কন্যা ছিল। ‘আবদুল্লাহ (রাঃ) বলেন, তিনি আমাকে তাঁর ঋণ সম্পর্কে ওসীয়্যত করছিলেন এবং বলছিলেন, হে পুত্র! যদি এ সবের কোন বিষয়ে তুমি অক্ষম হও, তবে এ ব্যাপারে আমার মাওলার সাহায্য চাইবে। তিনি বলেন, আল্লাহর কসম! আমি বুঝে উঠতে পারিনি যে, তিনি মাওলা দ্বারা কাকে উদ্দেশ্য করেছেন। অবশেষে আমি জিজ্ঞেস করলাম, হে পিতা! আপনার মাওলা কে? তিনি উত্তর দিলেন, আল্লাহ। ‘আবদুল্লাহ (রাঃ) বলেন, আল্লাহর কসম! আমি যখনই তাঁর ঋণ আদায়ে কোন সমস্যার সম্মুখীন হয়েছি, তখনই বলেছি, হে যুবায়রের মাওলা! তাঁর পক্ষ হতে তাঁর ঋণ আদায় করে দিন। আর তাঁর করয শোধ হয়ে যেতো। অতঃপর যুবায়র (রাঃ) শহীদ হলেন এবং তিনি নগদ কোন দ্বীনার রেখে যাননি আর না কোন দিরহাম। তিনি কিছু জমি রেখে যান যার মধ্যে এটি হল গাবা। আরো রেখে যান মদিনা্য় এগারোটি বাড়ী, বসরায় দু’টি, কূফায় একটি ও মিসরে একটি। ‘আবদুল্লাহ ইবনু যুবাইর (রাঃ) বলেন, যুবায়র (রাঃ)-এর ঋণ থাকার কারণ এই ছিল যে, তাঁর নিকট কেউ যখন কোন মাল আমানত রাখতে আসত তখন যুবাইর (রাঃ) বলতেন, না, এভাবে নয়; তুমি তা আমার নিকট ঋণ হিসেবে রেখে যাও। কেননা আমি ভয় করছি যে, তোমার মাল নষ্ট হয়ে যেতে পারে।[১] যুবায়র (রাঃ) কখনও কোন প্রশাসনিক ক্ষমতা বা কর আদায়কারী অথবা অন্য কোন কাজের দায়িত্ব গ্রহণ করেননি। অবশ্য তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গী হয়ে অথবা আবূ বাকর, ‘উমার ও ‘উসমান (রাঃ)-এর সঙ্গী হয়ে যুদ্ধে অংশগ্রহণ করেছেন। ‘আবদুল্লাহ ইবনু যুবায়র (রাঃ) বলেন, অতঃপর আমি তাঁর ঋণের পরিমাণ হিসাব করলাম এবং তাঁর ঋণের পরিমাণ বাইশ লাখ পেলাম। রাবী বলেন, সাহাবী হাকীম ইবনু হিযাম (রাঃ) ‘আবদুল্লাহ্ ইবনু যুবায়র (রাঃ)-এর সঙ্গে সাক্ষাত করে বলেন, হে ভাতিজা। বল তো, আমার ভাইযের কত ঋণ আছে? তিনি তা প্রকাশ না করে বললেন, এক লাখ। তখন হাকীম ইবনু হিযাম (রাঃ) বললেন, আল্লাহর কসম! এ সম্পদ দ্বারা এ পরিমাণ ঋণ শোধ হতে পারে, আমি এরূপ মনে করি না। তখন ‘আবদুল্লাহ ইবনু যুবায়র (রাঃ) তাঁকে বললেন, যদি ঋণের পরিমাণ বাইশ লাখ হয়, তবে কী ধারণা করেন? হাকীম ইবনু হিযাম (রাঃ) বললেন, আমি মনে করি না যে, তোমরা এর সামর্থ্য রাখ। যদি তোমরা এ বিষয়ে অক্ষম হও, তবে আমার সহযোগিতা গ্রহণ করবে। ‘আবদুল্লাহ ইবনু যুবায়র (রাঃ) বলেন, যুবায়র (রাঃ) গাবাস্থিত ভূমিটি এক লাখ সত্তর হাজারে কিনেছিলেন। ‘আবদুল্লাহ্ ইবনু যুবায়র (রাঃ) তা ষোল লাখের বিনিময়ে বিক্রয় করেন। আর দাঁড়িয়ে ঘোষণা করেন, যুবায়র (রাঃ)-এর নিকট কারা পাওনাদার রয়েছে, তারা আমার সঙ্গে গাবায় এসে মিলিত হবে। তখন ‘আবদুল্লাহ ইবনু জা‘ফর (রাঃ) তাঁর নিকট এলেন। যুবায়র (রাঃ)-এর নিকট তার চার লাখ পাওনা ছিল। তিনি ‘আবদুল্লাহ্ ইবনু যুবায়র (রাঃ)-কে বললেন, তোমরা চাইলে আমি তা তোমাদের জন্য ছেড়ে দিব। ‘আবদুল্লাহ্ ইবনু যুবায়র (রাঃ) বললেন, না। ‘আবদুল্লাহ্ ইবনু জা‘ফর (রাঃ) বললেন, যদি তোমরা তা পরে দিতে চাও, তবে তা পরে পরিশোধের অন্তর্ভুক্ত করতে পার। ‘আবদুল্লাহ্ ইবনু যুবায়র (রাঃ) বললেন, না। তখন ‘আবদুল্লাহ ইবনু জা‘ফর (রাঃ) বললেন, তবে আমাকে এক টুকরা জমি দাও। ‘আবদুল্লাহ্ ইবনু যুবায়র (রাঃ) বললেন, এখান হতে ওখান পর্যন্ত জমি আপনার। রাবী বলেন, অতঃপর ‘আবদুল্লাহ্ ইবনু যুবায়র (রাঃ) গাবার জমি হতে বিক্রয় করে সম্পূর্ণ ঋণ পরিশোধ করেন। তখনও তাঁর নিকট গাবার ভূমির সাড়ে চার অংশ অবশিষ্ট নিকট থেকে যায়। অতঃপর তিনি মু‘আবিয়াহ (রাঃ)-এর নিকট এলেন। সে সময় তাঁর নিকট ‘আমর ইবনু ‘উসমান, মুনযির ইবনু যুবায়র ও ‘আবদুল্লাহ্ ইবনু যাম‘আ (রাঃ) উপস্থিত ছিলেন। মু‘আবিয়া (রাঃ) তাঁকে বললেন, গাবার মূল্য কত নির্ধারিত হয়েছে? তিনি বললেন, প্রত্যেক অংশ এক লাখ হারে। তিনি জিজ্ঞেস করলেন, কত বাকী আছে? ‘আবদুল্লাহ (রাঃ) বললেন, সাড়ে চার অংশ। তখন মুনযির ইবনু যুবায়র (রাঃ) বললেন, আমি একাংশ এক লাখে নিলাম। ‘আমর ইবনু ‘উসমান (রাঃ) বলেন, আমি একাংশ এক লাখে নিলাম। আর ‘আবদুল্লাহ্ ইবনু যাম‘আহ (রাঃ) বললেন, আমি একাংশ এক লাখে নিলাম। তখন মু‘আবিয়াহ (রাঃ) বললেন, আর কী পরিমাণ বাকী আছে? ‘আবদুল্লাহ্ ইবনু যুবাইর (রাঃ) বললেন, দেড় অংশ অবশিষ্ট রয়েছে। মু‘আবিয়া (রাঃ) বললেন, আমি তা দেড় লাখে নিলাম। রাবী বলেন, ‘আবদুল্লাহ ইবনু জা‘ফর (রাঃ) তাঁর অংশ মু‘আবিয়াহ (রাঃ)-এর নিকট ছয় লাখে বিক্রয় করেন। অতঃপর যখন ইবনু যুবাইর (রাঃ) তাঁর পিতার ঋণ পরিশোধ করে সারলেন, তখন যুবাইর (রাঃ)-এর পুত্ররা বললেন, আমাদের মীরাস ভাগ করে দিন। তখন ‘আবদুল্লাহ ইবনু যুবাইর (রাঃ) বললেন, না, আল্লাহর কসম! আমি তোমাদের মাঝে ভাগ করব না, যতক্ষণ আমি চারটি হাজ্জ মৌসুমে এ ঘোষণা প্রচার না করি যে, যদি কেউ যুবাইর (রাঃ)-এর নিকট ঋণ পাওনা থাকে, সে যেন আমাদের নিকট আসে, আমরা তা পরিশোধ করব। রাবী বলেন, তিনি প্রতি হজ্জের মৌসুমে ঘোষণা প্রচার করেন। অতঃপর যখন চার বছর অতিবাহিত হল, তখন তিনি তা তাদের মধ্যে ভাগ করে দিলেন। রাবী বলেন, যুবাইর (রাঃ)-এর চার স্ত্রী ছিলেন। এক তৃতীয়াংশ পৃথক করে রাখা হলো। প্রত্যেক স্ত্রী বার লাখ করে পেলেন। আর যুবাইর (রাঃ)-এর মোট সম্পত্তি পাঁচ কোটি দু’লাখ ছিল। (আধুনিক প্রকাশনীঃ ২৮৯৫, ইসলামিক ফাউন্ডেশনঃ ২৯০৬)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 38
			}
		}
	]
}