{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3326,
			"arabicnumber": 3326,
			"text": "بَابُ خَلْقِ آدَمَ صَلَوَاتُ اللهِ عَلَيْهِ وَذُرِّيَّتِهِ ৬০/১. অধ্যায় : আদম (আঃ) ও তাঁর সন্তানাদির সৃষ্টি। صَلْصٰلٍ طِيْنٌ خُلِطَ بِرَمْلٍ فَصَلْصَلَ كَمَا يُصَلْصِلُ الْفَخَّارُ وَيُقَالُ مُنْتِنٌ يُرِيْدُوْنَ بِهِ صَلَّ كَمَا يُقَالُ صَرَّ الْبَابُ وَصَرْصَرَ عِنْدَ الإِغْلَاقِ مِثْلُ كَبْكَبْتُهُ يَعْنِيْ كَبَبْتُهُ فَمَرَّتْ بِهِ اسْتَمَرَّ بِهَا الْحَمْلُ فَأَتَمَّتُ أَنْ لَّا تَسْجُدَ أَنْ تَسْجُدَ صَلْصَالٍ বালি মিশ্রিত শুকনো মাটি যা শব্দ করে যেমন আগুনে পোড়া মাটি শব্দ করে। আরো বলা হয় তা হল দুর্গন্ধময় মাটি। আরবরা এ দিয়ে صَلْ অর্থ নিয়ে থাকে, যেমন তারা দরজা বন্ধ করার শব্দের ক্ষেত্রে صَرَّ الْبَابُ এবং صَرْصَرَ শব্দদ্বয় ব্যবহার করে থাকে। অনুরূপ كَبْكَبْتُهُ এর অর্থ كَبَبْتُهُ নিয়ে থাকে। فَمَرَّتْ بِهِ তার গর্ভ স্থিতি লাভ করল এবং এর মেয়াদ পূর্ণ করল। أَنْ لَا تَسْجُدَ এর لَا শব্দটি অতিরিক্ত। أَنْ تَسْجُدَ অর্থ সিজদা করতে। وَإِذْ قَالَ رَبُّكَ لِلْمَلَآئِكَةِ إِنِّيْ جَاعِلٌ فِي الْأَرْضِ خَلِيْفَةً (البقرة : 30) স্মরণ করুন, যখন আপনার প্রতিপালক ফেরেশতামন্ডলীকে বললেন, আমি পৃথিবীতে খলীফা সৃষ্টি করছি- (আল-বাকারাহ ৩০)। قَالَ ابْنُ عَبَّاسٍ لَمَّا عَلَيْهَا حَافِظٌ (الطارق : 4) إِلَّا عَلَيْهَا حَافِظٌ فِيْ كَبَدٍ (البلد : 4) فِيْ شِدَّةِ خَلْقٍ وَرِيَاشًا (الأعراف : 26) الْمَالُ وَقَالَ غَيْرُهُ الرِّيَاشُ وَالرِّيْشُ وَاحِدٌ وَهُوَ مَا ظَهَرَ مِنْ اللِّبَاسِ مَا تُمْنُوْنَ (الواقعة : 58) النُّطْفَةُ فِيْ أَرْحَامِ النِّسَاءِ ইবনু ‘আব্বাস (রা.) বলেন, لَمَّا عَلَيْهَا حَافِظٌ এর অর্থ কিন্তু তার ওপর রয়েছে তত্ত্বাবধায়ক। فِيْ كَبَدٍ সৃষ্টিগত ক্লেশের মধ্যে وَرِيَاشًا এর অর্থ সম্পদ। ইবনু ‘আব্বাস (রা.) ব্যতীত অন্যরা বলেন, الرِّيَاشُ এবং الرِّيشُ উভয়ের একই অর্থ। আর তা হল পরিচ্ছদের বাহ্যিক দিক। مَا تُمْنُوْنَ স্ত্রীলোকদের জরায়ুতে পতিত বীর্য। وَقَالَ مُجَاهِدٌ إِنَّه” عَلٰى رَجْعِهِ لَقٰدِرٌ (الطارق : 4) النُّطْفَةُ فِي الْإِحْلِيْلِ كُلُّ شَيْءٍ خَلَقَهُ فَهُوَ شَفْعٌ السَّمَاءُ شَفْعٌ وَالْوَتْرُ اللهُ عَزَّ وَجَلَّ فِيْٓ أَحْسَنِ تَقْوِيْمٍ (التين : 4) فِيْ أَحْسَنِ خَلْقٍ أَسْفَلَ سَافِلِيْنَ (التين : 5) إِلَّا مَنْ آمَنَ خُسْرٍ (العصر : 2) ضَلَالٍ ثُمَّ اسْتَثْنَى إِلَّا مَنْ آمَنَ لَازِبٍ (الصفات : ) لَازِمٌ وَنُنْشِئُكُمْ (الواقعة : 61) فِيْ أَيِّ خَلْقٍ نَشَاءُ نُسَبِّحُ بِحَمْدِكَ (البقرة : 30) نُعَظِّمُكَ আর মুজাহিদ (র.) (আল্লাহর বাণী) إِنَّهُ عَلَى رَجْعِهِ لَقَادِرٌ এর অর্থ বলেছেন, পুরুষের লিঙ্গে পুনরায় ফিরিয়ে আনতে আল্লাহ সক্ষম। আল্লাহ সকল বস্তুকে জোড়া জোড়া সৃষ্টি করেছেন। আকাশেরও জোড়া আছে, কিন্তু আল্লাহ বেজোড়। فِيْ أَحْسَنِ تَقْوِيْمٍ উত্তম অবয়ববে। যারা ঈমান এনেছে তারা ব্যতীত সকলেই হীনতাগ্রস্তদের হীনতমে। خُسْرٍ পথভ্রষ্ট। অতঃপর اسْتَثْنَى করে আল্লাহ বলেন, কিন্তু যারা ঈমান এনেছে, তারা ব্যতীত। لَازِبٍ অর্থ আঠালো। نُنْشِئُكُمْ অর্থ যে কোন আকৃতিতে আমি ইচ্ছা করি তোমাদেরকে সৃষ্টি করব। نُسَبِّحُ بِحَمْدِكَ অর্থ আমরা প্রশংসার সঙ্গে আপনার মহিমা বর্ণনা করব। وَقَالَ أَبُوْ الْعَالِيَةِ فَتَلَقّٰىٓ اٰدَمُ مِنْ رَبِّهٰ كَلِمٰتٍ (البقرة : 37) فَهُوَ قَوْلُهُ رَبَّنَا ظَلَمْنَآ أَنْفُسَنَا (الأعراف : 23) فَأَزَلَّهُمَا (البقرة : 36) فَاسْتَزَلَّهُمَا يَتَسَنَّهْ (البقرة : 259) يَتَغَيَّرْ اٰسِنٌ (الأعراف : 23) مُتَغَيِّرٌ وَالْمَسْنُوْنُ الْمُتَغَيِّرُ حَمَإٍ (الحجرات : 26) جَمْعُ حَمْأَةٍ وَهُوَ الطِّينُ الْمُتَغَيِّرُ يَخْصِفَانِ أَخْذُ الْخِصَافِ مِنْ وَرَقِ الْجَنَّةِ يُؤَلِّفَانِ الْوَرَقَ وَيَخْصِفَانِ بَعْضَهُ إِلَى بَعْضٍ سَوْاٰتُهُمَا كِنَايَةٌ عَنْ فَرْجَيْهِمَا وَمَتَاعٌ إِلٰى حِيْنٍ (الأعراف :24) هَا هُنَا إِلَى يَوْمِ الْقِيَامَةِ الْحِيْنُ عِنْدَ الْعَرَبِ مِنْ سَاعَةٍ إِلَى مَا لَا يُحْصَى عَدَدُهُ وَقَبِيْلُهُ (الأعراف : 27) جِيْلُهُ الَّذِيْ هُوَ مِنْهُمْ আর আবুল ‘আলিয়াহ (রহ.) বলেন, অতঃপর আদম (আঃ) যা শিক্ষা করলেন, তা হলো তাঁর উক্তি; ‘‘হে আমাদের রব! আমরা আমাদের নফসের উপর যুলুম করেছি’’। তিনি আরো বলেন, فَأَزَلَّهُمَا শয়তান তাদের উভয়কে পদস্খলিত করল। يَتَسَنَّهْ পরিবর্তিত হবে। آسِنٌ পরিবর্তনশীল। الْمَسْنُوْنُ যা পরিবর্তিত। حَمَاءٌ শব্দটি حَمْأَةٌ শব্দের বহুবচন। যার অর্থ গলিত কাদা মাটি। يَخْصِفَانِ তারা উভয়ে (আদম ও হাওয়া) জান্নাতের পাতাগুলো জোড়া দিতে লাগলেন। (জোড়া দিয়ে নিজেদের লজ্জাস্থান আবৃত করতে শুরু করলেন।) سَوْآتُهُمَا দ্বারা তাদের উভয়ের লজ্জাস্থানের প্রতি ইশারা করা হয়েছে। আর مَتَاعٌ إِلَى حِيْنٍ এর অর্থ এখানে কিয়ামতের দিন অবধি। আর আরববাসীগণ الْحِيْنُ শব্দ দ্বারা কিছু সময় হতে অগণিত সময়কে বুঝিয়ে থাকেন। قَبِيْلُهُ এর অর্থ তার ঐ প্রজন্ম ও সমাজ যার একজন সে। ৩৩২৬. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ তা‘আলা আদম (আঃ)-কে সৃষ্টি করলেন। তাঁর দেহের দৈর্ঘ্য ছিল ষাট হাত। অতঃপর তিনি (আল্লাহ) তাঁকে (আদমকে) বললেন, যাও। ঐ ফেরেশতা দলের প্রতি সালাম কর এবং তাঁরা তোমার সালামের জওয়াব কিভাবে দেয় তা মনোযোগ দিয়ে শোন। কারণ সেটাই হবে তোমার এবং তোমার সন্তানদের সালামের রীতি। অতঃপর আদম (আঃ) (ফেরেশতাদের) বললেন, ‘‘আস্সালামু ‘আলাইকুম’’। ফেরেশতামন্ডলী তার উত্তরে ‘‘আস-সালামু ‘আলাইকা ওয়া রহমাতুল্লাহ’’ বললেন। ফেরেশতারা সালামের জওয়াবে ‘‘ওয়া রহমাতুল্লাহ’’ শব্দটি বাড়িয়ে বললেন। যারা জান্নাতে প্রবেশ করবেন তারা আদম (আঃ)-এর আকৃতি বিশিষ্ট হবেন। তবে আদম সন্তানের দেহের দৈর্ঘ্য সর্বদা কমতে কমতে বর্তমান পরিমাপে এসেছে। (৬২২৭, মুসলিম ৫১/১১ হাঃ ২৮৪১, আহমাদ ৮১৭৭) (আধুনিক প্রকাশনীঃ ৩০৮০, ইসলামিক ফাউন্ডেশনঃ ৩০৮৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 1
			}
		}
	]
}