{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3337,
			"arabicnumber": 3337,
			"text": "قَالَ ابْنُ عَبَّاسٍ بَادِئَ الرَّأْيِ (هود : 27) مَا ظَهَرَ لَنَا أَقْلِعِي (هود : 44) أَمْسِكِيْ وَفَارَ التَّنُّوْرُ (هود : 40) نَبَعَ الْمَاءُ وَقَالَ عِكْرِمَةُ وَجْهُ الأَرْضِ وَقَالَ مُجَاهِدٌ الْجُوْدِيُّ (هود : 44) جَبَلٌ بِالْجَزِيْرَةِ دَأْبٌ (المؤمن : 31) مِثْلُ حَالٌ ইবনু ‘আব্বাস (রাঃ) বলেন, بَادِئَ الرَّأْيِ এর অর্থ যা আমাদের সামনে প্রকাশ পেয়েছে। أَقْلِعِيْ তুমি থেমে যাও। وَفَارَ التَّنُّوْرُ পানি সবেগে উত্থিত হল। আর ‘ইকরিমাহ (রহ.) বলেন, التَّنُّوْرُ অর্থ ভূপৃষ্ঠ। আর মুজাহিদ (রহ.) বলেন, الْجُوْدِيُّ জর্জিয়ার একটি পাহাড়। دَأْبٌ অবস্থা। قَوْلِ اللهِ تَعَالَى إِنَّآ أَرْسَلْنَا نُوْحًا إِلٰى قَوْمِهٰ أَنْ أَنْذِرْ قَوْمَكَ مِنْ قَبْلِ أَنْ يَّأْتِيَهُمْ عَذَابٌ أَلِيْمٌ (نوح : 1) إِلَى آخِرِ السُّوْرَةِ وَاتْلُ عَلَيْهِمْ نَبَأَ نُوْحٍ إِذْ قَالَ لِقَوْمِهٰ يٰقَوْمِ إِنْ كَانَ كَبُرَ عَلَيْكُمْ مَّقَامِيْ وَتَذْكِيْرِيْ بِاٰيٰتِ اللهِ إِلَى قَوْلِهِ مِنَ الْمُسْلِمِيْنَ (يونس : 71-72) মহান আল্লাহর বাণীঃ ‘‘আমি নূহকে তার জাতির নিকট প্রেরণ করেছিলাম’’(নূহঃ ১) ........... সূরার শেষ পর্যন্ত। ‘‘আর তাদেরকে শুনিয়ে দাও নূহের অবস্থা-যখন সে স্বীয় সম্প্রদায়কে বলল, হে আমার সম্প্রদায়, যদি তোমাদের মাঝে আমার অবস্থিতি এবং আল্লাহর আয়াতসমূহের মাধ্যমে নসীহাত করা ভারী বলে মনে হয়ে থাকে . . . . . . . আমি আনুগত্য অবলম্বন করি।’’ (ইউনুসঃ ৭১-৭২) ৩৩৩৭. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা জনসমাবেশে দাঁড়ালেন এবং আল্লাহর যথোপযুক্ত প্রশংসা করলেন, অতঃপর দাজ্জালের উল্লেখ করে বললেন, আমি তোমাদেরকে তার নিকট হতে সাবধান করছি আর প্রত্যেক নবীই নিজ নিজ সম্প্রদায়কে এ দাজ্জাল হতে সাবধান করে দিয়েছেন। নূহ (আঃ)-ও নিজ সম্প্রদায়কে দাজ্জাল হতে সাবধান করেছেন। কিন্তু আমি তোমাদেরকে তার সম্বন্ধে এমন একটা কথা বলছি, যা কোন নবী তাঁর সম্প্রদায়কে বলেননি। তা হলো তোমরা জেনে রেখ, নিশ্চয়ই দাজ্জাল এক চক্ষু বিশিষ্ট, আর আল্লাহ এক চক্ষু বিশিষ্ট নন। (৩০৫৭) (মুসলিম ২৮/৭ হাঃ ৩৯৩২, আহমাদ ৩৬৩০) (আধুনিক প্রকাশনীঃ ৩০৯০, ইসলামিক ফাউন্ডেশনঃ ৩০৯৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 12
			}
		}
	]
}