{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3393,
			"arabicnumber": 3393,
			"text": "وَهَلْ أَتٰكَ حَدِيْثُ مُوْسٰٓى إِذْ رَاٰى نَارًا إِلَى قَوْلِهِ بِالْوَادِ الْمُقَدَّسِ طُوًى আপনার নিকট কি মূসার বৃত্তান্ত পৌঁছেছে? তিনি যখন আগুন দেখলেন....‘তুমি ‘তুয়া’ নামক এক পবিত্র ময়দানে রয়েছ। (ত্ব-হা ৯-১৩) اٰنَسْتُ أَبْصَرْتُ نَارًا لَّعَلِّيْ اٰتِيْكُمْ مِّنْهَا بِقَبَسٍ الْآيَةَ قَالَ ابْنُ عَبَّاسٍ الْمُقَدَّسُ الْمُبَارَكُ طُوًى اسْمُ الْوَادِيْ سِيْرَتَهَا حَالَتَهَا وَ النُّهٰى التُّقَى بِمَلْكِنَا بِأَمْرِنَا هَوٰى شَقِيَ فَارِغًا إِلَّا مِنْ ذِكْرِ مُوْسَى رِدْءًا كَيْ يُصَدِّقَنِيْ وَيُقَالُ مُغِيْثًا أَوْ مُعِيْنًا يَبْطُشُ وَ يَبْطِشُ يَأْتَمِرُوْنَ يَتَشَاوَرُوْنَ وَالْجِذْوَةُ قِطْعَةٌ غَلِيْظَةٌ مِنْ الْخَشَبِ لَيْسَ فِيْهَا لَهَبٌ سَنَشُدُّ سَنُعِيْنُكَ كُلَّمَا عَزَّزْتَ شَيْئًا فَقَدْ جَعَلْتَ لَهُ عَضُدًا وَقَالَ غَيْرُهُ كُلَّمَا لَمْ يَنْطِقْ بِحَرْفٍ أَوْ فِيْهِ تَمْتَمَةٌ أَوْ فَأْفَأَةٌ فَهِيَ عُقْدَةٌ أَزْرِي ظَهْرِيْ فَيُسْحِتَكُمْ فَيُهْلِكَكُمْ الْمُثْلٰى تَأْنِيْثُ الأَمْثَلِ يَقُوْلُ بِدِيْنِكُمْ يُقَالُ خُذْ الْمُثْلَى خُذْ الأَمْثَلَ ثُمَّ ائْتُوْا صَفًّا (طه : 64) يُقَالُ هَلْ أَتَيْتَ الصَّفَّ الْيَوْمَ يَعْنِي الْمُصَلَّى الَّذِيْ يُصَلَّى فِيْهِ فَأَوْجَسَ أَضْمَرَ خَوْفًا فَذَهَبَتْ الْوَاوُ مِنْ خِيْفَةً لِكَسْرَةِ الْخَاءِ فِيْ جُذُوعِ النَّخْلِ عَلَى جُذُوعِ خَطْبُكَ بَالُكَ مِسَاسَ مَصْدَرُ مَاسَّهُ مِسَاسًا لَنَنْسِفَنَّهُ لَنُذْرِيَنَّهُ الضَّحَآءُ الْحَرُّ قُصِّيهِ اتَّبِعِيْ أَثَرَهُ وَقَدْ يَكُوْنُ أَنْ تَقُصَّ الْكَلَامَ نَحْنُ نَقُصُّ عَلَيْكَ عَنْ جُنُبٍ عَنْ بُعْدٍ وَعَنْ جَنَابَةٍ وَعَنْ اجْتِنَابٍ وَاحِدٌ قَالَ مُجَاهِدٌ عَلٰى قَدَرٍ مَوْعِدٌ لَا تَنِيَا مَكَانًا سُوًي : مَنْصَفُ بَيْنَهُمْ .لَا تَضْعُفَا يَبَسًا : يَابِسَا مِنْ زِيْنَةِ الْقَوْمِ الْحُلِيِّ الَّذِيْ اسْتَعَارُوْا مِنْ آلِ فِرْعَوْنَ فَقَذَفْتُهَا أَلْقَيْتَهَا أَلْقَى صَنَعَ فَنَسِيَ مُوْسٰى هُمْ يَقُوْلُوْنَهُ أَخْطَأَ الرَّبَّ أَنْ لَا يَرْجِعَ إِلَيْهِمْ قَوْلًا فِي الْعِجْلِ آنَسْتُ অর্থ আমি আগুন দেখেছি। সম্ভবতঃ আমি তোমাদের জন্য তা হতে কিছু জ্বলন্ত আগুন আনতে পারব... (ত্বোয়া-হা ১০) ইবনু ‘আব্বাস (রাঃ) বলেন, الْمُقَدَّسُ অর্থ বরকতময়। طُوًى একটি উপত্যকার নাম। سِيْرَتَهَا অর্থ তার অবস্থায়। النُّهَى অর্থ আল্লাহভীরু। بِمَلْكِنَا অর্থ আমাদের ইচ্ছামত هَوَى অর্থ ভাগ্যাহত হয়েছে। فَارِغًا অর্থ মূসার স্মরণ ব্যতীত সব কিছু থেকে শুনা হয়ে গেল। رِدْءًا অর্থ সাহায্যকারী রূপে যেন সে আমাকে সমর্থন করে। এর অর্থ আরো বলা হয় আর্তনাদে সাড়াদানকারী বা সাহায্যকারী। يَبْطُشُ ويَبْطِشُ একই অর্থ উভয় কিরাআতে। يَأْتَمِرُوْنَ অর্থ পরস্পর পরামর্শ করা। درأً অর্থ সাহায্য করা। বলা হয় اردأته على صنعته অর্থাৎ আমি তার কাজে সাহায্য করেছি। الْجِذْوَةُ কাঠের বড় টুকরার অঙ্গার যাতে কোন শিখা। سَنَشُدُّ অর্থ অচিরেই আমি তোমার সাহায্য করব। বলা হয় যখন তুমি কারো সাহায্য করবে তখন তুমি যেন তার পার্শ্বদেশ হয়ে গেলে। এবং অন্যান্যগণ বলেন যে কোন অক্ষর উচ্চারণ করতে পারেনা অথবা তার মুখ হতে তা, তা, ফা, ফা উচ্চারিত হয় তাকেই তোতলামি বলে। أَزْرِيْ অর্থ আমার পিঠ فَيُسْحِتَكُمْ অর্থ- সে তোমাদেরকে ধ্বংস করে দেবে। الْمُثْلَى শব্দটি امْثَلِ শব্দের স্ত্রী লিঙ্গ। আয়াতে উল্লিখিত بِدِيْنِكُمْ -অর্থ তোমাদের দ্বীন। বলা হয়, خُذْ الْمُثْلَى خُذْ الأَمْثَلَ অর্থ-উত্তমটি গ্রহণ করো। ثُمَّ ائْتُوْا صَفًّا অর্থাৎ তোমরা সারিবদ্ধ হয়ে এসো। বলা হয়, তুমি কি আজ ছফ্ফে উপস্থিত হয়েছিলে অর্থাৎ যেখানে নামায পড়া হয় সেখানে? فَأَوْجَسَ অর্থ- সে অন্তরে ভয় পোষণ করেছে। خِيْفَةً মূলে خَاءِ অক্ষরে যের হবার কারণে ياء-واو তে পরিবর্তিত হয়েছে। فِيْ جُذُوعِ النَّخْلِ এখানে على- فيঅর্থে ব্যবহৃত হয়েছে। خَطْبُكَ অর্থ- তোমার অবস্থা। مِسَاسَ শব্দটি مَاسَّهُ مِسَاسًا এর মাসদার। অর্থ-তোমার অবস্থা। لَنَنْسِفَنَّهُ অর্থ-আমি অবশ্যই তাকে উড়িয়ে দিব। الضَّحَاءُ অর্থ পূর্বাহ্ন, যখন সূর্যের উষ্ণতা বেড়ে যায়। قُصِّيهِ তুমি তার পিছনে পিছনে যাও। কখনো এ অর্থেও ব্যবহৃত হয় যে, তুমি তোমার কথা বলো যেমন, نَحْنُ نَقُصُّ عَلَيْكَ এর মধ্যে এ অর্থ ব্যবহৃত হয়েছে। عَنْ جُنُبٍ অর্থ-দূর থেকে। اجْتِنَابٍ -جَنَابَةٍ একই অর্থে ব্যবহৃত হয়। আর মুজাহিদ (রহ.) বলেন, عَلَى قَدَرٍ অর্থ-নির্ধারিত সময়ে। لَا تَنِيَا অর্থ দুর্বল হয়োনা। َمكَانًا سَوِيْ অর্থ-তাদের মধ্যবর্তী স্থান। يَبَسًا অর্থ-শুক্না। مِنْ زِيْنَةِ الْقَوْمِ অর্থ-যে সব অলংকার তারা ফির‘আউনের লোকদের হতে ধার নিয়েছিল। فَقَذَفْتُهَا অর্থ-আমি তা নিক্ষেপ করলাম। أَلْقَى অর্থ বানালো। فَنَسِيَ مُوْسَى অর্থ-তারা বল্তে লাগ্লো, মূসা রবের তালাশে ভুল পথে গিয়েছে। أَنْ لَا يَرْجِعَ إِلَيْهِمْ قَوْلًا অর্থ-তাদের কোন কথার প্রতি উত্তর সে দেয় না- এ আয়াতাংশ সামেরীর বাছূর সম্পর্কে অবতীর্ণ হয়েছে ৩৩৯৩. মালিক ইবনু সা‘সাআ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিরাজ রাত্রির ঘটনা বর্ণনা করতে গিয়ে তাঁদের নিকট এও বলেন, তিনি যখন পঞ্চম আকাশে এসে পৌঁছলেন, তখন হঠাৎ সেখানে হারূন (আঃ)-এর সঙ্গে সাক্ষাৎ হল। জিবরাঈল (আঃ) বললেন, ইনি হলেন, হারূন (আঃ) তাঁকে সালাম করুন তখন আমি তাঁকে সালাম করলাম। তিনি সালামের জবাব দিয়ে বললেন, মারহাবা পুণ্যবান ভাই ও পুণ্যবান নবী। সাবিত এবং ‘আববাদ ইবনু আবূ ‘আলী (রহ.) আনাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণনায় ক্বাতাদাহ (রহ.)-এর অনুসরণ করেছেন। (৩২০৭) (আধুনিক প্রকাশনীঃ ৩১৪৩, ইসলামিক ফাউন্ডেশনঃ ৩১৫২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 67
			}
		}
	]
}