{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3423,
			"arabicnumber": 3423,
			"text": "وَوَهَبْنَا لِدَاو”دَ سُلَيْمَانَ نِعْمَ الْعَبْدُ إِنَّه” أَوَّابٌ (ص : 30) আর আমি দাঊদকে দান করলাম সুলাইমান। সে ছিল অতি উত্তম বান্দা। তিনি তো ছিলেন অতিশয় আল্লাহ অভিমুখী। (সোয়াদ ৩০) الرَّاجِعُ الْمُنِيْبُ وَقَوْلِهِ وَهَبْ لِيْ مُلْكًا لَا يَنْبَغِيْ لِأَحَدٍ مِّنْ بَعْدِيْ (ص : 35) وَقَوْلِهِ وَاتَّبَعُوْا مَا تَتْلُوا الشَّيَاطِيْنُ عَلٰى مُلْكِ سُلَيْمَانَ (البقرة : 102) وَلِسُلَيْمٰنَ الرِّيْحَ غُدُوُّهَا شَهْرٌوَرَوَاحُهَا شَهْرٌ (سبأ : 12) وَأَسَلْنَا لَهُ عَيْنَ الْقِطْرِ (سبأ : 12) أَذَبْنَا لَهُ عَيْنَ الْحَدِيْدِ وَمِنَ الْجِنِّ مَنْ يَّعْمَلُ بَيْنَ يَدَيْهِ إِلَى قَوْلِهِ مِنْ مَّحَارِيْبَ (سبأ : 12) قَالَ مُجَاهِدٌ بُنْيَانٌ مَا دُوْنَ الْقُصُوْرِ وَتَمَاثِيْلَ وَجِفَانٍ كَالْجَوَابِ (سبأ : 12) كَالْحِيَاضِ لِلْإِبِلِ وَقَالَ ابْنُ عَبَّاسٍ كَالْجَوْبَةِ مِنْ الأَرْضِ وَقُدُوْرٍ رَاسِيَاتٍ اعْمَلُوْا آلَ دَاوُدَ شُكْرًا وَقَلِيْلٌ مِنْ عِبَادِيَ الشَّكُوْرُ (سبأ : 12) فَلَمَّا قَضَيْنَا عَلَيْهِ الْمَوْتَ مَا دَلَّهُمْ عَلٰى مَوْتِهٰ إِلَّا دَآبَّةُ الأَرْضِ الأَرَضَةُ تَأْكُلُ مِنْسَأَتَهُ عَصَاهُ فَلَمَّا خَرَّ إِلَى قَوْلِهِ فِي الْعَذَابِ الْمُهِيْنِ (سبأ : 13-14) حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي (ص : 32) فَطَفِقَ مَسْحًا بِالسُّوقِ (ص : 33) وَالأَعْنَاقِ يَمْسَحُ أَعْرَافَ الْخَيْلِ وَعَرَاقِيْبَهَا الْأَصْفَادُ الْوَثَاقُ قَالَ مُجَاهِدٌ الصَّافِنَاتُ صَفَنَ الْفَرَسُ رَفَعَ إِحْدَى رِجْلَيْهِ حَتَّى تَكُوْنَ عَلَى طَرَفِ الْحَافِرِ الْجِيَادُ السِّرَاعُ جَسَدًا شَيْطَانًا رُخَآءً طَيِّبَةً حَيْثُ أَصَابَ حَيْثُ شَاءَ فَامْنُنْ أَعْطِ بِغَيْرِ حِسَابٍ بِغَيْرِ حَرَجٍ أَوَّابٌ অর্থ গোনাহ হতে ফিরে যে আল্লাহ্ অভিমুখী হয়। মহান আল্লাহর বাণীঃ তিনি প্রার্থনা করলেনঃ হে আমার রব! আমাকে ক্ষমা করুন এবং আমাকে এমন রাজ্য দান করুন, যা আমি ছাড়া আর কারও ভাগ্যে যেন না জোটে- (সোয়াদ ৩৫)। মহান আল্লাহর বাণীঃ তারা তা অনুসরণ করল যা শয়তানরা আবৃত্তি করত সুলাইমানের রাজত্বকালে- (আল-বাকারাহ ১০২) মহান আল্লাহর বাণীঃ আমি বায়ুকে সুলায়মানের অধীন করে দিলাম যা সকালে এক মাসের পথ অতিক্রম করত এবং বিকালে এক মাসের পথ অতিক্রম করত। আর আমি তার জন্য বিগলিত তামার এক প্রস্রবণ প্রবাহিত করেছিলাম। أَسَلْنَا অর্থ বিগলিত করে দিলাম عَيْنَ الْقِطْرِ অর্থ লোহার প্রসবণ-আর কতক জ্বিন তাঁর রবের নির্দেশে তার সামনে কাজ করতো। তাদের যে কেউ আমার আদেশ অমান্য করে, তাকে জ্বলন্ত আগুনের শাস্তি আস্বাদন করাব। জ্বিনেরা সুলায়মানের ইচ্ছানুযায়ী তার জন্য প্রাসাদ তৈরি করত। মুজাহিদ (রহ.) বলেন, مَحَارِيْبَ অর্থ বড় বড় দালানের তুলনায় ছোট ইমারত-ভাস্কর্য শিল্প প্রস্তুত করতো, আর হাউজ সদৃশ বৃহদাকার রান্না করার পাত্র তৈরি করতো- যেমন উটের জন্য হাওম থাকে। ইবনু ‘আব্বাস (রাঃ) বলেন, যেমন যমীনে গর্ত থাকে। আর তৈরি বিশাল বিশাল ডেকচি যা সুদৃঢ়ভাবে স্থাপিত। হে দাউদের পরিবার! আমার কৃতজ্ঞতার সঙ্গে তোমরা কাজ কর। আর আমার বান্দাগণের মধ্যে অল্পই শুকুর গুযারী করে- (সাবা ১২-১৩)। إِلَّا دَابَّةُ الأرْضِ কেবল মাটির পোকা অর্থাৎ উই পোকা যা তার (সুলায়মানের) লাঠি খেতেছিল। مِنْسَأَتَهُ তার লাঠি। যখন সে (সুলায়মান) পড়ে গেল....লাঞ্ছনাদায়ক শাস্তিতে- (সাবা ১৪) মহান আল্লাহর বাণীঃ সম্পদের মোহে আমার রবের স্মরণ থেকে-আয়াতাংশে عن অর্থ فَطَفِقَ مَسْحًا - من অর্থ তিনি (সুলায়মান আ) ঘোড়াগুলোর গর্দানসমূহ ও তাদের হাঁটুর নলাসমূহ কাটতে লাগলেন। الأَصْفَادُ অর্থ, শৃক্মখলসমূহ। মুজাহিদ (রহ.) বলেন, الصَّافِنَاتُ অর্থ, দৌড়ের জন্য প্রস্তুত ঘোড়াসমূহ। এ অর্থ صَفَنَ الْفَرَسُ হতে গৃহীত। ঘোড়া যখন দৌড়ের জন্য প্রস্তুতি নিয়ে এক পা উঠিয়ে অন্য পায়ের খুরার উপর দাঁড়িয়ে যায়, তখন এ বাক্য বলা হয়। الْجِيَادُ অর্থ দ্রুতগামী, جَسَدًا শয়তান رُخَاءً -উত্তম حَيْثُ أَصَابَ যেখানে ইচ্ছা فَامْنُنْ দান কর بِغَيْرِ حِسَابٍ নির্দ্বিধায়। (সদ ৩১-৩৮) ৩৪২৩. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, একটি অবাধ্য জ্বিন এক রাতে আমার সালাতে বাধা সৃষ্টির উদ্দেশ্যে আমার নিকট আসল। আল্লাহ্ আমাকে তার উপর ক্ষমতা প্রদান করলেন। আমি তাকে ধরলাম এবং মসজিদের একটি খুঁটির সঙ্গে বেঁধে রাখার ইচ্ছে করলাম, যাতে তোমরা সবাই স্বচক্ষে তাকে দেখতে পাও। তখনই আমার ভাই সুলায়মান (আঃ)-এর এ দু‘আটি আমার মনে পড়লো। হে আমার রব! আমাকে ক্ষমা করুন এবং আমাকে এমন রাজ্য দান করুন, যা আমি ছাড়া আর কারও ভাগ্যে যেন না জোটে- (সোয়াদ ৩৫)। অতঃপর আমি জ্বিনটিকে ব্যর্থ এবং লাঞ্ছিত করে ছেড়ে দিলাম। জ্বিন কিংবা মানুষের অত্যন্ত পিশাচ ব্যক্তিকে ইফ্রীত বলা হয়। ইফ্রীত ও ইফ্রীয়াতুন যিব্নীয়াতুন-এর মত এক বচন, যার বহু বচন যাবানিয়াতুন। (৪৬১) (আধুনিক প্রকাশনীঃ ৩১৭১, ইসলামিক ফাউন্ডেশনঃ ৩১৮০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 95
			}
		}
	]
}