{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3430,
			"arabicnumber": 3430,
			"text": "بَابُ وَاضْرِبْ لَهُمْ مَثَلًا أَصْحٰبَ الْقَرْيَةِ الآية (يس : 13) الْآيَةَ فَعَزَّزْنَا ৬০/৪২. অধ্যায় : মহান আল্লাহর বাণীঃ আপনি তাদের কাছে এক জনপদের সে সময়ের ঘটনা বর্ণনা করুন, যখন তাদের কাছে কয়েকজন রাসূল এসেছিলেন। (ইয়াসীন ১৩) قَالَ مُجَاهِدٌ شَدَّدْنَا وَقَالَ ابْنُ عَبَّاسٍ طَائِرُكُمْ مَصَائِبُكُمْ মুজাহিদ(রহ.) বলেন, فَعَزَّزْنَا অর্থ আমি শক্তিশালী করলাম। আর ইবনু ‘আব্বাস (রাঃ) বলেন, طَائِرُكُمْ অর্থ তোমাদের বিপদসমূহ। ذِكْرُ رَحْمَةِ رَبِّكَ عَبْدَهচ زَكَرِيَّا إِذْ نَادٰى رَبَّهচ نِدَآءً خَفِيًّا قَالَ رَبِّ إِنِّيْ وَهَنَ الْعَظْمُ مِنِّيْ وَاشْتَعَلَ الرَّأْسُ شَيْبًا إِلَى قَوْلِهِ لَمْ نَجْعَلْ لَّهُ مِنْ قَبْلُ سَمِيًّا (مريم : ১-২) এ হল আপনার রবের অনুগ্রহের বিবরণ যা তাঁর বান্দা যাকারিয়ার প্রতি করা হয়েছে। ইতিপূর্বে আমি এ নামে কারও নামকরণ করিনি। (মারইয়াম ২-৭) قَالَ ابْنُ عَبَّاسٍ مِثْلًا يُقَالُ رَضِيًّا مَرْضِيًّا عُتِيًّا عَصِيًّا عَتَا يَعْتُو قَالَ رَبِّ أَنَّى يَكُوْنُ لِيْ غُلَامٌ وَّكَانَتِ امْرَأَتِيْ عَاقِرًا وَقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا إِلَى قَوْلِهِ ثَلٰثَ لَيَالٍ سَوِيًّا وَيُقَالُ صَحِيْحًا فَخَرَجَ عَلٰى قَوْمِهٰ مِنَ الْمِحْرَابِ فَأَوْحٰى إِلَيْهِمْ أَنْ سَبِّحُوْا بُكْرَةً وَّعَشِيًّا (مريم : ১০-১১) فَأَوْحَى فَأَشَارَ يٰيَحْيٰى خُذِ الْكِتَابَ بِقُوَّةٍ إِلَى قَوْلِهِ وَيَوْمَ يُبْعَثُ حَيًّا حَفِيًّا لَطِيْفًا عَاقِرًا الذَّكَرُ وَالْأُنْثَى سَوَاءٌ ইবনু ‘আব্বাস (রাঃ) বলেন, سَمِيَّا অর্থ-সমতুল্য। তেমন বলা হয় رَضِيَّا অর্থ مَرْضِيَّا পছন্দনীয়। عِتِيَّا অর্থ عَصِيَّا অর্থাৎ অবাধ্য عَتَا يَعْتُوْ থেকে গৃহীত। যাকারিয়া বললেন, হে আমার প্রতিপালক! কেমন করে আমার সন্তান হবে? আমার স্ত্রী তো বন্ধ্যা? আর আমিও তো বার্ধক্যের চূড়ান্তে পৌঁছেছি। তিনি বললেন, তোমার নিদর্শন হলো তুমি সুস্থ অবস্থায় তিন দিন কারো সঙ্গে কথাবার্তা বলবে না। অতঃপর তিনি মিহরাব হতে বের হয়ে তাঁর কাউমের নিকট আসলেন, আর ইঙ্গিতে তাদেরকে সকাল-সন্ধ্যায় আল্লাহর তাসবীহ পড়তে বললেন। فَأَوْحَى অর্থ, অতঃপর তিনি ইশারা করে বললেন। (আল্লাহ্ বললেন,) হে ইয়াহ্ইয়া! এ কিতাব শক্তভাবে ধারণ কর। যে দিন তিনি জীবিত পুনরুত্থিত হবেন- (মারইয়াম ২-১৫)। حَفِيًّا لَطِيْفًا অর্থে ব্যবহৃত হয়েছে। অর্থাৎ অতিশয় অনুগ্রহশীল। عَاقِرًا (বন্ধ্যা) শব্দটি পুং ও স্ত্রী উভয় লিঙ্গেই ব্যবহৃত হয়। ৩৪৩০. মালিক ইবনু সা‘সা‘আহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবাগণের নিকট মিরাজের রাত্রির বর্ণনায় বলেছেন, তারপর তিনি আমাকে নিয়ে উপরে চললেন, এমনকি দ্বিতীয় আকাশে এসে পৌঁছলেন এবং দরজা খুলতে বললেন, জিজ্ঞেস করা হলো কে? বললেন, আমি জিব্রাঈল। প্রশ্ন হলো। আপনার সঙ্গে কে? তিনি বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। জিজ্ঞেস করা হলো। তাঁকে কি ডেকে পাঠানো হয়েছে? উত্তর দিলেন হাঁ, অতঃপর আমরা যখন সেখানে পৌঁছলাম তখন সেখানে ইয়াহ্ইয়া ও ‘ঈসা (আঃ)-কে দেখলাম। তাঁরা উভয়ে খালাত ভাই ছিলেন। জিব্রাঈল বললেন, এঁরা হলেন, ইয়াহ্ইয়া এবং ‘ঈসা (আঃ)। তাদেরকে সালাম করুন। তখন আমি সালাম দিলাম। তাঁরাও সালামের জবাব দিলেন। অতঃপর তাঁরা বললেন, নেক ভাই এবং নেক নবীর প্রতি মারহাবা। (৩২০৭) (আধুনিক প্রকাশনীঃ ৩১৭৭, ইসলামিক ফাউন্ডেশনঃ ৩১৮৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 101
			}
		}
	]
}