{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3436,
			"arabicnumber": 3436,
			"text": "نَبَذْنَاهُ أَلْقَيْنَاهُ اعْتَزَلَتْ شَرْقِيًّا مِمَّا يَلِي الشَّرْقَ فَأَجَآءَهَا أَفْعَلْتُ مِنْ جِئْتُ وَيُقَالُ أَلْجَأَهَا اضْطَرَّهَا تَسَّاقَطْ تَسْقُطْ قَصِيًّا قَاصِيًا فَرِيًّا عَظِيْمًا قَالَ ابْنُ عَبَّاسٍ نِسْيًا لَمْ أَكُنْ شَيْئًا وَقَالَ غَيْرُهُ النِّسْيُ الْحَقِيْرُ وَقَالَ أَبُوْ وَائِلٍ عَلِمَتْ مَرْيَمُ أَنَّ التَّقِيَّ ذُوْ نُهْيَةٍ حِيْنَ قَالَتْ إِنْ كُنْتَ تَقِيًّا (مريم : 18) قَالَ وَكِيْعٌ عَنْ إِسْرَائِيْلَ عَنْ أَبِيْ إِسْحَاقَ عَنْ الْبَرَاءِ سَرِيًّا نَهَرٌ صَغِيْرٌ بِالسُّرْيَانِيَّةِ شَرْقِيًّا শব্দটি الشَّرْقَ শব্দ থেকে, যার অর্থ পূর্বদিকে। فَأَجَاءَهَا শব্দটি جِئْتُ হতে أفعَلَ এর রূপে হয়েছে। أَجَأهَا এর স্থলে الجَأهَا ও বলা হয়েছে যার অর্থ হবে তাকে অধীর করে তুললো। تَسَّاقَطْ শব্দটি تَسْقُطْ এর অর্থ দেবে। قَاصِيًا শব্দটি قَصِيًّا এর অর্থে ব্যবহৃত। فَرِيًّا অর্থ বিশাল। ইবনু ‘আব্বাস (রাঃ) বলেছেন, نِسْيًا অর্থ আমার অস্তিত্ব না থাকে। অন্যেরা বলেছেন, النِّسْيُ অর্থ তুচ্ছ, ঘৃণিত। আবূ ওয়ায়িল (রহ.) বলেছেন, মারিয়ামের উক্তি إِنْ كُنْتَ تَقِيًّا এর অর্থ যদি তুমি জ্ঞানী হও। ওকী‘ (রহ.)....বলেন, বারআ (রাঃ) হতে বর্ণিত। سَرِيًّا শব্দটির অর্থ সিরীয় ভাষায় ছোট নদী। ৩৪৩৬. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তিনজন শিশু ছাড়া আর কেউ দোলনায় থেকে কথা বলেনি। প্রথম জন ঈসা (আঃ), দ্বিতীয় জন বনী ইসরাঈলের এক ব্যক্তি যাকে ‘জুরাইজ’ নামে ডাকা হতো। একদা ‘ইবাদাতে রত থাকা অবস্থায় তার মা এসে তাকে ডাকল। সে ভাবল আমি কি তার ডাকে সাড়া দেব,না সালাত আদায় করতে থাকব। তার মা বলল, হে আল্লাহ্! ব্যাভিচারিণীর মুখ না দেখা পর্যন্ত তুমি তাকে মৃত্যু দিও না। জুরাইজ তার ‘ইবাদাতখানায় থাকত। একবার তার নিকট একটি নারী আসল। তার সঙ্গে কথা বলল। কিন্তু জুরাইজ তা অস্বীকার করল। অতঃপর নারীটি একজন রাখালের নিকট গেল এবং তাকে দিয়ে মনোবাসনা পূর্ণ করল। পরে সে একটি পুত্র সন্তান প্রসব করল। তাকে জিজ্ঞেস করা হলো এটি কার থেকে? স্ত্রী লোকটি বলল, জুরাইজ থেকে। লোকেরা তার নিকট আসল এবং তার ‘ইবাদাতখানা ভেঙ্গে দিল। আর তাকে নীচে নামিয়ে আনল ও তাকে গালি গালাজ করল। তখন জুরাইজ উযূ সেরে ‘ইবাদাত করল। অতঃপর নবজাত শিশুটির নিকট এসে তাকে জিজ্ঞেস করল হে শিশু! তোমার পিতা কে? সে জবাব দিল সেই রাখাল। তারা বলল, আমরা আপনার ‘ইবাদাতখানাটি সোনা দিয়ে তৈরি করে দিচ্ছি। সে বলল, না। তবে মাটি দিয়ে। (তৃতীয় জন) বনী ইসরাঈলের একজন নারী তার শিশুকে দুধ পান করাচ্ছিল। তার কাছ দিয়ে একজন সুদর্শন পুরুষ আরোহী চলে গেল। নারীটি দু‘আ করল, হে আল্লাহ্! আমার ছেলেটি তার মত বানাও। শিশুটি তখনই তার মায়ের স্তন ছেড়ে দিল এবং আরোহীটির দিকে মুখ ফিরালো। আর বলল, হে আল্লাহ্! আমাকে তার মত কর না। অতঃপর মুখ ফিরিয়ে স্তন্য পান করতে লাগল। আবূ হুরাইরাহ্ (রাঃ) বললেন, আমি যেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখতে পাচ্ছি তিনি আঙ্গুল চুষছেন। অতঃপর সেই নারীটির পার্শ্ব দিয়ে একটি দাসী চলে গেল। নারীটি বলল, হে আল্লাহ! আমার শিশুটিকে এর মত করো না। শিশুটি তারক্ষণিক তার মায়ের স্তন্য ছেড়ে দিল। আর বলল, হে আল্লাহ্! আমাকে তার মত কর। তার মা বলল, তা কেন? শিশুটি বলল, সেই আরোহীটি ছিল যালিমদের একজন। আর এ দাসীটির ব্যাপারে লোকে বলেছে তুমি চুরি করেছ, যিনা করেছ। অথচ সে কিছুই করেনি। (১২০৬, মুসলিম ৪৫/২ হাঃ ২৫৫০, আহমাদ ১০০৪৮) (আধুনিক প্রকাশনীঃ ৩১৮২, ইসলামিক ফাউন্ডেশনঃ ৩১৯১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 107
			}
		}
	]
}