{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3571,
			"arabicnumber": 3571,
			"text": "‘ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত যে, এক সফরে তাঁরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলেন। সারা রাত পথ চলার পর যখন ভোর কাছাকাছি হল, তখন বিশ্রাম নেয়ার জন্য থেমে গেলেন এবং গভীর ঘুমে ঘুমিয়ে পড়লেন। অবশেষে সূর্য উদিত হয়ে অনেক উপরে উঠে গেল, [ইমরান (রাঃ) বলেন] যিনি সর্বপ্রথম ঘুম হতে জাগলেন তিনি হলেন আবূ বাকর (রাঃ)। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে জাগ্রত না হলে তাঁকে জাগানো হত না। অতঃপর ‘উমার (রাঃ) জাগলেন। আবূ বাকর (রাঃ) তাঁর শিয়রের নিকট গিয়ে বসে উচ্চস্বরে ‘আল্লাহু আকবার’ বলতে লাগলেন। শেষে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জেগে উঠলেন এবং অন্যত্র চলে গিয়ে অবতরণ করে আমাদেরকে নিয়ে ফজরের সালাত আদায় করলেন। তখন এক ব্যক্তি আমাদের সাথে সালাত আদায় না করে দূরে দাঁড়িয়ে থাকল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত শেষ করে বললেন, হে অমুক! আমাদের সঙ্গে সালাত আদায় করতে কিসে বাধা দিল? লোকটি বলল, আমি অপবিত্র হয়েছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে পাক মাটি দ্বারা তায়াম্মুম করার নির্দেশ দিলেন, অতঃপর সে সালাত আদায় করল। (ইমরান (রাঃ) বলেন) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে অগ্রবর্তী দলের সঙ্গে পাঠিয়ে দিলেন এবং আমরা ভীষণ তৃষ্ণার্ত হয়ে পড়লাম। এই অবস্থায় আমরা পথ চলছি। হঠাৎ উষ্ট্রে আরোহী এক মহিলা আমাদের নযরে পড়ল। সে পানি ভর্তি দু’টি মশকের মাঝখানে পা ঝুলিয়ে বসে ছিল। আমরা তাকে জিজ্ঞেস করলাম, পানি কোথায়? সে বলল, (আশেপাশে) কোথায়ও পানি নেই। আমরা বললাম, তোমার ও পানির জায়গার মধ্যে দূরত্ব কতটুকু? সে বলল একদিন ও এক রাতের দূরত্ব। আমরা তাকে বললাম, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট চল। সে বলল, আল্লাহর রাসূল কী? আমরা তাকে যেতে না দিয়ে তাকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট নিয়ে গেলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসেও ঐ রকম কথাই বলল যা সে আমাদের সঙ্গে বলেছিল। তবে সে তাঁর নিকট বলল, সে কয়েকজন ইয়াতীম সন্তানের মা। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মশক দু’টি নামিয়ে ফেলতে আদেশ করলেন। অতঃপর তিনি মশক দু’টির মুখে হাত বুলালেন। আমরা তৃষ্ণার্ত চল্লিশ জন মানুষ পানি পান করে পিপাসা মিটালাম। অতঃপর আমাদের সকল মশক, বাসনপত্র পানি ভর্তি করে নিলাম। তবে উটগুলোকে পানি পান করান হয়নি। এত সবের পরও মহিলার মশকগুলো এত পানি ভর্তি ছিল যে তা ফেটে যাবার উপক্রম হয়ে গিয়েছিল। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের নিকট যা কিছু আছে উপস্থিত কর। কিছু খেজুর ও রুটির টুকরা জমা করে তাঁকে দেয়া হল। এ নিয়ে নারীটি খুশীর সঙ্গে তার গৃহে ফিরে গেল। গৃহে গিয়ে সকলের নিকট সে বলল, আমার সাক্ষাৎ হয়েছিল, এক মহা যাদুকরের সঙ্গে অথবা মানুষে যাকে নবী বলে ধারণা করে তার সঙ্গে। আল্লাহ্ এই মহিলার মাধ্যমে এ বস্তিবাসীকে হিদায়াত দান করলেন। স্ত্রীলোকটি নিজেও ইসলাম গ্রহণ করল এবং বস্তিবাসী সকলেই ইসলাম গ্রহণ করল। (৩৪৪) (আধুনিক প্রকাশনীঃ ৩৩০৭, ইসলামিক ফাউন্ডেশনঃ ৩৩১৫)",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 80
			}
		}
	]
}