{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"8": "Prayers (Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 371,
			"arabicnumber": 371,
			"text": "قَالَ أَبُو عَبْد اللهِ وَيُرْوَى عَنْ ابْنِ عَبَّاسٍ وَجَرْهَدٍ وَمُحَمَّدِ بْنِ جَحْشٍ عَنِ النَّبِيِّ صلى الله عليه وسلم الْفَخِذُ عَوْرَةٌ وَقَالَ أَنَسُ بْنُ مَالِكٍ حَسَرَ النَّبِيُّ صلى الله عليه وسلم عَنْ فَخِذِهِ قَالَ أَبُو عَبْد اللهِ وَحَدِيثُ أَنَسٍ أَسْنَدُ وَحَدِيثُ جَرْهَدٍ أَحْوَطُ حَتَّى يُخْرَجَ مِنْ اخْتِلَافِهِمْ وَقَالَ أَبُو مُوسَى غَطَّى النَّبِيُّ صلى الله عليه وسلم رُكْبَتَيْهِ حِينَ دَخَلَ عُثْمَانُ وَقَالَ زَيْدُ بْنُ ثَابِتٍ أَنْزَلَ اللهُ عَلَى رَسُولِهِ صلى الله عليه وسلم وَفَخِذُهُ عَلَى فَخِذِي فَثَقُلَتْ عَلَيَّ حَتَّى خِفْتُ أَنْ تَرُضَّ فَخِذِي. ইবনু ‘আব্বাস, জারহাদ ও মুহাম্মাদ ইবনু জাহশ (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন যে, ঊরু সতরের অন্তর্ভুক্ত। আর আনাস (রাযি.) বলেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঊরু হতে কাপড় সরিয়েছিলেন (আবূ ‘আবদুল্লাহ বুখারী [র] বলেন) সনদের দিক হতে আনাস (রাযি.)-এর হাদীস অধিক সহীহ্ আর জারহাদ (রাযি.)-এর হাদীস অধিকতর সতর্কতামূলক। এভাবেই আমরা (উম্মতের মধ্যে) মতবিরোধ এড়াতে পারি। আর আবূ মূসা (রাযি.) বলেছেনঃ ‘উসমান (রাযি.)-এর আগমনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হাঁটু ঢেকে নেন। যায়িদ ইবনু সাবিত (রাযি.) বলেনঃ আল্লাহ তা‘আলা তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর উপর ওহী নাযিল করেছেন এমন অবস্থায় যখন তাঁর ঊরু ছিল আমার ঊরুর উপর। আমার নিকট তাঁর ঊরু এত ভারী বোধ হচ্ছিল যে, আমি আশংকা করছিলাম, হয়ত ঊরুর হাড় ভেঙ্গে যাবে। ৩৭১. আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বার অভিযানে বের হয়েছিলেন। সেখানে আমরা খুব ভোরে ফজরের সালাত আদায় করলাম। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওয়ার হলেন। আবূ তালহা (রাযি.)-ও সওয়ার হলেন, আর আমি আবূ তালহার পিছনে উপবিষ্ট ছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সওয়ারীকে খায়বরের পথে চালিত করলেন। আমার হাঁটু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ঊরুতে লাগছিল। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ঊরু হতে ইযার সরে গেল। এমনকি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ঊরুর উজ্জ্বলতা যেন এখনো আমি দেখছি। তিনি যখন নগরে প্রবেশ করলেন তখন বললেনঃ আল্লাহু আকবার। খায়বর ধ্বংস হোক। আমরা যখন কোন কওমের প্রাঙ্গণে অবতরণ করি তখন সতর্কীকৃতদের ভোর হবে কতই না মন্দ! এ কথা তিনি তিনবার উচ্চারণ করলেন। আনাস (রাযি.) বলেনঃ খায়বারের অধিবাসীরা নিজেদের কাজে বেরিয়েছিল। তারা বলে উঠলঃ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! ‘আবদুল ‘আযীয (রহ.) বলেনঃ আমাদের কোন কোন সাথী ‘‘পূর্ণ বাহিনীসহ’’ (ওয়াল খামীস) শব্দও যোগ করেছেন। পরে যুদ্ধের মাধ্যমে আমরা খায়বর জয় করলাম। তখন যুদ্ধবন্দীদের সমবেত করা হলো। দিহ্য়া (রাযি.) এসে বললেনঃ হে আল্লাহর নবী! বন্দীদের হতে আমাকে একটি দাসী দিন। তিনি বললেন যাও, তুমি একটি দাসী নিয়ে যাও। তিনি সাফিয়্যাহ বিনত হুয়াই (রাযি.)-কে নিলেন। তখন এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বললঃ ইয়া নবীয়াল্লাহ! বনূ কুরাইযা ও বনূ নাযীরের অন্যতম নেত্রী সাফিয়্যাহ বিনত হুয়াইকে আপনি দিহ্য়াকে দিচ্ছেন? তিনি তো একমাত্র আপনারই যোগ্য। তিনি বললেনঃ দিহ্য়াকে সাফিয়্যাহসহ ডেকে আন। তিনি সাফিয়্যাহসহ উপস্থিত হলেন। যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যাহ (রাযি.)-কে দেখলেন তখন (দিহ্য়াকে) বললেনঃ তুমি বন্দীদের হতে অন্য একটি দাসী দেখে নাও। রাবী বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যাহ (রাযি.)-কে আযাদ করে দিলেন এবং তাঁকে বিয়ে করলেন। রাবী সাবিত (রহ.) আবূ হামযা (আনাস) (রাযি.)-কে জিজ্ঞেস করলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে কি মাহর দিলেন? আনাস (রাযি.) জওয়াব দিলেনঃ তাঁকে আযাদ করাই তাঁর মাহর। এর বিনিময়ে তিনি তাঁকে বিয়ে করেছেন। অতঃপর পথে উম্মু সুলায়ম (রাযি.) সাফিয়্যাহ (রাযি.)-কে সাজিয়ে রাতে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খিদমতে পেশ করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাসর রাত যাপন করে ভোরে উঠলেন। তিনি ঘোষণা দিলেনঃ যার নিকট খাবার কিছু আছে সে যেন তা নিয়ে আসে। এ বলে তিনি একটা চামড়ার দস্তরখান বিছালেন। কেউ খেজুর নিয়ে আসলো, কেউ ঘি আনলো। ‘আবদুল ‘আযীয (রহ.) বলেনঃ আমার মনে হয় আনাস (রাযি.) ছাতুর কথাও উল্লেখ করেছেন। অতঃপর তাঁরা এসব মিশিয়ে খাবার তৈরি করলেন। এ-ই ছিল রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ওয়ালীমাহ। (৬১০, ৯৪৭, ২২২৮, ২২৩৫, ২৮৮৯, ২৮৯৩, ২৯৪৩, ২৯৪৪, ২৯৪৫, ২৯৯১, ৩০৮৫, ৩০৮৬, ৩৩৬৭, ৩৬৪৭, ৪০৮৩, ৪০৮৪, ৪১৯৭, ৪১৯৮, ৪১৯৯, ৪২০০, ৪২০১, ৪২১১, ৪২১২, ৪২১৩, ৫০৮৫, ৫১৫৯, ৫১৬৯, ৫৩৮৭, ৫৪২৫, ৫৫২৮, ৫৯৬৮, ৬১৮৫, ৬৩৬৩, ৬৩৬৯,৭৩৩৩; মুসলিম ১৫/৮৫ হাঃ ১৩৬৫, আহমাদ ১২৬১২ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ৩৫৮, ইসলামিক ফাউন্ডেশনঃ ৩৬৪)",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		}
	]
}