{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "وَقَالَتْ عَائِشَةُ قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُرِيْتُ دَارَ هِجْرَتِكُمْ ذَاتَ نَخْلٍ بَيْنَ لَابَتَيْنِ فَهَاجَرَ مَنْ هَاجَرَ قِبَلَ الْمَدِيْنَةِ وَرَجَعَ عَامَّةُ مَنْ كَانَ هَاجَرَ بِأَرْضِ الْحَبَشَةِ إِلَى الْمَدِيْنَةِ فِيْهِ عَنْ أَبِيْ مُوْسَى وَأَسْمَاءَ عَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ‘আয়িশাহ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের হিজরা্তের স্থান আমাকে (স্বপ্নে) দেখান হয়েছে। যেখানে রয়েছে অনেক বৃক্ষ আর সে স্থানটি ছিল দুই পাহাড়ের মাঝখানে। তখন হিজরাতকারীগণ মদিনা্য় হিজরাত করলেন এবং যারা এর আগে হাবশাহ্য় হিজরাত করেছিলেন তারাও মদিনা্য় ফিরে আসলেন। এ সম্পর্কে আবূ মূসা ও আসমা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণিত আছে। ৩৮৭২. ‘উবাইদুল্লাহ ইবনু ‘আদী ইবনু খিয়ার (রহ.) ‘উরওয়াহ ইবনু যুবায়রকে বলেন যে, মিসওয়ার ইবনু মাখরামাহ এবং ‘আবদুর রহমান ইবনু আসওয়াদ ইবনু ‘আবদ ইয়াগুস (রাঃ) উভয়ই তাকে বলেন, তুমি তোমার মামা ‘উসমান (রাঃ)-এর সাথে তার (বৈপিত্রেয়) ভাই ওয়ালীদ ইবনু ‘উকবাহ সম্পর্কে কোন আলাপ-আলোচনা করছ না কেন? জনগণ তার বিরুদ্ধে শক্তভাবে সমালোচনা করছে। ‘উবাইদুল্লাহ বলেন, ‘উসমান (রাঃ) যখন সালাতের জন্য মসজিদে আসছিলেন তখন আমি তাঁর সামনে গিয়ে দাঁড়ালাম এবং তাঁকে লক্ষ্য করে বললাম, আপনার সাথে আমার কথা বলার দরকার আছে এবং তা আপনার কল্যাণের জন্যই। তিনি বললেন, ওহে, আমি তোমা হতে আল্লাহর নিকট আশ্রয় প্রার্থনা করছি। আমি তখন ফিরে আসলাম এবং যখন সালাত শেষ করলাম, তখন মিসওয়ার ও ইবনু ‘আবদ ইয়াগুস (রাঃ)-এর নিকট গিয়ে বসলাম এবং ‘উসমান (রাঃ)-কে আমি যা বলেছি এবং তিনি যে উত্তর দিয়েছেন তা দু’জনকে শুনালাম। তারা বললেন, তোমার উপর যে দায়িত্ব ও কর্তব্য ছিল তা তুমি আদায় করেছ। আমি তাদের নিকট উপবিষ্টই আছি এ সময়‘উসমান (রাঃ)-এর পক্ষ হতে একজন দূত আমাকে ডেকে নেয়ার জন্য আসলেন। তারা দু’জন আমাকে বললেন, আল্লাহ্ তোমাকে পরীক্ষায় ফেলেছেন। আমি চললাম এবং ‘উসমান (রাঃ)-এর নিকট প্রবেশ করলাম। তিনি আমাকে জিজ্ঞেস করলেন, তোমার কী উপদেশ যা তুমি কিছুক্ষণ আগে বলতে চেয়েছিলে? তখন আমি কালিমা শাহাদাত পাঠ করে বললাম, আল্লাহ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে রাসূলরূপে প্রেরণ করেছেন, তাঁর উপর কিতাব অবতীর্ণ করেছেন। আর আপনি ঐ দলেরই অন্তর্ভুক্ত যারা আল্লাহ্ ও তাঁর রাসূলের ডাকে সাড়া দিয়েছেন, আপনি তাঁর উপর ঈমান এনেছেন, এবং প্রথম দু’ হিজরতে আপনি অংশ নিয়েছেন, আপনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গ লাভ করেছেন এবং তাঁর স্বভাব-চরিত্র চক্ষে দেখেছেন। জন সাধারণ ওয়ালিদ ইবনু ‘উকবাহ্ সম্পর্কে অনেক সমালোচনা করছে, আপনার কর্তব্য তাঁর উপর দন্ড জারি করা। ‘উসমান (রাঃ) আমাকে লক্ষ্য করে বললেন, হে ভাতিজা! তুমি কি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে পেয়েছ? আমি বললাম না, পাইনি। তবে তাঁর বিষয় আমার নিকট এমন ভাবে পৌঁছেছে যেমন ভাবে কুমারী মেয়েদের নিকট পর্দার সংবাদ পৌঁছে থাকে। ‘উবাইদুল্লাহ (রহ.) বলেন, ‘উসমান (রাঃ) কালিমা শাহাদত পাঠ করলেন এবং বললেন, নিশ্চয়ই আল্লাহ্ মুহম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সত্যসহ প্রেরণ করেছেন, তাঁর উপর কিতাব অবতীর্ণ করেছেন। যারা আল্লাহ্ ও তাঁর রাসূলের ডাকে সাড়া দিয়েছেন তাঁদের মধ্যে আমিও ছিলাম। মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে যা সহ প্রেরণ করা হয়েছিল আমি তাঁর প্রতি ঈমান এনেছি। ইসলামের প্রথম যুগের দু’ হিজরতে অংশ গ্রহণ করেছি যেমন তুমি বলছ। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গ লাভ করেছি, তাঁর হাতে বায়‘আত করেছি। আল্লাহর কসম, আমি তাঁর অবাধ্যতা করিনি। তাঁর সাথে প্রতারণা করিনি। এমতাবস্থায় তাঁর ওফাত হয়ে যায়। তারপর আল্লাহ্ তা‘আলা আবূ বাকর (রাঃ) কে খালীফাহ নিযুক্ত করলেন। আল্লাহর কসম, আমি তাঁরও নাফরমানী করিনি, তাঁর সাথে প্রতারণা করিনি। অতঃপর ‘উমার (রাঃ) খালীফাহ মনোনীত হলেন। আল্লাহর কসম, আমি তাঁরও অবাধ্য হইনি, তাঁর সাথে প্রতারণা করিনি। তিনিও মৃত্যুপ্রাপ্ত হলেন। এবং তারপর আমাকে খলীফা নিযুক্ত করা হল। আমার উপর তাদের বাধ্য থাকার যে রূপ হক ছিল তোমাদের উপর তাদের ন্যায় আমার প্রতি বাধ্য থাকার কি কোন কর্তব নেই? ‘উবাইদুল্লাহ বললেন, হাঁ। অবশ্যই হক আছে। ‘উসমান (রাঃ) বললেন, তাহলে এসব কথাবার্তা কী, তোমাদের পক্ষ হতে আমার নিকট আসছে? আর ওয়ালীদ ইবনু ‘উকবাহর ব্যাপারে তুমি যা বললে, সে ব্যাপারে আমি অতি সত্বর সঠিক পদক্ষেপ নিব ইন্শাআল্লাহ্। অতঃপর তিনি ওয়ালীদকে চল্লিশটি বেত্রাঘাত করার রায় প্রদান করলেন এবং তা বাস্তবায়িত করার জন্য ‘‘আলী (রাঃ)-কে আদেশ করলেন। সেকালে অপরাধীদেরকে শাস্তি প্রদানের দায়িত্বে ‘আলী (রাঃ) নিযুক্ত ছিলেন। ইউনুস এবং যুহরীর ভাতিজা যুহরী সূত্রে যে বর্ণনা করেন তাতে রয়েছে; ‘তোমাদের উপর আমার কি অধিকার নেই যেমন অধিকার ছিল তাদের জন্য।’ (আধুনিক প্রকাশনীঃ ৩৫৮৫, ইসলামিক ফাউন্ডেশনঃ ৩৫৯০) আবূ ‘আব্দুল্লাহ বলেন, অতঃপর ওয়ালীদকে চল্লিশটি বেত্রাঘাত করা হলো এবং ‘আলী (রাঃ)-কে নির্দেশ করা হলো তাকে বেত্রাঘাত করার। এবং তিনি তাকে বেত্রাঘাত করেছিলেন। (৩৬৯৬) আবূ ‘আব্দুল্লাহ বলেন, بَلَاءٌ مِنْ رَبِّكُمْ ‘‘তোমাদের প্রতিপালকের পক্ষ হতে শক্ত পরীক্ষা স্বরূপ।’’ (আল-বাকারাহঃ ৪৯) অন্যস্থানে الْبَلَاءُ শব্দ الاِبْتِلَاءُ ও التَّمْحِيْصُ অর্থে এসেছে। যথা بَلَوْتُهُ وَمَحَّصْتُهُ তার ভিতরের জিনিস উদ্ঘাটন করেছি। يَبْلُوْ পরীক্ষা করা অর্থে এসেছে, যথা مُبْتَلِيكُمْ ‘‘তিনি তোমাদের পরীক্ষা করবেন।’’ (আল-বাকারাহঃ ২৪৯) আর بَلَاءٌ عَظِيْمٌ অর্থাৎ বড় নি‘মাত। এখানে أَبْلَيْتُهُ আমি তাকে নি‘মাত দান করেছি।’’ এ অর্থে এসেছে। আর পূর্বের আয়াতে ابْتَلَيْتُهُ ‘‘আমি তাকে পরীক্ষা করেছি।’’ এর অর্থে এসেছে।",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 97
			}
		}
	]
}