{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3950,
			"arabicnumber": 3950,
			"text": "সা‘দ ইবনু মু‘আয (রাঃ) হতে বর্ণিত। তিনি বলেছেন, তাঁর ও উমাইয়াহ ইবনু খালফের মধ্যে বন্ধুত্ব ছিল। উমাইয়াহ মদিনা্য় আসলে সা‘দ ইবনু মু’আযের মেহমান হত এবং সা‘দ (রাঃ) মক্কা্য় গেলে উমাইয়াহর আতিথ্য গ্রহণ করতেন। রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম মদিনা্য় হিজরাত করার পর একবার সা‘দ (রাঃ) ‘উমরাহ করার উদ্দেশে মক্কা গেলেন এবং উমাইয়াহর বাড়িতে অবস্থান করলেন। তিনি উমাইয়াহ্কে বললেন, আমাকে এমন একটি নিরিবিলি সময়ের কথা বল যখন আমি বাইতুল্লাহর তাওয়াফ করতে পারব। তাই দুপুরের কাছাকাছি সময়ে একদিন উমাইয়াহ তাঁকে সঙ্গে নিয়ে বের হল, তখন তাদের সঙ্গে আবূ জাহলের দেখা হল। তখন সে (উমাইয়াহ্কে লক্ষ্য করে) বলল, হে আবূ সফ্ওয়ান! তোমার সঙ্গে ইনি কে? সে বলল, ইনি সা‘দ। তখন আবূ জাহ্ল তাকে (সা‘দ ইবনু মু‘আযকে) বলল, আমি তোমাকে নিরাপদে মক্কা্য় তাওয়াফ করতে দেখছি অথচ তোমরা ধর্মত্যাগীদের আশ্রয় দিয়েছ এবং তাদেরকে সাহায্য ও সহযোগিতা করে চলেছ। আল্লাহর কসম, তুমি আবূ সফওয়ানের (উমাইয়াহ) সঙ্গে না থাকলে তোমার পরিজনদের কাছে নিরাপদে ফিরে যেতে পারতে না। সা‘দ (রাঃ) এর চেয়েও উচ্চস্বরে বললেন, আল্লাহর কসম, তুমি এতে যদি আমাকে বাধা দাও তাহলে আমিও এমন একটি বিষয়ে তোমাকে বাধা দেব যা তোমার জন্য এর চেয়েও কঠিন হবে। মদিনার পার্শ্ব দিয়ে তোমার যাতায়াতের রাস্তা (বন্ধ করে দেব)। তখন উমাইয়াহ তাকে বলল, হে সা‘দ! এ উপত্যকার সর্দার আবুল হাকামের সঙ্গে এরূপ উচ্চস্বরে কথা বলো না। তখন সা‘দ (রাঃ) বললেন, হে উমাইয়াহ! তুমি চুপ কর। আল্লাহর কসম, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, তারা তোমার হত্যাকারী। ‘উমাইয়াহ জিজ্ঞেস করল, মক্কার বুকে? সা‘দ (রাঃ) বললেন, তা জানি না। উমাইয়াহ এতে অত্যন্ত ভীত সন্ত্রস্ত হয়ে পড়ল। এরপর উমাইয়াহ বাড়ী গিয়ে তার (স্ত্রীকে) বলল, হে উম্মু সফওয়ান! সা‘দ আমার ব্যাপারে কী বলেছে জান? সে বলল, সা‘দ তোমাকে কী বলেছে? উমাইয়াহ বলল, সে বলেছে যে, মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাদেরকে জানিয়েছেন যে, তারা আমার হত্যাকারী। তখন আমি তাকে জিজ্ঞেস করলাম, তা কি মক্কা্য়? সে বলল, তা জানি না। অতঃপর ‘উমাইয়াহ বলল, আল্লাহর কসম, আমি কখনো মক্কা হতে বের হব না। কিন্তু বদর যুদ্ধের দিন আগত হলে আবূ জাহ্ল সকল জনসাধারণকে সদলবলে বের হওয়ার আহবান জানিয়ে বলল, তোমরা তোমাদের কাফেলা রক্ষা করার জন্য অগ্রসর হও। উমাইয়াহ বের হাওয়াকে অপছন্দ করলে আবূ জাহ্ল এসে তাকে বলল, হে আবূ সফ্ওয়ান। তুমি এ উপত্যকার অধিবাসীদের নেতা, তাই লোকেরা যখন দেখবে তুমি পেছনে রয়ে গেছ তখন তারাও তোমার সঙ্গে পেছনেই থেকে যাবে। এ বলে আবূ জাহ্ল তার সঙ্গে পীড়াপীড়ি করতে থাকলে সে বলল, তুমি যেহেতু আমাকে বাধ্য করে ফেলছ তাই আল্লাহর কসম! অবশ্যই আমি এমন একটি উষ্ট্র ক্রয় করব যা মক্কার মধ্যে সবচেয়ে ভাল। এরপর উমাইয়াহ (স্ত্রীকে) বলল, হে উম্মু সফ্ওয়ান! আমার সফরের ব্যবস্থা কর। স্ত্রী বলল, হে আবূ সফ্ওয়ান! তোমার মদিনাবাসী ভাই যা বলেছিলেন তা কি তুমি ভুলে গিয়েছ? সে বলল, না। আমি তাদের সঙ্গে মাত্র কিছু দূর যেতে চাই। রওয়ানা হওয়ার পর রাস্তায় যে মান্যিলেই উমাইয়াহ কিছুক্ষণ অবস্থান করেছে সেখানেই সে তার উট বেঁধে রেখেছে। সারা রাস্তায় সে এমন করল, শেষে বদর প্রান্তরে মহান আল্লাহ তাকে হত্যা করলেন। [৩৬৩২] (আধুনিক প্রকাশনীঃ ৩৬৫৯, ইসলামিক ফাউন্ডেশনঃ ৩৬৬২)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 2
			}
		}
	]
}