{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3983,
			"arabicnumber": 3983,
			"text": "‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আবূ মারসাদ, যুবায়র (রাঃ) ও আমাকে কোন স্থানে প্রেরণ করেছিলেন এবং আমরা সকলেই ছিলাম অশ্বারোহী। তিনি আমাদেরকে বললেন, তোমরা যাও। যেতে যেতে তোমরা ‘রাওযা খাখ’ নামক জায়গায় পৌঁছে সেখানে একজন স্ত্রীলোক দেখতে পাবে। তার কাছে মুশরিকদের প্রতি লিখিত হাতিব ইবনু আবূ বালতার একটি চিঠি আছে। (সেটা নিয়ে আসবে।) ‘আলী (রাঃ) বলেন, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর নির্দেশিত জায়গায় গিয়ে তাকে ধরে ফেললাম। সে তখন তার একটি উটের উপর চড়ে পথ অতিক্রম করছিল। আমরা তাকে বললাম, পত্রখানা আমাদের নিকট দিয়ে দাও। সে বলল, আমার নিকট কোন পত্র নেই। আমরা তখন তার উটটিকে বসিয়ে তার তল্লাশী করলাম। কিন্তু পত্রখানা বের করতে পারলাম না। আমরা বললাম, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম মিথ্যা বলেননি। তোমাকে চিঠিটি বের করতেই হবে। নতুবা আমরা তোমাকে উলঙ্গ করে ছাড়ব। যখন আমাদের শক্ত মনোভাব বুঝতে পারল তখন স্ত্রীলোকটি তার কোমরের পরিহিত বস্ত্রের গিঁটে কাপড়ের পুঁটুলির মধ্য থেকে চিঠিখানা বের করে দিল। আমরা তা নিয়ে রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হলাম। ‘উমার (রাঃ) বললেন, হে আল্লাহর রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম! সে তো আল্লাহ্ ও তাঁর রাসূল এবং মু’মিনদের সঙ্গে বিশ্বাসঘাতকতা করেছে। আপনি আমাকে অনুমতি দিন, আমি তার গর্দান উড়িয়ে দিই। তখন নবী [হাতিব ইবনু আবূ বালতা (রাঃ) কে ডেকে] বললেন, তোমাকে এ কাজ করতে কিসে বাধ্য করল? হাতিব (রাঃ) বললেন, আল্লাহর কসম! আল্লাহ্ ও তাঁর রাসূলের প্রতি আমি অবিশ্বাসী নই। বরং আমার মূল উদ্দেশ্য হল শত্রু দলের প্রতি কিছু অনুগ্রহ করা যাতে আল্লাহ্ এ উসিলায় আমার মাল এবং পরিবার ও পরিজনকে রক্ষা করেন। আর আপনার সাহাবীদের প্রত্যেকেরই কোন না কোন আত্মীয় সেখানে রয়েছে, যার দ্বারা আল্লাহ্ তার ধন-মাল ও পরিজনকে রক্ষা করছেন। তখন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, সে ঠিক কথাই বলেছে। সুতরাং তোমরা তার সম্পর্কে ভাল ব্যতীত আর কিছু বলো না। তখন ‘উমার (রাঃ) বললেন, সে তো আল্লাহ্, তাঁর রাসূল ও মু’মিনদের সঙ্গে বিশ্বাসঘাতকতা করেছে। সুতরাং আপনি আমাকে ছেড়ে দিন, আমি তাঁর গর্দার উড়িয়ে দেই। রাসূলূল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, সে কি বাদ্রী সাহাবী নয়? অবশ্যই বদর যুদ্ধে যোগদানকারীদেরকে বুঝে শুনেই আল্লাহ্ বলেছেনঃ ‘‘তোমাদের যা ইচ্ছে কর’’ তোমাদের জন্য জান্নাত অবধারিত অথবা (বর্ণনাকারীর সন্দেহ) আমি তোমাদেরকে ক্ষমা করে দিয়েছি। এতে ‘উমার (রাঃ)-এর দু’নয়ন অশ্রু সিক্ত হয়ে উঠল। তিনি বললেন, আল্লাহ্ ও তাঁর রাসূলই সবচেয়ে অধিক জ্ঞাত।[1] [৩০০৭] (আধুনিক প্রকাশনীঃ ৩৬৮৯, ইসলামিক ফাউন্ডেশনঃ ৩৬৯১)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 34
			}
		}
	]
}