{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4040,
			"arabicnumber": 4040,
			"text": "বারাআ বিন ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আবূ রাফি‘র হত্যার উদ্দেশে ‘আবদুল্লাহ ইবনু আতীক ও ‘আবদুল্লাহ ইবনু ‘উতবাহ্কে একদল লোকসহ প্রেরণ করেন। যেতে যেতে তারা দূর্গের কাছে গিয়ে পৌঁছলে ‘আবদুল্লাহ ইবনু আতীক (রাঃ) তাদেরকে বললেন, তোমরা অপেক্ষা কর। আমি যাই, দেখি কীভাবে সুযোগ করা যায়। ‘আবদুল্লাহ ইবনু আতীক (রাঃ) বলেন, দূর্গের ভিতর প্রবেশ করার জন্য আমি কৌশল করলাম। ইতোমধ্যে তারা একটি গাধা হারিয়ে ফেলল এবং একটি আলো নিয়ে এর খোঁজে বের হল। তিনি বলেন, আমাকে চিনে ফেলবে আমি এ আশংকা করছিলাম। তাই আমি আমার মাথা ও পা ঢেকে ফেললাম এবং এমনভাবে বসে রইলাম যেন আমি প্রাকৃতিক প্রয়োজনে মলমূত্র ত্যাগ করার জন্য বসেছি। এরপর দারোয়ান ডাক দিয়ে বলল, কেউ ভিতরে প্রবেশ করতে চাইলে এখনই দরজা বন্ধ করার আগে ভিতরে ঢুকে পড়ুন। আমি প্রবেশ করলাম এবং দূর্গের দরজার পার্শ্বে গাধা বাঁধার জায়গায় আত্মগোপন করে থাকলাম। আবূ রাফি‘র নিকট সবাই বসে রাতের খানা খেয়ে গল্প গুজব করল। এভাবে রাতের কিছু অংশ কেটে যাওয়ার পর সকলেই নিজ নিজ বাড়িতে চলে গেল। যখন হৈ চৈ থেমে গেল এবং কোন নড়াচড়া শুনতে পাচ্ছিলাম না তখন আমি বের হলাম। ‘আবদুল্লাহ ইবনু আতীক (রাঃ) বলেন, দূর্গের চাবি যে ছিদ্রপথে রাখা হয়েছিল তা আমি পূর্বেই দেখেছিলাম। তাই রক্ষিত স্থান থেকে চাবিটি নিয়ে আমি দূর্গের দরজা খুললাম। তিনি বলেন, আমি মনে মনে ভাবলাম, কাওমের লোকেরা যদি আমাকে দেখে নেয় তাহলে সহজেই আমি পালিয়ে যেতে পারব। এরপর দূর্গের ভিতরে তাদের যত ঘর ছিল সবগুলোর দরজা আমি বাইরে থেকে বন্ধ করে দিলাম। এরপর সিঁড়ি বেয়ে আবূ রাফি‘র কক্ষে উঠলাম। বাতি নিভিয়ে দেয়া হয়েছিল বলে ঘরটি ছিল খুবই অন্ধকার। লোকটি কোথায়, কিছুতেই আমি তা বুঝতে পারছিলাম না। সুতরাং আমি তাকে ডাকলাম, হে আবূ রাফি‘। সে বলল, কে ডাকছ? তিনি বলেন, আওয়াজটি লক্ষ্য করে আমি একটু এগিয়ে গেলাম এবং তাকে আঘাত করলাম। সে চীৎকার করে উঠল। এ আঘাতে কোন কাজই হয়নি। অতঃপর আবার আমি তার কাছে গেলাম, যেন আমি তাকে সাহায্য করব। আমি এবার স্বর বদল করে বললাম, হে আবূ রাফি‘! তোমার কী হয়েছে? সে বলল, কী আশ্চর্য ব্যাপার, তার মায়ের সর্বনাশ হোক, এই তো এক ব্যক্তি আমার ঘরে ঢুকে আমাকে তরবারি দ্বারা আঘাত করেছে। ‘আবদুল্লাহ্ ইবনু ‘আতীক বলেন, তাকে লক্ষ্য করে আবার আমি আঘাত করলাম এবারও কোন কাজ হল না। সে চীৎকার করলে তার পরিবারের সবাই জেগে উঠল। তারপর আবার আমি সাহায্যকারীর ভান করে আওয়াজ বদল করে তার দিকে এগিয়ে গেলাম। এ সময় সে পিঠের উপর চিৎ হয়ে শুয়ে ছিল। আমি তরবারির অগ্রভাগ তার পেটের উপর রেখে এমন জোরে চাপ দিলাম যে, আমি তার হাড়ের আওয়াজ শুনতে পেলাম। এরপর আমি কাঁপতে কাঁপতে সিঁড়ির নিকট এসে পৌঁছলাম। ইচ্ছে ছিল নেমে যাব। কিন্তু আছাড় খেয়ে পড়ে গেলাম এবং এতে আমার পা খানা ভেঙে গেল। সঙ্গে সঙ্গে (পাগড়ি দিয়ে) আমি তা বেঁধে ফেললাম এবং আস্তে আস্তে হেঁটে সাথীদের নিকট চলে এলাম। এরপর বললাম, তোমরা যাও এবং রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে সুসংবাদ দাও। আমি তার মৃত্যু সংবাদ না শুনে আসব না। প্রত্যুষে মৃত্যু ঘোষণাকারী প্রাচীরে উঠে বলল, আমি আবূ রাফি‘র মৃত্যু সংবাদ ঘোষণা করছি। ‘আবদুল্লাহ্ ইবনু আতীক (রাঃ) বলেন, এরপর আমি উঠে চলতে লাগলাম। এ সময় আমার কোন ব্যথাই ছিল না। আমার সাথীরা রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর নিকট পৌঁছার আগেই আমি তাদেরকে পেয়ে গেলাম এবং রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে তার মৃত্যুর সুসংবাদ দিলাম।[1] [৩০২২] (আধুনিক প্রকাশনীঃ ৩৭৩৮, ইসলামিক ফাউন্ডেশনঃ ৩৭৪২)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 87
			}
		}
	]
}