{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4043,
			"arabicnumber": 4043,
			"text": "বারাআ (রাঃ) হতে বর্ণিত। তিনি বলেন, উহূদ যুদ্ধের দিন আমরা মুখোমুখী অবতীর্ণ হলে নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম ‘আবদুল্লাহ [ইবনু যুবায়র (রাঃ)]-কে তীরন্দাজ বাহিনীর প্রধান নিযুক্ত করে তাদেরকে (নির্দিষ্ট এক স্থানে) মোতায়েন করলেন এবং বললেন, যদি তোমরা আমাদেরকে দেখ যে, আমরা তাদের উপর বিজয় লাভ করেছি, তাহলেও তোমরা এখান থেকে নড়বে না। আর যদি তোমরা তাদেরকে দেখ যে, তারা আমাদের উপর বিজয় লাভ করেছে, তবুও তোমরা এই স্থান ত্যাগ করে আমাদের সাহায্যের জন্য এগিয়ে আসবে না। এরপর আমরা তাদের সঙ্গে যুদ্ধ শুরু করলে তারা পালাতে আরম্ভ করল। এমনকি আমরা দেখতে পেলাম যে, মহিলারা দ্রুত দৌড়ে পর্বতে আশ্রয় নিচ্ছে। তারা পায়ের গোছা থেকে কাপড় টেনে তুলেছে, ফলে পায়ের অলঙ্কারগুলো পর্যন্ত বেরিয়ে পড়ছে। এ সময় তারা (তীরন্দাজরা) বলতে লাগলেন, গানীমাত-গানীমাত! তখন ‘আবদুল্লাহ (রাঃ) বললেন, তোমরা যাতে এ স্থান ত্যাগ না কর এ ব্যাপার নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমাকে নির্দেশ দিয়েছেন। তারা অগ্রাহ্য করল। যখন তারা অগ্রাহ্য করল, তখন তাদের মুখ ফিরিয়ে দেয়া হলো এবং তাদের সত্তর জন শাহীদ হলেন। আবূ সুফ্ইয়ান একটি উঁচু স্থানে উঠে বলল, কাওমের মধ্যে মুহাম্মাদ জীবিত আছে কি? নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, তোমরা তার কোন উত্তর দিও না। সে আবার বলল, কাওমের মধ্যে ইবনু আবূ কুহাফা জীবিত আছে কি? নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, তোমরা তার কোন জবাব দিও না। সে আবার বলল, কাওমের মধ্যে ইবনুল খাত্তাব বেঁচে আছে কি? তারপর সে বলল, এরা সকলেই নিহত হয়েছে। বেঁচে থাকলে নিশ্চয়ই জবাব দিত। এ সময় ‘উমার (রাঃ) নিজেকে সামলাতে না পেরে বললেন, হে আল্লাহর দুশমন, তুমি মিথ্যা কথা বলছ। যে জিনিসে তোমাকে অপমানিত করবে আল্লাহ তা বাকী রেখেছেন। আবূ সুফ্ইয়ান বলল, হুবালের জয়। তখন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম সাহাবীগণকে বললেন, তোমরা তার উত্তর দাও। তারা বললেন, আমরা কী বলব? তিনি বললেন, তোমরা বল, আল্লাহ সমুন্নত ও মহান। আবূ সুফ্ইয়ান বলল, আমাদের উয্যা আছে, তোমাদের উয্যা নেই। নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, তোমরা তার জবাব দাও। তারা বললেন, আমরা কী জবাব দেব? তিনি বললেন, বল- আল্লাহ আমাদের অভিভাবক, তোমাদের তো কোন অভিভাবক নেই। শেষে আবূ সুফ্ইয়ান বলল, আজ বদর যুদ্ধের বিনিময়ের দিন। যুদ্ধ কূপ থেকে পানি উঠানোর পাত্রের মতো (অর্থাৎ একবার এ হাতে আরেকবার ও হাতে) তোমরা নাক-কান কাটা কিছু লাশ দেখতে পাবে। আমি এরূপ করতে নির্দেশ দেইনি। অবশ্য তাতে আমি নাখোশও নই। [৩০৩৯] (আধুনিক প্রকাশনীঃ ৩৭৪১, ইসলামিক ফাউন্ডেশনঃ ৩৭৪৫)",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}