{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4072,
			"arabicnumber": 4072,
			"text": "জা‘ফার ইবনু ‘আমর ইবনু ‘উমাইয়াহ যামরী (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘উবাইদুল্লাহ ইবনু আদী ইবনু খিয়ার (রহ.)-এর সঙ্গে ভ্রমণে বের হলাম। আমরা যখন হিম্স-এ পৌঁছলাম তখন ‘উবাইদুল্লাহ (রহ.) আমাকে বললেন, ওয়াহ্শীর কাছে হামযাহ (রাঃ)-এর শাহাদাত অর্জনের ঘটনা সম্পর্কে জিজ্ঞেস করতে চাও কি? আমি বললাম, হ্যাঁ। ওয়াহ্শী তখন হিম্সে বসবাস করছিলেন। আমরা তার সম্পর্কে (লোকেদেরকে) জিজ্ঞেস করলাম। আমাদেরকে বলা হল, ঐ তো তিনি তার প্রাসাদের ছায়ায় (বসে আছেন) যেন পশমহীন মশক। বর্ণনাকারী বলেন, আমরা গিয়ে তার থেকে সামান্য কিছু দূরে থাকলাম এবং তাকে সালাম করলাম। তিনি আমাদের সালামের জবাব দিলেন। জা‘ফার (রহ.) বর্ণনা করেন, তখন ‘উবাইদুল্লাহ (রহ.) এমনভাবে পাগড়ি পরিহিত ছিলেন সে, ওয়াহ্শী তার দু’ চোখ এবং দু’ পা ব্যতীত আর কিছুই দেখতে পাচ্ছিলেন না। এ অবস্থায় ‘উবাইদুল্লাহ (রহ.) ওয়াহ্শীকে বললেন, হে ওয়াহ্শী! আপনি আমাকে চিনেন কি? বর্ণনাকারী বলেন, তিনি তখন তাঁর দিকে তাকালেন, অতঃপর বললেন, না, আল্লাহর কসম! আমি আপনাকে চিনি না। তবে এটুকু জানি যে, আদী ইবনু খিয়ার উম্মু কিতাল বিনতু আবুল ঈস নাম্নী এক মহিলাকে বিয়ে করেছিলেন। মক্কা্য় তার একটি সন্তান জন্মিলে আমি তার ধাত্রী খোঁজ করছিলাম, তখন ঐ বাচ্চাকে নিয়ে তার মায়ের সঙ্গে গিয়ে ধাত্রীমাতার কাছে তাকে সোপর্দ করলাম। সে বাচ্চার পা দু’টির মতো আপনার পা দু’টি দেখতে পাচ্ছি। বর্ণনাকারী বলেন, তখন ‘উবাইদুল্লাহ (রহ.) তার মুখের আবরণ সরিয়ে তাকে জিজ্ঞেস করলেন, হামযাহ (রাঃ)-এর শাহাদাত সম্পর্কে আমাদেরকে বলবেন কি? তিনি বললেন, হ্যাঁ। বদর যুদ্ধে হামযাহ (রাঃ) তুআইমা ইবনু ‘আদী ইবনু খিয়ারকে হত্যা করেছিলেন। তাই আমার মনিব জুবায়র ইবনু মুতঈম আমাকে বললেন, তুমি যদি আমার চাচার বদলা হিসেবে হামযাকে হত্যা করতে পার তাহলে তুমি মুক্ত। রাবী বলেন, যে বছর উহূদ পর্বত সংলগ্ন আইনাইন পর্বতের উপত্যকায় যুদ্ধ হয়েছিল সে যুদ্ধে আমি সবার সঙ্গে বেরিয়ে যাই। এরপর লড়াইয়ের জন্য সকলে সারিবদ্ধ হলে সিবা নামক এক ব্যক্তি ময়দানে এসে বলল, দ্বনদ্ব যুদ্ধের জন্য কেউ প্রস্তুত আছ কি? ওয়াহ্শী বলেন, তখন হামযাহ ইবনু ‘আবদুল মুত্তালিব (রাঃ) তার সামনে গিয়ে বললেন, ওহে মেয়েদের খতনাকারিণী উম্মু আনমারের পোলা সিবা! তুমি কি আল্লাহ ও তাঁর রাসূলের সঙ্গে দুশমনী করছ? বর্ণনাকারী বলেন, এরপর তিনি তার উপর প্রচন্ড আঘাত করলেন, যার ফলে সে বিগত দিনের মতো গত হয়ে গেল। ওয়াহ্শী বলেন, আমি হামযাহ (রাঃ)-কে কতল করার উদ্দেশে একটি পাথরের নিচে আত্মগোপন করে ওত পেতে বসেছিলাম। যখন তিনি আমার নিকটবর্তী হলেন আমি আমার বর্শা এমন জোরে নিক্ষেপ করলাম যে, তার মূত্রথলি ভেদ করে নিতম্বের মাঝখান দিয়ে তা বেরিয়ে গেল। ওয়াহ্শী বলেন, এটাই হল তাঁর শাহাদাতের মূল ঘটনা। এরপর সবাই ফিরে এলে আমিও তাদের সঙ্গে ফিরে এসে মক্কা্য় অবস্থান করতে লাগলাম। এরপর মক্কা্য় ইসলাম প্রসারিত হলে আমি তায়েফ চলে গেলাম। কিছুদিনের মধ্যে তায়েফবাসীগণ রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে দূত প্রেরণের ব্যবস্থা করলে আমাকে বলা হল যে, তিনি দূতদের প্রতি উত্তেজিত হন না। তাই আমি তাদের সঙ্গে রওয়ানা হলাম এবং রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সামনে গিয়ে হাযির হলাম। তিনি আমাকে দেখে বললেন, তুমিই কি ওয়াহ্শী? আমি বললাম, হ্যাঁ। তিনি বললেন, তুমিই কি হামযাকে কতল করেছিলে? আমি বললাম, আপনার কাছে যে সংবাদ পৌঁছেছে ব্যাপার তাই। তিনি বললেন, আমার সামনে থেকে তোমার চেহারা কি সরিয়ে রাখতে পার? ওয়াহ্শী বলেন, তখন আমি চলে আসলাম। রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর ইন্তিকালের পর মুসাইলামাতুল কায্যাব[1] আবির্ভূত হলে আমি বললাম, আমি অবশ্যই মুসাইলামার বিরুদ্ধে যুদ্ধে অবতীর্ণ হব এবং তাকে হত্যা করে হামযাহ (রাঃ)-কে হত্যা করার ক্ষতিপূরণ করব। ওয়াহ্শী বলেন, এক সময় আমি দেখলাম যে, হালকা কালো বর্ণের উটের মত উষ্কখুষ্ক চুলবিশিষ্ট এক ব্যক্তি একটি ভগ্ন দেয়ালের আড়ালে দাঁড়িয়ে আছে। তখন সঙ্গে সঙ্গে আমি আমার বর্শা দ্বারা তার উপর আঘাত করলাম এবং তার বুকের উপর এমনভাবে বসিয়ে দিলাম যে, তা তার দু’ কাঁধের মাঝ দিয়ে বেরিয়ে গেল। এরপর আনসারী এক সাহাবী এসে তার উপর ঝাঁপিয়ে পড়লেন এবং তলোয়ার দিয়ে তার মাথার খুলিতে প্রচন্ড আঘাত করলেন। ‘আবদুল্লাহ ইবনু ফাযল (রহ.) বর্ণনা করেছেন যে, সুলাইমান ইবনু ইয়াসির (রহ.) আমাকে সংবাদ দিয়েছেন যে, তিনি ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ)-কে বলতে শুনেছেন যে, ঘরের ছাদে একটি বালিকা বলছিল, হায়, হায়, আমীরুল মু’মিনীন (মুসাইলামাহ)-কে এক কৃষ্ণকায় গোলাম হত্যা করল। (আধুনিক প্রকাশনীঃ ৩৭৬৭, ইসলামিক ফাউন্ডেশনঃ ৩৭৭০)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 117
			}
		}
	]
}