{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4093,
			"arabicnumber": 4093,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, (মক্কার কাফিরদের) অত্যাচার চরম আকার ধারণ করলে আবূ বাকর (রাঃ) (মক্কা ছেড়ে) বেরিয়ে যাওয়ার জন্য নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে অনুমতি চাইলে তিনি তাঁকে বললেন, অবস্থান কর। তখন তিনি বললেন, হে আল্লাহর রাসূল! আপনি কি কামনা করেন যে, আপনাকে অনুমতি দেয়া হোক? তিনি বললেন, আমি তো তাই আশা করি। ‘আয়িশাহ (রাঃ) বলেন, আবূ বাকর (রাঃ) নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর জন্য অপেক্ষা করলেন। একদিন যুহরের সময় রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম এসে তাঁকে ডেকে বললেন, তোমার কাছে যারা আছে তাদেরকে সরিয়ে দাও। তখন আবূ বাকর (রাঃ) বললেন, এরা তো আমার দু’ মেয়ে। তখন রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, তুমি কি জান আমাকে চলে যাওয়ার অনুমতি দেয়া হয়েছে? আবূ বাকর (রাঃ) বললেন, হে আল্লাহর রাসূল! আমি কি আপনার সঙ্গে যেতে পারব? নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, হ্যাঁ আমার সঙ্গে যেতে পারবে। আবূ বাকর (রাঃ) বললেন, হে আল্লাহর রাসূল! আমার কাছে দু’টি উটনী আছে। এখান থেকে বের হয়ে যাওয়ার জন্যই এ দু’টিকে আমি প্রস্তুত করে রেখেছি। এরপর তিনি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে দু’টি উটের একটি উট প্রদান করলেন। এ উটটি ছিল কান-নাক কাটা। তাঁরা উভয়ে সওয়ার হয়ে রওয়ানা হলেন এবং সওর পর্বতের গুহায় পৌঁছে তাতে লুকিয়ে থাকলেন। ‘আয়িশাহ (রাঃ)-এর বৈমাত্রের ভাই ‘আমির ইবনু ফুহাইরাহ ছিলেন ‘আবদুল্লাহ ইবনু তুফাইল ইবনু সাখ্বারার গোলাম। আবূ বাকর (রাঃ)-এর একটি দুধের গাভী ছিল। তিনি (আমির ইবনু ফুহাইরা) সেটিকে সন্ধ্যাবেলা চরাতে নিয়ে গিয়ে রাতের অন্ধকারে তাদের দু’জনের কাছে নিয়ে যেতেন এবং ভোরবেলা তাঁদের (কাফিরের) কাছে নিয়ে যেতেন। কোন রাখালই এ বিষয়টি বুঝতে পারত না। তাঁরা দু’জন গারে সাওর থেকে বের হলে তিনিও তাদের সঙ্গে রওয়ানা হলেন। তাঁরা মদিনা পৌঁছে যান। ‘আমির ইবনু ফুহাইরাহ পরবর্তীকালে বি‘রে মাউনার দুর্ঘটনায় শাহাদাত লাভ করেন। (অন্য সানাদে) আবূ উসামাহ (রহ.) হতে বর্ণিত। তিনি বলেন, হিশাম ইবনু ‘উরওয়াহ (রহ.) বলেন, আমার পিতা আমাকে বলেছেন, বি‘রে মাউনা গমনকারীরা শাহীদ হলে ‘আমর ইবনু উমাইয়াহ যামরী বন্দী হলেন। তাঁকে আমির ইবনু তুফায়ল এক নিহত ব্যক্তির লাশ দেখিয়ে জিজ্ঞেস করল, এ ব্যক্তি কে? ‘আমর ইবনু উমাইয়াহ বললেন, ইনি হচ্ছেন ‘আমির ইবনু ফুহাইরাহ। তখন সে (আমির ইবনু তুফায়ল) বলল, আমি দেখলাম, নিহত হওয়ার পর তার লাশ আকাশে উঠিয়ে নেয়া হয়েছে। এমনকি আমি তার লাশ আসমান যমীনের মাঝে দেখেছি। এরপর তা (যমীনের উপর) রেখে দেয়া হল। এ সংবাদ নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে পৌঁছলে তিনি সাহাবীগণকে তাদের শাহাদাতের সংবাদ জানিয়ে বললেন, তোমাদের সাথীদেরকে হত্যা করা হয়েছে। মৃত্যুর পূর্বে তারা তাদের প্রতিপালকের কাছে প্রার্থনা করে বলেছিলেন, হে আমাদের প্রতিপালক! আমরা আপনার প্রতি সন্তুষ্ট এবং আপনিও আমাদের প্রতি সন্তুষ্ট- এ সংবাদ আমাদের ভাইদের কাছে পৌঁছে দিন। তাই মহান আল্লাহ তাঁদের এ সংবাদ মুসলিমদের কাছে পৌঁছিয়ে দিলেন। ঐ দিনের নিহতদের মধ্যে ‘উরওয়াহ ইবনু আসমা ইবনু সাল্লাত (রাঃ)-ও ছিলেন। তাই এ নামেই ‘উরওয়াহ (ইবনু যুবায়রের)-এর নামকরণ করা হয়েছে। আর মুনযির ইবনু ‘আমর (রাঃ)-ও এ দিন শাহাদাত লাভ করেছিলেন। তাই এ নামেই মুনযির-এর নামকরণ করা হয়েছে। [৪৭৬] (আধুনিক প্রকাশনীঃ ৩৭৮৭, ইসলামিক ফাউন্ডেশনঃ ৩৭৯০)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 137
			}
		}
	]
}