{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4101,
			"arabicnumber": 4101,
			"text": "আইমান (রহ.) হতে বর্ণিত। তিনি বলেন, আমি জাবির (রাঃ)-এর নিকট গেলে তিনি বললেন, খন্দকের দিন আমরা পরিখা খনন করছিলাম। এ সময় একখন্ড কঠিন পাথর বেরিয়ে আসলে তারা নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে এসে বললেন, খন্দকের ভিতর একটি শক্ত পাথর বেরিয়েছে। তখন তিনি বললেন, আমি নিজে খন্দকে নামব। অতঃপর তিনি দাঁড়ালেন। আর তাঁর পেটে একটি পাথর বাঁধা ছিল। আর আমরাও তিন দিন ধরে অনাহারী ছিলাম। কোন কিছুর স্বাদই চাখিনি। তখন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম একখানা কোদাল হাতে নিয়ে পাথরটিতে আঘাত করলেন। ফলে তৎক্ষণাৎ তা চূর্ণ হয়ে বালুকারাশিতে পরিণত হল। তখন আমি বললাম, হে আল্লাহর রাসূল! আমাকে বাড়ি যাওয়ার জন্য অনুমতি দিন। (বাড়ি পৌঁছে) আমি আমার স্ত্রীকে বললাম, নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর মধ্যে আমি এমন কিছু দেখলাম যা আমি সহ্য করতে পারছি না। তোমার নিকট কোন খাবার আছে কি? সে বলল, আমার কাছে কিছু যব ও একটি বাকরীর বাচ্চা আছে। তখন বাকরীর বাচ্চাটি আমি যবহ করলাম এবং সে যব পিষে দিল। এরপর গোশত ডেকচিতে দিয়ে আমি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে আসলাম। এ সময় আটা খামির হচ্ছিল এবং ডেকচি চুলার উপর ছিল ও গোশত প্রায় রান্না হয়ে আসছিল। তখন আমি বললাম, হে আল্লাহর রাসূল! আমার (বাড়ীতে) সামান্য কিছু খাবার আছে। আপনি একজন বা দু’জন সঙ্গে নিয়ে চলুন। তিনি বললেন, কী পরিমাণ খাবার আছে? আমি তাঁর কাছে সব খুলে বললাম। তিনি বললেন, এ-তো অনেক বেশ ভাল। তিনি বললেন, তোমার স্ত্রীকে গিয়ে বল, আমি না আসা পর্যন্ত উনান থেকে ডেকচি ও রুটি যেন না নামায়। এরপর তিনি বললেন, উঠ! মুহাজির ও আনসারগণ উঠলেন। জাবির (রাঃ) তার স্ত্রীর কাছে গিয়ে বললেন, তোমার সর্বনাশ হোক! নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তো মুহাজির, আনসার আর তাঁদের সাথীদের নিয়ে চলে এসেছেন। তিনি (জাবিরের স্ত্রী বললেন, তিনি কি আপনাকে জিজ্ঞেস করেছিলেন? আমি বললাম, হ্যাঁ। এরপর নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম (উপস্থিত হয়ে) বললেন, তোমরা সকলেই প্রবেশ কর কিন্তু ভিড় করো না। এ ব’লে তিনি রুটি টুকরো করে এর উপর গোশত দিয়ে সাহাবীগণের মাঝে বিতরণ করতে শুরু করলেন। তিনি ডেকচি এবং উনান ঢেকে রেখেছিলেন। এমনি করে তিনি রুটি টুকরো করে হাত ভরে বিতরণ করতে লাগলেন। এতে সকলে পেট পুরে খাওয়ার পরেও কিছু বাকী রয়ে গেল। তিনি (জাবিরের স্ত্রীকে) বললেন, এ তুমি খাও এবং অন্যকে হাদিয়া দাও। কেননা লোকদেরও ক্ষুধা পেয়েছে। [৩০৭০] (আধুনিক প্রকাশনীঃ ৩৭৯৫, ইসলামিক ফাউন্ডেশনঃ ৩৭৯৮)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 145
			}
		}
	]
}