{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4141,
			"arabicnumber": 4141,
			"text": "وَالأَفَكِ بِمَنْزِلَةِ النِّجْسِ وَالنَّجَسِ يُقَالُ إِفْكُهُمْ وَأَفْكُهُمْ وَأَفَكُهُمْ فَمَنْ قَالَ أَفَكَهُمْ يَقُوْلُ صَرَفَهُمْ عَنْ الإِيْمَانِ وَكَذَّبَهُمْ كَمَا قَالَ (يُؤْفَكُ عَنْهُ مَنْ أُفِكَ) يُصْرَفُ عَنْهُ مَنْ صُرِفَ [ইমাম বুখারী (রহ.) বলেন] أُفِكَশব্দটিنحبس ও نَحبس এর মতো اِفْكُ ও اَفَكُ উভয়ভাবেই ব্যবহৃত হয়। তাই আরবীয় লোকেরা বলেন, إِفْكُهُمْ-أَفْكُهُمْ ও أَفَكُهُمْ। যিনি أَفَكُهُمْ পড়েছেন, তিনি বলেন যে, এর অর্থ তাদেরকে তিনি ঈমান হতে ফিরিয়ে রেখেছিলেন এবং তাদেরকে মিথ্যুক আখ্যায়িত করেছিলেন। ৪১৪১. ‘উরওয়াহ ইবনু যুবায়র, সা‘ঈদ ইবনু মুসায়্যিব, ‘আলক্বামাহ ইবনু ওয়াক্কাস ও ‘উবাইদুল্লাহ ইবনু ‘আবদুল্লাহ ইবনু ‘উতবাহ ইবনু মাস‘ঊদ (রাঃ) সূত্রে নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী ‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, যখন অপবাদ রটনাকারীগণ তাঁর প্রতি অপবাদ রটিয়েছিল। রাবী যুহরী (রহ.) বলেন, তারা প্রত্যেকেই হাদীসটির অংশবিশেষ আমার কাছে বর্ণনা করেছেন। হাদীসটি স্মরণ রাখা ও সঠিকভাবে বর্ণনা করার ব্যাপারে তাদের কেউ কেউ একে অন্যের চেয়ে অধিকতর অগ্রগণ্য ও নির্ভরযোগ্য। ‘আয়িশাহ (রাঃ) সম্পর্কে তারা আমার কাছে যা বর্ণনা করেছেন আমি তাদের প্রত্যেকের কথাই ঠিকঠাকভাবে স্মরণ রেখেছি। তাদের একজনের বর্ণিত হাদীসের অংশ অপরের বর্ণিত হাদীসের সত্যতা প্রমাণ করে। যদিও তাদের একজন অন্যের চেয়ে অধিক স্মৃতিশক্তির অধিকারী। বর্ণনাকারীগণ বলেন, ‘আয়িশাহ (রাঃ) বলেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যখন সফরে যেতে ইচ্ছে করতেন তখন তিনি তাঁর স্ত্রীগণের (নির্বাচনের জন্য) কোরা ব্যবহার করতেন। এতে যার নাম উঠত তাকেই তিনি সঙ্গে নিয়ে সফরে যেতেন। ‘আয়িশাহ (রাঃ) বলেন, এমনি এক যুদ্ধে তিনি আমাদের মাঝে কোরা ব্যবহার করেন, এতে আমার নাম উঠে আসে। তাই আমিই রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সঙ্গে সফরে গেলাম। এ ঘটনাটি পর্দার হুকুম নাযিলের পর ঘটেছিল। তখন আমাকে হাওদাসহ সাওয়ারীতে উঠানো ও নামানো হত। এমনিভাবে আমরা চলতে থাকলাম। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যখন এ যুদ্ধ থেকে নিষ্ক্রান্ত হলেন, তখন তিনি (গৃহাভিমুখে) প্রত্যাবর্তন করলেন। ফেরার পথে আমরা মদিনার নিকটবর্তী হলে তিনি একদিন রাতের বেলা রওয়ানা হওয়ার জন্য আদেশ করলেন। রওয়ানা হওয়ার ঘোষণা দেয়া হলে আমি উঠলাম এবং (প্রকৃতির ডাকে সাড়া দেয়ার জন্য) পায়ে হেঁটে সেনাছাউনী পেরিয়ে (সামনে) গেলাম। অতঃপর প্রয়োজন সেরে আমি আমার সাওয়ারীর কাছে ফিরে এসে বুকে হাত দিয়ে দেখলাম যে, (ইয়ামানের অন্তর্গত) যিফার শহরের পুতি দ্বারা তৈরি করা আমার গলার হারটি ছিঁড়ে কোথায় পড়ে গিয়েছে। তাই আমি ফিরে গিয়ে আমার হারটি খোঁজ করতে লাগলাম। হার খুঁজতে খুঁজতে আমার আসতে দেরী হয়ে যায়। ‘আয়িশাহ (রাঃ) বলেন, যে সমস্ত লোক উটের পিঠে আমাকে উঠিয়ে দিতেন তারা এসে আমার হাওদা উঠিয়ে তা আমার উটের পিঠে তুলে দিলেন, যার উপর আমি আরোহণ করতাম। তারা ভেবেছিলেন, আমি ওর মধ্যেই আছি, কারণ খাদ্যাভাবে মহিলারা তখন খুবই হালকা হয়ে গিয়েছিল এবং তাদের দেহ গোশতবহুল ছিল না। তাঁরা খুবই স্বল্প পরিমাণ খানা খেতে পেত। তাই তারা যখন হাওদা উঠিয়ে উপরে রাখেন তখন তারা হালকা হাওদাটিকে কোন প্রকার অস্বাভাবিক মনে করেননি। অধিকন্তু আমি ছিলাম একজন অল্প বয়স্কা কিশোরী। এরপর তারা উট হাঁকিয়ে নিয়ে চলে যায়। সৈন্যদল চলে যাওয়ার পর আমি আমার হারটি খুঁজে পাই এবং নিজ জায়গায় ফিরে এসে দেখি তাঁদের (সৈন্যদের) কোন আহবানকারী এবং কোন জওয়াব দাতা সেখানে নেই। তখন আমি আগে যেখানে ছিলাম সেখানে বসে রইলাম। ভাবলাম, তাঁরা আমাকে দেখতে না পেয়ে অবশ্যই আমার কাছে ফিরে আসবে। ঐ স্থানে বসে থাকা অবস্থায় ঘুম চেপে ধরলে আমি ঘুমিয়ে পড়লাম। বানূ সুলামী গোত্রের যাকওয়ান শাখার সাফওয়ান ইবনু মুআত্তাল (রাঃ) [যাকে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম ফেলে যাওয়া আসবাবপত্র সংগ্রহের জন্য পশ্চাতে থাকার নির্দেশ দিয়েছিলেন] সৈন্যদল চলে যাওয়ার পর সেখানে ছিলেন। তিনি সকালে আমার অবস্থানস্থলের কাছে এসে একজন ঘুমন্ত মানুষ দেখে আমার দিকে তাকিয়ে আমাকে চিনে ফেললেন। পর্দার বিধান অবতীর্ণ হওয়ার পূর্বে তিনি আমাকে দেখেছিলেন। তিনি আমাকে চিনতে পেরে ‘ইন্না লিল্লাহি ওয়াইন্না ইলাইহি রাযিউন’ পড়লে আমি তা শুনে জেগে উঠলাম এবং চাদর টেনে আমার চেহারা ঢেকে ফেললাম। আল্লাহর কসম! আমি কোন কথা বলিনি এবং তাঁর থেকে ইন্না লিল্লাহ........ পাঠ ব্যতীত অন্য কোন কথাই শুনতে পাইনি। এরপর তিনি সওয়ারী থেকে নামলেন এবং সওয়ারীকে বসিয়ে তার সামনের পা নিচু করে দিলে আমি গিয়ে তাতে উঠে পড়লাম। পরে তিনি আমাকে সহ সওয়ারীকে টেনে আগে আগে চললেন, অতঃপর ঠিক দুপুরে প্রচন্ড গরমের সময় আমরা গিয়ে সেনাদলের সঙ্গে মিলিত হলাম। সে সময় তাঁরা একটি জায়গায় অবতরণ করছিলেন। ‘আয়িশাহ (রাঃ) বলেন, এরপর যাদের ধ্বংস হওয়ার ছিল তারা (আমার উপর অপবাদ দিয়ে) ধ্বংস হয়ে গেল। তাদের মধ্যে এ অপবাদ দেয়ার ব্যাপারে যে প্রধান ভূমিকা নিয়েছিল সে হচ্ছে ‘আবদুল্লাহ ইবনু উবাই ইবনু সুলূল। বর্ণনাকারী ‘উরওয়াহ (রাঃ) বলেন, আমি জানতে পেরেছি যে, তার (‘আবদুল্লাহ ইবনু উবাই ইবনু সুলূল) সামনে অপবাদের কথাগুলো প্রচার করা হত এবং আলোচনা করা হত আর অমনি সে এগুলোকে বিশ্বাস করত, খুব ভাল করে শুনত আর শোনা কথার ভিত্তিতেই ব্যাপারটিকে প্রমাণ করার চেষ্টা করত। ‘উরওয়াহ (রাঃ) আরো বর্ণনা করেছেন যে, অপবাদ আরোপকারী ব্যক্তিদের মধ্যে হাস্সান ইবনু সাবিত, মিসতাহ ইবনু উসাসা এবং হামনা বিনত জাহাশ (রাঃ) ব্যতীত আর কারো নাম উল্লেখ করা হয়নি। তারা কয়েকজন লোকের একটি দল ছিল, এটুকু ব্যতীত তাদের ব্যাপারে আমার আর কিছু জানা নেই। যেমন (আল-কুরআনে) মহান আল্লাহ তা‘আলা বলেছেন। এ ব্যাপারে যে প্রধান ভূমিকা গ্রহণ করেছিল তাকে ‘আবদুল্লাহ ইবনু উবাই বিন সুলূল বলে ডাকা হয়ে থাকে। বর্ণনাকারী ‘উরওয়াহ (রাঃ) বলেন, ‘আয়িশাহ (রাঃ) এ ব্যাপারে হাস্সান ইবনু সাবিত (রাঃ)-কে গালমন্দ করাকে পছন্দ করতেন না। তিনি বলতেন, হাস্সান ইবনু সাবিত (রাঃ) তো সেই লোক যিনি তার এক কবিতায় বলেছেন, আমার মান সম্মান এবং আমার বাপ দাদা মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর মান সম্মান রক্ষায় নিবেদিত। ‘আয়িশাহ (রাঃ) বলেন, অতঃপর আমরা মাদ্বীনায় আসলাম। মদিনা্য় এসে এক মাস পর্যন্ত আমি অসুস্থ থাকলাম। এদিকে অপবাদ রটনাকারীদের কথা নিয়ে লোকেদের মধ্যে আলোচনা ও চর্চা হতে থাকল। কিন্তু এগুলোর কিছুই আমি জানি না। তবে আমি সন্দেহ করছিলাম এবং তা আরো দৃঢ় হচ্ছিল আমার এ অসুখের সময়। কেননা এর আগে আমি রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম থেকে যে রকম স্নেহ-ভালবাসা পেতাম আমার এ অসুখের সময় তা আমি পাচ্ছিলাম না। তিনি আমার কাছে এসে সালাম করে কেবল ‘‘তুমি কেমন আছ’’ জিজ্ঞেস করে চলে যেতেন। তাঁর এ আচরণই আমার মনে ভীষণ সন্দেহ জাগিয়ে তোলে। তবে কিছুটা সুস্থ হয়ে বাইরে বের হওয়ার আগে পর্যন্ত এ জঘন্য অপবাদের ব্যাপারে আমি কিছুই জানতাম না। উম্মু মিসতাহ (রাঃ) (মিসতাহর মা) একদা আমার সঙ্গে পায়খানার দিকে বের হন। আর প্রকৃতির ডাকে আমাদের বের হওয়ার অবস্থা এই ছিল যে, এক রাতে বের হলে আমরা আবার পরের রাতে বের হতাম। এটা ছিল আমাদের ঘরের পার্শ্বে পায়খানা তৈরি করার আগের ঘটনা। আমাদের অবস্থা প্রাচীন আরবের লোকদের অবস্থার মতো ছিল। তাদের মতো আমরাও পায়খানা করার জন্য ঝোপঝাড়ে চলে যেতাম। এমনকি (অভ্যাস না থাকায়) বাড়ির পার্শ্বে পায়খানা তৈরি করলে আমরা খুব কষ্ট পেতাম। ‘আয়িশাহ (রাঃ) বলেন, একদা আমি এবং উম্মু মিসতাহ ‘‘যিনি ছিলেন আবূ রূহম ইবনু মুত্তালিব ইবনু ‘আবদে মুনাফির কন্যা, যার মা সাখার ইবনু ‘আমির-এর কন্যা ও আবূ বাকর সিদ্দীকের খালা এবং মিসতাহ ইবনু উসাসা ইবনু আববাদ ইবনু মুত্তালিব যার পুত্র’’ একত্রে বের হলাম। আমরা আমাদের কাজ থেকে নিস্ক্রান্ত হয়ে বাড়ি ফেরার পথে উম্মু মিসতাহ তার কাপড়ে জড়িয়ে হোঁচট খেয়ে পড়ে গিয়ে বললেন, মিসতাহ ধ্বংস হোক। আমি তাকে বললাম, আপনি খুব খারাপ কথা বলছেন। আপনি কি বদর যুদ্ধে যোগদানকারী ব্যক্তিকে গালি দিচ্ছেন? তিনি আমাকে বললেন, ওগো অবলা, সে তোমার সম্বন্ধে কী কথা বলে বেড়াচ্ছে তুমি তো তা শোননি। ‘আয়িশাহ (রাঃ) বলেন, আমি তাঁকে জিজ্ঞেস করলাম, সে আমার সম্পর্কে কী বলছে? তখন তিনি অপবাদ রটনাকারীদের কথাবার্তা সম্পর্কে আমাকে জানালেন। ‘আয়িশাহ (রাঃ) বর্ণনা করেন, এরপর আমার পুরানো রোগ আরো বেড়ে গেল। আমি বাড়ি ফেরার পর রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমার কাছে আসলেন এবং সালাম দিয়ে জিজ্ঞেস করলেন, তুমি কেমন আছ? ‘আয়িশাহ (রাঃ) বলেন, আমি আমার পিতা-মাতার কাছে গিয়ে বিষয়টি সম্পর্কে সঠিক খবর জানতে চাচ্ছিলাম, তাই আমি রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে বললাম, আপনি কি আমাকে আমার পিতা-মাতার কাছে যাওয়ার জন্য অনুমতি দেবেন? ‘আয়িশাহ (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমাকে অনুমতি দিলেন। তখন আমি আমার আম্মাকে বললাম, আম্মাজান, লোকজন কী আলোচনা করছে? তিনি বললেন, বেটী এ ব্যাপারটিকে হালকা করে ফেল। আল্লাহর কসম! সতীন আছে এমন স্বামীর সোহাগ লাভে ধন্যা সুন্দরী রমণীকে তাঁর সতীনরা বদনাম করবে না, এমন খুব কমই হয়। ‘আয়িশাহ (রাঃ) বলেন, আমি আশ্চর্য হয়ে বললাম, সুবহানাল্লাহ। লোকজন কি এমন গুজবই রটিয়েছে। ‘আয়িশাহ (রাঃ) বর্ণনা করেন, সারারাত আমি কাঁদলাম। কাঁদতে কাঁদতে সকাল হয়ে গেল। এর মধ্যে আমার চোখের পানিও বন্ধ হল না এবং আমি ঘুমাতেও পারলাম না। এরপর ভোরবেলাও আমি কাঁদছিলাম। তিনি আরো বলেন যে, এ সময় ওয়াহী নাযিল হতে দেরি হওয়ায় রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তার স্ত্রীর (আমার) বিচ্ছেদের বিষয়টি নিয়ে পরামর্শ ও আলোচনা করার নিমিত্তে ‘আলী ইবনু আবূ তালিব এবং উসামাহ ইবনু যায়দ (রাঃ)-কে ডেকে পাঠালেন। তিনি [‘আয়িশাহ (রাঃ)] বলেন, উসামাহ (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর স্ত্রীদের পবিত্রতা এবং তাদের প্রতি [নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর] ভালবাসার কারণে বললেন, তাঁরা আপনার স্ত্রী, তাদের সম্পর্কে আমি ভাল ব্যতীত আর কিছুই জানি না। আর ‘আলী (রাঃ) বললেন, হে আল্লাহর রাসূল! আল্লাহ তো আপনার জন্য সংকীর্ণতা রাখেননি। তিনি ব্যতীত আরো বহু মহিলা আছে। অবশ্য আপনি এ ব্যাপারে দাসী [বারীরাহ (রাঃ)]-কে জিজ্ঞেস করুন। সে আপনার কাছে সত্য কথাই বলবে। ‘আয়িশাহ (রাঃ) বলেন, তখন রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বারীরাহ (রাঃ)-কে ডেকে বললেন, হে বারীরাহ! তুমি তাঁর মধ্যে কোন সন্দেহপূর্ণ আচরণ দেখেছ কি? বারীরাহ (রাঃ) তাঁকে বললেন, সে আল্লাহর শপথ যিনি আপনাকে সত্য বিধানসহ পাঠিয়েছেন, আমি তার মধ্যে কখনো এমন কিছু দেখিনি যার দ্বারা তাঁকে দোষী বলা যায়। তবে তাঁর সম্পর্কে কেবল এটুকু বলা যায় যে, তিনি হলেন অল্প বয়স্কা কিশোরী, রুটি তৈরী করার জন্য আটা খামির করে রেখে ঘুমিয়ে পড়েন। আর বাকরী এসে অমনি তা খেয়ে ফেলে। তিনি [‘আয়িশাহ (রাঃ)] বলেন, সেদিন রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম সঙ্গে সঙ্গে উঠে গিয়ে মিম্বরে বসে ‘আবদুল্লাহ ইবনু উবাই-এর ক্ষতি থেকে রক্ষার আহবান জানিয়ে বললেন, হে মুসলিম সম্প্রদায়! যে আমার স্ত্রীর ব্যাপারে অপবাদ রটিয়ে আমাকে কষ্ট দিয়েছে তার এ অপবাদ থেকে আমাকে কে মুক্ত করবে? আল্লাহর কসম! আমি আমার স্ত্রী সম্পর্কে ভাল ব্যতীত আর কিছুই জানি না। আর তাঁরা এক ব্যক্তির (সাফওয়ান ইবনু মু‘আত্তাল) নাম উল্লেখ করছে যার ব্যাপারেও আমি ভাল ব্যতীত কিছু জানি না। সে তো আমার সঙ্গেই আমার ঘরে যায়। ‘আয়িশাহ (রাঃ) বলেন, বানী ‘আবদুল আশহাল গোত্রের সা‘দ (ইবনু মুআয) (রাঃ) উঠে বললেন, হে আল্লাহর রাসূল! আমি আপনাকে এ অপবাদ থেকে মুক্তি দেব। সে যদি আউস গোত্রের লোক হয় তাহলে তার শিরচ্ছেদ করব। আর যদি সে আমাদের ভাই খাযরাজের লোক হয় তাহলে তার ব্যাপারে আপনি যা বলবেন তাই করব। ‘আয়িশাহ (রাঃ) বলেন, এ সময় হাস্সান ইবনু সাবিত (রাঃ)-এর মায়ের চাচাতো ভাই খাযরাজ গোত্রের নেতা সা‘ঈদ ইবনু উবাদা (রাঃ) দাঁড়িয়ে এ কথার প্রতিবাদ করলেন। ‘আয়িশাহ (রাঃ) বলেনঃ এ ঘটনার আগে তিনি একজন সৎ ও নেককার লোক ছিলেন। গোত্রীয় অহঙ্কারে উত্তেজিত হয়ে তিনি সা‘দ ইবনু মুআয (রাঃ)-কে বললেন, তুমি মিথ্যা কথা বলছ। আল্লাহর কসম! তুমি তাকে হত্যা করতে পারবে না এবং তাকে হত্যা করার ক্ষমতাও তোমার নেই। সে তোমার গোত্রের লোক হলে তুমি তার নিহত হওয়া কখনো পছন্দ করতে না। তখন সা‘দ ইবনু মুআয (রাঃ)-এর চাচাতো ভাই উসাইদ ইবনু হুযাইর (রাঃ) সা‘দ ইবনু ‘উবাইদাহ (রাঃ)-কে বললেন, বরং তুমিই মিথ্যা বলছ। আল্লাহর কসম! আমরা অবশ্যই তাকে হত্যা করব। তুমি হলে মুনাফিক। তাই মুনাফিকদের পক্ষ নিয়ে কথাবার্তা বলছ। তিনি [‘আয়িশাহ (রাঃ)] বলেন, এ সময় আউস ও খাযরাজ উভয় গোত্র খুব উত্তেজিত হয়ে যায়। এমনকি তারা যুদ্ধের সংকল্প করে বসে। এ সময় রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম মিম্বরে দাঁড়িয়ে ছিলেন। ‘আয়িশাহ (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাদের শান্ত করলেন এবং নিজেও চুপ হয়ে গেলেন। ‘আয়িশাহ (রাঃ) বলেন, আমি সেদিন সারাক্ষণ কেঁদে কাটালাম। চোখের ধারা আমার বন্ধ হয়নি এবং একটু ঘুমও হয়নি। তিনি বলেন, আমি কান্না করছিলাম আর আমার পিতা-মাতা আমার পার্শ্বে উপবিষ্ট ছিলেন। এমনি করে একদিন দুই রাত কেঁদে কেঁদে কাটিয়ে দিলাম। এর মধ্যে আমার একটুও ঘুম হয়নি। বরং অনবরত আমার চোখ দিয়ে অশ্রু ঝরতে থাকে। মনে হচ্ছিল যেন, কান্নার কারণে আমার কলিজা ফেটে যাবে। আমি ক্রন্দনরত ছিলাম আর আমার আববা-আম্মা আমার পার্শ্বে উপবিষ্ট ছিলেন। এমন সময় একজন আনসারী মহিলা আমার কাছে আসার অনুমতি চাইলে আমি তাকে আসার অনুমতি দিলাম। সে এসে বসল এবং আমার সঙ্গে কাঁদতে আরম্ভ করল। তিনি বলেন, আমরা কান্না করছিলাম এই মুহূর্তে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমাদের কাছে এসে সালাম করলেন এবং আমাদের পাশে বসে গেলেন। ‘আয়িশাহ (রাঃ) বলেন, অপবাদ রটানোর পর আমার পার্শ্বে এসে এভাবে তিনি আর বসেননি। এদিকে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম একমাস অপেক্ষা করার পরও আমার ব্যাপারে তাঁর নিকট কোন ওয়াহী আসেনি। ‘আয়িশাহ (রাঃ) বলেন, বসার পর রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম কালিমা শাহাদাত পড়লেন। এরপর বললেন, ‘আয়িশাহ তোমার ব্যাপারে আমার কাছে অনেক কথাই পৌঁছেছে, যদি তুমি এর থেকে পবিত্র হও তাহলে শীঘ্রই আল্লাহ তোমাকে এ অপবাদ থেকে মুক্ত করবেন। আর যদি তুমি কোন গুনাহ করে থাক তাহলে আল্লাহর কাছে ক্ষমা প্রার্থনা কর এবং তওবা কর। কেননা বান্দা গুনাহ স্বীকার করে তওবা করলে আল্লাহ তা‘আলা তওবা কবূল করেন। তিনি [‘আয়িশাহ (রাঃ)] বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাঁর কথা শেষ করলে আমার অশ্রুধারা বন্ধ হয়ে যায়। এক ফোঁটা অশ্রুও আমি আর টের করতে পারলাম না। তখন আমি আমার আববাকে বললাম, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যা বলছেন আমার হয়ে তার জবাব দিন। আমার আববা বললেন, আল্লাহর কসম! রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে কী জবাব দিব তা জানি না। তখন আমি আমার আম্মাকে বললাম, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যা বলছেন, আপনি তার উত্তর দিন। আম্মা বললেন, আল্লাহর কসম! রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে কী উত্তর দিব তা জানি না। তখন আমি ছিলাম অল্প বয়স্কা কিশোরী। কুরআনও বেশী পড়তে পারতাম না। তথাপিও এ অবস্থা দেখে আমি নিজেই বললাম, আমি জানি আপনারা এ অপবাদের ঘটনা শুনেছেন, আপনারা তা বিশ্বাস করেছেন এবং বিষয়টি আপনাদের মনে দৃঢ়মূল হয়ে আছে। এখন যদি আমি বলি যে, এর থেকে আমি পবিত্র তাহলে আপনারা আমাকে বিশ্বাস করবেন না। আর যদি আমি এ অপরাধের কথা স্বীকার করে নেই যে সম্পর্কে আল্লাহ জানেন যে, আমি এর থেকে পবিত্র, তাহলে আপনারা তা বিশ্বাস করবেন। আল্লাহর কসম! আমি ও আপনারা যে বিপাকে পড়েছি এর জন্য ইউসুফ (আঃ)-এর পিতার কথা ব্যতীত আমি কোন দৃষ্টান্ত খুঁজে পাচ্ছি না। তিনি বলেছিলেনঃ ‘‘কাজেই পূর্ণ ধৈর্য্যই শ্রেয়, তোমরা যা বলছ এ ব্যাপারে আল্লাহই একমাত্র আমার আশ্রয়স্থল।’’ অতঃপর আমি মুখ ঘুরিয়ে আমার বিছানায় গিয়ে শুয়ে পড়লাম। আল্লাহ তা‘আলা জানেন যে, সে মুহূর্তেও আমি পবিত্র। অবশ্যই আল্লাহ আমার পবিত্রতা প্রকাশ করে দেবেন তবে আল্লাহর কসম, আমি কক্ষনো ভাবিনি যে, আমার সম্পর্কে আল্লাহ ওয়াহী অবতীর্ণ করবেন যা পাঠ করা হবে। আমার সম্পর্কে আল্লাহ কোন কথা বলবেন আমি নিজেকে এতটা উত্তম মনে করিনি বরং আমি নিজেকে এর চেয়ে অনেক অধম বলে ভাবতাম। তবে আমি আশা করতাম যে, হয়তো রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে স্বপ্নযোগে দেখানো হবে যার ফলে আল্লাহ আমার পবিত্রতা প্রকাশ করবেন। আল্লাহর কসম! রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তখনো তাঁর বসার জায়গা ছেড়ে যাননি এবং ঘরের লোকজনও কেউ ঘর হতে বেরিয়ে যাননি। এমন সময় তাঁর উপর ওয়াহী অবতরণ শুরু হল। ওয়াহী অবতীর্ণ হওয়ার সময় তাঁর যে বিশেষ ধরনের কষ্ট হত তখনও সে অবস্থা হল। এমনকি ভীষণ শীতের দিনেও তাঁর শরীর হতে মোতির দানার মতো বিন্দু বিন্দু ঘাম গড়িয়ে পড়ল ঐ বাণীর গুরুভারে, যা তাঁর প্রতি অবতীর্ণ হয়েছে। ‘আয়িশাহ (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর এ অবস্থা কেটে গেলে তিনি হাসিমুখে পহেলা যে কথা উচ্চারণ করলেন সেটা হল, হে ‘আয়িশাহ! আল্লাহ তোমার পবিত্রতা প্রকাশ করে দিয়েছেন। তিনি [‘আয়িশাহ (রাঃ)] বলেন, এ কথা শুনে আমার মা আমাকে বললেন, তুমি উঠে গিয়ে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর প্রতি সম্মান কর। আমি বললাম, আল্লাহর কসম! আমি তাঁর দিকে উঠে যাব না। মহান আল্লাহ ব্যতীত কারো প্রশংসা করব না। ‘আয়িশাহ (রাঃ) বললেন, আল্লাহ (আমার পবিত্রতার ব্যাপারে) যে দশটি আয়াত অবতীর্ণ করেছেন, তা হ’ল, ‘‘যারা এ অপবাদ রটনা করেছে তারা তো তোমাদেরই একটি দল; এ ঘটনাকে তোমরা তোমাদের জন্য অনিষ্টকর মনে করো না; বরং এও তোমাদের জন্য কল্যাণকর। তাদের প্রত্যেকের জন্য আছে কঠিন শাস্তি। এ কথা শোনার পর মু’মিন পুরুষ এবং নারীগণ কেন নিজেদের বিষয়ে সৎ ধারণা করেনি এবং বলেনি যে, এটা তো সুস্পষ্ট অপবাদ। তারা কেন এ ব্যাপারে চারজন সাক্ষী উপস্থিত করেনি? যেহেতু তারা সাক্ষী উপস্থিত করেনি, সেহেতু তারা আল্লাহর বিধানে মিথ্যাচারী। দুনিয়া ও আখিরাতে তোমাদের প্রতি আল্লাহর অনুগ্রহ ও দয়া না থাকলে তোমরা যাতে লিপ্ত ছিলে তার জন্য কঠিন শাস্তি তোমাদেরকে স্পর্শ করত। যখন তোমরা মুখে মুখে এ মিথ্যা ছড়াচ্ছিলে এবং এমন বিষয় মুখে উচ্চারণ করছিলে যার কোন জ্ঞান তোমাদের ছিল না এবং একে তোমরা তুচ্ছ ব্যাপারে বলে ভাবছিলে, অথচ আল্লাহর কাছে তা ছিল খুবই গুরুতর ব্যাপার। এবং এ কথা শোনামাত্র তোমরা কেন বললে না যে, এ বিষয়ে বলাবলি করা আমাদের জন্য উচিত নয়। আল্লাহ পবিত্র মহান! এ তো এক গুরুতর অপবাদ। আল্লাহ তোমাদেরকে উপদেশ দিচ্ছেন, যদি তোমরা মু’মিন হয়ে থাক তাহলে কখনো অনুরূপ আচরণের পুনরাবৃত্তি করবে না; আল্লাহ তোমাদের জন্য তাঁর আয়াতসমূহ বিবৃত করেন এবং আল্লাহ সর্বজ্ঞ, প্রজ্ঞাময়। যারা মু’মিনদের মধ্যে অশ্লীলতার প্রসার কামনা করে তাদের জন্য আছে দুনিয়া ও আখিরাতে মর্মন্তুদ শাস্তি। আল্লাহ জানেন, তোমরা জান না। তোমাদের প্রতি আল্লাহর অনুগ্রহ ও দয়া না থাকলে তোমাদের কেউই অব্যাহতি পেত না। আল্লাহ দয়ার্দ্র ও পরম দয়ালু- (সূরাহ আন-নূর ২৪/১১-২০)। আমার পবিত্রতার ব্যাপারে আল্লাহ এ আয়াতগুলো অবতীর্ণ করলেন। আত্মীয়তা এবং দারিদ্রের কারণে আবূ বাকর সিদ্দীক (রাঃ) মিসতাহ ইবনু উসাসাকে আর্থিক ও বৈষয়িক সাহায্য করতেন। কিন্তু ‘আয়িশাহ (রাঃ) সম্পর্কে তিনি যে অপবাদ রটিয়েছিলেন এ কারণে আবূ বাকর সিদ্দীক (রাঃ) কসম করে বললেন, আমি আর কখনো মিসতাহকে আর্থিক সাহায্য করব না। তখন আল্লাহ তা‘আলা অবতীর্ণ করলেন-তোমাদের মধ্যে যারা ঐশ্বর্য ও প্রাচুর্যের অধিকারী তারা যেন শপথ গ্রহণ না করে যে, তারা আত্মীয়-স্বজন ও অভাবগ্রস্তকে এবং আল্লাহর রাস্তায় যারা গৃহত্যাগ করেছে তাদেরকে কিছুই দিবে না। তারা যেন তাদেরকে ক্ষমা করে এবং তাদের দোষ-ত্রুটি উপেক্ষা করে। শোন! তোমরা কি পছন্দ কর না যে, আল্লাহ তোমাদের ক্ষমা করেন? আল্লাহ ক্ষমাশীল; পরম দয়ালু- (সূরাহ আন-নূর ২৪/২২)। আবূ বাকর সিদ্দীক (রাঃ) বলে উঠলেন, হ্যাঁ, আল্লাহর কসম! অবশ্যই আমি পছন্দ করি যে, আল্লাহ আমাকে ক্ষমা করে দিন। এরপর তিনি মিসতাহ (রাঃ)-এর জন্য যে অর্থ খরচ করতেন তা পুনঃ দিতে শুরু করলেন এবং বললেন, আল্লাহর কসম! আমি তাঁকে এ অর্থ দেয়া আর কখনো বন্ধ করব না। ‘আয়িশাহ (রাঃ) বললেন, আমার সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যায়নাব বিনত জাহাশ (রাঃ)-কেও জিজ্ঞেস করেছিলেন। তিনি যায়নাব (রাঃ)-কে বলেছিলেন, তুমি ‘আয়িশাহ (রাঃ) সম্পর্কে কী জান অথবা বলেছিলেন তুমি কী দেখেছ? তখন তিনি বলেছিলেন, হে আল্লাহর রাসূল! আমি আমার চোখ ও কানকে হিফাযত করেছি। আল্লাহর কসম! আমি তাঁর ব্যাপারে ভাল ব্যতীত আর কিছুই জানি না। ‘আয়িশাহ (রাঃ) বলেন, নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর স্ত্রীগণের মধ্যে তিনি আমার প্রতিদ্বন্দ্বী ছিলেন। আল্লাহ তাঁর তাকওয়ার কারণে তাঁকে রক্ষা করেছেন। ‘আয়িশাহ (রাঃ) বলেন, অথচ তাঁর বোন হামনা (রাঃ) তাঁর পক্ষ নিয়ে অপবাদ রটনাকারীদের মতো অপবাদ ছড়াচ্ছিল। ফলে তিনি ধ্বংসপ্রাপ্তদের সঙ্গে ধ্বংস হয়ে গেলেন। বর্ণনাকারী ইবনু শিহাব (রহ.) বলেন, ঐ সমস্ত লোকের ঘটনা আমার কাছে যা পৌঁছেছে তা হলো এইঃ ‘উরওয়াহ (রহ.) বলেন, ‘আয়িশাহ (রাঃ) বর্ণনা করেছেন যে, আল্লাহর কসম! যে ব্যক্তি সম্পর্কে অপবাদ দেয়া হয়েছিল, তিনি এসব কথা শুনে বলতেন, আল্লাহ মহান, ঐ সত্তার কসম! যাঁর হাতে আমার প্রাণ, আমি কোন রমণীর বস্ত্র অনাবৃত করে কোনদিন দেখিনি। ‘আয়িশাহ (রাঃ) বলেন, পরে তিনি আল্লাহর পথে শহীদ হন। [২৫৯৩] (আধুনিক প্রকাশনীঃ ৩৮২৯, ইসলামিক ফাউন্ডেশনঃ ৩৮৩২)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 185
			}
		}
	]
}