{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4230,
			"arabicnumber": 4230,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা ইয়ামানে থাকা অবস্থায় আমাদের কাছে নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর হিজরতের খবর পৌঁছল। তাই আমি ও আমার দু’ভাই আবূ বুরদা ও আবূ রুহম এবং আমাদের কাওমের আরো মোট বায়ান্ন কি তিপ্পান্ন কিংবা আরো কিছু লোকজনসহ আমরা হিজরতের উদ্দেশে বের হলাম। আমি ছিলাম আমার অপর দু’ভাইয়ের চেয়ে বয়সে ছোট। আমরা একটি জাহাজে উঠলাম। জাহাজটি আমাদেরকে আবিসিনিয়া দেশের (বাদশাহ্) নাজ্জাশীর নিকট নিয়ে গেল। সেখানে আমরা জা‘ফর ইবনু আবূ তালিবের সাক্ষাৎ পেলাম এবং তাঁর সঙ্গেই আমরা থেকে গেলাম। অবশেষে নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর খাইবার বিজয়ের সময় সকলে এক যোগে (মদিনা্য়) এসে তাঁর সঙ্গে মিলিত হলাম। এ সময়ে মুসলিমদের কেউ কেউ আমাদেরকে অর্থাৎ জাহাজে আগমনকারীদেরকে বলল, হিজরতের ব্যাপারে আমরা তোমাদের চেয়ে অগ্রগামী। আমাদের সঙ্গে আগমনকারী আসমা বিন্ত উমাইস একবার নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী হাফসাহর সঙ্গে সাক্ষাৎ করতে এসেছিলেন। তিনিও (তাঁর স্বামী জা‘ফরসহ) নাজ্জাশীর দেশে হিজরাতকারীদের সঙ্গে হিজরাত করেছিলেন। আসমা (রাঃ) হাফসাহর কাছেই ছিলেন। এ সময়ে ‘উমার (রাঃ) তাঁর ঘরে প্রবেশ করলেন। ‘উমার (রাঃ) আসমাকে দেখে জিজ্ঞেস করলেন, ইনি কে? হাফসাহ (রাঃ) বললেন, তিনি আসমা বিনত উমাইস (রাঃ)। ‘উমার (রাঃ) বললেন, ইনি হাবশায় হিজরাতকারিণী আসমা? ইনিই কি সমুদ্রগামিনী? আসমা (রাঃ) বললেন, হ্যাঁ! তখন ‘উমার (রাঃ) বললেন, হিজরাতের ব্যাপারে আমরা তোমাদের চেয়ে আগে আছি। সুতরাং তোমাদের তুলনায় রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর প্রতি আমাদের হক অধিক। এতে আসমা (রাঃ) রেগে গেলেন এবং বললেন, কখনো হতে পারে না। আল্লাহর কসম! আপনারা তো রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলেন, তিনি আপনাদের ক্ষুধার্তদের খাবারের ব্যবস্থা করতেন, আপনাদের অবুঝ লোকদেরকে নাসীহাত করতেন। আর আমরা ছিলাম এমন এক এলাকায় অথবা তিনি বলেছেন এমন এক দেশে যা রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম থেকে বহুদূরে এবং সর্বদা শত্রু বেষ্টিত হাবশা দেশে। আল্লাহ ও তাঁর রাসূলের উদ্দেশেই ছিল আমাদের এ হিজরাত আল্লাহর কসম! আমি কোন খাবার খাবো না, পানিও পান করব না, যতক্ষণ পর্যন্ত আপনি যা বলেছেন তা আমি রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে না জানাব। সেখানে আমাদেরকে কষ্ট দেয়া হত, ভয় দেখানো হত। শীঘ্রই আমি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে এসব কথা বলব এবং তাঁকে জিজ্ঞেস করব। তবে আল্লাহর কসম! আমি মিথ্যা বলব না, পেচিয়ে বলব না, বাড়িয়েও কিছু বলব না। [৩১৩৬] (আধুনিক প্রকাশনীঃ ৩৯০৬, ইসলামিক ফাউন্ডেশনঃ ৩৯১০)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 268
			}
		}
	]
}