{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"8": "Prayers (Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 425,
			"arabicnumber": 425,
			"text": "وَصَلَّى الْبَرَاءُ بْنُ عَازِبٍ فِي مَسْجِدِهِ فِي دَارِهِ جَمَاعَةً. বারা’ ইবনু ‘আযিব (রাযি.) নিজের বাড়ির মসজিদে জামা‘আত করে সালাত আদায় করেছিলেন। ৪২৫. মাহমূদ ইবনু রাবী‘ আনসারী (রাযি.) হতে বর্ণিত যে, ‘ইতবান ইবনু মালিক (রাযি.), যিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে বদরের যুদ্ধে অংশ গ্রহণকারী আনসারগণের অন্যতম, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট হাযির হয়ে আরয করলেন হে আল্লাহর রাসূল! আমার দৃষ্টিশক্তি হ্রাস পেয়েছে। আমি আমার গোত্রের লোকদের নিয়ে সালাত আদায় করি। কিন্তু বৃষ্টি হলে আমার ও তাদের বাসস্থানের মধ্যবর্তী নিম্নভূমিতে পানি জমে যাওয়াতে তা পার হয়ে তাদের মসজিদে পৌঁছতে এবং তাদেরকে নিয়ে সালাত আদায় করতে সমর্থ হই না। আর হে আল্লাহর রাসূল! আমার একান্ত ইচ্ছা যে, আপনি আমার ঘরে এসে কোন এক স্থানে সালাত আদায় করেন এবং আমি সেই স্থানকে সালাতের জন্য নির্দিষ্ট করে নিই। রাবী বলেনঃ তাঁকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ইনশাআল্লাহ অচিরেই আমি তা করব। ‘ইতবান (রাযি.) বলেনঃ পরদিন সূর্যোদয়ের পর আল্লাহর রাসূল্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবূ বাকর (রাযি.) আমার ঘরে তাশরীফ আনেন। আল্লাহর রাসূল্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভেতরে প্রবেশ করতে চাইলে আমি তাঁকে অনুমতি দিলাম। ঘরে প্রবেশ করে তিনি না বসেই জিজ্ঞেস করলেনঃ তোমার ঘরের কোন্ স্থানে সালাত আদায় করা পছন্দ কর? তিনি বলেনঃ আমি তাঁকে ঘরের এক প্রান্তের দিকে ইঙ্গিত করলাম। অতঃপর আল্লাহর রাসূল্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ালেন এবং তাকবীর বললেন। তখন আমরাও দাঁড়ালাম এবং কাতারবন্দী হলাম। তিনি দু’রাক‘আত সালাত আদায় করলেন। অতঃপর সালাম ফিরালেন। তিনি (‘ইতবান) বলেনঃ আমরা তাঁকে কিছুক্ষণের জন্য বসালাম এবং তাঁর জন্য তৈরি ‘খাযীরাহ’* নামক খাবার তাঁর সামনে পেশ করলাম। রাবী বলেনঃ এ সময় মহল্লার কিছু লোক ঘরে ভীড় জমালেন। তখন উপস্থিত লোকদের মধ্য হতে এক ব্যক্তি বলে উঠলেন, ‘মালিক ইবনু দুখাইশিন’ কোথায়? অথবা বললেনঃ ‘ইবনু দুখশুন’ কোথায়? তখন তাঁদের একজন জওয়াব দিলেন, সে মুনাফিক। সে মহান আল্লাহ ও আল্লাহর রাসূলকে ভালবাসে না। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এরূপ বলো না। তুমি কি দেখছ না যে, সে আল্লাহর সন্তোষ লাভের জন্যে ‘লা- ইলা-হা ইল্লাল্লাহ’’ বলেছে? তখন সে ব্যক্তি বললেনঃ আল্লাহ ও তাঁর রাসূলই ভাল জানেন। আমরা তো তার সম্পর্ক ও নাসীহাত কামনা মুনাফিকদের সাথেই দেখি। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ তা‘আলা তো এমন ব্যক্তির প্রতি জাহান্নাম হারাম করে দিয়েছেন, যে আল্লাহর সন্তুষ্টি লাভের উদ্দেশে ‘লা- ইলা-হা ইল্লাল্লাহ’ বলে। রাবী‘ ইব্ন শিহাব (রহ.) বলেনঃ অতঃপর আমি মাহমূদ ইব্ন রাবী‘ (রাযি.)-এর হাদীস সম্পর্কে হুসায়ন ইবনু মুহাম্মাদ আনসারী (রহ.)-কে জিজ্ঞেস করলাম, যিনি বানূ সালিম গোত্রের একজন নেতৃস্থানীয় ব্যক্তি ছিলেন। তিনি এ হাদীস সমর্থন করলেন। (৪২৪) (আধুনিক প্রকাশনীঃ ৪০৭, ইসলামিক ফাউন্ডেশনঃ ৪১৩)",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 75
			}
		}
	]
}