{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4302,
			"arabicnumber": 4302,
			"text": "‘আমর ইবনু সালামাহ (রহ.) হতে বর্ণিত। আইয়ুব (রহ.) বলেছেন, আবূ কিলাবাহ আমাকে বললেন, তুমি ‘আমর ইবনু সালামাহ’র সঙ্গে সাক্ষাৎ করে (তাঁর ইসলাম গ্রহণের ঘটনা সম্পর্কে) জিজ্ঞেস কর না কেন? আবূ কিলাবাহ (রহ.) বলেন, অতঃপর আমি ‘আমর ইবনু সালামাহর সঙ্গে দেখা করে তাঁকে (তাঁর ইসলাম গ্রহণের ঘটনা সম্পর্কে) জিজ্ঞেস করলাম। তিনি বললেন, আমরা লোকজনের চলার পথের পাশে একটি ঝরণার কাছে বাস করতাম। আমাদের পাশ দিয়ে অনেক কাফেলা চলাচল করত। তখন আমরা তাদেরকে জিজ্ঞেস করতাম, (মক্কার) লোকজনের অবস্থা কী? মক্কার লোকজনের অবস্থা কী? আর ঐ লোকটির কী অবস্থা? তারা বলত, ঐ ব্যক্তি দাবী করে যে, আল্লাহ তাঁকে রাসূল বানিয়ে পাঠিয়েছেন, তাঁর প্রতি ওয়াহী অবতীর্ণ করেছেন। (কুরআনের কিছু অংশ পাঠ করে বলত) তাঁর কাছে আল্লাহ এ রকম ওয়াহী অবতীর্ণ করেছেন। (‘আমর ইবনু সালামা’হ বলেন) তখন আমি সে বাণীগুলো মুখস্থ করে নিতাম যেন তা আমার হৃদয়ে গেঁথে থাকত। সমগ্র আরব ইসলাম গ্রহণের জন্য নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর বিজয়ের অপেক্ষা করছিল। তারা বলত, তাঁকে তার নিজ গোত্রের লোকেদের সঙ্গে (আগে) বোঝাপড়া করতে দাও। অতঃপর তিনি যদি তাদের উপর বিজয়ী হন তবে তিনি সত্য নবী। এরপর মক্কা বিজয়ের ঘটনা ঘটল। এবার সব গোত্রই তাড়াহুড়া করে ইসলাম গ্রহণ করতে লাগল। আমাদের কাওমের ইসলাম গ্রহণের ব্যাপারে আমার পিতা বেশ তাড়াহুড়া করলেন। তিনি ইসলাম গ্রহণের পর ফিরে এসে বললেন, আল্লাহর শপথ! আমি সত্য নবীর নিকট থেকে তোমাদের কাছে এসেছি। তিনি বলে দিয়েছেন যে, অমুক সময়ে তোমরা অমুক সালাত এবং অমুক সময় অমুক সালাত আদায় করবে। এভাবে সালাতের সময় হলে তোমাদের একজন আযান দিবে এবং তোমাদের মধ্যে যে কুরআন অধিক জানে সে সালাতের ইমামাত করবে। সবাই এ রকম একজন লোক খুঁজলেন। কিন্তু আমার চেয়ে অধিক কুরআন জানা একজনকেও পাওয়া গেল না। কেননা আমি কাফেলার লোকদের থেকে কুরআন শিখেছিলাম। কাজেই সকলে আমাকেই তাদের সামনে এগিয়ে দিল। অথচ তখনো আমি ছয় কিংবা সাত বছরের বালক। আমার একটি চাদর ছিল, যখন আমি সিজদা্য় যেতাম তখন চাদরটি আমার গায়ের সঙ্গে জড়িয়ে উপরের দিকে উঠে যেত। তখন গোত্রের জনৈকা মহিলা বলল, তোমরা আমাদের দৃষ্টি থেকে তোমাদের ক্বারীর নিতম্ব আবৃত করে দাও না কেন? তারা কাপড় খরিদ করে আমাকে একটি জামা তৈরি করে দিল। এ জামা পেয়ে আমি এত খুশি হয়েছিলাম যে, আর কিছুতে এত খুশি হইনি। (আধুনিক প্রকাশনীঃ ৩৯৬৩, ইসলামিক ফাউন্ডেশনঃ ৩৯৬৮)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 335
			}
		}
	]
}