{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4351,
			"arabicnumber": 4351,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আলী ইবনু আবূ তালিব (রাঃ) ইয়ামান থেকে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে এক প্রকার (রঙিণ) চামড়ার থলে করে সামান্য কিছু স্বর্ণ পাঠিয়েছিলেন। তখনও এগুলো থেকে সংযুক্ত মাটি পরিষ্কার করা হয়নি। আবূ সা‘ঈদ খুদরী (রাঃ) বলেন, রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম চার জনের মাঝে স্বর্ণখন্ডটি বণ্টন করে দিলেন। তারা হলেন, ‘উয়াইনাহ ইবনু বাদর, আকরা ইবনু হাবিস, যায়দ আল-খায়ল এবং চতুর্থ জন ‘আলক্বামাহ কিংবা ‘আমির ইবনু তুফায়ল (রাঃ)। তখন সাহাবীগণের মধ্য থেকে একজন বললেন, এটা পাওয়ার ব্যাপারে তাঁদের অপেক্ষা আমরাই অধিক হাকদার ছিলাম। (রাবী) বলেন, কথাটি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম পর্যন্ত গিয়ে পৌঁছল। তাই নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, তোমরা কি আমার উপর আস্থা রাখ না অথচ আমি আসমানের অধিবাসীদের আস্থাভাজন, সকাল-বিকাল আমার কাছে আসমানের সংবাদ আসছে। রাবী বলেন, এমন সময়ে এক ব্যক্তি উঠে দাঁড়াল। লোকটির চোখ দু’টি ছিল কোটরাগত, চোয়ালের হাড় যেন বেরিয়ে পড়ছে, উঁচু কপাল বিশিষ্ট, দাড়ি অতি ঘন, মাথাটি ন্যাড়া, পরনের লুঙ্গী উপরে উত্থিত। সে বলল, হে আল্লাহর রাসূল! আল্লাহকে ভয় করুন। নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, তোমার জন্য আফসোস! আল্লাহকে ভয় করার ব্যাপারে দুনিয়াবাসীদের মধ্যে আমি কি অধিক হাকদার নই? রাবী আবূ সা‘ঈদ খুদরী (রাঃ) বলেন, লোকটি চলে গেলে খালিদ বিন ওয়ালীদ (রাঃ) বললেন, হে আল্লাহর রাসূল! আমি কি লোকটির গর্দান উড়িয়ে দেব না? রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেনঃ না, হতে পারে সে সালাত আদায় করে। খালিদ (রাঃ) বললেন, অনেক সালাত আদায়কারী এমন আছে যারা মুখে এমন এমন কথা উচ্চারণ করে যা তাদের অন্তরে নেই। রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, আমাকে মানুষের দিল ছিদ্র করে, পেট ফেড়ে দেখার জন্য বলা হয়নি। তারপর তিনি লোকটির দিকে তাকিয়ে দেখলেন। তখন লোকটি পিঠ ফিরিয়ে চলে যাচ্ছে। তিনি বললেন, এ ব্যক্তির বংশ থেকে এমন এক জাতির উদ্ভব হবে যারা শ্রুতিমধুর কণ্ঠে আল্লাহর কিতাব তিলাওয়াত করবে অথচ আল্লাহর বাণী তাদের গলদেশের নিচে নামবে না। তারা দ্বীন থেকে এভাবে বেরিয়ে যাবে যেভাবে লক্ষ্যবস্তুর দেহ ভেদ করে তীর বেরিয়ে যায়। (বর্ণনাকারী বলেন) আমার মনে হয় তিনি এ কথাও বলেছেন, যদি আমি তাদেরকে পাই তাহলে অবশ্যই আমি তাদেরকে সামূদ জাতির মতো হত্যা করে দেব। [৩৩৪৪; মুসলিম ১২/৪৭, হাঃ ১০৬৪, আহমাদ ১১৬৯৫] (আধুনিক প্রকাশনীঃ ৪০০৬, ইসলামিক ফাউন্ডেশনঃ ৪০১০)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 378
			}
		}
	]
}