{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4361,
			"arabicnumber": 4361,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমাদের তিনশ’ সাওয়ারীর একটি সৈন্যবাহিনীকে কুরাইশদের একটি কাফেলার উপর সুযোগ মতো আক্রমণ চালানোর জন্য পাঠিয়েছিলেন। আবূ ‘উবাইদাহ ইবনুল জাররাহ্ (রাঃ) ছিলেন আমাদের সেনাপতি। আমরা অর্ধমাস সমুদ্র তীরে অবস্থান করলাম। ভয়ানক ক্ষুধা আমাদেরকে পেয়ে বসল। ক্ষুধার জ্বালায় গাছের পাতা খেতে থাকলাম। এ জন্যই এ সৈন্যবাহিনীর নাম রাখা হয়েছে জায়শুল খাবাত অর্থাৎ পাতাওয়ালা সেনাদল। এরপর সমুদ্র আমাদের জন্য আম্বর নামক একটি প্রাণী নিক্ষেপ করল। আমরা অর্ধমাস ধরে তা থেকে খেলাম। এর চর্বি শরীরে লাগালাম। ফলে আমাদের শরীর পূর্বের মত হৃষ্টপুষ্ট হয়ে গেল। এরপর আবূ ‘উবাইদাহ (রাঃ) আম্বরটির শরীর থেকে একটি পাঁজর ধরে খাড়া করালেন। এরপর তাঁর সাথীদের মধ্যকার সবচেয়ে লম্বা লোকটিকে আসতে বললেন। সুফ্ইয়ান (রাঃ) আরেক বর্ণনায় বলেছেন, আবূ ‘উবাইদাহ (রাঃ) আম্বরটির পাঁজরের হাড়গুলোর মধ্য থেকে একটি হাড় ধরে খাড়া করালেন এবং (ঐ) লোকটিকে উটের পিঠে বসিয়ে এর নিচে দিয়ে অতিক্রম করালেন। জাবির (রাঃ) বলেন, সেনাদলের এক ব্যক্তি (খাদ্যের অভাব দেখে) প্রথমে তিনটি উট যবহ করেছিলেন, তারপর আরো তিনটি উট যবেহ করেছিলেন, তারপর আরো তিনটি উট যবহ করেছিলেন। এরপর আবূ ‘উবাইদাহ (রাঃ) তাকে (উট যবহ করতে) নিষেধ করলেন। আমর ইবনু দ্বীনার (রাঃ) বলতেন, আবূ সালিহ (রহ.) আমাদের জানিয়েছেন যে, কায়স ইবনু সা‘দ (রাঃ) (অভিযান থেকে ফিরে এসে) তাঁর পিতার কাছে বর্ণনা করেছিলেন যে, সেনাদলে আমিও ছিলাম, সেনাদল ক্ষুধার্ত হয়ে পড়ল, (কথাটা শোনামাত্র কায়সের পিতা) সা‘দ বললেন, এমতাবস্থায় তুমি উট যবহ করে দিতে। কায়স বললেন, (হ্যাঁ) আমি উট যবেহ করেছি। তিনি বললেন, তারপর আবার সবাই ক্ষুধার্ত হয়ে গেল। এবারো তার পিতা বললেন, তুমি যবহ করতে। তিনি বললেন, (হ্যাঁ) যবহ করেছি। তিনি বললেন, তারপর আবার সবাই ক্ষুধার্ত হল। সা‘দ বললেন, এবারো উট যবহ করতে। তিনি বললেন, (হ্যাঁ) যবহ করেছি। তিনি বললেন, এরপরও আবার সবাই ক্ষুধার্ত হল। সা‘দ (রাঃ) বললেন, উট যবহ করতে। যখন কায়স ইবনু সা‘দ (রাঃ) বললেন, তখন আমাকে (যবহ করতে) নিষেধ করা হল।৮২ [২৪৮৩; মুসলিম ৩৪/৪, হাঃ ১৯৩৫, আহমাদ ১৪৩১৯] (আধুনিক প্রকাশনীঃ ৪০১৫, ইসলামিক ফাউন্ডেশনঃ ৪০১৯)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 387
			}
		}
	]
}