{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4372,
			"arabicnumber": 4372,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম একদল অশ্বারোহী সৈন্য নজদের দিকে পাঠিয়েছিলেন। তারা সুমামাহ ইবনু উসাল নামক বনু হানীফার এক লোককে ধরে আনলেন এবং মসজিদে নাববীর একটি খুঁটির সঙ্গে তাকে বেঁধে রাখলেন। তখন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তার কাছে গিয়ে বললেন, ওহে সুমামাহ! তোমার কাছে কেমন মনে হচ্ছে? সে উত্তর দিল, হে মুহাম্মাদ! আমার কাছে তো ভালই মনে হচ্ছে। যদি আমাকে হত্যা করেন তাহলে আপনি একজন খুনীকে হত্যা করবেন। আর যদি আপনি অনুগ্রহ করেন তাহলে একজন কৃতজ্ঞ ব্যক্তিকে অনুগ্রহ করবেন। আর যদি আপনি অর্থ সম্পদ পেতে চান তাহলে যতটা ইচ্ছা দাবী করুন। নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাকে সেই অবস্থার উপর রেখে দিলেন। এভাবে পরের দিন আসল। নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আবার তাকে বললেন, ওহে সুমামাহ! তোমার কাছে কেমন মনে হচ্ছে? সে বলল, আমার কাছে সেটিই মনে হচ্ছে যা আমি আপনাকে বলেছিলাম যে, যদি আপনি অনুগ্রহ করেন তাহলে একজন কৃতজ্ঞ ব্যক্তির উপর অনুগ্রহ করবেন। তিনি তাকে সেই অবস্থায় রেখে দিলেন। এভাবে এর পরের দিনও আসল। তিনি জিজ্ঞেস করলেন, হে সুমামাহ! তোমার কাছে কেমন মনে হচ্ছে? সে বলল, আমার কাছে তা-ই মনে হচ্ছে যা আমি পূর্বেই বলেছি। নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, তোমরা সুমামাহর বন্ধন ছেড়ে দাও। এবার সুমামাহ মসজিদে নাববীতে প্রবেশ করে বলল, আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ব্যতীত কোন ইলাহ নেই এবং মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল। (তিনি বললেন) হে মুহাম্মাদ! আল্লাহর কসম! ইতোপূর্বে আমার কাছে যমীনের উপর আপনার চেহারার চেয়ে অধিক অপছন্দনীয় আর কোন চেহারা ছিল না। কিন্তু এখন আপনার চেহারাই আমার কাছে সকল চেহারা অপেক্ষা অধিক প্রিয়। আল্লাহর কসম! আমার কাছে আপনার দ্বীন অপেক্ষা অধিক ঘৃণিত অন্য কোন দ্বীন ছিল না। এখন আপনার দ্বীনই আমার কাছে সকল দ্বীনের চেয়ে প্রিয়তম। আল্লাহর কসম! আমার মনে আপনার শহরের চেয়ে অধিক খারাপ শহর অন্য কোনটি ছিল না। কিন্তু এখন আপনার শহরটিই আমার কাছে সকল শহর চেয়ে অধিক প্রিয়। আপনার অশ্বারোহী সৈনিকগণ আমাকে ধরে এনেছে, সে সময় আমি ‘উমরাহর উদ্দেশে বেরিয়ে ছিলাম। এখন আপনি আমাকে কী হুকুম করেন? তখন রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাঁকে সু-সংবাদ প্রদান করলেন এবং ‘উমরাহ্ আদায়ের নির্দেশ দিলেন। এরপর তিনি যখন মক্কা্য় আসলেন তখন এক ব্যক্তি তাকে বলল, বেদ্বীন হয়ে গেছ? তিনি উত্তর করলেন, না, বরং আমি মুহাম্মাদ রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে ইসলাম গ্রহণ করেছি। আর আল্লাহর কসম! নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর অনুমতি ব্যতীত তোমাদের কাছে ইয়ামামাহ থেকে গমের একটি দানাও আসবে না। [৪৬২; মুসলিম ৩২/১৯, হাঃ ১৭৬৪] (আধুনিক প্রকাশনীঃ ৪০২৬, ইসলামিক ফাউন্ডেশনঃ ৪০৩০)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 398
			}
		}
	]
}