{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4415,
			"arabicnumber": 4415,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমার সাথীরা আমাকে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে পাঠালেন তাদের জন্য পশুবাহন চাওয়ার জন্য। কারণ তাঁরা রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সঙ্গে কষ্টের যুদ্ধ অর্থাৎ তাবূকের যুদ্ধে যাচ্ছিলেন। অনন্তর আমি এসে বললাম, হে আল্লাহর নবী! আমার সাথীরা আমাকে আপনার কাছে এজন্য পাঠিয়েছেন যে, আপনি যেন তাদের জন্য পশুবাহনের ব্যবস্থা করেন। তখন তিনি বললেন, আল্লাহর কসম! আমি তোমাদের জন্য কোন সওয়ারীর ব্যবস্থা করতে পারব না। আমি লক্ষ্য করলাম, তিনি রাগান্বিত। (কিন্তু কী কারণে তিনি রাগান্বিত) তা বুঝলাম না। আর আমি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর পশুবাহন না দেয়ার কারণে দুঃখিত মনে ফিরে আসি। আবার এ ভয়ও ছিল যে, নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম না আমার উপরই অসন্তুষ্ট হন। তাই আমি সাথীদের কাছে ফিরে যাই এবং নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যা বলেছেন তা আমি তাদের জানাই। অল্পক্ষণ পরেই শুনতে পেলাম যে, বিলাল (রাঃ) ডাকছেনঃ ‘আবদুল্লাহ ইবনু কায়স কোথায়? তখন আমি তাঁর ডাকে সাড়া দিলাম। তখন তিনি বললেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আপনাকে ডাকছেন, আপনি হাজির হোন। আমি যখন তাঁর কাছে হাজির হলাম তখন তিনি বললেন, এই জোড়া এবং ঐ জোড়া এমনি ছয়টি উটনী যা সা‘দ থেকে ক্রয় করা হয়েছে, তা গ্রহণ কর এবং সেগুলো তোমার সাথীদের কাছে নিয়ে যাও এবং বল যে, আল্লাহ তা‘আলা (রাবীর সন্দেহ) অথবা বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম এগুলো তোমাদের যানবাহনের জন্য ব্যবস্থা করেছেন, তোমরা এগুলোর উপর আরোহণ কর। যাতে তোমরা এমন ধারণা না কর যে, নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যা বলেননি আমি তা তোমাদের বর্ণনা করেছি। তখন তারা আমাকে বললেন, আল্লাহর কসম! আপনি আমাদের কাছে সত্যবাদী বলে পরিচিত। তবুও আপনি যা চান, আমরা অবশ্য করব। অনন্তর আবূ মূসা (রাঃ) তাদের মধ্যকার একদল লোককে সঙ্গে নিয়ে রওয়ানা হন এবং যারা রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম কর্তৃক অপারগতা প্রকাশ এবং পরে তাদেরকে দেয়ার কথা শুনেছিলেন, তাদের কাছে আসেন। তখন তারা সেরূপ কথাই বর্ণনা করলেন যেমন আবূ মূসা (রাঃ) বর্ণনা করেছিলেন। [৩১৩৩] (আধুনিক প্রকাশনীঃ ৪০৬৭, ইসলামিক ফাউন্ডেশনঃ ৪০৭০)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 437
			}
		}
	]
}