{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4476,
			"arabicnumber": 4476,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, কিয়ামতের দিন মু’মিনগণ একত্রিত হবে এবং তারা বলবে, আমরা যদি আমাদের রবের কাছে আমাদের জন্য একজন সুপারিশকারী পেতাম। এরপর তারা আদম (আঃ)-এর কাছে আসবে এবং তাঁকে বলবে, আপনি মানব জাতির পিতা। আপনাকে আল্লাহ তা‘আলা নিজ হাতে সৃষ্টি করেছেন। তাঁর মালায়িকাহ দ্বারা আপনাকে সিজদা্ করিয়েছেন এবং যাবতীয় বস্ত্তর নাম আপনাকে শিক্ষা দিয়েছেন। অতএব আপনি আপনার রবের কাছে আমাদের জন্য সুপারিশ করুন, যেন আমাদের কঠিন স্থান থেকে আরাম দিতে পারেন। তিনি বলবেন, আমি এ কাজের যোগ্য নই। তিনি নিজ ভুলের কথা স্মরণ করে লজ্জাবোধ করবেন। (তিনি বলবেন) তোমরা নূহ (আঃ)-এর কাছে যাও। তিনিই প্রথম রাসূল (আঃ) যাকে আল্লাহ জগৎবাসীর কাছে পাঠিয়েছেন। তখন তারা তাঁর কাছে আসবে। তিনিও বলবেন, এ কাজ আমার দ্বারা হওয়ার নয়। তিনি তাঁর রবের কাছে প্রশ্ন করেছিলেন এমন বিষয়ে যা তাঁর জানা ছিল না। সে কথা স্মরণ করে তিনি লজ্জাবোধ করবেন এবং বলবেন বরং তোমরা আল্লাহর খলীল (ইব্রাহীম) (আঃ)-এর কাছে যাও। তারা তখন তাঁর কাছে আসবে, তখন তিনি বলবেন, এ কাজ আমার দ্বারা হওয়ার নয়। তোমরা মূসা (আঃ)-এর কাছে যাও। তিনি এমন বান্দা যে, তাঁর সঙ্গে আল্লাহ কথা বলেছেন এবং তাঁকে তাওরাত গ্রন্থ দান করেছেন। তখন তারা তাঁর কাছে আসবে। তিনি বলবেন, তোমাদের এ কাজের জন্য আমার সাহস হচ্ছে না এবং তিনি এক কিবতীকে বিনা দোষে হত্যা করার কথা স্মরণ করে তাঁর রবের নিকট লজ্জাবোধ করবেন। তিনি বলবেন, তোমরা ঈসা (আঃ)-এর কাছে যাও। তিনি আল্লাহর বান্দা ও রাসূল এবং আল্লাহর বাণী ও রূহ্। (তারা সেখানে যাবে) তিনি বলবেন, এ কাজ আমার দ্বারা হওয়ার নয়। তোমরা মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে যাও। তিনি এমন এক বান্দা যার পূর্ব ও পরের ভুলত্রুটি আল্লাহ ক্ষমা করে দিয়েছেন। তখন তারা আমার কাছে আসবে। তখন আমি আমার রবের কাছে যাব এবং অনুমতি চাব, আমাকে অনুমতি প্রদান করা হবে। আর আমি যখন আমার রবকে দেখব, তখন আমি সিজদা্য় লুটিয়ে পড়ব। আল্লাহ যতক্ষণ চান এ অবস্থায় আমাকে রাখবেন। তারপর বলা হবে, আপনার মাথা উঠান এবং চান দেয়া হবে, বলুন শোনা হবে, সুপারিশ করুন কবূল করা হবে। তখন আমি আমার মাথা উঠাব এবং আমাকে যে প্রশংসাসূচক বাক্য শিক্ষা দিবেন তা দ্বারা আমি তাঁর প্রশংসা করব। তারপর সুপারিশ করব। আমাকে একটি সীমারেখা নির্দিষ্ট করে দেয়া হবে। (সেই সীমিত সংখ্যায়) আমি তাদের জান্নাতে প্রবেশ করাব। আমি পুনরায় রবের সমীপে ফিরে আসব। যখন আমি আমার রবকে দেখব তখন আগের মত সবকিছু করব। তারপর আমি সুপারিশ করব। আর আমাকে একটি সীমারেখা নির্দিষ্ট করে দেয়া হবে। তদনুসারে আমি তাদের জান্নাতে দাখিল করাব। (তারপর তৃতীয়বার) আমি আবার রবের নিকটে উপস্থিত হয়ে অনুরূপ করব। এরপর আমি চতুর্থবার ফিরে আসব এবং আরয করব এখন তারাই কেবল জাহান্নামে অবশিষ্ট রয়ে গেছে যারা কুরআনের ঘোষণা অনুযায়ী অনেক আছে যাদের উপর জাহান্নামে চিরবাস অবধারিত হয়ে গেছে। আবূ ‘আবদুল্লাহ বুখারী (রহ.) বলেন, কুরআনের যে ঘোষণায় তারা জাহান্নামে আবদ্ধ রয়েছে তা হল মহান আল্লাহর বাণীঃ ‘‘তারা চিরকাল জাহান্নামে থাকবে।’’ [৪৪; মুসলিম ১/৮৪, হাঃ ১৯৩, আহমাদ ১২১৫৩] (আধুনিক প্রকাশনীঃ ৪১১৮, ইসলামিক ফাউন্ডেশনঃ ৪১২১)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 3
			}
		}
	]
}