{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4483,
			"arabicnumber": 4483,
			"text": "(مَثَابَةً) يَثُوْبُوْنَ يَرْجِعُوْنَ. مَثَابَةً-ফিরে আসার স্থান। يَثُوْبُوْنَ লোকজন প্রত্যাবর্তন করে। ৪৪৮৩. আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) বলেছেন, তিনটি বিষয়ে আমার মতামত আল্লাহর ওয়াহীর অনুরূপ হয়েছে অথবা (তিনি বলেছেন) তিনটি বিষয়ে আমার মতামতের অনুকূলে আল্লাহ ওয়াহী অবতীর্ণ করেছেন। তা হল, আমি বলেছিলাম হে আল্লাহর রাসূল! যদি আপনি মাকামে ইব্রাহীমকে সালাতের স্থান হিসাবে গ্রহণ করতেন। এ বিষয়ে আল্লাহ তা‘আলা অবতীর্ণ করলেন ....... তোমরা ইবরাহীমের দাঁড়ানোর জায়গাকে সালাতের জায়গারূপে গ্রহণ কর- (সূরাহ আল-বাকারাহ ২/১২৫)। আমি বললাম, হে আল্লাহর রাসূল! আপনার কাছে ভাল ও মন্দ উভয় প্রকারের লোক আসে। কাজেই আপনি যদি উম্মাহাতুল মু’মিনীনদেরকে পর্দা করার আদেশ করবেন। তখন আল্লাহ তা‘আলা পর্দার আয়াত অবতীর্ণ করেন। তিনি আরো বলেন, আমি জানতে পেরেছিলাম যে, নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাঁর কতক স্ত্রীর প্রতি অসন্তুষ্ট হয়েছেন। তখন আমি তাদের কাছে উপস্থিত হই এবং বলি যে, আপনারা এর থেকে বিরত থাকুন নচেৎ আল্লাহ তা‘আলা তাঁর রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে আপনাদের পরিবর্তে উত্তম স্ত্রী দান করবেন। এরপর আমি তাঁর কোন স্ত্রীর কাছে আসি, তখন তিনি বললেন, হে ‘উমার! রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর একান্ত ব্যক্তিগত ব্যাপারেও নাক গলাতে শুরু করেছ। তিনি সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম স্ত্রীগণকে নাসীহাত করে থাকেন আর এখন তুমি তাদের নাসীহাত করতে আরম্ভ করেছ? তখন আল্লাহ তা‘আলা অবতীর্ণ করেন عَسٰى رَبُّه إِنْ طَلَّقَكُنَّ أَنْ يُّبَدِّلَه أَزْوَاجًا خَيْرًا مِّنْكُنَّ مُسْلِمٰتٍ ‘‘যদি নবী তোমাদের সবাইকে তালাক দেন, তবে তাঁর রব অচিরেই তোমাদের পরিবর্তে তোমাদের চেয়ে উত্তম স্ত্রী তাঁকে দিবেন, যারা হবে আজ্ঞাবহ, ঈমানদার, অনুগত, তওবাকারিণী, ‘ইবাদাতকারিণী, সিয়াম পালনকারী, অকুমারী ও কুমারী’’- (সূরাহ আত্-তাহরীম ৬৬/৫)। ইবনু আবী মারইয়াম (রহ.) বলেন, আনাস (রাঃ) হতে বর্ণিত যে, ‘উমার (রাঃ) আমার কাছে এরূপ বলেছেন। [৪০২] (আধুনিক প্রকাশনীঃ ৪১২৫, ইসলামিক ফাউন্ডেশনঃ ৪১২৮)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 10
			}
		}
	]
}