{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4535,
			"arabicnumber": 4535,
			"text": "(فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًا فَإِذَآ أَمِنْتُمْ فَاذْكُرُوا اللهَ كَمَا عَلَّمَكُمْ مَا لَمْ تَكُوْنُوْا تَعْلَمُوْنَ) وَقَالَ ابْنُ جُبَيْرٍ : (وَسِعَ كُرْسِيُّهُ) : عِلْمُهُ’ يُقَالُ (بَسْطَةً) زِيَادَةً وَفَضْلًا. (أَفْرِغْ)أَنْزِلْ، (وَلَا يَئُوْدُهُ) : لَا يُثْقِلُهُ، آدَنِيْ : أَثْقَلَنِيْ وَالْآدُ وَالأَيْدُ : الْقُوَّةُ. (السِّنَةُ) : نُعَاسٌ. (لَمْ يَتَسَنَّهْ) : لَمْ يَتَغَيَّرْ. (فَبُهِتَ) :ذَهَبَتْ حُجَّتُهُ. (خَاوِيَةٌ) : لَا أَنِيْسَ فِيْهَا. (عُرُوْشُهَا) أَبْنِيَتُهَا. (السِّنَةُ) : نُعَاسٌ. (نُنْشِرُهَا) : نُخْرِجُهَا. (إِعْصَارٌ) : رِيْحٌ عَاصِفٌ تَهُبُّ مِنَ الْأَرْضِ إِلَى السَّمَاءِ كَعَمُوْدٍ فِيْهِ نَارٌ وَقَالَ ابْنُ عَبَّاسٍ :(صَلْدًا) لَيْسَ عَلَيْهِ شَيْءٌ وَقَالَ عِكْرِمَةُ (وَابِلٌ)مَطَرٌ شَدِيْدٌ (الطَّلُّ)النَّدَى وَهَذَا مَثَلُ عَمَلِ الْمُؤْمِنِ يَتَسَنَّهْ يَتَغَيَّرْ. ‘‘তবে যদি তোমরা আশঙ্কা কর তবে পদচারী অথবা আরোহী অবস্থায়; যখন তোমরা নিরাপদ বোধ কর তখন আল্লাহকে স্মরণ করবে, যেভাবে তিনি তোমাদের শিক্ষা দিয়েছেন যা তোমরা জানতে না।’’ (সূরাহ আল-বাকারাহ ২/২৩৯) ইবনু যুবায়র (রাঃ) বলেন, كُرْسِيُّهُ আল্লাহর কুরসীর অর্থ হলঃ عِلْمُهُ তাঁর জ্ঞান। আর بَسْطَةً অতিরিক্ত ও অধিক। أَفْرِغْ অবতীর্ণ কর। يَئُوْدُهُ ভারী ও বোঝা বোধ হয় না তাঁর। যেমন آدَنِيْ أَثْقَلَنِيْ শক্ত ও ভারী করেছে আমাকে। الآدُ وَالأَيْدُ শক্ত ও শক্তি। فَبُهِتَ তার দলীল-প্রমাণ শেষ হয়ে গেছে। خَاوِيَةٌ বিরান, জনশূন্য, عُرُوْشُهَا বুনিয়াদ ও ভিত্তি, السِّنَةُ তন্দ্রা, ঝিমুনি, نُنْشزُهَا আমি খাড়া করছি বা উঠাচ্ছি। إِعْصَارٌ ঝড়ো বাতাস বা ঘূর্ণি বায়ু যা ভূমি থেকে আকাশের দিকে প্রলম্বিত হয় এবং এর মধ্যে আগুন বা লু থাকে। ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) বলেছেনঃ صَلْدًا মসৃণ পরিচ্ছ্ন্ন পাথর যার উপর কিছু্ই থাকে না। ‘ইকরামাহ বলেছেনঃ وَابِلٌ মুষলধারে বৃষ্টি। الطَّلُّ শিশির। এ দ্বারা ঈমানদার ব্যক্তির ‘আমলের উদাহরণ দেয়া হয়েছে। يَتَسَنَّهْ বিকৃত বা পরিবর্তিত হয়ে যায়নি। ৪৫৩৫. নাফি‘ (রহ.) হতে বর্ণিত। ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ)-কে যখন সালাতুল খাওফ (যুদ্ধক্ষেত্রে শত্রুর ভয় থাকা অবস্থায় সালাত) প্রসঙ্গে প্রশ্ন করা হত তখন তিনি বলতেন, ইমাম সামনে যাবেন এবং একদল লোকও জামা‘আতে শামিল হবে। তিনি তাদের সঙ্গে এক রাক‘আত সালাত আদায় করবেন এবং তাদের আর একদল জামা‘আতে শামিল না হয়ে তাদের ও শত্রুর মাঝখানে থেকে যারা সালাত আদায় করেনি তাদের পাহারা দিবে। ইমামের সঙ্গে যারা এক রাক‘আত সালাত আদায় করেছে তারা পেছনে গিয়ে যারা এখনও সালাত আদায় করেনি তাদের স্থানে দাঁড়াবে কিন্তু সালাম ফেরাবে না। যারা সালাত আদায় করেনি তারা আগে বাড়বে এবং ইমামের সঙ্গে এক রাক‘আত আদায় করবে। তারপর ইমাম সালাত হতে নিষ্ক্রান্ত হবেন। কেননা তিনি দু’ রাক‘আত সালাত আদায় করেছেন। এরপর উভয় দল দাঁড়িয়ে নিজে নিজে বাকি এক রাক‘আত ইমামের সালাত শেষে আদায় করে নেবে। তাহলে প্রত্যেক জনেরই দু’ রাক‘আত সালাত আদায় হয়ে যাবে। ভয়-ভীতি এর চেয়েও অধিক হলে নিজে নিজে দাঁড়িয়ে অথবা যানবাহনে আরোহী অবস্থায় কিবলার দিকে মুখ করে বা যেদিকে সম্ভব মুখ করে সালাত আদায় করবে। ইমাম মালিক (রহ.) বলেন, ইমাম নাফি‘ (রহ.) বলেন, আমি অবশ্য মনে করি ইবনু ‘উমার (রাঃ) নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম থেকে শুনেই এই হাদীস বর্ণনা করেছেন। [৯৪২] (আধুনিক প্রকাশনীঃ ৪১৭৫, ইসলামিক ফাউন্ডেশনঃ ৪১৭৬)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 58
			}
		}
	]
}