{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4547,
			"arabicnumber": 4547,
			"text": "سُوْرَةُ آلِ عِمْرَانَ সূরাহ (৩) : আলে ‘ইমরান تُقَاةٌ وَتَقِيَّةٌ وَاحِدَةٌ (صِرٌّ) : بَرْدٌ. (شَفَا حُفْرَةٍ) مِثْلُ شَفَا الرَّكِيَّةِ وَهْوَ حَرْفُهَا (تُبَوِّئُ) تَتَّخِذُ مُعَسْكَرًا. الْمُسَوَّمُ الَّذِيْ لَهُ سِيْمَاءٌ بِعَلَامَةٍ أَوْ بِصُوْفَةٍ، أَوْ بِمَا كَانَ. (رِبِّيُّوْنَ) الْجَمِيْعُ وَالْوَاحِدُ رِبِّيٌّ. (تَحُسُّوْنَهُمْ) : تَسْتَأْصِلُوْنَهُمْ قَتْلًا. (غُزًّا) وَاحِدُهَا غَازٍ. (سَنَكْتُبُ) : سَنَحْفَظُ. (نُزُلًا) ثَوَابًا، وَيَجُوْزُ : وَمُنْزَلٌ مِنْ عِنْدِ اللهِ كَقَوْلِكَ أَنْزَلْتُهُ. وَقَالَ : مُجَاهِدٌ (وَالْخَيْلُ الْمُسَوَّمَةُ) الْمُطَهَّمَةُ الْحِسَانُ. قَالَ سَعِيْدُ بْنُ جُبَيْرٍ : (وَحَصُوْرًا) لَا يَأْتِي النِّسَاءَ. وَقَالَ عِكْرِمَةُ : مِنْ (فَوْرِهِمْ) مِنْ غَضَبِهِمْ يَوْمَ بَدْرٍ. وَقَالَ مُجَاهِدٌ : (يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ) النُّطْفَةِ تَخْرُجُ مَيِّتَةً وَيُخْرِجُ مِنْهَا الْحَيَّ. (الْإِبْكَارُ) أَوَّلُ الْفَجْرِ، وَالْعَشِيُّ مَيْلُ الشَّمْسِ- أُرَاهُ- إِلَى أَنْ تَغْرُبَ. تُقَاةٌ وَتَقِيَّةٌ একই অর্থে ব্যবহৃত অর্থাৎ ভীতি ও সংযম, صِرٌّ ঠান্ডা। شَفَا حُفْرَةٍ কথাটি شَفَا الرَّكِيَّةِ এর মত অর্থাৎ গর্তের কিনারা। تُبَوِّئُ অস্ত্রে সজ্জিত সৈনিককে সারিবদ্ধ করছিল। الْمُسَوَّم কোন প্রতীক কিংবা অন্য কিছু দ্বারা চিহ্নিত করা। رِبِّيُّوْنَ বহুবচন। একবচনে رِبِّيٌّ আল্লাহ তা‘আলা ও আল্লাহ্পন্থী। تَحُسُّوْنَهُمْ তোমরা তাদের হত্যার দ্বারা সমূলে উৎপাটিত করছিলে। غُزًّا বহুবচন। একবচনে غَازٍ যোদ্ধা। سَنَكْتُبُ অচিরে আমি সংরক্ষণ করব। نُزُلًا প্রতিদান ও আতিথেয়তা হিসাবে। مُنْزَلٌ مِنْ عِنْدِ اللهِ পড়াও বৈধ। মুফাস্সির ইমাম মুজাহিদ (রহ.)-এর মতে الْخَيْلُ الْمُسَوَّمَةُ পরিপূর্ণ সুন্দর অশ্বপাল, ইবনু যুবায়র (রাঃ) বলেন, حَصُوْرًا কামভাব নিয়ে কোন মহিলার কাছে যায় না। ‘ইকরামাহ (রাঃ) বলেন, فَوْرِهِمْ বদরের দিনে তাদের ক্রোধ নিয়ে, মুজাহিদ (রহ.) বলেন, يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ নিষ্প্রাণ বীর্য নির্গত হয় এরপর তা থেকে জীবিত বের হয়। الإِبْكَارُ ঊষাকাল। وَالْعَشِيُّ সূর্য ঢলে যাওয়া থেকে সূর্যাস্ত পর্যন্ত। وَقَالَ مُجَاهِدٌ : الْحَلَالُ وَالْحَرَامُ. (وَأُخَرُ مُتَشَابِهَاتٌ) يُصَدِّقُ بَعْضُهُ بَعْضًا، كَقَوْلِهِ تَعَالَى :(وَمَا يُضِلُّ بِهٰٓإِلَّا الْفَاسِقِيْنَ) وَكَقَوْلِهِ جَلَّ ذِكْرُهُ (وَيَجْعَلُ الرِّجْسَ عَلَى الَّذِيْنَ لَا يَعْقِلُوْنَ) وَكَقَوْلِهِ تَعَالَى: (وَالَّذِيْنَ اهْتَدَوْا زَادَهُمْ هُدًى وَّاٰتَاهُمْ تَقْوٰهُمْ) (زَيْغٌ) : شَكٌّ. (ابْتِغَآءَ الْفِتْنَةِ)الْمُشْتَبِهَاتِ. (وَالرَّاسِخُوْنَ)يَعْلَمُوْنَ. (يَقُوْلُوْنَ اٰمَنَّا بِهِ). ইমাম মুজাহিদ (রহ.) বলেন যে, সেটি হচ্ছে হালাল আর হারাম সম্পর্কিত। وَأُخَرُ مُتَشَابِهَاتٌ আর অন্যগুলো রূপক, একটি অন্যটির সত্যতা প্রমাণ করে। যেমনঃ আল্লাহর বাণীঃ وَمَا يُضِلُّ بِهٰٓ إِلَّا الْفَاسِقِيْنَ -‘‘তিনি পথ পরিত্যাগকারী ব্যতীত বস্তুত কাউকে বিভ্রান্ত করেন না।’’ আবার- وَيَجْعَلُ الرِّجْسَ عَلَى الَّذِيْنَ لَا يَعْقِلُوْنَ যারা অনুধাবন করে না আল্লাহ তাদের কলুষলিপ্ত করেন। (সূরাহ ইউনুস ১০/১০০) তদুপরি আল্লাহর বাণীঃ وَالَّذِيْنَ اهْتَدَوْا زَادَهُمْ هُدًى وَّاٰتَاهُمْ تَقْوٰهُمْ ‘‘যারা সৎপথ অবলম্বন করেছে, আল্লাহ্ তাদেরকে আরও অধিক হিদায়াত দান করেন এবং তাদেরকে তাকওয়ার তাওফীক দেন’’- (সূরাহ মুহাম্মাদ ৪৭/১৭)। زَيْغٌ -সন্দেহ, ابْتِغَاءَ الْفِتْنَةِ -ফিতনা শব্দের অর্থ রূপক। وَالرَّاسِخُوْنَ যাঁরা জ্ঞানে সু-গভীর তারা জানে এবং বলে আমরা তা বিশ্বাস করি। ৪৫৪৭. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আয়াতটি هُوَ الَّذِيْٓ أَنْزَلَ عَلَيْكَ الْكِتَابَ ........ إِلَّا أُولُو الْأَلْبَابِ ‘‘তিনিই তোমার প্রতি এ কিতাব অবতীর্ণ করেছেন যার কতক আয়াত সুস্পষ্ট, দ্ব্যর্থহীন। এগুলো কিতাবের মূল অংশ; আর অন্যগুলো রূপক; যাদের অন্তরে সত্য-লঙ্ঘন প্রবণতা রয়েছে শুধু তারাই ফিতনা এবং ভুল ব্যাখ্যার উদ্দেশে যা রূপক তার অনুসরণ করে। আল্লাহ ব্যতীত অন্য কেউ এর ব্যাখ্যা জানে না। আর যারা জ্ঞানে সুগভীর, তাঁরা বলেন, আর যারা জ্ঞানে সুগভীর তারা বলেঃ আমরা এতে ঈমান এনেছি, এসবই আমাদের প্রভুর তরফ থেকে এসেছে। জ্ঞানবানরা ব্যতীত কেউ নাসীহাত গ্রহণ করে না’’- (সূরাহ আলে ইমরান ৩/৭) নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম পাঠ করলেন। ‘আয়িশাহ (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম ঘোষণা করেছেন যে, যারা মুতাশাবাহাত আয়াতের পেছনে ছুটে তাদের যখন তুমি দেখবে তখন মনে করবে যে, তাদের কথাই আল্লাহ তা‘আলা কুরআনে বলেছেন। সুতরাং তাদের ব্যাপারে সাবধান থাকবে। [মুসলিম ৪৭/১, হাঃ ২৬৬৫, আহমাদ ২৬২৫৭] (আধুনিক প্রকাশনীঃ ৪১৮৭, ইসলামিক ফাউন্ডেশনঃ ৪১৮৮)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 70
			}
		}
	]
}