{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4553,
			"arabicnumber": 4553,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আবূ সুফ্ইয়ান (রাঃ) আমাকে সামনাসামনি হাদীস শুনিয়েছেন। আবূ সুফ্ইয়ান বলেন, আমাদের আর রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর মধ্যে সম্পাদিত চুক্তির মেয়াদকালে আমি ভ্রমণে বের হয়েছিলাম। আমি তখন সিরিয়ায় অবস্থান করছিলাম। তখন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর পক্ষ থেকে হিরাক্লিয়াসের নিকট একখানা পত্র পৌঁছান হল। দাহ্ইয়াতুল কালবী এ চিঠিটা বসরার শাসককে দিয়েছিলেন। এরপর তিনি হিরাক্লিয়াসের নিকট পৌঁছিয়ে দিলেন। পত্র পেয়ে হিরাক্লিয়াস বললেন, নবীর দাবীদার ব্যক্তির গোত্রের কেউ এখানে আছে কি? তারা বলল, হ্যাঁ আছে। কয়েকজন কুরাইশীসহ আমাকে ডাকা হলে আমরা হিরাক্লিয়াসের নিকট গেলাম এবং আমাদেরকে তাঁর সম্মুখে বসানো হল। এরপর তিনি বললেন, নবীর দাবীদার ব্যক্তির তোমাদের মধ্যে নিকটতম আত্মীয় কে? আবূ সুফ্ইয়ান বলেন, উত্তরে বললাম, আমিই। তারা আমাকে তার সম্মুখে এবং আমার সাথীদেরকে আমার পেছনে বসালেন। তারপর দোভাষীকে ডাকলেন এবং বললেন, এদেরকে জানিয়ে দাও যে, আমি নবীর দাবীদার ব্যক্তিটি সম্পর্কে (আবূ সুফ্ইয়ানকে) কিছু জিজ্ঞেস করলে সে যদি আমার নিকট মিথ্যা বলে তোমরা তার মিথ্যা বলা সম্পর্কে ধরবে। আবূ সুফ্ইয়ান বলেন, যদি তাদের পক্ষ থেকে আমাকে মিথ্যুক প্রমাণের আশঙ্কা না থাকত তাহলে আমি অবশ্যই মিথ্যা বলতাম। এরপর দোভাষীকে বললেন, একে জিজ্ঞেস কর যে, তোমাদের মধ্যে এ ব্যক্তির বংশ মর্যাদা কেমন? আবূ সুফ্ইয়ান বললেন, তিনি আমাদের মধ্যে অভিজাত বংশের অধিকারী। তিনি জিজ্ঞেস করলেন যে, তাঁর পূর্বপুরুষদের কেউ কি রাজা-বাদশাহ ছিলেন? আমি বললাম, না। তিনি জিজ্ঞেস করলেন, তাঁর বর্তমানের কথাবার্তার পূর্বে তোমরা তাঁকে কখনো মিথ্যাচারের অপবাদ দিয়েছ কি? আমি বললাম, না। তিনি বললেন, সম্ভ্রান্ত ব্যক্তিরা তাঁর অনুসরণ করছে, না দুর্বলগণ? আমি বললাম, বরং দুর্বলগণ। তিনি বললেন, তাদের সংখ্যা বাড়ছে না কমছে। আমি বললাম, বরং বৃদ্ধি পাচ্ছে। তিনি বললেন, তাঁর ধর্মে প্রবিষ্ট হওয়ার পর তাঁর প্রতি বিতৃষ্ণাবশতঃ কেউ কি ধর্ম ত্যাগ করে? আমি বললাম, না। তিনি বললেন, তোমরা তাঁর বিরুদ্ধে কোন যুদ্ধ করেছ কি? বললাম, জ্বী হ্যাঁ। তিনি বললেন, তাঁর বিরুদ্ধে যুদ্ধের ফলাফল কী হয়েছে? আমি বললাম, আমাদের ও তাদের মধ্যে যুদ্ধের ফলাফল হলঃ একবার তিনি জয়ী হন, আর একবার আমরা জয়ী হই। তিনি বললেন, তিনি প্রতিশ্রতি ভঙ্গ করেননি? বললাম, না। তবে বর্তমানে আমরা একটি সন্ধির মেয়াদে আছি। দেখি এতে তিনি কী করেন। আবূ সুফ্ইয়ান বলেন, আল্লাহর শপথ! এটি ব্যতীত অন্য কোন কথা ঢুকিয়ে দেয়া আমার পক্ষে সম্ভব হয়নি। বললেন, তাঁর পূর্বে এমন কথা কেউ বলেছে কি? বললাম, না। তারপর তিনি তাঁর দোভাষীকে বললেন যে, একে জানিয়ে দাও যে, আমি তোমাকে তোমাদের মধ্যে সে ব্যক্তির বংশমর্যাদা সম্পর্কে জিজ্ঞেস করেছিলাম। তারপর তুমি বলেছ যে, সে আমাদের মধ্যে সম্ভ্রান্ত। তদ্রূপ রাসূলগণ শ্রেষ্ঠ বংশেই জন্মলাভ করে থাকেন। আমি জিজ্ঞেস করেছিলাম যে, তাঁর পূর্বপুরুষের কেউ রাজা-বাদশাহ ছিলেন কিনা? তুমি বলেছ ‘না’। তাই আমি বলছি যে, যদি তাঁর পূর্বপুরুষদের কেউ রাজা-বাদশাহ থাকতেন তাহলে বলতাম, তিনি তাঁর পূর্বপুরুষদের রাজত্ব ফিরে পেতে চাচ্ছেন। আমি তোমাকে জিজ্ঞেস করেছিলাম যে, দুর্বলগণ তাঁর অনুসারী, না সম্ভ্রান্তগণ? তুমি বলেছ, দুর্বলগণই। আমি বলেছি যে, যুগে যুগে দুর্বলগণই রাসূলদের অনুসারী হয়ে থাকে। আমি জিজ্ঞেস করেছিলাম যে, এ দাবীর পূর্বে তোমরা কখনও তাঁকে মিথ্যাবাদিতার অপবাদ দিয়েছিলে কি? তুমি উত্তরে বলেছ যে, না। তাতে আমি বুঝেছি যে, যে ব্যক্তি প্রথমে মানুষদের সঙ্গে মিথ্যাচার ত্যাগ করেন, তারপর আল্লাহর সঙ্গে মিথ্যাচারিতা করবেন, তা হতে পারে না। আমি তোমাদের জিজ্ঞেস করেছিলাম যে, তাঁর ধর্মে দীক্ষিত হওয়ার পর তাঁর প্রতি বিরক্ত হয়ে কেউ ধর্ম ত্যাগ করে কিনা? তুমি বলেছ, ক্রমশ বৃদ্ধি পাচ্ছে। আমি বলছি, ঈমান এভাবেই পূর্ণতা লাভ করে। আমি জিজ্ঞেস করেছিলাম যে, তোমরা তাঁর বিরুদ্ধে যুদ্ধ করেছ কি? তুমি বলেছ যে, যুদ্ধ করেছ এবং তাঁর ফলাফল হচ্ছে পানি তোলার বালতির মত। কখনো তোমাদের বিরুদ্ধে তারা জয়লাভ করে আবার কখনো তাদের বিরুদ্ধে তোমরা জয়লাভ কর। এমনিভাবেই রাসূলদের পরীক্ষা করা হয়, তারপর চূড়ান্ত বিজয় তাদেরই হয়ে থাকে। আমি জিজ্ঞেস করেছিলাম, তিনি প্রতিজ্ঞা ভঙ্গ করেন কিনা? তুমি বলেছ, না। তদ্রূপ রাসূলগণ প্রতিজ্ঞা ভঙ্গ করেন না। আমি জিজ্ঞেস করেছিলাম, তাঁর পূর্বে কেউ এ দাবী উত্থাপন করেছিল কিনা? তুমি বলেছ, না। আমি বলি যদি কেউ তাঁর পূর্বে এ ধরনের দাবী করে থাকত তাহলে আমি মনে করতাম এ ব্যক্তি পূর্ববর্তী দাবীর অনুসরণ করছে। আবূ সুফ্ইয়ান বলেন, তারপর তিনি জিজ্ঞেস করলেন, তিনি তোমাদের কী কাজের হুকুম দেন? আমি বললাম, সালাত কায়িম করতে, যাকাত প্রদান করতে, আত্মীয়তা রক্ষা করতে এবং পাপকাজ থেকে পবিত্র থাকার হুকুম দেন। হিরাক্লিয়াস বললেন, তাঁর সম্পর্কে তোমার বক্তব্য যদি সঠিক হয়, তাহলে তিনি ঠিকই নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম, তিনি আবির্ভূত হবেন তা আমি জানতাম বটে তবে তোমাদের মধ্যে আবির্ভূত হবেন তা মনে করিনি। যদি আমি তাঁর সান্নিধ্যে পৌঁছার সুযোগ পেতাম তাহলে আমি তাঁর সাক্ষাৎকে অগ্রাধিকার দিতাম। যদি আমি তাঁর নিকট অবস্থান করতাম তাহলে আমি তাঁর পদযুগল ধুয়ে দিতাম। আমার পায়ের নিচের জমিন পর্যন্ত তাঁর রাজত্ব সীমা পৌঁছে যাবে। আবূ সুফ্ইয়ান বলেন, তারপর হিরাক্লিয়াস রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর পত্রখানি আনতে বললেন। এরপর পাঠ করতে বললেন। তাতে লেখা ছিলঃ দয়াময় পরম দয়ালু আল্লাহর নামে, আল্লাহর রাসূল মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর পক্ষ থেকে রোমের অধিপতি হিরাক্লিয়াসের প্রতি। হিদায়াতের অনুসারীর প্রতি শান্তি বর্ষিত হোক। এরপর আমি আপনাকে ইসলামের দাওয়াত দিচ্ছি, ইসলাম গ্রহণ করুন, মুক্তি পাবেন। ইসলাম গ্রহণ করুন, আল্লাহ তা‘আলা আপনাকে দ্বিগুণ প্রতিদান দেবেন। আর যদি মুখ ফিরিয়ে থাকেন তাহলে সকল প্রজার পাপরাশিও আপনার উপর নিপতিত হবে। ‘‘হে কিতাবীগণ! এসো সে কথায়, যা আমাদের ও তোমাদের মধ্যে একই যে, আমরা আল্লাহ ব্যতীত অন্য কারো ‘ইবাদাত করব না, কোন কিছুতেই তাঁর সঙ্গে শরীক করব না। আর আমাদের একে অন্যকে আল্লাহ ব্যতীত প্রতিপালকরূপে গ্রহণ করব না। যদি তারা মুখ ফিরিয়ে নেয় তবে বল, তোমরা সাক্ষী থাক, আমরা মুসলিম।’’ যখন তিনি পত্র পাঠ সমাপ্ত করলেন চতুর্দিকে উচ্চ রব উঠল এবং গুঞ্জন বৃদ্ধি পেল। তারপর তাঁর নির্দেশে আমাদের বাইরে নিয়ে আসা হল। আবূ সুফ্ইয়ান বলেন, আমরা বেরিয়ে আসার পর আমি আমার সাথীদের বললাম যে, আবূ কাবশার সন্তানের তো বিস্তার ঘটেছে। রোমের রাষ্ট্রনায়ক পর্যন্ত তাঁকে ভয় পায়। তখন থেকে আমার মনে এ দৃঢ় বিশ্বাস জন্মেছিল যে, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর দ্বীন অতি সত্বর বিজয় লাভ করবে। শেষ পর্যন্ত আল্লাহ তা‘আলা আমাকে ইসলামে দীক্ষিত করলেন। ইমাম যুহরী (রহ.) বলেন, তারপর হিরাক্লিয়াস রোমের নেতৃবৃন্দকে ডেকে একটি কক্ষে একত্রিত করলেন এবং বললেন, হে রোমবাসী! তোমরা কি আজীবন সৎপথ ও সফলতার প্রত্যাশী এবং তোমরা কি চাও তোমাদের রাজত্ব অটুট থাকুক? এতে তারা বন্য-গর্দভের মত প্রাণপণে পলায়নরত হল। কিন্তু দরজাগুলো সবই বন্ধ পেল। এরপর বাদশাহ নির্দেশ দিলেন যে, তাদের সবাইকে আমার নিকট নিয়ে এসো। তিনি তাদের সবাইকে ডাকলেন এবং বললেন, তোমাদের ধর্মের উপর তোমাদের দৃঢ়তা আমি পরীক্ষা করলাম। আমি যা আশা করেছিলাম তা তোমাদের থেকে পেয়েছি। তখন সবাই তাঁকে সিজদা্ করল এবং তাঁর উপর সন্তুষ্ট রইল। [৭] (আধুনিক প্রকাশনীঃ ৪১৯২, ইসলামিক ফাউন্ডেশনঃ ৪১৯৩)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 75
			}
		}
	]
}