{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4606,
			"arabicnumber": 4606,
			"text": "سُوْرَةُ الْمَائِدَةِ সূরাহ (৫) : আল-মায়িদাহ 65/5/1. بَاب تَفْسِيْرِ ৬৫/৫/১. অধ্যায়: তাফসীর (حُرُمٌ) : وَاحِدُهَا حَرَامٌ (فَبِمَا نَقْضِهِمْ مِّيْثَقَهُمْ بِنَقْضِهِمُ الَّتِيْ كَتَبَ اللهُ): جَعَلَ اللهُ (تَبُوْٓءُ): تَحْمِلُ. (دَآئِرَةٌ) : دَوْلَةٌ. وَقَالَ غَيْرُهُ : الإِغْرَاءُ التَّسْلِيْطُ (أُجُوْرَهُنَّ) : مُهُوْرَهُنَّ. (الْمُهَيْمِنُ) : الْأمِيْنُ، القُرْآنُ أمِيْنُ عَلَى كُلِّ كِتابٍ قَبْلَهُ. قَالَ سُفْيَانُ : مَا فِي الْقُرْآنِ آيَةٌ أَشَدُّ عَلَيَّ مِنْ (لَسْتُمْ عَلٰى شَيْءٍ حَتّٰى تُقِيْمُوا التَّوْرَاةَ وَالْإِنْجِيْلَ وَمَآ أُنْزِلَ إِلَيْكُمْ مِّنْ رَّبِّكُمْ مَّخْمَصَةٍ) مَجَاعَةٍ، (مَنْ أَحْيَاهَا) : يَعْنِيْ مَنْ حَرَّمَ قَتْلَهَا إِلَّا بِحَقٍّ حَيِيَ النَّاسُ مِنْهُ جَمِيْعًا. (شِرْعَةً وَمِنْهَاجًا) سَبِيْلًا وَسُنَّةً. فَإنْ (عَشُرَ) : ظَهَرَ. ا(لأوْلَيانِ) وَاحِدُها : أوْلَى. حُرُمٌ একবচনে حَرَامٌ নিষিদ্ধ অবস্থায় (আল-মায়িদাহ ৫/১), فَبِمَا نَقْضِهِمْ তাদের প্রতিশ্রুতি ভঙ্গের কারণ (আল-মায়িদাহ ৫/১৩), الَّتِيْ كَتَبَ اللهُ যা আল্লাহ নির্ধারণ করেছেন, تَبُوْءُ বহন করবে, অন্য একজন বলেছেন الإِغْرَاءُ শক্তিশালী করে দেয়া, دَائِرَةٌ ওলট-পালট, أُجُوْرَهُنَّ তাদের মাহর, مَخْمَصَةٍ ক্ষুধার তাড়নায় (আল-মায়িদাহ ৫/৩)। আপনি বলে দিনঃ হে আহলে কিতাব! তোমরা কোন কিছুর উপরই প্রতিষ্ঠিত নও, যতক্ষণ পর্যন্ত না পুরোপুরি পালন করবে তাওরাত, ইন্জীল ও তোমাদের প্রতি তোমাদের রবের তরফ থেকে যা অবতীর্ণ করা হয়েছে তা। (সূরাহ আল-মায়িদাহ ৫/৬৮) সুফ্ইয়ান সাওরী (রহঃ) বলেন, আমার দৃষ্টিতে কুরআন মাজীদে لَسْتُمْ عَلٰى شَيْءٍ حَتّٰى تُقِيْمُوا التَّوْرَاةَ وَالْإِنْجِيْلَ وَمَآ أُنْزِلَ إِلَيْكُمْ مِّنْ رَّبِّكُمْ مَّخْمَصَةٍ আয়াতটির চেয়ে কঠোর অন্য কোন আয়াত নেই। مَنْ أَحْيَاهَا -আর যে কেউ কারো জীবন রক্ষা করল, সে যেন সমস্ত মানুষের জীবন রক্ষা করল- (সূরাহ আল-মায়িদাহ ৫/৩২)। شِرْعَةً وَمِنْهَاجًا -আইন ও স্পষ্ট পথ, নিয়ম- (সূরাহ আল-মায়িদাহ ৫/৪৮) مُهَيْمِنُ- আমানতদার, কুরআন তার পূর্বের কিতাবসমূহের আমানতদার। (সূরাহ আল-মায়িদাহ ৫/৪৮) وَقَالَ ابْنُ عَبَّاسٍ : (مَخْمَصَةٍ) مَجَاعَةٍ. ইবনু ‘আব্বাস (রাঃ) বলেন, مَخْمَصَةٍ ক্ষুধা/অভাব অনটন। ৪৬০৬. ত্বরিক ইবনু শিহাব হতে বর্ণিত। ইয়াহূদীগণ ‘উমার ফারূক (রাঃ)-কে বলল যে, আপনারা এমন একটি আয়াত পড়ে থাকেন তা যদি আমাদের মধ্যে নাযিল হত, তবে আমরা সেটাকে ‘‘ঈদ’’ হিসেবে গ্রহণ করতাম। ‘উমার (রাঃ) বললেন, আমি জানি এটা কখন নাযিল হয়েছে, কোথায় নাযিল হয়েছে এবং নাযিলের সময় রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম কোথায় ছিলেন, আয়াতটি আরাফাতের দিন নাযিল হয়েছিল। আল্লাহর শপথ আমরা সবাই ‘আরাফাতে ছিলাম, সেই আয়াতটি হল-الْيَوْمَ أَكْمَلْتُ لَكُمْ دِيْنَكُمْ আজ আমি তোমাদের জন্য তোমাদের দ্বীনকে পূর্ণ করে দিলাম। সুফ্ইয়ান সাওরী বলেন, সে দিনটি শুক্রবার ছিল কিনা এ ব্যাপারে আমার সন্দেহ আছে। [৪৫] (আধুনিক প্রকাশনীঃ ৪২৪৫, ইসলামিক ফাউন্ডেশনঃ ৪২৪৮)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 128
			}
		}
	]
}