{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4607,
			"arabicnumber": 4607,
			"text": "(تَيَمَّمُوْا) : تَعَمَّدُوْا. آمِّيْنَ : عَامِدِيْنَ أَمَّمْتُ وَتَيَمَّمْتُ وَاحِدٌ. وَقَالَ ابْنُ عَبَّاسٍ : لَمَسْتُمْ وَ تَمَسُّوْهُنَّ وَ اللَّاتِيْ دَخَلْتُمْ بِهِنَّ، وَالإِفْضَاءُ : النِّكَاحُ. تَيَمَّمُوْا তোমরা ইচ্ছে করবে, آمِّيْنَ উদ্দেশ্য করে, أَمَّمْتُ আর تَيَمَّمْتُ একই, আমি ইচ্ছে করেছি, ইবনু ‘আব্বাস (রাঃ) বলেন- وَ اللَّاتِيْ دَخَلْتُمْ بِهِنَّ، تَمَسُّوْهُنَّ، لَمَسْتُمْ এবং وَالإِفْضَاءُ এই চারটিরই অর্থ সহবাস করা। ৪৬০৭. নবী-পত্নী ‘আয়িশাহ (রাঃ) বলেছেন যে, আমরা রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সঙ্গে এক সফরে বের হলাম, বাইদা কিংবা যাতুল জাইশ নামক স্থানে পৌঁছার পর আমার গলার হার হারিয়ে গেল। তা খোঁজার জন্যে রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম সেখানে অবস্থান করলেন এবং লোকেরাও তাঁর সঙ্গে অবস্থান করল। সেখানেও কোন পানি ছিল না এবং তাদের সঙ্গেও পানি ছিল না। এরপর লোকেরা আবূ বাকর (রাঃ)-এর কাছে আসল এবং বলল, ‘আয়িশাহ (রাঃ) যা করেছেন আপনি তা দেখেছেন কি? রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম এবং সকল লোকটি আটকিয়ে রেখেছেন, অথচ সেখানেও পানি নেই আবার তাদের সঙ্গেও পানি নেই। রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমার উরুতে মাথা রেখে ঘুমাচ্ছিলেন। এমতাবস্থায় আবূ বাকর (রাঃ) এলেন এবং বললেন, তুমি রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম এবং সকল লোককে আটকে রেখেছো অথচ সেখানেও পানি নেই আবার তাদের সঙ্গেও পানি নেই। ‘আয়িশাহ (রাঃ) বলেন যে, আবূ বাকর (রাঃ) আমাকে দোষারোপ করলেন এবং আল্লাহ যা চেয়েছেন তা বলেছেন এবং তাঁর অঙ্গুলি দিয়ে আমার কোমরে ধাক্কা দিতে লাগলেন, আমার কোলে রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর অবস্থানই আমাকে নড়াচড়া করতে বাধা দিল। পানিবিহীন অবস্থায় ভোরে রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম ঘুম থেকে উঠলেন। তখন আল্লাহ তা‘আলা তায়াম্মুমের আয়াত অবতীর্ণ করলেন, তখন সবাই তায়াম্মুম করল। তখন উসাইদ ইবনু হুযাইর বললেন, হে আবূ বাকর-এর বংশধর! এটাই আপনাদের কারণে পাওয়া প্রথম বারাকাত নয়। ‘আয়িশাহ (রাঃ) বললেন, যে উটের উপর আমি ছিলাম, তাকে আমরা উঠালাম তখন দেখি হারটি তার নিচে। [৩৩৪] (আধুনিক প্রকাশনীঃ ৪২৪৬, ইসলামিক ফাউন্ডেশনঃ ৪২৪৯)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 129
			}
		}
	]
}