{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4627,
			"arabicnumber": 4627,
			"text": "سُوْرَةُ الْأَنْعَامِ সূরাহ (৬) : আল-আন‘আম قَالَ ابْنُ عَبَّاسٍ ثُمَّ لَمْ تَكُنْ (فِتْنَتُهُمْ) مَعْذِرَتُهُمْ (مَعْرُوْشَاتٍ) مَا يُعْرَشُ مِنَ الْكَرْمِ وَغَيْرِ ذَلِكَ (حَمُوْلَةً) مَا يُحْمَلُ عَلَيْهَا (وَلَلَبَسْنَا) لَشَبَّهْنَا (وَيَنْأَوْنَ) يَتَبَاعَدُوْنَ (تُبْسَلُ)تُفْضَحُ أُبْسِلُوْا أُفْضِحُوْا (بَاسِطُوْأَيْدِيْهِمْ) الْبَسْطُ الضَّرْبُ وَقَوْلُهُ (اسْتَكْثَرْتُمْ) مِنَ الإِنْسِ أَضْلَلْتُمْ كَثِيْرًا مِمَّا (ذَرَأَ مِنَالْحَرْثِ) جَعَلُوْا لِلهِ مِنْ ثَمَرَاتِهِمْ وَمَالِهِمْ نَصِيْبًا وَلِلشَّيْطَانِ وَالأَوْثَانِ نَصِيْبًا (أَكِنَّةً) وَاحِدُهَا كِنَانٌ (أَمَّا اشْتَمَلَتْ عَلَيْهِ أرْحَامُ أُنْثَييْنِ) يَعْنِيْ هَلْ تَشْتَمِلُ إِلَّا عَلَى ذَكَرٍ أَوْ أُنْثَى فَلِمَ تُحَرِّمُوْنَ بَعْضًا وَتُحِلُّوْنَ بَعْضًا (مَسْفُوْحًا) مُهْرَاقًا (صَدَفَ) أَعْرَضَ (أُبْلِسُوْا) أُوْيِسُوْا (وَأُبْسِلُوْا) أُسْلِمُوْا (سَرْمَدًا)دَائِمًا (اسْتَهْوَتْهُ) أَضَلَّتْهُ (تَمْتَرُوْنَ) تَشُكُّوْنَ (وَقْرٌ) صَمَمٌ وَأَمَّا الْوِقْرُ فَإِنَّهُ الْحِمْلُ (أَسَاطِيْرُ) وَاحِدُهَا أُسْطُوْرَةٌ وَإِسْطَارَةٌ وَهْيَ التُّرَّهَاتُ (الْبَأْسَاءُ) مِنَ الْبَأْسِ وَيَكُوْنُ مِنَ الْبُؤْسِ (جَهْرَةً) مُعَايَنَةً (الصُّوَرُ) جَمَاعَةُ صُوْرَةٍ كَقَوْلِهِ سُوْرَةٌ وَسُوَرٌ (مَلَكُوْتٌ) مُلْكٌ مِثْلُ رَهَبُوْتٍ خَيْرٌ مِنْ رَحَمُوْتٍ وَيَقُوْلُ تُرْهَبُ خَيْرٌ مِنْ أَنْ تُرْحَمَ وَإِنْ تَعْدِلْ تُقْسِطْ لَا يُقْبَلْ مِنْهَا فِيْ ذَلِكَ الْيَوْمِ (جَنَّ) أَظْلَمَ (تَعَالَى) عَلَا (وَإنْتَعْدِلْ) تٌقْسِطْ لا يُقْبَلْ مِنْهَا فِيْ ذَلِكَ اليَوْمِ. يُقَالُ عَلَى اللهِ حُسْبَانُهُ أَيْ حِسَابُهُ وَيُقَالُ (حُسْبَانًا) مَرَامِيَ وَ (رُجُوْمًا لِّلشَّيَاطِيْنِمُسْتَقِرٌّ) فِي الصُّلْبِ (وَمُسْتَوْدَعٌ) فِي الرَّحِمِ الْقِنْوُ الْعِذْقُ وَالِاثْنَانِ (قِنْوَانِ) وَالْجَمَاعَةُ أَيْضًا قِنْوَانٌ مِثْلُ صِنْوٍ وَ صِنْوَانٍ. ইবনে ‘আব্বাস (রাঃ) বলেছেন, فِتْنَتُهُمْ ওযর পেশ করা, অক্ষমতা পেশ করা, مَعْرُوْشَاتٍ আঙ্গুরলতা ইত্যাদি যেগুলোকে উঁচুতে তুলে দেয়া হয়, لاُنْذِرَكُمْبِهِ তোমাদেরকে কথা দ্বারা সতর্ক করার জন্য, অর্থাৎ মক্কাবাসীকে, حَمُوْلَةً বহনকারী, لَلَبَسْنَ আমি তাদেরকে বিভ্রমে ফেলতাম,َيَنْأَوْنَ তারা দূরে থাকে, تُبْسَلُ অপমানিত হওয়া, أُبْسِلُوْا তারা অপমানিত হয়েছে, الْبَسْطُ-بَاسِطُوْأَيْدِيْهِمْ আঘাত করা, اسْتَكْثَرْتُمْ অনেককেই বিপথগামী করেছ, ذَرَأَ مِنَ الْحَرْثِ তাদের ফল-মূল ও ধন-সম্পদ থেকে এক অংশ আল্লাহর জন্যে নির্ধারণ করেছে আর একাংশ শায়ত্বন ও দেব-দেবীর জন্য। أَمَّا اشْتَمَلَتْ অর্থাৎ জরায়ুতে নর কিংবা মাদী ব্যতীত অন্য কিছু থাকে কি? সূতরাং কেন তোমরা কতক হারাম আবার কতক হালাল কর? مَسْفُوْحًا প্রবাহিত, صَدَفَ মুখ ফিরিয়েছে, أُبْلِسُوْا তারা নিরাশ হয়েছে, أُبْلِسُوْا সমর্পণ করা হয়েছে, سَرْمَدًا অনন্তকাল, اسْتَهْوَتْهُ তাকে বিপথগামী করেছে, تَمْتَرُوْنَ তোমরা সন্দেহ পোষণ করছ, وَقْرٌ বধিরতা, তবে الْوِقْرُ মানে বোঝা, أَسَاطِيْرُ বহুবচন, এক বচনে أُسْطُوْرَةٌ এবং إِسْطَارَةٌ মিথ্যা গল্প, الْبَأْسَاءُ কঠোরতা بَأْسٌ থেকে উৎপন্ন কখনো কখনো بُأْسٌ থেকে আসে, جَهْرَةً সরাসরি, الصُّوَرُ হচ্ছে صُوْرَةٍ-এর বহু বচন, যেমন سَوْرَةٌ এর বহু বচন سَوَر।مُلْك-مَلَكُوْتٌ রাজত্ব যেমন رَحْمَةٌ থেকে رَحْمُوْةٌ থেকে رَهْبُ থেকে رَهْبُوْتٌ আরবে প্রবাদ আছে جَنَّ ارَهْبُوْتٌ خَيْرٌ مِنْ رَحْمُوْتٌ - تُرْهَبُ خَيْرٌ مِنْ اَنْ تُرْحَمَ অন্ধকার হল, عَلَى اللهِ حُسْبَانُهُ মানে তার হিসাব আল্লাহর কাছে কখনো কখনো বা হয়, حُسْبَانًا মানে শায়ত্বনের জন্যে অগ্নি স্ফুলিঙ্গ উৎক্ষেপণ এবং উল্কাপিন্ড। مُسْتَقِرٌ পৃষ্ঠে অবস্থান, مُسْتَوْدَعٌ জরায়ুতে অবস্থান, الْقِنْوُ কাঁদি, দ্বিবচনে قِنْوَانُ বহুবচনেরও قِنْوَانُ যেমন صِنْوَانِ-صِنْوٍ। ৪৬২৭. সালিম ইবনু ‘আবদুল্লাহ (রহঃ) তাঁর পিতা থেকে বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেছেন, অদৃশ্যের চাবি পাঁচটি- ‘‘নিশ্চয় আল্লাহরই কাছে রয়েছে ক্বিয়ামাত (কিয়ামত) সম্বন্ধীয় জ্ঞান এবং তিনিই বৃষ্টি বর্ষণ করেন, আর তিনিই জানেন যা কিছু আছে গর্ভাধারে। কেউ জানে না আগামীকল্য সে কী উপার্জন করবে এবং কেউ জানে না কোথায় তার মৃত্যু ঘটবে। নিশ্চয় আল্লাহ সবকিছু জানেন, সব খবর রাখেন’’- (সূরাহ লুকমান ৩১/৩৪)।[১০৩৯] (আধুনিক প্রকাশনীঃ ৪২৬৬, ইসলামিক ফাউন্ডেশনঃ ৪২৬৯)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 149
			}
		}
	]
}