{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4654,
			"arabicnumber": 4654,
			"text": "سُوْرَةُ بَرَاءَةَ সূরাহ (৯) : বারাআত বা আত্-তওবা (وَلِيْجَةً) كُلُّ شَيْءٍ أَدْخَلْتَهُ فِيْ شَيْءٍ (مُرْصَدٌ) طَرِيْقٌ (الشُّقَّةُ)السَّفَرُ (الْخَبَالُ) الْفَسَادُ وَالْخَبَالُ الْمَوْتُ (وَلَاتَفْتِنِّيْ) لَا تُوَبِّخْنِيْ كَرْهًا وَ (كُرْهًا) وَاحِدٌ (مُدَّخَلًا) يُدْخَلُوْنَ فِيْهِ (يَجْمَحُوْنَ)يُسْرِعُوْنَ (وَالْمُؤْتَفِكَاتِ) ائْتَفَكَتْ انْقَلَبَتْ بِهَا الْأَرْضُ (أَهْوَى) أَلْقَاهُ فِيْ هُوَّةٍ (عَدْنٍ)خُلْدٍ عَدَنْتُ بِأَرْضٍ أَيْ أَقَمْتُ وَمِنْهُ مَعْدِنٌ وَيُقَالُ فِيْ مَعْدِنِ صِدْقٍ فِيْ مَنْبَتِ صِدْقٍ (الْخَوَالِفُ) الْخَالِفُ الَّذِيْ خَلَفَنِيْ فَقَعَدَ بَعْدِيْ وَمِنْهُ يَخْلُفُهُ فِي الْغَابِرِيْنَ وَيَجُوْزُ أَنْ يَكُوْنَ النِّسَاءُ مِنَ الْخَالِفَةِ وَإِنْ كَانَ جَمْعَ الذُّكُوْرِ فَإِنَّهُ لَمْ يُوْجَدْ عَلَى تَقْدِيْرِ جَمْعِهِ إِلَّا حَرْفَانِ فَارِسٌ وَفَوَارِسُ وَهَالِكٌ وَهَوَالِكُ (الْخَيْرَاتُ) وَاحِدُهَا خَيْرَةٌ وَهِيَ الْفَوَاضِلُ (مُرْجَئُوْنَ) مُؤَخَّرُوْنَ (الشَّفَا) شَفِيْرٌ وَهُوَ حَدُّهُ وَالْجُرُفُ مَا تَجَرَّفَ مِنْ السُّيُوْلِ وَالأَوْدِيَةِ (هَارٍ) هَائِرٍ لَأَوَّاهٌ شَفَقًا وَفَرَقًا وَقَالَ الشَّاعِرُ. إِذَا قُمْتُ أَرْحَلُهَا بِلَيْلٍ تَأَوَّهُ آهَةَ الرَّجُلِ الْحَزِيْنِ. يُقَالُ : تَهَوَّرَتْ الْبِئْرُ إِذَا انْهَدَمَتْ وَانْهَارَ مِثْلُهُ. وَلِيْجَةً- এমন বস্তু যাকে তুমি আরেকটা বস্তুর মধ্যে ঢুকিয়ে দিলে। الشُّقَّةُ- সফর, ভ্রমণ, الْخَبَالُ- বিশৃঙ্খলা, বিপর্যয়, الْخَبَالُ- মৃত্যু। وَلَاتَفْتِنِّيْ- আমাকে হুমকি দিও না। كَرْهًا-وَ- كُرْهًا- বাধ্যবাধকতা, উভয়টা একই অর্থবোধক, مُدَّخَلًا- প্রবেশস্থল, যেথায় তারা প্রবেশ করবে। يَجْمَحُوْنَ- তারা ত্বরান্বিত করবে। وَالْمُؤْتَفِكَاتِ-যাদের নিয়ে ভূমি উল্টে গেছে। أَهْوَى- তাকে গর্তে নিক্ষেপ করল। عَدْنٍ- স্থায়িত্ব অবস্থান, যেমন, عَدَنْتُبِأَرْضٍ- আমি অবস্থান করলাম, এগুলো থেকে مَعْدِنٍ শব্দ আসছে এবং বলা হয় فِيْ مَعْدِنِ صِدْقٍ -অর্থাৎ সত্যের উৎপত্তিস্থল। الْخَوَالِفُ-الْخَالِفُ- শব্দের বহুবচন অর্থ, যে আমার পিছনে থাকল। এবং আমার পরে বসে থাকল এবং এর অর্থ থেকে يُخْلِفُهُ فِي الْغَابِرِيْنَ- অর্থ, অবশিষ্টদের মধ্যে পিছনে রাখা হয় এবং الْخَالِفَةُ - শব্দের বহুবচন হিসাবে الْخَوَالِفُ স্ত্রীলিঙ্গে ব্যবহার করা বৈধ আছে যদিও তা পুরুষ শব্দের বহুবচন, তা হলে তার এভাবে বহুবচন আরবী ভাষায় দু’টি শব্দ ব্যতীত পাওয়া যায় না, যথা فَارِسٌ- এর বহুবচন فَوَارِسُ এবং هَالِكٌ-এর বহুবচন هَوَالِكُ الْخَيْرَاتُ শব্দের এক বচন خَيْرَةٌ অর্থ, কল্যাণ ও মর্যাদাসম্পন্ন বস্তু। مُرْجَئُوْنَ-বিলম্বিত ব্যক্তিবর্গ। الشَّفَا কিনারা বা পার্শ্ব। الْجُرُفُ- যা উঁচু স্থান বা উপত্যকা থেকে প্রবাহিত হয়। هَائِرٍ-هَارٍ পতিত হওয়া। যেমন বলা হয়, কুয়া ভেঙ্গে পড়েছে যখন তা ধ্বংস হয়ে যায়, আর এরূপভাবে انْهَدَمَتْ শব্দের অর্থ হয়ে থাকে। لَأَوَّاهٌ-অধিক কোমল হৃদয়, ভয়-ভীতির কারণে। কবি বলেন, ‘‘যখন আমি রাতের বেলায় উষ্ট্রীর পিঠে আরোহণ করলাম, তখন সেটি দুশ্চিন্তাগ্রস্থ ব্যক্তির মত দীর্ঘশ্বাস ফেলে আহ! করতে থাকে।’’ 65/9/1. بَاب قَوْلِهِ :(بَرَآءَةٌ مِّنَ اللهِ وَرَسُوْلِهٰٓإِلَى الَّذِيْنَ عٰهَدْتُّمْ مِّنَ الْمُشْرِكِيْنَ) ৬৫/৯/১. অধ্যায়: আল্লাহ্ তা‘আলার বাণীঃ আল্লাহর পক্ষ থেকে এবং তাঁর রাসূলের পক্ষ থেকে দায়মুক্তির ঘোষণা সেসব মুশরিকের সম্পর্কে যাদের সঙ্গে তোমরা সন্ধিচুক্তি করেছিলে। (সূরাহ বারাআত ৯/১) (أَذَانٌ) إِعْلَامٌ. [أشار به إلى قوله تعالى : (وَأَذَنٌ مِّنَ اللهِ وَرَسُوْلِهٰ) وفسره بقوله : إعلام، وهذا ظاهر]. وَقَالَ ابْنُ عَبَّاسٍ (أُذُنٌ) يُصَدِّقُ (تُطَهِّرُهُمْ وَتُزَكِّيْهِمْ بِهَا) وَنَحْوُهَا كَثِيْرٌ وَالزَّكَاةُ الطَّاعَةُ وَالإِخْلَاصُ (لَا يُؤْتُوْنَ الزَّكَاةَ) لَا يَشْهَدُوْنَ أَنْ لَا إِلَهَ إِلَّا اللهُ (يُضَاهُوْنَ) يُشَبِّهُوْنَ ইব্ন ‘আব্বাস (রাঃ) বলেন, أَذَنٌ-কারো কথা শুনে তা সত্য বলে ধারণা করা। تُطَهِّرُهُمْ এবং تُزَكِّيْهِمْ এর একই অর্থ, এ ব্যবহার পদ্ধতি অধিক। সে পবিত্র করে। زَكْوَةٌ ‘ইবাদাত ও নিষ্ঠা لَا يُؤْتُوْنَ الزَّكَاةَ (তারা যাকাত প্রদান করে না) (এবং) তারা এ সাক্ষ্যও প্রদান করে না যে, আর কোন উপাস্য নেই এক আল্লাহ ব্যতীত। يُضَاهُوْنَ- তারা তুলনা দিচ্ছে। ৪৬৫৪. বারাআ ইবনু ‘আযিব (রাঃ) বলেছেনঃ সর্বশেষে যে আয়াত অবতীর্ণ হয়, তা হল يَسْتَفْتُوْنَكَ قُلِ اللهُ يُفْتِيْكُمْ فِي الْكَلَالَةِ-লোকেরা আপনার কাছে বিধান জানতে চায়। আপনি বলুনঃ আল্লাহ্ তোমাদের বিধান দিচ্ছেন ‘‘কালালা’’- (পিতা-মাতাহীন নিঃসন্তান ব্যক্তি) সম্বন্ধে- (সূরাহ আন-নিসা ৪/১৭৬)। এবং সর্বশেষে যে সূরাটি অবতীর্ণ হয়, তা হল সূরায়ে বারাআত। [৪৩৬৪] (আধুনিক প্রকাশনীঃ ৪২৯৩, ইসলামিক ফাউন্ডেশনঃ ৪২৯৫)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 176
			}
		}
	]
}