{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4677,
			"arabicnumber": 4677,
			"text": "‘আবদুর রহমান ইবনু ‘আবদুল্লাহ ইবনু কা‘ব ইবনু মালিক (রহ.) তার পিতা থেকে বর্ণনা করেন। তিনি বলেন, আমি আমার পিতা কা‘ব ইবনু মালিক (রাঃ) থেকে শুনেছি, যে তিনজনের তওবা কবূল হয়েছিল, তার মধ্যে তিনি একজন। তিনি বদরের যুদ্ধ ও তাবূকের যুদ্ধ এ দু’টি ব্যতীত অন্য কোন যুদ্ধে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর থেকে পশ্চাতে থাকেননি। কা‘ব ইবনু মালিক (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাবূক যুদ্ধ হতে সূর্যোদয়ের সময় মদিনা্য় ফিরে আসলে আমি (মিথ্যার পরিবর্তে) সত্য প্রকাশের দৃঢ় সংকল্প গ্রহণ করলাম। তিনি [রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম] যে কোন সফর হতে সাধারণত সূর্যোদয়ের সময় ফিরে আসতেন এবং সর্বপ্রথম মসজিদে গিয়ে দু’রাক‘আত নফল সালাত আদায় করতেন। (তাবূকের যুদ্ধ থেকে এসে) রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমার সঙ্গে এবং আমার সঙ্গীদের সঙ্গে কথা বলা নিষিদ্ধ ঘোষণা করলেন, অথচ আমাদের ব্যতীত অন্য যারা যুদ্ধে যাওয়া থেকে বিরত ছিল, তাদের সঙ্গে কথা বলায় কোন প্রকার বাধা প্রদান করলেন না। সুতরাং লোকেরা আমাদের সঙ্গে কথা বলা থেকে বিরত থাকতে লাগলেন। আমার কাছে সবচেয়ে বড় ব্যাপার ছিল যে, যদি এ অবস্থায় আমার মৃত্যু এসে যায়, আর নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমার জানাযাহর সালাত আদায় না করেন, অথবা রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর ওফাত হলে আমি মানুষের কাছে এই অবস্থায় থেকে যাব তারা কেউ আমার সঙ্গে কথাও বলবে না, আর আমার জানাযার সালাতও আদায় করবে না। এরপর (পঞ্চাশ দিন পর) আল্লাহ তা‘আলা আমার তওবা কবূল করে তাঁর [নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর] প্রতি আয়াত অবতীর্ণ করেন। তখন রাতের শেষ-তৃতীয়াংশ বাকী ছিল। সে রাতে রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম উম্মু সালামাহ (রাঃ)-এর কাছে ছিলেন, উম্মু সালামাহ (রাঃ) আমার প্রতি সদয় ও সহানুভূতিশীল ছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, হে উম্মু সালামাহ! কা‘বের তওবা কবূল করা হয়েছে। উম্মু সালামাহ (রাঃ) বললেন, তাকে সুসংবাদ দেয়ার জন্য কাউকে তার কাছে পাঠাব? নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, এখন খবর পেলে সব লোক এসে জমা হয়ে যাবে। তারা তোমাদের ঘুম নষ্ট করে দিবে। রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম ফজরের সালাত আদায়ের পর আমাদের তওবা কবূল হওয়ার কথা ঘোষণা করে দিলেন। এ সময় রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর চেহারা খুশীতে এমন চমকাচ্ছিল যেন চাঁদের টুকরা। যেসব মুনাফিক মিথ্যা অজুহাত দেখিয়ে [রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর অসন্তুষ্টি থেকে] রেহাই পেয়েছিল, তাদের চেয়ে তওবা কবূলের ব্যাপারে আমরা তিনজন পিছনে পড়ে গিয়েছিলাম, এরপর আল্লাহ তা‘আলা আমাদের তওবা কবূল করে আয়াত অবতীর্ণ করেন। (তাবূকের যুদ্ধে) অনুপস্থিতদের মধ্যে যারা রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে মিথ্যা কথা বলেছে এবং যারা মিথ্যা অজুহাত দেখিয়েছে তাদের জঘন্যভাবে নিন্দাবাদ করা হয়েছে। আল্লাহ তা‘আলা ইরশাদ করেন, ‘‘তারা তোমাদের কাছে ওযর পেশ করবে যখন তোমরা তাদের কাছে ফিরে আসবে। আপনি বলে দিনঃ তোমরা ওযর পেশ করো না, আমরা কখনও তোমাদের বিশ্বাস করব না; আল্লাহ তো আমাদের জানিয়ে দিয়েছেন তোমাদের খবর; আর ভবিষ্যতেও আল্লাহ তোমাদের কার্যকলাপ লক্ষ্য রাখবেন এবং তাঁর রাসূলও’’- (সূরাহ বারাআত ৯/৯৪)।[২৭৫৭] (আধুনিক প্রকাশনীঃ ৪৩১৬, ইসলামিক ফাউন্ডেশনঃ ৪৩১৭)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 199
			}
		}
	]
}