{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4680,
			"arabicnumber": 4680,
			"text": "সূরাহ (১০) : ইউনুস 65/10/1. : ৬৫/১০/১. অধ্যায়: ইবনু ‘আব্বাস (রাঃ) বলেন, অর্থাৎ বৃষ্টির দ্বারা ভূ-পৃষ্ঠে বিভিন্ন প্রকারের উদ্ভিদ উদগত হয়। আল্লাহ তা‘আলার বাণীঃ -‘‘তারা বলেঃ ‘‘আল্লাহ সন্তান গ্রহণ করেছেন। তিনি মহান, পবিত্র। তিনি অমুখাপেক্ষী।’’ (সূরাহ ইউনুস ১০/৬৮) যায়দ ইবনু আসলাম (রহ.) বলেন, দ্বারা মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে বুঝানো হয়েছে। মুজাহিদ বলেন, এর অর্থ কল্যাণ। এগুলো কুরআনের নিদর্শন ও অনুরূপ, এখানে দ্বারা (তোমাদের নিয়ে) অর্থে তাদের দু‘আ। -তারা ধ্বংসোন্মুখ হল। গুনাহ তাদের ঘিরে ফেলছে। সমপর্যায়ের (তাদের পশ্চাদ্ধাবন করল।) এখানে সীমা অতিক্রম অর্থে, মুজাহিদ (রহ.) বলেন, -এর দ্বারা মানুষের সেই কথা বুঝাচ্ছে, যখন সে রাগান্বিত হয়ে নিজ নিজ সন্তান-সন্ততি ও ধন-সম্পদ সম্পর্কে বলে, হে আল্লাহ! এতে বারাকাত দিও না, এর ওপর লা‘নাত কর।-যার প্রতি বদদু‘আ করা হয়েছে, তাকে ধ্বংস করে দিতেন এবং তাকে মেরে ফেলতেন। -কল্যাণকর কাজের জন্য রয়েছে কল্যাণ এবং আরো অধিক। এবং অতিরিক্ত অর্থাৎ ক্ষমা। অন্যরা বলেন, আল্লাহর সাক্ষাৎ, الْكِبْرِيَاءُ-সার্বভৌমত্ব। ‘‘আর আমি বনী ইসরাঈলকে নদী পার করিয়ে দিলাম। তারপর তাদের পশ্চাদানুসরণ করল ফির‘আউন ও তার সৈন্যবাহিনী নিপীড়ন ও নির্যাতনের উদ্দেশে। এমনকি যখন সে নিমজ্জিত হতে লাগল তখন বললঃ আমি ঈমান আনলাম যে, কোন সত্য মা’বুদ নেই তিনি ব্যতীত যার প্রতি ঈমান এনেছে বনী ইসরাঈল এবং আমি একজন মুসলিম।’’ (সূরাহ ইউনুস ১০/৯০) আমি তোমাকে যমীনের উঁচু স্থানে ফেলে রাখব। উচ্চ স্থান। [1] ৪৬৮০. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম মদিনা্তে এলেন, তখন ইয়াহূদীগণ আশুরার দিন সওম পালন করত। তারা জানাল, এ দিন মূসা (আঃ) ফিরাউন-এর উপর বিজয় লাভ করেছিলেন। তখন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাঁর সাহাবীদের বললেন, মূসা (আঃ)-এর সঙ্গে সম্পর্কযুক্ত হওয়ার ব্যাপারে তাদের চেয়ে তোমরাই অধিক হাকদার। কাজেই তোমরা সওম পালন কর।[২০০৪] (আধুনিক প্রকাশনীঃ ৪৩১৯, ইসলামিক ফাউন্ডেশনঃ ৪৩২০)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 202
			}
		}
	]
}