{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4685,
			"arabicnumber": 4685,
			"text": "بَاب قَوْلِهِ :(وَإِلَى مَدْيَنَ أَخَاهُمْ شُعَيْبًا) ৬৫/১১/৩. অধ্যায়: মহান আল্লাহর বাণীঃ মাদইয়ানবাসীদের কাছে তাদের ভ্রাতা শু‘আয়ব (আঃ)-কে পাঠালাম। (সূরা হূদ ১১/৮৪) أَيْ إِلَى أَهْلِ مَدْيَنَ لِأَنَّ مَدْيَنَ بَلَدٌ وَمِثْلُهُ (وَاسْأَلِ الْقَرْيَةَ وَاسْأَلِ الْعِيْرَ) يَعْنِيْ أَهْلَ الْقَرْيَةِ وَأَصْحَابَ الْعِيْرِ (وَرَآءَكُمْ ظِهْرِيًّا) يَقُوْلُ لَمْ تَلْتَفِتُوْا إِلَيْهِ وَيُقَالُ إِذَا لَمْ يَقْضِ الرَّجُلُ حَاجَتَهُ ظَهَرْتَ بِحَاجَتِيْ وَجَعَلْتَنِيْ ظِهْرِيًّا وَالظِّهْرِيُّ هَا هُنَا أَنْ تَأْخُذَ مَعَكَ دَابَّةً أَوْ وِعَاءً تَسْتَظْهِرُ بِهِ (أَرَاذِلُنَا) سُقَّاطُنَا إِجْرَامِيْ هُوَ مَصْدَرٌ مِنْ أَجْرَمْتُ وَبَعْضُهُمْ يَقُوْلُ جَرَمْتُ الْفُلْكُ وَالْفَلَكُ وَاحِدٌ وَهْيَ السَّفِيْنَةُ وَالسُّفُنُ مُجْرَاهَا مَدْفَعُهَا وَهُوَ مَصْدَرُ أَجْرَيْتُ وَأَرْسَيْتُ حَبَسْتُ وَيُقْرَأُ مَرْسَاهَا مِنْ رَسَتْ هِيَ وَمَجْرَاهَا مِنْ جَرَتْ هِيَ وَمُجْرِيْهَا وَمُرْسِيْهَا مِنْ فُعِلَ بِهَا رَاسِيَاتٌ ثَابِتَاتٌ. মাদইয়ান-এর নিকট অর্থাৎ মাদইয়ানবাসীর নিকট, কেননা মাদইয়ান তো একটি শহর। এর অনুরূপ وَاسْأَلْ الْقَرْيَةَ وَاسْأَلْ الْعِيْرَ অর্থাৎ গ্রামবাসীদের কাছে এবং কাফেলার লোকদের কাছে জিজ্ঞেস কর। وَرَاءَكُمْ ظِهْرِيًّا অর্থাৎ তারা তার প্রতি দৃষ্টি দেয়নি। যখন কেউ কারও উদ্দেশ্য পূর্ণ না করে, তখন বলা হয় ظَهَرْتَ بِحَاجَتِيْ এবং وَجَعَلْتَنِيْ ظِهْرِيًّا এখানে ظِهْرِيُّ দ্বারা এ ধরনের জানোয়ার বা পাত্র বোঝায় যা কাজের প্রয়োজনে তুমি তার দ্বারা নিজেকে আড়াল করবে। أَرَاذِلُنَا-আমাদের মধ্যে অধম, إِجْرَامِيْ এটা أَجْرَمْتُ -এর মাসদার। কেউ বলেন, جَرَمْتُ হতে উদগত الْفَلَكَ، والْفُلْكُ একবচন, বহুবচন উভয় ক্ষেত্রে ব্যবহৃত হয়। অর্থাৎ নৌকা এবং নৌকাগুলো। مُجْرَاهَا (নৌকার গতি) এটা أَجْرَيْتُ -এর মাসদার এবং أَرْسَيْتُ-নৌকা আমি থামিয়েছি। কেউ কেউ পড়েনঃ مَرْسَاَهَا অর্থাৎ তার স্থিতি এবং مَجْرَاهَا অর্থাৎ তার গতি। مُجْرِيْهَا এবং مُرْسِيْهَا অর্থাৎ যার সঙ্গে এরূপ (চালিত, স্থগিত) করা হয়েছে لرَّاسِيَاتُ অর্থাৎ স্থিত। (আধুনিক প্রকাশনীঃ ৪৩২৩, ইসলামিক ফাউন্ডেশনঃ ৪৩২৪) (وَيَقُوْلُ الْأَشْهَادُ هٰٓؤُلَآءِ الَّذِيْنَ كَذَبُوْا عَلٰى رَبِّهِمْ جأَلَا لَعْنَةُ اللهِ عَلَى الظّٰلِمِيْنَ) সাক্ষীরা বলবেঃ এরাই ঐসব লোক যারা তাদের রবের প্রতি মিথ্যারোপ করেছিল। জেনে রাখ, যালিমদের উপর আল্লাহর লা‘নাত। (সূরাহ হূদ ১১/১৮) وَاحِدُهُ شَاهِدٌ مِثْلُ صَاحِبٍ وَأَصْحَابٍ أَشْهَادُ-এর একবচন হল, شَاهِدٌ যেমন, أَصْحَابٌ -এর এক বচন صَاحِبٌ। ৪৬৮৫. সফওয়ান ইবনু মুহরিয (রহ.) হতে বর্ণিত। তিনি বলেন, একদা ইবনু ‘উমার (রাঃ) তাওয়াফ করছিলেন। হঠাৎ এক ব্যক্তি তার সম্মুখে এসে বলল, হে আবূ ‘আবদুর রহমান অথবা বলল, হে ইবনু ‘উমার (রাঃ)! আপনি কি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম থেকে (কিয়ামতের দিন আল্লাহ তা‘আলা এবং মু’মিনদের মধ্যকার) গোপন আলোচনা সম্পর্কে কিছু শুনেছেন? তিনি বললেন, আমি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, (কিয়ামতের দিন) মু’মিনকে তাঁর নৈকট্য দান করা হবে। হিশাম বলেন, মু’মিন নিকটবর্তী হবে, এমনকি আল্লাহ তা‘আলা তাকে স্বীয় পর্দায় ঢেকে নেবেন এবং তার নিকট হতে তার গুনাহসমূহের স্বীকারোক্তি নেবেন। (আল্লাহ জিজ্ঞেস করবেন) অমুক গুনাহ সম্পর্কে তুমি জান কি? বান্দা বলবে, হে আমার রব! আমি জানি, আমি জানি। এভাবে দু’বার বলবে। তখন আল্লাহ তা‘আলা বলবেন, আমি দুনিয়ায় তোমার পাপ গোপন রেখেছিলাম। আর আজ তোমার সে পাপ ক্ষমা করে দিচ্ছি। তারপর তার নেক ‘আমলনামা গুটিয়ে নেয়া হবে। আর অন্যদলকে অথবা (রাবী বলেছেন) কাফিরদের সকলের সামনে ডেকে বলা হবে, এরাই সে লোক যারা আল্লাহ সম্পর্কে মিথ্যা বলেছিল এবং শায়বান حَدَّثَنَا قَتَادَةُ-এর পরিবর্তে عَنْ قَتَادَةُ এবং عَنْ صَفْوَانُ -এর পরিবর্তে حَدَّثَنَا صَفْوَانُ বর্ণনা করেছেন। [২৪৪১] (আধুনিক প্রকাশনীঃ ৪৩২৪, ইসলামিক ফাউন্ডেশনঃ ৪৩২৫)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 207
			}
		}
	]
}