{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4698,
			"arabicnumber": 4698,
			"text": "سُوْرَةُ إِبْرَاهِيْمَ সূরাহ (১৪) : ইবরাহীম قَالَ ابْنُ عَبَّاسٍ (هَادٍ) دَاعٍ وَقَالَ مُجَاهِدٌ (صَدِيْدٌ) قَيْحٌ وَدَمٌ وَقَالَ ابْنُ عُيَيْنَةَ (اذْكُرُوْا نِعْمَةَ اللهِ عَلَيْكُمْ) أَيَادِيَ اللهِ عِنْدَكُمْ وَأَيَّامَهُ وَقَالَ مُجَاهِدٌ (مِنْ كُلِّ مَا سَأَلْتُمُوْهُ) رَغِبْتُمْ إِلَيْهِ فِيْهِ (يَبْغُوْنَهَاعِوَجًا) يَلْتَمِسُوْنَ لَهَا عِوَجًا (وَإِذْ تَأَذَّنَ رَبُّكُمْ) أَعْلَمَكُمْ آذَنَكُمْ (رَدُّوْآ أَيْدِيَهُمْ فِيْٓأَفْوَاهِهِمْ)هَذَا مَثَلٌ كَفُّوْا عَمَّا أُمِرُوْا بِهِ (مَقَامِيْ) حَيْثُ يُقِيْمُهُ اللهُ بَيْنَ يَدَيْهِ (مِنْ وَّرَآئِهٰ) قُدَّامَهُ جَهَنَّمُ (لَكُمْ تَبَعًا) وَاحِدُهَا تَابِعٌ مِثْلُ غَيَبٍ وَغَائِبٍ (بِمُصْرِخِكُمْ) اسْتَصْرَخَنِي اسْتَغَاثَنِيْ يَسْتَصْرِخُهُ مِنْ الصُّرَاخِ (وَلَا خِلَالَ) مَصْدَرُ خَالَلْتُهُ خِلَالًا وَيَجُوْزُ أَيْضًا جَمْعُ خُلَّةٍ وَخِلَالٍ (اجْتُثَّتْ) اسْتُؤْصِلَتْ. ইবনু ‘আব্বাস (রাঃ) বলেন, هَادٍ আহবানকারী। মুজাহিদ (রহ.) বলেন, صَدِيْدٌ পুঁজ ও রক্ত। ইবনু ‘উয়াইনাহ বলেন, اذْكُرُوْا نِعْمَةَ اللهِ عَلَيْكُمْ আল্লাহর যেসব নিয়ামত তোমাদের উপর আছে এবং যা কিছু ঘটছে (তা স্মরণ কর)। মুজাহিদ (রহ.) বলেন, مِنْ كُلِّ مَا سَأَلْتُمُوْهُ তোমরা যা কিছু আল্লাহর কাছে চেয়েছিলে যাতে তোমাদের আগ্রহ ছিল। يَبْغُوْنَهَاعِوَجًا তারা এর অপব্যাখ্যা তালাশ করছে। إِذْ تَأَذَّنَرَبُّكُمْ তোমাদের প্রতিপালক তোমাদের জানিয়েছেন, তোমাদের অবহিত করেছেন। رَدُّوْا أَيْدِيَهُمْ فِيْأَفْوَاهِهِمْ এটা একটা প্রবাদ বাক্য, যার অর্থ, তাদের যে বিষয়ে আদেশ দেয়া হয়েছিল তা থেকে তারা বিরত রয়েছে। مَقَامِيْ সে স্থান তাকে যেখানে আল্লাহ্ তা‘আলা তাঁর সামনে দাঁড় করাবেন। مِنْوَرَآئِهٰ তার সম্মুখে لَكُمْ تَبَعًا এর একবচন تَابِعٌ যেমন غَائِبٌ -এর বহুবচন غَائِبٍ। اسْتَصْرَخَنِيْ সে আমার কাছে সাহায্য চেয়েছে। يَسْتَصْرِخُهُ এটা الصُّرَاخِ থেকে গঠিত। وَلَاخِلَالَ আর কোন বন্ধুত্ব নয়। এটা خَالَلْتُهُخِلَالًا এর মাসদার আর خُلَّةٍ-خِلَالٍ এর বহুবচনও হতে পারে। اجْتُثَّتْ মূলোচ্ছেদ করা হয়েছে। (كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَّفَرْعُهَا فِي السَّمَآءِ ... كُلَّ حِيْنٍ). তা একটি পবিত্র বৃক্ষের মত যার শিকড় সুদৃঢ় এবং যার শাখা-প্রশাখা ঊর্ধ্বে উত্থিত, সে বৃক্ষ স্বীয় রবের আদেশে প্রত্যেক মওসুমে তার ফলদান করে। (সূরাহ ইবরাহীম ১৪/২৪-২৫) ৪৬৯৮. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে ছিলাম। তিনি বললেন, বল তো সেটা কোন বৃক্ষ, যা কোন মুসলিম ব্যক্তির মত, যার পাতা ঝরে না, এরূপ নয়, এরূপ নয় [1] এবং এরূপও নয় যা সর্বদা খাদ্য প্রদান করে। ইবনু ‘উমার (রাঃ) বলেন, আমার মনে হল, এটা খেজুর বৃক্ষ। কিন্তু আমি দেখলাম আবূ বাকর (রাঃ) ও ‘উমার (রাঃ) কথা বলছেন না। তাই আমি এ ব্যাপারে বলা পছন্দ করিনি। শেষে যখন কেউ কিছু বললেন না, তখন রাসূলূল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, সেটা খেজুর গাছ। পরে যখন আমরা উঠে গেলাম, তখন আমি ‘উমার (রাঃ)-কে বললাম, হে আব্বা! আল্লাহর কসম! আমার মনেও হয়েছিল, তা খেজুর বৃক্ষ। ‘উমার (রাঃ) বললেন, এ কথা বলতে তোমাকে কিসে বাধা দিল? বললেন, আমি আপনাদেরকে কথা বলতে দেখলাম না, তাই আমি কথা বলতে এবং আমার মত ব্যক্ত করতে অপছন্দ করি। ‘উমার (রাঃ) বললেন, অবশ্য যদি তুমি বলতে, তবে তা আমার নিকট এত এত[2] থেকে অধিক প্রিয় হত। [৬১] (আধুনিক প্রকাশনীঃ ৪৩৩৭, ইসলামিক ফাউন্ডেশনঃ ৪৩৩৭)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 220
			}
		}
	]
}