{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4712,
			"arabicnumber": 4712,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। একদা রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সামনে গোশ্ত আনা হল এবং তাঁকে সামনের রান পরিবেশন করা হল। তিনি এটা পছন্দ করতেন। তিনি তার থেকে কামড়ে খেলেন। এরপর বললেন, আমি হব কিয়ামতের দিন মানবকুলের নেতা। তোমাদের কি জানা আছে তা কেন? কিয়ামতের দিন আগের ও পরের সকল মানুষ এমন এক ময়দানে জমায়েত হবে, যেখানে একজন আহবানকারীর আহবান সকলে শুনতে পাবে এবং সকলেই এক সঙ্গে দৃষ্টিগোচর করবে। সূর্য নিকটে এসে যাবে। মানুষ এমনি কষ্ট-ক্লেশের সম্মুখীন হবে যা অসহনীয় ও অসহ্যকর হয়ে পড়বে। তখন লোকেরা বলবে, তোমরা কী বিপদের সম্মুখীন হয়েছ, তা কি দেখতে পাচ্ছ না? তোমরা কি এমন কাউকে খুঁজে বের করবে না, যিনি তোমাদের রবের কাছে তোমাদের জন্য সুপারিশকারী হবেন? কেউ কেউ অন্যদের বলবে যে, আদমের কাছে চল। তখন সকলে তার কাছে এসে তাঁকে বলবে, আপনি আবুল বাশার [1]। আল্লাহ্ তা‘আলা আপনাকে নিজ হস্ত দ্বারা সৃষ্টি করেছেন এবং তাঁর রূহ আপনার মধ্যে ফুঁকে দিয়েছেন এবং মালায়িকাহ্কে হুকুম দিলে তাঁরা আপনাকে সিজদা করেন। আপনি আপনার রবের নিকট আমাদের জন্য সুপারিশ করুন। আপনি কি দেখছেন না যে, আমরা কিসের মধ্যে আছি? আপনি কি দেখছেন না যে, আমরা কী অবস্থায় পৌঁছেছি। তখন আদম (আঃ) বলবেন, আজ আমার রব এত রাগান্বিত হয়েছেন যার আগেও কোনদিন এরূপ রাগান্বিত হননি আর পরেও এরূপ রাগান্বিত হবেন না। তিনি আমাকে একটি গাছের নিকট যেতে নিষেধ করেছিলেন, কিন্তু আমি অমান্য করেছি, নফ্সী, নফ্সী, নফ্সী, (আমি নিজেই সুপারিশ প্রার্থী) তোমরা অন্যের কাছে যাও, তোমরা নূহ (আঃ)-এর কাছে যাও। তখন সকলে নূহ্ (আঃ)-এর কাছে এসে বলবে, হে নূহ্ (আঃ)! নিশ্চয়ই আপনি পৃথিবীর মানুষের প্রতি প্রথম রাসূল। [2] আর আল্লাহ্ তা‘আলা আপনাকে পরম কৃতজ্ঞ বান্দা হিসেবে আখ্যায়িত করেছেন। সুতরাং আপনি আপনার রবের কাছে আমাদের জন্য সুপারিশ করুন। আপনি কি দেখছেন না যে, আমরা কিসের মধ্যে আছি? তিনি বলবেন, আমার রব আজ এত ভীষণ রাগান্বিত যে, আগেও এমন রাগান্বিত হননি আর পরে কখনো এমন রাগান্বিত হবেন না। আমার একটি গ্রহণযোগ্য দু‘আ ছিল, যা আমি আমার কওমের ব্যাপারে করে ফেলেছি, (এখন) নফ্সী, নফ্সী, নফ্সী। তোমরা অন্যের কাছে যাও- যাও তোমরা ইব্রাহীম (আঃ)-এর কাছে। তখন তারা ইব্রাহীম (আঃ)-এর কাছে এসে বলবে, হে ইব্রাহীম (আঃ)! আপনি আল্লাহর নবী এবং পৃথিবীর মানুষের মধ্যে আপনি আল্লাহর বন্ধু[3]। আপনি আপনার রবের কাছে আমাদের জন্য সুপারিশ করুন। আপনি কি দেখতে পাচ্ছেন না আমরা কিসের মধ্যে আছি? তিনি তাদের বলবেন, আমার রব আজ ভীষণ রাগান্বিত, যার আগেও কোন দিন এরূপ রাগান্বিত হননি, আর পরেও কোনদিন এরূপ রাগান্বিত হবেন না। আর আমি তো তিনটি মিথ্যা বলে ফেলেছিলাম। রাবী আবূ হাইয়ান তাঁর বর্ণনায় এগুলোর উল্লেখ করেছেন- (এখন) নফসী, নফসী, নফসী, তোমরা অন্যের কাছে যাও- যাও মূসার কাছে। তারা মূসার কাছে এসে বলবে, হে মূসা (আঃ)! আপনি আল্লাহর রাসূল। আল্লাহ্ আপনাকে রিসালাতের সম্মান দিয়েছেন এবং আপনার সঙ্গে কথা বলে সমস্ত মানবকূলের উপর মর্যাদা দান করেছেন। আপনি আপনার রবের কাছে আমাদের জন্য সুপারিশ করুন। আপনি কি দেখতে পাচ্ছেন না আমরা কিসের মধ্যে আছি? তিনি বললেন, আজ আমার রব ভীষণ রাগান্বিত আছেন, এরূপ রাগান্বিত আগেও হননি এবং পরেও এরূপ রাগান্বিত হবেন না। আর আমি তো এক ব্যক্তিকে হত্যা করে ফেলেছিলাম, যাকে হত্যা করার জন্য আমাকে নির্দেশ দেয়া হয়নি। এখন নফ্সী, নফসী, নফসী। তোমরা অন্যের কাছে যাও- যাও ঈসা (আঃ)-এর কাছে। তখন তারা ঈসা (আঃ)-এর কাছে এসে বলবে, হে ঈসা (আঃ)! আপনি আল্লাহররাসূল এবং কালিমাহ [4], যা তিনি মারইয়াম (আঃ)-এর উপর ঢেলে দিয়েছিলেন। আপনি ‘রূহ’[5]। আপনি দোলনায় থেকে মানুষের সঙ্গে কথা বলেছেন। আজ আপনি আমাদের জন্য সুপারিশ করুন। আপনি কি দেখছেন না, আমরা কিসের মধ্যে আছি? তখন ঈসা (আঃ) বলবেন, আজ আমার রব এত রাগান্বিত যে, এর আগে এরূপ রাগান্বিত হননি এবং এর পরেও এরূপ রাগান্বিত হবেন না। তিনি নিজের কোন গুনাহর কথা বলবেন না। নফসী, নফসী, নফসী, তোমরা অন্য কারও কাছে যাও- যাও মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে। তারা মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে এসে বলবে, হে মুহাম্মাদ! আপনি আল্লাহর রাসূল এবং শেষ নবী। আল্লাহ্ তা‘আলা আপনার আগের, পরের সকল গুনাহ্ ক্ষমা করে দিয়েছেন। আপনি আমাদের জন্য আপনার রবের কাছে সুপারিশ করুন। আপনি কি দেখছেন না আমরা কিসের মধ্যে আছি? তখন আমি আরশের নিচে এসে আমার রবের সামনে সিজদা দিয়ে পড়ব। তারপর আল্লাহ্ তা‘আলা তাঁর প্রশংসা ও গুণগানের এমন সুন্দর নিয়ম আমার সামনে খুলে দিবেন, যা এর পূর্বে অন্য কারও জন্য খোলেননি। এরপর বলা হবে, হে মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম! তোমার মাথা উঠাও। তুমি যা চাও, তোমাকে দেয়া হবে। তুমি সুপারিশ কর, তোমার সুপারিশ কবূল করা হবে। এরপর আমি আমার মাথা উঠিয়ে বলব, হে আমার রব! আমার উম্মত। হে আমার রব! আমার উম্মত। হে আমার রব! আমার উম্মত। তখন বলা হবে, হে মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম! আপনার উম্মাতের মধ্যে যাদের কোন হিসাব-নিকাশ হবে না, তাদেরকে জান্নাতের দরজাসমূহের ডান পার্শ্বের দরজা দিয়ে প্রবেশ করিয়ে দিন। এ দরজা ব্যতীত অন্যদের সঙ্গে অন্য দরজায় ও তাদের প্রবেশের অধিকার থাকবে। তারপর তিনি বলবেন, যাঁর হাতে আমার প্রাণ, সে সত্তার শপথ! জান্নাতের এক দরজার দুই পার্শ্বের মধ্যবর্তী স্থানের প্রশস্ততা যেমন মক্কা ও হামীরের মধ্যবর্তী দূরত্ব, অথবা মক্কা ও বস্রার মাঝে দূরত্বের সমতুল্য। [৩৩৪০] (আধুনিক প্রকাশনীঃ ৪৩৫১, ইসলামিক ফাউন্ডেশনঃ ৪৩৫৩)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 234
			}
		}
	]
}