{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4772,
			"arabicnumber": 4772,
			"text": "سُوْرَةُ النَّمْلِ সূরাহ (২৭) : নামল (وَالْخَبْءُ) مَا خَبَأْتَ (لَا قِبَلَ لَهُمْ) لَا طَاقَةَ (الصَّرْحُ) كُلُّ مِلَاطٍ اتُّخِذَ مِنَ الْقَوَارِيْرِ وَالصَّرْحُ الْقَصْرُ وَجَمَاعَتُهُ صُرُوْحٌ وَقَالَ ابْنُ عَبَّاسٍ (وَلَهَا عَرْشٌ) سَرِيْرٌ كَرِيْمٌ حُسْنُ الصَّنْعَةِ وَغَلَاءُ الثَّمَنِ (يَأْتُوْنِيْ مُسْلِمِيْنَ) طَائِعِيْنَ (رَدِفَ) اقْتَرَبَ (جَامِدَةً) قَائِمَةً (أَوْزِعْنِي) اجْعَلْنِيْ وَقَالَ مُجَاهِدٌ (نَكِّرُوْا) غَيِّرُوْا (وَأُوْتِيْنَا) الْعِلْمَ يَقُوْلُهُ سُلَيْمَانُ (الصَّرْحُ) بِرْكَةُ مَاءٍ ضَرَبَ عَلَيْهَا سُلَيْمَانُ قَوَارِيْرَ أَلْبَسَهَا إِيَّاهُ. وَالْخَبْءُ যা তুমি গোপন কর। لَا قِبَلَ لَهُمْ তাদের কোন শক্তি নেই।[1] الصَّرْحُ কাঁচ মিশ্রিত গারা এবং الصَّرْحُ প্রাসাদকেও বলা হয়। এর বহুবচন صُرُوْحٌ। ইবনু ‘আব্বাস (রাঃ) বলেন, وَلَهَا عَرْشٌ তার সিংহাসন অতি সম্মানিত, শিল্প কর্মে উত্তম এবং বহু মূল্যবান। يَأْتُوْنِيْ مُسْلِمِيْنَ অনুগত হয়ে আমার নিকট আসবে। رَدِفَ নিকটবর্তী হয়েছে। جَامِدَةً স্থির। أَوْزِعْنِيْ আমাকে বানিয়ে দাও। মুজাহিদ (রহ.) বলেন, نَكِّرُوْا পরিবর্তন করে দাও। وَأُوْتِيْنَا (আমাদের জ্ঞান দেয়া হয়েছে) এ কথা সুলাইমান (আঃ) বলেন, الصَّرْحُ পানির একটি হাউয। সুলাইমান (আঃ) সেটি কাঁচ দিয়ে ঢেকে দিয়েছিলেন। (28) سُوْرَةُ الْقَصَصِ সূরাহ (২৮) : ক্বাসাস يُقَالَ (كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَه”) إِلَّا مُلْكَهُ وَيُقَالُ إِلَّا مَا أُرِيْدَ بِهِ وَجْهُ اللهِ وَقَالَ مُجَاهِدٌ فَعَمِيَتْ عَلَيْهِمْ (الأَنْبَآءُ) الْحُجَجُ. আল্লাহর চেহারা ব্যতীত সব কিছু ধ্বংস হবে। ইমাম বুখারী বলেছেন, এ আয়াতের ব্যাখ্যায় বলা হয়েছে, তাঁর রাজত্ব [2] ব্যতীত এবং এও বলা হয়েছে যে, যে ‘আমল দ্বারা আল্লাহর সন্তুষ্টি অর্জন উদ্দেশ্য তা ব্যতীত সবই ধ্বংস হবে। অতঃপর তাদের কথাবার্তা বন্ধ হয়ে যাবে। মুজাহিদ (রহ.) الْأَنْبَاءُ শব্দের অর্থ বলেছেন প্রমাণাদি। ৪৭৭২. মুসাইয়্যাব (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন আবূ তালিবের মৃত্যু নিকটবর্তী হল, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাঁর কাছে আসলেন। তিনি সেখানে আবূ জাহল এবং ‘আবদুল্লাহ্ ইবনু আবূ ‘উমাইয়াহ ইবনু মুগীরাহ্কে পেলেন। রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, হে চাচা! আপনি বলুন ‘‘লা- ইলা-হা ইল্লাল্লা-হ।’’ এ ‘কালেমা’ দ্বারা আমি আপনার জন্য কিয়ামতে আল্লাহর কাছে ওযর পেশ করতে পারব। আবূ জাহল এবং ‘আবদুল্লাহ্ ইবনু আবূ ‘উমাইয়াহ বলল, তুমি কি ‘আবদুল মুত্তালিবের ধর্ম ত্যাগ করবে? রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বারবার তার কাছে এ ‘কালিমা’ পেশ করতেই থাকলেন। আর তারা তাদের কথা বারবার বলেই চলল। অবশেষে আবূ তালিব তাঁদের সঙ্গে সর্বশেষ এ কথা বললেন, আমি ‘আবদুল মুত্তালিবের মিল্লাতের উপর আছি, এবং কালিমা ‘‘লা- ইলা-হা ইল্লাল্লা-হ’’ পাঠ করতে অস্বীকৃতি জানালেন। রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, আল্লাহর কসম! আমাকে নিষেধ না করা অবধি আপনার জন্য ক্ষমা চাইতেই থাকব। তারপর আল্লাহ্ তা‘আলা অবতীর্ণ করলেন, নবী ও মু’মিনদের জন্য এটা শোভনীয় নয় যে, তারা মুশরিকদের জন্য ক্ষমা প্রার্থনা করবে। আর আল্লাহ্ তা‘আলা আবূ তালিব সম্পর্কে অবতীর্ণ করেন, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে সম্বোধন করে আল্লাহ্ তা‘আলা বললেন, ‘‘তুমি যাকে ভালবাস তাকেই সৎপথে আনতে পারবে না। তবে আল্লাহ্ যাকে ইচ্ছা হিদায়াত দান করেন।’’ ইবনু ‘আব্বাস (রাঃ) বলেন أُوْلِي الْقُوَّة লোকের একটি দল সে চাবিগুলো বহন করতে সক্ষম ছিল না। لَتَنُوْءُবহন করা কষ্টসাধ্য ছিল। فَارِغًا মূসা (আঃ)-এর স্মরণ ব্যতীত সব কিছু থেকে খালি ছিল। الْفَرِحِيْنَ দম্ভকারীরা! قُصِّيْهِ তার চিহ্ন অনুসরণ কর। কথার বর্ণনা অর্থেও প্রয়োগ হয়। نَحْنُ نَقُصُّ عَلَيْكَعَنْ جُنُبٍ এখানে جُنُبٍ অর্থ দূর থেকে। عَنْ جَنَابَةٍ، عَنْ اجْتِنَابٍ এর একই অর্থবোধক।يَبْطِشُـــيَبْطُشُ উভয়ই পড়া হয়। يَأْتَمِرُوْنَ পরস্পর পরামর্শ করছে। ـ وَالْعَدَاءُ وَالتَّعَدِّيْ (শব্দ তিনটির) অর্থ একই ; সীমা অতিক্রম করা। آنَسَ দেখা الْجِذْوَةُ কাঠের মোটা টুকরা যাতে শিখা নেই। الشِّهَابُ যাতে শিখা আছে। الْحَيَّاتُবহু প্রকার সাপ; যেমন, চিকন জাতি, অজগর, কালনাগ (ইত্যাদি) رِدْءًا সাহায্যকারী। ইবনু ‘আব্বাস (রাঃ) বলেন, يُصَدِّقُنِيْ (তিনি قاف-কে পেশ দিয়ে পড়েন। অন্য হতে বর্ণিত سَنَشُدُّ আমরা শীঘ্র তোমাকে সাহায্য করব। যখন তুমি কোন জিনিসকে শক্তিশালী করলে, তখন তুমি যেন তার জন্য বাহুবল প্রদান করলে। যখন আরবগণ কাউকে সাহায্য করেন তখন বলে থাকেন جَعَلْتَ لَهُ عَضُدًا (বাহুবল প্রদান করলে) مَقْبُوْحِيْنَ ধ্বংসপ্রাপ্ত। وَصَّلْنَا আমি বর্ণনা করেছি; আমি তা পূর্ণ করেছি। يُجْبَى আমদানি করা হয়। بَطِرَتْ দম্ভ করল। فِيْ أُمِّهَا رَسُوْلًا মক্কা এবং তার চতুষ্পার্শকে বলা হয়। تُكِنُّ গোপন করছ। আরবগণ বলে থাকেন أَكْنَنْتُ الشَّيْءَ আমি তা গোপন করেছি। كَنَنْتُهُ আমি তা লুকিয়েছি; আমি প্রকাশ করেছি। وَيْكَأَنَّ اللهَ আর أَوَلَمْ يَرَوْا أَنَّ اللهَ সমার্থক (তারা কি দেখেনি?) يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِر আল্লাহ্ যার জন্য চান খাদ্য প্রসারিত করে দেন, আর যার থেকে চান সংকুচিত করে দেন। [১৩৬০] (আধুনিক প্রকাশনীঃ ৪৪০৮, ইসলামিক ফাউন্ডেশনঃ ৪৪১০)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 294
			}
		}
	]
}