{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4774,
			"arabicnumber": 4774,
			"text": "سُوْرَةُ الْعَنْكَبُوْتِ সূরাহ (২৯) : আনকাবূত قَالَ مُجَاهِدٌ (وَكَانُوْا مُسْتَبْصِرِيْنَ) ضَلَلَةً وَقَالَ غَيْرُهُ (الْحَيَوَانُ) وَالْحَيُّ وَاحِدٌ (فَلَيَعْلَمَنَّاللهُ) عَلِمَ اللهُ ذَلِكَ إِنَّمَا هِيَ بِمَنْزِلَةِ فَلِيَمِيْزَ اللهُ كَقَوْلِهِ (لِيَمِيْزَ اللهُ الْخَبِيْثَ مِنَ الطَّيِّبِ أَثْقَالًا مَّعَ أَثْقَالِهِمْ) أَوْزَارًا مَعَ أَوْزَارِهِمْ. মুজাহিদ বলেছেন, وَكَانُوْا مُسْتَبْصِرِيْنَ অর্থাৎ পথহারা। অন্যরা বলেছেন, الْحَيَوَانُ এবং الْحَيُّ শব্দ দু’টি একই।فَلَيَعْلَمَنَّ اللهُ আল্লাহ্ আগে থেকেই তা জানতেন। এখানে ব্যবহৃত হয়েছে فَلِيَمِيْزَاللهُ (যেন আল্লাহ্ তা‘আলা চিহ্নিত করেন)-এর অর্থে। যেমন, আল্লাহ্ তা‘আলার বাণীঃلِيَمِيْزَ اللهُ الْخَبِيْثَ مِنَالطَّيِّبِ أَثْقَالًا مَّعَ أَثْقَالِهِمْ (যেন আল্লাহ্ তা‘আলা খবীছকে ভাল থেকে পৃথক করেন) অর্থাৎ তাদের অপরাধের সঙ্গে। (30) سُوْرَةُ الرُّوْمِ সূরাহ (৩০) : রূম (আলিফ-লাম-মীম গুলিবাতির) (فَلَا يَرْبُو) مَنْ أَعْطَى عَطِيَّةً يَبْتَغِيْ أَفْضَلَ، فَلَا أَجْرَ لَهُ فِيْهَا قَالَ مُجَاهِدٌ (يُحْبَرُوْنَ) يُنَعَّمُوْنَ (يَمْهَدُوْنَ) يُسَوُّوْنَ الْمَضَاجِعَ (الْوَدْقُ) الْمَطَرُ قَالَ ابْنُ عَبَّاسٍ (هَلْ لَّكُمْ مِمَّا مَلَكَتْ أَيْمَانُكُمْ)فِي الآلِهَةِ وَفِيْهِ (تَخَافُوْنَهُمْ) أَنْ يَرِثُوْكُمْ كَمَا يَرِثُ بَعْضُكُمْ بَعْضًا (يَصَّدَّعُوْنَ) يَتَفَرَّقُوْنَ فَاصْدَعْ وَقَالَ غَيْرُهُ (ضُعْفٌ) وَضَعْفٌ لُغَتَانِ وَقَالَ مُجَاهِدٌ (السُّوأَى) الإِسَاءَةُ جَزَاءُ الْمُسِيئِيْنَ. فَلَا يَرْبُوْ অর্থাৎ যে এ আশায় দান করে যে, এর চেয়ে উত্তম বিনিময় পাবে, এতে কোন সওয়াব নেই। মুজাহিদ (রহ.) বলেন, يُحْبَرُوْنَ তারা নিয়ামত প্রাপ্ত হবে। يَمْهَدُوْنَ তাদের আরাম আয়েশের জায়গা প্রস্তুত করবে। الْوَدْقُ বৃষ্টি। ইবনু ‘আব্বাস (রাঃ) বলেন, هَلْ لَّكُمْ مِمَّا مَلَكَتْ أَيْمَانُكُمْ এ আয়াত ইলাহ সম্পর্কে। تَخَافُوْنَهُمْ তোমরা কি পছন্দ কর যে, তোমাদের দাস-দাসী তোমাদের অংশীদার হোক, যেমন তোমরা পরস্পরের উত্তরাধিকার হও। يَصَّدَّعُوْنَ পৃথক পৃথক হয়ে যাবে। فَاصْدَعْস্পষ্ট বর্ণনা কর। ইবনু ‘আব্বাস ব্যতীত অন্যে বলেন, ضُعْفٌ এবং ضَعْفٌ উভয়ের অর্থ একই। মুজাহিদ (রহ.) বলেন, السُّوأَى অপরাধীকে যথাযোগ্য শাস্তি দেয়া। ৪৭৭৪. মাসরূক (রহ.) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি কিন্দাবাসীদের সামনে বলছিল, কিয়ামতের দিন ধোঁয়া আসবে এবং মুনাফিকদের শ্রবণশক্তি ও দৃষ্টিশক্তি নষ্ট করে দেবে। আর মু’মিনের কাছে মনে হবে সর্দি লেগে থাকা অবস্থার ন্যায়। এ কথা শুনে আমরা ভীত হয়ে গেলাম। এরপর আমি ইবনু মাস‘উদ (রাঃ)-এর নিকট গেলাম। তখন তিনি তাকিয়ায় হেলান দিয়ে বসেছিলেন। এ সব কথা শুনে তিনি রাগান্বিত হয়ে উঠে বসলেন এবং বললেন, যার জানা আছে সেও যেন তা বলে, আর যে না জানে সে যেন বলে, আল্লাহ্ তা‘আলাই ভাল জানেন। জ্ঞানের মধ্যে এটাও একটা জ্ঞান যে, যার যে বিষয় জানা নেই সে বলবে ‘‘আমি এ বিষয়ে জানি না।’’ আল্লাহ্ তা‘আলা নবীকে বলেছেন, হে নবী! আপনি বলুন, ‘‘আমি আল্লাহর দ্বীনের দিকে ডাকার জন্য তোমাদের নিকট কোন পারিশ্রমিক চাই না এবং যারা মিথ্যা দাবী করে আমি তাদের মধ্যে নই। কুরায়শগণ ইসলাম গ্রহণে দেরী করতে লাগল, সুতরাং রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাদের জন্য এই বলে বদদু‘আ করলেন। ‘‘হে আল্লাহ্! আপনি তাদের উপর ইউসুফ (আঃ)-এর মত সাত বছর (দুর্ভিক্ষ) দিয়ে আমাকে সাহায্য করুন।’’ তারপর তারা এমন ভয়াবহ দুর্ভিক্ষে পতিত হলো যে, তারা তাতে ধ্বংস হয়ে গেল এবং মরা জন্তু ও তার হাড় খেতে বাধ্য হলো। তারা (দুর্ভিক্ষের কারণে) আকাশও পৃথিবীর মধ্যস্থলে ধোঁয়ার মত দেখতে পেল। তারপর আবূ সুফ্ইয়ান তাঁর কাছে এসে বলল, হে মুহাম্মাদ! তুমি আত্মীয়তার সম্পর্ক বজায় রাখার আদেশ দিচ্ছ, অথচ তোমার গোত্রের লোকেরা এখন ধ্বংস হয়ে গেল। সুতরাং আমাদের (এ দুর্ভিক্ষ থেকে) বাঁচার জন্য দু‘আ কর। তখন তিনি এ আয়াত পাঠ করলেন فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَآءُ بِدُخَانٍ مُّبِيْنٍ إِلَى قَوْلِهِعَآئِدُوْنَ ‘‘অতএব, তুমি অপেক্ষা কর সেদিনের, যেদিন স্পষ্ট ধূম্রাচ্ছন্ন হবে আকাশ..... তোমরা তো তোমাদের পূর্বাবস্থায় ফিরে যাবে।’’ অবশেষে দুর্ভিক্ষের অবসান ঘটল কিন্তু তারা কুফরীর দিকে ফিরে গেল। তখন আল্লাহ্ তা‘আলা এদের ব্যাপারেই অবতীর্ণ করলেন, যেদিন আমি তোমাদের শক্তভাবে পাকড়াও করব। الْبَطْشَةَ এবং لِزَامًا দ্বারা বদরের যুদ্ধ বোঝানো হয়েছে। আল্লাহ্ তা‘আলার বাণীঃ আলিফ, লাম, মীম। রোমানরা পরাজিত হয়েছে। ..... এবং পরাজয়ের পর শীঘ্রই বিজয়ী হবে। রোমানদের ঘটনা অতিক্রান্ত হয়েছে। [১০০৭] (আধুনিক প্রকাশনীঃ ৪৪১০, ইসলামিক ফাউন্ডেশনঃ ৪৪১২)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 296
			}
		}
	]
}