{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4804,
			"arabicnumber": 4804,
			"text": "سُوْرَةُ الصَّافَّاتِ সূরাহ (৩৭) : ওয়াস্‌সাফফাত وَقَالَ مُجَاهِدٌ (وَيَقْذِفُوْنَ بِالْغَيْبِ مِنْ مَّكَانٍمبَعِيْدٍ) مِنْ كُلِّ (مَكَانٍ وَّيُقْذَفُوْنَ مِنْ كُلِّ جَانِبٍ) يُرْمَوْنَ (وَاصِبٌ) دَائِمٌ (لَازِبٌ) لَازِمٌ (تَأْتُوْنَنَا عَنِ الْيَمِيْنِ) يَعْنِي الْحَقَّ الْكُفَّارُ تَقُوْلُهُ لِلشَّيْطَانِ (غَوْلٌ) وَجَعُ بَطْنٍ (يُنْزَفُوْنَ) لَا تَذْهَبُ عُقُوْلُهُمْ (قَرِيْنٌ) شَيْطَانٌ (يُهْرَعُوْنَ) كَهَيْئَةِ الْهَرْوَلَةِ (يَزِفُّوْنَ) النَّسَلَانُ فِي الْمَشْيِ (وَبَيْنَ الْجِنَّةِ نَسَبًا) قَالَ كُفَّارُ قُرَيْشٍ الْمَلَائِكَةُ بَنَاتُ اللهِ وَأُمَّهَاتُهُمْ بَنَاتُ سَرَوَاتِ الْجِنِّ وَقَالَ اللهُ تَعَالَى (وَلَقَدْ عَلِمَتِ الْجِنَّةُ إِنَّهُمْ لَمُحْضَرُوْنَ) سَتُحْضَرُ لِلْحِسَابِ وَقَالَ ابْنُ عَبَّاسٍ (لَنَحْنُ الصَّافُّوْنَ) الْمَلَائِكَةُ(صِرَاطِ الْجَحِيْمِ) سَوَاءِ الْجَحِيْمِ وَوَسَطِ الْجَحِيْمِ (لَشَوْبًا) يُخْلَطُ طَعَامُهُمْ وَيُسَاطُ بِالْحَمِيْمِ (مَدْحُوْرًا) مَطْرُوْدًا (بَيْضٌ مَّكْنُوْنٌ) اللُّؤْلُؤُ الْمَكْنُوْنُ (وَتَرَكْنَا عَلَيْهِ فِي الْآخِرِيْنَ) يُذْكَرُ بِخَيْرٍ وَيُقَالُ (يَسْتَسْخِرُوْنَ) يَسْخَرُوْنَ(بَعْلًا) رَبًّا. মুজাহিদ (রহ.) বলেছেন, আল্লাহর বাণীঃ مِنْ مَكَانٍ بَعِيْدٍ মানে সকল স্থান থেকে। يُقْذَفُوْنَ নিক্ষিপ্ত হবে তাদের প্রতি। وَاصِبٌঅবিরাম বা অব্যাহত। لَازِبٌআঠালো। تَأْتُوْنَنَا عَنِ الْيَمِيْنِ তোমরা তো হাক, কল্যাণ এবং সুখ-শান্তির বাণী নিয়ে আমাদের কাছে আসতে, এ কথাগুলো কাফিররা শায়ত্বনকে বলবে। غَوْلٌ পেটের ব্যথা। يُنْزَفُوْنَ তাদের বুদ্ধি নষ্ট হবে না। قَرِيْنٌ শায়ত্বন। يُهْرَعُوْنَ দ্রুত পদক্ষেপে চলা। يَزِفُّوْنَ দ্রুতগতিতে পথ চলা। بَيْنَ الْجِنَّةِ نَسَبًا কুরাইশ কাফেররা বলত, মালাক আল্লাহর কন্যা এবং তাদের মা জিন নেতাদের কন্যারা। আল্লাহ্ বলেন, وَلَقَدْ عَلِمَتِ الْجِنَّةُ إِنَّهُمْ لَمُحْضَرُوْنَ জিনেরা জানে, তাদেরও উপস্থিত করা হবে- তাদের হাজির করা হবে শাস্তির জন্য। ইবনু ‘আব্বাস (রাঃ) বলেন, لَنَحْنُ الصَّافُّوْنَ ‘আমরা তো সারিবদ্ধভাবে দন্ডায়মান’ দ্বারা মালাইকা বোঝানো হয়েছে। صِرَاطِ الْجَحِيْمِ জাহান্নামের পথে বা জাহান্নামের মধ্যে। لَشَوْبًا তাদের খাদ্য ফুটন্ত পানি মিশ্রিত। مَدْحُوْرًا বিতাড়িত। بَيْضٌ مَكْنُوْنٌ সুরক্ষিত মুক্তা। وَتَرَكْنَا عَلَيْهِ فِي الاٰخِرِيْنَ তাদেরকে সম্মানের সঙ্গে স্মরণ করা হবে। يَسْتَسْخِرُوْنَ তারা উপহাস করত। بَعْلًا দেবমূর্তি। ৪৮০৪. ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেছেনঃ (ইউনুস) ইবনু মাত্তার চেয়ে উত্তম বলে মনে করা কারো জন্য শোভনীয় নয়। [৩৪১২] (আধুনিক প্রকাশনীঃ ৪৪৪০, ইসলামিক ফাউন্ডেশনঃ ৪৪৪১)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 326
			}
		}
	]
}