{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4818,
			"arabicnumber": 4818,
			"text": "باب قوله :(فَإِنْ يَّصْبِرُوْا فَالنَّارُ مَثْوًى لَّهُمْ) ... الآية ৬৫/৪১/৩. অধ্যায়: আল্লাহর বাণীঃ এখন তারা সবর করলেও জাহান্নামই তাদের আবাসস্থল হবে; আর যদি তারা ওযরখাহী করে তবুও তাদের ওযর ক্ববুল করা হবে না। (সূরাহ হা-মীম সিজদা্হ ৪১/২৪) حَدَّثَنَا عَمْرُوْ بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ قَالَ حَدَّثَنِيْ مَنْصُوْرٌ عَنْ مُجَاهِدٍ عَنْ أَبِيْ مَعْمَرٍ عَنْ عَبْدِ اللهِ بِنَحْوِهِ. ‘আবদুল্লাহ্ ইবনু মাস‘উদ (রাঃ) থেকে অনুরূপ বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ , ইসলামিক ফাউন্ডেশনঃ ৪৪৫৫) (42) سُوْرَةُ حم عسق সূরাহ (৪২) : শূরা (হা-মীম, ‘আইন সাদ ক্বাফ) وَيُذْكَرُ عَنْ ابْنِ عَبَّاسٍ (عَقِيْمًا) الَّتِيْ لَا تَلِدُ (رُوْحًا مِّنْ أَمْرِنَا) الْقُرْآنُ وَقَالَ مُجَاهِدٌ (يَذْرَؤُكُمْ فِيْهِ) نَسْلٌ بَعْدَ نَسْلٍ (لَا حُجَّةَ بَيْنَنَا) وَبَيْنَكُمْ لَا خُصُوْمَةَ بَيْنَنَا وَبَيْنَكُمْ (مِنْ طَرْفٍ خَفِيٍّ) ذَلِيْلٍ وَقَالَ غَيْرُهُ (فَيَظْلَلْنَ رَوَاكِدَ عَلٰى ظَهْرِهٰ) يَتَحَرَّكْنَ وَلَا يَجْرِيْنَ فِي الْبَحْرِ (شَرَعُوْا) ابْتَدَعُوْا. ইবনু ‘আব্বাস হতে বর্ণিত। عَقِيْمًا অর্থ বন্ধ্যা। رُوْحًا مِّنْ أَمْرِنَا অর্থাৎ আল কুরআন। মুজাহিদ বলেছেন- يَذْرَؤُكُمْ فِيْهِ, আল্লাহ্ তোমাদেরকে গর্ভাশয়ের মধ্যে ধারাবাহিক বংশ পরম্পরার সঙ্গে সৃষ্টি করতে থাকবেন। لَا حُجَّةَ بَيْنَنَا আমাদের মধ্যে কোন ঝগড়া-বিবাদ নেই। مِنْ طَرْفٍ خَفِيٍّ অবনমিত। মুজাহিদ ছাড়া অন্যরা বলেন। فَيَظْلَلْنَ رَوَاكِدَ عَلٰى ظَهْرِهٰ নৌযানগুলো সমুদ্রপৃষ্ঠে আন্দোলিত হতে থাকে; কিন্তু চলতে পারবে না। شَرَعُوْا তারা আবিষ্কার করেছে। ৪৮১৮. ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন যে, একদা তাকে إِلَّا الْمَوَدَّةَ فِي الْقُرْبٰى সম্পর্কে জিজ্ঞেস করার পর (কাছে উপস্থিত) সা‘ঈদ ইবনু যুবায়র (রাঃ) বললেন, এর অর্থ নবী পরিবারের আত্মীয়তার বন্ধন। (এ কথা শুনে) ইবনু ‘আব্বাস (রাঃ) বললেন, তুমি তাড়াহুড়া করে ফেললে। কেননা কুরাইশের এমন কোন শাখা ছিল না যেখানে নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর আত্মীয়তা ছিল না। রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাদের বলেছেন, আমার এবং তোমাদের মাঝে যে আত্মীয়তার বন্ধন রয়েছে তার ভিত্তিতে তোমরা আমার সঙ্গে আত্মীয়সুলভ আচরণ কর। এই আমি তোমাদের থেকে কামনা করি। [৩৪৯৭] (আধুনিক প্রকাশনীঃ ৪৪৫৪, ইসলামিক ফাউন্ডেশনঃ ৪৪৫৬)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 340
			}
		}
	]
}