{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4827,
			"arabicnumber": 4827,
			"text": "سُوْرَةُ حم الْأَحْقَافِ সূরাহ (৪৬) : হা-মীম আল-আহক্বাফ وَقَالَ مُجَاهِدٌ (تُفِيْضُوْنَ) تَقُوْلُوْنَ وَقَالَ بَعْضُهُمْ (أَثَرَةٍ) وَأُثْرَةٍ وَأَثَارَةٍ بَقِيَّةٌ مِنْ عِلْمٍ وَقَالَ ابْنُ عَبَّاسٍ (بِدْعًامِّنْالرُّسُلِ) لَسْتُ بِأَوَّلِ الرُّسُلِ وَقَالَ غَيْرُهُ (أَرَأَيْتُمْ) هَذِهِ الْأَلِفُ إِنَّمَا هِيَ تَوَعُّدٌ إِنْ صَحَّ مَا تَدَّعُوْنَ لَا يَسْتَحِقُّ أَنْ يُعْبَدَ وَلَيْسَ قَوْلُهُ أَرَأَيْتُمْ بِرُؤْيَةِ الْعَيْنِ إِنَّمَا هُوَ أَتَعْلَمُوْنَ أَبَلَغَكُمْ أَنَّ مَا تَدْعُوْنَ مِنْ دُوْنِ اللهِ خَلَقُوْا شَيْئًا. মুজাহিদ (রহ.) বলেন, تُفِيْضُوْنَ তোমরা বলছ বা বলবে। কোন কোন মুফাসসির বলেছেন, أَثَرَةٍ এবং أُثْرَةٍ ও وَأَثَارَةٍএর অর্থ ‘ইলমের অবশিষ্টাংশ। ইবনু ‘আব্বাস (রাঃ) বলেছেন, بِدْعًا مِنْ الرُّسُلِ আমি তো প্রথম রাসূল নই। অন্য তাফসীরকারগণ বলেছেন, أَرَأَيْتُمْ এর الف অক্ষরটি استفهام تهديد এর জন্য এখানে ব্যবহৃত হয়েছে। অর্থাৎ তোমাদের দাবী যদি সঠিক হয়, তাহলেও তাদের ‘ইবাদাত করার উপযুক্ত তারা নয়। أَرَأَيْتُمْ -এর অর্থ, চাক্ষুস দেখা নয়; বরং এর অর্থ হচ্ছে, তোমরা কি জানতে যে, আল্লাহ্ ছাড়া তোমরা যাদের ‘ইবাদাত করছ, তারা কি কোন কিছু সৃষ্টি করতে সক্ষম? (وَالَّذِيْ قَالَ لِوَالِدَيْهِ أُفٍّ لَّكُمَآ أَتَعِدَانِنِيْٓأَنْ أُخْرَجَ وَقَدْ خَلَتِ الْقُرُوْنُ مِنْ قَبْلِيْ ج وَهُمَا يَسْتَغِيْثَانِ اللهَ وَيْلَكَ اٰمِنْ - إِنَّ وَعْدَ اللهِ حَقٌّ ج فَيَقُوْلُ مَا هٰذَآ إِلَّآ أَسَاطِيْرُ الْأَوَّلِيْنَ) ‘‘আর যে ব্যক্তি তার মাতা-পিতাকে বলেঃ ধিক্ তোমাদেরকে! তোমরা কি আমাকে এ ভয় দেখাও যে, আমি কবর থেকে পুনর্জীবিত হয়ে বহির্গত হব, অথচ আমার পূর্বে বহু জনগোষ্ঠী অতীত হয়েছে? তখন তার মাতা-পিতা আল্লাহর নিকটে ফরিয়াদ করে বলেঃ তোর সর্বনাশ হোক! ঈমান আন। আল্লাহর ওয়াদা অবশ্যই সত্য। কিন্তু সে বলেঃ এটা তো অতীত কালের ভিত্তিহীন উপকথা ব্যতীত আর কিছু নয়।’’ (সূরাহ আল-আহক্বাফ ৪৬/১৭) ৪৮২৭. ইউসুফ ইবনু মাহাক হতে বর্ণিত। তিনি বলেন, মারওয়ান ছিলেন হিজাযের গভর্নর। তাকে নিয়োগ করেছিলেন মু‘আবিয়াহ (রাঃ)। তিনি একদা খুতবা দিলেন এবং তাতে ইয়াযীদ ইবনু মু‘আবিয়ার কথা বারবার বলতে লাগলেন, যেন তাঁর পিতার মৃত্যুর পর তার বায়‘আত গ্রহণ করা হয়। এ সময় তাকে ‘আবদুর রহমান ইবনু আবূ বাকর কিছু কথা বললেন। মারওয়ান বললেন, তাঁকে পাকড়াও কর। তৎক্ষণাৎ তিনি ‘আয়িশাহ (রাঃ)-এর ঘরে চলে গেলেন। তারা তাঁকে ধরতে পারল না। তারপর মারওয়ান বললেন, এ তো সেই লোক যার সম্বন্ধে আল্লাহ্ অবতীর্ণ করেছেন, ‘‘আর এমন লোক আছে যে, মাতাপিতাকে বলে, তোমাদের জন্য আফসোস! তোমরা কি আমাকে এ ভয় দেখাতে চাও যে, আমি পুনরুত্থিত হব যদিও আমার পূর্বে বহু পুরুষ গত হয়েছে, তখন তার মাতাপিতা আল্লাহর নিকট ফরিয়াদ করে বলে, দুর্ভোগ তোমার জন্য। বিশ্বাস স্থাপন কর, আল্লাহর প্রতিশ্রুতি অবশ্যই সত্য। কিন্তু সে বলে এ তো অতীতকালের উপকথা ব্যতীত কিছুই নয়।’’ (আধুনিক প্রকাশনীঃ ৪৪৬৩, ইসলামিক ফাউন্ডেশনঃ ৪৪৬৫)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 349
			}
		}
	]
}