{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4855,
			"arabicnumber": 4855,
			"text": "سُوْرَةُ وَالنَّجْمِ সূরাহ (৫৩) : আন্-নাজম وَقَالَ مُجَاهِدٌ (ذُوْ مِرَّةٍ)ذُوْ قُوَّةٍ (قَابَ قَوْسَيْنِ) حَيْثُ الْوَتَرُ مِنَ الْقَوْسِ (ضِيْزَىْ) عَوْجَاءُ (وَأَكْدٰى) قَطَعَ عَطَاءَهُ (رَبُّالشِّعْرٰى) هُوَ مِرْزَمُ الْجَوْزَاءِ (الَّذِيْ وَفّٰى) وَفَّى مَا فُرِضَ عَلَيْهِ (أَزِفَتِ الْاٰزِفَةُ) اقْتَرَبَتْ السَّاعَةُ (سَامِدُوْنَ) الْبَرْطَمَةُ وَقَالَ عِكْرِمَةُ يَتَغَنَّوْنَ بِالْحِمْيَرِيَّةِ وَقَالَ إِبْرَاهِيْمُ (أَفَتُمَارُوْنَه”) أَفَتُجَادِلُوْنَهُ وَمَنْ قَرَأَ أَفَتَمْرُوْنَهُ يَعْنِيْ أَفَتَجْحَدُوْنَهُ وَقَالَ (مَا زَاغَ الْبَصَرُ) بَصَرُ مُحَمَّدٍ e(وَمَا طَغٰى) وَمَا جَاوَزَ مَا رَأَى (فَتَمَارَوْا) كَذَّبُوْا وَقَالَ الْحَسَنُ (إِذَا هَوٰى) غَابَ وَقَالَ ابْنُ عَبَّاسٍ (أَغْنٰى وَأَقْنٰى) أَعْطَى فَأَرْضَى. মুজাহিদ (রহ.) বলেন, ذُوْ مِرَّةٍ শক্তিশালী। قَابَ قَوْسَيْنِ দুই ধনুকের ছিলার পরিমাণ। ضِيْزَىْ বক্রতা وَأَكْدٰى সে তাঁর দান বন্ধ করে দেয়। رَبُّ الشِّعْرٰى জওযারামীর মিরজাম নক্ষত্র। الَّذِيْوَفّٰى সে তাঁর প্রতি ন্যস্ত দায়িত্ব পালন করেছে। أَزِفَتْ الْاٰزِفَةُ ক্বিয়ামাত (কিয়ামত) সন্নিকট। سَامِدُوْنَ দ্বারা بَرْطَمَةُ নামক খেলাধুলা বোঝানো হয়েছে। ইকরামাহ (রাঃ) বলেন, হামারিয়্যাহ ভাষায় গান গাওয়াকে سَامِدُوْنَ বলা হয়। ইব্রাহীম (রহ.) বলেন, أَفَتَجْحَدُوْنَه তোমরা কি তাঁর সঙ্গে বিতর্ক করবে? যারা এ শব্দটিকে أَفَتَجْحَدُوْنَه পড়ে, তাদের কিরাআত অনুসারে এর অর্থ হবে أَفَتَجْحَدُوْنَه তোমরা কি তার কথাকে অস্বীকার করবে? مَا زَاغَ الْبَصَرُ (মুহাম্মদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর) দৃষ্টি বিভ্রম হয়নি وَمَاطَغٰى এবং তাঁর দৃষ্টি লক্ষ্যভ্রষ্টও হয়নি। فَتَمَارَوْا তারা মিথ্যা প্রতিপন্ন করল। হাসান (রহ.) বলেন, إِذَاهَوٰى যখন সে অদৃশ্য হয়ে গেল। ইবনু ‘আব্বাস (রাঃ) বলেন, أَغْنٰىوَأَقْنٰى তিনি দান করলেন এবং খুশী করে দিলেন। ৪৮৫৫. মাসরূক (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আয়িশাহ (রাঃ)-কে জিজ্ঞেস করলাম, আম্মা! মুহাম্মদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম কি তাঁর রবকে দেখেছিলেন তিনি বললেন, তোমার কথায় আমার গায়ের পশম কাঁটা দিয়ে খাড়া হয়ে গেছে। তিনটি কথা সম্পর্কে তুমি কি জান না যে তোমাকে এ তিনটি কথা বলবে সে মিথ্যা বলবে। যদি কেউ তোমাকে বলে যে, মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাঁর প্রতিপালককে দেখেছেন, তাহলে সে মিথ্যাচারী। তারপর তিনি পাঠ করলেন, তিনি দৃষ্টিশক্তির অধিগম্য নহেন কিন্তু দৃষ্টিশক্তি তাঁর অধিগত; এবং তিনিই সূক্ষ্মদর্শী, সম্যক পরিজ্ঞাত’’ ‘‘মানুষের এমন মর্যাদা নেই যে, আল্লাহ্ তাঁর সঙ্গে কথা বলবেন, ওয়াহীর মাধ্যম ব্যতীত অথবা পর্দার আড়াল ছাড়া’’। আর যে ব্যক্তি তোমাকে বলবে যে, আগামীকাল কী হবে সে তা জানে, তাহলে সে মিথ্যাচারী। তারপর তিনি তিলাওয়াত করলেন, ‘‘কেউ জানে না আগামীকাল সে কী অর্জন করবে।’’ এবং তোমাকে যে বলবে, মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম কোন কথা গোপন রেখেছেন, তাহলেও সে মিথ্যাচারী। এরপর তিনি পাঠ করলেন, ‘‘হে রাসূল! তোমার প্রতিপালকের নিকট হতে তোমার প্রতি যা অবতীর্ণ হয়েছে, তা প্রচার কর। হ্যাঁ, তবে রাসূল জিব্রীল (আঃ)-কে তাঁর নিজস্ব আকৃতিতে দু’বার দেখেছেন। [৩২৩৪] (আধুনিক প্রকাশনীঃ ৪৪৮৮, ইসলামিক ফাউন্ডেশনঃ ৪৪৯১)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 376
			}
		}
	]
}