{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4864,
			"arabicnumber": 4864,
			"text": "سُوْرَةُ اقْتَرَبَتْ السَّاعَةُ সূরাহ (৫৪) : ইক্বতারাবাতিস্ সা-আহ্ (আল-কামার) قَالَ مُجَاهِدٌ (مُسْتَمِرٌّ) ذَاهِبٌ (مُزْدَجَرٌ) مُتَنَاهٍ (وَازْدُجِرَ) فَاسْتُطِيْرَ جُنُوْنًا (دُسُرٍ) أَضْلَاعُ السَّفِيْنَةِ (لِمَنْ كَانَ كُفِرَ) يَقُوْلُ كُفِرَ لَهُ جَزَاءً مِنْ اللهِ (مُحْتَضَرٌ) يَحْضُرُوْنَ الْمَاءَ وَقَالَ ابْنُ جُبَيْرٍ (مُهْطِعِيْنَ) النَّسَلَانُ الْخَبَبُ السِّرَاعُ وَقَالَ غَيْرُهُ (فَتَعَاطٰى) فَعَاطَهَا بِيَدِهِ فَعَقَرَهَا (الْمُحْتَظِرِ) كَحِظَارٍ مِنْ الشَّجَرِ مُحْتَرِقٍ (ازْدُجِرَ) افْتُعِلَ مِنْ زَجَرْتُ (كُفِرَ) فَعَلْنَا بِهِ وَبِهِمْ مَا فَعَلْنَا جَزَاءً لِمَا صُنِعَ بِنُوْحٍ وَأَصْحَابِهِ (مُسْتَقِرٌّ) عَذَابٌ حَقٌّ يُقَالُ (الأَشَرُ) الْمَرَحُ وَالتَّجَبُّرُ. মুজাহিদ (রহ.) বলেন, مُسْتَمِرٌّ বিলুূপ্ত। مُزْدَجَرٌ বাধা দানকারী। وَازْدُجِرَ তাকে পাগল করে দেয়ার ব্যাপারে ভীতি প্রদর্শন করা হয়েছে। دُسُرٍ নৌকার কীলক। لِمَنْ كَانَ كُفِرَ এর কারণে যে নূহ্ (আঃ)-কে প্রত্যাখ্যান করা হয়েছিল।جَزَآءً প্রতিদান আল্লাহর তরফ থেকে। مُحْتَضَرٌ তারা পানির জন্য উপস্থিত হবে। ইবনু জুবায়র (রহ.) বলেন, مُهْطِعِيْنَ তারা দ্রুত চলবে। ইবনু জুবায়র (রহ.) ব্যতীত অন্যরা বলেছেন, فَتَعَاطٰى তারপর সে উষ্ট্রীটিকে ধরল এবং তাকে হত্যা করল। الْمُحْتَظِرِ শুকনো গাছের বেড়া যা জ্বলে গেছে। ازْدُجِرَ - زَجَرْتُ ধাতু হতে بابافْتُعِلَ এর زَجَرْتُ، صيحه থেকে এর নিষ্পন্ন। كُفِرَ আমি নূহ্ এবং তাঁর কওমের সঙ্গে যা করেছি তা প্রতিদান ছিল ঐ ‘আমলের, যা তাঁর কওমের লোকেরা তাঁর ও তাঁর সাথীদের সঙ্গে করেছিল। مُسْتَقِرٌّ আল্লাহর তরফ থেকে শাস্তি। الْأَشَرُ দাম্ভিকতা ও অহংকার। ৪৮৬৪. ‘আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সময় চাঁদ খন্ডিত হয়েছে। এর এক খন্ড পর্বতের উপর এবং অপর খন্ড পর্বতের নিচে পড়েছিল। তখন রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা সাক্ষী থাক। [৩৬৩৬] (আধুনিক প্রকাশনীঃ ৪৪৯৭, ইসলামিক ফাউন্ডেশনঃ ৪৫০০)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 385
			}
		}
	]
}