{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4881,
			"arabicnumber": 4881,
			"text": "سُوْرَةُ الْوَاقِعَةِ সূরাহ (৫৬) : ওয়াকি‘আহ وَقَالَ مُجَاهِدٌ (رُجَّتْ) زُلْزِلَتْ (بُسَّتْ) فُتَّتْ لُتَّتْ كَمَا يُلَتُّ السَّوِيْقُ (الْمَخْضُوْدُ) الْمُوْقَرُ حَمْلًا وَيُقَالُ أَيْضًا لَا شَوْكَ لَهُ (مَنْضُوْدٍ) الْمَوْزُ (وَالْعُرُبُ) الْمُحَبَّبَاتُ إِلَى أَزْوَاجِهِنَّ (ثُلَّةٌ) أُمَّةٌ (يَحْمُوْمٍ) دُخَانٌ أَسْوَدُ (يُصِرُّوْنَ) يُدِيْمُوْنَ (الْهِيْمُ) الإِبِلُ الظِّمَاءُ (لَمُغْرَمُوْنَ) لَمَلُوْمُوْنَ (مَدِيْنِيْنَ) مُحَاسَبِيْنَ رَوْحٌ جَنَّةٌ وَرَخَاءٌ (وَرَيْحَانٌ) الرِّزْقُ (وَنُنْشِئَكُمْفِي) أَيِّ خَلْقٍ نَشَاءُ وَقَالَ غَيْرُهُ (تَفَكَّهُوْنَ) تَعْجَبُوْنَ عُرُبًا مُثَقَّلَةً وَاحِدُهَا عَرُوْبٌ مِثْلُ صَبُوْرٍ وَصُبُرٍ يُسَمِّيْهَا أَهْلُ مَكَّةَ الْعَرِبَةَ وَأَهْلُ الْمَدِيْنَةِ الْغَنِجَةَ وَأَهْلُ الْعِرَاقِ الشَّكِلَةَ. وَقَالَ فِيْ (خَافِضَةٌ) لِقَوْمٍ إِلَى النَّارِ (وَرَافِعَةٌ) إِلَى الْجَنَّةِ (مَوْضُوْنَةٍ) مَنْسُوْجَةٍ وَمِنْهُ وَضِيْنُ النَّاقَةِ وَالْكُوْبُ لَا آذَانَ لَهُ وَلَا عُرْوَةَ (وَالْأَبَارِيْقُ) ذَوَاتُ الْآذَانِ وَالْعُرَى (مَسْكُوْبٍ) جَارٍ (وَفُرُشٍ مَّرْفُوْعَةٍ) بَعْضُهَا فَوْقَ بَعْضٍ (مُتْرَفِيْنَ) مُمَتَّعِيْنَ (مَا تُمْنُوْنَ) مِنْ النُّطَفِ يَعْنِيْ هِيَ النُّطْفَةُ فِيْ أَرْحَامِ النِّسَاءِ (لِلْمُقْوِيْنَ) لِلْمُسَافِرِيْنَ وَالْقِيُّ الْقَفْرُ(بِمَوَاقِعِ النُّجُوْمِ) بِمُحْكَمِ الْقُرْآنِ وَيُقَالُ بِمَسْقِطِ النُّجُوْمِ إِذَا سَقَطْنَ وَمَوَاقِعُ وَمَوْقِعٌ وَاحِدٌ (مُدْهِنُوْنَ) مُكَذِّبُوْنَ مِثْلُ (لَوْ تُدْهِنُ فَيُدْهِنُوْنَ فَسَلَامٌ لَّكَ) أَيْ مُسَلَّمٌ لَكَ إِنَّكَ (مِنْ أَصْحَابِ الْيَمِيْنِ) وَأُلْغِيَتْ إِنَّ وَهُوَ مَعْنَاهَا كَمَا تَقُوْلُ أَنْتَ مُصَدَّقٌ مُسَافِرٌ عَنْ قَلِيْلٍ إِذَا كَانَ قَدْ قَالَ إِنِّيْ مُسَافِرٌ عَنْ قَلِيْلٍ وَقَدْ يَكُوْنُ كَالدُّعَاءِ لَهُ كَقَوْلِكَ فَسَقْيًا مِنْ الرِّجَالِ إِنْ رَفَعْتَ السَّلَامَ فَهُوَ مِنْ الدُّعَاءِ (تُوْرُوْنَ) تَسْتَخْرِجُوْنَ أَوْرَيْتُ أَوْقَدْتُ (لَغْوًا) بَاطِلًا (تَأْثِيْمًا) كَذِبًا. মুজাহিদ (রহ.) বলেন, رُجَّتْ প্রকম্পিত হবে। بُسَّتْ চূর্ণ-বিচূর্ণ হওয়া, ছাতু যেমন চূর্ণ-বিচূর্ণ করা হয় তেমিনভাবে চূর্ণ-বিচূর্ণ করা হবে। الْمَخْضُوْدُ বোঝার কারণে চরম ভারাক্রান্ত। কণ্টকহীন বৃক্ষকেও مَخْضُوْدُ বলা হয়। مَنْضُوْدٍ কলা। الْعُرُبُ স্বামীর কাছে প্রিয়তমা স্ত্রীগণ। ثُلَّةٌ উম্মত। يَحْمُوْمٍ কালো ধোঁয়া। يُصِرُّوْنَ তারা অবিরাম করতে থাকবে। الْهِيْمُ পিপাসিত উট। لَمُغْرَمُوْنَ যাদের উপর ঋণ পরিশোধ করা অপরিহার্য করে দেয়া হয়েছে। رَوْحُ উদ্যান ও কোমলতা। اَلرَيْحَانُ জীবনোপকরণ। نَنْشَأَكُمْ যে কোন আকৃতিতে আমি তোমাদেরকে সৃষ্টি করব। মুজাহিদ ব্যতীত অন্যান্য মুফাস্সির বলেন, تَفَكَّهُوْنَ তোমরা বিস্মিত হয়ে যাবে। عُرُبًا বহুবচন। একবচনে عَرُوْبٌ যেমন, صُبُرٌ বহুবচন। একবচনে صَبُوْرٍ মক্কাবাসী লোকেরা তাকে الْعَرِبَةَ মদিনা্বাসী লোকেরা الْغَنِجَةَ এবং ইরাকী লোকেরা তাকে الشَّكِلَةَ বলে। خَافِضَةٌ তা একদল লোককে জাহান্নামে নিয়ে যাবে। رَافِعَةٌ তা একদল লোককে জান্নাতে নিয়ে যাবে। مَوْضُوْنَةٍ مَّنْسُوْجَةٍ গ্রথিত। এর থেকেই وَضَيْنُ النَّاقِةٍ শব্দটির উৎপত্তি (অর্থ উটের পালানের রশি) الكُوْبُ নল ও হাতলবিহীন পানপাত্র। الْأَبَارِيْقُ নল ও হাতল সম্পন্ন লোটা। مَسْكُوْبٍ প্রবহমান। وَفُرُشٍ مَّرْفُوْعَةٍ একটির উপর আরেকটি বিছানো শয্যাসমূহ। مُتْرَفِيْنَ ভোগ বিলাসী লোকজন। مَا تُمْنُوْنَ মহিলাদের গর্ভাশয়ে নিক্ষিপ্ত বীর্য। لِلْمُقْوِيْنَ মুসাফিরদের জন্য। الْقِيُّ ঘাস, পানি এবং জন-মানবহীন ভূমি। بِمَوَاقِعِ النُّجُوْمِ কুরআনের মুহ্কাম আয়াতসমূহ। بِمَسْقِطِ النُّجُوْمِ নক্ষত্ররাজির অস্তাচলের স্থান। مَوَاقِعٌ এবং مَوْقِعٌ শব্দ দু’টো একই অর্থে ব্যবহৃত হয়। مُدْهِنُوْنَ তুচ্ছকারী লোকজন। যেমন অন্যত্র আছে, لَوْ تُدْهِنُ فَيُدْهِنُوْنَ যদি তুমি তুচ্ছ কর, তবে তারাও তুচ্ছ করবে। فَسَلَامٌ لَكَ তোমার প্রতি শান্তি বর্ষিত হোক। কেননা, তুমি দক্ষিণ পার্শ্বে অবস্থিত। এখানে إِنَّশব্দটি উহ্য আছে। যেমন, اِنِّىْ مُسَافِرٌ عَنْ قَلِيْلٍ এর উত্তরে কথিত أَنْتَ مُصَدَّقٌ مُّسَافِرٌ عَنْ قَلِيْلٍ বাক্যের মাঝে إِنَّ শব্দটি উহ্য আছে। মূলে ছিল إِنَّكَ مُسَافِرٌ শ্রোতার প্রতি দু‘আ হিসেবেও سَلَامَ শব্দটি ব্যবহৃত হয়েছে। যেমন فَسَقْيًا مِّنْ الرِّجَالِ (পরিতৃপ্ত লোকজন) বাক্যটিও দু‘আ হিসাবে ব্যবহৃত হয়েছে। سَلَامٌ শব্দটিকে مَرْفُوْعٌ পড়া হলে তা দু‘আ হিসেবেই গণ্য হবে। تُوْرُوْنَ তোমরা বের কর, প্রজ্জ্বলিত কর। পক্ষান্তরে أَوْرَيْتُ بِمَعْزٍ اَوْ فَدْتُ থেকে تُوْرُوْنَ শব্দটির উৎপত্তি। لَغْوًا অসার। تَأْثِيْمًا মিথ্যা বাক্য। ৪৮৮১. আবূ হুরাইরাহ (রাঃ) নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন। তিনি বলেছেন, জান্নাতের মধ্যে এমন একটি বৃক্ষ আছে, যার ছায়ায় একজন সওয়ারী একশত বছর চলতে থাকবে, তবুও সে এ ছায়া অতিক্রম করতে পারবে না। তোমার ইচ্ছে হলে তুমি (সম্প্রসারিত ছায়া) পাঠ কর। [৩২৫২] (আধুনিক প্রকাশনীঃ ৪৫১৩, ইসলামিক ফাউন্ডেশনঃ ৪৫১৬)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 401
			}
		}
	]
}