{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4904,
			"arabicnumber": 4904,
			"text": "(وَإِذَاقِيْلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُوْلُ اللهِ لَوَّوْا رُؤُوْسَهُمْ وَرَأَيْتَهُمْ يَصُدُّوْنَ وَهُمْ مُّسْتَكْبِرُوْنَ) আর যখন তাদেরকে বলা হয়ঃ তোমরা এসো আল্লাহর রসূল তোমাদের জন্য ক্ষমা প্রার্থনা করবেন, তখন তারা নিজেদের মাথা ঘুরিয়ে নেয়। আর আপনি তাদের দেখবেন যে, তারা অহংকারের সঙ্গে মুখ ফিরিয়ে নেয়। (সূরাহ মুনাফিকুন ৬৩/৫) حَرَّكُوا اسْتَهْزَءُوْا بِالنَّبِيِّ صلى الله عليه وسلم وَيُقْرَأُ بِالتَّخْفِيْفِ مِنْ لَوَيْتُ. لَوَّوْا তারা মাথা নেড়ে নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সঙ্গে ঠাট্টা করত। কেউ কেউ لَوَّوْا শব্দটিকে لَوَيْتُ (تَخْفِيْفِ সহকারে) পড়ে থাকেন। ৪৯০৪. যায়দ ইবনু আরকাম (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আমার চাচার সঙ্গে ছিলাম। এ সময় শুনলাম, ‘আবদুল্লাহ্ ইবনু উবাই ইবনু সালূল বলছে, ‘‘আল্লাহর রাসূলের সঙ্গীদের জন্য তোমরা ব্যয় করবে না যতক্ষণ না তারা সরে পড়ে’’ এবং ‘‘আমরা মদিনা্য় ফিরলে সেখান থেকে প্রবল লোকেরা দুর্বল লোকদেরকে অবশ্যই বের করে দিবে’’। এ কথা আমি আমার চাচার কাছে জানালাম। আমার চাচা তা নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে জানালেন, নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমাকে ডাকলেন। আমি বিস্তারিতভাবে এ কথা তাঁর কাছে বললাম। তখন তিনি ‘আবদুল্লাহ্ ইবনু উবাই ও তার সাথী-সঙ্গীদেরকে ডেকে পাঠালেন। তারা সকলেই কসম করে বলল, এ কথা তারা বলেনি। ফলে নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমাকে মিথ্যাচারী ও তাদেরকে সত্যবাদী মনে করলেন। এতে আমি এমন দুঃখ পেলাম যে, এমন দুঃখ আর কখনও পাইনি। এরপর আমি ঘরে বসে গেলাম। তখন আমার চাচা আমাকে বললেন, এমন কাজের কেন ইচ্ছে করলে, যার ফলে নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তোমাকে মিথ্যাচারী স্থির করলেন এবং তোমার প্রতি অসন্তুষ্ট হলেন? এ সময় আল্লাহ্ তা‘আলা অবতীর্ণ করলেনঃ ‘‘যখন মুনাফিকরা তোমার কাছে আসে তারা বলে, আমরা সাক্ষ্য দিচ্ছি যে, আপনি নিশ্চয়ই আল্লাহর রাসূল’’ তখন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমার কাছে লোক পাঠালেন এবং সূরাটি আমার সামনে তিলাওয়াত করলেন ও বললেন, আল্লাহ্ তোমাকে সত্যবাদী বলে ঘোষণা করেছেন। [৪৯০০] (আধুনিক প্রকাশনীঃ ৪৫৩৬, ইসলামিক ফাউন্ডেশনঃ ৪৫৪০)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 424
			}
		}
	]
}