{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4913,
			"arabicnumber": 4913,
			"text": "(تَبْتَغِيْ مَرْضَاتَ أَزْوَاجِكَ ط وَاللهُ غَفُوْرٌ رَّحِيْمٌ - قَدْ فَرَضَ اللهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ج وَاللهُ مَوْلٰكُمْ ج وَهُوَ الْعَلِيْمُ الْحَكِيْمُ). আপনি আপনার স্ত্রীদের খুশী করতে চাইছেন। আল্লাহ তো তোমাদের জন্য নির্ধারণ করে দিয়েছেন কসম থেকে মুক্তির ব্যবস্থা। আল্লাহ তোমাদের বন্ধু। তিনি সর্বজ্ঞ, প্রজ্ঞাময়। (সূরাহ আত্-তাহরীম ৬৬/১-২) ৪৯১৩. ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার ইবনু খাত্তাব (রাঃ)-কে এ আয়াতের ব্যাখ্যা সম্পর্কে জিজ্ঞেস করার জন্য আমি এক বছর অপেক্ষা করেছি। কিন্তু তাঁর বাক্তিত্বের প্রভাবের ভয়ে আমি তাঁকে এ বিষয়ে জিজ্ঞেস করতে পারিনি। অবশেষে তিনি হজ্জের উদ্দেশে রওয়ানা হলে, আমিও তাঁর সঙ্গে গেলাম। ফেরার পথে আমরা যখন কোন একটি রাস্তা অতিক্রম করছিলাম, তখন তিনি প্রাকৃতিক প্রয়োজন পূরণের জন্য একটি পিলু গাছের আড়ালে গেলেন। ইবনু ‘আব্বাস (রাঃ) বলেন, তিনি প্রয়োজন সেরে না আসা পর্যন্ত আমি সেখানে দাঁড়িয়ে অপেক্ষা করলাম। এরপর তাঁর সঙ্গে পথ চলতে চলতে বললাম, হে আমীরুল মু’মিনীন! নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর স্ত্রীদের কোন্ দু’জন তার বিপক্ষে একমত হয়ে পরস্পর একে অন্যকে সহযোগিতা করেছিলেন? তিনি বললেন, তাঁরা দু’জন হল হাফসাহ ও ‘আয়িশাহ (রাঃ)। ইবনু ‘আব্বাস (রাঃ) বলেন, আমি বললাম, আল্লাহর শপথ! আমি আপনাকে এ বিষয়ে জিজ্ঞেস করার জন্য এক বছর যাবৎ ইচ্ছে করেছিলাম। কিন্তু আপনার ভয়ে আমার পক্ষে তা সম্ভব হয়নি। তখন ‘উমার (রাঃ) বললেন, এ রকম করবে না। যে বিষয়ে তুমি মনে করবে যে, আমি তা জানি, তা আমাকে জিজ্ঞেস করবে। এ বিষয়ে আমার জানা থাকলে আমি তোমাকে জানিয়ে দেব। তিনি বলেন, এরপর ‘উমার (রাঃ) বললেন, আল্লাহর শপথ! জাহিলী যুগে মহিলাদের কোন অধিকার আছে বলে আমরা মনে করতাম না। অবশেষে আল্লাহ্ তা‘আলা তাদের সম্পর্কে যে বিধান অবতীর্ণ করার ছিল তা অবতীর্ণ করলেন এবং তাদের হক হিসাবে যা নির্দিষ্ট করার ছিল তা নির্দিষ্ট করলেন। তিনি বলেন, একদিন আমি কোন এক ব্যাপারে চিন্তা ভাবনা করছিলাম, এমন সময় আমার স্ত্রী আমাকে বললেন, কাজটি যদি তুমি এভাবে এভাবে করতে। আমি বললাম, তোমার কী প্রয়োজন? এবং আমার কাজে তোমার এ অনধিকার চর্চা কেন। সে আমাকে বলল, হে খাত্তাবের বেটা! কি আশ্চর্য, তুমি চাও না যে, আমি তোমার কথার উত্তর দান করি অথচ তোমার কন্যা হাফ্সাহ (রাঃ) রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কথার পৃষ্ঠে কথা বলে থাকে। এমনকি একদিন তো সে রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে রাগান্বিত করে ফেলে। এ কথা শুনে ‘উমার (রাঃ) দাঁড়িয়ে গেলেন এবং চাদরখানা নিয়ে তার বাড়িতে চলে গেলেন। তিনি তাকে বললেন, বেটী! তুমি নাকি রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কথার প্রতি-উত্তর করে থাক। ফলে তিনি দিনভর দুঃখিত থাকেন। হাফসাহ (রাঃ) বলেন, আল্লাহর কসম! আমরা তো অবশ্যই তাঁর কথার জবাব দিয়ে থাকি। ‘উমার (রাঃ) বলেন, আমি বললাম, জেনে রাখ! আমি তোমাকে আল্লাহর শাস্তি এবং রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর অসন্তুষ্টি সম্পর্কে সতর্ক করছি। রূপ-সৌন্দর্যের কারণে রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর ভালবাসা যাকে গর্বিতা করে রেখেছে, সে যেন তোমাকে প্রতারিত না করতে পারে। এ কথা বলে ‘উমার (রাঃ) ‘আয়িশাহ (রাঃ)-কে বোঝাচ্ছিলেন। ‘উমার (রাঃ) বলেন, এরপর আমি সেখান থেকে বেরিয়ে আসলাম এবং উম্মু সালামাহ (রাঃ)-এর ঘরে প্রবেশ করলাম ও এ ব্যাপারে তাঁর সঙ্গে আলোচনা করলাম। কারণ, তাঁর সঙ্গে আমার আত্মীয়তার সম্পর্ক ছিল। তখন উম্মু সালামাহ (রাঃ) বললেন, হে খাত্তাবের বেটা! কি আশ্চর্য, তুমি প্রত্যেক ব্যাপারেই নাক গলাচ্ছ, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম ও তার স্ত্রীদের ব্যাপারেও হস্তক্ষেপ করতে চাচ্ছ। আল্লাহর কসম! তিনি আমাকে এমন শক্তভাবে ধরলেন যে, আমার রাগ খতম হয়ে গেল। এরপর আমি তাঁর নিকট হতে চলে আসলাম। আমার একজন আনসার বন্ধু ছিল। যদি আমি কোন মাজলিসে অনুপস্থিত থাকতাম তাহলে সে এসে মাজলিসের খবর আমাকে জানাত। আর সে যদি অনুপস্থিত থাকত তাহলে আমি এসে তাকে মাজলিসের খবর জানাতাম। সে সময় আমরা গাসসানী বাদশাহর আক্রমণের আশংকা করছিলাম। আমাদেরকে বলা হয়েছিল যে, সে আমাদের সঙ্গে যুদ্ধ করার জন্য রওয়ানা হয়েছে। তাই আমাদের হৃদয়-মন এ ভয়ে শংকিত ছিল। এমন সময় আমার আনসার বন্ধু এসে দরজায় আঘাত করে বললেন, দরজা খুলুন, দরজা খুলুন। আমি বললাম, গাস্সানীরা চলে এসেছে নাকি? তিনি বললেন, বরং এর চেয়েও কঠিন ব্যাপার ঘটে গেছে। রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তাঁর সহধর্মিণীদের থেকে পৃথক হয়ে গিয়েছেন। তখন আমি বললাম, হাফসাহ ও ‘আয়িশাহর নাক ধূলায় ধূসরিত হোক। এরপর আমি কাপড় নিয়ে বেরিয়ে গেলাম। গিয়ে দেখলাম, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম একটি উঁচু কক্ষে অবস্থান করছেন। সিঁড়ি বেয়ে সেখানে পৌঁছতে হয়। সিঁড়ির মুখে রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর একজন কালো গোলাম বসা ছিল। আমি বললাম, বলুন, ‘উমার ইবনু খাত্তাব এসেছেন। এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমাকে অনুমতি দিলেন, আমি তাঁকে সব কথা বললাম, আমি যখন উম্মু সালামাহর কপোপকথন পর্যন্ত পৌঁছলাম তখন রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম মুচকি হাসলেন। এ সময় তিনি একটা চাটাইয়ের উপর শুয়ে ছিলেন। চাটাই এবং রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর মাঝে আর কিছুই ছিল না। তাঁর মাথার নিচে ছিল খেজুরের ছালভর্তি চামড়ার একটি বালিশ এবং পায়ের কাছে ছিল সল্ম বৃক্ষের পাতার একটি স্তূপ ও মাথার উপর লটকানো ছিল চামড়ার একটি মশক। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর এক পার্শ্বে চাটাইয়ের দাগ দেখে কেঁদে ফেললে তিনি বললেন, তুমি কেন কাঁদছ? আমি বললাম, হে আল্লাহর রাসূল! কিসরা ও কায়সার পার্থিব ভোগ-বিলাসের মধ্যে ডুবে আছে, অথচ আপনি আল্লাহর রাসূল। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, তুমি এতে সন্তুষ্ট নও যে, তারা দুনিয়া লাভ করুক, আর আমরা আখিরাত লাভ করি। [৮৯; মুসলিম ১৮/৫, হাঃ ১৪৭৯] (আধুনিক প্রকাশনীঃ ৪৫৪৪, ইসলামিক ফাউন্ডেশনঃ ৪৫৪৮)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 433
			}
		}
	]
}