{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4930,
			"arabicnumber": 4930,
			"text": "سُوْرَةُ الإنسان [هَلْ أَتَى عَلَى الإِنْسَانِ] সূরাহ (৭৬) : ইনসান (আদ্-দাহর) ‘‘কালের প্রবাহে মানুষের উপর এমন এক সময় এসেছিল কি?’’ يُقَالُ مَعْنَاهُ أَتَى عَلَى الإِنْسَانِ وَهَلْ تَكُوْنُ جَحْدًا وَتَكُوْنُ خَبَرًا وَهَذَا مِنَ الْخَبَرِ يَقُوْلُ كَانَ شَيْئًا فَلَمْ يَكُنْ مَذْكُوْرًا وَذَلِكَ مِنْ حِيْنِ خَلَقَهُ مِنْ طِيْنٍ إِلَى أَنْ يُنْفَخَ فِيْهِ الرُّوْحُ (أَمْشَاجٍ) الْأَخْلَاطُ مَاءُ الْمَرْأَةِ وَمَاءُ الرَّجُلِ الدَّمُ وَالْعَلَقَةُ وَيُقَالُ إِذَا خُلِطَ مَشِيْجٌ كَقَوْلِكَ خَلِيْطٌ وَمَمْشُوْجٌ مِثْلُ مَخْلُوْطٍ وَيُقَالُ (سَلَاسِلًا وَأَغْلَالًا) وَلَمْ يُجْرِ بَعْضُهُمْ (مُسْتَطِيْرًا) مُمْتَدًّا الْبَلَاءُ (وَالْقَمْطَرِيْرُ) الشَّدِيْدُ يُقَالُ يَوْمٌ قَمْطَرِيْرٌ وَيَوْمٌ قُمَاطِرٌ وَالْعَبُوْسُ وَالْقَمْطَرِيْرُ وَالْقُمَاطِرُ وَالْعَصِيْبُ أَشَدُّ مَا يَكُوْنُ مِنَ الْأَيَّامِ فِي الْبَلَاءِ وَقَالَ الْحَسَنُ (النُّضْرَةُ) فِي الْوَجْهِ وَالسُّرُوْرُ فِي الْقَلْبِ وَقَالَ ابْنُ عَبَّاسٍ (الأَرَآئِكِ) السُّرُرُ وَقَالَ الْبَرَاءُ (وَذُلِّلَتْ قُطُوْفُهَا) يَقْطِفُوْنَ كَيْفَ شَاءُوْا وَقَالَ مَعْمَرٌ (أَسْرَهُمْ) شِدَّةُ الْخَلْقِ وَكُلُّ شَيْءٍ شَدَدْتَهُ مِنْ قَتَبٍ وَغَبِيْطٍ فَهُوَ مَأْسُوْرٌ. অর্থাৎ কালের প্রবাহে মানুষের উপর এক সময় এসেছিল। هَلْ শব্দটি কখনো নেতিবাচক, আবার কখনো ইতিবাচক অর্থে ব্যবহৃত হয়। তবে এখানে অবহিতকরণ তথা ইতিবাচক অর্থে ব্যবহৃত হয়েছে। আল্লাহ্ বলেন, এক সময় মানুষের অস্তিত্ব ছিল কিন্তু উল্লেখযোগ্য কোন বস্তু ছিল না। আর ঐ সময়টা হল মাটি থেকে সৃষ্টি করা হতে তার মধ্যে প্রাণ সঞ্চার করা পর্যন্ত। أَمْشَاجٍ সংমিশ্রণ। অর্থাৎ মাতৃগর্ভে পুরুষ ও মহিলার বীর্যের সংমিশ্রণে রক্ত এবং পরে জমাট বাঁধা রক্ত সৃষ্টি হওয়াকে أَمْشَاجٍ বলা হয়েছে। এক বস্তুর অপর বস্তুর সঙ্গে মিশ্রিত হলে তাকে مَشِيْجٌ বলে। তাকে خَلِيْطٌ ও বলা হয়। আর مَمْشُوْجٌ ও مَخْلُوْطٍ এর অর্থ একই। কেউ কেউ سَلَاسِلًا وَأَغْلَالًا পড়ে থাকেন। কিন্তু কেউ কেউ এভাবে পড়াকে জায়িয মনে করেন না। مُسْتَطِيْرًا দীর্ঘস্থায়ী বিপদ। الْقَمْطَرِيْرُ ভয়ংকর ও কঠিন। সুতরাং يَوْمٌ قَمْطَرِيْرٌ এবং يَوْمٌ قُمَاطِرٌ উভয়ই ব্যবহৃত হয়। الْعَبُوْسُ، الْقَمْطَرِيْرُ، الْقُمَاطِرُ، এবং الْعَصِيْبُ বিপদের সবচেয়ে কঠিনতম দিনকে বলা হয়। হাসান (রহ.) বলেন, النُّضْرَةُ চেহারায় সজীবতা ও হৃদয়ে আনন্দ। ইবনু ‘আব্বাস (রাঃ) বলেন, الْأَرَآئِكِ খাট-পালঙ্ক। আর বারা (রাঃ) বলেন, وَذُلِّلَتْ قُطُوْفُهَا তাদের ইচ্ছেমাফিক ফল পাড়বে। মা‘মার (রহ.) বলেন, أَسْرَهُمْ সুদৃঢ় গঠন। উটের গদির সঙ্গে শক্ত করে যে জিনিস বাঁধা থাকে তাকে مَأْسُوْرٌ বলা হয়। (77) سُوْرَةُ وَالْمُرْسَلَاتِ সূরাহ (৭৭) : আল-মুরসালাত وَقَالَ مُجَاهِدٌ (جِمَالَاتٌ) قَالَ مُجَاهِدٌ حِبَالٌ (ارْكَعُوْا) صَلُّوْا لَا يَرْكَعُوْنَ لَا يُصَلُّوْنَ وَسُئِلَ ابْنُ عَبَّاسٍ عَنْ قَوْلِهِ : (لَايَنْطِقُوْنَ)(وَاللهِ رَبِّنَا مَا كُنَّا مُشْرِكِيْنَ)(الْيَوْمَ نَخْتِمُ عَلٰٓىأَفْوَاهِهِمْ) فَقَالَ إِنَّهُ ذُوْ أَلْوَانٍ مَرَّةً يَنْطِقُوْنَ وَمَرَّةً يُخْتَمُ عَلَيْهِمْ মুজাহিদ (রহ.) বলেন, جِمَالَاتٌ উটের সারি। ارْكَعُوْا সালাত আদায় কর। لَا يَرْكَعُوْنَ তারা সালাত আদায় করে না। لَايَنْطِقُوْنَ (তার কথা বলতে সক্ষম হবে না), وَاللهِ رَبِّنَا مَا كُنَّا مُشْرِكِيْنَ (আল্লাহর শপথ! আমরা কখনো মুশরিক ছিলাম না) এবং الْيَوْمَ نَخْتِمُ عَلٓٓى أَفْوَاهِهِمْ (আমি আজ মোহর লাগিয়ে দেব) এ আয়াত সম্বন্ধে ইবনু ‘আব্বাস (রাঃ)-কে জিজ্ঞেস করা হলে, তিনি বললেন, কিয়ামতের দিন বিভিন্ন পর্যায়ে মানুষের বিভিন্ন অবস্থা ঘটবে। কখনো সে কথা বলতে পারবে এবং নিজের বিরুদ্ধে সাক্ষ্য দেবে, আবার কখনো তার মুখে মোহর লাগিয়ে দেয়া হবে। তখন সে আর কোন কথা বলতে পারবে না। ৪৯৩০. ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলাম। এমন সময় তাঁর প্রতি অবতীর্ণ হল সূরাহ মুরসালাত। আমরা তাঁর মুখে শুনে সেটি শিখছিলাম। তখন একটি সাপ বেরিয়ে এল। আমরা ওদিকে দৌড়ে গেলাম, কিন্তু সাপটি আমাদের থেকে দ্রুত চলে গিয়ে গর্তে ঢুকে পড়ল। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বললেন, ওটাও তোমাদের অনিষ্ট হতে বেঁচে গেল, তোমরা যেন ওটার অনিষ্ট হতে রক্ষা পেলে। [১৮৩০; মুসলিম ৩৯/৩৭, হাঃ ২২৩৪, আহমাদ ৪৩৫৭] (আধুনিক প্রকাশনীঃ ৪৫৬১, ইসলামিক ফাউন্ডেশনঃ ৪৫৬৫)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 450
			}
		}
	]
}