{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4938,
			"arabicnumber": 4938,
			"text": "سُوْرَةُ إِذَا الشَّمْسُ كُوِّرَتْ সূরাহ (৮১) : ইযাশশামসু কূউইরাত (আত্-তাকভীর) (انْكَدَرَتْ) انْتَثَرَتْ وَقَالَ الْحَسَنُ (سُجِّرَتْ) ذَهَبَ مَاؤُهَا فَلَا يَبْقَى قَطْرَةٌ وَقَالَ مُجَاهِدٌ (الْمَسْجُوْرُ) الْمَمْلُوْءُ وَقَالَ غَيْرُهُ (سُجِرَتْ) أَفْضَى بَعْضُهَا إِلَى بَعْضٍ فَصَارَتْ بَحْرًا وَاحِدًا (وَالْخُنَّسُ) تَخْنِسُ فِيْ مُجْرَاهَا تَرْجِعُ وَتَكْنِسُ تَسْتَتِرُ كَمَا تَكْنِسُ الظِّبَاءُ (تَنَفَّسَ) ارْتَفَعَ النَّهَارُ (وَالظَّنِيْنُ) الْمُتَّهَمُ وَالضَّنِيْنُ يَضَنُّ بِهِ وَقَالَ عُمَرُ (وَإِذَا النُّفُوْسُ زُوِّجَتْ) يُزَوَّجُ نَظِيْرَهُ مِنْ أَهْلِ الْجَنَّةِ وَالنَّارِ ثُمَّ قَرَأَ (احْشُرُوا الَّذِيْنَ ظَلَمُوْا وَأَزْوَاجَهُمْ عَسْعَسَ) أَدْبَرَ. انْكَدَرَتْ অর্থ বিক্ষিপ্ত হয়ে পড়বে। হাসান (রহ.) বলেন, سُجِّرَتْ অর্থ পানি নিঃশেষ হয়ে যাবে, এক বিন্দু পানিও বাকী থাকবে না। মুহাজিদ (রহ.) বলেন, الْمَسْجُوْرُ অর্থ কানায় কানায় ভর্তি। মুজাহিদ ব্যতীত অন্যান্য মুফাসসির বলেছেন, سُجِرَتْ অর্থ একটি সমুদ্র আরেকটির সঙ্গে মিলিত হয়ে এক সমুদ্রে পরিণত হবে। وَالْخُنَّسُ অর্থ নিজের গতিপথে পশ্চাদপসরণকারী।تَكْنِسُ মানে সূর্যের আলোতে অদৃশ্য হয়ে যায়, যেমন হরিণ গা ঢাকা দেয়। تَنَفَّسَ অর্থ যখন দিনের আলো উদ্ভাসিত হয়। الظَّنِيْنُ অপবাদ দানকারী। الضَّنِيْنُ অর্থ বখিল, কৃপণ। ‘উমার (রাঃ) বলেছেন, وَإِذَا النُّفُوْسُ زُوِّجَتْ অর্থ প্রত্যেককে তার মত চরিত্রের লোকের সঙ্গে জান্নাত ও জাহান্নামে জুড়ে দেয়া হবে। পরে এ কথার সমর্থনে তিনি احْشُرُواالَّذِيْنَ ظَلَمُوْا وَأَزْوَاجَهُمْ عَسْعَسَ (একত্র করে যালিম ও তাদের সহচরগণকে) আয়াতংশটি পাঠ করলেন। عَسْعَسَ অর্থ অবসান হয়েছে, পশ্চাদপসরণ করেছে। (82) سُوْرَةُ إِذَا السَّمَاءُ انْفَطَرَتْ সূরাহ (৮২) : ইযাসসামাউ আনফাতারাত (আল-ইনফিতার) وَقَالَ الرَّبِيْعُ بْنُ خُثَيْمٍ (فُجِّرَتْ) فَاضَتْ وَقَرَأَ الْأَعْمَشُ وَعَاصِمٌ (فَعَدَلَكَ) بِالتَّخْفِيْفِ وَقَرَأَهُ أَهْلُ الْحِجَازِ بِالتَّشْدِيْدِ وَأَرَادَ مُعْتَدِلَ الْخَلْقِ وَمَنْ خَفَّفَ يَعْنِيْ فِيْ أَيِّ صُوْرَةٍ شَاءَ إِمَّا حَسَنٌ وَإِمَّا قَبِيْحٌ أَوْ طَوِيْلٌ أَوْ قَصِيْرٌ. রাবী ইবনু খুশাইম (রহ.) বলেন, فُجِّرَتْ অর্থ-প্রবাহিত হবে, আ‘মাশ এবং ওয়াসিম (রহ.) فَعَدَلَكَ তাখফীফ-এর সঙ্গে পড়তেন এবং হিজাযের অধিবাসী فَعَدَّلَكَ তাশদীদ-এর সঙ্গে পড়তেন। অর্থ তিনি তোমাকে সামঞ্জস্যপূর্ণ সৃষ্টি করেছেন। যারা فَعَدَلَكَ তাখফীফ-এর সঙ্গে পড়তেন, তারা বলেন, এর অর্থ হল, তিনি তোমাকে সুন্দর বা কুৎসিৎ; লম্বা খাটো যে আকারে ইচ্ছে, সৃষ্টি করেছেন। (83) سُوْرَةُ وَيْلٌ لِلْمُطَفِّفِيْنَ সূরাহ (৮৩) : ওয়াইলুললিল মুত্বাফফিফীন (মুতাফফিফীন) وَقَالَ مُجَاهِدٌ (بَلْ رَانَ) ثَبْتُ الْخَطَايَا (ثُوِّبَ) جُوْزِيَ وَقَالَ غَيْرُهُ (الْمُطَفِّفُ) لَا يُوَفِّيْ غَيْرَهُ. الرَّحِيْقُ : الخَمْرُ،(خِتامُه” مِسْكٌ): طِيْنَهُ. (التَّسْنِيْمُ) : يَعْلو شَرَابَ أَهْلِ الجَنَّةِ. মুজাহিদ (রহ.) বলেন, بَلْرَانَ অর্থ গুনাহের জন্য। ثُوِّبَ অর্থ প্রতিদান দেয়া হল। মুজাহিদ ছাড়া অপরাপর মুসাসসির বলেছেন, الْمُطَفِّفُ ঐ লোক যে অন্যকে মাপে পূর্ণ মাত্রায় দেয় না। الرَّحِيْقُমদ বা পানীয়, خِتامُه مِسْكٌ জান্নাতের মেশক এর সুগন্ধযুক্ত মাটি দ্বারা মোহর করা হয়েছে التَّسْنِيْمُ জান্নাতীদের জন্য উন্নতমানের পানীয়। ৪৯৩৮. ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম ‘‘যেদিন সব মানুষ জগতসমূহের প্রতিপালকের সামনে দাঁড়াবে’’ (সূরাহ মুতাফ্ফিফীন ৮৩/৬)-এর ব্যাখ্যায় বলেছেন, সেদিন প্রত্যেক ব্যক্তির কানের লতা পর্যন্ত ঘামে ডুবে যাবে। [৬৫৩১; মুসলিম ৫১/১৫, হাঃ ২৮৬২, আহমাদ ৬০৭২] (আধুনিক প্রকাশনীঃ ৪৫৬৯, ইসলামিক ফাউন্ডেশনঃ ৪৫৭৪)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 459
			}
		}
	]
}