{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4986,
			"arabicnumber": 4986,
			"text": "যায়দ ইবনু সাবিত (রাঃ) হতে বর্ণিত। তিনি বলেন, ইয়ামামাহর যুদ্ধে বহু লোক শহীদ হবার পর আবূ বাকর সিদ্দীক (রাঃ) আমাকে ডেকে পাঠালেন। এ সময় ‘উমার (রাঃ)-ও তাঁর কাছে উপস্থিত ছিলেন। আবূ বাকর (রাঃ) বললেন, ‘উমার (রাঃ) আমার কাছে এসে বললেন, ইয়ামামার যুদ্ধে শহীদদের মধ্যে কারীদের সংখ্যা অনেক। আমি আশংকা করছি, এমনিভাবে যদি কারীগণ শাহীদ হয়ে যান, তাহলে কুরআন মাজীদের বহু অংশ হারিয়ে যাবে। অতএব আমি মনে করি যে, আপনি কুরআন সংকলনের নির্দেশ দিন। উত্তরে আমি ‘উমার (রাঃ)-কে বললাম, যে কাজ আল্লাহর রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম করেননি, সে কাজ তুমি কীভাবে করবে? ‘উমার (রাঃ) জবাবে বললেন, আল্লাহর কসম! এটা একটি উত্তম কাজ। ‘উমার (রাঃ) এ কথাটি আমার কাছে বার বার বলতে থাকলে অবশেষে আল্লাহ্ তা‘আলা এ কাজের জন্য আমার বক্ষকে উন্মোচন করে দিলেন এবং এ ব্যাপারে ‘উমার যা ভাল মনে করলেন আমিও তাই করলাম। যায়দ (রাঃ) বলেন, আবূ বাকর সিদ্দীক (রাঃ) আমাকে বললেন, তুমি একজন বুদ্ধিমান যুবক। তোমার ব্যাপারে আমার কোন সংশয় নেই। তদুপরি তুমি রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর ওয়াহীর লেখক ছিলে। সুতরাং তুমি কুরআন মাজীদের অংশগুলোকে তালাশ করে একত্রিত কর। আল্লাহর শপথ! তারা যদি আমাকে একটি পর্বত এক স্থান হতে অন্যত্র সরিয়ে ফেলার নির্দেশ দিত, তাহলেও তা আমার কাছে কুরআন সংকলনের নির্দেশের চেয়ে কঠিন বলে মনে হত না। আমি বললাম, যে কাজ রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম করেননি, আপনারা সে কাজ কীভাবে করবেন? তিনি বললেন, আল্লাহরকসম! এটা একটা কল্যাণকর কাজ। এ কথাটি আবূ বাকর সিদ্দীক (রাঃ) আমার কাছে বার বার বলতে থাকেন, অবশেষে আল্লাহ্ আমার বক্ষকে উন্মোচন করে দিলেন সে কাজের জন্য, যে কাজের জন্য তিনি আবূ বাকর এবং ‘উমার (রাঃ)-এর বক্ষকে উন্মোচন করে দিয়েছিলেন। এরপর আমি কুরআন অনুসন্ধানের কাজে লেগে গেলাম এবং খেজুর পাতা, প্রস্তরখন্ড ও মানুষের বক্ষ থেকে আমি তা সংগ্রহ করতে থাকলাম। এমনকি আমি সূরাহ তওবার শেষাংশ আবূ খুযায়মাহ আনসারী (রাঃ) থেকে সংগ্রহ করলাম। এ অংশটুকু তিনি বাদে আর কারো কাছে আমি পাইনি। আয়াতগুলো হচ্ছে এইঃ তোমাদের মধ্য হতে তোমাদের কাছে এক রাসূল এসেছে। তোমাদেরকে যা বিপন্ন করে তাঁর জন্য তা কষ্টদায়ক। সে তোমাদের মঙ্গলকামী, মু’মিনদের প্রতি সে দয়ার্দ্র ও পরম দয়ালু। এরপর তারা যদি মুখ ফিরিয়ে নেয় তবে তুমি বলো, আমার জন্য আল্লাহ্ই যথেষ্ট, তিনি ছাড়া অন্য কোন ইলাহ নেই। আমি তাঁরই উপর নির্ভর করি এবং তিনি মহা আরশের অধিপতি। (১২৮-১২৯) তারপর সংকলিত সহীফাসমূহ মৃত্যু পর্যন্ত আবূ বাকর (রাঃ)-এর কাছে রক্ষিত ছিল। তাঁর মৃত্যুর পর তা ‘উমার (রাঃ)-এর কাছে সংরক্ষিত ছিল, যতদিন তিনি জীবিত ছিলেন। অতঃপর তা ‘উমার (রাঃ)-এর কন্যা হাফসাহ (রাঃ)-এর কাছে সংরক্ষিত ছিল। [২৮০৭] (আধুনিক প্রকাশনীঃ ৪৬১৬, ইসলামিক ফাউন্ডেশনঃ ৪৬২১)",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 8
			}
		}
	]
}