{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5052,
			"arabicnumber": 5052,
			"text": "‘আবদুল্লাহ্ ইবনু ‘আমর (রাঃ) হতে বর্ণিত। তিনি বলেন, আমার পিতা আমাকে এক সম্ভ্রান্ত বংশীয় মহিলার সঙ্গে শাদী দেন এবং প্রায়ই তিনি আমার সম্পর্কে আমার স্ত্রীর কাছে জিজ্ঞাসাবাদ করতেন। আমার স্ত্রী বলত, সে কতইনা ভাল মানুষ যে, সে কখনও আমার বিছানায় আসেনি এবং শাদীর পর থেকে আমার সম্পর্কে খোঁজ খবরও নেয়নি। এ অবস্থা যখন দীর্ঘদিন পর্যন্ত চলতে থাকল তখন আমার পিতা রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-কে আমার সম্পর্কে জানালেন। তখন নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম আমার পিতাকে বললেন, তাকে আমার সঙ্গে সাক্ষাতের ব্যবস্থা করুন। এরপর আমি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সঙ্গে সাক্ষাৎ করলে তিনি আমাকে জিজ্ঞেস করলেন, তুমি কেমন সওম পালন কর? আমি উত্তর দিলাম, প্রতিদিন সওম পালন করি। তিনি আবার জিজ্ঞেস করলেন, এ অবস্থায় পূর্ণ কুরআন মাজীদ খতম করতে তোমার কত সময় লাগে? আমি উত্তর দিলাম, প্রত্যেক রাতেই এক খতম করি। তিনি বললেন, প্রত্যেক মাসে তিনদিন সওম পালন করবে এবং কুরআন এক মাসে এক খতম দেবে।’’ আমি বললাম, আমি এর চেয়ে অধিক করার সামর্থ্য রাখি। তিনি বললেন, তাহলে প্রতি সপ্তাহে তিনদিন সওম পালন করবে। আমি বললাম, আমি এর চেয়ে অধিক করার শক্তি রাখি। তিনি বললেন, দু’দিন পর একদিন সওম পালন কর। আমি বললাম, আমি এর চেয়ে অধিক সামর্থ্য রাখি। তিনি বললেন, তাহলে সব চেয়ে উত্তম পদ্ধতির সওম পালন কর। তা হল, দাঊদ (আঃ)-এর সওম। তিনি এক দিন অন্তর একদিন সওম পালন করতেন এবং তুমি প্রতি সাত দিনে একবার কুরআন খতম করো। হায়! আমি যদি রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর দেয়া সুবিধা গ্রহণ করতাম! এখন আমি দুর্বল বৃদ্ধ হয়ে গেছি। ‘আবদুল্লাহ্ (রাঃ) প্রত্যেক দিন তার পরিবারের একজন সদস্যের সামনে কুরআনের সপ্তমাংশ পাঠ করে শোনাতেন। দিবা ভাগে পাঠ করে দেখতেন, তার স্মরণশক্তি সঠিক আছে কিনা? যা তিনি রাতে পাঠ করবেন তা যেন সহজ হয় এবং যখনই তিনি শারীরিক শক্তি বৃদ্ধির ইচ্ছা করতেন তখন কয়েক দিন সওম পালন বন্ধ রাখতেন এবং পরবর্তীতে ঐ ক’দিনের হিসাব করে সওম পালন করতেন। কেননা, তিনি রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর জীবদ্দশায় যে নিয়ম পালন করতেন পরে সে নিয়ম ত্যাগ করা অপছন্দ মনে করতেন। আবূ ‘আবদুল্লাহ্ বলেন কেউ তিন দিনে, কেউ পাঁচ দিনে এবং অধিকাংশ লোক সাত দিনে কুরআন খতম করতেন। [১১৩১] (আধুনিক প্রকাশনীঃ ৪৬৭৯, ইসলামিক ফাউন্ডেশনঃ ৪৬৮৩)",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 77
			}
		}
	]
}