{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5092,
			"arabicnumber": 5092,
			"text": "ইবনু শিহাব (রহ.) হতে বর্ণিত। তিনি বলেন, আমার কাছে ‘উরওয়াহ (রহ.) বলেছেন যে, তিনি ‘আয়িশাহ (রাঃ)-এর কাছে ‘‘যদি তোমরা আশঙ্কা কর যে, ইয়াতীমদের প্রতি সুবিচার করতে পারবে না’’ (সূরা আন-নিসাঃ ৩) এ আয়াতের মর্ম সম্পর্কে জিজ্ঞেস করলে তিনি বলেন, হে ভাগ্নে! এ আয়াত ঐসব ইয়াতীম বালিকাদের সম্পর্কে অবতীর্ণ হয়েছে, যারা কোন অভিভাবকের তত্ত্বাবধানে আছে। আর অভিভাবক তার ধন-সম্পদ ও সৌন্দর্যের প্রতি আসক্ত; কিন্তু বিয়ের পর মাহর দিতে অনিচ্ছুক। এ রকম অভিভাবককে ঐ ইয়াতীম বালিকাদের বিয়ে বন্ধনে আবদ্ধ করতে নিষেধ করা হয়েছে, যতক্ষণ পর্যন্ত না তারা ইনসাফের সঙ্গে পূর্ণ মাহর তাদেরকে দিয়ে দেয় এবং এদেরকে ছাড়া অন্যদের বিয়ে করার নির্দেশ দেয়া হয়েছে। ‘আয়িশাহ (রাঃ) বলেন, পরবর্তীকালে লোকেরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এ বিষয়ে জিজ্ঞেস করলে আল্লাহ্ তা‘আলা এই আয়াত অবতীর্ণ করেন ‘‘আর লোকে তোমার নিকট নারীদের বিষয়ে ব্যবস্থা জানতে চায়, বল, আল্লাহ তোমাদেরকে তাদের সম্বন্ধে ব্যবস্থা জানাচ্ছেন এবং ইয়াতীম নারী সম্পর্কে যাদের তোমরা (মাহর) প্রদানকর না, অথচ তোমরা তাদেরকে বিয়ে করতে চাও এবং অসহায় শিশুদের সম্বন্ধে ও ইয়াতীমদের প্রতি তোমাদের ন্যায় বিচার সম্পর্কে যা কিতাবে তোমাদেরকে শোনানো হয়, তাও পরিষ্কারভাবে জানিয়ে দেন। সেই হুকুমগুলো যা এ ইয়াতীম মেয়েদের সম্পর্কে যাদের হক তোমরা সঠিক মত আদায় কর না। যাদেরকে বিয়ে বন্ধনে আবদ্ধ করার কোন আগ্রহ তোমাদের নেই।’’ (সূরা আন-নিসা ১২৭) ইয়াতীম বালিকারা যখন সুন্দরী এবং ধনবতী হয়, তখন অভিভাবকগণ তার বংশমর্যাদা রক্ষা এবং বিয়ে বন্ধনে আবদ্ধ করার জন্য আগ্রহ প্রকাশ করতঃ তারা এদের পূর্ণ মাহর আদায় না করা পর্যন্ত বিয়ে করতে পারে না। আর তারা যদি এদের ধন-সম্পদ এবং সৌন্দর্যের অভাবের কারণে বিয়ে বন্ধনে আবদ্ধ হতে আগ্রহী না হত, তাহলে তারা এদের ব্যতীত অন্য মহিলাদের বিয়ে করত। সুতরাং যখন তারা এদের মধ্যে স্বার্থ পেতো না তখন তাদের বাদ দিত। এ কারণে তাদেরকে স্বার্থের বেলায় পূর্ণ মাহর আদায় করা ব্যতীত বিয়ে করতে নিষেধ করা হয়। [২৪৯৪](আধুনিক প্রকাশনী- ৪৭১৯, ইসলামিক ফাউন্ডেশন- ৪৭২১)",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 30
			}
		}
	]
}