{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5106,
			"arabicnumber": 5106,
			"text": "وَقَالَ ابْنُ عَبَّاسٍ الدُّخُولُ وَالْمَسِيسُ وَاللِّمَاسُ هُوَ الْجِمَاعُ وَمَنْ قَالَ بَنَاتُ وَلَدِهَا مِنْ بَنَاتِه„ فِي التَّحْرِيمِ لِقَوْلِ النَّبِيِّصلى الله عليه وسلم لِأُمِّ حَبِيبَةَ لاَ تَعْرِضْنَ عَلَيَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ وَكَذ‘لِكَ حَلاَئِلُ وَلَدِ الأَبْنَاءِ هُنَّ حَلاَئِلُ الأَبْنَاءِ وَهَلْ تُسَمَّى الرَّبِيبَةَ وَإِنْ لَمْ تَكُنْ فِي حَجْرِه„ وَدَفَعَ النَّبِيُّ صلى الله عليه وسلم رَبِيبَةً لَه“ إِلٰى مَنْ يَكْفُلُهَا وَسَمَّى النَّبِيُّ صلى الله عليه وسلم ابْنَ ابْنَتِه„ ابْنًا. এ প্রসঙ্গে ইবনু ‘আব্বাস (রাঃ) বলেন যে, ‘দুখুল’ ‘মাসীস’ ও ‘লিমাস’ শব্দ তিনটির অর্থ হচ্ছে, যৌন মিলন। যে ব্যক্তি বলে যে, স্ত্রীর কন্যা কিংবা তার সন্তানের কন্যা হারামের ব্যাপারে নিজ কন্যার সমান, সে দলীল হিসেবে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হাদীস পেশ করে। আর তা হচ্ছেঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মু হাবীবাহ (রাঃ)-কে বলেন, তোমরা তোমাদের কন্যাদের ও বোনদের আমার সঙ্গে বিয়ের প্রস্তাব করো না। একইভাবে নাতবৌ এবং পুত্রবধু বিয়ে করা হারাম। যদি কোন সৎ-কন্যা কারো অভিভাবকের আওতাধীন না থাকে তবে তাকে কি সৎ-কন্যা বলা যাবে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার একটি সৎ কন্যাকে কারো অভিভাবকত্বে দিয়ে ছিলেন এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় দৌহিত্রকে পুত্র সম্বোধন করেছেন। ৫১০৬. উম্মু হাবীবাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! আপনি কি আবূ সুফিয়ানের কন্যার ব্যাপারে আগ্রহী? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উত্তর দিলেন, তাকে দিয়ে আমার কী হবে? আমি বললাম, তাকে আপনি বিয়ে করবেন। তিনি প্রশ্ন করলেন, তুমি কি তা পছন্দ করবে? আমি বললাম, হাঁ। এখন তো আমি একাই আপনার স্ত্রী নই। সুতরাং আমি চাই, আমার বোনও আমার সঙ্গে কল্যাণে অংশীদার হোক। তিনি বললেন, তাকে বিয়ে করা আমার জন্য হালালনয়। আমি বললাম, আমরা শুনেছি যে, আপনি আবূ সালামাহর কন্যা দুররাকে বিয়ে করার জন্য পয়গাম পাঠিয়েছেন। তিনি প্রশ্ন করলেন, উম্মু সালামাহর কন্যা? আমি বললাম, হাঁ। তিনি বললেন, সে আমার প্রতিপালিতা সৎ কন্যা যদি নাও হতো তবুও তাকে বিয়ে করা আমার জন্য হালাল হতো না। কেননা সুয়াইবিয়া আমাকে ও তার পিতাকে দুধ পান করিয়েছিলেন। সুতরাং বিয়ের জন্য তোমাদের কন্যা বা বোন কাউকে পেশ করো না। লায়স বলেন, হিশাম দুররা বিনত আবী সালামাহর নাম বলেছেন। [৫১০১](আধুনিক প্রকাশনী- ৪৭৩২, ইসলামিক ফাউন্ডেশন- ৪৭৩৪)",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 44
			}
		}
	]
}