{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5292,
			"arabicnumber": 5292,
			"text": "وَقَالَ ابْنُ الْمُسَيَّبِ إِذَا فُقِدَ فِي الصَّفِّ عِنْدَ الْقِتَالِ تَرَبَّصُ امْرَأَتُه“ سَنَةً. ইবনু মুসাইয়্যাব (রহ.) বলেন, যুদ্ধের ব্যূহ থেকে কোন ব্যক্তি নিরুদ্দেশ হলে তার স্ত্রী এক বছর অপেক্ষা করবে। وَاشْتَرَى ابْنُ مَسْعُودٍ جَارِيَةً وَالْتَمَسَ صَاحِبَهَا سَنَةً فَلَمْ يَجِدْه“ وَفُقِدَ فَأَخَذَ يُعْطِي الدِّرْهَمَ وَالدِّرْهَمَيْنِ وَقَالَ اللَّهُمَّ عَنْ فُلاَنٍ فَإِنْ أَتٰى فُلاَنٌ فَلِي وَعَلَيَّ وَقَالَ هٰكَذَا فَافْعَلُوا بِاللُّقَطَةِ وَقَالَ ابْنُ عَبَّاسٍ نَحْوَه“ وَقَالَ الزُّهْرِيُّ فِي الأَسِيرِ يُعْلَمُ مَكَانُه“ لاَ تَتَزَوَّجُ امْرَأَتُه“ وَلاَ يُقْسَمُ مَالُه“ فَإِذَا انْقَطَعَ خَبَرُه“ فَسُنَّتُه“ سُنَّةُ الْمَفْقُودِ. ইবনু মাস‘ঊদ (রাঃ) একটি দাসী ক্রয় করে এক বছর পর্যন্ত তার মালিককে খুঁজলেন মূল্য পরিশোধ করার জন্য)। তিনি তাকে পেলেন না, সে নিখোঁজ হয়ে যায়। তিনি এক দিরহাম, দু’ দিরহাম করে দান করতেন এবং বলতেনঃ হে আল্লাহ! এটা অমুকের পক্ষ থেকে দিচ্ছি। যদি মালিক এসে যায়, তবে এর সাওয়াব আমি পাব, আর তার টাকা পরিশোধ করার দায়িত্ব হবে আমার। তিনি বলেনঃ হারানো বস্ত্ত প্রাপ্তির ক্ষেত্রেও তোমরা এমন কাজ করবে। ইবনু ‘আব্বাস(রাঃ)-ও এরূপ মত ব্যক্ত করেছেন। যুহরী সেই বন্দী ব্যক্তি সম্পর্কে বলেন, যার অবস্থান সম্পর্কে জানা গেছে তার স্ত্রী বিয়ে করতে পারবে না এবং তার সম্পদও বণ্টন করা যাবে না। তবে তার সংবাদ পুরাপুরি বন্ধ হয়ে গেলে, তাঁর সম্পর্কে নিখোঁজ ব্যক্তির বিধান বলবৎ হবে। ৫২৯২. মুনবাইস-এর আযাদকৃত গোলাম ইয়াযীদ (রহঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে হারানো বকরীর ব্যাপারে জিজ্ঞেস করা হলে তিনি বললেনঃ ওটাকে ধরে নাও। কেননা, ওটা হয় তোমার জন্য, না হয় তোমার (অন্য) ভাইয়ের জন্য অথবা নেকড়ের জন্য। তাঁকে হারানো উটের ব্যাপারে জিজ্ঞেস করা হলে তিনি রেগে গেলেন এবং তাঁর উভয় গন্ডদেশ লাল হয়ে গেল। এরপর তিনি বললেনঃ ওটা নিয়ে তোমার চিন্তা কেন? তার সঙ্গে চলার (জন্য) পায়ের তলায় ক্ষুর ও পানাহারের (জন্য) পেটে মশক আছে। সে পানি পান করতে থাকবে এবং বৃক্ষ-লতা খেতে থাকবে, আর এর মধ্যে মালিক তার সন্ধান লাভ করবে। তাঁকে লুকাতা (হারানো প্রাপ্তি) সম্বন্ধে প্রশ্ন করা হলে তিনি বলেনঃ প্রাপ্ত বস্তুর থলে ও মাথার বন্ধনটা চিনে নাও এবং এক বছর পর্যন্ত এর ঘোষণা দিতে থাক। যদি এর শনাক্তকারী (মালিক) আসে, তবে ভালো কথা, নচেৎ এটাকে তোমার মালের সাথে মিলিয়ে নাও। সুফ্ইয়ান বলেনঃ আমি রাবী‘আ ইবনু আবূ ‘আবদুর রহমানের সঙ্গে দেখা করে উল্লিখিত কথাগুলো ছাড়া আর কিছুই পাইনি। আমি বললামঃ হারানো প্রাণীর ব্যাপারে মুনবাইস এর আযাদকৃত গোলাম ইয়াযীদের হাদীসটি কি যায়দ ইবনু খালিদ হতে বর্ণিত? তিনি বললেন, হাঁ। ইয়াহইয়া বলেন, রাবী‘আ বলতেনঃ হাদীসটি মুনবাইস-এর আযাদকৃত গোলাম ইয়াযীদ-এর মাধ্যমে যায়দ ইবনু খালিদ হতে বর্ণনাকৃত। সুফ্ইয়ান বললেনঃ আমি রাবী‘আর সঙ্গে দেখা করে এ সম্পর্কে আলোচনা করলাম। [৯১] আধুনিক প্রকাশনী- ৪৯০৩, ইসলামিক ফাউন্ডেশন- ৪৭৯৮",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 41
			}
		}
	]
}