{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"2": "Belief"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 53,
			"arabicnumber": 53,
			"text": "আবূ জামরাহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘আব্বাস (রাযি.)-এর সাথে বসতাম। তিনি আমাকে তাঁর আসনে বসাতেন। একবার তিনি বললেনঃ তুমি আমার কাছে থেকে যাও, আমি তোমাকে আমার ধন-সম্পদ হতে কিয়দংশ প্রদান করব। আমি তাঁর সাথে দু’মাস থাকলাম। অতঃপর একদা তিনি বললেন, আবদুল কায়েস-এর একটি প্রতিনিধি দল আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট আগমন করলে তিনি বললেনঃ তোমরা কোন্ গোত্রের? কিংবা বললেন, কোন্ প্রতিনিধিদলের? তারা বলল, ‘রাবী‘আ গোত্রের।’ তিনি বললেনঃ স্বাগতম সে গোত্র বা সে প্রতিনিধি দলের প্রতি, যারা অপদস্থ ও লজ্জিত না হয়েই আগমন করেছে। তারা বলল, হে আল্লাহর রাসূল! শাহরুল হারাম ব্যতীত অন্য কোন সময় আমরা আপনার নিকট আগমন করতে পারি না। আমাদের এবং আপনার মধ্যে মুযার গোত্রীয় কাফিরদের বসবাস। তাই আমাদের কিছু স্পষ্ট নির্দেশ দিন, যাতে করে আমরা যাদের পিছনে ছেড়ে এসেছি তাদের অবগত করতে পারি এবং যাতে করে আমরা জান্নাতে দাখিল হতে পারি। তারা পানীয় সম্বন্ধেও জিজ্ঞেস করল। তখন তিনি তাদেরকে চারটি বিষয়ের আদেশ এবং চারটি বিষয় হতে নিষেধ করলেন। তাদেরকে এক আল্লাহ্তে বিশ্বাস স্থাপনের নির্দেশ দিয়ে বললেনঃ ‘এক আল্লাহর প্রতি কীভাবে বিশ্বাস স্থাপন করা হয় তা কি তোমরা অবগত আছ?’ তাঁরা বলল, ‘আল্লাহ ও তাঁর রাসূলই অধিক জ্ঞাত।’ তিনি বললেনঃ ‘তা হচ্ছে এ সাক্ষ্য দেয়া যে, আল্লাহ্ ব্যতীত প্রকৃত কোন উপাস্য নেই এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল এবং সালাত প্রতিষ্ঠা করা, যাকাত আদায় করা, রমাযানের সিয়ামব্রত পালন করা; আর তোমরা গানীমাতের সম্পদ হতে এক-পঞ্চমাংশ আদায় করবে। তিনি তাদেরকে চারটি বিষয় হতে বিরত থাকতে বললেন। আর তা হচ্ছেঃ সবুজ কলস, শুকনো কদুর খোল, খেজুর বৃক্ষের গুড়ি হতে তৈরী বাসন এবং আলকাতরা দ্বারা রাঙানো পাত্র। রাবী বলেন, বর্ণনাকারী (মুযাফ্ফাত-এর স্থলে) কখনও আন্নাক্বীর উল্লেখ করেছেন (দু‘টি শব্দের অর্থ একইরূপ)। তিনি আরো বলেন, তোমরা এ বিষয়গুলো ভালো করে জেনে নাও এবং অন্যদেরও এগুলো অবগত কর। (৮৭, ৫২৩, ১৩৯৮, ৩০৯৫, ৩৫১০, ৪৩৬৮, ৪২৬৯, ৬১৭৬, ৭২৬৬, ৭৫৫৬; মুসলিম ১/৬ হাঃ ১৭) (আধুনিক প্রকাশনীঃ ৫১, ইসলামিক ফাউন্ডেশনঃ ৫১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 46
			}
		}
	]
}