{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5309,
			"arabicnumber": 5309,
			"text": "ইবনু জুরাইজ (রহ.) হতে বর্ণিত। তিনি বলেন, আমাকে ইবনু শিহাব (রহ.) লি‘আন ও তার হুকুম সম্বন্ধে সা’দ গোত্রের সাহল ইবনু সা‘দ (রাঃ) থেকে হাদীস বর্ণনা করেন যে, আনসারদের এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বললঃ হে আল্লাহর রাসূল! আপনি কী বলেন, যদি কোন ব্যক্তি তার স্ত্রীর সঙ্গে অন্য লোককে দেখতে পায়, তবে কি সে তাকে হত্যা করবে? অথবা কী করবে? এরপর আল্লাহ তা‘আলা তার ব্যাপারে কুরআনে উল্লেখিত লি‘আনের বিধান অবতীর্ণ করেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ তোমার ও তোমার স্ত্রীর ব্যাপারে ফয়সালা দিয়েছেন। রাবী বলেনঃ আমি উপস্থিত থাকতেই তারা উভয়ে মসজিদে লি‘আন করল। উভয়ের লি‘আন করা শেষ হলে সে ব্যক্তি বললঃ হে আল্লাহর রাসূল! যদি আমি তাকে স্ত্রী হিসাবে রেখে দেই; তবে তার উপর মিথ্যারোপ করেছি বলে গণ্য হবে। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে নির্দেশ দেয়ার আগেই সে তার স্ত্রীকে তিন তালাক দিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনেই সে তার থেকে পৃথক হয়ে গেল। তিনি বললেনঃ এই সম্পর্কচ্ছেদই প্রত্যেক লি‘আনকারীদ্বয়ের জন্য বিধান। ইবনু জুরাইজ বলেন, ইবনু শিহাব (রহ.) বলেছেনঃ তাদের পর লি‘আনকারীদ্বয়ের মধ্যে বিচ্ছেদ ঘটানোর হুকুম চালু হয়। মহিলাটি ছিল গর্ভবতী। তার বাচ্চাকে মায়ের পরিচয়ে ডাকা হত। বর্ণনাকারী বলেনঃ এরপর ওয়ারিশের ব্যাপারেও হুকুম জারি হল যে, মহিলা সন্তানের ওয়ারিশ হবে এবং সন্তানও তার ওয়ারিশ হবে, যতটুকু আল্লাহ তা‘আলা নির্ধারণ করেছেন। ইবনু জুরাইজ, ইবনু শিহাবের সূত্রে সাহল ইবনু সা’দ সা‘ঈদী থেকে এ হাদীস সম্পর্কে বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি ঐ স্ত্রীলোকটি ওহরার (এক রকম ছোট প্রাণী)র মতো লাল ও বেঁটে সন্তান জন্ম দেয়, তবে বুঝব মহিলাই সত্য বলেছে, আর লোকটি তার উপর মিথ্যা অপবাদ দিয়েছে। আর যদি সে কালো চক্ষু বিশিষ্ট বড় নিতম্বযুক্ত সন্তান জন্ম দেয়, তবে বুঝব, লোকটি সত্যই বলেছে। উক্ত মহিলা অপসন্দনীয় আকৃতির বাচ্চা প্রসব করে। [৪২৩] আধুনিক প্রকাশনী- ৪৯১৮, ইসলামিক ফাউন্ডেশন- ৪৮১৩",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 58
			}
		}
	]
}