{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5544,
			"arabicnumber": 5544,
			"text": "রাফী‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। তখন উটগুলোর মধ্য থেকে একটি উট পালিয়ে যায়। তিনি বলেন, তখন এক ব্যক্তি সেটির দিকে তীর ছুঁড়লে আল্লাহ সেটিকে থামিয়ে দেন। তিনি বলেন, এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ সব পশুর মধ্যে বন্য পশুর স্বভাব আছে। সুতরাং তার মধ্যে কোনটি তোমাদের উপর বেয়াড়া হয়ে উঠলে তার সঙ্গে সেরকমই ব্যবহার কর। তিনিবলেন, আমি বললামঃ হে আল্লাহর রাসূল! আমরা অনেক সময় যুদ্ধ অভিযানে বা সফরে থাকি, যবহ্ করতে ইচ্ছা করি কিন্তু ছুরি থাকে না। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আঘাত করো এমন বস্ত্ত দিয়ে যা রক্ত ঝরায় অথবা তিনি বলেছেনঃ এমন বস্ত্ত দিয়ে যা রক্ত ঝরায় এবং যার উপরে আল্লাহর নাম নেয়া হয়েছে সেটি খাও, তবে দাঁত ও নখ বাদে। কারণ দাঁত হল হাড়, আর নখ হল হাবশীদের ছুরি। আধুনিক প্রকাশনী- ৫১৩৭, ইসলামিক ফাউন্ডেশন- ৫০৩৩) 72/38. بَاب إِذَا أَكَلَ الْمُضْطَرُّ ৭২/৩৮. অধ্যায়ঃ নিরুপায় ব্যক্তির খাওয়া। لِقَوْلِ اللهِ تَعَالٰى :لِقَوْلِهِ تَعَالَى: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيرِ وَمَا أُهِلَّ بِهِ لِغَيْرِ اللَّهِ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلاَ عَادٍ فَلاَ إِثْمَ عَلَيْهِ)، وَقَالَ: (فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لإِثْمٍ) وَقَوْلُهُ: (فَكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ إِنْ كُنْتُمْ بِآيَاتِهِ مُؤْمِنِينَ وَمَا لَكُمْ أَنْ لاَ تَأْكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ وَقَدْ فُصِّلَ لَكُمْ مَا حُرِّمَ عَلَيْكُمْ إِلاَّ مَا اضْطُرِرْتُمْ إِلَيْهِ وَإِنَّ كَثِيرًا لَيُضِلُّونَ بِأَهْوَائِهِمْ بِغَيْرِ عِلْمٍ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِالْمُعْتَدِينَ)، (قُلْ لاَ أَجِدُ فِيمَا أُوحِيَ إِلَيَّ مُحَرَّمًا عَلَى طَاعِمٍ يَطْعَمُهُ إِلاَّ أَنْ يَكُونَ مَيْتَةً أَوْ دَمًا مَسْفُوحًا أَوْ لَحْمَ خِنْزِيرٍ فَإِنَّهُ رِجْسٌ أَوْ فِسْقًا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلاَ عَادٍ فَإِنَّ رَبَّكَ غَفُورٌ رَحِيمٌ). وَقَالَ: (فَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلاَلاً طَيِّبًا وَاشْكُرُوا نِعْمَةَ اللَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلاَ عَادٍ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ). আল্লাহ তা‘আলার বাণীঃ হে মু’মিনগণ! আমার দেয়া পবিত্র বস্তুগুলো খেতে থাক এবং আল্লাহর উদ্দেশে শোকর করতে থাক, যদি তোমরা তাঁরই উপাসক হও-নিশ্চয় আল্লাহ তোমাদের প্রতি হারাম করেছেন মৃত-জীব, রক্ত এবং শূকরের গোশত এবং সেই দ্রব্য যার প্রতি আল্লাহ ছাড়া অন্যের নাম নেয়া হয়েছে, কিন্তু যে ব্যক্তি বাধ্য হয়ে বিদ্রোহী না হয়ে এবং সীমা অতিক্রম না করে তা গ্রহণ করবে, তার কোন গুনাহ নেই- (সূরাহ আল-বাকারাহ ২/১৭২-১৭৩)। আল্লাহ আরো বলেনঃ তবে কেউ পাপ করার প্রবণতা ব্যতীত ক্ষুধার জ্বালায় নিষিদ্ধ বস্তু খেতে) বাধ্য হলে....... (সূরাহ আল-মায়িদাহ ৫/৩)। আল্লাহ আরো বলেন ঃ কাজেই যার উপর আল্লাহর নাম নেয়া হয়েছে তা তোমরা খাও যদি তাঁর নিদর্শনাবলীতে তোমরা বিশ্বাসী হয়ে থাক- তোমাদের কী হয়েছে যে, যাতে আল্লাহর নাম নেয়া হয়েছে তা তোমরা খাবে না? তোমাদের জন্য যা হারাম করা হয়েছে তা তোমাদের জন্য বিশদভাবে বাতলে দেয়া হয়েছে, তবে যদি তোমরা নিরুপায় হও (তবে ততটুকু নিষিদ্ধ বস্তু খেতে পার যাতে প্রাণে বাঁচতে পার), কিন্তু অনেক লোকই অজ্ঞানতাবশতঃ তাদের খেয়াল খুশী দ্বারা অবশ্যই (অন্যদেরকে) পথভ্রষ্ট করে, তোমার প্রতিপালক সীমালঙ্ঘনকারীদের সম্পর্কে সবচেয়ে বেশি অবগত- (সূরাহ আল-আন‘আম ৬/১১৮-১১৯)। আল্লাহ আরো বলেনঃ বল, আমার প্রতি যে ওয়াহী করা হয়েছে তাতে মানুষ যা আহার করে তার কিছুই নিষিদ্ধ পাই না মৃত, প্রবহমান রক্ত ও শূকরের গোশত ছাড়া। কারণ তা অপবিত্র অথবা আল্লাহ ছাড়া অন্যের নামে যবহ করার ফাসিকী কাজ। কিন্তু কেউ অবাধ্য না হয়ে বা সীমালঙ্ঘন না করে নিরুপায় হলে তোমার প্রতিপালক তো বড়ই ক্ষমাশীল, পরম দয়ালু। (সূরাহ আল-আন‘আম ৬/১৪৫) আল্লাহ আরো বলেনঃ কাজেই আল্লাহ তোমাদেরকে যে সকল বৈধ পবিত্র রিযক দিয়েছেন তা তোমরা খাও আর আল্লাহর অনুগ্রহের শুকরিয়া আদায় কর যদি তোমরা প্রকৃতই তাঁর বন্দেগী করতে ইচ্ছুক হও। আল্লাহ তোমাদের জন্য হারাম করেছেন মৃত জীব, রক্ত, শূকরের গোশত আর যা যবেহ করার সময় আল্লাহ ছাড়া অন্যের নাম নেয়া হয়েছে। কিন্তু কেউ ইচ্ছাকৃতভাবে অবাধ্য না হয়ে ও সীমালঙ্ঘন না করে নিতান্ত নিরুপায় হয়ে এসব খেতে বাধ্য) হলে আল্লাহ তো বড়ই ক্ষমাশীল, বড়ই দয়ালু। সূরাহ নাহল ১৬/১১৪-১১৫",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 69
			}
		}
	]
}