{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"9": "Times of the Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "(قَالَ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَثْقَلُ الصَّلاَةِ عَلَى الْمُنَافِقِينَ الْعِشَاءُ وَالْفَجْرُ وَقَالَ لَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالْفَجْرِ قَالَ أَبُو عَبْد اللهِ وَالِاخْتِيَارُ أَنْ يَقُولَ الْعِشَاءُ لِقَوْلِهِ تَعَالَى )وَمِنْ بَعْدِ صَلاَةِ الْعِشَاءِ( وَيُذْكَرُ عَنْ أَبِي مُوسَى قَالَ كُنَّا نَتَنَاوَبُ النَّبِيَّ صلى الله عليه وسلم عِنْدَ صَلاَةِ الْعِشَاءِ فَأَعْتَمَ بِهَا وَقَالَ ابْنُ عَبَّاسٍ وَعَائِشَةُ أَعْتَمَ النَّبِيُّ صلى الله عليه وسلم بِالْعِشَاءِ وَقَالَ بَعْضُهُمْ عَنْ عَائِشَةَ أَعْتَمَ النَّبِيُّ صلى الله عليه وسلم بِالْعَتَمَةِ وَقَالَ جَابِرٌ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الْعِشَاءَ وَقَالَ أَبُو بَرْزَةَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُؤَخِّرُ الْعِشَاءَ وَقَالَ أَنَسٌ أَخَّرَ النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ الْآخِرَةَ وَقَالَ ابْنُ عُمَرَ وَأَبُو أَيُّوبَ وَابْنُ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمْ صَلَّى النَّبِيُّ صلى الله عليه وسلم الْمَغْرِبَ وَالْعِشَاءَ. আবূ হুরাইরাহ্ (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন যে, মুনাফিকদের জন্য সবচেয়ে কষ্টকর সালাত হল ‘ইশা ও ফজর। তিনি আরও বলেছেন যে, তারা যদি জানতো, আতামা (ইশা) ও ফজরে কি কল্যাণ নিহিত আছে। ইমাম বুখারী (রহ.) বলেন, ‘ইশা শব্দ ব্যবহার করাই উত্তম। কেননা, আল্লাহ্ তা‘আলা ইরশাদ করেনঃ ‘‘‘ইশা সালাতের পর’’- (সূরাহ্ আন-নূর ২৪/৫৮)। আবূ মূসা (রাযি.) হতে বর্ণিত আছে যে, তিনি বলেন, আমরা পালাক্রমে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর এখানে ‘ইশার সালাতের সময় যেতাম। একবার তিনি তা দেরী করে আদায় করেন। ইবনু ‘আব্বাস ও ‘আয়িশাহ্ (রাযি.) হতে (এরূপ) বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘ইশা দেরী করে আদায় করেন। বর্ণনাকারীদের কেউ কেউ বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আতামাহ্কে দেরী করে আদায় করেন। জাবির (রাযি.) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘ইশার সালাত আদায় করলেন। আবূ বারযা (রাযি.) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘ইশার সালাত বিলম্বে আদায় করতেন। আনাস (রাযি.) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শেষ ‘ইশা বিলম্বে আদায় করলেন। ইবনু উমর, আবূ আইয়ূব ও ইবনু ‘আব্বাস (রাযি.) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিব ও ‘ইশার সালাত আদায় করেন। ৫৬৪. ‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, এক রাতে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে ‘ইশার সালাত আদায় করেন, যে সালাতকে লোকেরা ‘আতামা’ বলে থাকে। অতঃপর তিনি ফিরে আমাদের দিকে মুখ করে বললেন, আজকের এ রাত সম্পর্কে তোমরা জান কি? এ রাত হতে নিয়ে একশ’ বছরের শেষ মাথায় আজ যারা ভূপৃষ্ঠে আছে তাদের কেউ অবশিষ্ট থাকবে না। (১১৬) (আধুনিক প্রকাশনীঃ ৫৩১, ইসলামিক ফাউন্ডেশনঃ ৫৩৭)",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		}
	]
}