{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5763,
			"arabicnumber": 5763,
			"text": "وَقَوْلِ اللَّهِ تَعَالَى: (وَلَكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنْزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّى يَقُولاَ إِنَّمَا نَحْنُ فِتْنَةٌ فَلاَ تَكْفُرْ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ وَمَا هُمْ بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلاَّ بِإِذْنِ اللَّهِ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلاَ يَنْفَعُهُمْ وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الآخِرَةِ مِنْ خَلاَقٍ). وَقَوْلِهِ تَعَالَى: (وَلاَ يُفْلِحُ السَّاحِرُ حَيْثُ أَتَى). وَقَوْلِهِ: (أَفَتَأْتُونَ السِّحْرَ وَأَنْتُمْ تُبْصِرُونَ). وَقَوْلِهِ: (يُخَيَّلُ إِلَيْهِ مِنْ سِحْرِهِمْ أَنَّهَا تَسْعَى). وَقَوْلِهِ: (وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ) وَالنَّفَّاثَاتُ السَّوَاحِرُ. (تُسْحَرُونَ) تُعَمَّوْنَ. মহান আল্লাহর বাণীঃ শায়ত্বনরাই কুফুরী করেছিল, তারা মানুষকে যাদু শিক্ষা দিত এবং যা বাবিলের দু’জন ফেরেশতা হারূত ও মারূতের উপর পৌঁছানো হয়েছিল ..... পরকালে তার কোনই অংশ থাকবে না পর্যন্ত- (সূরাহ আল-বাকারাহ ২/১০২)। মহান আল্লাহর বাণীঃ যাদুকর যেরূপ ধরেই আসুক না কেন, সফল হবে না- সূরাহ ত্বহা ২০/৬৯)। মহান আল্লাহর বাণীঃ তোমরা কি দেখে-শুনে যাদুর কবলে পড়বে?- (সূরাহ আম্বিয়া ২১/৩)। মহান আল্লাহর বাণীঃ তখন তাদের যাদুর কারণে মূসার মনে হল যে, তাদের রশি আর লাঠিগুলো ছুটোছুটি করছে- (সূরাহ ত্বহা ২০/৬৬)। মহান আল্লাহর বাণীঃ এবং (জাদু করার উদ্দেশে) গিরায় ফুৎকারকারিণীদের অনিষ্ট হতে- (সূরাহ ফালাক্ব ১১৩/৪)। النَّفَّاثَاتُ অর্থ যাদুকর নারী, যারা যাদু করে চোখে ধাঁধা লাগিয়ে দেয়। ৫৭৬৩. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ যুরাইক গোত্রের লাবীদ ইবনু আ‘সাম নামক এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে যাদু করে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মনে হতো যেন তিনি একটি কাজ করেছেন, অথচ তা তিনি করেননি। একদিন বা একরাত্রি তিনি আমার কাছে ছিলেন। তিনি বার বার দু‘আ করতে থাকেন। তারপর তিনি বলেনঃ হে ‘আয়িশাহ! তুমি কি বুঝতে পেরেছ যে, আমি আল্লাহর কাছে যা জানতে চেয়েছিলাম, তিনি আমাকে তা জানিয়ে দিয়েছেন। (স্বপ্নে দেখি) আমার নিকট দু’জন লোক আসেন। তাদের একজন আমার মাথার কাছে এবং অপরজন দু’পায়ের কাছে বসেন। একজন তাঁর সঙ্গীকে বলেনঃ এ লোকটির কী ব্যথা? তিনি বলেনঃ যাদু করা হয়েছে। প্রথম জন বলেনঃ কে যাদু করেছে? দ্বিতীয় জন বলেন, লাবীদ বিন আ’সাম। প্রথম জন জিজ্ঞেস করেনঃ কিসের মধ্যে? দ্বিতীয় জন উত্তর দেনঃ চিরুনী, মাথা আঁচড়ানোর সময় উঠা চুল এবং এক পুং খেজুর গাছের ‘জুব’-এর মধ্যে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কয়েকজন সাহাবী সাথে নিয়ে সেখানে যান। পরে ফিরে এসে বলেনঃ হে ‘আয়িশাহ! সে কূপের পানি মেহদীর পানির মত লাল) এবং তার পাড়ের খেজুর গাছের মাথাগুলো শয়তানের মাথার মত। আমি বললামঃ হে আল্লাহর রাসূল! আপনি কি এ কথা প্রকাশ করে দিবেন না? তিনি বললেনঃ আল্লাহ আমাকে আরোগ্য দান করেছেন, আমি মানুষকে এমন বিষয়ে প্ররোচিত করতে পছন্দ করি না, যাতে অকল্যাণ রয়েছে। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিলে সেগুলো মাটিতে পুঁতে ফেলা হয়। আবূ উসামাহ আবূ যামরাহ ও ইবনু আবূ যিনাদ (রহ.) হিশাম থেকে অনুরূপ বর্ণনা করেছেন। লাইস ও ইবনু ‘উয়াইনাহ (রহ.) হিশাম থেকে বর্ণনা করেছেন, চিরুনী ও কাতানের টুকরায়। আবূ ‘আবদুল্লাহ (রহ.) বলেন, الْمُشَاطَةُ হল চিরুনী করার পর যে চুল বের হয়। مُشَاقَةِ হল কাতান। [৩১৭৫] আধুনিক প্রকাশনী- ৫৩৪২, ইসলামিক ফাউন্ডেশন- ৫২৩৮",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 77
			}
		}
	]
}