{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5807,
			"arabicnumber": 5807,
			"text": "وَقَالَ ابْنُ عَبَّاسٍ خَرَجَ النَّبِيُّ صلى الله عليه وسلم وَعَلَيْهِ عِصَابَةٌ دَسْمَاءُ وَقَالَ أَنَسٌ عَصَبَ النَّبِيُّ صلى الله عليه وسلم عَلٰى رَأْسِه„ حَاشِيَةَ بُرْدٍ. ইবনু ‘আব্বাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা বাইরে আসলেন, তখন তাঁর মাথার) উপর কালো রুমাল ছিল। আনাস (রাঃ) বলেছেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজ মাথা চাদরের এক পার্শ্ব দিয়ে বেঁধে রেখেছিলেন। ৫৮০৭. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, কতক মুসলিম হাবশায় হিজরাত করেন। এ সময় আবূ বাকর (রাঃ) হিজরাত করার প্রস্তুতি গ্রহণ করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি একটু অপেক্ষা কর; কেননা মনে হয় আমাকেও (হিজরাতের) হুকুম দেয়া হবে। আবূ বাকর বললেনঃ আমার পিতা আপনার উপর কুরবান হোক, আপনিও কি এ আশা পোষণ করেন? তিনি বললেনঃ হাঁ। আবূ বাকর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গ লাভের আশায় নিজেকে সংবরণ করে রাখেন এবং তাঁর অধীনস্থ দু’টি সাওয়ারীকে চার মাস যাবৎ সামূর গাছের পাতা খাওয়ান। ‘উরওয়াহ রাহ.) বর্ণনা করেন, ‘আয়িশাহ (রাঃ) বলেছেন যে, একদিন ঠিক দুপুরের সময় আমরা আমাদের ঘরে বসে আছি। এ সময় এক লোক আবূ বাকর (রাঃ)-কে বলল, এই যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুখমন্ডল ঢেকে এগিয়ে আসছেন। এমন সময় তিনি এসেছেন, যে সময় তিনি সাধারণতঃ আমাদের কাছে আসেন না। আবূ বাকর (রাঃ) বললেনঃ আমার মা-বাপ তাঁর উপর কুরবান হোক, আল্লাহর কসম! এমন সময় তিনি একটি গুরুত্বপূর্ণ বিষয় নিয়েই এসে থাকবেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসলেন। তিনি অনুমতি চাইলেন। তাঁকে অনুমতি দেয়া হল। তিনি প্রবেশ করলেন। প্রবেশের সময় আবূ বাকর (রাঃ)-কে বললেনঃ তোমার কাছে যারা আছে তাদের হটিয়ে দাও। তিনি বললেনঃ আমার পিতা আপনার উপর কুরবান হোক, হে আল্লাহর রাসূল! এরা তো আপনারই পরিবারস্থ লোক। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমাকে মক্কা থেকে বের হওয়ার অনুমতি দেয়া হয়েছে। আবূ বাকর বললেনঃ তাহলে আমি কি আপনার সঙ্গী হব? হে আল্লাহর রাসূল! আমার পিতা-মাতা আপনার উপর কুরবান হোক। তিনি বললেনঃ হাঁ। আবূ বাকর (রাঃ) বললেনঃ হে আল্লাহর রাসূল! আপনি আমার এ দু’টি সাওয়ারীর একটি গ্রহণ করুন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মূল্যের বিনিময়ে (নিব)। ‘আয়িশাহ (রাঃ) বলেনঃ তাদের উভয়ের জন্যে সফরের জিনিসপত্র প্রস্তুত করলাম এবং সফরকালের নাস্তা তৈরী করে একটি চামড়ার থলের মধ্যে রাখলাম। আবূ বাকর -এর কন্যা আসমা তাঁর উড়নার এক অংশ ছিঁড়ে থলের মুখ বেঁধে দিল। এ কারণে তাকে যাতুন্ নিতাক উড়না ওয়ালী) নামে ডাকা হত। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবূ বাকর ‘সাওর’ নামক পর্বত গুহায় পৌঁছেন। সেখানে তিন রাত কাটান। আবূ বাকর -এর পুত্র ‘আবদুল্লাহ তাঁদের সঙ্গে রাত্রি কাটাতেন। তিনি ছিলেন সুচতুর বুদ্ধিসম্পন্ন যুবক। তিনি তাঁদের নিকট হতে রাতের শেষ ভাগে চলে আসতেন এবং ভোর বেলা কুরাইশদের সাথে মিশে যেতেন, যেন তাদের মধ্যেই তিনি রাত কাটিয়েছেন। তিনি কারও থেকে পার্শ্ববর্তী স্থানে কিছু শুনলে তা মনে রাখতেন এবং রাতের আঁধার ছড়িয়ে পড়লে দিনের সব খবর নিয়ে তিনি তাদের দু’জনের কাছে পৌঁছে দিতেন। আবূ বাকর -এর দাস ‘আমির ইবনু ফুহাইরা তাঁদের আশে পাশে দুধওয়ালা বকরী চরাতেন, রাতের এক ঘণ্টা পার হলে সে তাঁদের নিকট ছাগল নিয়ে যেত (দুধ পান করাবার জন্যে)। তাঁরা দু’জনে (‘আমির ও ‘আবদুল্লাহ) গুহাতেই রাত কাটাতেন। ভোরে আঁধার থাকতেই ‘আমির ইবনু ফুহাইরা ছাগল নিয়ে চলে আসতেন। ঐ তিন রাতের প্রতি রাতেই তিনি এমন করতেন। [৪৭৬] (আধুনিক প্রকাশনী- ৫৩৮২, ইসলামিক ফাউন্ডেশন- ৫২৭৮)",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 25
			}
		}
	]
}