{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6207,
			"arabicnumber": 6207,
			"text": "মিসওয়ার (রাঃ) বলেন যে, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, কিন্তু যদি ইবনু আবূ তালিব চায়। ৬২০৭. উসামাহ ইবনু যায়দ (রাঃ) বর্ণনা করেন যে, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি গাধার উপর সাওয়ার ছিলেন। তখন তাঁর গায়ে একখানা ফাদাকী চাদর ছিল এবং তাঁর পেছনে উসামাহ বসাছিলেন। তিনি বদরের যুদ্ধের পূর্বে সা’দ ইবনু ‘উবাদাহ (রাঃ) এর শুশ্রূষা করার উদ্দেশে হারিস ইবনু খাযরাজ গোত্র অভিমুখে রওয়ানা হচ্ছিলেন। তাঁরা চলতে চলতে এক মজলিসের পাশ দিয়ে অতিক্রম করছিলেন। সেখানে ‘আবদুল্লাহ ইবনু উবাই ইবনু সালূল ছিল। এটা ছিল ‘আবদুল্লাহ ইবনু ‘উবাইর এর (প্রকাশ্যে) ইসলাম গ্রহণের আগের ঘটনা। মজলিসটি ছিল মিশ্রিত। এতে ছিলেন মুসলিম, মুশরিক, মূর্তিপূজকও ইয়াহূদী। মুসলিমদের মধ্যে ‘আবদুল্লাহ ইবনু রাওয়াহা ও ছিলেন। সাওয়ারীর চলার কারণে যখন উড়ন্ত ধূলাবালি মজলিসকে ঢেকে ফেলেছিল, তখন ইবনু উবাই তার চাদর দিয়ে তার নাক ঢেকে নিয়ে বললঃ তোমরা আমাদের উপর ধূলি উড়িওনা। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের সালাম করলেন এবং সাওয়ারী থামিয়ে নামলেন। তারপর তিনি তাদের আল্লাহর দিকে দা’ওয়াত দিয়ে কুরআন পড়ে শোনালেন। তখন ‘আবদুল্লাহ ইবনু ‘উবাই ইবনু সালূল তাঁকে বললঃ হে ব্যক্তি! আপনি যা বলেছেন যদি তা ঠিক হয়ে থাকে তবে তার চেয়ে উত্তম কথা আর কিছুই নেই। তবে আপনি আমাদের মজলিসসমূহে এসে আমাদের কষ্ট দিবেন না। যে আপনার কাছে যাবে, তাকেই আপনি নাসীহাত করবেন। তখন ‘আবদুল্লাহ ইবনু রাওয়াহা বললেনঃ না, হে আল্লাহর রাসূল! আপনি আমাদের মজলিসসমূহে আসবেন। আমরা আপনার এ বক্তব্য পছন্দ করি। তখন মজলিসের মুসলিম, মুশরিক ও ইয়াহূদীরা পরস্পর গালমন্দ করতে লাগল। এমনকি তাদের মধ্যে হাঙ্গামা হবার জোগাড় হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিবৃত্ত করতে লাগলেন, অবশেষে তারা চুপ করল। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজ সওয়ারীর উপর সওয়ার হয়ে রওয়ানা হয়ে গেলেন এবং সা’দ ইবনু ‘উবাদাহ (রাঃ) এর নিকট পৌঁছলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে সা‘দ! আবূ হুবাব অর্থাৎ ‘আবদুল্লাহ ইবনু উবাই আমাকে যা বলেছে, তা কি তুমি শোননি? সে এমন এমন কথা বলেছে। তখন সা‘দ ইবনু ‘উবাদাহ বললেনঃ হে আল্লাহর রাসূল! আমার পিতা আপনার প্রতি কুরবান, আপনি তাকে ক্ষমা করে দিন এবং তার কথা ছেড়ে দিন। সেই সত্তার কসম! যিনি আপনার উপর কুরআন অবতীর্ণ করেছেন। নিশ্চয়ই আল্লাহ তা‘আলার তরফ থেকে আপনার প্রতি হক এমন সময় অবতীর্ণ হয়েছে, যখন এই শহরের অধিবাসীরা পরস্পর পরামর্শ করে স্থির করেছিল যে, তারা তাকে রাজ মুকুট পরাবে এবং (রাজকীয়) পাগড়ী তার মাথায় বাঁধবে। কিন্তু যখন আল্লাহ আপনাকে যে সত্য দিয়েছেন তা দিয়ে সেই সিদ্ধান্তকে বানচাল করে দিলেন, তখন সে এতে ক্ষুব্ধ হয়ে পড়েছে। এজন্যই সে আপনার সাথে এ ধরনের আচরণ করেছে যা আপনি দেখছেন। তারপর তিনি তাকে ক্ষমা করে দিলেন। আর আল্লাহর নির্দেশানুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীগণ তো এমনিই মুশরিক ও কিতাবীদের ক্ষমা করে দিতেন এবং তাদের নির্যাতনে ধৈর্য ধারণ করতেন। এ প্রসঙ্গে আল্লাহর বাণীঃ ‘‘তোমরা নিশ্চয়ই তোমাদের আগের কিতাবধারীদের ও মুশরিকদের নিকট হতে দুঃখজনক অনেক কথা শুনবে.....। ’’ (সূরাহ আলে ‘ইমরান ৩ঃ ১৮৬) শেষ পর্যন্ত। আল্লাহ আরো বলেছেন, ‘‘কিতাবীরা অনেকেই কামনা করে.....।’’ (সূরাহ আল-বাকারাহ ২ঃ ১০৯) তাই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর নির্দেশানুযায়ী তাদের ক্ষমা করতে থাকেন। অবশেষে তাঁকে তাদের সাথে জিহাদ করার অনুমতি দেয়া হয়। তারপর যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বদর অভিযান চালালেন, তখন এর মাধ্যমে আল্লাহ কাফির বীর পুরুষদের এবং কুরাইশ সরদারদের মধ্যে যারা নিহত হবার তাদের হত্যা করেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীগণ বিজয় বেশে গনীমত নিয়ে ফিরলেন। তাঁদের সাথে কাফিরদের অনেক বাহাদুর ও কুরাইশদের অনেক নেতাও বন্দী হয়ে আসে। সে সময় ইবনু ‘উবাই ইবনু সালূল ও তাঁর সাথী মূর্তিপূজক মুশরিকরা বললঃ এ ব্যাপার (অর্থাৎ দ্বীন ইসলাম) তো প্রবল হয়ে পড়ছে। সুতরাং এখন তোমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাতে ইসলামের বায়‘আত গ্রহণ কর। তারপর তারা সবাই ইসলাম গ্রহণ করল। [২৯৮৭] (আধুনিক প্রকাশনী- ৫৭৬৬, ইসলামিক ফাউন্ডেশন- ৫৬৬১)",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 231
			}
		}
	]
}