{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6259,
			"arabicnumber": 6259,
			"text": "‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ও যুবায়র ইবনু আওয়াম এবং আবূ মারসাদ গানাভী (রাঃ)-কে অশ্ব বের করে নির্দেশ দিলেন যে, তোমরা রওয়ানা হয়ে যাও এবং ‘রওযায়ে খাখে’ গিয়ে উপস্থিত হও। সেখানে একজন মুশরিক স্ত্রীলোক পাবে। তার কাছে হাতিব ইবনু আবূ বালতার দেয়া মুশরিকদের প্রতি প্রেরিত একখানি পত্র আছে। আমরা ঠিক সেই জায়গাতেই তাকে পেয়ে গেলাম যেখানকার কথা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন। ঐ স্ত্রী লোকটি তার এক উটের উপর সওয়ার ছিল। আমরা তাকে জিজ্ঞেস করলাম যে, তোমার কাছে যে পত্রখানি আছে তা কোথায়? সে বললঃ আমার সাথে কোন পত্র নেই। তখন আমরা তার উটসহ তাকে বসালাম এবং তার সাওয়ারীর আসবাবপত্রের তল্লাশি করলাম। কিন্তু আমরা কিছুই খুঁজে পেলাম না। আমার দু’জন সাথী বললেনঃ পত্রখানা তো পাওয়া গেল না। আমি বললামঃ আমার জানা আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনর্থক কথা বলেননি। তখন তিনি স্ত্রী লোকটিকে ধমক দিয়ে বললেনঃ তোমাকে অবশ্যই চিঠিটা বের করে দিতে হবে, নইলে আমি তোমাকে উলঙ্গ করে তল্লাশি চালাব। এরপর সে যখন আমার দৃঢ়তা লক্ষ্য করল, তখন সে বাধ্য হয়ে তার কোমরে পেঁচানো চাদরে হাত দিয়ে ঐ পত্রখানা বের করে দিল। তারপর আমরা তা নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পৌঁছলাম। তখন তিনি হাতিব (রাঃ)-কে জিজ্ঞেস করলেনঃ হে হাতিব! তুমি কেন এমন কাজ করলে? তিনি বললেনঃ আমার মনে এমন কোন খারাপ ইচ্ছে নেই যে, আমি আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান ও বিশ্বাস হারিয়ে ফেলি। আমি আমার দৃঢ় মনোভাব পরিবর্তন করিনি এবং আমি দ্বীনও বদল করিনি। এই চিঠি দ্বারা আমার নিছক উদ্দেশ্য ছিল যে, এতে মক্কাবাসীদের উপর আমার দ্বারা এমন উপকার হোক, যার ফলে আল্লাহ তা‘আলা আমার পরিবার ও সম্পদ নিরাপদে রাখবেন। আর সেখানে আপনার অন্যান্য সাহাবীদের এমন লোক আছেন যাঁদের দ্বারা আল্লাহ তা‘আলা তাদের পরিবার ও সম্পদের নিরাপত্তা দান করবেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হাতিব ঠিক কথাই বলেছে। সুতরাং তোমরা তাকে ভাল ব্যতীত অন্য কিছুই বলো না। রাবী বলেনঃ ‘উমার ইবনু খাত্তাব (রাঃ) বললেন, তিনি নিশ্চয় আল্লাহ ও তাঁর রাসূল এবং মু’মিনদের সঙ্গে বিশ্বাসঘাতকতা করেছেন। অতএব আমাকে ছেড়ে দিন আমি তাঁর গর্দান উড়িয়ে দেই। রাবী বলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে ‘উমার! তোমার কি জানা নেই যে, নিশ্চয়ই আল্লাহ তা‘আলা বদর যুদ্ধে অংশগ্রহণকারীদের সম্পর্কে জ্ঞাত আছেন এবং ঘোষণা করেছেন যে, তোমরা যা ইচ্ছে করতে পার। নিশ্চয়ই তোমাদের জন্য জান্নাত নির্ধারিত হয়ে আছে। রাবী বলেনঃ তখন ‘উমার (রাঃ) এর দু’চোখ দিয়ে অশ্রু ঝরতে লাগলো। তিনি বললেন, আল্লাহ ও তাঁর রাসূলই সবচেয়ে ভাল জানেন। [৩০০৭] (আধুনিক প্রকাশনী- ৫৮১৭, ইসলামিক ফাউন্ডেশন- ৫৭১২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 33
			}
		}
	]
}