{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6331,
			"arabicnumber": 6331,
			"text": "وَمَنْ خَصَّ أَخَاهُ بِالدُّعَاءِ دُونَ نَفْسِهِ. وَقَالَ أَبُو مُوسَى قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ، اللَّهُمَّ اغْفِرْ لِعَبْدِ اللَّهِ بْنِ قَيْسٍ ذَنْبَهُ আর যিনি নিজেকে বাদ দিয়ে কেবল নিজের ভাই-এর জন্য দু‘আ করেন আবূ মূসা (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আ করেন, হে আল্লাহ! আপনি ‘উবায়দ আবূ ‘আমিরকে ক্ষমা করুন। হে আল্লাহ! আপনি ‘আবদুল্লাহ ইবনু ক্বায়সের গুনাহক্ষমা করে দিন। ৬৩৩১. সালামাহ ইবনু আকওয়া (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একবার আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে খায়বার অভিযানে বের হলাম। সেনাবাহিনীর এক ব্যক্তি বললেনঃ ওহে ‘আমির! যদি আপনি আপনার ছোট ছোট কবিতা থেকে কিছুটা আমাদের শুনাতেন? তখন তিনি সওয়ারী থেকে নেমে হুদী গাইতে গাইতে বাহন হাঁকিয়ে নিতে শুরু করলেন। তাতে উল্লেখ করলেনঃ আল্লাহ তা‘আলা না হলে আমরা হিদায়াত পেতাম না। (রাবী বলেন) এছাড়া আরও কিছু কবিতা তিনি আবৃত্তি করলেন, যা আমি স্মরণ রাখতে পারিনি। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেনঃ এ উট চালক লোকটি কে? সাথীরা বললেনঃ উনি ‘আমির ইবনু আকওয়া। তিনি বললেনঃ আল্লাহ তার উপর রহম করুন। তখন দলের একজন বললেনঃ হে আল্লাহর রাসূল! আপনি তার দু‘আয় আমাদেরকেও অন্তর্ভুক্ত করলে ভাল হতো না? এরপর যখন মুজাহিদগণ কাতারবন্দী হয়ে শত্রুর বিরুদ্ধে যুদ্ধ করলেন, এ সময় ‘আমির তাঁর নিজের তলোয়ারের অগ্রভাগের আঘাতে আহত হলেন এবং এ আঘাতের ফলে তিনি মারা গেলেন। এদিন লোকেরা সন্ধ্যার পর (পাকের জন্য) বিভিন্নভাবে অনেক আগুন জ্বালালেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেনঃ এ সব আগুন কিসের? এসব আগুন দিয়ে তোমরা কী জ্বাল দিচ্ছ। তারা বললেনঃ আমরা গৃহপালিত গাধার গোশত জ্বাল দিচ্ছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হাঁড়িতে যা আছে, তা সব ফেলে দাও এবং হাঁড়িগুলোও ভেঙ্গে ফেল। এক ব্যক্তি বললেনঃ হে আল্লাহর রাসূল! হাঁড়িতে যা আছে তা ফেলে দিলে এবং পাত্রগুলো ধুয়ে নিলে চলবে না? তিনি বললেনঃ তবে তাই কর। [২৪৭৭] (আধুনিক প্রকাশনী- ৫৮৮৬, ইসলামিক ফাউন্ডেশন- ৫৭৭৯)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 28
			}
		}
	]
}