{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6417,
			"arabicnumber": 6417,
			"text": "وَقَوْلِ اللَّهِ تَعَالَى: (فَمَنْ زُحْزِحَ عَنِ النَّارِ وَأُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ وَمَا الْحَيَاةُ الدُّنْيَا إِلاَّ مَتَاعُ الْغُرُورِ)، (ذَرْهُمْ يَأْكُلُوا وَيَتَمَتَّعُوا وَيُلْهِهِمُ الأَمَلُ فَسَوْفَ يَعْلَمُونَ). وَقَالَ عَلِيٌّ ارْتَحَلَتِ الدُّنْيَا مُدْبِرَةً، وَارْتَحَلَتِ الآخِرَةُ مُقْبِلَةً، وَلِكُلِّ وَاحِدَةٍ مِنْهُمَا بَنُونَ، فَكُونُوا مِنْ أَبْنَاءِ الآخِرَةِ، وَلاَ تَكُونُوا مِنْ أَبْنَاءِ الدُّنْيَا، فَإِنَّ الْيَوْمَ عَمَلٌ وَلاَ حِسَابَ، وَغَدًا حِسَابٌ وَلاَ عَمَلَ. (بِمُزَحْزِحِهِ) بِمُبَاعِدِهِ. আল্লাহর বাণীঃ যে ব্যক্তিকে জাহান্নামের আগুন হতে রক্ষা করা হল এবং জান্নাতে দাখিল করা হল, অবশ্যই সে ব্যক্তি সফলকাম হল, কেননা পার্থিব জীবন ছলনার বস্তু ছাড়া আর কিছুই নয়।- (সূরাহ আলে ‘ইমরান ৩/১৮৫)। ছেড়ে দাও ওদেরকে, ওরা খেতে থাক আর ভোগ করতে থাক, আর (মিথ্যে) আশা ওদেরকে উদাসীনতায় ডুবিয়ে রাখুক, শীঘ্রই ওরা (ওদের ‘আমলের পরিণতি) জানতে পারবে। (সূরাহ আল-হিজর ১৫/৩)। ‘আলী (রাঃ) বলেন, এ দুনিয়া পেছনের দিকে যাচ্ছে, আর আখিরাত সামনের দিকে এগিয়ে আসছে। এ দু’টির প্রতিটির আছে সন্তানাদি। অতএব তোমরা আখিরাতের সন্তানদের অন্তর্ভুক্ত হও। দুনিয়ার সন্তানদের অন্তর্ভুক্ত হয়ো না। কারণ, আজ ‘আমলের দিন, অতএব হিসাব নেই। আর আগামীকাল হিসাব, কোন ‘আমল নেই। [1] ৬৪১৭. ‘আবদুল্লাহ্ ইবনু মাস্‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি চতুর্ভুজ আঁকলেন এবং এর মধ্যখানে একটি রেখা টানলেন, যা তাত্থেকে বের হয়ে গেল। তারপর দু’পাশ দিয়ে মধ্যের রেখার সঙ্গে ভেতরের দিকে কয়েকটা ছোট ছোট রেখা মিলালেন এবং বললেন, এ মাঝের রেখাটা হলো মানুষ। আর এ চতুর্ভুজটি হলো তার আয়ু, যা বেষ্টন করে আছে। আর বাইরে বেরিয়ে যাওয়া রেখাটি হলো তার আশা। আর এ ছোট ছোট রেখাগুলো বাধা-বন্ধন। যদি সে এর একটা এড়িয়ে যায়, তবে আরেকটা তাকে দংশন করে। আর আরেকটি যদি এড়িয়ে যায় তবে আরেকটি তাকে দংশন করে। (আধুনিক প্রকাশনী-৫৯৬৯ , ইসলামিক ফাউন্ডেশন- ৫৯৭৫)",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 6
			}
		}
	]
}