{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "আসওয়াদ (রহ.) হতে বর্ণিত। তিনি বলেন, একদা আমরা ‘আয়িশাহ্ (রাযি.)-এর নিকট বসে নিয়মিত সালাত আদায় ও তার মর্যাদা সম্বন্ধে আলোচনা করছিলাম। ‘আয়িশাহ (রাযি.) বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন অন্তিম রোগে আক্রান্ত হয়ে পড়লেন, তখন সালাতের সময় হলে আযান দেয়া হলো। তখন তিনি বললেন, আবূ বাকরকে লোকদের নিয়ে সালাত আদায় করতে বল। তাঁকে বলা হলো যে, আবু বাকর (রাযি.) অত্যন্ত কোমল হৃদয়ের লোক, তিনি যখন আপনার স্থানে দাঁড়াবেন তখন লোকদের নিয়ে সালাত আদায় করা তাঁর পক্ষে সম্ভব হবে না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবার সে কথা বললেন এবং তারাও আবার তা-ই বললেন। তৃতীয়বারও তিনি সে কথা ব’লে বললেন, তোমরা ইউসুফের সাথীদের মত। আবূ বাকরকে নির্দেশ দাও যেন লোকদের নিয়ে সালাত আদায় করে নেয়। আবূ বাকর (রাযি.) এগিয়ে গিয়ে সালাত শুরু করলেন। এদিকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজেকে একটু হাল্কাবোধ করলেন। দু’জন লোকের কাঁধে ভর দিয়ে বেরিয়ে এলেন। ‘আয়িশাহ্ (রাযি.) বলেন,) আমার চোখে এখনও স্পষ্ট ভাসছে। অসুস্থতার কারণে তাঁর দু’পা মাটির উপর দিয়ে হেঁচড়ে যাচ্ছিল। তখন আবূ বাকর (রাযি.) পিছনে সরে আসতে চাইলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে স্বস্থানে থাকার জন্য ইঙ্গিত করলেন। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে আনা হলো, তিনি আবূ বাকর (রাযি.)-এর পাশে বসলেন। আ‘মাশকে জিজ্ঞেস করা হলোঃ তাহলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইমামাত করছিলেন। আর আবূ বাকর (রাযি.) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অনুসরণে সালাত আদায় করছিলেন এবং লোকেরা আবু বাকর (রাযি.)-এর সালাতের অনুসরণ করছিল। আ‘মাশ (রাযি.) মাথার ইঙ্গিতে বললেন, হ্যাঁ। আবূ দাঊদ (রহ.) শু‘বা (রহ.) সূত্রে আ‘মাশ (রাযি.) হতে হাদীসের কিয়দংশ উল্লেখ করেছেন। আবূ মু‘আবিয়াহ (রহ.) অতিরিক্ত বলেছেন, তিনি আবূ বাকর (রাযি.)-এর বাঁ দিকে বসেছিলেন এবং আবূ বাকর (রাযি.) দাঁড়িয়ে সালাত আদায় করছিলেন। (১৯৮; মুসলিম ৪/২১, হাঃ ৪১৮, ২৬১৯৭) (আধুনিক প্রকাশনীঃ ৬২৪, ইসলামিক ফাউন্ডেশনঃ ৬৩১)",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		}
	]
}