{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6649,
			"arabicnumber": 6649,
			"text": "যাহদাম (রহঃ) হতে বর্ণিত। তিনি বলেন, আমাদের গোত্র জারাম এবং আশ‘আরী গোত্রের মাঝে বন্ধুত্ব ও ভ্রাতৃত্ব ছিল। আমরা (একবার) আবূ মূসা আশ‘আরীর সাথে ছিলাম। তাঁর কাছে খাবার উপস্থিত করা হল, যাতে ছিল মুরগীর গোশত। তাইমিল্লাহ্ গোত্রের এক লাল রঙের ব্যক্তি তাঁর কাছে ছিল। সে দেখতে গোলামদের মত। তিনি তাকে খাবার খেতে ডাকলেন। তখন সে লোকটি বলল, আমি মুরগীকে এমন জিনিস খেতে দেখেছি যার জন্য আমি তাকে ঘৃণা করি। তাই আমি কসম করেছি যে, মুরগী খাব না। তিনি বললেন, ওঠ, আমি এ সম্পর্কে অবশ্যই তোমাকে একখানা হাদীস বলব। একবার আমি কতক আশ‘আরীর সাথে বাহন সংগ্রহের জন্য রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এলাম। তখন তিনি বললেনঃ আল্লাহর কসম! আমি তোমাদেরকে বাহন দিতে পারব না। তোমাদের বাহন দেয়ার জন্য কিছুই আমার কাছে নেই। এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে গনীমতের কিছু উট এল। তিনি আমাদের সম্পর্কে জিজ্ঞেস করলেন এবং বললেনঃ আশ‘আরী দলটি কোথায়? এরপর আমাদের জন্য পাঁচটি উত্তম সুন্দর উট দেয়ার জন্য নির্দেশ দিলেন। আমরা যখন চলে গেলাম, তখন চিন্তা করলাম আমরা এ কী করলাম? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তো শপথ করেছিলেন আমাদেরকে বাহন দেবেন না। আর তাঁর কাছে কোন বাহন তো ছিলও না। কিন্তু এরপর তিনি তো আমাদেরকে আরোহণের বাহন দিলেন। আমরা রাসূলুল্লাহকে সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম- তার কসমের ব্যাপারে অন্যমনস্ক রেখেছিলাম। আল্লাহর কসম! এ বাহন আমাদের কোন উপকারে আসবে না। কাজেই আমরা তাঁর কাছে ফিরে গেলাম এবং তাঁকে বললাম যে, আমাদেরকে আপনি আরোহণ করাবেন এ উদ্দেশে আমরা তো আপনার কাছে এসেছিলাম। আপনি কসম করেছিলেন যে, আপনি আমাদেরকে কোন বাহন দিবেন না। আর আপনার কাছে এমন কোন কিছু ছিলও না, যাতে আমাদেরকে আরোহণ করাতে পারেন। তখন তিনি বলেছিলেনঃ আমি তোমাদেরকে আরোহণ করাইনি বরং আল্লাহ্ আরোহণ করিয়েছেন। আল্লাহর শপথ! আমি যখন শপথ করি আর তার অন্যটির মাঝে যদি অধিক কল্যাণ দেখতে পাই, তা হলে যা কল্যাণকর তাই বাস্তবায়িত করি এবং আমি শপথ ভঙ্গ করি। [৩১৩৩] (আধুনিক প্রকাশনী- ৬১৮৬, ইসলামিক ফাউন্ডেশন- ৬১৯৪)",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 28
			}
		}
	]
}