{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6721,
			"arabicnumber": 6721,
			"text": "যাহদাম জারমী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমরা একবার আবূ মূসা আশ‘আরী (রাঃ)-এর নিকট ছিলাম। আমাদের এবং জার্ম সম্প্রদায়ের মাঝে ভ্রাতৃভাব ও সুসম্পর্ক বজায় ছিল। রাবী বলেন, তার জন্য খানা হাজির করা হল, আর তাতে ছিল মুরগীর গোশত। তাদের দলের মাঝে বানী তাইমিল্লাহ্ সম্প্রদায়ের এক লোক ছিল যার গায়ের রং ছিল লাল যেন দেখতে গোলাম। রাবী বলেন, লোকটি খানার কাছেও গেল না। আবূ মূসা আশ‘আরী তাকে বললেন, কাছে এসো (খানা খাও) কেননা, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এর গোশ্ত খেতে দেখেছি। লোকটি বলল, আমি একে (মুরগীকে) কিছু খেতে দেখেছি; তাই আমি এটিকে ঘৃণা করি। আর আমি হলফ করেছি যে, আমি এটি কক্ষনো খাব না। আবূ মূসা (রাঃ) বলেন, কাছে এসো; আমি তোমাকে এ সম্পর্কে জানাচ্ছি। একবার আমরা আশ‘আরী গোত্রের একটি দলের সাথে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে বাহন চাওয়ার জন্য এলাম। তখন তিনি যাকাতের উট বণ্টন করছিলেন। আইয়্যুব বলেন, আমার মনে হয় তিনি তখন রাগান্বিত হয়ে বলেছিলেনঃ আল্লাহর কসম! আমি তোমাদেরকে বাহন দিব না। আমার কাছে কোন বাহন নেই। রাবী বলেন, তখন আমরা চলে গেলাম। এমন সময় তাঁর নিকট যুদ্ধে প্রাপ্ত কয়েকটি উট আনা হল। তিনি বললেনঃ ঐ আশ‘আরী লোকগুলো কোথায়? ঐ আশ‘আরী লোকগুলো কোথায়? তখন আমরা ফিরে এলাম এবং রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাঁচটি মোটা তাজা সুন্দর উট আমাদেরকে দেয়ার জন্য নির্দেশ দিলেন। আমরা উটগুলো নিয়ে রওনা হলাম। তখন আমি আমার সাথীদের বললাম, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে বাহন চাওয়ার জন্য এসেছিলাম। আর তিনি আমাদেরকে বাহন দিবেন না বলে কসম করেছিলেন। কিন্তু তারপর আমাদের কাছে লোক পাঠালেন এবং আমাদেরকে বাহন দিলেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কসম ভূলে গেছেন। আল্লাহর কসম! আমরা যদি রাসূলুল্লাহ্কে সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কসম সম্পর্কে গাফেল রাখি তাহলে তো আমরা কখনও সফলকাম হব না। চল, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে ফিরে যাই এবং তাঁর কসমের কথা স্মরণ করিয়ে দেই। অতঃপর আমরা ফিরে গিয়ে বললাম, হে আল্লাহর রাসূল! আমরা আপনার কাছে বাহন চাওয়ার জন্য এসেছিলাম, আপনি আমাদেরকে বাহন দিবেন না বলে কসম করেছিলেন। কিন্তু পরে আবার বাহন দিলেন। এতে আমরা ধারণা করলাম বা বুঝতে পারলাম, আপনি আপনার কসমের কথা ভুলে গেছেন। তখন তিনি বললেনঃ তোমরা চলে যাও। আল্লাহ্ই তো তোমাদেরকে বাহন দিয়েছেন। আল্লাহর কসম! নিশ্চয়ই আমি যখন আল্লাহর ইচ্ছায় কোন ব্যাপারে কসম করি আর অন্যটির ভিতর কল্যাণ দেখতে পাই তখন যেটার মাঝে কল্যাণ আছে সেটা করি এবং কসমের কাফ্ফারা আদায় করে দেই। হাম্মাদ ইবনু যায়দ, আইউব, আবূ কিলাবা এবং কাসিম ইবনু আসিম কুলায়বী (রহ.) থেকে এ হাদীসে ইসমাঈল ইবনু ইব্রাহীমের অনুসরণ করেছেন। [৩১৩৩] (আধুনিক প্রকাশনী- ৬২৫৪, ইসলামিক ফাউন্ডেশন- ৬২৬৪) কুতায়বা সূত্রে যাহদাম (রাঃ) থেকে এরকমই বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন- ৬২৬৫) আবূ মা‘মার সূত্রে যাহদাম (রাঃ) থেকেও এরকমই বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন- ৬২৬৬)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 14
			}
		}
	]
}