{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"3": "Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 68,
			"arabicnumber": 68,
			"text": "৩/১০. বলা ও করার পূর্বে জ্ঞান আবশ্যক। মহা মহিমান্বিত আল্লাহ্ বলেনঃ ‘‘সুতরাং জেনে রাখ, আল্লাহ্ ব্যতীত প্রকৃত কোন উপাস্য নেই।’ (সূরাহ্ মুহাম্মাদ ৪৭/১৯)। আল্লাহ্ ‘ইলম দ্বারা আরম্ভ করেছেন। আলিমগণই নবীগণের উত্তরাধিকারী। তাঁরা জ্ঞানের উত্তরাধিকারী হয়েছেন। যে জ্ঞান অর্জন করে সে বিরাট অংশ লাভ করে। আর যে ব্যক্তি ‘ইল্ম অর্জনের জন্য পথ চলে, আল্লাহ্ তা‘আলা তার জন্য জান্নাতের পথ সুগম করে দেন। আল্লাহ্ তা‘আলা বলেনঃ ‘আল্লাহর বান্দাদের মধ্যে আলিমগণই তাঁকে ভয় করে- (সূরাহ্ ফাতির ৩৫/২৮)। আল্লাহ্ তা‘আলা আরো বলেনঃ ‘‘আলিমগণ ব্যতীত তা কেউ অনুধাবন করে না’’- (সূরাহ্ আল-‘আনকাবুত ২৯/৩৪)। অন্যত্র আল্লাহ বলেনঃ তারা বলবে, ‘আমরা যদি শুনতাম অথবা উপলব্ধি করতাম, তাহলে আমরা জাহান্নামবাসী হতাম না- (সূরাহ্ মুল্ক ৬৭/১০)। অন্যত্র তিনি বলেনঃ ‘‘বল, যারা জানে আর যারা জানে না, তারা কি সমান হতে পারে?’ (সূরাহ্ যুমার ৩৯/৯)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ্ যার কল্যাণ কামনা করেন তাকে দ্বীনের ‘ইল্ম দান করেন। আর অধ্যয়নের মাধ্যমেই জ্ঞান অর্জিত হয়। আবূ যার (রাযি.) তাঁর ঘাড়ের দিকে ইঙ্গিত করে বলেন, যদি তোমরা এখানে তরবারী রাখ, অতঃপর আমি বুঝতে পারি যে, তোমরা সে তরবারী আমার উপর চালাবার পূর্বে আমি একটু কথা বলার সুযোগ পাব, তবে আমি যা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি, অবশ্যই তা বলে ফেলব। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর বাণীঃ উপস্থিত ব্যক্তিরা যেন অনুপস্থিত ব্যক্তির নিকট (আমার বাণী) পৌঁছে দেয়। ইবনু ‘আব্বাস (রাযি.) বলেন, ‘‘তোমরা রববানী হও।’’ (সূরাহ আলু ‘ইমরানঃ ৩/৭৯)। এখানে অর্থ প্রজ্ঞাবান, আলিম ও ফকীহগণ। আরো বলা হয় সে ব্যক্তিকে বলা হয় যিনি মানুষকে জ্ঞানের বড় বড় বিষয়ের পূর্বে ছোট ছোট বিষয় শিক্ষা দিয়ে থাকেন। ৬৮. ইবনু মাস‘ঊদ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের অবস্থার প্রতি লক্ষ্য রেখে নির্দিষ্ট দিনে নাসীহাত করতেন, আমরা যাতে বিরক্ত বোধ না করি। (৭০,৬৪১১; মুসলিম ৫০/১৯ হাঃ ২৮২১, আহমাদ ৪০৬০) (আধুনিক প্রকাশনীঃ ৬৮, ইসলামিক ফাউন্ডেশনঃ ৬৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		}
	]
}