{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 687,
			"arabicnumber": 687,
			"text": "وَصَلَّى النَّبِيُّ صلى الله عليه وسلم فِي مَرَضِهِ الَّذِي تُوُفِّيَ فِيهِ بِالنَّاسِ وَهُوَ جَالِسٌ وَقَالَ ابْنُ مَسْعُودٍ إِذَا رَفَعَ قَبْلَ الْإِمَامِ يَعُودُ فَيَمْكُثُ بِقَدْرِ مَا رَفَعَ ثُمَّ يَتْبَعُ الْإِمَامَ وَقَالَ الْحَسَنُ فِيمَنْ يَرْكَعُ مَعَ الْإِمَامِ رَكْعَتَيْنِ وَلاَ يَقْدِرُ عَلَى السُّجُودِ يَسْجُدُ لِلرَّكْعَةِ الْآخِرَةِ سَجْدَتَيْنِ ثُمَّ يَقْضِي الرَّكْعَةَ الْأُولَى بِسُجُودِهَا وَفِيمَنْ نَسِيَ سَجْدَةً حَتَّى قَامَ يَسْجُدُ. যে রোগে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওফাত হয়, সে সময় তিনি বসে বসে লোকদের ইমামাত করেছেন। ইবনু মাস‘ঊদ (রাযি.) বলেন, কেউ যদি ইমামের পূর্বে মাথা উঠিয়ে ফেলে, তাহলে পুনরায় ফিরে গিয়ে ততটুকু সময় বিলম্ব করবে, যতটুকু সময় মাথা উঠিয়ে রেখেছিল। অতঃপর ইমামকে অনুসরণ করবে। হাসান বাসরী (রহ.) বলেন, যে ব্যক্তি ইমামের সঙ্গে রুকূ‘ সহ দু’রাক‘আত সালাত আদায় করে, কিন্তু সিজদা্ দিতে পারে না, সে শেষ রাক‘আতের জন্য দু’ সিজদা্ করবে এবং প্রথম রাক‘আত সিজদা্সহ পুনরায় আদায় করবে। আর যে ব্যক্তি ভুলক্রমে এক সিজদা্ না দিয়ে দাঁড়িয়ে গেছে, সে (পরের রাক‘আতে) সে সিজদা্ করে নিবে। ৬৮৭. ‘উবাইদুল্লাহ্ ইবনু ‘আবদুল্লাহ্ ইবনু উতবাহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আয়িশাহ্ (রাযি.)-এর খিদমতে উপস্থিত হয়ে বললাম, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর (অন্তিম কালের) অসুস্থতা সম্পর্কে কি আপনি আমাকে কিছু শুনাবেন? তিনি বললেন, অবশ্যই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মারাত্মকভাবে রোগাক্রান্ত হয়ে পড়লেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন, লোকেরা কি সালাত আদায় করে ফেলেছে? আমরা বললাম, না, হে আল্লাহর রাসূল! তাঁরা আপনার জন্য অপেক্ষা করছে। তিনি বললেন, আমার জন্য গোসলের পাত্রে পানি দাও। ‘আয়িশাহ্ (রাযি.) বলেন, আমরা তাই করলাম। তিনি গোসল করলেন। অতঃপর একটু উঠতে চাইলেন, কিন্তু বেহুঁশ হয়ে পড়লেন। কিছুক্ষণ পর একটু হুঁশ ফিরে পেলে আবার তিনি জিজ্ঞেস করলেন, লোকেরা কি সালাত আদায় করে ফেলেছে? আমরা বললাম, না, হে আল্লাহর রাসূল! তাঁরা আপনার অপেক্ষায় আছেন। তিনি বললেন, আমার জন্য গোসলের পাত্রে পানি রাখ। ‘আয়িশাহ্ (রাযি.) বলেন, আমরা তাই করলাম। তিনি গোসল করলেন। আবার উঠতে চাইলেন, কিন্তু বেহুঁশ হয়ে পড়লেন। কিছুক্ষণ পর আবার হুঁশ ফিরে পেয়ে জিজ্ঞেস করলেন, লোকেরা কি সালাত আদায় করে ফেলেছে? আমরা বললাম, না, হে আল্লাহর রাসূল! তাঁরা আপনার জন্য অপেক্ষা করছেন। তিনি বললেন, আমার জন্য গোসলের পাত্রে পানি রাখ। অতঃপর তিনি উঠে বসলেন, এবং গোসল করলেন। এবং উঠতে গিয়ে বেহুঁশ হয়ে পড়লেন। কিছুক্ষণ পর আবার হুঁশ ফিরে পেলেন এবং জিজ্ঞেস করলেন, লোকেরা কি সালাত আদায় করে ফেলেছে? আমরা বললাম, না, হে আল্লাহর রাসূল! তাঁরা আপনার জন্য অপেক্ষারত। ওদিকে সাহাবীগণ ‘ইশার সালাতের জন্য নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অপেক্ষায় মসজিদে বসে ছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ বাকর (রাযি.)-এর নিকট এ মর্মে একজন লোক পাঠালেন যে, তিনি যেন লোকদের নিয়ে সালাত আদায় করে নেন। সংবাদ বাহক আবূ বাকর (রাযি.)-এর নিকট উপস্থিত হয়ে বললেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনাকে লোকদের নিয়ে সালাত আদায়ের নির্দেশ দিয়েছেন। আবূ বাকর (রাযি.) অত্যন্ত কোমল মনের লোক ছিলেন, তাই তিনি ‘উমার (রাযি.)-কে বললেন, হে ‘উমার! আপনি সাহাবীগণকে নিয়ে সালাত আদায় করে নিন। ‘উমার (রাযি.) বললেন, আপনিই এর অধিক যোগ্য। তাই আবূ বাকর (রাযি.) সে কয়দিন সালাত আদায় করলেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটু নিজে হাল্কাবোধ করলেন এবং দু’জন লোকের কাঁধে ভর করে যুহরের সালাতের জন্য বের হলেন। সে দু’জনের একজন ছিলেন ‘আব্বাস (রাযি.)। আবূ বাকর (রাযি.) তখন সাহাবীগণকে নিয়ে সালাত আদায় করছিলেন। তিনি যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখতে পেলেন, পিছনে সরে আসতে চাইলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে পিছিয়ে না আসার জন্য ইঙ্গিত করলেন এবং বললেন, তোমরা আমাকে তাঁর পাশে বসিয়ে দাও। তাঁরা তাঁকে আবূ বাকর (রাযি.)-এর পাশে বসিয়ে দিলেন। বর্ণনাকারী বলেন, অতঃপর আবু বাকর (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সালাতের ইক্তিদা করে সালাত আদায় করতে লাগলেন। আর সাহাবীগণ আবূ বাকর (রাযি.)-এর সালাতের ইক্তিদা করতে লাগলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন উপবিষ্ট ছিলেন। ‘উবাইদুল্লাহ্ বলেন, আমি ‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাযি.)-এর নিকট উপস্থিত হয়ে বললাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অন্তিম কালের অসুস্থতা সম্পর্কে ‘আয়িশাহ্ (রাযি.) আমাকে যে হাদীস বর্ণনা করেছেন, তা কি আমি আপনার নিকট বর্ণনা করব না? তিনি বললেন, করুন। তাই আমি তাঁকে সে হাদীস শুনালাম। তিনি এ বর্ণনার কোন অংশেই আপত্তি করলেন না, তবে তাঁকে তিনি জিজ্ঞেস করলেন যে, ‘আব্বাস (রাযি.)-এর সাথে যে অপর এক সাহাবী ছিলেন, ‘আয়িশাহ্ (রাযি.) কি আপনার নিকট তাঁর নাম বলেছেন? আমি বললাম, না। তিনি বললেন, তিনি ‘আলী (রাযি.)। (১৯৮; মুসলিম ৪/২১, হাঃ ৪১৮, আহমাদ ২৬১৯৭) (আধুনিক প্রকাশনীঃ ৬৪৬, ইসলামিক ফাউন্ডেশনঃ ৬৫৩)",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 81
			}
		}
	]
}