{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6972,
			"arabicnumber": 6972,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিষ্টান্ন দ্রব্য ও মধু পছন্দ করতেন। এবং যখন ‘আসরের সালাত আদায় করে নিতেন তখন তিনি তাঁর স্ত্রীদের কাছে ঘুরে বেড়াতেন এবং তাঁদের কাছে উপস্থিত হতেন। একবার তিনি হাফসাহ (রাঃ)-এর ঘরে প্রবেশ করলেন এবং সাধারণভাবে যত সময় তাঁর কাছে অবস্থান করতেন তার চেয়ে বেশি সময় তাঁর কাছে অবস্থান করলেন। তাই আমি এর কারণ জিজ্ঞেস করলাম। তখন আমাকে বলা হল যে, তার স্বগোত্রীয় এক মহিলা এক কৌটা মধু হাদিয়া পাঠিয়েছে। এ থেকে তিনি আল্লাহর রাসূলকে কিছু পান করিয়েছেন। আমি মনে মনে বললাম, আল্লাহর কসম! আমরা অবশ্যই একটা কূটকৌশল গ্রহণ করব। এরপর আমি এ ব্যাপারে সাওদা (রাঃ)-এর সঙ্গে আলোচনা করলাম। আমি বললাম, যখন তিনি তোমার ঘরে আসবেন, তখন তিনি অবশ্যই তোমার নিকটে যাবেন। এ সময় তুমি তাঁকে বলবে, হে আল্লাহর রাসূল! আপনি মাগাফীর খেয়েছেন? তিনি অবশ্য না-ই বলবেন। তখন তুমি বলবে, তাহলে এ দুর্গন্ধ কিসের? আর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামএর কাছে তাঁর থেকে দুর্গন্ধ পাওয়াটা খুবই গুরুতর মনে হত। তখন তিনি বলবেনঃ হাফসাহ আমাকে মধুর শরবত পান করিয়েছে। তখন তুমি তাঁকে বলবে, তাহলে ঐ মধুর পোকা ‘উরফুত’ গাছের রস সংগ্রহ করেছে। আর আমিও একই কথা বলব। হে সফীয়্যাহ! তুমিও তাঁকে এ কথা বলবে। যখন তিনি সাওদা (রাঃ)-এর ঘরে এলেন, তখন সাওদা (রাঃ) বললেন, কসম ঐ সত্তার, যিনি ব্যতীত আর কোন ইলাহ্ নেই। যখনই তিনি দরজার কাছে এলেন তখনই আমি তোমার ভয়ে তোমার শিখানো কথাগুলো বলতে প্রস্তুত হলাম। এরপর তিনি যখন নিকটে এলেন, তখন আমি বললাম, হে আল্লাহর রাসূল! আপনি ‘মাগফীর’ খেয়েছেন। তিনি বললেন, না। আমি বললাম, তাহলে এ দুর্গন্ধ কিসের? তিনি বললেনঃ হাফসাহ আমাকে মধুর শরবত পান করিয়েছে। আমি বললাম, তাহলে এ মধুর পোকা ‘উরফুত’ গাছের রস সংগ্রহ করেছে। ‘আয়িশাহ (রাঃ) বলেন, এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আমার ঘরে এলেন, তখন আমিও তাঁকে তেমনি কথা বললাম। এরপর তিনি সফীয়্যাহ (রাঃ)-এর ঘরে গেলেন, সেও তাঁকে তেমনি কথা বলল। পুনরায় রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন হাফসাহ (রাঃ)-এর ঘরে প্রবেশ করলেন তখন তিনি তাঁকে বললেন, হে আল্লাহর রাসূল! আপনাকে মধু পান করতে দিব কি? তিনি বললেনঃ এর কোন প্রয়োজন নেই। ‘আয়িশাহ (রাঃ) বলেন, সাওদা (রাঃ) বললঃ সুবহানাল্লাহ্! আমরা তা হারাম করে দিলাম। ‘আয়িশাহ (রাঃ) বলেন, আমি সাওদা (রাঃ)-কে বললাম, চুপ কর।[1] [৪৯১২] (আধুনিক প্রকাশনী- ৬৪৮৮, ইসলামিক ফাউন্ডেশন- ৬৫০১)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 19
			}
		}
	]
}