{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6982,
			"arabicnumber": 6982,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ওয়াহীর শুরু হয় ঘুমের ঘোরে ভালো স্বপ্নের মাধ্যমে। তিনি যে স্বপ্নই দেখতেন তা ভোরের আলোর মত উদ্ভাসিত হতো। তিনি হেরা গুহায় গিয়ে সেখানে বেশ কয়েক রাত ‘ইবাদাতে কাটিয়ে দিতেন এবং এজন্য খাদ্য দ্রব্যও সঙ্গে নিয়ে যেতেন। এরপর খাদীজাহ (রাঃ)-এর কাছে ফিরে আসতেন এবং তিনি তাকে এরূপ খাদ্য দ্রব্য তৈরি করে দিতেন। শেষে তাঁর কাছে সত্যের বাণী (ওয়াহী) আসল। আর এ সময় তিনি হেরা গুহায় ছিলেন। সেখানে ফেরেশতা এসে তাঁকে বলল, আপনি পড়ুন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আমি বললামঃ আমি তো পাঠক নই। তখন তিনি আমাকে জড়িয়ে ধরে শক্ত করে চেপে ধরলেন। এমনকি এতে আমার খুব কষ্ট হল। তারপর তিনি আমাকে ছেড়ে দিলেন এবং বললেন, আপনি পড়ুন। আমি বললাম, আমি পাঠক নই। তিনি দ্বিতীয়বার আমাকে শক্ত করে চেপে ধরলেন। এবারেও এতে আমার খুব কষ্ট হল। অতঃপর তিনি আমাকে ছেড়ে দিয়ে বললেন, আপনি পড়ুন। আমি বললাম, আমি তো পাঠক নই। এরপর তিনি তৃতীয়বার আমাকে শক্ত করে এমন চেপে ধরলেন যে, এবারেও এতে আমার খুব কষ্ট হল। তারপর তিনি আমাকে ছেড়ে দিয়ে বললেন, পাঠ করুন, আপনার প্রতিপালকের নামে যিনি সৃষ্টি করেছেন......যা সে জানত না (সূরাহ আল-আলাক ৯৬/১-৫) এ আয়াত পর্যন্ত। এরপর তিনি তা নিয়ে খাদীজাহ (রাঃ)-এর কাছে কম্পিত হৃদয়ে ফিরে এলেন। আর বললেন, আমাকে কম্বল দিয়ে ঢেকে দাও। আমাকে কম্বল দিয়ে ঢেকে দাও। ফলে তাঁরা তাঁকে কম্বল দিয়ে ঢেকে দিলেন। অবশেষে তাঁর থেকে ভীতি দূর হয়ে গেল। এরপর তিনি বললেন, হে খাদীজাহ! আমার কী হল? এবং তাকে সমস্ত ঘটনা জানালেন। আর বললেনঃ আমি আমার জীবন সম্পর্কে শঙ্কাবোধ করছি। খাদীজাহ (রাঃ) তাকে বললেন, কক্ষনো না। আপনি সুসংবাদ গ্রহণ করুন। আল্লাহর কসম, আল্লাহ্ আপনাকে কখনই লাঞ্ছিত করবেন না। কেননা, আপনি তো আত্মীয়তার বন্ধন জুড়ে রাখেন, সত্যকথা বলেন, অনাথ অক্ষমদের বোঝা বহন করেন, মেহমানদের মেহমানদারী করেন এবং হকের পথে আগত যাবতীয় বিপদে সাহায্য করেন। অতপর খাদীজাহ (রাঃ) তাঁকে নিয়ে চললেন। অতঃপর তাঁকে নিয়ে ওরাকা ইবনু নাওফল ইবনু আসাদ ইবনু ‘আবদুল উযযা ইবনু কুসাই-এর কাছে এলেন। আর তিনি, খাজীদাহ (রাঃ)-এর চাচার পুত্র (চাচাত ভাই) এবং তার পিতার পক্ষ থেকে চাচাও ছিলেন। তিনি জাহিলীয়াতের যুগে খৃষ্ট ধর্ম গ্রহণ করেছিলেন। তিনি আরবী কিতাব লিখতেন। তাই সে ইন্জীল আরবীতে অনুবাদ করতেন- যতখানি লেখা আল্লাহর মনযুর হত। তিনি ছিলেন অতি বৃদ্ধ, দৃষ্টিশক্তিহীন লোক। খাদীজাহ (রাঃ) তাকে বললেন, হে আমার চাচাতো ভাই! তোমার ভাতিজার কথা শুন। তখন ওরাকা বললেন, হে ভাতিজা! তুমি কী দেখেছ? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যা কিছু দেখেছিলেন তা তাকে জানালেন। তখন ওরাকা বললেন, এতো আল্লাহর সেই নামুস (দূত) যাঁকে মূসা (আঃ)-এর কাছে প্রেরণ করা হয়েছিল। হায় আফসোস! যদি সেদিন আমি জীবিত থাকতাম যেদিন তোমার কাওম তোমাকে বের করে দেবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন ঃ তারা কি আমাকে বের করে দেবে? ওরাকা বললেন, হ্যাঁ তুমি যা নিয়ে এসেছ, এমন বস্তু নিয়ে কোনদিনই কেউ আসেনি যার সঙ্গে শত্রুতা করা হয়নি। যদি তোমার জীবনকাল আমাকে পায়, তাহলে আমি সর্বতোভাবে তোমাকে সাহায্য করব। এরপর কিছু দিনের মধ্যেই ওরাকার মৃত্যু হয়। আর কিছু দিনের জন্য ওয়াহীও বন্ধ থাকে। এমনকি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ অবস্থার কারণে অত্যন্ত চিন্তিত হয়ে পড়লেন। এমনকি আমরা এ সম্পর্কে তার থেকে জানতে পেরেছি যে, তিনি পর্বতের চূড়া থেকে নিচে পড়ে যাবার জন্য একাধিকবার দ্রুত সেখানে চলে গেছেন। যখনই নিজেকে ফেলে দেয়ার জন্য পর্বতের চূড়ায় পৌঁছতেন, তখনই জিবরীল (আঃ) তাঁর সামনে আত্মপ্রকাশ করে বলতেন, হে মুহাম্মাদ! নিঃসন্দেহে আপনি আল্লাহর রাসূল। এতে তাঁর অস্থিরতা দূর হত এবং নিজ মনে শান্তিবোধ করতেন। তাই সেখান থেকে ফিরে আসতেন। ওয়াহী বন্ধ অবস্থা যখন তাঁর উপর দীর্ঘ হত তখনই তিনি ঐরূপ উদ্দেশে দ্রুত চলে যেতেন। যখনই তিনি পর্বতের চূড়ায় পৌঁছতেন, তখনই জিবরীল (আঃ) তাঁর সামনে আত্মপ্রকাশ করে আগের মত বলতেন। [৩] ইবনু ‘আব্বাস (রাঃ) বলেন, فَالِقُ الإِصْبَاحِ অর্থ দিনের বেলায় সূর্যের আলো ও রাতের বেলায় চাঁদের আলো। (আধুনিক প্রকাশনী- ৬৪৯৮, ইসলামিক ফাউন্ডেশন- ৬৫১১)",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 1
			}
		}
	]
}