{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7163,
			"arabicnumber": 7163,
			"text": "بَاب مَتَى يَسْتَوْجِبُ الرَّجُلُ الْقَضَاءَ ৯৩/১৬. অধ্যায়: লোক কখন বিচারক হবার যোগ্য হয়। وَقَالَ الْحَسَنُ: أَخَذَ اللهُ عَلَى الْحُكَّامِ أَنْ لاَ يَتَّبِعُوا الْهَوَى وَلاَ يَخْشَوْا النَّاسَ وَلاَ يَشْتَرُوا بِآيَاتِي ثَمَنًا قَلِيلاً ثُمَّ قَرَأَ (يَا دَاوُدُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وَلاَ تَتَّبِعْ الْهَوَى فَيُضِلَّكَ عَنْ سَبِيلِ اللهِ إِنَّ الَّذِينَ يَضِلُّونَ عَنْ سَبِيلِ اللهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ) وَقَرَأَ (إِنَّا أَنْزَلْنَا التَّوْرَاةَ فِيهَا هُدًى وَنُورٌ يَحْكُمُ بِهَا النَّبِيُّونَ الَّذِينَ أَسْلَمُوا لِلَّذِينَ هَادُوا وَالرَّبَّانِيُّونَ وَالأَحْبَارُ بِمَا اسْتُحْفِظُوا اسْتُوْدِعُوا مِنْ كِتَابِ اللهِ اسْتُحْفِظُوا مِنْ كِتَابِ اللهِ وَكَانُوا عَلَيْهِ شُهَدَآءَ فَلاَ تَخْشَوْا النَّاسَ وَاخْشَوْنِ وَلاَ تَشْتَرُوا بِاٰيَاتِي ثَمَنًا قَلِيلاً وَمَنْ لَمْ حْكُمْ بِمَا أَنْزَلَ اللهُ فَأُولَئِكَ هُمْ الْكَافِرُونَ). وَقَرَأَ (وَدَاوُدَ وَسُلَيْمَانَ إِذْ يَحْكُمَانِ فِي الْحَرْثِ إِذْ نَفَشَتْ فِيهِ غَنَمُ الْقَوْمِ وَكُنَّا لِحُكْمِهِمْ شَاهِدِينَ فَفَهَّمْنَاهَا سُلَيْمَانَ وَكُلاًّ اٰتَيْنَا حُكْمًا وَعِلْمًا) فَحَمِدَ سُلَيْمَانَ وَلَمْ يَلُمْ دَاوُدَ وَلَوْلاَ مَا ذَكَرَ اللهُ مِنْ أَمْرِ هَذَيْنِ لَرَأَيْتُ أَنَّ الْقُضَاةَ هَلَكُوا فَإِنَّهُ أَثْنَى عَلَى هَذَا بِعِلْمِهِ وَعَذَرَ هَذَا بِاجْتِهَادِهِ وَقَالَ مُزَاحِمُ بْنُ زُفَرَ قَالَ لَنَا عُمَرُ بْنُ عَبْدِ الْعَزِيزِ خَمْسٌ إِذَا أَخْطَأَ الْقَاضِي مِنْهُنَّ خَصْلَةً كَانَتْ فِيهِ وَصْمَةٌ أَنْ يَكُونَ فَهِمًا حَلِيمًا عَفِيفًا صَلِيبًا عَالِمًا سَئُولاً عَنْ الْعِلْمِ. হাসান (রহ.) বলেন, আল্লাহ্ তা‘আলা বিচারকদের থেকে ওয়াদা নিয়েছেন যে, তারা যেন কখনও খেয়াল খুশির অনুসরণ না করেন, মানুষকে ভয় না করেন এবং অল্প মূল্যের বদলে আল্লাহর আয়াতকে বিক্রয় না করেন। এরপর তিনি পড়লেন- ইরশাদ হলোঃ হে দাঊদ! আমি তোমাকে পৃথিবীতে (আমার) প্রতিনিধি বানালাম, কাজেই তুমি মানুষের মধ্যে ন্যায়পরায়ণতার সঙ্গে শাসন-বিচার পরিচালনা কর, এবং প্রবৃত্তির অনুসরণ করো না। কেননা, তা তোমাকে আল্লাহর পথ হতে বিচ্যুত করে ফেলবে। যারা আল্লাহর পথ থেকে বিচ্যুত হয়, তাদের জন্য আছে কঠিন ‘আযাব, কারণ তারা হিসাব-নিকাশের দিনকে ভুলে গেছে- (সূরাহ সোয়াদ ৩৮/২৬)। তিনি আরো পাঠ করলেন, (আল্লাহর বাণী) : আমি তাওরাত অবতীর্ণ করেছিলাম, তাতে ছিল সঠিক পথের দিশা ও আলো। নবীগণ যারা ছিল মুসলিম এগুলো দ্বারা ইয়াহূদীদেরকে ফায়সালা দিত। দরবেশ ও আলিমরাও (তাই করত) কারণ তাদেরকে আল্লাহর কিতাবের রক্ষক করা হয়েছিল আর তারা ছিল এর সাক্ষী। কাজেই মানুষকে ভয় করো না, আমাকেই ভয় কর, আর আমার আয়াতকে নগণ্য মূল্যে বিক্রয় করো না। আল্লাহ যা নাযিল করেছেন, সে অনুযায়ী যারা বিচার ফায়সালা করে না তারাই কাফির- (সূরাহ আল-মায়িদাহ ৫/৪৪)। এবং আরো পাঠ করলেন (আল্লাহ্ তা‘আলার বাণী) : স্মরণ কর দাঊদ ও সুলায়মানের কথা যখন তারা কৃষিক্ষেত সম্পর্কে বিচার করছিল যখন তাতে রাতের বেলা কোন ব্যক্তির মেষ ঢুকে পড়েছিল, আর আমি তাদের বিচারকার্য প্রত্যক্ষ করছিলাম। আমি সুলায়মানকে এ বিষয়ের (সঠিক) বুঝ দিয়েছিলাম আর (তাদের) প্রত্যেককে আমি দিয়েছিলাম বিচারশক্তি ও জ্ঞান। আমি পর্বত ও পাখীদেরকে দাঊদের অধীন ক’রে দিয়েছিলাম, তারা দাঊদের সাথে আমার মাহাত্ম্য ও পবিত্রতা ঘোষণা করত। (এসব) আমিই করতাম। (সূরাহ আম্বিয়া ২১/৭৮-৭৯) (আল্লাহ্) সুলায়মান (আঃ)-এর প্রশংসা করেছেন, তবে দাঊদ (আঃ)-এর প্রতি তিরস্কার করেননি। যদি আল্লাহ্ তা‘আলা দু’জনের অবস্থাকেই উল্লেখ না করতেন, তাহলে মনে করা হত যে, বিচার করা ধ্বংস হয়ে গেছেন। তিনি তাঁর (সুলায়মানের) ইল্মের প্রশংসা করেছেন এবং (দাঊদকে) তাঁর (ভুল) ইজ্তিহাদের জন্য মাফ করে দিয়েছেন। মুযাহিম ইবনু যুফা (রহ.) বলেন ‘উমার ইবনু ‘আবদুল ‘আযীয (রহ.) আমাদের বলেছেন যে, পাঁচটি গুণ এমন যে, বিচারকের মধ্যে যদি এগুলোর একটিরও অভাব থাকে তাহলে তা তার জন্য দোষ বলে গণ্য হবে। তাকে হতে হবে বুদ্ধিমান, ধৈর্যশীল, পূত-পবিত্র চরিত্রের অধিকারী, দৃঢ়প্রত্যয়ী ও জ্ঞানী, জ্ঞানের অনুসন্ধানকারী। وَكَانَ شُرَيْحٌ الْقَاضِي يَأْخُذُ عَلَى الْقَضَاءِ أَجْرًا وَقَالَتْ عَائِشَةُ يَأْكُلُ الْوَصِيُّ بِقَدْرِ عُمَالَتِهِ وَأَكَلَ أَبُو بَكْرٍ وَعُمَرُ বিচারপতি শুরায়হ্ (রহ.) বিচার কাজের জন্য পারিশ্রমিক নিতেন। ‘আয়িশাহ (রাঃ) বলেন, (ইয়াতীমের) দেখাশুনাকারী সম্পদ থেকে তার পারিশ্রমিকের সমান খেতে পারবেন। আবূ বকর (রাঃ) ও ‘উমার (রাঃ) (সরকারী ভাতা) ভোগ করেছেন। ৭১৬৩. ‘আবদুল্লাহ্ ইবনু সা’দী (রহ.) হতে বর্ণিত। তিনি বর্ণনা করেন যে, ‘উমার (রাঃ)-এর খিলাফাত সময়ে তিনি একবার তাঁর কাছে আসলেন। তখন ‘উমার (রাঃ) তাঁকে বললেন- আমাকে কি এ সর্ম্পকে জানানো হয়নি যে তুমি জনগণের অনেক দায়িত্ব আঞ্জাম দিয়ে থাক। কিন্তু যখন তোমাকে এর পারিশ্রমিক দেয়া হয়, তখন তুমি সেটা নেয়াকে অপছন্দ কর? আমি বললাম, হ্যাঁ। ‘উমার (রাঃ) বললেন, কী কারণে তুমি এরূপ কর। আমি বললাম, আমার অনেক ঘোড়া ও গোলাম আছে এবং আমি ভাল অবস্থায় আছি। কাজেই আমি চাই যে, আমার পারিশ্রমিক সাধারণ মুসলিমদের জন্য সদাকাহ হিসাবে গণ্য হোক। ‘উমার (রাঃ) বললেন, এরকম করো না। কেননা, আমিও তোমার মত এরকম ইচ্ছে পোষণ করতাম। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আমাকে কিছু দিতেন, তখন আমি বলতাম, আমার চেয়ে যার প্রয়োজন বেশি তাকে দিন। এতে একবার তিনি আমাকে কিছু মাল দিলেন। আমি বললাম, আমা হতে এ মালের প্রয়োজন যার অধিক তাকে দিন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা নিয়ে মালদার হও এবং বৃদ্ধি করে তাত্থেকে সদাকাহ কর। আর এ মাল ধনের যা কিছু তোমার নিকট এভাবে আসে, তুমি যার অধিকারী নও বা প্রার্থী নও তা গ্রহণ করো। তা না হলে তার পিছনে নিজেকে নিয়োজিত করো না।[1] [১৪৭৩] (আধুনিক প্রকাশনী- ৬৬৬৪ প্রথমাংশ, ইসলামিক ফাউন্ডেশন- ৬৬৭৭)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 27
			}
		}
	]
}