{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"94": "Wishes"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7230,
			"arabicnumber": 7230,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে ছিলাম এবং আমরা হাজ্জের তালবিয়া পড়লাম। তারপর যিলহাজ্জ মাসের চারদিন অতিক্রান্ত হবার পর আমরা মক্কা্য় এসে পৌঁছলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বাইতুল্লাহ্ তাওয়াফ করতে এবং সাফা ও মারওয়ার সায়ী করতে নির্দেশ দিলেন এবং এটাকে ‘উমরাহয় পরিণত করে ইহরাম খুলে হালাল হওয়ার জন্য বললেন। যাদের সঙ্গে হাদী (কুরবানীর পশু) ছিল তাদের ছাড়া। জাবির (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও ত্বলহা (রাঃ) ব্যতীত আমাদের আর কারো সঙ্গে হাদী ছিল না। এ সময় ‘আলী (রাঃ) ইয়ামান হতে আসলেন। তাঁর সঙ্গে হাদী ছিল। তিনি বললেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেরূপ ইহরাম বেঁধেছেন, আমিও তেমন ইহরাম বেঁধেছি। সাহাবীগণ (রাঃ) বললেন, আমরা মিনার দিকে যাচ্ছি। অথচ আমাদের কারো কারো পুরুষাঙ্গ (স্ত্রী সহবাসের জন্য) উত্তেজিত হচ্ছে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি আমার এ কাজে যদি আগে জানতাম যা আমি পরে জানতে পারলাম, তাহলে আমি হাদী সঙ্গে আনতাম না। আর আমার সঙ্গে যদি হাদী না থাকত তাহলে আমি অবশ্যই হালাল হয়ে যেতাম। রাবী বলেন, এমন সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র সঙ্গে সুরাকা ইবনু মালিক (রাঃ) সাক্ষাত করলেন যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জামরা-ই আকাবাতে কঙ্কর নিক্ষেপ করছিলেন। তখন তিনি বললেন, হে আল্লাহর রাসূল! এটা কি কেবল আমাদের জন্যই? তিনি বললেনঃ না, বরং এটা চিরদিনের জন্য। জাবির (রাঃ) বলেন, ‘আয়িশাহ (রাঃ) ঋতুমতী হয়ে মক্কা্য় পৌঁছেছিলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে নির্দেশ করলেন, হাজ্জের যাবতীয় কার্য যথারীতি আদায় কর, তবে পবিত্র হবার পূর্ব পর্যন্ত বাইতুল্লাহ্ তাওয়াফ করো না এবং সালাত আদায় করো না। তারা যখন বাতহা নামক স্থানে নামলেন, ‘আয়িশাহ (রাঃ) বললেন, হে আল্লাহর রাসূল! আপনারা একটি হাজ্জ ও একটি ‘উমরাহ নিয়ে ফিরলেন। আর আমি কেবল একটি হাজ্জ নিয়ে ফিরছি? জাবির (রাঃ) বলেন, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুর রহমান ইবনু আবূ বকর সিদ্দীক (রাঃ)-কে তাঁকে তানঈমে নিয়ে যাবার হুকুম করলেন। পরে ‘আয়িশাহ (রাঃ) যিলহাজ্জ মাসে হাজ্জের দিনগুলোর পরে একটি ‘উমরাহ আদায় করেন। [১৫৫৭] (আধুনিক প্রকাশনী- ৬৭২৩, ইসলামিক ফাউন্ডেশন- ৬৭৩৬)",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 5
			}
		}
	]
}