{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"95": "Accepting Information Given by a Truthful Person"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7246,
			"arabicnumber": 7246,
			"text": "وَقَوْلِ اللهِ تَعَالَى: (فَلَوْلاَ نَفَرَ مِنْ كُلِّ فِرْقَةٍ مِنْهُمْ طَائِفَةٌ لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ) وَيُسَمَّى الرَّجُلُ طَائِفَةً لِقَوْلِهِ تَعَالَى: (وَإِنْ طَائِفَتَانِ مِنْ الْمُؤْمِنِينَ اقْتَتَلُوا) فَلَوْ اقْتَتَلَ رَجُلاَنِ دَخَلَ فِي مَعْنَى الآ(রাঃ)يَةِ وَقَوْلُهُ تَعَالَى: (إِنْ جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا) وَكَيْفَ بَعَثَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُمَرَاءَهُ وَاحِدًا بَعْدَ وَاحِدٍ فَإِنْ سَهَا أَحَدٌ مِنْهُمْ رُدَّ إِلَى السُّنَّةِ আল্লাহর কথাঃ ‘‘তাদের প্রত্যেক দল থেকে একটি অংশ কেন বের হয় না যাতে তারা দ্বীন সম্পর্কে জ্ঞানের অনুশীলন করতে পারে এবং ফিরে আসার পর তাদের সম্প্রদায়কে সতর্ক করতে পারে যাতে তারা (অসদাচরণ) থেকে বিরত হয়?’’ (সূরাহ আত্-তওবা ৯/১২২) طَائِفَةً শব্দটি এক ব্যক্তিকেও বুঝায়। কেননা, আল্লাহর বাণীঃ ‘‘মু’মিনদের দু’দল লড়াইয়ে জড়িয়ে পড়লে তাদের মধ্যে মীমাংসা করে দাও। অতঃপর একটি দল অপরটির উপর বাড়াবাড়ি করলে যে দলটি বাড়াবাড়ি করে, তার বিরুদ্ধে তোমরা লড়াই কর যতক্ষণ না সে দলটি আল্লাহর নির্দেশের দিকে ফিরে আসে। অতঃপর যদি দলটি ফিরে আসে, তাহলে তাদের মধ্যে ইনসাফের সঙ্গে ফায়সালা কর আর সুবিচার কর; আল্লাহ সুবিচারকারীদেরকে ভালবাসেন’’ (সূরাহ আল-হুজরাত ৪৯/৯)। অতএব যদি দু’ ব্যক্তি দ্বন্ধে লিপ্ত হয় তবে তা এ আয়াতের অর্থের মধ্যে শামিল হবে। আল্লাহর বাণীঃ ‘‘যদি কোন পাপাচারী তোমাদের কাছে কোন বার্তা নিয়ে আসে তোমরা তা পরখ করে দেখবে যাতে অজ্ঞতার কারণে তোমরা কোন সম্প্রদায়কে ক্ষতিগ্রস্ত না কর.....’’ (সূরাহ আল-হুজরাত ৪৯/৬)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিরূপে তাঁর আমীরদেরকে পর্যায়ক্রমে এক এক করে পাঠাতেন- যাতে তাদের কেউ ভুল করলে তাকে সুন্নাতের দিকে ফিরিয়ে আনা হয়। ৭২৪৬. মালিক ইবনু হুওয়ায়রিস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এলাম। আমরা সবাই এক বয়সী যুবক ছিলাম। আমরা বিশ রাত তাঁর কাছে অবস্থান করলাম। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন কোমল হৃদয়ের। তিনি যখন অনুমান করলেন যে আমরা আমাদের স্ত্রী-পরিবারের প্রতি ঝুঁকে পড়েছি, কিংবা আসক্ত হয়ে পড়েছি তখন তিনি জিজ্ঞেস করলেন, আমরা বাড়িতে কাদেরকে রেখে এসেছি। আমরা তাঁকে জানালাম। তিনি বললেনঃ তোমরা তোমাদের পরিবারের কাছে ফিরে যাও এবং তাদের মাঝে অবস্থান কর, আর তাদেরকে (দ্বীন) শিক্ষা দাও। আর তাদের হুকুম কর। তিনি (মালিক) কিছু বিষয় উল্লেখ করেছিলেন, যা আমি মনে রেখেছি বা মনে রাখতে পারিনি। (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন) তোমরা আমাকে যেভাবে সালাত আদায় করতে দেখছ সেভাবে সালাত আদায় কর। যখন সালাতের সময় হাজির হয়, তখন তোমাদের কোন একজন যেন তোমাদের জন্য আযান দেয়, আর তোমাদের মধ্যে যে বড় সে যেন তোমাদের ইমামত করে। [৬২৮] (আধুনিক প্রকাশনী- ৬৭৩৯, ইসলামিক ফাউন্ডেশন- ৬৭৫২)",
			"grades": [],
			"reference": {
				"book": 95,
				"hadith": 1
			}
		}
	]
}