{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7305,
			"arabicnumber": 7305,
			"text": "ইবনু শিহাব (রহ.) হতে বর্ণিত। তিনি বলেন, মালিক ইবনু আওস নাযরী (রহ.) আমাকে এ হাদীসটি বর্ণনা করেছেন। অবশ্য মুহাম্মাদ ইবনু যুবায়র ইবনু মুতঈম এ ব্যাপারে কিছু কথা বলেছিলেন। পরে আমি মালিকের নিকট যাই এবং তাকে এ ব্যাপারে জিজ্ঞেস করি। তখন তিনি বলেন, ‘উমার (রাঃ)-এর সঙ্গে দেখা করার জন্য রওনা হয়ে তাঁর কাছে হাজির হলাম। এমন সময় তাঁর দ্বাররক্ষক ইয়ারফা এসে বলল, ‘উসমান, ‘আবদুর রহমান, যুবায়র এবং সা‘দ (রাঃ) আসতে চাচ্ছেন। আপনার অনুমতি আছে কি? তিনি বললেন, হ্যাঁ। তারপর তাঁরা প্রবেশ করলেন এবং সালাম দিয়ে আসনে বসলেন। দ্বাররক্ষক (আবার) বলল, ‘আলী এবং ‘আব্বাসের ব্যাপারে আপনার অনুমতি আছে কি? তিনি তাদের দু’জনকে অনুমতি দিলেন। ‘আব্বাস (রাঃ) এসে বললেন, হে আমীরুল মু’মিনীন! আমার ও সীমালঙ্ঘনকারীর মাঝে ফায়সালা করে দিন। এবং তারা পরস্পরকে গালমন্দ করলেন। তখন দলটি বললেন ‘উসমান ও তাঁর সঙ্গীরা, হে আমীরুল মু’মিনীন! এ দু’জনের মাঝে ফায়সালা করে দিয়ে একজনকে অন্যজন হতে শান্তি দিন। ‘উমার (রাঃ) বললেন, আপনারা একটু ধৈর্য ধারণ করুন। আমি আপনাদেরকে সেই আল্লাহর কসম দিয়ে জিজ্ঞেস করছি যার হুকুমে আসমান ও যমীন নিজ স্থানে বিদ্যমান, আপনারা কি এ কথা জানেন যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন ঃ আমাদের সম্পদ ওয়ারিশদের মাঝে বণ্টিত হয় না, আমরা যা রেখে যাই তা সদাকাহ হিসাবে গণ্য হয়? এ কথা দ্বারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজেকেই বুঝিয়েছিলেন। দলের সবাই বললেন, হ্যাঁ তিনি এ কথা বলেছিলেন। তারপর ‘উমার (রাঃ) ‘আলী ও ‘আব্বাস (রাঃ)-এর দিকে ফিরে বললেন, আপনাদের দু’জনকে আল্লাহর কসম দিয়ে জিজ্ঞেস করছি, আপনারা কি জানেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কথা বলেছিলেন? তাঁরা দু’জনেই আল্লাহর কসম দিয়ে বললেন, হ্যাঁ। ‘উমার (রাঃ) বললেন, আমি আপনাদেরকে জানিয়ে দিচ্ছি যে, আল্লাহ্ এ সম্পদের একাংশ তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র নির্ধারিত করে দিয়েছিলেন, অপর কারো জন্য দেয়া হয়নি। এ ব্যাপারে আল্লাহ্ বলেনঃ আল্লাহ্ ইয়াহূদীদের নিকট হতে তাঁর রাসূলকে যে ফায় দিয়েছেন তার জন্য তোমরা ঘোড়া কিংবা উটে চড়ে যুদ্ধ করনি...(৫৯ঃ ৬)। কাজেই এ সম্পদ একমাত্র রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র জন্যই নির্দিষ্ট ছিল। তারপর আল্লাহর কসম! তিনি আপনাদেরকে বাদ দিয়ে এককভাবে নিজের জন্য তা সঞ্চিত করে রাখেননি, কিংবা এককভাবে আপনাদেরকেও দিয়ে দেননি। বরং তিনি আপনাদের সকলকেই তাত্থেকে দিয়েছেন এবং সকলের মাঝে বণ্টন করে দিয়েছেন। অবশেষে তাত্থেকে এ পরিমাণ সম্পদ অবশিষ্ট রয়েছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ সম্পদ থেকে তাঁর পরিবারের জন্য তাদের বছরের খরচ দিতেন। এরপর যা অবশিষ্ট থাকত তা আল্লাহর মাল যে পথে ব্যয় হয় সে পথে খরচের জন্য রেখে দিতেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জীবিত অবস্থায় এমন করতেন। আল্লাহর কসম দিয়ে জিজ্ঞেস করছি! আপনারা কি এ ব্যাপারে জ্ঞাত আছেন? সকলেই বললেন, হ্যাঁ। তারপর ‘আলী (রাঃ) ও ‘আব্বাস (রাঃ)-কে লক্ষ্য করে বললেন, আল্লাহর কসম দিয়ে আপনাদের দু’জনকে জিজ্ঞেস করছি! আপনারা কি এ ব্যাপারে জ্ঞাত আছেন? তারা দু’জনেই বললেন, হ্যাঁ। এরপর আল্লাহ্ তা‘আলা তাঁর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মৃত্যু দিলেন। তখন আবূ বকর (রাঃ) বললেন, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্থলাভিষিক্ত। কাজেই তিনি সে সম্পদ অধিগ্রহণ করলেন এবং রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে খাতে এ সম্পদ ব্যয় করতেন তিনিও ঠিক সেভাবেই ব্যয় করতেন। আপনারা তখন ছিলেন। তারপর ‘আলী (রাঃ) ও ‘আব্বাস (রাঃ)এর দিকে ফিরে বললেন, আপনারা দু’জন তখনও মনে করতেন যে আবূ বকর (রাঃ) এ ব্যাপারে এরূপ ছিলেন। আল্লাহ্ জানেন তিনি এ ব্যাপারে সত্যবাদী, ন্যায়পরায়ণ, সত্যনিষ্ঠ ও হক্কের অনুসারী ছিলেন। তারপর আল্লাহ্ আবূ বকর (রাঃ)-কেও মৃত্যু দিলেন। তখন আমি বললাম, এখন আমি আবূ বকর ও রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্থলাভিষিক্ত। সুতরাং দু’বছর আমি তা আমার তত্ত্বাবধানে রাখলাম এবং আবূ বকর (রাঃ) ও রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা যে খাতে খরচ করতেন, আমিও তেমনি করতে লাগলাম। তারপর আপনারা দু’জন আমার কাছে এলেন। আপনাদের দু’জনের একই কথা ছিল, দাবিও ছিল একই। আপনি এসেছিলেন নিজের ভাতিজার থেকে নিজের অংশ আদায় করে নেয়ার দাবি নিয়ে, আর ইনি (‘আলী) এসেছিলেন তাঁর স্ত্রীর পৈতৃক সূত্রে প্রাপ্ত অংশ আদায় করে নেয়ার দাবি নিয়ে। আমি বললাম, যদি আপনারা চান তাহলে আমি আপনাদেরকে তা দিয়ে দিতে পারি, তবে শর্ত এই যে, আপনারা আল্লাহর নামে এই ওয়াদা ও প্রতিশ্রুতিতে আবদ্ধ হবেন যে, এ সম্পদ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবূ বকর (রাঃ) যে ভাবে খরচ করতেন এবং আমি এর দায়িত্ব নেয়ার পর যেভাবে তা খরচ করেছি, আপনারাও তেমনিভাবে ব্যয় করবেন। তখন আপনারা দু’জনে বলেছিলেন, এ শর্তেই আপনি তা আমাদের হাতে দিয়ে দিন। ফলে আমি তা আপনাদের কাছে দিয়ে দিয়েছিলাম। আল্লাহর কসম দিয়ে আপনাদেরকে জিজ্ঞেস করছি! আমি কি সেই শর্তাধীনে এদের কাছে সে সম্পদ দিয়ে দেইনি? সকলেই বলল, হ্যাঁ। তখন তিনি ‘আলী (রাঃ) ও ‘আব্বাস (রাঃ)-এর দিকে তাকিয়ে বললেন, আল্লাহর কসম দিয়ে আপনাদের দু’জনকে জিজ্ঞেস করছি! আমি কি ঐ শর্তাধীনে আপনাদেরকে সে সম্পদ দিয়ে দেইনি? তাঁরা দু’জন বললেন, হ্যাঁ। তখন তিনি বললেন, আপনারা কি আমার নিকট হতে এর ভিন্ন কোন ফয়সালা পেতে চান? সে সত্তার কসম করে বলছি, যাঁর হুকুমে আকাশ ও যমীন নিজ স্থানে বিরাজমান, কিয়ামতের পূর্বে আমি এ বিষয়ে নতুন কোন ফয়সালা করব না। যদি আপনারা এর তত্ত্বাবধানে অক্ষম হন, তা হলেতা আমার নিকট সোপর্দ করুন। আপনাদের দু’জনের বদলে আমি একাই এর তত্ত্বাবধানের জন্য যথেষ্ট। [২৯০৪] (আধুনিক প্রকাশনী- ৬৭৯৫, ইসলামিক ফাউন্ডেশন- ৬৮০৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 36
			}
		}
	]
}