{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7418,
			"arabicnumber": 7418,
			"text": "قَالَ أَبُو الْعَالِيَةِ اسْتَوَى إِلَى السَّمَاءِ ارْتَفَعَ فَسَوَّاهُنَّ خَلَقَهُنَّ وَقَالَ مُجَاهِدٌ اسْتَوَى عَلَى الْعَرْشِ وَقَالَ ابْنُ عَبَّاسٍ الْمَجِيدُ الْكَرِيمُ وَ الْوَدُودُ الْحَبِيبُ يُقَالُ حَمِيدٌ مَجِيدٌ كَأَنَّهُ فَعِيلٌ مِنْ مَاجِدٍ مَحْمُودٌ مِنْ حَمِدَ আবুল ‘আলীয়া (রহ.) বলেন, اسْتَوَى إِلَى السَّمَاءِ -এর অর্থ হচ্ছে আসমানকে উড্ডীন করেছেন- (সূরাহ আল-আ’রাফ ৭/৫৪)। فَسَوَّاهُنَّ-এর অর্থ হচ্ছে, তিনি আসমানরাজিকে সৃষ্টি করেছেন। মুজাহিদ (রহ.) বলেছেন, اسْتَوَى عَلَى الْعَرْشِ -এর অর্থ হল, আরশের উপর সমুন্নত হলেন- (সূরাহ আল-আ’রাফ ৭/৫৪)। ‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাঃ) বলেছেন, مجيدঅর্থ সম্মানিত, الْوَدُودُ অর্থ প্রিয়। বলা হয়ে থাকে, حَمِيدٌ مَجِيدٌ মূলত প্রশংসনীয় ও পবিত্র। বস্তুত এটি مَاجِدٍ থেকে فَعِيلٌ -এর ওযনে এসেছে। আর مَحْمُود (প্রশংসনীয়) এসেছে حَمِدَ থেকে। ৭৪১৮. ‘ইমরান ইবনু হুসায়ন (রাঃ) হতে বর্ণিত। তিনি বলেছেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে ছিলাম। এমন সময় তাঁর কাছে বনূ তামীম-এর গ্রোত্রটি আসল, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে লক্ষ্য করে বললেনঃ হে বনূ তামীম। তোমরা সুসংবাদ গ্রহণ কর। উত্তরে তারা বলল, আপনি আমাদেরকে শুভ সংবাদ যখন দিচ্ছেন, তাহলে কিছু দান করুন। এ সময় ইয়ামানবাসী কতিপয় লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সেখানে উপস্থিত হল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে বললেনঃ হে ইয়ামানবাসী! তোমাদের জন্য সুসংবাদ। বনূ তামীম তা গ্রহণ করল না। তারা বলল, আমরা গ্রহণ করলাম শুভ সংবাদ। যেহেতু আমরা আপনার কাছে এসেছি দ্বীনী জ্ঞান লাভের উদ্দেশ্যে এবং জিজ্ঞেস করার জন্য এসেছি যে, এ দুনিয়া সৃষ্টির আগে কী ছিল? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ্ তখন ছিলেন, তাঁর আগে আর কিছুই ছিল না। তাঁর আরশ তখন পানির ওপর ছিল। অতঃপর তিনি আসমানসমূহ ও যমীন সৃষ্টি করলেন। এবং লাওহে মাফফুযে সব বস্তু সম্পর্কে লিখে রাখলেন। রাবী বলেন, এরপর আমার কাছে এক লোক এসে বলল, হে ‘ইমরান! তোমার উটনী পালিয়ে গিয়েছে, তার খবর লও। আমি উটনীর খোঁজে চললাম। দেখলাম, উটনী মরীচিকার আড়ালে আছে। আমি আল্লাহর কসম করে বলছি! আমার মন চাচ্ছিল উটনী চলে যায় যাক তবুও আমি মজলিস ছেড়ে যেন না উঠি। [৪১৯০] (আধুনিক প্রকাশনী- ৬৯০১, ইসলামিক ফাউন্ডেশন- ৬৯১৩)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 46
			}
		}
	]
}