{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7447,
			"arabicnumber": 7447,
			"text": "আবূ বকরাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ্ আসমান ও যমীনকে যেদিন সৃষ্টি করেছিলেন, সেদিনের অবস্থায় যামানা আবার ফিরে এসেছে। বার মাসে এক বছর হয়। তার মধ্যে চারটি মাস মর্যাদাসম্পন্ন। যুলকাদা, যুলহাজ্জা ও মুহাররম- এ তিন মাস এক নাগাড়ে আসে। আর মুযার গোত্রের রজব মাস যা জুমাদা ও শা’বান মাসের মধ্যে। তিনি জিজ্ঞেস করলেন, এটি কোন্ মাস? আমরা বললাম, আল্লাহ্ ও তাঁর রাসূলই ভালো জানেন। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ থাকলেন যার জন্য আমরা ভেবেছিলাম, তিনি এই নামটি পাল্টিয়ে অন্য কোন নাম রাখবেন। তিনি বললেন, এটি কি যুলহাজ্জা নয়? আমরা উত্তর করলাম, হ্যাঁ, এটি যুলহাজ্জার মাস। তিনি বললেনঃ এটি কোন্ শহর? আমরা বললাম, আল্লাহ্ ও তাঁর রাসূলই অধিক জানেন। তিনি নীরব রইলেনঃ আমরা ভেবেছিলাম, তিনি হয়ত শহরটির নাম বদলিয়ে অন্য কোন নাম রাখবেন। তিনি বললেনঃ এটি কি সেই শহরটি নয়? আমরা উত্তর করলাম, হ্যাঁ। তারপর তিনি আবার জিজ্ঞেস করলেন, আজকের এ দিনটি কোন্ দিন? আমরা উত্তর করলাম, আল্লাহ্ ও তাঁর রাসূলই অধিক জানেন। তিনি চুপ থাকলেন, যার জন্য আমরা ভাবলাম তিনি সম্ভবত এর নামটা বদলে দেবেন। তিনি বললেনঃ এটি কি কুরবানীর দিন নয়? আমরা বললাম, হ্যাঁ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন বললেনঃ তোমাদের রক্ত এবং সম্পদ বর্ণনাকারী মুহাম্মাদ ইবনু সীরীন (রহ.) বলেছেন, আমার ধারণা হচ্ছে, আবূ বকরা (রাঃ) ‘তোমাদের ইয্যত’ কথাটিও বর্ণনা করেছিলেন, অর্থাৎ ওসব এ পবিত্র দিনে, এ পবিত্র শহরে, এ পবিত্র মাসটির মত পবিত্র ও মর্যাদাসম্পন্ন। শীঘ্রই তোমরা তোমাদের রবেবর সাক্ষাত লাভ করবে। তখন তিনি তোমাদেরকে তোমাদের ‘আমল সম্পর্কে জিজ্ঞেস করবেন। সাবধান, আমার মৃত্যুর পর তোমরা পথভ্রষ্ট হয়ে একে অপরকে হত্যা করো না। সাবধান! উপস্থিতগণ অনুপস্থিত লোকদের কাছে (কথাগুলো) পৌঁছে দেবে। কেননা, হয়ত যার কাছে পৌঁছে দেয়া হবে, তাদের মাঝে এমন ব্যক্তিও থাকবে, যারা শ্রবণকারীর চেয়ে অধিক সংরক্ষণকারী হবে। মুহাম্মাদ ইবনু সীরীন (রহ.) যখন এ হাদীসটি বর্ণনা করতেন, তখন বলতেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সত্যিই বলেছিলেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ জেনে রেখো, আমি পৌঁছিয়ে দিয়েছি কি? জেনে রেখো পৌঁছিয়ে দিয়েছি কি? [৬৭] (আধুনিক প্রকাশনী- ৬৯২৯, ইসলামিক ফাউন্ডেশন- ৬৯৩৯)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 73
			}
		}
	]
}