{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7510,
			"arabicnumber": 7510,
			"text": "মা’বাদ ইবন হিলাল আল আনাযী (রহ.) হতে বর্ণিত। তিনি বলেন, আমরা বসরাবাসী কিছু লোক একত্রিত হয়ে আনাস ইবনু মালিক (রাঃ)-এর কাছে গেলাম। আমাদের সঙ্গে সাবিত (রাঃ)-কে নিলাম, যাতে তিনি আমাদের কাছে আনাস (রাঃ) হতে বর্ণিত শাফাআত সম্পর্কিত হাদীস জিজ্ঞেস করেন। আমরা তাঁকে তাঁর মহলেই চাশতের সালাতরত পেলাম। তাঁর কাছে প্রবেশের অনুমতি চাইলে তিনি আমাদেরকে অনুমতি দিলেন। তখন তিনি তাঁর বিছানায় উপবিষ্ট অবস্থায় আছেন। অতঃপর আমরা সাবিত (রাঃ)-কে অনুরোধ করলাম, তিনি যেন শাফাআতের হাদীসটি জিজ্ঞেস করার পূর্বে অন্য কিছু জিজ্ঞেস না করেন। তখন সাবিত (রাঃ) বললেন, হে আবূ হামযাহ! এরা বস্রাবাসী আপনার ভাই, তারা শাফাআতের হাদীস সম্পর্কে জিজ্ঞেস করতে এসেছে। অতঃপর আনাস (রাঃ) বললেন, আমাদের নিকট মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাদীস বর্ণনা করেছেন যে, কিয়ামতের দিন মানুষ সমুদ্রের ঢেউয়ের মত ভীত-সন্ত্রস্ত হয়ে পড়বে। তাই তারা আদম (আঃ)-এর কাছে এসে বলবে, আমাদের জন্য আপনার রবেবর নিকট সুপারিশ করুন। তিনি বলবেনঃ এ কাজের জন্য আমি নই। বরং তোমরা ইব্রাহীম (আঃ)-এর কাছে যাও। কারণ, তিনি হলেন আল্লাহর খলীল। তখন তারা ইব্রাহীম (আঃ)-এর কাছে আসবে। তিনি বলবেনঃ আমি এ কাজের জন্য নই। তবে তোমরা মূসা (আঃ)-এর কাছে যাও। কারণ তিনি আল্লাহর সঙ্গে কথা বলেছেন। তখন তারা মূসা (আঃ)- এর কাছে আসবে। তিনি বলবেনঃ আমি তো এ কাজের জন্য নই। তোমরা ‘ঈসা (আঃ)-এর কাছে যাও। কারণ তিনিই আল্লাহর রূহ ও বাণী। তারা তখন ‘ঈসা (আঃ)-এর কাছে আসবে। তিনি বলবেনঃ আমি তো এ কাজের জন্য নই। তোমরা বরং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে যাও। এরপর তারা আমার কাছে আসবে। আমি বলব, আমিই এ কাজের জন্য। আমি তখন আমার রবেবর নিকট অনুমতি চাইব। আমাকে অনুমতি দেয়া হবে। আমাকে প্রশংসাসূচক বাক্য ইলহাম করা হবে যা দিয়ে আমি আল্লাহর প্রশংসা করব, যেগুলো এখন আমার জানা নেই। আমি সেসব প্রশংসা বাক্য দিয়ে প্রশংসা করব এবং সিজদা্য় পড়ে যাব। তখন আমাকে বলা হবে, ইয়া মুহাম্মাদ! মাথা উঠাও। তুমি বল, তোমার কথা শোনা হবে। চাও, দেয়া হবে। সুপারিশ কর, গ্রহণ করা হবে। তখন আমি বলবো, হে আমার প্রতিপালক! আমার উম্মাত! আমার উম্মাত! বলা হবে, যাও, যাদের হৃদয়ে যবের দানা পরিমাণ ঈমান আছে, তাদেরকে জাহান্নাম থেকে বের করে দাও। আমি গিয়ে এমনই করব। তারপর আমি ফিরে আসব এবং পুনরায় সেসব প্রশংসা বাক্য দ্বারা আল্লাহর প্রশংসা করবো এবং সিজদা্য় পড়ে যাবো। তখন বলা হবে, হে মুহাম্মাদ! মাথা উঠাও। তোমার কথা শোনা হবে। চাও, দেয়া হবে। সুপারিশ কর, গ্রহণ করা হবে। তখনো আমি বলব, হে আমার রবব! আমার উম্মাত! আমার উম্মাত! তখন বলা হবে, যাও, যাদের এক অণু কিংবা সরিষা পরিমাণ ঈমান আছে তাদেরকে জাহান্নাম থেকে বের কর। আমি গিয়ে তাই করব। আমি আবার ফিরে আসব এবং সেসব প্রশংসা বাক্য দিয়ে আল্লাহর প্রশংসা করবো। আর সিজদা্য় পড়ে যাবো। আমাকে বলা হবে, হে মুহাম্মাদ! মাথা উঠাও। বল, তোমার কথা শোনা হবে। চাও, দেয়া হবে। সুপারিশ কর, গ্রহণ করা হবে। আমি তখন বলবো, হে আমার রবব, আমার উম্মাত! আমার উম্মাত! এরপর আল্লাহ্ বলবেন, যাও, যাদের অন্তরে সরিষার দানার চেয়েও অতি ক্ষুদ্র পরিমাণও ঈমান আছে, তাদেরকেও জাহান্নাম থেকে বের করে আন। আমি যাবো এবং তাই করবো। আমরা যখন আনাস (রাঃ)-এর নিকট থেকে বের হয়ে আসছিলাম, তখন আমি আমার সঙ্গীদের কোন একজনকে বললাম, আমরা যদি আবূ খলীফার বাড়িতে নিজেকে গোপনে রাখা হাসান বস্রীর কাছে গিয়ে আনাস ইবনু মালিক (রাঃ)-এর বর্ণিত হাদীসটি তাঁর কাছে বর্ণনা করতাম। এরপর আমরা হাসান বস্রীর কাছে এসে তাঁর কাছে অনুমতি চাওয়ার সালাম দিলাম। তিনি আমাদেরকে প্রবেশের অনুমতি দিলেন। আমরা তাঁকে বললাম, হে আবূ সা‘ঈদ! আমরা আপনারই ভাই আনাস ইবনু মালিক (রাঃ)-এর নিকট হতে আপনার কাছে আসলাম। শাফাআত বিষয়ে তিনি যেমন বর্ণনা দিয়েছেন, তেমন বর্ণনা করতে আমরা আর কাউকে দেখিনি। তিনি বললেন, আমার কাছে সেটি বর্ণনা কর। আমরা তাঁকে হাদীসটি বর্ণনা করে শোনালাম। এরপর আমরা শেষখানে এসে বর্ণনা শেষ করলাম। তিনি বললেন, আরো বর্ণনা কর। আমরা বললাম, তিনি তো এর অধিক আমাদের কাছে বর্ণনা দেননি। তিনি বললেন, জানি না, তিনি কি ভুলেই গেলেন, না তোমরা নির্ভরশীল হয়ে পড়বে বলে বাকীটুকু বর্ণনা করতে অপছন্দ করলেন। বিশ বছর আগে যখন তিনি শক্তি সামর্থ্যে ও স্মরণশক্তিতে দৃঢ় ছিলেন, তখন আমার কাছেও হাদীসটি বর্ণনা করেছিলেন। আমরা বললাম, হে আবূ সা‘ঈদ! আমাদের কাছে হাদীসটি বর্ণনা করুন। তিনি হাসলেন এবং বললেন, মানুষকে সৃষ্টি করা হয়েছে, খুব বেশি সত্বরতা প্রিয় করে। আমি তো বর্ণনার উদ্দেশেই তোমাদের কাছে বিষয়টি উল্লেখ করলাম। তিনি তোমাদের কাছে যা বর্ণনা করেছেন, আমার কাছেও তা বর্ণনা করেছেন, তবে পরে এটুকুও বলেছিলেন, আমি চতুর্থবার ফিরে আসবো এবং সেসব প্রশংসা বাক্য দিয়ে আল্লাহর প্রশংসা করব এবং সিজদায় পড়ে যাবো। তখন বলা হবে, হে মুহাম্মাদ! মাথা উঠাও। বল, তোমার কথা শোনা হবে। চাও, দেয়া হবে। শাফাআত কর, গ্রহণ করা হবে। আমি বলব, হে আমার প্রতিপালক! আমাকে তাদের সম্পর্কে শাফাআত করার অনুমতি দান কর, যারা ‘লা ইলাহা ইল্লাল্লাহ্’ বলেছে। তখন আল্লাহ্ বলবেন, আমার ইয্যত, আমার পরাক্রম, আমার বড়ত্ব ও আমার মহত্ত্বের শপথ! যারা ‘লা ইলাহা ইল্লাল্লাহ্’ বলেছে, আমি অবশ্য অবশ্যই তাদের সবাইকে জাহান্নাম থেকে বের করব। [৪৪] (আধুনিক প্রকাশনী- ৬৯৯১, ইসলামিক ফাউন্ডেশন- ৭০০২)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 135
			}
		}
	]
}