{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7520,
			"arabicnumber": 7520,
			"text": "৯৭/৩৯. অধ্যায়: আদেশ দেয়ার মাধ্যমে আল্লাহ্ কর্তৃক বান্দাকে স্মরণ করা এবং দু‘আ, মিনতি, বার্তা ও বাণী প্রচারের মাধ্যমে বান্দা কর্তৃক আল্লাহকে স্মরণ করা। আল্লাহর বাণীঃ কাজেই তোমরা আমাকে স্মরণ কর, আমিও তোমাদেরকে স্মরণ করব। (সূরাহ আল-বাক্বারাহ ২/১৫২) তাদেরকে নূহের কাহিনী শোনাও। যখন সে তার সম্প্রদায়কে বলেছিল, ‘হে আমার সম্প্রদায়! আমার অবস্থিতি আর আল্লাহর আয়াত দ্বারা তোমাদের প্রতি আমার উপদেশ দান যদি তোমাদের নিকট অসহ্য মনে হয় (তাতে আমার কোন পরোয়া নেই) কারণ আমি ভরসা করি আল্লাহর উপর। তোমরা তোমাদের শরীকদেরকে নিয়ে সম্মিলিতভাবে সিদ্ধান্ত গ্রহণ কর, পরে তোমাদের সিদ্ধান্তের ব্যাপারে তোমাদের মাঝে যেন অস্পষ্টতা না থাকে, অতঃপর আমার উপর তা কার্যকর কর আর আমাকে কোন অবকাশই দিও না। আর যদি তোমরা (আমার আহবান থেকে) মুখ ফিরিয়ে নাও (তাতে আমার কোন ক্ষতি হবে না), আমি তো তোমাদের কাছে কোন পারিশ্রমিক চাচ্ছি না, আমার পারিশ্রমিক আছে কেবল আল্লাহরই নিকট, আমাকে আত্মসমর্পণকারীদের মধ্যে শামিল হওয়ারই আদেশ দেয়া হয়েছে। (সূরাহ ইউনুস ১০/৭১-৭২) এর অর্থ বিপদ, সঙ্কট। মুজাহিদ (রহ.) বলেন,-এর ভাবার্থ হচ্ছে- তোমরা আমার নিকট পেশ কর তোমাদের মনে যা কিছু আছে। আরবীতে বলা হয়, -তুমি স্পষ্ট করে বল, তবে আমি ফায়সালা দেব। মুজাহিদ (রহ.) বলেন, এর ভাবার্থ হচ্ছে, কোন ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে তাঁর অথবা কুরআনের বাণী শুনতে চাইলে সে নিরাপদ স্থানে গিয়ে পৌঁছা পর্যন্ত নিরাপত্তা ও আশ্রয়প্রাপ্ত বলে স্বীকৃত। এর অর্থ আল-কুরআন, এর অর্থ দুনিয়ায় হক (কথা) বলেছে এবং এতে (নেক) ‘আমল করেছে। এ আয়াতের ব্যাখ্যা প্রসঙ্গে ইকরিমাহ (রহ.) বলেন, তাদের অধিকাংশ আল্লাহতে বিশ্বাস করে, কিন্তু তাঁর শরীক করে- (সূরাহ ইউসুফ ১২/১০৬)। যদি তাদেরকে তুমি জিজ্ঞেস কর, আসমানসমূহ ও যমীন সৃষ্টি করেছে কে? তারা বলবে, আল্লাহ্! এটিই তাদের বিশ্বাস। অথচ তারা আল্লাহ্ ব্যতীত অন্যের ‘ইবাদাত করছে। বান্দার কর্ম ও অর্জন সবই সৃষ্টির অন্তর্ভুক্ত। কারণ আল্লাহ্ ইরশাদ করছেন। তিনি সমস্ত কিছু যথার্য পরিমাণে সৃষ্টি করেছেন যথাযথ অনুপাতে- (সূরাহ আল-ফুরক্বান ২৫/২)। মুজাহিদ (রহ.) বলেন, আমি ফেরেশ্তাগণকে পাঠাই না হক ব্যতীত..... (সূরাহ হিজর ১৫/৮)। এখানে ‘হক’ শব্দের অর্থ রিসালাত ও আযাব। সত্যবাদীদের তাদের সত্যবাদিতা সম্বন্ধে জিজ্ঞেস করার জন্য- (সূরাহ আল-আহযাব ৩৩/৮)। এখানে শব্দের অর্থ মানুষের কাছে যেসব রাসূল আল্লাহর বাণী পৌঁছান। এবং আমিই এর সংরক্ষক- (সূরাহ হিজর ১৫/৯)। আমাদের কাছে আছে এর সংরক্ষণকারিগণ। যারা সত্য এনেছে- (সূরাহ আয্ যুমার ৩৯/৩৩)। এখানে এর অর্থ কুরআন, এর অর্থ ঈমানদার। কিয়ামতের দিন ঈমানদার বলবে, আপনি আমাকে যা দিয়েছিলেন, আমি সে মোতাবেক ‘আমল করেছি। ৭৫২০. ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলাম, আল্লাহর কাছে কোন গুনাহটি সবচেয়ে বড়? তিনি বললেনঃ আল্লাহর সঙ্গে শারীক করা। অথচ তিনি তোমাকে সৃষ্টি করেছেন। আমি বললাম, এটি অবশ্যই বড় গুনাহ্। এরপর কোনটি? তিনি বললেনঃ তোমার সন্তান তোমার সঙ্গে খাবে এ ভয়ে তাকে হত্যা করা। আমি বললাম, এরপর কোনটি? তিনি বললেন, এরপর তোমার প্রতিবেশীর স্ত্রীর সঙ্গে যিনা করা। [৪৪৭৭] (আধুনিক প্রকাশনী- ৭০০১, ইসলামিক ফাউন্ডেশন- ৭০১২)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 145
			}
		}
	]
}