{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7533,
			"arabicnumber": 7533,
			"text": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বাণীঃ তাওরাত ওয়ালাদেরকে তাওরাত দেয়া হলে তারা সে মোতাবেক ‘আমল করল। ইঞ্জিল ওয়ালাদেরকে ইঞ্জিল দেয়া হলে তারাও সে মোতাবেক ‘আমল করল। তোমাদেরকে দেয়া হলো কুরআন, সুতরাং তোমরা এ মোতাবেক ‘আমল কর। আবূ রাযীন (রহ.) বলেন -এর অর্থ তাঁর হুকুমকে যথাযথভাবে পালন করার মাধ্যমে অনুসরণ করা। আবূ ‘আবদুল্লাহ্ (রহ.) বলেন, অর্থ। পাঠ করা হয়। অর্থাৎ কুরআন সুন্দরভাবে পাঠ করা।এর অর্থ কুরআনের স্বাদ ও উপকারিতা কুরআনের বিশ্বাসীদের ছাড়া না পাওয়া। কুরআনের উপর সঠিক আস্থা স্থাপনকারী ছাড়া কেউই তা যথাযথভাবে বহন করতে পারবে না। কেননা, আল্লাহ্ বলেনঃ যাদের উপর তাওরাতের দায়িত্বভার দেয়া হয়েছিল, অতঃপর তা তারা বহন করেনি (অর্থাৎ তারা তাদের উপর ন্যস্ত দায়িত্ব পালন করেনি) তাদের দৃষ্টান্ত হল গাধার মত, যে বহু কিতাবের বোঝা বহন করে (কিন্তু তা বুঝে না)। যে সম্প্রদায় আল্লাহর আয়াতগুলোকে অস্বীকার করে, তাদের দৃষ্টান্ত কতইনা নিকৃষ্ট! যালিম সম্প্রদায়কে আল্লাহ সঠিক পথে পরিচালিত করেন না। (সূরাহ আল-জুমু‘আহ ৬২/৫) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইসলাম, ঈমান ও সালাতকে ‘আমল নামে আখ্যায়িত করেছেন। আবূ হুরাইরাহ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিলাল (রাঃ)-কে বললেনঃ ইসলামে থাকা অবস্থায় যেটি দ্বারা তুমি মুক্তির বেশী আশাবাদী, আমাকে তুমি সে ‘আমলটি সম্পর্কে জানাও। বিলাল (রাঃ) বললেন, আমার মতে মুক্তির বেশী আশা রাখতে পারি যে ‘আমলটি দ্বারা, তা হচ্ছে আমি যখনই ওযু করেছি, তখন সালাত আদায় করেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করা হলো- কোন্ ‘আমলটি সবচেয়ে উত্তম? তিনি বললেনঃ আল্লাহ্ ও তাঁর রাসূলের প্রতি ঈমান আনা, এরপর জিহাদ, এরপর কবূল হওয়া হজ্জ। ৭৫৩৩. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পূর্বের উম্মাতদের তুলনায় তোমাদের অবস্থানকালের দৃষ্টান্ত হচ্ছে, ‘আসরের সালাত এবং সূর্যাস্তের মাঝের সময়টুকু। তাওরাতধারীদেরকে তাওরাত দেয়া হলে তারা সে মোতাবেক ‘আমল করল। এ ভাবে দুপুর হয়ে গেল এবং তারাও দুর্বল হয়ে পড়ল। তাদেরকে এক কীরাত করে মজুরী দেয়া হল। তারপর ইঞ্জিল ধারীদেরকে ইঞ্জিল দেয়া হলে তারা সে মোতাবেক ‘আমল করল। এ অবস্থায় ‘আসরের সালাত আদায় করা হল। তারাও ক্লান্ত হয়ে গেল। তারপর তাদেরকেও এক কীরাত করে দেয়া হল। শেষে তোমাদেরকে কুরআন দেয়া হয়। তোমরা সে মোতাবেক ‘আমল করেছ। এ অবস্থায় সূর্য ডুবে গেল। আর তোমাদেরকে দেয়া হল দু’কীরাত করে। ফলে কিতাবীগণ বলল, এরা তো আমাদের তুলনায় কাজ করল কম, অথচ মজুরী পেল বেশী। এতে আল্লাহ্ বললেন, তোমাদের হকের ব্যাপারে তোমাদের প্রতি কোন যুলুম করা হয়েছে কি? এরা বলবে, না। আল্লাহ্ বললেনঃ এটা আমার অনুগ্রহ, তা আমি যাকে চাই তাকে দিয়ে থাকি। [৫৫৭] (আধুনিক প্রকাশনী- ৭০১৪, ইসলামিক ফাউন্ডেশন- ৭০২৫)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 158
			}
		}
	]
}