{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 755,
			"arabicnumber": 755,
			"text": "জাবির ইবনু সামুরাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, কূফাবাসীরা সা‘দ (রাযি.)-এর বিরুদ্ধে ‘উমার (রাযি.)-এর নিকট অভিযোগ করলে তিনি তাঁকে দায়িত্ব হতে অব্যাহতি দেন এবং আম্মার (রাযি.)-কে তাদের শাসনকর্তা নিযুক্ত করেন। কূফার লোকেরা সা‘দ (রাযি.)-এর বিরুদ্ধে অভিযোগ করতে গিয়ে এ-ও বলে যে, তিনি ভালরূপে সালাত আদায় করতে পারেন না। ‘উমার (রাযি.) তাঁকে ডেকে পাঠালেন এবং বললেন, হে আবূ ইসহাক! তারা আপনার বিরুদ্ধে অভিযোগ করেছে যে, আপনি নাকি ভালরূপে সালাত আদায় করতে পারেন না। সা‘দ (রাযি.) বললেন, আল্লাহর শপথ! আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সালাতের অনুরূপই সালাত আদায় করে থাকি। তাতে কোন ত্রুটি করি না। আমি ‘ইশার সালাত আদায় করতে প্রথম দু’ রাক‘আত একটু দীর্ঘ ও শেষের দু’ রাক‘আত সংক্ষেপ করতাম। ‘উমার (রাযি.) বললেন, হে আবূ ইসহাক! আপনার সম্পর্কে আমার এ-ই ধারণা। অতঃপর ‘উমার (রাযি.) কূফার অধিবাসীদের এ সম্পর্কে জিজ্ঞাসাবাদের জন্য এক বা একাধিক ব্যক্তিকে সা‘দ (রাযি.)-এর সঙ্গে কূফায় পাঠান। সে ব্যক্তি প্রতিটি মসজিদে গিয়ে সা‘দ (রাযি.) সম্পর্কে জিজ্ঞেস করলো এবং তাঁরা সকলেই তাঁর ভূয়সী প্রশংসা করলেন। অবশেষে সে ব্যক্তি বনূ আব্স গোত্রের মসজিদে উপস্থিত হয়। এখানে উসামা ইবনু কাতাদাহ্ নামে এক ব্যক্তি যাকে আবূ সা‘দাহ্ বলে ডাকা হত- দাঁড়িয়ে বলল, যেহেতু তুমি আল্লাহর নামের শপথ দিয়ে জিজ্ঞেস করেছ, সা‘দ (রাযি.) কখনো সেনাবাহিনীর সঙ্গে যুদ্ধে যান না, গানীমাতের মাল সমভাবে বণ্টন করেন না এবং বিচারে ইনসাফ করেন না। তখন সা‘দ (রাযি.) বললেন, মনে রেখো, আল্লাহর কসম! আমি তিনটি দু‘আ করছিঃ হে আল্লাহ্! যদি তোমার এ বান্দা মিথ্যাবাদী হয়, লোক দেখানো এবং আত্মপ্রচারের জন্য দাঁড়িয়ে থাকে তাহলে- ১. তার হায়াত বাড়িয়ে দিন, ২. তার অভাব বাড়িয়ে দিন এবং ৩. তাকে ফিতনার সম্মুখীন করুন। পরবর্তীকালে লোকটিকে (তার অবস্থা সম্পর্কে) জিজ্ঞেস করা হলে সে বলতো, আমি বয়সে বৃদ্ধ, ফিতনায় লিপ্ত। সা‘দ (রাযি.)-এর দু‘আ আমার উপর লেগে আছে। বর্ণনাকারী আবদুল মালিক (রহ.) বলেন, পরে আমি সে লোকটিকে দেখেছি, অতি বৃদ্ধ হয়ে যাওয়ার কারণে তার ভ্রু চোখের উপর ঝুলে গেছে এবং সে পথে মেয়েদের বিরক্ত করত এবং তাদের চিমটি দিত। (৭৫৮, ৭৭০; মুসলিম ৪/৩৪, হাঃ ৪০৫) (আধুনিক প্রকাশনীঃ ৭১১, ইসলামিক ফাউন্ডেশনঃ ৭১৯)",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 149
			}
		}
	]
}