{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7555,
			"arabicnumber": 7555,
			"text": "ছবি নির্মাতাদের বলা হবে, তোমরা যা তৈরি করেছ, তাতে জীবন দাও। তোমাদের প্রতিপালক আল্লাহ যিনি ছয় দিনে আকাশমন্ডলী ও পৃথিবী সৃষ্টি করেছেন, অতঃপর আরশে সমুন্নত হয়েছেন। দিনকে তিনি রাতের পর্দা দিয়ে ঢেকে দেন, তারা একে অন্যকে দ্রুতগতিতে অনুসরণ করে এবং সূর্য, চন্দ্র, তারকারাজি তাঁরই আজ্ঞাবহ। জেনে রেখ, সৃষ্টি তাঁর, হুকুমও (চলবে) তাঁর, মহীয়ান, গরীয়ান আল্লাহ বিশ্বজগতের প্রতিপালক। (সূরাহ আল-আ’রাফ ৭/৫৪) ইবনু ‘উয়াইনাহ (রহ.) বলেন, আল্লাহ্ সৃষ্টিকে হুকুম থেকে পৃথক করে বর্ণনা করেছেন। কেননা তার বাণী হলোঃ জেনে রাখ সৃষ্টি ও হুকুম তাঁরই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈমানকেও ‘আমল বলে উল্লেখ করেছেন। আবূ যার (রহ.) ও আবূ হুরাইরাহ (রাঃ) বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করা হল, কোন ‘আমলটি সর্বোত্তম? তিনি বললেনঃ আল্লাহর প্রতি ঈমান আনা, তাঁর পথে জিহাদ করা। মহান আল্লাহ্ বলেনঃ ( এটা তাদের কাজেরই প্রতিদান। ‘আবদুল কায়সের প্রতিনিধি দল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বললেন, আমাদের কিছু সংক্ষিপ্ত বিষয়ের নির্দেশ দিন, যেগুলো মেনে চললে আমরা জান্নাতে প্রবেশ করতে পারব। তিনি তাদের আল্লাহর প্রতি ঈমান আনা, রাসূলের রিসালাতের সাক্ষ্য প্রদান, সালাত কায়িম করা এবং যাকাত আদায়ের হুকুম দিলেন। এ সবকেই তিনি ‘আমলরূপে উল্লেখ করেছেন। ৭৫৫৫. যাহদাম (রহঃ) হতে বর্ণিত। তিনি বলেন, জারমের এ কাওমটির সঙ্গে আশ‘আরী কাওমের গভীর ভালবাসা ও ভ্রাত্বভাব ছিল। এক সময় আমরা আবূ মূসা আশ‘আরী (রাঃ)-এর কাছে ছিলাম। তাঁর কাছে খাদ্য আনা হল। এতে মুরগীর গোশতও ছিল। এ সময় তাঁর নিকট বানী তায়মুল্লাহর এক লোক ছিল। সে (দেখতে) যেন আযাদকৃত গোলাম। তাকেও আবূ মূসা (রাঃ) খেতে ডাকলেন। সে বলল, আমি এ মুরগীকে এমন কিছু জিনিস খেতে দেখেছি, যার ফলে এটি খেতে আমি ঘৃণা করি। এ জন্য শপথ করেছি, আমি তা খাব না। আবূ মূসা (রাঃ) বললেন, তুমি এদিকে এসো, এ ব্যাপারে আমি তোমাকে একটি হাদীস শোনাব। আমি এক সময় আশ’আরী কওমের একটি প্রতিনিধি দলের সাথে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে বাহন চাওয়ার জন্য গেলাম। তিনি বললেন, আল্লাহর শপথ! আমি তোমাদের বাহন দেব না। আর তোমাদের দেয়ার মত আমার কাছে বাহন নেই। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে গনীমতের কিছু উট আনা হলে তিনি আমাদের সম্পর্কে জিজ্ঞেস করলেন এবং বললেন, আশ‘আরীদের দলটি কোথায়? তারপর তিনি পাঁচটি মোটা তাজা ও উৎকৃষ্ট উট আমাদের দেয়ার জন্য হুকুম করলেন। আমরা এগুলো নিয়ে রওনা দেয়ার সময় বললাম, আমরা কী কর্মটি করলাম! নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শপথ করে বললেন, আমাদের বাহন দেবেন না এবং তাঁর কাছে দেয়ার মত বাহন নেই। তারপরও তো তিনি আমাদের বাহন দিয়ে দিলেন। হয়ত আমরা তাঁকে তাঁর শপথ সম্পর্কে বেখেয়াল করে দিয়েছি। আল্লাহর শপথ! আমরা কক্ষনো সফলকাম হবো না। তাই আমরা তাঁর কাছে আবার গেলাম এবং তা তাঁকে বললাম। তিনি বললেনঃ আমি তোমাদেরকে বাহন দেইনি, বরং দিয়েছেন আল্লাহ্। আল্লাহর শপথ! আমি কোন বিষয়ে শপথ করি আর যদি তার বিপরীতে কল্যাণ দেখতে পাই, তবে তাতেই ফিরে আসি এবং (কাফ্ফারা আদায় করে) তা বৈধ করে নেই। [৩১৩৩] (আধুনিক প্রকাশনী- ৭০৩৪, ইসলামিক ফাউন্ডেশন- ৭০৪৫)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 180
			}
		}
	]
}