{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 775,
			"arabicnumber": 775,
			"text": "وَيُذْكَرُ عَنْ عَبْدِ اللهِ بْنِ السَّائِبِ قَرَأَ النَّبِيُّ ﷺ الْمُؤْمِنُونَ فِي الصُّبْحِ حَتَّى إِذَا جَاءَ ذِكْرُ مُوسَى وَهَارُونَ أَوْ ذِكْرُ عِيسَى أَخَذَتْهُ سَعْلَةٌ فَرَكَعَ وَقَرَأَ عُمَرُ فِي الرَّكْعَةِ الْأُولَى بِمِائَةٍ وَعِشْرِينَ آيَةً مِنَ الْبَقَرَةِ وَفِي الثَّانِيَةِ بِسُورَةٍ مِنَ الْمَثَانِي وَقَرَأَ الْأَحْنَفُ بِالْكَهْفِ فِي الْأُولَى وَفِي الثَّانِيَةِ بِيُوسُفَ أَوْ يُونُسَ وَذَكَرَ أَنَّهُ صَلَّى مَعَ عُمَرَالصُّبْحَ بِهِمَا وَقَرَأَ ابْنُ مَسْعُودٍ بِأَرْبَعِينَ آيَةً مِنَ الْأَنْفَالِ وَفِي الثَّانِيَةِ بِسُورَةٍ مِنَ الْمُفَصَّلِ وَقَالَ قَتَادَةُ فِيمَنْ يَقْرَأُ سُورَةً وَاحِدَةً فِي رَكْعَتَيْنِ أَوْ يُرَدِّدُ سُورَةً وَاحِدَةً فِي رَكْعَتَيْنِ كُلٌّ كِتَابُ اللهِ ‘আবদুল্লাহ্ ইবনু সায়িব (রাযি.) হতে বর্ণিত যে, নবী ﷺ ফজরের সালাতে সূরাহ্ মু’মিনূন পড়তে শুরু করেন। যখন মূসা (‘আ.) ও হারূন (‘আ.) বা ‘ঈসা (‘আ.)-এর আলোচনা এল, তাঁর কাশি উঠল আর তখন তিনি রুকূ‘তে চলে গেলেন। ‘উমার (রাযি.) প্রথম রাক‘আতে সূরাহ্ বাক্বারাহর একশ’ বিশ আয়াত তিলাওয়াত করেন এবং দ্বিতীয় রাক‘আতে মাসানী সূরাহহসমূহের কোন একটি তিলাওয়াত করেন। আহনাফ (রহ.) প্রথম রাক‘আতে সূরাহ্ কাহ্ফ তিলাওয়াত করেন এবং দ্বিতীয় রাক‘আতে সূরাহ্ ইউসুফ বা সূরাহ্ ইউনুস তিলাওয়াত করেন এবং তিনি বর্ণনা করেছেন যে, তিনি ‘উমার (রাযি.)-এর পিছনে এ দু’টি সূরাহ্ দিয়ে ফজরের সালাত আদায় করেন। ইবনু মাস‘ঊদ (রাযি.) (প্রথম রাক‘আতে) সূরাহ্ আল-আনফালের চল্লিশ আয়াত পড়েন এবং দ্বিতীয় রাক‘আতে মুফাসসাল সূরাহ্ সমূহের একটি পড়েন। যে ব্যক্তি দু’ রাক‘আতে একই সূরাহ্ ভাগ করে পড়ে বা দু’ রাক‘আতে একই সূরাহ্ দুহরিয়ে পড়ে তার সম্পর্কে কাতাদাহ্ (রহ.) বলেন, সবই আল্লাহর কিতাব। (অর্থাৎ জায়িয)। ৭৭৪. মীম। আনাস (রাযি.) হতে বর্ণিত। কুবার মসজিদে এক আনসারী ব্যক্তি তাঁদের ইমামাত করতেন। তিনি সশব্দে কিরা-আত পড়া হয় এমন কোন সালাতে যখনই কোন সূরাহ্ তিলাওয়াত করতেন, قُلْ هُوَ اللهُ أَحَدٌ সূরাহ্ দ্বারা শুরু করতেন। তা শেষ করে অন্য একটি সূরাহ্ এর সাথে মিলিয়ে পড়তেন। আর প্রতি রাক‘আতেই তিনি এমন করতেন। তাঁর সঙ্গীরা এ ব্যাপারে তাঁর নিকট বললেন যে, আপনি এ সূরাহটি দিয়ে শুরু করেন, এটি যথেষ্ট হয় বলে আপনি মনে করেন না তাই আর একটি সূরাহ্ মিলিয়ে পড়েন। হয় আপনি এটিই পড়বেন, না হয় এটি বাদ দিয়ে অন্যটি পড়বেন। তিনি বললেন, আমি এটি কিছুতেই ছাড়তে পারব না। আমার এভাবে ইমামাত করা যদি আপনারা অপছন্দ করেন, তাহলে আমি আপনাদের ইমামাত ছেড়ে দেব। কিন্তু তাঁরা জানতেন যে, তিনি তাদের মাঝে উত্তম। তিনি ব্যতীত অন্য কেউ তাদের ইমামাত করুক এটা তাঁরা অপছন্দ করতেন। পরে নবী যখন তাঁদের এখানে আগমন করেন, তাঁরা বিষয়টি নবী ﷺ-কে জানান। তিনি বললেন, হে, অমুক! তোমার সঙ্গীগণ যা বলেন তা করতে তোমাকে কিসে বাধা দেয়? আর প্রতি রাক‘আতে এ সূরাহ্টি বাধ্যতামূলক করে নিতে কিসে উদ্বুদ্ধ করছে? তিনি বললেন, আমি এ সূরাহটি ভালবাসি। নবী ﷺ বললেনঃ এ সূরাহর ভালবাসা তোমাকে জান্নাতে প্রবেশ করাবে। (আ.প্র. অনুচ্ছেদ পৃষ্ঠা ৩৩৬, ই.ফা. অনুচ্ছেদ ৪৯৮) ৭৭৫. আবূ ওয়াইল (রহ.) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি ইবনু মাস‘ঊদ (রাযি.)-এর নিকট এসে বলল, গতরাতে আমি মুফাস্‌সাল সূরাহগুলো এক রাক‘আতেই তিলাওয়াত করেছি। তিনি বললেন, তাহলে নিশ্চয়ই কবিতার ন্যায় দ্রুত পড়েছ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পরস্পর সমতূল্য যে সব সূরাহ্ মিলিয়ে পড়তেন, সেগুলো সম্পর্কে আমি জানি। এ বলে তিনি মুফাসসাল সূরাহসমূহের বিশটি সূরাহ্ উল্লেখ পূর্বক বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতি রাক‘আতে এর দু’টি করে সূরাহ্ পড়তেন। (৪৯৯৬, ৫০৪৩; মুসলিম ৬/৪৯ হাঃ ৮২২, আহমাদ ৪৪১০) (আধুনিক প্রকাশনীঃ ৭৩১, ইসলামিক ফাউন্ডেশনঃ ৭৩৯)",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 170
			}
		}
	]
}