{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"2": "Belief"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 8,
			"arabicnumber": 8,
			"text": "ঈমান (বিশ্বাস) ২/১. নবী সল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম-এর বাণীঃ ইসলাম পাঁচটি স্তম্ভের উপর প্রতিষ্ঠিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর বাণীঃ ইসলামের স্তম্ভ হচ্ছে পাঁচটিঃ মুখে স্বীকার এবং কাজে পরিণত করাই হচ্ছে ঈমান এবং তা বৃদ্ধি পায় ও হ্রাস পায়।* আল্লাহ্ তা‘আলা বলেনঃ ‘‘যাতে তারা তাদের ঈমানের সঙ্গে ঈমান মজবুত করে নেয়- (সূরাহ্ ফাত্হ ৪৮/৪)। আমরা তাদের সৎ পথে চলার শক্তি বাড়িয়ে দিয়েছিলাম- (সূরাহ্ কাহাফ ১৮/১৩)। এবং যারা সৎপথে চলে আল্লাহ্ তাদের অধিক হিদায়াত দান করেন- (সূরাহ্ মারইয়াম ১৯/৭৬)। এবং যারা সৎপথ অবলম্বন করে আল্লাহ্ তাদের হিদায়াত বাড়িয়ে দেন এবং তাদের সৎপথে চলার শক্তি বাড়িয়ে দেন- (সূরাহ্ মুহাম্মাদ ৪৭/১৭)। যাতে মু’মিনদের ঈমান বেড়ে যায়- (সূরাহ্ মুদ্দাসসির ৭৪/৩১)। আল্লাহ্ তা‘আলা আরো বলেন, এটা তোমাদের মধ্যে কার ঈমান বাড়িয়ে দিল? যারা মু’মিন এ তো তাদের ঈমান বাড়িয়ে দেয়- (সূরাহ্ আত্-তওবা ৯/১২৪)। এবং তাঁর বাণী, ‘‘সুতরাং তোমরা তাদের ভয় কর; একথা তাদের ঈমানের দৃঢ়তা বাড়িয়ে দিল’’- (সূরাহ্ আলে-ইমরান ৩/১৭৩)। ‘‘এতে তাদের ঈমান ও আনুগত্য আরও বৃদ্ধি পেল’’- (সূরাহ্ আহযাব ৩৩/২২)। আর আল্লাহর জন্য ভালবাসা ও আল্লাহর জন্য ঘৃণা করা ঈমানের অংশ। ‘উমার ইবনু ‘আবদুল ‘আযীয (রহ.) ‘আদী ইবনু ‘আদী (রহ.)-এর নিকট এক পত্রে লিখেছিলেন, ‘ঈমানের কতকগুলো ফার্য (ফরয), কতকগুলো হুকুম-আহকাম, বিধি-নিষেধ এবং সুন্নাত রয়েছে। যে এগুলো পরিপূর্ণরূপে আদায় করে তার ঈমান পূর্ণ হয়। আর যে এগুলো পূর্ণভাবে আদায় করে না, তার ঈমান পূর্ণ হয় না। আমি যদি বেঁচে থাকি তবে অচিরেই এগুলো তোমাদের নিকট ব্যক্ত করব, যাতে তোমরা তার উপর ‘আমল করতে পার। আর যদি আমার মৃত্যু হয় তাহলে জেনে রাখ, তোমাদের সাহচর্যে থাকার জন্য আমি আকাঙ্ক্ষিত নই।’ ইবরাহীম (‘আ.) বলেন, ‘তবে এ তো কেবল চিত্ত প্রশান্তির জন্য’- (সূরাহ্ আল-বাক্বারাহ ২/২৬)। মু‘আয (রাঃ) বলেন, ‘‘এসো আমাদের সঙ্গে বস, কিছুক্ষণ ঈমানের আলোচনা করি।’’ ইবনু মাস‘ঊদ (রাঃ) বলেন, ‘ইয়াকীন হল পূর্ণ ঈমান।’ ইবনু ‘উমার (রাঃ) বলেন, ‘বান্দা প্রকৃত তাকওয়ায় পৌঁছতে পারে না, যতক্ষণ পর্যন্ত সে, মনে যে বিষয় সন্দেহের সৃষ্টি করে, তা পরিত্যাগ না করে।’ মুজাহিদ (রাঃ) এ আয়াতের ব্যাখ্যায় বলেন, ‘‘অর্থাৎ হে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আমি আপনাকে এবং নূহকে একই ধর্মের আদেশ করেছি’’- (সূরাহ্ শূরা ৪২/১৩)। ইবনু ‘আব্বাস (রাঃ) বলেন, ‘‘অর্থাৎ পথ ও পন্থা’’- (সূরাহ্ আল-মায়িদাহ ৫/৪৮)। এ মর্মে আল্লাহ তা‘আলার বাণীঃ ‘‘বলে দিন, আমার প্রতিপালক তোমাদের একটুও পরোয়া করবেন না যদি তোমরা ‘ইবাদাত না কর’’- (সূরাহ্ আল-ফুরক্বান ২৫/৭৭)। অভিধানে দু‘আর অর্থ করা হয়েছেঃ ‘‘ঈমান’’। ৮. ইবন ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, ইসলামের স্তম্ভ হচ্ছে পাঁচটি। ১. আল্লাহ্ ব্যতীত প্রকৃত কোন উপাস্য নেই এবং নিশ্চয়ই মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল-এ কথার সাক্ষ্য প্রদান করা। ২. সালাত কায়িম করা। ৩. যাকাত আদায় করা। ৪. হাজ্জ সম্পাদন করা এবং ৫. রমাযানের সিয়ামব্রত পালন করা। (৪৫১৪; মুসলিম ১/৫ হাঃ ১৬, আহমাদ ৬০২২, ৬৩০৯) (আধুনিক প্রকাশনীঃ ৭, ইসলামিক ফাউন্ডেশনঃ ৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 1
			}
		}
	]
}