{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"12": "Fear Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "وَقَوْلِ اللهِ تَعَالَى وَإِذَا ضَرَبْتُمْ فِي الْأَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَقْصُرُوا مِنْ الصَّلاَةِ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمْ الَّذِينَ كَفَرُوا إِنَّ الْكَافِرِينَ كَانُوا لَكُمْ عَدُوًّا مُبِينًا وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمْ الصَّلاَةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَى لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً وَلاَ جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى أَنْ تَضَعُوا أَسْلِحَتَكُمْ وَخُذُوا حِذْرَكُمْ إِنَّ اللهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا মহিমান্বিত আল্লাহ্ বলেনঃ ‘‘আর যখন তোমরা পৃথিবীতে সফর করবে, তখন তোমাদের কোন গুনাহ হবে না যদি তোমরা সালাত সংক্ষিপ্ত কর, এ আশংকায় যে, কাফিররা তোমাদের জন্য ফিতনা সৃষ্টি করবে। নিশ্চয় কাফিররা হল তোমাদের প্রকাশ্য শত্রু। আর আপনি যখন তাদের মধ্যে থাকেন এবং তাদের সালাত পড়াতে চান, তখন যেন তাদের একদল আপনার সাথে দাঁড়ায় এবং তারা যেন নিজেদের অস্ত্র সাথে রাখে। তারপর যখন তারা সিজদা সম্পন্ন করবে তখন যেন তারা তোমাদের পেছনে অবস্থান নেয়, আর অন্য দল যারা সালাত আদায় করেনি তারা যেন আপনার সাথে সালাত আদায় করে নেয় এবং তারা যেন সতর্ক ও সশস্ত্র থাকে। কাফিররা চায় যেন তোমরা তোমাদের অস্ত্রশস্ত্র ও আসবাবপত্র সম্বন্ধে অসতর্ক হও যাতে তারা একযোগে তোমাদের উপর ঝাঁপিয়ে পড়তে পারে। যদি তোমরা বৃষ্টির কারণে কষ্ট পাও অথবা যদি তোমরা অসুস্থ হও, এ অবস্থায় নিজেদের অস্ত্র পরিত্যাগ করলে তোমাদের কোন গুনাহ নেই। কিন্তু তোমরা সতর্কতা অবলম্বন করবে। আল্লাহ্ কাফিরদের জন্য অবশ্যই লাঞ্ছনাদায়ক শাস্তি প্রস্তুত করে রেখেছেন।’’ (সূরাহ্ আন-নিসা ৪/১০১-১০২) ৯৪২. শু‘আয়ব (রহ.) হতে বর্ণিত। তিনি বলেন, আমি যুহরী (রহ.)-কে জিজ্ঞেস করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি সালাত আদায় করতেন অর্থাৎ খাওফের সালাত? তিনি বললেন, আমাকে সালিম (রহ.) জানিয়েছেন যে, ‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) বলেছেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে নাজ্দ এলাকায় যুদ্ধ করেছিলাম। সেখানে আমরা শত্রুর মুখোমুখী কাতারবন্দী হয়ে দাঁড়ালাম। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে সালাত আদায় করলেন। একদল তাঁর সঙ্গে সালাতে দাঁড়ালেন এবং অন্য একটি দল শত্রুর মুখোমুখী অবস্থান করলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সংগে যাঁরা ছিলেন তাঁদের নিয়ে রুকূ‘ ও দু’টি সিজদা্ করলেন। অতঃপর এ দলটি যারা সালাত আদায় করেনি, তাঁদের স্থানে চলে গেলেন এবং তাঁরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে এগিয়ে এলেন, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁদের সঙ্গে এক রুকূ‘ ও দু’ সিজদা্ করলেন এবং পরে সালাম ফিরালেন। অতঃপর তাদের প্রত্যেকে উঠে দাঁড়ালেন এবং নিজে নিজে একটি রুকূ‘ ও দু’টি সিজদা্ (সহ সালাত) শেষ করলেন। (৯৪৩, ৪১৩২, ৪১৩৩, ৪৫৩৫; মুসলিম ৬/৫৭, হাঃ ৮৩৯) (আধুনিক প্রকাশনীঃ ৮৮৯, ইসলামিক ফাউন্ডেশনঃ ৮৯৫)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		}
	]
}