{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1006,
			"arabicnumber": "449",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Abu Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata, \"Rasulullah tidak membaca di hadapan jin, dan tidak melihat mereka. Hanya dahulu Rasulullah shallallahu 'alaihi wasallam bertolak pergi kepada sejumlah sahabatnya bermaksud ke pasar Ukazh, sedangkan ketika itu antara setan dan kabar langit telah diberi penghalang, dan dikirimlah meteor api kepada mereka. Lalu setan pulang kepada kaum mereka seraya berkata, 'Ada apa dengan kalian? ' Mereka menjawab, 'Kami telah diberi penghalang antara kami dan khabar langit, dan kami dikirimi dengan meteor api.' Mereka berkata, 'Tidaklah hal tersebut terjadi melainkan karena sesuatu yang terjadi, maka lakukanlah perjalanan ke bagian timur bumi dan barat. Lalu lihatlah apa yang menghalangi antara kami dan khabar langit.' Lalu mereka bertolak memukul bagian timur dan barat bumi. Lalu sejumlah jin yang mulai menuju dataran Hijaz berjalan, sedangkan beliau di Nakhlah (tempat antara Makkah dan Thaif) bermaksud ke Ukazh. Ketika itu beliau sedang shalat shubuh mengimami para sahabatnya. Ketika para jin mendengarkan al-Qur'an, maka mereka menyimak kepadanya seraya berkata, 'Inilah yang menghalangi antara kami dan khabar langit.' Lalu mereka kembali kepada kaum mereka seraya mereka berkata, 'Wahai kaum kami, ' kami telah mendengarkan al-Qur'an yang menakjubkan, (QS. 72: 1) (yang) memberi petunjuk kepada jalan yang benar, lalu kami beriman kepadanya. Dan kami sekali-kali tidak akan mempersekutukan seorangpun dengan Rabb kami, (QS. 72: 2) Lalu Allah menurunkan atas nabiNya, Muhammad, 'Katakanlah (hai Muhammad), 'Telah diwahyukan kepadaku bahwa sekumpulan jin telah mendengarkan (al-Qur'an)",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 168
			}
		}
	]
}