{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1058,
			"arabicnumber": "471.02",
			"text": "Dan telah menceritakan kepada kami [Ubaidullah bin Muadz al-Anbari] telah menceritakan kepada kami [Bapakku] telah menceritakan kepada kami [Syu'bah] dari [al-Hakam] dia berkata, \"Seorang laki-laki (Mathar bin Najiyah) telah mengalahkan (penduduk) Kufah yang telah dia sebutkan namanya pada zaman Ibnu al-Asyats. Lalu dia memerintahkan Abu Ubaidullah bin Abdullah untuk shalat mengimami orang-orang. Dia pernah shalat, apabila dia mengangkat kepalanya dari rukuk maka dia berdiri selama waktu yang dibutuhkan olehku untuk membaca, 'AALLOOHUMMA ROBBANAA LAKAL HAMDU MIL\"US SAMAAWAATI WAL ARDHI, WAMIL\"U MAA SYI\"TA MIN SYAI\"IN BA\"DU, AHLATS TSANAA\"I WAL MAJDI, LAA MAANI'A LIMAA A'THOITA WALAA MU'THIYA LIMAA MANA'TA WALAA YANFA'U DZAL JADDI MINKAL JADDI, Ya Allah, Rabb kami, segala puji bagimu sepenuh langit dan bumi serta sepenuh sesuatu yang Engkau kehendaki setelah itu wahai Dzat yang berhak dipuji dan diagungkan. Tidak ada penghalang untuk sesuatu yang Engkau beri, dan tidak ada pemberi untuk sesuatu yang Engkau halangi. Tidaklah bermanfaat harta orang yang kaya dari adzabmu.' Al-Hakam berkata, 'Lalu aku menyebutkan hal tersebut kepada [Abdurrahman bin Abi Laila] seraya dia berkata, aku mendengar [al-Bara' bin Azib] berkata, 'Dahulu shalat Rasulullah Shallallahu'alaihiwasallam, dan rukuknya, dan apabila mengangkat kepalanya dari rukuk, sujudnya serta duduk antara dua sujud hampir memakan waktu yang sama.' Syu'bah berkata, 'Lalu aku menyebutkannya untuk Amru bin Murrah maka dia berkata, 'Aku telah melihat Ibnu Abi Laila, namun shalatnya tidak demikian'.\" Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [al-Hakam] bahwa Mathar bin Najiyah ketika menguasai Kufah maka dia memerintahkan Abu Ubaidah untuk mengimami manusia. Dan dia membawakan hadits tersebut",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 220
			}
		}
	]
}