{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 118,
			"arabicnumber": "18.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] telah menceritakan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dia berkata, \"Orang yang bertemu utusan dari kalangan Abdul Qais yang menghadap Rasulullah shallallahu 'alaihi wasallam menceritakan kepada kami, [Sa'id] berkata, [Qatadah] menyebutkan [Abu Dlamrah] dari [Abu Sa'id al-Khudri] dalam haditsnya ini, bahwa orang-orang dari kalangan Abdul Qais menghadap Rasulullah shallallahu 'alaihi wasallam seraya berkata, 'Wahai Nabi Allah, sesungguhnya kami penduduk desa dari kabilah Rabi'ah, dan sungguh para (kafir) Mudlar telah menghalangi antara kami dan kamu, sehingga kita tidak bisa (selamat) menujumu kecuali pada bulan Haram, maka perintahkanlah kepada kami untuk mengamalkan suatu perintah agar kami dapat mendakwahkannya kepada orang-orang yang ada di belakang kami sehingga dengannya kami masuk surga apabila kami berpegang teguh padanya.' Beliau bersabda: \"Saya memerintahkan kepada kalian dengan empat perkara dan melarang kalian dari empat perkara: Yaitu sembahlah Allah, dan janganlah kamu mensyirikkan-Nya dengan sesuatu apa pun, dirikankan shalat, tunaikanlah zakat, berpuasalah Ramadlan, dan berikanlah seperlima dari harga ghanimah, dan aku melarang kalian membuat perasan arak dalam ad-Duba`, al-Hantam, al-Muzaffat dan an-Naqir.\" Mereka bertanya, 'Wahai Nabi Allah, apa pengetahuanmu tentang an-Naqir? ' Beliau bersabda: \"Batang pohon yang diukir (dilubangi) lalu kamu memasukkan ke dalamnya kurma.\" Sa'id berkata, \"Atau beliau bersabda: \"dari pohon kurma. Kemudian kamu memasukkan air ke dalamnya hingga apabila air didihnya telah tenang, maka kalian meminumnya hingga salah seorang dari kalian -atau salah seorang dari mereka- sungguh akan memukul pamannya dengan pedang', dia berkata, 'Dan pada kaum tersebut terdapat seorang laki-laki yang terkena luka juga.' Dia berkata lagi, 'Aku menyembunyikannya karena malu kepada Rasulullah shallallahu 'alaihi wasallam, lalu aku bertanya, 'Maka pada wadah apa kita boleh minum wahai Rasululah? ' Beliau menjawab, 'Pada wadah kulit (yang sudah disamak) yang sudah ditutup pada mulutnya.' Mereka bertanya, 'Wahai Rasulullah, sesungguhnya tanah kami banyak tikus, sehingga tidak tersisa padanya minuman pada wadah kulit (yang sudah disamak), ' maka Nabi shallallahu 'alaihi wasallam bersabda: \"Dan walaupun dimakan tikus, dan walaupun dimakan tikus, dan walaupun dimakan tikus.\" Perawi berkata, \"Dan Nabi Allah shallallahu 'alaihi wasallam bersabda kepada Asyajj Abdul Qais: 'Sesungguhnya pada dirimu terdapat dua sifat yang disukai Allah, yaitu; sabar dan berhati-hati'.\" Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Ibnu Abu Adi] dari [Sa'id] dari [Qatadah] dia berkata, telah menceritakan kepada kami bukan hanya satu perawi bertemu dengan utusan tersebut. Dan [Abu Nadlrah] menyebutkan dari [Abu Sa'id al-Khudri], bahwa utusan Abdul Qais ketika menghadap Rasulullah shallallahu 'alaihi wasallam dengan semisal hadits [Ibnu Ulayyah], hanya saja di dalamnya disebutkan, \"Dan di dalamnya kalian campurkan dengan kurma, atau kurma dan air, \" dan dia tidak mengatakan, \"[Said] berkata, 'atau berkata, 'dengan kurma",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 26
			}
		}
	]
}