{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1347,
			"arabicnumber": "595.01",
			"text": "Telah menceritakan kepada kami [Ashim bin Nadhr At Tamimi] telah menceritakan kepada kami [Al Mu'tamir] telah menceritakan kepada kami ['Ubaidullah] dia berkata, (Dan diriwayatkan dari jalur lain) telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Ibn 'Ajlan], keduanya dari [Sumay] dari [Ibnu Shalih] dari [Abu Hurairah] -dan ini adalah hadis Qutaibah- Bahwa orang-orang fakir Muhajirin menemui Rasulullah shallallahu 'alaihi wasallam sambil berkata; \"Orang-orang kaya telah memborong derajat-derajat ketinggian dan kenikmatan yang abadi.\" Rasulullah shallallahu 'alaihi wasallam bertanya: \"Maksud kalian?\" Mereka menjawab: \"Orang-orang kaya shalat sebagaimana kami shalat, dan mereka berpuasa sebagaimana kami berpuasa, namun mereka bersedekah dan kami tidak bisa melakukannya, mereka bisa membebaskan tawanan dan kami tidak bisa melakukannya.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah aku ajarkan kepada kalian sesuatu yang karenanya kalian bisa menyusul orang-orang yang mendahului kebaikan kalian, dan kalian bisa mendahului kebaikan orang-orang sesudah kalian, dan tak seorang pun lebih utama daripada kalian selain yang berbuat seperti yang kalian lakukan?\" Mereka menjawab; \"Baiklah wahai Rasulullah?\" Beliau bersabda: \"Kalian bertasbih, bertakbir, dan bertahmid setiap habis shalat sebanyak tiga puluh tiga kali.\" [Abu shalih] berkata; \"Tidak lama kemudian para fuqara' Muhajirin kembali ke Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Ternyata teman-teman kami yang banyak harta telah mendengar yang kami kerjakan, lalu mereka mengerjakan seperti itu!\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah keutamaan Allah yang diberikan kepada siapa saja yang dikehendaki-Nya!\" Dan selain Qutaibah menambahkan dalam hadis ini dari [Al Laits] dari [Ibn 'Ajlan]. [Sumay] mengatakan; \"Lalu aku ceritakan hadits ini kepada beberapa keluargaku, maka keluargaku berkata; \"Engkau salah, yang benar beliau bersabda: \"Engkau bertasbih kepada Allah sebanyak tiga puluh tiga kali, bertahmid kepada Allah sebanyak tiga puluh tiga kali, bertakbir kepada Allah sebanyak tiga puluh tiga kali.\" Aku lalu kembali menemui Abu Shalih dan aku katakan kepadanya, Abu Shalih menarik tanganku dan berkata; \"Allahu akbar, subhanallah, Alhamdulillah, dan Allahu akbar, subhanallah, Alhamdulillah, hingga semuanya berjumlah tiga puluh tiga.\" Kata [Ibn 'Ajlan]; \"Lalu kuceritakan hadis ini kepada [Raja` bin Haiwah], ia menceritakan kepadaku hadits seperti di atas dari [Abu Shalih] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam Dan telah menceritakan kepadaku [Umayyah bin Bustham Al 'Aisyi], telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Rauh] dari [Suhail] dari [Ayahnya] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, bahwa para sahbat berkata; \"Wahai Rasulullah, orang-orang kaya telah memborong derajat tinggi dan kenikmatan yang tiada habis…\" seperti hadis Qutaibah dari Al Laits, hanya ia memudrajkan ucapan Abu Shalih dalam hadis Abu Hurairah.\"Kemudian orang faqir muhajirin kembali, hingga akhir hadis.\" Dalam hadis itu ia tambahkan, Suhail mengatakan; \"Sebelas sebelas, hingga semuanya berjumlah tiga puluh tiga",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 184
			}
		}
	]
}