{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1825,
			"arabicnumber": "781.01",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Salim Abu Nadlr] maula Umar bin Ubaidullah, dari [Busr bin Sa'id] dari [Zaid bin Tsabit] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memasang tenda dari tikar pada sebuah tempat di Masjid, sehingga merupakan sebuah kamar tempat beliau shalat (malam). Melihat hal itu, beberapa orang sahabat mendatangi tempat itu dan mereka shalat pula mengikuti Nabi shallallahu 'alaihi wasallam shalat. Pada suatu malam mereka datang pula, tetapi Rasulullah shallallahu 'alaihi wasallam terlambat, sehingga beliau tidak keluar sama sekali menemui mereka. Oleh karena itu, mereka mengeraskan suara dan melempar pintu dengan kerikil, untuk memberi tahu Nabi shallallahu 'alaihi wasallam, karena mereka menyangka kalau-kalau beliau lupa. Maka dalam keadaan marah Rasulullah shallallahu 'alaihi wasallam keluar menemui mereka sambil bersabda: \"Janganlah kalian berbuat demikian, karena aku mengira bahwa shalat malam itu akan diwajibkan kepada kalian. Karena itu, shalatlah kalian di rumah kalian masing-masing, karena sebaik-baik shalat seseorang adalah yang dilakukan di rumahnya sendiri, kecuali shalat wajib.\" Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Musa bin Uqbah] ia berkata, saya mendengar [Abu An Nadlr] dari [Busr bin Sa'id] dari [Zaid bin Tsabit] bahwa Nabi shallallahu 'alaihi wasallam memasang tenda dari tikar pada sebuah tempat di Masjid, sehingga merupakan sebuah kamar tempat beliau shalat (malam). Melihat hal itu, beberapa orang sahabat mendatangi tempat itu. Maka ia pun menyebutkan hadits yang serupa dengannya. Dan ia menambahkan di dalamnya; \"Jika (shalat malam) itu diwajibkan atas kalian, niscaya kalian tidak akan mampu melakukannya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 253
			}
		}
	]
}