{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"9": "The Book of Prayer - Rain"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2078,
			"arabicnumber": "897.01",
			"text": "Dan Telah meceritakan kepada kami [Yahya bin Yahya] dan [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] -Yahya berkata- telah mengabarkan kepada kami -sementara yang lain berkata- Telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Syarik bin Abu Namir] dari [Anas bin Malik] bahwasanya; Ada seorang laki-laki yang masuk Masjid pada hari Jum'at dari pintu yang menghadap Darul Qadla`, sementara Rasulullah shallallahu 'alaihi wasallam berdiri sedang menyampaikan khutbah. Kemudian laki-laki itu segera menghadap ke arah Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, harta benda telah binasa dan jalan pun telah terputus. Karena itu, berdo'alah kepada Allah agar menurunkan hujan.\" Maka Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya seraya berdo'a: \"ALLAHUMMA AGHITSNAA ALLAHUMMA AGHITSNAA, ALLAHUMMA AGHITSNAA (Ya Allah, turunkanlah hujan kepada kami. Ya Allah, turunkanlah hujan kepada kami, Ya Allah, turunkanlah hujan kepada kami). Anas berkata, \"Tidak, demi Allah, kami tidak melihat mendung maupun gumpalan awan sedikitpun di langit, juga tidak ada di antara kami ataupun di antara celah meski satu rumah maupun tempat tinggal.\" Ia berkata, \"Maka datanglah dari arah belakangnya segumpalan awan yang menyerupai sebuah perisai. Setelah memenuhi langit, awan tersebut menyebar lalu turunlah hujan.\" Ia berkata, \"Tidak, demi Allah kami tidak dapat melihat matahari kala itu.\" Ia berkata, \"Kemudian ada seorang laki-laki yang masuk melalui pintu tersebut pada hari Jum'at selanjutnya, sedangkan Rasulullah shallallahu 'alaihi wasallam sedang berdiri menyampaikan khutbah, maka ia menghampiri beliau dengan berdiri dan mengatakan, \"Wahai Rasulullah, harta benda kami telah lenyap dan jalan-jalan pun sudah buntu, maka berdo'alah kepada Allah supaya Dia menetapkannya bagi kami.\" Ia mengatakan, \"Maka Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya lalu berdo'a, \"Ya Allah! Hujanilah di sekitar kami, jangan kepada kami. Ya, Allah! Berilah hujan ke daratan tinggi, beberapa anak bukit, perut lembah dan beberapa tanah yang menumbuhkan pepohonan.\" Maka kami segera berdiri dan keluar berjalan di bawah sinar matahari.\" Syarik berkata; Lalu aku pun bertanya kepada Anas bin Malik, \"Apakah laki-laki itu adalah laki-laki yang pertama?\" Ia menjawab, \"Saya tidak tahu.\" Dan telah meceritakan kepada kami [Dawud bin Rusyaidin] telah menceritakan kepada kami [Al Walid bin Muslim] dari [Al Auza'i] telah menceritakan kepadaku [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] ia berkata; Orang-orang tertimpa musim paceklik pada masa Rasulullah shallallahu 'alaihi wasallam. Maka ketika Rasulullah shallallahu 'alaihi wasallam sedang menyampaikan khutbah kepada orang banyak di atas mimbar pada hari Jum'at, tiba-tiba berdirilah seorang Arab pegunungan dan berkata, \"Wahai Rasulullah, harta telah binasa dan sanak keluarga kami pun kelaparan.\" Ia pun menuturkan hadits yang semakna dengan hadits di atas. Dan di dalamnya ia menyebutkan do'a: \"ALLAHUMMA HAWAALAINAA WALAA 'ALAINAA (Ya Allah, hujanilah sekitar kami dan jangan kepada kami).\" Dan tidaklah beliau memberi isyarat dengan tangannya, kecuali terlihat (gumpalan awan), hingga aku melihat kota Madinah bagaikan lobang. Dan lembah Qanath mengalirkan airnya selama satu bulan, dan tidaklah seseorang datang dari seberang, kecuali dengan membawa berita terjadinya hujan yang lebat. Dan telah menceritakan kepadaku [Abdul A'la bin Hammad] dan [Muhammad bin Abu Bakar Al Muqaddami] keduanya berkata, telah menceritakan kepada kami [Mu'tamir] telah menceritakan kepada kami [Ubaidullah] dari [Tsabit Al Bunani] dari [Anas bin Malik] ia berkata; Nabi shallallahu 'alaihi wasallam menyampaikan khutbah pada hari Jum'at, kemudian orang-orang datang kepada beliau dengan berteriak seraya berkata, \"Wahai Nabi Allah, hujan tak lagi turun, pepohonan telah memerah dan hewan ternak pun telah binasa.\" Ia pun menuturkan hadits. Dan di dalamnya -dari riwayatnya Abdul A'la- tercantum; \"Kemudian (awan itu pun) menyebar dari Madinah, hingga hujan pun turun membasahi sekelilingnya, sementara di kota Madinah tak turun hujan setetes pun. Sesudah itu, aku melihat Madinah, ternyata kota Madinah saat itu benar-benar seperti mahkota (lantaran hujan telah merata membasahinya).\" Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] dari [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Anas] semisalnya. Dan ia menambahkan; \"Maka Allah menyatukan gumpalan-gumpalan awan itu, lalu kami tinggal di situ sejenak hingga aku melihat laki-laki itu tak sanggup lagi menahan keinginannya untuk segera mendatangi keluarganya.\" Dan Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] Telah menceritakan kepada kami [Ibnu Wahab] telah menceritakan kepadaku [Usamah] bahwa [Hafsh bin Ubaidullah bin Anas bin Malik] telah menceritakan kepadanya, bahwa ia mendengar [Anas bin Malik] berkata; \"Ada seorang A'rabi (Arab pegunungan) datang kepada Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at saat beliau berada di atas mimbar.\" Ia pun menuturkan hadits itu, dan ia menambahkan; \"Maka aku pun melihat awan yang saling memisah bagaikan air saat dituangkan",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		}
	]
}