{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2098,
			"arabicnumber": "903.01",
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Yahya] dari [Amrah] bahwa seorang wanita Yahudi mendatangi [Aisyah] seraya berkata, \"Semoga Allah melindungimu dari siksa kubur.\" Aisyah berkata; Maka saya pun bertanya, \"Wahai Rasulullah, apakah Allah akan menyiksa manusia di alam kubur?\" Amrah berkata; Aisyah berkata; Rasulullah shallallahu 'alaihi wasallam menjawab: \"Mintalah perlindungan kepada Allah.\" Kemudian Rasulullah shallallahu 'alaihi wasallam pergi dengan berkendaraan di siang hari, tiba-tiba terjadilah gerhana matahari. Aisyah berkata; Maka saya pun keluar melewati pintu rumah yang berada di dalam masjid bersama beberapa orang wanita. Kemudian datanglah Rasulullah shallallahu 'alaihi wasallam dari kendaraannya, beliau berjalan hingga sampai di Mushalla (tanah lapang) tempat beliau shalat. Lalu beliau berdiri (shalat) dan kaum muslimin pun ikut berdiri (shalat) di belakangnya. Aisyah berkata; Beliau berdiri lama sekali, kemudian beliau ruku' dengan ruku' yang lama sekali, setelah itu beliau bangkit dan berdiri lama sekali, namun tidak seperti berdirinya yang pertama. Kemudian beliau ruku' dengan sangat lama, namun tidak selama ruku'nya yang pertama, lalu beliau bangkit sementara matahari telah bersinar kembali. Akhirnya beliau bersabda: \"Sungguh, saya telah melihat bahwa kalian akan diuji di alam kubur nanti sebagaimana fitnah Dajjal.\" Amrah berkat; Saya mendengar Aisyah berkata, \"Setelah itu, saya mendengar Rasulullah shallallahu 'alaihi wasallam meminta perlindungan dari adzab neraka dan adzab kubur.\" Dan telah menceritakannya kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul Wahhab] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] semuanya dari [Yahya bin Sa'id] dengan isnad ini, dan sesuai dengan makna haditsnya Sulaiman bin Bilal",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 9
			}
		}
	]
}