{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2130,
			"arabicnumber": "920.01",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Mua'wiyah bin Amru] telah menceritakan kepada kami [Abu Ishaq Al Fazari] dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Qabishah bin Dzu`aib] dari [Ummu Salamah] ia berkata; Ketika Abu Salamah meninggal, Rasulullah shallallahu 'alaihi wasallam datang ke rumah kami untuk menjenguk jenazahnya. Saat itu, mata Abu Salamah tengah terbeliak, maka beliau pun menutupnya. Kemudian beliau bersabda: \"Apabila ruh telah dicabut, maka penglihatan akan mengikutinya dan keluarganya pun meratap hiteris. Dan janganlah sekali-kali mendo'akan atas diri kalian kecuali kebaikan, sebab ketika itu malaikat akan mengaminkan apa yang kalian ucapkan.\" Setelah itu, beliau berdo'a: \"ALLAHUMMAGHFIR LIABI SALAMAH WARFA' DARAJATAHU FIL MAHDIYYIIN WAKHLUFHU FI 'AQIBIHI FIL GHAABIRIIN, WAGHFIR LANAA WALAHU YAA RABBAL 'ALAMIIN, WAFSAH LAHU FII QABRIHI WA NAWWIR LAHU FIIHI (Ya Allah, ampunilah Abu Salamah, tinggikan derajatnya di kalangan orang-orang yang terpimpin dengan petunjuk-Mu dan gantilah ia bagi keluarganya yang ditinggalkannya. Ampunilah kami dan ampunilah dia. Wahai Rabb semesta alam. Lapangkanlah kuburnya dan terangilah dia di dalam kuburnya).\" Dan telah menceritakan kepada kami [Muhammad bin Musa Al Qaththan Al Wasithi] telah menceritakan kepada kami [Al Mutsanna bin Mu'adz] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Ubaidullah bin Al Hasan] telah menceritakan kepada kami [Khalid Al Hadzdza`] dengan Isnad ini dan serupa dengannya. Hanya saja, ia mengatakan; \"Dan gantikanlah ia bagi keluarganya.\" Ia juga mengatakan; \"Ya Allah, lapangkanlah kuburannya.\" Dan ia tidak mengatakan; \"IFSAH LAHU (lapangkanlah baginya).\" Dan ia menambahkan lagi; Khalid Al Hadzdza` berkata; \"Dan do'a lain yang ketujuh saya lupa",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		}
	]
}