{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2200,
			"arabicnumber": "949.01",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Ayyub] dan [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ali bin Hujr As Sa'di] semuanya dari [Ibnu Ulayyah] -sedangkan lafazhnya milik Yahya- telah mengabarkan kepada kami [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] ia berkata; Suatu ketika iringan jenazah lewat di hadapan Rasulullah shallallahu 'alaihi wasallam, mayit itu dipuji dengan kebaikan, maka beliau pun bersabda: \"Telah wajib baginya, telah wajib baginya, telah wajib baginya.\" Kemudian lewatlah iringan jenazah lain di hadapan beliau, namun mayat itu dicaci dengan keburukan, maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Telah wajib baginya, telah wajib baginya, telah wajib baginya.\" Maka Umar berkata, \"Ibu dan ayahku menjadi tebusan bagimu, telah lewat iringan jenazah lalu mayit itu dipuji dengan kebaikan kemudian Anda mengatakan: 'Telah wajib baginya, telah wajib baginya, telah wajib baginya.' Setelah itu, lewatlah jenazah lain, dan mayit itu dicaci dengan keburukan lalu Anda pun mengatakan: 'Telah wajib baginya, telah wajib baginya, telah wajib baginya.'\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Siapa yang telah kalian puji dengan kebaikan, maka telah wajib baginya surga. Dan siapa yang telah kalian cela dengan keburukan, maka telah wajib pula baginya neraka. Kalian adalah Syuhada`ullahi (para saksi Allah) di muka bumi, kalian adalah Syuhada`ullahi (para saksi Allah) di muka bumi.\" Dan telah menceritakan kepadaku [Abu Rabi' Az Zahrani] telah menceritakan kepada kami [Hammad] yakni Ibnu Zaid -dalam jalur lain- Dan telah menceritakan kepadaku [Yahya bin Yahya] telah mengabarkan kepada kami [Ja'far bin Sulaiman] keduanya dari [Tsabit] dari [Anas] ia berkata; Suatu ketika iringan jenazah lewat di hadapan Rasulullah shallallahu 'alaihi wasallam. Ia pun menyebutkan makna hadits Abdul Aziz, dari Anas. Hanya saja haditsnya Abdul Aziz lebih sempurna",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 78
			}
		}
	]
}