{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2256,
			"arabicnumber": "974.02",
			"text": "Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepada kami [Ibnu Juraij] dari [Abdullah bin Katsir bin Muthallib] bahwa ia mendengar [Muhammad bin Qais] berkata, saya mendengar [Aisyah] menceritakan, ia berkata; \"Maukah kalian aku ceritakan sebuah hadits dari Rasulullah shallallahu 'alaihi wasallam dan juga dariku?\" Kami menjawab, \"Ya.\" -dalam jalur lain- Dan telah menceritakan kepadaku [seorang] yang mendengar Hajjaj Al A'war, dan lafazh juga miliknya, ia berkata, telah menceritakan kepada kami [Hajjaj bin Muhammad] Telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abdullah] -seorang laki-laki dari Qurais- dari [Muhammad bin Qais bin Makhramah bin Al Muthallib] bahwa pada suatu hari ia berkata, \"Maukah kalian aku ceritakan (hadits) dariku dan dari ibuku?\" -maka kami pun menyangka bahwa yang ia maksud dengan ibunya adalah Ibu yang telah melahirkannya- Ia berkata; [Aisyah] berkata, \"Maukah kalian aku ceritakan hadits dariku dan dari Rasulullah shallallahu 'alaihi wasallam?\" kami menjawab, \"Ya, mau.\" Aisyah berkata; Pada suatu malam ketika giliran Rasulullah shallallahu 'alaihi wasallam di rumahku, setelah beliau menanggalkan pakaiannya, meletakkan terompahnya dekat kaki dan membentangkan pinggir jubahnya di atas kasur, beliau lantas berbaring. Setelah beberapa lama kemudian dan barangkali beliau menyangkaku telah tidur, beliau mengambil baju dan terompahnya, dibukanya pintu perlahan-lahan dan kemudian ditutupnya kembali perlahan-lahan. Menyaksikan beliau seperti itu, kukenakan pula bajuku dan kututup kepalaku dengan kain, kemudian aku mengikuti beliau dari belakang hingga sampai di Baqi'. Ketika sampai di sana beliau berdiri agak lama, kemudian beliau mengangkat kedua tangannya tiga kali, sesudah itu beliau berbalik pulang. Aku pun berbalik pula mendahului beliau. Kalau beliau berjalan cepat, maka aku pun berjalan cepat-cepat. Bila beliau berlari kecil, aku pun demikian. Ketika beliau sampai, aku pun sudah sampai lebih dulu dari beliau. Kemudian aku masuk ke dalam rumah dan langsung tidur. Setelah itu, beliau masuk dan bertanya: \"Kenapa kamu wahai Aisyah? Kudengar nafasmu kembang kempis.?\" Jawabku, \"Tidak ada apa-apa wahai Rasulullah?\" Beliau berkata: \"Ceritakanlah kepadaku atau kalau tidak Allah -Yang MahaLembut dan Mengetahui- akan menceritakannya padaku.\" Aku menjawab, \"Wahai Rasulullah, demi bapak dan ibuku.\" Lalu kuceritakanlah kepada beliau apa yang sebenarnya terjadi. Beliau berkata, \"Kalau begitu, kamulah kiranya bayangan hitam yang saya lihat di depanku tadi?\" Saya menjawab, \"Ya, benar wahai Rasulullah.\" Maka beliau pun mendorong dadaku dengan keras hingga terasa sakit bagiku. Kemudian beliau berkata, \"Apakah kamu masih curiga, Allah dan Rasul-Nya akan berbuat curang kepadamu?\" jawabku, \"Setiap apa yang dirahasiakan manusia, pasti Allah mengetahuinya pula.\" Kemudian Rasulullah shallallahu 'alaihi wasallam menceritakan kenapa beliau sampai keluar. Beliau bercerita: \"Tadi Jibril datang, tapi karena ia melihat ada kamu, dia memanggilku perlahan-lahan sehingga tidak terdengar olehmu. Aku menjawab panggilannya tanpa terdengar pula olehmu. Dia tidak masuk ke rumah, karena kamu menanggalkan pakaianmu. Dan aku pun mengira bahwa kamu telah tidur, karena itu aku segan membangunkanmu khawatir engkau akan merasa kesepian. Jibril berkata padaku, 'Allah memerintahkan agar Tuan datang ke Baqi' dan memohonkan ampunan bagi para penghuninya.' Aku berkata, 'Lalu apa yang kubaca sesampai di sana wahai rasulullah? ' Jibril menjawab, 'Bacalah: AS SALAAMU 'ALA AHLID DIYAAR MINAL MUKMINIIN WAL MUSLIMIIN WA YARHAMULLAHUL MUSTAQDIMIIN MINNAA WAL MUSTA`KHIRIIN WA INNAA INSYAA`ALLAHU BIKUM LAAHIQUUN (Semoga keselamatan tercurah bagi penduduk kampung orang-orang mukmin dan muslim ini. Dan semoga Allah memberi rahmat kepada orang-orang yang telah mendahului kami dan orang-orang kemudian, dan kami insya Allah akan menyusul kalian semua)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		}
	]
}