{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2290,
			"arabicnumber": "987.01",
			"text": "Dan telah menceritakan kepadaku [Suwaid bin Sa'id] Telah menceritakan kepada kami [Hafsh yaitu putra Maisarah Ash Shan'ani] dari [Zaid bin Aslam] bahwa [Abu Shalih Dzakwan] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mempunyai emas dan perak, tetapi dia tidak membayar zakatnya, maka di hari kiamat akan dibuatkan untuknya seterika api yang dinyalakan di dalam neraka, lalu diseterikakan ke perut, dahi dan punggungnya. Setiap seterika itu dingin, maka akan dipanaskan kembali lalu diseterikakan pula padanya setiap hari -sehari setara lima puluh tahun (di dunia) - hingga perkaranya diputuskan. Setelah itu, barulah ia melihat jalannya keluar, adakalanya ke surga dan adakalanya ke neraka.\" Kemudian ditanyakan kepada beliau, \"Wahai Rasulullah, lantas bagaimana dengan unta?\" beliau menjawab: \"Begitu pula unta, jika pemiliknya tidak membayarkan zakatnya. Diantara zakatnya adalah membayar shadaqah dengan susu yang diperah darinya pada hari ketika ia mendatangi air untuk meminumnya. Maka pada hari kiamat kelak, orang itu akan ditelentangkan di tempat yang rata agar diinjak-injak oleh unta-unta yang paling besar dan gemuk-gemuk, serta anak-anaknya yang paling kecil. Semuanya menginjak-injak dengan kukunya serta menggigit dengan giginya yang tajam. Setiap yang pertama lewat, datang pula yang lain menginjak-injaknya. Demikianlah hal itu berlangsung setiap hari hingga perkaranya selesai diadili. Satu hari di sana sama dengan lima puluh ribu tahun di dunia. Setelah itu, barulah ia dapat melihat jalannya keluar, mungkin ke surga dan mungkin pula ke neraka.\" Kemudian ditanyakan kembali pada beliau, \"Wahai Rasulullah, lantas bagaimana dengan sapi dan kambing?\" Beliau menjawab: \"Ya, tidak ketinggalan pula pemilik sapi dan kambing yang tidak membayar zakatnya. Niscaya pada hari kiamat kelak, dia akan ditelentangkan di suatu tempat yang rata, supaya diinjak-injak oleh sapi dan kambing itu dengan kukunya yang tajam dan juga menanduknya dengan tanduk-tanduknya, baik kambing tersebut bengkok tanduknya atau tidak bertanduk ataupun pecah tanduknya. Bila yang pertama telah lewat, maka akan diikuti pula oleh yang kedua dan seterusnya, hingga perkaranya selesai diputuskan. Satu hari di dunia sama dengan lima puluh ribu tahun di dunia. Setelah itu, ia baru bisa melihat jalannya keluar, apakah dia ke surga ataukah ke neraka.\" Kemudian ditanyakan lagi kepada beliau, \"Jika kuda bagaimana ya Rasulullah?\" beliau menjawab: \"Kuda itu ada tiga macam, yaitu; (Pertama), yang bisa mendatangkan dosa, (kedua) sebagai penghalang dan (ketiga) yang bisa mendatangkan pahala. Sedangkan kuda yang mendatangkan dosa adalah apabila orang memeliharanya karena riya`, untuk kemegahan dan kebanggaan serta untuk memerangi Islam. Maka kuda bagi orang itu menjadi sumber dosa. (Kedua), kuda sebagai penghalang, yaitu kuda yang dipersiapkan untuk jihad di jalan Allah, kemudian pemiliknya tidak lupa akan hak Allah dengan cara memeliharanya dan mempergunakannya untuk berjihad, maka kuda bagi orang itu adalah sebagai pelindung baginya. (Ketiga), kuda sebagai ladang pahala. Yaitu kuda yang dipersiapkan untuk berjihad di jalan Allah dan membela kepentingan umat Islam di ladang-ladang penggembalaan mereka. Maka apa-apa yang dimakan kuda itu di ladang tersebut, dituliskan bagi pemilik kebun kebajikan sebanyak apa yang dimakan kuda tersebut dan dituliskan pula kebajikan sebanyak kotoran dan air kencing yang dikeluarkan kuda tersebut. Bila tali kuda itu terputus, kemudian kuda itu lari jauh, maka dituliskan untuk pemiliknya kebajikan sebanyak jejak dan tahi kuda itu. Setiap kuda itu melewati sungai, lalu ia minum tanpa sengaja atau diberi minum oleh pemiliknya, maka Allah akan menuliskan kebajikan bagi pemiliknya sebanyak air yang diminum kudanya itu.\" Setelah itu, ditanyakan lagi kepada beliau, \"Bagaimana kalau himar (keledai) wahai Rasulullah?\" Beliau menjawab: \"Allah tiada menurunkan wahyu apa-apa kepadaku mengenai himar, selain ayat yang pendek tetapi mencakup yaitu, 'Barangsiapa yang mengerjakan kebajikan sebesar zarrah (biji sawi), niscaya ia akan melihat (pahala) nya. Dan barangsiapa yang mengerjakan keburukan seberat zarrah, niscaya ia akan melihat pula balasannya.'\" Dan telah menceritakan kepadaku [Yunus bin Abdul A'la Ash Shadafi] telah mengabarkan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Hisyam bin Sa'd] dari [Zaid bin Aslam] dalam isnad ini, dan semakna dengan hadits Hafsh bin Maisarah hingga akhirnya. Hanya saja ia mengatakan; \"Siapa pun pemilik Unta yang tidak membayar haknya (zakatnya).\" Dia tidak mengatakan; \"Minhaa haqqihaa\" (dari haknya).\" Dan ia menyebutkan didalamnya: \"laa yafqidu minhaa fashiilan waahidan\", ia berkata: \"yukwa bihaa janbahu wa jabhatuhu wa dhahruhu\" (lalu diseterikakan ke perut, dahi dan punggungnya)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		}
	]
}