{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2292,
			"arabicnumber": "987.03",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Abdul Malik Al Umawi] Telah menceritakan kepada kami [Abdul Aziz bin Al Mukhtar] Telah menceritakan kepada kami [Suhail bin Abu Shalih] dari [bapaknya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang pemilik harta benda yang tidak membayar zakatnya, melainkan pada hari kiamat akan dibuatkan untuknya seterika api yang dipanaskan di neraka Jahannam, kemudian disetrikakan pada lambungnya, dahinya dan punggungya. Hingga Allah memutuskan diantara hamba-hambaNya di suatu hari yang lamanya sama dengan lima puluh ribu tahun dibanding hari di dunia. Kemudian barulah dilihatkan jalannya ke surga atau ke neraka. Dan tidak ada seorang pemilik unta pun yang enggan mengeluarkan haknya (zakat dari untanya) melainkan (pada hari kiamat kelak) ia dilentangkan di suatu tempat yang datar, lalu ia diinjak dan digigit oleh unta-unta itu. Setiap kali unta yang terakhir telah melaluinya, maka unta yang pertama kembali melaluinya. Demikianlah hingga Allah memutuskan perkara di antara para manusia pada suatu hari, dimana waktu itu sama dengan lima puluh ribu tahun (di dunia), dan baru ia akan melihat jalannya, apakah ke surga ataukah ke neraka. Dan tidak seorang pemilik kambing yang tidak menunaikan zakatnya melainkan pada hari kiamat ia akan dilentangkan pada tempat yang datar, lalu kambing-kambing itu menginjaknya dengan kukunya dan menanduknya dengan tanduk-tanduknya. Di antara kambing itu tidak ada yang bengkok tanduknya dan tidak ada pula yang tidak bertanduk. Setiap kali kambing yang terakhir telah melaluinya, maka kambing yang pertama kembali melaluinya. Demikianlah hingga Allah memutuskan perkara di antara para manusia pada suatu hari, dimana waktu itu sama dengan lima puluh ribu tahun (di dunia), dan baru ia akan melihat jalannya, apakah ke surga ataukah ke neraka.\" Suhail berkata; \"Aku tidak tahu, apakah beliau menyebutkan sapi atau tidak.\" Kemudian para sahabat bertanya, \"Bagaimana dengan kuda, ya Rasulullah?\" beliau bersabda: \"Pada ubun-ubun kuda itu, padanya terikat kebaikan hingga hari kiamat. Kuda itu tiga macam; yaitu kuda yang pemiliknya akan mendapatkan pahala, kuda yang menjadi perisai, dan kuda yang pemiliknya mendapatkan dosa. Adapun kuda yang pemiliknya mendapat pahala adalah kuda yang dipersiapkan untuk membela agama Allah, dan untuk berjihad di jalan Allah. Maka apa-apa yang dimakan kuda itu dituliskan bagi pemiliknya kebajikan sebanyak apa yang dimakan kuda tersebut. Jika ia menggembalakannya di padang gembalaan maka akan ditulis bagi pemiliknya kebajikan sebanyak yang dimakannya. Bila kuda tersebut diberi air minum dari sungai maka akan dituliskan kebajikan bagi pemiliknya sebanyak air yang diminumnya. Bila tali kuda itu terputus, kemudian kuda itu lari ke tempat yang tinggi maka dituliskan untuk pemiliknya kebajikan sebanyak jejak yang dilalui kuda itu. Sedangkan kuda yang menjadi perisai bagi pemiliknya adalah orang yang memelihara kuda untuk kemuliaan dan perhiasan dengan tidak melupakan hak Allah, yaitu dijadikan sebagai tunggangan dan diperhatikan pula makanannya, baik di masa mudah atau sulit. Sedangkan kuda yang pemiliknya akan mendapat dosa ialah apabila orang memeliharanya untuk menyombongkan diri dan karena riya`, maka kuda bagi orang itu menjadi sumber dosa.\" Para sahabat bertanya lagi, \"Bagaimana dengan keledai wahai Rasulullah?\" Beliau bersabda: \"Tidak ada sesuatu yang diturunkan oleh Allah tentang himar kecuali ayat ini yang pendek namun menyeluruh; 'Barangsiapa yang mengerjakan kebajikan sebesar zarrah (biji sawi), niscaya ia akan melihat (pahala) nya. Dan barangsiapa yang mengerjakan keburukan seberat zarrah, niscaya ia akan melihat pula balasannya.'\" Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Abdul Aziz Ad Darawardi] dari [Suhail] dengan isnad ini, dan ia pun menuturkan hadits itu. Dan telah menceritakannya kepadaku [Muhammad bin Abdullah bin Bazi'] Telah menceritakan kepada kami [Yazid bin Zurai'] Telah menceritakan kepada kami [Rauh bin Al Qasim] Telah menceritakan kepada kami [Shuhail bin Abu Shalih] dengan isnad ini dan ia berkata; Ia mengganti AQSHAA` dengan ADLBAA`. Dan ia juga menyebutkan; \"Lalu disetrikakan pada lambung dan punggungnya.\" dan ia tidak menyebutkan \"JABINUHU (keningnya).\" Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili] Telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru bin Harits] bahwa [Bukair] telah menceritakan kepadanya dari [Dzakwan] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Jika seorang hamba tidak menunaikan hak Allah atau Shadaqah (zakat) untanya…\" Lalu ia menuturkan hadits sebagaimana hadits Suhail dari bapaknya",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		}
	]
}