{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2304,
			"arabicnumber": "94.03",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abi Syaibah] dan [Ibnu Numair] dan [Abu Kuraib] semuanya dari [Abu Mu'awiyah] - [Yahya] berkata- telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Zaid bin Wahb] dari [Abu Dzarr] ia berkata; Pada suatu senja, aku berjalan bersama Rasulullah shallallahu 'alaihi wasallam di tanah berbatu-batu hitam sambil kami memandang ke arah bukit Uhud. Tiba-tiba Rasulullah shallallahu 'alaihi wasallam memanggilku dan bersabda: \"Wahai Abu Dzar.\" Saya menjawab, \"Ya, wahai Rasulullah.\" Beliau bersabda: \"Seandainya bukit uhud itu menjadi emas bagiku, maka hal itu tidaklah akan mengembirakanku, jika pada hari ketiga emas itu masih ada di tanganku satu dinar, selain satu dinar yang kupersiapkan untuk membayar hutang. Tetapi akan kupanggil para hamba Allah, dan kukatakan kepada mereka -sambil beliau melempar ke depan, ke kanan dan kekiri, seolah-olah beliau sedang membagi-bagi.-\" Sementara itu kami terus berjalan, kemudian beliau memanggilku lagi: \"Wahai Abu Dzar!\" Saya menjawab, \"Ya, Wahai Rasulullah.\" Beliau bersabda: \"Orang-orang yang kaya harta kelak mereka akan menjadi miskin pada hari kiamat, kecuali orang-orang yang berkata: Ini, ini (membagikan hartanya, seperti yang dilakukan Nabi mula-mula).\" Kemudian Abu Dzar melanjutkan; Sementara itu, kami terus berjalan, dan tiba-tiba beliau memanggilku lagi: \"Hai Abu Dzar, tetaplah kamu di sini, hingga aku kembali.\" Lalu beliau pergi hingga hilang dari pandanganku. Tidak lama kemudian terdengar olehku suara gaduh, mungkin Rasulullah shallallahu 'alaihi wasallam mendapat kesulitan, pikirku. Dan aku pun bermaksud hendak menyusul beliau. Tetapi aku ingat perintah beliau, jangan kemana-mana sampai aku kembali. Karena itu, kutunggu saja beliau. Ketika beliau tiba, kuceritakan kepada beliau tentang suara gaduh yang kudengar. Maka beliau pun bersabda: \"Itu adalah Jibril, dia datang kepadaku. Jibril berkata, 'Siapa saja di antara umatmu yang mati dalam keadaan tidak menyekutukan Allah dengan sesuatu pun, niscaya dia masuk surga.'\" Nabi shallallahu 'alaihi wasallam bertanya: \"Sekalipun dia berzina dan mencuri?\" Jibril menjawab, \"Ya, sekalipun dia berzina dan mencuri",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 41
			}
		}
	]
}