{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2306,
			"arabicnumber": "992.01",
			"text": "Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Al Jurairi] dari [Abul Ala`] dari [Al Ahnaf bin Qais] ia berkata; Ketika aku berada di Madinah dan berada dalam sekelompok orang Quraisy, tiba-tiba datanglah [seorang laki-laki] yang berpakaian dari bahan yang kasar, kulit serta wajahnya juga kasar. Kemudian laki-laki itu berdiri seraya berkata, \"Berilah kabar gembira kepada orang-orang yang menumpuk harta (tidak membayar zakat), bahwa mereka akan disiksa dengan batu yang dipanaskan di dalam neraka jahannam. Lalu diletakkan di atas dada salah seorang dari mereka hingga batu itu keluar dari pundak mereka. Kemudian batu itu diletakkan di tengah-tengah kedua pundaknya hingga keluar dari dadanya dengan mendidih.\" (Mendengar hal itu) orang-orang pun menundukkan kepala. Dan aku tidak melihat seorang pun dari mereka kembali memandangnya. Kemudian laki-laki itu berbalik, lalu kuikuti sampai ia duduk di rombongannya. Maka kukatakan padanya, \"Tidaklah aku melihat mereka, melainkan benci terhadap apa yang telah Anda katakan.\" Ia berkata, \"Sesungguhnya orang-orang itu tidak memahami sedikitpun. Sesungguhnya kekasihku Abu Al Qasim shallallahu 'alaihi wasallam pernah memanggilku, lalu aku pun menjawab panggilannya. Kemudian beliau bertanya: 'Apakah kamu melihat bukit gunung Uhud? ' Lalu aku melihat matahari yang menyinariku, dan aku menyangka bahwa beliau akan mengutusku untuk suatu keperluan, lalu aku jawab, \"Ya, aku lihat.\" Maka beliau bersabda: 'Tidaklah membahagiakanku jika aku memiliki emas sebesar bukit itu, bahkan aku akan menginfakkannya seluruhnya, kecuali tiga Dinar.' Namun mereka itu mengumpulkan harta benda dunia dan mereka tidak berakal sedikitpun.\" Aku bertanya, \"Kenapa Anda dan saudara perempuan Anda dari Quraisy tidak mendatangi dan meminta kepada mereka?\" Ia menjawab, \"Tidak, dan demi Rabb-mu, aku tidak akan meminta dunia pada mereka dan tidak pula akan meminta fatwa pada mereka hingga aku berjumpa dengan Allah dan Rasul-Nya",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 43
			}
		}
	]
}