{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2351,
			"arabicnumber": "1017.01",
			"text": "Telah menceritakan kepadaku [Muhammad bin Al Mutsanna Al Anazi] telah mengabarkan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Aun bin Abu Juhaifah] dari [Al Mundzir bin Jarir] dari [Jarir] ia berkata; Pada suatu pagi, ketika kami berada dekat Rasulullah shallallahu 'alaihi wasallam, tiba-tiba datang segerombongan orang tanpa sepatu, dan berpaiakan selembar kain yang diselimutkan ke badan mereka sambil menyandang pedang. Kebanyakan mereka, mungkin seluruhnya berasal dari suku Mudlar. Ketika melihat mereka, wajah Rasulullah shallallahu 'alaihi wasallam terharu lantaran kemiskinan mereka. Beliau masuk ke rumahnya dan keluar lagi. Maka disuruhnya Bilal adzan dan iqamah, sesudah itu beliau shalat. Sesudah shalat, beliau berpidato. Beliau membacakan firman Allah: \"Hai sekalian manusia, bertakwalah kepada Tuhan-mu yang Telah menciptakan kamu dari seorang diri…, \" hingga akhir ayat, \"Sesungguhnya Allah selalu mengawasi kalian.\" kemudian ayat yang terdapat dalam surat Al Hasyr: \"Hai orang-orang yang beriman, bertakwalah kepada Allah dan hendaklah setiap diri memperhatikan apa yang Telah diperbuatnya untuk hari esok (akhirat); dan bertakwalah kepada Allah..., \" Mendengar khutbah Nabi shallallahu 'alaihi wasallam itu, serta merta seorang laki-laki menyedekahkan dinar dan dirhamnya, pakaiannya, satu sha' gandum, satu sha' kurma sehingga Nabi shallallahu 'alaihi wasallam bersabda: \"Meskipun hanya dengan setengah biji kurma.\" Maka datang pula seorang laki-laki Anshar membawa sekantong yang hampir tak tergenggam oleh tangannya, bahkan tidak terangkat. Demikianlah, akhirnya orang-orang lain pun mengikuti pula memberikan sedekah mereka, sehingga kelihatan olehku sudah terkumpul dua tumpuk makanan dan pakaian, sehingga kelihatan olehku wajah Rasulullah shallallahu 'alaihi wasallam berubah menjadi bersinar bagaikan emas. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Barangsiapa yang memulai mengerjakan perbuatan baik dalam Islam, maka dia akan memperoleh pahalanya dan pahala orang yang mencontoh perbuatan itu, tanpa mengurangi pahala mereka sedikitpun. Dan barangsiapa yang memulai kebiasaan buruk, maka dia akan mendapatkan dosanya, dan dosa orang yang mengikutinya dengan tanpa mengurangi dosa mereka sedikit pun.\" Dan Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] Telah menceritakan kepada kami [Abu Usamah] -dalam jalur lain- Dan Telah menceritakan kepada kami [Ubaidullah bin Mu'adz Al Anbari] Telah menceritakan kepada kami [bapakku] ia berkata, Telah menceritakan kepada kami [Syu'bah] telah menceritakan kepadaku [Aun bin Abu Juhaifah] ia berkata, saya mendengar [Al Mundziri bin Jarir] dari [bapaknya] ia berkata; Suatu hari, kami berada di dekat Rasulullah shallallahu 'alaihi wasallam. Yakni sebagaimana hadits Ibnu Ja'far. Dan di dalam hadits Ibnu Mu'adz terdapat tambahan, yakni; Kemudian beliau shalat Zhuhur dan kemudian berkhutbah.\" Telah menceritakan kepadaku [Ubaidullah bin Umar Al Qawariri] dan [Abu Kami] dan [Muhammad bin Abdul Malik Al Umawi] mereka berkata, telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul Malik bin Umair] dari [Al Mundziri bin Jarir] dari [bapaknya] ia berkata; Kami duduk di sisi Nabi shallallahu 'alaihi wasallam, lalu datanglah suatu rombongan yang tak beralas kaki. Ia pun menyebutkan hadits, dan didalamnya; Kemudian beliau shalat Zhuhur lalu naik mimbar kecil, memuji Allah dan menyanjung-Nya dan kemudian bersabda: \"Amma Ba'du, sesungguhnya Allah 'azza wajalla telah menurunkan di dalam kitab-Nya; 'Wahai sekalian manusia, bertakwalah kalian kepada Rabb kalian..\" Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Musa bin Abdullah bin Yazid] dan [Abu Dluha] dari [Abdurrahman bin Hilal Al Absi] dari [Jarir bin Abdullah] ia berkata; Sekelompok orang Arab pegunungan mendatangi Rasulullah shallallahu 'alaihi wasallam dengan mengenakan sehelai kain Shuf (wool), dan beliau melihat keadaan mereka yang memprihatinkan, bahwa mereka benar-benar membutuhkan bantuan. Ia pun menyebutkan hadits yang semakna dengan hadits mereka",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		}
	]
}