{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2429,
			"arabicnumber": "1057.01",
			"text": "Telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Ishaq bin Sulaiman Ar Razi] ia berkata, saya mendengar [Malik] -dalam jalur lain- Dan telah menceritakan kepadaku [Yunus bin Abdul A'la] -lafazh juga miliknya- telah mengabarkan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Malik bin Anas] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] ia berkata; Pada suatu ketika aku berjalan bersama-sama Rasulullah shallallahu 'alaihi wasallam. Saat itu, beliau memakai selendang buatan Najran yang tebal pinggirnya. Tiba-tiba seorang Arab badui mendapatkan beliau, lalu ditariknya selendang Nabi tersebut sekuat-kuatnya, sehingga kulihat selendang tersebut membekas di leher Rasulullah shallallahu 'alaihi wasallam karena kuatnya tarikan. Kemudian orang tersebut berkata, \"Wahai Muhammad, perintahkanlah kepada bendahara Tuan agar memberikan harta yang ada dalam pengawasan Tuan kepadaku.\" Rasulullah shallallahu 'alaihi wasallam menoleh kepada orang itu sambil tertawa. Kemudian diperintahkanlah oleh beliau agar orang itu diberi sedekah. Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Abdush Shamad bin Abdul Warits] telah menceritakan kepada kami [Hammam] -dalam jalur lain- Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Umar bin Yunus] telah menceritakan kepada kami [Ikrimah bin Ammar] -dalam jalur lain- Dan telah menceritakan kepadaku [Salamah bin Syabib] telah menceritakan kepada kami [Abul Mughirah] telah menceritakan kepada kami [Al Auza'i] semuanya dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini. Dalam hadits Ikrimah bin Ammar terdapat tambahan; \"Kemudian laki-laki itu menarik dengan sekali tarikan hingga Rasulullah shallallahu 'alaihi wasallam tertarik ke arahnya.\" Dan dalam hadits Hammam; \"Ia menarik selendang itu hingga sobek dan meninggalkan bekas pada leher Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 166
			}
		}
	]
}