{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2436,
			"arabicnumber": "1059.01",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya At Tujibi] telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Anas bin Malik] ia berkata; Ketika perang Hunain, Allah memberikan harta rampasan kepada Rasulullah shallallahu 'alaihi wasallam dari harta kaum Hawazin. Kemudian beliau membagikannya kepada kaum Quraisy berupa seratus ekor unta. Karena itu, beberapa kaum Anshar berujar, \"Semoga Allah mengampuni Rasulullah shallallahu 'alaihi wasallam yang telah memberi kaum Quraisy sedangkan kita dibiarkan saja oleh beliau, padahal perang kita masih basah oleh darah musuh.\" Anas berkata; Kemudian ucapan mereka itu sampai kepada Rasulullah shallallahu 'alaihi wasallam, karena itu beliau memerintahkan kaum Anshar agar berkumpul di kemah kulit. Setelah mereka berkumpul, Rasulullah shallallahu 'alaihi wasallam mendatangi mereka dan bertanya: \"Benarkah berita yang datang kepadaku mengenai ucapan kalian?\" Orang yang paling pandai diantara kaum Ansahr menjawab, \"Kami tidak pernah berkata demikian ya Rasulullah! Tetapi pemuda-pemuda kamilah yang mengatakan, 'Semoga Allah mengampuni Rasulullah shallallahu 'alaihi wasallam yang telah memberi orang Quraisy, sedangkan kita dibiarkannya saja. Padahal pedang kita masih basah oleh darah musuh.'\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sebenarnya, aku hanya memberi kepada orang-orang yang belum lama masuk Islam, sekedar untuk melunakkan hati mereka. Apakah kalian tidak rela kalau mereka pergi dengan harta benda dunia, sedangkan kalian pulang ke rumah masing-masing bersama Rasulullah shallallahu 'alaihi wasallam? Demi Allah, sesungguhnya apa yang kalian bawa pulang adalah lebih berarti daripada apa yang mereka bawa.\" Mereka pun menjawab, \"Benar ya Rasulullah! Kami rela ya Rasulullah.\" Kemudian beliau bersabda lagi: \"Kalian semua akan mendapatkan orang-orang yang sangat mementingkan pribadinya masing-masing; karena itu, bersabarlah hingga kalian menjumpai Allah dan Rasul-Nya. Aku akan menunggu kalian di telaga (kelak pada hari kiamat).\" Mereka menjawab, \"Kami akan bersabar wahai Rasulullah.\" Telah menceritakan kepada kami [Hasan Al Hulwani] dan [Abdu Humaid] keduanya berkata, Telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [bapakku] dari [Shalih] dari [Ibnu Syihab] telah menceritakan kepadaku [Anas bin Malik] bahwa ia berkata; \"Ketika Allah memberikan harta rampasan kepada Rasulullah shallallahu 'alaihi wasallam dari harta Hawazin.\" Ia pun mengkisahkan hadits yang serupa. Hanya saja ia mengatakan; Anas berkata, \"Kami tidak bersabar lagi.\" Ia juga berkata; \"Adapun anak-anak muda.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Anak saudara Ibnu Syihab] dari [pamannya] ia berkata; telah mengabarkan kepadaku [Anas bin Malik], ia pun menuturkan hadits yang serupa, hanya saja ia berkata; Anas berkata; \"Kami akan bersabar.\" Yakni sebagaimana riwayat Yunus dari Zuhri",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 173
			}
		}
	]
}