{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2446,
			"arabicnumber": "1061",
			"text": "Telah menceritakan kepada kami [Syuraij bin Yunus] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Amru bin Yahya bin Umarah] dari [Abbad bin Tamim] dari [Abdullah bin Zaid] bahwasanya ketika Rasulullah shallallahu 'alaihi wasallam menaklukkan Hunain, beliau membagi-bagikan harta ghanimah, lalu beliau pun memberikannya kepada para Muallaf. Kemudian sampailah kabar kepada beliau bahwa kaum Anshar juga ingin mendapatkan bagian sebagaimana yang diperoleh umumnya orang-orang. Maka Rasulullah shallallahu 'alaihi wasallam pun berdiri dan berkhutbah kepada mereka. Beliau memuji Allah dan membaca sanjungan atas-Nya, kemudian beliau bersabda: \"Wahai kaum Anshar, bukankah aku telah mendapati kalian dalam keadaan sesat lalu Allah memberikan hidayah kepada kalian melalui perantaraku? Bukankah dulu kalian dalam keadaan miskin lalu Allah mencukupi kalian melalui aku? Dan bukanlah dulu kalian dalam keadaan bercerai-berai lalu Allah mempersatukan kalian lantaranku?\" Maka mereka pun berkata, \"Allah dan Rasul-Nya yang lebih menentramkan.\" Kemudian beliau bersabda lagi: \"Tidakkah kalian mencintaiku?\" mereka berkata, \"Allah dan Rasul-Nya yang lebih menentramkan (hati kami).\" Beliau bersabda lagi: \"Sesungguhnya, jika kalian mau mengatakan begini dan begitu.\" Amru menduga bahwa ia tidak menghafalnya. Kemudian beliau bersabda lagi: \"Tidakkah kalian ridla, bila orang-orang pergi dengan membawa kambing dan unta-unta sedangkan kalian pulang dengan membawa Rasulullah ke rumah-rumah kalian? Kaum Anshar adalah syi'ar (baju dalam) sedangkan umumnya manusia adalah ditsar (baju luar). Sekiranya bukan karena Hijrah, niscaya aku termasuk golongan Anshar. Dan seandainya orang-orang menempuh suatu lembah dan jalan bukit, niscaya aku akan melalui lembah dan jalan bukit yang dilalui kaum Anshar. Sesungguhnya sepeninggalku nanti, kalian akan menemui atsarah (keutamaan), karena itu bersabarlah hingga kalian menemuiku di telagaku (Al Haudl)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 183
			}
		}
	]
}