{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2451,
			"arabicnumber": "1064.01",
			"text": "Telah menceritakan kepada kami [Hannad bin As Sari] telah menceritakan kepada kami [Abul Ahwash] dari [Sa'id bin Masruq] dari [Abdurrahman bin Abu Nu'm] dari [Abu Sa'id Al Khudri] ia berkata; Ketika Ali bin Abi Thalib berada di Yaman, dia pernah mengirimkan emas yang masih kotor kepada Rasulullah shallallahu 'alaihi wasallam. Lalu emas itu dibagi-bagikan oleh Rasulullah shallallahu 'alaihi wasallam kepada empat kelompok. Yaitu kepada Aqra` bin Habis Al Hanzhali, Uyainah bin Badar Al Fazari, Alqamah bin Ulatsah Al Amiri, termasuk Bani Kilab dan Zaid Al Khair Ath Thay dan salah satu Bani Nabhan. Abu Sa'id berkata; Orang-orang Quraisy marah dengan adanya pembagian itu. kata mereka, \"Kenapa pemimpin-pemimpin Najed yang diberi pembagian oleh Rasulullah, dan kita tidak dibaginya?\" maka Rasulullah shallallahu 'alaihi wasallam pun menjawab: \"Sesungguhnya aku lakukan yang demikian itu, untuk membujuk hati mereka.\" Sementara itu, datanglah laki-laki berjenggot tebal, pelipis menonjol, mata cekung, dahi menjorok dan kepalanya digundul. Ia berkata, \"Wahai Muhammad! Takutlah Anda kepada Allah!\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa pulakah lagi yang akan mentaati Allah, jika aku sendiri telah mendurhakai-Nya? Allah memberikan ketenangan bagiku atas semua penduduk bumi, maka apakah kamu tidak mau memberikan ketenangan bagiku?\" Abu Sa'id berkata; Setelah orang itu berlaku, maka seorang sahabat (Khalid bin Al Walid) meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk membunuh orang itu. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Dari kelompok orang ini, akan muncul nanti orang-orang yang pandai membaca Al Qur`an tetapi tidak sampai melewati kerongkongan mereka, bahkan mereka membunuh orang-orang Islam, dan membiarkan para penyembah berhala; mereka keluar dari Islam seperti panah yang meluncur dari busurnya. Seandainya aku masih mendapati mereka, akan kumusnahkan mereka seperti musnahnya kaum 'Ad",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 188
			}
		}
	]
}