{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2452,
			"arabicnumber": "1064.02",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Wahid] dari [Umarah bin Al Qa'qa'] telah menceritakan kepada kami [Abdurrahman bin Abu Nu'm] ia berkata, saya mendengar [Abu Sa'id Al Khudri] berkata; Ali bin Abu Thalib pernah mengirim emas -yang diletakkan dalam tas yang kotor- kepada Rasulullah shallallahu 'alaihi wasallam dari Yaman. kemudian Rasulullah shallallahu 'alaihi wasallam membagikannya kepada empat orang, yaitu; Uyainah bin Hisn, Al Aqra bin Habis, dan Zaid Al Khalil. Sedangkah yang keempat antara Alqamah bin Ulatsah atau Amir bin Ath Thufail. Maka ada seorang sahabat yang mengatakan bahwa kami lebih berhak atas pemberian ini daripada mereka. kemudian peristiwa ini sampai kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau pun bersabda: \"Mengapa kalian tidak mempercayaiku? Padahal aku adalah kepercayaan penghuni langit, dan aku selalu mendapat berita dari langit setiap saat.\" Abu Sa'id berkata; Lalu seorang laki-laki bermata cekung yang pipinya bagian atas menonjol, jenggotnya lebat, rambutnya pendek dan pakaiannya disingkingkan berkata, \"Ya Rasululah, bertakwalah kepada Allah!\" maka beliau menjawab: \"Celaka kamu! Bukankah aku ini penduduk bumi yang paling bertakwa kepada Allah?\" kemudian laki-laki tersebut berpaling, lalu Khalid bin Al Walid berkata, \"Ya Rasulullah, izinkan aku untuk memenggal lehernya.\" Beliau bersabda: \"Jangan, mungkin dia juga shalat.\" Khalid berkata, \"Banyak orang shalat, hanya lisannya yang berucap tapi hatinya tidak.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku tidak diperintahkan untuk menyakiti hati manusia, tidak pula untuk merobek perut mereka.\" Abu Sa'id berkata; Kemudian beliau memandanginya, dan ketika dia datang, beliau bersabda: \"Sesungguhnya dari kelompok orang ini akan muncul orang-orang yang mulutnya senantiasa membaca Kitabullah, tetapi tidak sampai melewati kerongkongan mereka. mereka keluar dari agama Allah sebagaimana meluncurnya anak panah dari busurnya.\" Abu Sa'id berkata; \"Sekiranya kau menemui orang-orang itu, sungguhnya akan aku binasakan mereka, sebagaimana binasanya kaum Tsamud.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Umarah bin Al Qa'qa'] dengan isnad ini. ia berkata; Dan Alqamah bin Ulatsah. Dan ia tidak menyebutkan Amir bin Ath Thufail. Dan ia menyebutkan; \"NAATI`UL JABHAH\" tapi ia tidak menyebut, \"NAASYIZ\". Kemudian ia juga menambahkan: \"Kemudian Umar bin Al Khaththab beranjak dan berkata, \"Wahai Rasulullah, haruskah aku memenggal lehernya?\" Nabi menjawab: \"Jangan.\" Kemudian ia mundur kembalil. Lalu Khalid bin Al Walid sang pedang Allah berdiri dan berkata, \"Wahai Rasulullah, haruskah aku memenggal lehernya?\" beliau menjawab: \"Jangan. Dari keturunan orang ini akan muncul suatu kaum, mereka pandai membaca Kitabullah..\" Umarah berkata; (Khalid) berkata, \"Sekiranya saya menjumpai mereka, niscaya akan kubunuh mereka sebagai pembunuhan atas kaum Tsamud.\" Dan Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Ibnu Fudlail] dari [Umarah bin Al Qa'qa'] dengan isnad ini, dan ia mengatakan; Di antara empat orang, yaitu; Zaid Al Khalil, Al Aqra bin Habis, Uyainah bin Hisn dan Alqamah bin Ulatsah atau Amir bin Ath Thufail. Kemudian ia juga menyebutkan; \"NAATI`UL JABHAH\" sebagaimana riwayat Abdul Wahid. Ia juga menyebutkan; \"Sesungguhnya akan keluar dari keturunan orang ini, suatu kaum…\" tapi ia tidak menyebutkan; \"Sekiranya aku mendapati mereka, niscaya akan kubunuh mereka sebagaimana pembunuhan atas kaum Tsamud",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 189
			}
		}
	]
}