{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2467,
			"arabicnumber": "1066.06",
			"text": "Telah menceritakan kepada kami [Abdu bin Humaid] telah menceritakan kepada kami [Abdurrazzaq bin Hammam] telah menceritakan kepada kami [Abdul Malik bin Abu Sulaiman] telah menceritakan kepada kami [Salamah bin Kuhail] telah menceritakan kepada kami [Zaid bin Harb Al Juhani] bahwasanya; Ia pernah bergabung di dalam suatu pasukan bersama [Ali] radliallahu 'anhu yang tengah berjalan menuju kaum Khawarij. Kemudian berkatalah Ali radliallahu 'anhu; Sungguh, aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan muncul suatu kaum dari umatku yang pandai membaca Al Qur`an. Dimana, bacaan kalian tidak ada apa-apanya dibandingkan dengan bacaan mereka. Demikian pula shalat kalian daripada shalat mereka. Juga puasa mereka dibandingkan dengan puasa kalian. Mereka membaca Al Qur`an dan mereka menyangka bahwa Al Qur`an itu adalah (hujjah) bagi mereka, namun ternyata Al Qur`an itu adalah (bencana) atas mereka. Shalat mereka tidak sampai melewati batas tenggorokan. Mereka keluar dari Islam sebagaimana anak panah meluncur dari busurnya. Sekiranya pasukan yang memerangi mereka tahu pahala yang telah ditetapkan bagi mereka atas lisan Nabi shallallahu 'alaihi wasallam, niscaya mereka akan berhenti beramal. Ciri-cirinya adalah bahwa di antara mereka ada seorang laki-laki yang memiliki lengan tak berhasta dan di atasnya terdapat biji seperti putting susu dan juga berbulu-bulu putih.\" Pergilah kalian ke Mu'awiyah dan penduduk Syam dan kalian meninggalkan mereka. Sebab, mereka akan mendatangi keluarga dan harta-harta kalian. Demi Allah, aku benar-benar mengharap bahwa mereka itulah kaum yang dimaksud Rasulullah shallallahu 'alaihi wasallam, karena mereka telah menumpahkan darah yang haram dan mengelabui manusia. Maka, berangkatlah kalian atas nama Allah. Salamah bin Kuhail berkata; Maka Zaid bin Wahb terus mengkisahkannya padaku peristiwa demi peristiwa hingga ia berkata; Kami melewati suatu jembatan. Sedangkan saat itu kaum Khawarij dipinpin oleh Abdullah bin Wahb, maka ketika kami berjumpa, ia pun berkata kepada mereka, \"Lemparlah tombak dan hunuslah pedang-pedang kalian dari sarungnya, karena saya khawatir mereka akan mencari-cari kalian sebagaimana yang terjadi pada Hari Harura.\" Akhirnya mereka pun kembali dengan melemparkan tombak dan menguhunuskan pedang-pedang mereka. Dan orang-orang pun merintangi mereka juga dengan tombak sehingga terbunuhlah sebagian mereka atas sebagian yang lain, namun tidak ada yang terbunuh kecuali dua orang. Ali bin Abu Thalib berkata, \"Carilah seorang yang pendek dari mereka.\" Lalu mereka mencarinya, namun tidak mereka temukan. Maka Ali radliallahu 'anhu berusaha mencari sendiri hingga ia mendapati orang-orang yang sebagiannya telah terbunuh atas sebagian yang lain. Ali berkata, \"Akhirkanlah mereka.\" Akhirnya Al Mukhdaj (seorang yang laki-laki pendek) itu pun mereka temukan dibalik tumpukan tanah. Sahabat Ali bertakbir kemudian berkata, \"Maha Benar Allah, dan Rasul-Nya pun telah menyampaikan.\" Kemudian Ubaid As Salmani mendekat kepadanya dan berkata, \"Wahai Amirul Mukminin, demi Allah Yang Tidak ada Tuhan yang berhak disembah selain Dia, apakah Anda benar-benar mendengar hadits itu dari Rasulullah shallallahu 'alaihi wasallam?\" Ali menjawab, \"Ya, Demi Dzat Yang Tidak ada Ilah yang berhak disembah selain Dia.\" Ubaid As Salmani sampai memintanya bersumpah hingga empat kali",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 204
			}
		}
	]
}