{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2595,
			"arabicnumber": "1111.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ibnu Numair] semuanya dari [Ibnu Uyainah] - [Yahya] berkata- telah mengabarkan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Humaid bin Abdurrahman] dari [Abu Hurairah] radliallahu 'anhu, ia berkata; Seorang laki-laki datang menghadap Nabi shallallahu 'alaihi wasallam dan berkata, \"Celaka diriku wahai Rasulullah.\" Beliau bertanya: \"Apa yang telah mencelakakanmu?\" Laki-laki itu menjawab, \"Saya telah menggauli isteriku di siang hari pada bulan Ramadlan.\" Beliau bertanya: \"Sanggupkah kamu untuk memerdekakan budak?\" Ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Sanggupkan kamu berpuasa dua bulan berturut-turut?\" \"Tidak.\" jawabnya, Beliau bertanya lagi: \"Sanggupkah kamu memberi makan kepada enam puluh orang miskin?\" Ia menjawab, \"Tidak.\" Abu Hurairah berkata; Kemudian laki-laki itu pun duduk, sementara Nabi shallallahu 'alaihi wasallam diberi satu keranjang berisi kurma. Maka beliau pun bersabda: \"Bersedekahlah dengan kurma ini.\" Laki-laki itu pun berkata, \"Adakah orang yang lebih fakir dari kami. Karena tidak ada penduduk di sekitar sini yang lebih membutuhkannya daripada kami.\" Mendengar ucapan itu, Nabi shallallahu 'alaihi wasallam tertawa hingga gigi taringnya terlihat. Akhirnya beliau bersabda: \"Pulanglah dan berilah makan keluargamu dengannya.\" Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dari [Manshur] dari [Muhammad bin Muslim Az Zuhri] dengan isnad ini sebagaimana riwayat Ibnu Uyainah. Ia mengatakan; \"BI'ARAQ FIIHI TAMR (keranjang/takaran berisi kurma).\" Namun ia tidak menyebutkan ungkapan; \"Maka Nabi shallallahu 'alaihi wasallam pun tertawa hingga gigi taringnya terlihat",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 101
			}
		}
	]
}