{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2800,
			"arabicnumber": "1180.03",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma`il bin Ibrahim] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Muhammad bin Bakr] keduanya berkata, telah mengabarkan kepada kami [Ibnu Juraij] -dalam riwyat lain- Dan Telah menceritakan kepada kami [Ali bin Khasyram] -lafazh juga miliknya- telah mengabarkan kepada kami [Isa] dari [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Atha`] bahwa [Shafwan bin Umayyah] telah mengabarkan kepadanya bahwa [Ya'la] berkata Umar bin Al Khaththab radliallahu 'anhu, \"Seandainya aku dapat melihat Nabi shallallahu 'alaihi wasallam saat beliau menerima wahyu.\" Maka ketika Nabi shallallahu 'alaihi wasallam berada di Ji'ranah yang saat itu beliau diselimuti dengan kain sedangkan di sekelilingnya adalah para sahabatnya, di antara mereka ada Umar bin Al Khaththab, tiba-tiba datanglah seorang laki-laki dengan mengenakan jubah Shuf dan tubuhnya telah terlumuri dengan wewangian. Laki-laki itu pun berkata, \"Wahai Rasulullah, bagaimana menurut Anda, mengenai seorang laki-laki yang berniat Ihram untuk Umrah dengan mengenakan Jubah setelah ia melumurinya dengan wewangian?\" Maka Nabi shallallahu 'alaihi wasallam pun memandangi laki-laki itu, lalu beliau terdiam hingga wahyu pun turun kepadanya. Maka Umar memberi isyarat dengan tangannya kepada Ya'la bin Umayyah, \"Kemarilah.\" Ya'la pun datang dan langsung memasukkan kepalanya, ternyata wajah Nabi shallallahu 'alaihi wasallam sedang memerah. Lalu Umar menutup sesaat hingga beliau siuman kembali. Sesudah itu, beliau bertanya: \"Manakah orang yang bertanya padaku tentang Umrah?\" maka laki-laki itu pun dicari dan dibawa ke hadapan beliau. Akhirnya Nabi shallallahu 'alaihi wasallam bersabda: \"Adapun wewangian yang ada padamu, maka cucilah tiga kali, sedangkan Jubah, maka lepaskanlah. Lakukanlah pada Umrahmu sebagaimana apa yang kamu lakukan di dalam hajimu",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 10
			}
		}
	]
}