{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2950,
			"arabicnumber": "1218.02",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ishaq bin Ibrahim] semuanya dari [Hatim] ia berkata, - [Abu Bakr] berkata- Telah menceritakan kepada kami [Hatim bin Isma'il Al Madani] dari [Ja'far bin Muhammad] dari [bapaknya] ia berkata; Kami datang ke rumah [Jabir bin Abdullah], lalu ia menanyai kami satu persatu, siapa nama kami masing-masing. Sampai giliranku, kusebutkan namaku Muhammad bin Ali bin Husain. Lalu dibukanya kancing bajuku yang atas dan yang bawah. Kemudian diletakkannya telapak tangannya antara kedua susuku. Ketika itu, aku masih muda belia. Lalu dia berkata, \"Selamat datang wahai anak saudaraku, tanyakanlah apa yang hendak kamu tanyakan.\" Maka aku pun bertanya kepadanya. Dia telah buta. Ketika waktu shalat tiba, dia berdiri di atas sehelai sajadah yang selalu dibawanya. Tiap kali sajadah itu diletakkannya ke bahunya, pinggirnya selalu lekat padanya karena kecilnya sajadah itu. Aku bertanya kepadanya, \"Terangkanlah kepadaku bagaimana Rasulullah shallallahu 'alaihi wasallam melakukan ibadah haji.\" Lalu ia bicara dengan isyarat tangannya sambil memegang sembilan anak jarinya. Katanya; Sembilan tahun lamanya beliau menetap di Madinah, namun beliau belum haji. Kemudian beliau memberitahukan bahwa tahun kesepuluh beliau akan naik haji. Karena itu, berbondong-bondonglah orang datang ke Madinah, hendak ikut bersama-sama Rasulullah shallallahu 'alaihi wasallam untuk beramal seperti amalan beliau. Lalu kami berangkat bersama-sama dengan beliau. Ketika sampai di Dzulhulaifah, Asma` binti Humais melahirkan puteranya, Muhammad bin Abu Bakar. Dia menyuruh untuk menanyakan kepada Rasulullah shallallahu 'alaihi wasallam apa yang harus dilakukannya (karena melahirkan itu). Maka beliau pun bersabda: \"Mandi dan pakai kain pembalutmu. Kemudian pakai pakaian ihrammu kembali.\" Rasulullah shallallahu 'alaihi wasallam shalat dua raka'at di masjid Dzulhulaifah, kemudian beliau naiki untanya yang bernama Qashwa. Setelah sampai di Baida`, kulihat sekelilingku, alangkah banyaknya orang yang mengiringi beliau, yang berkendaraan dan yang berjalan kaki, di kanan-kiri dan di belakang beliau. Ketika itu turun Al Qur`an (wahyu), dimana Rasulullah shallallahu 'alaihi wasallam mengerti maksudnya, yaitu sebagaimana petunjuk amal yang harus kami amalkan. Lalu beliau teriakan bacaan talbiyah: \"LABBAIKA ALLAHUMMA LABBAIKA LABBAIKA LAA SYARIIKA LAKA LABBAIKA INNALHAMDA WAN NI'MATA LAKA WALMULKU LAA SYARIIKA LAKA (Aku patuhi perintah-Mu ya Allah, aku patuhi, aku patuhi. Tiada sekutu bagi-Mu, aku patuhi perintah-Mu; sesungguhnya puji dan nikmat adalah milik-Mu, begitu pula kerajaan, tiada sekutu bagi-Mu, aku patuhi perintah-Mu).\" Maka talbiyah pula orang banyak seperti talbiyah Nabi shallallahu 'alaihi wasallam itu. Rasulullah shallallahu 'alaihi wasallam tidak melarang mereka membacanya, bahkan senantiasa membaca terus-menerus. Niat kami hanya untuk mengerjakan haji, dan kami belum mengenal umrah. Setelah sampai di Baitullah, beliau cium salah satu sudutnya (hajar Aswad), kemudian beliau thawaf, lari-lari kecil tiga kali dan berjalan biasa empat kali. Kemudian beliau terus menuju ke Maqam. Ibrahim 'Alais Salam, lalu beliau baca ayat: \"Jadikanlah maqam Ibrahim sebagai tempat shalat...\" (Al Baqarah: 125). Lalu ditempatkannya maqam itu diantaranya dengan Baitullah. Sementara itu ayahku berkata bahwa Nabi shallallahu 'alaihi wasallam membaca dalam shalatnya: \"QUL HUWALLAHU AHADL…\" (Al Ikhlas: 1-4). Dan: \"QUL YAA AYYUHAL KAAFIRUUN..\" (Al Kafirun: 1-6). Kemudian beliau kembali ke sudut Bait (hajar Aswad) lalu diciumnya pula. Kemudian melalui pintu, beliau pergi ke Shafa. Setelah dekat ke bukit Shafa beliau membaca ayat: \"Sesungguhnya Sa'i antara Shafa dan Marwah termasuk lambang-lambang kebesaran Agama Allah...\" (Al Baqarah: 1589). Kemudian mulailah dia melaksanakan perintah Allah. Maka dinaikinya bukit shafa. Setelah kelihatan Baitullah, lalu beliau menghadap ke kiblat seraya mentauhidkan Allah dan mengagungkan-Nya. Dan beliau membaca: \"LAA ILAAHA ILAALLAH WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI`IN QADIIR LAA ILAAHA ILLALLAH WAHDAHU ANJAZA WA'DAHU WANASHARA 'ABDAHU WAHAZAMAL AHZABA WAHDAH (Tiada Tuhan yang berhak disembah selain Allah satu-satu-Nya, tiada sekutu bagi-Nya, milik-Nyalah kerajaan dan segala puji, sedangkan Dia Maha Kuasa atas segala-galanya. Tiada Tuhan yang berhak disembah selain Allah satu-satu-Nya, Yang Maha Menepati janji-Nya dan menolong hamba-hamaba-Nya dan menghancurkan musuh-musuh-Nya sendiri-Nya).\" Kemudian beliau berdo'a. Ucapakan tahlil itu diulanginya sampai tiga kali. Kemudian beliau turun di Marwa. Ketika sampai di lembah, beliau berlari-lari kecil. Dan sesudah itu, beliau menuju bukit Marwa sambil berjalan kembali. setelah sampai di bukit Marwa, beliau berbuat apa yang diperbuatnya di bukit Shafa. Tatkala beliau mengakhiri sa'i-nya di bukit Marwa, beliau berujar: \"Kalau aku belum lakukan apa yang telah kuperbuat, niscaya aku tidak membawa hadya dan menjadikannya umrah.\" Lalu Suraqah bin Malik bin Ju'tsyum, \"Ya, Rasulullah! Apakah untuk tahun ini saja ataukah untuk selama-lamanya?\" Rasulullah shallallahu 'alaihi wasallam memperpanjangkan jari-jari tangannya yang lain seraya bersabda: \"Memasukkan umrah ke dalam haji. Memasukkan umrah ke dalam haji, tidak! Bahkan untuk selama-lamanya.\" Sementara itu Ali datang dari Yaman membawa hewan kurban Nabi shallallahu 'alaihi wasallam. didapatinya Fathimah termasuk orang yang tahallul; dia mengenakan pakaian bercelup dan bercelak mata. Ali melarangnya berbuat demikian. Fathimah menjawab, \"Ayahku sendiri yang menyuruhku berbuat begini.\" Ali berkata; Maka aku pergi menemui Rasulullah shallallahu 'alaihi wasallam untuk meminta fatwa terhadap perbuatan Fathimah tersebut. Kujelaskan kepada beliau bahwa aku mencegahnya berbuat demikian. Beliau pun bersabda: \"Fathimah benar.\" Kemudian beliau bertanya: \"Apa yang kamu baca ketika hendak menunaikan haji?\" Ali berkata; Aku menjawab: \"Ya Allah, aku aku niat menunaikan ibadah haji seperti yang dicontohkan oleh Rasul Engkau.\" Kemudian Ali bertanya, \"Tetapi aku membawa hwankurban, bagaimana itu?\" Beliau menjawab: \"Kamu jangan tahallul.\" Ja'far berkata; Jumlah hadya yang dibawa Ali dari Yaman dan yang dibawa Nabi shallallahu 'alaihi wasallam ada seratus ekor. Para jama'ah telah tahallul dan bercukur semuanya, melainkan Nabi shallallahu 'alaihi wasallam dan orang-orang yang membawa hadya beserta beliau. Ketika hari Tarwiyah (delapan Dzulhijjah) tiba, mereka berangkat menuju Mina untuk melakukan ibadah haji. Rasulullah shallallahu 'alaihi wasallam menunggang kendaraannya. Di sana beliau shalat Zhuhur, 'Ashar, Maghrib, Isya dan Shubuh. Kemudian beliau menanti sebentar hingga terbit matahari; sementara itu beliau menyuruh orang lebih dahulu ke Namirah untuk mendirikan kemah di sana. Sedangkan Orang Quraisy mengira bahwa beliau tentu akan berhenti di Masy'aril Haram (sebuah bukit di Muzdalifah) sebagaimana biasanya orang-orang jahililiyah. Tetapi ternyata beliau terus saja menuju Arafah. Sampai ke Namirah, didapatinya tenda-tenda telah didirikan orang. Lalu beliau berhenti untuk istirahat di situ. Ketika matahari telah condong, beliau menaiki untanya meneruskan. Sampai di tengah-tengah lebah beliau berpidato: \"Sesungguhnya menumpahkan darah, merampas harta sesamamu adalah haram sebagaimana haramnya berperang pada hari ini, pada bulan ini, dan di negeri ini. Ketahuilah, semua yang berbau Jahiliyah telah dihapuskan di bawah undang-undangku, termasuk tebusan darah masa jahilijyah. Tebusan darah yang pertama-tama kuhapuskan adalah darah Ibnu Rabi'ah bin Harits yang disusukan oleh Bani Sa'ad, lalu ia dibunuh oleh Huzail. Begitu pula telah kuhapuskan riba jahiliyah; yang mula-mula kuhapuskan ialah riba yang ditetapkan Abbas bin Abdul Muthalib. Sesungguhnya riba itu kuhapuskan semuanya. Kemudian jangalah dirimu terhadap wanita. Kamu boleh mengambil mereka sebagai amanah Allah, dan mereka halal bagimu dengan mematuhi peraturan-peraturan Allah. Setelah itu, kamu punya hak atas mereka, yaitu supaya mereka tidak membolehkan orang lain menduduki tikarmu. Jika mereka melanggar, pukullah mereka dengan cara yang tidak membahayakan. Sebaliknya mereka punya hak atasmu. Yaitu nafkah dan pakaian yang pantas. Kuwariskan kepadamu sekalian suatu pedoman hidup, yang jika kalian berpegang teguh kepadanya yaitu Al Qur`an. Kalian semua akan ditanya mengenai diriku, lalu bagaimana nanti jawab kalian?\" mereka menjawab: \"Kami bersaksi bahwa Anda benar-benar telah menyampaikan risalah, Anda telah menunaikan tugas dan telah memberi nasehat kepada kami.\" Kemudian beliau bersabda sambil mengangkat jari telunjuknya ke atas langit dan menunjuk kepada orang banyak: \"Ya, Allah saksikanlah, Ya Allah saksikanlah, ya Allah saksikanlah.\" Sesudah itu, beliau adzan kemudian qamat, lalu shalat Zhuhur. Lalu qamat lagi dan shalat Ashar tanpa shalat sunnah antara keduanya. Setelah itu, beliau meneruskan perjalanan menuju tempat wukuf. Sampai di sana, dihentikannya unta Qashwa di tempat berbatu-batu dan orang-orang yang berjalan kaki berada di hadapannya. Beliau menghadap ke kiblat, dan senantiasa wukuf sampai matahari terbenam dan mega merah hilang. Kemudian beliau teruskan pula perjalanan dengan membonceng Usamah di belakangnya, sedang beliau sendiri memegang kendali. Beliau tarik tali kekang Unta Qashwa, hingga kepalanya hampir menyentuh bantal pelana. Beliau bersabda dengan isyarat tangannya: \"Saudara-saudara, tenanglah, tenanglah.\" Setiap beliau sampai di bukit, beliau dikendorkannya tali unta sedikit, untuk memudahkannya mendaki. Sampai di Muzdalifah beliau shalat Maghrib dan Isya`dengan satu kali adzan dan dua qamat tanpa shalat sunnah antara keduanya. Kemudian beliau tidur hingga terbit fajar. Setelah tiba waktu Shubuh, beliau shalat Shubuh dengan satu Adzan dan satu qamat. Kemudian beliau tunggangi pula unta Qaswa meneruskan perjalanan sampai ke Masy'aril Haram. Sampai di sana beliau menghadap ke kiblat, berdo'a, takbir, tahlil dan membaca kaliamat tauhid. Beliau wukuf di sana hingga langit kekuning-kuningan dan berangkat sebelum matahari terbit sambil membonceng Fadlal bin Abbas. Fadlal adalah seorang laki-laki berambut indah dan berwajah putih. Ketika beliau berangkat, berangkat pulalah orang-orang besertanya. Fadlal menengok pada mereka, lalu mukanya ditutup oleh Rasulullah shallallahu 'alaihi wasallam dengan tangannya. Tetapi Fadlal menoleh ke arah lain untuk melihat. Rasulullah shallallahu 'alaihi wasallam menutup pula mukanya dengan tangan lain, sehingga Fadlala mengarahkan pandangannya ke tempat lain. Sampai di tengah lembah Muhassir, dipercepatnya untanya melalui jalan tengah yang langsung menembus ke Jumratul Kubra. Sampai di Jumrah yang dekat dengan sebatang pohon, beliau melempar dengan tujuh buah batu kerikil sambil membaca takbir pada setiap lemparan. Kemudian beliau terus ke tempat penyembelihan kurban. Di sana beliau menyembelih enam puluh tiga hewan kurban dengan tangannya dan sisanya diserahkannya kepada Ali untuk menyembelihnya, yaitu hewan kurban bersama-sama dengan anggota jama'ah yang lain. Kemudian beliau suruh ambil dari setiap hewan kurban itu sepotong kecil, lalu disuruhnya masak dan kemudian beliau makan dagingnya serta beliau minum kuahnya. Sesudah itu, beliau naiki kendaraan beliau menuju ke Baitullah untuk tawaf. Beliau shalat Zhuhur di Makkah. Sesudah itu, beliau datangi Bani Abdul Muthalib yang sedang menimba sumur zamzam. Beliau bersabda kepada mereka: \"Wahai Bani Abdul Muthalib, berilah kami minum. Kalaulah orang banyak tidak akan salah tangkap, tentu akan kutolong kamu menimba bersama-sama.\" Lalu mereka timbakan seember, dan beliau pun minum daripadanya. Dan Telah meceritakan kepada kami [Umar bin Hafsh bin Ghiyats] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Ja'far bin Muhammad] telah menceritakan kepadaku [bapakku] ia berkata; Saya mendatangi [Jabir bin Abdullah] dan bertanya kepadanya tentang haji Rasulullah shallallahu 'alaihi wasallam. lalu ia pun menyebutkan hadits yang serupa dengan haditsnya Hatim bin Isma'il, dan ia menambahkan di dalamnya; Dulu orang-orang disuruh oleh Abu Sayyarah untuk menaiki Himar telanjang. Dan ketika Rasulullah shallallahu 'alaihi wasallam melewati Muzdalifah di Masy'aril Haram, orang-orang Quraisy tidak ragu sedikit pun bahwa beliau akan berhenti di situ dan akan menjadi tempat persinggahannya nanti. Namun beliau melewatinya dan tidak singgah hingga beliau sampai di Arafah dan singgah di sana",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 160
			}
		}
	]
}