{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2959,
			"arabicnumber": "1221.03",
			"text": "Dan Telah meceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Sufyan] dari [Qais] dari [Thariq bin Syihab] dari [Abu Musa] radliallahu 'anhu, ia berkata; Aku mendatangi Rasulullah shallallahu 'alaihi wasallam saat beliau menambatkan kendaraannya di Bathha`. Beliau bertanya kepadaku: \"Dengan bacaan apa kamu melakukan Ihlal (bacaan niat untuk ihram).\" Saya menjawab, \"Dengan Ihlal sebagaimana Ihlal-nya Nabi shallallahu 'alaihi wasallam.\" beliau bertanya lagi: \"Apakah kamu membawa Hadyu (hewan kurban)?\" saya menjawab, \"Tidak.\" Beliau bersabda: \"Kalau begitu, lakukanlah thawaf di Baitullah, dan sa'i antara Shafa dan Marwa kemudian kamu bertahallul.\" Maka aku pun melakukan thawaf di Baitullah dan Sa'i antara Shafa dan Marwah. Setelah itu, aku mendatangi seorang wanita dari kaummu, lalu wanita itu mengeramasi dan menyisir rambutku. Akhirnya aku menyampaikan hal itu kepada manusia pada masa pemerintahan Abu Bakar dan Umar radliallahu 'anhuma. Saat aku berdiri di pasar Al Mausim, tiba-tiba seorang laki-laki datang dan berkata, \"Sesungguhnya Anda tidak tahu kebijakan apa yang akan diberikan Amirul mukminin mengenai tatara cara Manasik Haji.\" Maka aku pun berkata, \"Wahai sekalian manusia, barangsiapa yang telah melaksanakan dari apa yang telah aku fatwakan, maka hendaklah dia tangguhkan karena amirul mukminin akan segera datang, karena itu sempurnakanlah haji kalian bersamanya.\" Ketika Umar datang aku bertanya padanya, \"Wahai Amirul Mukminin, kebijakan apa yang telah Anda ambil terkait dengan tata cara Nusuk?\" Umar menjawab, \"Jika kita mengambil (hukum) dari Kitabullah, maka Allah telah berfirman: 'Sempurnakanlah haji dan umrah untuk Allah...' Namun, bila kita mengambil dari sunnah Nabi kita shallallahu 'alaihi wasallam, maka beliau tidaklah bertahallul hingga beliau menyembelih hadyu.\" Dan telah meceritakan kepadaku [Ishaq bin Manshur] dan [Abdu bin Humaid] keduanya berkata, telah mengabarkan kepada kami [Ja'far bin Aun] telah mengabarkan kepada kami [Abu Umais] dari [Qais bin Muslim] dari [Thariq bin Syihab] dari [Abu Musa] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutusku ke negeri Yaman, dan waktu itu bertepatan dengan musim haji. Maka Rasulullah shallallahu 'alaihi wasallam bertanya kepadaku: \"Wahai Abu Musa, apa yang kamu baca ketika kamu memulai ihram?\" saya menjawab, \"LABBAIKA IHLAALAN KAIHLAALIN NABI SHALLALLAHU 'ALAIHI WASALLAM (Dengan Ihlal sebagaimana Ihlal-nya Nabi shallallahu 'alaihi wasallam).\" beliau bertanya lagi: \"Apakah kamu membawa hadya (hewan kurban)?\" saya menjawab, \"Tidak.\" Beliau bersabda: \"Berangkat dan lakukanlah thawaf di Baitullah, dan Sa'i antara Shafa dan Marwa, kemudian kamu bertahallul.\" Dan ia pun menyebutkan hadits sebagaiaman haditsnya Syu'bah dan Sufyan",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 168
			}
		}
	]
}