{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3245,
			"arabicnumber": "1333.06",
			"text": "Telah menceritakan kepada kami [Hannad bin As Sariya] Telah menceritakan kepada kami [Ibnu Abu Zaidah] telah mengabarkan kepadaku [Ibnu Abu Sulaiman] dari [Atha`] ia berkata; Ketika Baitullah terbakar pada masa Yazid bin Mu'awiyah tatkala diperangi oleh penduduk Syam, dia perintahkan agar Baitullah dibiarkan apa adanya. [Ibnu Zubair] juga membiarkannya hingga orang-orang datang pada musim haji dengan maksud agar Ibnu Zubair bisa menggerakkan orang-orang itu untuk melawan penduduk Syam. Setelah orang-orang pergi ke Baitullah, Ibnu Zubair berkata, \"Saudara-saudara, berilah aku petunjuk (saran) tentang Ka'bah! Apakah aku harus membongkarnya lalu aku membangun kembali, akau aku perbaiki bagian-baigian yang rusak saja?\" Ibnu Abbas menjawab, \"Aku mempunyai pendapat tentang Ka'bah tersebut. Menurutku, sebaiknya Anda memperbaiki bagian-bagian yang rusak saja dan biarkanlah Baitullah dalam keadaan seperti ketika orang-orang dulu baru mulai memeluk Islam. Biarkan pula batu-batu seperti ketika orang-orang baru mulai memeluk Islam dan seperti ketika Nabi shallallahu 'alaihi wasallam diutus.\" Ibnu Zubair mengingatkan, \"Seandainya salah seorang diantara kalian rumahnya terbakar, tentu ia tidak akan rela sehingga dia membangunnya kembali dengan sebaik-baiknya, padahal ini adalah rumah Rabb kalian. sesungguhnya aku akan beristikharah untuk meminta petunjuk kepada Rabb-ku selama tiga kali, baru kemudian aku akan menetunkan keputusanku.\" Setelah tiga kali istikharah, maka Ibnu Zubair memastikan pendapatnya untuk membongkar Ka'bah. Orang-orang menghindari dari Baitullah, jangan-jangan ada bencana dari atas yang akan menimpa orang yang naik ke Baitullah kali pertama, sehingga ada seorang memanjat lalu menjatuhkan batunya. Setelah orang-orang melihat tidak ada sesuatu yang menimpa pemanjat tersebut, barulah orang-orang berduyun-duyun merobohkannya hingga rata dengan tanah. Kemudian Ibnu Zubair memancangkan beberapa tiang lalu memasang tabir sampai kemudian bangunan tersebut meninggi. Ibnu Zubair berkata; Aku pernah mendengar [Aisyah] berkata bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Seandainya orang-orang tidak baru saja meninggalkan kekufuran dan seandainya aku mempunyai biaya yang cukup untuk membangun Baitullah sekarang ini, maka tentu aku sudah memasukkan hijr dan aku buat satu pintu masuk serta satu pintu keluar.\" Ibnu Zubair berkata, \"Sekarang aku sudah mempunyai biaya dan aku tidak khawatir terhadap keimanan kaum muslimin.\" Atha berkata; Lalu Ibnu Zubair menambah luas Baitullah sebanyak lima hasta di bagian Hijr, kemudian ia menjelaskan posisi pondasi dengan dilihat orang banyak., lalu diantas pondasi itu didirikan bangunan. Panjang Ka'bah semual dua belas hasta tetapi setelah diperluas maka panjangnya tampak pendek, sehingga panjangnya ditambah sepuluh hasta. Lalu dibuat dua pintu, satu pintu masuk, dan satu pintu keluar. Setelah Ibnu Zubair terbunuh, Al Hajjaj mengirim surat kepada Abdul Malik bin Marwan untuk memberitahukan hal itu kepadanya, juga untuk memberitahukan bahwa Ibnu Zubair telah membuat bangunan di pondasi yang telah dilihat oleh kebanyakan penduduk Makkah. Jadi Abdul Malik membalas surat Al Hajjaj; \"Kami sedikit pun tidak mengikuti kesalahan Ibnu Zubair. Tentang penambahan panjang Ka'bah oleh Ibnu Zubair, maka aku tetapkan, adapun penambahan luas Ka'bah di Hijr oleh Ibnu Zubair, maka kembalikanlah seperti keadaan sebelumnya dan tutuplah pintu yang dibuat oleh Ibnu Zubair.\" Lalu Ibnu Hajjaj pun membongkar Ka'bah dan mengembalikannya seperti keadaan semula",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 449
			}
		}
	]
}