{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3691,
			"arabicnumber": "1479.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami ['Umar bin Yunus Al Hanafi] telah menceritakan kepada kami [Ikrimah bin 'Ammar] dari [Simak Abu Zumail] telah menceritakan kepadaku ['Abdullah bin Abbas] telah menceritakan kepadaku [Umar bin Al Khaththab] dia berkata; Ketika Nabi shallallahu 'alaihi wasallam mengasingkan diri dari para istrinya. Dia (umar) melanjutkan; Lalu saya memasuki masjid dan saya lihat orang-orang sedang memain-mainkan kerikil. Mereka semua berkata; Rasulullah shallallahu 'alaihi wasallam telah menceraikan para istrinya, kejadian itu terjadi sebelum ada perintah hijab, maka Umar berkata; Kemudian saya berkata; Saya ingin tahu kepastiannya sekarang juga. Dia melanjutkan; Lalu saya menemui Aisyah sambil bertanya; Wahai putri Abu Bakar, belum puas jugakah kamu menyakiti hati Rasulullah shallallahu 'alaihi wasallam? Dia menjawab; Apa urusanku denganmu wahai Ibnul Khaththab! Sebaiknya kamu mengurusi tempatmu sendiri (maksudnya disuruh untuk menasehati Hafshah putrinya), dia (Umar) melanjutkan; Kemudian saya menemui Hafshah binti Umar, lantas saya berkata kepadanya; Wahai Hafshah, sudah puaskah kamu menyakiti hati Rasulullah shallallahu 'alaihi wasallam, sungguh kamu telah mengerahui bahwa Rasulullah shallallahu 'alaihi wasallam tidak mencintaimu, kalau bukan karenaku, niscaya Rasulullah shallallahu 'alaihi wasallam telah menceraikanmu, karena itu dia (Hafshah) menangis sejadi-jadinya. Lalu saya bertanya kepadanya; Di manakah sekarang Rasulullah shallallahu 'alaihi wasallam? Dia menjawab; Beliau ada di ruangan pribadinya. Kemudian saya pergi untuk menemui beliau, tiba-tiba saya bertemu dengan Rabah, seorang pelayan Rasulullah shallallahu 'alaihi wasallam, sedang duduk dengan menjulurkan kakinya di atas kayu yang berada di depan pintu ruangan, yaitu kayu yang dibuat tangga Rasulullah shallallahu 'alaihi wasallam untuk naik, lantas saya memanggilnya; wahai Rabah, mintakanlah saya izin untuk bertemu Rasulullah shallallahu 'alaihi wasallam! Kemudian Rabah menengok ke ruangan lalu memandangku tanpa mengatakan suatu apa pun, lalu saya memanggilnya dengan agak keras; Wahai rabah, mintakanlah saya izin untuk menemui Rasulullah shallallahu 'alaihi wasallam, sebab saya mengira, bahwasannya Rasulullah shallallahu 'alaihi wasallam tahu jika kedatanganku karena Hafshah, demi Allah seandainya Rasulullah shallallahu 'alaihi wasallam memerintahkanku untuk memenggal lehernya, sungguh saya akan memenggal lehernya! Perkataanku itu saya katakan dengan nada yang keras. Kemudian dia memberi isyarat supaya saya naik. Saya langsung menemui Rasulullah shallallahu 'alaihi wasallam, dan beliau sedang berbaring di atas tikar, lantas saya duduk di dekat beliau, sewaktu beliau membetulkan sarungnya, terlihat olehku bekas tikar di tulang rusuk beliau, kuperhatikan di tempat penyimpanan barang, ternyata saya tidak mendapati apa-apa, kecuali sekantong gandum kira-kira satu sha' dan seukuran qarazh berada di sudut ruangan dan sehelai kulit yang menggantung, (Umar) melanjutkan; (Melihat keadaan seperti itu) air mataku menetes, lalu beliau bertanya: \"Kenapa kamu menangis wahai Ibnul Khaththab?\" Saya menjawab; Wahai Nabiyullah, bagaimana saya tidak menangis, sebab saya melihat tikar ini membekas di rusuk anda, dan saya tidak melihat sesuatu pun di tempat penyimpanan barang anda ini selain apa yang telah saya lihat, padahal istana Persia dan kekaisaran Romawi berlimpah-limpah dengan buah-buahan dan sungai-sungai, sedangkan anda adalah Rasulullah shallallahu 'alaihi wasallam dan orang pilihan-Nya, hanya beginilah tempat penyimpanan barang anda! Beliau bersabda: \"Hai Ibnul Khaththab, tidak sukakah kamu jika akhirat untuk kita sedangkan dunia untuk mereka?\" Saya menjawab; Tentu. Ketika saya masuk menemui beliau, seakan-akan wajah beliau sedang marah, lantas saya bertanya; Wahai Rasulullah, apakah yang menyusahkan anda perihal istri-istri anda? Jika anda menceraikan mereka, maka Allah dan sekalian Malaikat-Nya, Jibril, Mika`il, saya sendiri dan Abu Bakar serta orang-orang yang beriman akan tetap bersama anda. Dan saya belum pernah mengucapkan kata-kata seperti itu kepada beliau sambil memuji Allah, kecuali saya berharap semoga Allah membenarkan ucapanku kepada beliau, kemudian turunlah ayat pilhan berikut ini: \"Jika Nabi menceraikanmu sekalian, mungkin Rabbnya akan mengganti baginya dengan istri-istri yang lebih baik dari kalian.\" \"Dan jika kamu berdua saling membantu untuk menyusahkan Nabi, maka sesungguhnya Allah adalah Pelindungnya, begitu pula Jibril dan orang-orang Mukmin yang shalih serta seluruh Malaikat adalah penolongnya pula.\" Sedangkan Aisyah dan Hafshahlah yang bekerja sama berdemo dan mempengaruhi istri-istri Nabi shallallahu 'alaihi wasallam yang lain, lalu saya berkata; Wahai Rasulullah, apakah anda menceraikan mereka? Beliau menjawab: \"Tidak.\" Saya melanjutkan; Wahai Rasulullah, ketika saya memasuki masjid, saya melihat kaum Muslimin sedang mempermainkan kerikil sambil berkata; Rasulullah shallallahu 'alaihi wasallam telah menceraikan para istrinya. Apakah saya harus turun dan menjelaskan kepada mereka bahwa anda tida menceraikan mereka? Beliau menjawab; \"Ya, jika kamu mau.\" Saya senantiasa berbicara dengan beliau, hingga hilang kesan marah dari wajah beliau dan berganti dengan senyuman. Dan beliau adalah manusia yang mimiliki deretan gigi paling baik. Kemudian Nabiyullah shallallahu 'alaihi wasallam turun, saya pun turun dengan berpegangan batang pohon kurma, sedangkan Rasulullah shallallahu 'alaihi wasallam turun layaknya berjalan di atas bumi, tidak berpegangan dengan apapun, lalu saya berkata; Wahai Rasulullah, padahal anda di ruangan itu baru dua puluh sembilan hari! beliau bersabda: \"Sesungguhnya hari itu hanya dua puluh sembilan hari.\" Lantas saya berdiri di depan pintu masjid sambil menyeru dengan suara yang lantang bahwa Rasulullah shallallahu 'alaihi wasallam tidak menceraikan para istri beliau. Kemudian turunlah ayat: \"Dan apabila datang kepada mereka suatu berita yang menyenangkan dan menakutkan, mereka langsung menyiarkannya. Padahal, apabila mereka menyerahkannya kepada Allah dan pemimpin (ulil Amri) di antara mereka, tentulah orang-orang yang ingin suatu kepastian tentang kebenarannya akan mengetahuinya dari mereka.\" Dan sayalah yang memastikan kebenaran berita tersebut, kemudian Allah Azza Wa Jalla menurunkan ayat pilihan (yaitu Al Ahzab: 28-29)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 40
			}
		}
	]
}