{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 409,
			"arabicnumber": "161.04",
			"text": "Dan telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [al-Walid bin Muslim] telah menceritakan kepada kami [al-Auza'i] dia berkata, saya mendengar [Yahya] berkata, saya bertanya kepada [Abu Salamah], \"Ayat Al Quran apa yang diturunkan dulu?\" Dia lalu membaca: '(Hai orang-orang yang berselimut) ' (Surat Al Mudatstsir). Maka aku berkata, \"Atau (mungkin surat) iqara'.\" Kekudian aku bertanya kepada [Jabir bin Abdullah], \"Ayat al-Qur'an apa yang diturunkan lebih dulu?\" Dia lalu membaca: '(Hai orang-orang yang berselimut) ' (Surat Al Mudatstsir). Maka aku berkata, \"Atau (mungkin surat) iqara'.\" Jabir berkata, \"Aku telah menceritakan kepadamu sesuatu yang telah diceritakan Rasulullah shallallahu 'alaihi wasallam kepada kami. Beliau bersabda: \"Saya beriktikaf di Gua Hira' selama sebulan, ketika aku telah menyelesaikan iktikafku, maka aku turun, menuruni dasar lembah, lalu aku dipanggil. Maka aku pun melihat ke depanku dan ke belakangku, ke kanan dan ke kiri, tetapi aku tidak melihat seorang pun, kemudian aku dipanggil lagi, lalu aku melihat, namun tidak ada seorang pun, kemudian aku dipanggil, maka aku mendongakkan kepalaku, ternyata dia di atas Arsy di udara, yaitu Jibril. Kemudian aku pun menjadi kemetaran. Lalu aku mendatangi Khadijah dan kukatakan, \"Selimutilah aku, selimutilah aku! maka dia mengguyurkan air kepadaku, lalu Allah menurunkan ayat: '(Wahai orang yang berselimut! Bangunlah serta berilah peringatan, dan Rabbmu maka agungkanlah, dan bajumu maka sucikanlah) ' (Qs. Al Mudatstsir: 1-4). Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Ali bin al-Mubarak] dari [Yahya bin Abu Katsir] dengan sanad ini, dan dia menyebutkan, \"Ternyata dia duduk di atas Arsy antara langit dan bumi",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 314
			}
		}
	]
}