{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"26": "The Book of Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4245,
			"arabicnumber": "1641.01",
			"text": "Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Ali bin ujr As Sa'di] sedangkan lafadznya dari Zuhair keduanya berkata, telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallib] dari ['Imran bin Hushain] dia berkata, bahwa Tsaqif adalah pelayan Bani 'Uqail, lalu bani Tsaqif menawan dua sahabat Nabi shallallahu 'alaihi wasallam, sementara sahabat Rasulullah shallallahu 'alaihi wasallam menawan seseorang dari bani 'Uqail bersama dengan seekor untanya. Rasulullah shallallahu 'alaihi wasallam kemudian mendatanginya sementara ia dalam keadaan terikat, laki-laki tawanan itu berkata, \"Wahai Muhammad!\" Beliau menimpalinya: \"Ada apa denganmu?\" laki-laki itu berkata, \"Apa alasanmu menawanku, dan apa alasanmu menawan unta pacuanku yang larinya cepat?\" beliau menjawab: \"Itu aku lakukan sebagai pembalasan karena dosa sekutumu, Tsaqif!\" Kemudian beliau beranjak pergi. Laki-laki itu kembali menyeru beliau seraya mengatakan, \"Wahai Muhammad, wahai Muhammad!\" -Rasulullah shallallahu 'alaihi wasallam adalah sosok yang pengasih lagi santun- lalu beliau kembali menemuinya dan bersabda: \"Apa keperluanmu?\" laki-laki itu menjawab, \"Sekarang saya muslim.\" Beliau bersabda: \"Sekiranya yang kamu katakan benar, sedangkan kamu dapat mengendalikan urusanmu, sungguh kamu akan mendapatkan segala keberuntungan.\" Kemudian beliau beranjak pergi, namun laki-laki itu menyerunya sambil berkata, \"Wahai Muhammad, wahai Muhammad.\" Beliau lalu menemuinya sambil bersabda: \"Apa keperluanmu?\" laki-laki itu berkata, \"Aku lapar maka berilah makan kepadaku, dan aku juga haus maka berilah aku minum!\" Beliau bersabda: \"Ini kebutuhanmu.\" Dikemudian hari, laki-laki itu ditebus dengan dua orang (sahabat Nabi).\" Imran berkata, \"Lalu seorang wanita Anshar tertawan (musuh) bersama dengan unta beliau yang biasa disebut dengan Adlba`, wanita Anshar tersebut dalam keadaan terikat, sedangkan waktu itu orang-orang (para perampok) tengah beristirahat, sementara unta-unta (hasil curian) mereka kandangkan di depan persinggahan-persinggahan mereka. Kemudian wanita Anshar tersebut dapat melepaskan dari ikatannya, dan segera mendatangi kandang unta, namun setiap kali ia datangi unta untuk dikendarai, unta itu mendengus-dengus, ia pun meninggalkannya hingga ia temui 'adlba'. Jadilah ia mengendarai unta penurut yang sudah terlatih itu di bagian belakangnya. Lalu ia menghardiknya hingga berlari kencang. Orang-orang yang ketiduran pun kaget dengan kaburnya wanita Anshar tersebut, lalu mereka mengejarnya, namun mereka tidak dapat menagkapnya. Wanita itu sempat bernadzar, bahwa jika Allah menyelamatkannya, maka ia akan sembelih unta 'adlba' itu. Sesampainya di Madinah, orang-orang melihat unta tersebut, lalu mereka berkata, \"Ini adalah Al Adlba', unta Rasulullah shallallahu 'alaihi wasallam!.\" Wanita itu berkata (dengan redaksi), \"Apabila Allah menyelamatkannya, sungguh unta tersebut akan disembelihnya.\" Lalu orang-orang menemui Rasulullah shallallahu 'alaihi wasallam dan memberitahukan kepada beliau tentang nadzarnya. Maka Rasulullah shallallahu 'alaihi wasallam berkomentar: \"Subhanallah, alangkah jahatnya pembalasan ia kepadanya, ia bernadzar kepada Allah apabila Allah menyelamatkannya, maka ia akan menyembelihnya, tidak ada kewajiban melaksanakan nadzar dalam kemaksiatan kepada Allah dan tidak pula terhadap sesuatu yang tidak dimiliki oleh seorang hamba.\" Dalam riwayat Ibnu Hujr, di sebutkan; \"Tidak ada nadzar dalam bermaksiat kepada Allah.\" Telah menceritakan kepada kami [Abu Ar Rabi' Al 'Ataki] telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ibnu Abu Umar] dari [Abdul Wahhab Ats Tsaqafi] keduanya dari [Ayyub] dengan sanad seperti ini. Dan dalam hadits Hammad, dia menyebutkan, \"Adlba' adalah unta milik seorang dari Bani 'Uqail, dan ia termasuk dari unta yang sangat cepat larinya.\" Dan dalam haditsnya juga disebutkan, \"Lalu wanita (Anshar) itu mendatangi seekor unta yang sangat terlatih.\" Dan dalam hadits At Tsaqafi disebutkan dengan redaksi, \"Naqatun Mudarrabatun (Unta yang terlatih)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 11
			}
		}
	]
}