{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4265,
			"arabicnumber": "1649.03",
			"text": "Telah menceritakan kepadaku [Abu Rabi' Al Ataki] telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- dari [Ayyub] dari [Abu Qilabah] dan dari [Qasim bin 'Ashim] dari [Zahdam Al Jarmi] -Ayyub berkata; dan aku lebih hafal dengan hadits Abu Qilabah- dia berkata, \"Kami berada di sisi [Abu Musa], lalu dia menyuguhkan kepadaku hidangan yang terdapat daging ayam, selang beberapa saat, ada seorang laki-laki dari Bani Taimillah berkulit merah seperti seorang budak masuk ke rumah, maka dia memanggilnya, \"Kesinilah.\" Dia pun menolaknya. Abu Musa memanggilnya lagi, \"Kesinilah, sungguh aku pernah melihat Rasulullah shallallahu 'alaihi wasallam pernah memakannya.\" Laki-laki itu mejawab, \"Sesungguhnya aku pernah melihat beliau memakan sesuatu, karena merasa jijik maka aku menjauhinya, setelah itu aku bersumpah untuk tidak memakannya lagi.\" Abu Musa menjawab, \"Kemarilah, aku akan menceritakan kepadamu mengenai hal itu, sungguh aku pernah mendatangi Rasulullah shallallahu 'alaihi wasallam beserta sekelompok orang dari Bani Asy'ariyah, untuk meminta kepada beliau kendaraan sebagai pengangkut perbekalan, lalu beliau bersabda: \"Demi Allah, aku tidak dapat membawa perbekalan kalian, dan sungguh aku tidak memiliki sesuatupun untuk dapat mengangkut perbekalan kalian.\" Kami terdiam beberapa saat -sebagaimana yang dikehendaki Allah-, tiba-tiba Rasulullah shallallahu 'alaihi wasallam diberi beberapa ekor unta, lalu beliau memanggil kami dan memerintahkan kepada kami supaya membawa lima ekor unta yang semuanya berwarna putih.\" Abu Musa melanjutkan, \"Tatkala kami berangkat, sebagian kami saling berkata kepada sebagian lainnya, 'Sepertinya Allah tidak memberkahi kita, sebab Rasulullah shallallahu 'alaihi wasallam telah menyalahi sumpahnya'.\" Lantas kami kembali menemui beliau seraya berkata, \"Wahai Rasulullah, Kami tadi menemui anda dan meminta kepadamu supaya anda dapat membawa perbekalan kami, dan anda terlanjur bersumpah bahwa anda tidak dapat membantu membawakan perbekalan kami, namun beberapa saat anda dapat membantu membawa perbekalan kami, apakah anda lupa wahai Rasulullah?\" beliau menjawab; \"Demi Allah, sungguh-Insya Allah-, tidaklah aku bersumpah lalu melihat yang lebih baik dari itu (sumpah), kecuali aku akan mengambil yang lebih baik dan akan aku bayar kafarahnya. Oleh karena itu berangkatlah kalian, sesungguhnya yang menanggung kalian adalah Allah Azza Wa Jalla.\" Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Abdul Wahab At Tsaqafi] dari [Ayyub] dari [Abu Qilabah] dan [Qasim At Tamimi] dari [Zahdam Al Jarmi] dia berkata; \"Bahwa antara penduduk kampung ini yaitu dari Jarm dan Kaum Asy'ariyun masih ada ikatan kecintaan dan persaudaraan, dan saat itu kami berada di samping Abu Musa Al Asy'ari dan dia menyuguhkah kepadanya suatu hidangan yang terdapat daging ayam…\" kemudian dia menyebutkan seperti riwayat di atas. Dan telah menceritakan kepadaku [Ali bin Hujr As Sa'di] dan [Ishaq bin Ibrahim] serta [Ibnu Numair] dari [Isma'il bin 'Ulayyah] dari [Ayyub] dari [Al Qasim At Tamimi] dari [Zahdam Al Jarmi]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Abu Qilabah] dari [Zahdam Al Jarmi]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Abu Bakar bin Ishaq] telah menceritakan kepada kami [Affan bin Muslim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dan [Qasim] dari [Zahdam Al Jarmi] dia berkata; \"Kami pernah berada di samping [Abu Musa] …\" kemudian mereka menceritakan hadits-hadits yang semakna dengan hadits Hammad bin Zaid. Dan telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [As Sha'q yaitu Ibnu Hazn] telah menceritakan kepada kami [Mathar Al Warraq] telah menceritakan kepada kami [Zahdam Al Jarmi] dia berkata; \"Aku pernah menemui [Abu Musa], saat itu dia sedang memakan daging ayam …\" kemudian dia melanjutkan hadits itu seperti hadits mereka, namun dia sedikit menambahkan; Beliau bersabda: \"Demi Allah, aku tidak lupa",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		}
	]
}