{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4342,
			"arabicnumber": "1669.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Yahya] -yaitu Ibnu Sa'id- dari [Busyair bin Yasar] dari [Sahal bin Abu Hatsmah] - [Yahya] berkata; dan aku mengira dia berkata- dari [Rafi' bin Khadij] bahwa keduanya berkata, \"Abdullah bin Sahl bin Zaid dan Muhayishah bin Mas'ud bin Zaid pernah melakukan safar, hingga ketika mereka sampai di Khaibar, mereka berdua berpisah, Tidak beberapa lama Muhayishah mendapati Abdullah telah terbunuh, dia pun menguburkannya. Sesudah itu dia datang menghadap Rasulullah shallallahu 'alaihi wasallam bersama-sama dengan Huwaishah bin Mas'ud dan Abdurrahman bin Sahl. Sedangkan Abdurrahman adalah yang paling muda di antara mereka, tetapi Abdurrahman yang lebih dahulu berbicara daripada saudara sepupunya itu. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulukanlah yang lebih tua umurnya.\" Maka ia pun diam dan kedua saudaranya lalu angkat bicara. Keduanya menceritakan kepada beliau bahwa Abdullah bin Sahal telah terbunuh, lalu Rasulullah shallallahu 'alaihi wasallam bertanya kepada mereka: \"Maukah kalian bersumpah lima puluh kali? Jika kalian mau bersumpah, maka kalian berhak menuntut balas atas kematian saudara kalian.\" Mereka menjawab, \"Bagaimana kami harus bersumpah, sedangkan kami tidak menyaksikan terjadinya pembunuhan itu.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika begitu maka orang-orang Yahudi akan bebas dari kalian dengan lima puluh sumpah yang mereka lakukan.\" Mereka menjawab, \"Bagaimana mungin kami dapat menerima sumpah orang kafir itu?\" melihat kondisi seperti itu, akhirnya Rasulullah shallallahu 'alaihi wasallam memberikan diyatnya (tebusannya)",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 1
			}
		}
	]
}