{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4354,
			"arabicnumber": "1671.02",
			"text": "Telah menceritakan kepada kami [Abu Ja'far Muhammad bin As Shabah] dan [Abu Bakar bin Abu Syaibah] dan ini adalah lafadz Abu Bakar, dia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah] dari [Hajjaj bin Abu Utsman] telah menceritakan kepadaku [Abu Raja`] bekas budak Abu Qilabah, dari [Abu Qilabah] telah menceritakan kepadaku [Anas], bahwa sekelompok orang dari Bani 'Ukl yang berjumlah delapan orang datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu mereka membai'at beliau atas Islam. Tidak beberapa lama mereka sakit karena tidak terbiasa dengan iklim Kota Madinah. Mereka kemudian mengadu kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Maukah kamu pergi ke unta-unta yang sedang digembalakan, lalu kamu meminum susu dan air kencingnya?\" mereka menjawab, \"Tentu.\" Kemudian mereka pergi ke unta-unta tersebut dan meminum susu dan air kencingnya hingga mereka sehat seperti biasa, setelah itu mereka membunuh pengembala dan merampas unta-untanya. Setelah peristiwa tersebut sampai kepada Rasulullah shallallahu 'alaihi wasallam, beliau mengutus untuk mengejar mereka sampai dapat, setelah mereka tertangkap dan dibawa ke hadapan beliau, maka beliau memerintahkan supaya tangan dan kaki mereka dipotong dan dicongkel mata mereka. Setelah itu, mereka kemudian dilemparkan di bawah terik matahari yang sangat panas, sehingga mereka mati terkapar.\" [Ibnu Shabah] menyebutkan dalam riwayatnya, \"Mereka merampas unta-untanya.\" Dan ia juga menyebutkan, \"Kemudian mata mereka dicongkel.\" Dan telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Raja`] bekas budak Abu Qilabah, dia berkata; [Abu Qiabah] berkata; telah menceritakan kepada kami [Anas bin Malik] dia berkata, \"Beberapa orang dari kaum 'Ukl atau 'Urainah datang kepada Nabi shallallahu 'alaihi wasallam, lalu mereka sakit karena udara Madinah sangat dingin. Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan mereka supaya pergi ke sekumpulan unta (zakat) untuk meminum susu dan air kencingnya …\", semakna dengan hadits Hajjaj bin Abu Utsman, dia menyebutkan, \"Kemudian mata mereka di congkel dan badan mereka dilemparkan di bawah terik matahari hingga mereka meminta disirami air, dan tidak ada seorang pun yang diberi air.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Mua'dz bin Mu'adz]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Utsman An Naufali] telah menceritakan kepada kami [Azhar As Saman] keduanya berkata; telah menceritakan kepada kami [Ibnu 'Aun] telah menceritakan kepada kami [Abu Raja`] bekas budak Abu Qilabah, dari [Abu Qilabah] dia berkata, \"Aku penah duduk di belakang Umar bin Abdul Aziz, lalu dia berkata kepada orang-orang, \"Apa pendapat kalian tentang qasamah?\" ['Anbasah] menjawab, \"Sungguh telah menceritakan kepada kami [Anas bin Malik] seperti ini dan ini, maka suya pun berkata; Anas juga pernah bercerita kepadaku bahwa sekelompok kaum datang kepada Nabi shallallahu 'alaihi wasallam …\", kemudian dia meneruskan hadits tersebut sebagaimana hadits Ayyub dan Hajjaj.\" Abu Qilabah berkata, \"Ketika aku selesai, Anbasah mengucapkan, \"Subhanallah!\" Abu Qilabah melanjutkan, \"Lalu aku berkata, \"Apakah kamu meragukan haditsku wahai 'Anbasah?\" dia menjawab, \"Tidak, seperti ini jugalah Anas bin Malik menceritakan kepada kami. Wahai penduduk Syam, kalian senantiasa dalam kebaikan selagi di antara kalian masih ada orang ini -atau- orang seperti ini.\" Dan telah menceritakan kepada kami [Al Hasan bin Abu Syua'ib Al Harrani] telah menceritakan kepada kami [Miskin] -yaitu Ibnu Bukair Al Harrani- telah mengabarkan kepada kami [Al Auza'i]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Qilabah] dari [Anas bin Malik] dia berkata, \"Sekelompok kaum dari 'Ukl yang berjumlah delapan orang datang kepada Rasulullah shallallahu 'alaihi wasallam …', seperti hadits mereka. Dan dalam haditsnya ada tambahan, \"Dan mereka dibiarkan darahnya mengucur.\" Dan telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Malik bin Isma'il] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Simak bin Harb] dari [Mu'awiyah bin Qurrah] dari [Anas] dia berkata, \"Sekelompok orang dari 'Urainah datang kepada Nabi shallallahu 'alaihi wasallam, kemudian mereka masuk Islam dan membai'at beliau. Selama tinggal di Madinah mereka sakit kepala dan sesak nafas…', kemudian dia menyebutkan seperti hadits mereka. Dan ada tambahan, \"Dan di samping beliau ada pemuda-pemuda Anshar yang jumlahnya sekitar dua puluh orang, kemudian beliau mengutus mereka dan juga seorang Qaif (orang yang ahli dalam mencari jejak) untuk mengejar para perampok.\" Telah menceritakan kepada kami [Haddab bin Khalid] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Anas]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] dan dalam haditsnya [Hammam] disebutkan, \"Sekelompok pemuda dari 'Urainah datang kepada Nabi shallallahu 'alaihi wasallam.\" Sedangan dalam haditsnya Sa'id disebutkan, 'Dari 'Ukl dan 'Urainah', seperti dalam hadits mereka",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 13
			}
		}
	]
}