{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4431,
			"arabicnumber": "1695.01",
			"text": "Dqan telah menceritakan kepadaku [Muhammad bin Al 'Ala Al Hamdani] telah menceritakan kepada kami [Yahya bin Ya'la] -yaitu Ibnu Al Harits Al Muharibi- dari [Ghailan] -yaitu Ibnu Jami' Al Muharibi- dari ['Alqamah bin Murtsad] dari [Sulaiman bin Buraidah] dari [ayahnya] dia berkata, \"Ma'iz bin Malik datang kepada Nabi shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, sucikanlah diriku.\" Rasulullah menjawab: \"Celaka kamu! Pulang dan mintalah ampun kepada Allah, dan bertaubatlah kepada-Nya.\" Kemudian Ma'iz pergi, tidak lama kemudian dia kembali lagi sambil berkata: \"Wahai Rasulullah, sucikanlah daku.\" Beliau menjawab: \"Celaka kamu! Pulang dan mintalah ampun kepada Allah, dan bertaubatlah kepada-Nya.\" Lalu Ma'iz pergi, tetapi belum begitu jauh dia pergi, dia kembali lagi dan berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah, sucikanlah daku.\" Beliau menjawab sebagaimana jawabannya yang pertama, dan hal itu berulang-ulang sampai empat kali. Pada kali yang ke empat, Rasulullah shallallahu 'alaihi wasallam bertanya: \"Dari hal apakah kamu harus aku sucikan?\" Ma'iz menjawab, \"Dari dosa zina.\" Rasulullah shallallahu 'alaihi wasallam bertanya kepada para sahabat yang ada di sekitar beliau: \"Apakah Ma'iz ini mengidap penyakit gila?\" lalu beliau diberitahu bahwa dia tidaklah gila.\" Beliau bertanya lagi: \"Apakah dia habis minum Khamr?\" lantas seorang laki-laki langsung berdiri untuk mencium bau mulutnya, namun dia tidak mendapapti bau khamr darinya.\" Buraidah melanjutkan, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bertanya: \"Betulkah kamu telah berzina?\" Dia menjawab, \"Ya, benar.\" Lantas beliau memerintahkan untuk ditegakkan hukuman rajam atas dirinya, lalu dia pun dirajam. Dalam permasalahan ini, orang-orang berbeda menjadi dua pendapat, yaitu; Ma'iz meninggal dan dosanya terhapuskan karena hukuman itu dijalaninya dengan ikhlas. Dan yang lain mengatakan bahwa Ma'iz bertaubat dengan sebenar-benarnya taubat, tiada taubat yang melebihi taubatnya Ma'iz. Dia datang menghadap Nabi shallallahu 'alaihi wasallam, lalu tangannya diletakkan di atas tangan beliau kemudian dia berkata, \"Wahai Rasulullah, rajamlah aku dengan batu.\" Dan mereka senantiasa dalam perbedaan pendapat seperti itu selama dua atau tiga hari. Kemudian Rasulullah shallallahu 'alaihi wasallam datang, setelah memberi salam beliau duduk bersama-sama dengan mereka, lalu beliau bersabda: \"Mintakanlah ampun bagi Ma'iz bin Malik.\" Lalu mereka memohonkan ampun untuknya, \"Semoga Allah mengampuni Ma'iz bin Malik.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh Ma'iz telah betaubat dengan sempurna, dan seandainya taubat Ma'iz dapat dibagi di antara satu kaum, pasti taubatnya akan mencukupi mereka semua",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 34
			}
		}
	]
}