{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4432,
			"arabicnumber": "1695.02",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] sedangkan lafadz haditsnya saling berdekatan, telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Basyir bin Muhajir] telah menceritakan kepada kami [Abdullah bin Buraidah] dari [ayahnya], bahwa Ma'iz bin Malik Al Aslami pergi menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, sesungguhnya aku telah menzhalimi diriku, karena aku telah berzina, oleh karena itu aku ingin agar anda berkenan membersihkan diriku.\" Namun beliau menolak pengakuannya. Keesokan harinya, dia datang lagi kepada beliau sambil berkata, \"Wahai Rasulullah, sesungguhnya aku telah berzina.\" Namun beliau tetap menolak pengakuannya yang kedua kalinya. Lalu Rasulullah shallallahu 'alaihi wasallam mengutus seseorang untuk menemui kaumnya dengan mengatakan: \"Apakah kalian tahu bahwa pada akalnya Ma'iz ada sesuatu yang tidak beres yang kalian ingkari?\" mereka menjawab, \"Kami tidak yakin jika Ma'iz terganggu pikirannya, setahu kami dia adalah orang yang baik dan masih sehat akalnya.\" Untuk ketiga kalinya, Ma'iz bin Malik datang menemui Rasulullah shallallahu 'alaihi wasallam untuk membersihkan dirinya dari dosa zina yang telah diperbuatnya. Lalu Rasulullah shallallahu 'alaihi wasallam pun mengirimkan seseorang menemui kaumnya untuk menanyakan kondisi akal Ma'iz, namun mereka membetahukan kepada beliau bahwa akalnya sehat dan termasuk orang yang baik. Ketika Ma'iz bin Malik datang keempat kalinya kepada beliau, maka beliau memerintahkan untuk membuat lubang ekskusi bagi Ma'iz. Akhirnya beliau memerintahkan untuk merajamnya, dan hukuman rajam pun dilaksanakan.\" Buraidah melanjutkan, \"Suatu ketika ada seorang wanita Ghamidiyah datang menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, diriku telah berzina, oleh karena itu sucikanlah diriku.\" Tetapi untuk pertama kalinya Rasulullah shallallahu 'alaihi wasallam tidak menghiraukan bahkan menolak pengakuan wanita tersebut. Keesokan harinya wanita tersebut datang menemui Rasulullah shallallahu 'alaihi wasallam sambil berkata, \"Wahai Rasulullah, kenapa anda menolak pengakuanku? Sepertinya anda menolak pengakuan aku sebagaimana pengakuan Ma'iz. Demi Allah, sekarang ini aku sedang mengandung bayi dari hasil hubungan gelap itu.\" Mendengar pengakuan itu, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya kamu ingin tetap bertaubat, maka pulanglah sampai kamu melahirkan.\" Setelah melahirkan, wanita itu datang lagi kepada beliau sambil menggendong bayinya yang dibungkus dengan kain, dia berkata, \"Inilah bayi yang telah aku lahirkan.\" Beliau lalu bersabda: \"Kembali dan susuilah bayimu sampai kamu menyapihnya.\" Setelah mamasuki masa sapihannya, wanita itu datang lagi dengan membawa bayinya, sementara di tangan bayi tersebut ada sekerat roti, lalu wanita itu berkata, \"Wahai Nabi Allah, bayi kecil ini telah aku sapih, dan dia sudah dapat menikmati makanannya sendiri.\" Kemudian beliau memberikan bayi tersebut kepada laki-laki muslim, dan memerintahkan untuk melaksanakan hukuman rajam. Akhirnya wanita itu ditanam dalam tanah hingga sebatas dada. Setelah itu beliau memerintahkan orang-orang supaya melemparinya dengan batu. Sementara itu, Khalid bin Walid ikut serta melempari kepala wanita tersebut dengan batu, tiba-tiba percikan darahnya mengenai wajah Khalid, seketika itu dia mencaci maki wanita tersebut. Ketika mendengar makian Khalid, Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Tenangkanlah dirimu wahai Khalid, demi dzat yang jiwaku berada di tangan-Nya, sesungguhnya perempuan itu telah benar-benar bertaubat, sekiranya taubat (seperti) itu dilakukan oleh seorang pelaku dosa besar niscaya dosanya akan diampuni.\" Setelah itu beliau memerintahkan untuk menshalati jenazahnya dan menguburkannya",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 35
			}
		}
	]
}