{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4440,
			"arabicnumber": "1700.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] keduanya dari [Abu Mu'awiyah], [Yahya] berkata; telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Al Barra` bin 'Azib] dia berkata, \"Suatu ketika seorang Yahudi yang dicat hitam dan didera lewat di hadapan Nabi shallallahu 'alaihi wasallam, kemudian beliau memanggil mereka seraya bersabda: \"Beginikah hukuman zina yang kalian dapati dalam kitab Taurat kalian?\" mereka menjawab, \"Ya benar.\" Lalu beliau memanggil seorang laki-laki yang tergolong dari ulama mereka, beliau bertanya: \"Aku mengharap kamu mau bersumpah dengan nama Allah yang telah menurunkan kitab Taurat kepada Musa, betulkah begini caranya hukuman zina yang kalian dapati dalam kitab tauratmu?\" dia menjawab, \"Tidak, seandainya anda tidak menyumpahku dengan nama Allah, aku tidak akan mengatakan yang sebenarnya kepada anda. Dan yang kami ketahui dalam kitab Taurat, hukumannya adalah rajam, akan tetapi biasanya hukuman itu tidak berlaku bagi pembesar-pembesar kami, jika yang tertangkap itu dari pembesar, maka kami biarkan begitu saja, akan tetapi jika yang tertangkap rakyat kecil maka kami tegakkan hukum sesuai Taurat. Akhirnya kami bermusyawarah, membicarakan hukum yang dapat kami tegakkan bagi pembesar dan rakyat biasa. Lalu kami putuskan untuk membuat hitam tubuh dan mendera pelaku zina sebagai pengganti hukum rajam.\" Setelah laki-laki itu selesai bicara, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, sesungguhnya akulah orang yang pertama-tama menghidupkan kembali sunnah-Mu setelah mereka hapus perintah tersebut.\" Setelah itu, beliau memerintahkan supaya Yahudi yang berzina itu dihukum rajam, lalu Allah 'azza wajalla menurunkan ayat: '(Wahai rasul, janganlah kamu merasa sedih, karena orang-orang yang bersegera menuju kekafiran -hingga firman-Nya- Jika diberikan ini kepadamu, maka terimalah) ' (Qs. Al Maidah: 41). Orang-orang Yahudi berkata, \"Datanglah kalian kepada Muhammad shallallahu 'alaihi wasallam, jika beliau memutuskan hukuman kepadamu dengan menghitamkan tubuh dan didera, maka terimalah, namun jika dia berfatwa kepadamu dengan hukuman rajam, maka waspadalah. Maka Allah Ta'ala menurunkan ayat: '(Barangsiapa tidak berhukum dengan sesuatu yang telah di turunkan Allah, maka mereka itu adalah orang-orang yang kafir. Dan barangsiapa tidak berhukum dengan sesuatu yang telah diturunkan Allah, maka mereka itu adalah orang-orang yang Zhalim. Dan barangsiapa tidak berhukum dengan sesuatu yang telah di turunkan Allah, maka mereka itu adalah orang-orang yang fasik' (Qs. Al Maidah: 44- 47). Hal ini juga berlaku kepada orang-orang kafir semuanya.\" Telah menceritakan kepada kami [Ibnu Numair] dan [Abu Sa'id Al Asyaj] keduanya berkata; telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dengan isnad seperti ini sampai kepada perkataannya, \"Lalu Nabi shallallahu 'alaihi wasallam memerintahkan untuk merajmanya, akhirnya dia pun dirajam.\" Dan tidak menyebutkan sesuatu setelahnya seperti turunnya ayat",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 43
			}
		}
	]
}