{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4569,
			"arabicnumber": "1752",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Yusuf bin Al Majisyun] dari [Shalih bin Ibrahim bin Abdurrahman bin Auf] dari [ayahnya] dari [Abdurrahman bin Auf] bahwa dia berkata, \"Ketika aku berdiri dalam barisan tentara pada saat perang Badar, aku melihat ke samping kanan dan kiriku, ternyata aku berada di antara dua anak muda dari kaum anshar, padahal sebelumnya aku berangan-angan berada di antara dua orang yang lebih kuat daripada mereka berdua. Kemudian salah seorang dari keduanya memberi isyarat kepadaku dengan matanya seraya berkata, \"Wahai paman, apakah paman mengetahui orang yang bernama Abu Jahal?\" Aku menjawab, \"Ya, lantas apa keperluanmu dengannya wahai anak saudaraku?\" dia menjawab, \"Aku mendapat kabar bahwa ia telah mencela Rasulullah shallallahu 'alaihi wasallam, demi Dzat yang jiwaku berada di tangan-Nya, jika aku melihatnya maka aku tidak akan berpisah darinya sampai ada di antara kami yang menemui ajalnya.\" Abdurrahman melanjutkan, \"Aku pun terkejut mendengarnya. Lalu seorang lainnya memberi isyarat kepadaku dengan matanya seraya bertanya dengan pertanyaan yang sama. Tidak lama setelah itu, aku melihat Abu Jahal bergerak di antara kerumunan orang-orang sehingga aku berkata kepada keduanya, \"Tidakkah kalian lihat, itulah orang yang kalian tanyakan kepadaku tadi.\" Abdurrahman melanjutkan, \"Setelah itu mereka berdua segera memburunya dan memukulkan pedang mereka hingga akhirnya mereka berdua dapat membunuh Abu Jahal. Setelah membunhnya, keduanya kembali menemui Rasulullah shallallahu 'alaihi wasallam dan memberitahukan kepada beliau, maka beliau pun bertanya: 'Siapakah di antara kalian berdua yang telah membunuhnya? ' masing-masing dari mereka menjawab, 'Akulah yang telah membunuhnya! ' Beliau bersabda: 'Apakah kalian berdua telah membersihkan pedang kalian? ' Mereka berkata, 'Belum.' Beliaupun melihat kedua pedang itu sambil bersabda: 'Kalian berdua telah membunuhnya.' Kemudian beliau memberikan harta yang diambil dari musuh yang terbunuh kepada Mu'adz bin 'Amru bin Jamuh. Sedangkan kedua anak muda itu adalah Mu'adz bin 'Amru bin Jamuh dan Mu'adz bin 'Afra",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 50
			}
		}
	]
}