{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4573,
			"arabicnumber": "1755",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Umar bin Yunus] telah menceritakan kepada kami [Ikrimah bin 'Ammar] telah menceritakan kepadaku [Iyas bin Salamah] telah menceritakan kepadaku [ayahku] dia berkata, \"Aku pernah ikut berperang di wilayah Fazarah di bawah komando Abu Bakar yang telah diangkat Rasulullah shallallahu 'alaihi wasallam untuk memimpin kami. Ketika jarak ke mata air hanya membutuhkan waktu beberapa saat, maka Abu Bakar memerintahkan kami agar beristirahat sejenak sambil mengarahkan strategi penyerangan, bagaimana seharusnya mendekati mata air tersebut dan menyerang serta menawan tawanan. Lalu aku sempat melihat di antara mereka (musuh) ada tawanan dari anak-anak dan wanita. Karena merasa khawatir mereka akan mendaki gunung terlebih dahulu, maka aku menghujani dengan anak panah ke arah rombongan musuh yang berada di sekitar gunung. Begitu melihat anah panah melesat ke arah mereka, mereka pun berhenti dan aku pun meringkus mereka. Ternyata di antara mereka terdapat seorang wanita dari Bani Fazarah yang mengenakan penutup kepala yang terbuat dari kulit, ditemani dengan anak gadisnya yang cantik rupawan di antara bangsa Arab. Kemudian aku menyerahkannya kepada Abu Bakar, lalu Abu Bakar memberikan anak gadisnya kepadaku sebagai harta ghanimah. Setelah itu kami pulang dan tiba di Madinah, dan aku juga belum sempat menggauli gadis tersebut. Ketika aku berada di pasar, aku berjumpa dengan Rasulullah shallallahu 'alaihi wasallam, beliau langsung bersabda kepadaku: \"Wahai Abu Salamah, berikanlah anak gadis kemarin kepadaku!\" Maka aku menjawab, \"Wahai Rasulullah, demi Allah sungguh ia telah menakjubkanku, namun aku belum sempat menggaulinya.\" Kemudian di esok harinya, Rasulullah shallallahu 'alaihi wasallam menemuiku di pasar seraya bersabda kepadaku: \"Wahai Salamah, berikanlah anak gadis kemarin kepadaku!\" Maka aku berkata, \"Dia untukmu wahai Rasulullah, demi Allah aku belum pernah menggaulinya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam mengirimkan gadis tersebut ke Makkah sebagai tebusan pasukan kaum Muslimin yang tengah ditawan di sana",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 54
			}
		}
	]
}