{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4589,
			"arabicnumber": "1764.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Sa'id bin Abu Sa'id] bahwa dia pernah mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengirim pasukan berkuda ke negeri Najd, lantas mereka dapat menawan dan membawa seorang laki-laki dari Bani Hanifah yang bernama Tsumamah bin Utsal seorang tokoh penduduk Yamamah. Mereka mengikat tawanan tersebut di salah satu tiang masjid, lalu Rasulullah shallallahu 'alaihi wasallam keluar menemuinya seraya bersabda: \"Apa kabarmu wahai Tsumamah?\" dia menjawab, \"Kabarku baik-baik saja wahai Muhammad, jika kamu membunuhku berarti kamu telah menumpahkan darah, namun jika kamu membebaskanku, berarti kamu telah membebaskan orang yang pandai berterima kasih. Jika kamu menginginkan harta katakan saja, aku akan berikan berapa yang kamu kehendaki.\" Kemudian Rasulullah shallallahu 'alaihi wasallam meninggalkannya. Keesokan harinya, beliau bertanya lagi: \"Apa kabar wahai Tsumamah?\" dia menjawab, \"Kabarku sebagaimana yang telah kukabarkan kepadamu, jika kamu membunuhku berarti kamu telah menumpahkan darah, namun jika kamu membebaskanku, berarti kamu telah membebaskan orang yang pandai berterima kasih. Jika kamu menginginkan harta katakan saja, aku akan berikan berapa yang kamu kehendaki.\" Kemudian Rasulullah shallallahu 'alaihi wasallam meninggalkannya. Keesokan harinya, beliau bertanya lagi: \"Apa kabar wahai Tsumamah?\" dia menjawab, \"Kabarku sebagaimana yang telah kukatakan kepadamu, jika kamu membunuhku berarti kamu telah menumpahkan darah, namun jika kamu membebaskanku, berarti kamu telah membebaskan orang yang pandai berterima kasih. Jika kamu menginginkan harta katakan saja, aku akan berikan berapa yang kamu kehendaki.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bebaskanlah Tsumamah!\" Kemudian dia pergi ke suatu batang pohon kurma dekat masjid, lalu dia mandi dan masuk masjid seraya berkata, \"Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya. Wahai Muhammad, demi Allah, tadinya tidak ada seraut wajah yang paling aku benci di muka bumi ini selain wajahmu, akan tetapi kini wajahmulah yang paling aku cintai di antara seluruh wajah. Demi Allah, tadinya tidak ada agama yang paling aku benci selain agamamu, akan tetapi kini agamamulah yang paling aku cintai daripada seluruh agama. Dulunya tidak ada negeri yang paling aku benci selain negerimu, akan tetapi kini tidak ada negeri yang paling aku cintai daripada negeri ini. Ketika pasukan berkuda menangkapku, aku bermaksud hendak pergi umrah, sekarang bagaimana pendapatmu?\" Rasulullah shallallahu 'alaihi wasallam menyampaikan berita gembira kepadanya, sesudah itu beliau menyuruhnya pergi umrah. Sesampainya tiba di Makkah, orang-orang bertanya kepadanya, \"Apakah kamu telah pindah agama?\" dia menjawab, \"Tidak, akan tetapi aku memeluk agama Islam bersama-sama Rasulullah shallallahu 'alaihi wasallam. Demi Allah janganlah kalian mengharap, sebiji gandumpun tidak akan datang kepada kalian dari Yamamah sebelum kalian mendapat izin dari Rasulullah shallallahu 'alaihi wasallam.\" Telah menceritakan kepada kami [Muhammad bin Mutsanna] telah menceritakan kepada kami [Abu Bakar Al Hanafi] telah menceritakan kepadaku [Abdul Hamid bin Ja'far] telah menceritakan kepadaku [Sa'id bin Abu Sa'id Al Maqburi] bahwa dia mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengirim pasukan berkuda menuju ke arah Najd, lalu tentara tersebut membawa seorang laki-laki yang bernama Tsumamah bin Utsal Al Hanafi, seorang tokoh penduduk Yamamah…lalu dia melanjutkan hadits tersebut seperti hadits riwayat Laits, namun dia menyebutkan, \"Jika kamu membunuhku, berarti kamu telah menumpahkan darah",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 70
			}
		}
	]
}