{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4612,
			"arabicnumber": "1775.01",
			"text": "Dan telah menceritakan kepadaku [Abu At Thahir Ahmad bin 'Amru bin Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah menceritakan kepadaku [Katsir bin Abbas bin Abdul Mutthalib] dia berkata; [Abbas] mengatakan, \"Aku pernah ikut perang Hunain bersama Rasulullah shallallahu 'alaihi wasallam, maka aku dan Abu Sufyan bin Harits bin Abdul Mutthalib selalu mendampingi Rasulullah shallallahu 'alaihi wasallam dan tidak pernah berpisah dengan beliau. Ketika itu Rasulullah shallallahu 'alaihi wasallam mengendarai bighal putih miliknya, hadiah dari Farwah bin Nufatsah Al Judzami. Tatkala kamu Muslimin dan tentara Kafir saling berhadapan, kaum Muslimin mundur ke belakang, karena itu Rasulullah shallallahu 'alaihi wasallam memacu bighalnya ke arah kaum Kufar.\" Abbas mengatakan, \"Namun aku pegangi tali kekang bighal beliau, menahannya jangan sampai ia berlari kencang. Sedangkan Abu Sufyan memegangi pula pelana Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abbas, serulah regu Samurah!\" Abbas -dia adalah orang yang mempunyai suara yang keras- berkata, \"Lalu aku panggil mereka dengan suaraku yang lantang, 'Manakah regu Samurah…! ' maka demi Allah, alangkah cepatnya mereka datang setelah mendengar panggilanku, bagaikan larinya induk sapi ketika mendengar suara anaknya. Mereka kemudian berkata, \"Ya, kami datang, kami datang.\" Abbas berkata, \"Lalu mereka berperang melawan kaum kafir. Kemudian panggilan tertuju kepada kaum Anshar, \"Wahai kaum Anshar, wahai kaum Anshar!\" Abbas melanjutkan, \"Kemudian seruan dialihkan kepada Bani Harits bin Khazraj, \"Wahai Bani Al Harits bin Khazraj, Wahai Bani Al Harits bin Khazraj!\" Kemudian Rasulullah shallallahu 'alaihi wasallam melihat jalannya pertempuran dari atas bighal beliau, seperti menggelorakan semangat pasukan yang sedang bertempur. Beliau bersabda: \"Beginilah kalau pertempuran sedang berkecamuk.\" Abbas berkata, \"Lalu beliau mengambil beberapa butir kerikil dan melemparkannya ke arah orang-orang kafir sambil bersabda: \"Demi Rabb Muhammad, kalian telah kalah…!\" Abbas berkata, \"Demi Allah, aku menyaksikan jalannya pertempuran, dan tidaklah Rasulullah shallallahu 'alaihi wasallam melempar mereka melainkan beliau melempar dengan beberapa kerikil saja, dan aku terus menyaksikan mereka berangsur-angsur kalah dan lari kocar kacir.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi'] serta [Abd bin Humaid] semuanya dari [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dengan isnad seperti ini, namun dia menyebutkan, \"Farwah bin Nu'amah Al Judzami berkata, \"Beliau bersabda: \"Demi Rabbul Ka'bah, Hancurlah kalian semua.\" Dan dalam hadits ia menambahkan, \"Sehingga Allah menghancurkan mereka.\" Abbas berkata, \"Seakan-akan aku melihat Nabi shallallahu 'alaihi wasallam memberikan semangat (juang) di belakang pasukan dari atas bighalnya.\" Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Katsir bin Al Abbas] dari [ayahnya] dia berkata, \"Aku pernah bersama Nabi shallallahu 'alaihi wasallam ketika perang Hunain…kemudian dia melanjutkan hadits tersebut, namun dalam hadits Yunus dan haditsnya Ma'mar lebih panjang dan lebih sempurna daripada hadits tersebut",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 94
			}
		}
	]
}