{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4622,
			"arabicnumber": "1780.01",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Sulaiman bin Al Mughirah] telah menceritakan kepada kami [Tsabit Al Bunani] dari [Abdullah bin Rabbah] dari [Abu Hurairah] dia berkata, \"Suatu delegasi datang kepada Mu'awiyah di bulan Ramadan, oleh karena itu sebagian kami sibuk membuat makanan untuk sebagian yang lain, di antaranya terdapat Abu Hurairah yang sering mengajak kami ke tempatnya (rumahnya), lalu aku berkata kepadanya, \"Tidak layakkah jika aku membuat makanan lalu aku undang mereka untuk makan-makan di rumahku?\" lalu aku menyuruh (keluargaku) untuk membuatkan makanan.\" Di petang harinya, aku menemui Abu Hurairah, kukatakan padanya, \"Sekarang makan malam di rumahku.\" Abu Hurairah menjawab, \"Kamu telah mendahuluiku.\" Aku berkata; \"Ya, aku mendahuluimu, dan juga mengundang mereka semua.\" Setelah itu, Abu Hurairah berkata; \"Sukakah jika aku ceritakan kepada kalian suatu peristiwa mengenai diri kalian wahai orang-orang Anshar?\" kemudian dia menyebutkan seputar penaklukan kota Makkah, katanya, \"Saat itu Rasulullah shallallahu 'alaihi wasallam berangkat hingga beliau tiba di Makkah. Lantas beliau mengangkat Zubair mengepalai satu sayap (pasukan), Khalid pada sayap yang lain, dan mengangkat Abu 'Ubaidah mengepalai pasukan yang tidak mengenakan baju besi. Mereka masuk ke dalam lembah, sedangkan Rasulullah shallallahu 'alaihi wasallam dalam satu regu.\" Abu Hurairah berkata, \"Lalu beliau melihatku seraya bersabda: \"Wahai Abu Hurairah.\" Jawabku, \"Ya wahai Rasulullah!.\" Beliau bersabda: \"Jangan perbolehkan orang-orang mendekat kepadaku selain orang-orang Anshar.\" -beliau menambahkan- \"Kecuali Syaiban.\" Beliau melanjutkan: \"Suruh orang-orang Anshar mendekat kepadaku.\" Abu Hurairah melanjutkan, \"Mereka segera berkumpul di sekeliling beliau, sedangkan orang-orang Quraisy juga telah menyusun barisan dalam beberapa pasukan. Kata orang-orang Quraisy, \"Biarkan mereka mendahului kita, jika mereka beruntung, maka kita sama-sama dengan mereka, namun jika mereka membahayakan, maka kita berikan kepada mereka apa yang dimintanya.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian lihatlah pasukan Quraisy dan pengikut-pengikut mereka!\" kemudian beliau memberi isyarat dengan kedua tangannya, yang satu di atas yang lain (maksudnya supaya waspada dan saling melindungi), kemudian beliau bersabda lagi: \"Sampai berjumpa di Shaffa.\" Abu Hurairah berkata, \"Kami terus berjalan, dan tidak seorang pun di antara kami yang membunuh, kecuali jika seorang Quraisy itu membunuh.\" Ternyata tidak ada perlawanan yang ditujukan kepada kami. Kemudian Abu Sufyan datang sembari berkata, \"Wahai Rasulullah, jikalau orang-orang Quraisy dibunuhi, maka tidak akan ada lagi orang-orang Quraisy sesudah ini.\" (artinya; orang-orang Quraisy menyerah kalah tanpa pertumpahan darah), maka beliau bersabda: \"Siapa yang masuk ke rumah Abu Sufyan, dia akan aman.\" Maka orang-orang Anshar berkata sesama mereka, \"Agaknya laki-laki ini, telah dipengaruhi perasaan rindu kepada kampung halamannya sehingga timbul rasa kasih terhadap sanak familinya.\" Abu Hurairah berkata, \"Ketika itu wahyu turun. Kalau wahyu turun, tidak seorang pun dari kami yang memandang Rasulullah shallallahu 'alaihi wasallam hingga wahyu selesai turun. Ketika wahyu selesai turun, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai kaum Anshar!\" Mereka menjawab, \"Kami wahai Rasulullah?\" beliau bersabda: \"Kaliankah yang berkata bahwa laki-laki ini, agaknya telah dipengaruhi perasaan rindu dengan kampung halamanya?\" mereka menjawab, \"Batul\" Beliau bersabda: \"Sekali-kali tidak, aku adalah hamba Allah dan Rasul-Nya. Aku telah hijrah kepada Allah dan kepada kalian semua, hijdup dan matiku juga bersama kalian.\" Setelah mendengar itu mereka datang menghampiri beliau sambil menagis dan berkata, \"Demi Allah, kami tidak mengatakan seperti itu melainkan kami iri dengan Allah dan Rasul-Nya.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah dan Rasul-Nya membenarkan pengakuan kalian semua dan memaafkan kalian.\" Abu Hurairah berkata, \"Kemudian orang-orang (penduduk Makkah) berdatangan ke rumah Abu Sufyan, dan mereka menutup pintu rumah mereka. Lantas Rasulullah shallallahu 'alaihi wasallam berjalan hingga tiba di Hajar Aswad dan menciumnya, setelah itu beliau thawaf mengelilingi Ka'bah. Abu Hurairah berkata, \"Beliau juga mendatangi berhala sesembahan orang-orang Quraisy yang terletak di sekitar Ka'bah, lalu beliau tusuk matanya dengan busur panah yang ada di tangan beliau sambil bersabda: \"Telah datang kebenaran, dan lenyaplah kebatilan.\" Setelah selesai thawaf, beliau menuju bukit shafa lalu naik ke puncaknya. Sesampainya di atas, beliau memandang ke Ka'bah, kemudian beliau mengangkat kedua tangannya sambil memuji Allah dan berdo'a dengan do'a yang beliau kehendaki.\" Dan telah menceritakan kepadaku [Abdullah bin Hasyim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dengan isnad seperti ini, dan dalam haditsnya ia menambahkan, \"kemudian beliau mengisyaratkan dengan kedua tangannya, yang satu dengan yang lainnya saling mempererat (melindungi).\" Dan dia menyebutkan dalam haditsnya, \"Mereka berkata, \"Memang kami telah mengatakan seperti itu wahai Rasulullah.\" Beliau bersabda: \"Lupakah kalian siapakah aku, sekali-kali tidak, sesungguhnya aku adalah hamba Allah dan Rasul-Nya",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 104
			}
		}
	]
}