{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4624,
			"arabicnumber": "1780.03",
			"text": "Telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah menceritakan kepada kami [Yahya bin Hasan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Tsabit] dari [Abdullah bin Rabah] dia berkata, \"Kami datang sebagai delegasi kepada Mu'awiyah bin Abu Sufyan, dan di antara kami ada [Abu Hurairah]. Kami bergilir memasak makanan masing-masing satu hari. Ketika giliranku memasak, aku berkata, \"Wahai Abu Hurairah, hari ini adalah giliranku memasak.\" Tidak lama kemudian mereka telah datang ke tempatku, tetapi makanan belum tersedia, lantas aku berkata, \"Wahai Abu Hurairah, alangkah baiknya jika kamu bercerita kepada kami tentang Rasulullah shallallahu 'alaihi wasallam sampai makanan kita terhidang!\" Dia berkata, \"Kami pernah pergi bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam pada hari penaklukan kota Makkah, beliau mengangkat Khalid bin Walid selaku komandan pasukan sayap kanan, dan mengangkat Zubair menjadi komandan pasukan sayap kiri, serta mengangkat Abu 'Ubaidah mengepalai pasukan pejalan kaki yang di tempatkan di lembah. Kemudian beliau bersabda: \"Wahai Abu Hurairah, panggilah orang-orang Anshar untuk mendekat Aku!\" Aku langsung memanggil mereka hingga mereka pun segera berkerumun di dekat beliau, lalu belau bersabda: \"Wahai orang-orang Anshar, adakah kalian melihat pasukan tentara Quraisy?\" mereka menjawab, \"Ya.\" Beliau bersabda: \"Perhatikan baik-baik, apabila kalian bertemu dengan mereka besok hari, maka habisilah mereka.\" sambil memberi isyarat dengan kedua tangannya -meletakkan yang kanan di atas yang kiri-. Kemudian beliau bersabda: \"Sampai bertemu di Shafa.\" Abu Hurairah berkata, \"Dan saat itu tidak ada seorang pun yang mendekati mereka melainkan mereka habisi.\" Abu Hurairah melanjutkan, \"Kemudian Rasulullah shallallahu 'alaihi wasallam naik ke bukit Shafa, dan orang-orang Anshar datang sembari mengililingi beliau di Shafa, ketika mereka sedang di Shafa, tiba-tiba Abu Sufyan datang seraya berkata, \"Wahai Rasulullah, jika orang-orang Quraisy di habisi semua, maka tidak akan ada lagi orang-orang Quraisy setelah ini.\" Abu Sufyan mengatakan, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa masuk ke rumah Abu Sufyan maka dia aman, barangsiapa meletakkan senjatanya maka dia aman, barangsiapa menutup pintunya maka dia aman.\" Setelah itu orang-orang Anshar sama berkata, \"Agaknya laki-laki ini (Rasulullah) telah dipengaruhi perasaan kasih sayang kepada keluarganya hingga timbul rasa cinta terhadap sanak familinya.\" Maka turunlah wahyu kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Kaliankah yang mengatakan, 'agaknya laki-laki ini telah dipengaruhi perasaan kasih sayang terhadap keluarganya hingga timbul rasa cinta terhadap sanak familinya?, sekali-kali tidak, lupakah kalian siapa aku? -beliau mengucapkannya hingga tiga kali- aku adalah Muhammad seorang hamba Allah dan Rasul-Nya, aku telah berhijrah kepada Allah dan kepada kalian semua, maka hidup dan matiku bersama kalian.\" Mereka lantas berkata, \"Demi Allah, tidaklah kami mengatakan melainkan karena kami iri dengan Allah dan Rasul-Nya.\" Beliau bersabda: \"Sesungguhnya Allah dan Rasul-Nya membenarkan apa yang kalian katakan dan memaafkan perbuatan kalian",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 106
			}
		}
	]
}