{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4640,
			"arabicnumber": "1788",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] semuanya dari [Jarir], [Zuhair] berkata; telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim At Taimi] dari [ayahnya] dia berkata, \"Suatu ketika kami berada di dekat [Hudzaifah], tiba-tiba ada seorang laki-laki yang berkata, \"Seandainya aku mendapatkan Rasulullah shallallahu 'alaihi wasallam, niscaya aku akan berperang bersama beliau dan aku akan bersungguh-sunbgguh.\" Hudzaifah berkata, \"Betulkah kalian akan berbuat seperti itu?\" aku sendiri pernah mengalami perang bersama Rasulullah shallallahu 'alaihi wasallam ketika perang Ahzab. Saat itu kami diserang oleh angin yang sangat kencang dan udara yang dingin. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adakah seseorang yang sanggup mencari berita tentang musuh? Maka Allah akan menempatkannya bersamaku kelak di hari Kiamat.\" Semuanya diam, dan tidak ada satupun yang menjawab. Kemudian beliau bertanya lagi: \"Adakah seseorang yang sanggup mencari berita tentang musuh? Maka Allah akan menempatkannya bersamaku kelak di hari Kiamat.\" Semuanya diam, dan tidak ada satupun yang menjawab. Kemudian beliau bertanya pula: \"Adakah seseorang yang sanggup mencari berita tentang musuh? Maka Allah akan menempatkannya bersamaku kelak di hari Kiamat.\" Kami masih terdiam semuanya, dan tidak ada satupun yang menjawab. Lalu beliau bersabda: \"Wahai Hudzaifah, berdiri dan carilah kabar mengenai musuh!\" Maka tidak bisa tidak, aku harus berdiri, karena beliau jelas memanggil namaku. Beliau bersabda: \"Pergi dan carilah kabar mengenai musuh, dan jangan kamu mengagetkan mereka tentang diriku.\" Tatkala aku telah berpaling dari sisi beliau, seakan-akan aku berjalan dengan kehangatan (tidak seperti yng lain dalam kedinginan-red), sehingga aku mendatangi mereka, lantas aku melihat Abu Sufyan yang sedang menghangatkan badannya dengan api, maka aku langsung menaruh anak panah pada busurnya dan hendak memanahnya, sekiranya aku tidak ingat dengan pesan Rasulullah shallallahu 'alaihi wasallam: \"Jangan kamu mengagetkan mereka dengan diriku.\" Niscaya aku telah panah dan akan mengenainya. Lalu aku kembali sambil berjalan kaki dengan kehangatan, kemudian aku menemui beliau dan melaporkan mengenai kondisi musuh, setelah itu aku pergi, tiba-tiba diriku mulai merasakan kedinginan, maka Rasulullah shallallahu 'alaihi wasallam memakaikanku kain burdah yang biasa dipakai beliau untuk shalat, kemudian aku tertidur sampai pagi, keesokan harinya beliau bersabda: \"Bangun wahai orang yang banyak tidur",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 122
			}
		}
	]
}