{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4669,
			"arabicnumber": "1802.02",
			"text": "Dan telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abdurrahman] -selain Ibnu Wahb menisbatkan kepada selainnya, Ibnu Abdullah bin Ka'ab bin Malik berkata- [Salamah bin Al Akwa'] berkata, \"Ketika terjadi perang Khaibar, saudaraku berperang dengan dahsyatnya bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam, namun malang baginya, pedang yang dipakainya berbalik dan mengenainya hingga ia meninggal. Maka [para sahabat] Rasulullah shallallahu 'alaihi wasallam berkomentar mengenai peristiwa itu, bahwa ada seseorang yang mati karena tertusuk pedangnya sendiri.\" Salamah berkata, \"Setelah Rasulullah shallallahu 'alaihi wasallam kembali pulang dari khaibar, maka aku bertanya kepada beliau, \"Wahai Rasulullah, izinkanlah aku untuk malantunkan beberapa bait syair untuk anda!\" Rasulullah shallallahu 'alaihi wasallam pun mengizinkannya, lantas Umar bin Khattab berkata, \"Aku lebih tahu apa yang akan kamu katakan.\" Salamah berkata, \"Lalu aku berkata (membacakan syair), \"Demi Allah, kalau bukan karena Allah, niscaya kami tidak akan mendapatkan petunjuk, kami tidak akan bersedekah, dan kami tidak akan mendirikan shalat.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kamu benar.\" (Salamah melanjutkan senandungnya), \"Semoga Allah menurunkan ketenangan atas kita, dan teguhkanlah pendirian kami jika bertemu dengan musuh…salamah berkata, \"ketika aku selesai melatunkan beberapa bait syair tersebut, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebenarnya siapakah yang melantunkan bait syair ini?\" Aku menjawab, \"Saudaraku.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah merahmatinya.\" Salamah berkata, \"Maka aku bertanya, \"Wahai Rasulullah, sesungguhnya orang-orang enggan mendo'akan dia, justru mereka mengatakan bahwa ada seorang laki-laki mati karena pedangnya sendiri.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia telah gugur sebagai seorang Mujahid.\" [Ibnu Syihab] berkata, \"Setelah itu baru aku bertanya",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 151
			}
		}
	]
}