{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4684,
			"arabicnumber": "1812.01",
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Sulaiman] -yaitu Ibnu Bilal- dari [Ja'far bin Muhammad] dari [ayahnya] dari [Yazid bin Hurmuz] bahwa Najdah pernah menulis surat kepada [Ibnu Abbas] dan menanyakan mengenai lima masalah. Ibnu Abbas berkata, \"Kalaulah aku tidak khawatir akan dianggap menyembunyikan ilmu, maka tidak akan kubalas suratnya.\" (surat 'Abdah -red): \"Amma Ba'd, tolonglah kabarkan kepadaku, adakah kaum wanita yang pergi berperang bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam? Apakah mereka juga diberi ghanimah? Apakah beliau membunuh anak-anak? Kapankah seorang anak tidak lagi dikatakan yatim? Dan untuk siapakah diberikan seperlima pembagian harta ghanimah?\" Ibnu Abbas membalas suratnya: \"Anda menanyakan kepadaku, apakah para wanita ikut berperang bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam? Betul, beliau pergi berperang bersama dengan para wanita. Mereka bertugas mengobati pasukan yang terluka, dan mereka diberi harta ghanimah ala kadarnya, tetapi mereka tidak diberi jumlah tertentu. Dan sesungguhnya beliau tidak pernah membunuh anak-anak, oleh karena itu, tahanlah kalian dari membunuh anak-anak. Kamu menanyakan kepadaku, mengenai kapan masa habisnya keyatiman anak yatim? Demi Dzat yang memanjangkan umurku, ada orang yang telah tumbuh jenggotnya, namun dia masih lemah mengurus dirinya, lemah mengambil dirinya sendiri atau memberi kepada dirinya sendiri. Maka apabila dia sudah sanggup mengurus dirinya sendiri, mengambil apa yang baik bagi dirinya seperti halnya orang lain. Maka ketika itu dia habis masa keyatimannya. Dan anda menanyakan pula tentang untuk siapa seperlima harta ghanimah tersebut?, sesungguhnya kami pernah mengatakan, itu untuk kami (Bani Hasyim), namun keluarga kami keberatan atas kami.\" Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim] keduanya dari [Hatim bin Isma'il] dari [Ja'far bin Muhammad] dari [ayahnya] dari [Yazid bin Hurmuz] bahwa Najdah pernah menulis surat kepada [Ibnu Abbas] untuk menanyakan mengenai hal itu sebagaimana hadits Sulaiman bin Bilal, namun dalam hadits Hatim, Rasulullah shallallahu 'alaihi wasallam tidak pernah membunuh anak-anak, oleh karena itu janganlah kamu membunuh anak-anak, kecuali jika kamu mengetahui seorang anak tersebut ikut dalam berperang.\" Dan Ishaq menyebutkan dalam haditsnya dari Hatim, bahwa 'Kamu dapat membedakan antara yang mukmin, kemudian kamu bunuh yang kafir dan tinggalkanlah yang mukmin",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 166
			}
		}
	]
}