{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4776,
			"arabicnumber": "1844.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim], Ishaq berkata; telah mengabarkan kepada kami, sedangkan Zuhair berkata; telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Zaid bin Wahb] dari [Abdurrahman bin Abd Rabbil Ka'bah] dia berkata, \"Ketika saya masuk masjid, maka terlihat olehku [Abdullah bin 'Amru bin 'Ash] duduk di bawah naungan ka'bah di kelilingi orang banyak. Lalu aku datangi mereka dan duduk di dekat Abadullah. Dia berkata, \"Kami pernah mengadakan suatu perjalanan bersama Rasulullah shallallahu 'alaihi wasallam, lalu di suatu tempat pemberhentian kami berhenti. Sebagian kami ada yang memperbaiki tempat tidur, sebagian lagi berlatih memanah, sebagian lagi memberi makan hewan dan sebagainya. Tiba-tiba terdengar utusan Rasulullah shallallahu 'alaihi wasallam menyeru, memanggil kami untuk shalat berjama'ah, lalu kami berkumpul di dekat beliau. Beliau bersabda: \"Para Nabi sebelum saya diutus menuntun umatnya kepada kebaikan yang telah diajarkan Allah kepada mereka, dan memingatkan bahaya yang mengancam mereka. Ummatku yang sempurna dan selamat ialah angkatan yang pertama-tama, angkatan sesudah itu akan ditimpa berbagai cobaan berupa hal-hal yang tidak disenanginya, seperti timbulnya fitnah. Di mana-mana sebagian mereka menghina sebagian yang lain, oleh karena itu timbullah bencana. Orang-orang mukmin berkata, 'Inilah kiranya yang membinasakanku', Setelah hilang bencana tersebut, timbul pula bencana yang lain. Dan orang mukmin berkata, 'Ini..! Ini..!\" Siapa yang ingin bebas dari neraka dan ingin masuk ke surga, hendaklah dia menemui kematiannya dalam keimanan kepada Allah dan hari akhirat, dan hendaklah dia berjasa kepada ummat manusia sesuai dengan yang diinginkan oleh masyarakat itu. Siapa yang baik dengan seorang pemimpin (penguasa) lalu dia memenuhi bai'atnya dengan sepenuh hati, hendaklah dia mematuhi pemimpin itu semampunya. Jika yang lain datang memberontak, penggallah lehernya.\" Abdurrahman berkata, \"Aku lebih mendekat lagi kepada 'Amru, lalu saya berkata, \"Dengan nama Allah, saya bertanya kepada anda, 'Apakah kamu mendengar sendiri hadits ini dari Rasulullah shallallahu 'alaihi wasallam? ' dia menunjuk tangannya ke telinga dan hatinya seraya berkata, \"Saya mendengarnya dengan kedua telingaku dan kusimpan ke dalam hatiku.\" Lalu kukatakan kepadanya, \"Ini anak pamanmu, Mu'awiyah! Dia menyuruh kami memakan harta sesama dengan cara yang haram dan memerintahkan untuk saling membunuh sesama. Padahal Allah telah berfirman: '(Wahai orang-orang yang beriman, janganlah kamu memakan harta sesamamu dengan cara yang haram, kecuali berjual beli dengan cara suka sama suka sesamamu, dan janganlah kamu membunuh saudaramu (sesama muslim). Sesungguhnya Allah Maha penyayang kepadamu) ' (Qs. An Nisaa`: 29). 'Amru diam sebentar kemudian dia berkata, \"Patuhilah perintahnya bila sesuai dengan perintah Allah dan langgarlah perintahnya bila melanggar perintah Allah!\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ibnu Numair] serta [Abu Sa'id Al Asyaj] mereka berkata; telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Mu'awiyah] keduanya dari [Al A'masy] dengan isnad seperti ini.\" Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abu Al Mundzir Isma'il bin 'Umar] telah menceritakan kepada kami [Yunus bin Abu Ishaq Al Hamdani] telah menceritakan kepada kami [Abdullah bin Abu As Safar] dari ['Amir] dari [Abdurrahman bin Abd Rabbil Ka'bah Ash Sha`idi] dia berkata, \"Saya melihat sekelompok orang di sisi Ka'bah…kemudian dia menyebutkan seperti hadits Al A'masy",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 74
			}
		}
	]
}