{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4917,
			"arabicnumber": "677.11",
			"text": "Telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Anas bin Malik] dia berkata, \"Serombongan orang datang kepada Nabi shallallahu 'alaihi wasallam, lalu mereka berkata, \"Kirimkanlah bersama kami beberapa orang untuk mengajarkan Al Qur'an dan As Sunnah kepada kami.\" Maka beliau mengirim tujuh puluh orang laki-laki dari golongan Anshar, mereka di namakan Al Qurra (ahli dalam membaca Al-Qur'an). Mereka adalah orang-orang yang menjauhi perkara haram, selalu membaca dan mempelajari Al-Qur'an di malam hari, sedangkan di siang hari mereka mengangkut air ke masjid sehingga bisa digunakan untuk bersuci. Selain itu mereka juga mencari kayu bakar, setelah dijual, mereka gunakan uangnya untuk membeli makanan untuk ahli suffah dan orang-orang fakir. Nabi shallallahu 'alaihi wasallam lalu mengutus mereka menyertai rombongan tersebut. Di tengah perjalanan mereka diserang oleh rombongan tersebut, dan akhirnya mereka dibunuh sebelum sampai ke tempat tujuan. Namun mereka sempat berdo'a: \"Ya Allah, sampaikanlah kabar kami kepada Nabi kami, bahwa kami telah bertemu dengan-Mu. Kami ridla dengan-Mu dan Engkau ridla dengan kami.\" Anas melanjutkan, \"Ketika itu ada seseorang yang membuntuti Haram -paman Anas- dari belakang, rupanya Haram dapat menikamnya dengan tombak hingga ia berhasil membunuhnya. Setelah itu Haram berkata, \"Saya telah menang demi Rabb pemilik Ka'bah.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada para sahabatnya: \"Sesungguhnya saudara-saudara kalian telah terbunuh, dan (sebelum terbunuh) mereka sempat berkata, \"Ya Allah, sampaikanlah kabar kami kepada Nabi kami, bahwa kami telah bertemu dengan-Mu. Kami ridla dengan-Mu dan Engkau ridla dengan kami",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 212
			}
		}
	]
}