{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5129,
			"arabicnumber": "1979.03",
			"text": "Dan telah menceritakan kepadaku [Abu Bakar bin Ishaq] telah mengabarkan kepada kami [Sa'id bin Katsir bin 'Ufair Abu Utsman Al Mishri] telah menceritakan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] telah mengabarkan kepadaku ['Ali bin Husain bin Ali] bahwa [Husain bin Ali] mengabarkan kepadanya, bahwa [Ali] berkata, \"Dahulu saya pernah memiliki seekor unta dari hasil pembagian harta rampasan perang Badr, pada hari itu pula Rasulullah shallallahu 'alaihi wasallam memberikan seekor unta dari bagian seperlima. Ketika hendak membina rumah tangga dengan Fatimah -puteri Rasulullah shallallahu 'alaihi wasallam- saya telah mengikat janji dengan seorang tukang emas dari Bani Qainuqa' untuk pergi bersamaku sambil membawa idzkir (semacam tumbuhan) yang akan saya jual, dan uang hasil penjualan itu dapat saya pergunakan untuk penyelenggaraan pernikahan saya. Pada saat mempersiapkan barang-barang bagi keperluan kedua unta tersebut, seperti pelana, karung dan tali. Saat itu kedua unta saya terikat di samping rumah seorang Anshar, dan ternyata saya mendapati kedua unta saya -setelah mempersiapkan barang-barang yang perlu dipersiapkan- sudah terpotong punuknya, terbelah perutnya dan telah terambil hatinya. Kedua mataku tidak kuasa melihat pemandangan itu, lalu saya bertanya, \"Siapakah yang melakukan semua ini?\" orang-orang menjawab, \"Hamzah bin Abdul Mutthalib, dan dia sekarang berada di rumah ini bersama-sama dengan orang-orang Anshar yang suka meminum minuman keras. Dia dan teman-temannya sedang dihibur oleh seorang penyanyi perempuan yang dalam salah satu nyanyiannya terselip kata-kata, 'Wahai Hamzah, ingatlah pada unta-unta yang montok.' Maka Hamzah pun berdiri dengan membawa pedang terhunus. Lalu dia memotong punuk kedua unta tersebut dan ia belah perut keduanya kemudian hati keduanya di ambil.\" Ali berkata, \"Kemudian saya langsung pergi menemui Rasulullah shallallahu 'alaihi wasallam yang pada saat itu beliau sedang duduk bersama Zaid bin Haritsah.\" Ali berkata, \"Melihat raut mukaku, ternyata Rasulullah shallallahu 'alaihi wasallam tahu akan peristiwa yang terjadi.\" Maka Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apa yang terjadi denganmu?\" saya menjawab, \"Wahai Rasulullah, demi Allah belum pernah seumur hidupku melihat kejadian seperti hari ini. Hamzah telah menyerang kedua untaku, dia telah memotong punuknya dan membelah isi perutnya. Sekarang dia berada di rumah bersama teman-temannya yang suka meminum minuman keras.\" Ali berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam mengambil jubahnya. Setelah mengenakannya beliau berangkat ke rumah yang disebutkannya itu dengan berjalan kaki, sementara saya dan Zaid mengikutinya dari belakang. Sesampainya di depan pintu rumah yang di dalamnya ada Hamzah, Rasulullah shallallahu 'alaihi wasallam meminta izin masuk. Para penghuni rumah pun memberikan izin masuk. Ternyata mereka adalah para peminum minuman keras. Lalu Rasulullah shallallahu 'alaihi wasallam mulai mencela Hamzah terhadap apa yang telah diperbuatnya. Pada saat itu, kedua mata Hamzah memerah dan dia juga mulai mengamati Rasulullah shallallahu 'alaihi wasallam dari kedua lutut naik ke pusar dan akhirnya ke wajah beliau. Kemudian Hamzah berkata, \"Kalian ini tidak lain hanyalah para budak bapakku.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam mengetahui bahwa Hamzah sedang mabuk berat. Lalu beliau mundur ke belakang dan keluar. Melihat itu kami pun pergi keluar mengikuti beliau.\" Dan telah menceritakan kepadaku [Muhammad bin Abdullah Al Quhzadza] telah menceritakan kepadaku [Abdullah bin Utsman] dari [Abdullah bin Mubarak] dari [Yunus] dari [Az Zuhri] dengan sanad seperti ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		}
	]
}