{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5316,
			"arabicnumber": "2040.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku mebaca Hadits [Malik bin Anas] dari [Ishaq bin 'Abdullah bin Abu Thalhah]; Bahwasanya dia mendengar [Anas bin Malik] berkata; Abu Thalhah berkata kepada Ummu Sulaim; \"Aku mendengar suara Rasulullah shallallahu 'alaihi wasallam sangat lemah, yang aku tahu bahwa beliau sangat lapar. Apakah kamu mempunyai sesuatu?\" Dia menjawab; 'Ya.' Kemudian dia mengeluarkan beberapa roti pipih dari gandum, lalu meraih kerudungnya. Kemudian dia menyusupkan ke bawah tanganku, dan menyelendangkan kerudungnya (yang berisi roti). Dia mengutusku kepada Rasulullah shallallahu 'alaihi wasallam. Anas berkata; 'Aku membawanya menemui Rasulullah shallallahu 'alaihi wasallam. Aku mendapati beliau sedang duduk di masjid bersama para sahabat. Aku berdiri di hadapan mereka. Rasulullah shallallahu 'alaihi wasallam bertanya: 'Apakah Abu Thalhah yang menyuruhmu? ' Anas menjawab; 'Ya', Beliau bertanya: 'Untuk membawakan makanan? ' Aku menjawab; 'Ya, ' maka Rasulullah shallallahu 'alaihi wasallam berkata kepada orang-orang yang sedang bersamanya; 'Berdirilah! ' Anas berkata; 'Beliau berangkat dan aku berada di bagian depan mereka, hingga aku menemui Abu Thalhah dan mengabarkan hal itu.' Abu Thalhah berkata; 'Wahai Ummu Sulaim, Rasulullah shallallahu 'alaihi wasallam datang bersama orang-orang, sedangkan kita tidak memiliki makanan yang cukup untuk menjamu mereka? ' Ummu Sulaim menjawab; 'Allah dan Rasul-Nya lebih mengetahui.' Anas berkata; 'Abu Thalhah menemui Rasulullah shallallahu 'alaihi wasallam. Beliau tiba dan Abu Thalhah menghampiri beliau hingga memasuki rumahnya. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kemarilah, Wahai Ummu Sulaim, apa yang kau miliki? ' Dia datang dengan membawa roti itu, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan agar roti tersebut dilumatkan. Roti pun dilumatkan dan Ummu Sulaim menuangkan minyak samin pada wadah tersebut. Sehingga menjadi lauk. Rasulullah shallallahu 'alaihi wasallam mengucapkan beberapa kalimat lalu bersabda: 'Persilahkan sepuluh orang untuk masuk.' Abu Thalhah mempersilahkan mereka. Mereka menyantapnya hingga kenyang kemudian keluar. Beliau bersabda: 'Persilahkan sepuluh orang untuk masuk.' Abu Thalhah mempersilahkan mereka, dan mereka menyantapnya hingga kenyang kemudian keluar. Kemudian beliau bersabda: 'Persilahkan sepuluh orang untuk masuk.' Hingga mereka mereka bisa makan dan kenyang. Jumlah mereka ada tujuh puluh orang atau delapan puluh orang",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 190
			}
		}
	]
}