{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5366,
			"arabicnumber": "2057.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Salim bin Nuh Al 'Aththar] dari [Al Jurairi] dari [Abu 'Utsman] dari ['Abdurrahman bin Abu Bakr] ia berkata; 'Beberapa tamu kami singgah di rumah kami.' Abdurrahman berkata; 'Sedangkan pada malam itu Ayahku ada janji untuk berbincang-bincang dengan Rasulullah shallallahu 'alaihi wasallam. Maka Abu Bakr berajak pergi seraya mengatakan; 'Wahai Abdurrahman, layani tamu-tamumu dengan baik! ' Abdurrahman berkata; 'Pada sore harinya, aku melayani tamu-tamu dengan menyuguhkan hidangan untuk mereka, namun mereka menolaknya seraya berkata; 'Tunggulah, sampai tuan rumah ini datang, hingga dia bisa makan bersama kami.' Abdurrahman berkata; 'Maka aku katakan kepada mereka; 'Dia itu orangnya keras, apabila kalian tidak menyantap apa yang aku hidangkan, aku takut ayahku memarahiku. Abdurrahman berkata; 'Namun mereka tetap menolaknya.' Tatkala Abu Bakr datang, sedangkan di antara mereka belum ada yang menyentuhnya sama sekali. Abu Bakr bertanya kepada mereka; 'Apakah kalian sudah selesai menikmati hidangan kami? ' Abdurrahman berkata; maka mereka menjawab; 'Demi Allah, belum.' Abu Bakr berkata; Bukankah aku telah menyuruh Abdurrahman? Abdurrahman berkata; 'Maka akupun menjauh dari Abu Bakr, namun dia segera memanggilku; 'Wahai Abdurrahman! ' Abdurrahman berkata; 'namun aku terus menghindar darinya.' Maka Abu Bakr memanggilku; Ya Guntsar! (kalimat menghardik) 'Saya bersumpah kepadamu jika kamu mendengar suaraku, maka datanglah! Abdurrahman berkata; Maka aku pun datang seraya kukatakan; 'Demi Allah, aku tidak bersalah, mereka itu tamu Ayah, maka tanyalah mereka. Aku telah melayani dan menjamu mereka, namun mereka menolak menyantap hidangan sampai ayah datang.' Abdurrahman berkata; Maka Abu Bakr bertanya; 'Kenapa kalian tidak mau menyantap hindangan yang kami berikan kepada kalian? ' Abdurrahman berkata; Maka Abu Bakr berkata; 'Demi Allah, Aku tidak akan makan malam ini! ' Abdurrahman berkata; lalu mereka berkata; 'Demi Allah, kami tidak memakannya sampai anda memakannya.' Abu Bakr berkata; 'Aku sama sekali tidak pernah melihat keburukan seperti yang terjadi malam ini.' Celakalah kalian kenapa kalian tidak mau menerima hidangan kami? Abdurrahman berkata; kemudian Abu Bakr berkata; 'Sumpah kalian tadi itu adalah dari syetan, ayo santaplah hidangan kalian.' Maka makananpun disodorkan kepada mereka. Abu Bakr berdo'a terlebih dahulu lalu makan, kemudian mereka pun ikut makan. Abdurrahman berkata; 'Di pagi harinya Abu Bakr menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata; 'Ya Rasulullah, para tamuku telah berbuat kebaikan dengan menepati sumpahnya. Sedangkan aku telah melanggar sumpahku.Abdurrahman berkata; Abu Bakr menceritakan kejadian tadi malam kepada Rasulullah, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak, bahkan kamu yang paling baik dan lebih utama dari mereka. Abdurrahman berkata; 'Aku tidak mendengar ada kafarah (penebus) terhadap sumpah tersebut",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 240
			}
		}
	]
}