{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"37": "The Book of Clothes and Adornment"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5409,
			"arabicnumber": "2069.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Khalid bin 'Abdullah] dari ['Abdul Malik] dari ['Abdullah] -budak- dari Asma' binti Abu Bakr dan dia juga adalah paman anaknya 'Atha, dia berkata; \"Asma' binti Abu Bakar pernah menyuruh saya untuk menemui Abdullah bin Umar agar menyampaikan pesannya yang berbunyi, 'Telah sampai kepada saya bahwasanya, engkau telah mengharamkan tiga hal; pakaian yang terbuat dari campuran sutera, pelana sutera yang berwarna merah tua, dan berpuasa di bulan Rajab seluruhnya.' [Abdullah bin 'Umar] berkata kepadaku; 'Mengenai berpuasa di bulan Rajab yang telah kamu singgung tadi, maka bagaimana dengan orang yang berpuasa selama-lamanya? ' Adapun mengenai campuran sutera pada pakaian, maka sebenarnya aku pernah mendengar [Umar bin Khaththab] berkata; 'Aku pernah mendengar Rasulullah bersabda: 'Sesungguhnya orang yang memakai kain sutera, niscaya ia tidak akan mendapat bagian di akhirat kelak.' Oleh karena itu, saya khawatir kalau-kalau sutera pada kain itu termasuk bagian darinya. Sedangkan mengenai pelana sutera yang berwarna merah tua, maka ketahuilah bahwasanya itu adalah kasur 'Abdullah yang ternyata berwarna merah tua.' Lalu sayapun kembali kepada [Asma' binti Abu Bakar], untuk memberitahukan kepadanya tentang informasi yang telah saya peroleh. Tak lama kemudian ia memperlihatkan kepada saya sebuah jubah kekaisaran yang berwarna hijau dan berkerah sutera, sedangkan kedua sisinya dijahit dengan sutera seraya berkata; 'Hai Abdullah, ini adalah jubah Rasulullah.' Setelah itu, ia meneruskan ucapannya; 'Jubah ini dahulu ada pada Aisyah hingga ia meninggal dunia. Setelah ia meninggal dunia, maka aku pun mengambilnya. Dan dahulu Rasulullah shallallahu 'alaihi wasallam sering mengenakannya. Lalu kami pun mencuci dan membersihkannya untuk orang sakit agar ia lekas sembuh dengan mengenakannya",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		}
	]
}