{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 553,
			"arabicnumber": "234.01",
			"text": "Telah menceritakan kepadaku [Muhammad bin Hatim bin Maimun] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Muawiyah bin Shalih] dari [Rabi'ah] -yaitu Ibnu Yazid- dari [Abu Idris al-Khaulani] dari [Uqbah bin Amir]. (dalam riwayat lain disebutkan) Dan telah menceritakan kepadaku [Abu Utsman] dari [Jubair bin Nufair] dari [Uqbah bin Amir] dia berkata, \"Dahulu kami menggembala unta, lalu datanglah malam, maka aku mengistirahatkannya dengan memberikan makan malam. Lalu aku mendapati Rasulullah shallallahu 'alaihi wasallam berdiri berbicara kepada manusia. Dan dari sebagian sabdanya yang aku dengar adalah: 'Tidaklah seorang muslim berwudlu lalu menyempurnakan wudlunya, kemudian mendirikan shalat dua rakaat dengan menghadapkan hati dan wajahnya, kecuali surga wajib diberikan kepadanya.\" Uqbah berkata, 'Maka aku berkata, 'Alangkah baiknya ini, ' tiba-tiba seorang pembicara di depanku berkata, 'Yang sebelumnya adalah lebih bagus'. Saat aku lihat, ternyata dia adalah [Umar].' Uqbah lalu berkata, 'Sesungguhnya aku telah melihatmu datang barusan.\" Umar lalu menyebutkan, \"Tidaklah salah seorang di antara kalian berwudlu, lalu menyampaikan wudlunya atau menyempurnakan wudlunya kemudian dia bersaksi bahwa tidak ada tuhan yang berhak disembah selain Allah, dan bahwa Muhammad adalah hamba dan utusan-Nya melainkan pintu surga yang delapan akan dibukakan untuknya. Dia masuk dari pintu manapun yang dia kehendaki'.\" Dan telah menceritakannya kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Zaid bin al-Hubab] telah menceritakan kepada kami [Muawiyah bin Shalih] dari [Rabi'ah bin Yazid] dari [Abu Idris al-Khaulani] dan [Abu Utsman] dari [Jubair bin Nufair bin Malik al-Hadlrami] dari [Uqbah bin Amir al-Juhani] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda…Lalu dia menyebutkan hadits semisalnya, hanya saja dia menyebutkan, \"Barangsiapa bersaksi bahwa tidak ada tuhan yang berhak disembah selain Allah semata, tidak ada sekutu bagi-Nya, dan saya bersaksi bahwa Muhammad adalah hamba dan utusan-Nya",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 20
			}
		}
	]
}