{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5787,
			"arabicnumber": "2219.04",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dia berkata; Aku membaca Hadits [Malik] dari [Ibnu Syihab] dari ['Abdul Hamid bin 'Abdur Rahman bin Zaid bin Al Khaththab] dari ['Abdullah bin 'Abdullah bin Al Harits bin Naufal] dari ['Abdullah bin 'Abbas] bahwa Pada suatu ketika 'Umar bin Khaththab pergi ke Syam. Setelah sampai di Saragh, pimpinan tentara datang menyambutnya. Antara lain terdapat Abu \"Ubaidah bin Jarrah dan para sahabat yang lain. Mereka mengabarkan kepada 'Umar bahwa wabah penyakit sedang berjangkit di Syam. Ibnu Abbas berkata; 'Umar berkata; 'Panggil ke sini para pendahulu dari orang-orang Muhajirin! ' Maka kupanggil mereka, lalu 'Umar bermusyawarah dengan mereka. Kata 'Umar; 'Wabah penyakit sedang berjangkit di Syam. Bagaimana pendapat kalian? ' Mereka berbeda pendapat. Sebagian mengatakan kepada 'Umar; 'Anda telah keluar untuk suatu urusan penting. Karena itu kami berpendapat, tidak selayaknya Anda akan pulang begitu saja.' Sebagian yang lain mengatakan; 'Anda datang membawa suatu rombongan besar, yang disana terdapat para sahabat Rasulullah shallallahu 'alaihi wasallam. Kami tidak sependapat jika Anda menghadapkan mereka kepada wabah ini.' Kata 'Umar; 'Pergilah kalian dari sini! ' Kemudian 'Umar berkata lagi; 'Panggil ke sini orang-orang Anshar! ' Maka aku memanggil mereka lalu 'Umar bermusyawarah dengan mereka. Ternyata kebijaksanaan mereka sama dengan orang-orang Muhajirin. Mereka berbeda pendapat seperti orang-orang Muhajirin. Maka kata 'Umar; 'Pergilah kalian dari sini! ' Kata 'Umar selanjutnya; 'Panggil ke sini pemimpin-pemimpin Quraisy yang hijrah sebelum penaklukan Makkah! ' Maka aku memanggil mereka. Ternyata mereka semuanya sependapat, tidak ada perbedaan. Kata mereka; 'Kami berpendapat, sebaiknya Anda pulang saja kembali bersama rombongan Anda dan jangan menghadapkan mereka kepada wabah ini. Lalu 'Umar menyerukan kepada rombongannya; 'Besok pagi-pagi aku akan kembali pulang. Karena itu bersiap-siaplah kalian! ' Abu 'Ubaidah bin Jarrah bertanya; 'Apakah kita hendak lari dari takdir Allah? ' Jawab 'Umar; 'Mengapa kamu bertanya demikian hai Abu 'Ubaidah? Agaknya 'Umar tidak mau berdebat dengannya. Dia menjawab; Ya, kita lari dari takdir Allah kepada takdir Allah. Bagaimana pendapatmu, seandainya engkau mempunyai seekor unta, lalu engkau turun ke lembah yang mempunyai dua sisi. Yang satu subur dan yang lain tandus. Bukanlah jika engkau menggembalakannya di tempat yang subur, engkau menggembala dengan takdir Allah juga, dan jika engkau menggembala di tempat tandus engkau menggembala dengan takdir Allah? ' Tiba-tiba datang ['Abdurrahman bin 'Auf] yang sejak tadi belum hadir karena suatu urusan. Lalu dia berkata; 'Aku mengerti masalah ini. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Apabila kamu mendengar wabah berjangkit di suatu negeri, janganlah kamu datangi negeri itu. Dan apabila wabah itu berjangkit di negeri tempat kamu berada, maka janganlah keluar dari negeri itu karena hendak melarikan diri.' Ibnu 'Abbas berkata; 'Umar bin Khaththab lalu mengucapkan puji syukur kepada Allah, setelah itu dia pergi.' Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi'] dan [Abad bin Humaid], [Ibnu Rafi'] berkata; Telah menceritakan kepada kami, sedangkan yang lainnya berkata; Telah mengabarkan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Ma'mar] melalui jalur ini sebagaimana Hadits Malik. Di dalam Hadits Ma'mar ada tambahan Umar berkata; bukankah jika kamu mengembalakan unta di tempat yang tandus dengan meninggalkan tempat yang subur berarti kamu telah membuatnya lemah? Abu Ubaidah menjawab; 'Ya.' Umar berkata; maka berangkatlah! Maka Abu Ubaidah berangkat hingga sampai di Madinah, lalu dia berkata; 'Insya Allah ini adalah tempat tinggal.' Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah bin Yahya] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahab] Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] melalui jalur ini. Hanya saja dia berkata; Sesungguhnya Abdullah bin Al Harits yang menceritakan kepadanya bukan Abdullah bin Abdullah",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 139
			}
		}
	]
}