{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5819,
			"arabicnumber": "2229.01",
			"text": "Telah menceritakan kepada kami [Hasan bin 'Ali Al Hulwani] dan ['Abad bin Humaid]. [Hasan] berkata; Telah menceritakan kepada kami [Ya'qub]. Dan ['Abad] berkata; Telah menceritakan kepadaku [Ya'qub bin Ibrahim bin Sa'd]; Telah menceritakan kepada kami [Bapakku] dari [Shalih] dari [Ibnu Syihab]; Telah menceritakan kepadaku ['Ali bin Husain] bahwa ['Abdullah bin 'Abbas] berkata; \"Seorang sahabat Nabi shallallahu 'alaihi wasallam dari kalangan Anshar bercerita kepadaku; bahwa pada suatu malam ketika mereka sedang duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba mereka dijatuhi bintang (meteor) yang bersinar. Maka Rasulullah shallallahu 'alaihi wasallam bertanya kepada mereka: 'Apa yang kalian katakan pada masa jahiliyah apabila dijatuhi bintang seperti ini? ' Jawab mereka; 'Allah dan Rasul-Nya yang lebih tahu. Dahulu kami berkomentar; 'Malam ini telah lahir orang yang besar dan telah meninggal orang yang besar pula.' Maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya bintang (meteor) itu tidak jatuh karena meninggalnya seseorang dan tidak pula karena lahirnya seseorang. Tetapi Rabb kita, yang nama-Nya penuh berkah dan Maha Tinggi, apabila Dia memutuskan suatu urusan, maka bertasbihlah pemikul 'Arasy, kemudian bertasbih pula penduduk langit setelah mereka, sehingga tasbih mereka terdengar pula oleh penduduk langit dunia ini. Kemudian orang-orang yang dekat pemikul 'Arasy berkata kepada mereka; 'Apa yang telah difirmankan Rabb kalian? ' Lalu mereka ceritakan apa yang telah difirmankan Allah. Maka penduduk langit yang lainnya pun saling mencari kabar tersebut sesama mereka, sehingga berita itu sampai pula kepada penduduk langit dunia ini. Berita itu tertangkap oleh bangsa jin, lalu dibisikkannya kepada pemimpin-pemimpin mereka, tetapi mereka dilempar karenanya. Maka apa yang disampaikannya menurut berita yang sebenarnya, itu benar. Tetapi biasanya mereka bohong dan beritanya mereka tambah-tambah.' Dan telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Al Walid bin Muslim]; Telah menceritakan kepada kami [Abu 'Amru Al Auza'i]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Ath Thahir] dan [Harmalah] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Salamah bin Syabib]; Telah menceritakan kepada kami [Al Hasan bin A'yan]; Telah menceritakan kepada kami [Ma'qil] yaitu Ibnu 'Ubaidillah seluruhnya dari [Az Zuhri] melalui jalur ini. Kecuali Yunus berkata; dari 'Abdullah bin 'Abbas; Telah mengabarkan kepadaku beberapa sahabat Rasulullah shallallahu 'alaihi wasallam dari kalangan Anshar. Dan di dalam Hadits Al Auza'i di sebutkan; 'Akan tetapi mereka berbohong dan menambah-nambahi beritanya.' Sedangkan di dalam Hadits Yunus dengan menggunakan lafazh 'Wa laakinnahum' (tetapi mereka). Juga ada tambahan; Allah Ta'ala berfirman; \"Sehingga apabila telah dihilangkan ketakutan dari hati mereka, mereka berkata; 'Apakah yang telah di firmankan oleh Tuhanmu? Mereka menjawab; 'Perkataan yang benar.' Adapun di dalam Hadits Ma'qil, 'sama dengan Hadits Yunus.' sebagaimana dikatakan oleh Al Auza'i",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 171
			}
		}
	]
}