{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5839,
			"arabicnumber": "2236.01",
			"text": "Dan telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin 'Amru bin Sarh]; Telah mengabarkan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku [Malik bin Anas] dari [Shaifi] yaitu budak dari Ibnu Aflah; Telah mengabarkan kepadaku [Abu As Saib] -budak- Hisyam bin Zuhrah bahwa suatu ketika dia menemui [Abu Sa'id Al Khudri] di rumahnya. Abu Saib berkata; \"Ketika itu saya mendapatkan Abu Said sedang shalat. Lalu saya menungguinya hingga ia selesai shalat. Tiba-tiba saya mendengar sesuatu yang bergerak di pelepah kurma di sudut rumah, lalu saya pun menoleh kepadanya. Ternyata di sana ada seekor ular, maka saya meloncat dari tempat duduk saya untuk membunuhnya. Namun, tak di duga sebelumnya, Abu Sa'id Al Khudri malah memberi isyarat kepada saya agar tetap duduk. Akhirnya saya pun kembali ke tempat duduk saya. Selesai shalat, Abu Sa'id menunjuk sebuah rumah di perkampungan itu seraya berkata; 'Kamu melihat rumah itu hai sahabatku? ' Saya menjawab; 'Ya, saya melihatnya.' Abu Sa'id melanjutkan ucapannya; 'Di rumah itu dulu ada seorang pemuda yang termasuk keluarga kami dan baru saja melangsungkan pernikahannya (pengantin baru). Dulu kami berangkat menuju medan perang Khandak bersama Rasulullah shallallahu 'alaihi wasallam. Ketika itu pemuda tersebut meminta izin kepada Rasulullah, pada tengah hari, untuk segera pulang menemui isterinya. Akhirnya Rasulullah memberinya izin seraya berkata kepadanya: 'Bawalah senjatamu, karena aku khawatir orang-orang Bani Quraizhah akan menyerangmu! ' Tak lama kemudian, lelaki itu mengambil senjatanya dan pulang ke rumahnya. Setibanya di rumah, ia mendapati isterinya sedang berdiri di tengah pintu. Tak ayal lagi, ia pun langsung mengarahkan tombaknya ke arah isterinya (karena rasa cemburu). Namun isterinya malah berkata kepadanya; 'Tahanlah tombakmu dan masuklah ke dalam rumah agar kamu tahu mengapa aku berada di luar! ' Laki-laki itu masuk ke dalam rumah dan ternyata di dalamnya ada seekor ular besar yang sedang melingkar di atas tempat tidur. Tanpa berkata-kata lagi, langsung ia tikam ular tersebut dengan tombak yang di pegangnya. Setelah itu ia keluar seraya menancapkan tombaknya di depan rumah. Tiba-tiba ular tersebut menghantamnya. Tidak dapat diketahui dengan pasti, siapakah yang mati terlebih dahulu, ular atau pemuda itu? ' Abu Sa'id Al Khudri berkata; 'Akhirnya kami mendatangi Rasulullah shallallahu 'alaihi wasallam untuk melaporkan peristiwa tersebut kepada beliau. Lalu kami berkata; \"Ya Rasulullah, mohonkanlah kepada Allah agar dia dapat hidup! ' Rasulullah pun menjawab: 'Sesungguhnya di kota Madinah ini ada sekelompok jin yang telah masuk Islam. Apabila kamu melihat sesuatu yang aneh dari mereka, maka berilah izin kepada mereka untuk menetap di rumah selama tiga hari. Tetapi, jika setelah tiga hari tidak mau pergi juga, maka bunuhlah ia! Karena ia itu adalah syetan! ' Dan telah menceritakan kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Wahab bin Jarir bin Hazim] Telah menceritakan kepada kami [Bapakku] dia berkata; Aku mendengar [Asma' bin Ubaid] bercerita dari seorang laki-laki yang biasa dipanggil dengan As Saib, menurut kami dia adalah [Abu As Saib] dia berkata; kami menemui [Abu Sa'id Al Khudzri], tatkala kami sedang duduk, kami mendengar gerakan suara di bawah tempat tidurnya, lalu kami lihat ternyata seekor ular. -dan seterusnya sebagaimana Hadits Malik dari Shaifi. Dan di dalamnya disebutkan; kemudian Rasulullah bersabda: 'Sesungguhnya di kota Madinah ini ada sekelompok jin. Apabila kamu melihat sesuatu yang aneh dari mereka, maka berilah izin kepada mereka untuk menetap di rumah selama tiga hari. Tetapi, jika setelah tiga hari tidak mau pergi juga, maka bunuhlah ia! Karena ia itu adalah kafir! ' Beliau juga bersabda: 'pergilah kalian untuk menguburkan teman kalian",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 190
			}
		}
	]
}