{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 584,
			"arabicnumber": "249.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Suraij bin Yunus] dan [Qutaibah bin Sa'id] dan [Ali bin Hujr] semuanya meriwayatkan dari [Ismail bin Ja'far], [Ibnu Ayyub] berkata, telah menceritakan kepada kami [Ismail] telah mengabarkan kepadaku [al-'Ala'] dari [bapaknya] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam pernah mendatangi pekuburan lalu bersabda: \"Semoga keselamatan terlimpahkah atas kalian penghuni kuburan kaum mukminin, dan sesungguhnya insya Allah kami akan bertemu kalian, \" sungguh aku sangat gembira seandainya kita dapat melihat saudara-saudara kita.\" Para Sahabat bertanya, 'Tidakkah kami semua saudara-saudaramu wahai Rasulullah? ' Beliau menjawab dengan bersabda: \"Kamu semua adalah sahabatku, sedangkan saudara-saudara kita ialah mereka yang belum berwujud.\" Sahabat bertanya lagi, 'Bagaimana kamu dapat mengenali mereka yang belum berwujud dari kalangan umatmu wahai Rasulullah? ' Beliau menjawab dengan bersabda: \"Apa pendapat kalian, seandainya seorang lelaki mempunyai seekor kuda yang berbulu putih di dahi serta di kakinya, dan kuda itu berada di tengah-tengah sekelompok kuda yang hitam legam. Apakah dia akan mengenali kudanya itu? ' Para Sahabat menjawab, 'Sudah tentu wahai Rasulullah.' Beliau bersabda lagi: 'Maka mereka datang dalam keadaan muka dan kaki mereka putih bercahaya karena bekas wudlu. Aku mendahului mereka ke telaga. Ingatlah! Ada golongan lelaki yang dihalangi dari datang ke telagaku sebagaimana dihalaunya unta-unta sesat'. Aku memanggil mereka, 'Kemarilah kamu semua'. Maka dikatakan, 'Sesungguhnya mereka telah menukar ajaranmu selepas kamu wafat'. Maka aku bersabda: \"Pergilah jauh-jauh dari sini.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz] -yaitu ad-darawardi. (dalam riwayat lain disebutkan) Dan telah menceritakan kepadaku [Ishaq bin Musa al-Anshari] telah menceritakan kepada kami [Ma'n] telah menceritakan kepada kami [Malik] semuanya meriwayatkan dari [al-'Ala' bin Abdurrahman] dari [bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam keluar menuju pekuburan seraya berkata, \"Semoga keselamatan terlimpahkan kepada kalian wahai penduduk kuburan kaum mukminin. Dan sesungguhnya insya Allah kita pasti bertemu, \" sebagaimana hadits Ismail bin Ja'far, hanya saja hadits Malik menyebutkan, \"Sungguh, sekelompok laki-laki akan dihalau dari telagaku",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		}
	]
}