{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6202,
			"arabicnumber": "2396",
			"text": "Telah menceritakan kepada kami [Manshur bin Abu Muzahim]; Telah menceritakan kepada kami [Ibrahim] yaitu Ibnu Sa'ad; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Hasan Al Hulwani] dan ['Abad bin Humaid] keduanya berkata; ['Abad] berkata; Telah mengabarkan kepadaku; dan berkata [Hasan]; Telah menceritakan kepada kami [Ya'qub] yaitu Ibnu Ibrahim bin Sa'ad; Telah menceritakan kepada kami [Bapakku] dari [Shalih] dari [Ibnu Syihab]; Telah mengabarkan kepadaku ['Abdul Hamid bin 'Abdur Rahman bin Zaid], [Muhammad bin Sa'ad bin Abi Waqqash] Telah menceritakan kepadanya bahwa bapaknya yaitu [Sa'ad] berkata; \"Pada suatu ketika Umar bin Khaththab pernah meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk bertamu kepada beliau yang saat itu ada beberapa wanita Quraisy yang sedang berbicara dengan beliau secara panjang lebar dan dengan suara yang lantang. Setelah Umar meminta izin untuk masuk, maka kaum wanita itu segera berdiri dan bersembunyi di balik tirai (hijab). Kemudian Rasulullah shallallahu 'alaihi wasallam mempersilahkan Umar masuk sambil tersenyum-senyum simpul. Umar berkata; \"Apa yang membuat anda tersenyum ya Rasulullah!\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Hai Umar, sebenarnya aku sendiri merasa heran dengan kaum wanita yang berada bersamaku tadi. Karena, ketika mereka mendengar suaramu, maka mereka segera bersembunyi.\" Lalu Umar berkata, Sebenarnya engkaulah yang lebih berhak mereka segani.\" Kemudian Umar menoleh ke tabir tempat kaum wanita dan berkata; \"Hai orang-orang yang menjadi musuhnya sendiri, apakah kalian merasa segan kepadaku dan tidak segan kepada Rasulullah?\" Kaum wanita Quraisy itu pun menjawab; \"Ya, karena engkau lebih keras dari Rasulullah!\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda; \"Demi jiwaku yang berada di tangan-Nya, sungguh tak ada syetan yang berpapasan denganmu di suatu jalan ya Umar, melainkan syetan tersebut akan berpaling ke jalan lain untuk menghindar dari jalanmu.\" Telah menceritakan kepada kami [Harun bin Ma'ruf]; Telah menceritakan kepada kami dengannya ['Abdul 'Aziz bin Muhammad]; Telah mengabarkan kepadaku [Suhail] dari [Bapaknya] dari [Abu Hurairah] bahwa 'Umar bin Al Khaththab datang kepada Rasulullah shallallahu 'alaihi wasallam yang di saat itu ada beberapa wanita Quraisy sedang berbicara dengan beliau dengan suara yang lantang. Setelah Umar meminta izin untuk masuk, maka kaum wanita itu segera berdiri dan bersembunyi di balik tirai (hijab) -sebagaimana Hadits Az Zuhri",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 32
			}
		}
	]
}