{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6220,
			"arabicnumber": "2404.04",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin 'Abbad], lafazh keduanya tidak jauh berbeda. keduanya berkata; Telah menceritakan kepada kami [Hatim] yaitu Ibnu Isma'il dari [Bukair bin Mismar] dari ['Amir bin Sa'ad bin Abi Waqqash] dari [Bapaknya] dia berkata; Mu'awiyah bin Abu Sufyan pernah menyuruh Sa'ad dan menanyakan kepadanya tentang sikapnya kepada Ali, dia berkata; 'Kenapa kamu tidak mau menyalahkan Ali? Dia menjawab; 'Aku teringat kepada tiga hal tentang kedudukan Ali yang pernah di ucapkan oleh Rasulullah shallallahu 'alaihi wasallam, maka aku selamanya tidak akan mencelanya karena tiga hal tersebut. Sesungguhnya salah satu dari tiga hal tersebut lebih aku sukai dari pada seekor sapi yang mahal. Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam berkata kepada Ali, -ketika beliau mengangkatnya sebagai pengganti (di Madinah) dalam beberapa peperangan beliau. Ali bertanya; \"Apakah anda meninggalkanku bersama para wanita dan anak-anak!\" beliau menjawab: \"Wahai Ali, tidakkah kamu rela bahwa kedudukanmu denganku seperti kedudukan Harun dengan Musa? hanya saja tidak ada Nabi setelahku.\" Dan saya juga mendengar beliau bersabda pada Perang Khaibar; \"Sungguh, saya akan memberikan bendera ini kepada seorang laki-laki yang mencintai Allah dan RasulNya dan Allah dan RasulNya juga mencintainya.\" Maka kami semuanya saling mengharap agar mendapatkan bendera itu. Beliau bersabda: \"Panggilllah Ali!\" kemudian dia dihadirkan dalam keadaan sakit matanya. Lantas beliau meludahi matanya dan menyerahkan bendera tersebut kepadanya, kemudian Allah memberi kemenangan kepadanya. Tatkala turun ayat: (Marilah kita memanggil anak-anak kami dan anak-anak kamu.) Rasulullah shallallahu 'alaihi wasallam memanggil Ali, Fatimah, Hasan dan Husain dan bersabda: \"Ya Allah, mereka adalah keluargaku",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 50
			}
		}
	]
}