{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6238,
			"arabicnumber": "1748.03",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Al Hasan bin Musa]; Telah menceritakan kepada kami [Zuhair]; Telah menceritakan kepada kami [Simak bin Harb]; Telah menceritakan kepadaku [Mush'ab bin Sa'ad] dari [Bapaknya] bahwa ada beberapa ayat Al Qur'an yang turun berkenaan dengan Sa'ad. Mush'ab berkata; \"Ibu Sa'ad bersumpah tidak akan mau berbicara dengan Sa'ad selama-lamanya hingga ia (Sa'ad) meninggalkan ajaran Islam. Selain itu, ibunya juga tidak mau makan dan minum.\" Ibu Sa'ad berkata kepada Sa'ad; \"Hai Sa'ad, kamu pernah mengatakan bahwasanya Allah Subhanahu wa Ta'ala telah memerintahkanmu agar kamu selalu berbuat baik kepada kedua orang tuamu?. Sekarang aku adalah ibumu, maka aku perintahkan kepadamu agar meninggalkan Islam.\" Mush'ab berkata; 'Ibu Sa'ad bertahan untuk tidak makan dan minum selama tiga hari tiga malam hingga jatuh pingsan karena lemah. Kemudian Umarah, anak laki-Iakinya, memberinya minum. Lalu ibunya itu selalu memanggil Sa'ad. kemudian turunlah firman Allah yang berbunyi: 'Kami wasiatkan kepada manusia agar berbuat baik kepada kedua orang tuanya' (Qs. Al Ankabuut(29): 8). Sedangkan ayat yang lain berbunyi: Jika kedua orang tuamu memaksamu untuk menyekutukan-Ku dengan sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mematuhi keduanya dan pergaulilah keduanya di dunia dengan baik.' (Qs. Luqmaan (31): 15). Saad berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah memperoleh rampasan perang yang sangat banyak dan ternyata di dalamnya ada sebilah pedang. Lalu saya ambil pedang itu dan membawanya kepada Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Ya Rasulullah, berikanlah pedang tersebut kepada saya, karena saya adalah orang yang telah engkau kenal perangainya.\" Tetapi Rasulullah shallallahu 'alaihi wasallam malah berkata: \"Hai Sa'ad, kembalikanlah pedang itu ke tempat semula, di tempat kamu mengambilnya.'\" Lalu saya pergi, hingga ketika saya ingin mengambilnya kembali, maka saya pun mencela diri saya sendiri. Setelah itu saya menghampiri Rasulullah sambil berkata; \"Ya Rasulullah, berikanlah pedang itu kepada saya!\" Namun Rasulullah tetap pada pendiriannya semula dan menjawabnya dengan suara yang keras: \"Hai Sa'ad, sudah 'kukatakan kepadamu kembalikan pedang itu ke tempat di mana kamu mengambilnya!\" Setelah itu, Allah Subhanahu wa Ta'ala menurunkan firmannya berbunyi: 'Mereka bertanya kepadamu tentang harta rampasan perang' (Qs. Al Anfaal(8): 1). Sa'ad berkata; \"Ketika saya jatuh sakit, saya mengutus seseorang untuk menemui Rasulullah. Setelah itu, beliau pun mendatangi saya. Lalu saya berkata kepada beliau; 'Ya Rasulullah, izinkahlah saya membagikan harta sebagai wasiat sesuka hati. Tetapi, rupanya Rasulullah melarangnya. Saya katakan lagi; \"Bagaimana kalau separuhnya?\" Beliau tetap melarangnya. Kemudian saya berkata lagi; \"Bagaimana kalau sepertiganya?\" BeIiau terdiam sesaat dan setelah itu memperbolehkan wasiat sepertiga harta. Saad berkata; \"Saya pernah mendatangi beberapa orang Anshar dan Muhajirin. Kemudian mereka berkata; 'Kemarilah hai Sa'ad, kami akan memberimu makanan dan minuman keras (khamer).' (Saat itu khamar memang belum diharamkan). Lalu saya mendatangi untuk bergabung dengan mereka di suatu kebun. Ternyata di sana ada kepala unta yang telah dipanggang dan satu wadah minuman keras. Kemudian saya makan dan minum dengan sepuasnya bersama mereka. Kebetulan pada saat itu sedang didiskusikan dan dibicarakan antara mereka tentang keutamaan kaum Anshar dan kaum Muhajirin. Maka saya pun menyatakan bahwa kaum Muhajirin Iebih baik dan utama daripada kaum Anshar. Tentu saja pernyataan saya itu sangat kontroversial dan menyinggung banyak orang yang hadir pada saat itu. Hingga ada salah seorang dari mereka mengambil salah satu dagu dan kepala unta lalu memukulkannya kepada saya hingga mencederai hidung saya. Lalu saya datang menemui Rasulullah dan menceritakan apa yang telah terjadi pada diri saya. Akhirnya turunlah firman Allah yang berbunyi: \"Sesungguhnya minuman Khamr, berjudi, berkorban untuk berhala, dan mengundi nasib dengan panah adalah terbuat keji yang termasuk perbuatan syetan.\" (Al Maidah: 90) Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari [Mush'ab bin Sa'ad] dari [Bapaknya] dia berkata; \"Ada empat ayat Al Qur'an yang turun berkenaan dengan ku, dan seterusnya sebagaimana yang semakna dengan Hadits Zuhair dari Simak. Di dalam Hadist Syu'bah ada tambahan; 'Apabila mereka ingin memberi makan kepada ibunya, mereka membuka dengan tongkat, lalu menuangkan makanan ke dalamnya. Juga di sebutkan di dalam Hadits tersebut; 'lalu salah seorang dari mereka memukul hidung Sa'ad hingga sobek",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 68
			}
		}
	]
}