{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6322,
			"arabicnumber": "2144.04",
			"text": "Telah menceritakan kepadaku [Muhammad bin Hatim bin Maimun]; Telah menceritakan kepada kami [Bahz]; Telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Anas] dia berkata; \"Pada suatu ketika seorang putra Abu Thalhah dan istrinya yang bernama Ummu Sulaim, meninggal dunia Kemudian Ummu Sulaim berkata kepada keluarganya; 'Janganlah kalian memberitahukan musibah ini kepada Abu Thalhah sehingga saya sendiri yang akan memberitahukannya.\" Anas berkata; \"Tak lama kemudian Abu Thalhah tiba di rumah. Seperti biasa, Ummu Sulaim menghidangkan makan malam untuk suaminya. Lalu Abu Thalhah makan dan minum dengan senangnya. Kemudian Ummu Sulaim mulai berhias Iebih cantik daripada hari biasanya hingga Abu Thalhah menggaulinya. Setelah mengetahui bahwasanya Abu Thalhah telah merasa puas dan lega, maka Ummu Sulaim berkata; 'Wahai Abu Thalhah, bagaimana menurut pendapat engkau apabila ada sekelompok orang memberikan pinjaman kepada suatu keluarga. Kemudian, ternyata pinjaman tersebut mereka minta kembali. Apakah boleh keluarga itu menolak permintaannya? Dengan mantap Ahu Thalhah menjawab; \"Tentu saja keluarga itu tidak boleh menolak permintaan kelompok itu.\" Lalu Ummu Sulaim berkata; \"Maka demikian dengan anak kita, ketahuilah bahwasanya anak kita yang tercinta telah diminta oleh Dzat yang telah mencipta dan memilikinya. Oleb karena itu. relakanlah kematian putera kita tersebut\". Betapa terkejut dan marahnya Abu Thalhah mendengar informasi yang disampaikan istrinya itu. Lalu ia pun berkata kepada istrinya; \"Mengapa kamu tidak memberitahukanku terlebih dahulu berita ini? Tetapi kamu malah memberitahukannya kepadaku setelah aku menggaulimu.' Keesokan harinya Abu Thalhah pergi menemui Rasulullah shallallahu 'alaihi wasallam untuk menceritakan kepada beliau tentang apa yang telah terjadi pada keluarganya. Mendengar cerita sedih tersebut, Rasulullah shallallahu 'alaihi wasallam berkata: \"Semoga Allah memberkahi kalian berdua dalam menjalani malam kalian.\" Anas berkata; 'Beberapa bulan kemudian, Ummu Sulaim mulai memperlihatkan tanda-tanda kehamiIan. Suatu ketika. Rasulullah sedang bepergian dan Ummu Sulaim turut serta dalam perjalanan tersebut. Biasanya, apabila Rasulullah datang dari bepergian - setibanya di Madinah- maka beliau tidak langsung masuk ke kampung. Sesampainya di dekat kota Madinah, Ummu Sulaim mulai merasakan saat-saat kelahiran hingga Abu Thalhah berhenti untuk mendampinginya. sementara Rasulullah telah pergi. Abu Thalhah berkata; 'Ya Allah ya Tuhanku, sesungguhnya Engkau Maha Tahu bahwasanya saya merasa senang keluar untuk menyertai Rasul-Mu ketika beliau keluar. Begitu pula saya merasa senang masuk untuk menyertainya, ketika beliau akan masuk (kota madinah). Tapi sekarang saya terhenti seperti yang Engkau lihat.\" Anas berkata; 'Ummu Sulaim berkata; Hai Abu Thalhah, saya sudah tidak tahan lagi. Ayolah terus percepat perjalanan! ' Anas berkata; 'Akhirnya kami terus melanjutkan perjalanan.\" Anas berkata; \"Ketika tiba di kota Madinah, maka Ummu Sulaim pun melahirkan seorang anak laki-laki dengan selamat. Ibu saya (Ummu Sulaim) berkata kepada saya; Hai Anas, janganlah ada seorang pun yang menyusui bayi ini hingga kamu membawanya ke hadapan Rasulullah.' Esok harinya, saya membawa bayi tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Saya temui beliau yang pada saat itu sedang memegang alat untuk memberi tanda pada hewan. Ketika Rasulullah shallallahu 'alaihi wasallam melihat saya, beliau berkata; \"Hai Unais, apakah Ummu Sulaim telah melahirkan?\" Maka saya dengan senang hati menjawab pertanyaan beliau; \"Ya, \" ia telah melahirkan, ya Rasulullah.\" Kemudian beliau letakkan alat untuk memberi tanda pada hewan itu. Lalu saya pun membawa bayi itu ke hadapan Rasulullah dan meletakkannya di atas pangkuan beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam minta dibawakan kurma ajwa Madinah. Lalu beliau lumatkan kurma tersebut dengan mulut beliau dan disuapkannya ke dalam mulut bayi itu. Maka bayi itu segera mengunyahnya. Rasulullah shallallahu 'alaihi wasallam berkata; \"Lihatlah, memang kaum Anshar itu sangat menyukai kurma!\" Anas berkata; \"Kemudian Rasulullah shallallahu 'alaihi wasallam mengusap wajah bayi itu dengan penuh kasih sayang serta memberinya nama Abdullah.\" Telah menceritakan kepada kami [Ahmad bin Al Hasan bin Khirasy]; Telah menceritakan kepada kami ['Amru bin 'Ashim]; Telah menceritakan kepada kami [Sulaiman bin Al Mughirah]; Telah menceritakan kepada kami [Tsabit]; Telah menceritakan kepadaku [Anas bin Malik] dia berkata; 'Putra Abu Thalhah meninggal……-dan seterusnya dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 152
			}
		}
	]
}