{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6401,
			"arabicnumber": "2494.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], ['Amru An Naqid], [Zuhair bin Harb], [Ishaq bin Ibrahim] dan [Ibnu Abu 'Umar] lafazh ini milik 'Amru. [Ishaq] berkata; Telah mengabarkan kepada kami, sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru] dari [Al Hasan bin Muhammad]; Telah mengabarkan kepadaku ['Ubaidullah bin Abu Rafi'] yaitu seorang juru tulis Ali dia berkata; Aku mendengar [Ali] berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah menugaskan saya, Zubair, dan Miqdad. Sebelum berangkat, Rasulullah berkata: 'Berangkatlah ke taman Khakh dan di sana ada seorang wanita yang membawa surat. Lalu, rebutlah surat tersebut darinya! ' Kemudian kami berangkat dengan mengendarai kuda dan di sana kami menjumpai seorang wanita. Lalu kami berkata kepadanya; 'Keluarkanlah surat yang kamu bawa itu! ' Wanita itu menjawab; 'Aku tidak membawa surat.' Kami berkata kepadanya sambil memberi ultimatum; 'Kamu keluarkan surat tersebut atau kami akan menelanjangimu dengan paksa.' Maka ia keluarkan surat itu dari balik sanggul rambutnya. Lalu kami bawa surat tersebut kepada Rasulullah shallallahu 'alaihi wasallam dan ternyata di dalamnya tertulis; 'Dari Hathib bin Abu Balta'ah untuk kaum kafir Quraisyy Makkah tentang beberapa urusan Rasulullah shallallahu 'alaihi wasallam.' Rasulullah bertanya; 'Hai Hathib, ada apa ini? ' Hathib menjawab; 'Ya Rasulullah, janganlah engkau tergesa-gesa marah kepada saya! Sebenarnya saya dulu pernah akrab dengan kaum kafir Quraisyy Makkah (Kata Abu Sufyan; 'Hathib adalah sekutu kaum kafir Quraisyy, tetapi dia sendiri bukan orang Quraisyy). Saya juga dulu pernah turut serta berhijrah bersama engkau meninggalkan keluarga di kota Makkah yang mereka dipelihara oleh kerabat mereka. Ketika kerabat mereka sudah tidak ada lagi, maka saya ingin ada jaminan dari mereka untuk melindungi keluarga saya. Tentunya, saya melakukan hal ini bukan karena kafir ataupun murtad dari agama saya. Karena, bagaimana pun juga saya tidak rela menjadi kafir setelah masuk Islam.' Mendengar penjelasan Iangsung dari Hathib, Rasulullah pun bersabda: 'Kamu benar hai Hathib.' Tiba-tiba Umar bin Khaththab berkata; 'Ya Rasulullah, izinkanlah saya untuk memenggal leher orang munafik ini! ' Rasulullah shallallahu 'alaihi wasallam berkata: 'Hai Umar, tahukah kamu bahwasanya Hathib turut juga dalam perang Badar. Tidakkah engkau mengetahui sesungguhnya Allah telah memberikan keringanan bagi orang-orang yang turut dalam perang Badar dan berfirman: 'Silahkanlah kalian berbuat sesuka kalian, sesungguhnya Aku telah mengampuni kalian! ' Kemudian Allah Subhanahu wa Ta'ala menurunkan ayat yang berbunyi: 'Hai orang-orang yang beriman, janganlah kamu menjadikan musuh-Ku dan musuhmu sebagai teman-teman setia.' (A1 Mumtahanah (60): 1). Ishaq mencantumkan ayat tersebut dalam riwayatnya berdasarkan qiraat Abu Sufyan. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Muhammad bin Fudhail]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Abdullah bin Idris]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Rifa'ah bin Al Haitsam Al Wasithi]; Telah menceritakan kepada kami [Khalid] yaitu Ibnu 'Abdullah seluruhnya dari [Hushain] dari [Sa'ad bin 'Ubadah] dari [Abu 'Abdur Rahman As Sulami] dari ['Ali] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah menugaskan saya, Abu Martsad Al Ghanawi dan Zubair bin Awwam dengan mengendarai kuda Sebelum berangkat, Rasulullah berkata: 'Berangkatlah ke taman Khakh dan di sana ada seorang wanita dari kalangan orang-orang musyrik yang membawa surat dari Hathib kepada kamu musyrikin… -Selanjutnya sebagaimana Hadits yang semakna dengan Hadits Ubaidullah bin Abu Rafi' dari Ali",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 232
			}
		}
	]
}