{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6405,
			"arabicnumber": "2497",
			"text": "Telah menceritakan kepada kami [Abu 'Amir Al Asy'ari] dan [Abu Kuraib] seluruhnya dari [Abu Usamah] berkata; [Abu 'Amir] Telah menceritakan kepada kami [Abu Usamah]; Telah menceritakan kepada kami [Buraid] dari [Kakeknya Abu Burdah] dari [Abu Musa] dia berkata; \"Saya pernah berada di sisi Rasulullah shallallahu 'alaihi wasallam ketika beliau tengah singgah bersama Bilal di Ji'ranah, yaitu suatu wilayah antara Makkah dan Madinah. Tak lama kemudian, seorang Arab kampung datang menemui Rasulullah shallallahu 'alaihi wasallam dan berkata; 'Ya Muhammad, mengapa kamu tidak melaksanakan apa yang telah kamu janjikan kepadaku? ' Maka Rasulullah pun berkata kepada orang Arab kampung itu: 'Ada berita gembira untukmu.' Namun orang Arab tersebut malah berkata kepada Rasulullah; 'Kamu selalu mengatakan kepadaku; 'Ada kabar kabar gembira untukmu.' Kemudian Rasulullah berpaling darinya dan menghadap kepada Abu Musa dan Bilal seperti sikap orang yang sedang marah seraya berkata: 'Rupanya orang Arab kampung itu menolak berita gembira dariku. Sebaiknya kalian saja yang menghadapinya.' Kedua orang sahabat itu menjawab; 'Kami menerimanya ya Rasulullah! ' Setelah itu Rasulullah meminta segelas air. Lalu beliau basuh kedua tangan dan wajahnya dengan air tersebut. Kemudian beliau meludah ke dalam air itu seraya berkata kepada Abu Musa dan Bilal: 'Minumlah air ini hai Aba Musa dan Bilal! Setelah itu, tuangkanlah air tersebut untuk membasuh wajah dan leher kalian. Kemudian sampaikanlah kabar gembira tentang Islam kepada laki-laki itu! ' Keduanya mengambil gelas tersebut dan segera melaksanakan apa yang telah diperintahkan Rasulullah kepada mereka. Tak lama kemudian, Ummu Salamah, istri Rasulullah, memanggil Abu Musa dan Bilal dari balik tabir; 'Hai Bilal dan Abu Musa, sisakanlah air tersebut untukku (ibu kalian)! ' Akhirnya mereka menyisakan air tersebut untuk Ummu Salamah",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 236
			}
		}
	]
}