{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6411,
			"arabicnumber": "2503",
			"text": "Telah menceritakan kepada kami [Abdullah bin Barrad Al Asy'ari] dan [Muhammad bin Al Allaa Al Hamdani] keduanya berkata; Telah menceritakan kepada kami [Abu Usamah] Telah menceritakan kepadaku [Buraid] dari [Abu Burdah] dari [Abu Musa] dia berkata; \"Ketika kami sedang berada di Yaman, kami mendapat informasi tentang tujuan hijrah yang diperintahkan oleh Rasulullah shallallahu 'alaihi wasallam, lalu kami pun turut pergi untuk berhijrah ke wilayah tersebut (Habasyah). Pada saat itu kami terdiri dari diri saya sendiri dan dua orang saudara laki-laki saya. Saya adalah orang yang paling kecil, sementara saudara saya yang satu bernama Abu Burdah dan yang lainnya bernama Abu Ruhm.\" Abu Musa berkata; 'Mereka terdiri dari beberapa orang atau Iima puluh tiga orang atau lima puluh dua orang dari kaum kami.' Abu Musa berkata; 'Kami berlayar hingga terbawa oleh perahu kami ke Raja Najasyi di Habasyah. Kemudian kami bergabung dengan Ja'far bin Abu Thalib beserta rombongannya di sisi Raja Najasyi. Ja'far berkata; 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah mengutus kami kemari. Selain itu, beliau juga menyuruh kami untuk menetap sini. OIeh karena itu, menetaplah kalian bersama kami.' Abu Musa berkata; 'Lalu kami tinggal bersama Ja'far hingga kami semua datang.' Abu Musa berkata; 'Kami semua bertemu dengan Rasulullah shallallahu 'alaihi wasallam ketika beliau telah memenangkan perang Khaibar. Beliau memberikan jatah rampasan perang kepada kami. Beliau tidak memberikan jatah rampasan perang sedikitpun kepada orang yang tidak ikut dalam penaklukan Khaibar, kecuali kepada orang yang ikut berperang bersama beliau dan kepada orang yang ikut dalam rombongan kami bersama Ja'far dan kawan-kawannya.' Abu Musa berkata; 'Ada sebagian orang yang mengatakan kepada kami yang bergabung dalam pelayaran hijrah ke Habasyah; 'Kami mengungguli kalian dalam masalah hijrah.' Abu Musa berkata; 'Asma' binti Umais, yang termasuk dalam rombongan pelayaran kami, pernah berkunjung ke rumah Hafshah, istri Rasulullah shallallahu 'alaihi wasallam. Asma' pernah turut hijrah ke Raja Najasyi.' Pada suatu ketika Umar bin Khaththab masuk ke rumah Hafshah, kebetulan Asma' sedang berada di situ. Ketika Umar melihat Asma' ada di dalam rumah, maka ia pun bertanya; 'Siapa ini hai Hafshah? ' Hafshah menjawab; 'Dia adalah Asma' binti Umais! ' Umar bertanya lagi; 'Apakah ia pernah ikut hijrah ke Habasyah dengan berlayar? ' Asma' binti Umais menjawab; 'Ya, saya turut hijrah ke Habasyah.' Umar melanjutkan ucapannya; 'Kalau begitu, kami lebih berhak terhadap Rasulullah daripada kalian.' Asma' menjadi marah dan berkata; 'Kamu berdusta hai Umar! Demi Allah, kalian memang menyertai hijrah Rasulullah shallallahu 'alaihi wasallam. Tapi beliau memberi makan orang yang lapar di antara kalian dan memberi nasihat orang yang tidak mengerti di antara kalian, sedangkan kami berhijrah ke suatu negeri yang amat jauh di Habasyah yang penuh dengan tantangan karena Allah dan Rasul-Nya. Demi Allah, saya tidak akan makan dan minum sebelum saya laporkan ucapanmu itu kepada Rasulullah shallallahu 'alaihi wasallam. Karena kami merasa dihina dan dicemaskan. Oleh karena itu, akan saya adukan persoalan ini kepada Rasulullah shallallahu 'alaihi wasallam. Demi Allah. saya tidak berdusta dan tidak mengada-ada.' Abu Musa berkata; 'Ketika Rasulullah shallallahu 'alaihi wasallam datang ke rumah Hafshah, maka Asma' pun langsung menghadap beliau dan mengadukan persoalan yang mengganjal hatinya; 'Ya Rasulullah, Umar bin Khaththab tadi mengutarakan begini dan begitu.' Mendengar pengaduan Asma binti Umais itu, Rasulullah shallallahu 'alaihi wasallam berkata: 'Ketahuilah oleh mu hai Asma, Umar bukanlah orang yang lebih berhak daripada kalian terhadapku. Umar dan para sahabatnya hanya mendapat ganjaran pahala sekali hijrah. Sebaliknya kalian yang tergabung dalam hijrah dengan mengendarai perahu itu mendapat dua kali pahala hijrah.' Asma' binti Umais berkata; 'Setelah itu, saya melihat Abu Musa dan para sahabat yang tergabung dalam hijrah ke Habasyah dengan mengendarai perahu datang berbondong-bondong untuk bertanya kepada saya tentang hadits ini. Di dunia ini tidak ada yang Iebih menyenangkan dan membesarkan jiwa mereka dan apa yang disabdakan Rasulullah kepada mereka.' Abu Burdah berkata; 'Asma' berkata; 'Sungguh saya lihat Abu Musa dan ia meminta saya mengulangi lagi hadits itu",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 241
			}
		}
	]
}