{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6425,
			"arabicnumber": "2511.05",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] Telah mengabarkan kepada kami [Al Mughirah bin Abdurrahman] dari [Abu Zinad] dia berkata; [Abu Salamah] menyaksikan [Abu Usaid Al Anshari] bahwa dia melihat Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kabilah Anshar adalah Bani Najjar, kemudian Bani Abdul Asyhal, kemudian Bani Harits bin Khazraj, kemudian Bani Saidah dan setiap kabilah Anshar mempunyai kebaikan.\" Abu Salamah berkata; 'Abu Usaid berkata; 'Saya dituduh mendustakan sabda Rasulullah shallallahu 'alaihi wasallam? Kalau saya berdusta, tentu saya akan menempatkan kaum saya, Bani Saidah, pada urutan yang pertama.' Hadits itu sampai kepada Sa'ad bin Ubadah. Lalu ia merasa tersinggung. Sa'ad bin Ubadah berkata; 'Kita ditempatkan pada urutan belakang, yaitu urutan keempat? Hai keluargaku, siapkan keledaiku, aku akan menemui Rasulullah! ' Tetapi niatannya itu dicegah oleh Sahal, kemenakannya, seraya berkata; 'Hai paman, apakah engkau akan pergi hanya untuk membantah Rasulullah, padahal beliau Iebih tahu dari kita? Tidak merasa cukupkah paman berada pada urutan keempat? ' Sa'ad kembali berkata; 'Allah dan Rasul-Nya lebih tahu.' Kemudian ia memerintahkan pembantunya untuk menambatkan keledainya dan melepas pelananya. Telah menceritakan kepada kami [Amru bin Ali bin Bahr] Telah menceritakan kepadaku [Abu Daud] Telah menceritakan kepada kami [Harb bin Syadad] dari [Yahya bin Abu Katsir] Telah menceritakan kepadaku [Abu Salamah] bahwa [Abu Usaid Al Anshari] menceritakan kepadanya dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kabilah Anshar…-dan seterusnya dengan Hadits yang serupa, namun dia tidak menyebutkan kisah Sa'ad bin Ubadah",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 254
			}
		}
	]
}