{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6496,
			"arabicnumber": "2545",
			"text": "Telah menceritakan kepada kami ['Uqbah bin Mukram Al 'Ammi]; Telah menceritakan kepada kami [Ya'qub] yaitu Ibnu Ishaq Al Hadhrami; Telah mengabarkan kepada kami [Al Aswad bin Syaiban] dari [Abu Naufal] dia berkata; \"Saya pernah melihat Abdullah bin Zubair disalib di suatu perbukitan antara Madinah dan Makkah. OIeh karena itu, tidaklah mengherankan, apabila kaum Quraisy dan masyarakat muslim lainnya melintasi tempat tersebut. Sehingga Abdullah bin Umar juga melintasi Abdullah bin Zubair dan berdiri di dekatnya seraya berkata; 'Assalaamu 'alaika hai Abu Khubaib! # Assalaamu 'aIaika hai Abu Khubaib! # Assalaamu 'alaika hai Abu Khubaib! # Demi Allah, sungguh aku pernah melarangmu untuk berbuat seperti ini! # Demi Allah, sungguh aku pernah melarangmu untuk berbuat seperti ini! # Demi Allah, sungguh aku pernah melarangmu untuk berbuat seperti ini! ' # Abdullah bin Zubair berkata; 'Demi Allah, sepengetahuanku kamu adalah orang yang rajin bangun malam untuk melaksanakan shalat rajin menyambung tali silaturahim. Demi Allah, kamu adalah ornag yang paling buruk di tengah-tengah umat yang baik.' Setelah itu, Abdullah bin Umar pun pergi meninggalkannya. Sikap Abdullah bin Zubair dan ucapannya itu diketahui oleh Hajjaj Ats Tsaqafi. Lalu ia pun mengirim pasukan untuk menurunkannya dari tiang salib dan melemparkannya ke atas kuburan orang-orang Yahudi. Setelah itu, Al Hajjaj mengirim utusan kepada ibu Abdulah bin Zubair, yaitu Asma' binti Abu Bakar. Tetapi, Asma' tidak menghadap kepada Al Hajjaj. Lalu sekali lagi Al Hajjaj mengirim utusannya kepada Asma' binti Abu Bakar dengan membawa pesan khusus dari Al Hajjaj yang berbunyi; 'Kau datang menghadap kepadaku atau aku kirim pasukan untuk menyeretmu kehadapanku! ' Namun Asma' binti Abu Bakar tetap menolak sambil berkata; 'Demi Allah, aku tidak akan datang menghadapmu sampaipun kamu kirim pasukan untuk menyeretku ke hadapanmu! ' Al Hajjaj berkata; 'Hai pasukan siapkan kudaku! ' Kemudian Hajjaj mengenakan sepatunya dan berangkat dengan membawa pasukannya hingga mereka tiba di depan rumah [Asma' binti Abu Bakar]. Al Hajjaj bertanya kepadanya; 'Hai ibu tua, bagaimanakah pendapatmu tentang perbuatan yang telah aku lakukan kepada musuh Allah (maksudnya adalah anak laki-lakinya, yaitu Abdullah bin Zubair)? ' Asma' binti Abu Bakar pun menjawab dengan lantang; 'Menurutku, kamu telah menghancurkan dunianya sedangkan ia telah menghancurkan akhiratmu.' 'Aku dengar'; ujar Asma'; 'Kamu mengatakan kepadanya (maksudnya kepada Abdullah bin Zubair, puteranya); 'Hai anak seorang wanita yang mempunyai dua ikat pinggang! ' Demi Allah, akulah wanita yang mempunyai dua ikat pinggang itu. Yang satu, pernah aku gunakan untuk membawa makanan Rasulullah dan makanan Abu Bakar dari kendaraannya, sedangkan yang lainnya adalah ikat pinggang yang selalu dibutuhkan kaum wanita. Sesungguhnya RasuluIIah shallallahu 'alaihi wasallam pernah memberitahukan kepada kami bahwasanya di Tsaqif itu ada seorang pembohong dan seorang perusak. Pembohong tersebut telah kami ketahui, sedang perusak itu, kami tak punya prasangka lain selain engkau.' Abu Naufal berkata; 'Kemudian Al Hajjaj meninggalkan tempat Asma' binti Abu Bakar tanpa mengucapkan satu kata pun kepadanya",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 325
			}
		}
	]
}