{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6509,
			"arabicnumber": "2550.02",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Yazid bin Harun]; Telah mengabarkan kepada kami [Jarir bin Hazim]; Telah menceritakan kepada kami [Muhammad bin Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau telah bersabda: \"Tidak ada bayi yang dapat berbicara ketika masih berada dalam buaian kecuali tiga bayi: bayi Isa bin Maryam, dan bayi dalam perkara Juraij.\" Juraij adalah seorang laki-laki yang rajin beribadah. Ia membangun tempat peribadatan dan senantiasa beribadah di tempat itu. Ketika sedang melaksanakan shalat sunnah, tiba-tiba ibunya datang dan memanggilnya; 'Hai Juraij! ' Juraij bertanya dalam hati; 'Ya Allah, manakah yang lebih aku utamakan, melanjutkan shalatku ataukah memenuhi panggilan ibuku? ' Akhirnya ia pun meneruskan shalatnya itu hingga ibunya merasa kecewa dan beranjak darinya. Keesokan harinya, ibunya datang lagi kepadanya sedangkan Juraij sedang melakukan shalat sunnah. Kemudian ibunya memanggilnya; 'Hai Juraij! ' Kata Juraij dalam hati; 'Ya Allah, manakah yang lebih aku utamakan, memenuhi seruan ibuku ataukah shalatku? ' Lalu Juraij tetap meneruskan shalatnya hingga ibunya merasa kecewa dan beranjak darinya. Hari berikutnya, ibunya datang lagi ketika Juraij sedang melaksanakan shalat sunnah. Seperti biasa ibunya memanggil; 'Hai Juraij! ' Kata Juraij dalam hati; 'Ya Allah, manakah yang harus aku utamakan, meneruskan shalatku ataukah memenuhi seruan ibuku? ' Namun Juraij tetap meneruskan shalatnya dan mengabaikan seruan ibunya. Tentunya hal ini membuat kecewa hati ibunya. Hingga tak lama kemudian ibunya pun berdoa kepada Allah; 'Ya Allah, janganlah Engkau matikan ia sebelum ia mendapat fitnah dari perempuan pelacur! ' Kaum Bani Israil selalu memperbincangkan tentang Juraij dan ibadahnya, hingga ada seorang wanita pelacur yang cantik berkata; 'Jika kalian menginginkan popularitas Juraij hancur di mata masyarakat, maka aku dapat memfitnahnya demi kalian.' Rasulullah shallallahu 'alaihi wasallam pun meneruskan sabdanya: 'Maka mulailah pelacur itu menggoda dan membujuk Juraij, tetapi Juraij tidak mudah terpedaya dengan godaan pelacur tersebut. Kemudian pelacur itu pergi mendatangi seorang penggembala ternak yang kebetulan sering berteduh di tempat peribadatan Juraij. Ternyata wanita tersebut berhasil memperdayainya hingga laki-laki penggembala itu melakukan perzinaan dengannya sampai akhirnya hamil. Setelah melahirkan, wanita pelacur itu berkata kepada masyarakat sekitarnya bahwa; 'Bayi ini adalah hasil perbuatan aku dengan Juraij.' Mendengar pengakuan wanita itu, masyarakat pun menjadi marah dan benci kepada Juraij. Kemudian mendatangi rumah peribadatan Juraij dan bahkan menghancurkannya. Selain itu, mereka pun bersama-sama menghakimi Juraij tanpa bertanya terlebih dahulu kepadanya. Lalu Juraij bertanya kepada mereka; 'Mengapa kalian lakukan hal ini kepadaku? ' Mereka menjawab; 'Kami lakukan hal ini kepadamu karena kamu telah berbuat zina dengan pelacur ini hingga ia melahirkan bayi dari hasil perbuatanmu.' Juraij berseru; 'Dimanakah bayi itu? ' Kemudian mereka menghadirkan bayi hasil perbuatan zina itu dan menyentuh perutnya dengan jari tangannya seraya bertanya; 'Hai bayi kecil, siapakah sebenarnya ayahmu itu? ' Ajaibnya, sang bayi langsung menjawab; 'Ayah saya adalah si fulan, seorang penggembala.' Sabda Rasulullah shallallahu 'alaihi wasallam: 'Akhirnya mereka menaruh hormat kepada Juraij. Mereka menciuminya dan mengharap berkah darinya. Setelah itu mereka pun berkata; 'Kami akan membangun kembali tempat ibadahmu ini dengan bahan yang terbuat dari emas.' Namun Juraij menolak dan berkata; 'Tidak usah, tetapi kembalikan saja rumah ibadah seperti semula yang terbuat dari tanah liat.' Akhirnya mereka pun mulai melaksanakan pembangunan rumah ibadah itu seperti semula. Dan bayi ketiga, Ada seorang bayi sedang menyusu kepada ibunya, tiba-tiba ada seorang laki-laki yang gagah dan berpakaian yang bagus pula. Lalu ibu bayi tersebut berkata; 'Ya Allah ya Tuhanku, jadikanlah anakku ini seperti laki-laki yang sedang mengendarai hewan tunggangan itu! ' Ajaibnya, bayi itu berhenti dari susuannya, lalu menghadap dan memandang kepada laki-laki tersebut sambil berkata; 'Ya Allah ya Tuhanku, janganlah Engkau jadikan aku seperti laki-laki itu! ' Setelah itu, bayi tersebut langsung menyusu kembali kepada ibunya. Abu Hurairah berkata; 'Sepertinya saya melihat Rasulullah shallallahu 'alaihi wasallam menceritakan susuan bayi itu dengan memperagakan jari telunjuk beliau yang dihisap dengan mulut beliau.' Rasulullah shallallahu 'alaihi wasallam meneruskan sabdanya: 'Pada suatu ketika, ada beberapa orang yang menyeret dan memukuli seorang wanita seraya berkata; 'Kamu wanita tidak tahu diuntung. Kamu telah berzina dan mencuri.' Tetapi wanita itu tetap tegar dan berkata; 'Hanya Allah lah penolongku. Sesungguhnya Dialah sebaik-baik penolongku.' Kemudian ibu bayi itu berkata; 'Ya Allah, janganlah Engkau jadikan anakku seperti wanita itu! ' Tiba-tiba bayi tersebut berhenti dari susuan ibunya, lalu memandang wanita tersebut seraya berkata; 'Ya Allah ya Tuhanku, jadikanlah aku sepertinya! ' Demikian pernyataan ibu dan bayinya itu terus berlawanan, hingga ibu tersebut berkata kepada bayinya; 'Celaka kamu hai anakku! Tadi, ada seorang laki-laki yang gagah dan menawan lewat di depan kita, lalu kamu berdoa kepada Allah; 'Ya Allah, jadikanlah anakku seperti laki-laki itu! Namun kamu malah mengatakan; 'Ya Allah, janganlah Engkau jadikan aku seperti laki-laki itu! Kemudian tadi, ketika ada beberapa orang menyeret dan memukuli seorang wanita sambil berkata; 'Ya Allah, janganlah Engkau jadikan anakku seperti wanita itu! ' Tetapi kamu malah berkata; 'Ya Allah, jadikanlah aku seperti wanita itu! ' Mendengar pernyataan ibunya itu, sang bayi pun menjawab; 'Sesungguhnya laki-laki yang gagah itu seorang diktator hingga aku mengucapkan; 'Ya Allah, janganlah Engkau jadikan aku seperti laki-laki itu! ' Sementara wanita yang dituduh mencuri dan berzina itu tadi sebenarnya adalah seorang wanita yang shalihah, tidak pernah berzina, ataupun mencuri. Oleh karena itu, aku pun berdoa; 'Ya Allah, jadikanlah aku seperti wanita itu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		}
	]
}