{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6572,
			"arabicnumber": "2577.01",
			"text": "Telah menceritakan kepada kami ['Abdullah bin 'Abdur Rahman bin Bahram Ad Darimi]; Telah menceritakan kepada kami [Marwan] yaitu Ibnu Muhammad Ad Dimasyqi; Telah menceritakan kepada kami [Sa'id bin 'Abdul 'Aziz] dari [Rabi'ah bin Yazid] dari [Abu Idris Al Khalwani] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam dalam meriwayatkan firman Allah Subhanahu wa Ta'ala yang berbunyi: \"Hai hamba-Ku, sesungguhnya Aku telah mengharamkan diri-Ku untuk berbuat zhalim dan perbuatan zhalim itu pun Aku haramkan diantara kamu. Oleh karena itu, janganlah kamu saling berbuat zhalim! Hai hamba-Ku, kamu sekalian berada dalam kesesatan, kecuali orang yang telah Aku beri petunjuk. Oleh karena itu, mohonlah petunjuk kepada-Ku, niscaya Aku akan memberikannya kepadamu! Hai hamba-Ku, kamu sekalian berada dalam kelaparan, kecuali orang yang telah Aku beri makan. Oleh karena itu, mintalah makan kepada-Ku, niscaya Aku akan memberimu makan! Hai hamba-Ku, kamu sekalian telanjang dan tidak mengenakan sehelai pakaian, kecuali orang yang Aku beri pakaian. Oleh karena itu, mintalah pakaian kepada-Ku, niscaya Aku akan memberimu pakaian! Hai hamba-Ku, kamu sekalian senantiasa berbuat salah pada malam dan siang hari, sementara Aku akan mengampuni segala dosa dan kesalahan. Oleh karena itu, mohonlah ampunan kepada-Ku, niscaya aku akan mengampunimu! Hai hamba-Ku, kamu sekalian tidak akan dapat menimpakan mara bahaya sedikitpun kepada-Ku, tetapi kamu merasa dapat melakukannya. Selain itu, kamu sekalian tidak akan dapat memberikan manfaat sedikitpun kepada-Ku, tetapi kamu merasa dapat melakukannya. Hai hamba-Ku, seandainya orang-orang yang terdahulu dan orang-orang yang belakangan serta manusia dan jin, semuanya berada pada tingkat ketakwaan yang paling tinggi, maka hal itu sedikit pun tidak akan menambahkan kekuasaan-Ku. Hai hamba-Ku, seandainya orang-orang yang terdahulu dan orang-orang yang belakangan serta jin dan manusia semuanya berada pada tingkat kedurhakaan yang paling buruk, maka hal itu sedikitpun tidak akan mengurangi kekuasaan-Ku. Hai hamba-Ku, seandainya orang-orang yang terdahulu dan orang-orang yang belakangan serta semua jin dan manusia berdiri di atas bukit untuk memohon kepada-Ku, kemudian masing-masing Aku penuh permintaannya, maka hal itu tidak akan mengurangi kekuasaan yang ada di sisi-Ku, melainkan hanya seperti benang yang menyerap air ketika dimasukkan ke dalam lautan. Hai hamba-Ku. sesungguhnya amal perbuatan kalian senantiasa akan Aku hisab (adakan perhitungan) untuk kalian sendiri dan kemudian Aku akan berikan balasannya. Barang siapa mendapatkan kebaikan, maka hendaklah ia memuji Allah Subhanahu wa Ta'ala. Dan barang siapa yang mendapatkan selain itu (kebaikan), maka janganlah ia mencela kecuali dirinya sendiri.\" [Said] berkata; [Abu Idris Al Khaulani] ketika menuturkan hadits ini, sambil berlutut.' Telah menceritakannya kepadaku [Abu Bakr bin Ishaq]; Telah menceritakan kepada kami [Abu Mushir]; Telah menceritakan kepada kami [Sa'id bin 'Abdul 'Aziz] melalui jalur ini. Namun Hadits Marwan lebih lengkap lagi dari keduanya. Abu Ishaq berkata; Telah menceritakan kepada kami mengenai Hadits ini, Al Hasan dan Al Husain -kedua anak- Bisyr dan Muhammad bin Yahya mereka berkata; Telah menceritakan kepada kami Abu Mushir. -lalu mereka menyebutkan Haditsnya dengan panjang lebar.- Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Al Mutsanna] keduanya dari ['Abdush Shamad bin 'Abdul Warits]; Telah menceritakan kepada kami [Hammam]; Telah menceritakan kepada kami [Qatadah] dari [Abu Qilabah] dari [Abu Asma'] dari [Abu Dzar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda dalam meriwayatkan dari Allah Tabaraka wa Ta'ala: \"Aku telah mengharamkan kezhaliman kepada diri-Ku dan hamba-Ku, maka janganlah kalian saling berbuat zhalim…dan seterusnya dengan Hadits yang serupa. Namun Hadits Abu Idris yang telah kami sebutkan lebih lengkap dari ini",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 70
			}
		}
	]
}