{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6627,
			"arabicnumber": "2603",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] dan [Abu Ma'an Ar Raqasyi] dan lafazh ini milik Zuhair. Dia berkata; Telah menceritakan kepada kami ['Umar bin Yunus]; Telah menceritakan kepada kami ['Ikrimah bin 'Ammar]; Telah menceritakan kepada kami [Ishaq bin Abu Thalhah]; Telah menceritakan kepadaku [Anas bin Malik] dia berkata; \"Ummu Sulaim, yaitu ibu Anas, mempunyai seorang anak yatim perempuan. Pada suatu ketika, Rasulullah melihat anak yatim tersebut dan berkata: 'Oh kamu rupanya! Kamu memang sudah besar tapi belum dewasa.' Mendengar ucapan tersebut, anak yatim perempuan itu kembali kepada Ummu Sulaim sambil menangis. Kemudian Ummu Sulaim bertanya; 'Ada apa denganmu hai anakku? ' Anak perempuannya itu menjawab; 'Rasulullah telah mengatakan kepada saya bahwasanya saya belum dewasa dan saya tidak akan menjadi dewasa selamanya.' Mendengar pengaduan anak perempuannya itu, akhirnya Ummu Sulaim pun segera keluar dari rumah dengan mengenakan kerudungnya untuk bertemu Rasulullah. Setelah bertemu, Rasulullah shallallahu 'alaihi wasallam Iangsung bertanya: 'Ada apa denganmu ya Ummu Sulaim? ' Ummu Sulaim menjawab; 'Anak perempuan saya mengadu kepada saya bahwasanya engkau mengucapkan kata-kata yang menyedihkan hati anak perempuan saya yang yatim.' Rasulullah shallallahu 'alaihi wasallam balik bertanya: 'Apakah maksudmu hai Ummu Sulaim? ' Ummu Sulaim mulai menjelaskan; 'Kata anak perempuan saya, engkau telah mengatakan bahwasanya ia tidak akan menjadi dewasa.' Mendengar keterangan itu, Rasulullah pun tertawa dan berkata: 'Hai Ummu Sulaim, tidak tahukah kamu apa yang pernah aku syaratkan kepada Tuhanku? Sesungguhnya ada syarat yang harus aku penuhi terhadap Tuhanku. Aku berkata; 'Ya Tuhanku, aku hanyalah seorang manusia. Aku dapat bersikap ridha sebagaimana orang lain dan aku juga dapat marah, sebagaimana orang lain. Apabila ada seseorang dari umatku yang tersakiti oleh kata-kata ku yang semestinya tidak layak aku ucapkan kepadanya, maka jadikanlah hal tersebut sebagai pelebur dosa dan sebagai pahala yang dapat mendekatkannya kepada-Mu di hari kiamat kelak.' Abu Ma'an berkata; 'Lafazh yatimah yang disebutkan tiga kali dalam hadits ini seharusnya diucapkan dalam bentuk tashgir (panggilan untuk makna kecil), yaitu dengan bunyi yutaimah (si yatim kecil)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 124
			}
		}
	]
}