{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"48": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6853,
			"arabicnumber": "2699.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Abu Bakr bin Abu Syaibah] dan [Muhammad bin Al 'Ala Al Hamdani] -dan lafadh ini milik Yahya- dia berkata; telah mengabarkan kepada kami, dan berkata yang lainnya, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Barang siapa membebaskan seorang mukmin dari suatu kesulitan dunia, maka Allah akan membebaskannya dari suatu kesulitan pada hari kiamat. Barang siapa memberi kemudahan kepada orang yang berada dalam kesulitan, maka Allah akan memberikan kemudahan di dunia dan akhirat. Barang siapa menutupi aib seorang muslim, maka Allah akan menutup aibnya di dunia dan akhirat. Allah akan selalu menolong hamba-Nya selama hamba tersebut menolong saudaranya sesama muslim. Barang siapa menempuh jalan untuk mencari ilmu, maka Allah akan memudahkan jalan ke surga baginya. Tidaklah sekelompok orang berkumpul di suatu masjid (rumah Allah) untuk membaca Al Qur'an, melainkan mereka akan diliputi ketenangan, rahmat, dan dikelilingi para malaikat, serta Allah akan menyebut-nyebut mereka pada malaikat-malaikat yang berada di sisi-Nya. Barang siapa yang ketinggalan amalnya, maka nasabnya tidak juga meninggikannya.' Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair] telah menceritakan kepada kami [Bapakku] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakannya kepada kami [Nashr bin 'Ali Al Jahdhami] telah menceritakan kepada kami [Abu Usamah] mereka berkata; telah menceritakan kepada kami [Al A'masy] -telah menceritakan kepada kami Ibnu Numair- dari [Abu Shalih]. Sebagaimana di dalam hadits Abu Usamah Telah menceritakan kepada kami Abu Shalih dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam berkata dengan lantang, -sebagaimana Hadits Abu Mu'awiyah, hanya saja di dalam Hadits Abu Usamah tidak disebutkan; memberi kemudahan kepada orang yang kesusahan",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 48
			}
		}
	]
}