{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"48": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6884,
			"arabicnumber": "2710.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abu Dawud] telah menceritakan kepada kami [Syu'bah] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Ibnu Basysyar] telah menceritakan kepada kami ['Abdurrahman] dan [Abu Dawud] mereka berdua berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dia berkata; aku mendengar [Sa'd bin 'Ubaidah] menceritakan dari [Al Barra' bin 'Azib] bahwasanya Rasulullah shallallahu 'alaihi wasallam pernah menyuruh seseorang apabila dia hendak tidur, untuk mengucapkan; \"ALLOOHUMMA ASLAMTU NAFSII ILAIKA, WAWAJJAHTU WAJHII ILAIKA, WA-ALJA'TU ZHOHRII ILAIKA, WAFAWWADHTU AMRII ILAIKA ROGHBATAN WAROHBATAN ILAIKA, LAA MALJA'A WALAA MANJAA MINKA ILLAA ILAIKA, AAMANTU BIKITAABIKALLADZII ANZALTA WABIROSUULIKALLADZII ARSALTA \"Ya AIlah ya Tuhanku, aku berserah diri kepada-Mu, aku serahkan urusanku kepada-Mu dengan berharap-harap cemas, karena tidak ada tempat berlindung dan tempat yang aman dari adzab-Mu kecuali dengan berlindung kepada-Mu. Aku beriman kepada kitab-Mu yang telah Engkau turunkan dan aku beriman kepada Rasul-Mu yang telah Engkau utus.\" Apabila dia meninggal dunia pada malam itu, maka dia meninggal dalam kesucian diri (fitrah). Namun [Ibnu Basyar] di dalam Haditsnya tidak menyebutkan lafazh; 'di waktu malam.' Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari [Al Barra' bin 'Azib] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada seseorang: Hai fulan, apabila kamu hendak tidur -sebagaimana Hadits Amru bin Murrah- namun dia menggunakan lafazh; dan aku beriman kepada Nabi-Mu yang telah Engkau utus.' Apabila kamu meninggal dunia pada malam itu, maka kamu meninggal dalam kesucian diri (fitrah). 'Dan apabila kamu bangun kembali di pagi hari, maka kamu telah memperoleh kebaikan.' Telah menceritakan kepada kami [Ibnu Al Mutsanna] dan [Ibnu Basysyar] mereka berdua berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] bahwasanya ia mendengar [Al Barra' bin 'Azib] berkata; Rasulullah shallallahu 'alaihi wasallam menyuruh seseorang, -dengan Hadits yang serupa.- namun dia tidak menyebutkan kalimat; 'Dan apabila kamu bangun kembali di pagi hari, maka kamu telah memperoleh kebaikan",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 77
			}
		}
	]
}