{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"52": "Characteristics of the Day of Judgment, Paradise, and Hell"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7066,
			"arabicnumber": "2798.01",
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengkhabarkan kepada kami [Jarir] dari [Manshur] dari [Abu Adh Dhuha] dari [Masruq] berkata: Kami duduk didekat [Abdullah] dan ia tengah berbaring. Seseorang mendatanginya lalu berkata: Hai Abu Abdurrahman, seseorang bercerita didekat pintu gerbang Kindah, ia mengira bahwa tanda-tanda (kebesaran berupa) kabut datang lalu merenggut nyawa orang-orang kafir, kabut itu mencabut nyawa orang-orang mu`min seperti kondisi selesma. Abdullah duduk kemudian berkata dengan marah: Wahai sekalian manusia, bertakwalah kepada Allah, barangsiapa diantara kalian yang mengetahui sesuatu, hendaklah mengatakan seperti yang ia ketahui dan barangsiapa diantara kalian tidak mengetahui, hendaklah mengucapkan: Allahu a'lam, karena orang yang paling tahu diantara kalian adalah yang mengatakan untuk sesuatu yang tidak ia ketahui: Allahu a'lam, karena Allah Azza wa Jalla berfirman kepada nabiNya: \"Katakanlah (hai Muhammad): \"Aku tidak meminta upah sedikitpun padamu atas da'wahku dan bukanlah Aku termasuk orang-orang yang mengada-adakan.\" (Shaad: 86) Saat Rasulullah Shallallahu 'alaihi wa Salam melihat orang-orang berpaling, beliau berdoa: \"Ya Allah, (turunkanlah) kelaparan seperti kelaparannya Yusuf.\" Masruq berkata: Mereka pun tertimpa kelaparan yang menyerang segala sesuatu hingga mereka makan kulit dan bangkai karena lapar. Seseorang dari mereka melihat ke langit seperti wujud kabut lalu mereka mendatangi Abu Sufyan, ia berkata: Hai Muhammad, kau datang memerintahkan untuk menaati Allah dan menyambung silaturrahim, kaummu telah binasa, berdoalah kepada Allah 'azza wajalla untuk mereka.\"Maka tunggulah hari ketika langit membawa kabut yang nyata, yang meliputi manusia. inilah azab yang pedih\" hingga fimranNya \"Sesungguhnya kamu akan kembali (ingkar).\" (Ad Dukhaan: 10-15) ia berkata: Apakah siksaan akhirat akan dihilangkan?\"(Ingatlah) hari (ketika) kami menghantam mereka dengan hantaman yang keras. Sesungguhnya kami adalah pemberi balasan.\" (Ad Dukhaan: 16) hantaman keras adalah perang Badar. Tanda-tanda asap, hantaman keras, kematian dan ayat tentang (kemenangan) Romawi telah berlalu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 22
			}
		}
	]
}